{"tweets": "I’m SO honored to have 2 nominations at the 2019 @AMAs! 🙌🏽 You can vote on Google every day here: https://t.co/oD4Vvcs3Vb #AMAs https://t.co/jGqz3YPT0H It will be an honor and a privilege to perform #lovemeanyway with @ChrisStapleton at the #CMAawards this year!❤ https://t.co/r5X2IMwlZk In Oregon Wine Country, One Farmer’s Battle to Save the Soil https://t.co/TUDIjCQRXe Yaye!!!!! https://t.co/FbQox9jpk6 RT @dani_swedish: I can’t even put in words how beautiful love is. Music and love that’s all this world needs (+🍷).\nSo sweet of @Pink to gi… No one even told me that album was #1. https://t.co/Kk3F2JFnRj When does it ‘Hurt 2b Human’ for you? Who shines a light in your life and helps you thru it? Go to https://t.co/szk61AKZhd to watch the #Hurts2BHuman BTS video ft. @thegreatkhalid and join the #H2BHCommunity by sharing your story❤ https://t.co/ONCe9QpDfI Well that’s fun 🤗 https://t.co/15AEYOtXuv 😱 https://t.co/DCmhpK8ZPt Are you in the Columbus area? Ride a Vtwin motorcycle? Then come ride w/ @hartluck on @GoodRide !!! Help us raise money for veterans while having a great time. Can’t make the ride? You can purchase an entry for a veteran. https://t.co/w7Whv9C0PH I love you so! And your whole family❤️❤️❤️ https://t.co/KPE12RFN2j ❤️❤️❤️❤️❤️ https://t.co/WAWeIH6maq Thank you @LewisCapaldi for your song. I was able to teach my daughter harmonies for the first time. It was pure magic #someoneyouloved Thank you my friend and fellow goddess and all around bad ass. You’re one of the few people I wouldn’t pick a fight with lolol. https://t.co/NAZqKtBH3t I’m in love with this and with all of you. Thank you for being amazing and generous humans https://t.co/u0J28OhHMe Jesus! I want to learn that. Wrabel do it with me. https://t.co/5zrbwAQMeA Hurricane Dorian is the strongest hurricane in Bahamas history, destroying 50% of homes in affected areas. Here's how you can help children and families impacted: https://t.co/N6hYfuzjth @UNICEFUSA https://t.co/0Xj4aw2ekm Home sweet home. #womenwhoride #killerbootsman #livefastrally #bandofbrothers #supportourveterans https://t.co/se26SsCepd RT @UNICEFUSA: UNICEF Ambassador @Pink is featured at Rockefeller Center with the new #StatuesforEquality initiative by duo @GillieandMarc!… That love right there https://t.co/BDu8QiijRO So you’re saying kindness is not an option for you. And you’re a self help expert? https://t.co/soYQLqeUFi I’m happy to see people coming to the defense of The Duke and Duchess of Sussex. The way people treat her is the most public form of bullying I have seen in a while. It’s out of control. Let’s all be a bit kinder, huh? Let’s show our children that it’s cool to be kind. RT @USATODAY: \"We really ought to stop allowing Trump’s toxicity to dominate and inflame the national conversation — and stop inadvertently… We all love you so 🥰 https://t.co/TtGYKlM0Qw Yaye. Music to my ears ❤️ https://t.co/mzpADzftbM That’s incredible! https://t.co/vnK8uM0aJY I believe there is nothing “better” than being a human being.Each country has their beauty,+their struggles. We should all be thinking humans first. And I also believe art is meant to cause dialogue, which the posting of this poem just did. Dissent is the cornerstone of democracy https://t.co/WR7RzibTd9 So many of you sent me photos of your GORGEOUS kiddos with awesome colored and styled hair. I would repost but I don’t want them to get any shade for their fabulousness. Most important? All these kids look SO HAPPY 😄 #allthatmatters Beautiful photo 😍😍😍 https://t.co/owpOxYA11l 😀😍😍😍 https://t.co/uUaIHtEcDu 🤘🏽🙏❤️😭🥰 https://t.co/IEkUaqX4XO ❤️❤️❤️❤️ https://t.co/YIUWUfQKxc ❤️❤️❤️ https://t.co/H7Q39M5Uwh ❤️❤️❤️❤️❤️ https://t.co/adoqmoESdc Beautiful! HAPPY PRIDE 🌈 https://t.co/0JiNOxyqoG Yes!!!! What a little rocker I love her 😍 https://t.co/GXzDyqDsyS Thank you 🙏 was a magical night, nights, moment https://t.co/T0uPcm4dnG Yep https://t.co/ORwzxnzIQt RT @Alyssa_Milano: Google this guy. And then don’t let him be the voice of the American people. LOVE IS LOUDER. https://t.co/2SGfglKECt RT @RepresentPledge: IF you want to get more girls excited about pursuing careers in STEM, THEN you show them how women in STEM are changin… Yaye dad!!!! ❤️❤️❤️❤️ Yaye you two!!!!! https://t.co/tQS7E05LEw And this is our president, ladies and gentleman.... holy shit this can’t be real life https://t.co/nngIELmcqP Wow. Just wow https://t.co/YWYG0502vY Two years ago already? From what about us video shoot https://t.co/GPPGBQgKus This made me cry. https://t.co/1WdSNMN9ms BBC News - 'Yolocaust': How should you behave at a Holocaust memorial? https://t.co/Bh3Zp2GLKg Happy Full Moon 🌕 ❤️❤️❤️ https://t.co/mdfMp8rkX2 😚🤩❤️😍 https://t.co/R4z1d2TRck Oh my goodness. This girl just broke my heart open. https://t.co/NKUFoAZ2Zd Congrats to the women of the #USWNT !!!!!!! I am!!!!! 👩🏼‍🎤🙋🏼‍♀️ https://t.co/uDiuneiP1v 😍 https://t.co/UFBCbZwI9e Ahhhh! Awesome!!! https://t.co/GfXpTUDoEX That’s amazing https://t.co/VeeGIVgk4V Yes!!!!! All of this yes!!!!!!! You’re STUNNING!!!!!! https://t.co/tN4bYCe7f2 ❤️❤️❤️ https://t.co/BrNU4FxX8Y Isn’t @vancejoy the greatest?! https://t.co/bTfqRw9zBB Thank you! What an amazing photo!!! https://t.co/UyQqJqH7aE Thank you for all of it :) https://t.co/yWomIRsKp5 I like it Rufus. My kind of person. https://t.co/gaEprgMu4V This is amazing ❤️ https://t.co/Tw63zCWYyX This makes my heart full https://t.co/KtxbE9CamH Wooohooooooo welcome!!!! https://t.co/mKdLwDrXrd Haha! https://t.co/VZgieXoRXU I’m sorry she’s having a hard time with that awesome hair cut and color. Happy she’s brave enough to follow her heart though. Being “normal” is boring. https://t.co/RNdIrqPazI Hey girl hey!!!!!!! ❤️❤️❤️❤️ https://t.co/hqIwc8MZy5 You all were absolutely amazing and willow and I LOVED IT!!!!!! https://t.co/5PriYc2H7a \"Can we pretend that we all end up okay? I just wanna forget with you.\" ✨ #CanWePretend video out now! https://t.co/sxA7pTpG7x https://t.co/sxD9IE9XGj #rockwerchterfestival was amazing! Thank you all ❤️❤️❤️❤️ https://t.co/RgSf6uzuXg Aimeè I am so sorry you missed my show. I hope you’re feeling better and I’m sednimg you all of my love. Get better quick. ❤️ https://t.co/wcckj7X4lG Ooooh pretty https://t.co/8NkmMRgm8V ❤️❤️❤️❤️❤️❤️ https://t.co/KkBPHxEly6 😭😭😭😭😭 ruining my makeup!!!!! ❤️❤️❤️❤️ so happy to be singing to you tonight https://t.co/NtsIPatzbb ❤️❤️❤️❤️❤️ https://t.co/9PLGiG880Q I just got to see my friend @Wrabel  play 90 Days the way he intended it when he wrote it. It broke my heart all over again. You are incredible sweet heart. ❤️❤️❤️ https://t.co/gRKENzaKjA Love this https://t.co/hrgfKr8mku Happy birthday!!! https://t.co/R82XYgtbnp Love this!!!! https://t.co/0EfTT2k0Wi Hi beauties! https://t.co/zxn9tbfnX1 Yaye!!!!! 😍😍😍😍 https://t.co/LcmCe6reZy This summer, 6 out of 7 hungry kids won’t get the summer meals they need. That’s why I’m teaming up with @NoKidHungry to #ShareSummer with hungry kids. Text ‘FOOD’ to 877-877 to help kids in your neighborhood find free summer meals. https://t.co/FxZ7TwnoCZ https://t.co/yLzh01NFTN 💜 The more we live our truth, the more we inspire others to do the same 🌈 https://t.co/mcpMxvKjE1 #pridearoundtheworld #prideparty https://t.co/0woOfLJI7t Dublin 📸 : @amacfly https://t.co/f8oGOujKTz ❤️💔❤️ https://t.co/PbYz4tToCz “If you’re just some habit that I gotta break, I could clear my system in 90 days...” https://t.co/SdJL3SKIdV https://t.co/OmVIPHOmPS ❤️❤️❤️❤️❤️ https://t.co/SGNrNPV8wF Very interesting read. Timely, as I took my 8 year old to Anne Frank House today in Amsterdam. https://t.co/syeZfsRqtK Congrats to DALLAS, he deserves this for sure. However, in the effort of accuracy; don’t let me get me was not his idea, nor did it come from his perspective. Not even a little bit. Nope. Congrats though! 🤟🏾❤️ https://t.co/tKq2k8lPn4 Take that take that take that https://t.co/yzlnmGyAGp ❤️❤️❤️ https://t.co/hdxINVOP6O 😛😛😛🤩🤩🤩❤️❤️❤️🤟🏾 https://t.co/cHZxeggxS5 This was the best thing to wake up to ❤️❤️❤️❤️ https://t.co/cx89npxDp9 ❤️❤️❤️❤️ https://t.co/NaGS5hIrkm Best. Ever. Madison Square Garden  https://t.co/6xMwS7WoI1 RT @QCpatdive: Thank you @pink for being so nice to my girls in the crowd tonight. They were so happy that you saw their signs. Mama was in… ❤️❤️❤️ https://t.co/fPd5nfhpK7 ❤️❤️❤️ https://t.co/4UVAZbsuYb Thank you for coming 🙏 https://t.co/M5Qx4g9wtu 💋💋💋❤️❤️❤️❤️❤️❤️❤️❤️❤️ https://t.co/pzQcW1FDCM Hahaha! That’s funny. https://t.co/F53Y7Vqrnq Thank you for this. https://t.co/A2RUTKyPnx RT @perlapell: I am pro women’s’ lives. Our bodies and souls are important. Rape victims lives are important and need protection. We will d… Wow 👀 https://t.co/X4DMWxMbBG RT @JessicaValenti: If you want to know what kind of men are legislating your body, a Republican who just voted to pass the 8-week abortion… RT @Cosmopolitan: Abortion fact of the day: According to @PPact, in 1965, abortion was so unsafe that 17% of all deaths due to pregnancy an… Thank you!!!!!!!!!! https://t.co/RsrIICyoAk https://t.co/Z0hwIshvY6 RT @PadmaLakshmi: I know there are a lot of men out there who have partners who've had abortions. It's time for you to speak up and be alli… RT @PadmaLakshmi: If you identify as male in America today you should be HORRIFIED about this. Take that feeling and turn it into action by… RT @QasimRashid: In Alabama, Ohio, &amp; Georgia you can't harvest organs from someone who died w/o their consent—but you can force an 11-year-… RT @PadmaLakshmi: Absolutely. The time for men to speak up is now. https://t.co/sNVRv1t4fR RT @RussTamblyn: Where is men’s outrage for what is happening to the rights of women right now? Where are the men journalists, politicians,… RT @andrewzimmern: Thanks @padmalakshmi\n\nA thousand times #himtoo ... \nWe all, men and women, need to stand up to this horrific roll back o… RT @PadmaLakshmi: Amen https://t.co/9Z26reFANH https://t.co/srOh2llsgT https://t.co/GrWzcm4pzD https://t.co/1vJpN2f8uZ https://t.co/qjo4X83Vk9 https://t.co/H8rWLn1ddP Honest to God I don’t know after all these years, I don’t know how you do it @GreysABC as soon as I start feeling numb, all I have to do is watch one of your episodes. Then I get all my feelings back. Other than my children, and music...you’re the quickest way to my heart. Dammit 😇😇😍😇😇 https://t.co/PUzxZWJZT0 And happy Mother’s Day to all Wishing all of you good health and good vibes Im a performer+a mother who gives 100% of herself and leaves everything on the stage.U bought tickets to see a human being Not a robot.apologize for any inconvenience this sore throat and cold has caused your family.\nI hope to see you in August. I want to personally send to all my Toronto people, my sincerest and humblest acknowledgments. I have somehow avoided sickness this entire tour until now.\nI’ve done everything in my power not to repeat last years misery of flus and sickness. I’ve done an amazing job until today. RT @idolator: It just gets better with each listen. @Pink's 'Hurts 2B Human' is one of 2019's best albums: https://t.co/fD15bbC9Cx https://… RT @PopCrush: Here are this week’s top three albums on the Digital Albums chart: \n• Hurts 2B Human - @Pink\n• Chip Tooth Smile - @ThisIsRobT… Thanks for coming and spending time with me.\nI’m really happy you had a good time https://t.co/WJBxxQDaf5 OMG this means more to me than you all know.\nYou all just gave me the biggest hug you have no idea. Thank you, too. https://t.co/z36GWk8PMH Beautiful!!!! https://t.co/aU1uWiRfGL Hahaha that’s sooooo weird https://t.co/JxPeEq2cVi This is awesome! https://t.co/iGlWZIZsG5 I’m up at 2 am trying to figure out what food to cook for my daughters 8th bday. I have a serious momming problem. Please someone hit me in the head so I can go to sleep 💤 Thank you make-a-wish for all that you do ❤️ https://t.co/8RpZ7uMK74 ❤️❤️❤️❤️💃🏼❤️❤️❤️❤️ https://t.co/13dx4T25w1 Lexington owns my friggin heart. https://t.co/q8p8TwnNjS ❤️ https://t.co/GAYm1iCI3Z Wow! Thanks for coming!!!! https://t.co/vO3Xvd1iSH Sweet memories ❤️ https://t.co/5vEiKKGvrj Thank you 🙏 https://t.co/VLoBpOmKRW This makes me so happy!!! https://t.co/GiGSJKWche I love you Simon!!! https://t.co/QxMpfC6mkW RT @chartdata: 'Hurts 2B Human' is @Pink's third consecutive #1 album on the Billboard 200. I need to thank all of my loyal friends that have been hanging with me strong for all these years  and even the newbies. Thank you for listening and for opening your hearts to me after all this time. Hurts 2 B Human but we’re in it together. Now someone cuddle me while I cry. 🏆 WE DID IT!!!!!!!!!!! Thank you everyone!!!!!!!!! https://t.co/D4Xw3Dpoqo WHAAAAAAAAAT?!?!?!?!?!?! https://t.co/2lUZlDcYTL ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ https://t.co/NsjQTbEWqs Fuck it that’s awesome! Seeing as I’ve only had 8 of them. Hahahaha someone buy me something liquid!!!!! And thank you to all my peeps!!!!! GRATITUDE!!!!!! Willow better not roll her eyes at me tomorrow cuz I’m fancy AF https://t.co/WX7DR4UBED If I got to choose one thing to eradicate in this world- it would be bullying. Bullies are cowards. Period. Or as my own kid would say “they just need a hug”. Parents: teach your kids to be kind first. Everything else follows https://t.co/4yLmODj9AX I saw you, as a mom, on Twitter, bravely sharing your experience and that it brought you and your daughter to me. There was only one thing to do. And that was to find you and tell you that I see you. Your daughter is incredible, and so are you. This letter just made me ugly cry. https://t.co/4yLmODj9AX Thank you everyone ❤️🤯 https://t.co/FiSjGHNIDp Beyond my wildest imagination..... thank you 🙏 👀🤘🏽 https://t.co/hDo0AL1ORC Yeah!!! I can hear Barbara Streisand in my head singing “memories,,,,,, all alone in the moonlight.......” https://t.co/WK3wGyVbCn Milwaukee!! I just signed 50 copies of Hurts 2B Human 💕We’re gonna randomly mix them in with all the albums that are on sale at the merch stands - tonight only! Go buy the album for a chance to walk away with one of the signed copies 🤗 Listen to the new album #Hurts2BHuman on @pandoramusic now! https://t.co/km7XjCgHg1 https://t.co/flcUWBHYmZ RT @DanReynolds: flawless vocals because well, she’s @Pink - and that outfit is 🔥 \n\nstream her new album “Hurts 2B Human” because it’s amaz… ICYMI: Watch my performance of #Hustle on @JimmyKimmelLive last night here: https://t.co/pO29yqYS3S Had so much fun walking down memory lane with @FBE! Check out the video here: https://t.co/jHuyA65vHj 📹 💕 https://t.co/OJEDsNddhU New Hurts 2B Human vinyl is out now 🙌🏼 💖 Special offer available for a limited time - ends tomorrow May 2nd at 11:59PM EST. Only available at https://t.co/1uQ9p3VX2j https://t.co/XZTthr6Vtj Thanks @AmazonMusic for making #WalkMeHome the Song of the Day! 💃https://t.co/90JtWaH0l0 RT @Spotify: It Hurts 2B Human but it feels good to throw on @Pink's new album 💓 https://t.co/2tMnEPLJ7r https://t.co/rlHmaSepI3 Ha!!!!!!! Yeah team! This is the BEST EVERRRRRRRR https://t.co/RC9NC0bG0q ❤️❤️❤️❤️❤️ https://t.co/v5xGyo0oAZ Oh my gad @CarsonDaly this is the best ever. You are so lovable and I was so happy do this with you. You’re really great. https://t.co/I8heOShv1n https://t.co/kgt1vXy2YY I’m sending you a big long never ending hug https://t.co/sPhREToEvD RT @BookofDani: @Pink i love you for this. \nPutting this here for anyone else who might need it https://t.co/q8JjSFact7 Is there someone close 2 U that you can talk to? Ill tell you this: being 14 can really suck. But not getting to be 15 sucks way harder. Life has ups and downs- u gotta ride the rollercoaster my friend.\nTomorrow could be the best day of your life. You’re stronger than you think. https://t.co/LKCgMHmbe0 Sending you all of my love https://t.co/QCTY73b9F6 This makes me so happy ❤️ https://t.co/dDrjf3YvMc Running a little behind for my Instagram Livestream. Tune in at 7:35/7:40p ET. What questions do you want me to answer tonight? Can’t wait to chat! ❤️ 📺🌟Tomorrow night! Catch me @JimmyKimmelLive at 11:35|10:35 c https://t.co/MFcFVytLMe 👋 Tomorrow I’ll be backstage ready to answer all your questions in real time via Instagram Live at 7pm ET!Can’t wait to chat w you! 💬 ❤ https://t.co/gstITYsL6B This is the BEST lip sync battle I’ve ever seen 🙌🏼 feast your eyes! ‘Walk Me Home’ by @SinkThePinkLDN ❤️ Check it out! https://t.co/X623FttG5y LOVE ME ANYWAYS. Some backstage access for you because Chris Stapleton is the best that ever did it. https://t.co/ORaMB0flSN If there’s any store I hope that never closes for good- it’s Barnes and noble. Please keep giving us real books with real pages. ❣️limited edition #Hurts2BHuman T-shirt + CD bundle available now @Target https://t.co/O4B2pkO0vw Wooohoooooooo thank you world! https://t.co/tP4F29kiBP I love y’all back https://t.co/xTy4b7jFOL Cause he’s the bees knees https://t.co/AalPbqQFEp Listen to #Hurts2BHuman ft. @thegreatkhalid on @applemusic's A-List Pop playlist! https://t.co/tXeSBRUazX https://t.co/jEwWinMkPK RT @Shazam: .@Pink is our Artist of the Week 💙 Listen to her new album #Hurts2BHuman on @AppleMusic ---&gt; https://t.co/g4M1gA6kna https://t.… Thank you @spotify for the billboard love! Listen to the title track from my new album #Hurts2BHuman on #NewMusicFriday https://t.co/vZQH4w5DQD https://t.co/EOke2c5Gf4 ‘Hurts 2B Human’ is out now on @AmazonMusic! #AlexaPlay the new P!nk album. 💓https://t.co/XucG7nZnow https://t.co/YqJpkE6naz 🥰 https://t.co/rahVNMvAus Thank you brother. I love you. What a fucking adventure we’re on. Thank you for joining me. https://t.co/zOGoP6rubh Thank you 🙏 https://t.co/KiJ2ykawts Really? ❤️🤩 https://t.co/muRs5kFTHR Beautiful https://t.co/jcXVrZNQ40 Thank you ❤️ https://t.co/sMfZM6tPKI ❤️❤️❤️🙏🙏🙏 https://t.co/V8DA0Yn5GG My new album #Hurts2BHuman is out now! 💖 https://t.co/c4dTAgESHq #genies https://t.co/PrGdu0dB8L ❤️❤️❤️ https://t.co/AakdPJRijA Thank you https://t.co/ILQzZuOxjK Thanks for the love ❤️ https://t.co/MaPaBL0XKD Thanks everyone for all the love ❤️ https://t.co/yztlFXpoDK ❤️❤️❤️ https://t.co/xyZ845t0HX ❤️❤️❤️🙏🙏🙏🤟🏾🤟🏾🤟🏾🙏🙏🙏 https://t.co/cEhWhWSU6N 😍 https://t.co/kgxdtcQG4b Oh I just love you so much it hurts https://t.co/6SbclqE4hk ❤️❤️❤️ https://t.co/PbnaL6QxnZ RT @martinzvada: THIS ALBUM IS A MASTERPIECE!!! I loved #beautifultrauma so much, but this is EVEN better......... @pink you did THAT! 😍 #H… ☕Catch me bright and early on @thetodayshow tomorrow morning talking about #Hurts2BHuman on release day! https://t.co/5S3ggGc6RI https://t.co/qRt9XGqo2y\n❤️❤️❤️❤️ ❤️❤️❤️ https://t.co/u4kR7nhz2T Ready to get the party started on Saturday night of the Formula 1 US Grand Prix at Circuit of The Americas this November! Tickets available now at https://t.co/bX8pyMyses https://t.co/3tzCUXvN6h Had so much fun on @theellenshow! Watch it here: https://t.co/qrSrD5Ei8s RT @marrowformarley: @Pink We have 3 months to find Marley’s match. PLEASE RT PLEASE PLEASE PLEASE 💜 join the bone marrow register!! Sign u… I love you Ellen. https://t.co/BsBoRQznXP Feeling is mutual my friend. https://t.co/VQstNJibX8 Check out the lyric video for #Hurts2BHuman with @thegreatkhalid made by #Genies! ▶️https://t.co/TvOZt89hgS https://t.co/jTn85CdVJN ✨#Hurts2BHuman feat. the amazing @thegreatkhalid out now! Listen here: https://t.co/Ides5KtnAR https://t.co/bPi2C4pYjc 🚨ONE HOUR ALERT 🚨Listen to #Hurts2BHuman ft. @thegreatkhalid on @zanelowe / @Beats1 at 10AM PST / 1PM EST / 6PM GM 📺Catch me on @theellenshow tomorrow performing #WalkMeHome from my new album #Hurts2BHuman! https://t.co/dAV22Ecti7 TOMORROW ⚡Listen to the title track #Hurts2BHuman ft. @thegreatkhalid from my new album on @zanelowe on @Beats1 at 10AM PST / 1PM EST / 6PM https://t.co/lfdtkByScD My 7 yr old goes all the time ❤️ https://t.co/Oo6VEbBXef I’ll be passing over your head 😜 https://t.co/zxvuJvM7rT Hi babeeeeeSssss https://t.co/q5VmzP7BjJ Wow! Welcome!!!! https://t.co/hqLZON4rHU This is awesome!!!!!! https://t.co/zOb0lF6z5P Amazing!!!!! https://t.co/oMuEUHLJdu This makes me really happy 😃 https://t.co/ZbDfDaUOQm This is so great!!! https://t.co/hU8o3JjCz4 ❤️❤️❤️ https://t.co/UkFyrkilWf Yeah we did:)\nIt’s cause we like to party ❤️🤟🏾 https://t.co/Mi4vKR2SnX Get yourself some therapy! Color the #Hurts2BHuman book on @CTappOfficial and let the creativity flow in the #PinkXct in-app challenge 🎨 Pre-order the album via https://t.co/cCJgrw56Kw and start coloring here https://t.co/e6iMTyFVM5 #colortherapyapp https://t.co/ZXd6lxcntk Excited to announce my collaboration with @CTappOfficial ! Start coloring the \"P!nk - Hurts 2B Human\" book via https://t.co/e6iMTyFVM5 🎨 Look out for the #PinkXct coloring challenge starting soon! #colortherapyapp #everyoneneedstherapy https://t.co/AJB33gKE2z This is what it is right here. Thank you. https://t.co/V4LwDVU57r You’re rad too. https://t.co/u7Yll4kYny We have fun, don’t we? ❤️ https://t.co/6H5SunW5du Happy you’re here! https://t.co/ChoAhVzcmY You’re nuts, but thank you friend. Can I come see you play Joni? I can’t miss that https://t.co/I6zvMSn3A4 This made me laugh https://t.co/blpzyOSQjv I love you guys ❤️ https://t.co/fanM8XpTuE ❤️❤️ https://t.co/e4OQ6O1ti0 How fun!!!!! https://t.co/UZ7bkvBBpn It was an beautiful day that you captured forever, and so beautifully. We had fun ❤️ https://t.co/7UpSvsPwQl Connect via your @Spotify or @AppleMusic account now to get #Hurts2BHuman as soon as it's out and to enter to win a signed album art canvas! https://t.co/eZRsN0V47h https://t.co/Dyc5WlIA9p Thinking of my childhood besties tonight.don’t know why. RIP Stacey and Shavaun. I hope you two are giggling like idiots wherever you are. If you’re reading this and you need help, please reach out to someone. Not even kidding. There’s always someone Listen to #CanWePretend, #Hustle, and #WalkMeHome while you wait for the new album! Pre-add now on @AppleMusic to listen in your library and get all the songs as they're out! https://t.co/9So5IdW0zD https://t.co/kaH7ZQ91b4 \"Can we pretend that we both like the president?\" Watch the #CanWePretend lyric video! 👉https://t.co/rSnzNHDUCy” https://t.co/cNVlyqItbL 💥Listen to \"#CanWePretend featuring @cashcash out now ▶️https://t.co/kHNHpuTgTb https://t.co/kZHks1PH8K Thank you Sacramento!!!!!!! 💃🏼💃🏼💃🏼 https://t.co/IkFwKVujRS Giving everyone a little more of #H2BH! \"Can We Pretend\" feat @cashcash out tomorrow ⏰8AM EST / 1PM GMT / 10PM AEDT https://t.co/FnDDi54i03 That is the cutest ever https://t.co/0bjwTlxShv Have you listened to my 'Top Tracks' playlist on @Spotify yet? Pre-save #Hurts2BHuman now to follow the playlist and get the album as soon as it's out! https://t.co/eBQaZ7SaO5 https://t.co/X9bgFG9brZ ❤️❤️❤️❤️❤️❤️ https://t.co/HYdWfN5ieV @halsey I have a very large and very fun two year old who you can come over and hold any day this week. He punched me in the face six times last night while he was sleeping. 🥰😍😘 https://t.co/tWLjKSS3eM I had so much fun. Thank you 🥰 https://t.co/JnZj294OcT Yesssssssssssss https://t.co/0ytYpltlk3 That was fun to watch https://t.co/ku1WzaMLly That made my day, thanks @jimthecritic https://t.co/6qeWgFyElf RT @drinkpathwater: Here’s how @jackjohnson @fleetwoodmac and @pink are greening up their concerts. https://t.co/yxQD3H6GN8 Calling all moto fans. Does anyone have a copy of Terra Firma, Good Times, Crusty Demons of Dirt, Chapter One, or Wrathchild you wanna sell me or gift me? RT @sonyatvpubuk: The incredible @Pink is BACK with another bang as she builds up to the release of her forthcoming album! \n\nKicking off #T… I’m in https://t.co/555efr94ay Thank you for your service! Honored to have you there tonight 🤟🏾🙏 https://t.co/T6Pqlq0RkU RT @corsaw1969: @Pink Hi Pink - I absolutely love your music and I love the positive message u send to my 2 teenage girls- not once has tha… Woooo hooooo!!!! https://t.co/WpWu3kXdIT Thank you ❤️ https://t.co/nJsfOvQUmj Pre-order the @target limited edition “Hurts 2B Human” T-shirt + CD bundle! ❤️ https://t.co/NusOGYqTAK https://t.co/BgmFBT7eQB RT @DanReynolds: I was lucky enough to work on this song with one of my favorite humans/artists in the world @Pink \n\n“Hustle” https://t.co/… Love you more @thegreatkhalid ❤️❤️❤️ https://t.co/bnCeD4jVvr “Don't hustle me, don't fuck with me\" 🤪New song \"Hustle\" out now ▶️https://t.co/W5tmAl1roE https://t.co/vsq7J7ZmAL 💖Pre-order the new album #Hurts2BHuman out April 26th now: https://t.co/c4dTAgESHq Including \"Hustle\" just released today + #WalkMeHome! https://t.co/oz34IrzfcV https://t.co/hobOwBi3Md If you wanna go behind the scenes with me, click here! https://t.co/sUWlX5onn2 #WalkMeHome https://t.co/xgcyKHw8PQ 😍🥰😘 https://t.co/oJSr0a4OEm This makes my heart so happy 😍 https://t.co/evEimozAAB A must read https://t.co/l1lgxFXDa6 😍😍😍 https://t.co/YbNi4nR5Tv Some things you can’t un-see https://t.co/EW1ez3ILKR Want to see official Behind the Scenes photos from the #WalkMeHome music video? Unlock them now at https://t.co/D5vUOErBYe https://t.co/D9ajhp7yjd And also virgos are always on time it’s a thing ❤️ https://t.co/HAi9DhjdyR I did! I saw her and I LOVE HER! https://t.co/HacZAms9M8 Beauties! San Antonio was one of my favorite nights! #gratitude https://t.co/ZgieKFh5Zu It’s an honor and a privilege https://t.co/4r94a2uF7q 😍😍😍😍 https://t.co/xy3RD6ghEZ Great news! Happy for you! And it’s cause we’re all awesome sauce! Thanks for coming https://t.co/5Ks1GDaoZS ‘Walk Me Home’ official video out now 💃🏼 https://t.co/8fJSxmHvMn  New album - Hurts 2B Human - out April 26 💞 https://t.co/PAO1MB7E0D Thank you from the bottom of our hearts!!!! Can’t wait for the spacewalk tomorrow!!!!! https://t.co/c5Twa9qZFE It's finally here! The 'Walk Me Home' official video https://t.co/8fJSxmHvMn  🎥❤ https://t.co/RqWryGGNEa I saw her! I love her! https://t.co/j0RObyEFpo Top Chef finale has me all in my feelings.... two strong talented women standing up there giving it their all. #imnotcryingyouare Thank you!!!!!! I ❤️ Houston https://t.co/WLL2P3fkig Yaye I love this!!!! https://t.co/ZKDFaPrUvo I think- other than my children, and probably three or four days with @hartluck 😜, I am the happiest on stage, and I have all of the people that join us to thank. Thank you for the group therapy, the exorcism, and the wild uncensored joy. ❤️ RT @seancmichael: The world is a very strange place right now, but we can learn to love one another again.\n#quote from @Pink \n#gottobelieve… Walk me home in the dead of night.... #nextweek https://t.co/LKiYbRrHGy My heart goes out to the people in Christchurch affected by this tragedy... 💔 I’m sorry you lost 💔your dad https://t.co/3bH3Z7JpVr Oh my goodness I love you girls https://t.co/FXpwAsDIEx Aww Yaye! Keep going my friend! 😍 https://t.co/ABNOUWIWo4 This is such a cool photo! Thank you! https://t.co/ZoW5QFiCoN Very difficult to stop at 7.  Willow and I just finished Charlottes Web, (I cried, she didn’t) and now we’re on to land of stories. Book 7. https://t.co/ENx4sUDAJS Book 6. https://t.co/1q7MOWF6bT Book 5. https://t.co/OQ0RqIFmQ2 Book 4. https://t.co/aLuu2petbM Book 3. https://t.co/1sEWpbBpbm Book two. https://t.co/8B7VR3g875 No way. I love you. Surface is one of my favorite songs ever. https://t.co/6QtKKc9GX0 Thank you 🙏 https://t.co/rZ7e8RHpOo I was challenged by @ShwahShig to post 7 books I love, no review, no explanation. I’ll accept that! Here’s my first : https://t.co/f1UX1Jqu6t I like this challenge. I accept. I will post my first book in a moment. https://t.co/mynwUPVaYW Aww I love this!!!! https://t.co/b3EMD867oT Thank you for coming!!! ❤️ https://t.co/fGAbfo5GrG In honor of #InternationalWomensDay2019, visionary female artists take over @AppleMusic. Listen to my playlist: https://t.co/QGfadvOurD #VisionaryWomen https://t.co/hWT8vRSCFX Today, and every day, girls must be empowered with the knowledge, skills and options they need to reach their full potential. Help make this a reality. Donate to @UNICEFUSA this #WomensDay: https://t.co/5At0Myl9zT https://t.co/XwsC4LOsME Thank you so much! https://t.co/ro3GbV7UrC Thank you Brian ❤️ https://t.co/Q8chYmJuN4 Omg you are one of my SHEROES https://t.co/WNQCEoqdPl 😭❤️❤️ https://t.co/tqEP2QvcdQ I love her so much it hurts https://t.co/7BhiO7ysvn Happy birthday!!!! https://t.co/4jeg1PPWYV You did that for me ❤️ I trained singing to you. I LOVE YOU FOREVER https://t.co/mdQTdqfG6R RT @bastilledan: Previously, on... // @BRITs with @Pink\nWatch in full on @YouTube: https://t.co/gfe2Fqp4Zc https://t.co/gWlNyI9OLc My 8 year old self just peed her pants ❤️ #love https://t.co/YCdIdVypcR I just died. https://t.co/YCdIdVypcR I like to strut ❤️ https://t.co/UPVMHXm829 Can ANYONE BELIEVE THIS? I’m having trouble myself.\n🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏 https://t.co/6XkTgw3MAq Ok  APPLE the whole idea you had of making the headphone hole the same as my charging hole is a bunch of bullshit. U know what’s worse? You called it a DONGLE. #bullshit Well that was cool.\nNever heard that before. https://t.co/wQTnUrSofS Hurts 2B Human https://t.co/AF4S4viSYy Human https://t.co/5Hkm2ziEBT I forgot how FULL ON this show is. Day two rehearsals, and i am sore as hell.\n😂 I can’t believe I get to share a stage with as much talent as I do.\nMy team is hands down the best of the best. I’m so proud. It’s so good. We can’t wait to get this back up and moving. Friyaye 🤟🏾 https://t.co/AIKvSzElkX 2B https://t.co/RelHrXFgKK ⚡#NewMusicFriday Billboard! Thanks @spotify 💓 https://t.co/ZkjzTgFgPJ https://t.co/XGdg9KyKlp Hurts https://t.co/OrdcaKK2LC RT @MTVMusicUK: 🙌 @TheGreatKhalid and @Pink are our sort of friendship goals 🙌 #BRITs https://t.co/eSCAxdUa59 👀 Head to https://t.co/1dun5H8oYd for the first teaser of the 'Hurts 2B Human' album cover! I think my mother would say VERKLEMPT 😂🥰😍❤️🙏✊🏾🌈⚡️🔥 thank you everyone I’m grateful for all of the positivity and I hope this song makes you feel as good as it makes willow feel screaming from the backseat https://t.co/qd9bajxWUN Me also ❤️ https://t.co/7V77CxvEh0 ❤️ @BritishGQ @BRITs https://t.co/Is6sddVurd This made my heart smile https://t.co/uTmo34kV91 You are ❤️❤️❤️ https://t.co/Ec0BhlvCWQ You’re the bestest!!!! 😍🥰❤️ https://t.co/18JzKX2Kpa RT @thisisheart: Love @Pink and how she isn't afraid to make a statement 💪 https://t.co/rlss3BIz0u Best day ever https://t.co/MPn1G91Mqc I love you girls and I can’t wait to start our band #forsaken with @bastilledan 😬😂☺️ https://t.co/EPvE31mQwU Well today is turning out to be a great day! ❤️ https://t.co/kSZpDDxl8i ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ https://t.co/ewscw9Mg02 ❤️ https://t.co/EczEoXv0Tr ⚡ #WalkMeHome out now! Listen to it here https://t.co/b5qjoYYX1B https://t.co/8eHBm10Epg “Walk Me Home.” Out this week. Set a reminder now on @YouTube to be notified as soon as it’s available https://t.co/9YMFh6uwT2 ⏰ 12AM PST / 8AM GMT / 7PM AEDT https://t.co/94UQFDxwsB I’m so excited for The Brits 🔥 “Walk me home in the dead of night…..”🌙 Coming Soon!!! https://t.co/GbgzB9fwpR The story going around about my slashing tires is from 2003. I have not harmed a car in 15 years. #reformed #twenties #passion #tires I think it’s kind of rad that I just lost my 20th Grammy nomination. I’m always honored to be included. Now to get this sick baby in the bathtub. Congrats to all the nominees! Have fun tonight. Im not sure who’s butt I like better https://t.co/yjua88HcT8 And you have mine you talented motherf’er. Thanks to you for my favorite moment https://t.co/XZjkIxyGCg Favorite song by a favorite woman https://t.co/FqX1zBYXNV About to kick off #CitiSoundVault at the @hollywoodpalladium can’t wait to see you here!! 💖@citibank Honored and thrilled https://t.co/X1T6RUNOx7 Hey everybody!💕 If you’re coming to the upcoming 2019 tour, get the Limited Edition Pass for early access to the show AND a digital download of my new album ‘Hurts 2B Human’! xoxo https://t.co/379mLVAvfc https://t.co/fh2BR43U58 ❤️❤️❤️❤️ https://t.co/yiHZOyVQXQ Hey y’all! I’m SO excited to share new music with everyone!! ❤️  Announced today on @TheEllenShow! My new album ‘Hurts 2B Human’ feat. “Walk Me Home” Coming Soon!!! Yay!! https://t.co/PAAAXpsilC When something good happens in your life, do you know how to feel? ..... https://t.co/nik4n1nIKF If you’re in Hollywood and want to see me get my Star 🌟 tomorrow, come to Hollywood and Highland at 11:30 am! Me and the fam bam will be celebrating x Well I certainly vote for willow. https://t.co/V8DSBlxomb ROCK N ROLL!!!!!! SOOOOOOO GOOOD I MISS THIS https://t.co/qZ2EJ0it7x Holy hoarse Batman https://t.co/LyduLJqXAC https://t.co/2ZUBD8DLv3 Happy New Years New Zealand and Australia and everyone else in consecutive time zoney order To everyone who supported @UNICEFUSA's lifesaving work last year, THANK YOU! Let's make 2019 a brighter one for children around the world. https://t.co/GiWKOpbTYO Imagine a world where every child has safe drinking water, a full stomach, a safe place to go to school &amp; a life free of violence. It starts with you joining forces with UNICEF to reach every child in need. A child’s first happy holiday #StartsWithU: https://t.co/WcjPkO5V07 And here’s a baby Echidna. You’re welcome. https://t.co/Uzszm4E7tz In the interest of saving internet space... this here is a Hart Family PSA. There is gonna be a shit load of motorcycle riding, chocolate eating, fun having, and naked dance parties going on. Now we know. Now we can get back to the other dumb shit we were doing. 🤗 THANK YOU 🤟🏾 https://t.co/fFTu9Aa7t3 Daaaaaammmn https://t.co/PMS2RmblyQ About to watch the documentary about Mr. Rogers and I think I’m going to be a better person for it. 😍 And yet I feel like the lucky one. This made me laugh though I’m not gonna lie https://t.co/qks2xR94jj Wow that’s absolutely stunning and cheers to you https://t.co/fSTSitVk84 Sending you the warmest and biggest hug ❤️ https://t.co/BBUvlRU2Di 😍❤️😍 https://t.co/ITARDPm6Io Yaye it’s finally here!!! The Greatest Showman: Reimagined is out everywhere! ❤️ https://t.co/RFgRfprpFR RT @TheEllenShow: One of the reasons I love the firefighters, first responders and the people of California, is we don’t place blame or mak… @LairdLife you’re a friggin mensch (hero) RT @tedlieu: Dear @realDonaldTrump: What is wrong with you? Disaster victims deserve help &amp; sympathy.\n\nOh, and guess who owns much of the f… RT @tedlieu: Dear @realDonaldTrump: FYI below from a first responder. Can you please get a briefing from your staff before you write anymor… RT @mariashriver: California firefighters are the best there is, but what they are facing is daunting and life threatening.\nPlease hold the… RT @katyperry: This is an absolutely heartless response. There aren’t even politics involved. Just good American families losing their home… I just donated to Los Angeles Fire Department Foundation! https://t.co/feXMqnpiOQ via @keeladotco This is the best thing I have ever seen https://t.co/nhv4IAVRlA Just need to say THANKYOU to all of the firefighters. All of the first responders. All of the helpers. The thing to look for in tragedy is all of the helpers. We’re all so grateful for your bravery and selflessness. Can’t get #1 and #2 outta my head but very happy to be #3. #luckynumber #thanksgreatestshowpeople https://t.co/lwOk2I8Zt1 Our pleasure, good\nSir. 😍😍😍 https://t.co/AXFv079886 RT @etnow: 🎶 @Pink and her daughter Willow have us in full on tears rn. 😭 #TheGreatestShowman (🎥: Atlantic) https://t.co/bJz6jFkMQ7 Willow &amp; I recently had the awesome opportunity to sing together one of our all-time favorite songs #AMillionDreams 💞 Check out the new album The Greatest Showman: Reimagined! And here’s a link to the full video of our recording session https://t.co/AfaRtSdoB0 https://t.co/gthbN6Jrb9 NORWAY. DENMARK. Let’s do this!!!👊🏼  #beautifultraumatour https://t.co/MXdVDcMQFP https://t.co/cI5VuNDP0y https://t.co/v7uwNb28Hk BRAZIL!!!!!!!!!!!!!! Our time has come! Finally! Rock in Rio. It’s happening. October 5, 2019 @rockinrio https://t.co/EUDTF5Xg6X Ok Europe! FINALLY I get to share with you the plans for my tour next summer! Can’t wait to see all your beautiful faces 😍 Check out the dates and details here: https://t.co/MXdVDcMQFP and https://t.co/cI5VuNDP0y #beautifultraumatour https://t.co/FsilP0vYUZ Europe! I’m coming for you!!! Keep an eye out for more details this Tues, Oct 16! 😉 #beautifultraumatour https://t.co/44i4BiXnR8 And if that isn’t inspiration to persevere- I don’t know what is. (I’ve had 866 singles, lol) https://t.co/JBhg0PyUKr SO freakin honored to be nominated at the 2018 @AMAs! ❤️ Here’s where you can vote: https://t.co/iOZ6z1A4KC @Pink Favorite Artist Adult Contemporary #AMAs https://t.co/QcBM5B6QF0 Goddammit @LauraDern I just finished “The Tale” and I am all cried out. I didn’t think that was possible. What a performance. 🙏 I would like it to be on record that Jameson’s first curse word was BOMB ASS CHICKEN 🙏❤️🙏 thank you 🙏❤️🙏 but now I’m home, it’s 5 am and everyone wants to be asleep right now and it’s boring https://t.co/9xEBY2DF0Y You all are THE BEST❤️ we’ll miss you https://t.co/xayUQDyT2f Thankyou Sydney, the last two nights have been magical. The last 3 or so months have been both amazing &amp; challenging for my family and I, but I remain forever grateful for the time we’ve had together in your beautiful country &amp; for the years of friendship and memories. 42 shows!! So happy you’re both here!!! 😍😍😍😍 https://t.co/t0ZlOYMTx0 Safe Home. Safe Passage. Safe Destination. Take meaningful action to keep vulnerable children on the move safe at every step. Here's how you can help #ChildrenUprooted: https://t.co/iZZCs10u1s #AChildIsAChild @UNICEFUSA https://t.co/cm9nsutfSo I see you thank you!!!! 😍 https://t.co/oxV38B0oPf ❤️❤️😍😍 https://t.co/3aN9rJoHGf Man I’ve been to some cool bars around the world, and Dead shot on Ponsonby road is not one of them. 👎 Thank you Auckland! Dunedin! New Zealand! What a heavenly trip we’ve had! You gave me life!!!! #gratitude Yaye!!!!!! https://t.co/6HxIhtCata Hahahahaha this is all time!!!! https://t.co/FcnDW0FTLR @hartluck is hilAAAAARIOUS. I’m 39!!!!!!!!!!!!!!!!!! (He’s just mad cause I’ll always be younger than him) Yaye! This makes me sooo incredibly happy thank you see you tomorrow https://t.co/q8BRacN4w6 You guys should totally get together and do a PSA - but NOT IN MY TIMELINE THANKYOU https://t.co/BXpTb9Sisz ❤️❤️❤️❤️❤️❤️ https://t.co/hnNQSPX1Qj Oh god seriously? This is seriously what you wanna be known for saying? https://t.co/dorUZBFiUP Thankyou for being here with us https://t.co/xG4rDXRWPn Who are you: JUSTIN DERRICO, guitar player a.k.a Spanky. WHAT IS YOUR FAV SNACK/SHOW/SONG: “sour cream and onion pringles. Show: it’s always sunny in Philadelphia, fav song: little wing,… https://t.co/sAnwn8DWfD Next up!!! ❤️❤️❤️Who are you: REINA MARIELA HIDALGO VEGUERI CARRILLO MIRANDA, but you can call me Reina Hidalgo.  My fav snack/show/song: “my favorite snack are gummy bears”. Why do you… https://t.co/ZOhScBVyDi First up! Mark Schulman! Drummer extraordinaire!  Fav snack: “chips and salsa” fav show: “scrubs”  fav songs: “lately (Stevie) for no one (Beatles) what is hip (tower of power)”. Why do… https://t.co/CIVZ5wP6Wn Yo! https://t.co/XhtwaZhJa4 AUCKLAND!!!!! 1st of 6 tonight!!!! ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ Rihanna! ( That’s two votes from willow and I ) https://t.co/qMLHK5SpXo Hahahahahaha I always fucking miss you https://t.co/rjYP0EtpfL ❤️❤️❤️❤️ https://t.co/Bx6vCU720S Oh I love you girls so much https://t.co/vWe1SafbwH Thankyou! https://t.co/hvc4nC8q74 RT @BetteMidler: Now Trump’s saying Democrats are going to be “violent” if they win big in November? What are we going to do? Throw our PBS… That makes my heart happy 😊 https://t.co/DEQrRqS46v So rad😍 https://t.co/5FEIuVIepS ❤️❤️❤️❤️ https://t.co/Ie4cA5YZ1r ❤️❤️❤️❤️❤️ https://t.co/pcnhTL54ji Can’t even believe we did it again and this is our last night in Melbourne 😢 let’s celebrate!!! https://t.co/KalvJo4h9m ❤️❤️❤️😍❤️❤️❤️ https://t.co/EZBF7yxEN6 😓 https://t.co/KKZa3RL0zu ❤️❤️ https://t.co/2rqRdmQioE Well that’s a pleasant surprise!!! 😍🤟🏾❤️ https://t.co/9w6bwK4GiS @hartluck and I have been lucky enough to ride through Ireland, Germany, Austria, Australia. It’d be hard to pick a favorite. I rode with my dad through the mountains in North Carolina and he rode behind me. He was nervous, lol, but he told me after that I was a really good rider https://t.co/RCIosJXuUX Yes. I’ve been riding my own for 16 or so years now. I’ve had triumphs, Harley’s and Indian motorcycles and have ridden all over the world. I grew up on the back of my dads bike. First accident at 9 years old. It’s a passion in our family. https://t.co/4LQMNf7xZj Atwyld is a rad company you should check out. https://t.co/U9GGgNKJoS Why the Sturgis Motorcycle Rally — and the rest of the industry — needs to attract women, via @mic https://t.co/2QMVXTS1k9 Okay this is sooooo awesome ❤️❤️❤️ https://t.co/TdRY8qt7Gj Umm, yes you do.\nIt’s right next to your keys 🙄 https://t.co/vXiNhHnewa K first of all those eyes of yours are sooo beautiful  why wear sunglasses?! ❤️❤️❤️ https://t.co/QSoznifew6 Okay but she’s already cooler than I’ll ever be https://t.co/EQAsgVV1UK Wow😍 you my friend are incredible! Keep kicking ass!!!!!!!! Sending you a big hug https://t.co/meypbFTwId And you’re one of the all time GREATS when it comes to celebrating that. you’ve been the artistic architect of this very thing for decades. All love and all gratitude and all respect to you https://t.co/0iHmWFPZ1i Gosh I love you, and not just because we agree https://t.co/1cZHoMAsUa RIP Aretha 💔 Thank you Lucy!!!!  ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️.     Pink sings and soars above as Brisbane crowd holds its breath https://t.co/pqNU9JBlob via @brisbanetimes Luna Park is such a special place to me and my family. We’ve shared some incredible memories there - it’s one of the places we most look forward to visiting when on tour. I hope Luna Park is around forever and ever and ever!!! 😍 #savelunapark https://t.co/Ywv5bvnsHy Rolling stone did an article tonight on concerts, and how moving forward,\nIt’s all about the spectacle. I kindly disagree. It’s about the songs. It’s about music. Bells and whistles are extra, and awesome. You just have to be good. Okay so tonight was really friggin special. Thank you love bugs of Brisbane. 2/7 #wowzah ❤️🙏❤️🙏❤️🙏 https://t.co/TSnKU8jbNU Thank you so much! https://t.co/6B6wimhAZs Thanks heaps!!! ❤️❤️❤️❤️ https://t.co/4Ls5w8BVRh I actually feel like we are all just celebrating who we are, and living out our memories from when that song happened, or just letting go of things we no longer need to hold on to.\nIt feels like the best kind of party slash therapy. https://t.co/u7cZidbbyR I love our time together. I love knowing that people like you exist. This world is crazy as shitballs now , but there’s rad people everywhere. So- thank you. Tonight- you are my “grateful”. ...matter. I can’t tell you how full my heart is from spending time staring into your eyes and singing with you and waving at your kid and dancing with you. I NEED to tell you all how friggin awesome you are. Every night, when I look out at you, and see your faces (and I can see all of you) I am so blown away by how good you are. You’re all different, different ages, different people. But you’re all so loveable and you make my life.. Brisbane!!!!!!! ❤️❤️❤️❤️❤️❤️❤️ ready for 1 of 7? ❤️❤️❤️❤️❤️❤️ RT @TODAYshow: This guy's hilarious video nails every parent's frustrations at Disney World https://t.co/GWaz2CL1UE Damn this made me dance in the car https://t.co/RLBpPZLIIi Hi Jess!!!!! Nice to cyber meet you:) I’m sending you a bear hug too but a gentle one cause you’re 10. https://t.co/U8U3GF2nfQ And I’m sending another bear hug. This one is stinky though cause I just got off stage. ❤️ https://t.co/qZWH4bK8WK I’m grateful for you ❤️ https://t.co/TgfBvZUZVb What’s everyone’s thoughts on this eyeball enlargement thing in photographs? Am I the only person that’s seeing the alien eyes? Thanks so much!!!! ❤️❤️❤️ https://t.co/aaLzrzDLum Thank you!!! ❤️❤️ https://t.co/sSxGsp3OPB Sonja, I’m sending you bear hugs and sunshine and love and more love. And then even more love ❤️ https://t.co/HuZuRIZY8s ❤️❤️❤️❤️❤️❤️❤️ https://t.co/eWAuWVI3Dd ❤️❤️❤️ https://t.co/g1eOHtU9QS We’re not leaving for a couple more days, but I already miss Sydney. #lovethiscity Go to my Instagram page for an update RT @SonyMusicAU: We wish @Pink a speedy recovery and hope she feels better soon. ❤️ Sending Love. https://t.co/B2X1G38Iym Yes please https://t.co/Vo9ojJTB3Y Sydney friends: does anyone have a favorite place that makes wellness shots and fresh juices for when I get there? Thanks in advance. And how do we feel about Neti- pots. They scare me. Hi my Sydney friends. It is with great frustration that I bring you this news:( Friday’s show will be postponed. I was hoping a couple of days of rest would help me kick this sick, but not at the speed I was hoping for. I appreciate your well wishes and understanding + I’m sorry. If you don’t already know about these guys you MUST check out @therubensmusic!! They’re on tour with us here in Oz and they are amazing! I ❤️ their song “Never Ever” - SO GOOD! https://t.co/EaAoIivUbY RT @markyplanet: Melbourne, let’s do this again tonight! @Pink #beautifultraumatour show number 9! @RodLaverArena @EvaGardner @markyplanet… I’m beyond happy you’re here too https://t.co/WoMX8fydz7 Yo!! I’m so psyched to share my new music video for “Secrets” with all of you! My dancers and I filmed this after a show in Perth at a rad artsy warehouse thanks to #FringeWorldFestival. Check out the new video here! https://t.co/RPnP39GB11 https://t.co/dS8D0EHaiL I did❤️ but we’re the animals https://t.co/Q3xQCSSX5K Thankyou Melbourne 🙏 #nightfourisoveralready? #seventogo #weloveithere #itrustthismanveryverymuch @KhasanB84 https://t.co/RYU4FEj3hu You’re a natural!!!!!! I knew you could fly. Thank you for having me, you’re one of my sheroes. https://t.co/Mkt4T7ggpb ❤️❤️❤️❤️ https://t.co/1dFBzNNjZZ There is just so much disgrace happening around us, but what I told my daughter today over a hot chocky is the truth: the world is full of so many awesome, good, people who just want to love and be loved, and there are so many more good people than bad. Beautiful!!!!! ❤️❤️❤️❤️ https://t.co/RgAGATxaaW F yeah get it gurls!!!!!! https://t.co/k90X7w68jq I’m coming for you Calvin! 5 years later and we finally meet. My heart is so full tonight. ❤️❤️❤️❤️ thank you Melbourne for making one of the sweetest memories of my life. Calvin, Mom and Nana, I love all 3 of you dearly. And this is the good side of Twitter. https://t.co/GYkgEQyofu Thank you, but I’ll take you and all the peeps around the world and the shows anyday over awards. Happy to be mentioned. All love ❤️ https://t.co/5Np9dfY0Zl Yes I did!!!! ❤️❤️❤️🙏❤️❤️❤️ https://t.co/Hn3ywo2P8k Don’t make me cry when I’m getting my makeup done ❤️❤️❤️❤️❤️ https://t.co/NjFAKenNUe Let’s do this!!!! https://t.co/TKcCDgYmFa Yes!!!!! ❤️❤️❤️❤️ https://t.co/s0ukLBCRkU Will do! See you tonight! https://t.co/DDaHQZG2gG Thankyou!!! https://t.co/eJ2VcknShB Thank you 🙏Melbourne 📷 credit Adriana Balic https://t.co/2VV0flzpwH You look 🔥🔥🔥🔥 https://t.co/wkU3Of7Akh Samurai Teppanyaki House in Adelaide. The most delicious and fun meal we’ve had in a long time!!!! Thank you Super Chef! #jackandsuperclark #delicious https://t.co/MD1eaD4Ym7 ❤️❤️❤️ yes I did! https://t.co/eSUeA338Na 😭😭😭😭😭😭😭😭😭 https://t.co/lbmFm5bboQ You better saaang 😍😍😍😍 https://t.co/4TRSYdMRdj This summer, find free #SummerMeals for kids and teens in your neighborhood by texting FOOD to 877-877 - it's as simple as that.  #NoKidHungry https://t.co/7fpvtGfthZ ❤️❤️❤️❤️❤️ https://t.co/wpLrn1X8d2 Woohooo thanks everybody! Four billion thanks ❤️❤️❤️ https://t.co/TNnQPoSVq8 Congrats @DanReynolds happy for you friend. Glad you’re feeling good ❤️🙏 Great photo hahahahaha but nope. Fake news https://t.co/PTV2cZXVL2 RT @DanielCribb: My thoughts on @Pink's @PerthArena show tonight. Should probably sleep now. https://t.co/gqNgAU4Dwb RT @mariashriver: It is unprecedented and unsettling to see the verified @WhiteHouse @Twitter account attacking @SenWarren @SenKamalaHarris… RT @Alyssa_Milano: If you’re not terrified. You’re not paying attention. https://t.co/i2BE22scgm Jet lag is LITERALLY a mother f*cker RT @JuddApatow: Everyone in this country should be as mad as Rep. Tim Ryan.  Everyone should be furious that places like @FoxNews and the M… RT @TheDailyShow: “Tender Age Shelter” is a hell of a fancy way of pronouncing “Baby Jail.”\nFull piece: https://t.co/S7npS060Nk https://t.c… Why don’t we publish that list right here? Please send it to me! https://t.co/5Aqvru0Uuy Sooo... the tooth fairy doesn’t give out $100 bills. Not the one that comes to our house. Papa does, because he’s nuts, and it was a bet to pull her tooth out. She went for it, and didn’t even flinch- cause she’s a bad ass. Correction complete 😍 https://t.co/d8rgO1ja2e The scale of the child refugee crisis is staggering. This #WorldRefugeeDay, children forced from their homes need our help now more than ever: https://t.co/9ARmJOXGPN #AChildIsAChild @UNICEFUSA https://t.co/MGc9N0PWxf Humanity does not come with a green card https://t.co/xz1pb9QaWp RT @SenJohnMcCain: The administration’s current family separation policy is an affront to the decency of the American people, and contrary… RT @mariashriver: Now would be a good time for Ivanka Trump to show what it means to be an advisor on women’s issues, a proponent of female… This is not a fact. Song was written by myself and Billy Mann. https://t.co/tf3zWoEiZj To all of us who voted today; nice job. Every one else should just shut up and sing Yep this totally works https://t.co/OKg7oUSVfb Seriously can we bring back stories about nuns adopting rescue puppies? And Girl Scouts donating money to shelters? I’ll clarify my “news”\nComment before it becomes a blshit story. The current climate is that everything is bad. And a lot of it is. But there are so many beautiful people in this country who don’t subscribe to any of this horseshit. We all get along. We believe in decency. Also(very important)my favorite part of the shows/crowds so far in America have been exactly what the news and social media don’t want you to believe; this/our world is diverse and beautiful. And you have all shown up, co-existing peacefully and even lovingly. We r better 2gether ❤️❤️❤️ https://t.co/wQGWnU0q7K And that’s a wrap on our first round of US dates! Thank you to every single soul that joined me in the last several months. Grateful beyond measure. It took me a long time to be able to tour like this in the US and it’s the most fun show ever. Next up: Australia❤️💕❤️ https://t.co/ETAzWEWWtV Gluten free pretzels, Pinot noir, and some queen sugar season 3.... mama is happy 😃 Where’s your family from,\nOriginally? https://t.co/jZwCNALQub https://t.co/1gECcugQ2o Ya tease 😍 https://t.co/adhrIF1D5i Oh yeah? How come? https://t.co/wDYFE7PVPW Thankyou😍❤️😍 https://t.co/N1IGU1CHuZ Reading this book with tears in my eyes!!! Thank you to everyone who was a part of it- it means so much to me https://t.co/NyjyA8l2hA RT @SteveCarell: #MemorialDay https://t.co/syrJAeCxhU RT @JimCarrey: 1500 innocent children ripped from their mothers’ arms at our border. Lost in Trump’s “system”. Give us your tired, your poo… Ok this @snowpatrol record is bananas. I’ve always loved them but now our love is forever #wildness 🕺🏽 congrats friends 😍😍😍❤️❤️❤️😍😍😍 thanks @latimes   Pink was as relatable as she was spectacular at the Honda Center https://t.co/LMwI2iMwfC See you soon! You’re probably gonna get some messages :) https://t.co/Wbo9pshnpo Yaye!!!!!!!❤️❤️❤️❤️ https://t.co/ecLPPC0GwO ❤️❤️❤️❤️❤️ https://t.co/m0SH6fpWl9 Thank you for being with me tonight!!! https://t.co/8n5Ytqorxt This makes me happier than you know https://t.co/WPXL8CLrzP What?! Anaheim you rocked my socks off my feet. How amazingly awesome was that? Thankyou!!! RT @PPOSBC: Thank you,  @Pink for inviting to your #BeautifulTraumaTour and for supporting women’s rights! #StandWithPP https://t.co/RuwKpL… 💕😍❤️ https://t.co/culpeSisOj Ha! https://t.co/aUb36btLOJ ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ https://t.co/RWWKo9i4a8 Title X gives women access to contraception and more control over their lives, health, careers &amp; economic security — and a gag rule takes that care away. #NoGagRule RT @headlineplanet: This week's top female artists on Billboard:\n1) @pink\n2) @iamcardib\n3) @Camila_Cabello \n4) @taylorswift13\n5) @dualipa\n6… Ohhhhh I love this 💕❤️💕 https://t.co/tyR7AgLVD5 😍😍😍😍😍😍😍😍 https://t.co/lJu5tPwAOv I felt the same way 😍😍😍😍 https://t.co/yGnTsR31dn Yaye! Thank you for being there ❤️ https://t.co/YcWxNHQcRG Congratulations!!!!!!!!! 🎈🎉🎊 https://t.co/nypcP6D9uq Wow amazing!!!!! https://t.co/HaAgnEtFM2 RT @chartdata: Billboard Artist 100: #1(+38) @Pink [106 weeks]. *re-peak; second week at #1* Wow I love this!!!!! https://t.co/qI2XX9qx2U Yeah maybe.... what makes you the most uncomfortable? Write  about that https://t.co/W3f0951tyU This makes me really damn happy thank you https://t.co/PwueYYQ1vZ Yes please. I really like food ❤️❤️❤️ https://t.co/s9qn7DPC2N You’re rad!!! Thankyou! https://t.co/HHHV0l4a63 I am so sorry for your loss. I’m sending you a big hug and a high five https://t.co/8dNburXHwF I. Love. You. https://t.co/u6cbL4NC4s And who else noticed my album back at number two after all this time? I did! 😍❤️😍 https://t.co/kuPidrPlBh Oakland. Jesus h....... Magical tonight. Thank you for being so awesome. Beyond awesome. See you again tomorrow ❤️ RT @camilluddington: I have struggled with what to tweet today. So I’m RTing this. https://t.co/CSripBRerP Even babies sleep sometimes:) moms? Never https://t.co/VCQ1VL7Onp Just watched WONDER. so if I look like I need BOTOX tomorrow, it’s cause I was crying happy sad happy tears. What a WONDERful film. See what I did there? 😭👀😥😥😥😥😥❤️❤️❤️❤️❤️❤️ Also- i love you Julia Roberts @ChefsCycle is happening right now. This time last year I was cycling 100 miles to raise money to feed our kids who need support. The chefs are at it again, 300 miles in 3 days. Amazing feat, amazing humans. I’m there in spirit. And if the spirit moves any of you... @nokidhungry With #UNICEFKidPower, kids are empowered to get active to save lives. Here's how you can help bring this @UNICEFUSA program to more classrooms across the country: https://t.co/iHjWq2yHlT https://t.co/G1Ma5J4JKX You know I will! I’ll call it “the wrinkles and rolls tour” https://t.co/DMXdgyu3dB I am of the mindset that it’s a blessing to grow old. That if your face has lines around your eyes and mouth it means you’ve laughed a lot. I pray I look older in 10 years, cause that will mean I’m alive. 🤙🏼 You must be from la. Well, there are a few people left in the world that choose to age naturally. And I’ve earned every fucking minute of my 38 years. How you lookin though? Cause I never heard of ya til you put my name in your mouth. I shall call you little purple troll. https://t.co/3WcH2TRrHW I’m so happy I got to see you https://t.co/oc6MHCacaT Ummmmm.... yum https://t.co/LNnvtXiNzf I love this and feel you and it’s all worth it. Strong is our goal. ❤️❤️ https://t.co/VoI1ausq2e I have a new idea for a holiday. National NO SNARK DAY who’s with me?! https://t.co/fBLdQGtkuI Hardworking and Hungry: We need policies that support hard working moms https://t.co/Xm7PUJINKB @nokidhungry On Mother’s Day I wanna give a shout out to all the mamas out there busting their butts to put food on the table and love in the hearts of their little ones. I salute you. Thankyou Vancouver for such a magical night. I’m never anything but grateful. ❤️❤️❤️❤️ https://t.co/uoi67858eN Hey Europe! I haven’t forgotten you! How could I?! ❤️ I’m coming to see you in summer 2019!! ❤️❤️❤️ Thankyou for your service https://t.co/WULdPoM8KS ❤️😍 haha I was so worried about their little ears! https://t.co/rgUO4992RR ❤️❤️❤️ https://t.co/IiAyhMLClY See you soon!!!! 💕❤️ https://t.co/nyRJ8vTi7R Hey everybody! Presale tickets for my newly announced shows are available now for Citi card members! Get tix &amp; more info at: https://t.co/v1rpOd5jAR https://t.co/G9XlVLZumL SOOO excited to announce more Beautiful Trauma tour dates in 2019! 😍👏🏼💖 More details here https://t.co/OtOBMZGkiE. Register NOW for #VerifiedFan presale: https://t.co/buXfaTdjvG. Okay the last lines made me want to 😭 cry. See you soon! https://t.co/dCK5B4GBqR That’s so rad! https://t.co/RiQQQm7fgM This makes me so happy :) https://t.co/9wMEfMHuwE Good man😍 this makes me so happy https://t.co/rUyCDbCYLU Night two Houston and we’re coming in hot 💕 https://t.co/TxkUzAq31F How come I get mad when you turn away from me in the middle of the night, but then I get even more mad when you turn TOWARDS MEAND TAKE HALF MY PILLOWWWWW RT @paulocoelho: If you think you understand yourself \nYou don’t understand yourself I wish 💕🙏 https://t.co/XrnRsPAzMF RT @ScaryMommy: If you want to test your love for your husband, watch him load the dishwasher and remain silent the entire time. RT @RWitherspoon: 💪 https://t.co/fyizwa1z5y Tonight was so magical- Thank you to each and every one of you that came out tonight and brought your whole selves https://t.co/NuG3yuR6Il Thank you!!! https://t.co/sJ54NSw6Fz Your hair is amazing!!! https://t.co/qd3BN36P2A Apparently the Houston Rockets are killing it in the playoffs!! To be safe and ensure I get to see you guys, we moved the Sun 4/29 show to Fri 4/27 so we can still party together two nights in a row. See you soon!!! 😍 Aww babe it’s the thought that counts so thankyou so much https://t.co/qla81uMGk8 RT @RWitherspoon: What an inspiration this woman is! https://t.co/N5kP9TIT47 Cannot wait https://t.co/evsmkt88cL This book is blowing my mind. Oh I have so much to learn. https://t.co/2SfCHH0SUO SO honored to be on the cover of #TheBeautifulIssue with my kiddos 😍 😍😍. Thanks @people! https://t.co/3P7oKhahlU If anyone needs a new show to watch: QUEEN SUGAR. It’s incredible, heartbreaking, and beautiful. RT @people: .@Pink is the cover star of our 2018 #TheBeautifulIssue! The Grammy-winning artist opens up about parenting and more: https://t… Hannah! You friggin rockstar! You got it!!!! We love you 😍 https://t.co/PhwPkrLxg3 Woke up to this random and awesome news 😍 thanks @billboard https://t.co/U7X878lFFI I love you @MissyElliott ❤️ https://t.co/0nillTSLcW Ugh!!!!! 😍❤️😍 you can join this circus any day:) bring the kids 😍❤️😍 https://t.co/o5DilHauJu Still thinking about ishkabibble’s from yesterday 😍😍😍 Thankyou!!!!! https://t.co/75JF84fZDK Awww I love you so much @juliamichaels . You are so present and poised and you have more talent in your pinky then the rest of us put together. You too are a badass https://t.co/lAJLkMYfCY Love this so much!!!!! https://t.co/VoI1auK1qO Hometown!!!!!!!!!! https://t.co/apASsjpB96 I love him too https://t.co/crLY5FAOie Is there more video? Can her and I be best friends? https://t.co/eem7JXEK1d 🤔 https://t.co/8a0m9RmmOF I loved seeing you !!!! https://t.co/BZ0euzbMUV Me too😍😍😍😍😍 https://t.co/xCBMqZLK8Q Yaaaasssss those are my two favorite fingers!!!! https://t.co/6KPU13tDMs Thankyou for sharing this. Makes my heart want to burst https://t.co/n0qdMWdgCv This makes my cheeks hurt from smiling!!! https://t.co/AJRcIe6YTA Hi!!!! ❤️❤️❤️❤️❤️ https://t.co/4Gj2E3yLEY @andyhusbands @TheSmokeShopBBQ @NoKidHungryMA Hell yeah!!!!! I mean yes please! Thankyou so much everyone 😍😍 https://t.co/NxXkii0p3S Total friggin honor 💃🏼  Check out my cover of ‘Bennie and The Jets’ with Elton &amp; Logic! Featured on REVAMP - an album celebrating songs by Elton John &amp; Bernie Taupin. #EltonREVAMP https://t.co/EpvbHyOoMy Love you friend https://t.co/tW88JlE2Gs Thanks for coming:) 💥❤️ https://t.co/efiPbkWKiT RT @TheGarden: “I feel like Billy Joel right now. Two nights at The Garden?!” - @Pink #PinkMSG https://t.co/NjNYiFcC7J You’re incredible 😍 https://t.co/XAqXv3IHNG RT @lisa2628: @Pink please RT!!! Just a simple RT from you 1000's will see it x x https://t.co/MI62Z5AD5v I ❤️ @bleachersmusic and I ❤️ @jackantonoff https://t.co/xdYhK2bdjb ❤️ https://t.co/2Kw3qN26jj 👩‍❤️‍💋‍👩 https://t.co/PAuvAnrLZc RT @hartluck: Willz doing her make up for mama @pink show tonight in Cleveland. #MyLittleTeenager @ Quicken… https://t.co/ZuEQUZcabE RT @heidiklum: I love @ChildrensLA and all the amazing work they do!  Please join me in supporting the #MakeMarchMatter campaign. Visit htt… ❤️❤️❤️ glad you’re feeling better https://t.co/CJOkABptZN That means the world to me. Thankyou for your service and Thankyou for coming tonight. I’ll keep it forever.  ❤️ https://t.co/p0wbLWu2zc Sorry for my potty mouth ❤️ https://t.co/OiNu4BGKFM Thankyou ❤️💕😍 https://t.co/SuwbYtJs9q ❤️❤️❤️❤️❤️ I wish I could have my hair braided. https://t.co/AXhelxojSo I sure did!!!!! Thankyou Louisville!!! https://t.co/GEuw01i9Zf Wish I could give you both a big hug ❤️ https://t.co/I2gCTtfS2B ❤️❤️❤️❤️❤️❤️❤️ give her a big squeeze from me please https://t.co/olNLvq5bnI I hope so too!!! ❤️ https://t.co/P757NvAA7V Incredible https://t.co/Ld4oyqLmP5 https://t.co/yD0FhIcLIH https://t.co/gtpf6ChD2U Thank you from the bottom of my heart Toronto, and MLSE LIVE for the generous donation on our behalf to The 519, which supports LGBTQ, Girls Inc., and the children’s breakfast clubs. So beyond grateful ❤️❤️❤️ https://t.co/INI3Dzo30d So grateful! So fun xo https://t.co/Z6xumjzxDr Those are gorgeous!!!! https://t.co/GVsRspGDzN 💕💕💕😍😍😍😍❤️❤️❤️❤️❤️ https://t.co/25JaxHyIAL This needs to win something!!!!!! So adorable! https://t.co/Pro5nxxnIX 💕💕💕💕💕💕💕💕💕💕💕kick cancer’s ass ladies https://t.co/6nTz59hWnE Nope. I only have the one twitter account https://t.co/g7KpKogFzv Yikes. Do I even wanna know https://t.co/dUIkRzouGa You were not lying!!!! It was amazing tonight Thankyou ❤️ https://t.co/yma19baKCA This kills me. I always have to pinch myself that I get to sing with him @cityandcolour https://t.co/eTxpJ673xJ Thanks @GreysABC I’m now going to eat my feelings ❤️❤️❤️❤️❤️❤️❤️❤️😍😍😍😍 https://t.co/IC7Og7arDS Oh this is amazing https://t.co/Ijm6z3Suwu Hi. You’re mom is a badass, and I’m sending love and light and strength and hugs and kisses and screw that cancer. https://t.co/ToBGVRYrtF I promise you I’m doing everything humanly possible to save it. Fingers crossed. https://t.co/aLGxeT1wSD Congratulations tired mama.\nWhat a beautiful crazy time you’re in ❤️ I wish I could but instead I send you all my love and little baby angel kisses for your brand new girl https://t.co/GXdghC7TIy RT @USATODAY: One appointee co-owns a private New York hunting preserve with Trump’s adult sons.  https://t.co/vXFApnMTA4 RT @Alyssa_Milano: Stop what you’re doing and allow this little one to inspire you. \n\nNEVER GIVE UP. https://t.co/CoKJBmsePZ Hahahaha hahahah https://t.co/KUDfm0vUGH Whoever the two little girls were stage right dancing in St Louis tonight- you made my heart burst open with total joy. Hashtag winning https://t.co/cowgt4bZFk ❤️❤️❤️❤️❤️ https://t.co/GfrWnE44He RT @Shmoo06: While @Pink was flying over my head on a bed I took a moment to appreciate @JHuds86 and @KhasanB84 air lamp dancing https://t.… Thank you, Jill. This made my heart happy. https://t.co/JESl5TjRXG What in the F’ing F??? https://t.co/yXwNa9rjX6 Hahahahaha Selma you be careful I will tackle you 😍💪😘 https://t.co/9p1Ff94l4x RT @jonbream: Here’s why @Pink is worth all those !!!! in concert. She soared to great heights @xcelenergyctr. Read @StarTribune review. ht… I just want to hug her https://t.co/50OEUgmXGi Happy birthday!!!!!! https://t.co/Ym8HABpUcz I’m pretty sure I see almost every single human in there. I have tricks https://t.co/7kK8QPhslY I remember that :) https://t.co/spfI8iChmS Willow wins EVERY TIME (except it’s a @UNICEF kid power band and she feeds kids with it but still you know what I’m saying) https://t.co/H9cna5eElp Thankyou 🙈 https://t.co/8PrGfT9Bor My mom would fight you for those words about her love @NeilDiamond https://t.co/nXcvw9DvcC Oh god I’ve never NOT cried at a concert hahaha. But Yaye! Crying is my favorite! https://t.co/0C0ps3pMOZ I saw you tonight! https://t.co/r0NSfhozNH ❤️❤️ https://t.co/9kCMFnH5gB Join me in streaming some of my favorite female artists in honor of Women’s History Month now on @Spotify. https://t.co/koAEbctN8G  #WHM #AVibe https://t.co/2Qyox9GuqA ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ https://t.co/k7rGfERask You guys are friggin cute https://t.co/IZqce6mwri Another love tweet to Frances McDormand. You’re my everything ❤️ Watching the Oscars is so hard for me. I hate when people lose. Very happy for the winners but this is why I can’t watch football either . I cry when the team I want to win wins. Yaye!!!! Annie!!!! My favorite!!!! Have so much fun https://t.co/iRjiGpJLMK https://t.co/wynToLXLUd via @youtube aww man this is so great. I cried real alligator tears to this one. You girls and guys sound great ❤️❤️❤️❤️🙏🙏🙏🙏🙏⚡️⚡️⚡️⚡️⚡️ thanks https://t.co/H8PH70OXyh “Whatever you need, Whatever you do”…watch my new video on @AppleMusic 😘 https://t.co/8RFc7RLYY1 https://t.co/vYEXRxvJ2Z Tour’s almost here.\nI think I’m in shock and also probably in shock. Two kids and a microphone!!!!!! #andatutu #cleanversionsarelame #bestshowever #earmuffs #thebandisbacktogether Me. Too. 😍😍😍😍😍 https://t.co/4luwcNFZEu Isn’t that what you do for all of us? I love you to the moon Ellen. You too @portiaderossi ❤️😍 a night to remember https://t.co/pCPd8Mjgw3 ❤️❤️❤️ https://t.co/oY2TdqEYBj She sounds like me when I was 11. Tell her I love her and she’s gonna be okay https://t.co/IaCBscB73L ❤️❤️❤️❤️❤️❤️❤️ https://t.co/xyjVeYibOr Thankyou! I adore you! https://t.co/7XafcJkgtT One of my fav moments last night: @hartluck being all cool calm and collected until after I sang, he gets into the dressing room, sits down and says “ooh man I’m glad that’s over, I was nervous!” I was shocked. First time that mad man has ever admitted to nerves ❤️ Nope. They couldn’t  be❤️😍😍😍❤️ https://t.co/XufjxFxL4V RT @NeilRetail: @Daily_Express It was a throat lozenge. She’s had flu and obviously needed it to ease the pain. Despite being ill she turne… All of your prayers and well wishes and candles got me through today. Thankyou so much for all the love and support. We ❤️ you. #SuperBowl2018 https://t.co/1jbojyFjqc All of your prayers and well wishes and candles got me through. Thankyou for all of your love and support. We ❤️ you. #SuperBowl2018 https://t.co/x9M6XYV3Ny It was a throat lozenge Yeah but altleast I suck while singing our countries national anthem, and you just suck by yourself on a dirty couch. #winning https://t.co/SfLQr9hVTq RT @NFL: INCREDIBLE.\n\n@Pink sings the National Anthem at @SuperBowl LII! #SBLII https://t.co/xWgACgwNib I do love you 😍 https://t.co/xR51jDEX9g This was a nice warm hug 🤗 https://t.co/tQnhW4cYQW ❤️❤️❤️ https://t.co/hsFuxPCWBt Thankyou for the kind words ❤️ https://t.co/FgBiHuOhYH Thanks ❤️ https://t.co/nySrumSBtC @jtimberlake oooh look who has a new record out!!! My super bowl partner!!! https://t.co/sZsYQJ9NlO Oh this made my heart so happy. She’s brilliant and sweet https://t.co/OMlBviwJKG RT @TheEllenShow: For every retweet of this tweet, Bell will donate 5 cents to mental health initiatives. Here’s my 5 cents. Where’s yours?… Why thankyou kind sir. I’ll take that luck;) xoxoxo https://t.co/Wc1giD1GXN For those of you who have watched the video for WILD HEARTS CAN’T BE BROKEN... https://t.co/BhtnPprTA7 I doubt you’ll see this, cause you’re sitting somewhere being amazing and way too cool for Twitter- but Frances McDormand, I love you from the bottom of my cold cold heart https://t.co/BI861sjSZ4 RT @idolator: .@Pink drops raw &amp; emotional \"Wild Hearts Can't Be Broken\" video, launches UNICEF initiative: https://t.co/0b9HMrld15 https:/… RT @THR: Watch: @Pink releases \"Wild Hearts Can't Be Broken\" music video https://t.co/2r2cxIlri6 https://t.co/xuI4fCDCCW Thank you friend. https://t.co/hyk5TGIA3x RT @leighblickley: Say whatever you want about @Pink, but this woman knows how to command our attention, over 20 years after she entered th… 👀 Watch “Wild Hearts Can’t Be Broken” now! 💖💖 https://t.co/pZgiCobZrV https://t.co/WZTBFK7AjX Be sure to @Shazam tonight’s #GRAMMYs performance! 😉 💖 https://t.co/dDci54fHhJ I am so looking forward to the Grammy’s #someofthebestnightsofmylife https://t.co/fP3Lnmp5mD I would bet money that my big brother is somewhere crying right now Ummm. I’m singing the national anthem and the EAGLES ARE PLAYING?!?!?! IS THIS FOR REAL?!?!?!THATS WHASSUP!!!!!!!! Shtjtkd widnamc ckamcnsnzncbx!!!!!!!!!!!!!!!! Wooohooooooooooooioooooooooooooooooooooooooiiiiiiooooooooooo What an amazing group of women! Hell yeah ❤️❤️❤️❤️it’s an honor https://t.co/oesMluT4OC Wills and I have The Greatest Showman on REPEAT. I cannot. Stop. Singing. These. Songs. Help. ❤️❤️❤️ https://t.co/YoIxBXcxvx Whoever made this... THANKYOU ❤️ https://t.co/82BKOD74FN https://t.co/Sskgst1jAl Listen up people! Anyone affected by mudslides: \nThere’s an event Tomorrow at Impact HUB in SB 11-3 \n for people who have been evacuated - a place to be fed, nourished , there will be yoga , meditation and music and delicious food. Link to follow See you at the Super Bowl…😘🇺🇸🎤 https://t.co/QdmP3wxWnF After all these years, she still surprising .... https://t.co/txR4oDUppc RT @Pink: @idolator In one evening, Ive watched ‘Battle of the Sexes’, ‘The Mask You Live In’, and The Golden Globes. What an inspiring nig… @idolator In one evening, Ive watched ‘Battle of the Sexes’, ‘The Mask You Live In’, and The Golden Globes. What an inspiring night. #timesupnow #equality Can we talk about how much I love @KerriKenney https://t.co/6Bg12FNk5Q I’m really looking forward to 2018. I’m really excited about the Grammy’s. Tour. Some other stuff that’s a secret still and I can’t wait til it’s not a secret. I’m also excited for trump to lose his twitter password and also I’m excited that I have dope hair. 💩🤘🏽🤡 Suhweet!!!!! Thanks 🙏❤️❤️❤️ https://t.co/8jeAXQguMx A really sweet Mama came up 2me tonight at the grocery store and told me some nice words about how she gets strength from my parenting cause I’m not afraid to fuck up in public. We cried together. It’s so hard. Y’all. I wish us mamas could give ourselves and each other a break. RT @POPSUGARMoms: \"My heart explodes when he connects to his girls like this.\" https://t.co/2QCo5IHXWg THANKYOU to all of the firefighters battling this beast. You’re our heroes and we love you. Prayers and condolences to the family of Cory Iverson. 🙏 Congratulations Alabama. One small step in the right direction for all of us. 🙏 our voices are being heard Incredible! THANKYOU!!!! https://t.co/FJcsgIrjZf 😍 https://t.co/mIHOEaK43H 2018 is going to be a great year! I’m so excited to announce I’ll be @cosmopolitan’s January cover star! Can’t wait for you to read the interview when you grab a copy of the issue in stores now @michprom https://t.co/4UxuDYKVpl Chris Cornell dedicated all of the proceeds from his song The Promise to support refugees and children. Help us #KeepthePromise for Chris Cornell Your babe has some good aim! ❤️😍💕 https://t.co/Hk9hYKO9h6 RT @JustinDerrico: Well that’s a terrible option! Every other airline lets me put it in the over head which it fits with plenty of room.  I… RT @EricHolder: Nope.  Not letting this go. The FBI’s reputation is not in “tatters”.  It’s composed of the same dedicated men and women wh… THANKYOU for this. Chills down my spine. ❤️❤️❤️ https://t.co/uE7iNQE8U1 ❤️❤️❤️❤️❤️ https://t.co/1IeyKJov5D RT @billyeichner: Shouldn't we hold the President of the United States to the same standards we hold JEREMY PIVEN??? RT @TheGNShow: Next week we have @eltonofficial, #CareyMulligan, @stephenfry, @robbiewilliams and @Pink on #TheGNShow Give Hope on Giving Tuesday\nThis #GivingTuesday, help UNICEF provide nutrition, water, medical supplies and more to the world’s most vulnerable children: https://t.co/LFRPKpF37j https://t.co/WfJtiQoJb4 Ahah! 🙏 thanks ❤️ https://t.co/gg0xYWAUIv RT @markyplanet: Look at that beautiful audience as far as the eye can see! @Pink in Abu Dhabi! @gretschdrums @remopercussion @SABIAN_Vault… Amazing! Well deserved!!!! https://t.co/EcptZYYy4s RT @popsugarau: There is so much to love about @Pink's \"Beautiful Trauma\" music video: https://t.co/QGyKLimIkp RT @RCARecords: .@Pink just released her official video for #BeautifulTrauma featuring @channingtatum! Watch it now on @Vevo! 😍😍😍 https://t… The video for #BeautifulTrauma featuring the lovely @ChanningTatum is here! Watch it now https://t.co/ptcCynxSxh I wish I could block you forever but I don't know how someone help me please https://t.co/Hs9k3Y1abZ I choose to remember last night as being a celebration of women, of Diana, of Whitney, of love and life and joy and all things good. THANKYOU to everyone that had the courage to take that stage- wether it be right side up or sideways. All love ❤️ Waking up to see a newly created riff between myself and another incredible woman, Christina, who took on an incredible feat, who I support fully, makes me so sad. You all perpetuate keeping women apart b/c you're afraid of the power we have when we get together. Last night was about honoring first responders, singing with one of the greatest voices I have ever heard @kelly_clarkson, and pushing myself to do something I was afraid of and everyone thought was impossible. I scaled a building. While singing live. RT @JuanCarlosCNN: @Pink Here it is, @Pink! You were clearly moved by it...we all were! 👏🏽 Bravo @xtina https://t.co/RFKBot5Ufn No matter where I am, I always try to #ShopSmall! Like right now, I can't get enough of @MercedesVenice in Marina Del Ray - amazing food. This Saturday, Nov 25 show your neighborhood some love and #ShopSmall! #AmexAmbassador https://t.co/LKho8aYLEB 😘😘😘😘😘🙏🙏❤️❤️ https://t.co/35wotkUI95 Hahahahaha https://t.co/tKFiIMMFOo RT @AMAs: Two strong women in music 💪\n\n@pink @kelly_clarkson\n#PINKxAMAs #KELLYxAMAs #AMAs https://t.co/BbMMzWss9g Hahahah I'm sorry but this made me laugh so hard https://t.co/DnQJ3zs3wU THANKYOU friend I just love you and that means a lot to me. https://t.co/eqQhn9w1fS Oh gosh I love you so much https://t.co/dsyTghbV98 Yes. THIS. Christina fucking killed it tonight for one of our favorite singers ever. This about Whitney, and I am in awe of Christina's talent.  Show the clip where I'm in tears, you negative Nancy's 🤘🏽✌🏼❤️ https://t.co/5Lroq73xrQ RT @M_Lhuillier: @Pink is a dream at the @AMAs in #moniquelhuillier 💙💙 https://t.co/N5HVXkDprW HERE WE GO! The @AMAs Red Carpet is LIVE! Watch right here, right now! #PINKxAMAs  https://t.co/1Gz5Ohuhp3 I'm SO EXCITED to perform at the @AMAs TONIGHT! It's going to be amazing. LIVE 8/7c on ABC! #PINKxAMAs #AMAs https://t.co/ZHBQEJbhzC This woman has a direct line to outer space with that voice. I feel lucky to stand next to her when she sings. Tonight will be an honor for me @kelly_clarkson #AMAs2017 https://t.co/OU2LKZI4jW RT @UNICEFUSA: This is awesome! @Pink is giving children worldwide a reason to dance this #WorldChildrensDay. https://t.co/ojYsLEsRMo I'm doing my #BeautifulTrauma @AskAnythingChat with #MostRequestedLive Sat, Dec 2.  All you have to do is send questions to @iHeartRadio https://t.co/9IZTjzhjmD.  Thanks to @OnAirRomeo for inviting me on! RT @AMAs: OMGOMGOMGOMGOMG. \n\nBLOWN AWAY. SHOOK. CHILLS. @Pink's PERFORMANCE IS UNBELIEVABLE. YOU WILL NOT BELIEVE IT. SUNDAY! #PINKxAMAs Hahahaha I love you! I want a Reese's pieces sundae! https://t.co/Pmh63n8ruY RT @ETCanada: Kids from over 130 countries sing @Pink's \"What About Us\" for #WorldChildrensDay https://t.co/oqbPkCrMFK https://t.co/BDYZuRI… Yaye I want a big long awkward hug please https://t.co/juG1f5OPcc RT @AMAs: .@kelly_clarkson and @Pink will perform together for the very first time to OPEN the 2017 #AMAs! This Sunday at 8/7c on ABC. http… VERY IMPORTANT: theellenshow's photo https://t.co/tst4hyOoSg You're joking! I am humbly prepared to be outsung:) I adore you and I cannot wait. https://t.co/o1DcDymbbY This #WorldChildrensDay, I’ve teamed up with @UNICEFUSA to remind the world that kid’s voices matter! https://t.co/SAsas5F8yx RT @latelateshow: Pssst...\n\nWe're going for a ride with @Pink tomorrow night! #PINKcarpool 🎉🎉🎉 https://t.co/sc7uXmkp9n I got in a car with @JKCorden and sang some songs. Watch the madness unfold on the @latelateshow tomorrow, 11/14. #PINKcarpool 📸@terencepatrick” https://t.co/ABIBGPyjBQ RT @WhereIsBagg: You know, when people talk about @AMAs the first thing that comes to my mind (besides @BTS_twt performing this Nov 19th) i… RT @AMAs: .@Pink will perform a show-stopping rendition of 'Beautiful Trauma' at the #AMAs. It's going to be NEXT LEVEL! 11.19 on ABC. #PIN… “Taking on the @AMAs with my most daring performance to date! You ready? See you 11.19 on ABC. #PINKxAMAs” https://t.co/6YSXlQBpGY RT @CountryMusic: Retweet if you love the #CMAawards! @Pink was smile-ready in the red carpet CMA Awards 360 Smile Cam sponsored by @Colgat… So good!!!! 😍😍😍😍 https://t.co/NGENHB0EDc What dreams are made of! https://t.co/xI5lHDWG0i RT @accesshollywood: .@Pink officially has the cutest date at the #CMAAwards tonight 😍😍 https://t.co/CQsomFYcPI Happy https://t.co/7PLaM6FY59 Well it's a dream come true for me and I was honored to be invited. ✌🏼 https://t.co/W55TRxgR5p I'm so excited!!!! I'll be seeing you tonight on the #CMAs 🙏👏🙌🏽👍🏽🤘🏽✊🏽 https://t.co/SlizcXknDF THANKYOU. We wrote that song together. 🤘🏽 https://t.co/SSpFxOP7Rg Watch me on @JimmyKimmel – Tonight on ABC! #KIMMEL https://t.co/cbvXU5xNbQ Please read/watch. 25park's video https://t.co/VeJIGEowf1 Amazing!!!!!!!!! https://t.co/wV9lOZlfkK RT @paulocoelho: It is easy to be a hater. Go for the difficult task: be a lover I’m performing on @JimmyKimmelLive on Wednesday. Who’s excited?! https://t.co/yJkNh08gjO Oh my gawd candy corns someone please make me stop ✋ Ready to Trick-or-Treat for @UNICEFUSA? #BeScaryGood &amp; support UNICEF's emergency relief work: https://t.co/uUj30oHNke #ToT4UNICEF https://t.co/Inj0tpsKpr See you at the #CMAawards 😉 https://t.co/pzRcWWUjH1 RT @AppleMusic: Don't miss out! \nWatch @pink’s exclusive film and live performance here: https://t.co/DlPvlCpVUM https://t.co/O1ou8ECdI4 ❤️❤️❤️❤️ https://t.co/AXYUDnsS4n Hi Mom ❤️❤️❤️ https://t.co/eWs3VOTnUi ❤️ https://t.co/i2gg0N8b1F Hey everyone. Check out my friends post real quick if you can ❤️carlomondavi's photo https://t.co/X0QPJZlqPJ THANKYOU https://t.co/djcPPKUqmr I die https://t.co/GRYvSOTGBv Humbled and grateful. Beyond https://t.co/3sUW43hWBa ❤️❤️❤️❤️ https://t.co/GfrEGI4zks THANKYOU! https://t.co/Nb6DbkEaI6 Hahahahahahahahahaha https://t.co/YAG7lT44nq RT @ScaryMommy: Will Ferrell Stars In Videos That Remind Us To Get The Hell Off Our Phones https://t.co/Rsr0r4Chxb https://t.co/xrn4SxMd9y Mama do you love me https://t.co/RdLBw29DK7 Right now https://t.co/VacXZsPeIY Lots and lots and lots of cheese https://t.co/CX4FmZVdsp I miss Grace, but I love Thomas Shelby ❤️ https://t.co/tkRxho767D Peaky blinders https://t.co/CvuWP9d3Y2 Is it am or pm? https://t.co/5PIBxUXDef Cheesecake https://t.co/wsQi8yzpHY Gymnastics https://t.co/d4oyPz7R7F On a scale of 1-10..... 20 https://t.co/Gpt36kAmgc Right now? Ray Donovan and This is Us https://t.co/0xOkk0pNSZ Biggie smalls https://t.co/KaPzMkjxvo Don't speak https://t.co/hcjzJlES4V Beck. Colors https://t.co/JaOUPDkZgF Dancing in the dark cuz my daughter knows every word https://t.co/SqXlLOgzvz Sure! Go! https://t.co/F5IUascnyd Aww thanks 🙏 https://t.co/eLpCp7967O This warmed my heart ❤️ https://t.co/UgO6uvM3xU RT @tiesto: Check out my new @Pink AFTR:HRS Remix : https://t.co/b1aMAEc3Ny 💕😻🎊 https://t.co/QfgxxkrBPt ❤️❤️❤️❤️🙏🙏🙏🙏🙏🤘🏽🤘🏽🤘🏽 https://t.co/drEo5rbyQn RT @officialcharts: @Pink: “We’re two very happy ladies!” The singer celebrates her new album debuting at Number 1 in the UK with her daugh… Can we talk about how much I love @Andy https://t.co/oeS1SKw4BF Oh boy 🤘🏽😂❤️ https://t.co/hZsx9zBbMI Totally overwhelmed by the reaction to Beautiful Trauma. Get it on @AppleMusic https://t.co/EVijjXBKXj I love her https://t.co/cODzw4CRCk THANKYOU 🙏 https://t.co/occz4I2NR1 Well this made me cry. It's been an honor to be your friend from a far https://t.co/nerNJC7R8p On the Record... my documentary. Loved putting this together. Enjoy. 😘 https://t.co/Ai1k1WaAJQ ❤️❤️❤️❤️ https://t.co/QcFjmlIXmP Haha that's so funny. You're awesome❤️ https://t.co/wYl8gL1cdL RT @nbcsnl: When you miss @kumailn &amp; @Pink on SNL but remember every clip is on the SNL @YouTube. https://t.co/dEaCbOXEvD https://t.co/kC8y… Hahaha how do you spell TWO SHAY https://t.co/I0SbsVbi5k This Is Us needs to come with a free box of tissues RT @GMA: Just an amazing live performance from @Pink! https://t.co/LLhWnFVUxD 5 Body Safety Rules All Kids Need To Know https://t.co/5swrZH4nUL Wanna say a humongous THANKYOU to all of you for listening to the album and for letting me know your thoughts and favs.\nI love seeing it❤️ This made me laugh https://t.co/COzoysPpxf THANKYOU my friend! Xo https://t.co/NW3C2WHA7T So fun!!! https://t.co/rPh0G6Qtih Such an honor to do so 🙏❤️ https://t.co/5ZhaYrDDLE Yasssss https://t.co/AfhrxNQH2V 🙏😍 https://t.co/gr3ehJKO9u RT @joshgad: Audiences thank you for the incredible ‘A cinema score for #marshallmovie - Find out of it’s playing near you and go see it no… ❤️❤️❤️ https://t.co/DG3tm6bqCA RT @Global_TV: TONIGHT 1130pm et • #SNL. @kumailn. @Pink. Live coast to coast. Check your local listings! https://t.co/7bspdoWTNU Oh Deborah you're so incredible deborahandersoncreative's photo https://t.co/IYRbgrT3s5 RT @BritishVogue: DID YOU SEE? @Pink on the lessons she would like to pass onto her children - https://t.co/41rxz5wIVP https://t.co/YFvY2t1… RT @nbcsnl: We're live coast to coast tomorrow with @kumailn and @pink!! #SNL https://t.co/0FC5jxU421 ❤️❤️❤️❤️ https://t.co/0v7vlD6Yo7 Wooohooooo!!!!!! https://t.co/LLZ44HSEJM ❤️❤️❤️ https://t.co/QrjSLOLRam Agreed! https://t.co/TZES6H8wn3 Thanks for the questions everyone! Headed into NPR now ❤️❤️❤️ have a beautiful day Thought it was amazing https://t.co/4XKnwReHEF Snuggles. https://t.co/uJSISfasOc Watch sad movies and eat pretzels and cry. https://t.co/6c1UFP2EdU Edith Piaf. She sings to my soul https://t.co/ScAJBEI0pA Relief, pride, love. Curious how it would be received. https://t.co/oX1eZRr54n I think we all know the answer to that question 🤘🏽🤘🏽🤘🏽🤘🏽🤘🏽 https://t.co/wXh4xGiBD9 Maybe so what . For so many reasons https://t.co/WZ76EPQsj9 You're doing the best you can, which is amazing, and all children really need is love. https://t.co/5HmKG9geS2 Ugh so hard! Dr mr president? https://t.co/UAPORH8Ff7 You shut your mouth hahahahaha nooooooooooo help https://t.co/wu9kwdEgCc There's so many!!!kelly clarkson, Kesha,Juliette Lewis, Miley, Cardi B, Elle King, Adele, Andra Day, Janelle Monae, Beyoncé, kacey Musgraves https://t.co/VAHq4jwvMQ What about us and Secrets https://t.co/kLbqUTH8UK Shit that's hard. Maybe Love Story? Moonstruck https://t.co/7QacP0YVn4 Maybe this used to be my playground or la Isla Bonita https://t.co/xy9nhLsNuM Over the friggin moon 🙏❤️ https://t.co/dlTuXwCXWj I don't think he's heard it yet haha https://t.co/4VUFNOlXfm All this Adulting. https://t.co/MODMInQGd5 Right now; The Subtle Art of Not Giving A F*ck https://t.co/IZoAImEoUz He's smiling, snotty and delicious https://t.co/pLYBBrMe3M It's go time. Ask me anything. #AskPink Almost time! #AskPink Alrighty let's have a live q+a... say in 15 mins?! Send me your questions #beautifultrauma Thanks for that https://t.co/6CBPElHoDy Hahaha i miss you this picture is hilarious https://t.co/XJeaOTWpS5 You're the best and me too. https://t.co/QABrb5ZNMI You're amazing!!! https://t.co/m2aDJ0ZLau That's super amazing. I have a new grateful https://t.co/kkip1niLkZ Good number haha.\nAnd thanks ❤️ https://t.co/DOR9rpNGNA I ❤️you🤘🏽 https://t.co/lroQ5gVs46 I absolutely love you 😘 https://t.co/c5ClZZSeMS unicef's photo https://t.co/EZh3pr0gBW ellenpompeo's video https://t.co/z2ZYosV4Du I love listening to him. He's incredible Here's one more clip from the #BeautifulTrauma documentary for you all. Which comes out tomorrow only on @AppleMusic https://t.co/j1c6niOoXn I have my very own @Twitter Emoji! Tweet using #BeautifulTrauma or #BeautifulTraumaTour &amp; it gets automatically added to your tweet! Oh. Yeah. Whatever. No problem 😳😳😳😳😳❤️❤️❤️❤️ https://t.co/1p2WpEqaXr You're crazy you were awesome ❤️❤️❤️ https://t.co/fVFnO5yDOM Only 2 more days until the release of #BeautifulTrauma &amp; the @AppleMusic exclusive documentary about the album. Who’s excited?! https://t.co/iBxH8Dxmqv Agreed https://t.co/feTXhat9Wv The rest of our government needs to protect us from him and his appalling behavior. Is ridiculous and assinine. I'm a person that has always fought for equality and love.\nAnd I always will.\nHe either needs to CHANGE or... I did not vote for Trump. That tweet was not an endorsement. I'm as disgusted as you. To even imagine a person like me would endorse him ... Hope over fear. https://t.co/Jcdz61CUh3 Then you don't do your research https://t.co/7fcpSt4m51 Gonna be a part of #TodayAtApple at the Williamsburg store in Brooklyn, premiering my film before its out on Friday. Join me tomorrow! https://t.co/SovOmjXkVm Anyone out there who bought #BeautifulTraumaTour tix through Verified Fan, make sure to redeem your albums! Check your email for details https://t.co/T8coPNDrrt RT @HWD: Jon Stewart tries to be nice to Trump on @LateShowColbert, calls him a sociopath instead https://t.co/V66B4Mt1dX RT @NancyPelosi: Grateful for firefighters, prayerful for people of Napa &amp; Sonoma that fires will be put out soon #NapaFire. RT @epicurious: It's never too late. https://t.co/iU1MMM6JMo Yes apparently I have time today https://t.co/5o6wfMvKV2 RT @realitysamwch: @Pink This is a kind sentiment in a dark time RT @CaamilleCh: So there's actually people saying that @Pink voted for TRUMP ??? P!nk? Trump? Me too https://t.co/VhUMTIENt2 I pray for love and change and light. I also pray I never become as cynical and snarky and shitty as some of the people on my twitter feed. And  they aren't silent either...\nDo your research https://t.co/Y2vruTGDmk Yeah I'm not interested in silence https://t.co/Y2vruTGDmk RT @mots15: @Pink I appreciate you trying to see the glass half full while the rest of us still see it very half empty. We do need positivi… RT @KirstyWebeck: @Pink's tweet is clearly appealing to Trump to start doing the right thing. It's clearly not an endorsement but an attemp… Hahah you're sniffing fucking glue https://t.co/gd2qllFMpu RT @daniel_parralop: @Pink I don’t know why people are getting that tweet wrong. Wtf with y’all??? She’s asking for a change!!! Chill damn… I think this world needs HOPE and LOVE and POSITIVITY and we all need some inspiration to not be SHITTY ALL THE TIME I'm sorry y'all. I assumed you all knew who the fuck I am and what the fuck I stand for.\nCause I have never faltered. I have always been me RT @iwasdivine: @Pink Trump has done a lot of damage that cannot be reversed. It’s nice to think that he will change, but it’s unrealistic… Wait- wtf are you talking about? I'm attempting positivity and motivation b/c I'm hopeless. And now youre mad at ME? https://t.co/x6LedGrGZU Why? https://t.co/hGQVMD7SLz RT @Pink: @POTUS you are doing a terrible job. Worse than every other job you've done terrible at. Do you seriously have time to worry abou… I've seen people change and turn their lives around. There's still hope for you @POTUS. It's what the world needs. @POTUS you are doing a terrible job. Worse than every other job you've done terrible at. Do you seriously have time to worry about the NFL? Here’s a clip of the exclusive film coming to @applemusic alongside the album this Friday, Oct 13th https://t.co/REuvXPH8lY Yep. That looks about right lololololllolllol.  mytherapistsays's photo https://t.co/rwliOWB1So RT @CBSNewsEnt: The many shades of @Pink from @thattracysmith https://t.co/TLnQDBkMSy RT @zachbraff: So you..... wait for it.... protested. https://t.co/GSwJW6fwmw RT @SRuhle: If birth control promotes “risky sexual behavior”, do seat belts promote drag racing? RT @riotwomennn: Well, we won't make him President https://t.co/sFwzCV8eLb RT @PPact: BIRTH CONTROL IS NOT CONTROVERSIAL.\nBIRTH CONTROL IS NOT CONTROVERSIAL.\nBIRTH CONTROL IS NOT CONTROVERSIAL.\n\nSign on→https://t.c… RT @UNICEF: Stay human. \n\nRT to spread this important message from @VoicesofYouth - our channel by youth, for youth. https://t.co/LpS9xvJ2vq RT @laurenduca: If you think this whole Harvey Weinstein thing is upsetting, I have some bad news for you about the President of the United… Thankyou very much https://t.co/7nMGG7Q77l RT @StellarMagAU: The glorious @Pink is on the cover of Stellar today. Don't miss it in today's @dailytelegraph @theheraldsun @couriermail… @joshgad your movie comes out the same day as my album! Everyone! Go see this amazing man in this incredible and timely film. #MarshallMovie That's a slice of nice! Thanks world! ❤️ https://t.co/1UoWJZFW2l She is a rad photographer and really great to work with ❤️ https://t.co/bjwcdXOOCx RT @thattracysmith: This @cbssunday 10/8 we visit @pink at home on her farm for a talk that's funny and thoughtful and blunt and heartfelt… RT @CecileRichards: Women have been in the crosshairs of virtually every policy from this admin - but this attack is a new low. https://t.c… ❤️ https://t.co/zNtYSq5d4i Umm... you still have a baby face https://t.co/joQUgaE4MK So I was 2 😍 https://t.co/kviKBM5CPP RT @AppleMusic: CAN’T. WAIT. \n@Pink goes on the record.\nWatch the exclusive film 10/13. Only on Apple Music. https://t.co/LmOCmvYlRs RT @danwootton: Amazing @pink talks her first album in five years and family in my Bizarre Life podcast. Subscribe on Apple Podcasts https:… Check out my new jam.... @vevo https://t.co/heykPi5S9s via @youtube #VerifiedFan &amp; AMEX Presales Start 10/10. General On Sale Starts 10/13. Sign up to become a Verified Fan at https://t.co/wqKNOdSNBn I’M GOING ON TOUR! Check out the dates at https://t.co/rnzbazWm6W https://t.co/RC735CtgNi Not as excited as me!!! 😍😍😍🎈 https://t.co/qLkIqBjmH2 I made a thing with @AppleMusic! It’s a documentary about #BeautifulTrauma – Check out this trailer https://t.co/NfQeRwG7Sa Another surprise coming tomorrow 💕 #beautifultrauma RT @PinkFans_: Hahaa Yep! You Said 8 year old @Pink! 😄😃 https://t.co/UMDZWYSma1 RT @benjpasek: We're good. Thanks. \n\nOur thoughts during Yom Kippur services this morning were actually with the people of Puerto Rico. Obs… RT @Lin_Manuel: She has been working 24/7. \nYou have been GOLFING.\nYou're going straight to hell. \nFastest golf cart you ever took. https:/… RT @JuddApatow: When will people turn hard against Trump?  Who is being helped by this madness? https://t.co/F7BLWHW7IV RT @cityandcolour: \"we were 2 ships in the night hellbent on trying to survive &amp; capsized\"\nreleased this beauty 3yrs ago today #timeflies @… I may or may not be watching the first episode of Greys for the third time. I'm also probably not crying and I'm definitely not nuts 🥜 I'd like to wish the happiest birthday to one of THE MOST loyal, kind-hearted, funny, sensitive,… https://t.co/pLK8Gi90ie Only 2 weeks until “Beautiful Trauma,” the album is out! In the meantime, here’s Beautiful Trauma\" the song! https://t.co/6zYhy9nEHP After it b/c life is f*cking traumatic. But it's also incredibly beautiful, too. There's a lot of beauty still and beautiful souls. Enjoy 😊 Tomorrow I'm releasing the title track to BEAUTIFUL TRAUMA. I wrote the song with a very awesome person @jackantonoff and named the album... Oh this Thursday okay I'm happy again. I am emotionally attached in an unhealthy way to these doctors @EllenPompeo better stop messing with our heads and tell us when greys is back....... WHENNNNNN RT @iHeartFestival: .@Pink kicking off our #iHeartFestival in the middle of the crowd is everything and more 💥💥 https://t.co/cK7T9AWacL I can share. https://t.co/oQjI66VnJ4 VEGAS! Let’s get this party started. Kicking off the #iHeartFestival right now! Watch https://t.co/FYHEiBYUzw https://t.co/5naAdSwUjk Performing with my darling friends @iHeartRadio tonight at #iHeartFestival! Can’t wait! Watch on https://t.co/FYHEiBYUzw https://t.co/ab0kX3cRIV RT @iHeartFestival: Let's get this party started! 🎉 @Pink takes the stage around 7:30 PM PT / 10:30 PM ET tonight on https://t.co/dZO09e7h2… Ready for @iHeartRadio tonight!!!! https://t.co/Uelv2Vw8Kg Feeling grateful #whatareyougratefulfor Mark your calendars! Headed to @nbcsnl October 14 - can't wait! #SNL https://t.co/y4xhJf4gED Baaa hahahahahaha. And I mean it 😡thekimbowen's photo https://t.co/Kqd8giype3 RT @ETCanada: Watch: @Pink spills it all in a hilarious round of pop star confessions\nhttps://t.co/xE14ocJpfZ https://t.co/2yGQyK0lUU I love you Louis https://t.co/tftjBqpNQS ❤️ https://t.co/61wP8iNqpP RT @cashcash: our remix of @pink's \"what about us\" drops @ midnight tonight. u ready? https://t.co/jrOg3585OE ❤️❤️❤️❤️❤️ https://t.co/xZ3bo8penu Aww thanks for being a part of it! Xoxo❤️💕🙏😘 https://t.co/nIgYMp4EXt And I was told 8:30! https://t.co/lRoFNDFVn1 See you later loves!!!!!! https://t.co/Fve5d7OSrZ Yaye!!!!! Thx for coming ladies https://t.co/VlCMFdm50u Hahahaha you forgot dork https://t.co/tYD9u2LkW0 Thanks friend. Love you!!! ❤️ https://t.co/GetzL6Q9nX So. Many. Tears. We're all connected and I wish I could hug every single one of you...(and your little dogs, too)(and those adorable kiddos) https://t.co/VASPOlmchk I think they scream for two hours and don't want to sleep because they love you so much and miss you too much. Right? THANKYOU Andrea Roberts for your beautiful card and all of those things you shared with me. I also love your handwriting ❤️ https://t.co/zrKqrwBSaN Oh this makes me so happy you have no idea https://t.co/M4oPLsBLkg Thanks!!!!! ❤️ https://t.co/cafPZZik4L THANKYOU for sharing this with me❤️❤️❤️ my heart is full (love that hashtag) hello amazing boy!!! https://t.co/5vzsbXOtbc Amazing and so happy you're here!!! https://t.co/H5WINOYmzL This is how happy I am when I'm at @TheEllenShow #dork https://t.co/JQfzWXEzpR Don’t Forget to Tune into Ellen today for my performance of #WhatAboutUs! #PinkOnEllen https://t.co/ANBijXVQij RT @EllenD_world: Tomorrow on @TheEllenShow 📺\n\nThe one and only @Pink will performe her new single “What About Us” from her upcoming album,… RT @JuddApatow: Donald Trump has unleashed every asshole like Detective Payne here to live out their hateful instincts.  Their inner Trumps… RT @questlove: So $5,000,000 if you can find Obama's birth certificate but just $1,000,000 for Houston residents hmmmmm. #HeGotToGo RT @SamMartin_6: Leo and I are donating 6 lbs of dog food to Houston for every retweet this gets!!!! RT RT RT RT!! https://t.co/bcTT905knP Can’t wait to see my friend Ellen! @TheEllenShow Tune in ;) #PinkOnEllen #WhatAboutUs ✊ https://t.co/tvgyjCSfSQ #tbt to the most fun night ever at the #VMAs! If you missed my performance you can watch it on my @Vevo: https://t.co/k6O51QjlyG Hey LA! Teamed up w/@applemusic on my #BeautifulTraumaLive show on 9/6. I'm giving away tickets here: https://t.co/B7UPIGKc29 https://t.co/dvY7cscEbx Willow at the end though ❤️💔💕 https://t.co/uwjL1dhGmo I love you too. You bring so much joy to this world buddy :) https://t.co/iKGFLe30E5 I can't wait!!!! https://t.co/zVSaJNWn92 karlawelchstylist's photo https://t.co/saHtNXW88B Can't wait to perform at #KAABOO—esp. because @UNICEFUSA will earn 20% of all net sales made w/this link https://t.co/CrvVG3H8AZ You're mine 😍 https://t.co/Wo2meDqgFf Oooh they caught our secret kiss!!! https://t.co/Nom7Lm4C10 I love you 😘❤️ https://t.co/z5wYGv0viB ❤️❤️❤️ https://t.co/IBL4nHY6em RT @etnow: 6 times @Pink's daughter Willow melted our hearts at the #VMAs. https://t.co/MQwJIBjkMA https://t.co/fwHukAbW4w I love you Rove https://t.co/cbZFGa7ULZ Best thing I have EVER SEEN https://t.co/KspDZaetGQ Yes I do! https://t.co/aUgUIuyIFx Hahahahahahahahahaha https://t.co/wvgAjhm6UU Not quite but thanks for the idea ❤️ https://t.co/o69BPGuUDe We decided to picture everyone as fat babies with big heads ❤️ https://t.co/s9ukye2hw8 Willow:best dressed https://t.co/Pm2FP7FTrP I love you girls ❤️❤️❤️msjeanettejenkins's video https://t.co/TNgiK07sZv Ready for tomorrow MTV 🔥🔥🔥#vanguardaward https://t.co/LauTtft4Nu Thanks @theforum !!!!! https://t.co/Qtf6c2pboB Thanks @billboard ❤️ https://t.co/6tKX0Wbcso In rehearsals but did ya know Try This, Can't Take Me Home &amp; M!ssundaztood are on vinyl for the 1st time? OCT. 6TH! https://t.co/e9KXlffLpD You are incredible!!!! @ColtPrattes @KhasanB84 @RemiBakkar https://t.co/cN5ULMLJK5 RT @GIPHY: ICYMI: @Pink's official GIPHY channel is live and it is everything you could ever want. 💅🙌👉https://t.co/WuDNxS5eUY https://t.co/… So much! https://t.co/fJdoyNBmvv Yes ladies get it!!!!!!!! https://t.co/IbnMa1E52u I think you missed the point! But sorry it's awkward for you! 😘 https://t.co/TUYgfVJ37i For serious? Don't threaten me with a good time 🐷🐷🐷 https://t.co/r7OVm97FCI Wow so good bravo! https://t.co/pxGdrB6Vyv It's a good look ⭐️⭐️ https://t.co/OD7MmI9FIR Ok that's the cutest thing ever https://t.co/3MZR5BRvRa I'm gonna come be freezing and soaking with you!!!! Xoxoxo❤️❤️❤️🌂🌧🌧🌧🌧 https://t.co/Bo2PMf8tET RT @hartluck: Beyond stoked for @justinbogle19 and the @rchracing crew for the over all win today. You hard… https://t.co/AmQztqbpDy RT @BBCEssex: The crowd sings along as @Pink closes the first full day of music at #vfestival https://t.co/So1XsDmRVz @NickRJofficial and they are the BEST https://t.co/f4pnDRmWlG Directed by the incredible @GeorgiaHudson_ ❤️❤️❤️ https://t.co/1KwPFZTPQD Wooohoooo I cannot WAIT to come back thanks everyone! ❤️ https://t.co/cwXY1CzIWh I'm so sorry for you my dear 💔 https://t.co/S1ioKdMn8X You're cuuuuteeeee https://t.co/c5qtcFxcyr Rad!!! Can't wait!!!! Xoxoxo https://t.co/CZ2qP0wieo THANKYOU ❤️❤️❤️ happy youre happy https://t.co/eRDFlgc2JB We're so ready!!!!!!! https://t.co/JD1fEpuaSI Oh yes please. https://t.co/68tUfUZaq7 RT @vmas: We love @Pink's new music video so much!  https://t.co/8p3t6S6K4g Beyond floored and so much more than grateful for all this and all the years of fun and love we've shared. Genuine gratitude. ❤️❤️❤️ https://t.co/P5uBL6cmHW RT @R1Breakfast: THURSDAY IS GOING TO BE VERY GOOD.\n\nSee you at 7:50AM @Pink 👋💗 https://t.co/zs5OsRNHZj Yeah nope https://t.co/m3vhVF7uBJ RT @MTV: Looking back at @Pink's best @VMAs moments 💞 Don't miss her take the stage as this year's Video Vanguard recipient on 8/27! 💫 http… RT @nytimes: Theresa May criticized President Trump's reaction to the violence in Charlottesville https://t.co/H51JncJ3tF https://t.co/W89R… I’ll be ready. Are you ready? #WhatAboutUs video premiere now on @Vevo ✊ https://t.co/g8EmGVofa6 ❤️❤️❤️👩🏼‍🎤 https://t.co/fEKWgR15wU My band and crew sat around tonight celebrating 17 years of life 2 gether,how far we've come.Of how grateful we are,blessed beyond belief.❤️ Hahaha yes https://t.co/EDUiJZ8phQ RT @tommx: @Pink In this day and age, being a merely decent human being is, in itself, heroic. The last time I was fuming was when I turned on the news. Don't give yourself too much credit. I just like to set shit straight. https://t.co/GnxsqcEHte And you're fuckin rip van winkle if you've never seen one of my videos . Let's be an example of inclusion and celebration. You don't have to like me at all, I'm ok with that. Just be a decent person. Music brings us all together. The best part of music is- there's room for everyone to win at the same time. Don't be what's wrong w/da world Want to point out an awful new phenomenon of the last 10'years. We can no longer be happy for each other. I ❤️Xtina, we've made amends.... https://t.co/4lcGu2mySV Video. Tomorrow. #WhatAboutUs https://t.co/wjLnTpRsXM RT @PinkFans_: 📷 Check Out These Awesome Behind The Scenes Photos From @Pink’s Upcoming ‘What About Us’ Music Video!!  https://t.co/44A63rI… Thanks sister from another mister https://t.co/itUIId63oN 🙏❤️ https://t.co/cbmGCXxrc6 You just did ❤️❤️❤️ https://t.co/1A7pR9M2J0 🙏❤️ https://t.co/YbcM4XcFeO THANKYOU sweetheart ❤️ https://t.co/fVruSQ7m2Y RT @ShaunKing: All hands on deck.\n\nWHO IS THIS MAN with the red beard?\n\nHe committed a violent felony. https://t.co/nbYhxAPAOO RT @KeithOlbermann: The President of the United States is now by his own words and actions an apologist for Domestic Terrorism. @realdonald… RT @BILLKEYWEST: His Jewish grandchildren must feel safe.......... https://t.co/toHDKW3PX2 RT @TherealTaraji: God bless her soul! #myhearthurts but I do know that #GODIS 🙏🏾😔#Repost… https://t.co/lLYtvdAIE8 RT @BillyBaldwin: Violence is not the answer but... karma is. https://t.co/BUBscfuayY RT @ShaunKing: Daniel (Dan) Borden from Mason, OH we found you.\n\nYour classmates turned you in. \n\nYou are guilty of assault. \n\nNeck moles g… RT @robreiner: We're running out of places to put nails in Trump's coffin. Unless you're a racist antisemite you have no reason to support… RT @MyDaughtersArmy: Walk away, you complicit coward.\nhttps://t.co/LQthWXkFRn RT @PattyArquette: This church elder went to #Charlottesville she was beaten by 8-9 Alt Right #Nazis they Maced someone in wheelchair &amp; thr… RT @USATODAY: More than a hundred rallies  against white supremacy took place nationwide Sunday. https://t.co/CgtWLY2oED RT @BeauWillimon: Bannon is the face of White Supremacy in the WH. It's time for him to go. Use your voice if you agree.\n#FireBannon\n#NoWhi… RT @NAACP: We call on the President to take the steps to remove Steve Bannon – well-known white supremacist leader – from his team of advis… RT @MichaelSkolnik: Donald Trump has a bunch of white supremacists as his most senior advisors in The White House and they got to go!\n\n#Fir… RT @MarkRuffalo: Let's begin to Stop White Supremacy, Neo Nazis and KKK where they feel most welcome, the White House.  #FireBannon #Charlo… Yes!!!! THANKYOU xoxoxo https://t.co/2a9NGDxZH1 RT @JohnDingell: I signed up to fight Nazis 73 years ago and I'll do it again if I have to.\n\nHatred, bigotry, &amp; fascism should have no plac… RT @HillaryClinton: Now is the time for leaders to be strong in their words &amp; deliberate in their actions. RT @mattmfm: Let's be clear: this violence in Charlottesville is an act of domestic terrorism, perpetrated by a hate group mobilized by Don… RT @brianklaas: Trump's week\n✓Threatened nuclear war.\n✓Threatened Venezuela.\n✓Thanked Putin for expelling US diplomats.\n✓\"Many sides\" after… RT @BILLKEYWEST: The Nazi's must be removed from the West Wing......call them what they are ........Bannon/Gorka/Miller RT @funder: There was just a domestic terrorist attack on this country-\n\nTrump's response: Let's do a signing ceremony. RT @TheMandyMoore: My ❤️ is w the good people of #Charlottesville, the peaceful protestors &amp; victims of this horrific act. What a devastati… RT @DaneCook: Tweets are free. Go for it. I think we all wanna hear &amp; agree. https://t.co/ze5WZR6fOS RT @Bakari_Sellers: My dad, who was shot and housed on death row during the movement, taught me there aren't \"many sides\". There is justice… RT @GlennKesslerWP: Trying to imagine the president's response if this had started as an pro-Islam rally. Would \"all sides\" be at fault? RT @ezralevin: A Nazi terrorist rammed a car into a crowd, killing &amp; wounding Americans. \nAnd this is how the President of the United State… RT @McFaul: \"Many sides\"?  Did I miss something?  I am deeply disappointed in my president today for this statement. https://t.co/lvUIGpazSS RT @kidnoble: The declaration of unlawful assembly was declared hours ago yet no Neo-Nazi’s have been tear gassed, pepper sprayed, etc. RT @jeremyscahill: Trump cannot be removed from accountability for the actions of the vicious terrorists he has emboldened. He's not a neut… RT @joshgad: Our country is in a very dark place and our leadership is playing coy. https://t.co/OSOb4CcyBr RT @TheEllenShow: Is this America now? We cannot let this stand. #Charlottesville RT @thatgirlbishop: Reading the news &amp; wanting to vomit. This seems to be a reoccurring theme. RT @SteveMaraboli: Outdated ideas inevitably lead to outdated behaviors. When ignorance and hate enter the room, progress makes its exit. RT @michaelianblack: I don't think they know who did this yet or why but the same act elsewhere has been called terrorism. https://t.co/GfM… RT @questlove: And I don't mean Va--I mean ALL this atrocity. Shit ain't gonna change until EVERYONE calls it out. Not just minorities. RT @yelyahwilliams: the news makes me sick and so do racists in suits who dance around  the fact that NAZIS are parading thru the streets i… RT @christinawilkie: Similar statement from Pence: No real principle behind it, just generic language that amounts to, \"why can't we all ju… RT @christinawilkie: Based on initial reports, it appears that this car plowing into protesters fits the definition of a terror attack. htt… RT @christinawilkie: This is a stronger statement than Trump's. https://t.co/2me3KBLaaa RT @CecileRichards: Heartbroken over #Charlottesville - we have urgent work to do to denounce and confront white supremacy in America. http… RT @christinawilkie: A fine example of principled, strong language coming from a top Republican in the Senate. White House, take note. http… RT @PinkEuropeans: @pink thank you for the hug, the joy, and so much more !! Your team forever from the bottom of our hearts ❤ YAye!!!!! https://t.co/0tZuUFd7u2 Yes this. That's what I was trying to say balleralert's video https://t.co/PuGcsLJooV See you soon loveees!!! https://t.co/aPbYCIo1Np I love this!!! https://t.co/k10WSy0gxe Thanks friend ❤️ https://t.co/3SOBT0FQvz Love you right back 🙏 https://t.co/UBDAGTTvoX Thanks 🙏 https://t.co/d1n9y1mcHV Hahahaha yeah I was just making a human... I'm good now https://t.co/Etq6JqoYEO I'm very confused about this. https://t.co/87nRTwndwD We should have a contest on who loves who more then... I'll win. I promise. 🙏 https://t.co/2fXKq6Heny Thanks buddy ❤️❤️❤️ https://t.co/r95ARhnYUC For reals?! Thanks yawwww https://t.co/rQiy0aIizZ YOU ARE https://t.co/07tiwez0Sk 🙏❤️😘 https://t.co/MDsR9w5q75 You guys were awesome!!! I was so happy to finally meet you xoxoxo https://t.co/TQOqinZIWp 🙏🙏🙏❤️❤️❤️ https://t.co/KtO4HT3h0V I feel like this https://t.co/40EJZVOCRh 🙏😭😭😭 https://t.co/IJTbshg6jC 🙏❤️❤️ https://t.co/PzGHr049Lk ❤️❤️❤️ https://t.co/YStyAy08o5 🙏❤️ https://t.co/hv2OqabmaF ❤️❤️❤️ https://t.co/MbPHJMmzXg ❤️❤️❤️ https://t.co/xPUNWFMrEp Haaaa❤️❤️❤️ https://t.co/xZtRcJiWNf ❤️❤️❤️ https://t.co/pG7XPUAo6W ❤️❤️❤️ https://t.co/J9jWiKSTL6 ❤️❤️❤️ https://t.co/1boqLZTZVw ❤️❤️❤️ https://t.co/afKyAtJaSL ❤️❤️❤️ https://t.co/mOlYuGaK2o RT @sasymat: @Pink Amazing song, love from Italy ❤️🇮🇹 #WhatAboutUs ❤️❤️ https://t.co/uG4WWZO0kr Beautiful Trauma 10/13/17 I could not be more excited right now. \"What About Us\" is out today (Thursday) THANKYOU for all the years and love https://t.co/geUV86ekOu It's already Thursday where I am sorry America! You have to wait til Thursday. I'm in the future I could not be more excited right now. My single comes out today \"what About Us\" and my new… https://t.co/GmBbN7Z1ty I don't change who I am to be popular my dear. You can absolutely unfollow my posts if you find it too difficult https://t.co/eXaUkfLTdB RT @SalMasekela: Dear Mr. President,\n\nMost of us have some dreams left we'd like to see through. Please don't incinerate us to preserve you… Sticks &amp; stones they may break these bones but then, #WhatAboutUs? ✊  https://t.co/cI5VuNDP0y \nhttps://t.co/i9Pu82ndGL Judging by my abs it's try this?? What do I win? https://t.co/nGL6w1gi45 Tru dat https://t.co/oAmBEmj1LW Awwww that makes my heart hurt in a really good way https://t.co/pRNSHqcYEP YOU'RE nervous?!?!?! https://t.co/vuXIFDqYHc Seeing people singing and feeling free https://t.co/knUvdwcc6p Your boss is a dork https://t.co/Mr208OZHcz I want your smiles too 😻 https://t.co/QKSg2kZZ2r Mine was mamas and the papas amd Mary j bilge what's the 411 https://t.co/atOz1U1l8m I feel like I should apologize https://t.co/Jmn5Z2Lq3Q For reals? That's so rad! ❤️❤️❤️ https://t.co/xevQwN08CG Bahaha I just spit out my drink https://t.co/FT5pvPoMlJ That's amazing. Yes please https://t.co/WXsvRFmLqZ RT @SonyMusicGlobal: .@Pink's new single #WhatAboutUs is out this Thursday ✊🏼 https://t.co/OJopPptidQ https://t.co/GB4EbI0xUI Well I think that's cool https://t.co/vkTC2qCWaY It's the start of us waking up... #WhatAboutUs Out this Thursday 8/10. ✊️https://t.co/cI5VuNme90 https://t.co/KkZFM1lUxr Happy Birthday @elvisduran !!!!! Hope you're feeling loved today! ❤️🎉💕 Chicago, see you 9/9! I want my fans to get tix, not scalpers/bots! Register for @Ticketmaster #VerifiedFan presale: https://t.co/hxzr3Yv0CV Love you brother https://t.co/QC97NAqsiL RT @AkilahObviously: There aren't multiple Americas. America is black, brown, trans, gay, non-binary, disabled, and more. If you don't like… RT @joshgad: The chasm between right &amp; wrong, sane &amp; insane, &amp; legal and illegal could not be clearer at this point. Tribal politics is bli… RT @repjohnlewis: I fought too long to end discrimination based on race and color to allow discrimination based on gender identity to be co… RT @zachbraff: This: https://t.co/We6Hb42COC RT @GeorgeTakei: History shall record that you are not only the stupidest, most incompetent president ever, but also the cruelest and petti… RT @PerezHilton: The irony of a draft dodger telling others they can't serve! https://t.co/xHtBLIOUil RT @kerrywashington: To the transgender men and women. Please know that I am standing with you. 🙏🏾 RT @PerezHilton: An embarrassment to our country. https://t.co/Rrb2mCbgaV RT @ladygaga: The message you have just sent has endangered the lives of people all over the United States and overseas bravely serving our… RT @billyeichner: I hope deep down Trump voters realize the increasing amount of psychological &amp; perhaps even physical damage they've done… RT @guillermodiazyo: There is no one tougher than my Trans brothers &amp; sisters!..like always, I stand and fight with you✊🏾🏳️‍🌈...shame on yo… RT @HuffPost: Trump did not like it when a reporter asked about his recent ban on transgender service in the military. https://t.co/jnjzvfU… RT @SalMasekela: There is a desperate, lonely, bitter, vindictive, racist, misogynistic, hateful, delusional, evil little boy playing a gam… RT @MattBellassai: transgender people show more courage when they leave their fucking houses in the morning than donald trump has shown his… RT @glamourmag: Senator Tammy Duckworth on Trump's trans military ban: 'This man is not fit to be Commander-in-Chief' https://t.co/LwccC1rR… RT @ingridmusic: I am utterly gutted and mortified by our President on a daily basis.  I can't even say this is a new low.  It's just anoth… RT @SaraRamirez: I will always stand in solidarity with my Transgender family. I see you &amp; I love you. Never ever give up. #TransIsBeautifu… RT @HRC: SHAMEFUL. This harms military readiness and puts lives at risk. There are more than 15K active serving #transgender troops. https:… RT @Alyssa_Milano: YES! I see you. I respect you. I stand with you. #NoTransBan https://t.co/ai6gKeXZ2R RT @NancyPelosi: President Trump's attack on #trans servicemembers shows a distinct lack of loyalty to our nation's heroes. RT @people: #TransRightsAreHumanRights https://t.co/sHSalPTpKl RT @TheEllenShow: We're spreading hate instead of love in our country today. RT @TheEllenShow: We should be grateful to the people who wish to serve, not turn our backs on them. Banning transgender people is hurtful,… RT @ChrisMurphyCT: Trump wants you to focus on Sessions, Clinton, and Scaramucci this week.  You need to focus on health care, health care,… Check out She Should Run . I just joined. https://t.co/DyTajWtYAF Just dreaming of the edit of this video. One of the most extraordinarily brilliant moments of an already insanely surreal life ❤️ GRATEFUL RT @tomcolicchio: Full transparency? I'm deleting old tweets, the tweets where you call your boss a fool. Trust me, there are screen shots.… RT @michaelianblack: Kinda seems like you backed down from your views on climate change and gun control. https://t.co/XbMQsCvjeY RT @billmaher: Scara- who? I know I am. Man, when Donald Trump puts the call out for asskissers, he is not. fucking. around. RT @mbonfiglio2000: Covering up/\"deleting\" your past is the exact opposite of \"full transparency\" https://t.co/N6t5zsxIyq RT @RWPUSA: These attacks on newspapers and networks are even more threatening to our democracy than the Trump/Russia scandal.  This must s… Harry styles on late late show is giving me all the feels #nicelydone #caniborrowthatsuit That was a dream come true my sweet friend. I ❤️ you! https://t.co/XoH767UOoE When you're undressing after hot yoga and a pacifier flies out of your sports bra...… https://t.co/FR7x2OfmXN I want to hug you so hard 💕 https://t.co/5UeLoolmv2 Soooooo beautiful https://t.co/oci8DagRcI Wow that's incredible. Incredibly incredible https://t.co/nRscxy3hMd A big flat grassy field. https://t.co/SL3Geqrt6h Ha! No one sleeps in this house except @hartluck https://t.co/q4A57OeHV4 Rock whatchya got. If u have your health you have everything. Gratitude. You a sexy bitch ❤️ https://t.co/Bg8HiFLJOg Laugh😆 https://t.co/X74vbmo7nK Brazil https://t.co/nqq0ON4L5I Yes I will. Its like my second home and I miss it and I miss the peeps https://t.co/v5lpdIGirN Well I'm shooting a video next week ❤️ https://t.co/9TgmEnk6Y2 ''Tv is broken https://t.co/KAwkRSqtm7 Madness is funnnn. My madness usually comes in the form of cuddles and home cooked dinners and laughter. And the occasional dance party 🎉❤️ https://t.co/CStBOXzz2H You made my day too. You were a total sweetheart and you have sunshine energy. https://t.co/ZcJJPmaxrr You know this makes me happy @hartluck https://t.co/IHFITxWbWQ RT @RepresentPledge: Little girls have been waiting over half a century for this moment.. #RepresentationMatters #DoctorWho #DoctorWho13 ht… Rad https://t.co/8CGv7dXVPy This summer, find free #SummerMeals for kids and teens in your neighborhood by texting FOOD to… https://t.co/GBBrrTMKkY I am very very excited about what's to come. https://t.co/xayifEh4eB Excited to be there after all these years 🙌🏽 https://t.co/ghVVg8xoUz RT @hartluck: The most important things in my life are my family and my motorcycles.  See how #IndianMotorcycleInk joined the 2. video link… That was a fun surprise today. Thanks team #rca thanks world 🌎 https://t.co/bsbG6kmGPi RT @markyplanet: 80,000 people @quebecOff @pink show sublime! Wonderful fans. So much love! @markyplanet #grateful https://t.co/FY8ayYx6GS So excited 😆 https://t.co/xjfQrVGTrQ Awesome photos!!! https://t.co/2Nn2bNGe4K markyplanet's photo https://t.co/kkXX11NTrc THANKYOU Quebec City 😍 my heart is full We're ready Quebec City!!! Well, almost! See y'all soon😍😍😍🕺🏽 @BeautybyYB https://t.co/wjMZwBoJIS RT @Alyssa_Milano: This. Is. Terrifying. https://t.co/II5EftfuGR RT @TonyKanal: In one week dreamcarmusic joins @pink at her #ACBeachConcerts show in Atlantic City. Hope to see… https://t.co/yJRPek1bII If you're in New York City and you want your soul to be moved- go and take in \"Seeing You\". You won't regret it. #relevant #dance #tears THANKYOU, Lori. That was 😎 awesome 👏 https://t.co/oPCOm71Q02 Mine and my daughters favorite song in our whole set. You are a force and I love to hear your power. Thank you. https://t.co/LFfbLynuIt Getting ready #summerfest https://t.co/DsHIs7ECas Hi💕 https://t.co/3sLfRE0JhS Hugs are healthy ❤️❤️❤️ https://t.co/0lLMNzmzBi The whole fam!!! I love it!!!! https://t.co/ZeZxavXpNn Yaye that makes my heart burst ❤️ see you there friend https://t.co/F3r8jp3lgu Donald Trump Is Much Uglier Than His Mika Brzezinski Tweet https://t.co/4WHEnMJT0L via @thedailybeast RT @joshgad: 22 MILLION. That's the population of Iowa, Delaware, Montana, South Carolina, Arkansas, New Hampshire, Mississippi, Kansas, &amp;… Interesting read.... thoughts? https://t.co/Bjx6KeqI83 Carey and I recapping our 100 mile bike ride adventure for #NoKidHungry on @AddPassionStir @ https://t.co/p19MkR0lpr RT @PerezHilton: Today we remember the victims of the #PulseNightclub shooting. You are NOT forgotten. ❤️💛💚💙💜 #OrlandoUnitedDay https://t.c… ❤️❤️❤️can't wait!! https://t.co/MCIYCJuM7F Yaye me too! See you there ❤️❤️ https://t.co/JFGiBkOFXY RT @TheJeffBridges: I’m digging listening to @Pink go the distance for America’s hungry kids on new podcast @AddPassionStir. https://t.co/H… RT @JayGordonMDFAAP: TrumpCare will harm kids. @AboutPediatrics @WFKARS https://t.co/1m2MsDI9DN RT @drmlb: Important info!  How #AHCA affects children.  Be an advocate to #PutKids1st! Call/email your senator! https://t.co/bkTUTnBOa5 RT @drmlb: @AmerAcadPeds The #AHCA is bad policy for children and dangerous policy for our country. @AmerAcadPeds RT @AddPassionStir: Chefs + rock stars on tmrw’s @addpassionstir! @Pink, @hartluck, @MarySueMilliken, @knashan @billshore Don’t miss it! ht… RT @jk_rowling: It's called 'leadership', Donald. The terrorists were dead 8 minutes after police got the call. If we need an alarmist blow… Memorial Day... honoring those who have fallen.  https://t.co/iBcj828l4q via @youtube So @KennyChesney &amp; I are nominated for a @CMT Award!? Let’s win this! Vote! https://t.co/tMqJ0WfjwL #SettingTheWorldOnFire 🤠🏆🔥 RT @MENnewsdesk: @Pink Please RT our fundraiser to support families after the Manchester Arena terror attack https://t.co/4IGf25Qa7R Feeding hungry children is not a political issue, it’s a moral one. Tell @WhiteHouse #handsoff core programs. https://t.co/3DHYhGUufy RT @sextdan: HERE'S ONLY A FEW MISSING PEOPLE AT THE CONCERT. PLEASE PLEASE PLEASE RT TO HELP THEM GET FOUND!!!! #ManchesterArena #RoomForM… My thoughts and prayers are with the people of Manchester, any one affected, @ArianaGrande and the entire crew. Heartbreaking RT @SonyMusicGlobal: Shout out to @kennychesney for winning Top Country Tour and Top Country Collaboration with @Pink! #BBMAs https://t.co/… Just posted a video https://t.co/RCAP3kY0rs Just posted a video https://t.co/ZhdxlSEKWJ Just posted a video https://t.co/Yq2dT0niBX Calling all kids &amp; families to get active &amp; help kids around the globe — download the FREE #UNICEFKidPower App now! https://t.co/5LvwX2OaZJ Calling on all kids and families to get active and help kids around the globe — download the… https://t.co/Ge3aQ5WHzY RT @billshore: Can't wait to ride 100 miles with @Pink and @hartluck on Thursday for #ChefsCycle for #NoKidHungry https://t.co/8aa284m2CP T-minus 100 days til @VFestival! 🇬🇧Can’t wait! https://t.co/1ozBvR8N2o 🔥 https://t.co/tyG4Ssoheu NO KID HUNGRY!!! Clink the link in my bio!!!! No amount is too small! #fightinghunger… https://t.co/kvd8kNNfyF lbreggy's photo https://t.co/ZXKtEw0PU6 Thanks! I do need it!!! https://t.co/8PuCz5vwBH Haha why yes, yes I do my friend 😜😘😍 https://t.co/MH857qltRJ Just announced! My ONLY East Coast performance this year is at the 2017 Atlantic City BeachFest on 7/12! Get Tix 5/5 https://t.co/R3mg0f7Ob6 https://t.co/MR0T96cNDD So there is this crazy awesome thing I’m doing to support @NoKidHungry and I need your help…. https://t.co/jxrVf8q3yE RT @shondarhimes: Tax $ never funded abortion. You eliminated cancer screening, STD testing, family planning &amp; women's healthcare. Nothing… Best thing I've heard in a while. https://t.co/DZc7MXbDof via @youtube WOW! 2 more nominations for me &amp; @KennyChesney. Thanks @BBMAs! #SettingTheWorldOnFire #BBMAs Tune in on May 21st on ABC Still laughing cause this dude is hot but he's a total dick  #Hipstamatic https://t.co/i8PCJzDn4o The @ACMAwards are this Sun. 4/2 &amp; I'm nominated w/@KennyChesney! #SettingTheWorldOnFire Tune in! 8/7c on CBS &amp; @CBS All Access #ACMs I am super excited to come back to Sziget Festival! Hope to see you there....\" https://t.co/882XcYvvSu https://t.co/4w9WOSliRv Oh😳 sorry. I'm late to my own party https://t.co/JXhVeqDo1h Excited to perform at @KaaBooDelMar in San Diego this September! Passes available here: https://t.co/ZTlgMz9MHY &amp; https://t.co/yoVuCLjniy🔥 I’ve added another show in Berlin Waldbühne. Aug 12th. Presale starts today, 10am at https://t.co/BsPduDM5Si I've just this second turned on the news 😡😢😿 my heart is hurting for the people in London who have been affected by yet another tragedy Tried out p90x 2 yoga this morning. Aside from @JeanetteJenkins power yoga this is my favorite. Happy girl. Namaste 🙏🏾(not an ad,just sayin) I’m coming to Berlin! So excited to play Waldbühne on August 11th!\nExclusive presale starting Wed at 10:00 am https://t.co/BsPduDM5Si I’m standing up for America’s kids. Tell Congress to reject the President’s budget proposal. Call:877-752-6479 #NoKidHungry https://t.co/KbrPhtI0Up RT @stevesilberman: The boy who would grow up to help invent rock and roll: Chuck Berry. RIP. https://t.co/tPkCttvEC1 RT @Sia: #Waterfall is coming to life! Watch the video for Sia x @Pink's collab with @stargate 💫 https://t.co/ExZijaBhuX - Team Sia Worked w/@Stargate &amp; @Sia on a new song! Excited to share #Waterfall. Pre-save now on @Spotify: https://t.co/Wp3rnMmFNN #WhoIsStargate 🌟 RT @idolator: .@stargate reveal the cover &amp; credits of their collab with @Pink &amp; @Sia: https://t.co/hkLD0NXX0k https://t.co/aKin85Etsf #WhoIsStargate? ;-) @Stargate https://t.co/4Qlko0avV0 Canada! I’ll be performing @OttawaBluesFest July 9th! Tickets available now @ https://t.co/zZEk7EVjf1 #RBCBluesfest2017 🇨🇦 Headlining @Virgin @VFestival! 19Aug Hylands Park, Chelmsford 20Aug Weston Park, Staffordshire. Tix on sale 9AM Fri! https://t.co/17Ve93N4PC https://t.co/5Tg649VPqu RT @TheEllenShow: Just seeing the news about removing laws protecting trans people. This isn’t about politics. It’s about human rights, and… RT @1capplegate: Never! https://t.co/rc8Gp12cHb RT @SenSanders: Good thing we have Donald Trump, a pathological liar, to tell us the “truth.\" https://t.co/xOHbu3ixs7 Spits out coffee*** Thx @ACMAwards! @KennyChesney &amp; I are nominated @ this year’s #ACMs for our duet! 🔥 #SettingTheWorldOnFire My life is made. I can say I lost a Grammy to Dolly Parton. Thanks Universe. RT @StephenAtHome: Please please please represent yourself in front of the Supreme Court. I'll never ask for anything else ever again. http… Help LGBTQ and go to @UseYourHeartTee and grab a tshirt. Proceeds go to @TrevorProject 💖 https://t.co/I4J6L9qSLt Child #refugees deserve better. A powerful video from @UNICEFUSA:https://t.co/CiGZAMdSIS #childrenfirst Please watch. 😭😭😭 Watch “Karim Sulayman - I trust you” on #Vimeo https://t.co/37R4lNmXTa Donald Trump, Pirate-in-Chief https://t.co/GFAulKoZ7k via @newyorker What Sally Yates Proved About Donald Trump https://t.co/V8uWJYnCHq via @tnyCloseRead #Refugee children, migrant children, internally displaced children — they’re all #childrenfirst:https://t.co/Uj9xRGZec6 via @UNICEFUSA A Dangerously Isolated President https://t.co/Ypn8mhZuhQ via @newyorker There aren't words for this shameful person. https://t.co/ow7R7iEI1E I'm so so sorry for your loss and send you the biggest warmest hug in the universe and all the love in the world https://t.co/wu6h6lX0fR I'm sorry to hear that babe:) sending you love and light.\nI always try 2 think of what I'm grateful for when I'm super sad... seems to help https://t.co/QYeKXOHiPN Today was a beautiful day to be proud of. Im proud to have a voice, to have the courage to use it. I'm proud to be a woman, I'm proud of us. RT @red_fang_25: @Pink funny how they tell you to stay out of politics because you're a celebrity meanwhile they voted in the reality star Entire ass. And I'm out ✌🏼️ If you don't stand for something, you'll fall for anything. Anyone that doesn't like my fighting spirit, you have an open invite to kiss my Fight for anything. Dissent is the cornerstone of democracy. you've missed the entire point of having rights- or more accurately- you've probable never had to.. I'm so tired of all of you ignorant AF people who say we have nothing to March about. You should be happy that people care enough to do this Songs of mine u should listen to: dr mr president-I have seen the rain (my dads vietnam song) I've been an activist all my life u dumbass https://t.co/wq6Qggafw7 Today we march https://t.co/UwJCb1Bflv Donald Trump’s ‘American Carnage’ Inaugural https://t.co/ZxCoMh265C via @thedailybeast RT @SarahKSilverman: I mean... https://t.co/IlrUVrXCwv Happy birthday Christine! Sending you 70 hugs and one for luck xo https://t.co/K5DYCIsOsH John Lewis, Donald Trump, and the Meaning of Legitimacy https://t.co/4jwAzhkmXx via @newyorker What Coretta Scott King Would Tell Us Now https://t.co/LAv5mS67qT via @thedailybeast RT @UNICEF: “The best thing to hold on to in life is each other” Goodwill Ambassador #AudreyHepburn 💙. https://t.co/0JpoWb1Pfi RT @HuffPostWomen: National goddamn treasure https://t.co/EADeGoQFLn @96SLAY @DirtShark (I mean muddolphin) I heard you wanna get the party started. Careful there little dudes. Celebrate the #MagicofStorytelling! For every #shelfie posted @Disney will donate a book to kids in need through @FirstBook! https://t.co/S5pSRpCs8q How fun is that? 😍 https://t.co/wVdU6seCdz Jameson Moon Hart 12.26.16 https://t.co/TQXK6Zo1ow #ChildrenofSyria in #Aleppo &amp; other besieged cities need help. UNICEF can give it. Please do whatever you can: https://t.co/CmWNjixo7h Let's do everything we can so that Syria's children can have brighter futures. Turn #LightsOff4Aleppo - take action: https://t.co/QFHXBMGbVo https://t.co/GAl6at4zrn We cannot sit back and watch #Aleppo #Syria crumble. Here’s how to help: https://t.co/2Tk4E4KC5V RT @UNICEF: #Syria: It's time for the world to stand up for the children of #Aleppo and bring their living nightmare to an end https://t.co… I made donation. Can any of you? https://t.co/YWVEUbBjH9 My daughter just told me my butt is gigantic. Gigantic and awesome. Her words. Thanks babe Yaye! Thanks❤️❤️❤️ https://t.co/Izaj6RAV0C Uh oh. Now I'm a mommy shamer shamer. This was a really good laugh. Enjoy over a cup of coffee. https://t.co/2so3JTVBV9 I'm sending you so much love and healing light 🙏🏾💞💞💞💞💞 https://t.co/4F8PRgseiT Ok that's amazing!!!!! And so is this little beautiful butterball https://t.co/caJbKbllsS Sending you a kiss right now 😘😘😘😘 https://t.co/rzUy7pjORv Give a holiday gift that saves a life! Check out @UNICEFUSA Inspired Gifts: https://t.co/hDMNRWJHfm #GivingTuesday #StandForHope https://t.co/FWTfFRxEYl This holiday season I’m supporting #NoKidHungry and their work to feed kids in need. Join me: https://t.co/j9RyrvXSiu #GivingTuesday https://t.co/ZKIihqvcda Oh honey my heart is with you both. ❤️❤️❤️🙏🏾 https://t.co/lz9LimY5Qb Happy 30th Anniversary to The ARIAs, good luck with the show tonight!!!!! ❤️ @ARIA_Official / #ARIAs RT @BetteMidler: Inhuman and vicious beyond belief.  Didn't think I could feel any worse.  The shame, the shame! https://t.co/TUz9B2oKmN Amazing and so timely! https://t.co/jjQWsXmsCC Yep that always works. Xoxoxo https://t.co/QtSIMG9WrZ I know but omg it's so hard though you guys it's like picking low hanging pieces of dumb fruit 🍉 https://t.co/prfdv4XKbA Hahah yes! Sending you a gigantic warm fuzzy hug https://t.co/po1YjaEB3n AmAaazing!!! Can it have lots of opinions? Can the doll shout things? That would be stellar. ❤️ https://t.co/YXpgoJGvah Another person that thinks we should all bury our head in the sand and not vote or be educated. Sad. But he likes my singing!!!💃💃💃💃💃💃 https://t.co/lnDuj0Qszm In fact thanks Stash:) I'm gonna go give it a listen right now. Thanks for adding to my musical Saturday. You have a blessed day sweetie Can we all talk about the song 'not ready to make nice' by Dixie chicks? So good. That whole record really. So.\nGood. Love them. Just FYI I'm gonna go finish this delicious omelette now so if you want to insult me, it's gonna have to wait a while. Happy Saturday! Well said https://t.co/PW6QKGwV5r RT @MarkRuffalo: #NotNormal \"Go Trump,\" swastikas spray-painted at Beastie Boy Adam Yauch's memorial park https://t.co/wsoVEVyPTR # via @Hu… RT @KHMakerD: @Pink @SueInWA You know what's getting old? Having to deal with racism. Is it? Already? https://t.co/QiXd5XFKQX RT @DaleSides: @Pink if he bothers you this much you can leave Donald Trump has asked someone to apologize for being rude. Always good to start your Saturday off with a laugh. That's cool https://t.co/peRxO03Y1Q Rest In Peace Rod Spicer. Billy B and I did this shoot together with Rod at Rods place in NY. For fun❤️ he was amazing https://t.co/6whE7VvJpr This made me cry so much 🙏🏾 https://t.co/v8YQQIQbVy RT @CNN: Sen. Harry Reid to Donald Trump: \"Rise to the dignity of the office...instead of hiding behind your Twitter account\" https://t.co/… Ok! Ok! Ok! I’m heading to Milwaukee to headline the historical music fest - SUMMERFEST’S 50TH CELEBRATION on July 2!  #CantWait https://t.co/d4qFyx6qeB I love you goddess woman. Thank you for capturing this special moment ❤️❤️❤️ you're incredible https://t.co/3Ki7v4VUwV Surprise! https://t.co/EMb1Id2ToC Let's all take a collective deep breath. I'm gonna go do what I do best. Which is sleep. Deeply. I'm gonna dream of respectful dialogue xoxo I thank you for your beliefs as well. I'm not mad at you either. https://t.co/YIjlCBxcrJ You should go listen to a song I wrote called 'dear mr president' since you like my music so much ✌🏼️i may not notice the loss https://t.co/qtyvmH8agX The spelling is the MOAST important part https://t.co/t1ApimUTTT It's okay 😘 I can take it https://t.co/3aiDnAuq8i I think everybody's worth it ❤️ https://t.co/3SDEjAPRhD RT @sunshines_heart: @cfin1964 @Pink @Change All of America lost.The real ones wont leave. They will stay and fight because they love what… RT @Elle_rebel88: @Pink @cfin1964 @Change why is it that we are being told-if u dont like it, leave. Instead of- if you don't like it, get… RT @chrizly72: @cfin1964 @Pink @Change \n... (that was 4 years ago when the Republicans lost). So ... https://t.co/BrXyXxttJT RT @donnie_howe: @Pink @cfin1964 @Change He can't even spell 'lose'. I wouldn't bother with him. At least I'm not suing like your president was going to if he \"lost\" - you know, since it's all rigged. Peace and love https://t.co/ukDDkSK9IH Electoral College Electors: Electoral College Make Hillary Clinton President on December 19 - Sign th... https://t.co/aCSR4Rovgp via @Change RT @yokoono: Use a negative situation as the spring board for positive awareness I asked racists and sexists to unfollow me on IG and lost 2k. I feel like I feng shui'd my apartment. De-cluttered and happy https://t.co/v0JMzDbnS5 RT @BillyMann: Friends/Loved ones: LGBTQ African American Hispanic Muslim Jewish Catholic Christian Atheist Republican Democrat Socialist.… Highly recommend- no matter what side you fall on https://t.co/Ta7uMZBq4L RT @RachelleLefevre: The numbers don't lie: If you voted for Gary Johnson or Jill Stein, you voted for Trump. You were told. Don't ever tel… RT @HuffingtonPost: America just elected a man who said \"Grab them by the p***y\" over the first female president https://t.co/1cl775kvjF ht… RT @robdelaney: Seen some lovely tweets from sober brothers/sisters about not drinking/using right now. I'm sober &amp; I won't drink today. Do… RT @TheEllenShow: .@HillaryClinton, however this ends tonight I am so proud of you and so honored to be your friend. RT @ChrisEvans: This is an embarrassing night for America. We've let a hatemonger lead our great nation. We've let a bully set our course.… RT @MarkRuffalo: You know what we do now? We finish building what we started and we FIGHT BACK! Lift your heads up brothers and sisters. RT @conniebritton: Dear Muslim, Mexican, immigrant, refugee, handicapped, black, gay, female humans beings, &amp; also dear Earth...you are not… RT @USATODAY: \"It’s so great our enemies are making themselves clear.\" https://t.co/9Qo2zjLnIh RT @IMKristenBell: The hate tweets Im getting based on trying 2 promote unity inspite of division is a perfect example of how his hate has… RT @thecapitalv: What a privilege it must be to be able to look past a presidential candidate's racism because it won't ever affect you. RT @jes_chastain: The positive element from all this is that we can no longer pretend that we are free of racism &amp; sexism. The question is,… RT @pjhelliar: I freely admit I underestimated Trump. I just didn't feel pussy grabbing was a strong enough platform to run for President.… RT @cher: world will never be the same. I feel Sad for the young.🚽will never be more than the toilet, I’ve used as a symbol 4 Him.\nU Can’t… RT @anildash: No matter what, we have to organize &amp; stand up to Trump and fight for the marginalized. I am not afraid of that motherfucker RT @iamrashidajones: I just want to remind everyone that we are looking at a very close race with a presidential candidate who was endorsed… RT @thedailybeast: If elected, Donald Trump's cabinet could be the worst this country has ever seen: https://t.co/G0YHHlaXeO https://t.co/X… RT @joshgad: Don't recognize this country tonight. If Trump wins, get ready 2 lose a lot of money tomorrow followed by a lot of rights for… RT @jpbevi: This is not a sporting event.\nThis is not entertainment.\nThis is a statement about humanity.\nAnd it's not a good one. #Election… RT @thisisjendoll: Never underestimate how much people hate women. But. Never underestimate women. RT @cher: IF🚽WINS,HE WILL STILL BE WHAT HE IS NOW…A PETTY VENGEFUL,COWARD‼️AS GERMANY WAS IN THE 30′s, THERES AN ANGER,A RAGE, THAT HAS CON… RT @arnettwill: How do we explain this to future generations of women? And minorities?\n#weshouldbeashamedofourselves RT @junkielyonne: it's 👏🏼 not 👏🏼 normal 👏🏼 or 👏🏼 okay 👏🏼 that 👏🏼 so 👏🏼 many 👏🏼 people 👏🏼 are 👏🏼 rightfully 👏🏼 terrified 👏🏼 of 👏🏼 a 👏🏼 possi… RT @laurenduca: At this rate, Mexico should build the wall to keep US out. RT @baratunde: Whatever happens, we have lost. Half this nation voted for white supremacy, sexual assault, and more. The Klan is happy. We… RT @ddale8: We have our third voter fraud arrest of the campaign...and it's a third Trump supporter. Amazing https://t.co/xBIxpUzeO0 RT @brianrayguitar: In other news: https://t.co/6e4pYXrW4T RT @kurteichenwald: If Comey believes that his letter today bails him out from having interfered with election repeatedly since July, he is… RT @MMFlint: BREAKING: FBI director in new letter pulls back from last week's letter, declares FBI holds SAME conclusion from July: HILLARY… RT @FoxNews: FBI sends letter to Congress saying email review completed, decision not to prosecute Clinton stands\nhttps://t.co/NTO0mo1ig9 RT @people: FBI stands by decision not to charge Hillary Clinton after finalizing review of additional emails: https://t.co/L8ewxY5QlA I'm putting this up in hopes of spreading cheesy happiness all over this Sunday + also hoping someone makes me some 🧀https://t.co/rTwCEjvupT This is beautiful thank you so much https://t.co/hXVXP40hzO And now some of this 💞 https://t.co/VdVVLEcOc4 This looks awesome!!! I'm gonna start with sock monkeys ❤️❤️. 5 Crafts Kids Can Make for a Good Cause https://t.co/Ze6Rky9yax RT @PinkFans_: How fun!!! :o) Check it out....The lil girl in Just Like Fire Halloween costume finds out the @Pink responded to her photo!!… Congrats @kennychesney on your pinnacle award tonight, and that #1 album you got on iTunes, and that #1 song you got goin on 😍😍 Get it girl ! https://t.co/FujpeWjfl3 So good!!! https://t.co/ujnIWbzKxw Here's a blanket statement for all you angry fingered trolls. This nasty woman right here doesn't have a mute button. RT @tattooed_vet: @Pink  As a combat vet, I served to ensure you both have that right and everyone should have a voice even the ignorant @Y… So I should stop re tweeting about charity too? Bullying? Love? I should just shut my female mouth shouldn't I? Just smile and look pretty? https://t.co/Mecp7wbMWU So you're saying I shouldn't vote? https://t.co/RpqmxJbzHd RT @HillaryClinton: With just 10 days to go, Republicans are pulling out all the stops to try to bring Hillary down. RT this to help get ou… RT @kennychesney: I feel so fortunate that @Pink lent her voice/God-given instrument to this record. #CosmicHallelujah: https://t.co/ba1inq… Whad'ya get when u mix Julia Roberts with LGBTQ equality love? This! https://t.co/5CCIoq45tX \n#happybirthdayjulia RT @AirplayCountry: Congrats to @kennychesney and @Pink for going #1 with \"Setting The World On Fire\"! His new album \"Cosmic Hallelujah\" co… Aww thanks friend! https://t.co/wndf60uG0k RT @jormataccone: POPSTAR OUT TODAY!!!!!!MEMORIES FROM SET WITH THE FANTASTICAL @Pink https://t.co/jwPVwSQChp https://t.co/2bTAqufnxW I HIGHLY recommend the Documentary 'the mask you live in' everyone should watch this. RT @MTVNews: me when trump said \"bad hombres\" https://t.co/vWROnegjpk RT @BiIIMurray: I can not be held responsible for what my face does when you talk. RT @kennychesney: #settingtheworldonfire @Pink / https://t.co/fbZNJnsmU5 https://t.co/pEFNzbM0d4 Wooohooooooo I'm in good company 😍 https://t.co/StluJJdeJw Wondering how you can support children in #Haiti affected by #HurricaneMatthew? Here are 3 ways to help: https://t.co/pgdV7RMJEr @UNICEFUSA https://t.co/mLoNG0Mvg9 I'll be doing this with my daughter every morning from now on. ❤️❤️❤️ https://t.co/TTfXgOC9oL via @youtube RT @VevoCountry: Follow a Hollywood love story in @kennychesney's #SettingTheWorldOnFire with @Pink. https://t.co/4DbszjLBo2 https://t.co/g… My daughter is getting an education right now #favorite https://t.co/7HhhoRUWaC RT @erinruberry: Hillary is proof a woman can work hard, rise to the top of her field &amp; still have to compete against a less qualified man… RT @CNN: #CNNRealityCheck: Trump on San Bernardino attack: \"Many people saw the bombs all over the apartment.” That’s FALSE. https://t.co/N… RT @MMFlint: Trump to Muslims: \"If u see hatred going on, u must report it.\" Ok, I'm reporting it. You are the source of the hate, Trump. RT @shondarhimes: LOOK AT HIM, AMERICA.  HEAR HIS WORDS. We are at DefCon Level Check Yo'self Before You Wreck Yo'self. RT @HuffingtonPost: \"I know nothing about Russia.\"\n— @realDonaldTrump, Oct. 9, 2016 RT @HuffingtonPost: FACT CHECK: Trump supported the Iraq invasion. #debates RT @shondarhimes: \"We are not at war with Islam.\"  Damn straight, HRC.  We are at war with terrorists. #Debates2016 RT @joshgad: I feel like I'm watching Satan on live TV RT @Alyssa_Milano: Our Founding Fathers must be rolling in their fucking graves. #debate Every Woman in America Knows Donald Trump and Billy Bush https://t.co/na49J4rtSL via @thedailybeast UNICEF is ready to provide lifesaving aid to the areas hardest hit by #HurricaneMatthew. You can help: https://t.co/8IXLcHjrAv https://t.co/WNh1Fpgpkg Holy shit Carey just told me that people eat Guinea pigs. I am putting a lock on their cage and changing my gate code 6 million children are in #HurricaneMatthew's dangerous path. Here’s how you can help them: https://t.co/8IXLcHjrAv via @UNICEFUSA https://t.co/ikm03ssC88 RT @ABC: Young girl to Charlotte City Council after shooting death of Keith Lamont Scott. \"I can’t stand how we’re treated.\" https://t.co/i… RT @joshgad: You cannot erase facts Trump. You can lie about it. You can pretend we're all idiots. But you cannot erase what you've said. h… RT @jerryspringer: Hillary Clinton belongs in the White House. Donald Trump belongs on my show. RT @BernieSanders: Speaking of generals, four-star General Colin Powell referred to Trump as “a national disgrace” and an “international pa… RT @Zendaya: 🍵 https://t.co/UFdpaE8Jrh RT @katyperry: Must be the prep lol  https://t.co/ds5tG6XjVn RT @billyeichner: It may not be a communist - it might just be a fat person! RT @christinawilkie: Trump: \"I was just endorsed by ICE.”\nFACT CHECK: Immigration and Customs Enforcement (ICE) is a federal agency, and do… RT @ml_boardman: Couch ovation to @LesterHoltNBC for pressing @realDonaldTrump on the birther stupidity. #debatenight https://t.co/kfeWXVMs… RT @BetteMidler: Oh, look, Hillary invited her friends Sanity and Experience to the debate. RT @joshgad: This is an IQ test America. If anyone not wearing a red dress on the stage tonight appears presidential to you, you are flunki… RT @katiecouric: .@LesterHoltNBC tells @realDonaldTrump Stop and frisk was ruled unconstitutional in NY and Trump says \"No, you're wrong\" #… RT @joshgad: Let's keep guns on the streets but stop the violence. Do people hear the English words coming out of Trumps mouth? #debatenight RT @JayGordonMDFAAP: He is very easily rattled. \n\nNowhere near fit to be a candidate let alone a president. RT @jessirklein: Annnnnnnnnd there ya go. In answer to not having paid any taxes he says  \"that makes me smart.\" No. it makes you an unpatr… RT @katiecouric: .@HillaryClinton says she has a feeling she’s going to be blamed for everything during this debate, @realDonaldTrump respo… RT @shondarhimes: OMG, can you imagine this dude in a meeting with ANY other world leader? #Debates2016 RT @MTVNews: \"look at my website\" - donald trump https://t.co/R9NideKaJG RT @BernieSanders: If Trump is concerned about companies going abroad maybe he should move his plants out of Bangladesh where workers are p… RT @shondarhimes: It's like Albert Einstein is trying to have a thoughtful discussion with Biff Tannen from Back To the Future. #Debates2016 RT @sweetestsara: \"that's called business\" only a sick person wishes people would lose their homes for the sake of their own personal gain RT @joshgad: This akin to the Lincoln-Douglas debates if Lincoln was debating against a very mentally ill and Orange version of Cookie Mons… Debate starting in 22 minutes. How quickly do Tums take to work? #debatenight #ImWithHer RT @tomcolicchio: Congratulations @realDonaldTrump you are the best at being the worst. https://t.co/h5ZHqv4nOz Pope says journalism based on fear-mongering, gossip is form of 'terrorism' https://t.co/RXalYTiwUX via @Reuters 💞 RT @BetteMidler: Just heard the terrible news about the bombing in Chelsea. Thanking ALL the Gods that no one died.  Speedy recovery to ent… Well I love ya @Corey_Feldman and I know how much it takes to get up there and do your thing. Keep your head up and know that you're loved❤️ We're fighting about gremlins. He uses Friday the 13th as his argument.  https://t.co/4EcSyPM0Kf RT @katiecouric: So proud to be a part of the @SU2C telecast tonight! A huge thank you to everyone who continues to support our mission to… Thank you, Celine. You are heart, and soul. You are strength, and grace. You are incredible. Sending you the biggest hug right now. You know you're officially a hypochondriac when Web MD wishes you a happy birthday My heart just turned into a gummy bear 😍  https://t.co/Hfmk2V4izL No YOU ARE  https://t.co/G5eo5PGI6k Thank you to all of my friends all over the world that have taken even a second out of their day… https://t.co/GDbxuTZNmm Oh my goodness I ❤️her https://t.co/WPOrl8M7HG Thanks guys I ❤️ up right back!  https://t.co/aHODnb9xTi RT @mf_nash: Happy birthday @Pink \"I have seen the rain\" written by mr jim moore alecias daddy the 1st song @pink ever learned 💕 https://t.… RT @celinepodcast: Recovering, brand new song by @celinedion written by @Pink released tomorrow! Sample here: https://t.co/0mMVBkIDNx https… All Sept help make #NoKidHungry a reality by dining out and donating to end childhood hunger https://t.co/W4JRo8KPoD https://t.co/uE3iPiXmdu \"If your heart is a volcano, how shall you expect flowers to bloom?\" -Kahlil Gibran https://t.co/bMch03oFTT RT @UNICEF: A world where every girl and boy has an opportunity to learn and succeed. That’s our wish. @UNICEFGhana https://t.co/lpe2PLofiO TBT 2001..... Yes with with the dreads and the #f*ckmeimfamous t... And that got young thang… https://t.co/DbdRTd2TQ7 Literally crying.  https://t.co/PSjAGgZp47 So. In. Love. https://t.co/H34kTcHxAM Join @TeamRefugees this summer! Love &amp; sport have no borders. #TeamRefugees https://t.co/LvGWECKye1 In honor of #nationalbreastfeedingweek2016 I proudly post this photo of a very HEALTHY, NATURAL… https://t.co/ms7c70RyCl #JustLikeFire #ThroughTheLookingGlass coming home on October 18!\nhttps://t.co/9gxsZRxQoY This guy ❤️ his new album comes out August 26th and it's called Stay Gold and he's amazing so go… https://t.co/ou55TTl1Jo Wooohooooo women's gymnastics is starting come on team!!!!!!!!!!!!!!!! #RioOlympics2016 Thanks @billboard for the trip down memory lane 💞 https://t.co/u1KxELmjps \"I'm gonna be in the Olympics, maybe for cartwheeling or climbing or something\"-Willow Excited for #BeatBugs on @Netflix! Hear me sing #LucyInTheSkyWithDiamonds on @AppleMusic - https://t.co/oIQ1TUfHlA RT @mercola: Life is short. Be sure to spend it with those who make you laugh and feel loved. \n#Life #Love #Love https://t.co/gZdoKi2HO0 RT @UNICEF: At home and in the workplace, support is critical for #breastfeeding mothers. https://t.co/HNrhiDeSKz RT @joshgad: Folks, it's not about politics. It's not about Left or right. This is about right vs wrong. This man is a disgrace. https://t.… RT @camilluddington: Warning- extremely disturbing- sign the petition.. Find Criminals Who Stuck Puppies to Ground With Hot Tar https://t.c… Excited to share a duet I recorded with @KennyChesney! Check it out: https://t.co/nSTOVk1V9f #SettingTheWorldOnFire🔥 https://t.co/kSrdDw7MMf RT @kennychesney: #SettingTheWorldOnFire is #1 all genre on @AppleMusic. Thank you for loving the music! https://t.co/IeuXkPLsFc https://t.… RT @AppleMusic: Look forward to new music every Friday on the #BestOfTheWeek 🔊\nhttps://t.co/nXpYWVKe1u RT @Alyssa_Milano: #Munich, I'm thinking of you and making healing wishes for you and the rest of humanity. RT @mic: After the violent arrest of  #BreaionKing, one of the officers told her black people have \"violent tendencies\" https://t.co/NM00Ku… Thx @TheWideboys for the remix of #JustLikeFire @AppleMusic https://t.co/IhaWUnnjrU @Spotify https://t.co/XrbNJBzKlx https://t.co/MVp8lICDvP RT @daxshepard1: I get a lot of tweets telling me celebrities should shut up and be opinion-less. From people voting for a celebrity. RT @Alyssa_Milano: #NotMyVoice RT @ElizabethBanks: Bring it. #FactCheck #RNCinCLE https://t.co/kCjSx5pWdL RT @Alancumming: He thinks LGBT is a sandwich RT @billyeichner: Mike Pence is a man of great character who still promotes \"conversion therapy\" for gay people #great #guy RT @iamrashidajones: I prefer my voice to sound less hateful and fear mongering, thanks so much tho https://t.co/2XrcVX2wpq RT @iamrashidajones: https://t.co/Sa2MYO30J9 RT @PolitiFact: We've fact-checked Trump 168 times as a presidential candidate: https://t.co/wwLGyiHeTc #RNCinCLE RT @tomcolicchio: I read the speech, listen really really hard but you're not going to hear a plan RT @joshgad: Eh. Trump's speech sounded much better in German. RT @Alyssa_Milano: Top: Republican interns. \nBottom: Democratic interns. \nWhich reflects the wonderful diversity of our country? https://t.… RT @joshgad: This behind the scenes image of Trump after officially getting the nomination is very upsetting. https://t.co/ZNioDc4ijk What?!?! She's playing July 28th in La?!?!?! You have to see this woman!!!!!!! https://t.co/V9Qtb6xHIt RT @OfficialJLD: This is a national nightmare. #GOPConvention RT @tomcolicchio: Nothing I heard tonight will make America safe, scared yes but not safe RT @UNICEF: On what would have been Nelson Mandela’s 98th birthday, we honour his legacy of peace &amp; nonviolence. #MandelaDay https://t.co/e… RT @UNICEF: “As long as poverty, injustice &amp; gross inequality persist in our world, none of us can truly rest” #MandelaDay https://t.co/7GR… RT @glamourmag: A police officer killed in Baton Rouge wrote this beautiful plea for unity just days before his death: https://t.co/oQV0ieR… Your response has been amazing. There's no doubt that we all feel the same. Keep spreading the word &amp; sign: https://t.co/tVkYgcgmQR #23ways RT @billmaher: The NRA says what happened in Nice, France cld have been stopped if everyone in the crowd also had a truck RT @lilyallen: Oh Turkey. I cannot imagine how terrifying it must be for people there on the ground right now.Stay safe, the world is watch… RT @EllisMate: The more people put hate &amp; terror out there the more love &amp; understanding the rest of us need to put out there. Life's to sh… RT @TayeDiggs: “History, despite its wrenching pain, cannot be unlived, but if faced with courage, need not be lived again”- Maya Angelou RT @UNICEF: Large majority of people oppose FGM in countries where the practice persists https://t.co/TTypnz0awk #endFGM https://t.co/uKZPd… RT @UNICEF: ⅔ of men, women &amp; children in countries where FGM is common say they want the practice to end https://t.co/TTypnz0awk #endFGM The time is now. Sign your name. Spread the word. Make change.\nhttps://t.co/M5V1pm6pjf #23Ways RT @TheEllenShow: Another reason why I’m inspired by my friend Jennifer Aniston. https://t.co/OIePJ4AVeu unisoultheory's photo https://t.co/JjE9Fz8nB1 This summer, text FOOD to 877-877 to find free #SummerMeals for kids and teens in your neighborhood #NoKidHungry https://t.co/zVkuvUfgv6 RT @ABC: Dallas Police Academy cadets hold a moment of silence for the #Dallas shooting victims. https://t.co/sjuWakpm3W\nhttps://t.co/3Lrhv… RT @UNICEF: Today is #WPD2016! Let’s call on world leaders to implement policies &amp; make investments that allow girls to determine their fut… RT @MichaelSkolnik: Dear Whiteboys: A 14 yr old white kid, Royce Mann, waxes poetic about white privilege. #BlackLivesMatter\nhttps://t.co/Q… RT @Alyssa_Milano: 💔 The Bravest Little Girl In The World: \nhttps://t.co/QOYEm5nb4k RT @BetteMidler: Read it and weep.  Put the binoculars down and really see your brothers. Death in Black and White, via @nytimes https://t.… RT @marykarrlit: Very moved by this post from a stranger's run-in with a #Dallas cop. #hope #compassion https://t.co/wf2GbohysF Sending it right back atcha ❤️💞😍😘 https://t.co/AtPN4r8ici RT @BetteMidler: A vicious downward spiral that will end our republic if there is no change.My heart goes out to the families of EVERYONE w… RT @iamrashidajones: It's ok 2 mourn the senseless death of the officers &amp; still want respect for black lives. Both are important. Humans a… RT @Alyssa_Milano: VIDEO: Martin Luther King, Jr. I Have A Dream Speech https://t.co/gEhpbdFFJ6 RT @shondarhimes: Words don't get people killed. GUNS get people killed.  BLM deeds equal intelligent discourse.  Guns equal violence. http… RT @sydneyleroux: We need to stop killing innocent people. Period. Louisiana, Minnesota and now Dallas. My thoughts are with all families t… RT @charlie_simpson: I don't want black men shot at traffic stops. I don't want cops shot by snipers. I don't want kids shot at school. I d… RT @donnabrazile: \"I have decided to stick with love. Hate is too great a burden to bear. \" -- Martin Luther King Jr. RT @joshgad: There is tragedy. We answer it with tragedy. We demand justice. We seek vengeance. We hang our heads in sorrow. Sad week in th… RT @katiecouric: Now CNN reporting up to 9 police officers wounded during protests in Dallas. It feels like our country is unraveling... RT @jennyjaffe: Times Square shut down. #BlackLivesMatter #NoJusticeNoPeace https://t.co/LAhT0oq9jW RT @johnlegend: Being against cops killing is not equal to being for killing cops.  We need peace in our streets. Well said family. thehitlife's photo https://t.co/m8VMjFFpvd Heartbroken for #altonsterling's family and friends. RT @MarkRonson: And thank you to @Bloodpop for involving me in this incredibly intentioned, beautiful song  https://t.co/iIzTubbVPS RT @unicefusa: NEW #UNICEFKidPower Missions now avail. thru Kid Power App! Get active &amp; save lives w/@Pink: https://t.co/G3KpXkMqIn https:/… Introducing ‘Hands,’ a musical tribute to benefit Orlando victims &amp; LGBT orgs. #ForThe49 https://t.co/WHr7tfCBlu RT @UNICEF: Cute little snuggle. We hope you're having a great weekend! @UNICEFChad https://t.co/me5nPUMN8y I'm playing my favorite artists &amp; talking @unicefkidpower on @SiriusXMPulse this weekend. Tune in to hear my Top 10! https://t.co/yhzEwhGUBk Yuri supports Haiti with his music. Hear his full song &amp; story in my @unicefkidpower mission https://t.co/4wI92xZN2y https://t.co/sduXcnIgGn Yes, of course. My prayers are for our whole world these days.  https://t.co/XjQI3rpesj RT @UNICEF: Play is crucial to overcoming trauma. Pictured, #SouthSudan refugee children at a child-friendly space in #Ethiopia https://t.c… RT @HuffPostParents: Police department offers special \"tip\" for parents with kids in crowds https://t.co/ti3WLuUC3w https://t.co/hMpHFyOwQ5 Sending heartfelt condolences and many prayers for those affected in Turkey. RT @EllisMate: Went into @siriusxm early yesterday &amp; bumped into @pink !! I love her &amp; her stupid husband… https://t.co/JztWAMJW2n Woohoo! https://t.co/hPanDTfgAH RT @billmaher: When it comes to lowering the bar, the #WhinyLittleBitch has really raised the bar.\nhttps://t.co/D5L4vRrauO This is amazing!!!!! https://t.co/bGVJRUxIYo RT @ChrisMurphyCT: 15 hrs on the floor. 2 hrs of sleep. And I'm back on my (tired) feet, ready to keep pressing Congress to end its silence… Welp, I do love the socks off of most of you. The rest of you unhappy fuckers? Good luck with all of that. And I'm out. And I love you back  https://t.co/I8gZIBbhUh Agreed  https://t.co/GeBtJnNAiJ Gorgeous!!! https://t.co/SeJBK58nF9 My new stripper name!  https://t.co/z3WZU4s58D Listen friend, stay hydrated. 😘 https://t.co/b7JpZsum2V I'm gonna give it a go! Greetings!  https://t.co/wFeYuYt50p Okay. Hi.  https://t.co/WffE4CszzY Cockwombles. That's my new favorite word. Thank you  https://t.co/JT5yPvOuuR Thank you for that thoughtful gem  https://t.co/sFyOqf1mNN TROLLS, your insults go a lot further if you can manage to spell it out properly. You're welcome. I'm sorry?  https://t.co/gfh60odIUP I don't remember asking you.  https://t.co/0HojkVxEGu To the assholes that just hacked my private IG account.... Your parents must be really proud of you. That's your contribution to the world? RT @Alyssa_Milano: 4 Pro-Gun Arguments We're Sick of Hearing  https://t.co/wo3bTcGQp7 Love letter from London https://t.co/fW2iRs0b9Q RT @shondarhimes: Meet the 45 Senators Who Blocked Background Checks https://t.co/OVvSTxz8Ur via @MotherJones RT @igorvolsky: The GOP senators who voted AGAINST blocking people on terror watchlist from buying firearms (via @TheGoddamnGypsy) https://… alancummingsnaps's photo https://t.co/8RSF0MdHQw So good!!!!!! https://t.co/effsmopUgF RT @joshgad: Regardless of where you stand politically, tonight is a very special night for women in this country. 240 years later, it's ab… I hope every one's son has to sit down and read this girls letter.  https://t.co/KOpx10bFK0 RT @HuffingtonPost: ESPN host says what you've been thinking about the Brock Turner case https://t.co/0EoZ1HqsLl https://t.co/ZCSCAylzNj Thank you so much! I'm gonna do some extra moves today with my KidPower Band! (I celebrated with cake)  https://t.co/aRKLXpm7OB Thanks much!!! ❤️ https://t.co/rz8MJBWabJ RT @Chirlane: Bravo @CNNAshleigh for reading the Stanford letter on live TV and letting the victim's powerful words shine. \n\nhttps://t.co/j… RT @people: Heartbreaking video shows SeaWorld orca beaching itself during performance https://t.co/2E5afk8TfK via @PEOPLEPets https://t.co… RT @MuhammadAli: “We become heroes when we stand up for what we believe in.” #MLKDay https://t.co/TQpYIn2Hv1 You can! Come over!  https://t.co/fCJaRMhU86 RT @TheEllenShow: The sale of ivory is now illegal in the US. Thank you, @BarackObama. Love, me and the elephants. https://t.co/zRJH7WsUPa You should try Fig Mountain Hoppy Poppy IPA. That should be on your list  https://t.co/rwEkaJotCE Not true at all. Song was written by myself and Billy Mann in NYC  https://t.co/HgqctjXPJ2 Holy bejeezus. Reviewed by my hero. 🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈🙈 https://t.co/Bh7c9cxzEK RT @HuffPostParents: Moms, put on that swimsuit: https://t.co/t8ZMXotoNz https://t.co/koR9FMJ9nm Yes mostly! It's a character flaw. But hi! Much love to you too!!! 😘 https://t.co/0lAzmeDkWb My 70yr old Veteran dad marched this morning in a parade like he does every year, to honor those who've fallen. Take your bs somewhere else I'll honor all of those who serve and HAVE SERVED. My entire family. Like I said. My pet peeve is people like you.  https://t.co/mr4ud4MT3p Thankyou to all those who serve, have served. We're the land of the free because of the brave+we're grateful to you as well as your families You all made our souls happy tonight:)  https://t.co/gNoKVHW7SA RT @joshgad: Why was a child remotely near the area where he could fall in the enclosure? This is sickening. https://t.co/rMrMohlZsT And they were soooooooo gooooooooooooood 😍😍😍 https://t.co/TtIbyIPjbe RT @BiIIMurray: Only a fool trips on what’s behind him. RT @UNICEF: We’re committed to improving the lives and well-being of women &amp; children around the world @UNICEFSL https://t.co/1oONzZrMDK Fun fun fun fun fun fun https://t.co/bamDrsr9g3 RT @GreatestQuotes: \"A \"No\" uttered from the deepest conviction is better than a \"Yes\" merely uttered to please, or worse, to avoid trouble… RT @parentsmagazine: Yay! @Target introduced #YummySpoonfuls, a baby food line collab with @iamcamilaalves‼️ https://t.co/cYglYw4njk https:… In the summer, kids who rely on school meals struggle. Help nokidhungry keep kids fed - all… https://t.co/hQzWBytcp3 Does anybody know when peaky blinders comes back on?? And the incredible cast and crew #alicethroughthelookingglass  #justlikefire I'm not even sure… https://t.co/jAO3rWcSa9 THANKYOU @disney for a wild ride! Everyone go see #alicethroughthelookingglass Willow and I… https://t.co/Py2EMnqFfJ Dream team 💞💞💞 pamwiggy @kathyjeung @michel_saunders @karla_welch https://t.co/Ydvy4W61II It's almost time.... JustLikeFire live tonight on ABC! Tune in 8e/5p #BBMAs 🔥 https://t.co/cEphDAZzeF TOMORROW! #JustLikeFire @BBMAs 💘 🔥 #BBMAs https://t.co/n3Cvt3XYrH 2 MORE DAYS! #JustLikeFire live at the @BBMAs. 🔥 Sunday @ 8e/5p on ABC ✨ #BBMAs https://t.co/NTeUz1m3Om Bringing #JustLikeFire to @JimmyKimmelLive on Monday! Watch on ABC 🎤🔥 https://t.co/ef8QJiDVU0 #JustLikeFire live on the @BBMAs &amp; I can't wait! 5 days ❤️ May 22nd @ 8e/5p on ABC. #BBMAs https://t.co/99PQbunkMd Just came across a rad cover of #justlikefire     https://t.co/GG4e5WPmmk https://t.co/NLvEot1jpf Tuning into @NBCTheVoice tonight? See ya there!!! 8/7C 🔥 #thevoice https://t.co/guwaSpR4SL 1 week til I perform #JustLikeFire @BBMAs! So excited 🔥 #BBMAs 5/22 8e/5p on ABC! https://t.co/KIPbhTQ0Td Add your name to stop the dog torture festival in #China #StopYulin2016 https://t.co/k4kGZhU02w RT @UNICEF: “If more parents supported girls' education, we could #endchildmarriage” Achai, 17, from #SouthSudan @unicefssudan https://t.co… Day two✔️magical unicorn front bun✔️playing squish your own face in the car✔️ I'm ready nbcthevoice https://t.co/wGOnEzIjLO That was fun https://t.co/deGejY3rX4 Hi y'all!!!  https://t.co/SKBrqfDS4W Hoping my magical unicorn front bun and my crazy lip will help me be a good judge.... On my way… https://t.co/lbCL3sWzNd What's up! I'm running the @iHeartRadio Twitter account... Tweet q's to #iHeartPink Hey people, I'm taking over the @iHeartRadio Twitter Account in 30 minutes and 5 seconds! Tweet any questions you having using #iHeartPink . Advising the amazing artists on @NBCTheVoice next Monday 5/16 at 8/7c! #TheVoice https://t.co/cSDfVqvZpE I will be taking over the @iHeartRadio account tomorrow at 3:30PM PT to answer your questions! Use #iHeartPink Just like magic, my #JustLikeFire music video is up on @Vevo! 🔥❤ https://t.co/Ei0159Tg34 Less than one hour VEVO 9pm PST/12am EST #JustLikeFire https://t.co/FnPYsiHnon RT @BiIIMurray: Be careful who you open up to. Only a few people actually care, the rest are just curious. That would be 12 am EST OF COURSE ⭐️🌙🌞🔥 TONIGHT: VEVO 9pm PST/12pm EST #JustLikeFire 🔥 https://t.co/ISO09AckR5 TONIGHT: VEVO 9pm PST/12am EST #justlikefire🔥 https://t.co/6iBV2e5yxM I hope so! I miss your face!!! https://t.co/t7EANIw35U Gorgeous!!!! https://t.co/57o1YmBX55 RT @UNICEF: This #MothersDay, we say a big THANK YOU to all the amazing mothers &amp; mother figures worldwide! https://t.co/dhjHZdWRGe #JustLikeFire TODAY🔥🔥🔥 https://t.co/W0Euv6Wwuz I was born the day you were born. You, my love, my child, me, your Mama. We're doing pretty… https://t.co/tbeJNrW1mU #JustLikeFire music video magic TOMORROW! 9pmPT/12amET 🔥 https://t.co/0zi2xTWg4f @DisneyStudios #ThroughTheLookingGlass #JustLikeFire https://t.co/xswSbvds0v #JustLikeFire @_DaveMeyers pamwiggy @karla_welch @michel_saunders @kathyjeung @amacfly https://t.co/Wqnh59RX2g #JustLikeFire https://t.co/fOrZNHLMPW #JustLikeFire @_DaveMeyers @amacfly @karla_welch pamwiggy @kathyjeung @michel_saunders https://t.co/4q42tvkOMY #JustLikeFire https://t.co/2wEyHeVEBI #JustLikeFire https://t.co/VzJv45aCmC #JustLikeFire https://t.co/1q0FBTyzNu Hers and Hers https://t.co/rGJUO3RXan RT @peta: Victory! The city of Asheville, NC has banned horse-drawn carriages after supporters reached out to city council. https://t.co/gA… RT @joshgad: So we're doing this Trump thing America? Okay. https://t.co/DplGZE3TLK RT @PinkFans_: ICYMI - Check out @Pink's live chat from a few mins ago with her co-star Willz https://t.co/tpB0RX7NgY https://t.co/tOzRBC4K… #JustLikeFire is this week's #Beats1 Banger! 🔥 on @AppleMusic https://t.co/cP49wKo27f https://t.co/deX0seL6Ga RT @Alyssa_Milano: #MetGala2016 Claire Danes in @Zac_Posen is what dreams are made of. I would like to correct the person who lovingly just told me 'back in the missundaztood era I was cool'. I have never ever been cool. Thanks RT @UNICEF: 10 million children in war-torn #Yemen are in need of humanitarian assistance @UNICEF_Yemen https://t.co/yKjy6rFlUP RT @christinaperri: omggggg i LOVE this video and song so much!!!! 😂✨🎉💯🚫👏🏼👏🏼👏🏼❤️ https://t.co/0slnMj99dw I thought my daughter had something important to say, but nope. She just wanted to cough INTO my mouth. Directly INTO MY THROAT. #instasick Just in case you haven't learned the words yet, checkout the #JustLifeFire lyric video on @Vevo https://t.co/BpBuO0WSi3 Ellen! @TheEllenShow see you May 4th!!!!! So excited. #JustLikeFire https://t.co/5GiSHqPNnQ RT @UNICEF: Education is what gives children and young people the necessary skills to build a better future. @UNICEFAfrica https://t.co/lJm… The world has lost a lot of sparkle this year :( I'm performing Just Like Fire from Alice #ThroughTheLookingGlass at the bbmas! See you May 22 on… https://t.co/99xeljzBgD Well that's fun! Thanks radio peeps! https://t.co/6z1ps1kfEt THANK YOU AUSTRALIA! Listen to #JustLikeFire https://t.co/nnSDbLxUiz RT @BetteMidler: Jesus, I look fabulous today. I’m a medical miracle. I know I look good cause my hair and makeup say so and I don’t pay th… RT @UNICEF: Baby Seyram from #Ghana was pre-term, but is strong now due to exclusive #breastfeeding https://t.co/KJt7Av1ZZK I couldn't physically or emotionally love Sally Fields more than I do. #doris Check out my new single #JustLikeFire #ThroughTheLookingGlass @AppleMusic’s #BestOfTheWeek https://t.co/P2966j5g7c https://t.co/SahGvdHK1q Thanks @BBCR1 for making #JustLikeFire from #ThroughTheLookingGlass your Track of The Day! &lt;3 &lt;3 https://t.co/n8ehQe2N9O When the clock strikes midnight… #JustLikeFire #ThroughTheLookingGlass https://t.co/6fSqEoKY0X Let's do this #justlikefire https://t.co/h11yHcrhA4 Just posted a photo https://t.co/b7f7bBxMjb Just posted a photo https://t.co/MYbktdpxuf Just posted a photo https://t.co/Hp3So6JR4M Just posted a photo https://t.co/tsH4ZLOkme Just Like Fire https://t.co/lFOfQoFq6l 4.15.16 #JustLikeFire @DisneySTUDIOS #ThroughTheLookingGlass https://t.co/tpSeVXZoT8 RT @hartluck: Retired life isn't so bad! It's time to learn some new tricks.\n\nMy essay for @bycycle: https://t.co/zGwA9yJPHA https://t.co/0… RT @PPact: Thanks @realDonaldTrump for outing the anti-abortion movement. He's articulating the same platform they all support. https://t.c… ❤️❤️❤️Check out my version of \"White Rabbit\" for the brand new Alice Through The Looking Glass trailer!!!! https://t.co/ERw9sJAr5y Trying to link my Twitter account with my new public instagram account is like a monkey trying… https://t.co/xb2NFth4Ms RT @CindyCrawford: My thoughts and love go out to everyone in #Brussels, and around the world today. #prayforpeace https://t.co/qRmmcgPnNE RT @billclinton: Thinking of the people of Brussels after these terrible attacks, and praying for the victims and their families. Celebrating #WorldWaterDay w/ @UNICEFUSA #TapProject! 5 min. w/o your phone can provide 1 day of safe water: https://t.co/ooV219veLV Alright alright alright. It's official. Ask and ye shall receive. Public IG. pinkofficial RT @LAGuineaPigResc: @Pink So happy to see Mama Marshmallow &amp; Sweet Marshmallow found a loving FURever home with the Hart family! 🐹🐹💖💖 #gui… Tears 🙏🏾😥 https://t.co/GBoES5voY7 RT @BiIIMurray: Whiskey is the hand sanitizer for the soul. ❤️❤️❤️ https://t.co/2dcJNCq2AL Congratulations LA. Thank you for all you've done and continue to do.  https://t.co/7CucVQV4rI Welcome Mama Marshmallow and Sweet Marshmallow to the Hart Family. We adopted them from LA Guinea Pig Rescue 💖💖💖 https://t.co/fo279P5kWD RT @UNICEF: “I don’t have to stay at home anymore!” For 1st time in 2 yrs, Iman &amp; her friend are off to school again @UNICEFmena https://t.… RT @XGames: FMX legend and #XGames silver medalist Carey Hart is featured in META Magazine » https://t.co/nhMsinJgSg https://t.co/nUl5oPdYF5 RT @UNICEF: Join us &amp; @TeamSwachh to create a clean #India where everyone uses a toilet! https://t.co/Ifoqqxndqt  @UNICEFwater https://t.co… @Renner4Real I like your new costume if I can weigh in https://t.co/jhq5uY0eeH @Renner4Real 👊🏻 I LOVE this book. I recommend it HIGHLY https://t.co/JMAGX7qKpz Today's reading. It's a good one https://t.co/bb1I2lZvC8 Happy birthday Yamna!!!!! https://t.co/SDbbtPx873 RT @UNICEF: How @GlblCtzn is campaigning to #LevelTheLaw for girls &amp; women https://t.co/LlDGbXsh33 #IWD2016 RT @MTVNews: Emma Watson Is Fine With Being Called A ‘Feminazi’ https://t.co/ep4iwh7gO0 https://t.co/8q4lAzabWK Stay off Twitter 🦄 https://t.co/uOfanWB59K https://t.co/SvKNl9jufv https://t.co/kC3iHfbjFh https://t.co/0T2yp0mp1v https://t.co/UduBtilLAm https://t.co/hXMD5zOvi6 Last one for the evening: you are all entitled to your opinions and feelings and I am open to hear all of it. But it won't change my mind https://t.co/NPRoOcF0y9 #InternationalWomensDay https://t.co/LhvA4D2Mdm #InternationalWomensDay https://t.co/xleXgbJKB0 #InternationalWomensDay https://t.co/8wVrTDbmmZ Fav hat @NickFouquet https://t.co/ZJ0wbzmcVi Thanks @WineSpectator  for the I told you so https://t.co/h9fY5LqSYI Thanks @WineSpectator  for the I told you so https://t.co/ldbljaDhIG Thanks @MammothMountain for a fun family trip!!! #hartclan #shredders https://t.co/Z6J28404Gt Amazing  https://t.co/ROI30QxVIJ Totally possible! https://t.co/Py53Pkzq9L YES :   tribedemama's photo https://t.co/q5rRwSC0uV Join me for @UNICEFUSA's #TapProject Challenge to help provide safe water to kids worldwide: https://t.co/rpbxJV6jjW Anyone that has a beating heart inside their chest needs to watch this: https://t.co/ZRvLmhrpO6 Fully aware 🙈 https://t.co/WvGLTw7c5V Yeah cause you got with that JAWN https://t.co/bLOk3HLf1Z RT @JulesAGrand: @Pink @OkAndroid @jamesapierceIII a jawn is a person, place or thing. \nExample- Pink been a jawn since that first video \"m… James darling would you like to explain? I'd hate to get it wrong.  https://t.co/6lv0ls9ych THANKYOU for the spelling. I always said it- never spelled it. Til Twitter. But thanks.  https://t.co/KqTOlwagbk A 'jaun' is a noun. It's true. #creed #imissphilly Mikuni in Sacramento just kicked my ass in a good way. Thanks for the awesome sushi y'all ❤️ LISTEN UP; LOVE premieres tomorrow on Netflix and my freaking hilarious bestie is in it @KerriKenney and it's a f*cking smash so don't miss Red, White… and P!nk! In case you missed it… check out #ThroughTheLookingGlass https://t.co/xiXg6Ybfuu RT @teganandsara: Goddamn. #AlabamaShakes RT @UNICEF: A mother carries her baby on foot as they make their journey on foot. 60% of refugees are women &amp; children @UNICEFMK https://t.… RT @PinkFans_: 📷 @Pink in studio recording the theme song, “White Rabbit” for Alice Through The Looking Glass! ... https://t.co/UgdyS2QnYu RT @NylonMag: Pretty great that 4 out of 5 of the rock noms were female-led. The 5th was Foo Fighters, and Dave Grohl is our universal Dad,… RT @Gwen_UsBeauty: Love seeing @DaniloHair in @gwenstefani's live video!!! #GRAMMYs RT @TheEllenShow: .@kendricklamar, you are brilliant. #GRAMMYs RT @OhMyDisney: Watch a new clip from #ThroughTheLookingGlass featuring the iconic song “White Rabbit” performed by @Pink:\nhttps://t.co/jZI… RT @PinkFans_: 🐇🎩🍄😽😍\n@Pink you are always throwing us wickedly awesome surprises!! You are the BEST!! - ❤, all of your fans!  https://t.co/… RT @HuffingtonPost: .@elliegoulding ily ily ily I love you @AndraDayMusic RT @JulietteLewis: Can we all just acknowlede how music makes life better! #grammys Let's go Grammys!!! Were ready! https://t.co/wm8od8hyrL Watching the #GRAMMYs tonight? Me too! Follow me #ThroughTheLookingGlass  👩🎩🐰👸 I joined the 2016 #Rise4Revolution @ThunderclapIt to end violence against women &amp; Girls. RISE with me https://t.co/yIySgCMyAG You are special. Each one of you has a gift that the world needs. You are special. Please get help. Not tomorrow. RIGHT NOW. I just lost YET another friend to addiction. If you are having trouble, please get help NOW. For you kids, your parents, your family, for me Supercross selfie game #phoenix #rchracing #letsgoroczen #myteamownerishotterthanyourteamowner https://t.co/DHwHQVG5ib I was inspired by @KevinHart4real to break down my workout. Thanks @JeanetteJenkins #whysoserious #closecalls #getit https://t.co/l1X1VT9Wou Join me in taking action to keep nature’s music alive! Please donate to @defenders at https://t.co/GwfyMqJ422 RT @joshgad: This is it https://t.co/ngNduWW260 Who's watching Groundhog Day tomorrow? #bill #murrayme The #SyriaCrisis has raged for 5+ years. Take 60 seconds to watch, share &amp; show your support to end the suffering: https://t.co/TUm8gbOlVh Goofin off with my sis @JeanetteJenkins 1 of my fav humans on the Earth. Don't be scared of strong women! #funfit https://t.co/kUdHhx4YqO \"Calling all animal lovers! Please follow @pupaid to stop cruel puppy mills &amp; help rescue pets! #wheresmum #adopt RT!\" I support bill that would get horses off #NYC streets &amp; prohibit sale of the horses to slaughter! Thanks @BilldeBlasio! #SpeakOutForHorses Hey everybody! Watch Just Jillian tonight on E! at 10pm. Cause she is the bees knees 💪🏼 @JillianMichaels Forget safety.\nLive where you fear to live.\nDestroy your reputation.\nBe notorious.\nRumi I would like to nominate Will Smith for an Oscar. And not just cause he's from Philly. #concussion Check these awesome guys out https://t.co/GFSaONQ8kU Read this: Another All-White Oscars? This Is Bullshit. https://t.co/flY0ze2F5u via thedailybeast RT @StellaMcCartney: Serenaded by @Pink and #DallasGreen of You + Me at the #Autumn16 Presentation.\n#STELLAmoeba\nPhoto by @mjkim_lalala htt… RT @SteveMaraboli: Unapologetic excellence. Rest in peace sir. #DavidBowie https://t.co/7SZPI3inrR RT @cityandcolour: who's gonna watch? Tomorrow, Monday January 11 Network TV debut on @jimmykimmellive #lovercomeback #jimmykimmel https://… And it turned into THIS https://t.co/kc3xrcnPlg DING DING DING WE HAVE A WINNER!!!!!! how the hell did y'all guess that so quick?  https://t.co/XjAwzJ7vl7 That's what i would've guessed https://t.co/E2jW9IyW9X HAHA NOPE https://t.co/vitI5S5yXz What KIND of milk  https://t.co/NiB7KmeDT0 Alright chefs- challenge:::::: WHAT DO you THINK THIS IS? https://t.co/NuCWgVCkmm Beautiful babe  https://t.co/WFjnAkHXQO Oh! I forgot to say! Happy let's take a joke 2016 new year! Good luck! Fuckos! Oh! And happy anniversary baby! Love you @hartluck muah xo To all the people who already sent out thank you cards for Christmas; you must not get very many presents. To you Charly, you will be missed by many.Your presence in this world made it a brighter place, and you will live on https://t.co/ysaCFruAxL #NewYork Join my trainer @jeanettejenkins for a Wellness Talk at the Soho Apple Store!-&gt; https://t.co/XNp1kCXkYC RT @UNICEF: Thank you #Malala for changing the world by speaking out for girls’ education everywhere. https://t.co/4e6zAGTX8s Happy Feet Two #mamathatsyou!!! https://t.co/07Geo5G4oJ Thank you @MammothMountain for an amazing week. I heart you. Thanks to the instructors that helped my baby shred!!! https://t.co/dF49qFQUcK We wish you a merry new year https://t.co/C6sxPtFYzH Happy holidays to you and yours. 'Wherever you go, go with all your heart' ❤️ -Confucius https://t.co/XZEraewVzQ Happy holidays to you and yours. 'Wherever you go, go with all your heart' ❤️ -Confucius https://t.co/YUgrT5JHfv I've been on Twitter for five minutes, and I've already had my fill of the human race. It's been real. Merry Christmas you weirdos #joy So now I've complimented a singer, which offended people, been called names, and now offended people some more. ???? https://t.co/069FXsjvPK If I was bipolar though, that would explain a lot. No, yaw... I'm not bipolar.. I'm a firm believer in positive reinforcement, second chances and giving props when they're due. That okay? Jesus, Miley. That's my new fav version of Silent Night ❤️ https://t.co/M4ZDfpvFPe RT @GreatestQuotes: \"Life is not the way it's supposed to be, it's the way it is. The way you cope with it is what makes the difference\" - … Proud 2 help @GenerationNKH announce the winners of the 2015 Photo Essay Contest - Amazing passion for #NoKidHungry! https://t.co/6wtg0F4aT3 Something cool is happening this week &amp; my friends are part of it. Check out #TheWiz Live this Thu Dec 3 8pm NBC. I have to say @jimmyfallon is one of the nicest, funniest guys in the world. Thanks for a fun moment ❤️ #UNICEFKidPower I'm on @GMA today and officially a @UNICEFUSA Ambassador! Proud to put #childrenfirst &amp; be part of the #UNICEFKidPower Team :) RT @mercola: Discover how you can avoid these 10 common sources of endocrine disrupting chemicals. https://t.co/8TedmLjmz4 https://t.co/3vL… Banana Slug String Band! https://t.co/FC9KTF2BYl Set your course by the stars, not by the lights of every passing ship.\n— Omar N. Bradley RT @AOL: Everyone from @Pharrell to @Pink has joined in the conversation about race. Watch @ShiningLightNow concert live: https://t.co/TCCg… Join us tonight at 8/7c on @AETV @ShiningLightNow https://t.co/eqBDvNgvxI RT @AETV: Join @johnlegend, @Pink, &amp; more for an honest conversation about racism tomorrow on @ShiningLightNow. #ShiningALight https://t.co… This is beautiful ❤️.   Muslim Man in Paris Asks Strangers for Hugs, Trust Amid Attacks: Watch https://t.co/IQfgkQpMPv via UsWeekly RT @katiecouric: My heart is breaking reading this. So important to know the names, the lives, not just the numbers. #Paris https://t.co/fj… RT @BadRabbits: We didn't know him but sending our condolences to Nick Alexander's friends and family. When you tour for a living your crew… My prayers are with the people in Paris tonight. I pray for your safety and for your comfort. HUGE shoutout to @IamStevenT &amp; his new charity! Great cause for abused girls https://t.co/RqZYlAEQFk #JaniesGotAFund https://t.co/qARcLIQ8re Woohooo thanks babe!!!!!! @grahamelliot I'm going for the watermelon jalapeño ice pops first!!! https://t.co/OqyBgK2Y1u RT @SteveMaraboli: Letting go isn’t about having the courage to release the past; it’s about having the wisdom to embrace the present. Thank you sooooo @MIKOHSWIMWEAR now which ones are mine and which are willows?! 😍 https://t.co/bUiwzEitpW Happy Halloween ❤️ the harts 👽 https://t.co/auFbTGRt0s Happy Halloween ❤️ the harts 👽 https://t.co/Op5q1n2Yy9 Found a good one.... That hair though.... https://t.co/3g6rLv3w87 I’m eager to perform at @ShiningLightNow to help make progress on racial equality. Join me Nov 20th at 8pm EST on @AETV! #ShiningALight RT @RexHuppke: I'm beginning to think the GOP's plan is to keep Hillary Clinton in the hearing until after the 2016 election. #BenghaziComm… RT @BrandonFureigh: I am impressed with @HillaryClinton and her ability to remain poised. Says a lot about how she would handle pressure #B… RT @VikramSeshadri: Thanks to the ridiculous grilling by GOP on #BenghaziCommittee, @HillaryClinton is looking more presidential than ever.… RT @TheWanjiru: #BenghaziCommittee How much wood could a woodchuck chuck if a woodchuck could chuck wood? If you're a teen who wants to make #NoKidHungry a reality: join the essay contest.... I'm judging! https://t.co/ECXporMEX9 I want to be a parrot head #vegas #jimmybuffett #winning http://t.co/6HibvCwVWt BIG NEWS - I’m the Nat’l Spokesperson for #UNICEFKidPower! Let’s get active &amp; save lives: http://t.co/dDjzgiIyUK @UNICEFUSA Just found out after 12 years that my rescue dog is an Australian Shepard. Makes sense 😍 #missuaussies Went to a disco dance party last night as the girl I always wanted to be. One Part Bowie one part bank robber http://t.co/LDdjIRkDZv Valentino ❤️ https://t.co/kXB3XezJvv This is our generation’s chance to truly change our world. Support #globalgoals now &amp; star in We the People http://t.co/wjsIfhzeYv Throwback 💞 http://t.co/Yris7eAdkF A master and his pupil http://t.co/VOAC1tJOut This what happens when u mix 'dirty dancing' w/ ur friends + frozen watermelon injected w/ vodka w/ salted sherbert http://t.co/F4P61bMoia Check out Episode 1 of 3 of @hartluck ride to Sturgis with all his boys ❤️ http://t.co/V205p9knHl My friend Greg is doing this for a really good cause: http://t.co/inr1ykGV5F CA: Get a pink plate. Your $ will pay for breast cancer screenings! #pinkplates #p!nkforpink https://t.co/oIitT9bJQ1 http://t.co/WLs316BBS0 Hey hey! https://t.co/GoavxrKw6J 30M children forced from their homes by circumstances beyond their control ­ what you need to know, via @UNICEFUSA: http://t.co/MleCOvXRUT They’re not just migrants, or refugees or displaced. They are #ChildrenFirst. Take action to help them: http://t.co/yNCBjqBk7c @UNICEFUSA Great read from my friend\n@catcora  ❤️Loved my advance copy of #CookingAsFastAsICan\nthank you! https://t.co/EcE3D7M6h9 That was so much fun for reals. My shows will air September 10th and 11th!!! @TheEllenShow So excited to premiere Ellen's new theme song!!!! #todaystheday #covergirl http://t.co/7GRwD2jQ0v https://t.co/qYJc2MNYG2 I got this sent to me by a friend, it's a repost, not sure who to credit. Transworld? So rad!!!! Yes!!! Thank you❤️ https://t.co/NEBbWQD4JN Thank you all for the birthday love ❤️❤️❤️❤️❤️❤️ I love you right back. Heaps and heaps Willow let me do her hair for my birthday and she only yelled at me 5 times!!! 💃💃💃 http://t.co/qWch1BbjNo ❤️💃😍 https://t.co/9dERrQDkMU ❤️❤️❤️❤️ https://t.co/V2fCd0mX6Y Thankyou so much!!! https://t.co/S4GZf0V7Yv Happy Birthday Mark Schulman!!!! We love you so much!!! ❤️❤️❤️❤️ #bestdrummer This food by Chef Robbie is amazing right now. Sorry to every other chef in the universe I'm forgetting to mention right now.. #cheffeud RT @cnnbrk: Same-sex couple gets first marriage license in Rowan County, Kentucky. http://t.co/FyK4AdzAdq RT @OxfamIreland: #RefugeeCrisis: It’s a  question of human rights  – not  charity  http://t.co/Uq4mT8mb3F #refugees http://t.co/EcAzZR9HqE RT @bonappetit: The best thing you can do with your tomatoes, period http://t.co/cVMKCJozRQ http://t.co/O1F0BmEyqe In other news, it's gonna be a beautiful day, I hope you look up from your keyboards and enjoy it ❤️ You can make this into whatever you like, cause that's who we are now, I guess. I'm out Anything about Demi Lovato or called out anyone. I was talking to a friend in response to his disappointment about the show. I agree w him. You know, this is part of why I'm sad about the VMas and the world in general. Everyone is so nasty and waiting for a fight. I never said K this was fun. You guys are a hoot. RT @maddiie_roberts: @hgunn23 @Pink she's honestly saying she forgot...that's not being disrespectful she literally forgot RT @LuisDzo: @Pink Dont feed the trolls, they never get enough 😘 RT @DavidAtkins42: @Pink I have no clue why people were angry over your comment, I think people on the Internet just love to be offended. STAY LOST. Nothing happened. ❤️ https://t.co/2oYKcVDCpj This is what I mean by LOOKING FOR A FEUD.  https://t.co/4eVu7Cwbzz RT @evrybdygegeget: @Pink Pink doesn't play the trashy tabloid game and is in a league of her own so you're bitchy tweets are meaningless. … RT @PinkHistory: @Pink I'm climbing Ben Nevis in this month for Marie Curie. Please RT to help me reach my target! https://t.co/SFpewmMFmB I stand by what I said. However, I didn't intend for the angry people of the world to latch on and make it into something it isn't. Peace ✌️ Please look for a feud elsewhere. I have no issue with Demi Lovato or anyone else. I actually forgot she performed. I have opinions. MANY RT @HuffingtonPost: Woman told to kill herself after posting photo of menstrual blood on Instagram http://t.co/fzMR5IjC7G http://t.co/c62AN… RT @christinawilkie: As secretary of state, Clinton called out the “ogrish” men on her staff http://t.co/13eMrtg6qM I'm convinced MTV just bought up all dispensaries before airing this show Ok @ToriKelly - fan for life. Great freaking performance tonight, you live singing, guitar playing accapella sanging woman. RT @peta: Bears don't dance bc they want to, they dance bc they’re afraid of what happens if they don’t. #BoycottTheCircus http://t.co/uRKF… @thedavidcrosby me too❤️ Was inspired this morning to sing some gospel aka Lauryn... I'm'a sucker for some acoustics... #shesthebestever http://t.co/STxThh72Gj I #vote for @curebatten #upgradeyourworld Been getting a whole lotta love from y'all about the new Ellen Theme song and the upcoming performance. Perfect birthday present! ❤️u back! Thanks y'all we all love @TheEllenShow ❤️❤️❤️ https://t.co/IpVwDIQ3MW Are you for real? Did you hear that on Fox News? https://t.co/aT4xzLoKet Radical! https://t.co/M2OdfWotrG Do these Rep. hopefuls plan on visiting every town in America handing out pamphlets,hugs, life saving info +  screening?!whats their plan? Planned Parenthood was the only organization in my town growing up available to teach young girls @ sexual responsibility. I stand with PP Duck! https://t.co/ezJhxED0Xd Thankyou!  https://t.co/jzLanbtmE0 RT @TheEllenShow: What better way to launch Season 13 than with a new song that @Pink wrote just for me? Today’s the day! http://t.co/7qRrr… This summer, text FOOD to 877-877 to find free #SummerMeals for kids and teens in your neighborhood #NoKidHungry Please read this  https://t.co/7TUlLcu7jE Anyone lookin for a bday idea for their partner- throw an archery party. Super fun. Mine liked it ❤️ #thatwasjustthebeginning Any parents looking for summer camp in La? Don't go to 'camp Summertime' at Calamigos ranch. They treated my friends kid AWFULLY. Feeling festive for Independence + Bastille Day.French Mani on an American Flag. Thanks Michelle Saunders! Ur da best http://t.co/yjUgMHe1Yj Also super excited for @TheEllenShow for her new launch.... http://t.co/TKnwHICAqB. 👏👏👏 Anyone that has a mom, a vagina, or a penis: stop what you're doing and watch 'Miss Representation'  now. It's so right on. RT @BiIIMurray: It’s not really drinking alone if the dog’s home. This new app is rad @KerriKenney @butchwalker #marshmallowroastingapp http://t.co/biSd3bgE99 Love WINS!!!!!!!! Hate speech &amp; horse abuse don't belong in #NYC: https://t.co/jZD04PEMS0 Stand with the Mayor &amp; #BanHorseCarriages NOW! CC: @MMViverito STOPYULIN2015 http://t.co/K9OuuwceHl STOPYULIN2015 http://t.co/IFGjCJx4jy RT @Cosmopolitan: Charleston Shooting: Speaking the Unspeakable, Thinking the Unthinkable http://t.co/Q7cD4Isqt6 http://t.co/RqSnpBOBCU Why am I always on time? #nooneelseeveris RT @HuffingtonPost: \"Lose Yourself\" in sign language will get you super pumped! http://t.co/dv2sEBXEkX http://t.co/RHATmxt9qP Friday night, kid in bed, pouring Pinot, crying to masterchef. ✔️ I donated to this- anyone else want to? http://t.co/fPYlMY3p11 That's just shitty @TheEllenShow  https://t.co/p3XuzQB7t9 RT @nokidhungry: We were thrilled to have @TheJeffBridges and @Pink kick off the #SummerMeals program in #SantaBarbara! http://t.co/y81qrjq… ❤️❤️❤️💋 thank god for you @karla_welch  https://t.co/JGxzM0kBAt That's amazing!!!! Thank goodness for TOMS!!! https://t.co/LqhyPizliD Reading my love letters first thing this morning from all of you beauties at Boys and Girls Club SB. Thank you ❤️❤️ http://t.co/vDKmU31Qdn Struggle leads to greatness babe!!! 😍keep going❤️❤️❤️ https://t.co/itgfOhI97p Getting ready for a day #withoutshoes #TOMS http://t.co/spYxucqLdY Love Story http://t.co/Zec7u4q6sT Valentino 💋 http://t.co/4oLpLuUwpu RT @REINAHIDALGO521: #WCW ...( love you Bill 😉). \nGot to spend my evening last night with -MY FAMILY,MY JOY,MY LIGHT… https://t.co/6M1kkxjn… A 2nd major #NepalEarthquake has struck. UNICEF is on the ground supporting children &amp; families - help now http://t.co/tidENYg4yE @UNICEFUSA You + Me just won the Sirius XM Indie Award for Songwriter of the Year! Wooo hoooooo!!!!!! Thanks guys:) congrats @cityandcolour RT @GreatestQuotes: \"When you do things from your soul, you feel a river move through you, a joy\" - Rumi Thanks @Nike for the hookup on my hiking program today. See @JeanetteJenkins I wear color!!!!!! http://t.co/fcjjiGnHVB RT @BiIIMurray: The human body has 7 trillion nerves and some people manage to get on every single damn one of them. Thanks @StellaMcCartney for making the best clothes in the world. And thanks Pamela Neal for the bowl cut. http://t.co/4ZTjiCTyyh Currently listening to.... 😍 @butchwalker http://t.co/X0gQ9fclZ8 RT @EW: Jon Stewart mocks CNN's coverage of the #BaltimoreRiots: http://t.co/m8cUd3OFgh http://t.co/zsq70nQ6mL RT @PinkFans_: Here is the account that some fans may think is an official Instagram acct, but it is really not &amp; should be locked. http://… Beautiful!  https://t.co/1ZcBmoSGXC RT @SELFmagazine: Did you ever think a skateboard could lead to a better education? http://t.co/mz5vnFqhOr http://t.co/ivMuWFJSTv Children &amp; families affected by the #NepalEarthquake need your help. Text 864233 to donate $10 to UNICEF’s relief efforts; via @UNICEFUSA Please take 2 mins to watch this, + possibly help. If you're 18! or older please register at http://t.co/VbCvH89Q9U\nhttps://t.co/ADyfnNX91C RT @GreatestQuotes: \"When you are grateful, fear disappears and abundance appears.\" - Anthony Robbins Ugh I love you and I love this picture xo  https://t.co/vvUhNL99ZA You two are gorgeous. This pic makes me so happy  https://t.co/qhXjtdzKCr That's called balance! Happy birthday!  https://t.co/PQp7ClklMk RT @cameron_adams: Twitter is better when @Pink is shutting down the haters #trollingthewrongperson Hahahahaha sorry... What?!?! https://t.co/iKgvSBo21r A chipmunk though? These people are amazing. I love chipmunks. And I love you darlin'. Keep ya head up mama  https://t.co/XB3m9GO2V2 Willow said to me the other day whilst grabbing my belly-\"mama-why r u so squishy?\"And I said..\"b/cuz I'm happy baby\" http://t.co/69wuVHg6QM Hahaha I need a charger  https://t.co/zbNocoPbGh http://t.co/kpbKrqbNws and my hubby says \"it's just more to love baby\" (and then I smack his hand off my booty cause we're in a supermarket) http://t.co/Mnd6PIoKhK http://t.co/fHdHg6II9g Wow https://t.co/vFGiLbqUJb RT @TheGRAMMYs: Pre-order 'A @MusiCares Tribute To @Carole_King' ft. @ladygaga, @aliciakeys, @pink &amp; more: http://t.co/qUU6ZFygTH http://t.… Thanks so much! 🙈👍🙏 https://t.co/8iTjVdKY7P Holy Yum. If you're downtown LA check out my friend Salman's joint. Best pizza on the west coast http://t.co/gYh0ZjuKrU WORLD AUTISM AWARENESS DAY!  Sending love to the millions impacted around the world. @autismspeaks #LIUB http://t.co/LYR8658bp7 Aaaah look at my girl @JeanetteJenkins in Being Mary Jane! Woo hoo hardest bestest workout in the world! http://t.co/8QJ8BRwCqE http://t.co/qYpEEeMJPs. Vote for Strider Wasilewski for GoPro of the World for February. Do it on your home computer by 5pm PST today!!! @Ybnormal2212 @hartluck @RCHracing @jimmyjohns give her a hug from me!!!! A good friend just turned me on to this weird amazing thing called PODCASTS. Anybody heard of this? The TED radio hour- blowing my mind 😳👍 Check out this race for a great cause all you bad asses. I did it last year and it's gorgeous up there! http://t.co/dRiZeLdekR “The question isn’t who’s going to let me; it’s who is going to stop me.”\n- Ayn Rand. Happy International Women's Day http://t.co/DWQ3wlGoVY RT @RCHracing: Back on the podium in the semi! Go @Broctickle #SXonFOX #supercross #motocross http://t.co/hneoNIiQlt RT @BiIIMurray: Some people need to open their small minds instead of their big mouths. “@JeanetteJenkins: Life is too short to spend time with people who suck the happiness out of you.” Here here! “@ladybusiness: I just cannot deal with how beautiful Scarlett Johansson is.” Me neither. @JeanetteJenkins I ❤️u more!!!! “@JeanetteJenkins: #fbf This woman @pink makes me smile. You know those kind of people that sprinkle good energy. http://t.co/bRoxWEMv7I” ❤️ Reflecting http://t.co/MU87M1ZByJ Turns out I wouldn't take ANY music or ANY one to my deserted island. #bliss http://t.co/enY2Nraovw RT @PerezHilton: Shit, I'm crying too! #Oscars RT @LA_Reid: YES! @common @johnlegend \n#Glory #Oscars2015 RT @HuffingtonPost: http://t.co/CUcGSADPZC RT @byCindyClark: Finally got a look at Meryl Streep in @LANVINofficial -- adding her to my best dressed list. #OscarsRedCarpet http://t.co… RT @katiecouric: Why do I love when winners ignore the music? #subversive RT @VH1: Let's hope the fashion gods give us some looks like this TONIGHT! 🙌 🙏 🙌 🙏🙌 🙏 🙌 🙏  #Oscars2015 #Oscars http://t.co/rhKuEnBmFE RT @RCHracing: Broc crushes the semi and lands on the podium in 1st. Ready for the main #AtlantaSX #SXonFOX #rchracing @SoaringEagle777 @ji… RT @BiIIMurray: If you aren’t enjoying the path to your destination, reroute. Life is hard enough. Enjoy the ride. “@BillyMann: If you --today --could give advice to yourself 3 years ago, what would it be?” Calm down- she's gonna be fine RT @jimmyslo: @Pink Shirley Temple w whiskey cherries = Stone Temple Pilot. Pretty good, gives you a headache. RT @RSJmom: @Pink what's wrong with some Sprite, my triplets are almost 13yrs old and they are still doing great.  Lighten up or mind your … RT @jimmyslo: @Pink Shirley Temple wo Sprite = Shirley Jones. Not as sweet, just as bubbly. @joshgad you're amazing as always in \"wish I was here\". And yes.I get my daughter Shirley temples w/o the sprite before all you assholes start in w your bullshit. So parents- check your cherries 😳 Went to a restaurant 2night +asked for cherries for my daughters soda water. They served her whiskey soaked maraschinos. Thank god I asked?!"}