{"tweets": "@Jumpman23 Be careful we are here ⛹🏻‍♂️ 💪🏻🤣 https://t.co/PzcLQdCKrU Confident for tomorrow ⚽💪🏼 #ucl #liveahead #finoallafine #forzajuve https://t.co/oYYM7nHqKq Cold days ask for good quality footwear! Check our CR7 Fall/Winter collection. #PLAYFECTIONISM #CR7fw19 #CR7 https://t.co/2EZcHVyrxI Back on track!👍🏽💪🏽 https://t.co/3V5dH6py2U Ready for today 🇵🇹 💪🏻 #todosportugal https://t.co/uSSL0cE6eT Madeira Island is nominated for the 5th time the best island in the world! Let’s vote? Siiiiiiiii\nPlace your vote at https://t.co/cVaH8ERh6q #VisitMadeira #MadeiraNoWordsNeeded #TheBestIslandInTheWorld\n@visitmadeira https://t.co/mfMBC3Let7 Feliz por ter marcado num estádio especial para mim e ter contribuído para uma vitória que nos coloca mais perto do nosso objetivo! 💪 🇵🇹 https://t.co/7bRmgPiUSX Focado no jogo de amanhã. 💪🏽 🇵🇹 https://t.co/BTH4k4Sgm7 É sempre uma grande felicidade estar de volta ao meu país, representar a seleção nacional e rever amigos de tantas batalhas. Todos juntos, lutaremos uma vez mais para erguer bem alto o nome de Portugal! Vamos equipa! 💪🏼 🇵🇹 https://t.co/wDiDbtkeiO Very strong performance by the team! 💪\nGreat feeling to be on the top of the table again!👌\n#finoallafine #forzajuve #liveahead https://t.co/bSi0g4f4zM Best way to start my weekend ❤️🙏 https://t.co/ouZXjr3aMZ 3 important points!\nWell done team! 💪\n#finoallafine #forzajuve #liveahead https://t.co/nJEJS0flrm Champions League is back! See you tomorrow... 😀 💪🏼 https://t.co/JvFhQpSx1e I’ve achieved so much wearing Mercurial boots. Now, I am excited to see you all follow your dreams in my new #Mercurial Dream Speed. ⚡💭\nAvailable today at https://t.co/RoCK5Jkj7J https://t.co/DT1yvPJ3Z5 Felice per il gol e la solida prestazione della squadra! 💪\n#finoallafine #forzajuve #liveAhead https://t.co/QgfwZI3DhT Work done 🤜🏻🤛🏻💪🏻 https://t.co/4oNc0Dk4pB Paciência e persistência são duas características que diferenciam o profissional do amador. Tudo o que hoje é grande um dia começou pequeno. Você não pode fazer tudo, mas faça tudo o que puder para transformar seus sonhos em realidade. LR https://t.co/OuHe4CbvFw We will keep working hard to achieve our goals #finoallafine https://t.co/C1cx5skgwv Probably one of the most revealing interviews I ever did...! Thanks @piersmorgan for the interview.👍🏽 https://t.co/4fWfU3ifxj We're ready for UCL ⚽️ 💪🏻🙏 #finoallafineforzajuventus #liveahead https://t.co/xfMBOCY1J4 Combining gym with SIXPAD helps me a lot. EMS technology will surprise you.\nhttps://t.co/a1KWPXzoxe @SIXPADEurope #SIXPAD #traininggear https://t.co/ZF0Tq3zyVa Domingo em família ❤️ https://t.co/JRBzrLMna8 Smeling good with my new fragrance and looking great with you on my side georgina ❤️ https://t.co/O3yhHE1s7R I’m ready to Play It Cool! Are you?😉 #CR7PlayItCool https://t.co/Gb5hyqr1MM I love this feeling ⚽️🙏 #93... https://t.co/8OwF4QKIH7 Feliz por marcar o segundo poker ao serviço da Seleção e ter contribuído para mais uma vitória rumo ao nosso objetivo!💪🇵🇹 https://t.co/NYuFqVHunL Ready for tomorrow 🇵🇹💪🏻 https://t.co/GR5ws0g4VZ É sempre um prazer voltar à seleção e representar Portugal!👍🏽🇵🇹 https://t.co/3mGT1Af095 Happy Sunday 😀✌️ https://t.co/Cjkouy8CLV Going back home! https://t.co/yookCaXRyt @Neymarjr olha aí os Reis do espadachim 🤴🏻⚔️😅 https://t.co/3TXEbxbv2e No doubts in your mind, no dandruff on your head. #keepaCLEARhead #ClearMen #NoDoubts #NoDandruff #MenShampoo https://t.co/3bGuYjnCei El otro día estuve en @insparya_es y fue un placer hablar con todo el equipo, en el cual confío. Si sufres de alopecia, comprueba el gran trabajo que podemos hacer por ti. Entra en https://t.co/Dn2NRxmskZ y pide tu consulta gratuita. Yo confío en Insparya,¡confía tu también! https://t.co/LGn2P13FSz Great to start the season with three points! #forzajuve #liveahead #finoallafine https://t.co/BUd5PmN7LQ The Amazon Rainforest produces more than 20% of the world’s oxygen and its been burning for the past 3 weeks. It’s our responsibility to help to save our planet. #prayforamazonia https://t.co/83bNL5a37Q Back on track and focused on the first game of the season ⚽️👌🏻💪🏻 https://t.co/2ugBRV1ccL Feeling good and keep working👍🏻👍🏻 https://t.co/b8zh8sqHiN We’re already in Sweden for tomorrow's game ⚽️👌🏻💪🏻 https://t.co/3VwfFR0xNO #NovaFotoDoPerfil https://t.co/2w0kLs9lUT Speed you can barely see 🚀⚡\nCheck out my latest @Nikefootball Mercurial – available today at https://t.co/RoCK5JBTZh\n#Mercurial https://t.co/I9JcHyAAH9 Eyes on the ball 👀 ⚽️👍🏻 https://t.co/MDFL6Rc0Dm There is only one shampoo for me.\n #ClearMen #KeepAClearHead\n#NoDandruff #ClearHairCare #Menshampoo https://t.co/trsKdkiDez Happiness ⚽️🏃🏻‍♂️😀 #Back #To #Training https://t.co/k3BfvWzzHo Abt last night 💞 https://t.co/7t6JPbjHJC Muy contento y honrado por ganar este premio @marca Leyenda. Gracias a todos los que me han ayudado y a los que me siguen ayudando en mi carrera. https://t.co/MT6Fk9yZ5q 🥅 ⚽️⚽️ 🏃🏻‍♂️ 😀💪🏻 https://t.co/wMB4vjCrCx Always a pleasure to see you China 🇨🇳 🙋🏻‍♂️😀👌🏻 https://t.co/hP9KlTS4L7 Happy to be back #finoallafine https://t.co/tMFVxmqANv Recovery session ❄️💪🏻 https://t.co/b8nv8jy5BR Let's go🛫 https://t.co/Xlsyga5XJH Chá das cinco ☕️ 😜 https://t.co/H5OiBsSu4C Inspired by my friends in China. This one is for the commanders of the pitch. #Shuai\nAvailable today on https://t.co/RoCK5Jkj7J https://t.co/kyBC13xdn4 Light up your body this summer with the brand new High Summer CR7Underwear collection.\nhttps://t.co/eS6wZHe6jw https://t.co/XwsHD1pOp1 How great it is to arrive at home after a day of hard work and be with my lovely family 🙏❤️😘 https://t.co/Vv4K6IXRPy Work done 😀👌🏻 https://t.co/RDe41WkI2Y ⚽️ 🏃🏻‍♂️ 😀 https://t.co/6WqI51a9IV Felice di tornare al lavoro e vedere i miei compagni di squadra ⚽️😀🤜🏻🤛🏻🙌🏻 #finoallafine #forzajuve https://t.co/gPj49rDafC @neymarjr , a sua \"poker face\" vale tudo… https://t.co/bN7snIUwhO Sempre bom passar uns dias na minha linda ilha! Ate breve Madeira!👍🏽👋🏽 https://t.co/Y8Hq35Ev4g New Mercs 🔵🔥\nExcited for the season ahead in my new @nikefootball Mercurial. Available tomorrow at https://t.co/RoCK5Jkj7J. #CR7 #NikeFootball #Nike #Mercurial https://t.co/DvAvJA9hql It was a fun time meeting these kids at the Singapore Olympic Foundation - Peter Lim Scholarship event! Follow your dreams and never give up!👍🏽🙌🏽 https://t.co/qb164DPS76 Let’s go guys!✈️ https://t.co/VnX5jVU4un 👆👆 https://t.co/68Pa1u7rah Enjoying the vacation ☀️⛴🤙🏻 https://t.co/VwJ1cyTo5h Holidays with my family in France Riviera\nEnjoy the views 😀❤️👌🏻☀️⛴ https://t.co/FyAuxWAe1y let's go 🚁 👪❤️ https://t.co/Zfe9WM9jHl Muitos parabéns, filho! 🎂🎉🎊\nQue continues a ser o lindo menino que tens sido até hoje, o papá tem muito orgulho em ti! 🙏\nQue tenhas um dia muito feliz 🥳\nO papá ama-te muito ❤️😘 https://t.co/lB6d6zoE0I Em breve estará no meu Museu.  And still🇵🇹🇵🇹🇵🇹🇵🇹 https://t.co/aw0RR6EW9u Champ Champ 🏆🏆😀💪🏻❤️ https://t.co/BuhTEa1s8V Bom dia 🌍, depois de conquistar a super copa de Itália, campeonato italiano, não poderia haver melhor maneira de terminar a época, com a conquista da #UefaNationsLeague 🏆🇵🇹 2+1= triplete 🤷🏻‍♂😀 https://t.co/7Km1L80CnO 3 times in a row🇵🇹🇵🇹🇵🇹🇵🇹🇵🇹🇵🇹🇵🇹🇵🇹🇵🇹🇵🇹 https://t.co/y5AcGHNkGu After 90 minutes of intense exercise, there’s allways a chance for a final punchline! Ending big is allways the best way to close the show! ⚽️⚽️⚽️😀👌🏻💪🏻 https://t.co/ZIP8H131Qg Muito feliz por ajudar Portugal a chegar à final da Liga das Nações! Parabéns malta! Obrigado ao público português pelo apoio fantástico. Força @portugal 🇵🇹💪🏽 https://t.co/xz5g6Ymudn Parabéns amores do papa! Pena não poder estar aí com vocês neste dia tão especial. Mas a mamã está convosco. Sejam sempre muito felizes. Amo-vos muito!!❤️💞💕 https://t.co/LVHJBG2rXH Espírito de equipa!💪🏽🇵🇹 #tudoporportugal https://t.co/aiXKazbjHj Aiming for success. #traditionalaccessories #belt #cr7footwear https://t.co/lCIwd7kRUu A great adventure with a lot of friends \n👉 @neymarjr you dance, amigo! \n👉 @SebastienLoeb the rally maestro!\n👉 And...a panda! 😂\nEnjoy @SFR fiber! https://t.co/sOxC6t4cdn I made a new friend while shooting the new @SFR TV commercial 😉 https://t.co/ULsrOom4gH É sempre um prazer estar de volta ao meu país. Força Portugal🇵🇹🇵🇹🇵🇹 https://t.co/fAlml2cAkk Amazing residential destination in Dubai, bringing together traditional design with a modern twist @DubaiHolding #MJLiving https://t.co/7vmgk58SoH Partita del cuore 2019 ⚽️🌎🙌🏻 #orgoglio https://t.co/iTTccXrhz1 💎 https://t.co/Nw1fAUUovl Always nice to see you Bro 🏆🏆👌🏻💪🏻 https://t.co/Ww3TeKzL9i Campeão em Inglaterra, Espanha e Itália... Melhor Jogador em Inglaterra, Espanha e Itália... Não há limites para as conquistas quando o sonho se mantém vivo a cada dia que passa!\n\nFino Alla Fine!!! 🏆😀👌🏻 https://t.co/uIjgIdB4XA It's always good to share these beautiful moments with my loves ❤️😀👌🏻 https://t.co/YDWvIxtOvS Very happy to win the second trophie for @juventusfc and my first Serie A championship!🏆 #finoallafine https://t.co/CPWToe8JiJ Grazie mister! Abbiamo vissuto un solo anno insieme ma è stato eccezionale perché oltre a essere un grande allenatore sei un grande uomo. È stato un piacere lavorare con te! https://t.co/n2ojUGI84M Winning team!💪🏽😅 https://t.co/xNHZTidZRR I never hit the gym or the field without my essentials 💪🏼 https://t.co/oBIP01Dov0 Hi guys! Check out my animated show trailer and the comic book now! 👉 https://t.co/pq8lesrqYI 🔥 #FCBD #FreeComicBookDay #SF7 #CR7 https://t.co/bTe7DzXQRw Filho de peixe sabe nadar ⚽️🏃🏻‍♂️ 👍🏻❤️ https://t.co/75YbWmUK03 Getting ready to go dinner out with my new @Cr7Footwear Chicago green shoes!👌🏽 https://t.co/vZPLrgG0VL Equipa vencedora ⚽️✌️👌🏻 #TopTraining https://t.co/ogduJ1FtBm It’s time to elect Madeira as Best European Island Destination again! Vote here: https://t.co/gJEZT7Tddv https://t.co/chezu4T0fX As minhas princesas💕💕 https://t.co/me1xovWXhm Excelente trabalho EQUIPA 🏆 💪 #finoallafineforzajuventus https://t.co/sfAlrpAZJD Campioni d’Italia! Orgoglioso di contribuire a scrivere la storia di un club eccezionale, che mi ha fortemente voluto e per il quale sono onorato di giocare. Sono felice. Siamo un gruppo forte e straordinario! Grande Juve https://t.co/0I7obeypz0 Ready 👍👍👍 let's go https://t.co/Lj4LunD2zC Hi guys! CR7 Footwear has a new website! Feel legendary with our spring/summer collection!\nhttps://t.co/Goznggp3NW https://t.co/nkI3KvD177 👌👍 https://t.co/3JX9m5KPqW Happy to come back and score another goal in this amazing competition. Well done team! #finoallafine https://t.co/p5tZZF35Wo Let's go🛫UCL https://t.co/8AQeiHcvhu Cantores 🎼🎤😜😜🤣 https://t.co/MuQHO71Rvz Lunch ❤️❤️ https://t.co/zIYpDno3Jc Blessed house ❤️❤️❤️❤️❤️ https://t.co/7rStFA7DLt No words needed....... https://t.co/49EdWWGzsZ Last session🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️ https://t.co/2to1cuyJ3f Excited to show you my new Nike Mercurial Superfly 360 LVL UP ⚡\nThis design combines some of the best Mercurial’s I’ve had. I can’t wait to wear it once I’ve recovered from my injury. Until then, you’ll see it on pitch with the newest icons of speed @samkerr1 and @KMbappe https://t.co/IgZOcwdgAL Recordando el gran día que vivimos en @insparya_es . Con la mejor compañía ❤❤ https://t.co/KllWb8g2Y9 😁 https://t.co/G1BJq5vLel Pensar em grande 🇵🇹👍 https://t.co/08MMNZx3w7 Preparados para amanhã 👌 https://t.co/rhH7XLP9zJ Good morning 👌 https://t.co/19GI0ir13n Não podia estar mais feliz pela inauguração da minha clínica @insparya_es 😀👌👏 https://t.co/vM2l5eCgIO ¡Es oficialmente el inicio de un nuevo proyecto, @insparya_es un proyecto único y que confiamos que va a tener mucho éxito! https://t.co/FqYSFe0r65 I always have so much fun developing and selecting the best styles for @CR7underwear !!\nSS19 collection coming soon! https://t.co/JPj0IcZsci 👍 https://t.co/aperghzXlc El próximo lunes 18 inauguro @insparya_es en Madrid, mi nuevo proyecto sobre salud capilar. Y, si quieres conocerme, solo tienes que entrar en https://t.co/H30zuYtKXj y apuntarte. Puedes ser uno de los 5 ganadores. ¡Suerte! https://t.co/k2w8qls1CT Feliz dia internacional da mulher a todas as mulheres e um beijinho especial às mulheres da minha vida!❤ https://t.co/HqAikEhj27 Hoy quiero presentaros @insparya_es , un nuevo proyecto en el área de la salud capilar, del que tengo el placer de formar parte.\nVenimos para revolucionar el sector del Transplante Capilar.\nSe quieres conocer más de nosotros visítanos en https://t.co/EtN7y1nHI4 https://t.co/Ik3ZjouZTM 👌👍 https://t.co/QM0EQ3Y3QW Partita dura. Vittoria di squadra.  #finoallafine https://t.co/VqcA8FA8lz Trabalho feito 👌👍 https://t.co/C5i336jdQ4 Portugal. É de fibra que somos feitos!!!\n💪🇵🇹⚽🏍 🧢 https://t.co/mvu2v39MmE Business day 😉❤️ https://t.co/0brkFFN6TT È stata una serata difficile. Ora crediamoci #finoallafine https://t.co/RakJhVOxMg Focused 👌 https://t.co/jVYS6moHsB Avanti cosi ragazzi!! #finoallafine https://t.co/gCUlsFWohi I'll be wearing my CR7 Fragrance this Valentine's Day...will you? https://t.co/ZUjsUbLVSB I am using advanced EMS technology as the supplement to my daily workout. SIXPAD is developed on my training theory and great tool to train target muscle. Try my training! https://t.co/Q3oTWnR9u7 #SIXPAD #traininggear https://t.co/Q8mBwRqSLQ Winning team🥇simmmmmmm⚽🏆 https://t.co/h7S4no6IxT Another great moment on my trip to Dubai. I have something really exciting to share with you soon… stay tuned! #MJLiving @dubaiholding https://t.co/Slt2uAEtay Questo è il calcio...\nguardiamo avanti e torniamo subito a vincere! Forza Juve! #finoallafine https://t.co/NRN33VupPh Felicidades a la mujer más maravillosa que Dios pudo poner en mi camino ❤ https://t.co/suqPCu6sgi 👍👌😜 https://t.co/LZtLrflQRx 😀🛫👍 https://t.co/zC80kfMES8 Grandi ragazzi! Forza Juve #finoallafine https://t.co/KkdWoN06UC Champs👌 https://t.co/awZd9X1TMn 🤔 https://t.co/6dihmJgakx 🇵🇹 https://t.co/V5i8aYKnsK ☝🏽🏆👍🏽\n#finoallafine https://t.co/657o4r6liP Contente pelo meu 1 troféu pela  Juventus!! Trabalho feito!!! 🎉🔝🏆 https://t.co/9OiqlmiKdD Festeggiamo insieme il primo trofeo della stagione! Forza ragazzi, avanti cosi #finoallafine https://t.co/5UbknCGLur 👍 https://t.co/t03EmvZhVk Abbiamo iniziato il 2019 con il piede giusto! Avanti cosi verso il prossimo obiettivo! #finoallafine https://t.co/JOnTZ7gFwJ My brand new CR7 Body Spray is perfect for when you are on the go! 💪\n\nAvailable in store now!\n\nTo see the rest of the range visit: https://t.co/jRlzOyv70X  \n#CRFragrances #Grooming #BodySpray https://t.co/nU1aeUMKua 👌😜 https://t.co/c7L6emKAyU Estilo 👌 https://t.co/Ag11kpb0kY Team👌👌👌😀 https://t.co/xAsFVOt5un Good morning 👌 https://t.co/fAdQPmkO79 ❤️❤️❤️❤️❤️ https://t.co/CmnQeswHlh Turim 💪👌 https://t.co/f795w8K6yw Spending a great time at this amazing place 👌🏻 @dubaiholding #MJLiving https://t.co/FUsBXkbawI 2 animals 👏👌 https://t.co/ugwOHpUuom What better way to start the new year. Thanks for the appreciation and the care that I have received today.👌🏽👌🏽👌🏽 https://t.co/PJg9XIJlQ1 About last night!🎆🎉 https://t.co/80SsqTvHsI Happy New Year!🎆❤️ https://t.co/3aEF5FM5cD Amore mio!❤️ https://t.co/1XwYd5gcyW New Year’s Eve at @PestanaCR7 Funchal! https://t.co/EuCjb0dldW https://t.co/srFhUzkb12 Partita dura. Bravi a crederci #finoallafine https://t.co/ei5LwK5xBW Feliz Natal! Merry Christmas!🎅🎄❤️ https://t.co/ebr7gFyr1S 👌🏽 https://t.co/5VSJSaB6qY No hay obstáculo que con esfuerzo y dedicación no puedas superar. Vente a entrenar con nosotros! #CR7CrunchFitness #cr7 #gym https://t.co/HRNZsK7KHf My new game is here! Now you can score goals against your friends! Challenge them in game and let me know who wins! Download for free now (https://t.co/uEvkwvnqme) #PlayLikeCristiano https://t.co/E2xiiMkUfu Had so much fun on set yesterday!!👌🏽 https://t.co/XC6oLYp6ch Ballin!🤣 https://t.co/0NTUFzYzMb Vittoria importante, traguardo storico...5000 volte Juve! #finoallafine https://t.co/FjuxML6K2Y About last night❤️❤️ https://t.co/bj0P1sOfyk Parabéns 👌 https://t.co/zKJYVJz43m Grande vittoria!💪🏽 https://t.co/Q6uNmN5j0h Rain in Moscow tells the inside story of @ManUtd’s epic 2008 Champions League win. By watching #RainInMoscow you are supporting the Edwin van der Sar Foundation, which helps those affected by brain hemorrhages and other brain damage. Watch now: https://t.co/c5FSx7hdNx https://t.co/mk0IjqlD0F 👊🏽✌🏽 https://t.co/1wM2NS3PZd Great team effort. Important win.#finoallafine https://t.co/yf5mhVYSYb Let's go 👍🔝 https://t.co/Q4gbFJmsAL Ready for tomorrow👌 https://t.co/Bv13P1dZ8Z ⚽ https://t.co/2Bddgejwt6 Happy to have helped the team on another important win!👍🏽⚽️ https://t.co/kH60tafhxi 👌👌👌👌👌 https://t.co/pHqwCuZMm4 ❗️ Hey! ❗️ Head over to my see my CR fragrances range this Black Friday, there will be a surprise waiting!\nhttps://t.co/ntmqRKqrHe\n#CRFragrances #Fragrance #CR7 #BlackFriday https://t.co/6sxZltlYyQ 🤔 https://t.co/c9jmv8hueQ Mais um jogo rumo ao objectivo. Boa sorte, malta!👍🏽⚽️ https://t.co/PWNJZzDdaN Focado👍👍👌 https://t.co/phsHFFj9ca Getting my head into the game 😜 ⚽  #CLEARMen #BeYourOwnChampion https://t.co/eqgw2gVi5T Back on track⚽ https://t.co/1CNe0jvibh About last night! Amazing dinner at @ZelaRestaurants 👌🏽🔝 https://t.co/nqGRF7f5h4 ⚽ https://t.co/KbGlg46EWJ Happy birthday, dear princess! One year of bliss! Love you!👏🏽🎂❤ https://t.co/gx7l6pnPqy 👍🏽💪🏽\n#finoallafine https://t.co/sZfHa4QZvP 👍 https://t.co/1uz8BtvUfn 👍🏼 https://t.co/aBZSSclIIn Stima, affetto, vittoria! Grande Juve! #finoallafine https://t.co/jJx4lB6IcJ Participe com um donativo no Peditório a favor da Liga Portuguesa Contra o Cancro. O Peditório Nacional decorre até 4 de novembro através da colaboração de milhares de voluntários que sairão à rua em todas as regiões de Portugal. https://t.co/AGDgMxpLSs 👍👍👍🔝 https://t.co/jlfcHtarF5 Having fun on set! Check out the classic styles\non https://t.co/6wNnolthcq https://t.co/4KPHt1mwk6 Happy Halloween to everyone!!🎃👻 https://t.co/0x8sPgSHht Can you guess where am I?#pestanacr7 #cr7 @PestanaCR7 https://t.co/ilWCjCZ6Qi 👌👍 https://t.co/xul4qdmS55 Uno per tutti, tutti per uno! #finoallafine https://t.co/LY0YHlM96o A great coach and above all a wonderful man. Taught me so many things inside and outside the pitch. Great to see you in good shape, Boss! https://t.co/Ql4dcuJvCW Thanks for the warm welcome. Always feel at home here. https://t.co/Tr5gny5Z5A Ogni partita insegna qualcosa...ora concentrati sulla prossima.💪🏽#finoallafine https://t.co/HkBb9tWnMv 👍 https://t.co/MRulQXg9va So happy for my island! Vote for Madeira, for sure the best island in the world!!\n\nVote here: https://t.co/CLqiBfyb2d https://t.co/dQT5WQkTgt 😎 https://t.co/aoXfSdEkyT 😍 https://t.co/gnNmGpGVxq Mis amores ❤️❤️❤️❤️ https://t.co/1GBDrCWG6b 👌👍 https://t.co/GpY3fWrPc3 Boa sorte família!👍🏽🇵🇹 https://t.co/3bZfdhXM4j Avanti così, tutti insieme #finoallafine https://t.co/EJdydnSDKj My clear conscious will thereby allow me to await with tranquillity the results of any and all investigations. I firmly deny the accusations being issued against me. Rape is an abominable crime that goes against everything that I am and believe in. Keen as I may be to clear my name, I refuse to feed the media spectacle created by people seeking to promote themselves at my expense. Aguardarei com tranquilidade o resultado de quaisquer investigações e processos, pois nada me pesa na consciência. Nego terminantemente as acusações de que sou alvo. Considero a violação um crime abjecto, contrário a tudo aquilo que sou e em que acredito. Não vou alimentar o espectáculo mediático montado por quem se quer promover à minha custa. Complimenti ragazzi per un’altra importante vittoria! #forzajuve https://t.co/um9zihs1yp Grandi ragazzi. https://t.co/lEamsy4b6n A legacy built on dreams 👍⚽ \nMy new Chapter 7 ‘Built On Dreams’ #Mercurial is out now at https://t.co/F9ISEcs3Pr\n—\n#Nikefootball #BornMercurial @nikefootball https://t.co/41lOD6fi3A Un’altra importante vittoria! Avanti cosi ragazzi, tutti insieme! #finoallafine https://t.co/sDcLQlAimG Excited to continue my legacy in the new @nikefootball CH. 7 “Built on dreams” Mercurial. 💪🏽\n#nikefootball #bornmercurial #mercurial https://t.co/LipUBWM8we Focused for tomorrow 👀 https://t.co/wv0fP3vW3s Thanks @EASPORTSFIFA for the World’s First copy of #FIFA19 🔥 Come and join me in the Game https://t.co/q31AiIsZsa Sono molto felice di aver segnato la mia prima doppietta con la maglia della Juve e soprattutto di aver contribuito a questa importante vittoria della squadra!👍🏽⚽️⚽️ https://t.co/Hgk1kz0Xww Let's go! Download the demo now 👉https://t.co/SvXGmVj0J4 #FIFA19 @EASPORTSFIFA https://t.co/bTxOAdmUzw Always on the ball 😉 #CR7Underwear FW18 campaign out now! New styles on https://t.co/RCLtRbCAT7 https://t.co/2D3ci3O5gz Feeling good !! Let’s go 👌👌👌 https://t.co/KcECAuFlvY Como dizem os meus parceiros, de volta à realidade 😅trabalho feito 👌👌👌 https://t.co/wWPSlRn8uw Vitamina D 👀👁💕🏊🏼‍♂️ https://t.co/toRHZo9mqR 👌semana top de trabalho,equipa ganhadora🙌🙌🙌🙌🙌🙌simmm https://t.co/69xdLESZyP Desta vez a apoiar por fora mas sempre convosco. Temos objectivos pela frente. Vamos, família!🇵🇹 https://t.co/OAy0ZFpFYP Two words only: HARD WORK! https://t.co/sqEB0CULbP Work done 👁😘👌🚗 https://t.co/L8oWKMWBfX Back on track👌blessed💫 https://t.co/0cR7r54O3b Altri tre punti! Ottimo lavoro di squadra!👍🏽\n#finoallafine https://t.co/sxDpYR9whr Parceiros 👌👌👌 https://t.co/0ABHEuvtXs Winning team!!💪🏽💪🏽 https://t.co/vG58bJN07S Thanks to everyone who voted for me. Will never forget that moment, specially the reaction of the fans in the stadium. #UEFA Goal of the Season #SpecialMoment https://t.co/9teapgD9MW Abt last night 👌😉 https://t.co/uoXal1GNqF Happy Sunday 👌🧘‍♂️😘 https://t.co/jyfkEU0voy Un’altra importante vittoria! Forza ragazzi!👍🏽 https://t.co/vHjSIZL1GF Drive your performance #Herbalife24 #CR7Drive #BehindTheResults #ad https://t.co/Aq3TYU7Qad https://t.co/zNh6LMdIv7 Challenge the rules by making your own. #nikesportswear #nikesportpack @nikesportswear https://t.co/KZ0aHL9YGB Happy to announce I’m now a global brand ambassador for DAZN!\nFor my fans in 🇮🇹 🇩🇪 🇯🇵 🇨🇦 🇦🇹 you can watch an exclusive interview as a Juventus player on @DAZN_IT, as well as unlocking other great CR7 content!\n#DAZN #CR7 https://t.co/Ysk5sm18xF La famiglia bianconera! #finoallafine https://t.co/lZKsURZXNY Buona Domenica🚴🏼‍♀️ 👌 https://t.co/3e1aSmg4Pz Felice per la prima vittoria con la maglia della Juve!👍🏽 https://t.co/JiVtoQTRlh New challenge, new wheels. \nSwitching it up a gear for the new season with the new Raised on Concrete Mercurial Superfly 360. \n#NikeFootball #Mercurial #BornMercurial https://t.co/glO76dEgJE Moments ❤️❤️ https://t.co/aFQoNdDcOZ Una giornata emozionante, in un’atmosfera speciale che racconta la storia vincente della Juve. Grazie a tutti i tifosi per il grande affetto! #FinoAllaFine https://t.co/odFWHqVFqp Catch my CR7 Fragance now ➡ https://t.co/NhOavoK1nC\n\n#CR7 #CristianoRonaldo #Fragance #MensGrooming #Grooming #AfterShave #Football https://t.co/UwWm6Lz71R Dupla vencedora 👌 https://t.co/G1suQwIX7j Comment 👍🏼if you’re planning on coming to a @PestanaCR7 hotel this Summer!\n#pestana #pestanacr7 #pestanacr7lisbon #lisbon #Portugal https://t.co/ECZ0D91P22 👌 https://t.co/VbcYZBV6AO 💨👌 https://t.co/2XbtARP6n0 🤔👌 https://t.co/FhWxuCioxY Primeiro treino duro. Trabalho feito!👍🏽💪🏽 https://t.co/MhHauAGPuM Inspired by your passion for the game. Thank you China for another incredible experience! Always believe.\n\n#NikeFootball #CR7 #CR7Tour https://t.co/xEr8KyUNAV Confidence in style. Checking out some of my favorite #Nike sneakers 💪\n#NikeFootball #CR7 #CR7Tour https://t.co/SNQ6nIIgmH Deeply honored and excited to announce the Active Schools CR7 Sports Camp: Providing access to football for kids from remote areas in China. They are the future! 👊 #NikeFootball #CR7 #CR7Tour https://t.co/dEmSNTvosh First stop to say hi with a few of my fans 😉👊\n#NikeFootball #CR7 #CR7Tour https://t.co/nCjLBz0RSs Excited to be back in China! Ready to inspire the future of football 🇨🇳 ⚽️ \n#NikeFootball #CR7 #CR7Tour https://t.co/HxABsbmLGL Excited to be a Bianconero! ⚫⚪ #ForzaJuve @EASPORTSFIFA #FIFA19 https://t.co/hlxDG8MmSo Advanced SIXPAD has launched in UK finally. You can manage your training via your smartphone. Check out the innovative product that I co-developed! Also Europe’s first SIXPAD store has opened in Westfield London!  https://t.co/yUbJRn3KlF @sixpadeurope #SIXPADSQUAD #SIXPAD https://t.co/T5mFqnZrdM ✈️✈️ See you soon China! #CR7TOUR #NIKEFOOTBALL https://t.co/Fr2JFUQAv9 Buongiorno👌 https://t.co/sAi72O2M5R ❤️ https://t.co/QpFgFEe4sd Momentos ❤️❤️❤️ https://t.co/lltoPcwegK Abençoado ❤️ https://t.co/qjFwcK5ghF Forza Juve! #FinoAllaFine https://t.co/bBZ5VWdEWX Lovely moments!👌🏽 https://t.co/oliOiB2xWe Congratulation on MTG and Mr. Matsushita being listed at the Tokyo Stock Exchange Mothers. #SIXPAD  #SIXPADSTATION https://t.co/hNC4QkgWqI ❤️ https://t.co/ad1kGpIEHN O vosso apoio foi e sempre será fundamental para nós.\nObrigado Portugal 🇵🇹 https://t.co/qjKNNp6skN High @sleepscore. ✅\nGame day ready. ✅  \nTry out this new app today! \nhttps://t.co/bcfa1BItoD #WhatsYourSleepScore https://t.co/dwmu9lnVqj Happy to launch my new #Mercurial Chapter 6 Edição Especial that celebrate 85 goals for 🇵🇹⚽️👍🏽\nComing soon at https://t.co/DMoFIzBAqL\n#NikeFootball #BornMercurial https://t.co/GilE69l2Hv Objectivo cumprido. Unidos e focados para os oitavos de final. Vamos Portugal💪🏽🇵🇹 https://t.co/fEdKbFB9X8 Mood👌🇵🇹💯 https://t.co/q43fbu6jsJ Leaving home at 12 was the hardest thing I ever did... but I believed.\nBelieve. #justdoit @nikefootball https://t.co/9ZWsz95CAz 🇵🇹 https://t.co/Awb3DLFAib Vitória importante. Continuamos focados no nosso objectivo.⚽️🇵🇹 https://t.co/tceQUIEfFO WHEN I TALK TO THE BALL, IT LISTENS.\n \nBELIEVE. #JUSTDOIT @NIKEFOOTBALL https://t.co/gUSFBj26b8 Feliz por ter sido eleito o melhor em campo. Bom trabalho de equipa!🇵🇹👍🏽 https://t.co/EjLIZxp3Dm Vamos família!👍🏽🇵🇹 https://t.co/YjfMbdx8xN Celebrating World Blood Donor Day and the start of the World Cup! Feeling strong with my young blood donors team! Respect for all you do to help people live a healthier life…everyday…everywhere! #2018WorldBloodDonorDay #BeThe1Donor ☝🏼☝🏼https://t.co/l70xoGKjO3 https://t.co/Kgof7dI50Q I’m so glad I went for it - it was the greatest goal I’ve ever scored.\nBelieve. #justdoit @nikefootball https://t.co/iSFRsSW4nc In my mind, there’s only one winner.\n \nBelieve. #justdoit @nikefootball https://t.co/7Z1btfgSHI Sonhar é humano …. e somos do tamanho dos nossos sonhos! @MEOpt https://t.co/8SM7UQW8Op 🇵🇹💪🏽😜 https://t.co/7jTQVbgrR7 Guess who’s back on the cover of @EASPORTSFIFA! 😉 #FIFA19 #ChampionsRise 🎮⚽️🏆 https://t.co/7jb1euX5Fu Time to pack!\nLet’s do it, team! ⚽\n \n#AmericanTourister #BringBackMore https://t.co/chjLBaU4tc Good morning🇵🇹😜 https://t.co/ZoVWW8Xk5B Unidos 🇵🇹👌 https://t.co/RQljR0ShqR When you believe you achieve.\n@nikefootball #nikefootball #JustDoIt https://t.co/ptLV2VzhMx Ready 🇵🇹👌 https://t.co/8jwT3lbaAl I’m bringing together some of the coolest heroes on the planet for my very own Super-Team. Stay tuned for @StrikerForce7! The game is on! @graphicindia &amp; VMS Communications https://t.co/owEPoxTTbV Os meus bebés Eva e Mateo cumprem hoje o seu primeiro aniversário! Parabéns meus queridos filhos!👏🏽🎂😘😘 https://t.co/BZuLX0OkH2 The world is watching. Let’s go to work #HerbalifeNutrition #BehindTheResults #sponsored https://t.co/HSPjsRJ7JK Vencedores 👌🏆 https://t.co/SN3oNC8xLY Never finished 🇵🇹 ⚽ 💪\n\nShop my latest #Mercurial in my personal store at https://t.co/E2zLOUFGP6 #Nike #NikeFootball #BornMercurial https://t.co/U8V6dQFvAs Are you donating blood and plasma regularly? Guess who could be next to you next time you donate!☝🏼☝🏼 BE THE 1. \nSave a life! Sign up to donate now at https://t.co/l70xoGKjO3 https://t.co/COLcWn7JDN Família. Momentos inesquecíveis 💪🏽❤️ https://t.co/d9wa3tcFnb 🏆❤️ https://t.co/cNVIXvzpvk História 🌎🏆 https://t.co/vhAitaP2Aw 🏆🏆🏆🏆🏆 https://t.co/5MhvvArz1b Believe It Done. #JustDoIt\n--\n#Nike #NikeFootball #NikeSoccer https://t.co/HJSlxDRJI0 If you believe, why not?\n#NIKEFOOTBALL #NIKESOCCER #MERCURIAL #BORNMERCURIAL #JUSTDOIT https://t.co/p0CnaLz5EH A caminho de Kiev 👌✈️ https://t.co/2s6bxDfov1 Don’t miss my sisters Elma Aveiro e @KatiaAveiro at Madeira Fashion Weekend on June 2 and 3! The party goes on at @PestanaCR7 rooftop! https://t.co/VdretpcKm1 My perfect shoes for the gym.💪 #Nike #Niketraining @niketraining https://t.co/qqtYbR1lDF Can’t wait to work with @Herbalife Nutrition for another 3 years! Proud to call them my partner in performance #HerbalifeNutrition https://t.co/xgMeqOCNof https://t.co/rTi7SZEtql Good morning ☀️ ☀️ ☀️ ☀️ https://t.co/MTAHJKerh8 👌⚽️ https://t.co/meWZy2b9nM Paz e amor 💕 https://t.co/IUbJ7lOqNu We’ve made it last year in Funchal, let’s do it for Lisbon this year! \nClick here: https://t.co/PfvzZ5oaCJ vote ;) \n#pestana #pestanacr7 #worldtravelawards #pestanacr7lisbon #cr7 #lisbon #portugal https://t.co/pJqIyLWnsq Pleased with this great partnership with #egyptiansteel @ahmedabohashima #A_New_Generation_Of_Steel https://t.co/4h4OHy365u ⚽️ https://t.co/OXizqFk0PS Muito contente por anunciar o gesto do meu amigo @enriqueiglesias em doar 7⃣% das receitas do concerto em Lisboa,ao IPO.\n#7solidario https://t.co/tmqGhNU5xC 👌 https://t.co/uTmxndlUJi Back on track 👌👋💪 https://t.co/WkhDmp8rAZ My thoughts and prayers are with you, my dear friend. Be strong, Boss! https://t.co/kmih28Xpsq Madeira Island, the place where I was born, is nominated for Europes’s Leading Island Destination! Let’s all vote?\nClick the link below to place your vote:\nhttps://t.co/zva1aGBD8G\n@madeira_islands https://t.co/Ao8KmXApD6 Ready for Russia? The FIFA #WorldCup comes to #FIFA18 on May 29th 🎮👌 @easportsfifa https://t.co/42DLu8MXWN https://t.co/T1VbAdifja Final 👌 https://t.co/A0xnTPUPKH The perfect boot for my biggest matches. ⚽ 💪\nGet yours on https://t.co/Td9BJOXwaj. #Mercurial #Nikefootball https://t.co/yU9dTFXuHo Soon UCL ⚽️ https://t.co/BsVWt5toQw Vamos equipo!👍🏽 https://t.co/73bMhzwxEk Chill in my hotel with my baby❤️ https://t.co/ySPQ9BP566 Relaxing 👌 https://t.co/fcFt2AGsBH ⚽️👀 https://t.co/1wY275ywgr O Cristiano foi o melhor marcador da escola! Parabéns filho!👏🏽🔝👌🏽 https://t.co/pRTxLdkxNO Congratulations @egyptiansteel for the opening in “Al Ain Al Sokhna”using the newest eco-friendly technology in the world. @ahmedabohashima #A_New_Generation_Of_Steel https://t.co/RyxWOU9Y9L Please support @able2uk today as the disabled awareness organisation celebrates its 17th anniversary #able2uk Vamos equipo!!👍🏽 https://t.co/6v0jEZaX8T 👌 https://t.co/bTFbcvVFhw Preparing my suitcase for a new trip!  Which colors look best on me?\nTravel in style with #AmericanTourister #BringBackMore\nFind out more at https://t.co/J6GqaZLIC8\n#MeAndMyAT https://t.co/W2A0XgiAwo Vamos equipo!👍🏽⚽️⚽️⚽️ https://t.co/NXoulxYVjU UCL⚽️ https://t.co/FmU9tDJCzC Feliz Páscoa!🐣 https://t.co/l77dlVmyhR Double trouble ;p @cr7underwear https://t.co/1HGbZRwrPB Results don’t happen overnight. It takes daily commitment. Watch my #BehindTheResults video with #HerbalifeNutrition https://t.co/1jwQxJIfmv 🇵🇹 https://t.co/VetQvKxFAs 🇵🇹 https://t.co/b0SUaPwbdU 🇵🇹 https://t.co/vknrvyNRW1 Fight as one, rise together !⚽\nThe new @Portugal National Team Collection, available on\nMarch 23rd on https://t.co/vmUIWvypW2 #Portugal #NikeFootball #TudoPorPortugal @nikefootball https://t.co/xJMxXU64Tt ⚽️7 https://t.co/rvYAhaDLN7 Vamos Equipo!👍🏽💪🏽 https://t.co/8BTu6Fwsvw 😂😂 https://t.co/mcoAIPPWgm Dedicated SINCE the Beginning. #BornMercurial\nGet THE Mercurial superFly 360 now at https://t.co/pzHBG6y9o5 https://t.co/497HZTdNeB Hola Madrid,\nwe are on the way! #pestana #pestanacr7 #cr7 #2019 #pestanacr7madrid #spain #madrid https://t.co/Z94V4BaVba ⚽️ https://t.co/LcWYOyOR0m Be strong. Have faith. Never give up.  #7WordsForSyria @SavetheChildren https://t.co/WjGltzXhSV Still legendary together. 10 years and counting. #ClearMen #WorldNo1MenShampoo https://t.co/9n5Ccwy3DE That feeling when you reach your goal 💪 See how @herbalife is helping people achieve their goals https://t.co/v6s4fEuTNy #BehindTheResults #FuelYourSXSW https://t.co/4TCn1TUvOe Vamos Equipo!👍🏽💪🏽 https://t.co/TU1TkArQ8W Fast meets Fast ⚡ Great to meet you brother! #bornmercurial #mercurial #nikefootball https://t.co/Kfp3acbLRm My SS18 CR7 Underwear campaign launches today! Go to https://t.co/D3TT7ERIz0 to check it out. ;) https://t.co/mnsPjMaewI My SS18 @CR7Underwear campaign launches today! Go to https://t.co/Vlium6FXZ6 to check it out. ;) https://t.co/hnQg3EGb0N Una victoria importante en Paris. Vamos Equipo!💪🏽 https://t.co/hOPilXXUgN Let's go 💪👌 https://t.co/H0KgDnfECO ⚽️ https://t.co/qm0fUiOjLb Vamos equipo!!👍🏽 https://t.co/mJ9lu3xufv 🐆 #bornmercurial https://t.co/Ce55ar3ysT 💪Jr say daddy I'm gonna be like you!!! What do you think?? 😂🤔 https://t.co/wL7KVyCkaF To more mornings like this at my @PestanaCR7 Lisbon hotel https://t.co/NBouh25NXH ⚽️ https://t.co/kGyIW7xvrE Feliz por haber alcanzado los 300 goles en la Liga Española por el Real Madrid. Vamos equipo!👍🏽 https://t.co/KBizM5OTdb Best of luck to #Egyptian_Steel latest addition...The soon to open “AL AIN AL SOKHNA” steel plant @ahmedabohashima @egyptiansteel #A_New_Generation_Of_Steel https://t.co/AJEoTZ09F0 Try to Keep Up 🐆 #BornMercurial\n \nIntroducing the Mercurial Superfly 360, available February 26 at https://t.co/oWxckoywkD https://t.co/UDvKWKjlNd Love is in the air ❤️❤️ https://t.co/cwyBIQNaBQ Juntos, a seguir luchando!💪🏽 https://t.co/WJuUOD84ko One 🌍 where we all ❤ our children. Please help. #Rohingya #Refugee @SavetheChildren  https://t.co/t2eJN244Jl https://t.co/9ZPwe5olJC Vamos equipo!👍🏽💪🏽 https://t.co/Z1Hon6cihl I love this game 😂😄❤️😉 https://t.co/6k3CElTIy1 Nice to see you bro. 👌💪 https://t.co/MMqLZDsEgJ Me and my boy 💙 Rocking our @cr7limitless &amp; @cr7junior gear | https://t.co/rIL6OxcBQk #CR7Denim #CR7Jeans #CR7Squad https://t.co/wGuGCAP2mg #bornmercurial @nikefootball https://t.co/ugnl0Ef6Xb #NovaFotoDoPerfil https://t.co/36nZtKDiMQ Thanks @Nike for this amazing birthday gift!🎁👟👌🏽🔝\n#24kgold #AF1 #CR7 https://t.co/LYDy58Vs13 Job done with a special partner on my birthday!💪🏽❤️#livelifefit https://t.co/4hGRRssTZv 33!🎂🥂Thank you all for your birthday messages https://t.co/YUJGDZCsAe Not bad for my first time playing football 💪🏼 \nhttps://t.co/oAaLFOnMn8 #NovaFotoDoPerfil https://t.co/XrUiPnpEqk 👌 https://t.co/saZsfm4Qrp New jersey. Thoughts? 😉 #Ad https://t.co/7icciDe4UR #CR7Fragrance the perfect scent for Valentines day! https://t.co/gNubub7SDE ❤️❤️❤️ https://t.co/Njzma7SeyY Denim on denim 👖 living in my CR7 jeans 👌 Get yours now on https://t.co/rIL6OwV0rK @cr7limitless #CR7Denim #CR7Jeans https://t.co/pc6ippbitm Esta noche no te pierdas “En el corazón de la 12”, en RMTV (22:30h) https://t.co/dWGZdy2sd6 Glad to win the award of the 懂球帝(All Football) 2017 best player. Thanks to the Chinese fans who have voted on me. https://t.co/B92Os5fbXx Vitoria importante. Juntos vamos continuar a ganhar! https://t.co/zpw72rOkZp Ánimo equipo. Ánimo madridistas. Aún nos quedan muchas batallas por ganar. https://t.co/xkbCAMYmpk Vamos equipo https://t.co/Sh8B2IYZdM You might see the shots I take on the field, but you don’t see what’s behind those results - countless hours of training and a commitment to good nutrition. https://t.co/ovJlD6pc7p 🇵🇹❤️☀️ https://t.co/KUdnB7iR4B 9️⃣9️⃣! Highest-rated player in the @easportsfifa Team of the Year! Thanks for picking me 🙌 https://t.co/ak34v7CWBe #FIFA18 #FUT #TOTY https://t.co/i5Iti8nl0l Honored to be nominated for the 2017 Laureus Sportsman of the Year Award. This is only possible because of the great team effort at Real Madrid. Thanks to all my team-mates and also to the world’s media for having placed me among the candidates to win this very special award. Wearing my Signature CR7 Steel Shirt 👌 Comfort is the new luxury. Find yours now on https://t.co/rIL6OxcBQk @cr7limitless #CR7Denim https://t.co/t9SGSc7nsh The wait is over, my AF1 CR7 is launching today! Now available Globally on https://t.co/hiajNcJH0B, the Nike SNEAKRS App and select retailers.👌 #AF1 #CR7 https://t.co/9ByGWNqYXj Practice 👌 https://t.co/VQ5jqj55cz Home away from home #pestanacr7lisbon https://t.co/LB4KiKpK13 A new year can mean new goals 🏆. What are yours? #BehindTheResults https://t.co/KuCbOJswpZ Quando jogava nas ruas da Madeira e sonhava chegar ao topo não pensei que tiraria uma foto assim. Dedico este momento à minha família, amigos, colegas de equipa, treinadores e às estruturas de clubes e seleção. Um agradecimento especial aos fãs. Estes troféus também são vossos! https://t.co/Rf5rcHAqMX Celebration time…Join me and give a gift for life! Sign up to donate blood and plasma at https://t.co/4kjqXfhE25 https://t.co/yIWgzp5PZG Late night chats by the pool #PestanaCR7Funchal https://t.co/sfFLYF011E Gala CR7 2017!👌🏽🎉❤️ https://t.co/xnm4cYJYkX Wherever. Whenever. Arrive in style. Get the full @cr7limitless look now on https://t.co/rIL6OxcBQk #CR7Denim #DesignedToMoveYou https://t.co/nIOftVsypS Estou PRESO a estes bebés lindos ahahahah ❤️❤️❤️ https://t.co/RogaRwDJra Feliz Natal,paz,amor  Deus e saúde =FAMÍLIA❤️❤️❤️❤️❤️❤️❤️❤️❤️ https://t.co/7PjMs4sdJu We are ready 👌 https://t.co/n8eNd125IM I truly value the commitment to make a meaningful difference in people’s lives and this is what #Egyptian_Steel is all about! @ahmedabohashima @egyptiansteel #A_New_Generation_Of_Steel https://t.co/KjeaK6fc0B My new #CR7Fragrance one of my favourite presents to give my friends and family this Christmas! 🎁 https://t.co/2rAwJXQVCI 🏆 https://t.co/zapVkPkpVa Dynamic and united…my new team of young blood and plasma donors are motivated! Like @BETHE1Donor​… #BETHE1Donor #Abbott ☝🏼☝🏼\nJoin us and donate now…You could save a life…Sign up at https://t.co/cKBhHaMYwd https://t.co/oQ8aSrKAoz 🏆 https://t.co/crsE7HUXhK Campeones❤️🥇 https://t.co/aPjiyE6NMI Proud!!! Champions of the world ⚽️ https://t.co/HpRRty01r2 Focused ⚽️ https://t.co/lRAjjkOQTy My Mercurial Quinto Triunfo is out now.👌 Find them at https://t.co/DVqPiekKju\nHurry, they're likely to go even faster than me. 😜 #nikefootball #mercurial https://t.co/BR9KMK6Dbd ⚽️ https://t.co/Vog9rm99C2 😋 https://t.co/4FWHtcPrwh Mercurial Quinto Triunfo. Coming soon. The perfect way to celebrate my fifth 🏆 . 👌 Sign up for a reminder at https://t.co/DVqPie38UU #nikefootball #mercurial @nikefootball https://t.co/X57pqv2eJY ⚽️👌 https://t.co/fTw1QriXnm 😉❤️ https://t.co/7WQ9lhxneL ❤️ https://t.co/TsSqSBXg2j Be your own rival. 🏆 #CR7 #NikeFootball #PlayFree https://t.co/g5tv70viEP Another dream come true. Unbelievable feeling. Thanks to my family, friends, teammates, coaches and everyone that stood by my side throughout the years.👌🏽🔝 https://t.co/A9jyYswePD Flying in style!!👌🏽🔛 https://t.co/QvPHhMmRRQ My AF1 CR7’s launch today on the Nike SNEAKRS app! #AF1#CR7\nGo to https://t.co/adIUxXBRvm https://t.co/4Enyjf4dw6 Next up! My Air Force 1 CR7 launching on 7th December 🙌🏻 Download the Nike SNEAKRS App to find out more https://t.co/adIUxXBRvm #AF1 #CR7 https://t.co/RClWGWB9f8 As a thank you, I am offering my fans a flash sale on all my ROC headphones, the perfect holiday gift :) Go to https://t.co/A2oknZOmsC\n\nhttps://t.co/WqEHHPvBBc #ThrowbackThursday to my launch event in Madrid! #CR7Fragrance 🙌🏻 https://t.co/qq0cKkSHjC Nothing is coincidence 🙌🤗⚽️ https://t.co/VrFSKuC30R ❤️ https://t.co/9lbC3DzpEm Get all your favorite CR7 Denim gear with our Cyber Monday special 👉🏼 https://t.co/yxYL0ZWATi @cr7limitless #CyberMonday #CR7Denim https://t.co/8FkqYLx2iP The ultimate #SportsBar in town\n#PestanaCR7Lisbon #CR7Corner https://t.co/Vezs4LYO2Y The best spot in town with the best company!👌🏽😍 https://t.co/tRPgEQwVf3 Get ready for the weekend 🙌CR7 Mens &amp; Boys Collection available on https://t.co/rIL6OwV0rK @CR7limitless #BFCM #CR7Denim https://t.co/jUdkirJKzg Music is part of my life. It's part of me. ROC is my headphone brand, go to https://t.co/sFd4IXi33N and see them now. https://t.co/iX5r7k7y9N 🙌 https://t.co/kroGIz44oK Trabalho feito 👌 https://t.co/8sHMyw6nNc ⚽️ https://t.co/EFxGK7rY7e Os 3 mosqueteiros 👌👌👌 https://t.co/hajkSBkcuT If you missed out on the first drop of my Mercurial CR7 Melhor, you can get them again now in Europe here https://t.co/pCM5IcnHP6 #CR7 #Mercurial #NikeFootball https://t.co/fiwM2YyuBE Score goals with me wherever you go with the new FIFA Mobile season 📱🎮⚽ Download for free now! https://t.co/PcGJr6l7eB https://t.co/xfYSQqMC5Z Focado 👌 https://t.co/F2JmxphRm8 A Alana Martina acaba de nascer! Tanto a Geo como a Alana estão muito bem! Estamos todos muito felizes! ❤️ https://t.co/nMT4rYc32U Living it up in the CR7 Suite.\n#PestanaCR7Lisbon https://t.co/IWHlrHdx0L Genes 👌👌👌 https://t.co/ctVAuXhuzu Vamos preparar bem o Mundial e ajudar as vítimas dos incêndios. Bom jogo, malta! #tudoporportugal https://t.co/haGwRbMwh4 Special guest today in training ground 👌👌👌❤️ https://t.co/M0mG9Cueu9 #CR7Junior IS LIVE 👖 ⚽ Now available on 👉 https://t.co/rIL6OwV0rK @CR7limitless #PressPlay #CR7Denim https://t.co/MWGzbQXnUu Like father like son 😜 We are excited to launch our #CR7Junior denim collection. Now live on 👉 https://t.co/rIL6OwV0rK #PressPlay #CR7Denim https://t.co/UgsQdICvM5 Work done ✈️👌👌👌 https://t.co/ezyjWr70Tf Building projects with green steel is a real innovation. @egyptian_steel\n@AhmedAbuHashima https://t.co/3joVu2xNO0 💎👌⚽  \nChapter 5: available on https://t.co/3dYSJ5Yb4C  \n#mercurial #CR7 @nikefootball https://t.co/mrQYBzOQvB Learn the secrets to my success at \nhttps://t.co/4uhloqwgnO  #ROCliveLifeLoud #headphones CLEAR Men: World’s #1 Men Shampoo ☝🏼 https://t.co/YdGkG2tS9f ✌️ https://t.co/2VgVvtirSb Loving my new CR7 woven shirt 👔Styles for everyday. https://t.co/rIL6OwV0rK 💪@CR7Limitless\n#CR7Denim\nhttps://t.co/Q0m8a6Jgtg https://t.co/VygTQPzDXQ Positive mind 👌✌️ https://t.co/UxAxTn5DBq I vote for my hometown, Madeira, as the world’s leading Island Destination 2017.  Are you with me? \nVOTE HERE: https://t.co/oVLQ3IdvTd  😉 https://t.co/lQCxX3bzxv Camo style! 👍🏼 @CR7Underwear #CR7Underwear https://t.co/bkbElQM8X3 Good times at my hotel in Lisbon!  #PestanaCR7Lisbon https://t.co/ao2BsBKsaD Ensinando aos meus 2 filhos com talento, trabalho e dedicação e a única forma de chegar a ser o número 1❤️❤️🇵🇹 https://t.co/gZIKpydF2p Not bad 11 😉😉😉😉😂😂 https://t.co/Ww0rCnU3Cv ❤️ https://t.co/60uQL39qpX ❤️❤️❤️❤️❤️❤️❤️ https://t.co/OTsB8kG1u6 Amazing feeling to have won this award again. Want to dedicate to my family, my friends, my teammates and coaches from both Real Madrid and Portuguese NT and everyone who supported me. https://t.co/umpYMo1JZg Here we go again!!👍🏽 https://t.co/R6FXROynbh My Air Max 97 CR7’s are available exclusively on the Nike SNEAKRS app today! #Airmax #CR7\nGo to https://t.co/adIUxXBRvm https://t.co/rJc16yAnpO 👌 https://t.co/Ue5mENXs6i 👌 https://t.co/I3BocNEkMk ⚽️ https://t.co/jYGc7ODgnI Impossível ficar indiferente a esta tragédia. Solidário com familiares e amigos das vítimas. Apoio total aos bombeiros que arriscam a vida para ajudar da melhor forma possível.🙏🏽🇵🇹🇪🇸 https://t.co/VO8Tjx0jHG Coming soon!!! Check out my Air Max 97 CR7 ! #AirMax #CR7\n\nDownload the Nike SNEAKRS App to find out more https://t.co/5RXRv8GtuX https://t.co/YS29BZkhM0 Having lunch in the best restaurant in town!👌🏽😍 https://t.co/EipmR2fkeo ✌️ https://t.co/aZAP0653l2 Equipo👌👌vamos https://t.co/VUrgyjgMMA Happy to announce the #CR7Challenge winner. Congrats @daniel_nilsen ⚽️ 👍 https://t.co/XAMiheAh9i Turning on the light.\nYou’re about to get a glimpse of high-performance in digital!\n#7egend @official_7egend https://t.co/IUtQi9n8jO Motivation! This bag of plasma can help save lives. Share a selfie donating to inspire others! #IPAW2017 #BETHE1Donor https://t.co/zx3dSHbnks Great team effort! Thank you all for your support. Russia, here we come!!👍🏽🇵🇹 https://t.co/cEPJWCDA2R Ready 🇵🇹🇵🇹👌 https://t.co/pnuP3DMr4Z 🇵🇹 https://t.co/fur6MDyrMJ Old school 🇵🇹 https://t.co/jWdWTeDgVO THE FUTURE OF DENIM 💪 Shop my  #CR7Denim collection now on https://t.co/Q0m8a6Jgtg @cr7limitless https://t.co/Oe5XYA1Nr4 🇵🇹🇵🇹✌️ https://t.co/5qzZSLYeq9 Read my story on @Playerstribune.\nFind out more: https://t.co/kMPu6WwQKz\n#Mercurial #CR7 #NikeFootball https://t.co/Hm6Dt18Dku A sneak peek into THE FUTURE OF DENIM 💪 Shop my new #CR7Denim collection now on https://t.co/nRKYCXG1Za @CR7Limitless https://t.co/F2QiAxUAzc Estarás sempre connosco. Parabéns, pai. Parabéns, avô.🙏🏽❤️ https://t.co/3EljW0h4f7 Show me your spin on it #FIFA18 @easportsfifa https://t.co/UdcqDeIgLu https://t.co/0hDtXPdmTm I think Cris loves them more than I do! 😜❤️ Chapter 5: available now on https://t.co/WXiZU0RblO @nikefootball https://t.co/r0hhe3Pzdb ✈️ https://t.co/7dDGhK1pxZ Match day tomorrow. Let’s do this 🙌 #Mercurial #CR7 #NikeFootball \navailable on https://t.co/gqzYq3gxeU, September 29th. https://t.co/U7yEcO09oS 😉 https://t.co/20TDBRiQzK ✈️ travel https://t.co/yLOaTIZu4Q En este momento de dolor, envío a la familia de Santiago y a todas las familias que han perdido sus seres queridos un enorme abrazo. https://t.co/odD28aFPfv Recovery session happy Sunday ✌️💕 https://t.co/sbQBQrr5pV Unbeatable Performance with 2x the Power!  🤜🏼 🤛🏼 #CLEARMen https://t.co/gaUouhowA5 Can’t wait to play in these 💎 ! #Mercurial #CR7 #NikeFootball\navailable on https://t.co/gqzYq3gxeU, September 29th. https://t.co/p5QUGhCe1S Un abrazo muy fuerte y solidario para Mexico https://t.co/Jr9FBdEI95 A great partner balancing between its social responsibility and its advancement in the steel industry. @AhmedAbuHashima @egyptian_steel https://t.co/0IUevl8g5v 😉 @CR7Underwear https://t.co/vqAdI6pp8H Bom dia✌️ https://t.co/YqFEGHhiXR ✌️ https://t.co/yW6aqX4yZz Number 👆 in @easportsfifa\nNow how many goals can you score with me in the #FIFA18 demo? https://t.co/Gfmh3naeZm #ad https://t.co/cHI2D8gkBX 👌👌👌 https://t.co/foZGk9eE09 Eyes 👀 are the mirror of the soul 👌👌👌 https://t.co/NVKZuRAGX9 Happy Sunday 👌👖👔 https://t.co/MQTd4mXVL0 #LiveLifeFit @cr7crunchfitness  💯💪 #Fitness #Madrid https://t.co/nUbUyaOQzg Momentos 👌👌👌 https://t.co/7pazQtCB37 Having fun tonight at the global launch of my first casual fragrance, CR7! 👌🏻⚽ #cr7fragrance #myfragranceyourgame https://t.co/QzCaUHlyOm Nothing better than workout with this view 🙏🏼😁 @PestanaCR7 #MadeiraIsland #Funchal https://t.co/VCfcaIagp5 Have you ever had the hassle of a broken phone? I did… So now my new partner, @PanzerGlass, and I have created unique screen protection 😎 https://t.co/B3lK1jOSPZ Vestido com a minha linha de camisas e calças 👌👌👌🇵🇹 https://t.co/xZbDN5BHp3 Very important victory!💪⚽️ https://t.co/rmOUVsZ2Uk 🇵🇹 https://t.co/YRderddFPq Focused and ready to let loose 🇵🇹⚽\n#playfree #mercurial https://t.co/q1G3FgmKb2 ⚽️🇵🇹👍 https://t.co/RXE986guQu Nice to be back to the National Team!🇵🇹💪 https://t.co/QBFYtmUTIP Time to check out @PestanaCR7 https://t.co/OsarxgJPs6 ⚽🏆 #CLEARMen https://t.co/UBO0KHu2Go THE MAN🏆 https://t.co/mmqLjO74rc GRACIAS EQUIPO🏆👌🙏🏽✌️❤️ https://t.co/UICp7azcnH 👀🏆 https://t.co/3dqBrVplEn Thanks to my teammates, coaches and staff who helped me win this trophy. I dedicate this to my family, friends and fans. This is also yours! https://t.co/f9CIPyuYnX ✈️ https://t.co/sqieDJBU91 Have you ever related steel to eco-friendly? I did.. that’s why I’ve partnered with the most safety-oriented steel brand #Egyptian_Steel https://t.co/8MoFjuALNK Mais uma decisão incompreensível. Injustiças que nunca me derrubarão. E como sempre voltarei mais forte. Obrigado aos que me têm apoiado. https://t.co/O7Et9A8Edp 😎👌 https://t.co/HPnX6kBBJ8 New season. The World’s Game kicks off September 29. https://t.co/LysfeiNInt @easportsfifa #FIFA18 #ad https://t.co/IwgATJUzyf My secret is dedication. 💯 @CR7CrunchFitnes #LiveLifeFit #Fitness https://t.co/NFqlXTe3O2 🙏🏽 https://t.co/h92Ul2u9wQ Consternado com as notícias que chegam de Barcelona. Todo o apoio e solidariedade a família e amigos das vítimas. champions Super Cup 👌👌🏆 https://t.co/T9iW6JyTlJ Great session this morning!!!! Winning team 👌 https://t.co/TzUc1QKVAy Team 👌 https://t.co/OLPPEP82wE Blessed❤️️❤️️❤️️ https://t.co/L5OQBOx5Io Living in my #CR7Denim jeans👖A big shout out to my fans for the support ✋ Thank you, Obrigado and Gracias! @cr7limitless https://t.co/TKcrEZNTEy 👌 https://t.co/BKyh3SAlJu 🏆 https://t.co/wJ33rfJ9JA SUPER CUP 🙏🏆🏆🏆🏆 https://t.co/Epnv9oKHS2 Proud to announce that my #CR7Denim Collection is now officially LIVE at https://t.co/rIL6OxcBQk   👖💪@CR7limitless https://t.co/dK3lMp54x6 Looking good👌 https://t.co/PgD7HC258e COMFORT IS THE NEW LUXURY! 👖Can't wait for the official launch of my #CR7Denim Collection tomorrow!! 💪🏼💪🏼💪🏼 @CR7limitless https://t.co/KAAcVDiurt Great to be back!👍🏼⚽ https://t.co/AKjVLn05AQ I only choose a shampoo that is best for me, keeping me Dandruff-Free. #CLEARMen https://t.co/yM3YW0XMaT Coming soon! #CR7Fragrance #MyFragranceYourGame 🕑😉👌🏼 https://t.co/wVlHjFhbFm “Son, follow your dreams.” I always remember my parents’ advice. What’s the best advice you’ve received? #ad @Herbalife https://t.co/TgnVgtfAwZ Happy with my new partnership with @EXNESS https://t.co/TjFu0u27UI A lot can happen in 5 years but for some refugee kids, nothing has changed. Don't forget about them. #Zaatari #Syria @SavetheChildren https://t.co/f7BgY4gs2w It's good to see how fast I'm \"shared\" in the United States 🤣👍🏽 #RonaldoFaster https://t.co/KGUTfBiEsa TB one year ago, at the opening of my first hotel! @PestanaCR7 https://t.co/xY2cWmWwJs Thank you China! I'm deeply moved by your passion for brilliance. See you next time. 再见 ⚽👋🏼🇨🇳 #Playfree #CR7LIVE https://t.co/ldClz8FzAP China's stars of tomorrow, you've earned this gift. Keep working hard, but remember to play your way. Remember #playfree #CR7LIVE #Mercurial https://t.co/p6iFA1CfLp Hitting the gym before day 3 in China! Checkout my new workouts in the #NTC app. Try and keep up! 😉💪🏼 #CR7LIVE\nhttps://t.co/doUZiVd6eI https://t.co/odlodLss4Q Congratulations to the Nike League champions. The future of  football is yours. Work hard and #Playfree #CR7LIVE @nikefootball https://t.co/cWmKdKKs5G 你好, China! Day 2. Taking a journey through my #Mercurial past at the Beijing house of brilliance. 🇨🇳⚽ https://t.co/e6r0wwGX6F Thank you Shanghai! More tomorrow... #CR7LIVE https://t.co/9odJbMj8pZ First stop. Seems a few people got here before me. 😜#CR7LIVE https://t.co/HJuq3wPckO Hello China! I'm here for 3 days. Ready for brilliance.   👊  #CR7LIVE #Playfree https://t.co/jAcVKlT0aC Spent great time in Singapore. Look forward to meet with Peter Lim again soon. https://t.co/7GU3VnhDAN TEAM!💪🔝👌 #CR7live https://t.co/TYa7wDdAwW ✈️👌🔝 #nike #CR7live https://t.co/FkWJSzrfvl Thrilled to be part of the family @tatelrestaurant @ZelaRestaurants. Best team @enriqueiglesias @paugasol @RafaelNadal &lt;3 https://t.co/PeoO9Skhgc Talking business in my favourite  restaurant #TATELIbiza! Big news coming soon!! https://t.co/cvwpAywUCx I'm ✈️✈️ to watch the best of 🇨🇳⚽️. Heard that football is booming there. Can't wait to see the brilliance. 👊@nikefootball https://t.co/EbnHrFoE3S The feeling of waking up like this @PestanaCR7 https://t.co/k38g9xdF6q I’m always looking for ways to be healthier, faster, and stronger. What are you doing to better yourself? #TrueToYourStory #ad https://t.co/nwj6r76LCd Big family with love ❤❤❤❤❤❤❤❤❤❤ https://t.co/GOuL6KevVs Lovely moments😍 https://t.co/PBBmASNGL1 Shoot like a pro with nubia Z17. @nubiasmartphone https://t.co/1xmnnl5hdo Not slowing down. Get the Air Zoom Mariah Flyknit Racer now at https://t.co/O6hyFLwAkq. 💨 @nikesportswear #teamnike https://t.co/mK33g2TjlG Being an athlete is a lifestyle. Train 👍🏼practice healthy habits👍🏼fuel your body with good nutrition👍🏼 #TrueToYourStory #ad https://t.co/l4uuV6PEY7 Blessed https://t.co/Sby3sUOjVa Good morning👌👀😎🏡 https://t.co/f7UcHQFrK1 Todos juntos, dentro e fora de campo. Vamos malta!💪🇵🇹 https://t.co/4BPkK43mEe So happy to be able to hold the two new loves of my life 🙏❤ https://t.co/FIY11aWQm9 ready for tomorrow🇵🇹👌👍 https://t.co/0BWVkEZxOY Recover stronger with a combination of carbs and protein to aid in muscle repair. #TrueToYourStory #sponsored https://t.co/Ld9M8WfI8D Gaming experience of nubia Z17 is amazing. https://t.co/qdiq8hQPTy Focused👌🇵🇹 https://t.co/3cotEeRtXv 😃🇵🇹 https://t.co/YD63MYnGDe Semi final well done team 🇵🇹👍👌 https://t.co/UJyPs37jw1 👀ready 👍 https://t.co/Lg9KMzZG6s MUITO BEM EQUIPA 🇵🇹🇵🇹🇵🇹🇵🇹🇵🇹 https://t.co/mBjAdninYU Everyone please watch this video from @SavetheChildren for #WorldRefugeeDay https://t.co/NPNRzkBtr1 Let's go to Moscow 👍 https://t.co/cLH5n6cE7w New boots. Same goal. 🏆🔝🇵🇹\n#Mercurial #Portugal #CR7 #Nike #Football #Soccer https://t.co/Y1wOMdmodq 🇵🇹 https://t.co/Q5QpUSoiaH Excited with my second reveal with #Egyptian_Steel in partnership with @AhmedAbuHashima. State of the art steel plants building the future 👍 https://t.co/aB0DA4sS6w Proud to represent the National Team\n🇵🇹🇵🇹🇵🇹🇵🇹🇵🇹🇵🇹🇵🇹🇵🇹🇵🇹😘 https://t.co/G0x0y4UZP7 Bons momentos na companhia de verdadeiros campeões!#terradossonhos @terradossonhos https://t.co/2Ger1ZOivg Excited…tomorrow is #WorldBloodDonorDay! Be 'also' the one☝️ ! #BETHE1Donor #WorldBloodDonorDay https://t.co/RNo22XBImH Just relax and enjoy the view🏡👌 https://t.co/0cuptCDwfC Your body is like a race car 🏎 !! You need to fuel it right to keep performing at your best! #TrueToYourStory #sponsored https://t.co/18qEPV1sed Happy to be back home❤️️🙏 https://t.co/pFJlXaYFHN Gracias aficionados 🙏 https://t.co/4Oc7VzUAl6 #FIFA18. It’s My Time. https://t.co/eTNXUAAHqm @EASPORTSFIFA https://t.co/nZRDTKyKV7 Simmmmmmm👌 https://t.co/3FxD9QhAVB #JustDoIt https://t.co/GmQrtf6aKf 4 times in the row 👌 https://t.co/2hBAkO1HBT Champions. ⚽️⚽️⚽️⚽️😘❤️️ https://t.co/Ppmt7QdEFM Pick your skill level. Master it. Do it again. 🔝⚽🔝 https://t.co/6WvIolVqu7 2days https://t.co/qAloSMX5My CR7 Denim👌🏼 https://t.co/JIUfYQ4rxT Drinking my tea and reading my book👍👌😘 https://t.co/OyICtEoinA Maximize your time in the gym. Work smart, focus on your goals and prepare for any challenge that comes your way #TrueToYourStory #sponsored https://t.co/4GI0nd9ZC7 Glad to introduce the 1st reveal of my campaign with @egyptian_steel in partnership with @AhmedAbuHashima. Stay tuned for the 2nd reveal! https://t.co/ZbNxXOsnvQ Sprinting 👟, juggling and balancing techniques ✔ Trading skills\nwith @Herbalife. Can you ⚽ like me? #TrueToYourStory #ad https://t.co/gfBRUJHjRX Today was announced the new @ altice brand... like it 👍 We keep together\" #Altice  https://t.co/zv7UlMKZcm https://t.co/YBs5ZVYVG4 https://t.co/DIfZJJb5Jf Champions 🇵🇹🇪🇸simmmmmmmmmm https://t.co/WX8kTy8kJq Throwback to my CR  Legacy fragrance shoot! 📸Check out more pictures here https://t.co/xxisDXcKxP #CRFragrances https://t.co/em9zGJedj0 #TBT to the ﬁrst time I took my @CR7limitless jeans for a spin. 🚴🏼👖https://t.co/rIL6OxcBQk https://t.co/sfybTlWVJK 😁 https://t.co/JRPBcaIbTP Well done boys👌👍 https://t.co/mc3WTlUf6V We already had 250 000 visitors in my @CR7Museu !! Thank you all!👏👌 https://t.co/8Q2pLAAQhs Thumbs up for nubia Thailand Flagship Store grand opening and good luck on the Mobile Expo 2017. @nubiasmartphone https://t.co/pJgpqxkK4C 👍 https://t.co/Q6G2GKNQ5D ⚽️👌 https://t.co/0DMZ4EvJSn 👌⚽️⚽️⚽️⚽️ https://t.co/nDhU71HldC Good night ❤️❤️️ https://t.co/y6kolDAiRJ VAMOS EQUIPO👌👍 https://t.co/6OJ9Pz2wYE 👌⚽️👍 https://t.co/3vyjD6z74s Selfie time☀️️👌👍🙏 https://t.co/gv8Jj07kX7 Love you❤️\n#happymothersday https://t.co/SrkoGJHzxn A new project is coming soon... stay tuned! https://t.co/JGDoBK78Ks I’m fast, but it would take me three matches to run this far. 😅 #BREAKING2 #TEAMNIKE https://t.co/PcAYgzJsCh 👍 https://t.co/D0jcHmw8fc Together💪💪💪 https://t.co/BulXteEOyu UCL👌👍 https://t.co/1sDWL74Hug Vamossssssssss👍well done boys👌👌👌👌👌👌 https://t.co/0icct4DL03 Feeling the love from around the world on CR7 Denim. It means a lot! Remember to sign up at https://t.co/rIL6OxcBQk and follow @CR7limitless https://t.co/zxj06G6KTV It's always a pleasure to meet nice people! God bless you and your family👌👍🙏❤️️ https://t.co/5tsiavFuAO So excited to finally announce CR7 Denim is almost here and launching on 1st June. Head to https://t.co/rIL6OxcBQk and follow @CR7limitless https://t.co/rCvX77DF0O 👌 https://t.co/xNWSGM8jnf Big announcement coming @CR7limitless . Any ideas? https://t.co/KpQGRyFN3q From Manchester to Madrid, scoring 💯⚽ #Mercurial available on https://t.co/F9ISEcs3Pr @nikefootball https://t.co/DVbgQxcnJA 👍 https://t.co/s1PEdYalM0 Another night to remember. Amazing win!! Great team work! 👍🏼💪🏼🔝 https://t.co/H2qRcg7XYe Ganadores 👌 https://t.co/r1cwgSIoNe Feliz, por haber logrado el récord con la camiseta de este club. \nHala Madrid! 💯👍 https://t.co/hS7VFx9UF2 Train hard to win the toughest battles💪 #Mercurial\nMy #CR7 Chapter 4 training gear is out on https://t.co/hiajNd1ipb https://t.co/DjkTKx9plq So happy with the victory tonight and to have reached 💯⚽ in European competitions.\nA huge thanks to all my team mates and coaches. https://t.co/sCamfVFwvE good morning 👀🕶👌🏼👍🏼 https://t.co/Mg1wKsYRqJ Forged in Manchester 💪🏼#Mercurial\nAvailable tomorrow 👀👉🏼https://t.co/E2zLOUFGP6 https://t.co/nuvDnwWbU1 👀👌🏼 https://t.co/hb5Ge5epqg Putting the 7 into CR7. Many happy memories of Manchester 🏆 👌 #Mercurial \nCR7 Chapter 4 - Available April 10  @nikefootball https://t.co/RiDvkkDfEU First day with my new boots. 👌 https://t.co/n8QWiJVKGM My new #Mercurial – inspired by the 6 years in Manchester that made me CR7 💪 \nCR7 Chapter 4 - Coming April 10 https://t.co/N6SlraQJyv Soon👀 https://t.co/LOX4aKqo2P 👍🏼 https://t.co/4LFFUXgzxk Selfie time👌 https://t.co/UDV4bwbI1D Be focus👀 https://t.co/ul9bJMYCIE Just finished shooting with @nubiasmartphone, very impressed by the dual camera! Looking forward to the product launch on April 6th https://t.co/bnJSHTAcvr Proud 👌👌👌🛫 https://t.co/Z0tPBJLDC8 Happy and honored to have my name given to the Madeira airport! ✈️👍 https://t.co/6SxibYtxje Always special to be back home!🏆👍🔝 https://t.co/1DmtPxrIuj 🇵🇹⚽️ https://t.co/gsCazNBsMD Lunch with my little man❤️️❤️️❤️️ https://t.co/9ohWhAKVR1 Well done boys 👌🇵🇹 https://t.co/EsUiLo6sgW Great mood With my boy🇵🇹👌 https://t.co/L4uX6C795P Just dream it and achieve your potential! Now share your success story with @turktelekom to inspire us all. #justdreamit #senyeterkihayalet https://t.co/g7LtENKnpE Glad to meet these amazing kids today! They are a true source of inspiration 💪 @terradossonhos https://t.co/rffvehvvY1 🇵🇹🇵🇹🇵🇹 https://t.co/6j3fJnZIQ6 Perfect for the summer! 👍🏼🔝 @CR7underwear https://t.co/6wNnolthcq https://t.co/hXrRmpLGcT 👌 https://t.co/lNLapUBuXC Always staying ahead of the competition. 👍🏼 Speed training with @Herbalife . #sponsored #TrueToYourStory\n https://t.co/3SAsb4k4jL Today I think of Syrian kids like Omar* who drew his dream of being a barber. ✂ #SaveSyriasChildren @SavetheChildren https://t.co/8Ca2B5SbXh Did you check out the latest update for my mobile game? It's awesome! How many goals can you score?\nUpdate Now: https://t.co/RX5FZclXci https://t.co/UYrGY97RSa Had a lot of fun today at the grand opening of the CR7 Crunch Fitness at Ciudad Lineal👌🔝 https://t.co/MHGunJjWWa Ya conoces mi nuevo gimnasio @CR7CrunchFitnes ? Ven a ciudad Lineal, hasta el final del mes y  aprovecha la matrícula gratis 😉 https://t.co/NcCXFhJo4w All of my favourite styles ￼￼￼are in the SS17 #CR7Underwear campaign! https://t.co/bGlQH5sKHu Training 👍👌 https://t.co/7erxmUeUwY VAMOS EQUIPO. HALA MADRID 👌👍 https://t.co/Pnvi8Q4PO0 To be a champion, you need the best. @Xtrade will give you the right tools to start with. https://t.co/wF7n2MNbE9 https://t.co/qs3N7u9BZm 🚴🏻 https://t.co/iEeVY8TnNg @nubiasmartphone is ready  #ToMeetNewPossibilities. How about you? Go to Nubia Stand at the #MWC2017 Barcelona and get the latest news https://t.co/uCSvjcc9AP Well done team👍👌 https://t.co/2DEr4ZYrQy Hala Madrid 👍👌 https://t.co/B0ITdX99FD 🏡😎☀️ https://t.co/mCrtBvFoxg @CR7underwear shoot in 360! New designs and styles are on https://t.co/6wNnolthcq 😄 https://t.co/7fCH5U1hM9 👌👌👌 https://t.co/hpJWIik14h 👍 https://t.co/bcFdNf7mdG Have you seen the new update of @cr7selfie? Now you can have a selfie with me and the Ballon D’or!\nTry it now ✌📸 #CR7Selfie #FanWithACause https://t.co/ob8y6i4W62 Having some fun on the set of my latest @CR7underwear​ campaign! Check it out! https://t.co/6wNnolthcq https://t.co/lNnMojMGRt It's all about the detail! My new @CR7underwear collection and campaign launches TODAY! https://t.co/6wNnolthcq https://t.co/tAKSLDYStg 👌 https://t.co/gzlcO1V17Q 🎂🥂❤️ https://t.co/aSC6yzTCGu You got La Silver? I got La Gold. Want to argue? 😎 #am97 #gold @nikesportswear https://t.co/NjNm85vRtb Be serious 😉😉😉 https://t.co/PAdN41bKni Discover #CristianoRonaldo Collection and amazing outfits at https://t.co/1CsLgLj3SD and complete a remarkable moment! https://t.co/oLBb7Gpy72 Shooting day👌 https://t.co/XKePdXWTej 👀 https://t.co/VAXIyw5PKh Crash and burn @DwyaneWade ⚽💯 #raiseit https://t.co/i6J4wmrc1W https://t.co/7cF5gQyj6o ⚽️ https://t.co/J3jFzvAgpS NEW HIGHSCORE! Can you beat me? Show me your skills and reply with your highscore.\nhttps://t.co/RX5FZclXci https://t.co/C3e694R8RD This Valentine’s Day give to your loved ones my ultimate comfort #CR7blankets. Save 15% with promo code: LOVECR7 at https://t.co/WqPNjsr1CE https://t.co/2sFAnxlXKN Thanks for the support of Chinese fans. Glad to be the 懂球帝(All Football) 2016 best player. https://t.co/O5FEQYouyh My team👌👌👌 https://t.co/sj9MPXaY2s I can rise to any challenge @DwyaneWade gives me. Tell him who you think won? #raiseit 💯😂 https://t.co/i6J4wmrc1W https://t.co/XsVX8MuPgV Mood https://t.co/ztacb0nRZ9 The Best FIFA 2016 award is already available in my Museu CR7  👌🔝 https://t.co/NV3migfivA Driving into 2017, another dream year ahead #DontCrackUnderPressure #tagheuer @TAGHeuer https://t.co/qdJhemKIK5 I was looking for the fans, because you supporting me every day,since day one. The trophy it's yours too. Thank your very much❤️️❤️️❤️️ https://t.co/EjgSAWdXMe Guess where my eyes looking??? I let you know later 👍 https://t.co/Z6AGgcT9sz @DwyaneWade . No. Watch. Learn, #raiseit Ronaldo style. I think I’ve got him, do you agree? 🍳 https://t.co/i6J4wmrc1W https://t.co/Jbfegn0VFj 👌🔝 https://t.co/gCCBydN0gy Thanks @turktelekom You don’t lift the trophy for best player in the world without your team. #JustDoIt https://t.co/f0KxUSVK3H Delighted to win The Best FIFA award. Wouldn't be possible without my teammates, coaches and you who support me every day. Thanks everyone! https://t.co/1E1VkaYbTu 😍 https://t.co/APmw3eag8Q Thank you all for this amazing celebration!👏👍 https://t.co/RW2naSBnxu Honoured to wear my CR7 #Mercurial Vitórias boots today 🙌 🏆\n@nikefootball https://t.co/i3S8J2ITXc Happy to be in the https://t.co/7YiIciMNZj Team of the Year for the 11th time! Thanks to all the fans who voted! #TOTY https://t.co/k7iWSDtQh8 🏃🏼 https://t.co/KDV3BFRDgD Desejo a todos o melhor do mundo em 2017. Bom ano! \nI wish you all the best in the world in 2017! Happy New Year. https://t.co/mgUxVfEFRa Silky smooth in time for the New Year &amp; I’m not talking about the shave @DwyaneWade 😂 #raiseit \nhttps://t.co/i6J4wmrc1W https://t.co/w4vqgzV2GK The end of the year is approaching. Which @TAGHeuer timepiece should I choose? Sporty or elegant? #DontCrackUnderPressure https://t.co/xuwm2ErjYo Hoy en la Gala Inocente Inocente podréis ver mi visita a un proyecto de esta Fundación que ayuda a los niños que más lo necesitan. https://t.co/YvJ8fGCQvB To celebrate the end of 2016, @TAGHeuer asked me to prove how I didn't crack under pressure. https://t.co/9Yy3eP432B The most amazing fireworks will be seen at the top of @PestanaCR7 Funchal.\nDon’t miss it 😉 https://t.co/LpodJXzdyF https://t.co/kmsa0y0XlJ 👍 https://t.co/mybcWttqIy Merry Christmas world ❤️❤️❤️ https://t.co/fCzCJ8s8f9 A message of hope to the children affected by the conflict in Syria. @SavetheChildren https://t.co/Zsdvu2nuXd Just unboxed my new gift from @TAGHeuer . A unique Tourbillon watch full of diamonds, especially for me. Thank you to my friend @jcbiver https://t.co/2JHXjG2OcS Just received a gift from #CLEARMEN. Merry Christmas! https://t.co/nNwA36ArUv Breakfast time in my spot👍👍👍🇵🇹 https://t.co/UKNVZROzYn NEW update for my mobile game! Major improvements and amazing new boosters. Play against real players!\nDownload: https://t.co/RX5FZclXci https://t.co/eclkYVE4fe Spending time with my love 😍 https://t.co/FkRlPfF2bn Moments 👍 https://t.co/F04NBAbFaG Getting into the spirit of the season with Sacoor Brothers! Shop https://t.co/1CsLgLj3SD for the best styles for you and your gift list! https://t.co/1h0nnm34GT Happy with my new project CR7 Crunch Fitness in Madrid. Live Life Fit, take a look https://t.co/OhWkH0bTZu https://t.co/uRHrCIL7yh After so much demand,I've decided to open the doors to my online The Private Edition members club for the next week! https://t.co/XlG0HcBH6s https://t.co/un2YiW9cdv 🇵🇹 https://t.co/UUpoigCfbp Simmmm. Happy to win another 🏆 trophy. Well done team. Hala Madrid https://t.co/Gqn6zoPMFT Thank you @jcbiver and @tagheuer for your kind words and the great presents ! #dontcrackunderpressure https://t.co/Q1dcEdOVFa @DwyaneWade, Happy Holidays. This one is just for you ⛄🙌🏆#raiseit https://t.co/i6J4wmrc1W https://t.co/BfO0W0jTqg Want to see exclusive footage and unreleased images from The Private Edition photoshoot? https://t.co/KLGGg0yU8I https://t.co/TmRe6Xmnso My golden ball it's available in my museum in Madeira👍👍👍👍⚽️ https://t.co/jPZx9fh2NN I'm now in Japan for next important title. #Sixpad, always helps me to perform my best. Get yours. Check https://t.co/gBjidb3uY3 https://t.co/cI4u1gTarJ So happy and glad to win. Thanks Real Madrid and Portugal National team.amazing year. Simmmmmmm💪🏽💪🏽💪🏽💪🏽 https://t.co/IQCxOA5PLg Last chance to order my CR blankets for Christmas! Save 25% with promo code CRIS. https://t.co/wUzQqzllGd https://t.co/QIWOliTCLH Had a lot of fun creating The Private Edition scent. Watch here!https://t.co/KLGGg0yU8I https://t.co/hvTMyo2ohc Parabéns à Fundación Numen e à Fundación Inocente Inocente pelo magnífico trabalho que fazem no apoio a estas crianças. https://t.co/uUJjYut1KS Flip on the first try, @DwyaneWade. Don’t start what you can’t finish. 💯😂 #raiseit https://t.co/i6J4wmrc1W https://t.co/8xKfQJbWfC UCL👍 https://t.co/FxFVlo1rdY Want to see me create the packaging for The Private Edition?  https://t.co/XlG0HcBH6s https://t.co/w4xBPFfdzk Feliz por estar entre os melhores da FIFA junto dos meus dois treinadores. Obrigado a quem votou em mim e sobretudo aos meus companheiros It’s almost time! ⏰ ⚽ See how I spent yesterday preparing for the fastest match on 🌎 #StrikeSeries... https://t.co/oI605XnILm Wanna save big on my CR7 blankets this Christmas? Shop https://t.co/IBoUpzdSOB to save 25% with promo code CHRISTMAS. Merry Christmas! https://t.co/fhRinrZ29e Missed Tuesday’s training? Here’s a ⚡ FAST⚡ video recap of Day 2️⃣️ #StrikeSeries 🔎👉... https://t.co/vnA5MqY1E0 To celebrate the launch of my new fragrance, I have created my own online members club! https://t.co/HRDxfKfjeN Very excited to launch my brand new fragrance tomorrow \nhttps://t.co/KLGGg0yU8I https://t.co/4nLKMRJuZT Equipa vencedora 🔝👌👍 https://t.co/T8fnmIECmV ✅Day 1 complete. Here’s how I trained fast for El Clásico today ⚡ #StrikeSeries 🔎👉https://t.co/E2zLOUXhGE @nikefootball https://t.co/1NdFtdCvOn 3 points 🔝👌 https://t.co/mJbTWgPVOD 👌 https://t.co/RoyleNCHk6 Happy morning 👍👍👍 https://t.co/W4dCYspQ7I Open your eyes @DwyaneWade - this is how I wake up 🙈 #raiseit\n\nhttps://t.co/i6J4wmrc1W https://t.co/QIAujMQnW6 👌 https://t.co/xgALmBVkCr Honoured to debut my boots back where it all started. 🙌 CR7 Discovery 👉 https://t.co/E2zLOUFGP6\r    https://t.co/R8bOUQ4SwF Inspired by the match that changed my career. 🙌\nExcited to wear my new boots tomorrow https://t.co/E2zLOUFGP6\n#Mercurial https://t.co/hzLEYLrGs6 Men’s daily essentials #CLEARMEN #Mercurial #Ad https://t.co/Pu8cITRAaL Stretching boy👍 https://t.co/0tsFbOGsnW Top👍well done team⚽️⚽️⚽️ https://t.co/SM7Vc5ZZfC 😁😁😁😁 https://t.co/pXXUzVe1rQ 💪🏽🔝 https://t.co/xXlPZyVwQQ Always working. 💪 Fresh Trainers. Gear up for the gym on https://t.co/E2zLOUFGP6 https://t.co/0GESo32QOn Unleashed my inner lion while filming with @PokerStars 🔥💪 #BeatTheClock https://t.co/WzqNSGqm7Y 🇵🇹🇵🇹🇵🇹🇵🇹 https://t.co/RhlH9ZxjXg 🆕🔝 Love my new Collection 😉 https://t.co/E2zLOUFGP6 https://t.co/l1WsRrCjyC Target practice 🎯 #Mercurial\nCR7 Chapter 3, lace up at https://t.co/E2zLOUFGP6 https://t.co/m9p4aDrltN Glad to make your wishes come true!👏👍 https://t.co/5JkLUGlRQZ No substitute for hard work 👍 #StrikeSeries CR7 Chapter 3 Collection at https://t.co/E2zLOUFGP6 https://t.co/qQAVw0sjWQ NIKE MAN🔝👍👌 https://t.co/L3fBScHpST 🇵🇹 https://t.co/JrxbaIuE4A Just found the next generation of Fast in Lisbon! #StrikeSeries 🔎⚽🏃💨 https://t.co/HVtyY4tLt2 Back in Lisbon leading a @nikefootball masterclass with the future of Fast. Watch out for these guys! 👀➡🏆 #Mercurial https://t.co/ru0cajXFc9 The Man🔝 https://t.co/kkju3p7xMf My sports cars just got jealous 🏎💥 #Mercurial\nNew wheels at https://t.co/E2zLOUFGP6 https://t.co/iByj6yiN9i New wheels, same results. 💯👌 #Mercurial\nNew boots 👀 👉 https://t.co/E2zLOUFGP6 https://t.co/tgSIWDQU2z Es un honor recibir nuevamente el trofeo Alfredo di Stefano. Gracias a todos! 👍🔝 https://t.co/GBhSRqTddM @07RQuaresma We're even for now...😉😜CR7 \"Discovery\" just got a whole new meaning. Nice one bro! #Mercurial https://t.co/Oq9Jfhg6pW You were behind this too!!?? Can't believe you guys did this behind my back!!! 😂😂👌🏼👍🏼🔝 @07RQuaresma https://t.co/iqf28Yrg92 😍 Love my new #Mercurial boots.\n🔎CR7 Chapter3: Discovery 🔍\n👀👉🏼 https://t.co/E2zLOUFGP6 https://t.co/GITYWkrjgm Just came back from the tailor and my suit fits perfectly! Sacoor Brothers attention to detail is one reason why I am a huge fan! https://t.co/m97ZxY0o64 G morning 👍 https://t.co/hTsT0Gm5dU 👍🏼👌🏼 https://t.co/OHd7Hk1Hdu Check out my new @cr7footwear film FW16 Collection. I hope you enjoy it. https://t.co/H3tWJAxDrd https://t.co/kZTrNj6vRR Keep your head up!!! https://t.co/ILOmhsz6Qs UCL 👍🏼 https://t.co/cIxu4oQZc7 Spend the holidays with me! Visit https://t.co/CWhb9Do9DK to see my CR7 Christmas blankets! Super soft, save 15% with promo code CR7. https://t.co/FEDZynRAZH I hope you enjoy my new @Cr7Footwear FW16 Collection as much as I do. Check it at https://t.co/H3tWJAxDrd https://t.co/JRHaTLZZJr 😎👌👍 https://t.co/1FJnxpzMja Good night 👍😜 https://t.co/v9aHmCggSz Happy Halloween day🔝🔝👌 https://t.co/3mIbnIwyqd With my boy 🇵🇹🇵🇹👍 https://t.co/eibXMThX5Z Great win and very important 3 points. Well done boys !!⚽️⚽️⚽️🔝 https://t.co/Vv2NFO0rSt To stay fresh throughout a match, I use CLEAR #ad https://t.co/aIdEBHlbJ8 👌🏼 https://t.co/PO92dsRFPd Great dinner last night,discussing plans for the present and future 🔝🔝🔝🔝 https://t.co/Hrku3v0Vyg 💪 Extra effort.\n✅ Extra reward.\n🏆 #StrikeSeries\n\nSpeed up with @nikefootball’s Modern uniform of fast: https://t.co/vvAeu4R5vl https://t.co/nUpQqXhfYi Bom dia 👍 https://t.co/711qV8Ymg5 👍🏼 https://t.co/fHYfaD5UfZ Help me kick breast cancer.Visit https://t.co/CWhb9DFKvi save 15% with promo code Pink7 and Elite Team will donate to Breast Cancer Research https://t.co/OWMnokyvCd I’m so excited the Z11 has finally come to spain! My friends at  @nubiaSpain are giving one away, enter here: https://t.co/yqA6gex0qN https://t.co/I8hAda2s7X Thanks👍 https://t.co/2u9vEQLKRf Couldn't resist a quick game while filming something exciting for PokerStars... 👊🏼😎#raiseit https://t.co/d85deQIQUm Win an autographed #CR7MiniBlanket. Visit https://t.co/CWhb9DFKvi shop my exclusive line of CR7 blankets and enter to win today #CR7BLANKETS https://t.co/N12curv8wK Two games 6 points👍🏼 well done team 🇵🇹👌🏼 https://t.co/l09YCvUbk6 Morning walk 🚶🏽 https://t.co/5tWg5Qz9n2 It´s my turn to support my “team”! Help us make Madeira win World´s Leading Destination 2016. Vote here https://t.co/7411eshkCb https://t.co/Qw8WwsALBw Happy to score my first poker for Portugal\n⚽️⚽️⚽️⚽️🇵🇹 https://t.co/W8RxiW7BzR 👍🏼✌🏼️🇵🇹 https://t.co/ZiLnHpSkR8 Training👍🏼 https://t.co/9bCeZT8tdZ Want to watch me play a match live in Madrid? @Xtrade are giving you the chance to win this amazing trip! Enter now: https://t.co/5ewSmgCXCU https://t.co/2V8gOKgarH Glad to be the cover of @DSECTIONMAGAZINE 5th anniversary book. \"THE JOURNEY\". https://t.co/G0xoSNHW0u Wow! More than 5 million downloads of my mobile game! Thank you! \nDownload Kick'n'Run here for free: https://t.co/RX5FZclXci https://t.co/GQi7F2IhUC Winning team⚽️ https://t.co/bJanNLqcd3 I'm really excited to share with you the new #SACOORBROTHERS Fall Winter Collection! Meet my favorite new items at https://t.co/1KPALoFzcH https://t.co/oy99s93Ql3 👍🏼👍🏼 https://t.co/bZPvgDCfir 👍🏼 https://t.co/rduasWEUFD I'm good and you??👍🏼 https://t.co/lbkFB7x19a Great moment🇵🇹✌️👌 https://t.co/Jfi6zuvhLX Hala Madrid 🔝 https://t.co/mRTHes8WL5 👍🏼💪🏼🔝👌🏼✌🏼️ https://t.co/xTSlEFJT8H CHAMPIONS LEAGUE TONIGHT 👍 https://t.co/NWvp7DZoht Did you try this awesome feature in my mobile game? Download here: https://t.co/RX5FZclXci https://t.co/acIYYulgmr ❤️❤️ https://t.co/S0Rfg2lUlN Always nice to be with the fans ✌🏼️👍🏼🔝👌🏼 https://t.co/ZzdwEQxjXC Great to be back to full team training!💪⚽ 🏃💨\nTrain fast with @nikefootball’s Strike Series: https://t.co/nWQxOQOOQw https://t.co/Ju7T1DTub7 Step into the spotlight with my latest @CR7Underwear collection 👍🏼 https://t.co/I5ZfBQGnP7 First training with the team, very happy!!!! Enjoy the picture ❤️💪🏼👍✌🏼️⚽️ https://t.co/FFGEgqSK4A V D ☀️ https://t.co/vOsfUPwP9U Thanks @TAGHEUER @jcbiver for this kind gift. The new rose gold Heuer 01 is amazing #dontcrackunderpressure https://t.co/KfCHbrk8ip Soon 👍🏼 https://t.co/w6Q4JitA1B @nubiasmartphone’s Z11 doesn’t believe in limitations. #DreamWithoutBoundaries https://t.co/uEWDTJQxBW https://t.co/3Ga0gQaffL Happy ☀️👍🏼 https://t.co/zfmXj0C7jB Selfie time👍🏼 https://t.co/isLQGcDDv2 👌🏼👍🏼 https://t.co/0dAozzcX05 Mood 👍 https://t.co/tf9H7qNru4 Training done with my boys 💪🏽💪🏽☀️ https://t.co/GoWyE1w8eP Feeling good 👍 lets go 💪🏼 https://t.co/rn989lwS7B Training fast to come back stronger with the @nikefootball Strike Series. 💪🏽 https://t.co/T2ZbV9jopr https://t.co/SZdRNTz5bq Gracias equipo 🔝👍🏼 https://t.co/iJv541BI9U Very happy and proud to win such a special award. Thank you to my team mates from Real Madrid and Portugal! ✌🏼️🔝👍🏼 https://t.co/vR61LXyW9o Enjoying being back in training in my latest gear. \nGet the @NikeFootball Strike Series: https://t.co/vvAeu4R5vl https://t.co/wlZy0ZBq0z Not ready to let this summer go yet? Check out my summer looks at https://t.co/1KPALoFzcH #SacoorBrothers https://t.co/pRsnImUnDd I train fast to play fast. Thanks @niketraining for the new Nike Train Ultrafast Flyknit (https://t.co/3pz5B5KUfK)💪🏽 https://t.co/5xAnlBoQPJ ✌🏼️ https://t.co/7j4zb9dbS4 Another shot from my latest @CR7Underwear campaign! Check the range out on https://t.co/JWC1WlVn9L https://t.co/vEVZwHLV4h Mood 😏 https://t.co/5rHcea126c Poker at home while watching the action in Brazil…two great games on the go! https://t.co/46xaDGwHob Congratulations my friend @usainbolt for your triple gold!👏💪 https://t.co/5lQN06zvVo Madeira Island is pretty awesome, don’t you think guys?\n#madeiraislands #exploremadeira #visitmadeira #madeiraisgold https://t.co/Ta4klg4MDZ Time to focus on the new season with my @TAGHeuer timepiece. #DontCrackUnderPressure https://t.co/UADztr92bA The smartphone of champions will land @IFA_Berlin on Aug 31st! https://t.co/uEWDTJyWKo #WhatsNU @nubiasmartphone https://t.co/OA5eXMzuC3 Stepping into the spotlight for @CR7underwear FW16 Now available on https://t.co/ZzX6Gr9cXc #CR7Underwear https://t.co/lQeobeOTh5 Morning run 👍🏼 https://t.co/YaqjLFdJce Paz ☀️✌🏼️👌🏼 https://t.co/D9DL17P12d 💪🏼 https://t.co/Er7BBHjxVS 👍🏼 https://t.co/SePB93VwrL In the spotlight for my latest @CR7Underwear campaign. Check out new styles on https://t.co/ZzX6Gr9cXc #CR7Underwear https://t.co/MtqHV2wP6N Faz já um mês...recordação muito feliz! Dois grandes homens! https://t.co/oe4isqXtfK https://t.co/LKgeKYHf6Q Champions. https://t.co/gQdDJgWu4q Not in the field but always with you! Good luck guys ! #halamadrid 💪🏼 https://t.co/7vy0svAvKk Have a selfie with me.✌️ Check out my new CR7 Selfie - Fans with a Cause App #CR7SelfieApp \nhttps://t.co/ejlaJoim0c https://t.co/psMKasyDKm Solid work 👌🏼 https://t.co/4SNlY7suPY Wake up after a great nap with crj✌🏼👍🏼🔝 https://t.co/XpAyGZZeVr Ice cream time ☀️👌🏼 https://t.co/EODfUnMF51 My baby miss me❤️ https://t.co/WNkUjDWwRY Quick remind 🇵🇹🔝 https://t.co/XLGD78aoZy Are you ready to spend some time with me?👍📸 I have great news coming your way. Stay tuned! Coming on 9th August https://t.co/fwyBUnrT8A ☀️😎 https://t.co/ry0b1A9JiW Good morning gym 💪🏼 https://t.co/GxGmBHxzS3 Lunch time 👍🏼👌🏼 https://t.co/iPAJitxQAI I’ve joined a new team, Elite Team. Visit https://t.co/CWhb9Do9DK to see my exclusive luxury blankets. https://t.co/JEDtZBmfGz A TRUE CHAMPION chooses #CLEARMEN. #TRUECHAMPION #POWERHAIR #CLEARNODANDRUFF ⚽️👍🏼🏆 https://t.co/1Ty40KZrEv Thanks Madeira 👍🏼 https://t.co/MMuXLQsHan I will be back ☀️🔝👌🏼✌🏼️ https://t.co/eqWfPp50Mu On the field, I need the right tools to win. Online trading is no different, I chose @XTrade https://t.co/47gPpaVh6y https://t.co/uZVprIIkaH Check out our power moves! Stay fresh with #CLEARMEN. #TRUECHAMPION #CLEARNODANDRUFF #CLEARPOWERMOVE https://t.co/GPwjfpmJKd My mobile game is moving to Rio de Janeiro with the awesome new update available now 📲 https://t.co/RX5FZclXci https://t.co/hX82md83WI ☀️ https://t.co/2UtD6aSq86 Spend time with my little man 💋❤️👌🏼🔝 https://t.co/3Z16m343WV ☀️ https://t.co/O8eaaY5dHj We dream, we fight, and we exceed. Remember how we #GoBeyond today and every day with ＠nubia #Euro2016 #Champion https://t.co/KM8Kb43wRk Lunch 👌🏼✌🏼️ https://t.co/yB0WCJ7k18 #Mercurial Superfly Portugal “Champions of Europe” by\n#NIKEiD. 😍👌🏼⚽🏆🇵🇹 https://t.co/qVWXKBYn05 When a team and a nation believe, anything is possible. #SparkBrilliance #justdoit https://t.co/yflLahlTEs Mood ❤️❤️ https://t.co/mjoSdnt7OE Wow 👀👀👀 https://t.co/nF6BJPZYJp History ❤️❤️ https://t.co/7FAK9kbWUC One moment can change everything. Never give up.\nMake them believe. ⚽🏆##SparkBrilliance #JustDoIt\nhttps://t.co/GcCLdJ4gFh 🏆✌🏼️🇵🇹 https://t.co/6Qvd9yKpUD Proud of my team. Proud of my country. Make them believe. #JustDoIt https://t.co/Zt2iqmDPZQ My boys ✌🏼️👍🏼 https://t.co/kMqwqKmF1Z Time to focus. Counting down the hours with my @TAGHeuer . See you on Sunday on the field. #dontcrackunderpressure https://t.co/8zbJ3HZqGQ 👍🏼 https://t.co/EbBExSnBZl 🙏🏼 https://t.co/PQDSTnRMHc Happy moments 👍🏼👌🏼 https://t.co/byRHX1Uh0j Keeping my mind sharp in between games #lovepoker https://t.co/a6nh7NkpE3 Mood 👌🏼 https://t.co/Ni0BtPRSwI 👍🏼🔝👌🏼✌️❤️ https://t.co/Z5OFpxAWdD When you believe you achieve ✌👍🔝⚽️ https://t.co/hmGmosOTLI Time to relax and bring out my @TAGHeuer Carrera to fuel me up before the big match!\n#DontCrackUnderPressure https://t.co/nnIsyqZp5q ✌🏼️g n https://t.co/ysybI0xHzQ 👍🏼 https://t.co/6bmhxfnsot Have you played my new game Cristiano Ronaldo: Kick'n'Run? It's pretty cool! Try it here: \nhttps://t.co/RX5FZclXci https://t.co/2yjtqsdodB ⚽️ https://t.co/KgiMaPnh2J ⚽️ https://t.co/DaWxFLGcmJ ⚽️ https://t.co/OxRXPl8sw1 ✌🏼️ https://t.co/BL40iwMvi0 Triste com o resultado mas sei que todos juntos vamos dar a volta por cima. 🇵🇹 https://t.co/AltYaxVDKp Mentally preparing for tomorrow’s match. Try Pro Genius in the @nikefootball App: \nhttps://t.co/00z9TNhPRA https://t.co/z2PlUsrfeZ Time to train, more games yet to come  #DontCrackUnderPressure @TAGHeuer https://t.co/AP4qb3brMR Hoje queremos levar para campo, não só a vontade de vencer de 11 mas a de todos os🇵🇹 . Contamos com o vosso apoio!⚽ https://t.co/YIfky7tbTp Soon 👍🏼 https://t.co/ExJEydXZ8a The game starts tomorrow. Mental preparation starts now. Train your brain with Pro Genius:... https://t.co/P7JeV1q7Vi ⚽️ https://t.co/W9qe0lE9Sy Dinner time with my boys 🔝👌🏼 https://t.co/Uua6AFUmkl Fuel up like me! Try 2 scoops #RebuildStrength, bananas, strawberries &amp; milk. #Herbalife24 https://t.co/Ya16F8551d https://t.co/klds6U1m4h I’m celebrating the Euro Cup kick-off with my new mobile game. ⚽️⚽️ \nPlay the game here: https://t.co/RX5FZclXci https://t.co/hrnu2EJaGG One moment can change everything. #SparkBrilliance.\n@nikefootball https://t.co/eO8m0eNOsW Great win tonight ✌🏼️🔝⚽️⚽️ https://t.co/gNzX74UY1f See what happens when two worlds collide. https://t.co/J5QtfbLOw5\n#SparkBrilliance \nWatch the film tomorrow: https://t.co/GzCcnRwwRp 👍🏼🔝👌🏼 https://t.co/RbzHo8zm8C Team 👌🏼 https://t.co/3GipMYSprh Seriously, what’s going on @nikefootball ? #SparkBrilliance\nSee the whole story on June 9: https://t.co/GzCcnRwwRp https://t.co/4Wbi4C4sgt I’m feeling a little different today…#SparkBrilliance\nDiscover what’s happened on June 9: https://t.co/GzCcnRwwRp https://t.co/0I1osiEaHy 👀🏃👀🏃💥 #SparkBrilliance\rSee the full story June 9 in the @nikefootball App:\rhttps://t.co/GzCcnRwwRp https://t.co/0Jgm7z9EaT I drive my training with proper hydration. Evolve your sports drink #CR7Drive @Herbalife @Herbalife24 https://t.co/t6BzLGySID I stay fresh with #CLEARMEN. Show your best tricks with #CLEARPOWERMOVE or upload at https://t.co/vnAjzdHqK8.” https://t.co/3u5pQPkty7 ☀️♻️👌🏼 https://t.co/kkcdteK5Wk Great night 👍🏼👌🏼🔝❤️ https://t.co/8fXXgf9VMF At my house, speed gets its own room. #sparkbrilliance\nGet the new #Mercurial now 📲: https://t.co/GzCcnRwwRp\nhttps://t.co/uLfw9kIeve Love you ❤️❤️❤️ https://t.co/qhMNOEK2HB Boom ✌🏼️👍🏼 https://t.co/kSJJEJQUd9 Check out my #Mercurial Speed Room 📽⚽️🏃🏽💨premiering in the @Nikefootball App https://t.co/GzCcnReVsP #sparkbrilli... https://t.co/RwyL4HhgLY One of my picks for the warm days ahead of us! Tassel loafers are a must have. Check it now https://t.co/Yu7rvgpkQf https://t.co/iXsRjcyANL 👍🏼 https://t.co/M3XwVS47Vq See the world's fastest #Mercurial collection. My new film premiers tomorrow. See it first: https://t.co/GzCcnRwwRp https://t.co/vXnfodGnh8 The Summer of Sport: Football Nouveau - OR x Nikelab.\nWith @olivierrousteing @dazed @nikelab 🏆🏆🏆⚽️⚽️⚽️ https://t.co/Dx0H6l8NpK The Summer of Sport: Football Nouveau - OR x Nikelab. With @olivierrousteing for @dazed #dreamteam 🏆🏆🏆⚽️⚽️⚽️ https://t.co/DOkqFab7JW 👍🏼 https://t.co/FZyzUjwSw4 Let me introduce the @SFR family!The children would do anything to please their parents! https://t.co/YJER5m94PH https://t.co/XED7AKuqpF Training https://t.co/YZfTzRtaJY Looking and feeling faster than ever. 👍🏼👊🏼💥\nGet the new #Mercurial first on May 28th 📲 https://t.co/GzCcnRwwRp https://t.co/DucG4bil7n ⚽️ https://t.co/U9sPN2N7Oz My new #Mercurial are fase as they look, trust me. 🏎💨💥\nGet them first, May 28th: https://t.co/GzCcnRwwRp https://t.co/ZP1Vo8wv1l Ready to play fast! Thanks @nikefootball ⚽🏃🏽💨💥\nGet the new #Mercurial first 📲: https://t.co/GzCcnReVsP https://t.co/RSXxPTTowp In my new commercial I'm in the central square of Tel-Aviv. Get ready neshamot it's gonna be HOT!\nhttps://t.co/9tVr2s37eC Always working hard! Caught on set wearing @Cr7Footwear | https://t.co/wNKi1a0bo4 https://t.co/KfSC1pxCAC Crushing the game on PokerStars. https://t.co/AKUYIhLj0H Another shooting day with the special visit of my friend Peter Lim. https://t.co/g5PPi1UhAI The time has come for you to meet us in #cr7footwears16 | https://t.co/Yu7rvgpkQf https://t.co/qHYLpUEviE In 2013 and 2014 Madeira was Europe’s Leading Island Destination!\nVote for Madeira hat-trick\nhttps://t.co/aWBxeHFjEh https://t.co/3Jl9vInyKW Unveiling one of my next 4 hotel projects with Pestana Hotel Group! #pestanahotels https://t.co/jpikU2rmR4 So proud to have my very own collection at the @SacoorBrosGL stores. Don’t miss it! https://t.co/30oqRYTPCg Funny moments practicing penalties with my son ⚽️👦🏽👍🏼 https://t.co/Y2DfSqkqer Great win today! ✌🏻️⚽️ Thanks for all your support! https://t.co/TCerW9EWtN Today is a special day: the launch of my  mom's book throughout Spain! https://t.co/gPHCBpfD2h Speed redefined #sanahizmiyok 🇹🇷 https://t.co/SMDHeuPRp7 Amazed with the sound of my new ROC Freedom headphones!!🎶👌🔝\n#livelifeloud https://t.co/1FIgyDYJnm I'm delighted to become the official ambassador of @XTrade . Join me! https://t.co/zjThlQN14M  #XTrade https://t.co/pAeI15Xs2f Grande jogo de toda a equipa. Vencemos juntos, celebramos juntos. @realmadrid #HalaMadrid #RMClasico ⚽😀💪🏽✌🏽️👊🏽 https://t.co/UXwghH7ACS Thanks @nikefootball getting me equipped for the match💎 ⚽👌\nYour pair is available now on https://t.co/vmUIWvypW2 https://t.co/GP9x3ufCnv No days off 💪🏽👍🏽\nGear up with my new CR7 Natural Diamond training apparel now on https://t.co/wlbJl57EHq https://t.co/l4l7gz9ctM Do you remember? Last month, @SFR surprised me.Well, it happened again, the experience was amazing! #CristianoAndSFR https://t.co/M89vkGLonp Back home with my boys 👍🏼👌🏼🔝😜✈️ https://t.co/UFUvbEIQNR ⚽️ https://t.co/KUZ75sS4r6 Great win 👍🏼✌🏼️🔝⚽️ https://t.co/Qw1cN5YUEJ ⚽️👌🏽 https://t.co/owC28LM5MV #ronaldoyahizlazim ✈️🇹🇷             https://t.co/bXRI5tuRq2 The only person better than me at my own game is Cristiano Junior!\nDownload it for free here:https://t.co/0KJXfey8vw https://t.co/6SxIz68JR8 Working out to recover for the next challenge! 💪🏽✌🏽️🇵🇹 https://t.co/5xXHrhHoX1 Delighted to wear these!☝⚽\nGet exclusive @nikefootball product in the Nike Football App! https://t.co/tXAjIBbTCZ https://t.co/u6ID0ug3BM Ready for tomorrow 🔝⚽️👌🏽👍🏽✌🏽 https://t.co/5aQboSw0pJ Great to be with my Portuguese NT team mates! https://t.co/ZoVDMDeTKe 💪🏼 https://t.co/WfT2Ae3YRH Talking about fashion 🙂😉 https://t.co/VW7LIqGFDi Think I'm bluffing? 😇😉 https://t.co/FHeZlu2Alr Get my #Mercurial Natural Diamond boots in the Nike Football App today! 💎 💪  https://t.co/tXAjIBbTCZ https://t.co/FXhzdkHlXL Happy Father's Day to all daddy's in the world❤️❤️❤️ https://t.co/tnsJWjgOwW Work hard to achieve success 💎💪The boots will be available tomorrow in the Nike Ftbl App 📲 https://t.co/zajXPa5tRs https://t.co/i5kTzYIqOT Can’t wait to lace up my new boots! 💎 💎 Thanks @nikefootball . Get your boots March 20th 📲\nhttps://t.co/tXAjIBbTCZ https://t.co/c814Hx5c6a Engineered Speed.Novo Equipamento Principal de Portugal 2016. #SparkBrilliance\nhttps://t.co/EXv32Ajrei @nikefootball https://t.co/BE8uqGgjAl Wow! Thanks @Nike for letting me be the first athlete trying the new HyperAdapt 1.0 #nike2016 #nikeinnovation https://t.co/RVWZgJjkqf Live Life Loud ‼️♻️☀️ https://t.co/n8RVVN2dSO Arriving to my home island #Madeira on a cruise ship is unique!\n#madeiraislands #exploremadeira #madeiraisgold https://t.co/avHsWxX1Fj #SaveSyriasChildren like 5 yr old Ayman* who loves playing football like Cristiano Junior. https://t.co/2h933AMEse https://t.co/aMq6LOnYay ⚽️ https://t.co/sR3McYQCAp POWERING THROUGH THANKS TO #CLEARMEN @ https://t.co/uDo5FLBx0i #POWERHAIR #MADEFORMEN, WHAT’S BEHIND YOUR POWER?💪🏽⚽️ https://t.co/ZZF1vgdUT7 ❤️ love ❤️ https://t.co/Aau5DDxtfa Want to see what it's like to be me? My new video with @RocByRonaldo comes out March 14th! https://t.co/fEV1YNXtCf Excited for the new and #fresh #cr7footwear collection that drops today! Check https://t.co/Yu7rvgpkQf https://t.co/uqBBvrFhZD Exclusively at #WorldDutyFreeES, my new fragrance #CristianoRonaldoLegacy https://t.co/U3MPBAErD3 Training our accuracy ⚽️👦🏽❤️ https://t.co/KKmplMKi1L Mom I wish you a beautiful International Women's Day ❤👸🏼😘 https://t.co/8qbByZySzC ✌🏼✌🏼✌🏼 https://t.co/Ou0wrP0GCO 35⚽️'s 👍🏼👌🏼 https://t.co/gXXlK6cQ4C Proud of the great performance in today's match. Thanks for your continuous support. #halamadrid https://t.co/SyfzoutIq6 Hair cut 👍🏼👌🏼 https://t.co/K6OYZNYR0w 👍🏼⚽️👌🏼 https://t.co/73opdxC3gZ Here with friends from #WorldDutyFreeES, celebrating my new fragrance #CristianoRonaldoLegacy at Madrid airport! https://t.co/D1SVxYcab7 Good win ⚽️👍🏼\nLevante 1 - Real Madrid 3 https://t.co/yL9HeinW2h Future ❤️💋👌🏼⚽️👍🏼 https://t.co/aqHmSstejm 💪🏽❤️🔝 https://t.co/Gr10eHyn8I ⚽️👍 https://t.co/rCowJ7ooh0 https://t.co/6ZoktsX6FA 5️⃣⚽️.⚽️⚽️⚽️⚽️⚽️⚽️‼️🔝👌\nThank you guys!! 😘❤️ https://t.co/2un60wufLH Mood❤️ https://t.co/Kp7sd1bm61 👍⚽️✌️ https://t.co/tWz9mxmKBK Fun poker game 👊♠ https://t.co/tgiSlppXtN Funny moments with my friend Ricardo answering this 2nd part of the Q&amp;A. Hope you enjoy it!😊 https://t.co/siKpahJsVl Really proud to be the 1st athlete with 200 million social media followers. A big thank you to all my fans! ❤️👌😘🔝😍😻💋 https://t.co/YGI3jvCu3X Training hard with my everyday partner 👍☀👌✌⚽❤☀ #ClearNoDandruff #NothingToHide #PowerHair https://t.co/ppIbAPLCp8 Be the first to try the new @SacoorBrosGL Spring/Summer Collection. Now in a boutique near you! https://t.co/0LQ7vVD3GJ Have you played my very own mobile game? A new exciting update is available now! \nPlay here: https://t.co/0KJXfey8vw https://t.co/FW1WWY1FyB I had lot's of fun answering this Q&amp;A with my friend Ricardo. Hope you enjoy it! https://t.co/hsQEnCMy2K Our bodies are a blank canvas and underwear is the first thing we put on. Add a splash of colour with #CR7Underwear https://t.co/rtaLStCsXL I loved this photo shooting! Here's a sneak peek of the new @SacoorBrosGL Spring/Summer Collection. Coming soon! https://t.co/N4L2ASgxQu Great win! 👍🏼👌🏼✌🏼 https://t.co/uskZ84qWeV Such a fun day shooting my Colour Splash campaign for @CR7underwear #CR7Underwear https://t.co/YxyRae4aX6 There are rumors that I'm going to be a star in Israel. Not in soccer... In a HOT commercial https://t.co/1wkz4vHgB2 Here is the winner of my Home Game Competition. Check out the other winners. @PokerStars https://t.co/Ig442KcQ97 https://t.co/PB6OeG9wGb My third Pichichi award! Proud to be the best scorer of La Liga. Thank you all. https://t.co/94tD8dBuHa Thank you for your happy birthday messages! 🎂👍3️⃣1️⃣😍❤️😘 https://t.co/PYjSdKHUiL Obrigado a todos pelas mensagens de parabéns no meu 31° aniversário! https://t.co/jFBvpAMnmj Watch my last ad for @SFR, the experience was amazing! #CristianoAndSFR\nhttps://t.co/fjt8zMKJAE .@Herbalife gave me the opportunity to create my sports drink #CR7Drive:enhanced hydration to drive your lifestyle. https://t.co/KEZqjaoNDU I have recently been surprised by @SFR. Can you find out how ? #CristianoAndSFR https://t.co/g9Hgk5uwvG https://t.co/GU5zMhaFJC Guess where I spend 20% of my day? Find out! https://t.co/eAzFGXdoRk Una mordidita en tu boquita‼️🎤😂🔝👌\nhttps://t.co/ej3ACRlaxp It was great to shoot with you @AngelAlessandra! https://t.co/PG3Kz1ATgu Your favourite keyboard is now available for iOS. Download it here: https://t.co/Jb8VBd8eFc https://t.co/4j9NRPJgSV This amazing journey in football started when I was just eleven years old. https://t.co/r0RsybkFcR I wish I was in my #Madeira now, 21ºC of temperature in January!\nMadeira, the Worlds’s Leading Island Destination. https://t.co/iDsXoqETJf Feeling fortunate to receive the @tagheuer Connected with the watch-face designed by my son! #dontcrackunderpressure\nhttps://t.co/hg8ydZeRlo Most kids in Haiti don't make it past 5th grade. Let’s help them having a future. https://t.co/nOH9OToF7P https://t.co/5hCHrFYL84 Wonderful team! 🔝👌⚽️👍 https://t.co/o02KmJr76b Happy to be a winner of FIFA FifPro world XI award 2015! #BallondOr https://t.co/Wy16RcEHnb Press talk before the #BallondOr ceremony https://t.co/15936rRGA7 Arrived in Zurich for the #BallondOr https://t.co/vKQKdDwVGl Going to Zurich for the #BallondOr day! https://t.co/2ykMNMw1rs What better way to spend time than to shoot some balls with my son?\n\n  https://t.co/mHNdN1IBio Feliz dia de reyes!! https://t.co/VCcnXFuqNS Don’t let this Winter pass you by without trying on the magnificent #Heritage Collection by @SacoorBrosGL https://t.co/Vmv9yN6SeI Excited to wear my special edition #Mercurial 324K Gold Boots tonight! 🏆⚽👌\nAvailable Jan 7: https://t.co/tXAjIBbTCZ https://t.co/B8pKQg239D Have you ever wonder who my childhood idols were? Check out. https://t.co/cUuj9wArtZ The only gift in life is love. Always choose love! Happy New Year to you all from yours truly. https://t.co/4hcD3jdgjt https://t.co/P52zRxjSR9 My CR7 Keyboard has new looks. Do you like them? Download the keyboard now here: https://t.co/8gBEskPNEo https://t.co/QM0MgDY7nd Curious to see my house in Madrid? Take a look! Merry Christmas to all!  https://t.co/f4Oor4pwl7 Take a sneak peak behind the scenes on the set of my fragrance ad #CristianoRonaldoLegacy.\nhttps://t.co/TPnubQNISy I love this photo from FW15 campaign, with these awesome boots from the @Cr7Footwear collection. Merry Christmas! https://t.co/txlqrTU4VL Happy to partner with @PestanaHotels! https://t.co/3o0cIBeVt3 Today I partner with @PestanaHotels for the construction of 4 new hotels. It’s a dream come true! #TimeOfYourLife https://t.co/gogBP6tEyW Share your poker home game for a chance to win a @PokerStars CR7 chip set. Upload pic here: https://t.co/33QaGPLFvV https://t.co/r9EDbnuiIz Spending great time with my bros!! 👌🔝✌️ https://t.co/Fbka4D6XOC This #Christmas you can offer a bit of Portugal from the amazing @SacoorBrosGL #Heritage Collection. https://t.co/aA4qCfUbGa Thank you team for the nice gift #CristianoRonaldoLegacy https://t.co/f9r7DwFE9V Want to win a pair of signed @CR7Footwear shoes for Christmas? Go to https://t.co/1Kf4ETWksG!\nhttps://t.co/PaQo29SwFf My @RonaldoFilm - the perfect present for friends &amp; family this Christmas. #Unmissable https://t.co/rsToTGtrgg https://t.co/2JEVEACc8M One of my favourite pieces from the X-mas collection. Check out https://t.co/RCLtRbCAT7 to see all of our new styles https://t.co/OUrJezzzpJ You can now search the web trough my CR7 Keyboard. Download it here: https://t.co/8gBEskPNEo https://t.co/d22qLNnQqo Check out the behind the scenes of my FW15 @CR7Footwear campaign! https://t.co/H3tWJAPeiL\nhttps://t.co/NGXtw8nol9 Here’s an exclusive video with my #CR7shirts X-mas collection! Love it - check it out now on https://t.co/VUOf12haeR\nhttps://t.co/OYm1u7cxik Whenever visiting #Madeira, don’t miss a visit to Funchal Marketplace “Mercado dos Lavradores” #visitmadeira https://t.co/QDxiGDfBju Round of sixteen! Here we go #realmadrid https://t.co/onW6SY5VjT Starting to read the book of my friend Jose Semedo. https://t.co/yMEP1Snr2O Drive your active lifestyle with my new sports drink #CR7Drive from @Herbalife. https://t.co/vqJiKWeIa9 https://t.co/D9Q66btzM3 My CR7 keyboard got more than 500.000 downloads in less than 3 months! Download it for free: https://t.co/8gBEskPNEo https://t.co/B9Ftyt0p2B I can't be indifferent to the horror of the Paris attacks. My thoughts go to the victims &amp; families. #prayers4paris https://t.co/6RxwdVTpOi Signed the new Free Mercurial Superfly inspired by my home. Arrives today at https://t.co/zajXPa5tRs. #nikefc https://t.co/wRRi9cLusD I'm joining @SacoorBrosGL for the celebration of their 25th anniversary! #Heritage is a must see collection! https://t.co/xbeF4oLs2r Hey @Tuurryy impressive play with the @Nikefootball App! These are on their way to you! 😎👍 https://t.co/tXAjIBbTCZ https://t.co/jrYaqKFzlm Great work playing with the @Nikefootball App, @Dgarciachino20. Look for these in the post! https://t.co/tXAjIBbTCZ https://t.co/xtIB5cuuCN It was great meeting you Devante! Congratulations for your play in the @Nikefootball App: https://t.co/tXAjIBbTCZ https://t.co/fg1zcMg7J4 Ronaldo film is out now! I have #nothingtohide thanks to @clearhair https://t.co/obDE5AzLO1 Great night! It's wonderful to share this moment with so great people. @RonaldoFilm turned out amazing.#ronaldofilm https://t.co/AoahImsuOq Today is a very exciting day,the Premiere of @RonaldoFilm.Looking forward for tonight! #ronaldofilm\nWatch the video: https://t.co/MjSh0LYktQ If you’re in London come down to Leicester Square at 5pm this evening and say Hi! #ronaldofilm https://t.co/WBBXVaXKD0 Today is the day. I'm here in London and my film Ronaldo will be revealed to the world tonight! #ronaldofilm https://t.co/kviuwptnaj First session in my new CR7 Madeira edition free TR 3.0. Available now in Europe on https://t.co/BUc6P8570G https://t.co/abXMw2YE38 I'm excited to talk to you about @ronaldofilm that releases Monday, Nov 9 #ronaldofilm \nhttps://t.co/UcPJ7bMXq2 https://t.co/37dFhXPjzn Injuries are a part of an athlete life. Having people you love by your side is important to recover. @Ronaldofilm\nhttps://t.co/UCz0vkjuu4 My birthday is a great reason to join family and friends.Take a peek at my last birthday party in @Ronaldofilm.\nhttps://t.co/EHYZFcqlqY All the warmth and coverage I need this season. https://t.co/KoDSsJHzlI #techpack https://t.co/TIwpYrHYGN Join me and watch the film in cinemas on Monday 9th . Visit https://t.co/rsToTGbPRG for details. #ronaldofilm\nhttps://t.co/Kznv1Cug12 Well done team!! 👏⚽️\nEnhorabuena Nacho!! 🔝👌 https://t.co/lS5MN0MQWI Get out and play games with the @nikefootball App for a chance to meet me!🎁👊🏼 https://t.co/tXAjIBbTCZ https://t.co/xGJr4g45nb Donate to help me build kids sports programs &amp; you could meet me at Real Madrid v. Barça. https://t.co/beGMnoVLvB https://t.co/e3UMg9sc0w Ready to turn up the heat! 🌋 Available Oct. 29th, exclusively in the @Nikefootball App: https://t.co/tXAjIAUiep\nhttps://t.co/3PFtWQyf42 Inspired by my homeland of Madeira 👍🌋 Available exclusively in the @nikefootball App Oct. 29:https://t.co/tXAjIBbTCZ https://t.co/LoxzwEFyWS Here it is! FW15 @cr7footwear campaign. Check out my new styles on https://t.co/H3tWJAxDrd https://t.co/QfTyACkvWf Playing poker with my friend Ricardo https://t.co/EahcAxdJ0m Do you want one of my signed jerseys? 5 people in the next 48 hours will win! ⚽🏃 ENTER: https://t.co/beGMnpdmn9\nhttps://t.co/PoLaho6H4B .@RocByRonaldo is now available in France. Check @RocByRonaldo for more info. Pre-order @RonaldoFilm with bonus content on DVD,Blu-ray or DigitalHD from Nov9 https://t.co/rsToTGtrgg #ronaldofilm https://t.co/wZC88CyJZd Having fun on set of my #CR7Shirts shoot! http://t.co/RwbrAO7iK5 http://t.co/8nTZ20ShFo With your help Madeira can become World’s Leading Island Destination 2015. Vote until Nov 8th – Follow the link:\nhttp://t.co/4GbYiqNwtT Thanks team mates and Real Madrid fans for this beautiful moment.  ❤️❤️❤️ http://t.co/X2g9ZNwBim Thanks @NikeFootball for the boots 🙌 honoured\nto be Madrid's top scorer.Want a pair? http://\nhttp://t.co/tXAjIBbTCZ http://t.co/rEJgPFHUkd Photoshoot with @AngelAlessandra for a special project. Great meeting her, a lot of fun. http://t.co/wzv2kBB4Zz http://t.co/pyWUUZvbVS Never too early to prepare for a season with warm fleece and breathable http://t.co/CA9dMrsXbN #techpack http://t.co/aGeKxcFa7L Want to join me when Real Madrid plays El Clasico? ✈⚽ ENTER: http://t.co/beGMnoVLvB and you can help a great cause. http://t.co/P4CNuR0lI3 See @RonaldoFilm in cinemas, or own it on DVD, Blu-ray and Digital HD from November 9 :) http://t.co/rsToTGbPRG\nhttps://t.co/n3RzsfYvQp Four Golden Boots! Very happy and proud with this achievement. \nhttp://t.co/6IDvWxeMLA http://t.co/CVUauqa7om What a special moment in my professional life! Winning four Golden Boots it’s a privilege... http://t.co/6rt7S1T0mm http://t.co/8zxSa47SuT Great time in the shoot for the new @SacoorBrosGL collection. The Portuguese heritage inspired the new collection. \nhttp://t.co/oLuyeZI86G Want to be my VIP guest at Real Madrid-Barça? Support youth sports programs in Haiti. ENTER: http://t.co/ZyR8HlIMl4 http://t.co/12jUDFuOwU Flying with style. http://t.co/4NqgRZd5ga Mission accomplished! Great team work leads to great victories. #euro2016 here we go. #forçaportugal http://t.co/2e7ZM1zk4G Hey guys. We finished another training session. Tomorrow is decisive. #forçaportugal\nhttp://t.co/BsVW54dV1o http://t.co/Wq05Wsfa3y Tickets are now on sale for @RonaldoFilm, in cinemas Nov 9: http://t.co/Quq6edyZbg 🎥🎬 More cinemas coming soon! http://t.co/P1MxMEIK4p You can explore my island @madeira_islands by Walking, Diving, Canyoning and more. Get ready for the adventure! http://t.co/7ZpQRt5IQu Do you know what I think about my perfume #cristianoronaldolegacy? See the behind the scenes http://t.co/xxisDWV99f\nhttps://t.co/UzyuVqrPnj Yesterday I had my first fashion show to launch the FW15 collection of #CR7Footwear. It was a lot of fun! http://t.co/qmrOVpIspe Never imagined to achieve this record when I arrived in Real Madrid six years ago...https://t.co/7u0neY1VcL http://t.co/PhpqOlFXrQ 500 #mercurial goals. More to come! Explore\nsome of the boots contributing to the\nmilestone: http://t.co/tXAjIBbTCZ http://t.co/6924pGw9qb Good morning. http://t.co/GPcla3Hihq I’m in a photoshoot for the new collection of #CR7footwear, in stores soon. Hope you enjoy! http://t.co/dZCXGKchyp http://t.co/0okHRPadUl Check out the trailer for my film! In cinemas worldwide Nov 9. Visit http://t.co/rsToTGbPRG for more information.\nhttps://t.co/vojFgscWlz Introducing my new sports drink: CR7 Drive developed with @Herbalife24.Drive your destiny at http://t.co/iJJ2ws76H5\nhttps://t.co/IQhyQYiVSY So excited 😊 Here's the poster for my official documentary in cinemas soon. What do you think? ⚽️🎥 http://t.co/InluQhH3IS #CR7Shirts #CR7Underwear  http://t.co/RCLtRbkZux http://t.co/SrGEvse2bP Here’s a sneak peak of me getting ready for the TV ad of #cristianoronaldolegacy. I had a great time! http://t.co/ZqKNTUes3n I’m flying 1 lucky fan to Madrid to hang with me &amp; be my VIP guest at R. Madrid v. Barcelona http://t.co/l5bWBhi2be\nhttps://t.co/ap2okvOwU4 Spending the afternoon training at home with my boy. \nhttp://t.co/Ht6E3qlvJw http://t.co/ra7zxnbTDu Hey guys, just finished training and now it’s lunch time. Eat properly, be healthy! http://t.co/atRbEGkksB http://t.co/63lczaUO14 I’m driven. Are you? @Herbalife24 #CR7Drive http://t.co/ThcYzSdx12 Great win tonight in the Champions League! It was amazing to feel your support. #halamadrid http://t.co/rVtgOpC1d4 Spending excellent time with my son.\nhttp://t.co/EVR2bX4CfR http://t.co/CWyAY1bTRz Check out a clip from the ad for my new fragrance Cristiano Ronaldo Legacy. Full version here http://t.co/xxisDWV99f\nhttps://t.co/JGXcNpb8I5 What do you think of Cristiano Ronaldo Legacy? http://t.co/6exwsPIxJy Introducing my debut fragrance for men - Cristiano Ronaldo Legacy - go to http://t.co/xxisDWV99f for more!\nhttps://t.co/T1oRWjuYo1 It's nearly time...\nhttps://t.co/r9gD75IUq4 No one at the National Team is indifferent to Europe’s refuggee crisis. All our thoughts are with those people. http://t.co/Gf9wvXEuNJ Espírito Português. http://t.co/jQ5IDShaab One of my favourite #CR7Shirts for Autumn/Winter. Check out http://t.co/RwbrAO7iK5 to see all of our new styles! http://t.co/hRVfMbN5qm Madeira, my homeland: the 6th Best Island in the world and 2nd in Europe. Visit and discover why @madeira_islands http://t.co/gUGZFhrpMm Check out my new favourite DJ. http://t.co/mDcyfI3VO9 http://t.co/ZAzwt9VIuY I love my new #techpack from @nikesportswear. It's amazing! http://t.co/dzwIo9TjNl Celebrating the launch of my Autumn/Winter #CR7shirts collection! See the new styles on\nhttp://t.co/RwbrAO7iK5\nhttps://t.co/vS3hBr4k2g Hard works requires hard recovery. \nhttp://t.co/cE9FLcfRx1 http://t.co/8t69vSYFXM Hope you liked my 4th #CR7underwear campaign!Here’s a sneak peek of the shoot! New styles on http://t.co/RCLtRbCAT7 \nhttps://t.co/lvOmG6LUf6 Nutrition. Dedication. Drive. Check out my new interview series with @Herbalife #CR7Drive http://t.co/TJ37Ak8lXg My new official keyboard in now available for your smartphone. Take a look and try it! http://t.co/KZXlGUeeNk http://t.co/9o6ECRlwgc Have a nice Sunday everyone!\nhttp://t.co/1s8k2bGQEG http://t.co/FoQNRaLPoc Exclusive image from my latest #CR7Underwear shoot! Love the new collection - check it out now http://t.co/RCLtRbCAT7 http://t.co/NcEAOxIknb Fun time with my bro!!! http://t.co/YUXpVwIpLj Hey guys! Wanna help me choose the best haircut? http://t.co/6I1Y4LZ5K5 http://t.co/QtU0PgOEHl RT @AppStore: .@Cristiano in an extreme endless skateboarding game: Amazing!\nhttp://t.co/c9wadZSJPr\nhttps://t.co/JeKpZIyKWG Trip to Shanghai. http://t.co/GmKNYSwxbc Good win tonight. http://t.co/RBaOBi5Wiq Coming soon!\nhttps://t.co/ejCcbR79Ha Ready for tomorrow! http://t.co/U2eeEkRGvG Step out in style with #CR7Footwear! One of my favourite pairs in the collection. http://t.co/H3tWJAxDrd http://t.co/CV7eChczIY Parabéns aos campeões da Selecção Nacional de Futebol de Praia! Enorme orgulho para Portugal! http://t.co/YGBZp5wmcJ Met these future champions after the game. Proud to support @savechildrenaus which gives these kids safe play areas. http://t.co/y7u0GHlguD In Australia and ran out of @Herbalife24 #RebuildStrength. Found a @Herbalife nutrition club. Thanks guys! http://t.co/mFqsf2k2ea First poker night with new chips. http://t.co/5ZdHRhHihv Iker, un orgullo haber trabajado contigo tantos años. Mucha suerte en tu nuevo equipo! http://t.co/Y2beNYQzjK Always be at your best with @SacoorBrosGL outfits, the perfect look for every occasion. Find the closest boutique: http://t.co/mHI2WPemKt It’s about the bold choices we make that embrace risk and inspire courage. What drives you? @Herbalife #CR7Drive http://t.co/E7zYengjqT Introducing MTG Sixpad in China. http://t.co/JLkIKZ1WD8 How you train makes the difference.Check out the @niketraining Free Trainer 3.0 made for speed http://t.co/33RdDvP2Eo http://t.co/dFdIPbc3RV Sixpad launch in Tokyo! http://t.co/6jN3FAK4aF Amazing vacations with great friends. http://t.co/IcfxjFvknd The countdown is over! You can finally get my @TAGHeuer special edition on your wrist @TheWatchGallery \nhttp://t.co/JRPnedKDsl My training just got a new look from @NikeTraining . #nikefree http://t.co/cX3mKJCh7p Loving my new CR7 chips from PokerStars. http://t.co/5Np1NPDKPd This was my score at Ronaldo&amp;Hugo. What’s yours? http://t.co/0KJXfey8vw http://t.co/S5lFO3jAqo The moments with my son are always amazing. You can see some special moments with him in the new film: @RonaldoFilm http://t.co/v1v3an6zfW Want to appear in the credits of my film? Just load your selfie shots of you and me to my website  http://t.co/pKA5YePq7V I will be releasing my very own fragrance later this Summer. How exciting! More news soon! http://t.co/uhYnJDTWsa Celebrating my son's 5th birthday. http://t.co/q4deRAaSFC Hello all! Positive thoughts for the people in Nepal. Portugal and Nepal together! http://t.co/V2rvtX9ebf Extraordinary night and a big step towards qualifying for the #euro2016. #forçaportugal! http://t.co/fxTp4nPWA5 http://t.co/a5H8OZm1FB I’m happy to confirm that there’s a film being produced about me. Stay tuned for more info at @RonaldoFilm http://t.co/wi7oa0p6Z9 Exciting news to share with you tomorrow. Can’t wait! http://t.co/ESFtvzVfBg Want to see more of my photoshoot for @SacoorBrosME Spring Summer Collection? Don’t miss out any detail here: http://t.co/qS0svsMwaj Thank you for being there for me. Your support makes me wanna be better everytime. VIDEO http://t.co/GpKNQ2tdQT http://t.co/9OxlHxF63U Who remembers this guy?Brings me back childhood memories.Play “Ronaldo&amp;Hugo:Superstar Skaters” http://t.co/0KJXfey8vw http://t.co/vEapVP3HkP Nice boat hein? http://t.co/vuRz3T36Tl Summer is coming! Put your best foot forward and shine in my shoes! Discover my CR7 Collection http://t.co/H3tWJAxDrd http://t.co/NtxShNp8om I’ve joined the world’s best poker team! #PokerStars http://t.co/fNHbh0YlTK http://t.co/YXTMQVSWZy Great coach and amazing person. Hope we work together next season. http://t.co/HqHHGjGGUH Which pair of #CR7Underwear should I wear today? Help me choose! http://t.co/ekmhzaLEwD Good nutrition is at the core of my success. Excited to be working with @Herbalife24 #CR7Drive http://t.co/WtU6GPIzBt I think I found the perfect training partner! http://t.co/6i3BDgbukA http://t.co/jKAqFx9X0t Pleased to be part of @SacoorBrosME family,a Portuguese brand where you can find the perfect look #PerfectMatch http://t.co/JLpYhYLjtO Help the children affected by #NepalQuake by supporting @SavetheChildren’s relief efforts: http://t.co/yQdEv6XqkN http://t.co/PsSMriqYj1 Celebrating this important win with my friends. http://t.co/ZYgdwZQERH http://t.co/6Sx4qKKxhe Another important step in this UEFA Champions League competition. Thanks for your support. ... http://t.co/obwyITwZFU http://t.co/ogiDBQunsv Tomorrow is decisive and your support is essential for the triumph! Hala Madrid!  ... http://t.co/MEcbXouEza It is fantastic to hear our son wishing \"Good luck Dad!\" http://t.co/mY45WaP6M3 http://t.co/dkeIwRi0h4 Go for gold with my exclusive #CR7Footwear Gold Edition http://t.co/1Kf4ETEJB8 #Cerciguibenefit http://t.co/n7wv2k27pI I have just entered my predictions for A. Madrid - R. Madrid on #VivaRonaldo. What about you? @VivaRonaldo http://t.co/ZQmCmaLtYF Celebrating the birthday of a great friend. http://t.co/y6ZotQdlzX http://t.co/eFQYpIdrSQ Good news about my #CR7Underwear. Microfiber fabric is now available, making it very comfortable, light and soft. http://t.co/byLv3055V7 Exercise all you can! It's good for your body and your mind! http://t.co/WiqiYnrvdb Happy to have scored 5 goals with this excelent team work. Thank you for all your support. ... http://t.co/XXJMmFN3XE http://t.co/UI6FbpoNuj Nice dinner with a good friend. http://t.co/guRLyGoV9C http://t.co/nHl44dWJfE I love @SacoorBrosME suits, the quality of materials, tailor-made service and amazing experience in stores. Try it! http://t.co/36DlCOmR9m Family time is precious time and I'm enjoying it. http://t.co/LAPuHMaJWH http://t.co/2bByuHWDLg Important win for the team against Serbia. One step closer to #euro2016. #forçaportugal http://t.co/Lt9iXfMfbh http://t.co/7U3KQZdHAj Hey @07RQuaresma, thought you could use a little more speed for our next match! 😉🔥#mercurial http://t.co/1lO03KpkXF O nosso brazão. As nossas cores. O nosso orgulho. Põe o teu nome na nova camisola da Seleção. http://t.co/X08DD2egkl http://t.co/1uW9vTXHib Our badge. Our colours. Our pride. Put your name on the new national team jersey. http://t.co/X08DD2egkl http://t.co/yAzdgg4W81 El Clasico weekend. Make your prediction ahead of the game on Sportlobster now. #halamadrid http://t.co/oXGIZ2EL79 http://t.co/3BG2SJgazA I'm proud to have my @TAGHeuer Special edition! #DontCrackUnderPressure http://t.co/TyxGR2jrPq http://t.co/WkjkPkzyOw I have just entered my predictions for Barcelona - R. Madrid on #VivaRonaldo. What about you? @VivaRonaldo http://t.co/ZQmCmaLtYF You saw my new CR7 #Mercurial on @Nikefootball’s Snapchat! Now get it in the Nike Football App http://t.co/tXAjIBbTCZ http://t.co/AV50LohFXi Welcome Jeremy Lin to the @TAGHeuer team. #DontCrackUnderPressure http://t.co/KsjE1ZShS7 Zaid fled his home 3 years ago. He has forgotten the names of his old friends. We won’t forget Zaid #WithSyria http://t.co/jAqV6eDg4l Commitment, dedication, hard work and drive to succeed are some of the values that I share with @SacoorBrosME\nhttps://t.co/X02ygLSjFZ Tomorrow is Champions\nLeague day. All set! Vamos Real Madrid! http://t.co/5qHOLiVQ5b http://t.co/1Y124YdAYx Back on track. On my way to the training. http://t.co/IIQJFa4dB6 http://t.co/y9aRt0g98B Happy birthday @realmadrid for the 113 years of success. http://t.co/mt51sfIkOF Make your predictions for tomorrow’s match on the Sportlobster app &amp; climb the leaderboard. http://t.co/MArNHqWZ8S http://t.co/Rq30IhWfWG Skills + Fun + Fashion = Shine in my shoes #cr7footwear http://t.co/H3tWJAxDrd  http://t.co/Uw348gWrYJ Good morning ! Leaving for training with this nice weather. http://t.co/gPgroOWy9q http://t.co/Rtqmc3uRV4 Training session for the next match. #halamadrid http://t.co/ugPgV3Mxl6 http://t.co/HHWWvNlLJ3 Can’t wait to show you how much fun I had… #CheckItOut at http://t.co/H3tWJAPeiL\nhttps://t.co/dJR65ZWFmi Happy to share with you some new images from my #CR7Shirts campaign! I hope you like it. http://t.co/Hpbk1dQE9b Playing with my kid. CR Junior 2 - CR 1!! http://t.co/bb4sR6s5pK http://t.co/AHIS78oJNa Tomorrow we’ll face Elche. Vamos @realmadrid! http://t.co/abwtXIcSIV http://t.co/huR28N1hq7 Don’t miss anything in the world of sports with the Sportlobster app. Download it now. http://t.co/MArNHreA0q http://t.co/Dy7BODC8eE Here's a sneak peek of the new @SacoorBrosME Collection. Every detail counts and that makes us unique. #PerfectMatch http://t.co/ixQpVZtkwE The team has reached its goal. Another important win in the\ncompetition. #halamadrid #UCL http://t.co/NqT1Hft2Z7 http://t.co/51o6EAdVpm Have you tried the Sportlobster app? Download it now. I’ll follow back some of you http://t.co/MArNHqWZ8S http://t.co/ZqbJCV6oWu Want to know what it’s like walking in my shoes? My #cr7footwear collection launches today! http://t.co/H3tWJAxDrd http://t.co/bLz7AUl7lE Happy for the win today #halamadrid http://t.co/FhisdQGseh http://t.co/QnZNVQZNU8 Very proud to be nominated for @LaureusSport Sportsman of the Year. #LWSA15 30 years old! I can’t thank you enough for all your birthday messages and wishes! Thank you for your everyday support http://t.co/EstFyDSEnE RT @iHeartRMadridCF: HAPPY BIRTHDAY @CRISTIANO. You are amazing and you inspire us so much. We love you. #HappyBirthdayCR7 http://t.co/3r3P… RT @AniiaUgaldee: Happy Birthday hero🙌❤️ Proud of you always, best player in the world @Cristiano http://t.co/gA0ZHZFuDM RT @Pele: Feliz aniversário @Cristiano ! Sua elegância e criatividade no campo fazem de você uma estrela internacional. http://t.co/w4dsJiM… RT @Benzema: Feliz cumpleaños mi amigo !!! Happy birthday my friend !!! @Cristiano #HalaMadridYNadaMas http://t.co/up31j5LO4r RT @ArturBanar: Happy 30th birthday @Cristiano! Wish you the best and I will always support you! #FelicidadesCR7 #HappyBirthdayCR7 http://t… RT @katieronaldo7: Happy Birthday to the best player in the world! You are my hero ❤️ @Cristiano http://t.co/sEG8UDW4NR RT @_markusLFC_: Happy birthday, @Cristiano ! http://t.co/GJaPB1dgRE RT @CasillasWorld: Feliz cumpleaños @Cristiano ! Esperamos que cumplas muchos mas con nosotros! http://t.co/TR22dRNRb9 RT @CR7OficialArg: #HappyBDayCR feliz cumple, felices 30 al mejor de TODOS ! Te saludamos desde Argentina, te amamos♥ @CRonaldoNews http://… RT @IllarraOfficial: ¡Feliz cumpleaños @Cristiano! / Feliz aniversário @Cristiano #Grande #BallondOr #HalaMadrid http://t.co/3HI79BaYZF RT @CRonaldoNews: @Cristiano parabéns ao melhor do mundo! Te amo! #VivaRonaldo RT @ochocinco: @Cristiano Happy Birthday boss... #HalaMadrid RT @CR7StrongChile: Nos llena de orgullo seguirte en cada etapa de tu vida, desde Chile un abrazo lleno de amor ídolo 💜 http://t.co/cP1nmCa… RT @Daniel_Nilsen: HAPPY BIRTHDAY to the world's best player, @Cristiano!! My idol and biggest inspiration! http://t.co/1QelquOTIo Thanks @Daniel_Nilsen RT @aarbeloa17: ¡¡Feliz 30 cumpleaños, Cris!! \n¡No hay mejor edad para seguir en lo más alto! ¡¡Parabéns, @Cristiano!! http://t.co/xro3TZqh… RT @realmadrid: ¡Hoy nuestra leyenda @Cristiano cumple 30 años! ¡Felicidades crack! #HalaMadrid http://t.co/hPJmNnno6X RT @VivaRonaldo: Happy Birthday @Cristiano!!! #CR30 #ParabensCristiano #VivaRonaldo http://t.co/nSkPA7sRCT RT @ApoyoCR7: Hoy cumple años el mejor jugador del mundo. ¡Felicidades Cris! @Cristiano http://t.co/XgfPwGtCAd RT @Srta_CR7: Muchiisimas felicidades Idolo, espero que puedas ver este dibujo. Apoyandote siempre @Cristiano #Felices30Cristiano http://t.… RT @7cristianorb: Happy 30th Birthday @Cristiano! All about hard work &amp; sacrifice, the rest is history. \nMy inspiration &amp; life example. htt… Revealing my SS15 #CR7Underwear campaign &amp; my top tips for health and fitness on http://t.co/n3sf9DiLlP Check it out! http://t.co/xOrKV7vGq6 Pido disculpas a todos y especialmente a Edimar por mi acto irreflexivo en el partido de hoy. Preparing for the next match against Córdoba. #realmadrid http://t.co/t0eeLPJJuu http://t.co/21LF7a9A5M El libro @laclavemendes de @miguelcuestar y @jonathanschezm ya a la venta,con prólogo escrito por mi!No os lo perdáis http://t.co/QBtHtCzdY1 Ya está a la venta @laclavemendes el libro donde pueden conocer mejor mi grande amigo Jorge Mendes ¡No os lo perdáis! http://t.co/uKXcVJFUNS My special #Mercurial for a night when we need to be at our best. @nikefootball http://t.co/PX18xavRYY No day off. Even if you’ve earned one. #JustDoIt http://t.co/TTUf0LzcUp http://t.co/yLIctEcFwh It's an unforgettable moment\nin my life to win the Ballon d’Or for the third time! I fee... http://t.co/OnVq1Ut2eP http://t.co/n0sUmGCRo4 2014 was full of incredible moments. Thank you all! #Ballondor2014 http://t.co/Z3K7aSYR12 Press conference is done. Can’t wait for the ceremony! #ballondor2014 http://t.co/ljNXxymPiJ On my way to #Ballondor2014 http://t.co/KpgZRu4wUA http://t.co/f4cll6YOlC Think you’ve seen all my skills? Coming soon…. http://t.co/Hzy99OXYO0 http://t.co/8WemDOzVG4 Great moment with the @Emirates crew last week in Dubai. RT @emirates: A crewfie with @Cristiano #AllTimeGreats http://t.co/G2lQLdlI73 Back to La Liga. Tomorrow we’ll face Valencia. Predict the result on Sportlobster http://t.co/XpRjRwMqMj http://t.co/Wyvs607AvZ Hey guys. 2014 was great! Hope 2015 will be amazing for all. Happy New Year!i http://t.co/PofIutjkQz Let’s make the new year a little brighter for kids &amp; families around the world. Everyone can help @SavetheChildren http://t.co/JsCbAD6vDF RT @ESPNFC: ICYMI: Our yearly award has a familiar winner. 2014 belongs to @Cristiano. Well done CR7. http://t.co/hJ1Vh2Kvx3 http://t.co/Sx… Very proud to receive the Globe Soccer Best Player of the Year award and the Fan's Favourit... http://t.co/YyKIPoDFj4 http://t.co/p1xuKmPgfc Having a great time in Dubai! http://t.co/AwyGZxRAMj http://t.co/qh2KNgD7Fv I met brave Martunis who survived the South Asian #tsunami 10 years ago.  I thank those who helped. @SavetheChildren http://t.co/b1E8fXK9nm Merry Christmas, everyone! May your Christmas be magic and your dreams come true! http://t.co/eTse9Zgd9S http://t.co/CFXGHOfrrH Sportlobster has a brand new look. What do you think? http://t.co/R3zxVO63tA Nice to relax and have some fun on some days off. http://t.co/fhJeY55dGv http://t.co/a8ejotPcAs Here are some of my favourite pieces from CR7 collection! Check it out! http://t.co/Vlium7wLni http://t.co/XB43EvaDLV http://t.co/U0btfiZ1ex I feel so proud to be honoured with a statue in Madeira. It's a huge joy to share this mome... http://t.co/0PxRpyOc6q http://t.co/afbBvaGQPN Honoured to receive the Cordão Autonómico de Distinção, the highest distinction of Made... http://t.co/GrX0DjSe3A http://t.co/WaY6AgxNTk Another important trophy for the team. The Club World Cup is ours. Hala Madrid! http://t.co/JqsrtAM7IM Today I proudly announce my new partnership with Sacoor Brothers, a portuguese clothing brand. http://t.co/ZMkxVArWKV http://t.co/e55ROVaJDQ In Christmas,it's very special to think about Portugal, its nice people, good food and moments http://t.co/tGiIaCo1JF http://t.co/kMsHD7casT We're in the final of the Club World Cup. Hala Madrid! http://t.co/ePoYhGGsjf I was just nominated for Globe Soccer Fan’s Favorite Player of The Year Award. Vote here http://t.co/tOoZuIzHRs or http://t.co/l1OUC1pxMp Thank you BBC for choosing me as 2014 Overseas Sports Personality. It’s very rewarding to win this award. http://t.co/YAryOEKdYo Wanna know what I think about my new #CR7shirts collection? Check out. http://t.co/jAW9uYg1JI http://t.co/XB43EvaDLV My mother is, without any doubt, a mother courage. I feel very thankful and proud to be her... http://t.co/of21r3mMjX http://t.co/UmbC3auypz Tuesday we’ll play for the Champions League. Predict the result on Sportlobster #HalaMadrid http://t.co/k74m2OlOJj I\nhad the pleasure and privilege to get to know Nelson Mandela in 2010. Madiba\nwill alway... http://t.co/VotYLbzeSR http://t.co/zW1X5nIHoA I feel honored to win the World’s Top Goalscorer 2013 award by the\nInternational Federat... http://t.co/SfUsBL4oyx http://t.co/WU12MyIf4K Time for a bike ride. http://t.co/L7zdB107BZ http://t.co/yCDyHSQCsU Well done, team! Through\nto the Round of 16 of the Copa del Rey. #halamadrid http://t.co/BCBvk2XRLe http://t.co/G572FwgqvU Pleased to share my #CR7shirts campaign with you.Hope you love the collection as much as I do! http://t.co/XB43EvaDLV http://t.co/rlAokRwyJj Hey guys, I followed back the most creative fans on Sportlobster. Were you one of them? http://t.co/WbNVqEnPuC http://t.co/wRypxpDcC6 Last training session before Malaga. Hala Madrid! http://t.co/CoEQdIyPAy http://t.co/sZAPmoqtl4 Here’s a look behind the scenes of my #CR7shirts campaign shoot, wearing one of my favourite pieces. Do you like it? http://t.co/kqKT8Ga7jI Have you entered the Sportlobster competition yet? I’ll follow back the most creative. Check out these great pics:  http://t.co/3EK3KlWuYe There’s a photo competition running on Sportlobster.It starts now, I’ll follow some fans back. http://t.co/hZm92dQALq http://t.co/2wLqWyTVik Christmas time has arrived. http://t.co/gJUbosLaDw It’s with great joy that I share the inspirational story of Bernardo, a story of success in fighting #ALS http://t.co/Z0tYIC5K2Y Many people around the world embraced the #icebucketchallenge to create awareness to #ALS. Hey guys. My #CR7shirts collection is now available in stores. How exciting! Visit http://t.co/VUOf12QmLv http://t.co/pEi0WRZvor Happy to spend family time with my son. http://t.co/YbIAFcVgUj Portugal 1 - 0 Arménia http://t.co/TEjt28fgme http://t.co/7YCjvfrOKD All set to face Armenia tomorrow! #ForçaPortugal #Euro2016 http://t.co/HWSqYyzSzD http://t.co/MTPqnTisaQ Today I received MARCA’s Di Stéfano award and Pichichi award. Always a pleasure to be recognized with these trophies http://t.co/JVRUdGNxkY Today we’ll receive Rayo Vallecano at the Bernabéu. Predict the result of the match on Sportlobster. http://t.co/9b76j8mOdE Hey guys, I received a new\ntrophy that will be in exhibition at Museu CR7 - the one Facebo... http://t.co/VmcDICgyIp http://t.co/YQWVOwwURm Today I recieved the Golden Boot for the 3rd time, a special day. I thank my family, teammates, the club and the fans http://t.co/caOHMR9LuR The win against Liverpool leads us to the Champions League round of 16.\n#HalaMadrid http://t.co/YKmMxMA5OM http://t.co/wjhfAe8UGJ Tonight is Champions League night at the Bernabéu against Liverpool. Predict the result on Sportlobster. #HalaMadrid http://t.co/nO4DB6m3GM So happy to celebrate the 1 year anniversary of my #CR7Underwear this weekend! http://t.co/MCIly6SNIz Lead your team to the @Globe_Soccer Awards! Round 3 of @GAMEbyRonaldo ends Dec 7. Start competing now at https://t.co/Lou1gQNPYy Round 3 of @GAMEbyRonaldo is on! We’ll be flying this year’s best team to Dubai for the @Globe_Soccer Awards http://t.co/Iuh2kSsEBN This is a big moment for me. I won the awards for Best Forward,Best Goal,Best Player in La Liga 2013-14. Very happy. http://t.co/gbBRVN6Xyj What a night! Best Forward, Best Goal and Best Player in La Liga in 2013-14. Happy and proud! Thanks everyone. http://t.co/2As07eHeWe You asked: Ecuador loves you!!!  http://t.co/jqdBnrdxUg You asked: Wish you the best! Honduras love you http://t.co/d2OtYY1mWg You asked: \nHello from Japan!\nI'm Anna!I I'm a big fan! Please say me hello Anna!\n http://t.co/5Oyi7SiUhY You asked: ¿Un saludo para Cáceres? Eres muy grande!! http://t.co/WYxhBj5x7n You asked: hello from France, champion ! :) im so proud of you http://t.co/AhDl5iMGzF You asked: Poland loves you, idol! http://t.co/fcxXEf7pBc You asked: Que grande que eres, cada temporada te superas. Verte jugar con el Real Madrid es mi felicidad :) http://t.co/riHhaZZU8U You asked: Say hello to Slovenia ! :) we love you http://t.co/TozciO83QK You asked: Greetings from Switzerland,\nWe love you ! http://t.co/rGLz7RYQdD Thanks for the support last night. Join @Emirates in their #helloclasico photo contest to win a trip to Dubai. Click http://t.co/19vrddPZzW Another win for the team. Hala Madrid! http://t.co/0KXHVqgC1X Hala Madrid! @nikefootball #Mercurial http://t.co/HOBQUcirBb http://t.co/vpqrYPpwal Ready for the big game… #Mercurial http://t.co/jQXyLPRrUl Here's how I've been preparing for El Clasico. ;-) #Mercurial\nShop now: http://t.co/HOBQUcirBb http://t.co/IV7e5JWxFd Thanks @nikefootball for the superpowers.\nWatch me now in the full film ‘OUT OF THIS WORLD’ http://t.co/I2XES5oLPJ http://t.co/Vdy3Dj305w Check out my new #Mercurial Superfly CR7. \nGet your pair now on the Nike Football App: http://t.co/I2XES5oLPJ http://t.co/Jezeqe9Wz4 Today we’ll play for the Champions League against Liverpool. Predict the result on Sportlobster http://t.co/2h3RHc8oPk RT @emirates: Show your support for @realmadrid in El Clasico &amp; win a trip to Dubai. Details: http://t.co/SwEyx08T7G #HelloClasico http://t… RT @OptaJose: 69 - Since start of 2013, @Cristiano has never failed to score for 2 CL games in a row. Star http://t.co/uIEYYlFvQ4 RT @OptaJose: 69 - Desde enero de 2013, @Cristiano nunca ha dejado de marcar en dos partidos seguidos de Champions League. Estrella http://… You asked: Greetings from China！Take good care of yourself please！We will always love and support you！ http://t.co/KZ8cia7nzU You asked: hi from Puerto Rico http://t.co/2E8I8fGkyQ You asked: Congratulations on your 100 million Facebook likes! You deserve it! Can you PLEASE say Hi Serena??:) http://t.co/fepzUhEOy7 You asked: it was so fantastic to see you in Denmark  http://t.co/AtOsN4tq0N You asked: Hello from Singapore. All the best for this season :) http://t.co/pVXASWNK1T You asked: Say Hello to Mexico! Please http://t.co/gEKbySj3lt Happy with the win against Denmark last night. Fantastic team work.#forçaportugal http://t.co/GiRwj6kiSX Happy and proud to wear my #CR7underwear on the cover of @menshealthmag in 60 countries all over the world! http://t.co/zWjPvuxLx0 Dinner with tigriski. http://t.co/TWLUxucqUF http://t.co/ntKz7SURLa Another win last night in the group stage of the Champions\nLeague. #HalaMadrid        http://t.co/oLGsLaev1u I have just entered my predictions for Ludogorets - R. Madrid on #VivaRonaldo. What about you? @VivaRonaldo http://t.co/GWxiDwVO06 Hello Bulgaria!\nTomorrow we’ll face Ludogorets for the Champions League. #HalaMadrid   ... http://t.co/7i36lpG4QE http://t.co/YNvUHVkfu9 You asked: Please say Hello Nikolas from Sydney, Australia. Thanks Cristiano :) http://t.co/aZmwbPGzZB You asked: Please can you say \" hi maya\" ? :) http://t.co/UNmRDPktAE You asked: Hello from England , can you say \"hi Diana \"? Plz love you  http://t.co/DIhX29TERq You asked: Good Luck in the season idol!  http://t.co/Nh3xEdOZJx You asked: Puedes mandar un saludo a España? Gracias ídolo!\n http://t.co/BKVxi8R4mP You asked:  HELLO FROM HONDURAS :) I love you!&lt;3  http://t.co/OfBsnWicvh You asked: Hello from Moscow, Russia! Good luck in this season Cristiano;) http://t.co/0TiQHVJpMJ You asked: Say Hello to Canada !!! Please !  http://t.co/YIi9KDt3ZG Portugal campeão da Europa de ténis de mesa! Parabéns aos campeões Marcos Freitas, Tiago Apolónia e João Monteiro! http://t.co/wsoiNsgsns Which of my Real Madrid goals is your favourite? Tell me on Sportlobster now http://t.co/Ky0eElqNaN Round 3 of @GAMEbyRonaldo it's on with lots of action coming. Sign up your #5aside team for the competition on http://t.co/8ApMhR4qHO Think you've got the best #5aside Team around? Sign up for Round 3 of @GAMEbyRonaldo and BE that Team! http://t.co/jUDbqSWiDk Wow! Reached the 30 million followers on Twitter, it’s amazing. Thanks everyone. You asked: Hello from mexico http://t.co/HHLUmd3qPU You asked: Eres el mejor del mundo, te admiro mucho! saludos desde Bolivia! ❤️💛💚 http://t.co/UO9nsR68Ak You asked: Hello from Poland  http://t.co/zrBUNXPwMI You asked: Hello from Los Angeles California, how are you today?  http://t.co/6CrT9DlIG1 You asked: Hi CR7 can you say hello to India . http://t.co/REx8RmPtG3 You asked: hello from morocco \n http://t.co/gbuEyP5953 You asked: Hello from Sweden http://t.co/7azpYseGEd Another exciting match\nfor Real Madrid with a win against Elche. Let’s go team!        http://t.co/v009wdRXzZ http://t.co/XzhlpCDZz6 What a great match yesterday! Hala Madrid. http://t.co/z1THlpKX3G Challenge yourself and #dontcrackunderpressure\n  http://t.co/bSOe1mWzb3 What was your favourite moment from last night's match? Please let me know in the RealMadrid Fanzone on sportlobster http://t.co/Ky0eElqNaN What a fantastic @realmadrid team work with the win last night. #HalaMadrid http://t.co/ZaJsMAoqcf Ready for the game #HalaMadrid @officialpepe @jamesdrodriguez @12MarceloV @NavasKeylor http://t.co/WeU7xf3ArY Desejo boa sorte à nossa Selecção, nova etapa, estamos juntos. Los nuevos compañeros son top! y con ellos hemos completado una gran plantilla. Vamos a por todas! Un abrazo y Hala Madrid! Mis declaraciones se han malinterpretado. Ayer escuché a mi Presi y estoy con él al 100%. We have the winner! Well done @carolinaxo___ Follow me on Sportlobster to know more. http://t.co/Yy8xMWjsNb http://t.co/ScUyy3f28x Your last #FindMyCR7Shirt clue! You still haven’t found it? The last clue is here: http://t.co/Yy8xMWjsNb Your second #FindMyCR7Shirt clue! No one has found the shirt yet. Get the second clue here: http://t.co/Yy8xMWjsNb Your first #FindMyCR7Shirt clue is on Sportlobster now! Read it there and go looking! http://t.co/TG9RTMUgxK Later I will give clues on http://t.co/cL83RStfqE so you can find a signed Portugal shirt in London. #FindMyCR7shirt http://t.co/ge7j3409yI 1M followers on Sportlobster! A signed shirt will be hidden tomorrow. Clues on Sportlobster http://t.co/Yy8xMWjsNb http://t.co/t6cc5RAHnN Check out what happened when I joined @JensonButton in the track. #DontCrackUnderPressure @TAGHeuer \nhttp://t.co/fsohf8inhV RT @wilmyers: Go download #BaseballBattle on iOS for free! Let me know what you think! http://t.co/CiwkAxT00v Great day at the track! #DontCrackUnderPressure @JensonButton @TAGHeuer http://t.co/KCLU3sCCiI How fun shooting balls on the track with @jensonbutton #DontCrackUnderPressure @tagheuer http://t.co/uXC5cQ7JiX Speedy ride on the track with @JensonButton #DontCrackUnderPressure @tagheuer http://t.co/w7GWNkLUBX My son wearing the special helmet. #DontCrackUnderPressure http://t.co/voloYWoWTo Let’s go for some laps. @JensonButton  #DontCrackUnderPressure @TAGHeuer http://t.co/r6QaXX0Jzj Getting ready for some speed with @JensonButton #DontCrackUnderPressure @TAGHeuer http://t.co/l2KvszTJq7 .@JensonButton OK Let’s do that #DontCrackUnderPressure You asked: Say hello to Ireland 😘 http://t.co/e6JdR6j5lO You asked: Can you say \"Hello Aamna\" a very big fan of yours from England :')? http://t.co/wCxWdDoNiF You asked: Greeeetings from austria and congrats for the price! HALA MADRID HALA CR7 http://t.co/WMe52sgc3P You asked: How do you think about Japan? http://t.co/aHeD2cajx5 You asked: Felicitaciones saludos de venezuela  http://t.co/TT30IYLuBU You asked: Olá Cristiano! Sou portuguesa e quero-te dizer que mais um vez orgulhaste Portugal! Força :) http://t.co/pVc3aMwxe8 You asked: Can you say hi Rodrigo...! From Honduras..! Please http://t.co/ICcW6TohR0 You asked: How are you today? http://t.co/kM5zjlcZKA You asked: Cristiano!!! Te admiroo! Eres el mejoor! Saludos desde Bolivia.  http://t.co/g5ZPFLDf9S You asked: Hi Cristiano! You are my idol and inspire me in all that I do. Now I am learning Portuguese! http://t.co/e49J6P22va You asked: What are your favourite sports ?  http://t.co/VyRlLxVqH3 You asked: Greetings from Holland !  http://t.co/ohsG7T7pUA You asked: ojala que algún día me saludaras :(, saludos para Peru. http://t.co/VZRYbH7eBe You asked: Hi Cristiano, can you say me \"Ciao Miriam\"! You're my idol and I'm your biggest fan from Italy! http://t.co/GNAWVy2VtW You asked: Hi Cristiano. Can you say \"hi bahar\" greetings from Denmark idol&lt;3 http://t.co/XK7BUAFKyt You asked: Argentina loves you http://t.co/zlgfoUnxU0 I've followed two lucky fans on Sportlobster. Are you one of them? Download the app now and it might be you next time http://t.co/XmEbAuILOn #UEFAbestplayer of Europe. What a joy to win this trophy that I want to share with all of you. Thank you. http://t.co/HYbr9lEg70 .@JensonButton I’m on! Thrilled to get on the grid asap #DontCrackUnderPressure .@JensonButton Up to exercise? Some slalom with the ball in the field? What time can you do? #DontCrackUnderPressure Fun time with my kid last night.  http://t.co/rUHfycuj7K http://t.co/SmqSRjExWf Ready to try my new Mercurial Superfly http://t.co/0IvEBzFuw8 http://t.co/yNNp5OnSlZ There will be prizes on the most active cities and #London is already in. Join @GAMEbyRonaldo http://t.co/HHGZ3eUUFy Attention #5aside teams, Round Two of @GAMEbyRonaldo just started! Join the competition at http://t.co/IWx8rh7TEf Watch me and my #Mercurial in \"Fast\" on the @NikeFootball App: http://t.co/1vNQPF9iHV http://t.co/4AHCM6kHFH http://t.co/KOWPEqeGb1 Great start of the season for Real Madrid with a win last night. Hala Madrid!  http://t.co/YtcqyCXuRX Tomorrow we'll play for the SuperCup. Post in Real Madrid Fanzone on Sportlobster &amp; I’ll follow someone #halamadrid https://t.co/8k4g3HDhkc Share your enthusiasm with millions of fans on @VivaRonaldo.Android http://t.co/nxhqWuFtRE iOS http://t.co/fgYWF5kmm2 http://t.co/AV6T1k7X9j Happy to take part of it #ALS #Icebucketchallenge @JMC_Foundation http://t.co/m2B3Sj1MEA Here’s an exclusive behind the scenes look at my Rankin X Ronaldo for #CR7Underwear shoot. Hope you all like it http://t.co/dbA29lKbJq Support your team by becoming a blogging correspondent on Sportlobster this season https://t.co/OpIkoL6P6N Great pic from a great night! #RealMadridSevilla #HalaMadrid #SuperCup Amazing kick off for the team. http://t.co/MasvAlA89p UEFA SuperCup Champions #RealMadridSevilla #HalaMadrid #SuperCup @realmadrid \n \n http://t.co/D4h0IYwBto http://t.co/9HamwVVn1V All set for the UEFA Super Cup final today #RealMadridSevilla #halamadrid  http://t.co/EgihUuNMPp http://t.co/0OINv1GqGq @Gunner_55 Greetings Ireland. @zarateimouri Thanks Sweden. Thanks @ImJamalhd and all the supporters in Denmark. @AndreeaRonaldo Hello Andrea. Thanks @Anax33_ A big hello to New York. Gracias @ApoyoCR7 #halamadrid Today’s training session @realmadrid \n \n http://t.co/yFZX0EzOsk Check out my Rankin X Ronaldo for #CR7Underwear film now on http://t.co/hvDVvAxU0p.  I’m wearing my favourite style from the new collection! Thanks @emirsoysaal. Hope to see all the fans supporting the team. @AinoaRonaldita7 Muchas gracias por el apoyo. @nataliesazzurri Here you go! Hello Australia. @NikolasRoufas Thanks for the support. @Ang7lita_ Bonjour France! @SoyTanKelly Hoy es el dia! Hola Kelly! @esttttttttther Por supuesto. Hola España!!! @_Bruno_305 Olá a todos no Brasil. Thank you @Luis_Sanchez4u #halamadrid @LipiRad Hola Paraguay. The beginning of the season is almost here. Go to the Spanish La Liga Fanzone on Sportlobster &amp; support your team http://t.co/ikXlzJt4zw Proud to launch my Rankin X Ronaldo for #CR7Underwear campaign! New collection now live on http://t.co/hvDVvAxU0p http://t.co/Fv6IwvEl1N With @SRod7 and @LilTunechi we introduce @euro and leak his music - https://t.co/qoGIHpJgQc\n\nDL here - http://t.co/JoSPjCLqvx You asked: Can you please say \"Hello Denmark\", idol?  http://t.co/7TqK9MuptK You asked: Un saludo a españa please idol? http://t.co/PCfMI794Yr You asked: Hi how are you ? http://t.co/HuWyMW8jsr You asked: Please say hi to Margareth in Peru. Hala Madrid! http://t.co/t8sWrAte2b You asked: Olá Cristiano! Podes dizer \"Olá Portugal\"?  http://t.co/EJq4tPgePg You asked: Kisses from Croatia! ♥ http://t.co/puHdzl5HOU You asked: Can you say hi to Minnesota http://t.co/JWKWOPEvBG You asked: I'm italian and you are my idol, please write me something😚 http://t.co/obGUQ3trQ0 You asked: Um ola para mim, Vanessa ?  http://t.co/L0hBmoWBPJ You asked: Can you say hey to your fans in New Orleans ?? http://t.co/i1n85b3ENg You asked: Please say hi to Daniel in Scotland http://t.co/mZpRA1HN2E You asked: Can you say hello to all the fans in The Netherlands? It would be amazing idol' http://t.co/59F3kIh49M You asked: Hello greetings from the US http://t.co/PKpyeHkMQe You asked: Hi Cris, can you say '' Hi Alyaa ''???? It would  make me the Happiest girl in the World http://t.co/WfbgNUbAkx Hoje é um grande dia para a Selecção de Sub-19, pois jogam a final do Campeonato da Europa.Estão todos de parabéns.Boa sorte! #forçaportugal @karstenholmen Hi Norway! @HM10719 Thank you Japan! @Ellewath @katieronaldo7 Hello to all the fans from Canada! @MishellGillen Hola Colombia! @Anthonysh_ Hello Venezuela. @amayesc Hola Honduras. Well thank you, @edsonovo Thanks @Aymen_rm Hello @Reeehhaam. How are you? Already in Dallas! http://t.co/JXAFrKSKIA RT @realmadrid: @Cristiano, premio Goal 50 al mejor jugador del mundo de la temporada 2013/14 http://t.co/6wwT6hdqXf #halamadrid http://t.c… Here it is! Exclusive behind the scenes from my new #CR7underwear campaign launching next week. Stay tuned! http://t.co/IHyD303vMv There have been news about changes on my management team - it's all false, and I can assure the team is - and will be - the same. Nice to hang out with the champ @FloydMayweather http://t.co/JG73hv6v0v Pre-season starts this weekend in the USA! Download the free Sportlobster App now and join the action https://t.co/TiosX2z9F0 @Fran_Oviedo Saludos Venezuela! @angela_mazur Hello to all the fans from Poland! @Dania_cr7kaka Saludos Honduras. @jaiorjye Hi Maria! @agung_yuda2 Hello Indonesia! @ilhamakabar @SFQ_7 Hello Sarah! @ErikaRonaldo_7 I'm good, how are you? @ArturoCris10 Thanks. You too. RT @SamsungMobile In surfing #Everydayisdayone. We're proud to be the first global partner of the @ASP http://t.co/PBeW81JrT0 @TiagoPires80 YMCMB with @jpn_pmo what you think @srod7 @liltunechi @euro http://t.co/qKVUgDuDZn Want to see an exclusive sneak peek behind my new #CR7Underwear campaign launching next week? Go to http://t.co/7QxpNHNVwW for details! Have you seen my #CR7emag? Lots of cool stories, videos and pictures. Like the story about Madeira, where I grew up. http://t.co/BCLS3ixS2G With my friend president Tsuyoshi Matsushita. http://t.co/sJ4pNRCvwd Thank you Japan. http://t.co/naZGJj9VJI  http://t.co/sosmztwEl7 Got #NothingtoHide? Prove it! Check out #exclusive behind the scenes shots from my latest #CLEARHair commercial http://t.co/SZbLqGBO6L http://t.co/Q1qnka2Q7f http://t.co/p5OznlLGS0 I'm on my way to... http://t.co/i69b8F8suz http://t.co/PDaPXw7gBq Woah! Thanks for an amazing ride #GALAXY11! See you on the pitch @Falcao! http://t.co/JkSRSseOSY  http://t.co/4Y85iqoUf3 Time to fly again.  http://t.co/Lp1daA1Xmu http://t.co/rWgx3yyec3 Happy to announce my newest range of products: Cristiano Ronaldo Footwear #CR7footwear http://t.co/6UXNEOxD5O Thanks everyone who voted and made it possible for me to win the @ESPYS for Best International Athlete.    http://t.co/lptBVXAh46 Enjoying another great sunset.  http://t.co/vVGMx8wS1O http://t.co/4Dt6ITAw5K Hey guys, my digital magazine #CR7emag is now available for free. For iOS and Android. Download it here: http://t.co/pgklp5bLwu Spa at night.  http://t.co/D3QgvRDXCi http://t.co/r1r63zZqTV Sportlobster is running a cool football competition. Post your photos on http://t.co/1xxKPctVt6 &amp; win my signed shirt http://t.co/aOqy0JH3La RT @nikefootball: Your game. Our world. Get the Nike Football App.\nGoogle Play: http://t.co/yFzJ3nHYIO\niTunes: http://t.co/JrrAo85qjq\nhttps… The lucky TOPwinners are now boarding to Rio de Janeiro to watch the big final. Have fun guys. http://t.co/G1KIPLSNgU http://t.co/icf55FCwOo Morning ride.  http://t.co/IwAvmwGnbM http://t.co/Ez5erovgHk Hey guys, I'm nominated for @ESPYS Best International Athlete. Have you voted your favorite? http://t.co/iIGw9iroqG http://t.co/8GudD1CdeL Are you the world’s biggest football fan? Share a photo with #PassionPulse! #GALAXYS5 http://t.co/dcko3wDHZX  http://t.co/BxBsn6z8sO Avó, estás sempre no meu coração. Descanse em paz, beijos de todos os netos. http://t.co/rwa8qBPJPu Don Alfredo leaves us, but his memory will last forever in our hearts. Legends never die. Thanks for everything Maestro. #EternoAlfredo It’s a very sad day. For me, for all the madridistas, for the world of football. #EternoAlfredo http://t.co/VKRbSmO61s I am excited to announce that I am launching my first #CR7shirts collection towards the end of this year. Check out http://t.co/VUOf12hIBr Happy to meet Dsquared brothers yesterday. http://t.co/P4LHFIvlIK http://t.co/K1JbACiXbK My favorite #CR7DriventoPerfection video.Don't ever lose your drive @david_alexi,you never know where it'll take you http://t.co/sccLlTJcTj Starting the holidays playing with the sun in this landscape. Thank you for the support during all season. http://t.co/0BnVLx9o4Z The second Topwinner who will fly to the Final in Rio is Anna Marcus. More games &amp; prizes: http://t.co/5GyKd3CIa1 http://t.co/7yFTfNqkzo First winner Fazil Terriche will fly to Rio! You can be the next! Last chance! http://t.co/u6Nt0apHMv http://t.co/2Yuq1ThuE5 You asked: Please say 'Hello Ben' You are my favourite player of all time! http://t.co/AV0FZyXSBn You asked: Por favor Cristiano me podrías decir \"hola Macarena\" me haría muy feliz.  http://t.co/KcttYB5E7W You asked: Your my idol, say \"hello Ciaran\" I'm from Ireland :) http://t.co/8se0EwgBzm You asked: Please say 'Hello Jordannah' I'm from Wales and you're my idol :) http://t.co/511ZWDq5Np You asked: Hi, i'm your fan #1 in egypt , can you say me hello ? http://t.co/RxyyOUIxvx You asked: Hi Cristiano! I'm from Portugal. Can you say \"Hi Mariana\" to me?  http://t.co/rUTQdB9ydw You asked: A hello to peru please? http://t.co/pSWhsNVovQ You asked: Hi Cristiano,I'm from Italy,can you say'ciao Federica' please?💕 http://t.co/qmcRbmbjFV You asked: Hi, i'm your fan #1 in Paris, can you say me hello?  http://t.co/fjgpOVPTcL You asked: Hi crisitiano, im a huge fan from canada, can you say Hi please?xxxxxxxx http://t.co/mCXinzRtWX You asked: Can you say Hi? I'm your fan #1. I dream of seeing you again someday. Greetings from Paraguay http://t.co/abEu45BUdB You asked: Hello Cristiano. I'm your big fan from Russia. How are you? http://t.co/5PbV6ZcRyi You asked: Besides football, which other hobbies do you enjoy? http://t.co/UNv6q3NRv9 You asked: Can you send me a picture on you when you playing football in CF Androinha? http://t.co/akciAWNuHz Congratulations Fazil Tarriche.You won 2 tickets to the Final, Brazil!Be the next, last chance http://t.co/sJfQpcsnOA http://t.co/u1g6YwUbB5 Already in Manaus. #forçaportugal #nationalteam #worldcup http://t.co/wawZ7T0arK Listening to this song before the game in space... I'm going to fly on the field! #GALAXY11 http://t.co/asROcP0FFg Help me and @FALCAO show those aliens who's boss! You could win big! #GALAXY11 http://t.co/o4yC9WUEO1 Hoje, quando a nossa epopeia finalmente começar, seremos muito mais do que 10 milhões... http://t.co/CxNgIG0a7a http://t.co/1AvvlOyYgv Go get the 2 all-in tickets to the Final in Brazil!  http://t.co/QcRcJwRgGt http://t.co/McvEky8Bgz Check out what happened behind the scenes of my BESA campaign with Anselmo Ralph. https://t.co/JKI99BNMW1 Met brave #NYC kids who survived Superstorm Sandy and are helping other communities with the help of @SavetheChildren http://t.co/ROkDO7Y5nE RT @nikefootball: The #Mercurial Superfly designed by @Cristiano for his biggest fan @7cristianorb. Get yours: http://t.co/YO65Aym1gr http:… What a great first training session and day yesterday.  http://t.co/3HmGPTfzXb What a wonderful and warming reception we´re having in Campinas. Thank you everyone #forçaportugal http://t.co/QsUcMga4VZ RT @cr7_jao: #ForçaPortugal, @Cristiano espero que esteja gostando de Brasil. Boa sorte nessa copa @Cristiano! RT @KristenDAlmeida: FORCA PORTUGAL!!! FORCA @Cristiano! RT @PaulaLitaiff_: @Cristiano Sejam bem-vindos! Espero que gostem daqui! E boa sorte nos jogos! Estou torcendo muito por vocês! #ForçaPortu… RT @CRonaldoNews: Brazil loves Portugal! @VivaRonaldo http://t.co/iS1UpUNIcp\n[@edmacieldesa] With my brothers @SRod7 y @euro , big things this year, \"Don't €xpect Nothing\". http://t.co/VT5piu27jc Insane first half against the aliens! @Falcao, we'll show them how we play football! #GALAXY11 http://t.co/z0FzRHz6gG http://t.co/pGJ4F1AcO0 I’m in Brazil. Want to come here and see the Final? Qualify for 4 signed team shirts here http://t.co/QcRcJwRgGt http://t.co/HZS2KjtG4P #ForçaPortugal. E obrigado @7cristianorb @CRonaldoNews muito obrigado e #ForçaPortugal Muchas gracias a todos @CR7StrongChile Obrigado @CRonaldoFever pelo vosso apoio. Obrigado @LukinhasMendes7 Hello guys, we arrived in Brazil. Any fans from Brazil over here? http://t.co/q7UUO2Vk5f Risk makes the game beautiful. http://t.co/WnJfvhjwIM @nikefootball #riskeverything Do you want to see me singing with Anselmo Ralph? Check out http://t.co/E7NWTTYgOZ Força Portugal! http://t.co/yUJUpuQbv9 The world is waiting.  I’m ready for 'The Last Game’ June 9th! @nikefootball #riskeverything http://t.co/wrgm8gYBsx Come support Portugal against Mexico tomorrow at Gillette Stadium #ForçaPortugal Check out the blog I wrote on Sportlobster, a personal message to my fans ahead of Brazil. Hope you like it! http://t.co/PlQgFRjaMj I'm driven to perfection. Are you? Show how by posting a 15s video or pic tagged #CR7DrivenToPerfection. Learn more http://t.co/csJmFznT9Z RT @IFC_FIVES: THE CHEIF SCOUT SHOWING OFF HIS SILVERWARE\n#AllHailDaCheifScout http://t.co/9wEn1egy9o RT @KingOfFive: @Cristiano @IFC_FIVES @ThecatPaul thanks for meeting us on Saturday your a great guy it was a special moment for us http://… Round Two is on. If you’re a football player, sign up your team now on http://t.co/LSCjChaEww It was a pleasure to invite you to the game.All the best @IFC_FIVES and hope to see you for Round Two @GAMEbyRonaldo http://t.co/f8kJbjsDEA Congrats to @IFC_FIVES from London for winning Round One of @GAMEbyRonaldo!It was great meeting all of you in #Lisbon http://t.co/Omj7yY2K88 Today Brazil game starts! You’ll be surprised on http://t.co/qvWsCbE1mp. All-inclusive trip to the Final. Go play it! http://t.co/RrFOjg8VBt A team representing a country! #ForçaPortugal http://t.co/a8ywntsZwm Leaving Portugal to prepare for the WorldCup Brazil. With open arms to the world, go Portugal! http://t.co/e7lR3eCDzX http://t.co/5AOWhIIizp Happy to spend Children's Day with my son. http://t.co/jFVpmFWaZO You've never seen me play like this! http://t.co/TI0lNisaBw @nikefootball #riskeverything Hey guys, check out the new cool wallpapers on my website. http://t.co/MGroCC4ZQO  Were you one of the winners of my #CR7underwear competition? Check out!\nhttp://t.co/iETJySmqKa Very soon @Sportlobster will reach a million users. To celebrate I will follow the millionth user, will it be you? http://t.co/Eg4C2TJsxf You asked: Hola Cris, saludos desde Ecuador, éxitos en el mundial, eres el mejor. http://t.co/T9aqKhOxBo You asked: Can you say \"Ciao Chiara\"?I'm italian :)  http://t.co/tFIb5fDaLq You asked: Say hello to me and my cousin Nicholas, we are huge friends! My name is Brianne :)  http://t.co/JRFEIHBbi0 You asked: Can you say hello to me?  My name is Narin and I am from Germany http://t.co/lx2CRb3xwh You asked: Can you say hello to me?? \nMy name is Maria :)  http://t.co/ysDCHUnsHE You asked: Hola idolo, como estas? Puedes saludarme? Me llamo Mayra y te apoyo desde Argentina idolo! http://t.co/d8n3uIdcvp You asked: Olá, poderia mandar um abraço para uma grande fã do Brasil? :) http://t.co/swyeKUBQEV On June 3rd, play for an exclusive trip to Brazil: win top seats for the Final and much more. http://t.co/JEIdecR34r http://t.co/uvXJMMgWxi Download the official song of the Portuguese National Team by @Kikamusicnet produced by @RedOne_Official http://t.co/PWgN0Oe9zq Here is the official song of the Portuguese National Team for the World Cup, performed by Kika. So uplifting! https://t.co/dd8pgpY1uB Today, the Sun publishes an interview with me that I never gave. So its content is pure fiction. Behind the scenes of the @TAGHeuer Shooting, guess which model I chose? http://t.co/CxGiE8uqqt Next week the National Team will be in the USA preparing the World Cup!First up, Mexico at Gillette Stadium, June 6th.Come support Portugal! Relaxing time. http://t.co/raVxPbnQoV Taking a break to play the new #GALAXY11 Striker Soccer game. Who's got next? http://t.co/RyoDChFzIA http://t.co/3InIC2Amsv Thanks for the support @WayneRooney. Crazy days these last ones! Play soon for an exclusive trip + seats FINAL Rio, Brazil!  Follow @TopWinGames &amp; register for a signed Team Shirt. http://t.co/dHLdBiUjLv We’re Champions of Europe! I’m living a dream! Thank you all! #halamadrid #UCLfinal #lisbon http://t.co/fJxbG49ET3 http://t.co/pw3qx8QX8P La Décima is ours. Hala Madrid! #uclfinal #realmadrid #lisbon http://t.co/q0NPEFAJCD Let's go team #APorLaDécima!  http://t.co/vkRzCNCFbp Tomorrow will be a dream come true to play the final in Portugal, my welcoming country. http://t.co/kyfsGYcWG3 http://t.co/AG4Pymxsjz In the biggest game against our closest rivals, there is only one option. #riskeverything http://t.co/yi5EdBw7bd Acabei de fazer as minhas previsões para o R. Madrid vs. A. Madrid no #VivaRonaldo. E tu? @VivaRonaldo http://t.co/ZQmCmauqWF Saturday we’ll play #APorLaDécima. Cheer for the team and predict the result on Sportlobster http://t.co/4aMqGX2y84 Hey all @realmadrid fans! Come cheer us #APorLaDécima. Your support is our strenght.  http://t.co/qPVmohXb81 Would u like to fly to the final in Brazil?Pre-register: http://t.co/qvWsCbE1mp &amp; qualify to win a signed Team Shirt. http://t.co/KM5VlsyeFP Training for the final on Saturday! #APorLaDécima @realmadrid  http://t.co/Z72YgacX6A Brazil here we go! #ForçaPortugal http://t.co/obmHyrPSFq You asked: ¡Hello Cristiano! Can you greet me.\nYour great fan from Mexico. http://t.co/bfYAsVsnkw You asked: Hi Ronaldo! I love you so much! Please say hello to me! I am from Turkey!  http://t.co/xpDH5Ppb67 You asked: Hi Cristiano! how are you? can you tell me \"Hello\" Sofia ? http://t.co/6mfqyXGhw4 You asked: Hola Cristiano, puedes saludarme 'Hola Tito'? http://t.co/UyMAMFIcs6 You asked: Can you say hello to me.My name is Elbasan. http://t.co/rjLrrZrRA6 You asked: Hi Cristiano, I`m a big fan from Norway!  http://t.co/7AImrp67aW How fun it was to be part of this new commercial. Check out what happened behind the scenes. http://t.co/urSaitfD3X Hi guys, @VivaRonaldo is giving away 2 shirts signed by me! Check http://t.co/UPqous7vfv for details. #APorLaDecima http://t.co/MjB6ygOeyR Proud to be an ambassador for @sportlobster! Football is my lobster - #WhatsYourLobster? http://t.co/Eg4C2TJsxf http://t.co/i9lYACl80d Great day shooting Rankin x Ronaldo for #CR7Underwear with @rankinphoto. Can't wait to show you the new collection! http://t.co/f9z67i6CDW Know how it feels to be a winner!Pre-register at http://t.co/qvWsCbE1mp and qualify to win a Team Shirt signed by me. http://t.co/lM0IUhJAwf Hey guys, have you checked out the different Fanzones on Sportlobster? Choose yours &amp; follow me http://t.co/Eg4C2TJsxf Hey, @Falcao, how crazy was training today? Have you ever gone against an 8-arm goalie before? http://t.co/GqKBymkaXx Morning training session @RealMadrid  http://t.co/d6NJfswlRT I am pleased to see 95% of fans have predicted a win on Sportlobster. Have you made yours yet? http://t.co/Eg4C2TJsxf I've been training with the best to take down aliens &amp; save the world. Stay tuned\n #GALAXY11 #GALAXYS5 @SamsungMobile http://t.co/mtJbofTqAo Sabem o que quer dizer CR? Não é bem o que estão a pensar. A D. Inércia do BES diz-vos. http://t.co/EPrF7wRcp0 There are only a few days left to win one of the 5 pairs of #CR7Underwear trunks signed by me! Go to http://t.co/Vlium6Y7de to enter! Não imaginam a pergunta que a Dona Inércia me fez. Vejam em http://t.co/Ole5EkkrcS I’m pleased to see I have so many followers on Sportlobster! Stay tuned, I’ll be following some fans. Will it be you? http://t.co/Eg4C2TJsxf But stay tuned, because there's a lot more to come from @GAMEbyRonaldo You can join now at http://t.co/LSCjChaEww A round of applause to International FC @IFC_FIVES for winning Round One of The GAME by Ronaldo. Congrats guys! http://t.co/agBwu49nED Check out how @nikefootball revealed my new Flyknit Mercurial Superfly boots last week. http://t.co/rVxH0eXDt3 #riskeverything O que é que eu e a Dona Inércia temos em comum? Descubram em http://t.co/O7HezUz2bq Go to http://t.co/TNKh5Ybdvy for your chance to win one of the 5 signed pairs of #CR7Underwear trunks. Good luck. http://t.co/IRkObPoMoK Living a dream - Lisbon here we go - thank you all for the amazing support #roadtoLisbon#HalaMadrid. http://t.co/iDWw1fJdtl Check out the gift I got from @TAGHeuer. This TAG Heuer Carrera really suits me! What do you think? http://t.co/zaKi6hlSzP Winner stays! http://t.co/qaf6ZH6Z0F @nikefootball #RiskEverything Such an honour to be one of TIME's 100 most influential people. http://t.co/BCMj7q0V0u And even after May 1st you'll be able to continue playing on @GAMEbyRonaldo. So stay tuned at http://t.co/LSCjChaEww Last days of Round One guys but this amazing championship has more to come! Stay tuned join at http://t.co/HRFXiaMed1 http://t.co/StYyWrSCCL @VivaRonaldo Thanks guys. Good to be back on the pitch, specially with a win against Bayern. One step forward to the final. #RoadToLisbon http://t.co/aYS7mOaSHR You only become a giant by making them fall. #RiskEverything http://t.co/q5emYFofxO Do you know Sportlobster? It’s a great new social network just for sports. Get the app and follow me here. http://t.co/Eg4C2TJsxf You asked: Can you say hello to me ,please? I am from Bulgaria!!! http://t.co/dyNj55sAq4 You asked: Eres un gran jugador pero aún mejor persona. Saludos desde Alicante :) http://t.co/Pnpk2TPumA You asked: Olá Cristiano ¿Como você está? Saudações da Argentina. Eu te amo ídolo @pato_sardelli01 http://t.co/SmeZWk0y9z You asked: I'm your #1 fan from England! Please could you possibly say \"hi Noah\" ... @noahjlyons http://t.co/OqrBd1Q3BC You asked: greetings from italy! @robertocolelli1 http://t.co/BY867ALt87 You asked:Hello Cristiano!Could you please say hi to all madridistas here in Honduras?:) @jessiarita http://t.co/4dcJahSCAT I've scored 14 goals in the Champions League. Can you do the same in CR Footy? Try it for free http://t.co/H9KsjZtCC6 http://t.co/kMLiARAjv7 Download the #CR7emag to check it out. Available in Android http://t.co/1RV43Kkn1w and iOS http://t.co/XcSbpkpEut He awoke from a coma while listening to reports of Real Madrid games and came to Madrid to meet me.  http://t.co/rLQiFgIoPo Do you wanna know more about the touching story of 14 year old Dawid? http://t.co/9ptXodoLVx What an incredible night! Thanks to all the fans who celebrated with us. #CopadelRey http://t.co/gdklCrp9lu First title of the season. #FinalCopa #champions http://t.co/iMg6HEJSfW What an exciting #FinalCopa! We are the Copa del Rey Champions. I'm proud of the team. Hala Madrid! http://t.co/yqLykmUbAu RT @aarbeloa17: ¡Los refuerzos van de camino! ;)\n¡¡HALA MADRID!! http://t.co/c6JfyevYis Tomorrow is the #FinalCopa del Rey. Let’s all support the team! Hala Madrid!  http://t.co/4tahjhyRRP Check the @GAMEbyRonaldo standings http://t.co/RtdieKqlHV What's your favourite team?Who will win? http://t.co/SIATgEvFRc A big shout out for all @GAMEbyRonaldo players and teams playing on Round One. Good luck for this final stretch guys! http://t.co/XCxymTOpZL Welcome back Khedira!  http://t.co/8fwxnFv9q1 Flying with @Emirates is an amazing experience, you never know who you’re going to bump into. Watch and share: http://t.co/TzaC5Pxbfz Congratulations @branditportugal . Keep up the good work. http://t.co/0g4hRpmnxL  http://t.co/qkyZTPueMX Have you seen the fan portrait of @ApoyoCR7 in my #CR7emag? Maybe I will choose you for the next issue. Check it out. http://t.co/M9p7zbmUNu Check out my @nikefootball #Mercurial Vapor IXs http://t.co/i0CpT2USSR http://t.co/8EU0H1arPH RT @VivaRonaldo: Let's all support this Portuguese Human Rights campaign on Facebook! http://t.co/lG5r3kcUrH Another step in the competition. The team is now on the Champions League semi-finals. http://t.co/bFW6uqr5fs Enter the #CR7emag competition to win a Meet&amp;Greet with me. Download it and take your chance! http://t.co/pkhEHkOgHL http://t.co/qVPAvXF5m5 You can also sign up using @GAMEbyRonaldo mobile apps. Download them at http://t.co/LgwDTXSqAv http://t.co/88vB7zMmRA Have fun! Just to let you know that Round One of @GAMEbyRonaldo is running until &gt; May 1st &lt; Join at http://t.co/HRFXiaMed1 http://t.co/QpURWaU98D Every challenge is a new chance! Be brave when you step on the pitch. http://t.co/zklIEWEN5H #riskeverything @nikefootball Come support Portugal vs Ireland on June 10 at @MLStadium. It’s Portugal National Day. http://t.co/IrVnQPZNmg http://t.co/Sa8V91zO7o You asked: Can you say Hay? I am your #1 fan from Croatia. @69withjustinlol http://t.co/eKutueSpmP You asked: Hello Cristiano. I'm a huge fan from maldives. Please say hi. http://t.co/9UR0AtPAxj You asked: Ronaldo can you say hello? Im your #1 fan, in from México  http://t.co/ArUIEuv4nQ You asked: tu felicidad es lo mas preciado que se puede tener. Saludos desde Perú. @idolocristianor http://t.co/ArquXIqaUt You asked: Podrias mandarme saludos a Almeria ?@ainoaronaldita7 http://t.co/p1CLyXV5EM You asked: If you just say \" Hello Raphael \" Will be the best day of my life! @7cristianorb http://t.co/qmoaF3ORQy You asked: Hi Cris. How are you? Greetings from Argentina (: @felimasrierarm http://t.co/p24bGGmbvU I’ve lived to play football since I was a kid. My dreams became real but I never forgot where I’m from #Madeira http://t.co/yUWDYRhPtR. Great shoot day for #vogue with @mariotestino @carlynecerfdedudzeele @theirishayk http://t.co/a8DB4h9P21 Hey guys, never let anything stop you! Step up to every challenge! @nikefootball http://t.co/SOXk7MjGwH You will never guess who I bumped in to on my @Emirates flight. Watch my new film here and share #AllTimeGreats http://t.co/8mThMvgsnk It was great meeting you at the stadium on Sunday @cristianodane. Thanks for entering my #CR7Underwear competition! http://t.co/7rXGExXkxo Hello all, have you checked the #CR7emag with lots of unpublished and exclusive content? http://t.co/9QrpsOVL0C http://t.co/pgklp5bLwu Hey team! Do you want a ride for the training session? http://t.co/dLNwRsbPdU Hey guys, it’s #WorldWaterDay. #iLoveWater.Appreciate it and make a difference with @drop4drop http://t.co/5uniflFf2o http://t.co/T4ibiO2cvi Check out the real time stats for tomorrow’s Real Madrid-Barcelona match here: http://t.co/aIygf3Txn9 by @OptaJose Dinner time. http://t.co/NsEW4Ve8AA Nutrition is a weapon for me.  It’s an honor to be part of the @Herbalife family...many good things to come. http://t.co/VIqxwAX1ar Acabei de fazer as minhas previsões para o R. Madrid vs. Barcelona no #VivaRonaldo. E tu? @VivaRonaldo http://t.co/ZQmCmauqWF Real Madrid will face Borussia Dortmund on the quarterfinals of Champions League. Let’s go team!   http://t.co/z7QQbgTcV3 Thank you all for making CR Footy the #1 sports game in 23 countries! Hope you enjoy playing! http://t.co/dvB0khDvli http://t.co/J5EzHggdC8 Ask me questions on Mobio and I may answer yours!  http://t.co/MISNSmyZgz Victory for the team, we are now qualified for the quarter-finals of the Champions League!  http://t.co/fwWbJFt4Ed Acabei de fazer as minhas previsões para o Team CR vs. Schalke 04 no #VivaRonaldo. E tu? @VivaRonaldo http://t.co/ZQmCmauqWF Training session before the match against Schalke tomorrow. http://t.co/LQ04XcvyXX And don’t forget to download the @GAMEbyRonaldo mobile apps - http://t.co/LgwDTXSqAv - http://t.co/88vB7zMmRA Glad to see many teams and players already having a good time playing with each other @GAMEbyRonaldo. Good luck guys! If you have a team with friends sign it up on my championship @GAMEbyRonaldo It's a great way to enjoy real football. http://t.co/S3JNhziUQQ The new mobile version of Cristiano Ronaldo Footy is now live. Download it free! http://t.co/JthqSHYeD2 @AppStore http://t.co/jp2a4Veh6G Thank you @imVkohli for your kind words.Glad to be part of the @Herbalife team with so many amazing athletes like you http://t.co/QPh0Jk6jNf The last Cheer event on @VivaRonaldo was great! Congrats @LukinhasMendes7. Thanks everyone http://t.co/Khz0u9NWGP” http://t.co/5YSQPLUXbi I stand #withSyria. Innocent children need our help. Learn more about @SavetheChildren here http://t.co/kU3uuddXIr http://t.co/SnU5i92Dhm Get my new mobile game Cristiano Ronaldo Footy for free! http://t.co/Ym4IaBnWsj @GooglePlay http://t.co/NWLns45p9P Hi guys, who wants to join me in space? Suit up for #GALAXY11 and help fight for Earth! http://t.co/sCrwGj2jSa Take a look at this “Sport doesn’t care” video. Sport makes no distinctions. https://t.co/W9GisucQ5D You asked: Any memorable fan you have met so far? @cr7dabest1 http://t.co/ztOyPfhP13 You asked: Ronaldo Can you tell me hello ? http://t.co/QfOtUSJAy8 You asked: Do you like Greece??:-)\n http://t.co/L23btlKvPw You asked: Favorite place to travel? http://t.co/tnsN8h4Cgv You asked: hi,do you have any brothers ? http://t.co/zxJi0GL1XN You asked: Can you make my dream come true by saying something to me? @hasna_x1 http://t.co/RGIvkzdVi7 You asked: Top 3 songs you love at the moment?  @rosiepaynex http://t.co/J7ODh9fmUV You asked: What was your first tought when you won Ballon d'Or? @realmadrid27277 http://t.co/nxVmcSXa61 Great game for the National Team last night #forçaportugal  http://t.co/BszdacUv9F Acabei de fazer as minhas previsões para o Portugal vs. Cameroon no #VivaRonaldo. E tu? @VivaRonaldo http://t.co/ZQmCmauqWF É uma grande honra apresentar o nosso novo equipamento para jogar sem medo. #jogasemmedo http://t.co/PVxCcXTAmZ http://t.co/WPFM7xWVfl RT @SRod7: indeed “@XXL: .@LilTunechi Signed @euroneverlies After Listening To One Verse http://t.co/HevkIoWQD3” Have you seen Sir Alex Ferguson exclusive interview on the #CR7emag about my time on @ManUtd? Take a look. http://t.co/pkhEHkOgHL RT @iAkshayMotwani: Just purchased #Cr7emag , it is a really wonderful gift for us. Gracias @Cristiano. You are our Idol. RT @Angamzamzam: @Cristiano #CR7emag is just a must-have! Its amazing and thank you so much for sharing all those stuffs with your fans! RT @HyoGary: Just purchased #CR7eMag..it is so amazing to know everything that i never seen before..thank u for sharing it with us @Cristia… RT @JuinmaLopez: @Cristiano #CR7emag Sin palabras.. Es genial. Felicidades. RT @SmileLikeCR7: @cristiano i love the new #CR7emag .. So cool :) RT @Lucia_4590: @Cristiano #CR7emag está genial, lo amo, estamos orgullosos de ti Cris, Buena suerte ídolo. RT @mipm_: @Cristiano acabo de conocer #CR7emag y está fenomenal! RT @CRonaldoFever: @Cristiano I loved your CR7 eMag!!! It is amazing! It was so good to be able to see the backstage of BdO, interviews wit… RT @ApoyoCR7: @Cristiano I'm so happy because I'm in your magazine (Paula) and i love your new magazine!! :) RT @Daniel_Nilsen: @Cristiano I love it! It looks amazing :) #cr7emag RT @aydashkaa: Congratulations @Cristiano with launching #CR7emag! It's really great! So proud of you! RT @BlossomJose: Omg just purchased the #CR7emag @Cristiano I love it, it's amazing http://t.co/0ZYoTxGLwo RT @dmtcr7: @Cristiano nos gusta #CR7emag. Today I’m launching the #CR7emag with lots of behind the scenes and really cool exclusive content. http://t.co/pkhEHkOgHL. Hope you like it! What a night! A great result leads us one step closer to the next stage.  http://t.co/7jvMv8S1gJ Big game coming up tonight. The team will play for the Champions League. Hala Madrid!  http://t.co/H9Imz2j0Ha Acabei de fazer as minhas previsões para o Schalke 04 vs. Team CR no #VivaRonaldo. E tu? @VivaRonaldo Hey guys, I’m preparing something really cool for all my fans that I’ll share with you very soon. Stay tuned. http://t.co/Ih4dWbFEVD Well done, team! Hala Madrid!  http://t.co/oazpT5x8rf RT @RealMadridxCR7: @Cristiano It looks AMAZING! We're proud of you, idol! RT @ApoyoCR7: @Cristiano that's nice, i like your new website :) RT @SavetheChildren: Check out @Cristiano's new website to see which children's organization is part of his team--&gt; http://t.co/Xd9nRqBMUo … Thank you for all the posts you shared on the Fanwall on my new website. They are really great! Keep sharing here: http://t.co/nmncWFLZbK Hey guys. Have a sneak peek of an interview I gave with my friends from @jacobandco. Are you curious? http://t.co/CQN73esf61 Today I’m proud to present you my new official #website, a little gift for all of you. Welcome to http://t.co/eS6wZHvHb4. What do you think? Loading... http://t.co/QzI7FU6myn What a great match! The team made it to the final of Copa del Rey! Hala Madrid!  http://t.co/0Kz4hCRb5f RT @VivaRonaldo: Calling all #VivaRonaldo fans: we need your help to win a Shorty Award now! :) http://t.co/vdFlsCbLHr Your participation on the Happy Birthday event was fantastic! Congrats @OlyaUrban96. Thanks everyone for the support. http://t.co/H45y94JVV8 It was fabulous to celebrate my birthday yesterday with my friends and family, I had a great time. Thank you all! http://t.co/bA3KqNp6rz RT @Dynamomagician: Birthday celebrations for my bro @Cristiano in Madrid! Amazing night! http://t.co/mXeGhM0EjS Thanks @Dynamomagician, you're fantastic! Check out the video below, sign up and let’s make some great matches people. How far are you willing to go? http://t.co/ZU34oYvAPV Hey footballers! Sign up your Team on @GAMEbyRonaldo the most exciting football competition of the moment. Step up to the challenge. Great photos from the fans last night at the stadium. Thank you so much http://t.co/MyyGgpU0a9 The team did a great match last night! One step closer to the Copa del Rey final. Hala Madrid! http://t.co/AYvtXaupMm Thanks @allanation428. It looks really nice! Thank you so much @amalyusof_ Thank you for the birthday present @Ibra_official. It will look better on me than you though. Hello Paris! Thank you @_Sofiaaane Thank you @Ekivicky. Greetings to Indonesia. Gracias @gxlm20 Thanks @KoloBentivenga Muchas gracias @Cristiano7_AF Thank you @yungjenn_ Acabei de fazer as minhas previsões para o Bilbao vs. Team CR no #VivaRonaldo. E tu? @VivaRonaldo #FF @officialpepe @fabio_coentrao @falcao @JoaoMoutinho Very good news about my young friend Guillermo. With your help he found a bone marrow donor! Thanks everyone, let's keep helping other kids. You asked: Can you PLZ say HI to my son Peyton who is a huge fan...... @01wes http://t.co/4m0XSesEDR You asked: Out of football what is your most preferred sport? http://t.co/GoXHeHPwG5 You asked: Can you say \"Hello Sara?\" it would literally be the best day ever!!! @ianseyes_xx http://t.co/qSuR6SBwOt You asked: Can you post a picture with you latest football award! @mitchapalooza80 http://t.co/A5Il0j2SXU You asked: Picture of you playing soccer as a youth please. @michaelmooreluv http://t.co/aT5czZeFOD The team reached its goal. @realmadrid is now on the Copa del Rey semi-finals.  http://t.co/yekq15VHgg Download the apps, schedule matches, update results from the field. Your GAME happens everywhere! http://t.co/KKK1WfGQnV Hey guys @GAMEbyRonaldo is now available for Android http://t.co/U3ObWhO10U and iOS http://t.co/2SjsD6DG9e. Check them out! Share a photo or video on http://t.co/NfLwVV8dbW! I’ll pick my favourite &amp; post it on my FB and Twitter. @VivaRonaldo http://t.co/C8OL52VTpC Sign up on http://t.co/IWx8rh7TEf, go to MATCHES and schedule Real Games with other Teams. How far are you willing to go? Attention: @GAMEbyRonaldo Round One is NOW OPEN to everyone! Let the GAMES begin! http://t.co/y4IFJwzh16 Today I shared the Ballon d'Or with the Real Madrid fans in the Bernabéu. This award is also yours. http://t.co/dSz6SgqIm5 Last training before the match done! Tomorrow we’ll face Granada.  http://t.co/X12q1ov8L8 Acabei de fazer as minhas previsões para o Team CR vs. Granada no #VivaRonaldo. E tu? @VivaRonaldo @domingosrebeiro Um abraço para Timor Leste. @deep_xxx27 Hello Japan. @cabisanha Bom dia! Abraço para a Guiné-Bissau. @cr7rishab Thank you so much. Couldn’t do it without the support of fans on Twitter. @Hasna_x1  Hello, how are you? Hope you’re good. One step ahead in the Copa del Rey competition! Now comes the second leg in Madrid! http://t.co/Q3G4rJjHNU Today we’ll play for the Copa del Rey against Espanyol. Let’s go team!  http://t.co/SjmhyOvF7g Going to start using Mobio! Ask me questions and I will answer some! http://t.co/YXDyH21Vhm Such an honour to receive the grade of Grand Officer of the Order of Prince Henry the Navigator. http://t.co/RHhpzc9KTx Acabei de fazer as minhas previsões para o Betis vs. Team CR no #VivaRonaldo. E tu? @VivaRonaldo Here we go to the quarter-finals of Copa del Rey. Hala Madrid! http://t.co/jAhW4LWgGC Obrigado @Pedromsantos75. Estamos juntos. Thank you @mobily. It’s an honour to receive this award. @Cr7Marcielle Muito obrigado pelo apoio. 69 goals. 8 hat-tricks. 41 wins. But that was last year. #justdoit \nhttp://t.co/LEc1FBfZlJ @samallamaaa I'm very, very happy! @Iam_SamAdd Thank you. Shout out to my bro's @LilTunechi and @SRod7 thanks for the support. @CeheginJose Muchas gracias! @ThamjidNoushal It's a great feeling! @zainal_audio Thank you. @HerreroManuel88 Muchas gracias a todos. @GouadriaMahdi Thanks for your support. It means a lot. Este premio es de todos. De todo el equipo y staff. Y de toda la afición! http://t.co/DE2gvhObdD @FALCAO Muchas gracias, Falcao, es un orgullo. Very proud to win the Ballon d’Or for the second time, it means so much to me. I thank my teammates. http://t.co/INcV1VjgDx Great fans lead to great moments. Thank you!  #BallondOr2013 http://t.co/V0nAR3pcfA @Donejack94Gamil I’m good how are you? @baharCR7 What’s going on? Everything good in Denmark? @debvC07 Hola! Estoy bien y tu? Saludos a los fans de Colombia. @amatta16 Hola Honduras! @Rafgonzz_21 Hola Venezuela! This win against Osasuna leads us closer to the next stage of Copa del Rey. Hala Madrid! http://t.co/FHl503P1Yz Acabei de fazer as minhas previsões para o Team CR vs. Osasuna no #VivaRonaldo. E tu? @VivaRonaldo I dedicate these 2 goals to you Eusébio but in fact you were the one who scored them. You'll always be in my heart. http://t.co/VDbTBIOzPG Always eternal #Eusebio, rest in peace http://t.co/n25X0q9rfF It’s with an indescribable feeling of pride and honour that I’ll be distinguish Grand Officer of the Order of Prince Henry the Navigator. Great start in 2014 with a win over PSG. Hala Madrid! http://t.co/Xqvn0j3YBm Thanks @ESPNFC for this award. It's an honour. RT @ESPNFC: After a combined vote of ESPN FC readers and staff, we are proud to announce that our “2013 belonged to” award winner is @Crist… Getting ready for next year with the last massage. http://t.co/bNRTKrHXiE 2013 was like this, let’s welcome 2014! \nhttp://t.co/iUv3Ke2Q23 Happy to win the Globe Soccer Award for Best Player of the Year. Thanks for voting in me. http://t.co/R5dawIRIn5 Enjoying some family time in the aquarium. http://t.co/KyUGlEIh7A Hey guys! Merry Christmas everyone! Hope all your wishes come true. Hey guys, this year was great, but the next one will be even better. #justdoit http://t.co/Y07kB7uRTo Acabei de fazer as minhas previsões para o Valencia vs. Team CR no #VivaRonaldo. E tu? @VivaRonaldo Pieces from my #cr7underwear collection will be some of my Christmas gifts.See the whole range http://t.co/pNFRl7zF8G http://t.co/7SVaOhiUci #FF @apoyoCR7 @daniel_nilsen @albaaG7 @cristianodane @minironaldo19 @7Nerea Hey guys, #FF @vivaronaldo @gamebyronaldo @cr7underwear @savethechildren @jacobandco Hey guys, I was nominated for Globe Soccer Fan’s Favorite Player Award. Vote here http://t.co/jVLk0LmQ9W or here http://t.co/BH13xqIuMK. Citizens of Earth, get ready for the game of a lifetime. #GALAXY11 has the world's best, ready to defend our planet! http://t.co/UGu1KoDxx2 Xmas season is open on @VivaRonaldo! Share some great gifts with your friends and me http://t.co/rxBw6wGDdl http://t.co/wjjdY5JjdU @YearOnTwitter Thank you guys! Have you entered my #CR7underwear competition yet? Make sure to visit http://t.co/4t8GFRr7Kh to win some pieces. http://t.co/iRXBg3GCy4 It's a real honour to open the CR7 Museum in my hometown Funchal. I'm very happy and excited. http://t.co/CamkHUI7jj http://t.co/coibigFSn8 The Alien threat is here - I've joined #GALAXY11 to play football in space and defend this planet that we love... \nhttp://t.co/TCTSzsPOcn Acabei de fazer as minhas previsões para o Osasuna vs. Team CR no #VivaRonaldo. E tu? @VivaRonaldo @FundacionRevel Gracias a todos. Feliz Navidad! .@VivaRonaldo is where my true fans belong. Join my official community. http://t.co/GWxiDwVO06 http://t.co/ujNnQm4lO0 As an early Xmas present, visit http://t.co/Ns7j14SIrW to win some of my #CR7underwear collection favourite pieces. http://t.co/OJqfBhEXm5 Hi guys. Group stage is done, now looking forward to the next round. http://t.co/lB9AFFol81 Tonight another game on the Champions League. Let's go team! Hala Madrid! http://t.co/JYR7g31g8X Hey guys, we arrived in Copenhagen for another Champions League game tomorrow! http://t.co/ZT91AUsO5D Thankful Madiba for your legacy and your example. You\"ll always stay with us. http://t.co/IA72uYB6N4 Check the rankings http://t.co/hgrrSmfQzG, spread the word, lead your city to the top! http://t.co/qbYhuC46yk Help your city reach 100 ready teams (with 5 players or more) and start competing in #GAMEbyRonaldo right away. Enjoyable dinner with family and friends in Madeira. http://t.co/ZCDBMTPfjd It’s an honour and a privilege to receive the award of Liga de Fútbol Professional Most Valuable Player of 2012/13. http://t.co/fjI7lvOKvc Go guys! RT @VivaRonaldo Let's vote #VivaRonaldo for Best Mobile App Crunchies Award! Vote daily until December 15 http://t.co/T4MFXRudoZ Hello guys. I’m very happy to win the trophy Alfredo di Stéfano again this year. Thanks everyone! http://t.co/nS7hUUuvKN @SteffLgo7 Boa semana! @sisoov Hello Uzbekistan! @abdelhadymadrid Good morning. How are you doing? @luis_cr7_RM I'm sure we will meet one day. Well done, team! http://t.co/pSfnG4i9Ae Thanks to the fans for the great support. I wish I was there helping my team. http://t.co/DKjyYGzNIQ Welcome to Twitter @CasillasWorld! http://t.co/zXMV9BF3Uk Heading back to the hotel with this great surprise. Thank you guys. http://t.co/UZIbyr5QDf I’m very happy with my own #cr7underwear line, love it! Visit http://t.co/pNFRl7zF8G to know more http://t.co/tKc7da2xEZ Thanks for the support on Cheer Ronaldo on the past days. Congratulations to the winner @emiliegranb http://t.co/85bMFycBqm Thanks #Portugal! Your support was indescribable. You gave us the strenght that makes us believe! http://t.co/tgzzqb6laz All together we did it! Brazil is waiting for us! #ForçaPortugal http://t.co/NLaelDIVEg Tonight we must be fearless. 1, 2, 3 PORTUGAL PORTUGAL PORTUGAL http://t.co/H13iTz0Lct @VivaRonaldo Thank you to all the #VivaRonaldo fans. Acabei de fazer as minhas previsões para o Sweden vs. Portugal no #VivaRonaldo. E tu? @VivaRonaldo Khedira, I wish you all the best for your recovery. You're a fighter and we wait for your fast return. The World Cup is waiting for you. What a game! #Portugal let's do this!\nEurope: http://t.co/h3gJjyOrgn \nUS: http://t.co/x9SG5H4eaz http://t.co/4zGTrug5jA Tomorrow we’ll face Sweden in a very important match for #Portugal. We count on your support! #ForçaPortugal http://t.co/MfhH7bguJK Acabei de fazer as minhas previsões para o Portugal vs. Sweden no #VivaRonaldo. E tu? @VivaRonaldo @GameisOver777 Good morning. Yes, big game coming up on Friday! @Anood_25 Hello, how are you? Well I hope my tweet helps! @CRIS_countONme Your support means everything. Thanks. @nikishin7 Good morning, Russia. All of my support to the victims of #Haiyan. @SavetheChildren is helping meet children’s basic needs. Let’s all help http://t.co/2LOYO26t8a. @CriisteeAmo Saludos Argentina @Sus7Inter Ciao, Italia! @OMERCR Hi there. Greetings to Egypt! @RobertSparkes Hope you enjoyed being at Bernabéu! @Ronaldolovers7   Thank you, your support means so much to me. @RahafRonaldo Hello you. How are you? @JodyF13   Big hello to Cape Town, South Africa @KaniD_cr Hello Kanishk, how are you doing? @Soccer_Ace Good afternoon New Jersey. @aymennnouri Hello Tunisia. Kids helping kids while staying healthy &amp; happy! Big Win in Mozambique! @SavetheChildren  http://t.co/qkLoL90DNf @VivaRonaldo Great! It’s for Szymon, right? @AlanD_7 Nice! @Lara__7 Hi! A good day for you too. @SheLovesFcim Hello to all the Italian fans. @Cristiano7_AF Hola Paraguay! @BlogElAltavoz Hola. Saludos. Todo mi cariño y mi apoyo a #homenajeacaceres del @realzaragoza el dia 13 en La Romareda. The winning team will get a trip from anywhere in the world to see me play live! Register your team: http://t.co/HYlXbMhaL4 Want to see me play a match? @GAMEbyRonaldo starts November 20. Registrations are open now: http://t.co/HYlXbMhaL4 http://t.co/VqJrmOMnax @RealMadridxCR7 I’m good, how are you? @DanahNF Hi Dana. Not a dream anymore! @catitaarevalo Hola Chile! Want to compete in Round One of @GAMEbyRonaldo? Register now: http://t.co/HYlXbMhaL4 The wait is over. It’s live! Registrations for @GAMEbyRonaldo are now open: http://t.co/HYlXbMhaL4 http://t.co/pzbKlZFVPr Hello guys. We’re already in Italy. Looking forward for the match tomorrow. Hala Madrid! http://t.co/VztuJjRu75 Acabei de fazer as minhas previsões para o Juventus vs. Team CR no Viva Ronaldo. E tu? - http://t.co/ZQmCmaLtYF Hey everyone, look whom I met on Saturday. It’s Robby Cano, Yankees player. http://t.co/3Ode4oPWd3 @20dgh A big hello to Jordan. @LifeRonaldo7 Hola, buenas tardes. @MelisaRonaldo_7 Thank you. The team will fight for the win. @Ronaldolovers7 Hello. You too have a good day. @MichelaDammizio Grazie Italia. RT @SergioRamos: Good morning...! Taking off to Turin. Let's go team! Hala Madrid!! @Cristiano @GarethBale11 http://t.co/vbbLyk4yGv Do you want to know more about @GAMEbyRonaldo? Read our FAQ: http://t.co/HYlXbMhaL4 Registrations will open in less than 48 hours. Less than 48 hours to go! Registrations for @GAMEbyRonaldo will open this Tuesday @ 12:00 London time. Find out more: http://t.co/HYlXbMhaL4 And you can watch the exclusive behind the scenes of my #CR7underwear shoot here http://t.co/aZgVAnOiji My #CR7underwear line is now available to buy! Check it out at http://t.co/pNFRl7zF8G I had a great day launching #CR7underwear today. Thanks to JBS and @RichardChaiNY. http://t.co/XFZnxEiwCS http://t.co/nrsN40SnWk You can now check out the full #CR7underwear collection at http://t.co/4t8GFRr7Kh. Here’s one of my favourite designs http://t.co/oR8jA9aB0f Proud to see this image from the #CR7underwear campaign displayed in one of Madrid’s most famous landmarks today. http://t.co/LP8KoT9peS I am very excited to be officially launching my #CR7underwear collection in Madrid. http://t.co/5npVJpXgkx I wish Mr.Blatter health and a long life, with the certainty that he'll continue to witness the successes of his favourite teams and players This video shows the respect and consideration that FIFA has for me, my club and my country. Much is explained now http://t.co/PzcvbtBoCT Playing to be the next F1 pilot. http://t.co/jjUoD5P2wn @Cristianomike7   A big hello to Switzerland. @natsyadeassy Hi there,  how are you? @diegojesus10 Gracías, me gustan mucho. @Rocketman_07 Good morning, Honduras. Acabei de fazer as minhas previsões para o Barcelona vs. Team CR no Viva Ronaldo. E tu? - http://t.co/ZQmCmaLtYF @_xDANAx_ I'm good. @xJRedman10x You're welcome. @VickMayweather Bonjour France! @Rafik87 Good morning Algeria. @xJRedman10x Happy birthday. Hope you have a great day. @_xDANAx_ Hello, good morning. How are you doing? @baharCR7 Of course! A big hello to you. @juanfecaceresr Hola Colombia. @FuadFathalla That’s true, another big game coming up on Saturday. @NikolasRoufas  Here it goes, a big hello to you and all Australian fans. @Cr4Zy_7 Hello. Good luck for your exams. @ArturBanar  Thanks, your support is very important for me. What an exciting game at the Bernabéu! Hala Madrid! http://t.co/R2uUpf9o3x @RealMadridxCR7 Thanks guys. @RafaAlas6 Thank you. RT @cristianodane: Thank you everyone who voted for me to help me meet my idol @Cristiano ! Can't wait, its a dream becoming a reality! htt… Still, I'm happy to congratulate @cristianodane for winning the contest with this photo. http://t.co/LG4NKvTuET Wrong phrases out of the contest can be tricky, especially for the ones not paying attention. Just realize that there's a lot of buzz around my #cr7underwear collection for kids. @Cristianodane, I'm looking forward to meeting you and your best friend in Madrid soon. http://t.co/9NdDOLOH7k @Cristina_Fern Hello, I’m doing great, how are you? @Torito_Grazzo Hola Ecuador. @haqifaayila Good morning to all my Malaysian fans. @vale_cr7 A “Ciao” will do? Hi to Italy! @AinoaRonaldita7 Thank you, it’s a big week with big games coming up! @F1_rivero Saludos a las Islas Canarias. Hey guys! There’s a big game coming up tomorrow. Let’s fight for the win! Hala Madrid! http://t.co/TGIirrnU0N Dinner time. http://t.co/gWnhcnz2Ov @malegozil   Saludos a todos en Mexico. @nurpelinbarut Good afternoon Turkey. @RMGIRL7 Hello there, how are you doing? @Cristinaa_cr7 @nikefootball I’m glad you like them. @emiliegranb Yes, it’s amazing! Thanks everyone! How fast is fast? You tell me. #Mercurial http://t.co/gVihyve2C9 Excited about my new @nikefootball #CR7 collection. Europe: http://t.co/VWNasM50Ht  US: http://t.co/5oSqZzbtpu http://t.co/wW6Bwajokv My new #Mercurial boots from @NikeFootball - what do you think? http://t.co/VWxGRPNX37 Do you think football has limits? I don’t think so. Stay tuned! #CR7 http://t.co/UIZHkCnb9C Next week, we'll be giving all the details on the biggest football competition ever. Follow @GAMEbyRonaldo . The moment is coming to get your 5-a-side team together. Follow @GAMEbyRonaldo to stay updated. http://t.co/rj0RQEGw0F @Cristianosheart Here you have, a big hello to you and Iraq. @maja_nbg Thank you. Hope you watch the game tomorrow. @giio_goone Hola Mexico! @Sara7Ronaldo You too. @SiwarMh I guess it is! Have a great day. @ComNhas Hola Venezuela. #VivaRonaldo winners were in Lisbon for Portugal-Israel.Thanks @emiliegranb and @Abdelhadymadrid! Hope you liked it. http://t.co/faHDbjm8qz @lydiacara Great, hope you enjoy the game. @AbdulrhemAbsher Hey, that’s very nice, my fans are the best! @NaadirahSeedat Hello there, how are you? @LordAbril Hala Madrid! @krisCetarb Good afternoon Germany! @Azmi427 Hello. Greetings to Morocco. @halamadrid7kh I’m good, how are you? I trained this morning with the team. Morning training for Saturday’s match against Málaga. http://t.co/rDE5jBkCcC @Ercanmodric I’m pretty good. How are you doing? @Cr4Zy_7 Thank you. I’ll be training in the afternoon. @TeamBreezy89 Work hard every day and never give up! @beibipabon_CR7 Hola a todos. @Cristiannnoooo7 Thanks, your support means a lot. My CR7 Boys Underwear Competition is now live. I’ll meet the winner in Madrid! Show your support and participate here http://t.co/V5tA8dyHMg Get ready to play football. Get ready for @GAMEbyRonaldo! Launching end of October. Worldwide! Your football gear is soon getting an upgrade! Track your stats, matches and player career in a global competition. Follow @GAMEbyRonaldo. Acabei de fazer as minhas previsões para o Levante vs. Team CR no Viva Ronaldo. E tu? - http://t.co/ZQmCmaLtYF I’m happy to have scored twice last night on my 100th game on the European competitions. http://t.co/KmCoNQMmOg REAL Players, REAL Teams, REAL Matches, REAL Football. Take part in the competition! Follow @GAMEbyRonaldo. I’ll be launching a revolutionary football competition. End of October, Worldwide! Follow @GAMEbyRonaldo. Parabéns aos dois. Deixaram todos os portugueses orgulhosos neste dia. Que dia único para Portugal! Os nossos atletas João Sousa no ténis e Rui Costa no ciclismo fizeram história hoje. Big game today! Are you ready? http://t.co/sUHlMn3fy1 Can you run it like Ronaldo?  Play Cristiano Ronaldo's Footy online for FREE today!  http://t.co/T4UbPJnVzY http://t.co/wyMGET7tx4 Want to hear more about my new underwear collection from @RichardChaiNY? Take a look http://t.co/5mcORGniVw #CR7 #jbs #richardchai Hey guys. Thank you so much for your support on @realmadrid http://t.co/Ing0CmFPwL"}