{"tweets": "RT @JeremyRayTaylor: finally with the new cyber truck i can probably actually draw a car. thanks @elonmusk RT @rainnwilson: I think all these wackadoodle conspiracy theories are being spread by the lizard people controlling the government via tho… RT @peytnhaag: i could take care of 24 webkinz in 6th grade but cant even take care of 1 me now RT @CodyPalm: so about my costume last night https://t.co/TN3HE1PT4B RT @JeffreeStar: Pray for California 😭🔥🙏🏻 So many fires have started today... Everyone be safe! https://t.co/95BORN8J6y RT @DrPhil: Sksksksk? 🤷‍♂️ https://t.co/PZunpZs9q3 RT @yo_shuah: This video finally came up again and I’m crying it’s so precious https://t.co/CzJh4tUEPU RT @Em_bexxx: Okay this has to be one of the best tiktok videos I’ve seen yet 😭 #avengers https://t.co/prMZGCqZWs RT @MauricioCross10: @moprobIems we have hell week,so basically we train mentally and physically for any situation possible and we make it… The first episode of The Beautiful World of Jeffree Star literally has me so shook!! I literally can’t wait to see what the rest of the series brings! ☕️ \n#shanedawson #thebeautifulworldofjeffreestar #jeffreestar \n@shanedawson @JeffreeStar @AndrewSiwicki RT @TeaSpillYT: Happy October 1st 🎃🎃🔮👻🎃💀🕷🔮👁🎃🧙🏻‍♂️🕸🕷🍁🍂🍃☁️ 🎃🎃🔮👻🎃💀🕷🔮👁🎃🧙🏻‍♂️🕸🕷🍁🍂🍃☁️ 🎃🎃🔮👻🎃💀🕷🔮👁🎃🧙🏻‍♂️🕸🕷🍁🍂🍃☁️Aka Shane Dawson is uploading day 🎃🎃🔮… RT @donttrythis: Guy in the second vehicle needs a RAISE! https://t.co/yR0D4kqMBY RT @ColtonStones: Updated graphic on tropical storm #Karen and it is alarming. https://t.co/aYlJLypzyi RT @RexChapman: Flawless execution...😂😂😂  https://t.co/uGmUNC2z5j RT @linadeflorias: Houston Lightning: https://t.co/PG5Wp3W6FP RT @Lin_Manuel: Gmorning\nTo the altos and the baritones in choir\nTo the viola players and trombonists in the band\nYour melody is not the on… RT @MCU_Direct: Actor @TomHolland1996 has addressed the @Disney-@SonyPictures #SpiderMan situation for the first time at the #D23Expo... ht… @Wendys I’m ready for some spicy nuggs 🥵 https://t.co/przHSv1AL3 RT @ItsFuckenRuza: Disney going up to Sony like\n\n#SonyIsOverParty #SaveSpiderMan https://t.co/ROL5Vwy73r RT @ccfarmer2000: This is how I see it ending for Sony #SonyIsOverParty #SaveSpiderMan https://t.co/pknG8dmCHs RT @fishbowI: marvel after sony comes crawling back after realizing why spider-man movies had so much success https://t.co/7u0cOisIDs @brokenxcollins :) RT @itslaurlmao: do americans really eat chinese food out of those cardboard boxes like in tv shows??? RT @GabbieHanna: girls w curly hair straighten it\ngirls w straight hair curl it\nwhite girls get spray tans\ndark girls r encouraged to look… RT @saahiraa0: So the Starbucks I work at has been out of Strawberry Açaí for 3 days now. There’s a girl that comes by like every day for a… This is the softest thing I’ve ever seen 😭❤️ https://t.co/LVvMqn8Gu1 RT @shanedawson: Ugly Side of the Beauty World series in the fall and possibly something else in july. some stuff happened that threw a wre… RT @suggtbh: help me out please!! this is probably my only chance of being able to go 🖤 https://t.co/K1G5U15yvP Chris Evans got a 'genuine belly laugh' out of the acrylic nails meme  https://t.co/iAJpnBOeuX RT @Garrett_Watts: @Ryland_Adams “Ok!” He said to Ryland, knowing full-well that that very evening he would be leaving his doors &amp; windows… @alexia_speirs Oh my heck 😂 at least I got some lessons 💁‍♀️ RT @TheWeirdWorld: If you hear weird noises In the night, simply make weirder noises to assert dominance. RT @gigigxmez: @alexsteinnn @holden_a_fork same energy https://t.co/xMmiQs6KrH RT @theofficenbc: We can't believe @SteveCarell came. 😭 \n\nHe surprised #TheOffice costar @jennafischer at @BusyTonightTV! https://t.co/WqAu… RT @gryscalepa: Disneyland Loki is serving LOOKS https://t.co/5YZwMgWa3u RT @GraysonDolan: Retweet for follow :) RT @cowboyenergy: 10 year olds forcing themselves to drink iced coffee because emma chamberlain does https://t.co/MjqcKNxbDm RT @emmachamberlain: omg can u believe greenbean casserole is REAL how do u expect me to get mushroom AND soggy beans down my throat IT DID… RT @cart_gardner: EVERYONE PLEASE RETWEET TO HELP US😘 @TheEllenShow @GMA @FoxNews @EastIDNews @ABC @NBCNews @Vikings @BeesAdmin https://t.c… RT @jamescharles: RT to be the next video's sister shoutout!!\n\nMAKEUP ARTISTS TRY MY PALETTE! I asked some of my favorite talented artists… RT @catiemmuir: when I met Taylor Swift she complimented me on my necklace and I bragged to her about how I got it on sale for 2 for 20 the… RT @twhiddleston: https://t.co/4jl3dAVLqv @twhiddleston IM SHOOK RT @jamescharles: JAMES CHARLES x @MORPHE OFFICIAL COLLECTION REVEAL. 🎨🌈\n\nI have never been more proud of any project in my entire life and… RT @jamescharles: some boys are truly so beautiful like hello wow ty for blessing my eyes like that RT @emmachamberlain: me:\n\nhint of lime tostitos: ;) RT @rainnwilson: Does it actually help to bob a teabag up and down in the cup? RT @Nic_Hamilton: Today marked the end of an era. Henry Bowers is no longer. Thank you to everyone for making that filthy mullet a piece of… RT @ChrisEvans: Officially wrapped on Avengers 4. It was an emotional day to say the least. Playing this role over the last 8 years has bee… RT @MDesbarres: This is fascinating to me. I have great difficulty in sleeping if you feel the same please read this piece and find peace!… @MDesbarres I’m taking my second year of choir this year! I love it so much! Music is everything ! Guys I need to stop binge watching this heckin show 😂 send help! @MDesbarres https://t.co/cHGIZj2YBG RT @BleacherReport: LSU marching band does The Office theme song!\n\n(via @CodyWorsham) https://t.co/hwFARMDsRN “This is my chance to honor what’s best inside myself “ ~Nard Dog. #TheOffice #andy #Netflix RT @jamescharles: ikea furniture is supposed to be easy to put together yet somehow a laundry hamper has taken me 2 hours, 3 customer suppo… RT @jamescharles: Hi @netflix let’s make a documentary on the behind the scenes of the beauty industry and why the community is plummeting.… RT @FelloWyatt: i feel like the more i tweet the more followers i lose. yikes. RT @Caleb19629246: @WillehBeh @emmachambiex @jamescharles Oh my God he better!! Make a shade called kitty girl, pinkity drinkity and sister… @jamescharles When your eyeliner is even and you’re waiting for everyone to notice 😂 “I am an optimist... I choose to be. There is a lot of darkness in our world, there is a lot of pain and you can choose to see that or you can choose to see the joy. If you try to respond positively to the world, you will spend your time better.” ~@twhiddleston https://t.co/Jifn8uEHr6 RT @twhiddleston: The last #EmergencyLessons video from Amosh &amp; Anjali in Nepal asks us to show what school means to us, with an emoji! Her… RT @FinnSkata: rt if ur also late to water polo. also revine if u can give me a ride to waterpolo RT @UNICEF: \"It's not just for boys, but girls too.\" \n\nFootball is a game-changer for 14-year-old refugee Maraam.  \n\n#AChildIsAChild https:… RT @FelloWyatt: i want to know the number of people who take social media seriously RT @jes_chastain: You are fully and unconditionally loved RT @theofficenbc: You love us $12 worth. https://t.co/cpZJ5WEdEn RT @Factsionary: Almost every successful person begins with two beliefs: the future can be better than the present and I have the power to… RT @ChrisEvans: Happy 4th everyone!! I love this country and I’m proud of how far we’ve come. Be safe today! Also, Happy Birthday to a very… RT @TheWeirdWorld: You know you’ve listened to an album too much when your brain plays the intro to the next song before it actually starts… RT @TheWeirdWorld: Security at every level of an airport is absolutely ridiculous. Until you get to the baggage claim. Then it’s just like… RT @TomHolland1996: So true https://t.co/ndngFLMI6P RT @UNICEF: No child should be forced to flee their home.\n\nWithout a birth certificate, children are at higher risk of trafficking, detenti… @TheWeirdWorld Hey you know what dinosaur is better than the triceratops? Only every other dinosaur that ever existed! ~ Dwight Schrute RT @UNICEF: Today, on #WorldRefugeeDay, there are more #ChildrenUprooted by conflict than at any time since WWII. \n\nWe’re urging world lead… Watching Infinity War for my second time, ready to cry.... or maybe I’m not..#InfinityWar #AvengersInfinityWar @twhiddleston @chrishemsworth @ChrisEvans @chadwickboseman @prattprattpratt Congrats you guys! https://t.co/4FWjjONSr2 RT @AliPlumb: Ladies and gentlemen, may I present to you... @SamuelLJackson impersonating @twhiddleston. https://t.co/UUKNkWUCoT RT @UNICEF_uk: On #WorldWaterDay watch &amp; see families in #SouthSudan struggle to access safe water.  Help us reach more children https://t.… RT @TheWeirdWorld: With the rise of self driving cars its only a matter of time before we get a Country song where a mans truck leaves him… I have no idea how much more of @twhiddleston I can take in movies! Gosh dang it I just saw War Horse and then Infinity War 😭😭 @twhiddleston please send help🙏 Just random convos about what could have happened in @johnkrasinski ‘s movie😂🚀 https://t.co/GqZLocAlf6 RT @jaedenlieberher: For the record, I’ve only cried watching two movies in my life. 🚨🚨INFINITY WAR SPOILER 🚨🚨.         #infinitywarspoilers #avengersinfintywar @TomHolland1996 still crying about what happened 😭 that part still is haunting me"}