{"tweets": "Ihhh apagaram. \nNão aguentaram pilha? Tão em shok? Não aguentam crítica? A audiência vai cair hein... pára que tá chato... https://t.co/Xmtgs0Brxn RT @Rconstantino: Os passadores de pano já estavam perguntando o que tinha demais no vídeo quando o próprio presidente mandou apagar o tuít… RT @Rconstantino: Então, num mesmo dia, Eduardo Bolsonaro diz que o dólar é 60 em peso argentino e por isso não temos do que reclamar por e… @guspereira Desculpe zuar a rola que vc chupa... tá bravinha, né? RT @arecobarudino: 28/10 https://t.co/4hrwjkzy2a A Dilma passava vergonha pessoalmente. O Bolsonaro tem uma equipe pra isso. https://t.co/baPG4u20A9 Esse demente do Allan é a prova que os vermes tem gengiva. https://t.co/3mVqKDKsNo RT @arecobarudino: a cabeça do ser humano, bicho... https://t.co/OuovccRstj Nunca se desculpe https://t.co/isBuZhVrft RT @DaniloGentili: Mike Baguncinha e Jotinha do Whats App estréiam série criada por mim: https://t.co/kJzAOLz3oI @albaexpider Aqui é o novo máquina mortífera RT @CanalBigtoon: Hahahhahahhahahahhaha top 3 melhores séries https://t.co/R0PREoFldK Mike Baguncinha e Jotinha do Whats App estréiam série criada por mim: https://t.co/kJzAOLz3oI @ajulysantos @ateixei1972 @JuMagalhaesBH @aguedescartoon Sua tb Cristão verdadeiro é assim: vive lambendo bota de presidente e xingando quem não lambe. Não leu na Bíblia não? É isso que tão ensinando lá. https://t.co/zsowvAyvaf @aguedescartoon Aaaaa vc quer apenas surfar na onda ne? Domingo pesado pra gente hoje https://t.co/xl0caE8I25 @aguedescartoon A culpa é sua, hein RT @HavocMiranda: - CURIOSIDADES DA COMÉDIA : ROUBO DE PIADAS\n\nPiada tem dono. Pouca gente fora do meio dos comediantes tem essa noção. E h… RT @ProfBunazar: Não sou analista político, mas arrisco aqui por já ter visto o filme: o futuro governo argentino, como todo governo esquer… RT @moura_101: Resposta ao Olavo de Carvalho.\nhttps://t.co/MwCZqR2RBC https://t.co/BmB2LqUqtM Vídeo novo do @murilocouto : https://t.co/zeiZgDpHUS\n\nHAHAHHAHAHAHAH Belo vídeo do @moura_101 \nhttps://t.co/haSfRWpWD6 RT @LucasVelosoator: 100% da galera fala “fulano tem inveja de mim” e 0% fala “rapaz, eu reconheço que sou invejoso” \n\nEssa conta não ta ba… RT @igorzismo: JOÃO PLENÁRIO E ADVOGADO PALOMA https://t.co/leapb9nDrm RT @paularosiska: Same energy https://t.co/JTgwO8hD9h RT @limitesdohumor: RT QUEM TA ANSIOSO PELA ENTREVISTA DO ARTHUR NO @SBTTheNoite COM @DaniloGentili!\n\nALO CORINGA ESPERAMOS VOCE AQUI  HEIN… RT @DaniloGentili: Julguem vcs mesmos... https://t.co/t2IcVt57dt #MakeMamataGreatAgain https://t.co/MfsmLAqzhi RT @peterjordan100: Filme do Coringa faz referência ao PT. https://t.co/J8kKZ7xQ15 @peterjordan100 Hahahahah @RibeiroJricardo Depois q foi descoberto? @EI_GabrieI DEPOIS QUE FOI DESCOBERTO O cara não tem coragem de mostrar nome nem rosto, mas tem coragem de “pegar em armas pra defender o País”.\n\nFoi descoberto que isso aí é funcionário de gabinete que é pago pra militar na internet e perseguir pessoas. Esse tipo de lixo é a tropa de elite do bolsonaro na internet. https://t.co/saTNnyExGJ @igorzismo Hhahahaha Doe! \n☎ 0500 12345 05 - Para doar R$ 5⠀\n☎ 0500 12345 20 - Para doar R$ 20⠀\n☎ 0500 12345 40 - Para doar R$ 40⠀\nOu no https://t.co/2GS4ySbOlv 📱\n#Teleton2019 #PrecisoDeVc https://t.co/p2rDxHRu31 RT @BastidoresDaTV: Recadinho do @DaniloGentili. \n\n#Teleton2019 @TeletonOficial @AACD https://t.co/drz63w10KS RT @SBTonline: Como disse o @danilogentili \"se o Kaio pode doar, por que você não pode?\"\nNão deixe de doar! \n☎ 0500 12345 05 - Para doar R$… RT @diguinhocoruja: Apaga isso pelo amor de Deus. https://t.co/meGzZRPpJ2 Vamos doar! \n  5 REAIS: 0500 12345 05\n20 REAIS: 0500 12345 20\n40 REAIS: 0500 12345 40\nOu doe pelo site: https://t.co/2GS4ySbOlv | @TeletonOficial \n#precisodevc #teleton2019 https://t.co/ulQt37Pc3E Nosso filme acaba de ser indicado como MELHOR FILME e MELHOR MONTAGEM no Reino Unido. No México venceu como MELHOR FILME LATINO, em Londres como MELHOR CENA e no Canadá MELHOR FILME ESCOLHA DO PÚBLICO. \n\nO filme foi rejeitado pelos festivais brasileiros.\n\nBREVE estréia a série. https://t.co/2MDmivt7au Os Exterminadores do Além nomeado como melhor filme no País de Gales! https://t.co/cXvgiO7sWN RT @cor0te: Curiosa essa histeria repentina sobre Foro de São Paulo em meio a escândalos da família Bolsonaro. O Foro é tipo o bicho papão… Julguem vcs mesmos... https://t.co/t2IcVt57dt RT @Flavio_Quintela: A deputada Bia Kicis @Biakicis apagou o tuíte com o vídeo dos 3 FARC-patetas gravado em frente a uma parede de folhage… Ótima idéia fazerem isso em época de cpi de fake news. https://t.co/nCQORSowCt RT @SBTonline: Milene Pavorô aposta em fantasia do Bob Esponja e arrasa\nhttps://t.co/N85ivJeXM3\n\nVocê já fez a sua doação?\n0500 12345 05 -… O @TeletonOficial precisa de você! Doe agora! https://t.co/MkYx1pN4V3 RT @SBTonline: Teleton encerra primeira noite com mais de 2 milhões! Doe e nos ajude a atingir a meta de 30 milhões!\nhttps://t.co/wC4DkyecE… @paularosiska @aguirre_nc Vote em mim RT @RavenBanner: Happy opening night, @FracVis!  Thank you for hosting the Welsh🏴󠁧󠁢󠁷󠁬󠁳󠁿 Premiere of @fabriciobittar's #GHOSTKILLERSVSBLOODY… HAHAHHAHAHAHHAHAHAHAHHAHAHAHAHAHJAHAHAHAHAHAHAHAHAHHAHAHAHA\n\nEle precisa ganhar essa puxação de saco a troco de nada, senão o PT volta. https://t.co/jMlHH6dj9k RT @igorzismo: SEXTOU https://t.co/3UOJbOdFXb RT @lucianoayan: Parece que esse perfil sofre de esquizofrenia. \n\nDias atrás disse: \"provem que eu sou MAV pago\". \n\nMas quem tinha falado d… No passado eles faziam campanha contra mim e eu dizia : Chupa militância governista.\n\nO tempo passou, o governo mudou e eu continuo dizendo a mesma coisa: CHUPA MILITÂNCIA GOVERNISTA.\n\nC\nH\nU\nP\nA\n\nhttps://t.co/QIFcwyfPGJ @FabioJu80227185 Tá tuitando aí do terceiro andar de Brasília ou foi um assessor da alesp que mandou vc tuitar isso?\n\nVc não percebeu que a casa de vcs já caiu? https://t.co/LHiSaGqTIV Se você reclamar ou cobrar coerência o PT volta. https://t.co/hSdyyldyZs Excelente artigo do @BlogDoPim \n\nO ‘conservadorismo’ do dinheiro alheio https://t.co/3jQE7hf0Eg @Maraisa @withlovemem Hmmmmmm... vamos resolver isso logo RT @_Orcrim_: Esse envelheceu pior: https://t.co/c30E5PXTBJ https://t.co/5n5fWhzOC7 RT @larimanoela: Hoje, 00h30 tem @SBTTheNoite com @DaniloGentili 💛 Não percam!!! O programa está super maneiro. https://t.co/jMt7FgSoYB RT @DaniloGentili: Acabo de sair do STF. \nEu e Gilmar Mendes tivemos uma calma e produtiva conversa. \n\nAgora o Brasil vai pra frente. https… Se você protestar sem que os pelegos pagos e sem que a militância oficial pró-governo autorize o PT volta. RT @FriedHardt: \"não tem q protestar agora, vamo pedir uma pec pra prisão em segunda instância\" kkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk… RT @_Orcrim_: Eu fico Muito orgulhoso e feliz de não fazer parte do grupinho de otário que cai nessa narrativa de merda pra não melar acord… RT @_Orcrim_: Agora vou trabalhar mesmo, vigiem as própria Picas galera: https://t.co/swX8V6NdVl Acabo de sair do STF. \nEu e Gilmar Mendes tivemos uma calma e produtiva conversa. \n\nAgora o Brasil vai pra frente. https://t.co/TV8Okayq9N @aguedescartoon @lucianoayan E a defesa deles é diametralmente oposta. Ex: inventaram que eu os denunciei não pq percebi o esquema nojento e sim pq eu peguei “pilha com piada” - qual seria a tal piada nunca revelaram. Já eles, qdo são pegos em contradição dizem que “era brincadeira”. @carlosalbano Claro... “piada” @Nee_Sep @Natlia26262559 @youPLAYS1 Desculpa zuar um fake que fica defendendo rola de político. Aliás desculpe tb zuar as rolar q vc chupa. Kkkkk https://t.co/lcDxALP1F2 RT @lucianoayan: Expectativa: defesa dos valores da família e da civilização ocidental. \n\nRealidade: defesa de rola de marmanjo numa tentat… RT @FriedHardt: bacana a iniciativa\n\nresta saber se pra atingir a cota a ideia é proibir um percentual de homens ou levar algumas mulheres… https://t.co/7kaOIxL7Ta RT @DaniloGentili: Obrigado ao público pela excelente audiência e obrigado a toda equipe do programa pelos excelentes programas. Sem vocês… RT @tesoureiros: kkkkkkkkk https://t.co/rsJnSBUufi RT @tesoureiros: Quão longe você iria para defender seu político de estimação? O moço aqui virou somellier de piru https://t.co/qpTqzAwSG3 @aguedescartoon Uncharted RT @DaniloGentili: Eu sempre achei q a briga era pra poder criticar político sem patrulha pra te achincalhar. Me enganei? A briga era para… Boa Tarde https://t.co/6GGPVjgpe9 Quem aí acha Bubballo tutti-frutti uma delícia? https://t.co/l9LoPK9LKl Obrigado ao público pela excelente audiência e obrigado a toda equipe do programa pelos excelentes programas. Sem vocês eu não poderia dizer que hoje de noite tem mais The Noite :) https://t.co/HdM9ca9Eb1 @Delacroix_31 Verdade. Discurso de ódio aqui. Kkkkk @youPLAYS1 Me tornei defensor de rola de marmanjo? Kkkkkk @PabloChateado Foi né. Peguei pilha. Kkkkk. Senti. Kkkkkk. ESTRATÉGIA: Criaremos um perfil biônico pra ser respeitado entre os pelegos da milícia virtual. Ele disparará narrativas governistas e ordenará linchamentos virtuais. Será “cool e descolado”.\n\nPRÁTICA: Termina defendendo seus maiores tesouros: rola de político e cu de assessor. https://t.co/3oTRDmyDQu Hahahhahahahhahahahahhaha https://t.co/15l0Xx4THZ @IsraelCndido6 @aguedescartoon Liderou o que até agora? ATENÇÃO: eu também tenho uma declaração pra fazer. Desisti de ser o novo Thor no próximo filme da Marvel. https://t.co/EzY7pD1zdt Os caras estão vivendo da própria mentira. Parabéns para as grantes mentes por trás dessa “estratégia”. Você estão ruindo vertiginosamente.\n\nBots contra o PSL https://t.co/cm9mHntZOQ RT @aguedescartoon: Mais um de dentro dos intestinos do governo que afirma que existe cooptação de perfis pra ataques em massa e rede de fa… @BrenoHePain @aguedescartoon @aguedescartoon vou falar a real: eu sou o anti-cristo surubeiro Esse é o grande trabalho da militância governista e dos blogueiros de gabinete: Fazer até quem simpatiza pegar nojo. \n\nParabéns para todos os estrategistas envolvidos. https://t.co/0GcJxb5HLp NÃO EXISTE MAV, NÃO. É TUDO MENTIRINHA!\n\nEm grupo de debates, bolsonaristas coordenam ataques contra Joice Hasselmann https://t.co/xjjsnjoJBP @aguedescartoon @odeiotodocorrup Não deu exemplo. \nGalvão, sentiu. RT @aguedescartoon: Querem saber o que parece coisa do Foro de São Paulo?\n\nPetista na PGR\nNarrativas contra procurador da lava-jato\nNarrati… Evento em São Paulo sobre inclusão e Autonomia de pessoas adultas com síndrome de down na sociedade.\n\nQuem quiser saber mais entre aqui: https://t.co/libnsUqeT0 https://t.co/IqbQwlYRII Cuidado. Está rolando por aí um novo golpe do sequestro no celular. Agora o bandido liga pra você e fala assim: “Se você não depositar dinheiro pra gente até meia-noite o PT volta” RT @NickelbackBraz: A reação da @jublackpower no programa @TheNoiteOficial com @DaniloGentili foi a melhor! 😂😂😂😂😂 @Nickelback #NickelbackBr… RT @GuilhermeBoulos: Equador: revolta popular revoga o aumento dos combustíveis e derrota o governo.\n\nChile: revolta popular revoga o aumen… Tudo que a ala retardada do governo mais quer é o Boulos incitando esse tipo de merda. https://t.co/i5ynbrQS29 RT @Flavio_Quintela: Usar versículo bíblico, ainda mais um dito pelo próprio Filho de Deus, pra falar uma meia-verdade (ou seja, uma meia-m… RT @Rconstantino: @jairbolsonaro Mas aumentou em relação a 2015 e 2016 também... @aguedescartoon @lucianoayan A 1ª vez q esse veio falar comigo ele achava mesmo q conseguia disfarçar sua peleguice desprezível com clichês. Percebi rápido q era um perfil criado para disparar narrativas e linchamentos. Hoje qualquer um vê q é apenas um perfil criado para auto-felação dos que os controlam. @DeusVultBrasil “deus Vult” ahhaha q idiota RT @_paulomrc_: \"nunca deixe ninguém ser responsável pela sua própria felicidade\"💫 @DaniloGentili https://t.co/3FfL2QFCoG Aahhahahhahahah “os caça isentões” https://t.co/ttolmmtobq RT @o_colecionador: Aprendam:\n\nnós temos q fazer igualzinho ao PT pq senão o PT volta, hein?\n\nE quem não concordar é isentão.\n\nDeus Vult. RT @RavenBanner: ONE WEEK to go until the Welsh Premiere of @fabriciobittar's #GHOSTKILLERSVSBLOODYMARY at @chaptertweets for @FracVis… @_Orcrim_ @bastos_mendonca @templariovirgem O cara mesmo escondendo o rosto pra proteger a mamata sentiu. Imagina quando cair a casa geral Tão em shok?\nNão aguentam a pilha?\n\nSe forem fundo verão grana pública envolvida nisso. https://t.co/OURYKXoE58 Michael Gary Scott passando na sua TL https://t.co/pdF4yqRJWQ @CarneMoidaTV Então vc sai ofendendo por aí pessoas com cabeças normais? RT @PSOLsemO: Qual a diferença disto pro discurso petista na época do Lula mesmo? https://t.co/uz8z2JMZg0 @Maraisa To indo pra casa RT @GuilhermeBriggs: Hoje o meu querido mestre Orlando Drummond completa 100 anos. Ele nasceu nesse mundo através do amor e o iluminou, car… RT @SamTadeu: A mulher era líder do governo no Congresso até literalmente ontem e assume que o governo tem uma milícia virtual paga patrulh… RT @tvabordo: @SBTTheNoite @DaniloGentili abre madrugada na liderança de audiência para o @SBTonline  Confira os números consolidados desta… Série. 10 episódios. Seguimos gravando. Em breve passará no @WarnerChannelBR \n\nAcompanhem os bastidores aqui: https://t.co/WbCc98XgfY https://t.co/1eYadpShCS Engole isso, arrombado! https://t.co/6MsiCfk8mp @aguedescartoon Vc precisa transar. @aguedescartoon Para que tá chato\nVai perder audiência @aguedescartoon Não aceita críticas? @CarneMoidaTV Que isso 6:27 e eu tô assim: https://t.co/uWNzINxthV @_rodrigobraga_ @WillSimples Hahahahah RT @deonvidi: KKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKK… Léo Lins e Dani Calabresa são indicados a premiação de melhores atores no Canadá https://t.co/MiNhPCA1nY via @VEJA RT @FabioGuere: Alexandre Frota falando do Pablo Vittar, tirando foto com David Miranda... acho que vem filme novo aí. RT @DaniloGentili: “Engole isso, arrombado” https://t.co/a4Rs2zS2D8 RT @igorzismo: Finalmente um role pra mim 🙏 https://t.co/xPZzi483Wa @arecobarudino @marcurelio Grande moção Brigar com a esposa? https://t.co/2Ng6obirm9 RT @Vinheteiro: Encontre alguém que lute por você igual seus tios lutam pelo terreno de sua avó. Dou mais uns meses e os caras estarão aprovando “moção de boquete” pro presidente https://t.co/gmoOmxitut Se o carro vier com o porta-mala cheio o @murilocouto compra https://t.co/YcANQcC2lQ Hmmmm vai pegar hein @FFrancischini_ https://t.co/asEbIBFCkF “Engole isso, arrombado” https://t.co/a4Rs2zS2D8 @CarneMoidaTV https://t.co/zRtUpG8GZ9 RT @arecobarudino: @duin182 @DaniloGentili Porque quem vive promovendo o discurso identitário, que dá viés racial ou de gênero ou de identi… Quanto cinismo, bicho\n\nhttps://t.co/zJHVMu0yIb RT @DaniloGentili: Acabamos de ganhar mais 2 prêmios no Canadá: Melhor terror comédia e Melhor filme pelo público!\n\nFora esses prêmios venc… @CanalBigtoon @Rodrigo13279856 Isso Acabamos de ganhar mais 2 prêmios no Canadá: Melhor terror comédia e Melhor filme pelo público!\n\nFora esses prêmios vencemos como “melhor cena gore” no principal festival do gênero em Londres e “melhor filme latino” no México.\n\nO filme foi rejeitado por festivais brasileiros. https://t.co/4rBaSwCcBS RT @apyus: Nos Estados Unidos, o CPAC é financiado pelo ingresso dos próprios participantes. No Brasil, os \"conservadores\" usaram R$ 1,1 mi… RT @aguedescartoon: Tem uma outra muito boa agora\n\n\"Você não tem senso de proporções\" https://t.co/JEGuzrDTZZ @albaexpider Me contrata Vamos adivinhar: eu não posso falar nada que vc não quer senão vc , um fake, pede pro Silvio me demitir. É isso?\n\nÉ assim que funciona q militância bolsolavista. https://t.co/9jttFvNeBS https://t.co/aShzpNrdNk Essa tal “direita verdadeira” é aquele núcleo do Alto Pardal, do Game Of Thrones. \n\nE vão acabar igual. Calma Ayan. Não seja leviano.\n\nSe ela gravou o vídeo olhando pro monitor a cara de nojo pode ter vindo dela se olhando. https://t.co/7CaWfRxYvL @Gleiki2 Isso é o q vc quer q eu faça... hmmmm... RT @Jardan: esse programa do #TheNoite especial das crianças foi excelente, tô assistindo a reprise aqui no Comedy Central e fica óbvio o p… Ih a @bethmoreno não tá no @standupjovempan? Agora afunda. RT @CorrupcaoMemes: @DaniloGentili @DCdaDecepcao https://t.co/KwhfJ99gQE RT @aguedescartoon: @lucianoayan Eu acho legal essa tática de defender o governo usando como fonte o próprio governo @aguedescartoon @priweinstein @sensoinc Qdo editaram um print meu e esse fake - junto com outros - espalharam com bots q eu dou dinheiro pro mbl não tive o privilégio de defesa do autor. É por essas e outras que vai dando nojo e vai ficando claro o que tá rolando. Oi pessoal, quem é o mais novo traidor e comunista do dia? @castorbarba @lucianoayan Pegou pilha? RT @lucianoayan: Está explicado porque esses perfis vaporwaves costumam usar copos de leite junto ao nome. \n\nÉ a defesa da mamação de teta… RT @_Orcrim_: Só aí na lista já foi 2 sócios (de 3) do terça livre + familiar de um dos sócios + uma repórter do jornal. \n\nEai, vai me proc… RT @_Orcrim_: 1- Cunhado do Allan recebe dinheiro de Márcio Labre (PSL) \n\n2 -  Lorenzon é presidente da sigla local do PSL.\n\n3 - Allan dos… @JoselitoMuller3 estão ameaçando te processar pq pegaram pilha com zuera? Tão em shok?\n\nEu tenho um bom advogado pra te defender, Joselito. Esse advogado aqui defende o tipo de postura q acusam vc de ter, olha aí: https://t.co/Z2QQqBAWb2 RT @JoselitoMuller3: Eu já vi novilingua, mas chamar de independente quem ganha dinheiro de gabinete é demais 😂😂 https://t.co/tu07U7Ez91 @arecobarudino @marcurelio Eu q inspirei o filme https://t.co/WcZdxcnC0g @Cleber09105939 A minha nao é fantasia, é realidade RT @DaniloGentili: https://t.co/ylsNKiwThf @bobdaslabaredas Por que só tem gente linda bonita na direita? Seria genética? @arecobarudino Hahahaha Que tal essa? https://t.co/JOeKG69K5I https://t.co/IT03udsGql RT @Rconstantino: O mesmo para o caso Brasil e EUA. O bolsonarismo é uma adaptação caricata do que prega Bannon. Mas e quando interesses na… @CiclistaModelo @LuizMasterXIV Sim. Na época eu fui pra alemanha só pra me tratar com ele. RT @Cardoso: O mais legal é que 99% das pessoas vão ver de longe, sem ler o texto miúdo, e vão pensar \"alá um viado\" https://t.co/H8IX1wcsg9 RT @DaniloGentili: Madrugada exterminando a escória do além. Em breve estréia a série no @WarnerChannelBR https://t.co/JbjPTZig6I Esse negócio deles falarem que se escondem atrás de fakes para não sofrerem represálias é mentira tb. Eles fazem isso pq o esquema todo de militância depende de fakes, afinal, como 1 pessoa pode controlar 50 perfis e simular “o povo” se não for através de fakes? https://t.co/T2sguSxBWz RT @ClaudinLuizmm: @DaniloGentili  @diguinhocoruja      A arte imitando a vida 🤔\n#SDVGERAL https://t.co/kLqLzaNy7D https://t.co/ylsNKiwThf @tleone_ Quer que ele me mate, né? @arrrowp @gugachacra O curioso é que qdo eu fiz piada dele ser embaixador veio uma exército de fake para defende-lo. Ele finca caladinho fingindo que “não sente” e “não pega pilha” mas sustenta exercitinho bunda pra sentir as dores por ele. O covardão terceiriza a pilha para os seus súditos. RT @FriedHardt: a pessoa sabe q está falando a verdade, todo mundo sabe q o conteúdo das palavra é verdadeiro, mas ela fala num tom como se… RT @FriedHardt: se pensar bem esse pessoal inventou uma espécie de ironia sincera\n\n-olha aqui vc recebe $ público\n-aaah entao eu recebo din… RT @Rconstantino: Já ficou claro que, em nome dessa \"guerra cultural\", vale tudo para essa gente. Como se acham acima do bem e do mal, numa… RT @Rconstantino: Então o convescote reaça de Dudu, que nem o papis quis ir, custou R$ 800 mil de fundo partidário (recurso público)? Confi… Qdo percebi que esse monte de fake só aparecia latindo qdo certas pessoas eram criticadas ficou fácil entender q defendiam patrões e não valores. Qdo se calaram a respeito do fundão e atacaram quem era contra esse absurdo ficou claro que tinha grana envolvida. São MAMATEIROS! https://t.co/t0xNFg6zcZ @lucianoayan E mesmo assim ficam repetindo que foi “vc que fez minha cabeça”, como se eu nao tivesse passado por isso na era PT e nao fosse capaz de identificar o esqueminha RT @_Orcrim_: @DaniloGentili É a Dinoerótica https://t.co/2ZoatrexKV Quando eu entendi o que tava rolando e bati de frente foi porque “O Ayan fez a minha cabeça”. É o padrão. É tentativa de deslegitimar crítica e exposição.\n\nTipo: “Você não está expondo e criticando pq estão fazendo algo criticável. Vc só faz isso pq alguém fez a sua cabeça” https://t.co/DIt9jkwiO3 Fake News! Kkkkkkkkkkkkk https://t.co/MfSdD2XEtM https://t.co/ODYthcUzO9 O Pingo Nos Is e Blogueiros de Crachá - O que eu sei... https://t.co/sAu3gvQaxD via @YouTube RT @SamTadeu: @DaniloGentili Dinheiro público pro cara ficar mostrando \"mitada\" no twitter https://t.co/dDkn46qlr7 RT @lucianoayan: 23:59 Essas teses sobre MAVs são pura alucinação\n00:00 Ei, o que tem de errado em fazer militância virtual? @0_Calango @gbrl0000 HAHAHAHAHAHAHAHAHAHAHAHAHAA - tem que se esconder atrás de fake mesmo pra defender tamanha mentira Então no fundo era tudo apenas por... DINHEIRO? Hahahahha\n\nE os caras posando de “defensores dos valores conservadores”. Eles só querem mamar na teta mesmo então? https://t.co/nuZMxrs50d O @empiricus vão floodar vcs aí, mas saibam que não se trata “do povo” descontente com o @BlogDoPim . É apenas um gordo fracassado lambedor de saco acionando militância inflada. É artificial. Igualzinho o PT fazia. Nem liguem para esse babaca. \n\nSegue o jogo. https://t.co/xC4fU6Dg4c @aguedescartoon @_Orcrim_ @Lets_Dex Sentiu RT @_Orcrim_: Não caiam na de ficar discutindo com perfis sem rosto, isso funciona perfeitamente como uma cortina de fumaça para proteger q… O @BlogDoPim fez uma matéria falando sobre ataques organizados de MAVs envolvendo gente de gabinete. \n\nPara provarem que é tudo mentira, gente de gabinete e MAVs passaram o dia atacando @BlogDoPim de maneira organizada.\n\nParabéns aos estrategistas da milícia. Ora, ora https://t.co/YATYceoLwc RT @VladSantos_80: #TheNoite\n#TheNoitecomDaniloGentili\nCrianças de todas as idades nessa imagem. 👏 https://t.co/wr6LhcJX9f RT @Jacquelineldsr: Sensacional a entrevista com os maiores criadores de conteúdo infantil do Brasil, Marcos Luporini, criador da “Galinha… RT @o_colecionador: Se vc realmente acha q um punhado de vagabundos filhos da puta, pagos pra encher o saco na internet, são \"O GOVERNO\", o… RT @lzrufatto: @DaniloGentili Foda Danilo https://t.co/Itw92ufLyU RT @I_am_Michelly_: Ah gente, hoje acontece o #TheNoite com @DaniloGentili mais fofo do ano, ...  Dia das Crianças com o The Leite Show, ag… RT @RavenBanner: 👧Murderous schoolgirls ✅ \n👶Undead foetus’ ✅ \n💩Possessed faecal matter ✅ \nToday at @MonsterPics #MonsterFest2019 X @Fangori… RT @uedmilsonpapo10: Era exatamente assim que os petralhas faziam \nEles riam e  zombavam das pessoas...\nExatamente assim!!! https://t.co/uJ… RT @uedmilsonpapo10: Os bolsonaristas fanaticos estao agindo exatamente como agia  os petralhas \nEstão deslumbrados e cegos pelo poder RT @SBTTheNoite: Hoje o The Noite é toooodo especial do Dia das Crianças! Danilo Gentili conversa com os criadores dos sucessos Galinha Pin… The Noite hoje é especial #DiaDasCrianças https://t.co/geD2NdWcc8 https://t.co/bsD9BVJHP9 RT @paularosiska: @DaniloGentili @rodrigo_dantasc Esses (m)amadores foram atacar logo o Danilo, que passou mais de uma década apanhando de… @lilianeborges35 @MauMeirelles Qual o jeito que a gente fala? @TheoBecker8 responde minha dm ai rapidao @lilianeborges35 @MauMeirelles 55 milhões de pessoas e precisam de bot pra subir tag. Tsc tsc @matoso_85 @MauMeirelles Nouuffa.... quanta braveza de alguém que nem o rosto mostra! Pq tanta urgência em vir defender uma militância paga? Qual o seu envolvimento com ela? Kkkkk @abressanin Mais um sonho meu alcançado com sucesso! RT @paulocruzphi: Reportagem histórica de @BlogDoPim. E antes que venham me encher o saco, só queria registrar que tem gente que recebe SEI… EXPECTATIVA: Teremos exército de fakes, subiremos tags, intimidaremos críticas, influenciaremos pessoas e emplacaremos narrativas!\n\nREALIDADE: pouco tempo de atuação e TODOS sacaram. Não meteu medo em NINGUÉM!\n\nEsquema repugnante e amador, mas q sintetiza muito bem os envolvidos. https://t.co/vNyqMg6Hh6 RT @MauMeirelles: Militancia ruinzona.\nNem 1 ano e todo mundo já sacou.\nSaudades militancia paga do PT. https://t.co/GmopwkuLEx RT @o_antagonista: BLOGUEIROS DE ALUGUEL https://t.co/JsbEbFKU1C RT @BlogDoPim: EXCLUSIVO: Mensagens de WhatsApp revelam como atua a militância virtual bolsonarista. Minha reportagem na capa da Crusoé: “O… Matéria excelente! Leiam, pessoal! https://t.co/vNyqMg6Hh6 RT @DaniloGentili: Sempre que eu uso alcóol em gel eu fico com a impressão que esse negão gozou na minha mão. https://t.co/hm2JEcPCBQ RT @CorrupcaoMemes: Entrevista top.\n@DaniloGentili https://t.co/a4asKSzI6H RT @TheoBecker8: O que acharam dessa ideia do @danilogentili ?! Achei bem interessante. Vi futuro! #koringa #coringa #desafio #interessante… O @TheoBecker8 vc podia fazer um ensaio sendo o Coringa pra gente. RT @RafaelMOrge: Cenas vazadas do filme do coringa. Com @TheoBecker8 e @DaniloGentili \n\n#coringa #joker #theobecker #danilogentili https://… RT @_Orcrim_: @bolsoneas então esse Leonardo da Alerj não é você?\n\nPergunta sincera, posso estar enganado, mas se for, está lotado no gabin… @Cardoso Hehehe Sempre que eu uso alcóol em gel eu fico com a impressão que esse negão gozou na minha mão. https://t.co/hm2JEcPCBQ RT @MatgomesCf: Assistindo essa merda de novo, filme bom pra krl @DaniloGentili #exterminadoresdoalem https://t.co/quC8PiCQBO Chegamos na Ásia! https://t.co/WojecM1qXk @Jonathanshouza Graaande Gorete https://t.co/51KDJgmLJn https://t.co/GWJLR0soLM https://t.co/q8Ba8ceCS8 Estamos na ásia! https://t.co/WojecM1qXk Madrugada exterminando a escória do além. Em breve estréia a série no @WarnerChannelBR https://t.co/JbjPTZig6I O Jim Carrey está no Brasil https://t.co/ANsH7rQeSs @carlavilhenaa Hahahahhaa :) RT @DaniloGentili: Essa é a vida, baby.\nEssa é a vida. https://t.co/DCLFA8YczE RT @DaniloGentili: Ser-humano é você! https://t.co/0jGH6K1CN6 https://t.co/nIlUhxTWZr @OscarFilho Uma outra expressao que qdo ouço só me remete a expressão sexual é: bukake RT @PrisonPlanet: Protesters in Hong Kong are using wearable projectors to evade facial recognition cameras. https://t.co/RFF4JmLwXh Noticia quente! https://t.co/mpQPUJGMJB Por enquanto através dos assessores empregados nos gabinetes dos deputados bolsonaristas tanto no âmbito federal como estadual. Tem também a suspeita mansão em Brasília onde opera jornalismo lambe-saco. Da forma como estão murchos dá pra ver que passam por um período de transição https://t.co/8PmiAPEqsN RT @moura_101: Estou pronto para convocar as pessoas para as manifestações dia 10/11 assim que o @FlavioBolsonaro  declarar publicamente se… Ser-humano é você! https://t.co/0jGH6K1CN6 Qdo eu te ver pessoalmente, dou. Parabéns! https://t.co/HTnJcEk4LO Essa é a vida, baby.\nEssa é a vida. https://t.co/DCLFA8YczE @RicoMota32 Eu estou provando que é @MAV_ERICK17 @MENTECACT0 Não vai tanto tempo assim.\nVc sabe. Vocês estão cada dia mais sozinhos. Seus patrões estão tornando cada vez mais difícil aderirem às suas narrativas. Vcs estão nitidamente mais murchos e decadentes. Vcs foram com muita sede ao pote, ficaram expostos demais. Eu acho q nao demora não. Tá sendo mais rápido q pensei. https://t.co/GnxRWa6hcQ @matheuzinhoac Isso te remoe? @LuisAlexandrino Eles acham que foi o monte de fake no twitter q controlou eleição @rgomes81 @keltonSCCP Apagou hahahah @Francelio1989 @Alefariascost É o q vc quer, mas não vai rolar. Continue se remoendo por isso. @Alefariascost Vai tentando... uma hora cola Não. \nPasse o recado adiante. https://t.co/YKNKhglR4o @Wasc89 Eu sou intelectual https://t.co/7g2eCeGvWZ @ProfBunazar @sempararoficial Compre coisas no nome dela.\nFiz isso com meu pai. Em defesa aos terraplanistas eu digo que esses objetos circulados são retos mas a lente da camera os deixaram curvados. https://t.co/BhStJUR55Z https://t.co/SPqRhYpMvr @_MarceloBianco Entendi. Bom, talvez se eu tatuar a foto do bolso no meu pau vc chupa ele entao. Ja entendi o q vc gosta. @MENTECACT0 Até todo mundo entender o que vcs estão fazendo. @FanOfUrbanII Nao respondeu, entendi qual é a sua @SpLbn @feltrinoficial https://t.co/FkqpHpdMHX Pergunta sincera para a militância de twitter e vaporwaves: Olavo tem razão ou não?\n\nhttps://t.co/PKoaApCWaL https://t.co/M4oAO3QBVT @_MarceloBianco Dá uma olhadinha no tuiter do ano passado fixado na minha tl? OPA! Lembro qdo fizeram manifestação PRÓ lava-toga. Vários aderiram. O q rolou meses depois? Ordernaram ficar CONTRA a lava-toga. Aí quem quis manter a coerência e permanecer a favor da lava-toga foi linchado. \n\nQuem é o otário que ainda adere a manifestação feita por essa gente? https://t.co/AHXXFcCIku Já mudou o discurso? Pq antes a ameacinha dos fakes que disparavam era sobre ameaça numérica mesmo. \n\nTípico. Vai mudando aí. Deve trazer algum consolo pra vcs esse tipo de coisa, Eduardo0279482719 https://t.co/2nXDSO5U66 RT @Flavio_Quintela: @DaniloGentili Ameaça de criança é assim mesmo: a única reação correta é ignorar. @paularosiska HAHHAHAHAHHAHAHAHHAHAHAHHAHAHAHAHAHAHAHAHAH https://t.co/fQgSfFUzag @Claudia18593305 12:20 e já está chorando? “The Noite” supera Globo com mais de 2 pontos de vantagem e é líder https://t.co/tZnbjPb2CR @rgomes81 @keltonSCCP Eu já começo a discordar desse apelido de “gado” uma vez que eles se revelam ser verdadeiros jumentos. @lucianoayan @flopcasta Eles sobem tag por fakes e automação, colocam fakes pra te xingar de maneira padrão, membros da ala bolsolavista usam o mesmo padrão visual dos perfis que achincalham todo mundo e acham mesmo que alguém precisa de um guru pra enxergar o óbvio. Não acho q sejam gados. São burros. @Alefariascost Eu faço isso lá sim. Aqui tb. Não caí nem lá e nem aqui. Qual o próximo argumento? @keltonSCCP https://t.co/tDsLSVdjcb @flopcasta O @lucianoayan descobriram que vc é meu mentor. Kkkkkkkkk @alanborned https://t.co/vzmMAMOsZS @RRicardomelo98 Chora mais @mpaolielo1 E como vc vê, não faz falta alguma. Hahahhaha Ontem demos 7 pontos. A Globo deu 4,8. Lideramos com extrema folga. De novo. \n\nA mensagem abaixo continua valendo. Militância de twitter não é dona do povo, não era antes e não é agora.\n\nVc q produz conteúdo não se intimide com essas ameacinhas dessa gente lixo não. https://t.co/9zuWI7v6I1 RT @_Orcrim_: Não tenho nada contra ou a favor de Flávio Morgenstein, mas se você acha que nossa justiça é cega, pense novamente: https://t… RT @Hialley: #TheNoite com @DaniloGentili  6.9 de média X 4.9 Globo e 0.9 Record (Prévia - 08/10)\n\nVia @BastidoresDaTV RT @aguedescartoon: E podem colar aí embaixo aquele porrilhéu de perfis fake de venda nos olhos me xingando que eu não vou ler mesmo. Vai s… RT @aguedescartoon: Aliás, ô mariquinha que se esconde atrás de perfil fake: pq vc não mostra a cara pra gente saber se essa sua dedicação… RT @aguedescartoon: O covardão aí do print (que nem sei se é um só ou se são vários) passa o dia patrulhando os outros. Parece até emprego,… RT @aguedescartoon: Ocultei a @ pq querem audiência. Dica: são aqueles covardes que escondem a identidade pra preservar a própria reputação… @GatasTodaHora É sua parente @deliomacnamara ? @_Orcrim_ @diguinhocoruja @PSL_Nacional @Bivar1717 @majorolimpio @delegadowaldir Amanhã quem será? Os caras repetem na boa, pois o diguinho já era traidor faz tempo. O gabinete do ódio já tinha determinado. Oi pessoal. Tô trabalhando muito e ando por fora. Qual o novo traidor da pátria e isentão do pedaço? RT @SBTTheNoite: Júnior Groovador fala tudo sobre o Rock in Rio e sua experiência ao tocar com Jack Black https://t.co/VDajBmBoIm https://t… RT @igorzismo: Sem crueldade não existe humor🥰 https://t.co/FnPpX4UAL6 Vídeo @moura_101 : https://t.co/yfga3gIZYH RT @Canal_90: da série: políticos que não suportam verem algo que funcione e agrade a população que ele se sente na obrigação de estragar h… @BernardoHrique @priweinstein Eu fico oscilando entre o cara que financia e o cara que recebe RT @LuceroMexico: Minha gente linda do meu Brasil querido! Cheguei! Estou com tanta alegria...não percam hoje com meu amigo @DaniloGentili… RT @fcastano_: Vo pedir corrida silenciosa no uber e no meio ficar tentando puxar assunto só pro cara ficar concordando e falando \"ahã\" \"pd… RT @PeacemakerSir: Nando Moura antes da eleição, já tinha casa boa, Mustang na garagem...\n\nO difícil é explicar como um cara que não tinha… RT @lucianoayan: Observem o baixíssimo nível da extrema direita. \n\nÉ engraçado que na época do Internet Livre (em 2018) a conversa era outr… @Maraisa Eu vou mudar, prometo RT @Flavio_Quintela: Quando o bolsonarismo desvanecer, abrindo caminho para um indesejável retorno da esquerda ao poder, os minions remanes… https://t.co/nf2HHbP2wi RT @ShotaNakama: I made something very special for @BrasilGameShow &amp; @DaniloGentili with my Brazilian brother @antonioteoli https://t.co/1J… RT @Flavio_Quintela: Que merda é o século 21. Nego tem que problematizar absolutamente tudo. Agora é a vez do Coringa. \n\nGente chata do cah… @RogerioMorgado @instagram O @LeoLins tá igual @ppacheco1 O curioso mesmo é que nessas entrevistas ele falou que estava feliz em estar no SBT e inclusive pediu emprego pro Sílvio no ar. Foi tratado por todos com carinho e a recíproca foi a mesma.\n\nNa ocasião opiniou sobre o episódio Peladão no Museu - curiosamente foi diferente dessa. https://t.co/1c2lQ9OLvu RT @LuceroMexico: Minha gente linda! O dia para estar no meu Brasil querido 🇧🇷 esta chegando!! 🎉🌟Emoção define!! Não percam #TheNoite estar… RT @_Orcrim_: Toma aí cambada de gado, enfia a cabeça no chão que nem avestruz pra fingir que não tá vendo: https://t.co/NauGA3Z2kj RT @lucianoayan: O Bolsonaro que fala para um ciclista que o Queiroz \"tá com a mãe dele\" é aquele que sempre diz que \"mexer com a família\"… RT @crisdbernart: Mas olha se não é o Dep. Estadual do PSL que tem 22 assessores e já gastou quase 40 mil reais em verba de gabinete pra ma… @pioli_tawane Também te amo S2 RT @BoletimCoppolla: A aprovação (em 1o turno, com folga) do texto principal da PREVIDÊNCIA NO SENADO prova que a decisão de @GilmarMendes… @cremildoa055 @LeoLins Sim. Mas vc nem se fosse poucos centavos. Nunca peça pro @LeoLins quebrar a piñata! https://t.co/qFXdQEU0u3 @lucianoayan “Se o Nando não falar as coisas que ordenamos que fale ele será do mal. Senão será do bem” Esse monte de arrombado atacando @moura_101 , os assessores de gabinetes pagos pra organizar investidinhas contra quem rejeita as narrativas bundas que criam não se tocaram ainda que 1.000 fakes não igualam nem de longe a força de apenas 1 indivíduo real com nome e rosto. What a night... what a lovely night... @melissa_ely @LeoLins https://t.co/Wv7Qun9KS6 Boa Noite @diguinhocoruja https://t.co/IaauGFQ83w RT @sounanyzinha: Pra quem gosta de escalar montanhas, tirem dúvidas sobre o CUME das montanhas!\n\n#TheNoite @DaniloGentili https://t.co/leX… RT @CrissPaiva: Os cães ladram e a caravana passa. https://t.co/ArWagCU6Px HOJE TEM! https://t.co/IEyhHiUe8o RT @matheusueta: Já estou no ensaio geral de PETER PAN aqui no #teatrobradesco\n\nEstreia esse SÁBADO.\n\nVENHAM 🧚‍♀️💚 https://t.co/dlMSMqpP1J @NotErik6 Hahahaha Eu fui cumprimenta-lo e o idiota começou a tirar um pano da boca https://t.co/tilnuSPaeI https://t.co/UbaU6Hvrx7 @marcurelio Eu nem te vi lá seu viado RT @aguedescartoon: Verdevaldo, o homem que defende vazamento - mas quando o alvo é o maridão, é seletivo é ilegal.\n\nVerdevaldo, o homem q… RT @zarchutz: @DaniloGentili Tô ancioso pela série o filme foi da hora demais,  espero que a série  seja tão boa quanto, e  os efeitos espe… @Inervision E foi assim até o final...\nhttps://t.co/3wJj0cm9jn\n\nInveja mais que eu acho legal huaaaaa @RafaelTorneiro Chora mais @FARIAPERICLES @TheNoiteOficial Sempre um prazer recebe-lo! RT @FARIAPERICLES: Hoje estarei no @TheNoiteOficial com o @DaniloGentili, quem aí vai assistir? https://t.co/iIMxmfmeFS Como Danilo Gentili fez do \"The Noite\" o principal talk show do Brasil https://t.co/Hhf5Edycpm \"The Noite\" torna-se o maior canal de um programa de TV do Brasil na web #sitenatelinha -  https://t.co/m5TMtoPeGL RT @diogomainardi: Tome que o hacker é seu, Verdevaldo https://t.co/AXiisXcTzs Siga: https://t.co/Dt7hzPNbYp https://t.co/hHKkSpBZdb RT @CaBertolazzi: Tá nos anais do Twitter https://t.co/8pNblK3uj1 https://t.co/i4ykkVkWVU RT @BlogDoPim: Senado aprovou texto-base da reforma da Previdência em primeiro turno, por 56 a 19. Criticar suspensão da investigação sobre… Só vi agora\nMas adorei\nObrigado! https://t.co/pRBj0yITIk O que é o ser-humano? https://t.co/IbmsETn8Oe @aguedescartoon Tá em shok?\nKkkkkkkkkk @cmcarolmachado Demais :) RT @cmcarolmachado: @DaniloGentili https://t.co/BdmsSqNSw7 @aguedescartoon Pegou pilha?\nNão aguenta crítica?\nPara que tá chato.\nVai perder seguidor hein! Tiringa curtindo passando na sua TL https://t.co/ME4Z2X8k7z Ajude - a sua ajuda fará muito a diferença.\n\nClique aqui: https://t.co/2p5WpWhxYr https://t.co/kpLYYg1nVA RT @RavenBanner: Welcome #October1st❗Here's what we're looking forward to this month ...\n💀@fabriciobittar's #GHOSTKILLERSVSBLOODYMARY scree… @_Lucianalucy Vou arrumar lra vc Irá sim! Na sexta! https://t.co/mmoRjQ7sY0 Parabéns pela conquista @diguinhocoruja ! Ver o próprio pinto não é pra qualquer um. https://t.co/Nr0lhwZpsT Eu e @BoletimCoppolla na reunião oficial da internacional socialista traçando os próximos planos pra salvar o mundo do capitalismo https://t.co/r5Osbwz1PJ RT @BlogDoPim: Para fazer cortina de fumaça em torno dos agrados mútuos entre ministros do STF e Flávio Bolsonaro, que ainda fez pressão co… RT @RogerioMorgado: Vou gravar o Talkei Show pela primeira vez no Teatro Renaissance e o convidado será o @afonsopadilha_ compre já no link… Parabéns @peterjordan100 https://t.co/lxMprTlN0E @CarneMoidaTV @peixeaquatico @BoletimCoppolla Deixa a Mama ver isso! https://t.co/c2WzwJjCu3 E claro, eu comi https://t.co/qWVrb6vx0p Levando o @BoletimCoppolla pro mal caminho\n\nSigam o cara! https://t.co/XJp4kbRO2L RT @_Orcrim_: Thread sobre os ataques a partir do gabinete de deputado contra @DaniloGentili, @aguedescartoon e possivelmente outros como @… @fcastano_ Muito bem observado @Maraisa razão do meu libido RT @fcastano_: a forever 21 declarou falência... ora ora parece q n era tao forever assim ne @fcastano_ Era Forever até o 21\nChegamos nesse século RT @o_antagonista: Moro: “Só não vê quem não quer” https://t.co/5Bzrx9hdB0 RT @sounanyzinha: Eu tô só o Jack, levantando na segunda-feira!\n\n#ExterminadoresDoAlem @DaniloGentili https://t.co/visAzyE57i @Maraisa Oi fake Boa Semana pra todo mundo! https://t.co/6rrnY2n6E7 Sim. Isso tudo é obra do meu avó Ulderico Gentili. https://t.co/DfRyHRhRoX https://t.co/VWKljPE6gA RT @CarneMoidaTV: https://t.co/ZJIh7y9gqU https://t.co/BmPAyjWJtH @ProfBunazar Depende https://t.co/0LNDvoxVb3 @ProfBunazar Eu não sabia que vc é crítico de tv. Essa me pegou em cheio. Que falta de respeito https://t.co/i3PCmaHgC5 Disse e vou https://t.co/ArwivNVOM9 @CarneMoidaTV @Vinheteiro Não seja rebelde com o papai https://t.co/6m0hsO0nxg Ora ora se não é o Dom Diguinho https://t.co/zY59brPpNW @Vinheteiro @CarneMoidaTV Vocês transaram? @CarneMoidaTV @peixeaquatico Top \nMara\nDez Em breve no @WarnerChannelBR ! \nO Exterminadores do Além - A Série https://t.co/P6f5bOwyyJ @Hialley \\o/ @RBMonte Mas a foto é de 10 anos atras hahaha @phalvaradoo @GiseleDaminell2 “Ele falou mal das rola q eu chupo... menino feio... nao gosto mais... mimimi”\nHahahahaahahhaja E é verdade mesmo @CaBertolazzi o @arecobarudino tava junto no dia https://t.co/9imEXxeSdE @bethmoreno @celsoportiolli Ah então é isso q eu sou pra vc? @medo_b @CarneMoidaTV Chegou a Zézona do Caixão @CarneMoidaTV Alguém precisava ter dito isso Sigam meu insta que o bagulho lá tá doido! https://t.co/gOMwOfWdzm @RonaldoAraujo06 Kkkkkkkkk\nO bagulho foi bem doido @sounanyzinha Vcs foram demais :) E elas se divertiram muito \\o/ https://t.co/PwwySvwaa4 @docmbl Tá decretado aí dia 27/09 o dia nacional da zuera? Se tiver ano que bem dou outra festa. Você pode fazer a festa que vc quiser. Mas eu duvido que vc consiga levar na sua festa cuidadoras de porco! https://t.co/H9zZ2U2ggF https://t.co/uwVAKhjnBD RT @DaniloGentili: Obrigado todo mundo aí pelas mensagens de aniversário. Não é todo dia que se completa 35 anos. https://t.co/KjFtzh2NU2 Legal Celso, legal.\nEu vou te processar por essa brincadeira, saiba disso. https://t.co/pza3HsONJy @silvioluiz 32 RT @GiseleDaminell2: Porque eu gosto muito do trabalho dele a muitooo tempo e tb pq hoje é seu aniversário! 😉 https://t.co/JKyxxOit2b Que arte linda! É uma honra enorme ser desenhado por vc :) obrigado. Postarei no meu instagram segunda! https://t.co/W8ceYQONkZ RT @DaniloGentili: Gostei da manchete @otvfoco https://t.co/PPLV8WT6eF Gostei da manchete @otvfoco https://t.co/PPLV8WT6eF @heuwald_jose @_Lucianalucy @diguinhocoruja Sdd @bethmoreno Pra isso basta colocar um pouco mais de repolho na sopa @alemarcou @bethmoreno Hahahaha alguém filmou ele lá em cima no inferninho? @bethmoreno seu filho já recuperou? Hahahahah @alex_borges @diguinhocoruja Tô formando Dossiê @alex_borges @diguinhocoruja Nao vi vcs subirem lá heinhahahahah @calabresadani S2 @cariocadelegado S2 @MariliaMaciel @bethmoreno É pq eu vesti todas @andreazzaeditor @RenanSantosMBL Valeu meu jovem @Cardoso \\o/ RT @pewdiepep: @peixeaquatico CARAIO PEIXE QUE FITA É ESSA AI? https://t.co/dN7IyTSlJj Obrigado todo mundo aí pelas mensagens de aniversário. Não é todo dia que se completa 35 anos. https://t.co/KjFtzh2NU2 O baguio tava loco @diguinhocoruja https://t.co/we2K11OzY0 RT @bethmoreno: Obrigada, @DaniloGentili.\nRepus meu estoque graças à decoração da festa. https://t.co/ID1jFXo7wC @MarceloTavares Valeu meu amigo! @BrRainbowGirl Poxa, era só ter dito q eu sou um merda :) obrigaso @MariliaMaciel Semi-Vivo @lucas_wkd O seu verdadeiro eu está muito bravinho com invejinha. Maneira aí carecão. Tá dando muita pala. Kkkkkkkk RT @comuniquese: Eis que o @DaniloGentili é líder novamente\n==&gt;&gt; https://t.co/kbWae4oegn\n\nhttps://t.co/kbWae4oegn @lucas_wkd Tenho uma idéia melhor: crie um programa vc e faça isso ;) Mando essa pra vcs q produzem conteúdos web/tv. Sei q qdo vcs contradizem as narrativas oficiais da militância sofrem enxurradas de ameacinhas desse tipo. Saibam: Militância não é dona do povo e perfil fake repetindo ladainha não é o povo! Siga o q vc acredita e foda-se o resto. https://t.co/0CxLCstx1z Danilo Gentili recebe Bonde do Tigrão e The Noite lidera audiência https://t.co/X0Vr9P47xJ No PTinder se você não encontrar o amor da sua vida você encontra um parceiro de crime. RT @DaniloGentili: Mais um dia exterminando a escória do além. @murilocouto @LeoLins https://t.co/FL0Ybn40LE @_Orcrim_ Eu posso xingar vc tb , ou discutir, o que vc preferir https://t.co/9Ud9R5KqWW @MauMeirelles Pegou pilha? Esse eu sou fã! https://t.co/0Dyp4q24Qa RT @BoletimCoppolla: PoeminhO do Contra \n(Mario Quintana, 1906-1994)\n\nTodos esses que aí estão\nAtravancando meu caminho,\nEles passarão...\nE… RT @mariosabinof: Sugestão às agências de checagem: chequem se Lula diz a verdade quando jura que não roubou. RT @PriAlcantara: meu primeiro dia viva como uma indicada ao Grammy. boa tarde. @MauMeirelles Cazuza era herói? @gibranteske @Ademarzineo @murilocouto @LeoLins Boa! \nSerão 10 episódios. Passará no @WarnerChannelBR Mais um dia exterminando a escória do além. @murilocouto @LeoLins https://t.co/FL0Ybn40LE @cariocadelegado Os últimos na vibe dela que realizaram seus sonhos mandou um monte pro saco RT @ProfBunazar: Leiam nas entrelinhas: “o certo é agir como nós agimos, isto é, fingimos que somos bonzinhos; vestimos nossa pele de corde… RT @ProfBunazar: “Quantos ossuários não foram cavados em nome do desejo de fazer o bem, de tornar os homens melhores a despeito da vontade… Eu não sei ao certo quem roubou os sonhos dessa garota, mas se foi você e estiver me lendo agora, te faço um apelo: NÃO OS DEVOLVAM! https://t.co/p90Ggtslv3 RT @murilocouto: Entendo você querer o bem do planeta, mas diga a verdade, você aguentaria ser pai/mãe desse anjinho? https://t.co/ncSc3gEo… @arecobarudino Ora ora @arecobarudino E quando vc não coloca a banana no meio do pão a coloca onde? RT @fcastano_: Qndo meus pais me fizeram perder um ep de cavaleiros do zodiaco https://t.co/CQa6eZzz5T @Uliangelo Vc precisa ver o que estamos fazendo na série https://t.co/l8AlEcLWnB RT @igorzismo: NOTA DE REPÚDIO À IMPRENSA\nO artista Igor Guimarães (ator, ex pânico, humorista, artesão, amigo) lamenta a postura da impren… RT @TMarretaMMA: Hoje tem @sbtthenoite com @danilogentili 🙃 será que me diverti? 😅 fiquem ligados no @sbtonline @sbtriooficial 1h da manhã.… @paulimsonik89 Ahhaha boa RT @celsoportiolli: Nunca esqueço quando fui no seu programa e disse que havia perdido meu pai e o Roger disse: Já achou?  Nunca mais fui o… https://t.co/VLjAxDXHGQ @HenriqueCdS15 Vai ser bem pior! @RafaelTorneiro No @WarnerChannelBR ! Os Exterminadores do Além - A Série https://t.co/akLgE7Lxej Vou pedir pro @SBTTheNoite ver isso! https://t.co/Y3TJ1KqSid Eu estava aguardando o Toninho melhorar para entrevista-lo. Ficamos meses aguardando. Que pena.\n\nObrigado ao Toninho por sua contribuição na defesa do mundo livre. https://t.co/aczNjK7Rt3 RT @BlogDoPim: Humorista militante finge acreditar que seu relato preventivo à revelação policial constitui motivo suficiente para jornalis… @ArnaldodPaiva Nessa história toda eu só fico realmente chateado por imaginar que um dia vc assistiu. O que eu fiz de errado no passado para uma pessoa chata como vc assistir meu programa? Bom, o importante é o presente, valeu por não assistir mais. Continue assim! RT @diogomainardi: Verdevaldo está fora do Brasil? Ele volta? Esse é o tipo de humor que eu tenho levado para o Brasil. https://t.co/WvKG4dp7jf RT @mariosabinof: Que jornalistas são esses que repassam o contato de sua fonte -- e \"anônima\" -- a humorista e sabe-se lá quem mais? RT @DaniloGentili: A @RevistaCrusoe publicou um diálogo que mostra a fofoqueira de cortiço @ggreenwald conversando com o hacker sobre a inv… RT @MBLivre: 4 horas depois, um outro comediante aparece trocando mensagens com o hacker. Que coisa. \n\nhttps://t.co/GerR0yQBkl https://t.co… RT @o_antagonista: .@DaniloGentili repercutiu a notícia da Crusoé sobre o diálogo entre @ggreenwald e Luiz Molição. https://t.co/hdZOqw7pED Vejam as “coincidências”:\n\n1) Demori, lambe-saco do Lula e blogueiro do intercePT, me acusa de algo absurdo. Ele quer provar a tese que eu só fico zuando o PT pq eu seria pago pelo Bolsonaro\n\n2) Meu cel é hackeado\n\n4) Chefe dele fala com hacker da lava-jato sobre meu hackemanto https://t.co/mweLsT5TbP RT @diogomainardi: Vai responder, Greenwald? https://t.co/vsxqwWuikE A @RevistaCrusoe publicou um diálogo que mostra a fofoqueira de cortiço @ggreenwald conversando com o hacker sobre a invasão do meu celular. \n\nPergunto: Pra que hackear UM COMEDIANTE? Lembrando: sou o comediante mais atacado pelo intercePT.\n\nCoincidência ou formação de quadrilha? https://t.co/JRoO4LDA4f Segunda Feira https://t.co/4KfI4I4mJk RT @matheusueta: A cara da segunda-feira ☠\n\nOs Exterminadores do Além - A Série\n\n\"As forças do mal são poderosas. Mas nada vence a estupide… RT @Michelsyoung: Vale a pena ver The Noite: Quase um ano do DOSSIÊ do bigode da avó do Ricardo. ⚠️⚠️⚠️\n@DaniloGentili \n#thenoitecomDaniloG… RT @matheusueta: Quem passa o FDS brincando com fantasma termina ... 👻☠\n\n#OsExterminadoresDoAlém a Série.\n\n@WarnerChannelBR @DaniloGentili… @Felipe_Davi Série! Domingo à noite tamo assim https://t.co/zbTFvBQ8Ps @gabrielachiste @RavenBanner @LeoLins @murilocouto @sikerajr Tenta mudar a localização pra Brasil ou México ou país espano que vai! RT @RavenBanner: “#GhostKillersvsBloodyMary, an epic Brazilian export with plenty of scares and barrel loads of laughs” \n👻👻👻👻@DaniloGentili… RT @matheusueta: https://t.co/maskZXarvt RT @Kassia_Teixeira: CARALHO!!! Tu perde uns dias do #TheNoite e já acontecem umas mudanças surpreendentes e inesperadas, tipo o @DaniloGen… RT @BlogDoPim: Nada contra quem encontrou em eleger um candidato ou uma candidata o sentido de sua vida, ou um meio de conseguir um cargo p… Hoje foi um dia pesado no trabalho... https://t.co/5FgGnv805s @peterjordan100 @Fiaspo Vc só grava vídeo da Marvel O que você faz sábado à noite? Eu caço fantasmas.\n\nSiga https://t.co/QrkF3TENQr https://t.co/kLhyvT5OX0 RT @Flavio_Quintela: Quando @DaniloGentili, @BlogDoPim, @o_colecionador, @lobaoeletrico e outros “isentões” postam algo q desagrada o gado,… Muita gente fala isso @TwitterBrasil https://t.co/FioPRkMoVJ RT @CibeleBatistaa: Ain gente como eu estava com saudades do leite show no #thenoite com @DaniloGentili \nOlha a carinha de quem inventou a… RT @ROrsioli: @DaniloGentili Recadinho da @cureAntonella Pra vc: tio Danilo estou lutando muito aqui pra viver, por favor não solte minha m… RT @BlogDoPim: Eleitorado de Bolsonaro é bem maior que militância de gabinete e crachá e seus seguidores. Há militância espontânea disposta… RT @BlogDoPim: Os carreiristas de gabinete, que julgam ter ascendido na vida puxando saco de político e virando flanelinha de militância, n… https://t.co/ujQYpKEEoa https://t.co/M6dBYyLrzw @EduPrimitivo @MrPoladoful Eu não sabia que vc era o fiscal do twitter. Sério. RT @MrPoladoful: aí @DaniloGentili o bbno$ que fez o hit LALALA (https://t.co/SLqAAmKYNr)  vem pro Brasil e tá LOUCO pra ir no teu programa… @MrPoladoful Valeu mano!  Vou levar lá pra produção! O @DiogoPortugal me convocando para o próximo #risorama https://t.co/gcaAgdUM2U RT @KevinOChris: Família, passando para avisar que vou estar hoje no @SBTTheNoite, com @DaniloGentili, a partir das 00:30!🔥 Quero ver geral… RT @_mmariacosta: MEU CACHORRO FUGIU NA REGIÃO DO COOPHASUL\n\nELE RESPONDE POR -TECO- \n\nPELO AMOR D DEUS DA UM RT PRA AJUDAR A ACHAR ESSE SA… RT @aguedescartoon: Bolsonaro precisa vetar a promiscuidade do fundão eleitoral. Eu votei nele pra isso, eu não votei no Maia - e deste esp… @soldado_do_amor @aguedescartoon Ahhahahhahahah que pau mandado de merda @NildilaineS @_Orcrim_ @aguedescartoon Isso seria tipo eu ter um Aras num cargo de confiança, não acha? @_Orcrim_ @aguedescartoon Hahahahah vivi pra ver isso RT @aguedescartoon: O pessoal quase tinha um filho pela boca quando alguém dizia \"bolsonaristas\".\n\nDo dia pra noite, começaram a encher a b… @Wasc89 Valeu \\o/ Se você curte efeitos especiais old school, cinema e bastidores siga o instagram: https://t.co/rZWxPRJ2z0\n\nTô cobrindo o bastidor da série lá! Tá bem divertido. RT @BlogDoPim: Aulinha básica de lógica e jornalismo:\n1) há vazamentos de conversas privadas por violação criminosa de aplicativos de celul… RT @DezMold: @allantercalivre Alegando curiosidade sobre o financiamento de uns jornalistas, no terceiro tweet vc tranquilamente revela end… RT @marcurelio: Uma vez eu fiz uma conta falsa no MSN Messenger para me passar por uma mina de quem o @DaniloGentili era a fim. O papo foi… RT @ProfBunazar: Uma manifestação a favor do aborto está amparada pela liberdade de expressão; já ensinar a abortar é crime.  Igualmente se… RT @matheusueta: Só + um dia normal combatendo as forças do mal\nAushaushauhsuahau \n\nOs Exterminadores do Além - A Série\n\n#OsExterminadoresD… @kimpkat Pela sua cara vc sentou no croquete @arecobarudino Hahahahahah E NÃO É SÓ ISSO!\n\nAs 10 primeiras pessoas que assistirem hoje levarão pra casa um brinde surpresa! https://t.co/koFB7TRgMY RT @DaniloGentili: É nóis, Sly! #RamboLastBlood #Rambo https://t.co/SexJHp6SRq RT @FabioGuere: Ebaaaaa PTistas ganharam uma baita grana na mega sena. Certeza que vão ajudar os pobres. @arthursimone73 O filme do Rambo deve ser assim: Rambo dá uma palestra sobre consciência social entrega flores para bandidos. RT @DongHeeChul: Eu acho foda essas pessoas q n tem medo de filme de terror. eu me caguei com a porra do \"\"Exterminadores do Além contra a… RT @SIRIRICASCUDA: Exterminadores do Além \n\nTem q ter estomago forte pra sobreviver á essa tortura desumana de filme protagonizada por Dani… Vamo aí! https://t.co/dhZXyP9tJP RT @matheusueta: Hj iniciamos as gravações de Os Exterminadores do Além - A Série, acompanhem nos stories @feltrinoficial Aí vc disse tudo @CevadaPopbeta @lucianoayan Não concordo. Nando sempre deu seu nome e rosto e arcou com as consequências de tudo que disse. Ele é um individuo com nome e rosto e o que ele denuncia é uma máquina coletiva e anônima, desonesta. Esse episódio  todo me mostrou que o Nando é independente e eu o admirei por isso. RT @roxmo: Essa guitarra está sendo rifada.      As rifas estão no site \nhttps://t.co/xFrHDELMTY            Toda a renda será revertida par… RT @DaniloGentili: O governo precisa contratar gente mais influente para coordenar boicote e direcionar audiência. \n\nOs parasitas que eles… RT @arecobarudino: o gado bolsolavista tentando intimidar o cidadão normal nas redes sociais https://t.co/Qb6X6xn1eK @albaexpider Nossaaaaaaa bi....  meu negocio é mulher @albaexpider Vamo junto. É nóis, Sly! #RamboLastBlood #Rambo https://t.co/SexJHp6SRq Melhor propaganda que essa não tem! Eu estava na dúvida se iria assistir, mas agora me decidi. NÃO VEJO A HORA DE CORRER PROS CINEMAS! Quero ver Rambo V logo! https://t.co/Lz0MnPYNt4 @priweinstein E da carreira também. Chamar AllanTerçaLivre de gado é injusto. \n\nSe atentarmos para o tamanho da gengiva, as moscas que rondam sua volta e a maneira frenética como balança o rabo excitado sempre que avista um cavalo da militância dando coice, dá pra ver que não é gado. É uma égua pangaré no cio. https://t.co/1QR3YUjdZg @alan_granzotto Eu acho que se foi isso o q vc leu no twitter acima é analfabeto funcional @eversandrade @cremonini_regis @lobaoeletrico Eu sou o mesmo, amigo. \nEu que te digo: seja esse fanatico lambedor de politico na vida real. Veja qtos amigos te sobram ;) @MauMeirelles O Dudu na TV Brasil pelo visto não. Kkkkkk @lucianoayan Imagina o seguinte: tá rolando uma onda de assaltos. Todo mundo sai na rua e é assalto. Então diferentes vozes começam a dizer “estão assaltando na rua tal. Evitem esse local”. Aí a gang que assalta começa a chorar dizendo que são vítimas de conspiração. \n\nÉ disso que se trata. @noronhhaa @JpFrambachh Nao. O aumento do meu sucesso foi assim: 1) standup / 2) cqc / 3) agora é tarde / 4) the noite. Perceba que foi tudo em cima do que eu criei e trabalhei. Nada teve a ver com gente lambendo saco do bolsonaro. @cremonini_regis @lobaoeletrico É que pelo que dizem eu achei que quem dava audiência eram os bolsonaristas. É o que sempre dizem quando eu critico o governo “sua audiência vai cair hein!” Kkkkkkk Comentários assim nunca tem o número 98472672939 após o nome ou rosto escondido por foto falsa. Curioso. https://t.co/elOG2FK6wp @JpFrambachh @noronhhaa Na real eu já tinha sucesso quando o Bolsonaro era só um deputado desconhecido. Diferente de quem hoje é pago pra sustentar blog governista eu construí com meu sucesso trabalhando não lambendo saco do bolsonarismo. Kkkkkk @noronhhaa Mentiu sim. Fica tranquilo. Eu conheço os indices, trabalho no meio, sei como funciona. Funciona assim: se você faz um trabalho bom funciona. Se não faz não funciona.\nNada tem a ver com política nem com ameacinhas. Aliás, cade o público anti-pt e conservador vendo o dudu? Kkkkkk https://t.co/G5STGSpvvT O governo precisa contratar gente mais influente para coordenar boicote e direcionar audiência. \n\nOs parasitas que eles escolheram para adularem seus sacos são muito fraquinhos...\n\nO cara não consegue queimar nem a própria gordura e quer queimar o trabalho dos outros. Kkkkkk https://t.co/rTsn0G2hNF “The Noite” lidera audiência pela segunda noite consecutiva https://t.co/jv4upMsq93 @BlogDoPim Ahahhaaahhahahah\nÉ a nova era, bebê! RT @BlogDoPim: Quem ficar no governo Witzel deve se desfiliar do PSL, avisa Flávio Bolsonaro. Já os 7 (dos 12) deputados que se abstiveram… Sigam o instagram do https://t.co/pSGBGZdnBl para acompanhar todas as curiosidade dos bastidores. \n\nMostrarei lá todas as curiosidades dos efeitos old-school que usamos: sangue, mortes, artes conceituais e tudo mais. Lives dos bastidores. E por aí vai. Siga o perfil no insta! https://t.co/pEzQvS7b3c @Cardoso Heheheh craroooo E nunca se equeçam: As forças do mal são poderosas, mas nada vence a estupidez. https://t.co/VirzNBcvqj Até agora o filme que deu origem a série recebeu ótimas críticas internacionais, ganhou prêmio de melhor gore em Londres, melhor filme latino-americano no México e teve destaque em festivais na Suiça, Rússia, USA e Canadá. \n\nEnquanto isso a Folha de SP o Classificou assim: https://t.co/0NgnRe7fIu Hoje iniciamos as filmagens da série. \n\nSerão 4 meses de trabalho para filmarmos 10 episódios. \n\n10 ameaças sobrenaturais diferentes. 3 idiotas para combate-las. Em breve você poderá assistir no @WarnerChannelBR https://t.co/2EDb4oGony RT @matheusueta: Mode ON \n#ExterminadoresDoAlem\n#Daniel\n#Renato\n@WarnerChannelBR \n#ClubeFilmes\n@DaniloGentili \n@LeoLins \n@murilocouto https… @katapir1 Eu não preciso falar das coisas boas do presidente. Já tem um monte de gente paga,blogueiro lambe saco e bot igual vc pra fazer isso. Pede pros vaporwaves falar. \n\nAliás pq está cobrando o que eu devo falar ou não? Vc é pago pra isso? @onurb_eu Uiiii decoradoraaaaaaa hahahaah @lucasloulux Deu não.\nE ainda que tivesse dado , ainda assim, estaríamos melhores do que vc já esteve a vida toda. Kkkkkkkk https://t.co/uNpDLKebjC @Alex22205660 Qual foi a arrogância cometida, amigo? Tá muita genérica essa acusação aí. \n\nEntrei no seu perfil  e vi que fica o dia todo só postando coisa pró-bolsonaro. \n\nAbre o  jogo. A arrogância que estou cometendo é mandar patrulheiro governista tomar no rabo. Fale a verdade, chupador. @mizuno_arq @arielescorrea @itmauricio Hahahhahah RT @VladSantos_80: #TheNoite \nTiringa e Falcone no Universo Cinematográfico Marvel em breve. Agora sim vai ficar bom. 🍿👀 https://t.co/8I6gZ… RT @BastidoresDaTV: Real Time - São Paulo à 01h19: \n\nSBT 6.3\nGlobo 5.7\nRecord 1.2\nBand 0.7\nRedeTV 0.5\nCultura 0.1\nGazeta 0.1\n   \n#TheNoite… Goodfellas... da puta https://t.co/WZ9Vt9asB4 @lucianoayan Nossa pq ta falando isso? Tá em shok? Pegou pilha? Kkkkkkkk RT @JoaoMiranda40: Esses bostas vão ser lembrados no futuro como uma das massas de manobra mais escrotas da história desse país. RT @RodrigoEucampos: @TelemaniacosTV @DaniloGentili Isso porque a turminha que adora chupar rola de político falou o quê o Danilo ia sair d… RT @TelemaniacosTV: Além de ser líder de audiência na televisão, The Noite com @DaniloGentili vira sucesso no YouTube e supera Poliana #The… RT @tvabordo: Talk show @SBTTheNoite com @DaniloGentili  volta a vencer a Globo e voa alto no @SBTonline https://t.co/YKF4nH7s2o https://t.… RT @blogteleguiado: “The Noite” bate Globo em plena segunda-feira e lidera audiência https://t.co/ULSknB2lJ8 https://t.co/l9L3Gbllmj @JFlavioJunior Kkkkkk @PrimatasSPFC @RicoMota32 Quem está apoioando acordo com STF pra livrar a barra de corrupto não sou eu. Kkkkkk\n\nPerdeu de novo.\nPor isso vc não mostra a cara né? Pra não passar vergonha. RT @HeyLeticiaGodoy: Depois de mais uma piadinha de humor que o @CarneMoidaTV fez com o seu amigo @DaniloGentili o @TwitterBrasil suspendeu… RT @BlogDoPim: Eu não me divertia assim nas redes desde que os MAVs (apelido que popularizei) negavam o mensalão e o petrolão, demonizando… RT @BlogDoPim: Blogueiros de crachá contam com o cadastro dos ingênuos que ainda creem que qualquer cobrança ao governo abre caminho para a… RT @BlogDoPim: Integrantes do PSL se assustaram com o cadastro de militantes e veem o risco de “um culto personalista, que vai levar o pres… @RAlexandreAS021 @HudsonJnior7 Chora mais? Tô rindo com o seu recalque, bem. @dudacorsini1 Não existe MAV https://t.co/OzbmIo8SYb RT @gustavosneves: Gosto das “madrugadas” do @SBTonline! Começando pelo @DaniloGentili , depois @otaviomesquita e finalizando com o Roda a… Muito Obrigado pela excelente audiência hoje :) liderar em dia de Tela Quente não é fácil.\n\nE houve boatos que eu estaria na peor... se isso é estar na peor... pouuuurra... https://t.co/oQJhj0Z7KH RT @LipeuBFR: Começou o programa mais idiota da TV e ainda assim o melhor kkk\n\n#TheNoite com @DaniloGentili RT @BlogDoPim: Quem...\n\n“Divide a base”\n“Vira casaca”\n“Trai o movimento”\n“Ajuda a esquerda”\n\n...são aqueles que recorrem ao acordão da impu… @silva_mishel @cureAntonella Se vc viu na internet é pq é verdade. Parabéns. https://t.co/QzAgyZBkXG @silva_mishel @cureAntonella Não ganho 300 mil. E fique tranquilo com a minha parte. Foque na sua. Por favor, pessoal, eu peço que vcs ajudem. Muita gente pode fazer a diferença. Entrem em @cureAntonella . https://t.co/p6tiYXbBNb @arecobarudino Hahahahahaha RT @juliaxtina: só opino sobre coisas que eu entendo e por isso que não opino sobre nada Parabéns para a @RevistaEpoca por reconhecer.\n\nUma explicação necessária https://t.co/h1uJc6vk7e @CarneMoidaTV Cara, o que eu fiz eu fiz por te admirar de uma maneira especial @CarneMoidaTV Vc é um arrombado @cremonini_regis Queria saber onde ela compra esse batooooom @RicoMota32 Já estão evoluindo. Antes não admitiam que era pouca gente controlando muito perfil. Hoje já admitem... hmmmm...continue... @Edu_miragem Isso... @qdanielq_ Claro, claro... Tudo normal e espontâneo por aqui, bip bip, bop, biiiip... o povo segue engajado... bip biiiip https://t.co/qtK2w5Fz3P RT @rodrigodasilva: Nunca votei no PT. Não acredito na inocência do Lula. Não defendo a tese de que Dilma sofreu um golpe. \nDito isto, Bols… RT @BlogDoPim: Para quem só concebe ser a favor ou contra pessoas – não ideias e atitudes –, é natural a incompreensão real ou forjada de q… Essa é a mais linda que surgiu nos últimos tempo... ai ai... https://t.co/SFFIc8QJhl @F_Fratelli @cor0te Yep RT @o_colecionador: Igualzinho petista de uns 4 ou 5 anos atrás:\n\n- Ainn, mas e o PSDB?\n- Ainn, não tá com a gente é pq é tucano.\n\nSão igua… @Rennatts @dimacgarcia @BlogDoPim Qual foi o piti, amigo fake? Vcs não aceitam criticas? Basta colocar um argumento q vcs choram - e choram escondidos atras de fakes. Vcs nao vao longe assim, muita falsidade. Todo cristao sabe q no final a mentira perde. Kkkkkk @RonanBNU @dimacgarcia @BlogDoPim Eu tô frustrado demais com isso. Me ajude a ser bem sucedido como vc? Kkkkkkk @dimacgarcia @BlogDoPim Vc roubou essa frase do @CarneMoidaTV . Veio lacrar com ela. Kkkkkkkk RT @BlogDoPim: O PSL, partido do presidente Jair Bolsonaro, tem 4 senadores. O único que não assinou requerimento para investigar Dias Toff… RT @JoselitoMuller3: Defender pessoas, em vez de ideias, é ser conservador sim, amiguinhos, podem confiar. Você não é gado, não. Acredite 🙂… @bianchin_pietro @BlogDoPim Não são conservadores. São bolsonaristas. É o que está escrito no cadastro. @dimacgarcia @BlogDoPim O Felipe nunca fez nada contra a militância petista. N A D A. Vc com seu twitter é que é o herói do Brasil, cara.\nParabéns. RT @BlogDoPim: Aliviar bandidos em nome do comunismo ou do combate dele é expediente não de conservadores, mas de revolucionários e reacion… @doisdedosdeteo O pessoal quee ganhar o mundo. E vai perdendo a alma. @doisdedosdeteo Eu te falo tudo que dirão depois disso. É o mesmo padrão pra todo mundo. @doisdedosdeteo Essa onda de ataque do “ain para que tá chato” e “esquece política e volta a fazer piada” eu tb passei. E acredite: e um software q dispara contra vc frases randômicas. Por isso aparecem em ondas. Tb tive a fase do “sua audiência vai cair hein” https://t.co/86TX1keszD RT @o_antagonista: A falange chapa-branca, seguindo as ordens de Olavo de Carvalho, resolveu criar um cadastro para a militância pró-Bolson… RT @BlogDoPim: Disk-militante agora tem cadastro. Se você seguir direitinho a orientação da assessoria do regime, via WhatsApp ou reunião e… RT @jairbolsonaro: #debate64 A Esquerda na oposição queria CPI p/ tudo. Hj CPI é palavrão. Enganaram trouxas p/ conseguir voto fácil. Otári… @blessed_wsc @lucianoayan @DCensurado Vdd. E vc tá em chok? Kkkkkkkkk\nVcs adoram qdo a tal paula xinga todo mundo. Mas qdo ela é xingada aparece com fake pra chilicar. A nova geração mimimi é pior q a primeira. A primeira chorava mostrando o rosto. Vc esconde o rosto pra chorarZ @silva_mishel @JoelPinheiro85 @lucianoayan @DCensurado Como faz um “desaplauso”?\n\nVc discordar de mim dá justa causa? Não sabia que conhecia meu contrato. @NAEKOULAZ @lobaoeletrico @diogomainardi Pq vc não mostra o rosto nem usa seu nome? Pq vc está tão preocupado em xingar um cara q nem começou e portanto não é relevante? Vc faz isso de graça ou é pago pra isso? @IlaraMeirelles1 @TulioBarros3 @Rpaesleme1 @Ktemariano @Velasco85386342 @BlogDoPim Ousadia hoje continuar sendo zuar o governo. Eu faço isso e olha qta gente aparece xingando. Vc é a prova kkkkkkk @DCensurado @lucianoayan Tô fora. Não quero fazer parte de grupo que briga por político acima de outros valores. Eu torci muito pra tirarmos do poder as pessoas que controlavam a máquina de assassinar reputação de quem pensava diferente. Vcs fazem igual - e pior - e tudo estão conseguindo é gerar nojo. @DCensurado @lucianoayan Parabéns pelo seu sucesso @lucianoayan @DCensurado O pessoal é bem cínico. Eles podem ofender todo mundo com fakezinho, covardamente sem mostrar o rosto (me lembro de texto do Olavo criticando isso). Mas qdo eu xingo é chilique puro. Estão até agora em grupinho chorando pq eu xinguei um deles que me xingou. Cinicamente mimados. @MayMR @moviedetail Hagagagahaga @MayMR @moviedetail No. Richard Donner. RT @lucianoayan: É hora de organizar melhor os MAVs?\n\nCuidado que pode dar chabu. \n\nA dica é deixar a maior parte espontânea, como estava i… @moviedetail @MayMR Steven Spielberg dont was direct goonies. RT @sounanyzinha: \"Hoje não vou me estressar, hoje não vou me estressar, hoje não vou me estre...\"\n\n5 minutos depois:\n\n#TheNoite @danilogen… @EduPrimitivo Dá o cu pra ele entao RT @SunsetGaming_: Obrigado pelo apoio @DaniloGentili, forte abraço para voce! https://t.co/H5qh9UCwxA @brendaolivieri Eu já tentei ver várias vezes mas sempre sou interrompido. Sigam o grupo dos maiores especialistas de Fortnite , sigam : @SunsetGaming_  \\o/ RT @SunsetGaming_: OBRIGADO A TODOS!!!!! \n\nCHEGAMOS  A MARCA DE 500 FOLLOWS!!\n#GOSNS https://t.co/Nh2TO674Aj RT @RavenBanner: “YouTubers &amp; Instagram influencers, meanwhile, are skewered literally &amp; figuratively in the found-footage chiller Death of… @alanrenatoo @MauMeirelles @CanellaMatheus Minha mascara caiu. E agora? RT @lucianoayan: Convocação de orcs virtuais, espertinho?\n\nÉ assim que eles \"debatem\". \n\nBasta que recebam uma crítica contundente que já c… RT @aguedescartoon: Se CPI não dá em nada e não serve pra coisa nenhuma, então a gente pode ficar despreocupado quanto a CPI da Lava-jato,… @HomeBack17 @priweinstein Sim. Pode crê. @priweinstein Eu acho errado o Nando Moura estar nesse vídeo. É um vídeo editado pra mostrar a incoerência de quem foi pra rua devender a Lava-Toga e depois mudou conforme a narrativa da militância mandou. Mas o Nando Moura se manteve fiel ao que defendia. Ele não merecia estar aí. @TulioBarros3 @Rpaesleme1 @Ktemariano @Velasco85386342 @BlogDoPim Nouffa , tá brava? @Eduarda80318192 @maiconl_lima @Rpaesleme1 @Ktemariano @Velasco85386342 @BlogDoPim Eu juro que eu me divirto vendo vcs chilicarem tanto qto me divirita vendo petista fazerem igual Kkkkk @eoqmim @roviale @Rpaesleme1 @Ktemariano @Velasco85386342 @BlogDoPim Boa @RenanSantosMBL Creio que vai precisar de um pau de arara. @Mixeline É pq ele foi eleito dizendo que nao ia tentar reeleiçao. E agora vc posta essa tag pela reeleicao dele. Vc nao se dente enganada? É uma duvida mesmo. @Mixeline Eu lembro dele metendo o pau na reeleição durante q campanha. Vc não se sente usada nem um pouco? @Rpaesleme1 @Ktemariano @Velasco85386342 @BlogDoPim Ficar o dia todo no twitter dando rt em blogs e noticias pro-governo. Realmente é uma pessoa muito lutadora. Posso te chamar de Rocky Balboa? RT @DaniloGentili: Basta você zuar o governo ou cobrar coerência de certos políticos que os caras ficam doidos. No meu caso, até se aliaram… @Jeferson_Jabah @MauMeirelles @vinizzinhoo @CanellaMatheus https://t.co/fSMy1z2Cpg @Rpaesleme1 @Ktemariano @Velasco85386342 @BlogDoPim Quando entro no seu perfil vejo apenas um TL que se dedica 100% do tempo a dar RT em noticia pro-governo e a patrulhar opiniões. Vc nao tem nem foto. Vc faz isso de graça ou é paga pra isso? @MauMeirelles @Rafaelscp91 @vinizzinhoo @CanellaMatheus Vc é passivo ou ativo? @Rafaelscp91 @vinizzinhoo @MauMeirelles @CanellaMatheus Que nada, é mó gostoso. Pq fica escurinho aqui. Mas não espalhe isso pros seus 8 seguidores, por favor. Acabaria comigo. Hj em dia ninguém aceita que artista seja gay, por isso me escondo. @vinizzinhoo @Rafaelscp91 @MauMeirelles @CanellaMatheus Ai vc vai entender a revolta do cara... não que ele me odeia... é só frustradao kkkkkk @Rafaelscp91 @MauMeirelles @CanellaMatheus Eu só vou relevar sua incoerência pq pelo que vi aqui vc é um grande especialista em audiência. Kkkkk https://t.co/JOf5B1PCb0 RT @bethmoreno: Grande Roberto Leal, o principal responsável pelo surgimento dos Mamonas Assassinas. #RIPRobertoLeal @Ktemariano @Velasco85386342 @BlogDoPim Realmente nao existe. Mas se vc gosta de chamar assim quem critica e cobra o governo qdo o vê se afastar dos valores que dizia defender, fazer o quê? @Velasco85386342 @BlogDoPim Foi isso o que vc entendeu da postagem? RT @BlogDoPim: Só gente orgulhosa da bajulação atribui um valor negativo à isenção. Nunca antes na história deste país o cordão dos puxa-sa… Perfeito! https://t.co/kK1FtTcqZA @Rafaelscp91 @MauMeirelles @CanellaMatheus Deixa só vc descobrir que ele zoa o governo! @xandaoDamascena @Gil_Soarez @BlogDoPim @MBLivre Hahahhahahah @marcelaleal :) @bianchifelipe @MauMeirelles @CanellaMatheus Felipe o Mauricio cheira pó. Avise seus parentes @MauMeirelles @CanellaMatheus Pica Sonsa do caraio @GuilhermeRadec2 @CanellaMatheus É um gosto de donuts queijo ralado barato @GuilhermeRadec2 @CanellaMatheus Eu to falando do cu dele @CanellaMatheus Um pouco de mau gosto @Gil_Soarez @BlogDoPim @MBLivre Se vc gostasse dele não teria vindo com acusações. E vc já pensou que pessoas independentes podem elogiar coisas que merecem ser elogiadas e criticar o que merece ser criticado? Isso não é “morde e assopra”. Isso é um ser humano normal. O diferente disso ou é louco ou lacaio. @joemontanareal1 @aguedescartoon Verdade cara. \nPor exemplo: não pode zuar o presidente ou o assessor e filho dele que vc chora. Kkkkkkkkkkk @Gil_Soarez @BlogDoPim @MBLivre Realmente o Blog do Pim tem decepcionado muito. O cara ao invés de servir como lacaio de narrativas bunda de militância preferiu acabar como um jornalista sério e independente, diretor do principal veículo radialistico do País. Quem ele pensa que é? Me diga? @Rafael42140432 Fui desmascarado pelo Rafael423837481993&amp;3 @Gil_Soarez @BlogDoPim @MBLivre Tá chorando pq? Kkkkkk @sinceredoctor11 265.899.543-29 @wanderley_prado @LeonardoLuizdo6 Virando o maior babacao nao! Me respeite! Eu SEMPRE fui o maior babacao! @BlogDoPim Eles sabem o que vc disse. Fingiem que não sabem. E eu digo mais: é inveja pura. @MayMR S2S2 @MayMR S2 @Maraisa S2 @renatodtorres Obrigado pelo reconhecimento @Mixeline Vc nem sabe como ele vai entregar o País e já tá fazendo campanha? É a mãe Dinah? @berin210 @ProfBunazar Hoje é sabado? Nossa, passei a semana toda curtindo tanto minha grana que nem me liguei. @ProfBunazar Vc está dando uma de pica sonsa kkkkkk @matheuzinhoac @Hexatamente Aí vc falou uma verdade RT @BlogDoPim: O nível de histeria nas redes é tamanho que reproduzir declarações de políticos como Jair Bolsonaro, Flávio, Hélio, Jorge Ol… @gabrielmsilva5 @Orcrim_IV @bobdaslabaredas @lucianoayan Uma coisa eu digo pra vc: não mostre mais sua cara, por favor. Kkkkk RT @sipfonseca: Acabei de ver a entrevista de @DaniloGentili aos memes da internet. Ainda agora não sei se hei-de rir ou de chorar. Estou e… @FranciscoPeixo @Diogowillbastos Nouffa que medaaaaaaaaa @Diogowillbastos Havan paga o SBT pro meu show divulgar a loja. O SBT me paga pra eu criar e conduzir um talk-show. É o negócio q tenho com eles. Aliás entrego bons resultados para ambos. Resultado ruim está entregando a BolsoMAV. São pagas pra criar espiral do silêncio e tô eu aqui falando. Kkkk @LeilaMagnolia @Hexatamente Vc é o perfil que aparece embaixo sempre comentando o comentário de cima pra passar a ilusão que a pessoa “mitou”. Já é bem claro como funciona. Kkkkkkk @Hexatamente Eu sou tipo agente duplo entao? Bem, vc pode me culpar de tudo menos de ser burro. Ganho dobrado! Kkkkkkk @camischagaas https://t.co/xESs9mDxJa @bobdaslabaredas Cara , aliás, pegue um cafezinho pra mim. Eu nem gosto de cafe mas o @lucianoayan fez uma lavagem cerebral e mandou eu tomar. Como eu sou seu chefe vai lá e pega um café. @lucianoayan Vc está fazendo a cabeça de muita gente hein? Sua lavagem cerebral é muito poderosa hein. Vai ficando cada dia mais claro quem é independente e quem tem patrão. Quem defende valores e quem defende políticos. @renatoconserva1 @MauMeirelles Amigo, se vc não se posiciona contra esses que estão queimando o filme de todo mundo logo será confundido com eles. @prokofiev2 @MauMeirelles Seu tempo acabou. Tchau. RT @Flavio_Quintela: Nando Moura se posicionando corretamente e chamando nego pro pau, ao contrário de um monte de passador de pano chapa b… Eles deixaram a pílula vermelha de lado. No lugar pegaram o comprimidinho azul, deram pros seus patrões e estão de quatro ate agora servindo de putinha de político. Kkkkkkkkk https://t.co/ftAX7dTqK7 @MauMeirelles Babaca @euoaoj @lucianoayan Nao tem que ter linchamento nenhum bixo. Linchamento é coisa de exercito revolucionario.\n\nNo caso o que me resta como individuo é expor em público a minha reprovação pessoal ao ato e pq reprovo. @Gabriel9Borges @OensandeceR @GabrielDuga1 @MauMeirelles Ta em shok? Kkkkkkk @GabrielDuga1 @MauMeirelles Sua mae geladona no caixao e vc mesmo assim encontra tempo pra pegar o twitter e defender a militância bolsonarista? Nao aguentou pilha? Kkkkkkkkk ta em shok? Kkkkkkk\n\nNao é assim q vc fazem?\nVao usar print nos seus grupos pra me demonizar, certo? Vai fundo. @OensandeceR @GabrielDuga1 @MauMeirelles Pegou pilha, seu filho da puta?Kkkkkkkk tá em shok seu merda? Kkkk @lucianoayan Eu acho que é comum o tipo de atuação. Normal. Foi lá e investigou. Mas não encontrou nada. Quiseram apenas expor a mulher ao ridiculo. E pra quê? Por vingancinha contra o marido. Foi um profissionalismo de fofoqueira de cortiço, não de jornalista. @GabrielDuga1 @MauMeirelles Na real a exposição era da sua mãe dando o cu Kkkkkkkk Exatamente! Qdo me posicionei contra a exposição q a militância bolsonarista fez da família do @MauMeirelles fui execrado por eles. Qdo eu me posicionei contra a exposição sem propósito da esposa do Eduardo recebi desse mesmo povo altos elogios. Esses bolsonaristas são escória. https://t.co/E8bwDXJXKu @josecarlos1982 @lucianoayan Qual onda eu estou indo? Me diga aí. @lucianoayan Eu acho que jornalismo investigativo tudo bem. Foi lá e investigou. Encontrou algo errado de interesse público? Não! E daí? A mulher não é laranja, não é cúmplice, é apenas esposa. É sujo. Imagina alguém expondo um parente seu só pra te atingir. Achei extremamente baixo. @lucianoayan Achei que nao tem diferença entre esse jornalista que usou o espaço dele pra expor uma pessoa q nada fez do que aquele monte de perfil que expõe filho de jornalista. \n\nBem, na real tem uma só diferença: esse jornalista não foi covarde e usou nome e rosto pra publicar o lixo q fez @lucianoayan Eu achei bem idiota o que o jornalista fez com a esposa do Eduardo Bolsonaro. Tudo bem, fez o jornalismo investigativo, mas nao encontrou nada. Ela nao é do jogo publico e nem cometeu crime ou fraude alguma. Achei isso q ele fez bem baixo e reprovavel. O único propósito foi ódio. @Romulloac Definição de bravo: responder com calma e fazer uma pergunta. Na ausência de uma boa resposta prevalece o cinismo satânico. RT @mariosabinof: Ser jornalista não lhe dá licença para matar. E jornalismo investigativo tem como único escopo desvendar crimes e tramóia… @CarneMoidaTV @longhinirafa Parabéns pra musa RT @gregory_barros: Nando Moura  humilha Flávio Bolsonaro 🥊\n@moura_101 @FlavioBolsonaro https://t.co/pj24wZGF9Y RT @ProfBunazar: Não roubaram uma obra de arte. Não era uma obra de arte; era uma privada de ouro. Logo, roubaram o ouro. https://t.co/oljJ… RT @barrosfabio30: Ao trazer a participante de  \"A pequena grande Família\" Amy Roloff , o @DaniloGentili matou não só a curiosidade dele ma… RT @arecobarudino: O Brasil é tipo vc nadando no meio do mar à noite, sabendo que ali tem um tubarão, e está escuro e vc não sabe pra que l… @GabrielGuuri Qdo te ver te dou um @claudioedantas @priweinstein Ajjaaahhahhahahahahaha @vfelipesantana @FabriRoberto2 @rogermooore @ThiagoAntunesD8 @BlogDoPim @veramagalhaes Que seja - e daí? RT @sounanyzinha: @DaniloGentili Queria ter a mesma força, que os botões da camisa do @diguinhocoruja https://t.co/h0a4eCqmS5 Quem estiver no México , Espanha e outros países latinos pode assistir isso nessa #sextafeira13 https://t.co/LmxRvvf9ld @brunoazzo O dele e pettit RT @LoubachTatiane: @DaniloGentili Hoje tem 😏😏\n#Broderagem  🤣🤣🤣🤣🤣 https://t.co/nziiaAqO7T @AJotta_of Ele é o 90% Suggar https://t.co/LRKl1GBnD0 RT @claudioedantas: O que está por trás da visita de Flávio Bolsonaro à China https://t.co/MWoJxzxcbB agora é sério. RT @docmbl: @DaniloGentili Quem quiser assistir o filme esta disponível nas seguintes plataformas: Itunes, Google Play, Youtube, Net Now, V… RT @sarubo: A revista tarja preta que coloca um garoto de 23/24 anos, que no início da década ganhava prêmio de poesia em Itu, para escreve… Boa Thread. Exatamente o que eu penso. https://t.co/kwRjGtchNx @Romulloac No. Eu vi o Democracia em Vertigem tb, e nem por isso o Lula me indicou. Qual o problema? Acabei de ver o doc “Não Vai Ter Golpe!”. Muito bem feito. Me surpreendeu. Recomendo! https://t.co/4zHKZY1ifx RT @pamelaalves204: Estou assistindo o canal TLC e esta passando A pequena grande família, o casamento e q lindo casamento dos sonhos perfe… @_Exaustor_ Claro, uma visitinha na sua TL comprova que vc é tão verdadeiro quanto o Bolsonaro dizendo que é contra reeleição @bebezinhaholmes É , lembra eu mesmo. Juro. RT @momentostvbra: https://t.co/XACSDAC9dU @Cardoso Quando aparecerem me avisa, tb gosto RT @o_antagonista: Flávio Bolsonaro vai à China conhecer a Huawei e se reunir com integrantes do PC chinês; no início do ano, viagem idênti… RT @igorzismo: SP !! Abrimos mais uma sessão desse show malucooo que causa coqueluche na turminha.. Garante seu lugar, já compra aqui &gt;&gt; ht… Kkkkkkkkkkkkk\n\nDireita ‘xing ling’ https://t.co/GZmIJSohYh RT @Desesquerdizada: Para @ggreenwald, procuradores do MP-RJ e jornalistas do @JornalOGlobo que divulgaram a movimentação atípica de R$ 2,5… #sextou https://t.co/a7arXXzf8E RT @Flavio_Quintela: Fui dar uma olhada nos perfis de FB de uns amigos bolsonaristas, ver se tinha algo sobre Aras, fantasmas do Carluxo e… @Cardoso Chegou a boiada? RT @alex_borges: Minha crítica ao jornalismo \"de emboscada\", ótima expressão do @andreazzaeditor, ou de pegadinha, é a mesma a qualquer tip… RT @camilafedel: por causa do @DaniloGentili de 2014 eu:\n- fiz amizades incríveis\n- aprendi a amar AC/DC \n\nobrigada 8=D (uma carinha com óc… O bom é que não precisaremos de impressora 3D pra imprimir uma maquete. https://t.co/6FrKkDh2Hg RT @RafaelaRockeira: @DJRickMusic @DaniloGentili e tem outros\n\ntipo esse cospobre que fiz do Jack https://t.co/v0JUHRqSMp @Tigreis Eu? Chorando? Onde? Quem está chorando é vc pq critiquei o ditadorzinho de condominio “buaaaa tem que demitir gente q fala o q eu nao gosto buaaaaa”. Vcs choram pra ver alguém da familia bolso te dá a piroca pra mamar. Fala a real, safadinho, vc quer leitinho de politico, né? @Tigreis Pelo visto não pode criticar não. O cara apareceu pedindo a cabeça de jornalista, eu o critiquei e vc veio aqui chorar. Acho que vcs não aguentam críticas. Vcs são extremamente mimados. Igual os esquerdistas. RT @Flavio_Quintela: Se esse João Paulo Saconi tivesse descoberto algum furo de reportagem durante seu fake-coaching, algo que o levasse a… @_Exaustor_ Como se vc tivesse preocupado com imparcialidade, né? Vc quer apenas um bolso-olavista submisso as narrativas que mandaram vc acreditar. Vc quer alguem beeeeem parcial lá. Não seja hipócrita. @FabriRoberto2 @rogermooore @ThiagoAntunesD8 @BlogDoPim @veramagalhaes Na Jovem Pan os chefes, dono e ancoras principais aparentemente têm viés liberal conservador. A própria Vera tem esse viés. E mesmo assim tá pedindo a cabeça dela pq ela não se ajoelha 100% do tempo para a sua narrativa. Vc não quer equilibrio merda nenhuma. Vc é apenas um cuzão. @rogermooore @ThiagoAntunesD8 @BlogDoPim @veramagalhaes A idéia é demitir todo mundo que vc quer até sobrar só as pessoas q vc quer falando o que vc quer. É isso? Depois que vc tirar do ar todo mundo que vc não gosta por causa de divergências políticas qual será o próximo passo? \n\nEm tempo: acompanho o ibope, é mentira sua. Eles não estão perdendo audiência. https://t.co/uwP6uni9XW Mas ela está cada dia mais próxima de todo mundo. Hoje mesmo eu saí na rua e tinha um braço dela encostando em mim. https://t.co/kFgmbpF6yU @Cardoso Eu acho certo investigarem mesmo. Politico vive fazendo parente de laranja. Mas essa foi meio sem propósito. Foi pra atacar o cara atraves da exposição da esposa. Se tivessem exposto pilantragem de interesse publico, aí eu acharia correto. Desse jeito aí foi só cretinice. Eu acho @Cardoso Eu sei e acho certo investigarem. Mas foram lá, não encontraram nada e foi apenas uma coisa pra a expor ao ridiculo. Ela nem fala publicamente, é só esposa.\nAchei meio sem propósito e bunda. Mas segue o jogo. @Gustavo62031568 Vai tomar no seu cu. “Finalmente” cara, vc é só um lambe-saco. Quando eu critico o governo a “opinião” não é sensata. Vc defende político, não valores. @Cardoso Eu concordo investigar parente próximo e expor se encontrar que o parente faz parte de esqueminha. No caso dela foi tipo, pra quê? Não entendi. O que tem a ver a esposa do Eduardo e a profissão dela com o Eduardo e com as suas atitudes políticas? Qual o sentido da exposição dessa mulher dessa maneira? \n\nDepois quando aparecem cagando na imprensa a imprensa se faz de vítima. As forças do mal são poderosas mas nada vence a estupidez. #sextafeira13 https://t.co/8ekKHsR3Km @prokofiev2 @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 Quem disse que todos são pagos? @prokofiev2 @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 Quem disse que todos que criticam são pagos? @prokofiev2 @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 Em que momento eu disse que eu devo ser imune a encheção?\n\nMas eu sei que existe um movimento organizado com base e estrutura paga para intimidar indivíduos e criar espiral de silêncio. Se eu não gostava disso na esquerda pq devo aceitar na direita? @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 2) Mas tem um aspecto mais perverso na BolsoMav. A Mav petista só atacava o lado oposto. Essa corta a cabeça de qualquer um que pisa 1mm. A Mav petista era mais “profissional” no assassinato de reputaçao. Essa Mav parece a rainha de copas da Alice: “cortem a cabeça deles!” @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 1) A MAV esquerdista era mais danosa pq tinha agentes e simpatizantes no mainstream. Uma narrativa fake que criavam com perfis fakes aqui facilmente viravam manchetes na folha ou tv. Isso a BolsoMav não faz. Mas nao é pq sao bonzinhos. É pq ainda não chegaram lá. Desejam isso. @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 Ah sim. Eu estava prestes a começar meu documentario sobre os anos de patrulhamento progressista nas redes qdo notei esse movimento. Entao eu parei tudo e sigo observando e coletando informaçoes. Tive que parar e entender o que ta rolando. @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 Não foi só por isso. \nQuerem criar um novo espiral do silêncio. Existe uma opinião correta sendo disparada por um comando superior e vc nao pode falar nada diferente daquilo. Não critique quem eles nao querem q vc critique.\n\nNão é mais espontâneo. Já foi. @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 Ninguém precisa de $ pra se juntar com jornalista investigativo e eu não pretendo fazer isso pois isso hj está preso numa bolha do twitter e eu não acho saudavel q isso vá pro mundo real. O q eu tento fazer é alerras as pessoas dessa bolha q estao sendo enganadas e manipuladas. @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 Alias sou curioso, pq foi atacado? @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 Aliás é possível inclusive apontar quem são os “donos desses cachorros”. No início achei q era um movimento de “purificação da direita”. Mas não é. Os patrões eleitos usam essa MAV para ficar com o latifúndio da direita e arrancar do caminho todos q não se submetem 100% a eles. @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 No. Pelo contrário.\nPor lidar com muita gente eu consigo distinguir. Além de ter gente real articulada em grupo existe tb o esquema com software e fazendinha de perfil. Não é a toa q quando um fake cai ele volta com perfil de 2012, 2013 já com 70 mil seguidores. Tem estrutura. @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 Cara, vc diz isso pq ainda nao foi atacado. O que sustenta o lenga-lenga do dia-a-dia realmente é essa massa que cai nas narrativas criadas e fake news criadas pelo pessoal de cima. Mas na hora da onda de ataque contra um alvo e de subir tags o disparo automato sai da gaveta @Orcrim_IV @ascenda_a_Iuz @JoselitoMuller3 Não faço ideia quem foi comprado e se foi. Sinceramente se o perfil é individual , seja do governo ou do pt ou sei lá da onde parece inevitável. O que considero realmente desonesto e covarde é uma estrutura dessas tentando intimidar e  criar espiral do silêncio contra individuos @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 Pra subir tag em 5 minutos como fazem quando convem precisam. A maneira que disparam memes em ondas tb. Eles sempre usam uma pessoa real do esqueminha ou simpatizante pra sugerir a primeira tag e depois a automação impulsiona e se mistura no meio da multidão espontânea. @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 Essa materia de anos atrás revela perfeitamente como funciona um esquema desses: https://t.co/5BJPYdgWQs\n\nEles tem isso aqui . Como pagam? @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 De todo modo, eu posso garantir que o que eu vi envolve dinheiro e estrutura. Nessa MAV, assim como na MAV PT, eles tem centenas de perfis de farm, automação pra subirem tags, pouca gente controlando muito perfil (por isso precisam ser fakes). Da onde vem a grana? @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 Sim. Como eu disse, os 20% abaixo da linha de comando (esses sim pagos, com cargos, etc) militam ou pq querem uma boquinha tb (tenho muitos prints deles pedindo emprego na secom e em gabinetes) ou pq querem “subir” na hierarquia, ser notado, ser reconhecido. Vaidade bunda. RT @Flavio_Quintela: - Só tem \"luta\" pq sua trupe continuar a dividir a direita entre iluminados e traidores;\n- Queria chegar ao cargo mais… @alison_kemer @Orcrim_IV @JoselitoMuller3 Vc consegue apontar onde está o surto? @ascenda_a_Iuz @Orcrim_IV @JoselitoMuller3 Toda MAV é feita com gente inocente.Tem uns 20% no topo do comando criando narrativa e instigando a “espontaneidade”. São pagos. Mais uns 20% servem de cachorro fiel pq esperam um dia subirem ou serem pagos tb. O resto, enganado, propaga narrativas e milita achando q faz o bem. @ValdemirXavie14 Então já é idiota de nascimento. Kkkkkkk RT @DaniloGentili: #sextafeira13 https://t.co/X9IxAkNMQO @camilovieiras Sim. Semana que vem começamos a rodar a série. #sextafeira13 https://t.co/X9IxAkNMQO RT @BastidoresDaTV: Real Time - São Paulo à 01h18: \n\nSBT 7.5\nGlobo 7.1\nRecord 1.2\nRedeTV 0.4\nBand 0.4\nCultura 0.1\nGazeta 0.0\n\n#TheNoite @Da… RT @FabioGuere: Tô achando que o @DaniloGentili e o @diguinhocoruja já estão casados de papel passado. 🤔 #sextafeira13 https://t.co/3CrNddojFe @PezettiEmerson @aguedescartoon @JoselitoMuller3 Salve ai @Orcrim_IV @JoselitoMuller3 Quando notei o movimento pensei que se tratava de um movimento de “purificação da direita” - e obviamente achei isso escroto por si só. Mas nem isso é! Trata-se apenas de uns fracassados obedecendo seus patrões inseguros. Uns obedecem pq são pagos e outros pq esperam um dia ser. @aguedescartoon @JoselitoMuller3 Kkkkkkkkkkk @JoselitoMuller3 @aguedescartoon São os anti-sistema que em toda oportunidade ficam mendigando em público emprego na secom e nas jovem-pan da vida. \n\nOs caras são as raposas tentando pegar as uvas. RT @BlogDoPim: Entre a crise econômica com corrupção petista e as reformas econômicas com blindagem de todos os corruptos, eu fico com as r… Perfeito https://t.co/S90NbCk34c @ThiagoAntunesD8 @BlogDoPim @veramagalhaes Depois que vc tirar do ar todo mundo que vc nao gostam por não simpatizar com suas posições políticas, qual será o próximo passo? @HavocMiranda Que cuzao hahahah RT @FriedHardt: acabei de ver tuite de governista reclamando de desunião na direita kkkkkkkkkkkkkkk ai que GOSTOSO quando uma cagada muito… @ValdemirXavie14 Pelo visto vc está assistindo toda noite. RT @vitor_visc: @DaniloGentili Acabei de ver isso, @DaniloGentili  HAUAHAUAHAUA https://t.co/Xn0Yz6mtli Queimada da Amazônia: opinião de um profissional https://t.co/7bVvTuOJxj RT @yoyorobot: i drew a comic about underground comix https://t.co/odjOHogSjR RT @SBTTheNoite: Você lembra desses memes? Eles estarão daqui a pouco no The Noite, não perca 😉🤣 https://t.co/a6gdpRweKH É sério. Mas eu ri. https://t.co/YEbpA4ekLe @MauMeirelles Pegou pilha @HeyLeticiaGodoy @juliaxtina Da hora demais RT @Vinheteiro: O Funk torna as pessoas mais imbecis? Descubra neste video:  https://t.co/osaEz8xEJj https://t.co/UGpzFaRV5j RT @claudioedantas: Advogado-geral do Senado que deu aval para Eduardo Bolsonaro é sócio de Augusto Aras https://t.co/8O8N5Fn0G5 @DanBrSan Minha mãe não está na zona @OdairJu02943570 Haihauahhaua Poderiam ter colocado um caixão alí escrito “Itamar: Convidado” https://t.co/B5lNQSSqNc @AquelaLara \\o/ @AquelaLara Eu nem a cueca abaixo RT @aguedescartoon: \"Ah, mas convidou todos os ex-presidentes\"\n\nTODOS enrolados com a justiça (exceto FHC).\n\nConversar com qualquer um dele… @MauMeirelles Babaca RT @fcastano_: Lembrei de uma professora q eu tive que era tão gorda que soh passava na porta da classe de lado... ela fingia que tava dand… RT @izzynobre: @Cardoso Esse pedantismo semântico é chato demais, pqp. “Ah não pq a etimologia da palavra remete a…” mano não é assim que a… RT @paularosiska: Não aguentou a pilha? Ficou em shock? https://t.co/Fe3SDxvqza @JussaraMariaBR Se ele topasse ir seria demais. Adoraria entrevista-lo. RT @o_antagonista: Aras promete ao PT “absolver” os “injustiçados” https://t.co/BApY41xuXj RT @Vampyra_Silence: Separados por uma Anhanguera Connection \n@CarneMoidaTV @DaniloGentili #TheNoite https://t.co/DhWTMpE8z1 RT @Desesquerdizada: Não seja um passador de pano como Alexandre Pateta. Apoie o que merece ser apoiado e desça o sarrafo no que merece ser… @Leownn17 @leomacedo75 No meu post eu disse “extremista”. Pq se doeu? Kkkkkkkkk @verdaoraiz @priweinstein Tá em shok? Kkkkkkkkkk @priweinstein Kkkkkkkkkkkkkkkk RT @medo_b: Festival de música que ia acontecer na data da \"Invasão a Area 51\", foi cancelado com medo da segurança das pessoas por causa d… @priweinstein Mas eu sou vc. Então eles me amam tb.  Kkkkk @Edvaldo96724447 Fui passar a mão no rabo da tua mãe e ela sumiu, realmente. Kkkkkkk RT @GTabacow: @DaniloGentili Passando Rímel no Cílio Anal, ao vivo no @SBTTheNoite https://t.co/TbLbGHN4Gg Hauhauahiahauahaiahua https://t.co/mLYXIXFFgx @JooCarl16022532 Depende do horário e do post. Exemplo: se eu postasse uma tag que o seu patrão te ordenou subir esse meu post teria muito rt, pq vcs usam automação pra isso. Mas se for um post comum tipo esse do print abaixo, não vai ficar inflado como o de vcs mas vai até que bem, olha aí https://t.co/G0ksXfRMvV Já já tem o Talk-Show mais arrombado da história do Brasil. https://t.co/TMEIzjH1Zo RT @DaniloGentili: HAHAHAHAHAHHAHAHAHAHAHHAHAHAHAHAHHAHAHAHAHAJJAHAJAJAJAJAJAJJAAJAHAHAHAHAHH\n\nO cara é o Boça! https://t.co/zEcTZ1ftrP RT @arecobarudino: Bicho, as pessoas aqui abrem marmita pra comer no ônibus com ar condicionado (de janelas lacradas). Se isso não é a mais… @Flavio_Quintela Tem um vídeo dele dizendo pra não chilicar na internet, pra aceitar “zuera” de fake mav, e hoje veja só, o cara ta aí chilicando huahaiha RT @arecobarudino: A sem-cerimônia com que as pessoas abrem o Cheetos no ônibus, elas atendendo ligações do seu lado, longas e em voz muito… @RFalomesmo Nossa... falei bem do governo seu cu piscou de tesao né? Bom, cada um tem suas taras. @gapelegrini1 @sarubo Os isentãos é foda RT @CarneMoidaTV: Se liga no trabalho SENSACIONAL da @SrtaBad!!! 😍😍😍 SIGAM ESSA MITA! https://t.co/nyJGRdF387 @cremonini_regis To calmo amigão\nMas chupa menos Kkkkk @prokofiev2 Isso vai depender exclusivamente da minha vontade. Mas já adianto que em breve darei block mesmo. Kkkkk @alan_granzotto Ora ora chegou o fiscal de posts. @cirrose8 @ajulysantos O @alexsanspacheco é extremamente contraditório e patético. @RogerioLSilva @medo_b @ajulysantos E banana não é fruta? Kkkkkkk @leomacedo75 É legal expor @CarlosDiasII @Ro_mOlS Cuidado: Se vc continuar com ironias baratas o PT vai voltar e o Brasil vira Venezuela. Kkkkkkkkkk @priweinstein @ajulysantos Olha que bacana... qdo é fake zuando ele acha bonito. Quando sou eu trata-se de uma alma perdida. RT @sarubo: Vocês lembram da TV Brasil que o Bolsonaro ia extinguir em nome do liberalismo, da ética?\n\nOntem ela serviu de palanque para Ed… RT @sarubo: Pessoal mandando reply pro Teleguiado \n\n“NINGUÉM ASSISTE MAIS TV”\n\nVdd. Então pq o Bolsonaro DESISTIU de fechar e continua quei… @medo_b @ajulysantos Infelizmente eu escolhi sair de um cortiço, ficar rico, ser famoso e comer um monte de muié enquanto jovem. Umas puta escolha errada. Kkkkkk @Diinysk Jahahahahhaha RT @ROrsioli: @DaniloGentili POR FAVOR, ajudem a acabar com o sofrimento dela!! Antonella tem uma doença degenerativa que agora tem CURA! C… @OlavoDeCaralho5 @Moro_2022 @aguedescartoon É o Putin te alimentando na foto? Kkkkkkk @VINIGOMES28 @JulianoCordei16 Pois é! Nem mesmo qdo indicam petista pra PGR. Eu tento avisá-los que é feio mas não me ouvem. @prokofiev2 Vc realmente é um bot muito inteligente. Quer um biscoitinho? @JulianoCordei16 Me desculpa zuar as rolas que vc chupa. Kkkkkk HAHAHAHAHAHHAHAHAHAHAHHAHAHAHAHAHHAHAHAHAHAJJAHAJAJAJAJAJAJJAAJAHAHAHAHAHH\n\nO cara é o Boça! https://t.co/zEcTZ1ftrP Basta você zuar o governo ou cobrar coerência de certos políticos que os caras ficam doidos. No meu caso, até se aliaram com a Maria do Rosário e torcem por minha prisão. Kkkkkkkk\n\nOs extremos realmente se tocam. E se beijam. \n\nBolsonarista cada dia mais parecido com petista. https://t.co/WvF2e3tKtV @cremonini_regis Foi vc então? Caramba! Parabens mesmo. @binhurb Em puta e cocaina @prokofiev2 Foi vc que fez isso? Parabéns. @osvaldolaini @brunoazzo Então só dá block quem não tem argumentos? Me fale mais sobre isso. Kkkkkk https://t.co/iy2M8efF7o @osvaldolaini Eu ia elogiar o presidente mas me lembro que ele disse que não entende nada de economia e isso era com Paulo Guedes. Então eu realmente não soube quem elogiar. Mas promover um bom resultado não é bom pra vc? Desculpe eu não sentar na rola que vc chupa. @InspiSerena Tudo tem sua hora. Mas se quiser continuar me pautando mande seu currículo que eu vejo se te contrato ou não. Kkkkkkk @hugo7ecamara Chegou o fiscal É pq ele saiu de dia. https://t.co/HCoxn1iajC @aguedescartoon Mas aí não coletar nada, pq só paga imposto quem tem CPF. Kkkkkkkkk Eu tô querendo ver tb mas ele me bloqueeou. Isso pq discursinho deles é que quem dá block é covarde. Kkkkkkkkk\n\nEnfim, o @alexsanspacheco passou outra vergonha monumental. Segue aqui pra quem não viu: https://t.co/rReGMyLYwz https://t.co/7bBILWvXN8 @Ro_mOlS Enganamos vcs! Otáriooo kkkkkkkkkk https://t.co/gLnGxQ0OTD @xandenunes Tá com saudades, querido? Procura no youtube. Kkkkkkkk @ajulysantos É completamente mongol @priweinstein Que otário kkkkk Toda hora que alguém me manda coisa desse cara ele está passando vergonha! O cara chegou a defender CPMF pra lamber o governo. Aí vem o governo e fala contra a CPMF! Kkkkkkkkkkkkk https://t.co/wrimM0xwKQ Kkkkkkkkkkkkkk https://t.co/Ttcd8dpjF9 RT @ProfBunazar: @madeleinelacsko Exato. É livre a manifestação do pensamento; é proibido o anonimato. Está na CF RT @madeleinelacsko: Não caiam nesse vitimismo barato dos vagabundinhos anônimos da internet.\n\nEu já perdi emprego pelo que digo, já tomei… @Gulagcu Eu acho que já tô pior que ele hein... avisa o povo aí que qto mais vcs tentarem criar espiral do silêncio mais eu vou cagar nos seus patrões. Eu tô só começando. Kkkkk @Brunobbm01 Kkkkkkkkkkkkkkkk @Gildasioster1 Vishi, agora fudeu! Vc perdeu um tempinho fazendo isso no photoshop e postou no twitter... fudeu... agora minha carreira afunda igual a popularidade do governo que vc chupa rola. Kkkkkk @mitomitoto2 https://t.co/O4Be7MayP3 @mitomitoto2 Chegaram tarde. Já tem mais comentário de gente real concordando comigo do que fake atacando. Vcs estão recesso desde ontem, né? Percebemos. Essa não é aquela TV que o Bolsonaro foi eleito prometendo extinguir? https://t.co/cl1YNA7BLL @MauMeirelles Ta fudido na minha - tive q trocar de numero babaca @MauMeirelles Vc não é o machão? Seguinte, já que ele duvidou , quem quiser xingar o @MauMeirelles só entrar no whats: +55 11 95878-3725 https://t.co/rEn5Wgo4bB @marcioc2508 @printsfascistas De fato não é gente mesmo. Trata-se de 1 pessoa controlando 100 perfis para se passar por “o povo espontâneo”. Esse é o truque dos fakes. Mas aí qdo o povo real se manifesta e vcs percebem que não manipulam é nada entram em shok! Kkkkkkkkk tá em shok? Kkkmm @MariTajra @carloscezarcjr Na ausência de uma resposta se inventa um fato para que as pessoas achem que eu alguma vez na vida já fui remunerado por político. Tentam com isso tirar o foco do seu comportamente duvidoso. Aliás @MariTajra deveria saber q não é pq vc se diz conservadora q pode ser pedófila. @mizaelizidoro @jacas34 @GustavoMMendes Nossa, mas vc tá brava? Kkkkkkkk @MauMeirelles Fala duvido que vc vai ver @MauMeirelles Ahhahahaha velho vc tá o fim de semana todo um frescurinha. Eu vou vazar seu numero se não me responder lá agora. @MauMeirelles Não responde no whatsapp pq? É sério que tá puto por causa daquilo mesmo? @MauMeirelles Nossa mas cê tá brava ? RT @CibeleBatistaa: Monólogo de hj bom d+ 😂😂😂 #TheNoite @DaniloGentili @LeoLins https://t.co/rOHYVOxPDL RT @Lorpeam: Atorzinho colunista de merda, militante de faculdade que no set trata equipe que nem lixo, exige almoçar separado, dá pitizinh… RT @marcurelio: Que textinho desonesto, esse do Duvivier. Tá, não é surpresa nenhuma. Mas olha o espantalho que ele inventa, esse cara aí d… Censura do Crivella contra Os Vingadores https://t.co/5sZzKYzmHk RT @pensoestranho: Se Flávio não visitar Gilmar Mendes, o PT volta. https://t.co/vLS4devr82 RT @barrosfabio30: O @DaniloGentili  se supera a cada FDP(fight de piadas) do #TheNoite ,  é louco demais .😂😂😂\n#SBT @printsfascistas É curioso e já notado por todos que é sempre perfil sem nome e rosto que aparece com esse tipo de recadinho. Kkkkkkk velho... leva esse recado pros seus patrões: quanto mais vcs fizeram isso pra eu não falar mais eu vou continuar falando. E já já começarei a escalar. RT @DaniloGentili: Eu tenho um importante alerta para o povo da direita: ou vocês param de exigir coerência e cumprimento de promessas dos… RT @RogerioMorgado: Primeiro Talkei Show no Teatro Renaissance!! Ingressos:\nhttps://t.co/OQxKg34uwk https://t.co/coffFilmC0 RT @igorzismo: RT @G1 Novo iPhone revoluciona e vem com barbeador elétrico https://t.co/jwHlEjB7Hk RT @EduPrimitivo: Como esses influenciadores que pegam no pé do governo atual fizeram falta nos quase 16 anos de governo do PT. \n\nSe tivess… RT @bethmoreno: O novo iPhone é tão fino, que as mensagens chegam de mordomo. @carloscezarcjr Zzzzzzzzzzz RT @coachsandrolima: Essa Msm Ladainha pilantra .\n\n\" Nao pode criticar o Governo se nao o PT volta \" \n\nAhhhh poooooora! \n\n https://t.co/Nhq… @jacas34 Tava no teatro domingo. Não comprou ingresso perdeu. Kkkkkk @carloscezarcjr Paga o ingresso que eu conto uma melhor. Trabalhando de graça pra político aqui já basta vc. Kkkkkkkk @allan7rodrigues @Bot71950739 Não chegou seu recibo ainda. Quando chegar eu te faço rir. Kkkkk @Bot71950739 Se quiser piada assine o pacote premium. @arecobarudino Eu vi e adorei. Eu tenho um importante alerta para o povo da direita: ou vocês param de exigir coerência e cumprimento de promessas dos políticos que vcs elegeram, ou então o PT volta e o Brasil vira a Venezuela. RT @claudioedantas: Toda vez q o Maia apronta, lembro desse tuite da super Joice. https://t.co/vnwsAMuEiZ @dimacgarcia @marisascruz @lobaoeletrico @MyrianDauer Vc e um perfil de fazenda. Pode ate usar o velho truque de mandar um velho se filmar falando q é dele o perfil. Mas é isso q vc é. Essa matéria dá uma idéia de como funciona isso: https://t.co/YqH8iGmUTF @lobaoeletrico @ippachecao @MyrianDauer @dimacgarcia O jeitinho bravinho e mimado entrega RT @FriedHardt: “Não resolveremos desigualdade com um monte de gente branca” - diz o branco em um evento com um monte de gente branca https… RT @sarubo: O pessoal de Porto Alegre escova o dente de um jeito bem estranho, fala aí https://t.co/3PwEQKxJTQ RT @ProfBunazar: Bolsonaro precisa entender algo logo. Atualmente, a cada 10 pessoas que votam no PT, 9 não se importam com nada de absurdo… RT @ProfBunazar: Ele está, a cada dia, cavando a própria derrocada política. Está, às escâncaras, descumprindo as mais importantes pautas q… @Edilson31269823 @doisdedosdeteo Hahahahhahahah @sounanyzinha Ela mesmo :( RT @DaniloGentili: Ela sempre foi uma presença muito doce nos bastidores. Sentiremos sua falta, Dona Ivone. https://t.co/pRrtxo0aTz RT @sounanyzinha: @DaniloGentili É ela que está nesse vídeo né?\n😢 https://t.co/lXzlf7vDWb RT @GeracaodeValor: Polícia de SP indicia Najila por extorsão, fraude processual e denúncia caluniosa. Ela acusou Neymar de estupro em Pari… @lobaoeletrico @dimacgarcia @MyrianDauer Se vc reparar vc teve muito engajamento nesse post do print pq tinha compartilhado uma tag que eles estavam promovendo com bots e software. Não era natural. Eles se incomodam com vc pq vc fala com as pessoas reais. Eles podem ter números altos mas são inflados por mav. @ItsMeBial @kimpkat @lucianoayan Tô vendo que temos um fã Ela sempre foi uma presença muito doce nos bastidores. Sentiremos sua falta, Dona Ivone. https://t.co/pRrtxo0aTz RT @renato_battista: Enquanto isso na Câmara de SP, ainda há vereadores se defendendo da declaração do @FernandoHoliday que em entrevista p… @lulutostes1 @aguedescartoon Estão com tática diferente hoje pq estão apanhando? Kkkkk\n\nHoje ao invés de ficarem xingando o @aguedescartoon estão vindo aqui com essa civilidade toda vender essa narrativa pra ver se convence ele a repassar? Kkkkkkkk Mudaram a tática? Kkkkk @kimpkat Vc faltou com o respeito Mas não adianta só criar o fake. Tem que contratar uns assessores e pagar botfarms e software pra disparar os posts. Sem um patrocinador pra te dar isso, não fará muito efeito. https://t.co/mSoojgmlwk https://t.co/KX4nEYVTNB @Calango_Error @Rconstantino Nossa, mas vc tá brava? Não aceita crítica? Kkkkkkkkkkkkk @christophernoln @Rconstantino @Calango_Error Eu sei que vc existe na vida real. Vc é aquele cara que dirigiu o filme do Batman, não é? RT @blogteleguiado: Liberdade de expressão não é questão ideológica https://t.co/6B713efWVw https://t.co/yXXr5OJGow RT @enilsoncba: @DaniloGentili Danilooooo! 😭😭😭 NÓS GRITAMOS PELA VIDA DA ANTONELLA, nossa princesinha de 1a3m, que porta a doença AME. A cu… RT @claudioedantas: @allantercalivre Esse requerimento é velho, de fevereiro. Foi a primeira tentativa. Estamos na terceira, @allantercaliv… RT @o_antagonista: Em nota enviada a O Antagonista, a senadora Juíza Selma, do PSL, admitiu que tem sido pressionada para retirar sua assin… @Rconstantino @Calango_Error Se vc não reparou ainda @Rconstantino o ideal é q vc nunca mais critique esse governo. Seja democrático e obedeça essa multidão virulenta que só existe no twitter, por favor. @dandan1000_grau Ótima analogia. @WillRoches Claro, acordei loucão aqui. RT @sarubo: Mas o Allan Beiça Livre... https://t.co/hfBhw5KI8X Imagina vc se meter com esqueminha MAV pra manter a ilusão que “todos odeiam seus inimigos e todos compram as suas narrativas”. Aí fazem merda, as pessoas reais começam a entender qual é a sua, se manifestam e vem à tona que vc nunca controlou é nada. \n\nDeve ser uma sensação ruim RT @diguinhocoruja: Trabalhar para dar fim a CPI da Lava Toga com a justificativa de manter a governabilidade é pra rasgar o cu até a nuca.… RT @o_antagonista: Bivar admitiu que @FlavioBolsonaro foi escalado pelo PSL para tentar retirar apoios à CPI da Lava Toga. https://t.co/iuB… @marcelopapa01 @fanboyincorreto @o_antagonista É mentira? Ele não estava portando uma? Será que eles usaram photoshop e fizeram essa montagem? @Calango_Error @Rconstantino Sempre que alguém com nome e rosto faz alguma crítica o primeiro post xingando é sempre de alguém sem nome e rosto. \n\nSe vc responde eles falam “não aceita crítica?”\n\nMas o que dizer de quem não aceita que critiquem políticos? @josewel35048914 @Denys337 @aguedescartoon Cara, se vc se lembrar uns meses atrás eu tava meio sumidão de twitter. Tava achando aqui chato.\nEssa militância me deu um propósito de voltar a frequentar aqui. Está sendo extremamente divertido e gratificante pra mim fazer o que eu estou fazendo. Em breve vc entenderá. RT @DiogoPortugal: Fritada com Diguinho Coruja neste domingo! Fotos @diegoruahn #fritada diguinhoothenoite @danilogentili @igorguimaraes_ @… @Denys337 @aguedescartoon E o Cunha? \nKkkkkkkkkkkkkk\n\nOs caras são os novos petistas mesmo @aguedescartoon @Brunobbm01 @lucianoayan Vc não cumpriu sua cota de babação ainda, falta mais um pouco. Aprende como eles fazem com os políticos @aguedescartoon @lucianoayan Coitadas hahahahahhahahahHahhHahahahHhH\n\nE pior que coitadas é menos merda que “leitadas” pq qdo vc se chama “leitadas” vc tá tipo implorando pra alguém gozar na sua cara. RT @SamTadeu: Apreenderam 19 celulares com a mina. Ela falou: 'ok, eu pago o imposto'. A fiscal: ' não, você já perdeu. Agradece se não for… @arecobarudino Hahahahah RT @arecobarudino: vou ver no dia da estreia já ctz https://t.co/GfM7Eh5Kfr RT @Desesquerdizada: O \"Boiada Livre\" decretou: a CPI da Lava Toga \"não dá em nada\".\nA profética conclusão surgiu depois que ficou claro qu… RT @aguedescartoon: Agora a CPI da lava-toga era uma porcaria. Entendi. Pq não avisaram antes? Poxa. @lucianoayan Eu me pergunto porque gente que não mostra o rosto e nitidamente controla perfis fakes se preocupa tanto. @lucianoayan Os caras estão paranóicos demais. Aqui é toda hora gente falando que estou criando falsas narrativas pro meu documentário ou que estou forjando processos para incriminar a direita verdadeira. Eu achava que o Texugo Dont Care. @Bahia_will @ajulysantos Kkkkkkkkkkkkk @Luciano90112572 Meu próximo candidato será sua mãe. Kkkkkk @ajulysantos Kkkkkkkkkkkk @priweinstein @ajulysantos Kkkkkkkkkkk RT @lucianoayan: Opa, a matéria cita o deputado @carlosjordy , que estava reclamando muito no Twitter dias atrás. \n\nQuando o @DaniloGentili… @KarolAmericana Obrigado por ter ido @ajulysantos Qual foi? Tô por fora. Trabalhei dia todo. @SandersonFlavio Na ocasião eu criticava a comitiva do PSL que foi pra China. De todo modo que o DEM, PSL, PSDB, PT se fodam @IuriAndrews A comitiva que estava com ele no video é do PSL. Na ocasião do post eu criticava a comitiva que foi pra China. @Jordanizta 1) Essa tag quem subiu? Vc mapeou?\n2) Se vc não reparou o único da família que tá afim de defender o Flávio é o pai. @fanboyincorreto @marcelopapa01 @o_antagonista Esse jornal é excelente tb. @lucianoayan O anão ficou brabo Isentões Kkkkkkkkkk https://t.co/7rn1VT4GGI @marcelopapa01 Muito sério. Até agora @o_antagonista mandou bem. Mas vc me recomenda outro veículo? Tipo qual? Esse deputado é o mesmo que semana passada apareceu me xingando pq eu disse que mapeei ataques de MAVs vindo do PSL.\n\nSempre começam assim: um perfil não anônimo/real ligado a ala BolsoPSL posta a tag inicial e a automação impulsiona o resto. Enganam as pessoas q foi “o povo”. https://t.co/uVvg6SDyCh @gioopereira_ @SamTadeu @pauloap Obrigado, é o meu trabalho. https://t.co/iDlPReb8EF https://t.co/3vCy7jX0fg A minha parte eu criei em 4 horas! Hahahahahahaha! https://t.co/Wq2imlUOxw @paularosiska Eu tenho admirado o Nando Moura, ele tem se mantido coerente e independente. Ele apanhou muito por defender o que acredita, aguentou e tem se mantido coerente. RT @andrepaste: aoooooow https://t.co/J4yq2tnUAx Fiz esse post em Janeiro. \nTava na cara que é um estelionatário. https://t.co/Q3fbh5bVlu RT @Desesquerdizada: O Pano Livre nos bloqueou, mas nós respondemos: FAKE NEWS. Constituição. \n\"Art. 52: Compete privativamente ao Senado:… @priweinstein @Desesquerdizada Mas eu achava q quem bloqueava era covarde Kkkkkkkkk @SamTadeu @pauloap Claro, é uma lista de pessoas que devem ser achincalhadas. Qual é a piada? Qual o twist? Nenhum. É apenas uma lista mesmo. Nao tem piada alí. É uma lista. RT @MrLucasMachado: Hoje tô indo gravar fazendo cosplay de @DaniloGentili \nSeparados por um talk show e 115 processos https://t.co/KGfQPQIL… RT @DaniloGentili: A melhor maneira de irritar os cães não é os atacando. É atacando os seus donos. \n\nSe latem pra vc não falar, fale.\nSe l… @RMStudioInfo Encontrei o politicamente correto da direita kkkkkkkkkkkk @cruella_7 @A_Dita_Cuja @professorigor @bernardopkuster @aguedescartoon @Gusttra Continua sem responder o seu relativismo. Kkkkkkkkk parece que o seu politico nao pode ser contrariado. Que cachorrinho mimado vc é. Kkkk RT @JoelPinheiro85: Para Bolsonaro só podem existir dois tipos de pessoa: bajuladores e inimigos. RT @juliaxtina: Ilustra que fiz para o @DaniloGentili do seu personagem Jack, do filme Os Exterminadores do Alem contra a loira do banheiro… Vc é a maior gênia. 19 anos, nunca fez curso e desenha assim. https://t.co/6yLpONijIg @bolsonaro170017 @Obede94418573 Chegou quem eu disse q chegaria kkkkkkkkk @Obede94418573 Kkkkkkkkkkkkkkkkk esse papelzinho q vc se presta é tão ridículo que nem nome e foto vc usa pra não passar vergonha.\n\nE claro, grandes chances de aparecer um outro perfil aqui embaixo dizendo algo tipo “pegou pilha”, “para que tá chato” “vai perder audiencia” etc @RubimLima Não foi piada. Foi uma crônica. @Cristia55154051 Quer melhor? Assina o pacote premium. Kkkkkkkk @sarubo Vc viu o q eu fiz? E se vc agitar antes de beber fica Duro Cola. https://t.co/9EKC7pp8pI @CulpadoC @cruella_7 @A_Dita_Cuja @professorigor @bernardopkuster @aguedescartoon @Gusttra Vc é o perfil de apoio que aparece embaixo pra parecer que a pessoa de cima está com moral. Vcs deveriam variar um pouco o esquema. Kkkkkkk @cruella_7 @A_Dita_Cuja @professorigor @bernardopkuster @aguedescartoon @Gusttra Não, vc não respondeu pq qdo o presidente dá block é tchutchuca e qdo eu dou é tigrão. Vc não está fazendo seu trabalho direito. Não será funcionária do mês assim. Kkkkk @brendaolivieri Não sei @MarceloMadurei8 Se ele pagar um esquema de patrulhamento de opinião no twitter como esse q vc faz parte creio que o criticarei sim. No mais vejo apenas uma foto de convidados do presidente. Eu tb tenho foto com ele aqui. Qual é a relação dessa foto com as minhas críticas contra milicia virtual? @olcorreia @MarceloMadurei8 Vamos analisar: Vc aparece pra comentar logo após um perfil fake tentar me intimidar. Perfil criado naquela leva de agosto.... Diz q “caí em descaso” e “não é mais meu fã”. Mas continua me seguindo mesmo assim. Vamos falar a real, vc nunca foi meu fã. Vc foi criado pra patrulhar. https://t.co/78w5SnXJgr RT @Flavio_Quintela: R$ 4,5 bilhões.\nSó para situar o número. Em 2018:\n- Ambev lucrou R$ 11,3 bi\n- Petrobrás lucrou R$ 25,7 bi\n- Véio da Ha… RT @o_antagonista: Ex-ministro de Dilma elogia escolha de Bolsonaro para PGR\nhttps://t.co/P30uEBmWLF @cruella_7 @A_Dita_Cuja @professorigor @bernardopkuster @aguedescartoon @Gusttra Kkkkkkkk ficou sem resposta desconversou. Fraquinho. @Marcelo290504 @lobaoeletrico @dgsoulza @pruda1268 @POLITIMITAGEM_B O software permite disparo de frases randômicas @gezynhaalucas Quando vc critica alguém da familia bolsonaro ou assessores ou alguém da ala do psl que está no esqueminha a maioria que aparece na TL pensa exatamente assim. @fiqueisembeck No... esse parece ser um de adesão espontâneo. MAV tem automação pra subir tags, perfis de farms, coordenação para linchamentos e para passar narrativas, e claro, simpatizantes por adesão espontânea. Eles fazem tudo isso pra doutrinar pessoas mesmo. @DLuzente Tá ruim. Melhore. Kkkkkkkkkk E você é o motorista iluminado que decide quem deve ser atropelado  e morrer, certo?\n\nImagino gente que pensa igual você com cargo e poder... https://t.co/oo4IYyjjO6 @bonigirll Qual a punição para alguém que passa dos limites aceitáveis? @DLuzente Kkkkkkkk melhora esse perfil aí https://t.co/Yv3vmHClMK @dgsoulza @pruda1268 @POLITIMITAGEM_B @lobaoeletrico Ele sabe que atrás da pessoa com 7 seguidores tem um cara sendo pago controlando 50 perfis com 7 seguidores. Estão apenas defendendo os seus patrões. @RicoMota32 https://t.co/coQUbyTunI @FabricioManckel @ananiasfernanda E você é o motorista iluminado que decide quem deve ser atropelado  morrer, certo? @filipelopesreal @atosrf @Su_rreal Nesse caso não é bem inveja. É uma maquininha militante oficial do governo mesmo. @atosrf @Su_rreal É ótimo pra mim ser assim! Me poupa muito trabalho. @ArmandoPiccini2 @Su_rreal Não. Tudo começou um domingo que eu identifiquei que a direita estava fazendo igual a esquerda e usando mav e aí entrei na listinha negra deles. @HosanaLopes16 @Su_rreal É nos menores frascos que estão os melhores perfumes. Kkkkkkk RT @BlogDoPim: Não é porque alguém diverge de você em questões políticas pontuais que essa pessoa não tem caráter. Nem é por convergir que… @cruella_7 @professorigor @bernardopkuster @aguedescartoon @Gusttra Uns se ofendem por verem usar a imagem de cristo em vão como propaganda de político. Outros se ofendem pq um perfil genérico que fez isso foi zuado. Cada um se ofende com o que acha importante @cruella_7 @A_Dita_Cuja @professorigor @bernardopkuster @aguedescartoon @Gusttra Nós damos blocks pq somos muito sensíveis, meu amor. https://t.co/Og0C5ze020 RT @rebeldescalca: Os Crivellas do lado de lá... https://t.co/tqQim6iBfr @SamukaMuzel @xicograziano Olhe de novo, veja que as pessoas comuns dialogam normalmente e os perfis sem nome com foto falsa passam intimidações e narrativas. Eles que dão o tom do “certo e errado” do “nós contra eles”. @Andrea64247611 @C4milaCC0 @claudiavrberna1 Fora esse, qtos outros perfis vc controla? @CanellaMatheus Vc é jovem, tem bastante vida pela frente ainda.\n\nImagine a tortura. @AmorimKasusclay @lenyanw @Sandro15572107 @lucianoayan Parabéns pela análise. \nFaltou me dizer que alem disso eu tb sou bastante inseguro e medroso 😏\n\nEsclarecido os fatos sobre quem sou poderia responder a pergunta acima? @lenyanw @Sandro15572107 @lucianoayan Se ele está cagando e andando para o que eu falo qual a sua necessidade de vir aqui defende-lo? Kkkkkkkkkk @DcmGuduzin @MauMeirelles @EdivalmirMassa @ZeGeraldo1436 Nossa tá chorando ainda? Kkkkkkkk @Atreviz Eu atualmente estou trabalhando para mim mesmo. Tá querendo contratar? @Sandro15572107 @lucianoayan Entro no seu perfil e te vejo 100% do tempo propagando governo. Apareceu aqui agora pra pedir minha demissão. Compartilha prints com datas alteradas. Qual recado tá tentado passar? Que vcs realmente trabalham pro presidente e que eu serei demitido? O presidente quer minha cabeça? @ailunicto @Sandro15572107 @lucianoayan Sim. Percebeu? Soltando prints fakes e narrativas mentirosas pra me intimidar. Tentando criar o climinha que serei demitido se eu continuar falando isso. @cruella_7 @professorigor @bernardopkuster @aguedescartoon Kkkkkkkkkkkkkkkk https://t.co/lC3o8N8CEJ @darlangiordani @marlonsilv20 @lucianoayan Economia péssima, nao recuperou ainda, pelo contrário. Cortes grandes  em todos setores onde trabalho RT @claudioedantas: Estão criminalizando o combate ao crime. E o q tem de idiota útil não está no gibi. @Su_rreal Esse é o meu papel. Divertir o público. @MarceloMadurei8 Vcs nao dão a minima pra esquerda. O negocio de vcs é punir todo mundo q nao se ajoelha para os seus patrões. Kkkkkkk @ArmandoPiccini2 Vdd. Mas como eu jamais comeria sua bunda recomendo que guarda sua opinião pra vc. Kkkkkk @Zer0Playr Não acho não. Aquilo lá tem disparo centralizado bem controlado. Tem pouca gente controlando muito perfil. Eu já sei o nome do software que usam pra automação das respostas randômicas. @FabianRoniery Reclame com eles @afilhocastro Pelo menos no tuíter de quem não concorda 100% com tudo o tempo todo esses caras não são 1%.\nSão tipo uns 80%. Dá um search e confere. Então reclame com eles. Eles estão queimando o filme de pessoas bem intencionadas como vc. Não seja como a “muçulmana moderada” que assiste o “muçulmano radical” queimar o filme de todos e fica calada. A única coisa q esses caras estão conseguindo é fazer todo mundo pegar nojo. https://t.co/0E3NoawumM @TheusW1 @Lola19380756 @SamTadeu Claro, bem pior. E bem mais cínico e traidor tb. @LucasBRdireita Vc está iludido, meu amigo. Um dia senta comigo que te mostro o estudo e os indíces de audiência. Nada tem a ver com o que vc diz. Abraços. @marlonsilv20 @lucianoayan Adoraria , mas tá meio punk o mercado ainda @lucianoayan Aqui fica bem claro que existe um grupo e esse veio passar recadinhos do grupo. O que entendi é que eu sofro retaliação por chamar perfis fakes agindo de maneira organizada de MAV. Aí te pergunto: onde isso vai parar? https://t.co/TTqbHeQTmB @lucianoayan Teve uns aí hoje me explicando que eu sofro retaliação por falar isso, acredita? RT @lucianoayan: Esse pessoal surta demais com o termo MAV.\n\nMas é chique: \"militante em ambientes virtuais\". \n\nÉ melhor que miliciano virt… RT @MauMeirelles: @DaniloGentili @EdivalmirMassa @DcmGuduzin @ZeGeraldo1436 O que acho mais divertido na turma é a coisa do FALO VERDADES,… @cleibelarmino @xicograziano O algo de bom seria o quê? Deixa eu ver se adivinho... Escrever aqui no twitter conforme vossa majestade ordena? @mr_cesio137 @semcpfnaoopinas @gilbertoGigio @Cristal__2011 @EveraldoDalg Kkkkkkkkkkk eu vi os bots subindo tags em 5 minutos kkkkkkk eu vi a tal “retaliação” ... kkkkk que gente falsa. Bom, o bom é que vai ficando claro quem é apenas funcionário e quem defende o que acredita. @rmarinss @Mooalvess @igorzismo @diguinhocoruja @CrissPaiva @matheus_ceara @DiogoPortugal Evitamos tocar nesse assunto @mr_cesio137 @semcpfnaoopinas @gilbertoGigio @Cristal__2011 @EveraldoDalg “estou sofrendo retaliação por ter falado sobre as MAVs”. \nVeja: um perfil sem rosto ou nome, militante do bolso, que passou o dia me passando recadinhos de “retaliação” pq, segundo ele mesmo admite, eu falei coisas q eu não devia. Ele age como MAV pra me provar q MAV não existe. @gilbertoGigio @Cristal__2011 @mr_cesio137 @EveraldoDalg Poxa, mas agora vc me deixou envergonhado. Fico extremamente decepcionado comigo mesmo por ter cativado um fã como vc. Errei feio. Se puder dar unfollow e não me acompanhar mais agradeço. Quebra essa, campeão? RT @JhonatasSantos_: @GabrielAlvesS18 cara, o Igor Guimarães colocou um áudio seu zuando o Diguinho no fritada hahahahah @Mooalvess @diguinhocoruja @CrissPaiva @igorzismo @matheus_ceara @DiogoPortugal Obrigado por ter ido :) RT @Mooalvess: Fritadaaaa 🔥💖\nFoi dms 💖 https://t.co/Uf1zSVbQaq @xicograziano Se você prestar bem atenção na sua TL verá muitos perfis sem nome e sem rosto te dando um recadinho. Vc acaba de tomar um cartão amarelo. Mais um ou dois comentários desse tipo e vc será empurrado para o time dos isentões. @ClinicaZeno Kkkkkkkkkk https://t.co/d4eVYXSos6 @DeThiarlan A melhor maneira de conseguir vaga na política é adulando o governo não o criticando. Sua teoria não faz sentido. @geovanebrelaz_ @JoaquinShow Sentiu! @AdrianoAmbrosi4 @madeleinelacsko @catafoiareturn @InahMaria2 @Marinah31477715 Vc tá muito frágil meu amigo. Kkkkkk @madeleinelacsko @AdrianoAmbrosi4 @catafoiareturn @InahMaria2 @Marinah31477715 Realmente é um grave erro. Um crime. Pena que estou aqui solto. @DLuzente @lucianoayan @MauMeirelles @lobaoeletrico Se quiser que eu pareça comediante pague ingresso depois pode cobrar alguma coisa Kkkkkkkkkkkk @obrunofelix Sentiu @obrunofelix Pegou pilha Kkkkkkkk @AdrianoAmbrosi4 @madeleinelacsko Poxa vida, outro dia estava vibrando quando o presidente xingou mulher e pai morto dos outros. Eu achei que era o tipo de linguagem que gostavam. Não imaginava que se ofenderiam por causa de xinguinho. Mas vc é bem seletivo no chilique, hein careca? Kkkkkkkkkkkk @DLuzente @lucianoayan @MauMeirelles @lobaoeletrico E isso te remoe? @Cristal__2011 @mr_cesio137 @EveraldoDalg Eu achava que os vermes eram hemafroditas. Kkkkkkkkkkk @Cristal__2011 @mr_cesio137 @EveraldoDalg Fique tranquilo quanto a isso. @mr_cesio137 @EveraldoDalg Se vc soubesse tudo que eu tenho coletado. Eu acho que usarei esse seu print inclusive. Será irônico. Kkkkkkkkkkkkkk @EveraldoDalg Boa Tarde. Tendo em consideração que eu não citei nomes, alguém acaba de se dedurar. Kkkkkkkkkkkkkkk https://t.co/XqLRAPYMhj @JoseMedeirosMT @EduPrimitivo Alguém se dedurou aqui. RT @MauMeirelles: @DaniloGentili @EdivalmirMassa @DcmGuduzin @ZeGeraldo1436 REVOLUÇÃO CHAPA BRANCA! @DcmGuduzin @MauMeirelles @EdivalmirMassa @ZeGeraldo1436 Não tem como eu chamar meu patrão de MAV: ele não está no twitter controlando fakes. Ele é gentil e honrado. Vc por exemplo, escondido atrás desse fake usou a imagem dele pra tentar ameaçar meu emprego. Ele que é dono da empresa nunca fez. Foi fraquíssimo. Vc falhou. Repense. @Guilherme_gohaN Se vcs ganharem eu levo! @RagnarVult @aguedescartoon @professorigor @bernardopkuster Kkkkkkkk eles usam o discurso que “nao mostram o rosto pra não sofrer represália”. Todos os dias pessoas com rosto e nome nos xingam e não rola represália alguma. Na real a farsa é que precisam do anonimato para poderem controlar muitos perfis e se passarem por “povo espontâneo” https://t.co/wecSZcsJnr @RagnarVult @aguedescartoon @professorigor @bernardopkuster podem fazer qtos memes quiserem, usar a automação pra disparar, etc etc. Ninguém liga. E então vcs criam a narrativa que ligamos e ficam repetindo pra ver se isso vira verdade. E então qdo alguém diz “Se o Texugo dont care mostra o rosto” vc chilica “aimm”. Vc Care a lot. @lucianoayan @MauMeirelles @lobaoeletrico É igual o personagem da Glen no filme. Eles se submetem a um monte de baixarias pra se tornarem respeitados pelo governo mas serão pra sempre apenas as putonas que eles usam quando precisam. @lucianoayan E pela fraqueza desses tuiteiros vc vê que são apenas usados pra isso mesmo. Por mais que dêem esperança pra eles que um dia subirão na importância não vão. Burro manso só serve pra carregar carga mesmo. @aldsonmachado @Guilherme_gohaN Vamos jogar juntos! @Guilherme_gohaN Se vc for na Brasil Game Show esse ano me avisa q te encontro lá. @Guilherme_gohaN Caraio... dar RT no twitter e publicar algo que já é público = atacar? Eita. Aprendi mais uma hoje. \n\nObrigado amigo, refletirei aqui sobre isso. @RagnarVult @aguedescartoon @professorigor @bernardopkuster Vc esqueceu de citar que se prestam a esse papelzinho pra chupar rola de político. Kkkkkkkkk @RaFaEll92967823 Ganha qto pra isso? @geovanebrelaz_ @JoaquinShow Dá o cu pra ele entao. Kkkkkkk @ilhadelost2019 @Guilherme_gohaN Poxa vida, eu realmente pisei feio na bola né? Comprometi minha reputação agora. Kkkkkkkkk https://t.co/iOUsTBp5uK @RagnarVult @professorigor @bernardopkuster @aguedescartoon Os “ataques” começaram assim: sempre que vc rejeita certas narrativas ou mexer com certos políticos/assessores/filhos vcs tiram os cachorros da gaveta. O bom quando a gente não se cala é que vcs ficam mais expostos e dá pra mapear direitinho. @Guilherme_gohaN Eu to ligado q pediram pra vc me “dar esse toque”. Obrigado, amigo. \n\nMe conte agora, amigo, quais ataques tenho praticado e contra quem? @Avila1592 https://t.co/0z7YrYyLat @DeThiarlan Calma... não tô querendo a vaga do seu amor @RicardoNasc Os caras inventam cada uma @geovanebrelaz_ Eu estou muito leve e tranquilo, amigo. \n\nApenas expondo pra todos o ridículo. Vc parece um pouco incomodado com isso. @Gihduraes @RaFaEll92967823 Eu acho vc meio doida... mas se for só zuera sem compromisso blz @upluanleal Alguém precisa aplicar a vacina. @RaFaEll92967823 Kkkkkkkkkkkk https://t.co/RBa3VpnqZ9 O fiscal de likes chegou pra dar os seus alertas aí, gente: https://t.co/balcPAIKhL @luciano7th Estou apenas expondo o que eu recebo com frequência. Se isso queima o seu filme reclame com eles. Se depender dos eleitores do Bolsonaro a programação da TV do Brasil será bem variada.\n\nTem bem mais que isso na minha TL. É legal imaginar essa gente toda no poder. https://t.co/HRzpAQfUY8 @lucianoayan @Ellyelson_FF Eles não responderão a sua pergunta. Eles voltarão com outro perfil fazendo uma nova acusação. @RogerioVilela Oi neném RT @paularosiska: Apenas mostrando o que é essa gente https://t.co/TwAhcVsWfk @PericlesJones @C4milaCC0 @claudiavrberna1 Nossa mas cê ta brava? Kkkkkkk @C4milaCC0 @claudiavrberna1 Mano, eu só falei uma coisa genérica. Vcs estão falando como se eu tivesse que parar de falar. Kkkkkkkkkkkk RT @lucianoayan: Esse pessoal isentão que \"não aguenta a pilha\" desse povo que \"só quer fazer zoeira\". \n\nNão é generalização, mas esse disc… @claudiavrberna1 Acordei agora. \nMas falei algo que não devia? Devo respeitar o seu toque de recolher? A melhor maneira de irritar os cães não é os atacando. É atacando os seus donos. \n\nSe latem pra vc não falar, fale.\nSe latem pra vc parar, continue.\nSe latem pra defender tal pessoa é exatamente essa a pessoa q deve ser atacada.\n\nNo mínimo isso os tornarão péssimos funcionários. @arrrowp @marcelocielo @aguedescartoon @MRRALPH15672959 @lobaoeletrico Eu acho melhor a gente apoiar o Eduardo Embaixador, curtir o Aras na PGR, não exigir investigação do Flávio , etc, senão o PT volta. @VitorPaulinoG @aguedescartoon @MRRALPH15672959 @lobaoeletrico É a nova era @hugoapascentar @aguedescartoon @MRRALPH15672959 @lobaoeletrico Chegou o fiscal de like!\n\nBom, sendo likes e comentários algo tão importante assim tenho um versículo bom pra vc tb: “Por que você repara no cisco que está no olho do seu irmão, e não se dá conta da viga que está em seu próprio olho?” Mt 7:7\n\nKkkkkkkkkkkk https://t.co/D6aVnS6y2U @Anayacards @aguedescartoon @MRRALPH15672959 @lobaoeletrico Foi a puta da sua mãe que me ensinou Kkkkkkkkk @aguedescartoon @MRRALPH15672959 @lobaoeletrico Hahsua isso RT @ProfBunazar: É esse tipo de gente que faz com que a Direita seja tão mal vista. O sujeito compara ser gay com ser pedófilo. O senhor é… @Ronaldo53Fusca @xandaoDamascena @Volnei_bob @arielescorrea Eu vou continuar nesse paranuaê. Pode dar unfollow e deixar de seguir. Na real eu faço questão que vc não me assista. Abraços. @omaxsteel @l_passarelli Ahahajjajajjajahahahah @aguedescartoon @MRRALPH15672959 @lobaoeletrico Ele está o tempo todo falando isso “e o maia” e “o tofffoli” sendo que quem votou no Maia foi político q ele defende e sendo q em breve vão mandar ele defender o Tofolli @WAkenaton @ozheas30 @lucianoayan @crisdbernart É uma lista com os novos inimigos do Brasil.\nBonita, não é? @Antonio30838103 @aguedescartoon Para um “autodidata” vc está com sérias dificuldades de interpretação de texto. @WAkenaton @ozheas30 @lucianoayan @crisdbernart Qual sua dúvida? @nahnegreiros @mirovalente @DcmGuduzin @j_damassa E ficam pedindo demissão tb @Sam_Mrx @mcGordinhofeliz @lenilson98 @DcmGuduzin @felipeneto @jairbolsonaro Tô não. Tô me divertindo e coletando coisas. @mcGordinhofeliz @lenilson98 @DcmGuduzin @felipeneto @jairbolsonaro Vc desconversou. Não é um cara honesto nem corajoso. Não vai longe na vida. Tchau. @jpployola @mcGordinhofeliz @lenilson98 @DcmGuduzin @felipeneto @jairbolsonaro Estou coletando algumas coisas. @RibeiroFC3 @Acmstewart @lelezinhabras @A_Dita_Cuja @BarbaraBraga137 @DcmGuduzin @ADILSONUOMINI Nossa, mas o seu presidente xinga mulher e pai morto dos outros e vc acha bacana. Ficaram tão sensíveis assim pq viram um humorista falando merda? Acho que vcs estão confusos. O meu conselho é: não me assistam. Assitam os vídeos do Olavo. Não tem palavrão nenhum alí. @WILLIANSANFS @Onegocios77 @MariaJo55818973 @DcmGuduzin @xfogoS2 Procure no Youtube.\nTô zuando lá. Varias vezes. \n\nZoa agora o presidente. Kkkkkk @nina_mayer @lelezinhabras @A_Dita_Cuja @BarbaraBraga137 @DcmGuduzin @ADILSONUOMINI Pelo visto vcs nem sabem de nada. De todo modo parecem bastante histéricos e paranóicos com esse assunto. @soniacordeiro14 @DcmGuduzin @DaniWineBrasil Vc já pensou em abrir um site e virar colunista de tv? Vc entende muito do assunto. @MrChurchilllive @DcmGuduzin @marciosabedotti Entendi. Vocês fazem justiça com a própria mão. Imagino vcs na rua armados. @mirovalente @DcmGuduzin @j_damassa Seus informantes são fakes tb? @mcGordinhofeliz @lenilson98 @DcmGuduzin @felipeneto @jairbolsonaro Nossa, mas se vc está apenas fazendo o bem não precisa se esconder. Quem não deve não teme. Ainda mais vc sendo conservador deveria confiar mais em Deus. Mostra o rosto. @TheBruzundanga @lumaciel13 @MauMeirelles @EdivalmirMassa @DcmGuduzin @ZeGeraldo1436 Criei como?\nEu me recordo que eu combatia mav esquerdista durante muitos anos. Nao me recordo de ter pago ou montado ou bancado ou incentivado esquema de militância virtual de direita @MRRALPH15672959 @Policialfilsof1 @ayubrazil @WagnerThomazoni Recomendo pra você: YOUTUBE / SEARCH / DANILO GENTILI RODRIGO MAIA\n\nSobre Toffolli anote aí: do mesmo jeito q vc viu a militância bolso relativizar Aras muito em breve a verá fazendo o mesmo com o Toffolli. Eu xingarei o Tofffoli e serei xingado por vcs por isso. Anote. @Policialfilsof1 @ayubrazil @WagnerThomazoni Eu disse isso? Onde? @RenanSantosMBL @lobaoeletrico Até deseinho tá na lista e vc não @lobaoeletrico Se tem lista negra lá nós estamos... hahahahahahahah da hora @Denise87401709 @MauMeirelles @EdivalmirMassa @DcmGuduzin @ZeGeraldo1436 Que tal se estudar mais? @lumaciel13 @MauMeirelles @EdivalmirMassa @DcmGuduzin @ZeGeraldo1436 Não criei cobras. Se vc se recordar eu passei muitos anos com MAVs petistas fazendo o memso comigo. O que eu faço com a MAV de direita é o mesmo que eu fazia com a de esquerda. Vc fazia o que qdo a MAV era de esquerda? @SonhadorAmigo @ozheas30 @lucianoayan @crisdbernart Imagine essas pessoas com poder de fato. @ozheas30 @lucianoayan @crisdbernart Já existe listinha deles. Saiu ontem. @ozheas30 @lucianoayan @crisdbernart A diferença é que esses fanáticos diziam que estavam em busca de um ambiente virtual livre sem patrulhamento ideologico. A esquerda patrulhava ideologicamente. Esses patrulham opiniões - mesmo de quem compactua com a mesma ideologia. @fanboyincorreto @eniodeiglis Eu acho que vcs querem uma nova campanha. Querem o “No Make Zuera With New President Again” @ozheas30 @lucianoayan @crisdbernart Da parte de ataques coordenados no twitter esse lado está igual. Posso garantir. @mcGordinhofeliz @lenilson98 @DcmGuduzin @felipeneto @jairbolsonaro Coisas particulares assim eu não posso abrir pra desconhecido. Coloque seu nome e rosto real. Se me passar confiança eu te conto. Sem isso fica difícil. Questão de segurança @eniodeiglis Se procurar no youtube vai encontrar eu fazendo com todos eles. Se quiser uma nova exclusiva pra vc aí terá que assinar o pacote premium. Sem pagar sem exigências. @mcGordinhofeliz @lenilson98 @DcmGuduzin Pq está tão interessado em ver até onde minhas forças vai? Isso é importante pra vc? @ozheas30 @crisdbernart @lucianoayan Como sempre vejo vcs vibrando qdo o presida xinga a mulher ou o pai morto dos outros eu achei que levavam de boa. E nem estou criticando o presidente por isso. Eu acho legal qdo ele xinga. Me surpreende ver vcs tão melindrados por isso. Achava q vcs “dont care”. Ainda em shok? @crisdbernart @lucianoayan Mas eu nem estou em lado nenhum. Sou apenas uma pessoa comum falando o que me dá na telha. Eu jamais poderia imaginar que isso seria um problema nessa nova era. @mcGordinhofeliz @lenilson98 @DcmGuduzin Da onde vc tirou que eu estou nervoso? Eu já reparei que sempre que ficam sem resposta dizem “vc está nervoso”. É coincidência ou falaram pra vcs que essa é uma boa resposta? @lucianoayan Mas eu sempre achei que quando vc organiza um esqueminha de militância que aparece pra cornetar qualquer critica q fazem aos seus patrões já estava implicito que é pq se importam - e muito. @lucianoayan Eles tão em shok?\nPegaram pilha? @mcGordinhofeliz @lenilson98 @DcmGuduzin A carreira dele acabou pq o McGordinhoFeliz com foto de japonesa - perfil criado hoje - o ameaçou? @lenilson98 @DcmGuduzin Se a esquerda ganhasse eu teria um monte de fanático no meu twitter pedindo minha cabeça no lugar q trabalho... \n\nEi...\n\nPerae... @pedrotarnoschi @wellmedina80 @xfogoS2 @DcmGuduzin Não mudei. Troquei mó idéia com ele. Gente fina o menino. Manda a sua e da sua namorada? @Sandro15572107 @Renatoguitarra Orra, que ameaça hein. To com medo. @Cristal__2011 @DcmGuduzin Valeu @jeconiasfernan @MariaJo55818973 @DcmGuduzin @xfogoS2 Pq não? Foi algo que eu falei? Dei alguma opinião errada? @Onegocios77 @MariaJo55818973 @DcmGuduzin @xfogoS2 Não são “internautas”. Vai na minha. Estou bem adiantado. @wellmedina80 @xfogoS2 @DcmGuduzin Primeiro queria ver se eu seria homem de falar algo depois dessa. Eu falei. Então apareceu vc e mudou de assunto. Fraco. @lelezinhabras @A_Dita_Cuja @BarbaraBraga137 @DcmGuduzin @ADILSONUOMINI Eu não quero ser mandado embora. Mas estranhamento um onda de fakes aqui começou a pedir isso alegando que o Silvio está numa foto com Bolsonaro. Não adianta mudar o assunto. Está registrado aqui o modo q vcs pensam. @sergiogalera @IlsaBernardo @DcmGuduzin @celsoeduadvogad @SilvioSantos Mas minha audiência é boa. Vcs que estão aqui através de perfis fakes pedindo q o Silvio Santos me demita. Por exemplo: a audiência da Raquel estava igual sempre esteve e vcs estão celebrando q ela saiu e pedindo o mesmo pra mim. Vcs estão pedindo demissão política. Tá registrado @Laura91115737 @ROBERTO22205936 @DcmGuduzin @selingarde Em breve a gente conversa melhor sobre isso ;) @Laura91115737 @ROBERTO22205936 @DcmGuduzin @selingarde To chorando pelo quê mesmo? @PS_K3LLY @marlonbrrandon @Cristal__2011 @DcmGuduzin Vcs não responderam. Hmmmm \nVcs vão se surpreender muito comigo ainda. Eu tenho certeza.\n\nPasse o recado pros seus chefes. @BarbaraBraga137 @DcmGuduzin @ADILSONUOMINI Deu? Eu tô de boas aqui. @xfogoS2 @DcmGuduzin Eu falei várias coisas depois dessa. Não aconteceu nada. @DanielP32628943 @DcmGuduzin Por quê? @MariaJo55818973 @DcmGuduzin @xfogoS2 O que vc quer q ele faça? @PS_K3LLY @Cristal__2011 @DcmGuduzin Foi a Cristal0929281 que disse. Não eu. Você estão confusos. https://t.co/ONA5pGQWhj @Cristal__2011 @DcmGuduzin @PS_K3LLY Eu continuo sem entender.\nO Silvio Santos vai me demitir pq um monte de fake pediu, é isso? Não é o presidente que está pedindo. São os fakes. Bom, continua sendo uma demissão política, não? A idéia seria colocar no lugar alguém que obedeça o seu time de fakes. É isso? @nilson_olimpio @Cristal__2011 @DcmGuduzin @PS_K3LLY Eles são ótimos. Os produtores tb são excelentes @IlsaBernardo @DcmGuduzin @celsoeduadvogad @SilvioSantos Na real eu só quero trabalhar. Eu nem sabia que fazer piada do governo ou falar de mavs no twitter geraria demissões. Eu achei que a nova era seria mais democrática. Obrigado por avisar do perigo que corro qdo critico ao seu governo. @ROBERTO22205936 @DcmGuduzin @selingarde Só de parente mamando vai uns 10% desse número. @EdivalmirMassa @DcmGuduzin @ZeGeraldo1436 Espero que eu seja demitido. Onde já se viu alguém que não concorda 100% com o governo 100% do tempo apresentando um programa na TV. Não foi pra isso que tiramos o PT. \n\nÉ um bonito registro do que pensa os militantes do presidente. Imagina vc com poder. @Cristal__2011 @DcmGuduzin @PS_K3LLY Se o governo está cagando para a minha existência pq tem um monte de fake aqui nessa thread pedindo pro Silvio Santos me demitir já que ele apoia o Bolsonaro? Não entendi as relações. @Biel_A_S @ReyFigueiredo @GVBA5 @DcmGuduzin Ela usava essa foto real no avatar? https://t.co/oSkX4oAUXD @DcmGuduzin @PS_K3LLY Em breve eu serei demitido? Hmmmmm ... então sendo eu demitido fica aqui o registro que vcs me avisaram antes. A causa da demissão será política então. Tipo o PT mandando demitir jornalista. Assim que funciona esses novos tempos. Entendi. @GVBA5 @DcmGuduzin Vc tem toda razão. Eu realmente preciso ser demitido , pois as vezes eu critico o governo e falei sobre perfis fakes , igual ao seu, que fica pedindo a cabeça de pessoas no twitter. \n\nQualquer democracia do mundo sabe que isso que eu fiz dá justa causa. @DcmGuduzin Vc trabalha como porta-voz dele tem muito tempo? @ReyFigueiredo @GVBA5 @DcmGuduzin Brutalidade em um post? \nVc anda muito sensível hein amigo. @Biel_A_S @ReyFigueiredo @GVBA5 @DcmGuduzin Eita...\nAgora eu fiquei confuso. \nVc chegou aqui me acusando de xingar fã e qdo pedi pra mostrar a fã que xinguei vc disse que não fica policia do xingamentos. Não entendi nada. Parece até que vc apenas bancou o idiota. @KirbyPixeI @Biel_A_S @ReyFigueiredo @GVBA5 @DcmGuduzin Conseguiu identificar que estou estressado apenas lendo o texto acima ou esse tipo de coisa é o q vc fala pra todo mundo que fala algo que nao quer? Kkkkkk @anhd88 @ReyFigueiredo @Biel_A_S @GVBA5 @DcmGuduzin Eu não conhecia essa etiqueta do xingamento. Eu só posso xingar então de forma gratuita. \n\nVc pode me mostrar o print de alguém que eu xinguei sem ser de forma gratuita? @Tulyhander @ReyFigueiredo @Biel_A_S @GVBA5 @DcmGuduzin Saquei. Bom, se eu xinguei fã mesmo vc deveria parar de me seguir. Isso não se faz. @Biel_A_S @alan_granzotto @ReyFigueiredo @GVBA5 @DcmGuduzin Qual fanzona, amigo? Era fã mesmo? Tipo... fãnzona mesmo... do tipo fã mesmo? Qual foi? @Biel_A_S @ReyFigueiredo @GVBA5 @DcmGuduzin Quais pessoas vc viu eu avacalhar? São pessoas que me xingaram primeiro ou não?\n\nPra evitar futuros aborrecimentos vc pode me passar uma listinha informando quem pode xingar e quem pode ser xingado? \n\nVivo pedindo isso pra esquerda e nunca me deram. Talvez vc consiga me ajudar. @GVBA5 @ReyFigueiredo @Biel_A_S @DcmGuduzin Ele estava se defendo da esposa do Macron então. Saquei. Eu realmente entendi errado como devemos usar os xingamentos. Eu acabei xingando quem me xingou primeiro. Eu já tinha feito isso antes mas vc não se ofendeu pq a pessoa q fiz isso não era de direita. Fiz tudo tudo errado! @alan_granzotto @ReyFigueiredo @Biel_A_S @GVBA5 @DcmGuduzin Qual pessoa comum? @J_Guto @ReyFigueiredo @Biel_A_S @GVBA5 @DcmGuduzin Saquei. Vc é o cara que protocola o xingamento. Pode me passar a listinha de quem posso xingar e quem não posso? @Biel_A_S @ReyFigueiredo @GVBA5 @DcmGuduzin Vc me parece um tanto paranóico com meu documentario. @WagnerThomazoni @renatoballico @lucianoayan @MauMeirelles Sua mina tem irmã? @villela_fellipe Foi muito fácil cara. Eu te explico: Eu tava lá zuando e criticando o governo, né? E vc tava rindo e tal. Aí qdo o governo mudou eu continuei fazendo a mesma coisa. Aí apareceram pessoas como vc mandando eu parar. Eu não parei. Aí eu perdi a graça pra vc. Foi assim que aconteceu. @Renatoguitarra Ah, acho que sim. Será uma aventura e tanto. Quer fazer parte dela? É só dar unfollow e cair fora, agora mesmo. Valeu. @Aiambocalamari @Denys337 A pessoa mais recompensada até agora foi o vendedor da revista. Esgotaram-se rapidamente após a proibição. @RafaelLunes @aguedescartoon @BolsoTrump7 Eu não zombei. Eu elogiei a sua influência e me desculpei. E não poderia fazer diferente. Trata-se do BolsoTrump7 @ReyFigueiredo @Biel_A_S @GVBA5 @DcmGuduzin Por que quando o Olavão e o Bonoro xingam é mitada e quando eu xingo é falta de respeito? Quando se trata de linguajar a sua indignação é bastante seletiva, não? @Biel_A_S @GVBA5 @ReyFigueiredo @DcmGuduzin Vc está descrevendo um homicídio hediondo e não um show de comédia @Cardoso Claro que vc sabe da onde @RodrigoAmaroda2 @Adilsoncapel @Flora61422631 @aguedescartoon @daniels50757302 @NeyAlencar4 @priweinstein @AvenaComVc Não. Nem dinheiro. Fica tranquilo. @mr_cesio137 @Adilsoncapel @Flora61422631 @aguedescartoon @daniels50757302 @NeyAlencar4 @priweinstein @AvenaComVc Aquela “tiazinha costureira” que usava essa foto no avatar? Kkkkkkkk\n\nPor que quando eu critico certos políticos do PSL e o governo aparecem pessoas como vc (sem foto e nome) ameaçando e acusando em ondas? Vc é pago pra isso ou faz de graça? https://t.co/HTiUlqaG6y @lielsustemol Não. Eu só concordo com o gibi do Hulk e do Shazam. @rodrigoglick Se aquela revista é ruim pras crianças imagina o aborto que eles apoiam. @BolsoTrump7 Mas como eu posso prosseguir na minha carreira sabendo que o grande BolsoTrump7 decretou minha falência? \n\nEu sequer sabia que é o bolsotrump 7 que decide qual é o lado do povo. Pequei, mas foi por ignorância. @Adilsoncapel @Flora61422631 @aguedescartoon @daniels50757302 @NeyAlencar4 @priweinstein @AvenaComVc O pessoal falou falou da esquerda e hoje querem “Wilsonsimonalizar” qualquer pessoa que faça qualquer crítica ao governo. Mas é bom pq revela bem a alma autoritária. Imagina essas pessoas que estão atrás desses fakes com poder? @lmfsecret Por que acha que eu disse isso? O cara só vai parar quando o Tony Stark der seu dízimo.  Aí até o aborto eles liberam. https://t.co/zONAQEYInt @Paulo_amda @aguedescartoon @daniels50757302 @NeyAlencar4 @priweinstein @AvenaComVc O cara da foto queria o Delagnol que vcs xingaram ou o Aras que vcs chuparam? @Calango_Error @aguedescartoon @daniels50757302 @NeyAlencar4 @priweinstein @AvenaComVc Minha turminha?\nSe puder ser mais claro agradeço. Eu posso garantir que nunca criei nenhum fake. \n\nPelo que pude entender vc está irritadinho pq alguém teria criado um vaporwave falso. Nossa... mas sendo vc um não fake e um não MAV estaria preocupado com isso pq? @Flora61422631 @aguedescartoon @daniels50757302 @NeyAlencar4 @priweinstein @AvenaComVc André, preciso te alertar uma coisa: as coisas para mim estão muito boas sim. Quinta renovei meu contrato até o fim de 2022 e a direção artística me elogiou muito. Essa semana meu filme ganhou dois prêmios internacionais. Sei que é dificil acreditar mas a Flora984737 mentiu. @MauMeirelles @WagnerThomazoni @lucianoayan Pra mim o problema é saber que existe uma máquina com recursos fingindo ser o povo espontâneo. O amigo aí ta com nome e rosto opinando. Não está criando falsa narrativa. Veio, opinou, discordou,  e não aconteceu nada com ele. Esse é o mundo normal. @WagnerThomazoni @lucianoayan @MauMeirelles Pô aí vc me desmontou. Não tem como zuar sua namorada. Vc já zoa ela sendo feio. Kkkkk parabéns. Bonita moça. @Franbotelho5 @AvenaComVc @EDGAR99757481 @Gabrieeeeeelzin @daniels50757302 @NeyAlencar4 @aguedescartoon @priweinstein Enganamos vcs!! Kkkkkkkkkkk https://t.co/7QtEaiuKH1 @EDGAR99757481 @Gabrieeeeeelzin @daniels50757302 @NeyAlencar4 @aguedescartoon @priweinstein @AvenaComVc Eu Xinguei vc e o presidente?\nVc eu não sei. O presidente tá sempre xingando e brincando. Não sei pq vc se doeria por ele.\n\nPercebo qdo vcs não tem respostas levantam acusação fictícia dando a entender que a pessoa que os encurralou teria feito algo ruim. É essa a sua tática? @Calango_Error @aguedescartoon @daniels50757302 @NeyAlencar4 @priweinstein @AvenaComVc Vc é o cara anterior que ficou sem resposta e apenas mudou de perfil pra parecer outra pessoa? @Gabrieeeeeelzin @daniels50757302 @NeyAlencar4 @aguedescartoon @priweinstein @AvenaComVc É bem possível que eu tenha respondido assim pq eu primeiro vi que a pessoa em questão tb xinga os outros e apenas respondi no memso tom que ela usa com todo mundo. Preciso que me mande o print pra avaliar, senão fica muito vaga a acusação. \n\nPq não usa sua foto e nome? @WagnerThomazoni @lucianoayan Muita gente escondida atrás de fake printando conversa falsa de whatsapp e disparando memes por automação? Hmmm. \n\nPoderíamos igualar? Se vc acha normal me passa sua foto e a foto da sua esposa ou namorada que o @MauMeirelles brinca com vc de volta, q tal? @priweinstein @aguedescartoon @FabioBolsonaro_ @daniels50757302 @AvenaComVc Esse Igor aí não me é estranho @rascsdenovembro @aguedescartoon @FabioBolsonaro_ @daniels50757302 @priweinstein @AvenaComVc Claro! @learsi_junior @aguedescartoon @FabioBolsonaro_ @daniels50757302 @priweinstein @AvenaComVc Alguns ficam putos se vc nao chupa pau dos politicos que eles idolatram. Outros são pagos pra isso mesmo, são neo-mortadelas @aguedescartoon @FabioBolsonaro_ @daniels50757302 @priweinstein @AvenaComVc Espero que essa não seja a foto dele e q ele nao esteja fazendo isso de graça. @FabioBolsonaro_ @daniels50757302 @aguedescartoon @priweinstein @AvenaComVc Se a gente está mal imagina vc que está aí patrulhando a gente. @Pardale @DLuzente @aguedescartoon @daniels50757302 @priweinstein @AvenaComVc Mas vc torce pela Globo? Não entendi. Achei que estavam em guerra contra a Globo. Melhor seria torcer pra Record, não? @DLuzente @aguedescartoon @daniels50757302 @priweinstein @AvenaComVc O que eu deveria sentir? @Earth__Heaven Hahahaha @DLuzente @aguedescartoon @daniels50757302 @priweinstein @AvenaComVc Mas apenas um retardado tentaria rir em uma conversa normal onde não tem ninguém fazendo graça. @daniels50757302 @NeyAlencar4 @aguedescartoon @priweinstein @AvenaComVc Vc chegou com muitas acusações aqui . Disse q André quer ser entrevistado. Que estamos chorando. Cada vez que mostramos que vc está mentindo, ao invés de mostrar pq estaríamos errado vc cria uma nova acusação. A de agora foi q “não aceito críticas”. Por quê? @Pardale @bartolomeuzin2 @aguedescartoon @daniels50757302 @priweinstein @AvenaComVc Por que um perfil sem nome e foto se incomoda tanto qdo se fala em MAV? Me ajude a entender. @williamgeovani5 @aguedescartoon @daniels50757302 @priweinstein @AvenaComVc Eu o chamei para ir lá em Março junto com Carne Moída e Peixe Aquatico num especial que fiz de animaçao e ele nao quis ir. Disse q é tímido e nao gosta muito de aparecer. Se puder pedir pra ele aceitar o convite armo de novo. @OdacirTRX @aguedescartoon @priweinstein @AvenaComVc Imaginemos que o q vc disse é verdade: estamos chorando pq vc “mexeu com a gente”. Realmente. Isso seria desprezível. \n\nQuão mais desprezível é quem chora , não pq mexeram com ele, e sim pq mexeram com o presidente ou outro político , tipo, o filho do presidente? É o seu caso? RT @arecobarudino: “Horkheimer compôs toda a obra do grupo Molejo” https://t.co/rkgK7AJmyI @XvoltoliniX @aguedescartoon @daniels50757302 @priweinstein @AvenaComVc Ou será q vc é o mesmo cara que entrou em outro perfil diferente pra se defender? @bartolomeuzin2 @aguedescartoon @daniels50757302 @priweinstein @AvenaComVc Já chamei no início do ano, antes disso tudo, era pra ele ter ido com o carne moida e o peixe aquatico mas ele negou ir. Disse q nao queria. @aguedescartoon @daniels50757302 @priweinstein @AvenaComVc O futebol ele vê no perfil normal dele, não nesse perfil que é o de trabalho. @Thiago_Vicente Fumando Havano meu fio @priweinstein @daniels50757302 @aguedescartoon @AvenaComVc Mas é por isso que usam fake. Não precisam ser coerentes. Só precisam aparecer e atacar. @daniels50757302 @aguedescartoon @priweinstein @AvenaComVc Alguem aqui disse q é errado se nao tiver meu pensamento? @daniels50757302 @aguedescartoon @priweinstein @AvenaComVc “No twitter vejo mais de futebol do que de política” Kkkkkkkkkkkk https://t.co/LJZDDvCnZR @aguedescartoon @daniels50757302 @priweinstein @AvenaComVc O daniel85937272049 agiu exatamente falei que eles agiriam: eles inventam um motivo para desqualificar sua crítica ou observação. Ou seja, vc não criticou pq é criticável e sim pq “quer uma entrevista”. É só rolar pra cima que vai ver que ele fez exatamente o q eu disse q faria. Se fosse um Coringa realista mesmo ele não teria ganhado esse prêmio. Teria roubado. https://t.co/yx30N6lnVj @Edumarangom @lucianoayan @MavPsl Qual argumentação não aguentei? Não vale repassar narrativa falsa. @aguedescartoon @priweinstein @AvenaComVc Mas nãp estao patrulhando nao @aguedescartoon @priweinstein @AvenaComVc O que eu mais acho legal é que tudo que estão conseguindo com isso é afastar as pessoas independentes e de boa vontade e estão sobrando só os puxa-saco. Tudo que estao fazendo é causar bode em todo mundo contta tudo q eles dizem representar. @RenanSantosMBL @priweinstein Vc não depositou ainda a grana da entrevista. @aguedescartoon @AvenaComVc @priweinstein Tem aquela tatica tb do cinismo satanico. @AvenaComVc @priweinstein Tem os que são pagos pra isso. @priweinstein O pessoal tem tesão em coronel. Claro, tem os que sao pagos pra instigar o resto. Mas se aproveitam desse tesao que brasileiro tem de ter seu próprio coronel. @priweinstein A jogadinha que fazem com todos é criar um motivo , inventar uma narrativa que desqualifique a critica. Tipo: Diguinho não criticou pq o governo fez algo criticavel. Criticou pq eu mandei, ou, eu não aponto as MAVs pq as identifiquei e sim pq não aceito piada ou o mbl mandou. Etc @priweinstein Eles falam o que querem. Já falaram que: 1) Sou pago pelo MBL 2) Eu que pago o MBL 3) Quero censurar todo mundo 4) Peguei pilha com piada 5) Mandei Diguinho criticar governo ... eles vão inventando o que é conveniente na hora. Sempre inventam algo para desqualificar a crítica @priweinstein https://t.co/XjTtoDhBZc @priweinstein Ontem estavam falando que eu era você, vc viu isso Negão do Realengo? @MavPsl @lucianoayan Para uma pessoa tão inteligente assim como vc está demonstrando muitas dúvidas. Kkkkkkkkk @JoaquinShow @MavPsl Foi comprado por qto? Seria justo dar uma parte pra gente. Eu lembro qdo eu e @MauMeirelles te dávamos RT e interagiámos. Temos parte nisso. Só não sabia que ia se vender. @lucianoayan @MavPsl Hoje cedo encontrei alguns deles falando o mesmo pro Mauricio de Souza por causa de um post. Kkkkkkkkk RT @lucianoayan: Olhem só como é EXATAMENTE a mesma tática da alt-right. \n\nEles vão para um nível de ataque típico de psicopatas e depois d… @TrooperBolso @aguedescartoon O curioso é que esses discursos inflamados e lambe-saco partem sempre de perfis com esse tipo de avatar, nome. Vc é pago pra isso ou está fazendo de graça na esperança de um dia ser? RT @aguedescartoon: Post de crítica = porrada\n\nPost de apoio = porrada\n\nNão posta = alá não tá postando, porrada\n\n Realidade: eu faço o que… @jhonyromano @YuriMarceloAlvs Já deu tempo de ler? Kkkkkkkkkkk @jhonyromano @YuriMarceloAlvs Levantaram a raiz aqui nesse link que vc ignorou: https://t.co/yvBmdsknTF RT @MauMeirelles: Parece que tivemos uma pequena ameacinha de um vaporwave.\n\nDepois se irritam com o Neo Mortadela. https://t.co/ZHabLQpNQr @jhonyromano @YuriMarceloAlvs Essa matéria é antiga e tendenciosa por ignorar q o PT tb fez isso - na real o PT inaugurou essa era. Mas mesmo assim a matéria explica perfeitamente como um esquema desse funciona. Basta ter grana e pagar https://t.co/5BJPYdgWQs @jhonyromano @YuriMarceloAlvs Onde eu disse que são bots?\nEu disse que são MAVs.\nMAVs são compostas por gente paga administrando muito perfil (por isso tanto fAke). São poucos militantes controlando muitos perfil. Ocasionalmente disparam tags automatizadas. Também contam com perfis ciborgues e de farms. @flecklinks Curioso isso. @jhonyromano @YuriMarceloAlvs Esse esquema aqui é fictício?\nhttps://t.co/5BJPYdgWQs @jhonyromano https://t.co/yvBmdsknTF refuta aqui? Quem escreveu isso? https://t.co/iRBg87uCCl @parausar20171 @diguinhocoruja @SBTTheNoite @murilocouto Olha só!\nUm fakezão mandando um “Repense”\nNo imperativo.\nMas se vc responder isso @diguinhocoruja vc que será o arrogante. \nRepense. @ana78259030 @diguinhocoruja Entao vamos esperar chegar lá pra só depois criticarmos. Melhor. @Meng0 @diguinhocoruja Tá paranóico hein RT @ProfBunazar: O ato do Crivella- mandar recolher os quadrinhos- é manifestamente ilegal. Mas é mais do que isso: é um ato hipócrita de u… RT @sarubo: O pessoal que ajudou a rifar a publicidade infantil da TV e tanto trabalhou para limitar o mercado agora está surpreso com o po… @SaitamaMasterBR @diguinhocoruja Calma garotão. Vocês chegam lá. \n\nNa militância virtual o que o PT demorou anos pra fazer vcs fizeram em poucos meses. Acho que vão superar rapidamente também essa marca de assassinatos reais. Tô vendo a sua ânsia em partir pra isso logo. RT @diguinhocoruja: Criticar é virar petista e esquerdista? Policiar o pensamento ou o direito de discordar de algumas atitudes do presiden… @JorgeAl04646117 @aguedescartoon @TayrlanDi @_FernandoRM @MauMeirelles @caipiratemplar4 @exmeralda333 Mudou já o discurso. É o lado bom em não usar foto ou nome. Não precisa ter coerencia. Pode ser leviano. Digo... eu tb sou leviano... mas arco com as consequências. Vc prefere ser covarde. Entendi. RT @diguinhocoruja: A questão não é torcer contra o presidente, amigo. A questão é você não poder criticar algo que não acha legal vindo do… @aguedescartoon @JorgeAl04646117 @TayrlanDi @_FernandoRM @MauMeirelles @caipiratemplar4 @exmeralda333 Já já ele pede pra emprega ou avó dele fazer um vídeo RT @aguedescartoon: @claudioedantas Só mudam os senhores RT @claudioedantas: Um país de escravos. @JorgeAl04646117 @TayrlanDi @_FernandoRM @MauMeirelles @caipiratemplar4 @exmeralda333 “Quem disse que eu sou cristão”. \n\nSabemos quem disse que eu NÃO SOU cristão: o JorgeAl04646117 sem foto até o momento no avatar. \n\nBom, se esse cara está dizendo isso quem sou eu pra discordar. @sa_marconis @hellfirebilly @diguinhocoruja Vdd. \nMas vc mudou de assunto.\nSempre fazem isso. @_FernandoRM @MauMeirelles @caipiratemplar4 @exmeralda333 “Da onde tirou isso”?\nRole pra cima e leia.\n“zuaram de verdade”.\nPodê crê. @TayrlanDi @_FernandoRM @MauMeirelles @caipiratemplar4 @exmeralda333 Na real eu rio de gente que usa a imagem de Jesus para fazer propaganda de político. Mas vc tinha entendido, embora precise fingir que não. @sa_marconis @hellfirebilly @diguinhocoruja Hmmm é pq eu achei que estavam condenando quem dá block. Mas vcs são seletivos com isso tb. Depende quem dá o block vcs relativam. Saquei. @quiteredness @_FernandoRM @caipiratemplar4 @MauMeirelles @exmeralda333 Qual o conflito entre dizer que vc pode ter liberdade e expressão e que quem se esconde atrás de fake para criar mentiras e falsas narrativas é covarde ou MAV?\n\nMAV precisa estar atrás de fake pra criarem calúnias e pra pouca gente controlar muito perfil fingindo grande adesão. @hellfirebilly @diguinhocoruja Respeite o presidente. https://t.co/Fi55WcYoQw @caipiratemplar4 @_FernandoRM @MauMeirelles @exmeralda333 É curioso que, quando a esquerda fazia isso, essa prática era amaldiçoada: https://t.co/PKoaApCWaL  - Aqui Olavo pede a prisão de quem faz isso.\n\nMas agora como é a “verdadeira direita” fazendo isso a prática se tornou autêntica. Antes era criminosa. Agora é bonito @i_isenta @_FernandoRM @caipiratemplar4 @MauMeirelles @exmeralda333 Mas eu sempre disse que não é pra me levar a sério mesmo. Kkkkkk @_FernandoRM @caipiratemplar4 @MauMeirelles @exmeralda333 Nossa, mas vc tá mostrando o rosto e ninguém está te atacando.\n\nNa real ser anônimo é uma necessidade de militância virtual. É a maneira de uma pessoa controlar muitos perfis pra simular grande adesão. Tb é a forma de poderem caluniar sem se responsabilizarem por isso. @_FernandoRM @MauMeirelles @caipiratemplar4 @exmeralda333 Vc viu mentirem a respeito da esposa e filho da cara - q nada tem a ver com isso - mas está mesmo preocupado é com um monte de perfil fake que usa do anonimato para levantar falso testemunho e mentir (8º mandamento). Tá certo. Como cristão conservador vc tem suas prioridades. @afragoni @ControleKlebado @C_Knife_2 @oarenito O nome disso é “ciborgue”. \n\nEssa matéria é verdadeira, porém tendenciosa, já que ignora que o PT fez isso e pior. Porém ela relata muito bem como funciona esses esquemas. Eles tem um esquema desse tipo, isso custa dinheiro . Da o de sai o dinheiro? Leiam: https://t.co/5BJPYdgWQs @thijks @paularosiska @cureAntonella @thijks divulgado RT @cureAntonella: Esta causa não é Fake!\nAntes de lançar a campanha em busca da cura #Zolgensma, deixamos as autoridades cientes e obtivem… @voude99 Valeu @MariTajra @Desesquerdizada Kkkkkkkkkkkkkkkk https://t.co/PIF6kXsLXV RT @SMonfradini: @Desesquerdizada Fato! É desanimador.\nTa sinistro, se chegou num ponto que só pode elogiar. Se criticar, somos esquerdista… RT @BlogDoPim: Resultado final: 61% (22.316 contas) acreditam que Augusto Aras não terá na PGR compromisso com o combate à corrupção, enqua… @voude99 Na real o app nao permitia que eu chamasse taxis com cartão. Mas parece estar resolvido. @douglaskado @DetectorMav @oarenito Os perfis que eu mostrei de exemplo - e existem centenas mais iguais - não estão discutindo política. Estão impulsionando tags de forma sistemática. @ControleKlebado @C_Knife_2 @oarenito Exatamente @crazygreen1914 @arielescorrea Hahahahhaah foi o q deu pra fazer RT @o_colecionador: O conservador é, antes de tudo e por princípio, um CÉTICO.\n\nO conservador JAMAIS se presta ao papel ridículo de ser GAD… @Renanoliveiirra @o_colecionador Mais respeito com nosso presidente, por favor. https://t.co/JzgY9EWsE7 RT @o_colecionador: O q eu mais gosto no TT hoje em dia é BLOQUEAR.\n\nCabôco encheu o saco UMA VEZ, é vala; dona Maria veio com nhêm-nhêm-nh… RT @arielescorrea: movie time: como se tornar o pior aluno da escola 🖖🏼 @DaniloGentili https://t.co/OhITUYzSJ9 RT @lucianoayan: Quer dizer que chegaram ao ponto de usar filho e esposa do @MauMeirelles ??\n\nMas os defensores dos vaporwaves não diziam q… RT @Desesquerdizada: Número de hashtags que apareceram nos assuntos mais comentados do Twitter:\n- Contra alguém que discordou minimamente d… Isso só confirma exatamente o que eu disse aqui ontem: https://t.co/gVC1NVMgo8 https://t.co/hogzMJ44LZ RT @MauMeirelles: Bom, como puderam perceber na ultima postagem: pegaram pilha.\n\nSe quer conhecer melhor a familia vaporwave, estao aqui.… @johnpauljovi @diguinhocoruja Nossa, que ameaça horrível! Vão pegar colocar a foto nele numa listinha negra, gente... nouussaaaa RT @diguinhocoruja: Muita. Aí eles tentam te adjetivar. Falam que você tem medo de perder o emprego (No meu caso). Dizem que tá bravo pq pe… RT @MauMeirelles: Aviso aos seguidores: existe uma turminha aqui chamada VaporWave. Eles geralmente tem 🥛 ou 🇺🇦 no nome.\n\nQuestionou o Bols… @MauMeirelles @Fernanda_CidL Corre que a véia tá puta Kkkkkkkk @MauMeirelles @Cyberamos Hahahahahaha caraio bicho! Os caras nao mostram a cara e caem na pilha RT @fravenriq: As pessoas ficam mais elegantes no frio...\n\nAs pessoas: https://t.co/vB5jVMKmLv @CarneMoidaTV Por que esqueceram onde guardaram a fita do Scooby Doo @oarenito Eu não disse que eram bots. Eu disse MAV - Militância em Ambiente Virtual. Pessoas controlando perfis anônimos que ficam o dia todo de maneira coordenada e “profissional” espalhando narrativas ou subindo tags se enquadram no que você disse e no conceito de MAV. Não há contradição RT @diguinhocoruja: Os robôs do Bolsolavismo não entendem que são uns bostas numa bolha. O que eles querem é silenciar o seu pensamento. Nã… RT @MichelePradoBa: @DaniloGentili E um ponto importante: nem sempre o ganho é em dinheiro diretamente. \n\nExistem vários tipos de capital e… @lmfsecret Principalmente quando querem mamata ou são pagos pra isso. @pedrodss19 @BlackBerry_ops @ricardoaccampos Porra... não sabia q vc era o dono do tal único lado. Poderoso vc hein. É tipo aqueles militantes donos de negros e de gays? Orra... parabéns. @Rafaelm0ta @diguinhocoruja @SF_Moro @roxmo Diguinho, pare de criticar a rola que o @Rafaelm0ta chupa, por favor RT @sarubo: O que incomoda nessas pataquadas de Joao Doria e Marcelo Crivella é a histeria.\n\nSão dois administradores que escondem suas def… @paularosiska Não teve ajuda nenhuma. Lamento não estar mais presente. @paularosiska Deus te conforte, minha amiga. @prokofiev2 Que interesse num perfil fake em defender um monte de fake disparando 10 tags por segundos.... fala a real... quanto vc está recebendo por isso? Não é um trabalho meio desprezível esse seu? Só responda. Não faça novas perguntas, pois isso revelaria que estou certo. @prokofiev2 @RNazareth37 Eu to de graça, mesmo, como sempre.\n\nFora esse perfil , qtos outros vc manipula e qtas neo-mortadas vc recebe por isso? @RNazareth37 Qto tá levando? Fala pra nóis @Starkillerdark Kkkkkkkk vc tá aqui patrulhando de graça ou faz parte do pessoal pago? Não tem MAV não pessoal. É tudo gente real e espontânea subindo essas tags. Eu que tô locasso... https://t.co/hoge2Wm2I8 @djcesargrass Qual golpe? RT @lucianoayan: Isto é viver na realidade paralela. \n\nAlguém diz que eles são \"impulsionados por robôs\" e eles dizem: \"não eram apenas rob… RT @Flavio_Quintela: Se Bolsonaro fosse...\n\nTécnico de futebol:\n“Foi uma vergonha o 7x1, mas eu continuo apoiando ele”\n\nEsposa:\n“Peguei ela… RT @Cardoso: UHAUHAHUAHUAHUUAH que LINDO ver esse chororô. Estão descobrindo que todo mundo só se filiava pra conseguir a carteirinha, que… @ricardoaccampos Mas essa eu não fiz pra agradar. Eu fiz pra desagradar mesmo. Kkkkkk RT @Cardoso: HUUAHUAHUAHUAAAAUHAHUAHUAHUAUHAUHAUH só o Omeleft mesmo pra elevar a esse nível de dramalhão. Tem cão farejador treinado pra i… RT @MauMeirelles: HAHAHAHAHAHHA O TOFFOLI DA DIREITA! \nOs mortadela nutella tao demais! https://t.co/6hjXgQeQR6 RT @MauMeirelles: Ahahaha sim!\nOs mortadela pelo menos iam na rua, mostravam a cara. Hahahahah\nOs mortadela nutella ficam em casa e poe a f… RT @madeleinelacsko: Mano, vaporwave é MUITO DODÓI\n\nVejam nos comments os bocós rasgando a calcinha de raiva - a própria calcinha... https:… De nada... hahahahaha https://t.co/m347z70Igi Essa linha de perfis entraram em ação pra tentar comover as senhorinhas desavisadas nesse momento de impopularidade do presidente.\n\nMas que baixaria usarem Jesus pra isso.\n\nE tem a foto do Dom Pedro II ali no porta retratado. Kkkkkkkk que coisa ridícula... Kkkkkkk https://t.co/ho0xGj8Tgm RT @diguinhocoruja: Lembra quando o @SF_Moro colocou uma esquerdista numa comissão? O presidente fez um escândalo. Não é uma hipocrisia ele… Chegamos nesse ponto. \nEsse é o novo herói dos caras... https://t.co/NlWamoPunO RT @diguinhocoruja: Um garotão que sempre viveu mamando em cargos públicos se mete num esquema de laranjal. Papai, presidente, não admite q… @GatinhasdaM Gatinhas da M.... hmmmm kkkkkk @matheustheo_ Como eu sempre disse Atualizada a lista de permissões da verdadeira direita:\n✅Zuar Marielle morta\n✅Colocar petista na PGR\n✅Votar como sindicalista esquerdista na reforma\n❌Zuar perfil fake que usa a imagem de Jesus para fazer propaganda baixa e apelativa do presidente em momento de impopularidade https://t.co/3OCNa7XiHc RT @cariocadelegado: #reflita O que é tolerância? Tá confuso... Só é tolerante aquele não me é intolerante... Se eu concordo com vc, é tole… @roxmo @DaviRyba https://t.co/2QTbgSuomv @lo_cafezito @Flavio_Quintela Esses perfis sem fotos e com nomes estranhos são sempre os primeiros que aparecem. Hmmmmm @djcesargrass Se eu postasse memes assim sobre o Silvio certamente seria um indício que me comeria. \n\nComo não é o caso, não. \n\nDe todo modo essa sua prontidão em se doer pelo que escrevi demonstra que ficou com o cu o piscando com a idéia. @NSaquarema Ví mais uma. Kkkkkkk https://t.co/H7zStdMQkK Se vc tatuar o Bolsonaro na sua rola come o cu desse cristão, fácil. https://t.co/z4hUaBSsgz RT @Cardoso: Este é um orelhão típico no Centro do Rio de Janeiro mas a prefeitura está mais preocupada com gibis...  NSFW, cuidado. https:… RT @arecobarudino: Na esteira da campanha Setembro Amarelo, que alerta sobre o suicídio, campanha Setembrochove alerta sobre o risco de arr… RT @arecobarudino: não é porque é meu amigo, mas o cara realmente é um baita de um cuzão https://t.co/wQObP9WJBS @MauMeirelles @new1nk1 @crisdbernart @HaterMeirelles @aguedescartoon @MBLivre Se ele que se esconde atrás de fake pega pilha imagina se fosse homem o suficiente pra mostrar o rosto. Kkkkkk @voude99 oi estou com problemas, me ajudem por favor? RT @MauMeirelles: @crisdbernart @HaterMeirelles @DaniloGentili @aguedescartoon @MBLivre Hahahaha o mais legal é que tem gnt o DIA TODO no t… @OANDRODE17 Kkkkkkkkkkk\nEnganei vcs https://t.co/bgJdDw7lWv @raphaeldamotta1 @AvenaComVc Boqueteiro presidencial escondido atrás de fake na área RT @Taattiaanne: @Hialley POR FAVOR, ajudem a acabar com o sofrimento dela!! Antonella tem uma doença degenerativa que agora tem CURA! Cham… Bem que falaram que iam ucranizar as coisas. Ucranizaram a lava-jato. Jogaram no lixo. RT @Flavio_Quintela: Saem:\n- ucranização\n- nova política \n- outsider\n- honestidade\n- fazer o certo\n\nEntram:\n- brasilianização \n- velha polí… RT @BlogDoPim: Ministro Jorge Oliveira diz que acordo de Bolsonaro e Toffoli \"é um acordo pelo qual a gente tem que superar questões import… RT @lucianoayan: Os caras estão realmente surtados comigo. \n\nAcho que hoje já é o dia de quebrar a ilusão de vários deles (e dar motivos pa… Mais uma crítica internacional do filme: https://t.co/5xwh66nueF RT @terror_weekend: #GhostKillersVsBloodyMary review. El mejor quiz de películas de terror en muchos años...\n\n@FrightFest @fabriciobittar @… RT @MichelePradoBa: O presidente não foi atacado por nem 1/100 do que a militância dele faz com quem critica e mesmo assim não aguentou o t… @peterjordan100 @aguedescartoon @peterjordan100 é isso aqui que está rolando Peter: https://t.co/gVC1NVMgo8 RT @peterjordan100: @aguedescartoon @DaniloGentili Ta sinistro, André. A gente chegou num ponto que só pode elogiar. Se criticar, somos esq… @JooPere61158187 @diguinhocoruja E vc quer ganhar uma mamata... ou mante-la...kkkkkkkkk Kkkkkkkkk RT @aguedescartoon: Vieram me xingar aqui nas mentions. Disseram que hoje estou mais chato que a Gleisi. \n\nNão entendi o motivo e fui dar u… Sim. Sempre fiz isso e sempre coleto muito material. Isso que estão falando pra vc hoje “vai transar” e “é falta de mulher” estavam falando pra mim no fds qdo questionei pq Vaporwaves não se revoltavam contra o fundão.  Aliás sabemos pq: os patrões deles queriam grana do fundão. https://t.co/SBgDIQRMIS RT @WAkenaton: @diguinhocoruja @DaniloGentili Da para fazer esse quadro com os Bolsolavistas https://t.co/f63E1PGAsF Kkkkkkkkkkkkkkkkkk https://t.co/HgXknbZTts @Cadumil1 @aguedescartoon @WashingtonDcBr Atualiza esse perfil aí. Segundo seus patrões o Moro é inimigo. Moda a foto. @labancariano @arecobarudino Sem dúvida. Aliás veja só você como Daniel foi burro. Poderia ter se ajoelhado para Nabucodonosor , e mentalizado em Deus na hora, mas preferiu ser jogado na fornalha. RT @aguedescartoon: A necessidade de usar o inimigo como ameaça \n\nTo cheio disso https://t.co/uMFFaEMnRV Uimm não aceita crítica? \nUimmm pegou pilha?\nTá em shok?\nKkkkkkkkkkkkkkkk https://t.co/kBKBoplssp RT @lucianoayan: (2/2)\n\nBasicamente, os golpistas, que enrolaram suas vítimas, as chamam para dizer: \"estão dizendo que todos nós recebemos… RT @lucianoayan: (1/2)\n\nOlhem o truque dos MAVs. \n\nOs principais \"hubs\" da rede saem dizendo, para uma massa de buchas de canhão (não pagas… @WashingtonDcBr Vc tem jeito que nao entendeu, está na narrativa deles. Toda MAV tem uns 10  ou 20% de gente coordenando e instigando. O resto é o rebanho espontaneo. Um dia vc acorda. RT @arecobarudino: Tensões dos nossos dias. O bolsolavismo. Como o bolsolavista lida com uma bomba dessas? O fucking presidente católico aj… 17/18) Quem seria tão chupador assim? . Só gente paga. Coordenada. Não caiam nessa. Eles não defendem valores. Defendem seus chefes.\n\nSão os neo-mortadelas.\n\nÉ disso que venho falando. 16/18) Hoje eles nao dispararam memes contra Aras. Não usaram bots pra subir tag contra o presidente. Eles estão “pedindo paciência”! Estão fazendo tutorial “ensinando direitista a criticar do jeito certo”. É profundamente patético. 16/18) Vejam o que fizeram com Moura Brasil qdo esse entrevistou o Bebiado e o que estão fazendo agora com o Diguinho por criticar Aras na PGR. Basta contradizer essa Bolsoala do PSL que a MAV entra em ação. Não está claro para quem esses filhos da puta trabalham? Da onde o $? 15/18) Compare como essa militância trata Mau Meirelles, que faz piadinhas zuando presidente. Criaram print fake envolvendo a esposa e o filho dele! Mas qdo Eduardo Bolso qdo o mesmo votou como sindicalista junto com a esquerda na reforma foram tchutchucas submissas.Chuparam ele! 14/18) No caso 1 ficaram por dias levantando tag, disparando memes, criando falsas acusações, xingando de rato. No caso 2 estão criando narrativas pedindo “paciência”! Há! Nem parecem os mesmos intolerantes contra o “esquerdismo” de Dellagnol ou contra o “Globalismo” do Van Haten 13/18) Compare as reações dos “vaporwave” em duas ocasiões: 1) contra Marcel Van Hatten , que criticou o governo e conseguiu poupar centenas de milhares dos cofres públicos por causa do que detectou, com 2) O presidente que indicou Aras na PGR e os deputados PSL que passam pano 12/18) Sim, vemos porção de bolsonaristas - esses sim espontâneos, pessoas comuns - indignados com a indicação do Aras. Mas esse é o eleitor do Bolsonaro normal - que votou numa pessoa, não num mito, e está disposto a cobrá-lo. Já as MAVs, tão virulentas por bem menos, tão como? 11/18) Fica cada vez mais claro que não defendem valor algum e sim seus patrões do esqueminha. Exemplo? Eles ficaram semanas fritando o Dellagnol, dizendo que ele era “esquerdista” e perigoso. Mas hoje estão relativizando um petista que é fã assumido do Chê. Mudam conforme mandam 10/18) Esses são os que usam perfis com avatar roxo, copo de leite e bandeirinha da ucrânia. Sobem hashtag com bots contra vc no menor sinal que vc pisou 1 mm fora da linha. Não assumem ser militância, se dizem “defensores de valores conservadores”. Hahha! PURA FARSA! 9/18) Como todas as outras linhas de MAV, os vaporwaves tem: 1) Perfis criados para serem centralizadores de narrativas (esses pagos) e 2) Os que engrossam o caldo espontâneamente por esperança de conseguir uma mamata no futuro ou apenas pela tara submissa de chupar político. 8/19) A BolsoMAV tem algumas \"linhas\" pra se misturar com gente comum de direita e conseguir alguma adesão espontânea. Tem aqueles perfis com olho de bandeira do brasil, mangá, etc etc. Poderia citar algumas que mapeei, mas hoje prefiro focar na linha auto-demominada 'vaporwave' 7/18) Se vc se submete e propaga as narrativas q essas MAVs criam vc ganha o selo de “direita verdadeira”. Se quesitona e rejeita vira traidor/inimigo e ganha um alvo em sua testa através de narrativas falsas que criam para te fritar na bolha deles. Igual quem fazia? O PT. 6/18) Como atacam mais a própria direita que a esquerda fica claro que fingem uma missão de “purificar a direita” enquanto o real objetivo é ainda mais tacanho que isso: tentam cortar cabeças de gente popular na direita para que seus patrões sejam os únicos donos desse latifúndio 5/18) O objetivo dessas MAVs de direita é o mesmo das MAVs de esquerda: criar espiral do silêncio, ou seja, tentar intimidar que não se diga o que não querem que seja dito. 4/18) Esse período de observação me fez identificar que existe gente em gabinetes de deputados de certa ala do PSL coordenando ataques e criando narrativas falsas para assassinar reputação de qualquer um que ousar criticar atos e pessoas ligados aos caciques bolsolavistas. 3/18) Venho observando o modus operandi dessas MAVs e tenho provocado algumas pessoas conforme minhas suspeitas. Vai ficando muito claro quem dá a linguiça pros cachorros latirem. Basta tocar em “assuntos/pessoas proibidas” que os bots e fakes saem da gaveta e agem. 2/18) Fui alvo de MAV petista por anos e hoje posso diferenciar o q é espontâneo do que é coordenado e até mesmo pago. Bots, perfis de farms, fakes... são coisas que custam dinheiro. Tratando-se de partido e política não tenha dúvidas, isso tudo é pago com o NOSSO dinheiro. 1/18) Quem me acompanha aqui viu que recentemente venho falando em MAV (Militância em Ambiente Virtual) de direita. Esse é um bom momento para você, que é apoiador do governo, entender o que venho alertando. Vc já deve ter sido manipulado por isso sem perceber. Estão CHUPANDO sem parar. Se o presidente mandou eles chupam.\n\nO que eu mais vejo é perfil vapormerda dizendo “não é bem assim, gente, vamos entender antes de criticar”. Estão fazendo tutorial de como criticar! Kkk\n\nO foda de trabalhar pra político é isso: uma hora a conta chega. https://t.co/LLD7ZOnBJI RT @aguedescartoon: Não, presidente @jairbolsonaro \n\nVocê não está apanhando da mídia\n\nVocê está apanhando dos seus eleitores https://t.co/… RT @persiobider: O melhor #tbt de 1 ano que fiz algo mto legal e tlvz a + grandiosa da minha vida. Programa todinho dedicado ao ano novo ju… RT @JoselitoMuller3: - O PR sabe o que faz. Se esse Aras for mesmo esquerdista, vamos criticar quando errar. https://t.co/CMAO0oxXUC KkkkkkkkkkkkkkkKkkkkkk https://t.co/EFnmFk0FGc FÃ DO CHÊ NA PGR INDICADO POR PRESIDENTE.\nNenhum bot subiu tag contra\nOs famosos fakes ñ foram lá ucranizar\nNenhum meme disparado em onda\n\nMais um forte registro que não são pessoas espontâneas defendendo valores. É MAV paga da BolsopanelaPSL. IGUAL O PT FAZIA! \n\nFica o registro. RT @Rconstantino: E então, qual você quer tomar? Aquela que continua \"mito\" ou a da realidade? https://t.co/52tHgVTCbQ RT @diguinhocoruja: Pessoal, Bolsonaro foi uma opção pra tirar o PT. Só. Esperemos 2022. Não foi dessa vez que quem confiou o voto a ele ve… RT @ProfBunazar: Morreu, martirizado, às portas da Catedral. Certamente, Deus o recebeu, também, às porta dos céu. Herói, herói, herói. htt… RT @diguinhocoruja: Logo os grupos Bolsolavistas acharão somente prós de Aras e vão vociferar contra quem for contra. Salvar o filhão enros… Já começaram! https://t.co/NbdATlrLO5 Crítica Inglesa falando bem do filme “Os Exterminadores do Além contra a Loira do Banheiro” https://t.co/XpdQXS66HI RT @diguinhocoruja: Qual é a diferença entre os fanáticos do Petismo e os fanáticos do Bolsonarismo?\nNenhuma! \nAmbos têm a rola presidencia… @gcoelho @arecobarudino Perdõe-nos por zuar as rolas q vc chupa RT @FelipeHamachi: \"Segui orientação do partido contra minha vontade\" é a desculpa mais esfarrapada da nova política. Não cola RT @arecobarudino: a velocidade que a galera vai de maconheiro ateu a católico olavista sem passar pela civilização é um negócio maravilhoso RT @diguinhocoruja: Que piada!!! A ONU não vê nada de anormal na Venezuela, por exemplo. Aí já encerra-se o assunto. Espaço democrático no… RT @ProfBunazar: Gente, esse rapaz foi nosso aluno. Eu rogo a todos vocês que retuítem. Por favor, nos ajudem a encontrar!! Deus os abençoe… Só socando esse monte de arrombado. https://t.co/KEtpEBILYY RT @tvabordo: #DennisoPimentinha e @DaniloGentili  conquistam liderança de audiência e voam alto no @SBTonline https://t.co/nJiUAWBzYp http… RT @feltrinoficial: #Bacurau - 💣\nJá vi muito filme na vida, mas poucas vezes uma história tão fraca, furada e maniqueísta. Chega a ser infa… RT @RogerioVilela: O politico se elege com meu voto e usando meu dinheiro. Eleito, ele vota para ele ter mais dinheiro para se eleger de no… @GrazielaRivera O Dilma do Kibe Loco um dia me chama de fascista no outro isentão. Mas é entendível. Ele nunca foi bom de nomenclaturas. Veja que ele próprio se chama de humorista. RT @Desesquerdizada: Atuação do PSL na Câmara:\n- Privilégios para policiais federais na Reforma da Previdência: \"ain foi um acordo\";\n- Coni… RT @ProfBunazar: Não é ilegal, mas é radicalmente imoral. Alem, é claro, de um bruto erro. https://t.co/Nt8aoOG4Hl Isso aí do PSL foi puro teatro do “good cop bad cop”. O PSL todo queria essa verba. Veja que a militância virtual deles, tão virulenta e eficaz em subir tags com bots, se manteve em silêncio. Não “ucranizou” ninguém nem meteu pilha pra influenciar deputados a votarem contra. https://t.co/12QpXf7DQp https://t.co/zwKYGn3Kex Vai afundar então. Seria mais seguro pra ela estar com um pé em cada balsa. https://t.co/kNhhJefl9W RT @SBTTheNoite: Ué, Dória? 🤣🤣 #thenoitecomdanilogentili https://t.co/bgWZWpBcek RT @MauMeirelles: O Webbullying e o Traumas estão na TV com outros apresentadores.\nA genialidade está em não me chamar: senão eu ia falir m… @Maraisa Eu sempre quis o seu sucesso RT @aguedescartoon: Vocês prestaram atenção no que ele falou pro @RogerioMorgado e a ótima invertida que tomou?\n\nGustavo: Morgado, você não… RT @RogerioVilela: O @RogerioMorgado no @programapanico hahahhaha RT @GeracaodeValor: Aprovaram ontem na Câmara:\n\n1. Reajustaram o fundo que é bancado com seu $$. Algum Partido não quer usar? Redistribui p… RT @fraseslib: \"A ânsia de salvar a humanidade é quase sempre um disfarce para a ânsia de governá-la.\" - H. L. Mencken RT @madeleinelacsko: Não sabe o que é vaporwave? https://t.co/TYKcDjGBDb RT @bethmoreno: Uaaaaau! Que novidade. Inventaram a roda! #webbullying https://t.co/CK0YmONbgA RT @MauMeirelles: PARABENS REDE GLOBO QUE IDEIA INOVADORA https://t.co/oh6klbsIwU @FelipeHamachi @EliakinSoares @marcelvanhattem Sim. Vi agora. Fizeram lá um bad cop e good cop, mas votaram a favor. RT @marcelvanhattem: Obrigado! Com certeza, quem leu tudo o que escrevi entendeu bem. E eu conheci também melhor muita gente nesses últimos… @medo_b Tá demais @ValPereira3 Kkkkkkkkkkkkkkkkkkkkkkkk https://t.co/LMgCQEs2MH @RogerioVilela E a linguiça que tá aí no teu cu não conta? RT @EduPrimitivo: Vídeo novo!\n\nDando lição de moral em quem suja o parque!\n\nhttps://t.co/rF0K6EauPK\n\nEsse merece 50 rts! https://t.co/RXSkD… RT @lf_ponde: Todo artista que quer fazer o mundo melhor com sua arte é mau artista ou mau-caráter. RT @calabresadani: ❣️parabéns e obrigada por me incluir nessa obra prima do medo e da comédia, e tb do ketchup e remédios @DaniloGentili @m… @EduPrimitivo @RogerioVilela Cara, na boa mesmo, eu já estou um tempo pra te dar unfollow e foi agora. Eles ficam fingindo que usam block como troféu pra ver se isso te intimida de dar block justamente pq precisam aparecer na sua TL pro seu público. Não caia nessa. Mete block. O que dá mais trabalho? Criar um perfil no twitter ou dar block? É muito mais rápido e fácil meter block. https://t.co/1iN2wkFxYB Aí eu discordo. Não silenciem. Dêem block mesmo. É estratégico. Esses perfis precisam da sua TL pra aparecer pras pessoas reais e furarem a bolha bunda que estão. O Block impede que eles apareçam na sua TL para o público. O block os mantém isolados na bolha. Mete block. https://t.co/OI9QFmD2Na RT @Rconstantino: Não entendo quem fica surpreso quando elogio Bolsonaro ou o governo. Não é bipolaridade, mas independência. O governo tem… @2014Suely @NunesMark Foi falar em rola q vc apareceu Kkkkkkk @NunesMark Kkkkkkkk\nOlha o SEU desespero pq eu ironizei as rolas que vc chupa kkkk @kallebdias_ São umas 50 pessoas se passando por mil. @ValPereira3 Aliás acabei de ver seu perfil - vc é MAV kkkkkkkkkkkkkkk ta sendo paga pra isso né? \n\nVcs vão mudando o discurso. Antes era “para q ta chato” depois “mav nao existe” agora é “nao fala mais de politica” Kkkkk\n\nA casa vai cair... @ValPereira3 Curioso. Quando eu critico PT , PSOL, PSDB vc elogia. Quando critico familia bolsonaro ou PSL vc vem com essa. Vamos falar a real? Política não é a SUA praia. A sua praia é ajoelhar bem submissa e lamber a rola e o saco de quem a militância bolsolavista ordena que vc chupe kkkkk @Augustogmsousa Vc fiscaliza e dá ordens no que os outros devem falar de graça ou tá sendo pago pra isso? Crítica construtiva nada. Esse cara aí é um isentão. Certamente é um comunista disfarçado ou está fazendo isso porque tem interesses obscuros. Onde já se viu criticar o governo em alguma coisa? https://t.co/qR7rmStqjT https://t.co/xCm46BcJj2 RT @Rconstantino: Taí, dessa \"mitada\" eu confesso que gostei!\nhttps://t.co/NfON7pK5pY RT @saloreyesfilm: PREMIACIÓN @macabrofich \nMEJOR PELÍCULA IBEROAMERICANA\nGHOST KILLERS VS. BLOODY MARY\n2018 Brasil\nMEJOR DIRECTOR \nRUDY RI… @Darcio56646916 Você usa esse perfil fake tão prontamente para defender o governo de graça ou faz parte da Militância paga pra isso? @rodrigofaresin Entendi. Mas além de ter criticado uma rola que vc chupa, me aponte o erro do meu post. @Hum129 Você usa esse perfil fake tão prontamente para defender o governo de graça ou faz parte da Militância paga pra isso? Não era pra boicotar coisas da França?\n\nBoicote pra você.\nMamata pra eles. https://t.co/WpPk4J3kP5 @arecobarudino Corn Flakes / Sucrilhos RT @Cardoso: AHAHAH meu teste funcionou. O Facebook bloqueou meu post pq  \"contem nudez\" mas a tal nudez é de uma \"sugestão de comunidade\"… RT @JovemPanNews: #3em1 | @veramagalhaes: Queda de avaliação de Bolsonaro coincide com radicalização https://t.co/EqNt3emsoS O nojento é que deputados como @DouglasGarcia e @carlosjordy foram eleitos prometendo acabar com essas mamatas e enxugar a máquina. Surfaram na “onda anti-mamata” e hoje tão como? Mamando e xingando o cidadão que cobra e questiona. https://t.co/5rDPwopoev @DouglasGarcia Kkkk uma rasa pesquisa mostra q essa “coitadinha” fica o tempo xingando. Qdo alguém responde na mesma moeda vcs fingem coitdadismo.\n\nO cinismo de vcs é satânico. Mas esperar o que de um vagabundo oportunista que ao invés de trabalhar puxou sacos até mamar na teta? Kkkk https://t.co/V7NcZjZn41 RT @lucianoayan: Querem deixar a extrema direita surtada?\n\nMencionem dois termos: \"seita\" e \"MAVs\". \n\nMas não dê detalhes. \n\nEles PIRAM.… RT @arecobarudino: Mesma pesquisa revela que se Copa de 2014 fosse hoje, brasileiros teriam torcido pela Alemanha https://t.co/nWdxQLEZ7e RT @Rconstantino: Comediante bom é iconoclasta e piada boa costuma ofender mesmo \nhttps://t.co/YgY202feO6 RT @darlanserra: @aguedescartoon @AnaPaulaVolei Cara tô achando uma bosta tudo isso, uma cambada de youtuber só querendo saber de mitar pra… RT @aguedescartoon: @AnaPaulaVolei A própria direita não está muito a fim de discutir a delação do Palocci. Está mais preocupada em caçar o… RT @_lcsaleixo: Será que vão ucranizar estes deputados ou a máxima só vale pra quem não segue a cartilha? https://t.co/4MSUSPzsa6 RT @CrissPaiva: Acho o que sempre achei: humorista tem direito de zoar o que quiser.\nAcho o que sempre achei: assiste quem quer.\nAcho o que… RT @ideias_gp: @DaniloGentili @LeoLins Oi, Danilo. Demos amplo destaque a essa censura absurda que o @LeoLins sofreu e continua sofrendo. M… RT @ProfBunazar: Sobre o Al Janiah, isso, sim, é coisa de fascista.Os criminosos que atacaram os funcionários e frequentadores do restauran… RT @BlogDoPim: Se direita mimar seus representantes na política e no debate público, como esquerda mimou os dela por 30 anos, criando teori… @Gabriel_Marca_ @madeleinelacsko Vc se incomodou com o post da @madeleinelacsko ? Então sabe o que fazer ;) RT @madeleinelacsko: Os machinhos feridos do bolsonarismo falam o dia inteiro as maiores barbaridades maaaaaaas, se alguém contar uma piada… RT @DaniloGentili: Um dos motivos da chave ter virado no Brasil foi a patrulha injusta e histérica esquerdista. As pessoas comuns, as que n… @DouglasGarcia Hmmm um bosta como eu. É assim que um deputado que vive de dinheiro público trata um cidadão? Hmmmmm. @peixeaquatico Se vc fizer pompoarismo anal talvez você consiga esse poder em breve RT @diguinhocoruja: Tinha um órgão regulador que impediu o show? Metade do público foi embora. É um direito. Meu tweet interior refere-se a… O @DouglasGarcia , já que vc admite que seus assessores ofendem - mas não mentem jamais - gostaria que explicasse que deputado do DEM é esse e quem seria o mantenedor dele. Parece q tá mentindo em código morse para criar narrativa pra sua MAV. Explique: quem mantém qual deputado? https://t.co/D5658ugNsC RT @FelipeHamachi: O mundo tem uma pauta mais importante que Amazônia e canudos plásticos, chamada comunismo. É essa merda que tinha que se… RT @albaexpider: @DaniloGentili @LeoLins Exato, é um dos maiores humoristas do Brasil e é o mais censurado. Não há nenhuma página falando s… RT @Cardoso: Falou a socialista pobretona com fortuna estimada em US$100 milhões.  https://t.co/MrPv4LgfGn RT @bobdaslabaredas: tentaram me ofender dizendo que pareço com um “servente de pedreiro”. olha, na vdd eu fui servente de pedreiro antes d… RT @persiobider: Oi @gugachacra você não vai falar nada sobre os ataques do hizbolah contra Israel? Eles estão em território  libanês, que… Parabéns @BlogDoPim ! \nÉ top mesmo! https://t.co/TwBNCR8ssr RT @DanielaLima_: Nos últimos dias, dois exemplos claríssimos de que os disseminadores de desinformação não conhecem fronteiras ideológicas… RT @mayabalde_: Alguém precisa lembrar essa leva de gente do PSL que eles são funcionários temporários. O mandato é sua carteira de trabalh… RT @igorzismo: Esta no ar o novo sistema streaming do mundo Ana JONES Flix. Conheça já clicando aqui &gt;&gt; https://t.co/HcJOGzIdZE https://t.c… É assim que funciona a cabeça desse pessoal. Tem que demitir todo mundo que não chupa quem eles orderam que vc chupe. Tem que demitir todo mundoooo até sobrar só  quem eles querem que sobre. É a nova era. Kkkkkkkk https://t.co/8sd7xxv5TO RT @bethmoreno: Teste de idade mental: Eu vejo um condomínio de casas do Chaves e você? https://t.co/WOGpwBPqMi Sempre que eu falo sobre MAVs do PSL aparece um monte de MAV atuando em ondas pra me convencer que estou errado Kkkkkkkk https://t.co/sihlE2Vph9 Me mandaram essa Thread. Ela explica bem como funcionaria o esquema de MAV da ala bolsolavista do PSL. \n\nNela tem print de gente de gabinete do PSL que estaria sendo paga com o seu dinheiro pra fazer assassinato de reputação na internet em horário de gabinete. Acompanhem: https://t.co/QFVgKG3KMQ Minha filha, vai vc, o PSL, o Bolivar, o presidente, o filho, o assessor tudo dar o cu na esquina. Tô me borrando de medo de vcs. Daqui da onde tô tudo q vejo é vc chupando partido e político, ou seja, o q vc é eu já entendi. Só ñ saquei ainda se é do tipo q cobra ou faz de graça https://t.co/p3c8zyjgpk O @LeoLins está sendo censurado por poder estatal em todo local que vai. A mídia não dá o mesmo destaque por quê? RT @diguinhocoruja: O @LeoLins teve 20 shows censurados. Acharam até facas na entrada de alguns shows. Teve teatro fechado. Aí a mídia pau… RT @bobdaslabaredas: tem gente que adora criticar o politicamente correto, mas quando zoa a direita, rasga o cu e diz “ta fraquinho, estuda… Perfeito https://t.co/5UEPykdMHv RT @igorzismo: Ce não compro, aí acabô! Seu doidinho meo!\nVocê que compro, até dia 19/10 no Teatro Novo! Será supimpa, seu gente boa https:… RT @OscarFilho: Tentar intimidar um humorista durante a realização do seu trabalho é uma tentativa de censura. Quem defende, justificando e… RT @MauMeirelles: @angelzzi @pro_lifegodgun @DanielW64943805 @crisdbernart @cleitongonc @gmenezesd21 @MBLivre @docmbl @DaniloGentili HAHAHA… Eu não ficaria surpreso se descobrissem que esse exagero de assessor é pra operar esquema de MAV e bot no gabinete deles. Isso explicaria pq o hobbit @carlosjordy chilicou ontem qdo eu apontei a hipocrisia da militância por não se opor ao fundo partidário. Devem depender disso. https://t.co/4fnL8sOHEZ RT @Desesquerdizada: Eis os gastos do deputado @DanielPMERJ (PSL-RJ) que nos chamou de \"vagabundos\" por criticarmos os gastos do @carlosjor… RT @ProfBunazar: Eu detesto a ideia de indulto. Mas acho uma coisa engraçada: quando o indulto é para um bando de corruptos, parece não hav… RT @LiberalismoBR: O americano e o russo (Ronald Reagan) https://t.co/MUMKWwzxcG RT @marcelvanhattem: Para resumir, é como você esperar um boleto de menos de 60 reais e te forçarem a pagar um de mais 120. Você não questi… RT @marcelvanhattem: Estou vendo muita gente brigar nas redes, mas ninguém fazendo a pergunta que realmente importa: por que o TSE estabele… RT @alefrota77: A Secom trabalhando p Bolsonaro na surdina e na censura .Eu estava com 2 programas na Band marcados mais 2 na Rede TV e 1 n… RT @aguedescartoon: A própria direita está quieta porque esta muito ocupada caçando isentões https://t.co/lEbPIClOXq @carlosjordy Mas isso é porque vc tem bot e mav estruturada, né seu vagabundo filho da puta ;) RT @paularosiska: Aprenda, Gustavo Mendes, como é feio apoiar perseguição a humoristas. Ainda bem que o Danilo é diferente de você. https:/… RT @JoselitoMuller3: É pra isso que eu pago meus impostos 🙂👍🏼 https://t.co/MrIyu00gd6 RT @Cardoso: Eu falo, eu falo, vocês não acreditam. O Omeleft é TÃO MERDA que confunde o BRILHANTE ator do Coringa  CESAR Romero com o DIRE… Eu nem sabia que merda era @carlosjordy. Pesquisei no google e encontrei essas imagens. \n\nDeveria ter mais respeito qdo fala com o público. Primeiro pq todo deputado deve respeito ao cidadão. Depois pq desse tamanho o respeito pode ser o melhor método pra conservar os dentes. https://t.co/KsXlGEnQqw Não chora não, anãozinho. Tá em shok? Ñ aguenta pilha? Kkkk! Tá nervosinha pq? Tá com abstinência? Kkkkk já já ele volta e vc chupa, fica calma.\n\nTaí o registro de mais um deputado vagabundo: mesmo com MAV e uma pá de fake para defende-lo, ele perde controle e xinga cidadão. https://t.co/JoScnHT8q7 RT @DaniloGentili: Uma rápida consulta no Google mostrará que as últimas vezes que Gustavo Mendes citou meu nome foi pra falar que eu “não… @WandersomMorais No caso sim, sao mavs pagas com dinheiro de partido, eles usam bots pra subir tags, fakes pra inflar posts e todos métodos desonestos que o PT fazia. Vc pode continuar fingindo que nao existe isso , mas toda verdade virá a tona como veio a do PT. Não se iluda não. RT @RogerioVilela: Com medo de, no domingo de manhã, o pessoal do Testemunhas de Vegano tocarem a campainha pra falar: Conhece a palavra do… @FelipeHamachi Cuidado que vão te ucranizar hein RT @lucianoayan: Esse tipo de baixaria dessa \"professora\" é o típico comportamento vulgar daqueles que não devem satisfações a não ser a qu… RT @mhavena: @DaniloGentili Obrigada Danilo, sou a mãe da @AvenaComVc  e fiquei abismada com essa \"sra\" q sempre tratei MT bem qd ela se di… Olha o nível dessa “professora”. Usa esse palavreado e trata as pessoas assim na internet. \n\nÉ igualzinho as Mav petista, bicho. Chega xingando todo mundo com baixaria. Qdo é respondida se faz de coitada. \n\nA TL da bruxa tá só mimimi agora. Tadinha, tão inocente e pura. Kkkkkkk. https://t.co/ubVJEqlg3a @lelemlima0106 @carlosjordy Quem tá brabo é o deputado em questao que acionou ate vc pra defende-lo. Eu to aqui só no kkkkkk ... tao em shok! @pro_lifegodgun @carlosjordy Fez pra puta da sua mae. Kkkkkkkk aquela porca kkkkk tá em shok! @RenatoP97008334 @carlosjordy Nossa o bot tá nervouso. @carlosjordy Já eu jamais demonstrei que te admirei pois eu sequer sei quem vc é.\n\nNão gostou dá unfollow e não enche o saco. Aqui eu escrevo o que eu quero. Não gostou enfia o dedo no cu e rasga. \n\nVai chupar suas rolas pra lá, vagabundo. @ludwigvonlucas @profpaulamarisa Te em shok? Nao chora nao. Kkkkkk @NerdShell_ @onlyonecart @profpaulamarisa Se eu pagar fazendinha, bots e fakes ai sim posso ofender? Kkkkk\n\nTá em shok? CURIOSO: existe certa militância virtual “do bem”, que diz estar contra os partidos e a favor do povo. Aí o deputado abaixo se posiciona CONTRA o aumento da grana que devemos pagar pros partidos. Essa militância faz o quê? Ao invés de ficar contra o aumento fica contra o deputado https://t.co/r05dP51USP @oibrunii @profpaulamarisa Dá unfollow entao e nao enche o saco. Tá em shok? Kkkkk @cintiagarciaL @profpaulamarisa Nossa tadinho de vcs. Nem parece q vcs vivem dando RT e curtindo postagem de fake xingando e ofendendo.\n\nVai se fude vai @profpaulamarisa Vc é apenas uma retardada depressiva e complexada. Nem pra dar aula serve. Seus alunos e escolas por onde passou te desprezam. Sua opinião não me importa. RT @Cardoso: Uma idéia não mas um chefe de quadrilha dá pra prender direitinho. https://t.co/cFVDV9fNNt RT @RogerioVilela: Se você vai ao McDonalds e pede um lanche do Bobs (ninguém faria isso, eu sei). Eles são obrigados a te fazer o lanche?… RT @RogerioVilela: Foi a um show de humor e não gostou da piada. Não ri que a gente já entende. Ou sai do show quietinho sem atrapalhar que… RT @Cardoso: Aì vem político cagando goma de incentivar empreendedorismo. PORRA NENHUMA. Sujeito não consegue abrir uma barraquinha de frut… RT @peterjordan100: Já percebi que tem muita gente que queima pneu em protesto, preocupado com o meio ambiente. Uma rápida consulta no Google mostrará que as últimas vezes que Gustavo Mendes citou meu nome foi pra falar que eu “não posso falar algumas coisas” e pra dizer que “Maria do Rosário estava certa em me censurar”.\n\nDe todo modo, onde chegaremos desse jeito? Eu tenho certeza que os bots e mavs da ala bolsonista do PSL são pagos com essa verba partidária, por isso estão bem caladinhos perante esse absurdo. Ninguém sobe tag, ninguém ucraniza, ninguém “lutando por um país melhor” etc. \n\nTudo filho da puta, sem dúvida. https://t.co/t9IumMkuzd @WORD_NEWSS Essa vc kibou hein seu viadão\nHahahahhahahaha https://t.co/fSIZmydl8t RT @RavenBanner: @Sandy75mars @FilmFanStevie @fabriciobittar @FrightFest @murilocouto @DaniloGentili @LeoLins @calabresadani A closer look… RT @RavenBanner: One week since @fabriciobittar’s #GHOSTKILLERSVSBLOODYMARY had a UK Premiere at @FrightFest.   Were you in the audience wa… RT @GTabacow: Galera, Rey Bianchi agora aqui nesse twitter, junto com a Gabriela. Minha outra conta foi extinta. Quem quiser me seguir ness… @fcastano_ @gguilherdes Ahhahahha ele falou “melhor deixar um cara que joga flechas cuidar disso do que aquela chata do caralho vir e encher o saco” RT @ForumChaves: Ontem no The Noite, @DaniloGentili questionou @ElAguila_Gomez sobre os episódios perdidos de Chaves e Chapolin. \n\nO filho… Gênia https://t.co/RawSgKZYv0 RT @lobaoeletrico: TREEEETA!!! Kim Kataguiri vs Eduardo Bolsonaro | Pânico - 30/08/19 https://t.co/vawJQeGMkW via @YouTube RT @fcastano_: A Capitã Marvel é o personagem mais inútil da história do cinema né... \"aiiii eu tava cuidando de outras coisas no universo,… Se a imprensa fosse implacável assim com os presidentes anteriores não teríamos chegado nessa merda. https://t.co/zSb8KFZH4O Dos dois jeitos sempre aparece alguém pra corrigir. Quando eu escrevo “um peso duas medidas” dizem que está errado pois Provérvios 20:10 fala em “dois pesos e duas medidas”. Quando escrevo “dois pesos e duas medidas” dizem que é sobre quem usa uma medida com pesos diferentes. https://t.co/JsN0CYEqvP Rodrigo Maia chora https://t.co/ioW6nD3Tto @brnmoreno Já a vi exaltando Maduro, Fidel, Chê, e bem... https://t.co/YbCsnJMERB RT @MauMeirelles: Pq se colocar look justo num homem, as mulheres só comentam sobre o lado esportivo https://t.co/CYUKeXFwNk Eu me lembro o dia que o Hubert do Casseta e Planeta foi banido por “discurso de ódio” por publicar uma charge da Dilma sem cabeça.\n\nDois pesos duas medidas. Sempre. https://t.co/0JlDhVbf8Z Danilo Gentili se irrita com piada e xin... https://t.co/1Ss9s1Xb6E via @jornalodia RT @ronaldjuniorcrf: Entrevista maneira do @DaniloGentili com o filho do grande Roberto Bolaños RT @RavenBanner: . @DaniloGentili has left his mark on the UK with @fabriciobittar’s #GHOSTSKILLERSVSBLOODYMARY. https://t.co/6CVnoYEvc7 RT @MauMeirelles: Humor politicamente correto. Venha ser hipocrita vc tambem, vem. Vejam em primeira mão como se alimenta o gordo do Danilo https://t.co/oryZmrfhxP RT @SBTTheNoite: Hoje o queridíssimo Roberto Gómez Fernández, filho do Roberto Bolaños estará no The Noite para uma entrevista incrível! Fo… Esse é o gorro original do #chaves ! Tive a honra de vestí-lo hoje. #elchavodel8 https://t.co/tKmiAX9QAI RT @kimpkat: https://t.co/qDy6Y5yvEB \n\n@BolsonaroSP seu pai votou a favor da ÍNTEGRA do projeto DUAS VEZES em 2014. Não vi você chamando-o… 00:15 e esse filho da puta me vem com essa https://t.co/8JMPe65nP0 Gênio e o tamanho da cabeça não nega https://t.co/MgkVl6bKSE @Maraisa Passa a dieta RT @arecobarudino: Gente, mais uma vez: a Amazônia não é o pulmão do mundo.  Na verdade a floresta amazônica é tipo os pêlos da Terra, as á… Isso aí e filho da putagem grande https://t.co/N3K5eOdV7i RT @SBTTheNoite: Se ficar animado nesta noite é o que você está precisando, então não perca o The Noite com o \"Clube das mulheres\" #thenoit… RT @Dona_Krika: Danilo sem fanfarrão, cadê o terceiro filme? Já quero hehehe @DaniloGentili https://t.co/EPkGdEqgzu @claysonfelizola Não estou me solidarizando porra nenhuma. Dane-se michele, mulher do macron, marcela ou etc. Mas quando eu zuava Dilma ou Letícia eu era machista. Quando eu zuava Marcela era de boa. Estou apontando isso: a hipocrisia e o fingimento. Vc fingiu que não entendeu mas entendeu. Que legenda você daria pra essa foto? https://t.co/8o3srPifP4 RT @kimpkat: To trabalhando pra isso, palmito https://t.co/TsIHIG6ve0 RT @FriedHardt: https://t.co/ctaQUSAqiV\n\nisso tem nome né pessoal\n\né ISENTÃO DE MERDA\n\nnão é assim q chama? RT @FriedHardt: \"sou centro-direita\"\n\nah o famoso CENTRÃO?? aquele q era o verdadeiro mal do brasil??\n\no famoso CENTRÃO porém dando um pass… RT @cariocadelegado: Com meu camarada @danilogentili #tamojunto em Lacrem https://t.co/MYr3cIw7mu O ideal seria extinguir essa bosta de fundo partidário. Tente partir pra isso @kimpkat https://t.co/vIKO6pf102 RT @FilmFanStevie: One of the many things I adore about @FrightFest #ArrowFrightFest is that they always show WTF films. There were two thi… Ihhhh caraio... segundo o que diz a sua própria MAV, Bolso é isentão então? https://t.co/QoZRxiIwd6 Bad boys, bad boys\nWhatcha gonna do, whatcha gonna do\nWhen they come for you\n\n@cariocadelegado https://t.co/PZRgQsEvzX RT @lucianoayan: Um governo apostou em : (1) apoiadores virtuais, (2) quase todos fake, (3) baseados em discurso paranoico/sectario.\n\nAí pe… RT @bressanjuliana: O monólogo de hoje do #TheNoite falando sobre a votação para o aumento do fundo eleitoral me fez lembrar aquela música… RT @sitetelevisivo: “Pedia para Deus me levar”, diz Beto Barbosa no The Noite sobre luta contra o câncer\n#Televisivo - https://t.co/M00DRTn… RT @RavenBanner: #GHOSTKILLERSVSBLOODYMARY wins Best Gore in @TotalFilm's @FrightFest 2019 Awards❗We'll have Bloody Mary call in from Brazi… RT @RavenBanner: @jamie_graham9 @totalfilm @FrightFest @fabriciobittar @DaniloGentili @murilocouto @LeoLins @calabresadani Who you gonna ca… Isso aí! Boa! https://t.co/Le3evkVKQr RT @sarubo: Lembram do assessor especial da presidência? Do top top que ele fez assistindo à cobertura do acidente da TAM? https://t.co/3g8… RT @sarubo: Onde estavam os sensíveis colegas quando o glorioso Mino Carta fez o que fez com o filho de @diogomainardi ?\n\nVocês podem se ap… RT @SBTTheNoite: Eu tô só a @jublackpower olhando o @DaniloGentili dançar... Ou melhor, tentar dançar https://t.co/JVXi2BdAdE Exterminadores do Além | Danilo Gentili destruiu o cinema nacional? https://t.co/VO5J9XHmNH via @estacaonerd RT @bacalhas: Pessoal, meus GHIPY’s já estão disponíveis no Insta. É só buscar por “Bacalhau” e se divertir. \nPra quem não sabe, meu Insta… Não gaste dinheiro nem tempo com isso.\n\nTe ajudei. https://t.co/U8sBbS6Zq3 Tenho 30 anos e fracassei: um biscoitinho por favor. https://t.co/iNyOlCYOtZ RT @arecobarudino: Mãe Recebendo Notícia de que o Filho Virou Vaporwave\nAlmeida Júnior, óleo sobre tela https://t.co/hmWW1MuhwF @MauMeirelles semana passada tava um monte de perfil fake coordenado falando da sua filha e esposa, forjando prints. Estavam todos rindo. Hoje esses mesmos perfis estão chorando dizendo que “com família não se brinca” - e ninguém fez nada. Tudo filho da puta. @Calango_Error “Dona Michele” mano, vai se fuder puxa saco A imprensa e uma renca de político eleito ficaram 2 anos falando e insinuando um monte de bosta sobre Marcela Temer. Se esbaldavam com isso. Eles que determinam qual primeira-dama pode ser ofendida ou não?\n\nSe o problema do atual governo fosse só esse tava bom. RT @_IsaaGouveia: E Ana Botafogo que foi no The noite e tocaram o hino do Botafogo pra ela entrar RT @Mooalvess: Ana Botafogo no The noite 💖💖💖💖\nQue incrível ver ela contar tudo sobre o ballet... SAUDADES. RT @ludofinal: Balé deve ser uma das coisas mais difíceis de sempre. Tenho o lado zoeiro, mas na real, admiro MUITO quem faz. Isso é genial… RT @su_higa: Bailarina Ana Botafogo, sempre muita https://t.co/Fkjtxh2KiU #TheNoite RT @aguedescartoon: Como funciona a mente de uma galera aí: você diz \"Bolsonaro deveria evitar fazer cocô em público, isso prejudica a imag… RT @diguinhocoruja: O futebol acabou. Os merdas dos justiceiros sociais invadiram o esporte também. Vasco pode perder ponto por torcida gri… RT @RafaelMarinho: Roteirista do The Noite compra pastel com caldo de cana e fica devendo 60 centavos por que acabou o VR.\n\nhttps://t.co/4N… RT @diguinhocoruja: Perguntei na boa. Você responde seco. Vai se danar! https://t.co/hp5GuhNq7q RT @ProfBunazar: Toda ditadura é odiosa. A ditadura do Getúlio foi muito mais violenta que a dos militares, mas parece que isso não importa… @GeracaodeValor Sim! A campanha do @cirogomes para eleger o Bolsonaro em 2022 já começou. https://t.co/FPiYa4g5Vo RT @arecobarudino: \"Getúlio Vargas é o responsável pela viabilização de políticas estruturais que deram origem ao Brasil moderno\" PORRA MAS… RT @arecobarudino: Os cara não cansa de dar toda a razão do mundo pra quem apertou 17. Me traz a urna que eu aperto agora! (mesmo sabendo d… RT @CorrupcaoMemes: Só pra lembrar https://t.co/g90GSpYES7 O @diguinhocoruja é um grosseiro filho da puta, mano https://t.co/KkDRMF5Yal Great! https://t.co/Gybv9xi5ze RT @RavenBanner: Fresh from the bathroom, here's what just went down ... #ArrowFrightFest⚡️ “#GHOSTKILLERSVSBLOODYMARY UK Premiere at @Frig… RT @Kassia_Teixeira: Depois minha mãe reclama que o celular dela tá travando, ela \"guarda\" TUDO que eu mando no WhatsApp 🤣❤️ https://t.co/X… RT @PauloMartins10: A ideia do @kimpkat e do @marcelvanhattem de usar os 3,7 bilhões do fundo eleitoral para bancar brigadas de incêndio na… RT @o_colecionador: Eu já achava e agora acho mais: \n\no Macron é MUITO filho da puta, merdinha desgraçado, um dos piores personagens do mun… Hoje tem https://t.co/M5AQVgZL3u RT @RavenBanner: Moments away from the UK Premiere of @fabriciobittar’s #GHOSTKILLERSVSBLOODYMARY at @FrightFest‼️ Get ready to see @murilo… RT @ProfBunazar: Eu já disse que acho imoral o Eduardo Bolsonaro ser embaixador. Não bastasse, pelo só fato de ser filho do presidente, não… RT @arecobarudino: sexta-feira e eu só queria tá feliz que nem o véio do INPE RT @peterjordan100: Anitta disse que vai acabar o oxigênio, mas se o oxigênio acabar, acaba o fogo e salvamos a Amazônia. Isso ela não diss… RT @RavenBanner: 😱 Get ready to scream BLOODY murder with @fabriciobittar’s #GHOSTKILLERSVSBLOODYMARY TOMORROW at @FrightFest. Stars @muril… RT @diguinhocoruja: Bolsonaro vai claramente fritando Moro. Quando ele conseguir dar a bica no cara que salvou o Brasil da merda ele vai di… Hahahahhahahahaha\nJá quero esse jogo, principalmente pq os caras tão puto. https://t.co/RlbW0hvVl9 RT @VladSantos_80: #TheNoite \n#TheNoiteComDaniloGentili \nJoão Ernesto Praxedes e Atílio Pereira juntos. \nBaita Crossover. 👏 RT @Curum1n: leandro hassum no #TheNoite isso é uma coisa q eu n imaginaria q aconteceria saiudajdja RT @Abraaomj: Hoje tem #LeiteShow 😍👶🍼\n#TheNoite\n@DaniloGentili RT @medo_b: É #TheNoite e estamos no Ar!\nHj com Leandro Hassum RT @sarubo: O PSDB, que não vence uma eleição desde a novela \"Torre de Babel\", está agarrado a Aécio Neves.\n\nO PT, a exemplo de boa parte d… https://t.co/6wxApINl5B RT @EduPrimitivo: Vídeo novo!\n\nMudando de opinião: FLAMENGO É O TIME DO CHEIRINHO? \n\nhttps://t.co/XGz0054Ln5\n\n40 RTS É SHOW DE BOLA! https:… RT @SBTTheNoite: Hoje tem @LeandroHassum no The Noite! O humorista fala sobre seu novo programa \"Tá pago\" 😉 Foto: Beatriz Nadler/SBT https:… Essa é a verdadeira “direita nertwork”. Uns fracassados de 30 e poucos anos cuja vida atual se resume em puxar saco dos Bolsos e fritar quem os “grupinhos oficiais” ordenam que se frite. Fazem isso na esperança de conseguirem uma boquinha na mamata. https://t.co/4b4LLChBbr RT @TelemaniacosTV: Além de ser líder de audiência na televisão, The Noite com @DaniloGentili vira sucesso no YouTube e supera Poliana   ht… RT @MarciaFachini8: @RavenBanner @FrightFest @fabriciobittar @phoenixartsclub @murilocouto @DaniloGentili @LeoLins The #GHOSTKILLERSVSBLOOD… RT @SadieChii: @PropertyBrother no @DaniloGentili  foi apenas uma das melhores entrevistas do ano. Danilo finalmente se juntou a familia pe… Ajudem: Surdo-cego-cadeirante programador quer realizar seu sonho https://t.co/l1KtMdoKaR RT @GeracaodeValor: PT e PSDB disseram no passado que se membros do partido fossem flagrados em corrupção seriam expulsos. \n\nNo PT, vários… RT @RavenBanner: Happy opening day, @FrightFest❗️Great to see @fabriciobittar’s #GHOSTKILLERSVSBLOODYMARY in the trailer at the @phoenixart… RT @Baliguti: @DaniloGentili só sei que todos the noite do Danilo são ótimos,mas esse foi um dos melhores https://t.co/gFnTdVcMBm RT @MariliaMaciel: @DaniloGentili Eu ja vi todas as entrevistas possíveis do @MrSilverScott e do @MrDrewScott, a do The Noite tava demais!!… RT @CanalBigtoon: Momento que @DaniloGentili diz que investir em imóvel é jogar dinheiro no lixo ... 🤐  #TheNoite https://t.co/59ZTDwoh8l RT @drikabarone: O Danilo Gentili é tão fraco que nem conseguiu quebrar a parede o Jonathan teve que ajudar ele. #TheNoite https://t.co/Mzl… RT @micheelletorres: O @DaniloGentili sempre levando os melhores convidados pro seu programa! Hoje são os maravilhosos Drew e Jonathan Scoo… RT @santanamartha: @PropertyBrother in Brazil! 💛\n\n@MrSilverScott and @MrDrewScott on #TheNoite https://t.co/OaO9pE9HJP RT @josydepaulo: Pobre adora colocar roupa em tudo 😂😂😂 #TheNoite RT @cryslaynekarla: Pirandoooo... Irmãos à obra no #thenoite 😱\n3 crushs juntos rs\n#thenoitecomdanilogentili \n😍😍😍😍😍🥰🥰🥰🥰🥰 https://t.co/UrA898… RT @TulioMagosso: Morto que o Danilo parece o irmão perdido deles kkkk #TheNoite https://t.co/MsnrxJhZue RT @GEOVANApessanh2: acordada até essa hora só p assistir irmãos a obra #TheNoite RT @crvglidi: Irmãos a obra no The Noite aaaaa 😻 RT @llullinha: @DaniloGentili maior vacilão, chamou os irmãos a obra no programa, agora minha esposa quer quebrar a porra da casa todo!! Se… RT @reuberdiirr: É @SBTTheNoite e eu estou assistindo! #TheNoite @DaniloGentili https://t.co/40DdPRTn3s Olha os @PropertyBrother entrando agora #thenoite https://t.co/iAaxdtfpfN @MaireadCarlin \\o/ Já já vamos fazer um conceito aberto no #TheNoite https://t.co/EjFfxlTTu2 RT @igorzismo: O melhor dessa foto é ter uma girafa na Amazônia ❤️ https://t.co/e9Zr6Ff1az @MaireadCarlin @TheNoiteOficial @Celtic_Woman You are great! RT @ppacheco1: \"O segredo é reformar com jeans bem justinho\", diz gêmeo de #IrmãosÀObra a @DaniloGentili https://t.co/01PcrXF8Yj via @uolte… RT @MaireadCarlin: Walking onto the biggest chat show in Brazil like heeeeyyyy  🇧🇷 @TheNoiteOficial @DaniloGentili @Celtic_Woman 💜💜 xx http… RT @sarubo: Engraçado, o sequestrador tinha condenado a morte os 37 passageiros. Por que o sniper não atirou a constituição nele? https://t… RT @izzynobre: Onibus vazio. Suspeito desarmado.\n\nvai REALMENTE fingir que é a mesma situacao? https://t.co/pwVG6VF3VK RT @hoc111: Os 3,7 bi do fundo eleitoral é\n\n37x mais que gasto com combate à incêndios\n\n12x mais que o gasto com saneamento básico rural\n\n2… Curioso. A militância virtual “direita verdadeira”, aquela ala do PSL que “luta” na net pelo “Brasil melhor” e os tais vaporwavers se igualam aos petistas/psolistas e ficam caladinhos perante isso. Arriscaria dizer q é pq a estrutura dessa militância é sustentada com essa grana. https://t.co/jI6rI97n7N Prestes a iniciar um conceito aberto https://t.co/ZVmHzt24RR RT @madeleinelacsko: Por que o ministro @AbrahamWeint está mandando abraço para o 55 chan, celeiro do atirador de Suzano? https://t.co/Dupk… RT @fraseslib: \"Sentir pena dos culpados é trair os inocentes.\" - Ayn Rand Encontrem o erro https://t.co/qgTmh48MP1 RT @madeleinelacsko: Brazyl, estamos fabricando adultos que se dizem cristãos e conservadores, MAAAAAAS passam o dia xingando mãe de famíli… RT @rodrigodasilva: Se a esquerda brazuca tivesse algum problema com policiais executando indivíduos na rua rechaçaria o apoio de seus part… RT @AfonsinhoReal: Lamentável a ação da polícia que matou um jovem em suposto sequestro a ônibus. Porque atirar pra matar ao invés de atira… RT @arecobarudino: PRODUÇÃO DE MATRIX 4 É CONFIRMADA\nMais velho, personagem de Keanu Reeves dessa vez escolherá pílula azul para lidar com… RT @RavenBanner: . @fabriciobittar’s #GHOSTKILLERSVSBLOODYMARY (Starring @murilocouto,@DaniloGentili,@LeoLins+@calabresadani) as well as @D… RT @fklescks: @DaniloGentili Você e o cara parabéns está aonde Marlon Wayans a um inventor do mini opala dois mitos cada um em uma ponta se… Fale o que quiser do meu talk-show mas ele é o único programa do mundo que recebe com exclusividade o lendário mini-opala da internet. https://t.co/hK3UnT27a1 RT @sarubo: O progressismo de hashtag derramou lágrimas por Alexandre Nardoni e por um sequestrador que colocou em risco a vida de vários p… https://t.co/IuwUmZrjb7 RT @DaniloGentili: Alexandre Frota expulso do PSL entra no PSDB https://t.co/yyIZXdaGaI Alexandre Frota expulso do PSL entra no PSDB https://t.co/yyIZXdaGaI RT @AquelaLara: Witzel acaba de virar herói no Rio de Janeiro por algo que não é mais do que obrigação: neutralizar um crime sem ferir refé… Bloquearam o Orkut no Tinder, bicho... https://t.co/dwDxBFYQKG https://t.co/MCADPs6j9K Trabalhando em um conceito aberto com @PropertyBrother https://t.co/AgzoxGNhc8 RT @MauMeirelles: NAZISTEENS é o nome mais legal que ja li sobre essa nova turma da internet. @MauMeirelles Nossa, mas eles não aguentam pilha? É só zuera, gente. Kkkkkkkkkkk\n\nSe os caras atrás de anonimo e manipulando um monte de fake pra se auto-afirmar e forjar popularidade não aguentam isso imagina se fizessem isso com a cara limpa. RT @GeracaodeValor: 1.7M de pessoas tomaram as ruas de Hong Kong hj. Eles ñ aceitam o aumento da intervenção do governo central chinês em s… RT @CrissPaiva: - e aí, com o que vc trabalha?\n- tráfico de órgãos.\n- credo, cara.. vc não tem coração?\n- é uma crítica ou uma encomenda? Eu acho muito bom esse ato porque agora saberemos de uma vez por todas se o Elevador Lacerda é realmente seguro. https://t.co/phYMkMz82M RT @Cardoso: Sujeito que desrespeita garçom pra mim é a forma mais inferior de vida, um verme desprezível sem nenhuma moral ou honra, dever… RT @SBTonline: 38 anos de alegria e informação para fazer a sua família mais feliz. Parabéns para mim 💚💙❤️💛🧡 #SBT #SBTOnline https://t.co/O… Parabéns @SBTonline https://t.co/HEkkywaRM7 RT @Cardoso: O \"homem\" foi o bandido mas o jornaleiro filho da puta força a manchete pra dar a entender que foi uma vítima inocente.  https… O fiscal de sotaques está na área. https://t.co/MswOiF3WQN RT @o_colecionador: A pior de todas as ideias de Jair.\n\nhttps://t.co/5uuNNV3POf \n\nNa minha coluna hoje, na @gazeta_brasil @Mi_Ribeiro0 Precisa, juro.\nFale com o seu nutricionista.\nHuaaaaaaa\n\nAí o leão não precisa tb. Só ele comer mato. E quem sabe os peixes podem comer apenas algas. @jovemdinamicool Se vc tiver dinheiro pra comprar as vitaminas de rico vegetariano pra substituir a carne, dá sim Matar animal para se alimentar é o que a própria natureza faz.\n\nPoderíamos usar a regra do “precisa”. Precisamos de remédios? Sim, então paciência. Precisamos de carne? Sim, então paciência. Precisamos apertar o saco do boi pra ele pular de dor e a gente rir? Não. Então pára, né? https://t.co/kRKtLjh2ZI Faço minha as palavras do @peterjordan100 https://t.co/AjfmdjhA1W RT @ProfBunazar: Em casos como esse, é melhor não nos precipitarmos né? Vamos deixar acontecer naturalmente. Vamos ver no que dá. https://t… RT @Cardoso: E a novidade de hoje é que para falar mal do Bolsonaro a esquerda agora afirma que videogames causam violência. https://t.co/6… RT @MauMeirelles: José de Abreu que devia ser coaching, pois não importa o que ele faça, nunca perde o emprego. HOJE TEM! \nJá já... https://t.co/tB2ERh9vCz Esse é o cara que defende o trabalhador. https://t.co/S8cK1dyKXj RT @NiiiJob: @DaniloGentili ou Álvaro Morte? Fica aqui o questionamento @bethmoreno https://t.co/4WC14xmkv7 @DrKamiza @GeracaodeValor Isso aí @DrKamiza ensine para o @GeracaodeValor o mundo dos negócios. Certamente você sabe mais que ele sobre o assunto. RT @GeracaodeValor: Um dos + típicos sintomas de falência de liderança, presentes em qq tipo de organização pública ou privada, acontece qd… @marcelofmdrs @Flavio_Quintela Como o@@Flavio_Quintela disse: essa é a mesquinharia do Brasileiro. RT @Flavio_Quintela: Na boa, essa mesquinhez de brasileiro é algo fora do comum. Tenho 3 amigos q são garçons aqui, e os três contam q as p… RT @Flavio_Quintela: Almocei num restaurante brasileiro ontem. É o mais famoso de Orlando, sempre cheio de turistas. Na hora de pagar, o su… BRASILEIROS EM LONDRES: Próximo sábado estarei aí vendo nosso filme estrear no maior iMax da Europa! Apareçam! https://t.co/uu4aEyWsXe @BrunoGomesDeLi9 @josyleao_ Acertooooooooo @LunaSiqueeiira Já sou minha filha RT @MarceloTavares: Com direito a uma bela foto da @BrasilGameShow o presidente @jairbolsonaro postou sobre essa grande notícia para os gam… Com tapa de anão, “The Noite” ganha da Globo e fica em 1˚ lugar https://t.co/uMvBTfKH85 @enock_paginadoe Olha sua cara de otário mor! Chupa Lula até hj! Hahahahah otário boqueteiro @rhuanpabhlo Boaaaa arregaça aí! RT @rhuanpabhlo: @DaniloGentili não é só o seu Talk show que fica em primeiro não em 😂😂 https://t.co/RKUnSvTKrW Comprei. Eu guardo esse jatinho no hangar chamado cu da sua mãe. https://t.co/D5pMCETLS6 Você acha que sua/seu namorada(o) te hackeia o email? Acha que está seguro quando manda nudes? Quer recuperar histórico deletado do whatsapp? Você precisa assistir o The Noite hoje \\o/ https://t.co/5T8i4yMnnU @_rabarreto Maluco, vai se fuder. Eu sei o que vc está fazendo e acho um lixo. Que babaca. Eu falo o que eu quero. Vai chupar sua rola pra lá. RT @ProfBunazar: Uma verdade: ninguém, absolutamente ninguém que votou no Bolsonaro no segundo turno se arrepende de não ter votado no Hadd… @Luis25894996 @VEJA @jairbolsonaro Vc nem sabe como ele vai entregar o País em 2022 e tá falando em votar nele de novo? Menos né? Aliás sugiro outra matéria para a @VEJA : “O curioso caso dos humoristas que antes repreendiam colegas por zuarem o governo anterior mas que hoje acha legal zuar o presidente”\n\nEu sigo fazendo o que eu sempre fiz e o que eu sempre disse que faria. Eu não mudei. Vcs que mudaram. 5/5) Terminando: eu não me arrependi de nada. Eu sigo fazendo o que eu SEMPRE disse que eu faria. Existe vasto registro na internet que comprova isso.\n\nSinceramente? Por mim vai o governo anterior, o governo atual e todos esses jornalistas tomarem no meio do rabo! Fodam-se. 4/5) Ainda em tempo, eu sugiro uma nova matéria para a @veja e outros jornais: “As celebridades e os jornalistas que votaram no PT e nunca se arrependeram, pelo contrário, continuam ate hoje defendendo toda essa desgraça que fudeu o País” 3/5) Me lembro perfeitamente o que grande parte da classe jornalística fazia quando eu e outros zuavam o governo anterior. Coleciono todas essas manchetes. 5 anos atrás criticar o governo era sinônimo de ser ignorado ou execrado na mídia. Eu sei pq eu estava lá e vivi isso tudo. 2/5) De todo modo, como humorista independente que sempre criticou/zuou os governos anteriores, eu posso afirmar uma coisa positiva no governo atual: Hoje quando humorista critica o governo em exercício ele não é mais demonizado/perseguido pelo jornalismo mainstream. Antes era. 1/5) A @VEJA poderia ter feito uma rasa pesquisa sobre meu posicionamento antes de fazer uma materinha tão boba dessas.\n\nSe isso fosse dar trabalho, bastava a jornalista Mariana Zylberkan entrar na minha TL e conferir o post que tenho fixado lá, com trecho de entrevista de 2018. https://t.co/8zITLq2qVT RT @marcoscofficial: @DaniloGentili HAHAHAHA estampando a capa hahahhaah\nO cara crítica todo governo que sim é preciso criticar e ta errado… @aguedescartoon Um Paulo Ricardo canta. Outro dançará em breve. RT @CanalBigtoon: Falaaaaa Galera saiu a nova luta do MORTAL YOUTUBER KOMBAT @rafinhabastos vs @DaniloGentili espero que gostem da RT aí pr… @MauMeirelles Duvido vc gravar numa banheira de hotel. RT @sarubo: A nova política faz reuniões secretas com Dias Toffoli, esse bastião anti establishment RT @FigaroAndre: Os posts do Partido Novo são escritos pelo cara que enriqueceu no comércio, mas esqueceu de estudar.\n\nOs do PSL são escrit… RT @medo_b: É #TheNoite e estamos no ar!!!\nHj com a Patrícia Abravanel!! @arecobarudino É preta ou verde? @arecobarudino Aí vc falou bosta @Bruno03988654 Tá chupando de graça ou faz parte dos que são pagos pra isso? Kkkkkkkkk Podem vir que toquei o berrante.\nKkkkkkkk https://t.co/UjJ7kDwuYI Ao que tudo indica a pessoa por trás da tal militância vaporwave é a Mônica Lewinsky. \n\nToda hora que você olha pra um deles os encontra de joelhos chupando a rola do presidente. https://t.co/aH7ux3oIz3 Me lembrou o Pinocchio. Ele não era um menino e também não era um boneco. \n\nEra apenas um mentiroso com a cara de pau. https://t.co/GI3CH1kjvW https://t.co/XCJwI7iTJD @nahnegreiros @SBTTheNoite @MarlonWayans Na proxima! Desculpa RT @tnoitetirinhas: Não buceta #MarlonNoTheNoite https://t.co/hmdCy4ZsE6 @Josylane17 Hmmmmmm.... https://t.co/Jc6QW0GRDV @Gabrieeeeeelzin Exatamente a mesma coisa. Me pegou agora. \n\nA pergunta que fica: você está chupando de graça ou faz parte da milícia paga? @WandersomMorais Hmmmmm.... mudou rapidinho o discurso. É assim que petista fazia também. Parabéns. @AlanTecmar @IanStefanobr Quando o presidente manda cagar dia sim e dia não e fala palavrão você vibra. Por que tanta seletividade assim ao se escandalizar com o linguajar? Seria você também um boqueteiro presidencial? @IanStefanobr Quanto está recebendo pra isso? Ou chupa de graça? Uns meses atrás o discurso: “Temos que ouvir o povo”, “O povo que manda não eu” e “Estamos aqui pra servir o povo”. Aí o povo acha merda o filho ser embaixador. Agora não é mais o povo, é o filho que decide. A real: político é tudo filho da puta. Só pensa no próprio rabo. https://t.co/ljYM9rejGM RT @Desesquerdizada: \"Estrategicamente\" deixaram o *texto inteiro* passar e depois pediram votação nominal só em um destaque para tirar um… RT @diogomainardi: #VetaBolsonaro https://t.co/BP2uqLdO3r RT @nostrendsbrasil: Marlon Wayans - Twitteiros comentam a entrevista do ator americano @MarlonWayans para o programa The Noite com @Danilo… RT @nahnegreiros: @SBTTheNoite Marlon Wayans está nos Assuntos Mais Comentados 👏🏼👏🏼\n\n#TheNoite #MarlonNoTheNoite . RT @BcwPF: Marlon Wayans no \"The Noite\" responsa demais hahaha RT @marcosyan85: the noite é o melhor talk show RT @yesmandela: #TheNoite @DaniloGentili  tradução tá muito boa. RT @daigsilva_: Lutando contra o meu sono só pra assistir o marlon wayans no danilo gentili hoje RT @reuberdiirr: Olha a @jublackpower versão branca #TheNoite @DaniloGentili https://t.co/3WbUwv8zWb RT @sinistrodibres: Agora no @DaniloGentili, @MarlonWayans! ❤️ RT @RyanFlipeX: Vendo um The Noite nosso de cada dia, mas eai @DaniloGentili, que tal levar o Foo Fighters para o programa? Lembrei do meu gato. https://t.co/13ZRzcMTUv https://t.co/bEPcXmgwpz RT @SBTTheNoite: Hoje tem @MarlonWayans no The Noite! Está imperdível!    #TheNoiteComDaniloGentili https://t.co/IwkLoGPWnk RT @estacaonerd: Alguém aí já viu o Exterminadores do Além do @DaniloGentili ?\n\nAssisti ontem e fiquei surpreso com o quão divertido o film… Esse é o @diguinhocoruja https://t.co/MpJ3WPO745 RT @SBTTheNoite: Hoje é dia dele que é Coach, repórter, rapper, dançarino e acha que é engraçado! Parabéns, @murilocouto!! #thenoitecomdani… @Fiaspo Orra bicho! @Velberan RT @marcelomadu: Um absurdo a expulsão do ator , produtos , diretor e cineasta Alexandre Frota do PSL. É um mais um assassinato cultural ,… Padre Fabio de Melo e linchamentos no Twitter https://t.co/wdDpc7bqrs RT @eorisso: esse filme da loira do banheiro \n(@DaniloGentili) é muito bom na moral 😂 RT @CibeleBatistaa: Assistindo agora o #thenoite @DaniloGentili . Excelente entrevista. Meus ouvidos agradecem 😍 https://t.co/BfvdnaGIcU RT @fcastano_: Criar uma pasta de dentes hipster e fazer um anúncio assim: \"só 1 a cada 10 dentistas recomenda\" RT @fcastano_: Aquela pessoa q toma coca cola todo dia no brasil, aí viaja pra disney e nas primeiras 2h já fica MEU DEUS PRECISO DE UM GUA… RT @CrissPaiva: 2019: https://t.co/ugHNXWm4jQ Se a Terra é Plana então Galactus só tava afim de uma pizza. RT @arecobarudino: \"Quando certa manhã Gregor Samsa acordou de sonhos intranquilos, encontrou-se em sua cama metamorfoseado num tuitero vap… RT @DaniloGentili: White Face é errado? https://t.co/gssAHXgt3N RT @DaniloGentili: Eu e @MarlonWayans : os branquelos https://t.co/AtUMt41Epl RT @MarlonWayans: Good times on @sbtthenoite with @danilogentili #brazil 🇧🇷 https://t.co/EhssSGJdrQ RT @lf_ponde: Nunca se prepararam tão mal os jovens para a vida real como nos últimos anos. Jovens assim não enfrentariam desafios, dos Nea… Teremos! https://t.co/7WSVvD9pMj Eu e @MarlonWayans : os branquelos https://t.co/AtUMt41Epl Confirmado “As Branquelas 2” https://t.co/Gw3znXfdTS White Face é errado? https://t.co/gssAHXgt3N RT @scoutthehorizon: Me, hourly, looking at my @FrightFest schedule clashes https://t.co/WnyQtm6iqf RT @RavenBanner: We are all @DaniloGentili.  #GHOSTKILLERSVSBLOODYMARY 👻 #ArrowFrightFest https://t.co/ScYKVX87s6 RT @xicograziano: A lição que vem da Argentina nada tem a ver com rótulo mas sim com RESULTADOS. Macri prometeu mas não entregou. O povo po… RT @GeracaodeValor: A situação da Argentina é complicada. O estrago na economia do país, resultado de décadas de populismo foi grande. Macr… Como as pessoas estão sem educação hoje em dia. Parei com o carro e perguntei se ele tinha fogo pra eu acender meu charuto e o cara começou a me xingar e cagar regra pra cima de mim. \n\nDeixa ele. Nunca mais abasteço meu carro nesse posto. RT @aguedescartoon: VÍDEO NOVO\n\nCrianças intrépidas decidem resgatar um velho amigo do mundo invertido. Qualquer semelhança com o mundo rea… RT @FelipeHamachi: Presta atenção no nível da monguisse. Daí veja na foto seguinte quem é a pessoa. Faz todo o sentido. https://t.co/NVI0GR… https://t.co/6auX5o257n @Flavio1bertore1 Kkkkkkkkkkkkkkkkkkkk https://t.co/FW38LqoKfo RT @DaniloGentili: Essa frase é minha. Foi tirada de uma resposta que dei nessa entrevista em 2011: https://t.co/Dj0d6qRqyH https://t.co/Bz… @izzynobre Ahhahahaha Esse é o outback australiano. Eu fiz isso porque o tanto de mosca que tem lá é insuportável. Mesmo. Se você não faz isso entram na sua boca, nariz, olho, toda hora. https://t.co/OrROnipw0O Tem um perfil de um cidadão espontâneo do povo que tem a cara do seu madrugada e bandeirinha da Ucrânia que desmascarou o esquema. Ele descobriu que um indivíduo nunca critica/zoa o presidente porque o mesmo fala/faz coisas criticáveis/zoáveis. Trata-se de uma conspiração. https://t.co/gpLrstjhvm @MoaMeloJr @jairbolsonaro Eu entrevisto ele antes dele ser presidente. Pelo seu raciocínio ele teria dívida comigo? \n\nVc não tem vergonha de ser um lambedor de rola de político eleito? O governante serve ao povo não o povo ao governante. Vc é um homem barbado, tenha dignidade. Você esqueceu de citar os palavrões e os insultos gratuitos. \n\nEles também me ajudaram a chegar onde estou. Abraços. https://t.co/ICK5zoDe0o Globo compra \"Os Dez Mandamentos\", da Record, e filme de Danilo Gentili https://t.co/DwhxCoh8Ui RT @apyus: A oposição a Jair Bolsonaro acha válido atacar o padre mais famoso do país para beneficiar com \"saidinha de dia dos pais\" um pai… Na real quem fala isso não quer que você dê a sua opinião. Quer que você dê a opinião dele próprio. https://t.co/cPxJbYOtD7 @Malone_Araujo @Alexand40260832 Espero que vc faça parte dos perfis MAV dos assessores do PSL. Pelo menos estaria ganhando dinheiro pra chupar essa rola. RT @GeracaodeValor: Líder do PCC xinga Moro de FDP por atrasar o lado do crime e diz que tinha “diálogo” com PT.\n\nIsso sim é vazamento resp… Hahahaha https://t.co/ojemg4aIgg @pauloUSA2016 Quando eu falava que a Dilma caga pela boca vc aplaudia né.\n\nVocê é pago pra isso ou chupa a rola de graça? @Alexand40260832 @Malone_Araujo Esse tipo de coisa que vcs falam em massa sempre que alguém crítica/zoa o presidente não funciona nem intimida. Sempre a mesma ladainha: “gostava mais de vc antes” / “Para que está chato” / “Vai perder audiência” / “Não é engraçado” / etc, etc... tá muito padrão. Mudem o disco. @Malone_Araujo Kkkkkkkkkkkkkk https://t.co/mxCYU3jclT @Uber_de_Petista Desculpe zuar a rola que você chupa. O problema desse método é que a merda começa a vazar pela boca. https://t.co/AOoY9mtjJv RT @tnoitetirinhas: https://t.co/basynagxlN RT @RavenBanner: Take a look at the short films @bonnequin is bringing to #ArrowFrightFest.  Before you catch the UK Premiere of #GHOSTKILL… RT @fcastano_: Absurdo esse papo do grampo ligando pt ao pcc. Claramente é uma jogada pra queimar a imagem do pcc RT @MauMeirelles: O Brasil tá tão doido que na narrativa do pai que joga uma filha pela janela, o errado é o padre. RT @thimoteocampos: 1h45 e eu vendo o pgm do @DaniloGentili dando risada demais com a @PaulaFernandes7 dançando kkkkkkk RT @BastidoresDaTV: Vocês lembram do Pintinho Amarelinho? No Teleton 2015 o @guguliberato veio ao palco junto com o @ratinhodosbt e @Danilo… Esse gato era da hora demais https://t.co/iksm7ow7Kj https://t.co/RHbUNYtWrP 20 anos de touca https://t.co/shavJA9Vrw Kkkkkkkkkkkkkkkkkkkk https://t.co/HMBpAIquBs RT @Cardoso: Eu lembro quando vocês tentaram sabotar abertamente a Internet nos primórdios, se dependesse dos jornais a gente não teria uma… RT @diogomainardi: Quem é que não sonha com o impeachment de Gilmar Mendes? Os verdevaldianos querem criminalizar os sonhos dos procuradore… RT @LisaMarieBoothe: You are allowed to support Trump. You are allowed to be a Democrat or support any political party you want. That is wh… RT @comuniquese: O @DaniloGentili na liderança...\n==&gt;&gt; https://t.co/1aVnNIw7o8\n\nhttps://t.co/1aVnNIw7o8 RT @RavenBanner: Our favourite moment from #GHOSTKILLERSVSBLOODYMARY synced up to the music in the @FrightFest trailer.\nLook out for more @… RT @LuuisCouto: O ministro @SF_Moro não decretou como lei o que pensa como gatilho a agressão as mulheres, foi apenas a opinião dele. Hoje… RT @arecobarudino: filho da mãe...\nquando ele pega na veia é complicado https://t.co/5zz1tMzcr7 @nahnegreiros :) @RafaelMarinho https://t.co/wnxKvcT974 RT @IncredibleCulk: This is what an updated Home Alone would actually look like. https://t.co/sGj86933LA RT @P_droMenezes: Expectativa: “kkkk não respondeu meu tuíte porque não tem argumento”\n\nRealidade: as pessoas tem vida fora do Twitter e es… RT @alex_borges: “Sua origem pode ter origem”. Que dureza. https://t.co/9ynIGrxmsb RT @GuyFranco: No futuro, arqueólogos encontrarão as ruínas do Twitter e se perguntarão por que o povo passava tanto tempo defendendo bandi… RT @OscarFilho: Nova Zelândia é um país com mais de 100 anos! Já não está na hora de chamarmos apenas de Zelândia? RT @CibeleBatistaa: @DaniloGentili Lembro de ter lido isso, inclusive tenho essa frase com foto aqui salvo na minha galeria   :) https://t.… Se puder aproveitar e parar de me seguir também, vai ser legal. https://t.co/1BZd8nlUr0 Essa frase é minha. Foi tirada de uma resposta que dei nessa entrevista em 2011: https://t.co/Dj0d6qRqyH https://t.co/BzgMwZbvuO Foi só uma pergunta, gente. https://t.co/UACKttUhBm RT @BlogDoPim: Traduzindo: Glenn me culpa histericamente pelo que não fiz: acusá-lo de crime. Quem ouve #OsPingosNosIs e entende português… RT @Cardoso: Meu Deus não sejam essa pessoa.  https://t.co/KRCU85Ucru RT @Cardoso: Filha se você é gorda você não é convencionalmente atraente, se você não quer compensar isso sendo engraçada, gente boa, se vo… RT @anapls93: Só lembrei do @DaniloGentili kkkkk https://t.co/5xP8uUUsjz RT @_seilaquem: Tô morrendo de rir com esse filme do @DaniloGentili kkkkkkkkkkkkk caralho, os cara é bom demais RT @sarubo: A geração que não consegue interpretar piada, sarcasmo, ironia.\n\nEm tempo: levantou discussão alguma. Algum retardado mental fi… Esclarecendo alguns pontos https://t.co/UI6dlje8Zq https://t.co/6Cra1S4rr9 RT @WAkenaton: @DaniloGentili Até onde a pessoa não vai para provar a verdade! Teve que abrir o ponto se não eles não acreditam! Tira os ca… Bom, esclarecido os fatos sobre a garrafada. https://t.co/Oj5Y9KzXyy RT @BernardoHrique: É para isso que serve a EBC no final das contas. https://t.co/qxr4EwJ2Yq RT @ossuario: Brochoniev #2 https://t.co/XxyGJTDTAO RT @casseta: Fala, galera. Daqui a pouco nós vamos liberar uma novidade  sobre o show de 30 anxs do Casseta &amp; Planeta. A nossa turnê mundia… @FabricioDepes @benebarbosa_mvb @PauloMartins10 https://t.co/a8K4TNoCOk @ricoSPBRZ @benebarbosa_mvb @PauloMartins10 https://t.co/a8K4TNoCOk @benebarbosa_mvb @PauloMartins10 Mas eu só assistia por causa dos seus cabelos volumosos... e agora? @LucianoFagunde @arecobarudino Zzzzzzzzzzzz @celsoportiolli Queria pegar é o dinheiro dele RT @kandice_martins: To eu montando aula e a tv ligada no @SBT no programa do @DaniloGentili qnd escuto o Murilo falando em coach. Cara, to… RT @WAkenaton: @DaniloGentili Mataro o Diguinho de verdade dessa vez! https://t.co/zJfWBcGMOe RT @Murimuribro: Como assim @DaniloGentili contracenou la casa de papel??????? https://t.co/IQnQWKt4IM RT @Mooalvess: Como o @DaniloGentili consegue trabalhar com o esse potão de maionese vulgo Diguinho???  😂😂😂😂\n#TheNoite RT @reuberdiirr: Concurso de barrigas no #EmRevista #TheNoite @DaniloGentili @diguinhocoruja @evesobraltv @OficialRBTV https://t.co/cQyArGQ… RT @aovivoNews: Após “garrafada”, Danilo Gentili e Diguinho recebem Evê Sobral no The Noite https://t.co/Euiz57oj9Z RT @reuberdiirr: E no programa de hoje, Evê Sobral! Já está ligadinho, @MarcelloRego?? #TheNoite https://t.co/ICVcccMtD3 RT @I_am_Michelly_: O programa do meu arrombado começou! 😁 @DaniloGentili \n#TheNoite \n#TheNoiteComDaniloGentili RT @thaissacdepaula: 🙏PRECISO DA SUA AJUDA, AMIGO🙏\n👉MINHA MÃE ESTÁ COM CÂNCER👈\n\nBradesco AG:2467 - CC:41510-3\nCaixa AG:3205 - OP:013 - C:30… @arecobarudino Perfeito RT @arecobarudino: muito macho pagando de galo atacando uma mulher num ambiente que pede educação\ndificilmente teria a mesma desenvoltura n… Hoje no The Noite vamos esclarecer definitivamente tudo que aconteceu e colocar um ponto final nisso https://t.co/FbjQGLcifP @thayoliveira @jordannadias_ @MauMeirelles Agora todo mundo tá pronto RT @victorlleals: mano, esse exterminadores do além é mto bom pqp kkkkkkkkkkkkkkkk @DaniloGentili @jordannadias_ @thayoliveira @MauMeirelles Só vem @thayoliveira @MauMeirelles Pode vir! Kkkkkkkkkkkkkkk https://t.co/aoEHJTMrhC RT @feitocabrasil: Domingo, friozinho e exterminadores do além. @DaniloGentili @LeoLins @murilocouto Da hora! Rindo demais 😂😂 https://t.co/… Que merda está virando isso aqui. https://t.co/Hwr6F8gskp RT @diguinhocoruja: Que amadora! No mesmo período ganhei 112 quilos. E hoje me orgulho de uma trinca maravilhosa: Diabetes, Fígado avariado… RT @arecobarudino: não sobra defesa possível praquele negócio medonho que criaram https://t.co/kPOGjtTpgQ @poli_anamartins Sentiu?\nKkkkkkkkkkkkkk https://t.co/nNHs6SyaU4 RT @CanalBigtoon: Anuncio oficialmente a próxima luta do MORTAL YOUTUBER KOMBAT, está quase pronta ,dependendo das dublagens vou fazer o po… RT @AfonsinhoReal: Algumas pessoas ignorantes comparam os campos de concentração nazistas com os gulags. Pura falácia. Gulags matavam e tor… @Gabth_rbr Aliás, curioso você querer fazer parecer que o que eu disse não faz sentido. Curioso. https://t.co/p67xxzc5pe @Gabth_rbr Pesquisa que você encontrará bem mais que isso, e postando de forma seguida e em ondas. Mas não são MAVs e não estão falando nada disso. Você é que sabe o que diz. https://t.co/IJuiv5VexN @MATHEVS3 Eu posto isso pra provar que vcs não influenciam nada. São poucas pessoas controlando muitos perfis. Tem verba do PSL nisso. Um dos discursos que vcs usam pra intimidar é dizer “Quem falar o que não queremos vai perder acessos/audiência/etc.” Pff... Continuem aí na esgotosfera. Eu quero ver Deathmatch no R6 #DMR6 - @leo_bianchi RT @murilocouto: Vou matar todos vocês https://t.co/OJlPkUf7Sy RT @RavenBanner: 📞 Phone a friend❗️It’s just 3️⃣weeks to go until the UK Premiere of @fabriciobittar’s #GHOSTKILLERSVSBLOODYMARY at @Fright… RT @sergiosaleitao: Lição básica de economia: alíquota menor = preço final menor = mais consumo = mais arrecadação (e mais renda, mais empr… @ajulysantos Não é um perfil fake de fazenda agindo de maneira coordenada não. É a uma avó tuiteira ligadona nas tags que precisam subir pros trends. RT @sounanyzinha: Só fiquei esperando ele puxar a faca pro @DaniloGentili 😅 \n\n#TheNoite https://t.co/cBM6XKYuJ5 RT @arecobarudino: ah pronto\npindura ela num bonsai agora e faz um mini-Éden\na natureza é cada palhaçada, bicho... https://t.co/jyrGleyLTy D O M I N G O https://t.co/AH3gMLzwJj RT @Cardoso: ahahahhaaahaha sensacional! https://t.co/CzQjs3xW00 RT @CanalBigtoon: Me perdoe @diguinhocoruja fazer isso com seu braço direito,e quanto a vc @DaniloGentili é um canalha hahahahaha... tive q… https://t.co/NiQqHuqmK0 @kjjjkmkkk @sandrahostins Kkkkkkkkkkkkk https://t.co/ZcWpF9clpC @AfonsoGilmarK Kkkkkkkkk @Jonas34360918 Kkkkkkkkkkkkkkkkk @sandrahostins Kkkkkkkkkkkk @lucas_luchetti Kkkkkkkkkkkkkkkkk\n\nChora mais @Cardoso O SBT fez um monte de perfil fake pra ficar assistindo. Hahahha RT @blogteleguiado: “The Noite” bate recorde de audiência e vence Globo pela segunda vez na semana https://t.co/62NLbwbhb4 https://t.co/QaU… Cadê as MAV falando que a audiência vai cair?\nKkkkkkkkkkkkkkkkkkk https://t.co/0am4pT3h9p Boa tarde, @murilocouto https://t.co/wKdvPrq8fo https://t.co/iw6bIrrmEZ RT @weberempeended1: Castigo Mestre Mandou: Cena Game Of Thrones | The Noite (31/07/19) https://t.co/54vFAcVEop https://t.co/jFHrhQrXML RT @omfg666: Uma coisa que eu amo no Danilo, é que ele entrevista as pessoas simples com a mesma importância que ele da pras celebridades e… RT @Pupa_Dias: Real Time - São Paulo à 01h05: \n\nSBT 8.1\nGlobo 6.8\nRecord 2.3\nBand 0.7\nRedeTV 0.5\nCultura 0.3\nGazeta 0.1\n     \n#TheNoite \n@D… RT @DandaraBrandao_: O Tiringa foi pra cima do @DaniloGentili HAHAHHAHAH\n#TheNoite RT @evycsn: Na moral, eu já tô passando mal de tanto rir do Tiringa. Nem cavalo aguenta, cabra furioso \n#TheNoite RT @SargentoFAHUR: Teve sorte que não vou estar em Maringá.\n@LeoLins https://t.co/J59XlXdznt RT @evycsn: Ai, gente. Eu tô até agora acordada só pra ver Charles e Tiringa no programa do Danilo Gentili 🤦\n#TheNoite RT @JuanMingau: Quem puder dar um rt, eu tenho uma doença rara chamada siringomielia e só é tratada com cirurgia quem puder me ajuda com a… Hoje tem Tiringa no The Noite https://t.co/3Ua3FamYKQ RT @apyus: Que eu sei usar o Google Images. E as fotos deste perfil são roubadas de uma \"musa fitness\" chamada Nicole Borda, que tem um mil… Prepare-se para ser xingada! https://t.co/s353mC0aqh RT @avioesemusicas: Aí @wingsescola, @ejaviacao - ajudem o bailarino a terminar a formação de piloto que eu vou prestigiar também. Quem sab… #PoliticamenteIncorreto a série #TBT https://t.co/Fatz4PBYiu RT @tvabordo: @DaniloGentili  bate um papo com Charlles e Tiringa, do canal “Brasil Selvagem” #TheNoite https://t.co/XfDmU9m931 https://t.c… Hoje tem Tiringa no The Noite https://t.co/4p2WQhZyCQ RT @Abraaomj: O #MestreMandou é espetacular👏🏿\n#TheNoite\n@DaniloGentili RT @PaulaAn07623626: Que noite maravilhosa👌 \n@SBTTheNoite @DaniloGentili #TheNoite @SBTonline https://t.co/aUQrW52t6G RT @medo_b: O @murilocouto tipo WWE saiu dando tapa em TODO MUNDO HUAHUAUHAUHAUHAUHAUHAUHAUHAUHAUHAUHAUHAHUAUHAUHA\n\nAcho q ele tem q pagar… RT @marcos_foto: Conheça o Murilo Coaching - Ep. 1 | The Noite (30/07/19) https://t.co/pRsakMNQAg RT @MatheusfRomero: O argumento de Jordan Peterson contra a restrição da liberdade de expressão é um dos melhores que já vi. Sua genialidad… RT @DeBundaPraLua: O mestre mandou 🙌 #TheNoite RT @medo_b: COMEÇOU O MESTRE MANDOU COM ANÕES \n#TheNoite RT @amandaleticcia: Meus amigos bebendo e eu assistindo @DaniloGentili https://t.co/sTMoELrsnh RT @Abraaomj: Belo clipe romântico do casal @DaniloGentili &amp; @diguinhocoruja\n#TheNoite RT @thayoliveira: @DaniloGentili no meio do programa, eu tô com ódiooooo. https://t.co/dx1HjKHMye RT @OficialRBTV: FINALMENTE A CENA MAIS ESPERADA DA TV E DAS REDES SOCIAIS SERÁ REVELADA!\n\nESPECIAL EM REVISTA com DANILO GENTILI E DIGUINH… Pergunta babaca não se responde. https://t.co/Jxzc00XJIJ Esse é um projeto que vale a pena ajudar. Se informe e contribua: https://t.co/A0MIEAIK2E @sarubo Nouffa que nervousa RT @FagnerK: @DaniloGentili Assistindo agora, Danilo. https://t.co/H1AOhYNCXy Começou na @redebrasil https://t.co/2IdVAf9DqC Todos os festivais que estamos e passamos. https://t.co/FlcsjurcaD RT @Marlon_Chorao: Meu, @DaniloGentili ganhar na audiência da Globo semanas atrás com Gleyfy Brauli foi o ápice do deboche. Ahhahaahahahjaa “The Noite” entrevista Peninha e volta a vencer Globo no ibope https://t.co/cR2SgvvzKY RT @nelsonrubenstv: #OkOk  Vlw, @DaniloGentili Novo quadro do @SBTTheNoite  é ótimo! \nE o LEO LINS é nota 10! Dez! Em criação e imitando! P… Hoje tem #MiniMestreMandou no #TheNoiteComDaniloGentili https://t.co/IsYmkl5NrR Hoje na @redebrasil com @evesobraltv https://t.co/QJTTaCmt1Z https://t.co/q550LpUyhc @bobdaslabaredas @JoselitoMuller3 @ajulysantos Na real fazem isso para desqualificar suas críticas. Você não estaria criticando algo pq aquilo é criticável e sim pq teria interesses pessoais naquilo. É coisa de chupador de rola. Esse dia foi top. https://t.co/LuLhEQrczf @JoselitoMuller3 @ajulysantos Ou projeção: se eu defendo o governo por interesse quem não o defende deve fazer assim pelo mesmo motivo. https://t.co/mkbZHkPvP7 RT @WAkenaton: @DaniloGentili @blogteleguiado MATARO DINGUINHO https://t.co/C7Fm90Wt5B Jornal “O Dia” não sabe a diferença entre piada e fake news https://t.co/gY1cL2T7XO via @@blogteleguiado RT @sarubo: Mais um \"veículo de imprensa profissional\" confundiu piada com fake news. \n\nNão é bait (antes fosse). É analfabetismo mesmo.\n\nE… RT @rodrigodasilva: Se você defende uma ditadura, não importa o motivo, você é na melhor das hipóteses um imbecil. Pode ficar ofendidinho,… @aguedescartoon Logo logo um monte de perfil vai te ucranizar por vc não engolir essa. Câmera Bailarino antes e depois do @robsonjassa https://t.co/eZ0xHWW8Uo RT @Flavio_Quintela: Soltei um tuíte “pega-minion” e até agora passou de 2500 comentários, quase todos apoiando o Bolsonaro.\n\nAgora a parte… RT @rodrigodasilva: Tenho um desafio: construir um site novinho em folha para o @spotniks. Preciso contratar o melhor profissional possível… RT @arecobarudino: você vê que o Santos Dumont era muito mineiro quando percebe que ele resolveu chamar toda uma estrutura de amortecedores… RT @Fiaspo: SENSACIONAL! @DaniloGentili @Velberan @AssopraFita https://t.co/mOJr6bdwOG RT @AssopraFita: Hoje foi foda!\nMuito obrigado @DaniloGentili @Velberan @Fiaspo https://t.co/S5s08NXirg Quarta - depois de amanhã - na @redebrasil com @evesobraltv https://t.co/1WUzNz37M1 RT @SBTTheNoite: Robson Jassa corta o cabelo de @DaniloGentili no palco do The Noite nesta segunda! Não perca! https://t.co/OFtFeerwe9 http… hahhahahahau https://t.co/0q7nX4OWUk RT @DaniloGentili: https://t.co/TKC7zSBr8Y RT @D4NI3LS4L35: Esse menino já aprendeu o que nós, brasileiros, demoramos para entender. https://t.co/YlrSfYe8dV @LucasmatiasVk No. Usam isso de “ucranizar”. Mas quando a mamata vem dos patrões deles não “ucranizam” nada. Passam pano. RT @igorzismo: Gente @diguinhocoruja tá bem, tá vivo e tá comendo salada https://t.co/M0pcztNqXj RT @TVMaresol: https://t.co/oP1Mna0Iyp Parabéns para todos os envolvidos. https://t.co/bs9m1O5ofC Aqui vai o dia que @demori inventou que eu estava em algum esqueminha sujo. Lembrando que eu fui hackeado 2 dias antes que @SF_Moro e da mesma forma.\n\nVai ficando claro que quem sempre esteve em esqueminha sujo foi ele e o intercePT. \n\nIsso aí não é jornalista. É militante pago. https://t.co/wgpoePRuP6 https://t.co/gxEFL6UUFm Não tenho dúvidas. https://t.co/kH5waJnVVk Aqui vai o dia que @demori disse que eu estava em algum esqueminha sujo. Lembrando que eu fui hackeado 2 dias antes que o @SF_Moro e da mesma maneira.\n\nVai ficando claro que quem sempre esteve em esqueminha sujo foi ele e o intercePT. \n\nIsso aí não é jornalista. É militante pago. https://t.co/MUGo4SHSo0 RT @diguinhocoruja: Vou arrebentar todos aí da redação. Espero que entendam. Até. https://t.co/qE9ZaGRTmK RT @opropriosatanas: Lá na Venezuela prendem jornalistas.\n\nMas o jornas brasileiro defendia o Maduro.\n\nEntão aqui o cabaço do Bolsonaro def… @ReisMarcelo4 @TVMaresol Hahaha @Fiaspo Volta pq eu cancelei a entrevista RT @Desesquerdizada: A Folha conseguiu a proeza de publicar a \"opinião\" de Moro sobre a delação de Palocci sem ter a opinião de Moro. É sur… RT @diogomainardi: Foi a Folha que tentou interferir politicamente em 2018 https://t.co/vHXoPROyf8 RT @TVMaresol: @DaniloGentili desculpa @diguinhocoruja a informação que recebemos na verdade foi do falecimento do Dieguinho, dono de uma l… RT @EduardoRitalino: Nome: Pedro Cardoso\n\nProfissão: Entrevistado\n\nBixo o Pedro Cardoso ele vai em TODOS os programas de entrevistas que ex… RT @willzeruela: foda um dos melhores radialistas vai deixar saudade\n#RIPDiguinho https://t.co/ZzIbDu05a8 Foi a @TVMaresol seu merda https://t.co/peegDhbvQ0 RT @TVMaresol: Morre o humorista e radialista \"Gordo do Danilo\" aos 452 quilos #RIPDiguinho https://t.co/5mVwE6yH6l Kkkkkkkkkkkkkkkkk https://t.co/B96yfAckZj @Ricardo32425750 Quantos perfis iguais a esse você controla para fingir que são muitos? E quanto vc ganha por isso? É aquela ala do PSL que te paga? https://t.co/ZtmsMBEd9y RT @BrRainbowGirl: @DaniloGentili Parabéns @DaniloGentili a você e a todos os envolvidos. Não é apenas sobre um filme de terror, é sobre o… Começamos o trabalho na série que dará continuidade ao filme! https://t.co/ioed4NNGP9 Dia 24 de Agosto “Os Exterminadores do Além contra a Loira do Banheiro” vai estrear em Londres e vai passar na maior tela de iMax da Europa \\o/\n\n“As forças do mal são poderosas mas nada vende a estupidez” https://t.co/m7yYKXyJoN Ei @Decolar manda abraço pra Lu Reis e Mariana. Sempre me atenderam muito bem :) RT @bethmoreno: A bolha que vc vive é plana? @FabioGuere Eu acho isso muito gostoso. Pq vc acha estranho? https://t.co/tK3DwuoIW4 https://t.co/Ev0tH5XvYh @dealuppi_ @gracaguimaraes Pra manter temas sob patrulha e vigilância e ter na mão prints prontos para “esclarecer” prontamente as narrativas... hmmm... sei não... parece até que teria gente paga pra isso. Por isso fiz a pergunta. \n\nAliás, qto você está recebendo para fazer minha pergunta parecer errada? @joao_mesquita Comunista @gracaguimaraes Quanto você está recebendo para fazer isso? @CamilaLarissaA1 Nesse caso enfia o dedo no cu e rasga. Não ligo a mínima. @deQueiroz0 Desculpe zuar a cagada da rola que você chupa. Eu proponho a emenda constitucional: “O presidente poderá usar a FAB para transportar parentes com fins particulares desde que o piloto do helicóptero seja o Marrone” RT @medo_b: Eu queria que vocês me divulgassem como vcs divulgam as pessoas que vcs odeiam.\n\nEntendi que meu erro sempre foi ser simpático… @MauMeirelles @parasitasilva @Atreviz Caraio... os caras se movimentam para vir aqui te xingar pq vc tuitou algo. Mas não se movimentam para cobrar o presidente por usar veículo oficial para fins particulares.\n\nHmmm... os últimos que vi usando perfis fakes pra fazer isso eram pagos, hein. RT @MauMeirelles: Pessoal com copo de leite e bandeira da ucrania, kd vcs? https://t.co/JSXUg9Pbp6 RT @Chicoocachorro: @DaniloGentili Dani estou com saudades ja ! Auau 🐶 @CarneMoidaTV Sua cabeça cresceu 10 cm também. https://t.co/TKC7zSBr8Y @kallilmaia @Decolar Hahgagahfads Sinto falta daqueles perfis que estão apenas lutando por um país melhor “ucranizar” esse ato da velha política no perfil do presidente. Não os vi por lá.\n\nCurioso como a “ucranização” é seletiva. Parece até que esse movimentinho tá preocupado em defender patrões não os valores. https://t.co/8BVKD8q9pO RT @aguedescartoon: Resposta: sim.\n\nFicou feio, porque vai contra todo o discurso de fim de privilégios - que é uma promessa de campanha. E… @depjoaodanielpt Verdade.\nMe pegou agora.\nDe todo modo peço perdão novamente por ter brincado a rola que vc chupa. Percebi que ficou magoado. @Decolar olá , estou a semana toda tentando comprar algo pelo app de vcs , mas falta opção de cabine. No site não consegui tb. Vcs podem me ajudar por favor? @xmariamariana @LucasVelosoator O Veloso tá solto. Seu ídolo tá preso. Isso diz alguma coisa. @fcastano_ @ruypp Hahahahhahahhaha @depjoaodanielpt Desculpe brincar com a rola que vc chupa @xmariamariana @LucasVelosoator Creio que o pai dele deixou pra ele algo que não deixaram pro Lula: caráter"}