{"tweets": "Sometimes I close twitter to then open twitter because my brain is very large RT @YouTube: Creators are joining together with a goal:\n\nto raise $20 million dollars\nto plant 20 million trees\nby 2020\n#teamtrees\n\nGet inv… RT @TommyWiseau: Make the years in front of you matter ! \n@pewdiepie https://t.co/ffiqfl0UTt RT @LeukemiaRF: Thank You @PewDiePie &amp; the 9 year olds for joining our fight to #ConquerBloodCancers. You can also join the fight. Donate:… RT @AndyBTTFYT: Here's a little glimpse into what it was like to animate \"Mine All Day\", @pewdiepie's new music video!\n\nEnjoy!~ https://t.c… https://t.co/LRYkTHdAPg\nAW MAN https://t.co/KV9T5DPZn6 #ad watch me make a thumbnail epic https://t.co/dk7RthHF7y https://t.co/hspOvaQutc\nITS FINALLY HERE!!!\nEach version is numbered.\nLimited time.\nEpic prize. https://t.co/KuenjYmvY4 Well now is a good time as ever to promote https://t.co/bboVTwm1y8 👈keep the internet open and free from ban regulatios 😈. Use code pewdiepie for a free month. #ad @BartBaker wish 🙃 @BartBaker you seem like a good dude, I probably wont be allowed in but which you the best lol https://t.co/Ksz6sQCHDl China took copyright of Pewdiepie in 2017 without me being able to stop them anyway, guess they can't sell any more pewdiepie wedding dresses now lol https://t.co/EkdWR63bYW just found out im banned in china. shit fucking sucks so hard dude https://t.co/OIr86Aa89f Snoop de oh double gee LESS GO! https://t.co/ut3JirtVil Teaser for my new game PEWDIEPIE'S PIXELINGS!\nJoin the discord now: https://t.co/ioKKrVuN3B https://t.co/n9mrRLpl8b https://t.co/q6qvZTXCYS https://t.co/XQVRKn8TJ7 https://t.co/Ry06YWTlcI @sivemorten lmao FOR THE RECORD SIVE ASKED ME TO USE THE PHOTO OK, I DIDNT PRINT THE PHOTO IT WAS A RANDOM  THING THAT I WAS GIVEN AND SIVE WAS LIKE LOL SIGN IT @sivemorten I expect a pic of your face signed as a proper thanks RT @GFuelEnergy: Today is the day. \n\n@pewdiepie x @GFuelEnergy\n\nhttps://t.co/1qjaKDf0e0 https://t.co/nBB94xwqXJ So I don't know how but I Will try and play video games LIVE !!!???\nhttps://t.co/4NBSF1JWUd live now Tomorrow gamers rise up\nhttps://t.co/KyHyhxnz3J #ad?lol https://t.co/7IBg0JEBvu @elonmusk Does Tesla cars have the same anatomy as Pixar's Cars? 🤔 https://t.co/uPTTjDEvuh Going live at dlive in like Abit https://t.co/tXb0czxNpJ RT @OfficialInhuman: OMG @pewdiepie’s new @GFuelEnergy flavor is Lingonberry flavored. Lingonberry is probably my favorite fruit, and I’ve… Sorry gamers.. Turns out Meatball flavoured Gfuel is illegal in 5928 countries 😭\n\nPEWDIEPIE GFUEL FLAVOUR REVEAL IS: \n/ 🔴🔴🔴RÅRÖDA LINGON FLAVOUR 🔴🔴🔴 / 👈Tastes like memes! \nSignup to make you get it 🤜\nhttps://t.co/KyHyhxnz3J #ad?lol https://t.co/noIz6PC0O6 RT @ElvisTheAlienTV: ❗️NEW VIDEO❗️\n\nPeople Ruin Minecraft (ft. @BionicPIGtv &amp; @pewdiepie)\nwatch: https://t.co/JFJYbW338m https://t.co/qZLF7… 😏/ AD / 😏Go to 👇https://t.co/82EEqhXPSc to get 70% off a 3-year plan (great price😤) use code 🤠 PEWDIEPIE to get an additional month for free. 🤑 @MrMakistein Hecking YES https://t.co/KV9T5DPZn6 #ad?\nhttps://t.co/KV9T5DPZn6 ? \nStream?\nRL Craft New pewdiepie gfuel flavour reveal! https://t.co/V4Dci6aWwf https://t.co/httdqb3liK live epicly #ad? löl @GFuelEnergy Oops Preorder and guarantee your FATTEST SLÖRP now!\n\nhttps://t.co/HHNw5Q1uaq @GFuelEnergy #ad? https://t.co/5Pek6dngXP @WiLLoDavisRocks @coolshirtz @ColdOnes @maxmoefoe @anything4views wtf is this shirt and where did it come from RT @GFuelEnergy: That new #GFUEL SCOOP email blast tho...🔥🔥🔥\n\n#GFUEL x @pewdiepie \n\nCOMING SOON 👀 https://t.co/gn7JSPtpZ2 @Jack_Septic_Eye @GFuelEnergy KÖP KÖP @GFuelEnergy @GammaLabs @GFUELesports May or may not be a real thing 🧐 RT @GFuelEnergy: EPIC GAMER MOMENT.\n\n@pewdiepie x #GFUEL\n\nCOMING SOON. https://t.co/z7wrBjnn08 RT @Outerminds: Ora ora ora Marzia ora ora ora Marzia ora ora ora Marzia ora ora ora Marzia ora ora ora Marzia!\n\n#pewdiepie #outerminds htt… @roomieofficial @GFuelEnergy So you're saying you don't want a pewdiepie gfuel flavor? Unfriended 😤 I may or may not have developed my own @Gfuelenergy flavour 😤...and it may or may not be launching soon😤😤😤! In the meantime my code PEWDIEPIE will get you 30% OFF site wide: https://t.co/FQaFg9XWNo 🤫🤫🤫🤫🤫🤫 #ad? @s8n Sorry, autocorrect... lets BANG some time @s8n Bruh, lets hang some time RT @nerdcity: Youtube won't tell us what causes demonetization.\nSo we showed 15,296 words to their bots, and built a list of what they hate… RT @Outerminds: It's our anniversary! 😘 Collect ALL THE THINGS and keep your tuber #relevant with this year’s unique goodies before it's to… Vatican raid, when? Send me funny haha videos @ExposingUrLies @chrisulmer 👀@youtube @SusanWojcicki https://t.co/kqFoipXV9B\nRecommend checking out this channel. Every person's story is so unique and gripping! @SusanWojcicki 🤠👍 Area 51 raiders, nab my legs for me thanks @Outerminds Ey congratulations RT @Outerminds: BOB IS IN, GAMERS!\n\nThe BIG BRAIN team over on our newest Discord Server figured out our latest teaser and as a reward, her… RT @ClutchChairz: Giveaway extended for 1 more day! Get 3 chances to win 1 of 12 ALL NEW @pewdiepie LED chairs.\n\nRules\n1. Follow us (1 entr… Ended up doing 12 hours, epic thanks for watching RT @ClutchChairz: Only a throne made of pure light is worthy of cushioning the royal buttocks of his majesty, King Pewdiepie. Congratulatio… https://t.co/ujj8WfCfgn epic giveaway link #ad Going live for a bit https://t.co/KV9T5DPZn6 #ad #epic RT @MrMakistein: Any specific wishes @pewdiepie?\nI can make all your dreams come true! ;) https://t.co/9Z794LO0k0 @Outerminds Does it have pyramids? 🤠 RT @Outerminds: We’re thrilled to announce that we’re making a new game in collaboration with @PewDiePie. Stay tuned for more info! #outerm… @GetFlexSeal @YouTube Doesnt ship to UK. Can you request a special flex delivery? Free 8 Ball Pool Game https://t.co/GP1ATlQ25w @HardDriveMag Its already gone to cat ear research @h3h3productions Thanks for sticking up to me man, I ended up doing a pro gamer move in the end😶 @YouTube lil' bit of glue and it's already like brand new @HardDriveMag ffs lol https://t.co/SFNVUHpEct\nbing bang bong, new announcement in beginning of video 👀 https://t.co/JoZIDzd8IU @Yasmemes what @MarziaPie WHAT? RT @elonmusk: Um @Porsche, this word Turbo does not mean what you think it does @elonmusk @Porsche bruh.mp4 😂 @TheAn1meMan Take your snails and LEAVE As excited I am for Uzumaki to come out as animated. They better cut the fucking snail bit, fuck that. No thanks. \nhttps://t.co/9BsppVjcc3 Dillon the hacker was such a talented young comedian. He succesfully trolled my entire audience at one point. Such sad news to hear about his passing. My condolences to his family and close ones. \nRIP Dillon @TeamYouTube @JTonYouTube It would be a good to not allow community subtitles adding hyperlinks as title and description. https://t.co/T3MCTiJiEM 12h Livestream and the fattest brofist, as soon as I'm back from honeymoon! 😤 We did it! What an unreal achievement! 100 000 000 thanks to all of you for the endless support and effort! I don't feel worthy, but I'm forever grateful 💯♥️👊 https://t.co/ErZk2uD904 @dantdm Thank you bro, youre a great guy 👊 @smartereveryday Thanks Destin! @GFuelEnergy Thank you guys for the nice words and for being awesome to work with🌞 @DrPhil @YouTube @MarziaPie Phil, you're the man!👏👏 @notch Thanks for creating an amazing game that so many can enjoy! @jamescharles ✊Sister fister 4 ever 😤❣️ RT @YouTube: Married to @marziapie 💍\nRevived our love of Minecraft ⛏️\nReached 100 million subscribers on YouTube ✔️\nWhat a month to celebra… @MKBHD Thanks bro 👊 RT @MKBHD: I remember when the first YouTuber (Fred) hit 1 million subscribers\n\nThen a couple years later @pewdiepie was the first to pass… https://t.co/4yeGwUMrnY ❤️ @TommyWiseau Thank you Tommy, your blessing means more than anyone's 💗 RT @TommyWiseau: @pewdiepie May all your dreams come true ! Last tweet had an outdated photo, my bad. Its a great charity regardless 👍 Please join me and donate to https://t.co/JeeyGhZXdx - one of many great charities that secures acres of rainforest. We are married!!! I'm the happiest I can be ❤️ I'm so lucky to share my life with this amazing woman. https://t.co/RA3iKAgMOs @TeamYouTube 😁 The man the myth the legend did it: https://t.co/0vZTyoDIdF\n@DrPhil 😍 @jacksfilms Damn, I think one of my older videos got put in recommended by YouTube and that's why. I took down any videos joking about it because clearly this is too far. Sorry bruv RT @GFuelEnergy: 🔥 #GFUEL x @pewdiepie 🔥\n\n🗣 ATTENTION, EPIC GAMERS!\n\nOur world-famous, glow-in-the-dark, 25oz tall boi Pewdiepie-Inspired S… @MrBeastYT You're a good soul 💞 RT @GFuelEnergy: Like + RT if you think we should bring these tall boi @pewdiepie x #GFUEL Starter Kits back. 🍝 https://t.co/xngoBWK1wP Thanks for the teen choice gamer award 🤠👍 https://t.co/8M48tuS2il RT @vidIQ: Great article on “Minecraft’s recent surge on YouTube proves that the “PewDiePie Effect” is still real” 👉 ( with a special menti… pepe popo https://t.co/pg1J8ZXE8a https://t.co/KV9T5DPZn6 streamin epicly £ad RT @sivemorten: ̶J̶o̶e̶r̶g̶e̶n̶ ̶\n̶W̶a̶t̶e̶r̶ ̶S̶h̶e̶e̶p̶\n̶I̶k̶e̶a̶ ̶B̶i̶r̶d̶ ̶\n̶B̶o̶a̶t̶ ̶C̶o̶w̶\n̶B̶r̶a̶d̶\n\nMe rn: https://t.co/9SS2LVdpN3 So long, sail on\n\nhttps://t.co/d7Pw76eRyb\nhttps://t.co/k9K0IsojN0 https://t.co/pDx4aU9o9y https://t.co/eUMHhGdsB0 Whats another good mode to play online with friends of mc? Like skyblock for example send me your best mc meme clip unless youre a coward Creeper mc ep is being edited, Im sorry its gonna be a bit later @notch Minecraft 3 it is then @notch It's time for Minecraft 2 @DHZeroX RIP @jackblack For Etika https://t.co/9tIk2qThCs .@jackblack Black burned down my Minecraft house, but its okay because we hit our donation goal. \n\nThanks for joining the fun! (Despite the issues with the delgato). https://t.co/jotSMa1q1T problem with delgato setting up, soon gamers @PartyInBackyard Legit fire RT @jackblack: see u in the virtual 🌎 tomorrow @pewdiepie 😎 @OfficialDLive https://t.co/APldlmSnfq @jackblack @OfficialDLive Best bring your finest elgato for this RT @PartyInBackyard: Sven and @pewdiepie singing and dancing🎵\n\nhttps://t.co/DvJKWTHlFI https://t.co/7Csybs22OQ https://t.co/nSJPnccoB3\nthis is fucked RT @elonmusk: Made with rain ™️ https://t.co/CJJ7BYzxcj RT @Outerminds: MiniCity is back, and we can't wait to see your mini rooms. Watch out for the new celebration events!  #tubersimulator #pew… RT @OfficialDLive: Happy on the outside doesn't always translate to happy on the inside. Overwork, burnout, and stress of content creating… RT @Outerminds: We'll cut you a deal: Joergen is available for free, and that's a great price! Hop into Tuber Simulator before July 26 to c… @DdotMinter Ye RT @notch: I can't get enough of @pewdiepie's minecraft videos. Best timeline ever! RT @Outerminds: Tomorrow. 🍉 🐴 @pewdiepie \n#tubersimulator #joergen #stillrelevant https://t.co/8OXwIXdnGt Scare pdp s2 in area51 lets get it RT @LWIAY_bot: I made a paper Pewdiepie and Sven model! Took over 5 hours (mostly because of Sven.) Thinking of more things to add to it! H… https://t.co/eAjnIiNsFr https://t.co/P9fij9U8WW RT @elgatogaming: 🇺🇸 PRIME DAY IS NOW LIVE. 🇺🇸\n\nGet your favorite Elgato products at their lowest prices ever. \n\nAct now - this sale is liv… RT @GFuelEnergy: 👊💥 #GFUELCAN 💥👊\n\n🗣 #GFUEL TEAM...ASSEMBLE!!! Come! Join us on our quest to become the most ELITE humans to walk this earth… @GFuelEnergy US only? *cries in swedish* Why do I feel genuine remorse over water sheep? Fs in the chat Thanks for having me on bois https://t.co/F5Gy9B2IWi @grandayy 😻 @KEEMSTAR @GFuelEnergy CODE: PEWDIEPIE https://t.co/wtPHfIUpSp @alkhemikmusic ye moon @BernieSanders wanna team up Minecraft on dlive? @Jack_Septic_Eye @eldalyyy WHAT I hope you all feel good about yourself..\nhttps://t.co/odQTepyJvo https://t.co/Io9b58Jsvc F in the chat bois https://t.co/xtRwYvHzv8 @jacksfilms But its gaming week epic gamers, finishing off dark souls 0 death so far epic\nhttps://t.co/KV9T5DPZn6 #ad @elonmusk Happy birthday! 🎂👏🎈 @KevinTheShiba wtf delete your dog bro https://t.co/httdqb3liK\n#ad streaming again very epic 0 deaths ornstein and chubby boi time 👋 Scandinavian minimalistic designed shaker is almost sold out again\n👇\nhttps://t.co/BOJoMr0NMV  \nIt 👋glows 😻in 🙌the🙌dark 🥬bitch😎 @KEEMSTAR delete this @Jack_Septic_Eye 1M for cock and balls? RT @GFuelEnergy: Witness the state-of-the-art, glow-in-the-dark, ground-breaking, mind-blowing technology that is our 16 ounce \"Pewdiepie J… If you're struggling mentally, speak to someone close or call, you are important!\n\nUnited Kingdom 🇬🇧 116 123\nUnited States 🇺🇸 1-800-273-8255\nCanada 🇨🇦 1 800 456 4566\nIreland 🇮🇪 116 123\nPhilippines 🇵🇭 2919\nAustralia 🇦🇺 131 114\nFrance 🇫🇷 01 45 39 40 00 Hard to grasp that he's actually gone, left us way too soon. \nYou will continue to live on in our hearts.\nRest in peace @Etika RT @GFuelEnergy: 1 beautiful, minimalist, Scandinavian, glow-in-the-dark, 16 ounce Shaker with 7 packs included. The \"Pewdiepie Jr. Starter… RT @Jack_Septic_Eye: 10 000 RT and I dye my hair green again RT @GFuelEnergy: Later today. \n\n#GFUEL x @pewdiepie https://t.co/L4btK68PV4 https://t.co/KV9T5DPZn6\nZERO DEATH RUN CONTINUES\nDEATHS SO FAR: 0\n#ad https://t.co/KV9T5DPZn6\nEPIC GAMER WEEK DAY 2 DARK SOULS LIVESTREAMAN #ad https://t.co/um3EaoMEiu\nGAMING WEEK EPIC dark souls 0 death run https://t.co/KV9T5DPZn6 #ad @jacksfilms Can't believe some people just blatantly rip off and not credit.. Wtf @McNeilColin Thanks for your in depth coverage 👏 WHAT?! 😱 @McNeilColin I swear I added it, it mustve not saved for some reason. Added it now Sorry! https://t.co/BIkwYiDzbb RT @elonmusk: Touched by an 😇 https://t.co/LqPQ5Ff0PK Legend https://t.co/huuUZYRbzD @Jesperish Insaneee! 👏 RT @Jesperish: Felix Arvid Ulf Kjellberg v2 // Artwork for @pewdiepie  Sharing will be appreciated!! https://t.co/lHeZN6OeXY https://t.co/r… @constantinos_n Our beacon of hope\n\nToo bad it was cancelled @OMGitsAliA @claresiobhan Congrat https://t.co/90PAgRV8WO ICON status achieved on @NimsesOfficial 👏👏 Check out the new global economy: https://t.co/qkzQq87pCH #nimses #ad @elonmusk Loool https://t.co/YzCdci6Ajj https://t.co/dEYKuxjA3g RT @Help06014907: Buy @pewdiepie 's gfuel is friggin cool https://t.co/1nXPPAPC3h @maxmoefoe @GordonRamsay Cook up something better then you hairless nut Thoughts on my spaghetti? @GordonRamsay https://t.co/qMBDqJAcgG RT @_SrPelo_: Me and the boys ready to give the news without Poppy Gloria. https://t.co/79sDLIQodt ey send me stolen pdp wave designs Cutting my toenails with a plier @Jack_Septic_Eye I had mine on 144 lol wtf super relaxan streaman https://t.co/KV9T5DPZn6 #ad Happy pride! https://t.co/inPKB9xAe2 sleepy mornan streaman for some reasan https://t.co/KV9T5DPZn6 #ad https://t.co/ESBs11FFnF 😤😤😤 quick early stream  https://t.co/KV9T5DPZn6  #ad\ngonna try and hit mythic rank in magic boi gonna be live to chat and chill and epic times at dlive https://t.co/KV9T5DPZn6 #ad top comment decides my next video upload Rip poppy Gloria 2018-2019 In today's video I play @Archero_Habby with Mertz! Loved it. Play it yourself and download on iOS (https://t.co/gvbUdwLmc7) or Android (https://t.co/4LEYJRpmtC) #archero #ad @MrBeastYT BRUH https://t.co/SWUyvc7Cd7 @PrinceHabibiX screencap from the video @h3h3productions FYI She removed it and looks like it was made in error. @CoolCatlovesyou I'm in RT @CoolCatlovesyou: Cool Cat says, \"Bang bang, @pewdiepie knows what is happening.  And bullies beware....\" https://t.co/iL4W2rsJ4M james charles right now https://t.co/KlWK5hZrBq Congrats Netherlands, good show, see you next year 😘#Eurovision Spain more like pain #ESP Australia is not even a country wtf #AUS Nipple 0/10 #CHE Trash like the trash bag she's wearing #SRB Very not good #ITA Shit tier Marzia #FRA Shut up, yes please #AZE She shouldve stayed in the 90s, awful #BLR Teleporting guitar Cxzybijfszi9hfsuuigdssdfu9oihgtyiiudssthuu  #EST What the actual living fuck Iceland? #ISL Nic Crompton came back to his city #GBR BOOOOOOOOOO 0/10 #NOR Lmao he cried seeing this tweet You are someone that made a bad song #ISR At least the white ball was good #GRC Uh bad  #NLD Kylie Minogue but somehow worse  #CYP Ew #SVN He has my shoes! 11/10 10/10 BEST SONG #SWE That was amazing.. ly BORING WHERE ARE THE SNIPERS? SHE'S NOT EVEN MOVING #MKD I feel violated just listening to this #SMR Song is as bad as her teeth #DNK (Opsie I actually don't hate this one tbh) Welp, time to ban Russia forever from joining #RUS Bye sistah  #DEU Ketchup mustard and shit #CZE Albania more like alBYEnia #ALB Bad #MLT the pewdiepie glow in the dark shaker cup is sold out\n🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡 RT @GFuelEnergy: Our @pewdiepie Shakers are sellin’ like hot cakes, folks! Get yours ASAP at the link below before they sell out! \n\nhttps:/… https://t.co/KV9T5DPZn6 live chatting hanging epicly time #ad RT @PartyInBackyard: #TBT this was the final result of my @pewdiepie meme car. 🔥 https://t.co/zcuOVuxiSy RT @GFuelEnergy: 🔥 #GFUEL x @pewdiepie 🔥\n\n“THE PEWDIEPIE” CUP IS FINALLY HERE! And would ya’ just look at it?! It’s got that pure, minimali… @Simon_Denault 😍 RT @GFuelEnergy: THIS WEDNESDAY. BE READY. \n\n#GFUEL x @pewdiepie \n\nhttps://t.co/VMfyLfsUR4  💕💕💕 https://t.co/XyBvnJAj15 y tf is poopy cryin about needing a research team?? RT @jamescharles: attractive straight boys will be the death of me @realblaines This is probably the only fair point I've seen to it all play out lol I got a lot of problems with this Tati video, am I the only one? 🤠 I avoid news by picking trends in arabic countries. lmao cant even dodge this one https://t.co/9eV7PPRVQA https://t.co/Nk8s7NRsCH RT @GFuelEnergy: If @pewdiepie had his own #GFUEL flavor, what would it be? 🤔 https://t.co/lYRj9wz8Kd playing a video game live \nhttps://t.co/KV9T5DPZn6 #ad @Idubbbz I dont EVEN care wtf!?! 🤣 Oopsie wrong link! So hot right now @nutakugames just launched their new Hentai Hot Sauce and it’s 🔥🔥🔥Beware of aphrodisiac properties 😉Get yours here and check it out: https://t.co/ISGVcGbD8w  #hentaihotsauce #ad https://t.co/4uYtpFfvrG RT @sivemorten: rt to win a free pair of shoes worn by the swede man himself https://t.co/QhWlDxJ6jY @sivemorten I want the middle ones back now ffs lol https://t.co/Ltzfelh8PI https://t.co/DlfGPlTOCg\nIt pains me to sell this that Ive hold on to for so long, but money is tight"}