{"tweets": "4 Juta subscribers Youtube, gue mengadakan giveaway mobil. Selengkapnya lihat di sini: https://t.co/aH6kidMe2f Selamat macet pulang kantor. https://t.co/saek7s1IkK Caranya akan gue umumkan di https://t.co/oteZCgfTqL. Subscribe dulu channelnya biar gak nyesel ketinggalan infonya nanti. https://t.co/WalN7c7SKK Sakit tapi gak berdarah. https://t.co/3HY9B3N7JH Review makanan berikutnya, gue gantian pake batik. Pandu pake jas... Jas hujan. 😂 https://t.co/csPVGJGawV 35 tahun. https://t.co/SNSz8Bp2UL Akhirnya naskah buku baru pun selesai. Serah terima naskah ke Pemimpin Redaksi @gagasmedia. Semoga cepat naik cetak. 😂 https://t.co/riDYnsD0RJ Selamat untuk Bintang Emon. Well deserved. Buat para penonton, sampai jumpa di season berikutnya. Kami rehat dulu. 😁 https://t.co/On5VL7GJWu Puisi favorit jadi film.. 😍 https://t.co/lXdKDg6ANs Gak kok. Kalo malem gue tinggi. https://t.co/HRqYcCLc87 RT @mentary_Rajut: Bang @radityadika  bisa gak SUCA tetep ada tiap hari, walaupun bukan lomba gak papa dech, acara yg menghibur cm ini soal… Siapa yaaaa.. https://t.co/U1uWsDceez RT @mentary_Rajut: @radityadika Nonton #GrandFinalSUCA3 , lg iklan,remote dah dipegang anakku,mo pindah channel , langsung ku ambil lg taku… RT @bigmariaa: @radityadika #GrandFinalSUCA3 Baru kali ini, nonton acara tv, yang seiklan2nya gw tonton jg. Saking ga mau ketinggalannnyaaa… Padahal gue udah punya. https://t.co/TezUnzdQok Lagi tayang! #GrandFinalSUCA3 https://t.co/Ye3Z2Wj9Mc RT @radenrauf: @MajelisLucu DAN TIBA TIBA RADITYA DIKA PERFORM 🎊🎉\n\nBener bener kejutan, dan pecaahhh. \nLu ga bakal bisa nemuin rekamannya,… Kasih caption. https://t.co/93x4tnzpd3 RT @mfahmipermana: Stand up Radit paling lucu selucu-lucunya. \n75rebu dapet beginian! Gokil @MajelisLucu! https://t.co/r8CgbFJ3ZY RT @jojosuherman: Nonton radit mendadak standup lagi tadi di @MajelisLucu dan performance radit terlucu yg pernah gw tonton live :))))))))) Makasih buat @MajelisLucu buat malem ini. Puas pas standup-nya, puas nonton temen2 yg lain juga.. 😂 @Moektito @MajelisLucu Next time dateng lagi nonton Bayyy.. seru bgt 😂 RT @zarryhendrik: Manusia-manusia ini pulang dengan bahagia. Tersenyum dalam tidurnya, sesekali mengigau.. \"bangsaaat.. anjing...\" \n\nMantap… RT @yudhakhel: tadi di acara @MajelisLucu tiba-tiba @radityadika stand up. Lucu parah!\n\n*gak akan ada di youtube.\n\n*klo ada bisa merusak im… RT @ficofachriza_: Yang gak nonton MLI, aduh, maaf banget, tiba-tiba ada @radityadika lucu banget!! https://t.co/lvQEvsVhe4 RT @jojosuherman: Sebuah kejutan bagi yg datang.. yg ga dateng makin nyesel krn @radityadika gamau diupload :))))))) https://t.co/ToDm0QhD0d Teman2 gue akan mengurangi  buka Twitter. Yang mau, follow instagram gue aja di https://t.co/5AxfZAEbAf thank you. 😁 Untung gue gak divideoin pas nonton. Muka udah mencong2.. 😂 https://t.co/Ml6fGcE2iY RT @egik_mk: Solusi buat yang susah bangun tidur. #AdaAqua https://t.co/b4tEiK5U6f RT @bhaktibek: Selamat pagi. Boleh di intip rumus TANGGUNG @radityadika yang bikin gue bangkit &amp; lulus, di https://t.co/7BevJAsPZi https://… Gue pribadi berharap film Pengabdi Setan bisa tembus 1 jt penonton biar bisa jadi benchmark film2 horror berikutnya. Great storytelling. Buat yg masih mikir2 mau nonton Pengabdi Setan, nonton aja deh. Gue aja pengen nonton lagi. Filmnya sebagus dan seserem itu. Fun ride. Abis nonton teaser trailer #matabatin, siapa yg di kehidupan nyata bisa ngeliat \"sesuatu\"? @hitmakestudios https://t.co/r17aWdLTa2 Baru diupload! Tragedi Squishy Berhantu part terbaru. Tonton di sini: https://t.co/qdLIQIfnNb Mau bayar klinik eh bank lagi offline. Gak bawa cash. Alhasil.. barusan ngutang, gue bayarnya besok pagi. 😅 Dari pagi sehat2 aja. Begitu jam empat sore badan tiba2 meriang, kepala pusing banget, sekarang lagi di klinik. Bisa gitu ya.. 😂 Streaming premiere league yg legal dimana ya? Siap nonton SUCA malam ini? https://t.co/hgbGVQWEEG RT @triheruelman: @radityadika  https://t.co/IMU9MHCOw0 RT @Wibi114: @radityadika  https://t.co/8zZP8fxNvn RT @mukhsinpro: @radityadika Bila nanti saatnya tlah tiba, kuingin kau menjadi istriku...\n\nDuet maut. https://t.co/He6COAFaw4 Kasih caption! https://t.co/y9Gms0vzpI RT @uyunghe: @radityadika Sowon: liat radit bikin video youtube tentang kita (gfriend)...\nYuju: owww jinjja? Aaaa~~ https://t.co/zZ8AnJwiqc Video YouTube baru! Membandingkan anggota girlband K-Pop GFRIEND bersama Pak Jarwo Kwat: https://t.co/RHd3Hjy19m Dikasih bawang putih yg abis difermentasi oleh Pak Jarwo.. https://t.co/kB4220MeVk Video makan ayam goreng sama Sumanto masuk trending YouTube. Klik di sini buat nonton: https://t.co/9Hp3sPxe9R Congrats bang @jokoanwar! https://t.co/LOU8ttueb4 Ini sumpah seru banget. 😂 https://t.co/LmdGPuHyIk Berarti dagingnya.. https://t.co/jOM38Qj4PQ RT @mosidik: Tiket Show English/bahasa Indonesia dengan harga Early Bird akan tersedia di @WSYDNshop 25 sept jam 00:00. #Fattitude #Jakarta… Video YouTube baru! Membandingkan Antara ayam goreng A&amp;W, KFC, McD, Texas, dan CFC. Mana yg terenak: https://t.co/9Hp3sPxe9R Antara ada dan tiada.. https://t.co/HlcbpDg9S2 Welcome to the club. 😁 https://t.co/19Hla0diVY Video baru! Tutorial membuat upil Naruto: https://t.co/1JF0R3XbB4 Kalian lebih pengen jadi apa? Emang aturan gimana.. https://t.co/DS5vuo2icY Kucing lagi ngambek.. https://t.co/TtxlkLegHA Menuju draft 2.. https://t.co/uGblKE1kF7 Video baru ngomongin pengalaman horror shooting film masuk trending Youtube. Klik di sini untuk nonton: https://t.co/58kfBFSXy9 Kasih caption! https://t.co/liRIzQaF09 Hari ini kucing gue jadi bintang iklan.. 😂 https://t.co/4kC39jGw3z Kiri apa kanan? https://t.co/VszxCrbzsh Cemilan ketogenic diet. Yoghurt full fat, berries, dark chocolate. Sehat tapi puas. 😁 https://t.co/6htdA1BEP4 Malem ini! https://t.co/8mxJH1jD2R Eunha selamanya. https://t.co/KtTX8x4N4J Duh.. https://t.co/JbfLUfuIKA RT @mizanstore: @radityadika Inilah gaya humor ala @radityadika dalam tulisannya &gt; https://t.co/gvbc7XhgL6 https://t.co/XATxA1Xyma Botax.. https://t.co/QV0hLhssPX @PanduWinoto13 Keren tuh jamnya Review #Renegades: film ini full action, cocok buat yang pengen nonton sama teman atau rame-rame. Duduk gelisah. cc: @cinema21 Review #Renegades: adegan-adegan actionnya seru, persahabatan antar anggota Navy Seals bikin baper. Plotnya tak terduga. cc: @cinema21 Review #Renegades: film ini dibintangi pemenang  Oscar J.K Simmons, bercerita tentang tim Navy Seals menemukan harta karun. cc: @cinema21 Pilihan nonton di @cinema21 minggu ini adalah #Renegades. Sebuah film action-thriller yang menegangkan dan seru. Lengkap dgn pemain2 keren. Video review jajanan di mal bareng Arafah masuk trending YouTube Indonesia. Yg belom nonton klik ini: https://t.co/uzMwN4l9vE Cc: @anantarizki https://t.co/8O3U0QFrxz 😒😒😒 https://t.co/KGcn8rZOBF Tidur macam apa begini.. https://t.co/0Xz2hl92eh Mainin suara kucing dari YouTube.. 😂 https://t.co/kN7ixw07qF Utapes urab. https://t.co/yZv0kyD5zj Hmmmmm.. https://t.co/YyI0ouCcDz Sundul gan.. https://t.co/VlV4pEGL1M I done seen you glow like that, I must say that I'm proud.. Thinkin' 'bout the times when you would go into my house.. Ayyyy.. Beliin dong.. 😓 https://t.co/bFADT4RTNY @ginaSnoer @ikanatassa @deelestari @fuadi1 Pajak royalti sifatnya gak final Gin, pas lapor SPT bisa dihitung ulang. Di bwh batas Penghasilan Tdk Kena Pajak misalnya, bs diminta balik. Dari dulu ngefans dari zamannya dengerin radio SK eh baru hari ini bisa foto bareng. Senang. 😁 https://t.co/ANrSYwZoMZ Suca 3 di Indosiar now! Ada pria tampan pakai topi! Indosiar now! Ada lelaki tampan memakai topi! Belom sempet ke salon nih. https://t.co/A2qPJeiD1F Meeting sore ini.. https://t.co/DtCsYllO4u Draft 1 selesai. Fiuh. 😅 Dibeliin sepatu baru sama kak @indrajegel. Makasih, tau aja sepatu gym gue udah buluk.. 😂 https://t.co/76wmM1vkbA Baru keluar! Tragedi Squishy Berhantu part terbaru  tonton di sini: https://t.co/TUQC1QebcU Besok! https://t.co/xg2sGBe3a4 Baru diupload! Review mobil listrik Tesla Model S P100D. Tonton di sini: https://t.co/0Clp1spyak Nonton versi komplitnya di yucub gue.. https://t.co/NqnylzsVXw Meeting. https://t.co/i55Jc7vzPC RT @Starvisionplus: Koala Kumal tayang perdana malam ini di @SCTV_ nonton yaa! :) @radityadika @sherylsheinafia @septriasa_acha @ninofernan… Gue bikin kelas menulis, harganya cuma seribu rupiah. Cek poster buat ikutan. https://t.co/OvRUbyJqi7 Shooting season baru Tragedy Squishy Berhantu. Siapa yg udah liat season 1nya? 😁 https://t.co/mllilnpcOb Video baru! Belajar bahasa Korea bersama Han Yoo Ra. Tonton di sini: https://t.co/jhhUZtqNvZ Main POE yuk.. https://t.co/F6keHUkJ5w RT @ipangwahid: Gw nyari anak muda org iklan/penulis utk jd Creative Storyteller/Writer yg bs ngonsep &amp; ngide cerita. Tertarik?\nemail: hall… Abis beli peliharaan di game Path of Exile yg lagi gue sering mainin. Kasih nama siapa nih? https://t.co/IUuPakrGnE Tolonglah Sushi Hiro buka di Jakarta Selatan. Repot jg kalo ngidam harus ke Utara.. 😂 Makan bayi2 ikan.. https://t.co/o3UX6XdTZT Dirgahayu Indonesia! https://t.co/R2jDyTwweS Review Tesla P100D coming up! https://t.co/TDIM3lHulf Video baru! Demian melakukan atraksi melepas diri yg berbahaya di rumah gue. Tonton di sini: https://t.co/qZdTP42FLr Nih kemarin gue bikin review odong2: https://t.co/EMfCtjBYTF https://t.co/q7Ge1sz5Xu Gak sabar besok mau review mobil Tesla di rumah. Bakal kolaborasi sama salah satu Youtuber otomotif. Siapa hayo.. 😁 https://t.co/SEsonItD6G Nunggu versi turbonya. https://t.co/HTjaXybo8O Pengen test drive mobil listrik deh. Apa ya yang bagus.. Review #TheHunterPrayers: kalo yg Minggu ini bingung mau nonton apa, bisa coba film arahan Jonathan Mostow ini. Seru! CC: @cinema21 Review #TheHunterPrayers: film action ini bercerita ttg seorang Hitman yg harus bekerjasama dengan calon targetnya. CC: @cinema21 Review #TheHunterPrayers: film ini diperankan oleh Sam Worthington, diadaptasi dari novel berjudul For The Dogs. Pilihan nonton di minggu kali ini di @cinema21 adalah: #TheHunterPrayers film action yg seru cocok ditonton rame2! Nongol untuk jadi pengantar episode terakhir Mata Najwa. Tayang Minggu ini! https://t.co/tRKKzxMZjb Video baru! Review dan test drive Odong-odong: https://t.co/EMfCtjBYTF Bongkar2.. https://t.co/NJBSmx0cGY Naik elang dulu gaes.. https://t.co/MMkNGd7cIO Gak kok. Seinget gue seratus ribu lebih dikit. 😂 https://t.co/1a4nJNq6TL Gak tau, beli karena lucu aja ada gambar beruang di atas es krim. https://t.co/mjQjF38zgF @wowadit 11an. Iya emang lg krisis VGA di jkt Orang pulang dari Bali biasa bawa pia legong, ini gue bawa VGA. Mumpung di Jakarta susah nyarinya. 😂 https://t.co/uUDwcIZ8Fj GTX 980 gue udah laku. Makasih semuanya! Iteman deh kayaknya.. https://t.co/cVGwhdWUtx Tujuh tahun lalu cuy.  😂 https://t.co/BEnIAIoV3T Ngipa. Ngisep kelapa. https://t.co/l7iNv4qIpQ Gue jual GTX 980 second batangan nih. 3.5 juta aja. No nego. Minat serius email ke raditya.dika@gmail.com. COD besok malem di Jaksel. Cus! Ini gue juga dapetnya di Bali. https://t.co/8Lr6i8Nq2e VGA lagi abis dimana2. Orang2 lagi pada mining bitcoin apa gmn nih.. 😂 Draft 1. Let's go. Akhirnya ada juga video gue (selain trailer film) yg trending nomer satu di YouTube. 😂\n\nKlik di sini buat nonton: https://t.co/HP3Whgw5jH Makasih buat yg reply. Kalau cafe yg sepi buat nulis di Nusa Dua, Bali dmn ya? Tempat nongkrong yg sepi, enak, di Seminyak, Bali buat nulis dmn ya? Karakter terbaru gue di Path of Exile. Dua hari main di league Harbringer. Keren ga? 😎 https://t.co/3rz5ja2hny Video baru! Battle rap antara gue, Young Lex, Ernest Prakasa, dan Sheryl Sheinafia: https://t.co/jL1ad9hUxR Keren.. https://t.co/ZyOnXECan0 Tebak ini apa.. 😂 https://t.co/efe206Zo33 Setelah review mobil2 mewah, selanjutnya di YouTube gue akan review dan test drive kendaraan yg gak kalah keren: Odong-odong. Coming soon! https://t.co/Xu0sO96Af1 Abis liat hasil profil di https://t.co/v7WihcKfjh, keren nih jdnya: https://t.co/66Edpe4GQv 😁 RT @babecabiita: yuk ah bsok kita kawal! https://t.co/HJQAWLnqQJ Masih anget! Video YouTube baru! Diajak jalan2 naik Koenigsegg dan helikopter sama Raffi Ahmad: https://t.co/HP3Whgw5jH Review #Overdrive: buat kalian yg kangen nonton Fast and Furious, bisa coba nonton film ini. Gak kalah serunya! CC: @cinema21 Review #Overdrive: film ini fun banget, ada twistnya, kejar2an mobilnya jg dikoreografi dgn baik. Seru buat nonton rame2. CC: @cinema21 Review #Overdrive: ini film Prancis tapi dgn gaya Hollywood. Bercerita tentang 2 pencuri mobil dan keseruan aksi mereka. CC: @cinema21 Pilihan nonton di minggu kali ini di @cinema21 Overdrive film yg ada action, romance nya juga film yg komplit! Kebut2annya jg seru! Besok video YouTube baru naik jam 12 siang, buat yg mau ngintip dari pagi naik Koenigsegg, helikopter, tapi ujung2nya naik taksi.. 😂 https://t.co/cIThKP7sQF Kolaborasi hari Minggu.. https://t.co/Czl72sAmXL Nanti malam jam 19.00 WIB akan ada live main game horror di Youtube gue. Tungguin di sini: https://t.co/16NXSQkY54 Nemu foto ini bareng bokap (gue yg digendong). https://t.co/0NANdzVexW @PanduWinoto13 Nyokap gue mau beli followers dari lo nih serius @PanduWinoto13 lagi sama nyokap nih muji2 lo katanya ngemsinya bagus ckckckck Kayaknya gue diboongin nih. https://t.co/dleguByKGD Kalo mau jual VGA GTX 980 bekas, pasarannya di harga berapa ya? Baca kasus yg melanda temen gue: https://t.co/dSpvViTOHV \n\nDukung dgn tagar #achogaksalah #stoppidanakankonsumen Video baru! Komedian mengerjakan tes CPNS. Tonton di sini: https://t.co/bV1mGfzkNv Koenigsegg, helikopter, dan premiere. Hari Senin di YouTube gue! https://t.co/uWCob1e8p3 Review mobil Koenisegg sama kak Raffi plus yg lain2 akan diupload hari Senin (kalau editing kelar) di yhoochoob gue. Tungguin aja yak.. 😁 @DitjenPajakRI Siap kak 😁 Nih lagi nabung buat beli Hot Wheels. https://t.co/3UWJ3lMI8S Kak Babe makin lucu ya.. https://t.co/7BJHsec8NR @hotradero @DitjenPajakRI Bang.. 😂 Main ke rumah kak Raffi lagi. Eh malah ada mobil Koenigsegg, lebih mahal dari Lamborgini + Rolls-Royce digabung nih.. 😂 https://t.co/s8S2TPONuZ JENG JENG JENG!! https://t.co/8PcPnrTJ0o Akhirnya ketemu kak Prilly kembali.. https://t.co/wotg3591oS Review #Valerian and The City of a Thousand Planets: film ini cocok buat penggemar film sci-fi dgn setting eksotik! cc: @cinema21 Review #Valerian and The City of a Thousand Planets: yg suka film dgn visual2 cantik bakal dimanjakan banget oleh film ini. cc: @cinema21 Review #Valerian and The City of a Thousand Planets: film ini diadaptasi dari komik sci-fi berjudul Valerian and Laurine. cc: @cinema21 Pilihan nonton di @cinema21 untuk minggu ini adalah #Valerian and The City of a Thousand Planets! Film Sci Fi seru arahan Luc Besson! Gak tega.. https://t.co/e7VgEeIhxV Dua Minggu lebih masih nangkring di trending. Bikin video lagi kali ya sama kak @Raffi? https://t.co/B9iW9CDwJd \"Eta terangkanlah\" itu maksudnya gmn sih? Yoih. FF XIV gue tanker jd Paladin, Overwatch juga tank pake Winston. https://t.co/2DxdYIKsmE Ngetank tuh gini gaes.. 😎 https://t.co/R2JzIPalF2 Bentar lagi iseng2 ngetes streaming main Arena of Valor: https://t.co/mfFPfjR7dz Pengen pelihara burung telanjang ini. Cakep banget. 😍 https://t.co/YxP7Utn2jM Video baru! Adu plesetan dengan juara standup comedy. Tonton di sini: https://t.co/qn1TKOa4j1 @ShaniBudi Ayok boleh. Gue malem ini dan besok sore free. Ngopi di deket2 Kemang aja. DM atau WA kalau mau yak @ShaniBudi Hahaha siapp kalo mau tau formula yg gue pake untuk Miko WA aja ya, sembari ngopi jg ayok @ShaniBudi Kenapa gak nanya yg buat aja Shan.. 😂 Tiap pulang ke rumah, kalo ada suara mobil gue kucing2 siap menyambut.. 😂 https://t.co/1h0L2qUKUo @imanlagi Iya sih. Ya udah lah ya AP Diver aja pake tang buckle jg kan 😂 @imanlagi Ganteng jg begitu. Kok ga pake clasp yg asli? Hari ini jam 10 gue bakal livestreaming main PUBG. Siap2 tonton di sini: https://t.co/59FUKB6NaU Udah lama juga gak streaming PUBG. Sikat nih? Komik Spider-Man-esque favorit gue justru Spider-Gwen, fresh story, reimagining menarik dari Gwen Stacy. Dat char design.. https://t.co/Q5t7vHjGVy Kelar untuk hari ini with Arafah! https://t.co/nhKKjO5DtX Ngejuri SUCA 3 hari ini ditemani Charlie Brown. https://t.co/imniakNeN0 Potret seorang penulis beserta dua orang om-om saat hendak jalan2.. https://t.co/BwXbBhhEQV Potret seorang penulis yang terjebak diantara dua om-om ibukota. https://t.co/o8YjELaCNK Kegiatan seminggu ini: siang menulis, malem bunuh2in monster di Path of Exile. 😂 https://t.co/jDgZM5RAlA Makan durennya Ucok. https://t.co/yefUyfj5J8 Ada twitwar gaes.. https://t.co/tBNQXQl0bL Udah 10 ribu votes masih imbang aja.. 😂 https://t.co/nhjtNM4sWc Enakan mana.. Video baru! Belajar naik motor, usaha minjem motor2 kerennya Gading Marten: https://t.co/wrhlKWPRcs Akhirnya Minggu depan liburan ke Bali lagi. Nginep dimana ya yg enak? Review #WishUpon: film ini dibuat dari yg membuat Annabelle, jadi penggemar  2 film horror tersebut bisa jadikan film ini pilihan. @cinema21 Review #WishUpon: buat penggemar horor yg tidak menyukai adegan-adegan penuh darah, film ini aman ditonton, tetap tegang. Cc: @cinema21 Review #WishUpon: bercerita ttg kotak ajaib yg akan mengabulkan 7 permintaan pemiliknya yang akan di bayar dengan darah. cc:@cinema21 Pilihan film buat weekend ini di @cinema21 adalah #wishupon. Film horror yang unik, garapan sutrada John R Leonetti. Lima menit lagi live di YouTube-nya Google Indonesia. Klik di sini untuk nonton: https://t.co/HkF6VIL2ig Kolaborasi bersama Namewee. Tonton di sini: https://t.co/HKFIdShag6 Tebak gue dimana.. https://t.co/B4HQKAYpOg Nanti 6 sore gue bakal livestreaming di channel YouTube Google Indonesia ngomongin kreativitas. Tandain linknya: https://t.co/eBgE4uwvrX RT @hifdzikhoir: Kemarin bikin video sama bang @radityadika :D https://t.co/u0dMlaHQ1d https://t.co/aCN9SHQ7mF Nongkrong. https://t.co/fdRThG9qBP Belum 24 jam, video baru gue ttg Lamborghini vs Rolls-Royce udah masuk trending nomer 4 di Indonesia. Tonton di: https://t.co/WvqTPEffOY Kucing gila.. https://t.co/bPS8ql2DF0 Video baru! Lamborghini vs Rolls-Royce bagusan mana? Tonton di sini: https://t.co/WvqTPEwQGw Cafe buat nongkrong mana yg enak di kawasan Kemang yg Wifi-nya kenceng ya? Dari kemarin ngopi pada jelek2 amat Wifi-nya.. #fakirkoneksi Dua hari tembus sejuta views! Klik di sini untuk menonton unboxing mobil idaman gue: https://t.co/ty8MP3YXMT Dua video baru! Main werewolf bareng YouTubers: https://t.co/xwBQL7RzyY dan https://t.co/17x546eFgh Potret seorang penulis yang dietnya mulai menunjukkan hasil. https://t.co/UObqXkRqft Nulis di cafe mana ya yg enak di daerah Kemang/Cipete/Cilandak? Enakan naik Lamborghini atau Rolls Royce? Tungguin videonya di YouTube gue. 😁 https://t.co/YP9w8eHXSy Main ke rumah kak Raffi. Dateng2 diajak naik Lamborghini.. 😂 https://t.co/iipoQoOaru Ada yg kirim email ilustrasi kucing gue, si Bake. Suka. 😍 https://t.co/lVI16qaWLu Kelar dari acara #CornettoPopAwards di SCTV. seru banget. Warna warni.... tadi pada nonton gak mblo? Kerjaan hari ini.. 😁 https://t.co/8ug5PtHYnG Video unboxing mobil masuk trending YouTube. Tonton di sini: https://t.co/ty8MP3YXMT @PanduWinoto13 Lagi??? Siapa yg kangen Morganissa? https://t.co/qZVlptUp6K Dua laki2 dewasa sedang bersenang2.. https://t.co/75fnH1jreU ...Terus dia ceramahin gue soal pemalsuan identitas. Katanya \"bisa kena UU ITE bro\" 😭 Kemarin main game online pake nickname Raditya Dika. Ada org nanya \"Ini Raditya Dika beneran?\" Gue jawab \"Iya\". Dia gak percaya.. Bikin gak nih? https://t.co/rb4vBT0NJU Video temen2 komedian gue memanggil arwah penasaran masuk trending YouTube. Tonton di sini: https://t.co/NeqZKNPEuF Akhirnya kembali ke bangku sutradara. Buat ngerjain iklan kece ini. 😁 https://t.co/sNf9uGr2IA Shooting iklan hari ini. Gue jadi anak sound. 😂 https://t.co/7i7CWtbtHh Hasil main malam ini. #supportforlyfe https://t.co/S0esiNMbwB Main ke almamater.. https://t.co/BvpWmxV8H6 Gue dan temen2 standup komedian memanggil arwah penasaran buat ditanya2in. Tonton di sini: https://t.co/NeqZKNPEuF BFF. https://t.co/Dvelyr6hSc Kalau baru pacaran jangan sering2 foto berdua, nanti pas putus repot ngapusinnya. Writer on duty. https://t.co/pFwd3odUcn Kalo kayak gini tau lah siapa yg bikin kalah (siapa tuh yg paling bawah).. https://t.co/lI7B2wxIb0 Nongkrong2 hari ini. Ada kak Rafathar jg.. 😍 https://t.co/hT33gKIdZV Wajah gue menggambarkan semuanya.. https://t.co/VEZScihNJ9 Video baru! Kolaborasi paling berbahaya! Belajar makan pedes with Ria SW: https://t.co/R4EMZsBr1x Berapa banyak buku baru yang kamu beli dalam sebulan terakhir? Draw My Life gue dengan gambar terbaik satu YouTube ini masuk trending, silakan tonton di sini: https://t.co/vV77GFAOaL Akhir2 ini lagi seneng nulis cerita dengan gaya old school gini. 😂 https://t.co/weerxLgW9s Happy birthday yg ke 6, komunitas @StandUpIndo! https://t.co/5t5ZpIexXB @pandji @StandUpIndo Ini foto kapan ya? 😂 Inilah Draw My Life gue, dengan gambar paling bagus dalam sejarah YouTube: https://t.co/vV77GFAOaL RT @CNNIDdaily: Ketika @pandji, @arafahrianti02, dan @PanduWinoto13 menjawab soal Ujian Nasional tingkat SD dari @radityadika https://t.co/… Baru sampai rumah eh ada mobil ini di garasi. Makasih MINI, mari kita cobain mobilnya. 😂 https://t.co/RjpWz4jyU4 Meeting.. https://t.co/rGmL0ildWh Temen makan hari ini. Pedas!!!🔥🔥🔥 https://t.co/Gc1VsXuigS @gilbhas Sekarang tetanggaan 😂 https://t.co/LD0uH5Q4SM Polling! Kalian lebih tertarik melihat komedian mengerjakan soal ujian apa? KERJA WOI JANGAN TIDUR DOANG! LO PIKIR WHISKAS TURUN DARI LANGIT?! https://t.co/jPn9bp0eot Video temen2 standup comedian ngejawabin soal UN SD masuk trending. Tonton di sini: https://t.co/FoMFUwhIA3 Video baru! Komedian2 menjawab soal ujian nasional sekolah dasar. Tonton di sini: https://t.co/FoMFUwhIA3 Cap cip cup.. https://t.co/W86Ki8spgX Niatnya becanda malah beneran.. https://t.co/Tu2Psra2Nk Baru saja diupload! Bloopers dari Tragedi Squishy Berhantu: https://t.co/k07TjCImW9 Tato yg paling serem.. https://t.co/O6Jd1V2DgA Banget. https://t.co/xefMRRAlEc Game favorit gue saat ini. Sumpah seru banget. Kayak Dark Souls + Casltevania. Gue bakal bikinin video mainnya bareng adek gue. #bukanpromo https://t.co/nGJ4flsIgu Ini dia, Tragedi Squishy Berhantu part 5: https://t.co/xTaz3JisBc Tragedi Squishy Berhantu part 5 (part terakhir) tayang besok. Nonton dulu yg part 4: https://t.co/1TW2seghmO Nah, Cornetto lagi ada acara seru!Cornetto Pop Awards lihat dan dukung artis favorite di @CornettoID atau di website https://t.co/JKtmm7UTHx Hmmmm.. https://t.co/1oY4XhOayX Lagi mau mulai hobi berkebun. Cuma kerja banget nih gue. 😂 Mulai makan bersih lagi. https://t.co/lfu6CIrNTU @PanduWinoto13 Lo carry dah gue mah support aja pake Payna @PanduWinoto13 Pas shooting squishy mabar mobile arena yuk Ekspresi waktu udah lama gebet orang gak taunya pas Lebaran ketemu ternyata masih satu saudara. https://t.co/1zKIRR1gc0 TIDUR AJA GAK BECUS!! https://t.co/OqY6LEMmzF Dua ekor kucing dibego2in manusia.. https://t.co/pnMrugwx5v Coba tebak. Mana Anggi mana Ingga? https://t.co/snSZq0fQCS POPCORN MANIA! MANTAPPPPHHHH!!! https://t.co/I8dVNup22N Ingga's shopping haul. https://t.co/8jYY1Ws8Oo Turis. https://t.co/RoP7C85PBR 😢😢😢 https://t.co/1Ql8a1jVN2 Anggi X Edgar https://t.co/7wQHI00qDu Yang lain pada main, kita mah mager.. https://t.co/b0YYx7BLcu Emesh. https://t.co/9cNr5tGvlg Lagi berkunjung ke taman labu milik Yayoi Kusama.. https://t.co/IscND1rHc9 HOTEL APA NIH?! KOK GELAP!!! https://t.co/yQk3ALaQg3 The Nasutions. https://t.co/d6e4olGJh4 Nyobain Tian Tian Chicken Rice yang dapet Michellin star. Enak banget. https://t.co/MnGPbyi4oz RT @trendinaliaID: 📺 This video from @radityadika is trending today (20th) on YouTube Indonesia https://t.co/1nzBFw8lyt Minus adik yg sengaja kita tinggal.. 😂 https://t.co/FYJpqhJWko Iiiiii... https://t.co/QykyTZQfNB Nice hat, dad. 😂 https://t.co/HK7jkJLd5n Snoopy! https://t.co/cViPYcR0vH Singapura digoyang! https://t.co/2r7eGkGXh8 Masih trending di YouTube. Mari yg belom nonton TRAGEDI SQUISHY BERHANTU PART 4: https://t.co/1TW2seghmO Adik2.. https://t.co/G0A3vdeiPV Teman traveling kali ini.. https://t.co/3v8gkOj5nx Siap traveling. 😎 https://t.co/Ug3SdSDADx Geer amat nih kucing.. https://t.co/KxuRJZkMDa Video baru! Bosen di kota, gue jadi petani: https://t.co/OYzHFeA1mU Video baru! Duel sama adek gue yg cewek di Tekken 7: https://t.co/gKNTOzK40h Woohoo. MVP my friend. 😎 https://t.co/vdlYEcz1ks @PanduWinoto13 Katanya main mobile arena Eid Mubarak! https://t.co/Y1fg6qAsfy Video baru! Gue melakukan mind reading ke adik saat lebaran: https://t.co/jO9dFKOlvg Lebaran mager. 😅 Makanan pertama di rumah nyokap. 😍 https://t.co/iqEoEG2k3F Sedang mencium Putri Salju agar dia segera bangun dari tidurnya.. https://t.co/6lnYQE4ypv Sekali duduk abis segini.. https://t.co/bSaEDyCg7D Lagi pada main catur.. https://t.co/hcU6C6kHi8 Boomerang with nenek.. https://t.co/qoFdNTnEzq Yang paling kiri baru lulus SIMAK UI masuk Geografi UI. 😍 https://t.co/eBcug3CgE1 Family day out! https://t.co/YHuxPSgd82 Tragedi Squishy Berhantu part 4 sudah keluar. Nonton di sini: https://t.co/1TW2seghmO Tragedy Squishy Berhantu part 4 sedang diedit. Besok diupload di channel gue! https://t.co/OQF7pQo2LZ Video baru! Waktu mampir ke premiere filmnya Kak BCL: https://t.co/bAOBWAVYdI Pengen gak punya kucing pinter gini? https://t.co/U2ZJ7HXzEs Si Bake lagi diare terus. 😓 https://t.co/FFdddyK6w6 Jadi, bumi itu.. Video baru! Gue kolab sama Youtuber terbesar di Malaysia: https://t.co/r5N7j5HWvV The great @PanduWinoto13.. https://t.co/bjfG11QD58 Brb nangis gaes. https://t.co/C6gcl0lRI2 Baru dapet laptop seharga 4 motor. Ini review gue: https://t.co/Z38KaunRa1 Lagi shooting Tragedi Squishy Berhantu part 4. Segera di YouTube gue! https://t.co/tB6DMy1Jjy Kalian kalau nonton YouTube pake apa? Foto sama kakak kelas pas di SMA 70. 😂 https://t.co/wjzpujzdDd Maksudnya \"wkwkwk land\" itu apa ya? Video baru! Inilah master fidget spinner dari Indonesia: https://t.co/RUPbPsLpuq Meramu cerita.. https://t.co/Gdx4qNbXaS Tau Pepekomik di UC News app? Yg suka bikin komik buruan deh gabung dan bikin komik original lo di UC News!  https://t.co/cMnzIADivr https://t.co/sNRN9u7Cfa Belajar dan belajar terus.. https://t.co/yhW6mz5mwN Pengen botak segini lagi kayak taun lalu. Yes/no? https://t.co/7BcYSUFFvT Video baru! Membahas mitos dan fakta soal mata. Bener gak minum jus wortel ngurangin minus: https://t.co/yfYf6uRUMl Review #47metersdown: secara keseluruhan menghibur dan menegangkan, bbrp kali duduk sampai ujung kursi karena seru banget! cc: @cinema21 Review #47metersdown: buat yg kangen sama aktingnya Mandy Moore bisa nonton film ini. Claire Holt, jd adiknya, cantik bgt.  cc: @cinema21 Review #47metersdown: bercerita ttg 2 orang saudara lg liburan, berenang di kandang untuk melihat hiu, jatuh ke dasar laut. cc: @cinema21 Baby setan vs baby groot. https://t.co/mXHPKL59w9 Film pililhan weekend ini di @cinema21 adalah #47metersdown. Baru aja nonton kemarin dan menegangkan banget! Wajib nonton sebelom lebaran! Nongkrong dulu cuy.. https://t.co/4bNAAJwaiF Udah nonton semuanya belom? Part 4 sebentar lagi akan dibuat! https://t.co/LxcTk7ohaS Lagi mager di rumah. Iseng2 buka laptop, eh sejam kemudian jadi ini.. 😂 https://t.co/KGAnRSy51M Buat dessert sehat. Plain Greek yogurt + berry2an. https://t.co/22H8hWJwlh Nyoba bikin resep sendiri: Kari Lentil Korea. Enak gak ya. 😂 https://t.co/iGocaJw0bC Belanja cemilan Korea buat temen nulis nanti malem. 😍 https://t.co/AgbgKdPoCf Sebelum dan sesudah diet + olahraga. Turun 6 kg. 😁 https://t.co/4mQpYjsy9R Tragedi Squishy Berhantu akan berakhir di part 5. Pastikan kalian ikuti terus ceritanya di https://t.co/oteZCfYi2b. Shabu2 with gochujang soup.. 😍 https://t.co/EOtY2HuHvn Tragedi Squishy Berhantu part 3 sudah keluar. Tonton di sini: https://t.co/2SGW2XGLfb Kok bisa ya @Herjuno7Ali tetep tidur nyenyak, padahal istrinya @LunaMaya26 ketakutan gitu? Gue aja nonton videonya, engga yakin bisa tidur.. https://t.co/sPDdzUSGoU Tragedy squishy berhantu part 3. Tinggal di-render lalu upload deh. Siap2 di YouTube gue! https://t.co/XgaEvTX5oc Nanti malam Tragedi Squishy Berhantu part 3 akan keluar. Nih tonton part 2 biar nyambung: https://t.co/du2CPNjZ4X Siap2 kerja.. https://t.co/wqy6PPDst5 Mau jual lensa Canon EF 24-70 L USM kesayangan nih. Cuma 9.2 jt aja. Yg minat hubungi 082210298466 (Puput). https://t.co/IBELK0V5vS Video baru! Youtubers Hongkong belajar dangdutan: https://t.co/ym5Or2B4Ir Om Slamet Rahardjo main ke rumah. 😅 https://t.co/bn4Ko9WoRE Hari ini ke dokter gigi anak. Biar imut. https://t.co/TlgjC5lhJK Sirloin steak, green beans, showered with butter garlic. 😍 https://t.co/c7mr4zz2zk RIP Julia Perez. One of the humblest celebrities I personally know. You will be missed. Video baru! YouTubers Taiwan mencoba menirukan artis2 Indonesia (dan gagal total): https://t.co/mboBF2FqvV Shooting Tragedi Squishy Berhantu part 3. Coming soon! https://t.co/eb7HIKPpYh GWS T.O.P BIGBANG Nulis skenario pindah ke WriterDuet dari FinalDraft. Lebih ringan, lebih jarang error, dan mudah nulis secara kolaboratif.. #bukansponsor Teknik fidget spinner tingkat tinggi: fidget spinner-nya diem aja, orangnya yg muter. https://t.co/a7UVvSbjGi Cara bermain slime yg salah.. https://t.co/4zaL2CFQy4 Gini toh cara mainnya.. https://t.co/Xp99YwEbNa Ini gimana sih.. https://t.co/LXXXrrpCLK Oh iya HDD lupa ditulis. 1T SSD. https://t.co/knDifTdOTR Beneran nih? 😂 https://t.co/pJOJSKRDyq Kalo punya komputer dengan spek begini, jual brp harga yg wajar? https://t.co/myNJiIwNxr VGA GTX980 second berapaan ya sekarang harganya? Mau jual punya gue nih.. 😅 Boom! https://t.co/WyUy81xIxP Mantan atau setan nih? Jadi film bioskop, MANTAN menurut gue lebih horor dr film setan. Nih trailernya: https://t.co/F1VvVkB2kE https://t.co/rbx1Rt2RJv Main RPG baru pake ROG baru. Ada yg tau ini game apa? https://t.co/NFhjGeW0YD Foto ini akan membuat banyak gamers kesal.. https://t.co/hh7lSfhn9m Oke. Besok gue ganti provider internet. Makasih semuanya yg udah kasih saran. 😆 Ganti jd apa? https://t.co/XozFSb3z1i Iya nih padahal gue langganan paket @firstmediacares yg paling kenceng. Diantara dua ini mana yg mendingan? https://t.co/AwVbKnN5DV Biznet banyak yg rekomendasiin, tapi kayaknya gak nyampe rumah gue deh. https://t.co/2JB465apnc Kalau gini jadi gak produktif mau kerja, upload Youtube, atau streaming. Padahal bayar @FirstMediaCares full, dan tepat waktu tiap bulan.. Barusan nelp @FirstMediaCares, katanya daerah gue gangguan, perbaikannya antara 8 sampai 12 jam. Minggu lalu pemeliharaan jg berjam2 mati.. Apa yg bagus ya buat daerah Ampera/Kemang? https://t.co/REQsNjyst3 RT @dissydc: @radityadika @FirstMediaCares Aku di Tanjung Barat, koneksinya juga gangguan mulu. Yang di daerah Ampera/Kemang koneksi @FirstMediaCares nya juga keganggu mulu gak sih? Apa mendingan pindah provider aja ya. Kerja jd ribet.. Sebelom ke Bangkok @FirstMediaCares di rumah kena gangguan ga bs dipakai. Ini baru pulang ke rmh, kena gangguan lagi ga bisa dipakai. Piye.. Kucing tercantik di Jakarta Selatan. https://t.co/WOJtVAsO9a Ketindihan. https://t.co/9TuhtiPjGF Video YouTube baru udah keluar! Tentang pengalaman dihantui di Thailand: https://t.co/1X6OpfaANB Berikutnya. 😆 https://t.co/a72XEfQ19y Main werewolf di Bangkok. Auuuuuu.. https://t.co/M0wZbQu3wT Baru selesai menulis skenario TEAGEDI SQUISHY BERHANTU PART 3. Tunggu di YouTube gue! 😂 https://t.co/53YGqvDf29 RT @detikcom: Seram! Raditya Dika Alami Kejadian Aneh di Hotel Thailand https://t.co/AVBblWgQVN via @detikhot https://t.co/cVZOsoYlDc いただきます! https://t.co/poLG0xB9As Sayang amat.. 😅 https://t.co/FqQVvopwB1 Duh.. https://t.co/ALf8unbpdO Ekspresi nungguin Rain manggung. https://t.co/zWgK4yR4WL Refleksi. https://t.co/Y6xPHATIAf Money money money @boywilliam17!!! https://t.co/5MFgSzC3Q2 Tembus 2,4 jt subscribers! Yg belom subscribe klik di sini: https://t.co/biRNkw62cw https://t.co/CYAd8n5yMg Squishy terkecil di dunia? https://t.co/4jkKYdnaAT Trio kwek2. https://t.co/E2UjRaLIbx Viralfest! https://t.co/l8lx0CVCwc Uh.. https://t.co/Fm2jBFmCej Kamar di hotel gue tiba2 speaker phone nyala sendiri dan mencet2 nomer sendiri.. https://t.co/DP3GmeVIDh RT @IndaaKhairani: Yakin bgt pasti abg salah satunyaa @radityadika 😂 https://t.co/3UpQWztIK0 RT @webtvasia_id: @radityadika on stage di raise of Asia forum!! #vfa2017 https://t.co/9cSzwrtJ5r Abis jadi narasumber bareng orang2 kece dari Asia lainnya untuk segmen Influencer Marketing. https://t.co/TAM4VBux5L Sorry ya mblo.. https://t.co/IDrHQLArwc Pagi! https://t.co/mk6xtU9TO7 Tragedi Squishy Berhantu episode 1 hampir 1 juta views. Mari yg belom nonton: https://t.co/BMORXRmPEa Video Youtube baru dari seri Buka Yuk, talkshow  sambil berbuka puasa... https://t.co/qbDTJnmJEd Sabrina, kenapa kamu begitu sama @lunamaya ?  @hitmakestudios #thedoll2 #hitmakerstudios https://t.co/Odjo9JKIJ0 Nonton sendirian bgt nih.. 😂 https://t.co/X7N1mSSooe Vlog di Beijing udah keluar! Mari ditonton: https://t.co/8sbhqWr0He Mandi dulu ya gaes.. https://t.co/MOn5yF5pZZ Nyobain gitarnya mas @salmanaristo. 😂 https://t.co/wWPE1i6F5x Dikasih laptop mahadewa ASUS ROG G701VIK. Speknya: Intel Core i7  7820HK. 64GB RAM. 4K Display. NVIDIA GeForce GTX 1080. Mangstab! https://t.co/rXUIsixrEq Sehari tembus 400 ribu views! Mari yg belom nonton TRAGEDI SQUISHY BERHANTU PART 2: https://t.co/du2CPNjZ4X Jam berapa ya sekarang? Kok gelap ya? https://t.co/qSgHyThdCC Baru kelar jadi pembicara di Beijing. Thanks for having me! 😆 https://t.co/vtKIpFjwKB Ngabuburit di Beijing. https://t.co/2cvkh1DfjC Baru saja diupload! TRAGEDI SQUISHY BERHANTU PART 2, tonton di sini: https://t.co/du2CPNjZ4X TRAGEDY SQUISHY BERHANTU PART 2 akan diupload hari ini di YouTube gue. Nih tonton yg PART 1 biar nanti nyambung: https://t.co/BMORXRmPEa Soon di YouTube gue.. https://t.co/kZqNOkuPmw Yah namanya juga penulis, jauh2 ke Beijing kerja juga. 😂 https://t.co/CBmpxZgIg1 The bebek of the Peking. https://t.co/KzIHdyEaVK Bebek terenak dalam sejarah perbebekan. https://t.co/L4VDEjXmyc Nghaboeboereet. https://t.co/uADKrG5wW4 Hmmmmm.. https://t.co/x0fahhyh6h Mari jalan2 di Beijing.. https://t.co/EoeJsV5xue Selamat pagi dari Beijing. https://t.co/VsPShGpXHm Siap2 ke Beijing. Bakal menghabiskan puasa hari pertama di sana. 😆 https://t.co/O35Mzti2KK Video YouTube baru. Buat kalian yang males olahraga: https://t.co/eKP8mxdhF5 Masak lagi. Ada yg mau tau resepnya gak? 😅 https://t.co/FJg1q2YMm0 Inspirasi.. https://t.co/LvPOa9l93a Shooting TRAGEDY SQUISHY BERHANTU PART 2. Tungguin di YouTube gue! https://t.co/YNzmtBYuQQ Potret seorang penulis yang sedang kebingungan di suatu sore. https://t.co/hCnDgPQhkG Latihan ini berjudul \"BANGUN TIDUR MATIIN ALARM\". Melatih otot tangan. https://t.co/0WZOxIRsia Memulai hari dengan bedakan lagi.. https://t.co/6tTbUUDFPW Kerjaan hari ini.. https://t.co/clsrViWnwe Jual cepat lensa Sony FE 24-70mm F/4 ZA OSS + box. 10 jt aja, barunya 16 jtan. Yg minat SMS (jgn telpon) ke 082210298466 (Puput). https://t.co/Z2TUQhJiyK Video YouTube baru. Sebuah curahan hati: https://t.co/S9oPtOo6x9 Memulai hari dengan bedakan.. https://t.co/zSLhhbMMIe Kenal si @benakribo dari zaman dia SMA. Sekarang pas ketemu dateng2 bawa ini.. https://t.co/1638HYWTf5 Latihan ini bernama SELFIE DULU CYIN. Melatih otot bahu, perut samping, tangan, bibir, dengan movement lateral raise. https://t.co/jcu38vEjQf Meeting pagi ini. https://t.co/tZl0PvVPGe Menang CREATIVE AND INNOVATIVE PERSON OF THE YEAR. Makasih semuanya! 😆 https://t.co/pnV4Bw3olj Cheat day. https://t.co/3DaO3a4f7i Kak Luna Maya main ke rumah. Ini video obrolan kami: https://t.co/atjYNOGFQl Kuki pagi ini. https://t.co/Gubcr9Mdvr Dikasih kamera film Canon C100 Mark II dari Canon Indonesia. Makasih. Bikin unboxingnya ah.. 😂 https://t.co/E2eoKNF3Sl Kisah horror \"TRAGEDI SQUISHY BERHANTU\" bikinan gue masuk trending YouTube. Mari nonton yg belom: https://t.co/BMORXRmPEa Towel2.. https://t.co/VHZWj9sw7R Video baru. Sebuah film pendek horror yg akan membuatmu merinding ketakutan: https://t.co/BMORXRmPEa Video film pendek horror masih gue private nih. Dipublish kapan ya enaknya? Hmmm.. https://t.co/TVaO3g9ZI8 Natto lagi.. https://t.co/7zfGYKPOCl Besok. Akan ada film pendek horror iseng2 di https://t.co/oteZCfYi2b! https://t.co/CyQdlkLl09 Ada yg gak boleh keluar.. https://t.co/BVFOaucVAk Selesai talkshow ttg creative enterpreneurship di Semarang. Thanks yg udah datang! https://t.co/n5rN3GRHcF Ketemuan sama kak Merry Riana.. https://t.co/5ZAwMqsalf Lecep Ub Omus. https://t.co/e6MM7RuHWY Orang ganteng sama cantik biasanya ngetwit gini.. https://t.co/XyLC3Bfz8F Udah kayak Gong Yoo belom? https://t.co/FdVYzbrXUz Kangen main ini. Yang tau pasti tua. 😂 https://t.co/TYQcNCbuWa Kucing paling pintar di Jakarta Selatan. https://t.co/VDowUynbcD Masak hari ini.. https://t.co/8ttQ9i01iP Buat yg baru lulus SMA, nanya dong ujian masuk perguruan tinggi negeri udah lewat apa belom ya? Nyiapin Bul Kalbi marinade buat makan besok pagi.. https://t.co/MxhCXXS6YD Happy birthday papskipapap! https://t.co/5j9fdahQx3 Wadawwww.. 😂 https://t.co/d3A3sMBWtk Today is #VivoV5sPerfectDay! Tunggu @PrillyBie akan hadir hari ini untuk memeriahkan penjualan Vivo V5s! @vivo_indonesia https://t.co/GpqBsBOgdR Bak Buk Bak.. https://t.co/e9kFx7eXMy Malam minggu nonton MMA! https://t.co/DtTeaAmmjp Apa yang terjadi kalau seorang komedian lagi gabut? Yah kira2 beginilah: https://t.co/bFDIVB7NJy Latihan ini bernama \"NAKUTIN ANAK KECIL\". Memperkuat otot lengan, bahu, mata, dan lidah. https://t.co/TAqNjyXlZm Ada apa antara Sabrina sama @lunamaya26? The Doll 2, bulan Juli 2017!!! @hitmakestudios nonton di youtube ya: https://t.co/6UCFeo2hcW https://t.co/5LEHDSWSdo Yah kurusan lah ya.. 😂 https://t.co/l5d0S1d3Ch Brokoli dan telur. Masih dalam edisi diet.. https://t.co/7nyETJKBiX Video YouTube baru. Abis beli kamera vlog baru, menurut kalian bagusan mana: https://t.co/eWFxiHmTTw RT @Starvisionplus: Terima kasih semuanya 🙏🏼 #CriticalEleven https://t.co/px4epk86bY https://t.co/zbBJRoj9yM Video baru! Nongkrong sama kakak2 kece ngobrolin film Critical Eleven: https://t.co/zJLT00s3ND Potret seorang penulis ibu kota di siang hari. https://t.co/hkMaBW5ZvY Latihan ini bernama \"CIPIKA CIPIKI KETEMU ARTIS PAS PREMIERE FILM\". Berguna untuk melatih perut samping (oblique) dan otot leher (trapezius) https://t.co/CgPsydYG8C Lagi pillow talk sama squishy dari kak Ria Ricis. Enak jg mencet2in gini.. 😂😂😂 https://t.co/JJskypN92Y Video YouTube baru! Main squishy sama Ria Ricis: https://t.co/LcbtBYUmlm Berasep gaes.. https://t.co/uXxXlJvvFX Dan inilah rigging buat kamera vlog baru. 😆 https://t.co/VoGASSqeHS Jual kamera SONY RX 100 IV yg biasa gue pake buat vlog. Beli Februari 2016. Lepas 7 jt.  Yg mau SMS  (jgn telpon) ke 082210298466 (Puput). https://t.co/fiqn6d58YS Wih naik terus sekarang trending nomer 20an.. 😂 https://t.co/Zo959d1eXm Pagi. Udah ngopi belom? https://t.co/CmDdz7GUQG Video call sama adek2 yg kuliah di Brisbane. 😢 https://t.co/qIRGdm9nHi Kalo kumisan gini main squishy cocok gak? https://t.co/msKRuwPc6M Video YouTube baru! Main improvisasi komedi: https://t.co/5Pxls8xIYy Masakan selanjutnya.. https://t.co/lkj7jC2zul Mmmmm... Belut.. https://t.co/TRTPY0kJgi Sarapan hari ini adalah belut bakar. Ada yg mau? 😍 https://t.co/OOaUtxB7H9 Musik itu masalah selera, seperti gue lebih suka PRISTIN daripada 4L.. Akhirnya ngidam semalam terbayar. Nemu juga tape bakar. 😍 https://t.co/4s3RENI1ij Lagi pengen telor yg dicelupin ke teh, masakan ala Taiwan. Nyari di Jakarta dmn ya? https://t.co/P3LRHGOnuh Latihan ini untuk persiapan lomba makan kerupuk. https://t.co/kzxjA3NTlo Lagi di gym. Ada orang membungkuk di depan treadmill. Gue pikir lagi hormat sama treadmill gak taunya lagi pemanasan.. 😂 Wolverine bercakar sate taichan. https://t.co/zXY2cSjYCU Dadah brokolai. https://t.co/j9BysVQsKA Ngidam tape bakar nemunya pisang. Dimana sih tape bakar yg enak di jkt? 😣 https://t.co/tIrtOD3p7U RT @dinoyocineplex: Dari produser Sunil Soraya. Sebuah film karya @radityadika , THE GUYS masih tayang di Studio 2. Jam: 14:40 - 19:10 @sor… Buat yg kangen sama Michael Douglas, juga ada doi di film #Unlocked. Bikin filmnya jadi lebih seru dan menegangkan. Cc: @cinema21 Film #Unlocked disutradarai oleh Michael Apted dan dibintangi oleh Noomi Repace. Membawa era jagoan cewek baru. cc: @cinema21 Review #Unlocked seorang perempuan cantik yg bekerja sebagai interogator CIA. Film soal mata2 yg berliku! cc:@cinema21 Buat yg udah nonton The Guys. Pilihan nonton di @cinema21 lainnya adalah #Unlocked film action yg seru. Cocok buat nemenin pas long weekend. Yg belom nonton film The Guys, habiskan hari ini ya! Sehabis jadi pembicara di Lampung.. https://t.co/aHVW0tw6Pg Video gue memilih Isyana atau Raisa baru aja masuk trending YouTube. Mari yg belom nonton: https://t.co/2yujcuVP1H Gue mendukung gerakan perpustakaan berjalan ini. Silakan yg mau ikut memberikan donasi: https://t.co/Yoq6Nm1N7J Isyana atau Raisa? Ini pilihan gue: https://t.co/2yujcuVP1H Ini.. apa.. sih.. https://t.co/37Jn4YY2TI Diet dimulai hari ini.. https://t.co/Jmp2OgAD5I RT @kangdana4: @radityadika JANGAN LUPA LATIHAN SENAM WAJAH BANG https://t.co/sMa84XPyM1 RT @kincirdotcom: Menjadi penulis, sutradara, dan aktor box office, ternyata @radityadika sudah menjalani pekerjaan sekaligus hobinya. http… RT @kincirdotcom: Meet our Very Influential Person of this month, @radityadika! Kali ini Radit mau bercerita tentang Kambing Jantan. https:… RT @kincirdotcom: Yuk cari tahu kapan @radityadika terakhir kali bikin kesel nyokapnya dan momen apa yang mengubah hidupnya. https://t.co/V… Latihan ini bernama \"DOMPET GUE MANA YA?!\" https://t.co/UsZ3t8GZMt RT @dinoyocineplex: Sebuah film terbaru karya @radityadika , THE GUYS hari ini masih tayang di Studio 2. Jam: 14:40 - 19:10 @sorayafilms ht… Video motivasi gue masuk trending. Mari yg belom nonton: https://t.co/GCTYk9Fxf1 Request lagu dulu.. https://t.co/adJfbU41Ma Dipencet keluar.. https://t.co/5t34TvBHsm Musuhan.. https://t.co/tLQmjwCBIc Jalan2 ke kota tua.. https://t.co/VicWGUSwPi Jumlah pelamar penulis freelance sudah menembus 1400 orang. Gue tutup dulu ya formnya. Makasih buat yg udah ikutan! Gue buka lowongan untuk menjadi penulis freelance gue. Yang tertarik, silakan isi tes berikut ini: https://t.co/u6ofoH9jr3 Gue lagi mencari penulis freelance untuk Youtube gue dan beberapa project lain. Ada yang tertarik? Mending makan naan atau baby kulcha gaes? https://t.co/VpamsTl2od RT @maharrizqithree: Memperingati hari Pink bang @radityadika. Kangen pink bang gua bang karena manja banget di vlog ya bang radit 😔we love… Video YouTube baru. Sebuah video motivasi: https://t.co/GCTYk9Fxf1 Potret seorang penulis yang sedang menggaruk hidung. https://t.co/3usgvmZhr7 Semakin sepasang kekasih mengumbar kemesraan di social media, semakin mereka cepat merasa saling bosan. Gulai kepala kakap. Cocok untuk kalian yang ingin makan sambil dipelototin. https://t.co/TLoHLfLLs6 Latihan ini berjudul \"Ngamuk Soalnya Gak Boleh Main PS Sama Mama\". https://t.co/ALrvOCea5e Ada zombie lepas di Jakarta Selatan gaes: https://t.co/TDMKjwc8EO Noodling.. https://t.co/QMr25OvFLb Biarpun tanggal muda, kalo makan harus hemat juga kayak gini.. https://t.co/PBaKLUQhJp Bantu jawab gaes.. https://t.co/rA8Hu3fYZc RT @bangtanitl: Raditya Dika,an Indonesian entertainer/writer/producer, tweeted #BTS &amp; recommended Indonesian food(when they visited for Wi… Video baru. Penuh dengan misteri. Jangan ditonton kalau kamu penakut: https://t.co/TDMKjvUxge Abis makan siang bareng kak Prilly. Rasio gue dimintain foto dengan kak Prilly dimintain foto adalah 2 banding 1. https://t.co/rY5xR6X8JI Kapan ya.. 😂 https://t.co/LmBlsQNI5d Makan duluuu.. https://t.co/Jddm5EQ0DO Rapper terhebat di Indonesia lagi main ke rumah gue. Cieee yg abis luluran pake apa tuh? https://t.co/JyV1lrmSAf Ini peliharaan apa majikan sih? https://t.co/bSE2kfkGnd Livestreaming malam Minggu, mari di tonton yg di rumah aja: https://t.co/hTC8f9IDlJ Menjelang long weekend, cafe sepi. Kayaknya semua pada liburan. Gue doang yg masih kerja. Nasib jadi penulis.. 😂 https://t.co/N7v1CMKcAj Latihan bela diri melawan orang yang gemesin. https://t.co/hV0QKOyEee Ini ubi ungu, bukan daging Tinky Winky.. https://t.co/qQTUn5EOZO Enteng jodoh nih.. https://t.co/nd0Sg3WieQ Hi @BTS_twt, don't forget to try martabak! #welcometoinabts RT @netmediatama: VOTE @radityadika sebagai Creative Innovative Person of The Year Indonesian Choice Awards 2017 dengan cara:\n\nTweet: #ICA_… Macang. https://t.co/7GLTAK7iZ3 Lagi di sebuah tempat yg bukan tempatnya anak rumahan banget.. 😣 Ngeong kencang dia jauh.. Ngeong pelan dia dekat.. Hiiiiiii.. https://t.co/OByCjNqMWN Mmmmm.. https://t.co/sHSdhOujFW VLOG di Okinawa Film Festival buat yg belom nonton: https://t.co/WbaTPt7k4K Ngerjain kucing.. https://t.co/EsZ8AMD0vi Kucing pinter.. https://t.co/1N5TyBdDE3 VLOG di Jepang sudah diupload. Tonton di https://t.co/oteZCfYi2b. https://t.co/Bl6eQGQvnn Latihan ini bernama \"Sekarat Menuju Pintu Keluar\". https://t.co/wUoPeCqd4G RT @riche_fernando: Bagus banget ka filmnya smpe terharu nntn nya dan juga banyak motivasi dari film ini 😊\nSukses selalu ya ka @radityadika… @ikanatassa Jadi laper pagi2.. Gue bgt. https://t.co/b2Ag21LBRJ Garuk garuk.. https://t.co/OeSp0qGpwZ @ZUL_Hasan Thanks for having me pak. Belajar banyak dari sharing2nya tadi 😁 Habiskan Minggu ini gaes! https://t.co/iZ8O8JVQ9w Makasih yg udah vote.. 😄 https://t.co/Oj10hSwclX Bekasi! https://t.co/zIdf7BtNwW VLOG Jepang sedang diedit gaes! https://t.co/P3uliOT69D Ihiy! Dapet penghargaan internasional World Intellectual Property Award untuk bidang kreativitas. Diserahkan via kementerian Hukum dan HAM. https://t.co/XfvhMEpH5x Di acara Kementerian Hukum dan HAM untuk menerima penghargaan internasional World Intellectual Property Award untuk bidang kreativitas.. https://t.co/RyScgk8Jtk MENANG PLAYERUNKNOWN'S BATTLEGROUND!!!! 😎 https://t.co/EX1t4zmsOU RT @Afifahnadiyah10: Bang @radityadika  filemnya keren banget, persahabatannya bikin mewek 😭 sambil ngakak😂 , sukses terus bang filemnya 👼💃… Landing di Jakarta langsung makan sama adik2.. https://t.co/p99seEwHRL Transit di Hongkong.. https://t.co/LKBiw6ac77 RT @Steve_Haeckal: Kocak dan mengharukan! Pesan soal persahabatan dan pengorbanan ngena banget :) 8/10 @radityadika https://t.co/cjvKe3FHOh RT @VIVAcoid: WOW film THE GUYS tembus 328,552 penonton dalam 6 hari! Hayoo ngaku siapa yang belum nonton? Buruan nonton di bioskop kesayan… Laki. https://t.co/idWtZ1pEHg Hmmmmm.. https://t.co/D2ii4ExtfP RT @Wydelshallom94: @radityadika maksih banyak bang udh buat ketawa sambil nangis. THE GUYS 👍 https://t.co/3elbSbOgSa Nongkrong bareng Namewee, Youtuber dgn subscriber terbanyak di Malaysia! https://t.co/o0ExZsob9i Goyang dulu mblo.. https://t.co/GHcVKCpNi2 Makan bareng Youtuber drummer kece dari Taiwan, Swhite.. Check her YouTube out! https://t.co/mV9NjBlUGO Ada yg tau band apa ini? https://t.co/Yeugx8QRep Protes ke wartawan Jepang soal natto, makanan Jepang yg gue suka tapi ga semua orang Jepang suka. https://t.co/AM4Hx5T6EB Kenapa malah jadi berita.. 😂 https://t.co/MLlxtlrrwP Interview sama media Jepang pake penerjemah. 😂 https://t.co/SRfYIYXeLF Tuan abu2 akan menemui anda.. https://t.co/Pg7Cy5Rkjr Mancing mancing apa yg gak boleh? https://t.co/QWTE6tfU8T On stage introduced by Fred, along with @webtvasia.id talents.. https://t.co/tIVeIGtDbB Ada robot abis ditinggal pas lagi sayang2nya.. https://t.co/W41SNJ7lV1 Mau pake toiletnya tapi takut pas lagi duduk salah mencet terus meledak.. https://t.co/lGYzfsNrlB Imut imut sangar.. https://t.co/pThXW3Se6P Lagi pada ngapain, mblo? Gue sih lagi ngemil sama Miss Vietnam di Okinawa nih.. https://t.co/5M0T2WcZRt Okinawa Film Festival red carpet situation. https://t.co/Z18hcJ1I6P Red carpet di Okinawa Film Festival.. https://t.co/9flwxPv7AR Berasa artis.. 😂 https://t.co/arJihTDssc Jauh2 ke Okinawa ketemu idol grup dari Indonesia.. https://t.co/EkHlkPoLNi Lagi nanya jalan.. https://t.co/nYZVbD0gTW Selamat pagi dari Okinawa. Jadwal hari ini ada interview soal film Hangout yg main di Okinawa Film Festival dengan media2 sini. https://t.co/lkIfJWEMwR Beginilah detik2 menjelang film Hangout ditayangkan di Okinawa Film Festival. https://t.co/CoeAtAHlZs 🎶🎶🎶 https://t.co/KIuDpHmwBx Makan dulu gaes.. https://t.co/febC9y3zcK Film Hangout di dalam buku program Okinawa Film Festival. Main malam ini juga! https://t.co/KXxhwxuVve Akhirnya setelah 2 kali transit.. Tiba di Okinawa! https://t.co/2yehldMA1h Cuma mampir.. https://t.co/B7qgAqtncG THE GUYS! https://t.co/K6Ych6kyzc Buat kalian yg akan berpisah sama temen2nya.. https://t.co/3esvOfcaJe RT @mrhandoyo_: film karya @radityadika yg terbaru bikin gue inget ada temen2 satu genk yang masih gue punya, ayo kumpul lagi!! #theguys RT @destrimahrun: Wadaawww keren banget bang 👍👍👍,baru kali ini gue ketawa2 ngakak tp pas adegan sedih ttep bisa nangis. @radityadika https:… Dapet undangan dari Ditjen Kekayaan Intelektual buat ngeramaikan #WorldIPDay di Car Free Day 23/4/2017; UOB Plaza. Berangkat kita.. Transit di Hongkong. https://t.co/sPm4bK3ZvE China Airlines. Jakarta - Hongkong - Taiwan - Okinawa. https://t.co/YjQZtnAdGz Ada yang lagi musuhan.. https://t.co/Nq8lEtpp82 RT @Acha_runisa31: Kurang ajar banget nieh @radityadika bikin gua mewek ketawa ketiwi sendiri dibioskop awas  ya lu radit kalau ketemu gue… Trailer HANGOUT sudah ditampilkan untuk Okinawa Film Festival di Jepang. Lusa akan ditayangkan. Yg di Indo.. jgn lupa nonton THE GUYS! 😂 https://t.co/YmvtlVlrS7 Kak Pev selalu nomer satu.. https://t.co/lyM64TPKPn Film Hangout masuk Okinawa Film Festival di Jepang. Tgl 22 April gue akan datang di sana. Yg tinggal di Okinawa kita ketemu ya. https://t.co/HpYwk61EIq Surabaya hacep! https://t.co/Xa5DE7usTp @pardedereza @TretanMuslim @ranupawiros @Dim_zy Gue ikutin terus ah seru RT @pardedereza: Buat yg belum nonton #FixSerem yg episod 3 \nSilahkan nonton ya !! \n@TretanMuslim \n@ranupawiros \n@Dim_zy \n\nhttps://t.co/Lf7… @pardedereza @TretanMuslim @ranupawiros @Dim_zy Udah ada yg ada hantu beneran gak cok? Mau nonton Ada kakek2.. https://t.co/1zWz4W26HP Ketindihan.. https://t.co/6W9mnBYA1U designated survivors &gt; 13 reasons why Jakartaaaaa! https://t.co/dKL46kTTVR Tiba di Slipi! https://t.co/4OjvwgfZot Hari ini! https://t.co/Odt0SA6Bpu Mmmmm.. https://t.co/I9vYeqBM5G RT @riyardiarisman: Wohoooo ! \nPenasaran sama #FilmTheGuys yg skrg lagi ada di Bioskop? Yuk tonton review nya di https://t.co/MmvRPwibH1 Cc… Makan Yu Djum di hotel.. 😂 https://t.co/SUYoIImoSs Jogja siap2! https://t.co/hap73vgNoz Hotel malam ini.. https://t.co/ahvi2kToOe Menuju Jogja! https://t.co/gORxPuz3XZ Ngangkang.. https://t.co/DmpmB9R1RQ Pecahkan gaes.. https://t.co/sEyeBTrNh1 RT @verabeviana: Aku datang untuk suguhan film baru mu bang @radityadika !! https://t.co/T3pmweLORm Kuki lagi nginep di rumah.. https://t.co/kOqBWDLXmA RT @egayantii: Nonton the guys @radityadika ..Ngena parahh bgt ceritaNya smpe ngrasain dmna nangis sama ketawa tuh bareng. Gokil sh https:/… RT @RidhoniSholehS: Lucu,persahabatan,mengharukan di film ada dan semoga film the guys penontonnya makin banyak dan film ini lucu dan keren… Depok besok! https://t.co/LxfqxSG9az Himbauan gaes.. https://t.co/weH6Hyg5pW Film THE GUYS trending topic! Tonton besok yaaa.. https://t.co/qdBK32Bbyh Penontonnya terus naik. Weekend ini yg mau nonton absen! https://t.co/HjN6VwgwOH Cast film THE GUYS di Bandung! https://t.co/leuYDdwFAY Bandung! Kita ketemu siang ini ya.. https://t.co/03c2bXo9yL Himbauan dari bawang merah.. https://t.co/tpRYafNTKN Malam mingguan.. https://t.co/8c7HfHYj88 RT @LaksitaKirana: @radityadika hwaa!😆 film ini petjah bgt👌😋 ngakak sepanjang film,adegan terharunya ngena,scene ttg persahabatannya jg OK… Oles oles oles oles oles.. https://t.co/zuBt5QvYoS Oles oles oles oles oles.. https://t.co/ZVkrzb7DuA KARAWANG!!! https://t.co/VhZqrGZlAm Anakku.. https://t.co/V4nvXhNhSK RT @hendrarizki: Nobar The Guys by @radityadika  bareng asisten dan leader https://t.co/HDimyS5MgQ RT @faa_ulfaa12: @radityadika keren bang film nya, bnyk belajar dr karyamu yg ini. Persahabatan, keluarga &amp; kekasih hati semua adl cinta 💜… Tontonan selepas UN.. https://t.co/39Nd6p4a1l RT @rasibenazir: Nonton sendiri pun jadi.. ngakak &amp; nangis sendiri pun bodo amat 😂 i really enjoy this movie, ngaduk-ngaduk hati banget.. k… Gagal diet hari ini dipersembahkan oleh madu dan es krim. https://t.co/nRDUAz36WY RT @triprimaa: @radityadika ttp bang,masih sama seperti film2 lu sebelumnya,endingnya pst ngakak sambil nangis 😂😂 mau dong kaos kayak yg di… RT @rahmanwahjoe: akhirnya, Single tergeser sebagai film terbaik karya @radityadika versi saya oleh film The Guys. persahabatannya kocak pa… RT @spyhulk: Dikaa film the guys lu kereeeennnn, gue suka. Filmya emosionalnya terasa deh, apalagi saat lu sama pevita wkwk @radityadika me… Pinter. https://t.co/xsFCYtNEsV Natto for lunch.. https://t.co/ZZ1tHqqT1J Jadwal nobar terbaru! https://t.co/K5YLMbhCSw Nice! https://t.co/tKidTovSxU HARI INI! https://t.co/TJNip6QnHr Now! THE GUYS at INBOX SCTV! https://t.co/cnBtV4W9OB RT @cinema21: Bersiaplah... THE GUYS tayang BESOK di bioskop!! https://t.co/52qJwgZlkD Ini artinya jomblo dilarang pegang. https://t.co/ag7FcfX9J5 B. E. S. O. K. https://t.co/Qj0EYaoZ1v Udah siap buat BESOK? https://t.co/S5j2dn1KH3 RT @netmediatama: Kocaknya @radityadika yang mau ketemu dengan bapaknya @pevpearce ;p\n\n@TonightShow_NET https://t.co/ItwHl0aKAK Dua kali tidur lagi.. https://t.co/2SQSil9bVS Iya kak.. 😍 https://t.co/Htyb5GtdCW Dikit-dikit harus laporan, ngirimin foto. Itu pacaran atau penjara? Thanks inbox for having us! https://t.co/KuUPCkpEZe Pagi.. 😪😪😪 https://t.co/qs8DCZRvrq Telunjuk jari manis jari tengah.. https://t.co/qCglxdmo3c Kenapa harus nonton film THE GUYS: https://t.co/uJwzLuWAZ2 Kak Sheila Dara udah siap nih buat THE GUYS.. 😂 https://t.co/x9meCK8mcb Tontonan sebelum tidur malam ini.. 😍 https://t.co/g6HSNOF3kA Sunday afternoon writing session. https://t.co/H5bHcdQ9Q3 Video livestreaming premiere film THE GUYS kemarin, yg belom nonton: https://t.co/hJAJIxyu8R Telunjuk jari tengah jari manis kelingking. https://t.co/9VbuOWRsxc RT @UlasanFilm21: #TheGuys adlh peningkatan luar biasa @radityadika. Bisa dibilang film terbaik Radit sejauh ini. Review dikit ah #AkanTaya… Nonton bareng film THE GUYS! https://t.co/ukIHnPrgHa Yuk, join #TegukMerosot Party di Epicentrum dan cobain seluncuran terpanjang se-Indonesia! Today from 7:30-17:30. https://t.co/Zcx60m65vI Nonton film buatan sendiri. Lima hari lagi gaes.. https://t.co/4EA9XGo4wC Coming really really soon. https://t.co/Zx27hTo0nP 😍😍😍 https://t.co/UOctcKeByQ Undangan premiere film THE GUYS. Deg2an! https://t.co/fu07oQQl8q Berapa hari lagi THE GUYS di bioskop nih? https://t.co/rI1l3qyZ1B Bersama2 tmn main OVERWATCH dan PLAYERUNKNOWN'S BATTLEGROUND yg nginep di rumah. Hayo mana yg Blacklabel, Textrax, Hubz, dan Fallinginluv? https://t.co/Gc4ruV5za4 Boop! https://t.co/6HY3bsVnG5 Congkak.. https://t.co/8QANJca4Fk Kepada semua lelaki di Indonesia, maafkan aku.. https://t.co/TULD4gfHKV Yg mana mukanya Jegel hayo.. https://t.co/Hnzbu5V4u1 Yg mau kaos mari.. https://t.co/5hV4iUiiGw VLOG baru! THE GUYS singgah di Semarang: https://t.co/LFsFnUgiti Sebentar lagi nyemprot di bioskop.. https://t.co/fmeMOCzNbL Ojek time! https://t.co/7hXS5OGbkw RT @deviirmadayanti: @radityadika @marthinolio_ @indrajegel @pevpearce  bang gue udah beli tiket Film The Guys loh, g sabarrrrrrr ih 😘❤️@so… Siapa orang paling jorok di Indonesia? https://t.co/rZpVH9GeEn Kak @sherylsheinafia make baju THE GUYS. 😍 https://t.co/YCfsT8XcSx https://t.co/8Q9gFRTZfC Menjelang.. https://t.co/zsScBaGO5u MULAI BESOK TIKET FILM THE GUYS BISA DIBELI DULUAN DI BIOSKOP2 INI! https://t.co/ETdZ9vSia8 The Guys di Semarang! https://t.co/wQ7HuDYQmy Tuyul dan tuyul. https://t.co/2B0aEZ7Q9U Hai Unnes! https://t.co/QGwfkum80H Boarding to Semarang! https://t.co/f5fawQ1aR9 Enggak.. https://t.co/khS4wPVq4o Sekarang di INI TALKSHOW NET TV! Gue akan nongol di segmen 4 ngomongin film THE GUYS.. RT @korantempo: Setelah Raditya Dika, Ini Selebritas YouTube Berikutnya https://t.co/8lgArrEI12 Cus! https://t.co/ohP3SpplIt THE GUYS is in da house yo! https://t.co/n7RRAu1RLm Alisnya kurang tebel. https://t.co/ZJ0yLqi9HL Udah ikutan belom? Pemenangnya diumumkan lusa. https://t.co/zNMI5HuBHR Masak di atas daun.. https://t.co/VwdRppEhdP Ulub ibab. https://t.co/mq8330fiyR Adek gue yg cewek juga lagi streaming main Overwatch nih. Pada nonton ya: https://t.co/pCkcb5pVYo Gila ganteng banget Jegel.. https://t.co/HDOeGgCNIU Maap tadi streaming error mulu. Sekarang udah bisa. Tonton di: https://t.co/z9Hud5mDy8 Bentar lagi live streaming di YouTube gue bersama Indra Jegel. https://t.co/QsVLxWmCC8 Nemu video lama pas lagi ngulik improvisasi blues. Masih bisa ga ya main secepat ini.. 😂 https://t.co/zV4boDcZZJ Udah bisa dihitung pake dua tangan gaes.. https://t.co/ZU7xG4FkUW Lho? Kan emang gantengan. https://t.co/TNu8h1hO9q Unch unch. https://t.co/OctU0J9u6S Pada dapet cium nih dari aktor tampan film THE GUYS. https://t.co/85ChkArLNb Kalo banyak yg mau ayo. https://t.co/OHbkspMH0e Garuk2.. https://t.co/bNxByCqnJ8 Lagi makan sushi, udah mau pulang, tiba2 kokinya manggil \"ini buat mas.\" Makasih ga tega makannya. 😂 https://t.co/AJr6FA4bV6 Sebelas hari lagi akan liat Kak Pev di bioskop.. 😍 https://t.co/eHaNTMcy94 Ada berapa kucing dalam foto ini? https://t.co/HnfukhEtzj Live dimulai, yg jomblo gabung di sini: https://t.co/D5F0H9uRT5 Abis ngambil tes kepribadian.. 😂 https://t.co/kb3gA7iULx Selusin lagi gaes.. https://t.co/cJ174JGrAe Ya udah.. https://t.co/pqoXUBoWit Nanti malem livestreaming lagi gak nih? Menjelang malam Minggu.. https://t.co/f7bsm6aPZZ Kasih intip dikit OST FILM THE GUYS.. https://t.co/PxfEqh2y1k Yang mau belajar Standup Comedy, ini ada video gue lagi mentoring. Mari di tonton.. https://t.co/zkRvmEss9p Video klip resmi NIDJI - BILA BERSAMAMU untuk FILM THE GUYS udah keluar. Jgn lupa filmnya tayang 12 hari lagi! https://t.co/RkkiJOTClp Livestreaming Battleground dimulai! Tonton di sini: https://t.co/fUlkqzAn84 Oke. Malem ini bakal bunuh orang. https://t.co/6dccL3BgVE OW apa Battleground nih? https://t.co/Z3y309FiFW Hmmm.. kalo banyak yg minta ayok. https://t.co/eiBGKoWLO6 Ayo dateng ke #tegukmerosot party di Epiwalk centrum tgl 9 April,  Cek di sini https://t.co/P4w3qIkIcr buat ikutan &amp; dpt sliding pack! https://t.co/INkPfgMJ15 Siapa tuh yg di lantai.. https://t.co/7uSPdTmGGo Akhirnya platinum juga. Ditemani Blacklabel yg ga bisa baca peta. 😂 https://t.co/RBdkDlIZwA Dua minggu.. https://t.co/sZ9cp4pnf2 Livestreaming main Player Unknown's Battleground mari nonton di: https://t.co/qm6d5lcSOd Topi gue bagus ga? https://t.co/7rvthWG2Vj Doain aja ya. https://t.co/vTFfwYhLXg Jam 7 live lagi main PLAYERUNKOWN'S BATTLEGROUND di YouTube gue. Siap2 gengs.. Abis ketemu mbak Shinta, yg udah kenal gue dari zaman gue masih SMA imut2 dan menggemaskan sampai gue sekarang.. gini. https://t.co/iyucJMDaO5 Kucing kena ecoli. https://t.co/V5o3t9J9V7 Selamat siang mereka yang ingin percaya kembali tapi masih terjebak trauma masa lalu.. Tuyul Millenium bacain pemenang Producer of the Year bersama sutradara kece Anggy Umbara di IBOMA 2017. https://t.co/6wdvHlxm70 Biasalah,  mentang2 kurusan dia. https://t.co/j4jXuaPo2b Zenyatta sama Torbjorn foto bareng.  #ygmainOverwatchpastingerti https://t.co/GZXD854Kkd Sun. https://t.co/wX2Hc0abKC Daging panjang yang menempel pada pantat sapi for lunch. https://t.co/zwSS1UYUcD Masuk Instagram cuy.. https://t.co/iLaEI1tTf0 Nambelas.. https://t.co/72J908ZwLS Rama NIDJI main ke rumah dan ngomongin gitar gue, tonton videonya di sini: https://t.co/b7LPMnX93w Livestreaming dimulai! Main PLAYERUNKNOWN'S BATTLEGROUNDS. Tonton di: https://t.co/z0bBgNzM8W Tengok tengok.. https://t.co/Ko1G7sg4lX Seberapa sering kamu baca buku dalam sebulan? Semaput dulu gaes.. https://t.co/eOwVVi7lCu Mana yg kamu lebih suka? Tar malem mau streaming PLAYERUNKNOWN'S BATTLEGROUND lagi. Kalo ada yg punya gamenya mau ikut main email STEAM ID ke raditya.dika@gmail.com! Gue masih inget dulu cukur rambut pertama kali di barbershop deket rumah cuma bayar 5 ribu udah dapet permen sugus. Skrg 70 ribu cuy.. 😅 Menghitung hari.. https://t.co/FsLyuxi1fi Batagor paling enak di Jakarta dmn ya? Nice... https://t.co/04ykwTlw8o Ndut.. Ndut.. https://t.co/u5z2f7W3Oq Video baru! Soal setelah THE GUYS gue akan istirahat bikin film dulu: https://t.co/dACIzkwoZ8 Yang kiri bukan bayi gue.. https://t.co/WkXIzeMYDS Lagi ngubek2 YouTube baru inget pernah bikin lagu soal Papaya ini 5 taun lalu: https://t.co/FIdzlEJRBA Wadaw.. Adegan apa nih.. https://t.co/BZh3BDv4UU Makan Ferrero Roche udah kayak makan rambutan.. https://t.co/PXcRg8mjCk Jadi pembicara di hari film nasional bersama bapak2 kece.. https://t.co/xFyYCZZYID Kalo gue streaming Overwatch lagi pada ngerti peraturan mainnya ga? Mendingan streaming mana? Malam minggu di rumah. Bengong. Livestreaming lagi nih? Salah itung hari tadi gaes.. maap gaes.. haus gaes.. https://t.co/ztodbs4IuP Iseng2 bikin lagu terus nyanyiin sama Bong, ini judulnya TANPA KATA MAAF: https://t.co/JX0imEdDTa Selamat siang, mereka yang menunggu tanpa pernah dikasih kepastian.. Sudah live! Yuk temenin gue main Overwatch di: https://t.co/xqwMs8fRxX Lagi bengong2 di rumah, sebentar lagi mau livestreaming main game Overwatch, yang mau nonton ke: https://t.co/BinjtREpS2 Mau dimakan sayang.. https://t.co/lOGTMwvPca Jilat! https://t.co/MclZQb1C8D RT @sVi2: Karena proses yang pernah @radityadika lalui adalah posisi dimana saya berada saat ini. *kemudian mellow https://t.co/nZNbfbF3WO RT @achram_: @radityadika 's vlog is sooo so addicting. Man knows his stuffs..... he's entertaining and educating people at the same time. Soon! https://t.co/dKoOrRPYfK Orang bule nyanyiin OST. FILM THE GUYS, BILA BERSAMAMU oleh NIDJI, seru abis: https://t.co/TeiVkuTocx Numpang makan di rumah nyokap. 😂 https://t.co/rHbqdes0ZC RT @_PlotPoint: Merayakan hari Film Nasional bersama BJ HABIBIE, @radityadika  @anggasasongko @NajelaaShihab @salmanaristo @ipankdewe, ARI… Cast film THE GUYS lagi pada main di rumah.. https://t.co/OOQs81lvkf Video Q&amp;A film THE GUYS bareng Pevita Pearce, Marthino Lio, dan Caitlin Halderman: https://t.co/wzNXYOx4Qf Late night snack with Bong.. https://t.co/xKkZJ60bhH RT @Tereza_1969: NEW VIDEO !!!\n@nidji - Bila Bersamamu (Ost. The Guys) Tereza Cover\nhttps://t.co/9CFeq4NMyJ https://t.co/W0bEEVBvFO Kopi terakhir hari ini.. https://t.co/0bq7gWoODy Dalam seminggu trailer #filmtheguys tembus 1 juta views. Mari yg belom nonton ke https://t.co/oteZCfYi2b. Tungguin filmnya! https://t.co/Sf8QXBVhs6 Toweweweweng.. https://t.co/VjkXyTMkzQ RRRRRRRRRRRRRR https://t.co/GaxKZR3wug Poster @DanurMovie yang diangkat dari novel karya Risa Saraswati 'Gerbang Dialog Danur'. GENTAYANGAN di bioskop mulai 30 Maret 2017! https://t.co/6gjh3YEwJX Covernya OST film THE GUYS oleh Bong, tonton di sini: https://t.co/ihEuHFN0kX Mirip gak sama yg di tengah? https://t.co/f1DklMhZaG Lagi makan sushi dibikinin ini sama chef-nya. Maacih. 😍 https://t.co/DSdpFKurL8 Main ke rumah Rama Nidji ketemu Randy juga.. ditodong nyanyi BILA BERSAMAMU (OST. THE GUYS). Maafkan suara saya. 😂 https://t.co/qKfizSOXZu Trailer film THE GUYS menjelang 1 juta views. Mari yg belom nonton: https://t.co/AtTQUyUEFp Si ganteng Jojo yg lagi nginep di rumah. https://t.co/DsgyTwBSdM Tuyul dan mbak yul. Pertanyaan singkat: kira2 jadi siapakah Caitlin Halderman di film THE GUYS? https://t.co/mqS9OVgeP7 Upin ipin cover lagu BILA BERSAMAMU - NIDJI (OST. THE GUYS) https://t.co/9819pbmVUq Nge-gym dulu gaes.. https://t.co/D5WXONpCoy Video lirik THE GUYS baru saja keluar silakan ditonton di sini https://t.co/CXh1ciyORh Yg mau laptop mari.. https://t.co/T4WAXwSvX3 Ekspresi ketika lagi janjian sama pacar tapi pas di restoran baru sadar pacarnya cuma khayalan.. https://t.co/eBfdzs6v2X Video ditraktir rapper terhebat di Indonesia, the one and only PRT: https://t.co/rIfhxlxMQq Mari.. https://t.co/Elu4nw1uhm Trailer film THE GUYS nih gaes: https://t.co/AtTQUyUEFp ARGHH!! https://t.co/nmYEldS5FO Kenapa gak kucing? https://t.co/MNoSObzvJC Berapa hari lagi gaes? Itungin dong.. https://t.co/zdwOAAsFSo Main Overwatch lagi ah. Yg mau barengan add aja ya di RADIKA#11909. Nice. https://t.co/PCGEMne8kM Dimana2 pasti ada kucing deketin gue.. 😓 https://t.co/zLyqfYxEWo Udah jadi video paling trending di Indonesia nomer 2 saat ini gaes.. Mari yg belom nonton.. https://t.co/NJ9wTRc58I Harum.. https://t.co/Z98qIrCOyV Makan pakai tangan menambah kenikmatan 20%. @ShaniBudi nice @ShaniBudi buat nulis enak ya bangku/sofanya? Dari arah pagi sore di sebelah kanan atau kiri jalan? Tempat ngopi/nulis enak di Cipete raya dmn ya? Hasil climbing Overwatch hari ini. 😂 https://t.co/Tag8CGuuC7 Trending nomer 7 beybeh! https://t.co/4Fkez9qhiF Betul. Setelah The Guys gue istirahat bikin film dulu. https://t.co/KonKr5aiAy Ada yg lagi PDKT sama berondong.. https://t.co/eQUSg1CTCP RT @Starvisionplus: Apa jadinya kalau nenek 70 tahun berubah jadi 20 tahun? :D @sweet20movie Segera di Bioskop!\n#Sweet20 https://t.co/gNgcz… Betul. https://t.co/wwxusXbRkO Gue masih silver. Gak bisa bareng. https://t.co/p3RCgDGb3I @nasgort jam 9/10an ya Nanti malem climbing Overwatch lagi ah. Kemarin dalam sehari turun 70 poin. Wadaw.. 😓 Ditraktir makan PRT di hotel Mulia. https://t.co/qWZShCfjpv Nih yg mau laptop baru! https://t.co/NmYqjpicGV Ada yang mau laptop baru? https://t.co/A1rySlY6os Bangun2 trailer film THE GUYS masuk di trending Youtube Indonesia. Mari yg belom nonton: https://t.co/AtTQUyUEFp Ngantuk ya? https://t.co/04YxNAxyhC Trailer film THE GUYS sudah keluar. Tonton di sini: https://t.co/AtTQUyUEFp Gangguin yg lagi boker https://t.co/HnxIQmAXHh Jangan lupa nanti malem gaes! https://t.co/mKwI4fIaSF OST #filmtheguys dibuat oleh band favorit gue Nidji. Silakan intip denger lagunya.. https://t.co/Ohrh1BoHjk Kucing baru gak sopan... https://t.co/RnL9SBzonT Lunch with adik. https://t.co/N1Vn19tLXT Besok gaes.. https://t.co/GSLDHHppPO Malam mingguku. Mari climbing rank! https://t.co/zjtM42276t VLOG bareng Baifern di Thailand udah keluar. Liat di sini: https://t.co/tir1Bz2caK Memandang bulan.. https://t.co/qge4qPj4ow Bulan depan gaes.. #filmtheguys https://t.co/CrUWK8KDRt Mana yg lebih penting? Kebanyakan helium kayaknya. https://t.co/53bCa7Kxst Minggu ini video yg paling banyak ditonton di YouTube gue adalah ttg rapper terhebat di Indonesia. Kenapa ya kira2: https://t.co/TwQCMtwdKk Masak pagi ini. Tebak ini apa.. https://t.co/IDA7OBouja Kak Pev lagi ngeliat apa ya.. #filmtheguys https://t.co/IXHd6Mq1HO Makan bang.. https://t.co/Na4Pl2ruRC Elus2 kucing ibukota dulu ah.. https://t.co/EEjRAeExcs Duh mau pergi kerja tapi kucing udah dua hari males makan. Tiap kucing ga enak badan gini jd berat ninggalin rumah. Kepikiran. 😢 https://t.co/2tCljKTLVj Video ngejam dari kegelisahan gue, ini judulnya AKU MAU MAKAN MANGGA. Tonton di sini: https://t.co/1EdGH7RaUc Video ngejam lagi. Kali ini lagu gue berjudul KUCINGKU SEMBELIT TIGA MINGGU. Tonton di sini: https://t.co/6eWzfjK2bq Video baru! Twit2 Kopi Pertama gue dijadikan musikalisasi. Tonton di sini: https://t.co/3JK8irXH7v Lanjut editing #filmtheguys. Let's go! https://t.co/lQwCaAiY9y Ngapain hayooo.. #filmtheguys https://t.co/93W9aBrmtz Nonton dan makan hari ini.. 😓 https://t.co/5tgxHjD9P5 Siapa tau butuh lampu. https://t.co/BaliSdyij0 Jam segini udah sampe rumah. Hujan rintik2. Selimutan. Kriyep2.. Lagi cosplay jadi tuyul. https://t.co/TBu147Wdc1 Cie cieeeeee.. #filmtheguys https://t.co/noOVnhlzdP Saatnya olahraga kembali.. https://t.co/fl5rpTqMTm Bagus ga? https://t.co/EcWaYzRh2Q Beberapa hari kelar shooting, akhirnya baru sempet tidur2an lagi di rumah. Lagi ada apa nih yg seru? Shampoo gue mana ya.. Hmmm. https://t.co/k9V4e9QpNa Sore.. https://t.co/ARsOl8kKV0 Enggak. https://t.co/AQGjKt9SK5 bakpao ayam &gt; bakpao kacang ijo Uh.. https://t.co/etbgT6w0QJ Tadi malem di Balikpapan! Thanks for having me! https://t.co/5TUMLA0Y2A Cara raja rap PRT mendapatkan inspirasi.. https://t.co/kQyAg9lg4p Sukun! #filmtheguys https://t.co/T656Dajzi9 Video kehidupan rapper terhebat di Indonesia: https://t.co/TwQCMtwdKk Malem minggu jam session. Segera di YouTube gue! https://t.co/bZxkWLRVsE Editing #filmtheguys. Looking good! https://t.co/7EqOEdLZKg Siapa yg juga punya gebetan di kantor dan ujungnya gak dianggep gini? #filmtheguys https://t.co/K0hUlmt7ts Nonton dulu ah sebelum kerja.. https://t.co/szNQETTOEM 😍😍😍 https://t.co/TpINKz3fJT Siap2 editing #filmtheguys bersama mas Sastha Sunu. Draft pertama bakal tembus 2.5 jam nih kayaknya. 😅 https://t.co/PiJvdFC5J7 먹자! https://t.co/iM5FWgLQT9 Sejuta topan badai. #filmtheguys https://t.co/CN9JVlZOUk Wrap party #filmtheguys! https://t.co/dGOy2RuChD Nyokap officially S3. Congrats mom! https://t.co/8jgNh0Xt3a Minum Levite yg segernya bikin gue sampe merosoooot. Ikut #TegukMerosot Challenge &amp; menangin iPhone 7! https://t.co/ZHVxvHb6FF https://t.co/M7k5xifKsV Sidang S3 nyokap, lagi memaparkan pokok permasalahan dalam disertasinya. Gue manggut2 aja biar dikira ngerti.. https://t.co/4LdkONl6iq Nyokap lagi sidang promosi doktor untuk S3. Kenapa gue yg deg2an.. 😂 https://t.co/4WF4HOpjrh Hari ini dateng ke sidang disertasi nyokap untuk S3. Jadi pengen kuliah lagi.. 😅 https://t.co/y4APZI3xT9 Machatz. https://t.co/zBbl19EZ8g Video baru! Musikalisasi puisinya kak @PrillyBie: https://t.co/mT8HD9LmoY Lelaki tertampan di Jakarta Selatan. https://t.co/AbFRiNSFTq Dudududu.. https://t.co/Xp2BWv25EB Kok akurat sih.. 😂 https://t.co/3JMESoYhSE AAAAAHHH!! #theguys https://t.co/q2ix4Y7tuf Siap2 acara.. https://t.co/2NmmL7xAPn Laba2.. https://t.co/3Z6x48M3eY So What - Miles Davis. #jazzguitar https://t.co/WJV1ra9ILO Siang2 ada yg nganterin buku.. https://t.co/GeKhzSHdPv Siap2 main Overwatch semaleman. Yg mau main bareng add aja battletag gue di RADIKA#11909. Let's go! https://t.co/WEBKPlKYzo Masih shooting dong.. https://t.co/wPzFmTTKzS HMMMH!! #filmtheguys https://t.co/VJYb5P7jyd Menunggu ditemani Paul Desmond. https://t.co/yLXMB9YMT7 Ini wc kayaknya ngeledek gue deh.. https://t.co/h7gvX5yPWz Hukum naksir I. https://t.co/Vk3FZcYzzS Brosis. https://t.co/kktZvBGEmV Day 39 #filmtheguys. Almost there, beybeh. https://t.co/TYCtJESdjI Late lunch. https://t.co/KlVZ1zBQMt Kegeeran pangkal patah hati. Kira2 apa yg terjadi nih.. #filmtheguys https://t.co/DVBjequ2nb Bit-sized supper. https://t.co/KyvrJ8kcXU Neon lights. https://t.co/SpjGbjMZOO Udah lama gak main piano. 😂 https://t.co/RJW1t5bzZk Sombong.. https://t.co/lOsu0dhmiV Kemarin adik @kianty dan @yunezt melanjutkan kuliah ke Australia.. 😢 https://t.co/lBRrGZnSeU Geleng2.. https://t.co/jSBI4GpkzB Always, my first love. #gamerpastingerti https://t.co/awpT8CP8cE RT @KapanLagicom: Bikin Iri Jomblo, Raditya Dika Foto Bareng Artis Cantik Thailand https://t.co/mumVMkdD19 https://t.co/CBGkB5UebI Berantem. https://t.co/qL7RS5k35r Day 37 #filmtheguys bersama kak @caitlinhalderman. https://t.co/czDHVkGHyT Baru sempet main Overwatch lagi. Ketinggalan event. Gak dapet skin Winston yg ini deh. 😑 https://t.co/p5mYfOgfVV Goodbye sisters! Kuliah yang bener! https://t.co/d0ni8SLtcN Besok adik2 kembar akan melanjutkan kuliah ke Brisbane, Australia. Sedih banget. Keliatan gak? https://t.co/wKwFn50X6D Pakob. https://t.co/b59nwPVkJB Kopi pertama hari ini.. https://t.co/1bxx1TzdLW @ikanatassa 😎 Subway! https://t.co/CI40xM2rNR Selamat pagi dari Bangkok.. https://t.co/wrxHPmtXyB FEAST!! https://t.co/BvjupHqROq Bisa dong.. 😎 https://t.co/KXvB3HgC9W Camera report untuk shooting #filmtheguys di Bangkok. Kenapa nama gue jadi Radit Yadika.. https://t.co/LPNs1PyD1r Baifern di #filmtheguys. https://t.co/sbsf9dRGFt Latihan dialog bareng aktris Thailand, Baifern. Dia akan ada di #filmtheguys. Siap2! https://t.co/Qv5CJBUZ5Z Sama aktris Thailand, si cantik Baifern. Maap ya, mblo.. https://t.co/OtsrPvPbms Selamat pagi dari Bangkok.. https://t.co/Pf7hC1mngI Sampe hotel pada video call. Ckckckck.. https://t.co/vkhJ5cCWSL Bangkok! https://t.co/uJf0P7lt05 RT @SCTV_: Malam ini kamu bakal dihibur oleh akting @radityadika lewat film Single! Nonton ya mulai pkl 22.00 WIB https://t.co/HK1oCkwj84 Nemenin Marthino Lio bengong.. https://t.co/KvI2n1qbII Ketemu @indrajegel sama mobilnya di bandara.. https://t.co/YhZShU9Nf5 Nice. https://t.co/qFuL1F9p3x Hmmmmm.. https://t.co/ouzJPqAG8k Ekspresi lagi malam Minggu tiba2 ada yg watsapp \"jalan yuk\". #filmtheguys https://t.co/yklY3HU5uF VLOG baru! https://t.co/vpfioALSpq Coming soon. Film pertama gue yg settingnya di perkantoran. #filmtheguys https://t.co/7YPn81F0Uf Coffee and pudding. https://t.co/sAOasH3OsL Menunggu lampu.. #filmtheguys https://t.co/CC7Z9JSAei Kiri kanan kiri kanan.. https://t.co/FB2tvtcsZg Ngasih #CornettoLoveRibbon ini pas buat Valentine’s Day. Thank you yah Cornetto karena bikin gue jadi #BeraniPDKT! https://t.co/hTDANEBkPN Survey membuktikan.. https://t.co/9m6MV4CdMe Ini apa lagi sih.. https://t.co/B8Op3DJOoi Nyasar.. https://t.co/i1swERDZOt Lagi kedinginan di Bogor.. Bromancenya Gong Yoo sama Lee Dong Wook. #goals https://t.co/9xCms1ttMV Gak ada bedak, oli pun jadi. #beautytips https://t.co/T4VFP1Klgp Pose paling ganteng si Pukaii. https://t.co/AtG0jYOwVw Mudah2an Gong Yoo baca LINE Today.. https://t.co/KI7aJ7aHtD Last scene! https://t.co/1rcl2PJ8yx #nofilter #nomakeup https://t.co/YMk6mctqqp Disamperin Raditya Dika dari masa depan.. https://t.co/7KfpbSeVkw Kayanya ada yg beda sama kucing gue.. https://t.co/9ik1BDttsC Kebetulan? ☺ https://t.co/Rc8ZPHOfHI Sama2 pernah makan.. #justsaying https://t.co/ZtzTXwCABJ Sama2 suka pake kaos.. #justsaying https://t.co/J7wD4VaAx1 11-12. https://t.co/hCXsAWqPUI Intimidasi. #filmtheguys https://t.co/3myggbKT6d Setelah selama ini, saya masih seneng baca, main game, jarang keluar rumah. I'm just a nerd at heart. 🤓 Blos.. https://t.co/crS8pWiSj9 Tumben2an adek2 dateng ke tempat kerja bawain makanan. Semesta berkonspirasi agar diet saya gagal hari ini. Tenggelamkan aku di rawa cintamu, Hayati! #filmtheguys https://t.co/rbhtkxjfi8 Lagi ya. Yg paling enak adalah.. Menurut pendapat gue tempe goreng di bawah pisang goreng, tahu isi, dan bakwan. https://t.co/A2Hm65Q6iP Gorengan paling enak adalah.. Pop! https://t.co/rRlIGmx4ZS Kemarin malem ada yg kangen.. https://t.co/8IdglezhoU Happy Halloween, mblo. RT @MemeComicIndo: So what gitu loh.. https://t.co/Xh0G67zUyi Belut bakar untuk makan malam. https://t.co/UdD3P9KX6Q Gong Yoo. https://t.co/zEnNFMaOAf Keren amat laptopnya Pame. https://t.co/IkK0kGq2f1 Lagi shooting ada fans mampir nih. Kayaknya sih sebenernya fansnya @indrajegel.. https://t.co/a4n8Hoo31X Lanjut nonton Goblin lagi ah.. Selamat sore dari Sentul. https://t.co/HPlgczGwo4 Beberapa saat setelah melihat bulan purnama. https://t.co/HkBiM4eSc0 VLOG baru! Mari ditonton: https://t.co/2OiDKNnT14 Ngicuk kitnas. https://t.co/GFACh6bSo8 Lagi main gundu tajir. https://t.co/TvogbAUHqh Halo. https://t.co/LG48GPjTnQ Malam Minggu di Bogor. Dingin.. OOTD. https://t.co/HmpH8H5HZ4 Berarti sekarang ____________ (isi sendiri) https://t.co/OUIZzFrWID Scene pertama hari ini bersama dua Youtubers kece. Tebak siapa.. #filmtheguys https://t.co/6rd4oUr7qL Legend in my frame. #filmtheguys https://t.co/m8JYdKgKYn Liat yaaa.. https://t.co/SzG5yvd8bd Beauty and the prince (udah, diem aja kalian). #filmtheguys https://t.co/4bGC8U2YKR Teaser film THE GUYS! Liat di sini: https://t.co/9lCMAsRktF Jangan pernah takut bermimpi, guys! Patut di contoh nih https://t.co/Dpy6FJ2RiO https://t.co/RIVA3xMdH3 Kucing sombong.. https://t.co/9YFj5xyUnv Friendship. #filmtheguys https://t.co/b4s82Cebn3 Gila koleksi senjatanya @indrajegel banyak banget.. https://t.co/FMqdWqT0xT Kucing Bogor cuy... https://t.co/QEdZkO0lQT Ada ini di depan kamar hotel.. https://t.co/QPXRU26j0O Oh hujaaaaaan.. https://t.co/ySNDJblF1D Dari jaman FF realm reborn emang gue main tanker terus atau healer. https://t.co/2H2Fa3kERj Memasuki minggu ketiga ga main Overwatch karena sibuk shooting. Kangen banget sama gorilla ini.. https://t.co/Nb0gxyiYiv Awal2 kuliah dulu pernah cat rambut gini. 😂 https://t.co/vSET7nJtqr Sarapan dulu sama si unyil. https://t.co/0SUjfXkG2m Di film terbaru gue, gue bakal bermain bersama Pukaii, aktor berbakat dari Thailand! https://t.co/3kesZbArqb Disamperin. https://t.co/vXvLXEQ939 Yuk beli tiket #PreSaleSYTD2 di 50 bioskop @cinema21 ini. Stiap pembelian 1 tiket #SYTD2, akan dpt 1 DVD EKSLUSIF, Gratis! https://t.co/2wlLm8v9b7 VLOG baru! https://t.co/kVVQg417oG Otw Sentul. https://t.co/rctwcQ8ii1 Ekspresi bahagia dulu pernah foto sama Ian Kasela.. https://t.co/GnOnH6Q3mq Jaman SMP.. https://t.co/DhydEvNTUc Main ke bank BCA dapet kado ulangtahun. Makasih.. 🙃 https://t.co/pRxuJZ5Esl Menjiwai.. https://t.co/QrvvXyAsC9 Jaman SMA.. 😂 https://t.co/iASUEFkMYT Kamulah satu2nya.. https://t.co/utgcNqpkW8 @FiraBasuki siap mbak Persahabatan orang2 kantoran. #filmtheguys https://t.co/c9s6AYbG2P Selamat pagi dari Kuningan. https://t.co/RKdLJxx4dT Film terbaru gue adalah #filmtheguys. Komedi tentang orang kantoran dalam keluarga, pekerjaan, dan cinta. https://t.co/k9inYMABOl Sesungguhnya tiada yg lebih istimewa selain menjadi nama yg terselip di antara doa malam seseorang. Ready to shoot. #filmtheguys https://t.co/WI2cqrrnAI Shooting pinggir jalan berarti monitor seadanya dan diasepin mobil2. 😂 #filmtheguys https://t.co/vNx7SPzZjp Nice. https://t.co/tv23doeMAC Gulai tikungan. Jajahan jaman SMA dulu. https://t.co/WpohZII5v5 Gila @indrajegel topinya keren.. https://t.co/1KfLxg9mUL Perasaan isinya cuma makan sama shooting.. 😂 https://t.co/cOOMJzYyjl Scene pertama hari ini.. https://t.co/7WIA0VPfTR Hotel malam ini.. https://t.co/kKkF4iC723 Malam.. https://t.co/jfJuT3EWqp Dideketin mundur, dijauhin maju. Siapa tuh? Video baru! Nyanyi2 improvisasi komedi! Tonton di: https://t.co/x0IOMInAYx Harus banget ujan pas mau shooting ya.. 😓 https://t.co/DYu6slAU6a Bola ijo. https://t.co/SDyuKdTLYK Pekerja film.. https://t.co/grlvrYzQ06 Ternyata tinggi gue sama dengan Richard Kyle.. https://t.co/T1YYJeRRjl Selamat pagi! Tebak dimana.. https://t.co/GTw1xUpo48 Bambang.. https://t.co/D4LkS7tdl9 Maestro Indra jegel bernyanyi.. https://t.co/WGBlCdTVGH Jari udah karatan gaes.. https://t.co/PLLfHYPLC4 Kayak om2 godain anak kuliahan baru pulang les bahasa Inggris.. https://t.co/AsMn4tuys8 Jangan kau henti dulu with @marthinolio.. https://t.co/w35VsYm9hg Dunia belum berakhir.. https://t.co/jRN0BuZ0rV Next movie! https://t.co/K6gJZ1BD4y Tepat jam 7 malem gue bakal posting poster resmi (versi GIF) film gue berikutnya. Siap2.. Ekspresi lagi mau shooting tiba2 hujan.. https://t.co/1rsDftRB8D Itu dulu.. https://t.co/JWf8MDMOhy Ada yang udah liat film #jangankedip? gue bikin reaction videonya nih https://t.co/TqK3OcRxQD\n\nAda hadiah 1jt juga dari gue! #TselVideoMAX Maestro joget @indrajegel.. https://t.co/MKY8vdNt1T Malem Minggu gaes.. https://t.co/ke8qp2rH3G Penggalan kisah lama.. https://t.co/nOGjbg7aUU KKEB.. https://t.co/XZ8TJjc57q Bener nih jawabannya.. https://t.co/OVnsc6FTrk THIS IS PRT!!! https://t.co/n8jmMBxQxp VLOG baru! Ngeliat temen dipukul orang Thailand: https://t.co/jVpXjdifmy Gue yang kiri ya. Jangan ketuker. https://t.co/M5LOW7LNdu 竜が我が敵を食らう！ VLOG baru! Mari ditonton: https://t.co/5ONbEsorpX Gue gendutan gak? https://t.co/Yq8YKeBTWg Kalo ini video main Overwatch pake Zenyatta: https://t.co/YYvsxWqtoq Gulai kepala ikan beybeh. https://t.co/ZPZdjD2EsW Video baru! Main Overwatch lagi: https://t.co/5ScqxSAn6g Mari kita mulai.. https://t.co/1tdnNXIjRw Gokil.. https://t.co/gfrtERJWpS Terimakasih semuanya! Award pertama tahun ini. Maaf gak bisa dateng lagi shooting. 😢 https://t.co/FbYzKAWitQ Makasih semuanya! https://t.co/hSdITtACOW Terimakasih! 😅 https://t.co/Zyt3BHCVrG Kenapa kalo upload video Instagram lama banget ya? Padahal ke Twitter dan Facebook cepet2 aja.. Cover lagu Lala Land by @indrajegel. https://t.co/DV4u4b5gbJ Setelah tertunda hujan, mari kita lanjutkan shooting hari ini. Doakan langit cerah terus ya.. https://t.co/oTiQvlaepY Potong aku mas! Potong aku! https://t.co/5ShFz1fHgr Scene pertama hari ini.. https://t.co/kFVPfVm0c6 Segera di YouTube gue! https://t.co/I6Kk4CDvmX Tiga malam ke depan.. https://t.co/laZUa6RhVW Lagi makan siang bareng temen lama. Jaman2 dulu masih polos dan lugu.. https://t.co/WfAe5XppUZ Hidupmu mungkin nanti berat, cing. Tapi bersabarlah. Niscaya kebahagiaan akan datang. https://t.co/jf0AqBtXOD Brutal. https://t.co/nmkqZP6dEe Hi.. https://t.co/U2fiKZqZlK Romantis banget.. https://t.co/gSS1OpgXTx Kopi.. https://t.co/URexPkqYbu Bagi votenya kakak.. https://t.co/UJGXU46OuM Bantalnya pas nih.. https://t.co/XogKnsgvyL Mari kita mulai hari ini.. https://t.co/Xj2JmCYEDi Banyak amat pembantunya.. https://t.co/4GjS8Udji3 Dua hari lagi sebulan. Mari tonton sebelom turun dari bioskop.. https://t.co/URvQ0Eo481 Meeting dulu.. https://t.co/F6vMj7IPRL Wadaw.. https://t.co/CVhmHVJoCv Satu scene lagi.. https://t.co/eiAK3Wtr0x Mumpung masih di bioskop, hajar! https://t.co/0G2e5X5t19 Gak mungkin kan, Mik? https://t.co/bnyAh2qiT6 Meeting2.. https://t.co/HXzFIwryuy Here's to the one who dream. Foolish as they may seem.. ~ Jatuh cinta dan patah hati nonton film ini. My kind of movie. Sepanjang nonton kangen Annie Hall. https://t.co/F24kxwFQTi Video YouTube baru! Game werewolf paling emosional: https://t.co/87CynI2CAa Pevita dan Junot lagi ngobrol.. https://t.co/bZahttDCdW Mau gue post video main werewolf lagi gak? NOM NOM NOM. https://t.co/fvAiGhZVhe Menjelaskan peraturan offside.. https://t.co/aUN63Vb5HK Udah empat Minggu gaes. Gokil. Pastikan segera nonton sebelom layar pada turun! Cus! https://t.co/iL1teqVHHR Teman tidur malam ini.. https://t.co/uV3wTtR5tM Lagi tidur. https://t.co/EXtdWafHwz Orang Thai gak bisa bilang ular.. https://t.co/hwqjFHS1KQ Werewolf! https://t.co/8vx84mXX9n Video baru! Main werewolf lagi: https://t.co/LFKA7danfB Jadi umpan gaes.. https://t.co/maNzDzExSN Memasuki Minggu keempat film Hangout. Yang belom nonton pastikan Minggu ini ya! 🤣 Keren.. https://t.co/VuZetMr7h5 Healer ya tugasnya nyelametin begini.. 😙 https://t.co/xzCOtrgi5t Edgar.. https://t.co/YxuDHUkcTX Tebak mana yg tangan gue.. https://t.co/Wsi20kza6U Bukan ini film gue.. https://t.co/SrnphQwK44 Ewwww.. https://t.co/nPZtGUXQLZ Jangan mau dimasakin Rian.. https://t.co/jpsk5It9iu Malam minggu macam apa ini.. https://t.co/RLAEXWzwny Gue main Overwatch rutin tiap malem (kalo ga ada shooting) sapa2 aja kalo ketemu RADIKA. 😁 Iya yg RADIKA itu gue. Mana videonya? 😂 https://t.co/qlTYogVVlV NOM NOM NOM. https://t.co/L9qWzsiODW Cukuran dulu gaes.. https://t.co/6UXxM30w1K Cuacanya cerah ya.. https://t.co/3deq04WKIT Waduh.. https://t.co/3vG8cErDuk Wajib ada di meja gue kalo lagi shooting.. https://t.co/kOuWRi9QbI Lagi di kerja nih. Seru gak? https://t.co/kLeTpfUUSU Udah 2 taun lalu nih.. https://t.co/gYwbW4rhQj Abis nerima email begini jd kangen nulis juga.. 😢 https://t.co/Uros6AVzRb Serupa tapi tak beda. https://t.co/8oTsXDyZw9 Mark! And set! https://t.co/KbpZwEA0m2 Ketika kucing gue ngebajak channel gue: https://t.co/KNNuem6qib Sejatinya, secangkir kopi lebih baik ditemani oleh lamunan yang panjang.. https://t.co/1zmUW10zsd Dari pagi idung kanan mampet. 😷 Waktu menunjukkan pukul.. 😵 Dari film apa ya ini.. https://t.co/rfdxG1oeIb Tebak siapa.. https://t.co/3VpH53prSy Kalo takut bakal meluk kehampaan dong? https://t.co/zysVaV4Jk7 Jawabannya apa nih.. https://t.co/4fxIBIYuxT Botol minum untuk satu bulan ke depan.. https://t.co/57QcZFMr6e Yg mau nambahin satu hari ini tunjuk tangan! https://t.co/pFCEuSWtLg Yang belom termasuk dalam 2,501,082 penonton dalam 21 hari ini.. tonton segera! 🤣 https://t.co/gTU8dhd7In Hmmm.. https://t.co/hDvWKInhkB Kembar tiga. https://t.co/xbNgWyrIXA Masih dong. Habiskan! https://t.co/vt30VHcDAQ Senang. Gak pernah nyangka bisa bikin film yg ditonton 2.5 juta penonton. 🤣 https://t.co/KVydvDwkfd Teman2, per malam ini film Hangout telah tembus 2.5 JUTA penonton. Terimakasih atas support luar biasa dari semuanya.. 😘 Gladi resik buat HUT Indosiar nanti malem. Nonton ya gaes.. https://t.co/WZt1l6WqhE Udah, nonton hari ini aja atau besok.. https://t.co/vLvkPhd6k1 Cakep nih ada review film Hangout. Mari yg belom nonton, masih main lho filmnya: https://t.co/6Hxsg8vkSt Orang kaya.. https://t.co/Cr7Q7eevF1 Ini Kemal Palevi bukan ya? Mau negor takut ditimpuk Yeezy.. 😂 https://t.co/4vKJ74zcw4 Ngopduls.. https://t.co/5S4haK5bO5 RT @Braga_Citywalk: Masih belum nonton juga film supeeer kocaak dari penulis @radityadika ? Yuk hari ini langsung cek jadwal tayang \"Hangou… Hah itu bener lokasinya. Ke rumahnya juga ga? 😂 https://t.co/WrQVkgKDqF Coba tebak ini poster dari film apa.. https://t.co/1IiuXG8uW1 Pada dapet cium nih dari aktor Thailand. Namanya Pukaii. https://t.co/sWCNAfU6Cr Nambah kucing lagi gak ya.. Bikin merinding kalau nontonnya di kuburan. Coba deh. https://t.co/GaILdUoQbe Lagi mau beli tahu bulet kok ada... https://t.co/Hd0jwgyETy SUAPIN POP CORN AJA TUH!!! https://t.co/32AA0AD4LK Gokil.. https://t.co/9a4uuUzxkc Mau diapain nih.. https://t.co/RQu0zbxdCX Bikin mereka putus dong.. https://t.co/qOpctiXYxF Kak Fedi Nuril in my frame. Coming soon beybeh. 😁 https://t.co/mEPP4xN6Rs Mari yg masih mau liat perut seksi gue.. https://t.co/kJK3CEYtuB Iya.. kamu juga ya.. 😍 https://t.co/X7dOghQXmj Makasih ya.. 😍😍😍 https://t.co/RQ82v6c5Se RT @Nanik_Febriani: bang @radityadika gilaaa hangout emang gokil ,paling seneng pas adegan bawang merah bawang putih ,fix bang soleh @soleh… Udah kurusan lah ya? https://t.co/8WF9F6Lraq Kenapa gak bareng sama temen2 satu kotamadya? https://t.co/v3MObewiZl Gokil nontonnya di atas awan.. https://t.co/kb8dmwplNU Musik di sela2 ngeset.. https://t.co/NzHOclH2bG Perih gaes.. https://t.co/OtCeun8Akq Video challenge film Hangout tembus 2 jt penonton udah ditonton 1.2 jt kali. Kalian seneng banget liat orang menderita ya? 😫 https://t.co/2mN6jYo3O4 Begitulah.. https://t.co/lxueO7pPKl Dari tampangnya sih kayaknya preman tuh.. https://t.co/CXM9DW7idw Menjelang 2.5 juta penonton.. 😚 https://t.co/Dy64Vd46Qg Males deh hari pertama sekolah. Aku masih pengen libur. :( Muka siapa tuh disensor gitu? https://t.co/l7HU3rMOfq Selamat pagi. Mari kita pecahkan pagi ini. https://t.co/zOLeqqRMWr Selamat pagi, cinta yg terlewatkan. (buat yg ngerasa) Orang kaya.. https://t.co/GxrrJLqQ4Y Belom.. https://t.co/JrXZ4GLEFz Itu emang pedes gila sih. https://t.co/oY8bYMzoPS Nais.. https://t.co/zKUo4osCCm Habiskan! https://t.co/sTRu45WbY7 RT @auliariska_: Bangun tidur nemu beginian 😅😅 @radityadika https://t.co/Y7V44p2zCF Ada yg nonton hari ini? https://t.co/CwNR0cUjk8 Pagi2 nemu ini di rumah.. https://t.co/WRVefuiqHn Tahun 2017 atau 2018? https://t.co/GRh6P8V86s Makasih loh hadiahnya.. https://t.co/2Gf9Uu7HON RT @yudhaAditya_H: Paling suka di film #Hangout saat bagian drama bawang merah bawang putih, ngakaakk abisss.. sukses terus bang @radityadi… RT @InaVGB: Gokilllll parahhh nonton hangout ga berenti\" ngakak 😂😂😂😂\n@PrillyBie @radityadika sukses trss RT @rizariri: Film komersil Indonesia naik kelas. Ayo cepat nonton film HANGOUT. Komedi yang liar &amp; bikin gemas. https://t.co/YDXPaOlho5 Warna baru #VivoV5 Space Grey &amp; 20MP Softlight Cameranya  keren banget, bisa bikin #PerfectSelfie @vivo_indonesia.. https://t.co/puMMH3k70T Dududududu.. ~ https://t.co/NVYy0Je1PO Wihhh masih nomer satu nih.. https://t.co/sZiKuhDGFR Ganteng Ganteng Thailand. https://t.co/leU26XV9j6 Yang mau nonton Sabtu/Minggu ini tunjuk tangan! https://t.co/gQ7L1wEUYA RT @jawapos: Hangout Masuk Daftar 10 Film Indonesia Terlaris Sepanjang Masa - https://t.co/jF76GgEBg5 @radityadika https://t.co/k6MDl3KEUx Amin aja deh.. https://t.co/lzmpEJKZH3 Gemetaran nih foto sama Tante Widyawati.. 😅 https://t.co/3KcoZ9ATqt Beli #VivoV5 dan dapetin #PerfectSelfieTrip ke Jepang, GRATIS dari @Vivo_Indonesia di sini https://t.co/mLFjD4PgZr https://t.co/O3w8k1HQYQ Dua kali sehari.. 😓 https://t.co/rfwBDXXZ1T Wow.. 🤣 https://t.co/Nj8boArvFW Kalo gue kentut ada yg ngambek gak ya.. https://t.co/7JhSZZA1ij Colback ini apa ya.. https://t.co/WbkOqExpux Gak pernah ada kata terlambat untuk gaul. https://t.co/pd5WxPv7cl Jadi cadel juga gak? https://t.co/NAHN0FV9U1 Habiskan weekend ini! https://t.co/JCC7TvnNkQ Ngopi dulu gaes.. https://t.co/9GchCee4Ar Brb pingsan dulu. https://t.co/FyVUmHy0mH Ngapain nonton 2x dalam sehari.. 😂 https://t.co/tSDECz1rcu Kak Uus sama kak Gilang lagi main ke rumah nih.. https://t.co/sXmjEBBuBq Badan ngedrop. Baru bangun tidur siang jam segini. Kapan ya terakhir tidur siang.. enak juga. 😅 Gimana ceritanya film Hangout masih penuh2 aja.. 😅 https://t.co/PuDQuRG57g Nais. https://t.co/cAfjjvV8h7 Translate dong. Artinya apa.. 😅 https://t.co/u15fURFc7R Video YouTube tantangan 2 juta penonton yg gue laksanakan bersama kak Prilly masuk trending YouTube. Pada seneng bgt liat kami kesiksa.. 😥 https://t.co/43pj2Usthj RT @liputan6dotcom: Film Hangout Sukses, Raditya Dika dan Prilly Saling Penuhi Janji https://t.co/7PDopNy4lX https://t.co/QOQ4IuRTU8 Kak Titi ngomong apa ini ya.. https://t.co/Pner6BOc2i Kacau sih emang.. https://t.co/pyJzaWmHSL Jamming with Kathu.. https://t.co/q8CmEqdYPQ Improvisasi pake lagunya kak Isyana.. https://t.co/UtepzeGF9c 😂😂😂 https://t.co/N12II8Xfmu Video tantangan 2 juta penonton film Hangout oleh gue dan kak Prilly sudah ada YouTube gue. Tonton di sini: https://t.co/Y5TfQTzJbR Lagi sama siapa nih.. https://t.co/EKwfxwVeCF RT @Strategi_Bisnis: 3 film terakhir @radityadika selalu box office. \n\nSingle 1.3 juta\nKoala kumal 1.8 jt\nHangout 2 jt ++\n\nTarget market pa… Lagi diupload nih. Sabar ya.. https://t.co/RKfZAoVvrl Video challenge gue dan kak Prilly Latuconsina untuk film Hangout tembus 2 juta penonton lagi diupload. Siap2 di YouTube gue ya.. Iya tadi abis upload ada kesalahan di videonya. Ini lagi mau diupload lagi. Sabar ya.. https://t.co/4g9iD7tVTO Nonton 24 kali juga gak apa2.. https://t.co/T6t4qJdWBu Bisa.. https://t.co/EePNXLEB4p Belum 2 minggu tembus 2 juta. Masih main di banyak layar. Habiskan gaes! https://t.co/myDfRQWoxC RT @APL_Smg: Congratss kaka dika @radityadika! tembus 2jt penonton :) ditunggu banget vlognya bareng ii @PrillyBie https://t.co/6DtBKK7fIT Sesuai janji, kalo film Hangout tembus 2 juta penonton kak Prilly yg takut kucing bakal gendong kucing bugil gue. Tungguin VLOG-nya! https://t.co/hIlZe0pg5V Sesuai janji, kalo film Hangout tembus 2 juta penonton gue yg gak tahan pedes ini bakal makan Samyang bikinan kak Prilly. Tungguin VLOG-nya! https://t.co/AZqEwsu1xQ Terimakasih semuanya. 😘 https://t.co/OcWlOqJ91p Amin.. https://t.co/a4gKodR4t0 Ehm.. RT @bayuegt: bang @Radityadika gue uda nonton 2kali asli masih tetep ngakak apalagi pas scene drama bawang merah bawang putih 😂 Temen gue orang India mau jual tablanya nih (alat musik india) siapa tau ada musisi yg butuh:  https://t.co/MPkN6cckVW RT @karagabas: Baru sempet nonton, nunggu agak lama biar ga terlalu rame, eh ternyata masih rame aja bang @radityadika *sendiri lagi nonton… Waduh.. https://t.co/mq2tLeE6iq Cie cie.. https://t.co/MlFex7Dkor RT @elisa_cahyani1: Bela belain pulang sekolah langsung cus ke mall hujan-hujanan bang demi bisa nonton Hangout @radityadika #hangoutmovie… Nom nom nom.. https://t.co/2SNZOsd1BN Macet lagi macet lagi.. https://t.co/XSODaBUtub Tembuskan ke 2 juta! https://t.co/s3pper4ajn Wadaw.. 😂 https://t.co/qu0pxYy4iv JENG JENG JENG! 😆 https://t.co/dxIm3B8DL7 Begitulah film Hangout.. 😂 https://t.co/97t7UCVxnS Potret seorang penulis yg sedang melamun di malam hari.. https://t.co/GYx4bH5NPy RT @FebrianiMimie: film hangout karya kak @radityadika  baguss banget,ada yg ngakak, yg greget juga ada , pokoknya seruu deh\nsukses terus b… RT @dinnkart: pecah bang @radityadika PECAH!! gila sampe ngos2an gini ketawa 😅😆👏👏👏 https://t.co/XWrVyLi71K Kasian ibu2 itu.. https://t.co/8QtQu1jHQ5 RT @imamutami15: Butuh perjuangan buat nonton film bang @radityadika Rame ngantri bener bang sampe kursi nya aja kebagian kursi yg bawah sa… RT @enengyulianti: Ini yg antri HANGOUT masih penuh aja,,gw kebagian karcis nya ga ya Bang @radityadika 😭😪 https://t.co/3DbxCbhsIJ Penonton film Hangout masih rame aja lho. Padahal udah hampir 2 minggu di bioskop. 😆 https://t.co/EziadzZ1nL Mari kita pecahkan lagi hari ini.. https://t.co/mcEi2KxjxP Kalo tembus 2 juta penonton, gue yang gak tahan cabe akan makan Samyang dikasih cabe buatan kak Prilly! Deg2an. 😅 https://t.co/HkVnPPqyq6 Bentar ya gue pindahin awannya.. https://t.co/bovDCBlNc6 Bagi2 hape untuk yg upload tiket film Hangout di Instagram berakhir hari ini! Pastikan kamu ikutan. 🤣 https://t.co/5PPm5aXjdp Mari pecahkan lagi hari ini. 🤣 https://t.co/biQt1BDyrG Seperti biasa, main Overwatch dulu. Ritual sebelum tidur.. https://t.co/LERaYV3zic Selalu tiap ke Jogja.. https://t.co/jpRFxlcCE1 RT @aadityanugroho: Bang kapan kapan bikin lagi film yang kek hangout. Keren sumpah, ngakak juga. Feel misteri nya dapet😂😂 @radityadika RT @diniiOc: Nonton Film hangout gila emg, dr yg panik, ketawa, takut, panik lagi, ketawa lagi. Campur aduk, keren bang filmnya 👏👏 @raditya… RT @ayuastuti22_: Sumpah film karya @radityadika yang HANGOUT keren parah, ketawa mulu liatnya😂 Tegangnya juga… https://t.co/MslMWiFdlS Jangan pegangan tangan sama sebelahnya ya.. https://t.co/QiVRk0n9Pe Nice.. https://t.co/uCTP8NDNHy RT @iindrawatty11: kak radit ini aq udh nnton 2x nih..prtma nnton salma pnakan yg di kmpung klo skrang sma tmn cwo..hehee @radityadika http… Tiga kali nonton? 😅 https://t.co/3CCTn4Xfpy Gaes kita tembuskan gaes.. 😂 https://t.co/KxId8EYhT1 Hangout dulu lah sebelom otak hang.. https://t.co/cJSteIQdMF Hari yang cerah di Jogjakarta.. https://t.co/22852P5c23 😇😇😇 https://t.co/hxLlRhiaDF RT @arya_sefrian: @radityadika alhamdulillah sudah 2 hari nggak kebagian tiket akhirnya berkat doa sudah dapat tiketnya https://t.co/9PvwOT… RT @BbenjileeVI: Hangout untuk yg ke dua kali nya nie bang,keluarga saking pgn nonton nya..@radityadika https://t.co/qQ0zgqpsje Tembus dua juta penonton gak ya.. 🤣 https://t.co/tw8c8GssKi Ada yg mau ngantriin gak.. 😙 https://t.co/mHawT8dVmt Buka mata pertama di tahun 2017. Ngupil pertama di tahun 2017. Selamat tahun baru semuanya! Buset.. https://t.co/90R6Te6Mei Make celana terakhir di tahun 2016. Langsung mikir 2017 mau bikin apa.. 😂 https://t.co/A6OmpSt0gl Dinner menjelang tahun baru beybeh.. https://t.co/viyldeoMwH Jangan nyalain kembang api ya di dalem.. https://t.co/NgA3dV47Mn Tahun baru nonton SINGLE.. Ya udah pasti single ini mah.. https://t.co/rf9x0rH8IT RT @dindaisv2407: Nangis, tegang, menakutkan, ngakak, itu yang gua rasain pas nonton #filmhangout sumpahh pengen nonton lagi fix @PrillyBie… RT @IpeSanty: Keren #filmhangout sold out, yg belum kebagian tiket besok pesen lgi ya @rapifilm @radityadika https://t.co/xdRoW0GZLr Yu Djum rame akhirnya melipir ke Bu Widodo deh.. https://t.co/6KSaQ3v3nh RT @PrillyBie: Siap siap mau ke panakkukang nih! Sampai ketemuu yaaa! Aku mau bagi bagi hadia buat yang nonton disana! Ada yg mau jadi calo gak tuh gaes.. https://t.co/LpuGqE2Fn9 RT @Nisasofy48: Selamat y bang @radityadika film nya udah 1jt lebih penonton, emang bagus, sumpah bang keren, humornya nyampe , sulit di te… Mumping taun baruan di Jogja, mau diem2 nonton film Hangout ah sama keluarga haha. Paling cakep bioskop mana nih? Kami akan menghabiskan tahun baru di Jogja. Kota paling istimewa di hati. 😍 https://t.co/eIB6dH1Qn1 Wah taun baruan di bioskop dong. 😂 https://t.co/PIotAvJDnR Habiskan weekend ini! https://t.co/M0y03lGhBH Dapet kado ulangtahun dari adik2.. https://t.co/95z73OMT2l RT @NazwaViani: @radityadika nonton film hangout gk puas klo cuma sekali dua kali pengenya nnton mulu, filmnya bkin tegang sm katawa mulu,… RT @chaagarneta: Bioskop baru dibuka, udah antri aja bang @radityadika 😅😅😅😅 https://t.co/kk6E1fvMRU RT @Rosyiidah99: @radityadika masih kebayang nonton hangout tegang bgt sumpah dan knp saat tegang gitu masih aja lucu? Pokokny hebat&amp;keren… Gila dari tahun 2012 berarti ya.. 😅 https://t.co/JBTj7bTZ9B Siapa yg berencana nonton hari ini, hari terakhir tahun 2016? 🤣 https://t.co/Szfe5hD8re Akhirnya dapet skin main Hero gue di Overwatch.. https://t.co/oIfsoAfqRs RT @kumawaroh: Ngantri jam 12.00, dapat tiket jam 15.30. Rela nunggu demi lihat film ini. Keren dan baper 😂😂 @PrillyBie @radityadika https:… RT @Dhila_ki: @radityadika pokoknya film Hangout, benar2 jempol deh. Lucu, deg2annya dapat banget. Ahahahaa di tunggu film selanjutnya 😊😁 RT @indahrukmanaa_: @radityadika ditunggu filem selanjutnyaa bang😍😍😍 belum bisa moveon dari filemnyaa. Koplak abis😁 RT @rianqud: @radityadika  Hangout with family 13 tiket rekor nobar dlm sejarah https://t.co/dnyIoMo56D RT @Nikeuliafni_: @radityadika yang susah di lupain dari hangout itu perannya dinda kanya dewi. Aseli keren abis (y) Kiri kanan gak kenal berarti.. Nonton sendiri.. 😢 https://t.co/A1zvysX0v5 Cie.. https://t.co/HvfQmyGyE1 Kalo lagi telponan terus pulsa abis dan mager buat ke ATM, gue tinggal pake M-BCA di hp, langsung deh bisa lanjut telponan lagi #InovasiBCA https://t.co/l0VJmI0T87 Coba besok ya.. https://t.co/PbcTmQzyPD Bawah putih gak binal!!! https://t.co/3A1hPStkIV Masih nyoba2in kamera sepanjang hari ini.. https://t.co/zSi67GzhOp RT @AikoKeiko_: @radityadika keren bnget bang filmnya, malah jadi film krya bang radit yg paling kena komedinya. Tahun depan, buat yg lebih… RT @eelpath: Entah kenapa masih kebayang akting prilly kemarin. Yang pasti saya suka sama hangout. Bang @radityadika, levelmu sudah naik ba… RT @alfa_zahroh: @radityadika keren banget bang film.a, serulah pokok.a sii, bikin semua orang ketawa lepas Temenin tuh, mblo.. https://t.co/5RS7aDVWmz Dapet peringkat pertama Movie Of The Week di LINE TODAY. Minggu ini pecahkan lagi! https://t.co/rwrFlSmLbX RT @Ainichndr: Pergi jam 12 + macet dan panas panasan terus nyampe jam set2 dan kebagian jam segitu buat film lo bang @radityadika wkwkwkwk… Wah. Tersipu saya.. 😆 https://t.co/nuaGfBZrul RT @ftimadnya: @radityadika adek ku nonton ampe nangis kejer:v terus ketawa:v yaallah bang 😂 Hari ini nyobain kamera ALEXA MINI dengan ARRI Ultra Prime Lense.. https://t.co/cEvsWAz0yZ RT @Eddo_vandor: Rela booking dr jam 12 siang untuk nonton jam 21.10 .... Gr2 @radityadika yg bikin penasaran... Setelah single yg koplak… Gokil.. yang gak kebagian coba besok ya.. 🤣 https://t.co/4F0MjiCH7H Baik2 kepleset ya.. https://t.co/9lGVK16qjd RT @spyhulk: @radityadika dikaaaa serius dah film lo pecaaah bangeeett. Seruuu, seram, lucu, aaaahhh dapat semua dah, complete. Parah paraa… Kamu yg baju pink ya? https://t.co/ELY3HXobaa Yuk habiskan weekend ini! https://t.co/cPivg4dKZh Berasa banget nih diliatin.. https://t.co/jPeyHay8tv Tag temen kalian yg mau diajak nonton weekend ini! https://t.co/6804aphxNh Dandan dulu cyin biar chantique.. https://t.co/S1xdM5SZkK RT @ciawreza: @radityadika film lu itu kacau lucunya, pemilihan para pemerannya tepat, mereka yg tampak gak lucu pun bisa tampil lucu ditan… Buset 20 orang.. https://t.co/cu3pbanjMh RT @lutfiahsiti_: @radityadika pas nonton hangout, gue suka banget bang. se studio penuh, ketawanya bareng, kagetnya bareng, kompak gitudee… Nice.. 😂 https://t.co/5fQQqz9NtV Kantornya keren.. 🤣 https://t.co/bvjY3iLdqA RT @Agus_Mulyadi: Salut utk @radityadika yg berani menerobos zona nyaman dlm karya film komedinya, beda banget dr film sebelumnya. #Hangout Pada dapet salam nih orang Thailand ganteng.. https://t.co/TIChPRi1lF RT @rindaheriyani: Bang dika:(( gue mau nonton yg jam 7 ehh keabisaan ah beteee:( jadi yang jam 9 nii @radityadika https://t.co/YXKeo9B01I RT @iis_aqila: bang @radityadika adain tour palembang bang... semua pemain hangout,, di international plaza plembg,,, smpe hr ini penontony… RT @Amrul1402: Hari ini baru sempat nonton filmnya bang @radityadika 3 studio full penonton. Telat dikit aja harus nunggu besok lagi 😁 RT @Ristatanioll: Bang @radityadika , 11 orang nih keluarga besar pengen nonton abang 😂 https://t.co/xsEYryGMm2 Tuh gaes. Hangout ada yg midnight. https://t.co/y4aNIrJRXN RT @ahmeliasoff_: Menurut gue ini film yg paling seru yg gue tonton, semenjak dr pertama kalinya gue nnton bioskop bang sumpaahhh✌😂 @radity… RT @dzkrprtm: @radityadika gokil emg bang xD padahal tadi kosong antrian, ke bawah dulu, pas ke atas lagi dah abis Iya, coba besok ya. Liburan masih lama kan ya? https://t.co/zhgmUv8SS6 Semarang emang gokil sih. Kota yg keren! https://t.co/hfvBZacSxs Coba lagi besok ya.. https://t.co/LBhe3eZ005 Magelang! Pecahkan! https://t.co/veS2AePRja Ajak nonton aja kalo penasaran.. 😅 https://t.co/ZaXNUTreq4 RT @Chusnul2504: Sumpahhh tiketnya antrii parahh dari jam 10 sampai jam 11 ehhh dapatnya yg 12.30.. Suka bangett filmnya @radityadika @Pril… Boom! https://t.co/kc3iZ6fNrG Burem itu.. https://t.co/PFbeTLkoeU RT @Ika_Erviina: @radityadika FILMNYA KOCAK ABIS! NGAKAK satu studio bang!  Kursi penuh kagak ada yang kosong!!  PECAH!! Btw, HBD bang!! Su… RT @ingeanggreini: Petcahhhhhh!!! Di bikin tegang tapi di bikin ngakak parahhh jugaa! Keren ceritanya gak ketebak bgt!👍👍 @PrillyBie @radity… Coba aja! Layar masih banyak bgt kok.. 😂 https://t.co/tV2ElVyNA4 RT @AlyaNurInayah9: Makassar Panakukang 21 studio 1 full. Lgi pada hangout nih. @radityadika @PrillyBie @gadiiing https://t.co/lmkxqhk5e3 Coba besok ya.. https://t.co/nSNOREI7Aw Nice. Paling enggak besok bisa nonton lah ya.. https://t.co/yEen5Ww4q6 RT @SahwaDita: HANGOUT membuat orang beribadah karena membuat kita tertawa @PrillyBie @radityadika pecah film hangout RT @cinema21: Format: #Hangout21Quiz Foto Tiket Hangout @cinema21 Pemenang yang beruntung akan diumumkan pada 4 Januari 2017. RT @cinema21: Cukup posting tiket nonton HANGOUT kamu periode 29 Des'16 - 2 Jan'17. Pastikan tulis nama akun twitter kamu sebelum difoto. RT @cinema21: Saatnya #Hangout21Quiz berhadiah topi keren dan T-shirt filmnya. Berlaku potongan tiket di seluruh jaringan @cinema21 https:/… Coba besok yaaa.. https://t.co/q9M1Lzn3n9 RT @Agnes_Ashaa: Bukanya jam 12.15 antrinya udah dari 10.30,demi #hangout @radityadika @Moektito @PrillyBie @Titi_KamaLL alhamdulillah gak… Coba lagi besok yaaa.. https://t.co/NeQfIlLNDQ RT @mirahasana_: @radityadika ini hasil ngantri dari jam 10 dan sekarang kita masih terlantar bang radit 😂 https://t.co/RPrcaTcAY8 RT @retnoyuliantika: @radityadika Bang radit, dapat salam dari yg lagi antri tiket Hangout!!!\nPdhal bioskopnya baru buka👏🏻👏🏻 https://t.co/2… RT @cibbiqbal_: Dateng sebelum mall dan bioskop buka, akhirnya dapet juga bang @radityadika .sayang jomblo wkw https://t.co/5eGCHLI7XC Buset kebagian sore amat ya.. 😅 https://t.co/gSHDmbLeA0 Bawa balsem ya.. https://t.co/Jv5ixRiNmI RT @faris_muzaqi: Bang @radityadika lihat perjuangan demi meraih tiket #FilmHangout di @RajawaliCinema .  Pinuh pisan nh. https://t.co/Tv31… Wihhh.. pecahkan lagi hari ini gaes! https://t.co/SGYVSKfLjR Pasti kebagian kalo sepagi ini mah.. https://t.co/TbOaZyb9Xf RT @Nasriya_hujaima: Hangout time! Ini yg kedua kalinya. Masih seru dan ngakak nontonnya. \n@PrillyBie @radityadika https://t.co/RtnQ46oX4K Perasaan baru buka keles.. 😅 https://t.co/ngT6fLKTby Banyak yg nonton lebih dari sekali kok. Hajar! https://t.co/6KeJbWR0uR RT @milkhanov: Mengapa filmmu kebanyakkan membuat perut sakit, mulut kebas,akibat tertawa terlalu banyak bang wahh terhebatlah bang dit😁👍 @… RT @fendisetyawan_: @radityadika endingnya petjah ampe bermuncratan 😂😂 mana antrinya kek antri tiket mau nonton bola 😅😅 Makasih semuanya. Yg belom nonton (atau mau nonton lagi) pecahkan hari ini! https://t.co/dm3wAyUQmv Gue kasih mecin dikit sih.. https://t.co/pfCxLK9lxF Kemarin film Hangout meraih 170 ribu penonton dlm sehari. Thx all, meskipun udah seminggu, masih rame bgt. Bentar lg gue share totalnya.. 🤣 Makasih kak Dinda dan kak Prilly udah mampir. Film tembus 1 jt di hari ulangtahun. Kado terbaik! https://t.co/Uir4ns17Y5 Ngaruh gak sih.. https://t.co/utapIR55Y3 RT @IsnaAmalia90: Emang gokil bgt #filmhangout nya bang @radityadika .. Baru kali ini nonton film ketawa ampe nangis.. Hahaha https://t.co/… RT @EvaWanni_Himawa: Nih bang @radityadika gila bgt gue nunggu 2 jam buat nonton, theater penuh bang 😁,tapi kebayar smuanya 😁 ngakak abis😁.… RT @IDN_Melani: Pas nonton belakangku bilang \"aku gakuat ketawa terus, perutku sakit\" gila! Tambah ngakak ane 😂😂 KEREN @radityadika https:/… Gila nonton Hangout sampe 3 kali.. 😅 https://t.co/gjZLjh5hE8 Iyaaa.. besok coba lagi ya. https://t.co/g7xPIc6e4n HAHAHA KOK JADI ADA #FILMHANGOUTCHALLENGE 😂 https://t.co/8Rkt7LFnkD RT @kawaisasuke1: akhirnya jadi juga nonton filmnya kak @radityadika nih terima kasih film @HangoutFilm sudah membuat seisi bioskop tertawa… RT @choiping9: ngantri 2 jam, ketawa sepanjang film, 1 bioskop heboh semua. . @radityadika 👍👍👍 sukses yah. .laris maniss pkoknya ♡♡ Yg belom kebagian, besok yaaa.. https://t.co/KtLxK2dOuj RT @6002F: @radityadika ngantri dari jam 1 dapetnya jam 5 nih bang 😩 demi nonton film lu doang bang😹 https://t.co/k5lZBI0ZBs RT @hesti_rustanti: Bang @radityadika ini yg diluar masih banyak loh. Berjuang buat dapet tiket hangout antri 2 jam -_- BTW hppy b'day bang… RT @rahfadiah: Bang @radityadika mau nonton hangout udah kaya mau ngantri sembako https://t.co/WKtxqJg12y Pecahkan beybeh. https://t.co/VWnb5i9lYh Ekspresi senang gue pas tau #filmHangout sudah tembus 1 juta penonton. https://t.co/iWYXXbsE8p Coba besok ya.. https://t.co/itmTSOclLn RT @chikarani7: @radityadika Dalam ENAM HARI 1JUTA penonton!!! Kerenn banggg parahhhh, btw happy birthday yaaa JAM 10 MALEM?! 🤣 https://t.co/qFgHKVTx6d Tepat siang ini film Hangout tembus 1 juta penonton. Terimakasih semuanya, ini jadi kado ultah paling manis buat gue. 😘 Uuu.. ~ https://t.co/B1TAG3Sh9j Tiga kali? Wadaw.. 🤣 https://t.co/PBAbnkuKdK Pasti dapet...Kayaknya. https://t.co/3VinMYvpwE RT @isna_assyaroh: Cie yg hari ini ulang tahun dan film hangout bkal tembus 1 juta Perasaanya pasti belipat* nie :) @radityadika RT @verayunianti: Demi liat film Hangout nih bang @radityadika , rela antri segini panjangnya,pintu bioskopnya masih jauuuuhhh disana 😢 htt… RT @astria_nov: Hari ini antrian masih panjang aja buat pada nonton hangout... ada 3 studio di daerah BTM Bogor.. antri antri @radityadika… Sold out lagi? 😅 https://t.co/4G3AWM5lgX Selamat menikmati #filmhangout hari ini! https://t.co/g0PY76bmtG Amin dulu deh.. 😅 https://t.co/gCUEAZSl6a RT @Liliananura: Barakallah fii umrik bang @radityadika hari ini kita rayain dengan nnton #filmhangout aja ya biar kaya ngerayain bareng 😂😂 Lagi?! 🤣 https://t.co/LhbB0kRPSF RT @ajengriskl: Otw nonton filmnya bang @radityadika aahh 😁 doanya semoga kebagian tiket dan ga macet 😂 RT @irman_syaputra: Selamat tahun bang @radityadika hari ini tepat 1 juta penonton film hangout. Pasti jadi Kado terindah.. https://t.co/Ik… Senang. 🤣 https://t.co/mEiOw3T1gV Hadiah ulang tahun paling manis. 😘 https://t.co/Xz0DqefBu5 RT @cygnisina: Hangout Mantap! Jadi paham kenapa serin ajak org2 main werewolf. Riset dan Pemikiran super cerdas bang @radityadika ! Buset goceng lagi nih. Buruan ke bioskop hari ini dan jadi penonton ke-satujuta film Hangout. Pecahkan! 🤣 https://t.co/gFvi4Cebiq RT @likelon: @radityadika baru kali ini nnton film liat orang ketusuk pnonton pada ketawa-tawa😂. twist nya goks banget. ga bisa nebak klo g… RT @C_MichelleJKT48: Tadi sore nonton film Hangout *poke bang @radityadika* FILMNYA LAWAK BGT !! Suka bgt scene yang ditabok bayunyaaa !! 😂… RT @MirLes: Biasanya susah ketawa kalau nonton film komedi, tapi tadi nonton @Hangout_Movie ngakak gue! Offbeat bgt film ini, my kind of hu… RT @karina_wahyu05: Hangout @radityadika syangarr sumpahh. Ketawa, tegang, takut, trs ketawa lg 😂 Udh hr ke6 tp msh pnjng bgt antriannya ht… RT @Galuhkns: Udah 2 kali nonton. Gak cukup cuma 2kali nonton deh kayaknya. Aslik ngangenin banget film hangout nya 😭 pengen lagi @radityad… Coba besok lagi! 😙 https://t.co/VdbAs1TE7I RT @didawanapati_: 3 jam nnggu film ini, sampe sempet kluar mall buat beli nasi padang, tpi filmnya wow bkn penasaran sangat, g ada yg bisa… RT @dafahmdd: 3 kali ngantri, 2 kali keabisan :'v demi film elu bang @radityadika https://t.co/GPAfVmslMT RT @rindaniLubis: Thanks bang @radityadika filmnya keren. Banyak rasa ada ngakak,tegang,horror udah kayak nano-nano :D https://t.co/C7ahOX5… Reaksi penonton film Hangout lagi nih. 😨😆😨😆 https://t.co/JwhvaggCK5 RT @UCLN_Bola: Film Hangout Raditya Dika Cetak Rekor Lagi: 800 Ribu Penonton Dalam 5 Hari! https://t.co/6gAwEb5Z3O https://t.co/L2EXW3GxUG RT @arindaca: @radityadika bang masa td abis film lu kelar, orang2 pd berdiri tepuk tangan sambil teriak2. gue berasa lg nobar pertandingan… RT @sitijuliani9: @radityadika Bang HANGOUT KEREN Pisan!bkin orng g mw plng dan KETAGIHAN buat Nonton g cukup 1X 2X hihii Sukses yah Bang RT @tiararezkydp: Bang!! Tgl 22. 25. 27.\nNntn 3 kali gua bang @radityadika \nKeren kan lu bang? Buat gua ketagihannnn. https://t.co/20idTyw2… Niceee.. https://t.co/T4yCOKRlYq Duh, meleleh nih.. https://t.co/6T5B13eU9F Buset dimana nih.. 😂 https://t.co/QMXjdNdRgI Mari Hangout bareng.. https://t.co/cIMx0DQkfd Sampe keluar bioskop.. 😅 https://t.co/V5YlWFh0LY Senang #filmhangout hari ini masih ramai. Mari pecahkan! 🤣 https://t.co/viyNgW74Dm RT @aulisfa: gila parah😂mau nonton #hangout utk yg 2xnya,antriannya bginian bang,untung ktmu tmn,jdi ga ngantri👏😅 @radityadika https://t.co… RT @cicilia_nk19: Inilah kondisi dimana kita ngantri buat nnton film hangout @radityadika dari jam 11 sampe set 1 baru dapet tiket\nWow 😌 ht… Kita dong nonton film Hangout. 🤣 https://t.co/mepM5fYi9j Hangout sama Kathu yang baru aja landing di Jakarta. https://t.co/oZaKpFQPd6 Mari pecahkan lagi! https://t.co/zUvrPeG4zC RT @RNindha7: Habis pada nyari telolet,sekarang pada demam  nonton film #hangout sampai pada nonton lebih dari dua kali 😳 @radityadika RT @yunijosh: Lagi demam film #Hangout .. pagi siang malem isi TL tentang filmnya @radityadika doank -__-\" RT @fauziah_saputri: @radityadika WOW gila bru lima hari udh sbnyk gtu fix keren bgt salut gua sma bang radit flim dia yg ini emank beda bg… Terimakasih semuanya. Perolehan penonton per harinya terus meningkat. Yg mau nonton hari ini absen! https://t.co/xNFlGHK7OK RT @SCTV_: #HaloSelebriti - Baru Perdana Tayang, Film Hangout Sudah Melejit Fantastis\n\nhttps://t.co/PGGjwNah37 Overwatch dulu sebelom bobo.. https://t.co/rpMRfXyLgC Penonton film Hangout dalam SATU HARI ini mencapai lebih dari 200 ribu. Makasih semuanya. Terharu bgt. Besok angka pastinya gue share! 🤣 RT @tasyaazk: #hangoutmovie sumpahhh asiq bgt,ngakakk dan ngebuat jantung berdebar hebatt😂😂 Success to @radityadika berhasil ngebuat Indone… RT @insxyunaa: im out of words how wonderful the hangout film is♥ bang @radityadika alurnya gabisa ditebak kocak parah kerenn eehheh😂👍 RT @dianpraniti: Rasanya pengen gw bunyiin telolet telolet aza depan muka @radityadika ! Hangoutnya bikin ngakak tp ada tegang2nya gitu.. e… Coba besok ya.. https://t.co/5iiZlnzxyH RT @praburevolusi: Yang ngantri @HangoutFilm ampun dah. Sakses @radityadika https://t.co/RjRhUoMjEt Buset. Ramenya absurd. 😅 https://t.co/Z0C62xiHG0 Brutal. https://t.co/ZVWWseKFHs RT @inefitria23: Ini ngantri tadi bangg, EMPIRE XXI bandung film Hangout SOLD OUT👏🏻 sumpah keren film nya💓 @PrillyBie @radityadika https://… Buat yg males buka link review film Hangout barusan.. https://t.co/L4TD3zracg Review film Hangout nih gaes.. https://t.co/wSnmMI06dV Wah.. ramai.. https://t.co/lGtpsesy98 RT @Indahjulysh: Bang lu tau ga? Ke mall dari jam 10 nunggu pintu bioskop dibuka itu pas ngantri tiket film lu edun hampir soldout lagi @ra… Buset. Keluar bioskop tuh? 😣 https://t.co/Hv4iKwlylq RT @zheptia_nj: @radityadika ini tiket saya, yg 30menit sebelum tayang udh ludes. Dan antrian itu utk jam selanjutnya #hangoutmovie https:/… Adakah kalian di antara penonton film Hangout hari ini? https://t.co/TxLWdWo0Lt Penulis gak pernah ada libur.. https://t.co/hikAqOVmvK Sabar menunggu! https://t.co/oLyjbcUujh Pada bawa bekal ga.. https://t.co/Ar3MHynIf5 RT @dimassuryotomo: Penuh mulu bang gara2 lu. @radityadika https://t.co/B2QhasZMFk RT @Ayyu2695: @radityadika Di MM pengen nonton Hangout tapi kebagian paling depan :'v ehh pindah ke Mega bekasi XXI rame bettt u.u RT @afgan_alfauzi: @radityadika di Metropolis Townsquare sumpah rame parah https://t.co/PE9tUSNeY3 RT @Thania_tiwi: Parah bat bang @radityadika  gua dapet di barisan kedua dari bawah😩😩 https://t.co/dx8fdn5H6N Wadaw.. 😅 https://t.co/FAy9d9KYSu RT @Adesakti_01: Antrian di Solo Square nih bang @radityadika Gatau dapet tiket yg jam brpaa 😑😑 pdahal udh dateng dr jam 11 #hangoutmovie h… RT @Lintang_pw: @radityadika waduh bang untung udh dapet tiket, ngantinya sampe WC https://t.co/LXztn7fT4p RT @fany_kristianti: Di Pontianak juga ramai bang yg nonton hangout smpe buka 2 studio @radityadika https://t.co/MYfX7j8QRn RT @AliqDevan: Bang @radityadika \nSalam dari Gajah Mada Cinema Tegal buat hangout..... https://t.co/qJwLPLdZds Layarnya banyak kok. Jangan takut kehabisan. Hajar! https://t.co/RpoHc5HLe4 Wihhh masih jam segini bioskop dimana2 ramai nonton film Hangout. Kamu nonton dimana hari ini? https://t.co/7FfIEwvBUz Semangat! https://t.co/IPLL0Zzlip Waduh.. 😅 https://t.co/Yqv7kJfCjX Udah rame.. Buruan mandi, mblo.. https://t.co/mi69MDftqL Sabar.. https://t.co/hfe6bqtkO2 Keren.. https://t.co/8rossoAYoQ Nonton film Hangout ya gaes.. https://t.co/r4GSraI4LA Gokil. Banyak banget dari kemarin yg jg nonton 2x. Mau liat apanya lagi sih.. 😅 https://t.co/A37gm4hhqY RT @Dewipuspitajuly: @radityadika mau nntn lagi nih kak,dannn sendirian lagi nntne 😩 RT @deltasufianti: @radityadika uda 2kali bang RT @meighaitachi: @radityadika pengen nonton lagi bang RT @kaka_iin: W bang @radityadika rencana hri ini mo nnton lgi breng Ade n ponakan Ihiy. Kemarin penontonnya naik lagi. Siapa yg rencana nonton hari ini? https://t.co/X2fd0CTedZ Jam segini masih macet aja.. https://t.co/QlfhArcCWs Jatoh gaes.. sakit gaes.. https://t.co/RLUoqHgKc7 RT @7rizandinikiki: Hay ka @radityadika kami habis nonton film hangout. Full banget bioskop di samarinda, gak ada kursi kosong buat nonton… Trailer #filmHangout baru saja tembus 2 juta viewers. Senang.. 🤣 https://t.co/lOhVMzvodO RT @SuryaNi53670435: Gila film hangout di international plaza palembang hari ini full semua dan satu studio pada teriak2 and ketawa2 @Prill… RT @gilbhas: Nonton Hangout agak berasa kayak genre film Thailand, yang ada thriller, sedikit gore, tapi komedinya juga dapet. RT @gilbhas: Karena casts-nya berperan sebagai diri sendiri, jadi jokes di film Hangout asik banget. Banyak jokes internal kayaknya yang ke… RT @RossyanaYK: Dari film2nya @radityadika Hangout paling keren alurnya , gila gokil! Gak bisa ngmng apa2 angkat topi buat film Hangout! Su… RT @shi_gyu: Bang @radityadika jenius SUMPAH !!! film nya keren banget Sumpah N kak buat Dinda Kanya Dewi GILAAAAKKKK 👍👍 😄😄 https://t.co/g0… Layarnya banyak kok. Jgn takut kehabisan. Cus ke bioskop! https://t.co/tnQrhnD5wE Antrian Hangout dimana ini.. 😅 https://t.co/2RuEiRbB8r Wadaw.. https://t.co/akDI8Lby87 Mantanmu yg pake topi? https://t.co/zcVuEEDY8O RT @zulaekah_Aull: bang @radityadika  filmnya bagus bgt ceritanya nggak ketebak , masa 4 studio muternya film lu semua, good job bang https… RT @ciplux_luluk: Obat lelah setelah 6hari kerja 8-9 jam berdiri setiap hari 😤\nCakep amaaat bang @radityadika \n#hangoutmovie https://t.co/a… RT @IndosiarID: Penonton Film Hangout Membludak, @radityadika Cetak Rekor https://t.co/jQvMBJHHEZ via @bintangcomID https://t.co/7ai2cs8G7m Harinya Hangout beybeh! https://t.co/CjhnKumz5N RT @ji_jiee: Di padang show hangout yg paling banyak bg😅😅😅 @radityadika https://t.co/i8dwdU5vTz RT @Raditiyawisnu: @radityadika hangout keren, enjoy to watch, kocak. Lo berusaha bikin sebuah karya beda yg keluar dr pattern film film lo… Reaksi penonton kemarin di salah satu bioskop.. https://t.co/pfiLli6KHe RT @244Ruma: Keren ih di citra 21 semarang hangout 3 layar dri 5 layar @PrillyBie @radityadika RT @MijanisticPKL: Suasana liburan masih rame pada ngantri tiket hangout @radityadika  #Pekalongan https://t.co/GPAL4M52L0 Semangat! https://t.co/6SNIZsBIdx Wih... https://t.co/KBCGWZ4dlu Penontonnya naik terus tiap harinya. Siapa yg berencana nonton hari ini? https://t.co/qclG5VVIrg RT @Abhikuw: Film Hangout ngakak ga berenti dari awal sampe akhir. You're genius bang @radityadika, yakin deh 3juta penonton!! https://t.co… Pagi. Jumlah penonton #filmHangout kemarin naik lagi dari hari2 sebelumnya. Sebentar lagi akan gue share total jumlahnya sampai hari ini ya. Raditya Dikatakan itu siapa.. https://t.co/0thU1KvV0I Mirip kok.. https://t.co/TywnuJeO5g RT @galuhan: Bang @radityadika gua habis nonton Hangout. Gila da ngantri jam 12.30an dapetnya jam 18.45. Tegangnya dapet, komedinya dapet! 👍 Hangout with little bro. https://t.co/iltHR7Mur1 Sedih gak ikut kak Soleh dan kak Prilly nobar tadi. Rame banget.. https://t.co/tXsN0haNIF RT @Peny_manjava: Film yang berbeda karya @radityadika gokil sih gak ketebak, dan endingnya sialan ngakak bgt asli😂😂👏👏👏 #Hangout https://t.… RT @DeviPrillvers26: HANGOUT alurnya Gk bisa ketebak Bikin Penasaran+ngakak Nontonya😀 Ceritanya MISTERIUS bgt 😁Yg gk Nonton Nyesel👍 @Prilly… Yg malem Minggu nonton #filmHangout tunjuk tangan! Nonton sama siapa? RT @sarahseptiani02: @radityadika nonton film hangout gak nyesel, komedinya dapet, tegangnya dapet, dan udah berkali2 salah nebak pelakunya… Review film Hangout paling komprehensif dan enak dibaca. Makasih sudah menonton. 🤣 https://t.co/Yftsh1JGNQ RT @ida_zee997: Nonton #filmhangout yg ke dua kali dlm mggu ini😂😂😂😂...keren bgt film nya @radityadika ..bikin pgn nonton lagi dan lagi🙏🙏👍👍👍… RT @HanaPutriHana4: Setiap bioskop pasti penuhh sama penonton yg nonton Film HANGOUT Luar biasaaaa 👏👏 @PrillyBie  @radityadika Makasih Bang. Means a lot coming from you! https://t.co/ZzQUYcjV8l Sampai di bandara ditanyain infotainment soal banyaknya penonton film Hangout. 🤣 https://t.co/gP6JywKTSb RT @Ifa_Mubarok92: Gokiiiiiilll!!\nBenar benar!\nIt's your best film ever, Bang @radityadika \nKongrets!! Keren keren keren Bekasi! https://t.co/7nweofTxYE Segitu banyak nonton sendiri? Kasian.. 😢 https://t.co/oSmbtrjpJK Jangan lupa share foto tiket hari ini di Instagram untuk dapetin handphone Vivo V5! #hangoutwithvivov5 https://t.co/v9AAX4ITxr Tiap hari makin ramai. Siapa yg nonton hari ini? https://t.co/BL00i3uWsV Makasih semuanya udah datang. Acaranya seru sekali. Senang bisa ke Aceh. https://t.co/oXcasXX3u5 RT @devirizkia73: Pertama kali nonton bioskop selarut ini, demi film Hangout bang @radityadika Dan hasilnya lebih dari memuaskan bang! Cong… RT @wiranagara: Baru saja melihat film #HANGOUT karya pak @radityadika. Terima kasih telah menyajikan sensasi lucu-lucu tegang, keren! 👍👏🙏… RT @Saihacky: Barusan nonton hangout, seru bgt sih filmnya, alur cerita gk ketebak, horornya dapet, komedi apalagi. Film yg wajib di tonton… RT @fery_julians: Film Hangout, seru! :D karya terbaik @radityadika sejauh ini. The best Indonesian film comedy in 2016 I think. Makasi.. 😙 https://t.co/3oGmhMGrY7 RT @FeniFadilah: BANGGGG SATU KATA BUAT HANGOUT \"EDAN\" sumpahhhhh parahhh dahhhhhh , sukses insyaallah aamiin 🙏 @radityadika Senang. 🤣 https://t.co/eSP88ggxyq BESOK film Hangout tambah layar lg sehingga akan main di 280+ layar. Jangan takut kehabisan. \n\nCek bioskop kota kamu untuk jadwal mainnya! Baru dpt kabar perolehan jumlah penonton film Hangout hari ini lebih byk dari kemarin. Thx semuanya. Besok gue share total penontonnya. 🤣 Besok juga pada nonton yaaa.. https://t.co/pJeNTjXk4Z Coba besok ya.. https://t.co/R92fFYgUjq RT @twittYudieAmel: Bang asli ni film lengkap, lucu, gokil, nyeremin, dan bener2 ga bisa ditebak, asli keren! #filmhangout @radityadika htt… RT @Rmulianingsih_: @radityadika Gilaaaa HANGOUT kerenn parah!!! Pecahh! :D:D Gokill,bikin deg-degan jugaa, alur gabs ditebak:D:D RT @Anatasyaa10: @radityadika iya bang radit, film bang radit yang satu ini bener2 emejing deh suka banget kerenn abiss,udah ntn tpi masi a… Terimakasih untuk semua penonton film Hangout hari ini! https://t.co/vOhu2PawRb RT @YuniHermawati9: Gilaaaa penuuuuuuuh banget bg @radityadika, tgl yg di dpn dpn aja 😥\nKali ini nton filmnya be2 dgn adik 😊😊 https://t.co/… Film Hangout kayak gimana sih? Liat aja nih reaksi penonton hari pertama kemarin.. 😘 https://t.co/FErDwl7HBI Ujian nasional.. https://t.co/oecKivYPyq RT @yollavita: @radityadika semua rasa jadi satu, tegang, kaget, lucu, dan susah ditebak banget, terus berkarya yaa bang, ditunggu film ker… Kok serem ya.. https://t.co/qgkPg3Ubzp Makasih kak. 😙 https://t.co/tNQV5siWWC RT @BungTheloe: Setelah melewati antrian akhirnya fix saya bisa nnton film Hangout bang @radityadika DeltaPlaza SBYA full https://t.co/MHQC… Pantes idung gue berasa gatel.. https://t.co/y5MrLHGXrx RT @cinema21: Selamat untuk film HANGOUT. Hari pertama raih 121.811 penonton. Sedang tayang di bioskop. https://t.co/3xzIPg4Qnr https://t.c… Potret seorang penulis yg ngopi di tempat yg salah. https://t.co/MJkF7cWZ7l Ada bagi2 handphone buat penonton film Hangout di Instagram gue nih. #HangoutwithVivoV5 https://t.co/EyRXvW3Cl4 Cus pada mandi langsung ke bioskop! 🤣 https://t.co/S3VGJHbYXE Masa sih.. 😅 https://t.co/dhMoBkKhIs Iya. Ada penambahan layar. Cek bioskop kota kamu. https://t.co/3rk8dS0Idx Hari ini jangan pada kehabisan. Cus berangkat! https://t.co/406J4a32Hq @VinoGBastian__ makasih kak vino 🤣 Terimakasih semuanya! Bener2 gak nyangka penonton hari pertama bisa sebanyak ini. Yg mau nonton hari ini tunjuk tangan! https://t.co/2PKmLIFzJ2 Bentar lg gue share hasil jumlah penonton hari pertama #filmHangout. Ini peroleh penonton hr pertama terbyk sepanjang karir gue. Happy.. 🙃 Melepas lelah dulu.. https://t.co/GzfAKglscU Baru dapet kabar film Hangout hari pertama tembus 100.000 penonton. Besok angka pastinya akan gue share. Happy! 😙 Senang kesan orang2 yg nonton film Hangout positif semua. Yg belom, besok nonton ya.. 🤣 https://t.co/Pm1vlUYmSB RT @Bolank_az: @radityadika film yg serba ada. Ada tegangnya, ada kocaknya, ada dramanya, ada semuanya. Pecahh #hangoutmovie https://t.co/F… @sVi2 makasih ya udah nonton! RT @sVi2: Di menit ini, muka tegang. Di menit selanjutnya, perut yang tegang. Komplit! Komedinya segar. Sangat! #Hangout @radityadika RT @sVi2: Alurnya juga super bagus. Penggabungan thriller dan komedinya nge-blend dengan apik. Seru dan lucu jadi satu. #Hangout @radityadi… RT @sVi2: Yang pasti, pas credit Sutradara: @radityadika muncul, satu studio tepuk tangan. Dan aku merinding #Hangout RT @sVi2: Ending filmnya enggak ketebak. Aku sama adek main tebak2an dan kami berdua salah. #Hangout @radityadika RT @dheeNizhaa: ya ampun bang @radityadika film hangout bener2 bagus bgt, ada tegangnya, misterinya, dan lucu bgt ampe mau nangis nntonnya… Sweet banget sih ini. 😙 https://t.co/3YNi6Zfo3c Iya say.. https://t.co/ObtVHLSOfF Hari yang capek nan melelahkan tapi seru banget. Makasih semuanya yg udah bikin film Hangout hari ini pecah berhamburan. Satu buat pacar khayalan? https://t.co/dRX6u1JEsP Jangan spoiler yaaa.. https://t.co/4JY0cDekQJ RT @mira_nov: Gilaaaa film nya bikin tegang , gokil parah, bikin ngakak mulu dari awal sampai akhir film @radityadika  @PrillyBie #nontonba… Seringkali kita harus bertahan sedikit lagi untuk mencapai mimpi kita. Yuk #SemangatLangkahBaru melewati target! https://t.co/M1ofrOG0Gv Berkat kerja sama semua yg terlibat. Makasih ya.. https://t.co/teTH2sroVk Duh.. 😍 https://t.co/u9fUAAk2xQ RT @nyinyaam: Gilak! Satu kata buat Hangout @radityadika 👏🏻👏🏻👏🏻👏🏻👏🏻alurnya bagus b g t. Gilak. Rame! https://t.co/PJBDPLMOVN Wihhh bioskop mana nih? https://t.co/mW75InXwfD RT @mfathurrk: Gokil film #Hangout nya @radityadika. Ada kali sampe 5x ganti tebakan siapa pembunuhnya. Ujung2nya tetep salah. https://t.co… Ssstttt.. 😙 https://t.co/yLaybT16Ee DENGAN KEKUATAN HENGPON JADUL CEKREK2! https://t.co/OjTxUSLyAL Makasi udah nonton! https://t.co/pYjfiupm9m Isinya kucing.. https://t.co/zRZLZw1VjT Yg mau nonton buru2 yaaa.. https://t.co/xgYsd8BWaV Coba lagi besok ya.. https://t.co/d07IuO5B3R Ssssst... 😙 https://t.co/N4KoJUkyXn Coba besok ya. Dari pagi aja.. https://t.co/2OsDK7vTWb Stttt.. Jangan spoiler yaaa.. https://t.co/nBzMOOkpDm Ngakak sampe nangis. 🤣 https://t.co/Lc0shnoQQB Baek2 leher pegel ya.. https://t.co/qgZjD5VizZ RT @NatasyaAlodia_: gapernah bosen nontonin karyanya @radityadika gokil seru sedih geli tegang dagdigdugnya dapet! salutttt😂😂😂 https://t.co… RT @melati_alif: Antrian Film Hangout di XXI Banjarmasin... Fix bgt @radityadika keluar dr zona aman... https://t.co/pPE5PRqFpM Film Hangout di bbrp bioskop sudah habis ludes sampai show terakhir. Baru aja layar ditambah lagi. Cek bioskop kota kamu untuk tambahannya! Laporan pandangan mata. https://t.co/7jsdVBahjF Keren.. https://t.co/yFxKIDDkXP Papah.. 😑 https://t.co/x4HNlF7qcb Kak Titi Kamal dan Christian Sugiono lagi mau makan nih gaes.. https://t.co/he2ZtU4p9h Kok ga keliatan ya.. https://t.co/8RnPIjOHuY Tuh temenin, mblo.. https://t.co/qHYiVCjWWS Gokil malang.. https://t.co/kELiTSNZWV Ngajak ibu Hangout di hari Ibu.. 😚 https://t.co/ObvSscuMWn Mantap! https://t.co/uimRqpVct9 Pink atau ungu nih kursi di kamar hotel gue? https://t.co/pIaZh9X8lg Bioskop yg nayangin film Hangout hari ini. Kamu nonton dimana? https://t.co/kO9AAXJjKj *DEG* https://t.co/emKr0SvTZz Dimana ini? :( https://t.co/SVX0YOIFdA Satu hari full? Gokil Lombok.. https://t.co/M9HzO7D2Ha RT @ilhamidris17: Akhirnya Padang tayang, mari nonton @radityadika 😄☺☺☺ https://t.co/GrPqLGzDeu RT @Novitayuliantka: @radityadika ini bang demi hangoutttt di Lippo plaza Jogjakarta.\nWith @Gabby_mns https://t.co/HVAIvvI9FE Tiket film Hangout di Jogja City XXI sudah sold out dari pagi sampai malam. Yg mau nonton, bisa coba di Ambarukmo Plaza XXI atau lainnya! Cakep tuh. Berbakti sekali.. https://t.co/JUrYFbs3Lf Cek di website bioskopnya aja ya. https://t.co/C9W9tIkSoE Selamat menonton! https://t.co/43ZVpNKqTq Kompak abis nih kelas.. https://t.co/yhzcMDnkR4 Dimana ini? https://t.co/kvY5WG7fqh Tambahan meet and greet dan nobar hari ini di Jogja:\n\nCinemaxx Lippo Plaza Jogja \nKetemu di dalam studio 16.45 WIB. \n\nSee you soon! Film Hangout resmi main di seluruh bioskop tanah air mulai hari ini. Selamat menikmati kerja keras kami, teman2. Semoga terhibur. Pecahkan! Gara2 mukanya kebelah?!!! https://t.co/uVzKYdcWXw Confirmed kok. Mulai besok bisa beli tiketnya. https://t.co/Ak9eLFXRRi Pemimpin idaman masyarakat. https://t.co/i8wK7Bnp24 Iya, seluruh Indonesia. https://t.co/Lepo5e1kQd Kamu gak mau membelah diri aja? https://t.co/yaVJs89HYY Minta pacarmu yg beliin.. https://t.co/C394X17iwA Mana yg sekarang lebih sering kamu pakai? RT @ErnawatiWau: Gk sbar nunggu bsok nh @PrillyBie @radityadika @HangoutFilm @gadiiing @Titi_KamaLL ,sumpah demi apa woyy gk sabar bget,,pe… Siapa yg nemenin? https://t.co/cFqeXA6T7H RT @KompasKlasika: Penggemar karya-karya @radityadika? Jangan sampai melewatkan @Hangout_Movie. #TriviaFilm https://t.co/VciDR7eSim Hmmmm.. https://t.co/hV9IXA7ovl Wah papparazi nih. https://t.co/VqX9WwOAvN Potret seorang penulis yg pesawatnya kena delay.. https://t.co/9OepPDeh03 Yoooo Bandung siap yoooo.. https://t.co/HgiB2ETZP8 Wah parah nih @solehsolihun.. https://t.co/tcN0FBri81 Prillvers pada ngatur jadwal nobar #filmhangout  sesama fans di kota masing2. Gokil. Sohunvers (Soleh Solihun lovers) juga gak nih?! RT @PrillversLMBK_: Haiii prillvers lombok sampai ketemu besok yaaa 😎😎💐 @PrillyBie @ofcprllvrs @radityadika 😎😎 https://t.co/eNe9C3GaHD RT @tiararezkydp: Gak sabarrrrrrrrrrr😂\nKasian saos mamang bakso nya abis ditulisin bgituan😂😂 @radityadika https://t.co/cW5QOcvb4B Tuh.. https://t.co/ueaooUqhxW Besok.. https://t.co/rd9icLIFsm Potret seorang penulis ibu kota yg sedang diet, menahan godaan satu buah kue keju. https://t.co/5bgRCak1Py Diet hari ke-dua. Lumayan, turun 125 gram. Dateng ya! https://t.co/FN3uSnh01I Vlog baru! Soal roadshow ke Bogor, DEPOK, Dan Jakarta: https://t.co/KPMxenj3R1 Udah pada siap nih nonton #filmHangout  besok. Mention temen kamu yg mau kamu ajak nonton besok. https://t.co/RmoRyBa2N6 Uncle telolet uncle. Menunggu berakhir besok.. https://t.co/PZxGveCy52 Kata kak @sherylsheinafia soal #filmhangout.. https://t.co/y9Cc3L1eyG Besok nonton jam berapa sama siapa gaes? https://t.co/jOeAHd6WLN Kata temen2 yg udah nonton #filmHangout duluan pas premiere.. https://t.co/CHOYDFmLDq Presale tiket #filmHangout di Jogja City XXI untuk tgl 22 Desember 2016 sudah habis terjual. Sekarang buka layar baru. Habiskan! Jakarta! https://t.co/6cfiFWXB6W Lusa mau nonton sama siapa gaes.. https://t.co/UayjGN4jfO AKU SIAP. https://t.co/viCwfvgfai Kucing nungguin ikan asin. https://t.co/A1H4RfekzN Lagi mau foto kopi kok ada penampakan apa ya.. https://t.co/5wuByatMxG Shooting buat YouTube dulu gaes.. https://t.co/VPSz93G6Hr Penantian berakhir lusa.. https://t.co/7VT7kPgiCV Kalau ga bisa tidur malah jadi liat2 poto taun lalu pas lagi kurus2nya. Makin stress ga bisa tidur. https://t.co/9mOjKNNR6A Kata kakak2 cantik yg nonton #filmHangout pas premiere.. 😍 https://t.co/TjAY5S4CO1 Jogja. Habjskan presalenya! https://t.co/S6Yr39Mwlx Lombok. Habiskan presalenya! https://t.co/DLvnyA8ffk Bandung. Habiskan presalenya! https://t.co/4I4Hp7QdiU Hai gadis2.. https://t.co/t8R97l4AwC Gokil.. https://t.co/NTLW88uJ4K Gue selalu menghargai yang datang on time. Gue pun lebih milih dateng kecepetan, daripada terlambat. #SemangatLangkahBaru https://t.co/RjbUBvAB6x Tinggal menunggu 3 hari lagi.. https://t.co/PLwGL6W3rd Vlog baru! Tentang keseruan pas premiere #filmHangout: https://t.co/3sEzTMO1FA Itu balon apa.. https://t.co/oeQjG42y4U Habiskan presalenya! https://t.co/RobJGIq2Qj RT @irfandhani11: 4.5/5 Recommended bgt! #FilmHangout @radityadika https://t.co/JhnBAHgaIP Hmmm.. https://t.co/PDViXG04OI Hari ini meet and greet film Hangout di Bandung. Di CGV PVJ jam 11.30 dan jam 16.00 di XXI Trans Studio Mall Bandung. See you there. Good morning from Bandung. https://t.co/KLqBGVOvRO Berhasil gak? https://t.co/93Zoj8sVTi Nih ada promo lagi khusus yg mau nonton di Blitz atau Cinemaxxx. https://t.co/IJcXtLZOlU Oh gitu.. https://t.co/iINwfVw6lQ Masih bingung mana yg harus post ke instastory mana yang post ke instagramnya.. RT @nadyaaputrin: @radityadika Film Abang yang paling seru dari yang seru. Nggak nyesel nonton. Terhibur banget. Puas pokoknya. 😊#FilmHango… RT @Risef19_: Tangerang gada meet and greet dan nobar lgsg sikat tiket presale✈🏃. Dptin tiket dr panas👉hujan👉sampe  panas lagi. Terbaik👌 @r… Habiskan presalenya! https://t.co/2R6QxmHx1O RT @Vinz_juventini: Ikutan roadshow kmaren malem nih bang @radityadika , Hangout keren! Kalo kata cwe g, ini film u paling bagus bang 😆 htt… Makasih udah beli presale film Hangout. https://t.co/6zXOv2PAsV Buset.. https://t.co/yitcp0Kkxm Kenapa gue kalo upload video di Instagram keluarnya lama bgt ya? Ada yg tau biar bisa lebih lancar? Di Twitter dan Facebook ga ada masalah.. Reaksi orang-orang yang menonton film HANGOUT.. https://t.co/q7oiEB7rvp Sarapan dulu gaes.. https://t.co/MhQL8c6KCr Pagi.. https://t.co/Z5yqNvw1Uc Review #Fallen: film ini cocok ditonton buat kalian yg emang lagi mau nonton film cinta2an dengan sudut yang berbeda. Keren. cc: @cinema21 Review #Fallen: menurut gue adegan action dengan romance-nya terjadi dengan baik. Di beberapa scene kebawa baper pula. cc: @cinema21 Review #Fallen: kalau ada yg kangen sama cerita yg menggabungkan antara romance dengan fantasy, film ini bisa mengobati. cc: @cinema21 Review #Fallen: film ini dari novel oleh Lauren Kate, ttg cowok dan cewek di sebuah asrama, yg ternyata penuh rahasia masa lalu. @cinema21 Sebelum nonton Hangout ada film bagus juga di @cinema21 lagi main nih, judulnya #Fallen. cc: @cinema21 Gokil sambil nonton vlog shooting-nya. https://t.co/6YO1TsXoaM Habiskan presalenya!!!! https://t.co/G0zcsiUPNf Teman tidur malam ini.. https://t.co/cgdousUdBR Ebuset.. 😓 https://t.co/UrLXCfusRw Gokil.. https://t.co/Zb5Wa3Klbo Makasih kak sudah menonton. 🤣 https://t.co/0xjrkefAJt RT @AgitRafli: Tinggal nunggu hari deh @radityadika https://t.co/ghRGDTXOYg RT @mrssawada: Sdh beli tiket presale  film #filmhangout @radityadika ,gak sabar nunggu tgl 22 https://t.co/5TGYlP5XLE RT @AzhariFirdaus3: Pecah abis filemnya seru bener dah engga nyangka bakalan seru dah pecah abis sukses buat bang @radityadika pengen nonto… Habiskan presalenya! 🤣 https://t.co/EzW62P8gxC RT @ShoutCap: #ShoutQuiz dimulaaii!!!\n\nTwitpic EKSPRESI kamu kalo dapetin Topi \"Nungguin Film Hangout\". 10 Shouters paling BEDA bakal dapet… RT @rifdahnurhdyt: bangg @radityadika\nI got it bangggggggg;33 Can't wait!!! https://t.co/gARXKL9xCC @hasanghozali mungkin ada keterlambatan ekspedisinya coba diomongin aja sama 21 apa perlu tinggalin kontak biar dvd sampai langsung di telp Makasih udah nonton duluan! https://t.co/4hzq9OOYPa Legend juga nungguin nih.. 🤣 https://t.co/vYO3Iy8y2k Nice.. https://t.co/oON8amuBDb Ehm. Berapa hari lagi ya #filmHangout.. https://t.co/ZesTiuW5nL Hari ini tiket film Hangout sudah bisa dibeli di bioskop2 tertentu.. https://t.co/eylBjVv6Fp RT @Tiaraoktvn01: PECAH FILM NYAAA!🎉 ga bisa stop ketawa😂 pokoknya film hangout OMG😝! WAJIB NONTON YAAA❤ @radityadika @HangoutFilm https://… Buset.. https://t.co/whO3edykDT Baru sempet rebahan istirahat di rumah. Sumpah badan remuk redam. Enaknya ngapain nih.. RT @winggawing: Dari semua filmnya bang dika. Ini yg paling keren menurut gue. #HangoutMovie @radityadika @PrillyBie  👏🏻 RT @winggawing: Hangout wajib banget buat yg pengen ketawa lepas. Semua aktornya berperan bgt, ga ada yg tempelan. Sampe pegel ketawa terus… RT @asmania_sari: @radityadika  saya sudah nonton 2 kali bang saat gala Premier dan nobar depok.Sumpah superduper KEREN 😘 RT @ShoutCap: Shouteeerrss 🗣\n\nSiap2, besok shoutman bkl bagi2 ShoutCap \"Nungguin Film Hangout\" film karya @radityadika . Pantengin trs time… Review film Hangout lagi: https://t.co/wBxDBrJDSJ HangOut Saat Raditya Dika Keluar Dari Zona Nyamannya Ini kenapa ya.. https://t.co/io5h7ibZbz Bukan. https://t.co/Hu8ZwHajWR RT @annnashr: Kmrn bgt nih di premiere #filmhangout , seruuu bgt film nyaaa!! Tegang2 ketawa gmnaa gitu 😌 @radityadika https://t.co/MNJJLpD… Rispek! Ini baru struggle!!! https://t.co/UZF1SFSJb1 Review film Hangout udah ada yg keluar nih: https://t.co/QRus8lyr5C Meow.. https://t.co/upErEy7DwC Waasap Bogor! Selamat menikmati duluan #filmHangout! https://t.co/fmTbDBBU7P Bentar ya make up dulu.. https://t.co/t4JhQVdN1d RT @bahanafmjkt: Udah siap denger obrolan seru @benniardy sama @radityadika? Nah, sebentar lagi nih teman Bahana! https://t.co/ifAsK3QwBn Besok nobar Hangout di Blok M Square sisa 30 kursi nih. Bisa dibeli dari hari ini. Habiskan! 🤣 https://t.co/RdRLU2LQmv Waduh.. Besok ada presale lagi kok kak.. 🤣 https://t.co/bp53z1VWHp Enam hari lagi gaes.. https://t.co/zgbEbMHAw4 Untuk bioskop lain tiket film Hangout akan dijual tgl 22 Desember 2016. Presale hanya di bioskop2 yg gue sebutkan di tweet sebelumnya. BESOK TIKET FILM HANGOUT UNTUK TGL 22 DESEMBER UDAH BISA DIBELI! WOOHOO! https://t.co/LjXZ2NH5YC RT @sintalv: udah ga paham lagi sama isi otaknya @radityadika pas bikin film #hangout. luar biasaaaa, thriller nyampur sama comedy jadinya… Makasih udah nonton! https://t.co/QWOtSdhWr5 RT @prapancadf: Gala Premiere \"HANGOUT\" film nya seru bangettt asliiii. Congrats @radityadika 👏🏻 [vid] — https://t.co/UFnQ1HY8Sp Hahaha thanks rapper favorit. https://t.co/pIKkXghhG5 Makasih Uus. 😘 https://t.co/WVcsADIXq7 Siapa yg kurang ya.. https://t.co/2tC87OOk50 Roadshow mulai besok gengs. I'll see you there! https://t.co/zgV4tMNp15 Gemes level 3 juta. https://t.co/Rh78nKXFxa Video lirik dari OST film Hangout yaitu \"Mati Rasa\" oleh Kotak telah keluar di: https://t.co/1v3b30j47w RT @Dindasftrrr: Salfok nih, antara fokus kerja sama fokus liatin kalender terus @radityadika #nungguinfilmhangout #filmhangout https://t.c… Selamat siang. Persis seminggu lagi.. https://t.co/PfVpQUHgfP Sebentar lagi di SCTV! https://t.co/SzHk5WVwgS Sebentar lagi bersama cast film Hangout yg lain akan main2 di Inbox. Siap2 yaaa.. RT @Nauraiq3: Udah sampe kesini bang @radityadika https://t.co/r6qKi6x8aX Nice... https://t.co/yeAL7T9Y5M Sebentar lagi kelar.. https://t.co/xB9fiYJZQi Yang jelas ada gue di roadshow Jogja.. https://t.co/rnSZ2g8fK2 Sebentar lagi promo #filmHangout di DA Academy Indosiar. Siap2 gaes.. https://t.co/IHDTk92hzM Makasih ya.. https://t.co/oBQxteanw6 Satu Minggu tambah satu.. https://t.co/0pnS0ezy3o Masih live di Indosiar gaes.. https://t.co/X7K9YCsU1N Hahaha seru abis ini.. https://t.co/yB6kO71AX8 Hari ini jadi komentator superawam di Dangdut Academy Asia. Tonton ya di Indosiar jam 18.00 sampai 00.00. Gue ada dari awal sampe kelar. 😙 https://t.co/wfvSegHe7V Vlog baru! https://t.co/DaCBk7dZvm Wuih tiket nobar udah laris manis nih. Hahaha. Sampai ketemu! https://t.co/ssvMLIoJvb Berapa hari lagi ya.. https://t.co/lbxLoMMeMr RT @Wahyuni_openni: Bang @radityadika aku baru lhat trailer film #hangout . Gila bgus bgt , bikin penasaran . Jadi pengen nonton deh minggu… Menjelang minggu depan main di bioskop, trailer film Hangout tembus 1.5 juta views. Mari yg belom nonton: https://t.co/KuNhGaZFMK RT @BookMyShowID: Mau nonton HangOut? Add akun Line @bookmyshowid (gunakan @) jawab pertanyaannya, dan raih Undangan Premiere #bmsgiveaway… Lagi nungguin giliran main gundu tajir. https://t.co/wXaZAgGfbR Kurang macho apa lagi tempat kopi gue nih.. https://t.co/5gak4IDs5K Back with my crew. https://t.co/kXuyEOexqz Cewek2 ada yg mau nemenin nungguin gak? https://t.co/SMEY16UpF2 Hmmm.. https://t.co/rpawTmdmJI Tahun lalu lah.. https://t.co/z5gwMNP92G Sisters. https://t.co/HTK7teMKag Kira2 aja.. https://t.co/wVyGu9EiW6 Udah bisa dihitung pake jari gaes.. https://t.co/h1Ppq7awOd Aku juga.. https://t.co/WEic6t2d6W Pecah gentayangan itu gmn ya maksudnya.. https://t.co/b0IB200JwR Sound locked! https://t.co/9IMHjEfI3T Preview tata suara dan musik #filmhangout.. https://t.co/Q7x6M4YAIM Selamat pagi. Mention temen kamu yg juga nungguin #filmhangout! https://t.co/AV65dtRetQ Abis kena jebakan Batman.. Pada dapet salam nih dari bule.. https://t.co/ydNYrFOXSi Kumpul2 temen kuliah di Australia dulu. I miss Adelaide. 😢 https://t.co/cyJCgiCi1M Naksir pangkal stalking. Hari terakhir lo untuk upload foto keren dgn Coconut Delight dan tebak kata dia https://t.co/bJILfBiZYf menangin hadiahnya. #KepoinRasanya https://t.co/pPZP1Hwall Berasa nih didadahin. https://t.co/bPRZUGo7fp Sesungguhnya tiada yg lebih lucu dibandingkan bayi Sphynx yg sedang tidur.. https://t.co/ERrRFqJ957 Hmmmm.. BSD bukan? https://t.co/aKw7Kba9kj Makan gudeg 3x sehari itu berlebihan gak sih? Selamat pagi.. https://t.co/tYYA7G7V39 Seperti biasa kalo ke Jogja.. https://t.co/BMVvbJxSoh Udah tau mau nonton sama siapa? https://t.co/JXJCtJZ8iG Mendarat di Jakarta. Napas bentar, langsung terbang ke Jogjakarta.. Kenapa WC cowok di Thailand yg bersihin itu mbak2. Bikin kaget tiap masuk WC. Kirain salah masuk.. 😥 Hey cyin.. https://t.co/2ayoTzX1em Berapa hari lagi ya #filmHangout? https://t.co/uROmTNAtwO Thoophay. https://t.co/ntdRCZC5ch Upload foto keren lo dgn Coconut Delight dan ikut tebak kalimat di https://t.co/bJILfBiZYf utk menangin hadiah seru. #KepoinRasanya https://t.co/6At8oYIYkj 13 hari lagi #filmHangout main di bioskop. Tonton trailernya di: https://t.co/KuNhGaZFMK Kopi di Thailand sore ini.. https://t.co/zEcSsAjaF4 RT @FalconPictures_: Film Hangout, Raditya Dika Gabungkan Cerita Detektif dan Komedi https://t.co/I69oKcL7Dz https://t.co/HvlNrnNLEc Kucing hilang. Siapa tau ada yg liat.. https://t.co/c5Mfqf5Osn Korban berikutnya.. https://t.co/ZZCKUI8d6P @pandji @ernestprakasa 😘😘😘 Tandai kalender kalian! Siap2 ketemu cast #filmHangout! https://t.co/bN4M4eoTHj Uuuu.. ~ https://t.co/b9WmwGJC4U Mari kerja di Bangkok.. https://t.co/GeRK6M6Oep Pada dapet selamat pagi dari Kak Pevita.. https://t.co/Rjf59i9P8e Selamat pagi dari Bangkok! https://t.co/RbFVsEHVuq Bagi kaum jomblo, long weekend itu rasanya dua kali lebih mencekam dibandingkan malam Minggu. Wadaw... https://t.co/2O4ZdJUIVB Gue udah #KepoinRasanya Coconut Delight dan ikut tebak di https://t.co/bJILfBiZYf yuk ikutan dan menangin grand prize ke Thailand! https://t.co/w5E5O79g4O Persis dua minggu lagi film Hangout tayang di bioskop. Nih yg belom nonton trailernya: https://t.co/KuNhGaZFMK Di Bangkok lagi.. https://t.co/K9DMctrI1K Vlog baru! https://t.co/xpQAGHqdXu #nowplaying Sincere - \"Elephant\" Tebak gue lagi di negara mana.. 😓 Boleh.. https://t.co/NDQn5Mb7u3 Ada yg mau nemenin dia nungguin #filmHangout? https://t.co/QiAuhXC30X Orang2 yg bilang \"cinta itu tidak perlu memiliki\" biasanya memang jarang dimiliki. Betul? Potret seorang penulis gabut di siang hari. https://t.co/YfpB4UwiH7 Nyetem.. https://t.co/gkHhPEDIeP Pagi, kamu.. https://t.co/LDuo5AdwT2 Jam2 yang nanggung buat ngopi. Duh, bahagianya aku.. https://t.co/tEtGfUfQaA RT @netmediatama: .@radityadika VS @sarseh battle karaoke lagu Korea di @SarahSechan_NET! ;D https://t.co/g7qW1rVLFW Sebentar lagi LIVE di SARAH SECHAN NET TV! https://t.co/Ycd8h7xmF8 Meeting pertama hari ini. https://t.co/ueaJL3Fyez Kiatnya? Jangan mikirin uang. Lakuin apa yg kita suka. https://t.co/fGRpSqfHrB Selamat pagi.. https://t.co/xppJ3SXi2P 17 hari lagi film Hangout main di bioskop. Tonton trailernya di: https://t.co/KuNhGaZFMK Waduh ketauan dong? https://t.co/ifKBomj0hU Berasa. https://t.co/IRssQkieRe Kerjaan hari ini.. https://t.co/y1XOrJ3f4t Kak Titi di film ini berperan sebagai.. https://t.co/lwjXEpCVEt Selamat pagi.. https://t.co/Q5aqFI7J5x Main Overwatch dulu. Ini yg gue pake bukan Om Indro ya.. https://t.co/3ObmfJxLOZ Iya.. https://t.co/x1aGkDVKyb 18 hari lagi film Hangout main di bioskop. Tonton trailernya di: https://t.co/KuNhGaZFMK Di bawah langit Makassar yang muram. https://t.co/P65ysz0Nv4 Si cantik.. https://t.co/JlmQU3Jb8S Buat yg kemarin ikutan.. https://t.co/JZmPb4o6Ak Selamat pagi.. Kasih tau nih #filmHangout berapa hari lagi.. https://t.co/PfrS4prbbv Good morning from Hammer.. https://t.co/WgYyBLajlq Sumpah demi apa woy mau meninggal guweh.. https://t.co/sNoW4odDTN Sembilan orang yg terlibat di #filmHangout akan memerankan diri sendiri.. https://t.co/YYXAYKoh2i Setiap malam minggu.. https://t.co/6KuZOkrCaH Malam minggu sendirian di rumah hujan enaknya itu _____________________. (Isi sendiri) Hayooo ada yg tau gak ini dimana? https://t.co/7Zn916m37x Ngerasa. https://t.co/iuaWUeKvO4 Dimandiin kucing.. https://t.co/MzNxbUjISm Sungguh tiada nikmat yang paling tinggi selain masakan padang yang dihidangkan hangat2.. Sabtu yang mager.. https://t.co/RlCWgmlcCu RT @netmediatama: TERBUKTI! @radityadika adalah Si Buta Dari Gua Hantu. Kalau gak percaya liat aja cocokologi @Ini_Talkshow kali ini. https… Pagi. Berapa hari lagi nih #filmhangout? https://t.co/gR3XsXCiui Cocokology Ini Talkshow di NET TV lucu luar biasa. Udah lama gak ketawa selepas itu jadi bintang tamu. 😂 Wadaw tuh pipi.. https://t.co/detaMp3Qzz RT @netmediatama: Aktingnya menjiwai banget deh bang @radityadika. Iya tarik nafas... buang... :p #IniTalkshow https://t.co/2Br7O2yULJ Hai2! https://t.co/4pqONVIsDI Makanya diet.. 😂 https://t.co/7zE1MRj5wF Sebentar lagi LIVE di Ini Talkshow NET TV! Siap2! 20 hari lagi film Hangout main di bioskop. Tonton trailernya di: https://t.co/KuNhGaZFMK Hayo mana yg Depok, Bekasi, dan Bogor? https://t.co/ruu0XnWLMI Ribut lagi pagi2.. https://t.co/0Vn7hoyynG Kata si kucing: \"Hadeeeh.. Berapa hari lagi sihhhh?!\" #filmHangout https://t.co/Mw4p5NGaIb Hmmmm.. https://t.co/8ZiBSnHRlb 21 hari lagi film Hangout main di bioskop. Tonton trailernya di: https://t.co/KuNhGaZFMK Lho, aturan artinya rumah sakit dong? https://t.co/IMvOYZ9A0w Tadi pagi niar mau diet hari ini. Sekarang jam 1 siang dan baru saja makan 8 butir tahu goreng. Congrats semuanya! Nonton ya gengs.. https://t.co/cFxcttPNgf Selamat pagi. Udah masuk Desember nih.. 😌 https://t.co/WJMuWlXuPI RT @video: Chill out and enjoy some soulful blues from @radityadika. https://t.co/Y8jus83wMi Iya berasa kok. Makasih ya. https://t.co/2GtXEEL2QF Ngerasa. Ada. https://t.co/lwfBkBxblv Masih menunggu segmen 4 di SCTV Awards. Kalo liat gue di rumah dadah2 ya.. https://t.co/AYGG02pt8g Sudah di parkiran studio 1 buat SCTV awards, sembari ngapalin skrip. Nanti bakal baca nominasi dan ngobrol2 di red carpet. https://t.co/ONruzXdhn4 RT @adela_n_a: Thank u bang Radit. Menginspirasi 😊\n@radityadika https://t.co/WI6Av8tr58 Dateng meeting kecepetan. Lagi tidur di parkiran (dalem mobil, bukan di lantai). Ada salam dari Kathu nih.. https://t.co/8kbDiVhejZ Selamat pagi. Hmmm.. bacanya apa ya.. https://t.co/494Z1Soku0 Nyobain improvisasi modal jazz di Dm. #jazzguitar https://t.co/oL9dxuAA9T Potret seorang penulis ibu kota sesaat sebelum dia gagal diet. https://t.co/ybvIey8sP7 Potret seorang penulis yang kacamatanya menolak untuk dipakai. https://t.co/vXbvn7HyPr Potret seorang penulis Ibukota yang tengah digentayangi deadline. https://t.co/BVnygB1SYX Ngerasa.. https://t.co/I5vatNue6C 😶😶😶 https://t.co/zGsutwhn0q Hari ini judulnya naik taksi kemana2.. https://t.co/qyB4nvmINC Pagi.. https://t.co/XfaPEP4FuC Slow blues in A. https://t.co/U90Di2zfY0 Udah dong.. https://t.co/QpRBOhHbPG Pantes idung gue gatel.. https://t.co/b0NB5ADGqj Cieeee yg terlalu posesif sampai dianya eneg terus pergi ninggalin. Siapa tuh? Emang paling enak tiap lagi gerah langsung minum Coconut Delight. Kelezatan menyegarkan bisa bikin kalian lupa lg jomblo. #KepoinRasanya https://t.co/v0iPA7Z5Wp Sedang berguru ke Om Tarzan.. https://t.co/SReRz0pDqt Siang.. https://t.co/9N9VZLLSSN Trailer film Hangout tembus 1 juta views. Gila. Sama sekali gak nyangka bakal secepet dan sebanyak ini viewsnya. Makasih semuanya! https://t.co/FMbllMYq4x Ritual sebelum tidur. Overwatch dulu gaes. https://t.co/SGw1OWNLhp Seernya jadi jereng sampai permainan berakhir. https://t.co/2QDxGxhdap Vlog baru! https://t.co/NDrAl8eOAB Spicy salmon hana roll. Mmmmmm... ~ https://t.co/PV9AbPspaH Mari kita coba yang katanya sushi paling enak di Jakarta.. https://t.co/KUcayg4fqo Ciluuuuk.. Ba! Gempi jg nungguin #filmHangout nih kak.. 😍 https://t.co/4SF0wUrDC0 Good morning. Still not delicious body.. Menjelang malam minggu.. 😷😷😷 https://t.co/2WZUfYwdf5 Ngerasa. https://t.co/HIaGIRy0lN Kalo ketemu di jalan dadah2 ya. Siapa tau gue ngerasa.. https://t.co/p0znYxoyue Sangar.. https://t.co/15Js4J6OPN Bengis. https://t.co/gj1EodV4HZ Selamat pagi.. https://t.co/UBYBvNMRWJ Ihiy! https://t.co/46oXSBPSgT Yg mau ngintip denger OST film Hangout nih.. https://t.co/xizbmavb4n Kayaknya dia mabuk deh.. https://t.co/HbK6FHfIvc Trailer film Hangout tembus 900 ribu views dalam seminggu. Mari2 yg belom nonton: https://t.co/KuNhGaZFMK 2NE1. 😭😭😭 Lagi ngerjain project baru di Menteng. Jadi hampir tiap hari pasti sarapan di sini.. https://t.co/TmDDVH3ncO @LunaMaya26 sini kak dikenalin hahaha @PanduWinoto13 bikin konten aja sama gue sini tapi lo ngerap Original soundtrack film Hangout dari band keren KOTAK sudah keluar! Mari yg mau denger: https://t.co/OCXlOdnRVb #OSTHangoutKOTAK Pasti cowok nih kucingnya. https://t.co/zRKcEovtft Selamat pagi, manis. (Buat yg ngerasa) Masih anak2 udah kumisan? https://t.co/rxM4qwKxZ9 Dua kucing bugil sedang berkelahi.. https://t.co/KB4dTfl7fk Malam.. https://t.co/4Ctp1xAzPm Mari makan siang sambil nonton trailer #filmHangout: https://t.co/KuNhGaZFMK Jangan lupa makan siang ya.. https://t.co/TYbRJZznGM Nyaru ya.. https://t.co/7QHLNm3woT Tinggi gaes.. https://t.co/NRwpTJwTZq Lagi nyari orang yg bisa bikin design materi presentasi Power Point yg minimalis dan menarik. Email contohnya ke raditya.dika@gmail.com. Ga ens bads. Terimakasih buat @kotakband_ yg udah mengizinkan temen2 film Hangout mampir ke acara #KotakXAnggun. Konsernya cakep banget! Jadi udah tau belom judul OST film Hangout apa? https://t.co/6ZFCXucUrc Bentar lagi gue nongol bentar di SCTV. Dadah2 ya kalo liat di rumah.. Hangout sama anak2 Hangout. https://t.co/0y27WL1KPT Nemu manusia ini di SCTV. Siapakah dia? https://t.co/rvywM7QNZ8 Mau tau apa yang bikin gue suka banget sama 20MP Softlight Camera #PerfectSelfie #VivoV5 ? Tunggu di vlog gue! https://t.co/De3uMql9cX Hmmmmmmn.. https://t.co/RKiqVEDLwD Waduh gak berani jawab gue. https://t.co/IHuqmn1ezZ Dari tampangnya kayaknya pemabuk ya? https://t.co/VA7Tzu2qgu Kasian.. 😣 https://t.co/BGZuJiTtvj Trailer film Hangout, mari yg belom nonton: https://t.co/KuNhGbhhbk Dijinin ga? https://t.co/fxS1Badmkg Vlogger tuh gini.. https://t.co/edF0KWf9Xl Cieeeee yg abis berantem gara2 \"last seen\" di Watsapp.. Wih.. https://t.co/1BIzuVrLLB Nongkrong malem2. Baju couple. https://t.co/b3Cm1lGAPT #PerfectSelfie tuh apaan sih? Dapet undangan buat event ini nih besok! Tongkrongin  https://t.co/jXBzkWynY9 untuk tau updatenya #VivoV5. https://t.co/eAJqWqpFgv Kok gak meyakinkan? https://t.co/ZutzA7ZkqL Tinggal tambah codet nih. https://t.co/WATaMTSZ4k Bintangnya apa? https://t.co/kZ1vkTMA8P Preman rumah.. https://t.co/TZK8yiqvQz Jam2 bingung mau makan siang apa. Udah hari keempat trailer #filmHangout masih trending nomer 1 di Youtube. Pada nonton trailernya ya: https://t.co/KuNhGaZFMK https://t.co/1XoQsr0xFX Selamat pagi.. https://t.co/XWZtPLGnT6 Nginep sebulan dong.. https://t.co/kuCQExNd0P Trailer #filmHangout tembus 600 ribu views dalam 3 hari. Mari yg belom nonton: https://t.co/KuNhGaZFMK Band favorit gue nih, punyanya kak @hifdzikhoir.. https://t.co/E3cs9pns1m Makanya, Mon, pas masih hidup sering2 pake pelembab biar kulitmu gak kusam dan kasar begini.. https://t.co/qN19kXoXji C14nk. Werewolf dulu yuk.. https://t.co/kGxqLNPu1u Kayaknya sekarat ya.. https://t.co/DTAQUR8C5a Wadaw.. https://t.co/FFgZXzhYZG Pedih.. https://t.co/a9VSOMsEcX Trailer film Hangout jadi video paling populer di Indonesia. Trending no 1 di Youtube. Makasih semuanya! Senang sekali! :3 https://t.co/Rv3xfR7GeK Trailer film Hangout tembus 400 rb views dalam 2 hari. Mari yg belum nonton: https://t.co/KuNhGaZFMK Kucing2 dari rumah Nyokap lagi pada nginep di sini.. https://t.co/lI2U362wsT RT @fenypratiwi29: Potret seekor kucing pura* mati saat ketemu mantan😆@radityadika https://t.co/d2yiFkCDjG RT @sintaramus: Potret seekor kucing yg digangguin pas tidur siang 😛 @radityadika https://t.co/5vkVxyOx74 RT @hnfbieber_: @radityadika potret seekor kucing yg baru diputusin sama kucing tetangga sebelah https://t.co/AfSBYHwFbY RT @ghifarifrommars: @radityadika potret seekor kucing yang melihat gebetannya jalan dengan orang lain https://t.co/EKbgoBdlgg"}