{"tweets": "@JakePlunkett Let’s go grab a coupla cooly pops and find out. @JakePlunkett How do you feel about “Cooly Pop?” Oh, Samson... https://t.co/mKDSlbsPq2 Thank you https://t.co/HJ1HaCSIz6 Sorry to this man. https://t.co/LNVtbW93GH RT @meganamram: trumps going to promise to build a wall in every state and then only do a couple just like sufjan stevens When your country club holds an emergency meeting after someone overhears one of the caddies singing a rap song. https://t.co/GcRo5kzrBs @kibblesmith Be right over. D&amp;D? I’ve got the polyhedral dice. https://t.co/bO7JGweSCD Rudy Giuliani: I am Trump's biggest liability.\n\nMick Mulvaney: Hold my press conference. @TheDancingSlug @pattonoswalt Who do you take me for? Indis, second wife of Finwe? @malexnatt @pattonoswalt Oh! Damn! (Evaporates in silver mist) @pattonoswalt More like Thomas Covenant, Ur Lord, Unbeliever, White Gold Wielder, journeying from Kevin’s Peak to Revelstone to deliver the message of Lord Foul the Despiser. (wakes up, again a leper) As an improviser, I have to admire Trump's ability to keep heightening. Nancy Pelosi told Trump, “All roads lead to Putin.” So, there’s an infrastructure plan after all. As much as I love New Zealand, I can't wait to get back to America. Also, for America to get back to America. I'm in New Zealand, so I won’t be covering tonight’s debate, but I'm excited to find out which eleven candidates break away from the pack! I'm in New Zealand, so I won't be covering tonight's debate. But I AM excited to watch the sparks fly between Baa-mala Harris and Wool-ián Castro! https://t.co/tchiP76Co6 Laketown Spy Returns! #LSSCinNZ https://t.co/MZZgfQThHN Just hanging out in Auckland with the PM.  She appointed me President of New Zealand!...I think. I’m pretty jet-lagged. #LSSCinNZ #nosnakes https://t.co/BQNFwbszpN Pretty upsetting 8-page message from the White House. But on the bright side, it's nice seeing people writing letters again! Trump said he's 'obliterated' Turkey before, and I believe him. He's a dangerous man at a Thanksgiving buffet. Despite everything going on, I still say the biggest scandal is that #NationalTacoDay doesn’t fall on a Tuesday. @ChrisEvans I know whatcha mean... https://t.co/n6NT98pyl5 @ArielDumas Yes “ASK THE PRESIDENT OF FINLAND A QUESTION!” https://t.co/4bJEEdFp9K Happy birthday, Jimmy Carter! If you ever feel like trying that second term, there might be an opening soon. #WeCameFirst by @JenAshleyWright drops today! A Good Book full of Bad Advice from Great Women, written by a Delightful Person https://t.co/sMWB6JwPjL G’morning... https://t.co/6ZKZ3otHg9 Hi. I’m new here. https://t.co/1ZcpBqGCC0 What a foreign leader's phone says when Trump calls: https://t.co/4hd9n6oeSI Of course, in Australia, Trump goes down the drain in the other direction. ⁦@paulkrugman⁩ on the show tonight with Bootsie! Talking China Tariffs! Woo! https://t.co/vAdNPNguq8 Can't believe Trump finally did something bad. Don Jr.                         WH\ntweets                      releases\nemails                     call notes\n                 🤝\n           Not helping. Want to join @OfficialJLD and me onstage on December 7th? Bid now and support @MontclairFilm’s year-round film &amp; education programs.\nhttps://t.co/Ra2Y09DUOt Let today be a lesson, kids: Crime doesn't pay after the first two and a half years of doing nonstop crime. Can't believe they made a Sexy Mr. Rogers costume when Mr. McFeely was RIGHT. THERE. @ewarren Me too @ewarren ! Tired: Joe Biden's face-off with Corn Pop.\nWired: George Washington's naval battle with Cap'n Crunch. @JakePlunkett You never saw my ‘77 powder blue Pinto. Too late now. One day in Chicago there was more than 2” of snow, it was towed off Addison. I removed the shifter knob, my dry cleaning and abandoned it at the impound on Lower Wacker Drive. Sweet ride. Bought it from my brother Bill for $1. @BrianStack153 I’m right with you, Brian. Long past time for the ReSegerance! I win because I get to work with these talented folks! https://t.co/L9tYiyiwLl Looks like a winner to me! https://t.co/MFjz0GDj5A Kinda spooky that Halloween has NEVER fallen on Friday the 13th. Starting a twitter feud with @chrissyteigen is like trying to fight a hurricane with a sharpie. My favorite thing about fall in New York is seeing a rat wear another rat as a chunky scarf. RT @colbertlateshow: TONIGHT: Democratic presidential candidate and Afghan war veteran @PeteButtigieg shares his thoughts on the right way… RT @colbertlateshow: Visit our website to find out how to help with hurricane relief efforts in the Bahamas and elsewhere, including via th… @JakePlunkett Here ya go... https://t.co/NignWAjd98 @AVEE_1023 You do look good, Stacey Live footage of Theresa May watching Boris Johnson trying to Brexit: https://t.co/UXsrXzkXFY Welcome back to school, kids! I hope you all study hard, make new friends, discover the solution to climate change, and have fun! Don't cry because it's over, smile because you just remembered your name is Hickenlooper. RT @AHWAmySedaris: For your consideration: Season 2 of the Emmy-nominated #AtHomeWithAmySedaris is unlocked for a limited time On Demand an… So long as we're accepting updates to the Statue of Liberty poem, I have one:\n\nGive me your tired, your poor.\n\nAnd in exchange, we will give you Ken Cuccinelli BREAKING: Fish tube just qualified for the September debates. I can’t believe there was a bat on a Spirit Airlines flight. I’ve only ever seen raccoons. New York State just decriminalized marijuana. The law takes effect in 30 days, so if you just took a hit, don’t exhale till Labor Day. @JonBatiste https://t.co/d6bfkwgugP RT @colbertlateshow: TONIGHT: @StephenAtHome recaps Mueller's six hours of congressional testimony! #LSSC https://t.co/DnHtILzyWF When RBG confirms she's \"very much alive.\" https://t.co/NVb28krI1Y Holding the #MuellerTestimony on #NationalTequilaDay does not feel like a coincidence. Tonight! https://t.co/RfUyUyls0L Boris Johnson is all about fiscal responsibility. Step one: everyone in Britain has to cut their own hair. https://t.co/gWjPVc8K2S 9/11 First Responders Bill passes the senate 97-2! A long overdue honoring of our debt to them. Here’s a nice photo of McConnell walking in to vote, taken by the great Bill Clark: https://t.co/w9mI6dIDL2 I get Natalie Portman as Thor, but I'm confused about how Tom Hanks as Mr. Rogers fits into the MCU. A Tom Collins for Mike Collins https://t.co/ufVkVi5pxD You can now buy Trump 2020-branded straws for $15 a pack, which is a great way to let people know you suck. https://t.co/s1J20c4Oqe People have paid more attention to \"Cats\" in the last 24 hours than cats have paid attention to people in history. @neiltyson Bring. It. One more failed audition, I guess. https://t.co/mPzt7Vwi7g GOP Rep. Mike Kelly claims he's a “person of color.” He also claims water is a \"liquid of flavor.\" https://t.co/zV15i7fwx5 When you're not feelin' the Bern, but the Bern is trying to feel you: https://t.co/W8gecwLmnN Still can’t believe Will Ferrell took his “John Delaney” character all the way to the debate last night! https://t.co/Sb3vhzT0bY Today Mike Pence launched the “Latinos for Trump” campaign. I like the optimism of using the plural there. My phone was on the fritz last night, so if any teams tried to pick me for the #NBADraft, please call back! Farewell, Acting SecDef Patrick Shanahan. We hardly knew ye... because ye never went through a confirmation process. HBO leaves another coffee cup in plain view. Are they even trying anymore? https://t.co/W2CeuY6uMg His finest hour!\nLeaked: Cartoon Don Jr. Senate Testimony | Our Cartoon President | Season 2 https://t.co/w9yHwzNsm2 via @YouTube @tmgbot @kibblesmith Yeah-ah-ah Sarah Huckabee Sanders is leaving, or as Sarah Huckabee Sanders would say, \"Sarah Huckabee Sanders is not leaving.\" I can’t believe Disney didn’t call it “2 Frozen 2 Flurrious.” Hey, @justinbieber and @TomCruise, if you guys fight, can I hold your coats?  And then keep your coats?  I bet you have really nice coats. We’ve got Game 4 of the NBA Finals AND the Tony Awards this weekend! My prediction? @BryanCranston beats the @warriors in OT. It’s a vibe! https://t.co/0KbKewvXWZ When you get lost on your way to the Guys and Dolls audition. https://t.co/vq63DOPIpY Microsoft is releasing an Xbox shower gel, which is good because I’ve NEVER washed my Xbox. It's going to take him forever to hug that. https://t.co/VgPcUtQKrY You nailed it! What an honor. #schoolbands https://t.co/CfB7GsyGOo They rebooted The Parent Trap! https://t.co/hHsOlFCntx BREAKING! 'Cartoon Robert Mueller Finally Breaks His Silence' Our Cartoon President - Sunday 8/7c https://t.co/QhdeOQFDyZ via @YouTube RT @emmafreud: Richard Curtis, founder of @RedNoseDayUSA, explaining to @jimmyfallon what happens when you spend $2 on a red nose at @Walgr… RT @colbertlateshow: Tonight the King of all Media is here! Catch @HowardStern on the Late Show! #HowardSternComesAgain #LSSC https://t.co/… Happy #WorldBeeDay! https://t.co/r5tEzHGFY7 Hey, Jack In The Box, I just want to say I know you’re trying your best and I hope you’re having a great day. TONIGHT! 'The Democrats Freak Out Over Cartoon Joe Biden’s Lead' Ep. 2 Cold Open ... https://t.co/nrVdQmohxz via @YouTube Ready for the series finale but missed the first 7 seasons? Let Jon Batiste catch you up with 'The Game Of Thrones' Song https://t.co/QNEB8uvu8H via @YouTube BTS is on my show tonight. I hope they don't mind all the screaming teenage girls out front who apparently can't wait for my monologue! Whether you’re #TeamTati or #TeamJamesCharles, I hope we can all agree that I have no idea what any of this means. Anyone shocked by last night’s “Game of Thrones” didn’t see how ruthless Daenerys can be around innocent creatures. #MotherOfCuddles https://t.co/DtQ21nyhpB TONIGHT! 8pm! SHOWTIME!    “Our Cartoon President” returns! Does this look like I’m shouting?!Because I am! https://t.co/gLqlOVit29 via @YouTube Don't worry, this trade war with China will only affect you if you frequently buy... (checks list) products. RT @colbertlateshow: On #LSSC tonight: @StephenAtHome has a warning for @VeepHBO. https://t.co/lJhGoWf9MF Tonight! VEEP cast's last TV interview before the finale on Sunday! We laughed, we cried, if by \"we\" you mean \"me.\" https://t.co/bH4AyS3fyw That Starbucks cup in Game of Thrones really broke the reality of a dragon-riding lady in love with a guy who came back from the dead. One was a disgraced Senate candidate. The other was a failed Federal Reserve nominee. This Summer they're hitting the road to see if the golden years have... Moore to Offer! https://t.co/67ag95mlV1 See you there! #TolkienMovie https://t.co/BtDAymWDPo It was a peak moment for me. (I repeatedly mispronounce “Tolkien”) The movie is beautiful. https://t.co/Q7gBRw8iCE If you're not going to vaccinate against the measles, why stop there, you coward? Quit your job as a gandy dancer and go fight the Kaiser! RT @BeschlossDC: New York Times, 45 years ago this month: https://t.co/2RmrlJ3uFc I never thought the words \"barr\" and \"grill\" could be so unsatisfying. When your Dad doesn’t come to your school play but Mom’s new boyfriend shows up for some reason. https://t.co/SnxgCjhuMR It’s true! Tonight! https://t.co/Qpdkp1SraC Tonight! William Barr is the attorney general Trump always dreamed of.  He’s got the loyalty of Rudy Giuliani, and the nothing else of Rudy Giuliani. #LSSC Regardless of what Barr says, it seems like President Trump is completely Page 290'd. https://t.co/BEnXfNOQwx I don’t know what’s going on with Julian Assange, but I am RIVETED by the trial of “Recently Divorced Dumbledore.” https://t.co/h5jMZwUUdY Really looking forward to seeing the redacted Mueller report on Thursday! It's gonna be ▇▇▇▇▇! Today I trended just below feelings, but HIGHER than melted cheese. Take THAT, dairy! https://t.co/3FgF1WI6T9 I saw LIFE SUCKS. A play by my old friend #AaronPosner. Irreverent, smart… and hopeful. Definitely doesn't suck. NYTimes agrees w/ me! Tix: https://t.co/cZUMrBSlJa The Prophecy was true! Our Cartoon President RETURNS! Season TWO! May 12! BIDEN! BETO! BUTTIGIEG! https://t.co/uPweQ7jNB0 via @YouTube It's unfair to expect Trump to show us the Mueller Report before he's had a chance to get spanked with it. Republicans in the Senate were furious about Trump's purge of Homeland Security...when I started writing this tweet. By now, they’re all on board. Trump’s blaming Obama for family separations...and, what the heck, for cheating on Melania! Wahooooooooowaaaaaa! https://t.co/IUMOgv98u6 Go Hoos! Wahoowa! https://t.co/FFNR7Z83S2 We were so happy to be so stupid with each other. And so tired. Hi Amy! Hi Paul! https://t.co/ec5Oq6DsSh Paul Ryan says AOC didn’t listen to his career advice. I know how he feels. LeBron James won’t take notes from me. A Joker with no Batman in sight is actually a pretty good metaphor for 2019. @neiltyson Pithy sermon, Father Tyson. Trump is so scared of the Mueller report being made public, you’d think it was his tax return. Very excited to announce that I’ll be talking with @MichelleObama during her #IAmBecoming tour stops in London (4/14) and Nashville, Tennessee (5/12)! What should I ask her? WHAT SHOULD I WEAR?! https://t.co/orMQJt4Ime The Three Idiots™️ Ride Again! Stephen Has A Story: Walking In On Amy &amp; Paul https://t.co/ILe0rZufcK via @YouTube RT @blythelikehappy: wait what do people who DIDN’T used to live in Chicago even like TALK about all day RT @colbertlateshow: On #LSSC tonight: 😢 https://t.co/bUgqtnruJM Turns out the real collusion was all the friends we made along the way. Happy Tolkien Day! Don't forget to hug your friend and THROW HIM INTO THE CRACKS OF DOOM! Devin Nunes doesn’t like the things said by @DevinNunesMom and @DevinCow, but maybe he'll enjoy @DevinNunesSkin. Trump seems really nervous about the Mueller report, but he might just be anxious that he'll have to read something. If Twitter is trying to censor conservative voices, it is doing a very bad job. Spike Jonze directed this amazing performance of 'Woman' by Karen O. &amp; Danger Mouse https://t.co/fMPD9uSelB via @YouTube (look for my cameo) My heart breaks for all those at the Al Noor and Linwood Mosques and for the great people of New Zealand.  It is the most beautiful country I have ever seen, and Kiwis are the kindest people I have ever met. Mr. President, you misspelled “Beto.” https://t.co/jx9GoUFlTI A new book saying that Trump wanted to fire Ivanka from her White House job leaves out some important details. Like: what is Ivanka’s White House job? @ArielDumas Did you have that little mic on your cheek? Woo! I’ll be listening! https://t.co/WpyZiW7ETh Happy 30th anniversary to the Internet! I got you all my personal data. I wonder which college basketball team will get to watch Trump eat 300 room temperature cheeseburgers. I set my clock forward for Daylight Savings Time and my Doomsday Clock forward for everything else. Biden is named after what he's doing with his time. I get to work with all these people! #InternationalWomansDay https://t.co/iPEI5tVe1G RT @colbertlateshow: Senator @CoryBooker stops by #LSSC tomorrow night, but we've got an early look at his reaction to the #Manafort senten… If Fox News doesn't host any Democratic debates, how will their viewers know which Democrat they want to vote for? RT @nilslofgren: This is my upcoming tour schedule. Full band. See you up the road. https://t.co/BSgfreVTQo This Coachella lineup sucks. https://t.co/KFYY95uPjU A giant tortoise thought to be extinct for a century just reappeared in the Galapagos Islands. You know what that means: Shhheeee’s Running!!!!! #FernandinaGiantTortoise2020 #slowbutsteady @TheKateMulgrew Yes! (But I’m really a Mrs. Colombo fan!) Still no word on how much of the Mueller report will be released to the public, so Robert, if you see this, just give us a 👍 or 🛏💦📹? It’s true https://t.co/RNCTFT16M4 \"Not me. Us.\" is still better than Bernie's original 2020 campaign slogan, \"Don't vote…For someone else!\" Boy, this was fun...\nAmy Sedaris And Stephen Were Young And Broke https://t.co/9cqrqIa0p5 via @YouTube The 3rd Annual @Montclairfilm Party with @losersloungenyc is on for March 2nd! \nI’ll be singing, along with @patrickwilson73, @warrenzanes and many more.\nIf you’re lucky, I’ll make this face again! #PoorMansBryanFerry \nTix: https://t.co/5Oqb9ZRKdB https://t.co/2Ho0G4Kre5 RIP Ken Nordine #WordJazz https://t.co/pdgxamxLvx I'll give you this, Amazon: Telling people you're going to Queens and then bailing is one thing New Yorkers can relate to. Just watched the Frozen 2 trailer, and I am SHOOK! https://t.co/QP2rMDERsn Things Howard Schultz doesn't see:\n1. Color\n2. The writing on the wall It will be worth it! @Marcuskingband https://t.co/0gwe4D4Tc4 Trump installed a $50,000 golf simulator in the White House. Sorry Mar-a-Lago, but you should've known the president would cheat on you too. It's the biggest public display of original Tolkien material for several generations! Get a sneak peak inside \"Tolkien: Maker of Middle-earth\" on 2/12 @MorganLibrary @JRRTolkien https://t.co/mtWruI2OCf RT @colbertlateshow: TONIGHT: Trump heads to the border! #LSSC https://t.co/Eakbc0pfiq .@ConanOBrien and I discussed magical thinking, comedy, and melted cheese on the latest episode of “Conan O’Brien Needs A Friend.” Listen?! https://t.co/Q2ImKXsI2C https://t.co/r4tJpppCfB The sequel to \"The Post\" is going to be NC-17. Thank you #TheLEGOMovie2 for making me look AWESOME. #AwesomeWeek https://t.co/IwOVkJrpxv @McJesse 11hrs 17mins off, Jesse. The old man's still an artist with a Thompson. RIP Albert Finney https://t.co/F83GUJVq9k Tonight! @prattprattpratt #tbt https://t.co/VzQVTGcCGm Amazon Suggestion for David Pecker: \nBecause you considered \"Blackmailing the Richest Man Who Ever Lived,\" we recommend you \"Get an Orange Jumpsuit.\" Caroline Lazar sure can cook! https://t.co/lUIOHrJAys I loved watching the #SOTU tonight. It was my favorite episode of \"Russian Doll.\" When it comes to the State of the Union, just like Prom, there’s an official theme. https://t.co/TCcIuBDhsc They’ve got the pee pee tape! https://t.co/q7jcMqsg9Q Tonight’s Fun-Size Jokelettes- Colbert Mini-Monologue: Trump's Incoherent NYT Interview https://t.co/QbNofP7rt4 via @YouTube Just One Question For The Super Bowl Players https://t.co/YQ2zrqXF17 via @YouTube The nation is gripped with cold right now but despite that do you know who’s all hot and bothered? https://t.co/B0yR1qqyfg The Most Emotionally Manipulative Super Bowl Ad Ever https://t.co/hH7fRmDjkl via @YouTube My reaction when I heard I could tell Herman Cain jokes again: https://t.co/Ma8mLTpk82 @scardinoandsons You’re anxious because you don’t want to go to your best friend’s Super Bowl party, but it would hurt her feelings if you don’t. I’ve said it many times: if you don’t bundle up in Chicago... https://t.co/OLyuOnH4gf Who hasn't been in a Starbucks bathroom and thought, \"the guy in charge of this should be in charge of everything.\" Trump: the Negotiator-in-Chief. https://t.co/O2XfNzFcIP Thanks to Trump, now we have to Make America Again. RT @colbertlateshow: On #LSSC tonight: President Trump has joined the great @BenFolds in a very exclusive club. https://t.co/vUFukaVXm0 RT @iamcardib: 😂😂😂🤷🏽‍♀️🤷🏽‍♀️🤷🏽‍♀️🤷🏽‍♀️why not ...I get straight to the point .Government shutdown over 🎉🎉🎉🎉 https://t.co/HwcNU5LEqy Punxsutawney President saw Nancy Pelosi’s shadow, so we get three more weeks of government! An hopeful message from @chefjoseandres - If you would like to support @WCKitchen , there is still time to buy your mug: https://t.co/Rc254uaptF https://t.co/CsDUh4qv6K Trump was too scared to give Pelosi a nickname, and then she cancelled his SOTU address. Congratulations to Neuterin’ Nancy! Nobody knows if we are going to have a State of the Union address. https://t.co/r8ABh5zo2o This is hopeful: @HurdOnTheHill and @RepJoeKennedy Thanks for the example. You too @chefjoseandres ! Help them by getting your Shutdown mug at https://t.co/CfxyQjnGlQ https://t.co/eUmej5VJbb I am starting a petition for the Democrats to let @iamcardib give the rebuttal to the SOTU. Sign it by retweeting this! Looks like we might be inching closer to a compromise. https://t.co/ORqq89PgkF Speaking of things that make you scream at your TV: Donald Trump. https://t.co/U45bOBXeIY Support federal workers with this stylish mug benefiting @chefjoseandres Penn Ave kitchen! It's a statement piece. That statement: “I believe America should maybe have a government?” https://t.co/TgSykWHOsV https://t.co/Naelx8r0BO I already solved the Baby Hitler Problem 3  years ago! https://t.co/Q6a4oUZbIv They’re flying off the shelves! 100% of our profits go to @chefjoseandres Penn Ave kitchen for furloughed federal workers! Plus they hold liquid! https://t.co/Rc254uaptF The government shutdown is starting to get ugly, and it was never a beauty queen. https://t.co/8s0am4H51p RT @colbertlateshow: Get you a Shutdown Mug! 100% of the Late Show’s profits go to @WCKitchen to help @chefjoseandres and his team feed fed… Florida is legalizing medical marijuana. Finally, the people of Florida can loosen up! I’ve run out of shutdown jokes. We may have to dip into the national reserve at this point. https://t.co/RAP2FUIXlK True, Gary. True https://t.co/Yg4AgQzxW0 I wrote Trump's State of the Union speech for him. https://t.co/iVA4FbJY3P Last night: Gillibrand. Tonight: Gyllenhaal. I’m on a Gilly-roll.\n#LSSC The shutdown has been hard on government employees, particularly the president. https://t.co/Rc367S8Wz1 If our government is \"shut down,\" then how come the president's mic is still on? Theresa May should’ve campaigned more in Wisconsin. Hey did you see the big story about Trump being an agent of the Russian government? https://t.co/WO7xmgr9Zf Nice mix, Senator! https://t.co/Chikvcf7Tf This shutdown is starting to feel like Trump Marie Kondo-ed the Federal Government. RT @colbertlateshow: On #LSSC tonight: We found Mitch McConnell! https://t.co/0FnniaugPU What everyone wants to know is: will the President declare a national emergency to build his wall? https://t.co/S3CXaJtncm A new study finds that people over 65 share the most fake news. Or as people over 65 put it, “People under 65 share the most fake news.” RT @colbertlateshow: On #LSSC tonight: @KamalaHarris MIGHT have a huge announcement to make! https://t.co/2M3qQTKRcv The government shutdown has now officially lasted longer than my New Years resolution. https://t.co/Sfj8zTSjxR #WednesdayWisdom Stop looking for wisdom on this website where people get death threats for liking the wrong Riverdale characters. The Art of the Deal:\n1. Offer candy\n2. Bye bye This was Trump’s first address from the Oval Office. That feels... weird. https://t.co/s8b0H5hwau Schumer: \"Hey Nancy, I got us six flags for our speech!\"\nPelosi: “Great! And how many podiums?\"\nSchumer: \"…\" https://t.co/GMCT8ojqrh Chuck &amp; Nancy: “We need to make sure we’re not the faces of this shutdown. I know! Let’s get our faces on TV talking about the shutdown!\" I'm confident that Trump changed a lot of minds tonight. Sorry, I meant channels. I’m digging Chuck and Nancy’s vibe tonight. https://t.co/PjUmAGWYY9 That reboot of Abbott &amp; Costello Vs. the Mummy left a lot to be desired. After a 17-day shutdown, I am reopening The Late Show! https://t.co/7yxYPrFZR5 My network will be carrying Trump’s Wall speech live. So at 9pm Tuesday, tune into CBS to See B.S. RT @emmyblotnick: My album recording is in 2 weeks @UnionHallNY! with special guests @GaryGulman &amp; @mattkoff! Tickets available for 7:30pm… Why is anyone surprised that Trump's willing to shut down our government when it's clearly not the one he works for? If Mattis decides to run for president, he's already got a campaign slogan AND a campaign beverage! https://t.co/Vmvsfm3OW2 Kinda scary when everyone says, \"There goes the last voice of reason...'Mad Dog'.\" This one-of-a-kind holiday garment can now be yours, because we're auctioning it off charity! All proceeds go to @GoodCallNYC. Head to https://t.co/9VsAYwnalf now to bid. Finally, you can wear something celebrities have touched, without being creepy! https://t.co/1x6E2SAZnA The Trump Foundation is no more. And they were SO close to finding somebody to be charitable to! I’m beginning to think Donald Trump destroys everyone he touches. He is like the King Midas of crap. https://t.co/9wkjmiOrrx First romaine lettuce is recalled, now cauliflower! What's next? A food I eat?! Chris Farley and I started at Second City on the same day. You knew the minute you saw him on stage he was great. He was sweet and smart and funny. When I heard he had died, 21 years ago today, I fell to the ground. Rest In Peace. The walls are clearly closing in on Trump. https://t.co/hEs981EdbS If New York legalizes recreational marijuana, the Big Apple is gonna get hollowed out and turned in to a bong. RT @colbertlateshow: Stephen Miller and his spray-on hair drop by the Ed Sullivan Theater tonight! #LSSC https://t.co/7LgvQYToMn RT @colbertlateshow: Think our host enjoys his job?? 🤣🤣 @stephenathome https://t.co/0Y2WZdu7rS It really feels like we’re at a turning point in the Trump presidency. https://t.co/AmRUJLHYjv @ArielDumas @AndyRichter “Now Now Now Now/ Now Now Now Now/ Now Now Now Now Now Now Now Christmas Now” RT @JakePlunkett: Tomorrow - these creative geniuses return https://t.co/xPvvZYDchb @ArielDumas @AndyRichter https://t.co/QNZKfAMeHt Another decision in the landmark case of “Donald Trump v. Getting Caught” https://t.co/pKZ7Zu7iie Advice for Michael Cohen: On first day of prison, go up to the biggest guy in the yard and offer to pay him $130,000 Since Donald Trump was elected President I have tried to remind myself to never stop being shocked. https://t.co/d3dRZYoMPl Weird time to introduce the new Pence statue to the White House. https://t.co/eXyasvgJEY Nobody seems to want this job. https://t.co/SJbvRfMKNt Wanna feel old? \"Smocking gun\" was TODAY RT @BarackObama: No jump shots. No ferns. No memes. Not this time. I’m going to give it to you straight: If you need health insurance for 2… @ArielDumas @baddestmamajama We have a winner. Thanks to everyone who played! John Kelly is going to be a great host of the Oscars! Yeah! Grammy Nomination for Jon Batiste!\n\nBEST AMERICAN ROOTS PERFORMANCE:\n“Saint James Infirmary Blues,” Jon Batiste\n\nDEEP! @ChrisGethard “Lose Well” is now 807! Dare we dream of...723? https://t.co/XOJuQC3nNN Wait a second, did Trump only go to the funeral to look for an Attorney General? https://t.co/Jx6dMF6SgF It was a quiet day in America. https://t.co/HTfPOEyQ90 Tonight! \nI can't take the suspense of all the redacted memos. Come on Mueller! Can’t we at least buy a vowel?\n#LSSC Here’s the thing: it might have been Trump’s fault. https://t.co/Ftl1bTdqzS https://t.co/L03r7FxFrS Have they asked Michael Avenatti? https://t.co/3LWskPLray @MJMcKean @BrianStack153 @pattonoswalt Obviously Well then, let’s help with that marketing! Retweet this, y’all! https://t.co/s3MBOsgLJM RT @colbertlateshow: TONIGHT: Former First Lady @MichelleObama talks about the importance of moral leadership in the White House. #LSSC htt… 'Very legal and very cool' = 1) How the President talks about his Russian deals, and 2) How Juul markets their vapes. Robert Mueller is getting closer and closer to his prey. It's a true game of cat and large, slow-moving man. https://t.co/tRJvnlsZxV Not sure about Paul Ryan’s official portrait. https://t.co/zMkq6qBfop It's wonderful to be back! https://t.co/DVbzYGIK4M Margaret Atwood is writing a sequel to The Handmaid's Tale, and  Donald Trump is almost finished with the prequel. \"Is Big Cow Big?\" The answer may surprise moo. Tidings of great joy! The world's first store where u can buy real gifts for refugees &amp; displaced people: @helprefugees CHOOSE LOVE store opens 11/28 in NY- 456 W Broadway &amp; online at https://t.co/VZ8hVwx3nt #CHOOSELOVE &amp; join me in buying gifts for people that really need them. RT @Ajaffz: “I’ve watched Barefoot Contessa for 15 years and am convinced that Ina Garten is better than me in every way.” My first for @Th… The holidays are coming up and it's a time when I have trouble with impulse control. Because if you put gravy on it, I don't care what goes in my mouth. https://t.co/zd49PmZe5M Acosta won, but I'm worried for the WH press corps. They replaced the microphone with a conch. Being President has really worn Trump down. Remember Inauguration Day when he was so lighthearted and filled with joy? https://t.co/ByDmbanI0f Ok, but I bet Melania is too chicken to fire her husband. You know who's not enjoying last week's election? The guy who lost. https://t.co/fRNlKNpbPb Once again, Trump wants to fire somebody. But in a refreshing change of pace, it's not Donald. https://t.co/8zN9iEdT6H Last night we had to cut a bit for time. Here’s the full remembrance of Stan Lee. https://t.co/VjvjTrD2mK At a time like this it's hard to know the right thing to say. But for the wrong thing to say, let's check the President's Twitter feed. https://t.co/iD24hgNgrU I think it's time Florida gave up on Representative Democracy and transitioned to a Geriatric Disnocracy.                                     #LSSC Tonight! RT @colbertlateshow: Tonight: Senator Gillibrand believes the path to basic gun reform is getting money out of politics. #LSSC https://t.co… Fighting Tucker Carlson’s ideas is an American right. Targeting his home and terrorizing his family is an act of monstrous cowardice. Obviously don’t do this, but also, take no pleasure in it happening. Feeding monsters just makes more monsters. Want tickets to my show and to help Veterans at the same time? Bid on @ebay! Proceeds support @HomesForOurTrps &amp; their mission of adapting homes for wounded Veterans. https://t.co/3jphsQgOhB Trump has made no secret of his feelings about Sessions. https://t.co/fNfPblsq7v It worries me that we live in a reality where I just said, “We're gonna miss Jeff Sessions.\" Jeff Sessions is resigning to spend more time with his family separation policies. Justice is blind, but even she saw this one coming. In line? Please stay in line.\nLeft ‘cause the line was too long? Please go back.  See you tonight! #TacoTuesday (if votes are tacos) While you’re waiting in line, you can exercise your right to order \"Whose Boat is This Boat?\" ALL our proceeds go to hurricane relief! Plus! Tweet us a pic with #WhoseBook, like this gem from the audiobook recording session! https://t.co/heZXeYWUgL https://t.co/ov59MzCPoU Join me tonight for either a brief, celebratory drink, or one very long sad boof. https://t.co/q24XyFn38B Tonight! Triumph the Insult Comic Dog goes to Texas! And interviews Ted Cruz. So wonderful (for him to poop on!) https://t.co/nuQb9Z7GIZ Want to join Meryl Streep &amp; me on stage while supporting @MontclairFilm’s Education Programs? December 1 @njpac. You! Me! The Greatest Actor of Our Generation! Bidding Ends Soon! https://t.co/4xnDVZSgNo Can’t wait for Tuesday? Watch OUR CARTOON PRESIDENT Tonight! 10:30! It’s mildly stranger than reality! https://t.co/wlJ6ozJGEG 100 yrs ago today, Wilfred Owen died, one week before the Armistice. Here’s one of his poems of the Great War: https://t.co/gtsBSFII9G RT @OfficialJLD: Lookie lookie!! \n#IVoted #BlueWave #MultiplyYourVote https://t.co/6zF8Bb3JhQ Any time Oprah gets political, everyone wants to know one thing: https://t.co/63HxttPXmL Leading up to the election, Trump is a little nervous so he's tried everything he can to scare his base into voting for Republicans. https://t.co/KQioUatrM4 Happy Halloween! I’m dressed as the scariest thing I can think of: Low Voter Turnout In New Jersey’s 11th Congressional District. Vooooooote! Sunday! 10:30! Showtime! Our Cartoon President faces the music! And the voters! https://t.co/9gd0yI9C76 Carl Reiner 2020! https://t.co/6IB8EWBWIi If you're born here, you're an American. https://t.co/Oo3o6Sd6cj It has been a rough week on the non-submerged parts of America. https://t.co/lge2nYIG8s I don't know why the president would take time on a National Day of Mourning to retweet something weird like this, but the original clips have always been online. 16 million views. Here they are: https://t.co/8HsMzPlV8l https://t.co/U5kzfaqhOY https://t.co/g1mt2LYpXA Suddenly, my van's mural of me as a guitar shredding barbarian on a mountain of skulls seems a lot more sane. With the Midterms bearing down on us like an angry buffalo, the president had an important message. https://t.co/gvYvm7rz1p Normally I don't even get out of bed for less than a billion dollars. Unless there's pancakes. https://t.co/dBXsZZWnOb Kushner says the White House is still in the ‘fact-finding’ phase on Khashoggi...I assume until they can find someone to destroy all the facts. @thedad “Today’s terrifying look into what might happen tomorrow!” https://t.co/Wghk83kOG8 https://t.co/oI3NmNmq3S On Tuesday our president sat down with the Associated Press, and it started on friendly terms. https://t.co/PZwtN04rwE Trump already scored one victory this week and we've got all the details in this edition of \"Stormy Watch.\" https://t.co/bycOkFLTSp I’m beginning to think that Trump never got around to reading that Be Best pamphlet Melania left on his nightstand. It's great to be back! I've missed all of you, because last week I had to watch the news by myself. https://t.co/A5WcVfWloV I’m going to miss Sears. Especially on those days when you just want to buy a suit, a carpet, an air conditioner, a lawn mower, a foundation garment, an air hockey table and a tractor. A Wisconsin brewery is now making Candy Corn beer. Perfect, if you love the taste of wax but don’t have time to chew! \"I can't wait for my stepsons to murder you.” https://t.co/tQ56Uvw2Ub Julia Louis-Dreyfus has some great ideas to get out the vote on Nov 6th. Check it out and sign up. I did!\nhttps://t.co/wGgJjGMFwt\nhttps://t.co/n3Hz4yGlel\n#multiplyyourvote Pre-orders for “Whose Boat is This Boat” are so strong, it’s flying off the shelves it hasn’t arrived on yet!  All proceeds go to help hurricane victims!\nhttps://t.co/lfWoh9vjUT @ProbablyJamesW Aw hell yeah! RT @colbertlateshow: On #LSSC tonight: Sam Elliott does his best @ladygaga impression. This one is for the #littlemonsters! #AStarIsBorn ht… She’s great! Watch if you like good stuff! https://t.co/2R2Cr5r896 @lovcen1900 No, thank you! The last week has been an emotional rollercoaster. There were lots of twists and turns, and I feel like throwing up. https://t.co/fDsDsewaZf Thank you! For the interview and for your extraordinary performance in “A Star is Born.” A piercing act of beauty. Tonight! #LSSC https://t.co/SzOKSwGcB7 RT @colbertlateshow: Hey @ladygaga, we are officially obsessed with #Shallow from @starisbornmovie! Can't wait to see you tonight at The La… Being President is a hard job. https://t.co/Hh7TjzV5EX If he's so damn smart, why is he so dumb? https://t.co/h1H9OQlDNR RT @colbertlateshow: On #LSSC tonight: Since we now know Brett Kavanaugh got into a fight after a #UB40 concert, the only logical next move… UPDATE:\nNAFTA now USMCA\nZendaya still Meechee Trump's EPA is loosening radiation regulations, so at least maybe we'll get some Mutant Powers out of this administration. Thursday's testimony was dark... https://t.co/o3Jbl9wOqQ Not sure why we’re still trying to reason with the artist who wrote “Can’t Tell Me Nothing.” Jeff Flake says politics have become too partisan. I agree — time to reach across the aisle and have tough conversations like: “Kids in cages: good or bad?” The FBI is investigating Kavanaugh this week, and I'm on the edge of my seat to learn whether he's innocent or super innocent. @Randazzoj Passage to India RT @JakePlunkett: Sinead O’Connor ripped up a photo of the pope and was banned from SNL. \n\nKanye wore the hat of a man who has openly attac… Whose book is the #1 book? The Late Show! “WHOSE BOAT IS THIS BOAT?” is Amazon’s top seller! Get yours to help the folks on the Carolinas recover from Florence. https://t.co/lfWoh9vjUT https://t.co/DTF4yrqDii “WHOSE BOAT IS THIS BOAT?”  is #2 on Amazon! All our proceeds go to help the Good People of the Carolinas recover from Florence. Help them by helping us make #1! https://t.co/D3Ee5Ha4wS @blythelikehappy And with your spirit... Yes yes https://t.co/GcWb1al4Dh Look who’s the #1 Mover &amp; Shaker on Amazon...YOU ARE!...thanks for helping the good folks of the Carolinas recovering from  Florence with “WHOSE BOAT IS THIS BOAT?” https://t.co/Fw7h1taodt All our proceeds go to hurricane Florence relief in the Carolinas. Order “WHOSE BOAT IS THIS BOAT?”today!! https://t.co/FMy93HFMhe Yesterday was the most divisive day in America since Laurel and Yanny. https://t.co/fj1YdOPWXM RT @colbertlateshow: On #LSSC tonight: Brett Kavanaugh screams his testimony at the Senate Judiciary Committee. https://t.co/l55BMt6tkT \"I'M NOT GOING TO CALL IT DUNKIN\" https://t.co/fBUsfBVkbn RT @americamag: While we previously endorsed the nomination of Judge Kavanaugh on the basis of his legal credentials and his reputation as… Man, after today we all need a tall boof of scotch. You guys check out the internet lately? There's a great story out there about a moth drinking a sleeping bird's tears. https://t.co/P9nTQXyCJA Oh right...THAT'S why Trump never has press conferences. RT @michaelpielocik: Serving up sad jokes... in a tiara! https://t.co/rRZc2VezAh Trump was so late for his U.N. speech that Ecuador's president had to take his place. https://t.co/1bdSCiP9cg @Foodudecurdnerd Gothmog (OG) or Ancalagon @JacobOWEvans Oh yes Welcome, Sarah. https://t.co/61udfEdtlx It's National Voter Registration Day! Sign up now with @HeadCountOrg, and win a chance to participate in American democracy! https://t.co/nYmNjTNXAX #TheFutureIsVoting https://t.co/47KfLuwY0O @ithildin_lass @ClasslessCast TB @ThisisAlexei @bencjenkins @LeahJaclyn @thomas_violence Yes Trump's U.N. speech today will be translated into six languages, including English. https://t.co/jbDqWMQPbg !!BREAKING!!: I have no idea what's going on with Rod Rosenstein. Kavanaugh not getting confirmed would be as embarrassing for Trump as everything else should be. \"I ask that she bring those filings forward so that we can learn date, time, and place!\" ...tweets the man too scared to release his tax returns. @UrsOfTheLala @Astrozoan9 Only the Royal House. I think it’s time to replace the GOP elephant with those three monkeys. @michaelpielocik But those aren’t the words to the song!!!!! BE FAIR! @hinadirah You got the Deacon Blues? Yeah! https://t.co/8LxCHO9VIe I’m old enough to remember when it was a big deal to see Batman’s nipples. https://t.co/C3r9AB65wF What’s it called when Roy Moore defends you? Is there an opposite of a character witness? A won'tness? News, I can't leave you alone for five minutes! https://t.co/rpH6V1xE0V RT @colbertlateshow: On #LSSC tonight: We check in with Mario Kart's #Toad, who has just received some awful news. https://t.co/LV2cLOz4uO Many have pointed out a much better ticket- Barbie/Ken 2020: The Pair that Care with Nothing Down There! I don’t ever want to hear about presidential genitals again, which is why I’m giving an early endorsement to Ken Doll 2020. I’m all about the press asking Trump the tough questions, but this was just plain mean! https://t.co/FvAJ4aXUqb @ClasslessCast Off the top of my head, I’m sayin’ Cirdan. An elf with a grey beard? That’s gotta be getting up there. @ChiPartyAunt @WGNMorningNews @wttw @WBBMNewsradio Of course. I wouldn’t want it any other way. And Wild Chicago, I should hope... Ok, I’m in. \n#CPAForMayor https://t.co/dTFZgxUi4V I hope the first scene of Jon Hamm's Batman movie is Batman swooping in to catch this guy. https://t.co/xsK30m4VfM Congratulations to @ConanOBrien on 25 years of hosting late night! I’m not going to attempt a joke, because I will never be as funny as you are. I do admire her clarity. https://t.co/Hdk4FWXMqi President Trump has been hard at work both preparing for the hurricane and bragging about how good he is at hurricanes. https://t.co/KEn8OPdBMZ One Beard to Rule Them All: Alex Trebek, you and me, on my show, trivia face-off. Loser shaves! @Jeopardy #LSSC #Colbeard https://t.co/XiPavGPRIQ Tonight https://t.co/wz9kxzx93Q I heard they're looking for a new Superman. I just want to put it out there that I coincidentally wear glasses and red underwear. The Trump administration diverted $10 million from FEMA to ICE. So if you need hurricane assistance, just go to Mexico, cross the U.S. border, then ICE will provide you transportation and lodging. @ArielDumas That’s in the catechism! RT @colbertlateshow: Still more eloquent than Trump. https://t.co/kWYY7TWjyX Everyone is still trying to identify the anonymous writer of last week's op-ed in the NYT, especially the President. https://t.co/HfaWlUx7g7 RT @colbertlateshow: On #LSSC tonight: @StephenAtHome asks @realBobWoodward \"WHAT MAKES YOU AFRAID\" in terms of things he observed at The W… Congratulations to @LastWeekTonight writers on their Emmy win, and on all their hard work. You are great. John is great. Your show is great. Here’s to you! The NYT Op-Ed legally can only be described with one word https://t.co/N8qG5ek2YX Fans of sleep, invest now because it is a rarer commodity every day. https://t.co/DGf8RcDkxj https://t.co/5aD7F1NKXJ No, just the check please. https://t.co/Px4f3yrvwe https://t.co/XUxL0fRgMd IMPORTANT POLITICAL POLL - see pic below! Wow, this Bob Woodward book is nuts. https://t.co/2wYd9ulpge Last call for Summer https://t.co/0tX6l27V0l The young man with the gas can! Thank you, Louis! https://t.co/Gjc49MVOUk Truthiness- what I believe, is true Trumpiness- what I fear, isn’t 2+2=Fun!\n(Also, 5) @saykaty Hi! RT @colbertlateshow: Set your alarms: @JonBatiste will be live in the studio tomorrow at @CBSThisMorning paying tribute to Aretha Franklin.… For the first time ever, a president has used the power of his office to punish members of the intelligence community who have criticized him. https://t.co/B3McoGFnzB The bombshell everyone is talking about https://t.co/LoxYOcxGgs RT @colbertlateshow: Donald Trump didn’t say John McCain’s name in his speech and Destiny’s Child has a request for the president. #SayMcCa… Now we know for certain why Trump didn't get a dog. https://t.co/B2sDaZIhgH There’s another verse...tonight! https://t.co/JAikvUTkqe Tonight! Alex Jones is starting to make some sense... @CartoonPres 10:30 @Showtime  https://t.co/sAiK021pOK @maitri @geostatue Shelob (and her daughters) The only way Omarosa could have tapes of Trump being a racist is if she somehow records “the news.” That brief moment between basketball and football season when there's no black athletes to be mad at must be very hard for President Trump. Longtime viewers of the Trump administration will remember that Space Force is the president's boldest idea... https://t.co/Wl06d23axe The Trump Presidential Library will consist entirely of tell-all books written by people who worked in the Trump White House. Trump is on vacation but he hasn't forgotten about the Mueller investigation. https://t.co/GwO1HnecUk #Meow #Happy #InternationalCatDay https://t.co/lppMX0Bz1R Gates not only did crimes with Manafort, he did crimes at Manafort and on Manafort. https://t.co/ZX1sQbu19T While he's on vacay Trump's staff have largely given up on futile efforts to supervise him. https://t.co/AjQ0hp9H4X Get that glistening Trump sheen WITHOUT a lifetime of eating bed-burgers! My Trump makeup tutorial is here! #StephenontheFloor #MakeAmericaFaceAgain https://t.co/CnCcU8Xjtg Happy Sunday https://t.co/TyWpah3jDe Gotcha! https://t.co/niQtaZPlwM How about an awesome cage match between the Koch Brothers and Steve Bannon?  They all go into a cage, we lock the cage and...that's it. Stop what you’re doing and watch this. I promise you, it’s worth your time.                        Rudy Giuliani Defends Trump | Our Cartoon President | SHOWTIME https://t.co/FKBgEbhInU via @YouTube I don't know why Donald Trump is surprised. When the cops want to talk to you, it's usually about a crime. https://t.co/BaW1GzpVlB After seeing all of Manafort's expensive jackets, I don’t know if he’s guilty but more importantly, WHERE ARE HIS PANTS?! RT @colbertlateshow: Courtroom sketches from Paul Manafort’s trial come alive in a much guiltier version of a-ha’s ‘Take On Me.’ #LSSC http… Another day, another presidential tweet-nado. https://t.co/IOHshDkxf6 All year long Robert Mueller and his team of legal elves have been busy in their workshop making all the indictments for all the bad little boys and girls. https://t.co/oJ2zLgsAEB @ArielDumas This is great. Then what?! These Rings have a Lord https://t.co/L7izKT1oTM Trump is so prolific, he's the Stephen King of the horror story we live in. https://t.co/sZRt3uHzDB I want to see the Religious Liberty Task Force fight the Space Force. Tonight! At 10:30, Trump And Putin Watch Shark Week  | Our Cartoon President | SHOWTIME https://t.co/M1Q7T1Uh3m via @YouTube The truest thing ever. (My poor friends) https://t.co/4to3EkJg6O Hey! My old friend Paul Mecurio’s got a new show off Broadway! Check it out if you’re Mecurious! https://t.co/gBiE7VPyLk Some people say it's a hoax, but I say Obama was real. https://t.co/uVMsdCQgBP It's odd that Jim Jordan is running for House Speaker, seeing as how he's known for keeping his mouth shut. RT @colbertlateshow: On #LSSC tonight: There’s another Trump-Cohen tape and this one is just as bad. https://t.co/WGmxZEaMah Uh oh, Rudy just noticed the lower-third. https://t.co/wZQM6gsZvC Unlike Donald Trump, I know I'm being recorded. https://t.co/JjOuNu5YjA You're not crazy, no matter what Donald Trump says. https://t.co/vN5mwJDX3v Now, farmers are getting the full Stormy Daniels treatment - Trump screwed them and now he’s paying them off. https://t.co/gmdSmIC0Ah Well, it’s not the Trump tape I was waiting for, but I’ll take it! https://t.co/vZz7OY08aW Cool that Trump got to hang out with his VFW buddies today. They must have been thrilled to hear all his war stories about the line outside Studio 54. TIRED: The emperor has no clothes.\n\nWIRED: The emperor’s daughter had to shut down her clothing line due to poor sales, and she is complicit in the emperor’s racist policies. Trump says Russia is going to attack the midterms to support Democrats. Also the Joker loves Batman, Sauron hates rings, and Hannibal Lecter is trying the vegan thing for a while. There are tapes! https://t.co/0JhNZN3Tbm So, prosecutors have 12 audio recordings from Michael Cohen. Still way fewer porn star payoffs than I thought. Tonight at 10:30 on Showtime! https://t.co/P0bxKAzgUF Having a blast at San Diego #ComicCon! This time I'm a Storm Trooper! If you see me, run up and knock on my head! Donald Trump tomorrow: “I meant to say I WOULDN’T pay a Playboy model to keep quiet about the affair we had while my wife was home with our newborn son.” Not to sound like a conspiracy theorist, but these Michael Cohen tapes coming out during Shark Week can't be a coincidence. “Hi, Welcome to the Donald Trump Presidential Library. Are you all over 18 years old?” RT @rjfried: The Trump-Putin Press Conference from \"Our Cartoon President\" is now live! Tune in Sunday at 10:30PM. #OurCartoonPresident #Sh… It's hard to imagine you could be this shocked every day by the Trump administration. https://t.co/oitHWHaP0F Trump was briefed about Putin’s election meddling two weeks before the election? That’s surprising, because I’m guessing he knew way before that. So, Trump is inviting Putin to the White House in the Fall. Is that the Fall of 2018 or the Fall of Democracy? I can't believe they’re just inviting Putin into the White House. At least the Trojans made the Greeks use a horse. We can expect Putin to be shown the same hospitality in Washington D.C. that Trump was shown when he visited Moscow. So we might want to Scotchguard the Lincoln Bedroom. A lot of people have been upset since Helsinki where Donald Trump did not put America first. https://t.co/vfhhL1xKxB Trump has got the GOP wrapped around his little finger. Which is all of them. It’s a free country.\nAnd apparently Putin took us up on that offer. RT @colbertlateshow: On #LSSC tonight: Schoolhouse Rock! is right on time with this lesson about double negatives. https://t.co/r5oOF9fWJm After his disastrous summit with Putin, it is starting to dawn on some people: Trump may be a bad president. https://t.co/b3LtcjDZym Of course Obama gave a great speech. He’s married to Melania’s speechwriter. What else is Trump going to flip on after his trip? “I said it was a great honor to meet Queen Elizabeth; what I meant to say is she’s a thirsty little diva.” Let's see how people reacted to Trump's performance, because the reviews are in: https://t.co/L4KiR7A27x When your boss needs you to protect one of his Horcruxes https://t.co/9ch3F1SJ41 Вы можете держать его. RT @colbertlateshow: On #LSSC tonight: The Trump/Putin Summit was definitely a theatrical adventure. https://t.co/i8NFwWHkog TRUMP: Putin says he didn’t do it. So I believe the guy.\nALSO TRUMP: We can’t be sure this 8-month-old isn’t a sleeper agent for MS-13. Better make him appear in court alone. We have obtained exclusive footage of the Trump-Putin meeting... https://t.co/X12BfedInH I’ll be watching! https://t.co/D0BN4MeRdw An exclusive sneak peak at the Trump Putin Summit... @CartoonPres https://t.co/5Lz0A3n7Gk IF YOU’RE SACHA BARON COHEN YOU HAVE TO TELL ME! https://t.co/hxLVQAd0On She’s great! https://t.co/AUZOYnEBNQ Yesterday the Capitol dome became the Thunderdome. https://t.co/kvkpVbszLe Is it too late to give Peter Strzok's hearing an Emmy nomination for Best Drama? Congrats to my team at The Late Show for being nominated for 3 Emmys! It’s what we in the biz call “The Full Cookie Monster”:  Nom, nom, nom! RT @CartoonPres: Will #OurCartoonPresident survive the Russia investigation?\n \nNew episodes return to #Showtime this Sunday at 10:30p/9:30c… It's true, we're all controlled by the people who give us our gas. https://t.co/Qa5jn1GL0Y My condolences to @realdonaldtrump for his crushing defeat in the first round of international Simon Says. https://t.co/p2DWfoPv1n RT @robdubbin: COME WORK AT SCRIPTO! We're hiring a Sales Lead based in Los Angeles. Help us bring https://t.co/9Y3vbC7zRy to the world and… I don't know much about Kavanaugh, but I'm skeptical because his name is Brett. https://t.co/ejtd4r5LsN Folks, it's happened: Donald Trump has announced his pick for the Supreme Court. https://t.co/3osHsA6Uu4 A senator once called Brett Kavanaugh “the Forrest Gump of Republican politics.” Which I think makes Merrick Garland “the Cast Away of Democratic politics.” RT @kibblesmith: Donald Trump is bad for comedy. But comedy is a good tool for ENDURING him. https://t.co/PjPV9vkE9c I am teased. https://t.co/QFFoxdxevs Happy to have you tag in! https://t.co/HRCAw8gNUV If you're on a low carb diet you're in luck, because there ain't no way to sugarcoat this. https://t.co/HzijhzFbG5 Well, sure, if you set aside everything he said, it's legal. https://t.co/JLd23FGHrR Donald Trump and David Lynch: A match made in the darkest nether-scape of an abandoned malt shop while a naked woman in a tortoise mask sings “Rock Around The Clock.” But if Harley Davidson goes away, how will retired dentists in my neighborhood wake me up on Saturdays? There are a lot of things I want to call Neil Gorsuch, and none of them are \"Justice.” If it walks like a Muslim ban and quacks like a Muslim ban, then this Supreme Court decision is ducked up. There's still no announcement of what they're going to do to put these stolen kids back together with their parents. https://t.co/plHSiMKRjP Sure, Trump wants to kick people out of America without due process. But look on the bright side: without due process, it's not really America anymore! Harley Davidson is going to move production to Europe to avoid tariffs. Comment dit-on \"midlife crisis?\" Well, at least something good came out of this weekend. I finally figured out my band name: Filthy Canopies RT @colbertlateshow: It's been a sad week for America but we had to ask, \"Is Trump really that bad?\" #LSSC https://t.co/fhkQ15QeX5 RT @colbertlateshow: Brian Kilmeade on Fox News: \"Like it or not, these aren't our kids...it's not like [Trump] is doing this to the people… The story of the week has been Donald Trump's pro-baby-snatching agenda. https://t.co/mRpnoiQk1n Wow, she’s really starting to seem like the kind of person who would marry Donald Trump. https://t.co/LI6ZIjMEaT Here’s an eye full of year! #LateShowFYC https://t.co/GWXAFzJrYp https://t.co/d6rXuYznlp #tbt https://t.co/hpPOz3RkzV Donald Trump has changed his mind and decided to keep families together. https://t.co/kSwJ53S5q4 Trump signed \"something” to “keep families together.” Unfortunately, it wasn't resignation papers. Hey. You know Dino Stamatopoulos? He’s funny. He also has a band called Sorry About Everything. If you want to check it out, I put the link down there. I like “Close Face.” https://t.co/b0rSZzSEI8 Simba: Dad, wake up! Dad!\nCorey Lewandowski: Womp womp When it comes to the news, let's face it: we don't want to face it. https://t.co/kKgIoCUmrB This flag just earned $130,000 https://t.co/BkSeEtNK7b Here's my monologue from Monday's show: https://t.co/dtmPX4pls1 One thing I know for sure: no one on the right side of history has ever had to nitpick what the definition of “cage” is. Paul Manafort has been ordered to jail, or as President Trump put it, “Never met the guy.” https://t.co/JbPVCRuwqO It's time for another installment of our long running segment \"Hillary Clinton: Impeachment Watch\" https://t.co/wnuvlpalbs RT @colbertlateshow: The United States is using cruelty as a deterrent on our southern border. @StephenAtHome has something to say about it… Now Trump must deal with an even greater threat: Robert Mueller. https://t.co/zFIYidH0cP RT @colbertlateshow: TONIGHT! Scaramucci and Avenatti talk Cohen with Stephen. #LSSC https://t.co/JyEP6M5wlq He’s got my vote! https://t.co/e7XENAy4rM Yeah! https://t.co/7i4Wbvsb9p Yesterday we all woke up in a different world. https://t.co/xZqaTgdW6P Some analysts believe Kim Jong Un can actually speak fluent English. Others believe the same thing about Donald Trump. Here's a question I never thought I'd have to ask: does Canada have nukes? Our relations with Canada have not been this bad since they stole the word \"bacon.\" https://t.co/4L28Dlw31o “We will be fine!” says the man who just misspelled “missile” and “stopped.\" https://t.co/GdVOt6qMvd Trump made his first international visit to a hostile foreign power: Canada. https://t.co/FzOOI0LAXf A bunch of racist nerds bullied Star Wars actress Kelly Marie Tran off social media. As Yoda would say, “Wrong with people, what the fuck is?” Donald Trump: When will people start saying, “thank you, Mr. President, for firing James Comey?”\n\nStruggling Bookstores Everywhere: “THANK YOU.” Here's a sentence I don't often say: Donald Trump did something good. https://t.co/7KXD1jtj3g Calling Trump “Commander of Cheese” is the first factually accurate thing Kellyanne Conway's ever said. @kumailn The end of Miller’s Crossing: “Goodbye, Leo.”\nThe “So you’d give the devil the benefit of law?!” scene in “A Man for All Seasons.”\nJerry Lewis boxing himself in “Sailor Beware”\n“Watch Clark” scene from Carpenter’s “The Thing”\nLOTR:FOTR “I know what it is you saw...” Here's my monologue from last night's show! https://t.co/Afs7B3rHhq Now that Miss America has ditched the swimsuits, I think it’s time the Pulitzer Prize dropped their wet t-shirt contest. Yes it is. https://t.co/NUF3g5LDZj Caught this unruly mob in my garden #quickbeforetheyfade https://t.co/uYgFcXnZuT We're back! https://t.co/zT1NcO9hjR Reese Witherspoon has announced they're making \"Legally Blonde 3.\" Please make it be about Elle Woods joining Mueller's team. Fine, Donald Trump gets to pardon himself, but only if he can spell \"Special Counsel\" on the first try. Sunday Cobbler, anyone? https://t.co/a1Z5HZIAb0 @AndyRichter 1. Machine sounds, large metal       squeaks, take 1                                             2. Eleanor Rigby                                       3. The City Is At War                          4. Circus                                                 5. The Story of Tonight @labruna a bee\nstaggers out\nof the peony \n~Basho @PONYPONY Far as I know, just the movies There’s a fat-faced peony in the garden. Share your #BestBlossom https://t.co/QcRJ4u9Ojz @edmcellig18 Yes Get back to work! https://t.co/RAohbn3jzF Hey @realdonaldtrump: https://t.co/tuSFBxFRT6 South Korean official response: “We are attempting to make sense of what, precisely, President Trump means.”\n\nWelcome to the fucking club. Not so fast, Deep State. https://t.co/Z5pqrqUuoI Say hello to the NFL's newest ref! https://t.co/qf1YMSdYcQ How did these people get under my desk? https://t.co/d8cv0drs0E Tonight’s Late Show features a special appearance by Jon Stewart. But it's a surprise, so don’t tell him! Trump aides write his tweets with bad punctuation to match the President's style. Well, at least there's not grammar Nazis. @MovieLeagueMike @jenspyra Sounds good to me. https://t.co/6kMYVX7sQc The White House is determined to stop leaks at all costs. https://t.co/MYv0z8yCBY RT @colbertlateshow: The Mueller investigation is a year old and we have the perfect gift to celebrate. #LSSC https://t.co/aledtqlgoI Last night's show is up now! https://t.co/Cy7mBbER6u What would a jury of Donald Trump's peers look like? https://t.co/A7SSiqZ49B Trying to understand why Kim Jong Un’s threatening to break off talks with the US. Did Trump cheat with a younger, hotter Korea? The White House must be upset about the Trump Tower transcripts coming out. Especially Mike Pence, who's uncomfortable with any sentence that includes “trans” or “coming out.” 'Pop Quiz' With Jamie &amp; Corinne Foxx https://t.co/U3A68F1c5S via @YouTube Tonight! #LSSC https://t.co/cKWV6DPhuG 11:00-  Yanny again. A plastic bag was found at the bottom of the world’s deepest ocean trench. Hey scientists, while you’re down there, can you look for my sunglasses? Tonight! Lighthearted high jinks with Deadpool! (Seen here strangling Vanisher.) @deadpoolmovie #LSSC #hear https://t.co/ButMgmBy7o 5:30 - Yanny                                              9:30- Laurel                                            What...is...happening? Just a regular ol’ Tuesday night with @iamjamiefoxx ! #LSSC https://t.co/kjb8TscZYS My monologue from Monday's show is up now! https://t.co/gPRQoMXm2N When Trump and Hannity talk on the phone before bed each night, who do you think is the first to say, \"No you hang up first!” If all sports gambling is legal, what’s gonna stop Trump from using that almanac he stole from Marty McFly? Some things need no explanation. Happy Mother’s Day, @mindykaling https://t.co/AsugMb2xRX Boston Dynamics’ new running robot is terrifying! Imagine a bleak future where we'll be forced to listen to robots talk about their marathon training. It's nice when you see good things happen in Trump's America. https://t.co/PKXxZTJXEL My monologue from Wednesday's show is up now! https://t.co/C9Rtn4Q0yN Feels like we haven't heard from Jared Kushner in a while. Are we sure a large bird didn't grab him? After years of saying he was going to do it, he did it. https://t.co/WPv3HTI9zf Yes, indeed! Thank you, @CSiriano  !!! https://t.co/yeZZN0SUUa Two altar boys ready for the #MetGala! https://t.co/yH4T9QnRU8 Speaking of natural disasters, Rudy Giuliani... https://t.co/BofNS4A3F1 Roy Moore and Don Blankenship. A threat to minors and miners alike. Happy Cinco de Mayo Eve! Don't forget to leave out a margarita and chips for Father Fiesta! NBC News has corrected their correction: Michael Cohen’s “phone” turned out to be a stale Pop Tart. I plan to celebrate #StarWarsDay by having roast porg for dinner. It's time for another edition of #StormyWatch! https://t.co/1CNIiVzBOL What if the FBI finds that Michael Cohen mostly just uses his phone to call his 15 other phones? Make sure to change your Twitter password. And, if you know it, Kanye’s. Tonight! May the best Rudy win! https://t.co/bqratSutlP My monologue from last night's Late Show is up now! https://t.co/abIiX4twcV RT @colbertlateshow: Today is huge because we have @StormyDaniels attorney @MichaelAvenatti joining our #StormyWatch and you got 5 mins unt… James Comey says he once sang Beyoncé during an FBI briefing. I guess it's not easy discussing Trump's stay at the Moscow Ritz Carlton without thinking \"Lemonade.” Goodbye, Cambridge Analytica! We hardly knew ye, though ye knew everything about us. At least now Ty Cobb has more time for his true passion: tossing gumdrops and candy canes from a hot air balloon. https://t.co/QI6hByHqL7 RT @Zac_Posen: Excited to have the new The Late Show merchandise in the #ZacPosen showroom! Thanks for the underwear @colbertlateshow 😜 Get… If Trump sees the questions in advance he'll cheat! https://t.co/3TmAv4qBrY Facebook is launching an online dating feature. Which is different from their current online dating feature of showing you who your ex is dating. Mueller apparently has 49 questions he wants to ask Trump. 50, if you count, \"Seriously, what does it mean to 'move on her like a bitch’?\" Here's my monologue from Monday's Late Show: https://t.co/RGX1SQKOAY RT @colbertlateshow: TONIGHT: The White House is running very smoothly despite news that Trump's chief of staff called him an \"idiot\" and \"… I just saw @DisobedienceMov produced and starring the brilliant Rachel Weisz. It’s a beautiful and challenging story about free will, the choice to be ourselves, and to love in our own way. RT @colbertlateshow: Our buddy #MandyPatinkin just released an album, recorded with his buddy producer/pianist Thomas Bartlett. It's Mandy'… Will I understand Infinity War if I saw only 17 of the previous movies? I don’t remember ever being this happy in my 20s... #oldheadshotday https://t.co/XKpx1zIx3A “This is a “lure.\" Normally I just use free condos or offer an appearance on the Apprentice.” https://t.co/hrdg4R2Uo4 RT @colbertlateshow: These as-worn-on-TV #LSSC undies are up for grabs on @eBay right now! Proceeds benefit @ETAForg. Thanks @Zac_Posen for… Donald Trump called in to Fox &amp; Friends yesterday... https://t.co/WR00ghfG64 #DraftDay is trending so I assume Donald Trump is somewhere faking a limp. My monologue from Wednesday's show is up now: https://t.co/vA1SnAS8pe @HelloCullen @ArielDumas @anylaurie16 Wow @hwinkler4real Thank you for being here, Henry! It was a Joy! Bienvenue a Ratatouille! https://t.co/yzGWrEaWTy .@HankAzaria New Late Show in five minutes. Twitter explosion in act three. Because... he's guilty? \nhttps://t.co/iXSGdsZJ3a The leader of the free world tweeted 25 times last weekend... https://t.co/4aZ967B5rr Trump: \"There were gooooood boyyyyyyys on both sides.\"\nhttps://t.co/YCGWVERRNQ Congratulations to the new royal baby! He has his mother's eyes, and his father's hair. James Comey made some new friends at Late Show! https://t.co/R5wtlFvtY6 Watch my Tuesday monologue here! https://t.co/YOx2KhaRvd There was too much Comey to fit in the show! Hard choices where to cut. So here’s the whole damn thing. https://t.co/0eeL8pN6TO Not saying that Trump has Hannity in the palm of his hand, but... https://t.co/ctJkjI62RW @OfficialJLD Some of us know how to rock an asymmetrical hemline. https://t.co/iL14XCQJte High level summit! Tonight! #WuTangForever #Comey https://t.co/EjUakcIqjl Stormy Daniels said that the mystery man who threatened her didn’t have a weapon, but I disagree: You could cut glass with those cheekbones! https://t.co/NuXFI1Lwty Always great talking to you, Father! https://t.co/jfl2g194aa Ongoing troubles for the man who paid off Stormy Daniels... https://t.co/UHZuD6qfMD NOT THE MOST PRESSING THING ON YOUR TO-DO LIST, GUYS! https://t.co/p8ZXh7BfrV Funny how when James @Comey writes a book about the 2016 election and how he lost his dream job and drank wine nobody tells him to go walk in the woods and keep quiet. Firing Comey last May must be Trump’s biggest regret, since it means he can’t fire him now. RT @colbertlateshow: Sneak peek of 'Hannity' tonight... https://t.co/qud8et2cba Can't wait! https://t.co/mHxKlndExG RT @SarahHuckabee: When you're attacking FBI agents because you're under criminal investigation, you're losing https://t.co/SIoAxatCjp I’ve got a date for the weekend https://t.co/7pSayaJYcB Stop the presses! https://t.co/jY18IwmDvM ARE YOU MY SECRET LOVE CHILD I PAID A DOORMAN TO KEEP QUIET?! https://t.co/cL2irm9c2L Chivalry isn't dead!\nhttps://t.co/qzqsGepuYx Take it from me, @Comey, it is! https://t.co/X83xa2AWaW The President is not happy... https://t.co/kEfHt0Ukz8 RT @colbertlateshow: Stephen and Jon are writing a song in honor of Paul Ryan. What do you think of it so far? #RehearsalRewind https://t.c… When you have a warrant, they let you do it. \nhttps://t.co/7hQD40bcul RT @colbertlateshow: Grab your tickets now for Martin Short &amp; Steve Martin, on the road together in their hilarious show 'An Evening You Wi… RT @colbertlateshow: In honor of the House Speaker's decision not to seek reelection, #LSSC presents this look back at Paul Ryan's most cou… RT @colbertlateshow: Cookie's Carpool #NationalPetDay #LSSC https://t.co/VayEAqQdGy My friends @MontclairFlim are putting the finishing touches on their Film and Education Center. Please consider making a small donation and help them develop media literacy programs that teach kids how to be engaged citizens.  https://t.co/b9GkchDPcP \"The porn is on the President\" https://t.co/J3dXUnslGY Truth https://t.co/71rDSIL5Oo Almost feel bad for Zuckerberg. There’s no way he left that room full of old people without having to set up their wifi. Hey look, we're back! https://t.co/lj4GQREpEI Trump's lawyer got raided which means Trump's lawyer's lawyer should probably play it safe and get himself a lawyer. https://t.co/ZNEDQPh6CQ Carthago delenda est RT @MikeVanderbilt: RT these photos of character actor Mike Hagerty. https://t.co/y7zhSW6aIB Reminder: @BandFlaw lays it all on the Line tomorrow @Spicolis Waterloo, Iowa  (hope they play Payback)  !!!!!!!Flaw!!!!!!!\n#DeathGrind Jinx! You owe me a Coke. https://t.co/bNitNTFAkt via @youtube Burn one with Kacey Musgraves! Kacey Musgraves Performs 'Slow Burn' https://t.co/Ei9Xmv6xDH via @YouTube \"Jefferson Beauregard Sessions III.\" Just going to leave this here for anyone who needs to guess his name or he gets your first-born child. https://t.co/986tDk0HvA I feel better already! Thanks @mbsings \nJohn Bolton's Terrifying Ideas Sung By Michael Bolton https://t.co/qJhSsfBIAS via @YouTube The whole damn thing! https://t.co/mSF2N0w8Rb The busiest person at the White House is whoever has to update the office contact list. RT @BandFlaw: Playing Live: Waterloo, IA - Apr 3 at Spicoli’s https://t.co/ye1C1t5lEA Dana was very nice to credit me last night, but the Brokaw/Ford Obituary sketch was written by Robert Smigel, Louis CK, and me. 22 years ago...#tbt https://t.co/xhNw1CWcy1 I am not making this up... https://t.co/b1iOXbaygp He escaped arrest but still got sent to his room with no screen time.\nhttps://t.co/EKXYJhG0GT Bolton seems nice, but his mustache is unhinged. @danacarvey stopped by, too! https://t.co/s0m7JBRV0D The President has a new nickname! https://t.co/fKtPb6xWdj The military's responsibilities according to Trump: \n1. build walls \n2. parades! \n3. excuse bone spurs \n4. war &amp; misc. RT @colbertlateshow: Stephen Colbert invites his guest #SeanPenn to play #LSSC's newest game, where guests are asked to answer completely r… I know Mueller’s busy but…\nhttps://t.co/0InGMZDM2M Looking for Monday's Late Show? Start here! https://t.co/MAFggw6mQQ “Also, don't sleep with a porn star who's way smarter than you.”\nhttps://t.co/cFCbMHrnAP I always get excited when there’s a @thetrevorpotter sighting! @CampaignLegal is working for all Americans- (D) and (R) and (I) - to have transparent campaign finance #RIPhamrove https://t.co/ev8rDXg1Ad Take that, Sauron! Hey @realdonaldtrump I thought you said you'd run TOWARD the kids, not away from them! https://t.co/7hdX2MxX3b Who would win in a fistfight? They’re not imaginary, @mindykaling! They’re “Maybe Coming Soon!” Fingers crossed! https://t.co/hXRnd9YYWp @JakePlunkett Will you ever truly be known, even by those you love the most? Did you catch last night's monologue? https://t.co/M1Y8PlxgAB D.T. phone home. \nhttps://t.co/m4YU0HONqe My monologue from Monday's show is here! https://t.co/Loa4VwH4PU \"Cambridge Analytica\" sounds like the scientific name for \"John Oliver.\" Baseball season is only ten days away, which means we’ll soon be able to measure the longevity of Trump’s cabinet members in innings. Congrats to Vladimir Putin on winning his first election since November 8, 2016! Oh, we know there's no \"plan.” \nhttps://t.co/QOsKcN6l19 This “happy ending” version of Danny Boy is simultaneously one of the most beautiful and most stupid things I ever had the pleasure to be part of. Thank you @KarlScully !\n#HappyStPatricksDay https://t.co/5bjboyfcFU Never https://t.co/BmxBTqRLfD Grace! https://t.co/wAVCaT8yL4 Help us raise some $ for Art Therapy!  https://t.co/29zenDVnHH True. Honest but Weird. So happy with the weirdness. In tonight’s Act 2. Starts in about 5 min. https://t.co/OI6UkQcG4l RT @colbertlateshow: TONIGHT: #PaulGiamatti talks the new season of @SHO_Billions, #SeanBean from @theoathcrackle, and a musical performanc… RT @NorthwesternU: NU EMERGENCY: Person with gun on Evanston campus. If on campus, seek shelter in safe place and stay until further notice… \"The one person Donald Trump hasn't fired... yet.\" https://t.co/9FgoAeK4Y8 🙏🏻👍🏻🙋🏻‍♂️ https://t.co/pR7SJeCW0L Just holding out for the inevitable moment when the only person Trump has left to fire is himself. Trump Firings/Resignations/Departures:\nTillerson\nHicks\nCohn\nScaramucci\nBannon\nSpicer\nYates\nPorter\nOmarosa\nMcMahon\nPayton\nSuhey\nSingletary\nSanders\nPerry\nDent\nTomczak\nMoorehead\nHumphries\nDuerson\nAnyone\nNotice\nHow\nThis\nBecame\nThe\n1985 Chicago Bears\nHalfway\nThrough? @sarcph @SteveKornacki Beautiful dog! Lovely carpet! I’m SHOCKED…that there was anyone in the State Department left to fire. https://t.co/K5VHgCGhfD @colbertlateshow Caesar is my brother. I’m Julius. But I’m honored by the mistake. Ha Ha!! Waiting for PA-18 results...\n#boykinsforever https://t.co/hrlHbwCEuO \"Luke, use the Space Force.\" — Darth \"Space\" Vader Watch my Monday monologue now! https://t.co/H4ru83qLvj RT @colbertlateshow: TONIGHT: Tom Brady doesn't usually drink beer, but when he does... https://t.co/xGWdnlhJOR Okay, fine, but at least tell us the correct way to pronounce Qatar!\nhttps://t.co/qsG14F7Lgz Ryan Zinke reportedly spent $139,000 on doors for his office. Now he can be hit on the ass by something really nice on his way out. Friday's Late Show was a big one! If you haven't seen it yet, here's a good place to start: https://t.co/3GF12IP8dM This destroys all my previously held beliefs about fish-to-panda weight ratios.\nhttps://t.co/ITrm8319jP Some work of noble note, may yet be done https://t.co/eBpMcg0jXg If you missed last night's show, here's a good place to start: https://t.co/NhsQRrbKkk RT @colbertlateshow: When Oprah’s baby gift to @mindykaling was better than yours. #LSSC https://t.co/D8FgDMoDom $139,000 for a door!? For that you can buy a porn star's silence AND a used Acura. https://t.co/J4RMNz9fU0 @ohhleary Hi! @JakePlunkett Happy Birthday Watch my monologue from Wednesday's Late Show here: https://t.co/G9XFp46UyC Guess he paid out more pornstar hush money than we thought. \nhttps://t.co/cuRWng0adK Still mad at Carlos Danger for making David Dennison president. With all these headlines, I just assumed Steel Tariffs was Stormy Daniel's co-star. https://t.co/j3mUiSL4MK Tuesday's Late Show is avail now! https://t.co/xQElj6B6Hf I stand with President Dennison! @Oprah should be a controlled substance because I have a contact high! Tonight! https://t.co/HOXM4FFvYn If my Trump math is right, the only way to get this ban reinstated is for Obama to kill an elephant. https://t.co/ZqZmkoN7Sx No one knows what Trump’s final decision about tariffs will be. I wish Fox &amp; Friends would pick a plan and stick to it! Here's the link to my monologue from Monday night's show! https://t.co/0eGNidHQqy Donald Trump: “Do as I say, not who I do.”\nhttps://t.co/06QgWeOBgG Quick idea for a sequel: the two of you finally meet in person on @colbertlateshow on Wednesday. I’ll play myself! Thoughts? https://t.co/IldlyC28vJ Another place I didn't even know SOLD guns.  Please tell me you can't buy a Glock at Crabtree &amp; Evelyn.  \nhttps://t.co/d11J8gBfLA That won't be a problem once his presidency takes us back to the Bronze Age. https://t.co/ZmzEegCXtu \"Who wants to eat soup and get drunk with Mr. Burns?\" https://t.co/6CTniLTmwp Tonight I return to Capitol Hill. https://t.co/8qQxZQrIwG March is coming in like a lion, but I'm pretty sure it'll go out like a disgraced member of Trump's inner circle. Happy #WorldWildlifeDay! I wonder what Don and Eric killed to celebrate. You know it's a special night when I get to say \"clustermunch\" at the top of my monologue, check it out: https://t.co/aaKSlqmojO Extra Extra @donaldglover: Rapper? Writer? How do you identify? https://t.co/eMsViWXnZC Extra @donaldglover: I introduce him to his Lando LEGO! https://t.co/XTBUqt4y2D Looking for Thursday's Late Show? Start here! https://t.co/21gz9ckxwS The Omarosa Interview: Full, Uncut Version https://t.co/L1wA6EFJj7 via @YouTube Tonight! @donaldglover meets his Girl Scout fan! https://t.co/yCNQz7M4rd RT @helloross: No shade, but Omarosa is mistaken. This convo was not about the Dreamers (we discussed that at another time). This convo was… Don't tell the President. He has enough worries these days.\nhttps://t.co/S6q4ue79Xp Should be soon -- the incubation period for lizard eggs is 4 to 8 weeks.\nhttps://t.co/Lxi62W4sy4 Remember, sir, I spell it with a \"ph\", not a \"v”. https://t.co/8WO6yvjJxj Watch last night's monologue today! https://t.co/fRJCeVWt7T New @lakestreetdive !! Nice.\nhttps://t.co/z6Pc23skf2 Monday's Late Show is up now! https://t.co/l0pum6Ciqi I’m surprised the NRA was affiliated with car rental companies at all, considering Hertz and Avis enforce tyrannical rules like \"age restrictions\" and \"having a license.\" RT @bobpowers1: Plug and excited brag: if you have Showtime watch \"Our Cartoon President\" tonight at 8. This is my \"written by\" episode, wh… RT @CartoonPres: #OurCartoonPresident tries to court Cartoon Ivanka by backing her progressive initiative. Don't miss a new episode this Su… Manafort now facing charges of \"money laundering\" and \"being your grandpa.\"\nhttps://t.co/h6K0MzVE4k Our Cartoon President is addressing CPAC right now!\nhttps://t.co/w9PBMjANqy Looking for my Thursday monologue? Here it is! https://t.co/WuaHtAXJ1R RT @JAdomian: Senator, you’re no Lisa Simpson. @tedcruz https://t.co/Kh22E4lIz8 Grab the spatula, someone’s about to start flippin’! https://t.co/Cwg2q1S8go Missed last night's show? Start here! https://t.co/8DFXdPtM6C Hey KFC - we’ve got tons of lawmakers who are too chicken to stand up to the NRA. They’re all yours! https://t.co/UvVIFlWQm6 From now on, when anyone says, \"Kids these days!\" it’s a compliment. https://t.co/XfNpgdTkwI 6) Whatever you do, DON’T LET ANYONE SEE THIS LIST! https://t.co/2VvSW9gYRP Last night's show is up now! https://t.co/AP4Q4iuQKL @BrianLynch @JakePlunkett No New episode at 8pm! #OurCartoonPresident https://t.co/IonaN8aGQh #TeamHolcomb  https://t.co/WQ73aj3Znk RT @CartoonPres: Tonight, #OurCartoonPresident sets out to reverse every last one of Cartoon President Obama's accomplishments. WIll he be… @HelloCullen ...in verse. Just enter code IAMPOOR at checkout for 20% off your dignity! \nhttps://t.co/6b2DqK7BtR On Capitol Hill. What don't I want me to know??? #releasemymemo https://t.co/nyk9U0uQG9 #OurCartoonPresident showrunner @rjfried is live tweeting tonight’s premiers! https://t.co/F8dUaCb5fP On Showtime now! https://t.co/p3ucgR2ydU RT @CartoonPres: Watch a sneak peek of tonight's all-new #OurCartoonPresident. #Showtime https://t.co/UabLi2aZeB @RedmondGerard !!!!!!!!!!!! @shibsibs #TeamShibutani TGIF! (Tonga guy is FINE) \nhttps://t.co/iDK8eEbH6Z Have they tried “scratch ’n sniff?”\nhttps://t.co/SpwOaahNft \"Hope you enjoyed my prayer breakfast yesterday. Oh, and all women are liars.” https://t.co/1F9ybKb3V5 Happy Early Valentine’s! https://t.co/BdbHhhnsu1 Missed our show last night? Watch it here now! https://t.co/u9w7QC6VDa No, Oprah! Do not throw away your shot!\nhttps://t.co/MQe8LeZmAj $130,000 is also good. https://t.co/sPw4k4BtM8 Last night's show is avail now! https://t.co/TbgFHd3ZOu I don't think my Lyft driver knows where he's going. https://t.co/oAnHFRbuNm Great idea Bryan! Hotel chains: call now for discounts on bulk orders. https://t.co/59EYUnKD5b @HelloCullen You better believe it...\nhttps://t.co/yiKbOO6ERi @HelloCullen Nice, but I’m looking for a good deal on a wake foil. https://t.co/o0r5bIT81i Watch my Monday monologue here: https://t.co/cJsSUftAos Philly fans, please go back to throwing batteries at Santa Claus.\nhttps://t.co/5SkIdO1iAw RT @colbertlateshow: The Steele dossier and the Nunes memo finally meet face-to-face for a battle of writs. #YoMemoJokes https://t.co/VkRzq… IT’S NOTHING! DON'T WORRY ABOUT IT! https://t.co/6Arr833e7h This memo proves Trump was really serious about improving his health - he’s switched from cheeseburgers to nothingburgers. Just started #TheMemo, and I already found a lie in the very first line. https://t.co/f4iyB2Qx25 Friday night status #boykinsforever https://t.co/4COvxc4JGA My Thursday night monologue is here! https://t.co/zQ3LhMjCZt I'm glad the Super Bowl is this weekend because it makes my Sunday tradition of eating a pound of melted cheese out of a helmet less weird. Trump also sees himself as, like, a smart person.\nhttps://t.co/yWDd4wjF2g важная новости!\nhttps://t.co/bho7dh9g2N Take a look at my monologue from Wednesday's show! https://t.co/HAThdeVHnC Here's my monologue from last night's LIVE episode! https://t.co/f3lDzsDyvw Pretty lucky Joe Kennedy's car broke down where he was supposed to give his speech. https://t.co/IcoPCOpPLC Somehow, Trump will claim that there were more people in the room for his State of the Union than Obama's. Check out my Monday monologue! https://t.co/bKmjfxLaXE RT @colbertlateshow: TONIGHT: Who needs Piers Morgan's interview with the President when you have Stephen Colbert's interview of the Presid… Is it possible that \"President Donald Trump\" is also a typo?https://t.co/EF0i817pZ1 THE FINAL YEAR is “like a real life version of The West Wing.”@THR                                            Don’t miss the documentary @FinalYearFilm at @MontclairFilm this week, featuring @SamanthaJPower @JohnKerry @BarackObama &amp; more: https://t.co/ZLMQcQUH1f https://t.co/KjKh896if6 My fellow Americans, I am proud to announce that Episode 1 of Showtime’s “Our Cartoon President” is available now. Enjoy! https://t.co/PxfyfLDpBg Last night's Late Show was a little different - here's how we opened the show: https://t.co/UhxKPXGuFk Just tossing my hat in the ring as a possible \"first male Mrs. Butterworth”. https://t.co/h0EecJ56pX RT @TheDweck: There is no better metaphor for being a woman right now than wanting a female president and getting a female fast-food chicke… Jared Kushner: \"Wait, we can quit?!\" https://t.co/UNPduMXqU1 Join me on February 24 at '70s Mixtape: A 1970s Dance Party at the @WellmontTheater in Montclair, NJ benefiting @MontclairFilm! I'll be shaking my groove thing onstage, along with @PatrickWilson73 @WarrenZanes &amp; @JonBatiste! Get your tickets here: https://t.co/FIgncJQ6Gf https://t.co/AB2ocPw3V6 My Thursday monologue is available now! https://t.co/PN63bCtfZD Harsh. But I think history museums are going to be even harsher to him. \nhttps://t.co/do60aDzfyw Have they tried putting a towel over his cage so he thinks it’s nighttime?\nhttps://t.co/Yborr7BQgy I’ve got a tip for this guy: get a crock pot. Preferably the one from “This Is Us.” \nhttps://t.co/ZODuLnfiB4 Mueller, a few weeks from now: \"Thank you for sitting down for this interview, Mr. President. First, I'm going to ask you to point to anyone in this room who you regret not firing.\" @Tamikah1 I’m glad to hear that! Stay strong, Juliane. Now available: my monologue from Wednesday night! https://t.co/P1vtFRWSxI My Tuesday monologue is up now! https://t.co/wgstuCFz04 \"Whatsoever you do for the least of your brothers... will get you arrested by ICE.” https://t.co/eeLiffYSlY Congrats to everyone who got Oscar noms! To everyone who didn't: you're still movie stars. It’s gonna be ok. Hey check it out, it's my Monday monologue! https://t.co/XP9vXVoiAv Here's my Friday night monologue! https://t.co/Axpi7QlLJb Let he who is without a fetish for being spanked by a porn star with a magazine featuring you on the cover &amp; then ask a lawyer set up a shell corp in Delaware to secretly pay hush money to hide your infidelity &amp; the news leaks as you speak at a Pro-Life march cast the first stone 2016: After the election it will be interesting to see how the Clinton administration allocates funds for its free in-state college tuition program.\n\n2018: The President told a porn star he hopes all the sharks die. I bet Trump would've angrily denied the Stormy Daniels story if he weren't secretly high-fiving people about it. Check out this incredible comedy fundraiser for @nyloveskids! Go to https://t.co/um410qfoyV for ticket info! Hey @NYgovcuomo, thank you for supporting the Child Victims Act. It’s such an important issue. Follow @nyloveskids to stay informed and to stand up for victims of child sex abuse. #KidsToo Check out my Thursday monologue! https://t.co/1eBzKi5ibg \"First, do no harm. Second, okay fine, do harm but only to people you disagree with.” https://t.co/nLQUhd4zjb If Donald Trump likes being spanked with a magazine, he's going to love it when a judge throws the book at him. A sneak peak from the presidential spank bank... https://t.co/kPkt3xwz7d Here's my Wednesday night monologue! https://t.co/9vcWyRkSbR A picture is worth a thousand words, but in this case I’ll take the words, thank you. https://t.co/9AQK51qdT2 “I have been to the International House Of Pancakes, therefore I also have diplomatic immunity.” - Steve Bannon https://t.co/hPJ1K7agdK Hey, check out my Tuesday night monologue! https://t.co/w5kvLxgyo7 RT @colbertlateshow: #BonJovi fans you don't want to miss this! @jonbonjovi sits down with #Colbert tonight on #LSSC! https://t.co/JfmPU9A9… I believe it was a reading from The Letter of St. Paul to the Elephant in the Room. https://t.co/ffC2PuDe85 Vital Stats from President Trump’s Physical:\nHeight: 75 Inches. \nWeight: 239 Pounds.\nDepth: None. Status: https://t.co/GxSGpOGAaT Here's a peek at my Monday night monologue, enjoy! https://t.co/uzsv8mLdvj Like taking candy to a baby.\nhttps://t.co/dezaDHZHMf “Unhappiness. Where’s when I was young and we didn’t give a damn, ‘cause we were raised to see life as fun and take it if we can.” Check out my Friday night monologue! https://t.co/UI0w3IsfYk Let me get this straight: You’re saying Donald Trump had sex with a local weatherman? @NorahODonnell @CBSThisMorning @colbertlateshow Your banana bread was pretty good, @NorahODonnell but check out what just made! https://t.co/xqqIE9G5M0 Here's my Thursday night monologue! https://t.co/LKtMVAJM50 Today's Gospel according to Donald: \"And Jesus said, whatsoever you do to the least of my brothers and sisters, that you do unto me...unless they're from one of those shithole countries!\" https://t.co/4BQMFsGBTP Take a look at my Wednesday night monologue: https://t.co/sNCgNqGN5N Candied tangerine rinds https://t.co/uOc6DZinBK This season of Black Mirror is more disturbing than I could’ve possibly imagined. https://t.co/gB1IsupHvK Nothin’ but respect for OUR @CartoonPres. It premieres Sunday, Feb 11, 8 PM ET/PT on @Showtime. https://t.co/DnTDbXYyRf Here's my Tuesday night monologue! https://t.co/UX0IGIhvuP We got Trump’s audio feed for the National Anthem! https://t.co/CZb2w1ExBu Hey, check out my Monday night monologue! https://t.co/LVaB1rjSnx When you need to quickly get rid of Stephen Miller… #JakeTapperandtheDeathlyGuest https://t.co/FkGGmfFpmG The President didn't hold his Fake News Awards today, and the fact I said he would is MORE PROOF I SHOULD WIN ONE! One of the most surprising parts of \"Fire and Fury\" is how Donald Trump accidentally started a national book club. Check out my Thursday night monologue! https://t.co/CtXGnPotzJ Look, I know things seem bad, but at least lizards aren’t falling from the sky, oh wait... https://t.co/tnlXTkJWBo @chrissyteigen @andersoncooper I’ll be there, Chrissy! Maybe not show the whole mani, but I’m happy to give him one finger! Hey! It's last night's monologue! https://t.co/3SBlKCj1AX So excited for Monday’s “MOST DISHONEST &amp; CORRUPT MEDIA AWARDS OF THE YEAR!” See you on the red carpet, @AndersonCooper! #TheFakies https://t.co/r8pYCj0g9r Tonight! My desperate bid to get Trump’s disapproval! #TheFakies https://t.co/7exZSesI8m Winter Storm Grayson appears to be turning away from the East Coast, possibly because it can’t compete with the shit-storm in Washington. https://t.co/Jon3ka2USQ Please don’t make me picture your “Button.” \n...also don’t start a nuclear war, you “Buttonhead.” https://t.co/kfFvLkBMk4 Having trouble following today’s news, but I’m excited to congratulate Hoda Kotb on taking over for Sen. Orrin Hatch!! There was that time Dave Chappelle stopped by and made me feel better about America. #Make2017GreatAgain https://t.co/IwV6jWhbiL That time we gave a fond farewell to the only coherent part of Trump's tweets. #Make2017GreatAgain https://t.co/lTkwyn9GUU Remember when we had a wonderful kind of day together remaking the Arthur theme? #Make2017GreatAgain https://t.co/saaMEmKvxB Needed special cameras for my new segment \"The Two Palest Men In Show Business.” #Make2017GreatAgain\nhttps://t.co/h08Bp423W7 My visit to the Moscow Ritz Presidential Suite or \"P Suite.\"  Wink-wink.  #givemethepeepeetape #Make2017GreatAgain\nhttps://t.co/Nr8xWb59Gg That time I destroyed my innards for your amusement! #Make2017GreatAgain\nhttps://t.co/ca7SaCkWyW That time your cool cousin @nickkroll and I taught you about the birds and the bees and the pubes. #Make2017GreatAgain\nhttps://t.co/X9Has545L5 RT @DavidSpade: 20 years ago today. https://t.co/01TzKrelLT I did lines of truffle powder with Oprah! #Make2017GreatAgain\nhttps://t.co/bO8xOn9n0o My new animated series Our Cartoon President (@CartoonPres) will premiere on Sunday, February 11 at 8 PM ET/PT on @Showtime, with a special online preview on January 28! Here’s an early look: https://t.co/lUGBjs4iQQ https://t.co/JX10WIkZij Remember my last day at the Daily Show? Totally forgot there were cameras there. #Make2017GreatAgain\n\nhttps://t.co/KIvV9fXnMR All good things must come to an end. Also, 2017. To celebrate, I’ll be tweeting out some of my favorite moments from the show! #Make2017GreatAgain Now you can binge-watch a whole year of the Late Show in just 4 minutes! https://t.co/y8i0qVbekm Not always, but this time. Go see it. https://t.co/5792CYjOni Congratulations to Senator-Elect Doug Jones, who beat Roy Moore and then busted a move to celebrate! https://t.co/9ixmg5PAh6 This year Santa brought me the best Christmas present of all- a box of @tomhanks! https://t.co/LBpshdydZN The weirdest thing about Doug Jones winning was that for the first time since last November, I drank to remember. CNN: Roy Moore lost.\nMSNBC: Doug Jones will be the next senator from Alabama.\nFOX: IS MUELLER SECRETLY HILLARY IN A LATEX MASK? WE’LL ASK TED NUGENT. According to Alabama state law, Roy Moore now has to eat his horse. https://t.co/8LVvznMR5y IT’S CHRISTMAS MIRACLE! Yes, Virginia, there IS an Alabama!! Wow, if I had invested $1,000 in Bitcoin last week, today I would have... still no idea how Bitcoin works. I import my good news now. \nhttps://t.co/tVupkg0ZX7 The White House is saying Trump's slurred speech last week was due to dry throat. It's a common side effect to lying mouth. I’m eight miles high. It’s all gonna pay off, 13 year-old Stephen! https://t.co/IvOMjQKpfE 🎶It’s something unpredictable, but in the end it’s right\nI hope you had the time of your life 🎶 https://t.co/RKT9nZo87G As FDR so famously said: “December 7, 1941. A date which was a pretty wild scene. Totally nutso. Seriously, that shit was crazypants.” https://t.co/WJngq78Lba Congrats to my Australian friends! Love is Love, but Vegemite is still Weird.\nhttps://t.co/8ZjcTeoIPk Sorry you didn’t get TIME’s “Person of the Year”, @realDonaldTrump, but at least some of your accusers did! https://t.co/8xqHHKhtVV Counting down the days until Christmas...2020! Now would be a good time for his opposing candidates to get life insurance. https://t.co/q8lS6qLZQR I'm surprised Trump didn't declare Jerusalem as America's capital. Then he'd be able to say we have a wall. Thinking of all my friends and family in SoCal facing the fires tonight. Stay safe! RT @JakePlunkett: Is it still infrastructure week? Tonight. https://t.co/8uzHskTG04 Hey @ChuckGrassley I heard there’s half the population that doesn’t just spend money on women, they actually ARE women. Totally irresponsible, right? https://t.co/wC1SgX4mFk We couldn't have done it without you, sir.\nhttps://t.co/lhuCgyM5FU TFW Flynn flips https://t.co/nK2cx1hZLS \"Flynn finally flipped\" is my favorite news and my favorite tongue twister. Revenge is a dish that is best served Comey. https://t.co/8zwwXIPmWL I’m not good with fractions- does lying to the FBI count as 1/10th? \nhttps://t.co/eSVL9YfgZg Non-hypothetical question: are you insane? https://t.co/BXTNJssIHT Wow, really? The rest of us think he seems 100% fine. https://t.co/F0fx5j3bLA Siri, what's a good activity for someone with four dollars and crippling self-hatred?\nhttps://t.co/PUMFSG3RCM RT @colbertlateshow: .@jtimberlake: Church is the best place to sing because you can go up and completely botch anything and then at the en… RT @colbertlateshow: \"What is happening right now?!\" @jtimberlake can't believe he's on #LSSC singing the National Anthem with @StephenAtHo… Your psych book don’t know jack. Nice pic tho. https://t.co/YfSgCNJYO4 RT @TheAtlPolitics: Why does Donald Trump always feud with outspoken black people? @fivefifths asks https://t.co/ktnfndVrCB https://t.co/9l… Fox News: “The left is unhinged with all this Russia talk! What a bunch of unfounded conspiracy nonsense! Anyway…” https://t.co/NCfKHImrWv More Democrats are pressuring Franken to resign. But on the plus side, he’s now polling around 50% in Alabama.\nhttps://t.co/2P25vYFVBs And ye may make three wishes upon the accursed paw! (All of which are “not to get a back rub from Charlie Rose.”) https://t.co/WgSRLSTyJI Well, it explains why he always kept the studio so dark... https://t.co/WI4VlP09hC Warm thanks to our Navy for this heartfelt salute to the President! https://t.co/ZjsmssRfCi I refuse to wish Happy Birthday to @RuPaul because everyone knows RuPaul DOES NOT AGE. RT @colbertlateshow: Big news out of the art world! #DaVinci #LSSC https://t.co/k7FvTwswTN If I'm reading this week's news correctly, is the solution to all of this to nominate Drake to the Senate? Senators are proposing lowering the alcohol tax which is good news, because once you see the rest of their tax plan, you're gonna need a drink. “The only thing necessary for the triumph of evil is for good men to do nothing.” There comes a time when one can no longer stand by quietly as our society chooses a dangerously unqualified man. So today, I break my silence to ask… Blake Shelton? Really? Potential Titles:\nGoodnight Mooch\nCrime And A Complete Lack Of Punishment https://t.co/oVw9ybfdlM \"There's a special place in Hell...also the Senate.\" https://t.co/gUbscQMRDg RT @JohnCleese: Dearest twits, a plea for help !!\n\nI have lost my diary. Somewhere in DC, Richmond or Nashville...\n\nIt's bright red leather… Welcome home, @RealDonaldTrump! While you were gone we started actually punishing people for sexual harassment so, you know, heads up. “I know you are, but what am I? Furthermore, I cite precedent in the case of Rubber V. Glue.” https://t.co/zQqXHHyujy Jeff Sessions testified about the Trump campaign and Russia today, providing some much-needed details about things he remembers nothing about. How many times does Wonder Woman have to save us?! She already won WWI - let the woman rest! \nhttps://t.co/8JJTAmtFAp Hope nothing bad comes out about my comedy hero, Mel Gibson, now starring in Daddy’s Home 2! What if I told you that you could support teachers, members of the military, AND their families with one easy donation? Because that’s exactly what I’m telling you: https://t.co/ZGR8g9XoFF Louis CK’s apology leaves a lot to be desired. For example, I “desire” a time machine so I can go back and tell him not to masturbate in front of those women. I'm pretty sure this story was written by a killer robot. https://t.co/Tyb1UlfSYm Until there is a smoking gun in the Roy Moore case, we shouldn't rush to—okay, there it is. https://t.co/2fPceq158m While we're at it, can we also replace all our Confederate statues with Christopher Plummer? Words we’ve learned in the 365 days since Trump was elected:\nEmoluments\nScaramucci\nLocal Milk People\nCovfefe\nRagnarok (admittedly, not Trump-related, but that movie ruled) We all have 280 characters? Well, as Shakespeare wrote, “Brevity is the soul of wit. The soul of wit is what brevity is. Brevity? Soul of wit? They're the same thing. Like if you had brevity in one hand and the soul of wit in the other, you’d be hard pressed to tell them apart.” Dear Twitter,\nIf there's one thing we could ask for from 2017, it wouldn't be \"more Twitter.\"\nThanks,\nStephen Mom is the first audience and the best. Remembering Jimmy Fallon and his family in our prayers today. Sunday is the end of Daylight Saving, so remember to turn your clocks back one hour, then go back to yoking your oxen! To be fair, she did attend his wedding. https://t.co/kpt2wMYq8V If I wasn’t one of the prizes, I would bid immediately! Do it for the troops! https://t.co/mrpK1e04pP Stewart/Colbert/Oliver/Rock/CK/Sandler/Stiller/Mulaney/Kemper/Minhaj/Jacobson/Klepper/Munn/Courddrymore2come #autism https://t.co/1WYPI2jIUT LOCK 👏 HIM 👏 UP!\n\nALSO 👏 HIM!\n\nPLUS 👏 THIS 👏 OTHER 👏 GUY 👏 I 👏 HADN’T 👏 HEARD 👏 OF 👏 UNTIL 👏 TODAY!\nhttps://t.co/0Bjf7hGu6z We take you now live to the Oval Office: https://t.co/mqHoLQCnLm RT @colbertlateshow: No one says Stranger Things than @RealDonaldTrump. #StrangerThings https://t.co/Sx0SXVfcXf “I urge my colleagues to stand up and be more forceful. Anyway...SEE YA, SUCKERS!\" https://t.co/k3n89FDBuw Now, the former president is good-naturedly requesting that you \"back that thang up.\" https://t.co/BvHPeag6Ag Hey! Like films not based on superheroes? Check out the Nov 2017 schedule @MontclairFilm’s #Cinema505 See ya there!\n\nhttps://t.co/7BFKMEP5aQ If Bill O'Reilly can blame God for his problems, can the rest of us blame God for Bill O’Reilly? Glad to be back with new shows this week. Last weeks re-runs were fun but it got exhausting re-enacting old episodes word-for-word. Duh. Have been since November.\nhttps://t.co/hGYECZOfoS RT @NewsofStJohn: St. John, an island in the US Virgin Islands, has been without power since September 6. Please keep loving &amp; supporting u… I don’t know about you, but after this week, I’m ready. https://t.co/FKpMZL0zpr RT @colbertlateshow: Hey @Cubs, #BillMurray has a pep talk for you guys as you prepare for Game 5! #FlytheW #LSSC https://t.co/Fr8Ocv6Rzv How about we drop the whole “boy” and “girl” scouts thing and call them what they are: Kids with knives who know how to set fires. https://t.co/LKwitrwRW2 The Ivana vs Melania feud is a fun distraction from the feud of Trump vs NFL/Jemele Hill/Tillerson/Bob Corker/Kim Jong Un/Reality. I don’t know how Trump would do with an IQ test, but I'm pretty sure how he'd do with the Marshmallow Test. Tonight I'm joined by a very special guest! https://t.co/dfXxnaekNh 4! https://t.co/hmq06wsw3f Having a great time at New York Comic-Con! If you see a guy dressed as Deadpool, that’s me! Run up and hug me! I hope when Trump said “This is the calm before the storm,” he was referring to the burrito he had for lunch. So far, Harvey Weinstein has checked off “Sex” and “Lies,” but I really don’t want to see the Videotape. And now: the awkward, adorable, musical conclusion to the  #PuberMe challenge! https://t.co/xr7GveKQy6 via @youtube #LSSC tonight AFTER football!\nHope your team won. Join us for dramatic conclusion of #PuberMe with @Lin_Manuel Miranda! #PuertoRicoRelief Netflix is raising its monthly rates?! Man, whoever's password I'm using has got to be pissed. Relations with nuclear-armed North Korea may be unstable, but I’m sure our State Dept has their eye on the- oh shit. https://t.co/pExqhUpf3z She was great! Thanks, Annie! https://t.co/VTAy6TXyzF Hey GOP is now the time to talk about gun control?\n\n.\n\n.\n\n.\n\nHow about now?\n\n.\n\n.\n\n.\n\nNow? Still no? Oh, \"never?\" \"Never\" is good for you? Drinking Game: Every time Trump says \"I'd give our response to Puerto Rico an A+,\" remember that Puerto Ricans have nothing to drink. Days like today can make you feel powerless. You're not.\n\nhttps://t.co/KY1CykC0nh\n\nhttps://t.co/iDYdGnke8C\n\nhttps://t.co/4dvDsWiDx4 Lena Dunham as a tween looks more self-assured than I have in my entire life. \n#PuberMe #PuertoRicoRelief https://t.co/bDlIFFGch7 The rest of James’ awkward teen years aired on the WB from 1998-2003. https://t.co/zEumyeatYq Li'l Bobby Moynihan dressed in funhouse camouflage. \nhttps://t.co/VhLlCF8qT4 https://t.co/oeWP3OG7Pg Laura, I’m sure you were the belle of that seafaring cotillion. \nhttps://t.co/vhfmp0hQkF #PuberMe #PuertoRicoRelief https://t.co/hHDe9C5q3T YAS TWEEN!!!! \nhttps://t.co/9gDFY61lMy https://t.co/1GMTMcN9YN Not that embarrassing, since I currently have the same posters on my wall. \nhttps://t.co/62bzzsg6An https://t.co/jyLXV6mVg6 David, I'm sure you feel blessed to have the entirety of your puberty so well documented for future generations. https://t.co/lxeO21m5ZR Here's Ken Jeong as a small adult man. https://t.co/CFzE5j44oj Bridget Everett proves you don't need the \"correct\" number of teeth to have a winning smile. https://t.co/I5tBrSHrPF #PuberMe https://t.co/fazJXjFMX4 Whoa! Here’s a young Mayim before she discovered flower hats on Blossom! https://t.co/KidHlVh5CY Knowing Patton, I’m sure he was hoping for a gig at the Mos Eisley Cantina. https://t.co/xcgDmPCeXw Here's a photo of a young, pale Andy Daly, mere seconds before he burst into flames. https://t.co/qVMX38wF5H Give Angela a hand! No, seriously, I think she has no hands. https://t.co/XCQ8yfQfnH Technically, this was a #PuberHim since Amy posted it, but, I’ll allow it. https://t.co/tHAqy2ai5T https://t.co/toAnTQi6mU 🎶 I am the very model of a teenage major general.🎶 https://t.co/m8wRmEgPvW She's smiling because those glasses are strong enough for her to see into her awesome future. https://t.co/Vs8pXhuNND Joshua Malina apparently grew up in a 70’s retirement home. https://t.co/B0JwEoJ50R Is this Young Tony Hawk, or the Wikipedia picture for \"The 90s\"? https://t.co/BiVTulL53v Young Mr. Belding looks like he just got called to Mr. Belding's office. https://t.co/cRd9IYicfN Adam Scott's first summer job was volunteering his head to scrub out cast-iron skillets. https://t.co/pGYO6kCj5f My bus stop was nowhere near this cool. https://t.co/mvnom4DRlw Aww! Young Ryan Seacrest's first American Idol was ... his mommy. https://t.co/YbEbduEHLJ This is what Jon looked like on our first show. It’s really taken a toll on him. https://t.co/EqKEftSXpz This was taken right before he did a 30-minute deep-dive about why Stephanie should go to Prom with him. https://t.co/Unj6QLdIWU That's funny, I don't remember Jimmy being in Wayne's World. https://t.co/CqS8cTtXIX Her face says \"Teen,\" but her haircut says, \"Mother of two.” https://t.co/6iMSkvnt7f I hear for his retirement, Tom Price is having the taxpayers buy him an extremely expensive gold watch. This is my Head Writer, Opus, in an awkward phase that continues to this day. https://t.co/J7QYnrNJkY Jazz legend Eddie Palmieri, cosplaying as a young Eddie Munster. https://t.co/SyIFeaORVh Back in Marc’s early days, it was considered fashionable to wear all your clothes at the same time. https://t.co/pxgt2xdRfY The Dick Van Dyke Show’s Rose Marie was a teenager almost 80 years ago, right around the time teenagers were invented! https://t.co/pJckSTjTSF The hairspray industry must have tanked when Debbie Harry stopped wearing her hair like this. https://t.co/hz77SUQH5Y Jack Garratt, aged, 14, is available to play all your block parties or neighborhood BBQs for $5 and a ride home. https://t.co/1J7BNHQSBB If only Kevin Smith’s current facial hair could go back and tell his old facial hair to hang in there. https://t.co/Vgwhcor2iq Sure, he doesn’t look much like the Andy Cohen we know yet, but, Watch What Happens... https://t.co/aa8Vv7B1ri I am counting this brave woman as a celebrity because of her mastery of reed instruments &amp; bangs. $1000 to Puerto Rico! https://t.co/oQ6tDBBj6q Back then, he couldn’t Carpool Karaoke without a licensed driver accompanying him. https://t.co/Rqv4zAK9Oe America Ferrera has clearly grown out of her awkward phrase. If only I could say the same for America. https://t.co/nPA5YVhU8u I paid these boys $5 each to mow my lawn - and they did a marvelous job! https://t.co/YHlpzgWlXL This lil’ guy can teach you how to make a whistle out of a blade of grass! https://t.co/BISrlTn7kY How much is Americone Dream donating for every celebrity #PuberMe for #PuertoRicoRelief? Watch to see @NickKroll name the number! https://t.co/bXZQ0PpDyf RT @BenSPLATT: Bringing back this iconic look for you @nickkroll. #PuberMe #PuertoRicoRelief https://t.co/vSZ78VT7mM RT @alyankovic: #PuberMe #PuertoRicoRelief https://t.co/iAV1ott2Dl RT @SarahKSilverman: Yo ma mensches @nickkroll &amp; @StephenAtHome here's some sweet awkward #Puberme for #PuertoRicoRelief https://t.co/y4JrP… RT @JKCorden: Hello ladies.... and @nickkroll and @StephenAtHome, I'm James from High Wycombe, England. #PuberMe #PuertoRicoRelief https://… RT @JuddApatow: Okay @nickkroll @StephenAtHome @jimmykimmel here you go!  Rocking the Fred Perry hard! #puberme @puertoricorelief https://t… RT @jimmykimmel: Hey @NickKroll &amp; @StephenAtHome here’s a photo of me from earlier today #PuberMe #PuertoRicoRelief https://t.co/TELUdYH43d Nick Kroll asked me to post a pic of my awkward stage, but I never had one. So here's me lookin' cool as hell! #PuberMe #PuertoRicoRelief https://t.co/UC9a7XtjZa If Roy Moore hates gays so much, why is he so into Brokeback Mountain cosplay? https://t.co/yLwFfMPZCn RT @mindykaling: This sequined dynamic duo is now streaming on @hulu #TheMindyProject https://t.co/Y7I5pF46nm Trump’s new travel ban includes Chad, North Korea, Venezuela, and the Golden State Warriors. And in one stroke, Twitter doubles the complexity of our nation's foreign policy. My writers put together a tasty 9 minutes on Trump vs. the NFL last night. Take a knee and check it out. https://t.co/JL6yxWowqI @chancetherapper has a new song. It's so good. https://t.co/oz3AMBkuA5 Hey! Win 4 box seats + backstage passes to my show with @iamsambee, and we’ll drag one of you up on stage with us! https://t.co/gVjSXppChq Tonight: I’m not worried about the guys with the regular footballs.  It’s the guy with the nuclear football who scares me to death. #LSSC Tonight! @chancetherapper performs a brand-new, never-before-heard song! Mind-blowing, eye-opening! &amp; other hyphenated great-things! #LSSC https://t.co/CkKaWv0LZP Proudfeet! https://t.co/mHI0Cid29S The remaining GOP senators? Totally cool with voting in bad conscience. https://t.co/OpGit8W6yP Please @JimmyKimmel - stay out of politics. Leave the important stuff to reality TV stars with a knack for bankrupting casinos. Can't wait for Trump to visit Nambia and their technologically advanced neighbors in Wakanda. https://t.co/cfsT5yT35j Fixed it. https://t.co/Ta9amHdLGb Wish I could have told these! https://t.co/0a2bA2Ukfc Republicans are trying one last Hail Mary to repeal Obamacare. The plan? If you get sick, say a Hail Mary. 90% sure Trump nicknamed Kim Jong Un “Rocket Man” because he forgot his name. Anyone else want to hear Jon play the whole song? https://t.co/wPvYrG0AjP RT @colbertlateshow: TONIGHT on #LSSC: Before getting into the 2016 election, @HillaryClinton reviews #WhatHappened in @realDonaldTrump's #… Video: hot leak from Russia! Sorry, not the one you've been waiting for. https://t.co/QyXM3gi8Xg On 9/17, I host @TheEmmys. Good people. On 11/9, I join @IAVA veterans Heroes Gala. Much better people. Pls Donate! https://t.co/7nziM2TclW RT @colbertlateshow: Our fearless bandleader @JonBatiste has a solo show Thurs 9/14 in Los Angeles. If you're in the area come thru! https:… Look! I'm the official emoji for the #Emmys! Excited to kick it with my new BFFS, chicken face and salsa lady. RT @handinhandfund: Watch #HandInHand live on Twitter! \n❤️ or retweet to show your support for hurricane victims.\nhttps://t.co/FtEEjCADuY For #ReadABookDay, try \"Stephen Colbert's Midnight Confessions.\" It's \"Of Mice and Men\" but with one man &amp; no mice! https://t.co/RaWAH0I5OE Repealing DACA in order to MAGA is a load of CACA. @ArielDumas First music video I saw was Stray Cats \"Stray Cat Strut\" Instantly wanted that RockaBilly look, but stuck to khakis. #FirstVideo https://t.co/YoDIZpnSlo @JonBatiste True. See: A Man for All Seasons. \"When a man takes an oath he holds his self in his own hands like so much water.\" #ButForWales Congratulations, @TheGlennClose, on receiving the Spirit of Katharine Hepburn Award!  “If you obey all the rules, you miss all the fun.\" -KH Want to help folks hit by Hurricane Harvey? 1 way is w/ https://t.co/F2SV5FGvEY Text HARVEY to 90999 to make a $10 donation. #HoustonStrong RT @BarackObama: Thank you to all the first responders and people helping each other out. That's what we do as Americans. Here's one way yo… @StephenAtHome Blesséd be Telebrion and Mother Sun, reborn. Back to the Horn of Dusk, Eternal! We walk the path of Tala-oth! #prehumans May Telebrion spare Mother Sun this day and return to the Horn of Eternal Dusk! Telebrion listen to the gentle voice of Tala-oth! #prehumans Eclipse cookies ready! https://t.co/jXhd82Xezq Ready for the eclipse! https://t.co/KAq1mRj4s1 @JonBatiste Face Piano! .@realDonaldTrump Congrats on removing your first monument to racism! https://t.co/XF4XIQyAO3 RT @JonBatiste: Seek and ye shall find (016. Bach Invention No. 13) #Fastiste https://t.co/XwOzpCTY0P I know Trump's destroying America's moral authority and all, but Ellie Kemper is on my show tonight with PUPPIES!!! RT @colbertlateshow: TONIGHT: Daniel Craig makes an announcement that will leave you shaken, not stirred. #JamesBond #LSSC https://t.co/gaS… Today the President replaced his racist dog whistle with a vuvuzela. \"I don't agree with the Nazis, but they had a permit for Normandy &amp; the Allies didn't.\" -Donald Trump https://t.co/0WeIMfTAZe @psybermonkey @ArielDumas David: *plays secret chord*\n\nThe Lord: Nice.\n\nYou: Meh. @JonBatiste 👊🏻 RT @colbertlateshow: TONIGHT: Anthony #TheMooch @Scaramucci is here and he's revealing who he would front-stab if he was still in the White… @ArielDumas You can take your tear drops, drop 'em in a tea cup... #1 - Bend over backward to not insult white supremacists.  #2 - Backpedal furiously... https://t.co/AUKdYitxd2 Feed mayonnaise to tuna. Call StarKist! https://t.co/GqY3e7aZMC @danguterman \nLittle Big Man! Guys, let's not panic. Maybe \"locked and loaded\" is just how Trump orders his nachos. Working on my #Emmy bod. Wanna look ripped in my sleeveless tux! @CBS on 9/17 @TelevisionAcad https://t.co/wxZcQ6g7EK Get ready for the sequel: \"2 Fiery 2 Furious: Pyongyang Drift!” https://t.co/8yPvDGmTvW I didn't know!!! Say hi next time Steve. Long Time listener (starting  Summer of '86), first time caller. https://t.co/qrMT9Ixjnn Young Hits From 1972-74 https://t.co/cmOSzzsfSx On Monday 8/14 Anthony Scaramucci will be my guest on @colbertlateshow. This is just a heads up for our censors to get ready! #themooch 59% of Americans think Trump's presidency has been a failure. The other 41% still don’t have twitter. North Korea officially has a warhead small enough to fit on a missile. Huh. Being \"tired of winning\" sure feels a lot like \"a stress ulcer.\" RT @colbertlateshow: Tonight: The frightening rhetoric between President Trump and North Korea has Stephen taking cover. #LSSC https://t.co… I kissed the face of the sun! Thanks @seanseaevans https://t.co/50VBsSpt29 RT @colbertlateshow: TONIGHT: Pres. Trump may be on vacation, but he's still tweeting full-time. Vladimir Putin, however, knows what real R… Much more impressive than her slacker brother who took a gap year to go backpacking around Dagobah. https://t.co/vodCWlYf7L @kylejaxson tasty! Trump's going on vacation for 17 days, or 1.7 Scaramuccis. Happy birthday, President Obama! So happy to see that you’re only aging one year at a time now! Everybody is saying this will be the most luxurious, grandest jury in world! Best indictments ever! Believe me! RT @colbertlateshow: TONIGHT: Robert Mueller impanels a grand jury, and Stephen is here 👏  for 👏 it. 👏 https://t.co/mbDgWeGFif ...And the Bill of Rights doesn't count because it wasn't part of the ORIGINAL Constitution! https://t.co/PwJBpTEpVB Who leaked!!!! https://t.co/KWvdgXBaus RT @colbertlateshow: TONIGHT: Senator @alfranken was in the room when Senator John McCain voted 'no' on the #SkinnyRepeal. https://t.co/1ch… https://t.co/r3PUvKAZ7q @jdickerson \neek barba durkle! RT @colbertlateshow: You will be missed, Mooch.\n#TheMooch https://t.co/jPu63ooRD8 Scaramucci, we barely knewcci. Good bye, Reince. May you rest in Priebus. I’d like to say congratulations to new Chief of Staff John Kelly but I’m afraid he’ll be fired before I send the tweet. The Mooch is Loose! https://t.co/bJUDwgVgHr No wonder we never see Bannon any more. Evidently, he's got a full plate...I mean palate. Fixed it for you, @realDonaldTrump. https://t.co/taObp6nR68 If Trump can’t work up the nerve to fire Sessions, why doesn’t he just pretend he’s one of his wives? A Beautiful pas de douche! #TDS https://t.co/9cnI6pwkZY Anyone else want to see Sean Spicer and Anthony Scaramucci in a buddy cop movie called \"Spicy and the Mooch?\" RT @ColumbiaRecords: Don't miss @tylerthecreator performing music off his new album #FlowerBoy on @ColbertLateShow tonight at 11:35PM ET! 🐝… RT @colbertlateshow: Tonight: Russians are familiar with strong-arm politics, but Stephen wants them to see what it's like to get a handsha… The fact is, Sean Spicer had the largest group ever to attend a going away party. Period. Words fail me. And they failed him, too. https://t.co/eSEG3emuLj I hope I get one! Does it come in vegan flavor? https://t.co/qk1VbOAmlw Republican Senators were served a nice lunch at the White House today, but I'm pretty sure all they swallowed was their pride. RT @colbertlateshow: You don't want to miss this! @KeeganMKey brings back \"Luther\" to help us understand how Obama is feeling after six mon… Lars Von Trier’s Robocop remake looks FANTASTIC. https://t.co/A4n5par0BR Convoluted, maybe, but not as bad as needing a two-thirds majority to impeach. https://t.co/SUdBFr6U8y RIP Republican Health Care Bill. In lieu of flowers, please send new representatives to Congress in 2018. @HelloCullen Better w/ a @JoeWalsh lead! #funk49 #lifesbeengood2me #rockymountainway #lifeinthefastlane #walkaway #lifeofillusion #jamesgang RT @colbertlateshow: Late Show's #RussiaWeek rolls on with Stephen's special report from the infamous Presidential Suite at the Ritz-Carlto… RT @colbertlateshow: TONIGHT: Stephen kicks off #RussiaWeek with a hot take on the Cold War. #LSSC https://t.co/7Z4xvruDuh .@DonaldJTrumpJr’s meetings have more guests than a Pitbull track! Donald Trump was excited for a Croque Madame until he found out it was NOT French for “Crooked Hillary” #SandWichHunt https://t.co/jzppjTN9HT @jdickerson E.Costello- Slow Drag w/Josephine: Gavotte, Garrotes, Cotillions &amp; slow Arabesques/ Drumrolls &amp; Farandoles were all made in jest RT @colbertlateshow: Yes, that was the real deal, the one and only KERMIT. THE. FROG. in tonight's cold open! #LSSC https://t.co/bnLl3qDYSQ Loved today's hearing for the replacement FBI director. Can’t wait for the next one a two months from now. Trump leaves for France tonight. Boy, is he going to be disappointed when he learns that \"oui, oui\" isn't what he thinks it is. DARTH VADER: Join me and together we can-\nTRUMP JR:  I love it! Especially later in the summer! Trump tweets somehow sound better this way... https://t.co/nsANmlCBe1 RT @colbertlateshow: .@JoeNBC announced that he's leaving #GOP to become an Independent. @StephenAtHome's full interview with Joe and @morn… RT @colbertlateshow: Tonight: on the heels of today's big news about Donald Trump Jr., Stephen takes a moment to issue an apology to Eric T… I’m guessing Donald Jr. regrets hiring a lawyer from Trump University.\n#LSSC I know these @DonaldJTrumpJr emails look bad, but they also sound bad and are bad! That’s funny, “went nowhere but had to listen” is how I feel whenever your dad talks! https://t.co/ADVNUS1LtT https://t.co/uD1sAVDEzr https://t.co/uD1sAVDEzr RT @pack_heather: @StephenAtHome We are remembering our Swiss immigrant ancestors who made it possible to enjoy #AmericanGreatness https://… RT @Bethy1014: Ice cream &amp; family in North Texas!\n#AmericanGreatness @StephenAtHome https://t.co/8FaYUBPtST RT @LaMiHaWi: @StephenAtHome spending it with these guys in Wind Cave National Park, South Dakota #AmericanGreatness https://t.co/BOfAGkQnbF RT @SusieK_79: @StephenAtHome #AmericanGreatness Snohomish Valley, Washington State and the Cascade Mountains https://t.co/rborQ8PPNI RT @FranSudekum: Current River; Ozark National Scenic Riverways, Missouri @StephenAtHome @NatlParkService \n#AmericanGreatness https://t.co/… RT @ewhansen: A mid-May afternoon at AT&amp;T Park in San Francisco. Happy 4th, @StephenAtHome! #AmericanGreatness ⚾️ https://t.co/a7jXB0RDK5 RT @jimgaynor: @StephenAtHome Top of Rattlesnake Ledge, North Bend, WA. https://t.co/ngPam289hU RT @ewhansen: Quiet glory at Cheatham Grove! (Star Wars' \"Return of the Jedi\" filmed here. Ewoks were sleeping.) @StephenAtHome #AmericanGr… RT @BSCBell: @StephenAtHome #AmericanGreatness is hanging out with Elizabeth Cady Stanton, Susan B. Anthony &amp; Lucretia Mott in the US Capit… RT @BethWatersNeuro: @stephenathome Visiting @newcenturytrust -educating &amp; empowering women since 1882. #AmericanGreatness in the City of B… RT @StandaroundTom: @StephenAtHome .@StephenAtHome Fire in the sky before our fireworks! Hogshooter, OK. #AmericanGreatness https://t.co/Vw… RT @daschmidt883: @StephenAtHome .Sunset at the Jersey Shore,  Belmar,  NJ #AmericanGreatness https://t.co/kXbWOWDUwm RT @dianitahardy: @StephenAtHome Escaping Vegas heat in Los Angeles #americangreatness https://t.co/NfRtqzq9pr RT @SaraCVT: @StephenAtHome #AmericanGreatness 8-year-old dancing under a rain of cherry petals https://t.co/ZlEUIjY0yY RT @EmmaLeePonzio: @StephenAtHome Sampling goodies at Grandpa's Cheesebarn in Ashland, Oh.  #AmericanGreatness https://t.co/LmgLwVaTeO RT @MaestroClaudio: @StephenAtHome Antelope Valley Poppy Reserve near L.A. CA #AmericanGreatness https://t.co/AFhAxK1rUU RT @SaraCVT: @StephenAtHome #AmericanGreatness Twin sisters (yes, really) playing together in our yard https://t.co/mBBPWRWPDV RT @ann_walker: .@StephenAtHome WashingtonCrossing PA, where troops crossed Delaware Christmas 1776 pre-tide-turning victory @ Princeton. #… RT @navy_intel: @StephenAtHome Arches National Park Moab, Utah #AmericanGreatness https://t.co/JjfXd7CZcW RT @EvanTheDeejay: @StephenAtHome Slide Rock State Park in Sedona #AmericanGreatness https://t.co/y7bUixlL8F RT @emd3737: @StephenAtHome Joshua Tree National Park on a hot day in June. #AmericanGreatness https://t.co/kba7TkkU37 RT @linflin963: @StephenAtHome Staying local with a community 5k to benefit ALS research. #AmericanGreatness @run4buffalo @HogwartsRunners… RT @SarahPhelan4: @StephenAtHome In Louisville, Kentucky and watching the sun set on the Ohio River. With bridges https://t.co/wj62lyCO83 RT @BrandonDieleman: @StephenAtHome Picture Lake, Mt Baker, Washington State #AmericanGreatness https://t.co/mkxftY6raf RT @Duke5ilver: A view of the Hoover Dam from a helicopter! @StephenAtHome #AmericanGreatness https://t.co/A7oOnYWxsh RT @mooshiemama: #AmericanGreatness @StephenAtHome Bahai House of Worship, Wilmette, Illinois. Breathtaking. https://t.co/1f4EtNyBMo RT @dirtybowie: @StephenAtHome Reflecting pool at Grand Canyon National Park #AmericanGreatness https://t.co/O7QCKQqpkG RT @StephenHicks23: #AmericanGreatness by @StephenAtHome is fantastic and worth scrolling through. This is Wind Wolves Preserve in Central… RT @voidhugs: @StephenAtHome Point Lobos State Reserve, CA #americangreatness https://t.co/9cBmrOJ75I RT @tylertalley22: @StephenAtHome Bison at sunset, Wichita Mountains Wildlife Refuge #AmericanGreatness https://t.co/9L2PPhyn3i RT @dalrympj: @StephenAtHome Celebrating our most honorable President - George Washington - at his Mount Vernon VA home #AmericanGreatness… RT @RoxanaDaneshjou: @StephenAtHome Coming down the Angel's Landing bridge in @ZionNPS. Original trail built in 1926! #AmericanGreatness ht… RT @jpryals: .@StephenAtHome Celebrating our nation's bounty as God intended: sans pants. Eno River. Durham, NC. #AmericanGreatness https:/… RT @teeravers: @StephenAtHome showing my daughter her first national park is #AmericanGreatness https://t.co/YT1LT9jycd RT @jenjamen: @StephenAtHome Castillo San Felipe del Morro Puerto Rico https://t.co/1eDukQPhWp RT @campbelljewelry: @StephenAtHome First long road trip with the kids and their first time in New Orleans. #AmericanGreatness https://t.co… RT @LeKateDangereux: @StephenAtHome Locally grown peaches in Musella, GA #AmericanGreatness https://t.co/cVYwumk6A8 RT @CathyDice1: Sunset over the Mississippi River at Memphis, July 2015 #AmericanGreatness  @StephenAtHome https://t.co/Bp3Pb0WNST RT @StephenAlbanese: @StephenAtHome The end of Route 66........ #americangreatness https://t.co/8KJqrjiphM RT @jjackson1001: @StephenAtHome\nOnthe deadrise in Lancaster, Va\n#AmericanGreatness https://t.co/je5Qg23Aqb RT @singsolfa: @StephenAtHome Our grandson enjoying the community band concert in Edina MN. #Americangreatness https://t.co/ishl1vObeQ RT @ParthaHowell: @StephenAtHome Having a Sazerac in the Sazerac Bar at the Roosevelt Hotel in NOLA. America's first cocktail! #AmericanGre… RT @djarmstrong9: @StephenAtHome Grand Canyon of the Yellowstone #AmericanGreatness https://t.co/pSooBZ4y7r RT @benjamin_skaggs: @StephenAtHome From the top of Smith Rock in Deschutes County, Oregon. #AmericanGreatness https://t.co/yV6qDVWOUa RT @Jesse_B_Kelsey: My son, Preston, fishing in Frankfort, KY\n\n@StephenAtHome #AmericanGreatness https://t.co/v2InECoMme RT @Cathsch256: Stewardship in the Sheldon National Wildlife Refuge. @StephenAtHome #publiclands #AmericanGreatness https://t.co/yZshk6g7ht RT @garm_77: @StephenAtHome #AmericanGreatness Mount Rainier in Washington State, view from Vashon Island. https://t.co/jR69ZraRiq RT @lauriegbuczek: Marblehead, Ohio lighthouse on gorgeous day @StephenAtHome #AmericanGreatness https://t.co/BQP2WORFIz RT @lucindalaird: @StephenAtHome Angel Oak on Wadmalaw Island, SC #Americangreatness https://t.co/YDcxaHVhCC RT @KatLambert2: Baking bread in the heartland with @okclamberts 1908 Italian immigrant G-Ma's recipe. @StephenAtHome #AmericanGreatness ht… RT @samantha_macke_: The view from Mount Cheaha, the highest point in Alabama #AmericanGreatness @StephenAtHome https://t.co/EUOxbBAmJ2 RT @korijane: @StephenAtHome summer road trip with the kids. #americangreatness https://t.co/UAHQkrUHOW RT @Morgan_MH: .@StephenAtHome Hanging out on the farm in Wintersville, OH #AmericanGreatness https://t.co/vrg5bygLBf RT @StephenBurgin: @StephenAtHome. At the top of Angel's Landing. #ZionNP #AmericanGreatness https://t.co/DSbZZbdsOd RT @sweetjuliblu621: Blue skies and puffy clouds over corn in IL. #AmericanGreatness @StephenAtHome https://t.co/BTlY3O3SJt RT @lucindalaird: @StephenAtHome MLK, Jr memorial in Washington, DC. #Americangreatness https://t.co/KRKWdxbE7g RT @mjtarjamo: @StephenAtHome #AmericanGreatness Cedarville State Forest, Brandywine, MD https://t.co/elxu9EPoBs RT @NatalieKay85: @StephenAtHome #AmericanGreatness Riding longhorns in East Texas! https://t.co/98zzRMp2pv RT @Megletmeow: @StephenAtHome Sonoran Desert in Scottsdale AZ. #AmericanGreatness https://t.co/BnBdeYmNzJ RT @Jeff__Russell: @StephenAtHome Underneath America is pretty great too.\n#LewisandClarkCaverns #AmericanGreatness https://t.co/UqR6bGtxQA RT @NoraTocci: Middle of the rio grande. Albuquerque NM. @StephenAtHome https://t.co/Y6E5TAufDm RT @RockyMntnMike: @StephenAtHome Taking pictures at Grand Staircase Escalante National Monument, Arizona. #AmericanGreatness https://t.co/… RT @mjmuch: @StephenAtHome High School Baseball in Lynn, Massachusetts https://t.co/oRxlehhwG1 RT @ShariSeattle: @StephenAtHome Jim Henson exhibit at MoPop in Seattle! #AmericanGreatness https://t.co/gQrHu9GQJB RT @KABrummett: @StephenAtHome Soaked up the magic at Glacier National Park this week. #AmericanGreatness https://t.co/IZaCfqGFoQ RT @therealseant: @StephenAtHome Burgers and ice cold beer on the Coney Island Boardwalk - Brooklyn, NY. #AmericanGreatness https://t.co/0n… RT @Jetsetter_Jeff: @StephenAtHome The otherworldly Kalalau Valley on Kaua'i, HI. #AmericanGreatness https://t.co/He28k7se8t RT @erinmacentee: @StephenAtHome Hanging Rock State Park\nWalnut Cove, NC\n#AmericanGreatness https://t.co/LqZWgn2RAB RT @SolidJakeGG: . @StephenAtHome Storm rolling in over Hudson Valley, NY. #AmericanGreatness https://t.co/iUo4FFYzfT RT @Bushwood_C_C: Exploring the fantastic zoo in Toledo, OH. \n@StephenAtHome #AmericanGreatness https://t.co/XGfpmMLFqi RT @BlancoSarahit: I call this island,home. I'm immigrant from Venezuela and I love NYC. @StephenAtHome https://t.co/cA24sgn6OJ RT @washingtccn: @StephenAtHome this view of buffalo, new york #AmericanGreatness https://t.co/w7zINUMUfB RT @spokenjeremy1: @StephenAtHome along the Rogue River, southern Oregon https://t.co/rqBb6j3YCu RT @5NEWSTyler: @StephenAtHome A chicken and waffle cone is as #americangreatness as it gets https://t.co/eswNWe9iz6 RT @HeyMikeDavis: @StephenAtHome Blue skies over Texas and family time. #AmericanGreatness https://t.co/61eZewCzGt RT @squidyx1: @StephenAtHome #AmericanGreatness dinner just pulled up to the dock in Marblehead MA https://t.co/GeGGpekjSV RT @MackWiersgalla1: Chippewa River in Eau Claire, Wisconsin #AmericanGreatness @StephenAtHome https://t.co/XmT4PqfX0G RT @Jean_Marbella: @StephenAtHome Jackson WY #AmericanGreatness #YeeHaw https://t.co/NKoc4lgHlB RT @LynnInTheHouse1: Garden of the Gods, public park and national natural landmark in Colorado Springs, CO, USA\n\n@StephenAtHome #AmericanGr… RT @David_M_Arnold: @StephenAtHome North Platte, NE - Lake Maloney #AmericanGreatness https://t.co/qtjxa3kZse RT @audreyjb: @StephenAtHome taken while exploring Shenandoah and hiking part of the Appalachian trail #AmericanGreatness https://t.co/vCmZ… RT @DanVacek: @StephenAtHome Paul Revere Mall and Old North Church - Boston, MA #AmericanGreatness https://t.co/TBuV2W1n4T RT @doubleparpickup: @StephenAtHome Savannah River in Savannah, GA #americangreatness https://t.co/QYFhzUi3Wn RT @ShannanB: @StephenAtHome Hiking Kentucky's Red River Gorge #americangreatness https://t.co/SF4nGKHbsp RT @sexposparenting: @StephenAtHome Welcome sign at the public library in Wheeling, IL #AmericanGreatness https://t.co/Se1P6DuPqP RT @N_A_G_D: @StephenAtHome Rio Grande river, Santa Elane Canyon, Big Bend National park. #americangreatness https://t.co/8so6vY7vKy RT @steveprocko: Clearing Summer Storm, Blue Ridge, GA @StephenAtHome  #AmericanGreatness https://t.co/6fQlSmeT39 RT @jenclark95624: @StephenAtHome #AmericanGreatness\nSunset over the Sandia Mountains from beautiful Tijeras, NM https://t.co/sb5BcAmIGN RT @jeffkrinks: @StephenAtHome Dodging storms in Franklin, TN #AmericanGreatness https://t.co/2Vuu4UYzV1 RT @JohnPadon: @StephenAtHome Dont forget the 49th state in the middle of the ocean \n#Happy4thofJuly https://t.co/QDiiTJ1lGF RT @Brendan_Frost: @StephenAtHome Point Reyes National Seashore! https://t.co/dXSnJam3BR RT @bigmama1022: @stephenathome Cade's Cove, Great Smoky Mountains National Park. #AmericanGreatness https://t.co/z5VSamkcoS RT @BobbyDEllis: @StephenAtHome a wonderful little waterfall in my Kentucky home. #AmericanGreatness https://t.co/CM2O660yyF RT @judeschramm: @StephenAtHome on a tour of our great Capital. #AmericanGreatness https://t.co/ew3xT0jJ5r RT @ChrisVance1980: @StephenAtHome A herd of bison at Shelby Farms Park in Memphis TN #AmericanGreatness https://t.co/L4b9R2qIny RT @Zmanda13: My grandfather taking my son for a walk @StephenAtHome #AmericanGreatness  North Georgia https://t.co/oG5YjloG07 RT @FoxOverLazyDog: View from Chimney Rock, NC. @StephenAtHome #AmericanGreatness https://t.co/04r6nMXsiT RT @galapula: @StephenAtHome My wife and our oldest. #AmericanGreatness https://t.co/0fuQKX39O4 RT @DerrickMangrum: @StephenAtHome summit at Mount Baker-Snoqualmie National Forest, Washington state. https://t.co/WIclQj8j6g RT @KenPlume: @StephenAtHome Sticky Fingers in Charleston, SC… #AmericanGreatness https://t.co/JpDeMvu2fU RT @Nev827: @StephenAtHome Taking in a baseball game #AmericanGreatness https://t.co/MBYQ7izs4m RT @MarkC_RVA: @StephenAtHome Downtown Manhattan from Liberty Ferry #AmericanGreatness https://t.co/WBPZx7HW7M RT @Jesse_B_Kelsey: At Gene Leahy Mall in Omaha, Nebraska.\n\n@StephenAtHome #AmericanGreatness https://t.co/L2C70B2Ruw RT @DanaRohrbough: @StephenAtHome I'm at home but here are photos from the awesome First State &amp; home of @JoeBiden: sunset in Wilmington #A… RT @mavhockeyfan: Visiting National Military Cemetery this weekend. Immigrants have always defended this nation. @StephenAtHome\n#AmericanGr… RT @craig_merriman: Thank You @StephenAtHome for RT. \nEncore  •   Hoh River Rain Forest.   Olympic National Forest, WA \n#AmericanGreatness… RT @keloland: @stephenathome KELOLAND (The CBS viewing area in South Dakota, SW Minnesota &amp; NW Iowa) #AmericanGreatness https://t.co/1H9xov… RT @Jesse_B_Kelsey: Playing badminton in Georgetown, KY. @StephenAtHome #AmericanGreatness https://t.co/mXY3bDyeWX RT @_jgibbster: Space shuttle Atlantis at Kennedy Space Center. #AmericanGreatness @StephenAtHome https://t.co/8evblnPAvc RT @skataben: @StephenAtHome Space and Rocket Center in Huntsville, AL #SpaceCamp #AmericanGreatness https://t.co/NY5RbFOpse RT @brad_bolyard: @StephenAtHome #AmericanGreatness @Jenervin9  My living room, my baseball team, and a beer. https://t.co/67djs9GdLU RT @MsARM: @StephenAtHome Eastern Sierras, somewhere between Bishop and Mammoth, CA. #AmericanGreatness https://t.co/lYOHrkoEfI RT @pnote2000: @StephenAtHome Silver Lake, Medicine Bow National Forest, Wyoming https://t.co/F3nr8GcmmV RT @blambson: @StephenAtHome Kickin' it on Old Route 66 I in Holbrook, AZ. #AmericanGreatness https://t.co/IEDYqBgoop RT @ally_115: @StephenAtHome My favorite part of Northwestern: Deering Library. (I'm applying this fall... fingers crossed I get in😅) #Amer… RT @JimNeedsCoffee: @StephenAtHome the real Chicago baseball team #whitesox https://t.co/HGdg8mqvP0 RT @rhowiles: @StephenAtHome  Mount Lemmon in The Coronado National Forest in Arizona.  #AmericanGreatness https://t.co/ltdL2P9gBI RT @mattshevin: @StephenAtHome #AmericanGreatness Baseball and puppy love. Manhattan Beach, California. https://t.co/ovfcuY9uer RT @rjhalltech: The amazing Meteor Crater in Arizona. @StephenAtHome #AmericanGreatness https://t.co/VipS6mvFWv RT @ckingsc: @StephenAtHome Plymouth Rock, where #americangreatness began, while holding a Gamecock hat. https://t.co/yzsHT9BiB1 RT @PeteDaGuru: @StephenAtHome Walking around my neighborhood in Cary NC #AmericanGreatness https://t.co/0Jqh9VdRxn RT @BilboinMT: @StephenAtHome South Platte River in Deckers, CO  #AmericanGreatness https://t.co/Ks8Ts0maEE RT @discopooh2: @StephenAtHome The Wrigley Building looking patriotic. #AmericanGreatness https://t.co/2rqu7QymvV RT @frazmatazz: @StephenAtHome Union Station in Kansas City https://t.co/Lskf4LSK3X RT @jerdogxda: .@StephenAtHome view from Mt. Elbert, Leadville, Colorado - highest peak in the Rocky Mountains #AmericanGreatness https://t… RT @ProfWehrman: Riding a 100 year-old carousel at the Henry Ford Museum in Dearborn, MI #AmericanGreatness @StephenAtHome https://t.co/VSG… RT @susanhappel: Peace, love &amp; South Dakota apple trees. #AmericanGreatness @StephenAtHome https://t.co/K0B0VqIuIa RT @eangelina64: @StephenAtHome Gulf Islands National Seashore, Pensacola Beach Fl #AmericanGreatness https://t.co/ho18ddr6Fn RT @Rkmagness: @StephenAtHome #AmericanGreatness Artist Point, Yellowstone 6/13/2017 https://t.co/9RlYJswda9 RT @Demwomenvote: Spectacular beauty of Sitka, Alaska. Majestic wonder. #AmericanGreatness @StephenAtHome https://t.co/8ARsBaTDtU RT @johnmikulicz: @StephenAtHome Open skies over the National Bison Range #AmericanGreatness https://t.co/q20aDe4ctP RT @katti1215: @StephenAtHome #AmericanGreatness Bug Light South Portland Maine https://t.co/cxoXJXfJtC RT @LisaMarieGross1: @StephenAtHome York, PA 1st Capital of U.S. #AmericanGreatness https://t.co/XROUiPA4ys RT @BaldBenofReno: @StephenAtHome National Law Enforcement Memorial in Washington DC #AmericanGreatness https://t.co/bHqRD0lt95 RT @jworkmanjesness: @StephenAtHome #AmericanGreatness The Headwaters of the Mississippi River, Itasca State Park, Minnesota https://t.co/M… RT @OMurphdog: @StephenAtHome Paying homage to A. Ham &amp; Lady Liberty. #AmericanGreatness https://t.co/x3QCl9r63r RT @Kirstizoe: Aura, MI the homestead of my G-Grandparents who came to this country in late 1800s from Finland #AmericanGreatness https://t… RT @stephwillerton: @StephenAtHome Antelope Canyon, AZ #AmericanGreatness https://t.co/7IWa9VU894 RT @trevorsaurus34: @StephenAtHome Downtown Detroit, MI. Really cool architecture.\n#AmericanGreatness https://t.co/VSBUh4G1tk RT @mildmoxie: @StephenAtHome Zion National Park, Utah \n#AmericanGreatness https://t.co/9C4LeOVbUH RT @LordForceOne: Adirondacks #AmericanGreatness https://t.co/A4rdiJ4mnA RT @rhettbutler87: @StephenAtHome With family at Katmai National Park and Preserve, AK. This is what makes #AmericanGreatness #ProtectOurPa… RT @rgonz18: @StephenAtHome Watching my son take in an air show in our hometown #AmericanGreatness https://t.co/qNivJgE2Gj RT @cassidyrbecker: @StephenAtHome Hiking the hoodoos in Bryce National park, then took a dip in Navajo Lake in Dixie National Forest. #Ame… RT @maryosanford: @StephenAtHome Not traveling now but my fave: two summers ago, Frank Lloyd Wright's Fallingwater in Mill Run, PA #America… RT @LowePianoStudio: The USS Midway. #AmericanGreatness https://t.co/urFa1iSFOY RT @elektrotal: @StephenAtHome joining a Hindu worship in the Rockies, celebrating our #AmericanGreatness and freedom of religion https://t… RT @kansasgrant: #AmericanGreatness John Hancock Center, Chicago, 2016 https://t.co/RnkbF25nxX RT @craigopolis: @StephenAtHome Symphony on the Prairie Star Spangled Show. Indy, IN. #AmericanGreatness https://t.co/1hAOBjRa2l RT @media1der: Sunset over Lake Michigan, one of the world's largest sources of clean, fresh water. #AmericanGreatness https://t.co/slSg31d… RT @Rocknsoul1319: @StephenAtHome So moved by everyone's photos to @StephenAtHome showing #AmericanGreatness! \n\nMemphis sunset from our fro… RT @Midmotion: .@StephenAtHome Mesabi Miner (306m, 1000+ ft) exiting the inland-most port in the world; Duluth, MN. #AmericanGreatness http… RT @laurad1256: Biking on the St. Marks Trail in Tallahassee, FL. Apalachicola Nat'l Forest #AmericanGreatness @StephenAtHome https://t.co/… RT @MsVila: @StephenAtHome The White Mountains in New Hampshire - gorgeous! #AmericanGreatness https://t.co/rPSFe4ZgQs RT @CarolMcCallion: @StephenAtHome Punchbowl Memorial Honolulu Hawaii #americangreatness https://t.co/66bFiHgtIY RT @AloysiusSnell: @StephenAtHome  #AmericanGreatness Emerald Isle, NC https://t.co/ZxWN9pk12Q RT @WaldrepDenise: #AmericanGreatness Clemson Tiger topiary in Greenwood, SC for Festival of Flowers! https://t.co/ZHMrlI1iyK RT @mattiestillwell: @StephenAtHome  💫Escalante in Utah #AmericanGreatness https://t.co/LpHL9ci8bk RT @kidquasar: @StephenAtHome mesa arch, Canyonlands NP, UT. #americangreatness https://t.co/QeEIfp0osj RT @dmward44: @StephenAtHome Boone, NC--Both freedom and fireworks can get a little noisy. #AmericanGreatness https://t.co/l0fRHYlPPX RT @B_MarkWall: @StephenAtHome Looking Glass Falls, North Carolina. #AmericanGreatness https://t.co/9fSfVfT8qP RT @momsterTra: @StephenAtHome Kids getting one last swim in after sunset in Lake Altus, Oklahoma  #AmericanGreatness https://t.co/iIewOQfM… RT @KyleTackett1: Top of a mountain in Southeast Kentucky and a Jeep. @StephenAtHome #AmericanGreatness https://t.co/4T2i2D7t9B RT @Praseos: @StephenAtHome Enjoying Lake Michigan and the Sleeping Bear Dunes #AmericanGreatness https://t.co/2QdB58xfHr RT @bluffcityjk: @StephenAtHome Sunset on Chesapeake Bay. #AmericanGreatness https://t.co/T2wb6mJWgB RT @DrKaz: Cape Cod National Seashore in Wellfleet, MA @StephenAtHome #AmericanGreatness https://t.co/jKXUCOpdKO RT @destinyskind: @StephenAtHome Hellooooooo from Westchester County! #AmericanGreatness https://t.co/v2M6oqcZbQ RT @JohnnieFishpimp: @StephenAtHome. Mt St Helens Natl Volcanic Monument, Washington State #AmericanGreatness https://t.co/lWXpzb3zG5 RT @altbars: Mt. Rainier National Park @StephenAtHome #AmericanGreatness https://t.co/1Ew6SPlwJe RT @vinceguerrieri: @StephenAtHome Hocking Hills State Park in #Ohio. #americangreatness https://t.co/hc42R0FEq6 RT @wvcchc: @StephenAtHome #americangreatness Hawk's Nest WV. New River Gorge National River https://t.co/YyQzIfouqK RT @AloysiusSnell: @StephenAtHome #AmericanGreatness   Getting therapy advice from Bob Newhart in Chicago https://t.co/UwDXi5Exw9 RT @MJ8403: @StephenAtHome #AmericanGreatness Badlands National Park, South Dakota https://t.co/V6l99xkfA1 RT @CesarB33: @StephenAtHome Corona Del Mar in Southern California. #americangreatness https://t.co/UoyZscNA0L RT @BaldBenofReno: The Supreme Court of the United States. @StephenAtHome #AmericanGreatness https://t.co/R06kKZjFLZ RT @kansasgrant: @StephenAtHome Ferris Wheel, Chicago, 2016\n #AmericanGreatness https://t.co/J8JN0bqm2y RT @Cyadd: @StephenAtHome Dequindre cut in Detroit, MI #AmericanGreatness https://t.co/WsRkghWXz8 RT @maggiesavarino: Snoqualmie Falls, WA State @StephenAtHome #AmericanGreatness https://t.co/ffY8ECijge RT @ajsigler222: @StephenAtHome 3 years ago, Rocky Mountain National Park, Colorado. #AmericanGreatness https://t.co/zrvoWFJQqd RT @masmith93: @StephenAtHome from the deck of the @SSBadgerFerry sailing across Lake Michigan to Wisconsin #AmericanGreatness https://t.co… RT @veredaverde: @kiddchronic @StephenAtHome Speaking of #AmericanGreatness: Claudia “Lady Bird” Johnson, herself, for whom the lake is jus… RT @thetippets: @StephenAtHome exploring 🌏 's ancient past @NHMU #AmericanGreatness https://t.co/UKLRg6B6wX RT @Amaseee: #AmericanGreatness\nWhite Mountains, New Hampshire https://t.co/1hDniaoFWA RT @KatherineME83: @StephenAtHome My son taking in the view in Bodega Bay, CA. #AmericanGreatness https://t.co/q81uA274Hs RT @mollysmcdonough: @StephenAtHome Sunset in The Adirondacks #AmericanGreatness https://t.co/L9TZE7957i RT @cassandrasid: @StephenAtHome The Oval at THE Ohio State University #AmericanGreatness https://t.co/ec8rhXYd8r RT @KentuckySpirits: River rocks, Smoky Mountains, @GatlinburgTN . @StephenatHome #AmericanGreatness https://t.co/NNpY9KwtQQ RT @adamalmeter: @StephenAtHome Cutting my Lawn in Jackson, Mississippi! #AmericanGreatness https://t.co/jUK4v1wh8i RT @mikewhitfield74: @StephenAtHome Curecanti National Recreation Area  #AmericanGreatness https://t.co/IBPoJsbYyD RT @fuchsiasushi: @StephenAtHome Rainbow after a downpour in Orem, Utah #AmericanGreatness #hopeandpatriotism https://t.co/kRUSH9Ftsn RT @havingfunwrong: Long Lake in Bishops Pass, CA @StephenAtHome #AmericanGreatness https://t.co/B6SVHL8cIp RT @lskelly65: #AmericanGreatness      Hiking Colorado National  Monument.   Grand Junction Colorado https://t.co/3xiEsZASyj RT @mlanger: Confluence of the San Juan and Colorado Rivers, Navajo Reservation, southern Utah. #AmericanGreatness @StephenAtHome https://t… RT @_Damian11: @StephenAtHome Kayaking in beautiful Mirror's lake, Wisconsin #AmericanGreatness https://t.co/GecGboPCzz RT @veolasdatter: @StephenAtHome Just a 2-block walk from home in the middle of a Minneapolis suburb #AmericanGreatness https://t.co/AEMBHJ… RT @David77810155: @StephenAtHome #AmericanGreatness Thousand Islands NY Moonrise https://t.co/rpzljGBzVx RT @RetroBetty13: @StephenAtHome Roadtripping in Utah, first road trip for my boys #AmericanGreatness https://t.co/cmnBQcWITd RT @kiptew: Shady break,  monon trail,  Indianapolis #AmericanGreatness @StephenAtHome https://t.co/SJtusQD7sV RT @amonteith92: @StephenAtHome Future birthplace of Captain James T. Kirk in Riverside, Iowa. #AmericanGreatness @WilliamShatner https://t… RT @johnburnsnc: Morning on Big Yellow Mountain, North Carolina. @StephenatHome #AmericanGreatness https://t.co/i0EPMeV1uP RT @ChipLSU02: @StephenAtHome Jordan Pond in Acadia National Park. #AmericanGreatness #Maine https://t.co/gStyRION8g RT @johnburnsnc: Pointe du Hoc, Normandy, France. @StephenAtHome #AmericanGreatness https://t.co/I1JNeAOsrE RT @jamesdecker2006: @stephenathome Texas Cowboy Reunion, 87 years strong in #StamfordTexas. #AmericanGreatness https://t.co/gFMcjuMyHd RT @Gr8ful2BeNCA: @StephenAtHome #americangreatness It's been great all along!\nLake Tahoe, California https://t.co/BJJZHiDcwl RT @toothi: @StephenAtHome #AmericanGreatness Local teens learning about and taking a ride in a traditional tule reed canoe in San Diego Ba… RT @megwiemer: @StephenAtHome Caineville, Utah (on the east side of Capitol Reef National Park) #AmericanGreatness https://t.co/2Rj2gzEHmE RT @baron_v_v: @StephenAtHome The wreck of the Peter Iredale, Oregon Coast #AmericanGreatness https://t.co/9cgcgOiOrG RT @rhaindfield: @StephenAtHome Banning State Park, one of the many natural beauties in Minnesota! https://t.co/mKPRmDAUkW I do miss it! https://t.co/1ZigAaCDIu RT @smeggingnuts: @StephenAtHome Wallace Fall NP just hiked up her with my family today #AmericanGreatness https://t.co/TedUEYQwx4 RT @MOLMPHOTOGRAPHY: Grand Teton National Park, Wyoming. @StephenAtHome #AmericanGreatness https://t.co/4wwPGE2LrT RT @POTUS_Thomas: @StephenAtHome the small town of Grinnell, Iowa. https://t.co/6tSsWvFgQa RT @MarieKMiller: @StephenAtHome Minor League Baseball @Intimidators Kannapolis NC #AmericanGreatness https://t.co/pbUS7UL3Z4 RT @JHouck_11: @StephenAtHome                 Raystown branch of the Juniata River: Hopewell, PA. #AmericanGreatness https://t.co/9FIblkqHWE RT @johnburnsnc: Bass fishing on a late summer evening. @StephenAtHome #AmericanGreatness https://t.co/S6Xn8b5GjZ RT @ribkah: Crystal Bridges Museum of American Art, Bentonville, AR @StephenAtHome #AmericanGreatness @crystalbridges #CBChihuly https://t.… RT @SKCWiz: .@StephenAtHome #AmericanGreatness four state lookout, White Cloud, KS https://t.co/jLcYGVKD3I RT @Andrew_Sylves: @StephenAtHome Sawtooth Mountains, Bob-Marshall Wilderness, Montana.\n#AmericanGreatness https://t.co/Uu9swg8bSI RT @_abbcat: Crag Crest, Grand Mesa National Forest #AmericanGreatness @StephenAtHome 2 mi on a 1-2ft wide crest https://t.co/3ikHVEqeeX RT @OswaltSherry: @StephenAtHome This is as great as it gets. In Reading, MI, Round Lake #AmericanGreatness https://t.co/qqF5j479Rs RT @LJ_Tynan: @StephenAtHome I'm inside watching baseball, but my parents kayaked in Fountainhead Regional Park in Northern Virginia ❤️ htt… RT @joycegarcia: @StephenAtHome Staying put at home outside Chicago, but longing to be back at Great Pond, outside Rome, ME, where we were… RT @kaiyaknox: .@StephenAtHome Sunset in Clinton Township, Michigan. #AmericanGreatness ☀️ https://t.co/8anZHf40lE RT @RealNoahGroth: @StephenAtHome #AmericanGreatness Holland State Park on Lake Michigan https://t.co/Bn8uFhbqrU RT @athleticone01: @StephenAtHome Mt. Baker Snoqualmie National Forest, WA. #AmericanGreatness https://t.co/zNxOPaWMyk RT @Terminatrix06: @StephenAtHome At a brewery in Goochland, VA. #AmericanGreatness https://t.co/N1VyaYoIXb RT @johnnyfire817: @StephenAtHome Edgewater Park in Cleveland, OH #AmericanGreatness https://t.co/fORes7gnjM RT @sportsdr44: Managers and umpires meeting before a town team baseball game in Jackson, Minnesota.\n@StephenAtHome \n#AmericanGreatness htt… RT @DanMohrmann: Colorado Springs from the top of the Manitou Incline. #AmericanGreatness @StephenAtHome https://t.co/xX6P0Gldtd RT @Hebron_Nurse: @StephenAtHome Dad &amp; Daughter Harley ride along the Florida Gulf Coast.  #AmericanGreatness https://t.co/ZWKDszVRrt RT @johnburnsnc: The view from the top of the Rock on a rainy afternoon with my son. @StephenAtHome #AmericanGreatness https://t.co/p3RHpon… RT @DebbieKuykenda3: @StephenAtHome working in my garden in High Point, N.C. https://t.co/qQwcu8dIBt RT @KrizpyKrame: @StephenAtHome Glass Beach, Redwood Forest, Golden Gate Bridge along the Pacific Coast Hwy. #AmericanGreatness https://t.c… RT @KristieSchmidt: @StephenAtHome Mom's garden, Pontoosuc Lake, The Berkshires   #AmericanGreatness https://t.co/MI5TLQ3txI Don't forget to brake! https://t.co/geRi8wSGQo RT @nick_porcaro: @StephenAtHome here's my band rocking out at Riverview-Fisk Park in Jersey City under the shadow of the NYC skyline! #Ame… RT @DavidDark: @StephenAtHome This strange figure resides above pilgrims at Dollywood. #AmericanGreatness https://t.co/AYuvm2CGJS RT @mchrouser: @StephenAtHome Take me out to the ballgame! https://t.co/wTkPp401Km The Irish certainly helped with the greatness! https://t.co/Tpqtd0yrlG RT @ukuleleplay: @StephenAtHome beautiful cypress trees in gator refuge in NC #AmericanGreatness https://t.co/oJlovButn9 RT @mgjohnson23: @StephenAtHome This hills of West (By God) Virginia #AmericanGreatness https://t.co/3rYTFvZIpK Look for Andrew Edward Tuck. You'll find the name twice. My mom's father and brother. https://t.co/CyTkROzYBO RT @McconvilleB: @StephenAtHome #AmericanGreatness \nSunset in the pine trees. Wilmington NC. https://t.co/0Fl9MzoKB4 RT @thefunruiner: @StephenAtHome Flint Hills in Chase County, KS #AmericanGreatness https://t.co/J4mq4MzNtz RT @GamerGeek227: @StephenAtHome the Ohio River taken at River Front Park in Huntington, WV https://t.co/MquhWQB1ZX RT @DoctorB99: @StephenAtHome #AmericanGreatness \nGraduation at Jacksonville University 2017 https://t.co/h2LA5ALoKp RT @CelinaGore: @StephenAtHome AT&amp;T Park, home of the San Francisco Giants, on a sunny day. #AmericanGreatness https://t.co/FxbXI5eJjc RT @tonyshangrila: @StephenAtHome Near the waterfall in Upper Michigan where I proposed to my wife. #AmericanGreatness https://t.co/oEstHYg… RT @jazar47: @StephenAtHome #AmericanGreatness Flying through the Sawtooth Mountains in Idaho. https://t.co/tSlSp5j5In RT @I_am_elizabeth: @StephenAtHome sunset and blue crabs on Maryland eastern shore #AmericanGreatness https://t.co/pBDg4I2jp6 RT @DreadGazeebo: Open Road, just outside Sterling Colorado. #AmericanGreatness @StephenAtHome https://t.co/GHDRs5OnqS RT @justinee_hope: @StephenAtHome White Sands National Park in New Mexico! Some #AmericanGreatness right here https://t.co/OUIuZn47NH RT @drawntheroad: San Juan Island, WA, at the height of wildflower season. #AmericanGreatness  @StephenAtHome https://t.co/EGW31njgSw RT @DocNickie: Our visit to @Opus40Tad definitely counts as #AmericanGreatness. @StephenAtHome https://t.co/NJ033uO3cP RT @IncitingARiot: .@StephenAtHome #AmericanGreatness - my new backyard in Monee, IL https://t.co/mmjjBVWfCg RT @JonRGoldman: @StephenAtHome holiday weekend at the old farm house in New England. #AmericanGreatness https://t.co/QAjHT9bGL4 RT @AndyMcCanse: @StephenAtHome Kids on Backyard Sprinklers, Sevierville, TN #AmericanGreatness https://t.co/UzyXqR9yo8 RT @odielish: @StephenAtHome Lazy dog lazing on the Russian River, Northern California. 🐶 https://t.co/N7qWvXBzMl RT @DrJimVerhoye: @StephenAtHome the view from the Cabrillo National Monument of downtown San Diego and the San Diego Bay https://t.co/UWPY… RT @ElleTraduit: @StephenAtHome First time visiting the great American city of Detroit. #AmericanGreatness https://t.co/ujTxwSK8ST RT @amypen: @StephenAtHome Isle of Palms in the best city in the land, Charleston, SC https://t.co/2tjUN3hZdE RT @KikiRockChalk: @StephenAtHome a Kansan enjoying the beautiful Rockaway Park NY beach :) #AmericanGreatness https://t.co/me6iMbFFwF RT @KremlingForce: @StephenAtHome This spice importer in Crown Heights, Brooklyn which makes my morning walk to the train smell 80% zestier… RT @rodgjam8: @StephenAtHome north shore, Kauai, Hawaii https://t.co/swqR8MUBNB RT @ElisaRNelson: A display in the US Air Force Museum in Dayton, OH #AmericanGreatness @StephenAtHome https://t.co/mr8JGdwNj2 RT @BetseyRockstar: @StephenAtHome Exploring old farm equipment and older out buildings on our aunt and uncle's farm outside of a tiny town… RT @Krubuntu: @StephenAtHome Paul Bunyan statue in Kenton district Portland, Oregon #AmericanGreatness https://t.co/4lDzPgq5FW RT @AdrianRavenwood: Lobster boat in Robbinston Maine! @StephenAtHome #AmericanGreatness https://t.co/7DgU1jcaCB RT @makanimesa: @StephenAtHome Muhammad Ali's gravesite Louisville, KY #AmericanGreatness https://t.co/BLkoCDUyEF RT @dlpsam: @StephenAtHome Escaping fireworks in StL MO #AmericanGreatness https://t.co/zpBE0629kT RT @GuerillaMemoir: Sunset over Passe-a-Grille Beach in St Petersburg Florida. Steps from a grouper sandwich. #AmericanGreatness @StephenAt… RT @jteichel: @StephenAtHome Frog towel and a belly laugh. Palmer Lake, SW Michigan #AmericanGreatness https://t.co/Lpbq6p5LsV RT @toothi: @StephenAtHome #AmericanGreatness @LaneUnitedFC  playing @HighlandersFC in Springfield, OR. (Photo credit NW Sports Pics.). htt… RT @TriskelQuest: @StephenAtHome My Mom and I searching out historical markers in our state that we haven't seen or read before. #AmericanG… RT @calvey4r: For you @StephenAtHome - lunchtime at Naples #AmericanGreatness https://t.co/HOKZhWmfDl RT @acceptablepanda: @StephenAtHome I am not traveling, but my mom is. She took this outside Goblin Valley State Park in Utah Canyon #Ameri… RT @missynurmi: @StephenAtHome Our cabin, Cooper Landing AK.\n#AmericanGreatness https://t.co/C9QojkO5WJ RT @TheDogGuyJim: @StephenAtHome Great for a long time. Don't screw up now. #AmericanGreatness https://t.co/3sTKiYY4Cn RT @jordanel: @StephenAtHome Red Willow Resort, North Dakota #AmericanGreatness (photo credit to @JoshKomer @gfherald) https://t.co/1jcSUdJ… RT @cmflyer: @StephenAtHome #AmericanGreatness \nBikepacking the John Wayne Pioneer Trail, Washington. https://t.co/jDsi2icvvi RT @Theresa83945063: @StephenAtHome Shem Creek, Mt. Pleasant, SC https://t.co/m9354k9cy3 RT @docmilanfar: @StephenAtHome #AmericanGreatness Mono lake, eastern Sierra California https://t.co/XRVEYYhTUm RT @nathanzaugg: @StephenAtHome Just a simple trail in Bartlesville, OK with some great words of wisdom. #AmericanGreatness https://t.co/AD… RT @Msdee3slp: @StephenAtHome Flower Fields outside Silverton Oregon #AmericanGreatness https://t.co/rQtIhiY5gK RT @SandyM77: @StephenAtHome  Pittsfield Massachusetts in the Berkshires https://t.co/klhH3uhUoe RT @jeff_clouser: @StephenAtHome Lake James at Pokagon State Park, northeastern Indiana. #AmericanGreatness https://t.co/SuPXw1cYF9 RT @MillennialXpert: @StephenAtHome I'm staying right here in San Francisco!  #solucky\n#AmericanGreatness https://t.co/HCloWgFamR RT @themarygilbert: @StephenAtHome Sunset over Cedar Point in Sandusky, OH. #AmericanGreatness https://t.co/9M9Ix5i4xL RT @da_crock: @StephenAtHome Yosemite National Park, preserved by the work of President Lincoln, John Muir, &amp; more dedicated Americans #Ame… RT @madlibbs15: @StephenAtHome Some words of wisdom from our 16th president in Springfield, IL #AmericanGreatness #Lincoln https://t.co/5iE… RT @suzetrup: Leap HS 100% immigrant from 15 different countries #neighbors \n#AmericanGreatness @StephenAtHome https://t.co/vrun8lgxHC RT @adrnwntr: @StephenAtHome Brooklyn Cyclones baseball on the Coney Island Boardwalk #AmericanGreatness https://t.co/gkyf9bb1Rx RT @ddelgado64: @StephenAtHome . Just spent a week in the Smoky Mountains National Park, it's gorgeous.  #AmericanGreatness https://t.co/Af… RT @libertyshipp: @StephenAtHome My backyard. Small town living. Richfield, Utah #AmericanGreatness https://t.co/NYM4UjO83X RT @PattyHarbison: @StephenAtHome #AmericanGreatness \nRoark's Cove, Sewanee TN https://t.co/snkcjYQEXi RT @WendEclair: Rocky Mountain national park!! #AmericanGreatness @StephenAtHome https://t.co/emPgUhv0iM RT @ppavelski: @StephenAtHome Madison Wisconsin from the Frank Lloyd Wright designed Monona Terrace. #AmericanGreatness https://t.co/AL8P7k… RT @phil_herbert: @StephenAtHome Delicate Arch #AmericanGreatness https://t.co/sESCP2n0xB RT @ChibiJanus: St. Louis Cathedral @StephenAtHome #AmericanGreatness https://t.co/B7mV3segX3 RT @brandonmtnhill: @StephenAtHome Devil's Tower in Wyoming #AmericanGreatness https://t.co/wD7xYaEhc0 RT @agpascual: @StephenAtHome Clumps of fog clinging to the Porcupine Islands offshore from Bar Harbor, ME #AmericanGreatness https://t.co/… RT @artfulmegalodon: @StephenAtHome Northwest Washington state - wish I could remember exactly where! #AmericanGreatness https://t.co/oCQVO… RT @kiddchronic: @StephenAtHome from the heart of Austin, TX: Lady Bird Lake #AmericanGreatness https://t.co/jGrzm65aPq I'll be right there! https://t.co/SMZrBgyuF6 RT @nike12000: @StephenAtHome beautiful Pa #AmericanGreatness https://t.co/jsz8iT1xNc RT @SnakesLeftEye: @StephenAtHome Humbug Mountain, near Port Orford, or.\n#AmericanGreatness https://t.co/mtz3I0xPxr RT @Notacatladyyet: Boston, Massachusetts.  Home of strength and perseverance.  Home of so much American history.  @StephenAtHome #American… Hang in there! https://t.co/vDbrOTJieP RT @CMSStinnett: @StephenAtHome Camp Wesley Woods in Townsend, Tennessee. Growing lovers of nature and kindness. #AmericanGreatness https:/… RT @ElamWhit: @StephenAtHome Williamsburg VA: Nothing like it on 🌎. The complex seeds of American independence still bloom today. #American… A lot of talent out on that field! Play ball! https://t.co/s2E6FPgvDS RT @tinkeringprim8: Perfect beach day at Wedge Pond in Winchester, MA. Our bird friend thinks so too. #AmericanGreatness #namethatbird @Ste… RT @DavidDeshler: @StephenAtHome Crater Lake National Park in Oregon!!  #AmericanGreatness https://t.co/yDZYTrIirj RT @LaurieLAGS: @StephenAtHome staycation on Old Hickory Lake (operated by Army Corp. of Engineers) Hendersonville, TN #AmericanGreatness h… RT @J_Reib: @StephenAtHome Eleven Mile State Park - Lake George, CO #AmericanGreatness https://t.co/SP2hUWROEX RT @tbluemling: @StephenAtHome #AmericanGreatness Hanauma Bay Hawaii https://t.co/urQ6cNRIZ7 RT @avabishopp: @StephenAtHome #AmericanGreatness Silver Mountain, Idaho has the longest gondola ride in North America https://t.co/2bxNx6T… RT @SueMansour: Garden of the Gods #AmericanGreatness https://t.co/p2z2c54gle RT @catrocketship: @StephenAtHome Girl Scouts' canoes at sunset on the Boundary Waters, Minnesota #AmericanGreatness https://t.co/txh2RTyAe6 RT @simeyowen: @StephenAtHome Boothbay Harbor, Maine. Lobster ketch. https://t.co/H1eqzKmOIF RT @SallyJFox: @StephenAtHome The only thing better than a thunderstorm is a thunderstorm in the Colorado mountains! #AmericanGreatness htt… RT @SVBizLynn: @StephenAtHome #AmericanGreatness This summer's spectacular waterfalls at Yosemite National Park. https://t.co/N9EgedA1DV RT @KimBaxter: Leavitt Meadow, Sierra Nevada, Mono County, CA @StephenAtHome #AmericanGreatness https://t.co/ru9jTbpBww RT @momsgottattoos: @StephenAtHome can't choose just one. Glacier National Park &amp; west end of Flathead Valley❤❤❤ #AmericanGreatness https:/… RT @satansrobot: @StephenAtHome The Second Bank of the United States, Philadelphia! #AmericanGreatness https://t.co/eTnf8BJMNT RT @Tex_Ican: @StephenAtHome #AmericanGreatness From the top of Texas.  Guadalupe Peak. https://t.co/V9gKffQ4ME RT @lovepeggym: Looking Glass Rock via the Blue Ridge Parkway #AmericanGreatness @StephenAtHome https://t.co/mzq74tplhZ RT @jaderoyjr: Maine Lobster Rolls made to order in Wells, ME #AmericanGreatness @StephenAtHome https://t.co/un7yoVRco4 RT @toddias: @StephenAtHome Biking at the Quabbin Reservoir in New Salem, Massachusetts. #AmericanGreatness https://t.co/dPynn5v1gv RT @mjpina6: Green River Overlook, Canyonlands National Park, UT #AmericanGreatness @StephenAtHome https://t.co/yfRCE1cWWo RT @blindeman75: @StephenAtHome Mount Neahkhanie from Manzanita, Oregon #AmericanGreatness https://t.co/0BMEzxDzxM RT @RoyFillmore: @StephenAtHome Dark Hollow Falls in Shenandoah National Park, VA #AmericanGreatness https://t.co/aM56Q1V0u6 RT @matthew_kane: @StephenAtHome Above Telluride, CO on the Jud Weibe Trail #AmericanGreatness https://t.co/65Y5jjpMTf RT @samelhombre: @StephenAtHome #AmericanGreatness Rocky Mountain National Park https://t.co/i43eNg9FCA RT @bettybarc0de: .@StephenAtHome City Hall, #Buffalo, NY, at dusk.\n#AmericanGreatness https://t.co/UZpHOpaGJ4 RT @RevTomDotCom: Iowa, South Dakota, and Nebraska from @PoncaStatePark #AmericanGreatness https://t.co/EwJ3PO7brg RT @jgootee: @StephenAtHome Kodiak brown bear fishing, Kodiak NWR, Alaska #AmericanGreatness https://t.co/pn1SAVoRr4 RT @Roobars179: WWII Marine Vet-Iwo Jima Memorial, Honor Flight from Charleston, SC Oohrah, Ma’am! @StephenatHome #AmericanGreatness https:… RT @tylercedergren: @StephenAtHome #AmericanGreatness Kohler, Wisconsin Blackwolf Run https://t.co/p1Sd31Z8Qd RT @HawleyGrrrlzMom: @frosttweet @StephenAtHome I eventually made it to Lake Huron.  #AmericanGreatness https://t.co/XX4BQ5qVsg RT @tayfinch4: @StephenAtHome The final resting place of First Lady and icon Abigail Adams. #AmericanGreatness https://t.co/IeuVoYGZtR RT @GreggRichEsq: #AmericanGreatness https://t.co/JEghNwnLvM RT @EastNashTodd: @StephenAtHome #AmericanGreatness at the @TheRyman in Nashville https://t.co/pWQLEZoX37 RT @tessa_inRL: @StephenAtHome returning home to TX from a rainy, yet beautiful, week in Yellowstone National Park #parkservices @NatlParkS… RT @vamperstein: @StephenAtHome Mt. Shasta in Northern California. #AmericanGreatness https://t.co/0aLkCVPla1 RT @CholericCleric: #AmericanGreatness https://t.co/Vt4042T6Cb RT @facile_barb: @StephenAtHome Beautiful Towers of Time in Nebraska Ponca State Park. #AmericanGreatness #midwestlivinglovingit #stephensn… RT @TrenenaStanley: @StephenAtHome Spending@time with the family in Rock Island, TN #AmericanGreatness https://t.co/qorFG9N967 RT @LaSpiritsBess: @StephenAtHome Rocky Mountains outside Estes Park, Co. These guys settling a dispute right on the side of the road. #Ame… RT @agooding: Travel ball at Founders Park in Columbia SC #WavesBaseball @StephenAtHome https://t.co/Wnr723wkMp RT @JudeB63: @StephenAtHome Not traveling but family came to visit! SEARS Tower, Chicago https://t.co/CFrdIQnGhC RT @GoRoxy: @StephenAtHome  Pearl Harbor (on \"some island in the Pacific\") #AmericanGreatness https://t.co/fPBIGGoxGx RT @thesioux: @StephenAtHome  Stones River National Battlefield located in Murfreesboro Tennessee https://t.co/iNYiOcR1hS RT @Nick_Offerman: 2 bipedal master crafting examples of #AmericanGreatness @StephenAtHome https://t.co/UvBsfOG3GG RT @maddie_vb: @StephenAtHome In front of the Paul Revere statue outside of the Old North Church in Boston #AmericanGreatness https://t.co/… RT @iPlop: @StephenAtHome Skateboarded to the top of Lombard for this picture of San Francisco at night ☺️ https://t.co/yvFqLQTk8y RT @jphillipsbrown: \"that government of the people, by the people, for the people, shall not perish from the earth.\" @StephenAtHome #Americ… RT @urluckystarss: @StephenAtHome Yosemite National Park, California https://t.co/J7QQKj7PI5 RT @robertacjackson: In Rushville, Indiana, it's baling time and corn is right on schedule: knee-high by 4th of July!  #AmericanGreatness @… RT @arnoldbm: @StephenAtHome Barnum Pond, Adirondack Park, NY State #AmericanGreatness https://t.co/t7SMHDLOei RT @CarmenWisdom: @StephenAtHome Hiking in Bryce Canyon, Utah #AmericanGreatness https://t.co/E9jVXAwz7Y RT @SkinnySmitty: @StephenAtHome Punderson State Park, Ohio (photo credit to my sister, @AmyWensinger). #AmericanGreatness @OhioStateParks… RT @KellyQAnderson: . @StephenAtHome Exploring our local @chicagobotanic gardens with boundless energy. #AmericanGreatness https://t.co/Hp2… RT @avalonjfrey: @StephenAtHome Mr. Jefferson's University in Charlottesville, VA. My hometown (and alma mater). No place like it. #UVa #Am… RT @roseyd58: Beautiful Rhode Island in the summer. @StephenAtHome #AmericanGreatness https://t.co/1u8zKOgiCD RT @MikeBouchee: @StephenAtHome Watching baseball with my family to celebrate the #FourthofJulyWeekend #AmericanGreatness @StephenAtHome ht… RT @thesioux: @StephenAtHome  National Cemetery in Nashville Tennessee https://t.co/4Deh0M1zp6 RT @huliaoz: Honored to be performing at The Kennedy Center in Washington, D.C. in The Sound Of Music  @kencen @StephenAtHome #AmericanGrea… RT @lisavi__: @StephenAtHome Lake Crescent, Olympic National Park #AmericanGreatness https://t.co/lQzu3MAhMK RT @MissRegina49: @StephenAtHome My first trip to D.C. this winter. #AmericanGreatness https://t.co/gzAB6M7pon RT @WubsNet: @StephenAtHome Home in Rochester, NY Lake Ontario !!  #ROC https://t.co/aD61KWKtJt RT @AtEaseCoaching: @StephenAtHome #AmericanGreatness Brown's Point, WA come and hang sometime-- https://t.co/jm1Hyc0Eix RT @JennyWoodrin: @StephenAtHome Starved Rock State Park, Utica, Illinois https://t.co/7SlIZciae0 RT @West222West: @StephenAtHome  College football game day LSU https://t.co/XOeo3uN8i4 RT @DaneBernardo: @StephenAtHome Checking out Mars on the Notch Trail, Badlands National Park, South Dakota #AmericanGreatness https://t.co… RT @stratons: @scrutatrix @StephenAtHome this in our Seattle neighborhood https://t.co/9nz1hYe178 RT @Fathead826: @StephenAtHome Grand Teton National Park https://t.co/ylVaDrLT2i RT @cknoblock17: @StephenAtHome Brooksville, Maine, overlooking Eggemoggin Reach #AmericanGreatness https://t.co/CRQF5n6R7Q RT @eesadiane: @StephenAtHome Backyard view over the Yellowstone River in Montana. #AmericanGreatness https://t.co/y8nYIFYuVl RT @heathwblack: @StephenAtHome my son learning for fly a kite on a country road in southern Utah. #AmericanGreatness https://t.co/E77SgReK… RT @craig_merriman: @StephenAtHome Hoh River Rain Forest.   Olympic National Forest, WA #AmericanGreatness https://t.co/tG8D5JyK1p RT @SeanCKenny: @StephenAtHome Hanging with friends in Rochester, NY https://t.co/9u0pJBN8z7 RT @ScrambledMegs91: @StephenAtHome Volunteering this weekend at Historic Hazelwood House in Green Bay, WI Our tours are amazing! #American… RT @jchapmaniv: .@StephenAtHome perched on a rock in Harriman State Park enjoying the natural beauty and #AmericanGreatness https://t.co/KQ… RT @Robc2221: @StephenAtHome From the home of country music. Nashville at it's best. #AmericanGreatness https://t.co/5H5w3oAG9c RT @DBrewNews: @StephenAtHome Backyard locusts; summer's song. Tulsa,OK https://t.co/KNdgpiQaB0 RT @gamraes: @StephenAtHome #AmericanGreatness from the shores of Lake Erie in Buffalo  NY https://t.co/zQDtem0CCr RT @allopicc: @StephenAtHome how about a lovely light house on the shore of Lake Michigan in Grand Haven?? #AmericanGreatness  #PureMichiga… RT @Tailormadecoug: @StephenAtHome Sawtooth National Forest  Idaho. So beautiful and serene. #AmericanGreatness https://t.co/nGy2CQVvPZ RT @ColetteCavanagh: @StephenAtHome And dawn with her rose-red fingers shone once more over Lake Champlain... #AmericanGreatness https://t.… RT @frickadee: @StephenAtHome Lake of the Isles, Minneapolis! #AmericanGreatness https://t.co/DEIItMrZE0 RT @RyanVanLiere: @StephenAtHome Tubbs Hill Park - Coeur d’Alene, ID. #AmericanGreatness https://t.co/kC2nSpyqfw RT @tmarquiswx: @StephenAtHome Monterey bay aquarium, Sequoia national park, kings canyon national park. #AmericanGreatness https://t.co/jb… RT @sjwallender: @StephenAtHome At home in northern Michigan. #AmericanGreatness  ❤♡💙 https://t.co/XmtVcXA9JP RT @jessmcshea: @StephenAtHome Hiking next to powerful waterfalls last month with my dear friends in @YosemiteNPS @USInterior #AmericanGrea… RT @BigOrangeJeff: @StephenAtHome The Great Smoky Mountains National Park, the most visited national park in the USA #AmericanGreatness htt… RT @thatsnoternie: .@StephenAtHome Ocean City NJ. Family tradition over the week of the Fourth. #AmericanGreatness https://t.co/ulqJ1k3h7A RT @gavin_telford: @StephenAtHome At Old Faithful, Yellowstone National Park, Wyoming https://t.co/z0Lna6tA4G RT @JW4Resistance: @StephenAtHome \n\nIt's American and it's Great and it's a staycation we call the back yard.\n\n #AmericanGreatness https://… RT @JohnAVerrochi: @StephenAtHome Top of the Rockies at Independence Pass #AmericanGreatness https://t.co/nbbpG9ekpn RT @mr_polakowski: @BooMajor1 @StephenAtHome The parade of Tall Ships in Boston recently! https://t.co/Tmue4QeVQ1 RT @avirp22: @StephenAtHome Kayaking on Lake Tahoe. https://t.co/FD86fFIaN2 RT @ryanderson29: @StephenAtHome Fishing Pier - Ventnor City, NJ #AmericanGreatness https://t.co/FtFvIaLuWf RT @dsgraham: @StephenAtHome My wife and I found a moose at Denali National Park https://t.co/01pcrCV7Af RT @kwm3: @StephenAtHome Waiting for American music, Dead &amp; Co at beautiful Shoreline Amphitheatre Mountain View, Cali #AmericanGreatness h… RT @caddylily: @StephenAtHome Grand Canyon National Park, guaranteed to make you realize how small you are. #AmericanGreatness https://t.co… RT @emers_731: @StephenAtHome Little House on the Prairie realness in Illinois  #AmericanGreatness https://t.co/TE3Umzk1RN RT @OH_LAAAWWD: @StephenAtHome Nothing like #AmericanGreatness quite like the stills at the Evan Williams Bourbon Experience in downtown Lo… RT @stooleeoat: @StephenAtHome dogs, hikes, and fly fishing on #publiclands in the Wind River Range, Wyoming #AmericanGreatness https://t.c… Save me some! https://t.co/wW1QxFm2qk RT @Brobi_1Kenobi: .@StephenAtHome // \"There are no words that can tell the hidden spirit of the wilderness...\" - TR // #AmericanGreatness… RT @shulmanator315: @StephenAtHome Canyonlands National Park in Utah #AmericanGreatness https://t.co/OSLihPY04I RT @MommaCahill: @StephenAtHome A University of Akron softball game #AmericanGreatness https://t.co/7jyT0E9JLE RT @ChrisBWills: .@StephenAtHome Visitors celebrating legacy of #AbrahamLincoln at his tomb in Springfield. #AmericanGreatness https://t.co… RT @chuck415: @StephenAtHome Here's Coconut at Limantour Beach, Point Reyes National Seashore in Northern California! #AmericanGreatness ht… RT @WheelsRI: @StephenAtHome Block Island, Rhode Island https://t.co/4fFKDOL7G0 RT @Corey_Clark: @StephenAtHome Made my 9-year-old read this out loud to me. #AmericanGreatness https://t.co/AMyA2Wegxc RT @TeachPIB: @StephenAtHome South Bass Island, Put-in-Bay, OH #americangreatness https://t.co/CLTW7IuuSS RT @kedavis24: @StephenAtHome Monument to the Immigrant, New Orleans, LA #AmericanGreatness https://t.co/sIOBq8ycNv RT @CRaceDavis: @StephenAtHome #AmericanGreatness going to church with my wife today https://t.co/plOFWBW2qT RT @ShiranthaStan: @StephenAtHome enjoying the view from my New Jersey balcony #AmericanGreatness https://t.co/42qLKEahbH RT @KeenanIrish: Old Illinois State Capitol where  Abe Lincoln started his career #AmericanGreatness @StephenAtHome https://t.co/U8qfW8nPdX RT @EloquentScience: Mountain biking in Dixie National Forest, southern Utah.  @StephenAtHome #AmericanGreatness https://t.co/64HAtDN6m9 RT @LadyPezak: @StephenAtHome White Sands National Monument, NM #AmericanGreatness https://t.co/UuHvOjgd0w RT @KCChrisM: @StephenAtHome Our family met my sister's in St. Louis on Friday. It was a perfect night for a great game. #AmericanGreatness… RT @tishywishywashy: @StephenAtHome View of Lake Superior from Brockway Mountain in Copper Harbor, MI. https://t.co/Mqwa85ZH0J RT @SFUnite_N_Cali: @StephenAtHome #AmericanGreatness at my favorite Play @Hamilton in  San Francisco, Ca @shnsf #Hamiton https://t.co/oDmk… RT @BooMajor1: @StephenAtHome watching horses rein in Oklahoma City, Oklahoma. https://t.co/jrlAIexaYW RT @likethefoxx: @StephenAtHome El Morro in beautiful San Juan Puerto Rico 🇵🇷🇺🇸 #AmericanGreatness https://t.co/lZlnukgAwr RT @pfischer27: Mark Twain's home in Hartford, CT.  @StephenAtHome  #AmericanGreatness https://t.co/46RJuJ5erf RT @DLHarshman2: Replying to @StephenAtHome\n\nContinental Army cabins at Valley Forge National Historical Park, Valley Forge, PA.  #American… RT @YesHeatherSays: @StephenAtHome hula hooping on Orange Beach, Alabama #AmericanGreatness https://t.co/75jPdXmpQN RT @joelberg: @StephenAtHome Jackson Lake with Grand Teton in view. @GrandTetonNPS #AmericanGreatness https://t.co/eEYE5Q64Ku RT @TCCurrie: @StephenAtHome So hard to pick 1! Sunset on the road with 🌈 in Eastern OR. #AmericanGreatness https://t.co/1KltYoCdCv RT @Stevegruenberg: @StephenAtHome here is some #AmericanGreatness the Hanford nuclear reservation from badger mountain. #manhattanproject… RT @Morticiaadams91: @StephenAtHome A Bald Eagle in flight over the Illinois River at Starved Rock State Park. #AmericanGreatness https://t… RT @DugThreewitt: @StephenAtHome LeClaire, IA, our national bird is keeping an eye on us. #AmericanGreatness https://t.co/vBQ8DUFM2r RT @AndyDost: @StephenAtHome @StephenAtHome An entire Chicago beach full of dogs, all summer. #AmericanGreatness https://t.co/8CPQkTlVi2 RT @BMESLiteracy: @StephenAtHome Lovers Leap State Park in Connecticut...the #Nutmeg state.  Love is definitely what we need right now!  ❤️… RT @blambson: @StephenAtHome The historic San Fernando Cathedral in San Antonio, right next to The Alamo for all it represents is a great e… RT @zed_pm: @StephenAtHome Recently spent time in Savannah, GA remembering the sacrifice of many nations to benefit the making of our count… RT @FannyWanKenobi: @StephenAtHome Ellis Island. Happy 4th july. #AmericanGreatness https://t.co/0rPD0i1SM5 RT @MordidaVenenosa: Replying to @StephenAtHome, a beautiful day at Mount Washington, Pittsburgh https://t.co/OmQ9wfpTUD RT @bluewavechris: @StephenAtHome Pipeline, on the North Shore of the island of Oahu.  #AmericanGreatness https://t.co/CfHfeoOPmd RT @MsPaulalala: @StephenAtHome The Southern California Coast - Rancho Palos Verdes #AmericanGreatness https://t.co/O66ANPiMKh RT @korenb: @StephenAtHome Otter falls. Mt. Baker-Snoqualmie National Forest. @ForestServiceNW https://t.co/tf7sssOnY7 RT @courtneyholeman: @StephenAtHome Multnomah Falls. Bridal Veil, OR #AmericanGreatness https://t.co/Or22WTh2Fk RT @KKeeney317: @StephenAtHome Philadelphia skyline on a foggy morning https://t.co/0B7QKHBRBa RT @Tdashdawg: @StephenAtHome We could use some more of this... #AmericanGreatness in Richmond, VA https://t.co/UOhF5KMBOL RT @_jtprice_: @StephenAtHome Northern Minnesota, lake country. https://t.co/hAcr9i9wdM RT @azsose: @StephenAtHome just got back from Pearl Harbor. What a somber representation of protecting America’s freedom. https://t.co/wZEg… RT @GlennC1: @StephenAtHome Beautiful day in Red Rock Canyon, NV. https://t.co/HaSQbc4vCJ RT @BenBriley: @StephenAtHome My backyard in East Tennessee - Kingston, TN #AmericanGreatness https://t.co/csmlW8Ne8Y RT @doug__h: @StephenAtHome Old growth forest on public lands. #AmericanGreatness https://t.co/eXEb4F8tXk RT @MWhitt86: @StephenAtHome Enjoying Olympic Sculpture Park, Seattle\n#AmericanGreatness https://t.co/DM0K38vpAG RT @DrBArmstrong: @StephenAtHome Enjoying one of America's beautiful volcanoes, in Orlando FL! #AmericanGreatness https://t.co/CJCgRRcybc RT @rustywitcher: @StephenAtHome Makapu'u Point Lighthouse on Oahu, Hawaii! #AmericanGreatness https://t.co/tMRoc7YlMt RT @KarenatashaB: @StephenAtHome Well, @StephenAtHome, I'm not traveling--but American greatness is visible from my window! https://t.co/0d… RT @ahmilkymilk: @StephenAtHome How about some love for Phelps Lake in Grand Teton? https://t.co/mL2X8fjWvj RT @onetiredema: .@StephenAtHome Gem Lake, Rocky Mountain National Park, Estes Park, Colorado #americangreatness https://t.co/FQLz74Aasx RT @UVAnwest: @StephenAtHome Ox Hill battlefield in Fairfax, Va. 6,000 Union troops fought 17,000 Confederates to a stalemate despite loss… RT @NaglaaYacoub: @StephenAtHome 1. Muskegon Lake, 2. Mona lake (just my back yard) Muskegon MI #americangreatness https://t.co/ho7kMDZyQt RT @lizlizlizshultz: @StephenAtHome Frank Lloyd Wright's last remaining operational hotel, the Historic Park Inn, in peaceful Mason City, I… RT @ColinC27: @StephenAtHome Enjoying the beautiful Lawrence, Kansas gray/brown river, just like they sing about in all the songs https://t… RT @Fridude: @StephenAtHome Sunrise over the beach at South Padre Island Tx 🌅 #AmericanGreatness https://t.co/roDDuPjKC7 RT @BoZaza: @StephenAtHome : Another crappy day in Paradise - Sunday, July 2, at Lake Elizabeth near Earleton, Florida, USA https://t.co/2N… RT @mattlindner: @StephenAtHome drinking beer on a rooftop in Chicago. #AmericanGreatness https://t.co/ux8ozw18NB RT @ThorSpangler: @StephenAtHome Big blue skies at Salinas Pueblo Missions National Monument in New Mexico. Que viva! #AmericanGreatness ht… RT @MollieCaulfield: @StephenAtHome #AmericanGreatness where it began for most of us! Seeing her greatness for the first time last week. ht… RT @miklovin_life: @StephenAtHome Yosemite, CA. One of the best places to be!!#AmericanGreatness https://t.co/Dt5jQrorZP RT @NancyAMyers: @StephenAtHome Graceland. Home of The King of Rock and Roll. #americangreatness https://t.co/UtMoBaEpeJ RT @ryanendean: @StephenAtHome Stanislaus National Forest in CA. Gorgeous. #AmericanGreatness https://t.co/91BfVDMuyK RT @Sam_Darr: @StephenAtHome Redwoods at the Muir Woods National Monument https://t.co/ywKj59DaHB RT @sudiptabose: @StephenAtHome The Washington Monument standing tall... #AmericanGreatness https://t.co/LeXilzskOA RT @BusyGreenMom: @StephenAtHome A rescued Bald Eagle, Calusa Nature Ctr Ft Myers\nAlligators, Alafia River State Park\nWeeki Wachee Mermaids… RT @lorimah: @StephenAtHome Glacier National Park, one of America's Crown Jewels. @GlacierNPS #AmericasBestIdea #AmericanGreatness https://… RT @joelhousman: @StephenAtHome Shenandoah National Park, Virginia https://t.co/OQCRG2D1X9 RT @baldjj: @StephenAtHome Deck of the USS Midway in San Diego yesterday with my wife and active-duty Marine son. #AmericanGreatness https:… RT @Fizzy27: @StephenAtHome Visiting Dallas for the weekend! Celebrating JFK and Rosa Parks who both stood up for freedom. https://t.co/3hv… RT @farrellyeliab: @StephenAtHome The mountains for North Carolina are the definition of beauty https://t.co/hrn0HJdSlg RT @wassie: @StephenAtHome My son and his cousin in Maui, HI. #AmericanGreatness https://t.co/266Pt7cjUr RT @MrCarlCaruso: @StephenAtHome Happy 4th Stephen!  Historical walking tour of Marblehead MA!  #AmericanGreatness https://t.co/WSxVcdDwgp RT @SophiaF4ever: @StephenAtHome Fort Sumter, Charleston, SC \nHappy 4th of July Stephen!! 🇺🇸🌞🇺🇸 https://t.co/3EyfuEwqz3 RT @MaraMaas: @StephenAtHome Hanging with my kids who came here as immigrants. We celebrate 1 year with the little guy on the 4th! #America… RT @Biddco: @StephenAtHome Oak Island, North Carolina. First time in this state! https://t.co/UTTxfkMdmV RT @hboyd324: @StephenAtHome Lake Junaluska, NC. Happy 4th!!!! #AmericanGreatness https://t.co/NhAzz5h3Gu RT @elvis717: @StephenAtHome When I met astronaut Charlie Duke, one of the twelve humans in history who has walked on the moon, and a wonde… RT @Bad__Scooter: @StephenAtHome 3rd row for Mr. America himself, Bruce Springsteen, in Washington, DC https://t.co/4bhf6Z47BE RT @zoomydu: @StephenAtHome Sassy teenager kayaking from Amelia Island, FL to Cumberland Island, GA and back. #AmericanGreatness https://t.… RT @Aricka_Shuck: @StephenAtHome My parents coming to see me in a Community Theatre production. Not often praised but local theatre is part… RT @BenWasHere_inc: @StephenAtHome Cruz Bay St. John USVI #AmericanGreatness  Can't wait until your back! https://t.co/cRss0yJsjW RT @picturepanda: @StephenAtHome Hiking at Pine Mountain, GA w/ the whole fam, Reunion style #AmericanGreatness https://t.co/WheWL0nBRR RT @LucasHerndon: @StephenAtHome Organ Mountains-Desert Peaks National Monument. #LasCruces New Mexico! #MonumemtsForAll https://t.co/Zk6ao… RT @KlecksRorschach: Discovering America's Greatness with a walk in the woods. @RockyNPS #AmericanGreatness @StephenAtHome https://t.co/xwK… RT @DavidVeselenak: @StephenAtHome Spent last Monday at Fort McHenry in Baltimore. Home of the Star-Spangled Banner. #AmericanGreatness htt… RT @ndimichino: @StephenAtHome #AmericanGreatness Guess where we are? https://t.co/xxoPnlU9HL RT @jatuf: @StephenAtHome Louis Armstrong House Museum, Queens, NY. Jazz is surely one of #AmericanGreatness https://t.co/PEkWWoAkpc RT @gabotamayo: @StephenAtHome early #4thofJuly  celebration in South Texas, just because we're #aheadofschedule https://t.co/jGPwAxIzMQ RT @kari05099458: @StephenAtHome   Yellowstone National Park Lower Falls Canyon https://t.co/OyZ7Ojqz5a RT @artisanalBS: @StephenAtHome DUMBO in Brooklyn , viewing One World Trade Center under the Brooklyn Bridge... just chillin' in my nabe..!… RT @rogers_kirstin: @StephenAtHome Yellowstone this past week. Woke up to buffalos in our camp &amp;   everything else is amazing too #American… RT @kkossick: .@StephenAtHome because serving others is at the heart of #AmericanGreatness https://t.co/cu6hDqZcJG RT @Nicurnmama: @StephenAtHome Working this holiday weekend saving tiny human lives - strongest people I have known. #nicunurselife #Americ… RT @AlexPerham: @StephenAtHome The Indiana Dunes National Lakeshore is gorgeous... as long as you're facing the right direction #AmericanGr… RT @BillLassiter: @StephenAtHome Drift Creek Falls, Lincoln County Oregon (but repping with a D.C. Sweatshirt). #AmericanGreatness https://… RT @saraannb: @StephenAtHome Piney Lake and the White River National Forest outside Vail, CO https://t.co/iCqbIK82jK RT @tourettedev: @StephenAtHome A mountain whose name escapes me, Colorado #AmericanGreatness https://t.co/cvqcUyDMgl RT @CrucialTK: @StephenAtHome finished my morning Appalachian Trail bike at the War Correspondents Memorial in Gathland State Park #America… RT @billscherz: @StephenAtHome La Plata Mountains - Durango, CO. #AmericanGreatness https://t.co/GRvnrhOkfi RT @Sprtakuz: @StephenAtHome A visit to Mesa Verda National Park and the home of the early Americans. #AmericanGreatness https://t.co/FrCHS… RT @nikkiCblaze: @StephenAtHome Boston Commons, can't get more American than beantown #AmericanGreatness https://t.co/6zBL8icdwO RT @malber1: @StephenAtHome 4th weekend at home in NOLA @AudubonNature #AmericanGreatness https://t.co/dcebgyHGz2 RT @11Thanlon: @StephenAtHome City Lights Bookstore-- sold banned books and served as a meeting place for the Beat Generation #AmericanGrea… RT @Jeggthree: @StephenAtHome 250 year old Southern Live Oak, known as Treaty Oak, Jacksonville, Fl. https://t.co/SwnAeMdcZ0 RT @doubleunruh: @StephenAtHome @ baseball fields across the nation... #AmericanGreatness https://t.co/0YQxhoXI7c RT @ABAndyBarron: @StephenAtHome @ final spot of Ernest Hemingway, original Papa Bear to end great Rocky Mt trip. Go @NatlParkService !! ht… RT @cbsnowflake: @StephenAtHome baby humpback whale. Massachusetts bay. https://t.co/cF9JjMNKQv RT @kolbsterrrr: @StephenAtHome United States Virgin Islands 🇻🇬 🇺🇸 https://t.co/rQyHBT1sog RT @TtothaPas: @StephenAtHome Beautiful Puget Sound - WA State - activity #AmericanGreatness https://t.co/sEZkEAgMSy RT @WhiteboyWill: @StephenAtHome Mt. Evans,  near Denver Colorado https://t.co/4npstDBxpQ RT @katemchall: @StephenAtHome Sunset over the pond at my nephew's first Cub Scout campout. #AmericanGreatness https://t.co/8vIS4QpSDa RT @sage_cowit: @StephenAtHome Wild horses at Assateague Island National Seashore! #AmericanGreatness https://t.co/pT0hFeLoDg RT @dahpepko: @StephenAtHome Burnside's Bridge, Antietam National Battlefield. https://t.co/9RNkhjwj05 RT @wvtimnaylor: @StephenAtHome New River Gorge Bridge, Fayetteville, WV #AmericanGreatness https://t.co/EEfrk2CZi2 RT @mursebigford: @StephenAtHome My view from the One World Trade Center's observation deck in NYC looking at the 9/11 memorial last night.… RT @Running_short: @StephenAtHome Hanging out with some of the presidents #AmericanGreatness https://t.co/BZ9osdfjbg RT @annasez: @StephenAtHome On a night tour, we finally got to see the Lincoln Memorial. https://t.co/ffj742meI8 RT @Vahue23: @StephenAtHome Happy 4th of July from Rock Island Lighthouse, 1000 Islands NY!\n#AmericanGreatness https://t.co/e7g6bn3qsi RT @jerylkolb: @StephenAtHome Spending time with a Park Ranger in Olympic National Park. #AmericanGreatness https://t.co/VL8uQWhhK9 RT @mursebigford: @StephenAtHome Mt Rainer, Cascade Mountains in Washington. #AmericanGreatness https://t.co/6cNr1UapxK RT @TrueBluBrewCrew: @StephenAtHome Reunion at the family farm in Lansing, IA on the Mighty Mississippi River. https://t.co/nQCr8knO8l RT @JFelbie: @smsg1234 @StephenAtHome Grandfather and grandson at the rose gardens in Portland, Oregon https://t.co/vnmWs7jS6a RT @ThoughtsFromSLC: @StephenAtHome My wife and I spent some time with \"beautahful\" Utah mountains and lakes https://t.co/M6Q61dfLb5 RT @Chris_Dayton94: @StephenAtHome Mountain summit in spectacular noth cascades national park. https://t.co/nnMcBKn5l0 RT @spfisher1980: @StephenAtHome Time Square, NYC for the weekend https://t.co/7F89fsDXtG RT @shhhaneparishhh: @StephenAtHome Mister Rogers Memorial.  Pittsburgh, PA. #AmericanGreatness https://t.co/FM5XFNCtYV RT @Areo_Pagitica: @StephenAtHome Bracken Bat Cave, Comal County Texas, world's largest bat emergence, largest concentration of mammals #Am… RT @Kwallacepol: @StephenAtHome Great Basin National Park, NV! https://t.co/EpRGLLQkd2 RT @debc6582: @StephenAtHome Red Rock country - Sedona/Oak Creek, AZ https://t.co/xzE2UsNN0P RT @_BenjaminBieber: @StephenAtHome World's largest spruce tree. Washington state. https://t.co/FxCIDSXY7g RT @C_M_Randall: @StephenAtHome Last night's sunset in Sonoma, CA https://t.co/DsVdnbnKhE RT @tp606: @StephenAtHome At the Hildene in Manchester, VT. https://t.co/cWYbIxzVPQ RT @mikelorden: @StephenAtHome  https://t.co/LYPdeES4E9 RT @issuekid: @StephenAtHome Crazy beautiful views and day hikes with great friends. San Simeon, CA. #AmericanGreatness https://t.co/nWhReg… RT @smsg1234: @StephenAtHome Weekend @ Grand Canyon - hot but beautiful https://t.co/LfppfqwwFU RT @SarahSpain: @StephenAtHome Tom Petty at the great Wrigley Field. #AmericanGreatness https://t.co/Qcagaqbtm3 Sure! https://t.co/SRncBrjUEs RT @TwoToeHeads: @StephenAtHome A rainbow over 10,000 Islands, FL. A happy 4th of July to everyone north of us. Unless it is Canada Day. Ha… RT @CBurdon1: @StephenAtHome Chillin in Hilton Head, SC #AmericanGreatness https://t.co/VtWxoxakXS RT @BestCardsFan: @StephenAtHome Sunset in Grand Teton National Park #AmericanGreatness https://t.co/PHmZqSbany RT @welchproject: @StephenAtHome 7 Magic Mountains by Ugo.  Jean, NV. #AmericanGreatness https://t.co/yp1cQGGM1f RT @barrettbuss: @StephenAtHome Sandburg's house in Elmhurst, IL.  We, uh, may not have preserved it. But hey, free parking! https://t.co/3… RT @layofluthien: @StephenAtHome Florida occasionally good for something. https://t.co/YUB9OQccJF RT @mary_schoolme: @StephenAtHome Best. Dog. In. 'Merica!  Steamboat Springs, CO! https://t.co/Jb0WXMfgfW RT @4causeNcomrades: @StephenAtHome Flannery O'Connor's bedroom in her childhood home in Savannah, GA. #AmericanGreatness https://t.co/NX4w… RT @beckers46: @StephenAtHome I stopped in Smithfield, NC, Ava Gardner's hometown. The @AvaMuseum was cool! #americangreatness https://t.co… RT @hoyashannon: @StephenAtHome Rock and Roll Hall of Fame! https://t.co/INpEYgIoQj RT @Matt_Rust: @StephenAtHome Flannery O'Connor's childhood home. Savannah, Georgia #AmericanGreatness https://t.co/1MKwHzVnMY RT @Vollmsy: @StephenAtHome The American Prairie.  #AmericanGreatness https://t.co/1miy7nXKGo RT @1313ande: @StephenAtHome Spent the week at Glacier National Park - totally awesome! Enjoyed a huckleberry shake today. https://t.co/Ofs… RT @VegFashionista: @StephenAtHome At Portage Glacier/Lake near Whittier, Alaska https://t.co/ThqFtpLApc RT @ericgmerten: @StephenAtHome Crescent Beach, FL #AmericanGreatness https://t.co/KITAkBln2C RT @Jeff_Schrader: @StephenAtHome The Wright Flyer. #DaytonNHP https://t.co/T4d8cv909k RT @RABBITISH1: @StephenAtHome Happy 4th, Stephen!  We were just at the Grand Hotel on Mackinac Island. #AnericanGreatness https://t.co/pS2… RT @cldoyle63: @StephenAtHome Johnny Cash museum, Nashville, TN. #AmericanGreatness https://t.co/p1dNEqA293 RT @flesz: @StephenAtHome This week #LincolnMemorial #Lincoln #illinois #carlsandburg wrote about this dude #TheMuralsDocumentary #chicagop… RT @karateinheels: @StephenAtHome #ThomasJefferson in the flesh in @colonialwmsburg https://t.co/pPKlpx6kYf RT @kupplove: @StephenAtHome Wright Brothers, Kill Devil Hills, NC. #AmericanGreatness https://t.co/7LEdljsZRe RT @eleanor_x_rigby: @StephenAtHome Independence hall on the Fourth of July weekend. #AmericanGreatness https://t.co/5YXj1QfCSv RT @AmaryllisKent: @StephenAtHome Visiting the Liberty Bell #AmericanGreatness https://t.co/l5CbQEneAZ RT @FortGeek: @StephenAtHome The last Saturn V first stage built, #15, at the NASA Michoud facility where they were built (Near New Orleans… RT @RobinHBenedict: @StephenAtHome You're at the wrong end of the state. Come see Topsail Island/Surf City! NC barrier islands rock (actual… RT @Beijo11: @StephenAtHome @RockyMntnMike Mildred North Dakota...... https://t.co/pQASlT7xqi RT @LynnWunder: @StephenAtHome Sunset over Lake Washington in PNW #AmericanGreatness https://t.co/3x28E4KKCt RT @windycitygal83: @StephenAtHome Crater Lake. @NatlParkService https://t.co/sIiSeq7MVo RT @auntcorna: @StephenAtHome #AmericanGreatness https://t.co/Gr4ppKpBrw RT @AnneMWolke: @StephenAtHome Abraham Lincoln's house in Springfield, IL. https://t.co/kUFm36KaEh RT @cincan22: @StephenAtHome Beautiful day at Flathead Lake, MT! https://t.co/HrecR6toqi RT @tdurkin6: @StephenAtHome Lawrence, KS. Home of Beat Generation Writer William S Burroughs from 1981 until his death in 1987. #AmericanG… RT @RyanVandeWater: @StephenAtHome Crazy Horse and crazy kids. #AmericanGreatness https://t.co/4U7Bmxlqtn RT @StoniJo: @StephenAtHome My boy and I conquering Monster Mountain at our Boy Scout summer camp.  #AmericanGreatness https://t.co/iTTinGs… RT @Plasticdoe: @StephenAtHome Rocky Mountain National Park and a loud four-year-old #AmericanGreatness https://t.co/oyfAEayqoH RT @alivasdlott: @StephenAtHome Visiting the original Woolworth counter from the Greensboro sit-ins in NC. https://t.co/9b0GsjFsso RT @RepDanielRiemer: @StephenAtHome In front of Teddy Roosevelt's childhood home in NYC. #AmericanGreatness https://t.co/ISdicFODv6 Carl Sandburg House, Flat Rock, NC- Traveling this 4th wknd? Share your brush with #AmericanGreatness https://t.co/IDqkrShlOO RT @colbertlateshow: Tonight: the American President has pulled off the impossible: he has united the entire world! Stephen explains tonigh… RT @colbertlateshow: Tonight: Donald Trump says Amazon isn’t paying its “Internet Taxes.” And he’s right. Because that’s not a thing. #LSSC… Hey Congressman Chaffetz! Congrats on landing a job where the President will listen to you! https://t.co/WqJUXCRQsD RT @colbertlateshow: Tonight: Democratic Senator Brian Schatz found the perfect way to describe the Senate GOP's healthcare plan. #LSSC htt… The Senate is delaying their vote on the Healthcare Bill. The suspense may kill us before lack of insurance does. Happy 20th Anniversary, Harry Potter! You've taught an entire generation the value of sprinting into train station walls! #HarryPotter20 RT @colbertlateshow: Tonight: Stephen is back from Russia to talk about the biggest story in America… Russia! #LSSC https://t.co/mt2qEPojsP To put that number in perspective, if you line 22 million people end to end, they would reach Canada &amp; get healthcare. https://t.co/jX883LDBfF Good to be back. I learned so much in Russia. Did you know that their leader is ALSO Putin?! .@realDonaldTrump Don't worry, Mr. President. I'm in Russia. If the \"tapes\" exist, I'll bring you back a copy! https://t.co/v5flvAMtFY It was so unfair of Megyn Kelly to edit her Alex Jones interview to include footage of him talking. Here's the DM: https://t.co/2zydvIp16r It was odd that the White House banned cameras and audio at today’s press briefing. Usually, they only ban facts. Trump said on Twitter that he took orders from Rod Rosenstein. Must have been hard for Putin to learn about their breakup in a tweet. Trump’s lawyer says he isn’t under investigation, unless he is. We won’t know until the investigators issue their report, unless they don't. RT @colbertlateshow: Tonight: After tweeting that he's under investigation, Trump sent his lawyer out to clear up any confusion. #LSSC http… Join me tonight as I welcome back to the Ed Sullivan theater @paulshaffer ! The Man, the Myth, the Mensch! https://t.co/UsW1AkM8gk Amazon bought Whole Foods, insuring farm to market to door to UPS to redelivery attempt to UPS to missed package to UPS back to market food! Happy 2 year anniversary of Trump announcing his campaign! Also, happy aging 20 years since Trump announced his campaign! Donald Trump’s lawyer hired a lawyer. Not a good look when your counsels for the Russia probe are stacked like nesting dolls. Crooked H is like Preparation H, but you use it after H is gone because it distracts from how big a D you are. https://t.co/oImFgVfCyo RT @colbertlateshow: Jeff Sessions is threatening to crack down on marijuana, but he seemed to be displaying some of its side effects durin… RT @colbertlateshow: On a day like today, we're especially grateful to have Trevor Noah on #LSSC to help put things into perspective. #LSSC… Really regret not calling Jeff Sessions' Russia testimony \"Putin on the Grits!” Props to Salvor Hardin Stephen King has been blocked by Trump on Twitter. I guess his book about a scary clown hit too close to home. \"AG Sessions, are you now or did you ever, coerce a maiden into giving up her first born child in exchange for spinning straw into gold?\" ! https://t.co/gMlPUe8ZTo Where's my ring?! https://t.co/1Swk69ifRZ I've never drunk champagne from the Stanley Cup, but I once sucked nacho cheese off a participation ribbon! Trump has postponed his trip to the U.K. due to low support. So, I guess no visits to the U.S. either? \"Under Oath\" is nice but to make sure Trump is honest, we need him to testify \"On an Access Hollywood Bus.” https://t.co/rQELlBRMX1 RT @colbertlateshow: @GOP Look harder... https://t.co/1ECvedsKTi RT @colbertlateshow: Tonight: Stephen read through James Comey's pre-written testimony, and found some pretty weird stuff. #LSSC https://t.… It's Comey's big day tomorrow. Gosh, I hope Hillary doesn't somehow ruin it for him. RT @toonDonaldTrump: I will be on @colbertlateshow tonight with @StephenAtHome at 11:35/10:35c! Enjoy!!! https://t.co/zNCptHgnKU George Clooney had twins! Only nine more until he’s got a full crew to take down Andy Garcia! I'd be grateful if this means planes now take us 4 years into the future. https://t.co/GCxwILmubA TONIGHT! New show! (I've been off for a week.  Did I miss anything? Let me check the news...oh my...) #LSSC Join with IAVA this Memorial Day to #GoSilent -learn more at https://t.co/8ZcdF1GlOY https://t.co/TbVCfTPEZq I was honored to host these service members during #FleetWeek and grab my #selfiewithasailor! https://t.co/6pT2hzPXNG There's gonna to be a Top Gun 2! Hope they finally catch those engineers who built a highway DIRECTLY into the danger zone. This is a fun job. https://t.co/p3bcDEUeLd Sounds bad, but think of the freedom you'll have! Like the freedom to sell your own organs to pay for health care! https://t.co/GoJRqtI87C If Disney doesn’t add Donald Trump to The Hall of Presidents, they should at least add his hands to It’s A Small World. RT @TuckBuckford: DEAR BRAINFIGHTERS, I HAVE SOME APOLOGIES TO ISSUE TONIGHT... https://t.co/nUsMlteRu9 Reince: Please, sir, no tweeting for a while.\nTrump: Got it.\nReince: Ok, I'm just going to tie my shoe... https://t.co/0jZbK5JNz3 Aw, hell yeah! #shutyerdirtylittlemouth https://t.co/t06te8x1Gl RT @colbertlateshow: Tonight: with White House scandals moving at a lightning-fast pace, Stephen takes a moment to recap this week's develo… Meet my new workout buddy... https://t.co/ZTE3ShRaxH We now go to Republicans for a response: https://t.co/8vBs1dimuH BREAKING NEWS! Brad Pitt will be on The Late Show tomorrow night to —wait, what? Trump already leaked that, too? TONIGHT!\nBad news: Trump revealed Top Secret intel to the Russians.\nGood news: Trump found the leaker! Well, that was fun! #briarpatch https://t.co/PgYZjd9u6Z Trump talked smack about me in TIME mag. If only I had a nightly show to respond on...oh yeah, I do! Join us, won't you? 11:35 #briarpatch We found a picture of the Russian photographers that got into the Oval Office! https://t.co/BPY3fABb9b Prez says he decided to fire Comey before the  DOJ report. Well, the best laid plans of mice and men...are exposed as a cover up by Trump. Why was COMEY fired? The answer may surprise you! ...if you're easily surprised.  https://t.co/lmayzBsUyx TONIGHT! THE MYSTERY OF THE COMEY AFFAIR! WHY ON EARTH WOULD TRUMP HAVE...it was the Russia stuff...yeah. That's why...\n#SwampTheDrain #LSSC RT @colbertlateshow: Tonight! For some reason, Trump thought firing James Comey would score him points on both sides of the aisle. #LSSC ht… And we miss you! (You too Nancy!) https://t.co/gj4ch9uk92 RT @colbertlateshow: Tonight! Stephen reacts to the day's big surprise: the firing of James Comey by President Trump. #LSSC https://t.co/ax… RT @colbertlateshow: We got the band back together! https://t.co/stqXLlGiUd Fun event tonight with @ChrisLicht Thanks @nickkroll ! Great to meet so many @TheEmmys members. Quick- back to NYC for Reunion Show! https://t.co/aATYw3dkAW Let's hope they have more success than NickleBizkit. https://t.co/0AsMui9pVl Congratulations to 2017 Kentucky Derby winner Always Dreaming. Vast improvement on 2016's Sobering Reality. The Senate was asked why 13 men and no women are working on their health care bill.  A: \"Hey-It’s a health BILL, not a health BARB!\" Sally Yates: Flynn could've been compromised by Russia. \nTrump: Great! Compromise is the Art of the Deal! Ted Cruz asked Sally Yates about Hillary’s emails. Ted, that’s so 2016: the hot new pointless obsession is fidget spinners. Wonder Woman is in theaters June 2nd. But if you want a sneak preview, watch Sally Yates' performance in front of the Senate. May the Fourth be with you. Also do your crunches. https://t.co/6RL0fm6j3F A woman faces jail time for laughing at Jeff Sessions. So do NOT laugh at how much he looks like my writer Mike's new baby. https://t.co/t97uMIbO2n RT @colbertlateshow: Tonight: watch as @StephenAtHome gets President Trump to sum up his first #100Days in office in just four words. #LSSC… Trump called Kim Jong Un a \"smart cookie.\" That's crazy -- he reminds me more of a \"murderous soft cheese.\" Last night @MontclairFilm \"STEP\"  Tonight \"Night of the Living Dead\" 4k transfer!\nJoin us the next ten days. Tix: https://t.co/yixIWzvZ2v Trump: I thought being president would be easier.\n\nMe: https://t.co/WW7MvYfFCw RT @colbertlateshow: Here is a look back at the 99-day dumpster fire you just lived through. #LSSC #99DAYS https://t.co/8qLsLtPGZu I'll be there! #FallinLoveWithFilm at the 2017 @MontclairFilm Festival in NJ! Now thru May 7. Tickets: https://t.co/P3oQ54ffjq #MFF17 RT @colbertlateshow: Tonight: Unlike Obamacare, #ZombieTrumpcare would allow states to opt out of covering pre-existing conditions. #LSSC h… You know what they say: If at first you don't succeed, abolish the 9th Circuit Court Of Appeals! https://t.co/UwVcVcQ4cI If Jesse Watters' lewd comments about Ivanka got him a \"vacation,\" then Trump must have enough points racked up to retire. Today is Take Your Child to Work Day or, as the Trump administration calls it, \"Thursday.\" RT @colbertlateshow: Tonight! News that President Trump is fond of pushing a special red button on his desk has Stephen a bit concerned. #L… ...and he got straight A's on this! https://t.co/KPrYxq5ScZ ...but I think better than mine... https://t.co/ibKVd32X3H Obama is reportedly receiving $400K for his first private speaking gig. Wow! It's so weird to know something about a president's finances. Stop me if you've heard this one before: A judge walks into a courtroom and blocks Trump's executive order. https://t.co/ot51tgm1IB Are you with Tuck? #BrainFight https://t.co/wE5oLP6SjA I love my stories!!!! https://t.co/gXAn4cv68o Bill O’Reilly has a podcast for subscribers to his website, so your grandparents may call you tonight with a “computer question.” RT @colbertlateshow: Tonight! President Trump is willing to risk a government shutdown in order to win budget approval for his border wall.… Join me at the @MontclairFilm Festival April 28-May 7, opening Friday with @stepthemovie:https://t.co/NAZYU3sHFV #MFF17 #stepislife @jdickerson Sarah Connor? Sessions is \"amazed\" an \"island in the Pacific\" judge can block the travel ban. Just like how I'm \"bewildered\" a \"racist elf\" can be AG. Doesn’t look like a lot of Patriots visited the White House. Maybe some players got confused and went to Mar-a-Lago instead? https://t.co/C8369Gwjua Say what you will, but Bill O'Reilly always had your back. And if you were a woman, he might try for your front, too. #RipPapaBear #LSSC RT @colbertlateshow: Also tonight! If you can't beat him, become him: @AlecBaldwin reveals his strategy for dealing with President Trump. #… British PM Theresa May stuns the world by calling for an election less than halfway through her term. Hey, how come THEY get to do that? I'm so sorry to hear of Dorothy Mengering's death, and so grateful that Dave shared her with us. Yeah! That's Deep! \nCongratulations, Jon. https://t.co/bEXeH2KCHo 3 mile race. Personal best! (Hope my urine sample comes back clean.) #RunForAdela https://t.co/rjaFiGIDtD Don Rickles hugged me once. It's all been downhill from there. God bless you, Rickles. RT @colbertlateshow: Tonight: Stephen wades into the uproar around Pepsi's \"protest\" ad, and finds there may be a hidden message. #LSSC htt… Steve Bannon was removed from the National Security Council.  No word on when he’ll step down from his role as president. This is what I'll actually look like in about six months. https://t.co/Od71QSzM9P Thanks, @MatthewNussbaum ! https://t.co/D0qzvp5dLe But how do you feel, Louis? https://t.co/3Nb1oqNJM9 Phenomenal! https://t.co/tSnUrFVqIJ This Pepsi ad is so unrealistic. Those protesters would have been Dr. Pepper Sprayed. https://t.co/oNjjtm6eFu GOP Senators may push through Neil Gorsuch with the “Nuclear Option,” which also happens to be the name of Trump's  bronzer. RT @colbertlateshow: Hi Stranger. Do you watch The Late Show with Stephen Colbert? It's ok, you can look... Tune in tonight at 11:25/10:35c… Crayola is retiring the \"dandelion\" crayon. I feel bad for kids in the future who won’t know what the color dandelion tastes like. RT @colbertlateshow: Tonight! Former President George W. Bush is a man of few words, but he had a couple about Trump's inauguration. #LSSC… Hawaii judge extended the block on Trump's travel ban. So instead of saying 'aloha' to the ban, we can say 'aloha' to the ban! George W. Bush reportedly called Trump's inauguration \"some weird shit.” And that’s from a guy whose VP didn't have a pulse. BREAKING: MICHAEL FLYNN FLIPPING HARDER THAN A MONSTER TRUCK! https://t.co/bqgMdDZ7oH RT @colbertlateshow: Great news: we've got more Late Show! Join us for a special taping on April 6 at 5pm. Grab tickets while they last! ht… When the sculptor ALSO isn't allowed to use his hands. https://t.co/en0iXZxuSb RT @colbertlateshow: Tonight! @DevinNunes vows to keep his source hidden from everyone except the President while he leads the #TrumpRussia… The Trump admin has one Russian connection nested inside another and another. I can’t think of the right metaphor. Everlasting Gobstopper? It would be an HONOR. (Watch your back, Jeffrey!) https://t.co/L6Xl7EwvBN RT @colbertlateshow: Tonight! Trump claims his rollback of Obama's environmental protections won't hurt the earth, but nature begs to diffe… So happy to be back! #LSSC \nhttps://t.co/8otO7XwNg1 Tonight, we are back from break. Anything important happen last week? #LSSC https://t.co/NISI8oQzhX RT @SuzyNakamura: Hey! I made the hometown paper! #ChiGirl #secondcityfamily https://t.co/rHYlDsgwnT Happy Birthday to @WilliamShatner. May The Force Be With You! Happy Birthday to friend of The Late Show, Matthew Broderick! Too bad he's sick in bed today. Wait a minute—THAT WAS A DUMMY. Tonight on The Late Show! Why am I cuddling with Ryan Reynolds? I don't care. It happened. #LSSC https://t.co/4YDLCVflH5 Spring Cleaning Tip: burn it all and collect the insurance money. RT @colbertlateshow: Tonight! Stephen's analysis of Trump's budget plan is interrupted by an American hero with a #WERD to share with the L… RT @colbertlateshow: To celebrate #StPatricksDay, here is a much happier version of the song \"Danny Boy.\" Happy #StPatricksDay from the Lat… Go you, NU! #PoundTheRock The Trumpcare bill is a lot like Julius Caesar - not going to make it out of the Senate alive! #IdesOfMarch RT @colbertlateshow: A message from @toonDonaldTrump: My fellow Americans, as you know #MarchMadness is upon us. Gaze in wonder at my treme… RT @colbertlateshow: Tonight! Stephen's fascinated by the possibility that Trump leaked his own tax return, setting in motion the @maddow e… Hey @inagarten - you said you &amp; Jeffrey were having a quiet night in, but I saw that your table is set for six. What's that about? https://t.co/tfDaGIgXnE BREAKING: I've got Trump tax returns. Tonight, 11:35pm ET CBS.\n                                                         (Humorously). I had to work thru the storm and didn't have time to drink hot cocoa so I had to resort to snorting a line of Swiss Miss. I'm really enjoying my copy of @inagarten's \"Cooking for Jeffrey,\" but noticed there's still no release date on \"Cooking for Stephen?\" Because I could not stop for Death/\nHe kindly stopped health insurance for 24m people/and said, \"but look how much money we're saving!” RT @colbertlateshow: Sneak peek: Ewan McGregor talks to Stephen about playing Lumiére in @beourguest and brushes off the controversy surrou… Hey @inagarten, saw you baked elephant ears. Thought we had plans? Had to make them alone. (easy &amp; delicious, thanks for the recipe!) Wow, tomorrow's storm seems intense! Just check out this meteorologist. #StormStella https://t.co/dMD9Hz1Ria Attorney General Jeff Sessions asked 46 US attorneys to resign. Is there any chance he'll lead by example? Walking out of work on a friday like... https://t.co/kNEsfgSKlH https://t.co/QqJbWn3B0n Let’s get #Trumpcare trending to spread the word that Trump doesn’t want us to call his Trumpcare proposal \"Trumpcare!\" #Trumpcare Hi Todd. Nice cat. See ya next week! https://t.co/SzleiN6JA9 Very sad to hear of the passing of Joe Rogers,\nco-founder of Waffle House. I lift a glass of sausage gravy in your honor, sir. Also tonight! America's Former Top Spy tries to un-spook me. #weepingangel https://t.co/HzKwQa0xr4 Yeah, tonight! https://t.co/UU31MuyomN RT @colbertlateshow: Tonight! Trump's weekend tweet-storm is still making waves. #LSSC https://t.co/EqgZGQNKth Big Bang Theory is FAKE SCIENCE. I'm toldd Sheldon doesn’t actually have a PhD and his real name is Jim. Bad (or sick) guy! How low has Obama gone to nott return my texxts about going kitesurfing with me. This is Nixon/Waterworld. Bad (or busy) guy! I herby\nHeer by\nHerebai\nHer bae\nHere Bye Bye Bye\nHerbie the Love Bug\nHerpetologist\nHere boat\nHorton Hears a Bye\nHere Let The Byes Out https://t.co/m2ecqQfA8E RT @colbertlateshow: Tonight! Revelations about the Trump administration's Russian ties continue to leak out. #LSSC https://t.co/0kwE5TcCkO RT @colbertlateshow: Tonight! With this much smoke in Washington, there must be a fire. #LSSC https://t.co/ztyHzC8M3A Trump's team promised to repeal and replace but have so far have only managed to resign and recuse. Dow passes 21,000 for 1st time thanks to belief in the 'new Trump.' Wall Street knows best since they never ever get duped by billionaires. If it walks like a duck and quacks like a duck, but then stops quacking for an hour, it's being pretty presidential and is not a duck. RT @colbertlateshow: Tonight! Stephen reacts to the reactions to Trump's \"surprisingly Presidential\" speech to Congress. #LSSC https://t.co… Still waiting. https://t.co/7fxymAd0XP Getting ready to watch Trump's address to a JOINT session of congress. There’s a clue in this tweet about how we’re going to get through it. Get the butter and maple syrup ! https://t.co/FyButyymlA Today, Trump repeated that the press is the \"enemy of the people.\" Food for thought...and we cook it up Monday with Jon Stewart! #LSSC Tonight! Donald Trump wants everyone...or no one... to have nukes!  That's just great...or That's just great! #LSSC Don’t (RUSSIA) let this (RUSSIA) press (RUSSIA) issue distract you (RUSSIA) from (oh my God RUSSIA) Trump’s ties to Russia. (RUSSIA!) Let's light this candle! https://t.co/NJ3tEMYCMJ RT @colbertlateshow: Tonight! What does 'Democracy Dies in Darkness' mean to you? #LSSC https://t.co/ib9NZ5prVv WaPo's new slogan is \"Democracy Dies in Darkness.\" It's meant as a warning, but right now, it feels more like a prophecy. RT @colbertlateshow: Tonight! Trump believes he 'really started something' by hiring Dr. Ben Carson to lead the Dept. of Housing and Urban… No, YOU'RE crying! https://t.co/vquQytRigJ Sweden needs our thoughts and...explanations what the hell Trump's talking about. #SwedenStrong https://t.co/FAUKVqpGtl What a talented and attractive bunch! https://t.co/EXWnMvWOF8 RT @colbertlateshow: Tonight! Stephen (and Sweden) would like to know what Donald Trump's been smoking. #LSSC #NEVERFJORGET https://t.co/1i… Happy Presidents' Day, Steve Bannon! Trump tweeted that the media is \"the enemy.\" Assuming he meant \"the enema,\" given how the media is constantly making him lose his shit. Watch the Late Show go LIVE on 2/28 right after Trump’s address to Congress! I can’t believe I just typed that! https://t.co/DT5s7n0hZo @RealMommaGump FACT: Sally Field can’t actually fly, despite lying to us for years. #FakeNuns RT @colbertlateshow: Tonight! Stephen reacts to President Trump's first solo #StressConference. #LSSC https://t.co/6u81cZuQmn Waiter: Can I start you off with something to drink?\nTrump: I HAD THE BIGGEST ELECTORAL COLLEGE VICTORY! Tonight! So much crazy, so little time…#LSSC https://t.co/VWJ6Rz4VrX Just when you thought you couldn't love Oprah more... https://t.co/SB1rsHdgBp Если вы можете прочитать это, вы слишком близко (к Путину). #СделатьАмерикувеликойСнова! Rep. Jason Chaffetz says he won't investigate Michael Flynn. Evidently he's too busy investigating The Case of the Missing Spine! Tonight! Out like Flynn! https://t.co/FUkuyhVHSk \"I dare you to smell it.\" https://t.co/1ec0NWGFuh \"Who ordered the shrimp, and who launched the ballistic missile?\" https://t.co/i0OymVsoYC Tonight! My favorite new shows! #anyshowanytimeanywhere https://t.co/jRzfPWRdPk See you tomorrow, Steve? https://t.co/WPRM3783UN RT @colbertlateshow: Late Show exclusive: #LegoBatman and #LegoStephenColbert test the limits of their friendship. Watch tonight! @LegoBatm… Please please please represent yourself in front of the Supreme Court. I'll never ask for anything else ever again. https://t.co/kNqncAijFN Trump’s new executive order will protect \"the blood of our youth.\" Or at least the white blood cells. Stay warm tonight, with @DavidOyelowo and me! #FlakeNews https://t.co/gWEloJSie0 SEE YOU IN COURT WHERE WE ALREADY ARE BUT A DIFFERENT COURT SHUT UP NO YOU'RE STUPID! Sir, this is two sentences. It shouldn't be a comma. It should be a period. #GrammarNeoNazi https://t.co/tFjqCzorH2 Look who stopped by tonight? Jon Oliver, the little lad from Bedford! https://t.co/UlBwC9mr8Y Over 135k people listened to the audio-only livestream of #9thCircuit hearing. Because Justice is blind but She's not f*cking deaf. Elementary math under Betsy Devos\nQ: Ned and Sheryl each have 4 apples. Who has more apples?\nA: Whomever Mike Pence decides has more apples. @jammybastard I'm more a Chronicles of Corum fan. #Vadhagh4ever #Arioch2020 Tom Brady has cemented his spot as the GOAT! So weird. Just last year, people were calling him a CHEETAH! To be clear- the only plan Rachel Maddow and I have is our weekly couples yoga. #Namaste Wake up, sheeple! Bowling Green was an inside job! (inside Kellyanne Conway's head) #StayWoke #BowlingGreenTruth Thoughts and prayers tonight. Minus the thought.  #prayforwafffles https://t.co/0dGvSxIsc5 Uber's CEO left Trump's business advisory council. Good news is, since Uber was the one to cancel, Trump doesn’t have to pay the $10 fee. Happy Black History Month! Or as the Trump Administration is now calling it, \"All History Month.” Tonight, we settle it. https://t.co/3VzMkg5VOs Trump has selected Judge Neil Gorsuch for his Supreme Court nominee. He celebrated by eating Merrick Garland’s heart. Who is this charming hobo joining me on stage? Find out tonight! #OldSchool https://t.co/ZhDN4yysbN See ya at 11:35! #MouthsOpen https://t.co/7fFe8J9f8s John Hurt's Richard Rich in \"A Man for All Seasons\"- a paragon of heartbreaking human weakness &amp; model for many of my characters. #But4Wales https://t.co/U1tUakqie4 Happy Chinese New Year! It's the year of the cock! (For the next four years.) Cheer up, Mr. Trump: Your inauguration crowds may not have been huge, but the petition to release your taxes broke the White House record! Best. Nap. Ever. #ChanceTheNapper https://t.co/OJmGgk1L1g If I were the architect for Trump's Wall I’d build a secret exhaust port the size of a womp rat so the rebels could save the Republic. My reaction to anyone who didn't love Mary Tyler Moore. #LoveIsAllAround https://t.co/erLfAd4RmY My favorite endangered species in #BadLandsNationalPark is either the Black-Footed Ferret or the Brass-Balled Tweeter. Trump’s Presidential Library will be divided into two sections: “Non-Fiction” and “Alternative Facts”. Trump says three to five million people cast votes illegally. Man, he’s really taking Meryl’s Oscar nom hard. Tonight! I am the Boy in the Billy Bubble! https://t.co/Szy2FNaQOf Meanwhile...quite a few people here, too. https://t.co/fK8nG5PHe1 @seanspicer gave the BIGGEST press briefing in HISTORY! Period! 1.5million reporters there:SCHOOLED! CAPSLOCK MEANS IT'S TRUE! #SUCKITfacts Pope Francis offered some words to Donald Trump today. The sentiment was appreciated and all, but exorcisms have to be performed in person. See ya tonight! #MakeAmericaTieAgain https://t.co/UJ2xLAqDJv Earth had its record hottest year for the third year in a row. Two more, and we all get to live on the set of Mad Max! Friday's edition of my assistant Caroline's Hunk-O-Day. #couldntagreemore https://t.co/1GvW0aOiEN Ready for a bright future! #Trump2020! https://t.co/5O4RpCHPie The Mexican government has extradited El Chapo to the US. We all owe Trump an apology- Mexico IS sending criminals. Tomorrow night, Pres. Trump's first dance will be to Sinatra's \"My Way,\" while many Americans will be singing \"Fly Me To The Moon.\" Tonight: an old friend stops by to say goodbye to Obama. #HisSuitsAreLooser https://t.co/0A8b3TQFLr Putin says Trump is popular with the ladies. Makes sense. Why else would 200,000 of them be visiting Washington this weekend? Bill O'Reilly will interview Donald Trump during the Super Bowl pregame. ♫ Are you ready for some SOFTBALLS! ♫ Trump Singles is a new dating site for folks who've recently repealed a relationship without a replacement plan. What was so bad about Vine?What was so bad about Vine?What was so bad about Vine?What was so bad about Vine?What was so bad about Vine? Trump says NATO is \"obsolete\" because it was \"designed a long time ago.\" Shhhhh, nobody tell him how old the Constitution is. After reading that Director Comey was grilled over the Weiner investigation, I suddenly crave bratwurst. @JonBatiste Beautiful conversation with @repjohnlewis (Lookin' good, Jon!) https://t.co/Uct9EjFJKa RT @colbertlateshow: Tonight! Which holidays will PEOTUS attack next? #LSSC https://t.co/0knWStek1R I stand with legendary civil rights hero @repjohnlewis. And sometimes crowd-surf with him. https://t.co/wUtobFDIDq Butter. Shrimp. Hominy. Sunday night supper. #thelittleworld https://t.co/Qd6sKLeFtS Attn:@realDonaldTrump @repjohnlewis is my friend, and yours, whoever you are, whether you agree with him or not. #Leadwithlove #goodtrouble Millennials are making 20% less than baby boomers did at their age. I want to react to this news properly—what’s the opposite of “YAAAS?\" Trump said he'll be the \"Greatest Job President God ever created.\"   What does that means for the rest of us? Check out The Book of Job. RT @colbertlateshow: Tonight! Stephen avoids taking part in this torrent of yellow journalism. #LSSC https://t.co/FCHi219ON3 Trump called Buzzfeed a “failing pile of garbage.” Which is weird, since their quiz result was actually “raging dumpster fire.” This is all just liberal media spin. Those Russian women had both just been stung by jellyfish. Should we be worried about President-elect Donald Trump? Depends. Julian Assange is in grave danger of losing his title as \"World's Most Notorious Leaker.\" RT @colbertlateshow: Right now! Join us on #FacebookLive where @toonDonaldTrump is live tweeting #ObamaFarewell #LSSC https://t.co/9JbRWXy4… Hey players, just 9 days into 2017 and I'm still holding strong on my resolution of referring to more strangers as “player.” View out my train window. Not sure if I'm on the Acela or Snowpiercer. #HailWilford https://t.co/hd2ZOBOeeF Finally, a life raft of reason in the social media stormscape! @RealRBHJr speaks from the heart, mouth, and groin. https://t.co/cSuyMrTZiN Trump’s DC hotel charges $24 for a cocktail, but for some reason, White Russians are on the house. Tiger Woods says he was impressed by Trump's golf game. Makes sense, Trump is known for winning with the lower number. @jdickerson I see your transmissions and raise you differentials. https://t.co/29ddmoh6Co Free marijuana will be given out on Inauguration Day to protesters. Half will march to the White House, the other half to the White Castle. Oprah said on the show tonight that I would get more Weight Watchers points than she would. And that, my friends, is white male privilege. My New Years resolution is to travel more. I want to explore exotic places I've never been, like Machu Picchu or the gym. Happy Birthday to J.R.R Tolkien. Aur Onnad Meren!#TolkienBirthdayToast https://t.co/Hvsg7V0agy Go 'Cats! #PinstripeBowl #AnyTheaterMajorsOnTheTeam? It was a joy to share even a moment with her. https://t.co/KUOhTtspcM Boarding my flight. Wow. #ClassWarOnChristmas https://t.co/4cfluta6Zd I am the King of Christmas. Your King commands you to be Merry!! https://t.co/SnoRUQcEae Enjoying the holiday fire pit with some old friends. #2010Games #vancouver2010 https://t.co/9uccf8cytH On the guest bedroom door. A prized memento from my first appearance on Late Night w/ Conan. #HappyHolidays https://t.co/iyKtTjkNyb I'm playing THIS at my Christmas party! Joy with Jon! Some Bubbly with Batiste! Yeah! https://t.co/2m8ZK0clyc It's not a Christmas Carol, but it is seasonally appropriate music with me and Michael Stipe! \nhttps://t.co/9jiMI3k43E Building a snowman is great for family bonding and even better for teaching your kids about the ephemeral nature of existence! Facebook's adding a “Fake News” warning. Ok, but where is the \"Your ex went on vacation with another guy and posted cute photos” warning? Trump met with Apple CEO Tim Cook today. Trump and Apple have a lot in common, mostly that they both put “i” before everything. Donald Trump compared Paul Ryan to a \"fine wine,\" which is a compliment, if you've never had Trump Wine. To: New Energy Secretary Rick Perry- How bout we power the country with a turbine connected to the founding fathers rolling in their graves? RT @colbertlateshow: Good grief! It's a brand new Christmas Special starring Santa Claus and @stephenathome. #LSSC https://t.co/oFqnR5WxkG It's not just Russia hacking our election. I heard the Golden Globes are being controlled by the Hollywood Foreign Press!! Do you think Hillary Clinton will watch her Facebook 2016 Year in Review? Trump won't attend daily U.S. intelligence briefings. Apparently, they're a schedule conflict with his Russian intelligence briefings. Trump has appointed a third Goldman Sachs executive to his economic team. One more and we get a free financial crisis! \"Survivor\" creator Mark Burnett may help with Trump's inaugural. Makes sense — Trump was elected by the Tribal Council. A former WWE exec will serve in Trump's administration. God, I hope his presidency is also staged. Michael Flynn's son got fired from Trump's transition team today for spreading fake news. Look forward to seeing him regularly on @CNN! RT @colbertlateshow: Tonight! Stephen and Joe call a Family Meeting! #LSSC @VP https://t.co/tUzxRbnxeB A quick preview of my 2016 year in review. https://t.co/96XDd4RCwu Dinner ⭐️⭐️⭐️⭐️ \nService  ⭐️⭐️⭐️⭐️ \nCompany 👹 https://t.co/Kq8OSIvW1d They say the camera adds 10 pounds so if you watch tonight's show closely, you'll see I hired two new camera operators. Elaine Chao has been picked for Transportation Secretary. She'll be in charge of all the busses that Trump throws people under. Today is #GivingTuesday. In addition to donating to your favorite charity, try giving zero fucks about Trump's tweets! Trump’s #CyberMonday special: all tweets only 20% fact-checked!"}