{"tweets": "Not all tech ⚖️ is the same. #DigitalWellbeingExperiments is a set of tools and apps to help you find your unique focus. https://t.co/VT6UxJFPkG With #Android10, notifications can capture your attention 🔔 or block out distractions 🔕. The choice is yours. https://t.co/tDS8DeMjvj For the first time, your #Android 📱 can directly pair with hearing aids. Jon Hurwitz from the Android Bluetooth team explains how it’s possible. https://t.co/Q1tTSB35m0 Now you can automatically caption media playing on your 📱 with #Android10 on #pixel4. That’s videos, podcasts, and audio messages without wifi or data. https://t.co/G5CH4ahoIh Powered by #Android10, the #pixel4 has arrived. Enjoy more ways to customize, control your privacy and get things done. https://t.co/9UZ0v4M31J The #OnePlus7TSeries is shipping with #Android10. Enjoy all the helpful features and secure privacy controls at your fingertips. https://t.co/9PfsiZ8nfP Goodbye distractions, 👋 Focus mode. Temporarily pause apps with just a tap on #Android10. https://t.co/c3sN0cR3HZ @DonnHa Hi there. Can you give us more details with what's going on, what device you're using and where you're located? We'd like to help! #Android Emergency Location Service technology helps first responders across the world reach people in need. https://t.co/mxy5B67XPC As tech evolves, so does security and privacy. Check out the latest features, like Incognito mode in Maps, coming to your #Android 📱. https://t.co/0d32OZOTvN @ioovds Thanks for the info. We recommend reaching out to Amazon. They should be in the best position to help. From captioning videos, podcasts, and audio messages to amplifying sound to match your personal preferences, Brian Kemler explains the features #Android has that make audio possible for everyone. https://t.co/rwJHqea4xz @ioovds Hi there. Can you give us more details with what's going on, what device you're using and where you're located? We'd like to help! Set ground rules to help your kids learn, play and explore online with Family Link on #Android. https://t.co/nycs9Q9EYS 65% of parents want to use technology to improve their family’s Digital Wellbeing. That’s why Family Link tools on #Android are available to parents to help their kids find the right tech balance: https://t.co/VqNs7fIiia https://t.co/TvtxBkHlZV The new #OnePlus7T is the first device to ship with #Android10. It’s helpful, secure, and a 10/10. https://t.co/QX3Q30hALq The latest Family Link features on #Android gives parents the tools to monitor their kids’ screen time with ease. Add bonus time for kids straight from your 📱. https://t.co/858ZTlBqNH With Family Link on #Android10 parents can set app time limits to help their kids form healthy digital habits for when they’re working or playing. https://t.co/lrbfxgf1JO Clearer 🔊, fewer steps. #Android10 now has built-in support for hearing aids. https://t.co/Bddj191wR2 New features on Family Link make it easy for parents around the world to manage kids’ screen time. Hear more from Mindy Brooks on how easy it is to access on #Android. https://t.co/7JMFloyxoV @tg_izzuddin Understood. You should be able to cast using iOS devices from Chromecast enabled apps. However if you are unable to do so, on your remote, press and hold the mic button. Then say, \"OK Google, send feedback,\" and tell us about your experience. We'd like to look into this. @cre8iveMLQ Hi Michael! Would you be open to sharing your feedback with our engineering team? If so, on your remote, press and hold the mic button. Then say, \"OK Google, send feedback,\" and tell us about your experience. Thanks! @LSG67 Hi there. Would you be open to sharing your feedback with our engineering team? If so, on your remote, press and hold the mic button. Then say, \"OK Google, send feedback,\" and tell us about your experience. You’re in control of your privacy with #Android10. Enjoy new, smarter controls that let you decide when your data is shared. https://t.co/tlVVIiSTXm We conducted research to learn how people hold their phones, how they reach, and what parts are touched the most, so that when you 👈👇👆👉 on #Android10 it’s quick and smooth. https://t.co/WGNJcBY6yH Tens across the board. #Android10 is here and more helpful than ever. https://t.co/4FpJ4UoNRh With new updates come new questions. For the latest tips and tricks, check out our new #Android Community: https://t.co/SJh9nH6BAD https://t.co/BqG1IHwUPw Our partnership with @CochlearGlobal and @ReSoundGlobal makes it easy to connect, pair, and hear clearly using hearing devices on #Android10. https://t.co/JJcnGomtAg #Android10 is here 🎉 and ready to help. Full of new and familiar features, Android is more inclusive, accessible and safer than ever. https://t.co/uszOlbGm6P @Schalkboi Thanks for the info. We recommend reaching out to Netflix. They should be in best position to help. @HelgeKeck Hi again. Sony can help with this. You can find their support and contact info here: https://t.co/xJQd0ReR7y. Hope this helps. @jithzmail Hi again. Sony can help with this. You can find their support and contact info here: https://t.co/xJQd0ReR7y. Hope this helps. @tg_izzuddin Hi again, Edin. We’d love to know if the troubleshooting steps helped. Keep us posted. @Schalkboi Hi Schalki. Can you give us more details with what's going on, what device you're using and where you're located? We'd like to help! For the first time ever, the robot is officially part of the new #Android logo. https://t.co/8qC5x8Aqlm @tg_izzuddin Hey Edin! With Chromecast, you can play videos, games and apps on your phone, and it will show on the big screen. Read more here: https://t.co/kWv03wj7GM. Let us know how it goes. @annie_m282 You're welcome! That's great to hear. Reach out if you have any other questions in the future. @jithzmail Hi Jithin. Just checking in, are you still facing this issue on your Android TV? Let us know. @annie_m282 Hi Anna. Just checking in, are you still facing this issue? Let us know. @santoshkrishna Hi Santosh. Just checking in, are you still facing this issue on your Android TV? Let us know. @HelgeKeck Hi again. Just checking in, are you still facing this issue? Let us know. Android Q will be called #Android10. As a global operating system, it’s important that the release names are clear and relatable for everyone in the world. Learn more: https://t.co/VKBcoSBGLt https://t.co/Ek7izFEnuq Say 👋 to #Android’s new look. Brand leads Aude Gandon and Sydney Thomashow share how Android’s new brand identity is built for everyone. https://t.co/xDNuGHjZvb @Dennis063 Hi Dennis. We recommend reaching out to the app developer for help with this. Hope that helps! Let AR guide you every step of the way. Live View puts ⬆️⬅️⬇️➡️ in the real world to help you navigate unfamiliar places. The beta feature is now available on #Android devices supporting ARCore. https://t.co/Qtk1tYd3Ri @HardWired Thanks for the info! Let's make sure our Android TV team gets this feedback. On your remote, press and hold the mic button. Then say, \"OK Google, send feedback,\" and tell us about your experience. @oysta Glad to know its working! Reach out if you have any other questions in the future. We're just a tweet away. @suneeshtr Hi again. Just checking in, are you still having trouble with Android TV? Let us know. We're here to help. Accessibility product manager Brian Kemler explains how Live Transcribe, Live Caption and Sound Amplifier make audio possible for everyone, everywhere. Learn more: https://t.co/9PNag4x8Jd https://t.co/y9RPCnmtVU @suneeshtr Hi Suneesh. Try your TV off and on again, check that the TV is connected to Wi-Fi, and make sure you're signed in to your Google Account. Let us know if that does the trick! @oysta Hi Christopher. Try your TV off and on again, check that the TV is connected to Wi-Fi, and make sure you're signed in to your Google Account. Let us know if that does the trick! @HardWired Oh no! We'd like to share this with our engineering team. Can you let us know which apps and a bit more about what's going on? Sound Amplifier on #Android uses machine learning to analyze thousands of samples to make it easier for those with hearing loss focus on what they want to hear. Learn more from Chief Internet Evangelist, Vint Cerf. https://t.co/RmDP7eMdLO @jjpietersen Hi again. Just checking in, are you still having trouble with Android TV? Let us know. We're here to help. @Krista_Ln Hi again, Krista. Are you still having trouble with Android TV? Let us know. We're here to help. From crowded restaurants to intimate settings, Sound Amplifier 2.0 on #Android puts you in control of what you want to hear no matter where you are. Download the app today: https://t.co/6avvEXTfoi https://t.co/grJpdKrA8N @Krista_Ln Hi Krista. Here are a few things you can try: Try your TV off and on again, check that the TV is connected to Wi-Fi, and make sure you're signed in to your Google Account. Let us know how it goes. @jjpietersen Hi there. Here are a few things you can try: Try your TV off and on again, check that the TV is connected to Wi-Fi, and make sure you're signed in to your Google Account. Let us know how it goes. @HelgeKeck Hi there! Here are a few things you can try: Try your TV off and on again, check that the TV is connected to Wi-Fi, and make sure you're signed in to your Google Account. Let us know how it goes. @sunny_shehry Understood. Let's make sure our Android TV team gets this feedback. On your remote, press and hold the mic button. Then say, \"OK Google, send feedback\". Thanks! @sunny_shehry Hi Gurpreet. Here are a few things you can try: Try your TV off and on again, check that the TV is connected to Wi-Fi, and make sure you're signed in to your Google Account. Let us know if that does the trick! Sound Amplifier uses machine learning to amplify sound and filter out noise for people around the world. #Android https://t.co/VnSdMtcuLF @zerobudgetgamer Hi again. Are you able to provide the info listed above? Let us know, we're here to help! @saurpal Just checking in, did the troubleshooting steps help? Let us know. We’re here to help. @Ryadav9496 Mind if we jump in, Ranjeet? You can use OTT boxes or dongles to convert your TV to an ATV. To know more about the various options available in market for your TV, visit here: https://t.co/ZVX5hH8De3. Hope that helps! @Ashoksaini11223 Understood. Let's make sure our Android TV team gets this feedback. On your remote, press and hold the mic button. Then say, \"OK Google, send feedback. Thanks! Amplify what you want to hear and minimize what you don’t with Sound Amplifier on #Android. See how it uses machine learning to augment sounds with two simple sliders: https://t.co/9Q3Pr3P4Ci https://t.co/y6jNTmFSJ7 @saurpal Hi Saurabh. Here are a few things you can try: Try your TV off and on again, check that the TV is connected to Wi-Fi, and make sure you're signed in to your Google Account. Let us know if that helps. @JeeEssKay Hi Gurpreet. The Prime Video app is only available on selected Android TV devices right now, with more coming soon. Stay tuned! @FrankSchwaak Thanks for sharing, Frank! Let's make sure our Android TV team gets this feedback. On your remote, press and hold the mic button. Then say, \"OK Google, send feedback,\" and tell us about your experience. @suku_patel_22 Hi again. Let's try to figure out what's going on. Would you be open to sharing your feedback with our engineering team? If so, on your remote, press and hold the mic button. Then say, \"OK Google, send feedback,\" and tell us about your experience. @Ashoksaini11223 Hi Ashok. Please make sure that your phone or tablet is connected to the same Wi-Fi network as your TV. If that doesn’t work, here are a few more tips you can try: https://t.co/pm56lEwjU3. @zerobudgetgamer Hi there. That's not the experience we want you to have. Can you give us more details with what's going on and where you're located? We'd like to help! @abdulamjath1 Hi there. Not all apps work with Chromecast. Here’s a list of apps you can cast to your Android TV: https://t.co/TRtXYHHs4o. Hope that helps! @suku_patel_22 Hi Sukumar. The Prime Video app is only available on selected Android TV devices right now, with more coming soon. Stay tuned! @rodneyrobbin Hi there. The Prime Video app is only available on selected Android TV devices right now, with more coming soon. Stay tuned! @leydan33 Hi Dan. The Prime Video app is only available on selected Android TV devices right now, with more coming soon. Stay tuned! More @Xiaomi, more fun. Say hello to #MiA3. Enjoy all the benefits of #AndroidOne with built-in Google Assistant, Google Play Protect, and more: https://t.co/OTfrTqlGuw https://t.co/TcG1MBoFJ8 Starting with #AndroidQ, enjoy a new set of emoji including 53 gender-inclusive designs. See what else is new: https://t.co/IqVgbrbxBZ #WorldEmojiDay https://t.co/TRS6YZNaXY @Paul_Sebert Hi Paul. We recommend reaching out to the app developer for help with this. Thanks! @nwithan8 Thanks for your feedback, Nate. Would you be open to sharing your feedback with our engineering team? If so, on your remote, press and hold the mic button. Then say, \"OK Google, send feedback,\" and tell us about your experience. @AB_Prad Hi Abhilash! The Prime Video app is only available on selected Android TV devices right now, with more coming soon. Stay tuned! @aanandkrishna78 Hi Anand. The Prime Video app is only available on selected Android TV devices right now, with more coming soon. #Android is powering the world’s first foldable smartphones. Because of our openness, you can choose the 📱 that’s right for you. https://t.co/CW0KsPcWgX @zukjohan Hi Zuk. Please make sure that your phone or tablet is connected to the same Wi-Fi network as your TV. If that doesn’t work, here are a few more tips you can try: https://t.co/pm56lEeJ2v. Let us know how it goes. @Raem88 Great question, Raem! On some Android TV devices, you can download the Prime Video app now. And it's coming to more devices soon! @krunal_sshah Hi again. Just to check, is the issue resolved? Keep us posted. ICYMI at #io19: #AndroidQ is powering the future of foldables. Hear how the 📱 experience is changing from developer tools lead @leo_sei: https://t.co/tR2jETs3BH https://t.co/VxxpPhDX08 @krunal_sshah Hi Krunal! Here are a few things you can try: Try your TV off and on again, check that the TV is connected to Wi-Fi, and make sure you're signed in to your Google Account. Let us know if that does the trick. AR in Search is all about the details. Bring 🐈 and 🐅 right in front of you at scale and with lighting &amp; shadows that matches your space. https://t.co/rghiBkiUFf @joncrel Thanks for sharing your thoughts and suggestions! Let's make sure our Android TV team gets this feedback. On your remote, press and hold the mic button. Then say, \"OK Google, send feedback,\" and tell us your idea. Happy 🔋, happy ❤️. On #AndroidQ when you turn on Battery Saver, Dark Theme turns on too so you can go further on a charge. https://t.co/7kOKYwMQwT @joncrel Hi again. Just to check, is the issue resolved? Let us know. We’re shining a light on #AndroidQ Dark Theme. This new feature saves battery and works across the system and apps: https://t.co/HnqB0F0TOA https://t.co/VTQBgkxHHu @lrs Understood. We recommend you to contact the Nest team: https://t.co/L3BpJVjzra. They would be best equipped to help you with this. Thanks! You’ve got to see it to believe it. AR in Search on #Android is a new way to understand the world around you. Director of AR experiences Jennifer Liu explains. https://t.co/jgYn2cwM5t History at your fingertips. Explore the place where #Pride began with the #StonewallForever AR experience on #Android: https://t.co/b0S4YctuKe https://t.co/W3dB5oe9Yp @joncrel Hi there. Can you give us more details with what's going on, and where you're located? We'd like to help! @311mg You're welcome. Sure thing, keep us updated on how it goes! @311mg Hi again, Mayank. Just to check, did the suggested steps work? Keep us posted. @lrs Hi Lars. Can you give us more details with what's going on, what device you're using and where you're located? We'd like to help! @311mg Mind if we jump in, Mayank. From your TV’s home screen, scroll down and select Settings. Then, under “remote and accessories,” select Add accessory. Choose your device and you’re all set! If you've any trouble, try the steps here: https://t.co/8ioM69RHxb. Let us know how it goes. AR in Search will have you feline excited. Bring 3D objects from your #Android phone to the real world with these easy steps. https://t.co/KC7egBL5ll Don’t let lack of WiFi get in your way. Live Caption works with or without a connection so you can use it when you need it. https://t.co/M9qrNQhsCG @satishk95637912 Hi Satish. We recommend reaching out to the app developer for help with this. Let us know how it goes! @santosowijaya29 Thanks for confirming and bringing this to our attention. On your remote, press and hold the mic button. Then say, \"OK Google, send feedback,\" and tell us about your experience. @trident_abhinav Hi Abhinav, once you make sure the device you're using to cast (phone, tablet or computer) is on the same WiFi network as the Android TV, open the Netflix app and tap the Cast button. More info: https://t.co/52aq7iHp5V. Let us know how it goes. @kookletsgetit Glad to know that! Let us know if you run into any other issues or questions. @kookletsgetit We can help with that, Rashi! On your Android phone, search “set up my device.” Tap the name of your Android TV and make sure the codes match. Add a Wi-Fi network and your Google Account, and you’re all set! More info: https://t.co/uYYVc4NwX6. Let us know if that helps! @santosowijaya29 Hi Santoso. Just to check, are you using a Brand Account? If yes, you'll need to use a different Google account to sign up and log in to YouTube on Android TV since Brand Accounts are no longer compatible with the new version of YouTube on Android TV. Let us know if that helps! Happy #GlobalWellnessDay. #Android is committed to helping you find the right tech balance with Digital Wellbeing tools like Focus mode and App timer: https://t.co/gY2lFtK3TK https://t.co/NwOXpJ0WXB Live Caption on #Android makes it easy for all to enjoy audio or video. Hear more from Accessibility product manager Brian Kemler: https://t.co/Z2gkMdFPsr https://t.co/Pf845yT8YN @markhachman Hi Mark, while you can't export the transcription, you can copy and save the text. Transcripts are stored locally on your device for three days. Learn more here: https://t.co/yvVbrBlUDw What’s the difference between App timers and Focus mode on #Android? Digital Wellbeing product lead @roselaprairie explains. https://t.co/ZNTaP8vlJr Now your #Android 📱can perform real-time transcription of speech and sound to text on your screen. Available on the Play Store: https://t.co/vqyM3WQV5H Fewer distractions, more #Android Focus mode. Research helped inform the best way to pause apps to keep you on track. https://t.co/0iACrepdq5 Digital Wellbeing product lead @roselaprairie explains how a single tap is all it takes to pause apps with Focus mode on #AndroidQ: https://t.co/pXClEsSP1q https://t.co/WH9OUDOW4R For Huawei users' questions regarding our steps to comply w/ the recent US government actions: We assure you while we are complying with all US gov't requirements, services like Google Play &amp; security from Google Play Protect will keep functioning on your existing Huawei device. We’re committed to making #Android work for all users. New updates to Live Transcribe help to do just that: https://t.co/yvVbrBlUDw #GAAD https://t.co/kMym3sXBdu @DaveLeeBBC @CaseyNewton @backlon Yes, our ML can do it, but it's difficult acquiring a test data set. 1 in 3 U.S. adults have taken steps to improve their Digital Wellbeing. Hear how tools on #Android help you find the right balance: https://t.co/EEcZgVTfDI https://t.co/6vPIwzCmHh #AndroidQ is powering a new category of foldable devices that makes watching videos and texting your friends at the same time seamless: https://t.co/nMqqhcJL8q #io19 https://t.co/kUcGQ2pFuy We’re 👋 bye #io19. Thank Q for joining us this week and be sure to catch up on all the latest #Android features here: https://t.co/9nkq1ROAJx https://t.co/bqPV4cDrb5 Together with our partners, we’re working toward a faster and better future - powered by #5G. #io19 https://t.co/jOuCwLqwLh Simply AR-mazing. Now you can overlay directions and more on the 🌎 itself. See how it works at #io19. https://t.co/QUocAsDpQw With Live Caption on #Android, when speech is detected, captions appear. @RaqamiTV, @rayduenglish, @DurvidImel, and @KasiaGandor explain why it stood out to them at #io19. https://t.co/FyFvWgUwcL Turn on captioned audio across your apps with Live Caption. Hear from Accessibility product manager Brian Kemler on how it works for all: https://t.co/Z2gkMdFPsr #io19 https://t.co/YDSXLO808p Use your voice to control:\nTemperature ✅\nSeats ✅\nMusic ✅\nMaps ✅\nAnd more\n\nThe #Polestar2 is one of the first 🚘 with Android Automotive &amp; Google services built in. Take a brake and hear product manager Aarthi Ramachandran explain. #io19 https://t.co/SmA2sC3Q2K With #AndroidQ, developers have access to tools that make it easy to test and analyze Dark Theme app creations. #io19 https://t.co/QlSlKba9Rt @daviskris10 We're glad to have a hand in making sure digital media is more accessible for all. #io19 @rosegaelle We want to provide you with the tools to get things done distraction free. Check out our video and see how Focus mode came to life: https://t.co/pXClEsSP1q #io19 Keep your charge going even longer. On #AndroidQ when you turn on Battery Saver, Dark Theme turns on too. #io19 https://t.co/DD1M3aRyiy #Android is the first OS to provide captions for almost every app on your 📱. Learn how Live Caption opens up a new 🌏 of experiences. #io19 https://t.co/Ye3jIkO98G @rayduenglish P.S. Happy Birthday 🎉 Q know there’s never a dull moment at #io19. @RaqamiTV and @rayduenglish share what they’re most excited for with #AndroidQ. https://t.co/vYW1DMgzl3 Dark Theme saves battery and works across the #AndroidQ system and apps.  Group product manager Shenaz Zack explains: https://t.co/LoXG6xE6d4 https://t.co/ZOI1M4Fg0r @scharffc Enjoy the rest of #io19, Christelle! And be sure to catch up on all the latest #Android news here: https://t.co/zc6Cs3HvQr ⚡️ “#io19 - Android Highlights”\n\nhttps://t.co/fq5SeSqWHQ @amrikdeol Lights on or lights off, the choice is yours with Dark Theme on #AndroidQ. #io19 Dive deeper into foldables, Dark Theme, and Focus mode on our YouTube channel: https://t.co/zc6Cs3HvQr #io19 What’s new with #AndroidQ? Read up on the latest: https://t.co/6PtejHxD55 #io19 https://t.co/YBBzcoATq8 @Shiru_Munene It was an #io19 Keynote to remember. Glad you were able to watch it all unfold. @TweetsByTimB #io19 doesn't disappoint. Which #AndroidQ feature are you most excited about? @aakash9748 💚💚💚 @ThatAnxiousNerd Don't forget to see if your device is eligible for the #AndroidQ beta here: https://t.co/II3uzINWbk #io19 Focus mode lets you choose the apps you want to pause so you can get things done, distraction free. Hear more from Digital Wellbeing product lead @roselaprairie. #io19 https://t.co/sAQnQWLFbR @SuperSaf You asked, #AndroidQ delivers. Be sure to check out our Dark Theme video to see how it saves battery : https://t.co/HnqB0F0TOA #io19 @jeevan_batla 🙌🙌🙌 There's a lot to love at #io19. Excited for you to experience #AndroidQ yourself. @scheiber Take your Dark Theme knowledge to the next level. See how it works across the #AndroidQ system and apps: https://t.co/HnqB0F0TOA #io19 @neiltwitz But can you pick a favorite #AndroidQ feature? 😉 #io19 Ready for #AndroidQ? Download the beta here: https://t.co/II3uzINWbk #io19 https://t.co/PE9MCpYjzW We’re making Family Link a core part of your 📱. Enjoy new features integrated directly into your #AndroidQ settings. #io19 https://t.co/df4WSEtHeH #AndroidQ arms you with new setting controls so you can share your location (or not) with apps on your own terms. #io19 https://t.co/dGw4TNZixW When you go lights out with Dark Theme you save battery. Hear from group product manager Shenaz Zack on how it works across the #AndroidQ system and apps. #io19 https://t.co/ypo6p15ilH With on-device learning, #AndroidQ prioritizes notifications that matter most. #io19 https://t.co/DY8kQBW0yV The future is unfolding and #AndroidQ is powering it. Developer tools lead @leo_sei explains how #Android’s openness makes it a great fit for foldables. #io19 https://t.co/Lga9LhAcyN 10 years and now over 2.5 billion active devices. Thanks for joining us on this journey. #io19 https://t.co/wC2VcVgEBS RT @Google: #HeyGoogle, let's drive: Coming this summer on @android phones, the Google Assistant’s new driving mode features a thoughtfully… RT @Google: It's on! We're LIVE from #io19 → https://t.co/q8pcMQtEdg https://t.co/ITquJxidwJ @webventil We’re looking forward to sharing some exciting updates, Arne! #io19 #Android hits the stage at #io19 tomorrow! Tune in at 10am PT for all the latest news: https://t.co/gvR7MrFHVl https://t.co/osupxSTwOI @Google Q’ve got to be kidding. #io19 is that soon? .@Qualcomm's  @donnymac explains the important role #Android and its developers play in bringing 5G-enabled apps to your phone. https://t.co/ciYVxc7eIb The power of 5G is unlocked, and now the real fun begins. Hear from #Android Marketing VP @bob_borchers, about the new opportunities available to developers. https://t.co/16B5ZQm65H Whether you want to put your phone down at 9pm or 1:30am, Digital Wellbeing tools put you in control with how to use your #Android tech. https://t.co/pvBBDrUyFH Have you ever been caught off guard by your Dashboard data? Learn how Digital Wellbeing tools encourage change with your #Android tech. https://t.co/8tJ5aXlzJc Use your #Android phone as a security key to log in to your Google accounts without the hassle of Bluetooth pairing. @christiaanbrand explains. https://t.co/EIMUDnmK2j Google and 35+companies are part of the @FIDOAlliance that set the standards to keep your username and passwords under lock &amp; key. https://t.co/6NdZmkjDfV What makes your #Android📱as a security key helpful? It puts the most secure protection against phishers in the palm of your hand. https://t.co/t6jesnFFXj What exactly is a security key? @christiaanbrand shares how it works as extra protection against phishers. https://t.co/f3GcLwBV0A Phishers beware. @googlecloud Security expert @christiaanbrand explains how your #Android phone is your security key to prevent identity hacking. https://t.co/J2RKc7AiFo To get started visit https://t.co/Qnc96u9biA and select 2-Step Verification. Your #Android phone is the 🗝 to protecting your identity. With built-in security, learn how you can keep your accounts safe from phishing: https://t.co/UtPjx6wVo5 https://t.co/DTvNLwHzAU RT @Snapchat: To @Android. Love, Snapchat.  \n#SnapForAndroid https://t.co/MGOFQYa9Cj Fewer taps. More help. The Google Assistant on #Android makes it quick and easy to text. https://t.co/5zAxkUClS1 Grab the 🍿!  The Google Assistant gives Messages on #Android the information it needs to offer suggestions on 🎥, 🍴 and ⛅. Available in the coming months. https://t.co/7aNvTjL8TP The Google Assistant is now integrated into more apps on #Android. Hear the latest from our product lead @theaustinchang. https://t.co/UT0rtV5Ey9 See why Digital Wellbeing UX Director Maggie Stanphill believes tech balance isn’t one size fits all: https://t.co/tNugbuLn0C https://t.co/rVwpS6LM34 Explore what Digital Wellbeing tools have to offer in your #Android9 settings. Life is about finding balance. Digital Wellbeing tools on #Android9 can help you do just that with your tech, across more devices than ever. https://t.co/Y9fPJiakZ9 Does your phone ever keep you from getting 💤's? Digital Wellbeing expert @roselaprairie helps bring tools to life that help you know when it’s time for bed: https://t.co/tNugbuLn0C https://t.co/PbwixMybu0 Good technology should help you get more out of life, not distract you from it. See how Digital Wellbeing tools are aimed to help you get the most out of your #Android tech: https://t.co/tNugbv2XSa https://t.co/l2SlESSr79 Wind down your work week with #Android9. Digital Wellbeing tools, like Dashboard, help inform you about your phone use and help you make intentional choices for how you spend your time. https://t.co/2PLRFcYdSQ ⚡️ “5G first on Android - #MWC19”\n\nhttps://t.co/ggyRughKN8 RT @youtubemusic: ⏰ Go ‘head and ring the alarm! ⏰ Now YouTube Music Premium works with the Clock app from @Google. Wake up *or snooze* to… The Google Assistant is now available with a push of a button on select #Android partner devices. #MWC19 #AndroidMWC https://t.co/X2dVV4AsCl 30 languages. 80 countries. And eight new Indic options. Use your voice to send texts, surf the web, and more on your #Android device. #MWC19 #AndroidMWC https://t.co/cYpvGruNTK People are using the Google Assistant more than ever. #Android and @NokiaMobile made a dedicated button on your phone to make it easier to access on the go, on your couch and everywhere in between. #MWC19 #AndroidMWC https://t.co/PYO5t66ErQ With #Android9, we started rolling out tools for you to manage your digital wellbeing. More on why from @roselaprairie soon - but until then, enjoy your dinner, #MWC19. https://t.co/b2trG08cfl From the beginning, the #Android Open Source Project was designed with limitless creativity in mind.  This openness is making 5G a reality - first on Android. #AndroidMWC #MWC19 https://t.co/BjbUXWBIRg Qualcomm’s massive MIMO and mmWave platform are important enablers making 5G possible on #Android. #MWC19 #AndroidMWC\nhttps://t.co/pFvBfaJiFv 5G on #Android will roll out to countries around the world. #MWC19 #AndroidMWC https://t.co/QrWieHcheN Imagine getting videos, apps, and music on your phone at 10x the speed. That’s 5G, and it’s here on #Android first. Hear what this means for engineers, developers, and users straight from #MWC19. #AndroidMWC https://t.co/1uOFev4Xvq RT @DigitalTrends: With virtual collectible pins at #MWC19, @Google shows how AR will change navigation https://t.co/vJ1DLl6Ady The Google Assistant on #Android makes it easy &amp; fast to make calls, send texts, and get to where you need to go. Find out what’s new with the Assistant at #MWC19 - and how its features are being used around the world: https://t.co/MxXvJZzRoZ #AndroidMWC https://t.co/bxYPfxl2a8 RT @Qualcomm: #5G is only available on @android. @Bob_Borchers, VP, Marketing – Platforms &amp; Ecosystems for Google joins @cristianoamon at t… 5G has arrived, and on #Android first! Thanks to open source contributions and help from @Qualcomm, widespread adoption around the world is a reality. #AndroidMWC #MWC19 https://t.co/qxEemJQTld This week, we’re at #AndroidMWC bringing you our take on what’s new in the #Android ecosystem - from flagship devices to 5G. Stay tuned as we dive deep into the tech and celebrate major milestones with Android partners. https://t.co/eeFxH0sbau From foldables and 5G to #AndroidEnterprise and the power of Google Assistant, we’re excited for the partner innovations pushing mobile technology forward. See how we’re working together to build a helpful tomorrow: https://t.co/ZbboJf4nzL https://t.co/DEasqrfVzb #AndroidOne powers the Google Assistant button on the new @NokiaMobile 4.2. #AndroidMWC https://t.co/idBT4kqYm6 A new set of phones powered by #Android9 from @xiaomi has arrived, including the 5G-enabled #MiMIX3 5G. #AndroidMWC https://t.co/t7yiWEfisu Using just your #Android phone with 🎧, Sound Amplifier filters, augments and boosts the sounds around you to improve listening clarity in any environment. Follow along to see exactly how the technology behind it works. https://t.co/bUBr2iEXcQ Live Transcribe on #Android is built on Google's speech recognition technology. See how it brings transcriptions to phones as words are spoken. https://t.co/bOVELc04vw Dimitri Kanevsky is a Google research scientist who lost hearing when he was one year old. Today, he is fulfilling his lifelong dream - using technology to enable everyday in-person conversations for the deaf or hard of hearing. https://t.co/0fRtu9aLtK RT @Toyota: Ok Google. Add #AndroidAuto to all 2020 Sequoia, Tundra, Tacoma and 4Runners https://t.co/3S8Af4Gxzc https://t.co/J3wdjNk7BJ Did you know around 466 million people around the world are deaf and hard of hearing? See how Android is reducing communication barriers with new accessibility features: https://t.co/IHTAtiO15p https://t.co/pMpKjn8aCt To turn on Wind Down go into your #Android9 settings under Digital Wellbeing to set the start and end times that work for you. https://t.co/gBU22gVM3K Get your tech ready for bed too. With Wind Down on #Android9 your screen will fade to gray to let you know it’s time to 💤 https://t.co/SwhhJlgz58 Find your Dashboard overview under your #Android9 Digital Wellbeing features to see where you’re spending your time. https://t.co/Mei1RrMJlx Trying to maintain a nice phone life balance in 2019? Find Digital Wellbeing tools in your #Android9 settings to help keep you on track. https://t.co/2AysuRhEQv To set app timers, find Digital Wellbeing in your #Android9 settings, choose the specific app from your Dashboard, and set a ⏲️ https://t.co/GZPVfnAXB0 Does 5 more minutes sometimes turn into 50? App Timer on #Android9 lets you set daily time limits on apps to help you accomplish your goals. https://t.co/oyxeuctsLi Enjoy your meal in peace. #Android9 features like Do Not Disturb not only silence notification sounds, but visual interruptions as well. https://t.co/BCnnbI5CD8 Deploying #AndroidEnterprise just got easier. We know trusted Enterprise Mobility Management providers are integral for a successful deployment. See how we’re working to ensure excellence: https://t.co/59Dsjj1FhI https://t.co/UjrOFG0V9y 2018 was a year to remember. From 10 years of #Android to welcoming #Android9 Pie to the family, we couldn’t have done it without you. https://t.co/9JnnVUxGxD @rthur_vsf 🎉 Would you mind if we featured your tweet in a future Android post? @caffeinatedtalk Thanks, Mayur! Would you mind if we featured your tweet in a future Android post? @FcoPardoBaeza Thank YOU! Would you mind if we featured your tweet in a future Android post? @Manojeen Good choice 😂. Would you mind if we featured your tweet in a future Android post? @lucaStronks Thanks! Would you mind if we featured your tweet in a future Android post? @RyanSiemer We're happy to help! Would you mind if we featured your tweet in a future Android post? @luisc1636 We're glad you're a fan, Luis! Would you mind if we featured your tweet in a future Android post? @ZClaw13 ❤️❤️❤️ Would you mind if we featured your tweet in a future Android post? @MPLbroker We love the Digital Wellbeing update as well! Would you mind if we featured your tweet in a future Android post? @niffyat We're glad you enjoy it! Would you mind if we featured your tweet in a future Android post? @AkshanshD Thanks, Akshansh! Would you mind if we featured your tweet in a future Android post? @markciri Glad you're a fan! Would you mind if we featured your tweet in a future Android post? May no dessert go uneaten this season. Search what you see with Google Lens on #Android. https://t.co/iXFuZqevI6 Never miss a 📦 with #Android, Gmail, and Google Assistant. This trio works together seamlessly to track your package from start to finish. https://t.co/lnEpheOuLp Set healthy goals and accomplish them with #GoogleFit 💪 Now you can see progress at glance on your #Android home screen with widgets. Learn more: https://t.co/rMr983sqZz https://t.co/r1qyHqIVpe The journey can be just as important as the destination. That’s why #AndroidAuto is rolling out with new features that make your drive simple, personal, and helpful. Learn more: https://t.co/m7B60MjUDf https://t.co/3xGhG8NiBb Discover the technology balance that’s right for you with Digital Wellbeing features. Rolling out now on #AndroidOne and #Pixel devices running #Android9. Learn more: https://t.co/AQBTFWy37Q https://t.co/C6Dn9l9FNk Gitanjali Rao was inspired to act when she heard of the water crisis in Flint, Michigan. She invented Tethys, a device that detects lead in 💧 that sends results to the app she created using the #Android App Maker. Learn more: https://t.co/PGzluB3vTW #SearchOn https://t.co/UuhQU8OUhU Want help setting up Routines for the Clock app on your #Android? Get it here: https://t.co/7zcAWTpKZ7 Start your day your way with Google Assistant Routines for the Clock app exclusively on #Android. A simple swipe of your alarm clock starts a set of actions automatically, like turning on your lights and hearing a morning news brief. Learn more: https://t.co/t9sebk82Ca https://t.co/WKPQvf6yTU Need to book a car? The Google Assistant on #Android is at your service. Now, you can request a 🚗 and see current pricing for ridesharing in your area. https://t.co/SpTpgDE8uT Right 🎶 at the right time. Play all your favorite tunes on your #Android phone with help from the Google Assistant. https://t.co/txYN8oDPsU Don’t leave your mom hanging. With the Google Assistant on #Android you can set location-based reminders. Just say “OK Google, set a reminder to call mom when I get home.” https://t.co/p9ehOdLXVf Meet Jaehyung Daniel Lee, scuba diver, co-founder and CEO of EMPO, a trading app for mobile data which would otherwise go wasted. Watch his #IMakeApps story: https://t.co/Q9Mkakc0OO https://t.co/w5ZAlzjJyb Let your Google Assistant on #Android find the fastest route home. Just say, “Ok Google, take me home.” https://t.co/BF00MUiW7i Machine learning FTW. Now on Gboard, you can customize emoji style Mini stickers to look like you based off of a selfie. Create yours on #Android today: https://t.co/f11ehoY5oY https://t.co/c8dFr1zHie Oui oui, Paris. Did you know you can take care of your travel needs right from your #Android chat? Do more with Messages like access tickets, order food, and pay. https://t.co/lEUzjZviSf #Android is never too cool for school. Now, students can log into devices managed with Family Link using #GSuiteEdu accounts. Learn more: https://t.co/tBIMV3XU3b https://t.co/lHiJ4lr0CM RT @oneplus: This is the #OnePlus6T. https://t.co/alS5oO1FAC https://t.co/PSZLhYEccx RT @Google: @Android Zombie our guest. This one from @angelahaddad is a no-brainer! #TiltOrTreat https://t.co/JOoYw5DyEa https://t.co/H2J7x… @Google Sorry, needed to braaaiiiinstorm the right Halloween costume 😉 #TiltOrTreat https://t.co/o0XNoGNSpP ⚡️ “#HBDAndroid - 10 years of community”\n\nhttps://t.co/NJ8u0tk50r @saladking814 Customization is key. Thanks for being part of the #Android family. #HBDAndroid @nick_mowen Being helpful no matter where you're standing, that's the #Android way. #HBDAndroid @ashishgsaini You're going to make us blush. Thanks for being part of the #Android family. #HBDAndroid @TheLittleNaruto We wouldn't be #Android without fans like you. Thanks for making our birthday extra special. #HBDAndroid @jacklroberts Thanks for being part of the #Android family 🎉 It’s been 10 years and #Android keeps getting better with age. Take a walk down memory lane to see how far we’ve come: https://t.co/P5CT4b24aT #HBDAndroid https://t.co/VLktfmlKwd We’re saying hello to the big 1-0. From users to developers to partners, it’s been an amazing decade. Tell us your favorite #Android memory using #HBDAndroid. https://t.co/eQMcjUGlpU @atharvafulay Hi Atharva! Our team will look into what you're experiencing. Please follow us &amp; let us know when you do so we can reach out over DM. RT @Google: After her father passed away from a heart attack and her mother was diagnosed with cancer, Val Yap wanted to help others with t… Meet @mateons. He is a robotics champion and the founder of the @HablaloApp for people with hearing difficulties. Watch his #IMakeApps story. -&gt; https://t.co/Q9Mkakc0OO https://t.co/nvfbRK2JB8 Introducing the latest additions to the Google lineup, the Pixel 3 and Pixel 3 XL. All running Android 9 Pie. #pixel3 #madebygoogle https://t.co/9czqwYChpF https://t.co/e1Wrn726Ni Let #Android messages take some time off your hands. Smart reply suggests just the right response to send when you’re on the go. https://t.co/Qsie5ntEVq #AndroidOne is now available in 🇧🇷. The new #MotorolaOne is packed with the latest technology for a smart, secure, and simply amazing phone experience: https://t.co/QlqccdhCx8 https://t.co/as7z2WxTKi RT @GooglePlayDev: As #AndroidDev, you can generate positive social impact through your apps and games. Hear from @MaximFMai about:\n\n🌱 apps… The new intuitive navigation on #Android9 is a favorite of user @debaucherie. With features like rotation you have more control over your phone’s display even when your orientation 🔒 is on. https://t.co/PDwOr9pQ7X RT @madebygoogle: Hey you, we’ve got some big news. Tune in on 10/9 11am ET. We’ll be live streaming it all right here. #madebygoogle https… #Android9 is now rolling out on the Nokia 7 Plus. Harness the power of AI for a smarter, faster phone that adapts to you. #AndroidOne Learn more: https://t.co/gIvfoH8cMu https://t.co/8U0Lzu0AJK Take it from #Android9 user @mnitabach, text select is a game changer. Now, take action by holding down on words or images. https://t.co/o9QJvhPeHf Emergency Location Service on #Android provides an accurate map to call centers so that they can find you quickly and accurately. Rolling out in the U.S. now: https://t.co/NCQQuz3adz https://t.co/vl03dTAYA4 Peace of mind with #Android9. User @dariasteigman’s phone is kept extra safe thanks to Lockdown Mode. It disables fingerprint recognition and instead requires the use of your PIN, password, or pattern to access. https://t.co/bV62cCrttY Want to experience Adaptive Battery on #Android9 for yourself? Go to settings under battery and slide it on from there. #Android9 user @JayLaw1’s phone stays 💪 off the charger. Adaptive Battery learns how you like to use your phone, so the apps you don’t use as much aren’t a battery drain. https://t.co/yz4QdKkQu1 The @ForzaFootball app brings fans closer to the game with live football scores, player stats, football fixtures and live video highlights. Watch the #IMakeApps story from neon light artist &amp; Creative Director Josefin Eklund. -&gt; https://t.co/Q9Mkakc0OO https://t.co/THxU4nRLbW Only want to see the notifications that are helpful to you? With #Android9 you can. Android user @zackster has nothing but 🙌 for his own customized notification stream. https://t.co/4tOZQjIIZp @armastis 💚💚💚 It takes a special device to meet the high standards demanded by field services, manufacturing plants, and more. #AndroidEnterprise Recommended now includes rugged offerings from Zebra, Honeywell, Sonim, PointMobile and Datalogic. Learn more: https://t.co/ccEC9ZNqqQ https://t.co/41zHpd51a9 A playlist created by you, for you. Start your day off with the ‘Wake Up to Google Clock’ playlist on @Spotify: https://t.co/ZWxfEBCT9z https://t.co/Mak0JpB7Sb RT @googlechrome: We hit double digits! Thanks to all of you for making #GoogleChrome’s last 10 years so awesome. https://t.co/grBZusVmel @tonyocruz Smart. Simple. Smooth. We've got a question for you. Would you mind DMing us? @debaucherie We dig #Android9 too. Would you mind DMing us? We've got a quick question to ask. @mnitabach #Android9 is baked with features that make your phone smarter, simpler and more tailored to you. Would you mind DMing us? We've got a quick question for you. @dariasteigman Glad you're enjoying #Android9. Would you mind DMing us? @JayLaw1 All the 😍 for #Android9. Would you mind DMing us? We've got a quick question for you. @zackster Glad you’re loving #Android9. Would you mind DMing us to answer a quick question? @ashokfernandez #Android9 has your back 👌 Get more out of your time with @WearOSbyGoogle. The new design provides quicker access to your information and notifications, more proactive help and smarter health coaching. See what’s new: https://t.co/jjvJOVtSlG https://t.co/yod9gGKePM @LankaweKolla We're glad you're enjoying the new look. The new #GoogleFit app is here to coach you towards a healthier and more active life. We worked with @WHO &amp; @American_Heart to develop a smarter approach to track your health and fitness to get the most health benefits from your everyday activity: https://t.co/clTVXuvrSf https://t.co/udsT9uglum Text from your 📱 or text from your 💻, the choice is yours. Now you can enjoy #Android Messages across devices. Get started: https://t.co/D9TuNeZIPV https://t.co/kJ9vcV56JW @gansjay Hopefully this notification goes through 😉 Here's to more features to love with #Android9 @Joe_Reacher Love is in the details 😉 Glad you're enjoying #Android9. ⚡️ “#Android9 - Packed with smarts”\n\nhttps://t.co/ce7iV8PQpe Find the balance that’s right for your life with digital wellbeing features. Pixel phones running #Android9 can now download the beta here: https://t.co/LUZtE2bLXy https://t.co/X3EkdXmKhc #Android9 brings you a tailored experience. With Adaptive Brightness, your device learns how you like to set the brightness slider to match your surroundings: https://t.co/G5s4AhArPO https://t.co/bCd21FOTuR Adaptive Battery on #Android9 uses artificial intelligence so you go further on a single charge: https://t.co/G5s4AhArPO https://t.co/NlUDOns1uT Navigating your phone is easy as pie with #Android9. The new system navigation uses gestures to help you access your life with fewer taps than ever: https://t.co/G5s4AhArPO https://t.co/raVImxq9ZX #Android9 is built with artificial intelligence at its core, enabling new features like Adaptive Battery and Adaptive Brightness. Rolling out now on Pixel. https://t.co/sWRTlHNm6E Smart, easy, and insPIEred by you. #Android9 is baked with features for an experience that adapts to you. https://t.co/8ajl5lJfeA 🎉 Introducing Android 9 Pie 🎉 \nPacked with smarts and tailored to you. Learn more: https://t.co/LGeZUrz2BV  #Android9 https://t.co/gwUEjqHH1l Start your day with @Spotify and the Clock app from Google, rolling out now. To make waking up a little easier, help us build a morning playlist by commenting with your favorite tune. https://t.co/Z6CGntANTM Did you know Google Photos uses machine learning? Even if you haven’t captioned your pictures, your #Android 📱can surface the ones you’re looking for. https://t.co/XkgOv7inH4 #AndroidOne is bringing its latest machine learning innovations to the new @xiaomi #MiA2 and #MiA2Lite. Enjoy a smart, secure, and simply amazing phone experience: https://t.co/yMHSWesHzh https://t.co/DvZEVPDDTG @waze 🔮🚗  We’re seeing it too Any which @waze you look at it, outsmarting traffic just got easier. Now #Waze is available on the #AndroidAuto app. Access it from anywhere and from any 🚗: https://t.co/G5C0kHP2gw https://t.co/Idu6ut779S RT @sundarpichai: Rapid innovation, wide choice, and falling prices are classic hallmarks of robust competition. Android has enabled this a… #Android has created more choice for everyone around the world, not less. #AndroidWorks https://t.co/Xu3hibsu2k https://t.co/EgudePyR69 Happy #WorldEmojiDay. To celebrate, we’re taking a look at the woman behind the design, Jennifer Daniel. See how she’s changing the game one 🤠 at a time: https://t.co/DzbEkulMSB https://t.co/TCMqKyBKb7 Navigate Brazilian food culture like a pro. Google Translate uses machine learning so you can understand what you’re ordering for over 100+ languages. https://t.co/h8DzmnxYfN Does flying stress you out? Machine learning capabilities on Google Flights can look at historical data to predict delays, even when the information isn’t available from airlines. https://t.co/C9OKEFv8Nt Did you know the Smart Reply feature on #Android Messages uses machine learning? Save time with suggested replies while you’re on the move. https://t.co/s1VmMypkvn Meet Gregory Veret, organic farmer, co-founder and CEO of @xooloosoft_EN, an app that helps kids develop healthy digital habits. Watch his #IMakeApps story #techforgood\n-&gt; https://t.co/Q9Mkakc0OO https://t.co/tViExp0iWQ What is machine learning? Through repeated experiences, your phone is able to learn that a dog is a dog from pre-programmed 🐶 pics. Ahead of the #AndroidP rollout, stay tuned for ways you can use machine learning right now. https://t.co/VJfrQWOFNp Overcoming communication barriers is the basis to make the world a better and more inclusive place. Watch the #IMakeApps story of Manel Alcaide, acrobat and co-founder of @Visualfy\n-&gt; https://t.co/Q9Mkakc0OO https://t.co/etnNVhb2YI @SergioViudes Thanks for sharing your #IMakeApps passion with the world ❤️ @saladhunt An #IMakeApps love story for the books ❤️ Happy (salad) hunting. @THEVISUAPP Thanks for turning dreams into a purrfect reality with your #IMakeApps story. The @polarsteps app is for every passionate traveler to track &amp; share their travels in a beautiful way.\nWatch the #IMakeApps story from adventurer &amp; co-founder Niek Bokkers. → https://t.co/Q9Mkakc0OO https://t.co/YBoM3DaK8A From having her art displayed in the @Guggenheim to developing the #Quiltuduko game, Faith Ringgold is a true pioneer. \nMeet her in this #IMakeApps film. https://t.co/8bO8FtqCOo No matter how you celebrate, do it with ❤️🧡💛💚💙💜. Spice up your phone with one of these new #Pride wallpapers. https://t.co/DcxvouNoy3 @DanAdamsPGH 🙌❤️🙌❤️ @jdnuge Convenience is key. Glad you're enjoying #Android Messages. @neilkanth It is pretty wonderful, glad you're a fan. Apps and games can change lives. That's exactly what @BeMyEyes has done.\nMeet Hans Jørgen Wiberg, the person behind the idea in this #IMakeApps story. → https://t.co/Q9MkaktBGm https://t.co/JaoN07yUKD @ErskineSam ❤️❤️❤️ @Keenan38Keenan 🙌🙌 @marcosjsramos Enjoy! What's your favorite Android Messages update? @prettymskiller We likey too. @Travis_Murdock 👋😍 Up your texting game with new features in #Android Messages. See what’s new: https://t.co/XqHtijIdDf https://t.co/riDsTmoMyH It’s the community that powers #Android. \n#IMakeApps is a celebration of some of the amazing people from around the world who create apps &amp; games. \nWatch their stories → https://t.co/Q9Mkakc0OO https://t.co/BoqXvAtxmE Captions aren’t one size fits all. Create a default look and feel that works for you across videos and apps by choosing your preferred language, text size, or style to fit your needs. https://t.co/HHGMrUCBBQ #Android https://t.co/ui6KH8B2Sw Tap the way that works for you. The touch and hold delay accessibility setting adjusts the amount of time it takes for your phone to take action. https://t.co/8XPxdxjN7v #Android https://t.co/VEnwQvmdwP 1 in 12 men and 1 in 200 women are affected by color blindness. Explore Android’s color correction accessibility settings and see why #Android is for everyone: https://t.co/f1MLGvEzsa https://t.co/qzA2a21G2m Thanks to #Android open source, developers like Matt have access to code and blueprints that enable a more accessible world for all. #SearchOn https://t.co/gdQkmecLWp Matt Landis uses the #Android open source platform to develop new technology for people with disabilities. #SearchOn https://t.co/qvAGQufgt7 @Consulting_LH 🎉🎉🎉 How are you liking #AndroidP? @iLoVePooCh15 Hi there. Have a look at this guide to cancel a subscription on Google Play: https://t.co/rcOpcaU3A0. Let us know if that helps. What’s your favorite way to use the Google Assistant? #Android @Tielur_ ❤️❤️❤️ @OfficialBuffalo Customization is 🔑. We like your #Android style. @DeAfMaCbOi Hi there. Have a look at this article to check for updates on your watch: https://t.co/SJwmLU1E7l. Hope that info helps. RT @GooglePlay: There's creativity behind every mobile game. That's why we’re introducing First Person, a video series spotlighting the ama… @Mstyle183 Thanks for stopping by to say 👋 @DrKsHusband The future is bright...or dark, depending on your surroundings 😉 #AndroidP @GiriSenji We're glad you're enjoying #AndroidP. Discover the speed you need with #OnePlus6 powered by #Android. Watch the livestream at 12pm ET: https://t.co/ZKtzJb6831 https://t.co/pZQUOgsBY8 If you can think it, you can build it. Get crafting with these building apps for #Android: https://t.co/MiJBPgNKyf https://t.co/AhQdt9Ol6U @D7AN_ 😊 @kaanmamikoglu 🎉🎉🎉 ⚡️ “#io18 - Android Highlights”\n\nhttps://t.co/LZw1iRam41 #io18 was a tree-t. What was your favorite #Android announcement? https://t.co/surKB3P6xG Tune in now to the #Android security session: https://t.co/4GMsy3AApi #io18 @syazwanzadin A love that could change the world. @Driftzzilla Welcome to the #AndroidP party. #io18 @Sir_RV 🎉🎉🎉 @IceBearPhotos We're glad you like it. #io18 @GrassTypeMage That's the beauty of adaptive brightness on #AndroidP. Enjoy! #io18 @H_Flx 🎉🎉🎉 @MarcoLerch76 @GoogleDE 👋👋👋 The #io18 keynote might be over, but there’s more to come. Tune in tomorrow to learn about Android’s security advancements: https://t.co/8wEoLcEy55 https://t.co/tv20TcdX4i @kunalneo 🎉🎉🎉 #io18 Miss the #io18 livestream? We’ve got you covered. #AndroidP is built with AI at its core, making your device smarter and easier to use than ever. Learn more: https://t.co/OURRZ2pcJ8 https://t.co/TCnGlKPJWD @theManikJindal 🤫😉 #io18 @michaeljscully There's no such thing as too excited when it comes to #AndroidP. #io18 @divercinety 👋👋👋 @JulianChokkattu @DigitalTrends Nice! You'll have to let us know your favorite features. #io18 @MKBHD So fresh, so clean 👌 #io18 @TheRealEdem 😎 ❤️ #io18 @qbking77 #AndroidP, here you come. #io18 RT @volvocars: We are working with @Google to embed Google Services into our next-generation Sensus infotainment operating system. So you c… RT @lockheimer: A decade of @Android? Time flies when you’re having fun. Thanks for being part of the Android family. #io18\n\nhttps://t.co/0… Technology should help you with your life, not distract you from it. With #AndroidP, new digital wellbeing features like dashboard and app timer help you find balance. #io18 https://t.co/XGc2fMyK1v #AndroidP makes your phone easier to use. Enjoy a new system navigation, easy volume controls and much more. #io18 https://t.co/aa0o5c6uVM Meet ML Kit: a new tool on @Firebase for developers who want to incorporate machine learning into apps. #io18 https://t.co/Sjvjp40Ecj #AndroidP has AI at its core. With features like app actions, your device suggests what to do next. #io18 https://t.co/gqde9VLdqu We know battery life matters. #AndroidP's adaptive battery prioritizes your power for the apps you use and care about the most. #io18 https://t.co/JKEJRWCUiJ RT @Google: Streaming live around the world: here we go, #io18! Tune in → https://t.co/yb35KKEPzY https://t.co/uHIk1bKwmV Let’s do this, #io18. Tune in at 10am PT for a livestream you won’t want to miss: https://t.co/O988lm2R18 https://t.co/q1e2JJHO2m #io18 is kicking off early. Introducing @JBLaudio LINK BAR, a soundbar powered by #AndroidTV with Google Assistant built in. Ask questions, tell it to dim the lights, and enjoy your favorite shows and movies. https://t.co/GGpuaavgMr The pun is strong with this one. @GooglePlay https://t.co/PZikmTbxur Help us Google Assistant, you’re our only hope. #MayTheFourth https://t.co/vttxiTptRj The most important beverage for Friday: blue milk. Good thing your Google Assistant can remind you. Just say, “Hey Google, add blue milk to my shopping list.” https://t.co/P3GcVTylJ5 Ready to kick back after a long day of Padawan training? Share your address by adding Google Assistant to Allo conversations. https://t.co/hnHszDNKGn Play. Learn. Plan. Create. The world of augmented reality powered by #ARCore is ready to be explored: https://t.co/l8rPo3XWrP https://t.co/onqq6c71eJ Hello, feng shui. With #ARCore apps like MeasureAR and @Houzz, decorating your space becomes less intimidating and more fun. https://t.co/sVQyJJz0Ns Embrace the world of augmented reality. Thanks to #ARCore, developers have a better set of tools to create #AR apps faster and easier. Now available for over 100 million #Android devices. https://t.co/rxr8ahG88C RT @GooglePlayDev: Drum roll please 🥁 The third annual #GooglePlay Awards are here.\n\nThis year, we have nominees across nine categories, in… On your mark, get set, #AndroidGoEdition. Enjoy a reimagined set of Google Apps, like Assistant Go, designed from the ground up for people everywhere to enjoy: https://t.co/tc2ajghP1G https://t.co/OPRcJcc3pY Files Go is the way to go. With this light app on Android Oreo (Go edition) easily delete embarrassing selfies to make room for good-looking sunsets. #AndroidGoEdition https://t.co/Zs7gBgFWMQ Get your 🤳 ready. With Android Oreo (Go edition), do more with 1GB of RAM or less. Thanks to smaller app sizes, you now have room to do all the selfie photo shoots you’ve dreamed of. #AndroidGoEdition https://t.co/PUTF36TDfV Consider yourself covered with Google Play Protect on your #Android. Learn how its machine learning security system is constantly keeping your phone safe: https://t.co/sTIVjzZo4L https://t.co/Xrx7ZcBJiU No ifs, ands, or paws about it - with Google Lens on #AndroidOreo, get the 🐶 info you crave in a flash. https://t.co/LHrZ3hjkOT RT @WearOSbyGoogle: Meet #WearOSbyGoogle. A new name for Android Wear that still connects you to all the things you love, right from your w… Calculating the circumference of an #AndroidOreo like…\nHappy #PiDay! https://t.co/ox5bsNkmnO With the Google Assistant on #AndroidAuto, enjoy a new way to send and receive texts without taking your hands off the wheel. https://t.co/aCfxIexPzY #IWD2018 is a time to celebrate the achievements of women all around the world. Watch how these four successful founders in the apps and games industry brought their ideas to life with @GooglePlayDev: https://t.co/Jy7tH1KBWo Twist. Lift. Repeat. Happy #NationalOreoDay from #AndroidOreo. https://t.co/OEAcrvti7U RT @Nokiamobile: We are excited to announce that in addition to #Nokia8, we have three new smartphones, #Nokia8Sirocco, #Nokia7plus and the… There’s nothing like a week of new phones and fun. Not to mention the #AndroidOreo treats. Until next year, #AndroidMWC. https://t.co/EQo7ixiY13 @CsrParga 👋👋👋 @Shaandy92 All the 😍🍦 at #AndroidMWC. The pin game is strong at #AndroidMWC. Can you pick a favorite? https://t.co/238Fv264BC @akshayable Glad we could deck you out with some #AndroidMWC swag 👌 ⚡️ “#AndroidMWC - Android for Everyone”\n\nhttps://t.co/ZgpZHMc50O The Android Works space might seem familiar. That’s because it was inspired by the Android 404 page: https://t.co/Ga1ueLtWlF #AndroidMWC https://t.co/UMIVivayh3 Jump into the world of AR and VR at the Immersion Hub. #AndroidMWC https://t.co/0o5X0UuPg4 There’s lots to be explored at the Exploration Centre. Take a picture with Google Lens and information will pop up on your phone. #AndroidMWC https://t.co/ibx2GIUXIv At the Android Auditorium, test your knowledge and meet the new smartphones for #AndroidOne and #AndroidGoEdition. #AndroidMWC https://t.co/8dNsf5wUME Time for something sweet. The #AndroidOreo station is serving up 🍦 and hot chocolate. #AndroidMWC https://t.co/JZHNkQNlPj Wishing you were at #AndroidMWC? Don’t let FOMO get the best of you. This year, we’re bringing the Android Works space right to your feed. https://t.co/1ttQKO3aNw ICYMI: #AndroidGoEdition and #AndroidOne are growing. Check out the new generation of smartphones introduced at #AndroidMWC: https://t.co/BtSvrEvj8E https://t.co/LLZ6xnTfjv @Hadr1en Nice job! Which pin is your favorite? #AndroidMWC @davidllorca 🍨😍 #AndroidMWC Ready. Set. #AndroidGoEdition. Bringing technology to everyone, Android Oreo (Go edition) makes even the most affordable smartphones as sweet as can be. #AndroidMWC https://t.co/B7W7ZHAtUN @AndyBoxall We just want you to charge up in style. #AndroidMWC @silingt There's no such thing as overboard at #AndroidMWC. Hot chocolate is the perfect beverage to warm up with on a chilly day one at #AndroidMWC. We’re excited to bring you more tomorrow. Stay tuned! https://t.co/jJLgG25a5l With #Android smarts and @SonyXperia looks, the new Xperia XZ2 is ready to free your imagination. https://t.co/1AMfH0nSrq The @SamsungMobile #GalaxyS9 powered by #Android is bringing the magic to #AndroidMWC. https://t.co/OWhH78C2hE #AndroidOne meets @Nokiamobile. Introducing 3 new devices with our smart, secure software to bring you the latest Google innovations and highest grade of security. Learn more: https://t.co/hY4WyZr6fp #AndroidMWC https://t.co/ZTyaVxjM4t Get ready to blend digital and physical worlds with the power of augmented reality. #ARCore 1.0 is now available for 100 million Android devices. #AndroidMWC https://t.co/S3TL93Cugq https://t.co/p1N8b2TFEY 3 days until #AndroidMWC. What are you most excited for? #AndroidMWC, here we come. https://t.co/hYhVehT3vW #AndroidMWC kicks off next week, so we’re taking time to reflect on where we’re at today and where we’re going. Get a first look at what’s in store: https://t.co/Qk7oar811P https://t.co/xz8mcYRwa4 #AndroidMWC is right around the corner. Let’s see if your #Android knowledge is up to date 😉 Do you remember the big announcement from last year? #AndroidEnterprise Recommended makes it easy to find the best devices and services for your business. Learn more: https://t.co/XrYaEfZBDC https://t.co/tFrsK1yfgy Say hello to @GooglePay. It’s everything you ❤️ about #AndroidPay, with new features you'll 🙌. Get the app today: https://t.co/ogBpAwtQc7 https://t.co/jLin0uuUXi @iamlevik Hi Levi. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. Stay tuned. RT @Nokiamobile: Roses are red \nViolets are blue \n+ Android™ = \nPure, secure and up to date too \nHappy #ValentinesDay @Android https://t.co… Reservations ✔️, card ✔️, flowers 😮 Get #ValentinesDay back on track with help from your Google Assistant. https://t.co/M7GJUqevfE @cpsross Hi Cam. Our product team greatly appreciates feature suggestions. You can also submit it in the Android Pay app under Menu &gt; Send feedback. Thanks. @RelayfyLoyalty Hi there. Could you confirm when are you receiving this message? Share more info and we'll do our best to help. @RachelMacey You're welcome. Reach out if you have any other questions. We're just a tweet away. @chaftastic We've heard that, Transport for London had an issue with contactless payments that they've fixed now. If you think you've been overcharged, we recommend reaching out to TfL for assistance. @seoleemiles Hi Lee. Transport for London had an issue with contactless payments that they've fixed now. If you think you've been overcharged, we recommend reaching out to TfL for assistance. @chaftastic @CoopBankUK Hi Matt. Transport for London had an issue with contactless payments that they've fixed now. If you think you've been overcharged, we recommend reaching out to TfL for assistance. @RachelMacey @TfL Hi Rachel. Transport for London had an issue with contactless payments that they've fixed now. If you think you've been overcharged, we recommend reaching out to TfL for assistance. @Jackie_Elle Hi Jackie. Our product team greatly appreciates feature suggestions. You can also submit it in the Android Pay app under Menu &gt; Send feedback. With the Google Assistant now on #AndroidAuto, easily plan your day by saying, “Ok Google, what’s on my calendar?” https://t.co/DIssEKIQAp @chaftastic Sorry about that! We'd appreciate it if you open Pay &gt; tap menu icon &gt; Send feedback &gt; check \"Include system logs.\" @chaftastic Hi Matt. Next time you're there, try keeping your device up against the terminal until the gate opens. @redrangernathan Hi there. Samsung Gear S2 Classic doesn't support Android Pay. Hope this info helps. Rest easy with #AndroidOne. Enjoy protection from sunup to sundown with regular security updates and Google Play Protect built in: https://t.co/OH0WWckLb4 https://t.co/Jh8jPuIKwg Parents can now stay in the loop as their child explores the digital world. With Family Link on your kid's Android device, you can set some digital ground rules to help them out: https://t.co/dyFjqQBoAt #SaferInternetDay #BeInternetAwesome https://t.co/vy4yNLCkQT You might use your devices like a pro, but kids might not be so wise…yet. For #SaferInternetDay, check out how we’re helping them be smart as they enjoy the digital world with the #BeInternetAwesome program: https://t.co/9dToaloL2l https://t.co/ebBTTu1HMr @ItsNickySpacc You're welcome. Reach out if you have any other Qs. We're just a tweet away. @ItsNickySpacc Hi there. Transactions might take up to 10 days for review, sometimes. Have a look at this guide for more info on \"Pending\" or delayed transfers: https://t.co/eDd0z9aVmx. Let us know if that helps. @xricci99 Hi Richard. Have a look at this Forum thread for more info: https://t.co/8lm4wIBemS. Hope this helps. @bifkinuk Hmm. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @weldrake13 Hi James. Have a look at this article on how to verify your payment method: https://t.co/QUzSIS4fYd. Hope this info helps. No reception and burning through data? Now with #AndroidOreo 8.1, get notified of open Wi-Fi networks and connect straight from the notification. https://t.co/MOuTI3Qq59 #AndroidTip: With Smart Text Selection, highlight the address from your friend’s get together and @GoogleMaps will pop up as the next step. https://t.co/WgY1mmubfQ @EdwardCooknz You're welcome. Reach out if you have any questions. We're just a tweet away. @EdwardCooknz Hi Edward. Next time you're there, try keeping your device up against the terminal until the gate opens. If the issue persists, we'd appreciate it if you open Android Pay app &gt; Tap menu icon &gt; Send feedback &gt; check \"include system logs\". @rythem561 It sounds like we're checking your friend's account to make sure there aren't any concerns. Our support team is happy to work w/ him to resolve any issues. Unfortunately, you may not be able to complete transactions w/ him until it's done. @rythem561 Hi there. Could you let us know the error message you are getting while using Google Wallet? Keep us posted. We'll be happy to help. @HRunes Hi there. We'd like to chat further about this. Let's move the conversation to DM. @DylanWyatt17 You're welcome. Let us know how it goes. We're just a tweet away. @DylanWyatt17 Hmm. Just to confirm, are you able to tap and pay at a store that accepts Android Pay? Keep us posted. @DylanWyatt17 Hi Dylan. Could you tell us more about what's going on with Android Pay? We'd like to help. @_Tj_h Hmm. We'd like to chat further about this. Let's move the conversation to DM. #AndroidTip: Say hello with a selfie clip on Google Allo. Press &amp; hold the shutter button and let the posing begin: https://t.co/rRODMTR2SX https://t.co/PDD64C7U1s @marcelpinto2 Hi Marcel. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @NathanLewis1987 Hmm. We'd like to chat further about this. Let's move the conversation to DM. Public Wi-Fi can be spotty. For the first time, #AndroidOreo 8.1 lets you take out the guesswork &amp; see the speed of networks before you hit connect. Rolling out now: https://t.co/lSzvCFgNk7 https://t.co/60EmoPxUX4 @Twyst Understood. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @Twyst You're welcome. Reach out if you have any other questions in future. We're just a tweet away. @Twyst Hi there. Prepaid Visa cards are supported in Android Pay. To add a prepaid Visa card, please click on the + button and select \"Add a store gift card\". Hope this helps. @_Tj_h Hi there. Just to confirm, is your device rooted? For security reasons, Android Pay isn't compatible with rooted/modified devices. Let us know. @NathanLewis1987 We're happy to provide chat transcripts, Nathan. Please feel free to contact our support team at any time to request those. @marineocean8 Hi there. Have a look at this article about how Android Pay keeps your payment safe: https://t.co/XhZNbh4pYJ. Hope this info helps. @NathanLewis1987 Understood. Have a look at this article about how to download your data: https://t.co/Pv7FJnc85z. Hope this helps. @MarkIHarrison Understood. You were asked for your physical card because that merchant requires the card for all chip &amp; PIN purchases. We suggest you follow up with the merchant to share your feedback. With #AndroidOne, you get everything you want and nothing you don’t. Enjoy an easy-to-navigate phone that puts you in control: https://t.co/ktWi448tv0 https://t.co/sYjssyMnWm RT @Google: When your child starts using their first Android device, Family Link helps you manage their screen time, app usage and more → h… @NathanLewis1987 Hmm. Could you tell us more about a data protection offer? Keep us posted. @wilcock_william Thanks for the suggestion. Please feel free to submit feedback in the Android Pay app under Menu &gt; Send feedback. @wilcock_william Hi William. Have a look at this guide to use your PayPal account with Android Pay: https://t.co/ZTEzSlqQ6C. Let us know if that helps. @MarkIHarrison Hmm. Have a look at this guide if you have trouble using Android Pay in stores: https://t.co/OJYE65WpO9. Let us know if that helps. @MarkIHarrison Hi Mark. Could you tell us more about what's going on with Android Pay? We'd like to help. @RichyHBM Hi Richy. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @RichardParker86 You're welcome. Reach out if you have any other questions. We're just a tweet away. @NathanLewis1987 Hi Nathan. That's the registered office for Google Payment Ltd. in England, but it's not a normal business office. You can find a list of Google's European offices here: https://t.co/R9auyxcgce.  Hope this info helps. @RichardParker86 Hi Richard. The draw happens weekly on Friday and the winners will receive an email. Hope this info helps. @TCSterlz Understood. Have a look at this guide for the current list of banks and cards supported on Android Pay: https://t.co/a0kf78dNl1. Also, please feel free to submit feedback in the Android Pay app under Menu &gt; Send feedback. @TCSterlz Hi Christopher. Could you tell us more about what's happening with Android Pay? We'll be happy to help. @brownie490 Glad to hear its working! Reach out if you have any other questions. We're just a tweet away. @PanfurWare You're welcome. Reach out if you have any questions. We're just a tweet away. @PanfurWare Hmm. Have a look at this article to pay using Android Pay: https://t.co/YSnuB78AC0. Keep us posted. @PanfurWare Hi there. Could you tell us more about whats happening with Android Pay? We'll be happy to help. @scottclark Understood. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @scottclark Hmm. Just to confirm Scott, are you receiving any error messages when you try to pay? Keep us posted. @jjmarriott Hmm. As we mentioned, these were only in limited supply so not everyone was offered them. Thanks. @jjmarriott Hi Jonathan. Android Pay users who are opted into Android Pay promotional emails were selected to receive this gift in limited supply. Be sure you are opted into Emails in your Android Pay app setting to be notified of future promotions! @brownie490 Hi Adam. Could you tell us more about what's happening with Android Pay?  We'll be happy to help. @scottclark Thanks for the info. Have a look at this article to pay in stores using Android Pay: https://t.co/ryuzZUsCLw. Let us know if that helps. From your phone and watch to your TV and car, the Google Assistant is here to help. What’s been your favorite #Android announcement from #CES2018? https://t.co/QlkbUWbUeN @AdamFlinter Hi Adam. We're always working on expanding Android Pay's availability. We appreciate your taking the time to share your feedback. @scottclark Hi Scott. Could you tell us more about what's happening with Android Pay on your phone? We'll be happy to help. @Studougnicholls You're welcome, Stuart. Reach out if you have any questions in the future. We're just a tweet away. @chapmajw Hi James. Have a look at this article to see charges and transaction history: https://t.co/vUScyONgJ2. Let us know if that helps. @abhi_choudhury Hi Abhishek. Thanks for your interest! We don't have news to share about launching Android Pay in your country right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. There’s no stopping the #AndroidTV momentum. With the Google Assistant built in, entertainment catered to you, and more partners than ever, enjoy a smart TV experience that’s right for you. #CES2018 https://t.co/zvrgbVsRdO @CooooleenBooks For questions about Samsung's beta program, we recommend reaching out to Samsung for support. @blakeh89 No, you're not missing anything. As we mentioned, these were only in limited supply so not everyone was offered them. @Studougnicholls Hi Stuart. Android Pay users who are opted into Android Pay promotional emails were selected to receive this gift in limited supply. Be sure you are opted into Emails in your Android Pay app setting to be notified of future promotions! @CooooleenBooks Have you joined Samsung's beta software program? If so, then Android Pay won't work with your phone and will display this error message. If you'd like to use Android Pay, we recommend un-enrolling from their beta program. Hope this helps. @blakeh89 Hi Blake. Android Pay users who are opted into Android Pay promotional emails were selected to receive this gift in limited supply. Be sure you are opted into Emails in your Android Pay app setting to be notified of future promotions! @CooooleenBooks Hi Coleen. Could you tell us more about what's happening with Android Pay on your phone? We'll like to help. The @AndroidWear family keeps growing &amp; growing. Introducing the @katespadeny scallop touchscreen smartwatch &amp; the @SkagenDenmark Falster. #CES2018 https://t.co/tg3g1Xv6zH The Google Assistant is now on #AndroidAuto. Plan your day, play your favorite playlists, and text while keeping your eyes on the road. #CES2018 https://t.co/UaUbfSZGfO https://t.co/RE8iaeMlUf @KellyLongLegs Hi Kelly. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. “Hey Google, what’s on my calendar?”\nStay tuned for extra special #Android announcements coming from #CES2018. https://t.co/7JPqlpf6Fk @stuartmemo You're welcome, Stuart. Reach out if you have any other questions in the future. We're just a tweet away. @willburns You're welcome, Will. Reach out if you have any other questions in the future. @samuriinbred Got it. Just to confirm, were you able to make the payment using Android Pay? Keep us posted. @samuriinbred Hmm. Have a look at this guide if you have trouble using Android Pay in stores: https://t.co/OJYE65WpO9. Let us know if that helps. @samuriinbred Hi Jon. Are you receiving any error messages when you try to use Android Pay? Keep us posted. We'll be happy to help. @dzikoo You're welcome. Reach out if you have any other questions. We're just a tweet away. @jpscd Glad to know its sorted! Reach out if you have any other questions. We're just a tweet away. @hobhobuk Hi there. Sorry about that! It's fixed now, so please give the form another try. @willburns Hi Will. Sorry about that! It's fixed now, so please give the form another try. @dzikoo Hi Marcin. Sorry about that! It's fixed now, so please give the form another try. @jpscd Hi there. Sorry about that! It's fixed now, so please give the form another try. @stuartmemo Hi Stuart. Sorry about that! It's fixed now, so please give the form another try. @APVID Hi Antony. Sorry about that! It's fixed now, so please give the form another try. @Kaiioin Hi Kai. Sorry about that! It's fixed now, so please give the form another try. @Emileeh93 Hi Emileeh. Are you receiving any error messages when you try to use Android Pay? Keep us posted. We'll be happy to help. @samuriinbred Glad to know its sorted. Reach out if you have any other questions. We're just a tweet away. @samuriinbred Hi Jon. Could you tell us more about what's happening with Android Pay? We'll be happy to help. Cozy up and get reading with the top 5 #Android apps for book lovers: https://t.co/SwVjrBIk2o https://t.co/l8rUrCyWvp @NathanLewis1987 Hi Nathan. Glad to hear its sorted! Reach out if you have any other Qs. We're just a tweet away. @wiggy_tweets Hi there. We'd like to chat further about this. Let's move the conversation to DM. @twistedlemones Hi there. Have a look at this guide for info on rewards (see \"Rewards and Benefits\" section): https://t.co/5HjkBwiMzC. Hope this helps. @_will_o_wisp_ Hi Gabriel. Could you please go to https://t.co/Xs8VCf4DJv and double-check if the address that is listed under Settings is a UK address? What. A. Year. From announcing  #AndroidOreo to #AndroidPay expansions, thank you for coming along for the ride. What’s been your favorite 2017 #Android moment? https://t.co/tSBjUNYYdT @MUFC20GGMU Understood. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @MUFC20GGMU Hi Andrew. Could you please tell us more about what's going on with Android Pay? We'll do our best to help. @HRunes Hi there. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @beautypulse_ldn Hi there. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @victorking1980 Got it. We'd like to chat further about this. Let's move the conversation to DM. @victorking1980 Hmm. Have a look at the current list of financial institutions that support Android Pay: https://t.co/WA08ZR3PO8. Keep us posted. @victorking1980 Hi Victor. Have a look at this guide on how to add a card on Android Pay: https://t.co/5wHotSmd01. Let us know if it helps. @thebookbloglife Hi there. Have a look at this article to set up Android Pay on your phone: https://t.co/dwY93eGmpJ. Let us know if that helps. @Laurel_UK Hi there. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @tomdude Glad to hear its sorted! Reach out if you have any other questions. We're just a tweet away. @tomdude Hi Tom. Have a look at this guide to use your PayPal account with Android Pay: https://t.co/ZTEzSlqQ6C. Let us know if that helps. @felipefphoto Hi Felipe. Here is the current list of financial institutions that support Android Pay: https://t.co/WA08ZR3PO8. We're always working on adding more supported cards. We hope this helps. @Thepenguin9 Hi. There aren't any prizes, but congrats on assembling the whole team! @bifkinuk We're still looking into the issue. We're sorry for the inconvenience. @nikunjsyngal Hi Nikunj. The app asks for permissions because it's using a central API that includes those. We're looking into reducing the number of permissions the app needs in a future software update. Hope this info helps. @DusterLag Hi Dustin. We'd like to chat further about this. Let's move the conversation to DM. Last chance to collect them all! Unite the #JusticeLeague Super Heroes through December 31st when you tap to pay in store with #AndroidPay: https://t.co/XdwI1gptaJ https://t.co/skSCO5jekv Unwrap the #Android Winter Wonderland and tell us how many Android sweet treats you can find. Don’t forget to look in the background too 😉 https://t.co/AtRBafIRc8 Give the gift of #Android this holiday season. A whole new world out there is ready to be unwrapped 🎁  ➡️ https://t.co/cuJ64Pvndi https://t.co/svYn2vC0XU @Magas91 Hi Sergio. There aren't any prizes, but congrats on assembling the whole team! What’s for dessert? Cook up something sweet with these 5 #Android apps that take the 🍰: https://t.co/DvuoMJzBPw https://t.co/LHHGPBSZsK @TChighbury You're welcome. Reach out if you have any other questions. We're just a tweet away. @TChighbury Hi there. If you'd like to stop gathering heroes you can open the Android Pay app, visit the Justice League card, scroll to the bottom, and select \"Opt out.'' Hope this info helps. @Junio_Tk2 Hi there. Could you tell us more about what's happening with Android Pay? Let us know. We'd be happy to help. Keep your apps on the nice list. Google Play Protect actively scans your #Android device around the clock to make sure they are all good to use. https://t.co/JqUmGS1S2L @TheXboxVision Hmm. Have a look at this guide if you have trouble using Android Pay: https://t.co/fLmIfQaqex. Keep us posted. @TheXboxVision Hi Ross. Could you tell us more about what's happening with Android Pay? Let us know and we'd be happy to help. @Jcharles626 Hi Josh. Have a look at this guide to set up Android Pay: https://t.co/ZOK6kuQAhG. Let us know and we'd be happy to help. @TommLynn Hi Tom. Could you tell us more about what's happening with Android Pay? Let us know and we'd be happy to help. Looks like a sweet adventure, @GoogleMaps. Code helps you express yourself, no matter where you are. Stay connected with @madewithcode’s #EmojifytheHolidays project: https://t.co/r7SFt6JwhA https://t.co/j0oCGFUUu8 @AlexAlexblock Hi Alex. We'd like to chat further about this. Please follow us and let us know when you do, so we can reach out over DM. @rodrireedus Hmm. We'd like to chat further about this. Let's move the conversation to DM. @H3R0W Hi Artur.  Have a look at this guide for info on supported cards for Android Pay: https://t.co/M7QSrFTsHv. Hope this helps. @Gaynorthompson2 Hi Gaynor. Let's move this conversation to DM for further assistance. @rodrireedus Hi Rodrigo. You can recruit the Justice League in Brazil. Hope this info helps. @solwatts Hi there. Were you trying to pay while PayPal was set as your payment method? If so, we're aware of this problem and looking into it. As a workaround, you can use a different payment method in Android Pay, such as credit card. @TrueBlueInNY Hi Franklin. We'd like to chat further about this. Let's move the conversation to DM. @TsundereChen Hmm. According to this article it's only available in the US or Japan: https://t.co/kvgI2DrzSy. Hope this info helps. @Giusepp30293522 Currently Android Pay isn't offered in Italy. Hence live chat may not be available in countries where we don't offer the service. @NathanLewis1987 Hmm. We'd like to chat further about this. Let's move the conversation to DM. @NathanLewis1987 Hi Nathan. Have a look at this guide to use a default payment method with Android Pay: https://t.co/8I1mFZHyKC. Let us know if that helps. @TheRealTomahawk Hi there. Thanks for your interest!  Although it isn't available in all the countries that Android Pay is at this time, we'll keep your feedback in mind as we plan for future animation ideas. @MabeltronL Hi David. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @rafael_1628 Hmm. Android 8.0 Oreo will begin rolling out to selected Android Wear devices. Roll out dates are determined by the watch manufacturer. Check if your watch will receive it here: https://t.co/ybKaFRlBtQ. @idelacab Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. It’s a bird. It’s a plane. The final @JusticeLeague Super Hero is now available when you pay in store with #AndroidPay. Who have you collected? https://t.co/OxbvJbVk5N https://t.co/0tmyqMMHVJ @TsundereChen Hi there. Let's try the steps in this guide to use Android Pay on your watch: https://t.co/TAkLYi0d78. Keep us posted. We'd be happy to help. @Giusepp30293522 Hi there. Could you tell us more about what's happening with Android Pay? Let us know. We'll do our best to help. @JohnBennett134 Hi John. Could you try holding your phone's antenna closer to the terminal, the next time? Keep us posted. We'd be happy to help. @asm0di0 Hi Paul. Congratulations on assembling the whole Justice League team. You are now all set to save the world! @rikiy25522 Hi there. Could you tell us more about what's happening with Android Pay? Let us know. We'd be happy to help. Smart &amp; seamless, #AndroidOreo makes multitasking a breeze with features like picture-in-picture &amp; notification dots. https://t.co/QncEWyI9iL @andyjones_1981 Hi Andy. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @senthos Hi. There aren't any prizes, but congrats on assembling the whole team! Let your #Android voice be heard. Give Google your feedback and you could be rewarded ➡️ https://t.co/0dpxFe8599 https://t.co/ciXyhOMYzO @oflahertyevents Hi there. We'd like to chat further about this. Let's move the conversation to DM. @AaronJJSam Hmm. Although all the banks are listed, we don't support all cards from those banks. Kindly, check this page for a list of supported cards: https://t.co/TVuOV3tNzD. @aquafrog222 Hmm. We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @AaronJJSam Hi there. Check out our current list of financial institutions that support Android Pay here: https://t.co/Uew21oaFhZ. Be sure to select your country or region. Hope this helps. @aquafrog222 Hi there. We really appreciate your interest. Although we've announced PayPal integration, we haven't launched it yet. However, you can keep an eye on our blog for updates: https://t.co/fUAHMuii9e. @AaronJJSam Hi there. Could you tell us more about what's happening with Android Pay? Keep us posted. We'd be happy to help. Smart text selection is rolling out on #AndroidOreo 8.1. It recognizes the text you tap &amp; suggests a logical next app to use, like Maps for an address or Dialer for a phone number. Talk about smart! https://t.co/fr4JA1oACS https://t.co/0yFkXnvGBi @bifkinuk Hi David. We're aware of this issue and investigating it. No need to flip out 😉 The new #Android cheeseburger emoji is fresh off the grill. Rolling out now with #AndroidOreo 8.1. https://t.co/VecvloQlCj @Srnathani You're welcome. Reach out if you have any other Qs. We're just a tweet away. @Srnathani Hi there. When you make a payment with the Android Pay app, you get the chance to collect the Justice League characters and they get saved to your app. Please check our blog for more info: https://t.co/d8rOEiK3lK. We hope this helps. More users, more fun. Introducing #AndroidOreo (Go edition). See how we’re bringing #Android to more people around the 🌍: https://t.co/V805fC1lgZ https://t.co/dQPgkiBUTb @_themomnextdoor Hi there. Please follow us and let us know when you do so we can discuss next steps through DM. @M_Lloyd_P Hi Michael. If you would like to opt out, you can open the Android Pay app, select the Justice League card, scroll to the bottom, then select \"Opt out.\" Hope that helps. @Newcolour78 You're welcome. We appreciate your interest, however we want to do our best to ensure that your transactions stay secure so we require your bootloader to be locked. @millerpete You're welcome. Let's move this conversation to DM for further assistance. @Mauler1973 @justiceleaguewb Hi Joshua. We recommend you to just keep tapping! Hope you unite your Super Heroes soon. @Newcolour78 Hi Simone. For security reasons, Android Pay won't work if we detect the bootloader on your device is unlocked. We hope this info helps. @MrMartinAWhite Hi Martin. Could you tell us more about what's happening with Android Pay? Keep us posted. We'd be happy to help. @steverainton Hi Stephen. Could you tell us more about what's happening with Android Pay here? Keep us posted. We'd be happy to help. @justaskjensen1 Hi there. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. RT @GoogleIndia: And it begins! The third edition of #GoogleForIndia is happening on 5th December, and we can’t wait to share what’s new. J… @cawpin Hmm. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @cawpin Understood. You can only make a one-time payment with a non-default card (See \"Pay with a non-default payment method\"): https://t.co/hnklNh5SZm. @cawpin Hi there. You'll need to set the card as default, for it to be used with Android Pay. Have a look at this article for more info: https://t.co/hnklNh5SZm. We hope that helps. #AndroidTip: Take in the full experience with panoramic photos. Line up the dots and 📸: https://t.co/tA3NKavlqR https://t.co/iheI66jQ6I @millerpete Hi Peter. Are you receiving any error messages when you try to use Android Pay? Keep us posted. We'd be happy to help. @badgersvspeng You're welcome. Reach out if you have any other Qs. We're just a tweet away. @badgersvspeng Hi there. Android Pay will stop working if the same cards are on Android Pay. Hope this info helps. @micklondon Hi there. Please post in the Beta program's Google+ community for support with Android Beta: https://t.co/EzKE6gFtFs. Hope this info helps. @kfungfung Hi Cameron. The app asks for those permissions because it's using a central API that includes those. We're looking into reducing the number of permissions the app needs in a future software update. Hope this info helps. @TomRyanElliott Hmm. Please submit a feedback in the Android Pay app under Menu &gt; Send feedback. @TomRyanElliott Hi Tom. We can't guarantee it will work with a Beta operating system, and recommend you leave the Beta version if you want to use Android Pay. Hope this info helps. @jwex51 Hi Josh. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @micklondon Hi. We can't guarantee it will work with a Beta operating system, and recommend you leave the Beta version if you want to use Android Pay. Reach out if you have any other Qs, we're just a tweet away. @Mwistar Hi there. Could you tell us more about what's happening with your Android Pay? Keep us posted. We're happy to help. @Khaelyna Hmm. Here is the current list of financial institutions that support Android Pay: https://t.co/WA08ZR3PO8. We hope this info helps. @NaoSeMatty Poxa, Matheus! Caso queira, você pode enviar esse comentário no app do Android Pay em Menu &gt; Enviar feedback. Obrigado e tenha uma ótima noite! @Khaelyna Hi there. Could you tell us more about what's happening when you try to set up Android Pay? Keep us posted. We'd be happy to help. @cherrera178 Hi there. We'd like to chat further about this. Let's move the conversation to DM. @MattyD95DX Hi there. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @HarjRai Hi Harjeet. Congratulations on collecting the Justice League character. You are now all set to save the world! @ecr80 Hi Edgar. We'd like to chat further about this. Let's move the conversation to DM. This isn’t your grandparents’ road map. With #AndroidAuto and @googlemaps, get where you need to go with ease: https://t.co/K4eywe2hf7 https://t.co/ucPNzmK1Gk @EmmaJor22507419 Hi Emma. Congratulations on assembling the whole Justice League team. You are now all set to save the world! @LynneMiles Sure thing. Let us know how it goes. @LynneMiles Hi Lynne. Next time you're there, try keeping your device up against the terminal until the gate opens. If the issue persists, we'd appreciate it if you open Android Pay app &gt; Tap menu icon &gt; Send feedback &gt; check \"include system logs\". @ItsEliP Glad to hear its sorted! Reach out if you have any other Qs. We're just a tweet away. @pramit6 Hi there. We'd like to chat further about this. Let's move the conversation to DM. @ItsEliP Hi there. If you'd like to stop gathering heroes you can visit the Justice League card, scroll to the bottom, and select \"Opt out.'' Hope this info helps. @jsritterDE Hi Jonas. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @Renanham Hmm, entendemos. Nossa equipe de produto agradece o seu comentário! Que tal enviar esse feedback no app do Android Pay em Menu &gt; Enviar feedback? Tenha uma boa noite! @jrvmosjr Hi there. Have a look at this guide if you tried using Android Pay in a store and couldn’t get it to work: https://t.co/B8UwBEEpiE. Let us know if that helps. @BrianG416 Hi Brian. There's no trick, just keep tapping! Hope this info helps. @CameronNeylon Hi there. The app asks for those permissions because it's using a central API that includes those. We're looking into reducing the number of permissions the app needs in a future software update. Hope this info helps. @renanferreira_ Entendemos, Renan. Por gentileza, siga-nos e avise-nos quando o tiver feito para que possamos compartilhar os próximos passos através de DM. @gabrielmagacho Certo, Gabriel. Por favor, siga-nos e avise-nos quando o tiver feito para que possamos compartilhar os próximos passos através de DM. @renanferreira_ Olá, Renan. Podemos ajudar com o Android Pay? Conte-nos um pouco mais sobre o que está acontecendo. Estamos à disposição. @gabrielmagacho Poxa, Magacho. Você poderia nos falar um pouco mais sobre o que está acontecendo? Queremos ajudar. @Jamie_Blake Congratulations on assembling the whole team, Jamie! @MrRaveyGravy Hi there. Please follow us and let us know when you do so we can reach out over DM. @tylerlovekeeper You're welcome. Glad to hear it's sorted. Reach out if you have any other Qs. We're just a tweet away. @danandhugo Hi Daniel. When you make a payment with the Android Pay app, you get the chance to collect the Justice League characters and they get saved to your app. Please check our blog for more info: https://t.co/d8rOEiK3lK. We hope this helps. @EssebeeTwoThree Hi there. Let's move this conversation to DM for further assistance. @ryanteck Hi Ryan. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @TheJaspa Hi Jason. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @ninjajoshi91 Hi there. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @jingletit Hi there. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @Jamie_Blake Hi Jamie. Just to confirm, have you been able to recruit the Justice League characters? Let us know and we'll be happy to help. @MattScript Hi Matt. We'd like to chat further about this. Let's move the conversation to DM. @JonBelgrave Hi Jonathan. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @timobrau Hi there. Thanks for your interest! We don't have news to share about launching Android Pay in your country right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @mtobyy Hi Matthew. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @SidmouthUK Hi Simon. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @jjmarriott Hi Jonathan. We'd like to chat further about this. Let's move the conversation to DM. @HalfSoftCookie Hi there. We'd like to chat further about this. Let's move the conversation to DM. @tylerlovekeeper Hi Tyler. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @gehwissenlos Hi Manuel. Thanks for your interest!  Although it isn't available in all the countries that Android Pay is at this time, we'll keep your feedback in mind as we plan for future animation ideas. @gregpye Hi Greg. We'd like to chat further about this. Let's move the conversation to DM. @norivalluiz Hmm, entendemos... Obrigado pelas informações, vamos ver se podemos ajudar! Procure a nossa DM com os próximos passos. @Renanham Olá novamente, Renan! Adoraríamos saber se o link enviado foi útil. Você ainda precisa de ajuda com o Android Pay? Continuamos à disposição. @akaevecardoso Oh, não! Podemos ajudar? Você poderia nos dar mais detalhes sobre o que aconteceu? Apareceu alguma mensagem de erro no momento da compra? Conte-nos mais. @norivalluiz Poxa, Norival! Você recebeu alguma mensagem de erro? O seu cartão já estava adicionado? Conte-nos mais, pois queremos ajudar. @targ0s Poxa, Lucas... Por segurança, o Android Pay não é compatível com dispositivos modificados ou com acesso root. Esperamos que essa informação seja útil. Save the world. \nSave the wallpapers. \nUnite the @justiceleaguewb Super Heroes when you use #AndroidPay to pay in store. https://t.co/2hKdcIM9VO https://t.co/nH1jPHrojn @jrvmosjr Hi there. Could you tell us more about what's going on with Android Pay? Keep us posted. We'd like to help. @re_aparecido Perfeito, Renato. Qualquer outra questão que você tenha com o Android Pay, é só chamar. Tenha uma ótima noite. @re_aparecido Sim, Renato,  é assim mesmo. Você precisa desbloquear o seu aparelho para que possa efetuar o pagamento. Que tal ver mais info neste link: https://t.co/kC7n89mzyZ? No tópico \"Como fazer pagamentos\", as etapas 1 e 3 poderão ajudar. Ajudamos? @Renanham Olá, Renan. Dê uma olhada neste link, no tópico \"Onde você pode usar o Android Pay\" para mais informações: https://t.co/kC7n89mzyZ. Diga-nos se ajudamos! @re_aparecido Ficamos felizes que tenha dado certo, Renato. Se tiver qualquer outra dúvida com o Android Pay, já sabe onde nos encontrar. Boa noite 😊 @froger_mcs Hi Mirek. Let's move this conversation to DM for further assistance. @tenkely Hi there. Let's move this conversation to DM for further assistance. RT @oneplus: A New View - OnePlus 5T Launch Event Live https://t.co/C7z7qtUWgu @Cristian0esque Hi there. Thanks for your interest! We don't have news to share about launching Android Pay in your country right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @ThiagoTGT_ De nada, Thiago. Ficamos felizes por ter ajudado. Caso tenha alguma dúvida, já sabe onde nos encontrar. Tenha uma boa noite! @re_aparecido Oh oh, Renato! Você está recebendo mensagens de erro quando tenta adicionar seu cartão? Conte-nos mais, pois queremos ajudar. @felipemario Oba! Ficamos felizes que isso foi resolvido, Felipe. Caso tenha mais dúvidas, já sabe onde nos encontrar. Tenha uma boa noite! @FoxFire_T Hi there. We appreciate your interest. For security reasons, Android Pay isn't compatible with rooted/modified devices. We hope this info helps. @IbsinRG Hi Russell. Here is the current list of financial institutions that support Android Pay: https://t.co/WA08ZR3PO8. We're working hard on adding new banks everyday. We hope this info helps. @mayonesamia Hi there. Here is the current list of financial institutions that support Android Pay: https://t.co/WA08ZR3PO8. We're always working on adding more supported cards. We hope this helps. @DamCampo You're welcome. We really appreciate your interest. Although we've announced PayPal integration, we haven't launched it in Canada. However, you can keep an eye on our blog for updates: https://t.co/fUAHMuii9e. @PAkshayprasad Hi Akshay. Thanks for your interest! We don't have news to share about launching Android Pay in your country right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @sarang7798 Hi there. Thanks for your interest! We don't have news to share about launching Android Pay in your country right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @brrajan1211 Hi there. Thanks for your interest! We don't have news to share about launching Android Pay in your country right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @iamsabresh Hi there. Thanks for your interest! We don't have news to share about launching Android Pay in your country right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @dados_mind Hi there. Thanks for your interest! We don't have news to share about launching Android Pay in your country right now, but keep an eye on https://t.co/Z3ydjsBdas for updates. @piyush_soni Hi Piyush. Thanks for your interest! We don't have news to share about launching Android Pay in your country right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @antonioniroo Hi Antonio. Thanks for your interest! We don't have news to share about launching Android Pay in your country right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @RODO1308 Hi there. Thanks for your interest! We don't have news to share about launching Android Pay in your country right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @Rodrigost23 Hmm, certo. Siga-nos e nos avise quando tiver feito para que possamos esclarecer as próximas etapas por mensagem direta. @evefavretto Hmm, entendemos... Caso precise de ajuda, já sabe onde nos encontrar. Tenha uma boa noite! @eita_rodrigo Perfeito. Qualquer outra questão com o Android Pay, já sabe onde nos encontrar. Tenha uma boa noite. @felipemario Olá, Felipe! Você está recebendo mensagens de erro quando tenta adicionar seu cartão? Conte para a gente. @evefavretto Olá, Everton... Para usar o Android Pay, você precisa de um smartphone com Android 4.4 que seja compatível com NFC e HCE. Saiba mais: https://t.co/RLv6K4fG8y. Ajudamos? @eita_rodrigo Hmm, entendemos... Dê uma olhadinha neste artigo para ver os cartões que fazem parte do Android Pay no momento: https://t.co/EJgQ0GQSOu? Ajudamos? @MemeeVida Olá! Você pode encontrar mais informações sobre o Android Pay neste link: https://t.co/u4I3q9ZzHS. Diga-nos se ajudou! @Rodrigost23 Poxa, Rodrigo! Você poderia nos explicar um pouco melhor o que está acontecendo? Há alguma mensagem de erro? Queremos ajudar. @eita_rodrigo Poxa, Rodrigo... Só para confirmar, o seu cartão é Mastercard ou Visa? @ThiagoTGT_ Poxa, Thiago... Há duas listas no artigo: Cartões suportados e Cartões não suportados. Role a sua página para cima e veja mais: https://t.co/EJgQ0GQSOu? Ajudamos? @DamCampo Hi there. Have a look at this guide to use your PayPal account with Android Pay: https://t.co/ZTEzSlqQ6C. Let us know if that helps. @BrunneMagnus You're welcome. Reach out if you have any other questions. We're just a tweet away. @BrunneMagnus Hi Magnus. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @Stephy_B87 Got it. We'd like to chat further about this. Let's move the conversation to DM. @Nightwing92 Hi Atif. The Android Pay app doesn't currently provide this sort of functionality, however we do have another service that does this. You can learn more about Pay with Google here: https://t.co/aVuvujRkv0. Hope this info helps. @relishdigital Thanks for the info. This is not something we can assist with on Twitter. We suggest you use the Contact us link on the page you sent us. Tap. Pay. Unite. Use #AndroidPay for in-store purchases &amp; you could get a #JusticeLeague surprise. Who have you collected? https://t.co/OjVTn3aALL https://t.co/XfuCSqq0K7 @4nDroidRulz Hi Cole. Have a look at this guide to add a card to Android Pay: https://t.co/tjB3C6tghV. Let us know if that helps. @Stephy_B87 Hi there. Could you try restarting the phone? Keep us posted. We'd be happy to help. @Darjanator Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @amalskr Hi Amal. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @Ani88 Glad to hear its sorted! Reach out if you have any other Qs. We're just a tweet away. @Ani88 Hmm. Just to confirm, are you receiving any error messages while using Pay? Let us know. @Ani88 Hi Annie. Could you tell us more about what's happening with Android Pay? Keep us posted. We're happy to help. @relishdigital Hi Gary. Could you tell us more about what's happening when you try to set up Android Pay? Keep us posted. We'd be happy to  help. @wabremini Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @SavioCFC Hi there. Android Pay is not available in the UAE. However, we're working to expand our services to more countries. For updates: https://t.co/Z3ydjsSOz2. #AndroidOreo swiftly works behind the scenes. Minimized background activity on apps you use least keeps your battery strong &amp; full of life. https://t.co/TiMM9dT3xo @o2l_1D_brtly Here is the current list of financial institutions that support Pay: https://t.co/WA08ZR3PO8. We're always working on adding more supported cards. For security reasons, we don't support adding other people's credit cards to Android Pay. @LucianMumma Hi there. If you've cancelled a credit card it can't be used with Android Pay anymore. Hope this info helps. @its_wazir Hi there. Are you able to use Android Pay now? If no, could you let us know if you receive any error message? We'll do our best to help. @BabulaBhatt Hi Babula. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @ciaranharkin Hi Ciaran. Please send us a feedback through the app here: open Android Pay's menu (3 dots) &gt; Send feedback. Thanks. @rensa_co You're welcome. Reach out if you have any other questions. We're just a tweet away. @rensa_co Hmm. Currently this isn't possible. Please submit a feedback in the Android Pay app under Menu &gt; Send feedback. @rensa_co Hi James. Just to confirm, are you trying to turn off Android Pay without uninstalling the app? We don't currently offer a way to do that. @aortenzi Glad to hear that. Feel free to reach out if you have any other questions in the future. We're just a tweet away. @aortenzi Hi Anthony. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @mattURL Hi. We can't guarantee it will work with a Beta operating system, and recommend you leave the Beta version if you want to use Android Pay. @colouredtears23 Hi. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @Baggio1018 Mind if we jump in? Please follow us and let us know when you do so we can reach out over DM for further assistance. RT @YouTubeTV: It starts today! YouTube TV apps are now available for Android TV and select Xbox devices. https://t.co/dAEgcGt7G6 @o2l_1D_brtly Hi there. Have a look at this guide to add multiple cards to Android Pay: https://t.co/QOM6i2xqfe. Let us know if that helps. @AndyPeters316 Hi Andy. You need to have your phone screen on and your phone unlocked to make a payment. Hope this info helps. @evil_pro_ Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @ujin12354 Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. Ahhh - wooooooo. Werewolf it is. Thanks for the help. What’s your #Halloween costume? 🐺 https://t.co/XYFTihiXJu @SHollywoodN Hi Chris. Once Android Pay is enabled, it'll work anywhere contactless payments are accepted, regardless of your current location. @vishal1mehra Hi Vishal. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @clucks Hmm. If you've already unlocked your phone with a fingerprint, you can tap &amp; pay at any terminal that accepts Android Pay. Hope this helps. @hhudda Thanks for the info. We'd like to chat further about this. Let's move the conversation to DM. @Mcload23John Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. Eenie, meenie, miney...boo! What should the Android robot dress up as for #Halloween tomorrow? @SprintyNige Hi there. The Dunkin Donuts offer is valid only in the US. Stay tuned for more offers here: https://t.co/rjGS9WQCZS. Hope this info helps. @clucks Hi there. To use Android Pay you usually have to unlock your device w/ a pattern, PIN, or your fingerprint. Let us know if you have any Qs. @districtdave Hmm. Just to confirm, have you unlocked the bootloader of your phone. Let us know. @marco98a Hi. Thanks for your interest! We don't have news to share about that right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @yintianchou20 Hi. The Dunkin Donuts offer is valid only in the US. Stay tuned for more offers here: https://t.co/rjGS9WQCZS. @hhudda Hi Hussein. Could you tell us more about what's happening when you add the card to Android Pay? Keep us posted. We'd be happy to help. @QFB_Rafael Thanks for your interest! We don't have news to share about that right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @LeeLeeleesm4 Thanks for the update, Laura. There's a limit of earning one point per day for the promo. Hope this info helps. @DanEvan03710894 Hi Dan. If you just switched phones you would have to set up Android Pay. Here's the link for device requirements: https://t.co/mHZvpSjkg2. @marczimmermann Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @carlwsmith Hi Carl. Check out our most current list of financial institutions that support Android Pay here: https://t.co/Uew21oaFhZ. Keep us posted. @districtdave Hi Dave. Let's try the steps in this guide to use Android Pay on your watch: https://t.co/TAkLYi0d78. Keep us posted. @ChickenTheDuck Hi. The Dunkin Donuts offer is valid only in the US. Stay tuned for more offers here: https://t.co/rjGS9WQCZS. @JeffAtechly Hi Jeff. We don't have news to share about that right now, but keep an eye on https://t.co/Z3ydjsBdas for updates. @marczimmermann Hi Marc. The Dunkin Donut offer is valid only in the US. Stay tuned for more offers here: https://t.co/rjGS9WQCZS. @danandhugo Hi Daniel. The Dunkin Donut offer is valid only in the US. Stay tuned for more offers here: https://t.co/rjGS9WQCZS. @Cristian0esque Hi. The Dunkin Donut offer is valid only in the US. Stay tuned for more offers here: https://t.co/rjGS9WQCZS. @sarfara4z Hi Sarfaraaz. The Dunkin Donut offer is valid only in the US. Stay tuned for more offers here: https://t.co/rjGS9WQCZS. @gorgues Hi Jorge. The Dunkin Donut offer is valid only in the US. Stay tuned for more offers here: https://t.co/rjGS9WQCZS. @alexshenoy Hi. We're aware of this issue and are actively working on a solution. Please be sure to accept all software updates for your device. Third time’s a 🍩. Enter promo code DUNKIN in #AndroidPay, use 3x and earn a $5 @DunkinDonuts Card. https://t.co/s56pboVsO0 https://t.co/clYPxoWf6a @ThatLeighBrown Hi there. ''Pay with Google'' is the latest payment service. More info here: https://t.co/gARiQCl5Id. Hope this helps. @LeeLeeleesm4 Hi Laura. Could you let us know if you can see the gift card for the promo in your list of cards in the app? Keep us posted. @J_Godd We're aware of this issue and are actively working on a solution. Please be sure to accept all software updates for your device. @RobinHutte Hi. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. RT @Oreo: The new #AndroidOreo is deliciously fast. Watch the full intro film here: https://t.co/PTZhLwjW31 https://t.co/txkOkaM1t8 @mrlinux11 Hi there. Please follow us and let us know when you do so we can reach out over DM. @sssj_98 Hi Suraj. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. Yum! 🍔 FTW. https://t.co/5rMMdbKkBp @asish1998 Hi there. Thanks for the interest! We don't have news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @GeekBrainCode Hi there. Have a look at this guide about how to pay with Android Pay in stores: https://t.co/22pYjketN6. Hope this info helps. @abryanconrad Hi Ryan. We're aware of this issue and investigating it. @Patrick_ORourke Hmm. We're aware of the issue and investigating it. Keep the hangry at bay. What’s for lunch? #AndroidPay might not be magic, but it feels that way. Say goodbye to wallet juggling &amp; hello to Tap. Pay. ✨✨. https://t.co/gjcJ5EJzk5 https://t.co/BpwmWNyg9W @Patrick_ORourke Hi Patrick. Could you tell us more about what's happening with Android Pay? We'll do our best to help. Two superpowers are better than one. With picture-in-picture on #AndroidOreo, multitask like the hero you are: https://t.co/ZUTWZ6oMsb https://t.co/vQd21oDps7 @nancylyndhurst Double receipts are because the card's issuer sent us two receipt. We recommend to have your friend check with them for any concerns. @nancylyndhurst Thanks for the info. If they confirmed you were only charged once, that means they sent us two receipts but only charged your acct one time. @SUnsworth89 You're welcome. Reach out if you have any other Qs. We're just a tweet away. @andylong42 Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. @SUnsworth89 You're welcome. Double receipts are because your card's issuer sent us two. We suggest you check with them if you have any concerns. @mrbenlogan Hmm. If you're seeing duplicate entries, those were sent to us by your card issuer which is why we recommend you check with them. @SUnsworth89 Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. @SpeakMouthWords Hmm. If you saw double receipts it's because your card's issuer sent us two. We suggest you check with them if you have any concerns. @Svenopedia If you saw double receipts it's because your card's issuer sent us two. We suggest you check with them if you have any concerns. @Adam_Sanchez You're welcome. Glad to hear its sorted! Reach out if you have any other Qs. We're just a tweet away. @Adam_Sanchez Hi again. If you saw double receipts it's because your card's issuer sent us two. We suggest you check with them if you have any concerns. @imperples Hmm. If you're seeing double receipts, those were sent to us by your card issuer which is why we recommend you check with them. @nancylyndhurst Hmm. If you're seeing double receipts, those were sent to us by your card issuer which is why we recommend you check with them. @suicidebridge Sure thing, Aaron. Keep us posted. We'd be happy to help. @suicidebridge Hmm. If you're seeing double receipts, those were sent to us by your card issuer which is why we recommend you check with them. @nancylyndhurst Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. @imperples Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. @m4tt Hi Matt. Have a look at this handy guide to set a default payment card on Android Pay: https://t.co/nB5jxOi32Y. Let us know if that helps. RT @HuaweiMobile: The power to do intelligent things, complete with Android 8.0 Oreo. #HuaweiMate10 #AndroidOreo https://t.co/jIIXV16oXb @SpeakMouthWords Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. @Hugin86 Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. @iamSaira Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. @mrbenlogan Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. More apps, fewer taps. Use Notification Dots on #AndroidOreo to see what’s new, &amp; clear them by swiping away. #AndroidTip https://t.co/10eqHVvyls @Svenopedia Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. @Adam_Sanchez Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. @Yasawas_ Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. @BazBadrinath Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. @KThand1 Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. @suicidebridge Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. @IanPottUK Hi Ian. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges, please check with your card's issuer. @Monitorabbit Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. @RyoYokoe1 Hi. Android Pay facilitates transactions but doesn't charge your acct. If you see extra charges we suggest you check with the card's issuer. @manolaniusko You're welcome. Feel free to reach out out if you have any other questions. We're just a tweet away. @manolaniusko Hi again. Our product team greatly appreciates feature suggestions. You can submit it in the Android Pay app under Menu &gt; Send feedback. @gusgusfan Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @VILUrap Hi. Thanks for your interest! We don't have news to share about that right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @EinfacherTweet Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @Miingno Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @digitalwriter1 Hi Rajeev. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @MrRapidRabBit Hi there. Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. Did you know? #AndroidPay encrypts your card so your account stays extra protected when you purchase in-store. https://t.co/WzD52JjLVf https://t.co/dbkepbBMcu @manolaniusko Hi Manuel. Here's the list of participating banks and supported cards for Android Pay: https://t.co/DUB7nUuntu. Hope this info helps. @peachkiller85 Hi there. Could you tell us more about what's happening with Android Pay? We'll do our best to help. RT @Google: Back with the highest-rated smartphone camera ever, meet the new Google Pixel 2 and Pixel 2 XL → https://t.co/jdr9S9hBzb #madeb… @_kar29 Hi Kartik. Android Pay isn't available in India yet. Also, the charge is a temporary authorization which will drop off automatically. @skyeelise18 Hi there. To use Android Pay you'll need a phone running Android 4.4+ that support NFC &amp; HCE. More info here: https://t.co/LINyA5XWh5. @gabrieladrianof Hi Gabriel. Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @martinatfc Hi Martin. Have a look at this handy guide on how to use Android Pay: https://t.co/YZyITrglfB. Let us know if that helps. @ben_furnival Hi Ben. Are you receiving any error messages when you try to use Android Pay? Keep us posted. We'd be happy to help. @captainofcoffee Hi Roberto. With Android Pay you don't need a card that's contactless. More info: https://t.co/TQb4wtpNph. Hope this info helps. The people have voted! Good thing Tokyo is beautiful this time of year. https://t.co/YPXgKEuJT5 RT @Google: Check the weather, find a movie, dim the lights—all with just your voice. #GoogleAssistant is now on Android TV → https://t.co/… So many places to go, so many things to see. Where do you want to see us go next? @mk_mo_ Hi Mohit. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. .@AndroidStudio gives you the tools &amp; community you need to build a great #Android app. Get started today: https://t.co/MC4boFodda https://t.co/ndf8S9vPrl @shanca01 That doesn't look like one of the cards we support, Hanson. You can find the list of supported cards &amp; services at https://t.co/DUB7nUuntu. @mavricksavard Hi Mavrick. Once Android Pay is enabled, it'll work anywhere contactless payments are accepted, regardless of your current location. @TobiasBorniger Hi Tobias. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. RT @YouTubeTV: YouTube TV for @Android just got bigger. \n\nYou can now watch your favorite TV and sports on your tablet. Try it now→ https:/… RT @projectfi: The new Android One Moto X⁴ is officially on Project Fi.\n\nA phone experience that’s uncommonly uncomplicated. \n\nhttps://t.co… @AdwKelkar Hi Adwait. Is the phone's bootloader unlocked? For security reasons, it needs to be locked for Android Pay to work. Keep us posted. #AndroidOreo with built-in Google Play Protect gives you peace of mind in the palm of your hand. https://t.co/dqB3hHL5Sd A streamlined experience, unlimited photo storage, &amp; the Google apps you ❤️. Moto X4 with #AndroidOne is here: https://t.co/58jfIdQkEn https://t.co/cEfT98pWNj @shanca01 Hmm. Here's the list of participating banks and supported services for Android Pay: https://t.co/DUB7nUuntu. Hope this info helps. @shanca01 Hi Hanson. Have a look at this guide (see \"Using a PayPal account\" section): https://t.co/eEwmYPrQkR. Let us know if that helps. @QuahEric Hi Eric. Thanks for your interest. We don't have news to share about that right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @osrathore Hi Omkar. We're seeing issues on Tez because of higher than expected traffic. We're working towards a fix and appreciate your patience. Oreo + Android is juuuust right. More powerful than ever, watch #AndroidOreo save the day: https://t.co/naLJ85UIMK https://t.co/NMav0BhLuA @ScottDotDot Hi Scott. Could you tell us more about what's happening with Android Pay? We'll do our best to help. @JustPlaysDE Hi there. Thanks for your interest. We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @iamrvk Hi Rohit. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. RT @cristianoamon: See us bring #Gigabit #LTE live at #MWCA17 on the #GalaxyNote8. Exclusively on @Qualcomm + @Android smartphones.\nhttps:/… @just__rts Hi Raghav. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @dhavu_official Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. “Ok Google, find the nearest gas station.” With #AndroidAuto, use voice actions to keep your eyes on the road and hands on the wheel. https://t.co/hymGt37hBy One less worry for over a billion users. Google Play Protect has rolled out on all #Android devices. Learn more: https://t.co/zHytZgxg9a https://t.co/g41CtOVjzj RT @AndroidWear: With even more ways to express yourself, it’s safe to say #AndroidWear is not one size fits all. Wear what you want: https… #AndroidOreo keeps security top of mind, working automatically behind the scenes to protect you. Read on @wired: https://t.co/3xuu5eAxUk https://t.co/M2Zgz6JbEo Mi A1 with #AndroidOne checks off your fave 📱 needs: Dual 📷 ✔️ Uncluttered software experience ✔️ Always secure ✔️ https://t.co/on1J6PIKKr https://t.co/zlxAKB8055 Excited to partner with @Xiaomi on the #MiA1 - the latest #AndroidOne phone. https://t.co/WlWdN38h7Z #AndroidOne is arriving in new countries. Enjoy a pure Android 📱 experience that stays fresh &amp; secure over time: https://t.co/ztqcR8Enj5 https://t.co/Xu3AgwrNqY @DanEvan03710894 Hi Dan. Next time you're there, try keeping your device up against the terminal until the gate opens. Hope it helps. @AbhishekChethan Hi Abhishek. Thanks for your interest. We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. Beach days with #AndroidPay are as easy as Tap. Pay. Relax. Download the app now: https://t.co/GnXnu3XtKO https://t.co/XH0fq9uPcE #AndroidOreo superpowers have begun rolling out to Nexus &amp; Pixel devices. Open Wonder with new features: https://t.co/xrFF06nqSj https://t.co/mpmZsfFyzy Expressing yourself just got a whole lot easier. Open Wonder with brand new emoji on #AndroidOreo. https://t.co/4gBkwzY9hr https://t.co/6zOKqDVBBe @gcs363 Hi Greg. Have you tried these steps to set up Android Pay on your device: https://t.co/2fUTWpqFJb? Let us know. We'll do our best to help. RT @davey_burke: Just hangin' with my buddies 😀. Start building with #ARCore today. We're excited to see what you create! https://t.co/ss2I… #ARCore is bringing augmented reality to Android at scale, on millions of devices today. https://t.co/s8ZwyMsGl6 https://t.co/tzvtEcdgCO @EusebioSalgado Hmm. You can change the order of the cards that are displayed in the app. Tap and hold on a card, then drag it to a new position. @EusebioSalgado Hi Eusebio. Are you referring to add a loyalty card to the app? If yes, have a look at this guide: https://t.co/vi3FAgx5BY. Keep us posted. @supersloth We're glad it helped! Feel free to reach out if you have any questions in the future. We're here to help. Welcome home, #AndroidOreo. https://t.co/zJ9XLlNgFY @senshiserena You're welcome! Feel free to reach out if you have any other questions in the future. We're just a tweet away. @senshiserena Hmm. You don’t need to open the app to make a payment, but you do need to have your phone screen on &amp; your phone unlocked. Hope this helps. @senshiserena Hi there. Have a look at this guide for more info on how to use Android Pay: https://t.co/XakO7krZRU. Hope this info helps. @BoomInDaBloom Thanks for the info. Please follow us &amp; let us know when you do so we can move this conversation to DM. @supersloth Hi again. Just to confirm, did re-adding cards help? Let us know. @BoomInDaBloom Hi Megan. Just to confirm, are you using these steps to make a payment with Android Pay: https://t.co/kC7n89mzyZ. Let us know. @supersloth Thanks for the info. We suggest you to re-add the cards and see if it works. Keep us posted. @supersloth Hi there. Just to confirm, have you disabled screen lock recently? Let us know. We'll do our best to help. Yesterday was O-mazing. Take a look at this behind-the-scenes footage of bringing #AndroidOreo to life. https://t.co/H85QTsUQB9 @cedricbastin Hi Cédric. Our product team greatly appreciates feature suggestions. You can submit it in the Android Pay app under Menu &gt; Send feedback. @darkixion Now that's how you celebrate #AndroidOreo 🎉🎉🎉 Enjoy! ⚡️ “#AndroidOreo - Open Wonder”\n\nhttps://t.co/ajDqdePEpZ @SeanKillsTime Our sweetest release yet. #AndroidOreo @tbremer19 We wouldn't have it any other way. The world's favorite cookie is your new favorite Android release. #AndroidOreo @japhettaula Pretty sweet, right? #AndroidOreo @thegeekninja We couldn't wait to make it o-fficial. Learn about the #AndroidOreo release here: https://t.co/fcGdXtNkEs @nerd4point0 See all about your new favorite #AndroidOreo release here: https://t.co/fcGdXtNkEs @OG_Parth 😍 #AndroidOreo is our sweetest release yet. @jcbivins A super sweet superhero will be coming to your device to save the day. #AndroidOreo @joseparis O-fficially o-mazing. 🎉🎉🎉 #AndroidOreo @antonirojas The sweetest release yet. #AndroidOreo @JulianChokkattu It's going to be o-mazing! #AndroidOreo @iShelbyBoy It's all 😍 with #AndroidOreo. Enjoy! @darrinlim #AndroidOreo is ready to save the day. @CaseyRain How about those OREOs. Enjoy! #AndroidOreo @smartfilming Now we're dunking. Enjoy #AndroidOreo. @ahmedchaabane #AndroidOreo is pretty sweet. @LeeroyJenkins 😉 One thing is for sure, we're celebrating #AndroidOreo today. @iantangprvte The world’s favorite cookie is your new favorite Android release. #AndroidOreo @Mike_Virata The sweetest eclipse yet. #AndroidOreo @OscarSalguero #AndroidOreo awaits. Enjoy! @iAm_erica You might not be able to eat Oreos, but you can enjoy #AndroidOreo 😉 From superheroes to sweet treats, #AndroidOreo knows how to celebrate. What are you looking forward to about Android 8.0 Oreo? https://t.co/aHUsrR5Ap4 @Wolfdale64 #AndroidOreo is the sweetest release yet. Enjoy! @roberterrera During #SolarEclipse2017, #AndroidOreo came to Earth to make life easier, brighter and more fun. @YummyANA Pretty sweet, isn’t it? #AndroidOreo @jerflash Our sweetest release yet. #AndroidOreo @magudesh96 A super sweet superhero will be coming to your device to save the day. #AndroidOreo @Oreo Time to Open Wonder. https://t.co/CqnIWjnNqk @NassarMehmood That is o-mazing news. Enjoy, #AndroidOreo. @Oreo Sounds like a slam dunk to us 😉 @tonyofrancis 👍 to celebrating #AndroidOreo @Hemisha360 The world's favorite cookie is your new favorite Android release. #AndroidOreo @SxbGG You never know...🍑🍿🍕 But for now, we're celebrating #AndroidOreo. @Oreo The sweets of Oreo and the smarts of Android - combined, it’s sure to be the best update yet. @MKBHD Slam dunk status, just like #AndroidOreo. @ItsPatLogic It's the sweetest release yet. Enjoy, #AndroidOreo! L’ready or not, you’ve made it to the sweet treat hall of fame. #AndroidOreo https://t.co/V7LDSDb6Tw #AndroidOreo will start rolling out in phases soon to Pixel &amp; Pixel XL phones, the Pixel C tablet, &amp; the Nexus 5X, 6P &amp; Nexus Player. 🎉🎉🎉 https://t.co/xhQ7JApR07 @riggaroo @Oreo O, that looks delicious. #AndroidOreo has touched down on planet Earth. See how our superhero makes your device smart, powerful, fast, &amp; secure.  #SolarEclipse2017 https://t.co/Lkz4qSZunu Android meets @Oreo for the sweetest treat yet. #AndroidOreo is smarter, faster, &amp; more powerful. Open Wonder: https://t.co/QOWlL83sYa https://t.co/v90f9qgpJ5 The wait is over! Watch the big #AndroidO reveal live: https://t.co/Cn225PKrV8 #SolarEclipse2017 @shaswat_doctor The wait is almost over! #AndroidO @azmainsyed 😍 #SolarEclipse2017 is going to be O-mazing. #AndroidO When the ☀ &amp; 🌜 meet, they bring something sweet. Join the #AndroidO livestream tomorrow at 2:40 ET: https://t.co/7nslzmxar3 #Eclipse2017 https://t.co/Ck3Teo52QF Something super &amp; sweet is coming during #Eclipse2017. Tell us - what do you think #AndroidO will be? https://t.co/iAnze1nrEF RT @lockheimer: #AndroidO? 8.O, O, O, O, O, O, O or O... 🤔 https://t.co/YvzhCk2DJv @5Sy_ Hmm. Please follow us and let us know when you do so we can move this conversation to DM. A bird? A plane? No, it’s #AndroidO, touching down to Earth for #Eclipse2017 &amp; bringing super (sweet) new powers: https://t.co/7nslzmxar3 https://t.co/MFxHxUdiia @5Sy_ Uh oh.  Let's try clearing the app cache. Just head to Settings &gt; Apps &gt; Android Pay &gt; Clear Cache. Keep us posted! @5Sy_ Hi there. Just to confirm, are you receiving any error messages while using Android Pay? Let us know. We'll do our best to help. RT @nokiamobile: Introducing the new #Nokia8 with Dual-Sight mode, our most powerful Android smartphone. #Bothie #Nokiamobile https://t.co/… We’ve got #BackToSchool on the brain. How do you use your #Android device during study sessions? @_joanneling Hmm. Try the troubleshooting steps in this guide: https://t.co/8oi0LT3Dhg. Let us know if that helps. #AndroidTip: With @waze for #AndroidAuto, pre-program your top destinations to your in-car display and get going with one simple tap. https://t.co/c8P2fO7Jl0 @_joanneling That's great! Yes, you can use Android Pay to pay in stores. More info here: https://t.co/eKZG8qUBtS. Let us know if you have any questions. @_joanneling Hi there. Have a look at this guide for info on how to set up Android Pay: https://t.co/RLv6K4fG8y. Let us know if that helps. RT @YouTube: Things just got a whole lot bigger for your little one.\n\nYouTube Kids is now available for Android TV! https://t.co/4aQp6rwx1U… @Hazardleader Hi Rolando. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. What’s your trick for the perfect selfie? @RevDrew Hi there. Our product team greatly appreciates feature suggestions. You can submit it in the Android Pay app under Menu &gt; Send feedback. Talk the talk in a new country with these Language Learning Apps: https://t.co/4vlod2Kleq https://t.co/2Kff6BdVof @frostaldima Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @evercode Hi Christian. We're aware of this issue &amp; looking into it. Thanks for reaching out. #IceCreamSandwichDay trivia time: Do you remember the Easter Egg for this #Android OS? https://t.co/w5ZiMqMAit With @GoogleMaps time graphs, find the no-traffic sweet spots. Know when the best time to leave is so you can avoid sitting in the red. https://t.co/l2pDjqcdwQ Spend less time sharing memories and more time making them. @GooglePhotos Shared Library makes it easy: https://t.co/KX7sEwHrAR #AndroidTip https://t.co/x6ZV0P8Sgv @elotrodude Hmm. We'd like to chat about this. Please follow us &amp; let us know when you do so we can reach out over DM. @elotrodude Hi Antonio. Could you share more details about what's happening? We'll do our best to help. @vvs_09 Hi Viraj. Thanks for your interest. We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @waze Good things come to those who Waze. With #AndroidAuto and the #WazeCommunity, let’s outsmart traffic together. ❤️🚗🕶️ RT @waze: It’s official, @Android Wazers—#Waze for #AndroidAuto is here. Plug your Android into a compatible car &amp; Waze away. https://t.co/… Guess what, Spain? You now have a better way to pay! #ICYMI: #AndroidPay is now in Russia, Canada, and Taiwan too. https://t.co/Ma0h3y196L https://t.co/55PvGKi4Vw For Jeremy Lin, the hard work doesn't stop during the offseason. See how Huawei Watch 2 powered by @AndroidWear keeps the Linsanity alive. https://t.co/eR8sXRkQtd @respros Hi Steve. Sorry about that! We'd appreciate it if you open Pay &gt; tap menu icon &gt; Send feedback &gt; check \"Include system logs. @DamienVignol You're welcome, Vignol! Feel free to reach out if you have any questions in the future. We're just a tweet away. @liamgill Mind if we jump in, Liam? We'd like to chat about this. Please follow us &amp; let us know when you do so we can reach out over DM. How often do you change your #Android’s wallpaper? @DamienVignol Hi Vignol. Have you unlocked your bootloader, rooted your device, or installed a custom ROM? Let us know. We'll do our best to help. @RoosterWasTaken Hi there. Mind if we jump in? Could you tell us more about what's happening with Android Pay? We'll do our best to help. RT @Google: Snacking our way through #NationalJunkFoodDay with @Android sweets. https://t.co/VTf7j7AZI8 RT @Google: Now on Android with a new recording experience: Motion Stills, our app that creates smooth videos and magical GIFs → https://t.… Color your world – and your @AndroidWear. You can choose your own watch face, but thankfully you don’t have to choose just one color. https://t.co/UFM0ZCq8Bq Puzzles, paradoxes, problems. Whatever you call them, here are the best games to test your logic: https://t.co/vbjboEb5ZH https://t.co/b2ZUZiKJVg @jeromegreutmann Hi Jerome. Let's move this conversation to DM for assistance. @estorco_ Hi there. We appreciate your interest. However, that's not something we currently support. Thanks for your feedback. @veer_singh1205 Hi Veer. Thanks for your interest. We don't have news to share about that right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. 💚💚💚 just doesn’t really seem to do it justice. How would you describe yourself using emojis? #WorldEmojiDay https://t.co/QA7T1jlfJO RT @Google: Breaking up is hard to do, but on #WorldEmojiDay, we’re saying #BlobVoyage to our old Android emojis, the \"blobs\" → https://t.c… @ElCajonDesasTIC Hi there. Thanks for your interest. More countries coming soon. Please keep an eye out for announcements here: https://t.co/Z3ydjsSOz2. @dickso9 Hi there. Thanks for your interest. We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. It’s Game. Set. Tap. with this #AndroidPay easter egg. Purchase in store to see a 🎾 surprise. https://t.co/SHhaP9vqlM @possessedone Understood. Please follow us &amp; let us know when you do so we can move this conversation to DM for further assistance. RT @AndroidWear: And the ❤️ beat goes on. With #GoogleFit you can track your heart-rate from the office to the trails. #AndroidWear https:/… @possessedone Hi John. Just to confirm, are you using a mobile card or a physical card? Let us know if it's listed here: https://t.co/FxMhqF3pgq. @RobotFencer Understood. Please submit the feedback &amp; also include your twitter handle. Go to: Android Pay app &gt; 3-dot menu &gt; Send feedback. @RobotFencer Got it. Could you let us know if your default card is a credit or debit card? We want to help. @RobotFencer Hmm. Just to confirm, was your phone locked when you tried to use Android Pay or had it been unlocked for a long time? Keep us posted. @RobotFencer Hi Robby. Are you sure it was a credit card, not a debit card, when you were asked for a PIN? Let us know. We'll do our best to help. Prepare for the road ahead. Navigate, listen to music, &amp; reply to texts with your voice. Download #AndroidAuto now: https://t.co/qKI7C9NbNg https://t.co/E2EvJXVYZF #AndroidTip: Press &amp; hold on select apps to find your new shortcuts to productivity. https://t.co/VrIhYvidOG @HemingwayWu426 Hi. The number of offline transactions varies by bank. The app will prompt you to connect to the Internet once the limit is reached. What’s your favorite #Gboard feature? (Don't see it? Reply back!) #Android @TheRobfather91 Hi Rob. Please follow us &amp; let us know when you do so we can move this conversation to DM. @Kunspop Hi Lucas. Please follow us &amp; let us know when you do so we can move this conversation to DM. @singwei79 Hi there. Thanks for your interest. We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. One minute you’re planning, the next you’re taking off ✈️ Customize your #Android widgets &amp; apps for every step of the process. https://t.co/xZdESSu16O Wander without getting lost. Save @GoogleMaps offline to keep your camping trip from getting in-tents. 🏕 https://t.co/npte6kc9Cy https://t.co/rscdWZeVWJ @infideler You may report it now. Our Product team will look into it. @infideler Hmm. Could you report the feedback here: Open Pay &gt; tap menu icon &gt; Send feedback &gt; check \"Include system logs\" box. @infideler Hi again. Just checking in, did the troubleshooting steps help? Let us know. We’re here to help. @iamsp19 Hi Shrinjoy. Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @GauravKhiani93 Hi Gaurav. Thanks for your interest. We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @infideler @HuaweiDeviceUSA Hi Jason. Have a look at this guide (see \"Fix a problem\" section): https://t.co/s6Fcb2AIpq. Let us know if it helps. #Pride doesn’t stop in June. Save your favorite #Android wallpaper and let the celebration continue 🏳️🌈 https://t.co/5oRE4oaYhD @infideler Hi Jason. Are you receiving an error message while using Android Pay? Let us know, we'll do our best to help. @witbrock Hi Michael. Could you tell us more about what's happening with Android Pay? Let us know. We'll do our best to help. @WLagasse Thanks for the info, Calvin. We recommend contacting the device manufacturer for further assistance here: https://t.co/sKxF3VjpUW. @WLagasse Ok, then. Could you let us know the make and model of your phone? We'll do our best to help. @WLagasse Hi Calvin. Just to confirm, are you using a phone running Android 4.4+ that supports NFC &amp; HFC? More info: https://t.co/RLv6K4fG8y. @AndresonGoveia Hi there. Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. App in the Air: Flight Tracker on @AndroidWear is the new wing man. Track your ✈️ and navigate airports with ease: https://t.co/5CbJlj6YTp https://t.co/6E5lAh7GkG @a_bataba Hi there. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. Happy #pride month ❤️💛💚💙💜 How will you #ShowUp? https://t.co/XmHzrUkhS6 https://t.co/kkeFD0pXyM @jcmm33 Understood. Banks have to sign up to participate in Android Pay. Once your bank signs up, you'll be able to add your card(s). Hope it helps. @jcmm33 Hi Jamie. Could you confirm, if your card is supported with Android Pay: https://t.co/hgI9xS3DFg? Let us know. We'll do our best to help. @evanroden1 Hi Evan. Have a look at this for the list of participating banks and supported cards for Android Pay: https://t.co/qHXpJepnDP. Adding your debit and credit cards into #AndroidPay is easier than a cannonball. Learn how: https://t.co/XvkCJzRlfg https://t.co/9qUDgckeSa @Rjestamina Uh oh. Please follow us &amp; let us know when you do so we can move this conversation to DM. @Rjestamina Hmm. Just to confirm, are you trying these steps to add a card: https://t.co/GnJL3fy2Qf? Let us know. RT @Google: This year, we can make #Pride2017 bigger, louder and prouder than ever before. How will you #ShowUp? https://t.co/bnqelWBW7f ht… @Rjestamina Hi Ryan. Could you tell us more about what's happening with Android Pay? We'll do our best to help. Sun. Surf. Selfie. One of many ways to celebrate #NationalSelfieDay. https://t.co/SXEiT5HrP4 Workout anytime, anywhere. Get your ❤️ pumping with the 7 Minute Workout App for @AndroidWear. No equipment needed. https://t.co/g7njHtd3Wu https://t.co/uFyPUL6hbZ Lights out. Color Inversion on. See how #Android can make late-night texting easier on the eyes: https://t.co/EYHpMrMuoj #AndroidTip https://t.co/g5FC3J5gpB @Indrajithonline You're welcome. Reach out if you have any other questions in the future. @Indrajithonline Hi Indrajith. Android Pay isn't available in Sri Lanka yet. For updates see here: https://t.co/Z3ydjsSOz2. Beep. Beep. Find your 🚗 faster with #GoogleMaps on #Android. Place a P where you park and let Maps do the rest. https://t.co/Gj1gk9xLc9 @Tonaymech You're welcome, Tonay! Feel free to reach out if you have any other questions. We're just a tweet away. @Tonaymech Thanks for your interest, Tonay. More countries coming soon. Please keep an eye out for updates here: https://t.co/7wA1sYtF2B Just 7 days until the @OnePlus 5 launch on June 20. The countdown is on! https://t.co/jtYKK5wr2o https://t.co/QJ1fYbPBI4 @ReeceBoast Hi there. If your bank offers phone verification, it's up to them to determine the necessary verification details:  https://t.co/F3IBhj5qEa. Watch livestreams and videos right on your 📺 The Facebook app is now available on #AndroidTV. https://t.co/avoW9vRta5 @pdwilco Hmm. We'd like to chat further about this. Let's move this conversation to DM. @pdwilco Hi Paul. Could you try removing and re-adding the card? Let us know if that helps. Misplaced phone AND it’s on silent? Find My Device is your new BFF. Use the ‘Play Sound’ option for high 🔊 even if it’s on silent. https://t.co/650CdwxDid @ThomasRVPE Thanks for your interest, Thomas. Banks have to sign up to participate in Android Pay. We recommend contacting them to discuss further. @AlwaysARedhead Hi there. Could you tell us more about what's happening with Android Pay? We'll do our best to help. @Blod_wen Sure thing. Let us know how it goes. We're just a tweet away. @Blod_wen Hi Anna. Next time you're there, try keeping your device up against the terminal until the gate opens. RT @AndroidWear: For meetings, get togethers, and everything in between, keep your whole life organized on your wrist with #AndroidWear. ht… #NationalDonutDay: A perfect excuse to go crazy on the 🍩. https://t.co/kbIZzAXdj5 @CallumAFK This feature isn't available at this time. However, you can submit a feedback here: Android Pay app &gt; Menu &gt; Send feedback. @CallumAFK For low value transactions, Android Pay doesn't automatically prompt you to unlock your device for every transaction. @CallumAFK Hmm. Are you able to make a payment with Android Pay? Keep us posted. @CallumAFK Hi there. Just to confirm, have you set up a PIN, pattern, password or fingerprint screen lock? Let us know. We'll do our best to help. @PatrickCardin Hmm. We’re adding more issuers and supported cards all the time. For updates keep an eye on: https://t.co/Z3ydjsSOz2. @PatrickCardin Hi Patrick. Have a look at this guide for info on supported cards for Android Pay: https://t.co/M7QSrFTsHv. Let us know if that helps. It’s that time of year: 🎓🎓🎓 Get those last minute gifts the easy way with #AndroidPay. https://t.co/e0LyWUJDkC https://t.co/fYS3jbiGMV @rmoldovanyi Glad to know it worked, Richard! Feel free to reach out if you have any other questions. We're just a tweet away. @rmoldovanyi Hi Richard. Could you tell us more about what's happening with Android Pay? We'll do our best to help. @MikeTonio Hi Mike. Have a look at this guide for info on supported cards for Android Pay: https://t.co/M7QSrFTsHv. Let us know if that helps. @babu_s23 Hi there. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsBdas  for updates. @sebgob Hi there. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsBdas  for updates. @VarunRBharadwaj Hi there. Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @DWAYNEGRACE151 We recommend you to contact the app developer here for assistance: https://t.co/2MfHQJLgue. Hope this gets resolved. @sanat2285 Hi there. Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. #AndroidPay is now available in #Canada 🇨🇦.  An easier way to pay is already in your hand: https://t.co/Y85ULkyHsN https://t.co/kNmasq7bge @DWAYNEGRACE151 Hmm.  What's the make and model of your device? Let us know and we'll do our best to help. @DWAYNEGRACE151 Hi Dwayne. Could you tell us more about what's happening? We'll do our best to help. @mschlotz23 Hi Matt. Have look at this guide to add a payment method (See \"Add another payment method\" section): https://t.co/xigzrchckO. RT @AndroidWear: Pack your bags, grab your #AndroidWear, and go exploring. The 🌎 awaits. https://t.co/8K9qONQy8B @gauravmunjal Hi Gaurav. Currently, there are no widespread issues with Gmail. What seems to be happening? Let us know. We're here to help. RT @AndroidWear: So much to see and so much to do, all on a busy parent schedule. Stay organized with #AndroidWear. https://t.co/djcHmqamI0 @Kostya1338 Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @mandoc08 Reach out if you have any other questions in the future. We're just a tweet away. @mandoc08 Hi Manish. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @_TheWebbyOne Hi Pete. Glad to know its working now! Reach out if you have any other questions in the future. We're just a tweet away. So long, #io17. Until next time! #AndroidAdventures https://t.co/rcCsEo0BUn RT @AndroidWear: It’s not goodbye, it’s see you next year. Celebrate #io17 in style by finding your perfect @facer_io match: https://t.co/u… @RishabhTheCharl Thanks for your interest, Rishabh.  More countries coming soon. Keep an eye out for updates: https://t.co/7wA1sYLfU9. @riteshroyTC Hi Ritesh. Thanks for your interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsBdas for updates. @Travis_Murdock We've sent you a DM with the next steps. Please check and let us know if you have any questions. @Travis_Murdock Thanks for the info. Let's move this conversation to DM so we can connect you to a specialist for further assistance. @Travis_Murdock Hi Travis. Could you confirm if your card is supported with Android Pay: https://t.co/wQQaHX6dEH? Let us know. #AndroidAdventures and #io17: a perfect pair. Who's ready for Day 3 tomorrow? https://t.co/q9WYfLkdNu Tap your way to treats with #AndroidPay. Learn more about expanded payment &amp; loyalty experiences: https://t.co/bdBHdx81Gv #io17 https://t.co/FoKV3beZmP #ICYMI: @VolvoCarsGlobal &amp; @Audi are integrating #Android into their next generation of 🚗 #io17 https://t.co/VD8u7dPqcZ @kanthalaraghu Hi Raghu. Thanks for your interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. What #AndroidO feature are you looking forward to the most? #io17 Busy day? Here are all the big #Android announcements from #io17 that you might've missed: https://t.co/DiYQcbNLyg https://t.co/yTI5a68eYO Rest easy with Google Play Protect. See how #Android’s machine learning systems make your device safer. #io17 https://t.co/3MjTIHxG2k Google Play Protect is always on, always improving &amp; on any device with @GooglePlay. #io17 https://t.co/t1yGm7tZY3 @coderinheels Add it to the collection. #io17 @ykro @kotlin 🎉🎊🎉🎊 #io17 @kristinmars We're a big family, and we're glad you're a part of it. ❤️ #io17 Did you sneak a peek at #AndroidGo? A new experience is coming to entry-level #Android devices. #io17 https://t.co/A9XogCuZyJ Exciting news, developers. @Kotlin is officially joining the #Android family. #io17 https://t.co/Q4CLlWfC3B #AndroidO brings a more fluid experience to your device. Here’s a first look at a few new features coming later this year. #io17 https://t.co/TwKU0ftZFE RT @lockheimer: Sweet news! Celebrating 2 billion monthly active devices worldwide, made possible by you. Thank you for joining the @androi… Looking good, #AndroidTV. #io17 has brought a new look to your 📺  for better content discovery. Sit back, relax, and enjoy. https://t.co/nZ4zmmJwPr With #AndroidAuto, there are 3 different ways to experience hundreds of apps in your car. Learn more: https://t.co/bi7c7b0i0t #io17 https://t.co/nt6scRmsjS Almost 50 watches and counting! There's no stopping the @AndroidWear momentum. Have you found your ⌚ match yet? #io17 https://t.co/9dv4i2MyoR @mattswider @techradar It's happening all right. #io17 @suka_hiroaki We've got the feeling that you're right 😉 @elevtechlift Hi there. Thanks for your interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. We've made it to #AndroidNougat. With #io17 around the corner, we want to know what your favorite OS feature for N is. It's that time of year. #io17 kicks off tomorrow! Watch the livestream at 10am PT: https://t.co/JB22fMUopA https://t.co/vQMVVenEyN Next stop on I/O memory lane: #AndroidMarshmallow. What was your favorite feature with this OS? #IO17 @jamiebutt Hmm. Could you confirm if your card is supported by Android Pay: https://t.co/xRBMelPTaI? We'll do our best to help. @Misha_Strend Hi there. Thanks for your interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @wabremini You're welcome. Reach out if you have any other questions in the future. We're just a tweet away. @jamiebutt Hi Jamie. Have you received any error messages? Let us know. We'll be happy to help. @kamil_papernik Hi Kamil. Thanks for your interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @wabremini Hi there. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. Before #IO17, we're taking a trip down memory lane. What's your favorite #AndroidLollipop feature? We're gearing up for I/O next week: Which past I/O announcement doesn't line up with the right OS? #IO17 @Dickmasofficial Hi there. Thanks for the interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. Museum hours have nothing on #GoogleAssistant. Tag the extra help into your Allo conversations. #AndroidTip https://t.co/nFPyZpu7bm @QuahEric Hi. Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. Now there’s an easier way to jam. Listen to your @GooglePlayMusic tunes with @AndroidWear 2.0. No phone needed. 🎧🎶⌚ https://t.co/sALlYdBod8 @Motwera Hi there. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @Zaptor99 Hi there. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @QuahEric Hi Eric. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsBdas for updates. @Sujeethkmrs Hi Sujith. Thanks for your interest! We don't have news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. #DidYouKnow that when you sleep, your device does too? Doze Mode gives your phone enough 🔋 for an alarm. #AndroidTip https://t.co/9n2FJvL3At https://t.co/1wcIJzRDGa @TYIterer That's odd. Please follow us &amp; let us know when you do so we can move this conversation to DM. @nigelwUK Hmm. Please follow us &amp; let us know when you do so we can discuss the next steps over DM. @nigelwUK Got it. Could you try removing and re-adding the card? Let us know if that helps. @rclarkecf You're welcome, Richard. Welcome aboard! Let us know if you have any questions. We're here to help. @Androide_Carlos Hi there. Thanks for the interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @TYIterer Hi again. Just checking in, did the troubleshooting steps help? Let us know. We’re here to help. @AFCMW Hi Aldrich. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @KishorDip Hi Yash. Thanks for the interest! We don't have news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @rclarkecf Hi Richard. For Android Pay you'll need a phone running Android 4.4+ that supports NFC &amp; HCE. More info: https://t.co/RLv6K4fG8y. @nigelwUK Hi Nigel. Just to confirm, have you got a new card that replaces the expired one? Let us know. We'll do our best to help. @Iron_rival Hi there. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @ewoudwerf Hi there. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @nickoy1channel Thanks for your interest. We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @MJTejasva287 Hi Tejasva. Thanks for your interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @AChetverov Hi Aleksandr. Thanks for your interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. Tap. Pay. #StarWarsDay. Use #AndroidPay in stores all week and discover 7 of your favorite characters. Who did you find? #MayTheFourth https://t.co/a6741SzGB5 @TYIterer Give the steps a try &amp; let us know how it goes. @TYIterer Hmm. Have a look at this guide (see \"Trouble using Android Pay in stores\" section): https://t.co/Sakxx21XtO. Does that help? @TYIterer That's strange. Are you seeing an error message? Let us know. We'll be happy to help. @Joen93 Hi Jeroen. Have you tried reverting back to an original factory build? Android Pay should be available there. Does that help? @imgavhopkins You're welcome, Gavin! Reach out if you have any other questions. We're just a tweet away. @imgavhopkins Yes, if you turn your screen lock off, Android Pay removes your cards for your protection. Hope this info helps. @imgavhopkins Hi Gavin. Yes, Android Pay prompts to set up a screen lock on your device. You’ll need to unlock your phone to make purchases. @lgonoude Hmm. We recommend you contact your devices manufacturer to share your feedback about Android Pay compatibility. @lgonoude Mind if we jump in, Leon? For security reasons, Android Pay isn't compatible with rooted/modified devices. Hope this info helps. Swapping hobbies? Update what matters most when you sort apps by ‘last used.’ #AndroidTip https://t.co/Bzq1MKSJ1X @ZealGD Hi there. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @Pharmacist_Guy Screenlock helps to protect from unauthorized charges if your device is lost or stolen. More info: https://t.co/kptl99C2jo. @Pharmacist_Guy To use Android Pay your phone can be secured w/ fingerprint, PIN, pattern, or password. More info: https://t.co/DvZN30jU4C. Keep your 👀 on the road and the music in your 👂. Distracted Driving Month calls for #AndroidAuto: https://t.co/31Ie6Vuagg https://t.co/35sKVtvyDN #AndroidTip: Go from English to 日本語 with ease. All it takes is the Gboard to become an expert text translator. https://t.co/qDHBDDp0Lz https://t.co/Ohzxs7tsD2 @Mcload23John Hi John. Thanks for your interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @hrdpgajjar Hi Hardip. Thanks for the interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. Thanks @tasirdiwan, @RadhiAlshammar3, &amp; @i_Archive for sharing your home screen. Show us what yours looks like using #myAndroid. https://t.co/Dd5mGkJxw3 @Sebianoti Understood. Have a look at this handy guide: https://t.co/b15REMaxQ5. Let us know if that helps. @ZaidMell Hi Zaid. Thanks for your interest! We don't have news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. Practice your green thumb today. Happy #EarthDay! 🌼🌸🌻 https://t.co/lHkegospat @premsrirat That's not the experience we want you to have, Michael. Are you seeing an error message? Let us know. We'll be happy to help. @metalnakls Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. Widgets on widgets. From telling time to tracking 📅, customize your @AndroidWear with Chronus watch face: https://t.co/L6mP0vmAoS https://t.co/uFCW498YCF @rajshrestha75 Hi Raj. Thanks for your interest! We don't have news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @Three20kbps Hi there. Next time you make the transaction, ensure to hold the phone near to the pay point till it completes. Hope it helps. It’s not magic, it’s #AndroidPay. Tap at checkout for an easy way to pay with your phone ✨ https://t.co/fhpeR5Ib1h https://t.co/LWSHDXs1VY @RaminNoodles86 Hi there. Thanks for the interest! We don't have news to share now but, keep an eye on https://t.co/Z3ydjsSOz2 for updates. @Prasanth_Sai123 Hi Prasanth. Thanks for your interest! We don't have news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @andymosley46 Hi Andy. Could you confirm if this happens with multiple payment methods that you use? Let us know. @RodMarAbig Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. New season, new home screen. Save your favorite #Android wallpaper for a fresh, spring look. #myAndroid https://t.co/NriWSPIujn @DavidSive Hmm. We'd like to discuss further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @DavidSive Hi David. Have you disabled screenlock recently? Let us know. We'll do our best to help. #AndroidTip: Set digital ground rules for the kiddos with the Google Family Link app. https://t.co/rUtpiW5ZFh https://t.co/OcOQEfbXXM @scmorange16 Hi there. Thanks for the interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @Sebianoti Hmm. If you've the pattern screenlock enabled, you need to remove it &amp; use the PIN screenlock in order to use both the apps. @Sebianoti That's not the experience we want you to have, Sebastian. Just to clarify, have you disabled screenlock recently? Let us know. @_kar29 Glad to hear it's sorted. We don't have any news about availability of Android Pay in India. For updates: https://t.co/Z3ydjsSOz2. @_kar29 Hi Kartik. Android Pay isn't available in India yet. Also, the charge is a temporary authorization check that'll be released soon. For every passion, there’s home screen customization. Share what yours looks like using #myAndroid. https://t.co/bZczrpZMmb @TheAcornWarrior Ok, then. Feel free to reach out if you have any questions in the future. We're just a tweet away. @Ickedope Hi Mitch. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @TheAcornWarrior Hi again. Just checking in on this one! Were you able to use Android Pay? We're happy to help some more. @bernardshuford Hmm. Are you trying these steps to make a payment with Android Pay: https://t.co/eKZG8qUBtS? Keep us posted. @bernardshuford Hi Bernard. What's going on with Android Pay? Let us know. We'll do our best to help. @jayeshdixitmumb Hi Jay. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @rotiwilly000 Thanks for the info, Obende. However, Android Pay isn't available in Nigeria currently. For updates: https://t.co/Z3ydjsSOz2. @rotiwilly000 Hmm. Could you let us know if your card is supported by Android Pay here: https://t.co/IMJYeivfuH? Keep us posted. @rotiwilly000 Hi Obende. What's going on with Android Pay? Tell us more. We'll do our best to help. @jetAngel58 Hi Peter.  Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @TheAcornWarrior Sure. Let us know how it goes. @TheAcornWarrior Hmm, let's try these steps: (see \"Trouble using Android Pay in stores\" section): https://t.co/dzm2xu1zMr. Does that help? @carguy1735 Hi there. Thanks for your interest! We don't have news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @TheAcornWarrior Hi there. What's going on with Android Pay? Let us know. We're here to help. You will want to park it for this #AndroidTip. Text with your voice when your hands are full… or even just because. https://t.co/HQJXoi6AHM https://t.co/m4BptXKY0T Counting reps is a thing of the past. Enjoy more workout features with #AndroidWear 2.0. https://t.co/XKJH94JCSI RT @Google: Sometimes getting an error can be pretty sweet. Happy 404 Day. 🍬 https://t.co/fMPwGoYmWs https://t.co/3BVFOoK2uF The robot is more than a dance. It’s a lifestyle. Enjoy an easier way to pay for groceries &amp; more with #AndroidPay: https://t.co/fLLE7PPaT5 https://t.co/o3pHZSLzcA Party. Bash. Fiesta. Fête. 파티. Whatever you call it, happy #WorldPartyDay. 🎊🎉🎊 https://t.co/IcBS1takUV @xXdab0mbXx Hi Matt. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @merman101 Yes, Luke. Screenlock must be on as it maintains security &amp; protects from unauthorized charges if your device is lost or stolen. @merman101 Hi Luke. Just to confirm, did you receive an e-mail about the card being removed? Let us know. We'll do our best to help. Treat yo self to a home screen makeover. Find your perfect home &amp; lock screen with #myAndroid: https://t.co/aigHUHycFt #AndroidTip https://t.co/6OxIPQJTiY With #AndroidAuto, dismiss cards with a swish of your finger. Download here: https://t.co/vt7y6k1Y94 https://t.co/toyx0oMpdg @CaraReay You're welcome. Glad its working now! Feel free to reach out if you have any other questions. We're just a tweet away. @CaraReay Hi Cara. Just to confirm, are you receiving any error messages while adding your card to Android Pay? Let us know. Type fast. Emoji even faster. #AndroidTip: Give your keyboard personality with #myAndroid: https://t.co/cFRcRDFAS3 https://t.co/ctd9jR89AC Answer more questions like this to find a home screen that matches your vibe 👌 https://t.co/nV0U3cnAkw #myAndroid https://t.co/nYTAnvka7p You can customize your home screen based on your priorities. Are you more of a meme-sender or an email-checker? #myAndroid @surfie007 Hi there. Banks have to sign up to participate in Android Pay. Once they do, you'll be able to add your card(s). Hope this helps. @ivan_talboys Thanks for the info. Try using Android Pay after re-adding card details. Let us know how it goes. @ivan_talboys That doesn't sound good, Ivan. Tell us more about what happens when you make the payment. We'll do our best to help. @Duarteosrm Hi Duarte. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. Icons: the pepperoni to your 🍕 Redesign icons to match your wallpaper with #myAndroid: https://t.co/qjO6zWTmTV https://t.co/DboVRwFvaP @Jonny_Davies_ You're welcome, Jonny. Let us know how it goes. @Jonny_Davies_ Yes, you'll have to set Android Pay as the default payment method. More info here: https://t.co/kC7n89mzyZ. Keep us posted. @Jonny_Davies_ Hi Jonny. What's going on with Android Pay? Let us know. We'll be happy to help. Another color option for @OnePlus. Midnight Black never looked so sleek. https://t.co/e0nWKN4saB #OnePlus3T https://t.co/F51SHP8JwU See what you want without opening an app. #AndroidTip: Long press on the home screen to activate widgets. #myAndroid https://t.co/nV0U3cFbJ6 https://t.co/IFnktzkcAH @amaanhussain Hi Amaan. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @xXdab0mbXx Hi Matt. Thanks for your interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. #AndroidTip: Customize your icons, color scheme, and the entire layout of your 📱 with launchers. #myAndroid https://t.co/YZh4L29mQe https://t.co/yOKYJB8M2q @UKFX Hmm. Our product team greatly appreciates feature suggestions. You can submit it in the Android Pay app under Menu &gt; Send feedback. @UKFX Hi Lee. Just to confirm, are you receiving any error messages while making a payment? Let us know. We'll do our best to help. @varuen Thanks for your interest, Dave. But it isn't launched in Canada. Keep an eye on Android Pay for updates: https://t.co/Z3ydjsSOz2. @KanevMartinov Hi Ivan. Thanks for your interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. 🎵☔️📰 So many interests, so many options. Unlock &amp; share your dream screen with the #myAndroid Taste Test: https://t.co/2eBHtpfMla https://t.co/xEQwq7CmCm @GlossyYT Thanks for the info. Please follow us and let us know when you do, we'd like to connect you to a specialist for assistance. @GlossyYT Hmm. Could you let us know if your card/bank is supported by Android Pay? You can check the list here: https://t.co/qHXpJepnDP. @GlossyYT Hi there. Just to confirm, are you trying these steps to add a card to Android Pay: https://t.co/Rxn5rT1fyX? Let us know. @tmidlane Hi there. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @varuen Hi there. Android Pay isn't available in Canada yet. For updates: https://t.co/Z3ydjsSOz2. Hope this info helps. @Wazzy24 Hi Jeff. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. Want to have some fun? Take the #myAndroid Taste Test and show us your customized home screen. https://t.co/dQcCE8vOzp https://t.co/zpeceA8EVE 🎶 On the road again 🎶 @Spotify and @Waze are now integrated. Only on #Android. Learn more: https://t.co/KXOVgplWTU https://t.co/gFKKHsUOiH Pay your share without ever leaving the @Gmail app. 💵💸💰 Only on #Android. https://t.co/jWxEtY4JBV @mohsinabbbas Hi Mohsin. Android Pay isn't available in Canada yet, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. We’re going to need a bigger chalkboard. Happy #PiDay! https://t.co/vL1tDfMbNQ @oflahertyevents Thanks for the info. Please follow us and let us know when you do, so we can assist you over DM. @oflahertyevents Hmm. Could you also clarify if you have disabled screenlock recently? Keep us posted. @oflahertyevents Hi there. Just to confirm, did you receive an e-mail about the card being removed? Let us know. We'll be happy to help. @CaptainPedge Hi there. This was a problem on our end &amp; should be resolved by now. Try using Android Pay now and check if it works fine. @NFC_Junkie Hi Frank. This was a problem on our end &amp; should be resolved by now. Try using Android Pay now and check if it works fine. @alpower81 Hi there. Here's more info on where you can use Android Pay: https://t.co/BP2opu4bhG. Hope this helps. @MrZagata #myAndroid seal of approval @cbneese Thanks for checking out our 🚚. #myAndroid @tsokolove When you're done with that masterpiece come create another one with the #myAndroid truck - we’re right behind the ACC. https://t.co/gFMVGMPUK1 @NinjaJeremiahW New home screen, who dis? #myAndroid @BplusB_ Lookin' good 👍 #myAndroid They came. They saw. They customized. #myAndroid #SXSW https://t.co/Zbus1qMNaW @JavierJMED New home screen, same you. 😎 #myAndroid @jotajofre Love your home screen look. #myAndroid @AlyssaNewcomb Add #myAndroid to your #SXSW schedule. Come see us at the E 4th and Red River! https://t.co/Va5wYaPXKX @marc_saltzman We’d love to see how you’d customize the #myAndroid truck! Stop by, we’re right behind the ACC. https://t.co/65sucp4Lt1 @EvaMarsalkova Hope you had fun. Enjoy the rest of #SXSW! #myAndroid @itsjeremy There's nothing dull about this #myAndroid home screen. @Cait_Waters Steps on steps on steps. Come swing by and see the #myAndroid truck in action at E 4th and Red River. https://t.co/wbrd6hlqDu @SynesthesiaRay When you're not waiting to meet and greet, come swing by the #myAndroid truck - we’re right behind the ACC. https://t.co/cq6Ed7qY3J @joanat We've got another bot you can meet. Add #myAndroid to your #SXSW schedule. Come see us at the E 4th and Red River! https://t.co/kMVXmq0c3d @Crepusculr @Nova_Launcher Now here's a way to get a coffee fix. #myAndroid @Schiavon_Mattia #myAndroid looking 👌 @ARud718 Looks like you found a #myAndroid screen that suits your style. @spoooooots #myAndroid has its ways. @lawRathod 🏔️ #myAndroid @DWARFAKIIHN 👌 #MyAndroid @WilliamEdHarvey ICYMI: We brought a truck covered in LEDs to #SXSW. Come check it out! #myAndroid https://t.co/HEOPBUoOaF @dsvcr28 ⛰️⛰️⛰️ #myAndroid @sal19 After the panel, we'd love to see how you'd customize the #myAndroid truck! https://t.co/TwZzRUU8o0 @lekomi 🔥🔥🔥 #myAndroid @AraWagco We'd can't wait to see how you'd customize the #myAndroid truck! See you soon. @jeancase After your event, stop by the #myAndroid truck! We're located right behind the ACC. https://t.co/HTOsV7BGFs @CloonanJ Need a break after the panel? Come swing by the #myAndroid truck - we’re right behind the ACC. https://t.co/vsuaRGG3yQ @sdavy Need a break between panels? Come swing by the #myAndroid truck - we’re right behind the ACC. https://t.co/B31X0DFohS @LillyRockwell Bring the whole family to the #myAndroid truck. We're right behind the ACC! https://t.co/wE5HNDQIlj @tnkgrl After gaming, add #myAndroid to your schedule. Check out our truck covered in LEDs! https://t.co/vzGKHxbnc5 The #myAndroid 🚚 is still open for business. What would you put on the LEDs at #SXSW? https://t.co/qpOpBpIaE6 @ejpritch @createcultivate @TheSocialLights Add #myAndroid to your #SXSW schedule. Come see us at E 4th &amp; Red River! https://t.co/5rm7ZW5Yma @kmyapp Need a break from the weather? We’d love to see how you’d customize the #myAndroid truck, right behind the ACC! https://t.co/drCa8yuys5 @MrsTingen Flower power ✌️ ️#myAndroid @KevinBourgeois ✌️ ️#myAndroid @AashuSRaveendra Looks great! #myAndroid Rain or shine, the #myAndroid truck is 💯✨👍 https://t.co/rOT9e4pIXD @vmortizs20 That's a doggone great screen. #myAndroid @EmilyCBrewer A home screen as unique as you 😎 #myAndroid @829randy 😎😎😎 #myAndroid @andra_febrian18 👌 #myAndroid @ewhitmore It's not everyday there's a LED covered truck. Come check it out! #myAndroid https://t.co/Zyn8TJtEc8 @tourphish Bright lights, big 🚚 #myAndroid @feetswOw New home screen, same you. ❤️️ 😎 #myAndroid @jolingkent Now that you've refueled, stop by the #myAndroid truck right behind the ACC! https://t.co/4deavCX6vf @shannoncason ICYMI: We brought a truck covered in LEDs to #SXSW. Come check it out! #myAndroid https://t.co/mOeb6TZEB8 @MrJiri What did your #myAndroid Taste Test reveal? We'd love to see a pic of your home screen! @gregory Need a break after dinner? Come swing by the #myAndroid truck - we’re right behind the ACC. https://t.co/XZ4l5HACdw @MeganMOConnor Nothing like a customizable #myAndroid 🚚 to add to your experience. Come see us at E 4th &amp; Red River. https://t.co/MFbcXtyory @snagglepuss24 Home screen looks great 👍 One 🚚, so many #myAndroid looks. Which one is your favorite? #SXSW https://t.co/FDT37Q6oQ8 @JordanDunn Thanks for checking out our 🚚 🌮. #myAndroid @rachel_martino @NoelleBlog ✈️, 🚆, and the #myAndroid 🚚. Stop by, we’re right behind the ACC. https://t.co/tSlw7JokmY @sashaer03 Lookin' good 👍 #myAndroid @rdoherty20 🌏🌏🌏 @heyitsfranklin2 @talkthattrace Mmm delicious. Share some 🍰 with us - the #myAndroid truck is located right behind the ACC. https://t.co/RJ7peFd1ZG @jen_ator Great job on the panel 🎉. Come swing by the #myAndroid truck to relax &amp; unwind - right behind the ACC. https://t.co/p8gVkffGWc @SXSWMF Take a break from surfing and come swing by the #myAndroid truck. We're right behind the ACC. https://t.co/6PwONNhDEF @SLUent @SLU_Official Thanks for checking out our 🚚. #myAndroid @stephelisecarls Enjoyed having you. Have fun with your new #myAndroid home screen! @cheddarbob210 ⛰️⛰️⛰️ #myAndroid @SilverFazed So customizable, so cool #myAndroid @cavega_ Hope you had fun. Enjoy the rest of #SXSW! #myAndroid @AlizaLicht After you've refueled, add #myAndroid to your #SXSW schedule. We're right behind the ACC. https://t.co/o9xqBFy565 @nickthaskater New home screen, same you. 😎 #myAndroid @sfmorris Glad you're a #myAndroid fan! We'd love to see a screen shot of your home screen. @johannmardie #myAndroid seal of approval @OyeFlaco_ Sharing is caring. We'd love to see a screen shot of your home screen. #myAndroid @jordancarlhunt 😎😎😎#myAndroid @LauraHayesDC Need a break from the rain? Come swing by the #myAndroid truck - we’re right behind the ACC. https://t.co/hOxLb9ccGX @laz0rbrain 😁 is right. We'd love to see a screen shot of your home screen. #myAndroid @Todoleo #myAndroid 👍👍👍 @AlvaroPerezRod Thanks for playing! That's one good looking home screen 👍 #myAndroid @mvanlijden Rock on 🤘#myAndroid @ahmadmukhtarpk Couldn't have said it better ourselves #myAndroid @SapthagiriM We'd love to see a screen shot of your #myAndroid home screen 😍 @tumaycryus 😍😍😍 #myAndroid @VZorlescu Your #myAndroid home screen is out of this world 🌌 @metalm New home screen, who dis? #myAndroid @Hadr1en So customizable, so cool. What did your results reveal? @stephelisecarls 👋👋👋 Lights, Android, Action! At #SXSW? Come see the #myAndroid truck at E. 4th &amp; Red River. https://t.co/fj8BemlKfH https://t.co/QCSEmDld6s @spikypotato New home screen, same you. 😎 #myAndroid @derekmross Lookin' good 👍 #myAndroid @Kegan_says_hi Glad you're a #myAndroid fan! We'd love to see a screen shot of your home screen. @Mrc1Ntn Now that's a great #myAndroid home screen ❤️ @saiprasadsunny5 Nice #myAndroid home screen! @nicksmizzle This #myAndroid home screen is out of this world. @_CaMaY_ Now that's a home screen. #myAndroid @codanimex 😍😍😍 #myAndroid @markoftec There's a lot to love with the #myAndroid Taste Test. What did your results reveal? @starmoon4u We can't wait to see the finished #myAndroid product. @CunderscoreR The #myAndroid love is strong. Be sure to take the Taste Test and share your dream home screen with us. @HungryChronicle E 4th and Red River is where the #myAndroid fun is going down at #SXSW. @oJONEZo Well worth it. Your home screen is looking good! #myAndroid @Drakkainen_ 😎😎😎 #myAndroid @sugashwar Fun is our middle name. #myAndroid @Realisms Thanks for spreading the #myAndroid ❤️  We'd love to see a screen shot of your home screen. @_KA_Z 🎊🎉❤️😍 @YummyANA We like your #myAndroid style. @stephelisecarls #SXSW, surprises, and #myAndroid. It's going to be one for the books. @_stockburger We see what you did there. Be sure to take the test and share your results! #myAndroid Get ready to discover the home screen for you. The #myAndroid Taste Test is here: https://t.co/bYl8Y2PgvJ https://t.co/aj6uCZkCfa @cal_cresswell05 Glad you're a #myAndroid fan! We'd love to see a screen shot of your home screen. Peace, love, and personalization. Take the #myAndroid Taste Test to find the home screen of your dreams: https://t.co/a6q7SEDH2c https://t.co/QdHVaEcE7w @DVCYuutaTogashi Hi there. Thanks for the interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @JayKhimani Hi Jay. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @ameyp21 You're welcome. Reach out if you have any other questions in the future. We're just a tweet away. @zadadrian Hi Gan. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @ameyp21 Hi Amey. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @TheRealSaus Hi there. Thanks for the interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @christianhp7 Hi Chris. Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2. @allanlange Hi Allan. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @jimrapc Hi there. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @SimoneFalasca Hi Simone. Thanks for the interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @miguelfito Hi Miguel. Thanks for your interest! We don't have news to share about that, but keep an eye on https://t.co/Z3ydjsSOz2. @dinakaran You're welcome. Reach out if you have any other questions. We're just a tweet away. @dinakaran Hi there. Thanks for your interest! We don't have news to share about that right now, but keep an eye on https://t.co/Z3ydjsSOz2. @_benju_ Hi Benjamin. Thanks for the interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @dereckhsu Thanks for the info. Right now Android Wear watches are not available through Google Store in the UK. Please stay tuned. @samarth84 Hi. Thanks for your interest! We don't have news to share about that right now, for updates: https://t.co/Z3ydjsSOz2 for updates. @Prabuddha19 Hi there. Thanks for the interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @Buccobhoy Hi Ryan. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @dereckhsu Hi. Just to confirm, are you referring to Android Wear app on Play Store or Android Wear watches on Google Store? Let us know. There’s no stopping the #AndroidPay momentum. Now in 10 countries, #Belgium has joined the Tap. Pay. Family. https://t.co/Wg4m1DoShg https://t.co/Cw91F5KwoP @Indrajithonline Hi Indrajith. Thanks for your interest! We don't have any news to share now. Stay tuned to: https://t.co/Z3ydjsSOz2. @Mcload23John Thanks for your interest, John. We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. From #AndroidMWC in Barcelona to ❓❔❓❔ Where do you think we’re off to next? https://t.co/OGUbYxj9Xx @xmjox Glad to hear its sorted. Give us a shout if you have any other questions in the future. @Koichi9898 Hi Hamada. Thanks for your interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @DanZoleta Hi Dan. Thanks for your interest! We don't have news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. RT @Google: Now rolling out to more @Android phones, it’s time to meet your #GoogleAssistant → https://t.co/tu9bGCgo7F https://t.co/aeWdgBT… Another one in the books! Hasta luego to #MWC17 - see you next year. 👋 #AndroidMWC https://t.co/cIpWqAhIBz The smoothies are cool but the tech is coming in hot at #MWC17. #AndroidMWC https://t.co/MqHQj0GcfZ @xmjox You're welcome, Michael. Keep us posted. We're just a tweet away. @xmjox Hmm. Just to confirm, have you tried the steps in this guide: https://t.co/bsesBrCXZK. Do those steps work? @jack_snelson Hmm. We'd like to discuss further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @xmjox Hi Michael. Are you seeing an error message while using Android Pay? Let us know. We'll be happy to help. @Alex_JWarren Glad to know its sorted. Reach out if this happens again. We're here to help. @jack_snelson Hi Jack. Could you tell us more about what's happening w/ Android Pay? We'll do our best to help. From the Enchanted Forest to the Tram, and everything in between, #Android is having fun at #AndroidMWC. https://t.co/BTu0UnXBec @Alex_JWarren Hi Alex. Just to confirm, did you receive an email about the card being removed? Keep us posted. We'd be happy to help. Have your @AndroidWear &amp; style it too. No matter where you are, customize your watch face for your mood: https://t.co/SHfXO7vSo3 #AndroidMWC https://t.co/FxLZrj3wHu We’re excited for the newest #AndroidOne device in Turkey. Meet the @GeneralMobile GM6! #AndroidMWC #MWC17 https://t.co/DguS5lFj2e https://t.co/hjD1sdcJaY Feeling calm at the #Androidify Zen garden at #AndroidMWC. Join the fun and create your own Androidify character: https://t.co/JFIld4IbkH https://t.co/72RVUWe7lg @Steveo67 Hi Steve. We're aware of this issue &amp; investigating. Here's a guide to verify your transaction history: https://t.co/UWKhhEALtm. @pedrolamas You're welcome. Feel free to contact us if you have any other questions in the future. We're here to help. @pedrolamas Sorry about that, Pedro! We'd appreciate it if you open Pay &gt; tap menu icon &gt; Send feedback &gt; check \"Include system logs\". @ripley_joel No worries, Joel. We're here to help. Reach out if you have any other questions in the future. @aboshhiib Hi there. Have a look at this guide for info about supported cards for Android Pay: https://t.co/M7QSrFTsHv. Hope this helps. @ripley_joel Thanks for the info, Joel. Are you trying these steps to make purchases using Android Pay: https://t.co/HdQKzBChSn? @ripley_joel Hi Joel. Just to confirm, does this happen in a particular store? Let us know. We'll be happy to help. Pins on pins on pins. Can you pick a favorite? #MWC17 #AndroidMWC https://t.co/p4CnZJZQYW @UdayMannam Hi Uday. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/9Fa9yFM20K. @sandrocvrb Hi Sandro. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @besez Hi Erik. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @psuboy Hi Peter. We're working with manufacturers to push Wear 2.0 update to more watch models. Rollout will be a gradual over weeks. Ciao. 你好. Hola. No matter how you say it, Hello from #AndroidMWC. https://t.co/OclbhX5jb1 Welcome #MotoG5 &amp; #MotoG5Plus to the Android family! 😀  #AndroidMWC https://t.co/QJOCanIRG5 #AndroidWear 2.0 is right on time with @Huawei. #AndroidMWC https://t.co/PY9BFD4zfS We couldn’t be #AndroidEverywhere without great fans like you. Thanks for spreading the ❤️ around the 🌎🌍🌏 https://t.co/1sYDlSRy4c Clean &amp; simple look: ✔️ The latest updates: ✔️ Nougat: ✔️ \nThere’s a lot to ❤️ with @Nokia &amp; #Android. Welcome to the fam! #AndroidMWC https://t.co/6JmRtVm9Sm 😍 https://t.co/dhISn6qXs3 And the #Android family continues to grow. Looking at you, #HuaweiP10. #AndroidMWC https://t.co/eS7kYIjJTi Spread the 📰. The @LGUSAMobile #LGG6 is optimized for the #GoogleAssistant, even with the screen off. #AndroidMWC https://t.co/i8DXjEyuO0 https://t.co/gp3CniKITM Nougat and Marshmallow, get ready to meet your #GoogleAssistant. It’s headed your way. #AndroidMWC https://t.co/wqOQwGVJeD Setting up #AndroidPay is as easy as 1,2,3. Then, tap at millions of stores, wherever contactless is accepted. https://t.co/aMk3MlukLC https://t.co/mrdcdlbpTT @ECelestin Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. Feeling nostalgic with this #AndroidMWC #tbt. See you soon, Barcelona. https://t.co/uPniQiTFvE 🤗 https://t.co/mxEzzkB7XE @hvrvldi Hi there. We're working with manufacturers to push Wear 2.0. Rollout will be a gradual process over weeks. Hope this info helps. Rock out on #SundayFunday with @GooglePlayMusic and #Android. 🎧🎶🎵 https://t.co/7WMBMONxOY Quick weekend road trip? Easily access your apps hands-free while driving with #AndroidAuto. Get the app: https://t.co/c0pV83ySkX https://t.co/NU7YTpLYhY @juju72130 Hi Julien. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @absinthecity That's odd! Are you receiving any error messages while using Android Pay on TFL? Let us know. @trionkidnapper That's odd, Craig. Let's move this conversation to DM, so that we can connect you to a support specialist for assistance. #DidYouKnow you can choose to unlock without a passcode at 🏡? Your #Android device knows when it’s safe. https://t.co/eHiDhcYtTe @Indrajithonline You're welcome, Indrajith. Reach out if you have any other questions in the future. We're just a tweet away. @Indrajithonline Hi Indrajith. Thanks for the interest! We don't have news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @ErnestoIbarraVa Hi there. The release will roll out gradually to selected watches in the coming weeks. More info: https://t.co/7mkSa7Ig8T. @absinthecity Hi Abi. Could you tell us more about what's happening? We'll do our best to help. Cupid’s arrow is aimed at #Android’s Instagram. Be sure to check out our sweet #Valentines story ❤️💕❤️ https://t.co/QAqXe7Uwhs https://t.co/wQN8J02lzJ Don’t worry, #AndroidPay makes it easy to grab last-minute #ValentinesDay 💐. Tap. Pay. ❤️. https://t.co/6YyvtQkLV8 https://t.co/W2pKISAemX @IanJohns11 Hi Ian. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. That’s a wrap on not knowing what the weather is like. Just say, “#OkGoogle, what’s the weather?” #Android https://t.co/c10CuyP39T @giloi Hi Richard. We're aware of this issue and working on it. @ProJunkieszz Thanks for your interest, Brent! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. Dufourspitze, Liskamm, Matterhorn make up this location. Don’t forget the ski gear. ⛷ #WheresAndroid https://t.co/Ne8DSew3Zo @Rakien Hmm. We recommend you to contact the card issuer/bank for further assistance. Reach out if you have any other questions. Losing track of your phone can be 😣😢😩. The #Android Device Manager can turn that into 😃😍☺️ https://t.co/uNzNFfkFsu Make the most of every minute with #AndroidWear 2.0. New ways to use apps, message, work out, and get help from your Google Assistant. https://t.co/XKW40NFaH8 @Rakien Hi Rakien. That's not the experience we'd like you to have. Could you tell us more about what's happening? We'll be happy to help. @mufaddal_vohra Hi Mufaddal. Thanks for your interest! We don't have news to share about it right now. For updates: https://t.co/Z3ydjsSOz2. @dvmwj1 Thanks for submitting the feedback. Reach out if you have any questions in the future. @dvmwj1 Hmm. If that still doesn't work, we'd appreciate it if you would send in-app feedback (3-dot menu &gt; Send feedback). @dvmwj1 Hi there. When using TfL be sure to hold your phone's NFC chip to the sensor and wait for the gate to open. Keep us updated. It's #SaferInternetDay, but we prefer safer internet life. Check out how to keep your device safe: https://t.co/72pjQmfsZ0 #AndroidTip https://t.co/hGOxJRoqvk @prathik1 Thanks for the info, Prathik. We recommend joining our forum discussion here: https://t.co/bzGHwGmPoU. #AndroidPay is available at more places than you think. Look for the contactless or Android Pay symbol at checkout. https://t.co/qaY7GvaMHv https://t.co/yzsoIHXwML @AVanRos91 Hi Aaron. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @shanebelanger12 Hi Shane. Just to confirm, are your cards getting removed from the Android Pay app? Let us know. We'll do our best to help. @Hendy14 You're Welcome, Scott. Reach out if you have any questions in the future. @TamsynMMurphy That's odd. We'd like to discuss further about this. Let's move this conversation to DM. @blackops3thing3 You're welcome. Reach out if you have any questions in the future. We're just a tweet away. @SJRimmington Hi Stephen. Please follow us and let us know when you do, so we can move this conversation to DM for further assistance. @lmhrpr We'd like to chat further about this. Let's move this conversation to DM. @AndHab Hi Andreas. What's going on with Android Pay? Tell us more. We'll do our best to help. @joesouthan Glad to know its working, Joe! Reach out if you have any other questions in the future. We're just a tweet away. @johnrow03605166 We're Glad you enjoyed it! Reach out if you have any other questions. We're just a tweet away. @TamsynMMurphy Hmm. Could you try opening the link from a computer. Let us know if that helps. @NeoXIII Thanks for the update. We're aware of this issue and investigating. Feel free to contact us if you have any other questions. @AlexDaviesRadio Hmm. We're aware of this issue &amp; investigating. As a workaround, try opening the link from a computer. Keep us posted. @matt_mcs Hmm. We're aware of this issue &amp; investigating. As a workaround, try opening the link from a computer. Let us know if that helps. @ChipsSW Great that it's working! We're happy we could help. Reach out if you have any other questions in the future. @Cullimore Good to know its working. Feel free to contact us if you have any other questions. We're here to help. @Hendy14 Hi Scott. We've fixed this on our end and it should work fine now. Please try to use the code again. Keep us posted. Is it ❄️ or is it 🌷? Say “Ok Google” to ask for #GroundhogDay results on your #Android device. https://t.co/A8uMMK2meP @johnrow03605166 You're welcome, Davy! Let us know how it goes. @johnrow03605166 Got it. We've fixed this on our end and it should work fine now. Please try to use the code again. Keep us posted. @lmhrpr Hmm. Could you please confirm if you've trie using the code again. Liam? Keep us posted. @lmhrpr Hi Liam. We've fixed this on our end and it should work fine now. Please try to use the code again. Keep us posted. @joesouthan Sure. Keep us posted. @joesouthan Hi Joe. We've fixed this on our end and it should work fine now. Please try to use the code again. Keep us posted. @MisterMoran You're welcome, Sam! Reach out if you have any other questions in the future. We're just a tweet away. @MisterMoran Hi Sam. We've fixed this on our end and it should work fine now. Please try to use the code again.Keep us posted. @zcvns Hi Zac. We've fixed this on our end and it should work fine now. Please try to use the code again.Keep us posted. @matt_mcs Hi Matt. We've fixed this on our end and it should work fine now. Please try to use the code again.Keep us posted. @a_ridley You're welcome, Anthony! Feel free to reach out if you have any other questions in the future. We're just a tweet away. @AshmanTheGuy Hi Ashman. Could you tell us more about what's happening? We'll do our best to help. @a_ridley Hi Anthony. We've fixed this on our end and it should work fine now. Please try to use the code again.Keep us posted. @AlexDaviesRadio Hi Alex. We've fixed this on our end and it should work fine now. Please try to use the code again.Keep us posted. @blackops3thing3 Hi there. We've fixed this on our end and it should work fine now. Please try to use the code again.Keep us posted. @NeoXIII Hmm. We've fixed this on our end and it should work fine now. Please try to use the code again.Keep us posted. @SL_Matrix Sure. Keep us posted. @NeoXIII Hi there. Could you tell us more about what's happening? We'll do our best to help. @ChipsSW Hi there. We've fixed this on our end and it should work fine now. Please try to use the code again. Keep us posted. @SL_Matrix Hmm. Try holding the phone against the terminal until the gate opens at TfL, not just a quick tap. Let us know how it goes. @Cullimore Hi Darren. We've fixed this on our end and it should work fine now. Please try to use the code again. Keep us posted. @johnrow03605166 Hi Davy. What's going on with Android Pay? Tell us more. We'd be happy to help. @TamsynMMurphy Hi Tamsyn. We've fixed this on our end and it should work fine now. Please try to use the code again.Keep us posted. @BenjaminMastin Also version numbers for Android OS (Settings&gt; About phone&gt; Android version) &amp; Android Pay (Settings&gt; Apps&gt; Android Pay). @BenjaminMastin Hi there. Let us know your Google Play Services version number: Settings &gt; Apps &gt; Google Play Services. @SL_Matrix Thanks for the info. Could you help us with the make and model of your device? We're do our best to help. @ethernet22 Hi Dan. We'd like to chat further about this. Let's move this conversation to DM. The Willow watch face for @AndroidWear is out of this world 💫✨ Get it for yourself here: https://t.co/l01tJmktaR https://t.co/waC3AEohAI @cleanycloth Hmm. We'd like to discuss further about this. Let's move this conversation to DM. @rupester Thanks for the feedback. You were charged by the correct merchant. We're aware of this issue and looking into it further. @cleanycloth Hi there. Just to confirm, have you disabled screenlock recently? Let us know. We'll be happy to help. @SL_Matrix Hmm. Just to confirm, does this happen at a particular station or at all stations? Keep us posted. @SL_Matrix Hi there. What happens when you try to use Android Pay in the tube? Share more details and we'll be happy to help. Flu season has nothing on #AndroidPay. Just tap to pay to avoid unnecessary germs at checkout. https://t.co/E5YHw4S287 https://t.co/PY3aogdqkt @BhriguBPant Hi Bhrigu. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @thomas_buffard Hi there. Let's try the steps in this guide to set up Android Pay: https://t.co/bHqpzu3z1o. Keep us posted. @PENN0NE Hi there. Android Pay isn't available in Italy now. We can't guarantee that the app's features will work in unsupported countries. Grab your mittens and get smitten. #Android https://t.co/PnL1soQqPW Forgot how much you saved on those 👖? Now, easily swipe down to get your calculator history. ➕➖➗✖️ #AndroidTip https://t.co/5poX6jTTs5 https://t.co/Y67ssLynwl @kcog_ Hi Greg. Android Pay is an app, in which you can add cards and make payments at contactless terminals:  https://t.co/QbOF6c9bzo. @HarjotJGrewal Hi Hajrot. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @aledlumley Hi Aled. Thanks for your interest! We don't have news to share about that right now. For more updates: https://t.co/Z3ydjsSOz2. @lnoormohamed Hmm. Let's move this conversation to DM. @lnoormohamed Hi there. Could you confirm if your device is rooted? Let us know and we'll be happy to help. All 👂 for a new song? Use @AndroidWear to @Shazam the title and artist. https://t.co/EQ2I2cQa2j https://t.co/AtHW7TLTjP @sueinphilly Hi there. We're aware of this issue and looking into it further. @Songof_storms You're welcome! Reach out if you have any other questions. We're just a tweet away. @kimBigButt  Hey there. We're aware of this issue and looking into it. @Songof_storms Hi there. Yes, you can. However, it must be connected to the internet within 24 hours before the transaction. Does that help? @greg_gang Hi there. Could you tell us more about what's happening? We'll be happy to help. @ChanGhataore Hey there. Have a look at this guide for info about supported cards for Android Pay: https://t.co/M7QSrFTsHv. Does that help? @VortexLuck9r Thanks for your interest, Nikita! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @garuwex Hey there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @_budgie Hi Alison. Android Pay currently lets you pay in-store/in-app with your Android device. Reach out if you have any Qs in the future. @nopking Glad to hear it's working. Reach out if you have any questions in the future. We're just a tweet away. @nopking Hi Paul. What's happening when you try to use Android Pay? Share more details and we'll be happy to help. @Deventalsania Hi Deven. Are you receiving any error messages when you attempt to use Android Pay? Lets us know. We'll be happy to help. What’s your favorite reason to use #AndroidPay? @xavier_laff Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @typicalcaffiene You're welcome, John. Reach out if you have any other questions. We're just a tweet away. @Vusys Hi Bryan. We're aware of this issue and looking into it. @typicalcaffiene Hi John. Here’s a guide on what Android Pay does to keep your payment info safe: https://t.co/gobt2QVwzB. Does it help? @PicnicPal You're welcome, Kristy! Reach out if you have any other questions. We're just a tweet away. @PicnicPal Hi Kristy. Android Pay doesn't have a limit. Some stores aren't setup to accept purchases over £30, they require physical card. @ScottNC24 Thanks for the info, Scott. Give us a shout if you have any questions. @ScottNC24 Glad to know it was sorted! Reach out if you have any other questions. We're just a tweet away. @KStylez18 Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @ScottNC24 Hi Scott. What's going on with Android Pay? Let us know. We'll do our best to help. When the watch face is the 🍒 on top of a great outfit. Customize your look with @ustwo @AndroidWear watch faces: https://t.co/ZiSIdqy2UA https://t.co/WtNqclgcir Seamlessly use your 📱, listen to 🎶  and navigate 🚗 both in-app and in your dash. How do you use #AndroidAuto? https://t.co/2Cg9ozfBan Resolve to make 2017 a year of unforgettable memories. Keep them all organized with @googlephotos on your #Android. https://t.co/U1FR3LjREE @hywel_lloyd You're welcome. Feel free to contact us if you have any questions in the future. @hywel_lloyd Hi Hywel. Here is the list of Android Wear watches that will receive Wear 2.0: https://t.co/8QveBaf6yA. Hope it helps. @AcupofTblog Hmm. Please follow us and let us know when you do, so we can move this conversation to DM &amp; connect you to a specialist. @AcupofTblog Hey there. Could you tell us more about what's happening with Android Pay? We'll do our best to help. @daveman You're welcome. Reach out if you have any other question in the future. We're just a tweet away. @Katarazzi1 No. NFC technology runs on a hardware which comes only with NFC enabled devices. There is no patch for it. Hope this info helps. @daveman Hi there. We suggest you to reach out to the merchant providing the prize for assistance with the reward. ICYMI... #CES2017 #AndroidEverywhere https://t.co/vLMkYveSEF @compass_dr Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @watch_lion Hi there. Have a look at this guide on how to use loyalty cards: https://t.co/14hCCpchS4. Let us know if that helps. New #AndroidTV devices are coming from @nvidiashield and AirTV. #AndroidEverywhere #CES2017 https://t.co/9NIW0Cqfiq @oflahertyevents Got it. Please follow us and let us know when you do, so we can move this conversation to DM &amp; connect you to a specialist. @oflahertyevents Hmm. Just to confirm, are you referring to cards (DC/CC) being removed automatically or promotional cards? Let us know. At #CES2017, @FiatChrysler_NA is showcasing the next-generation of in-vehicle infotainment system based on #Android. #AndroidEverywhere https://t.co/LAp2IowpGL @oflahertyevents Hi there. The promotion was valid only until December 31st, after which the reward card gets removed. @Katarazzi1 Hmm. To use Android Pay you'll need a phone running Android 4.4+ that support NFC &amp; HFC. More info: https://t.co/RLv6K4fG8y. @Jawbone_1978 Hi there. We suggest you to contact the app developer or their website for more information. Wear what you want right on your wrist. @NewBalance #RunIQ watches powered by @AndroidWear make a statement at #CES2017. #AndroidEverywhere https://t.co/FTg1vjATft @bamcat Hi Brian. We're working with the Waze team to make it available on Android Auto. Send us your feedback: https://t.co/AIPle1iLH8. @Anthony_mvs Yes, Anthony. Android Pay will work if you have a case on the phone &amp; can be used anywhere contactless payments are accepted. News from #CES2017: Google Assistant is coming soon to your #AndroidTV. Happy watching! 📺 #AndroidEverywhere\nhttps://t.co/tjIdjen16t https://t.co/Pq5b5FweIE Even more fun in the great outdoors? We're excited for the Casio PRO TREK Smart watches powered by @AndroidWear. https://t.co/378zgUA1xD We're headed to #CES2017! Get ready for some sweet #AndroidEverywhere news. https://t.co/P4bokBKdhj @KeithIMyers You're welcome. Reach out if you have any other questions in the future. We're just a tweet away. @KeithIMyers Hi Keith. This feature isn't available. You can submit feature suggestions in the Android Pay app, under Menu &gt; Send feedback. @kririgo Thanks for your interest! We don't have news to share about that right now, but keep an eye on https://t.co/feNuPkX93e for updates. New year, new wear. Keep track of that resolution - in style - with @AndroidWear. https://t.co/HowABcThzW @mazeffa Got it. Please follow us &amp; let us know when you do, so we can reach out over DM. @DezCowboys88 Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @mazeffa Let's back up everything &amp; then Settings&gt;Backup &amp; reset&gt;Factory data reset (this will erase all data &amp; settings on your phone). @Pippatron2103 Thanks for the feedback. Reach out if you have any other questions. We're just a tweet away. @Pippatron2103 This is a matter of chance. We reward prizes to users in an entirely randomized way. Encourage you to keep trying. @Pippatron2103 Hi there. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @chr15toffer Hmm. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @chr15toffer Hi there. Did you receive an e-mail about the cards being removed ? Let us know. We'll do our best to help. @ElUrbanista Hi Gabriel. We're working with the Waze team to make it available on Android Auto. Send us feedback: https://t.co/4AtBla6TdR. @orenmordechai Hi Oren. We're working with the Waze team to make it available on Android Auto. Send feedback here: https://t.co/4AtBla6TdR. @mmartino1981 Thanks for your feedback. Android Auto team is aware and working to fix this issue. @mrmemoz Hmm. Let's move the conversation to DM @TechScoutOnline This feature isn't available at this time. However, you can submit a feedback here: Android Pay app &gt; Menu &gt; Send feedback. @DanielTheuma86 Hi Daniel. This is a matter of chance. We reward prizes to users in an entirely randomized way. Keep trying! @TechScoutOnline For low value transactions, Android Pay doesn't automatically prompt you to unlock your device for every transaction. @Dorkimus Hmm. It isn't possible to get the crackers back. Instead, you can try using Android Pay to get the new crackers. @Dorkimus Hi there. Tap on the “shop.tap.reward”→ see saved crackers with a “Find out if you won a prize” prompt and Go button. @TechScoutOnline Hmm. Could you confirm if you see a green check mark on your device after you tapped the phone? Let us know. @TechScoutOnline Hi there. Just to confirm, are you able to make a payment with Android Pay? Let us know. We'll be happy to help. @bozybear321 Got it. Please follow us and let us know when you do, so we can move this conversation to DM for further assistance @mazeffa Hmm. Let's try clearing the app cache for Android Auto. Just head to Settings &gt; Apps &gt; Android Auto &gt; Clear Cache. Keep us posted! @mazeffa Hi Ryan. Is your Android Auto app up to date? Check it out and let us know! @bozybear321 Hmm. Could you confirm if you have an active internet connection while using Android Pay? Let us know. @TomRyanElliott Got it. Let's move the conversation to DM. @TomRyanElliott Hmm. We recommend reaching out to the merchant for assistance on this, Tom. Let us know if you have any other questions. @TomRyanElliott Hi Tom. Could you confirm if you have an active internet connection while using the reward? Let us know. @Buxton1991 Glad to know it worked, Liam. Reach out if you have any other questions. We're just a tweet away. @Weese12 Thanks for the info. Let's move the conversation to DM for further assistance on this process. @bozybear321 Hi David. What's going on with Android Pay? Let us know and we'll be happy to help. @MuhammadOthman Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @Buxton1991 Hi Liam. Could you let us know if you're able to see the “shop.tap.reward” card in your app's home screen? We want to help. @mmartino1981 Thanks for the info. We're working on this issue. Please join us here: https://t.co/bzZxura8cK. You'll be contacted by email. @mmartino1981 Ok, then. Could you tell us what version number you see at Settings &gt; Apps &gt; Google Play services? Keep us posted. @mmartino1981 Hmm. If you are seeing Google Play services message on Android Auto, check all the steps here: https://t.co/R44PFdPxg5. @mmartino1981 Hi Michael. What's going on with Android Auto? Let us know. We'll do our best to help. @copszcars10 Ok then. Let's move the conversation to DM. @copszcars10 Hmm. Could you tell us what's happening when you use Android Pay. We'll be happy to help. @DanielBree601 Thanks Daniel! Although we can't get that cracker back for you, this info might help us track down what happened to it. @copszcars10 Hi there. If you're trying to get started with Android Pay, have a look at this article: https://t.co/WBg5hB5gxN. Does it help? @RjPrmr Hi Raj. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! What was your favorite #Android moment? We’re looking forward to the new year. But first, here are some of the sweetest #Android highlights of 2016. https://t.co/RTtUhmGOJ2 @CaptainCuthill You're welcome! Reach out if you have any other questions. We're just a tweet away. @CaptainCuthill Hmm. Yes, the rewards card will remain in the app up to two weeks after the promotion has ended. Hope this info helps. @andrewleeke Hi Andrew. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @CaptainCuthill Hmm. Could you open the app and confirm if you see the “shop. tap. reward.” card on the home screen? We'd be happy to help. @JakobPrins Thanks for your interest, Jakob! We don't have any news to share now, but keep an eye on https://t.co/feNuPkX93e for updates. @zachhwilliams Got it. Please follow us and let us know when you do, so we can move this conversation to DM @zachhwilliams Ok then. Tap on the “shop.tap.reward”→ see saved crackers with a “Find out if you won a prize” prompt and Go button. @zachhwilliams Could you open the app and confirm if you see the “shop. tap. reward.” card in your app home screen? Let us know. @zachhwilliams Hmm. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @zachhwilliams Hi Zach. You can't use the cracker without internet connection. However, you'll be offered one if you use Android Pay again. @Whewell37 Hi Andrew. We're working with the Waze team to make it available on Android Auto. Send your feedback: https://t.co/4AtBla6TdR. @JosephJODonnell Hmm. Just to confirm, are you trying these steps to use Android Pay on Tube: https://t.co/lTRXyG1ZyY? Let us know. @jezmck Hi Jez. It isn't possible to get the card back once dismissed. Reach out if you have any other questions. @ChrisjCopeland Hmm. Have a look at this guide (see \"Fix problems scanning\" section): https://t.co/8yNalZN0DJ. Hope it helps. @ChrisjCopeland Hi Christopher. If the loyalty card shows a serial number, you can present it to the cashier and enter it manually. @mrmemoz Hi there. We recommend reaching out to the merchant for assistance on this. Let us know if you have any other questions. @AvatarRuff That's what we like to hear! 😎 We're here if you have any questions. Did you unwrap a new #Android device? Look no further: https://t.co/bRU6PvXEK8 #AndroidTip https://t.co/MCe9z2fAft @rudixyz Hi Rudi. Could you confirm if you see the “shop.tap.reward” card in your app's home screen? Let us know. We'll be happy to help. @tomm3h Hmm. You'll be offered a new cracker if you use Android Pay again. Keep trying, the crackers are random! @paulopsyke Hmm. It isn't possible to get the card back once dismissed. Reach out if you have any other questions. @tomm3h Hmm. If the \"shop.tap.reward\" card is deleted, you won't be able to get the crackers. Let us know if you have any other questions. @ralphy1293 Hi Alex. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, crackers are random! @VeedubGeezer Hi Aaron. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, crackers are random! @JosephJODonnell Hi Joe. What happens when you try to use Android Pay on Tube? Share more info &amp; we'll do our best to help. @yas326 Hi Yasir. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @Weese12 Hmm. Just to confirm, is your device rooted? Let us know. We'd do our best to help. @paulopsyke Hi there. Tap on the “shop.tap.reward”→ see saved crackers with a “Find out if you won a prize” prompt and Go button. @fiansari Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/feNuPkX93e for updates. @JeroKuhne Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/feNuPkX93e for updates. @tomm3h Hi Tom. Could you let us know if you're able to see the “shop.tap.reward” card in your app home screen? We want to help. @callummhoare Hi there. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, crackers are random! @Weese12 Hi Weese. What's going on with Android pay? Share more details. We want to help. @Shawry75 We are glad its working fine now. Reach out if you have any questions in the future. @DanielBree601 Thanks! And can you also tell us what version number you see at Settings &gt; Apps &gt; Google Play Services? @DanielBree601 Hi Daniel. Can you tell us the version #s listed at Settings &gt; Apps &gt; Android Pay &amp; Settings &gt; Apps &gt; Google Play Services? @emil_cheriches Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @itsmoirob Hi Bob. It isn't possible to get the card back once dismissed. Reach out if you have any other questions. Buckle up &amp; minimize distractions with #AndroidAuto during the #holiday hustle and bustle. https://t.co/Bx6ZydRSXn @AchwaqKhalid Thanks for your interest! We're working on bringing Android Pay experience to as many countries as possible. Stay tuned. @WhatAGoodOne Hmm. It isn't possible to get the crackers back. Instead, you can try using Android Pay to get the new crackers. @MarkusIncognito Hi Mark. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, crackers are random! @Jayden_Blake_ Hi Jayden. We suggest you to reach out to the merchant providing the prize for assistance with the reward. @1MarSn Hi Frank. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @eyedubya Hi Eyedu. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @Tomm987 Hi Tom. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @Nomaki Hi Shaun. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @spudy12 Hi Josh. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @Davichu1983 Thanks for your interest! We don't have any news to share about that now. Stay tuned to: https://t.co/gCJBtfBUpV. @Davichu1983 Hi. Mind if we jump in? We’re working with Waze to make it available on Android Auto. Send feedback: https://t.co/1kGRFxLoVf. @jayLEG3ND Hi there. It isn't possible to get the gift card back. Instead, you can try using Android Pay to get the new crackers. @Cmnalsra Hi Arslan. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @Darth_Lebowski Hi Darth. The device needs to be connected to Internet at least once every 24 hours for Android Pay to continue working. @mynameiscal Hmm. We suggest you to reach out to the merchant providing the prize for assistance with the reward. @peachkiller85 Hmm. Let's move this conversation to DM. @mynameiscal Hi Cal. What's happening with the gift card when you are trying to use it? Let us know. We'll do our best help. @peachkiller85 Hmm. For debit card transactions, you may have to enter a PIN. Use the PIN you set up with your bank. @robbacon Hi Rob. It isn't possible to get the card back once dismissed. Reach out if you have any other questions. It’s the most wonderful 🕒 of the year. Celebrate the season with the #SantaTracker watch face for your @AndroidWear. https://t.co/lbb8XJW7bo https://t.co/jI3mnatqhn @compass_dr Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @WhatAGoodOne Hi there. Tap on the “shop.tap.reward” card→ see saved crackers with a “Find out if you won a prize” prompt and Go button. @GullibleCraig You're welcome. Reach out if you have any other questions in the future. @brtknr Hi Bharat. Just to confirm, do you see an error message while paying with Android Pay? Let us know. We'll do our best to help. @bobbybalmoral Hi Johnny. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @DanielMDavies It isn't possible to get the card back once dismissed. Reach out if you have any other questions. @NwaAneagboka Hi there. Thanks for your interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @sambyalAbhi Hi Abhishek. Thanks for your interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @StuartQF Hi Stuart. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @heyitscamblack Hi there. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, crackers are random! @markob123456 Hi Mark. Thanks for your interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @elevtechlift Hi there. Thanks for your interest! We don't have any news to share now. Keep an eye on https://t.co/Z3ydjsSOz2 for updates. @DanielMDavies Hi Daniel. You won't be receiving the crackers if you have deleted the \"shop.tap.reward\" card from your Android Pay app. Forget fumbling with your wallet. There’s a better way to pay when you’re headed home for the #holidays. With #AndroidPay, just Tap. Pay. 🚗. https://t.co/t0IcilzaTO @keenmd Hi Mike. Once, the Shop.Tap.Reward card is deleted, it can't be reinstated. @estherrjohnson Hi Esther. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, crackers are random! @RyanWatersUKIP Hi Ryan. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @GullibleCraig Hi Craig. Tap on the “shop.tap.reward”→ see saved crackers with a “Find out if you won a prize” prompt and Go button. @Fragster Hi Ange. We'd like to chat further about this. Let's move this conversation to DM. @ajuszczyk82 Hi Adrian. Android Pay doesn't work with wearables. You'll need a phone running Android 4.4+ with NFC: https://t.co/RLv6K4fG8y. @hari_home Hmm. Try using one of the cables recommended here: https://t.co/77Iquyvg2Q. Keep us posted. @ryanmitch Hi Ryan. If you dismiss the Shop.Tap.Reward card, you won't be able to get it back. @PopQuizDaily Let's move this conversation to DM. @CarlTeasdale Got it. Let's move this conversation to DM. @CarlTeasdale Hmm. Have a look at this guide (see \"Trouble using Android Pay in stores\" section): https://t.co/YlFDZtGCYz. Does that help? @thebibbler Hi there. If you dismiss the Shop.Tap.Reward card, you won't be able to get it back. @CarlTeasdale Hi Carl. Are you seeing an error message while using Android Pay? Let us know. We'll do our best to help. @manchesterdub Hi Eoghan. If you dismiss the Shop.Tap.Reward card, you won't be able to get it back. @TristanBacon Hi there. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @jwas15 We're glad to know its fixed. Reach out if you have any questions in the future. @alba0266 Hi Alec. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @amytunstall Hi Amy. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @nath042 Hi there.The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @domturl Hi Dom. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @clTee1406 Hi there. We're investigating this &amp; would appreciate more info from you: open Android Pay's menu (3 dots) &gt; Send feedback. @PopQuizDaily Got it. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @davibryant31 Hmm. Let's move this conversation to DM. @paulhowarth14 Hi Paul. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @ab_f1 Hi Amit. We suggest you to reach out to the merchant providing the prize for assistance with the reward. @teejamgal Hi there. Some stores are not setup to accept mobile wallet transactions over £30, so they require the physical card. @PopQuizDaily Hmm. Are you receiving an error message while trying to use Android Pay in stores? Keep us posted. @peachkiller85 Hi there. Have a look at this guide (see \"How to pay\" section): https://t.co/PHgvjbAiiu. Hope it helps. @davibryant31 All Android Pay users with an active token (card) in the UK except users in Northern Ireland are eligible for this promotion. @timprater Hmm. We suggest you to reach out to the merchant providing the prize for assistance with the reward. @hari_home Hi Hari. Have a look at this handy guide to check for common issues: https://t.co/F5kPReeJLl. Hope this helps. @timprater Hi Tim. Save the QR code generated from promo code to Android Pay. Open GC in the app and scan the barcode. Hope this helps. @RichBrooksPhoto Hi there. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, crackers are random! @pixelpig Hi Darren. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @digitalclubb Hi Gareth. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, crackers are random! @northernale1 Hi Bob. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @AvatarRuff Hi there. There is no fee to use Android Pay. Hope this info helps. @huwbevan Glad to hear it's sorted. Reach out if you have any questions in the future #AndroidTip: Use Now cards for convenient updates on the status of your holiday shipping. https://t.co/FhxJpZfnBi https://t.co/pdD6ipbirY @oflahertyevents Hi there. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, crackers are random! @mudaserelahi Hi Sorin. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @regie_nil Hi there. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @Vickers4Kevin Hi Kev. The first card you add to Android Pay is set as your default card, which will be charged on payment. Hope this helps. @Shawry75 Hi there. Tell us more about what's happening with Android Pay. We'll do our best to help. @jwas15 Hi there. What's going on with Android Pay rewards? Let us know. We'll do our best to help. @cmcnally99 Hi there. The Shop.Tap.Reward promotion is only available for the UK Android Pay users until 31st December. Hope it helps. @SabineKurz Hi Sabine. You wouldn't be able to use your UK Android Pay in Germany as it isn't available there. Hope this info helps. @JackF_Social Hi Jack. Have a look at this guide(see \"Trouble using Android Pay in stores\" section): https://t.co/Og1ZhdEhIn. Hope it helps. @me_yes_me Hi there. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @huwbevan Hi there. Could you check if you're able to see the “shop.tap.reward” card in your app home screen? Keep us posted. @NadSings Hmm. You won't get the crackers if you dismiss the \"shop.tap.reward\" card. Hope this info helps. @Ninadppp Hi Ninad. Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @AlmightyWillz_ Hi Willz. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, crackers are random! @Goldy73 Hi Simon. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, The crackers are random! @tadiiex Hi Tee. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, crackers are random! @danjohnmitchell Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @svisilian Hi Sorin. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @PopQuizDaily Hi Mike. Could you tell us more about what's happening with Android Pay? We'll be happy to help. @jvidyasagar Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @RealDannyOakley We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @teritron Thanks for your interest! We don't have any news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @IsoNick Thanks for your interest! We don't have news to share about that right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @ShreyamTaneja Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @grimb34rd Thanks for your interest! We don't have any news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @twKrash Hi Max. We’re working to bring Android Auto to more countries asap. Stay tuned: https://t.co/wYLcPnzI9G. Thanks. @StefanosSteven Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @MrDaveyJon3s Hmm. Our product team greatly appreciates feature suggestions. You can submit it in the Android Pay app&gt; Menu&gt; Send feedback. @MrDaveyJon3s Hi Davey. Android Pay doesn't work with wearables. You'll need a phone running Android 4.4+ with NFC: https://t.co/RLv6K4fG8y. @RealDannyOakley Uh oh! Could you check if you're able to see the “shop.tap.reward” card in your app home screen? Keep us posted. Accepted at millions of stores around the 🌍, the possibilities are endless with #AndroidPay. It's Tap. Pay. Awesome. https://t.co/9Fa9yFM20K https://t.co/p32RGRZ0iM @LucyMatthews93 Understood. We appreciate your feedback but we are still working with Huawei on a fix to resolve this issue asap. Thanks. Know someone on the Nice List? Give them something you know they’ll love: a new #Android device: https://t.co/clUR1hH9LW https://t.co/sUTQcyHxpg @Phippster Hi Jez. Have a look at this guide (see \"Trouble using Android Pay in stores\" section): https://t.co/ucL6CPzHZW. Hope it helps. @Willo290592 You're offered a cracker every time you use Android Pay, but not all crackers contain prizes. Keep trying, crackers are random. @ChrisEdwin_1989 Hi Chris. You won't be able to get that one back. However, If you use Android Pay again, you'll be offered a new cracker. @JamesHaycraft1 Hi James. To use Android Pay you'll need a phone running Android 4.4+ that support NFC &amp; HFC: https://t.co/RLv6K4fG8y. @RealDannyOakley Got it. Could you confirm if you had an active Internet connection at the payment time? You need Internet to get a cracker. @cegbarker We value your feedback. You can submit it in the Android Pay app under Menu &gt; Send feedback. Appreciate it. @gwhitevt Hi Gordon. We are working closely with the Waze team to make it available on Android Auto. Send feedback: https://t.co/AIPle1iLH8. @jleslie05 You're welcome. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @colinsharp1979 Got it. Could you confirm if you had an active Internet connection at the payment time? You need Internet to get a cracker. @jleslie05 Hi Jonathan. Could you let us know if you're able to see the “shop.tap.reward” card in your app home screen? We want to help. @no1khurm Hi Khurm. We suggest you to reach out to the merchant providing the prize for assistance with the reward. @curtarmer We'd like to chat further about this. Let's move this conversation to DM. @DianePe23337706 Hi Diane. Have a look at this page to know more about the holiday cracker: https://t.co/1ScPflUQNI. Hope it helps. @RealDannyOakley Hmm. Just to confirm, is your card issued by a UK bank (excl. Northern Ireland)? Let us know. @LucyMatthews93 Hmm. We recommend joining our forum discussion here: https://t.co/ZqgcHfFmwa. Thanks. @RealDannyOakley Hi Danny. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, they're random! Starting today: Simply say 'Ok Google' to instantly access thousands of available voice commands with #AndroidAuto https://t.co/hLY6QnuVy5 Santa's back! Download the Santa Tracker app to access 4 new games only available on the #Android app. #TrackSanta https://t.co/o6oUxJymHa https://t.co/saSolEkdTF @colinsharp1979 Just to confirm, is your card issued by a UK bank (excl. Northern Ireland)? Let us know. @colinsharp1979 Hmm. Could you let us know if you're able to see the “shop.tap.reward” card in your app home screen? We want to help. @colinsharp1979 Hi Colin. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, crackers are random! @PeterUK09 Hmm. Have a look at this guide (see \"Trouble using Android Pay in stores\" section): https://t.co/ucL6CPzHZW. Hope it helps. @PeterUK09 Hi Peter. Are you seeing an error message while trying to use Android Pay? Let us know. We'll be happy to help. @mrtn_bannstr Hi Martin. Have a look at this guide (see \"Pay with a non-default card\" section): https://t.co/uF5wlorwtm. Hope it helps. @NadSings Hi Nadeem. Could you check if you're able to see the “shop.tap.reward” card in your app home screen? Keep us posted. @hhudda Hi Hussein. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @LucyMatthews93 Got it. Could you let us know the make &amp; model of the phone? We'll be happy to help. @Willo290592 Hi Thomas. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, The crackers are random! @lufc4625 Hi Jay. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @Mark_Bernardes Hi Mark. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, The crackers are random! @cegbarker Hi Chris. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, The crackers are random! @curtarmer Just to confirm, is your card issued by a UK bank (excl. Northern Ireland)? Let us know. @curtarmer Ok, then. You can open https://t.co/Xs8VCf4DJv → Settings → Country and check if it is set to GB/UK. Keep us posted. @curtarmer Got it. Could you let us know if you're able to see the “shop.tap.reward” card in your app home screen? We want to help. @curtarmer Hmm. It isn't possible to get the old crackers back. Instead, you can try using Android Pay to get the new crackers. @zenmonkeyme Hi David. We suggest you to reach out to the merchant providing the prize for assistance with the reward. @stallbaumer Hi Ben! Is \"what's your message\" typed into the actual text body or is it the opening on the voice command of an outgoing msg? @zorogou Hi there. Just to confirm, are you receiving any error messages while trying to use Android Pay? Let us know. @anonemys Hi Anon. Have a look at this guide for info about supported cards/Banks for Android Pay: https://t.co/M7QSrFTsHv. Keep us posted. @lofthouse_jack The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, The crackers are random! @Kaeoporaa Thanks for using Android Pay, Happy Holidays! @lofthouse_jack  Good question, Jack! But, if we tell, that would spoil the surprise! @bosmola Hmm. The crackers will reveal one of many prizes to a randomly selected few users. Hope this info helps. @SuperWelshVlog You're welcome! Reach out if you have any other question. We're just a tweet away. @SuperWelshVlog Thanks for the feedback. We’re adding more issuers and supported cards all the time. So, check back for updates. @bosmola Hi Bartosz. You'll be offered a new cracker if you use Android Pay again. Keep trying, the crackers are random! @SuperWelshVlog Hi there. Have a look at this guide for info about supported cards for Android Pay: https://t.co/M7QSrFTsHv. Keep us posted. RT @googledrive: Give the gift of @Android. Drive now makes transferring photos, videos, contacts &amp; calendar events easier than ever. https… @awheelwright Hi there. Here's a list of participating banks and supported cards for Android Pay: https://t.co/Xsl2PONHL8. Hope this helps. @matthewdswift Hmm. We don't currently offer that feature but we appreciate your interest. Thanks. @hjsco96 Hi Heather. We suggest you to reach out to the merchant providing the prize for assistance with the reward. @curtarmer Hi Curt. If you use Android Pay again you'll be offered a new cracker. Hope this info helps. @vitosauras Keep trying! The crackers are random. @vitosauras Hi there. In the app, tap on “shop.tap.reward” card to see crackers with a “Find out if you won a prize” prompt &amp; Go button. @LucyMatthews93 Hi Lucy. Is your Android Auto app up to date? Check it out and let us know. @Phil_Smither Hi Philip. We recommend reaching out to the merchant for assistance on this. Let us know if you have any other questions. @EL_NACH0 Hi there. Have a look at this Forum thread for more info &amp; follow up there if you have any Qs: https://t.co/q2RGv0cqVw. Thanks. @dajowh Hi David. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, they're random! @jlewisbell Jessica, you can submit a feedback here: Android Pay's menu (3 dots) &gt; Send feedback. Appreciate it. @J4mieSykes No, there's no minimum spend. @matthewdswift Hi there. Are you seeing an error message while trying to use loyalty card on Android Pay? Keep us posted. @stonkerconk Hi Michael. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, they're random! @WaldorfSixpence Hi there. If you turn screen lock off, Android Pay removes saved cards for security. More info: https://t.co/XKkCK0BBfY. @jlewisbell Hi Jessica. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, they're random! @J4mieSykes Hi there. To get a cracker, you have to use Android Pay in the UK &amp; you'll need an active Internet connection. Don’t let a meeting catch you off guard. Add the @googlecalendar widget to your #Android home screen. https://t.co/hincZ1ABbt @princessnishy Hi Nishant. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, they're random! @msyvonneolivier Hi there. We're investigating this &amp; would appreciate more info from you: Open Android Pay's menu (3 dots) &gt; Send feedback. @crsmith___ Hi Smith. The crackers will reveal one of many prizes to a randomly selected few users. Keep trying, the crackers are random! @MattieJBagnall Hi Mattie. The crackers will reveal one of many prizes to a randomly selected few users. @ChipsSW The crackers will reveal one of many prizes to a randomly selected few users. @cattanach1974 The crackers will reveal one of many prizes to a randomly selected few users. @Mike_Buckingham Hmm. We would suggest you to contact the store owner in this case. Thanks. @cliftonC76 Hi Clifton. Android Pay requires a secure PIN, pattern, or password to ensure the safest transactions possible. Does that help? @craig3050 You're welcome, Craig! Reach out if you have any other questions. We're just a tweet away. @rize_cs Thanks for your interest! We don't have any news to share about that now, but keep an eye on: https://t.co/wbxxfdMC47 for updates. @cattanach1974 Keep trying! The crackers are random. @ChipsSW Keep trying! The crackers are random. @craig3050 They do this to protect customers from potentially unauthorized use of the card. Once you call them, you’ll be able to use it. @craig3050 This means that your bank or card issuer wants to speak with you before authorizing this card for use in Android Pay. @craig3050 Thanks for the info. Some stores are not setup to accept mobile wallet transactions over £30, so they require the physical card. @craig3050 Hi Craig. Could you tell us more about what's happening with Android Pay? We'll do our best to help.opriate @SaintDynamite Hmm. We're investigating this &amp; would appreciate more info from you: open Android Pay's menu (3 dots) &gt; Send feedback. @mattjohnross We're investigating &amp; would appreciate more info from you: Android Pay's menu (3 dots)&gt;Send feedback. Thanks! @AlexDaviesRadio Hi Alex. We're investigating &amp; would appreciate more info from you: Android Pay's menu (3 dots)&gt;Send feedback. Thanks! @Mike_Buckingham You can use Android Pay at any terminal that has the Android Pay logo or contactless payment logo: https://t.co/ghqgjruzbD. @Mike_Buckingham Hi Mike. What's going on with Android Pay? Let us know. We'll be happy to help. @SAMBESTDJ Hi Sam. We're investigating this &amp; would appreciate more info from you: open Android Pay's menu (3 dots) &gt; Send feedback. Thanks! @EgoDeDiego Hmm. We're working on this issue. Please join the thread here: https://t.co/bzZxura8cK and you'll be contacted by email. @itdagarr Hi Daniel. We're investigating this &amp; would appreciate more info from you: open Android Pay's menu (3 dots) &gt; Send feedback. @SaintDynamite Hi Jonathan. You can open a holiday cracker for every Android Pay purchase you make now through 31/12. Happy shopping! @saifmiaa Hi Saif. We're investigating this &amp; would appreciate more info from you: open Android Pay's menu (3 dots) &gt; Send feedback. @versusuk Hi there. We're investigating this &amp; would appreciate more info from you: open Android Pay's menu(3 dots)&gt;Send feedback. Thanks! @sitzing Thanks for submitting the feedback. Let us know if you have any other questions. We're just a tweet away. @sitzing Hmm. We're investigating this &amp; would appreciate more info from you: Android Pay's menu (3 dots) &gt; Send feedback. Thanks! @sitzing Nope, just one cracker at a time! @sitzing Hi there. You can't use the cracker without internet connection. However, you'll be offered one if you use Android Pay again. @swifty1million Ok then. Please follow us and let us know when you do so we can move the conversation to DM. You only need a minute to make magic. Watch what @AndroidWear is up to and share what you can do in a #MagicMinute. https://t.co/2XEgT5ITzY @Kati_S86 We're investigating this &amp; would appreciate more info from you: Android Pay's menu (3 dots) &gt; Send feedback. Thanks! @ismisecraig Glad to know, Craiga! Reach out if you have any other questions. We're just a tweet away. @ismisecraig Hi Craiga. Could you tell us more about what's happening with Android Pay? We'll do our best to help. @Mick_Rawson Got it. Have a look at this guide on Android Pay Merchant help center: https://t.co/uameCvsrEV. Hope it helps. @Kati_S86 Ok, Kati. Just to confirm, is it happening at one specific store? Keep us posted. We'll do our best to help. @EgoDeDiego Hi Diego. If you are seeing Google Play Services message on Android Auto, check all the steps here: https://t.co/R44PFdPxg5. @swifty1million Hmm. Just to confirm, have you unlocked the bootloader of your phone? Keep us posted. @ZeroPoundYT Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsBdas for updates. @RyannSeed Got it. Let's move this conversation to DM. @Shreepea Ok then. Please follow us and let us know when you do so we can discuss next steps over DM. Thanks. @Shreepea Thanks for the info, Shreena. Have you opened the Android Pay app in the last 90 days? @Not_Fake_Yet Good question, Jack! But, if we tell, that would spoil the surprise! @Kati_S86 Hmm. Make sure you’re holding the back of your device against the terminal. You may need to hold it there for a couple of seconds. @Shreepea Hi Shreena. Just to confirm, have you received an e-mail about the card being removed? Let us know. We'll be happy to help. @RyannSeed Hmm. Could you confirm if you've selected Android Pay as your payment option? We'll do our best to help. @Kati_S86 Hi Kati. Could you tell us more about what's happening with Android Pay? We'll be happy to help. @swifty1million Hi Thomas. Could you tell us what your Nexus 6 settings say at Settings&gt;About phone&gt;Build number? We'll be happy to help. @Mick_Rawson Glad to know it worked! Some stores aren't setup to accept transactions over £30, there's no minimum limit though. @ChurwellOwl Hi Andre. We're investigating this &amp; would appreciate more info from you: Android Pay's menu (3 dots)&gt;Send feedback. Thanks! @jdta09 Hi Tim. Get a cracker every time you use Android Pay in stores or as you go on TfL until 31 Dec. @DreamMarauder We're investigating this &amp; would appreciate more info from you: open Android Pay's menu (3 dots) &gt; Send feedback. Thanks! @dnsydey You're welcome, Dermot! Reach out if you have any other questions. We're just a tweet away. @Mick_Rawson Hmm. Could you tell us more about the 3rd party NFC you're using? We'll see what we can do to help. @RyannSeed Hi Ryan. What's going on with Android Pay? Let us know. We'll be happy to help. @dnsydey Mind if we jump in? You can use Android Pay to make purchases with your phone at contactless terminals in store for free. @RobbieWalsh89 Hi Robbie. Here's a guide for info on how to make purchases with Android Pay: https://t.co/ZdmpsA8g9T. Hope it helps. @jcabela Hey Jordan. Here's a guide for info on countries that are currently supported with Android Auto: https://t.co/apw5McBP7G. @angelgeekh Hi Kacey. Our product team greatly appreciates feedback. You can submit it in the Android Pay app under Menu &gt; Send feedback. @jedphilpott Hi Justin. Could you let us know if it's happening only at one specific station? We'll do our best to help. @Harlemtwin Hmm. We are investigating this issue. We will update the post in our Android Auto User Community: https://t.co/zxUvDJpxcI. @aailski Hi again. If you are seeing Google Play Services message, make sure that you check all steps posted here:  https://t.co/R44PFdPxg5. @didier0406 Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/feNuPkX93e for updates. @lnettes Hi Lynette. What's going on with Android Pay? Tell us more. We'll do our best to help. @madmillington Thanks for the update. Reach out if you have any questions in the future. @madmillington Hi. We're investigating this &amp; would appreciate more info from you: open Android Pay's menu (3 dots)&gt;Send feedback. Thanks! @EL_NACH0 Hi there. Is your Android Auto app up to date? Check it out and let us know! @Tom__Pollard Hi Tom.We're investigating this &amp; would appreciate more info from you: open Android Pay's menu (3 dots) &gt; Send feedback. @Mick_Rawson Hi Michael. Just to confirm, have you tried setting one of your cards as default? Let us know. We'll do our best to help. @JoshLannister Understood. Our team is investigating this issue, meanwhile check here: https://t.co/3OCu8rcK1w. Thanks. @Harlemtwin Hi Dashawn. Could you check if the Google app &amp; Google Maps are updated to the latest version? Keep us posted. @thecharleskerr Hi there. We're investigating this &amp; would appreciate more info from you: open Android Pay's menu (3 dots) &gt; Send feedback. @strawbazzer Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/feNuPkX93e for updates. @oflahertyevents Hi there. We're investigating this &amp; would appreciate more info from you: open Android Pay's menu &gt; Send feedback. Thanks! Express yourself in new ways with the #AndroidNougat update, featuring new emoji and GIFs that you can send directly from your keyboard. https://t.co/RUNAatJZBD @abhisheki4u Hi Abhishek. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @Javiterol7 You're welcome! Reach out if you have any other questions. We're just a tweet away. @SpireiteBear You're welcome, Lee! Reach pot if you have any other questions. We're just a tweet away. @Javiterol7 Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsBdas. @thatkidaathi Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @SpireiteBear Hi Lee. Mind if we jump in? Have a look at this guide for info on how to set up Android Pay: https://t.co/2fUTWpqFJb. @Maelsnake Hi Mael. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @jassidhu81 Hmm. Just to confirm, are you receiving any error messages? Let us know. We'll do our best to help. @jassidhu81 Hi Jas. Could you tell us more about what's happening with Android Pay? We'll be happy to help. @theverysickest Hi there. Here's a guide on how Android Pay works to keep your payment info safe. https://t.co/Yz01SXF2YJ. Hope this helps. @darren_spillett Hi Darren. We'd recommend reaching out to the manufacturer of the in-dash unit for further assistance. @Lilpfdt Hi. Yes, to use Android Pay you'll need a phone running Android 4.4+ that support NFC &amp; HFC. More info: https://t.co/RLv6K4fG8y. @aailski Understood. We recommend joining our forum discussion here: https://t.co/8cRFrdaYoq. Thanks. @Darren2russell Thanks for the info, Darren. Please Follow us and let us know when you do, so we can move this conversation to DM. @AbrahamZreik Hi Abraham. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/d5mOQhcl5i. @ajithvakod Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/erGA9CqwYw. @SaulloParedes Thanks for your interest! We don't have any news to share now, but keep an eye on: https://t.co/MwpgXzAHoT for updates. @FunBerto80 Thanks for your interest! We don't have news to share about that now, but keep an eye on: https://t.co/MwpgXzAHoT for updates. @snapalot Thanks for your interest! We don't have any news to share about that now, but keep an eye on https://t.co/feNuPkX93e for updates. @Darren2russell Hi Darren. Could you provide us the make &amp; model of your device? We'd be happy to help. @Zirino1 Hi there. We'd like to chat further about this. Please follow us &amp; let us know when you do, so we can reach out over DM. @digitalwriter1 Thanks for your interest! We don't have any news to share now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @Stakoman Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @kkrishnaanand Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @TheAlexBoss Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. It’s time to 🎉🎊 #AndroidPay just launched in #NewZealand. More countries coming soon! https://t.co/HvM3NE2fjF @KraeMalone You're welcome! Let us know how it goes. @KraeMalone Try holding your phone a different way to avoid signal issues. The NFC antenna might be at the top or bottom of the device. @KraeMalone Thanks for the info. Does this happen in every store or just one? Let us know. @KraeMalone Got it. Are you receiving any error messages while tapping the phone on the terminal? @KraeMalone Hmm. Just to confirm, have you tried these steps to make a payment with Android Pay: https://t.co/eKZG8qUBtS? Keep us posted. @KraeMalone Hi there. What's going on with Android Pay? Let us know. We'll do our best to help. @Ajouk You're welcome, Andy! Reach out if you have any other questions. We're just a tweet away. @Ajouk Hi Andy. Yes, it does. Some stores are not setup to accept mobile wallet transactions over £30, so they require the physical card. @ChloeVKBartlett Hi Chole. Let's move the conversation to DM to discuss this further. @anonynuss Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @connaismith Android Pay works only with phones running Android 4.4+. You may submit a request here: Android Pay app &gt; Menu &gt; Send feedback. @devvoasowt Hi there. To use Android Pay you'll need a phone running Android 4.4+ that support NFC and HCE: https://t.co/RLv6K4fG8y. @neildavis132 Hmm. If the loyalty card shows a serial number, you can present it to the cashier and enter it manually. Hope this helps. Start each day off strong. Set up recurring alarms &amp; be the early bird that gets the worm. 😴 #AndroidTip https://t.co/syxdooJvaV https://t.co/e5s8HY6jWg @dimsum888 Hi there. We'd like to help. Just to confirm, have you already tried these steps to pay for a transit: https://t.co/tTJae4WiPr? @PsychoGraceffa You're welcome! Give us a shout if there are questions we can help answer. @aSystemOverload Got it. Let's move the conversation to DM. @PsychoGraceffa Hi there. Mind if we jump in? You just need to wake your phone and unlock it, no need to open the app. Hope this helps. @SteveDoidge You're welcome! Reach out if you have any other question. We're just a tweet away. @aSystemOverload You can still use Android Pay by showing the serial number to the cashier. @aSystemOverload Hmm. Android Pay doesn’t show barcodes for merchants that don't have the technology to accept it at the point of purchase. @manogath Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @SteveDoidge Hi there. Thanks for your interest! We don't have news to share about that right now. For updates: https://t.co/Z3ydjsSOz2. @neildavis132 Hi Neil. Try the steps in this guide to troubleshoot issues on redeeming Loyalty cards: https://t.co/6sgOoXX04L. Does it help? @neildavis132 Hi Neil. Have you tried updating your location details by signing in to https://t.co/Xs8VCf4DJv &gt; Settings &gt; Address (Edit)? @aSystemOverload Hi there. Let's try the troubleshooting steps in this guide (See 'Fix problems scanning\"): https://t.co/6sgOoXX04L. @IslandOfDan Hi Daniel. Mind if we jump in? Android Auto is compatible with Ford models from 2017. More info here: https://t.co/wTKTPFjJTr. @mikemichaelsUK Thanks for your interest! We’re working to bring Android Pay to more countries asap. Stay tuned: https://t.co/Z3ydjsSOz2. @abrahimo4 Thanks for your interest! We don't have any news to share about that now, but keep an eye on https://t.co/feNuPkX93e for updates. @kk_ftp Sure. Let us know how it goes. @kk_ftp Hmm. Just to confirm, have you tried using Android Pay in another store? Keep us posted. @kk_ftp Hi Kamran. Could you tell us more about what's happening with Android Pay? We'll do our best to help. @mikemichaelsUK Hi Michael. Could you confirm if your card is supported with Android Pay: https://t.co/wQQaHX6dEH? Let us know. @shao1in Hi there. This feature isn't available. However, you may send a feedback: Android Auto app&gt;menu&gt;Help &amp; feedback&gt;Send Feedback. @abaamer Hi there. We’re working to bring Android Auto to more countries asap. Stay tuned: https://t.co/BuZ1V41JfY. Thanks. @Bristol_Neil Hi Neil. This feature isn't available. However, you may send a feedback: Android Auto app&gt;menu&gt;Help &amp; feedback&gt;Send Feedback. @mebz15 Got it. Please follow us and let us know when you do, we'd like to connect you to a specialist for further assistance. @mebz15 Just to clarify, have you tried using a different payment method on Android Pay? Let us know. We do want to help. @mebz15 Thanks for the info, Saul. Try using a different payment method. Does that help? @mebz15 Got it. Do you receive any error messages while making the payment? Let us know. @mebz15 Hmm. Just to confirm, are you trying these steps to pay for Transport for London: https://t.co/afgZYOc5cc? Keep us posted. Test your binary skills with the @AndroidWear Binary Watch Face. Enjoy: https://t.co/HeGlI9aX0K https://t.co/7g51awok2q @KalmaLady Got it. We'd recommend reaching out to the manufacturer for further assistance. Hope that helps. @mebz15 Hi there. What's going on with Android Pay? Let us know. We'll do our best to help. @TomislavFlis You're welcome. Reach out if you have any other questions. We're just a tweet away. @TomislavFlis Hi there. We’re working to bring Android Auto to more countries asap. Stay tuned: https://t.co/Q4w8ZICiIG. Thanks. @KalmaLady Hmm. Could you please share the make &amp; model of the device you're using? Keep us posted. @sat_nav79 Android Pay works only with phones running Android 4.4+. You may submit a request here: Android Pay app &gt; Menu &gt; Send feedback. @sat_nav79 Hi Mike. To use Android Pay you'll need a phone running Android 4.4+ that support NFC &amp; HFC. More info: https://t.co/LINyA5GkSv. @gunner_del Hi there. Payment will be made through Android Pay only when you’re holding your device against the contactless terminal. @AliceIWon Hi Alice. To use Android Pay you'll need a phone running Android 4.4+ that support NFC &amp; HFC. More info: https://t.co/RLv6K4fG8y. @axeljacobsen Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/feNuPkX93e for updates. @elrondmiddleeng Hmm. Please follow us and let us know when you do so we can discuss next steps over DM. Thanks @elrondmiddleeng Hi there. Just to confirm, is your card supported with Android Pay: https://t.co/wQQaHX6dEH? Let us know. @jcabela Hi Jordan. We’re working to bring Android Auto to more countries asap. Stay tuned: https://t.co/UY3BxZzdDb. Thanks. @tc_sachin Hey Sachin! Which country do you reside in? Take a look of which countries are currently supported here: https://t.co/apw5McBP7G. @M_Heap Hmm. Let's move this conversation to DM. @M_Heap Hi Mathew. Just to confirm, is your device rooted? Let us know. We'll do our best to help. @j_rhenry Hi John. Have you tried updating the Address details by logging into https://t.co/Xs8VCf4DJv &gt; Settings &gt; Name and Address? @aailski Hmm. Is your Android Auto updated to the latest version? Check it out and let us know. @aailski Hi Amy. Can you provide us with more info on the issue? Any errors, messages, etc. will help. @Katarazzi1 Hi Katherine. Here are a few ways Android Pay works to keep your payment info safe: https://t.co/XKkCK0BBfY. Hope that helps. @Ja_Kivi Hi Janne. We plan to launch in more countries in the future, but don't have any details to share right now. Stay tuned. @KalmaLady Hi there. Can you provide us with more info on the issue? Any errors, messages, etc. will help. @ross11anderson Hi Ross. We’re working to bring Android Auto to more countries asap. Stay tuned: https://t.co/TC1nbnEFYZ. Thanks. @_erikn_ Hi Erik. We’re working to bring Android Auto to more countries asap. Stay tuned: https://t.co/uENGpnEP0X. Thanks. @Lewisdc123 Hi Lewis. Android Auto is compatible with these vehicles: https://t.co/SpTV3CfBAw. Hope this info helps. @AreWibe You're welcome. Reach out if you have any other questions. We're just a tweet away. @ronin_vj You're welcome. Feel free to contact us if you have questions, we're here to help. @AreWibe Hi there. Android Auto hasn’t made it to Norway but you can keep checking for info here: https://t.co/PKo5kDQZ56. @ronin_vj Hi Ronin. We’re working to bring Android Auto to more countries asap. Stay tuned: https://t.co/TqBZ4W7Gp3. Thanks. Limit the distractions on your drive home for the holidays with #AndroidAuto. Get the app: https://t.co/Pf925xgYZ2 https://t.co/GfSpmoLmDr @vinycss You're welcome, Vinny! Reach out if you have any other questions. We're just a tweet away. @SAImmgProb Hi there. Android Auto hasn’t made it to Malaysia but you can keep checking for info here: https://t.co/lzsxFWPE00. @JoshLannister Thanks for the info. Could you check if you have the toggle control to zoom in/zoom out the screen on the head unit? @Jordanixting Thanks for the info. Please follow us &amp; let us know when you do, so we can reach out over DM. @Jordanixting Hmm. Did you receive an e-mail about the card being removed? Keep us posted. @Jordanixting Hi Jordan. Have you opened the Android Pay app in the last 90 days? Let us know. We'll be happy to help. @maldham Thanks for your interest! We don't have news to share about that right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @vinycss Thanks for your interest! We don't have news to share about that right now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. @JoshLannister Hi Josh. Just to confirm, are you referring to the head unit or Android Auto on your phone? Let us know. To pumpkin pie or to not pumpkin pie? Say “Ok Google” to get the answer. #AndroidTip https://t.co/gIsyZZNhny @paulriley_ Thanks for the feedback, Paul. Reach out if you have any questions in the future. @paulriley_ Hi Paul. Some stores are not setup to accept mobile wallet transactions over £30, so they require the physical card. @Aaron_kearney Thanks for your interest! We don't have news to share about that now, but keep an eye on https://t.co/Z3ydjsSOz2 for updates. No one likes burnt 🍞. Make sure your kitchen creations come out on time with the @AndroidWear kitchen timer. https://t.co/3rkm6VU3X6 https://t.co/evPdn79k24 @hartmanmike0 Thanks for the update. Feel free to contact us if you have questions, we're here to help. @hartmanmike0 Hi there. Try holding the button longer until you hear a beep. Let us know if that works. @Papadraak Thanks for your interest, Andre! We don't have any news to share about that right now. Stay tuned."}