{"tweets": "Abu Dhabi! I had such an amazing weekend. Thank you to everyone that came out to the shows 🙏🏾 #LoudAndClearTour see this weekend Austin, TX! https://t.co/e68VuHz2oN SoCal! On Dec 6th I’m bringing my #LoudAndClearTour to the Staples Center! Invite 13,000 of your closest friends and let’s share some laughs. 😄 Find tickets here —&gt; https://t.co/rdAVfKfa8o 🎥: @woozuumedia @vitalyzdtv https://t.co/tNuALGrjZ1 Go watch &amp; share this extended clip from my “Son Of Patricia” special before @netflix makes me delete it from my YouTube! 😜 -&gt; https://t.co/9nSK3mUhYb Watch the special in its entirety on Netflix! #SonOfPatricia #Netflix https://t.co/nUjZ4hYSvt Always a great time visiting with @cthagod &amp; @angelayee! 🙌🏾 You can watch the full conversation on the @breakfastclubam’s YouTube! —&gt; https://t.co/iY52GZ8Drp https://t.co/BGKWsh5Pm3 Such an honour. Thank you 🙏🏾 https://t.co/wKVwtH7V5D Last night it was truly an honour to present the HSA Visionary Lineage Award to Dorothy and Lupita \nNyong’o. And I’m not saying I’m @Lupita_Nyongo’s best friend in the whole world but they didn’t pick anyone else to hand over the awards so....😋 https://t.co/LBhQrAVlKV 🤣🤣🤣💀 https://t.co/FmUX13ydFA I had a dream I made my Staples Center show entrance exactly like this! So if you’re coming to my Dec 6th show please line up outside the main entrance day of show and stay in your widest stance until you hear otherwise. 😂 Show info at https://t.co/L7bDKHUiXq 🙌🏾 https://t.co/s9io1O49ZV The best selfies are the ones where you act like you didn’t take the picture of yourself. 🤣 https://t.co/gEOgUWfiEy Rocking the purple tonight to stand in solidarity against LGBTQ+ bullying! 💜#SpiritDay https://t.co/NvGEawrOlR RT @TheDailyShow: Trump vs. Trump: Kurds Edition https://t.co/eqMMwNWtlg Throwback to anyone who hasn’t seen it, but mostly for my dude @joelembiid to rewatch 😂 Watch the full video here —&gt; https://t.co/rIkPKVZ16Z https://t.co/N6GhgMp5pR Thank you for spending your Saturday night with me Northern Illinois University! 🙏🏾 #LoudAndClearTour https://t.co/GlizJucKSQ Thank you to everyone that came out to the shows tonight! 🙏🏾 Indiana University I appreciate all the love and laughter. #LoudAndClearTour https://t.co/YuyHX7jMp8 Walking away from the ATM after you see that payday direct deposit hit your account😄🙌🏾 🎥 : Lacoste GR https://t.co/pt4n5rFExn RT @TheDailyShow: China is going to war with the NBA over a pro-Hong Kong tweet. Trevor and @ronnychieng weigh in: https://t.co/0Xr7NPpnOG New throwback clip is up on my YouTube in case you out here in these feeds just tryin to get yo giggle on! 🙋🏾‍♂️Watch the FULL vid here —&gt; https://t.co/NcxQXxoD0v #ThrowbackThursday https://t.co/voDbR0pTcm Just added a 2nd show in Tucson, AZ! You can find tix at https://t.co/a2IGk6MzLD using code “IsThisThingOn” 🙌🏾 #LoudAndClearTour https://t.co/VQmevDsngl RT @TheDailyShow: Uh, Trump can't just \"decline to participate.\" It's not the Vietnam War. https://t.co/6JQEOV0LkB RT @TheDailyShow: CAN ANYONE FIGURE OUT WHY THE PRESIDENT CAN'T HEAR QUESTIONS https://t.co/eCcRVTESKW NYC, if you’re coming to my Nov 8th show at @thegarden... please, leave your MF-in snakes 🐍 on the MF-in train!! 😂 Find tix at https://t.co/ENkTzstDuM 🙌🏾 https://t.co/SMtw5Ena2E RT @PubbyLongway: that boy john done transferred schools on these folks!😂😂😂 https://t.co/elvcbsu6lv Laws &amp; policies should work for everyone, regardless of race or where they come from. Inspired by the work of @shrivercenter - an organization advancing economic &amp; racial justice through litigation, policy advocacy, &amp; trainings. Follow their work &amp; get involved! #ForJustice https://t.co/dbLGFrn4ur RT @TheDailyShow: Police officer Amber Guyger was found guilty of murdering Botham Jean, an unarmed black man, in his own home. But the ver… That “Someone just reminded you it’s Friday kinda smile” To everyone reading this... have an amazing weekend! 😃 📷: @dpmeyer https://t.co/QcNegk9m3m It’s. About. To. Go. Down! https://t.co/WdqFPJVJAb https://t.co/2vIH0KNkWD RT @TheDailyShow: Trevor is LIVE with @Ninja right now on @WatchMixer: https://t.co/fvUCkzMVJK https://t.co/1FM2h02oro RT @Ninja: About to go live with @Trevornoah ^_^ https://t.co/2KBbwUWiKN https://t.co/pGUnSebD1N RT @TheDailyShow: Today @ 1:30PM ET @Trevornoah &amp; @Ninja talk all things gaming and play Fortnite/FIFA. Catch it LIVE on @WatchMixer! \n\nhtt… New upload on the YouTube! You can watch the full clip here 👉🏾https://t.co/OpVo8EaYbp A big THANK YOU to all the new subscribers 🙏🏾🔥 https://t.co/q0KDF3Rhhe RT @rochemamabolo: You aren't stuck in traffic, you are the traffic. https://t.co/LycuxN8aYe From this angle Madison Square Garden doesn’t look very… umm… square. #MindBlown NYC, Nov 8th meet me at the big circle we call square. You can find tickets on my website. https://t.co/L7bDKHUiXq Who’s coming? #LoudAndClearTour #NYComedyFest #MakeNYLaugh https://t.co/239jsqrovH Orlando, last night was insane! Your energy blew the roof off that arena! Thank you to everyone that came out 🙏🏾 #LoudAndClearTour https://t.co/Bojxxl2GiT RT @TheDailyShow: We made a browser extension that turns Trump's tweets into crayon scribbles. Works really well with this one! \n\nDownload:… The world's biggest problems are not insurmountable. Check out tonight’s episode of #ACTIVATE on @NatGeoChannel to see how my friends @GlblCtzn are working to end extreme poverty. You can also watch online at https://t.co/wrSm0V59Uy https://t.co/FhjueHiPiX Throwback. 📺 Watch the full video here —&gt; https://t.co/6k9nGpNayM 🔥 https://t.co/lAhQmMuDPd RT @roywoodjr: Relationship Question: If you lost your spouse in the Thanos snap but 5 yrs later the Avengers brought them back, but you al… RT @TheDailyShow: BREAKING: The Daily Show reacts to Trump impeachment inquiry on TikTok https://t.co/bndGfaT0QE RT @DitzMcGeee: Johann Pachelbel's Canon in D, performed on rubber chicken, has renewed my faith in mankind. https://t.co/gLyxx9l5YL That “just passed 10 million followers dance”🕺🏽Appreciate all the love! 🙏🏾 🎥: @bleach_media https://t.co/ICtkXz5pKE New throwback clip is up on my Youtube! 🙌🏾 You can watch the FULL 15 min video here —&gt; https://t.co/5vIon93Q9J Enjoy! 😊 https://t.co/h34x57cvrY RT @TheDailyShow: REVEALED: The true meaning of Trump's \"in any history\" comment https://t.co/mbn6Sk3GzG Wow! Charlotte, you packed that arena out! Thank you for all the love, laughter, and a night I won’t soon forget! 🙏🏾 #LoudAndClearTour https://t.co/HBcFMcIIxT RT @MoSalah: 😂😂 https://t.co/u8xoNZeslk Thank you Columbus, for an incredible night! 🙏🏾 Can’t wait to come back #LoudAndClearTour https://t.co/SvIXOzftpI Excited for a weekend of shows! See you tonight Columbus! 🤗 #LoudAndClearTour #ColumbusOH #CharlotteNC https://t.co/iIjWVDLMSc RT @TheDailyShow: Are you a former presidential candidate having trouble reentering society? Welcome to Fading Dreams Candidate Reintegrati… RT @TheDailyShow: BETO: We need to stop gun violence\nBOOKER: I can unite the country\nYANG: Guess what, America? You just got in THE CASH CAB Yeah I said it. I'm my grandmother's favorite. 😂https://t.co/917XBNek9O RT @TheDailyShow: Climate activist @GretaThunberg on the #1 thing people can do to help mitigate climate change.\n\nExtended interview: https… New upload on the YouTube! Watch the full clip here 👉🏾 https://t.co/sEDVx5cwXO If you enjoy it, share it with your friends! If you don’t like it, share it with your enemies... just to torture them! 😁 https://t.co/49PYRFaXTF RT @TheDailyShow: .@ChrissyTeigen’s tweet at Trump was too vulgar for the news to repeat. Luckily, we’re not the news. #PresidentPAB https:… I don’t always agree with Julius Malema but this statement on Xenophobic attacks in SA is perfect. https://t.co/VDIYViwpqi Social Media is the best and worst thing ever invented. If we don’t figure out how to curb fake information, we’re doomed. https://t.co/3vYsfGob3P RT @BradSmi: I’m looking forward to kicking off the first #ToolsandWeapons event with my friend @TrevorNoah next Monday in NYC with @TheNew… RT @Rashona: The Academy Award for best dramatic performance goes to… https://t.co/ErlQc2JcpQ A little throwback for you! Watch the FULL clip here —&gt; https://t.co/NTMpHid2wi 🙌🏾 #ThrowbackThursday https://t.co/lmLuAq6o42 RT @ShoMadjozi: The reason we have bad leaders is because we want bad answers. We want people to say “foreign nationals are completely inno… RT @jaboukie: i hate when people say “are you okay” no i’m starved for affection bitch i will kiss you Trying to get back into the swing of things after the long weekend https://t.co/fCS40J01ZA Thank you to everyone that came to the show in Atlantic City! 🙏🏾 Can’t wait to come back! #LoudAndClearTour See you soon... Columbus, OH 🙌🏾 https://t.co/DrmTsR12u3 If you haven’t seen it, the FULL clip is now up on my Youtube —&gt; https://t.co/LyYJnNJpQL  🙌🏾 Share if you care 😉 #ThrowbackThursday https://t.co/WIiYnuOdNN RT @blxcsoul: Here’s a clip of Michael making us feel poor for 2 mins straight. This gotta be the biggest flex of all time 😭 https://t.co/C… RT @dpmeyer: If you read BORN A CRIME or are just interested in learning more about @Trevornoah and his origins as a comedian, check out my… RT @RexChapman: This is the Twitter content I’m here for...💪😍😇🥋😉🔥   https://t.co/h5szw7FK5E RT @TalbertSwan: Calling a Black POTUS married 25 yrs to 1 wife with 2 children, no mistresses, affairs or scandals, ‘the antichrist’ but a… Singapore! Thank you to everyone that came to the shows!🙏🏾 Such an amazing night. #LoudAndClearTour https://t.co/y0z7rxvLZf Don’t do it Donald, #DontDeportMelania https://t.co/dRoT5imqVw RT @TheDailyShow: Is Donald Trump trying to deport Melania? #DontDeportMelania https://t.co/aWoNOErfbV My highlight of the week was walking through the Dominican parade and one guy shouting \"Omg I knew it, Trevor Noah is Dominican!\" 😄 https://t.co/qiKlX70daJ When life closes a door.... grab a drill and pop that $%*T off the hinges! 🙌🏾 #TrevorsMondayMotivation 📷: @ruminasean https://t.co/q03dOAfmtq RT @SpheDludla: Nothing beats teamwork 😂😂 https://t.co/K3aNYTl10V RT @jaboukie: parents after you use the education they forced you to get to confront them abt how you were raised\n\n https://t.co/thM2AOkffJ New Hampshire! Your energy was electric⚡️ Thank you to everyone who came out to the show! 🙏🏾#LoudAndClearTour https://t.co/EsGg28SpGJ Headed into the weekend like... 🕺🏽 \n\nSee you tonight Hampton, NH! #LoudAndClearTour https://t.co/E3eKy5X01O We now live in a constant state of terror.\nhttps://t.co/FE3pNZpXyd RT @TheDailyShow: Oh look, the El Paso shooter's manifesto is out on audiobook https://t.co/CzyLz5uOha NYC! IT’S... ABOUT... TO... GO… DOWN! @TheGarden Nov 8th, 2019! Ticket pre-sale starts NOW. Find them here --&gt; https://t.co/PAJZB9F9fk @NYComedyFest #MakeNYLaugh #LoudAndClearTour https://t.co/myqAV1qh08 Me trying to get you to respond to my DM's😄 🎥: @cesarmillan https://t.co/vSDk1YY2JG RT @TheDailyShow: Trevor reacts to the El Paso and Dayton mass shootings: https://t.co/i4XOj9qqXv RT @TheDailyShow: And now, Part 1374 of our ongoing series: Imagine If Obama Did This Shit https://t.co/JKg8J423VI Happy Monday! Let’s kick off the week by making an impact. Join me and sign the @GlobalFund open letter to #StepUpTheFight at https://t.co/4GoJq6272G https://t.co/b35otXcZFs RT @Lupita_Nyongo: 🦒🐘🦁🦓🐒🐆🐃 #Serengeti premieres tomorrow at 8pm on @Discovery! https://t.co/yweejeIWTj @findingpeace 😂😂😂😂😂 You all have set my Youtube on fire!🔥🔥🔥🙌🏾 Thank you to everyone who has shared or subscribed! 🙏🏾 Here’s another throwback. Enjoy! https://t.co/nltZPtefaC https://t.co/XGh0SRiLqo RT @TheDailyShow: The moment Booker dropped Kool-Aid https://t.co/4cuzvKeDL1 RT @TheDailyShow: If it's what you say, we love it, especially later in the summer https://t.co/0yjwdEswjm This week’s podcast is up! @davidkibuuka and I discuss the science behind online dating. Check out the episode at https://t.co/Ykg8yZ9iAb then let me know your thoughts💭 https://t.co/S7NJFpQeCa This is actually a picture from the future of me reading the comments to this same picture. Man, technology is getting crazy! 📷: @dpmeyer https://t.co/E5BieNiPho RT @TheDailyShow: #DemDebate https://t.co/6zEDHps6aY RT @TheDailyShow: Damn does FaceApp now show what you would look like if you were polling above 0% https://t.co/7MW6zBgvOO Happy Monday people. Remember to keep your eye on the ball! 📷: @ruminasean https://t.co/hWONi8oH0R Such an amazing night! Thank you Montréal! 🙏🏾 #LoudAndClearTour https://t.co/8uLAWrHA53 Montreal, I can't even begin to thank you enough for tonight. You filled that arena with joy and laughter and I love you for it.  Merci Montreal❤️ RT @TheDailyShow: Don’t miss America’s favorite new sitcom, Meet the Debts! Starring @Jaboukie, @DesiLydic, @RoyWoodJr and crippling studen… Me planning for the weekend with my bff  \n\n🎥: @jayshetty https://t.co/LqTmIpcnyv https://t.co/AyXd90wisa RT @Trevornoah: Haters will say it’s fake! \n🎥: @mystergiraffe 😂 https://t.co/RJsTaDc0xJ Discussing the myth of recycling with the person who literally wrote the law on plastic bags, Jennie Romer. Listen to this week's episode of “On Second Thought” on https://t.co/MpaGun5LI7 @hearluminary https://t.co/ktp5L81ri4 RT @TheDailyShow: Devin Nunes did his homework https://t.co/Y8DzGoMlMM Haters will say it’s fake! \n🎥: @mystergiraffe 😂 https://t.co/RJsTaDc0xJ RT @TheDailyShow: .@cherylwillsny1 you are a BEAST https://t.co/s7aUyRegp9 The cutest video you will see on the internet today! 🙌🏾\n🎥: @ChloeFlower https://t.co/8MbCb3APTJ RT @_ang03: My co-worker's sister wasn't ready man. https://t.co/ENRPrr09zW Ohio, You powered through that heat! Thank you for an amazing night! 🙏🏾 I will see you next in Columbus 🙌🏾 #LoudAndClearTour https://t.co/tKVu8xl6oR RT @TheDailyShow: Trump says he \"started speaking very quickly\" to stop the \"send her back\" chant. Here are some things that take less time… Saying goodbye to my youth... https://t.co/8D2A1NiJmy Buddy was just as excited to hear that @thedailyshow was nominated for another 2 Emmys! Congrats to the amazing Daily Show team! Honoured is an understatement! 📷: @ruminasean https://t.co/lGSXDqqmer https://t.co/PD07EHe8J0 Headed to Toledo, OH this Friday like... 🐕 Get ready Ohio! 🙌🏾 Toledo Zoo Amphitheater. #GitUpChallenge #LoudAndClearTour 🎥: Bryan Boye https://t.co/KLugE8Bjnq Happy Monday everyone! 😀\n📷 @alex_gavillet @THR https://t.co/w1nPXhGPr7 Oh snap just went to scout the stairway and someone is stuck in the elevator. I just asked him if his phone has battery and he replied \"70%\". Some people are so lucky... Just heard my neighbor open and then close his door. Now that I know there's someone on my floor I feel a little bit better. If push comes to shove I can eat him... Ok forget peace and quiet my phone's battery is at 10% and if it dies I won't be able to order food. The elevator is not working which means I'd have to use the stairs but the jeans I'm wearing are too tight for me to climb up stairs and I'm starting to panic... Blackout update- 30 minutes and still no electricity in NYC. I'm staying calm because the lights should be back soon. I'm actually enjoying the peace and quiet. This scene https://t.co/S3k1VJE0aU I asked a friend visiting New York to bring me something nice from South Africa. I thought he'd bring me biltong, looks like he brought loadshedding instead. 😄 Jesus I almost crapped my pants. I was watching Stranger Things and In the show, the mind flayer causes the lights to flicker and then all of a sudden my TV goes dead and the power in my building goes out. Turns out there's a blackout in New York.😰 Another throwback for your Thursday 🙌🏾 Watch the full video here —&gt; https://t.co/yWefRQMWuY Enjoy! https://t.co/prJ69pa7eC Headed into Monday like... \n🎥: @RachetTV_ https://t.co/uY4h6aEgaQ What a goal Bafana Bafana!!! 🙌🏽🙌🏽🙌🏽🙌🏽 😂😂😂😂 🙌🏾 Via @jadapsmith My EXACT sentiment when my favorite song comes on! 😆✨ 🎥: @aussiethecharlie https://t.co/WCizs1B0zv That earthquake was not fun... Lake Tahoe this Friday! Harvey’s Outdoor Arena. Who’s coming? 🙋🏾‍♂️\n#LoudAndClearTour \n🎥: @bleach_media https://t.co/SA0AnKiDGF This week we talk reparations. And peacocks. Find the full episode of my podcast “On Second Thought” at https://t.co/MpaGun5LI7 @hearluminary https://t.co/3h6SdCgwa8 Thank you to everyone that came to the show last night in Vegas! 🙏🏾 Next up... Saratoga, CA - Lake Tahoe - &amp; Santa Rosa, CA! #LoudAndClearTour 🎤 https://t.co/wxySTXnOcM RT @MrGeorgeWallace: Shout out to covered wagons. They used to not have covers. Wish I was there the first time someone showed up with a co… Thank you to everyone that came to the show last night in Louisville! 🙏🏾 #LoudAndClearTour 📷:@heidengoseek5 https://t.co/ZnO6JQTb7W RT @TheDailyShow: Wanna feel old? Here's what the cast of Two and a Half Men looks like today #DemDebate2 https://t.co/gfwhQkb1vm Me on Thursday night trying to get in shape before my show in Vegas on Sunday night! 😳 Who’s coming to the show? 🎥: @cesarmillan https://t.co/eFfXZ7rXrf RT @TheDailyShow: The thrilling story of a ragtag group who attempted to do the impossible: build a debate stage for 20 Democratic candidat… Throwing it back. Watch the longer clip here —&gt; https://t.co/0f3PxIBZn2 https://t.co/lslSeFEnXl RT @TheDailyShow: When Dad says \"Hola, como estas?\" to the waiter at the Mexican restaurant #DemDebate https://t.co/64FY2LV6kp Twinning so hard. 🙌🏾 @fallontonight is. about. to. go. down! Tune in! 📷: Andrew Lipovsky/NBC https://t.co/MWVVFiFoBn When you need to take your medication with food 😄😄😄 🎥 Insta: the_yellow24 https://t.co/boGwFyHHi2 Arkansas &amp; Texas! Thank you to everyone that came to the shows! 🙏🏾 I see those hashtag pics 🙌🏾😃#LoudAndClearTour https://t.co/xPjb1toVlo Immigration in America. Is it broken and how can it be fixed? We chat to Muzaffar Chishti one of the foremost experts on immigration policy!! Listen to “On Second Thought” now on @hearluminary https://t.co/MpaGun5LI7 https://t.co/5irZ66tok8 Happy Friday everyone! New upload on my https://t.co/nltZPtefaC 🙌🏾🔈@nathanwalters https://t.co/do31RnCyHg @GeeDee215 I wanna buy your show!!!😂😂😂 This is amazing. I didn't know they were recording.😂😂😂😂 @THR https://t.co/FdANHRoDjI Our show may have been the first but it definitely won't be the last!!! https://t.co/fMxh6GvyFj So excited and honoured to be on this week’s cover of @THR https://t.co/gDO9vcK1QD 📷: @alex_gavillet https://t.co/r3SwdxR3nO RT @TheDailyShow: “You know what’s most troubling about this? How many people have been arrested and put in jail because everyone assumes t… RT @TheDailyShow: When grandpa's telling the same stories again and you can't get him off the phone https://t.co/1sLnhM6IbS Canada! 🇨🇦 I had an amazing time and hope you’ll have me back. But just to be certain I’ve taken a hostage. #NotARealThreat #ButWouldLikeToComeBack #JustCallMeSoWeCanWorkThisOut https://t.co/udyhgA3Hdb RT @TheDailyShow: We would like to invite all, even the haters and losers, to the Donald J. Trump Presidential Twitter Library - now open i… RT @TheDailyShow: Can’t stop watching these world leaders sit there while Trump spews his nonsense https://t.co/dn5imhNgRJ Just two dudes having lunch... that just so happened to be prepared in Hell 🔥 @seanseaevans this was so much fun! 🙏🏾Thanks for inviting me on your show! #HotOnes @firstwefeast 🍗 Watch the FULL episode here —&gt; https://t.co/tvDLhvzFN2 🙌🏾 https://t.co/wo2G89qcQN Tomorrow. 11am. It’s going down. 😬 #HotOnes @firstwefeast 🙌🏾 #WingsOfDeath 💀#WhyDidIAgreeToThisAgain 🤦🏾‍♂️ https://t.co/J0fEulHObJ RT @firstwefeast: This week on #HotOnes we got @Trevornoah sitting in the hot seat. Tune in this Thursday @ 11am 🔥 https://t.co/qMJQ7SfEpH Hey you, stop that! Hump day just means the middle of the week. 🤦🏾‍♂️ Happy Middle of the Week Day everyone! 🙌🏾 📷: @ruminasean https://t.co/Hc9zLdlUr7 RT @AComicSoul: 🚨 #PRESALE 🚨\n\nCATCH HIM IF YOU CAN🚶🏽‍♂️💨 @Trevornoah adds an EXTRA show to his sold out \"Loud &amp; Clear\" tour 😱\n\n@TheO2 Arena… https://t.co/bK5EyR9mc6 RT @NutmegRadio: South Africans showing up to World Cup games remains the best entries https://t.co/yB7UCGZAQz Every conversation I've had while high 😂 🎥: @comediandjpryor https://t.co/E839hW2pNZ RT @TheDailyShow: What do you get the man who has tweeted about everything?\n\nThe Donald J. Trump Presidential Twitter Library opens in Wash… Congrats @shomadjozi on your well deserved @BETAwards nomination!! 🙌🏾 #BestNewInternationalAct 🇿🇦 https://t.co/vwY7MviLkm Hershey, PA! What a memorable night! Thank you to everyone that came out 🙏🏾 The #LoudAndClearTour continues. Next stop... Vancouver, Canada! 🇨🇦  📷: @underground_nyc https://t.co/KGF7ynk2Kr Thank you everyone that came to the show last night in Pittsburgh! You were 🔥🔥🔥 🙏🏾 Next stop Hershey, PA! 🍫 #LoudAndClearTour 📷: Mike Drazdzinski https://t.co/clU7MsUvyI RT @TheDailyShow: BEGIN THE MULLET INVESTIGATION https://t.co/HbzTKlRtXQ When life gives you lemons, make an Usher video😄🙌🏽  🎥: unknown https://t.co/fO0Dhxs2hP I see those #LoudAndClearTour hashtag selfies! 🙌🏾 Thank you to everyone that came out to the show last night Ohio! 🙏🏾 https://t.co/7WTsrbUVrO This is amazing! When you're done reading it, I'd love to visit the school so I can quiz you! 😄 https://t.co/GB1ZJ9xhhz Watch, Share, Subscribe! 🙌🏾 —&gt; https://t.co/mjsuNI9qIY #ThrowbackThursday This is how I celebrated when we announced my tour coming to London! O2 Arena see you on April 4th, 2020!!! 🙌🏾 Side note: If this adorable little girl doesn’t make you smile, nothing will 🎥: @breckenfowler https://t.co/ooCReQALX6 RT @AComicSoul: 🚨 PRESALE 🚨\n\n@Trevornoah LIVE at the @TheO2 Arena, April 4th, 2020 with the brand-new show \"Loud &amp; Clear\"🗣👓\n\nGet the best s… Watch the oranges carefully, now look down at your wallet, now back at the oranges, now back at your valuables. If they’re gone, don’t blame that $h!t on me! You need to be more mindful of the kind of people u let around u while u stare at dudes juggling oranges on the internet! https://t.co/bV6YIV1x2c Colorado! Thank you to everyone that braved the cold weather and came to the show last night! An amazing night, I won’t forget 🙏🏾#LoudAndClearTour 📸: @marklashark https://t.co/MtAItssDEG Fighting with your siblings over food and then your mom walks in https://t.co/6oLrquNAXZ Had the best time with @JimmyKimmel tonight! #Kimmel @JimmyKimmelLive #ABC https://t.co/UBMQ93ckH7 🕺🏽😭🙈🙌🏽❤️🤯🕺🏽 https://t.co/408MZBRzGu Throwback! https://t.co/TlzmimxLqL Share &amp; Subscribe 🙌🏾 The only possible way to feel after @thedailyshow wins 5 Webbys! Thank you to everyone who voted 🙏🏾 Now... can someone please help me down? 📸: @underground_nyc #webbys https://t.co/r50uHxmX1p Me on my cheat day 😂 🎥: Insta theofficial_poodapooda https://t.co/bFMh2Rc8Ed Thank you for spending your Saturday night with me San Diego! You were amazing! 🙏🏾 #ViejasArena #LoudAndClearTour 📷: @betsnewman https://t.co/6Wq3jAwpnk When you love what you do, it keeps you looking young!\n#LoudAndClearTour https://t.co/hJkJlhpPhB A little throwback for you 🙌🏾 Enjoy! https://t.co/PZ0wmOx2SY RT @TheDailyShow: Bernie Sanders had a public access TV show in the ‘80s. We sifted through the unearthed footage and hoooboy… https://t.co… Just added new dates to my LOUD &amp; CLEAR Tour! Ticket Pre-sale starts TODAY! https://t.co/G1H9lkW1kj Use code: “IsThisThingOn” to get the best seats. Then we will just make fun of everyone who waited that has to sit behind you! 🙌🏾 https://t.co/lfliNj9Xot How the robots are gonna celebrate after they've wiped us out 🎥: Insta utsource_tech https://t.co/Vk43MKBaJE 😰 https://t.co/6jD7Dn0sc7 Philly you were 🔥 Thank you to everyone that came to the shows tonight! Let’s do it again tomorrow night 🙌🏾 #LoudAndClearTour https://t.co/2d9hYL63hp RT @TheDailyShow: Some are calling the Arctic the new Africa, and the original Africa has some tips for when the white people come. Full pi… RT @DrRJKavanagh: It costs NYC, $2,000 to arrest someone. It costs them $500 per night to jail them on Rikers Island.\n\nIf someone is senten… RT @THR: \"The conversations around reparations have been spun.\" @trevornoah breaks down the racial divide in American politics in the debut… RT @TheDailyShow: “America, I feel like I found a fundamental flaw in your democracy: You have no defense against someone just being a dick… One person in this picture works hard in the gym. The other person has an Oscar and the Rock is wearing a cool suit. @ItsRamiMalek @TheRock 📸: @hhgarcia41 #Time100 https://t.co/Tbe11OmIO6 😂🙌🏾  🎥: @JayShettyIW https://t.co/ArCXR1yXHy Thank you to the 13,000 people in Chicago that came out last night and made it so incredible! 🙏🏾 please DM each of your names so I can tag everyone in the video 😂#LoudAndClearTour https://t.co/GaxkZW1VCk Excited to be playing the United Center tonight! See you in a bit Chicago. #LoudAndClearTour https://t.co/TipfrjF5RY Dear @united if I'm telling you that my iPad is at baggage handing because I'm tracking it why are you saying you still need to find it? 🧐 On Thursday we throw it back and it's Crazy Normal! https://t.co/JDyCcXgLQh This is adorable! 🎥: Insta inkaholic__ https://t.co/wDKDWHon8j RT @TheDailyShow: This week on Unsolved Mysteries: White House Edition, what does Ivanka Trump actually do? https://t.co/sYClNvBOlF I stole this pic from @hasanminhaj 🙌🏾  who probably stole it from @mosalah #Time100 https://t.co/I3M68HTQov RT @TheDailyShow: Didn't watch the Marvel movies leading up to Avengers: Endgame? @RoyWoodJr has you covered. https://t.co/ZKIWCKO97j My new podcast “On Second Thought” launches TODAY on #Luminary.\nIf you’re going to tell people you’ve been listening since day one then today is that day. Where are my day ones at? https://t.co/Ykg8yZ9iAb https://t.co/tF5NJGeUBd 😂😂😂😂😂 🙌🏾🎥: @steadywithagoat https://t.co/8hewe85Hxy Live and learn 😂 https://t.co/JalfCiAoN3 RT @roywoodjr: Arts and crafts at my son preschool looking like #GameOfThrones opening credits https://t.co/Q9R5G5MMG7 Happy Easter to everyone who celebrates it! To everyone who doesn’t just enjoy this video of a cute little bunny 🐰 🎥: Insta livslovelylops https://t.co/mLrS4DuzLk Thank you to everyone that came to the show last night 🙏🏾 Let’s do it again tonight Irving, TX! 🙌🏾 #LoudAndClearTour https://t.co/CVwLhxNUWL Mistakes https://t.co/WXiN7CHsG5 Excited to add a handful of summer dates to my #LoudAndClearTour\n\nLas Vegas, NV - Stateline, NV - Santa Rosa, CA - Toledo, OH - Montreal, CAN - Hampton, NH &amp; Bangor, ME!\n\nYou can find tickets here: https://t.co/xqpKJ9oXfI 🙌🏾 https://t.co/shmaMVxtO7 When you get paid Vs when the direct debit hits 😂 🎥 Insta: the_baby_mooch https://t.co/89uMRgQUYh South Africa! My book \"Born A Crime\" has been adapted for young readers. You can find it at your local bookstore. Unless you don't have a local bookstore. In which case you'll need to go to someone else's bookstore. But just know if you shop there it then becomes your bookstore. https://t.co/w0UP73PuDP Just hit 1 Million subs on my Youtube! 🎉 Thank you to everyone who subscribed. If you aren’t a subscriber please don’t try and accept this thank you. Unless however you go subscribe and come back. If that’s the case, thank you for letting me thank you 🙏🏾 https://t.co/JpqoZP7tQ2 Me getting out of a boring conversation 🙌🏾😂\n\n🎥: Insta Erik3run https://t.co/K6gaK0348y RT @TheDailyShow: The Daily Show is up for four #Webbys! Vote below. Come on, you're at work reading Twitter, we know you have time.\n\nVote… Going LIVE in less than 30 mins with @latimes 🙌🏾 https://t.co/jxQqCZtHbg RT @TheEllenShow: I didn’t know I was gonna find out about what @TrevorNoah’s anaconda wants. You're welcome, @NICKIMINAJ. https://t.co/yFa… Today at 3pm 🙌🏾 @TheEllenShow https://t.co/fvHUpTF36X Find someone that looks at you the way I look at Stephen! Tune into @colbertlateshow tonight to find out if we even exchange words. 👀 #FlippedInterview https://t.co/ppPI4sU4Eb Thank you Mass! Such an amazing crowd. 🙌🏾 Next stop... Royal Farms Arena. See you tonight Baltimore, MD! #LoudAndClearTour 📷: @ruminasean https://t.co/XN8DmeW9ws Fact: I don’t like being tickled. Unless however... you happen to be @Oprah. In which case... tickle away. But everyone else, keep your tickle monster hands away from me! 👋🏾 🎥: @ruminasean https://t.co/ranvj9ZlBz RT @Oprah: A little powder, a little conversation, and a lot of @trevornoah! See y’all later tonight on @thedailyshow. https://t.co/0esgTtM… RT @Oprah: My first time doing @thedailyshow and I walked into this surprise from @trevornoah! Tune in tonight at 11 PM. https://t.co/Ve5No… Excited to announce that @randomhousekids have adapted my book for younger readers! IT’S TREVOR NOAH: BORN A CRIME, is out TODAY! You can order it online here: https://t.co/S05nMt5sKS #ItsTrevorNoah https://t.co/TDVlAfnz6x When you hit 4 million followers on the gram! 🙏🏾 🎥: @bleach_media https://t.co/ZxmedvlB54 Me and my squad after we just got fresh haircuts \n\n🎥: @cesarmillan https://t.co/m8irN1aQHE RT @TheDailyShow: The mainstream media won’t report it, but we’re nominated for a bunch of #Webbys!\n\nVote for #BetweenTheScenes: https://t.… RT @Kemi_yondo: Having an African passport means arriving from one place and rushing to the embassy of the next place praying your visa wil… RT @TheDailyShow: Today, we remember the time Obama used a selfie stick, the worst scandal in presidential history. https://t.co/0PFDpjk9AF RT @TheDailyShow: .@BarackObama you seein' this shit https://t.co/kveZ03qDsl Had an amazing time this weekend at the @NAACP Image awards. Big congrats to the entire @TheDailyShow team for winning Outstanding Writing in a Comedy Series. Honored to be apart of it! Suit By: @Ferragamo Photo: @RichFury @GettyImages https://t.co/qI3IIp2Vd1 The highest mountains are the ones worth climbing. RT @TheDailyShow: When you learn German to get closer to your dad, but accidentally get closer to Hitler. #BetweenTheScenes https://t.co/oJ… When Bae wants you to stop looking at your phone! 😂      \n🎥: Insta ChillWildLife https://t.co/FMwrhyjURS RT @TheDailyShow: Meet Pete Buttigieg: a name to remember (and learn how to pronounce). https://t.co/xj6InPYMRy My bucket list is now watching my dude Will Smith check everything off MY bucket list. 😂🙌🏾 https://t.co/U7xZudM6LJ #WillSmithsBucketList https://t.co/6OztzGfwPl RT @TheDailyShow: For anyone confused about reparations. #BetweenTheScenes https://t.co/Tpb7O3qRkl Thank you for such an amazing weekend SC! 🙏🏾 #LoudAndClearTour continues... See you soon MA, MD, TX, &amp; MI 🕺🏾 https://t.co/aMI8UOAY2N RT @ValerieBreiman: THIS JUST HAPPENED LIVE!!! https://t.co/vEYfjtTo7S The crew setting up for tonight’s show at Bon Secours Arena! See you tonight Greenville, SC! 🙌🏾 #LoudAndClearTour https://t.co/lf1MSNS70y Channeling my inner @jtimberlake for some proper Friday feels. See you tonight South Carolina! #BonSecoursArena #LoudAndClearTour \n🎥: @bleach_media \nvid cameo: @roywoodjr 🙌🏾 https://t.co/bEvcx8dBXz AT&amp;T-DIRECTV is about to drop Comedy Central and up to 22 other channels. If that happens, you won’t be able to watch The Daily Show with me! Call 888-250-5557 and tell AT&amp;T-DIRECTV to keep Comedy Central. Go to https://t.co/LZM2HQYIQN for more info. #keepviacom https://t.co/szA9Ys73UE Life really do be like that sometimes 🎥: @kingxaviara I can’t stop watching 😂😂 https://t.co/02RAtK5evz Be Happy. Not because everything is good, but because you can see the good in everything! 🎥: Insta stay_positive_human https://t.co/5nAEPfxnxQ RT @TheDailyShow: So Much @UsMovie, So Little Time: @TrevorNoah &amp; @Lupita_Nyongo talk fan art, casting and Evil Lupita. https://t.co/5YqlVc… South Carolina! I’ll be at the Bon Secours Arena on Fri &amp; the Charleston Coliseum on Sat. 🙌🏾 Hope to see you there. https://t.co/YAB8Dl3SwV #LoudAndClearTour Ft Lauderdale &amp; St Augustine you were amazing! Thank you to everyone that came out! 🙏🏾 See you next weekend South Carolina 🙌🏾 #LoudAndClearTour https://t.co/dAhIk47cMr Happy Birthday to my African brother @joelembiid. For your birthday I'll let you beat me in FIFA!🤗🎂 https://t.co/A7kO7rznmm Montréal, we’re going big for the @justforlaughs Festival this year. July 26th at the Bell Centre. Who’s coming? https://t.co/Hex2lMzjSD #JFLMTL RT @TheDailyShow: Ever wonder who composes CNN’s exhilarating breaking news music? Meet Newsician Franka von Schmidt (@DesiLydic): https://… 93% of people who see this will think I’m an amazing guitar player. The other 17% will know I’m better at fractions. 📸: @PeggySirotaInc @EW https://t.co/AmfFF3Ma8R Happy Monday! https://t.co/UV22ZwvoCL Wow! Born A Crime was released 2 years ago and has made its way back on the NYT best sellers list at #1. This is amazing! Thank you! 🙏🏾 https://t.co/1JRzTunN7Q Happy International Women's Day to all the Mothers, Sisters, Aunts, Daughters and most importantly my Gran.❤️ https://t.co/89JhWmSKdN RT @TheDailyShow: The U.S. ranks shockingly low when it comes to gender equality. @DesiLydic heads overseas to figure out what America is d… On Thursday we throw it back. https://t.co/6k5oUVSKJk RT @sokane1: Trump just called Apple CEO Tim Cook “Tim Apple” https://t.co/gTHHtjWvc9 This is genius and one of the funniest things I've ever watched. https://t.co/jqE9oPb72U I think Solskjaer is one of Alex Ferguson's horcruxes. 😳\n\n#psgvsmun #MUFC #Psg 😂🎥: @cesarmillan https://t.co/ykLBGEyuxD Not gonna lie @colione ’s insane robot camera had me feeling like James Bond. https://t.co/SfufrY2cCQ Boise Idaho, thank you so much for coming to the show with all that potato love. Hopefully next time we'll go night skiing 😜❤️. It's amazing to me that my joke about the conflict in India and Pakistan trended more than the story of the actual conflict itself. Sometimes it seems like people are more offended by the jokes comedians make about an issue than the issue itself. Actually if you watch my stand up you'll see that I did make jokes after my mother was shot in the head. As a comedian I use comedy to process pain and discomfort in my world but I am sorry that this hurt you and others, that's not what I was trying to do. https://t.co/OuVnkHyIfG Every meal is my cheat meal! \n\n📸: @ruminasean https://t.co/dYmaRjAPUU I just started typing “Don’t hate on the vuvuzela” and it auto corrected vuvuzela to cucumber. Which now I feel the strange need to also ask that you not hate on cucumbers!? 😂 https://t.co/xTEMAQbpIE RT @TheDailyShow: \"How many times did you watch Black Panther before you realized Trevor Noah was the voice of the computer?\" https://t.co/… RT @ThatsHowItBdoe: Attempting to battle rap my son... https://t.co/IlXz4dnsFk Watch out @ladygaga and Bradley Cooper. You've got some competition!\n\n#shallow 📸: @ruminasean https://t.co/PueXf6sZeH RT @TheDailyShow: Coming this fall… The story of a poorly staged hate crime that rocked a nation: Jussie’s Lie https://t.co/iGXmETn8m6 Only a day after my birthday and I already feel like I look so much older 😭 📸: @ruminasean https://t.co/KkIU6ROLoI RT @AnandWrites: 🚨@rcbregman, my Dutch brother from another mother and the specter that haunted Davos, causes Tucker Carlson to have a melt… A little throwback for your Thursday. “Cellphones Are Robbing Us” Enjoy! https://t.co/vH502g3h4t RT @TheDailyShow: .@jaboukie has some thoughts on Jussie Smollett: https://t.co/0CJdKHjz6I 😂😂😂   🎥: Cohmedy FB https://t.co/py9sVfFNga Thank you Asheville, NC! Next stops on the #LoudAndClearTour are ID, FL,  &amp; SC! Where else should I go? https://t.co/pmHT7t67Fz Thank you to everyone that came to the shows in Atlanta! 🙏🏾 #LoudAndClearTour continues. Next Stop... US Cellular Center - Asheville, NC 🙌🏾 https://t.co/EkvEcMaQSw About to hit the stage in Atlanta. Getting my game face on. @kevinhart4real am I doing it right? https://t.co/Ivb1QRLL27 😂😂😂😂😂😂 https://t.co/rj9iFScjVv Sometimes you gotta treat yourself ❤️. Happy Valentine’s Day! \n\n📷: @ruminasean https://t.co/bEsc55UXTi Tag your bae who makes you feel like this on Valentine's Day. 🎥 Pom And Pixel https://t.co/xpoyt3XpeD That excitement after finding out we’ve been nominated for 4 NAACP awards- \nOutstanding Talk Series, Outstanding Variety Show, Outstanding Host in a Talk Show/Series, Outstanding Writing in a Comedy Series!\nThank you so much to everyone who's been a part of this journey! 🙌🏽 https://t.co/OoWnSOUOtK RT @FlyAir4: Soooooo..... Johnny Depp is a middle aged Asian woman?! 😳🤯😯 https://t.co/rfoEzuPNPF RT @TheDailyShow: \"Clearly your particular set of skills doesn't include shutting the f**k up.\"\n\nSome thoughts on Liam Neeson. #BetweenTheS… Lil Don &amp; The East Side Boyz https://t.co/bWJF2k3JxS Monday sneaking up on Sunday like... \n🎥 @samblewettgolf 😂😂 This kid’s trickshot is 🔥🔥 https://t.co/sOzmaSvkqO RT @chadwickboseman: What a journey it’s been. Happy birthday, brother. #BlackPantherFam https://t.co/F6hEpTjpId RT @roywoodjr: Never forget ya day ones https://t.co/8w02XbzV1E 😂 https://t.co/pVrqAjCo10 Dear Madison! Thank you for last night. I would stay longer but I’ve got a date with Minneapolis tonight. Don’t act like that...You knew this was how tours work. I couldn’t have been any louder or clearer. Looking forward to the next time! #LoudAndClearTour https://t.co/a2dC8Z0Z0p RT @TheDailyShow: 10 years ago this month: Obama's JacketGate — the worst scandal in presidential history. https://t.co/kJT8QNRYlL Sometimes you’ve just gotta believe it to receive it 😂😂😂 This is adorable!              \n🎥 @SteadyWithAGoat https://t.co/vLO7DhxR0l RT @TheDailyShow: Not the first time Trump has got the clap https://t.co/P3tkj5FTLF The Daily Show’s State of the Union coverage is LIVE right now! https://t.co/Ai5DGGMAKV 😂 https://t.co/17pqgZXzCe 🙌🏽 https://t.co/Ey3XYRiWrC RT @SkyNews: \"The story has been spun. What he's done is tell the truth\" - Former England footballer @officialbarnesy defends Liam Neeson a… If you’re trying to figure out which me is the best dancer... you obviously don’t understand teamwork. When I win, we all win! #GoTeamMe\nI was just as surprised as she was to be apart of this! 😂 thanks for tagging me Duydu Etikan. This made me smile! https://t.co/YCz8SjnJQM Thank you to everyone who came to the shows last night in Cincinnati! 🙏🏾 Tonight is Indianapolis! What other cities should I add to the tour? #LoudAndClearTour https://t.co/Nulby6G8aq I only cried twice watching this video https://t.co/erb8FgerQl RT @TheDailyShow: Trump doesn’t understand climate change and @ronnychieng is sick of explaining this s**t. https://t.co/lJsJZjNz3K https:/… Are you thinking what I’m thinking? 🤔 If you don’t end up like pic 2 then stop thinking whatever you’re thinking and think about what I’m thinking. 🧠 Pic 2 is happy. Be Pic 2 today. Think about it! 😀 https://t.co/Wm4Quz7YvN @Boy75Pony 😂 I'm sorry, I couldn't help myself RT @jaboukie: antivaxxers on here defending themselves like “if my child dies that’s my opinion” RT @TheDailyShow: “I find it funny how Trump has stumbled across many of the things he has ridiculed black people for in America, and he do… #MondayMotivation 🙌🏾 Unless however, it’s already Tuesday where you are... In which case... #IDontKnowWhatToTellYouTuesday 🤷🏾‍♂️ Lauren Bruzzone you’re amazing! thank you for the inspiration. 🙏🏾 https://t.co/uL3g6KoG88 Thank you to everyone who came to the shows last night in Ottawa! 🙏🏾See you tonight Bethlehem, PA! #LoudAndClearTour @ New York, New York https://t.co/G68e3kL3iz RT @TheDailyShow: When you notice that Mike Pence always. talks. like. this. 🔊 https://t.co/K610milDKD That feeling when you have two shows tomorrow night in Ottawa, Canada but then someone shows you the weather forecast! 🥶 TD Arena it’s still on baby! #LoudAndClearTour https://t.co/VosdRt3Rwl When you show up to your wedding but your best man is still at the bachelor party 🤣🤣🤣 https://t.co/p7FGA5jvUX Tampa! Such an amazing crowd. Thank you! 🙏🏾 and to the two lovely ladies in the 2nd pic... you are truly the best! 😀 https://t.co/vvfkrOcdNk Raleigh! If you and your friend are still debating over who I pointed to at the end, here I’ll settle it... It was you! #OkayIDontReallyKnowWhyIPointed #NotPoliteToPoint #ButThePointIs Thank You to everyone who packed out the PNC Arena tonight! 🙏🏾 #LoudAndClearTour https://t.co/1MHufXMn72 What a great start to the tour! Thank you Norfolk, VA. You were electric!⚡️See you tomorrow Raleigh, NC #LoudAndClearTour https://t.co/VdYFNWCFTM And so it begins... My new #LoudAndClearTour kicks off tonight in Norfolk, VA! Now use two of your strongest fingers to zoom in to see where else I’m headed on this super small tour flyer! Tickets at: https://t.co/OCUM8lq7ua https://t.co/XVc8mJV8mj RT @TheDailyShow: #10YearChallenge https://t.co/MYltmIgkE0 Last year, Shelley was our @omaze winner and joined us at The Daily Show set for an interview… and this year it could be YOU! Support my foundation helping vulnerable youth in South Africa and ENTER for your chance to win: https://t.co/PS8S7R5VAc https://t.co/bPAY9QP7mp RT @TheDailyShow: The Daily Show &amp; @DrunkHistory Present: TRUMP HISTORY https://t.co/dS826Ik3KX Toronto! Thank you for 4 incredible cold-out 🥶 sold-out shows. See you next weekend Norfolk, Raleigh, &amp; Tampa! 📷 @GeorgeQJr https://t.co/5prI2Ys0EP This is amazing @paulpogba 🙌🏽🙌🏽🙌🏽🙌🏽 https://t.co/u2W1xSRsqK RT @TheDailyShow: Oh man, once Trump gets his wall he better hope no one shows Mexico this old video we found. https://t.co/FtzeGlmecz RT @BoxingNbt: 😂😂😂 girl in the back stealing Floyd Sr’s private lessons. That’s how you save money https://t.co/zgkCSUapSR RT @Malala: My new book #WeAreDisplaced is a collection of stories from refugee girls around the world - harrowing journeys, lost loved one… RT @idriselba: Er.... https://t.co/tVqHI5EW0Q 😂😂😂😂😂😂 https://t.co/kYDHh8rkOL I was just nervous to come say hi. 😂 https://t.co/DC1i00RduU RT @TheDailyShow: We hear that unearthed dance videos from a decade ago are pretty hot right now. Anyway, all-new Daily Show tonight at 11/… I know we’re gonna fight on this. My picks for FIFA team of the year! #TOTYVote #FIFA19 https://t.co/xUTqSikmRX Happy New Year everybody. 2019 is the year we're going to make the pots!!!🎉🎉🎉🎉🎉 RT @TheDailyShow: .@roywoodjr looks at the racially charged history of “Jingle Bells” and black Santa in this special Christmas episode of… RT @HeerJeet: Reminders: the Republicans currently control all three branches of the government. They're shutting it down on themselves. ht… RT @TheDailyShow: Thoughts and prayers to the Miss Universe contestants who get tougher questions than the president gets on Fox News https… RT @TheDailyShow: Trump's Best Words (2018) https://t.co/nC3bxj23sq Even after being fired, Mourinho has still not left the Manchester United stadium. Apparently he's parked the bus in his office and they can't get him out. Please do yourself a favour. Watch a movie called \"Searching\". One of the most original and thrilling movies I've ever watched! I still need this in my life --&gt; https://t.co/BBZpG5McpA RT @TheDailyShow: Me: these edibles ain't sh*t\n\n(30 minutes later) https://t.co/VMCMTVek9v A squad that plays together, stays together. @AmandaCerny @KingBach @StoneMountain64 unless your apartment lease is up soon &amp; you’re trying to crash on my couch. In which case… we shouldn't stay together. Bad idea. #Battlefield @Battlefield #EAambassador  https://t.co/eWKhwvjzVb https://t.co/BTT2hVXwRX RT @TheDailyShow: Everybody wants a piece of that Oval Office, folks. https://t.co/qh5EqTnA50 Do you guys also hear the ice-cream calling from the fridge or is it just me? Doctor says- \"Trevor you're recovering well, just make sure to stay silent and indoors all weekend\"\n\nWhat I hear- \"Trevor you get to play FIFA 19 non stop and no-one can judge you\" \n\n#silverlining #FutWeekend #fut https://t.co/U75lArqw8w Who wants to get interviewed by me on the set of The Daily Show? I’ll even hook you up with VIP tickets to a taping! It’s all to support my foundation helping vulnerable youth in South Africa. ENTER: https://t.co/WVRMW2j6km https://t.co/CxEkxoF2SE While I was in South Africa I popped into my Grans place to say hi and she was kind enough to let you come with... https://t.co/IcYsWRBz99 RT @TheDailyShow: The Daily Show is in South Africa tonight at 11/10c, but first, a quick walk through Trevor’s hometown of Soweto: https:/… One day we're gonna have to watch an ad before we can answer the phone. 🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽 https://t.co/DvRUGPQ7XP https://t.co/i7fRalhBmH There are 264 million children out of school, denied the freedom that an education affords them. Demand world leaders and donors fund a $40 billion budget gap so that we can #DefeatPoverty. https://t.co/VXLnb5SR1q #globalcitizen RT @roywoodjr: I’ll see your Climate Change Denial and raise you a Disease Denial https://t.co/bCcmpqZpos Very cool😄🙌🏽 https://t.co/ZEik5rJcPj Can someone just add “had his own taco truck” 🌮 to my wikipedia page already? #LivingMyBestLifeNow #NothingSaysAmericaLikeTacos Watch my special “Son Of Patricia” on @Netflix Photo Cred: JerseyAdam &amp; @netflixisajoke https://t.co/pMSX1CAlXe Wow! When I first moved to New York I never dreamed I’d see this... my name with “citizen” underneath! Thanks @realDonaldTrump https://t.co/xmvDAJnOvR Black Friday deal- you can now watch my new comedy special Son Of Patrica for free with any Netflix subscription! Act now because the special is not going anywhere. #SonOfPatricia https://t.co/KKk0OUltxJ Thank you everyone for watching my new comedy special \"Son of Patricia\" on Netflix. If you haven't yet I thank you in advance. And if you don't plan to watch it I thank you for considering watching it. And it you didn't consider it thank you for watching Netflix in general. Aren't you supposed to label sponsored tweets? https://t.co/XKOD5ZfNM4 London is the best place to watch Harry Potter movies because when you walk out into the streets it feels like the movie never ended. RT @OhNoSheTwitnt: Calm down, everyone, Saudi Arabia just murdered a journalist, it’s not like they did anything really evil like kneeling… RT @michelleisawolf: I bet you'd be on my side if I had killed a journalist. #BeBest https://t.co/bZ91Cg0QCr RT @roywoodjr: When ya supervisor walk in &amp; you pretend to be working. #HeGotASupervisorNamedClarence https://t.co/YadJuA5KhY Now Streaming 🙌🏾 #SonOfPatricia @NetflixIsAJoke https://t.co/wrHswJtD5Q I’d be lying if I told you I wasn’t excited about my new comedy special premiering on Netflix tomorrow. I’d also be lying if I told you I don’t still wear this outfit for special occasions. Tomorrow is special. 😉#SonOfPatricia Nov 20th @NetflixIsAJoke https://t.co/AbqMNtjriY RT @KofieYeboah: Never deleting Twitter 😂 https://t.co/GL0pGVlmo4 Want to win VIP tickets to a taping of The Daily Show AND get interviewed by me? Support my foundation to help children in South Africa and ENTER: https://t.co/0NxSts54DO https://t.co/deqfBfm1G8 RT @LeftAtLondon: How to make a Frank Ocean song https://t.co/x8PndMDsay If you told me on my 4th birthday that I would one day have a comedy special on Netflix, I would've immediately yelled “Stranger Danger!” Cause I mean… what kind of creepy time traveler really goes back to a 4 year old’s birthday party? #SonOfPatricia Nov 20th  @NetflixIsAJoke https://t.co/bKFivON7jJ https://t.co/3Mvum7wZit Not gonna lie... things got pretty weird between me and voice over guy. #SonOfPatricia Nov 20th @netflixisajoke #TheresNoDimpleVision #NotADimpleShow #NoSoupForYou https://t.co/bsCMI5pM4e Set a reminder in your head! Or... just set one in your phone. Either way, I appreciate the effort you’re giving this right now. Nov 20th! #SonOfPatricia @NetflixIsAJoke https://t.co/ELxh59WsVy RT @TheDailyShow: Weird flex but ok https://t.co/0aOHiXucjJ https://t.co/qw6fSQW06B @itsgabrielleu 😂😂😂 RT @itsgabrielleu: Gab Union's husband is really making something of himself. #DNoah https://t.co/krQhHOM0lC RT @TheDailyShow: What’s a trip to Florida without a stop at Mar-a-Lago? #TrevorInMiami https://t.co/DAvvFOHIlL RT @TheDailyShow: Happy Halloween from Fox News! https://t.co/QD3gMErlrQ RT @TheDailyShow: Trevor and the team are on the ground in Miami looking fully... prepared. #TrevorInMiami\n\nFull episode: https://t.co/zmgM… The Daily Show is in Miami this week so I decided to pop into Mar-a-Lago. Unfortunately they wouldn't let me in the front luckily there's no wall around the back😄. https://t.co/N0Kg3Qm3OG RT @TheDailyShow: Here’s how Trevor’s 10-year-old brother once explained his mixed family to other kids. #BetweenTheScenes https://t.co/3gK… This is great! https://t.co/4FfVtmAUwZ Halloween is the best day to escape prison because everyone will think it's just your outfit.\n#LifeHack #Halloween RT @TheDailyShow: Wait, did they arrest Trump? https://t.co/ofyjreaila Tune in to @FallonTonight to find out if @brckhmptn is really a couch 🛋 https://t.co/PZQbSDYShS My new standup special “Son Of Patricia” premieres Nov 20th on @NetflixIsAJoke! #TrevorNoah #SonOfPatricia #Netflix https://t.co/DdzC6uf7E1 RT @TheDailyShow: Wait, so the guy running for governor of Georgia is also overseeing the election and state voter registration? That is so… Whenever I catch paparazzi taking pictures of me I always try and make it look interesting. It's fun to see how you can make anything a tabloid story😄. Ticket pre-sale for my new LOUD &amp; CLEAR tour starts right... (wait for it)... NOW! You can find tickets at https://t.co/QGXXAGOlNa Using the code: \"IsThisThingOn\" https://t.co/2QhLX2fQKJ I am excited to see you all on my new, Loud &amp; Clear Tour! Pre-sales start 10/17 at 10am local time.\nGet more info here: https://t.co/0jxtqB8CSE #LoudAndClearTour https://t.co/0bzslkaijQ @JennLahmers @Verse_Converse I don't know who the crazy dude in red is but watching @JennLahmers and @sukanya trying to control him and avoid his offensive jokes was the best 😄 RT @TheDailyShow: Watching Kanye like https://t.co/669gUixN0w @sam_hock @CharlesHock98 That sucks. Good luck Chuck. Make that exam regret getting in the way of your weekend plans! There’s a new FIFA out. Which means it’s time to crown a new King. I challenge @JoelEmbiid to see if he deserves it. Click here to watch the full video --&gt; https://t.co/jqP1iWH4ko &lt;-- #FIFA19 @EASPORTSFIFA https://t.co/YwV8l8rqrq RT @TheDailyShow: Did everyone get this? https://t.co/UurRByPc8l That was fun. #Nationwild has always been about finding showcasing South Africa's brightest young comedy talents from around the country and this show did just that. I'm really excited for Mzansi to discover their new favourite comedians. Exclusive to @showmaxonline https://t.co/eo5YuevMSN RT @TheDailyShow: BREAKING: In response to President Trump's allegations, George Washington has released his calendar from the summer of 17… Pamela why???😂😂😂😂😂 https://t.co/cm6ONbzxEX RT @TheDailyShow: Four years ago today: Obama's Latte Salute — the worst scandal in presidential history. https://t.co/XEK2tQnaQr RT @trumpetcake: Always carry a potato wrapped in foil to a party.\n\nIt's a conversation starter: \"Ever seen a lion's egg?\"\n\nA conversation… @SassyPantsSteph 🙌🏽🙌🏽🙌🏽 I'm on my way RT @TheDailyShow: The year is 2038. White people are no longer calling the cops on innocent black people. Why? @roywoodjr's shadow force, t… You need this browser extension in your life. 🍄🍄🍄 https://t.co/plI7aSzczH RT @TheDailyShow: “Just because you know somebody has been good - they may have been good to you - it doesn’t mean that they were never bad… 😂😂😂😂 https://t.co/TJxjURoIhN RT @nbcsnl: Now presenting… \n\nThe Reparation #Emmys https://t.co/BrBRxazAyI RT @AnnaKendrick47: This was the most fun I’ve had on a talk show. And for the record: we’re kidding around at the beginning - this was Tre… RT @gourdnibler: So dramatic! Dude from the weather channel bracing for his life, as 2 dudes just stroll past. #HurricaneFlorence https://t… RT @TheDweck: Do you know how evil you have to be for a story to come out that you hate blind people and it’s not even in the top five wors… RT @Travon: I hope they cast a black Superman. It would nice for a brotha to finally be faster than a speeding bullet. RT @TheDailyShow: Puerto Rico. Believe the facts? Or #JustDenyIt. https://t.co/159YNegSyq RT @AnnaKendrick47: I got cold so I finally said fuck it and put on a hoodie. It wasn’t until the commercial break, but we still had fun. @… RT @Zupta_Chologist: This is why Bafana Bafana wont win the World Cup 😂 https://t.co/XsNLZDBgqf @jbouie Yes Pro is worth it if you have 4k TV. Get \"God Of War\" then cancel the rest of your life. A great read.👇🏽 https://t.co/0vBPwBXyAN RT @AudreyLinholm: One is “arguing a strike.” One is “having a meltdown.” 7 days apart. #Serena https://t.co/DMwLyKGyqI RT @BillieJeanKing: (2/2) When a woman is emotional, she’s “hysterical” and she’s penalized for it. When a man does the same, he’s “outspok… RT @Squanch_Me: This guy rules https://t.co/TgP1sHycVC RT @TheDailyShow: Kamala Harris brings the 🔥🔥🔥 at Brett Kavanaugh’s Supreme Court confirmation hearing. https://t.co/yS5SMufUdi RT @TheDweck: I’m no HR professional but it’s prob a bad sign when an employee writes an anonymous letter calling you a brain-dead asshole… Be sure to check out @SU2C's live fundraising telecast tomorrow night! It was an honor to work with them as they are doing some pretty amazing things to help the fight! Learn more at https://t.co/c4Ja5XKNDV RT @TheDailyShow: Summarize the outcome of your favorite Special Counsel investigation in one word https://t.co/p3MbKgmGUs RT @larryislegend: This funniest shit I’ve seen all day g. He say this how Eminem raps. https://t.co/9lc8cWA5yd Aloha P.I. https://t.co/gWGtzfACYf What do you do with your weekends? https://t.co/rlZhlkDeSc What was up with that pastors hand? https://t.co/M8Ypgm7fQB RT @danielradosh: So you had hoped to be an anonymous source? Interesting. https://t.co/HMKLPtWqQy @fivefifths Why? Album dropping soon https://t.co/Fl4rhMVuE2 @roywoodjr Whoever has the old iPhone with the headphone jack. RT @joshchafetz: Guys, this is BAD. When we allow public servants to forego a salary, that raises the expectation that they will. And that,… Yo Sydney! You rocked my world over the last two nights. Thank you so much for an amazing end to my Australian tour. I had such a great time. #TrevInAus @_rachelwang 😄🙌🏽 hilarious @teammscedillo That means so much to me. Thank you🤗 @ElaineWelteroth No I understand. That's why I pre pee all my pants to avoid embarrassment. @Lamborghini @CNBC @jayleno @LenosGarage Next time we do the Urus! 🔥🔥🔥 @wacoustaguy Wow. That's really amazing to hear. Thank you for that.🤗 RT @Ngongang: 😞 if there was a black father in the home when they were young, they could've avoided this life of deviance and crime... http… There are few things I enjoy more than crying on an airplane. Almost any movie can bring me to tears and it's always the happy endings. This time it was when the gorilla smiles with @TheRock at the end of rampage- I cried like that gorilla was my son. 😭 South Africa! I’ll be back Dec 2nd, hosting the Global Citizen Festival: Mandela 100! Check out the full lineup for #GlobalCitizenFestivalSA &amp; learn how you can join thousands of activists by earning free tickets &gt;&gt; https://t.co/aW8CijC2Xe https://t.co/SKQy72dS58 RT @ronnychieng: We got the number 1 movie in the world right now! Thank you for everyone who showed up in the theaters to watch us. @Crazy… Run Forrest run... https://t.co/hMggp19UQ1 RT @roywoodjr: This means nothing to ya'll, but today is the 15 year anniversary of the time myself and another radio DJ accidentally playe… RT @roywoodjr: Omarosa walked into them White House meetings like... https://t.co/SdDs0BJech It's #WorldHumanitarianDay! Let’s support people affected by Natural Disasters with #CallForCode and use technology for good. You can help @UNHumanRights &amp; @RedCross in their efforts to help the most vulnerable among us. To get involved, visit: https://t.co/h1RYbOLLNF https://t.co/2TLCBlTfW6 RT @kimmythepooh: You’re 8 years old.\nYour 3rd grade class orders chinese food &amp; your father delivers it. You are so excited to see your po… RT @TheDailyShow: Trevor remembers the life and music of Aretha Franklin. #BetweenTheScenes https://t.co/qsz7dwoVdm RT @TheDailyShow: Is there a tape of Trump saying the N-word? If it surfaces, will there even be consequences? @roywoodjr breaks it down: h… RT @camillarz_: here’s a video of my cat trying to get my dog’s tail through a glass door. it will brighten your day https://t.co/jIFibL0cPP The good old days! https://t.co/aajmEo1AD0 Beth thank you and everyone else who made this mad show magic. I've never performed in the rain and I hope I'll never have to again 😂.\nThank you NYC! https://t.co/TfeloFIkwl I drove it like I stole it!😄 https://t.co/wuu80hJCKM Here's my interview with deadline about everything. https://t.co/85LsXOQuqP RT @Rawshaud: ARE WE GOING TO IGNORE THE FACT THAT RAY J’s HAT MOVED LIKED 2,000 TIMES IN LIKE 10 SECONDS!!!! 😂😂🤣 https://t.co/IcoAPmAv2q RT @BambiThePhoenix: this really made me laugh. I love y’all https://t.co/iYLz4nrNO4 RT @TheDailyShow: Those who ignore history are doomed to retweet it. #DailyShowTrumpBook\n\nhttps://t.co/6P4oKDNXo1 https://t.co/w7VYDCHXsS Do you ever dream of candy coated raindrops? @BrennaSimonSays Super cute but the border collie kills it with the turn around move. RT @_mennafathii: Mom and Son Goals ♥️😂😂 #KekeChallenge https://t.co/8MwxTwCfpx @jaketapper @danielradosh Fake news! RT @Travon: Finding out Ronan Farrow is writing about you is like finding out Omar is looking for you on The Wire. It won't end well. RT @thegreatkhalid: The power of music is crazy. I was walking around Bali and then this happened https://t.co/Gou9gguAg1 RT @sarahmcgbeauty: I saw this news article about Brad Pitt and now I can't stop thinking about it. https://t.co/OytJQD5rli Here's the story of the first time I heard a joke and thought... yeah I wanna do that thing! https://t.co/kNo0GY07AD #RestInPower https://t.co/KwYfvROAAf RT @TheDailyShow: COMING SOON: The definitive analysis of the 45th (and final) president's tweets. \"The Daily Show Presents: The Donald J.… RT @OhNoSheTwitnt: A man threatened a foreign power on Twitter in all caps because he was in a bad mood, but please tell me more about how… @joewilliams_tew @IndigenousX I'd love to visit another community in Oz Joe. Always open to learning more 🙏🏽 RT @_beardus: Benzema: ‘When I score I’m French, when I don’t I’m an Arab’\n\nLukaku: ‘When things were going well, I was Lukaku the Belgian… “I am German when we win, but I’m an immigrant when we lose.” 💔 https://t.co/2fAApPUOim RT @OhNoSheTwitnt: On your first day of a new job, walk up to the toughest looking guy there and start breastfeeding a baby in front of him… @AnitaHeiss @joewilliams_tew you're right. After visiting Australia's Bunjilaka museum and learning about aboriginal history first hand I vowed never to make a joke like that again. And I haven't. I'll make sure the clip from 2013 is not promoted in any way. RT @laurajaylovette: Can you imagine how awkward it would be if your pet went on your phone and found the 1000s of pictures you have of the… RT @TayZonday: Being poor now just leads to being more poor later. Can't pay to clean your teeth? Next year, pay for a root canal. Can't pa… RT @EveForster: This gets funnier and funnier the more I watch it https://t.co/5WpD92WT3u When I say they're African, I’m not saying it as a way to exclude them from their Frenchness. I’m saying it to include them in my Africanness. https://t.co/8RW4Rvt7m6 RT @TheDailyShow: This is what happens when you put a KGB agent up against a KFC agent. https://t.co/dcDmKzyzF0 I just watched the movie \"Sorry To Bother You\". It's one of the most engaging, challenging, entertaining, scary, funny, insane movies I've ever watched!!! Please go watch it you won't be disappointed. RT @junathaenw22: Y’all please help me make little man go viral! https://t.co/5Qkcj72C5E So Fortnite is basically Hunger Games? Wow, I visited Russia for 3 days and now The Daily Show is nominated for 3 Emmys. Next time I should stay for a week and then run for president 😄\n\nTo all the people who voted for us and to all who watch our show I could not be more grateful. Spasibo 🙌🏽\n#Emmys Thank you to everyone that came to the shows last night. The people in the pic are actually in line for hotdogs next door. But I get it, they’re delicious. 🌭😜 https://t.co/mbYVeNgG8I @ClintSmithIII Every country bribes to win the world cup😄 RT @joepenney: Why I’m supporting France: https://t.co/rJpVg10dPg RT @mbowzay: Africans: We supporting France cause they’re just another African Team\n\nWorld: Haha no they’re not\n\nFrench National Team: http… This is such an amazing answer. Sounds like something Goku would say 🔥 https://t.co/c9h8dSZwiZ I don't understand VAR ¯\\_(ツ)_/¯ Trump: “goodbye scott, thanks for everything” *pruitt leaves, trump checks his wallet and finds it’s gone* And did it work? Don't leave us hanging... https://t.co/8JgKayPjva Cristiano Ronaldo also moving to Golden State 🙈. Brazilian coach- \"We need someone who can blind our opponents with his teeth.\"\n\nFirmino- \"Put me in coach\"\n#BrazilvsMexico #WorldCup Note to self- don't fire your coach days below the world cup. This is England's best chance to reach the finals. Sergio Ramos' haircut looks like the goalkeeper has been trying to line him up between attacks. Soccer players are like babies. When they fall, just ignore them and they'll carry on like nothing happened. RT @lkigai_: Saudi Arabia gave women permission to drive and this is the first thing they do 😭 https://t.co/yYbiPthgrg RT @terrycrews: Why didn’t you say something? \n\nI did.\n\nWhy didn’t you push him off?\n\nI did.\n\nWhy didn’t you cuss him out?\n\nI did.\n\nWhy did… RT @TheDailyShow: RIP \"lit.\" Also, America. https://t.co/vLsf4KJXbJ 🤔🤔🤔 https://t.co/FyvAlGss6L RT @TheDailyShow: Sarah Huckabee Sanders’s farm-to-table-to-sidewalk meal is the latest incident in a string of Trumpers getting the cold s… Twinsies! https://t.co/Y7KQbPJwiT RT @TheDailyShow: Tonight's piece on the border crisis and the all too familiar excuses we’ve heard from the administration: https://t.co/v… RT @realjeffreyross: In the interest of sharing information and spreading awareness @ComedyCentral is offering my Mexican border roast docu… RT @TheDailyShow: “I never thought I would hear a positive spin on detaining children. ‘After all, what is a chain-link fence, if not a wal… 🙌🏽 https://t.co/vh0GGnyN2r Happy Father's Day to my mom and all the single moms out there, who for whatever reason had to hold it down twice as hard. You deserve a celebration everyday. 🙌🏽❤️ @haydenaudette51 @power_moves0nly @ArcanaXV @mattgibson27 Yo thanks for that Hayden. You learn something new everyday! RT @TheeReal6: I was at my cousin game and this happened 😂😂 https://t.co/3gQ9ZKr9io The downside- I'm gonna have to watch Alex Jones now. \n\nThe upside- Klepper is back in the field! The streets aren't ready🙌🏽🙌🏽🙌🏽 https://t.co/o3qbQDC5pD Portugal is Ronaldo's Cavaliers Mission Accomplished! 🙌🏽🙌🏽 https://t.co/ZK7ek1yGsV RT @roywoodjr: It's 2018 and Trump &amp; Kim out here still dressing like they got scooped up in the '03 draft. #TrumpKimSummit https://t.co/s0… Oslo I had the most amazing time with you tonight. From now on I hope all my shows have people from places like Norway😉\nTusen takk, see you next time. This deserves an Oscar! 😂😂😂😂😂😂 https://t.co/QnEUeDV57y Thank you to everyone who joined me tonight in Copenhagen. This was my second visit to Denmark and I'm loving it more each time. Now let's go enjoy the midnight sunset😄 @roywoodjr @ronnychieng Again I disagree. Roasting is the order of the day in wakanda. And because everyone is prosperous there's no \"punching down\". @roywoodjr I disagree Roy, the Jabari probably laugh the hardest but not at English jokes. Jabari Comedians switch between languages during their sets and and they crush the hardest all over wakanda. RT @itsgabrielleu: Today’s #WCW goes out to Kelly Marie Tran. While I don’t know her, I FEEL her. She was recently driven off of social med… RT @ZERTZ_86: This can’t be serious.... Praying before games with my teammates, well before the anthem, is being used for your propaganda?!… 12 hrs ago in the news.\n\"Just out\" on Hannity. https://t.co/DwZKaG8pw7 RT @roywoodjr: In Houston in 2006, I tried to prank call J. Prince, CEO of Rap-A-Lot Records. We had a conversation that made me not only l… RT @LenaWaithe: “We’re sold out of spicy chicken we only got mild”\n\n https://t.co/mfglrySOtz RT @TheDailyShow: We got a hold of Starbucks’s racial bias training video: https://t.co/ePXy5Qqtzr Black Panther? https://t.co/89WsRaKzWS And others?😂 https://t.co/zswxSRFwyO https://t.co/LjGiD5Tmgc RT @hankgreen: Have you ever noticed how people who are very cool and right about some things are also wrong about other things? It's almos… RT @MatthewACherry: After your dog sits on your lap when you're wearing black pants https://t.co/cr3SYe9RfV Journey with me into President Trump’s complicated and deeply unsettling inner life. https://t.co/wg2kN5LAmA @eMsylf Thank you. I had fun with the devs and the rest of the dice team. Finally @Battlefield V has launched! Check out the reveal trailer here https://t.co/n9xvZavPSQ.\n\n#Battlefield @Battlefield \n#ad RT @KWestSavali: I have ancestors who built it. https://t.co/oc3UFESbzo Saturday night's show at @TheO2 London was amazing! Here's a clip for everyone that waited too long to get tickets and had to sit at home instead. I still love you. https://t.co/HzhWCVNUfA There's no way Radja Nainggolan was left out of the Belgium squad for tactical reasons. The coach doesn't like his personality or what he brings off the pitch and clearly he doesn't play FIFA. Radja is a beast! Are you implying Kate isn't classy? Not cool. https://t.co/6l4XCGwggT This is a great idea. Without doors no shooter would ever get in!🙌🏽 https://t.co/u9Dr7m82F1 RT @Travon: Wait a minute...🤔🤔🤔 https://t.co/WW9HnUvX0i RT @Lin_Manuel: Gmorning.\nYour worst fears about yourself only needs a drop of attention and sunlight to grow quick and wreck your whole sh… I refuse to believe this woman has never done this before- her technique is phenomenal!\nhttps://t.co/IXcW5x3oDQ This is so dope, a fully customizable Xbox controller for people with physical disabilities. 🙌🏽 https://t.co/v3Jq5NGU2S #ad The rumors are true (rumors that I started, but still...) I will be hosting the @Battlefield Live Reveal on Wed, May 23rd. Catch it streaming live on the #Battlefield YouTube.  V EXCITING! https://t.co/7B3fpTpQ6x RT @ImranGarda: For many ginger boys, Prince Harry’s engagement to a stunner offers ‘hope’ https://t.co/RF0loXgjhR Kansas City and St Louis were amazing this weekend. I appreciate you all for coming to the shows. Thank you. https://t.co/6sCdDXEon3 RT @IamKrisLondon: WHY BRO WHYYY 😭 https://t.co/CJ18ix5qSU RT @TheDailyShow: Finally, a 9-1-1 operator who can deal with white people’s emergencies: https://t.co/nPfqSoS2CX https://t.co/zieaYOo8K7 @dianeguerrero__ @TheDailyShow Thank you for sharing your story, you left everyone inspired! RT @Balmain: At the #METGALA, @Trevornoah in a custom-made Balmain tuxedo. The design is being auctioned off to support @RED's fight agains… #BlackExcellence https://t.co/aNOTv72sFa What if we find out that's not Donald Glover it's actually Lil Dicky? RT @christinaroto: my mom put oil on her bird feeder to keep squirrels from stealing the bird food and https://t.co/TkrmOR4KlH RT @muftidank: *white person cooks ethnic food*\n\nimmigrant generation: oh that's nice they like our culture \n\nfirst generation: die a thous… \"The underground railroad would have been a lot more effective if it wasn't for the F train\" - Harriet Tubman RT @TheDailyShow: Here’s tonight’s piece on the leak of Robert Mueller’s questions for Trump: https://t.co/3nE3rlBHIS RT @brdeprima: This checks out. https://t.co/zfiWSrvWWr Bloomington was so dope! Thank you everyone for coming out! https://t.co/CMjFEyJ7ob RT @HeerJeet: Thanks to Trump, conservatives now hate football and the FBI while they love rap music and talking to North Korea. That's a m… RT @oranicuhh: A letter to Kanye Omari West. Over his own beat. 🤮 https://t.co/5xdxKJ7d4l RT @TheDailyShow: When grandpa's telling the same stories again and you can't get him off the phone https://t.co/GfCAfksEJJ RT @beyzanurapaydin: i know it's too soon but this can be the best thing i've ever made https://t.co/9ewjXJEz8W RT @roywoodjr: \"Black People, we have your rapper. If you want him returned, Send $100K in unmarked bills, potato salad WITH RAISINS and a… RT @TheDailyShow: https://t.co/ndxOpuzbcU Such a beautiful article on a phenomenal artist. https://t.co/uxK5cuY7Fb RT @TheDailyShow: Jaws (1975) https://t.co/zkNU9eEXt9 She called Barry with the good hair... https://t.co/GFrvL9ZA6c @Lupita_Nyongo ❤️😭\n\nhttps://t.co/k6Hd1CrOhR RT @TheDailyShow: DO NOT CONGRATULATE: #BetweenTheScenes is nominated for a Webby Award!\n\nVote: https://t.co/040WIbE14V RT @THR: .@TiffanyHaddish will host her first main stage gala at Just For Laughs on July 28, while #TheDailyShow host @Trevornoah will host… RT @kanyewest: often people working with the existing consciousness are jealous of those who are more in touch and they become hard-core ca… Thank you Bill. You handle malaria I'll figure out schools. 😄 https://t.co/MoDJi9mGtF RT @BuzzFeed: You won't believe what Obama says in this video 😉 https://t.co/n2KloCdF2G Phoenix and Tuscon, thank you for bringing that Arizona heat to the shows this weekend, I had a great time with y'all! \n🔥🔥🔥 😳 https://t.co/LsmPYCeFIF Thank you to the New Nation school and all who attended the launch of the Trevor Noah Foundation. My dream for many years has been to help underprivileged children get the education they deserve and with this initiative we're taking the first steps. #Grateful I'm so grateful to every person who took the time to listen to my audio book. A year later and we're still on the bestseller list. Thank you! https://t.co/pFOgulgjE6 RT @preshgaza: I no longer take offence when people leave me on blue tick. \n\nEither they  are genuinely busy and hardly have time for chit… RT @DanAmira: If you use a dollar sign you don't need to also write the word \"dollars.\" The dollar sign means dollars. https://t.co/frwhT8N… RT @roywoodjr: So y’all couldn’t wait to post this after I got outta town safely? Aiight den @TrevorNoah https://t.co/GkS8nihs5c RT @StenderWorld: Exhibit A: a serial bombing terrorist.\nExhibit B: an innocent child.\n\nThis is not objectivity. The @nytimes is in the bus… @petermdennis 😄 that joke was for the both of us! RT @roywoodjr: Dear Hollywood, stop shows us the entire film in the trailers then have the audacity to wonder why people don't go to the mo… RT @TheDailyShow: Sam Nunberg's media blitz brings back painful childhood memories for Trevor. #BetweenTheScenes https://t.co/oJtKo0xk2M @TheKevinLalka @TheDailyShow Real robot, real fight to the death! Yo Denver. Last night's shows were so much fun. Thank you for joining me and also for bringing all your weed. RT @Oprah: This time Trevor is the one asking the big questions! Catch my #SuperSoulConversations with @TrevorNoah, @JordanPeele, and @Salm… RT @chadwickboseman: Wrapping up our  #BlackPanther tour with @Trevornoah, @TheDailyShow and a few new friends tonight! #WakandaForever htt… Blue steel! https://t.co/jaeCDX4jfN RT @dodo: This puppy doesn't know \"sit\" yet, but his older brother has the CUTEST way of teaching him ❤️ https://t.co/5DBWJTmQCG RT @helenhousandi: I've watched this GIF at least 100 times now, cry-laughing the entire time. https://t.co/Hih7VJe28T RT @anthonyjeselnik: \"Stay out of politics\" just means \"don't speak against my politics.\"  I don't care about you.  Any of you.  Or your be… RT @tressiemcphd: I think the answer is, \"they don't need access to those giving political non-answers to keep a job.\" https://t.co/ur3i9Zg… I'm in heaven! https://t.co/wLK81WsIoo I don't care what the people say, he will always be the President of jokes. Farewell Jacob Zuma. Watch the FULL video here: https://t.co/S5a7x63VlC https://t.co/Dr3ZPo94mL RT @longlivekcx: Many of us have been attending funerals everyday since Friday. Having to see our friends in caskets is the reason why we a… Please don't remind me, I'm still in mourning. https://t.co/qyuNyvPs80 RT @Lupita_Nyongo: A gift to be back in the motherland to bring #BlackPanther here for the South African Premiere. The joy, love and excite… While others just talk Trump is actually doing something! 🙌🏽 https://t.co/VTKJyW2Tit 😂😂😂😂😂😂 https://t.co/pOccCpE1SS Why are you exposing my side hustle!!! https://t.co/NFkkt6jUs1 RT @umtitisputa: Three types of people in this world. https://t.co/57wQ0qfOp2 The trailers for Black Panther don't even begin to do the movie justice. This is easily one of the best Marvel films I've ever seen. \n#BlackPanther I don't know why everyone is freaked out by this video. All I see is robot being a gentleman!\n#chivalry #BlackMirror https://t.co/aHcvLCDAnV RT @Anele: Guys. South Africans are the funniest people in the world https://t.co/PSFoNVGgsL I feel like last night was the first night of my life! Phenomenal performance and an amazing vibe. 🇹🇹🙌🏽🙌🏽🙌🏽 https://t.co/mDYWAiUVw5 RT @steveaoki: #aokijump #864. The Aoki x @TrevorNoah #TheDailyShow Jump. NYC. February 8, 2018. https://t.co/XZ6yr4ud9n Look under your seat... It's a dream come true!!!\n\nOprah at the Apollo” airs Tuesday Feb 27 at… https://t.co/rHdV0Vhp7p @SocialB33 Happy Birthday 🙌🏽🙌🏽 @xarkos @TheDailyShow Almost like it's groundhog day 😉 RT @TheDailyShow: Dear Leader Trump's Glorious Military Parade Announced On State TV https://t.co/tJAlvPlLAT RT @TheDailyShow: Did somebody say \"military parade\"? https://t.co/37zm1MPPNg RT @mic: After a year dominated by talk of Confederate monuments, Mic imagines a country where black monuments bloom in every state. @kerry… That Scientology ad was the best! RT @roywoodjr: Wait a min... all this time Dr. King was trying to get us to buy a truck? #SuperBowl https://t.co/tZIz8tc2nc RT @llcoolj: I’d like to thank  all of you !!!especially @roywoodjr and @TheDailyShow for this recognition!!😂😂😂😂😂 https://t.co/K4ZqvfxthG And is now hired by CNN? https://t.co/hnWM6ljF42 CNN STOP SPAMMING MY PHONE!!!\nAm I the only person who can't turn this Hawaii story notification off??? RT @Lupita_Nyongo: Purple Reign. #BlackPanther #WelcomeToWakanda\n\nCustom gown &amp; clutch: @Versace\nShoes: @giuseppezanotti\nJewels: @BeladoraJ… SZA💔 I'm joining Oprah😫 https://t.co/MKuhzJQOtG Last night's shows in South Florida were on fire! Thank you to everyone who came to Hard Rock Seminole I had such a great time with you. Next stop, Orlando ✈️🎤💃🏽 RT @TheDweck: There is no better metaphor for being a woman right now than wanting a female president and getting a female fast-food chicke… Thank you for having me.💜 https://t.co/MNAAnqruMj Yo @jimmyfallon and @theroots when are we hitting the studio to record chain migration? The streets are loving it!\n#ChainMigrationRemix Thank you to the people of Santa Barbara for sharing your amazing stories and humanity with me tonight. It was an honour sharing laughter with your tonight. #SbStrong Give me your tired, your poor,\nYour huddled masses yearning to breathe free...as long as they're… https://t.co/ycV0INwyKp So you can't be American and Hispanic? Also, funny to see anti immigrant arguments from a Canadian immigrant  😑 https://t.co/af2pnp1DsK Don't get too drunk😄 https://t.co/vUGicTnaFr Just waiting for the last people to come in then we kick this show off. Happy Birthday! https://t.co/G7NrCE42nJ We've come a long way and I couldn't have done it without fans like you. Thank you. https://t.co/BRKTStM2MX I love ice cream so much that I try to get dumped. Wow. Cleveland was amazing tonight thank you for being so fantastic. 🙌🏽 RT @BNicholsLiberty: Scary marijuana stats:\n\n1. 88,000 deaths are annually attributed to excessive use. \n\n2. Every day, 30 people in the US… Thank you Pittsburgh for being my first stand up shows of the 2018. I had so much fun with you in the cold 🤗 Bruno Mars and Cardi B just took me back to all of my favourite childhood memories at the same time! So good.\n#FinesseVideo #finesse What an honour to be fake considered along with @StephenAtHome @iamsambee for the fakest media awards. #TheFakies https://t.co/gFuYsOqmjn RT @TheDailyShow: At least he thinks we'll make it to Monday https://t.co/0YFdMlj0Xs @FIFAUTeam what's the point of chemistry if everyone pauses before the game and substitutes and changes formation to anything?! Luckily it's a lifetime appointment so he'll have time to learn.🙈 https://t.co/LJrDMHSjvT RT @jonrog1: 1/ Okay, you racist hack, apparently I have to do this every time. Like all conspiracy theories, this falls apart as soon as o… Countdown to the tweets... Merry Christmas!😂😂😂 https://t.co/RBCvQULoYB RT @TheDailyShow: We're all ok in NYC thanks for asking! https://t.co/ERFd4fabAM RT @jaketapper: Thought experiment for some of you this week: Have a higher standard of behavior for your public officials than you do for… Oh what a night https://t.co/q6FxGzY9Bx RT @TheDailyShow: Trump’s Best Words of 2017 https://t.co/jHeHQ7RNmd Are you gonna watch the show so you can answer your own question?\nAnd ps I'm from Soweto not Hollywood. 😄 https://t.co/mCKlYm0bpU RT @maggieNYT: For the “why don’t people report harassment/assault in real time” file https://t.co/2SKR69UlLK RT @Filth800: so last summer i randomly met this 80 y/o woman on words with friends. we played 300+ games together and she actually ended u… Four shows. Two nights. Seattle is already such a blast! Thank you. https://t.co/8M24ni8YEV RT @TheDailyShow: Curl up and enjoy the Mike Flynn \"Lock Her Up\" Yule Log, just in time for the holiday season! https://t.co/YuAv83cbsp @deevaastar 😂😂😂 it wasn't personal. I just panicked. Wow. This is just wow. https://t.co/hK0QrvCKVp RT @OhNoSheTwitnt: Can’t wait to hear Sarah Huckabee Sanders klansplain why the president retweeted a bunch of anti-Muslim videos from a ra… 🤔 these two stories are linked how? https://t.co/CsjyJApHwu Loved this conversation. Thank you for visiting the show! https://t.co/kWinEd6du0 RT @emilynussbaum: Perfect parody of the NYT Nazi profile. https://t.co/J9gaL6Otmg https://t.co/kGwUUOCDVb RT @SeanMcElwee: image 1: nyt profile of neo-nazi\nimage 2: nyt profile of unarmed man executed by police https://t.co/8RWOTtmuTo San Francisco was fire tonight! Two shows  at the Masonic And both were electric. Let's do it again tomorrow night people. Thank you🔥🔥🔥🙌🏽🙌🏽 Coco is one of the most beautiful movies I've ever watched. I laughed and cried and left the cinema smiling. Such a joy❤️ Play golf quickly 😂 https://t.co/OZaUoFQ6ah RT @lincolnablades: In my latest for @TeenVogue I argue that our national focus on sexual assault must include abuse by cops. Not only is i… @fivefifths Farewell my friend. I'm gonna miss your writing. RT @EricPaulLeue: 1970s gay teachers? they'll molest kids!\n1980s gays in your home? they'll molest kids!\n1990s gays adopting? they'll moles… RT @nowthisnews: Body cam footage caught police planting cocaine on a Black suspect https://t.co/Wv7zNazmuk Every time...\n\n https://t.co/bwJ0uAiXxg Yo Minneapolis, thank you so much for two magical shows tonight! RT @TheDailyShow: BREAKING: New development in the Trump water scandal. #Waterghazi https://t.co/VXGj22g2nr Greatest tweet of all time. https://t.co/dUwXCxLOGG Thank you Houston for one of the most amazing shows ever. I had so much fun with you. https://t.co/DxT107umJI My friend @johnlegend co-founded @WeareLRNG Innovators. Proud to see it touching the lives of students across the country https://t.co/6wlQLYpyRt #RedesignLRNG RT @wkamaubell: All men need to do better. Some men just need to do more better than others. But all men can do better. We can stop encoura… RT @Mikel_Jollett: Guns are not allowed in the U.S. Capitol and every congressman has Obamacare...in case you're wondering how these people… This should be a parody news headline, not real life! https://t.co/6r4sOCKei0 @Helga435 Someone will pay for this mistake. Thank you for your vigilance! Dark was always their aim... https://t.co/cAMfJbo8OM Columbus Ohio was beautiful tonight. Thank you everyone who came out, both shows were amazing. RT @itsgabrielleu: One of my favorite interviews of my career!! #WereGonnaNeedMoreWine https://t.co/eIqyFk3ZeJ RT @JamilSmith: I disagree. He’s revealing us. We talk so much about how shocking totalitarianism would be, but millions of Americans are l… Europe, what are you doing in May? London 19th: https://t.co/OPlnyImzaN Amsterdam 20th: https://t.co/08qYVOtqk5 Who's coming? https://t.co/HjVA4ZbcwU RT @70Ceeks: y'all, i apologize. i got so excited to do racism that i slipped up and did a dang perjury! https://t.co/sl04VNuTeG Drain The Swamp 2- Road Trip https://t.co/GGh3KzqQaz The girl wants to have no name... https://t.co/Fdb9KxPzVD Watch my episode of #TheConfessional on #YouTube360 or in VR on Google #Daydream.\n@felixandpaul @justforlaughs https://t.co/hM59ShGa7V https://t.co/Zrh7ZhJrFC RT @Molly_Kats: Imagine thinking you’re the master race when your head is too fat for a nazi cosplay helmet https://t.co/pqpLndCqN5 RT @JohnJHarwood: it did happen.\n\n2014 Q2/Q3: 4.6%/5.2%\n\nwhich actually is higher than:\n\n2017 Q2/Q3: 3.1%/3.0%\n\nmagic https://t.co/TKlKQE24… This is so well made. https://t.co/vPfvkINuaG RT @Anthony: Let’s talk about the alleged victims of @realDonaldTrump’s sexual assault, harassment and rape. /1 RT @RalphNortham: I served 8 years in the Army, took care of sick kids, and am running to build a more inclusive Virginia. Don't talk to me… RT @GretchenCarlson: Nobody pays $32m for false allegations - nobody https://t.co/qB3njcHHuy Having such an amazing time in Chicago. Two great shows tonight and I'm excited for two more… https://t.co/RtZKmUunvz RT @TheDailyShow: How does a simple question to Trump about Niger turn into \"WE'RE IN A FIGHT WITH A BLACK LADY IN A COWBOY HAT AND WE NEED… https://t.co/8xwxgBAC15 They will never forget your kindness. 🙌🏽 https://t.co/rucsTAIU3G RT @jaketapper: \"Low\" would be sexually harassing staffers and then getting fired for it -- humiliated in front of the world. Now THAT woul… Tonight! https://t.co/4CdK86LZv7 RT @TheDailyShow: Squad's ready for #DailyShowChicago week! https://t.co/n1pqxxu92h RT @itsgabrielleu: Reminder. I got raped at work at a Payless shoe store. I had on a long tunic &amp; leggings so miss me w/ \"dress modestly\" s… RT @MeghanMcCain: Trump slammed my dads service when both of my brothers were (and still are) currently serving. Give me a break with this.… This is just heartbreaking. https://t.co/JSxX69ffqj Spectrum is about to drop Comedy Central. You’ll lose The Daily Show! Please Call 888-250-5557, tell Spectrum to keep Viacom🙏🏽\n#keepviacom Tonight @UMBC was mind blowingly amazing. Wow what a great night. Thank you Retrievers!!!🔥🙌🏽 RT @TheDailyShow: Trump claims he met with the president of the U.S. Virgin Islands, signaling a major breakthrough in human cloning techno… RT @TheDweck: As the father of 25 daughters, I'm starting to think women might actually be people What???😳 I didn't know you played basketball!!!\n\n😄congrats my friend and thank you for being yourself. https://t.co/ynmgd2yri2 I wish Trump would be quiet just long enough for everyone to focus on what's happening to homes in California. https://t.co/7ARy4ORo9o RT @TheDailyShow: Trump vs Tillerson. The Moron Fight. Only $89.95 on Comedy Central. https://t.co/FCilW3sCJA Thank you for making me laugh so hard Andy. You made my day! https://t.co/ZUuf3UMFlm Lincoln Nebraska, Hamilton Ohio and Greenville South Carolina. Thank you for making this one of the most fun weekends ever. 🙌🏽 RT @TheDweck: Trump: You're really hurting our budget, Puerto Rico!\n\nalso Trump: Mike, fly to Indiana for 2 seconds to show how much you ha… The number of replies to this tweet is insane. As men we have to do better to stop this. https://t.co/bpgZs4P2FL @AVoiceofReason 😄nicely played You say \"we\" made no mention but in the article you wrote that The Daily Show mentioned it?🤔 https://t.co/j1otTMoUEw Actually he killed himself. The miracle is that he was allowed to buy 42 guns and countless ammunition. https://t.co/DIr5PkHytn RT @Travon: To speed this up a bit:\nLone wolf \nNot terrorism\nThoughts and prayers \nNo gun restrictions\narm more people\nNow back to tax refo… Nashville! Tonight at the Ryman was transcendent. Thank you again for having me. Next stop Broadway!🎤🕺🏻🍻🤠👢 The only thing you should be focusing on is the fact that Puerto Rico is on its knees. https://t.co/uoTvteEeEr LA, you were quick to get tickets for my Jan 20th show, so here's a 2nd show for your slower ticket getting friends!🤣https://t.co/M7ztuJ50yk https://t.co/L906RaqPJn Charlotte, NC... you’re moving a bit faster than I remember, but I like it! 😉 Let’s add a 2nd show - Feb 24th https://t.co/Cw2JXX13aL Thank you Memphis! What a night🙌🏽🎉🎤 RT @nowthisnews: NBA coaching legend Gregg Popovich has a perfect take on white privilege that you need to hear https://t.co/G1pbwD22Lg RT @KingJames: U bum @StephenCurry30 already said he ain't going! So therefore ain't no invite. Going to White House was a great honor unti… \"You're not breaking up with me, I'm breaking up with you!\" https://t.co/6yCy4F9S4V RT @BillGates: I got to play host to @Trevornoah earlier in the week. Last night, it was my turn on the hot seat on @TheDailyShow: https://… Don't act like you've ever seen @shakira rapping Wu Tang before. Click the link and enjoy. https://t.co/UnWvAUyhHn RT @JuddLegum: JIMMY KIMMEL IS NOT AN EXPERT scream the people who let Hannity talk about public policy for an hour every night My dream of singing with Shakira finally came true. I think I sounded good but my hips definitely lied. 🎤🚘💃🏼🕺🏻 https://t.co/N8mYh931Iq RT @nowthisnews: These Black Lives Matter activists were invited on stage at a pro-Trump rally – and every American needs to hear what they… RT @TeamBrickSquad: Catch Gucci Mane on the @TheDailyShow w/ @TrevorNoah tonight @ 11pm ET https://t.co/00gVqOelDk Yo @MELANIATRUMP come get your man. #CyberBullying https://t.co/xk3HS3e4OQ Anyone in Hershey PA need tickets for tonight's show?---&gt; https://t.co/LKMY5lDSbQ Let me begin by saying thank you- thank you to every single person who has been and continues to… https://t.co/uq6kb0dN3k @Travon Maybe he was in your category and he's still pissed that he lost. Thank you my friend. Here's to many more late nights together! 🍻 https://t.co/slJ26jgH0s I want the car that the camera is in! https://t.co/JIxxVjCe74 RT @TheDailyShow: The #BannonBulge surprise ending https://t.co/5CbVQbYwea Thank you comrades. Where would my comedy career be without you! ✊🏾 https://t.co/P1YOyTQtqi RT @Travon: Which WTC tower fought to keep slaves again? The south tower right? https://t.co/3AyBTAyfGN RT @ErnestSIII: 😂😂 When #selfie is life even during #HurricaneIrma #irma #hurricane #keywest https://t.co/dn8Hnx8pfH #Grateful 🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽 https://t.co/QjAnqJWpjy Washington DC. This weekend you showed me love on another level. Thank you for 4 sold out shows at the Kennedy Center. What a dream🙏🏽 Washington DC ---&gt;any takers? https://t.co/fI3FmxOAxQ I'm driving and Shakira is singing, a match made in heaven! 🙌🏽 https://t.co/cBvtv2UOhH RT @JuddLegum: After telling listeners Irma was a liberal hoax, Limbaugh quietly evacuates South Florida https://t.co/JAtylJjmHF https://t.… @AirlineFlyer @TheDailyShow Great coverage of the planes. It made my night! Thank you @JordynTaylorNow @roywoodjr Dopeness!!! I'm so excited for #XQLive and the great message of improving schooling for everyone.\n#RethinkHighSchool! https://t.co/ZfPBdQHl2m With Trump, every day is prayer day. 🙏🏽 https://t.co/O73kDHCFim Such a blast Joy. Thank you for joining us. https://t.co/LG3uofwnRu RT @poemless: \"Don't politicize this tragedy\" is American for \"Don't discuss the facts that would help prevent &amp; prepare for future tragedi… Thank you so much Eugene, Oregon. A beautiful room filled with beautiful people who all came to laugh together. I had a great time with you! @amyhali @carldaniels_ns ❤️thank you for sharing that. I appreciate you. Follow @HallieHaglund she's super funny. RT @palebirdy: Imagine implying that a woman who can succeed in the tech field is as real as Santa Claus and thinking you're making a reall… 😳🙌🏽🎉 https://t.co/Fxq0LtuAlP Or maybe people would have still voted for him- \"That's what this country needs someone who's doesn't spell like a politician\" https://t.co/BDFAryg8AV The crazy part is this is Trump on vacation. RT @RadioCity: Access presale tickets NOW to see @TrevorNoah at Radio City on Jan 13! Use code \"SOCIAL\" now thru 10P tomorrow! https://t.co… Thank you Durban for always being so amazing. 10000 people came out and made this Sunday magic. 🙌🏽🙌🏽🙌🏽 https://t.co/POtbjlagWA RT @AJEnglish: How Berlin activists are turning Nazi hate symbols into art. https://t.co/YjnLxifHTN Words cannot express how grateful I am to every single person who came to my first show at the Dome! We're making history together🙌🏽❤️🎤 5 hours to go! There's a Gupta on my stoep! Brought to you by @MNet . Can't wait to fill this with people and laughter! https://t.co/F7aOe8EDAA We're live on @Anele @947 @947BClub. Tune in. https://t.co/Z8cpvh4pfS So good to be back on stage in SA. Warming up for the Dome shows this week, are you coming? https://t.co/JTJaCPQZyQ @VictoriaReads @TheDailyShow Michelle Wolf and Desi Lydic don't count? @fivefifths Starship troopers Please read this thread. 😐 https://t.co/TOUo6SsWfK RT @algore: I'll be joining @Trevornoah on @TheDailyShow tonight! Make sure to tune in. #BeInconvenient https://t.co/tDbITuTM9e RT @ColMorrisDavis: .@realDonaldTrump to fight college discrimination against whites so maybe later they'll be more competitive for White H… RT @CarpoolKaraoke: Almost time to hit the road! #CarpoolKaraoke: The Series premieres Tuesday, August 8, exclusively on @AppleMusic. 🚗🎤 ht… RT @TheDailyShow: R.I.P. Anthony Scaramucci, White House Communications Director\nLate July 2017 - Slightly Later July 2017 https://t.co/SeJ… RT @TheDailyShow: Guess the \"T\" is silent? https://t.co/LTGUYJ6rxw RT @GAFollowers: A group of guys near Macon, Georgia we're seen taking initiative and cleaning up their own neighborhood this weekend. RT M… RT @hardwick: Hey @midnight is leaving forever in 2 weeks so watch the show tonight maybe! See @travismcelroy @griffinmcelroy @JustinMcElro… RT @MatthewACherry: The Lion King live action remake looks great so far https://t.co/f0pYkGToKi RT @TheDailyShow: The Mooch did his homework. https://t.co/Wku0DF2ovd Fake News. I shot them https://t.co/3Elc0dP8gs RT @TheDailyShow: R.I.P. Sean Spicer as White House Press Secretary, 2017 - 2017 https://t.co/y7QmJAroYH I wish there was a Shazam for smells. Alright Tulsa, it's show time. Let's do this comedy thing! 🎉🕺🏻🤣🎤 I love it! https://t.co/089zhDr6hp RT @OhEmmeG: if hogwarts was on MLK drive this would be the principal https://t.co/FmWXpSFqFj Jo'burg- my Friday night show on August 11th is officially sold out (thanks Mr Gupta). Don't sleep on the tickets I can only do three shows! Mzansi, the countdown has officially begun! One month to go before my shows at The Dome. August 9,10 &amp; 11. Tickets- https://t.co/0O5cFYqQuf Thank you so much San Diego. What a wonderful evening this was! 🙌🏽 🔥thread https://t.co/lP54PqQ9Vv @JonRodgers10 I've tried to shut that account down for years. Those aren't my quotes. Hey Johannesburg, together with @MNet  we've added another show at The TicketPro Dome. 9 August. Tickets here https://t.co/hPyzpqzkkm https://t.co/aBYpz708il RT @TheDailyShow: Tonight at 11/10c, here to talk about his new album, \"Big Fish Theory,\" it's @vincestaples! https://t.co/1Sg4AOKLuc RT @colbertlateshow: Ready for tonight's #LSSC?? @TrevorNoah is! https://t.co/A7QdLg7EEL RT @KassyDillon: This is David Bailey, the Capitol Police officer who this morning took a bullet and continued running to help Rep. Scalise… Too easy... https://t.co/ZghmUxaPpF RT @nytimes: Dave Chappelle is throwing a 10-show party at Radio City, with Chris Rock, Trevor Noah, the Roots and more https://t.co/3bZtG0… ❤️Roxane thank you for joining us on the show. Everyone needs to read this book. https://t.co/rzK4dsHC7B Everyone listening to Mcain: https://t.co/QR4RnU2u1C RT @_Zeets: Life really does come at you fast https://t.co/PFE3HcTR0w RT @megsauce: NO WONDER WHITE MEN ARE SO OBSCENELY CONFIDENT ALL THE TIME I SAW ONE WOMAN HERO MOVIE AND I'M READY TO FIGHT A THOUSAND DUDE… We're ready and waiting. The first show was 🔥 so I'm excited to do it again. https://t.co/7TMaIDdExf @Dr_Know_It_All @TheDailyShow #ThankGodForDVR! RT @McJesse: PLANET EARTH: Car keys Ivanka! Now!\n\nIVANKA: I'm looking!\n\nPLANET EARTH: Where are the keys. Ivanka...\n\nIVANKA: (dangling keys… RT @TheDailyShow: Covfefe: Based on a True Typo https://t.co/MHk1b07jK6 @tatyana_techs Point taken. Thanks for the heads up!🙏🏽 @Jonathan_Witt Covfefe indeed! A tweet for everything🙃 \n#Kathy_Griffin https://t.co/r8sZ6Utr6r RT @BillGates: As a longtime fan of @TheDailyShow, I loved reading this memoir about how @Trevornoah honed his approach to comedy: https://… RT @jrmaidment: Macron walks directly towards Trump, swerves at the last second to greet Angela Merkel first instead. Spectacular. \nhttps:/… RT @SabrinaSiddiqui: Manchester bomber was banned from mosque and reported by community multiple times. Authorities didn't act. https://t.c… 🙈 https://t.co/JM74QepU1I RT @SteveKopack: Did Trump just shove another NATO leader to be in the front of the group? https://t.co/bL1r2auELd Man Utd sneaking into the champions league like... https://t.co/1g5P4KcMBw @chrislhayes @JWKerry Nope Thank you again @kevinandbean I'd move to LA just to spend more time with you guys. See you for smileys tonight!!!\n🐐 💀 This can't be real😂😂😂 https://t.co/E1NMgXh2FR https://t.co/6cvmSOFarG Bill Gates just reviewed my book!!! \n\nStarted from Windows 3.1 now we here.🙌🏾🙌🏾🙌🏾\n\nhttps://t.co/KqKFGWSjVd RT @PeterAlexander: Trump again denies something that was never alleged -- his comments appear to confirm Israel as source, which no US off… @Jonathan_Witt The same way the previous 6 foot plus president accepted the medal. By bowing! 👀 https://t.co/qZjjp4b6Hi If an old man says he'll trade you one treasure for a paraglider make sure you sign a contract! He will try to screw you over. RT @nowthisnews: President Trump just did something he bashed Obama for doing years ago https://t.co/dI8LC6xAyr RT @yashar: There really is a tweet for everything. https://t.co/tWPf5fTncb Hilarious https://t.co/wTzAMpztxS Is\nhttps://t.co/2e9htDBOMO This https://t.co/aK7n4kpjx5 And Windsor, Ontario was 1000x amazing as I'd hoped. Thank you for coming to the show!🙌🏽 https://t.co/5NNSwV1lak RT @kerrywashington: ICYMI: Talking #Scandal Finale on @TheDailyShow with @trevornoah. https://t.co/R1OWFbK3le https://t.co/p0bY3bPvKx @Dikeledi_Mokone Don't ever stop dreaming and remember hard work makes dreams come true! RT @ShaunKing: Reminder that @SheriffClarke never served in the military but just dresses up to look like it.  Veterans are starting to spe… RT @MonkovicNYT: A sad legacy of Roger Ailes. I'm sure a lot of Americans can relate to this online comment: https://t.co/mYto7TVLex Because there's about to be many openings? https://t.co/SWETNSVWvo \"they grow so fast\" Pence thought, referring to Trump's scandals... https://t.co/Y1dKYrCMZA RT @yahooleaks: \"Nixon Sees 'Witch-Hunt,' Insiders Say\" \nBob Woodward and Carl Bernstein\nJuly 22, 1973 https://t.co/RZ25MEvcvG Let's hope air force one doesn't have in flight wifi...\n#NutJob https://t.co/0leDTy1CWq @ditzkoff We're close but not there yet...✊🏽 RT @ImranGarda: Jack the Ripper generally let women in London live in peace. \nWith a few exceptions. https://t.co/wCu2K8Pneo Did you know that If you tell a lie three times, Kelly Ann Conway will appear? Any retraction in the news should have to be in the same space as the original headline, not in the bottom corner. 😳🙈 https://t.co/Bida7F9iR6 RT @ava: Chilling. With all the Comey news, this badass slipped under the radar. Not too late to listen. https://t.co/PtO4trG6fO I had so much fun doing this bit with @StephenAtHome and Jon Stewart my mentors, icons and friends. Happy 20yrs Colbert! https://t.co/X8Bsw9Yu0I RT @TheMattWilstein: \"This is insane.\" @Trevornoah gives the first late-night reaction to James Comey firing: https://t.co/887xnaIJKr https… The only person having a worse day than James Comey is Lil Bow Wow. Thank you so much. And thank you to all the fans who've made this dream a reality. #ProudlySouthAfrican https://t.co/Dj9xeZx4UC Find you someone who looks at you the way Snoop looked at me after I won. #mtvmovieandtvawards2017 https://t.co/TTCz4JRCT2 Backstage after winning MTV award for best host. Thanks for the pic snoopdogg!\n#mtv @ Los… https://t.co/FhymrcCuSV Thank you thank you thank you thank you. \nWow https://t.co/sganR44i5D RT @AriBerman: French turnout of 74%, lowest since 1969, would be highest in US election since 1896. Benefits of weekend voting + no voter… RT @ABCPolitics: Constituent at town hall for Rep. Tom Reed: \"I'm a veteran. Everyone here deserves single-payer health care, now.\" https:/… @AndreaChalupa @sarahkendzior I don't think they're allowed to report on the details of the emails. A system designed to prevent media outlets from influencing elections RT @nowthisnews: Rep. Joe Kennedy had some choice words for Paul Ryan about the GOP health care bill https://t.co/7LY4yGQS9f An honour and such a joy meeting chimamanda_adichie. I've learned so much from this amazing… https://t.co/DQJggvQyKe RT @AwkwardHolland: What if I told you...\nI photoshopped the same face onto every man behind Trump. Would you have noticed if I hadn't said… The ACHA is the American Collegiate Hockey Association. 🙃 https://t.co/R7SzLLdng7 About last night...\nI'm one step closer to making this @rihanna and @Lupita_Nyongo movie happen… https://t.co/cNbZVRVORQ He doesn't need the money Ryan, he just wants some of that \"Live\" paper! 🙌🏾 https://t.co/tGOkfUkHN0 ikigai ☀️ @bluestockingsM Not defined but rather a common marker. I lived most of my life in the \"overflow\" room. Thank you for having me. 🙏🏽 https://t.co/mYdEijfdHn RT @GreatDismal: @nytimes decision to have an in-house climate change denier, in 2017, will look far worse, in ten years, than support of I… RT @ava: Pretty great. He just slayed the night. Smart as hell, and perfect timing. Know the name. Hasan Minhaj! #WHCD2017 https://t.co/Cik… Great job by @hasanminhaj at the #WHCD2017. 👏🏽👏🏽👏🏽 People of Durham, North Carolina. Thank you for two amazing shows last night and thank you for sharing your public bathrooms. 😁🙏🏽 And I'm excited for North Carolina tonight! https://t.co/fVDm5F0OcE RT @lanadelslayinit: If you're still not convinced that the system is fucked up take a minute of your time to watch this and educate yourse… The Legend live. \n#time100 https://t.co/JJahSFZ87M RT @xander76: The sign game was strong at the #ScienceMarch today, but this was my favorite. \n#marchforscience #ScienceMarchSF https://t.co… RT @alexwagner: $65M of the $85 Million in FOX harassment payouts is going to the men who were fired b/c of harassment allegations: https:/… I'm so excited. One more week 🕺🏻💃🏼🕺🏻\n\nThe President Show - All Winners, No Losers https://t.co/qdU5HeMsft So Serena cheated. Because that's technically a doubles match.🙌🏽 https://t.co/gkyBYlcHtQ This video made my day. 🙌🏾 https://t.co/3lTICRLYtB Game Time. Barca!!!\n#barcelona #fcbarcelona @ Camp Nou Stadium, Barcelona https://t.co/R4v2VhYEKV RT @WJXTTarikMinor: Anti Gay Pastor Ken Adkins who dressed in drag to protest homosexuality found GUILTY on 8 child molestation charges. @w… 🙌🏽🙌🏽🙌🏽 https://t.co/XxbkDobD80 #GetOut part 2 @ Seville, Spain https://t.co/uLJIFaUGKX A Muslim comedian invited by the press to roast the president. @realDonaldTrump you gonna let this slide? https://t.co/Gupfi1y3pz I failed because you did not pee, but there's always next time. 😄. Thank you Ithaca College. #lacrosse https://t.co/Ua3c6u2EiR RT @IthacaCollege: We’re doing ticket upgrades for tonight’s @TrevorNoah show! Find out how you can win after the doors open at 6PM. #ICTre… RT @ChristineHalli: Didn't think it was possible to love @Trevornoah more but 6 rows from him, laughing my face off has taken this love to… Thank you Philadelphia for having me tonight. First show done and so much fun. One more show to go. https://t.co/Ofuft5OjOG Easiest way to understand President Trump is to listen to civilian Trump. https://t.co/zLyjSnrCSH Wow, thank you @MTV &amp; @MTVAwards for the nomination for best host. https://t.co/u7qtYnrNXm It's sad that politicians can't find money for education, clean water or healthcare but they can spend millions to \"send a message to Syria\" Kim Jong Un right now... https://t.co/oaJNVpF5kE No puppet, no puppet... RT @TheDailyShow: Does @SeanSpicer treat the press like a bunch of kindergarteners? https://t.co/SH3nowF4wR This network is going to the dogs!!! #sad https://t.co/8PBUJC7p8j @BabsDC96 Serviettes 😄 RT @matthewamiller: According to Spicer, Hillary Clinton has such close connections to Russia that they intervened in the election to elect… Tickets on sale now for my fall tour! Go to https://t.co/eyGfMXd9nb for cities, tickets &amp; info! Don't miss my Afraid Of The Dark tour! New dates just added for Atlanta, Columbus &amp; Minneapolis! https://t.co/GtUAC4bDCV RT @SteampunkMuppet: Holy damn, Arnold is a damn savage. https://t.co/wDtpQVha1q RT @DanAmira: Why a couple earning $500,000 a year can still find it hard to get by https://t.co/6s10MTRLfx #SoMuchWinning @lincolnablades great article but I feel like you missed something. Be great to chat sometime. Love your work OK Uganda, you win. I'll try to visit sometime. But when I land, I want the original Rolex made by Sula in Wandegeya #TrevorNoahVisitsUganda 😄 you're trying to convince a South African by using wildlife?! #WeBeenHavingIt https://t.co/Qh47XpPS07 RT @TheNewThinkerr: YOU BETTA LIGHT HIS ASS UP!!! https://t.co/idfiOyRvim Is this like when Columbus \"discovered\" America? Because this was already announced under President Obama.\n\nhttps://t.co/fKyiAPyDIZ https://t.co/wpTmNYRshf RT @TheRoot: Let's kick off #WomensHistoryMonth  w/ some #BlackHistory! \n\nDr. Mae C. Jemison was the 1st African American woman to travel i… RT @davidfrum: Fox &amp; Breitbart groping their way to the conclusion that the True Conservative position is single-payer for white people. Help support the @gardenofdreams charity! Bid to win two tickets to @TheDailyShow &amp; meet me in NYC! https://t.co/LdgyYG9wuV @charitybuzz RT @thehistoryguy: If you've been watching Fox you may have been told that London is defeated and demoralised. \n\nSo I walked to work and fi… RT @Anthony: Nunes says leaks are bad. \n\nNunes leaks intel.\n\nNunes now says he might have leaked false intel.\n\nhttps://t.co/noTlIb1dzc RT @zhubinparang: \"Is THIS what you want?\" Trump snarled, grabbing a child and gently injecting a free vaccine in her arm. \"HUH??\" https://… This is a scam, I'm not coming to Uganda. https://t.co/fAh8EUdtO7 RT @perfiIIusion: this is so fucked up. https://t.co/SJUaE0uYXy RT @pamunapologetic: TREVOR NOAH BLEW MY MIND!!!!! Yall go see him live! @Trevornoah THANK YOU for bringing your perspective &amp; humor to Loy… RT @LadyyTayyy: I just saw @Trevornoah at @LoyolaChicago and I have been reborn. Spiritual, inspirational, and hilarious. https://t.co/r4o6… Definitely!🙏🏽 https://t.co/sBwXMbPse9 The pleasure was all mine. Thank you https://t.co/41jlOo8elV Tonight I had the honour of performing for one of the most phenomenal audiences ever. Thank you @LoyolaChicago 🙌🏽🙌🏽🙌🏽 Welcome to 2017, where China is telling the US to calm the f*#k down. https://t.co/FpWCUdNYOv RT @goldengateblond: Angela Merkel is every smart woman who's ever had to treat a moronic man as an equal. https://t.co/gMv7fJw76u RT @FionaAdorno: Merkel: Why is a Handbag Designer at this Meeting? https://t.co/ty2dIRcTSC The Sharks were fire tonight! Thank you @NovaSE. https://t.co/tapdB4fyg1 RT @JordanPeele: The Sunken Place means we're marginalized. No matter how hard we scream, the system silences us. RT @ditzkoff: Trump tweets condemning:\n- Islamophobic or anti-Semitic acts: 0\n- the white nationalism of Rep. Steve King: 0\n- a Snoop Dogg… #SnowBae https://t.co/gBFTn71EHQ RT @TheDailyShow: Parenting is hard. https://t.co/vBkOusnpP6 https://t.co/RpJZM2sbOL RT @NumbersMuncher: This video is basically a baseball reenactment of how Trump got nominated and won the election. https://t.co/v9jFyHinkJ Thank you Nickelodeon and thank you to the kids for choosing me. Kids never chose me in school but better late than never!!! 😭❤🙏🏽 https://t.co/FF11yEfCId @JasmineGMehta @LIVEfromtheNYPL thank you for joining. 😂😂😂 next time invite me in person! https://t.co/aXPy4iHyz5 🤗 Thank you for choosing me as your first audio book. I really enjoyed recording it. https://t.co/5FFPKKZWqc This thread👇🏽👇🏽👇🏽 https://t.co/SiOCNrukc4 RT @JuddLegum: She actually went to the U.N. to call for action against genocide and mass rape https://t.co/4NM2WJwbYv Excited to be part of the Mid-season finale of @NashvilleCMT Tonight at 9/8c on @CMT #NashvilleCMT https://t.co/QITcpmvE6Q @MissMarquez4CHS @hulu 😢I know I'm also heartbroken. Luckily you can watch the show anytime on https://t.co/fmZD7gF1X9 or the app or TV🤗 Thank you again @VanJones68 for having me on the show as your guest I had a great time. Thanks everyone for tuning in. #TheMessyTruth RT @tressiemcphd: 1. https://t.co/LQd65AEePw Check it out! Tonight I'm sitting down with @VanJones68 on The Messy Truth at 9pm ET on @CNN RT @Forbes: Women reinvest up to 90% of their income in families &amp; communities, compared to 40% for men https://t.co/xZG2CKySzu https://t.c… Wathint' abafazi wathint' imbokodo.\n\n#InternationalWomensDay Thank you for reading the book. Sharing my stories has honestly been a pleasure. https://t.co/tU32qA94bC @iamtbotouch 🙏🏽 thank you brother RT @cmclymer: 1/ Regarding my last rant, it might be helpful to give my background on living in a conservative environment, amid white supr… RT @AdamWho: .@jasoninthehouse This is my 80 year-old mom Lois, with her iPhone and her oxygen. She has a message for you. https://t.co/PJC… RT @jayrosen_nyu: \"I was wrong. Now we see: Tuesday night was not the moment he became presidential. I got swept up in the moment.\" &lt;— Anyo… @shezzlovely that's the joke puleng. That SA and US feels similar right now. My calmness is where the joke eminated from. 😄 @kujakupoet yes everything is perfect in South Africa. 😉 I'm not gonna lie it's fun being in a country where it feels like the president knows as little as we do about what's going on. \n#united Mr President, you do realise that we ask questions online because unlike yourself don't have the CIA and FBI right? https://t.co/3oSYCVS4mP RT @jonfavs: Barack Obama's master plan:\n1) Wiretap the opposition \n2) Gather damaging info \n3) Say nothing\n4) Let him win \n5) Ride off int… Who is Donald Trump? https://t.co/loKlVcmhM6 Messi could probably chest trap a cannon ball. Amazing goal. \n#Golazo Sadio Mané is a special player. Such a joy to watch. I got it from my mama...🍑 https://t.co/oD2Qfq752t Wow it looks even crazier on a news stand. Look mom, I'm on the cover of Time magazine.\n😳🤗 https://t.co/7cmJpGWXIM Great thread👇🏽👇🏽👇🏽 https://t.co/KMGVCoeVeF I don't really know how I feel after watching #Logan. I think it's a good movie but I also feel like I need to cry and go sleep. RT @eosnos: Thanks to @Trevornoah for a smart conversation about #Sessions, Russia, and the proper technique for groping an elephant. https… Trump has just announced he's speaking at 2:30pm. What do you think he's going to do? Happy World Book Day🎉📖🎉 https://t.co/cdfUI2LZyc You're being kind, he probably just wanted to see @jaketapper. Babies love fake news 😄. https://t.co/lh2nEuGaa5 Thank you both for coming on! https://t.co/2ldri0Grq9 RT @TheDailyShow: https://t.co/JI3HioGZGn Guys Trump just opened with Black History and Kansas Shooting and JCC. THE PIVOT IS HERE😳😳😳😳 RT @thedailyvox: Blaming immigrants for our own internal problems isn't getting us anywhere. https://t.co/LyWxP3MH8a I was dying with you! We're back tonight🤗🤗🤗. https://t.co/JFTeIwCExn 🙌🏽😄 https://t.co/ky9fcj4GbA Black people waking up this morning- https://t.co/yPXhx6UsOV It's not worth saving your pre written piece. Just let it go. https://t.co/0cVuemSgoX Steve Harvey right now--- #Oscars https://t.co/Zx4nRyMLPH That works too😄 https://t.co/sNvbl5Bxe2 Thank you for enjoying. 🙌🏽 https://t.co/ufhbmTsxMa Stanford thank you so much for having me on your fantastic campus. Sorry we couldn't fit everyone in. I promise I'll be back again. ❤ Thank you 🤗 https://t.co/oLiaSFQGkq GO TO A CINEMA AND WATCH \"GET OUT\"\n😱 RT @DLin71: Transgender people arrested for lewdness in bathrooms: ZERO\n\nNumber of times Trump entered Miss Teen USA dressing room unannoun… Thank you Vancouver for again showing me love at the JFL festival tonight oh and thanks for offering me a plan B if Trump kicks me out 😄 🤗❤ https://t.co/lPEKptGi4n OK Vancouver JFL, two shows tonight. Let's make the funny or die trying! #NewProfilePic https://t.co/vxrCszwhSJ RT @NewmanUA97: Loving it @Trevornoah \nCheck out “Trevor Noah: Afraid of the Dark” on Netflix  https://t.co/clK1cJcigw https://t.co/ZZSzlDJ… I love being downloaded, it feels nice on my skin! #ThankYou https://t.co/Lpp4p90lZt Or a master's degree in BAEness?! See you on Netflix.🤗 https://t.co/lSAKpZOyS9 Don't worry I'll cover for you! 😄 https://t.co/aCIvRvqzlX 🙌🏽🙌🏽🙌🏽 https://t.co/0H5hEjomoO Living LA the South African way. Universal Studios with my day ones-\n#UniversalStudios #WizardingWorldHollywood #TWDatUniversal https://t.co/hf8apKKvHh Thank you Joburg! Ticket sales have been insane these last 2 days! I can't wait to bring my new show in August!\n\nhttps://t.co/0O5cFYqQuf https://t.co/tq6l3iJ6XG The day has arrived! Check out my new comedy special #AfraidOfTheDark streaming now on @netflix https://t.co/oEjFZ4cXLq Thank you so much for the birthday wishes everybody. 🎉🎉🎉\nOh and ps @rihanna let me know if we're still throwing that joint party! RT @JoyAnnReid: Your president has kids from three different moms, took five bankruptcies and hasn't paid taxes in approximately 19 years.… At 11pm on Comedy Central- Roy Wood Jnr is doing his first stand-up comedy special. He's one of the funniest you've ever seen. Tune in!!!! Thank you Boston for six crazy amazing shows. I can't wait to come back to this city! \n\n#Boston… https://t.co/VO9GiaFQ8V That's ok, Donald, we all mess up. It's not like you have your own intelligence agencies to give you real news. ❤ https://t.co/XasA6e2GJy RT @SethMacFarlane: Why Liberals Are Wrong About Trump \nhttps://t.co/VU69RZod9b RT @PeterAlexander: For the record, it's @PeterAlexander.\n\ncc: @Trevornoah https://t.co/0hdararwvk \"Running like a fine-tuned machine!\" https://t.co/6xeklpokGm @jbouie that headline is misleading. He ordered meatloaf for the two of them. RT @TheDailyShow: We made a browser extension that converts Trump’s Tweets into their rightful state: a child’s scribble. Download: https:/… RT @DanAmira: did anyone do this yet https://t.co/SvduMxnN4g One week away....💃🏼💃🏼💃🏼💃🏼 https://t.co/eWowSjiQyK Psst...here's a sneak peek of my @netflix comedy special Afraid Of The Dark airing February 21\nhttps://t.co/TuSlXqHcM0 #AfriaidOfTheDark Chance the Rapper with Trevor the Comedian.\nBetween the two of us we have 3 Grammy Awards!!!… https://t.co/Ekm85NLap4 That sucks for Nordstrom now they have to find another cashier😢. https://t.co/i3fVOvTPfH Oh what a night. You meet the most Grammy Awarded Artist Alive Mr Quincy Jones and he tells you… https://t.co/b33ACJYhkD RT @JonoDuncan: I don't often read for pleasure. Not many books can hold my attention. But I seriously can't put @Trevornoah's \"Born a Crim… I also sometimes forget when I talk to Russia. 🙈 Such an honour to receive two NAACP Image Awards for my book \"Born A Crime\". Thank you to every single person who has shared in my story. 🙏🏽 RT @brennawilliams: Abe's facial expression is 🔥 https://t.co/etYaiNH6vp RT @mj_lee: Seriously urge everyone to watch this entire question from a woman at GOP #Obamacare townhall in Tennessee: https://t.co/8mBGE1… RT @Heauxno1currr: A basic visual of how conservatives thought America would be ran under T*ump vs how it's actually going https://t.co/BRA… Thank you for being so strong whilst also doing amazing things for others. Good luck for Mt Kilimanjaro! I hope everyone donates. https://t.co/DnNOaQolxJ Look mom, I'm in the @nytimes crossword puzzle- 🤗 https://t.co/HOEprcamfN Friday's be like... (Photo Credit: @ruminasean : Sean Gallagher Photography) https://t.co/uPfsjJ8WYp Honored to be presenting at the @naacpimageaward tomorrow! Tune in live at 9pm on @tvonetv @johnnystir thank you. And thanks for tuning in. \"SEE YOU IN THE RING\" - Delusional boxer who has just been knocked out in the ring. https://t.co/vqGnHLzs9C Lol he says this like he didn't just lose in court twice. 😄 https://t.co/6ESTbEybvu RT @TraceeEllisRoss: I’m on @TheDailyShow with @TrevorNoah tonight! ✔️me out at 11pm/10c on @ComedyCentral! #blackish https://t.co/FwNiAqua… People need to stop hating on President Jacob Zuma. Of all our democratically elected presidents he's easily in the top 3!\n#SONA2017 I work with famous people 😜!!! @roywoodjr's first comedy special coming out Sunday February 19th… https://t.co/zxXwwX6IY7 I call all the shots\nRip all the spots, rock all the rocks...\n#NotoriousDJT https://t.co/hxJC2lAIjJ Honored and excited to be presenting at the 48th @naacpimageaward Saturday, February 11th on @tvonetv https://t.co/WGV4Wz2dAK RT @jaketapper: Posting photos of the brave US troops arriving at Normandy and claiming it illustrates \"America First\"?\nUm, no. \nLiterally… OK. Just a broadcast glitch. It's not happening yet people. See you tomorrow good people! What just happened? Was that just my TV? RT @GuyEndoreKaiser: Trump shouldn't be allowed to choose a justice in the last year of his presidency. Charlie that's not true. Legal immigrants at the airport were forced back onto planes leaving the US. But thank you for watching. https://t.co/W1hqCqarJ0 😢 https://t.co/A9jd0MXdtt 🙌🏽 https://t.co/G0ZvsRlzid So to all the people who didn't vote, tell me again how Trump and Hillary are the same thing? 🤔 The look on my face when the alarm clock goes off on a Monday morning! (Photo Credit: @ruminasean : Sean Gallagher Photography) https://t.co/gTGwo0mjWD RT @nytopinion: To Republicans who remain quiet, or tacitly support Trump's immigration ban: history will remember you as cowards. https://… RT @chrislhayes: Much easier for Trump to make life worse for those he promised to hurt than it will be to make life better for those he pr… RT @DanAmira: Imagine explaining to a child refugee that the richest strongest country in the world is scared to let him inside. We're path… RT @Anthony: Trump immigration ban doesn’t include Muslim-majority countries where Trump has done business or pursued deals.  https://t.co/… Those pants aren't sagging, it's just an alternative fit. https://t.co/FHRckbxSyT It starts with the Muslims on the outside then it moves to the Muslims on the inside...\nNo you're right, that could NEVER happen. RT @AndySchapiro: On #HolocaustMemorialDay: 1939 US visa that saved my mom’s life. Other relatives couldn’t get out. \nShameful that today w… RT @YahooSports: Ahmad Cobb, a second grader with brain cancer, got to meet his sports hero: Stephen Curry. https://t.co/gseSfqJNIs RT @Stl_Manifest: My name is Herbert Manasse. The US turned me away at the border in 1939. I was murdered in Auschwitz https://t.co/Fxdrv5E… 🙃 https://t.co/6CibRXQP81 RT @moshekasher: Give me your tired, your poor, \nyour exclusively Christian masses yearning to breathe free. \nCompassion only for those who… What a huge honor! Many thanks to the @ALALibrary - My English teacher would be so proud! #ZoraNealeHurstonAward #bornacrime https://t.co/Y1XhdqMEXz I waited 10 years to tell Laurence Fishburne this story. I can't lie, I've lived an amazing blessed life. https://t.co/XE5GOKoehk RT @EricDSnider: You can get insured through ACA till 1/31, good thru 2017 even if repealed. Out of sheer spite, Trump pulled the ads telli… RT @miel: reminder: our president's mother was an immigrant. his wife is an immigrant. \n\nthis.\nis.\nabout.\nrace. RT @davonmagwood: Paul Ryan had his phones cut off because of the volume of calls. Let's have a #PaulRyanFaxParty\nFax things to Paul Ryan\nF… RT @JessicaYellin: A modest proposal: sell CNN, make it an independent news channel  https://t.co/Vpr2ycIXjj If Trump can't accept the result when he wins what's he going to do when he loses? RT @SenSanders: The great political crisis we face is not voter fraud, which barely exists. It's voter suppression and the denial of voting… Lord in heaven. Why did the first politician to follow through on his promises have to be Donald Trump? RT @yashar: WATCH: The only thing you need to watch about POTUS' voter fraud claims is this intro by @jaketapper -- please share far and wi… They're trying to sabotage you Mr President. That picture is marked with the wrong date, you were inaugurated on the 20th.\n#GotYourBack https://t.co/Beb6imoaA4 Dear @realDonaldTrump, billion dollar idea- Supreme Court Apprentice! Best ratings ever, whole country gets to vote via text. Thoughts? Yogi and I are excited to announce my new @netflix special #AfraidOfTheDark Premieres 2/21 on #Netflix https://t.co/Y44MyWQJFU RT @TheLeadCNN: \"Here's an alternate fact, I'm Wolf Blitzer, and you're in the Situation Room\" -@JakeTapper https://t.co/Ygu75WG0g5 RT @ChriStylezz: Can y'all please look at Melania face when Trump turns around 😭😭😭 https://t.co/UkpOnRS7S5 @JoyAnnReid @kharyp A dead giveaway is the missing exclamation mark! Trump almost always uses one- Sad! RT @mcstrollo: Joe Biden memes are great, but have you seen George W. Bush fighting a poncho? 😂😂 https://t.co/NTO3JGM521 Joy was amazing. Tune in and enjoy our inauguration episode! https://t.co/avlbeFU1RY RT @DPAC: Just announced: second show added for Trevor Noah on Fri. April 28 at 10pm. On sale now: https://t.co/FEmZzK4gM3 https://t.co/SJo… I think maybe Trump did write his own speech. We stand at the birth of aluminium. RT @ConanOBrien: Donald Trump’s inauguration is expected to be the most costly in US history.  And that’s not even factoring in the money. Right now in this moment Obama is president and Pence is vice president. It's like wife swap. @fivefifths my response to the haters- https://t.co/FwL3PAuQt1 @fivefifths https://t.co/gSBYodvyhl What do you think Trump will say about the number of people attending the inauguration? RT @JFLNorthWest: MORE SHOWS ADDED!\nJust when you thought that JFL couldn't get any better. 🎉🙌🏻  presale for TrevorNoah starts 10am today!… RT @michelleisawolf: San Francisco!!! https://t.co/SrkeNGFcSq RT @nhannahjones: #MLKday2017 The real, non-homogenized Dr. King. https://t.co/uusHJkGeZy \"We're only 18%\" 😂😂😂 https://t.co/yOsr7Cc8iT RT @Fahrenthold: In 10 minutes, I'll be @thedailyshow. Even if it goes poorly, too late: I have already left the premises with all the free… New @TheDailyShow episode starts in 5 mins and in 5 mins and 3 hours on the west coast. Tune in.🤗 RT @goodreads: Our friends at @audible_com are giving our U.S. a free audiobook—and it's a great one! https://t.co/24tkAhKvqm https://t.co/… 😂 https://t.co/0lvHVjCPH4 Thank you Joe. And yes thank you to my mom. https://t.co/lO3pu094Xy ❤ https://t.co/1Wx0dq3DXh 3 Movies I've loved watching this year-\n\nHidden Figures\nLala Land\nMoana \n\nAll magical in different ways. Thank you so much everyone who's bought my book in Canada. 🙌🏽🙌🏽 https://t.co/oRJRnreQDf RT @freakonomics: Our latest episode: “Trevor Noah Has a Lot to Say.” A conversation with @TheDailyShow host. @Trevornoah\nhttps://t.co/X70O… RT @NJPAC: NOW ON SALE: Host of #TheDailyShow, Trevor Noah comes to NJPAC for an evening of stand-up comedy!!! https://t.co/vjdvNFSZei http… I think Trump is gonna beat Hillary. RT @429Magazine: Do know just how little @Trevornoah gives a damn about the right's opinion? \n#MerylStreep #GoldenGlobes \n\nhttps://t.co/7dM… RT @mumbles_j: This is.... slavery... right? https://t.co/3Z9nBvnkRb I loved recording the audiobook. I'm so glad you enjoyed it. Thank you https://t.co/twvhVtUwRM 🤗 thank you https://t.co/cxukcaKFD2 😄 https://t.co/KUX8sSPY9W @eugenekhoza you've been there with me many times when I have. RT @sahilkapur: Call it \"Obamacare” and 85% oppose it. Call it \"Insure Tennessee” and just 16% oppose it. http://t.co/EO199o1I5z http://t.c… Quick NBC change your name to Russia... https://t.co/3yqYsQxcIF RT @ohThatann: @Trevornoah @VicenteFoxQue Mexicos that may pay for the wall:\nMexico, Maine\nMexico, N.Y.\nMexico, Pa.\nMexico, Ind.\nMexico, Mo… 👀 https://t.co/3iDN6AaPf5 The iPads will take effect after the next election but thank you for the praise! #RewardAndDelay https://t.co/B7yn3WVObt RT @TheDailyShow: EXCLUSIVE: Tonight at 11/10c, Key and Peele return with one final address from President Obama and Luther, his anger tran… RT @diegoluna_: I got emotional reading this! #RogueOneStarWars https://t.co/kfNXxYxWWI The Daily Show is back from vacation in Russia. Comedy Central right now and right now in 3 hours on the West Coast. @medge89 thank you Meg 🤗 @medge89 yeah that run was insane. We did well though. 😋 New Year- Who Dis? Happy New Year everybody. 2017 is going to be so much better than 2016 even though we're bringing along all the same people!🎉 People forget how much 1 year actually brings to their lives. Take a moment to reflect &amp; to hope for another amazing year. Happy New Years! @DanAmira you mean 8 years? This made me laugh. Tell your Grandmother as long as she lets everyone know I'm her favorite she can tell everyone I'm her Grandson! https://t.co/DbFxFrJsf4 RT @tbonier: Food stamp fraud costs the US less than the cost to taxpayers for just 3 months of Trump's family living in NYC. But yeah, sta… Thanks @JILLFRITZO @audible_com and everyone who listened to the #BornaCrime audio book! I spent so much time recording it glad you like it! https://t.co/ZIsv23XUA8 Yes, president @BarackObama is doing a good job. https://t.co/su1ue4gzgC I spent so much time recording my audio book. Thank you for listening and sharing. https://t.co/wzXKtlju49 @zacarytaco_j thank you for reading the book and I'm so happy it connected with you. The world is small, one day we'll meet! Wishing each of you a very happy and safe holiday! May the real gifts of the season be present in your lives. (Photo Credit: Sean Gallagher) https://t.co/6JRVVLzD2j @ACHardig merry Christmas to you both. I hope you have custard and jelly! @bloggins1 I feel your pain. 😄 Thank you for reading the book and sharing in my story. https://t.co/FbvYqdprCa Thank you for listening to my audio book and yes my mother is the amazing force who made my life possible. ❤ https://t.co/BvGYLJ2O6p Just found out that #bornacrime is the highest rated audiobook of 2016! Thank you @audible_com &amp; everyone who listened! It was fun to record So incredibly honored to be nominated for two #ImageAwards for #bornacrime Thank you @NAACP for this amazing recognition! https://t.co/u8LlSZhveK I just got a VR headset and a @FalconNW gaming rig. If this is the future of gaming we're never going to live in reality. Yo @chrislhayes- fascinating town hall with @BernieSanders tonight. @PoppieMae happy birthday🙌🏽🙌🏽🎉🎉🎉 RT @TeenVogue: Donald Trump is gas lighting America and deliberately undermining the very foundation of our freedom https://t.co/M00m2yjuly… @fabiandamboeck yes indeed. RT @_______Manny: Lmaoo Santa looking like he about to risk it all... https://t.co/2QtTt0xjvT @Rosenbergradio @CoupCoup40Cal here's the story of how Kkk leader David Duke's Godson changed through engagement - https://t.co/za5CVHIIZ1 What a blast on @Andy with these two Legends. One of the nicest most genuine couples you'll ever… https://t.co/p0rGKuRxTd Thanks for listening. Sometimes as people we don't want context we only want the info we need to fight what we want to fight. https://t.co/o6OmZMM6Fx Thank you for supporting all the way from Schland! 🇩🇪 https://t.co/d023Pjbozo The breakfast club was real fun. Thank you for having me on \n@djenvy @angelayee and @cthagod.\n🙌🏽 https://t.co/KNGSlp0BI7 @eleven8 the same reason there's no pill for alcoholism. RT @nytopinion: Divided people are easier to rule. That was the whole point of apartheid, writes @Trevornoah https://t.co/HKcd8icncG RT @kashanacauley: \"That's a Nazi.\"\n*Nazi puts on fedora*\n\"That's an international alt-right man of mystery.\" Italuscita? 🙌🏽 https://t.co/nunqSD2Hnb Says the star who taught me how to use YouTube. Next time I see you I'll hug you to death.🤗 https://t.co/K2xBoh05h8 @dreamteamsa 😂😂😂😂😂 you're a moron. I love puns, nicely played. Yes thank you @prairie_home indeed. I really enjoyed myself tonight. https://t.co/ItQdfxXvNP \"it's alt right, but it's ok, I'm gonna make it anyway...\" RT @SethMacFarlane: https://t.co/Fr5UElofyx Extended Interview with @TomiLahren on @TheDailyShow https://t.co/UiUh6Dxi10 via @ComedyCentral @Rosenbergradio how is it a bigger audience? Her videos get viewed 50 million times. @CheerstoLiving you're sitting into a void. 😄. Comedy is not for everyone but I'm glad you get it. Make a difference in the lives of children living w/HIV by donating to @keepachildalive https://t.co/Lrlbe28hIB #StoptheAIDieS #WorldAIDSDay https://t.co/2X06hQsQ9M Thank you for being my guest Tomi. Our goal should be to destroy these \"bubbles\" not each other. You're always welcome on my show. https://t.co/AairL3cdAy @JTashara 😄I love Twitter. My talk with Sen. @CoryBooker about #BornaCrime via @Slate https://t.co/54eAYVvaSX I never dreamed my book would get such a good review from the @Nytimes. \n\nMama we made it. ❤️ https://t.co/WMYnbDb26N @Jonathan_Witt in South Africa we pronounce it Koo. 😬 @leelesburg thank you Lee. I'm shocked that a story so old could seem so current. Interesting times ahead. @estherracquel thank you for allowing me to share. I appreciate you and your support. @AlexusMedinis @chrissyteigen this is Twitter. I don't take chances anymore. Wow this is powerful. Please try read... https://t.co/GghsJohG2w It's too late. He already owns Miss Universe...\n* Puts on shades and episode starts*\n\n(I know trump sold the pageant this is a joke) https://t.co/RiiHlbJKJI RT @CharlesFinch: Man outside of a mosque in Texas this morning https://t.co/bsbfW1PkA9 RT @DetroitNABJ: Even in death Castro's legacy proves difficult, if not impossible, for U.S. news media https://t.co/YHcvWSD8vj @DntNeedNObadi deal! @KwadwoBTG ahh shame. Has no-one told you about the unfollow button. I'm speaking by myself you can choose not to listen. @NikkiWheelerUK @pestononsunday @Nigel_Farage I wasn't pro Clinton I was anti Trump. I don't like turbulence but I'd choose it over a crash. @meks2850  and yet you just tweeted about me. I guess attention was paid after all? 😄 Damn. Now I understand why Brits complain so much about geo locking. I can't watch anything online. @susan_karanja thank you Susan. And thank you for tuning in. @ArsenalFishing I never said it was. I understand the economic underpinnings for the vote. @ArsenalFishing I don't judge people for voting the way they do. I question it. But I do judge politicians for misleading voters on Brexit. @youngblackcon thank you for your conversation. I changed the tweet. I'm joining @pestononsunday on itv  now. If you're reading this tweet and it's not a Sunday then just ignore this message. In a previous tweet I said Mike Pence supports electrocuting gay people which is not true, he supports torturing them. My apologies. And your friend Mike Pence supports torturing Gay people to make them straight. https://t.co/rnsPgQShDJ @Jonathan_Witt you're right. I should have said torturing. @Jeff_ZN0203 dope🙌🏽 @Jonathan_Witt does he not support torturing gay people until they become straight? @YTM1staWu1fy @youngblackcon @Jonathan_Witt I'm not making this up. Read 4th circuit court ruling on North Carolina voter id laws. @YTM1staWu1fy @youngblackcon is not the requirement that's racist. It's the blocking of access to getting an id that's racist. @Jonathan_Witt @youngblackcon our voter id laws are not aimed at disenfranchisement of poor people. It's super easy to get an id in Sa. I had a wonderful evening with everyone who joined tonight's #guardianlive event in London. Thank you all for making my night. @youngblackcon I hear you. But I argue smart politicians know how to obscure- few support \"racism\" but many support monster voter id law. @KeithOsmun thank you and thank you. @Lclark74L he was actually fine. Other than being expelled he went on to live a normal life. Now working for Audi as a technician. @KeithOsmun I'll check him out and sorry for the crazy timeline. I love engaging but Twitter likes fighting. @youngblackcon @YTM1staWu1fy @KeithOsmun if you support conversion therapy and that therapy includes electric shock? What am I missing? @KeithOsmun yes. He supports conversion therapy. Which also includes electrocution. @hdmaert not moral equivalence. Rubio using the gay cause when it suits his argument. . https://t.co/K8tAVHyM16 Feeling Thankful... #bornacrime debut's at #2 on @audible_com Had such a great time recording this for everyone! https://t.co/iv9L0w2Nn4 RT @kaidiablo: My dad always told my siblings and I to look at the good Castro has done &amp; respect it, but to never excuse or even forgive t… @Brackintology  world leaders always need finesse. Especially when trying to woo Cuba as a whole. RT @robcrilly: The president elect has just emailed me with details of his Black Friday deals https://t.co/7HQKlNjttD Such finesse. The presidential pivot is complete... https://t.co/X9IAzy0Ooe RT @RyanHolmquist: Castro: I will not die until America is destroyed\nTrump: I'm gonna be the president\nCastro: well then RT @DanAmira: Imagine the recount actually gives the election to Hillary. I'd get on a boat and sail into the ocean and stay there until th… @DanAmira I was about to tee the same thing. Just without the boat. Thank you so much for joining me at my book launch in London tonight. Such a warm and fun audience, I wish we could have stayed longer. Thanks @BBCBreakfast for having me on this morning and talking about #bornacrime https://t.co/qjYADsppDT @BrandoFurtado it's scary. I watched it when it came out. I told everyone at my show to watch it. I'm glad you're wearing the official uniform. See you all tonight! https://t.co/4sew4DXQE0 RT @thedailyvox: [ARCHIVES] Here’s a roundup of organisations that help those affected by GBV to kick off #16DaysOfActivism. https://t.co/I… London, tonight I'll be there! https://t.co/jNSOSgOSY9 Thanks for tuning in. I had fun. https://t.co/0zwEanFTkf @kthalps I agree he's been amazing. But voting is something I never take for granted. Maybe it's my country's history. @frannielyn79 thank you. I hope you enjoy it. @belgatherial again I'm terribly dream sorry. @AJCruz125 @ItsCurran thanks for the support guys. I'm glad you're enjoying the book. Happy Birthday! 🎉 https://t.co/lT4XAMyQlx @kthalps fighting? I just disagree with the notion that voting was useless because Hilary &amp; Trump are \"the same\". RT @penguinusa: We are always thankful for great stories! Find more books to read this holiday season: https://t.co/jd8t2oLoSg https://t.co… @bradleyzabel calm down. You're watching repeats. I'm in London. @RosskoKeniston yes it's available or should be on sale soon. 😄😄😄. Life will never be the same after Trump. https://t.co/ZAmTZJLyvo Jokes aside, thank you to the @nytimes and most importantly every single person who has allowed me the honour of sharing my story with you. Thank you again for having me on brother. Please tune in tonight. Tavis and I had a great conversation. https://t.co/yMHO3iQpDx @jhamtiger merry Christmas. And please pass my gratitude to your lovely wife! @jessyreneeh thank you for joining. I'm really having a great time meeting and learning from new people. Thank you for joining. @smaryyy hilarious😄 RT @smaryyy: Yo, TSA agent: when you're dumping out someone's bag, it's not the time to ask about @Trevornoah book...but yes, it's amazing.… I'm beyond excited to have my first book \"Born A Crime\"'on the failing @nytimes bestseller list. I never imagined this was possible. Sad! So this happened last night... @latelateshow @JKCorden @aaroneckhart https://t.co/bmjyd2bmE2 Thank you to everyone who came out in San Francisco to join in my book event. I enjoyed the conversations. ❤️ RT @NateMing: Local College Professor in Altercation with Alt-Right Serviceman https://t.co/fp0CyFvSYb RT @Kathleenelise00: @chrissyteigen @SethMacFarlane https://t.co/R9nmknBIRO @_paulxox thank you Paul. Yes, the same way your ex \"accidentally\" posts a picture of their new relationship to your timeline. https://t.co/bVpraqgddW RT @nadineajaka: .@DanielLombroso got exclusive video of Richard Spencer yelling \"Hail Trump!\" &amp; the crowd's Nazi salutes. Wow. https://t.c… Happy Thanksgiving. https://t.co/wXBA5vbL5y RT @mattdpearce: I'm gonna tweet this story out every time Trump tweets about Hamilton. https://t.co/MFHG0E13yI Thank you for joining. 🙌🏽 https://t.co/Jx3M5PJ7Z6 Yo UCA was on fire tonight. Thank you Bears for coming through. Hopefully there's a spot on the bench for me! https://t.co/wzJEZ2vy7R @LoriKovacevich sup Lori @ApolonTorq I'm still baffled by that. @SelestedeLaney of course. Send it to the Daily Show. The address is on the website. RT @Wolven: https://t.co/ENhfp3jmuQ @tomgara fun fact my Twitter isn't my job. We've done multiple episodes on the fake university on The Daily Show. @joeypurple yes sir. I'll be there in 2 weeks RT @mattdpearce: Why Donald Trump's conflicts of interest matter, as explained by Donald Trump and Alexander Hamilton: https://t.co/4KxOMaQ… Maybe soon America will also have its own Gupta family?\n\n#DonaldZuma #StateCapture #BusinessAsUnUsual https://t.co/mh1SDeXAC4 @word_alchemy thank you Becca, I'm thrilled you enjoyed it. @CHIMMYXIV @realDonaldTrump dude I'm counting down. Yo @realDonaldTrump. I think the Republicans are gonna try to impeach you so that they can give the presidency to Pence. Wow the audience at Hamilton booed so loud that the news didn't hear about Trump paying $25m to settle his fake university lawsuit. RT @EstherPerel: A great relationship is an imperfect one. @GQ_Spot @Lindo_Mnisi left hand drive, right hand drive. 😄 @CindiRight  If this is failure, then I can't wait for success. Ha ha nice try Mr China we know it's a hoax!\n#globalwarming #SantaInShorts #WeCanTotallyUndoThis https://t.co/MTsTgfMSVn @AuthorASKerr I'm not offended at all. We're not in a good place in the world, easier to attack each other. Thanks for supporting either way RT @Polidorable: Hopefully @mike_pence paid attention to Hamilton. As George Washington say, \"History has its eyes on you.\" https://t.co/Aj… Wow. Thank you Chelsea. This means the world to me. And thank you to everyone who went out and got the book.❤️ https://t.co/l0YiFf7Wof RT @summerbrennan: America right now. https://t.co/JDY9D6jiCV RT @AlecMacGillis: Q: \"What the hell do you have to lose?\" (Trump to black voters, August 19)\nA: The U.S. Department of Justice. \"If you travel to the U.S., You should let me know\"- Trump to Theresa May\n\nHomeboy conducting presidential business like a whatsapp chat RT @RyanSeacrest: had a great time with @KellyRipa and @Trevornoah on @LiveKelly this AM! https://t.co/ljuppCvOaL @ohmyccwebbie you just made my night. 🤗 Come see me tonight @BNUnionSquareNY for a #BornACrime discussion with Chris Jackson! Limited seats remaining! https://t.co/K5ARv4gsfd @fivefifths and he might end all corruption, barring one exception. 🙌🏽🙌🏽🙌🏽 https://t.co/52SPqKj1mK Next up the swimsuit competition... https://t.co/lYf8gr9057 RT @BNHarMar: Everyone come to the store and check out @TrevorNoah's new book! #bnharmar #newreleasetuesday https://t.co/DkwBjlLN5d RT @clarissarae13: @Trevornoah ok so i gave in...\nBy the way, your mom is the woman i aspire to be https://t.co/paZTuQvmOj RT @BenisaSon: One chapter in &amp; I'm hooked on #BornaCrime  Moving, insightful, funny. But @Trevornoah we gotta talk about the real deal #Je… @Thato_Mkk @Anele I appreciate that message so much. Thank you Thato. And thank you Anele. Thank you so much to everyone who pre-ordered my book &amp; all of you who went out and got it today. I'm thrilled to share my story with you. 🤗 The wait is over! Fetch your copy of #bornacrime available in-stores and online now! https://t.co/VKZEmlN9wK Limited seats remaining for tomorrow's event at the @92Y #bornacrime https://t.co/qvshUeRQxP https://t.co/1ECgYF9JTE Had a great time on @CBSThisMorning talking about #bornacrime Thanks @charlierose @GayleKing and @NorahODonnell for having me on! https://t.co/D86w0CfGnk RT @TheDailyShow: Tonight’s guests: @NateSilver538 and @AdrianGrenier! https://t.co/vvGHsdAF9C Catch me on @CBSThisMorning at 8:30am! I'm on the way @charlierose @GayleKing and @NorahODonnell s @fivefifths so you got exercise and information. God is good. @Mint_mulatto we should be able to disagree with those on our side too. I'm not demonizing just disagreeing with his voting comments. @EritreaStruggle the curse of Twitter is it's character limit. Maybe one day a meeting in person will enlighten us both. ✌ @sourlyfe neither my help you but what if one may be actively detrimental? RT @TheNewThinker: If you are losing friends because of this election fantastic. Now you have an opportunity to make friends who actually c… @Hibzx @SaidaRunThis @sartu_ahmed I've never \"bashed\" him from my desk. In fact I've supported him. I just don't agree with voter apathy. ✌ @SaidaRunThis @sartu_ahmed @Kaepernick7 flawed definitely but we cannot deny that some (tiny) progress has been made. Now we go backwards @sartu_ahmed @SaidaRunThis Kaepernick said he didn't vote because it was all the same. That's what I was referring to in my tweet to him. @sartu_ahmed @SaidaRunThis @Kaepernick7 Muslims, Immigrants people of colour- we're all in for an even tougher time than usual. 🌎 💔 @sartu_ahmed @SaidaRunThis @Kaepernick7 it's easy to undervalue the importance of a vote when you've never had it taken away. @sartu_ahmed @SaidaRunThis  when some people throw projectiles at the police, the police now have the justification to shut it down. @sartu_ahmed @SaidaRunThis @Kaepernick7 I've never scrutinized magnitude. My country's freedom was born from protest. This is amazing. Please read- https://t.co/FUWkBwKQte @TheGuruburu...the need for man to overcome oppression and violence without resorting to oppression and violence.\" @TheGuruburu Nonviolence is the answer to the crucial political and moral questions of our time... Talking with @CBSMMiller on @CBSSunday about #bornacrime today on @cbs https://t.co/ZUoDjVv8a0 @MeWeFree one candidate might not move you forward but you know the other will set you back- that's still a choice. @kbheld @Chi_Humanities thank you for joining. Our compassion is going to be put to the test like never before. @MeWeFree trust me I feel you but surely he understands his platform extends beyond just himself? He can affect so many future voters. @JessicaPritzker thank you so much for joining. I feel like we all know nothing but we can learn everything together. @MeWeFree Not knocking the good he's done but ppl are already trying everything to suppress the black vote, this thinking only helps them @MeWeFree the wrong President can harm so many more people than one person can help. It's not one or the other- a vote is also a protest. Then someone will make the choice for you. https://t.co/ZElKJMjl0H @arvywise touché Dear @Kaepernick7 sometimes there's no play that will definitely win you the game but you don't help anyone by sitting on the bench.  😕 Don't give Trump and the police who support him an excuse to shut you down. Protest peacefully. Remember the purpose of your rage. RT @GreatDismal: If you RT a lie, then learn it's false, de-RT it. In current climate of discourse, rigorous honesty is a subversive act RT @GreatDismal: Fascism isn't politics. Fascism is to politics as a Ponzi scheme is to investments RT @TheDailyShow: .@hasanminhaj on people who support Donald Trump despite his bigotry. https://t.co/GcLn0wgzME RT @harikunzru: Guess which president elect has shares in the Dakota Access Pipeline? https://t.co/PfpWG4uke0 RT @Rschooley: Relax, it's a perfectly normal thing for a leader to give governmental power to his adult sons. https://t.co/nhHBoQmD0p I could not have asked for a better audience to end this week with. Thank you Austin. \n(Insert longhorn emoji) Nes Classic- the memberberries strike again. Mission Complete... https://t.co/NdyYN4PpC9 RT @johnmurrays: 30 sec synopsis of his memoir #BornaCrime from comedian &amp; #TheDailyShow host @Trevornoah, out 17th Nov. https://t.co/uW7Je… @TomBeerBooks @Newsday I appreciate that. Thank you. RT @TomBeerBooks: I'm not a fan of celebrity memoirs, but @Trevornoah has a real story to tell and tells it well. On BORN A CRIME: https://… Please read this... https://t.co/BMY5HkXbwq The wizarding world after Voldemort returned...that's how it feels in the streets. Thank you to everyone at #INBOUND16. Thank you for letting me share a moment with you. Aaaaaand he's back! https://t.co/vdxy30Z8n7 RT @92Y: \"I was nearly 6 when Mandela was released, 10 before democracy finally came…\" More from Trevor Noah @92Y Nov 15 https://t.co/9a2an… RT @ImranGarda: Just like my country but the other way around. https://t.co/IJPVYvrBmN RT @LuxListingsNYC: .@Trevornoah impossible success\nhttps://t.co/Y14NCfMr3e https://t.co/IFqHrlKk08 Did someone just shout \"Kill Obama\"?\n😳 This is like a sketch. Chris Christie is the guy who invested in Apple stock when it was still 5 dollars. I'm stunned.\n#ElectionNight #Election2016 I know Americans don't use this phrase but this is totally squeaky bum time.\n\n#ElectionNight 5 steps forward. 10 steps back. Thank you @theskimm for being this interested in my mornings! https://t.co/g5OMYxuMXS Pick your color! @TheDailyShow @Snapchat filter! https://t.co/2ZNe6zaYNu Did you check out @TheDailyShow filter on @snapchat? Let me see your snaps! #ElectionDay Just one problem with that... Trump himself wouldn't be able to vote, much less run for president.\n#Drumpf https://t.co/GQu8cF85ps RT @anthonyanderson: My daughter voted in her first election today. So proud to stand with her as she made a difference in her future! #vot… When I woke up this morning I thought \"there aren't enough videos of Racist, sexist, homophobic people.\" Then this- https://t.co/J7skb2Hb1Q Donald Trump has ruined red caps. RT @michaelianblack: Time and again we learn the truth about Hillary is never as bad as they say and the truth about Trump is always worse. RT @Travon: Remember tonight to set your clock back 60 minutes and if you're a Trump supporter set your calendar back 60 Years. \"In conversation\" a special event @92Y in NYC on 11/15! Each ticket comes with a signed copy of #bornacrime Tickets: https://t.co/hNRVOyMYnB @abouttjim @TheRoot welcome to the internet. RT @RaysFanGio: 2016 World Series. \n\nCubs vs Indians\n\nAnd then the world will end with  the score tied in game seven in extra innings  #apo… RT @adribbleofink: Remember when it looked like the Cubs were for sure going to win the World series a few hours ago and everyone got cocky… @Boston3346 success! @germanrlopez or it will just have begun. Dun dun duuuuuun 🎃 👻 Win #bornacrime b4 u can buy it! Go 2 https://t.co/OCUM8lq7ua &amp; click on the envelope 2 join the mailing list. 3 people will win! Good luck! https://t.co/YYMBSNlDqj RT @bcrypt: confirmed that Facebook lets me exclude black, asian, and hispanic people from seeing my ads. why can't i exclude white people?… San Antonio- Tonight at the Tobin was magic. Thank you for a special night of warmth and funny. https://t.co/7zrxtJh1oe @DanAmira that's racist @jessica_georgo get to tweeting. Let's do this! 😄 And I've binged on Bbq to prepare for San Antonio. Gonna be a fun show tonight at the Tobin Center see you there! https://t.co/ZFhCS7uJaa @GaveDames @AmericanAir tweet them now. We can all practice authentic interactions. RT @eveewing: Hamlet is about a rich, Danish prince whose father is a ghost. But here's why it relates to everyone. https://t.co/BQxkkzn5j2 RT @mattmfm: Case of voter fraud in Iowa, but:\n1) It was caught. \n2) It was the first in local memory. \n3) It was a Trump voter.\nhttps://t.… RT @ditzkoff: Anthony Weiner coming back into the 2016 election narrative like https://t.co/evdwqG6Sif I had such a great time. Thank you again for having me. https://t.co/omEjZjWM6b RT @DLin71: PENCE: I’m a man of faith. If it’s wrong to help Trump become President, then God will tell me.\n\nGOD: https://t.co/3mJIhAhPCc Thank you #sfsummit not just for a great conversation but also for allowing me to meet some of the most amazing minds. Except Chris! RT @TheDailyShow: That man standing behind Donald Trump, he is a doctor. https://t.co/ToNvItNLSa RT @nytimes: Trevor Noah: \"My mother refused to be bound by ridiculous ideas of what black people couldn’t or shouldn’t do.\" https://t.co/E… Congratulations @bonang_m @NomzamoMbatha &amp; @yemialadee Have an amazing night at #MTVMAMA2016 Wish I could be there with you @MTVBaseAfrica https://t.co/RkrL6dIAiw Thank you for all of the get well messages. I am so sorry to have to miss #MTVMAMA2016 @MTVBaseAfrica https://t.co/pGQoIZq5kN So sorry everyone...Please read below, far too much to tweet. #MTVMAMA2016 @MTVBaseAfrica @MTVBaseSouth https://t.co/hPzpbvqWbC Donald Trump is doing that thing where his eyes are his mouth again. https://t.co/FE4rzNTQvW Thank you @GQMagazine (Even Though It's Awkward) https://t.co/OyybhPdBWY RT @gregorybrothers: Trump REALLY stepped up his debate prep! Can't believe he time-traveled to 1980 Republican Primary to Crush Reagan and… RT @UzoAduba: Worked on my game face for the ever brilliant @Trevornoah and @TheDailyShow on tonight. Had a blast. Ok, back to game-facing.… RT @gdnmembers: Spend an evening with Trevor Noah, host of one of America's biggest political comedy shows on 26 Nov\n\nhttps://t.co/61lxfSlH… RT @UncleRUSH: Appearing on @thedailyshow w @trevornoah to talk about #MASO, Trumps crazy ass, and the All Def Roasts America on Election N… RT @TheDailyShow: Trump supporters have broken CNN. https://t.co/z6iEe1FtNW Join me live in conversation @CentralHall in London for the launch of my book #bornacrime Tickets &amp; Information: https://t.co/AlCnZLX7U3 https://t.co/IlTkiDPy5l Thank you LA. Last night at the Dolby Theatre was out of this world. https://t.co/BvcFQ0IVit RT @saletan: I love these lectures that women molested by Trump should have spoken up earlier, from Republicans who lack the guts to stand… @bruce6620 @TheDailyShow @hulu save me some ice cream! Phoenix Arizona- what a fun show and a great crowd. Thank you for coming through, hope we can all go for a jog tomorrow!🏃🏽☀️📹 @sutherland604 dude c'mon. I worked all my life on my African accent. I hate how people make this seem simple. Just because Donald Trump said he did it &amp; women also said he did it doesn't mean it's true. @trashgaryen you should have said hi. @mattyglesias translation: Is Trump who he says he is? RT @TheDailyShow: Have Donald Trump’s misogynistic comments hurt his reputation? @jordanklepper went to a Trump rally to find out. https://… RT @Jidenna: Swankin' on @TheDailyShow with @Trevornoah. Tune in tonight 11PM ET on @ComedyCentral https://t.co/IQOhLHy4QL @kaitdrake2 then we're doing something right 😉. Thanks for your support! Yes sir indeed I do. See you in Phoenix on Friday! https://t.co/BZQGjjNmpz RT @TheDailyShow: The cast of the GOP Titanic, America’s sinking ship. #GOPTitanic. https://t.co/ei9lPbmbxa 😄 \"Drake sprained his ankle falling for Rihanna\"- @Anele RT @TheDailyShow: Donald Trump in 2010: “This is my boardroom. It's not a locker room. Maria, you’re fired.” ¯\\_(ツ)_/¯ https://t.co/UlsP9Xj… @Jonathan_Witt or imagine a country so divided it doesn't care about the truth it only cares about sides. RT @BayoumiMoustafa: I'm a Muslim, and I would like to report a crazy man threatening a woman on a stage in Missouri.  #debate Is Martha Raddatz winning this debate? RT @tonyschwartz: Trump's plans to bring up Bill Clinton's infidelities reminds me that while I was writing Art of the Deal he was openly c… Ready to hit the stage at the University of Rochester. I've got a mic a stage and a yellow jacket. Let's do this. \n\n#URMW16 People please! Just because Trump has said and done these things all his life doesn't mean that's who he is.\n\n#pussygate #TrumpTapes RT @JohnFugelsang: Nice to see Hillary Clinton haters  praise Melania Trump for forgiving her husband &amp; keeping her family together. RT @billpruitt: As a producer on seasons 1 &amp; 2 of #theapprentice I assure you: when it comes to the #trumptapes there are far worse. #justt… RT @Travon: The signs were always there. We just had to look. https://t.co/BqyESsDHQt Phoenix Arizona is gonna be a blast next week. It's my first time doing a show out there. 🌵 https://t.co/zsw3ddAtZI Wrong!!!😄😄😄. Good times in DC. https://t.co/jdG70yhbB7 Yo can I just say that last night in D.C. was one of the most epic nights of my life. Both shows at the Kennedy center. Thank you all! https://t.co/1MDlG0xISv New York City. November 5. It's on! https://t.co/p4AvwfArL1 @eliothochberg @ucbcomedy @cwwhoseline @PhilHendrieShow you're messing with me right? You know I was joking?! As soon as Trump loses, GOP are gonna act like they were hostages &amp; never liked him- \"We couldn't do anything, he grabbed us by the pussy\" https://t.co/l0dqdZNgEs RT @TheDailyShow: .@RonnyChieng responds to Fox’s racist China segment. https://t.co/dyX8pnl5SR https://t.co/UxvC0vHYcw RT @Snowden: Wow, @TheIntercept just dropped a four-part series exposing a criminal gang operating inside the @Chicago_Police. https://t.co… Wishing @TheDesmondTutu a very happy 85th birthday! Congratulations on The Book of Joy! #sharethejoy https://t.co/t9PwTzzJmY Hanging with @carmeloanthony tonight on @TheDailyShow @ComedyCentral https://t.co/JSZHA8me90 I'm coming for you Los Angeles!  Oct 15th @DolbyTheatre! Tickets available  @Ticketmaster\n https://t.co/7i6yduLkN2 This cover's just for you Southern Africa! Available 15 November #bornacrime https://t.co/SPsTxM10Wu @TatsNkonzo i loved Generations! @joshgondelman yeah great meeting you and Jeff last night. See you again soon hopefully. @jordanklepper The picture is too complicated for you to understand and it will detract from me making comedy great again! Geez 😂😂😂 just watched the snl debate sketch! @AlecBaldwin #KateMcKinnon and #MichaelChe crushed it!\n\nhttps://t.co/xJa9GncQLy @jordanklepper ha ha you spoke too soon klepper. At least 300 people showed up! #winning I could not have asked for a better audience in Denver tonight. Thank you to everyone who came out and shared the night with me. 🙌🏽 Wow, people are really excited to see a mixed race superstar perform in Denver tonight...and @Drake's here too. 🤗 RT @mughalbha: At a funeral.....\n\nA visitor: What's the WiFi password here?\n\nPriest: Respect the dead\n\nVisitor: All small letters ?... Touchdown Denver. Hope you're ready for the show tonight. I'm in the mountains hiking but I'll… https://t.co/34gMyZ9c5j @bubbsmama life it's always happening to us but we choose how to feel about it. Hope you have a great day. Thanks Denise. @jacqua83 wow it's real. I hope you enjoy the book. RT @512areaATX: @TrevorNoah is appearing in Austin, TX Nov 11th @bassconcerthall Grab your tix now! This will sell out!  https://t.co/JiaKl… @TronAlan1 jokes on you. I don't wear underwear. @JustALilLost thank you. I hope you enjoy it. @TheTeacher26 wow. Thanks for making the journey Andrew. I had a great time with you. @elwaysdad oh snap. Happy Birthday. One more year till you can drink in Europe! Thank you Portland for such a fun night. Now I'm gonna walk around the park naked. \n\n#GoodTimes RT @DamienFahey: Once we elect the next president, the Internet should be turned off for six months. Ok Portland. Let's do this!\n#ComedyTime https://t.co/CATizLh3u3 @mattyglesias @jbouie maybe Facebook thinks Jamelle can be swayed? #BernieOrBust 🙈 RT @iJesseWilliams: People worked very hard, for a very long time, to keep you from voting. Don't shut up. VOTE. https://t.co/jMrqCxeJVK #V… RT @Alex_Edelman: \"I never said climate change was a hoax.\" #debatenight https://t.co/S9RMuZRpkj RT @JordynTaylorNow: The next episode of My 400lb Life: I hacked into the DNC @ShaunKing so every model of car overheats? Both the suv's and the sedans? RT @VICE: Trevor Noah doesn't care if he's making \"too many black jokes\": https://t.co/TD2VNdJfws https://t.co/n1SWWW4krp RT @bazecraze: If you don't think Trump can win, just remember that wrestling got more popular once people found out it was fake. @smellykadd Angelo Lozada Merci Montreal. Thank you for filling this beautiful theater with your energy and laughter. https://t.co/nSYHZINaab @moshekasher shut up Moshe. We don't care about who she actually is we care about who we think she is based on who we think she was! RT @adv_project: This school replaced detention with meditation. The results are stunning. #EndSchool2Prison https://t.co/R6zLLvdh3U @RichardCrouse such a pleasure. Let's do it again for sure! RT @NYDailyNews: Georgia cop Sherry Hall fired for lying about being shot by a black male suspect https://t.co/LpcbaQT9xH https://t.co/QlSP… @kathymacdermid I will work to be better. Thank you😄 RT @leblancers: As much as I enjoyed @Trevornoah's stand-up at the festival last year, this morning's #ComedyCon event was an absolute trea… RT @JFL42: In Conversation with @Trevornoah at @SecondCityTO     11am this morning. Check it out on fb live. #jfl42 RT @RichardCrouse: About to host a JFL42 on-stage interview with @Trevornoah. Any questions for the Daily Show host? RT @spexontoronto: Wow, @therealroseanne @Trevornoah &amp; @margaretcho are performing tonight for @JFL42. More comedy to come as this festival… Does this mean Ted Cruz's dad did kill JFK? @kashishmusic @ATSLDating i hear what you're saying but am I really \"bringing attention\" to someone with 65 million views? @TomiLahren you just made my day. See you soon! RT @HeforShe: \"He said YES!!\" @JustinTrudeau becomes inaugural #HeForShe Champion for Youth with @EmWatson and @Trevornoah https://t.co/Uub… RT @billmaher: #Trump saying \"I called it\" about the NY/NJ bombing: Donald Trump is the only person besides terrorists who claims credit fo… I think Cersei did it.\n#DesignatedSurvivor RT @TheDailyShow: .@JordanKlepper goes to a Trump rally to uncover the hottest new conspiracy theories around Hillary Clinton and President… Guess who's hosting the @MTVbaseAfrica #MTVMAMA2016 See you 22 October in my hometown Johannesburg! https://t.co/IwKWFWrejP RT @Becauseofthem: Something to brighten up your day: An adorable little girl encouraging her Dad while he tries to do her hair. ❤️ https:/… @annshoket @EmWatson @HeforShe I know the feeling. I ditched the car and walked to the venue. Thank you @EmWatson and everyone at @HeforShe for the amazing work you've been doing over the past two years. Here's to many more! 🙌🏽🙌🏽🙌🏽 https://t.co/5650T4jFA6 Do you know about @HeForShe ? Tune in for the live stream tonight at 7pm EST: https://t.co/kiK5t7kSAB #HeForShe https://t.co/mE3j514Myg RT @TheDailyShow: This week! @nickjonas @BenSchnetzer @jeffreytambor @WendyWilliams @lisaling https://t.co/yjkuzszpTB .@jimmykimmel killed it at the #Emmys 🙌🏽🙌🏽🙌🏽 such a fun show. Congrats to Oliver and Key&amp;Peele my fav shows. RT @DLin71: DE BLASIO: No evidence of terrorism\nTRUMP: ISIS has captured Times Square\nD: Be careful of speculation\nT: The Disney Store is n… .@mcuban: I'll donate $10 million to charity if Trump can explain his own policies https://t.co/hnL9Di6mD6 # via @HuffPostPol RT @ddale8: Donald Trump just did a speech in Miami. He said eight false things. https://t.co/DSKMHOyHpK RT @Lin_Manuel: Tweeting≠voting.\nPosting a video≠voting.\nYour essay on FB≠voting.\nIf you CAN vote and you don't?\nYou've done nothing.\n#Vote @dori @TheDailyShow you're right. We need to do better. 😉 RT @TheDailyShow: Tonight! President @billclinton discusses the merits of experience vs being an outsider in a presidential candidate. http… RT @TheDailyShow: Tonight on The Daily Show: Former President @BillClinton is here! https://t.co/koPCB1ONnV Wow cover of @TIME magazine and we look so pretty. https://t.co/ab7pEjM4xc Backstage @colbertlateshow with one of my favourite NBA players of all time @alleniverson. We… https://t.co/KwTzAWR0XS 😉 Backstage at @colbertlateshow ... Namaste! #LSSC https://t.co/1UptS47Axe RT @colbertlateshow: Tonight on #LSSC! @Trevornoah and @alleniverson! Plus, @ChrisGethard sells out and goes network. https://t.co/vOcWTQPe… RT @theskimm: Brb, freaking out. We went on @TheDailyShow to talk #SkimmLife and registering to vote. Watch us at 11pmET tonight. https://t… Hanging out with @StephenAtHome tomorrow night on @colbertlateshow https://t.co/TrnDCPHGpk @fivefifths but they sound amazing. RT @openculture: Garry Trudeau's Doonesbury imagines a Trump candidacy back in 1999. And nails it.\nYou're sheep!” https://t.co/XQUg9pvss8 I was having just a much fun on stage. Thank you🤗 https://t.co/KSV1WvzCJD Madison I am grateful to you for your wonderful energy. Wow. That was fun. Good luck for the ironman tomorrow!\n🏃 🚲 🏊 RT @realjeffreyross: One hour till the premiere of #jeffrossroastscops starring The Boston Police Department @ComedyCentral. @sarahilliger @emma_stutzmn my pleasure @emma_stutzmn @sarahilliger two tickets waiting for you at the box office. Tell them it's for pizza girls. @danielradosh @dannyboi965 these misquotes are killing us. RT @chrissyteigen: Wow. How...what's the word? Dep....deplor...deplor something  https://t.co/0RjNWhugzx @DanAmira or the polls move because they're sampling different people @Abantu_ it's such a pity that it's during the week. I could have tried to do a weekend. @DonMampeezy eish if you can help me spell it you'll make my day! @MABSportPsych thank you for coming. No regrets we'll always have next time. 😂😂😂😂😂😂😂😂😂 https://t.co/fzM6CV35mS @kelseybonnet priceless!🙌🏽🙌🏽🙌🏽🙌🏽 @Kwezilomso_ ngisazobona @bunny_niko yes but Zulu, Tswana and Tsonga I learned from the streets. @SineQhayiya_SQ @SAR_S and translate from Zulu to English. Mina I learned half my vernac from Supatsela High- Izokuhlephul' insangu 😄\n\n#PapaAction #Hazel #Chester #YizoYizo https://t.co/Qu2UE1SCkp @ItsVila_B0ngz Vele! @moshekasher I knew you would! Ngiyazama Sine. Zonke izilimi zase South Africa zisesenhliziyweni yami. ❤️. Kodwa angikho perfect 😉 https://t.co/a08t1RecLO Ha ha Nomsa. Angithi ngiya sebenza? Ngisazobuya. 2017 I'm planning a massive show back home.\n\n#khumbulekhaya  https://t.co/urZfeTTpSk @TillyTweets Cmon Chris. It's the same way we'll have on a movie star as a guest. We talked social action not roasting techniques. @Eesaamanutd happy birthday ma se kind🎉 RT @ZeddRebel: Just a weeeeeeeeeeeee bit of context for everyone freaking out that Hillary said Trump's supported by fascist bigots https:/… @mygs22mygs if a Pokemon uses psychic attacks and specialises in hunting ghost types, I'm gonna call it psychic😜 @fancie_face lol that's not fair Psyduck was my opening act. I like a psychic Pokemon to get into the audience's heads. https://t.co/gHzbAhPyyP @TessahDolata I took pictures outside. You should have come through. RT @mollyjasinski: Unforeseen side effect of attending @Trevornoah's show: Laughed hard enough that I lost my voice. This is why I do what I do. ❤️ https://t.co/p5J2o7XRHt Happy Birthday again. Thanks for sharing it with me.🎉 https://t.co/m48rjcqczO Thank you so much. Milwaukee was fun and the city is really beautiful. I'll come back and we'll be friends! https://t.co/yW2THCzMIQ Hanging out backstage pre show in Milwaukee. It's gonna be a fun night. https://t.co/AuHi3AH3bv RT @ddale8: HAHAHA. The Trump campaign just quoted my tweet as praise: https://t.co/nEUo1u4Lp4 I love American football but last night the way Cam Newton kept getting hit in the head made me uncomfortable. @_Chris_Delaney no. We needed to seat her where the camera wouldn't block her view. Thanks for watching. 2nd show added @BeaconTheatre ! #NYCF Pre-sale starts now with promo code: 2FNYCF https://t.co/ucltjJI0xd https://t.co/Jv63CpVC1T @girls4ronpaul @hasanminhaj @iambrittania for you, I keep doing what I'm doing. Thank you! Born A Crime: Stories from a South African Childhood on sale November 15! Info @ https://t.co/OCUM8lq7ua #BornaCrime https://t.co/tCN0FIIKeR Ann Coulter's face is making this show. 😄😄😄\n\n#LoweRoast @yerkaproject hi. How do I get updates on an order? This is so smooth I thought the video was looping! https://t.co/LUp19EhGau RT @brianstelter: Here's the stat I just shared on TV: Trump's site has 9,000 words of policy proposals. Clinton's site: 112,735 words http… RT @paulkrugman: True fact: I was reluctant to write today's col because I knew journos would hate it. But it felt like a moral duty https:… RT @MaggieJordanACN: Take a couple of minutes to watch.\nFormer CNN host Soledad O'Brien tells CNN: \"You have normalized\" White Supremacy\nht… RT @Travon: When the landlord shows up because the rent on the church building is two days late. https://t.co/7ZCnty1pEO RT @junkyardmessiah: Is this an ad for #MrRobotSeason3 or #AmericanPsychotheMusical? https://t.co/8kxxaPMauB RT @jordanklepper: Hmmmm. Wouldn't the most appropriate Paterno gesture be staying silent for decades? https://t.co/T2x1rgAEfz RT @ImranGarda: When you see someone trying to flag down your cab until they realize you're already sitting at the back. https://t.co/im4z1… We're doing this! Melbourne two nights. See you there. https://t.co/dVt9QBWGrS RT @cmclymer: Don't use my service--or that of any veteran--to justify the silencing of black Americans. Not on my watch. \n\n#VeteransForKae… RT @brownlashon: if you haven't served, don't speak on my behalf   #VeteransForKaepernick https://t.co/30AtfIvaRI @germanrlopez it's probably like working on the trump campaign.. RT @aliciakeys: Y'all, me choosing to be makeup free doesn't mean I'm anti-makeup. Do you! 😘😘 https://t.co/Mg0Ug9YA9q @germanrlopez oh that reminds me, Eli is waiting for you at mother base. He wants another rematch. \n\nAnd the Kikongo staff are sick again. @germanrlopez because all your time was taken up by mgs5 and it's corporate mother base side game.\n\"R&amp;d unit leveled up\" I am, if you're in Sydney. https://t.co/r2OSl4SeQN Yesterday the woman from housekeeping walked in on me naked in the bathroom. Now whenever she sees me she giggles. Good or bad? RT @johntabin: \"Alt-right alt-right alt-right\" –Racist Matthew McConaughey @Travon then count me in! Mr worldwide baby!!! RT @emrata: True https://t.co/yR8H2fl3g6 RT @jk_rowling: So Sarkozy calls the burkini a 'provocation.' Whether women cover or uncover their bodies, seems we're always, always 'aski… RT @ImranGarda: Speedo no longer providing cover for dicks.  https://t.co/tyQcdCfDKQ RT @johnlegend: #ExtremeVetting Trump supporters per @realDonaldTrump's guidelines: https://t.co/bhSpva1i0m @bblboy54 that was never my intention. You're not screwed but the 2 party system doesn't help. RT @ImranGarda: Let's share ideas, not bark at each other from behind our insecurities. And not everyone who disagrees with u is trolling u… @fivefifths DUDE! that was my favourite of all time. But they never remade it for another platform. Frank Ocean makes me feel like my senses have been dulled all my life and only now I'm experiencing things for the first time. #Blonde We are very proud Caster, Very proud.\n\n#Caster4Gold  https://t.co/cP0YLms5Es RT @TheDailyShow: Daily Show writers share their favorite moments from the Summer Games. https://t.co/ddUz1mWRgC\nhttps://t.co/G0ZkE2jyQm @michelleisawolf or a show about a group of vets who dress like Guy Fieri and go around spading people's cats. @michelleisawolf I'm just trying to fit in before that wall gets built. #AmericanValues #ExtremeVetting @michelleisawolf those aren't your children, and the court told you to stay away from them. The show in Saratoga was one of my all time favorites. Venue, audience, atmosphere: everything was perfect Thank you https://t.co/Ex5YZAJASx @michelleisawolf don't work too much. RT @Lina_Serene: There was also a girl.And a boy. And another girl. And several thousand other girls and boys. #TheOtherOmrans #Syria https… I don't know if I'm headed to a comedy show or a wine tasting. Either way this place is gorgeous. See you soon. https://t.co/LmF4hpxbCu RT @TheDailyShow: Trump is calling for “extreme vetting” of immigrants. Can his own supporters pass the test? https://t.co/EURoHVGdXQ https… RT @GuyEndoreKaiser: A disaster condemned by the whole world that even the people who voted for it now regret? https://t.co/d3acgZk7o7 RT @HotNewHipHop: .@KingJames gave @Trevornoah some details about his upcoming show \"Cleveland Hustles\"\n\nWATCH https://t.co/naDjkaauff http… Honestly @KingJames is one of the most amazing human beings I've ever had the pleasure of meeting.  https://t.co/gqSKMN760O RT @TheDailyShow: Tonight: @NBA Superstar @KingJames is here! https://t.co/76hhYLrsGd RT @karenehowell: When you have a 🔥 tweet but remember your boss follows you on Twitter. https://t.co/5x11uXufWL RT @jk_rowling: The existence of Twitter is forever validated by the following exchange. https://t.co/f3TciHPFFh Every month is the hottest month in history. What's your point? ;) https://t.co/pSLcebaJmG Performing stand up comedy in N.Y. Is a dream. So to be a part of the New York Comedy festival is an honour- tickets https://t.co/ZCHZYjgJkI @OhSnapVince 😄 I don't work at the comedy central offices. But the imagery was funny. They still have a segway cameraman next to Bolt?! They don't learn. Wherever he is right now, Fikile Mbalula is break dancing.\n\n#vanNiekerk #WorldRecord #Olympics Halala Van Niekerk!!!!\n\nUnbelievable🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾 RT @davidkibuuka: Arsenal vs Liverpool today or as some would call it \"Excuses FC vs Excuses FC\" #ArsvLiv @InRSoul247 my man! The only way I think you could improve the individual medley is if swimmers could do the strokes in any order. #Rio2016 #olympicswimming So I'm assuming you're pro my idea?! https://t.co/W1vXYcjCZ0 @DanAmira i don't think that's murder. They drowned.😢 @DanAmira similar to track? Why are you aquaphobic? Los Angeles I'm excited to announce my show at the Dolby Theatre. \nSaturday October 15th.\n(I will bring water)\n\nhttps://t.co/Nks9ZXRuCM I'm inspired by backstroke at the Olympics. Why don't we also make the sprinters run backwards in track? RT @michaeldweiss: Spoke to Syrian rebel yesterday. \"All jihadis here want Trump to win.\" Why? \"Because he will destroy America before they… RT @FRESHSpeakers: Watch author @mychalsmith on @TheDailyShow w/ @Trevornoah at 11pm ET tonight. Got the whole world watching. https://t.co… RT @blackvoices: Look, black people aren’t lying about police violence https://t.co/lTRdZffJDP https://t.co/UPVvqi1z2T @MediaMktgGuy I'm following the smell of bagels... @NicoleRSchack thank you for coming out. Jamestown was the best audience! Thank you for coming to the show. So much fun.\n#LucyComedyFest  https://t.co/1etOZf1Qv7 RT @DLin71: The relationship between Republicans and Trump https://t.co/uklTq2CFGj Relationship Goals https://t.co/vmJF3Q9mep RT @DanMentos: holy shit https://t.co/obC4NIkylk RT @jimmycarr: If you're going to the Edinburgh festival this year don't miss Michelle Wolf. She's as funny as funny gets. https://t.co/26r… RT @Morning_Joe: WATCH: Trump claims 'no relationship' with Putin... Here's what Trump has actually said in the past. https://t.co/uBPWh2iD… RT @ELHAE: Frank Ocean is the mewtwo of the real world. RT @SeanMcElwee: get you a feckless florida man who can do both https://t.co/bnL0ZrovXv RT @johnlegend: NC GOP researched how black people voted then targeted the law to discourage black people from voting #racism https://t.co/… @jordanklepper so he'd help you get 2 more kids? @DamienFahey well now you've got the power to turn back time so you can do something about it. RT @jayrosen_nyu: How we handled the asymmetry between major party candidates in 2016. Years from now, journalists will look back on that d… RT @SethMacFarlane: This. https://t.co/wp5ApescHq @judypu1 you're right my opinion is of no value. I'm just listening to the fbi and the justice department. I'm not gonna front, I would also steal Michelle's speech.\n\n#Goosebumps #DemsInPhilly 🙌🏽🙌🏽🙌🏽🙌🏽 @jbouie your feed is my favourite by far. @AnnvanAswegen1 @ScottAdamsSays I agree! He's a genius. @DMansini @VegasJessie I've learned there's very little attention paid to local and yet that's where a lot of power exists to enact change. @DMansini @VegasJessie I agree, processes can and should always be improved. @TadiwaYoungStan Julius is smarter than Trump. @DMansini @VegasJessie I'm not saying it would solve the problem. But a two party system doesn't help the problem. @VegasJessie are you implying there's no spectrum? A socialist is a Democrat? Or a nativist is a Republican? By Trump's \"logic\", the USA should also be banned from itself. https://t.co/uljnGRwYUm @JohnLeguizamo thank you my brother. The Daily Show - When Was America Great? https://t.co/ao10Mw2mTB @germanrlopez that's the greatest thing I've ever seen in my life! @rembert this is why people have lost faith in establishment politics. We need change! RT @wkamaubell: \"One glass ceiling at a time everybody.\" 😃\n\nHillary Clinton in a group text to Cory Booker, Julian Castro, Elizabeth Warren @rembert please tell me what hatches from that 10k egg. @germanrlopez I've never questioned your journalism before this list. Definitely biased media! We need to discuss. Why does this Pokemon make me uncomfortable? https://t.co/ccgkkDqo3L @theskimm anytime. Let's make it happen. RT @Splitsider: .@jordanklepper investigates Trump's Christianity at the RNC on @TheDailyShow https://t.co/Gbkwx5zw9c https://t.co/zJTRSSwr… Happy birthday to @theskimm. One of the best things young people can do to their inbox.\n🎉🎉🎉 @jbouie maybe they admire your bravery. @germanrlopez what if you've actually been dreaming all along and this is reality?\n\n#RedPill So excited for Canada and Europe getting #PokemonGO. Now we can all share in our disdain of the @NianticLabs servers. We're back on Tuesday. Moving the show (and our riot gear) to Cleveland for the convention. https://t.co/nPStcHzPv5 RT @DanAmira: When Donald Trump calls your wife ugly and accuses your dad of killing JFK and you speak at his convention anyway https://t.c… Amazing people who've dedicated their lives to making other people's lives better. Inspiring\n#TheVenture @TheVenture https://t.co/B3KH8T1Nau Maybe Donald Trump is a Magikarp to us and Paul Ryan is just trying to get enough candies to turn him into a Gyarados.\n#PokemonGO #Trump2016 RT @ConorMaynard: It's crazy how many R&amp;B Classics fit over Drake's 'Controlla'\nHave a listen 🙌🏻🙌🏻🙌🏻 https://t.co/j3xbJhfWkx \"No ma'am, I was not taking video of your child, I came to this park to catch Pokemon.\"\n\n#PokemonGO @chrissyteigen Pokemon are like std's you're never too old to catch them. RT @voxdotcom: Vox first person: \"I'm a black ex-cop, and this is the real truth about race and policing.\" https://t.co/dlFP0xhExI RT @RepRamonRomero: Make no mistake the @DallasPD officers were assisting and supporting those peaceful protesters. Those snipers are terro… @svfd_242 @rightojibwe we're all seeking truth. Unfortunately those numbers are false. Here's the fbi real facts. https://t.co/BU1ptUUnmn @shereeny i hear you but I'm only assuming that this will change the conversation away from what is was meant to be. @Mr_MITCHELL_2_U President speaking to the problem, people of all races marching, the right conversation starting. One step forward, ten steps back. The point is to save lives not trade places. 💔 https://t.co/46Nfg4VyUm @WorldFamous also some may never come to the show &amp; share a piece of their view if they believe they have to choose between work &amp; a cause. @WorldFamous I understand where you're coming from but also understand that people are on the show promoting their work. We all seem to want the same thing and yet the only way we know how to get it is by taking it away from someone else. RT @JimGaffigan: Tonight I'm on @TheDailyShow with the great @Trevornoah.  I'm the guy on the left.  I think. https://t.co/8F9o1vMMZu RT @TheDailyShow: Tonight! @JimGaffigan https://t.co/2wNVsbcG9Z @SQ_Ngcobo we can come back from 3-0. In my house when you're down 4-0 you have to pass the control. Game over.\n\n#FRAISL #EURO2016 RT @TheDailyShow: Tonight at 11/10c. @msjwilly's final appearance! #cryingemoji #jwillennium https://t.co/2Bdndjpmnw RT @trpressoffice: Today's most meaningful statement came from @iyad_elbaghdadi. Thank you Iyad. You briefed very well. #istanbul https://t… RT @jordanklepper: Tonight on @TheDailyShow I return to Illinois to check in on that cheddar. Aka money aka the budget aka please give up t… RT @TWAwards: Watch TWA winner @CynthiaEriVo's appearance on @TheDailyShow with @Trevornoah https://t.co/etuCCS73CW I was trying to take a picture for you and you just wouldn't listen. Ps get ready to hear from my dream lawyers. https://t.co/QiCzL5OfHf RT @TheDailyShow: Trevor talks Brexit, @roywoodjr breaks down Jesse Williams's speech at the BET Awards &amp; @CynthiaEriVo stops by. https://t… RT @TheDailyShow: This week! @CynthiaEriVo, Calvin Trillin, @LaverneCox, @CKlosterman https://t.co/cxwTwcO4Fx @MarshmallowKhan yes. It's long overdue. Thank you for joining us. I enjoyed being an audience member just as much as you did! https://t.co/asQynK9cQ4 Lmao asshole😄😄😄 https://t.co/P1bzkwJtWt RT @TheDailyShow: Tonight! The Daily Show Stand-Up in the Park at Central Park’s Summer Stage. Doors open at 7pm. FREE! @Travon damn. It must be nice... RT @kim: SUMMERSTAGE - Comedy June 26: Trevor Noah, Ronny Chieng &amp; squad https://t.co/Tet5LRtO7A @ComedyCentral #DailyShow https://t.co/h8R… @Travon dude I didn't die you just couldn't hear the laughter because of the acoustics in the room. This ref is acting like his whistle is battery powered and he doesn't want to waste it. I like it!\n\n#CROPOR #EURO2016 Croatia's anthem sounds like the extended version of the champions league song.\n#CROPOR #EURO2016 Wouldn't it be interesting if now Scotland voted to leave the U.K. and then joined the EU. They've got the oil! It's so funny that Britain is the same nation that spent all it's time convincing colonies not to leave because \"strength in unity\". RT @NazhatA: DISAPPOINTED WITH RESULT oh well at least we have £350billion to spend on NHS.  Oh wait..thats a lie!  #EURefResults https://t… RT @EmmaKennedy: In two hours the UK economy has lost $350 BILLION. That’s equivalent to 40 years of EU contributions. RT @LauraTopham: Leave voter on BBC: \"I'm shocked &amp; worried. I voted Leave but didn't think my vote would count - I never thought it would… RT @Bipartisanism: They kill our daddies then make fun of us for being fatherless. \n#FreddieGray https://t.co/LEHuTZaE0l Do yourself a favour and watch the movie \"Eye In The Sky\". A brilliant film about the dilemma of how we fight terrorism. 🌟 🌟 🌟 🌟 🌟 You're a class act Jack. Thank you again for being on the show.🙌🏽 https://t.co/CqQvyUqwhq RT @jahimes: I'll be on @TheDailyShow with @Trevornoah tonight to talk gun violence. I'm the one on the left, no baseball cap. https://t.co… @TinaHarrisment no apology necessary. I would have reacted exactly the same way. What matters is where we end up. Merci Witness!!!!!!!!!!!\n\n#KingJames #Irving #Cleveland @Travon mistakes in officiating are part of the game. It adds to the drama. I would rather have that than ads every 5 minutes. @Travon exactly That's why I love both sports as they are. Sometimes I want a slow build up into an explosion or I want it fast and furious. @DylanAkers @Travon that's just one team not a good sample size. It's like when Barcelona was ravaging world football with high scores. @sean_a_brennan @jasonjross @Travon it's called diving! And it's a very crucial part of the game. Flopping in basketball is unnecessary. 😄 @Travon soccer has a buildup that leads to an eruption of emotion. Even misses stir up the crowd. It's like tantric sex. @Travon soccer is the game the forefathers would have loved- sometimes all men are created equal.\n#ItsATie! @Travon nope not true. You could miss the 1st 15 mins in soccer and miss all the action. Bball you just need to watch the end. RT @kenteclark: @Trevornoah addressed actual problems in today's society through his humor! Had a great time at the show tonight 😂😂✊🏾 I'm on it! https://t.co/jyMQAb0xgq RT @CoolDrMoney: Just saw @Trevornoah in San Diego (kinda). Straight up #beast I live for nights like these! Thank you for sharing it with me. https://t.co/ADCAGYK0V6 @Travon bball isn't perfect, what's the point of the first 3 quarters if the game is always decided in the 4th? @Travon lol. Don't come here with your high action American mind. The offside rule makes things interesting. @FilmFan_4life @hulu I'll find out. It should still be up as far as I know. Please watch this beautiful and powerful video of @hasanminhaj speaking directly to members of Congress. \n\nhttps://t.co/BtgJ9IrAUz RT @GuyEndoreKaiser: Tried to feed my daughter winter squash and she gave me the LeBron blocking Curry face. https://t.co/7EFpv2jTHW He who endures conquers!!!\n#KingJames This Ghostbusters movie looks hilarious. RT @MissUSA: You don't want to miss @TheDailyShow with @TrevorNoah tonight! https://t.co/eGNDy4WaBT RT @ronnychieng: Lots of pressure tonight. LeBron James needs to win the championship for the Space Jam 2 ending #NBAFinals #WARRIORSvCAVS RT @davidkibuuka: Are we doing what they fought for? #June16 I wouldn't be shocked if the Republican party pulled a stunt at the convention and tried to steal it from Trump. RT @cameronesposito: Since zero women &amp; zero people of color weighed in on US constitution when it was written, I assume it may occasionall… RT @BlunderingIdiom: Birth control?\nBAN IT!\nAbortion?\nBAN IT!\nGay marriage?\nBAN IT!\nGuns?\nLook, banning things never works. People will fin… RT @sethmoulton: I know assault rifles. I carried one in Iraq. They have no place on America's streets. #Orlando https://t.co/ibKQE2PpqF @bryanlaity Angelo Lozada RT @Archaeo_Lady: Just saw @Trevornoah in Detroit! On point and hilarious; an amazing and emotional experience. It really made (cont) https… As long as you'll have me, I will always return! Thank you Detroit. https://t.co/qLfHJNMzgd I'm not sure if last night was amazing or if Minneapolis was just being Minnesota-Nice😜. Either way, we had a great time. Thank you! Minneapolis. Tonight it's me &amp; you, comedy &amp; laughter, Northrop Auditorium 8pm.\n\n(Ps no more Parakeets are allowed to my shows, I'm sorry) RT @maddow: Iowa Senator leaves GOP: \"I will not stand silent if the party of Lincoln buckles under the racial bias of a bigot\" https://t.c… \"Life begins at the end of your comfort zone.\" Monday Monday Monday. I've never been so eager to see a Monday in my life. See you on Monday. https://t.co/FXUyPgs9Vp RT @justforlaughs: ANNOUNCED TODAY! @Trevornoah is coming back to MTL this Sept!\nPre-sale on now!\nPswrd: LAUGHS\nhttps://t.co/yUDDHgYhHP htt… @Kondemn @TimHortons dude I told you the tea was hot. Wtf? Why are you trying to hurt me? RT @jinkwell: .@Trevornoah in Amsterdam was amazing. Poignant, global, nuanced, &amp; culturally relevant. So good! Forever my #MancrushMonday! RT @dzvi_dzvi: @Trevornoah just coming from the A'dam show,  You  set the roof on fire . Laughed so hard. Props! #comedy https://t.co/U6kVP… Ha ha. I'll keep coming back as long as you'll have me. Thank you https://t.co/p1QndlOkWM RT @marcdehond: Geweldig om @TrevorNoah live te zien! Actueel, urgent en ontzettend grappig; over ebola, terroristen, Zwarte Piet, racisme,… Wow Amsterdam. Thank you for the magic tonight. I'm so grateful to everyone who came out to join me at the show. Hartelijk bedank! You realize when you look back, Ali wasn't just one of the greatest boxers of all time he was one of the greatest people of all time. RT @MeredithFrost: Muhammad Ali dodges 21 punches in 10 seconds. #TheGreatest https://t.co/EKyKFBNn84 I brought half of it, you guys rocked the rest. Getting ready for the second show now. Thank you. https://t.co/FTnbOHhio6 .@RTLLateNight I had a fun and weird time at @RTLLateNight.\n\nNext stop Oslo, tomorrow 2 shows hopefully I'll see you there. @sboshmafu 2010 was a different time, Philip was here. Don't judge me. My first time in Norway and I'm planning to have a blast! See you there. https://t.co/2Est2pf42L Dank u! https://t.co/jxtqU0VN1I Thank you for being amazing.  https://t.co/zRBJsOLU9L Such a fun night in Antwerp. To everyone who came out tonight thank you, Danke, Dankie, Merci, Dank u 🇧🇪 Amsterdam! I'm, performing (comedy no singing) at the Heineken Music Hall on June 5th - Hope to see you there! https://t.co/3TIbBbOMLV RT @dave_thomason: In retrospect, “the haters” were actually a group of friends, family, and medical professionals looking out for my own g… RT @BigHPrivateEye: https://t.co/HDQZtn3CFg This started as a league game and turned into a final.\n\n#championsleaguefinal2016 Oslo! I'm coming your way for the first time ever- Folketeateret on June 2nd - Hope to see you there! Few tix left\nhttps://t.co/q6Suv8ah6T Such a fun show. Thanks for coming! https://t.co/758dd4y2Kl RT @TheDailyShow: This week: Rose Byrne, @katiecouric, @cpegues, and @Tip! https://t.co/1wK5STrTVB RT @EstherPerel: Expectations are resentments waiting to happen. @Shamusenglish I know right! my barber is out of town. I'd rather get food poisoning than try a random barber. It's a celebration! https://t.co/RVHttATEpg @germanrlopez big fan of your work. So wonderful having you on the show. Let's make sure it's not the last time. https://t.co/HxHJwbM7xC RT @Playboy: Read our interview with @TheDailyShow's @Trevornoah from the June issue: https://t.co/1mIuw6ScVi https://t.co/zfpROaGvl7 @Lavernecox we need to do this for ourselves as a society. Thank you for your light and support. RT @Lavernecox: Thank you @Trevornoah. I watched last night so proud that others are standing up for us. You're freaking dope Trevor https:… @lekrisha12 I couldn't afford the marvel licensing. @CP_Berlin definitely! I'm excited to perform in Nashville Tennessee for the Wild Wild West comedy festival on Saturday.\n\nSee you there!\n\nhttps://t.co/xX5t4GbufI Pay Back The Funny. On Mnet now. \n\n#LookMomImThe8pmMovie @ddd02965bcdd455 thank you for being there. It was a blast. @melany324 thank you so much for those words. Last night was really special. Foxwoods was fire tonight. Thank you for coming through everybody. What a night! RT @usweekly: Exclusive: 25 things you don't know about @TheDailyShow's @TrevorNoah! https://t.co/TYyPGhOBAs https://t.co/uaPI7QTjvV RT @GrassrootSoccer: Love hearing interview today w/ @Trevornoah from @OnPointRadio w/ @tomashbrooknpr - talking inclusion &amp; optimism! http… @JennJayBee you're right. I apologize and I didn't mean to offend squash. RT @TheDailyShow: Why are you so afraid of releasing your tax returns, @realDonaldTrump? Sad! #weakdonald RT @johnlegend: Luna's first @TheDailyShow appearance.  FYI, we only have Mary Poppins on weekends. https://t.co/5qMeGuMN7u @EmmaKironde just like this Human beings (&amp; Alf), I'm performing Saturday at Foxwood Casino let's laugh together before the world ends -https://t.co/VeffI4JHWV Finally I got to be in a scene with @JOEtheMORTON aka Papa Pope. @shondarhimes consider this my audition tape😁 https://t.co/byFrIDIg0Q RT @davidkibuuka: Goldfish moms must be so confused today.Theyre like \"What do you mean ur my kid?When was I even pregnant???\" @shrcubed This week we had Bethany Cosentino &amp; women's soccer and women in combat. @hillbillywi11y I'm trying to appeal to a younger audience. Guess I'm getting it very right! I could watch @JKCorden do his entire show in a car. It's such a pleasure to watch. 🤗 Thank you everyone who joined the launch of the Daily Show and Comedy Central on @OSN.\nNow in the Middle East and North Africa.🌎🌍🌏 @BoltnCutler quite the opposite. As a fan I don't support another team because of my teams weaknesses instead I look to improve on them. @bonwell that's so insane. Thanks for that read. RT @metmuseum: .@TheDailyShow's @Trevornoah arrives to celebrate  #ManusxMachina. #TrevorNoah https://t.co/KQ1XTtVkOg Leicester Leicester Leicester. Thank you for making this the greatest season of the premier league I've ever watched!!!! 🎉🎉🎉🎉 RT @voxdotcom: The Vox Vacation Index: Let economics help plan your summer vacation https://t.co/aeF4YFQT7m RT @TheDailyShow: Tonight! #GameofThrones star @nikolajcw https://t.co/7hs7z2rhth Cantona looks like he's been in hiding but he can still play a game. @Fahad @osn @ComedyCentral I'm looking forward to it! RT @TheDailyShow: An entire rap composed of actual Donald Trump quotes. \"They Love Me\" video &gt;&gt; https://t.co/i5bJZUburv #BlackTrump\nhttps:/… Tonight on @TheDailyShow -\n\n@rickygervais and @blacktrump RT @TheDailyShow: Tonight! @rickygervais is here! https://t.co/H0W9ManXft I'm having some fun on Snapchat. Do join me. It's horrible but fun. https://t.co/UKQYO9E74F @cctopple yes sir it is. If we teach computers to be like us won't they just make the exact same mistakes that we've made? https://t.co/ad6de0BxtJ @phillyknowswins thank you for coming. What a great night we had! @tskho Angelo Lozada @stephcorneliuss it's everything! @DJFreshSA just saw this. Thank you Big dawwwwg. @KJohnsonTV noooooo. I must work on looking more approachable. Hi! @Tjay_ms happy birthday! All the news networks combined and still you can't fully comprehend his genius. What a legacy, what a legend. Prince https://t.co/jQRX2Gtg4h RT @frankieboyle: MMA would be so intense if they were allowed to kiss @ZenDot1 thank you for joining us. I had so much fun with y'all today. @Mash_RocknRolla @KingBach \nLol I'm so horrible. One day when I don't have a full-time job I'll get better.🙈 RT @RollingStone: How Roy Wood Jr. became the latest breakout star of the #DailyShow https://t.co/fGYA6WCWed https://t.co/eHlW7ncC2o You have eyes and yet you waste them by not watching The Jungle Book. It's not a movie, it's an experience.\n\n🙌🏽🙌🏽🙌🏽 @Jon_Favreau I've enjoyed some of life's most candid conversations with the stranger in the public toilet stall next to me. https://t.co/vYE64FEC3E You're welcome anytime my brother. I hope everyone tunes into your show this weekend! https://t.co/fQtWBm9xUj @JBoogii_ but I thought we already were? @Tre_C_B thank you Tre. And Kobe gives the crowd tacos! What a time to be alive.\n\n#KobeBryant #MambaDay #Legend Kobe is magic. This is so special.\nEven Kanye is smiling. Wow wow wow\n\n#KobeBryant #MambaDay @teemumeronen happy honeymoon. Thanks for sharing it with me. Pearls Caribbean in Brooklyn😋😋😋 the most delicious food I've had in a long time! Reminds me of home.\n#Flavour https://t.co/btSM3R5bQ5 Make time, listen to Twenty 88 🙌🏽🙌🏽🙌🏽\n\n@BigSean @JheneAiko 🔥 🔥 🔥 RT @nealbrennan: When people are trending on twitter, I know that they died or said something racist. RT @moshekasher: My biggest spiritual accomplishment is that Im voting for Bernie but am still capable of talking to a Hillary supporter li… RT @davidkwong: I put @Trevornoah in today's @nytimes crossword. You've made it! #Blindspot https://t.co/70GvzDDePK @Traceyleighadam major scam. I've never heard of those people. RT @RichardDawkins: Sir Simon Jenkins is one of Britain’s most eminent journalists. I think this article is salutary: https://t.co/FqQ9TwKM… That was fun. We should do it again. \"Is it too late now to say sorry? Cause I've, stolen more than just your money...\" - Justin Zuma RT @jemelehill: Also: Comedian and The Daily Show contributor @roywoodjr joins us for some shenanigans. Tune in at 12p on ESPN2! @Cryptic_Saiyan dude I totally feel you. Just because I like pizza doesn't mean I can't like burgers too. 👍🏽 @twenTsomething just keep staring. Better to look crazy than embarrassed! Everything is April Fools day. RT @dherzog77: Great day for @ComedyCentral yesterday. Today the brand celebrates 25 years stronger than ever. #makeTVgreatagain https://t.… This is love! https://t.co/SO7utZOMM1 Yes, how lucky for Trump. Though not as lucky as getting to run against John Kasich.\n#SinceYouMentionedIt https://t.co/6zprLrWvtU Thank you UF a really wonderful night of comedy and conversation.\n🐊 I'm not falling for that quiche trick again ✋🏽😑. Be gone Klepper. https://t.co/mUEUVtFjG9 I prefer missing you. Please go away. https://t.co/ay34oU0dhR My day ones thanks for keeping me looking fresh. https://t.co/gbz8nE7dTM Me and my bestie @jordanklepper. I miss you buddy❤️ https://t.co/Kr77idKBpi RT @GQStyle: See @theweeknd @billyeichner @Trevornoah and the rest of our 10 best-dressed men of the week https://t.co/BB31EBhmfM https://t… Here's some \"between the scenes\" footage where I chatted to Lindsey Graham- https://t.co/yQBQS094Sr Chicago was fire tonight! Both shows were so much fun. I gave my all and you gave it back. Thank you Chi Town! https://t.co/vgdgi1qGgY @MichaelHWong let's do this! RT @TrendsIndy: Trevor Noah, @trevornoah is now trending in #Indianapolis https://t.co/UE1nTu0zVq And Indy was one of the best audiences I've ever had the pleasure of performing for. Thank you! https://t.co/8rmuytIaxs Ok Indy. Let's get it on. https://t.co/JvViYBvpB4 Regardless of the results, Bernie Sanders won! #Magic #Positivity https://t.co/46rYpa0QFO Chicago the only tickets remaining for Saturday night are the 10pm show. 7pm is all sold out. 🙌🏽\n\nGet your tix here- https://t.co/KAgJFXuoUV RT @NUVO_net: Need weekend plans? @Trevornoah, @NickCarter and more great events happening around Indy: https://t.co/4bB8BtH99p https://t.c… @seamusdever it's so funny how many people have said this but it really was. Maybe in different territories? https://t.co/HbLGYI5U7s I'm so excited to come to Indy. See you tomorrow night! https://t.co/tBAR9jLp5e So much fun and a great conversation. I'll keep practicing for our rematch. https://t.co/Xye65t6Zev @Plaslaiko @TheDailyShow that's weird, maybe I had a bootleg. And I think Jon was more Springsteen than Wanya https://t.co/504UAjJWjp @gsocco I'll already be there!😄 RT @gsocco: Anyone wanna go see Trevor Noah with me Saturday night? Got two free tickets. #comedian #dailyshowhost @Trevornoah People of Indianapolis let's have a comedy party this Friday night. Tickets available here - https://t.co/fLlpX3Rq24 RT @adamjohnsonNYC: Remember when black people were called \"conspiracy theorists\" for saying the war on drugs was a deliberate attack on th… RT @winnieharlow: Comparison is the thief of joy That's not true. Many things go unchallenged on Twitter. I disagree with you.  https://t.co/hScjOiTnKk @Vanyah1 nicely played! Will Smith just walked into the #BVSPremiere and other celebrities started screaming. It was hilarious. https://t.co/7tRcgYi0BI @TLeigh67 I really appreciate that. Thank you for coming. So much love and a fantastic audience tonight @CasinoRamaLive. Thank you so much everyone who came to the show. 🙌🏽 Happy Saint Patrick's Day 🍀\n\n(If you can read this tweet you probably didn't celebrate it right!) Do yourself a favour. Watch Deadpool. #FunnyForDays The Guptas invited me to their house and offered me the job at the Daily Show.😢 Trump 99 delegates\nRubio none\nFeel bad\nPrimary Problems\n\n(Build your own joke kit- some assembly required) RT @TheDailyShow: What makes Americans the maddest? Set your bracket for #ThirdMonthMania. Voting starts 3/16. https://t.co/GneVJpL4Ff\nhttp… Squats not deadlifts. 🙈 @mmorri no I'm suggesting caution and evaluation of tactics. RT @TheSource: 50 Cent’s Lawyers Say He Must Appear Rich Because Rap Fans Are Poor And Need Inspiration https://t.co/YTCTLyOiy7 https://t.c… @MainLineMommy that made my day. Maybe I'll start a morning edition just for the little ones. 😄 RT @BernieSanders: \"To Bernie Sanders with thanks for your commitment to real health care access for all Americans...\"-@HillaryClinton http… @imaGINe_thAtx 😄 I was just checking how the camera works. @anitamachos that's really awesome. Thank you @madridstamahdi we need Twitter to make a sarcastic font before a war is started on Twitter. Thanks for watching the show. @madridstamahdi she's Linus' sister. That's why I said his sister after saying Linus. Why are you so angry? RT @VictorPopeJr: When you copy and paste somebody tweet but forget to remove their @  https://t.co/vm7x8Jhzuh RT @funnyordie: ICYMI: @TheDailyShow presents a touching farewell to Ben Carson https://t.co/5h27Lvp1Cc https://t.co/c2ksQlsPzk RT @deray: We can disagree without attacking each other. Our ideas can be in conflict without us being in conflict. Everything isn't war. They took our jobs! Tuk r jbs. https://t.co/hpSMCJoCOn RT @TheDailyShow: This week: @broadcity’s @ilazer @abbijacobson, @EllenPage, Sacha Baron Cohen, and @PadmaLakshmi https://t.co/aPJ0E8Tc9s Baltimore, thank you for your love tonight. It was raucous and epic and wonderful and everything! Why thank you, future mayor Mckesson. Great seeing you again.  https://t.co/o5kJgFjqx5 @deray I'm in your city. Show yourself! RT @crooksandliars: WATCH:  CPAC Attendees Boo And Walk Out On Ted Cruz https://t.co/YgpaFFWR0O @soonerpcv Happy Birthday. See you at the show soon hopefully. @DKizzy I'll do that! @sejal10 I think I had the most fun. Thank you. Thank you Pittsburgh 🎉🎉🎉#CathedralOfLaughter @JohnDodsonMMA thank you so much. That room was electric! RT @TheDailyShow: From the man who brought you his own brand of steaks comes a whole new offering.\nhttps://t.co/kxG6YLvHVF Untitled Unmastered!\n\n🙌🏽🙌🏽🙌🏽\n#KingKendrick .@TMZ is doing real journalism\nThe news is doing entertainment\nAnd presidential candidates are doing dick jokes.\n\n#TheEndIsNear RT @deray: Please join me in calling for @BaltCitySchools to fire the officer who recently assaulted a student at a school: https://t.co/l8… RT @SethMacFarlane: Dear headlines beginning with \"Twitter Reacts To...\"   No.  No. @prsatran @nytimes that was a very conscious decision on my part because for the most part they have no access. RT @BET: Don't miss the UNCUT cable premiere of #12YearsASlaveBET starring @Lupita_Nyongo TOMORROW 8P|7c!!! https://t.co/eM5R1Jax9g Lupita Nyong’o and Trevor Noah, and Their Meaningful Roles, via @nytimes https://t.co/OSHPeGsN1X @LauraDurnell i see your picture and raise you- https://t.co/z47XT2lzJj RT @TheAtlantic: What’s the only way to undermine a posturing bully? Make people laugh at him https://t.co/G2tovqpsA3 https://t.co/0WUEFHgo… RT @TheDailyShow: Without Apple’s help, the FBI has resorted to extreme methods to unlock the iPhone.\nhttps://t.co/7hQ9dcZH0e East Coast- The Daily Show starts now. Ex director of the CIA and NSA pops in to talk Apple vs Fbi. RT @jbendery: \"My party has gone batshit crazy.\" -- Lindsey Graham #wpcfdinner https://t.co/X8Qi3pet2F RT @DamienFahey: Ted Cruz logs onto YouPorn, types in “Gay homeless man gets beaten to death with shovel”. Zero results. Another day withou… Did Trump just say bigly? Is this Rubio's Rocky moment? Man, San Francisco was too much fun. Thank you for the workout and the great shows. And Happy Chinese New Year! Vancouver. You made my night. Domo Arigato! https://t.co/YPrdQeh6Kz RT @thehill: BREAKING: Sanders ahead of Clinton for the first time in new national Fox News poll https://t.co/c1Whv3sXOj https://t.co/FX8ww… People of sunny Seattle. The early show is sold out tonight. Few tickets remain for the 10pm show. Very excited! ☔ Thank you for listening. https://t.co/1JjCt81il1 Heading to Seattle. Feeling good https://t.co/SLXyCl9vSX New season of Broad City starts tonight 🙌🏽🙌🏽 \"Outrage\" https://t.co/jweOUBNAqG Pitbull is so much fun. He's like a human energy drink. Where does Beyonce come from? It's almost like she just comes to visit us from heaven. Now there has to be an award category for best acceptance speech.\n\n#GRAMMYs #Hamilton #ItMustBeNice Those white people in the audience looked terrified. Right now they wish Beyonce was on stage. \n\n#GRAMMYs #KingKendrick @Cendra_Kahill 1. Thank you 2. I appreciate that. 3. I got it from my mama. @HavocMiranda Obrigado! One day someone will be flying to see you. @emurphizzle as long as you'll have me I'll keep coming back. Thank you. @vrock112 threes company too! @TheRealRobKrat you guys were great. @Traci_news thank you for sharing your night with me! Even on the coldest night Boston has given me the warmest reception. Too much fun! https://t.co/7U2M1sMuIJ What a great start in Boston. Thank you everyone. 4 more shows to go! RT @BostonMagazine: .@CityOfBoston declares February 12 @Trevornoah Day in honor of @TheDailyShow host: https://t.co/qQxfTHCdYs https://t.c… RT @Driveswift: I don't know what's funnier, that Ted Cruz had to pull an ad bc a porn star was in it, or that evangelicals RECOGNIZED HER. RT @TheDailyShow: Trevor and Ben Stiller casually walk to the studio.\nhttps://t.co/CJvqHwszA2 RT @TheDailyShow: Today’s guest is Ben Stiller here to talk about #Zoolander2!! https://t.co/H7cOKpeZsl RT @democracynow: \"Yes, I will be voting for @BernieSanders.\" Watch our interview with @tanehisicoates at https://t.co/Xup8cdtnFB https://t… RT @esquire: Hey, check it out, it's our March 2016 cover starring @TheDailyShow's @Trevornoah. https://t.co/AJrvHPH4Nl RT @mashable: Jessica Williams puts Beyoncé haters on blast on 'The Daily Show': https://t.co/NJ4m5bkPXr https://t.co/f2UlAleflT That ad was creepy... @dherzog77 greatest profile pic ever! Now I'm not sure if people are sneezing into their elbows or dabbing. Such a great night in New Hampshire. @realDonaldTrump missed out. https://t.co/d4FcjBbcOc RT @TheDailyShow: Our #dailyshowNH event officially kicks off. It’s a debate about debates. #FITN https://t.co/arjZP42lGL Such a sweet and genuine person. Thanks @IISuperwomanII for being on the @TheDailyShow tonight. RT @TheDailyShow: You can normally find Lilly Singh (@IISuperwomanII) on YouTube but today you can find her on The Daily Show! https://t.co… What a great time Hannibal!\nPs: that wasn't the greenroom you were in someone's office.\nAll cool though.\n https://t.co/zqYTrZeWL2 RT @hannibalburess: Had a good time on @TheDailyShow.  I did not expect the entire interview to be about gibberish rap.  11pm tonight. http… RT @TheDailyShow: Tonight! Trevor learns about a strange American tradition, and Ted Cruz is a total slimeball. Plus, porn! #really. RT @thereallisaann: Thats right, as if things weren't exciting enough, tonight is THE NIGHT .. I will be on @TheDailyShow interviewed by @r… RT @anthonyanderson: Show up &amp; Represent #ImageAwards, this Friday at 9PM on @tvonetv https://t.co/74ZmoiMQuF RT @TheDailyShow: Come to a live taping of the Daily Show tonight! @hannibalburess is here! https://t.co/hPRdOJYk1M https://t.co/TPdPuByBTQ And the race is on. RT @TheDailyShow: .@POTUS announces #CSforAll, and today’s guest is @reshmasaujani, founder/ceo of @GirlsWhoCode. Coincidence? Nah. https:/… RT @bloggerheads: A picture of Donald Trump, with his daughter Ivanka, perched atop two concrete parrots having sex. https://t.co/TFse8gM1An RT @Travon: In case you needed help learning the new Rihanna song. https://t.co/hWdbAsKGYy Black Woman. Resilient and proud. Mother of men and the rock of a nation. Thank you @CynthiaEriVo @thedanieb @IAMJHUD\n\n#ColorPurple It seems to me, that all we see, is violence in movies and sex on tv. But where are those good old fashion values, on which we used to rely? Soon Atletico will be playing 5 a side. @foreverfivefoot yes ma'am. Grateful. Good times! https://t.co/KYRGcgxv85 Hanging out with @JerrySeinfeld tonight on the @TheDailyShow and we talk about nothing.\nIt's fun. You should watch. RT @gadelmaleh: I am so happy to be on @thedailyshow with @trevornoah Tomorrow night!😀😀😀Watch me @comedycentral… https://t.co/YFCf9xpdKr RT @NationalZoo: Tian Tian woke up this morning to a lot of snow, and he was pretty excited about it. 🐼🌨 #blizzard2016 https://t.co/GrhI9t1… RT @StationCDRKelly: Massive #snowstorm blanketing #EastCoast clearly visible from @Space_Station! Stay safe! #blizzard2016 #YearInSpace ht… @Denisej80464631 I'm also depressed. I was so excited for this show. Damn Blizzard. @NotoriousROD because you're not smiling. My good friends, due to the giant snow storm hitting the East Coast we need to postpone my show in Foxwoods. The new date is May 14th\n#Snow In the comments section of the internet. https://t.co/OERce9CIjp Troy and Abed in the morning! RT @lecanardnoir: Rickman’s “secret” battle with cancer and Bowie’s “secret” cremation.\n\nWord is “private”, newspapers. You have no automat… RT @FoxwoodsCT: You laugh w/ him on @TheDailyShow &amp; now you can laugh w/ @TrevorNoah at #Foxwoods 1/23! https://t.co/mqkUJjtVyU https://t.c… The only cleaning product men need is the phrase \"she's coming over\"\n\n#spotless @brielarson don't want to say I told you so but congratulations.🎉 Almost the perfect metaphor for America. \"Oh sorry, we just forgot the black people\" RT @AmyKinLA: Music started but Sly stopped it to thank Ryan Coogler. \"You did it all, I just hung on for dear life.\" #GoldenGlobes I want a freak in the streets but a lady in my bed. (Sleep is very important to me) RT @dubsphiwe: If this guy can do it, surely y'all can try Part1 #TheYearWeMispronounceBack https://t.co/TyDrtATyMG I couldn't have asked for any more love from an audience but you gave me that and more. Thank you London. I've got bear luv for ya! London. Thank you a thousand times over for joining me at the Apollo tonight. I'll see you one more time tomorrow night! Video game difficulty settings should be - \n\n1. Full Time Job\n2. Part Time\n3. Unemployed RT @TheDailyShow: The #worstresponders have finally responded and passed the reauthorization of the Zadroga Act https://t.co/tZXu8y3CbT RT @TheDailyShow: Now we know what John Kasich was doing with his hands during the debate. https://t.co/U6izaJyCVD https://t.co/Nq5L0f3JZn RT @TheDailyShow: Jeb Bush burning through $60M reminds Trevor of something very specific\nhttps://t.co/FxJ0PSIUq7 Tonight on The Daily Show. Will Smith. I'd love for you to watch. 11pm https://t.co/NJe0Un1Vp3 RT @PUSHA_T: Preorder the album to hear the songs I'm doing tonight on @TheDailyShow with @Trevornoah https://t.co/OGJnIShYjC https://t.co/… I had such a great time with Andy Greenwald doing his podcast. Please do give it a listen. https://t.co/1NZhDENzIj @Jonathan_Witt good times. What do you think will happen to Jacob Zuma? Hilarious. https://t.co/aqmMbaX0Nc Why are you asking for too much? Just be happy that the bullet was dodged. Lol https://t.co/Qy2ADpSFCZ I'd rather have a president that changes his mind than a president that sticks with the wrong decision. \"Lol\" - President Jacob Zuma RT @TheDailyShow: Can a good guy with a gun save America? Watch last night’s special episode: https://t.co/UVU7iZurBr https://t.co/hMJM9nuH… RT @TheDailyShow: NFLer-turned-morning sunshine @MichaelStrahan chats about replacing Regis Philbin, Donald Trump and his new memoir. https… Thank you again for being our guest. Good luck with the minimum wage! https://t.co/xxRyJmbZPS RT @TheDailyShow: Jon Stewart wants you to tell @SenateMajLdr to pass the 9/11 Zadroga Act. Now. #worstresponders #shameworks https://t.co/… RT @TheDailyShow: Tonight! Jon Stewart's on with 9/11 First Responder Kenny Specht. Just DVR the whole hour and get @nightlyshow too. https… What a day- Kanye and Kim share their baby name, LeBron signs biggest sports deal in history and Jon Stewart comes back to the Daily Show. RT @TheDailyShow: Tonight! A young man returns to call for congressional action on a 9/11 bill. #SeniorJonStewartCorrespondent https://t.co… Next time you're in an UBER or a taxi ask the driver to explain world events to you. You're welcome. And what a marvelous audience. Thank you to every single person that came out and watched the show. https://t.co/ieLCg7BCiX This Friday if you're in New York city, then I strongly suggest that you go watch @roywoodjr at Gotham. His comedy is super funny! RT @DamienFahey: Left a waiter a huge tip but the check didn’t go viral. So I called my bank &amp; claimed credit card fraud. They refunded me … No TV? No problem. You can now buy and watch my stand-up special \"Lost in Translation\" online at https://t.co/L7bDKHCHyQ #BanjoGrammar Thanks everyone for watching \"Lost in Translation\" tonight. You can now pre-order the extended version on https://t.co/L7bDKHCHyQ. #WooHoo Here we go East Coast, my stand-up special \"Lost in Translation\" premieres right now on Comedy Central. I'm so excited tonight my new stand up special \"Lost in Translation\" airs on Comedy Central at 10pm. Please do tune in and also watch it. RT @SethMacFarlane: Somewhere between Trump's bigotry, the right wing's environmental recklessness, and the left wing media's PC witch hunt… Adele's music makes me remember people I never knew. Atlanta was fire last night! To see this theater filled with amazing people was truly spectacular. Thank you https://t.co/bYQrCBkhfQ I'm thinking of going. I've heard Atlanta audiences are amazing. \n#JoinIn  https://t.co/546X5nhury No, thank you for coming to the show. Virginia Beach was amazing tonight! https://t.co/i7hQ5ZzQdV Virginia Beach. Tonight we'll be together in a sweet comedy embrace. Sandler Center 8pm- https://t.co/IYLeCmkCiD https://t.co/S76n1oAx5c Thank you and everybody else who came to the shows. It was such a beautiful night. #NYCF https://t.co/p9FhuHJMxi Legend tweet. 😄 https://t.co/XImXqve78Z When I'm in the back of an Uber I always open up waze and then act like I'm just making suggestions- \"maybe we should take 3rd street?\" RT @PMK_BNC: Check out @Trevornoah on the cover of @TimeOutNewYork in support of @nycomedyfest https://t.co/nmWEIbTtyf @ahlakritz I'll take you any way that you come! Lots of people don't watch live, I just want you to enjoy the show. @AFransella I actually said the surgeons were amazing. Don't trust headlines. Those doctors rocked. Hey Jimmy. The hospital people said to tell you \"wrong finger, come back\"? Not sure what that means. https://t.co/9acIwdsCUt Thank you for your love and support. The Daily Show is back on today but I can't stand up. Tune in 11pm Comedy Central. RT @Adweek: How @Trevornoah is making The Daily Show his own, without changing it completely: https://t.co/zq0jgyM4si https://t.co/UjruaFMA… RT @TheDailyShow: #PHONESDOWNDONTSHOOT https://t.co/lyZWzSR1Rj @rose_ettastone as we should. Happy birthday. We'll continue the beef another day. Well done Cassper. Well done!\n\n#FillUpTheDome The early worm! https://t.co/Wdv4Szr7uy RT @JimmyKimmelLive: Tonight on #Kimmel @AnnaKFaris, @TrevorNoah, @BrettEldredge #CMAawards &amp; our 3rd Annual Canine Costume Parade https://… People of Virginia Beach please join me for a night of comedy on November 20th at the Performance Hall. Tickets-\n\nhttps://t.co/IYLeCmCdab @elisasboy72 scary but true Today I'm on @TheEllenShow. The other guest is a lady named @heidiklum, I think she's a model. In LA you're not sure if people are homeless or preparing for a role. RT @BenJealous: Police are searching black drivers more often, but finding more illegal stuff with white drivers https://t.co/RQ1CeKXK81 I use one of these phones to tweet and the other I use to keep contact with the past.\n\n#ballin https://t.co/6F80uL6rcQ All Lewis said was \"Don't drop it\". https://t.co/DR9LeNPKSf Lewis Hamilton 3 Time World Champion! What a moment to witness. https://t.co/ppx7Ucstxo @nebiatassefa luckily embarrassment is reserved only for the living. I've seen many cool things on a plane but the shower on this Emirates flight takes the cake.\n\n#NoExcuseToSmellFunky https://t.co/QVpCFOF6yQ RT @BrainBackBend: Loved seeing @Trevornoah &amp; Dave Chappelle at the Dubai Comedy Festival! https://t.co/SpNM7UzNXv Dubai comedy festival, that's a wrap! Thank you for a sold out show and a great festival. https://t.co/yGt4k0yH4O RT @Dubai_Calendar: We can't wait for @Trevornoah to get on stage tonight. Got tickets? Make sure to use metro (Nakheel) or @CareemUAE. See… Dubai, it's the final night of the Comedy Festival. Can't wait to have a great show with you. https://t.co/fJWK51WimK @GayleKing I'm devastated that I missed you last night at the event but thank you so much for your kind words. There's few movies that have made me feel, more than \"Room\". It's such a great movie. @brielarson and @JacobTremblay are phenomenal in it. It's so hard for some to understand #FeesMustFall but this article from @khayadlanga is really powerful.\n\nhttps://t.co/ciAMJ7DxDa Thank you for coming to the show. So much fun tonight. See you on screen again at 11! https://t.co/cbvw5TsfwN RT @JudahWorldChamp: The World Champ will be on @TheDailyShow with @Trevornoah tonight discussing my new book #IfTheRaindropsUnited which i… RT @TheDailyShow: Tonight! Guitar shredding presidential candidate @MartinOMalley stops by.\nhttps://t.co/G5hIshILWe @eatTribal please tell me there's a way I can get on the new orders list? RT @KevinHart4real: Doing what I love.... #livelaughlove #comedicrockstarshit #MakingHistory http://t.co/akio28oq02 All I love is to make people laugh and these legends embody that love and positivity. Eddie Murphy!!! http://t.co/pxiXoDjQg6 RT @chrisrock: The boys are back in town. http://t.co/JnJ63LzAOx My hero and friend. Thank you.  https://t.co/rQVYHgGT0u RT @RealTracyMorgan: Me &amp; the boys celebrating the GOAT EDDIE MURPHY @DaveChappelle @chrisrock @ohsnapjbsmoove @Trevornoah @JayPharoah http… Running through DC with my woes. LunchTime. Dave Chappelle is buying and @kevinnealon tweeting in the back. http://t.co/4Bb1ya8FGI On stage with @ArsenioHall getting ready to honour Eddie Murphy tonight. Then I fly home to Zamunda. http://t.co/1X1MDa8V5D RT @TheDailyShow: This week, @tanehisicoates joined @Trevornoah to talk about mass incarceration in the U.S. http://t.co/3Fl9hX6pbC http://… The Dubai Comedy Festival starts today I can't wait to get out there next week- 24 Oct.\nYou can book your tickets here- dubaicomedyfest.ae @StationerySlut kindred spirits indeed! @Vanessa_b23 I had the same thing happen to me with @FloydMayweather. #StarStruck I finally figured out how to use Snapchat. My username is TrevorNoah and my real name is Trevor Noah. I had too much fun with Jack Black talking about his new movie \"goosebumps\" and @msjwilly was super trill. http://t.co/eFiyJXsVOW Tonight on The Daily Show we enjoy the finest moments from the debate. Then I chat to Tom Hiddleston and ladies scream. 11pm Comedy Central RT @TheDailyShow: Congrats @JimWebbUSA! Achievement Unlocked: Reminding Us You Exist! #DemDebate #CNNDebate http://t.co/NcPIcVVNrf RT @TheDailyShow: Congrats @MartinOMalley! Achievement Unlocked: Hi, My Name is... #DemDebate #CNNDebate http://t.co/ZcrccHz8Wu RT @TheDailyShow: .@BernieSanders is gonna come out swinging in Vegas tonight. #DemDebate #CNNdebate #DebateWithBernie http://t.co/SGvnb9zM… RT @TheDailyShow: .@HillaryClinton is ready to bring the magic in Vegas tonight. #DemDebate #CNNdebate http://t.co/47qnBdGiR6 Tonight on The Daily Show- Lewis Black is back and I'm blessed to have Richard Dawkins as my guest! \n\nBut first, time for the debate! @ShaunKing @baratunde @tanehisicoates thank you. RT @TheDailyShow: Tonight! @RoyWoodJr marks the anniversary of the #MillionManMarch, plus @tanehisicoates! @hollyrpeete @TheDailyShow @roywoodjr you've just made my day. Thank you! These people play football like concussions are not a thing. \n\n#Giantsvs49ers RT @RabbiShmuley: With @trevornoah of @thedailyshow who's had me laughing the whole week.  Sweet guy http://t.co/XMAXBMt1WG @realjeffreyross you're too kind my friend. Always a pleasure seeing you. @alybirdy or maybe I'm just giving her a break from your charm? Too much of a good thing. 😄 RT @Dubai_Calendar: Get your tickets to see @Daily Show’s @Trevornoah on October 24th! @dubaicomedyfest \nhttp://t.co/BQdHpAks7P http://t.co… @1capplegate I blame the heat because in n out can do no wrong. Thank you so much to everyone who joined me tonight at Politicon. I really had a wonderful time and thank you James Carville."}