{"tweets": "Thank you 1D family for helping us celebrate #8YearsofOneDirection we hope you enjoyed reliving some of the amazing memories! https://t.co/BOVPIHnHWS RT @Harry_Styles: Wow, Eight years has passed. Thank you for all the love, thank you for all the support. Thank you for everything. \nI love… And now I'm one step closer to being two steps far from you, when everybody wants you, everybody wants you \n\n#8YearsofOneDirection You can't go to bed without a cup of tea, maybe that's the reason that you talk in your sleep \n\n#8YearsofOneDirection We can make it 'til the end, nothing can come between you and I \n\n#8YearsofOneDirection And if you like midnight driving with the windows down, and if you like going places we can't even pronounce \n\n#8YearsofOneDirection Everybody wanna steal my girl, everybody wanna take her heart away \n\n#8YearsofOneDirection I've been thinking about it lately, does it ever drive you crazy, just how fast the night changes? \n\n#8YearsofOneDirection I know we only met but let's pretend it's love and never, never, never stop for anyone \n\n#8YearsofOneDirection Baby, say yeah, yeah, yeah, yeah yeah and let me kiss you! \n\n#8YearsofOneDirection RT @NiallOfficial: #8YearsfOneDirection Wow! 8 years of amazing memories with the lads . Thank you so much for standing by us for all this… RT @LiamPayne: #8YearsOfOneDirection what an incredible 8 years it’s been with my brothers! Thank you to all the fans that are still suppor… But now we're together we're alone, and there's no other place I'd ever wanna go \n\n#8YearsofOneDirection The story of my life, I take her home, I drive all night to keep her warm \n\n#8YearsofOneDirection Baby you light up my world like nobody else \n\n#8YearsofOneDirection I wanna love like you made me feel when we were 18 \n\n#8YearsofOneDirection RT @Louis_Tomlinson: #8YearsOfOneDirection Where has the time gone!? Thank you so much to every single person who’s ever supported us. Big… I'm half a man at best, with half an arrow in my chest \n\n#8YearsofOneDirection In the heat where you lay, I could stay right here and burn in it all day \n\n#8YearsofOneDirection If I didn't have you I'd never see the sun, you taught me how to be someone \n\n#8YearsofOneDirection We knew every line now I can't remember, how it goes but I know that I won't forget her \n\n#8YearsofOneDirection Baby they don't know about, they don't know about us \n\n#8YearsofOneDirection So get out, get out, get out of my head, and fall in to my arms instead \n\n#8YearsofOneDirection For your eyes only, I show you my heart, for when you're lonely and forget who you are \n\n#8YearsofOneDirection So I built you a house from a broken home and I wrote you a song with the words you spoke \n\n#8YearsofOneDirection It's gotta be you, only you. It's gotta be you, only you \n\n#8YearsofOneDirection Baby you and me, stumbling in the street, singing, singing, singing, singing! \n\n#8YearsofOneDirection And as you close your eyes tonight, I pray that you will see the light, that's shining from the stars above \n\n#8YearsofOneDirection You and me got a whole lot of history, we could be the greatest team that the world has ever seen! \n\n#8YearsofOneDirection A whole lotta history... this Monday is an important anniversary for the guys, it’s been #8YearsofOneDirection\n\nTo celebrate, it's time to relive all the hits this weekend by streaming the official playlist and tweeting which tracks you are listening to https://t.co/H09htTye18 https://t.co/Pus8wudY7T Happy New Year! What an amazing year it’s been for all of the guys. To celebrate we’ve updated the One Direction Official Playlist with all of your favourite tracks! https://t.co/H09htTye18 Today's #TB1D is the guys performing More Than This, live from the up all night tour! https://t.co/mKFmm9ulzH #SaturdaySnap 📷: Live from Dublin ☘ https://t.co/IQLIdzOrK6 #1DWeekendPlaylist has just been updated! TGIF! Who's ready to party? https://t.co/ADb1g2crCT Today's #TB1D is the guys playing a game of dodgeball on the @latelateshow with some 'coaching' from @JKCorden 💪 https://t.co/vo7NbCMUYL #SundaySpin: If I Could Fly https://t.co/mDTbzJPnfK #SaturdaySnap 📸: Louis ❤️ https://t.co/B5MhkaXGF7 #TuesdayTrack: Through The Dark https://t.co/15fvhMOQjp #SaturdaySnap 📷: Guys on Tour https://t.co/UFbpjY3hW9 This week's #TB1D is the guys playing #NeverHaveIEver on @theellenshow! 💯 https://t.co/K1LigvJK8r Our latest #1DWeekendPlaylist additions are  'Cmon Cmon', 'Na Na Na' and 'Alive'!!! Who's ready for the weekend?\n https://t.co/ADb1g1UQLl Thank you 1D Family! https://t.co/V3Fb0tZfjA RT @NiallOfficial: Still in shock . You guys are incredible , thank you RT @LiamPayne: But seriously tho thank you again everybody I'm gobsmacked once again RT @LiamPayne: Wow this is incredible we really are the greatest team the world has ever seen... when history becomes your future 🤔😱👀 RT @Harry_Styles: Thank you so much to everyone that voted for the BRIT award tonight, your support is unbelievable. Always has been. Thank… RT @NiallOfficial: Oh my days...time and time again you guys do it for us  . Payno love ya bro. @benwinston @GabeTurner73 @bigboturner @Ful… RT @Louis_Tomlinson: Loads and loads of love !!! https://t.co/TZ3BgAiQhF RT @BRITs: The winner of British Video at The #BRITs 2017 as voted for by you is @onedirection!! 🎉 https://t.co/y02G5t6nqZ Happy Valentine's Day! Our special #TuesdayTrack for all the lovers out there: 'Last First Kiss'❤️✨️💋 https://t.co/Whgk1kKbwT First #1DWeekendPlaylist update of 2016! What do you guys want to see on here? https://t.co/ADb1g2crCT Our #TB1D this week is this lovely snap of the guys having a great time on the Late Late Show! https://t.co/zaaEdkqNwE #TuesdayTrack: Where Do Broken Hearts Go  https://t.co/5YouLMoWKY #SundaySpin: Right Now https://t.co/sf4H0bPdHG This week's #SaturdaySnap 📸 is this great selfie the guys took during a live performance! https://t.co/zC3dlMG4Nb This week's #TB1D is this fun video of the magic behind some of the scenes in ''Night Changes' shoot! https://t.co/mGz8i1Bwne #TuesdayTrack: Best Song Ever https://t.co/0DixoSaazE Our #TB1D is the guys' amazing cover of Rihanna, Kanye and Paul McCartney's FourFiveSeconds for @BBCR1 Live Lounge! https://t.co/PNIMPrqyC5 Today's #TuesdayTrack: Temporary Fix https://t.co/8lRZo9J61J Happy New Year 1D Family! Merry Christmas to our 1D Family all around the world! 🎄🎅🎁 Happy Birthday @Louis_Tomlinson! #TuesdayTrack: Clouds https://t.co/JmLXGfzGDj Are you more 'Drag Me Down', or is 'Infinity' more your speed? Take our quiz and find out what #MITAM track you are! https://t.co/GIoJgvZ9GD What’s your favourite 1D Lyric from Take Me Home? Tweet us your answers! https://t.co/QBxXouZBNi You talked we listened! #ChangeYourTicket has been added to our @SpotifyUK #1DWeekendPlaylist! https://t.co/mpRCGtAjgl Today's #TB1D is 'What Makes You Beautiful' BTS fun! Tweet us your fav moments from the music video in gifs! https://t.co/mmSBGOupyx RT @LiamPayne: Wow I can't believe we won #ARIAS, you guys are amazing what a thing to wake up too 🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🍾🍾🍾🍾 RT @ARIA_Official: WINNER: @OneDirection - Best International Artist #ARIAs #OneDirection https://t.co/Tkus5OKqrL #TuesdayTrack: Last First Kiss https://t.co/Whgk1kKbwT TGIF!!! What would you like to see on the @SpotifyUK #1DWeekendPlaylist? Tell us and it might get added on here! https://t.co/ADb1g1UQLl #SundaySpin: Illusion https://t.co/FMbE2v3IAl Got that #FridayFeeling? Swing by @SpotifyUK and treat yourself with our #1DWeekendPlaylist! https://t.co/ADb1g2crCT Today's #TB1D is the guys living it up in Miami! 😎☀️ https://t.co/8amoqeK0hM #TrackOfTheDay: More Than This https://t.co/PwlQG9Fomw #SundaySpin: Infinity https://t.co/OoKtiFupSZ Our #TB1D today is the guys messing around behind the scenes of 'Kiss You' video! https://t.co/VNh0Rc24qQ Ticket touts are stopping true fans getting to shows. Make a difference. Please sign the petition today: #toutsout https://t.co/YRqw8GskrI It's that time of week again so head over to @SpotifyUK and get yourself in the mood with our #1DWeekendPlaylist! https://t.co/ADb1g2crCT #TrackOfTheDay: Spaces \nhttps://t.co/N0xsTPEsPC #TuesdayTrack: Where Do Broken Hearts Go https://t.co/5YouLM7lTq #SundaySpin: Gotta Be You https://t.co/eVobrwvwP7 The guys have been nominated for Best International Act at the @ARIA_Official awards! You can vote for them using #AriasOneDirection https://t.co/baeEhWbweB Start your weekend right with our freshly updated #1DWeekendPlaylist! Tell us what you want to see on here next! 🎶 https://t.co/ADb1g1UQLl #TuesdayTrack: Act My Age https://t.co/Oyj4uccNiC The guys behind the scenes of the 'Perfect' music video! #TB1D https://t.co/G4unDKLu8w What's your favourite throwback moment from the 'History' video? #TB1D https://t.co/ugAJUk4JWa This week's #SaturdaySnap📸 is this pic of the guys on @chattyman last Christmas! #TB1D https://t.co/cVeehoAM0u We listened to your suggestions and here's our new #1DWeekendPlaylist! Keep em coming! https://t.co/ADb1g1UQLl Throwing back to the guys having fun behind the scenes of the 'Steal My Girl' Video! #TB1D https://t.co/Gwp1riYReA #TuesdayTrack: One Thing https://t.co/fGxu1pc2SY Throwback to another of the guys' wonderful acoustic performances on @SIRIUSXM! #TB1D https://t.co/PRwZFhLQa3 The #MadeInTheAm website's been nominated for best music website at the @lovieawards! Vote: https://t.co/I2gROYF5r9 https://t.co/43NnGKNWIf #SundaySpin: Diana\nhttps://t.co/H09htTgCCy Our #SaturdaySnap is the guys at @UniversalORL! 📸 #TB1D https://t.co/hkPcTgxVPS Who's ready for the weekend!? What 1D tracks should be on the #1DWeekendPlaylist? https://t.co/ADb1g2crCT Looking back at yet another amazing acoustic performance from the guys! #TB1D https://t.co/kvasRQMtVv Happy Birthday @NiallOfficial! https://t.co/brB7glUjb5 What's your favourite moment from the 'Best Song Ever' Video? #TB1D https://t.co/X9TsOgSBkk #TGIF! What do you think of our weekend tracks? Tell us what tunes you'd like to see on here! https://t.co/ADb1g2crCT Remember #action1D last year? Your support made a difference for every child around the world @savechildrenuk https://t.co/vGv2QHR0Px Do you remember where you were when the 'Story of My Life' video premiered? #TB1D https://t.co/R0oiBGYOiF Happy Birthday @LiamPayne! Thanks to everyone who voted #1DForBestBritishGroup in the #R1TeenAwards! https://t.co/0VcvO92y1H RT @EmileeLindner: i went behind the scenes of One Direction's very first music video for #5YearsOfWMYB https://t.co/LOtEIDIb8Q https://t.c… RT @NASA_Johnson: Exactly one year ago, @onedirection took us behind the scenes of @NASA's Journey to Mars in \"Drag Me Down\"! https://t.co/… #SundaySpin: Summer Love https://t.co/H09htTgCCy RT @SiriusXMHits1: Let's celebrate #5YearsOfWYMB with @onedirection's first ever in studio performance! https://t.co/7crtxiP2An  😭😭 https:/… Just updated our #1DWeekendPlaylist! Let us know what you'll be grooving to and we might add it to the list! 🎶 https://t.co/ADb1g2crCT #5YearsOfWMYB https://t.co/HnuyIIbKiD The guys are nominated for this year's @BBCR1 Teen Awards! Get your votes in before Sunday! #1DForBestBritishGroup https://t.co/Jp7mYOWej9 A little hump day treat to get you through the week... https://t.co/U0kqAxFe9N Still absolutely loving this acoustic version of One Thing! #TB1D https://t.co/OEcrFElyvx Thank you for helping #MadeInTheAm win big at the @teenchoicefox Awards! Relive the magic on @Spotify https://t.co/GMGbGgcfDv RT @GilletteStadium: @onedirection 2 years ago today, 1D kicked off the first of 3 record-breaking shows!\n#ALLTHEFEELS https://t.co/DJHqUNq… #SundaySpin: Temporary Fix https://t.co/bZx1EdFFwc Who’s following the 1D weekend playlist? Let us know which 3 tracks are your current fave! https://t.co/ADb1g2crCT RT @bpi_music: GREAT news #Directioners! Your boys @onedirection have gone PLATINUM with their single 'Drag Me Down'!! #bpiAwards https://t… #TB1D: Night Changes 🎶 https://t.co/0kaYmOQkDr Still loving #MadeintheAM? Find out which track you should be listening to right now! #My1DFave https://t.co/gj0Dj8vSEC RT @syco: .@onedirection won #TeenChoice for #ChoiceMusicGroup, #ChoiceSongGroup Home, #ChoiceLoveSong Perfect &amp; #ChoiceFandom https://t.co… RT @SonyMusicGlobal: Shout out to the guys of @onedirection! Congrats on #ChoiceMusicGroup 😘 #TeenChoice https://t.co/iMn8A3lsPl RT @MrsAnneTwist: 👍🏼 https://t.co/cKRynYEDVe RT @teenchoicedata: CHOICE MUSIC GROUP: @onedirection (WINNER) #TeenChoice 🙌🏼 https://t.co/lYjbApLk1H A HUGE thank you for your continued support to everyone who voted for 1D to win at this year's #TeenChoice awards! 🏆 Who's been listening to Drag Me Down today? https://t.co/UvHoatdgbI #1YearOfDragMeDown 🎈🎉 https://t.co/X2DlQ9cReJ RT @NASA: #1YearOfDragMeDown. See what @OneDirection saw when filming their video at @NASA_Johnson: \nhttps://t.co/4vsTUf1qwO https://t.co/U… #SundaySpin: Hey Angel https://t.co/H09htTgCCy Getting us through Friday afternoon… https://t.co/PG1453gd2i #TB1D: Steal My Girl https://t.co/WxwjWBEsEc RT @TheXFactor: They went on to conquer the world! We revisit @onedirection's #XFactor journey... 🎤 👉🏼 https://t.co/XUuYVRnfwR #TuesdayTrack: Live While We're Young https://t.co/D0o4xjGboe RT @Real_Liam_Payne: Very late to the party but wow six years of us!! still so many more to come I've never been part of something so amazi… RT @Vevo_UK: .@onedirection's What Makes You Beautiful has been viewed over 782 MILLION times #6yearsof1D https://t.co/gp7Wd94j3k\nhttps://t… RT @whenharrymoans: @onedirection it's been an incredible day #6yearsof1D https://t.co/OZBGwYoQaS RT @loveleenlehal: #6yearsof1D Time goes by so fast. It's been 6 years of @onedirection and almost 1 year since my first concert. https://t… RT @billboard: #6yearsof1D: @OneDirection thanks \"incredible\" fans on group's six-year anniversary https://t.co/CxvfvIuqDW RT @Louis_Tomlinson: Read so many amazing tweets from you guys ! Thanks for sharing the memories with us .. Here's to many more 🍻 RT @NiallOfficial: 6 years . wow ! As Louis touched in his message , each one of you have played in a part in changing lives.. RT @NiallOfficial: You are the best fans in the world as you know . . Thank you so much  for everything so far. We're searching the #6YearsOf1D tweets right now! #1DFollowSprees 👀 It's almost the end of our #6YearsOf1D Spotify Party - head over to our Anniversary Playlist and follow it now! https://t.co/6eLWij6H4v Not long left! Time for #MadeintheAM. #6Yearsof1D @Spotify Party. https://t.co/ylSlCm0mFx https://t.co/1ybZviMrsa RT @IsaFifthmagcon: @onedirection my lock AND MY favorite music! #6yearsof1D https://t.co/3bkc5FcNCx RT @oranpayton: @onedirection  #6YearsOf1DSpotifyParty  #1DFollowSprees  amazing lads amazing fans❤️ celebration day for 6years🎉🎉 https://t… RT @Jessluvs1d: @onedirection this song is life changing https://t.co/q0PJDFkHYp @TormentxNiall yes RT @hurricane_meg: @onedirection throwing it back to an absolute classic 😁💖 #6YearsOf1DSpotifyParty https://t.co/5naEMT1PWD If you're taking part in the #6YearsOf1DSpotifyParty - show us your lockscreens. #1DFollowSprees One word: Four. #6YearsOf1D @Spotify Party - who joined us on the On The Road Again Tour? https://t.co/hgoGu6gEJZ https://t.co/uRB7rH1EvT MidnightMemories. #6Yearsof1D @Spotify Party. 🙌 Who tuned in for the whole of 1D Day? https://t.co/qmkqMGowgd https://t.co/a39xoVMGXU #6YearsOf1D: Take Me Home. Who remembers where they were when this album dropped? https://t.co/JCUotlP6JT https://t.co/54j9OgFMoS We're kicking off our #6Yearsof1D @Spotify Party now with #UpAllNight! Join us now 👉 https://t.co/Y83pX6eRTf https://t.co/pYrHHwdMU1 RT @SonyMusicArg: #6yearsOf1D 🎉🎊🎉🎊😍  @onedirection https://t.co/6wvdmlXub0\nhttps://t.co/pomKCilmn6 😬 https://t.co/gQ4DiK7ehq RT @TreeHearts01: @onedirection The show back in 2013 in Sweden is still my favourite concert ❤️ Thank you 😘  #6yearsof1D https://t.co/tLdV… RT @bethg: Super Awkward exists IRL! Just in time to 🎉🎉🎉 all of Bella's mega awks moments because of her 😍😍😍 of #6yearsof1D https://t.co/VX… RT @Harry_Styles: Six years. I have no idea how to say thank you for all your support. For everything you are, and everything you've done,… RT @Vevo_UK: Check out our Best Vids Ever playlist in honour of #6YearsOfOneDirection https://t.co/gp7Wd8MIbM https://t.co/wzfTsAJoDa We're throwing a 1D @Spotify party, starting shortly! Head over to the 1D Anniversary playlist and get ready! https://t.co/6eLWijoit5 Louis has a message for you! #6YearsOf1D https://t.co/uslf7Eglck RT @ladscheckups: Wouldn't be me without you 4! #6yearsof1D https://t.co/g9KHDJ9qtC RT @1DWWAlert: #6yearsof1D To all of the miles traveled, memories, &amp; friendships. I am so grateful for what I has been given to me because… RT @inspiringxirwin: Admit it One Direction concerts are actually goals\n\n#6yearsof1D https://t.co/cSPLLdmMko 6 years! Share your favourite memories of the band using #6yearsof1D all day. ❤️ https://t.co/H09htTgCCy #TB1D: Kiss You https://t.co/Pf6pST4GeF It's been a while since we last updated the weekend playlist! Let us know which track you'd like to see us add next. https://t.co/ADb1g1UQLl #SundaySpin: Olivia https://t.co/H09htTgCCy #SaturdaySnap 📷  ©️ One Direction/Cal Aurand https://t.co/zkFvdTRnpn RT @TeenChoiceFOX: RTing is a move in the right direction. @OneDirection's #Directioners, vote for #ChoiceFandom now! #TeenChoice https://t… #TB1D: One Way Or Another (Teenage Kicks) https://t.co/FLzoMFh7M3 The guys are nominated for #ChoiceFandom at this year's #TeenChoice awards !! RT to vote @onedirection. https://t.co/Jpces7K8iy Tuesday Track: #EndoftheDay https://t.co/H09htTye18 #SundaySpin: Perfect https://t.co/H09htTgCCy RT @billboard: .@OneDirection is No. 1 on Billboard + Twitter Top Tracks chart https://t.co/aULJ0YQQQN https://t.co/8w8tSR3GjL Which throwback track do you want to see us add to the #1DWeekendPlaylist this week? Let us know. https://t.co/ADb1g2crCT RT @ColumbiaRecords: Congrats to @chloeandhalle @LittleMix &amp; @onedirection! Get voting! https://t.co/B7HlocpCRH #TB1D: Little Things https://t.co/FaeW6xnQ6W One of our fave performances! #1DTorn https://t.co/FAd7vnNnta #SundaySpin: Olivia https://t.co/H09htTgCCy \"You and me got a whole lotta History…\" https://t.co/s2wwtrSJKy https://t.co/gs8RpZGcyc Thank you for all your support 1D Family!  https://t.co/rGnUaqCbsP This #TB1D track always reminds us of summer! https://t.co/X9TsOgSBkk #TuesdayTrack: We're listening to #DragMeDown today! What are you guys listening to? https://t.co/H09htTye18 #SundaySpin: Infinity https://t.co/H09htTgCCy RT @TheXFactor: .@onedirection proved they had IT, now it's your turn! Send us your video auditions now 🙅 👉 https://t.co/0eG9aejLVt https:/… We've added a new track to the #1DWeekendPlaylist! Take a look and find out what it is! https://t.co/ADb1g2crCT We're watching #StoryOfMyLife today! #TB1D https://t.co/R0oiBGHcU5 Which tracks do you lot want to see us add to #1DWeekendPlaylist next? Take a look and let us know https://t.co/ADb1g2crCT Surely we can't be the only ones loving @NiallOfficial's new @Spotify playlist! Who's following? https://t.co/82ZciZ5Plw #SundaySpin: Little Things https://t.co/H09htTgCCy Vote for 1D at @TeenChoiceFOX by using #OneDirection, #ChoiceLoveSong and #TeenChoice! https://t.co/IFgXRgdUZQ Last chance to vote for 1D to win Best Live Act at the Silver Clef Awards 👉  @NordoffRobbins1 #BLAOneDirection https://t.co/JAb0GKvRAj Check out what we're watching today… https://t.co/XWv0pkVh9d #TB1D RT @Real_Liam_Payne: Wow! six years since my audition so much has changed in my life from amazing adventures to life love and happiness tha… Thanks for all of your votes so far! Keep voting for 1D to win at this\nyear’s Silver Clef Awards 👉@NordoffRobbins1 #BLAOneDirection Who else can't stop laughing when they watch 1D's Carpool Karaoke with @JKCorden? https://t.co/SZc3FrCFlm 1D's \"Perfect\" is nominated as #ChoiceLoveSong in this year's @TeenChoiceFOX awards. Vote at https://t.co/UFeaVjZ7p2 https://t.co/QwE8SNGgA1 RT @cristinadgx: @onedirection OMGGG ONE YEAR AGO #oneyearago #OTRATBrussels I was already in the queue list https://t.co/4Zya7HsH5o RT @TeenChoiceFOX: RT this or tweet @onedirection + #ChoiceLoveSong to vote for \"Perfect\" now! #TeenChoice https://t.co/Lf6mfrxVUi It's time to vote again…. Which track would you like to see added to our #WeekendPlaylist? https://t.co/ADb1g1UQLl Sunday Spin: \"Nobody, Nobody\" #DragMeDown. https://t.co/H09htTye18 RT @bpi_music: ‘Little Things’ by @onedirection has just gone Platinum! Congratulations, boys. #bpiAwards https://t.co/e3Rr05Xj10 You guys chose 'What A Feeling'! Check out the updated #1DWeekendTunes playlist on @Spotify! https://t.co/ADb1g1UQLl Who remembers where the guys were when this was taken?  #OnTheRoadAgain ©️One Direction/Cal Aurand https://t.co/nLBLFb0Jnf Which track would you like to see us add to the 1D Weekend Tunes playlist next? https://t.co/ADb1g1UQLl 1D are nominated for @TicketMaster Best Live Act at this year’s Silver Clef Awards! Vote by tweeting #BLAOneDirection to @NordoffRobbins1 Still love this moment… https://t.co/v001wbpR0S https://t.co/MSv8CMIgnS #SundaySpin: Story of my Life https://t.co/H09htTgCCy #CapitalSTB memories! What a day! © One Direction/Cal Aurand https://t.co/8Z0wnBdl0K RT @bpi_music: ‘History’ by @onedirection is now Platinum. Congrats! #bpiAwards https://t.co/RYPDoTwfnh Have you checked out our #WeekendTunes playlist on @Spotify? Listen here! https://t.co/ADb1g2crCT #TBT ☁️  https://t.co/ZkJlNZbF2A Still can't decide which #MadeintheAM track is your fave? Take this quiz to find out. https://t.co/gj0Dj8Ntwa #My1DFave #SundaySpin: A.M. https://t.co/H09htTgCCy When was the last time you played #NeverHaveIEver? LOL https://t.co/iOx0Xl2rMR We're creating a new #Mood playlist on @Spotify. Tell us the 1D tracks you'd like to see added! https://t.co/bJxKf8XxcD Starting the day with #1DTorn 😍 https://t.co/FAd7vo4YRK Thanks to @Billboard for the Top Duo/Group award, and a HUGE thanks to all of you for your support!! https://t.co/JywF6GuRL8 RT @Real_Liam_Payne: Wow. Wow wow thanks so much everyone for the billboard award I don't understand how we even win stuff anymore 🙈😁😬 RT @NiallOfficial: Lovellyyyyy! Thanks guys for the award @BBMAs . The support you keep giving us while we're on the break is incredible ,… RT @syco: Congratulations @onedirection for winning Top Duo/Group at the @billboard Music Awards. @bbmas #bbmas 🏆 https://t.co/jTGi7ZLoPg RT @BBMAs: Congratulations to @onedirection who won Top Duo/Group at the #BBMAs! https://t.co/v6fOCFg9G1 #SundaySpin: Fireproof https://t.co/cXJOAUyhOR Which 1D vids are you guys watching today? https://t.co/HKSvYF1DpW RT @NiallOfficial: Check out my limited edition charity tee in support of @irishautism &amp; @RoseFoundation1 \nhttps://t.co/TqbZxAh647 https://… How many nights does it take to count the stars? https://t.co/k2LA5rfcun RT @LiamsMyFlawless: @onedirection I got: Love you Goodbye! 🙆🏻☺️x\n#My1DFave: https://t.co/Ql7g1zYz81 via @play_buzz https://t.co/WXJQxI1XU1 RT @Rooobba2: @onedirection what a perfect fit because Love You Goodbye is my favorite on the album 😍💗 #My1DFave https://t.co/BaVeS3zYJK Can't decide which 1D track's the right one for you? Take our quiz and find out here! #My1DFave https://t.co/gj0Dj8Ntwa Who remembers where the guys were when this was taken? #MadeintheAMMemories https://t.co/FS1WQpoecO #MusicMonday: let us know which track you wanna see added to 1D's official @Spotify playlist https://t.co/cXJOAUPTdr #SundaySpin: Perfect https://t.co/H09htTye18 RT @BBMAs: ATTN: #DIRECTIONERS. Your favs are #BBMAs finalists! @onedirection is up for TWO. 🙌 https://t.co/FMEPbsLvCT \"I've never seen it look so easy….\" https://t.co/cXJOAUPTdr #DragMeDown https://t.co/K16b3fk9fr It's gotta be youuuu.... © One Direction/ Cal Aurand https://t.co/hmaSE9kHfi https://t.co/an4xADKJJG RT @UNICEF_uk: One Direction’s @NiallOfficial has joined the line-up for #SoccerAid in support of Unicef!!! https://t.co/YPDFT5PcE6 https:/… Starting the week off the right way! https://t.co/Sqjhs0SeiD USA! 1D are going to be part of @FamilyGuyonFOX on Sunday, May 15 at 9:00pm ET/PT. You don’t want to miss this one. https://t.co/9iWfPo1Qzi #SundaySpin: It's a #1DHistory kind of day! https://t.co/H09htTgCCy Weekend vibes = #OTRA memories! https://t.co/9ufwEbNIG5 RT @Harry_Styles: Whoops.\n\n#Littleprincesstrust https://t.co/3qPrB3mnyh Throwback to the #1DPerfect music video shoot! https://t.co/RMwPzIee5A Music fans should be able to get tickets fairly. Touts get in the way!\nStop them by signing the petition:\nhttps://t.co/YRqw8GaJ38 #toutsout You guys chose #Home 🏡. Listen to it here https://t.co/H09htTye18 Which 1D track should we add to the Official  @Spotify Playlist next? https://t.co/H09htTye18 Who remembers this performance of #GirlAlmighty at @CapitalOfficial's #SummerTimeBall? https://t.co/wXFs2laRZv RT @NiallOfficial: I've made a playlist of stuff I'm listening to at the minute , incase your interested  https://t.co/pdbIiToWoq #SundaySpin: If I could Fly https://t.co/H09htTgCCy RT @stylesxbandanax: @onedirection WHAT A FEELING #My1DFave RT @stillsian: @onedirection probably kiss you, rock me or little black dress #My1DFave RT @Ahrennnnnnn: @onedirection Drag me down because when your down, The song says \"Nobody can drag me down\"\n#My1dFave ❤ https://t.co/g2kLD4… RT @DisneyChannel: Perfect by @onedirection wins the #RDMA for Best Crush Song! #XOXO https://t.co/T5PjlETp3Y RT @radiodisney: Congrats to @onedirection! Their song #Perfect just won #XOXO – Best Crush Song at the #RDMA! https://t.co/eq930fyULN Which 1D track picks you up when you're feeling down? #My1DFave https://t.co/bZx1EdFFwc RT @syco: Congratulations @onedirection on winning @TheWebbyAwards for Celebrity/Fan Website (Made In The AM Space) https://t.co/uNkdISbEDZ RT @_rosalyart: Quick sketch of Mr. Horan the golfer #niallhoran #1DFanArt https://t.co/gwuovYLvxp Love 'Hey Angel', 'Perfect' and 'Infinity'? Find out the inspiration behind those tracks here! https://t.co/zInKKFbLkZ Guys, WE DID IT! Thanks to everyone who voted for 1D to win a #WEBBY for the #MadeInTheAm space! 😁 https://t.co/m856GMkmzo 1D Fam, it's been a while since you showed us your #1DFanArt. Tweet us yours! RT @WilliamShatner: So it's not only the #perfectdate day today but it's also #liamday 👍🏻@Real_Liam_Payne @onedirection This moment never gets old… #1DPerfect https://t.co/Gia9wcD7Lk https://t.co/NBp7tPID5N RT @NiallOfficial: Niall day hahaha. What's this about ? What did I do now ? RT @NiallOfficial: I think I've got a hold of this now, follow me , it's good craic. https://t.co/qNGZTa0mn0 #SundaySpin: Best Song Ever https://t.co/H09htTgCCy 1D took over NY for the 'Perfect' video! See what happened behind the scenes. https://t.co/RMwPzIee5A If you haven't got your copy of #MadeintheAM yet, you can still get it from the official 1D store! https://t.co/Oassw5Q6KE Last chance to vote for the guys to win a Webby for their #MadeinTheAM space! https://t.co/kbhNc2o3Lu. Don't forget to verify your votes! RT @sugarscape: One Direction's Made in the A.M. just hit a BIG sales milestone 🙌 https://t.co/BpdYAH7Hgs https://t.co/5rtHkmtoiH RT @sonymusicsg: Enjoyed @OneDirection’s #MadeInTheAm space? Vote for it in @TheWebbyAwards - closes tomorrow https://t.co/vr1tDYYXDQ https… Sing it Liam! https://t.co/HCfE1KnDFk When #1DHistory starts playing… https://t.co/TALiNldM0a It's #MusicMonday, let us know which 1D tracks you've added to your @Spotify playlists today! https://t.co/H09htTye18 #SundaySpin: Steal My Girl https://t.co/cXJOAUyhOR Hands up if you still can't get over this performance of #1Dhistory on @JimmyKimmelLive https://t.co/ozTxk6Vm9V RT @TheO2: Double #TBT to @onedirection #OTRATour last year and @Real_Liam_Payne and @Louis_Tomlinson on the red carpet in Feb https://t.co… Throwback to the guys with @simoncowell following their epic @TheXFactor Final performance of 'History'! https://t.co/0NgvXTnmrt RT @Rooobba2: @onedirection I saw the boys for the first time in Seattle ☺️😍 #OTRASeattle RT @pxynexchristixn: @onedirection https://t.co/6sgRbNai0T RT @lauren_ryannnn: @onedirection 1 #OTRABoston 😍💓 How many of you came out to see the guys' #OntheRoadAgain tour? Tweet us the name of the show you came to! https://t.co/1rTOwi2Auh RT @BBMAs: Yup, #Directioners. @OneDirection could break a #BBMAs record in 2016. 🙌 https://t.co/mNYoTQUdhx https://t.co/SjGFSqiJ9r I've got a 🔥 for a heart… https://t.co/4SbUdRYnde https://t.co/8EPVD7aUBC RT @syco: Congratulations to @omimusiconline and @OneDirection on their @BBMAs nominations! #BBMAs The guys are nominated in two @BBMAs categories! Tune in May 22nd. #BBMAs https://t.co/YFf6KxlPLI Who's in the mood for a #MondayMarathon? Tell us which videos you're watching today! https://t.co/9kpQIkOzK3 RT @GMA: #BBMAs Top Duo/Group: @onedirection, @maroon5, @twentyonepilots, @RollingStones, @U2 https://t.co/qzQpFb0ne0 .@radiodisney music awards voting closes today. Head to https://t.co/qhJ7aYCkYv to vote #OneDirection now! #RDMA https://t.co/iCz5MaAnlA RT @SonyMusicCol: ¿@onedirection @LittleMix @FifthHarmony en una sola playlist?¡Súbele a lo mejor de @FiltrCO!https://t.co/0Biu609uFh https… Sunday Spin: #1DPerfect https://t.co/H09htTgCCy #FourFiveSeconds in the @BBCR1 Live Lounge! https://t.co/JdV23AY3i2 .@CapitalOfficial Summer Time Ball memories! Who came along to the show? 📷 One Direction/Cal Aurand https://t.co/ZXB3AtZcS0 RT @syco: .@onedirection are nominated for a #Webby award. To vote for the guys' #MadeInTheAM space, click 👉 https://t.co/3JdKLBZbBJ #1dFollowSpree! Tell us who you think we should follow next! Big news! 1D’s nominated for a #Webby Award. Vote for the guys’ #MadeintheAM space to win here! https://t.co/kbhNc2o3Lu Finish the lyric: \"The roof was pretty windy and______\" #EndoftheDay https://t.co/15xd21nKcW RT @grimmers: YES! I do remember it @onedirection  https://t.co/JHxsR8MzgV Sunday Spin: #TemporaryFix https://t.co/mhuOuaM6A2 Anyone else on a road trip this weekend? https://t.co/SZc3FrCFlm Did you know that you can still watch The London Session on @AppleMusic? https://t.co/hZ7QUDr3S8 Remember this interview with @Grimmers? Did the guys answer your Q? https://t.co/rbk4yOVnLt https://t.co/6aKS1pWHxc #1DTuesdayTrack: Little Things https://t.co/cMT05N5nWR US fans! We've picked a #1DCivicDesignContest winner! They've won a 2016 Honda Civic customized with their design! https://t.co/1NXSKhDThU Happy Monday! https://t.co/H09htTgCCy https://t.co/NmwI7UNiVj Sunday Spin: #NeverEnough https://t.co/H09htTgCCy Anyone remember the #TattooChallenge? So many LOLs  https://t.co/KtdHSQOjWO Which 1D playlists are you tuned into today on @Spotify? https://t.co/mlKmRZwjQE #MidnightMemories https://t.co/cgHLgCdbuS RT @NiallOfficial: Another tragedy . Thoughts are with the people of Brussels and of course the families of those who lost a relative. Sunday Spin: #Clouds https://t.co/cXJOAUyhOR Oh hey Liam… https://t.co/qYEj3RwRVN https://t.co/TRIIcy044C Which ONE track from #MadeintheAM gets you ready for the weekend? https://t.co/H09htTgCCy RT @syco: Listening to #ActMyAge on @Spotify ‘cause it’s ☘ #StPatricksDay ☘  https://t.co/odBswwKBBi ☘ @onedirection https://t.co/QiZRKANXEF Happy St. Patrick's day everyone . . Always proud of our little nation . - Niall https://t.co/KniiGmrBYd #1DTuesdayTrack: WMYB https://t.co/G739ELVj2N Throwback to #1DPerfect! https://t.co/Gia9wcD7Lk https://t.co/tsWHrE0XHl Nobody, Nobody… https://t.co/7cGwgC8A4k RT @NickelodeonUK: First we have fave UK Fave Music Act. Drum roll please.... it's @onedirection!!! 😍😘🎉 #KCA https://t.co/iRvislJs75 RT @NickelodeonUK: Your Fave Music Video was Drag Me Down by @onedirection - double congrats boys! #KCA 👌🏼😘 https://t.co/ueFGYXSwaQ Sunday Spin: #StoryOfMyLife https://t.co/H09htTgCCy Oh hey #GlassesNiall! #1DHistoryVideo https://t.co/kcj9VR7jHA https://t.co/L0OUBdq7gP RT @danielleedgar1: @NOWMusic @onedirection I'm watching. Loving it 😍 my boys ❤️ https://t.co/6afECGfNOr RT @SarahAnn_ox: Nothing better than listening to @onedirection in the morning 😻😻😻😻😻 RT @HuffPostUKEnt: The 10 best #CarpoolKaraoke guests (so far) starring @onedirection @Adele @justinbieber https://t.co/ftUmor7LQY https://… RT @NOWMusic: Next on #NOWMusicTV - @onedirection: All 16 Videos. The boys complete 'History' from start to finish. Tune in Sky, Freesat &amp; … RT @Sarah_Grace06: #1DFanArt #1DHistory Tried something different than my usual sketches https://t.co/FKmeWYg23Y RT @majka_hablakova: hi @Denisehorankell  :) i want show you my drawing and ask what do u think about it? :) #1dfanart https://t.co/k8yGVv4… #OtraThrowback: Milwaukee 📷 One Direction/Cal Aurand https://t.co/bz5F7V70J8 https://t.co/ecsFKzy7Ss It's been a while since we saw some of your awesome fan art! Show us what #1DHistory means to you using #1DFanArt. Have you voted for 1D in the 2016 @radiodisney music awards? RT to do so now! #RDMA #OneDirection #Cool https://t.co/OaHs1iw7SK Throwback to 1D on @JimmyKimmelLive! Who's still got #1DHistory on repeat every single day?  https://t.co/ozTxk6Vm9V Hey Angel… https://t.co/H09htTgCCy https://t.co/cdX7QNC9dF RT @NickelodeonUK: LAST CHANCE- VOTING CLOSES TOMORROW! To vote for \nMusic Act @onedirection #Vote1DirectionUK PLUS #KCA https://t.co/a96Sq… RT @NickelodeonUK: LAST CHANCE- VOTING CLOSES TOMORROW! To vote for Music Video @onedirection #VoteDragMeDownUK PLUS #KCA https://t.co/Fe8A… Sunday Spin: #StealMyGirl https://t.co/H09htTgCCy Throwback to #1DCarpoolKaraoke! Which part's your fave? https://t.co/SZc3FrCFlm RT @jamieravenmagic: Going through all photos for the new website and found this from @RaysofSunshine event with the lads @onedirection 😀 h… RT to vote 1D in the 2016 #RDMA. #OneDirection #YouKnowYouLoveThem @radiodisney https://t.co/SASUOZ0Dt9 RT @NOWMusic: Track 14, #NOW93 is @onedirection 'History' the boys 11th single to feature on a NOW album. https://t.co/PneLJQT1QZ RT @syco: #Flashback to the @brits last week with @Real_Liam_Payne, @FleurEast and @Louis_Tomlinson! 😀 https://t.co/UYyvmMUL6R #OTRAThrowback: who can guess where this was? https://t.co/bz5F7V70J8 https://t.co/8670HNwDhV RT @NickelodeonUK: If the @onedirection boys are your faves then use both hashtags #VoteDirectionersUK and #KCA... Happy Voting!!! https://… RT @BigTop40: Another big news story for @onedirection. #History just made it 3 MONTHS in the chart 👏 https://t.co/M28oeC0eqC https://t.co/… RT @mtvbreaks: We sat down with @louteasdale\n&amp; @schullerinc at @bsd_academy to find out their top tips for making it big in beauty! https:/… RT @Harry_Styles: The yellow grass grows knee high. #1DHistoryVideo always helps with Wednesday blues… Who agrees? https://t.co/kcj9VR7jHA https://t.co/ACUepBvvbb When you listen to #MadeintheAM, which track do you skip to first? https://t.co/qYEj3ROtkn https://t.co/iOBFnkiOJO #SundaySpin: #WhatAFeeling https://t.co/H09htTgCCy RT @NickelodeonUK: For @onedirection use both hashtags... #VoteDragMeDownUK and #KCA! https://t.co/1Wge9ngEmh #1DFamANTHEM! https://t.co/kcj9VR7jHA https://t.co/VLC5d0IbK9 Which 1D videos can you NOT stop watching? https://t.co/9kpQIkOzK3 RT @NASA_Johnson: Congrats to @onedirection on their #BRITs2016 win for the 'Drag Me Down' video! We are glad to be part of it. 👏👏 https://… RT @SpotifyUK: Team #1D forever... everything you do boys, everything you do = #Perfect 💯👌#BRITs2016\nhttps://t.co/o6T2WTmqGv RT @Louis_Tomlinson: Incredible night . Thank you so much for making it so special ! What a night @BRITs! Thanks for all of your votes. #BritDragMeDown https://t.co/Df3yHfcRzS RT @Harry_Styles: Brit Awards. Thank you to everyone who voted. H https://t.co/LXVcfYSOCU RT @brits: British Artist Video of The Year goes to @onedirection for 'Drag Me Down' #BRITs https://t.co/sdHrho8eME https://t.co/VSpoxbXrPw WE DID IT! Thanks to everyone who voted for 1D to win British Video of the Year at this year's @BRITs! 🏆 https://t.co/40VVHJHlVX RT @brits: The winner of British Video at The #BRITs 2016, voted for by *you* on Twitter, is @onedirection! https://t.co/i0PyH2oBxo RT @Louis_Tomlinson: Were nominated for best British video . Vote if you want 😎 Last chance! Vote now for 1D to take home the The @Brits' British Video of the Year 🏆! #BRITVIDONEDIRECTION https://t.co/IWpIaWL8jX RT @syco: Vote @onedirection for British Video at the @brits using #BritVidOneDirection https://t.co/UtbtKZ5E72 Make your vote count! Help the guys win British Artist Video of the Year using #BRITVIDONEDIRECTION #BRITs2016 Who's ready for #BritAwards2016? Vote for 1D to win British Artist Video of the Year NOW! #BRITVIDONEDIRECTION https://t.co/nYPHLvqENo RT @TheO2: One more shot for the @onedirection fans 😘 #BRITs @Real_Liam_Payne @Louis_Tomlinson https://t.co/xhauPWesWw RT @brits: OMG YOU GUYS 😭😭😭😵 #BRITs @OneDirection https://t.co/8wtvyDbEZc Did you catch the guys reading Mean Tweets on @KimmelLive? https://t.co/ZjW2mwAxIQ 1D fam, we've updated the official 1D @Spotify playlist with some of your favourite tracks! https://t.co/H09htTye18 RT @brits: Five nominees go head 2 head for your vote on 24 Feb. YOU decide the British Video winner! Who's it gonna be? #BRITs\nhttps://t.c… Video of the Year? We think so! #BRITDRAGMEDOWN https://t.co/tnhp5rSVvR Sunday Spin: #1DHistory https://t.co/H09htTgCCy Which #MadeintheAM tracks are you guys listening to today?  https://t.co/qYEj3ROtkn #1DFam https://t.co/D23jAKpdQs #TBT Who celebrated their birthday during #HondaCivicTour? Watch &amp; find out! https://t.co/A3qB9b6xaj Pic: Cal Aurand https://t.co/jAj7tHCoJl Thanks for all of your votes so far! Keep voting for the guys to win big at this year's @NickelodeonUK #KCA. https://t.co/AhO04hyu9U What did you think when you heard #MadeintheAM for the first time? #1DFirstListen https://t.co/UiHTRUogLb RT @jimmykimmel: NEW music #MeanTweets with @EdSheeran @JoshGroban @DDLovato @OneDirection @LionelRichie @MumfordAndSons &amp; more...\nhttps://… 1D are featured in @jimmykimmel’s latest installment of #MeanTweets. Watch it here: https://t.co/ZjW2mwiWRi @JimmyKimmelLive Vote 1D as your @NickelodeonTV Favorite Music Group in this year’s #KCA! https://t.co/DXM2geTUt9 https://t.co/z7xcOLBi3z Just a reminder as to why you should be voting for 1D to win Best Video at this year's @Brits! #BRITDRAGMEDOWN https://t.co/3MH9SB6pil Sunday Spin: #IfICouldFly https://t.co/H09htTgCCy Take us back... #1DTorn https://t.co/FAd7vnNnta Thank you .x https://t.co/I73QSckOJ9 1D fans! RT to vote 1D for the #BestFanArmy award at the #iHeartAwards! https://t.co/jTfG9wGH6d UK Fav Music Video: #KCA #VoteDragMeDownUK\n\nUK Fav Music Act: #KCA #Vote1DirectionUK\n\nUK Fav Fan Family: #KCA #VoteDirectionersUK If you’d like to vote for the guys to win at this year’s #KCA, here’s how to make it happen! Thanks to everyone who's voted for 1D to win Best Video at this year's #Brits. Keep voting using #BRITDRAGMEDOWN https://t.co/GXFUxHDeuL This moment though… #1DHistoryVideo https://t.co/kcj9VQPIQ2 https://t.co/hH2nPiWlfN #1DMexico 🇲🇽  https://t.co/TALiNldM0a https://t.co/kyM7wzio2X RT @BigTop40: No.7: #History by @onedirection. Lets just point out this is its 9TH week in the countdown😳 https://t.co/M28oeC0eqC https://t… We're switching up the Official 1D @Spotify Playlist, which classic tracks do you want to see added? https://t.co/H09htTgCCy RT @izitrojan: #1yearsinceOTRA vienna/london @Louis_Tomlinson https://t.co/J1BGgeGtzQ RT @Louis_Tomlinson: Hope everyone is gooooood 😎 Sunday Spin: #EndOfTheDay https://t.co/L3yvnSxBHZ RT @Harry_Styles: Beach, don't kill my Vibe. Anyone else love this Niall and Liam moment? #1DHistoryMusicVideo https://t.co/kcj9VR7jHA https://t.co/89590JDHMg Nobody, Nobody.  Nobody can take our crown! 1D family, keep voting using #BRITDRAGMEDOWN https://t.co/iupip78tQI RT @brits: ⬇️⬇️⬇️ Vote @OneDirection for #BRITs British video by tweeting #BRITDRAGMEDOWN! https://t.co/qejKvhQW4M https://t.co/CWVGhGh4l6 RT @NickelodeonUK: UK Fave Music Video @Adele @onedirection @FleurEast @LittleMix @JessGlynne @Rixton #KCA https://t.co/lTFI82TbI3 UK! If you still haven't got your Ultimate Fan Edition of #MadeintheAM ft #1DHistory, get it here. https://t.co/31hBNzf3fb RT @xJezzie: @onedirection I love them all but #1DHistoryMusicVideo means so much to me RT @weyheypey: @onedirection HISTORY Which #MadeintheAM music video is your fave? #DragMeDownMusicVideo, #PerfectMusicVIdeo or #1DhistoryMusicVideo? https://t.co/kcj9VR7jHA RT @NickelodeonUK: UK Fave Music Act @NathanSykes @onedirection @Rixton @FleurEast @TheVampsband @LittleMix #KCA https://t.co/1bbDj0N0le This track still gets us every time…. #1DHistory https://t.co/TALiNldM0a RT @Harry_Styles: I don't know about you, but I'm feeling 22. #HappyBirthdayHarry! https://t.co/L4krup8bz0 #SundaySpin: It has to be #1DHistory! https://t.co/TALiNldM0a https://t.co/FwxClVEYzP Seriously, would you judge us if we sat here watching #1DHistoryVideo all weekend? https://t.co/kcj9VR7jHA https://t.co/9VZk5JTPob Head over to the official One Direction store to make the most of their January sale! https://t.co/0np1lzpdW0 https://t.co/UvCzQNUQqD Have you spotted anyone you know in the #1DHistoryVideo? https://t.co/kcj9VR7jHA The band have made it through the second round! Thanks for all of your Twitter votes so far #BRITDRAGMEDOWN https://t.co/nbX3OPyVXd #OTRAThrowback: Who can guess which show this was taken at? 📷 One Direction/Cal Aurand https://t.co/t57V9Ijsbr ANYONE ELSE STILL. CAN'T. STOP. WATCHING? #1DHistoryVideo https://t.co/kcj9VR7jHA https://t.co/0IvWzrvtZC RT @dandanicaah: #1DHistoryAndMe\n'and literally i have \"me\" in there. 😂 https://t.co/83RrZ6z8i0 RT @Real_Precious_M: This was from my concert, so it will always be my fave ♡. #1DHistoryAndMe https://t.co/vgK1oJpgsP 1D fans! Hope you’re enjoying this week’s #MadeInTheAM vines! https://t.co/jpcoCgahcJ You're all part of 1D's History! Show us your fave pics of the band from over the years using #1DHistoryAndMe https://t.co/02CPCRL4po #TBT to Liam's #DragMeDown alien encounter: https://t.co/IB29tLgZDs #HondaCivicTour @HondaStage Pic: Cal Aurand https://t.co/iAV5E9xS6g #BRITDRAGMEDOWN https://t.co/NegediZzM7 RT @Louis_Tomlinson: Meet my little lad, Freddie 👶 https://t.co/nec7OqwuQR RT @Sony: Sony Music recording artists @onedirection talk who plays the most instruments in the band. https://t.co/xV7S4Lv2YM #1DQandA #Mad… It's been 24 hours! How many times have you watched #1DHistoryVideo? https://t.co/kcj9VR7jHA https://t.co/JK8AU4hdLx If you love #1DHistory, you can get the track on @iTunes here! https://t.co/qYEj3RwRVN https://t.co/urFbsSpeC0 RT @billboard: #1DHistoryVideo is out -- puts @onedirection on top! #Trending140 https://t.co/ctuCYvH7ao https://t.co/NtkwV0laIb RT @ColumbiaRecords: Hey @OneDirection fans, tell us your favorite part of the #1DHistoryVideo and you might get this little surprise! 😊 ht… RT @madfitzroth: it's everything I wanted it to be. thank you love you @onedirection https://t.co/E3Um58sLcL RT @Nicoline_KN_: @NicolaPayne2788 @onedirection You can be proud of the lovely boys and especially @Real_Liam_Payne. So emotional. RT if you can't stop hitting replay on #1DHistoryVideo https://t.co/kcj9VR7jHA https://t.co/Wp3yUiKInt RT @Sony: We asked Sony Music group @onedirection who in the band can sing the lowest note: https://t.co/XLXiY55D2v #1DQandA #MadeintheAM \"We can make some more\"! #1DHistoryVideo https://t.co/kcj9VR7jHA https://t.co/Lia6M6vPs8 RT @ComplexMusic: Embrace the feels with @onedirection's nostalgic-filled video for \"History.\" https://t.co/kRLwtu56rn https://t.co/dUnbhS2… What's your favourite clip from the #1DHistoryVideo?  https://t.co/kcj9VR7jHA RT @Harry_Styles: History.\nhttps://t.co/iBd9wbImEJ RT @AMAs: One word to describe @onedirection's #1DHistoryVideo: ADORABLE. 😍 \n\nWatch and tell me your word: https://t.co/ksNelAaLqw RT @syco: The official video for #History is here! Watch now: https://t.co/CXgZuIYcd6 #1DHistoryVideo @onedirection https://t.co/dQWqnTmix9 RT @AbbieIsARose: Literally the whole fandom RN #1DHistoryVideo #HistoryMusicVideo #1DHistory @onedirection https://t.co/KoHVneLz0G RT @MTVUK: SO MANY FEELS watching @OneDirection's #1DHistoryVideo right now ❤ Check it out here &gt;&gt;&gt; https://t.co/5DBk1l7yUZ https://t.co/5m… RT @ColumbiaRecords: Watch @OneDirection's new video for #History now! https://t.co/jnHvFPqjWz #1DHistoryVideo https://t.co/XDZULGC4yN RT @Vevo_UK: Tissues at the ready... @OneDirection's​ final vid before their temporary hiatus, #History: https://t.co/ih5EMKnih6\nhttps://t.… RT @CapitalOfficial: OMG! @OneDirection’s #1DHistoryVideo is dropping NOW on Capital TV! Sky 388/Freesat 507 https://t.co/ZqIzduAc07 https:… RT @Vevo: Ugh! @onedirection's new #1DHistoryVideo will hit you right in the feels 😭 https://t.co/kDVqpkODVH https://t.co/TuXnX6c4AC It's here! #1DHistoryVideo https://t.co/kcj9VQPIQ2 1D stopped by @Sony to chat about #MadeInTheAM. Stay tuned all week! https://t.co/stdavKpfWV Want to know the inspiration behind your favourite #MadeintheAM tracks? \n\nhttps://t.co/zInKKEUatr\n\nhttps://t.co/IKlbX2qz0K Sunday Spin: #IWantToWriteYouASong 📝 https://t.co/64KP4C1WwI RT @HondaStage: Can you guess which #HondaCivicTour city this awesome @onedirection crowd shot was taken in? Pic: Cal Aurand https://t.co/7… RT @Louis_Tomlinson: :) :) :) Every vote counts! Keep voting for 1D to win British Artist Video of the Year at the 2016 @Brits using #BRITDRAGMEDOWN RT @Louis_Tomlinson: I'm pleased to say my baby son was born yesterday :) 👶 He is healthy and pretty amazing :) I'm very happy!! US fans! It's time 2 enter the #1DCivicDesignContest https://t.co/4wyBevvJWr (NoPurNec US/18+ See Rules) @HondaStage https://t.co/j8UyI8Gx3l UK! You can still grab your Ultimate Fan Edition of #MadeintheAM's on @AmazonUK! https://t.co/31hBNzf3fb https://t.co/AuUhzSoRNJ RT @AMAs: #NationalHugDay 💘 @onedirection https://t.co/KGdxcYcDBC RT @TheO2: Cracking shot of our favourite lads - hands up if you were there 🙌 #OTRAThrowback #1D https://t.co/cvz7pjHI1p #OTRAThrowback: London (@TheO2) © One Direction/Cal Aurand https://t.co/KEb7t2RmBH Thanks to everyone who's supported #1DHistory! If you haven't, get your copy on @AppleMusic https://t.co/qYEj3RwRVN https://t.co/bDTOm3J6QS RT @Louis_Tomlinson: Hope everyone's doing good 🙃 Have you voted for 1D to win Video of the Year at this year's @BRITs? Vote using #BRITDRAGMEDOWN https://t.co/TyZff5aEBQ RT @Harry_Styles: So sad to hear more terrible news from Peshawar. Sending love to everyone there. H RT @Real_Liam_Payne: So happy everyone's enjoying history it's like the fandoms theme tune/anthem 👌🏼🙌🏻 Three years ago today, the guys hosted the Team 1D Japan Party! @1D_OfficialJP! #1DHistory https://t.co/mY0NVJxUDO RT @officialcharts: .@OneDirection's History is heading for a new personal best on this week's UK Chart: https://t.co/QaZcqjZtpb https://t.… RT @lizcalvario: When your sister @leslie219 gets you a @onedirection vinyl for your birthday 🙌🏽😍🎶 #OneDirection #HarryStyles https://t.co/… RT @Harry_Styles: One of the greatest ever. He will be missed by so many. Rest in love and peace Mr. Frey. https://t.co/JbNgE161KG RT @NiallOfficial: \"These cloudy days, make you wanna cry. It breaks your heart when someone leaves and you don't know why \" Glenn Frey Which 1D tracks always make your Monday playlist? https://t.co/mhuOub3HYC RT @Harry_Styles: Thank you to the @brits for the nominations, and thank you to everyone voting. Lovely you are. H Sunday Spin: #HeyAngel https://t.co/qoX418m5Ge The guys have left a surprise for you on their @AppleMusic page! Head over to https://t.co/o2qgslo1Wl to check it out! RT @brits: To vote for @onedirection, tweet using #BRITDRAGMEDOWN https://t.co/NCbycPKPTv 🎸 (https://t.co/7Vuz7oWvsn) https://t.co/eygnfNUwXs Just so you know, retweets DON'T count and you can only vote once per day! #BRITDRAGMEDOWN 1D are nominated for the British Artist Video award at this year's @Brits! Vote for them using #BRITDRAGMEDOWN https://t.co/GuFE7GzhYH #TBT to when Louis ripped Liam's shirt during #HondaCivicTour: https://t.co/jWEpnml7rX Pic: Cal Aurand @HondaStage https://t.co/xxlsly7v0z RT @syco: Congrats @onedirection on 2 @brits nominations for British Group &amp; British Artist Video for Drag Me Down! 🎉👏 #Brits https://t.co/… One Direction are nominated for two awards at this year's @BRITs! https://t.co/jZeMVd1Pje RT @brits: #BRITs 2016 British Group nominees: @blurofficial, @coldplay, @foals, @onedirection and @yearsandyears https://t.co/82kMLTQug1 RT @brits: #BRITs British Video nominees pt 2/2: @LittleMix, @NaughtyBoyMusic, @onedirection, @samsmithworld and @yearsandyears https://t.c… #OTRAThrowback: Dubai. Who was in the audience? 📷 Cal Aurand https://t.co/h9435LS7ku RT @Harry_Styles: Brilliant. One of the worlds greatest ever voices. She was good too. \n\nhttps://t.co/dWeIrQRKvx RT @Harry_Styles: Thinking of everyone in Jakarta. Love to you. H On this day in 2013, the guys travelled to Ghana to film a piece for @ComicRelief! #1DHistory https://t.co/6CBccSeAp2 RT @Harry_Styles: Love to Istanbul. So sad to hear more terrible news. Thinking of everyone there. H What's your favourite item in the guys' #MadeintheAM space?https://t.co/thYSMXT5s1 RT @stayradorothy: @onedirection way too many to count RT @j0anna05: @onedirection Lost count since the 13th of nov.. How many times do you think you've listened to #MadeintheAM since its release? Let us know! https://t.co/qYEj3ROtkn https://t.co/SPLa6YyqjF \"You and me....\" #1DHistory https://t.co/TF0in2mk6C RT @PauCGuz: @onedirection history 🤗💕 RT @salome_baez: @onedirection End Of The Day!💖💕 RT @sammivalentin: @onedirection end of the day Which tracks from #MadeInTheAm have you been listening to today? Let us know below! https://t.co/H09htTye18 https://t.co/b5KCCJHNWZ RT @HondaStage: 1D trivia! Where did @onedirection film the #DragMeDown vid? https://t.co/GK2DY3iQ14 #HondaCivicTour Pic: Cal Aurand https:… US fans! If you still need to grab your copy of #MadeInTheAM, head over to @Claires now! https://t.co/zRkwD98pxP https://t.co/sMEj2nhklY RT @ColumbiaRecords: .@OneDirection's video for #Perfect is now #VevoCertified with 100 Million Views! 🌟 https://t.co/EEBQxSqRz3 https://t.… 1D fans! You @Shazam the guys all year, now vote yourselves as the Best #Shazamily! https://t.co/H30a9MWzjk https://t.co/fkR8J7teMT Who else is listening to #1DHistory today? Let us know! https://t.co/H09htTye18 https://t.co/S7KRI3UwLI US fans! Start your #1DCivicDesignContest entry now: https://t.co/4wyBevvJWr (NoPurNec US/18+ See Rules) @HondaStage https://t.co/1fWbVsG12d Oh, hey Niall… https://t.co/Gia9wclwTM https://t.co/OtaPkdCOVw Sunday Spin: #Olivia https://t.co/QA3H5KELE9 RT @NiallOfficial: Happy new year everyone !! Hope you all had a great night last night . Love you all .... 🍻🎉❤️ RT @Louis_Tomlinson: Wow what an incredible new year ! Amazing to see everyone again and @CraigDavid killed it ! #OTRAThrowback: Dublin https://t.co/bz5F7UPpRA https://t.co/vkFoIR8m0C RT @BBCR1: Missed @onedirection picking the tunes and nattering to @Alicelevine? Catch up now &gt;&gt; https://t.co/yCh7z2IIhQ https://t.co/Atphq… RT @Harry_Styles: 2016. RT @Harry_Styles: Happy New Year. All the love. H RT @bpi_music: The album ‘Made in the A.M.’ by @OneDirection is now Platinum! #bpiAwards https://t.co/4ReAlPBTYd Happy New Year everyone! https://t.co/JtKekDunew RT @JustJared: Watch @OneDirection perform \"Drag Me Down\" and \"Perfect\" on NYE right here! Videos: https://t.co/96L6KZ6y2s https://t.co/U5n… RT @MTVUK: Happy New Year everyone! We hope you have the best 2016 and that all of your dreams come true 😘🎉✨🦄👊🏼💕 https://t.co/gxRLo2jABj Tune into @NYRE tonight on @ABC to see the guys perform! https://t.co/OXbdj3DYIB Tune in tomorrow to watch 1D perform! @NYRE #RockinEve US fans! Which songs do you want the guys to perform at @NYRE? Find out and watch #RockinEve 12/31 on ABC! RT @JKCorden: A Christmas Carpool Karaoke anyone?  https://t.co/6P7VLFkIe8 What's been your favourite 1D/ @JKCorden \nmoment this year?  https://t.co/Io05vAvExi\n\nhttps://t.co/SZc3FrCFlm\n\nhttps://t.co/QzdsQxzfGb US fans! Your last chance 2 win 1D's custom Civic! Enter: https://t.co/gtLuLySZmm (NoPurNec See Rules) @HondaStage https://t.co/EkmsUSe4Uv Thanks to all of you who have continued to support #MadeintheAM! Who still spins it at least once a day? https://t.co/H09htTye18 RT @Vevo_AU: \"If I didn't have you, I'd never see the sun\nYou taught me how to be someone\"\n@onedirection 🌚❤️🌞 #DragMeDown https://t.co/taAs… #1DR1LiveLounge sounds better and better every time. Who agrees? https://t.co/k2LA5qXBCP Hey, Hey, Hey… https://t.co/pdjZMn8ec5 #OTRAThrowback: Milwaukee https://t.co/YO0niWGnga Loving #1DHistory? Re-watch the guys' performance on @TheXFactor here. https://t.co/Iq2K3bZHxR We're having a #1DVideoMarathon today! Join in here, and let us know what you're watching! https://t.co/K3Tg6Oj5mF RT @chattyman: OMG!! The PERFECT #christmas present!! Performing #DragMeDown... it's @onedirection 🎄🎄🎄!! #chattyman https://t.co/BJ8qOccMeI RT @Louis_Tomlinson: Hope everyone has a lovely lovely day ! ⛄️⛄️🎄 RT @BBCR1: It's time for @onedirection's Xmas Takeover!!! Get listening &gt;&gt;&gt; https://t.co/48RuyAdouO #1DR1Xmas https://t.co/KmtF5QwiBF UK! The band are taking over @BBCR1 for one hour today! Tune in from 1pm #1DR1Xmas https://t.co/PTGmnK3R4c https://t.co/ODine3M8QP RT @NiallOfficial: Merry Christmas everyone ☃❤️🎄🍺. Have a great day wherever you are. Love you ... Food time 🍴 Merry Christmas everyone!🎄 RT @Harry_Styles: Merry Christmas to everyone for tomorrow. Hope it's a lovely one well spent. Good tidings to all. H RT @Real_Liam_Payne: Happy Christmas Eve everyone xx RT @Louis_Tomlinson: Thanks a lot for all the birthday messages ! You lot are too nice 🙃 We know what we're listening to ahead of tomorrow! Who else is with us? https://t.co/JXUT60Hcf9 RT @GMA: Happy Birthday to one of our @onedirection friends: @Louis_Tomlinson! 🎉 🎂 #HappyBirthdayLouis https://t.co/VHdrMwkaOV RT @syco: UK! On Xmas Eve, you can win a signed copy of @onedirection’s #MITAM!👉 https://t.co/bOn6e2Rwu8 #Syco12DaysPrizeDraw https://t.co/… RT @syco: Happy Birthday @Louis_Tomlinson! We hope you have an amazing day! 🎂🎉 #HappyBirthdayLouis https://t.co/lZuN7a4f2r RT @NiallOfficial: @Louis_Tomlinson happy birthday Tommo .. Have a great day and have a great Christmas , looking forward to seeing you mat… #HappyBirthdayLouis 🎉 https://t.co/33cbNYADQZ Because one karaoke wasn't enough! Check out 1D in this special @latelateshow Christmas carpool. https://t.co/Bt13CoAaRv Finish the lyric: \"We can live ______\" #1DHistory https://t.co/7lYilieOzq Did someone say #CarpoolKaraoke? https://t.co/SZc3FrCFlm Have you entered the #1DCivicDesignContest yet? Enter now: https://t.co/4wyBevvJWr (NoPurNec US/18+ See Rules) https://t.co/Rdzirt5Nrd What's on your 1D playlists today? Check out what we're listening to! https://t.co/H09htTgCCy Has it really been a week since the guys' EPIC performance on @TheXFactor? Watch both here\n\nhttps://t.co/Iq2K3bZHxR\nhttps://t.co/xZRZTUSHT8 \"We could be the greatest team, that the world has ever seen…\" https://t.co/TALiNldM0a Throwback to Mexico! Such an amazing night! https://t.co/e1RunT5I69 #OTRAThrowback: Who remembers which show this was? https://t.co/CIZRDzCUrH https://t.co/kYqA2nDgjh Sunday spin: #AM https://t.co/GqGUiNJokq #1DHistoryyyyyyyyyyyyyyy https://t.co/H09htTgCCy Start the weekend with 1D. Grab #MadeInTheAM on @applemusic now! https://t.co/qYEj3RwRVN https://t.co/FWeKqZhZ1G RT @MTVMusicUK: 1. Nobody can drag them down! @onedirection win #MTVStars for the 3rd time with 125,122,295 votes! 🏆 https://t.co/7WcAugBn3m How hilarious was the guys' #CarpoolKaraoke? Who can't stop watching? https://t.co/pBXrM1qvUQ RT @MTVNews: .@onedirection And More Bring ‘Joy To The World’ With Christmas Carpool Karaoke https://t.co/z0dJpXx1ws https://t.co/fhQ4yeKkdb RT @Metro_Ents: Well that's the drive home for Christmas music totally sorted @OneDirection @FleurEast @LittleMix https://t.co/56AlHKHby5 RT @Harry_Styles: Riding in cars with boys.\n\nhttps://t.co/NFVcwYViJW 1D will be taking over @BBCR1 on Christmas Day, playing their fave tracks from 1 - 2pm (GMT)! #1DR1Xmas Still giving us chills… https://t.co/N0ZIAFW62D RT @Real_Liam_Payne: Glad everyone's enjoying the album and hope u liked the carpool karaoke gotta love James Is anyone else in the mood for #WhatAFeeling today? We sure are! https://t.co/H09htTye18 Did you catch the guys playing Tattoo Roulette on @LateLateShow last week? Oh Niall… https://t.co/KtdHSR5Vlo US! #MadeInTheAM covers are still available at @Target. Pick up yours &amp; show us for a chance to win a signed one! https://t.co/dYs2CBzDh6 RT @Vevo_UK: And the winner of the 'UK Vid Of The Year' for #YearInVevo is... @onedirection's 'Drag Me Down'!\nhttps://t.co/kfXW7oupWU RT @JKCorden: So here it is. #1DCarpoolKaraoke I hope you enjoy watching it as much as I enjoyed making it with the boys x  https://t.co/FF… RT @latelateshow: .@onedirection to the rescue! #1DCarpoolKaraoke https://t.co/DACyXhh9LM Which is the one track you never skip when you listen to #MadeintheAM? https://t.co/H09htTye18 Xmas is fast approaching! Head over to the official 1D store and get your last minute gifts! https://t.co/0np1lzpdW0 RT @syco: What a night. Enjoy the break lads! @onedirection with @SimonCowell after their performance on @TheXFactor! https://t.co/mLrdFHHq… RT @NiallOfficial: Can't thank you enough to be honest ... Don't worry , we'll be back .. Looking forward to chilling for a while now RT @NiallOfficial: 5 of the best years of our lives so far.. Thank you all so much for your incredible support .I hope you guys realise wha… Your reaction to #1DHistory has been INCREDIBLE! The guys have decided to change it to the new single from #MadeInTheAM! WOW! What a performance from the guys last night on @TheXFactor! ICYMI, catch up here. https://t.co/Iq2K3bI6Gj #1DHistory RT @Harry_Styles: To you, you have changed our lives and no words will ever be good enough to thank you for what we have done together. RT @Harry_Styles: You are the greatest team mates we have ever known. Thank you. A message from One Direction to all of you!\nhttps://t.co/voO2LOnC0G RT @Eddrewett: 'History' was always my favourite. Said it a million times, amazing to see these chaps sing our song out to the world x Thank you! #XFactorFinal https://t.co/Sl1wzc2Vnx RT @TheXFactor: You and us have a WHOLE lot of #History, @onedirection. Over five whole years. Welcome home.✨ #XFactorFinal https://t.co/OL… RT @TheXFactor: .@SimonCowell: \"You've been an absolute pleasure to work with. Enjoy your time off.\" 💫 @onedirection #XFactorFinal RT @ITV: Thanks for 5 amazing years @onedirection - enjoy your break and see you again soon!\n\n#XFactorFinal https://t.co/7bFWc7oHHj #1DInfinity 🚀 RT @TheXFactor: Did somebody say...@onedirection?! 😅🎉🎉🎉 #XFactorFinal #XFactorFinal time!! The guys are on @TheXFactor soon! Who's watching?! UK, who's excited for 1D's performance on the #XFactorFinal tonight? https://t.co/c1OwdTYUXD https://t.co/Xazl2YiA82 RT @TheXFactor: We're so excited we're not sure we'll be able to sleep tonight... 😁🎉 @onedirection #XFactorFinal https://t.co/ix15aA2ygf RT @Louis_Tomlinson: Really enjoyed the X factor tonight ! Performances have been siiiiick ! #XFactor Less than two weeks to go until Christmas! Who's already got their bottle of #1DBetweenUs? https://t.co/HsxoX365QU https://t.co/bsHuofEeNg RT @NiallOfficial: Big day tomorrow.. Looking forward to it .. @TheXFactor #1DTorn https://t.co/FAd7vnNnta RT @chattyman: THANK YOU @onedirection!! Here's to many more memories together ❤️ ❤️ ❤️ #History #1DonChattyMan #chattyman https://t.co/Fmm… RT @Channel4: Just a small clip from the #1DonChattyMan Dance Off. Crikey, the @onedirection chaps can shift. #ChattyMan https://t.co/93oft… RT @iWant1D_Updates: Boys said they are most proud of this album (Made In The A.M.) cause they've been involved with this one the most! -A … RT @chattyman: ARGHHHHHHHH!!! IT'S @onedirection!!! #CHATTYMAN #1DonChattyMan https://t.co/gmQ409PAkR RT @Channel4: The @onedirection boys giving Alan Carr the low down... #ChattyMan https://t.co/vqRZXYFufi UK, who's tuned in? #1DOnChattyMan https://t.co/TR9y5PBS7r RT @chattyman: EEEEEE 😁😁😁!!! JUST 10 MINUTES UNTIL PARTY TIME 🎉🎉🎉!! #chattyman #1DonChattyMan https://t.co/Ui4P2z0vgx Anyone else listening to #MadeintheAM right now? Let us know which track. https://t.co/H09htTgCCy Watch 1D's 🔥🔥🔥 performance from the #BBCMusicAwards here! https://t.co/DieJvcykp2\nhttps://t.co/vnHglZ9slt RT @Harry_Styles: Next week on the @latelateshow.. @JKCorden will be using us for our carpool capacities. And we will be using him for that… RT @NiallOfficial: Next week .. @latelateshow @JKCorden #CarpoolKaraoke https://t.co/vimURNIIpB RT @BBCR1: Feast your eyes on the best pics of @onedirection from yesterday's #BBCMusicAwards https://t.co/K9dxON6FS8 https://t.co/y00Jjvu6… RT @chattyman: GET READY FOR A BATTLE!! @onedirection vs @AlanCarr tonight 10pm @Channel4 😂😂😂👏👏👏!! #1DonChattyMan #1Ddanceoff 🎉🎉🎉🎉 https://… RT @JKCorden: Next week...  https://t.co/z5fKCr1bsn RT @NiallOfficial: Tonight was great up in brum at the bbc awards.. Thank you all for having us . Much love RT @BBCR1: What a lovely chat with @onedirection! You can watch their #BBCMusicAwards performance tonight, 8pm on @BBCOne https://t.co/lugC… RT @AXSTV: No @TheXFactor finale is complete without @OneDirection! Watch them perform MONDAY 8/7c on @AXSTV! #UKintheUSA https://t.co/Ugh5… RT @bbcmusic: What would you give to be able to read @OneDirection's @Real_Liam_Payne's mind?...\n\n#BBCMusicAwards\nhttps://t.co/8dFF04587a #BBCMusicAwards https://t.co/rb61waaZPB RT @bbcmusic: Look who @BBCRadio2's @jowhiley bumped into backstage. Recognise these handsome lads? #BBCMusicAwards https://t.co/0kGnZ1c3km RT @SonyMusicUK: .@OneDirection arriving on the red carpet for the #BBCMusicAwards. Who’s excited? https://t.co/s8iTy5L88s RT @omimusiconline: Who isn't a #1D fan? Great meeting you @Real_Liam_Payne! #BBCMusicAwards #OMIarmy https://t.co/YiC7LzNhfh UK! All roads leads to the #BBCMusicAwards! Not coming to the show? Listen in here! https://t.co/yZLWtzif82 RT @Harry_Styles: At the BBC Music Awards. Thanks for having us, lovely spread you've put on. RT @Scouting4Girls: We had fun covering @onedirection on @BBCRadio2 yesterday with @jowhiley! Listen in here: https://t.co/tmWfGFemSa 😄 htt… How many nights would it take to count all those phones in the @JimmyKimmelLive​ audience?📱https://t.co/qYEj3RwRVN https://t.co/4VhEX2rXUs RT @Real_Liam_Payne: Hey angel 😏😇 RT @BBCR1: Our #TrackOfTheDay today comes from @onedirection with the gorgeous 'Infinity'. What do you think of this one? https://t.co/Zyuz… UK! #1DInfinity is @BBCR1's #Trackoftheday! Who else is loving it? https://t.co/BiseHDXVVK What a laugh taping @ChattyMan tonight ..he is the funniest guy ever .. Make sure to watch on Friday night - Niall https://t.co/c2XaoAyg5g US! Tune into Elf tonight at 8:45pm ET on @ABCFamily during @ABCF25Days to see 1D surprise some special fans! #PopUpSanta #25DaysOfChristmas RT @ABCFamily: Did you hear about @OneDirection’s #PopUpSanta surprise? Get the scoop from @EW: https://t.co/IEP2j0los3. #25DaysOfChristmas RT @chattyman: A whole lotta #History on Friday's #chattyman! #1DonChattyMan 👏👏👏👏👏👏👏👏👏👏👏👏👏 https://t.co/giYjNPYU74 RT @billboard: .@OneDirection has been named Billboard's Top Artists Duo/Group of 2015 💥 https://t.co/GI1WfFUJbY #YearInMusic https://t.co/… RT @TheXFactor: EXCITING NEWS: @onedirection to perform #Infinity at The #XFactor Final! More info: https://t.co/8WqszntXYf 🎤⭐️🎉 https://t.… \"It’s like I’m frozen but the world still turns...\" https://t.co/BiseHDXVVK Tell us in one word how happy listening to #MadeintheAM makes you feel! https://t.co/H09htTgCCy https://t.co/pQNOLRJFnL RT @ITV: Remember when @Harry_Styles told us he was perfect for us? He was talking to us right? @onedirection #RoyalVariety https://t.co/go… UK! Get a copy of #MadeintheAM as part of @ASDA’s 3 for £20 deal along with other pop faves\nhttps://t.co/16WUbCvNpD https://t.co/kypTnySjxt RT @ITV: EXCLUSIVE: @onedirection name new band member @jackwhitehall \n\nKind of! \n\n#RoyalVariety Tonight 7.30pm @ITV https://t.co/eDkYvdsrVw RT @Louis_Tomlinson: 🏠 Who else STILL can't stop watching the guys' Perfect performance on @JimmyKimmelLive? https://t.co/j2E62JKB2e UK! Tune into @ITV tonight from 7:30pm (GMT) to see the guys perform at this year's @RoyalVariety Performance! #OneDirection was the most used music hashtag on @Twitter in 2015, thanks to all of you! https://t.co/ZwR1STyfYG Thanks for some serious Monday LOLs @TheEllenShow https://t.co/D7T1qmQt8L \"I've been idolizing the light in your eyes\"... - Who can guess which 1D track we're singing today? https://t.co/QA3H5Knafz Keep voting for 1D as Favorite Group at the @PeoplesChoice Awards! https://t.co/q8uo55topz #PCAs https://t.co/CaVrtatjmi Sunday Spin. #EndoftheDay https://t.co/Sr5loPTAxb RT @iHeartRadio: Still can't get over their performance last night! @onedirection https://t.co/Ae36HtLW0u RT @JoJoWright: When @Real_Liam_Payne jacks ur phone, takes photo burst 📸 - Part 1 https://t.co/Frnu7CsZGe RT @JoJoWright: When @Real_Liam_Payne jacked my phone, took photo burst 📸 - part 4 - that's all - I think... https://t.co/KakzlF34Nk Have you grabbed your copy of #MadeInTheAM? Head over to @amazonmusic and do it now! https://t.co/RvvXRopvRI https://t.co/FeZqTQHJC0 Want exclusive 1D news first? Sign up to the official newsletter here. \nhttps://t.co/nLP1DPfMak RT @OnAirWithRyan: WE CAN'T EVEN @ONEDIRECTION RN #KIISJingleBall https://t.co/IML0TQSiFV RT @1027KIISFM: .@STAPLESCenter shook with screams when @onedirection took the #KIISJingleBall stage! https://t.co/PqtMuJgsuF https://t.co/… RT @OnAirWithRyan: This is what brotherhood looks like @onedirection #KIISJingleBall https://t.co/mbaGQxgc0a RT @latelateshow: Well hello. #1DLateLateShow https://t.co/73InUGfUdS RT @NiallOfficial: @STAPLESCenter is looking good tonight . Let's go LA @1027KIISFM #KIISJingleBall https://t.co/Z5t7Ss2ZSn Why not start the weekend by listening to 1D? Grab #MadeInTheAM on @applemusic now! https://t.co/qYEj3RwRVN https://t.co/KQZr5cQI2g Anyone else listened to #MadeInTheAM from start to finish today?  https://t.co/H09htTgCCy https://t.co/LUmEH78bSJ RT @STAPLESCenter: The @1027KIISFM #KIISJingleBall crowd loved @onedirection! @NiallOfficial @Harry_Styles @Real_Liam_Payne https://t.co/DT… LA, are you ready?! 1D take the stage tonight at the @1027KIISFM #KIISJingleBall! https://t.co/9MFQTAm2Cb https://t.co/dZHnKe2mqX US Fans! Don’t miss an exclusive performance of “Drag Me Down” after @RadioDisney’s Family Holiday tonight at 9pm on @DisneyChannel! RT @latelateshow: James played Tattoo Roulette with @OneDirection last night... and someone went home with a new tattoo! https://t.co/dEZW5… Can you design a 1D-inspired Honda Civic? https://t.co/4wyBevvJWr (NoPurNec US/18+ See Rules) #1DCivicDesignContest https://t.co/0OZZpel2TS \"Stuck in motion, but the wheels keep spinning 'round\" https://t.co/qYEj3ROtkn RT @latelateshow: Well look who it is! #1DLateLateShow https://t.co/6SDL8cd4sk Anyone else kind of miss @One_D_Potato? https://t.co/pErmyg8P6M Tune into the @latelateshow now to see 1D! 1D are nominated for Favorite Group at the @PeoplesChoice Awards! Vote now: https://t.co/q8uo55topz #PCAs https://t.co/XZ3AARAdZd RT @latelateshow: Guess who's back tonight? That's right -- @onedirection returns to the #LateLateShow tonight at 12:37/11:37 on CBS! https… US fans! Have you picked up your limited edition #MadeInTheAM covers at @Target? Do so while they last! https://t.co/neFc1D4wjh RT @bbcmusic: What do @onedirection love about the #BBCMusicAwards? Get tickets &amp; join them there: https://t.co/uIy56f7v7f\nhttps://t.co/mGa… Still haven’t grabbed your copy of #1DInfinity? Get it here. https://t.co/qYEj3ROtkn Still need to get your hands on a copy of #MadeintheAM? Head over to 1D's official store. https://t.co/5vDl8Z5tjx https://t.co/QpOSWOTR8h \"If you like midnight driving with the windows down\"...\nhttps://t.co/Gia9wcD7Lk https://t.co/VtfC10HGaI RT @Harry_Styles: Thank you to @iHeartRadio and everyone at the show in Dallas tonight for having us. You were very lovely. H RT @NiallOfficial: Dallas it's good to be back .. Can't wait to see you all out there tonight #DallasJingleBall RT @BBCR1: A truly perfect Live Lounge from @ollyofficial yesterday! Watch &gt;&gt;&gt;  https://t.co/Lrvy2ytu7y https://t.co/QAUJsfJaij A little throw back to the #1DR1LiveLounge https://t.co/k2LA5rfcun Who loves a #NiallSolo? https://t.co/4ccOghX9Fj https://t.co/IE9aSzHtpr How many times have you listened to #1DInfinity since you woke up this A.M.? \nhttps://t.co/BiseHDXVVK Christmas is fast approaching. Who has #1DBetweenUs on their wish list? https://t.co/7ira3UHlHO https://t.co/3pYnGBEIDa Who else is still laughing at this? #1DonKimmel https://t.co/bXJP5UwV33 Do you want to win a #1DBestChristmasEver w/ the guys?! Support @believeinmagicx &amp; meet them at X Factor Final! https://t.co/jHxPnr63aI Watch more footage from the making of 1D's @Honda commercial: https://t.co/ld9BlQL5Iv #HondaCivicTour @HondaStage https://t.co/Xbzq3v7gDd Guys, we want to see all of your #1DInfinityArt! Get sketching! Did you get your personalised print with your copy of #MadeintheAM on Black Friday? If not, there's still time! https://t.co/hjphsDmeoG 1D fans on @Spotify, which #MadeintheAM tracks have you played most since release day?     https://t.co/H09htTye18 https://t.co/ooudSGgQBi Get your 1D stocking fillers in time for Christmas! https://t.co/C9Mt2mHFjS https://t.co/oyNVvkiL83 1D fans on @Spotify, who can’t stop listening to the band’s latest single, #1DInfinity? https://t.co/fdu4Jyq8Sv What's up Niall? https://t.co/gfG1gCbpxy Sunday spin: https://t.co/H09htTgCCy #MadeintheAM https://t.co/40XGzMaIxY If you didn't manage to grab your copy of #MadeintheAM on release day, no worries! You can still grab it here. https://t.co/5vDl8Z5tjx “How many nights does it take to count the stars”? #1DInfinity https://t.co/qYEj3ROtkn Have you watched all three of the #MadeintheAM. Track-by-track clips? If not, catch up here. https://t.co/K3Tg6Oj5mF Friday #MadeintheAM marathon? Why not! https://t.co/H09htTgCCy\n\nWho's with us? Support kids on landfills https://t.co/JKEf8CfKq3 Bid on 1D's shoes https://t.co/Vq91vTQcSm @SmallStepsDocs #CelebrityShoeAuction RT @SpotifyUK: Watch this! 🔥⚡️👌 @onedirection win big at #PingPongPlaylist AND still have time to jam out some #ShaniaTwain\nhttps://t.co/6T… Check out the @radiodisney app for an exclusive performance of #DragMeDown from 1D! https://t.co/DWQ69axh3n Still. So. Perfect! https://t.co/1ySsCLV8WO It’s true! 1D WILL be performing on @TheXFactor live final on December 13 2015! Who else can’t wait? https://t.co/H4Aj9ivZHb ICYMI! #1DInfinity is the third single from #MadeintheAM! Get your copy of the track here. https://t.co/qYEj3ROtkn Louis appreciation!\nhttps://t.co/pdjZMn8ec5 RT @NiallOfficial: Muchas Gracias Mexico . Hasta Luego ! RT @Harry_Styles: Thank you for having us Mexico. You're always lovely to us. It's been too long. Love to you. H RT @Real_Liam_Payne: Infinity is the next single off #MadeInTheAM! #MadeintheAM's music to Liam's ears. Who else can't stop listening? https://t.co/H09htTgCCy https://t.co/FUA0xqzqWc Happy Thanksgiving to all our US fans! https://t.co/VRxM9bxBQq TBT: show us your reaction when #DragMeDown dropped back in July! https://t.co/orEz8bKrm3 RT @NiallOfficial: Buenas tardes Mexico City .. It's good to be back , it's been a while ! Exciting couple of days ahead . RT @Tony__Aguilar: Video-Entrevista con @NiallOfficial y @Harry_Styles finalizada! Que tíos tan fantásticos y cariñosos! Thanks mates! http… RT @gwengl333: ❤️ @NiallOfficial @Harry_Styles \n@Real_Liam_Payne @Louis_Tomlinson @onedirection https://t.co/FnmYQcFB3m Mexico City . - https://t.co/7Vuz7oWvsn https://t.co/f3K6yGULZM Time’s running out to win a #1DBestChristmasEver w/ the guys! Support @believeinmagicx &amp; meet them! https://t.co/jHxPnrnE2g RT @Louis_Tomlinson: @MITAMPromoTeam Thank you for your video 😊https://t.co/zrfdh5LiU7 Afternoon Mr. Styles. https://t.co/lBPIkqh9gM In case you missed it: check out part one of the guys' #MadeintheAM track-by-track. \nhttps://t.co/nN0XLIxxvY The final part of the #MadeintheAM track-by-track is here! Which part's your fave? https://t.co/mG7OMrCztI Here’s 1D’s performance of “Perfect” from @theAMAs! https://t.co/hf7udEBBtn Head over to @Flipagram to check out the latest flip from 1D! https://t.co/JCdc6lunDy Part 2 of the guys' full #MadeintheAM track-by-track is here. Watch below! https://t.co/TV0AexymUM Where are all of the Ultimate 1D Fans? We wanna see those wristbands! https://t.co/31hBNyXsnD https://t.co/GAlqYX8tLa RT @Shazam: .@OneDirection's #AMAs performance was THE most Shazamed moment of the night. See them all: https://t.co/ToTebJV8zK https://t.c… Did you catch all of the #1DLDNSession episodes on @AppleMusic last week? If not, catch up here. https://t.co/o2qgslo1Wl Watch Liam do all of his own stunts for 1D's @Honda commercial: https://t.co/p9NNMYiG1w #HondaCivicTour @HondaStage https://t.co/4IM1afGyum A special thank you to everyone who helped get #MadeintheAM to No.1 in the UK! Who's still listening every day? https://t.co/5vDl8Z5tjx RT @MTV_Denmark: WOW @onedirection! 😍 #AMAs #AMAs1D https://t.co/WP33sEuQbq RT @FifthHarmony: with dem boys @onedirection #AMAs https://t.co/ZaGv9Dd0Nd RT @GMA: It was hugs all around as @onedirection won Best Band/Best Artist at #AMAs... AGAIN. #AMAs1D https://t.co/iMZqYq4ghT 1D won Artist of the Year at the AMA's! Thank you so much to who everyone who voted! https://t.co/uEQ2d31kpd Who loves the guys' performance on the #AMAs? https://t.co/aUgqMjpNOs 1D won the Best Duo or Group at the AMA's! Thank you to everyone who voted! #AMAs1D https://t.co/cSzRvaOhOK The guys on the red carpet for the #AMAS1D https://t.co/wfYPB9C6cS RT @Real_Liam_Payne: #AMAs1D RT @TheAMAs: You heard @OneDirection! Let's get this tweeting party started &amp; tweet #AMAs1D to get ready for TONIGHT! BOO-YAH!\nhttps://t.co… RT @TheAMAs: Let's do this! 👊 #AMAs1D  https://t.co/zGCYk7WY9D RT @NiallOfficial: Here we go . It's @TheAMAs Sunday .. Can't wait for tonight .. Love Drag Me Down, Perfect &amp; Infinity? Grab your copy of Made in the A.M. Now! https://t.co/qYEj3RwRVN https://t.co/doREsX2rIM Who still can't stop watching the guys performance on the @TheXFactor​ last weekend? Watch again here. https://t.co/1ySsCMcKlo Fancy a #MadeintheAM marathon? Head over to 1D's official @Spotify playlist now! https://t.co/H09htTgCCy RT @SpotifyUK: Here's @NiallOfficial's #SpotifyFace. Snap a #XFactor reaction &amp; win #SpotifySession tickets https://t.co/xNsLTScOHy https:/… RT @JRossShow: -@wossy “I have never been naked in public” @onedirection and @McInTweet are surprisingly shy #TheJRShow https://t.co/fz201L… Not sure where you can grab your copy of #MadeintheAM? Please see below:  https://t.co/5vDl8Z5tjx https://t.co/QSTpweJCGN The first part of 1D's #MadeintheAM track-by-track is here! Watch now. https://t.co/nN0XLIP8Uy You and me, got a whole lotta' history... http:https://t.co/bZx1EdFFwc RT @NiallOfficial: Ireland 🇮🇪.. Thank you guys so much RT @TheAMAs: See what we did there? 😏 #AMAs1D is going to be PERFECT. See you this Sunday, @onedirection! #AMAs https://t.co/k8XNiqds8B Thank you for the swag @Twitter! The guys are ready for the #AMAs1D https://t.co/5YTabksE3e RT @TheAMAs: 🚨 @onedirection is in the building. I REPEAT. ONE DIRECTION IS IN THE BUILDING. 🚨 Rehearsal time! #AMAs1D RT @Harry_Styles: Made In The AM is number one in the UK. So happy that people are liking it. We're very proud of it. Thank you. H RT @jimmykimmel: Last night a star was born @One_D_Potato @OneDirection\nhttps://t.co/f0HSCdjnyv RT @JRossShow: Tomorrow, @McInTweet is joining @onedirection as the new member! Or maybe he'll just sit next to them on the couch. https://… RT @Real_Liam_Payne: Yayyyyy number one in the uk so amazing this record means a lot to us so happy u guys are loving it thanks you x RT @Louis_Tomlinson: Means so much to get a number 1 in our home countries ! Buzziiiiiiiing RT @Louis_Tomlinson: Thank you so much to everyone who has bought the album so far! Proud day today RT @NiallOfficial: People of the UK ! What a great feeling to Wake up and find out that you've got a number 1 album . Thank you so much , m… RT @BBCR1: .@onedirection have the No.1 Album with Made In The A.M., the fastest selling album of 2015! https://t.co/kGyXmrcxJ7 https://t.c… RT @officialcharts: .@onedirection's #MadeInTheAM is officially the fastest selling album of 2015! Go #1D! https://t.co/eOhho71CPc https://… RT @officialcharts: .@onedirection beat @justinbieber to albums #No1. We track how they did it. https://t.co/DnnwA7KooB https://t.co/OGWxB8… #LoveYouGoodbye vibes today! Who else is listening? https://t.co/H09htTgCCy How many of you watched the guys' performance on @TheXFactor last weekend? If you missed it, catch up below! https://t.co/1ySsCMcKlo Which track are you listening to most from #MadeintheAM? Tweet us your faves! https://t.co/bZx1EdFFwc 1D family! We want to see all of the fan art you've made over the years, show us using #1DUltimateArt! RT @loosewomen: Now @onedirection have a Loose Women mug they really have it all. Full interview here: https://t.co/dX4d2gs9wq https://t.co… RT @NiallOfficial: @JimmyKimmelLive @jimmykimmel thank you so much for having us, Had a great laugh.Also to shut down Hollywood blvd is pre… RT @JimmyKimmelLive: Backstage at #Kimmel - NEW show tonight with @OneDirection #MadeInTheAM 11:35|10:35c #ABC https://t.co/3SRS5FL49m Wanna meet 1D at a secret location in London?! Support @believeinmagicx + win the #1DBestChristmasEver! https://t.co/jHxPnrnE2g Kimmel / Hollywood blvd / #madeintheam / - Niall https://t.co/ISjbe6O4oc RT @JimmyKimmelLive: TONIGHT we're shutting down Hollywood Blvd. for @OneDirection - and a potato. @One_D_Potato #Directioners https://t.co… Tune into @JimmyKimmelLive NOW to see the guys perform and take over Hollywood Boulevard! https://t.co/YLYv95JhHM US! Head to @Target to grab your limited edition covers of the boys &amp; complete your collection! ..then show you did! https://t.co/R7HlsbIDAc RT @NiallOfficial: https://t.co/IpvIHqVktu RT @AppleMusic: The final episode!!\nRelive @onedirection's #1DLDNSession:\nhttps://t.co/7sgB2gwWfW\nhttps://t.co/hAXjg9Davr .@TheEllenShow kicks off now with the guys performing \"Love You Goodbye.\" Tune in! https://t.co/ESmWSIDJOu .@NiallOfficial and @Real_Liam_Payne were @OnAirWithRyan this morning. Check it out! https://t.co/aPumDhHfBG https://t.co/zzk6TfAaBR RT @Harry_Styles: So happy to have the album out now. Hope you're loving it. H\n\nhttps://t.co/E8IoPKGEpI RT @Shazam: #Directioners! What's your fav song off #MadeInTheAM? #Shazam it &amp; share with us using #ShazamInTheAM. @onedirection https://t.… RT @SimonCowell: So proud of @onedirection - I do think this is their best album to date. Thank you for all of your support https://t.co/Be… RT @Alex_murphyxo: @NiallOfficial got my ultimate fan editon album with the bracelet &amp; got it full blast on my speakers #MadeInTheAM ❤️ htt… #1DFollowSprees RT @RyanSeacrest: it's feeding time for king @NiallOfficial https://t.co/JmioTuqD5s RT @NiallOfficial: Loving all the support for the album ! #1DNiall  https://t.co/Jw1oKknKL9 RT @Real_Liam_Payne: Love seeing what you all think of the album! What are your favourite lyrics? #MadeinthAM #1DLiam https://t.co/zAO7vHJI… RT @betty_rojas91: I got my copy's of @onedirection made in the am @Target have you? #MadeInTheAM https://t.co/E00Sg3dCp9 WATCH: The final episode of #1DLDNSession w/ @AppleMusic is NOW LIVE! Tune in here. https://t.co/o2qgslo1Wl\nhttps://t.co/F6HbZnLIeZ RT @OnAirWithRyan: .@NiallOfficial &amp; @Real_Liam_Payne prank call music store about @OneDirection's album sales: https://t.co/t84CB6U0HL htt… @CherylOfficial Thanks Cheryl! RT @CherylOfficial: It's crazy to think what these guys have achieved! It's amazing to have watched their growth. Great album boys 🙌🏼 https… It's the last day to vote @onedirection as @TheAMAs Artist of the Year. Vote now! https://t.co/yJmXBhoZYc #AMAs https://t.co/rX6ObRYq92 RT @MITAMPromoTeam: Through the wire, through the wire, through the wire \nIm watching you like this, imagining your mine\n#MTVStars One Dire… @backstreetboys Thank you!! RT @ep1D_FIYM: @syco @onedirection I want to write you a song💘 RT @Louis_Tomlinson: Thank you to all our fans for all your support for the album ! #MadeInTheAM https://t.co/7Pgxbf9OWi RT @Nash_Arinaaa: @syco @onedirection Love You Goodbye. Just something about that song, you can actually picture it in your head and it's h… RT @LoveHimGoodbye_: Being stuck in traffic is actually awesome when you have #MadeInTheAM blasting! 💕@onedirection https://t.co/GEKxOwRTNJ RT @GianzGmez: @syco @onedirection I change everyday, I can't decide but today my favourites are: Never Enough, If I Could Fly, A.M... RT @bbcmusic: ICYMI: @onedirection are joining us for the #BBCMusicAwards in Birmingham!! Tickets &amp; info: https://t.co/sVpkszpiZ0 https://t… RT @syco: What's your favourite track from #MadeInTheAM? https://t.co/VGCgrRqqhR #1D https://t.co/1hjs4eF5pq RT @BBCR1: #TBT - when @onedirection gave us all goosebumps with their Live Lounge cover of 'Torn'&gt;&gt; https://t.co/TE0BFFAXag https://t.co/8… Still need to catch up on episodes 1,2 and 3 of #1DLDNSession on @AppleMusic? Watch here. https://t.co/nffufAaQDU You and me gotta whole lotta... #1DHistory! ‘Til the end .x  https://t.co/qYEj3RwRVN\nhttps://t.co/7ObMPSERcv Aussies! Thank you so much for voting for 1D at this year's #ARIAs for Best International Act! If you haven't voted: https://t.co/1NO5kh0iVM If your country didn’t get a custom #1DEmoji, there’s a special treat for you behind the golden globe at https://t.co/thYSMXT5s1! Get it NOW Check out 1D's performance of \"Perfect\" on @TheEllenShow today! https://t.co/vtXip1Pxsy 1D's #MadeInTheAM can be streamed on @amazonmusic’s #PrimeMusic! https://t.co/joLJzdIyMb https://t.co/zPTL7PrYDh US fans! Looking for #MadeInTheAM on vinyl? Head to @UrbanOutfitters to grab yours today! https://t.co/S3jXPbS8ZY https://t.co/sVZ1TcrCWi Are you tuned into @TheEllenShow watching the guys? Do so now! https://t.co/DHw8pa3aBb RT @AppleMusic: Episode 3 of @OneDirection’s #1DLDNSession is here!\nS/O to #1DHarry’s hair.\nhttps://t.co/XavFdyPWqO\nhttps://t.co/tKtprrljFb RT @Real_Liam_Payne: #MadeIntheAM @on @Spotify https://t.co/vM72jCXLQQ RT @NiallOfficial: If you wanna stream the album go on @Spotify and have a listen RT @NiallOfficial: https://t.co/K32It0624s RT @TheEllenShow: .@OneDirection loves to celebrate fall. #1DonEllen\nhttps://t.co/XQVzjSLG0R US! 1D are on @TheEllenShow! Tune in now to watch and see the guys perform. https://t.co/ZuhiNcUtBZ RT @1Dupdategirls: (UK only) Ultimate fan edition of #MadeInTheAM 🙌🏼👌🏼 -H #1D  https://t.co/bJpZSSTPWJ That’s it for the #1DSpotifyPlayback on @Spotify! Check out the final new audio note, here! https://t.co/6eLWij6H4v US! Get excited. 1D is returning to headline @OfficialNYRE from Hollywood on 12/31! #RockinEve https://t.co/cqvC1T3wxr RT @MTVUK: 7 emotions fans go through in trying to get @onedirection's #MadeInTheAM to no.1 https://t.co/r3ZZ8hBLsP https://t.co/TZOCWkZR7H 30 mins to go until the next exclusive @Spotify content drop in the #1DSpotifyPlayback! Who’s enjoying so far? https://t.co/6eLWij6H4v It's time for episode. 3 of #1DLDNSession w/ @AppleMusic! Head over to https://t.co/o2qgslo1Wl to tune in NOW!\nhttps://t.co/UrfOdGGGH7 The #1DSpotifyPlayback is still taking place on @SpotifyUK, you won’t want to miss the latest exclusive pic! https://t.co/H09htTgCCy RT @SpotifyUK: Question: what do #onedirection think about their fans? Head to the official #1D playlist for #1DSpotifyPlayback https://t.c… The guys have just dropped another exclusive audio clip over on @SpotifyUK, see what it is now! https://t.co/6eLWij6H4v #1DSpotifyPlayback 1D performed on #GMA40 this morning! Watch their performance here: https://t.co/wiTUEE2uMK #1DonGMA https://t.co/8z8NeL2d45 #1DSpotifyPlayback is taking place right now on @SpotifyUK! Head over now to see the first exclusive image! https://t.co/6eLWijoit5 UK! Looking for your Ultimate Fan Edition of #MadeintheAM? Grab yours now from @HMVTweets! https://t.co/ws42an7PfV https://t.co/N1eGjkYiTh RT @RebelWilson: These guys are the best @Harry_Styles @Louis_Tomlinson @Real_Liam_Payne @NiallOfficial X https://t.co/ehO2l6S6d4 RT @NiallOfficial: #MadeInTheAM having a great time on this promo run. doing some really cool shows , havin a laugh.. RT @Real_Liam_Payne: How many of you have this version of #MadeInTheAM?? #1DLiam https://t.co/a4tw6AIHeG RT @Real_Liam_Payne: Check out what happened at our London Session https://t.co/zr9uOhel9Q RT @Harry_Styles: https://t.co/eH1XxgX66I Head over to https://t.co/thYSMYaGQB NOW to see if your country got a custom country emoji in the #1DEmoji battle! RT @GMA: YOU AND ME... #History #1DonGMA #GMA40 #MadeInTheAM @onedirection https://t.co/NdpawfqPo5 https://t.co/DkhpEutcwo Who's watching? https://t.co/wiTUEEk5Ei? #GMA40 #1DonGMA https://t.co/gzV5eMSaKa RT @GMA: Retweet if you’re ready for @OneDirection!\nTweet with #1DonGMA and #GMA40! \nhttps://t.co/NdpawfIqfD https://t.co/HGEZcIMirA 1D is about to take the stage for the @GMA live stream. Tune in here: https://t.co/TfJkgNNIjI #1DonGMA #GMA40 Can you do it? #1DonGMA #GMA40 https://t.co/V2fataveY4 Check it out! You can connect with 1D on @Spotify for exclusive #MadeInTheAM content. https://t.co/2QCBoIDOvE Tune into the global @GMA live stream NOW to see 1D LIVE! #GMA40 #1DonGMA https://t.co/TfJkgNNIjI Does your country have the biggest 1D fans? The #1DEmoji results are in! Check now at https://t.co/thYSMXT5s1 RT @GMA: Want to see your @onedirection tweet on our #GMA40 live-stream?\n\nTweet us what you're most excited about! #1DonGMA #MadeInTheAM That's a wrap! Head over to https://t.co/thYSMXT5s1 to see if your country will be getting a custom #1DEmoji! 30 mins to go! Find out where your country is on the #1DEmoji leaderboard now. https://t.co/thYSMXT5s1 RT @AppleMusic: #1DLDNSession Ep. 2 is here!\n#MadeInTheAM stories &amp; more, only on #AppleMusic. @OneDirection\nhttps://t.co/Llgvc58czD\nhttps:… #MadeInTheAM is out now! Make sure to grab your copy on @amazonmusic. https://t.co/ALT9yPb3WJ https://t.co/KD8k2gFA0H RT @GMA: JUST 6 MORE HOURS. @onedirection\n\n#1DonGMA #GMA40 #MadeInTheAM #1D\n\nWATCH HERE: https://t.co/xlnvvcExHD https://t.co/Pzi5g3liAh Head to @Spotify’s Teen Party playlist now to be a part of the 1D takeover. #1DTeenParty https://t.co/01CoB0EGG1 https://t.co/O9OmGbhAp0 Make sure to grab your copy of #MadeInTheAM on @GooglePlay. We want to hear what you think! https://t.co/wrPO55c9KX https://t.co/qK0ttkOEjl Which countries are in the lead? Take a look and find out! https://t.co/thYSMXT5s1 #1DEmoji Are you listening to 1D's Teen Party playlist takeover? Head to @Spotify now! #1DTeenParty https://t.co/01CoB0EGG1 https://t.co/ezEArXLcbr Show 1D that you've picked up #MadeInTheAM. Your @Flipagram may just be reflipped! https://t.co/Qr3p1YD15P Ready for episode 2 of #1DLDNSession w/ @AppleMusic? It's here. Watch NOW. https://t.co/hZ7QUDr3S8\nhttps://t.co/9m6E3ZesA9 Have you voted for @OneDirection as #AMAs Artist of the Year? Do it now! https://t.co/9sLp6XUFQk https://t.co/yWgz1aC3g9 USA! Have you picked up your exclusive @Target versions of #MadeInTheAM? Hurry, they're limited! https://t.co/AHTTi4gE35 Keep checking the #1DEmoji leaderboard to see who's in the lead! https://t.co/thYSMXT5s1 Send us your questions for @OneDirection using #1DonGMA for a chance to have the boys answer them LIVE on the @GMA live-stream. #GMA40 1D are taking over @Spotify's Teen Party playlist now. Follow along and listen! #1DTeenParty https://t.co/01CoB0EGG1 https://t.co/ETusE0RsY1 If you'd like a 1D Wristband and exclusive photo cards with your copy of #MadeintheAM, grab yours from @Amazon. https://t.co/31hBNzf3fb How many times have you watched the #PerfectMusicVideo since the guys' performance on @TheXFactor this week? https://t.co/mqrcNCW82S Keep tweeting for your chance to get your custom country emoji,  using your country's #1DEmoji hashtag! https://t.co/thYSMXT5s1 1D have teamed up with @Twitter to find the country with the biggest fans! Head over to https://t.co/thYSMXT5s1 NOW to take part! RT @AppleMusic: .@OneDirection like you've never seen them before.\nThe #1DLDNSession, only on #AppleMusic:\nhttps://t.co/Cb8cguEBeR\nhttps://… 1D is taking over @Spotify's Teen Party playlist tmrw. What's your favorite #MadeInTheAM track?! https://t.co/GMGbGfUELX #1DEmoji battle commences at 00:01 (GMT)! Think your country has the biggest fans? Get ready to prove it. https://t.co/thYSMYaGQB RT @ABCFamily: Tweet a photo of your fan love for @OneDirection using #ABCFamily1DSweepstakes to enter for a chance to win an exclusive 1D/… It's here! You can watch the first episode of #1DLDNSession on @AppleMusic NOW! https://t.co/hZ7QUD9t0A https://t.co/OLdcZ5UIoW US fans! 1D tests The All-New 2016 @Honda Civic! Watch: https://t.co/iEOfUIJVwG #HondaCivicTour @HondaStage https://t.co/uowLB7C6O7 Who else spent the WHOLE WEEKEND listening to #MadeintheAM? https://t.co/0EeMrPrKbd Help the guys win #BestInternationalAct at the Australian @ARIA_Official Awards! VOTE HERE: https://t.co/1NO5kgII4e RT @AppleMusicES: #1D \n#1DHarry\n#1DLiam\n#1DLouis\n#1DNiall\n#MadeInTheAM ya disponible. \n@onedirection ❤\nhttps://t.co/FiORTHfi16 https://t.co… RT @SpotifyMexico: ¡Ya está aquí lo nuevo de @onedirection! Dale play a \"Made in the A.M.\" ahora. https://t.co/pZvWDL81wj https://t.co/IVGd… RT @itvthismorning: Er, nice bunny ears, @NiallOfficial! (Sorry, couldn't resist) #OneDirection https://t.co/Q5UmCQ4Edj Tune in to the first clip from #1DLDNSession w/ @AppleMusic today at 5pm/9am (GMT/PST). https://t.co/hZ7QUD9t0A https://t.co/IdmFCEUItt RT @R1Breakfast: Thanks for all you #1dOnGrimmy Qs! WATCH the full @onedirection/@grimmers interview here &gt; https://t.co/4eSVFlBsAU 😀 https… RT @R1Breakfast: Come and join the @onedirection boys and our @grimmers on the radio NOW NOW NOW NOW! 😋#1dOnGrimmy https://t.co/KF7pzkRaMh RT @grimmers: these guys on the show today from 8am #1dOnGrimmy @ BBC Radio 1 &amp; Radio 1Xtra Studios https://t.co/4CXXBSRxzq RT @grimmers: We have @onedirection on the show tomorrow morning. See you from 6.30am ✌🏼️ RT @Louis_Tomlinson: Amazing to be back on the X factor tonight ! Thanks for having us ! #XFactor WHO caught the guys' epic @TheXFactor performance tonight? https://t.co/1ySsCMcKlo Thank you. Love Louis, Liam, Niall &amp; Harry x Catch highlights from 1D's performance and interview at #1DLDNSession on @AppleMusic from 5pm GMT/9am PST tomorrow!\nhttps://t.co/udlrg6xj1V RT @TheXFactor: .@onedirection will be answering your questions on #XtraFactor later tonight! Tweet #Ask1D and we might just pick your ques… UK! One Direction are performing on the @TheXFactor​ TONIGHT! Be sure to tune in from 8pm GMT on @ITV​! https://t.co/BceGJsACa2 RT @NiallOfficial: Going home tonight ! @TheXFactor .. Can't wait RT @Harry_Styles: My love for all of you has no end. Thank you for tonight. H That's a wrap #1DLDNSession! Thanks @JKCorden. Stay tuned to find out when you can watch highlights on @AppleMusic! https://t.co/KeUaogBMbt The band onstage at   #1DLDNSession w/ @AppleMusic! https://t.co/mCxZU5KqNj Great snap of the guys onstage with @JKCorden from #1DLDNSession with @AppleMusic! https://t.co/FrwppzSIxP https://t.co/eoZpKsfblt Haven't got your copy of #MadeintheAM yet? Where have you BEEN?! Grab yours here. https://t.co/qYEj3RwRVN https://t.co/lVPbs4faGs US fans! Post a photo with all 4 @Target albums that you purchased for a chance to win a signed cover! https://t.co/qqbSVuxqzo RT @jessleal7: Because 1 copy isn't enough... #1DMITAMSELFIE #MADEINTHEAM @onedirection https://t.co/EAbHXItWkr RT @Naickers1D: Hey Target is selling limited edition album covers of Made In The AM that will only be there will stocks last...Go out and … RT @Spotify: Every #Directioner online right now: 😍😍😍 Stream @onedirection's #MadeintheAM #Fr1Day13 https://t.co/9KRjcl2aCm RT @KimberleyDadds: Louis Tomlinson Rang Me When I Wasn't Expecting It: A Memoir https://t.co/SEMmpxra6q RT @justdancegame: Thanks to the fans for getting No Control on #JUSTDANCE2016! Get the game &amp; #MADEINTHEAM: https://t.co/jSVABzuodh\nhttps:… RT @TheDrum: Twitter partners with @OneDirection in global bid to find the band's biggest fans https://t.co/CjmMTIGRol https://t.co/fFBl1ZC… How many of you have followed the Official 1D Playlist today? If you haven't, you can do so here. \nhttps://t.co/6eLWij6H4v RT @kategarraway: Tks @NiallOfficial - already got &amp; loving - for all pestered parents here's how to get #MadeInTheAM xx https://t.co/HbE2m… RT @ColumbiaRecords: It's finally here! Get @OneDirection's 5th album #MadeInTheAM now! https://t.co/b4grQtus1Q https://t.co/wmNNeA3D5R US fans! #MadeInTheAM is here! Head to @Target for your exclusive limited edition covers featuring each of the boys. https://t.co/UznOoXDK8f Check out @OneDirection's AM Radio where you can find secret 1D stations! #1DRadio https://t.co/tsgvfhD0j3 https://t.co/VFHENH2TEP UK! Who's grabbed the ultimate fan edition of #MadeintheAM? Get yours from @HMVTweets.\n https://t.co/ws42an7PfV https://t.co/lJdxzAjZrs 1D Family! Tweet us your Ultimate #MadeInTheAM Top 5! #1DFollowSprees https://t.co/hat3mmBJUX #1D #MadeInTheAM - https://t.co/thYSMXT5s1 RT @hmvtweets: Be quick! #hmvExclusive versions of @onedirection's #MadeInTheAM out now in-store only https://t.co/jkwkkDzko9 NYC! Come to the @Sony store NOW to pick up #MadeInTheAM &amp; enter to see the guys live. https://t.co/M287pROYiP\nhttps://t.co/1IvGWFF3j2 RT @AppleMusic: #MadeInTheAM is here!! \n#1D\n#1DHarry\n#1DLiam\n#1DLouis\n#1DNiall\n@onedirection \nhttps://t.co/bU6GpYu66s https://t.co/WgoCNZsQ… RT @Real_Liam_Payne: #MadeInThAM https://t.co/fJMtOAZiFk RT @Target: Share your #MadeInTheAM selfie with us! RT @ryalmighty: Yo, @onedirection &amp; @Target. Thanx 4 hooking me up! #1D https://t.co/BG… Real life emoji @NiallOfficial https://t.co/NadDRoPRsE RT @itsdemetras: Hey angel do you know the reason why we look up to the sky? @onedirection #MadeInTheAM RT @ollyofficial: #MadeInTheAM out now! really wanted to use the hashtag! Proper Jel...I wanna get one.. Love these lads @onedirection http… RT @GMA: Happy #MadeInTheAM Day, @onedirection! Congrats to the guys on the new album! #1D #1DHarry #1DLiam #1DLouis #1DNiall https://t.co/… RT @BBCRadio2: Yes - that's right - @onedirection - on with Steve Wright - this afternoon! https://t.co/GjF1BeMtag Happy Release Day! 1D are @Flipagram's Spotlight Artist. Follow the guys on the app and check out their first post! https://t.co/GC3djOXnSJ RT @SpotifyUK: It's #1D lucky #Fr1Day13 🍀🍀. No more sleeps. #onedirection's #MadeintheAM is here https://t.co/sGbHZhMgqc\n\nhttps://t.co/4ZPF… RT @Louis_Tomlinson: Big day today ! We've been waiting for this moment and we're excited for you guys to hear it finally ! https://t.co/7P… Have you grabbed your copy of #MadeInTheAM? Show us! https://t.co/Li4pV6CFhN RT @Vevo_UK: Get watching #1DR1LiveLounge session up on Vevo here: https://t.co/gGcsaf628b @onedirection https://t.co/0shm9WzaY4 Now you've all heard it, what's your favourite track from #MadeInTheAM? Let us know below! https://t.co/qYEj3RwRVN ICYMI: One Direction released their album #MadeintheAM earlier. Which track can you NOT stop listening to? https://t.co/H09htTye18 RT @syco: Today's the day! @onedirection's brand new album #MadeInTheAM is out now! https://t.co/VGCgrRqqhR #1D https://t.co/UmUqEjFVvH RT @Real_Liam_Payne: ALBUM IS OUT BEST DAY EVER RT @SonyMusicUK: It’s finally here! Get @OneDirection’s new album #MadeInTheAM now: https://t.co/jvspd0QpYM https://t.co/D1HvFvKSIi RT @NiallOfficial: You can go and get #MadeInTheAM here . Glad you're enjoying it so far  https://t.co/Jw1oKk69TB RT @ZozeeBo: So excited to listen to #MadeInTheAM 🎧 RT @Chachou_rou: All the songs of #MadeInTheAM are so beautiful...thank you for everything you have done in the last 5 years, and all you a… RT @Harry_Styles: Made In The Am.\nIt is now yours, we hope you like it as much as we like you. \nLove all round. H \n\nhttps://t.co/E8IoPKGEpI RT @TwitterUK: 1D fans! Brace yourselves for exclusive new emojis and a global #MadeInTheAM fan competition https://t.co/GTEretO2f4 https:/… #MADEINTHEAM IS OUT NOW!! https://t.co/5vDl8Zn4I7 https://t.co/j5smFLjeHb USA! #MadeInTheAM is out tomorrow! Don't forget to pre-order the record from @Walmart to receive a special bracelet. https://t.co/lBJf3BHE9m Have you voted for @onedirection as @TheAMAs Artist of the Year? RT to do so! #AMAs https://t.co/rnCsADd8t2 RT @MTVMusicUK: #1DHarry\n#1DLiam\n#1DLouis\n#1DNiall\n#1D\n#MadeInTheAM RT @NiallOfficial: You guys are incredible .  And I really really hope you love our album as much as we love it ..xxxxx RT @Louis_Tomlinson: Live lounge was siiiiiick ! Hope you all enjoyed Torn :) RT @Real_Liam_Payne: The day is finally here!! Our new album #MadeInTheAM Is out now!! https://t.co/zAO7vHJIRg USA! Head out to @Target tomorrow for the exclusive, limited edition #MadeInTheAM album covers!\nhttps://t.co/15YOg5NsHI US fans! Get excited! Tune into @SiriusXMHits1 TONIGHT at 8pm ET for 1D's #MadeInTheAM album premiere. RT @GMA: Tweeting #1D, #1DHarry, #1DLiam, #1DLouis, #1DNiall and #MadeInTheAM reveals awesome @twitter hashtag emojis! https://t.co/Nry3bvy… #1D #MadeInTheAM https://t.co/qYEj3ROtkn https://t.co/MyhxEeeEjC RT @NiallOfficial: #1DNiall #MadeInTheAM RT @Real_Liam_Payne: #1D #1DLiam RT @Louis_Tomlinson: #1DLouis RT @NiallOfficial: Thank you @BBCR1 @gregjames for having us.. It was a lot of fun doing the live lounge today .. UK! One Direction RETURN to @TheXFactor on Sunday 15th November! Be sure to tune in. https://t.co/V1nobJvuhy 1D narrated a special film for the @BBCCiN Appeal Show. Watch @BBCOne 7.30pm tomorrow. https://t.co/VrPipbo9g5 RT @Harry_Styles: Thank you to @BBCR1 for having us in your Live Lounge today. Hope everyone enjoyed it. Thanks for listening. H RT @TheXFactor: NEWSFLASH! @OneDirection set to perform on Sunday's #XFactor Results show: https://t.co/zq8egi4Pb6 😁🎉🔥 https://t.co/bwEltWC… RT @BBCR1: Thank you so so much to @onedirection for that stunning Live Lounge! The videos will be asap! #1DR1LiveLounge https://t.co/21Yql… RT @BBCR1: I N F I N I T Y @onedirection - #1DR1LiveLounge https://t.co/mLAPSrnsBJ Tune in to @BBCR1 now to hear the guys perform 6 songs! https://t.co/PTGmnJMgcE https://t.co/BKCPW2Z2RR The guys are now on @BBCR1 with @gregjames. Tune in now! https://t.co/yGDdNhg5RS RT @BBCR1: Greg's going to be chatting to @onedirection and giving them their Teen Award NEXT! #1DR1LiveLounge https://t.co/K98Ls42VkB NYC! Come to the @Sony store NOW to hear #MadeInTheAM &amp; enter for a chance to see 1D live! https://t.co/M287pROYiP https://t.co/VnjUYqw97r .@Real_Liam_Payne.... https://t.co/xoILYjoWzC RT @NiallOfficial: \" With no way out and a long way Down, everybody needs someone around \" UK! 1D will be on @BBCR1 Live Lounge from 4:45pm (GMT)! Listen in here. https://t.co/PTGmnK3R4c #1DR1LiveLounge https://t.co/4eskguMeca 1D are now on @Flipagram! Follow the guys and stay tuned for all of the exciting content. https://t.co/491plI0MgV If you still haven't pre-ordered your copy of #MadeInTheAM, grab it here! https://t.co/5vDl8Z5tjx https://t.co/IzgJ6AtL4f RT @AppleMusic: #WhatAFeeling.\n@OneDirection.\n#MadeInTheAM so. close.\nhttps://t.co/bU6GpYcveU https://t.co/JuwM5JkERS RT @Harry_Styles: Very excited for everyone to hear the album tomorrow. So happy people seem to like what they've heard so far. Love. RT @Real_Liam_Payne: We're doing @BBCR1 Live Lounge today! Tune in from 5pm RT @NiallOfficial: #1DaysUntilMITAM .. 1 day and it's all yours #1DayUntilMadeintheAM!!! What's your favourite album track so far, and why?? Let us know https://t.co/qYEj3ROtkn RT @Harry_Styles: What A Feeling.\n\nhttps://t.co/E8IoPKGEpI NYC! Come to the @Sony Store TOMORROW &amp; Fri. to hear #MadeInTheAM &amp; potentially win a trip! https://t.co/6X0xh8Ig8J https://t.co/bmQjhbUrsq 1D are nominated for Favorite Group at the @PeoplesChoice Awards! Vote now: https://t.co/q8uo55bNy1 #PCAs https://t.co/fMYJjGww5E US! Head to @Target upon release for limited edition #MadeInTheAM covers featuring each of the guys. Here's Harry! https://t.co/sE0fE583cC US fans! @siriusxmhits1's #MadeInTheAM album premiere is tomorrow. Tune in at 8pmET. https://t.co/qYEj3RwRVN\nhttps://t.co/i0g48DjJ3T Keep voting for @onedirection as #AMAs Artist of the Year! https://t.co/9sLp6YcgHS https://t.co/MkBhVQMgsx US fans! Who's heading to @Target on release day for their exclusive, limited edition #MadeInTheAM album covers?! https://t.co/gZWBqwafsH RT @NiallOfficial: These trends every day are mind blowing.Thank you guys for the reaction to these songs.We're really proud of them and we… RT @Real_Liam_Payne: Finally you can listen to one of my favourite tracks on the album! “What a feeling” :)  \nhttps://t.co/zAO7vHJIRg Watch here to find out what Louis had to say about the album track, #WhatAFeeling. https://t.co/qYEj3RwRVN\nhttps://t.co/zjJgvSuymB RT @Louis_Tomlinson: Another banger from Made in the A.M !  Really love this one.. Payno this one is your fav right? https://t.co/7Pgxbf9OWi NEW MUSIC: Pre-order #MadeInTheAM now and get #WhataFeeling! https://t.co/qYEj3ROtkn https://t.co/mKbItMdPnl RT @NiallOfficial: \" through the wire, through the wire, through the wire…. ”  https://t.co/Jw1oKknKL9 RT @Harry_Styles: Hello, it's our first time. We will be in the @BBCR1 live lounge tomorrow at 5pm. RT @NiallOfficial: Tomorrow 5pm . US and @gregjames for #1DR1LiveLounge . Make sure you're listening . Got some surprises for ya . #NYC! Come to @Sony Store Thur &amp; Fri &amp; hear #MadeInTheAM &amp; a chance to win a trip! #Sony1D https://t.co/MPeHiGV23U https://t.co/H8hh3AYLSB #WhataFeeling's coming soon. Pre-order your copy of #MadeInTheAm to get it! https://t.co/qYEj3RwRVN\nhttps://t.co/fxhYRqgtkd Support @BBCCiN this week &amp; buy the children's book the guys wrote with some friends! https://t.co/Bdi7yTFe7W RT @R1Breakfast: .... And don't forget to listen to Greg for the #1DR1LiveLounge on Thursday! WE CAN'T WAIT! Are you excited @gregjames? RT @NiallOfficial: #2DaysUntilMITAM .. The reaction to the songs you've heard so far has been amazing.. 2 more days and the whole thing is … RT @Harry_Styles: Two. #WhatAFeeling! - https://t.co/IViEQLLEwr https://t.co/tbhps25PbG #3DaysUntilMITAM! Pre-order the album from @Walmart now to receive an exclusive bracelet. https://t.co/lBJf3Bq3hO https://t.co/vtBycU36Hj US! Here's an exclusive, limited edition #MadeInTheAM Niall cover, available only at @Target. Get it on release day! https://t.co/8P679ZJyBX USA! Here's your chance to get tickets to see 1D peform live on @JimmyKimmel at Hollywood Boulevard on 11/19: https://t.co/VSFE4pv6we RT @Channel933: Win your way to @TheEllenShow to see @onedirection all week on @Channel933 details here https://t.co/WEqnL96GBi #MadeInTheAM US! Tune into @SiriusXMHits1 on 11/12 @ 8pmET for an exclusive #MadeInTheAM album premiere &amp; track-by-track from 1D.\nhttps://t.co/bdXYz2KGOm RT @GoogleUK: Found all of the #MadeInTheAM @onedirection clues with @GoogleMaps yet? There's still time: https://t.co/bVeYWBw91n https://t… Rehearsal break #radio1livelounge - Niall https://t.co/5sr6agrCLO Wanna know why #LoveYouGoodbye was such a personal track to the band? Watch to find out. https://t.co/qYEj3RwRVN\nhttps://t.co/IAZdneeJ3K RT @NiallOfficial: \" Unexplainable Love that only we could understand \" https://t.co/Jw1oKknKL9 RT @Harry_Styles: 'Love You Goodbye' is available now.\n\nhttps://t.co/E8IoPKGEpI The guys have just dropped the album track, #LoveYouGoodbye! Get it here. https://t.co/qYEj3ROtkn RT @Louis_Tomlinson: 3 days to go ! Here is one I wrote that means a lot to me! https://t.co/7Pgxbf9OWi RT @Real_Liam_Payne: Love You Goodbye is such a tune right? Hey hey heyyyy\nhttps://t.co/zAO7vHJIRg USA! 1D are taking over @JimmyKimmel and Hollywood Boulevard on 11/19, and you could be there! Details coming to you at 4pm ET. Wish you were here! Head over to https://t.co/thYSMXT5s1 to see what the guys have left for you today. https://t.co/OnqKPKMXkk .@digitalspy got an exclusive first listen to Made in the A.M...\nhttps://t.co/4Y4Ftzbyhs RT @NiallOfficial: Love the fact that #EndOfTheDay has been trending all day .. You guys are incredible RT @NiallOfficial: #3DaysUntilMITAM US fans! Additional 1D bundles including totes and #MadeInTheAM vinyl are available now! https://t.co/IDpbsNzXJx https://t.co/FnUg5obT3V Excited for #MadeInTheAM?! Fans at the #1DFirstListen events are loving what they heard. https://t.co/qYEj3RwRVN https://t.co/ZA5ETjlkqE Why not let us know what else you guys have spotted in the #MadeInTheAM space today? https://t.co/thYSMXT5s1 RT @NiallOfficial: Ya follow your heart , even though it will break We'll be doing #1DFollowSprees every day between now and #Fr1Day13! Let us know how excited you are for the album! Wanna know what Louis had to say about #EndOfTheDay? Watch here. https://t.co/qYEj3RwRVN\nhttps://t.co/OFtDGEEZ6j RT @Real_Liam_Payne: Can’t wait for you all to listen to Made in the AM! In the meantime you can listen to End Of The Day https://t.co/zAO7… RT @Harry_Styles: I told her that I loved her, I'm not sure if she heard. \n\nhttps://t.co/E8IoPKGEpI Want to hear the album track #EndOfTheDay right away? Pre-order your copy of #MadeInTheAM NOW https://t.co/qYEj3ROtkn RT @Louis_Tomlinson: Probably one of my favourite tracks on the album… \"End of the Day” ! 4 days to go ! https://t.co/7Pgxbf9OWi RT @NiallOfficial: \" All I know, at the End of the Day… ” 4 Days to Made In the A.M ! https://t.co/Jw1oKknKL9 #EndOfTheDay's coming soon. Pre-order your copy of #MadeInTheAm to get it! https://t.co/qYEj3RwRVN\nhttps://t.co/cGzP2U51bM #EndOfTheDay – https://t.co/thYSMYaGQB https://t.co/wwGGaLOzYP RT @BBCR1: Congrats @onedirection - never heard so much noise in our actual lives! https://t.co/yeN5lr033k #R1TeenAwards https://t.co/9YGeO… RT @NiallOfficial: Wow just found out we won 2 teen awards today .. Thank you to all of your for voting and @BBCR1 for the support Fancy a snack? Head over to the #MadeInTheAM fridge to see what the guys have left for you. https://t.co/thYSMXT5s1 Thanks to everyone who voted for the band to win Best British Single and Best British Group at the #R1TeenAwards! Pre-order #MadeInTheAM on iTunes and you'll also get exclusive content from the guys' @AppleMusic Festival set!\nhttps://t.co/qYEj3RwRVN Say What? Find out what the guys have just revealed in the Made in the #1DAM Space. https://t.co/thYSMXT5s1 https://t.co/T0lwN21Pla RT @Real_Liam_Payne: Guess the song 1 week guys https://t.co/W0ScG6JTAj RT @Louis_Tomlinson: 🍺🍺🏎🏎🏢🏢♠️♣️♥️♦️🍾🍾✈️🛫  but we don't need anything ! RT @Louis_Tomlinson: Amazing to see such a great reaction to history ! It's all for you .@Spotify users, if you love 1D! Be sure to follow the band's official playlist! https://t.co/H09htTgCCy If you still haven't heard #1DHistory, pre-order your copy of MadeInTheAM now and you'll get the track right away!  https://t.co/qYEj3RwRVN #1DWORLD. The guys have left lots of new surprises for all of you over at https://t.co/thYSMXT5s1 https://t.co/QEd5WXtQBX Is #1DHistory on your playlists yet? https://t.co/TALiNldM0a Love 1D? Pre-order your copy of #MadeintheAM before #Fr1Day13!\nhttps://t.co/5vDl8Z5tjx Baby i'm perfect for you... https://t.co/a8MBB5tFof What are everyone's thoughts on #1DHistory? If you haven't heard it, pre-order #MadeintheAM and get it instantly! https://t.co/qYEj3RwRVN There’s even more stuff for all of you to discover on https://t.co/thYSMXT5s1, however it’s under lock and key! RT @Harry_Styles: One week. RT @Harry_Styles: You've got to help me, I'm losing my mind.\n\nhttps://t.co/DHrwwXX96p RT @NiallOfficial: Actually @julianbulian and I brought some fans to the studio to record the chorus as like a crowd vocal.. So this song i… RT @Louis_Tomlinson: Big one this one ! Only 1 week to go now till Made In The AM drops https://t.co/7Pgxbf9OWi RT @NiallOfficial: Loving the trend again today.. Love how u are responding to history.. It's one our favourite songs we've ever done.. So … RT @NiallOfficial: You and me have a whole lot of History…. https://t.co/Jw1oKknKL9 RT @Real_Liam_Payne: HISTORY https://t.co/zAO7vHJIRg Check out what the guys had to say about the album track #1DHistory https://t.co/k0Urh5Xo6P NEW MUSIC: 7 Days to #Fr1Day13! Pre-order your copy of Made in the A.M. NOW and you'll get the album track #History! https://t.co/qYEj3ROtkn #1DHistory is coming at 4pm! Who’s excited? Pre-order #MadeInTheAM now to hear it! https://t.co/qYEj3RwRVN\nhttps://t.co/YemnUnnYQJ The guys have left some music lying around. Head over to https://t.co/thYSMYaGQB to check it out https://t.co/UvpBNMaVdM How long will it take to find the star? - https://t.co/thYSMXT5s1 https://t.co/MPFlUEMOpt 1D are taping @TheEllenShow on 11/17, and you could be there! Details here: https://t.co/sbvQIfGdES https://t.co/TCUx5k5GW5 RT @Real_Liam_Payne: Guys if you get the album off iTunes, you will get our performance of Drag Me Down from Apple Music Festival!!  https:… RT @Louis_Tomlinson: Performing Drag Me Down at the Roundhouse was siiiiick. You can have the video if you preorder the album from iTunes !… 1D fans! Get excited. New #MadeInTheAM bundles just launched, which include exclusive #1DFirstListen tote bags! https://t.co/hjphsDDPNg #MadeInTheAM is out in a week! Pre-order now and listen to these bonus tracks on the deluxe. https://t.co/qYEj3ROtkn https://t.co/RXLBotLL48 Liam makes the call on his fave tracks from #MadeInTheAm! Find out what they are on https://t.co/thYSMYaGQB. RT @NiallOfficial: Loving the trend .. You guys are great, we're really happy with this album and we hope you love it ... #8DaysUntilMITAM Who’s excited for #MadeInTheAM?! Here’s an exclusive look behind the music. Pre-order now: https://t.co/qYEj3ROtkn https://t.co/TNtW0Ie8qy Have you spotted what's new in the #MadeInTheAM space today? Let us know! https://t.co/thYSMYaGQB https://t.co/TkFaFYM6Y1 It's always a good idea to give #Infinity a spin, right? https://t.co/uhkHjDWuJz RT @Real_Liam_Payne: https://t.co/dymlyJ2Osa What are your top 3 songs on the 1D Official Playlist today? We wanna know!  https://t.co/H09htTye18 Want to make sure you never miss any 1D updates? Sign up to the official newsletter here. https://t.co/nLP1DPfMak What are your top 3 songs on the 1D Official Playlist today? We wanna know! \nhttps://t.co/H09htTgCCy RT @Louis_Tomlinson: End of the Day ! https://t.co/7PgxbfrqkS https://t.co/jvkqqRns24 RT @mtvpop: Here's everything that happened inside @onedirection's #MadeInTheAM first-listen party https://t.co/I5z5rppjs2 https://t.co/L4h… Pre-order your copy of #MadeInTheAM here to get your hands on never-before-seen pics and vids of 1D! https://t.co/K6cRugZTgQ RT @NiallOfficial: My favourite song is never enough... It's really fun and different than anything we've done before .  https://t.co/0HXt7… RT @Harry_Styles: Ten days until the new album is out. Really looking forward to sharing it with you. Hope you like it. H Head over to the Made in the A.M. space to see what's new! Tell us what you see (try not to stand too close)... https://t.co/thYSMYaGQB RT @GMA: The winner of the @onedirection Apple Music #1DLDNSESSION is Emma Bailey! SEE MORE: https://t.co/sCRCD9mKPY https://t.co/WR6RiNZzzf The guys have donated some signed merch for auction in aid of @TeenCancerUSA. https://t.co/nDKOwXE9U7 Harry though... #PerfectMusicVideo\nhttps://t.co/Gia9wcD7Lk https://t.co/dfDUjLnNxk RT @syco: ICYMI @onedirection launched a microsite with @google street view! View here: https://t.co/uNkdISbEDZ  #MadeInTheAM https://t.co/… #MadeInTheAm 13.11.15 \nhttps://t.co/K6cRugZTgQ https://t.co/PzIjhydME5 US! Head out to a #1DFirstListen today to find out what the songs on #MadeInTheAM mean to 1D https://t.co/BRSve5HaAl https://t.co/ay7Yn8gstO RT @SonyMusicUK: .@onedirection launch their brand new microsite built with @google street view: https://t.co/LEjHwwGpAO #MadeInTheAM https… Perfect: https://t.co/U0kqAxFe9N\n\nDrag Me Down: https://t.co/orEz8bKrm3\n\nInfinity: https://t.co/uhkHjDWuJz\n\nHome: \nhttps://t.co/zpVo2xrU43 RT @Real_Liam_Payne: Excited for US fans to get a first listen of the album today!!! Let us know what you think https://t.co/hjb54uWkUF htt… RT @GoogleUK: Step into the @onedirection #MadeintheAM space. \nNew 1D surprises to find every day. Go! https://t.co/bVeYWBw91n https://t.co… Start exploring https://t.co/thYSMYaGQB, where the guys will be sharing exclusive content with all of you between now and #Fr1Day13! US fans! #MadeInTheAM is available on vinyl. Don't miss out! Pre-order your copy now. https://t.co/VNOR8eInwr I can be the one, you love from time to time... https://t.co/4ccOghX9Fj\nhttps://t.co/ty2DY2Pv4x RT @NiallOfficial: \" in places that we've never been , for reasons we don't understand \" #MadeInTheAM Help the guys win #BestInternationalAct at the Australian @ARIA_Official Awards! VOTE HERE: https://t.co/SxCVlfl84G https://t.co/SSmR8GBnY9 USA! You could hear #MadeInTheAM album BEFORE it's released! Grab your #1DFirstListen tixs: https://t.co/BRSve5HaAl https://t.co/rCvq0lAUKQ RT @Louis_Tomlinson: U.S. do you want to hear Made in the AM before it's released? https://t.co/7xdkaqS1Or RT @Louis_Tomlinson: What a way to finish the tour and in Sheffield as well ! Thank you to everyone who came to see us 😊 UK! Not long left to vote for 1D to win Best British Group and Best British Single at this year's #R1TeenAwards! https://t.co/AHjQ74HwTR RT @Harry_Styles: To everyone who came out to see us on tour, thank you for having us. You've been our everything out there, and we love yo… RT @Harry_Styles: We have been very lucky to work with an amazing crew throughout the last five years of touring. To all of you, thank you … RT @NiallOfficial: Thank you anyone who has come to watch us live over the last few years, it's incredible to be able to play our music liv… RT @NiallOfficial: safe to say last night was incredible. Gona miss doing shows for a while , it's the best part of what we do thats why it… A message from the guys https://t.co/4PSTPRHgVU Have you pre-ordered your copy of #MadeInTheAM? The guys will be releasing THREE more album tracks before release https://t.co/PBX0Cf4zBS US fans! Grab your #1DFirstListen tickets now to hear #MadeInTheAM before it's released. https://t.co/BRSve5HaAl https://t.co/kasEYePvTP RT @NiallOfficial: Happy Halloween everyone .. 🎃! Have a good day . Really excited about the show tonight .. gona be a big one ! Weekend = mood #PerfectMusicVideo https://t.co/Gia9wcD7Lk https://t.co/6R69GW5OVc RT @Louis_Tomlinson: Sheffield !!!! It's so good to be so close to home ! Siiiiiiiiiiiiiiick show tonight ! Thank you RT @NiallOfficial: Thank you for all the continuous love and support .. RT @NiallOfficial: don't believe anything you are reading. We stand strong as a band and we're brothers ,can't wait for you to hear what we… RT @NiallOfficial: US .. excited for you to hear Made in the AM ! https://t.co/2kYpUA8n1k USA! 2 weeks until #MadeInTheAM. Pre-order your copy from @Walmart to receive an exclusive bracelet with the album! https://t.co/lBJf3Bq3hO Sheffield, are you ready? 📷 One Direction/ Cal Aurand https://t.co/fqpf2Dh6Sx USA! You could hear #MadeInTheAM BEFORE it's released. Get your limited #1DFirstListen tixs: https://t.co/BRSve5HaAl https://t.co/kasEYePvTP US 1D Fans, the official Where We Are Now scrapbook is out now! Get it here: https://t.co/xdS0zD2Z5n https://t.co/pkFvIcZF8l If you'd like to pre-order the Ultimate Fan Edition of #MadeInTheAM, you can get yours on @AmazonMusic https://t.co/ALT9yPb3WJ The guys are on the cover of @theststyle, out this Sunday in the UK! https://t.co/6AXD2AdUBH Baby, i'm Perfect.... https://t.co/Gj187Sd0HG https://t.co/SZ43giJFZU 1D fam! Here's an exclusive peek into the making-of the #PerfectMusicVideo. Watch now: https://t.co/VQQ1UbCdpV @HondaStage #HondaCivicTour Want something a little extra with your copy of #MadeInTheAM? Pre-order your copy from the Official 1D Store https://t.co/K6cRugZTgQ US fans! Pre-order this exclusive 1D bundle &amp; receive new daily content from the guys leading up to release! https://t.co/hjphsDDPNg RT @Real_Liam_Payne: Do any of you lovely US fans want to hear the album before it's released? https://t.co/hjb54vdVMd What's everyone listening to today? We wanna know! \nhttps://t.co/H09htTgCCy Sheffield, are you ready for 1D? #OnTheRoadAgain2015 © One Direction/Cal Aurand https://t.co/v7sFmBRSl4 USA! Here's your chance to hear #MadeInTheAM before it's released! #1DFirstListen Details: https://t.co/BRSve5HaAl https://t.co/rCvq0lAUKQ RT @GMA: The performance will be live-streamed from @ABC studios in LA following the release of #MadeInTheAM! #1DonGMA #GMA40 https://t.co/… RT @GMA: Also, @OneDirection will perform their new hit song 'Perfect' for the first time in the U.S.! #1DonGMA #GMA40 https://t.co/H7dUkcF… #1DonGMA  https://t.co/OUv0uwny2V The guys will be releasing three album tracks ahead of #Fr1Day13, pre-order your copy of Made in the A.M. Now! https://t.co/PBX0Cf4zBS And if you like midnight driving with the windows down... https://t.co/Gia9wcD7Lk https://t.co/kQysbXR1SU RT @Harry_Styles: Thank you Newcastle. You were very very nice to us this week. Hope everyone had fun at the shows. H Guys! @HMVTweets have four exclusive covers of Made in the A.M. Get yours before they're gone https://t.co/HQUtubO0xT Payno &amp; Tommo! #PerfectMusicVideo\nhttps://t.co/Gj187Sd0HG https://t.co/vVQaoSSPCZ The guys are PERFORMING at @TheAMAs, November 22nd on ABC! If you're excited tweet #AMAs1D! https://t.co/KIyXzXfRmK RT @Louis_Tomlinson: Such a great show and such a great night tonight ! Love it !!!! What's your favourite track to wake up to in the morning? Show us using hashtag #MyPerfectAM 1D fans on Android, you can grab your copy of Perfect from @GooglePlay! https://t.co/IwNWNnAZ5C https://t.co/ha1NTT1Azd Golf goals...\nhttps://t.co/Gj187Sd0HG https://t.co/UuFNihvvWe USA! Pre-order #MadeInTheAM at @Walmart now &amp; receive an exclusive bracelet when the album's released. Details here: https://t.co/lBJf3BHE9m Keep voting for @onedirection as #AMAs Artist of the Year! https://t.co/9sLp6XUFQk https://t.co/0JbSGC0s1v Want to complete your #MadeInTheAM collection? Pre-order from @HMVTweets to get hold of four exclusive covers! https://t.co/HQUtubO0xT Newcastle! Can't wait to see you tonight. © One Direction/Cal Aurand https://t.co/6epjAA5hlY Pre-order #MadeInTheAm on iTunes and get two exclusive videos from the guys' @AppleMusic festival perfomance. https://t.co/PBX0Cfmb0s Thank you to all of you who voted for the guys to win Best Pop Act at the #MTVEMA https://t.co/52s91tccnA What's your favourite moment from the #PerfectMusicVideo? https://t.co/Gj187Sd0HG https://t.co/BYVVlsZHxo USA! Grab your limited #1DFirstListen tickets to hear #MadeInTheAM before it's released! https://t.co/BRSve5HaAl https://t.co/rCvq0lAUKQ UK! Last chance to find out how you could attend the #MadeInTheAm listening party. https://t.co/Oassw5Q6KE How many times have you listened to #1DPerfect today? Let us know! https://t.co/U0kqAxFe9N USA! You can hear #MadeInTheAM before it's released. #1DFirstListen tickets available here: https://t.co/BRSve5HaAl https://t.co/rCvq0lAUKQ #1DHome https://t.co/56Kxus6Tjf RT @Real_Liam_Payne: Thank you to Belfast tonight and the other nights I'm so glad we made it RT @Louis_Tomlinson: Really good crowd abit trigger happy with throwing stuff though !!! 😝 UK! Want the chance to attend the #MadeInTheAM listening party on Nov 3 2015? Find out how, here. https://t.co/Oassw5Q6KE We love seeing you guys @Shazam our songs! Check out this playlist of the most Shazamed 1D tracks. https://t.co/RVZfZAOfCl Have you voted for 1D as #AMAs Artist of the Year? Here’s how: https://t.co/9sLp6YcgHS https://t.co/ZcGdKWsbhI Love Perfect? Why not grab an exclusive acoustic mix of the track from the Perfect EP?https://t.co/YenRooF1aG Still. Can't. Get. Over. #PerfectVideo. https://t.co/Gia9wcD7Lk RT @billboard: .@OneDirection's #Perfect is already No. 1 on the Billboard + Twitter Top Tracks chart! https://t.co/BhdiE1mWUY https://t.co… RT @Harry_Styles: 13.11.15 https://t.co/dqg2YqyDRZ US fans! Have you pre-ordered #MadeInTheAM? Do so now at @Walmart to get an exclusive bracelet! https://t.co/I9ExVlGoZg Thank you Belfast! See you tomorrow. https://t.co/5x9NVBHaKX US fans! Be one of the first to hear 1D's #MadeInTheAM before it's released. #1DFirstListen https://t.co/BRSve5HaAl https://t.co/oJW7xCk7Pd If you're on @Android, you can pre-order your copy of #MadeInTheAM here. https://t.co/wrPO54Uymn https://t.co/tm2lCBwlGd Who else can't stop listening to the @MatomaOfficial mix of Perfect? https://t.co/56Kxus6Tjf https://t.co/3bcGUEarbV RT @Real_Liam_Payne: You guys are amazing, can't believe you did this for us!! Thank you for all your incredible support https://t.co/EMrWf… RT @NiallOfficial: Here’s the Perfect EP for you,  with the new song Home ! https://t.co/TV9OJYsJmH #1DPerfect  https://t.co/4ccOghX9Fj RT @Harry_Styles: To whoever is behind the page in @billboard magazine. Thank you. You have no idea how lovely you are. H RT @Louis_Tomlinson: This is amazing! Who organised this ad in Billboard? Thank you 😊 https://t.co/O7MmdpsBKm #Fr1Day13 is fast approaching. Are you ready? https://t.co/PBX0Cf4zBS https://t.co/sAvuIfekol Have you downloaded your copy of the Perfect EP? Which track's your fave? \nhttps://t.co/YenRooF1aG The guys are performing at the #BBCMusicAwards on 10th Dec in Birmingham! Get tickets here https://t.co/Xe4U7QHefn https://t.co/GAZlaFCoPF UK! The Perfect EP ft @MatomaOfficial's exclusive mix is available now. https://t.co/56KxurPirH https://t.co/oosb55yi5p RT @Louis_Tomlinson: Who wants to hear our new track 'Home' then? You can get it as part of the Perfect EP ! https://t.co/1jtO2dtYAw RT @Louis_Tomlinson: I'll make this feel like homeeeee RT @Louis_Tomlinson: 🏠 Harry... #PerfectMusicVideo https://t.co/Gia9wcD7Lk https://t.co/WnjwCtrQQa Niall... #PerfectMusicVideo https://t.co/Gj187Sd0HG https://t.co/xvFzjHSjTu Want to hear the exclusive new track Home? Get it as part of the Perfect EP at midnight tonight! https://t.co/YenRooF1aG Want exclusive pics &amp; videos from the guys? Pre-order your copy of the #MadeinTheAM from the Official 1D Store! https://t.co/K6cRugZTgQ Louis... #PerfectMusicVideo https://t.co/Gia9wcD7Lk https://t.co/JYbgOllDnb Liam... #PerfectMusicVideo https://t.co/Gj187RVpQ8 https://t.co/XRMQjXAwxp Hi all! The guys' Perfect EP ft exclusive track #1DHome is available from midnight where you are! https://t.co/YenRoonqj8 When this happened...  #PerfectMusicVideo https://t.co/Gia9wclwTM https://t.co/aYnPnodfDV RT @Real_Liam_Payne: Thank you so much for all the trends and lovely messages you guys did for me it really shows how amazing u guys actual… RT @Real_Liam_Payne: I'm so sorry to everybody I disappointed last night. I'm feeling better now. I really hope everyone can make the resch… RT @simonjonespr: Tonight and tomorrow night's One Direction concerts in Belfast will be going ahead as planned. Liam thanks (cont) https:/… RT @EszterMosberger: It has became my favourite @onedirection song ever. The clip is PERFECT! 😻 #PerfectMusicVideo  https://t.co/yITw4EcfDm RT @bandkiid: @onedirection the #PerfectMusicVideo is the best i've ever seen. RT @yaniinne: @onedirection  my favourite part of the #PerfectMusicVideo https://t.co/i79sUxkca5 RT @TheGigiGorgeous: Okayyyyyyyyyyy...😳 The new @onedirection song Perfect is EVERYTHING😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍 What's your favourite part of the #PerfectMusicVideo? Show us! https://t.co/Gj187Sd0HG RT @BuzzFeedCeleb: .@OneDirection’s new #PerfectMusicVideo is actually perfection https://t.co/bXrTyuwgu4 https://t.co/gQML8IQkCb Has anyone else spent the past 7 hours rewatching the #PerfectMusicVideo? https://t.co/Gia9wcD7Lk RT @Harry_Styles: https://t.co/AZ8pVGML3J RT @NiallOfficial: What do you guys think of the Perfect video ??? https://t.co/2vslcs0iLz #PERFECTMUSICVIDEO https://t.co/Gj187Sd0HG RT @Vevo_UK: Well the #Perfect video is just perfect really: https://t.co/SqLHSo04kQ @onedirection https://t.co/LHXWmDcyWw RT @Louis_Tomlinson: Here’s the video for Perfect for you guys, hope you love it  https://t.co/Ljm9riwlZO RT @NiallOfficial: So sorry we have had to cancel tonight guys.  Unfortunately these things happen... Thank you to all who came down tonigh… RT @Louis_Tomlinson: We're so so sorry for what happened tonight, it was out of our control ! Lots of love to Liam and thank you for being … RT @Harry_Styles: Deepest apologies to everyone at the show tonight in Belfast. Very disappointed, but unfortunately these things happen. W… RT @simonjonespr: Unfortunately One Direction have had to cancel tonight's concert in Belfast. Liam has been taken suddenly (cont) https://… Want exclusive daily pics and vids from the guys? Find out how to make it happen here. https://t.co/K6cRuhhuFq https://t.co/zrhjMR5COY Hey 1D family! We’ll be doing some follow sprees over the next few weeks, ahead of #Fr1Day13! Stay tuned! Go to https://t.co/9sLp6XUFQk and RT to vote for 1D as Artist of the Year at the #AMAs! https://t.co/xDdaJD71C6 Belfast! Are you ready? #OnTheRoadAgain2015  © One Direction/Cal Aurand https://t.co/p6FWbYBJLV How many of you have added #1DPerfect to YOUR playlists? We wanna know! https://t.co/U0kqAxFe9N RT @Harry_Styles: Amazing time in Dublin. Thank you for having us. Every crowd was amazing. Hope everyone had fun. H Who still can't get enough of #1DPerfect? https://t.co/U0kqAxFe9N RT @NiallOfficial: Belfast ... What's goin on ????? Why not start the week by retweeting to vote for 1D in this year's @TheAMAs? #aoty #AMAs https://t.co/vhLD3VY49z US fans! Only a few days left to enter for a chance to attend the #1DLDNSession. Don't miss out! @AppleMusic @GMA https://t.co/KzGy4rAVwT Baby you're perfect ... http://t.co/4ccOghX9Fj\nhttps://t.co/4eH0PxhmnF RT @NiallOfficial: Thank you for coming out to watch us and make my dreams come true .. RT @NiallOfficial: Dublin , the last 3 nights have been some of the best of my life .. You guys are incredible.. Sooooo proud to be Irish .… RT @Louis_Tomlinson: Hope you are loving 'Perfect' http://t.co/LmUy22wSz4 #Fr1Day13 - http://t.co/PBX0Cf4zBS http://t.co/7x7YliowAA If I didn't have you there would be nothing left... http://t.co/orEz8bKrm3 .@Real_Liam_Payne &amp; @Louis_Tomlinson have a little message for you guys... http://t.co/3UjX2zfqD2 Are you guys watching #YTStandsUpToCancer? Please text STAND3 to 70404 to donate £3 to raise as much as possible for a fantastic cause! RT @Harry_Styles: If you are a @Spotify user, you can listen to our new song here.\nHope you like it.\n\nhttp://t.co/Kkt96AjhvU Have you checked out the newly updated 1D playlist on @Spotify? #1DPerfect. http://t.co/H09htTgCCy RT @ITVLorraine: A lot of stuff has happened since this trio last caught up! Full @onedirection interview #ITVLorraine Monday http://t.co/1… #Fr1Day13 - http://t.co/PBX0Cf4zBS http://t.co/d0O4opxXfK Who's got their copy of #1DPerfect? If you haven't yet, grab yours here. \nhttp://t.co/4ccOghX9Fj http://t.co/AMlfc68ZrR 1D love the new @BBCCiN T-shirt by @gilesgilesgiles.Get yours at http://t.co/Xaw3u72D8F &amp; show your support. http://t.co/9hAP4dJXfy Help beat cancer sooner and watch the #YTStandsUpToCancer live stream from midday! http://t.co/jZxsqMXI6j RT @hesbadlxnds: something like this #PerfectHadMeLike http://t.co/BaEge3P2c9 RT @plazastyles: #PerfectHadMeLike this was me when i first heard perfect @onedirection http://t.co/13s6ur5tK1 RT @Mariellsfa: #PerfectHadMeLike (i was crying, my dad took the picture)😂😭🙌 http://t.co/wimdb09vL5 RT @NiallOfficial: Ah Dublin ... That was absolutely mind blowing ... The loudest , craziest show ever RT @Louis_Tomlinson: Thank you for all you do for us 😊 Boyo with his home crowd ! What a show !! 🇮🇪 (http://t.co/ucpYvDdXhz) http://t.co/cQqPruCsH6 RT @NiallOfficial: http://t.co/k6CHDnXXMB RT @Real_Liam_Payne: What do you think of Perfect?? http://t.co/vNUTiclOMP What was your reaction when you first heard #1DPerfect? Tell us using hashtag #PerfectHadMeLike 😂 http://t.co/0rRtlEoERG How many sleeps until #Fr1Day13??? http://t.co/qYEj3RwRVN http://t.co/8nzSAqV5Wf Dublin tonight!  #OnTheRoadAgain2016 © One Direction/Cal Aurand 🇮🇪 http://t.co/KQebfNANlm Which is your fave?\n\nDrag Me Down: http://t.co/orEz8bKrm3\n\nInfinity: http://t.co/uhkHjDWuJz\n\n#1DPerfect: http://t.co/U0kqAxFe9N Guys! We want to see all of your Perfect cover art designs! Show us using #1DPerfectArt http://t.co/PQBqpV2Ocm RT @Harry_Styles: Hey Angel. Tell me, do you ever try to come to the other side? RT @NiallOfficial: the reaction has been amazing all day so far.. Thank you . RT @Harry_Styles: http://t.co/GG40B1bQ3U https://t.co/LARxtb7sUQ Have you checked out the updated Official 1D @Spotify Playlist? \nhttp://t.co/H09htTgCCy How many times have you listened to #1DPerfect already?\nhttp://t.co/U0kqAxFe9N RT @Harry_Styles: 'Perfect' is out now.\n\nhttp://t.co/GG40B1trsu Who's loving #1DPerfect? Get your copy here. http://t.co/4ccOghX9Fj\nhttps://t.co/kTzuVO4rG4 RT @syco: .@onedirection's new single '#Perfect' from their upcoming album #MadeInTheAM is out now! http://t.co/rZpAer3aEF 👌 http://t.co/4u… RT @mcrissa_g: Perfect is now on Spotify i repeat PERFECT IS NOW ON SPOTIFY @onedirection AHHHHHHH 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 RT @hannbarakat: I'm dying  #ItsPerfectDay RT @NiallOfficial: You like it ? #Perfect #ItsPerfectDay | http://t.co/4ccOgieL3T | http://t.co/U0kqAxWPyn http://t.co/BwoGCYsumi RT @SpotifyUK: Friday just got #1DPerfect. The waiting is over @onedirection's new song is here: http://t.co/iXA9Bkujin https://t.co/liTDke… #1DPerfect! #1DPerfect! #1DPerfect! http://t.co/U0kqAxFe9N http://t.co/a2kS0yOTAG RT @BBCRadio2: .@achrisevans is #nowplaying @onedirection's BRAND NEW SINGLE 'Perfect'. Wow! http://t.co/UnRQAaSa3T RT @grimmers: ohhh it's suuuuch a PERFECT dayyyyy \n\nplaying Perfect by @onedirection imminently RT @Real_Liam_Payne: You can hear Perfect tomorrow! http://t.co/vNUTicDpEn http://t.co/4ifl7qr30M Are you following 1D on @Snapchat​? If not, be sure to search \"OneDirection\" right away! http://t.co/Uqtj7qw9TI RT @CapitalOfficial: Excited for @onedirection's new song #PerfectOnCapital? We've got the first play tomorrow on Capital Breakfast! http:/… RT @NiallOfficial: Ya ready to hear perfect in the morning USA! Want to see 1D in London next month? @AppleMusic &amp; @GMA are giving you the chance! Details here: #1DLDNSession http://t.co/KzGy4rSwor #EMABiggestFans1D\n http://t.co/1r99oJmwps http://t.co/9MbFoHPZPV RT @R1Breakfast: We're back tomorrow with the new @onedirection single, Perfect!\nIt's on at 7:45am.\nSet your alarm NOW!! ⏰\n(Marimba?) http:… 1D fans on Android, be sure to pre-order your copy of #MadeInTheAM on @GooglePlay now! http://t.co/wrPO55c9KX http://t.co/AS5C85Floy RT @CapitalOfficial: Here's another teaser of @OneDirection's next single #1DPerfect 😁 Get it in full on Capital Breakfast tomorrow 🙌 http:… RT @NiallOfficial: thank you all for voting for #EMABiggestFans1D .. You guys are amazing . Xxxx 😍😍 24 hours until you all get your first full listen to #1DPerfect! Pre-order your copy here. \nhttp://t.co/4ccOghX9Fj http://t.co/aBw0bA6cVn USA! Have you pre-ordered #MadeInTheAM yet? Do it now to get \"Drag Me Down\" and \"Infinity\" right away! http://t.co/vLMs5qGVv6 RT @Louis_Tomlinson: Perfect http://t.co/H9RkAgoDFc http://t.co/88KH85i25T 1D is nominated in two @TheAMAs categories! RT to help them take home #aoty and #FavoriteDuoOrGroupPopRock! #AMAs http://t.co/R4rP5xngdC RT @AmazonMusicUK: RT, follow us &amp; enter for a chance to #win a trip for 3 to meet @OneDirection at their gig http://t.co/vrOic1mMv2 https:… Is it just us, or is #1DPerfect making anyone else EVEN MORE excited for #Fr1Day13?  http://t.co/4ccOgieL3T http://t.co/TzQtaiVWF9 #Fr1Day13 is coming! Who else is totally ready for it? \nhttp://t.co/qYEj3RwRVN\nhttps://t.co/smm9PmyW4F RT @CapitalOfficial: Oh heeeey @onedirection! Can't wait to play #1DPerfect on Friday 😜 Sounds INCREDIBLE! 🎧 #PerfectOnCapital http://t.co/… The guys did the e #EBtonguetwister for @SohanaResearchF http://t.co/yBie5umHpE\nYou can too: http://t.co/VZvHCRFbO4 … RT @SpotifyUK: .@onedirection #PingPongPlaylist silliness on spotifyuk snapchat - 5,4,3,2,1... we're live, you coming? http://t.co/fCylouZS… UK! The band's new single #1DPerfect is available to pre-order now! Get yours here. http://t.co/4ccOghX9Fj\nhttps://t.co/yeenqyqREk RT @Harry_Styles: 13.11.15 https://t.co/8CU4sqArtq RT @Real_Liam_Payne: Pre-order for Perfect is going live at midnight for UK &amp; Ireland! Going faster than a million miles an hour... http://t.co/uhkHjDWuJz Keep voting for the guys to win the Biggest Fans @mtvema! #EMABiggestFans1D http://t.co/1r99oJmwps http://t.co/TNIrjhcZDR Want your 1D news first? Then you'll definitely want to sign up here! http://t.co/nLP1DPfMak http://t.co/nyp4QB3eDc Payno &amp; Tommo #OnTheRoadAgain2015! © One Direction/Cal Aurand http://t.co/U2l0QBtB73 RT @Louis_Tomlinson: Another great show ! @Real_Liam_Payne how's your phone ? Still working ? RT @Harry_Styles: Birmingham, thank you for a wonderful few nights. You were amazing. Hope everyone enjoyed the show. H RT @NiallOfficial: Love your trend . #WeArePerfect RT @NiallOfficial: goodnight guys.. Have a good day/night wherever ya are 😍🌍 RT @NiallOfficial: Last night in Birmingham ... It's been great to be back .. Thanks for having us.. It's the guys' final night in Birmingham, UK! Which track on the setlist is your fave?  http://t.co/bz5F7UPpRA http://t.co/zT32q1XZPF ICYMI: The guys revealed the track listing for Made in the A.M. this weekend! http://t.co/qYEj3RwRVN\nhttps://t.co/p1T0UiR6Ju RT @NiallOfficial: Top night again Birmingham .... Need a good nights sleep tonight , the voice is starting to struggle with all these back… Want to know the rest of the tracks on #MadeInTheAM? Search: \"OneDirection\" on @Snapchat, and tune in tonight! http://t.co/jMIxV1bbTx Birmingham, UK! Who's excited to hear this tonight?  #OnTheRoadAgain2015 \nhttps://t.co/E9lNlhAw8P RT @NiallOfficial: Brum .. That was quality .. Back at home in bed. See ya tomorrow RT @Louis_Tomlinson: BIRMINGHAM OIOI!!!!! RT @Louis_Tomlinson: Soooooo excited for you all to hear Perfect ! Ahhhhhh RT @Harry_Styles: Hey Angel. Do you look at us and laugh, when we hold on to the past? Start the weekend with 1D! Pre-order #MadeInTheAM now to receive \"Drag Me Down\" &amp; \"Infinity.\" http://t.co/qYEj3RwRVN http://t.co/DXH4g28OkL #DragMeDown or #1DInfinity? Listen to both and let us know your fave! \n\nDMD: http://t.co/orEz8bKrm3\nInfinity: http://t.co/uhkHjDWuJz Weekend = mood:  http://t.co/3MH9SBo09T http://t.co/D8rxUH0V40 Did you catch the exclusive behind-the-scenes pt.2  footage from the band's #HondaCivicTour? Watch here. https://t.co/uGhaTgQ2cK RT @Harry_Styles: Our next single is called 'Perfect'. \nLooking forward to you hearing it, hope that you like those apples. US fans! Have you entered for your chance to attend a private performance with 1D next month? #1DLDNSession http://t.co/KzGy4rSwor Just to get us in the mood for Birmingham, UK tonight.... #OnTheRoadAgain2015\nhttp://t.co/orEz8bKrm3 RT @Real_Liam_Payne: Looks like the cat's out of the bag!!! Our next single is Perfect. Can't wait for you all to hear it! Want exclusive tracks with your copy of #MadeInTheAM? Be sure to pre-order your copy NOW! http://t.co/qYEj3ROtkn http://t.co/UTUHpmiwE9 Not EXACTLY sure how you could be a part of 1D &amp; @AppleMusic's #1DLDNsession? Details &gt;&gt; http://t.co/35jW4ntnsM FYI – just ONE day left to get your hands on a personalised print and wrist band with your #MadeInTheAM pre-order. http://t.co/K6cRugZTgQ 1D fans on Spotify! Which one of our playlists is your fave? Check 'em all out here. https://t.co/5CnMeGK8mn Don’t be sad that it’s over! Watch more #HondaCivicTour BTS moments in a new tour diary video: http://t.co/A3qB9aOVLJ @HondaStage #OTRA USA! Who's pre-ordered #MadeInTheAM? Get \"Drag Me Down\" &amp; \"Infinity\" instantly when you do! http://t.co/qYEj3RwRVN http://t.co/dmDkC86PI0 Glasgow, who's ready for round 2 tonight? #OnTheRoadAgain2015 © One Direction/Cal Aurand http://t.co/Xq5DoGLlZn USA! You don’t want to miss this. Details here: http://t.co/KzGy4rAVwT #1DLDNSession https://t.co/ISxW0qpOru Want to know how you could join 1D &amp; @AppleMusic at #1DLDNsession? Head over to http://t.co/Y7GmWdTKNE to find out. http://t.co/7qoWUo5T33 RT @Harry_Styles: Glasgow 7.10.15. https://t.co/oktJP82lDd RT @Harry_Styles: Hey Angel. Do you know the reasons why, we look up to the sky? The guys helped write a book for Children In Need. Check it out http://t.co/5kwnhPz1Iq #BBCCIN #FiRex Glasgow, see you later! #OnTheRoadAgain2015 © One Direction/Cal Aurand http://t.co/tfdL49LBwP Pre-order #MadeInTheAM from the 1D store before Friday 9th October  to get a personalised print and wrist band http://t.co/K6cRugZTgQ How many of you caught the guys' set at @AppleMusic festival? If you haven't, catch up here. http://t.co/4lEkeu00MH http://t.co/pEnLHQoYVv Nobody, Nobody 🎶. #TB @GMA © One Direction/Cal Aurand \nhttp://t.co/orEz8c22KD http://t.co/u9oZDabhhP I'm one step closer to being two steps far from you... http://t.co/uhkHjDWuJz No, I won't... https://t.co/CQ4gG8yXye RT @NiallOfficial: Manchester thanks for the last couple of nights... Had a great time .Now I'm off to bed to see can I get rid off this fl… RT @Louis_Tomlinson: Great show last night ready to do it all again tonight !!! Come onnnnnnnn If you order your Ultimate Fan Edition of #MadeInTheAM now you can get your hands on a personalised print! \nhttp://t.co/K6cRugZTgQ Mood: #1DInfinity http://t.co/H09htTgCCy If you didn't manage to catch the band's show at #AppleMusicFestival, you can do so here. \nhttp://t.co/SFmM9K6MhX Manchester, the guys are coming for you! © One Direction/Cal Aurand http://t.co/cPR21LfJcb RT @GMA: This is @onedirection's most exclusive and intimate event to date! More info next week ONLY ON @GMA. WATCH: http://t.co/n5KRXC0TpU Friday playlist: #DragMeDown http://t.co/orEz8bKrm3 Follow @OneDirection on Instagram for exclusive behind-the-scenes pics! http://t.co/cuIfBI5iqf 1D Fans on Android! Have you pre-ordered your copy of the guys' new album #MadeInTheAM yet? \nhttp://t.co/wrPO54Uymn RT @CapitalOfficial: We got @OneDirection to re-record WMYB with updated lyrics &amp; it's INCREDIBLE 🙌 #WhatMakesUs1D http://t.co/biAP2DDhNU h… RT @Real_Liam_Payne: Cannot wait for you to hear the new album! https://t.co/OMbKnDT5CU UK! @AmazonMusicUK are giving you the chance to meet the guys on tour! Find out how to take part here.\nhttps://t.co/9Ii8G5bk3h RT @makenoise: .@onedirection have signed these colourful caps ready for #DressLoud on #MakeSomeNoise Day! http://t.co/tqegVqWp2V http://t.… RT @NiallOfficial: @TheO2 thank you for one of the most incredible weeks of our career so far. You guys are great , we love your hospitalit… RT @NiallOfficial: Thank you to everyone who came down to watch us this week... You were amazing 😍😍😍 RT @Harry_Styles: Last night playing in London tonight. Thank you everyone who's come to see us over the last few days. See you soon. All t… RT @Harry_Styles: London, you've been incredible this week. Thank you for having us. We hope you've enjoyed us. We have so much love for yo… RT @Harry_Styles: Very excited to announce the London Session, looking forward to sharing the new album with you. H\n\nhttp://t.co/sqwkjq3wdF RT @AppleMusic: One night only!\nDon't miss the #1DLDNsession with @onedirection.\nHow to attend: http://t.co/9QIRclRQPc #MadeInTheAM\nhttps:/… Snapchatters - 1D are bringing their concert to your phones today with a One Direction Live Story. http://t.co/lRvuAW3ZPi We're playing #DragMeDown to get us in the mood for the final London show. http://t.co/orEz8bKrm3 There's a One Direction Live Story on Snapchat today! Check it out and feel like you're with the guys at the show : ) Want to attend the biggest 1D night yet? Learn how to join @AppleMusic for this special night. http://t.co/35jW4ntnsM #1DLDNsession To celebrate the release of #MadeInTheAM, @AppleMusic is hosting 1D for an incredibly meaningful night. #1DLDNsession http://t.co/Sw5Thz3mAv Have you pre-ordered your copy of #MadeInTheAm yet?  \nhttp://t.co/K6cRugZTgQ http://t.co/3JTZy0obxo Ready for night #5 at @TheO2! http://t.co/Fo12u8Jean RT @HondaStage: Every @onedirection fan’s dream car! Chance to win: http://t.co/oGGi3XixUF #HondaCivicTour (NoPurNec. See rules) http://t.c… RT @Real_Liam_Payne: Who wants to come to the London Session? http://t.co/Jl0D5hHtUb RT @Louis_Tomlinson: Well looking forward to seeing all our fans at The London Session ! http://t.co/jYZQ8AfP3j RT @NiallOfficial: Really excited to finally let you all know about the London session ! Check it out http://t.co/Clhnv01Mg8 Are you joining the band at tonight's #OnTheRoadAgain2015 London show? Check out the setlist! http://t.co/bz5F7V70J8 Join the guys \"On the Road Again\" on Snapchat, special surprise coming tomorrow! http://t.co/tsvAJbgmtm RT @NiallOfficial: Album is mastered and ready to go .... can't wait for you to hear it Coming along to the rest of the #OnTheRoadAgain2015 shows? Get your 1D merchandise here. \nhttp://t.co/xMyx3CHtmG RT @Louis_Tomlinson: The shows so far have been great !! Thank you O2 !!!!!!! RT @NiallOfficial: We love your arena ! Sickest place .. Feels like home https://t.co/0V0Lno0PBM .@Harry_Styles is ready to go onstage #OTRALondon4 http://t.co/4P2Dg0Y3Ml Have you checked out the new look on http://t.co/6pEWkanPNp? How many of you are following the official 1D @Spotify playlist? Tell us your top 3 tracks. http://t.co/H09htTgCCy What a week! Who came along to this weekend's #OnTheRoadAgain2015 shows? © One Direction/Cal Aurand http://t.co/Vk5eT82fsY RT @TheO2: It's Monday 28 Sept. This can only mean one thing... Night 4 of @onedirection! Show info here -http://t.co/xmSXmCcXMU http://t.c… Sunday spin: #1DInfinity http://t.co/uhkHjDWuJz What was your first thought when you saw the guys' new artwork? #MadeInTheAmHadMeLike  http://t.co/K6cRugZTgQ http://t.co/AlNfSZyVyZ .@louis_tomlinson &amp; @real_liam_payne singing 'Little Things' #OTRALondon3 http://t.co/WOL1uFGxJT .@Real_Liam_Payne singing 'Kiss You' at @TheO2 http://t.co/aJ5FViAEPw RT @AppleMusic: Flashback! Relive @OneDirection's performance at #applemusicfestival: http://t.co/qffJi01H3U http://t.co/oLQHAF9Dlv Who can guess what we're listening to today? #1DInfinity http://t.co/uhkHjDWuJz If you pre-order #MadeInTheAM now, you can also get a personalised print with the Ultimate Fan Edition. Interested? http://t.co/K6cRugZTgQ Best way to start the weekend? #DragMeDownMusicVideo! http://t.co/3MH9SBo09T The guys are proud to be part of the video 'We The People' with their fans to support #globalgoals http://t.co/0ZtohjseoF RT @Vevo_UK: Meanwhile over at @TheO2 we are with @onedirection 💜💜💜 who's seeing them soon? http://t.co/ueZNfyByOV Midnight Memories #OTRALondon http://t.co/2se2ulnmre RT @CapitalOfficial: WATCH: @NiallOfficial's new hip-hop album, @Real_Liam_Payne\nfor prime minister...it's @OneDirection in 1 minute! http:… Did you miss the guys' headline show at the @AppleMusic Festival? Watch again here: http://t.co/4lEkeu00MH Who else can't wait for #MadeInTheAM? 1D fans on Android, pre-order here. http://t.co/wrPO54Uymn http://t.co/0Th98KUhax How many nights does it take to count the stars? #1DInfinity http://t.co/uhkHjDWuJz RT @NiallOfficial: London if you're coming to the show, make sure you get in early to watch @jamielawsonuk ,he's sickkkkk http://t.co/q0yNmk9TrU RT @billboard: Retweet if you've been listening to @OneDirection's #Infinity on repeat: http://t.co/Qcf0cDywCn http://t.co/1E8bbe4Evp RT @NiallOfficial: London .. Thank you for tonight .. First of 6 shows at that incredible arena ... Sorry about the technical problems RT @Real_Liam_Payne: Really enjoyed that show I love my job hope u guys enjoyed it too RT @TheO2: Well look who it is @NiallOfficial @Louis_Tomlinson @Real_Liam_Payne and @Harry_Styles are here &amp; #readytogo #TheO2 http://t.co/… The guys are almost ready to hit the #OnTheRoadAgain2015 stage! Search \"OneDirection\" on Snapchat to stay up-to-date http://t.co/qnIBVhdteM Head over to @AmazonMusic​ now to pre-order your copy of 1D's latest album #MadeInTheAM! http://t.co/0EeMrPrKbd The guys are excited to have @jamielawsonuk support them at the O2 Arena. Check out his free download http://t.co/fIefszKkgN RT @AppleMusicES: #MadeInTheAM es PARA TI. ¡Nuevo álbum de @onedirection próximamente! \n#Infinity ahora: http://t.co/AOUb5YFA77 http://t.co… RT @ThePerfumeShop: We’re mega #excited to share our competition to meet @Onedirection! http://t.co/vdZqj9hhIT #1DBetweenUs http://t.co/O7i… Pre-order your copy #MadeInTheAM directly from the official 1D store and grab yourself an exclusive t-shirt! http://t.co/K6cRugZTgQ Which #DragMeDownMusicVideo BTS was your favourite?\n\nPt.1: http://t.co/IB29tKZoeS\nPt.2: http://t.co/QcY4J5NMJF RT @MTVMusicUK: Remember how you voted for @onedirection 94 MILLION times to win #MTVHottest?! Here they are with their award! 🏆 http://t.c… How many of you have playlisted #1DInfinity? http://t.co/uhkHjDWuJz The guys have released extra tickets for the O2 arena shows! Get them here: http://t.co/NXtgLKk8GV RT @AppleMusic: #MadeInTheAM is for YOU. \nNew @OneDirection coming soon! 😁\n#Infinity now: http://t.co/bU6GpYu66s http://t.co/Mco15AkPcz Fancy a personalised print with your copy of #MadeInTheAM? Pre-order yours from the official 1D store now! http://t.co/K6cRuhhuFq RT @Real_Liam_Payne: Are you guys loving Infinity? https://t.co/9vbg4KpeTx RT @NiallOfficial: What does everyone think of infinity ? RT @Louis_Tomlinson: Great show yesterday ! Can't wait for the O2 tomorrow !! Are you following the guys on @Snapchat? \"OneDirection\". http://t.co/7vFXeResyP 1D fans on Android! Pre-order your copy of #MadeInTheAM via the @GooglePlay store now.  http://t.co/wrPO54Uymn http://t.co/UBd7FOl97p RT @AmazonMusicUK: RT, follow us &amp; enter for a chance to #win a trip for 3 to meet @OneDirection at their gig http://t.co/vrOic1mMv2 https:… If you didn't watch live, you can catch the guys' #Applemusicfestival performance here. http://t.co/4lEkeu00MH http://t.co/oJwC5GNVGr RT @AppleMusic: Because we danced all night to the best song(s) ever.\nTY @onedirection! #applemusicfestival\nhttp://t.co/qffJi01H3U http://t… RT @SonyMusicUK: .@onedirection take to the @RoundhouseLDN stage for their set at the #AppleMusicFestival &gt; http://t.co/t4ZAcUvAvk http://t… RT @Harry_Styles: 13.11.15 https://t.co/2b1SP12KGx Don't forget, you can pre-order your deluxe edition of #MadeInTheAM now! http://t.co/qYEj3RwRVN http://t.co/wdEobb1Z9B One more listen to #Infinity? We think so!      http://t.co/uhkHjDWuJz An incredible show from the guys at tonight's #AppleMusicFestival!  Who watched live? \nhttp://t.co/xemiYA0EcP http://t.co/1hK7SDQNNZ RT @bsimpk: Infinity is 🔥 Actually, that's an understatement. Can't wait to hear the rest of the album 😁🎶😍 @onedirection RT @MTV: I'm emotional. #applemusicfestival http://t.co/aGfEIItpds RT @Beats1: Are you listening?? \n@onedirection's live stream at #applemusicfestival is on #Beats1 now!\nhttp://t.co/cXEBOJW6fc http://t.co/x… RT @officialcharts: They're up! 🙌 @onedirection #applemusicfestival http://t.co/UeS6NUtpI0 RT @syco: It's time for @onedirection #applemusicfestival http://t.co/J3dQmbAvax http://t.co/pXnYjzemLd 🎶 Where do broken hearts go..🎶 #AppleMusicFestival RT @AppleMusic: The. Show. Starts. Now! \n@OneDirection at #applemusicfestival. \nWatch live: http://t.co/qffJi01H3U http://t.co/r4pO4gQsZR The guys are about to come onstage... Who's ready? http://t.co/ZvPWwHi5Jw #AppleMusicFestival RT @Beats1: The guys are on!\n@OneDirection hangs with @julieadenuga.\nhttp://t.co/rAPwDbsSan http://t.co/UzQsnS3MZ2 What do you guys think of the album track #Infinity so far?  http://t.co/uhkHjDWuJz USA! Who's ready for #MadeInTheAM?! Go pre-order now! http://t.co/qYEj3ROtkn http://t.co/lW8sktDMSX RT @Harry_Styles: You can pre order our new album 'Made In The AM' now on iTunes. \nHope you enjoy the new song.\nAll the love. \n\nhttps://t.c… Want to get your hands on an exclusive #MadeInTheAM bundle? Pre-order your copy via the guys' official music store! http://t.co/O0Od8ozQ1z RT @Louis_Tomlinson: Soooooo the pre order of our new album Made in the AM is out now!! Go get it :) https://t.co/5ZWIH3Vcac Search \"OneDirection\" on @Snapchat and tune into the guys' channel now! http://t.co/lXfkHFUKBH Head over to @Spotify now for your first listen to album track #Infinity. #MadeInTheAM http://t.co/uhkHjDWuJz RT @Real_Liam_Payne: You can now preorder Made in the A.M. and get Infinity off the album now! https://t.co/OMbKnDT5CU RT @NiallOfficial: Made in the AM is up for pre order  ... https://t.co/IpvIHqDJBW Pre-order #MadeInTheAM now and also get the album track #Infinity.  http://t.co/qYEj3ROtkn http://t.co/qprvs4HmWj RT @AppleMusic: 4 hours... \n@onedirection live at #applemusicfestival. #MadeInTheAM\nhttp://t.co/qffJi01H3U http://t.co/AAZXoeiq15 RT @Real_Liam_Payne: So our new album is called Made in the A.M. Can't wait for you all to hear it ! Look out for the pre-order link, we'll be putting that out soon! #MadeInTheAM The guys have an exciting announcement for you...\nhttps://t.co/J2IdOIJSYD Keep all eyes on the band's official Snapchat: \"OneDirection\"! RT @NiallOfficial: Camden its Gona be fun tonight ! Who's coming down ? RT @AppleMusic: It's almost time...\n@onedirection at #applemusicfestival 😁😍🎉\nShow starts at 8PM UK/12PM PT\nhttp://t.co/qffJi01H3U http://t.… Snapchat: \"OneDirection\" http://t.co/sTfV2WDKRG Want to watch the guys live at @AppleMusic Festival tomorrow night? Find out how. http://t.co/VmE4IjtjLh\nhttps://t.co/FJmblI7xy7 Not long to go until #OnTheRoadAgain2015 kicks off again in London! Who's coming? http://t.co/pFEOROOiHN RT @NiallOfficial: really can't wait for the apple music festival tomorrow at the roundhouse. My favourite London venue ... Looking forward… \"Baby you're a boat\"... http://t.co/BaJJv7BUCQ RT @bpi_music: *BIG news* @OneDirection’s album ‘Four’ has now gone 2x Platinum. Huge congrats! #bpiAwards http://t.co/KSqgmVFwRH The guys have more #DragMeDownMusicVideo behind-the-scenes action for you right here: http://t.co/IB29tLgZDs @HondaStage #HondaCivicTour It's the weekend! © One Direction/Cal Aurand http://t.co/sDwN6rcWG3 Excited for the guys’ headline performance at this year’s #AppleMusicFestival? Check out what they had to say.\nhttps://t.co/XMoLtXmksZ Who's still playing this everyday? #DragMeDown http://t.co/orEz8bKrm3 Wanna stay in the know with all things 1D? Be sure to sign up to the official newsletter. http://t.co/fY8xFtD2Un http://t.co/hWd2MJpHid Liam's still loving the beat drop on #DragMeDown http://t.co/orEz8bKrm3 http://t.co/bwYlobKrku Thanks for the nominations @MTVEMA! Vote for the guys using #EMABiggestFans1D \n http://t.co/g9Xi2fjs47 #OnTheRoadAgain2015 kicks off again in London next Thursday! Who's coming along? © One Direction/Cal Aurand http://t.co/glqggcoQM1 Who agrees that summer flew by too quickly? Throwback to this year's @CapitalOfficial Summertime Ball. \nhttps://t.co/Eg0P4boTVd Throwback to the #Milwaukee show on the #HondaCivicTour © One Direction/Cal Aurand http://t.co/7fwqpuNjA3 One week to go until the guys headline the @AppleMusic Festival! Can't join them? Watch live. http://t.co/VmE4IjtjLh http://t.co/Pr0Fh4Xg1L Ready for take-off! http://t.co/orEz8bKrm3 http://t.co/X1uf4krAln Music Mondays... \nhttps://t.co/2Jwdq8lHf2 RT @NiallOfficial: Thank you all so much for all the birthday wishes, I'm celebrating it with my friends and having a great time ... Love y… What are you guys listening to? We want to hear! http://t.co/H09htTgCCy http://t.co/725GbmPjpU RT @syco: 🎉It's @NiallOfficial's 22nd Birthday today! 🎉#HappyBirthdayNiall @onedirection http://t.co/4J7pMtGrry RT @Real_Liam_Payne: Happy birthday Neil https://t.co/440AKag34h RT @Real_Liam_Payne: Sad sad sad see you soon America https://t.co/HJKvEAyr2C RT @Harry_Styles: Thank you Boston. That was the perfect way to wrap up the U.S. Tour. Thank you to everyone who works to make the shows ha… RT @Harry_Styles: Thanks for spending some time with us. It's been an amazing tour, can't thank you enough. Thanks for having us. All the l… #HappyBirthdayNiall http://t.co/tB6XkTF0V9 .@LaBanda is here, join the adventure! Premieres Sunday 8PM/7C on @Univision RT @augustana: Opening for @onedirection &amp; @iconapop Tonight in Boston...see you all soon (Photo By @dustbar ) http://t.co/rTPXT795ll RT @Harry_Styles: Last show of the U.S. Tour tonight in Boston. Looking forward to seeing you. Thank you everyone who came to see us this y… RT @NiallOfficial: Can't wait to get back into Gillette stadium tonight... It's one of my favourite stadiums in America ... Star with 1D in a new video 'We the People' to support #globalgoals – Together we can change the world http://t.co/mbAG1pT5Kx Best. Song. Ever. \nhttps://t.co/DBmPySfLfW It’s here! Check out Part 1 of the behind the scenes from the #DragMeDownMusicVideo             http://t.co/QcY4J65o8f US Fans! Join 1D on the set of their #DragMeDownMusicVideo in this all-new making-of video: http://t.co/W5krYVFnBD #HondaCivicTour #OTRA Planning to come see the guys #OnTheRoadAgain soon? Grab all of the latest 1D merch here. http://t.co/HlwT5zZZuE If I didn't have you there would be nothing left... http://t.co/orEz8bKrm3 http://t.co/fafMRClEi2 RT @Real_Liam_Payne: Check out my covers for  @AttitudeMag http://t.co/etysoDIlV0 Finish the lyric: \"This time I'm ready to run...\" https://t.co/Sqjhs0ACU3 It’s @BBCCiN time again! Get involved and do your bit to help children all round the UK at http://t.co/VrPipb6xRv http://t.co/XdNzF2D8t5 RT @Real_Liam_Payne: I'm on the cover of the new issue of @AttitudeMag. Can't wait for you all to see the shoot! https://t.co/cHkK8hNHhs Humanoid vs Human http://t.co/orEz8bKrm3 http://t.co/Mt91AJ6IPu When the beat drops... #DragMeDownMusicVideo \nhttp://t.co/3MH9SBo09T http://t.co/zv4OziKon1 RT @Real_Liam_Payne: Instead we've made plenty of extra great seats available on the Twickets app for every night at face value prices.  ht… We wanna know what your top 3 tracks in the #OnTheRoadAgain2015 setlist are. Let us know! \nhttp://t.co/bz5F7UPpRA \"I got a river for a soul, and baby you're a boat...\" http://t.co/3MH9SBo09T RT @Harry_Styles: Take a stand with us &amp; @savechildrenuk: help make #RefugeesWelcome. http://t.co/pXUymBKqEn RT @NiallOfficial: Only a few shows left on tour in North America.. Just wana say thank you to all of you for coming out to watch us .. The… Niall and Harry killing the harmonies in Milwaukee. #HondaCivicTour © One Direction/Cal Aurand http://t.co/ZLWZ1ifnzW #Action1D wouldn't have been possible without all of you. Watch here. http://t.co/ilAcyy2Bsq Sunday spin! What are you listening to today? \nhttps://t.co/u20aBjbjQW Sing it guys! \nhttps://t.co/omVBRDThhh http://t.co/YZlwA44Hhc Where are you guys listening to #DragMeDown today? We wanna know. http://t.co/orEz8bKrm3 US Fans! 1D’s 2nd #BTS Tour Diary is finally here! See what the guys’ have been up to on #HondaCivicTour #OTRA: http://t.co/jWEpnml7rX How many #1DIllusion fans are following us today? Let us know. \nhttps://t.co/xHOo5l5X7Q RT @Harry_Styles: Thank you Philly for last night. Hope you all enjoyed the show, you've always been lovely to us. H RT @Louis_Tomlinson: Great show tonight !!! Thank you buffalo !! Who still can't get enough of #DragMeDownMusicVideo? We can't! http://t.co/3MH9SBo09T Take a stand with us &amp; @savechildrenuk: help make #RefugeesWelcome. http://t.co/F0BKjfTgtA If you liked the guys' friends @augustana in Detroit, check this out! http://t.co/cpPiantt3M Who can guess which stop on the #HondaCivicTour this was? http://t.co/wXlHBJ5dgw Thanks for all who have supported #DragMeDown so far. If you haven't, grab it here. \nhttp://t.co/7tKqB45Fk7 http://t.co/bVX6S2mSrK UK! Want to see the band perform at this year’s @AppleMusic Festival? Find out how http://t.co/0yJ8pu85tt http://t.co/x8yMQeT5BS Louis chillin' on set... #DragMeDownMusicVideo http://t.co/3MH9SBo09T http://t.co/txFvxwEX48 How many of you were blown away when the guys teamed up with @NASA for #DragMeDownMusicVideo? \nhttp://t.co/3MH9SBo09T RT @NiallOfficial: we couldn't have done Action 1D  without ya ! Check out the film with @action2015  http://t.co/RDr4XVksFn The guys are proud to launch 'Dear World Leaders' for @action2015, made from your amazing contributions to #action1D! http://t.co/ilAcyy2Bsq RT @Real_Liam_Payne: Really proud of how our Action 1D film turned out. Thank you to everyone who was involved! http://t.co/kt4vhRv7RN RT @Louis_Tomlinson: Just launched our new film with @action2015. We couldn't have done it without you!  http://t.co/HfoxSXrfVy Want a sneak peek backstage on the band's #HondaCivicTour? Watch here. https://t.co/JoA8DfHTyX 1D fans on Spotify, who's listening to the band's official playlist today? http://t.co/H09htTgCCy http://t.co/nZ2GboafZc RT @billboard: Happy 22nd birthday, @Real_Liam_Payne! Watch @OneDirection lead a crowd sing-along of “Happy Birthday” in Detroit: http://t.… \"Ohh, You &amp; I\" http://t.co/heXnATtQHa Who can't get enough of Harry's high notes? http://t.co/3MH9SBo09T http://t.co/Kpub8EL0Nu USA! You can win a trip to see the guys in London at http://t.co/DRcipl62Fu (NoPurNec: http://t.co/QJ3ts8JBzW) #ad http://t.co/bl8dvrUxhf Sometimes all we want to do on a Saturday is play dodgeball. Who's in? http://t.co/RL3tRkz1di #HappyBirthdayLiam\nhttps://t.co/MvHuWMbkYR RT @Vevo_UK: 🚨 ALERT 🚨 \n\nYou lot gave #DragMeDown 1m likes making it the most liked vid on #Vevo in 24hrs! @onedirection http://t.co/QVHOU0… What are you guys listening to this afternoon? We want your playlist suggestions! http://t.co/orEz8bKrm3 Has it really been a week since #DragMeDownVideo dropped? How many times have you watched it? http://t.co/3MH9SBo09T http://t.co/2jYYqRavMB Who's loving the latest #1DFragrance? Grab it here. https://t.co/RbNLBVWfXi http://t.co/e1rqZQmPRU RT @MTVMusicUK: Our #MTVHottest winners for the THIRD year in a row with 94,291,338 votes, @onedirection! 🏆 http://t.co/Xf5iDksjjM\nhttps://… How many of you can guess which throwback 1D video this is from? http://t.co/DupH1PNgjC Niall hangin' around on set. #DragMeDownMusicVideo \nhttp://t.co/3MH9SB6pil http://t.co/9CtsWmWUIW Four guys. One mission. #DragMeDown http://t.co/3MH9SBo09T http://t.co/IZ39EhQk3z If you haven't already, be sure to sign up to the 1D newsletter for all of the latest news! http://t.co/nLP1DPfMak http://t.co/C644FhVtTS Oh hey Louis... http://t.co/BaJJv7BUCQ http://t.co/87WgZ8b0Na RT @Real_Liam_Payne: Chicago that was amazing thank you so much loads of fun RT @Louis_Tomlinson: Siiiiiiick show last night as well !! Cheers RT @NiallOfficial: *tour I should say RT @NiallOfficial: Some new songs as the tor continues! Love you all xx RT @NiallOfficial: Loved Chicago last night .. top quality crowd. Soldier field is a great stadium too .. Thanks for having us RT @Harry_Styles: Thank you to everyone at the show in Chicago last night. You were very nice. Thanks for having us. All the love Step behind the scenes of the  blockbuster #DragMeDownMusicVideo. Who still has it on replay? http://t.co/3MH9SB6pil http://t.co/8mQTC8klHf RT @NASA_Johnson: #FlashbackFriday to when @NiallOfficial was inspired by a visit to @NASA. 1 year later #DragMeDownMusicVideoIsOut http://… Coming to see 1D on tour in the near future? Grab your merch here. \nhttp://t.co/v56cBNJGLE \"The pedal's down, my eyes are closed...\"\nhttps://t.co/iplQnRyNwC Who else woke up today and had to watch #DragMeDownVideo first thing? http://t.co/3MH9SBo09T RT @Space_Station: Currently living in space, @StationCDRKelly is 1 of 6 people that literally cannot be dragged down. #DragMeDown  https:/… #DragMeDown: Listen - http://t.co/orEz8bKrm3\n\nWatch - http://t.co/3MH9SBo09T Who's still can't stop hitting replay on the #DRAGMEDOWNMUSICVIDEO? \nhttp://t.co/3MH9SBo09T RT @NASA_Johnson: Tour @NASA with @onedirection! #DragMeDownMusicVideoIsOut \nhttp://t.co/hGyDIII1XK http://t.co/vCz0dpZffE RT @YouTube: There’s only @onedirection to space. https://t.co/BBDc5By4YT http://t.co/v4OcgyftR7 RT @TheEllenShow: I do a great robot. #DragMeDownMusicVideoIsOut @OneDirection http://t.co/9FrcWcqRNI RT @NiallOfficial: It was so cool to shoot at @NASA_Johnson , so glad we did coz it turned out sick   http://t.co/ZWXNlkTzGP RT @billboard: .@OneDirection's #DragMeDownMusicVideo has kept the track at No. 1 for 24 hours: http://t.co/R7XSS8W7aQ http://t.co/ylIGjCNN… RT @NASA: The band @OneDirection shot their #DragMeDownMusicVideo at @NASA! Thanks\n@Real_Liam_Payne @Harry_Styles @NiallOfficial @Louis_Tom… Is there anyone on earth who hasn't seen #DragMeDownVideo yet? #JourneyToMars http://t.co/3MH9SB6pil http://t.co/XRWrlbRHxs Hands up if you're still glued to the #DragMeDownMusicVideo!\nhttp://t.co/3MH9SBo09T Nobody can.... http://t.co/7cGwgC8A4k http://t.co/CYnsmo0oPb RT @ComplexMusic: .@onedirection prepares for flight in their new video for \"Drag Me Down\" 🚀 http://t.co/VY4eOTXBdl http://t.co/imFeyLOZOB Uhm, we know what we're watching this afternoon. Who else is with us? http://t.co/3MH9SBo09T http://t.co/MnIjSFF0oq RT @blueyedel: @onedirection #DragMeDownVideo is too perfect for me to watch at 2am without screaming and flipping out and waking everyone … RT @GMA: Now on @GMA, the TV debut of #DragMeDownMusicVideo from @onedirection! http://t.co/GoVhRHBGqA RT @NASA_Orion: @onedirection crew\n@Real_Liam_Payne @Harry_Styles @NiallOfficial @Louis_Tomlinson\naboard the @NASA_Orion Spacecraft! https:… RT @NASA_Orion: .@onedirection the suits fit well. Want to be our first crew?\n#DragMeDownVideo\nhttp://t.co/PedEpG2uLS http://t.co/F8EFTxGg8v Show us your face when #DragMeDownMusicVideo dropped on @Vevo this AM. http://t.co/RKWrdRT0YP Which part of the #DragMeDownMusicVideo is your favourite? http://t.co/3MH9SB6pil RT @TIME: Watch @OneDirection run around in space suits in the new video for 'Drag Me Down' http://t.co/yCm7MTvZD4 RT @MTV: Waking up to the #DragMeDownMusicVideo is the best way to wake up, tbh. Thank you, @OneDirection. http://t.co/VtpElvaroL RT @Vevo_UK: We've got a lil special message from @onedirection for #DragMeDown! Watch the full vid here: http://t.co/w2zHYV8W3v 💥 http://t… How many times have you watched the #DragMeDownMusicVideo already? http://t.co/7cGwgCqaVS RT @NASA_Marshall: Excited seeing @onedirection with @NASA, #Robonaut &amp; @NASA_Orion in #DragMeDownMusicVideo \nhttp://t.co/14uTDj693Q http:/… RT @minni8655: @Harry_Styles @onedirection The video is amazing❤❤😘 RT @syco: #DragMeDownMusicVideo has landed! 🚀 http://t.co/YdNiPH7P75 ✨ @onedirection http://t.co/iMCK3DvG2Q RT @Harry_Styles: http://t.co/7bAdnr3uqI RT @dilmarakhma: @onedirection's #DragMeDownMusicVideo is sickkk!!! I LOVE IT 😍 RT @backstreetboys: 🚀✈️ love the video! cheers @onedirection  https://t.co/nr7jS5swSF RT @SonyMusicUK: Surprise! @onedirection drop their #DragMeDownMusicVideo &gt; http://t.co/6fKml7qP5X http://t.co/xZaUr4vUHX RT @Vevo_UK: *brb just watching #DragMeDown on repeat all morning* @onedirection http://t.co/w2zHYV8W3v http://t.co/dy2NVpbzU0 RT if you agree that the #DragMeDownMusicVideo at @NASA is out of this world! http://t.co/7cGwgC8A4k RT @Vevo: 3, 2, 1....blast off with @OneDirection's new #DragMeDownVideo 🚀 http://t.co/cI4Jf9Z27h http://t.co/3jItC4YOQU #DragMeDownMusicVideo is FINALLY out!! Get watching on @Vevo. http://t.co/7cGwgC8A4k RT @Real_Liam_Payne: We shot our new video at @NASA! http://t.co/fIRP0m4VnP RT @NiallOfficial: here's our new video for Drag Me Down ! Hope you love it ! http://t.co/ZWXNllbayn RT @Louis_Tomlinson: Here's the Drag Me Down video. Thank you for all your amazing support on this single http://t.co/22ZXAHqLYz #ThrowbackThursday: who can guess which video this is? http://t.co/eezOEIgTTF UK! Which tracks do you want to hear on the guys' #AppleMusicFestival setlist? Tweet us your requests http://t.co/scqTIKl4eL Reliving Niall and Liam's 'Story of My Life' synced moves...\nhttps://t.co/v001wb8fCi http://t.co/5IJ0PRQ0Gy UK! In case you missed the announcement! The guys will be headlining the #AppleMusicFestival on 22/9. http://t.co/VmE4IjtjLh RT @Louis_Tomlinson: Thank you so much for your support at the teen awards, amazing ! You don't know how buzzing I am that no control won 😎😎 RT @Louis_Tomlinson: Excited for the show !!!! RT @NiallOfficial: Columbus Ohio are you ready for tonight ? It's Gona be sick , we're all refreshed and ready to go , it's Gona be a good … RT @NiallOfficial: can’t believe we get to headline Apple Music festival ! Gonna be great ! The band's still ridin' high in the charts thanks to all of you! Who hasn't grabbed their copy of #DragMeDown yet? \nhttp://t.co/7tKqB45Fk7 The guys are excited to be headlining the #AppleMusicFestival in London on September 22nd! http://t.co/4lEkeu00MH\nhttps://t.co/MNPTrpqd0Y RT @Real_Liam_Payne: Well excited to be back in London headlining the #applemusicfestival on September 22nd! http://t.co/PohnFRdf0m There are only a few more hours left to donate for a chance to win a trip to meet the guys AND help @believeinmagicx! http://t.co/oIx1HgJ4UT RT @Em_long6: How I feel when the beat drops on drag me down #DragMeDrops http://t.co/Z2KZc9phRw RT @Minionology: #DragMeDrops @onedirection http://t.co/cxZ6dvYsDi Looking back through the #DragMeDrops responses has us like... http://t.co/oMv53GBUOc RT @Harry_Styles: Thank you for all your support at the TCAs last night. You're all very nice to us. Really amazing, thank you. All the love RT @NiallOfficial: You guys are just so powerful and you don't even know it,what you do for us on a daily basis is mind blowing, thank you … One small step for Louis, one giant step for #1DFragrance\nhttps://t.co/0frjdHtYSD RT @Hollyscoop: Congrats to one of tonight's biggest winners: @onedirection! #1D #TeenChoice #TeenChoiceAwards http://t.co/1KaqAbpiEc RT @accesshollywood: No one touch me @onedirection just made a surprise #TeenChoiceAwards appearance (And they won like a million awards) h… RT @Spotify: Hey, #1DFamily: @onedirection want YOU to stream \"Drag Me Down\" on Spotify!  https://t.co/NeeKc5iS7c We wanna see how many of you have followed the official 1D playlist. Comment below &amp; tell us your favourite track! http://t.co/orEz8bKrm3 Down to the deepest ocean. Check out http://t.co/lkoA4JK2G3 to see when it's available in your country #1DFragrance\nhttps://t.co/YwjOhbq387 It's the weekend! © One Direction/Cal Aurand http://t.co/wpsxz9aRLv USA! You could win a trip to see 1D in London at http://t.co/DRcipkOrNW (NoPurNec Rules: http://t.co/QJ3ts91cYw ) #ad http://t.co/XEIR2Gn9mO What's your favourite moment from the guys' #HondaCivicTour diary? https://t.co/JoA8DfHTyX UK Fans! Don't forget that @Twickets are releasing premium tickets at face value for OTRA UK shows! More info here http://t.co/35p5QMhOyy How many 1D fans are listening to #DragMeDown on @AppleMusic today? http://t.co/ScXHlG2hHE http://t.co/gftD5GY6Nt As it's Thursday...  \nhttps://t.co/1GdXahRrVu Did you make our #DMDCoverArt video? Find out here.\nhttps://t.co/X4Lk1Zj0Zh Thanks to all of you who have supported #DragMeDown so far! Who's still listening daily? http://t.co/orEz8bKrm3 http://t.co/3k69z2xTGz RT @billboard: One Direction's @NiallOfficial reacts to \"incredible\" #Hot100 debut of \"Drag Me Down\" http://t.co/PEfGnSlcg5 Who's loving the latest #1DFragrance? Haven't got it yet? Grab yours. http://t.co/zG6XpVnUvB http://t.co/b00QUwh5AW RT @Harry_Styles: Peace signs in Baltimore last night. Thank you for having us. Hope you enjoyed the show. All the love https://t.co/xJcolP… \"Nobody, nobody...\" © One Direction/Cal Aurand http://t.co/uUn1rUEThF US Fans! Check out how the 1D custom Civic was made in this cool #HondaCivicTour timelapse vid: http://t.co/8IVdLchGbA Who's still watching the guys' @GMA performance over and over? http://t.co/TCFNzD8Z7m Sunday soundtrack! Who else is listening? http://t.co/orEz8bKrm3 If you haven't already, sign up for exclusive 1D updates here. http://t.co/nLP1DPfMak What's your favourite line from #DragMeDown? Show us using #1DMD http://t.co/Sj3719f3M8 RT @NiallOfficial: #1 thank you so much ! Really means a lot to us ... Insane reaction to this song! Much appreciated RT @Harry_Styles: Thank you for all the support for Drag Me Down. Couldn't be happier to find out its number one in the UK. Glad people lik… RT @officialcharts: So we have a brand new Number 1 single today... http://t.co/I9jyiF917t #DragMeDown's at No.1 in the UK! Thank you! http://t.co/7tKqB3O4sz http://t.co/R9xIBTCsTD RT @RollingStone: 16 reasons One Direction are on top of the stadium rock game http://t.co/wr9Fjn75DN http://t.co/R8LbwZ5xWU Has it really been a week since #DragMeDown dropped? Who's still playing it all day, everyday? http://t.co/orEz8bKrm3 http://t.co/tmg2UUdMxh We want to know how many of you have added Drag Me Down to your playlists! http://t.co/orEz8bKrm3 1D fans on Android! You can grab your copy of #DragMeDown on Google Play now. http://t.co/QvswdHCKqH http://t.co/w4hsDZwBIx You’ve all helped make a massive noise to demand a better world. Thank you all for taking part in #action1D http://t.co/ArQ6eWiljU Who saw the guys perform #DragMeDown on @GMA this morning? You can watch it again here! http://t.co/TCFNzD8Z7m RT @Harry_Styles: Thank you to everyone who came out to say hello this morning. And thanks to @GMA for having us. H RT @NiallOfficial: Thank you to all the fans who stood there for hours in the rain waiting for us, you were a fantastic audience , cya tomo… Last chance! Have you completed all of the actions? #action1D https://t.co/AHJo1AP4Ya http://t.co/W4OgfAfGCo Who still hasn't grabbed their copy of DMD yet? #DragMeDownToNo1 http://t.co/7tKqB45Fk7 http://t.co/yQte2wlaXU Thank you to all the fans who came down to Central Park and to everyone who tuned in to @GMA! #1DonGMA http://t.co/d8KxPnEwuJ Singing #StoryofMyLife on @GMA #1DonGMA http://t.co/bCLun2dtve RT @GMA: 🎶 She belongs to me! 🎶\n\n#1DonGMA http://t.co/Haf6duESO4 Who's ready to hear the guys perform on @GMA? #1DonGMA http://t.co/VdgUoxZnDo RT @Real_Liam_Payne: Great to see all the fans in Central Park for @GMA ! RT @GMA: IT'S ALMOST TIME.\n\n☆。 ★。 ☆ ★\n。☆  。☆   。☆\n★。＼｜／。★\n☆#1DonGMA☆ \n★。／｜＼。★\n。 ☆  。☆  。☆\n☆。 ★。 ☆ ★ http://t.co/n5XPCXCcjb RT @Spotify: .@onedirection just obliterated our one-day streaming record with the release of their new song, \"Drag Me Down\" http://t.co/Ja… RT @GMA: ONE. MORE. DAY.\n@onedirection \n@Harry_Styles \n@Real_Liam_Payne \n@NiallOfficial \n@Louis_Tomlinson \n#1DonGMA http://t.co/bT5DJNr49J USA! Enter 2 win a Boston trip 2 meet 1D! http://t.co/q2VmFmlhI9 (NoPurNec. See Rules) #ad pic: Cal Aurand http://t.co/MmapdjH4Cj What a weekend! Have a guess what we're listening to this afternoon? http://t.co/orEz8bKrm3 Your #action1D films and pics are awesome. Take a look at some amazing stuff by the 1D Family! http://t.co/ArQ6eW0Ksm http://t.co/PuIXCcNEmG RT @Harry_Styles: Hope everyone is liking Drag Me Down so far. Thank you for all the support. All the love RT @MarvinHumes: Massive congrats to @OneDirection the lads have gone straight in at number 1 on the @BigTop40 with 'Drag Me Down' well don… If you haven't already, grab your copy of #DragMeDown here. http://t.co/7tKqB45Fk7 http://t.co/YN5OTSfORa RT @baabygilinsky: #DragMeDrops http://t.co/MWRgPvt6PY Show us how you feel when the beat drops on #DragMeDown using hashtag #DragMeDrops! http://t.co/a4pdyDZiCg RT @Harry_Styles: https://t.co/c6UjBoVqRB\n\nAll the love. H Your #action1D films and pics are awesome. Take a look at some amazing stuff from all of you! http://t.co/ArQ6eWiljU RT @NiallOfficial: Thank you dude! Xxx  https://t.co/LqL9T6rhde RT @imveroniica: @onedirection @Real_Liam_Payne I had just woken up, I look at the notifications, listening and start to jump everywhere. RT @bradsmcveyy: My reaction when #DragMeDown was dropped http://t.co/Krr1d9DfNu Tweet us your reaction when this happened... #DragMeDown  https://t.co/ok0kg1FB51 RT @NiallOfficial: Thanks a lot olly mate  https://t.co/aOldZqcHEZ RT @NiallOfficial: Thank you guys!  https://t.co/p1CbPt1DPs RT @NiallOfficial: well if that wasn't the coolest day ever then I don't know what was, drag me down is out, we performed it in Indy ! sick… We wanna see all of your best #DragMeDown cover art designs! Show us using hashtag #DMDCoverArt. http://t.co/7gXFGP82yt RT @ZozeeBo: ALSO, DRAG ME DOWN IS AMAZING! Pretty sure @PointlessBlog will be playing it on repeat for the next few weeks RT @Harry_Styles: https://t.co/BFQSZwSfbF RT @Harry_Styles: Indianapolis you were lovely tonight. Glad we got to perform Drag Me Down for you. Thanks for having us. Hope you had a g… RT @Louis_Tomlinson: The reaction to Drag me Down has been incredible !! Thank you for being so great , as always !! RT @Louis_Tomlinson: 🎶 nobody , nobody 🎶 RT @Louis_Tomlinson: Siiiiiiiiiiiiiiiiick show tonight ! Hope you liked drag me down !!! We can probably guess what you're all listening to on Spotify today. #DragMeDown http://t.co/orEz8bKrm3 RT @Real_Liam_Payne: So what do you guys think of Drag Me Down? http://t.co/IoNNDGghiP RT @bethanytuller: @onedirection http://t.co/emAxyae84S RT @callistolou: @onedirection I just woke up and saw it on my timeline and I was like: http://t.co/zZfjjnMw5D RT @Louis_Tomlinson: Thank you for all your constant support. Hopefully you love it , we're proud of it :) RT @NiallOfficial: Wowwww ! The reaction to drag me down worldwide has been insane , didn't expect this ! Thank you all so much RT @younghollywood: We'd say this is pretty accurate! We are LOVING @onedirection's surprise single #DragMeDown! What a day! 🎶🎶💥🎉💚 http://t… RT @SiriusXMHits1: Hear #DragMeDown EVERY HOUR on #Hits1! Listen using ⬇️\n\nUS: http://t.co/gTjnZRwLVl\nINT'L:  http://t.co/vlhcvIl5RH http:/… Have you added #DragMeDown to your playlists yet? \nhttp://t.co/orEz8bKrm3 http://t.co/WRnvNcaPAr Show us your face when #DragMeDown dropped today! © One Direction/Calvin Aurand http://t.co/tYQ0ImT9TH RT @Real_Liam_Payne: .@GMA on 4 Aug. Get your free tickets here http://t.co/MFmJquLJtG RT @GMA: 🎶 Nobody, nobody can drag me down. 🎶\n\nRetweet if you're excited for @onedirection on @GMA! #1DonGMA #DragMeDown http://t.co/aDb6Os… Are you loving #DragMeDown? Let us know. http://t.co/7tKqB45Fk7 http://t.co/8TduuP3LZS RT @billboard: .@OneDirection's new single #DragMeDown surged to No. 1 on the #Trending140: http://t.co/0asaN62ZlY http://t.co/PBsdSMJst9 Happy Drag Me Down Day Everyone! http://t.co/QvswdHCKqH Niall would like you all to know that Drag Me Down is out now! http://t.co/7tKqB45Fk7\nhttps://t.co/EloMY7jDBN A message for all of you from Louis about #DragMeDown! http://t.co/7tKqB45Fk7\nhttps://t.co/xqly1PTTC1 RT @kieracass: So I went to sleep like 2 seconds before @onedirection released a new song. Sounding good. RT @MTV: .@OneDirection, I'm listening to #DragMeDown and wowowow http://t.co/Gx2mhw2wzi 🔥🔥🔥 Are you listening to #DragMeDown? Show us! http://t.co/orEz8bKrm3 RT @ZoeZels: Drag Me Down is my new jam 🎶 YAAAAAS @onedirection RT @GMA: They released a new single, but @OneDirection has another huge announcement and it's coming up on @GMA! #DragMeDown http://t.co/L3… Harry's excited to share #DragMeDown with all of you! http://t.co/orEz8bKrm3\nhttps://t.co/mQ0Dp765Io RT @TwitterUK: 1.6 million Tweets and counting about @onedirection's surprise song announcement - #DragMeDown http://t.co/KXJMTJYwA0 http:/… RT @SonyMusicUK: .@onedirection surprised fans this morning with the release of their new single #DragMeDown! http://t.co/cfBpSNoEWv http:/… RT @ThisIsMax: So @onedirection shutdown #itunes 😜 RT @elainebu_bu: If I felt like I was waking up with no purpose today...amazing @onedirection best surprise EVER #DragMeDown  https://t.co/… RT @lizula02: @onedirection It's so goooodddddd I'm in love with this song😱😱😱😍😍😍😍😍 Check out this message about #DragMeDown from Liam. http://t.co/7tKqB45Fk7\nhttps://t.co/rpgkZvCAi0 RT @SpotifyUK: .@OneDirection explain why they couldn't wait to release their surprise, #DragMeDown Listen: http://t.co/P0mrU2qMWN\nhttps://… RT @AppleMusic: #Directioners, surprise! 😊 🎉💥\n@OneDirection is back with #DragMeDown! \nhttp://t.co/jXKBNOptTf http://t.co/qtpD8NlUgl RT @syco: SURPRISE! @onedirection just dropped their brand new single #DragMeDown! 😉 https://t.co/Ja4BiZjqvg http://t.co/ozXvvHqvnM RT @billboard: .@OneDirection dropped a big surprise overnight with the release of the new track \"Drag Me Down\". http://t.co/A3S5OGoF2S So, what do you guys think of #DragMeDown? http://t.co/7tKqB3O4sz http://t.co/CqUwrIshXp HEY GUYS! So, #DragMeDown dropped earlier! Check out what the guys had to say about it.\nhttps://t.co/Z2E32BMjn1 RT @BBCNewsbeat: Here is the new @onedirection single. We will be playing it on @BBCR1 in 10 minutes. #DragMeDowm http://t.co/x5FxfjGYgb RT @TinaDaheley: BREAKING: We're playing the new @onedirection single on @R1Breakfast this morning *Screeeeeeeeaaaaaaaaamms* RT @NiallOfficial: Finally we get to say this ! have waited a long time but our new single Drag Me Down is out !!!  http://t.co/ZNONKQKXqd #DragMeDown is now on @iTunes  . https://t.co/i2DVqTnJt3 https://t.co/3PjR8G44KX #DragMeDown is now on @Spotify. https://t.co/4SbUdSfYBO https://t.co/9SDgxdOSa8 Listen up everyone, #DragMeDown is now on @Spotify. https://t.co/4SbUdSfYBO https://t.co/mD8yMW0xxo #FOUR: which track is your favourite, and why? https://t.co/wnVWMzlG5i .@action2015 want to make a difference in education. Find out how you can support the cause.\nhttps://t.co/AHJo1AP4Ya Want to make it into the next #IamOnTheRoadAgain gallery? Show us your pics using hashtag #IamOnTheRoadAgain. http://t.co/cBNsisrsUL US Fans! Here’s never-before-seen footage of 1D taken backstage on #HondaCivicTour #OTRA! http://t.co/pTcEQ9jL6V RT @MalalaFund: .@Harry_Styles wants \"to live in a world where EVERY child can go to school.\" RT for #action1D http://t.co/V4Eq0w5hmq http:… See why @Harry_Styles cares so much about education. #action1D https://t.co/AHJo1Axu6C https://t.co/InhdI2VkHk RT @Louis_Tomlinson: Great show tonight !! Loveeeeeeeeee \"I know how it goes for wrong and right\" - You &amp; I https://t.co/2Jwdq8lHf2 http://t.co/HgzSrAulTy UK! A reminder that @Twickets are releasing premium tickets at face value for the guys' UK shows! More info here. http://t.co/35p5QMhOyy Who can guess where in the world this photo was taken? http://t.co/asNkmuvto3 RT @Louis_Tomlinson: Defo does get emotional watching all these videos you guys have made for the 5 years ! You guys are too good to us :) RT @Real_Liam_Payne: Thanks Winnipeg had a great night u guys were incredible xxx What kind of world do you want to live in? Share your film, photo or art – the band wants to see it! #action1D http://t.co/ArQ6eWiljU RT @NiallOfficial: Thanks to the boys too, we've seen and done some incredible things together, love you all ! RT @NiallOfficial: You guys have changed our lives and we all love you so much ! Best fans on the planet , easy! RT @NiallOfficial: Thank you so much for what you've done for us so far, what an incredible journey it's been , wish we could thank you all… RT @NiallOfficial: 5 years , literally sittin down talking about last night. Insane! I remember the day we were out together like it was ye… RT @Real_Liam_Payne: Thanks for all the memories boys I love you all RT @Real_Liam_Payne: Wowwwww 5 years 5 boys what an amazing journey I couldn't thank you all ever enough and thank you Louis Niall Harry an… #TBT: today we're listening to #LittleThings. Who else has played this track today? https://t.co/1GdXahRrVu RT @savechildrenuk: #ThankYou1Dfor taking action to change our future for the better.\n http://t.co/jTwAsc0p0s http://t.co/1pDZXSwQ0J RT @Louis_Tomlinson: Every single day we are thankful for the platform that you incredible people gave us . What an amazing 5 years it's be… RT @Louis_Tomlinson: You have been by far the most incredible fanbase and nothing you do goes unnoticed . We are so lucky to have you guys … RT @Louis_Tomlinson: Thank you thank you thank you thank you thank you thank you thank you thank you thank you thank you thank you thank yo… RT @Louis_Tomlinson: My attempt of expressing how thankful we are for you guys ! RT @Harry_Styles: To you who support us, in any way, thank you. We wouldn't be here without you. You did this and we thank you for having u… RT @Harry_Styles: All the crew that we have been so lucky to work with, and everyone who is behind the scenes. We thank you for everything … RT @Harry_Styles: We have been a band for five years. And it is impossible to thank anyone enough for all the support they have given us ov… RT @Harry_Styles: Edmonton was a lot of fun last night. Thank you for being there. Thank you for having us. Hope you enjoyed it. H We want to see what you guys love the most about where you live today! Show us. http://t.co/ArQ6eWiljU #Action1D Hey everyone, here's your first look at the #1DAnnual16 cover  – out soon! Pre-order here http://t.co/mGOb3bJVz6 http://t.co/H79j2NNY1Z The #action1D entries you guys have submitted so far have been perfect. Keep them coming http://t.co/ArQ6eWiljU http://t.co/bIRQVvtxYv 1D Family! @Twickets are releasing premium tickets at face value for the guys' UK shows! Click here to find out more. http://t.co/35p5QMhOyy RT @action2015: Wow! Over 50,000 #action1D videos already! You all have the power to change our future http://t.co/tmZFIXAfbO http://t.co/b… RT @action2015uk: Share with @onedirection @action2015 when you are happiest!  http://t.co/0T2lkawPHD #action1D http://t.co/5eFC2T0nlB When are you happiest? Make a video of yourself doing what you love the most! #Action1D  http://t.co/ArQ6eWiljU http://t.co/aVor3EqAEG RT @NiallOfficial: Both @Real_Liam_Payne &amp; I want to live in a world where everyone has the chance to fulfill their dreams  https://t.co/uQ… RT @Real_Liam_Payne: 1 in 7 people live on less than £1 a day. This must change. That’s why @NiallOfficial &amp; I made this film #action1D htt… Watch @Real_Liam_Payne &amp; @NiallOfficial tell us about the world they want to live in, then make your own film! https://t.co/gGe4L8YD3o We're playing Steal My Girl today. Who else has this on repeat? https://t.co/lomUJse138 http://t.co/ywWN1rs5Bm Want to help make change? The guys need you to tell them what kind of world you’d like to live in http://t.co/ArQ6eWiljU  #action1D RT @NiallOfficial: VAN CITY  it's been a while, oh how I missed this place ! Beautiful spot ... See you all in that cool lookin stadium ton… RT @ManUtd: The venue for our first #MUtour match had some other famous visitors this week, @OneDirection. http://t.co/Y8UGVvsf01 RT @__atrg: @PainedSmile , @Heyyitstrish and I just joined @OneDirection's #Action1D movement by making this video #Action2015 https://t.co… RT @abbey_worboyz: @Louis_Tomlinson https://t.co/VKwiEzSHnQ we take action The guys have helped write a kids book for Children In Need with friends!  Pre-order it now: http://t.co/z3MSkHFJPl The guys are loving your #action1D films and pics! Check it out. http://t.co/ArQ6eWiljU http://t.co/sCqeT8SPed Have you signed up for your #1DFragrance e-alert yet? Be one of the first to get your hands on Between Us. http://t.co/J24HxyjBsO RT @Louis_Tomlinson: Amazing show ! Thank you for the support !! RT @Harry_Styles: Thanks for having us Seattle. You were amazing tonight. Hope you enjoyed the show. All the love RT @NiallOfficial: SEATTLE ! You ready! Good to be back ! Home of a few of my favourite bands ever Seattle! Who's ready for 1D at @CenturyLink_Fld tonight? See you there. Get excited! #HondaCivicTour http://t.co/2YH30es4aY Even the smallest changes can make a big difference in tackling climate change. Find out how you can help. http://t.co/ArQ6eWiljU #action1D Who's seen 1D on the road since the #HondaCivicTour started? We want to see your pics! Send them along using #OnTheRoadAgainTour2015. Watch @Louis_Tomlinson tell us about the type of world he wants to live in. #action1D  https://t.co/UalYlKdhkP 750 million people around the world lack access to safe water. You can help change that, find out how. http://t.co/ArQ6eWiljU #action1D RT @Louis_Tomlinson: Siiiiiiiiiick show tonight ! Sick stadium toooo!!! Find out why the guys want you to come together to make a difference #action1D http://t.co/ArQ6eWiljU http://t.co/Men6gYccOq RT @NiallOfficial: Wow ! Crazy isn't it ... Love ittttttt  https://t.co/moafLptvCb RT @Louis_Tomlinson: Feeling emotional thinking about it all , 5 years!!!? Where has the time gone !? RT @Louis_Tomlinson: 5 years ago today since my audition! Still an impossible thing to comprehend! Everyone who's ever supported us we can … RT @Harry_Styles: Thank you everyone who came to the San Diego show last night. Perfect way to start the tour. Thank you so much for having… RT @Valenaa: I just joined @OneDirection's #Action1D movement by making this video - go get involved! #Action2015 https://t.co/VWMbGjeN7F RT @angela_tillson: https://t.co/pG4Z4TWdo6 I just joined #Action1D you should too. Tell the boys what kind of world you would like to live… RT @AstxAtikpatik: I just joined @OneDirection's #Action1D movement by making this video - go get involved! #Action2015 https://t.co/fpy964… RT @HondaStage: The 2015 #HondaCivicTour ft. @onedirection has kicked off! 1st stop was San Diego, biggest show in Civic Tour history http:… San Diego, you rocked! San Fran, see you tomorrow! Check out the setlist here. http://t.co/CIZRDzCUrH #HondaCivicTour RT @HillaryClinton: The boys are right. We need everyone's help to get the planet moving in the right direction. http://t.co/rNQSBSmgJ8 #ac… RT @NiallOfficial: San Diego! U were badass ! The stadium was one of the best I've ever seen, the crowd was insane ! Loved every minute of … We’ve seen so many great #action1D entries already – take a look http://t.co/ArQ6eWiljU http://t.co/mqqApF7A6y RT @NiallOfficial: Let's go San Diego!! How many of you are coming to the #HondaCivicTour On The Road Again show in San Diego? © One Direction/Calvin Aurand http://t.co/pZJ0CppN8m RT @NiallOfficial: #OTRA USA /Canada starts today! Oohh yeh , and it kicks off in the beautiful San Diego! Can't wait to see you all again … RT @Harry_Styles: I am very pleased to be involved in this.\nAmazing how much you have all helped already. Thank you. All the love\n\nhttp://t… RT @NiallOfficial: me and the guys are launching #action1D !  get involved ! http://t.co/rieUb7ujkm RT @Louis_Tomlinson: Hey we're launching #action1D to help make a difference. Find out how you can get involved http://t.co/92NnmGqKxL RT @action2015: We’ve joined forces with @OneDirection to show leaders that we want a better world. Take part in #action1D here http://t.co… We've just launched the 1st of many video actions! Join the #Action1D movement &amp; show us the world u want to live in. http://t.co/ArQ6eW0Ksm One Direction are teaming up with Action/2015 to help make a difference – wanna get involved? #action1D https://t.co/99KRPh3Ofh RT @Real_Liam_Payne: Today we're launching #action1D to help make a difference. Wanna get involved? https://t.co/zxY6XQIxC2 Harry's ready for the new #1DFragrance. Are you? http://t.co/HnNGpSBGms Hey USA, only two more sleeps until #OnTheRoadAgain2015 kicks off. Who's excited? © One Direction/Calvin Aurand http://t.co/fl5nKu2rpK RT @Shazam: The #Shazams of @onedirection’s life–follow the boys in #Shazam &amp; see them all: http://t.co/WpZ8j8yHLk #Directioners http://t.c… The #OnTheRoadAgain2015 Spotify playlist now includes '18' and #NoControl! Who's following? http://t.co/CIZRDzUvQh http://t.co/hXlaHUhrMQ The tear of joy when you realise it's Friday... #TheTearOfNiall http://t.co/T1rcZD77Z1 One week to go until the boys take the stage in sunny San Diego! #OnTheRoadAgain2015 © One Direction/Calvin Aurand http://t.co/cmPn9xLSff This is how much Niall loves the new #1DFragrance, Between Us! http://t.co/U3lZlOrQXE Very excited to share all the great music we’re Shazaming! Follow us in @Shazam now to see: http://t.co/ilY7mlwaUi. http://t.co/OhyedsdM5d Danke to all of you! © One Direction/Calvin Aurand http://t.co/K4PwhT3Y4z Are you still watching the #1DFragrance clip? Let us know! \nhttps://t.co/jQD6CrOXkx http://t.co/ckzgfm5CZz Until next time Europe... You've all been amazing. © One Direction/Calvin Aurand http://t.co/TSOVtMt193 RT @Harry_Styles: Helsinki, thanks for having us tonight. Perfect way to finish the European leg of the tour. Hope you had fun. All the love Not long to go Finland! Who's joining the band tonight? #OnTheRoadAgain2015 © One Direction/Calvin Aurand http://t.co/5vXany6wKs #Flashback: Dodgeball w/ @JKCorden! Which part's your favourite? http://t.co/SFr5ckkr9r http://t.co/LNRHs9vmbI Voting for the first round of @TeenChoiceFOX closes tomorrow. Who’s been voting for 1D? Keep it up! Tag #ChoiceSongGroup and @onedirection. Want to make it into the next #IamOnTheRoadAgain gallery? Find out how. http://t.co/VwA5sbG0hO\nhttps://t.co/dc4HA2Yf74 RT @fignewton1996: #1Dfragrance #BETWEENUS  this is the best perfume commercial I've ever seen! 😂😂👌🏻👌🏻 @onedirection is great! I love it ht… The band's new fragrance, Between Us will be released soon! Release dates here:  http://t.co/nQgkvRzlgb #1DFragrance http://t.co/oEBafN0BnE RT @ShelbRene95: IM SO EXCITED FOR THE NEW #1dfragrance BETWEEN US!!!!! THE BOYS LOOKED AMAZING FOR THE LAUNCH AND COMMERCIAL 😂😂😂 IM READY! RT @Tiia_Direction: #1DFragrance THE COMMERCIAL WAS TOO GOOD OMG ♥ RT @yuanqi_ah: #1Dfragrance OKAY IM EXCITED FOR BETWEEN US OMG YAYYY RT @Louis_Tomlinson: Siiiiiiiick show in Sweden !!! Standard ! RT @NiallOfficial: Oh it feels so good to be back in Sweden! 🇸🇪! Hallå Sweden! © One Direction/Calvin Aurand http://t.co/gfVFk8b3xI Hey Louis! Who knows where the guys are off to next? #OnTheRoadAgain2015 http://t.co/Z4tqx4m7AP Hey 1D Family!  Want your One Direction news first? Sign up to the newsletter here &gt;&gt; \nhttp://t.co/nLP1DPfMak RT @Harry_Styles: Oslo, thank you for last night. You were so nice to us. It was lovely to be back. All the love US Fans! Enter to upgrade your #HondaCivicTour tickets: http://t.co/UeAznJzCqD (NoPurNec Rules: http://t.co/ayyLnBXh01) @HondaStage #ad RT @Harry_Styles: Looking forward to the show tonight in Oslo. See you soon. H RT @Louis_Tomlinson: Oslooooooooooooo lets have it !!!! RT @NiallOfficial: Oslo ! Let's go .., good to be back Oh hey Norway. See you later! #OnTheRoadAgain2015  © One Direction/Calvin Aurand http://t.co/zxapa7TNNv Who else can't stop watching this today? #GirlAlmighty https://t.co/wXFs2kTgAV http://t.co/rWZ1dRx1O7 #OnTheRoadAgain1D US &amp; Canada dates are almost here! Get tickets here, and we'll see you soon! http://t.co/6pz7KLnglw Why not check out what Liam snapped using his onstage camera in Vienna? (Need to view it in Google Chrome!) \nhttp://t.co/n6HUMeGSfg RT @Louis_Tomlinson: Ahhhhhhhh great show again today !!! RT @NiallOfficial: Well that was fun! thank you horsens ... It was soo fkn cold out there , I think it's a day in bed for me tomorrow ! Nig… Not long to go Denmark! Who's coming to see the band tonight? #OnTheRoadAgain2015 © One Direction/Calvin Aurand http://t.co/aX7kbgQbSa RT @Louis_Tomlinson: Was absolutely amazing performing No Control last night ! That moment will stay with me . Thank you for your support !! Happy Monday! http://t.co/Ke5qmxAHy9 Want to know what the band listen to on tour? Follow them on @Spotify to find out. https://t.co/bJxKf8FVO3 RT @Harry_Styles: Thank you to everyone who was at the show in Brussels last night. You made it a great one. Thanks for having us. H Just posted a photo https://t.co/pw8F1Bx9d3 RT @NiallOfficial: Finally ! 18 and no control in the set , we needed that extra few days rehearsal on them! It felt so good to play new ch… RT @Real_Liam_Payne: Had such a great time tonight xxx so much love everywhere Just posted a photo https://t.co/eOt0pI9vyq The show has kicked off in Brussels! @ King Baudouin Stadium https://t.co/pMWnk6XmuR Belgium, we'll see you later! © One Direction/Calvin Aurand http://t.co/UhH64Odifh #Repost @NiallHoran. 📷 Calvin Aurand/ Vienna https://t.co/sBcY2xLJqR http://t.co/MPAkPJWv1u Take a look back at what tunes Louis was listening to on the #OnTheRoadAgain2015 tour bus. http://t.co/vfaqjemilO That feeling when you know that the next #IAmOnTheRoadAgain2015 show is only a few days away... http://t.co/dGLU3Ie0NI Vienna you were amazing last night! Only a few more sleeps until Brussels. http://t.co/NB60NqZCTx RT @NiallOfficial: Tell Ya what! That gig tonight in Vienna was hands down one of the best shows ever! The crowd were so up for it ! Thank … US! First round of #TeenChoice nominees are here &amp; 1D is nominated in 3 @TeenChoiceFOX categories! You can vote now: http://t.co/7ku6zW1Bbs Liam's ready to go onstage in Vienna https://t.co/PzEzF15RMG US! First round of #TeenChoice nominees are here, and 1D is nominated in 3 @TeenChoiceFOX categories! Vote now: http://t.co/umyfttN4ub RT @NiallOfficial: Vienna ! Let's do this ! You ready? Did you make it into our #IamOnTheRoadAgain gallery? Watch to find out. http://t.co/BhW1PA1ft1 RT @NiallOfficial: Just woke up ! Needed that sleep.. Anyway, show tomorrow, going to Vienna . Can't wait to see you all for the first time… Have you voted for this year’s #TeenChoice? Find out if the guys are nominated by using #TeenChoice to unlock the nominations early! What a rocking weekend! Check out the guys' @CapitalOfficial Summertime Ball performance from start to finish. http://t.co/IqfJVJSOgd RT @Real_Liam_Payne: Last nights pic thanks Cardiff u were great https://t.co/5ZTEw4FDjw RT @Louis_Tomlinson: Capital that was siiiiiiiicccccck !! Thanks for having us @CapitalOfficial @ashleytabor Thank you @capitalofficial #capitalstb @ Wembley Stadium https://t.co/uRdXaG6zUv RT @NiallOfficial: It kicks off at 3pm so make sure you're down here , we're kicking it off ! @CapitalOfficial #STB2015 RT @Real_Liam_Payne: We'll be on at 3PM at the @CapitalOfficial summertime ball! Excited to see you all! Europe, the band are back in town!  Check out the #OnTheRoadAgain2015 set list. http://t.co/10uElLq4bl RT @NiallOfficial: Back in London for the ball tomorrow !\nCardiff was quality tonight !\nCan't wait to sleep RT @Louis_Tomlinson: Was soooooooooo fun tonight !! Thanks to everyone that came !! Niall's ready, Cardiff! Are you? @ Millennium Stadium https://t.co/6TctvBvfMx US Fans! Enter to win the Honda Civic designed by 1D: http://t.co/gtLuLySZmm NoPurNec Rules: http://t.co/QJ3ts91cYw #HondaCivicTour #ad US Fans! Check out the @Honda Civic that 1D customized and signed for 2015 #HondaCivicTour! #ad http://t.co/wD99dWGDon Who's coming down to see #1DatCapitalSTB tomorrow? The guys will be opening the show at 3pm BST. See you all there. http://t.co/oGtIu9neIm RT @NiallOfficial: Still can't believe we are playing the millennium stadium tonight ... One of the best in the world especially for the ru… RT @Louis_Tomlinson: Literally can't wait for tonight !!!!! Seems like ages ago since we've been on the road !! It's almost time for #OnTheRoadAgain2015 to kick off again in Cardiff. Grab your tour merch! http://t.co/xMyx3CHtmG http://t.co/PuJR8uXFfz RT @NiallOfficial: Looking forward to seeing you all ! missed seeing you all. RT @NiallOfficial: Bedtime! Up early to go to Cardiff. Can't wait , we were talking about it in rehearsals yesterday, been ages since we've… The second leg of #OnTheRoadAgain2015 is almost upon us! http://t.co/lM731sSRTO RT @Harry_Styles: Getting back on the road tomorrow. Can't wait to see all of you in Cardiff. All the love Guess you're all listening too... https://t.co/GXYbqkYfar \"Love is never ever simple\" - Who can guess what we're listening to today? https://t.co/dBE6auBcmY RT @Louis_Tomlinson: Can't wait to get back on the road again ! US Fans! Use the promo code “1DCIVIC” to buy 4 #HondaCivicTour tix for the price of 2* now through June 4 #ad http://t.co/djDssy14MR Send us your OnTheRoadAgain2015 fan art for the chance to get it seen by millions using hashtag #IamOnTheRoadAgain. http://t.co/cpnWN3I1jV .@IconaPop will be opening for 1D on the US leg of the #HondaCivicTour On The Road Again! Who’s coming? U.S., big news! One Direction is hitting the road on the #HondaCivicTour soon! http://t.co/pcch1P1tZ3 http://t.co/76BcH02Zi4 #ad Only four more sleeps until #OnTheRoadAgain2015's second leg kicks off in Cardiff! Who's excited? http://t.co/EgZZ9FFkUA No Control vibes today! https://t.co/iplQnRyNwC Who else still can't stop watching the guys on @LateLateShow? #CordensAngels #Team1D http://t.co/SFr5ckkr9r Countdown to the WEEKEND. http://t.co/4x6IpKHeLi RT @NiallOfficial: Listening to some new songs for the next album, get excited! Coz I'm jumpin around the kitchen ! #TBT: Who remembers which video this is? http://t.co/4gzjVXZd7k RT @NiallOfficial: Yes we wanted to freshen it up a little, bring in some songs from FOUR that we like and think will sound good live  http… RT @NiallOfficial: Going to finish a song that I started writing a while ago! Then I'm gona chill for the evening !  https://t.co/jYhyINQ8ph RT @NiallOfficial: Yes and it's staying on, so back off haha  https://t.co/SyUPPKabPX RT @NiallOfficial: Yeh spent a lot of time of the studio, but it's been great ! Looking forward to sharing the new stuff with you guys  htt… RT @NiallOfficial: Playing golf and going to the studio  https://t.co/ZeZkvqJWqc Who else is excited that #OnTheRoadAgain2015 kicks off in Cardiff next month? http://t.co/eVGFLV8Njq How many of these tracks do you know all of the words to? #OnTheRoadAgain2015 http://t.co/hnWLmMlpxj How many of you had your alarms on snooze this AM? http://t.co/oHXJeDTMxi Here's what we're listening to today. #Fireproof http://t.co/0k3duhhjmr Finally, it's the weekend! © One Direction/Calvin Aurand http://t.co/sv7z1GS5eG One Direction officially have the best fans ever. Thanks to everyone who voted in @4Music’s ‘Last Fan Standing’. #4MusicLFS 😎 Wanna be first in the know with all of the latest One Direction news? Click here. http://t.co/nLP1DPfMak http://t.co/i8ZjXd4FRN USA! The guys have a favour to ask about #RedNose Day. Please take the time to watch this.\nhttps://t.co/pepqHECHTK Why not take a listen to which tracks Niall was loving on the #OnTheRoadAgain2015 tour bus? http://t.co/4XwAh7H322 http://t.co/DZEXAHc8Sr That feeling when you know that One Direction have the best fans ever! http://t.co/jvTR9zHwIQ Check the guys out chatting on the #BBMA red carpet on Sunday night ahead of their big wins! https://t.co/lxKugzlkQt Wanna find out how to get your art potentially seen by millions?  http://t.co/t70ydEBqik #IAmOnTheRoadAgain http://t.co/P2VurlhmUm RT @NiallOfficial: thank you so much for winning those awards for us, we love you so much, we had such a great time at the awards and a sic… The guys can’t wait to be a part of @RedNoseDayUS! Watch and donate May 21 at 8/7c on @NBC. #RedNose http://t.co/4bbeGMOGVj 👏 Congratulations to the guys on winning big at last night’s #BBMAs! How many of you tuned in? http://t.co/d2eOpb4QVo RT @Harry_Styles: Thank you to the @OfficialBBMAs for having us tonight. We wouldn't have won without everyone who supports us. Thank you .x RT @Louis_Tomlinson: Massive thank you again to @OfficialBBMAs ! And of course our incredible fans for making tonight so special for us ! RT @OfficialBBMAs: MAKE SOME NOISE DIRECTIONERS! \n\nTHE GUYS ARE ON @ABCNetwork NOW! \n\n@onedirection present Top Radio Song http://t.co/vv1i… RT @OfficialBBMAs: GIANT group hug and congrats to @onedirection for scoring Top Group/DUO at the #BBMAs! ✨👏 http://t.co/ucJeuH7Ol7 USA! Here's 1D on the @OfficialBBMAs red carpet. Tune into @ABCNetwork now for the #BBMAs http://t.co/H5twR7UY1a RT @NiallOfficial: Vegas ! #BBMAs , gona be sick USA! 1D will be presenting an award tonight at the @OfficialBBMAs! Tune into @ABCNetwork at 8pm. #BBMAs http://t.co/esRhHTq76w RT @Louis_Tomlinson: Big day and big night tonight ! VEGAS !!!!! RT @Louis_Tomlinson: You guys have been amazing with all this ! Been following it all and very proud ! #ProjectNoControl Tell us which One Direction videos you love watching the most. Choose your favourite here. \nhttps://t.co/LKWYNZUM3C Another look at the guys on The @LateLateShow with @JKCorden..... have you seen their dodgeball skills? http://t.co/sioi7ZGKYL The guys were on The Late Late Show with James Corden last night and played a little bit of dodgeball... https://t.co/ytAzFnUN8C RT @Louis_Tomlinson: Loved doing the @latelateshow ! What a great show!Congrats to @JKCorden and @benwinston for making such a great show!D… #TBT #OnTheRoadAgain2015, Bangkok. Caption this. © One Direction/Calvin Aurand http://t.co/0QF7i5eOMr Not long left until #OnTheRoadAgain2015 kicks off again in Cardiff! Who's coming along to the second leg of the tour? http://t.co/Sp2nOADtUd RT @Louis_Tomlinson: This is soooo incredible guys ! Another example of how good you are to us !!  https://t.co/63w6sjMBNo A second earthquake has hit #Nepal. Donate now to @savechildrenuk and help save lives http://t.co/cT24yklxQs RT if you're coming to see #1DatCapitalSTB? http://t.co/xwvefVXNQM Want tickets to see the band live in Cardiff? Today's your last chance to register via @Twickets! Find out more here http://t.co/xiQ4uxqZWZ Getting excited for #OnTheRoadAgain2015? Why not check out what Louis listened to during the first leg of the tour.\nhttp://t.co/2xjJFFapPr The countdown continues... 27 more sleeps until the #OnTheRoadAgain2015 tour kicks off in Cardiff with @McBusted! http://t.co/oZeaw88AYE Which track do you think Louis is singing in this Dubai #throwback?  © One Direction/Calvin Aurand http://t.co/vzuQaoFVNc USA! 1D are presenting an award at the @OfficialBBMAs on May 17. Who's going to tune in? #BBMAs The band are in the studio recording, what do you want to hear on album no. 5? © One Direction/Calvin Aurand http://t.co/sKpgGPKDPJ RT @Louis_Tomlinson: Our fans support really has been a different class ! Huge love to you guys !! Getting excited for #OnTheRoadAgain2015? Don't forget to show us your #1DCreate tour pics! http://t.co/xGFR7KBWx4 UK! The guys are releasing more tickets for the Cardiff dates using @Twickets. To find out more, check out http://t.co/xiQ4ux9oyp .@livenation are celebrating the 1st ever National Concert Day! Go out &amp; see a 1D concert this summer http://t.co/yizD6g6Oz8  #SummerTours15 Which @OneDirection tracks are you guys listening to right now? http://t.co/ZLhE8CsCl9 RT @people: EXCLUSIVE: @OneDirection will appear on The Late Late Show with James Corden http://t.co/MFRXjPMLSX http://t.co/ughWNJaRGP May the 4th be with you. © One Direction/Calvin Aurand http://t.co/VqX0rVuJY6 Not long until the #OnTheRoadAgain2015 tour kicks off again in Cardiff with @McBusted! http://t.co/oZeaw88AYE Oh hey Liam. What's up? © One Direction/Calvin Aurand http://t.co/u3bkP7ASwQ Keep on shufflin'. http://t.co/qQxW0ZhQEF RT @Louis_Tomlinson: Another day of writing today , really working hard on this next album . Hope you lot love it !! Don't forget to support @trekstock. Not only is it a great cause but there are some amazing prizes to be won! http://t.co/drcqPpsaWa 1st leg of #OnTheRoadAgain2015 memories! How many phones can you see in the background? © One Direction/Calvin Aurand http://t.co/nxQTrz5WPO #Throwback to the Dubai show #OnTheRoadAgain2015 © One Direction/Calvin Aurand http://t.co/ZiDuROE2aK The guys have just been announced as the first act for the @CapitalOfficial Summertime Ball! http://t.co/mtveuuHalg USA! @RadioDisney is giving away a whole row of tickets to #OnTheRoadAgain2015! Enter on the Radio Disney app! To help those affected by the devastating earthquake in Nepal text: DONATE5 to 70008 and give £5. Thank you #NepalEarthquake @savechildrenuk RT @Real_Liam_Payne: Tune in to @CapitalOfficial Breakfast on Monday. I'll be chatting with Lisa &amp; Dave about some big news for fans! Who’s excited for the next leg of #OnTheRoadAgain2015 © One Direction/Calvin Aurand http://t.co/jfEn17Hm28 Have you headed over to the band's @Spotify page recently? What’s your favourite playlist? http://t.co/hiX4TEXF23 It's true, @McBusted are special guests in Cardiff on 5th &amp; 6th June! To get tickets, head to http://t.co/yizD6g6Oz8 .  #1DCardiff Any guesses who will be joining the guys for their Cardiff shows? Watch this clip to find out #1DCardiff\nhttps://t.co/XQS0LmTPmZ It’s Saturday! What is everyone up to? © One Direction/Calvin Aurand http://t.co/ueFqj0vVBE #ThrowbackThursday @OneDirection in Dubai! #OnTheRoadAgain2015 © One Direction/Calvin Aurand http://t.co/0Yu5vW5yPm RT @Real_Liam_Payne: Great to be working w/ @trekstock on an incredible charity event! Get involved &amp; win amazing prizes http://t.co/JtpgMe… Reliving some of our favourite bits from the Night Changes video! http://t.co/F2iSrbsAF1 RT @Louis_Tomlinson: Another super productive day today ! RT @Real_Liam_Payne: Huge day of writing so excited the team never stop! RT @Real_Liam_Payne: 1st day writing the album it's gunna be a great day! The guys are looking forward to the next leg of #OnTheRoadAgain2015! What's your top track to hear them sing live? http://t.co/geSfyLaSNR RT @Harry_Styles: It's been five years. Thank you for all your support so far. Isn't it lovely. H Who's ready for the weekend? http://t.co/Jyvzd0lYfj Can you guess where in the world this was? http://t.co/szwET7PkTS .@OneDirection have been nominated in FOUR categories at this year’s @OfficialBBMAs! #BBMAs #1DBBMAs http://t.co/BhfqEpCNDz A massive thanks to everyone who came out to the first leg of #OnTheRoadAgain2015! What was your fave moment? http://t.co/ZDfrrCxZRS RT @NiallOfficial: Well that was an eventful night ! thank you all so much for coming ! It was fun! See Ya soon! Bedtime for me Dubai, the guys are back in town! Who’s ready for tonight? http://t.co/k6ul0XyXqq RT @Harry_Styles: Looking forward to our show in Dubai. \nSee you soon. H RT @NiallOfficial: Cape Town tonight ! What a beautiful city from what I can see from the hotel ! Can't wait for the show ! Buzzin RT @Louis_Tomlinson: Really looking forward to the show !! Cape Town, the countdown is on! http://t.co/yxbPBHWTXV Are you ready to do it all again  tonight Johannesburg? #OnTheRoadAgain2015 http://t.co/9mEdnBKYjK 1D took home the @NickelodeonTV #KCA for Favorite Music Group! A big thank you for voting everyone! Johannesburg, can you believe it's almost time? #OnTheRoadAgain2015 http://t.co/AJAOezrWIB One Direction statement https://t.co/9QQazPmDV2 Sing it Niall! http://t.co/sBQAduseMP RT @YouTube: #YTMA Fact: You've watched over a millennium's worth of @onedirection's \"You &amp; I.\" http://t.co/Otp1wOIrC9 RT @NiallOfficial: Manila night two ! Let's go ! RT @Harry_Styles: Manila, we were amazed by you last night. Hope tonight is more of the same. H Manila- it's time for round 2! #OnTheRoadAgain2015 http://t.co/wVFx6lEvfM RT @Real_Liam_Payne: Are u ready Manila woooooo🔥🔥 Manila are you ready? #OnTheRoadAgain2015 http://t.co/yhX4zB6Ckt US Fans! Last chance to vote for the guys at the #iHeartAwards! Click to cast your votes: http://t.co/tm5bhPZcuU #BestFanArmy @iHeartRadio RT @Harry_Styles: Manila, can't wait for the shows. Looking forward to seeing you there. All the love Just a little video that won a BRIT Award.....Couldn't have done it without you guys! http://t.co/CLytmzQmsK Here's another 360 degree view of life on  #OnTheRoadAgain2015 tour! Image taken using a Ricoh Theta camera. http://t.co/yfya2TqQMj RT @Harry_Styles: Thank you for tonight Hong Kong. You were amazing. Thanks for having us. Hope you had fun .x Hong Kong, it's time! #OnTheRoadAgain2015 http://t.co/bqCBIsPT7V It's St Patrick's Day! To celebrate here's a few of @NiallOfficial favourite tracks #NiallSpotifyPlaylist https://t.co/ObfXZJY7Ss He shoot's! He misses... #NightChangesOuttakes http://t.co/yt2j5xXcsb 17% off everything in the 1D merch store to celebrate St Patrick's Day? Yes please! http://t.co/HlwT5zZZuE http://t.co/f6TWVKQUI5 Thailand you were great! Hong Kong you're up next... http://t.co/Exl5NzRUP3 Can't. Stop. Spinning. #NightChangesOuttakes http://t.co/tl60pnOnje Bangkok it's your turn! http://t.co/JiIt3bo7bO It's a Steal My Girl kind of day.....https://t.co/M6yl8Ewfvn UK Fans - Tune in to @comicrelief tonight at 7pm on @BBCOne to see the ultimate tribute band, No Direction! http://t.co/ZMnfTM0of5 The guys have been nominated for a @NickelodeonUK Kids' Choice Award! Vote for them using #KCA #Vote1DUK or http://t.co/wUZjf9g803 1D are nominated in the @RadioDisney Music Awards! Vote here http://t.co/STYiRsu9Ts http://t.co/L9yvo96ks4 Help provide clean water to kids on #WorldWater Day via #WaterNow to benefit @WorldVisionUSA Water. http://t.co/irMcHotV8u UK fans - @rednoseday news: there are tribute bands, and then there is No Direction! Friday on @BBCOne  from 7pm. http://t.co/QH9jVfbC3r A 360 degree view of the #OnTheRoadAgain2015 tour. Image taken using a Ricoh Theta. https://t.co/xltZUY5KRU Remember to keep showing your #1DCreate tour pics. The guys would love to see them! RT @NiallOfficial: Singapore ! Let's go ! This is going to be fun ! First time there too , love visiting new countries RT @Harry_Styles: Looking forward to the show in Singapore.. Can't wait to see you all. All the love. H The guys are nominated in the #iHeartAwards for #BestFanArmy. Help prove that you are by voting here! http://t.co/lQCqtWygpg Now you see me...now you don't! #NightChangesOuttakes http://t.co/mdb1pGRWgW Here's a few tunes @Louis_Tomlinson has chosen for you....... #LouisSpotifyPlaylist http://t.co/hNMHaZSfZ0 Yes to this Jesyka! #1DCreate http://t.co/en4eVAvrOE Welcome to the weekend! http://t.co/XczEPPkpVN Throwin' back to the tour so far... http://t.co/r2vLiU3pgm See #OnTheRoadAgain2015 from Liam’s perspective over on the One Direction Google + page (Ricoh Theta camera used) http://t.co/KoQEwbcUvB This time last week you helped the guys win a BRIT- they couldn’t have won it without you! http://t.co/zQdVi2GHBn Don't forget to show us your #1DCreate tour pics! RT @NiallOfficial: Japan it was a blast ! Had a great time yet again in your country ! Thanks for having us! RT @Real_Liam_Payne: Here's a stage pic to say thanks Australia and japan http://t.co/hn8jO698aq #OnTheRoadAgain2015 Japan vibes... http://t.co/VoU0jp6Vfi Wanna get the latest #OnTheRoadAgain1D updates? Sign up here: http://t.co/nLP1DPfMak\n© One Direction/Calvin Aurand http://t.co/MQ6NtlgsuN You asked: What FOUR new cities are you most excited to visit on the On The Road Again tour? #1DOrlandoQnA  http://t.co/8K0y2VUR4w Seriously. Pigeons! #NightChangesOuttakes http://t.co/yW7qw4tyo8 RT @Real_Liam_Payne: Great show Tokyo... Hey that rhymes 😌 Hello Tokyo! (via @Harry_Styles) http://t.co/0WrbQe2zB6 RT @NiallOfficial: Tokyo ! 🇯🇵 good to be back ! Can't wait for the gig later ! See you all soon RT @zaynmalik: Woohoo.... :D can't thank you enough ! You amazing people ... Love ya's RT @Louis_Tomlinson: Thank youuuuuu to everybody who voted for us at The Brits :) A BIG thanks to the director of the #YouAndI video @benwinston #BRITs2015 #BritishVideo You guys are INCREDIBLE. You just won the guys the @BRITAwards BRITISH VIDEO 2015. Give yourselves a huge pat on the back :) RT @BRITAwards: The @onedirection boys have a special message for everyone who voted for them to win British Video at #BRITs2015. 👍👍\nhttps:… RT @BRITAwards: You voted and the award for British Video goes to @onedirection! #BRITs2015 http://t.co/seZX4iGyhw Voting for British video is now closed for #BRITs2015! Thanks to everyone who's voted. Fingers crossed for the guys! Only one vote person is allowed so we need EVERYONE to vote #ONEDIRECTIONBRIT http://t.co/4U9gNaTFT9 Niall and Liam have something to say......... #ONEDIRECTIONBRIT http://t.co/vbMRzo3xA4 RT @zaynmalik: #ONEDIRECTIONBRIT thank you if you’re tweeting this  :-) x Has your nan voted? #ONEDIRECTIONBRIT http://t.co/RXijKI2z9m Have your friends voted? #ONEDIRECTIONBRIT http://t.co/mHVHE0ILbM"}