{"tweets": "Mucha fuerza para la semana!! A trabajar con alegria!! Vamos!! https://t.co/I9fJxu67p4 Qué bien lo vamos a pasar en las batallas!!! No se esperan muchos momentos emocionantes y muchas risas. https://t.co/Dc5cxo1FAT Gracias por compartir tu historia. En realidad la música en general es una medicina maravillosa. https://t.co/Nn8XmgWy8z Solo me queda levantarme y aplaudir, a mis grandes compañeros @vanesamartin_ @rosarioficial y @MelendiOficial , un orgullo y un placer compartir estos  momentos con ellos. Y aplaudir a todos los niños que han pasado por algo tan difícil como las audiciones a ciegas! Grandes todos https://t.co/imfB6xGruw Y así terminan las Audiciones a Ciegas! https://t.co/OqvSZGj511 Lucía le pone la guinda al #TeamBisbal!! Alegría de que estés en él! #LaVozKids12 https://t.co/4ah5zPp6Kz Pedazo de voz lírica se viene al #EquipoBisbal! Alicia qué bien lo pasaremos! #LaVozKids12 https://t.co/7GuTzapwEP Gracias @vanesamartin_ !! Disfruta el programa tranquila y relajada! https://t.co/rw9kPUY7Xf Qué ganas de trabajar con Maksym!! Ya está en el #TeamBisbal! #LaVozKids12 https://t.co/hbKaIKvukU Qué voces harán que @rosarioficial y yo nos giremos? #LaVozKids12 https://t.co/DbynD0S2RA Esta noche cerramos el #TeamBisbal, quién se vendrá con nosotros? La respuesta en unas horas...#LaVozKids12 https://t.co/8i6o0qS4Gw 18 ańos a vuestro lado!!!!! https://t.co/LGzJesAxam Esos momentos tan especiales antes de escuchar tanto talento! #LaVozKids11 https://t.co/JmJJUFyjqB Qué bien me lo paso en #LaVozKids11! 😂 https://t.co/7QAQvyzqNR Giada bienvenida al #TeamBisbal!! #LaVozKids11 https://t.co/hZ3wZ60sRs En unos minutos arrancamos @MelendiOficial ! #LaVozKids11 https://t.co/7Xu93ReXAv RT @grupoboomerang: En sus puestos🏃🏃 ¿Preparados para #LaVozKids11? @davidbisbal @vanesamartin_ @rosarioficial @MelendiOficial @evagonzalez… Preparados para #LaVozKids11?? https://t.co/6PbiLOX19M El silencio solo forma parte de un buen plan!! Os quiero. https://t.co/FqD0YFvC4X Qué felicidad!!! Con muchas ganas de cantarla el próximo mes de diciembre!!! https://t.co/wcLFYoC6RW Que paséis un maravilloso fin de semana. https://t.co/EEX2PJhaWX RT @TuMedio: El próximo 4 de Diciembre tenemos una cita con el gran David Bisbal (@davidbisbal) en el Movistar Arena (@movistararena).\n\nEnt… RT @BisbalEstereo: Hace 10 años, esta página esta incluida en la #BisbalMagazine 1 de nuestro @davidbisbal https://t.co/9mhBkwXsUt En la gira del 2017 invité a Christian Nodal a que cantara conmigo #probablemente en el WiZink Center de Madrid @wizinkcenter siempre me he sentido identificado con MEXICO y su cultura, por eso cantar con Christian y el mariachi en Espańa fue especial! Se os quiere. #TBThursday https://t.co/juIz2IbUO1 Con muchas ganas de volver a Peru!!!!!! Os quiero! https://t.co/hOgU8NOczl RT @EIncreiblePeru: Ya pueden adquirir sus entradas para ver a nuestro @davidbisbal  #dbtour2019 GIRA 2019 CENTRO DE CONVENCIONES BARRANCO… RT @dbfanclubchile: Descontando los días ¡¡ @davidbisbal \nVuelve a Chile ¡¡ \n@movistararena \nEntradas en @puntoticket https://t.co/QThoPeU3… Bien aquí tenéis una de las sorpresas que os tenía guardadas. Nos vemos #Peru os quiero!!! https://t.co/hxGhVAx627 Madre mía compañera Eva. Gracias por tu cariño, lo mismo siento yo. Formamos un buen equipo. Lo pasamos todos genial y nos respetamos!! Todos los ingredientes positivos de la vida. Besos 😘 https://t.co/Ng3cm9tY7C Os dejo un resumen de como vamos hasta ahora, buenas noches! #LaVozKids10 https://t.co/veGsjckTe7 Sí, tú!! 😂😂 #LaVozKids10 https://t.co/wQuCw9ok25 Muy afortunado, me han elegido!! #LaVozKids10 https://t.co/icjiM5wVfq Os avisé, este programa nos veníamos arriba! #LaVozKids10 https://t.co/crK8sMj3Kl Está será una noche de las de ponernos de pie! #LaVozKids10 https://t.co/LNAFaK0DxR Esta noche paso lista en #LaVozKids10!! https://t.co/D84YgCozW1 Vídeo capitulo Bilbao!!!!!!! Os quiero! https://t.co/NqqJGJc04a buenos días!!!☀️ https://t.co/ejWkT5LLCW Ya os dije que sería una noche de sensaciones fuertes, mañana más! A descansar! #LaVozKids9 https://t.co/pMAcYuQgeG Qué bien me lo paso yo con estos compis! @MelendiOficial @vanesamartin_ @rosarioficial #LaVozKids9 https://t.co/KCMYmzyHEH RT @grupoboomerang: En el último momento @davidbisbal se ha dado la vuelta con Lucía. ¡Felicidades! 👏👏 #LaVozKids9 @LaVozKids https://t.co/… Ese momento en que te giras y le pones cara a esa voz que te ha emocionado...#LaVozKids9 https://t.co/jgxINoIRn9 Lucía no podía dejarte escapar!! Bienvenida al #TeamBisbal! #LaVozKids9 https://t.co/98Dque1Vg5 Bienvenida paisana Ana al #TeamBisbal! 👏👏 https://t.co/lxxie7r1p5 RT @grupoboomerang: Los coaches ya están preparados, ¿y vosotros? Todos con #LaVozKids9 👏👏 @davidbisbal @MelendiOficial @rosarioficial @van… A por otra noche a tope en #LaVozKids9!! https://t.co/ci9mFMp9CM Os dejo un adelanto de una noche muy potente! Os espero a todos!! #LaVozKids9 https://t.co/XIHvdCep0U Nos volveremos a ver!! Se os quiere! Siempre contigo! Mi gente https://t.co/9VXIB4cyri #Bilbao!!! Siempre contigo!!! https://t.co/5NEZY8UeEG Después del concierto, ya más tranquilo, os mando saludos a todos y agradecer todo el cariño que me brindáis diariamente. Seguimos con muchas más aventuras musicales y sorpresas que quedan por desvelar! Os quiero. https://t.co/kZndmLNmsO @Yoa_naiala Pistas no hay muchas, las únicas que hay son las de la gente que me pide fotos y las sube desvelando algunos detalles que vienen en el futuro ja ja ja. En esta ocasión, me encontraba grabando un videoclip de una de mis canciones del próximo disco. Una canción en solitario. Visitando a mi amigo Eduardo anitua en su Vitoria, antes de llegar a Bilbao para dar mi concierto de esta noche. Qué belleza de otoño estamos viviendo. https://t.co/8yKig3T3CQ https://t.co/0M9jqxH5J6 Después de mi concierto en Bilbao, me quedará el concierto de Chile y el de Argentina. Y tengo unas ganas enormes también de compartir con todos vosotros en el sur de Latinoamérica. Pronto empezare a hacer entrevistas y os enteraréis de todos los detalles del disco y gira nueva. https://t.co/4F5xGq9Mv0 Muy buenos días mi gente, iré a Bilbao para daros todo mi cariño y cantaros no solamente con mi garganta sino también con todo mi corazón, como siempre trato de hacer. https://t.co/zYH9ziTiyi Atención, he podido encontrar una foto grabando en el estudio en Tokio, mi versión de Oye el Bum en japonés!!! Tenía inmortalizado este momento y ahora lo comparto con vosotros. #Tbt https://t.co/TKbolLTUVF https://t.co/C2SoGieTsh Gracias amigos por esta fantástica entrevista!!! Nos vemos este sábado en Bilbao!!! Os quiero!!! https://t.co/v9kwkPhIOo Preparado para mi último concierto del año en nuestra tierra!!!! Y lo cierro  en Bilbao!!!! Qué ganas tengo!!! https://t.co/8Qsrys3nKO Ja ja ja ja ja ja 😂 me encanta!!!!!! https://t.co/KE34oonvQy Buenas noches mi gente! Vaya semana dura que llevamos! Pero todo tiene su recompensa! Aquí os dejo #AbrireLaPuerta para que nos relajemos un poco. https://t.co/ZZExGS70Pu https://t.co/o0erqdmsiv Buenos días a todos los papás, mamás y niños. Que os vaya genial en el colegio. hoy será un buen día. https://t.co/g1PYFsynAU Agradecer a mis compañeros @rosarioficial @MelendiOficial @vanesamartin_ por una noche genial! #LaVozKids8 https://t.co/3fZlhhfnLz Qué complicada es la duda de si girarme o no...\n#LaVozKids8 https://t.co/nx7lxWKYfI .@rosarioficial qué bueno todo lo que nos queda esta noche!! #LaVozKids8 https://t.co/qcJZnXK1z2 Que grande tener a María en el #TeamBisbal!! Pedazo de fichaje! #LaVozKids8 https://t.co/WA8LF3ZtvH Esta noche #LaVozKids8 viene que arde! Imprescindible el abanico!! 🔥Vamos! https://t.co/8X1P4JnsQh Amigos!!! Me encanta esta iniciativa!!! Que os parece!!!? #plasticisthemonster https://t.co/3C1GoqDoBZ @AquaLungDivers https://t.co/DNNP39MqlR Buenos días, comparto con vosotros este vídeo de unas Serviolas que grabé en Cabo de palos, para que nos relajemos en este día tan maravilloso. vuestro hijo de mar. https://t.co/w20rt5aq6q RT @LaVozKids: Termina otra noche EMOCIONANTE de audiciones en #LaVozKids y así han quedado los equipos de nuestros coaches  😱  GRACIAS POR… Tras una noche de emociones en #LaVozKids7 me relajo y me preparo para mañana!! Buenas noches!! https://t.co/IDnkiRe3sa Adriana a por ti voy corriendo a darte la bienvenida al #TeamBisbal!! #LaVozKids7 https://t.co/egL6XAOlHy Hay artistazos que cantan temas me dan ganas de dar palmas! Qué arte! #LaVozKids7 https://t.co/b5ujE173W7 Arrancamos!! Vamos! #LaVozKids7 https://t.co/QoD0Hs28Rp Preparados?? Esta noche promete ser la bomba!! #LaVozKids7 https://t.co/NulnqAzdgb Fuerza para toda la semana a todos!!!!!! Os quiero!!! Os traigo unas noticias... https://t.co/muUTTtunvd RT @CADENA100: 💣 ¡BOMBAZO! @DavidBisbal desvela cuándo saldrá su nuevo álbum y habla de la gira que llegará con él: \"A principios de año te… Mirad qué maravilloso Video capítulo tenemos para vosotros de nuestro concierto de Murcia.\n\nhttps://t.co/5QveM9hUJa aquí lo puedes ver entero. https://t.co/BnvTvvpzuz No me lo puedo creer, así está la playa en Almería hoy 6 de octubre!!!! https://t.co/xH4sJ699ps Emoción tan grande ver la canción que canté junto a mi amigo Juan Magan en lo más alto de esta maravillosa radio. Compartir lista con el resto de mis compañeros artistas es un honor. https://t.co/64ZFdiEZcN Éstas son las cosas que siempre me gusta ver antes de un concierto. El cariño de la gente!!! Gracias a este simpático bisbalillo y viva Murcia. Os quiero feliz sábado. https://t.co/xQ5fe6FL32 https://t.co/JaUXE8YHsE RT @bisbalpress: David Bisbal: «El verdadero éxito es que el público siga a tu lado» https://t.co/en8Vsl6o9f vía @laverdad_es Te deseo todo lo mejor con #Caballero un abrazo de hermano!!!! Se te quiere @alexoficial https://t.co/HLkONhrS3w Muy pronto!!!!!... más aquí.. https://t.co/jq6tk0dFJm https://t.co/W0B8h8rVZG Murcia nos vamos a divertir, muchas gracias por hacerme tan feliz!! https://t.co/JQVHNmETi5 Gracias amigos! Os espero en el penúltimo de la gira!! #Murcia que ganas de concierto. https://t.co/84NboMRQIh Espero que os guste esta entrevista!!!! https://t.co/72HrODcQR1 Me encanta que nos podais seguir en este sueño tan bonito que es @lavozkids https://t.co/HWRijkUGBg @90gcj @MelendiOficial @vanesamartin_ @rosarioficial ja ja ja ja ja ja ja ja ja ja ja ja , lo que hace la música. Qué gracioso el video. @merydb_mery @LaVozKids Madre mia, no te imaginas el calor que pasé... ja ja ja ja ja ja Ya estoy preparado para #LaVozKids6 con mi chaqueta de Jackson Pollock @lavozkids https://t.co/SjIjzzN8pr 1000 gracias por el piropo compañeros https://t.co/7vybvPWhNd Gracias por este día!!! Mańana más!!! Este es el gran público de ⁦@LaVozKids⁩ ⁦@vanesamartin_⁩ ⁦@MelendiOficial⁩ ⁦@rosarioficial⁩ ⁦@evagonzalezf⁩ ⁦@grupoboomerang⁩ https://t.co/3x1ASh5p6H @NoeSalamnca @LaVozKids si es verdad que la voz con el tiempo mejora, pero si no la cuidas, puede empeorar. Es cuestión de elegir que es lo que quieres y saber que nos somos superheroes. @soluna1425 @anamari_db @LaVozKids Están muy ricos los 2 vamos niñas os quiero. @estefaniaaml què hermosura de contestación. @Javiidela @LaVozKids ja ja ja ja ja ja Aquí está la Berza de Almeria!!! Para todos los seguidores que nos siguen a través del canal internacional!! @lavozkids os quiero!!! https://t.co/SEmCvyamDM ja ja ja ja ja ja ja ja ja ja ja jajajaja, de esas berzas que prepara mi madre en Almeria que tiene un buen condimento. Vamos con eso si que te pones fuerte. ja ja ja ja ja ja https://t.co/40CDFXWtJT @rosarioficial @LaVozAntena3 @LaVozKids mil gracias compañera mia, sabes que respeto el framenco con toda mi alma y estoy feliz que Juan Miguel se quede en @lavozkids Juan Miguel se viene para el equipo!!!! Madre mía! Que nińo prodigio! @lavozkids https://t.co/q4NjdAuWqk @NoeSalamnca @LaVozKids habeis escuchado ja ja ja ja ja ja ja ja ja ja ja es que siempre trato de acordarme de lo que he vivido Ya estamos aquí!!! #lavozkids5 ⁦@LaVozKids⁩ quien esta presente!???????? Vamooooooos https://t.co/tRrHs5Dzs7 Siempre hay que estudiar algo que esté fuera de tu alcance! Si no, no mejoramos. Saludos! https://t.co/fT70KN9Jkf Aquel día que pude cantar #Eltriste a tan solo unos metros de ti y de tu familia, supe que ya te llevaría conmigo cerca para siempre en el corazón! No te vas, te quedas para la eternidad. @JoseJoseOficial mi más sentido pésame para los familiares y amigos! La música llora! https://t.co/crXEIRINYx Feliz cumpleaños a estos maravillosos artistas que admiro desde siempre. Os quiero compañeros. https://t.co/BU2t4Gw7v3 Lo más bonito de todo esto es que siempre que te veo siento una grandísima admiración y eso no va a cambiar. Te seguiré por siempre. https://t.co/vDbi1WZyfM Espero que paséis un maravilloso sábado. Cuando quiero desconectar mi mente siempre está en este maravilloso entorno. Pronto volveré a practicar uno de mis deportes favoritos. https://t.co/atNnqWag2p Buenos días mi gente! Cómo admiro aquellas personas que buscan su felicidad, como también aquellas que tienen el poder de crearla! Os quiero! Wuau you can really dance!!! Ja ja ja ja ja ja 😂 que bien lo hemos pasado. @El_Hormiguero @vanesamartin_ @MelendiOficial @rosarioficial https://t.co/6oKtLNBGjC RT @bisbalpress: Ya el programa completo: El Hormiguero con David Bisbal, Rosario, Melendi y Vanesa Martín https://t.co/OeHXGsKxnY @davidbi… Buenas noches a todos!! Mańana nos vemos en @El_Hormiguero con @rosarioficial @MelendiOficial y @vanesamartin_ espero que lo disfrutéis https://t.co/WWVZDDc5TB @MarinaCruzTapia Me gusta ser muy cariñoso con los niños que vienen a participar a @lavozkids con toda su ilusión. Gracias por tu apreciación. @DBCoachFavorito No sabéis  lo que siente estar bloqueado ja ja ja ja ja ja Pasamos lista!!! Quien esta listo para #lavozkids4 @lavozkids ??? Os quiero! https://t.co/UyPG3GUZ8P Para todos los amantes del submarinismo. Os presento esta aventura submarina de varios días que creo que puede ser una grandísima experiencia! Espero que disfrutéis de los fondos marinos de mi tierra Almería! @Aqualung_Spain @Costa_Almeria https://t.co/lD7r9wOS6M Qué bien me lo pasé en Talca, ojalá que volvamos pronto. Os quiero. https://t.co/Aj9p1wdd54 Con muchísimas ganas de cantar una vez más en Chile https://t.co/xUw8Z3WDQa Nos vemos mańana en #Lavozkids4 os queremos! @MelendiOficial @vanesamartin_ @rosarioficial me encanta la voz y mis compañeros también!!! https://t.co/lcjgDCvxMa @rauletGV @LaVozKids Hola Panocho espero que estes bien. Me encanta el nivel del sentimiento que me provoca la voz de Hugo cantando la saeta, y me ha gustado tanto¡ que me he dado la vuelta. Vaya pedazo de actuación de Hugo no??? @lavozkids #LaVozKids3 me encanta el equipazo que estamos formando este año. https://t.co/5AZIRcgpd3 @rychard66342459 @LaVozKids Hola, como está ese Rychard? espero que bien. Yo iba un paso mas adelante. Se que la saeta se canta asi. Lo que hablaba con mis compañeros es acerca de como lo haría cantando otros géneros musicales. Por eso después le pregunté que le gusta cantar. Un saludo. Ja ja ja ja ja ja 😂 siempre me fijo en todos los detalles porque son las conversaciones que normalmente tengo con la más pequeńa de mi casa! Te lo juro! Os quiero! Gracias por el carińo. https://t.co/IqNuPeoO4z @anamari_db al final nos sale ese lado mas familiar, los niños son geniales. @_DaRKo_o Salchichón mas bien, ja ja ja ja ja ja ja @db_barbara @LaVozKids desde el canal internacional se puede ver en todos lados. Que empieza la voz Kids!!! @lavozkids Donde esta mi gente de Latinoamérica????? Os quiero!! #lavozkids3 @lavozkids https://t.co/77n68hlgyY Quien está presente??? #lavozkids3 @lavozkids que ganas de pasarlo muy bien esta noche... https://t.co/Am3AmA1e8m Buenos días a todos! Os deseo una primera semana de cambio de estación maravillosa! Os quiero mi gente. https://t.co/Oc2Kyl45u6 Feliz Domingo!!! Mi gente!! Con muchas ganas de afrontar los conciertos que me quedan este ańo y terminar la grabación del disco nuevo! Cuales son tus proyectos?? https://t.co/W1BJ450Nb3 Feliz cumpleaños mi querido @LucianoPereyra Y felicidades por este trabajo tan bonito con nuestra compañera @Greeicy_rendon que arraséis con !te estás enamorando de mi!!! Os quiero! https://t.co/FhCmFDQGAa En Bilbao terminaré la gira 2019 https://t.co/lm3DObx7kg @crisdb18 @TwitStarViral @CazadorDeTrolls Es un mero, y lo que pasa por detrás un tiburón!!! Que preciosidad de Olivos!! Se nota que ya tienen unos cuantos ańos!!!! https://t.co/9SDDmOOGuf Todo lo que fui es todo lo que soy!!!! https://t.co/ipsGkZPGkL @gutierrezrive Buenos días @paquitacarrill3 Buenos días a todos!! Chile, un país único y maravilloso. Cuánto nos queda por descubrir. me sorprendieron estas fotos que vi esta mañana cuando leía la prensa en mi casa desde España. que disfrutéis de vuestras fiestas patrias. https://t.co/pp3M3KJOeD @dbfanclubchile Felices fiestas patrias para este país que quiero tanto!!! #Chile @bisbalpress Cómo lo vamos a pasar Dios mío!!!!!! @El_Hormiguero @MelendiOficial @vanesamartin_ @rosarioficial @LaVozKids Que canciones cantamos??????? Cual es tu favorita!!!!!? https://t.co/57sqqp1Bfw Habéis visto este Video de cuando fui profesor de canto por un día en un colegio de Madrid? me lo pasé muy bien gracias a los amigos de @LaVozKids https://t.co/VhW7GvWKqZ https://t.co/OYDVlgnijY @DBCoachFavorito Qué tal lo estáis viendo?? https://t.co/qX2j19mxQd @LaVozKids Feliz de tener nuestro último concierto por España en este lugar maravilloso que siempre me ha dado mucha suerte. 🍀👍🏽 https://t.co/D8cWsqdkMV Resulta que el del bloqueo he sido yo!! Pero habéis podido comprobar que no pulsé el botón de bloqueo! Es decir, le di con tanta fuerza al botón principal que un cable se cruzó y me hizo el favor!! Ya que salvador si o si se iba con @rosarioficial https://t.co/l3zk5tYQkr @elalcachofo @LaVozKids ja ja ja ja ja ja ja ja ja ja ja jajajajajajajaja me he partido de risa¡¡¡¡ @Yedjisnarifino Si es que ya lo decía mi madre, que siempre he sido muy nervioso. 😬 Un abrazo fuerte. Siempre será un placer cantar#Lucia Y sobre todo cuando se está tan bien acompañado. @lavozkids https://t.co/zdeYFvLklR @Lau_rober @LaVozKids Gracias amigo¡ suelo pasarlo muy bien y mis compañeros son unas grandes personas. @FormulaTV Asi es amigos, lo pasamos muy bien y disfrutamos estos maravillosos niños prodigio, hay mucho arte en nuestra tierra. Alguien esta viendo el programa desde otros países? @rosarioficial Sabes que te lo perdono todo, buena compañera. JA JA JA JA JA JA JA JA JA qué disfrutes. @SrHazard7 Qué bonito lo que escribes. Un abrazo muy fuerte. @pablo_hz21 @rosarioficial vamos, @rosarioficial me ha bloqueado pero bien bloqueado, ja ja ja ja ja ja Listos??????? @lavozkids qué emoción¡¡¡¡¡ https://t.co/qV9XXb3N0E Espero que tengáis una maravillosa semana. Nosotros lo hacemos de la mejor manera, descubriendo el talento de los niños, nuestro presente y nuestro futuro!! Os quiero mucho! Mirad que equipazo!! @LaVozKids https://t.co/f7SxCftbzj @Silvy_A84 @LaVozKids Buenos días. 😃 Os deseo a todos Un maravilloso día Felicidades a los campeones del mundo. La selección española de basket!!!! Gran partido ante la selección de Argentina que también han hecho un espectáculo de partido!! @BaloncestoESP https://t.co/kQUy3cXqh6 @beguita_300 Muchísimas gracias. Igualmente para todos vosotros. Aquí en España seguimos con las inundaciones espero que la semana que viene se calme un poco todo. Esta actuación fue en Acapulco, México. https://t.co/L8zC5jK9zg @chicuela @alexoficial Lo cierto es que a mí también me gusta muchísimo y cuando la canté en Sevilla me fascinó. Ahora solo falta qué @alexoficial y yo la cantemos en directo. Espero que tengáis un buen fin de semana todos. La semana que viene volveremos de nuevo al estudio para seguir dándole vida al disco. https://t.co/CAybJzQHbp Nada más que estar nominado con estos grandes compañeros es para mí un honor. Gracias por haber apoyado todas mis canciones! especialmente las del último periodo!  #APartirDeHoy #perdon y #besame https://t.co/Oc67x77hQa @rosario_fan3 @rosarioficial @vanesamartin @MelendiOficial Vais a alucinar con la nueva temporada de la voz Kids @LaVozAntena3 Es un honor recibir esta maravillosa nominación entre tanto buen compañero. 1000 gracias amigos de @Los40 https://t.co/EseHbWLlhW Las ganas de volver a cantar en Chile después del festival de Viña del Mar son inmensas. Ojalá que pase el tiempo rápido y llegue diciembre. https://t.co/Uki8z9QAwW Se nos ha ido al cielo un Maestro! Una voz única! Muy apenados con la partida de nuestro #CamiloSesto https://t.co/dYRypAPUGT Pues en España los dos últimos conciertos que me quedan serán los de Murcia el día 4 de octubre y el 12 de octubre en Bilbao. https://t.co/vbRaaHzPyu RT @canalfiesta: .@davidbisbal nos lo cuenta todo... 😍 ¡No te pierdas la entrevista que le ha hecho @dominguezja en @canalfiesta! Aquí la t… Me muero de ganas de volver a Chile https://t.co/QB2CNKLWbv RT @bisbalpress: ESCUCHA la entrevista a @davidbisbal, hoy, en Canal Fiesta  https://t.co/oOwi15j5pR @Helleni78 @alexoficial Me da muchísima felicidad que os haya gustado abriré la puerta en directo. Después de cantar en el festival de viña del mar tenía muchas ganas de volver a Chile. Muchas gracias y nos vemos pronto. https://t.co/W0sQmGsguf Espectacular mi gente!!! Vaya pedazo de público!!!! Os quiero Mairena de Aljarafe. Quien ha cantado #AbrireLaPuerta ???? https://t.co/2hrGhlTxpB Con muchísimas ganas de compartir con mi gente de Chile este Tour 2019. Amigos de Santiago, nos vemos el 4 de Diciembre en el Movistar Arena!!\nhttps://t.co/rVzdV63XWW https://t.co/NGj8yo8SkC Qué bien me lo pasé ayer en Ejea de los caballeros en https://t.co/k4Baer9CYuñana viajaremos a Sevilla y tendremos otra fiesta. https://t.co/B69Qj1slbf Os pasaré alguna otra foto más. https://t.co/PTNtjxBNcm Eso siempre compañeros. A mí lo que me gusta es divertirme y pasármelo muy bien con todos vosotros https://t.co/ooPMr5mgxm Celebrando con mi hermano @alexoficial #AbrireLaPuerta https://t.co/ZZExGS70Pu https://t.co/Efi5F3DY0N Muy buenos días a todos!!!! #AbrireLaPuerta hasta que quieras volver, así pase un siglo, yo te esperaré!!https://t.co/Cvrf4wdXs3 @SpotifyLatino https://t.co/hwUvsWcW79 Espero que os guste el detrás de cámaras de la canción Abriré la puerta!!! @alexoficial https://t.co/qxTOoIFd8p RT @SpotifySpain: El paraíso existe, sí, y esta es la prueba: @davidbisbal y @alexoficial juntos en una canción.\nEscucha “Abriré la puerta”… RT @seitrack: ¡Ve ya a escuchar esta gran canción! #AbriréLaPuerta de @davidbisbal y @alexoficial ya está disponible en plataformas digital… @antoniobanderas @mecica2 @alexoficial Muchas gracias Antońico!! Con muchas ganas de verte ojalá que pronto sea así!!! @LAURAGII @alexoficial Gracias Laurilla!! RT @YouTubeMexico: Estrenos de Viernes y lo más 🔥 está en nuestro playlist #RELEASED para que acompañes tu fin de semana. En portada @alexo… RT @alexoficial: Behind the Scenes de #AbriréLaPuerta con mi hermano @davidbisbal ! ✌🏻😎🔥 https://t.co/50r91hzOvY @chicuela @aureobaqueiro @alexoficial Se llama David Cavazos! Besos 😘 Ayer lo primero que hice cuando llegue a casa después del viaje tan duro , fue abrazar a mis hijos. La noticia de la hija de Luis Enrique me destrozó el corazón. Aquí en casa estamos todos muy afectados, le mandamos un abrazo y un beso a todos los familiares y amigos. Ya estamos aquí con #AbrireLaPuerta @alexoficial https://t.co/N8eFQK899R https://t.co/pAqpf95fqL RT @alexoficial: Por los siete mares, hermano! #AbriréLaPuerta https://t.co/yocpQHIo7O La primera fase!!! #AbrireLaPuerta https://t.co/boIyTkmwIx Viendo caer la lluvia...#AbriréLaPuerta https://t.co/RthoaKIWNR RT @UMusicMexico: Abriré La Puerta : @davidbisbal + @alexoficial : 30 de agosto 🔜 https://t.co/jUFKxPjM2r Siempre es un honor cantar en el festival de viña del mar. Ojalá que no pase mucho tiempo para volver. https://t.co/GjpGi5slOw Todos tenemos sueños, todos queremos pertenecer, todos somos iguales.  @AlejandroSanz #wealldream https://t.co/quSQL6FWQF besos. https://t.co/a5TOobRlMz @bisbalpress @alexoficial Os dije que tenia una sorpresa. Lo dejè todo anoche. Volveremos a vernos. PINEDA. https://t.co/kh9ppafCJf Preparaos porque...#AbriréLaPuerta con @alexoficial ! https://t.co/NIVIaC81jG Cuando salgo a buscar sueños fuera de mi tierra no me duele, porque el sueño mas grande es el regreso. https://t.co/k27hyB3GM7 Mitad de mora y Cristiana, tienes la sangre “cruza” es de una tierra lejana que se refleja en el mar.Almeria, Feria 2019. https://t.co/Yv3rPru5RW Què bonito es volver a cantar en la feria de Almeria, mirar el rostro de mi gente tan cerca. https://t.co/E16J2Ld2kW No te puedes imaginar las ganas que tengo de que llegue el concierto de la feria de Almería https://t.co/431wL5keXC Plástico metido en bolsas de plástico. Y digo yo, ya que lo has metido todo en una bolsa de plástico después de pasar un día maravilloso en la playa, o pescando. Por qué no te llevas la basura y la tiras al contenedor? si hay un poco de oleaje, esa bolsa llega al mar seguro. https://t.co/VNQPl30HR1 Què ganas tengo de volver a cantar en la feria de mi tierra. Muchos besos. https://t.co/tb6vdbpoLl RT @musicagran: @davidbisbal próxima parada #RecintoDeConciertosDeVerano #Almeria https://t.co/DoQSayAEI9 mientras escuchamos #Besame https… Estas esperando el capítulo de @CapRoigFestival ? https://t.co/kKLA74h1xi Todavía recordando la maravillosa gala de @StarliteGala mañana cantamos en otro gran festival @CapRoigFestival muy feliz. Además la feria de #ALMERIA esta muy cerca, qué días tan bonitos nos esperan. https://t.co/oCkpGCa7sM @PastoraSoler @francis_vinolo Qué bonito lo has dicho, os mandamos muchos besos desde nuestra casa. Os queremos muchísimo RT @UniversalSpain: Verano, playa y #Bésame de @davidbisbal y @JuanMagan ¡Vamos! https://t.co/tmQdNgMg8I @JesusCalleja @Mar_Balear @alexgonzalezact Madre mía cuanto os he hachado de menos amigos. Ahí voy con mis conciertos y haciendo todo lo posible por alternarlos con buceos buenos. Espero que pronto pueda visitar MarBalear. Os quiero. Todavía soñando con el concierto de anoche en Vigo. Os compartiré todas las fotos. https://t.co/P5G9Ozarg0 Lo logramos, la lluvia no nos venció y disfrutamos del concierto en Vigo. Os quiero muchísimo!!!! https://t.co/FqqbhEZQaI Vigo, ya estoy preparado para el concierto de esta noche. Nos vemos al rato. https://t.co/gFsXnI6FAN Buenos días, hoy cantamos en Vigo si o sí 👍🏽 besos 😘 https://t.co/g959O3nyvz Hay conciertos que jamás quieres que terminen. Fue lo que me ocurrió ayer en Marbella. Mi resumen en cuatro fotos. https://t.co/kuUtLXhLlO RT @VEVO_ESP: Uno de los temas de este verano, #Bésame de @davidbisbal y @JuanMagan, acumula ya más de 20M de views en su primer mes! 🙌🏼\n¿L… Que espectacular Video capítulo de Sanlúcar de Barrameda!!! Aquí lo puedes ver entero. https://t.co/BtNR2AvwXN https://t.co/8WGUayYyEv RT @UMusicChile: La semana empieza llena de besos de @davidbisbal y @JuanMagan #Besame 💋💋💋 https://t.co/RdZCXCnBEO Ayer en Sanlucar de Barrameda! Me lo pasé espectacular! Vaya público entregado tanto con las canciones rápidas como con las baladas!!! Os quiero! Nos vemos en Marbella pasado mańana!! https://t.co/P8eUF0gyAE Dentro de un rato tengo la prueba de sonido en Sanlúcar. También nos vemos el día seis en Marbella y el día ocho en Vigo. Os quiero! Os dejo un Video de la tarde de ayer. https://t.co/f1Jlp73lX8 https://t.co/FHBazjZV1C Nala!! Presumida!!!! https://t.co/4gTlsoF2rZ Estudiando de camino al estudio!!! https://t.co/czjAlsFuRZ Vuelvo a mi amadísima Argentina con el Tour 2019. El 7 de diciembre nos vemos en el Luna Park de Buenos Aires... muy feliz!!!\nhttps://t.co/YTmatQmmDi https://t.co/bYj3BVd3yZ Es alucinante, cuantos años llevamos trabajando juntos, qué fidelidad y qué hermandad se respira con este grupo de maravillosos seres humanos. Así repasan #bésame durante el camino. https://t.co/FPgBbqy3u7 Feliz cumpleaños a @alo_oficial mandémosle nuestra felicitación!! Un abrazo de todos los bisbaleros! https://t.co/vxQiVypBL9 Vaya pedazo de cantera que tenemos. La selección española de fútbol sub 19. Campeones de Europa!!! https://t.co/pqojBZcR8W Buenos días mi gente!! Espero que paséis un domingo maravilloso!!! https://t.co/uEyxqspmyp https://t.co/IJT0UiMNhY Mañana os paso todas las fotos del concierto en Suiza 🇨🇭!!!! Próxima parada en Andalucía!!! Os quiero!!! https://t.co/rWCnyL6aro Hoy es viernes y hay que ponerse guapo!!! Vamos! Ja ja ja ja ja ja 😂 https://t.co/VOYoaJ3lqs Buenos días mi gente, A quien madruga Dios le ayuda!!! Aquí estamos celebrando los 18 millones de la canción! #besamebisbalmagan https://t.co/SQJGNfseNH https://t.co/lsFmhUw8WY @vinilo_negro @raquelpa3 @JuanMagan Gracias amigos. He querido volver de nuevo a esa rumba de nuestra tierra mezclada con la esencia latina. Espero que os guste. En el futuro vendrán algunas canciones menos convencionales muy difíciles de cantar y que van directamente al sentimiento. Bésame, como si fuera ahora la primera vez! https://t.co/SQJGNfseNH https://t.co/SiX6m0qKwz RT @bisbalpress: ¿Te perdiste ayer a @davidbisbal en #los40globalshow? Pues ya lo puedes escuchar: https://t.co/LGKJOXgVxs Es el momento perfecto para disfrutar de @saboresalmeria para todos aquellos que estáis de vacaciones en mi tierra, espero que disfrutéis de estos productos maravillosos de toda la vida. Un besito!!!! https://t.co/D6K2SHiJwT Espero que paséis una maravillosa semana!!!!!! https://t.co/3WRt9ex25C RT @UMusicChile: @davidbisbal y @JuanMagan se volvieron locos y están repartiendo besos con el hitazo #Besame. ¿Quién quiere uno? 😍 https:/… Aquí, inventándonos unos ejercicios para mejorar en el escenario y no tener tanta deuda de oxígeno!!! Muchos besos #besamesport https://t.co/29iX0fVtUH 15 millones con  #BesameBisbalMagan Es que es una locura!!!! Os quiero en el alma. Muchísimas gracias por este maravilloso regalo. https://t.co/SQJGNfseNH https://t.co/H7Do595nuQ Celebrando 12 millones de visualizaciones con #bésame. Una semana!!!! https://t.co/owtdgBpfpG Qué espectacular concierto vinimos ayer con todos mis compañeros de la voz. @lavozdealmeria os quiero!!! https://t.co/GkqapqRGuQ Ja ja ja ja ja ja habéis jugado alguna vez al #EmojiChallenge te lo pasarás espectacular!!!! @Los40 @FelixCastillo40 https://t.co/32adKbYKFO 9 ańos #tbt de waving flag , Nueve años que la selección española ganó el mundial de Sudáfrica. https://t.co/4CCBTZfYuD Amigos de Loja y Murcia, me siento muy feliz de que el #Tour2019db pase también por estas 2 tierras hermanas de mi Almería. Os espero el 29 agosto en Loja y el 4 octubre en Murcia. Serán 2 noches inolvidables!\n➡️ https://t.co/zIJMhek0Sm https://t.co/opjyIXIUOs Aprovecho para agradecer por aquí todos los comentarios tan positivos que estamos teniendo con la canción y el arranque tan potente que hemos tenido en estos primeros días. Os queremos. #BesameBisbalmagan https://t.co/kcmJRE95U9 Qué bien me lo paso cuando vengo a la radio a presentar las nuevas canciones!!! Me encuentro con tantos amigos!! #francino @isidromontalvo https://t.co/ddVcD9dNjJ Ha sido un autentico placer estar con vosotros amigos. https://t.co/uPIEnJJYSS Madre mía, que alucinante cifra en cuatro días. No doy crédito. Y apartir de hoy y Perdón! Esto que está sucediendo es un sueńo!! https://t.co/SQJGNfseNH https://t.co/acPhoVeowJ Unos segundos de lo que fue anoche el concierto de las ventas en Madrid!!!!!! https://t.co/SQJGNfseNH os quiero mucho!!!!! https://t.co/l94OaACsUX te ves entre el público?? https://t.co/3VGmK7TJ4E RT @TonyAguilarOfi: Gracias @davidbisbal por tantos años de cariño y amistad. Eres admirable como artista pero aún más como buena gente. Qu… Gracias mi gente de Global show!!!! Os queremos!!! https://t.co/SQJGNfseNH https://t.co/Tm7n1qPIzh @pablofansclub Felicidades Pablillo!!! Eres un maquina!!!!! Celebrando los 2 millones de visualizaciones de #bésame en estos dos días!!!! Os quiero con todo mi corazón!!! Que bien me lo he pasado en las ventas de Madrid!!!!!!!! Mas noches mágicas cómo estás!! https://t.co/SQJGNfseNH @JuanMagan https://t.co/49aFxQtohu 1 millón de gracias a todos!!!!!!! @JuanMagan que bien ha arrancado el vídeo de #BesameBisbalMagan https://t.co/SQJGNfseNH que ganas tengo de cantarla esta noche!!! https://t.co/Ad78nFcL2m RT @Spotify: Get moving to the new summer bop from @davidbisbal and @JuanMagan. Bésame 😘 https://t.co/fcuf3r5af8 https://t.co/K4oB2TGPsj @JuanMagan De maravilla juan!!! Que alegria de canción!!!! Que disfrutéis del vídeo de #Besame Con mi amigo @JuanMagan https://t.co/SQJGNfseNH que cantidad de visualizaciones en 1 día!!! Mil gracias!!!! Y mańana! La cantaremos en las ventas de Madrid! https://t.co/HjoNFdox4n Salimos a navegar con @JuanMagan para presentarte #Bésame! @VEVO_ESP @SomosVevo https://t.co/OpFVTqcymD El tema #Besame con @JuanMagan es portada de la playlist #PopIberico de @amazonmusic! \nhttps://t.co/2WxXEK2oUb https://t.co/PY8aWyUx6x Este fin de semana no vas a parar de bailar con #Besame junto a @JuanMagan Escúchalo en “Lo mejor de la semana” de @AppleMusicES https://t.co/N5ctkLbGBc https://t.co/RAWmJ3Lheo Ya está mi gente!!!!!!! Vamos a ver el vídeo!!!!!! #BesameBisbalMagan https://t.co/SQJGNfseNH @JuanMagan https://t.co/WeJrhib1vi Ya lo tenemos mi gente!!!!!!!!! Vamooos! @JuanMagan #BesameBisbalMagan https://t.co/ZHvHl8HsIN @Spotify https://t.co/dOgCuFnL5A Ahora en el chat!!!! Pásate!!! https://t.co/SQJGNfseNH https://t.co/YG8JGFTbU3 Mańana ya el estreno!!!!! Quedan muy pocas horas mi gente!!!! Os quieroooooooooo https://t.co/w9bI3bDY7n @JuanMagan https://t.co/rESk6PQrCf Mańanaaaaaaaaaaaa Por aquí comentaremos las horas previas al lanzamiento del nuevo Single #Besame https://t.co/SQJGNfseNH https://t.co/53mCvA31UH Quedan 2 días Dios mío!!!!!!!! https://t.co/JxcDX2ZTVF Madre mía, tendremos que preparar una versión mix bulería 2020!!!!!!!!! https://t.co/Gy3MXmYtIm 3 diaaaaaaasssss @BISBRASIL @JuanMagan Mi gente bonita de Brasil @EIncreiblePeru @JuanMagan Mi gente de Perú también presente @fanclubdbfrance @JuanMagan Francia!!! Muchos besos @ClubARGENTINA @JuanMagan También mi gente de Argentina está atenta a la salida de bésame. @dburuguay @JuanMagan Me encanta que estéis tan atentos a la salida del nuevo Single!!!! #Besame Mientras que le deseamos a toda la gente una maravillosa semana. Os dejo las mejores fotos del concierto de ayer de Valencia!!!! Y una muy especial del concierto de las Palmas!!! Vaya pedazo de concierto que vivimos ayer!!! https://t.co/JkR5x8TWdy https://t.co/jP3cIVb5X9 Quedan 4 días!!!!! Madre mía!!!!! @AngelBandBoy @Merxita7 Ya se lo que dices!!! Es esto!! Y le dieron 3 golpešitos sa, sa y šitos!!! Realmente es una frase que cantaba mucho mi padre y que yo la rescaté para esta canción! Un abrazo @Jonas_Arcos Muchísimas gracias Jonas. Os mando un abrazo muy fuerte a todos. Os aseguro que la motivación me la dais vosotros a mi diariamente @cdelcre Gracias a vosotros, porque no solamente apreciáis la voz, Sino también el trabajo del resto de mis compañeros!!! Un abrazo! #teamwork @miguelb03158473 @Conc_Viveros @AjuntamentVLC @notikumi @festesdeVLC @GranFiraVLC @Valenciaturismo @levante_emv Es un lugar fantástico para dar conciertos. Me he sentido muy bien encima del escenario y el sonido ha estado de nuestro lado. Un abrazo muy fuerte a todos! @AngelBandBoy Solo dame más del amor que llevas dentro! Una canción que grabé en el 2004. A veces las frases que se cantan más aflamencadas son más difíciles de comprender. Un abrazo y gracias por tu tweet. Qué puedo decir del concierto de esta noche en Valencia. Pues que la magia existe!! La habéis puesto vosotros!! Gracias por tanto cariño. https://t.co/Ib05gNXGPN Bien amigos y nos levantamos muy temprano para viajar de Las Palmas de Gran Canaria a Madrid y ya nos vamos dirigiendo para el concierto de Valencia. La logística un poco complicada pero era la manera de poder descansar lo máximo! https://t.co/vpunhCKSl9 https://t.co/y7AGrGqvxh @ZSeir @LuisitoComunica De nada José, no sabes lo que es estar en la copa  y de gira por España al mismo tiempo. Es Super duro. Ja ja un abrazo muy fuerte. Gracias a todos por los buenos comentarios que hemos recibido en el concierto de esta noche en Las Palmas de Gran Canaria. Nos vemos mañana en Valencia. Nos espera un Video capítulo Super extenso lleno de momentos maravillosos!! https://t.co/Gis4ZYLqJC Hoy, me he encontrado unos voluntarios recogiendo basura en algunas playas de Gran Canaria. Este año me gustaría que fuésemos más solidarios con nuestro entorno natural. Todo esto lo verás en el capítulo. Nos vemos esta noche en el concierto. https://t.co/jn1ZOB0Ajk https://t.co/9JF25mdgFv #besamedb #portada! Quieres saber como suena???? https://t.co/8Igut2SMDV @JuanMagan https://t.co/BHHl1SRgAI Video capítulo de mi concierto básico con @Los40 https://t.co/qAMf60KiG7 https://t.co/GBXcL5KzCn RT @LaVozAntena3: Las lágrimas de Juan Mena, el emotivo momento de @davidbisbal, la brutal actuación de Helena Bianco... ¡Que FINAL más inc… Madre mía!! Qué emoción de programa verdad???? Gracias por todos los comentarios que hemos recibido esta noche!! Os quiero! @LaVozAntena3 https://t.co/3Ui7xti0g4 RT @LaVozAntena3: Esos son los sueños que dignifican a una persona, @davidbisbal 😍 https://t.co/0uJCKsW5b9 #LaVozSeniorFinal   #LaVozAntena… @EIncreiblePeru @LaVozAntena3 Te lo juro, nunca había sentido algo parecido en televisión, pero todos los que me conocen sabe que para mi el éxito mas grande es el amor de los míos. Me imaginé un futuro precioso con mis hijos y mis nietos. Bravo Juan, besos a tu familia. #besamedb tic tac tic tac https://t.co/wNA6FhHuFc Atención!!!!!!!!! Feliz miércoles!!!! https://t.co/g6EwI4721a David Bisbal en el Basico de @Los40 https://t.co/omqJPbGfi9 vía @YouTube me quedo sin palabras! El repertorio está en su mejor momento y gracias a vosotros!!! Me lo pasé espectacular!! Pienso hacer vídeo capítulo!! Os quiero! Gracias a todos los paises por acompańarme!!! https://t.co/MYzmlavnub Os espero a todos a las 20:30 h.!! @Los40 #Básico\nhttps://t.co/6BYa5BiI7h Listo para @Los40 #basico esta noche! Voy en camino a la prueba de sonido!!!! Esta semana empiezan a suceder cosas!!!!!!! #besamedb https://t.co/pSqsgPuTTm Aquí el vídeo capítulo completo!!!! De Andújar!!! Os quiero. https://t.co/pD1PZrBSrx o aquí... https://t.co/MlfTSbRZUG https://t.co/XTUvXCLNYZ Para mi fue un placer, Rocìo es una gran luchadora. https://t.co/ttdAfx09e5 @Domingovale @RoiMendez @UniversalSpain Vamos Domingo, la música es recorrido de fondo, de disciplina y respeto!!! Seguimos! Recordando mi concierto de anoche en Andújar! Espero que paséis un maravilloso domingo y que lleguéis al principio de semana con mucha fuerza. Recordad que las vacaciones están al caer para muchas personas. Os las merecéis. https://t.co/yinek3qKHo https://t.co/qOAkBQarWV Andújar! Me tocaste el corazón! https://t.co/W7hBjvvL99 Con Bella!! https://t.co/Gx3OmmfhMz https://t.co/BkGx7NfA2X RT @bisbalpress: Dale al Play!! Y puedes volver a escuchar la entrevista a @davidbisbal en #NoEsUnDíaCualquiera RNE https://t.co/xfaCXj3mhP De verdad, que trato maravilloso me habéis dado. Gracias por esta maravillosa conversación Pepa, hoy te he conocido y hoy ya te quiero! https://t.co/KfjWAyO4AE Buenos días mi gente! Que paséis un maravilloso fin de semana. Yo voy directo a visitar a mi amiga Pepa Fernández en @NEUDC_RNE os quiero! https://t.co/Z6ZnciMzue Qué ganas!!!! #noesundiacualquiera https://t.co/mSAt3SDso4 Vamoooooooooos energía para todos!!!!!!!! https://t.co/gZviu3nLzl @Anitanagon Tú sabes por que lo dices... Spotify ja ja ja ja ja ja 😂 @marmos2 Amigo Marcos, tiene que ser canciones que habitualmente no estén en mis conciertos. Un abrazo muy fuerte 💪🏽 Canción de hoy?????? Buenos días mi gente!!!! #lucia! https://t.co/UZYnNKY0kQ En fin... buenos días a todos!!!! https://t.co/KmZyT3cAcJ Hay mucho arte por aquí!!! Os quiero!!!!!! https://t.co/8wp8woVyE7 https://t.co/sn4qqj0Dij Esta actuación me la guardaré para toda la vida!!! Gracias #blanca gracias @PabloLopezMusic https://t.co/gBGqfiVAuB @LoolaDiiazOrtee si, ja ja ja ja ja ja ja ja ja ja ja me encanta la musica y cuando escucho una canción que me gusta me dan ganas de cantarla, así como cuando venís a los conciertos y cantáis con nosotros. Besos. Este programa me ha enseńado que lo más importante de la vida es nuestra familia! https://t.co/LYrT9Uzmwk https://t.co/8kDqxobiQD Me encanta que nos sigan todos los clubes en varios países. Nos vemos al rato. https://t.co/OTkhyodWq3 Hoy La voz Senior y el sábado #pepafernandez #rtve y mi concierto en Andujar!!! https://t.co/W1PsjYqW1p https://t.co/S1Gm6L3zwJ Y hablando de quisiera ser un pez, estos son mis favoritos! https://t.co/QODpWnkVav #CabodePalos https://t.co/zHUdyWKFGv Tengo unos ejercicios muy buenos pero quizás para algunos podría ser una locura!! Eso si, previamente hay que estar entrenado. https://t.co/xXggzA6JdL RT @canalfiesta: ¿Te perdiste la entrevista de @dominguezja a @davidbisbal del pasado fin de semana? 😍 Aquí, la tienes completa 📻 https://t… @alfredgarcia Ja ja ja ja ja ja! Probioticos!!! Siempre es más divertido hacer deporte cantando un poquito. Quisiera ser un pez 🐠 🐟 os quiero!!!!!!! https://t.co/rQI651UXpR Cuando se den cuenta que por tercera vez hemos llegado volverán a limpiar ja ja ja ja ja ja ja ja ja ja ja ja. Que apostáis? Besos mi gente, todo esto es gracias a vosotros. https://t.co/70UxpfezmQ Feliz Semana mi gente!!!! Empezamos con la promoción muy pronto!!! https://t.co/boZdI0uBpZ https://t.co/xn7baH9S5O Y lo sabes!!!!!!!! https://t.co/IKJeBOPzlV Qué gran recuerdo!!!! Besos! https://t.co/3Cr8Gv09ml Qué bien me lo paso Siempre con los amigos de @canalfiesta @canalsur https://t.co/TpIniD3DBb Feliz cumpleaños a mi Rossana!!!!!!!! https://t.co/Cq1Xknnr7a https://t.co/tmtLwGeX0G Que nadie se pierda la entrevista. Un abrazo muy fuerte a toda mi gente.Gracias por el cariño https://t.co/BJUxB8wZje @clarabisbalerac Tengo unos métodos de ejercicios para la voz entrenando al mismo tiempo que son míos y me funcionan muy bien. Un beso mi gente!! https://t.co/Pbhkin8jAf @chicuela Feliz viernes a todos!!! Un #tbt muy especial! https://t.co/ZPAGfaDvRO yo no estoy presente pero pertenece a mi vida también.\nMi madre y mi padre eran vecinos, casi vivían puerta con puerta en sus barrios. Quizás en esta foto mi madre tendría 16 años y probablemente ni siquiera fuesen novios todavía. https://t.co/ZSKGrjuUND RT @Los40: ¿Todavía no tienes entradas para ver a @davidbisbal en #LOS40BásicoOpelCorsa ?🎟\n\n¡Participa en nuestro concurso y llévate una in… Esta noche nos vemos en la voz senior. Qué ganas tengo de que empiece el programa!!! https://t.co/Q6J0l7dDoG https://t.co/pDjOionFjj Feliz Martes mi gente!!! Haz primero lo que más te cueste y después todo lo que venga después te parecerá fácil! https://t.co/nL5shJZdIs @Malenimulle Ja ja ja ja ja ja ja 😂 Qué ganas tengo de volver a subirme a este escenario maravilloso. En varias ocasiones he tenido la oportunidad de hacer algunos conciertos con vosotros y volveré para dar lo mejor de mí, para disfrutar de la gente y para hablar de muchas cosas nuevas que vienen en el camino. https://t.co/xt2oUTO2Ap RT @PepiyFernando: VER 20 FOTOS! Concert de @davidbisbal al Reial Club de Polo de Barcelona https://t.co/mbsXj6WsTs Con mi gran amigo @Carlos_Latre antes de mi concierto en el festival Polo de Barcelona!! Qué gran artista es Carlos !! Me lo pase muy bien ayer. Gracias por venir a saludarme! https://t.co/LPrWQH9cOt https://t.co/ZfGUi1dEGs Buenos días mi gente. Espero que paséis una semana fabulosa. Aquí os dejo unas cuantas fotos del concierto de anoche en Barcelona en la primera edición del festival polo. Las próximas dos semanas serán muy intensas de preparación. https://t.co/kYVY4WWNxg Qué felicidad!!!! Qué orgullo @RafaelNadal #RafaNadal #RolanGarros https://t.co/Hcp8YUcBY7 Ayer leí esto... “No es más feliz aquel que más tiene, sino el que menos necesita”. Lo cierto es que Todos estos discos y premios en realidad son vuestros y me habéis regalado más de lo que cabía en mi imaginación y mi corazón. https://t.co/Qnkyw9q8YE https://t.co/006wcZVxjg Buenos días mi gente!!!!! Hoy nos toca Barcelona. En el festival Polo! Con muchas ganas de llegar al Soundcheck, quiero probar muchas cosas del setting para que esta noche y el resto de los conciertos se quedan perfectos. https://t.co/0afuSLjjdp Vídeo capítulo @Teatro_Real 40 https://t.co/rH5v0VefMR https://t.co/ND4ZAagaIT Espero que paséis un maravilloso fin de semana.Hoy voy a compartir con vosotros mi Video capítulo largo del concierto que realizamos en el teatro Real con motivo de mi 40 cumpleaños!!!!! Espero que os guste!!!!! https://t.co/WLpxoahi6q Qué ganas de que llegue el Domingo!!!!!!! https://t.co/YG9xVpEWQR Feliz cumpleaños @JuanLuisGuerra Que bien lo pasamos aquí!!! - Si No Te Hubieras Ido (Official Music V... https://t.co/IZJ72As6jU vía @YouTube Dos fotos que me comparte mi amigo Juan vela. Su trayectoria como fotógrafo musical es envidiable!! Gracias por estar en mi cumpleaños! https://t.co/FUDGahyXr6 https://t.co/h6P0m637jA Muchas gracias a todos por vuestras felicitaciones. Estoy deseando ahora celebrar mi cumpleaños este domingo en el festival polo de Barcelona! https://t.co/p1vrawrFwa Realmente el regalo más hermoso es escuchar vuestras voces cantando conmigo! Os quiero! A por los próximos ańos!!! https://t.co/gwqdaMirCu https://t.co/mTyNHPYZ3t RT @WORLDMUSICAWARD: Happy 40th Birthday to the gorgeous Spanish Superstar #davidbisbal, World Music Awards Multiple Winner! @davidbisbal… RT @UniversalSpain: #Felices40Bisbal \n\nhttps://t.co/qPQU8CdcW7 https://t.co/luuMw0XBSH RT @UniversalSpain: Sigue ya en directo el Concierto Especial 40 cumpleaños de @DavidBisbal desde el @Teatro_Real de Madrid en https://t.co… Os espero a todos en el concierto celebrando mi cumpleaños desde el @Teatro_Real!! Lo podeis ver en directo en https://t.co/JDETL1U3Ng https://t.co/GZLSQGjwEW Pasando mi último día con 39!!!! https://t.co/GU7q1usK31 además mañana como regalo de cumpleaños, quiero invitaros a todos a mi concierto en el teatro Real, lo podéis seguir en mi canal de YouTube en streaming en todos los países!! Os quiero! https://t.co/3TlVnj0IlX Me ha salido culpable, que bien. https://t.co/KewcTKdYXA https://t.co/clbSXDI7WO Muchísimas gracias por estos 250 millones, qué cifra tan bonita.@SebastianYatra https://t.co/G3ZiPH54td Horóscopo Dial: ¿Qué canción de David Bisbal eres? – Cadena Dial Muchas gracias amigos de Cadena Dial, quien participa? https://t.co/aZx1MettHw RT @LaVozAntena3: 🎤@davidbisbal fue el primer coach en cerrar su equipo en las Audiciones a ciegas de #LaVozSenior 💥¡Conoce a todos los tal… La defendió con todo su honor. Gran deportista que echaremos de menos y al que le debemos muchos momentos de alegría. Que descanse en paz. #JoseAntonioReyesDEP https://t.co/jdM9hDaK68 Vamos compadre @AlejandroSanz hoy es tu noche en el arranque de la gira!!!!! Te queremos!!!! Buen fin de semana!!! Y maravilloso mes de junio!! Os quiero mucho. https://t.co/xVU2vyDt6Z Gracias a vosotros! Sois una familia maravillosa! Os queremos. https://t.co/kJTjlkM7jJ Al que tienes que superar es al que ves reflejado en el espejo. https://t.co/HUtytQtIJ6 supérate a ti mismo cada día. https://t.co/94vjCmCYVi Esta fue mi historia con mi amigo @JesusCalleja en Nepal, 2015!! Espero que os guste...#TBThursday https://t.co/zhyagSipQC https://t.co/9lVqkELqSw Me encanta que seáis así tan Buenos! https://t.co/Py9UAF0nHt Hoy en el dia internacional de la #EsclerosisMultiple me encantaría que pudiéramos ayudar a todos aquellos que padecen esta terrible enfermedad, que seamos solidarios y podamos ofrecerles lo mejor de nosotros mismos para una mejor calidad de vida. Besos a mi gente. https://t.co/8LDAw4Wzf2 RT @grupoboomerang: Qué mejor cierre 💃 #LaVozSenior4 https://t.co/UPMhc6f746 Madre mia la fiesta final que tenemos preparada. ja ja ja ja ja ja https://t.co/lqnO9jWZuY Gracias Julian, hay que pasárselo bien, pero siempre con mucho respeto, agradezco tus palabras. Un abrazo fuerte. https://t.co/p5eobOybaS ja ja ja ja ja ja ja ja ja ja ja , hago colaboración si o si, la de veces que la he cantado en mi casa. https://t.co/2rrd0VG2Qu que dices maquina, me ha encantado tu comentario, lo había recibido muy bien, yo también te mando un abrazo, ese JEFE campeón. https://t.co/eWzYnCthau @ElJJefe13 @evagonzalezf @LaVozAntena3 @PaulinaRubio @PabloLopezMusic @antoniorozco jajajajajajajajajajajajajajajaja, jefe, pregunta pregunta, por que? eso digo yo, como es posible? RT @antena3int: Todavía hay tres equipos por cerrar en #LaVozSenior en la última noche de audiciones a ciegas, hoy en #Antena3Int @LaVozAnt… Para tener el control del timón, primero has de saber remar bien!!!asi que, a remar con fuerza!!!! Aunque haya viento, aunque la corriente sea fuerte, aunque el mar sea feroz! Buenas noches mi gente. Os quiero! https://t.co/HXSXYnCjQY https://t.co/y3MLRmZjBu Hoy es un día muy especial! Vaya mes de junio que nos espera!!! Os mando un abrazo a todos! https://t.co/W3PRSEp49Z Querido @antoniobanderas , quiero felicitarte por tu más reciente #palmadeoro como mejor actor en la película #DolorYGloria RT @CasaReal: Final del Campeonato de España \"Copa de S.M. el Rey” de Fútbol, en el Estadio Benito Villamarín @rfef https://t.co/HEF1K2WuWz… @_AndyyLucas_ Que alegría tiene el tío, se lo pasó genial. Un abrazo a todos. @AlvaroCarrellan Gracias Alvaro por tus palabras, siempre me ha gustado unir mi musica al deporte y lo he hecho con el respeto por delante. Abrazos @Dani_Merono Muchas gracias amigo Dani, me lo pasé espectacular, me sentí cómodo con el sonido, ya sabes que siempre me gusta cantar en directo sea cual sea el escenario. Con muchas ganas de volver a Japon amigo Yutaka. Saludos. Un abrazo desde Espańa. https://t.co/XSdBu4CrmB Siempre me dejo el alma en el escenario y cuando he tenido la oportunidad de unir la musica con el deporte, hace que me sienta el hombre mas feliz, gracias por cantar conmigo, en el estadio, desde vuestras casas y desde otros países por el canal internacional de TVE https://t.co/ni4YbXuR0i Muchas gracias Juan por tus comentarios, que viva la musica. Un abrazo fuerte. https://t.co/dqVc0jR6pG RT @musicagran: Atentos!!!!!  actuación de @davidbisbal sobre las 20:41 a disfrutar de su actuación y del partido!! que gane el mejor #Fina… Esta noche!!! https://t.co/HDkHb90y3v https://t.co/md68QtjSBb Aquí los amigos de @NatGeoEspana explican el atasco en el Everest muy bien. https://t.co/FUfH3VKLd8 Qué sufrimiento. Atasco mortal en el Everest. Es difícil de explicar y la oportunidad de coronar con buen tiempo es complicado, pero en mi opinión debería haber un cupo maximo para que no sucedan estos horrores. https://t.co/ZijEmSm0mC RT @musicagran: @davidbisbal estará cantando esta noche en la copa del rey, ¿que cantara esta noche esa final? nosotros empezamos con un po… Ojalá pudiera cuidar mi instrumento tal y como Nacho lo ha hecho durante tanto tiempo, cantar así con 70 años es un privilegio que se lo ha trabajado con esfuerzo y dedicación. Un abrazo 🤗 gracias por las palabras. https://t.co/uVLIKyU9HC RT @BFloresViajando: @davidbisbal querido: \n(•̀ᴗ•́)و【Hace exactamente 12 ANITOS... Contigo en NARITA】(•̀ᴗ•́)و\n\n[No sólo mujeres, sino tambi… Un abrazo amigos @lavozdealmeria https://t.co/FtBruPtKuT No siempre tienes que ganar, no debes permitir jamás rendirte y dejar de intentarlo! https://t.co/ZBxphFmhqt https://t.co/KGoTcqA52X RT @AlfredCasas: Ya has oído a @davidbisbal en @SER_Almeria. El 20 de agosto viene de concierto a #Almería. Mañana entrevista completa en #… RT @bisbalpress: David Bisbal ofrecerá un concierto el 20 de agosto en Almería https://t.co/jT0YabxjZf vía @diariodalmeria RT @bisbalpress: Escucha a David Bisbal hablando en Hoy por Hoy Almería -AUDIO: https://t.co/9koqaOUcUI RT @almeriadescubre: ¡¿Qué sería un Tour sin nuestra querida #Almería paisano?! ¡Aquí te esperamos @davidbisbal! https://t.co/s2aFgaa3qY RT @DBCoachFavorito: Síii! Fernando se va con @davidbisbal y con el son ya 4 miembros en el #EquipoBisbal.. #LaVozSenior3 ¡bienvenido! Tene… RT @LaVozAntena3: 💥 ¡Vamos que empezamos! 💥\n\nTenemos todo listo para #LaVozSenior3 y los coaches y @evagonzalezf están más preparados que n… Quien está listo???????? https://t.co/YJyJ15VSZA Como iba a faltar mi Almería en el Tour 2019? Nos vemos el 20 de Agosto, paisanos, os espero a todos!!! https://t.co/zIJMhek0Sm https://t.co/nP1g931bbR Tengo muchas ganas de hablar con mis paisanos. Cuánto echo de menos mi tierra Almería. https://t.co/p2EarJtHC3 RT @CADENA100: 🎂 Ya ha pasado por Bruselas y París y la próxima gran cita de @DavidBisbal será el 5 de junio en el Teatro Real de Madrid pa… Next!! https://t.co/UJaQGsaL1I Vídeo capítulo Bruselas y Paris!!!! https://t.co/tgudh48IkN gracias por este sueńo!!! https://t.co/rlk8hQXxaQ Han sido dos conciertos maravillosos. Los he disfrutado a vuestro lado. Los vídeo capítulos están en camino mientras aquí puedes ver un adelanto. https://t.co/M12eygGdZl https://t.co/gX6xm6bUoJ https://t.co/XJ5Zrxs51A RT @telediario_tve: Esta ha sido una noche muy especial para el cantante David Bisbal. El artista almeriense ha actuado, por primera vez, e… Paris! @EFEnoticias gracias a todos!! https://t.co/HV1RpmYwd2 RT @Kris_Christophe: What a wonderful evening ... David Bisbal 🇪🇸 has inflamed the audience of the Olympia de Paris ... an unforgettable ev… Con la familia BISBALera en París. Sé que es una representación todo el amor repartido!!! https://t.co/V4eVfI7v9G https://t.co/KcivNiYIxG RT @OLYMPIAHALL: #LiveOlympia : @davidbisbal\n\n• Ouverture des portes : 19h00\n• Début du concert : 20h00\n\nBon concert 🙂 https://t.co/effFSzn… Gracias a vosotros por vuestro maravilloso cariño durante tanto tiempo. Estoy deseando subirme al escenario de Olympia https://t.co/D3s97I2a4x Con ganas de cantar en Paris esta noche!!!!! https://t.co/PVgigYze8j Buenos días, después de nuestro concierto ayer en Bruselas, hoy seguimos a París.  Seguiremos retransmitiendo en vivo algunas canciones. Besos. https://t.co/uvCCm3QXve RT @OLYMPIAHALL: Le concert de la star espagnole @davidbisbal aura lieu demain à L'Olympia et les toutes dernières places sont ici 🥰 → http… Quien estará presente hoy en el concierto de Bélgica 🇧🇪??? Qué ganas de volver a encontrarme con vosotros. https://t.co/6iszoPBNTF Hoy cantamos en Bruselas. Un beso y nos vemos al rato. @nerea_rios @LaVozAntena3 Es por ese motivo da la sensación de que se van muchos. Besos. Solo tenemos la oportunidad de elegir cinco voces en el equipo, solo cinco!! Gracias @LaVozAntena3 #Lavozsenior2 por este programa!!! https://t.co/OWxiQAksrY @jrossgt Sería un sueño poder hacerle un gran homenaje. Manuel Alejandro. @vero_bisbalera Lo que pasa que no es copla por decir Copla, es que Blanca ha cantado muy bien. Se lo ha ganado ella. Copla?????! Ahí estoy yo!!!!! Me encanta 😍 Blanca!! Bienvenida al equipo!!!! No lo puedo evitar! La tierra tira!! https://t.co/a7He9Ziycw Qué bien lo estamos pasando en la voz!! Os presento parte del equipo!!! @PaulinaRubio @antoniorozco y lo mejor esta por llegar!!! @LaVozAntena3 #LaVozSenior https://t.co/REG76Nzo4U @R78Raquel @LaVozAntena3 Cuando cantamos con los talentos, es porque lo piden y para mi es un honor hacer colaboración con ellos. Muchas veces veis una edición de lo que realmente ocurre. Gracias. @pepa43_ @antoniorozco @PaulinaRubio Ponte de espalda tu, que no te cuenten nada de su historia y solo escucha. Lo adivinarías? Y si, si que me acuerdo de Gonzalo y hasta canté una de sus canciones en Operación Triunfo. Fantástico Gonzalo! Me acuerdo perfectamente del capítulo de verano azul que se caía por el acantilado y lo rescataban los niños!!!! Después ha producido muchos buenos discos!!! Y en el programa de operación triunfo, en la primera gala cante en casa de Inés de Guarana!! https://t.co/5kTDGhz4lr Después de “A partir de hoy” y “Perdón”... llegará mi tercer single!!! En JUNIO!!!!!!!!!! https://t.co/M7ga10blNd @bisbaiteda Si, para mi es importante hacerles a estos grandes artistas todas esas preguntas que todavía no sabemos. Os queremos. No puedo colmarte ni de joyas ni dinero, pero puedo darte un corazón que es verdadero. https://t.co/obmz3vOifc @Nayairis No importa, lo que importa es la oportunidad para el! Eso es lo mejor! Me encanta! Que Marcelo venga de la misma escuela que la mía!! De la orquestas!!! Que os parece??? https://t.co/whvAKNwO87 Qué ganas tengo de que empiece el programa. @LaVozAntena3 completaremos el equipo esta noche???? https://t.co/j9wCLKr07l Alberto, te quiero en alguno de mis conciertos!!! Ja ja ja ja ja ja 😂 me alegro que te lo hayas pasado muy bien. https://t.co/NussP1go60 Quiero compartir con vosotros la historia de Tiago! #somospocosperovalemosmucho su enfermedad le debilita sus músculos pero no le va a quitar la fuerza para conseguir lo que quiere que es vivir! https://t.co/GJVExCq2Ea Espero que paséis en Madrid y día maravilloso de San Isidro Labrador. Feliz Miércoles.\nNos vemos mañana en Bruselas y pasado en Paris. Mola mucho!!!! Gracias 😊 https://t.co/cKYHPvjhbr Barcelona, vamos a divertirnos mucho juntos. Ya queda menos para encontrarnos en el #CaixabankPoloMusicFestival19 !!\nhttps://t.co/vtPP5pWlzj https://t.co/uspuC88qAd La verdad es que como fanático que soy de la fórmula uno, me gustaría ver una competición abierta con los pilotos de la misma escudería, le da emoción. A veces hacen la competición muy aburrida con las estrategias de equipo. https://t.co/aQEtBoqUgg Cuando hay preparación de por medio, estás más cerca de conseguir tus sueños y tus metas! Animo mi gente. https://t.co/tHNhHIP6y4 @anamari_db Feliz cumpleaños a una de las nińas más carińosas y del club!! Te queremos! 7/8 Super Saiyajin Azul https://t.co/fXOxALhjER vía @playbuzz  no está nada mal!!! @Reforma Buenos días!!! Que próximos días nos esperan en Paris y Bruselas! Que ganas! https://t.co/apCo2yVTRq Os comparto este maravilloso #tbt del 2009 cuando pude realizar mi sueńo haciendo el camino De Santiago con mi gran ídolo #MiguelIndurain las bromas durante el camino estaban aseguradas!! #CaminodeSantiago https://t.co/OrljntS7Yp Buenos días a todos!!! Mirad que hermosura la catedral de Hermosillo! No me digáis que no es bonita! Espero que tengáis un maravilloso jueves. https://t.co/rGGGjypDPD Qué momentos tan bonitos nos esperan! Un vídeo de la rueda de prensa ⁦@LaVozAntena3⁩ #LaVozSenior https://t.co/zEdqHq0DeA Qué espectacular el programa nuevo de #LaVozSenior @LaVozAntena3 gracias por acompańarme! Que os ha parecido??? https://t.co/A1TNSunXsB RT @grupoboomerang: Cuánta razón tiene @davidbisbal, #Adriana tiene el look de @PaulinaRubio, pero ha dado su vuelta 🤣🤣 ¿Con quién se irá?… Como no darse la vuelta con la voz de Ramón por Dios!!! Su voz es única, pero qué tal la educación de este hombre y su elegancia??? #LaVozSenior @LaVozAntena3 https://t.co/TAA4nWIEBU Así es, no me cabe la menor duda que Carmen canta con el alma y con el corazón. Gracias por traer un poco de México a La voz senior en España. https://t.co/HFksTJkhao Madre mía!!! La voz de javier!!! Me encanta! Estoy feliz de tenerlo en el equipo!!! @LaVozAntena3 #LaVozSenior como lo estáis viviendo?? https://t.co/oY8s8jitjx Madre mia la Tata, qué emoción mas grande empezar así este maravilloso programa. Que tal?? https://t.co/mZ86xFt3ao En menos de una hora comenzamos #LaVozSenior!! Feliz de compartir esta nueva aventura con grandes amigos y con todos vosotros! @LaVozAntena3 https://t.co/UOn3PrsufO #LaVozSenior cambiará tu forma de pensar, te emocionarás y te sentirás más decidido a conseguir tus sueńos... nos vemos al rato. @LaVozAntena3 https://t.co/YfUdxyS2xl Te sentirás identificado y te emocionarás !!! Mańana!!! @LaVozAntena3 https://t.co/iqeuqWsaoO RT @bisbalpress: David Bisbal : Lo Mejor https://t.co/ia7IEi5sEp #NowPlaying @davidbisbal ¡A por el día! Bilbao, qué ganas de reencontrarme en este #Tour2019db con una ciudad tan maravillosa llena de grandes amigos!!! Aún faltan unos meses pero ya cuento los días https://t.co/ZTU9PZRl1K https://t.co/etSFoaxEQS Qué bien me lo pasé en Mexicali. Pronto más sorpresas. Nos vemos en Bruselas y París, mis próximos conciertos. https://t.co/dtcnmCB7e5 RT @LaVozAntena3: Los sueños se pueden cumplir ✨ Y nadie mejor que @davidbisbal y nuestros talents para demostrarlo 😍 ¿Por qué tenemos que… Felicidades a todas las madres del mundo.  gracias por darnos la vida. https://t.co/C8vttfbIre El concierto de ayer en Mexicali fue una pasada. Me lo pasé muy bien y gracias a los asistentes, el Cetys universidad 👩‍🎓 ayudará a muchos jóvenes a conseguir sus sueños con unas becas maravillosas. https://t.co/uRfCaBkhUv Así conocí a Rosa antes de entrar a operación triunfo cuando cantaba con mi orquesta expresiones!! Os comparto una foto inédita de nuestro compañero Jose Irun! https://t.co/rEU3CbVITv https://t.co/cB9nymr7Ai Agotadas las entradas para el @Teatro_Real del concierto de 40 cumpleaños. No podía soñar con una celebración mejor, y una vez más lo habéis hecho posible, miles de gracias!! https://t.co/8YGcJWeTRe Mańana subo un #tb muy especial!! https://t.co/vEzA6tUWvM El #videocapitulo de Hermosillo en camino!!! https://t.co/kW5w4qmjl2 fantásticas tus palabras. https://t.co/PD9XuTodZs Felicidades artistas, sois un gran ejemplo a seguir. https://t.co/XG3Tupvxjt @AlejandroSanz @ComunidadMadrid Compadre, te dan todas las medallas. Muy merecidas!!!! Ayer en Hermosillo y mańana Mexicali! https://t.co/qqnb3Tf7cB https://t.co/naHFiCjJ2J Hermosillo, esta noche se han unido dos tierras de dos desiertos diferentes, tierras hermanas. Hermosillo y Almería. Gracias a los medios de comunicación y el maravilloso público por cantar conmigo cada canción del repertorio!! Viva México 🇲🇽 https://t.co/BZ3T1hfrsa Muchísimas gracias por el recibimiento!!! Os quiero mucho https://t.co/UiAUDdGYjh @bisbalpress @fanclubdbfrance Eso fue ayer! Querido @IkerCasillas te deseamos una pronta recuperación. Te queremos mucho. Aquí son las 8 de la mańana en MEXICO y no quería dejar felicitar a tod@s los grandes trabajadores incansables que siempre miran al futuro con optimismo!!! Os quiero amigos!!! https://t.co/tx1KY7HeJL RT @paramount_spain: ¡No podíamos quedarnos con ninguna pregunta y necesitábamos saber qué fue lo que animó a @DavidBisbal a cantar la canc… No siempre se cumplen 40 años… y ya sabéis, me encantaría celebrarlo con todos vosotros con un concierto muy especial!!! El día 5 de Junio en el @Teatro_Real de Madrid… ya podéis conseguir vuestras entradas!\nhttps://t.co/X9yPokDnbU https://t.co/TFU2VF1dwA No puedo estar más feliz... el día 5 de Junio vuelvo al @Teatro_Real de Madrid para celebrar con todos vosotros mi 40 cumpleaños en un concierto especial por el lugar, la fecha... Y eso coincidiendo con la noticia de las entradas agotadas en Las Ventas... millones de gracias! https://t.co/S0PCesc6hi RT @JuanLuisGuerra: Gracias por tus palabras querido Bisbal!! Un fuerte abrazo! https://t.co/YQNR0Qxi8n RT @musicagran: @davidbisbal felicita a @JuanLuisGuerra por el premio a su carrera en @LatinBillboards #Instagram #SinoTeHubierasIdo ¿Lo di… @EIncreiblePeru @Pattygeminis @clubdbperu @dbfanclubchile @bisbalfanclubpa @bisbalpress @bisbalfanclub @BisbalSTMexico @FCDavidBisbalUY @eincreibledbpy @EincreibleRos @BisbalTeamPeru Es una triste noticia, siempre ha sido muy cariñosa con nosotros y nos ha unido momentos maravillosos gracias a la música. Que descanse en paz!! Os queremos a todos. Felicidades ⁦@JuanLuisGuerra⁩ por el premio Latin Billboard por tu carrera artística ...pero sobre todo felicidades por hacer feliz a tanta gente con tu música y por habernos inspirado a tantos artistas .\nUn fuerte abrazo!!! https://t.co/qgmV6ZiPYI Animo a toda la gente a apoyar a nuestro @alo_oficial a conseguir la triple corona! Únete a éste movimiento y haz lo mismo utilizando #FIGHTINGFORTHETRIPLECROWN @Kimoa https://t.co/BhOqp5ZgDC Sí, fue un momento muy especial de mi carrera. https://t.co/p8Fvf8d1ra Buenos días mi gente bonita de Perú. Os queremos mucho. https://t.co/D9ydyDOTYW Hoy os he traído un súper #tbt de la grabación en Alemania 🇩🇪 Let’s Make history con Joana zimmer! 2005! Ha sido muy bonito recordarlo. https://t.co/BcKxAO4wZC https://t.co/vJwq0dxyTK Felicidades a todos los que se llamen Jordi y feliz día del libro! Espero que sea un día muy especial para todos! #sanjordi #FelizDíaDelLibro Que maravillosa infancia queridos amigos de Perú 🇵🇪 https://t.co/ljYFerWl0t #DiaMundialDeLaTierra Nuestro mundo es maravilloso! Cuidemos nuestra tierra, cuidamos nuestros mares, cuidemos nuestro planeta. https://t.co/QcgFEJbbNx El árbol de la vida! https://t.co/HWJX5ewtQq @JesusCalleja A Milu no le gusta nada que se mueva! Todavía tengo sus colmillos grabados en mi gemelo! Ja ja ja ja ja ja 😂 Feliz viernes santo!! Aquí con el amigo @PabloGoldfinger trabajando. https://t.co/HQYvaAFw5F RT @EIncreiblePeru: Aqui les compartimos un maravilloso #TBT de nuestro gran @davidbisbal junto a #JuanGabriel cantando a dúo año  #yoteben… Porque te quiero amigo @magomore feliz cumple!!! Amigo! Buena persona, solidario! https://t.co/GplapeKS7D https://t.co/j8LSutl1E5 @musicagran @RaulElBalillaOf Felicidades @RaulElBalillaOf que máquina! Hoy nos dan la gran noticia de que también estaremos en Calviá el 31 agosto. Qué gozada el #Tour2019db!! https://t.co/KRME2oZwVe @rosarioficial Vaya pedazo de gira que te estás marcando! Viva mi rosario! @solamentejoy Felicidades joy!! Que hermosa noticia!!! Os mando un beso muy fuerte. Hoy estamos grabando la voz senior! a disfrutar de estos maravillosos concursantes que lo han dado todo en la vida y no han dejado sentir la música!! Qué tal tu Semana Santa? Saludos a los clubes de fans de Francia en estos momentos duros. https://t.co/4vo2juiGjS Seguimos sumando conciertos al #Tour2019db!! Sanlúcar de Barrameda, nos vemos el 3 de agosto, os espero!! https://t.co/HJppGnC08G @magnoliabis54 Así estamos todos en casa @anamari_db 200 ańos de construcción y en una tarde destruida! Qué locura. @isamar_zgz Sí, yo también he escuchado, pero hay que esperar hasta el final para saber la realidad de todo este asunto. Qué. locura Es muy doloroso ver estas imágenes!! Además coincidiendo con Semana Santa! Que habrá pasado realmente? https://t.co/J330c1rHZP Feliz cumple @LuisFonsi fonsioski!!!! Gracias a los clubes por hacer estas cosas tan bonitas #anamari https://t.co/IMB9EOxppS Buenos días. Nosotros hemos pasado por el plato de la voz. Es para mí un placer volver de nuevo. #lavozsenior será tu programa favorito, y te enamorarás con las historias de todos los participantes. #domingotrabajando https://t.co/GJkaKTU96C @vanessa_budha @rauliano1 Totalmente de acuerdo, ese trabajo es amor puro, es cuidar aquellas personas que lo han dado todo en su vida y se merecen todos los cuidados y amor del mundo @lola_almeria5 @RosannaZanetti Sí, muy simpático este regalo 💝 @Dialtalcual Gracias amigos de Cadena Dial porque siempre estáis ahí conmigo cerca @rauliano1 Lo sé Raúl, pero para eso están las entrevistas de trabajo para saber si las personas están cualificadas o no. Un abrazo 🤗 @Jessidb_46 Sí, he visto las dos temporadas, estoy deseando que llegue la tercera! Para todos aquellos que descansan y tienen vacaciones, que paséis una maravillosa Semana Santa! Lo mereceréis! Muchos besos. Ayer vi la historia terrorífica de una residencia de ancianos que maltrataban a las personas mayores, no se me ha quitado de la cabeza! Cuanta maldad. Lo primero que me pregunte, tendrán abuelas, madres e hijos estas personas? Espero que lo paguen caro! Porque a un amigo se le quiere con el alma!!! @JesusCalleja feliz cumpleańos!! Te echamos de menos! https://t.co/sUSfzMwmAm Buenos días a todos!!! Hoy será un gran día! Un abrazo!! @lauralmeria Saecia pues pronto!! Ja ja ja ja ja ja 😂 @DBSwitzerland Tengo muchas ganas de compartir con vosotros también. Será un sueño @javidbastur @RosannaZanetti Muchísimas gracias a todos por los buenos deseos.Estamos muy bien, en casa disfrutando de unos momentos fantásticos. @mamencaye Buenos días, por supuesto que todo tiene solución y así es como tenemos que ir por la vida, con optimismo. Estamos felices, vaya dos noches que vamos a tener en París y en Bruselas, ambos conciertos gracias a vosotros sold out!! Besos https://t.co/tGXzylhAR4 Primero fue París y ahora Bruselas… las buenas noticias nunca vienen solas. Gracias por estar ahí!! https://t.co/u5Zqr04G2s @anamari_db @RosannaZanetti Muchas gracias por este pequeńo gran homenaje! Os quiero por todo lo que hacéis! Estamos felices! Ya solo faltan 3 días para que llegue a los cines #ElParqueMágico, os va a encantar!! Perfecta para ver en familia!\n@paramount_spain @ParamountPics https://t.co/c6th2ivWrt Solo queda 1 semana para el estreno de este peliculón!! No os la podéis perder! #ElParqueMágico @paramount_spain @ParamountPics https://t.co/iuz9juNCNO te traigo un #tb de los buenos!! En la grabación de mi videoclip dígale!!!! https://t.co/ROVHY5DBYE espero que os guste!! https://t.co/6txWyGTGYe https://t.co/brpPml04me @TvBandamax @db_collages @ElRecodoOficial Ole y ole!!!! Viva MEXICO! Me encantó hacer esta colaboración! Os quiero amigos. @vanessa_budha Ahi he estado yo, es alucinante Ramses II @susy601 @RosannaZanetti Muchísimas gracias a todos por los buenos deseos. @kike_calleja Igualmente amigo mío, te queremos mucho @Aqualung_Spain Esta es la que yo tengo, qué ganas tengo de volver a organizar todas las cosas para un buceillo bueno!!! Para toda mi gente, os deseo una fantástica semana y un mes de abril mágico para todos!!! Os quiero!! @AlejandroSanz Sin ninguna duda compadre, que ganas de cantársela, apenas unos días quedan!! Un besazooooo! @JaviYMar @CADENA100 Gracias Javi y Mar por estar siempre tan pendientes. Como me conocéis, estoy deseando que llegue este momento tan esperado. Os quiero mucho! @robert_calvo @OndaCero_cat @Teatre_Condal @onyric_musical Muy agradecido con Mariona, espero que todo el mundo se lo pase muy bien en el concierto. Os aprecio @Buenafuente @silviabril @paramount_spain Gracias a vosotros, me lo he pasado en grande @Aztecauno Os quiero amigos! Hoy es domingo de recomendación. Qué bonita canción os habéis marcado!!! @AlejandroSanz @Camila_Cabello aquí la estoy cantando por los pasillos de mi casa! Besos! Quien es tu persona favorita? https://t.co/NXM0QHLwej RT @SunandStarsFest: Es un torbellino en el escenario y uno de los artistas españoles con mayor éxito internacional.\n\n@davidbisbal brillará… El parque mágico ya está abierto!!!! Espero que os guste la película! https://t.co/SRtIgV1rqB gracias Madrid! https://t.co/eG6NNIuxVw Muchísimas gracias a los medios de comunicacion en España por todo el cariño, nos vemos mañana en el cine. Os quiero. Espero que os guste @wonderparkmovie @paramount_spain https://t.co/lZlyzt1kpL Que os parece este #TBThursday https://t.co/ctQ7gahAPv https://t.co/xPWNli379x Ayer terminaron los cuatro conciertos con Endesa de esta manera, con el cariño del público de Valencia!! Os deseo un maravilloso jueves! https://t.co/4UEU473TF4 RT @elfestival: 14 años esperaron sus seguidores para verlo nuevamente en Viña... y qué emoción de @davidbisbal al recibir su Gaviota!! Oja… @fanclubdbfrance Tenéis 2 perspectivas A por el lunes con Alegría!!!! https://t.co/p4VyIDXEHX https://t.co/8uVmfYllyh @jesusismael1234 Gracias amigo Jesús! @Yoa_naiala @RosannaZanetti Estoy muy contento, porque si algo se merece Rosanna es este carińo que ha recibido de estas maravillosas amigas! Muy afortunado! @apolomusical @MMAR_BISBAL Verdades!! @rauliano1 Así, tachando y ańadiendo! Que bien! @rosalabisbalera Menudas nińas revoltosas que tenemos en la casa ja ja ja ja ja ja ja 😂 @melirodo @RosannaZanetti El seńor mira a Rosanna! 😂 normal, lo guapa que está. @anamari_db Una realidad que me encontré en este mundo! Así es. Por eso es tan importante hay árelo de la manera más honesta. Feliz Domingo a todos! Que lo paséis bien a todos aquellos que estáis descansando y mucha fuerza para los que trabajáis! Hoy trabajo, pero me lo voy a pasar muy bien también! Os quiero. El día del trabajador se debe celebrar todos los días! RT @PepiyFernando: VIDEO! @davidbisbal Red Carpet Photocall at the Wonder Park Premiere at the Regency Bruin Theatre in Westwood  https://t… RT @DBBelgica: Concert @davidbisbal\nBruxelles 16/05 \n\nLES TOUTES DERNIERES PLACES EN VENTE \n\nDE ALLERLAASTE PLAATSEN VANAF NU IN VERKOOP\n--… RT @bisbalpress: Nuestro TBT homenaje al shooting de las fotos para Corazón Latino de @davidbisbal y a @JoseIrunFoto https://t.co/jzhKaaNK6L #TBT Hay fotos que nada más verlas te hacen viajar en el tiempo. Aquí con mi amigo Jose Irun en la sesión de fotos de mi primer disco corazón latino y mi videoclip dígale. https://t.co/fJarUOJELv Madre mía! Qué momento!! Qué canción y con la mejor compańia! https://t.co/TbcSw0el0X @BettyanaH Después de haber cantado en el hipódromo de Palermo, ya estamos pensando cuando volver a Argentina y donde cantar!! Escucha #Perdón con @Greeicy_rendon en la Playlist #LatinHits2019 en @DigsterPlaylist !  \nhttps://t.co/n0DE9Yjfjs https://t.co/cmyvOUtVT9 Estáis preparados? El #Tour2019db aumenta día a día, y mis ganas de encontrarnos también!! Muy pronto muchas más fechas!! https://t.co/vyCcjXVA3g Feliz día a todos los pepes!!!!! Feliz día del padre! Aquí entre dos pepes! Con mi padre y mi abuelo! https://t.co/UlLh44QGFn https://t.co/tb5sWEQg7e En el Tour 2019 no podía faltar Madrid, y un escenario tan maravilloso como Las Ventas!\nLas entradas a partir de mañana en https://t.co/zIJMhek0Sm https://t.co/PE5kE0B1yK Espero que disfruten de un maravilloso domingo!! Tantos kilómetros acumulados, tantas horas fuera de casa hasta que llega el premio más grande! Os quiero! https://t.co/YIA06Pw0G0 RT @vinilo_negro: Hoy hace 1 año @davidbisbal y @SebastianYatra publicaban su canción A Partir De hoy. El single sería un éxito en España,… RT @PepiyFernando: VIDEO! Wonder Park - @davidbisbal - Tu Eres La Magia https://t.co/XCZrcOHOhe @wonderparkmovie Feliz sábado, que ganas tengo de que se estrene la película en España. Muchos besos. https://t.co/WYRjmR7eaG Me ha encantado el titular de “el triunfo de la música” pues al final entre todos hacemos que gane la música! Buenos días y feliz viernes! https://t.co/6BoHaHJTRo Esto fue justo antes de cantar para darnos suerte entre los 3! Momentos muy bonitos! https://t.co/TosgDvRiFP @bisana68 @Cadena_Dial @Greeicy_rendon @SebastianYatra Buenos días a todos!! Qué gran noche!!! Para musica!! Como he disfrutado de todos mis compańeros, del público y del escenario!  Os quiero amigos de @Cadena_Dial gracias por el premio!! https://t.co/Qxr35aUkeJ Gracias Rafa por tu carińo siempre!! Que bien lo hemos pasado!! Te queremos! https://t.co/pr6NLRES47 RT @Cadena_Dial: 🔥🔥🔥 @davidbisbal #PremiosDial #ElCorazóndeNuestraMúsica https://t.co/8tN3JG2bEW Te has enterado ya???? Vuelvo a cantar en las ventas de Madrid el próximo día 6 De julio!!! Sorpresas!!!!!!!!! Qué bien!! https://t.co/1AxxGVAeIc París, allá vamos, nos vemos en el @OLYMPIAHALL el 17 de mayo. Gracias por estar siempre ahí!!\n#SoldOut https://t.co/OAJIXyYp72 @cf_jesuscalleja @JesusCalleja Eso digo yo, @JesusCalleja Y tú para cuando amigo?? @rosalabisbalera Pero Rosa hija, tienes que ir poco a poco. No tienes que hacer los cinco minutos todos de golpe. @Malenimulle Me imagino que será cuestión de sentirse cada vez mejor conforme van pasando los días. @luisamx No se hace en ajustes Luisa, tienes que hacerlo tal y como está. Animo! En 2 min puéden pasar muchas cosas! Ja ja ja ja ja ja 😂 día 16 #plankchallenge hay que seguir el programa hasta completar el día 30!! Animo! https://t.co/O7mm9jrDYx Pronto nos veremos en la premier de nuestro país. Estoy Super contento de poner la voz para todos los países de habla en castellano y sobre todo fue un sueño estar presente en la Premier americana. https://t.co/MKJWC71YlT @anamari_db @francysdjmusic1 Recuerdo aquel día desastroso de tanto dolor en nuestro país, hoy se cumplen 15 años y todavía se siente el dolor de los familiares y las víctimas. En ese momento yo me encontraba grabando mi videoclip oye el Boom en mi querida Venezuela 🇻🇪 @lorena_vazquez @ArusityslaSexta Gracias a vosotros por haber estado en la premier de Wonder Park. Mi primera vez en viña del mar es imposible de olvidar, prácticamente todo empezó ahí en Latinoamérica, una gran oportunidad! Muchos besos! RT @bunburyoficial: Ningún mar en calma\nhizo experto a un marinero\ny mis cicatrices son\nde geografías varias Con los rizos al viento! Espero que paséis un maravilloso domingo. Nosotros en horas tenemos el estreno de @wonderparkmovie #TuEresLaMagia https://t.co/nXAwGOZgd3 https://t.co/INNV9wT2oA Un poquito de deporte para combatir el cambio de hora Y en breve comenzamos con los medios de comunicación!!! @wonderparkmovie Y vosotros, cómo lleváis el fin de semana? Saludos desde Los Ángeles. https://t.co/LyWYFDhnqX México, Europa y España... El #Tour2019db ya tiene sus primeras fechas. Pronto muchas más!!\nAtentos a https://t.co/zIJMhek0Sm https://t.co/XNbDIsiKeU Igualdad hoy y siempre. Y aunque aún queda camino por recorrer, hagámoslo juntos. Feliz Día de la Mujer! https://t.co/NNXC8rb7tW Dentro de la gira europea también visitaremos Suiza en julio. Vamos a disfrutar de una gran Latin Night el 27 en el LakeLive Fest en Bienne!! https://t.co/dmtsqeMdyM https://t.co/A3u9JffsuH Acepto el reto de @alo_oficial y también empiezo en el día 11\nNomino a @SebastianYatra @albertocontador @JesusCalleja y todo mi club de fans a participar. #Theplankas https://t.co/aUVYUZJhlK Terminas de trabajar!! Y te encuentras con esta noticia!!!!! Vamos a darle cańa bailando!!!!! #Perdon https://t.co/S1LJQDKSQs @Vevo https://t.co/UN9eCCRhR4 RT @Vertele: El 'Ave María' de @davidbisbal cantado por Marta Sango, 'La mejor canción jamás cantada' en los 2000 https://t.co/fiZrPCZlQt Feliz cumpleaños a todos y espero que paséis un domingo maravilloso. Nosotros como ya adelanté ayer, estaremos grabando la voz Kids una vez más. Que ganas de que lo veáis. https://t.co/gDr3z7hwGt Vamos a por el sábado!! #ElParqueMágico #Wonderpark https://t.co/2fmFVEya7b Te felicito marta por tu interpretación, has llevado esta versión de AVE MARIA a lo mas alto. felicidades. https://t.co/eqEMr3ix7Z La verdad es que este segundo single también ha funcionado muy bien, qué bien lo pasamos cuando la cantamos en directo. https://t.co/5MBzl6EmkR Dentro de poco tenemos el estreno de la película, cuando la veáis, vais a flipar. Os quiero. https://t.co/5Jx69eVtKi RT @tve_tve: .@davidbisbal marcó un antes y un después con su 'Ave María', todo el mundo lo conocía. ¡No podía faltar en #LaMejorCanción00!… Hoy comparto con vosotros “Tu Eres La Magia”, la canción principal de la Pelicula 'El Parque Mágico', #Wonderpark!\nHa sido un privilegio poder trabajar con los amigos de @paramount_spain @ParamountPics.\n#ElParqueMágico\nhttps://t.co/Y1p8p8B5Ym https://t.co/kf6AF66tPt Feliz día dé Andalucía!!!! He llegado a casa en un día muy especial!! Que paséis un gran día!!! https://t.co/vqvua7kSoc Llegaron a casa!!!!! Intactas!! Todavía sońando con @elfestival gracias a todos!!!! https://t.co/TFA1BYTvUo Fue una gran sorpresa y una emoción enorme recibir este gran reconocimiento del público! lo que sí sabía es que se me iba dejar la piel, el alma y la voz en el escenario de la quinta Vergara! Os quiero en el alma, ojalá no pase mucho tiempo para que la cuarta vez se haga realidad https://t.co/wYjASOTgFB Después de la prueba de sonido, llegué al Hotel y me encontré con un grupo de gente maravillosa que me encantó saludar!! Viva @elfestival y viva @vinadelmar con muchas ganas de subirme al escenario esta noche. https://t.co/CuK7Mv6yMA Me ha encantado la actuación de mi @RAPHAELartista qué gran trabajo de la filarmónica de Chile! La unión perfecta!! Que ganas de mańana! https://t.co/IvGzf2M1as Qué alegría estar ya en Chile. Mañana rueda de prensa con los medios de comunicación!! https://t.co/TFnpKVt9lH De aeropuerto en Aeropuerto! https://t.co/qxxHwHmZvQ RT @anamari_db: El gran @davidbisbal no ha podido estar presente en @VenezuelaAid pero ha dejado un gran mensaje.\n\nActualmente #Venezuela s… Visteis lo que me sucedió en el concierto de Los Ángeles! https://t.co/ZCI8fDm31d Momentos especiales que pasan durante un concierto!! Os quiero!!!! https://t.co/gFsj4gJ4Ej Gracias amigos de @juegaterapia siempre con vosotros!!! os quiero! https://t.co/vXDp4q78rq RT @AlDiaDallas: 📍| #Dallas| Esta noche @davidbisbal trajo por primera vez su gira al @HOBDallas 📸 Omar Vega. Más videos en nuestros storie… This is Houston!!!!! https://t.co/klAEDhGHRQ Hoy estamos en Houston! Pero esto es lo que se vivio ayer en Lake buenavista! Os quiero!! https://t.co/cGSAjTMltn Miami, me sacas la lagrima y la derramas en esta tierra que tanto amo. https://t.co/nFMIAARbof RT @Silestone: We are glad to participate in the #TopsOnTop event for 2019, our friend @davidbisbal USA Tour! 🇺🇸🎤🎶 https://t.co/LoPaGdRpgx Vídeo capítulo de Silver Spring ya llega!!!!!!! About last night in Silver Spring!!! https://t.co/0yMeInNOle RT @despiertamerica: ¡Los sueños sí se cumplen! @jessivaleriblog sorprendió a una fanática de @davidbisbal y hasta la invitó a su concierto… Feliz día mundial de la radio! Os quiero! https://t.co/u1yZakIXIU Another great night at the Irving Plaza in New York!!! Gracias por estos momentos que jamás olvidaré!!!! https://t.co/vN6iIqv6rO https://t.co/OC3fH9z0a6 Feliz y contento de volver a cantar en New York. Hoy será una noche muy especial. Queréis vídeo en vivo??? https://t.co/uBHNhVGDbb Aún estás a tiempo de conseguir una entrada doble para venir a los eventos que estoy preparando junto a los amigos de @Endesa. Date prisa, solo tienes que entrar en https://t.co/x6z84xT79Z ¡Te espero! #Endesa #TempoConBisbal https://t.co/4lM7rMUGVp First show!!!! Chicago!!!!! Next stop New York!!! En el concierto de Chicago, la próxima parada New York. https://t.co/1uSs7NuLfL https://t.co/TCfJCmM11e Hay que estar atentos, será una gira llena de festivales. https://t.co/9qIRzvcmnw La gira en 2019 sigue creciendo, y volver a Barcelona siempre es una motivación especial. Que alegría pensar que nos vemos el 9 de Junio en el @PoloMusicFest . \nAquí podéis conseguir las entradas:\nhttps://t.co/vtPP5pWlzj https://t.co/OkW6rzXprp Lo pasaremos muy bien! Estamos muy motivados! https://t.co/YDXx5Ix0GQ Ya estamos en Chicago. Esta noche será muy especial y venimos con un repertorio muy fuerte lleno de energía y de sentimiento.  https://t.co/lwQeZgx37N https://t.co/0Dn8uq8jim Sé que Tomatito no es muy dado a participar en programas de televisión por eso soy consciente de la suerte que he tenido al trabajar con él en @LaVozAntena3 senior! Dejará a todos con la boca abierta! https://t.co/pQ91fEAYbB viva Almeria. https://t.co/wrM7YoDlYB RT @dbcordobasma: Agenda de Nueva York: Los eventos que no te puedes perder.💃🕺🎶\n@davidbisbal 12 de Febrero en IRVING PLAZA! https://t.co/yv… RT @wiltern: LA! Have you snagged your BOGO tix to see @DavidBisbal on Feb 20th yet? Limited supplies remain, so hurry and grab yours now a… Ensayando!!!!!!! La gira ya está aquí!!!! #silencio https://t.co/I3HCta6QAF RT @FillmoreSS: Our favorite Spanish heartthrob @DavidBisbal is coming to Silver Spring on February 13th, just in time for Valentines Day!… Amigos de Chile! @elfestival cuál es para ti la canción que no debe faltar el próximo día 26 de febrero?? @vinadelmar @UMusicChile https://t.co/2BsLBLbjZA https://t.co/ZrF6UrywvW Quieres venir a los eventos que estoy preparando junto a los amigos de @Endesa ? Conseguir entradas es superfácil: Solo tienes que entrar en https://t.co/x6z84xT79Z \n#Endesa #TempoConBisbal https://t.co/7Nzt0M0cks Vamos a divertirnos, ¿queréis 2 pares de gafas como las mías para celebrar San Valentín con vuestras parejas? Participad con vuestras mejores respuestas! 😎\nhttps://t.co/9Lnsj74oBk Muy pronto tendremos aquí la película! Pero la canción saldrá antes 😁 #WonderPark https://t.co/434V8o3rtO 💯 % Almeria con mi Tomatito! https://t.co/rPFUecJaJx Amigo José Herrera, Felicidades por este @PremiosGoya merecidísimo. Ha sido un placer hablar contigo y felicitarte personalmente! Ahora a por el largometraje!! Viva Almeria. @Costa_Almeria https://t.co/dwEnGuRP0O Felicidad absoluto! @Los40 gracias por la confianza! Gracias a la gente por pedir la canción, bailarla y cantarla!!!!! Os quiero! https://t.co/LGNEZLhJde #2019citaenMairena… Tenemos una cita muy especial, amigos, os espero a todos en nuestro concierto de Mairena el 6 de septiembre. Ya podéis conseguir vuestras entradas en: https://t.co/QBMunXh8fo https://t.co/G5NLQzz9ZV RT @Teleton: El romanticismo se hizo presente en la #Teletón 2018 cuando @davidbisbal conquistó a todos con sus bellas canciones 🎤😍👏 Revive… RT @wonderparkmovie: Meet Peanut (@NorbertLButz), the splendiferous mascot monkey of #WonderPark! 🎡 See Peanut bring the park to life when… Nací, crecí y mi vida es Almeria. https://t.co/MViwQM80ym No os podéis perder los eventos que estoy preparando con los amigos de @Endesa. Si queréis conocer cómo conseguir una entrada doble entrad en https://t.co/x6z84xT79Z ¡Os espero! \n#Endesa #TempoConBisbal https://t.co/bBcOkpH75p RT @PepiyFernando: INTERVIEW @davidbisbal Says 2019 US Tour Will Be Powerful #BillboardLatin sat down with the “A Partir de Hoy” singer to… RT @loudieapp: Spanish singer, songwriter, and actor, @davidbisbal who gained his initial fame as a runner-up on the interactive reality te… RT @Erica__db: Me los quedo todos @davidbisbal\nLos nuevos GIBHY STORIES\nme encantan 😍👏\nYa queríamos algo así ahora falta WhatsApp 😛 https:/… Tenemos que seguir adelante, pero la verdad es que es una verdadera pena, os podéis imaginar cómo están esos padres con estas dos perdidas tan seguidas?. El amor de un hijo es lo más grande que uno puede sentir!! https://t.co/k5IOCaJu0C Todos lloramos por Julen, nunca perdimos la esperanza pero al final no pudo ser. Para todos los familiares y todo el equipo que trabajó día y noche mi abrazo más grande! Desde la grabación de La Voz Kids y acompañado de estos grandísimos amigos queremos enviar todo nuestro apoyo y fuerza a Julen, a su familia y a todos esos héroes que llevan días luchando para llegar hasta él. https://t.co/xNHCKyvZVx https://t.co/dtU6SN4KMB RT @BisbalGuatemala: Reposted from @lamusica  -  🙏🏽 AVEMARÍA 🙏🏽 Llega @davidbisbal a #LaMusicaApp con su rumba latina y para hablarnos de s… RT @FillmoreSS: Spanish heartthrob @DavidBisbal is coming to Silver Spring on February 13th! 😍 Grab your tickets now: https://t.co/tH18HVv2… RT @bisbalpress: Nuevo vídeo promocional de Sabores Almería con David Bisbal https://t.co/7Nd43eRa8C vía @YouTube @davidbisbal RT @LaVozKids: Nuestro @davidbisbal cuenta con una artista de lujo para intentar hacerse con el mejor talento en #LaVozKids 👏🏽 ¡Bienvenida… Me lo he pasado muy bien en la presentación del video promocional  de @saboresalmeria @dipalme_almeria gracias a todos por vuestro cariño. https://t.co/63RZNsj5o0 @Costa_Almeria https://t.co/htoqkijF3q RT @bisbalpress: .@davidbisbal sabe muy bien cómo proyectar su voz ... su carrera está llena de interpretaciones que le ponen a muchos los… Echo de menos esta hermosa tierra. Felicito al santo patrón de San Sebastián, tierra que amo con todo mi corazón feliz día para todos... imágenes de #tamborradainfantil https://t.co/aUYR6hElEv Para mi gente de Colombia 🇨🇴 es de un dolor inmenso que personas inocentes paguen las consecuencias del terrorismo! Mucha fuerza para los familiares y amigos de las victimas. Ha sido espectacular mi vuelta a Despierta América. Un programa que me dió la oportunidad en el año 2003. Jamás olvidaré todos estos momentos que hemos recordado juntos. @despiertamerica https://t.co/ykfEIjWihL Imagínate un niño Ramón, con dos años solamente. Yo me muero te lo juro de la tristeza! https://t.co/wam5OGW6Ip Todos los días que veo las noticias y escucho sobre la búsqueda del pequeño Julen, se me encoge el corazón!! Mi apoyo a sus familiares! RT @Univision34LA: .@davidbisbal regresa al sur de California para presentar su nuevo tour https://t.co/oJfYD1GXXN https://t.co/lP17KBFhRN Con un vuelo Super duro después de todo el día de ayer trabajando en Los Ángeles, pasamos la noche en el avión y llegamos a Miami. Fuerza para todos!! Seguimos con la promoción! https://t.co/ro6OonS8MA Cada vez queda menos para visitar Madrid, Valencia, Logroño y Vigo junto a los amigos de @Endesa. Hemos preparado un evento muy especial al que estáis todos invitados. Solo tenéis que seguir las instrucciones de https://t.co/x6z84xT79Z \n#Endesa #TempoConBisbal https://t.co/4T0rg4Pst5 Desde Los Angeles!! Seguimos de promoción!!! La gira está a la vuelta de la esquina! Usa tour!! https://t.co/lwQeZgfrJd https://t.co/AhBlo0eCiq No te pierdas toda la promoción que estamos haciendo en Los Ángeles. https://t.co/S1LJQDthrS https://t.co/APKDWHtxep Ja ja ja ja ja ja ja ja ja ja ja ja ja ja ja ja ja ja ja ja ja ja , divertida, os mando un beso. https://t.co/E11oA8Ab0S He subido a mi canal de YouTube un #tb de más de ocho minutos haciendo ejercicios de calentamiento antes de cantar en uno de mis conciertos en Miami. Estamos hablando del año 2003 https://t.co/U9TebdVFuz espero que os guste!!! https://t.co/tCRydXnBpX RT @ElRecodoOficial: El sentimiento es mutuo amigo @davidbisbal gracias por sumarte a este proyecto y engrandecerlo con tu talento 👏🏻👏🏻 Vam… Quiero agradecer con toda mi alma mi amor por México y su arte! Gracias a mis amigos de @ElRecodoOficial por confiar en mí invitarme a cantar en su canción #GraciasPorTuAmor @monitorLATINO @furiaoficial @UniversalMusica https://t.co/XNtuWyWNMo Estamos más que felices!!! Viva @ElRecodoOficial viva #MEXICO y viva la música latina. https://t.co/Un3PTXlFYt ¿Aún no te has enterado? Muy pronto estaré en Madrid, Valencia, Logroño y Vigo en un evento muy especial con los amigos de @Endesa . Si quieres venir entra en https://t.co/x6z84xT79Z #endesa #tempoconbisbal https://t.co/qDsXePsQ3R RT @40GlobalShow: Es un hombre de un éxito increíble y todavía le sorprende que otros compañeros de profesión le reconozcan ¿De quién habló… RT @dbfanclubchile: Estamos Listas ??? \nSii Cap. Estamos Listas 😃😃😃 \n@elfestival \n@davidbisbal 🎵🎶🎤 https://t.co/4JobbBXar9 Llegamos a 80M gracias a todos vosotros!!! Os quiero!! Espero que estéis disfrutando de un maravilloso día de reyes!!! https://t.co/rVzdV63XWW https://t.co/S1LJQDKSQs https://t.co/1ZNW54paBX Vienen muchas canciones nuevas este año y estoy deseando grabar el videoclip de las mismas que ya tengo grabadas. https://t.co/PwjLEYYrOl Muy bien, me han dado tranquilidad, paz y salud, lo demás lo pones tú... así que animo a mi gente empezando el ańo con fuerza. https://t.co/lusDq6DDHt De verdad, no sé cuántas muertes más deben producirse para prohibir las armas. Qué horror y que pena. Wao, tendríamos que compartir algunas cosas entre nosotros https://t.co/75cjkUDmtK Mi gran ídolo #miguelindurain encontré esta carpeta que tiene más de 20 ańos! Una reliquia de mi adolescencia. https://t.co/hyOjyPUqXx https://t.co/nphfWKWjO6 Que felicidad amigo!!! Deseando volver a coincidir contigo! https://t.co/qHvemQlpKE Que notición mas bonito!!!!! Gracias a todos!!! https://t.co/k45vGvUv6B Buenos días, tienes mucha razón por eso siempre tenemos que pensar y poner nuestra energía en lo que realmente valga la pena. Mucha fuerza! https://t.co/sJ81UhOaCv Què buen bailecillo compañeros. Un abrazo y feliz año nuevo. Os aprecio. https://t.co/cCtM5quYvx RT @Vevo: .@DavidBisbal came back with those love ballads his fans have always known him for. Check out these live performances of \"Perdón\"… RT @SpotifySpain: Tus primeras palabras del 2019 empiezan así, y lo sabes... https://t.co/S5q8SNArFC https://t.co/mBR1N6b4MP Qué felicidad!!!! Feliz ańo 2019!!! https://t.co/Ksn9l9jhTM https://t.co/KoznG4Nx4l Como lo estáis pasando antes de que acabe el ańo!!!? Ja ja 😆 ja ja ja ja ja ja 😂 feliz 2019! https://t.co/EM0nQeytpk Lo que haces márca la diferencia y tienes que decidir qué tipo de diferencia quieres marcar!!! Un abrazo a toda mi gente. Con mi Manuel y mi Pablo!! Instantánea que se quedará grabada en el corazón para el recuerdo. https://t.co/jozrIHSAhq https://t.co/jEwWgtH1VY @Martaulas Sé que estoy un poco desaparecido por la redes sociales ja ja 😆 , pero es la única manera de disfrutar en familia de esta maravillosa navidad.Que disfrutéis vosotros también. Buenos días a todos!!!! Espero que estéis descansando mucho y disfrutando de vuestros familiares. https://t.co/HG1maydzrU RT @LiveNationLatin: @DavidBisbal #TourUSA2019 llega a tu ciudad en Febrero\n2/10 Chicago\n2/12 New York\n2/13 Silver Spring\n2/15 Miami\n2/16 O… Muy preocupado por el tsunami que ha azotado de nuevo a Indonesia. Mis condolencias con las víctimas y sus familiares. Ayudemos a los niños afectados por las emergencias a través de @unicef_es Haz tu donación en https://t.co/zryKiUDdnq Foto Semi/AFP Services RT @Vevo: .@DavidBisbal came back with those love ballads his fans have always known him for. Check out these live performances of \"Perdón\"… RT @SomosVevo: .@davidbisbal te tiene una canción por si le necesitas pedir \"Perdón\" a alguien, o si tienes el corazón roto y lo quieres ol… Por fin ya están aquí los vídeos que grabramos en Nueva York con los amigos de @Vevo aquí os dejo #APartirDeHoy   @SomosVevo https://t.co/6wVAlJ5w4s https://t.co/M63ZGIh0Hs Qué felicidad, viva México y viva su arte!!! https://t.co/LsXzuoZRQl Maravilloso #tbt con el maestro Armando Manzanero https://t.co/xj6T7sYLd4 https://t.co/1q9xLYiRzg Vaya cumpleańos guapo!!!!! @AlejandroSanz gracias por estos momentos compadre!!! https://t.co/BzW0sfheqp https://t.co/VfMZRTGIpd Buenos días, hagamos que termine el año de una mejor manera. El 2019 tiene que ser mucho mejor que el anterior en todos los sentidos. Un beso muy fuerte para tod@s https://t.co/qJn10tfHU0 Estamos muy tristes en casa por el asesinato de Laura Luelmo Y queremos mandar un abrazo muy fuerte a todos sus amigos y familiares en estos momentos tan difíciles! @Dani_Merono Ja ja ja ja ja ja 😂 que alegria!!! Un saludo a todos!!!! Gracias a todos por los votos y la confianza! https://t.co/NPBAMFWOyY RT @TvBandamax: \"Gracias Por Tu Amor\" de @ElRecodoOficial Ft. @davidbisbal está en el lugar 2🤠 https://t.co/qguaCVXxcm Que carińosa Nala!!! https://t.co/2ABgIYJnvZ https://t.co/VBEx4340fU Amigos de @CorazonTVE ja ja ja ja qué preguntas más difíciles. La primera pregunta no sabría ni contestarla yo, de camina y ven ni siquiera yo me acuerdo de la letra ja ja ja ja y la tercera! Mi @RosannaZanetti tienes razón! Se llamaba bulería ja ja 😂 que divertido ha sido. https://t.co/lyRxsHMxc7 Se puede ser más buena gente!???? Mis amigos del @BuceoCrised te lo ponen fácil!! Ser solidario nunca fue tan divertido!! además te conviertes en un gran buceador!! https://t.co/MRIeeI5rit Sorpresa!!!! Después de nuestro concierto en París viajamos a Bélgica 🇧🇪 la gira sigue creciendo! 2019 https://t.co/9m040yrV0I Uy!! Esto me viene genial para preparar el mejor repertorio para @elfestival muchos besos https://t.co/1lGk0RDbuq @elfestival Gracias por vuestro cariño, vuelvo con mucha ilusión. Muchos besos a mi gente de Chile. No os podéis imaginar las ganas que tengo de cantar en este maravilloso lugar al que tanto le tengo que agradecer a mi carrera. Muchos besos. Nos vemos pronto. https://t.co/a7olLeJGZ5 No cuenta las veces que caiste, sino aquellas que saliste ganador! @NickyJamPR #recomendado https://t.co/tKGiogmPnU Locura en @LaVozAntena3 https://t.co/fSVJWDuweB https://t.co/2EsqAHDEtp Hoy es viernes y tu cuerpo lo sabe!!!!!! Ja ja ja ja ja ja 😂 https://t.co/Cl7qA5U2GB Qué maravilloso #tbt cantando en @elfestival 2005 escuchad al público cantando dígale!!! https://t.co/6CE8EbKyPi https://t.co/4hw8PuN9fI Qué feliz estoy!!!! Volvemos al @elfestival que ilusión tengo!!! Estoy emocionado!!! #VIÑA2019 https://t.co/4Eki8S7Kwx https://t.co/bHb06X1XOA RT @OLYMPIAHALL: Sept ans se sont écoulés depuis sa dernière représentation à Paris. @davidbisbal est enfin de retour dans la capitale fran… La suerte la ponen ellas con el trabajo duro y bien hecho!!! Felicidades campeonas!!!! Buenos días a todos! Nosotros recién aterrizamos de Chile 🇨🇱 hoy grabamos audiciones 4 de @LaVozAntena3 con los Kids. https://t.co/N0W3LqVKA9 Ha sido un honor cantar otra vez en Chile, en este maravilloso Estadio Nacional, con los amigos del @Teleton Creo que nos vamos a ver muy pronto. Arriba Chile os quiero mucho. Vuelvo a España a grabar La voz kids, pero se queda el corazón. https://t.co/dUtNF1Es3B la Sub-17 femenina campeona del mundo  #TodasAporElMundial. Felicidades chicas que orgullo para España. OLE. https://t.co/QUAFBV9ycY RT @TvBandamax: \"Gracias Por Tu Amor\" de @ElRecodoOficial ft. @davidbisbal esta en el 2do lugar 🙌 https://t.co/2R5v8M2Psd Ya estamos en chile 🇨🇱 para el @Teleton traigo un repertorio genial!!! Besos! https://t.co/qWikAHC3zS Que guay lo pasamos!!!! https://t.co/soMszmvr8G https://t.co/3yCVVV5hSn RT @bisbalpress: Las entradas para el concierto de @davidbisbal en Marbella (Starlite) el 6-agosto-2019 YA están a la venta. Link: https://… Ahora que??????? @LaVozAntena3 vaya equipazo!!!!! https://t.co/LvD5FdxW1q RT @bisbalpress: Perdón de David Bisbal, Greeicy https://t.co/4Qi53Q8CDZ #NowPlaying @davidbisbal Un honor repetir!!!!! Lo pasaremos espectacular el próximo verano!!!@StarliteFest https://t.co/vyKsoIp48s Qué ganas tengo de que llegue el mes de abril. Será sin duda un mes muy especial!!!! https://t.co/MsjXTTHEGO https://t.co/b463PaKB28 Con muchísimas ganas de regresar a Chile 🇨🇱 https://t.co/0rVNzhkhpC RT @bisbalpress: Buy tickets for David Bisbal USA Tour February 2019 (Live Nation) https://t.co/lNt0UmkBM6   - Compra ya las entradas para… Feliz semana a todos!!! Esta semana empezamos a grabar @LaVozAntena3 con los kids y viajaré a Santiago de Chile 🇨🇱 para apoyar a toda mi gente con el @Teleton os quiero https://t.co/W5M17fqxbL Qué felicidad!!! Un abrazo amigos!!! Buen fin de semana! https://t.co/TwtUEijwBi RT @dbisbaluk: Videodiary - David Bisbal en el Hipódromo de Palermo (Buenos Aires) https://t.co/t3hAe454C4 vía @YouTube @davidbisbal https:… RT @musicagran: Una vez mas el cine y música se unen, #TueresLaMagia de la película #ElParqueMagico se estrena el 12 abril estará en el cin… RT @Del40al1_es: #16 (+4) @davidbisbal &amp; @Greeicy_rendon PERDÓN 🙏🏼\n#Del40al1CocaCola https://t.co/eS0pOnT8qo https://t.co/adJ4LqQKhM RT @musicagran: @davidbisbal @antoniorozco cantando por los chichos, tengo un amor en la calle... Felicidades Antonio. Un abrazo a todos. @… Happy thanksgiving!!!! Enjoy this beautiful day!! Feliz día de acción de gracias espero que disfrutéis de este hermoso día mis amigos de Estados Unidos 🇺🇸 https://t.co/iqvuLpv0cu RT @bisbalpress: Tu mejor compañía cada día es @davidbisbal en Spotify - David Bisbal : Lo Mejor https://t.co/1NDojwmURB #NowPlaying Empezamos con la grabación de la voz Senior!!! Qué experiencia tan bonita!! https://t.co/tFfAAuL5DR https://t.co/wZEaS8UEx0 En este #DíaMundiaDeLosNiños yo también voy de #DeAZul con @unicef_es porque quiero un mundo en el que se escuchen y bien alto las voces de los niños. ¡Sus palabras cuentan! https://t.co/wkr9epKzq1 A magical movie, a magical song a magical dream! https://t.co/BaGbdemzph RT @IlionAnimation: We are pleased to announce that @davidbisbal will perform the main theme song of Wonder Park in Spanish! 🎤@IlionAnimati… Siempre es un honor cuando se hace una versión nueva de una de mis canciones. Me ha encantado como la habéis defendido. Gracias compañeros @ElRecodoOficial https://t.co/pyYvcWjwCm ¡Ha llegado el gran día! Esta noche a partir de las 21:00 h. Podréis seguir mi actuación en directo en la #peopleinredgala2018. No te la pierdas en directo en https://t.co/Ub6hIkKRWK https://t.co/2QY69yRC60 Nos veremos en Los Ángeles en febrero. Estoy deseando que pase el tiempo para comenzar la gira en Estados Unidos https://t.co/BaX5quBUTM Así es amigos, mañana nos vemos en una maravillosa gala llena de optimismo y de solidaridad. Hemos preparado un concierto especial para todos vosotros. https://t.co/k7ibUEUl7h RT @PepiyFernando: IMPERDIBLE! @davidbisbal : \"La familia está por sobre la música\". https://t.co/gsjl5kvkvm #DavidBisbal pasó por #EnTerce… RT @SOYGRUPERO: ¡ @_christiannodal lo hizo! 🤩🤩🙌🏻🙌🏻 Muchas felicidades de parte de la familia #SoyGrupero por haber ganado el @LatinGRAMMYs… Miguel Angel es un auténtico campeón. Que felicidad me da ver tanta alegría y energía positiva!!! Vamos Almeria!! https://t.co/gODhqXva7x Escuchando a @Juliaenlaonda me ha encantado que os acordéis del maestro Padilla. Para mí ha sido un placer interpretar Almería tierra noble. Maestro almeriense. Viva Almería Uff es que quedan más sorpresas todavia!!! Besos https://t.co/9m6uDWBQZq Muchas noticias positivas!!! Estamos muy felices. https://t.co/zAfrBxq6Xq RT @bisbalpress: Buy tickets for David Bisbal USA Tour 2019 (Live Nation) https://t.co/lNt0UmkBM6 - Compra ya las entradas para el Tour USA… Qué bien lo he pasado volviendo a mi casa. Os quiero! Gracias por el gran recibimiento a @Greeicy_rendon viva colombia 🇨🇴 @OT_Oficial https://t.co/JwKwXmV5Ii RT @OT_Oficial: 😍 ¡Love Is In The Air en #LoDeAntesDeOT8! Si encontráis a alguien que os mire como @BelenaGaynor, @Greeicy_rendon y @perceb… RT @LiveNationLatin: @DavidBisbal #TourUSA2019 llega a tu ciudad, la preventa exclusiva es mañana jueves 11/15 a las 10AM.\n2/10 Chicago\n2/1… Vuelvo a Usa 🇺🇸 #tour2019db https://t.co/nXlxJsuRr8 Esta noche será muy especial volviendo de nuevo una vez más a operación triunfo, pero esta vez lo hago acompañado de mi amiga @Greeicy_rendon quiero que la reciban con un fuerte y caluroso aplauso 👏🏽 https://t.co/AuBYLJhuNl En lo referente al #éxito @anxo lo tiene claro y este 17 de noviembre estará dando un #evento en #Madrid, de los más impactantes sobre #DesarrolloPersonal. Os lo recomiendo. https://t.co/uiSmxH8Yvp https://t.co/dR78yJXW2K Este miércoles he invitado a mi amiga @Greeicy_rendon a que venga a España y os cantamos #Perdón en @OT_Oficial! https://t.co/pKQxiSPHpR Esas son mis clubes de fans apoyando a la gente que peor lo está pasando. Mucha fuerza todos los afectados por estos incendios. Fuerza para toda mi gente de California. https://t.co/zEZI7apArM Exacto!!! @VEGAOFICIAL #elruido una canción que se ha convertido en la historia de todos vosotros. https://t.co/CYk2imERp4 Si ninguna duda. Me encanta ver unidos todos los clubes de fans!!! https://t.co/Qr2EGudaas Otra noche para el recuerdo mi querida Argentina.\nUna tierra que siempre permanecerá en mi corazón. Estoy deseando saber cuál será el próximo concierto. Pronto nuestro vídeo capítulo. No te lo puedes perder. https://t.co/59j96QhsMg Gracias Dario por esta entrevista tan chula que la gente pudo ver también a través de la conexión en vivo. Un abrazo. @clarincom https://t.co/b13DVjrK3I Lo pasamos siempre espectacular. Gracias por hacerme sentir como si estuviera en mi casa. Y quiero que sepa todo el mundo que el ocho de diciembre el Vélez estallará de verdad con mi amigo @LucianoPereyra https://t.co/J9w9IWWo1B Como @Twitter me siga quitando seguidores, volveremos a celebrar una vez más los 10 millones ja ja ja ja ja ja 😂 llevamos así un año, y será la tercera vez que pasemos de esta cifra. https://t.co/VpaeVJqt8s En un tiempo perfecto para celebrar nuestro concierto en el hipódromo de Palermo de Buenos Aires. Argentina 🇦🇷 40 millones de gracias 😊 https://t.co/S1LJQDKSQs https://t.co/rAM44umOmX https://t.co/OWPnyEpKsx Ja ja ja ja ja ja 😂 qué bien lo pasamos siempre!!!! Amigos @LucianoPereyra y #Gerardo de @MorfiTelefe hay que repetir eestas risas!!!!!! https://t.co/2DobLdpEOA Habéis visto el maravilloso #Tbt Que os he traído???? Agosto del 2011 Argentina! @baronjimena @juli_zylberberg el plomero llega a casa!!! Ja ja ja ja ja ja 😂 https://t.co/w6ksanVO83 RT @bisbalpress: David Bisbal \"A partir de hoy\" en El Host https://t.co/JK7N87ehtJ vía @YouTube RT @bisbalpress: Para empezar bien esta tarde: David Bisbal : Lo Mejor https://t.co/NOOZPakR8p #NowPlaying @davidbisbal Ya sabes el cariño que te tengo. Valoro tu gran labor y el de todos los chilenos. Os quiero! https://t.co/QY5uxpKofn RT @dbfanclubchile: Pero que bonita noticia David felices de tenerte en @Teleton una vez más \n@canal13 \n@TVN \n@Mega \n@chilevision \n@LaRedTV… Haremos un directo, estoy muy contento de charlar una vez más con nuestros amigos de Clarín. https://t.co/JlzVp14qHb Cómo está mi gente de Argentina!!!!!!??? Aquí con algunos clubes preparando nuestro concierto del hipódromo de Palermo!!! https://t.co/bNKsCumeG1 @RadioDisneyLA os espero en el concierto el próximo viernes!!! Hipódromo de Palermo. https://t.co/QDbSrSSrOT https://t.co/rAM44umOmX https://t.co/aNFrm8NrH5 Cuando has trabajado duro para conseguir un sueño y finalmente no lo consigues, Si te des por vencido. El trabajo no habrá sido en vano, ya que tendrás más experiencia con todo el esfuerzo depositado durante la preparación. https://t.co/M1HWetWvrb RT @telefe: ¡Un programa imperdible! 🙌👏 Comida, risas y la increíble visita de tres cantantes de lujo 🎤 @davidbisbal, @laliespos y Juan Man… He subido en mi canal de YouTube un vídeo largo de todas las canciones que he cantado en @MorfiTelefe Siempre me lo paso espectacular aquí!!! https://t.co/L26CL39qUK os espero el próximo viernes en el hipódromo de Palermo. Buenos Aires. https://t.co/rAM44umOmX https://t.co/dr4uIbrvCJ RT @Vale975: 🕘 EN ESTA HORA 🕘\n🇪🇸 Ganá tu #EntradaDoble  para ver a @davidbisbal  en el @HipodromoArgPal  🎶\n¡¡No te despegues de la radio!!… #APartirDeHoy https://t.co/POhgUpXA4E RT @MorfiTelefe: “A partir de hoy, le vendaré los ojos a mi corazón, no quiero que te mire y vuelva a enamorarse…” 🎶 @davidbisbal puso a to… Gracias por dejarme Cantar en vuestra peńa!!!! https://t.co/Sk6jJzwnI0 Así fue mi viaje a Argentina después de los premios @Los40 nos vemos al rato en un programa especial qué haremos con mi amigo @MorfiTelefe qué lo vamos a pasar. Quien viene al concierto del hipódromo de Palermo el próximo viernes? https://t.co/rAM44umOmX https://t.co/Ym8g9yGhSQ qué emoción Dios https://t.co/XP4vTRgbWf con muchas ganas de que llegue mañana, lo pasaremos genial. Qué ganas de concierto el próximo viernes. https://t.co/iXMY817wQl Que viva la música. Gracias por una noche tan mágica. @Los40 https://t.co/Zie6MRfCXg Gracias amigos de @El_Hormiguero os quiero con todo mi corazón!!!! https://t.co/ffCxDGnKoG https://t.co/hzI0YxCRQa RT @antena3com: ¡Qué bien nos lo hemos pasado con @davidbisbal en @El_Hormiguero! 👏 Ya está disponible el programa completo en @AtresPlayer… RT @bisbalpress: ¿Quieres volver a ver #BisbalEH? Programa de El Hormiguero con @davidbisbal David Bisbal https://t.co/1egmOhpnOg (gracias… Felicidades al equipo de producción por estas cosas tan bonitas que hacéis https://t.co/lripg5hTZP @JAVICHIALBACETE @El_Hormiguero La verdad es que me lo he pasado muy bien. Ya estoy deseando que llegue mi 14ª vez ja ja ja 😂 RT @El_Hormiguero: Todos debemos aprender el doble guiño de @davidbisbal #BisbalEH https://t.co/vWzNqRz3N7 RT @El_Hormiguero: “Todo lo hace bien” - @davidbisbal agradece a @Greeicy_rendon toda su colaboración en su nuevo éxito “Perdón”  #BisbalEH… Ha sido un privilegio estar tantas veces en este maravilloso programa. Os quiero mucho amigos https://t.co/J9he2AUmIX Sin ninguna duda lo que hace grande a este disco es el talento y la humildad después de más de 80 años de canciones por parte de la madre de todas las bandas @ElRecodoOficial https://t.co/TiOyr4qAtM RT @DsignatedPlayer: @davidbisbal and @Guaje7Villa training together in NY! Check the video in our youtube channel:\nhttps://t.co/cHeLqgX4nL… RT @musicagran: @davidbisbal @SpotifyLatino\nvamos a darle, en este lluvioso día de #Halloween un poco de #Perdón https://t.co/eQ9vLV5jjh … RT @bisbalpress: David Bisbal y David Villa entrenan juntos en Nueva York https://t.co/tRhVhLkdDv vía @YouTube Vamos a darle un poco de #Perdon https://t.co/tCbK31mI6g @SpotifyLatino https://t.co/ymZZ13uk1c Fantástico!!! Viva Argentina 🇦🇷 https://t.co/lMQ6HepCnN Ya estamos llegando a @elhormiguero y a @Los40 vamooooooooooos!!! Y la semana que viene!!! Buenos Aires!!!! Hipódromo de Palermo!!!! https://t.co/58x8SKtVh3 RT @NuestraBelleza: AMAZING!! ¿Qué tal el opening de esta noche a cargo de @davidbisbal y @Greeicy_rendon? 🔝💃🎤👏 #NuestraBellezaLatina https… Estamos listos @Greeicy_rendon https://t.co/VHa3bTx6u1 @Univision #perdon https://t.co/rgHsKr499K Un beso muy fuerte para todos. Esta noche estaremos cantando en @NBL2018 mi amiga @Greeicy_rendon y yo por primera vez cantando en directo #perdon os queremos! https://t.co/4weYH786ow @Univision https://t.co/bGTg5TQvWm Estáis listos para #Halloween2018 ???? Mirad que originales. https://t.co/icTyErPu23 Lo que viene es mágico!!!!!!! Hello from New York!!!! https://t.co/5wsrh64rnb Felicidades @_christiannodal https://t.co/KD775IW5WP Para todos lo que buscáis un refugio, a veces está en la música 🎵 @pabloalboran https://t.co/l4GHA2UeGu https://t.co/E4hHFPmQAu #recomendado me ha encantado éste documental que ha grabado mi amigo Oscar Espinasa con un gran equipo de buceadores técnicos. Un abrazo a todo el equipo. Si os gustan los pecios no os decepcionará. ⁦@rtve⁩ #cisneros #hundidos https://t.co/yT2nHILrnA Mirad a quien he ido a visitar aquí en New York!!!!! @Guaje7Villa que felicidad y que orgullo!! https://t.co/znypu9qVsE Os traigo un Super throwback #tbt #bocariver 2007 https://t.co/VHEiLTAOz8 Durante mi gira de aquella época coincidió este clásico no me lo quise perder por nada del mundo. Argentina 🇦🇷 https://t.co/eOvyz24OQZ Gracias a New York summit por este reconocimiento tan maravilloso. Este premio es de todos vosotros. https://t.co/JONXWcfmzj https://t.co/17ZhfoFFkZ El día no se ha acabado!!! Besos desde New York!!! https://t.co/7GteDjsPLH Estáis???????????? https://t.co/HEvbyvChcG Mucho trabajo detrás de los sueńos!!! #OperacionTriunfo Jamás podré olvidarme de este momento. #encasadeines hace 17 años, después de cuatro años trabajando con mi Orquesta expresiones pude cantar por primera vez en @tve_tve https://t.co/6jTZyDGzeF Los amigos de @NationalGeoESP son geniales. Gracias por este artículo tan bonito. Que viva nuestra Almeria!! https://t.co/znW9pWfyX9 Acompańame en el viaje que volar solo no puedo!!!!!! Newyork!!!! Saludos!!!! https://t.co/RzZG4xCFnx Ja ja ja ja ja ja buenos días! Solo un recorte para mantener!  Espero que tengáis buen Domingo. https://t.co/tr78RcCXDS RT @Cadena_Dial: VIDEO @davidbisbal visitó @Dialtalcual \"Mi próxima canción será una balada con una colaboración\" ¡Mira el vídeo! https://t… Aquí os dejo una nueva versión del video #Perdon con @Greeicy_rendon para que la disfruteis en @spotify!!\nhttps://t.co/o8a44xY0YN RT @UniversalMusicE: El vídeo vertical de #Perdón ya está disponible en #Spotify. ¿Listos para seguir disfrutando de @davidbisbal junto a @… RT @musicagran: Has visto el nuevo vídeo de #Perdón de @davidbisbal y @Greeicy_rendon pues a que esperas???? dale al play y disfrutalo @Spo… Buenos días, os traigo un video muy relajante de mi última inmersión en cabo de palos con #rafaelfernandez campeón del mundo más joven de la historia de fotografía subacuática. @Aqualung_Spain espero que os guste. https://t.co/EIi3ljYX5x RT @Spain_in_CH: #Almeria, eletta nuova capitale spagnola della gastronomia 2019!👏\nUn'offerta culinaria unica ed eccezionale che unisce i s… Acepto el reto amigo @JesusCalleja @NatGeoEsp #YoElijoPlaneta hay toneladas de residuos en el mar, si no cambiamos esta dinámica pronto habrá más plástico que peces. Aquí con mi amigo Rafael Fernández. Reto a @_CarlosRivera y @LucianoPereyra  2 grandes amantes de la naturaleza. https://t.co/irSU9UJehb #Graciasportuamor @ElRecodoOficial eres el amor perfecto, eres lo que yo más quiero. Gracias por ser como eres, gracias por tu amor. Espero que os guste! Acabo de grabar el vídeo ja ja ja ja ja ja ja ja https://t.co/tvVDQTchtQ Quiero felicitar a mi amigo del alma el doctor Eduardo Anitua, por haber sido nombrado #HonorisCausa por la Universidad de Buenos Aires Argentina 🇦🇷 Una orgullo tenerte como amigo. Ah por cierto, feliz cumpleańos también!! https://t.co/0wJRjgRMS6 RT @FansLOS40Madrid: Como acaba de confirmar @TonyAguilarOfi al final de #40GlobalShow160 el invitado de la sección #Star40 de @40GlobalSho… Es alucinante que tengamos dos videos en el #TOP10 de YouTube en México 🇲🇽 #GraciasPorTuAmor @ElRecodoOficial https://t.co/1tFe8Zvl7Y  y #Perdon con @Greeicy_rendon https://t.co/S1LJQDKSQs https://t.co/5H1uIrvoO7 RT @Dialtalcual: ¡NOTICIÓN! El próximo sábado nos visita @davidbisbal en Dial tal cual. 👏👏👏 #EscuchoDialTalCual https://t.co/BwXKtCiCpV Feliz día de la hispanidad a todos! Muchos besos #DiadelaHispanidad https://t.co/BHS4kzSbex Feliz!!! Todos de rumba en este fin de semana largo!!!! A disfrutar del puente. https://t.co/S1LJQDKSQs @Greeicy_rendon 25millones #Perdon https://t.co/PJRLmQdFu5 Es la mejor noticia que podríamos tener para Almeria. Estoy muy feliz y emocionado @Almeria2019 Espero que disfrutéis de mi tierra hoy y siempre. https://t.co/S6MRKiDq0g RT @bisbalfanclubpa: Es de ataque 😲 que emoción chicas 🤗... A darlo todo este 9 de noviembre a cantar junto @davidbisbal hasta quedar sin v… Si, aquí estamos tristes y aprovechamos para mandar un fuerte abrazo para todos los mallorquines y los afectados de las inundaciones en estos días. Gracias al club de fans de Panama por estar pendiente a lo que pasa en Espańa. https://t.co/zbywXkgLbU qué ganas de llegar a Argentina una vez mas. https://t.co/gGLFZSSgCt Buenos dias, qué buena noticia, todo gracias a la gente. Seguimos. https://t.co/cLRjcTVh2s Terminamos en Zaragoza!!! Y el próximo en Buenos Aires, Argentina! Os quiero mucho! Gracias por cantar conmigo!!! Buenas noticias vienen en camino. https://t.co/je03iwVrYA RT @YouTubeEspanol: ¿Qué está sonando? 🎧🎺 @davidbisbal y @Greeicy_rendon te ponen a bailar con #Perdón 🎶🎤💃 Haz clic para ver el video 👉 htt… Dani, ha sido un placer conocerte te mando un abrazo y gracias infinitas por todo el cariño que me das diariamente en la redes sociales. https://t.co/cTLfSmCOZB Gracias por tu cariño. Aquí os estoy leyendo todos los comentarios. https://t.co/CardlMcajH Espero que te haya gustado! Un abrazo. https://t.co/CvJYFxk0jY Ahora cualquiera hace deporte al lado de este máquina!!!  #PerdonSport quien lo supera?#Parkour https://t.co/mrwUP2tnKl Felicidades al equipo andaluz de fotografía subacuática por haber ganado el campeonato de España. Siento mucha felicidad por vosotros. Ahora a por el mundial! https://t.co/fdwWSxgqY3 Hoy canto y mi corazón lo nota!!! Nos vemos esta noche. RT @bisbalpress: Perdón de David Bisbal, Greeicy https://t.co/pUmI9LD5Gj #NowPlaying @davidbisbal Hoy es uno de los días más tristes de la música, se ha ido una de las voces más maravillosas del mundo, nuestra queridísima Monserrat Caballé a la que siempre he tenido una gran admiración. Un fuerte abrazo a todos sus amigos y familiares en estos momentos de extrema dureza. https://t.co/BC15Nat0bk Hola mi gente! Gracias a Vosotros #Perdon ya ha llegado a 20 millones de reproducciones en @YouTube @Greeicy_rendon 20million in one week thanks 🙏🏽 https://t.co/PX8FyzoKhe #recomendado  estudios de las bacterias de nuestro Intestino. @silviagsenent https://t.co/1wa6kjxONd Con grandes amigos en el encuentro anual de #Knowmads2018 https://t.co/peUroevUnu Con @unicef_es y los niños que se han quedado solos y necesitan nuestra ayuda tras el terremoto y el tsumani en #Indonesia Necesitamos tu ayuda. DONA: https://t.co/FH8Qat15Y9 https://t.co/BMdRbsfPiu #recomendado el nuevo vídeo de mi amigo @LucianoPereyra máquina!!! Vamoooos https://t.co/ga8L1vSqq3 Vamoooooooos 11 millones https://t.co/S1LJQDKSQs https://t.co/7vad9PhFlu He conseguido que los chicos de @8Belts os regalen a todos un acceso gratuito durante 2 semanas para que probéis la plataforma con la que yo estoy mejorando mi inglés. El método es realmente revolucionario y funciona. Probadlo en https://t.co/GxUDnv4CwM Os va a encantar https://t.co/1peLF5K7Gy Qué alegría. Hoy estamos amaneciendo con esta maravillosa cifra!! 10.000.000 de visualizaciones #Perdon @Greeicy_rendon https://t.co/3OSr6zKWfX Que felicidad amigo Poncho!!! Viva Mexico 🇲🇽 https://t.co/2oiQbqLNs6 #CharlesAznavour descanse en Paz! https://t.co/CEdgIkLEm5 Gracias por captar estos momentos... Os quiero. https://t.co/VW45Q6MZbW muchas gracias amigos de los informativos de TVE https://t.co/nplRSw7KsK Con mi gran familia de @UniversalSpain y #alejandroA posando con vuestro disco de platino de #apartirdehoy. Este premio es vuestro. @SebastianYatra Felicidades compañero. https://t.co/qrEBB4qksY felicidades amigo @alejanvalverde por tu victoria. Campeón del mundo, qué orgullo. Un abrazo muy fuerte. db https://t.co/WU66M8Fzau RT @bisbalpress: No solo #Perdón está en las tendencias de videos de youtube, sino que bien posicionado en el 11 se encuentra: Banda El Rec… Cuando veo algunas fotos, puedo ver y recordar lo que estaba sintiendo en ese momento. https://t.co/TlEox26KXt Genial! Madre mía!!!! Qué alegría, qué buena respuesta de la gente! #PERDON 6millones ya! https://t.co/EgDvXbnVFR Muchísimas gracias a todos por haberme acompañado en esta noche tan especial. Un abrazo muy fuerte 🤗😊 https://t.co/bCL896dcOz Muy pronto volveremos a Puerto Rico 🇵🇷 https://t.co/F8mbarAJue Me encanta!!! Que guapa!!!! https://t.co/zMX9tZPeFn RT @PepiyFernando: VIDEO! @davidbisbal vuelve a conquistar el @Teatro_Real de #Madrid https://t.co/CVRYYesM2P #Reportaje #DavidBisbal https… Tengo muchísimas ganas de presentaros mi tema perdón.Gracias por la respuesta tan positiva os quiero muchísimo. https://t.co/xQgvVjJnz7 RT @bisbalpress: VIDEO: Amplio reportaje del concierto de @davidbisbal en el Teatro real en Corazón TVE, hoy: https://t.co/QE2BMfUsXq RT @TonyAguilarOfi: Hoy en #40GlobalShow158 estrenaremos en los 12 países PERDÓN, lo nuevo de mi querido @davidbisbal y la maravillosa @Gre… RT @UniversalSpain: Qué maravilla!! #Perdon de @davidbisbal y @Greeicy_rendon supera los 5 millones de views en 48 horas!! https://t.co/zvx… Estoy muy feliz con la aceptación del videoclip #Perdon en tan pocas horas!!! Ayer en el @Teatro_Real real viví un sueńo cuando os escuché cantar con tanta fuerza esta canción! Gracias @Greeicy_rendon por acompańarme en esta canción. https://t.co/S1LJQDKSQs https://t.co/Af7PgyGBoU RT @UniversalSpain: #Perdón de @davidbisbal y @Greeicy_rendon ya supera los 2 Millones de Views!! Aún no la has bailado? ➡️ https://t.co/zv… Hermano @LucianoPereyra tú eres de otro planeta!!! Se te quiere!!!!! https://t.co/5abbCkdYwW RT @TvsEspectaculos: .@davidbisbal estrena la rumba latina 'Perdón', junto a la ganadora de @MQuienBailaMX, @Greeicy_rendon. 🎤💃🕺✨ https://t… Vamos a ponerle ritmazo al viernes con @Greeicy_Rendon y #Perdon, ganas de que os guste tanto como a mi!!\nhttps://t.co/9IhqeFf1xz Esta es la mejor manera de pedir #Perdón a @Greeicy_rendon !! Pedazo de videoclip que quiero compartir con todos vosotros en @vevo_esp @somosvevo!\nhttps://t.co/AWnbW0NziU Familia, también somos portada de la playlist “Lo Mas Nuevo” de @amazonmusic. Corre y entra a escuchar mi último single junto a @Greeicy_Rendon #Perdon !\nhttps://t.co/JrfOJS4lkT Muy contento de que #Perdón con @Greeicy_Rendon ya esté en @applemusicES, todos a bailarla! https://t.co/Skh9bx0CiG Vamos! Aquí os dejo #Perdón con la gran @Greeicy_Rendon para disfrutarla desde ya en @spotifySpain! https://t.co/okd7BSUMpT @TvBandamax @ElRecodoOficial @NotiBanda @lazperingrid Os ha gustado la canción con la banda el recodo? para mí ha sido un auténtico placer estar con estos grandes de la canción. @ElRecodoOficial @quieromusicatv Gracias amigos de quiero por siempre apoyarme. @exatv @jessiecervantes @AxesoTv Con muchas ganas de volver. Amigos Gracias compañeros. Habrá que ponerse de acuerdo, pero creo que un buen Medley recordando algunos de los número uno en los 40 podría ser fantástico, además si tenemos la oportunidad de cantar el nuevo Single #perdón lo disfrutaré mucho, que pensáis? https://t.co/pCTBzGFAMQ ja ja ja ja ja ja ja ja ja ja ja ja ja ja ja ja me en canta. Un beso. Os espero. #Perdon https://t.co/t7aSqVO9m7 Mañana tenemos Instagram Live con @Greeicy_rendon y os comentamos todo sobre #Perdón, os espero a todos!!\nhttps://t.co/ONSNSVKKuu https://t.co/pCpFb2AAas Viva Mexico Lindo! Ya podemos comprar allí los #BabyPelonesJT de @juegaterapia en las tiendas @solosanborns y colaborar con la investigación del cáncer infantil. #BabyPelonesEnMexico\n#JuegaterapiaInvestigación. https://t.co/YhoUp5Y6gz What an honor to hear you singing one of my songs. @iamcardib It is such a humbling privilege to me. I hope we have a chance to meet sometime soon. It will be great. https://t.co/W7ZhIAw704 No me escuchas!!!?? Que quiero pedirte #perdon ja ja ja ja ja ja 😂 vamos a por unos bailecillos!!! @greeicy_rendon https://t.co/l3Kw9vDUGQ Qué ilusión! Ya se puede reservar PERDON zen Spotify... @SpotifyLatino @SpotifySpain @Spotify \nHaz clic aquí y podrás, además, ver en primicia un avance del making of del vídeo.\nhttps://t.co/hTAkx4pPhb https://t.co/O1cOaBcDc4 Qué ilusión! Ya se puede reservar PERDON en @Spotify...Haz clic aquí y podrás, además, ver en primicia un avance del making of del video. @Greeicy_rendon #perdon \nhttps://t.co/hTAkx4pPhb RT @dbfanclubchile: Toda La Familia Bisbalera Del Mundo  se une para pedir \n#perdon \nRecuerden este viernes estamos de estreno \n@davidbisba… Para mí será un auténtico placer cantar de nuevo en #los40musicawards2018 gracias por este maravilloso premio. @TonyAguilarOfi https://t.co/Z5SdO2jLrT Esperando tu llamada querido amigo @TonyAguilarOfi @Del40al1_es un abrazo 🤗 Os quiero mi gente de Mexico. Gracias por todos los buenos comentarios. https://t.co/dagu2nWLV5 RT @BISBRASIL: #GraciasPorTuAmor 🙏 a nova música do @davidbisbal 🤗 e @ElRecodoOficial disponível no @SpotifyBR 👏👏👏\nhttps://t.co/cwoG4zZPe1 RT @bisbalpress: Nuevo VIDEOCLIP: Banda El Recodo De Cruz Lizárraga, David Bisbal - Gracias Por Tu Amor https://t.co/zwDPGohgoL vía @YouTub… RT @locasxdavid: @davidbisbal falta poco para el gran encuentro. Que ganas de estar en este concierto!!!! Que arte tienes!!! Un abrazo muy… RT @bisbalpress: ALMERIA 2019, VÍDEO OFICIAL DE CANDIDATURA https://t.co/dof8OWWH08 vía @YouTube @davidbisbal Feliz cumpleaños mi @LucianoPereyra a muerte contigo. https://t.co/QuyHes84M5 Pura sabrosura!! Como dice @Greeicy_rendon #Perdon!!!! #rumbalatina https://t.co/1CofjX60dv https://t.co/qasGi0g33z Felicidades a todos los nominados de los @LatinGRAMMYs especialmente a @_christiannodal que ha conseguido 3 nominaciones y una de ellas #Probablemente canción que hemos tenido el enorme placer de cantar a dueto. https://t.co/SFdVUsLXja RT @musicagran: Ya esta aqui la nueva rumba de David Bisbal esta vez acompañado de la colombiana Greeicy Rendon https://t.co/Wh67CLC7Ku … v… RT @BISBRASIL: Faltam 8 dias para ouvirmos #Perdón , do nosso @davidbisbal em parceria com @Greeicy_rendon 🕺💃🕺💃🕺💃🕺💃\nDia 28/09 https://t.co/… RT @MFLWyedean: Ooh WOW!! Look out for the new single by the awesome @davidbisbal which is called ‘Perdón’. It’s out on the 28 of sept and… Con ganas de estrenar y cantar.... #Perdon https://t.co/MwOh8SIUd6 @Greeicy_rendon https://t.co/U2Iy3BM7Nl @antoniobanderas Tienes más arte!!!! Que to! Viva Mexico 🇲🇽 https://t.co/IK3teOWQEo La cuenta atrás @Greeicy_rendon #perdon https://t.co/lRaVc8BxVo https://t.co/KRjdzrfpta Ya tenemos fecha de salida!!!! #Perdon!!!!!! ...@Greeicy_rendon por ciertoooo mil felicidades por tu victoria en #mqb Mexico 🇲🇽 https://t.co/J2oAngc2jS RT @BISBRASIL: Dia 9 de Novembro @davidbisbal estará com #DavidBisbalTour2018 no #HipodromoDePalermo  em Buenos Aires \nCompre sua entrada e… ¡Muchas gracias a todos por la ayuda!. Me encanta el francés cómo primera opción, pero ya que estoy avanzando rápido con el inglés, me apetece ir a por el más difícil. ¿Qué os parece si vamos a por el chino? ;) @8Belts os quiero. https://t.co/zI3diczmVl También mucha fuerza a toda la gente en Hong-Kong y Estados Unidos. La naturaleza se está enfadando con nosotros. https://t.co/GMZrGmBtTX Sí, también estamos atentos. Un abrazo muy fuerte a toda mi gente de Estados Unidos. https://t.co/Lxlwzy5S4e Hace poco menos de una semana que estuvimos mi amigo @JesusCalleja y yo visitando esta maravillosa tierra que ahora está en peligro. Mucha fuerza y toda nuestra solidaridad. https://t.co/R4VjnPZuzQ RT @bisbalpress: David Bisbal : Lo Mejor https://t.co/oWLXujjEu1 #NowPlaying Estoy muy feliz con el #GoldenMusicAward @Los40 qué gran sorpresa. Me encantó el video que preparásteis con tanto cariño. Gracias por todos los número uno, gracias por la confianza. Un premio para todos mis seguidores y compañeros que me han acompañado en estos maravillosos años https://t.co/VHAWIYl6ww RT @musicagran: Felicidades a @davidbisbal @davidguetta @LuzCasalOficial por el #GoldenMusicAward #Los40MusicAwards @Los40 https://t.co/D9T… RT @anxo: Amigo @davidbisbal hagas lo que hagas no dejes de avanzar con el inglés. Me alegra mucho que te esté encantando https://t.co/sBqg… Buenos días a todos! Hoy será un gran día! No lo dudes! https://t.co/4TdysbDMQw Amigo @anxo la sorpresa que tenía guardada es que voy a empezar a estudiar un idioma diferente ya que siento que voy mejorando con mi inglés, pero quiero que mi gente me ayude. Por cuál de estas 3 opciones os decantaríais? @8Belts RT @dburuguay: @davidbisbal @SebastianYatra así baila @ECavaniOfficial  #APartirDeHoy mientras cocina 😍👏👏#instagramstories https://t.co/7qt… Este buceo nocturno fue una pasada! Ya echo de menos sumergirme y grabar. https://t.co/AAzyWg4DPr RT @artistasenvivo: Y, ¿si fuera ella? - @davidbisbal https://t.co/EY1tyOl0wW RT @anxo: Amigo @davidbisbal te acabo de hacer un vídeo de contestación al que tú me has mandado. “Un día te dije esto...” https://t.co/fkE… RT @SoyMotor: Sabíamos que a @davidbisbal le gusta la @F1... ¡pero ahora sabemos que a la #F1 también le gusta Bisbal! 🎶🎶 💃🕺#FelizFinde htt… Ja ja ja ja ja ja 😂 @JesusCalleja es que es para volverse loco, te entiendo amigo!! Mucha vida! https://t.co/LXuwoi6gds Amigo @anxo muchísimas gracias por todos tus consejos! No paro de mejorar día a día y voy a cumplir los objetivos que me marqué para este ańo.  Además tengo una gran sorpresa que compartiré con mi gente pronto!!! Espero que os guste! Saludos desde Bohol, Filipinas. https://t.co/4obDcfDyKC Alucinando con mi cámara, con los focos y con la vida en este maravilloso lugar! https://t.co/0mAyjuYEqf https://t.co/Aj5sylpfDJ Por fin a la venta las entradas para el @Teatro_Real… nos vemos todos allí el 29 de septiembre!!! https://t.co/1nVRZzIyyD https://t.co/nAvrSjTMaJ RT @quieromusicatv: . @davidbisbal llega con a Buenos Aires con su #Tour 2018 y podés estar ahí! #sorteo  https://t.co/Awshdtj6Lq https://t… Tengo que decir que me ha parecido una especie de tiburón preciosa y en ningún momento he sentido pánico. Qué bonito que tengamos esta pasión juntos amigo Jesús. Estoy deseando llegar a casa y preparar un video de todo nuestro viaje. https://t.co/fZrpZFtGxU Ya tenemos fecha exacta para la venta de entradas… Mañana es el día. Que ganas de veros a todos de nuevo en este mágico escenario del @Teatro_Real!! https://t.co/qI37yTzzAZ RT @teambisbalarg: Buenos días!! Esperamos que tengan un lindo día!!!! No se olviden de comprar sus entradas en https://t.co/r9NKS0ie2V @da… Nos vemos el próximo 29 de sep! Atentos a las entradas!!! Esta semana a la venta. https://t.co/2JlU4TGB9W Un abrazo a todos amigos!!!@JesusCalleja será una semana muy interesante. #buceo https://t.co/Y6DeqWewbR @Ailugrisolia @JesusCalleja Totalmente de acuerdo 👍🏽 @mersese @JesusCalleja Ja ja ja ja ja ja 😂 Ya la cosa fue a más!! La verdad! Qué bonita es la naturaleza y que romántica con esta puesta de sol 🌅 @JesusCalleja https://t.co/qolIXkRWbA Hermosa puesta de sol 🌅!!! Espero que tengáis una maravillosa semana. https://t.co/njyG9fUn3K Vamos con energía!!!!!! https://t.co/WF8BjV8aQa Jesús.... cuidadin!!!! Ja ja ja ja ja ja 😂 @JesusCalleja https://t.co/SwMqkfVCnI https://t.co/9ZW60JBATI Espectacular explicado!!! https://t.co/OFz6FCdyjl Ahora que proponen cambiar el horario de nuestro país, que os gusta más, el horario de invierno o el de verano? No os podéis perder mi súper #tbt del 2003! https://t.co/CuGnlyhCie os quiero. https://t.co/w8FFmKJFf4 Gracias a vosotros por el cariño y por tus palabras tan bonitas llenas de afecto durante toda la entrevista. Besos. Deseando volver a visitaros. https://t.co/ZXAbJpqtil Y el 8 de diciembre el #Velez se cae!!!!! Arriba!!! @LucianoPereyra vamoooooooos! https://t.co/lFrCLZsl4J Por si no has visto el video capítulo de Córdoba, aquí te dejo el link de mi canal de YouTube para que lo disfrutes! @LucianoPereyra https://t.co/3HBOFl4EdX https://t.co/S3V48SkSE0 RT @bisbalpress: Tras estar innumerables semanas en el Nº 1 de Uruguay, y bajar la pasada al 2, esta semana #APartirDeHoy de @davidbisbal @… Jurando bandera en Cordoba, Argentina ante #MarioPereira @Cadena3Com https://t.co/pdRExRw4sv Es una actuación que recordaré para toda la vida, gracias hermano @Luciano, que bien lo henos pasado @Cadena3Com Os quiero. Gracias amigo #MarioPereyra https://t.co/CPBuG40cDB Ya estoy listo para este concierto tan especial del dia del niño... Os quiero, me encanta estar en Argentina. Viva Cordoba. https://t.co/6Rt23ULeiz De Almería a Cordoba Argentina 🇦🇷 https://t.co/SXQYPbxlsk Estuve de escala en Asunción, me encantó recordar los buenos momentos que pasamos con la musica. https://t.co/g3OE1Mdeav Muchísimas gracias por el recibiendo, ha sido un largo viaje que sabe a alegría cuando te encuentras a los clubes de fans dándote cariño. db https://t.co/9N4bAVMO87 Me encanta que después de varios meses sigan llegando buenos resultados.. Gracias. Acabo de llegar a Cordoba Argentina. https://t.co/AQibV4isFr Ja ja ja ja ja ja vaya estampa que tenemos en casa antes salir a la feria 🎡 de Almería!! https://t.co/Yd9zrOwq7R https://t.co/QgPTYEmgLb Que bien lo pasamos!! Grandes compańeros y artistas! https://t.co/3TQNXUMoTK Este es mi #Tbt de hoy. Cantando en Tokio Shibuya en el 2009. La primera foto en el estudio, pertenece a la grabación en japonés de #oyeelbum Las demás de la promoción en emisoras de radio. https://t.co/7UqTNqctbK https://t.co/39mKy77Nz6 Quiero mandar mi más sentido pésame para los familiares, amigos y compańeros de #AdrianaGaray @Reforma que descanse en Paz. https://t.co/DrVZcLK1a5 Este día conocí a un gran ejemplo a seguir! @RAPHAELartista https://t.co/B1Kr4VaIMJ Encontré mi serie roja de dragón 🐉 ball z de comics! Tienen más de 20 ańos y están intactos! Ja ja ja ja ja ja que alegría me ha dado encontrarlos! https://t.co/8R2sjzaqiq @RAPHAELartista La suerte se trabaja querido amigo!!! Felicidades!!!🍾🎊🎈 Qué ganas!!!!!! https://t.co/cgN4kaSIzS 35MM- Lady Gray 400- Canon A1. #mirumba en camino!! #tacodeperrodb https://t.co/KpcgzNl16a @jap_almeria Juan sin ninguna duda es una triste noticia y una historia conmovedora. Por favor saluda y abraza a toda la familia de mi parte. RT @LaVozAntena3: ¿Quieres saber cómo ha reaccionado la gente al enterarse de que @DavidBisbal será coach de #LaVozKids en @antena3com? 🤩 ¡… Descansa en Paz! @ArethaFranklin la música y el mundo llora, pero su voz permanecerá para la eternidad en el corazón de la gente. https://t.co/CC2ohhDjMa Mirad, hoy me encontré una morena fuera de su cueva en la boya cinco de la isla del Toro. Preciosa! #Divers la cantidad de vida es impactante, diversión asegurada. #recomendado https://t.co/JItEtVtohh Muchas felicidades @Atleti por esa gran victoria en la supercopa! Qué gran orgullo que dos equipos españoles destaquen el nivel indiscutible de nuestro futbol a nivel mundial! A disfrutar de la nueva temporada. Siempre lo pasamos muy bien, me encanta ver tanta vida en el mar. Hay que preparar la próxima inmersión. Un abrazo. https://t.co/RrjsIpqlFD Qué placer bucear con tanta vida! Buceando con mero que me presenta a su familia! https://t.co/DLv44nnXyk No importa que coche o qué equipo, siempre estas por encima de todos! De todo corazón me encantaría que fuese un hasta luego. Te seguiré como siempre, disfrutaré de tu nueva aventura! A por la triple corona! https://t.co/5GklIqLPeP @alo_oficial te queremos! https://t.co/PHjypcznuQ RT @JesusCalleja: De vacaciones con los amigos, risas, deporte y un poquito de playa...como en España en ningún lado... os lo digo yo!\n@dav… RT @Helleni78: @davidbisbal tu tierra es increíble, Almeria enamora!! 🐟🐠@Costa_Almeria https://t.co/mV9zbgBUL9 RT @bisbalpress: ¡Mañana dominguera escuchando lo mejor! David Bisbal : Lo Mejor https://t.co/66zhpp9wcR #NowPlaying @davidbisbal Qué gran noche vivimos en @StarliteGala @antoniobanderas @Carlos_Latre https://t.co/tQ06470UGp https://t.co/UH2Ni0K1zu Feliz fin de semana!!!! https://t.co/ICuplk7gFI https://t.co/BEKQtaMg2W Para todos aquellos que hayan hecho este trabajo, poner mi versión en japonés de “Oye el bum” con la intro de #dragonballsuper !! gracias de todo corazón, me ha encantado. Ya sabéis lo fiel que he sido desde niño a #DragonBall algún día grabo la de !Dragon Ball Z #Volando https://t.co/uIk1xzk1eQ RT @colmiki_: Dragon ball Super con la canción de @davidbisbal en japonés\n\nhttps://t.co/mE9vwmhqZC Aquí puedes ver el video capítulo de Conciertos de Pinoso y Cambrils. #videocapitulo #mirumbanuevadb en camino. https://t.co/ih27ecGUbe https://t.co/H3rO0tKRJz RT @musicagran: El ruido de @davidbisbal vuelve al @Teatro_Real el 29 de septiembre #DavidBisbalTour2018 hazte con tus entradas en https://… Todavía sigo recordando estos dos conciertos que hemos tenido en Pinoso y en Cambrils. Con un calor abrumador y con el apoyo del cántico de mi gente. Os quiero mucho. https://t.co/Q0UFMyNbrE https://t.co/PHFtY32X1C Estamos que no damos abasto, que orgullo para el deporte femenino. https://t.co/jNgfjKbYSi Felicidades campeona por haber hecho historia  @CarolinaMarin https://t.co/IFWkXA345b Felicidades amigo @IkerCasillas Eres un ejemplo a seguir!!! Te queremos!! https://t.co/jic5HEldNu La música cobra sentido gracias conciertos como los de esta noche! Gracias a los músicos que tengo Y gracias a la aplauso del público! Recordaré el concierto de Cambrils como uno de los más importantes de mi carrera. https://t.co/P2p1xo8H2b Algunas fotos de ayer del concierto de Pinoso!!!! Esta noche cantamos en Cambrils!! Pronto #mirumbadb https://t.co/f7o9jD8m3F Me pareció muy bonito poder cantar en Espańa #Meenamoredeti con motivo de haber superado los 100.000.000 de visualizaciones! Una canción de Argentina dedicada a todo el club presente en Pinoso. Os quiero. Estoy deseando cantarla otra vez. https://t.co/S1qboBzCC3 RT @bisbalpress: David Bisbal: \"Me siento afortunado por el público que me sigue, que me aporta y exige\" https://t.co/7DDaii7f6M vía @elmun… Habéis visto este super #tbt la grabación de mi videoclip esclavo de sus besos??? https://t.co/HjF2Xij6ft te va a encantar! https://t.co/HvCmB1Usy1 Un abrazo muy fuerte para todos los accidentados en el vuelo de Aeromexico en Durango! Por suerte he leído que no hay ningún fallecido, deseo en el alma la pronta recuperación para todos los heridos. Un abrazo mi gente de Mexico. Volvemos al @Teatro_Real sera mi tercera vez en este maravilloso teatro. Os Espero a todos. https://t.co/ohpusAwQxa https://t.co/JLvTZy54aD Quería felicitar a las campeonas de Europa, la selección femenina de fútbol de España 🇪🇸 @SeFutbolFem felicidades, es un gran orgullo. https://t.co/BkyLSnJIL6 Seguimos rezando por el pueblo de #Grecia. Toda la fuerza del mundo en estos momentos tan duros. Sentimos mucho dolor por las victimas del brutal incendio. RT @Almeria_Aerea: #Almeria La playa de Los Muertos es espectacular desde el aire...\n#costadealmeria https://t.co/rHTUF1xVsh Estaré siempre muy agradecido con todo el cariño que la gente nos regala allá donde vamos! Los momentos de trabajo los disfruto al máximo y estoy aprendiendo a disfrutar también los momentos libres que nos regala la vida. Os quiero! https://t.co/d2TON2gMkj Pocos días de descanso pero los justos para reponerte al 100 × 100. Nos vemos el 3 y el 4 de agosto Pinoso y Cambrils. https://t.co/6OXqhZ9i7Q https://t.co/epKhnlfr2k RT @lavozdealmeria: ¿Alguna vez has pensado cómo sería la vida de @davidbisbal Bisbal en dibujos animados? La agencia @mufubufu te lo cuent… Amigos, recientemente llegamos a 100 millones con #apartirdehoy y ayer con #meenamorédeti, una maravillosa balada de Argentina que la disfruto mucho cada vez que la canto, llegó también a 100 millones! Estamos de celebración. Os veo el 9 de noviembre en el hipódromo de BB AA https://t.co/HROCIBdRUq Amigos, aquí podéis ver el video capítulo entero de mi concierto en Marbella. https://t.co/nkn4ShOdBJ @StarliteFest https://t.co/zQ3o94xhpE Que bonito homenaje!!!! Os quiero. https://t.co/86tELLCrTg https://t.co/gXN4pM6Z7S RT @StarliteFest: Y @davidbisbal pintó un cielo de estrellas sembrado de luz y todo su arte iluminó la cantera  haciendo así de bonito el t… Gracias a todos los que habéis votado y confiado en #apartirdehoy!!! Después del concierto de ayer, qué bonita sorpresa. https://t.co/d2aDfcQwRD RT @Del40al1_es: Gracias familia por otra mañana de sábado increíble! #FelizSabado https://t.co/AZAY4wSaVc Gracias amigos de Marbella!!!! @StarliteFest ya sueńo con volver pronto! https://t.co/hVSVCfMwGE Siempre es un verdadero placer volver al escenario de @StarliteFest Éste ha sido mi quinta vez en esta maravillosa cantera de Marbella. Volveré siempre. https://t.co/W6eJ30qZjH Gracias amigo Víctor por pintarme hoy un cuadro en directo durante el concierto. Eres un gran artista. https://t.co/lXx9sLaUKW Para todos los fanáticos de #DragonBall me encanta esta camiseta. https://t.co/yXTDWOlW0g https://t.co/mtHkvkoLSe Esta noche toca cantar en un lugar muy especial.En el @StarliteFest de Marbella. Será una noche muy especial. Os iré enviando fotos y videos. https://t.co/OjyzMOk3Az Es un honor que te hayas acordado de mi entre tantos buenos compañeros y grandes artistas. Gracias. https://t.co/mlkEefRlSw Familia, quiero compartir con todos vosotros la fantástica entrevista que me hicieron en Colombia en @NoticiasCaracol !! \nhttps://t.co/efBjgeX9PW Gracias por todas las palabras de cariño que me regalais cada dia. https://t.co/biiQcMT2j9 Quedan pocos conciertos y los voy a disfrutar al máximo. Os quiero. Nos vemos el proximo viernes en Marbella. https://t.co/3qX9ION0TX Feliz miércoles a todos. https://t.co/fxiHcbljqc Después de haber probado varios scooters estos son mis favoritos... tienes que guardar el equilibrio con las aletas y tu cuerpo, tal y como lo hacen los peces. Es una maravilla. https://t.co/IX2lC9RlMy Sin ninguna duda de las mejores experiencias que he vivido!!! Siempre  he dicho que puedes hacer el recorrido de cinco inmersiones en una. Cuando pruebes otros Scooters fliparas aún más. https://t.co/DMs9z0tzUO Espero de todo corazón que hayáis pasado un gran fin de semana. https://t.co/ZQ5hOPg6lx Mucha suerte campeón, te queremos. Saludos. db https://t.co/ndToZvo4IH RT @LaVozAntena3: .@davidbisbal estará en #LaVozKids en @antena3com 🎤 ¿Qué voces te gustaría que tuviera su equipo? ¿Eres del #TeamBisbal?… Vuelvo a #LaVozKids mi casa. https://t.co/4q5LVgt7YT Ave María!!! Vais a flipar!!!! @Camila_Cabello https://t.co/SIf6AVp9lq https://t.co/ZwLOAuHcIc Aquí cantando con @Camila_Cabello que bien me lo pasé con ella cantando en su concierto en Madrid https://t.co/2NiZwiw01k Feliz miércoles!!!! Hoy es un día muy especial!!! https://t.co/IKa9ErvyR7 atentos! https://t.co/guqCEtTzua Feliz Martes mi gente. https://t.co/b51GLaWDDD https://t.co/mHoIc9vjYI RT @teambisbalarg: Ya que en dia de hoy salio la preventa de @davidbisbal para el 9 de  noviembre en el hipódromo de palermo disponibles  e… Todo el mundo apoyando a la selección española!!!! Un abrazo fuerte!!!!! @SeFutbol https://t.co/UgLcgX33et Acaba de salir la preventa para nuestro concierto en el hipódromo de Palermo, Buenos Aires, Argentina 🇦🇷 el 9 de noviembre! https://t.co/X4by8lKPl0 https://t.co/wUGlCXuBzy RT @canalsur: ¡Y #JuanYMedio se atrevió con la 'bisbipatada' voladora 😆💪🏻 de @davidbisbal!\n#MenudaBisbal 📺 #CanalSuralaCarta\n▶️ https://t.c… RT @bisbalpress: ¡Enhorabuena Colombia! #Rusia2018 K`naan &amp; David Bisbal Wavin' Flag Video https://t.co/RPR761Pvfh vía @davidbisbal Nos uni… Actuación completa de #SiPeroNo con @alfredgarcia en mi canal de @YouTube espero que os guste.\nhttps://t.co/u0BZEZ6fKS Vaya fin de semana que nos espera!!!! Además que los cuatro conciertos siguientes serán mi tierra de Andalucía! https://t.co/OoCOfGlPqi RT @bisbalpress: Si te lo perdiste, si lo quieres volver a ver, YA está aquí, #menudaNoche, programa completo con David Bisbal - VIDEO @dav… Qué alegría me da pasar siempre por @menudanochetv gracias amigos de @canalsur Os quiero mucho https://t.co/RxSZIouUh5 Atención la semana que viene salen a la venta las entradas para el hipódromo de Palermo . 9 de noviembre Buenos Aires Argentina. Qué felicidad! https://t.co/QWIH8oakVm #siperono cantando en la plaza de toros de Valencia con @alfredgarcia eres un valiente amigo!! Fuerza y luz. db https://t.co/C9NDnn1QsO Un abrazo desde Valencia. Ya estamos listos para la prueba de sonido y el concierto!! https://t.co/E9voG4ufGz Un poquito de #wavinflag para animar a la selección https://t.co/tfFUAQqWfz https://t.co/iKS1yHNmUy He subido mi vídeo oficial de “mi princesa” en mi canal de YouTube en directo desde Barcelona, @PalauSantJordi con @Aitana_ot2017 Me lo han pasado mis compañeros que trabajan con las cámaras en el tour 2018! Espero que os guste. https://t.co/RrtDZ6Zwo6 https://t.co/VXCFDQZufO Este peldaño sin ninguna duda es para en marcarlo!!!! https://t.co/ai83A1y3iU @alfredgarcia Lo pasaremos espectacular amigo Alfred. Gracias por ese cariño que me has regalado desde pequeño!!!! Espero que la gente disfrute con nuestra colaboración. Un abrazo muy fuerte. RT @alfredgarcia: ⚡️¡Este Jueves 21 estaré cantando con @davidbisbal en la Plaza de Toros de Valencia!⚡️¿Quién me iba a decir con siete año… Han sido dos conciertos seguidos muy emocionantes. Con la participación de @LucianoPereyra @_CarlosRivera os dejo con el video capítulo de Madrid! https://t.co/QRn7fDjelP ￼ https://t.co/c9hdw6XG0j Felicidades Mexico  🇲🇽 por este gran partido!!!!! Vamooos https://t.co/KyuQdBNWpc Felicidades amigo @alo_oficial por esta grandísima victoria en equipo de las #24LeMans que felicidad!!!! Te queremos. https://t.co/FjiJVaX5b5 Gracias por aceptar la invitación de cantar conmigo en Barcelona! Te deseo todo lo mejor siempre! @aitana_ot2017 gracias Barcelona por esta noche tan especial!!! https://t.co/LtlJmo8GEj Hoy cantamos juntos @Aitana_ot2017 que bien lo vamos a pasar! Que canción os imagináis que vamos a cantar? https://t.co/ujyJ6vukUZ https://t.co/Bs1ocUYDA0 Siempre con la @SeFutbol vamoooooooooos!!!!! https://t.co/mwrxS4ceZ2 Amigos!!! @_CarlosRivera y @LucianoPereyra muchísimas gracias por el arte que tenéis. Ha sido un privilegio teneros en casa, en España, cantando conmigo en Madrid. Nos vemos pronto. https://t.co/pP3LCI2Foe Por fin ya llegaron los nuevos modelos de mi colección exclusiva de gafas @clandestine_es  que dona el 50% de todo el beneficio a @juegaterapia  que ayuda a los niños con cáncer. Espero que os gusten tanto como a mí. https://t.co/DtBpYMPlWH Con mi gran familia de @UniversalSpain y #AlejandroAsensi Antes del concierto de Madrid!!! Este reconocimiento es vuestro y de nadie más! Os queremos! #APartirDeHoy https://t.co/R0hf44YoDu Momento especial después del conciertooooo!!! Cumpleańos feliz a mi @RosannaZanetti feliz en todos los sentidos de la vida! 😍 https://t.co/j7eWdKBoAW Podemos ser el botón de emergencia para los 73 millones de niños en todo el mundo que sufren cada día trabajando en las condiciones más extremas. Hoy, en el Día Mundial contra el Trabajo Infantil, alzo mi voz con @unicef_es. Video completo https://t.co/bi44yt4Xk6\n#TheUnescapeRoom https://t.co/gjSdzVtHO1 Aquí está el Making of de @clandestine_es en Los Angeles, disfruté  mucho con el equipo de @bernardodoral . Además esta semana salen nuevos modelos de mi colección exclusiva de gafas que dona el 50% de todo el beneficio a @juegaterapia  que ayuda a los niños con cáncer https://t.co/GPMPUFjJBz #videocapitulo de Almería, Roquetas dedicado a los clubes de fans y a todos los seguidores! Gracias por todo lo que hacéis por acompańarme en las giras!! https://t.co/VEwGWIoCjL https://t.co/AlEBKl0SH3 Amigo @LucianoPereyra  como no voy a poder acompańarte en el estadio #velez el 8 de dic ni tú al mío del 9 de nov en el #hipodromo de Palermo, rápido tío que llegas tarde al aeropuerto! No te preocupes!! te hemos facturado todo lo que necesitas para cantar conmigo en Madrid.😂😂 https://t.co/0HcJe4nQVY Esto era impensable, que cifra tan bonita. Todo esto ha sido posible gracias a vosotros. https://t.co/WCayla2rNf Javier, tu eres un gran bisbalero y quiero felicitarte tu cumple, te deseo todo lo mejor. Gracias de todo corazón. https://t.co/KRBIuZmF7z RT @agenda_db: Próximas paradas de @davidbisbal y su #DavidBisbalTour2018\nCompra tus entradas en\nhttps://t.co/00WAXfdIAB https://t.co/iUyVa… RT @Canal_Estrellas: Pasa una tarde divertida viendo @TodoQuedaEnFam y además, disfruta de la música de @davidbisbal. Este sábado a las 6:3… Que bien lo vamos a pasar!!!! Un abrazo!!! https://t.co/UDUyfq3z66 El próximo video capítulo será un homenaje a aquellas personas que nos siguen concierto Tras concierto! Nada de esto sería posible sin vosotros! https://t.co/7iujG4j0y8 RT @FCDavidBisbalUY: .@franmunozfotografo vía Facebook. Os dejo una muestra de mi visión del concierto inicio de gira de @davidbisbal un co… RT @telediario_tve: .@davidbisbal  arrasó anoche en Roquetas de Mar, en Almería. Un concierto con el que inicia una gira que le llevará por… Felicidades @RafaelNadal por tu 11ª @rolandgarros que emoción!!! https://t.co/v6Safdx1D7 RT @lavozdealmeria: 🎤🎵 Más de dos horas de concierto de un David Bisbal que derrochó energía y cariño en su regreso a Almería.\n\n📹📷 Incluye… RT @bisbalpress: Galería de Imágenes (19) Inicio de Gira de David Bisbal  https://t.co/J3MSwwtEQq @davidbisbal en Roquetas Estoy muy agradecido con todos! Un beso muy fuerte! Gracias por acompańarme en el arranque de la gira en Roquetas. Todas  aquellas personas que esperaron días en la cola y aquellas que desde otros lugares también estuvieron presentes! 🙏🏽 la próxima cita será en Madrid! https://t.co/vmGK77Jqro Será la primera vez que haga dos giras consecutivas en España y me parece muy interesante. Como no podía ser de otra manera, empiezo en Roquetas de Mar Almería. Gracias a toda esa gente que estará presente de una manera o de otra en el inicio de este tour 2018. https://t.co/2PRQU3xKUO RT @Los40Catalunya: @LucaCattu @PalauSantJordi @davidbisbal Hola Luca!! El concurso es en instagram, coméntalo ahí para que puedas acceder… RT @PepiyFernando: @NazaretNavarro - Sólo tengo para ti palabras de admiración, respeto y cariño incondicional. Cuando te tengo tan cerca m… RT @clandestine_es: @LoreDera @juegaterapia @davidbisbal @locasxdavid ¡Las gafas están disponibles para Argentina con envíos gratis a travé… RT @TonyAguilarOfi: Hoy mi querido @davidbisbal es el protagonista de mi blog con el inicio de su TOUR 2018!!! https://t.co/d0af8whWr4 RT @bisbalpress: ¡Almería! @davidbisbal y parte del Club de Fans https://t.co/NibWj7wwJe RT @juegaterapia: ¡Mil gracias por toda vuestra ayuda! @davidbisbal, @clandestine_es, sois dos grandes. https://t.co/FeHVHYQ0ea Feliz cumpleaños querido amigo @JuanLuisGuerra Viva tu arte! https://t.co/fFKjAMhTCQ https://t.co/aPQ4U7kWiX Qué mejor regalo de cumpleaños que poder compartir con vosotros mi primera colección exclusiva de gafas de sol @clandestine_es que donan el 50% de todo su beneficio a la Fundación @juegaterapia que ayuda a los niños con cáncer. https://t.co/3IJft297U1 Que bonico eres Alfred!!! Gracias 😊 estoy deseando conocer tus nuevas canciones https://t.co/5ru1lMS6Pe RT @Los40: .@davidbisbal  y @Aitana_ot2017, juntos en el escenario https://t.co/LwCn8KnuaN https://t.co/t8GT0FQhBs No puedes ser más grande!!! https://t.co/a2WQ6DH20p Hoy os he escuchado en el programa, qué alegría de concurso. Mucha suerte para todos los ganadores. #Apartirdehoy https://t.co/Zcf8Kanalg Viva mi tierra, contando las horas para llegar. https://t.co/qO5fJ15SCG Os Quiero compañeros y estoy deseando que llegue el mes de julio para poder cantar en el festival https://t.co/8Oe4fmsFdW RT @clandestine_es: ¡Estamos de  DOBLE celebración! 🕶🎁\n\n¡¡Feliz cumpleaños @DavidBisbal!! Lo celebramos con su nueva colección  que dona el… Me fascina y me emociona!!!!! https://t.co/g3wYXoBiMv Por eso soy fan y fiel seguidor de mi club de fans! Me llena de felicidad vuestra generosidad y solidaridad!! Os quiero mucho. https://t.co/6hqhRxTenq RT @SlowMusicPozo: -@davidbisbal te invita a que disfrutes de su música y de la mayor dehesa de Europa. #SlowMusicPozoblanco2018\nEntradas:… La vida de un artista no es solamente subirse al escenario y cantar! Gracias por vuestra entrevista amigos. https://t.co/vaH2YI6SWj Gracias por tu felicitación Antoñico!!! Este verano lo celebramos en Marbella! https://t.co/g1gmDIz9SH Muchísimas gracias por tu cariño. Nunca olvidaré el abrazo que me diste antes de entrar a la academia de operación triunfo de la última edición! https://t.co/D2ya110Y4P Pufff que buena pinta tiene todo!!! Vamos compańeros. https://t.co/QByKoxRmVb Muchísimas gracias compañeros de @LatinGRAMMYs un abrazo muy fuerte a todos https://t.co/PsQCKoc25e Olé olé y olé!!!! La canción que quieras!!! Nos vemos el 16 de junio en Barcelona!! Y disfruta de todo lo que te está pasando. Un Besazo. https://t.co/Rxrs2u8KGQ Oyeeee!!! Por qué no te vienes a uno de mis conciertos a cantar conmigo??? Sería genial!! Voy a pasar por tu tierra!!!👌🏽 https://t.co/C90h1viM3r Muchas gracias @Aitana_ot2017 por tu mensaje de felicitación! Tú sí que eres una máquina. Te está yendo genial! Mucha suerte con todos los conciertos que tienes por delante. https://t.co/6e4hJeKl24 Thank you for your compliments can’t wait to be part of the @WORLDMUSICAWARD again soon! https://t.co/mQzXwxex7M RT @DialCatalunya: Si tens la teva entrada pel concert de @davidbisbal el 16 de juny, ara pots optar a conèixer-lo en persona i assistir a… Gracias por tu cariño siempre Oscar, recibe un fuerte abrazo https://t.co/DaOEUEKwhv Gracias a ti querido amigo Anxo, tengo ganas de compartir con la gente algunas de las sorpresas que estamos preparando, gracias por tu apoyo. https://t.co/cNwjsECX2O sI señor, el 16 nos vemos amigos de Barcelona, que ganas de volver a cantar en este maravilloso templo. Os quiero. https://t.co/0SJ8Uy0191 guau, gracias por todos los comentarios, Un abrazo muy fuerte a todos. https://t.co/qd1HAjERb0 qué ganas de reencontrarme con mi publico del festival, viva Andalucia, os quiero. https://t.co/OViDnrgQJr gracias por este cariñoso reportaje, besos. https://t.co/TknWuIdsC1 Este fue uno de los momentos mas bonitos de la gira el año pasado, deseando volver a cantar contigo compañero. viva tu arte. db https://t.co/I6LOV8Rdo9 Besos para mi gente bonita de Uruguay, pronto volveremos seguro. https://t.co/VmjzaK1564 Mi Venezuela hermosa que siempre te tengo en el corazón y en mi mente, me dueles Y sueño con el día de volverte encontrar con una sonrisa de oreja a oreja. Os quiero. https://t.co/Iy1KeRkuNm Besito para mi gente de Portugal.Muy pronto estaré con vosotros. https://t.co/gAOhVf5U0F Muchísimas gracias Almeria, tenemos un paraíso que hemos de cuidar entre todos. Viva nuestra tierra! Nos vemos en pocos días iniciando la gira. https://t.co/0yODO5LHva Muchísimas gracias música y noticias por vuestra gran labor. Os quiero mucho https://t.co/08EBs46hiX Esa foto chula!!! Con mi tía Manola de fondo. https://t.co/2TgTe9a5YG No hay más orgullo que tener clubes de fans solidarios aportando su granito de arena en la búsqueda de la cura contra el cáncer infantil. Besos. Gracias por este regalo https://t.co/gcWUSoH22K Pues claro que sí, a bailar se ha dicho!!! Ja ja ja ja ja ja 😂 gracias por vuestras felicitaciones. https://t.co/FddX2ngqfC Buenos días. Muchísimas gracias por todo vuestras palabras de carińo.\nUn beso a mi gente de Mexico 🇲🇽 https://t.co/7rBajxjrWf Buenos días desde España. Os dejo con tres fotos maravillosas de Buenos Aires con los diferentes clubes de fans. Qué ganas de empezar la gira y volver a reencontrarme con mi gente. https://t.co/mzFXyruTIx Me alegro mucho de la permanencia Os deseo todo lo mejor para la próxima temporada. https://t.co/zK5gVJu6x6 De Santiago de chile 🇨🇱 a Almeria! ✈️ https://t.co/kYWzivUP0Z https://t.co/obRmML9ktB Siguiendo las peticiones del club de fans. Aquí interpretamos esta balada hermosa para toda mi gente de Chile 🇨🇱 qué bien lo hemos pasado en el Movistar Arena! https://t.co/kYWzivUP0Z https://t.co/Pf4N4qDp9p RT @UMusicChile: El hit del momento #APartirDeHoy de @davidbisbal junto a @SebastianYatra fue ovacionado por todo el @movistararena ❤️🎉🎉🇨🇱🏆… RT @movistararena: David @davidbisbal ama a Chile y Chile lo ama mucho más hoy en #RadioDisneyVivo 💖✌️ https://t.co/FGvsFX7vuF RT @RadioDisneyLA: Después de Perú y Argentina, hoy será la tercera presentación de @davidbisbal en #RadioDisneyVivo. Mira cómo se prepara… https://t.co/2MvH5PBCAW dentro de poco nos vamos al recinto!! Que ganas de can’t esta noche! Ayer fue un día muy chulo en Santiago de Chile. Hoy tenemos un concierto en el Movistar Arena que no te lo puedes perder. Gracias por todo el apoyo siempre. https://t.co/ZH0OGnZfps Fantástico! Me encanta felicidades 🎈🍾🎉 https://t.co/IlGAUPGVFd Totalmente de acuerdo! 👍🏽 https://t.co/KvnSjMYk3S RT @bisbalpress: Antes de #Rojo, @davidbisbal estuvo ayer en FM DOS #VoyContigo, donde cantó #APartirdeHoy en acústico. VIDEO + minutaje: h… Siempre es un regalo volver a la Television de Chile. Os quiero. Este año volveremos si o si. Os espero mañana en el @movistararena https://t.co/aliBEBaqCN Os acordáis cuando cantamos “aquí estoy yo” https://t.co/ZHFBd8bG6G ##TBT @LuisFonsi @syntekoficial @NoelSchajris https://t.co/LPsTvhPfG3 Esta fue mi ultima foto en Argentina de este viaje! Volveremos prontos! El 9 de noviembre al hipódromo de Palermo en Buenos Aires! Os quiero. https://t.co/qxSkhmnL89 https://t.co/AyfPe34ZIU Ole! Me encanta esta colaboración!!! Que os ha parecido el disco?? Os quiero. https://t.co/PuGIluUo5r Y así comenzamos nuestro viaje a Chile!!! #APartirDeHoy https://t.co/73z9ub8Uzr Con muchas ganas de disfrutar ambos conciertos. El de Roquetas de Mar el 9 de noviembre y el de Sevilla. https://t.co/IdWePTMwfJ Se están dando cuenta que Almería es la provincia que más horas de sol recibe al año de Europa! Estamos todos muy felices! He leído que también van a rodar #Wonderwoman https://t.co/v330TjIst6 Rosa Madre mia la de vídeos que te graba tu marido! Un abrazo para el! Gracias por el carińo. Nos vemos en la gira. https://t.co/cPYZAVhHgi Ayer estos chicos cantaron muchas de mis canciones, y me sentí muy agradecido por tanto cariño que me demostraron. Muchas gracias 😊🙏🏽 https://t.co/uSl1pYm4fZ Ya sabéis que desde nińo siempre me ha gustado y he sentido la copla! https://t.co/tsB3YTxT92 RT @PepiyFernando: Emocionante! @davidbisbal responde a una fan y le dedica una canción muy especial https://t.co/V9zI2hQ9H2 ESTA AUSENCIA… Guau!! Me ha encantado la armonia!! Os quiero ja ja ja ja ja ja 😂 https://t.co/6pDWIe3P5Q Con ganas de llegar!! Gracias por vuestro carińo!!!! https://t.co/LCDtdpeaY2 Hola Fran, me encanta tu mensaje lleno de optimismo y fuerza para @U_D_Almeria esto es lo que el equipo necesita escuchar ahora mismo. Un abrazo desde Argentina. https://t.co/t6xJahIIpw Ya puedes ver el video capítulo de lo que vivimos en el @stadiumlunapark  concierto de @RadioDisneyLA aquí! Gracias @TiniStoessel @SebastianYatra y chicos de @CNCOmusic por vuestro cariño siempre. https://t.co/Lg4TwiNZXM https://t.co/0t1VLZ7RDe @alfredgarcia @Ceci_VasquezD @Miami1016 @vrl_pacovarela Lo único que sé querido @alfredgarcia es que a ti te queda infinitamente mejor ja ja ja ja ja ja 😂 un abrazo and keep it up!!! Gracias amigos @TiniStoessel y @SebastianYatra por acompañarme en el escenario del @stadiumlunapark en el concierto de @RadioDisneyLA El video capítulo viene en camino!!!! https://t.co/a3R0Shbh42 Qué tal amigos?, espero que estéis bien. Aquí ya podéis ver el video capítulo de Lima, en el concierto con los amigos @RadioDisneyLA @radiodisney en Peru 🇵🇪 espero que os guste. https://t.co/pAg5JfNaNE #Apartirdehoy https://t.co/E49k5EGtk4 RT @bisbalfanclub: https://t.co/wfBKbISntD Gracias a todos por el recibimiento en Argentina 🇦🇷 mañana tenemos concierto y el cuerpo lo sabe!! Os quiero!!! https://t.co/EAbsPRs8iD Radio Disney, qué bien me lo pasé ayer en Peru 🇵🇪 @radiodisney @RadioDisneyLA ya estamos listos para el próximo!! https://t.co/G7i2Cxf0tH https://t.co/Rl7hTrQZBp Buenos días. Ya está todo preparado para el concierto de esta noche en radio Disney en Perú 🇵🇪 ayer estuvimos probando sonido y se quedó todo perfecto, siempre necesitamos más tiempo pero con lo que tuvimos quedamos satisfechos. https://t.co/1oKnZYlilV Buenos días desde Perú 🇵🇪 hoy tenemos unos cuantos encuentros con medios de comunicación y por suerte nos han cambiado el sound check para el concierto de radio Disney hoy a las 5:00 de la tarde!  #APartirdeHoy https://t.co/RHmRexHqo0 Hola chicos del aula específica del Instituto Alborán de Almería. Muchísimas gracias por este video tan hermoso. Me ha llegado vuestro regalo. Gracias por tanto cariño. Os quiero! https://t.co/Y0thdFPziN Así se empieza con fuerza la semana!!! https://t.co/rGfObzUXlR Acabo de subir en el canal de YouTube el video capítulo de los ensayos para la gira del 2018 ya estamos listos para arrancar con todo! https://t.co/YAG50XlMOo https://t.co/If17BLIW9J Espero que paséis un maravilloso fin de semana. Mucha fuerza! Os quiero! https://t.co/vwvUgb6J7D Qué?? Estás preparado!!??? Tour 2018 https://t.co/rVzdV63XWW @StarliteFest https://t.co/YPQA1SyPfH Qué buen recuerdo contando con mi @antoniobanderas la canción del mariachi en @StarliteFest este vernano volvemos! https://t.co/OJ5BXCIVgG https://t.co/RFDjzfOFxS que bien lo pasamos siempre en Alicante. Os quiero. https://t.co/HP9u094bHI RT @musicagran: ya tenemos en las plataformas digitales #UltimateDuets de @sandovalarturo1 https://t.co/6Hzl3ZgghG  duetos con @AlejandroSa… Fantastica historia. Vivan los Almerienses. @lavozdealmeria https://t.co/eWamEOef4z Qué alegría me da cuando veo este tipo de trabajos que hace la gente con tanto cariño y esfuerzo. Quiero enviar un abrazo muy fuerte Al grupo Rocío moreno por este homenaje# pronto llegaremos a #Roquetas #9dejunio #APartirDeHoy https://t.co/nGtHiSkTVW Te va a encantar el trabajo tan bonito que están haciendo los músicos. Un abrazo muy fuerte Manuel. A qué concierto te vienes!? A Sevilla, a Starlite Marbella?? https://t.co/pc5DmFSJ20 Gracias a ti por ser siempre una buena profesional. Nos vemos en el arranque de la gira el 9 de junio en Roquetas de Mar, el 14 en Madrid o el 16 en Barcelona. Besos https://t.co/SNIaTJXK9o Segundo día ensayando con la banda y preparando la gira. Los arreglos y las transiciones entre las canciones son maravillosos! Estoy deseando que los escuchéis! https://t.co/rVzdV63XWW a quien le gustaría escuchar algo? https://t.co/6uUNtyruyV RT @bisbalpress: ¡Feliz domingo escuchando a @davidbisbal en spotify! - A Partir De Hoy de David Bisbal, Sebastian Yatra https://t.co/HfvUL… Ja ja ja ja ja ja 😂 me he partido de risa!! JordiChacon! Gabrielsimo ovideoportaz! https://t.co/IckHsynb4n Es verdad!!!! Ja ja ja ja ja ja 😂 viva Almeria! Vaya ojo que tienes nińa! https://t.co/GtWSXyySpV Ojalá que ganen nuestro @Alfred_ot2017 y @Amaia_ot2017  otras voces que me han encantado Estonia 🇪🇪 , Alemania 🇩🇪 , Albania 🇦🇱 , Australia 🇦🇺 Y me ha gustado mucho el espectáculo de Israel 🇮🇱 mucha suerte! 🍀 #finalEUROVISION y vosotros? Vamoooooooos @Alfred_ot2017 y @Amaia_ot2017 My 12 points go to Spain! #Eurovision Qué tal lo estáis viendo?? @eurospaincom me ha gustado mucho como lo han hecho @Amaia_ot2017 y @Alfred_ot2017 !!!!felicidades chicos! Viva la música! https://t.co/cyDlwY2UK5 Feliz fin de semana a todos!!! A recuperar fuerzas para la semana!! Os quiero! https://t.co/M5pqPlaXc4 https://t.co/sJrGxFoxHk https://t.co/YYQU0YMOPT RT @BISBRASIL: Porque o fim de semana está só começando e para animar vamos ouvir #APartirDeHoy do @davidbisbal 💃💃💃💃💃💃💃💃💃💃💃\n ¡Viva Latino!… RT @BISBRASIL: #ApartirDeHoy do @davidbisbal\nna playlist Tempero Latino de @SpotifyBR 🇧🇷🇧🇷🇧🇷💃💃💃💃💃💃🙌🙌🙌🔝🔝🔝🔝🔝🔝🔝🔝❤❤❤🎵🎵🎶🎶🎶🎶\nhttps://t.co/8i8Xwhs… Ya podéis ver el super capítulo de Colombia 🇨🇴 qué bien me lo pasé aquí en este link puedes ver la versión larga. https://t.co/yB05AINss5 https://t.co/DnxOrJBTSQ Realmente me lo pasé super bien en la voz kids Colombia 🇨🇴 Gracias por todo el apoyo https://t.co/bkZ5fo4emO Buenos días. Muchísimas gracias Colombia por tanto cariño. Me lo pasé muy bien en @LaVozKidsCo os quiero!! Os deseo un maravilloso viernes. https://t.co/szzpCCw0A1 Que honor volver a @LaVozKidsCo cantaremos con @SebastianYatra #Apartirdehoy https://t.co/46uCwyTikn Realmente algo impensable. Estamos todos muy felices de estos números que han sido posible gracias a todos vosotros.\nhttps://t.co/QBlCKI7N8y https://t.co/VEuexKo02l RT @musicagran: @davidbisbal nos comparte este recuerdo con @rihanna en su #Instagram ¿te acuerdas? https://t.co/wjDSEVwsp2 https://t.co/n6… RT @PalauSantJordi: El 16 de juny torna l'huracà @DavidBISBAL a Barcelona!  🌪 😝\nEntrades a @TicketmasterES https://t.co/UG3WURKbrI RT @StarliteFest: Ayer nos lo pasamos genial viendo a @davidbisbal en @El_Hormiguero :D ¡Estamos deseando volver a verte subido a nuestro e… RT @antena3int: ¿Quieres ver el resumen de las visitas de @davidbisbal a @El_Hormiguero 🎤? ► https://t.co/hgBwjirJOf ¡Con saludo especial a… Como embajador de @unicef_es os pido ayuda. \nMás de 700.000 personas #rohingya, la mitad niños, viven hacinadas en un campo de refugiados en Bangladesh.  \nNecesitamos ayuda urgente para vacunar a los niños y para crear espacios seguros. \nAyuda en https://t.co/CRIUmtBOAK https://t.co/zCIvIJgtL6 Ha sido fabuloso todo lo que ha sucedido desde que salimos como en nuestra nueva canción #apartirdehoy queda muy poco para subir al escenario y comenzar a cantar todas las canciones del repertorio!!! Os quiero! Hay canciones que no he cantado en más de una década. https://t.co/gyyBPA7aCz RT @bisbalpress: A Partir De Hoy de David Bisbal, Sebastian Yatra https://t.co/qqo7Z857MV #NowPlaying @davidbisbal #BisbalEH Vamos que ya arrancamos con la gira!! Os quiero y gracias por todo el apoyo!!!!! https://t.co/rVzdV63XWW   https://t.co/QBlCKI7N8y https://t.co/KiP7yD2Gjr Nos vemos esta noche en @El_Hormiguero que ganas de pasarlo bien otra vez. https://t.co/3FVDTiC5OK RT @BISBRASIL: Feliz terça ❣ E para começar bem o dia vamos de #APartirDeHoy\ndo @davidbisbal 🎶🎶🎵🎵🎶🎶🎵🎵🎵🎵Verano Forever de @SpotifyBR \nhttps:… RT @teleaudiencias: David Bisbal (@DavidBisbal) visita esta noche 'El Hormiguero' (@El_Hormiguero), a partir de las 21:45h en Antena 3 (@An… Qué alegría, gracias a todos vosotros hoy hemos llegado a una cifra tan hermosa!!!! 80 millones de reproducciones #Apartirdehoy https://t.co/QBlCKI7N8y https://t.co/9qjQ3uVnhE Feliz día de las madres!!! Espero que estéis pasando un feliz Domingo en familia. https://t.co/FZg1gtvVYC Hola 👋🏼 compańeros!! Que alegría me habéis dado! Os quiero! https://t.co/Gqbgmye1GF Ole, ole y ole!!!!!!!!!!! Llego hoy de viaje y sorpresa!!! Gracias compańeros y gracias a la gente guapa!!!! #APARTIRDEHOY https://t.co/qHsQCDDMSa RT @spain: A lo largo de más de doscientos kilómetros de litoral, #Almería despliega lo mejor de sus playas, calas y costas. \nPero la #Cost… RT @bisbalpress: ¿Te gustaría ver a David Bisbal en 'El Hormiguero 3.0' el próximo 8 de mayo? https://t.co/DCHjMIDDbA vía @El_Hormiguero Ya con la mente puesta en los ensayos individuales para dar comienzo la gira de conciertos. No quería dejar de compartir este pequeño mini capítulo de lo que viví en México con su gente!! Gracias por tratarme siempre Como un mexicano más. https://t.co/woMwGfTCcJ https://t.co/ChAlMYqK47 Un saludo desde Colombia. Ya queda muy poco para empezar con los ensayos y preparación de la gira. Tendré dos momentos muy importantes para aprovechar los ensayos . uno en mayo y otro en el escenario de roquetas unos días antes de empezar la gira. https://t.co/ek80ZKZ4cB https://t.co/6ngzfs8axu RT @BISBRASIL: Vídeo #APartirDeHoy do @davidbisbal no ¡Viva Latino! de @SpotifyBR 🙌🙌👍👍🙌🙌🙌🙌❤\nhttps://t.co/5cZaxAms6A RT @bisbalpress: A Partir De Hoy de David Bisbal, Sebastian Yatra https://t.co/hwId1BhYPq #NowPlaying ¡energía para comenzar este día! Gracias por todo el cariño Colombia, os quiero mucho. db https://t.co/bYRyqfzyoX Que bien me lo he pasado en Mexico!!!! Os quiero tanto!! https://t.co/q9LgTEo4Gi Thank you my friend Arturo Sandoval. I’m very happy to being part of this amazing dream. I really enjoyed the studio time with you and the producers. Gracias amigo Arturo, es un sueño estar aquí contigo y con todos estos grandes artistas! https://t.co/GnsFnfEVSj A mí estos días se me han pasado volando trabajando, no me he dado cuenta del fin de semana pasado que lo pasé en el estudio y viajando ni del puente. Os mando muchos besos y mucha fuerza para todos los trabajadores, feliz día!! https://t.co/Js0B8p1yax Nos lo pasamos genial!! Es un no parar de reir! #LaVozKidsAsalto2 https://t.co/CfOoC9wzin Muy contento de haber vuelto a mi casa @LaVozKidsEsp !! Que gran trabajo han hecho todos los coaches: @PabloLopezMusic @antoniorozco @rosarioficial @RosanaOficial @MelendiOficial @vanesamartin_ , enhorabuena, compañeros!! https://t.co/aqtHEzcJ3Z Dificil, dificil....! Nivelazo! #LaVozKidsAsalto2 https://t.co/fKOEm07kvN Qué equipazo!! #LaVozKidsAsalto2 https://t.co/COdz76qy0m Qué deliberaciones nos quedan @PabloLopezMusic y @antoniorozco ! Los niños han cantado genial todos! #LaVozKidsAsalto2 https://t.co/anJRDFMOV1 Qué honor ser Supercoach de esta edición de @LaVozKidsEsp ! Y cuanto me río con mis compañeros!! #LaVozKidsAsalto2 https://t.co/mdpVnc0HdN Que dificil lo tenemos esta noche @antoniorozco , teneis un equipazo! #LaVozKidsAsalto2 https://t.co/wKhebrLqoP Qué bien me lo pasé actuando con los niños en @LaVozKidsEsp la semana pasada! Cuanto talento! #LaVozKidsAsalto2 https://t.co/naS5XWlJ90 Esta noche tenemos tarea @antoniorozco !! #LaVozKidsAsalto2 https://t.co/pfFXTJMUYu RT @telecincoes: .@davidbisbal trajo más alegría si cabe a @LaVozKidsEsp 😍 Esta noche a las 22:00h se termina el 'Última Asalto' con el equ… Esta noche se van a vivir muchas emociones en @LaVozKidsEsp , os esperamos a las 22 h.! #LaVozKidsAsalto2 https://t.co/0tdu0tIDbj RT @LaVozKidsEsp: .@_JesusVazquez_, @taniallasera, @rosarioficial, @RosanaOficial, @antoniorozco, @PabloLopezMusic, @MelendiOficial, @vanes… Good morning!!!!☀️🌞😃 Buenos días a todos. Hoy no te puedes perder @LaVozKidsEsp gracias por hacerme #SuperCoach https://t.co/xBpGTGRbPZ Felicidades 🎉🎈🍾 @RafaelNadal un abrazo fuerte! https://t.co/UrTMkvKCGh Si amigos, tenemos colaboración con la banda el recodo para celebrar su 80 aniversario!! Muy feliz. Viva México 🇲🇽 https://t.co/SXrXcuLO2u @ElRecodoOficial @PonchoLizarraga https://t.co/70eBU9gUlg RT @bisbalpress: #APartirDeHoy de @davidbisbal y @sebastianyatra acaba de rebasar los 75 Millones de reproducciones en youtube. ¡Enhorabuen… Con los amigos de @manaoficial máquinas !!! https://t.co/0c41cnRaVK https://t.co/SO79bdule9 RT @Spain_in_CH: We have a plan for you: \nDiscover the underwater world of the Cabo de Gata-Níjar Nature Reserve in #Almeria \nYou read it r… Antes de llegar a México y Colombia he pasado a visitar a unos amigos de Los Ángeles. Adivináis quien? https://t.co/Z0ZbRy9MRi os comparto también todo lo que se vivió en la gala de los @LatinBillboards vídeo capítulo https://t.co/aN54IgrwGu RT @bisbalpress: ¿Tienes un ratito tranquilo? Puedes ponerte al día de todo lo más relevante del paso de @davidbisbal por Latin Billboards… Lo hemos pasado muy bien en los @LatinBillboards . Os mando un abrazo muy grande. Seguimos! Próximamente nos vemos en México y en Colombia. https://t.co/ydUrayKcYo https://t.co/j2QyrUjR21 Qué parte del NO es la que NO se entiende...??\nPor favor que se haga justicia\n#noesno #noesabusoesviolacion https://t.co/R4UwCvLuB6 https://t.co/6GNLBfcqtP Gracias por vuestro carińo!!!!! https://t.co/WgroCIYfjn Me lo he pasado espectacular!!!!!!!!!! https://t.co/XnMJt7l1CO Ya estamos listos para la gala del 20 aniversario de @LatinBillboards estamos deseando subirnos al escenario para poder cantar #ApartirdeHoy https://t.co/a5CqNu4ZVa https://t.co/3YfrJxjgJP RT @PepiyFernando: VER PRECIOSO VIDEO! #Entrevista @davidbisbal y Sebastián Yatra presentarán en los Premios Billboard su tema en \"A partir… Hoy tenemos varias actividades de promoción! por lo que estaré compartiendo con vosotros desde las Vegas. @LatinBillboards https://t.co/wCPG6kOOvj Un abrazo amigos de @CNCOmusic máquinas! https://t.co/WhChKjac1b maquinas, muchas suerte. db https://t.co/jOljbsOCBh Buenos días desde Las Vegas. Ya estamos listos para los  @LatinBillboards hoy tendremos ensayos y algunas sorpresas más. https://t.co/wQwdvpRgfJ Enhorabuena a todos!! 👏 👏 https://t.co/wyWGh5SWNZ Amigo @PabloLopezMusic que alegría volver a reencontrarnos!! Me encanta este abrazo a 3 con @antoniorozco !! #LaVozKidsAsalto1 https://t.co/TKoUtSg3eW .@rosarioficial @RosanaOficial solo puedo felicitaros y daros mi enhorabuena por vuestra labor en el equipo!! Complicado se pone elegir! Qué grande eres amigo @antoniorozco y cuantas emociones hemos compartido en @lavozkidsesp!! Tengo mucha suerte de tenerte!! #LaVozKidsAsalto1 https://t.co/jSu3Dx0rWG Bravo!! 👏 👏 https://t.co/S50WL2WNUD Qué grandes compañeros @melendioficial y @rosanaoficial!! Está siendo una noche muy especial en @lavozkidsesp! #LaVozKidsAsalto1 https://t.co/3AfT7g2Erj .@MelendiOficial @vanesamartin_ sinceramente daros mi enhorabuena, que equipazo teneis lleno de talento! Qué dificil! .@taniallasera muchisimas gracias de verdad!! Yo también te admiro mucho! #LaVozKidsAsalto1 https://t.co/gaCmXt1a6e .@rosarioficial qué momentos tan especiales hemos compartido juntos en @lavozkidsesp, y cuantas risas amiga!! #LaVozKidsAsalto1 https://t.co/dKuj8HHE3f Álvaro, muy contento de compartir escenario contigo con Culpable!! Máquina! #LaVozKidsAsalto1 https://t.co/2utw1akOIx Tampoco tú eres Taylor Swift pero te quiero igual!! #LaVozKidsAsalto1 https://t.co/iCjJRALCOv Estoy seguro de que me lo van a poner muy dificil esta noche!! #LaVozKidsAsalto1 https://t.co/Asgw8v1gnU Muchas ganas de hacerlo genial como Supercoach en @lavozkidsesp!! ​A por todas! #LaVozKidsAsalto1 https://t.co/tugbPuWRvM RT @LaVozKidsEsp: ¡Bienvenido a casa, @davidbisbal! #LaVozKidsAsalto1 &gt; https://t.co/qXjop0dV6J https://t.co/hNxyqNChW3 Maravilloso compartir escenario con el talento de los niños de esta edición de @lavozkidsesp!! #LaVozKidsAsalto1 https://t.co/IcuN0rGy6X Por supuesto que estoy preparado!! Vamos!! #LaVozKidsAsalto1 https://t.co/xbEJJgzazp Muy emocionado de volver esta noche a mi casa, a @lavozkidsesp, no os lo perdais que prometo muchas sorpresas! #LaVozKidsAsalto1 https://t.co/UGYYFW2Wmr Y sigo esclavo de sus besos 😘 https://t.co/9OUTRX70Ux RT @CADENA100: ¡Vamos! @davidbisbal sigue rompiendo marcadores y se acerca a las 70 millones de visualizaciones de su último número uno #AP… RT @mediasetcom: ¿CÓMOOOOOOOOOOOOO? ¿Hoy vuelve @davidbisbal a @LaVozKidsEsp? 😍😍😍😍😍😍😍😍😍😍😍 https://t.co/qoq55gRere Mirad la sorpresa que les di.... ja ja ja ja ja ja https://t.co/xt8ZD1wIlk no te lo pierdas mañana en @LaVozKidsEsp https://t.co/ZFvNDPjKk7 RT @grupoboomerang: El lunes llega @davidbisbal al #ÚltimoAsalto 👏👏👏 Sorpresas y mucha emoción en #LaVozKids. ¡No os lo podéis perder! @LaV… RT @bisbalpress: A Partir De Hoy de David Bisbal, Sebastian Yatra https://t.co/sHiQaCEJGT #NowPlaying Escuchando a @davidbisbal en Spotify Cuantas nińas tengo en mi casa!! 😍😂 https://t.co/mzCCCkftGG Pues no lo sé amigo, ojalá que sí. Ese es mi deseo. Os mando un abrazo muy fuerte. #APartirdeHoy https://t.co/bUttJeEQvX RT @los40Panama: #28 A partir de Hoy @SebastianYatra @davidbisbal  #Del40al1PTY https://t.co/HBFUW8MSG1 https://t.co/ywAKKr4Rg0 RT @Del40al1_es: #27 (+2) @davidbisbal &amp; @SebastianYatra A PARTIR DE HOY\n#Del40al1CocaCola https://t.co/eS0pOnT8qo https://t.co/UfXnjG1zC2 Qué os parece como están creciendo los perritos 🐶? https://t.co/WSY66YukCJ Felicidades 🎈🎉🎊 siempre has sidoa niña muy respetuosa y muy cariñosa. Gracias por seguir en la familia Bisbalera. Muchos besos. https://t.co/ciVC8QNOqg Ya podéis ver el video vertical de #APartirDeHoy en #VivaLatino! https://t.co/xtVARKqGcd (Solo para Latinoamérica y EEUU) ¡Gracias @Spotify @SpotifyLatino @Spotifymexico! https://t.co/eqHUZ2eZos Buenas noches!!! Deseando que llegue la semana que viene para disfrutar de @LatinBillboards https://t.co/2PgJXIrmL4 https://t.co/KqsqUor4DD RT @LaVozKidsEsp: El próximo lunes, @davidbisbal reaparece en el 'Asalto final' de #LaVozKids 👏https://t.co/YxvTg62Ybj https://t.co/e23rPim… RT @bisbalfanclub: FALTAN 8 SEMANAS!!! Para dar comienzo a #DavidBisbalTour2018 Consigue ya tus entradas para los conciertos de la gira de… Cantaremos en los @LatinBillboards y estamos locos!!!! Felicidad absoluta! https://t.co/w6FKYBRz5v https://t.co/tyN7tdoHUn RT @PepiyFernando: VIDEO!  @Del40al1_es  @davidbisbal , ENTRE LOS DESTACADOS DE LA SEMANA EN LA LISTA!! #DavidBisbal y Sebastián Yatra (  E… Yo siempre con mis bromas ja ja ja ja! Lo del charco era una broma, pero he visto que mucha gente que me ha seguido el juego... os quiero. @SpotifySpain anímate y grábate haciendo El Paso #APartirDeHoy https://t.co/CMIDmDqEFA RT @Maryhalm: @davidbisbal desde tu Almeria tambien nos animamos con tu #Apartirdehoy vamos!!!! Esperamos que te guste!!! #APartirDeHoySpor… 60 millones de gracias a todos!!!! 60000,000s of kisses for everyone!!!!!! @SebastianYatra #APartirDeHoy https://t.co/2wYGWt8n4n https://t.co/hdoy4xc6wE RT @BISBRASIL: Vamos animar o fim de semana cantando e dançando #APartirDeHoy\ndo @davidbisbal 💃💃💃💃💃💃🔝🔝🔝🔝\nBailando de Spotify\nhttps://t.co/7… Qué bien me lo he pasado con @JesusCalleja Y @nicoterol entrenando en León con la bicicleta!!! https://t.co/VcqZmG8YPp espero que paséis un buen fin de semana! https://t.co/uKWG0jqjCx RT @bisbalpress: ¡A empezar el día con energía y la mejor actitud! A Partir De Hoy de David Bisbal, Sebastian Yatra https://t.co/8U5VxofD3z… Aquí os dejo con las bromas de @JesusCalleja que es un gran amigo y que además está cumpliendo ańos! Vamos a abordarlo de carińo!!! Te queremos Jesús!!!!!!!!! Feliz cumpleaños 🎂🎉🎈 https://t.co/U8LrQqg5Cp Saludos, trabajando en el repertorio de la gira. Los ensayos están a la vuelta de la esquina!! @ludovicovagnone https://t.co/1zWG01PId7 Amigos de Brasil, muchísimas gracias por este cariñoso vídeo!! #APartirdeHoy https://t.co/w5RTFxX6Hr https://t.co/txYQqUYSNx Qué emoción ver con los amigos de @wooks_zumba en Corea han hecho este excelente trabajo para ponerse en forma!! I watched the video and I was completely fascinated congratulations and thank you guys. https://t.co/WggqU3AKgX https://t.co/zT14GhtRSF RT @PalauSantJordi: Empezamos la semana con @DAVIDBISBAL...lo tenga o no, el 16 de junio lo tendremos en Barcelona!\n\nhttps://t.co/LAgChuOSGA A que esperas para ponerte en forma! Nos acompańas?? https://t.co/T0qBnc2Ez3 #APartirDeHoySport https://t.co/UeJqP3bhfn RT @Del40al1_es: Nuevo candidato!\n@davidbisbal &amp; @SebastianYatra A PARTIR DE HOY\nApoyos con #MiVoto40\n#Del40al1CocaCola https://t.co/eS0pOn… 50 millones de gracias a todos. Estoy emocionado con tanto apoyo que hemos recibido con #APartirDeHoy en estas tres semanas! Feliz fin de semana. https://t.co/GdrK1M1TII Buenos días a todos. Os invito a participar en el #APartirdeHoyChallenge https://t.co/MhSaAUainO. @musicallyapp @musically_latin https://t.co/aRKoNlWR8u RT @CNIO_Cancer: ¿Habéis visto el vídeo de la visita de @davidbisbal y @juegaterapia a nuestro centro? Vinieron a hacer entrega de la 2ª be… https://t.co/bt6147gA7R Con los amigos de @SpotifySpain y @SebastianYatra para hablar de #APartirDeHoy ! https://t.co/FS8fzFtPAW Qué trabajo se está haciendo en el CNIO con la investigación contra el cáncer infantil desde España!  todos tenemos que poner nuestro granito de arena para conseguir una cura. https://t.co/CsI95m0RBl https://t.co/q2P0UWvpcf He pensado que voy a poner el baby pelón en la mesa de Merchandaising durante la gira de conciertos. https://t.co/nbXM8llssr RT @juegaterapia: Entregamos nuestra 2ª beca #JuegaterapiaInvestigación al @CNIO_Cancer para el estudio de tumores pediatricos cerebrales.… RT @bisbalpress: David Bisbal en su labor con Juegoterapia: \"Todos tenemos que poner nuestro granito de arena\" https://t.co/hW0WPNDItF vía… RT @latinpopbr: Nossos latinos amam fazer covers. Principalmente se for cover de outros artistas latinos. Relembre algumas das melhores ver… Muchas gracias Julia. Muchos besos https://t.co/lf4r3Aqxf0 Muchas gracias Miguel Angel. Un abrazo. https://t.co/YDGVgv38Wq Yo también me apunto. https://t.co/eqglu9fm2j Hola mi gente!!! Participa en el #apartirdehoychallenge de #musical.ly estaré compartiendo los videos más originales y el que más me guste me lo llevaré a uno de mis conciertos.\nOs quiero!!\ndb #apartirdehoychallenge https://t.co/2l5yDnp3n3 https://t.co/4P1QMb87Ms Qué te parece este vídeo de https://t.co/BtWsRq1ojB te animas tú a hacer uno parecido? Voy a mirarlos todos. https://t.co/TsX0YPIAc5 https://t.co/vDk7Q0G4hq besos! https://t.co/J9rSwXmrAR Qué bien me lo he pasado con mi amiga y paisana Laura grabando #ApartirDeHoy https://t.co/vDk7Q0G4hq. Espero que os guste!!!! https://t.co/wbzAxfoGbw Ayer tuvimos la oportunidad de visitar #CalarAltoObservatory en mi tierra Almería y fue una experiencia maravillosa. Ver la luna tan cerca fue realmente hermoso. Si Tenéis oportunidad no lo dudéis. https://t.co/dn1USFjRKn https://t.co/IDxV5rw7l5 Muy pronto nos veremos compańeros. Estoy muy feliz. #APartirDeHoy #Colombia https://t.co/i0BwCt8MYP Ha sido una emoción muy grande vivir de cerca la #SemanaSanta de mi tierra #Almeria espero que os guste el este vídeo! Os quiero. https://t.co/7xw3WHkn6A https://t.co/Jl6G4RrUD2 RT @SpotifySpain: ¿Qué tal te suena un encuentro con @davidbisbal el 5 de abril? Coge aire para no desmayarte. Podrás preguntarle lo que si… Estamos en la lista 'Éxitos de Hoy' de @AppleMusicEs con #APartirDeHoy!! Qué bueno, @SebastianYatra! https://t.co/JrSuja3A48 https://t.co/ZyoG5lPiQp En abril y mayo tendremos muchas sorpresas!! Besos! https://t.co/xkDdIe6bcn Gracias 🙏🏽😊 nos vemos pronto mi gente de Brasil! https://t.co/1ZnFB00mGe RT @Dani_Merono: Y como no! Dándole duro con #APartirDeHoy de @davidbisbal y @SebastianYatra en el Mundial de Media Maratón de @Valencia201… RT @TicketmasterES: ¡@davidbisbal y @SebastianYatra nos presentan 'A Partir de Hoy'! ¡Menuda combinación! Falta poco para ver al almeriense… Feliz Semana Santa?? Te gusta el color Del Mar de mi tierra #Almeria ? https://t.co/XwK5fWcTpS https://t.co/7QZmQwB7pQ Espero que disfrutéis de un maravilloso fin de semana y que empecéis la semana santa con la gente que más queréis!! Muchos besos!!! Después de las vacaciones tenemos muchas sorpresas en el mes de abril! https://t.co/MR5kjSuF1i https://t.co/4hnCP3fu81 Ahi estoy deseando encontrarme con mi gente, en mi casa. Os quiero. https://t.co/75VjOlb9Ji RT @UniversalSpain: ¡Entradas a la venta para el concierto de @davidbisbal en Roquetas de Mar! (incluidas front stage con ventajas exclusiv… Ya tenemos listas las entradas para el concierto de Roquetas de Mar. Nos vemos el próximo 9 de junio!! Deseando cantar #APartirDeHoy https://t.co/C2XJge5HxV https://t.co/u9LzRBRS4w Que os parecen los bebés de Nena!? Madre mía qué hermosura! https://t.co/ax8VxCjhlf https://t.co/aRxWCOIb9h Buenos días a todos. Lo que más me gusta de todo es reírme, hacer bromas y transmitir toda mi felicidad a mi gente. Espero que tengáis un maravilloso jueves. Nosotros seguimos alucinados con la evolución de la canción y el videoclip. Os quiero. #APartirDeHoy https://t.co/gJirlD0ZgX Este verano nos vemos en concierto. https://t.co/mCK3Ku6qOG Nos vemos el 16 de junio https://t.co/9fsGfs86xm Hola amigos. Buenas noticias mañana por fin salen a la venta las entradas para el concierto de Roquetas! Nos vemos en el inicio de gira por España 🇪🇸 aprovecho para agradecer una vez más el apoyo tan fuerte que hemos recibido! #ApartirDeHoy https://t.co/ZkWMfGYtbO https://t.co/Bs5kIZ4oRO Buenos días a todos! #ApartirDeHoy seguimos felices con la aceptación de la canción en todos los países de Latinoamérica.\nOs quiero mucho! Me encanta todos los videos que estoy recibiendo en #micoverApartirdehoy https://t.co/9YCbRiTM0N Os ha gustado este vídeo!? Descubre aquí como se grabó a partir de hoy y como nos conocimos @SebastianYatra y yo en nuestro concierto de Londres. Gracias una vez más por el apoyo tan grande que hemos recibido con #APartirDeHoy https://t.co/VTY5f6LpyJ RT @umusicbrasil: O @davidbisbal tem um convite pra vocês! Venham escutar \"A Partir De Hoy\", dele com o @SebastianYatra no Spotify! 👇 https… RT @SpotifyColombia: Que no importe si vas en el bus o estás sacando a tu perro, lo que @davidbisbal y @SebastianYatra nos trajeron esta se… Guau!!!! Katty también lo hace muy bien. #micoverApartirdehoy felicidades!!!!🎊🎈 https://t.co/cCWXXrsn6d Qué os parece?? #micoverApartirdehoy @EduardoOrozcoM https://t.co/WzM56fbD7o #FelizDiaDelPadre Feliz día del padre a todos. Cuando en una abrazo se funde el amor puro. https://t.co/JF4PcC8itk https://t.co/DHcYvB8K4O Muchas gracias, y un beso muy fuerte para mi gente de Italia 🇮🇹 #APartirDeHoy https://t.co/QLMASPcUmc Buenos días!!!!!!🌞😃☀️ si quieres mandar un cover de #APartirDeHoy escribe #micoverApartirdehoy os quiero!! Estoy deseando escucharlos todos. https://t.co/P2LLR8wzjL Que os parece??? Nena ha sido mama! Vaya fin de semana completo! https://t.co/dfdLp5KHKf Te queda muy bien amigo Tony!! Ja ja ja ja ja ja gracias 🙏🏽😊 eres un máquina https://t.co/6oDTMKh2LS Qué alegría tan grande lo que está sucediendo! #APartirDeHoy la has escuchado ya en @Spotify ? https://t.co/vYVbDpql8v os quiero! https://t.co/E8OnT26zKw Un saludo para mi gente de Portugal. https://t.co/cK6OlkO22L RT @billboardlatin: This Week in Latin Music: @CNCOMusic Releases 'Bonita' Video, @DavidBisbal and @SebastianYatra Join Forces for 'A Parti… Pues a mi me encanta Mentirosa compulsiva con nuestro niño @AbrahamMateo felicidades compańeros! Gracias campeones. https://t.co/908CTArpK7 Una vez más!!! 1000000000 gracias!!! Seguimos! Os deseo buenas noches desde Espańa!! Muchos besos. Me encanta cuando la gente me manda sus vídeos cantando #ApartirdeHoy https://t.co/QCrxtY0qHN Ese es mi Alfred!!!! https://t.co/Mz2smT6zTE Os mandamos muchos besos!! Estoy muy feliz y muy agradecido con todos los comentarios tan positivos! https://t.co/RWReBnFJsd  https://t.co/fL5VwRNIIl @SebastianYatra https://t.co/RTRdNEnztE Qué grande eres Luciano, te quiero mucho y estoy deseando verte pronto en Argentina. Por cierto aquí en España también te estamos esperando tienes las puertas abiertas. https://t.co/LzPgAVzJlK Ya empiezan a aparecer los primeros covers de #ApartirdeHoy muchas gracias @lucastarabini me encanta vuestra versión. https://t.co/rpHDNjYuGB #APartirDeHoy vamos a rumbear tambien en @TIDAL !  https://t.co/h0p0HopLrj https://t.co/5f3aNBPvz3 #APartirDeHoy vive, disfruta, baila! @AppleMusicES @AppleMusic https://t.co/ucetLLwPu1 Ya lo sabéis!! Estaremos cantando juntos @SebastianYatra y yo en el @stadiumlunapark con @RadioDisneyLA https://t.co/8Dgffin4ZK Qué bonito ver que os gusta tanto #APartirDeHoy Estoy muy agradecido. Os quiero mucho. https://t.co/nSA2H1rtQt RT @UniversalSpain: #APartirDeHoy Ya Es N° 1 de #iTunes en 10 países! Felicidades @davidbisbal y @SebastianYatra ! https://t.co/bcxrZ3tubv RT @SebastianYatra: #APartirDeHoy le vendaré los ojos a mi corazón, no quiero que te mire y vuelva a enamorarse! 💔❤️ YA DISPONIBLE EN TODOS… Què grande esa Paty. Muchos besos. Espero que te guste mucho. https://t.co/ag9xjCZWjQ Gracias nińo! Me encanta que te guste! Un abrazo fuerte! https://t.co/0nFbk10mvy RT @UniversalSpain: Felicidades a @davidbisbal y @SebastianYatra ¡#APartirDeHoy alcanza el millón de views en @Vevo en solo unas horas! ¡To… #APartirDeHoy ya es todo vuestro tambien en @AmazonMusic!! https://t.co/8zxLDYMFoD RT @AppleMusicES: 3️⃣\n2️⃣\n1️⃣\n\n¡#APartirDeHoy escucha lo nuevo de @davidbisbal y @SebastianYatra!\n\nhttps://t.co/jkfWnwNGhz https://t.co/Uhf… RT @TIDAL: .@davidbisbal talks about Spain’s traditions and his new single with @SebastianYatra in #ForTheCultura: https://t.co/jxCvYnLw1W… Gracias Mario por tu arte y por tu apoyo siempre, mucha suerte amigo. https://t.co/di4pzbF7j3 Que te puedo decir amigo Arcangel, que eres un pedazo de artista y persona, te admiro. https://t.co/fzZwkVVNNY Besos a Costa rica os quiero. https://t.co/dgn39wS37X Pronto en Brasil, os quiero. Gracias compañeros. https://t.co/E6rCaMWZyD Vamos Uka, un beso desde España. Con ganas de verte. https://t.co/WKnBRyTXXQ un beso para el team de @SebastianYatra en #aRGENTINA https://t.co/lZ8qm7uHEb Gracias, un beso muy fuerte para mi gente de Paraguay https://t.co/h0YjeyRdww Un beso para mi gente de Polonia, ojalá que pronto pueda ir a visitaros. https://t.co/9bOvjO8rOq Besos para mi gente de Colombia¡¡¡¡ que os ha parecido el tema con @SebastianYatra ? https://t.co/FuTTjRZUUh Os quiero. El Salvador. nos vemos pronto. https://t.co/v1v5oTqoJs Panama presente también en el estreno 💕 https://t.co/W2rGZ7ARxR Venezuela de mi corazón https://t.co/iuuzmJpuXK Presente Ecuador. Os quiero. https://t.co/i19mJryUFo un beso a mi gente de Puerto Rico. os quiero. https://t.co/uEzpGjFMli Un saludo para mi gente de Nicaragua https://t.co/ELLy154H50 RT @VEVO_ESP: #APartirDeHoy no vas a poder parar de bailar con el nuevo hit que @davidbisbal nos trae junto a @SebastianYatra ¡Disfruta del… Por fin ya podéis ver el vídeo de #APartirDeHoy con @SebastianYatra en @SomosVevo y @Vevo_Esp! A gozarlo! https://t.co/fL5VwRNIIl Emocionado de que ya tengais disponible en @applemusicES #APartirDeHoy!! https://t.co/IbZoojf9zy https://t.co/b1I33AbUag #APartirDeHoy ya puedes disfrutarla en @SpotifySpain ! Rumba con mi amigo @SebastianYatra ! https://t.co/6Bd65VDDaW https://t.co/CIFEURJ9iL RT @musicagran: No te olvides mañana #Instagramlive con @davidbisbal y @SebastianYatra #Apartirdehoy a las 19:00 hora ESP/ 13:00 hora Colom… Ole tambien mi @antoniorozco tiempo al tiempo, así es. #APartirDeHoy https://t.co/Zz5sqMOQoc Ole mi @manuelcarrasco_ ja ja ja a ja gracias niño. Una rumbilla para el cuerpo. https://t.co/R0q337thAQ Falta 1 día!!!!!! #Apartirdehoy os quiero! No podía dejar el pasillo flamenco atrás! https://t.co/uAMr5CdyfI @SebastianYatra vamooooos! https://t.co/sEPuzSVAZi Buenos días a todos. Hoy trabajaré en el Show de la gira del 2018. Vestuario, diseño y Merchandaising los puntos a estudiar para hoy. El repertorio gracias a vuestra ayuda tiene muy buena pinta. Ya lo estamos trabajando. https://t.co/6NTlLRKolH Dentro de 2 días!!!!!!!!!! #Apartirdehoy os he visto muy guapos con las camisetas!!! https://t.co/8GVvAGzOOe @SebastianYatra https://t.co/MSSVjW8w36 Añade ahora #APartirDeHoy a tu Spotify y podrás disfrutar antes que nadie del making of del video con @SebastianYatra !\nhttps://t.co/0YRdUxYWmq Amigos cada vez falta menos para descubrir #APartirDeHoy @SebastianYatra en este fragmento que he subido nuevo puedes descubrir otra parte importante de la canción. Qué ganas de que la cantemos en directo! https://t.co/xsLYNpaKMU https://t.co/Emg7XFjKMC Así es, por eso os mando mucha fuerza y os deseo todo lo mejor para este martes. Os quiero. https://t.co/msK3hDa9h1 #APartirDeHoy deberíais seguir mi perfil en @AppleMusicES. Quedan 4 días para compartir con vosotros mi nuevo single! \nhttps://t.co/2yYARC11G8 Cada vez queda menos para poder compartir con todos vosotros #APartirDeHoy con mi amigo @SebastianYatra , solo 4 días! https://t.co/9FJ5nZMM7m Nunca me imaginé un final tan triste para Gabriel. Estamos todos destrozados. Mi hija tiene ocho años y me imagino el dolor tan grande que deben estar pasando esos padres. A por el domingo. Muchos besos. Quedan muy pocos días para que salga #APartirDeHoy https://t.co/yHhlVf4Dui Buenas noches!!!😘 buen fin de semana!!! https://t.co/NGgiXyPtXt David Bisbal DUETOS Una lista de canciones con grandes amigos para el fin de semana. Os quiero.db https://t.co/JuFeX8CItz #NowPlaying @spotify Qué ganas de empezar con nuestra rumba¡ Colombia y España. Os queremos. https://t.co/OYY9o4AAkr Muy feliz con esta noticia. https://t.co/GLsUcUx5af Vamos que nos vamos de #Rumba con @SebastianYatra #APartirDeHoy el próximo 16 de marzo! Os quiero. https://t.co/G9YZieBTc9 el primer adelanto! https://t.co/ClgXNL4lTd Buenos días!!! 🌞😃😃☀️ #APartirDeHoy sale el 16 de marzo!!!!!! @SebastianYatra https://t.co/FoTsxr1NyT @UMArgentina  os quiero compańeros!! Nos hacemos unas camiseta como estas? Qué alegría mis compañeros de universal music Argentina. @UMusicArtists os quiero!!! Está chula la camiseta verdad?? #APartirDeHoy https://t.co/Bxm3WcRYXL Hola a todos, cómo va la semana… me gustaría saber cuál es tu propósito #APartirDeHoy Explícamelo en un video y súbelo con el hashtag #APartirDeHoy https://t.co/n28t64XIOM https://t.co/RzL7zCYc7R Muy feliz de haber coincidido con una gran leyenda de la música. Quincy Jones!!! https://t.co/NoOULrPtHb https://t.co/Qmq2MABkze Felicidades!!!! #coco mejor película de animación. Viva México 🇲🇽 https://t.co/Ks98j04WrH Pues muchas gracias por tu sinceridad! A mi me gusta cambiar de vez en cuando el look. Es una de Las maneras de tener el pelo corto y mantener el rizo al mismo tiempo. Besos. https://t.co/B4ygfiYJ8n Voy fatal en mi quiniela! Ja ja ja ja ja ja pero acerté con #CoCo y estoy feliz. Viva Mexico 🇲🇽 https://t.co/JMrX6IqrYH Elton john Aid foundation! Viewing party! Un beso a todos.#EJAF #Oscars https://t.co/Mno8u3HrfH https://t.co/33FeJ10nku Qué tal os parece esta encuesta? #tourdavidbisbal2018 #APartirDeHoy Todo empieza…#APartirDeHoy https://t.co/3bXaScdqSl Se sigue  buscando al pequeño Gabriel en Almería. Si sabes algo de él, llama al 112, 062 o 091, . Por favor no difundas bulos ni información que no sea oficial. Un abrazo y mucha fuerza los familiares. Seguimos rezando. https://t.co/VA8jZJrXzm Un saludo desde Los Angeles! https://t.co/2EbPHWgtwq muchos besos! https://t.co/AYiPl0zdvD No os Preocupéis por el resultado. Al final por supuesto que la decisión la tomaré con el equipo, pero vuestra ayuda es imprescindible. https://t.co/X2CWULhYYg Las metemos en el repertorio?? Que opinas!? https://t.co/UF3L89kkuH https://t.co/pH9rJuxEcF @Spotify De verdad deseo con todo mi corazón que aparezca el pequeño Gabriel, todo mi apoyo a la familia y un abrazo muy fuerte a todos los voluntarios. FUERZA. https://t.co/7KFYnPNsO7 de verdad va ganando corazón Latino? ja ja ja ja ja ja Y otra encuesta de dos baladas muy potentes y que siempre han funcionado muy bien en mis conciertos. Cual prefieres de las dos? https://t.co/hbzXA9u8km Para acertar mucho más de lleno en el repertorio me gustaría hacer unas cuantas encuestas de las canciones. Después subiría una lista a mi Spotify oficial con el resultado de las canciones y otras que tengo claras. Así llegamos con el repertorio ensayado al inicio de la gira. RT @db_collages: Vamos a ayudar a @davidbisbal con el repertorio de #davidbisbaltour2018 Ir a su InstaStories (instagram) y votar por vuest… Depende del resultado, lo veremos, muchas gracias por ayudarme. db https://t.co/OlN75ERXXj Maria, fue un placer coincidir contigo, que viva la gente de Mallorca. besos. https://t.co/pnSxFp9YZ8 Donde me encuentre, siempre llevo a mi tierra en lo más profundo de mi corazón. Feliz día de Andalucía. https://t.co/xm9Af3r6kx https://t.co/bC1JGKFM4t Quiero aportar mi granito de arena para tratar de encontrar a este niño desaparecido ayer por la tarde. Ojalá que alguien lo encuentre y vuelva con sus padres. https://t.co/4vIL9zQKhd Crees que esta canción debe estar o no debe estar en el tour 2018? #Lotengaono https://t.co/XgvW5gHBtN https://t.co/MWYIGrsvP2 RT @mpseren: @davidbisbal feliz día de Andalucía jefe!! #DiadeAndalucia 💃🏽💃🏽💃🏽 https://t.co/v8OSNF7iJx RT @UnivisionSports: ¡Multitalentos!\n\n@davidbisbal resultó muy hábil para las dominadas 😎👌🏼  https://t.co/kQSVYQyRod Os mando un beso 😘 https://t.co/wnrH6Vrcd1 Me parece espectacular! Le pondría el logo de la escudería en azul en los laterales también y quedaría de escándalo. Espero que Fernando se sienta cómodo y sea además de bonito rápido. https://t.co/SeJlRcHUlJ Espero que tengáis un gran semana! Mucha fuerza para todos! Os quiero.\nhttps://t.co/YFN8QMpY2b https://t.co/NOtJIZVF8o Toda la suerte del mundo en el estreno de la nueva temporada amigo @JesusCalleja echando de menos nuestros buceillos! https://t.co/kj5KNmQg0H Te quiero amigo @JoseJoseOficial https://t.co/xnxs4Cs7IV https://t.co/Z8ul18Sb0h El repertorio será una evolución de mi ultima gira en Latinoamérica mas las nuevas canciones que vengan. Estamos trabajando en dar un look diferente al escenario con una producción moderna. En mayo tendremos los ensayos y estamos todos muy felices. db https://t.co/DfVTK0qFev Ha sido un sueño poder estar en el 30 aniversario de premios lo nuestro! Además de cantar mis canciones, tuve la oportunidad de homenajear a uno de los más grandes artistas de nuestra cultura. Mi amigo @JoseJoseOficial se te quiere siempre. https://t.co/BuJL0a9ERl Os mando un beso enorme, gracias por confiar en mi. Qué bonita presentación me habéis hecho. Por cierto, que guapas estabais esta noche. https://t.co/kD5Em2e2tQ RT @premiolonuestro: ¿Les llegó ese beso de @davidbisbal? 😘😘 #PLN30 https://t.co/3IC3Gr4lGp qué ganas de empezar con todo. Nos vemos en la gira. https://t.co/stuenNwHTD Que te imaginas que voy a cantar en el 30 aniversario de premios lo nuestro? Lo pasaremos super bien. Os quiero. #PremioLoNuestro https://t.co/kxY0KphwOn Hola mi gente! Como no podría ser de otro modo! Empezaré la gira de Espańa en Almería. Nos vemos en Roquetas el 9 de junio! Os quiero!!! https://t.co/shb8exD1fl Estaré en el 30 aniversario de #PremioLoNuestro  y estoy muy feliz! https://t.co/6GvR1OhBqf Viste este capítulo! De mi visita a Operación Triunfo? https://t.co/zjxuV1p0Jy https://t.co/OVDfIHG7p1 El fin de semana ha estado precioso. Os deseo todo lo mejor para la semana. Mucha fuerza. https://t.co/Zg3CcQa12l Te canto a capella! Buen fin de semana! Os quiero https://t.co/9WXVE5bYm2 Una charla que recordaré por mucho tiempo!!! https://t.co/JZvND5o9Wd https://t.co/aoKxMKbvZ0 Muy buenos días, estamos a mitad de semana y quiero animaros a todos a terminarla con toda la ilusión del mundo! Os quiero.Gracias a todos por tantos comentarios tan bonitos que estamos recibiendo en estos últimos días. Estoy deseando que veáis el resultado del nuevo videoclip! https://t.co/d8eSl3o92N Bueno amigos, como no hemos podido cantar en directo en la final de operación triunfo por problemas técnicos. Os dejo el video de mi ensayo de la tarde.\nCosas del directo. https://t.co/BwPml6EfeZ https://t.co/jYe6PP5cvZ felicidades Amaia! 🎉🎈👏🏽👏🏽👏🏽 a por todas! https://t.co/9CvDDjCHbP Que maravilla ha sido volver! Espero que os guste. https://t.co/uCxgr2FP36 nos vemos esta noche. https://t.co/upE0h87Tkj Hola amigos! Me voy de visita! Os quiero! https://t.co/Xg4L7ec8AC Felicidades compañero! Se te admira mucho. https://t.co/mCxVdXlpG7 gracias @TiniStoessel por acompañarme en esta aventura musical Felicidades a todos.!! #TodoEsposible https://t.co/K0U6aPDhXY Què bien me lo he pasado cantando esta canciòn contigo. https://t.co/UfrFYx4phG 'Quiero felicitar a todo el equipo de Tadeo Jones 2: el secreto del Rey Midas', Goya a mejor película de animación  Felicidades a todos!! #TodoEsposible https://t.co/K0U6aPDhXY  #Goya2018 ha sido un honor y un regalo estar dentro de este maravilloso sueño. DB Será una evolución de este último, no cabe duda que yo también lo pasé muy bien. https://t.co/3ZBiiwspE3 Lo tendré en cuenta! Lo había pensado. https://t.co/eQ3FlFYQIc Este regalo lo guardo en mi estudio! Gracias! Que grandes recuerdos de Los rosales y Tocina. https://t.co/24dgkp3FBr Ja ja ja ja ja ja 😂 Almeria! Mi tierra que puedo decir?? Crees que puede faltar? Besos. https://t.co/eWvcMXOwd1 Dentro de poco volvemos con Rumba! Y de ahí vendrán nuevas canciones que ya estamos preparando.\nEl repertorio cambiará, aunque me quedé muy contento con el último repertorio de la gira Latina. https://t.co/StjgARw2Vj No, solo en Barcelona! Besos. https://t.co/vwzkzadZmP Si, pienso hacer un presentación de gira y Single. https://t.co/GMVOjIQyUC Será una gira exclusiva! Solo vamos a elegir hacer los conciertos que están anunciados y unos pocos mas.\nMe gustaría tener oportunidad de trabajar otros territorios. https://t.co/utfk7tbfCh Qué recuerdos!! Llegaba recién de cantar con la orquesta! Cuatro años cantando por todos los pueblos de España, una buena preparación para llegar al programa! Era impensable pensar en todo lo que he vivido a vuestro lado. https://t.co/62D4lE7uqW Buenos días y buen fin de semana! https://t.co/TUPOo2rjUz Hoy estuve ensayando lo que voy a cantar en la gala de #OperacionTriunfo Espero que os guste.\nCon ganas de entrar en la academia y darle a los chicos los mejores consejos, aquellos que me hubiese gustado escuchar a mi. https://t.co/VwEF8dAfPY https://t.co/Nsdhxfp89G Vuelvo a la academia de Operación Triunfo! Y estoy muy feliz! Es un secreto que tenía muy bien guardado y que estaba deseando compartir con vosotros! https://t.co/qlMxCCdou7 https://t.co/JFk4EQzBpL Sorprende como el dibujo de un niño transmite el dolor sufrido. Lo hace mientras se recupera en uno de los espacios seguros de @UNICEF para protegerles.Este me lo comparte @unicef_es por su nuevo informe https://t.co/ViFnIrX2dl\nNo a la indiferencia frente a las #Emergencias2018 https://t.co/9BB0LMAmzg Buenos días mi gente. Mañana día 31 tengo algo muy importante que comunicaros. Os quiero mucho! https://t.co/cwbmiFWJnV Buenos días, a preparar la semana con mucha fuerza. Os quiero! https://t.co/p33woB89YU Domingo familiar! Os quiero! https://t.co/kgUEGrnHvG El caballo camina “palante” el caballo 🐎 camina “patras” @Twitter me recuerda a una de las canciones que cantaba con la orquesta Expresiones hace un tiempo? Sabe alguien que pasa con #twitter https://t.co/NUUZwPdAyR esta foto me encanta. Es de Sierra leona después de jugar un partido de fútbol con algunos amigos de Madina. https://t.co/Z4wXOzGpT6 Qué grandes recuerdos estáis compartiendo este día. https://t.co/efHXKecXdj Con muchas ganas de daros más noticias!\nhttps://t.co/y7mBXgEQFM  esta es una semana muy importante para estudiar, meditar y preparar todo el trabajo. https://t.co/7J7U6wajqo Estáis preparados para más fechas?? https://t.co/C1K55cIlWA Qué alegria volver a mi Sevilla. https://t.co/VPlpVnDUYY Feliz cumple!!!🎈🎊🎁 https://t.co/K6Z5KsKNsh Feliz cumple!🎁🎈 https://t.co/2EpVNrdif5 Espero que estéis descansando mucho este maravilloso Domingo! Y mucha fuerza para la semana que viene. Os traigo más noticias! https://t.co/OLb6dHelZ8 Os deseo un maravilloso fin de semana!! https://t.co/1zkckJ8rSd Nosotros, después de terminar nuestro videoclip seguimos de reuniones preparando todo el año 2018 https://t.co/xSX8DHTLm4 Me encanta esta foto con mis compañeros!! Jesús, siempre será un placer homenajear tu trayectoria en la industria músical!!!!\n#jesusLopez https://t.co/1i3pnUxl2q https://t.co/1dC6SuZpQ3 @vanessa_budha @SebastianYatra Por supuesto que la podremos escuchar en la gira #Apartirdehoy Será el título de nuestra próxima canción que cantaremos junto a @SebastianYatra os quiero! https://t.co/1i3pnUxl2q https://t.co/O0EKGc5a7B @Anitanagon Feliz cumpleańos!!!!!! Como chis y más ganas de empezar la gira. Qué alegría me da ver todas las fechas que están saliendo https://t.co/TqIgCnvSu9 qué ganas de Gira por Dios. https://t.co/2BF13ItNP8 Saludos, qué bien me lo he pasado en @tjmartell ha sido una gala maravillosa!\nWas a pleasure being part of this charity event!! I love you! 😘 tomorrow we’ll Record the new music video!!! https://t.co/OViA8Z4Ygu Confirmado, en primavera tendremos nuestra nueva canción con nuestro @SebastianYatra deseando compartirla con todos vosotros. Una rumba latina donde vuelvo introducir la guitarra flamenca! https://t.co/Fycimmlv3V https://t.co/5iSJPLY75C @Gudi_oth Muy buenos días, aquí estamos arrancando el día. Son las 8:23. Bajaremos a desayunar, haremos deporte e iremos a probar sonido. @francysdjmusic1 @Twitter @dbfansdevzla Somos una hermosa familia! @bisbalpress @Twitter Gracias por estar siempre a mi lado Muchísimas gracias compañeros. En esta maravillosa red social @Twitter he vivido momentos de máxima felicidad y quiero compartir este momento tan bonito con todas las personas que me han acompañado durante estos años. Muchos besos a todos. https://t.co/27x5NEkIzV Qué bonito es ver la alegría de los niños en este colegio de Puerto Rico después de que la luz volviera finalmente y pudieran asistir a clase dignamente! Os queremos! Que viva mi isla del encanto. https://t.co/OiFufMVFWD Mańana sale al aire!! Besos https://t.co/hcDZkQ2O6w Amigos estamos en @iHeartRadio listos para hablar con nuestro compañero @enriquesantos estamos felices de colaborar con esta maravillosa fundación contra el cáncer @tjmartell @SebastianYatra os queremos! https://t.co/lNmM8kjz0W Tenemos que estar atentos porque en los próximos días aparecerán más fechas de conciertos! Os quiero! https://t.co/G4yScRbgnV Estoy feliz con esta maravillosa candidatura como capital gastronómica de España en el 2019 para mi tierra Almería! Ojalá que tengamos suerte. En Almería nos gusta compartir y hacer las cosas con corazón. Os queremos. https://t.co/hmqKB1Af14 Te mando un abrazo!\nUna de las canciones más bonitas y más difíciles que tengo de mi repertorio. https://t.co/YPLUq1EpcJ La canción de Argentina es para un programa, he quedado muy contento con el resultado. Y ahora vamos a grabar el videoclip de nuestro próximo single! En estos días recibiréis más noticias! Con ganas de empezar con los conciertos. https://t.co/6BFoTjEuOB A grabar el vídeo clip!!! Os daré más noticias pronto!! https://t.co/2OgcePcPAg Gracias de todo corazón por todos vuestros comentarios. Muy felices https://t.co/or0lx9J2JC https://t.co/jt0LiWzITd Buenos días, qué bonita es la romería de mi tierra Almería y que preciosa es la patrona. la Virgen Del Mar os deseo una grandísima semana. https://t.co/YmR8YKftqp Quien es quien!? 😂😂 espero que estéis pasando un gran Domingo!\nUn abrazo a todos!\nEn breve a preparar nuestro viaje para grabar el vídeo clip de la nueva canción! https://t.co/xDJzmY2G5C Buenos días! 🌞 espero que paséis un fin de semana maravilloso.\nNosotros lo haremos haciendo mucho deporte. La preparación es básica e importante.\nHay que estar listo para todo el año! https://t.co/8x568FVHiM La semana que viene grabamos vídeo clip en miami! Con muchas ganas de contaros más sobre nuestra nueva canción! https://t.co/0xzEiNRRGq RT @bisbalpress: Conciertos de #DavidBisbalTour2018 YA a la venta: Madrid 14/6; Barcelona 16/6; Valencia 21/6; Marbella-Starlite 20/7 https… Muy feliz de participar en el homenaje que le dedica @tjmartell a mi gran compañero y amigo Jesus López. Los fondos recaudados irán a parar a la investigación contra el cáncer, gente de Miami os espero! https://t.co/apLtMwAh7r\n#MartellinMiami https://t.co/au0Hu85fS5 Que hermosura de frase, me encanta Frida¡¡¡ https://t.co/6NNRMyAR6H Os deseo todo lo mejor en la vuelta al trabajo y la rutina. https://t.co/9bxDIfsDIX Te deseo un gran dia de tu cumpleaños https://t.co/1Hbi2Bq5E3 qué grandes recuerdos. Ahora... Dragon Ball mis favoritos. https://t.co/PTYJK2b1Y4 Ha sido un placer haberte dado un abrazo que llevaré siempre en el recuerdo! Un beso para todos los amigos y familiares de Juan. Os quiero mucho. https://t.co/nSpshEZFgB Primer día de trabajo del 2018!!\nMucha fuerza para todos. Os deseo lo mejor! Buena semana! https://t.co/kAIbr3Qh0s espero que lo hayáis pasado muy bien en las vacaciones de navidad y que empecéis  con fuerza este maravilloso ańo 2018. Os quiero! https://t.co/gg2Dua9Hi4 https://t.co/kAIbr3Qh0s Espero que lo hayáis pasado muy bien en estas Navidades.\nSe acabó el descanso y empezamos el año con fuerza y recargados de buena energía! Besos 😘 https://t.co/L6Gt76Qn2j Amigos de México, espero que disfrutéis de Tadeo Jones dos!! Os quiero! https://t.co/utOrvFWr3k RT @UniversalSpain: Las entradas para los conciertos de @davidbisbal en Madrid y Barcelona son el mejor regalo de Reyes! \n➡️https://t.co/rR… Con las dos nińas de la casa, empezando el ańo en el mar. El mayor premio! https://t.co/vaM0yk2JW4 https://t.co/LzH93E5wDq El 2017 ha estado cargado de momentos inolvidables, algunos de ellos lo he podido vivir junto ustedes!\nA por un gran año, el 2018! Os quiero mucho! https://t.co/ljlVUdS9lX https://t.co/5pSUCurpKO Muchísimas gracias a todos por vuestras felicitaciones en el día de mi santo. Brindo con vosotros por un nuevo año cargado de mucha salud y bendición. Os quiero mucho. https://t.co/cSoAYc4Toi Lo prometido es deuda. Os mando un saludo desde el estudio de grabación donde estoy grabando el videoclip de mi próxima canción. “Ahora voy yo” quitaros del medio!!!!!! https://t.co/J206UVnea6 https://t.co/qmfoHhjmd9 Con muchas ganas de grabar mi próximo videoclip.\nYa tenemos todo preparado para que el 2018 arranque con fuerza! Os quiero! https://t.co/q90yXNnAal https://t.co/KuetYesfdA RT @UniversalSpain: Consigue ya tus entradas para los conciertos de @davidbisbal en Madrid y Barcelona → https://t.co/rRdaNHEm1c #DavidBisb… Espero que pases un muy feliz cumpleaños 🎂🎊🎉 nosotros hoy estamos dejando organizado algunas cosas de trabajo antes de que termine el año y seguir con nuestras vacaciones de navidad! Qué ganas de que llegue el próximo año 2018 https://t.co/FAocFpR5aY Cuanta ternura en Navidad!! 🎁🎄 https://t.co/9sLlwLhpLz https://t.co/B9BCgtfRoW Igualmente os deseo yo. Mucha salud feliz Navidad a todos. Me encanta leer todos los mensajes de cariño en estos momentos que debemos estar más unidos que nunca! Os quiero. https://t.co/z99MfCV6Gl Uy!!! Esta es buenísima!! De hace 1 semana y media. https://t.co/WKV0Z3WMxQ Mirad qué bonito recuerdo de navidad!! 2010 Compartamos aquellos mejores momentos que hemos vivido juntos en estas fechas tan especiales. No importa el año! https://t.co/TLB4V7xiyZ https://t.co/nsQS8dUVsI Qué tal van esos preparativos de Navidad? 🎄🎁 espero que lo paséis genial junto a la familia y amigos.\nOs quiero! https://t.co/jkoNRlW7Nq Estoy muy contento porque ya se pueden adquirir las entradas para los conciertos de Madrid 14 junio y Barcelona 16 de junio aquí.\nhttps://t.co/rVzdV63XWW os quiero! Nuevas canciones y nuevas colaboraciones vienen camino. https://t.co/exQszZtuCK RT @PepiyFernando: INFO @davidbisbal #DavidBisbalTour2018 14 de JUNIO 2018\nJUEVES, 21:30\n#DavidBisbal\n@WiZinkCenter #Madrid ENTRADAS a la v… RT @PepiyFernando: ENTRADAS: @davidbisbal en Starlite Marbella el próximo viernes 20 de agosto de 2018, la apertura de puertas será a las 2… https://t.co/N6oyhnByim me lo he pasado muy bien compartiendo con algunos compañeros de la prensa nuestro último perfume!\nOs quiero!! https://t.co/3ZyXl1tFzA https://t.co/juEiJm2ork Buenos días!!! Amigos!! Gracias por haber estado conmigo escuchando todas mis canciones a través de @Spotify os quiero! Nosotros ya hemos dejado todo listo con la nueva canción que viene en 2018. Espero que nos sigan acompañando. 😍 https://t.co/OC4xwVqNCs RT @StarliteFest: 🔴 CONFIRMADO🔴\n@DavidBisbal regresa al escenario de #StarliteFestival2018 el próximo 20 de julio.\nEntradas a la venta el m… @PabloGoldfinger y @ludovicovagnone dos maquinas en el estudio conmigo! Os quiero!! https://t.co/ZELazeaaCX RT @agenda_db: 1ra fecha confirmada de @davidbisbal para el #2018 📌Agendado https://t.co/976VKr2WKJ Es para mi un honor participar en este concierto por una noble causa y a la vez o homenajear a un gran amigo y compañero! #JesusLopez que ganas de que llegue el momento! https://t.co/155rDNlHG6 Espero que estéis pasando un maravilloso domingo!!!! Os quiero! https://t.co/Yxoa52idgN https://t.co/MSabL5FxGU Con muchas ganas de grabar mi nueva canción para el 2018 https://t.co/zuKY7Nldl9 https://t.co/SbuCywbRbs Cantando mi princesa pero de una forma muy especial!! https://t.co/WTs8qf9W2g Recuerdo de mi primera visita a Sierra leona en el 2007 @61chema https://t.co/yqJVZb4zcM @ongdyes un viaje que me marcó para siempre. https://t.co/HONGKWjbIp Lo prometido es deuda https://t.co/bkpkU4DL7m en este link podéis encontrar el video capítulo de mis dos conciertos en el Luna Park de Buenos Aires. Argentina! https://t.co/aRmV8tAKSf Un beso!! Os mando un abrazo.Hicimos un pequeño video para agradecerte todo el cariño que hemos recibido durante la gira. https://t.co/CtMbABhkth https://t.co/zToQHW8g0N Lo mismo os deseo yo para todos ustedes. Buenos días y mucha fuerza https://t.co/qSCctmWjZ3 @PuritoRodriguez @josebabeloki me encanta el ritmo que lleváis!!! Ja ja ja ja ja ja! Nos vemos pronto fenómenos https://t.co/oBDaubWjj9 https://t.co/haufulh2Fa Feliz Navidad 🎁🎄 espero que estéis pasando un fin de semana maravilloso. https://t.co/6alO07oX76 Nosotros el árbol lo ponemos el martes!! He conseguido uno de verdad porque me gustaría darle una segunda oportunidad y plantarlo en el jardín una vez que acaben las fiestas de Navidad? Qué os parece la idea? A mi me encanta. https://t.co/Nsd3S4dKT4 Con el espíritu navideńo al máximo! Os quiero! https://t.co/hQN3dHnSZ4 RT @LatinGRAMMYs: Momentos Memorables: @davidbisbal 🎶El Alma Al Aire🎶 Persona del Año 2017 en honor a @AlejandroSanz 👏👏👏 #LatinGRAMMY https… Desde otra perspectiva!! Las 2 noches en el Luna Park! https://t.co/8fVpzZuwBr  https://t.co/YO8Dc6KxTF https://t.co/LdnkRHHqwd Segundo día en el Luna Park y último concierto de la gira este año 2017! https://t.co/77mMwswO0m @TiniStoessel estuviste maravillosa con #TodoEsPosible @LucianoPereyra gracias por tu arte maestro. https://t.co/jLpVkODBQ5 Eres un maestro y gran amigo para siempre!!!! https://t.co/DM4HQzq0DK Con muchas ganas de subirme con vosotros al escenario!!!! Un abrazoooooiio https://t.co/DM4HQzq0DK Mańana será chulisimo!!!! Con muchas ganas!!!! https://t.co/QxLI9UUfIR Qué locura de concierto en el Luna Park!!! Gracias a toda la gente por cantar conmigo siempre. Será uno de los mejores que recuerde nunca! Gracias @ManuelCarpeta por tu arte Mañana segundo día con @TiniStoessel y @LucianoPereyra https://t.co/4QpQV2cBei What a nice picture with my friend @JuanLuisGuerra in @AbbeyRoad https://t.co/Cay9Z4MbVj aquí grabamos nuestro homenaje para @MarcoASolis de su tema #SiNoTeHubierasIdo https://t.co/IZJ72As6jU https://t.co/we80IGE36y https://t.co/vI9KqAdZCD Gracias mi gente de Uruguay por el concierto de esta noche. Jamás lo olvidaré. Me encanta ver tantas banderas.\nEspero regresar pronto a Uruguay. Me quedan dos conciertos para terminar la gira en Latinoamérica. Un largo recorrido que ha merecido la pena. https://t.co/QYQRkSqbn0 RT @JuanLuisGuerra: Junto a mi querido @davidbisbal en @AbbeyRoad en la grabación de Si No Te Hubieras Ido. Escúchala https://t.co/cZ330tog… Esta noche tenemos una cita en Montevideo, Uruguay 🇺🇾 nos vemos esta noche en Landia donde cantaremos y bailaremos.\nOs quiero mucho! Sólo tres conciertos nos quedan, el de esta noche y los dos conciertos en el Luna Park el tres y el 4 de diciembre. https://t.co/rVzdV63XWW https://t.co/TOqURF44u1 Feliz cumpleaños papá en este maravilloso 1 de diciembre. Y feliz Mes de diciembre para todos vosotros.\nMe encanta el espíritu navideño.\nDeseo que tengáis una muy feliz Navidad. https://t.co/mwbGjOzOcd https://t.co/7TGJ0PBl8W Me lo pasé espectacular en tu programa con los chicos. Sois unas máquinas gracias de todo corazón. https://t.co/VCIoTdFIWc Gracias amigos de @Vale975 por este maravilloso regalo!\nEl día 3 y 4 de diciembre nos vemos con los ganadores del concurso en el @stadiumlunapark https://t.co/rVzdV5Mmym https://t.co/m62oKdenP8 Hola mi gente de Argentina.\nMañana por la mañana visitaré a mis amigos de @Vale975 siempre me lo paso muy bien con ellos.\nY después participaré en el programa de #Morfi en @MorfiTelefe https://t.co/r4gtEEHfal RT @Vale975: MAÑANA → ¡Nos visita @davidbisbal!\nEscuchá a @laufer4 desde las 6 AM y participá de la nota ♥\n#YoEscuchoVale975 https://t.co/w… RT @PuntosdeEventos: Los días 3 y 4 de #Diciembre vuelve al escenario de @stadiumlunapark el artista español @davidbisbal para presentar su… RT @Telefeprensa: Mañana #MorfiTelefe recibe a @davidbisbal . Será un programa imperdible!! con @gerardorozin y @zairana @MorfiTelefe RT @NETxFOX: Mañana 23:30hs @davidbisbal estará con @germanpaoloski anticipando sus conciertos del 3 y 4~Dic en el @stadiumlunapark present… @bisbitachile Quiero agradecerte tantos años de puro amor y dedicacion! Hemos logrado formar un gran club de fans en Chile 🇨🇱 se que no es un adiós definitivo, sé que seguirás a nuestro lado. Quiero felicitarte por tu nombramiento como presidente en el club de fans de Chile. Recuerda que un buen líder es aquel que se engrandece por su generosidad. https://t.co/UiWQSRgTnV https://t.co/ujHOdzvF26 Es la primera vez desde que conozco Chile, que tengo tiempo para disfrutar de su entorno natural! Disfruté mucho Del Río Maipo. Cómo me gustan todos los deportes. https://t.co/3YEk2Cmzu5 Que te gustan más, los perros o los Gatos!!??\nhttps://t.co/MTcMTEpfWo https://t.co/TSRTM6cR2a Esperando a Radio Montecarlo. https://t.co/YispvJI5Rb Ahora fm Latina!  Uruguay En breve estaré al aire! Besos. https://t.co/zzt3aUVkkX Gracias Chile! Sin palabras!!! Qué energía!! Ganas de volveeeeeeeer!! https://t.co/fmEC8P4Mad Tomaaaaaaaaaaaaaaa el mejoooooooorrr!!!!! Vamos que nos vamos! Nos vemos el 4 en el @stadiumlunapark https://t.co/eriJfzOI2L Un mensaje para mi amigo @LucianoPereyra tío!!!! Vente a cantar conmigo al @stadiumlunapark te queremos! https://t.co/VSvJskrCrA Me uno en el día mundial contra la violencia de género! https://t.co/pqYpIlFzj4 Gracias mi gente de Chile por abrazarme.\nMe ha encantado cantar en el #CopihueDeOro os invito a que compartan conmigo el próximo domingo que cantaremos en el #TeatroCaupolican os quiero. https://t.co/338IKFe5R9 RT @UMusicChile: ¡No te lo puedes perder! Este Domingo 26 @davidbisbal en Concierto - Teatro Caupolicán 👏❤️ #CopihueDeOro @lacuarta https:/… Estamos con todas las familias y amigos de los tripulantes del submarino ARA. Mucha fuerza en estes momentos tan duros. https://t.co/EeGQeiLTEJ Esta noche deseando subirme al escenario del #CopihueDeOro2017 besos!!! https://t.co/FPvVhvxuCf https://t.co/LcB0ZDwXAW Hola Buenos días desde Chile 🇨🇱 me tenéis que decir que os ha parecido el nuevo perfume. https://t.co/FPvVhvfTKH besos a todos. https://t.co/2DWNj5mz7L RT @bisbalpress: VIDEO: David Bisbal canta en vivo #LoTengaONo en el programa #DianaEnEl13 de Canal 13 Chile https://t.co/bAba5UxTYh 😍 @dav… Ya estamos listos!!! Salimos en al aire!!! Viva chile 🇨🇱 https://t.co/LVV7WPCnxz #HappyThanksgiving espero que paséis una noche maravillosa en familia. https://t.co/Rg8bZOxEEl Thanks @lelepons you are the best!!! Me he partido de risa con el vídeo bailando #Buleria.\nhttps://t.co/sudcoFFGPs https://t.co/VXFOt7OjfF RT @UMusicChile: #CONCURSO!! Prepara tus pulmones porque nosotros te llevamos al Show de @davidbisbal en el @TCAUPOLICAN este 26 de Noviemb… Os esperamos!!!!!! https://t.co/Eds7hxtoaB Bieeeeeeeeeeeennnnn!!!!! Que alegría me has dado @TiniStoessel estaremos el día 3 y 4 de dic en el @stadiumlunapark el día que quieras y puedas Te esperare con toda la ilusión!! #TodoEsPosible https://t.co/ja91PPsn6e Hola @TiniStoessel que me encantaría volver a revivir este momento contigo. https://t.co/bXfMr4HuJ9 👏🏽👏🏽🎈ya estoy llegando a Argentina 🇦🇷 https://t.co/RSqboQ4bEP RT @agenda_db: La versión masculina,DAVID BISBAL MAN,comienza con aromas cítricos,dejando paso a un corazón con personalidad con aroma a ho… RT @agenda_db: La fragancia femenina,DAVID BISBAL WOMAN sorprende en su salida con toques de ciruela, iris y flor de azafrán, que evolucion… Un poquito de deporte en la Montaña ⛰ con el equipo de la gira, qué importante es cuidar la naturaleza. Os quiero. https://t.co/WNv9w293gq https://t.co/wQegTKDIaI Feliz día Universal del nińo! https://t.co/NoQSW9DMkH https://t.co/HNCS79hVA6 Hola amigos, aquí os dejo el video capítulo del @AuditorioMx con @PatyCantu y @_christiannodal https://t.co/uo5RdKdf8W qué bien me lo pasé y qué ganas tengo de volver. Gracias Mexico por tu amor 💖 https://t.co/v5TU4fyAaG Para todos aquellos que preguntáis por el capítulo Del auditorio Nacional en México D.F. Mañana lo veremos en el canal de YouTube.\nEspero que estéis disfrutando del domingo maravilloso. https://t.co/SecawKUD5c https://t.co/SNcSMTOcli Siempre me dejaré la piel y la voz en cada concierto, gracias a todos por vuestros comentarios. https://t.co/2C62Z69b7b gracias a vosotros, por el cariño y por tratarme siempre tan bien.\nOs quiero mi gente de Acapulco. https://t.co/4mzq1u9UxD Ya estamos listos para nuestro concierto de acapulco! https://t.co/GGvEy6nN48 Super selfie!!! @Camila_Cabello talentosa, exitosa y muy sencilla. https://t.co/KJ7BYHcpho https://t.co/PJG0I3R05G Aquí ensayando el alma al aire!!\nhttps://t.co/JiB4LBG9tK me lo pasé muy bien en el Person of the year!! Y me emocioné muchísimo. https://t.co/Ww20tGnO1M I’m a big fan!!! @lelepons https://t.co/dt6K1Wdad2 https://t.co/Wl4YKi6TR8 Compadre! @AlejandroSanz el abrazo que sońe desde nińo! Me emocioné mucho! El abrazo que une las almas. #ElAlmaAlAire https://t.co/7ns6gBVUOn Felicitando a los papás de @Camila_Cabello por el vozarrón que tiene la nińa! Madre mía! https://t.co/AMnDikNF7R Buenos días desde Mexico 🇲🇽 nos vamos a Las Vegas! Hoy es el día más duro de todos, pero la ilusión es mas grande que todo! Os quiero. https://t.co/VpLNe45BtO Esta noche tenemos una cita en el auditorio Nacional @AuditorioMx https://t.co/5Gqt47K0NF ❤️❤️ Bieennnnnnn!!! @PatyCantu que bien! Mańana nos vemos!!!! Lo pasaremos muy bien!! Un abrazo! 👏🏽👏🏽👏🏽👏🏽🎉🤗 https://t.co/OG2DBzzOYQ Sí, estamos en el auditorio Nacional!! Por qué no te vienes y te cantas una canción conmigo? Te parece!? Ganas de cantar contigo otra vez https://t.co/Gt77DUok7z Oye @PatyCantu me encanta tu nuevo tema!! #Natural\nhttps://t.co/ypjYc8Ghv6 felicidades compañera. En qué lugar del mundo te encuentras? Feliz semana a todos. Qué ganas tenía de ver el video capítulo de nuestro concierto en Monterrey! Aquí lo tenéis: https://t.co/NMQC6hTgeU\nmañana tenemos una cita muy importante regresando al @AuditorioMx os quiero. https://t.co/vFNynF1uCO Nos podéis ni imaginar lo importante que fue para mi chiquito de la calzada durante mi adolescencia. Lo echaremos de menos! https://t.co/gkcg3aTw9b https://t.co/3tn3pPPcGn No os podéis ni imaginar lo importante que fue para mí este gran artista durante mi adolescencia. Me acuerdo que grababa todos los programas donde él salía y me pasaba todo el día imitándolo. Qué descanse en paz! Chiquito de la calzada! https://t.co/WJdnCpYTQv El 14 de noviembre volvemos al auditorio Nacional y estoy como loco de contento. Nos quedan cuatro días.\nBuen fin de semana a todos. https://t.co/CBGMxCTi7q RT @ClaromusicaMX: ¿Quieres pases para @davidbisbal? Te esperamos a las 5 en @CarsoPlaza. Aquí te decimos cómo participar: https://t.co/JTy… Mi gente de Monterrey, el concierto anoche fue muy especial para mí. Muchísimas gracias por todos los detalles que tuvisteis en cada canción. Os quiero mucho y estoy deseando volver. ❤️ https://t.co/1hxKpnDdzi Me encantaría, porque mi amor por México no tienen límites. Gracias amigo Carlos por tu comentario https://t.co/xay1h5rgZb https://t.co/9Lrqt4ERMs te puedes ver el video capítulo de Costa Rica, qué gran recuerdo! Vídeo dedicado a todas las princesas. https://t.co/YAaSy10VOT ❤️ https://t.co/WBCKHXRoLl RT @LatinGRAMMYs: ¡CONFIRMADO! @davidbisbal participará en la Ceremonia de Gala a la Persona del Año 2017 en honor a @AlejandroSanz... http… RT @ClaromusicaMX: ¡Segunda etapa! Tu oportunidad de ir al concierto y soundcheck de @davidbisbal está en Facebook. ¡Participa! https://t.c… RT @UMusicMexico: Lo único que necesitas para ver a @davidbisbal en el #HijosDelMarTour es aprovechar esta promoción. \n*Válida en taquillas… Voy pa ti compadre! @AlejandroSanz https://t.co/8h4zHGWBmR https://t.co/rbjko9GcB5 Me encanta que hayan aumentado los caracteres para que nos comuniquemos mejor! Os quiero mucho! Mirad este vídeo de nuestro concierto en Costa Rica 🇨🇷. Mańana cantamos en Monterrey! ❤️ https://t.co/j73Zkl2zVI https://t.co/t0q3SEC24P puedes ver aquí los capítulos de la gira!! Guatemala!!! Gracias por tanto! https://t.co/IhEgMIQVnj https://t.co/scNldxQy2h  Almeria en mi ❤️ https://t.co/GIHlKgYSp0 https://t.co/QnHwHVOGon Pura vida mi gente de Costa Rica. Gracias por el concierto de anoche. Me lo pasé muy bien. Volveremos pronto. https://t.co/R0E81gyXf5 RT @ClaromusicaMX: ¿Aún no estás concursando para conocer a @davidbisbal y estar en su concierto? Entra aquí: https://t.co/XnxAy3cioH https… Buenos días desde Costa Rica. Espero que estéis descansando este domingo.\nEsta noche nos vemos en concierto.\nhttps://t.co/C1DUzqTCoQ https://t.co/3qrLo6hjmB Muchas gracias por el recibimiento, estoy deseando cantar mañana. Os quiero. https://t.co/ZN1RxSAgaB RT @musicagran: @davidbisbal estara el 14Noviembre en el #AuditorioNacional #Mexico le acompañara @_christiannodal  tus entradas en https:/… RT @bisbalfanclub: Todo Es Posible - Tema Principal De La Película \"Tadeo Jones 2 de @DavidBisbal, @TiniStoessel https://t.co/FYhBbwwmRw #N… Gracias Guatemala por tanto cariño. Prometo volver pronto. Os quiero. Ahora seguimos a Costa rica. BESOS A TODOS. https://t.co/3OiysKTz6R Un saludo mi gente!! Esta noche Guatemala.Mientras recordamos nuestro capítulo de Colombia. https://t.co/lpk5aqkCx7 https://t.co/FmWmyDdGRM https://t.co/pnOSDsekRM Managua, Nicaragua 🇳🇮 os quiero! Aquí puedes ver el vídeo capitulo. https://t.co/clyUkBUGmF Una tarde libre. Me encanta Centroamérica.\nDeseando encontrarme con mi gente de Costa Rica y Guatemala!\nhttps://t.co/6by27TFEuM https://t.co/lHrAWdBadT https://t.co/6by27TFEuM pronto los video capítulos! https://t.co/V4WRWnXWNh No he dejado de intentarlo, porque creo en los milagros!!! Gracias Nicaragua por una noche mágica llena de energía y sentimiento. ❤️ https://t.co/DxHbzvqzGw Esta noche estaremos al 100 × 100. Viva Managua, Nicaragua 🇳🇮 https://t.co/ebSKj2dKL2 Sin comentar los gustos musicales, la verdad es que lo que más me emociona es que la música genere esto. Un abrazo! Gracias por el vídeo.❤️ https://t.co/EDb12SjsRD Esclavo de sus besos desde otra perpectiva!! Bogota Colombia. Esta noche nos vemos en Managua Nicaragua. https://t.co/nN0Ik5zqMQ https://t.co/ZVR6td53a2 Gracias por la energía en este maravilloso concierto. Mañana tengo que dar el 💯 en el concierto de Nicaragua. 5 am en pie 😱❤️ os quiero! https://t.co/ImkdgYxmFG https://t.co/b28lQdy1Cb Con las embajadoras de buena voluntad de @UNICEFColombia @mcarvajal28 y @MONYDIAADIA gracias por la recepción. https://t.co/WgNqNttTMI Agradecido con los medios de comunicación, con @EmbajadaEspCol  con @UNICEF @UMUSICA Y con la gente que ha comprado su entrada al concierto https://t.co/Mqlk4EGZvS Hoy y siempre contigo mi @antoniorozco te abrazo, lo hago fuerte y lloro contigo! Te quiero amigo! Mucha fuerza! Llegando a Colombia. Ya estoy preparado para el concierto de mañana y recepción en la embajada de España con mi gente de Unicef. https://t.co/Sj7UNO7FpC https://t.co/Ex5ViuJZBQ Os mando algunas fotos del concierto de anoche. Ahora volveré a Colombia para el concierto benéfico. Gracias. https://t.co/QiIAQGWadH Gracias mi gente de Panamá. Un concierto inolvidable un público muy enérgico y participativo. Estoy deseando montar el video capítulo. ❤️ https://t.co/FEViSiwDem Gracias niñas, estoy listo para salir al escenario. Un beso!! https://t.co/SfPNSCGmSL Un saludo desde Panamá a todos.Dos horas antes del concierto. Deseando encontrarme con mi público. https://t.co/82odVSW2II Con mi club de fans por primera vez en Panamá.\nDespués de mi primer concierto doné mi camisa firmada.\nCon muchas ganas de cantar mañana https://t.co/fedYxBcdOc RT @bisbalpress: @eincreibledb @davidbisbal @Vale975 Enlace para escuchar a @davidbisbal en @Vale975: https://t.co/QSIibndfUW esooooooooo, con ganas de llegar a Uruguay.. gracias por esta entrevista. https://t.co/8EWXA07TKi Estamos a punto de entrar en directo, os quiero mi gente de Argentina.\n\ndb https://t.co/r4qMfvrVqK https://t.co/fpLkbj474C prueba aqui.... besos https://t.co/CSV9VGgxkV ya estamos listos compañeros... entramos en directo. https://t.co/CHWiIdQB2y Gracias por el recibimiento a los clubes de fans en Panamá 🇵🇦 os quiero mucho. Ya estoy listo para el concierto. https://t.co/4QYFWDlzTp Mi gente de Argentina, os mando un saludo desde México. Sorpresas!! para vosotros! ...  ver vídeo! Se abre un segundo @stadiumlunapark 🙌 https://t.co/WihsUEzplH https://t.co/kVQJVrNuT8 Un concierto muy especial en Durango, dedicado todas esas mujeres luchadoras. Canté para vosotras. https://t.co/AaDpWAj13J Patricia es un encanto de niña, me gustò mucho conocerla, me dio mucha energía positiva. https://t.co/7rMKdk8UlU Què bonito regalo, gracias por cantar conmigo. Os quiero. https://t.co/DBPZ3krmj3 Gracias Daniel, Què publico tan hermoso el de Durango, viva Mexico. https://t.co/1EzYciQS6B Mi gente de @TurismoDurango acabo de llegar y ya estoy listo para el concierto. Les espero en la plaza Cuarto Centenario ,Festival Revueltas https://t.co/DAgQPMPEKL Ya estamos listos para el concierto de esta noche en Durango. Te quiero Mexico. Os quiero a todos. Siempre contigo. https://t.co/rVzdV63XWW https://t.co/9aoyDhqf59 https://t.co/93DM7annM0  Terminamos en Espańa y empezamos ahora en Latinoamérica!!! Esto es un “Hasta Pronto” https://t.co/etD7S8Q0E6 https://t.co/57F0JNxAqj Este sábado comenzamos la gira en Durango, Mexico 🇲🇽 y Y a la semana siguiente en Panamá, Colombia y Nicaragua. ❤️ https://t.co/CgsDOAtc7B Así han sido los primeros ensayos en México para el inicio de la gira latinoamericana.\nEl primero será este sábado en Durango. https://t.co/4AhIDVyLRf https://t.co/hEDSfTm3Jl Hoy día internacional contra el cáncer de mama, aquí estoy uds . Un abrazo fuerte a todas esas grandes luchadoras https://t.co/ysGzDqBNkS Super contento, estamos a punto de hacer soldout en el Luna Park de Buenos Aires, Argentina. https://t.co/15GL6PNoCF Amigo @alo_oficial ayer coincidí con un amigo tuyo en el concierto que hicimos en Brooklyn! Suerte en #Austin https://t.co/q3dfKuUG9n Thank you @TIDALHiFi and @JColeWrld for making this concert happen! Helping the people that really need it.👏🏽🙌🏽 https://t.co/2G7v1TVHXn Qué gran noche, un abrazo fuerte hermano. https://t.co/21xvL31cHS https://t.co/spogEuc1my  En New York lleve a mi compañera de @UniversalSpain Rosana Fernández que se hiciera unas fotos en Times Square. https://t.co/bGvXjyDsw8 Empezamos! Primera parada! Os quiero! https://t.co/2GlqDOS0Ft Mandemos todo nuestro apoyo para nuestra gente de Galicia, Asturias y Portugal. https://t.co/EYfqf56p0J Qué doloroso ver las montańas arder! Qué impotencia! La gente enferma que provoca fuegos!  #galiciaarde https://t.co/fSEmBdS2oI fin de gira de España cuando los clubes de fans compartieron conmigo las banderas de Almeria, Andalucía y Espańa. ❤️ https://t.co/AUakPIgPBc Qué maravilloso fin de gira de España hemos tenido en mi tierra Almería. Me encantó la gente de Huércal-Overa. https://t.co/jf8zTHPdrM https://t.co/8UhjOArA5d arropado en mi último concierto de España en Huércal-Overa Almería. #Familia https://t.co/4fWhvgC8qG Listo para mi concierto final en Huércal-Overa, Almería.  Con mi familia aquí apoyándome, espero que estéis todos disfrutando. https://t.co/JgThD04Ktf See you on 10/17 at #TIDALXBrooklyn. Let’s continue to support those devastated by natural disasters: https://t.co/gVkOTyzw9t https://t.co/1g48EHrnB8 Aquí os paso un adelanto del capítulo en las fiestas del Pilar. Qué bien me lo pase en Zaragoza. https://t.co/1M12Pth7kc https://t.co/HhISF99sUv No tendremos mucho tiempo de disfrutar del mar en mitad de la gira.  Por eso me gusta ver y recordar estos momentos! https://t.co/QzcosYZtc2 Felicidades a todas las Pilares y a todos los españoles en nuestro día nacional. Os quiero. https://t.co/Lqn3BAmsRb Gracias por este cariño tan inmenso mi gente de Zaragoza! Ha sido un placer volver a esta maravillosa tierra. Viva la virgen del Pilar! https://t.co/aXIeMtQRRu Lo más bonito de la música, es poder reencontrarme con vosotros y agradecer todo el cariño que me habéis brindado desde el principio https://t.co/goV4wFI0ya https://t.co/ElNU8cbcvN Un beso muy fuerte para mi gente. En el concierto de hoy en Zaragoza, lo daremos todo. Os quiero! https://t.co/XVfdjwMVfN Lo tenga o no. https://t.co/NWPnRXQ2BD https://t.co/wHLTZib4aK Buenos días a todos! Feliz Martes! Mañana nos vemos en Zaragoza! https://t.co/evUbYGh44H Zaragoza será un concierto inolvidable https://t.co/PjurVUtckD Buenos días! espero que paséis una maravillosa semana.\nAquí tenemos un adelanto de lo que pasó en Bilbao!! VideoCapitulo en Marcha...❤️ https://t.co/GFgLfWzniz Gran concierto ayer en Bilbao con un público de lujo!!! https://t.co/htdl98MHg2 https://t.co/25eRhuQ7X5 ayudemos a nuestros nińos más necesitados! @unicef_es https://t.co/uhQFjC7c9H Espero que paséis un gran fin de semana!!! Nosotros nos vamos a cantar a Bilbao!! Os quiero! https://t.co/yuqMWCOTgi Doy las gracias por este sueńo \"Si no te hubieras ido\" de @MarcoASolis con @JuanLuisGuerra. #TodosSomosMAS! https://t.co/OaOn7Ua29m https://t.co/gi0jgevDQb RT @MarcoASolis: ¡Gracias @davidbisbal y @JuanLuisGuerra por esta emotiva versión de \"Si no te hubieras ido\", sin duda será del agrado de t… https://t.co/0zhW2f3WJq estoy deseando que se estrene \"siNoTeHubierasIdo @JuanLuisGuerra https://t.co/saSeAZYHgZ Seguro que si va a salir todo bien, mucha fuerza para Antonio @ACarmonaOficial https://t.co/vPh1i1fuVE Mucha fuerza @ACarmonaOficial y toda tu familia! Todos los míos con vosotros!! Os queremos! Con mi amiga Nayara y nuestro baby pelón! https://t.co/b0iIqs0U6d os quiero! https://t.co/QayXSHxUwz El próximo viernes...#TodosSomosMAS https://t.co/MpyLaSckDp Esta ausencia Gandía! Te quiero! https://t.co/e1sW5qP2XI viste el vídeo clip? https://t.co/QaI0vO8gRV @bisbalfanclub Buenos dias, cualquier homenaje que le haga al club de fans en todos los países se queda corto. Os quiero mucho. #SiempreContigo Te quiero Latinoamérica https://t.co/6lfbBnlaPg https://t.co/XBLt8wdHMq Estoy super contento de compartir con vosotros mi nuevo videoclip #LoTengaONo grabado durante la gira https://t.co/IHWPeutQB1 os quiero!!! https://t.co/pjZXVHN8Rb Amigo @_christiannodal espero que te haya sentado bien cantar con Mariachi en Espańa! Viva México. https://t.co/NYYGEmFoH7 https://t.co/vM29OxLWS2 Con la princesa Pastori @npastorioficial un sueño hecho realidad. https://t.co/CUBQ8hMCq5 https://t.co/Zq58RMyp6n sin palabras lo que me habéis hecho sentir! Gracias a todos!! Os quiero! https://t.co/CAYY4z1kj6 Pero todos en el @WiZinkCenter será una noche especial. Un beso para toda mi gente de Madrid y toda la gente que nos visita de otros países. https://t.co/b5bNz0CyHp Hoy hemos estado grabando unos vídeos de ayuda para nuestros nińos de México, Puerto Rico y todo el Caribe! @unicef_es os queremos! https://t.co/mlVEJ4dbWl Bienvenida a España espero que te sientas como en casa. https://t.co/EQBCNk3KZb Mi gente de Guatemala!!!!! Estoy deseando volver a cantar en este hermoso país! Os quiero! https://t.co/KKoBTQYjAV https://t.co/aMdMg0MNDh Muy buenos días, en octubre podré anunciar una de las colaboraciones más deseadas que he tenido nunca. Os quiero! Cumpliendo otro gran sueño Así es amigos, Jesús es muy especial, muy generoso y una gran persona!! Felicidades por el programa. https://t.co/gbc1nCnmSZ Hola amigos! Ya queda poco para el concierto de Madrid. Qué ganas.\nOs dejo con el capítulo de Sevilla! https://t.co/8u0ubwPl4d os quiero!! https://t.co/nmn2L3w43Y Muy emocionado!!! Felicidades a todos mis compañeros nominados. Os quiero.!!!!!!!! https://t.co/fPDp3rlT4o Buenos días mi gente!!! El video capítulo de Sevilla estará listo esta tarde!! No te lo pierdas... os quiero!! Madrid the next stage! 💪🏽 https://t.co/zVm4rrisBs Arrodillado ante vosotros.\nhttps://t.co/OpPlvrTHIP os quiero. https://t.co/tLlRSqBTLD Buenos días, hoy mi homenaje es para estas manos! Un pueblo unido que da todo por encontrar vida! Así es México 🇲🇽 https://t.co/Y4DGSV4a99 Hoy no me pierdo por nada del mundo el estreno de la nueva temporada de @VolandoVoyTV mucha suerte amigo @JesusCalleja Os quiero! https://t.co/ZBJJnc9PUH Qué tengáis un feliz domingo.\nYa tengo ganas de volver a cantar en Sevilla.\nEl próximo sábado nos vemos en Madrid. https://t.co/JsUU5IBJ1L Gracias Sevilla por una noche que guardaré mi memoria para siempre! Aquí voy con el regalo del club de fans 😂😂 qué arte tenéis!#TadeoJones2 https://t.co/mHSFevFiDl Ole y ole!!! 😍me encanta!!! Gracias por estos videos tan bonitos que compartís conmigo! Os quiero! https://t.co/OdF34h5vD8 Un homenaje por todo el sufrimiento que está viviendo este continente últimamente.\nOs quiero mucho. Viva Latinoamérica. https://t.co/7gHcWlsLwD Buenos días, hoy nuestro concierto de Sevilla será un homenaje para nuestro querido México, Puerto Rico, República Dominicana... os quiero https://t.co/aQLyHhift9 Qué bien mi gente de @bisbalstpanama con muchas ganas de volver. Os quiero. https://t.co/TGZH97c1Az Paisanos de Huercal Overa y Almería, acompañadme el 14-10 en el último concierto de #HijosDelMarTour2017 en España! https://t.co/tP5VarMijW https://t.co/g7Qys3SBZz Felicidades @juanes me ha gustado mucho tu entrevista con mi paisano @HerreraenCOPE suerte en #LaVoz Amigos de Mexico. Me pasan una lista de albergues para aquellas personas damnificadas por el terremoto. Mucha fuerza para mi México 🇲🇽 https://t.co/HnlkM0Wn7j Feliz cumpleańos amigo @LucianoPereyra espero que pronto lo celebremos Amigos, aqui tenéis el capitulo de las Islas Canarias. Nos vemos este sábado en Sevilla.\nhttps://t.co/XaJaUWEnJy https://t.co/EZsJlAf460 Amigos de Gandía, el 1 de octubre estaremos por allí con #HijosDelMarTour2017!! Os espero a todos!! https://t.co/6ZH6nzZyAH https://t.co/nGijXhFuOR Mexico, estamos con un nudo en la garganta y con el corazón en un puño! Rezaremos por nuestra familia de todo México! https://t.co/RBzZHr4WLh Por favor, tomen todas las precauciones que sean posibles! Estamos con todos vosotros. Fuerza para México! https://t.co/1zXIRTdH9O Por Dios, no me lo puedo creer que otra vez ha temblado la ciudad!! Estamos con vosotros rezando todo el tiempo! https://t.co/V6djtxoe7f Lo que pasó en Tenerife!!!\n#Buleriadb2017 El video capítulo está en camino. https://t.co/X7IgcTxkvT Mi gente de Latinoamérica. Ya estamos ahí con todos vosotros. Os quiero mucho. https://t.co/0BcbaVJK4Q https://t.co/6fS6pSUnCU Acabamos de bajarnos del escenario en Tenerife! Que subidón!! Aquí tenéis un teaser del concierto de las Palmas. #videocapitulo en camino... https://t.co/RupyolSun0 Te quiero México 🇲🇽 https://t.co/Xqp8KehDdU Qué maravillosa energía la de mi gente de las Islas Canarias 🇮🇨 ayer en la palmas y hoy nos toca en la Laguna, Tenerife. https://t.co/zohtniXVIX Muchas gracias a los amigos de los 40 por las nominaciones, estoy muy feliz. Felicidades a todos mis compañeros de todo corazón. Besos. https://t.co/JmY4N8HjLW Mañana tenemos el primero de los dos conciertos en las Islas Canarias. Con muchas ganas de llegar. https://t.co/l96GirattK ya lo sabéis!!! @_christiannodal cantará conmigo en Madrid y en México D.F. en el auditorio Nacional! https://t.co/nO6Fhu02tI https://t.co/MVCtRqQr7n Así es amigos, el concierto de Colombia será a beneficio de @Unicef y como embajador español me siento feliz de anunciarlo. https://t.co/4RDitlY3ZW #recomendado muy buen trabajo de mi compañero @Residente https://t.co/lrfXkW8CCl MI GENTE DE CHILE! El próximo 26 de Noviembre vuelvo en concierto al Teatro Caupolicán! Nos vemos pronto! os quiero https://t.co/rVzdV63XWW https://t.co/eYrUrsMI38 Super video capítulo de Villarrubia !! Gracias a todos los miembros del club de fan y toda mi gente . https://t.co/FBy96p4UkX https://t.co/wQhHPt6l8o Me encanta el club de fans siempre cantando conmigo!\nOs comparto este vídeo de ayer. https://t.co/BijDp6Gb7Q Mi gente de La Florida, seguimos rezando por vosotros! Fuerza!!! Amigo @albertocontador quiero felicitarte por tu victoria en la subida del #Angliru Final soñado! Te lo mereces!!!! Te queremos. Listo para enfrentarme a los conciertos de septiembre! Con ganas de volver a las islas Canarias, Sevilla y Madrid. https://t.co/elkQilGZ6N Espero de todo corazón que mi gente bonita de México esté bien. Mucha fuerza a un país que amo. https://t.co/CfUWl8jfNX Te amo México! Número uno en el chart general de tocadas! Con mi amigo! @_christiannodal https://t.co/kLq0BFBJCk https://t.co/5kwpyyUQgd El cambio de repertorio estará listo a partir de los conciertos de las Islas Canarias! Os quiero! No os perdáis las sorpresas. https://t.co/KYjADupAZ9 Rezamos para que todo el Caribe resista el huracán \"Irma\" un beso para mi gente de Puerto Rico, República Dominicana, Cuba, Florida... 🙏🏼 Como Pez en el agua!\nAhora volvemos al trabajo fuerte! El repertorio cambiará algo este mes de septiembre! https://t.co/4XJfCG8Rou Un día más de buceo y seguimos con la preparación de todos los conciertos!! Un saludo y feliz domingo! Os quiero! https://t.co/anxgS0oDe0 Lucirás los colores de la Selección por encima de todas cosas @SeFutbol #MandamientoSefutbol https://t.co/5vH7JVRbwq Gracias amigo @JesusCalleja por las fotos que me hiciste con tu súper cámara.\nSiempre es un placer bucear contigo. https://t.co/Y7trf3d8rd Preparando los conciertos de septiembre!\nTendremos cambios para el final de la gira de España. https://t.co/rVzdV63XWW https://t.co/S1ADAF9M3x Feliz estoy de saber que pronto empezamos la gira en Latinoamérica https://t.co/MBLxt99LDR RT @MixupTeam: ¡Atención fans de @davidbisbal! \n\n#DavidBisbalEnMixup https://t.co/kK1RajEzNu Genial!! Qué bonita fiesta tendremos! Ya he visto que has mejorado mucho cantando!! Te felicito! Te espero el 16 de sep! https://t.co/ivJXaYw5RM Hola Eva!! Por qué no te vienes a cantar conmigo otra vez a Tenerife el próximo día 16 de sep?@OficialEvaRuiz @RafaCanoOficial mucha suerte en esta temporada con déjate llevar!!! Un abrazo 🤗 Linares, el último concierto de agosto!\nGracias por lo vivido ayer. No tengo palabras. Ahora a preparar el repertorio de septiembre! https://t.co/wjLuRSPkZP Nińas!!!! Qué bonito!!!! Gracias 😊 https://t.co/EO7l5RZwlL https://t.co/gvblweL15m Nos quedan pocos conciertos para terminar la gira de Espańa y empezar la latinoamericana https://t.co/Qz8k9UgRu7 @Dasoul El próximo 16 de septiembre te espero en Tenerife. Que ilusión 👏🏽👏🏽👏🏽 un abrazo amigo mío! Una sorpresa!! Aquí perdéis ver \"todo es posible\" en directo desde El Teatro Real con @TiniStoessel https://t.co/qhRCoZgjR2 https://t.co/WYRh37cC1B No te pierdas aquí el video capítulo del estreno \"El secreto del rey midas\" #TadeoJones2 con mi amiga @TiniStoessel https://t.co/KbALfvdkmF Me lo pasé muy bien gracias a mi gente de Ontinyent!!! https://t.co/vHyczIFZ2K Algunas fotos de mis compañeros #tacodeperro en el festival de Cap Roig! https://t.co/FjtRhI45iO https://t.co/3JhuGR8ioi RT @paramount_spain: Gracias a todos los participantes por todo su apoyo. #TadeoJones2 @davidbisbal, @TiniStoessel https://t.co/njk08gUNl7 Muy feliz con esta noticia! Gracias amigo @_christiannodal por tu arte! Os quiero mi México 🇲🇽 deseando que llegue el auditorio Nacional 14N https://t.co/fWVojtYWka Un descubrimiento conocerte amigo @Arcangel_Flamen Viva el arte bueno y las personas de verdad! https://t.co/UZTGBeNJNv Amigo Jose Irun, gracias por tu entrega y por tu profesionalidad. Además de tu cariño, me encanta tu forma de trabajar! Suerte en todo! https://t.co/rOzYZee7N8 Gracias Jesús por tu trabajo tan medido en el concierto del Puerto de Santa María!! Os quiero mucho a todos. https://t.co/fWmRPcRGiO Si supierais que al salir del concierto yo también siento lo mismo de mi público!!! https://t.co/8AKnLOjOPs https://t.co/7cr9nUG4VR Argentina, ya se ha acabado la preventa Y comienza la venta general para el concierto del Luna Park el 3 de dic https://t.co/ww2HijuA1S ❤️ https://t.co/ZBVo1SuIp1 Como te explico que sigo sońando con El Puerto de Santa Maria! Gracias por una noche que jamás podré olvidar. https://t.co/VZhIuGYYFk Os sabéis todas!!??? Un pequeño teaser de lo que viví en Punta Umbría! Y de lo que vamos a vivir en el resto de la gira! Os quiero!!! https://t.co/dfmD7hCIud Estoy de acuerdo contigo Ana María, yo tampoco comprendo esta maldad! Un abrazo de aliento para los familiares y amigos de las víctimas! https://t.co/BGygBg9w1S Ya estoy en casa!! Andalucía! En pocos días estamos en Punta umbría y En el puerto de Santa Maria! Os quiero. https://t.co/muGHRCNcCf https://t.co/lm6vHGbYlX Qué alegría!! \"Lo tenga o no\" sonando en \"Las Estrellas! nos vemos el próximo día 3 de dic en el @stadiumlunapark https://t.co/vm4bYIPqol https://t.co/hjLPM0K2qP Así es!!! El 3 de dic en el Luna Park!!!!!https://t.co/vm4bYIPqol gracias Susana y todo tu equipo por tratarme siempre tan bien! https://t.co/XXTDqPPQjy Qué ganas de que llegue el momento!!!!\nhttps://t.co/vm4bYIPqol 3 de dic Buenos Aires! https://t.co/A7Bm2SRcrQ Así es, a partir de las 8:00 de la tarde comienza la preventa para el concierto del 3 de diciembre en el Luna Park. https://t.co/vm4bYIPqol https://t.co/Nv6QPbEvFT Y regresarán más cosas que os van a sorprender! Me encanta saber que el tiempo hace su trabajo! Os quiero! https://t.co/koaXqK9icO Estoy deseando poder cantar esta canción el próximo 3 de diciembre en el Luna Park de Buenos Aires! https://t.co/JF3HCKGNdi Muchísimas gracias a @UNICEFargentina por invitarme a participar en #UnSolParaLosChicos2017 me quedo con la gente solidaria. Os quiero! https://t.co/dA2pKQDapc Todo un placer haber colaborado con @_christiannodal en su tema Probablemente. Estoy muy contento de este éxito!! https://t.co/8vjfMjj4oM https://t.co/jVnorobfkp\nUn saludo amigos, no os perdáis en mi canal de #YOUTUBE el video capítulo de Andorra y Pineda del mar.\nOs quiero. https://t.co/hp5QSDdyNk Claro que si amigo! Muchas ganas de cantar contigo también!! https://t.co/qCRKELgZAl @Dasoul compańero!!! Por qué no te vienes a cantar a algun concierto de la gira!!! En sep llego a tu tierra! Te apuntas!? Con muchas ganas de llegar de nuevo a Panamá https://t.co/Rd03K3BjPw Mi gente de Acapulco México!!!! El próximo 18 de nov!!!! Estamos en concierto!! No te lo pierdas! https://t.co/jvqF6SQOPB https://t.co/DpqGBSjDsk https://t.co/jvqF6SQOPB qué suerte cuando tu familia viene a verte a un concierto! Me emociona. https://t.co/aHyY2YaBew Os dejo el vídeo de otra gran parada en el #HijosDelMarTour2017: Gijón!! Un gusto estar allí! https://t.co/YP5OLB7WmA Muchísimas gracias #AndorraLaVella  por regalarnos una noche maravillosa llenar de energía! Os quiero! Pronto volveré! https://t.co/ppUgKGDEfK https://t.co/qs2cs9qn0j Hoy es el cumpleaños de una persona muy importante en mi vida!! Mi hermana María Del Mar!! Felicidades!!! 🎉 😍 https://t.co/mFkl7ifmNL Jesus estoy deseando volver a bucear contigo! Estoy de acuerdo, entre todos debemos cuidar el mar! Sigue disfrutando de tus vacaciones! https://t.co/8Yw3bCmzP4 https://t.co/UXuGTUM1CV\nTengo un adelanto de lo que vivimos anoche con el público de Gijón, con el club de fans, con Edgar y Carlos Alfredo https://t.co/XnHuK8tKqi Gracias Tini por tu arte!!! Me lo pase muy bien. Gracias por acompańarme en el @Teatro_Real https://t.co/Ome4MXbC3c Ya parece que la furgoneta nueva le queda poco para llegar al punto donde nos quedamos parados! Hemos calculado que llegamos a tiempo! 🤗 https://t.co/39m1eLjjWo Amigos! Hoy estaré en @rtvandorra en el programa de radio Abierto por Vacaciones a las 16 h!! Nos os lo perdáis! #HijosDelMarTour2017 https://t.co/Umkd2EB94Y Me acuerdo perfectamente de este dia. El se reía mucho porque sabia que me daba miedo ir en la moto de dos plazas. https://t.co/hDwwobe8z6 Muy dolido por el fallecimiento de Ángel Nieto! Todo mi apoyo para sus seres queridos y amigos.\nFue un gran profesional y ser humano! El 12/08 estaré en #UnSol2017 a beneficio de @UNICEFargentina  en @eltreceoficial  desde @TecnopolisArg! Aporta aquí https://t.co/6OZoc6M4xG https://t.co/3CXBv8diLC Estoy superfeliz que el último concierto de la gira por España vuelva a mi tierra Almería!! Nos vemos mi gente de Huércal-Overa! https://t.co/LHkqrNi08z Ya está el capítulo del teatro Real aquí!!!! Besos!!! https://t.co/TQ8G2z9nkS os quiero!! https://t.co/xgaCrWRGEt Muy grande volver al @teatro_real en el @umusicfestival, qué energía más especial se generó! #HijosDelMarTour2017 https://t.co/TQ8G2z9nkS Habéis visto que sincronizado con mi padre!!? Espero que estéis pasando un buen fin de semana! https://t.co/iaifxCLXci https://t.co/c1Y3LoCpKp Feliz fin de semana!! Nosotros preparando ya los conciertos de Gijón, Andorra y Pineda Del Mar!! Besos! https://t.co/m02RRIrPXU Un sueño hecho realidad @MPOVEDAOficial https://t.co/GcZXlfdA6z https://t.co/5PT9D9ECQP Me ha encantado el trabajo armónico y de beatbox!!! Gracias por el cariño. https://t.co/021i03lhL2 #HijosDelMarTour2017 el próximo 23 de agosto en Ontinyent, os espero a todos!! https://t.co/bmVAgmtKhP https://t.co/sHTGQqC1mL He leído ambas críticas musicales y he de decir que me ha gustado mucho. De todo se aprende. Gracias por la confianza y por vuestro cariño! https://t.co/UXJ9EWoZgl Otra noche en el Teatro Real!!!\nOs quiero!!! 😊🤗 muchos sueńos que se siguen cumpliendo! https://t.co/xUc0j1leMb El 9 de agosto nos vemos en Pineda de Mar en el Festival @artsdestiu , vamos! #HijosDelMarTour2017 https://t.co/B4AVzNs008 https://t.co/qUlxGgAxt8 https://t.co/S7C9Rrnwpi no te pierdas el vídeo capítulo de Londres! Os quiero! https://t.co/Qdi1XNqzoO Andorra, nos vemos el 7 de agosto con #HijosDelMarTour2017!! https://t.co/FcP456qByo https://t.co/EfnMeLlBRo @EdgarBaoOficial qué bonito que vengas a cantar conmigo a Gijon el próximo 4 de agosto!! https://t.co/n3jE5qtDeE https://t.co/iGMISojPbY Gran foto para el recuerdo con mis compańeros en Londres! https://t.co/mul9afhD8T @SebastianYatra @juanes @JuanLuisGuerra https://t.co/OeX1ltIe4W De Londres directos a Madrid. @Teatro_Real os quiero!!! https://t.co/lnyvfWjoTP Ayer noche inolvidable junto a mis compañeros @JuanLuisGuerra @juanes y @SebastianYatra en Londres. Me guardo esta foto del abrazo! https://t.co/hgObtq9lid Panama!!!! Nos vemos pronto!!! https://t.co/i60rfPLuDV Y yo os quiero a vosotros!!! https://t.co/clxeb1L92p Vídeo capítulo Palma de Mallorca!!!! https://t.co/fTuzURst84 os quiero!! Hoy no te puedes perder en el canal de YouTube El video capítulo del concierto de Mallorca. Os quiero mi gente! https://t.co/By3cCGwTWa Mallorca!! Gracias por abrazarme! Os quiero y estoy deseando volver.... queréis videocapitulo!?? https://t.co/SmxsHCAPJe Mallorca, vamos a darlo todo esta noche!! https://t.co/pBszi3tvAi https://t.co/5X8gn0JoW8 Habéis participado ya en este concurso??? @Aqualung_Spain espero que os guste!\nhttps://t.co/x0cZLZWb9F https://t.co/12GT3DPKYv Me encanta conocer de cerca como vive la gente la gira!! Gracias por tanto cariño. Toledo y malaga. https://t.co/EME2DgVbHF https://t.co/mxmvX61hjX Con muchas ganas de que llegue mańana! Gracias Mallorca! https://t.co/sqDfxSfPlu RT @TheO2: WIN tickets to Hola! London to see @JuanLuisGuerra @juanes @davidbisbal @SebastianYatra - simply RT to enter. Winner announced T… Para mí siempre es importante agradecer el trabajo de todos. Muchísimas gracias por tu cariño. Un abrazo muy fuerte https://t.co/lyE7aN9J6r Acabo de compartir un álbum de fotos de los conciertos de Toledo y Málaga!!! 😍😍😍https://t.co/I5fVjRGbf6 Mallorca el próximo! Os quiero! https://t.co/hnwAIsgOul Toda mi adolescencia la viví como fiel seguidor de Miguel!!! Marcó mi vida y el deporte desde entonces no se ha separado de mí. https://t.co/4zepZaDnGU Gracias amigos por todo el carińo!! Deseando volver a Malaga! https://t.co/rnBbpgln5Y Gracias por este fin de semana!!! Lo he dado todo porque sé que vosotros os dejáis la piel! Os quiero!!\n😊😊 https://t.co/VQBmqetCgT Foto de unicef_es https://t.co/RkDdzMgjeT feliz y contento con este dato! Felicidades compańeros! @unicef_es RT @AXS_UK: 1 week until @JuanLuisGuerra @juanes @davidbisbal &amp; @SebastianYatra come to @TheO2 for #HolaLondon! Don't miss this! https://t.… Imágenes de anoche en Toledo!!!! Gran fiesta, gran público y grandiosa tierra. Os quiero!! Hoy toca Malaga!!!!! https://t.co/OoodbwJ8EV https://t.co/IMAp39xstE Recuerdas cuando te uniste a @Twitter ? Yo sí! #MiAniversarioDeTwitter https://t.co/YCCkDugaXq Siempre es un placer volver a mi tierra de Andalucía!! https://t.co/ThtpxhjjUz Vamos a por el doblete mi gente!!! Os quiero!!! https://t.co/FdPqNSTqNd Gracias de todo corazón!!! Voy a darlo todo por mi gente de Toledo! https://t.co/TkuwyaaxhD Y mañana en Málaga también a darlo todo, sin dosificar!!! Os quiero!! https://t.co/1WLDGfdp9p Madre mía!!! Que vamos a hacer hoy!!! ??? Lo vamos a dar todo! https://t.co/ozpv3W48M3 Mallorca, a las 12:30h estaré en @CopeMallorca para hablar de mi concierto allí el próximo 19 de julio!! Qué ganas! https://t.co/zknG0tfOHl https://t.co/ghpwA53yoH Nos vemos compañero, tengo muchas ganas de cantar contigo. Nos vemos pronto. Saludos. https://t.co/FXYnwEHUYy Aquí trabajando con el jefe @ludovicovagnone https://t.co/SQwn0lYVTY https://t.co/t4uI1IDlJM Amig@s de Málaga, a las 12:45 h os contaré en @SER_Malaga muchas cosas de mi concierto el próximo sábado allí! https://t.co/nOfcg5RU2L https://t.co/SGI9v9DCTt @CalumHeaslip1 felicidades por tu éxito internacional!!! Por qué no te vienes a cantar a mi concierto de Palma de Mallorca el próximo 19? Ya nos estamos preparando para lo que queda de mes!!! Toledo, malaga, Mallorca, Londres y Madrid en el Teatro Real! https://t.co/4A3LpuQlmt https://t.co/aZVa8DF9YF Mi gente, aquí tenéis el capitulo de Tarragona y Alicante. Todavía llevo la adrenalina dentro. Os quiero mucho.\nhttps://t.co/a1fBdFoK0S https://t.co/3V4Au8qaGe Gracias a todos por acompañarnos en los conciertos de Tarragona y Alicante. Todo el equipo sigue en una nube de energía. Os queremos. https://t.co/FhDZvLPbuf Me encanta esta foto. Gracias por tomarla y subirla https://t.co/wNIfP9LVZY Hoy Alicante ha formado parte del show!! Gracias por contar conmigo https://t.co/oRNpNoz6df Como me gusta cantar con vosotros!! Gracias! https://t.co/xSb8o6YIKA Gracias por tu comentario amigo. El equipo ha sabido adaptar muy bien la música, las imágenes y las luces para darle vida al concierto. https://t.co/MrltBcIWg8 Muchísimas gracias amigos, he disfrutado de toda vuestra energía!! Os quiero!! https://t.co/7StzGMlp0Y Ayer en Tarragona y hoy estaré en la plaza de toros de Alicante!!! La semana que viene llegaremos a Toledo y a Málaga. Os quiero! https://t.co/dlE1gi0cge @gervasanchez me ha parecido muy interesante tu entrevista en la https://t.co/hAZBxQaRKl. conozco tu trabajo gracias a @61chema Exacto!!! Después del concierto de  eta noche en Alicante, nos vamos a Toledo!! Y después a Malaga!! https://t.co/8WVC876pZR Bilbao, el 7 de Octubre tenemos una cita que os quiero presentar en directo #HijosDelMarTour2017! https://t.co/bIiUUhUssv https://t.co/X22qsMrtBq Con muchas ganas de llegar y disfrutar esta noche. https://t.co/qTFQHh3PN9 Queda todo el verano por delante.\nTe mando un abrazo muy fuerte manuel https://t.co/2bw6wiaMza Sevilla, el 23 de septiembre estamos por allí con #HijosDelMarTour2017!! Cuento los días!! https://t.co/HtdOVtdOda https://t.co/H6n0guS0uk Nos vemos mañana cantando en Tarragona.\nMuchos besos. https://t.co/dyul32cgzw Grandísima noticia, gracias por compartirla, estoy deseando cantar esta canción en los conciertos de @mexico https://t.co/LpVLuHhXfr Buenos días, como veis están saliendo fechas para Latinoamérica y más que van a salir.\nMañana rueda de prensa en la Alhambra de Granada. https://t.co/QxkyBIfTHx Feliz. La canción con @TiniStoessel Todo es posible, ya ha superado el millón de reproducciones!! Gracias a vosotros https://t.co/2Hp2QQYqif https://t.co/StW1pJH9BV Un placer colaborar siempre con este tipo de causas. Os quiero. https://t.co/4rzGJt5VIe Amigos de Tenerife, qué bueno estar con vosotros con #HijosDelMarTour2017!! Nos vemos pronto! https://t.co/s9T4t8v1jl https://t.co/RWkR4AEPVJ Gracias por acompañarme durante todo este tiempo.\nOs quiero https://t.co/3pFRtUeXTd Grande!! Ya somos más de 9 millones de amigos en @Twitter @twitterEspana!! Gracias de corazón! https://t.co/F0wGjJwVEG Espero que hayáis pasado un buen fin de semana. https://t.co/IZXRhQADsu os quiero! Nos vemos en Granada, Tarragona y Alicante! https://t.co/TwDRMKMPCU Ja ja ja!! Me apunto!!!! Ya nos vemos en el próximo. Tarragona!! 7 julio a saltar!!! https://t.co/eQ5ApFZ5Qf Nos vemos en México!! Con muchas ganas de llegar!! https://t.co/ZwO7pqjroe Muchísimas gracias amigos de la fiera. Viva la música regional mexicana! https://t.co/QeHyWDE56W Os deseo de todo corazón todo lo mejor en este mes de julio! Buen fin de semana! Os quiero! https://t.co/2Hp2QQYqif https://t.co/X9s9qxUZhW Con muchas ganas de que se estrene la película. Gracias por los buenos comentarios #TadeoJones2 https://t.co/QJBbprYhoW Siempre un placer visitar Las Palmas y mucho más con #HijosDelMarTour2017!! El 15 de septiembre nos vemos! https://t.co/fMI3P2ZuTz https://t.co/kFh6vVgmXD RT @UniversalSpain: ¡¡Enhorabuena @davidbisbal &amp; @TiniStoessel!! #TodoEsPosible, el tema principal de #TadeoJones2, ya es Nº1 en Radio http… Ya está el videoclip de #TodoEsPosible, qué bueno trabajar con @TiniStoessel !  @Tadeo_Jones #TadeoJones2 \nhttps://t.co/Fkpp0zVDQ7 Ya puedes conseguir #TodoEsPosible que he cantado junto a @TiniStoessel!! Os gustará!! @TadeoJones #TadeoJones2\n https://t.co/hKrMPfBA9N https://t.co/3HHk7rwCcu .@CapRoigFestival, muchas ganas de estar por allí con #HijosDelMarTour2017!! https://t.co/mNcakoCZ31 https://t.co/yxpt5HdiRj Mañana estrenamos canción y video de #TodoEsPosible junto a mi querida @TiniStoessel para #TadeoJones2. Disfrutadla mucho!! https://t.co/AUITrsLIhA Amigos, hoy he visitado la @Alcazabaalmeria me ha encantado conocer un poquito más de cerca la historia de mi Almería! Os quiero! https://t.co/b1O5gXeyU5 https://t.co/NOPegvE38R os quiero!! Muchos besos! https://t.co/d26qN3QqLN Linares, nos vemos el próximo 27 de agosto con #HijosDelMarTour2017!! Os espero! https://t.co/38cj4DBQ2r https://t.co/IHfVfPcM9w Ya estamos preparando el próximo doblete que tenemos! Tarragona y Alicante! 7 y 8 de julio! https://t.co/4yOEpgZ9Jm Miles de niños que huyen de guerras y miseria se encuentran con muros de discriminación. #RompeElMuro con @unicef_es https://t.co/ydUaGsY043 https://t.co/tjHa7wmjTp Buenísima noticia!!!! Un beso para mí gente de México! https://t.co/LgdM9RgbL7 Córdoba siempre sabe como inspirarme.... Y la próxima parada de #HijosDelMarTour2017: Tarragona! \nhttps://t.co/ZBVDn4xSZH RT @AuditorioMx: Este año @davidbisbal regresa a nuestro escenario.  https://t.co/Gh153hsHNy Compadre! @AlejandroSanz ayer, acompañándote en el escenario, recordé que ya te quería desde antes de que tú me conocieras. #MasEsMas https://t.co/c7uENBxw2o Grande anoche Córdoba con #HijosDelMarTour2017!! Y esta noche más con @AlejandroSanz !! #MásEsMás https://t.co/D0EIJKWN6Y Cordoba!!! Te amo! https://t.co/28McKd0aV7 Que guay!! Ya las han encontradooooooo https://t.co/1M4FrRy1S3 Encuéntralas aquí!!!! Cordoba! https://t.co/cuVGaOVTPz @MonicaToled0 No lo puedo poner tan fácil!! He dado más pistas en más sitios!! 😂😂 Vamos! En busca del tesoro!! https://t.co/Mu0NDEr4Df Estamos llegando a coooooooordobaaaaaaa!!!! 😂😂😁 Amigos!!! Ya estamos llegando a Córdoba!!! Estáis listos!???\nUn beso fuerte! https://t.co/M6bPIhWliy Gracias por la espera, mañana trataré de dejarme el alma cantando. https://t.co/AN7Bmy3OLT https://t.co/evZxdAKIGY https://t.co/OhKMEVA2Am mañana llegamos a Córdoba!!! Con muchas ganas os quiero! https://t.co/7ULpHkQdjX https://t.co/eFaTHwrqUm Siempre es un verdadero placer hablar con los amigos de @CanalSurRadio nos vemos mañana en el concierto de Cordoba. https://t.co/0dInG4bxQl RT @abccordoba: Bisbal: «Quiero que el público salga tan agotado como yo, pero con una sonrisa de felicidad» https://t.co/3ppkmClrrm | @dav… Con ganas de que llegue mańana el concierto de Cordoba! https://t.co/NEH7kyvrrO @LoreDera @VEGAOFICIAL Por supuesto que lo sé! 😂😂😜 Cordoba!!! Nos vemos ya!!!! https://t.co/IovSw9548E y si escondemos unas entradas y jugamos!? Quieres venir? https://t.co/RcxQU1R0GX Un placer hablar con vosotros. https://t.co/4MOjcD85tm Gracias por poner estas bellas imàgenes de Almería. https://t.co/lwTPgxtbbE Un beso enorme!!! https://t.co/r1gZI47Tfl https://t.co/UbzN5bhm3D Intenso, muy intenso #HijosDelMarTour2017 en Barcelona, Zaragoza y Valladolid!! Seguimos el 23 de junio en Córdoba! https://t.co/r1gZI47Tfl RT @bisbalpress: Bisbalpress ha recuperado la normalidad. Buen momento para repasar las muchas noticias de @davidbisbal !! https://t.co/PVd… Exactamente, ya tenemos Mexico Df en el auditorio Nacional el 14 de noviembre y en Monterrey el próximo 9 de noviembre. https://t.co/5qcjzxS41W Mi gente de Portugal, quiero que sepáis que también estoy con vosotros en estos momentos tan duros! Os quiero mucho. https://t.co/2lXRSQMK5o Gracias por el cariño amigos https://t.co/GAr3eZGPrl Que fotón, muchísimas gracias! https://t.co/O5bivaD0cc Muchísimas gracias amigos de El Norte de Castilla, por esta crónica tan maravillosa. La verdad es que la gente fue la que me dio la energía. https://t.co/8v9VLin1ba Me encantan tus palabras Natalia. Muchísimas gracias. Vosotros formáis parte de mi vida https://t.co/nYo4j6U6ti Me he sentido en plena forma en el tercer concierto consecutivo que hemos tenido. Gracias Barcelona, Zaragoza y Arroyo de la encomienda. https://t.co/HGQeXERPuX Un besito para toda mi gente de la redes sociales!! https://t.co/C22kdlYMME https://t.co/eSu4GlHzsz Así se veía el Pabellón Principe Felipe de Zaragoza en el concierto de esta noche!!\nOs quiero! Os quiero conmigo en esta gira! https://t.co/r1pBTKHKbb Nos vemos mańana mi gente De Arroyo de la encomienda!!!\n18 de Junio Arroyo https://t.co/0VNDYdmelm os quiero mucho! Gracias por la espera! https://t.co/qiQunZrGst Ya estamos en Zaragoza!!! Qué bonito me habéis decorado el camerino!  Viva ese club de fans!! Os quiero! 2/3 https://t.co/hRsiMgAAJA RT @UniversalSpain: Asi brilló @davidbisbal ayer en Barcelona con #HijosDelMarTour2017 ! Hoy mas! https://t.co/ajRxEV8Nfo RT @agenda_db: 09/09 @davidbisbal #HijosDelMarTour en Villarrubia de los Ojos(#Ciudad Real),Auditorio Municipal,22:30hs. Entradas https://t… Barcelona!! Sin palabras! Guardaré este concierto en la memoria y en el corazón!\nOs quiero mucho!! https://t.co/jFfE5ASn1U Vamos que nos vamos! Os espero hoy en el @PalauSantJordi @24h_tve os quiero mucho a todos! Esta noche! https://t.co/Xt2bwOPVRP RT @PalauSantJordi: Avui, DAVID BISBAL, horaris:\n18h Front Stage \n19:30h Obertura General \n21:30h @davidbisbal https://t.co/Q6TbGXOStZ @emiliogq @PalauSantJordi @UniversalSpain Vamos emilio, hoy se te quita la fiebre vamos¡¡¡¡ muy feliz con este lleno también. Gracias de verdad. Seguimos trabajando. Con ganas de disfrutar este fin de semana. https://t.co/Lqc4XD0xDC mañana no te pierdas Cadena Ser / Los 40 / Cadena Dial Valladolid. Vicente Castro. @hoyporhoy#valladolid RT @PandoraProducc: Cita con @davidbisbal #HijosDelMarTour2017 en Arroyo de la Encomienda. \n¡No te quedes sin tu Entrada! https://t.co/jAj8… RT @TeamBisbalUy: Muy Feliz Cumpleaños @RosannaZanetti 🎂🎉 que tengas un hermoso día junto a @davidbisbal Te deseamos Todo lo Mejor! Un Abra… RT @rebe_90: ENTRADA A LA VENTA QUEREMOS #Llenazo😍👏 @davidbisbal en concierto mañana viernes en Barcelona 16/6 Palau Sant Jordi https://t.c… en un rato hablamos, muchos besos. db https://t.co/fOp3qCHZ7h @ShiranSiboni @sharonmalul Nos vemos mañana desde el concierto.\nbesos. aqui podéis encontrar las ultimas entradas para Barcelona @PalauSantJordi https://t.co/npDM905ChN Esa gente bonita de @LOS40Zgz aquí os estoy esperando, muchos besos. https://t.co/oiKtbWy0xf preciosa entrevista si señor, os quiero mucho amigos... https://t.co/PRsyq217Eq 17’30      @OndaCero_es – Julia en la Onda. Julia Otero. Directo. os quiero. Los 40 Zaragoza – Jose Luis García. Directo. Esta mista entrevista la pasarían luego por Cadena Ser y Cadena Dial Zaragoza el viernes. Hola amigos, estaré en directo aquí.\n 15’45   RNE (Radio 4)- Metrópoli Barcelona – Xavi Collado. Directo\n- RT @bisbalpress: Escuchando Ràdio 4 a la espera de la conexión con @davidbisbal https://t.co/I6PHTegHTv RT @TicketmasterES: ¡Últimas entradas! El próximo concierto de @davidbisbal será el viernes 16/06 en el @PalauSantJordi de Barcelona: https… El próximo fin de semana tenemos triplete de conciertos!!\nhttps://t.co/0lu1jTdUcB Barcelona, Zaragoza y Arroyo de la encomienda. Os quiero! https://t.co/NI6Jf4wm5D RT @bisbalpress: Si buscáis entradas para el concierto de @davidbisbal en BARCELONA el viernes 16, aquí están las mejores que quedan https:… Os dejo con el resumen de los conciertos de Valencia y Murcia, fin de semana inolvidable. https://t.co/52oBkkltwJ nos vemos en Barcelona... https://t.co/jRVbYqKIcB Valencia y Murcia, que grande fue visitaros con #HijosDelMarTour2017!! Podeis ver el vídeo completo aquí: https://t.co/NHRI67NkSo https://t.co/HMS1ueWpkK @ludovicovagnone #JordiPortaz @chaconmusic1 #DavidSimo @GabrielPeso_ @ovidio #ovidio mi familia. Un privilegio compartir escenario! https://t.co/TEJsCYDx1g Felicidades @_christiannodal compañero. Por 1 millón de reproducciones en menos de 24 horas!!! https://t.co/zjDUBFklp3  habéis escuchado ya probablemente!?? https://t.co/0fyQh4VbJP https://t.co/wQFwc7htc0 Valencia, gracias por arroparme en el segundo concierto de la gira.\nNos volveremos a ver!! Ya de camino a Murcia!! Os espero mańana! https://t.co/2FmgXo3N7E RT @SpotifyLatino: This week's Novedades Regional Mexicano features @_christiannodal's song \"Probablemente\" with @DavidBisbal. Hit play htt… https://t.co/0fyQh4VbJP habéis visto el videoclip con mi amigo @_christiannodal ? @Vevo #probablemente https://t.co/fdeoX4C2jm @ser_murcia en cinco minutos estaré con vosotros en directo!!!! Un beso RT @billboard: .@_christiannodal's new single &amp; music video \"Probablemente\" feat. @davidbisbal (exclusive premiere) https://t.co/wFzvBpKR9B… RT @billboardlatin: .@_ChristianNodal's new single &amp; music video 'Probablemente' feat. @DavidBisbal: Exclusive premiere https://t.co/gY2pKE… RT @bisbalpress: Aquí tenemos el Videoclip + un VIDEO Behind the Scenes https://t.co/04jrvTWQyw #Probablemente @davidbisbal #ChristianNodal Feliz de acompañar a @alejandrosanz el próximo 24 de Junio en la gran celebración que será #MásEsMás #SomosMás\nhttps://t.co/T2Jt1SVE3v https://t.co/tJ53TzuAVq Con muchísimas ganas de llegar al Palau!! https://t.co/qDkaQ2OZAj Muchísimas gracias a todos por el cariño. Este premio es de todos! Os quiero https://t.co/ciJLCDDkF5 https://t.co/zwQKZJEzXy. Muchísimas gracias a todos por las bonitas palabras que me habéis regalado en el día de mi cumpleaños. Os quiero! https://t.co/2wVyJO3J4s Muchísimas gracias a todos por vuestras felicitaciones en el día de mi cumpleaños 🎉 os quiero mucho!\nhttps://t.co/Ng8gcVUtdw así lo celebro. https://t.co/0cLzq5ZvQK https://t.co/HLCeIJv9FG Después del primer concierto, este fin de semana hemos disfrutado como no podía ser de otra forma, Del Mar 🌊 https://t.co/j4mxLuhkMm https://t.co/WjjZGGa9yv estoy leyendo todos vuestros comentarios y no tengo más que palabras de agradecimiento. Os quiero. https://t.co/aJnYMH1Wa9 https://t.co/Wh1ZOr8Fki empezamos!!!!! Os quiero! https://t.co/uWj9PK5hKm Gracias por estas sorpresas os quiero mucho!!!!\nPrimer concierto de la gira!!!\nAlmeria! https://t.co/iWdhETBZWC RT @DBSwitzerland: @davidbisbal desayunando en Almeria 😊😊 @cerveceria72 pronto nos vemos💙🇨🇭 https://t.co/3wsN4HFRtE Disfruta a tope el #FiebreChallenge!! https://t.co/lTiQRhmDfG https://t.co/FFwrkZjPBz #HijosDelMarTour2017 Falta 1 día!!!\nEntradas a la venta aquí: https://t.co/VlS251RSN0 https://t.co/Y7icmFhjfY Buenos días, hoy toca día de concentración justo un día antes del inicio de la gira!!\nNervios y ganas! https://t.co/dCtn0Xioum #HijosDelMarTour2017 Faltan 2 días.\nEntradas a la venta aquí: https://t.co/VlS251RSN0 https://t.co/FyxIbv8qDW RT @tve_tve: .@davidbisbal y @JoseMotatv, mano a mano en el próximo @ElAcabose_TVE ¡La que se puede liar! https://t.co/5HkfmyCk3t https://t… #HijosDelMarTour2017 Faltan 3 días.\nEntradas a la venta aquí: https://t.co/VlS251RSN0 https://t.co/rwr9l3rmds #HijosDelMarTour2017 Faltan 4 días.\nEntradas a la venta aquí: https://t.co/VlS251RSN0 https://t.co/4e5dWasB1l El 14 de julio #HijosDelMarTour2017 nos llevará a la preciosa Toledo, ¡seguimos! https://t.co/uHtWD6BHJW https://t.co/sS14kSKqxK RT @bisbalpress: VIDEO: Informativos Telecinco: Vuelve Tadeo Jones a la gran pantalla y… ¡con David Bisbal! https://t.co/5I8wZombHq #HijosDelMarTour2017 Faltan 5 días. https://t.co/dP0MDSQOhT Gran día de buceo con club de fans y @Los40_Spain, hay que repetir! Gracias a @Aqualung_Spain y @H2OPALAMOSDIVE!\nhttps://t.co/RUB3E8d8Yb #HijosDelMarTour2017 https://t.co/DY9B9QC1h5 RT @BisbalSTMexico: Estas son las fechas confirmadas hasta el momento de #HijosDelMarTour2017 de @davidbisbal Y sí!! 14/11/17 el @Auditorio… Cuando volvemos a bucear?\nEstoy deseando ver el vídeo buceando con el club de fans y los amigos de los 40! https://t.co/wtkeyIhCjc Me ha encantado trabajar con @TiniStoessel en este precioso tema #TodoEsPosible del peliculón #TadeoJones2! \nhttps://t.co/wFmljZ4wEm Todos nos convertimos en hijos Del Mar hoy!!! Os quiero!! 8 días para empezar la gira!! https://t.co/Yr4SHJgOxG Como disfruto cada vez que vengo a @El_Hormiguero, que grandes!! #BisbalEH https://t.co/emLxZpaNwv Empieza la cuenta atrás!! La gira ya está aquí! 👉🏼 https://t.co/2Bm7vvC7CG https://t.co/PRzSoX4Os6 RT @El_Hormiguero: Hoy viene a divertirse a El Hormiguero, a punto de empezar una intensa gira, uno de nuestros artistas más internacionale… RT @bisbalpress: VIDEO: Ya puedes volver a ver el FB Live con @davidbisbal de El Mundo https://t.co/Ry3Coqbk7U @titilago2 De verdad! Que impotencia! Y qué injusticia! Me solidarizo con los amigos y familiares de las víctimas del atentado en el Manchester arena. Empieza la cuenta atrás!!! Listo para la gira! Los encuentros con el club, Los kilómetros! El verano! El escenario! https://t.co/GgQpMFmi18 https://t.co/izfrwInVQy RT @UniversalSpain: ¡PREVENTA ACTIVA! Consigue tus entradas para #HijosDelMarTour de @davidbisbal en Toledo → https://t.co/xspFyYRgyi Miérc… @JuanraLucas @magomore estoy feliz porque mañana os veo amigos!! @Carol_db_ @AlejandroSanz Yo también recuerdo cuando escuché por primera vez y si fuera ella!! Me lo puso mi hermana Maria Del Mar! @lauralmeria @AlejandroSanz Me ha encantado mi #minidb ja ja ja @agenda_db @AlejandroSanz De lo que tengo ganas realmente es de salir de esta semana para concentrarme con mis compańeros de la banda!! Y si fuera ella de una manera tan especial!! Gracias Compadre @AlejandroSanz por hacer canciones tan mágicas. 😍 https://t.co/0FsrYNevSG https://t.co/jqxn37QDUV listo para viajar a Espańa. Ensayos generales, promoción, Almeria y todo listo para gira #hijosdelmartour2017 https://t.co/TD3FDxsMY1 Mira aquí nuestra aventura con el club en la Ciudad de México!👉🏼 https://t.co/0hFSjDD01I https://t.co/QoqRfhPHCw RT @antena3com: ¿Quieres ver a @DavidBisbal en directo en @El_Hormiguero? ¡Participa! https://t.co/PHGlXJBixr Vamos que nos vamos!!! Canta fiebre conmigo!!! https://t.co/aFsXx0aIUb https://t.co/qRTvVW0p3Q Os mando un abrazo!! Os comparto este vídeo interesante en la grabación del videoclip con el amigo #CristianNodal https://t.co/gPM9AqiKT9 https://t.co/Pv4xDYsaNP @JesusCalleja Estoy de acuerdo Jesús, acabemos con los atropellos! Yo también he vivido los peligros como ciclista. Muchas gracias mi gente de Valencia!!! Os quiero!!! https://t.co/Ux0tsIHTnF @Yoa_naiala Alucinando que se sepan esta canción. Un abrazo fuerte.😘 @RaulElBalillaOf Qué bien lo vamos a pasar tío. Raul \"El Balilla\" se viene el 10 de junio a cantar conmigo en el concierto de Murcia!!que arte!! https://t.co/7WcbpiTNjB https://t.co/JK4XIb9fcE Un saludo a todos desde los cabos, MEXICO 🇲🇽 https://t.co/PZxA7MCQRh RT @musicagran: Consigue las entradas de su #HijosDelMarTour en https://t.co/9EUmmJQT1r corre empieza el 2 de Junio en Almeria @davidbisbal… Esperanza, qué ilusión que me hace que actuemos juntos el 23 de junio en Córdoba!! #HijosDelMarTour2017 \nhttps://t.co/7ULpHkQdjX https://t.co/iR5lRXK6A0 El mes de mayo esta cargado de días de las madres en diferentes países del mundo! Y me encanta! Os quiero. https://t.co/Z6aaQfREZD @antoniorozco 😂😂😂😂cuañao, mira este vídeo!! Ja ja ja perdón por la llave!!https://t.co/oPpMJLHmNa"}