{"tweets": "So Trump is going to Game 5 today of the World Series? And he'll be the first president since Taft who hasn't thrown out a first pitch...hmm, what could Trump possibly have in common with Taft that would make each man reluctant to attempt this simple athletic feat? What...what..? Trump says he'll go to The World Series. He doesn't really like baseball, but he'll go anywhere where there's a chance a Latino might run into a wall. #WorldSeries #Game5 #MadKing https://t.co/RXbnKNEqkg Winning this election should be easy for @TheDemocrats. Just be less crazy than Donald Trump. Are you guys seriously struggling with this? https://t.co/M8VxRT2s6E RT @RealTimers: \"This onus we put on social media and 'being connected' is false.\" Watch @galifianakisz and @billmaher discuss the #CancelC… RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @ChrisCuomo, @ElissaSlotkin, @DonnyDeutsch, @HardcoreHistory + @galifianakisz on #R… Let's see, extorting a foreign leader to get dirt for an American election, launching a payback investigation agst the FBI, assisting in ethnic cleansing, calling ppl who have a different opinion \"human scum\" - you know who I'm starting to feel sorry for? Infrastructure Week. How could it not have come to pass that he would have actual blood and bodies on his hands? Ukrainians, Kurds, the people who escaped Isis members will kill. The United States a party to ethnic cleansing. Wow. RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @ChrisCuomo @ElissaSlotkin @DonnyDeutsch @HardcoreHistory + @galifianakisz on #RealTim… RT @RealTimers: \"I know we are profoundly less secure as a result of what [Snowden] did. We’re trying to recover, but that recovery is goin… Putting the G7 at Doral was Trump's idea. And once Trump gets an idea in his head, it never goes away, unlike his casinos, his wives, his hair and the Kurds. #EmolumentsClause #SideHustle #IfObamaDidIt https://t.co/nOHUrOwXZ6 It seems @realDonaldTrump was accidentally watching Real Time again tonight. Hope he saw this offer to him at the end. #Prickstarter #TakeTheMoney https://t.co/wUHlnei1Oe RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @AmbassadorRice, @dpletka,  @thomaschattwill, @samstein + @neiltyson on #RealTime @… So Pence's \"Cease fire\", i e, stopping to reload, seems to be only for one side, the Kurds. As Mike always says to his wife, \"How come nobody takes me seriously, Mother?\" RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @AmbassadorRice @neiltyson @samstein @dpletka + @thomaschattwill on #RealTime @HBO! As… RT @RealTimers: \"I think my relationship with my wife now is a lot more even-keeled, because I’m not sitting there trying to save her. I me… I'm not saying Ukraine/Impeachment isn't a big story, it is, and I hope they get him with it, but on cable news, is there ANYTHING else? I picture on MSNBC reporter on the last ice floe as we descend into Waterworld, \"And a subpoena today went out to...glug glug glug...\" RT @amyklobuchar: People say I need a viral moment to win this thing. So I thought I’d go on @BillMaher the same night as @HowardStern. Her… RT @RealTimers: .@HowardStern braved the trip out to Los Angeles and we're all very excited about it. Watch him join @BillMaher on #RealTim… Trump badmouthed Jay-Z during his rally. And Jay-Z said, \"You know, I got 99 problems, and a #WhinyLittleBitch is one.\" https://t.co/8niqQWM77B Trump represents many of the ills our country has been living with for a long time, but perhaps none more than that America is now #SCAMerica. https://t.co/4OapEUxkBY RT @RealTimers: Whoa, whoa, whoa, #StartTheClock! @BillMaher is LIVE with @HowardStern @Shawna @bdomenech @jheil + @AmyKlobuchar on #RealTi… RT @RealTimers: Three weeks ago, @BillMaher tried to save everyone some time and emotional investment in Trump's Ukraine scandal. For those… RT @TheMirageLV: Grab a drink and get some \"Real Time\" with @billmaher this weekend as he takes the Aces of Comedy stage. 🎟️ https://t.co/4… Wait now, he said what? The Kurds didn't help us in WWII and we're bitter about it? Uh, yeah. And you know who else didn't reciprocate like they should? Viet Nam. When they had a civil war, we went, but did they send anybody to OUR civil war? Case rested. RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @HowardStern @AmyKlobuchar @Shawna @bdomenech + @jheil on #RealTime @HBO! https://t.co… If Trump says that phone call was \"perfect\" one more time I'm going to blow my brains out. And btw it was \"perfect\" to him because the Ukrainian dude was kissing his ass the whole time! That guy is about one rim job away from a job on FOX. If Al Franken had to go because Dems had to be totally clean on MeToo stuff in comparison with Trump/Rep.s, should Biden withdraw so Dems are totally clean on Ukraine swampiness? Its not a fair comparison, but neither was Franken. Asking for a friend. Every time I hear Trump on a tape of a phone call I picture him slicing garlic at the time. Trump has treason on his computer like most men have porn. #TrumpServer  #AmericasTraitor #RussianRudy https://t.co/7bZCjVyG9V White liberals have to start listening to me when I tell them; you can’t be more offended than the victim. There is a weird self-loathing going on, and it’s not helping anyone. #WhiteShame #HonkyTax https://t.co/tUI7aPCanF RT @RealTimers: #StartTheClock: @BillMaher is LIVE with  @SalmanRushdie, @BarneyFrank, @NoahCRothman, @lopezlinette + @GinaEPA on #RealTime… Trump is saying the whistleblower is \"close to a spy\" (yeah, him), and that 'in the old days spies were dealt with differently.' Yeah, they were outed by Dick Cheney. I hope like hell this Ukraine thing is what brings Trump down, but I gotta say, re Hunter Biden: politicians need to tell their fucking kids to get a fucking job. A real job. Not a \"consulting\" job cuz your somebody's kid. It looks swampy. RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @SalmanRushdie @GinaEPA @BarneyFrank @NoahCRothman + @lopezlinette on #RealTime @HBO!… RT @AsraNomani: Not to miss @SarahTheHaider on @billmaher @RealTimers. Sarah, you articulated complex ideas like our right to live free of… RT @RealTimers: Sometimes you don't know it for a fact...you just know it's true. https://t.co/F7subRsoEo Off to Texas for show tonight in Sugarland at the Smart Financial Center. I love Texas - I know its wrong, I just do... It’s not enough that Trump has Russia meddling in the election – now we’ve invited Ukraine in for a three-way. #UrgentConcern #UkraineIfYoureListening https://t.co/wDBZiJZEuD Republicans love to throw out the term #TrumpDerangementSyndrome (#TDS) to deflect any criticism from the Dear Leader. You know when Republicans say Democrats never got over Trump's behavior, you're right. We haven't gotten over it, because no one should. https://t.co/WxSDaFf5Nr RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @SamanthaJPower, @hmcghee,  @TimNaftali,  @sullydish + @SarahTheHaider on #RealTime… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @SamanthaJPower @hmcghee @TimNaftali @sullydish + @SarahTheHaider on #RealTime @HBO! A… RT @RealTimers: If you think having Trump in the White House is bad now, just wait 'til the kids are in charge... https://t.co/E1hypfjH05 Should #TheSquad be the face of the Democratic Party? w/@MMFlint https://t.co/M2EOyX0moI All eyes during the debate were on the big three center stage, Biden, Warren, and Bernie or as they are known to their hips. Snap, Crackle, and Pop. https://t.co/sNbXaduElA When did America decide to redesign its entire economy based on everyone rating everyone else? People's jobs shouldn't depend on some rando judging them.  #RatingCulture https://t.co/ypwV1kP9LS RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @MMFlint, @krystalball, @MichaelSteele, @AmandiOnAir + @bariweiss on #RealTime @HBO… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @MMFlint @krystalball @MichaelSteele @AmandiOnAir + @bariweiss on #RealTime @HBO! Ask… RT @RealTimers: \"I thought @realDonaldTrump was 90% popular in the Republican Party – they can't even have a primary challenger who's gonna… Great weekend in Las Vegas, crowd at @TheMirageLV last night was fantastic, thank you, went to my fav pot store in America (yes, I’ve been to them all) today, Jardin, and another show tonight at 10, can’t wait! At next Thursday’s debate, one of the candidates has to say, “The problem with our health care system is Americans eat shit, and too much of it.” #DemDebate3 https://t.co/QUm3ipIinZ I’m so glad football is back.  Finally some brain damage we can actually enjoy. https://t.co/hpMXuMZZTH RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @CHSommers @JohnDelaney @MariaTeresa1 @MattWelch + @WalshFreedom on #RealTime @HBO!… RT @TheMirageLV: Get some \"Real Time\" with @billmaher as he takes the Aces of Comedy stage this weekend! Get your tix: https://t.co/8wi7nZ8… RT @RealTimers: FRIDAY: @BillMaher is back with @WalshFreedom @CHSommers @JohnDelaney @MariaTeresa1 + @MattWelch on #RealTime @HBO! https:/… Is this a bad sign - Trump's new chief of staff is Britney Spears' dad? Labor Day has now turned into a day where the half that's doing OK has off and goes out to dinner and such, and the other half, for whom the holiday was intended, labors, because they can't turn down the money. That's America now, and the high cost of low living. Good to read how farmers are finally fed up with the \"trade war\" - finally getting it that every Trump deal ends in a schoolyard beating with Trump in tears and a carrot up his ass. Except now he's losing OUR lunch money. RT @RealTimers: \"I knew at the time that I did it – and I'm not proud to say this – that it was wrong...but we did it because we were in th… Yesterday David Koch, who funded climate-science deniers for decades died of prostate cancer. Mourners have been asked that in lieu of flowers to just leave their car engines running. https://t.co/YvBrDf6Pui My pledge @realDonaldTrump is that if you become a pit bull for planet Earth, you won't need Russia to hack my polling place. I will vote for you. I will take my paper ballot and put my prick next to your face. #TrumpSavesEarth! #GOAT https://t.co/9iN7EqXNow RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @RepKatiePorter, @HeidiHeitkamp, @smerconish, @EricKlinenberg + #KevinWilliamson on… Hey I got my number of rep.s who voted to condemn BDS wrong - it’s actually even more, not 318, it’s 398 Some people have one move only: boycott. Cancel. Make-go-away. But here’s the thing, the house voted 318 to 17 to condemn the #BDS movement, including 93% of Dems. Does Tlaib want to boycott 93% of her own party? https://t.co/0QrPQmwwiw RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @RepKatiePorter @HeidiHeitkamp @smerconish @EricKlinenberg + Kevin Williamson on #Real… \"Jay-Z's play, I believe, not only gives us a seat at the table, young people, young black America - it doesn't destroy what Kap kneeled for.\" – \n@KillerMike: @S_C_ #Kaepernick #JayzNFL https://t.co/Duk7FlBSGx Trump, the financial genius, is driving the economy over the cliff.\nDid you see what happened in the stock market this week? I spent more time gasping for breath than Jeffrey Epstein. https://t.co/nWa6ZXvC96 Armed and lonely. It's not a good combination. America has a loneliness crisis. 22 percent of millennials say they don't have any friends. 25 percent say they don't even have an acquaintance. #8chan #Qanon #MAGA #WWG1WGA https://t.co/wkissn64f6 RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @SenWhitehouse, @hillhulse, @woodruffbets, @TheRickWilson + @KillerMike on #RealTim… RT @argusleader: \"I'm actually always excited to go to places they don't expect me to go.\" Bill Maher is coming to the @washpav this weeken… Not that I'm really convinced Epstein was a suicide, but isn't it time to take the shame out of killing yourself, especially if you were loathsome to begin with? If Epstein makes more scumbags look into it, it'll be the best thing that happened this month. RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @SenWhitehouse @KillerMike @hillhulse @woodruffbets + @TheRickWilson on #RealTime @HBO… RT @RealTimers: \"I'm just saying, we need to get used to the fact that, if @JoeBiden is the nominee, there's going to be some senior moment… OK, sure, let's get right on that - but one other thing Mr. President, as long as we're talking: if you were to do a total 180 on the environment and become the most dogged fighter we've ever had agst climate change, pollution, killing species, etc...I'd vote for you. https://t.co/4iG6E4hZ3H 95%? That is a lot! I better keep working! Speaking of which, if you tweet about me again, would you be a lamb and mention I'm @TheMirageLV on Sept. 6 and 7? You're the best! https://t.co/vsletTqYMx I'm curious, how do you see a TV show \"by accident\"? https://t.co/n5azf6VgFk This is the new trick in Democratic politics, dig up something your opponent said decades ago that looks bad by today's standards and pretend that's mic-drop evidence of your awesome moral superiority. #ESPCP #WokeAF https://t.co/3E67MMgMMS Tucker Carlson of @FoxNews says white nationalism is a hoax. You got to love Republicans: global warming is a hoax, Russia, that was a hoax, white nationalism is a hoax. Hillary Clinton running a pedophile ring out of a pizza parlor? Completely true.  #OrangeJello https://t.co/PSETl5Aezk RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @TerryMcAuliffe, @RadioFreeTom, @crampell, @Scaramucci + @RichardEngel on #RealTime… Amazing to think a president of the United States cld visit a hospital in El Paso and none of the 8 patients wanted to meet him. All were asked. All said “el paso” RT @RealTimers: \"You are traitors and you are un-American.\" Watch @BillMaher call out @senatemajldr #MoscowMitch McConnell and the Republic… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @TerryMcAuliffe @RichardEngel @RadioFreeTom @crampell + @Scaramucci on #RealTime @HBO!… NYC! I’ll be playing the @NYComedyFest on Nov 9th.\nPresale Aug. 7th-11th! Use promo code #CNYCF: https://t.co/Yh82ge5upe #MAKENYLAUGH https://t.co/bEVmAC6Bec Good news, Trump left Washington, DC for the weekend. See, he can reduce crime in a black city. https://t.co/YXDQdmtmaq All the Democrats have to do to win is to come off less crazy than Trump, and of course, they’re blowing it. https://t.co/k4Io3Ig73C RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @RepJeffries, @JenGranholm, @jbarro,  @BuckSexton + @marwilliamson on #RealTime @HB… What? It’s an hour before the show? And it’s live? You mean my vacation is over? Oh well, duty calls...missed u too. RT @RealTimers: FRIDAY: @BillMaher is back with @RepJeffries @marwilliamson @JenGranholm @jbarro + @BuckSexton on #RealTime @HBO! Ask a que… I thought Yang had the best closing statement. And I love watching them when the debate is over pretending they don't hate the person who attacked them. Joe’s thinkin, “I know 2 women who I wish weren’t working outside the home...” OK, we're watching over here and someone suggested taking a drink every time a candidate said \"this is personal\", and I just gotta say zzzzzzzz What a victory that segment was! For the people who'll be making Trump's campaign ads next year. For a party who’s biggest star, savior and hero is Obama they sure were quick to dump Obamacare CNN knows were its bread is buttered: get Biden and Kamala fighting! Two observations: This is going on too long. And Joe Biden is having his best performance! Nobody's spoken Spanish yet! What kind of Democratic debate is this?! I can't watch this anymore. Go home, guys. You made O J try on the glove, and it just didn't work. You can still win the election, but I wouldn't bet my own  money on it. If this Mueller testimony was supposed to be “the movie”, it’s a Terrence Malick movie. Democrats are a political party that does not know how to do politics. Trump last night:\"I saw one of these so-called comedians...he's a pretty respected comedian, he said 'he's not leaving!' Yes, I have been saying that. Later he said he WOULD leave! So I got him to produce his birth certificate (2013 lawsuit), and now this! Way better than an emmy Given that the news this week is all about the fight that Trump is picking with #TheSquad, I thought this editorial from January 2018 was apropos for another viewing. https://t.co/nOAqeg6nsX Wait, Trump's approval is at an all time high? Jeez its good I have this month off, I need time off to recharge my batteries. In my vaporizer. Who knew ten years ago getting high would require a USB port? RT @RealTimers: We're off until August 2nd, but @BillMaher has you covered with all the news that's yet to break: https://t.co/RYn7yREztR Happy 4th! Sad we have to watch Repubs trying to put a citizenship ? on census, cuz they figure non-citizens won't answer it, and there's more of them in blue states which will lose house seats..I know its complicated but its either that or come up with policies that help people 'the president's remarks on the 4th will be apolitical' they say. Let me guess: No collusion, no obstruction, Sleepy Joe, fake news, witch hunt, nobody thought I could get to 270, lock her up...and, oh yeah, happy birthday America. ...you \"joke\" about being President for Life...a major news station becomes State TV...you lie so freely your supporters don't know the truth and don't expect it...you use your office for personal financial gain... yes, it can happen here. Tanks in the streets now? Shall we review the Dictator Checklist? You're a narcissist who likes to put his name on buildings...you appoint family members to key govt positions..your rallies are scary...you threaten to lock up political opponents..your friends are other dictators RT @RealTimers: It's time for some of these candidates to GTFO. Watch @BillMaher cull the Democratic herd with @MaxBrooksAuthor, @JoyAnnRei… I watched two nights of debates and I finally know America’s biggest problem. Overcrowding. @FoxNews is calling it #CommieCon. #DemDebates https://t.co/dlA4sSDylH You want to find water on Mars? How about first we find water in Flint, Michigan. #TheMarsGeneration #SaveEarthFirst https://t.co/gP4RS3yxrH RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @TulsiGabbard, @JoyAnnReid, @maxbrooksauthor, @adamgopnik + @SethMacFarlane on #Rea… Encouraging them to play this game of chicken with Which interrupter will give up their crosstalk first is just gross. It wld have been easy to set it up better. But they wanted Thunderdome. Ew. Yes Williamson!!!!! That’s what I’ve been saying for years about health!! So gratifying it made it to one of those Monsanto-bought line-ups If you don’t have a dead relative, don’t even THINK about getting in this healthcare debate RT @SethMacFarlane: I truly wish they would get rid of the damn audience at these debates. If you add up all the seconds during which we gr… Did Swalwell just draw a generational difference btwn him and Pete? Cuz its 2 years Google Michael Bennett and this dude isn’t even in the first five Michael Bennetts to come up! Just sayin Ready for part 2 tonight? I understand it’s the same format except Biden and Bernie will be sitting on a park bench feeding pigeons. Since there's so many candidates, its a shame there's not the technology to put two or three of them in a, um, transfunctioner, and make one really great candidate. Delaney's answers coming out of Beto's face, for example. Not a promising start. Nobody came close to answering the first question, a good one: With 70% saying they like the economy, shld we make radical changes to it? Only interchangable chunks from the stump speeches. You're going to have to answer that at some point, guess not tonite Its so hard to take seriously any political event that is prefaced with a countdown clock. I'm rooting for Sanjaya. RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @TulsiGabbard @JoyAnnReid @maxbrooksauthor @adamgopnik + @SethMacFarlane on #RealTime… “Republicans govern without shame, Democrats shame without governing” - quoting myself, but this week made me think of it. Hey, @realDonaldTrump \"Cocked &amp; Loaded\" isn't a phrase it's \"Locked &amp; Loaded.\" But it is a gay porn movie, and the tagline is #GangBangDaddyFuck, which is a pretty good summary of the last 2 1/2 years. #RT500 https://t.co/5BexaBzSxP At this particular moment in history, in this particular election year, @Oprah would be the only candidate who is a sure-thing winner for the Democrats. https://t.co/YM8dsFaKPd RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @AllanLichtman, @fakedansavage, @Thom_Hartmann, @LizMair + @DrDebraSoh on #RealTime… This Iran confrontation must be frustrating for Trump. That drone was unmanned, so there was no widow to insult. RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @AllanLichtman, @fakedansavage, @Thom_Hartmann, @LizMair + @DrDebraSoh on #RealTime @H… RT @RealTimers: Good morning, no collusion! https://t.co/HfTx6SNbUP Trump has been screaming 'no collusion' every fucking second he can for the past two years. Went on the @GStephanopoulos show and said, you know what? Fuck it, collusion.  #FuckItCollude https://t.co/XFLwMnFvsu You know you're a president who has let the place go when your wife has had more work done than the roads and the bridges. https://t.co/p3TVRZ6GLm RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @GeorgeWill, @BariWeiss, @EliotSpitzer, @SykesCharlie + #MartinShort on #RealTime @… Trump: \"If someone called from Norway and said 'we have information on your opponent' I think I'd want to hear it.\" Who in Norway would want to help Trump? Anders Brevik? RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @RevRobSchenck1 @EliotSpitzer @BariWeiss #MartinShort and @GeorgeWill on #RealTime @HB… RT @sternshow: At this point in his life, @billmaher says he's not concerned about the money. “You cannot buy me. Time is so much more impo… RT @CuomoPrimeTime: \"At this point... I think you kind of have to.\" \nIt's time for Democrats to impeach President Trump, \"Real Time\" host @… RT @CuomoPrimeTime: \"If he loses... he won't go. I've been saying that since before he got elected.\"\n\n\"Real Time\" host Bill Maher warns @Ch… Hope @HowardStern and I gave you a good show yesterday. And if we did...beginner’s luck! https://t.co/40LVS9G8N9 RT @RealTimers: Watch @AndrewYang explain how his plan for a universal basic income could \"actually expand what we think of as work.\" #Free… RT @CuomoPrimeTime: It \"looks silly.\" \n\"Real Time\" host Bill Maher tells @ChrisCuomo that the Democratic 2020 field has too many candidates… RT @ChrisCuomo: .@billmaher joins me tonight on @CuomoPrimeTime - it's an interview you won't want to miss! #LetsGetAfterIt https://t.co/q6… RT @sternshow: Despite Donald Trump’s presidency providing @RealTimers with a wealth of content for the show, @billmaher doesn't want to se… Tonight! @CuomoPrimeTime with @ChrisCuomo @CNN https://t.co/XXufAxKcyw It's terrible that on a day honoring America's best we sent America's worst. #DDay75thAnniversary #PowderedClown https://t.co/VKZrpOL324 My commencement address for the Class of 2019! #Classof2019 #GenZ https://t.co/O3AwvX261u RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @AndrewYang, @RepKatiePorter, @CharlesMBlow, #ClintWatts @selectedwisdom + @BretEas… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @AndrewYang @KatiePorterOC @CharlesMBlow #ClintWatts (@SelectedWisdom) + @BretEastonEl… Let us not forget what today is: a time to remember how the armies of the free world came together to fight a common enemy. Bette Midler. Now that 26 horses have died at Santa Anita racetrack and 428 men are suing the Boy Scouts over sexual abuse, can we throw those two institutions in the same dumpster we threw the circus? Thank you RT @RealTimers: \"If you go home with someone and they don't have books, don't f**k them.\" Watch #JohnWaters share more of his \"tarnished wi… Now #Hillary has a Hollywood production company? If its anything like her hard drive, she should crush it. Congrats, you finally found a calling lower than running a pedophile ring out of a pizza parlor. Mueller said: \"If we had confidence that the president clearly did not commit a crime, we would have said so.\" So is Trump a criminal? Why say it that way. What was his wedding like? Do you Robert take this woman. I don't not take her. #MuellerSpeaks https://t.co/j18wbNOtpb I want all Democrats to memorize these two words: Message Discipline. Republicans win for two reasons: teamwork and cheating. And they're really good at both. #DNC #2020Election https://t.co/YyccV6YzQR RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @GovBillWeld, @jonathanvswan, #LawrenceWilkerson, @KirstenPowers + #JohnWaters on #… I think Real Time had it right a month ago when our new rule was \"Just because you have a stone face doesn't mean you belong on Mt Rushmore\". Mueller as the Mona Lisa of Justice...the Virgin Mary in a taco..Lady Gaga with her hair in front of her face...is getting really old. RT @RealTimers: FRIDAY: @BillMaher is back with @GovBillWeld @jonathanvswan @KirstenPowers #LawrenceWilkerson + #JohnWaters on #RealTime @H… I brought them luck today! Down to the last out! Go ⁦@Mets⁩ https://t.co/2sFmFCDKjt Sorry, I've taken a few days break from the news: Are we having a war with Iran or not? And when will John Bolton tell Trump? I'm suspicious this is media driven, cuz nothing drives ratings like wars and royal babies and, well, we just had a royal baby. Can we take a break for a day from talking about abortion? Jeez. Right now, the only tiny heartbeat I care about is Ruth Bader Ginsberg's. I can't believe how quickly the right to have an abortion has been fast tracked in Alabama, Georgia, Louisiana, etc - of all the states to not \"mullet\" over... There is a creepy substrain of Catholic conservatives who think limited government means government should put a limit on people's sex lives. #MoralityPolice https://t.co/ZQtMDcKg7x Red states are in a contest with each other to see who can be more hardcore on abortion. Georgia made it illegal after six weeks, Alabama at conception. Mississippi now is thinking about making it illegal when you swipe right on Tinder. #AbortionIsAWomansRight https://t.co/5jnwlJWg97 .@TheDemocrats unite! Stop calling it the #TrumpTariffs and call it what it is - #TRUMPTAX! https://t.co/Aenz3jTGF9 RT @RealTimers: #StartTheClock: @BillMaher is LIVE with #FranLebowitz, #GeorgePacker, @neeratanden, @jkirchick + @JonathanMetzl on #RealTim… Thanks to everyone who helped make #Brokahontas go Number One viral last week - its always great to have a Number One record! And check out the B side, #PresidentEbolaMonkey ! RT @RealTimers: FRIDAY: @BillMaher will be LIVE with #FranLebowtiz @NeeraTanden #GeorgePacker @JKirchick + @JonathanMetzl on #RealTime @HBO… RT @RealTimers: \"Democrats, either do something or stop talking about it.\" – @BillMaher #RealTime https://t.co/7h8L9CPpPJ Trump sold himself to this country as a business genius. Turns out he's a reverse billionaire. Elizabeth Warren should start calling him #Brokeahontas. https://t.co/sCRNx8rkMZ Melania, the world needs you. President Hellboy has proved to be impervious to facts, reason, shame and the law. But maybe if you left him for another man especially if that man was Mexican. Maybe he would implode on his own. https://t.co/OaiWgbxoQc RT @RealTimers: #StartTheClock: @BillMaher is LIVE with #MichaelLewis, @TimRyan, @VanJones68, @nayyeroar &amp; @mattklewis on #RealTime @HBO! h… Who says Trump doesn’t stand up to dictators,we seized a N Korean ship carrying coal! They still have nukes, but we’re safe if they launch a train. (Also, I promise, no ASMR tonight...) RT @RealTimers: FRIDAY: @BillMaher will be LIVE with #AgainstTheRulesPod host #MichaelLewis, Ohio Rep. @TimRyan,  @VanJones68, @nayyeroar &amp;… RT @RealTimers: #NewRule: The Democrats have to turn Lindsey Graham reading an email from former FBI agent Peter Strzok into a political ad… I see Nancy Pelosi (joining Michael Cohen a few months ago)is now on my page about the danger of Trump not leaving even if he loses. You’re welcome, America. Democrats don’t seem to get it. ‘It’s in the rules,’ is not an argument that works on Donald Trump. You’re playing Monopoly with a Hyena. #MuellerReport #Putin https://t.co/aT33tk0BER The Mueller Report that was our shot. It fell to one man to stop the madness. And when he didn't. I've got to tell you it broke me a little bit. I am, for the first time in my life using marijuana for legitimate medical reasons. #ASMR https://t.co/IOysRi4oXt RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @JayInslee, @KaraSwisher, @BretStephensNYT, @Bakari_Sellers + #Moby @thelittleidiot… I guess it would be going too far to say that the lesson of this whole sordid mess is, There's no such thing as a \"good Republican\", but...yes, too far. Slightly too far. Like, not so far you'd want to go all the way to the next street to turn around, just do a quick U-ey. RT @RealTimers: Watch #BobCostas react to the right wing's embrace of Vladimir Putin on #RTOvertime: https://t.co/OBa6NZEu2Z RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @JayInslee @KaraSwisher @BretStephensNYT @Bakari_Sellers + #Moby (@TheLittleIdiot) on… Trump already has a nickname for @JoeBiden, #SleepyJoe. He's attacking him for being old and unfit? Donald Trump, a man who is built like a melting porta-potty. https://t.co/BKTWnF0O43 All Mueller had to do is what people in the justice system do every day. Use the law to come to justice. Not be so restricted by technicalities that the bad guys win. #MuellerReport https://t.co/ZDT4cA27Zw RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @AdamSchiff, @GroverNorquist, @ZerlinaMaxwell, @JohnAvlon + #BobCostas on #RealTime… We’re officially fucked: I just saw a hipster wearing a “It’s Mueller Time” t shirt ironically. So glad to be back tonight...lot to vent🤮 So tired of hearing about Mueller's \"trail of breadcrumbs\". And of everyone still being so deferential to him - will get into this \"bigly\" tomorrow night when Real Time returns. Leaving it up to congress - that's what I call a #FecklessPunt RT @RealTimers: FRIDAY: @BillMaher is back with @AdamSchiff @GroverNorquist @ZerlinaMaxwell @JohnAvlon + Bob Costas on #RealTime @HBO! Send… RT @larrycharlesism: Hey everybody. Rather than waste your time watching meaningless religious pageantry and propaganda this Easter weekend… Happy 420 everybody!!! And remember kids, you do not need drugs to have a good time. But why take chances? Its killin me not to not be on tonight, sorry about the bad timing. And I must say, Trump was right about one thing: I'm tired of him winning. In The Godfather version of the Mueller saga, Michael Cohen is Frankie Pantangeles - Tom Hagen (consigliere Barr) comes to him in prison and says \"When a plot against the emperor failed...\" Cut to the bloody bathtub. And so the #SlowMovingCoup rolls on, greased by Republican stonewalling. Just from what I've heard today, highly damning is this report. Republicans say its \"nothing more than a fact-finding expedition.\" All I'm hearing all day is redacting, redacting, redacting. We'll see, but I'm not feeling good about this. #BlackLinesMatter RT @RealTimers: If there's one thing we know, it's that @realDonaldTrump is obsessed with leaks. Watch @BillMaher and @SethAbramson discuss… I’m literally sitting poolside at @TheMirageLV (show tonight at 10!) finishing my tax return. I just hope some of mine goes to protecting Eric Trump on a business trip. Republicans are obsessed with @AOC. Which is ironic since she's against fossil fuel yet she gives fossils fuel. https://t.co/mOqMNpEscV Coachella lasts two weekends. Just like a cabinet member that works for Trump. https://t.co/XTVZ0WGQHW RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @SethAbramson, @wendyrsherman, @MattWelch, @cornellbelcher + @rayadverb on #RealTim… Took my ginseng today! Real Time live at 7 (West coast time), then out to @TheMirageLV for a show at 10 tonight (and tomorrow). I'll sleep when I'm dead. Which, if the news about the temperature in Alaska last month is true, could be very soon! Happy Friday! RT @TheMirageLV: Get some \"Real Time\" with @billmaher as he takes the Aces of Comedy stage this weekend! Get your tix: https://t.co/TmifYJi… If you don't know how to feel about the arrest of #JulianAssange here's the rule in Trumpworld: Hiding in an embassy? Bad if you have secrets. Chopping someone up in an embassy? Good if you have oil. RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @SethAbramson @WendyRSherman @CornellBelcher @MattWelch + @rayadverb on #RealTime @HBO… #WilliamBarr testimony today, wow - no shame in his game. \"I cannot comment on an ongoing obfuscation\" - is that really a thing? That thing Jefferson said about trembling for his country when he recalls god is just? I don’t even believe in god and I’ll make an exception for #KirstjenNielson. Don’t let the cage door hit you in the ass. #NewRule Trump's 'beautiful clean coal' vs. Bernie's Wind Turbines @AWEA/@Realtimers https://t.co/dBbqm6b18J The first person who brought this up said #JoeBiden made her feel gross and uneasy. Do you know what makes me feel gross and uneasy? A second Trump term. https://t.co/gC6dKuIrVW New Rule: If @HBO has to put up a warning label before my show, cable news has to do it before Trump comes on.  #PresidentialTownHall #BDE https://t.co/DWPImkqTWQ RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @JulianCastro, @SalmanRushdie, @dpletka, #GideonRose + @chelseahandler on #RealTime… All these reports and videos of #JoeBiden constantly touching people, rubbing on them, hugging - is it possible he's just on molly? RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @JulianCastro @ChelseaHandler @SalmanRushdie @DPletka + Gideon Rose on #RealTime @HBO!… \"I'm automatically attracted to humans, I just start consoling them, its like a magnet, I don't even wait - and when you're a politician they let you do it, you can do anything, kiss the back of their head\" - Joe Biden on the bus RT @The_Gambit: Trump. Weed. Islam.\n\nThe always-outspoken @billmaher talks current affairs before his April 6 show at @SaengerNOLA.\n\nhttps:… RT @RealTimers: \"I don't know what Trump is, but you're the opposite of that.\" Watch @BillMaher sit down with Mayor @PeteButtigieg on last… Does pure unbridled capitalism work? I guess that depends whether you're on the board of Boeing or onboard a Boeing. #CapitalismPlus https://t.co/sAUbD3O7Nd Trump lied his ass off about how he was 'totally exonerated,' when the Mueller report specifically said it does not exonerate him. It's like if the pregnancy test came back negative; it doesn't mean you're a virgin. https://t.co/td6Dpwm62T RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @PeteButtigieg @ElissaSlotkin @SECupp @SullyDish + @PreetBharara on #RealTime @HBO! ht… Trump succeeded with his Saturday Night massacre (in stages), and got his credible stooge: last June, Barr write a memo attacking Mueller's \"obstruction\" theory - yes, he put obstruction in quotes. He didn't make the decision to exonerate Trump last week; he made it 9 months ago. Democrats need to stop having faith in \"good\" Republicans saving them. It didn't come from Comey, or Mueller, or Rosenstein, and it won't come from Kasich or Romney or William Weld or anyone else. You're going to have to do it yourself. As crooked as Barr is starting to look, the difference in reaction to this report finally coming out is profound: we accept, discuss legal alternatives,etc. If the report said guilty, they would have gone apeshit, accepted nothing and threatened violence. Trump is already on to calling for \"looking into the other side\", i e revenge on the conspirators. I guess this is the part of \"Valkyrie\" where von Stauffenberg and his pals say goodbye to their wives. I'm over Mueller already. On to Javanka using private e mail/WhatsApp for official business - any other WH, this wld be a giant scandal, and by this I mean giving WH jobs to these two ninnies. What about Tiffany, does she have a boyfriend? Maybe he can run SpaceForce on Snapchat. In the size-of-balls measuring contest, you always take home the trophy, Larry, and its not even close. And I don't want to see that trophy. https://t.co/USn7ziM6Ja I don’t need the Mueller report to know Trump is a traitor. I have a TV. w/@RepSwalwell #SubpoenaMueller https://t.co/gmaljGGBvn Trump has tweeted over 170 times that this is a witch hunt. And yet there are criminal charges against 34 people, including six Trump associates Manafort/Cohen/Flynn/Stone/Papadopoulos and Gates that's a lot of witches. https://t.co/pfHCEMN0Gc Trump Derangement Syndrome isn’t a real thing, so, on the rare occasion when Trump says something not stupid, don’t act like you have Trump Derangement Syndrome. https://t.co/kq0618lqne RT @IrshadManji: Welcome to all new Tweeps who watched @RealTimers tonight! Glad to have you here. I’ll take disagreement as an invitation… RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @IrshadManji, @ericswalwell, @EvelynNFarkas, @KSoltisAnderson + @larrycharlesism on… RT @larrycharlesism: Together again. This should be interesting. @BillMaher #billmaher @RealTimers @HBO #realtimers Larry Charles Dangerous… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @IrshadManji @EricSwalwell @EvelynNFarkas @KSoltisAnderson + @LarryCharlesism on #Real… RT @charitybuzz: Want to win 2 VIP tickets to @RealTimers, meet @billmaher, AND give back? Support @rush_art #ArtforLife on @Charitybuzz an… Is there anything more unseemly than Trump constantly attacking a dead war hero? He did it again today, always denigrating John McCain - and McCain's widow, Lindsay Graham, says nothing! I see Twitter got made because Beto's wife didn't talk during his announcement. You're right, he's a sexist monster, we're better off with Trump. To my FarLeft friends: you're doing it again. Amy can talk or not, her call, but you need to shut the fuck up. RT @RealTimers: \"Donald Trump's biggest fear is that we are going to recognize, those of us who are in the working class...that we've actua… Happy St Patrick’s Day everybody!! Remember, he drove the snakes out of Ireland! And into the White House. Trump’s tweets are becoming more inscrutable. Sometimes he seems to assume EVERYONE is watching Fox and he need not tell u what he’s referencing. One day he’ll just write “Fuck yeah!” On this college admissions scandal, everyone is talking about. I have shocking news for everyone: rich people cheat, and their kids are fucking stupid. #OperationVarsityBlues https://t.co/nbVjRYhM3x Democrats, you call yourself The Resistance? Then fight behind enemy lines! That’s what a resistance does. You have to get inside the @FoxNews bubble and fight. #Tuckerface https://t.co/TDIB58oJW6 RT @RealTimers: #StartTheClock: @BillMaher is LIVE with #AndrewMcCabe, @JessicaYellin, @JonTester, @jheil + @AndrewGillum on #RealTime @HBO… RT @AndrewGillum: I’m in Los Angeles to film an interview with @billmaher tonight. Stopped by the mall to pick something up and a reported… re Manafort et al: One way to tell you haven't picked \"the best people\" is they go to jail more often than in Monopoly. That's one campaign promise Trump has kept - getting criminals off the street. There is cancer on progressivism with some people that call themselves social justice warriors. #SJW #TriggerWarning w/@NoahCRothman https://t.co/OzmyONI9oW RT @RealTimers: FRIDAY: @BillMaher will be LIVE with Andrew McCabe, @SenatorTester, @jheil, @JessicaYellin + @AndrewGillum on #RealTime @HB… What if Obama had behaved like Trump? #IfObamaDidIt #Cult45 https://t.co/TijwkOxYwl .@realDonaldTrump - Dictator Checklist ✔️ https://t.co/kiJ5mn5Ifa I see some mean people are saying President Cuckoo's Nest is losing it because he called Apple's Time Cook \"Tim Apple\" in a meeting. Ridiculous. He's at the top of his game, and just signed a nuclear arms deal with Chick Corea. So we find out now the lady who ran the massage parlor where Robert Kraft got caught is Trump's friend who sold access to...I can't. Trump is so dirty, he's even in this RubnTug scandal? I can't. I need a day off. Order now and Mexico will pay for it! #MAGA https://t.co/j8DrPf7DBq No one should be surprised that Trump thinks he’s God’s gift to America – because that’s exactly what Evangelicals keep telling him he is. #Isaiah45 #KingCyrus https://t.co/wgm1eETy7r Paul Manafort's company was known as The Torturers Lobby. They worked for monsters. These were guys no one else would touch from places like Ukraine and Zimbabwe and Neverland. #ManafortSentencing #BlamelessLife https://t.co/POElTxJxEG RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @mschlapp, @jonathanalter, @MichaelSteele, @mkhammer + @NoahCRothman on #RealTime @… RT @RealTimers: FRIDAY: @BillMaher is back with @MSchlapp @MichaelSteele @JonathanAlter @MKHammer + @NoahCRothman on #RealTime @HBO! https:… 2 parallels to #LeavingNeverland (and reaction to it) and the Trump nightmare: MJ cld shoot someone on 5th Ave and his base wld stay with him; and he's so in the open (sleeping in same bed with boys, in public with them) about his dirty deeds they're not stopped. So...the Kim summit failed because of Michael Cohen? Say it with me: Whiny. Little. Bitch. #WhinyLittleBitch. Just watched Neverland doc - riveting, as has been so much on HBO with Richard Plepler at the helm, now resigned. I don't usually speak publicly about the inner workings of the/my biz, but just have to say...best boss I'll ever have. Look who came to my show in El Paso tonight, ⁦@BetoORourke⁩. Crowd went nuts,same last night when his name came up in Austin.  Dems cld do a lot worse than putting some of THAT on the ticket. https://t.co/5UhPZCS562 So much to talk about - and we got it all out last night in Austin! Thank u, what a crowd...looking for more Texas love tonight at the Plaza in El Paso. Wall jumpers get in free!! RT @peta: New rule: no more douches wearing the fur &amp; feathers of tortured animals! ☝️  @BillMaher gets real about what @CanadaGoose does t… ..my question for those congressmen defending him yesterday: Really? That's your guy? I know \"I'm with her\" was a lame slogan, but knowing who Trump is, your deal is \"I'm with him\"? With that scummy human being? Got it. According to Cohen, Trump gets a shill to overbid for a painting of him at auction so he can say his portrait went for the most of anyone, then has his charity pay for it, then keeps it himself. Even if there's no Russian collusion (there is), or other criminality (there is).. Cohen said today in answer to why he's doing this, because he worries even if Trump loses, he will not leave office - which is what I've been saying from the beginning, to a chorus of \"Oh, no, you're paranoid\". Maybe not so much. #GreenNewDeal #RTOvertime https://t.co/FpbuBGvyFR Just heard interviewer say to Bradley Cooper, \"I loved the film, but I feel you don't get enough credit\" - yes! Finally someone sees it - how can we put some light in Bradley Cooper's life? Why is life so unfair so some people? Damnit! Tonight we conclude Awards season with #OscarNoHost after Globes's hosts did a reverse-RickyGervais and put the piss back IN the powerful, and Grammys, no attempt at humor. Congrats PC police, we are now officially afraid to speak. Sad... RT @RealTimers: Bill has a special #NewRule for tonight's #Oscar winners... https://t.co/3TvM9BPzL4 Bezos, you’re worth $130 billion. Take one for the team. Stop playing cities off against one another and help a dying one come back to life!  #AmazonHQ2 https://t.co/LOnhqU7nuO Jussie, I know you must be feeling bad right now. Just don't beat yourself up. https://t.co/8xL7Kn7cGd RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @AdamSchiff, @clairecmc, @TheRickWilson, @donnabrazile + @BHL on #RealTime @HBO! ht… Media, do you really have to cover this #JussieSmollett thing like its the Kennedy assassination? Jeez. And Jussie - using extras from \"Empire\" - what were you thinking? You never give extras lines!! RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @RepAdamSchiff @clairecmc @TheRickWilson @donnabrazile + @BHL on @HBO! https://t.co/aW… There is a real problem in our society, looking for any excuse to dump someone good because there must be one more perfect. And sometimes what you wind up with is no one to host the Oscars at all. https://t.co/Qr1MkxYqi8 A National Emergency should not be used by Trump. It should be used on Trump. https://t.co/EfPUfI7Ys5 RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @ChicagosMayor @RahmEmanuel, @mayawiley, @davidfrum, @PaulBegala + @johnlegend on #… Here's a way I always thought you cld tell if something was NOT an emergency: when the solution involves cement. You never see in an action movie the president pick up the red phone and say \"Get me a landscape architect - NOW!\" Since Trump's people now chant \"Finish the Wall\" and believe much of it has been built, could he convince them Hillary has been locked up? I can already hear them chanting: \"Keep her locked up!\" RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @ChicagosMayor @RahmEmanuel @JohnLegend @MayaWiley @DavidFrum + @PaulBegala on #RealTi… RT @RealTimers: \"I call it 'Dunkirk 2.' Only this time, we’re following the Nazis out of Europe.\" Watch @EricIdle discuss #Brexit with @Bil… So it’s a real billionaire with a real newspaper against a fake billionaire with a fake newspaper. #TrumpVsBezos https://t.co/FOjORuJaVt Stop saying both parties are equally to blame for the mess we're in. \nCongress isn't broken, the Republican party is broken. https://t.co/5Lz7Q7a454 RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @GovChristie, @JackKingston, @NatashaBertrand, @MalcolmNance + @EricIdle on #RealTi… RT @RealTimers: TONIGHT: @BillMaher will be LIVE with @GovChristie @MalcolmNance @NatashaBertrand @JackKingston + @EricIdle on #RealTime +… It was so cold in New York today that Louis C.K. was just describing his penis. https://t.co/88HfntKN6k America does need to build a wall. A sea wall. Because carbon is killing us, and Mexicans are not. #NationalEmergency #ClimateChange https://t.co/4igF3wX1bg RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @HurdOnTheHill, @JRubinBlogger, @jmeacham, @PeterHamby + @NYCMayor @BilldeBlasio on… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @HurdOnTheHill, @BilldeBlasio, @JRubinBlogger, @jmeacham + @PeterHamby on #RealTime @H… Trump, could you please stop mixing up climate and weather?!! Jesus, even the Indian at the Lincoln Memorial is like \"Stop beating the same drum!\" Really? The coffee guy wants to be president? Just because you had one profitable insight - people will overpay for coffee - doesn't mean you can run the world. Govt is a different animal, can we please get a pro in there? Always make the devil laugh, that’s my philosophy. Comes in handy if u wind up in hell. https://t.co/tGSeYRGQfy The Science Guy dropped by the green room after Friday’s show. Stumped as to why the room is called “green”. So was Josh Green. https://t.co/yUZse4n9T1 \"Good news for George Herbert Walker Bush: As of today, he is no longer the biggest wimp ever to serve as President of the United States.\" -@AnnCoulter\n#ResistanceIsFutile https://t.co/RpuQb5VCwy Trump announced a deal today to reopen the federal government temporarily. It will be open for three weeks, just like his casinos. https://t.co/UZKZ8hqY7g This is for every person on social media who’s asked me since November, ‘Bill, what do you have to say about Stan Lee?’ #TriggerWarning #Excelsior! https://t.co/oi4dBPhSwU RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @AnnCoulter, @fakedansavage, @hmcghee, @JoshuaGreen + @McFaul on #RealTime @HBO! ht… Trump must be glad he doesn't have to intimidate the ever-loyal Roger Stone like he did Cohen. Mob tactics, the one thing Trump is good at. Today Paul Manafort woke up with an ostrich's head in his bed. RT @RealTimers: TONIGHT: @BillMaher will be LIVE on @HBO with @AnnCoulter @fakeDanSavage @HMcGhee @JoshuaGreen + former U.S. Ambassador to… Aside from the little matter of basing his argument on bullshit, why does Trump keep going back in the ring with Pelosi to get his ass kicked? State of Union speech? The last time he got shot down by a woman that bad was after he took Nancy O'Dell furniture shopping. RT @RealTimers: It's time for... https://t.co/qoedscV8eO Just know as this shutdown drags on that thousands of secret service agents are working without pay: yes, the men and women who keep Steven Miller from getting punched in the face are doing it out of a sense of honor. Ah, MLK Day, when Republicans say such glowing things about Dr. King. Really, really glowing, and it makes me wonder what they'd say if he was alive. RT @RealTimers: \"You call me unpatriotic, but you come to my neighborhood where I’m from and you’ll see me take the shirt off my back and g… Thanks everybody for the birthday wishes, and thanks God ahem ahem wink wink for the supercool Blood Moon! Nice touch, heavens! This shutdown is not about the wall. It's about the wallet. And it's more proof that the great American middle class is disappearing faster than R. Kelly's Facebook friends. https://t.co/8HLvBG3hTu We found out the FBI was investigating the President of the United States for being a Russian agent. If you remember one thing about the last two months, that's it. And spoiler alert: He is! #TrumpTowerMoscow #ImpeachTrump https://t.co/xGXs8JlEBs RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @JohnKasich, @MoneyLynch, @BarneyFrank, @EWErickson + @crampell on #RealTime @HBO!… This is too much, on the night we start our new season of Real Time, Trump gives me the gift of a smoking gun, impeachable crime. Really, you shouldn't have. I mean, you shouldn't have done all the crimes you did, but at least your timing is good. RT @RealTimers: FRIDAY: @BillMaher is back with a new season of #RealTime! Watch him LIVE with @JohnKasich @BarneyFrank @CRampell @EWEricks… Republicans say \"Trump shldn't declare a nat'l emergency with the wall, cuz next a Democrat president cld declare one for climate change.\" Yeah, let's make sure there's no mission-creep with nat'l emergencies and we start declaring real ones. RT @hardball: \"Are you with Trump ... or are you with the FBI? Are you with the rule of law or are you with Donald Trump? Are you with ever… Oh, look, it got fixed already. https://t.co/efy6Y5pwfM To those Incels who defaced my billboard, I just want you to know, I will follow you to the gates of your parents' basement! And thanks for the free publicity, Real Time is back Friday night! https://t.co/QFGquZd1FC RT @hardball: TONIGHT: @billmaher plays #Hardball. Tune in. https://t.co/x4HhRegZiN I guess \"I never worked for Russia\" is the new \"I am not a crook\", and about as believable. And SO much worse. Been saying \"slow moving coup\" \"treason\" \"traitor\" since before Election '16, and always guests said I was alarmist, overstating, etc. Well, after we learned this week FBI was looking into #TrumpAsTraitor, I hear it all over. Good time to get back to work. Can't wait till Friday! Again, not to harp on the \"don't say stupid\" thing, but if certain people could stop obsessing on the nonsensical idea that a \"wall\" can stop all border problems, then a certain president wouldn't insist on it. Certainly. Hearing tales of furloughed govt workers who can't make basic payments after missing one or two paychecks is a reminder of our fucked up economy! These are supposed to be middle class jobs, but if you can't survive skipping one paycheck, that's not middle class! Hearing Trump’s ridic “statistics” about terrorists coming thru WHERE THE WALL SHLD BE! and then picturing his fans nodding along...u see why it’s so hard to comply with the “Don’t call them stupid!” request? Can I say “Brightness Challenged”? This #NickFoles is the Jay Leno of football - he keeps winning,and they keep replacing him. Watch, they’ll do it again next year. Also, who gives a shit I’m a Giants fan. If a Dem prez did a tenth of Trump's crimes/crazy pronouncements, etc wld Repub.s hesitate for a minute to impeach him? Wld they worry \"how it wld look\" and say \"what about the backlash?\" Fuck no. 'Do what you believe' beats 'Finger in the wind' with voters almost always. Harassment in the Bernie campaign not cool, but I like his response to Did you know?:”I was a little busy running around the country trying to make the case” I’m sure Dems will do what they do best and destroy another of their leaders. Hard to believe it’s 8 years for this picture. Thank u my Hawaiian New Years compadres, I can’t imagine doing it any other way. And Happy new year everybody on Twitter thanks for sticking with me https://t.co/kHruiFwdJw Just watched “Destroyer” - they really ugly up Nicole Kidman for the part - wrong! If u have to be transgender to play transgender, etc, only truly ugly ppl shld play ugly ppl! Am I the only one woke around here?! (Happy new year!!) Why can’t Democrats learn to do what Republicans do and just repeat 1 point that seals your case, as: “You said Mexico wld pay for the wall”...just say that 1 thing and nothing else till this mess is over! What else needs to be said? RT @rbpconcerts: Tickets still available now at Ticketmaster for Bill Maher’s 8th Annual New Year’s Comedy Extravaganza! Check out this pie… Trump:\"Its a disgrace what's happening our country, but other than that i wish everybody a very merry Xmas\" - only he cld take a holiday that uses pagan tree worship and flying deer to celebrate a virgin birth and make it into something ridiculous. I know xmas Eve isn’t the time we typically think of the Kurds, but we just did it to them again! Left them to get attacked after Gulf War, and now with Trump’s Syria pullout. It’s almost like Republican presidents can’t be trusted... RT @RealTimers: Trust us, you can handle it. https://t.co/96uBncZFsG Looking forward to Republican's shift from \"Yay, the Trump economy! Fuck yeah!\" (even though it was always just a continuation and slight building on the Obama economy) to \"I think we can all agree recessions are cyclical.\" The 37 different \"my teenager's in trouble\" movies this season all confirming my decision not to have a would be teenager👍 Can't wait to get back! #RealTime @HBO https://t.co/ogcwA77ive RT @rbpconcerts: Bill Maher is returning to Santa Cruz Civic Auditorium with an all new stand-up comedy show on February 9 for an unforgett… As his speakership winds down and the U S posts \"the widest Nov budget deficit on record\" let's all reflect on the gutless, intellectual fraud that was Paul Ryans's career. This David Pecker is such a scumbag. I've read The Enquirer forever cuz its funny (not intentionally) and it exposes the powerful - that they were doing the opposite, covering for the powerful, is a shameful betrayal of their essential sleaziness! If Sean Hannity doesn't give Trump one of Matt Whitaker's \"big dick toilets\" for Christmas he's not sucking to his full potential. What's going on in NC, WI and MI is not getting nearly enough attention - this 'let's strip all of the Democrats' powers before they take office' - they never stop going lower. Media, do. your. fucking. job!! Other than Trump’s ties to the American mob, the Russian mob,Russian hookers, the Kremlin,indicted co-conspirators,shady lawyers, tax evaders,fraudulent businesses, fake charities, bribes and porn stars...there’s no there there!! This #MichaelCohen story today could be huge - he knows where all the bodies are buried. And by that I mean he may have actually buried some bodies. RT @bestfriends: Double your gift! It’s #GivingTuesday and your donation today will be MATCHED. Be a part of the lifesaving magic: https://… Meet my friend Precious. After 28 years in a lab, she now has a forever home at the @ProjectChimps. Precious is battling kidney disease. Join me in supporting her care and the 58 other chimps for #GivingTuesday where all donations are matched right now! https://t.co/W9Cg9g43L1 https://t.co/qAMf4HDxVj RT @kingsthings: It's the 1000th episode of #LarryKingNow — an interview you don't want to miss with my friend, the one and only @billmaher… 10 TRAVEL QUESTIONS WITH BILL MAHER --  https://t.co/ItxFK6EO6J Great to see the president here in Cali. I'm kidding, it made me spit up. Glad the fire is 55% contained. Unfortunately, he's only 10% contained. Trump is coming to California to check on the wildfire situation. He says he can relate because, last Tuesday, he also lost a House. https://t.co/UMVeVjqDrx Thanksgiving is in a few days, and that means spending time with family and some of whom we may not agree with politically. Let's stop talking politics to each other. We used to have no idea how much we really hated each other, and it worked! #TrumpFreeHoliday https://t.co/Jo5ZmLaDxZ RT @RealTimers: #StartTheClock: @BillMaher is LIVE on @HBO with Rep. @EricSwalwell @Kasparov63 @VanJones68 @NancyMacLean5 + @SteveSchmidtSE… I kind of like the idea of Melania firing everybody in the White House. And they should have seen it coming, the writing was on the coat. Before election, I told Trump voters, as soon as its over, the caravan will disappear from the news...see? And to the media (especially cable news) who say the caravan \"has disappeared from the news\" - you put it there! You are always doing Trump's bidding for him. #Enablers RT @RealTimers: FRIDAY: @BillMaher will be LIVE on @HBO with @RepSwalwell @Kasparov63 @VanJones68 @NancyMacLean5 + @SteveSchmidtSES for the… When something bad happens, its not complete until Trump tweets something heartless and ignorant about it - it ain't over till the fat baby zings - so of course he's blaming our fires on tree huggers. Does he know Thousand Oaks is a town and not actually a thousand oaks? RT @RealTimers: Trump \"knows that he can start a fight and he doesn't have to finish it, because someone else will finish it for him. And t… Trump lives in this opposite world. He puts criminals in charge of the Justice Department. Facts are lies. He’s awake when he should be asleep. He talks out of his ass, but shit comes out of his mouth. https://t.co/pqGiK60W9R For a coup to work, It is first necessary for truth itself to be destroyed as well as the people who try to report it. #PressFreedom #CNN https://t.co/y3Xix6QtYc RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @realBobWoodward @SarahKSilverman @BretStephensNYT @CornellBelcher + @KattyKayBBC o… RT @ilyamerica: .@BillMaher's favorite Trump analogy. Catch @SarahKSilverman on @realtimers tomorrow, and an all new episode of #ILYAmerica… .@ILYAmerica with the wonderful @SarahKSilverman. #Midterms2018 results, #GusTheMule &amp; more. Full episode is streaming now on Hulu: https://t.co/jqRoS6YuOR https://t.co/KaT4VrkI6T RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @realBobWoodward @SarahKSilverman @KattyKayBBC @BretStephensNYT + @CornellBelcher on #… Could ONE reporter ONE time say to Trump when he complains the press is negative and hostile (as he's doing right now), \"Sir, its because you LIE and we have to report that. Don't lie and we won't be so \"negative\". ONCE please? Remember after the '08 crash, banks had to do a \"stress test\" to see if they could withstand big losses? Trump is kind of our \"stress test\" for democracy - to see if our institutions, laws, norms and basic decency can hold. Don't fuck it up, folks - please vote! ...all kidding aside, there isn't an illegal crime wave. There just isn't. Some Americans commit crimes, some don't. The ones who do tend to be in the cabinet. From early optics, it looks like our Soros-funded plan to bring caravan migrants to Hillary's pizza parlor to get registered to commit massive voter fraud in return for free luxury cars is working - oh...woops. RT @RealTimers: If you show up to your polling place on #ElectionDay and are told you can’t vote for any reason, call 1-866-OUR-VOTE. https… Message to Trump voters: Vote Democrat, because as soon as this election is over, no one will give a shit about the caravan. But you'll still have diabetes. “I was on Nixon’s enemies list, which I was very proud to be, and I still am very proud to be.\" -@BarbraStreisand https://t.co/oT21LLo6al If Trump thinks there's a caravan of angry brown people in Mexico, just wait till he sees the lines at the polls tomorrow. RT @MMFlint: More than one of these  yard signs spotted in Michigan... https://t.co/dwQV4BkcBJ .@FoxNews is treating this #MigrantCaravan like it's the zombie apocalypse. \nBut if zombies eat brains why would they be heading toward America? https://t.co/qcrRfQAD2u Mark Tuesday, November 6 down on your calendar like you're Brett Kavanaugh planning to get shit faced. Because Tuesday is win or go home for democracy. #MidTerms2018 #Millennials https://t.co/cC7fapqBdj RT @RealTimers: The one and only @BarbraStreisand is LIVE with @BillMaher! Her new album #BarbraWalls is out TODAY. https://t.co/7Dz08xVrMh RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @BariWeiss, @JimVandeHei, @ChelseaHandler, @AnthonyACLU + @BarbraStreisand on #Real… This week was the 80th anniversary of Orson Welles' \"War of the Worlds\" broadcast that made panicky, gullible people believe an \"invasion\" was under way - thank god something like that couldn't happen today! RT @RealTimers: FRIDAY: @BarbraStreisand @BariWeiss @ChelseaHandler @JimVandeHei + @AnthonyACLU join @BillMaher LIVE on #RealTime @HBO! htt… Trump knows that when you turn up the fear mongering, his base votes. Unfortunately, when you turn it up a lot, they also start shooting and bombing. But hey, small price to pay when you got an election to win, right? RT @attn: 96-year-old @carlreiner has a blunt message for voters this election. https://t.co/MHFa8En9Gw RT @RealTimers: If this migrant caravan was white, Trump wouldn't be sending troops – NBC Sports would be sending a camera crew. https://t.… For the sake of democracy, we have to move #Halloween far, far way from election day. Because @GOP voters are scared enough as it is. #Midterms2018 https://t.co/HelQIoTouO Is It Okay To Call This One Deplorable? #MAGABomber https://t.co/pcpiunGyVX RT @RealTimers: TONIGHT @ 10PM: @BillMaher will be LIVE with @StormyDaniels @MaxBoot @WoodruffBets @Scaramucci + @JonHaidt on @HBO! https:/… RT @lasvegasweekly: Chatting with political funnyman @billmaher, who returns to the Mirage this weekend https://t.co/WlSLlqhGwZ https://t.c… Make no mistake, the TV media is helping Trump and his enablers win the upcoming election. The \"caravan\" is Trump's obsession - it doesn't have to be yours! Make interesting what is important - that is your job! RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @StormyDaniels @Scaramucci @WoodruffBets @MaxBoot + @JonHaidt on #RealTime @HBO! https… Special night for me tonight, and I mostly want to thank all the viewers who've been with me from the beginning, and all those who came along the way. (Some of you weren't born at the beginning...oy.) I consider ours a sacred bond between lovers of free speech. RT @RealTimers: The #RealTime Anniversary Special airs TOMORROW and it’s pretty, pretty, pretty good. https://t.co/BhAkDZKpww Congratulations to Canada for legalizing pot - always a step ahead of your bigger neighbor to the south. I was going to wait till tomorrow night when my big Anniversary show is on HBO (in our regular time slot) to spark up, but what the hell, this is big too! RT @RealTimers: We’re celebrating 25 years of our main man @BillMaher with the Real Time Anniversary Special: FRIDAY @ 10PM, only on @HBO!… RT @attn: President @BarackObama doesn't have time for these 7 excuses not to vote. https://t.co/2Etpm6taTq Taylor Swift reminds Trump of Hillary, a powerful blonde woman who has been rejected by millions of white men. #BlueWave https://t.co/1547EhQekL When the Prime Directive for government goes from 'keep us safe' to 'keep us entertained.' That's bread and circuses, end of the Empire stuff. https://t.co/B35nSXHN7P RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @OMAROSA, @RTraister, @Reihan, @ESGlaude + @SteveKornacki on #RealTime @HBO! https:… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @OMAROSA @RTraister @Reihan @ESGlaude + @SteveKornacki on #RealTime @HBO! https://t.co… Californians: Want to help pass the strongest law in the world for farm animal protection? Vote #YesOn12 in November, and share this post! https://t.co/1CcZAz7QSm https://t.co/Jfi6xBoFjU RT @RealTimers: Counting down to the Real Time with @BillMaher Anniversary Special: Friday, Oct. 19 @ 10PM! https://t.co/iigUDiyXPd What does it say when the president is allowed in public with toilet paper on his shoe? He has no friends. None. No one will tell him “you have snot on your face”. That’s next. I guess it's time to join the Beach Week Ralph Club. #SchlitzKavanaugh #SCOTUS #Sham https://t.co/xYYOAijpgj Republicans get to run America and liberals just get to ruin their dinner. \nWe need to get people like Ted Cruz out of power, not out of restaurants. #SchlitzKavanaugh #WeBelieveSurvivors https://t.co/gq39bL4aZh RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @DorisKGoodwin @SoledadOBrien @DavidJollyFL @SullyDish + @TheJeffBridges on #RealTi… RT @RealTimers: FRIDAY: @BillMaher welcomes @DorisKGoodwin @SoledadOBrien @DavidJollyFL @SullyDish + @TheJeffBridges to #RealTime @HBO! htt… Looks like they're gonna do it, Kavanaugh on the court: women of America, consider yourself boofed. RT @SamHarrisOrg: I really enjoyed speaking with @billmaher and @larrycharlesism on this week's podcast:\n\n\"Sacred &amp; Profane\"\nhttps://t.co/A… RT @syracusedotcom: In his words: Bill Maher's take on Trump, the Democrats and the midterm elections https://t.co/UxaRzdkFcs 25 years in the making! @RealTimers Anniversary Special debuts Friday, October 19, on @HBO. https://t.co/MdOkiUr6Cc George W Bush called several moderate senators this week to lobby for Kavanaugh. This is your monthly reminder that George W Bush was and is a terrible person. If that was a divorce hearing, she would have gotten the kids. #KavanaughHearings #BADBrett #WhnyLittleBitch https://t.co/EZsWUhUWKA The thing about Naziism Maoism &amp; Stalinism. They were religions, state religions. Those dictators didn't get rid of God because they hated religion. They got rid of God because they hated the competition. #Religulous #Trumpism https://t.co/5AlAY5VhYy One sign there is a bad thing going on is when your #yearbook is redacted. #Kavanaugh https://t.co/qTQuGwwoQw RT @RealTimers: #StartTheClock: @BillMaher is LIVE with Steve Bannon, @AprilDRyan, @EvelynNFarkas, @MaxBrooksAuthor + @NeilTyson on #RealTi… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with Steve Bannon, @AprilDRyan, @EvelynNFarkas, @maxbrooksauthor + @neiltyson on #RealTime… \"The party does and the people are already there. The majority of Americans take the liberal position on nearly every single issue.\" - @MMFlint #RTOvertime https://t.co/tCu9PXrbZy RT @Google: On #NationalVoterRegistrationDay, learn how to register to vote in your state and spread the word → https://t.co/LNqVWmMJRN htt… RT @projectchimps: It's Giving Day for Apes today! Help former research chimpanzees like Gertrude. Every dollar donated up to $20k will be… #Fahrenheit119 @MMFlint does what journalism should do which is make what's most important interesting and compelling. #Resist https://t.co/qNYo5qo8vo RT @OvensAuditorium: Since starting his career as a stand-up comedian in 1979, @billmaher brings his sharp wit to the #OvensAuditorium #CLT… Republican defenders of #BrettKavanuagh are saying that ‘we shouldn’t be revisiting things that happened decades ago,’ which is what I say about Roe v. Wade. https://t.co/Ymb7wmmIg9 If there was a nutrition label on Trump's ass it would say 35% Fat 65% \nNarcissistic Personality Disorder. https://t.co/Ca9y8ro81v RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @MMFlint, @SteveHiltonx, @CRampell, @Thom_Hartmann + @PJORourke on #RealTime @HBO!… RT @RealTimers: FRIDAY at 10PM: @BillMaher will be LIVE with @MMFlint @crampell @Thom_Hartmann @SteveHiltonx + @PJORourke on #RealTime @HBO… “He’s got the maturity of an 8-year-old boy with the insecurity of a teenage girl.” -@JohnKerry https://t.co/W3k8AGMTiM Trump is monitoring the storm from the command center in his bed. He has stockpiled tweets. And he is prepared to give himself an A+. #HurricaneFlorence https://t.co/VrGiMnYPUy The new campaign slogan for the @DNC should be: #WereNotSocialistsYoureTraitors #Midterms2018 https://t.co/mQCIMW75Jt RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @JohnKerry, @MarkLeibovich, @SECupp, @RichardClarke + @Steven_Ballmer on #RealTime… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with former Secretary of State @JohnKerry and @USAFacts founder @Steven_Ballmer, plus @secu… RT @JerryBrownGov: #SB100 and this executive order put California on a path to meet the goals of Paris and beyond. It will not be easy. It… \"Because you voted Republican you're not stupid, you're not different, you're not worthless. I can break bread with anybody who voted for Trump. We could find some common ground to love each other. Just stop doing stupid shit.\" -@JimCarrey https://t.co/XAl70EYcJv It's time to get @AlFranken off the bench so he can come back to doing what he does better than any other Democrat: taking down right wing blowhards. #BringBackFranken https://t.co/fphaB3sG9K Bob Woodward has brought down more Republicans than gay sex in public restrooms. #Fear #FatNixon https://t.co/yX7IsinsZY RT @RealTimers: Comedian, actor and @SHOKidding star @JimCarrey and his @Nike's are getting comfortable here on the #RealTime @HBO panel! h… RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @JackABryan, @DavidAxelrod, @RepCharlieDent, @MichelleInBKLYN + @JimCarrey on #Real… RT @RealTimers: Help make the impossible, possible. #StandUpToCancer and join @SU2C tonight at 7ET/4PT. Learn more at https://t.co/ywlZG68C… So much crazy shit happened this week I'm glad I have both Real Time tonight AND will be @TheMirageLV tonight and tomorrow at 10. The president's brain is missing - really, there's kind of a lot to say. I know Anonymous is a big hero today, but for the record I don't see poisoning the planet and cutting taxes for the wealthiest as \"bright spots\" that \"put country first.\" RT @RealTimers: This seems like a good week for some #RealTime. Join @BillMaher and his guests @jackabryan @davidaxelrod @RepCharlieDent @m… \"He has lied to the American people. He has tried to disgrace you and this Office with a sustained propaganda campaign that would make Nixon blush.\" - Brett Kavanaugh wrote in a memo to Ken Starr #SCOTUS #FatNixon https://t.co/XZuOqJVu3y Now Trump is saying - after all this time! - that Lester Holt \"fudged\" the tape where he confesses why he fired Comey?? Really Trump people? #ThatsYourGuy? Anyone who ever said “this is the most important election” in years past, was wrong. Unfortunately, elections cost a lot of money, but if we don’t win this one, it will be the last one you’ll recognize, and I already don’t recognize a lot of my country. It's now or never. #Resist https://t.co/xsgpDmOSFd I feel like we've been invaded by a culture that doesn't share our values - Trump supporters. I long ago gave up asking \"What would it take for them to turn...?\", but this McCain gracelessness, Jesus. MY hat says \"Really? That's your guy?\" \"Since #JohnMcCain has left the Hill, the Republican spines have gone with him.\" – @JohnBrennan Former CIA Director https://t.co/qPsY5Gg6eS With so many Republicans are going to jail now, who's going to be left to lock up Hillary? #TrumpCrimeFamily #LockHimUp https://t.co/GUveKb5Tkn If the @GOP get to bring in Russia as their ringer. We get to bring in our own country, and I pick China. So let me be the first to say... China, if you're listening? I hope you can find Donald Trump's tax returns. https://t.co/OHz8wePPqZ RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @JohnBrennan, @DavidCornDC, @TheRickWilson, @SaruJayaraman + @KaraSwisher on #RealT… I know its not the biggest story this week, but Cohen paid Stormy 130k and charged Trump 420k? Including 50k for \"tech services\"? What are the tech services for handing a porn star a check? Car dealerships are thinking \"tech servieces\"-why didn't we think of that! RT @RealTimers: FRIDAY: @BillMaher will be LIVE with former @CIA Director @JohnBrennan and @Recode's @karaswisher + @TheRickWilson @SaruJay… Liberals should own the first amendment, the way the conservatives own the second. #FreeSpeech https://t.co/zfAwqJmbnl I know becuz of my late hours, and living in Cali, many of you are just starting your day, but as I head to bed on MY Tuesday night, its a nicer feeling than I've had in a long time. A good day, finally, for the rule of law, and my heroes, the DeepState! Favorite part of Omarosa's book: Melania sends messages with her clothes. Like her \"don't even think about fucking me\" pumps. Perfect for the \"go hither\" look in her eye. Everyone's social media persona now is like a candidate running for office. If you want to know who someone really is, ignore their avatar and check out their web browser history. https://t.co/SWXoIbTGs7 This is where we are in America. The reality-show people are now the reality. https://t.co/FQmodbPzk3 Hey, we won one: no military parade! Oh shit, Trump just revoked the security clearance for the Pentagon I've been calling this Trump thing a #SlowMovingCoup since before the election - but its moving faster now. Dems say \"We have to be FOR something\" - how about Democracy? The Saturday Night Massacre is happening, just not on one night. RT @RealTimers: FRIDAY: @BillMaher welcomes @PreetBharara @JenGranholm @jonathanvswan @SykesCharlie + @adamconover to #RealTime @HBO! https… \"If slavery was a choice, then I guess Harriet Tubman was just a travel agent.\" -@RealDLHughley https://t.co/fGnR8Y1Sbh We’ve gone from 'Hope and Change' to 'Hope and Change Your Story.'\n#TrumpTowerMeeting #TrumpRussia https://t.co/ijDvpk1HKJ I, Q, need your help to \"Make America Great Again!\" Keep posting your memes. Keep believing everything Trump tells you. And, above all, on Tuesday, November 6, stay at home. #WeAreQ #IAmQ #MAGA #QAnon https://t.co/TafAb8FHHJ RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @Lawrence, @SethMoulton, @RealDLHughley, @CBellantoni + @SAPinker on #RealTime @HBO… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @Lawrence @sethmoulton @RealDLHughley @cbellantoni + @sapinker on #RealTime @HBO! 5 fo… RT @MMFlint: The trailer to my new movie, “FAHRENHEIT 11/9”, was just made public a few minutes ago! “FAHRENHEIT 11/9” is in theaters EVERY… RT @RealTimers: \"The people in this country do not understand the level of the crisis we're at.\" – @BillMaher #RealTalk #RealTime https://t… RT @CAWP_RU: It's official. With polls closed in KS, MI, MO, we've broken the record for women major party nominees for U.S. House in any y… \"Fear is a contagion in a democracy and Trump uses fear and he is exhausting the opposition.” - @SteveSchmidtSES #QAnon #Midterms https://t.co/d5QYzL6ChH You might think Trump is crazy with his 18th century ideas about trade, but he has a long range goal: to get the Chinese hooked on opium. Trump calls the media 'the enemy of the people.' Except for @FoxNews. They are so far up his ass, they are the enema of the people. https://t.co/rvQBwNbun6 The party of Reagan has to explain how it’s become the party of Putin. https://t.co/JKaGGgRth9 RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @MalcolmNance, @SteveSchmidtSES, @KSoltisAnderson, @CharlesMBlow + #NancyMacLean on… Great to be back in the saddle on game day. SO much to talk about tonight - Bill Maher, proud member of Enemies of the People since 1993. RT @RealTimers: This is not a HOAX: @BillMaher is back FRIDAY with @MalcolmNance @SteveSchmidtSES @CharlesMBlow @KSoltisAnderson + @NancyMa… Mike Pence is the kind of loathsome Christian hypocrite that, if I didn’t hate religion already I would start. The Attorney General is a Confederate soldier &amp; the Secretary of Education is mentally challenged. https://t.co/RbJqS84pc2 I always hated bullies, bullies of any kind. Sexual harassment is just a particularly odious kind of bullying. #MeToo https://t.co/jdf31SgjRy Tariffs and Putin are turning some Republicans critical of President ManBaby - my dream is the end of Training Day, Trump shouting he's King Kong but he's lost his power and everyone ignores him. Like I said, a dream. America has zero tolerance for drugs but infinity tolerance for guns. #NRA #Ammosexuals https://t.co/ah5yxNZ1rU Here's my question for the Trump fans who might be in the audience tonight @TheMirageLV at 10: Are you tired of winning? You must be fucking exhausted. Last Saturday in D C, 7 ppl in my dressing room after the show, all said \"I didn't watch your special cuz I thought it wld be the same.\" Nope, not this comic (except the ending about kids and sex, which bears repeating!) @TheMirageLV Fri and Sat at 10! Usually I'm good with time off, but this week its killing me Real Time is dark - luckily, I'm at @TheMirageLV Friday and Saturday at 10, and there is just so much to make fun of this week! The bright side of the Helsinki Tergiversation is it will make it harder now to fire Mueller. If everyone thinks you’re a traitor, the guy looking into whether you’re a traitor looks ever more necessary. In America we don't even have an immigration problem. We have a \nmy life didn't turn out the way I wanted to so I blame other people problem. https://t.co/EElbxbeZdj Now that Trump is finally vulnerable, watch the Democrats NOT go for the jugular. Sad.  And I say that very strongly. Really, Democrats - you can't make treason an issue? And why are the people who sound most forceful on the Russia issue not Democrats, but the never-Trump Republicans? #TimeRunningOut I love this #Mueller dude - without every saying a word or even being seen he's able to say so much. Today was badass. You are a VERY special prosecutor. Is it really such a crime to commit a crime? That's where the whole Republican Party is at. #WitchHuntMyAss #TrumpRussia https://t.co/V3KqhZ2j59 Donald Trump could not be where he is without all these @GOP enablers. It's not just the clown, it's the circus. @PressSec @FoxNews #Russia https://t.co/lsqfmbIYHX We don't know how this president gets his information although it's entirely possible that @SeanHannity blows it directly up his ass. https://t.co/1VGLc6faOu This is what happens when you elect a malignant narcissist as president. https://t.co/71bkufqAAO RT @HBO: No desk. No guests. Just Bill. \n\n@billmaher Live from Oklahoma is streaming now. https://t.co/PwhNmoiJHE There’s something not right about getting into make-up for stand-up...but hey, we re in show business and the live special on @HBOstarts in 50 minutes! https://t.co/Zuko2pOdVN https://t.co/z12ttbaEyF Headed out to Oklahoma for the special tomorrow night - OK, first we announce its called Live From Oklahoma, a few days later the state legalizes weed (medical), and yesterday Pruitt gets canned. Just sayin'... Happy 4th, everybody - hope you're enjoying celebrating America and everything it used to stand for (sad emoji face). “Where was the point where if we all just risen up, if we’d just done something?” \"But because [fascism] happens in little increments — that’s how fascism works.\" -@MMFlint  #Fahrenheit119 https://t.co/Ab76ZqpZJf RT @africlandpost: White american savage who is partly a neanderthal comes to Africa and shoot down a very rare black giraffe coutrsey of S… RT @1055TheXfactor: Listen this afternoon to win tickets to see @billmaher at @WinStarWorld https://t.co/NYL5u3JjMb RT @nytopinion: Last night, @billmaher talked about @Pagankennedy's @nytopinion essay on efforts to live a long, healthy life -- making a l… For Republicans, the Supreme Court is all about abortion - to which they remain staunchly opposed, right up to the moment their mistress gets pregnant. #SCOTUS #ElectionsMatter #CourtsMatter https://t.co/31APy3dObP In the 80s when fluorocarbons were destroying the ozone layer we banned them and the hole closed up. But that was back when Scientific American was the name of a magazine. Now it's a contradiction in terms. #GlobalWarming @CDCgov #Ticks #LymeDisease https://t.co/jeA7Yz3vXZ RT @RealTimers: You heard the man: @BillMaher will be LIVE with his 11th solo @HBO comedy special on Saturday, July 7th at 10PM! https://t.… RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @BenShapiro, @WhitfordBradley, @JRubinBlogger, Col. Lawrence Wilkerson + @MMFlint o… RT @MMFlint: Switching coasts today... I will be on Bill Maher tonight for the season finale of his HBO show. We have much to discuss and t… RT @EW: Bill Maher interview: HBO host tackles Trump, Roseanne, #MeToo, more https://t.co/eRWWGipQOu RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @benshapiro @WhitfordBradley #LawrenceWilkerson @JRubinBlogger + @MMFlint on #RealTime… I'm all for bringing civility back, but not as a unilateral concession: Trump and his ilk need to first stop threatening to \"lock up\" political opponents, journalists, etc. That's way worse than not getting seated! Stop doing that, we'll talk restaurants. Bringing some luck to @Mets with Pirate fan @bariweiss and Tiger fan @MMFlint  - hey, nobody’s perfect. https://t.co/l5a73Hi54e Trump signed an executive order that revoked the policy that he started. \nHe's the guy who congratulates himself for saving the toddler in the pool that he just pushed in. #ZeroTolerance @GOP #Christian #FamilyValues https://t.co/vw6MbpZk1e I’m not rooting for a disaster, the disaster is already here. If a #recession is what it takes to make @realDonaldTrump not so cute anymore, then bring it on. https://t.co/Sb5bqyPWiv RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @MrColionNoir @MichaelPollan @Smerconish @NeeraTanden + @JBarro on #RealTime @HBO!… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @MrColionNoir @neeratanden @smerconish @jbarro + @michaelpollan on #RealTime @HBO! htt… All this talk from Trump and his people about how they can't do anything about the border policy because, \"the law's the law, our hands are tied\" - where was that when they were sabotaging Obamacare? That's also the law. Someone has to explain to America’s police that the purpose of the \"body cam\" isn’t so you can upload your beatings onto @YouTube. #BlueToo https://t.co/mhAjACch8P Two people who lie about everything signed a deal that’s specific about nothing. I would say it was a #FecklessStunt. #TrumpKimSummit https://t.co/EjCv23e1c7 RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @GeorgeWill, @RepKarenBass, @MargaretHoover, @MichaelDWeiss + @BillyEichner on #Rea… RT @HBO: No guests. No desk. Just Bill. @BillMaher: Live from Oklahoma premieres 7/7. https://t.co/ilOPEuQTNM RT @TheMirageLV: \"Real Time\" is arriving at our hotel in prime time. Laugh your Aces off with @BillMaher tomorrow and Saturday! https://t.c… Excited to be going back to my Vegas home @TheMirageLV tomorrow and Saturday nights at 10 pm - somehow the scarier it all gets under You-Know-Who, the funnier it gets. That room rocks! RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @GeorgeWill @RepKarenBass @MargaretHoover @michaeldweiss + @billyeichner on #RealTime… Well, at least it didn't end in two minutes, which it could have (insert own Stormy joke here). Prediction: tomorrow, Trump will \"remember\" what was said very differently from Kim. But talking is still better than staring. I think Dennis Rodman just put it all into perspective: if you think there's crazy inside the meeting room, check the sidewalk. RT @RealTimers: This #NorthKoreaSummit should go well. Trump said he spent all last week preparing for his meeting with Kim. Kardashian. ht… I'm sorry, but like I said back when Trump sprung this on us, I can't hate this. Yeah, he's an idiot and didn't prepare blah blah, but when everything has failed forever, sometimes \"its so crazy it just might work,\" might. And then he'll fuck it up, but still... Trump bragged yesterday that he didn’t prepare for North Korea. Of course, when has he ever prepared for anything? This guy didn’t bring a condom to fuck a porn star. #RawDog #FatNixon https://t.co/vJNLI7B5bu Conservatives govern without shame and liberals shame without governing. https://t.co/XNPIsmaAOZ RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @MichaelEDyson, @jheil, @Shermichael_, @ChavezLinda + @FareedZakaria on #RealTime @… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @MichaelEDyson @chavezlinda @jheil @Shermichael_ + @FareedZakaria on #RealTime @HBO! h… \"We got to unite, bring our community together to take on the most outrageous president in the history of this country.\" -@BernieSanders https://t.co/36jfmzd9Mh You can tell Trump misses Melania, wherever she is - today he asked Mike Pence to swat away his hand. Roseanne’s tweets were full of racism, conspiracy theories and personal\nattacks they were described as abhorrent, bordering on presidential. https://t.co/3qHV0fYKrM Republicans, you're the Alex Jones party now. There is literally nothing too stupid &amp; conspiratorial that you will not swallow. #SpyGate #DeepState #RussiaGate #PizzaGate #UraniumGate #FISAGate #DossierGate https://t.co/10zesOVFKT RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @BernieSanders, @PaulBegala, @BretStephensNYT, @NatashaBertrand + @CthaGod on #Real… RT @RealTimers: FRIDAY: @BillMaher is back with more #RealTime + #RTOvertime feat. @BernieSanders @PaulBegala @NatashaBertrand @BretStephen… I'm rooting for the Rockets cuz then in the finals Khloe Kardashian will have fucked a guy on each team - America, fuck yeah! RT @PikesPeakCenter: America, we have to talk @Maher is coming to @PikesPeakCenter! Get your TIX to see him take the stage on May 27th! → h… Maybe the reason Trump keeps saying he wants to be president for life is because he wants to be president for life. https://t.co/lgj05odkoc Hey Trump, if Mueller is hunting witches he's finding them. #WitchHunt #TrumpRussia https://t.co/0mtFxVQqe2 Anybody in Vegas ready to laugh? Get out of the shower, I’m on at @TheMirageLV in 90 minutes! Tomorrow too! Yolo!! RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @SelectedWisdom @DambisaMoyo @BariWeiss @Evan_McMullin + @fakedansavage on #RealTim… RT @RealTimers: FRIDAY: @BillMaher welcomes @selectedwisdom @fakedansavage @bariweiss @Evan_McMullin + @dambisamoyo to #RealTime @HBO! http… Hey, it doesn't matter if you're a Laurel person or a Yanny person, the important thing is, we're all fucking off at work! I have to show you @DonBlankenship's campaign ad because this is real and it's just too funny. #SwampCaptain #CocaineMitch https://t.co/GQkiCvLr2S Trump has this obsession with undoing everything Obama did. If he could bring bin Laden back to life he would do it. #IranNucleardDeal #ParisAgreement https://t.co/nfRCLzCo6i Everything Trump does is modeled on the mob. He's using a legitimate front business, in this case, the White House to enrich the family. #TheDon #Cohen https://t.co/U3SyJuWpir RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @Rep_Hunter @RBReich @KillerMike + Ethan Hawke on #RealTime @HBO! https://t.co/mwGb… RT @MGMResortsIntl: .@BillMaher returns to @TheMirageLV on May 18 &amp; 19! Don’t miss out. 🎟️ available: https://t.co/czWTuhlHDJ https://t.co/… RT @RealTimers: FRIDAY: @BillMaher welcomes @Rep_Hunter @RBReich @KillerMike + Ethan Hawke to #RealTime @HBO! https://t.co/xXTDeoDqva https… The presidency has really opened our eyes as to who Trump is - I always thought he was an egomaniac, a blowhard, etc but now we see he was always a thug, a cheap crook, a hood. And his fans love him more... When will liberals learn that barking at nothing makes people not want to listen when you actually have something to say? #IFeelPretty #SJW https://t.co/xp5vfuviCa Trump has two new best friends: Rudy Giuliani and Kanye West. It's like he joined a new dating site OkStupid. https://t.co/DxK90m3hyQ RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @jmeacham @MichaelDTubbs @sallykohn @GenMhayden + @MattWelch on #RealTime @HBO! htt… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @jmeacham @GenMhayden @sallykohn @MattWelch and Mayor @MichaelDTubbs on #RealTime + #R… The thing about #KanyeWest is, u don’t know if he’s trolling or just off his meds - Trump says there are good people on both sides of Kanye’s head. #TrumpMacron could not keep their hands off each other this week. At one point I thought Trump was going to take him furniture shopping. https://t.co/YZp1fBGlU7 .@RoseanneOnABC if in the next six months you don’t see Trump’s magic starting to work for you, if you’re still trading pills and driving an @Uber, wouldn’t the more realistic plotline for Season 2 be your disillusionment with Donald Trump? https://t.co/dB3dZr2urV RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @RonanFarrow @ianbremmer @anamariecox @jpodhoretz + @DouthatNYT on #RealTime @HBO!… RT @RealTimers: FRIDAY: @BillMaher welcomes @RonanFarrow @ianbremmer @anamariecox @jpodhoretz + @DouthatNYT to #RealTime @HBO! https://t.co… #KanyeTrump #TBT https://t.co/QIEldY2YOg \"In order to be able to think you have to risk being offensive.\" -@JordanBPeterson https://t.co/DLoD0ef9nJ Michael Cohen famously said 'I'd take a bullet for Donald Trump.' Well, now that he's looking at prison time, we'll see if he's willing to take a dick. https://t.co/kx9iyiygyY We love #weed the way Republicans love their guns. Republicans run on ‘They’re coming for your guns!’ We need to talk about weed that way and turn potheads into single-issue voters too. #BlueWave #Happy420! https://t.co/chg1lTjtXy RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @MichaelAvenatti @JordanBPeterson @JayInslee @FrankBruni + @AlexWagner on #RealTime… It’s 4 20 ON 420 - what should we do??!?! Trump calls missile strike 'a big successful hit' - nothing mob boss about that. Claims 0 civilian casualties; Syria says 3 injuries, which makes Syrian gas plants safer than Coachella. RT @RealTimers: FRIDAY: @BillMaher welcomes @MichaelAvenatti @JayInslee @alexwagner @FrankBruni + @jordanbpeterson to #RealTime @HBO! https… I hate to break it to you, but no matter how #woke you think you are, you’re tolerating things right now that will make you cringe in 25 years. https://t.co/PcaEMDhKes I don't want to say this raid is meant to distract from Trump's other problems but it's called #OperationDesertStormy. #Syria https://t.co/DDzumZiXpx RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @BrianSchatz @JasonKander @mayawiley @jonathanchait + @Andy on #RealTime @HBO! http… RT @RealTimers: FRIDAY: Senator @BrianSchatz, @JasonKander, @mayawiley, @jonathanchait + @Andy will join @BillMaher LIVE on #RealTime @HBO!… Everything happens in this country now because the president of the United States saw something on Fox News.  Immigration '#Caravan' #FoxNews #FearPorn https://t.co/lSPifjsbVw Here's a crazy idea, don't give the teachers guns, give them a living wage. #TimesUp #PencilsDown #PayOurTeachers https://t.co/Qyqw5u3Gw7 RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @GeraldoRivera @hmcghee @MaxBoot @EliotSpitzer + @LouieAnderson on #RealTime @HBO!… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @GeraldoRivera @hmcghee @MaxBoot @EliotSpitzer + @LouieAnderson on #RealTime @HBO! htt… Happy April Fool's Day! I mean, Easter! Hey, wait... https://t.co/3sih74O5mO When the college kids start throwing up all over Mexico on Spring Break, you know the Mexicans are thinking, \"Yeah, you're not sending us YOUR best either\" Michele Obama wanted us to lose weight by eating better - Trump has a different method: make us picture him having sex. First Karen McDougal this week, now Stormy Daniels - poor Anderson Cooper hasn’t been made to think about pussy this much his entire life! if you think its bad now...Bolton reportedly will \"clean house\" of those disloyal to Il Duce, including HR McMasters holdovers, ie, last adults standing. BTW, HR McMasters also the name of the bar I got drunk at on St Patty's Day. RT @AMarch4OurLives: Watch LIVE as we #MarchForOurLives in the streets of Washington, DC to demand that we end gun violence and mass shooti… All the news this week about the Trump family affairs &amp; porn stars. This must be the breakdown of the family that conservatives warned us about if we allowed gay marriage. https://t.co/OPehf3s8E1 Republicans have to stop pretending that they hate it when celebrities give their political opinions. Please, you’re the party that made Ronald Reagan president! @GOP @FoxNews @NRA https://t.co/xjJnf1V1xy RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @MitchLandrieu @GinaEPA @monacharenEPPC @chrislhayes + @MalcolmNance on #RealTime @… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with NOLA Mayor @MitchLandrieu @chrislhayes @monacharenEPPC @MalcolmNance + former @EPA adm… Wow, when I read about Trump's plan to execute drug dealers today, I said to myself \"Today he became the president.\" Of the Phillipines The shake-ups at The Trump White House and Casino have just gone into overdrive. Next week he will be replacing Jeff Sessions with Matlock. #NotNormal #TrumpCabinet https://t.co/drOH3mlk0x The @DNC are to political courage what Velveeta is to cheese. https://t.co/HizeYRY6m0 RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @BetoORourke @PeteDominick @Nayyeraoar @Andrewrsorkin + Billy Bush on #RealTime @HB… I filled out my March Madness bracket! My final four are Mnuchin, Mattis, Pruitt and Perry - what's yours? RT @RealTimers: FRIDAY: @BetoORourke @andrewrsorkin @PeteDominick @nayyeroar + Billy Bush join @BillMaher for #RealTime @HBO! https://t.co/… Mr. #MartinShkreli looks to me like a kid who grew up bullying on line and is now finding out, Oh there’s a non-virtual world out there where there are consequences I filed this one under it's so crazy it just might work. Rocket man and Rainman, are mirror images. They both have the same interests: flattery, celebrity, tyranny.  #TrumpKorea https://t.co/DsBBgPPog5 RT @RealTimers: No, @KathyGriffin will not be decimated. Watch her #RealTime interview with @BillMaher: https://t.co/rTQ35E3Pnl America is finally getting it: prayer doesn't work. Because if it did, every drug test would come back clean and there'd be no need for the morning after pill. #ThoughtsandPrayers https://t.co/KQSw7xcCz9 What’s happening? I’m on my way to Vegas, that’s what’s happening! Tonight and tomorrow night at 10 @TheMirageLV ! I better hurry! RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @kathygriffin @EWErickson @ananavarro @traecrowder + @bariweiss on #RealTime @HBO!… RT @kathygriffin: I'll be on @RealTimers with @billmaher tonight! Here's a clip from one of my previous appearances....I was a single woman… Saw Jeff Sessions in California and it made me think of this. #RacistElf #StatesRights https://t.co/W0dsjW6Ooz RT @RealTimers: FRIDAY: @KathyGriffin @ananavarro @traecrowder @EWErickson + @bariweiss join @BillMaher LIVE on #RealTime @HBO! https://t.c… Wait, now Gary Cohn is gone too? I can't keep up - the last time this many people fled the White House the British were burning it in 1814. Was in Palm Beach yesterday. Where’s an egg when u need one? https://t.co/dWxjKaOsJL Wow, Oscars are different this year. On the red carpet they’re asking the men “Who are you fearing?” \"We want Americans to stop being afraid of demanding our politicians to take action. They work for us, we don't work for them.\" - @Cameron_Kasky  @DavidHogg111 @AMarch4OurLives #NEVERAGAIN #NRABloodMoney https://t.co/wCEZhnCf9Q Wonder why Fake News resonates so much with Trump fans – because so much of it is fake. Just nonsense made to keep you perpetually offended with an endless stream of ‘controversies' that aren’t controversial. https://t.co/pog5OO4ttL It is ironic that Trump was so dependent on Hope Hicks because his whole presidency was about giving hicks hope. #FatNixon #TrumpCrimeFamily https://t.co/k6x4MKSJeH RT @RealTimers: FRIDAY: @BillMaher is back with @davidhogg111 @cameron_kasky @EricHolder @jmeacham + @amychua on #RealTime @HBO. https://t.… Goodbye, Hope Hicks – you will always be an #AssKisserOfTheMonth. https://t.co/HzjgM8QLbl RT @ACLU: We’re almost there: We need just one more senator to restore #NetNeutrality. Call your senators today and push them for #OneMoreV… RT @AMarch4OurLives: On March 24 we will take the streets of Washington DC and our communities across the country to #MarchForOurLives. Sig… All these children speaking out is a powerful weapon that we haven't had before. #GunViolence #SchoolShooting #GunControlNow https://t.co/A1qoQ0GmnK Glad another shitty week in America is over. What did we learn? You can't arrest someone for being mentally ill. You can't even impeach them. Someone has to explain how, in the age of #MeToo, the #1 movie in America is about a woman on a leash. #FiftyShadesFreed https://t.co/fWa9E3WaHk Trump said, ‘So many signs that the Florida shooter was mentally disturbed.’ Yes, we saw. He was wearing your ‘Make America Great Again’ hat. #GunReformNOW https://t.co/Oq5UytHip8 RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @AnnaDeavereS #FranLebowitz @SalmanRushdie + former Mexican President @VicenteFoxQu… RT @CNNnewsroom: \"I just spent the last two hours putting the burial arrangements [together] for my daughter's funeral...President Trump, p… Heard the word “tragedy” 100 times already about the school shooting - not really, by the classical definition: tragedy is fated and inevitable. This isn’t inevitable. This is America. If Trump gets his #MilitaryParade he will have 9 out of 10. #DictatorChecklist #TanksInTheStreets https://t.co/NjXa1xD1S9 RT @RealTimers: FRIDAY @ 10PM: @AnnaDeavereS #FranLebowitz @SalmanRushdie + @VicenteFoxQue join @BillMaher LIVE on #RealTime @HBO! https://… Scary stuff today from all our intelligence chiefs about Russia ratfucking the next election; even Republicans are worried - if Russians can get access to our polls, that means black people could be next A police state is the safest place to live but you're in a police state. Do we want to do that with love? w/@BariWeiss #MeTooMovement #ValentinesDay https://t.co/JeeXgnB1Ga RT @NamiKim_DogsSK: What is happening behind the scenes of #PyeongChang2018\n#Olympics #SouthKorea\n\n17,000 #DogMeat #Farms and restaurants i… Just found out about Ron Jeremy accused of groping at the porn awards. Devastating. I can't watch any of his movies now. I just hope Christopher Plummer is available for reshoots. Trump Is really a costume away from a full-on dictator. #MilitaryParade #TanksInTheStreets https://t.co/GtVtjMh5ap If you can’t read @realDonaldTrump, you can’t be president. #StableGenius #NobodyKnew https://t.co/ubwsNFMwbO RT @bariweiss: Hanging with a very chill @billmaher and the effervescent @AprilDRyan. https://t.co/7ah182Obow I love this “Haiti Is Great Already” tee supporting @JPHRO and @ArtistsforPeace. Get yours here: https://t.co/DxSc2X11A1 https://t.co/OOd5AJivbq RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @RepAdamSchiff @AprilDRyan @RWPUSA @johannhari101 + @bariweiss on #RealTime @HBO! h… RT @RealTimers: FRIDAY @ 10PM: @RepAdamSchiff @AprilDRyan @RWPUSA @johannhari101 + @bariweiss join @BillMaher for #RealTime @HBO! https://t… Being that Donald Trump is so in the doghouse with his wife. We suggested a few cards to help him make up with Melania. #FreeMelania #StormyDaniels https://t.co/VsOP0P8ZNa RT @RealTimers: Ask and you shall receive. #SuperBowl #NewRule #FlyEaglesFly https://t.co/oD4NAelEU4 Patriots, geez. What fuckin losers. This Nunes memo is not an intelligence document. It’s a Facebook post you’d briefly skim before clicking 'unfriend.' #FatNixon #RussiaCrimes\n#TrumpCrimeFamily #YoMemoJoke https://t.co/ANRFD7zCmT Dear #Trumpsters: Everything that wall represents – the bigotry, the racism, the ignorance, the paranoia is already in your heart. The wall has been inside you the whole time. https://t.co/luJxMxS1a0 RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @RichardHaass @davidfrum @donnabrazile + @Scaramucci on #RealTime @HBO! https://t.c… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @RichardHaass @davidfrum @donnabrazile + Anthony \"The Mooch\" @Scaramucci on #RealTime… I remember ranting about a #SlowMovingCoup before the election - you know, back when the FBI was Trumplandia vs its present Berkeley-esque profile. But what are we watching but that? So excited that one week from now the super bowl will - oh, gotta go the pre game show is starting. Some funny signs from the Women's March that none of the networks could show. #WomensMarch2018 #TheResistance https://t.co/JQkDaLYIxf Trumps wall is kind of more valuable to him as an idea than a reality. Like his marriage. #Stormy #Evangelicals  #Mulligan https://t.co/FXagrsDY08 February is Black History Month, or as Trump likes to say, All Months Matter. https://t.co/h6F3GFluih RT @RealTimers: #StartTheClock: @BillMaher is LIVE with Roger McNamee (@Moonalice) @RepRoKhanna @michelleinbklyn @TheRickWilson + @ZooeyDes… RT @RealTimers: FRIDAY: Roger McNamee (@Moonalice) @ZooeyDeschanel @RepRoKhanna @michelleinbklyn + @TheRickWilson will join @BillMaher LIVE… I think this deal happened cuz Repub and Dem lawmakers can bond on one thing: they hate Trump. They don't like each other, but now they're parents who share custody of a stupid fat kid. “There is something in the book that I was absolutely sure of but it was so incendiary that I just didn’t have the ultimate proof.” - @MichaelWolffNYC #FireAndFury #TrumpAffair #RealTime https://t.co/3H80pEIjfX Donald Trump, only man ever to pay a porn star to keep her mouth shut. #StormyDaniels  #ShitholePresident https://t.co/JfM6o82WtS Giving up on the idea that even bad things have degrees. That is as dumb as embracing the idea of alternative facts. #MeToo #MeCarthyism https://t.co/tKfD1Nok1e RT @RealTimers: #StartTheClock: A new season of #RealTime with @BillMaher premieres now with guests @MichaelWolffNYC @larrywilmore @sullydi… Excited to be going back to work tonight! And with govt shutdown looming! All vital services of Trump admn will stop: rallies in red states, fake news awards, payoffs to porn stars... RT @projectchimps: It happened today! Research chimpanzees who have spent their entire lives in captivity got to go outdoors in a forested… With Donald Trump in the White House, there really is no vacation anyway – as my father used to say, as long as you’re gonna pull your hair out, you might as well do it publicly. Can’t wait to get back!! https://t.co/0ujyqkDjRc A prez shld really check where his own country is in the rankings for literacy, infant mortality, life expectancy, infrastructure, income inequality, percentage of women in govt, etc before saying who's the shithole country... To those who say 'Pence would be worse' - have U read #FireAndFury ? The Trump presidency is a revolver with 4 chambers. We know one was empty because we got thru 2017. U wanna keep playing Russian (ha!) Roulette? These New Years Hawaii trips are getting weird - Saget, forgive me! https://t.co/UgehBTmIUv Two young comics on the road, 2018. https://t.co/YZORHxKWBn Happy new year from Hawaii everybody! Thanks for following me on this thing! https://t.co/lcEQhIYEqA Off to Hawaii for the 7th annual!!! Is this the year i never return?? RT @RepDonBeyer: 1: This isn’t how climate change works.\n\n2: We weren’t paying trillions of dollars. You didn’t understand the Paris Agreem… My new year's resolution is to honk loudly at people who think they can safely text/look down at phone WHILE driving i e while the car is moving! #YoureNotThatGood Merry Happy everybody! Let's look on the bright side: on Inauguration Day, did you think we'd make it to Xmas? It seemed less likely than a virgin birth, to take an extreme example (winking emoji) America’s real religion is still greed. #Resist #Materialism #MerryChristmas https://t.co/oUjyRGy9y8 For the kids. #MerryChristmas #GlobalWarming! https://t.co/BLrqep4IK3 Well, they did it. Finally, someone had the courage to stand up for America's forgotten corporations. Jk - Fuck you, assholes, hope you choke on it. Can't wait to get back! New episodes begin January 19, 2018 at 10PM on @HBO https://t.co/RANxLx5Aip RT @tmorello: IMPORTANT: The FCC just voted to kill #NetNeutrality but we can still overturn them with a Congressional Resolution of Disapp… Thanks to everyone who helped support @ProjectChimps this holiday season! https://t.co/0neuOafBFd Still giddy over last night's victory in Alabama! Hoping Democrats have learned a valuable lesson: anything is possible when your opponent fucks children! Man, that #RoyMoore is really doubling down in Alabama - what kind of slogan is \"Make Puberty Great Again\"? Isn't it weird Trump's gal Friday is Hope Hicks and his whole presidency is about giving hicks hope. I gotta give Trump this: he gives me a genuine LOL almost every day. \"Xmas is back, bigger and better than ever.\" U can't write that kind of comedy. I know he's done a 1,000 crazier things, but taking credit for Xmas? That's a special kind of nuts. I read that Congressman #BlakeFarenthold bought the domain name 'https://t.co/gGi1nJ9InH' in case it, sometime in the future, you know, took off. Can we go back to when guys used to just get caned on the senate floor? Dumping Tillerson so we'll have \"Russia is a hoax\" people at State and CIA, AND passing tax cut for the rich on same day...I think that's what porn stars call \"DP\" Republican tax theory is always, the only way to get $ to middle class is give it to the rich FIRST. We'd love to give U this glass of Tang, so we're funding this rocketship to the moon. Watching Trump sell his tax plan - 'I don't benefit, believe me' - I know I'm not supposed to call Trump fans stupid, but if you believe the lies of the world's most obvious, inveterate liar...what word should I use? Help my friends @projectchimps on this #GivingTuesday. 10 new chimps coming in December with our help!   https://t.co/IHH7vnB9GW https://t.co/TxmhSqiJ4p #WikiLeaks @DonaldJTrumpJr. #Collusion https://t.co/OhE8cV8Xr4 Happy #Thankshallowistmas! https://t.co/41AZ3kQuNz \"The backlash we're seeing now with sexual harassment &amp; everything is the reaction to Trump being the pres. of our country.\"-@chelseahandler https://t.co/Ep9ypZWhXS This \"Al Franken groped Arianna\" story in the NY Post while promoting a sketch on my old show is so ridic and such an insult to any real victims. Low even for you, Post. Al Franken did a bad thing &amp; the condemnation has been universal, which he deserves. But he doesn’t deserve to be lumped in with Roy Moore. https://t.co/vCmeJcEIrP Since Trump is truly the Ebenezer Scrooge of our time. Angry, rich, &amp; hard to look at. What would his life be if he wasn't such a shithead? https://t.co/L1782ptbhN RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @billmckibben @chelseahandler @carlbernstein @rtraister + @maxbrooksauthor for the… RT @RealTimers: FRIDAY: Join @billmaher @billmckibben @carlbernstein @rtraister @maxbrooksauthor + @chelseahandler for the #RealTime season… https://t.co/mG4489mFT8 Mitch McConnell says he believes #RoyMoore's accusers - shouldn't someone ask him why he doesn't believe Trump's? This latest #RoyMoore accuser is one of the most credible witnesses I've ever seen. For one thing, she describes his penis down to the little cowboy hat. \"What happened was our side showed up. And that has to be our mantra for the next 360 days.\" -@MMFlint on 2017 Gubernatorial Elections https://t.co/slZ6lgBKWn The one big difference between Democrats and Republicans: We arrest our alleged rapists, they elect them. @realDonaldTrump @MooreSenate https://t.co/mXdVAinf1i They call @JaredKushner Trump’s 'Boy Wonder' because, what anyone sees in him, boy... really makes you wonder. https://t.co/yqgqAWalZ3 RT @RealTimers: #StartTheClock! @BillMaher is LIVE with @donnabrazile @HardballChris @MMFlint + @SarahKSilverman on #RealTime @HBO! https:/… RT @billyeichner: THE PRESIDENT OF THE UNITED STATES HAS OVER A DOZEN SEXUAL HARASSMENT ACCUSERS AND NO ONE SEEMS TO CARE. SARAH HUCKABEE S… RT @RealTimers: FRIDAY: @donnabrazile @HardballChris @MMFlint + @SarahKSilverman join @BillMaher LIVE on @HBO! https://t.co/fz8jFetb0f About last night: \"This is not the end, it is not even the beginning of the end. But it is perhaps the end of the beginning.\" RT @rbpconcerts: Pre-sales for @BillMaher 2018 Northern California shows all start NOW! Use code ITMFA to get tix early! Details @ https://… Bernie ppl are rightly angry at election rigging! Looks like a civil war in the Democratic party - and the loser gets the Democratic party. Don't forget to set clocks back so we get an extra hour of laying in bed, staring at the ceiling and wondering how everything turned to shit Mark Halperin used to rub his erection up against women in the office. Like he's a horny spider monkey who dabbles in political analysis. https://t.co/YysycToNib Trump has left the country. I feel lighter already. This must be how parents feel when they send their kids off to summer camp. #TrumpAsia https://t.co/uveS4s4rhC RT @RealTimers: #StartTheClock! @BillMaher is LIVE with @ColJackJacobs @robreiner @cbellantoni @realJeffreyLord + @gcaw on @HBO! https://t.… RT @RealTimers: UPDATE: @BillMaher will be LIVE FRIDAY with @ColJackJacobs @robreiner @cbellantoni @realJeffreyLord + @gcaw on @HBO! https:… Trump so anxious to distract from Russia he took a page out of Weinstein's book and jacked into a potted plant. Then realized it was Jared.. Happy #Halloween2017! #ScaryPoliticians https://t.co/PXgI2l0jiE I can't wait for the indictment tomorrow - if its Jared or Don Jr. President Crazypants is gonna go nuts. I predict he will fling his feces. https://t.co/MbMPAnaGar RT @MMFlint: 1) You must have my smash hit of a Broadway show confused with your  presidency-- which IS a total bomb and WILL indeed close… Having an Ebola monkey as president is bad, but damn it makes for fun shows.We had a blast last nite @TheMirageLV doing it again tonite 10pm Trump released the #JFK assassination files this week &amp; just as @FoxNews suspected they only raised more questions about Hillary's e-mails. https://t.co/sjvtCEMsvD Telling people not to protest, not to question authority, is not American. #FetishPatriotism starts with goosebumps, and ends w/goose-steps. https://t.co/KF8EQgjty3 RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @WoodyHarrelson @VanJones68 @woodruffbets @DavidAFrench + @JoyVBehar on @HBO! https… RT @DEADLINE: Jon Liebman: Donald Trump Auditioning Federal Prosecutors In Alarming Reality Show Twist – Guest Column https://t.co/j1Gng9P1… There are no sorry's in Trump World. #GoldStarWidow #Trump w/@MargaretHoover @JamesCarville &amp;  @EWErickson https://t.co/18FVZqkTm2 RT @RealTimers: FRIDAY: @WoodyHarrelson @VanJones68 @woodruffbets @DavidAFrench + @JoyVBehar join @BillMaher LIVE on @HBO! https://t.co/wvd… I’ve heard conservatives say it took a village to help Harvey Weinstein. But didn't it also take a village to elect the other sex predator? https://t.co/oJLjfOdd3E If Russia is going to keep attacking America, then America really should fight back. #RussianTrollArmy #TrumpRussia #RussianPropaganda https://t.co/egWU6mPEmv The right-wing media frenzy over Harvey Weinstein. I tell you the men of @FoxNews are like... \"Those of us who are left here are outraged!\" https://t.co/FFLmYlje3G RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @janicemin @EWErickson @MargaretHoover @JamesCarville + Daryl Davis on #RealTime @H… I hope President Dumbass thinks he won his battle with war widows so we can move on - cuz his next step is to have Pence walk out on funeral RT @RealTimers: FRIDAY: @BillMaher is back with @janicemin @EWErickson @MargaretHoover @JamesCarville + @ACDocumentary's Daryl Davis! LIVE… Sex abuse, Russian meddling, cyber-bullying - the list of things our president can't speak about because HE DOES THEM just keeps growing... \"Even Mel Gibson said 'Oy gevalt, what an asshole.' \" - @BillyCrystal #SeanSpicer #Emmys https://t.co/mL4U3dnLE1 Mahalo Hawaii! Tickets are on sale NOW for my New Year's Evening of Comedy with @BobSaget &amp; @IamReggieBrown! @ https://t.co/COhAaj5wzV https://t.co/mJfnuFyPWZ The only qualification that matters to Trump are people who are loyal to him. #TrumpCabinet #SuicidePact w/@SteveSchmidtSES @Olivianuzzi https://t.co/s8hMU68Gu7 https://t.co/VfNXrtAx6h Drugs &amp; Addiction with the great @rustyrockets https://t.co/rpMFj2eagm https://t.co/ZVVI9Hse6U Democrats, this movement to childproof the world has made Republicans the party of freedom and Democrats the party of poopers. #HOTCARSAct https://t.co/9E1NojWRdj I'm so sick of “thoughts and prayers” about gun violence. Thoughts and prayers are the republican way of saying tough shit. #VegasShooting https://t.co/FneHC5sGLe If you can’t see the difference between the way blacks &amp; whites are treated w/guns in America then I think there is a little racism in you. https://t.co/USRUaJ1iU6 RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @BillyCrystal @Olivianuzzi @SteveSchmidtSES @HFord2 + @rustyrockets on @HBO! https:… RT @BillyCrystal: Looking forward to talking with @billmaher tonight on HBO RT @RealTimers: FRIDAY: @BillyCrystal @HFord2 @Olivianuzzi @SteveSchmidtSES + @rustyrockets join @BillMaher LIVE on @HBO. https://t.co/aFki… Trump can’t demand that everyone stand for the flag if he colluded with a foreign Gov't to subvert the very democracy that flag represents. https://t.co/6uomqdqLKQ Trumps going to drain that swamp. He's going to drain the Treasury first, and then he will get around to the swamp. #MAGA #PresidentCrayCray https://t.co/x3FGjDsoh8 RT @RealTimers: \"If you're going to read one book, read this one.\" – @BillMaher #Drawdown #ClimateChange https://t.co/9HfNLqeV8i RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @tmorello @AprilDRyan @jheil @KBAndersen + @PaulHawken on @HBO! https://t.co/fToGTN… Shout out to my friends in Toronto! Hillary drew 5,000 there yesterday! By god she’s gonna find a country that will elect her to something! RT @RealTimers: FRIDAY: @PaulHawken @tmorello @AprilDRyan @jheil + @KBAndersen join @BillMaher LIVE on @HBO! 👉 https://t.co/fToGTN6BLj http… You reach a point in your life where you just don't give a shit about the things you didn't get to. #BucketList https://t.co/AeAXzGhgG1 Trump fans Ryan, Belichick now saying they're pissed at him, Why not take it a step further to \"Huh, maybe I'm just an idiot about politics\" Trump voters were played for rubes by the ultimate fast-talking city slicker. You didn’t make #MAGA you enrolled America in Trump University https://t.co/NRjCGAfvRW Robert Mueller says he is very close to figuring out who in the Trump campaign was not a Russian spy. #TrumpRussia #MuellerTime! https://t.co/V9qpUOM15H RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @BarneyFrank #MartinShort @crampell @TheRickWilson + #BobCostas on @HBO! https://t.… Oh, so what that Trump went to the U N and discussed Nambia, a country that doesn't exist. How many know that Nambia's capital is Covfefe? Liberals still need to learn the difference between an imperfect friend and a deadly enemy. w/@SalmanRushdie #FranLebowitz #Snowflakes https://t.co/jBrLf3Qem5 RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @BarneyFrank #MartinShort @crampell @TheRickWilson + #BobCostas on @HBO! https://t.co/… https://t.co/tasQn4yKCw I see Trump fans mad at his DACA reversal still burning their MAGA hats and posting the video on line - its called The Douchebag Challenge! We’ve weathered Hurricane Harvey and Irma and now we're back to worrying about #ShitstormDonald. #AmnestyDon #BurnYourMAGAhat! https://t.co/FlnnhEYOUG We will defend our way of life here in Calif. &amp; what we believe in. Like #SanctuaryCities &amp; #CleanAir, #LegalPot, #Obamacare #StateofWomen. https://t.co/zgpRX9KwbK RT @RealTimers: #StartTheClock ⏱️ @BillMaher is LIVE with @BretStephensNYT #FranLebowitz @SalmanRushdie + @TimGunn on @HBO! https://t.co/U7… Someone has to tell the makers of the movie \"#IT\" about a painted-up clown who scares the shit out of everybody, You're a little late! https://t.co/lEk4V6v5FD People who watch @FoxNews​ don't even know the Russia story even exists. w/@secupp &amp; @adamgopnik #RussianTrollFarm https://t.co/yNowLGBZSm RT @RealTimers: FRIDAY: @BretStephensNYT #FranLebowitz @SalmanRushdie + @TimGunn join @BillMaher LIVE on @HBO! https://t.co/KxlMmX5PPn Looking at the devastation AGAIN, its obvious nature is sending us a message: and that message is, Don't throw your vote away on Jill Stein Last night at @TheMirageLV was so much fun - tonight's show at the very adult time of 10 pm - love that too, comics get up at noon! We are thinking about Florida right now. They are looking at a Category 5 Liberal Hoax. #Irma  #ClimateChange. #ActOnClimate https://t.co/Zani7Qt1tz F**k fees! When did the American business model switch from selling a product to tricking consumers who don't read the fine print? https://t.co/99cwAVkKj4 RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @kenbone18 @secupp @adamgopnik + @XiuhtezcatlM on @HBO! https://t.co/spGyoaU63P htt… Scariest words in pol:\"I'm Hillary Clinton and I've been thinking what I'd do different if I ran again\" Hey, I'm at @TheMirageLV Fri &amp; Sat! RT @RealTimers: Get the scoop on this Friday's #RealTime guests @ our blog: https://t.co/spGyoaU63P https://t.co/sCxPnqCfEz \"If you're not outraged, you're not paying attention.\" - #HeatherHeyer #Charlottesville w/@RevJJackson @RPCoalition https://t.co/MNADTJKrhj RT @RealTimers: Thank you to everyone @HBO for keeping us on the air through 2020 (assuming there's still air in 2020)! https://t.co/Eu8wQ1… #StockTheSwamp w@StevenMnuchin1 #FortKnox #Eclipse2017 #TrumpsAmerica https://t.co/8DAurdRxxx RT @MMFlint: Here's what it looks like now in Trump's America. The authoritarian police state he so loves is now everywhere.  Please watch… Much talk today of erosion in Trump's base - finally! He's even started to fall among guys who use backseat of their truck for a trash can \"Trump is the Typhoid Mary of stupid.\" -- @PaulBegala w/@nayyeroar #TrumpEffect #HurricaneHarvey https://t.co/4BjmmLEwdl We did not elect a swamp-draining reformer. We just gave our PIN number to a Nigerian prince. #AdolfPussyGrabber https://t.co/rXy3OgPcmA #HurricaneHarvey is Trump’s first natural disaster – the others he all caused himself. https://t.co/tVbFCWguth RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @RevJJackson @PaulBegala @nayyeroar @MattWelch + @FrankBruni on #RealTime @HBO! htt… Great time, great show! w/@MMFlint @AriannaHuff #Broadway #TermsofMySurrender #Resist: @Make5calls https://t.co/VOwFtY3joi RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @RevJJackson @PaulBegala @nayyeroar @MattWelch + @FrankBruni on #RealTime @HBO! https:… “I’ve known for weeks that Trump is a terrible president.” - @alfranken #NewsomFranken2020 https://t.co/PW7XQWCqPk Great fun today joining @MMFlint and @ariannahuff on stage in his Bway show, which utterly killed, go see it! https://t.co/o0Fl6nxXmc I'm in N J my home state!My jersey joke: Repubs used to hate Nazis, except Christie: he saw Dunkirk and liked the way they cleared the beach Free speech is under attack from both sides. Trump says '#fakenews' so many times a day it sounds like he has totalitarian Tourettes. https://t.co/W93T2IM13E Speaking of getting rid of racist eyesores, Steve Bannon is out. Trump told him: This bunker is not big enough for the both of us! https://t.co/vyvIbHMs4b RT @RealTimers: #StartTheClock! Populist Hero @BillMaher is LIVE with Sen. #AlFranken @realamymholmes @pennjillette + Lt. Gov. @GavinNewsom… RT @attn: .@Schwarzenegger has a blunt message for Nazis. https://t.co/HAbnejahtl RT @RealTimers: FRIDAY: @SenFranken @GavinNewsom @realamymholmes + @pennjillette will join @BillMaher LIVE at 10PM on @HBO. https://t.co/ff… RT @jonathanschmock: https://t.co/aCNG8udHkl https://t.co/VUchzBw8vE Trump does reverse Hollywood Squares: 1st the real answer, then 2 days later the bluff answer. That way he keeps his fans, and his job. Sad. https://t.co/iVp6pPK7d5 President Shit4Brains just never misses opportunity to do the wrong thing; how do U have such a high batting avg for Wrong? Practice I guess How close does this toddler have to get to the stove before his parents, the Republican party, pick him up? #TrumpApocalypse https://t.co/gq3CvPi2Kb The Republicans aren't the opposition party now they’re the Democrats crazy ex-girlfriend. #TrumpTrolls https://t.co/aCCTUG6dHP RT @RealTimers: #StartTheClock! @BillMaher is LIVE with @RichardDawkins @FareedZakaria @jmeacham + Jim Parsons on @HBO! https://t.co/NYUcit… RT @RealTimers: FRIDAY: @RichardDawkins @FareedZakaria @jmeacham + Jim Parsons join @BillMaher LIVE on @HBO! https://t.co/FwCiXX5OUX RT @aitruthfilm: .@PaulMcCartney, @shailenewoodley, @OneRepublic join us in the movement to protect our home. https://t.co/88SMdJMUHq #BeIn… “In order to fix the climate crisis, we need to first fix the government crisis” -\n @AlGore @ElectoralCollge #BeInconvenient @aitruthfilm https://t.co/5ioKR4SvBQ Wonder what Pussy Riot is up to lately? I just found out! https://t.co/nDo5yOpDtd Of all the people you'd want in a nuclear standoff, Trump and Kim - Fat Man and Little Boy, how ironic - wld have to be last. Here's hoping. Be part of the change. w/@AlGore #ActOnClimate #BeInconvenient @aitruthfilm https://t.co/eqfHQtNhnw #MakeNYLaugh NYC Comedy Fest @NYComedyFest presale Aug. 9th-13th! Use promo code #FNYCF https://t.co/IRTseBdkvY Trump vaca? I mean, he spends all his time golfing, eating cake, watching TV, tweeting stupid shit. What’s a vacation for him? #MuellerTime https://t.co/buZ31HwsPe Clearly, since Trump got elected the term 'Republican principles' no longer has any meaning. @BarackObama (aka @IamReggieBrown) https://t.co/uDkAokPqak RT @RealTimers: #StartTheClock! @BillMaher is LIVE with @algore @KSoltisAnderson @JoshuaGreen @michaeldweiss + @ralphreed on @HBO. https://… RT @RealTimers: FRIDAY: @BillMaher is back with @algore @KSoltisAnderson @JoshuaGreen @michaeldweiss + @ralphreed. LIVE @ 10PM on @HBO. htt… RT @BroadwayReport1: Michael Moore makes Broadway debut to sold-out crowd - Page Six https://t.co/SWgUOqtQqe #Scaramucci - the name even sounds like \"get the hell out of here!\" I picture Tony Soprano putting out the cat - \"Scaramucci, little pussy\" https://t.co/l9Y6JlmF1t Surely someone currently in a health crisis can see how wrong it wld be to repeal ACA and leave other sick ppl without care. #WhinyLittleBitch https://t.co/zS6WuEN9HF I'll be back 2 weeks from tonight, thanks everybody for asking! Scara- who? I know I am. Man, when Donald Trump puts the call out for asskissers, he is not. fucking. around. 32% of Trump fans say: WAS NO meeting w/ Don Jr &amp; Russians, even tho the source is Don Jr! Guys, the call is coming from inside the bubble! Consider for a moment how enormous an asshole Trump must be to make me actually feel bad for an asshole as enormous as Jeff Sessions...wow. RT @MoveOn: .@USCBO score is out: If GOP votes to repeal, 32 million would be uninsured. This is a disaster. #ProtectOurCare https://t.co/S… https://t.co/IJPzB5KQ4q Does Trump have to actually blow Putin? Is that what it wld take?Flagrant D, balls gargling the leader of the Russian Federation? Jus asking When Trump says \"We've added 45,000 mining jobs\" who is that lie for? The miners must know its not true cuz they're not, you know, mining. Trump is bad for life on earth, but comedy? Was off the chain last night @theMirageLV! One more tonight at 10. I love Vegas. RT @TheMirageLV: Get ready to laugh your aces off - @billmaher takes the Aces of Comedy stage this Friday! https://t.co/hSPqDhZXAq https://… RT @AmnestyEU: Today we mourn a human rights giant, #LiuXiaobo. With courage and dignity, he inspired millions in #China and globally. http… Trump is mad his crime family being Russian #Usefulidiots is distracting from his agenda.Also distracting from ice floes &amp; mass extinctions! Good to see Douchebag Von Fuckface Trump on the hotseat; let's hope his brother - say it with me: Thurston Shitbag the Third - is next! Trump's vulgarity is not a shame with his voters. It's a bond. They love that about him. He doesn't make them feel stupid. #SAD https://t.co/QDTWngRHQ3 RT @nowthisnews: Watch the *countless* times Trump and his team denied any collusion or ties with Russia https://t.co/eLlZ7rhvRO RT @SirPatStew: I'm demanding the release of Amnesty International's Director in Turkey. Are you with me? https://t.co/gKzJ2IkNvj RT @SenSanders: Health care is a human right. Its true, Sarah Palin is suing the New York Times for defamation. And TV Guide, because the crossword puzzle is exhausting. This N Korean thing is getting tense! I mean, I think it is, I'm on vaca. The ladies at my nail salon are freaking out, that's what I know! Now that July 4 is over, maybe the Republican murder...I mean, healthcare bill will get done.Mitch McConnell is hoping hotter heads prevail. According to the right-wing spin machine, the greatest threat to America now is that liberals are violent. I thought we were the snowflakes? https://t.co/IyCSh95VpF This is a tough 4th. Can I say for sure the country I love will survive the leader I hate? I cannot. OK, enuf gloom, go blow your hand off! Sarah Palin is suing the New York Times? Wow, somebody tell Katie Couric, she finally named a newspaper! RT @chelseahandler: How ironic that our \"president\" tweets about fake news with a fake fight. RT @attn: Criticizing the President is a right no one should take for granted. -- @chelseahandler https://t.co/IjUQ4mHefM Once again Donald Trump has taught this nation a valuable lesson, you can never be too rich to be white trash. #PresidentWTF #PoopTweet https://t.co/7LBFucx5lY Someone has to tell me how summer can retain its specialness if “stupid season” now runs all year round. #PeakStupid #MakeSummerGreatAgain https://t.co/mRzuLmzvIQ RT @RealTimers: #StartTheClock! @BillMaher is LIVE w/@fakedansavage @MichaelSteele @KattyKayBBC @danabrams + #RichardClarke on @HBO. https:… RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @fakedansavage @MichaelSteele @KattyKayBBC @danabrams + #RichardClarke on @HBO! https:… RT @BraddJaffy: I will never get used to this from the President of the United States. Ever. https://t.co/PknJfy3aQn RT @RWPUSA: No US president before has called the press the enemy of the people. Dictators have said that, but no US president. \"The Voldemort effect speaks to our inability to name and shame... Islamist extremism from the mainstream Muslim community\" - @MaajidNawaz https://t.co/3c64QN7wbU \"If you're not going to tell the truth anyway, you might as will not answer the question.\" -@RWPUSA #TrumpRussia #FollowTheMoney https://t.co/KLEn0utaAN If Trump said \"Obama is hiding under my bed\" and they asked Spicer if that's true he'd say \"I don't know I haven't discussed it with him\" Where's the holiday for single people? We don't have a day, only Happy Hour. Set aside this Sunday to celebrate #IDidntReproduceDay https://t.co/nIsJBxRSq5 The Senate unveiled their super secret health care bill, like me after the show, it was hashed out behind closed doors. #BeholdATurd https://t.co/PllEsmXEvz RT @RealTimers: #StartTheClock! @BillMaher is LIVE with @MaajidNawaz @RWPUSA @WhitfordBradley @biannagolodryga + @SykesCharlie on @HBO! htt… RT @SenSchumer: We live in the wealthiest country on Earth; surely we can do better than what the Republican #healthcarebill promises. RT @RealTimers: FRIDAY: @MaajidNawaz @WhitfordBradley @biannagolodryga @SykesCharlie + @RWPUSA will be LIVE with @BillMaher on #RealTime @H… #FakeNews #BabyGoebbels &amp; Hitler w/Breitbart's editor-in-chief @AlexMarlow and @MalcolmNance, @IanBremmer &amp; @EddieIzzard #RTOvertime! https://t.co/jrJoqJG8zP RT @Fusion: \"No markups, no debate, no public accountability.\"\n\n@CoryBooker explains why the GOP's secret healthcare bill is so messed up.… All we hear from President Man-Baby is “we must put our miners back to work.” No, the jobs we’re losing aren’t in coal, they’re at Kohl’s. https://t.co/n2OvVc7ZzI Special Prosecutor Robert Mueller is so far up Trump's ass he had to ask Putin to scoot over. #ObstructionOfJustice #TrumpRussia https://t.co/ee3VG6G50W RT @RealTimers: #StartTheClock! @BillMaher is LIVE with @AlexMarlow @ianbremmer @MalcolmNance + @eddieizzard on #RealTime @HBO! https://t.c… The Crime is not the leaker, the crime is the crime! @TheDemocrats have to start saying that. w/ @davidgregory @SymoneDSanders @DavidJollyFL https://t.co/CJscLvhtgH RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @AlexMarlow @ianbremmer @MalcolmNance + @eddieizzard on #RealTime @HBO! 🔜 https://t.co… RT @nowthisnews: Republicans are trying to take health care away from 23 million people in secret – and @ChrisMurphyCT is furious https://t… Trump needs more meetings where people take notes. They're called psychiatrists. #TrumpComey #TrumpTapes https://t.co/nQgOF1veAa RT @SenSanders: BREAKING: Senate Republicans just released the schedule of hearings, committee markups and public testimony for their healt… RT @ACLU: Jeff Sessions will testify in an open session tomorrow. Tell your senators to ask the tough questions on Russia. https://t.co/XNf… How does a 36-year-old who’s never worked a job his daddy didn’t buy become the second most powerful man in the America… right behind Putin? https://t.co/fBmMZzBnH0 \"I like your show and I like you. But I think this is a teachable moment, not just to you but to the people who are watching.\" -@icecube https://t.co/qscEBqAu4H RT @MMFlint: Since the London attack Sat night, an estimated 241 Americans have died via gunshot in the US. Not \"BREAKING NEWS.\" https://t.… RT @esquire: Published early from August Esquire: Bill Maher knows exactly what he's doing https://t.co/Kx9HOpBE3M https://t.co/sDHjNBfNIR RT @SethMacFarlane: https://t.co/ZqguelRUR3 RT @GabbyGiffords: Mr. President, every day we are having a gun debate because every day 90 people in our country die from gun violence. Ma… RT @peta: \"He's making dogs sick.\" #RealTime's @billmaher speaks out against @TAMU's horrific dog abuse lab in new PETA ad. https://t.co/Lt… The very last thing I want to hear from this @WhiteHouse is 'His fingers just pressed the wrong button.' #Covfefe https://t.co/WTprEw2OfO .@TheDemocrats need to wake up and smell the asshole. When they go low, they get reelected. #T-Word #TrumpRussia #TREASON https://t.co/mc6zsFgvkI RT @RealTimers: #StartTheClock! @BillMaher is LIVE with Sen. @BenSasse @rtraister @JimVandeHei #EliotSpitzer + @tristanharris on @HBO. http… #ParisClimateDeal Where was all this 'pulling out' when Don, Jr and Eric were being conceived? RT @attn: Even North Korea has signed the Paris Climate Agreement. https://t.co/dpGsQmHJIS RT @SenSanders: What President Trump did today by withdrawing from the Paris Climate Accord is an international disgrace. https://t.co/ZjBM… RT @RealTimers: FRIDAY: @BillMaher is back with @BenSasse @rtraister @JimVandeHei #EliotSpitzer + @tristanharris on @HBO! https://t.co/NEzQ… #NewRule for @TuckerCarlson &amp; @FoxNews https://t.co/P9tHlOvjn4 These leakers need to pace themselves. What does it say when everyone who works in WH needs to call someone and say \"This is nuts, right?\" https://t.co/dyVyBNcnsf Looks like Russia probe getting close to First Family - I mean, the Me-First Family. Jared, U can never be too thin or pretty. For prison. RT @attn: We should stop pretending Mars is Earth's backup planet. -- @billmaher https://t.co/7MxUYtTVd2 Liberals need to learn this lesson before we can win the next election. w/@CornelWest @DavidFrum https://t.co/V2XlcpfW1b Is drinking in the afternoon right for me? #BreakingNewsFatigue #HeDidWhatNow? https://t.co/wFq3FhzUQC In this fight for America, we need to be our own superheroes #Resist https://t.co/m8n67bzedh RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @BorisEP @neiltyson @CornelWest + @davidfrum on #RealTime @HBO! https://t.co/bg2qSL… RT @RealTimers: TONIGHT: @BillMaher is LIVE with @BorisEP @neiltyson @CornelWest + @davidfrum at 10PM on @HBO! https://t.co/WLhOKNTAcA \"How long are you and your fellow Republicans going to defend this #AmericanNightmare?\" - #GOPTownhall https://t.co/opvor8dJUO Please help support these beautiful animals that have already sacrificed so much for us. https://t.co/0rbgXSHuQM https://t.co/HzvFX4Tdya RT @nytimes: What Donald Trump told James Comey about the Michael Flynn investigation, according to a memo Comey wrote https://t.co/fyzPyVu… I remember how they attacked Obama because in the OVAL OFFICE he took off his suit jacket! Yeah, gotta watch what you do in there. Assholes. Someone had to say it. #SAD! https://t.co/RDEm0LsBDW I don't want to say Trump lies a lot, but I see sacks of shit are now starting to distance themselves from him Welcome to Americagua. Would you like a little Banana in your Republic? https://t.co/4csABm8EDX The tycoons of social media have to admit they’re just tobacco farmers in t-shirts, selling an addictive product to children. #BrainHacking https://t.co/fLmMZX55wB RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @RepAdamSchiff @jonfavs @KillerMike @MattWelch &amp; @AnnabelGurwitch on #RealTime @HBO… RT @RealTimers: FRIDAY: @RepAdamSchiff @jonfavs @KillerMike @MattWelch &amp; @AnnabelGurwitch join @BillMaher LIVE on #RealTime @HBO! https://t… Sorry, guys, about not tweeting lately - sometimes the mental patient sends me to a dark place. And the workload! These lies are heavy! \"Sorry Jimmy Kimmel: your sad story doesn't obligate me or anybody else to pay for somebody else's health care.\" - @WalshFreedom #TrumpCare https://t.co/4MZJuER2h8 Support @rush_art @charitybuzz for 2 VIP tickets in LA, @HBO #RealTime. After the show meet &amp; greet. https://t.co/UibsNCG6pg RT @attn: Immigrants are not stealing jobs, they're doing the work no one else will. --@billmaher\nSupported by @HBO https://t.co/4ClDbfngQk Good thing California has Medical Marijuana, cause when the Republicans get rid of Heath Care that’s the only treatment you’re going to have https://t.co/aiSZnTk9sg Liberals, who couldn’t bring themselves to vote for Hillary cause she was the lesser of two evils, quite a bit lesser, wouldn’t you say now? https://t.co/3j3itmHfW8 RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @JohnKasich @mayawiley #PhilipMudd #GeorgePacker + @gabrielsherman on @HBO! https:/… RT @dsmperforming: .@billmaher will bring his “biting wit and humor” to Des Moines on May 7. Tickets still available: https://t.co/vGaElDjc… RT @RealTimers: FRIDAY at 10PM: @BillMaher will be LIVE with @JohnKasich @mayawiley #PhilipMudd #GeorgePacker &amp; @gabrielsherman on @HBO! ht… RT @kylegriffin1: Here's the video: House Dems singing \"Na na na na, Na na na na, Hey hey hey, Goodbye” to Repubs following the health care… RT @attn: Flint residents could lose their homes over poisoned water bills. https://t.co/430ldoAslI https://t.co/pS16HoMitc https://t.co/FaCuCZNkv3 RT @CNN: Bill Maher says he wants Bernie Sanders to run for president again  https://t.co/BFHkkYBpGk RT @CNN: Bill Maher: \"I think we thought we were further along on the woman issue than we are\" https://t.co/ttmMB4tA09  https://t.co/rCrSTG… RT @CNN: Maher: I don’t know why Hillary is coming back; \"She had her turn and it didn’t work out\" https://t.co/My0IM3Fojr https://t.co/oFv… RT @Anonymiss_RV: One of two simultaneous marches here at #MayDayLA, another beautiful day to protest #MayDay2017 https://t.co/s1KCjkOsFF RT @attn: .@billmaher's advice to Democrats: When they go low, go lower. \nSupported by @HBO https://t.co/wSMsSth02g The barbecue I put on to atone for missing show (mechanical, not drugs!) in Jan. In Dallas was a hit! Love u Big D! https://t.co/DWRmctpqw8 Liberals have to stop trying to win over Trump voters with facts. You’re wasting your breath. #TrumpVoters #ChangeAnxiety https://t.co/WelL5xbf2t A 100 days of Trump. It’s like Lent, if we all gave up reality. #WhinyLittleBitch https://t.co/rVAlU9T45q RT @RealTimers: #StartTheClock! @BillMaher is LIVE with @elizabethforma @robreiner @NickHanauer @TaraSetmayer + @ErnestMoniz on @HBO! https… RT @RealTimers: TONIGHT: @BillMaher is LIVE with @SenWarren @RobReiner @TaraSetmayer @NickHanauer + @ErnestMoniz on @HBO! Tag your question… RT @amprog: Trump is speaking at NRA’s annual meeting tomorrow to push the pro-gun agenda. https://t.co/FXYMU0ll7O RT @wmnsmarchla: Join us and @RockTheVote as we honor #MayDayLA 5.1.17 with the start of our voter activation program! #hearourvote #resist… RT @attn: Trump's personality is even more dangerous than his policy -- @billmaher\nSupported by @HBO https://t.co/M8ye9xhdPf .@UCBerkeley used to be the cradle of free speech, and now it’s just the cradle for fucking babies. w/@secupp  #FreeSpeech #FirstAmendment https://t.co/xnPafzX9a2 I don't want to pile on #BillOReilly - he's vulnerable and looking for a job, what kind of asshole would harass someone in that position? Here's a crazy idea if we're going to take up a challenge to overhaul a planet let's start with this one. #EarthDay2017  #SaveEarth https://t.co/MI7xWY8Onh Trump’s “Axis of Redneck\" #StupidSummit https://t.co/lPhT4vh7U0 RT @PaulRieckhoff: .@IAVA fights like hell and wins. We #DefendTheGIBill. And drive overdue change for #SheWhoBorneTheBattle. Join us: http… RT @jonathanschmock: Today's Cartoon: https://t.co/IbtYKH6DTg https://t.co/nsU74HPVrr RT @attn: What if Earth treated us the way we treat Earth? #EarthDay @ZackBornstein https://t.co/y1OzZeT43N RT @RealTimers: FRIDAY: @BillMaher will be LIVE with @HannaRosin @arwaCNN @secupp @DMiliband + @sethmoulton on #RealTime @HBO! https://t.co… Happy 4/20! https://t.co/bv8mgzOOdq RT @RealTimers: Happy 4/20 to all, and to all some good shit! https://t.co/i8Y6VYWKko RT @attn: Donald Trump might be the best con man ever -- @billmaher https://t.co/r8uFthZWBj RT @MatthewESegal: EXCLUSIVE: @ATTN spoke w/ @billmaher for a special State of the Union interview grading Trump's first 100 days: https://… This alternative fact nonsense did not start with Trump. It started a long time ago at the sexual harassment network. #AltFacts @FoxNews https://t.co/u6yAZAtbwG RT @justgrateful: Poor @POTUS\n\n#TaxMarch #Resist #TrumpTaxReturns #TrumpRussia #progressives @WaysAndMeansGOP #Impeach45 #maga\n\nhttps://t.c… https://t.co/yt4jV8cOps I know we're thirsty for non-Trump stories, but #United is part of the \"Giuliani Time\" mentality we've seen among all law enforcement people Now that Assad has learned his lesson and is back to killing the moral, ethical, old fashioned way, Plan B is sending in Jared Rambo style RT @attn: United Airlines' market value took a nosedive today. https://t.co/62blmOGmdw RT @JackSmithIV: This is what the derangement caused by the militarization of our police looks like. https://t.co/NMNjmtWa5c Just finished my show in OK City and for the first time no protest from Westboro baptist church. I'm so insulted. Something I didn't say? Republicanism has become: Looking at any problem and saying, 'What would a dick do?' https://t.co/Po8zmtQ88u Today Republicans got their two favorite things, a right-wing asshole on the Supreme Court and Trump finally blowing some shit up. https://t.co/F6oojN9vgj RT @RealTimers: #StartTheClock! @BillMaher is LIVE with @jelani9 @chelseahandler @tedlieu @ananavarro + @Evan_McMullin on @HBO. https://t.c… RT @realDonaldTrump: AGAIN, TO OUR VERY FOOLISH LEADER, DO NOT ATTACK SYRIA - IF YOU DO MANY VERY BAD THINGS WILL HAPPEN &amp; FROM THAT FIGHT… RT @SenWarren: Changing the rules to jam through a right-wing, corporate-owned judge means the GOP will have to own the Gorsuch Court. RT @RepRoybalAllard: For each $1 white men earn, white women earn 75 cents, black women 63 cents, Hispanic women 54 cents. Let's close the… Man, leave it to a Republican to take something nice like adulterous sex with a teenage hustler and make it gross. I lied, he was the state chair of Trump's Oklahoma primary campaign. How bout some NON Trump news? Oklahoma state senator Ralph Shortey, married Republican w/ kids, was caught in a hotel with a teenage boy! #TrumpRussia w/@RogerJStoneJr https://t.co/u2AV1wmozp See, this is where it gets really scary, when the mental patient starts saber rattling with nuclear powers. Going back to bed... Mike Flynn's thought bubble today: \"Is there such a thing as immunity from plutonium?\" Hey Mike Flynn if you think Hillary's a bitch try Karma. #TrumpRussia #FreeMelania https://t.co/WWW5I1hGfb Without his professional liars and deniers, there’s no Trump. It takes a village to help a man-child stay in power. #WhiteHouse #Enablers https://t.co/Db1y77i3RR RT @RealTimers: #StartTheClock! @BillMaher is LIVE with @RogerJStoneJr @GenMhayden @neeratanden @RickSantorum + @joseiswriting on @HBO! htt… Lock. Him. Up. Lock him up. Lock him up! Lock him up!! LOCK HIM UP!!! RT @PPact: BREAKING: A day after the @WhiteHouse hosted a \"women's empowerment\" summit, @VP cast deciding vote to undermine access to #birt… The NEW Repub healthplan is you're allowed to shoplift while Paul Ryan distracts the pharmacist by saying \"Where's the protein powder, bro?\" https://t.co/yRxy0PWZSp RT @attn: The weather is reaching biblical proportions. -- @algore https://t.co/25ofekzbOf “W/O truth, we don’t have trust. W/O trust, we don’t have the rule of law. W/O the rule of law, we don’t have democracy” -@TimothyDSnyder https://t.co/oTTnxjan5Z Congrats to Ivanka on her new West Wing office/job! Notice FoxNews doesn't say a word when a white girl gets a free government phone? Thinking about yesterday's events: I wasn't gonna lose MY health insurance; a glass bottom boat for me,but for so many those sharks are real RT @JoyAnnReid: .@LouiseMensch said on #RealTime she senses panic in Trumpland. My latest at @TheDailyBeast: drip...drip.. drip... https://… The @realDonaldTrump's approach to healthcare was never going to be ‘repeal and replace.’ It was always ‘bait and switch.’ #DontheCon https://t.co/9XCs9TUZPF Apparently the Republican version of health care was ‘If you like your doctor, go fuck yourself.’ #TrumpCareFail #Resist #TrumpTrainWreck https://t.co/znaJxsxReg RT @RealTimers: #StartTheClock! @BillMaher is LIVE with @mschlapp @LouiseMensch @chrislhayes #MaxBrooks + @TimothyDSnyder on #RealTime @HBO… What a nailbiter watching Repubs with their evil healthcare bill - Paul Ryan had to pull another all nighter! No time to even lift, bro. RT @attn: Marijuana raids kill people. Marijuana itself does not. https://t.co/1eAfaJWNqA RT @SenWarren: The FBI Director testified @realDonaldTrump's campaign is under investigation for collusion w/ Russia. Lifetime court appoin… Trump's face color: even weirder lately, right?What if he started putting stripes on his cheeks like Johnny Depp as Tonto? Spicer wld say... https://t.co/JWtCFgpMLP RT @attn: BREAKING: FBI chief just confirmed there is no evidence of wiretapping Trump Tower. https://t.co/tky0fByeeP .@realDonaldTrump's #FAKENEWS and the erosion of The Fourth Estate w/ @TheLeadCNN host @JakeTapper https://t.co/8wFsXVBWFP All the things said about Muslim Immigrants in America today were said about the Irish when they immigrated to America. #StPatricksDay https://t.co/L6n5A3tISB RT @RealTimers: #StartTheClock! @BillMaher is LIVE with @SenWhitehouse @BarneyFrank @sullydish &amp; @jaketapper on @HBO! https://t.co/a20fs3n1… RT @SmithInAmerica: Trump voter James Walker, 31, from Nashville, says: \"This is the first step: showing up and being honest.\" https://t.co… RT @malonebarry: \"We were the wretched refuse on the teeming shore,\" Irish prime minister says with Donald Trump in the room. https://t.co/… RT @RealTimers: FRIDAY: @BillMaher is back with @SenWhitehouse @sullydish @BarneyFrank + @jaketapper on #RealTime @HBO! https://t.co/50JIDt… RT @attn: It’s official: President Trump wants America to pay for the wall. https://t.co/boZ9viRZ0t \"The level of corruption from the fossil fuel industry that marks this administration is like nothing we've ever seen\"-@BillMckibben #NoDAPL https://t.co/wK10Nmw5ih Trump has already cost the US travel industry $185m in lost revenue. #TrumpSlump https://t.co/oO2mIJWeqT Is everyone hacking and leaking? I think the leaks we should worry about are the ones taken by those Russian hookers. https://t.co/TEVM0qmkBD RT @attn: People are very worried about this temperature trend. https://t.co/8ahlNPPck7 https://t.co/h6YF3wuiVQ Donald Trump needs to release his tax returns. @realJeffreyLord #TrumpRussia #CoverUp #GOP #DoYourJob https://t.co/RD8ZMjO0fa As ridiculous as Trump is, he does come off as an Alpha. That's why he paints his face the color of a baboon's ass.#AlphaPervs #CarlosDanger https://t.co/mSgdOJZZmy RT @RealTimers: #StartTheClock! @BillMaher is LIVE with @realJeffreyLord @billmckibben @JoyAnnReid @brooks_rosa + @SykesCharlie on @HBO! ht… RT @RealTimers: TONIGHT: @realJeffreyLord @brooks_rosa @SykesCharlie @JoyAnnReid and @billmckibben join @BillMaher LIVE on @HBO! https://t.… RT @thehill: Bill Maher: Trump speech \"will fool a lot of people\" https://t.co/iO94qQpn18 https://t.co/vQtMXTlyuQ How bout that Donald Trump tonight! Home run, I say! And so presidential - on the way out, he didn't grab a single pussy! I just saw George Bush give a shout out to atheists!! Oh shit, I'm turning into Trump, tweeting back to the tv Trump is tweeting right now, \"Oscars are rigged. Very unfair!\" Sad. Well come on, Bonnie &amp; Clyde - they ARE robbers. I'm sure these were all good movies but I haven't caught up to most of them. But I saw Bad Santa 2 on vudu last night and it was awesome. Yes! Hollywood gives more awards to the movie about what they do in Hollywood! That'll teach our narcissistic president! Ok but it is a musical where the people know nothing about singing and dancing. It reminded me of Trump's cabinet. Let's not lose perspective, any year you're not in the dead reel is a good year. I'm not seeing enough Jews this year. #OscarsSoGoyish! I think Trump just wrapped up 2020. I feel like even the clip from Manchester by the Sea kinda dragged on Oh it looks all about diversity &amp; inclusion now but u know best picture gonna go to the one about white people singing about Hollywood \"We're going to ask the intelligence committees of the House and Senate to investigate within the special areas they oversee.\" -@DarrellIssa https://t.co/CYHMgVTKaz I hope they give Meryl Streep a Oscar just to hear her shit on @realDonaldTrump again in her acceptance speech. #Oscars https://t.co/4zk9ZgG43T The news media lost the trust of the American people because they became eyeball-chasing, clickbait whores. #FakeNews #AltRight #TrumpTrain https://t.co/yIKjPlYbjt RT @SethMacFarlane: Thanks to the liberals and conservatives on the panel for a fun night on Real Time with @billmaher RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @DarrellIssa #FranLebowitz @SenAngusKing @AsraNomani + @SethMacFarlane on #RealTime… RT @RealTimers: TONIGHT: Rep. @DarrellIssa @SenAngusKing @SethMacFarlane @AsraNomani + #FranLebowitz join @BillMaher for #RealTime! https:/… Communism &amp; @Scientology have a lot in common. #lrh #scam #pts #sp #outethics https://t.co/A6W4m82NkB This is not just a \"Different kind of President,\" as all the @GOP enablers are saying. #TrumpCircus #AgentOrange #TrumpRussia https://t.co/PjI2KFcE4J Just hope all my friends in Sweden are OK - just heard from the president, that's where the Bowling Green Massacre happened! Liberals need to stop taking the bait. #RealTime #FreeSpeech w/ #MiloYiannopoulos @Joan_Rivers https://t.co/FSl9c6Mv3S Republicans say ‘I’m not just gonna stand here and let you run down America,’ well ur standing there now and letting Trump run down America. https://t.co/E7nqcJ4WQH RT @RealTimers: #StartTheClock! @BillMaher is LIVE with #MiloYiannopoulos @larrywilmore @MalcolmNance @JackKingston + @LeahRemini on @HBO!… RT @RealTimers: Many thanks to Penny for helping us out today! She's REAL friendly (just ask @BillMaher) &amp; 100% adoptable from @WagsandWalk… #EmolumentsClause https://t.co/9Oy8gFmYMl @realDonaldTrump w/@AlFranken #RealTime #Resist #Impeach https://t.co/AdMClwztT9 #AwkwardMoments @WhiteHouse https://t.co/3emr0yPKaV RT @CNN: Why can't you cut Trump some slack? \"Because of what he's done! And said!\" @billmaher says https://t.co/tJ99Jwd9TF https://t.co/j1… This Valentine's Day can we please fall in love with knowledge again? #VDay https://t.co/UsmcS0ysEf The people who said Hillary Clinton was 'The Lesser of Two Evils.' Can we get the apology right now? w/@piersmorgan @jimjefferies https://t.co/0FoBHwriP2 We made a list of the crazy, and the lies.@realDonaldTrump https://t.co/Tsc29wRH3G RT @RealTimers: #StartTheClock! @BillMaher is LIVE with @alfranken #JohnWaters @piersmorgan @K_JeanPierre + @jimjefferies on @HBO! https://… RT @RealTimers: FRIDAY: @BillMaher welcomes @alfranken #JohnWaters @piersmorgan @K_JeanPierre + @jimjefferies to #RealTime @HBO! https://t.… RT @attn: #BREAKING: the 9th Circuit Court of Appeals just refused to reinstate President Trump's travel ban. https://t.co/GESpjvciZ0 #DogsAreFamily #KeepThemInside https://t.co/cxJYRURC6O If Trump is gonna go bananas every time someone insults his daughter-wife, it's gonna  - oh, like it wasn't already gonna be a long 4 years RT @attn: BREAKING: San Francisco just became the first U.S. city to offer free community college. https://t.co/KMjjnCD8D1 #Startalk tonight with @neiltyson A Place For Religious Humor https://t.co/HqLPyvRhTg We are never going to defeat terrorism until we reform Islam. And we'll never reform Islam if we can't talk about it. w/@SamHarrisOrg https://t.co/lzwdHrvco6 RT @attn: How newspapers across the world depict President Trump. https://t.co/2p7xrNLlbT https://t.co/MheEFhhAjF This week's edition of He Did WHAT? #RealTime w/@PressSec @realDonaldTrump @TurnbullMalcolm #FreeMelania https://t.co/VqgpFektMW Look at Ryan, conceding right away just like Hillary. Rigged!! Can one of u real Americans lend me an OxyContin? The smile is back on Tom's face, we made the Super Bowl great again. Please, Jesus, let the Falcons pull this out. I don't ask a lot... I can't believe they blew that lead. I blame NFL commissioner James Comey. They just called Pennsylvania for Julian Edelman. Shit! This is looking like Hillary all over again. Ok Lady Gaga, nice job - good to see they didn't take the country ALL the way back. #SB51 Good to see Belichick writing Trump another fan letter on the sideline. Like the way Falcons just ran over these motherfuckers. Gettin excited! Can U blame me? If you like football, and you like Lady Gaga - wait, who likes football AND Lady Gaga? So #NeilGorsuch had a\"Fascism Forever\"club in HS? Conservative humor: I love that the premise is always\"What if I said exactly what I meant\" #Inbrotherhood are playing a team where the owner/coach, &amp; star quarterback all love and support #Trump, so I'd like for them to lose #SB51! https://t.co/gk0IP9jxqF RT @RealTimers: #StartTheClock: @BillMaher is LIVE with @SamHarrisOrg @JasonKander @TomiLahren @TheRickWilson + @MichaelEDyson on @HBO! htt… Are we still toe to toe with Australia? Good! They're wankers. They're drongos. They're crocodile hunters. And some I assume are good people RT @SenWarren: The Wall St bankers may be popping champagne, but Americans haven't forgotten the 2008 financial crisis – and they won't for… Donald Trump is not going to change. The only way you can ever get through to this guy is with flattery. https://t.co/4FaJy9e2Xf Will those who called Hillary \"lesser of 2 evils\"admit how wrong u were? Muslim ban, Betsy DeVoss, Pruit, Perry in charge of nukes...please. RT @SenSanders: Taking on Trump will not be easy. We have to be smart about it and we have to stand together. https://t.co/x0BMtnQssW In the campaign, Trump said our airports look 3rd world! And then he found a way in his first ten days to make them look even more 3rd world Should the party that nominated Trump and Sarah Palin really even get to use the term \"extreme vetting?\" RT @attn: Members of the UK Parliament just condemned President Trump. https://t.co/5sIgVd3UM8 Trump's Craziest Cabinet Pick with @GovernorPerry #Nukes &amp; @BetsyDeVos #Education #BeAfraid https://t.co/SU6G7BFvQ3 #StandUp, Aug. 20 at @TheatreWestbury @ Westbury, Long Island\nPresale: 2/1 @ 10am – 2/2 @ 10pm, Password: SUPERSTAR https://t.co/PAHWwJYSlM https://t.co/0dVrC75f3w RT @Kris_Sacrebleu: Trump’s Executive Orders Were Brought to You by Breitbart \n\nhttps://t.co/40UCWd6lkM \n\n#STOPPRESIDENTBANNON \n\nTrump unhi… RT @attn: #breaking: Federal court halts President Trump’s immigration ban, following widespread protests at airports nationwide. https://t… This week @WhiteHouse will be remembered for \"Alternative Facts.' @SeanSpicer #AltFacts #LIES #ObamasWasBigger https://t.co/rABIXCc76l #Democrats have gone from the party that protects people to the party to the party that protects feelings. #whywelost https://t.co/i3cqnolM7g RT @RealTimers: Let's #StartTheClock on tonight's episode of #RealTime with @BillMaher - LIVE on @HBO! https://t.co/s9yf0ZFIlG RT @RealTimers: TONIGHT @ 10: @RichardHaass @JohnAvlon @EvaLongoria @GroverNorquist and Rep. @TimRyan join @BillMaher LIVE on #RealTime @HB… RT @EricLiptonNYT: https://t.co/8OuePjiiPy This is, pure and simple, #GovtByBrainfart. I wld need 6 hours on tomorrow night's show to cover all the madness that went on this week. RT @BulletinAtomic: Read the 2017 Doomsday Clock Statement: https://t.co/0tAZlY96Xw \n#DoomsdayClock https://t.co/exqw429cdM RT @BiologistDan: Yesterday, @BadlandsNPS was censored for tweeting about #ClimateChange. RT to keep #Science facts alive. #ThankYouTrump f… Chuck Todd: \"Alternative facts aren't facts, they're falsehoods\" -Yes! Let that be the north star for media. #AlwaysBeCallingOut on bullshit Circuses should have died years ago. #AnimalRights https://t.co/iRvElZr3pa Dear friends who came to the Music Hall at Fair Park last night in Dallas -  https://t.co/J1Bfqn54G8 Just got word due to mechanical plane issues will miss show tonight at Music Hall in Dallas. I am deeply sorry and will return - forgive me! If anyone thought Trump wld lose his reality show worldview, think again. Message so far: \"I'm not here to make friends.\" And he's not. Kids, don’t do heroin, it’s a gateway to being a Republican. https://t.co/hhYqxQuoBC RT @RealTimers: It's time to #StartTheClock on our 15th season! Join @BillMaher and his guests LIVE on @HBO and @YouTube: https://t.co/Uqo0… Thanks for all the well wishes everybody! Sucks to get Trump for my birthday, but at least I get my show back tonight too! #WereStillHere I'm back tonight at 10 PM on @HBO and streaming live at: https://t.co/KFL51fGVEb  #RealTime #Inauguration #hellhasfrozenover https://t.co/voab0bHUvy RT @RealTimers: FRIDAY: @BillMaher starts the clock on our 15th season w/ @Janefonda @KeithOlbermann @TomPerez @hmcghee + @jmeacham LIVE on… RT @attn: Unlike many Republican leaders, European conservatives don't deny climate change. In partnership w/ @DefendAction https://t.co/Rs… Tonight @JimmyKimmel Live! #marsorbust https://t.co/vkpo1E6I4S Love Putin going full Borat yesterday:\"How ridiculous Trump wld be w/ prostitute here in Moscow -but if he was, we have best!\" RT on Friday! RT @attn: Over 166,000 people have shared this woman’s tweet about how crucial Obamacare is. https://t.co/dob4YByKlW https://t.co/ZgCYuqCtjf RT @nytimes: Donald Trump “lives for vengeance,\" Bill Maher said. Then it dawned on him: “No one’s been meaner to him than me.” https://t.c… RT @abc27News: 200 dogs rescued from South Korean meat farm, 6 head to Carlisle https://t.co/bjnu6JAJRl So...Comrade Trump says the Nazis wld bring up unprovable (yet) sex rumors. But they did worse things, right? #AllLiesMatter Stop attacking Trump for his unsubstantiated kinkiness.He's a new man, anyway -for inaugural they taught him to say \"MAY I grab this pussy?\" RT @PPact: Call in now using https://t.co/YQ6wSwbWlV to hear how we'll resist attacks on Obamacare &amp; care at Planned Parenthood. https://t.… RT @Koreandogs: 🔁SHARE AWARENESS AND ACTIONS ABOUT THE CRUEL #DogMeatTrade in #SouthKorea🔁CHOOSE A TWEETSHEET AND SEND THE TWEETS➡https://t… RT @jphro: #AboutLastNight when @nickjonas helped @imseanpenn raise $37 million for our initiative in #Haiti! What a fantastic night at #Ha… RT @blackfishmovie: Heartbreaking news. SeaWorld has announced the passing of Tilikum #RIPTilikum #Blackfish https://t.co/oR8qwzsOpd #RESIST #RealTime Returns January 20, 2017! @HBO #InagurationDay https://t.co/srCSSU4g89 The traditional Stooges shot with Sean and Eddie - 6th annual! Happy new year everybody!! https://t.co/CkTloWsoVd Anyone worried about the next 4 yrs, just look at Trump today w/ Don King in a wizard costume and a giant Trump button and tell me..oh Jesus Bill Maher Calls out Trump's Questionable Use of Twitter https://t.co/ygVS9Ss5rk via @attn RT @attn: Trump's Twitter attacks are absurdly childish. -- @billmaher https://t.co/2ydn3lWKsT .@GOP The Party Of Scrooge https://t.co/B4w6NI45S9 So you know its really a pagan holiday that was grafted - aw, fuck it, its the last one before the world ends, #MerryChristMyth everybody! RT @attn: .@billmaher nails the stigma against atheism https://t.co/DJCJQ55i45 RT @attn: The debate over \"happy holidays\" vs \"merry Christmas\" is ridiculous. -- @billmaher https://t.co/3VpDXhOYGJ My Xmas message from 2010 – unfortunately in the Age of Trump, it applies more than ever. Merry Christmyth! https://t.co/XqzMuOwUMZ RT @attn: It's time to end the stigma against atheists. https://t.co/Ff6xR0l1g2 Some tips for surviving Christmas. #Thankshallowistmas #SavingChristmas https://t.co/yjC5j4I7mW RT @attn: Donald Trump's cabinet appointments are a joke. -- @billmaher https://t.co/oIHM8hcqgh RT @MatthewESegal: Check out @attn's exclusive interview with @billmaher on @realDonaldTrump, #Russia and the #WarOnChristmas live now http… RT @attn: All Americans should be concerned about the Russian hacks. https://t.co/CIoHw1twHv I often say when ppl ask if I'm friends with some showbiz person:\"friend-LY\".Not Alan Thicke. That was a real friend. None like ya,pal.2soon RT @ReproRights: BREAKING: Texas is requiring funerals for fetal tissue. We're suing them. https://t.co/snCpaDGb9C https://t.co/DefMB0G9qt RT @attn: Unlike the French, Americans put way too much food on their plates. https://t.co/htBXrFkNI1 Seeing Hillary speaking yesterday: Thank you, and Bill, for over 30 yrs of service. And now I never want to see either one of you ever again Just in time! We're back January 20, 2017 #InaugurationDay #RESIST @HBO #RealTime https://t.co/2qArdHq65v RT @attn: Protesters just won a big victory at Standing Rock. https://t.co/6F5we0X8Ah RT @The_Blue_Cross: Do You Know Where Your Pet Came From? Our latest blog post for @HuffPostUK: https://t.co/azNoEz12fi https://t.co/ISZHP6… Its been almost a month, will I ever get used to Trump? Fuck no. Its like watching a toddler playing with a gun - you're always nervous. RT @repdonnaedwards: So, @NASAGoddard or Breitbart? The science is clear - these aren't the records we want to be breaking. #ClimateChange… RT @attn: Veterans are standing up for Standing Rock protesters. https://t.co/Ycrc6GGrKT On #GivingTuesday consider $ for @projectchimps. They are providing a sanctuary for up to #300Chimps coming out of biomedical research. https://t.co/hvBtir9w69 President Sanders #ICanDream https://t.co/5QqaD37Wky #StandingRock https://t.co/ZalCUvpLzm Comedy never rests...with my writers working on new material on Thnksgiving https://t.co/t02EARScjw Happy TG everybody - politics isn't everything, and we still have a lot to,um,you know, be thankful...oh fuck it, just enjoy the food RT @sciam: Trump picks a climate skeptic to enforce environmental laws https://t.co/l7l9RQeiEF https://t.co/qSSN4cCDEO If you're an American you only get one president. #NotMyPresident #Trumpocalypse https://t.co/4xOXydZKSd This election was a referendum on decency. #Trumpism https://t.co/6rqaujyN8L I'd give a week's pay to hear that sermon! https://t.co/LEIb4gYGlv I'm still not over #Pussygate. #Whinylittlebitch #TicTac #Igor https://t.co/Eab74CcCLm RT @attn: Trump's attorney general nominee is a nightmare for marijuana supporters. https://t.co/VEdQ7WQIUJ Getting SO tired of hearing \"the ppl voted for change\". Actually, she won. What has to change is \"we win election, they get to be president\" #PresidentTroll #RedFlags #WhinyLittleBitch https://t.co/DP9eFgXCJs Since Trump got elected-slash-normalized, I've had weird dreams - anybody? A big orange skyscraper is chasing me - what does it mean???!! Doesn't @Mike_Pence look like the guy the airlines hire to play the Captain in the pre-flight video? #BraceforImpact #FetalFunerals https://t.co/CW2dHpY6sl Be nice to Ivanka, she's our only hope. #DoucheBagVonFuckface #ThurstonShitBagIII https://t.co/mhuGNXV5Lf The @FoxNews fictitious #whinylittlebitch version of America. https://t.co/VtrF7LMWVb Trump's post-fact world. #UnchartedTerritory #BraceforImpact #WereStillHere https://t.co/EbXErEz1Gi On the bright side, since Trump was elected there's never been a better time for atheist recruiting among ppl who suspected there is no god How to Make Your Congressman Listen to You https://t.co/d6Q6GwAMSf via @attn “This is a moral 9/11. Only 9/11 was done to us from the outside and we did this to ourselves.” (@tomfriedman) #WereStillHere https://t.co/uhNOsPIj7r Abolish the Electoral College w/@EricHolder Sign the @MoveOn petition here: https://t.co/1efpU3XADU https://t.co/gDbQWOvoeZ America needs you more than ever, with me and all the rest of #TheResistance, until we can figure out how to really #MAGA! #WereStillHere https://t.co/wI1uSwMELR RT @RealTimers: ANNOUNCEMENT: Tonight's #RealTime season finale will air LIVE on @HBO and @YouTube! Could this week get any better?! Oh, ri… RT @RealTimers: FRIDAY: @EricHolder @davidaxelrod @anamariecox @tomfriedman and @traecrowder join @BillMaher for a group hug on #RealTime @… Shit just got real. #UseYourVote #Millennials https://t.co/nbNQ09pwPI RT @RealTimers: \"Anybody sitting on the sidelines right now or deciding to engage in a protest vote – that's a vote for Trump.\" – @POTUS #U… Pls vote for Hillary today. Even if you don't like her, its necessary to block a dangerous lunatic ultimate power. #ThisTimeIsDifferent Leaving the #JimmyFallon taping on later tonight - funny but also important! This election REALLY IS DIFFERENT! And I never use ALL CAPS!!! RT @attn: Here is Donald Trump's insane response to a joke from Bill Maher. https://t.co/8eeHN5ZvAo https://t.co/ZLq9WIWYUO Thank Trump for the one good thing he did. He exposed Evangelicals, who are his supporters as the shameless hippocrates they've always been. https://t.co/hqOpc1oKMR #HealthCare vs. #DiseaseCare: Food purity in America w/@POTUS https://t.co/ZhNTkHAIT8 RT @RealTimers: Thank you @POTUS! Watch the interview on the #RealTime @HBO YouTube channel: https://t.co/4RmfJ4Bx1f RT @RealTimers: TONIGHT on #RealTime with @BillMaher: @POTUS @BarackObama + @JenGranholm @davidfrum and Martin Short! https://t.co/JqZhKCpb… #FlyTheW! If you missed #WhinyLittleBitch on Facebook Live you can still watch it here: https://t.co/evJCyJw6R5 Makeup for FacebookLive - has it come to this? Oh well, 15 min to showtime! #whinylittlebitch https://t.co/w1fjqBXTy1 Can't wait to do #WhinyLittleBitch tonight at 10 EST on Facebook Live! This election, Jeez I feel like I'm waiting for Xrays to come back! RT @grobles63: Looking forward to Bill Maher's Facebook live special #whinylittlebitch https://t.co/F9XgsmdSJU Comey to Republicans: \"Don't know how long the investigation of Hillary will take\". Republicans: \"Untill she's dead - duh\" Glad everyone's as excited as we are about POTUS coming on RT. And I see Trump went on Sesame Street today and screamed \"YOU'RE the puppet!\" The Laziness of False Equivalency:  #Election2016 #Millennials https://t.co/o6H4PTtmXC Catch me bringing “#WhinyLittleBitch!” to Facebook LIVE this Wednesday, November 2nd at 7PM PT 10PM ET  https://t.co/8BmaLKTkiM https://t.co/bUdgpxgYIY RT @RealTimers: #RealTime with @BillMaher is #LIVE right now on @HBO! https://t.co/DuQpQkolvh RT @MMFlint: I'm on Bill Maher tonight. HBO. Live. 10pm ET. Our promise back in May: 2 \"personally stop Trump, 2 stand in front of WH door… RT @RealTimers: FRIDAY: #RealTime with @BillMaher is back with @VanJones68 @chelseahandler @KSoltisAnderson @MMFlint + @RickLazio! https://… #ActOnClimate https://t.co/YiXnCxSAdh RT @RealTimers: Watch @BillMaher and @rtraister discuss #debate strategy and why it's difficult for Hillary Clinton to call Trump on his BS… Matthew Segal Wants Your Attn: https://t.co/BrC1ffUrfi RT @nycomedyfest: Only a few tickets left to see @BillMaher at The Theater at @TheGarden! \n\nGet them here-&gt; https://t.co/Arf23sidDE\n\n#MakeN… Final thought: Hillary won the debate, but Alec Baldwin did a great job intensifying Trump's insanity. That was Alec Baldwin, right? Not a single question about climate change in all 3 debates. Sad. No, really - sad. Brilliant closing, Don: \"vote for her and you get 4 more years of Obama\" - a president with a 55% approval rating. This was by far Hillary's best debate, bravo. But that jacket makes me want to ask her to cut me a slab of prime rib. Until a month ago, Trump thought Aleppo was Omarosa's brother. #Debatenight I'm trying to remember, when we invaded Iraq in 2003, yes of course it was all Hillary's doing, but wasn't there someone else...Bush maybe? I never realized Hillary was the emperor of the world for the last 30 years, solely responsible for every bad thing that ever happened. Hmm. Oh for fuck sake, if Trump was any more of a pussy he'd have to grab himself. #Debatenight When will Trump realize that saying \"Wrong!\" makes him look like a #WhinyLittleBitch ? Trump: I didn't even apologize to my wife! I wrote her a check, like always. Right, the 73 yr old woman he groped on a plane wants \"fame\" - hoping to parlay this into a movie career and start dating James Franco. Man, Hillary's debate prep was worth every minute, his predictable insults are getting overhead slammed. Also, Cubs up by 4. Hey, Hillary, what about Trump's excellent plan to help small business by taking women furniture shopping? Trump talking about creating millions of new jobs - Billy Bush at home saying, \"Well you lost me mine!\" Hillary looks like a president. Like a president dealing with an idiot at a town hall. #Debatenight This got nasty fast. But remember, when he goes low, I get high. #Debatenight We know he's a five year old, but does he really have to say \"You're the puppet!\" \"No, you are!\" And this guy is still in the race? Jesus. Is \"bigly\" a word? No, its not. That should be disqualifying itself! Hillary doesn't want to put immigrants on buses, where they'll just be egged on by Billy Bush. #debatenight Also, the sniffling kicks in when he starts talking about drugs. Sad. So far, she is killing him, and he sounds like he knows he's toast. Also sounds like he's about 2 cigars away from an electrolarynx Trump on fetuses: In 20 years, they'll be dating me! Don't forget \"Go to Hillary Clinton dot com\" is code for \"He's a lying sack of shit\" Telling that right off the bat, Trump makes the Supreme Court question about HIM! As always, he was insulted!Thats all that matters, people! They're letting Hillary talk - its rigged!! Debate prediction: Closest we get to talk of climate change tonight is when Trump mentions his daughter keeps getting hotter. Looking forward to the Dorito-colored douchebag melting down tonight &amp; tweeting the play by play! Even POTUS agrees he's a #WhinyLittleBitch RT @RealTimers: Follow @BillMaher as he keeps it real during tonight's final presidential debate! #RealTime #Debates2016 https://t.co/lwvYP… RT @girlsreallyrule: Obama to Trump: \"Stop whining and try to earn votes\"...God, I love @POTUS. #WhinyLittleBitch #NeverTrump #debate https… CBSNews leads with yet another email story, not Trump's subverting democracy itself. Like my dog, media has no clue about the size of things RT @RealTimers: Like a good neighbor, @BillMaher is there – sending love to his peeps at #RiseUpAsOne. Find out more at https://t.co/f4EutF… RT @HBO: Together, we can @riseupasone. \nLearn more about this celebration of music and unity: https://t.co/JEyEc9AVjY https://t.co/c9Uf9p0… .@sullydish \"The Only Adult Thing To Do\" #election2016 https://t.co/e28PimKoPb The great sadness is even if Trump doesn't become president, we live in a country where half the people think he should be. #AmericanIdiots https://t.co/mzMxP6WYKK RT @RealTimers: #RealTime with @BillMaher is #LIVE right now on @HBO! https://t.co/me72XJf4cv RT @RealTimers: TONIGHT @ 10: Sen. @BernieSanders @AnnCoulter @RTraister #AndrewSullivan and former Sen. #BobKerrey join @BillMaher LIVE on… Let's all put the blame for @realDonaldTrump where it belongs: https://t.co/nqNvB3FfcU #MAGA! https://t.co/BIYPzrCEvA RT @attn: Bragging about sexual assault is NOT locker room talk. https://t.co/ihe0HRSey6 This trotting out of Bill Clinton accusers - so unfair to #Hillary! Who has less to do with Bill Clinton's sex life than Hillary Clinton? #TrumpTaxes and his Goebbels&amp;Goering w/@JamesCarville @JohannHari101 @MCuban #RealTime https://t.co/TuIJMbUql7 Just got off stage in Illinois but I hear Trump went full methadone clinic outpatient. Thanks Waukegan for keeping our date tonight! Wouldn't it be awesome if in the middle of it Hillary took out a tic tac I want #Trump to double down: \"I wld grab Isis by the pussy! China, send our jobs back or get ur pussy grabbed by the Sixth Fleet!\" 2 days of Trumptalk and all I can say is, Really @realDonaldTrump? You kiss your daughter with that mouth? Don't let Trump quit! You assholes voted for him, nominated him, handcuffed yourself to this dead hooker, now drag it to the finish line! #TrumpPence #MakeSexualAssaultGreatAgain! #TrumpTape https://t.co/11iwNMQRT4 At the @GOP convention, Trump said I am your voice. For once he wasn’t lying, he is your voice, because you’re a #whinylittlebitch! https://t.co/LFgbZiPIDQ RT @attn: Here's the leaked conversation between Billy Bush and Trump in 2005. https://t.co/88hxppjmKu RT @RealTimers: #StartTheClock! @BillMaher @AlFranken @JamesCarville @johannhari101 @mcuban + @pitbull are LIVE on @HBO! https://t.co/fC0AT… RT @alfranken: I'll be sitting down w/ @billmaher on @RealTimers tonight to talk about taking back the Senate and why #ImWithHer. Hope you… Wasn't not paying taxes (the TAKERS!!) the worst thing ever to Republicans in 2012? But now it means you're a genius? #NoShameInTheirGame Another in my basket of idiots: @GovGaryJohnson | #BernieBros @SarahKSilverman @PeterHamby https://t.co/jgQCbP4dKJ Pretty funny reading how @realDonaldTrump is itching to go after Clinton marriage -the only person he's ever been loyal to is Vladimir Putin #Trump: The 12-Year-Old Sociopath w/@imseanpenn #BobHoney https://t.co/DMQri7gxWB And yes, if u can't vote for @HillaryClinton over 2 guys who know less about the world than she did when she was 10...#Somethingelsegoingon I did go a little mad last night on RT - but who isn't feeling that way right now? It's catch-22 in America:if ur not going insane u r nuts! RT @RollingStone: See Bill Maher and Sarah Silverman scold Bernie Bros voting for Gary Johnson on #RealTime https://t.co/tOLQGkaiyN Trump's Basket of Inexplicables: #NewRule #RealTime https://t.co/BFZ29Xs59y RT @attn: Not enough people are talking about what just happened to children in Syria. https://t.co/DDI9mkZ73a https://t.co/qApWWYRCIp RT @RealTimers: TONIGHT: @BillMaher welcomes @imseanpenn @angela_rye @PeterHamby @StephenMoore and @SarahKSilverman to #RealTime @HBO! http… RT @S_C_: Dope! https://t.co/IISVMXOmvm RT @RichardDawkins: History in the making. CFI Canada leading the charge to shut down Canada's blasphemy law. Sign the petition to help  ht… #colinkapernick is an idiot.I support his protest,but stick to what u know: kneeling and interceptions, and then look up \"false equivalency\" Register to Vote in 01:34 While I Make New Rules https://t.co/GqePb1rgQy Negative ads in a political race are \"not nice?\" There's no crying in politics, you #WhinyLittleBitch! Word from inside the debate hall is Melania just left with Bill Clinton. #StillGotIt However this comes out, I have so little respect for the electorate just that its this close. She's right, she shld be 50 points ahead. If that meltdown ending with \"I have the greatest temperment\" hasn't convinced the idiot undecideds to vote Clinton, nothing can. #debates Holy fuck, Hillary just did a Jim-from-The Office direct to camera take! Which Says. It. All. #debatenight btw, you know a charge agst Trump is 100% provably true when he interrupts with \"Wrong!\" #debates Trump: \"Being in Iraq was a disaster, but we shld take the oil\"WE WLD HAVE TO BE BACK IN IRAQ TO TAKE THE OIL! They won't give it to a drone Christ, cld someone push back on America needs to be restored?To what, the unemployment rate over 10? the 2 wars? $5 gas? stock mkt at 7000? to keep up with Trump's bullshit they had to outsource fact-checking to China. Sad. Can we have some factchecking?! Stop and frisk did NOT reduce crime. No one is going to your website, Hillary, SAY IT NOW! You too Lester! Hillary, for fuck's sake, he just said the country's fucked because of the Iraq war - a REPUBLICAN ENDEAVOR! Bush's war, not yours! Trump: \"I get audited every year\" Yes, because you're a crook!! I forgot from the Republican debates that Donald Trump is kind of a bus depot speed freak OK,I hope she's playing rope-a-dope, and I do mean dope, because I'm getting tired of this vile nincompoop bullying and lieing and its early Trump. Wearing a tie made in China, just sayin' Trump proud of himself that he called her \"Secretary Clinton\" - as opposed to what, Bitchula? Hillary dressed as bottle of hot sauce - a pander to Latinos? shit, FoxNews just declared Trump the winner Trump adjusting his Spanx right now, and one final pass with the can of Final Net... Want to see Hillary come out and say \"The Russians just handed me your tax returns\" just to see if Trump bolts GOP won expectations game when it nominated an orangutan. As long as he doesn't fling his poop, \"Surprisingly dignified Trump last night\" Cable news,enuf with the countdown clocks for the debate!Which I will be live-tweeting in just 3 hrs and 21 minutes...oh shit, I just did it RT @RealTimers: It's #DebateNight and @BillMaher is going to keep things real! Join him for live commentary starting @ 9PM Eastern. #Debate… Everybody loves autumn. In #Charlotte, the police are using tear gas with just a hint of pumpkin spice. #Nascar #HallOfFame #RealTime https://t.co/SmLEMb3TWS The next time Apple wants to do something truly innovative and really “think different” they should try NOT releasing a new phone. #iPhone7 https://t.co/t76y7LAR8S RT @RealTimers: TONIGHT at 10: @BillMaher welcomes @NYTimesDowd @michaelfranti @neeratanden @lanheechen + Max Brooks to #RealTime @HBO! htt… #Trump saying \"I called it\" about the NY/NJ bombing: Donald Trump is the only person besides terrorists who claims credit for terrorism. RT @attn: It's time for our leaders to admit the war on drugs is a huge failure. https://t.co/FZh0DSBGyn RT @MMFlint: This Canadian journalist, every single day in the Toronto Star, lists all the lies that Donald Trump spoke that day. Shames th… RT @SethMacFarlane: Remember: This November you can help elect President Donald Trump just by voting for Gary Johnson or Jill Stein!  Happy… See! I wish the judge hadn't thrown out @realDonaldTrump 's suit against me, I would have won! Thanks Jane!! https://t.co/QtS8fiGtCq Trump's list of provable lies. w/@KellyannePolls #artofthedeal #truthfulhyperbole https://t.co/nZQEIwAhKh The real infectious disease that's threatening our election isn't pneumonia, it's a total lack of class. https://t.co/nAZM6uOihv Great 2b back tonight on #RealTime! And just as race is tied- its like America's watching Dr Strangelove and half are rooting for the bomb! RT @attn: It’s time to stop treating our oceans like a dumpster. https://t.co/KgPJIsaxGh RT @RealTimers: Bill's back with a brand new episode of #RealTime this Friday at 10pm! Only on @HBO. https://t.co/2Na8tFohVA Pneumonia? I'd vote for Dead Hillary in this race. She could be Patient Zero for Bubonic Plague, still better than #TangerineNightmare RT @SamHarrisOrg: The whole endgame for civilization in 4 minutes... https://t.co/jDvY44TxoF With one of my all time fav crazy people, the maistro #JohnWaters after D C show. https://t.co/Im6zgeS9Ps I like #GaryJohnson, but #Aleppo is not one of the Marx Brothers. Don't fuck around with this election; vote for Hillary, nobody's perfect. #JeffRossRoastsCops w/@realjeffreyross on @ComedyCentral this Saturday. #GreatShow https://t.co/PmHdl8tlIi With President Obama at #TheMirage before tonight's show! Nah, it's really @iamreggiebrown https://t.co/OKfwcPogMD #FreeTheWeed https://t.co/Z9aLF7wQss Very excited to be heading out to @TheMirageLV tomorrow for shows Saturday and Sunday night! There might be a few Trump jokes... RT @attn: Donald Trump's plans for our planet are terrifying. In partnership w/ @DefendAction\nhttps://t.co/AesagtXHdi To those who say #Trump spoke 2 diff messages to 2 diff audiences today, he says \"Exactly.\" In a stupid country, that works. Be very afraid. I Don’t Know It For a Fact...I Just Know It’s True https://t.co/9SetNSqoAf With the greatest congressman of our time  #BarneyFrank in Boston last week https://t.co/PcYDK9gqLF RT @SethMacFarlane: Hats off to University Of Chicago for ditching \"safe spaces\" in favor of the free exchange of ideas and discourse \nhttp… RT @MMFlint: Bill Maher runs onto Trump's plane and grabs Trump's tax returns! https://t.co/F7ae1Fw0q8 Media is \"the lowest form of life\" (@realDonaldTrump ), but Hillary = bad because she won't have a press conference? How can both be true? #TrumpTrain with @CornelWest #RealTime\nhttps://t.co/tpibFLOgCt Now this is how u give money to a senator! U let him feel u make it out right on his back! Spend it wisely, Al! https://t.co/LfmMiOIakR Watching them carpet bomb Miami to kill every last mosquito, wonder if we'll ever know what did more damage, Zika or all those chemicals? I keep reading \"pot is no more harmful than alcohol\" - even Obama said it! Can we end this misleading bs: Pot is WAY LESS harmful. Obviously Utah, Ga. in play:good! But Dems must ask why so many whole states wld vote for the baby-snatching crocodile if it had an R by name vs a Dem Trump doesn't know diff. btwn Sarcasm &amp; Exaggeration. \"Trump is really smart\" is sarcasm; \"Trump is dumber than a box of rocks\" is...true. Here are some of the future headlines we can expect while we're away. @HBO #RealTime #Returns #Sept16\nhttps://t.co/YNnvwUGtOO This election is simply a referendum on decency - Trump has none, and if he's elected there's a part of this country we will never get back Founder of Isis? Its so important that Trump not just lose,but lose big. Then we can feed him to the tuna like bin Laden, so no MoronMartyrs RT @MMFlint: Trump is clearly mentally ill, so I wrote his daughter and asked her to do an intervention: https://t.co/j7LstQMQwR Assassination threats aside,its just accepted when Trump repeats the wholly made up lie that Hillary wants to abolish 2nd Amendment. I wish! Bush kid endorses Trump hrs before 50 Natl Security experts say IT MUST NOT HAPPEN! Way to jump on sinking ship,u typically stupid Bush twit Republican Party's #Deadhooker #WhinyLittleBitch #TangerineNightmare:\nhttps://t.co/CaIwBO3qs0 I’m ready to #MakeNYLaugh at @nycomedyfest just before the election! pre-sale FNYCF https://t.co/duFu7vakLJ https://t.co/30pBeNIx1g #JulianAssange @Wikileaks #HackTrump #RealTime\nhttps://t.co/pufEE0PdS0 There’s no room, for boutique liberal issues in an armageddon election. #WhinyLittleBitch\nhttps://t.co/BGbsMqtEZY With robreiner @TaraSetmayer and @realjefforyross before showtime! We're on @HBO in a minute. https://t.co/2GYk7EEpmD #Bernie2020 @BernieSanders #PoliticalRevolution\nhttps://t.co/uL487SNkPX The Internet Reacts Over #TrumpSacrifices https://t.co/YwM35gfSTL via @attn RT @RealTimers: Thank you, @HBO! #RealTime with @BillMaher has been renewed through 2018! Or until President Trump pulls the plug. https://… Voters don’t want America’s nicest grandma. They want the wolf with bits of grandma in its teeth. #NotoriousHRC\nhttps://t.co/btkZs9ctKW RT @alexwagner: Me + @BernieSanders @BarneyFrank @CornelWest @MattWelch &amp; @billmaher -- hey, what could go wrong? https://t.co/SnAglJivBX RT @DragonS0ng: .@realDonaldTrump You dropped one of your gloves...\n#whinylittlebitch https://t.co/xJWYw40i9t #NewRule Bernie supporters you can't claim to be \"silenced\" if you won't shut the hell up. #alloilsmatter\nhttps://t.co/Yvus1Tu3jB #RealTime is live right now on @HBO and live-streaming on @youtube: https://t.co/OeI2SSVjNc https://t.co/Cn9i3gJmgC Now that's a cast for our last special convention show! See u as soon as Hillary finishes! @HBO, thx for xrtra shows https://t.co/WDfrTKn2VP RT @RealTimers: In the words of @BarackObama, \"Let's keep it goin'!\" #RealTime's #DemsInPhilly coverage continues tonight on @HBO! https://… RT @attn: The line of the night from #POTUS. #DontBooVote \n\nhttps://t.co/rYdskQmWOV https://t.co/L7fYXubTDL #VichyRepublicans #Trumputin #WhinyLittleBitch w/@AnthonyWeiner\nhttps://t.co/reNmQqHDEd #RealTime is live right now on @HBO and live-streaming: https://t.co/OeI2SSVjNc https://t.co/wxoACpJ1f3 With D L Hughley, Anthony Weiner, Charles Cooke before we go live tonight right after Obsma's speech! Gonna be good! https://t.co/DkJdhXbWgS RT @RealTimers: #RealTime coverage of the #DemsInPhilly begins TONIGHT after the gavel @ 11pm ET/8PM PT #LIVE on @HBO + @YouTube! https://t… So happy to be on live tonight after convention in light of Trump's latest gaffe! What does he have to do to make his fans turn, fuck a pie? Win or lose, @realDonaldTrump will probably be the last '50s guy to run for president. #MakeAmericaWhiteAgain\nhttps://t.co/JGTCWD2uYv Ten to one Trump starts calling Tim Kaine \"Tiny Tim\" Who's in Vegas?!! Show at Mirage last night was off the hook - show tonight is at 10, not 8, don't forget!(there might be a few Trump jokes) #LGBTQ Conversion Therapy. #RNCinCLE #LGBTrump\nhttps://t.co/oBcPemwVVm Real Time is live right now on HBO and streaming on youtube: https://t.co/OeI2SSVjNc https://t.co/13WCSYcQuX My panel and I warming up our vitriol while Trump makes his speech. See u in a half hour on HBO! https://t.co/STmNvrUYtQ Could Donald Trump Pass a Sanity Test? https://t.co/n9xvmRAoKn #RNCinCLE Convention #HATE @ChrisChristie @HillaryClinton. #RealTime w/@MMFlint @JoyAnnReid @fakedansavage\nhttps://t.co/JU7f75aHdR The Real Author of \"@realDonaldTrump:The Art of the Deal\" @TonySchwartz\nhttps://t.co/J1J7Qf0kEJ Real Time is #LIVE right now on @HBO and streaming on @youtube: https://t.co/OeI2SSVjNc https://t.co/FzMElmotJT With my panel for tonight's show in about half hour! https://t.co/m30CZdT99Q RT @MMFlint: Getting ready 2 go LIVE on HBO w/ Bill Maher when the convention gavel bangs @ 11pmET. U can also watch on You Tube: https://t… They're sticking to the theme better tonight, \"America First\". Take that, Finland! 2 hours before we go live, I'm getting excited RT @MMFlint: On my way to be live with Bill Maher tonight on his special convention show, 11pm ET on HBO and YouTube. Tune in! No censors o… And I got Joy Reid, Michael Moore and Dan Savage to help me! #RealTime live on Wednesday night! I thought Trump was the great showman! But he closes with the E list avocado farmer? Tomorrow, I'll be on HBO covering this! Don't miss it! But Caitlyn Jenner looks great! More bad news, portions of Dr. Giggle's speech were plagiarized from a guy who sleeps in a shopping cart behind Pep Boys. On a serious note, Don Jr reminds me very much of George W Bush when he was his father's hatchet man in 88. Oh dear, and it turns out his speech was identical to a wedding toast once given by Carol Mosley Braun Whenever someone tells you they want to cut the estate tax, picture that privileged little turd killing a leopard Trump's sons (Douchbag Von Fuckface and Thurston Shitbag the 3rd,you'll recall) look like the date rapist in every after school special ever Oh, this hurts: turns out Tiffany's speech was lifted word for word from Shirley Chisholm Tiffany, honey, get with the theme and shut up about your father and call Hillary a lieing bitch who should be in prison! Playing the drinking game here where you take a shot every time a speaker mentions Trump. Stone. Cold. Sober. #CantWaitTillTomorrow! A lady golfer who's brave enough to say she's a Christian, in public, in America - if she's for Trump, I'm switching my vote! And note, its Alaska contesting the nomination - the state that brought us Sarah Palin finds Trump too embarrassing. They always say, \"If he runs the country as good/bad as he ran his campaign, we'll be OK/in trouble\". Does that go for running a convention? RT @RealTimers: TOMORROW: #RealTime with @billmaher covers the #RNCinCLE - LIVE at 11pm ET/8 pm PT @HBO and live-streaming @YouTube https:/… Don't forget if you're in #Vegas this weekend I will be @TheMirageLV #nonstop https://t.co/oMveWHdNIO Didn't think my esteem for the GOP cld get any lower, but I was wrong. And its only the first hour of Night One. #NoShameInTheirGame 25 Things You Don't Know About @realDonaldTrump\nhttps://t.co/6KDUjPxKGM Starting to think #RogerAiles is a creep - one woman said when they were together he wanted her to say vile, disgusting things. About Obama. I see #DonaldTrump to support the French made his hair look even more like a croissant. To #MakeAmericaGreatAgain we must build a wall! But not a border wall: we need a wall between our work and home life\nhttps://t.co/cK4lbZ8uE4 RT @colbertlateshow: .@billmaher &amp; Stephen discuss race relations and how little has changed since Rodney King. https://t.co/fMFwMtra8v htt… The NRA says what happened in Nice, France cld have been stopped if everyone in the crowd also had a truck Back on @ColbertLateShow tonight. https://t.co/fktoSsF1cP RT @HardballChris: .@billmaher and I tough it out on @hardball tonight at 7 ET. \"Who is more macho?\" #hardball #MSNBC #HBO #RealTime https:… RT @Variety: Bill Maher Pushes Limits By Stretching ‘Real Time’ To Political Conventions https://t.co/f817LNy9Fc At my favorite place on a Sunday afternoon https://t.co/RynFpaotPP Hey, Republicans looking for some credibility w/ minorities as U get behind Trump: maybe ONCE take the side of shot black ppl over the cops Covering conventions is what I live for, and this year looks to be the best yet.\nhttps://t.co/2mmmA0McVK 7/4/16,hangin with who i want, doin, sayin, wearin what i want - Make America great AGAIN? Fuck U #WhineyLittleBitch https://t.co/w6KL39iCdm If States are \"Laboratories of Democracy\" why are we wasting time replicating failed experiments?\nhttps://t.co/uHnaw7mMOG Wow #Trump cant get anyone to show up at his convention! I'm sure this isn't the first time he hasn't been able to make someone come. Gnite! RT @rbpconcerts: Tickets are on sale to the public NOW for Bill Maher’s 6th Annual New Year’s All-Star Evening of Comedy! https://t.co/Vf8e… RT @attn: Politicians shouldn't be able to choose their own voters.\nhttps://t.co/MGsrCGaRqT RT @RealTimers: Listen in as Bill and his guests get real about the issues on @iTunesPodcasts: https://t.co/tFbPz4fvUd #RealTime https://t.… RT @earthguardianz: Follow Bill Maher's lead and sign our Care2 Petition demanding CLIMATE ACTION from Presidential Candidates.... https://… The internet does not just radicalize would-be terrorists, it radicalizes everybody.\nhttps://t.co/K9YAGxYUHA #THECOMPASSIONPROJECT https://t.co/Mrqi5NE9Kg RT @THR: Podcast: Bill Maher on his rise through comedy's ranks, Trump (\"he's LOL every day\") https://t.co/XieY8RjZLd https://t.co/hpOk6Ryo… Dems Gun protest: They shld have focused on the part of Orlando Repub.s care about - when the killer forced LGBT ppl into the wrong bathroom Since President Obama is constantly being accused of going on an \"apology tour,\" he should just go on one:\nhttps://t.co/oJVlod6Ght Final #Brexit tally is in: 48% Sense and Sensibility, 52% Pride and Prejudice. And how about that Donald Trump in Scotland - he vowed to rebuild Hadrian's Wall, and make the Picts pay for it! #BobHope4HistoryMajors If you told me Obama was gonna take your guns away, before you tell me Hillary is going to take your guns, you have to admit you were wrong RT @RealTimers: \"His campaign has blood coming out of its whatever.\" – @BillMaher #RealTime #DumpTrump https://t.co/k4dTGlrQmX Thanks to you &amp; @HBO #RealTime will cover the @GOP/@DNC Conventions w/special episodes airing July 20-22, &amp; 27-29:\nhttps://t.co/UcYJssOgsq When it comes to lowering the bar, the #WhinyLittleBitch has really raised the bar.\nhttps://t.co/D5L4vRrauO A thanks to all our brave firefighters here in California who've kept the flames from reaching the Reagan Library. And damaging the book. Happy Birther Day, @realDonaldTrump! #WhinyLittleBitch\nhttps://t.co/tJw8sVzDl3 #Orlando Conservatives:\"Don't say it has anything to do with guns!\" Liberals:\"Don't say it has anything to do with Islam!\" #DrowningInBS Even though Bernie didn’t win the nomination, he’s already won the future.  #BerniesRevolution https://t.co/uDTfyEvWd4 A Jewish socialist met with a black president about conceding the White House race to a woman. We had a good day! It happens... Putting #DonaldTrump in charge of the national security state is like giving a toddler a Glock. Oh wait, we do that. Latino folks pelting the Trump supporters with eggs... I don't know if it will affect the election, but it's making valet parking awkward Hey Cleveland, I know u have clowns coming in next month but if u wanna laugh at them tonight I'm at the Connor Palace! Naming rights to national parks for corporations?  Capitalism Eats Everything: https://t.co/q3zmQxO0Cf Happy Memorial Day - America is so good at honoring its dead veterans. And so lousy at honoring the live ones. I thought Bernie did great on RT last night! Amazing the security he needs now -he used to come to our show in an Uber. And he was driving.. Trump vs. Bernie: @realDonaldTrump #ChickenedOut #WhinyLittleBitch https://t.co/tQGGWKj1KI Don't miss @SenSanders tonight on @HBO #RealTime! https://t.co/mKDN6bgXAb Michael Moore's best movie ever: #WhereToInvadeNext @MMFlint #RealTime https://t.co/7iiwdbnitY Man, that #NeverTrump movement lasted about as long as #Kony  Dangerous warlords are still out there, people! Trump learned a new thing, to say \"we shld leave it to the states\". He's like an 8 year old who just discovered he can play with his dick. Nothing justifies embracing a dangerous buffoon: #Trump2016 https://t.co/XPrvg3DLPP Taking Trump Down w/@mmflint #pledge https://t.co/IPsSEhgHLQ RT @MMFlint: I'm on Bill Maher tonight on HBO. I should be home writing Trump jokes but the Mets are in town! And the Trump jokes kinda write themselves... https://t.co/wrUnGvCwZV I wasn't kidding last night, Trump is going to crash the stock market. I miss the days when bad Republican ideas just ruined Kansas. If Trump was a man, he'd stop whining like a little bitch. #LadyTrump: https://t.co/q6i2qCFr0n Ted Cruz just said what built his campaign was the support of 4 year olds. So long, douchebag. Wow, Cruz loses Indiana at the  moment the polls close? What a fucking loser. Its like when Tyson knocked that guy out in 30 seconds. Good news: teen pregnancy rates in US hit an all time low! Its so hard to find knocked up teens MTV is doing a show called \"16 and Fingered\" House Republicans just won't pass funding to combat Zika. \"If we do something to stop pinheaded babies, what happens to us\" said they... The American Embargo https://t.co/zQxZklIsN0 getting kicked in the balls by her sister in an elevator...I think i'd take the elevator. If i had a wife, and she got so mad at me she made a video/album as compelling as #Lemonade, and i cld choose either it be released or... Trump's 5 landslides: I'm from NJ - that's my backyard. I thought we were more sophisticated. Not Repubs: clueless from sea to shining sea. So...slave #HarrietTubman on the front, slaveowner Andrew Jackson on the back? It's like Hitler and Anne Frank sharing the nickel. Nothin like hitting the road on a beautiful spring day to tell jokes to strangers. The Brady in Tulsa tonight - thank u Jesus! Lol of course RT @RealTimers: “I smell with my tongue” …and 25 other things you didn’t know about Ted Cruz, thanks to @BillMaher. WATCH:\nhttps://t.co/pTo… A Message to White America: #Racism #Race &amp; #Liberals https://t.co/8TrY4FKUbs RT @NRDC: Today at @UN, 171 nations signed the #ParisAgreement. And as @ClimateNexus shows the #ParisEffect is underway! https://t.co/T70pX… Happy 4/20! https://t.co/U5U05yGrHf And a good ex. of our shitty election-running: N Y state. Maybe Hillary woulda won anyway, but Independents can't vote? Join 1 of the hives! Horserace aside did anyone c study that among BigBoy countries,U S is WORST at doing elections?You know, at what we're trying to export.Jeez Abused? You Can’t Work at These Churches https://t.co/TxepEmE53U via @thedailybeast Now that it's Apr.15th all U.S. taxpayers must call out all the deadbeats who ride for free: https://t.co/xibGzEXN7O So sick of debates. I cld do their spiels for them at this point. Lets cut to the RNC convention: professional wrestling meets krystallnacht Wyoming makes 9 outta 10 for Bernie. Hillary says if only he'd stop winning elections, people wld see how unelectable he is! .@GOP You’re gonna lose with Trump or Cruz: #Punt https://t.co/x9rI0fQMhG Just watched the adult who is our current president discuss the grave issue of nukes...and then think if it was President Forrest Trump. Oy. Out to brunch, jeez Easter still a thing. Like you-know-who, it just won't die. I'd show u a pic of my eggs but that's stupider than Easter! Cruz would be our worst President. But Trump might well be our last. #BetterTedThanDead https://t.co/3wi1M8LftT #Trump is the logical result of 40 years of worshiping at the altar of self-esteem: https://t.co/4jSTUdMCs4 #MerrickGarland sounds and looks so much like a Supreme Crt justice I bet U cld convince 90% of Americans he's already on the Supreme Crt! RT @HumaneSociety: BREAKING NEWS: @Seaworld to end the breeding of captive orcas: https://t.co/yiIBuAg0wl #nomorcas https://t.co/ODeo5waGFD RT @rbpconcerts: Pre-sale tickets are on sale NOW to Bill Maher LIVE at Marin Center in San Rafael on November 13th! https://t.co/wm5wFt2b7W RT @rbpconcerts: Pre-sale tickets are on sale NOW to Bill Maher LIVE at San Jose's City National Civic on November 12th! https://t.co/gwp2p… Hasta la vista, Marco Rubio, nice try. Just remember, if you were ugly and your name was Mark Rube, you wouldn't have gotten to do even this Don't forget, we turn the clocks forward one hour tonight, and U know what that means: Donald Trump loses an hour of tweeting! #JohnMcGraw: where did he get the idea U can punch a black guy for no reason and get away with it? Oh yeah, every police dept in America The death of liberals: #BernieorBust. Have you seen a @GOP debate? The zombies are in the mall. https://t.co/HETVRc0hgl However...this is so boring the white supremists are punching themselves to stay awake...so I got a big day tomorrow...till we meet again! When Trump eats at a Chinese restaurant, the kitchen help has to send out for more spit. We're all thinking it: Kasich is too old for that haircut. OK, I don't know how Bill Cosby got his knock-out drugs into their green room drinks, but this snooze fest is boring, like Dem Debate boring Btw, \"Waste, Fraud and Abuse\" was the curriculum at Trump University. Huh, new tactic here for Republicans - actually paying attention to facts? What the hell happened tonight? I'm bored. Who's dick is bigger?? Had to run out for a sec - do they still hate Mexicans? Ben Carson endorsing Trump, wow. And Trump brags, of course: \"so honored to be endorsed by the guy I called a child molester\" Also, not surprised Goofy endorsed Trump Trump: \"Only I can stop me from fucking America's workers!\" Not fair to ask Marco about Disney World! They know he's not tall enough to get on the rides! Trump very \"low energy\" so far. No joy in it for him unless another of the monkeys is hurling poop his way. Come on, get to the pissing contest. Although, after the last debate, that could literally come true Kasich kicks off Republican debate with sanity and hope - that's like kicking off an orgy with a bible verse OK,gonna try to watch with you; I pre-apologize for that moment when I just can't take these insufferable assholes 1 more minute. Smileyface #GOPDebate tonight cnn: https://t.co/t0IzFnkp1z Michigan just called for Bernie - as I've said, he's putting his \"New Deal\" on the table. Until its outright rejected, he's still in it! Hope its not \"too soon\" after Nancy Reagan's passing to ask: What wld Republicans say if it came out Michele Obama was using an astrologer? On so many issues, you can only get @GOP support if it touched one of their own: #ClimateChange https://t.co/7NOYpcvWEY Any Republican who watched that debate and thinks they can remain in the Very Serious Person's Club without quitting the party..well,U can't is it me, or do Trump/Cruz/Rubio go on and on screaming their bullshit, they go to Kasich, he says 3 words: DING! Times up, wrong party. Not that it hasn't been all along, but now its just sad. I feel like the Indian in the old PSA with the tear rolling down his cheek. Dr. Ben Carson: no wins, 2nds, 3rds or even 4ths. Dr. Ben, maybe you shld think about...Dr. Ben? Dr. BEN!! All right, I'll come back later. So far Trump is proving something I've always maintained about American politics: You throw your lot in with the Klan, you can win the South Well if this night doesnt put an end to racism and childfucking, i dont know what will!! Yes! Leo won! Finally, some light in this man's life! This is so exciting: is it the one i never heard of or the one i didnt see? Brooklyn, about an immigrant making a life here - or as the Republicans see it, a horror movie Speaking of victims,  what happened to Pharrell's hair? Stutterer won!! Yes!! Its abbbbbout time! Man, black people's white people's problems are worse than i thought! Let me remind us of the news that the pollinating species r going extinct - and if we all starve to death how will Will Smith get his Oscar? Well im all tucked in at the VF dinner and everyone's asking the same question: what the fuck is a revenant? Future @GOP State of the Union: #AndrewDiceTrump https://t.co/2Dw0aubrlM RT @HBO: #RealTime with @BillMaher returns tonight with @GenMhayden @MarkRuffalo @JoannaColes @MichaelEDyson and #FranLebowitz. 10PM on @HB… RT @shanesmith30: Tonights ep on #VICEonHBO looks at the phenomenon of White Collar Weed thats exploding across America.\nhttps://t.co/dWlk7… Honestly, the elevator door opens and these five guys are in it - do you get on? OK, I'm reaching for the gun, so I'm gonna say gnite! Trump: Millions of women are helped by Planned Parenthood, let me say that ten times. And, I would defund it. BECAUSE YOU ASSHOLES ARE NUTS! So, Kaisch's father carried a mailbag, and Cruz's washed dishes, or... Yeah, drifting. Drifting. Drifting.... Ben Carson's resting face is the same face the dog has when watching his owner have sex. See, drifting. Come to think of it,Trump Tower DOES look like it was built by illegal Polish workers. Its that time in the debate where my mind is drifting Wait,did Ben Carson just actually admit he fell asleep? Kasich looks like the college professor where you drop the class after the first day Well, Trump is right about one thing: the world is laughing at us. OK guys, we get it, Isis is bad, but first, America's greatest threat: Mexican cleaning ladies! Ben Carson got in! Yeah! Now, back to looking like he's ignoring a rape on the subway... How many times do we have to tip hats to G W Bush tonight? Hands down the worst sperm in American presidential history. Ten minutes in and I've already forgotten Ben Carson is there - new record! Bragging about an endorsement from Joe Arpaio is like bragging you went all the way with a party doll.We're in Texas, lets shit on Mexicans! For fuck's sake,is there any more NON ISSUE than immigration? Its NetZero from Mexico,Americans won't do the jobs they do..SHUT UP ABOUT IT! This debate is like a cop show: \"You have one hour to stop this man!!\" Getting ready to live tweet the Repub debate, or as much of it as I can stand. Got my popcorn, tequila...gun to shoot at the TV - I'm set! Just posted a photo https://t.co/osE9LVRGt5 So Jeb didnt get a rose. Maybe cuz he campaigned like the guy in Saving Pvt Ryan looking for his arm on the beach. To those in media today saying Trump's lawsuit agst Cruz wld be his most frivolous, check out the Orangatang-based suit he filed agst me! RT @SamHarrisOrg: Did you think a big city like LA couldn't be as stupid as Flint?\nhttps://t.co/zlJsioddvA\n@ErinBrockovich @billmaher RT @MMFlint: \"Where To Invade Next\", a documentary on less than 300 screens, came in at an amazing #6 this weekend in per screen avg. at th… Trump and I having one of our Serial Killer/Detective \"We're not so different,you and I\" moments re Bush \"keeping us safe\". U tell 'em,Donny Obama is president; a Supreme Court justice died; he gets to pick, period! As usual, only way Republicans can win anything is by cheating. Thanks WGA for award last night and for having the guts to give Real Time writers the recognition they so richly deserve! Happy Flowers for Blowjobs Day! All guys are like, first Sunday without football - and now this! Yup, that was real last night. And, I think, a first. (Zach's was fake but he paved the way!) America, fuck yeah! #FreeTheWeed #LegalizeIt! https://t.co/X5OCIxBzPO RT @MMFlint: Get ready America - It opens tomorrow! \nTRAILER: https://t.co/ufd6XegSxT\nLIST OF THEATERS: https://t.co/tnAJriidpm https://t.c… Kinda hard to take the \"pundits\" seriously today with the big forehead smudge. \"I believe in a bronze age myth...now as for the primaries..\" Reading final New Hampshire results: very surprised Ben Carson's fresh clothes didn't help him more. It's a year of political surprises!! RT @THR: Bill Maher pens essay on Hillary as \"Charlie Brown”, Trump, and why Bernie can Win  https://t.co/xwOdJPoNLI https://t.co/CsKEyHYbmf Tonight @jimmykimmel Live! https://t.co/2DgIIuPX0Q It PAINS me to defend Rubio, but THEY ALL SAY THE SAME THING OVER &amp; OVER! Is there any Republican so vile I still don't hate the media more? I wish I could consciously uncouple from this half time show Was that really an ad for junkies who can't shit? America, I luv ya but I just can't keep up #SocialJusticeWarriors &amp; #PCPolice: https://t.co/vXEFgLRDMe Man, they are all going after Rubio now - last time Republicans were this focused on a Cuban it was the one Clinton was using with Monica Excited to be starting @TheMirageLV March 12th! #Vegas https://t.co/YLlchWcRW9 https://t.co/7WxDyUYXMn Candidates are dropping like flies after Iowa - I haven't seen this many withdrawls since the last Repub president when the banks collapsed When Evangelicals say \"he shares my values\" they mean \"he shares my myth.\" Cruz has no values; he believes in virgin birth and zombie gods The truth is dead, and the Internet killed it. #AllLiesMatter https://t.co/g7VjCLDYZG Gotta stick up for #GlennFrey I like Bowie too,but not as much as Eagles, and zillions wld agree. But I guess its not as \"musically correct\" This Oscar boycott getting contentious - 50 Cent says Chris Rock should step down as host. Not a black thing, he just loves Billy Crystal! On the road again, i just can't wait to...oh I am! And so it begins for 2016! Orpheum theater tonight in Memphis, yeha! Martyrs Without a Cause: #RedNeckLivesMatter #PCPolice https://t.co/wpKPzK0NVj RT @BeaverConcerts: 2 days #Memphis! Last chance to get your spot @billmaher @TheOrpheumTN! #choose901 https://t.co/2w7Dqj0ehZ https://t.co… THANK U for all the b'day wishes! And even more for signing the petition! We passed 100k quickly, but rolling up the score feels kinda good! The idea that a Palin endorsemnt wld make a person vote FOR someone..let's just say I finally found a place where evangelicals and I differ! Watching the Dems right now, its just not as much fun watching sane people debate. But it sure makes you think one of them better win. So my request for Obama to come on Real Time crashed their website, so if u can't get on keep trying - and thanks!!https://t.co/MHxRC1wO44 Wondering what to get me for my birthday? This would be nice https://t.co/WeroOIzqk8 https://t.co/ifiXBlELAU Very excited to go back on the air in a half hour. This will be the most memorable election year ever! @HBO #RealTime Returns Tomorrow w/@algore @NicolleDWallace @johnkrasinski @CornelWest @ralphreed https://t.co/akKGH9cJyF OK, I can't take anymore. Surprised I took this much. But tomorrow...10 eastern...HBO...oh, there will be blood. And Al Gore is on! Ben Carson is just in the wrong industry as a politician. His stock has fallen so fast Oil feels bad for him. Christie: Just keep the bad people out. Shit, why didn't we think of that? Just keep out the ones who self-identify as bad! Duh! So we're not the world's policeman, but we'll bomb and torture anyone anywhere for any reason? Should THEY be calling a policeman? of all the issues they are infuriating about...lambasting Obama for not doing...exactly what he's already doing, always takes the cake And one more thing: Do you get to say \"New Yorkers are garbage people\" if you're a Cuban from Calgary? And by the way, what is a New York value? A studio apartment for $2,500 a month. Value - that's a steal! Cruz to New York: Drop dead. If we didn't have the stupid electoral college, they couldn't write off THIRTY EIGHT STATES! Of course Trump is for arming everyone, he's got the bulletproof hair! \"Isis does not get their guns from gun shows\". True - they get them from the U S military. How many humvees did they capture in Mosul? Yes, when Obama said Rednecks cling to their guns and their religion...way off on that one. Oh Jeb, does Fla. really get to weigh in on guns? The one with the law \"If you make me nervous, I get to shoot you?\" Well, that wasn't so bad. What, there's more? Shit. I'm playing Words with Friends with John Kasich right now! Christie: \"I vetoed a ban on guns that can shoot down airplanes and through the doors of squad cars.\" Applause. Wheres Isis when u need 'em? I've seen productions of Boys in the Band that weren't this bitchy. Man, for a Canadian, Cruz fights nasty like a...well, like an American! Trump to Cruz: \"I'm not bringing a suit, I promise\" - that's what he said to me before he sued me! The crows at the republican debate just booed the Wall St Journal. Welcome to the Bird Sanctuary Thank god, a commercial break. \"Back to more making you shit your pants, after this word from Depends!\" Saying we need to rebuild our military is like saying county fairs need more fried foods I like the audience shots - takes the myth that the Republicans are a bunch of angry old white people...and proves it Christie: \"If i'm president, Hillary won't get within ten miles of the white house\"- great, more bridge closures Love the way they now all say \"Sure, the millionaires are doing great...\" - and when I find the assholes who paved the way for that!... Haha, Cruz made sure he was first to say Obama's a pussy because our sailors got released, on a question about the economy. He's the worst! And what a great night for this - the perfect promotion for #RealTIme coming back from our winter break tomorrow night! Thanks, Assholes! Sitting down for the Republican debate with my popcorn! Ok, not popcorn, liquor. It is the Republicans. Tonight #GOPDebate Facebook and Twitter Live! https://t.co/U8VxIldqHs Who watched the State of the Union? Next question: How bad do you want to punch Paul Ryan in the face? RT @PBS: Don't miss @billmaher tonight at 8/7c in #FindingYourRoots @PBS with @HenryLouisGates. See a preview here: https://t.co/cMqQkYPejx Hey look who else i found down here while scavenging on the beach, 'ol beachcomber Larry! https://t.co/WzXK5ws6UX Of course i had to take jeff to pay tribute to the King of this island... https://t.co/1Peumr8sSN Happy New Year! https://t.co/7ImgqO6NgW On the party bus heading over to the gig. Thats right i said party bus! https://t.co/0Ov8tBCIgq Happy new year everybody! Still on the beach here in Hawaii with Spade and Ross. Oh, its gonna be funny tonight https://t.co/JAUt0mCHrH \"Mr. Cosby, good luck to you sir,\" the judge told him. WTF?? Good luck with what, more rape? Is anyone not a moron anymore? Don't forget we're back January 15th! @HBO #RealTime https://t.co/jYF3A5CmKC Happy birthday, #TedCruz,  you amoral putz, who keeps going up in the race - that's the Republicans for ya, the shit rises to the top And some of these people - oy. Frank must be spinning. Is there such a thing as DISowning a song? Watchin Sinatra100: Do country singers need to wear a cowboy hat w/ a tuxedo? Ur Garth Brooks, ur..other country guy, we get it, ur rednecks Dr. Ben looked bad last night: Look everybody, I studied up, I know what a Shiite is now! And Trump didn't know what nuclear triad meant. Oy Now that 1st 96 hours of the debate r over, quick question:a president's 1st job - keeping the ppl safe?Cuz they've been kinda vague on that RT @rbpconcerts: Pre-sale tickets are on sale NOW to An Evening with Bill Maher live in Sacramento this Valentine's Day! Code: BILL4 https:… L A now? When are cops gonna get it: U can't just shoot people in the street! Folks have cameras now! Jeez, what were they doing BEFORE? Ted Cruz is like a \"Survivor\" winner: forms an alliance with Trump only to lull him into getting killed off. Never forget, #CruzIsTheWorst RT @rbpconcerts: Pre-sale tickets are on sale NOW to An Evening with @billmaher live at Marin Center on March 26th. Code: RBP https://t.co/… Oh I see, they believed the baby wld go to paradise too if they did the attack. Sure. C what we mean about bad ideas leading to bad actions? Steven Weinberg said that, and that's how you get ppl who \"always acted normal\" (don't they always?) dropping a baby off to go to a massacre \"W/ or w/out religion U wld have good ppl doing good things &amp; evil ppl doing evil thingsBut 4 good ppl to do evil things that take religion\" Stop comparing random shooters to Islamic terrorists. Apples &amp; Oranges. One is bent on acquiring WMD to set off in America. End. of. Story. I see the computer hackers Anonymous are going after Isis - if successful, it'd mean martyrs DO get screwed by virgins! Happy TG everybody! I don't want to say my turkey is big, but a Russian fighter jet just entered its airspace! Freed Israeli spy Jonathan Pollard called 'the Jewish James Bond' - I can see the movie: \"Tomorrow Never Dies, It Just Keeps Complaining\" Liberal Values vs. Islam: @HBO #RealTime https://t.co/LRJLBS2yhs #BenCarson is the black Sarah Palin. Says he loves the french, especially that pyramid in front of the Louvre where they keep their grain As someone with the credentials of always keeping it real about Islam, let me say Trump's idea about registering Muslims is outrageous. Republicans have Obama right where they want him on the Paris attacks: as usual, an abject failure to overreact on his part Feisty fun time with Colbert tonight - one more Real Time on Friday and then I 'm off till new years eve in hawaii! Gone fishin'! #ParisAttacks Lets make #TerrorismSociallyUnacceptable which means liberals standing firm for Liberal principles! Yeah, Trump talking about nukes, i gotta go or i won't sleep tonight. Peace out! OK...now we're getting to the foreign affairs part, which, if possible, they know even less about. I can feel me going for the remote... Biggest applause is to upbloat even more the military budget. Hard to say who's the bigger tools, the candidates or the audience. Jeb Bush: Should i even stick around or, maybe beat the traffic? Herman Cain was a joke for saying 9-9-9! Ben Carson is serious, cuz he says 10-10-10. Is there lead paint in those flag pins? #GOPDebate Hey moderators, stop asking how they'd pay for it! DIdn't you hear, My tax plan lets you eat whatever you want and lose weight! Cruz: \"There are more words in the IRS code than the Bible\". Yes, but none of them are in favor of slavery or ethnic cleansing. And \"Let's try the one thing in healthcare we've never tried - the free market!\" You see why i'm drunk now?! Carly: \"I have led innovative businesses!\" Into the ground. And then they fired me. I'm doing a shot every time Carly lies. I'm drunk. #GOPDebate Kasich and Bush, gotta give 'em credit on immigration, trying to start a \"Republicans who believe in Reality\" movement. Good luck with that. Trump's immigration plan is like a bar at closing time: You don't have to go home, but you can't stay here! #GOPDebate Trump: \"We are a country of laws\" Thankfully, bankruptcy laws Ben Carson: Stop smearing me with these unfounded accusations that i'm not a murderous psychopath! Carly, how do you explain Dems creating more jobs? Carly: Let me tell you a story about some lady. #GOPDebate Have you noticed they always sit the three black people behind the moderators? I think this is Jeb Bush's fourth Do or Die moment. Let's just say he's not Doing. Kasich said \"thrice\" - is that too fancy a word? I think it might be! #NotaWelder btw, fact check: average wage for welder, 37k; philosopher professor, 89k. TongueStuckOutEmoji. This is boring. Let's get to the part where Ben Carson attacks his mom with a hammer. Marco really studied his flash cards for this one! More welders, less philosophers! Yeah, that's,um, vaguely anti people i think i hate! gotta give it to Trump, he doesn't pander: 'Minimum wage? Fuck you, get rich or die, next question.' My first question for the debaters: This is on Fox Business channel, is that NON-LIBERAL enough for your pussy asses? Is it me, or does Reince Priebus look like that guy at the funeral home who comes in with the casket catalogue? About to live tweet the Repub debate, and the big question, How long will i last before i say \"Fuck these assholes, i feel physically ill!\"? #GOPDebate https://t.co/NiXBwwo7CA Did Jeb Bush really answer the question \"Would U kill baby Hitler?\"? Yes, he did. Why do ppl get mad at me for saying its a stupid country? Headin out to Ames, Iowa for some quality time with vote-begging Repubs! Also standup tonight at C Y Stephens at Iowa State! Republican Neophyte #BenCarson: https://t.co/JNdb42nUZs Did Dr. Giggles really say the pyramids aren't pharoahs' tombs, they're Joseph's grain silos? Who's he appealing to, soccer mummies? RT @StephensAud: Bill Maher performs on Nov 7. Do not miss a night of stand-up comedy and a great night of entertainment! - https://t.co/Up… RT @CBSThisMorning: .@billmaher: Not sorry to be unapologetic https://t.co/yQxE1WnQjL https://t.co/tk5L3myqhi With Kid and Vice's Eddy Moretti at game 5. I got my special @Mets cap on tonight so I ain't worried! https://t.co/G0W6JglmSO With Kid and Vice's Eddy Moretti at game 5. I got my special @Mets cap on tonight so I ain't worried! https://t.co/hRhsS134oZ Here it is , the moment before the Royals begin to lose hope! Go @Mets! https://t.co/D3nAtHnGum Fireworks at the stadium!!! Oh shit, Jason Pierre Paul just lost another finger. #LiberalsLoveBaseballToo https://t.co/ujLh85bBZT PC Police Stop Trying to Ruin Halloween: #DracLivesMatter #PCPolice https://t.co/0z94772K5e Huckabee: Eradicate diseases and you fix medicare, duh! As a former fatty, he should know, the patient has to cooperate a little! I'm not losing faith, but this lineup is not getting it done tonight - and the Mets could use some hits too!! Christie just ate Bush's lunch! And probably others. Now this is the inning we have to get some runs!! When in doubt, shit on the federal gov't. Fantasy football? Fuck the federal gov't! Trump is right, Bush is low energy. He always looks like the guy who's in the car reading while his wife is in a store shopping. Debt relief? Fuck debt relief, we need long relief - get somebody up in the bullpen! The big takeaway so far from watching the debate between innings? Not. Missing. Anything. Way to score!!! No, not you Carson you crazy head case, Murphy!! oh my god did i just hear Ted Cruz say something awesome that i agree with? Yes. The media is even stupider than the pols. Who's on first? deGrom is mowing them down! And Kasich was pretty good mowing down Trump &amp; Carson on living in FantasyLand! Go Kasich! Wait, i mean Go Mets! The only way this debate is going to be survivable is if the Mets get out to a big lead. Then i don't care what Trump says. Like now. Oh lord,another debate with more STUPID QUESTIONS?! Asking \"What's your weakness?\" is an invitation to a humblebrag, fools! Back to the Mets You mean prophecies from 80s movies are NOT reliable?? Congratulations @Mets and one more series to go! Turkey has held VICE reporter Mohammed Rasool for almost 2 months for nothing. All journalism suffers from this bullshit - HELP #FREERASOOL For those who say reneging on pulling out of Afghanistan = lack of progress,remember when those troops come home they can go to gay weddings The real reason why young men with guns use them in #massshootings: http://t.co/l3GTJP3KkV What Republicans Hear: #Bernie Said... http://t.co/FOpKxFJAP0 RT @BernieSanders: Tune in to Real Time with @billmaher tonight at 10 p.m. for a discussion on the issues facing our nation.  https://t.co/… OMG - so proud of @Mets  Studly by a few, valiant by all. From what I see of the debate between innings, those 2 guys on the ends? Yeeesh. You 2 are not. going. to be. president. Of anything, ever. I thought Hillary just made a good point in saying...oh, who am I kidding, Murphy just took Kershaw deep! Go @Mets! Did u c trump found a hispanic person who likes him the other day? I dont know who i feel sadder about With Rob Thomas after the show. And right before the Mets won!! http://t.co/gLGODWjEsa Not to gloat...but wow. Go Mets. The #SelfieGeneration: http://t.co/UFFjNMopPc #selfie @realtimers https://t.co/xKIPOSPRQw RT @rbpconcerts: Presale tickets on sale NOW for New Year’s MAHERMAGEDDON w/ @billmaher @DavidSpade &amp; @realjeffreyross. CODE: BILL4 http://… To our defense team who keeps asking, Where are the moderate, peaceloving Syrians we'd like to support? Here's a hint: They're in Germany. Bravo to #Netanyahu for his 45 second glare this week at the UN! The Jews have finally done it, they weaponized guilt! With my 2 fav scientists: 'not in your league but always on your side' i told them http://t.co/vTZZLpXqMK Make Nazareth Great Again! #SupplySideJesus @GOP: http://t.co/u70xdMfvAK What happens if we bomb Syria and Russia bombs Syria at same time? Is it like a 2 guy 3way where the guys' dicks touch by accident? Trump keeps saying what he wants to do for America is \"make great deals\" Is that the president's job? Like he's democracy's personal shopper .@Vice and @BarackObama in the #VICEonHBO Special Report: Fixing the System. Tonight at 9PM on @HBO. Heading to my weekend in up state new york! Love me some Buffalo! Shea's tonight, bring ur ass you'll laugh it off! Racist Republican Mascots @GOP: http://t.co/f0sja5DrUW RT @HBO: Exec produced by @BillMaher, @Vice makes history with @BarackObama in Fixing the System. Sunday at 9PM on #HBO. http://t.co/gBCPPU… People are really starting to turn on Trump now. Today Ivanka told him she thinks they should date other people. Political religion, and about how gullible people can be. #SunkCostFallacy @GOP: http://t.co/MJjWVNdyRZ If you haven't used up all your heroism on the clock kid, try hashtagging #AliMohammedAlNimr http://t.co/yVRNgkNdNz Oh fuck, their best friend, Ben Gazi...I can't stand these assholes for one more minute - peace out! I think #BenCarson might have inhaled a little too much anesthesia 20 minutes on valet parkers without I D while flames from wildfires lick the walls of the Reagan library. HOW BOUT A CLIMATE QUESTION????? When does one of these assholes have the guts to call Reagan out for his amnesty for Mexicans? For the first time in this campaign, Trump is humbled (by Carly) and looked apologetic and not true to what he believes. Start of the end? Carly: I'd urge every American to watch these doctored, heavily edited, manipulated tapes and come to the false conclusion I have! How about asking the one woman on the stage about Planned Parenthood Quick question: When #TedCruz shaves in the morning, how does he avoid spitting in the mirror? #GOPDebate Bloodthirsty, factfree belligerence: Yayyy! Rand Paul's reasoned restraint: polite smattering. Dead Nixon just called Scott Walker: I want my lip sweat back! Carly explaining Republican diplomacy: I'm not talking to you! We insult you,and then you do what we say! Why is everyone overthinking this? When #BenCarson speaks, i keep waiting for one of those Lunesta butterflies to fly by \"I want to talk about serious, non-personal issues, but PizzaFace and Fatso here won't let me!\" Don't adjust your sets, Scott Walker's face really looks like that The conspiracy of delusion about how Obama wrecked America is astounding. Hello, unemployment is lower than Reagan ever had it! Two minutes in, and its kindergarden slams about who's ugly. Even professional wrestlers are like, Guys, c'mon...a little dignity. #ChrisChristie: Take the camera off me. American public: Good idea. To sum up opening statements: God bless America, too bad its such a shithole. #GOPDebate Jeb, lame opening. But, when he sees a plane inside a building he thinks of his brother, so he's a little off his game. #GOPDebate #BenCarson needs to chug a little red bull before the show. Nice gesture tho that he offered to separate Christie's conjoined chins Trump used to hang out with serious people like @LouFerrigno and @LaToyaJackson and now he has to share a stage with these losers. #Sad Must say, #ChrisChristie looks good tonight, he really - oh, wait, sorry, that's Air Force One 1st off, Air Force One in the background is confusing: CNN viewers are thinking, Wow, they found the missing plane! Back by popular demand, i will be live-tweeting the debate! And its the best live tweet, the other ones are terrible and their numbers stink RT @GavinNewsom: We'll colonize mars before @realDonaldTrump ridiculous \"build the wall\" plan happens. Failure. Check out my video https://… RT @nycomedyfest: See Bill Maher headline The Theater at Madison Square Garden! Tickets here -&gt; http://t.co/hcWfTSMZzT http://t.co/lAvFuAgH… RT @hardball_chris: .@billmaher on @hardball tonight. I expect some shots at @realDonaldTrump ... and at us for covering him so much. #hard… As someone who's never been agst the death penalty in principle (Let's kill the RIGHT people!),this #RichardGlossip seems Not Guilty! Jesus! They did come - thanks guys! Tonight its Sioux Falls, U comin?    And don't feel left out, I bet god fuckin hates U 2 http://t.co/31FZL1ZXlE 911 hijackers: 14 tourist visas,4 business visas, 1 student visa. Somewhere a poor syrian is thinking \"maybe this is a bad time to ask\" In Wichita for tonight's show at the Century 2 and where are my friends from the Westboro Church? Don't tell me God doesn't hate me anymore! The Migrant Headache: http://t.co/k2I865fSwf RT @argusleader: .@billmaher Q&amp;A ahead of @washpav show: ‘What’s good for comedy is bad for America’ http://t.co/6Imgibpue9 http://t.co/UHi… You can be a religious martyr, but U can't expect to keep your job. Cuz that's the thing about a job - you have to do it. #KimDavis #KimDavis makes 80k. Avg income in Rowan County: $13,888. Forget Brokeback Mt, the people of Rowan County are the ones getting assfucked. RT @PearlatPalms: Enter for the chance to meet comedian Bill Maher at his Oct. 24 show at The Pearl in Vegas: https://t.co/7DBQLRnh5P http:… Memo to #JudgeKimDavis: \"Faith\" is just an OPINION. That your old book of ghost stories and recipes is 'the word of god' is just an OPINION. Turkey under Erdogan has been on my last nerve for a while, but jailing 3 @ViceNews journalists is WAY over the line.#FreeViceNewsStaff now! $71 billion spent on rebuilding Gulf Coast/ New Orleans in last 10 yrs. And worth it! We now have almost full employment for trombonists OMG Trump and Palin are a team now! As foretold in Revelations. Since all serial criminals are always known by 3 names, I say we call him Bill Wayne Cosby. Let's get it started, people: #BillWayneCosby So glad New Orleans 10 years after Katrina is back to what it once was:America's premiere location for sorority girls to vomit off a balcony Man, #HillaryClinton just has no luck. She went out to dinner tonight, and her server was wiped. #RealTime @RickSantorum: #ClimateChange &amp; @Pontifex Debate: http://t.co/PsYdrBnF8D RT @HBO: Tonight join @RickSantorum @wendydavis @costareports @DanaRohrabacher and @michaeldweiss on #RealTime with @BillMaher. 10PM on #HB… Was just in Roanoke Saturday night playing a stand-up show - a warm, welcoming, good-humored community. Heartfelt condolences. Since 50 North Korean subs slipped out of port and vanished this week, maybe there are better things to look into than Hillary's e mails As a resident of Cali,this is not good news about pumping so much groundwater the state is sinking.Altho it does make Tom Cruise look taller Glad N and S Korea have walked it back a bit, the ladies at my nail salon were Freaking! I'll just say this about this awful, disgusting story: I will NEVER EVER eat at Subway again!! Because I never ate at Subway before. Trump on Jesus: \"He's not a Savior. He's a Savior because he was crucified. I like Saviors who weren't crucified.\" I put some of the yellow water from the Colorado River spill on my brown lawn and now its a lovely color between mahogany and John Boehner Gay marriage, Iran deal, now an embassy in Cuba! Republicans are Havana bad summer! .@NYComedyFest Presents AN EVENING WITH BILL MAHER - The Theater at Madison Square Garden Nov 14, 2015 #NYCF  http://t.co/YVC9ZBM7Lr Damn, i fell asleep - can somebody tell me how it ends? (Note to idiots: don't actually do that, i can guess) this quake can be felt all the way on the east coast! But not in the middle they still get the flyover treatment Oh, he doesn't work too much, they have a dead kid. That also happens A LOT to movie couples. Paul Giammati is perfect as the scientist. In fact, why isn't Paul Giammati ALWAYS a scientist? Jesus, i'm glad i don't live in...What? I do? Better roll two. Oh shit, a chef just caught on fire. Is this a comedy? I better roll one. We'll see who she wants to be with once disasterous shit starts hitting the fan. Hint: it rhymes with The Cock, and its not Doucheface. Right, like she'd rather be with Doucheface New Guy than The Rock. Well, i guess he was spending too many hours working... In disaster movies the lead guy is ALWAYS newly divorced and pining for wifey. Who has ALWAYS moved on to a new guy. Watching a Still-in-Theaters movie in the hotel, my fav thing to do on the road. Tonight: \"San Andreas\" Get ready Charleston, i'm at the north charleston performing arts center tonight and all will be revealed! RT @RealTimers: Bill Maher returns to @HBO tonight at 10! Get the scoop on his guests @ the #RealTime blog: http://t.co/KPPInloTZQ http://t… RT @BernieSanders: .@Pontifex says climate change is one of the great crises we face. I'm waiting for one word from Fox and the Rs on it. #… I thought this was 90 minutes? I got #RealTime coming back on tomorrow night,I got to go work. But I never thought I'd say it: I miss Romney Rand Paul remembered one thing from his debate prep: If they ask about Gay, bring it around to GUNS RIGHT AWAY!! #MakesNoSenseWhoCares? Great pitch, Jeb: \"Elect me, and I'll make America like Florida\" Really?? The order came down from Roger Ailes: Destroy Trump! Don't let him get off his zinger about how Mexicans are lazier than Scott Walker's eye Saving Benghazi for the encore? Remind me to click to a different channel when this ends, i don't want to wake up to Fox &amp; Friends And stop saying \"On day one\" - no one gets anything done on the first day of a new job What's the over-under on Climate Change coming up in a #GOPDebate before the wildfires take out my house? Do these morons even know the diff between Sunni and Shiite? Or what the countries in the middle east are? They'd be bombing Arianna Grande What about pimps and prostitutes? Huckabee wants to fund social security on their backs? Could work, they're already on their backs Christie just broke the \"Whatever you do, keep pandering\" rule. He's toast. And he's fat, so make a toast joke, I'm getting tired. Get to China, so Trump can call them Motherfuckers! Ben Carson doubts HIllary will be the Dem nominee?? Ben, do you still have your brain-cutting tools? And a mirror? OK, lie down...#GOPDebate I love the ads! \"More of how to save America,but first another ad that takes gay-hating old ppl's $ to accuse Supreme Crt of being \"lawyers\" I knew Education would come up. And I guessed right on the audience reaction: BOOOOO!! Scott Walker, the voice of reason: \"Fellas, fellas, let's stop arguing and join together in some factless shitting on HIllary!\" Easy there, Ben Carson, they let you into their country club, don't get uppity now. #PostRacialAmerica Trump says our leaders are all stupid, Cruz says Egyptian president is smarter than us - why do they want to be the leader of this shithole? NOW we're debating:'You hugged President BlackMan!\" \"No, I hugged people after NINE-ELEVEN!\" This is why I paid good $ to see this! Oh wait This is just me, but after 15 hours of picking fruit, I'd be too exhausted to rape Something just feels right about interrupting the GOP debate for president to sell stupid shit on tv #CommercialsMakeMoreSense Jesus, this is the worst production of Glengarry Glen Ross I've ever seen #GOPDebate Oh good, the Determined-to-lose the women vote competition has begun! Scott Walker's prolife - its the born child he could give a shit about Enough with hating on Trump for being misogynist! Get to the part where these 10 guys debate whether Amy Schumer is fuckable. #GOPDebate Good for you, Megyn Kelly, calling Ben Carson an idiot right off the bat. #GOPDebate I went to the bathroom and came back and just heard massive booing - did someone say we should have a heart about something? I hope you're playing the Republican Debate Drinking Game like I am. That's where you get smashed before it starts so you can stand watching Its been a long wait, but Repub debaters will again be screaming about Mexicans and vaginas tonight! I'll be live-tweeting the real one at 9 Solar jobs now outnumber coal jobs 2 to 1! Its not about jobs!Repubs might as well say We can't have e mail cuz it wld hurt the Pony Express Media morons decrying lion's killing and in next breath drumming up hatred for sharks! Sharks are endangered and need protection as well. I sense momentum shifting to the Iran deal - Iran's prez said they're now throwing all their research behind a depilatory that doesn't sting 97% of scientists agree, climate change is real and humans are a significant contributor. It’s time to #ActOnClimate #ChrisChristie is a dick. Making his stand agst pot. In 2015. Cuz we can't have ppl with no discipline about what they PUT IN THEIR MOUTH. Starting to think #JoyceMitchell not that bright. Comes out now her best friend in high school was the bright red dot from a laser pointer. Mellencamp was on his game tonight at the Nokia! When this guy says Ain't That America, it is. http://t.co/CEDAd2zdJm I predict that sometime in the next few months the number of Republican candidates will surpass the number of #BillCosby accusers. #Hightimes cuboulder https://t.co/vRmntlVv4G Pikes Peak Center tonight in Colorado Springs - U know i love to go where the VERY religious dwell! Come on down and have a heart attack! Three...two..one...cue The Good People saying any criticism of Islam = bigotry. #Chattanooga Media keeps saying \"We don't know the movitation.\" I'm sure it'll be as surprising as the name was. Kudos to #ChrisChristie today commenting on our shitty criminal justice system. Every once in a while the Jersey cow moos something good. #MajorGarrett is a huge asshole. If U wanna \"strike a nerve\" with POTUS, why not just scream the N word? That shld get his attention. #IranDeal Just on foreign affairs, what a shame Obama can't run again. 22nd Amendment is a Mercy Rule to make sure Republicans get a turn #Jared was always creepy. And btw, doughy bread and processed meat &amp; dairy is not health food! What must he have been eating BEFORE Subway?? To those who say #Cosby deserves his day in court:Do we have the time?! 'Witness #437...and then the stenographer wld like to say something' If CNN has 1 more Breaking News that NOTHING HAPPENED I'll lose it. Freaking ppl out is what terrorists want. Cable news is Isis' best ally if we remove everything that was pro slavery, gotta take down the Washington monument. On the bright side, we could get rid of the bible. ♫ Just Announced: Providence, RI - Nov 15 at Providence Performing Arts Center http://t.co/5IfsRTGla5 In America, you can be armed - just not with the facts. #MysteryMeat #RightToKnow http://t.co/t9G4HuwyV7 RT @shanesmith30: Tonight on our season finale I just want to say thanks to our whole VICE team and most importantly to our fans. We love y… RT @JerrySeinfeld: Comedians In Cars new episode tonight with @billmaher !\nThe comedy team of \nSmug and Arrogant.\nhttp://t.co/MDGxxNNjgz \n … #JebBush doesn't care about black people, loves white women in a persistent vegetative state. More on this Friday night. By the way, why WOULD you want the confederate flag on your car? Its like telling the police \"The meth is HERE\" #PoliticalCorrectness in America: http://t.co/Jv2hSUbhGL I'm sick of this #RachelDolezal story already. My friend D.L.Hughley once said it best: \"Everybody's black till the police show up\". Hey, easy on the lady who was just posing as a black person - maybe she got a bad perm and just decided to run with it We are tired of everyone watching us all the time: #SurveillanceState http://t.co/H2arE6VNV0 RT @MMFlint: @RealJeffreyRoss just nailed it on Bill Maher about our disgusting prison system. \"Jeff Ross Roasts Criminals\" on Comedy Centr… B real, Cavs' \"bad luck\" began with 2 shit calls; why do NBA refs have to suck so much? This isn't the TSA, we cld find ppl who cld do this RT @FoxRiverside: #FathersDay gift idea… Enter for a chance to win a 4-pack of tickets to @BillMaher on June 21! http://t.co/zEnEiJV0KN htt… #WarOnChristians - Victims of the liberal media @GOP: http://t.co/e6xTnQydys RT @yankeedevil10: \"Full Durham\". Thank you Bill Maher, it was worth the water out of the nostrils. #GOP http://t.co/McwemWq4U9 Sorry all my lovely new European friends, but U have to admit that as bad as the FIFA scandal is, its still more interesting than the sport Someone asked me if I'm gonna call Jenner Caitlin - of course! Whatever she wants! But I'm stickin' with Cassius Clay. The bland and the blad are pretty good but the blommer is kind of a bummer. http://t.co/DMZdcHGPnV You'd think people wld just know, but no, u gotta tell 'em - byggutfart! Jesus. Typical. http://t.co/C4ITwrkNIb And here I am being interviewed at the Oxford Union - what an honor! And also something Jenna Jameson did http://t.co/N9vsZrpHQc My visit to Oxford included a wonderful tour, and also not giving a shit who this dude was http://t.co/AhTQMc2WrR These old phones are awesome. But they don't take pictures, what's up with that? http://t.co/MhK6VNGd1v Europe: Octopussy. America: Octomom http://t.co/mDLL9j4l3c Why is the Eiffel Tower sporting truck nuts? http://t.co/GmDn8rpg7j If u dont get any in the red light district u can cop a feel on the street. Some of the shit here is just weird. http://t.co/Y0AelNATWk New York mag used to have Predictable Headlines contest. Todays \"Obama's twitter debut met with racist barrage\" would qualify I love the openness, the liberalism of Amsterdam! But anal cruises? I dont think i wanna know... http://t.co/d03HYUgtUN Great visit with @GeorgeLopez at De Meevaart Theater in Amsterdam last night https://t.co/5Lnf6UtW7m What i love most about travel is running into old friends http://t.co/Cpo75Z0mX0 Biking thru Amsterdam - best way to see the city! http://t.co/fCknMactlQ RT @NYMag: No boots on the ground until ISIS kills at least as many Americans as our three-year-olds do: http://t.co/mFsft2MRJf via @RealTi… U thought Isis was on the run and now they took Ramadi? Reminds me of the Clippers 76K just on runs to Wegmans! He shops for groceries like Michael Jackson did with toys, calls ahead and they close the store to the public This Chris Christie story spending 300k on food - if there was an app to create comedian premises, this wld be first one it spit out -@KillerMikeGTO on @OReillyFactor @HBO #RealTime: http://t.co/TGTSZ9cdUf Reading about PersianGulf summit Obama had,Sheik this, Sheik that, SheikSheikSheik and now i can't get that Taylor Swift song outta  my head #BlackishABC Tonight! https://t.co/F9O6LQlkv4 just watched the Kurt Cobain doc on HBO. Interesting where C Love goes into bathroom with her mike on and says \"Of course, killed them all\" #TEXAS: The White Somalia #JadeHelm15 http://t.co/GjbT7jO7gb Unemployment down to 5.4 - wow. They say there are openings at the Baltimore PD, but its backbreaking work. Thank god #TomBrady has addressed the nation. I don't care about this, but i will say his jaw was tenser than a fluffer on a cigarette break I have a question about the i watch: how small can porn get before its just not worth it? OK, saw the fight, I see what the complaints are about - it looked like what is was: 2 men fighting over a purse and a matching belt. National Do This Not That Day: #MissionAccomplished @HBO #RealTime http://t.co/6gcPFNiE9o RT @carlreiner: Thanks @BillMaher this photo of us &amp; the Foreword you wrote for my new bio is making it a hit. http://t.co/MfoT1DATyx http:… #FreeRangeParenting (@HBO #RealTime) http://t.co/TccHSYYwHq RT @MARS0411: @billmaher Thank you for talking about  @TraceAmounts. I saw it &amp; recommend that all watch it. Everyone should know what's in… I have image of Hillary &amp; Huma on their road trip as the D.C.Thelma &amp; Louise. Talkin' Bill, Anthony..dont let that van near the grand canyon 420 Holiday catching on! And medical pot now legal in Georgia! The south will rise again, but around noon. It’s high time we had a National Weed Day. Sign my petition here: http://t.co/JaZVQKHb1E http://t.co/vYwn3bwJ0r Nasa's Messenger probe has been orbiting Mercury since 2011. While its wife makes it look for closer parking. RT @Playboy: .@BillMaher talks puritanism, sex in the public sphere &amp; more in our Playboy interview - http://t.co/7kkxURF3sV http://t.co/Ae… Atl cheating teachers, shame on you, yes - but that sentence? Once again, U can do bad shit in America, just don't try it while you're black RT @Variety: Bill Maher Courts Danger By Working Live On HBO http://t.co/4KJCRSoYic Explaining Jokes to Idiots (@ZaynMalik Edition) #RespectForZayn: http://t.co/jZYDxkei2m #GayCake @GOP: http://t.co/obDJFcXp25 Obama in Panama for the Summit of the Americas - or as they call it on Fox, \"The War on Isthmus\" RT @BuzzFeedNews: .@billmaher: @HillaryClinton Has My Vote But She’s Not Getting A Million Dollar Check http://t.co/IOhADESyOE http://t.co/… RT @HBO: The wait is over. HBO NOW is here.\nStart your free trial. #GETHBONOW http://t.co/kTqVIG4IJN\nhttps://t.co/02b2NLKHQ0 I always love it when Easter and Passover fall on same weekend cuz it reminds you that somebody's gotta be wrong. (Or both) RT @varvetpod: The brilliant @billmaher is headed for Europe but first, a stop at #varvetpod! Fame, controversy and more: http://t.co/t4p8A… To those enjoying the Jesus myth, it'd be great if he said\"You Twitter ppl think U have followers? Mine actually FOLLOWED ME AROUND, bitch!\" Indy &amp; Ark: Yeah, what cld go wrong when U base your morals on a book written by insane, ignorant, superstitious Bronze Age desert dwellers? RT @rbpconcerts: @billmaher returns to Santa Cruz Civic Auditorium on Sunday, April 19 at 8 P.M.  #billmaher #santacruz  https://t.co/gT8yq… Indiana doubling down on their antigay \"religious freedom\" law, just like Jesus planned. Your move, Alabama. Dear Far-Left: #PoliticallyCorrect #Liberals http://t.co/sjprFxLD4s pulling myself together to do my show tonight after news of Zayn Malik quitting 1 Direction. Next stage in his career? Rejoining 1 Direction #TedCruz is in! Yeah, man - what's not to love about a guy who acts like Joe McCarthy and sweats like Richard Nixon? Last night @palms! #Vegas https://t.co/1ZomZGBE7g Off to Vegas, baby - tonight and tomorrow at the Palms! Best show in town without acrobats! A cult is a cult, and that's what a frat is: http://t.co/xVvhZEvd9s Starting tonight, #RTOvertime will be live-streamed on the #RealTime @YouTube channel: http://t.co/I16WsLwmEq http://t.co/Ae9310QXnk RT @VegasMagazine: . @billmaher shares his thoughts on the upcoming election, 2016 political issues &amp; his upcoming appearances @Palms. http… Are U proud of being Irish?people ask. How can U be proud of something U didnt accomplish and  had no choice in?But Happy St Pats, my peeps! Starting to think this Durst guy is kind of a creep. Oh, and Richard Nixon's ghost e mailed, he said When doing shady shit, shut the fuck up Congrats to doctors in SAfrica for performing 1st successful penis transplant! And for telling patient\"Don't worry, the swelling will go up\" #Affluenza: af·flu·en·za the lack of motivation experienced by people who have inherited large amounts of money: http://t.co/RiN2N5qEHf RT @ariannahuff: Going on Real Time this Friday w/ @billmaher. Here's one of my favorites of us at my home in LA many years ago! #tbt http:… RT @shanesmith30: Again due to TREMENDOUS response to premiere HBO has let us put up the full ep on Youtube. We love you.\n\nhttp://t.co/n6p5… Press conf was good 4 Hillary cuz showed she can take a beating from infantile press over utter bullshit and thats all our politics is about RT @HBO: Introducing #HBONOW, premiering in April on Apple TV, iPad and iPhone. http://t.co/rPHXmrciXf Man, the Republicans are not getting off this e mail thing. Better get #ElizabethWarren up and throwing in the bullpen. And she's a lefty! Watching the commemoration in Selma on the news - so much has changed in 50 years! Like, the cops didn't have tanks back then. I'm glad Harrison Ford is OK, but I must say, I've always been for crashing planes into golf courses @HBO Real Time: Law Offices of #JudyClarke (Web Exclusive) #Tsarnaev http://t.co/ebG6a0SuSX The racism proved 2 exist this week in Ferguson:how likely we stumbled on the 1 place in America where that was going on? #HowManyFergusons? Hillary's emails? I want to see Bill's: Hey,Epstein,gas up the plane, let's go to Sex Island! I want to be balls deep in Russian whore soon! CPAC used to be the loonies, but this Republican congress IS CPAC now!(you saw the asshole with the snowball!) Its just a #RaceToLobotomy RT @Palms: Here's your chance to meet @billmaher and see him live @PearlatPalms on March 21. Enter here: http://t.co/efMbLyUrGq http://t.co… Remembering #BillOReilly as a journalist is like trying to remember Lindsay Lohan in Freaky Friday - it seems like another planet we were on RT @VICE: Killing Cancer: Tune in to @HBO tonight at 10PM for #VICEonHBO's in-depth special report http://t.co/rOdHaIrYha RT @alfranken: Today’s #NetNeutrality ruling marks a huge victory for free speech. Thank you to everyone that stood up to keep the Internet… RT @shanesmith30: Our special on cancer is coming this week. Couldn't be more excited. http://t.co/nsXEdR42Eu Special #NewRules for the 20th anniversary season premiere of @RealSportsHBO tonight 10PM ET/PT http://t.co/wPwdtGveRX Told ya. Never vote agst affliction! Theres no blacks at the oscars but Felicity Jones at least sounds kind of black Never go up against affliction at the Oscars, people. I had this one in the pool! lady gaga is only wearing that because her meat dress went bad Man, Travolta has no shame about hair. Nothing gradual there. Just, fuck it, i have total hair again.  Thats Scientology! So far in the dead reel ive seen 2 actresses i masturbated to at age 12. Also Louis Jordane but keep that quiet. Just got back from the mens room whadi miss? Oh still nothing? Pls god someone roofied my drink Be nice to ur parents and women are equal - where do these people get balls that big?! This show is a lot like marriage: a lot of excitement in the beginning and the end, and a long slog in the middle The guys at my bathhouse are really digging this Im beginning to think they pad this show with a lot of shit so the can sell more commercial time Please, tell me, what was the last year anyone saw a short film? But, you know, somebody had to say it \"Be nice to ur mom\"  cant wait to see how the trolls attack THAT Its already the gayest Oscars ever #RudyGiuliani is right: Obama doesn't love America like they do - like a toddler loves his blanket. Like Camille Cosby loves Bill O'reilly has a \"Brian Williams problem\"? Who CAN ya trust? MSNBC is also looking into serious allegations in 1991 Al Sharpton told the truth RT @CancerResearch: Check out this upcoming @Vice Special Report: Killing Cancer http://t.co/f4NCCZJLxB via @shanesmith30 @BarackObama #FreeTheWeed: http://t.co/yBDS6IyTye Isis now selling organs?They're the Jackasses of evil,if there's something horrible they haven't done its just cuz they havent thought of it Vindication! Natl Hiway Traffic Safety Admin says driving stoned is safer than driving drunk. Altho not when the joint falls btwn ur legs... Tonight at Michael's comedy festival in Traverse City. 5 fucking degrees outside, but good times inside. http://t.co/5sCL48IalX Teddy bears on V day? Its kinda like saying i luv u, and also think of u as a child. Heres an EZ bake oven too #TVNews the problem isn't #BrianWilliams: http://t.co/IwR3Z9Cevz RT @HBO: The #VICEonHBO special report debuts Friday, February 27 at 10. http://t.co/ozn80elFaj @VICE @shanesmith30 http://t.co/uRSQRW29wU This #BrianWilliams thing is getting  out of hand: now he says he's the one who had his ass eaten on Girls @GOP What Took You So Long?! #DumpingPalin: http://t.co/Ia3mquNa3X RT @MaconCentreplex: Want to know even more about Bill Maher? See him live at the Macon City Auditorium February 7! http://t.co/jKrmmlUx5Q Like i said, their luck ran out! When a guy catches it with his nuts, luck is with u Hey Super Bowl, the game is half over and u haven't nagged us about bulemia yet, what's up? Missy Elliot is great but she's the guest that was gonna 'make our jaws drop and face melt?' Bill Cosby, that wld'ce made my face melt. You know, i m all for solving all the problems in the world, but we're tryin to watch a fuckin game! #DownerBowl Big nuts. Who doesnt love Italy huh? \"We giva u car a boner!\" Robert Kraft, still rockin the Asshole Shirt Like i said, he's good no matter what's goin on with the ball!! He's not really the same when the ball's all blown up, is he? Jesus russell wilson is crying during the national anthem #RealTimeHBO #MiddleClassEconomics: The New Normal http://t.co/UvGKi9JtAz RT @rbpconcerts: See @billmaher LIVE at @HultCenter in Eugene, OR on April 18th! Use code RBP to get tickets early! https://t.co/yA1nzkTYgx RT @rbpconcerts: See @billmaher LIVE at the Santa Cruz Civic Auditorium on April 19! Use code RBP to get tickets early! https://t.co/dPjmHR… Good for Joel Grey, coming out of the closet at 82! In related news, Arnold Schwarzenegger admitted that he can't act. RT @MMFlint: BillMaher show: We lost the IraqWar, we lost the AfghanistanWar. We lose wars. War-lovers, admit it! Best way not 2 lose war? … @GOP Billionaire Buyers Guide To The 2016 Election: http://t.co/4mczI8bDXm RT @RealTimers: \"Hey Republicans, Your Opportunism Is Showing.\" @BillMaher's latest blog: http://t.co/J9756FurYn @HBO http://t.co/6gL3IIWocb RT @HBO: #VICEonHBO is back with more news without apologies on March 6: http://t.co/BQrTXruFdn @shanesmith30 @VICE @VICEnews http://t.co/U… Second show just added at the Fox Theater in Oakland, CA March 28! http://t.co/iiquTA9YUU Belichick on #Deflategate  \"Come on, you guys know me - I just suck the air out of the ROOM.\" \"Breadbags on my Shoes\"?? Was that a Dolly Parton hit from the 70s? Should it have been? Wow, she made Bobby Jindal look like Pericles Sorry, just got to say it one more time: John Boener is a smug, orange fuckface and I hate him more than...oh wait, Joni Ernst is coming on \"I know, because i won both of them\". That was awesome. And why they hate him. Well, one reason why they hate him, ahem. How U can be agst \"I'd like to stop earth from melting\" is beyond me.I'd like to punch them in their smug faces often but on this issue most I know this has been covered before, and not to pile on Boener, but on my TV he is actually darker than Obama. Why? Here it comes, the only thing the 2 parties can agree on is more stupid bombing. Watch Boener light up now. Not that he's not already lit. Does Boener have to look like he's getting a colonoscopy everytime Obama says something good about America? I thought Repubs loved America? Thanks for b'day wishes!Tho b'days suck.Not only a yr older but reminds U what life cld be like if everyone was super nice to U all the time \"Ocean life faces mass extinction\" headline stayed w/ me this weekend. Bush said \"Oceans can't protect us.\" They can't protect selves either #JeSuis Part of the Problem: http://t.co/qiK7p5yfhT RT @RichardDawkins: Bill Maher adds his powerful voice in support of the @OpenlySecular movement. https://t.co/hq8ESgJTa4 For years, I've been asked in interviews \"Who are your heroes?\" I often had to think; sometimes I was stumped. No longer. #CharlieHebdo C. Collingsworth'I can't even enjoy the moment anymore'-says it all about the overregulation of football.Where r Republicans when U need em? #FreeSpeech #JeSuisCharlie #RealTimeHBO: http://t.co/AKwaVsySpa #NYPD #PMS: http://t.co/w46tfkBHpH #JeSuisCharlie 100% of the proceeds from this shirt will be donated to @pressfreedom http://t.co/dxakjzGop0 RT @HBO: #RealTime with @BillMaher is back TONIGHT at 10PM on #HBO with @nerdist's Chris Hardwick, @jayleno, @PaulBegala @CarlyFiorina @Sal… This is a bad sign: on the cover of MAD magazine today, Alfred E. Newman is saying \"Me worry.\" Good times at #JimmyKimmel on later tonight. Yes, vaca is over and ready to get back to my show on friday. With #SalmanRushdie booked! Perf! RT @PearlatPalms: Exclusive offer: 30% off tix to see @billmaher when he returns in March. Use code: WELCOMEBACK http://t.co/n3ExRCFtkx htt… Condemning attack is not enuf: unless U strongly endorse the right of anyone to make fun of any religion/prophet, U r not a moderate Muslim RT @RealTimers: Like it or not, #RealTime with @BillMaher returns to @HBO this Friday at 10pm! http://t.co/fvjyhHS26b RT @HBO: Real Time with @BillMaher returns January 9 at 10pm on #HBO. http://t.co/bF9a4Rx7nn @RealTimers As award season kicks off here in H'wood I'm reminded that no one needs their ass kissed like show people! Except maybe the NYPD. Director Larry Charles on the Hawaii trip this year...was \"Religulous II\" discussed?? http://t.co/y5R5l0IliX I heart plants http://t.co/52arIVPHmm The annual new yrs pic but no sean this year the fabulous laura dern stooging for us! http://t.co/uAa3DCciQt So...its 2015, for perspective \"Bladerunner\" took place in 2017. So we have 2 yrs to get flying cars and robots who fuck us Honolulu on new years eve, bitches! Gonna rock the Blaisdell tonight!! http://t.co/fYQVPIgWH3 CNN with this lost plane is just \"Nightcrawler\" on a network level Hmm which Hawaiian shirt for my New Years gig at the Blaisdell in Honolulu? It doesnt just happen, people! http://t.co/Qsw2B82N5d RT @honolulupulse: Maher has paid his dues http://t.co/SnuE5DDDB9 #honolulupulse We knocked out N Korean internet, what a blow to the 3 people there who have it. Next up, N. Korean state TV, aka the No Food Network Bill Maher @ Berkeley 2014 Winter Commencement (FULL): http://t.co/broLPPhEJ0 via @YouTube RT @BlaisdellCenter: .@billmaher looks forward to his #Hawaii vacation every year. See him on #NYE2014 in #Honolulu http://t.co/d3t1Cprbps … RT @MotherJones: Sean Penn on Sony pulling \"The Interview\": This sends ISIS an \"invitation\" http://t.co/xScr61kBFO http://t.co/0ozycdaTZF RT @nickdirks: Backstage at @UCBerkeley commencement with @billmaher. Congratulations graduates. http://t.co/1Zm5qLQsdE Berkeley today:\"Be freethinkers - ask what's true, not who else believes it\", I told them. Goes for all of us. http://t.co/xxulHj1QVj I understand #Sony is getting back at N Korea's bomb threats by planting a bomb of their own in theaters on Christmas: its called \"Annie\" #Santa is Dead: #ActOnClimate http://t.co/YhExtJpG80 RT @MMFlint: Received numerous threats before release of Fahrenheit9/11. We were warned not to show it. This deterred none of us from relea… RT @MMFlint: EXCLUSIVE: Sony's North Korean hackers issue 8 more demands via my Facebook page: https://t.co/wh2d4JQhS6 #TheInterview So if Kim Jong Un demands Hillary put Dennis Rodman on the ticket...or else! cld he be vice president in 2 years? Obama just goes down the list reversing stupidities of the past: healthcare, gay marriage, climate deal w/ China, now Cuba...is pot next??? And btw the movie is one of the funniest i ve seen in a long time #TheInterview Is that all it takes - an anonymous threat and the numbers 911 - to throw free expression under the bus? #PussyNation Just hangin' out with some 60s cats http://t.co/R7RyxGG3cE I'm just glad NBC didn't go through with his latest sitcom, \"Bad Rapist\" Bill Cosby's lawyer keeps saying the stories are \"old and discredited\". Except nobody remembers the part where they were discredited. #Malala today: \"I tell my story not because it is unique, but because it is not. It is the story of many girls.\" Exactly. If we didn't need torture to defeat the Nazis or win the Cold War,what does it say about us that we need it to defeat the enemy of our time? RT @rbpconcerts: Don't miss @billmaher Aloha Tour 2014 This New Years! https://t.co/7I0WDNoyry Any celeb looking for a charity, UN says 1 billion ppl still practice\"open defecation\", mostly in India/Africa, but also Ted Nugent concerts RT @MauiArtsCulture: Funnyman @billmaher returns for 4th annual Aloha Live stand-up tour at @MauiArtsCulture THU Jan 1! http://t.co/n0vJf9b… I'd just like to know what a cop WOULD have to do to get indicted - and what good are cop cameras since Eric Garner IS on tape? Never been so happy to cancel my Sunday b-ball game cuza rain - rain! Thank you Jesus! Or Thor. Or..you know, whoever. Hey, does anybody know when that thing where chicks shave one side of their head is over? Even on Thanksgiving, working on material for next season. Happy holiday everybody! http://t.co/L88EVjLkwA Women accusing Cosby now up to 20?! Wow. And this doesn't look good, he's on the cover of Roofie Aficionado magazine I know cops have at tough job, but it'd be nice if they EVER said \"yeah, i fucked up, yeah, i overreacted\". A little humility wld help a lot Waiting until night do to what you could in the day seems strange. Reminds me of how the Colts left Baltimore. Last standup weekend of the year for me...at the Holland in Omaha tonight, Adler in Davenport tomorrow. Sorry to see another year go so fast Imperialist Aggressor @SethRogen's Act of War: #TheInterview @Uriminzok_Engl http://t.co/msQEZC178T It does seem odd that the guy who's accused of rape by 15 women is the same guy who was always saying \"pull your pants up!\" #Davenport tickets are still available at the Alder box office or here: http://t.co/I0BUyp2r1B http://t.co/wxkLB9HcUo Heading to Jackson my first trip ever to Mississippi! Thalia Mara hall tonight all u southern liberals! It's an election, not your taint! #IVoted #WhyVote: http://t.co/cubKJwnrWC #ClimateChange with @SenRandPaul @HBO #RealTime: http://t.co/qiQYV1y6sK This new Democratic strategy of doing all the cool, ballsy stuff AFTER the election... #hmmm RT @clarionledger: .@billmaher on pot, the Bible and gay marriage. Are you going to see him Saturday? http://t.co/UR26GehIhV http://t.co/Kg… RT @SenRandPaul: I'm joining @billmaher on HBO's @RealTimers tonight to discuss #ConservativeRealism &amp; more. Tune in at 10pm ET! http://t.c… #CivilianSalute #ConcertForValor starts now on @HBO &amp; @UStream! http://t.co/lZp8uvykKM RT @HBO: The stage is set. Ready D.C.? #TheConcertForValor http://t.co/aDPzIWsVrk RT @rbpconcerts: @billmaher New Years Eve at @BlaisdellCenter in Honolulu &amp; New Years Day @MauiArtsCulture Tix http://t.co/cg75PKs7b8 http:… Headin to Columbus Ohio to play the Palace tonight - hey Ma, I'm playing the palace!! #GenerationASS #RealTime (@HBO) http://t.co/kb0XNIoxLe I feel bad for the people Dems r supposed to represent, not Dem candidates. They remind me of the Iraqi Army - running when they shld fight Well, i guess we picked the wrong week to quit sniffing glue. And flipping Republicans. Enjoy it John Kline, at least people are on to U now Its getting late on election day...here's a word about MN#2 from Eva Longoria! https://t.co/zHnPvkndK4  #FLIPKLINE Wouldn't it be cool if a flash mob could change history? One that shows up at the voting booth? Come on MN#2, now's the moment - #FLIPKLINE Hey college students of, if i can remember to vote tomorrow with all the weed I've smoked, then so can you. #FLIPKLINE https://t.co/hH9Lf0R4Xq  pls RT until all of Minnesota's 2nd hears us! Tomorrow is the day to #FLIPKLINE When your kids move back home because they can't pay off college? That's John Kline bringing families together - #FLIPKLINE Hey MN 2nd, the mining and for-profit education industries have a rep in congress - when do you get one? #FLIPKLINE !! Come on #Democrats you gave people Health Care not Herpes!  #Vote http://t.co/QSRJkVm7Eq Good news for Ebola worriers: Kaci Hickox is a Democrat, so at least we know she'll be staying home tomorrow. 3 days to election day! May i refresh your memory, Minnesota's 2nd district!  http://t.co/HZdFsaGbEo See, its all good with Rula and me! http://t.co/dPKD4pGHRS The #Berkeley #FreeSpeech Movement (Response to The @UCBerkeley Controversy) @HBO Real Time http://t.co/qnugfC0jHf #EbolaQuarantine I wlda bet it wlda been the TeaParty types who were AGAINST it cuz its Gov't limiting their freeedom! See what panic does? Every news outlet asking me 4 comment on this Berkeley thing but then i remembered: I'VE got a show!And thats where I'll address it,Fri nite The Distracted American Voter: #Kansas @BrownBackforgov @HBO #RealTime http://t.co/vHEXLzzLO1 John Kline gets $ from Target, Best Buy, Home Depot, votes agst raising minimum wage. Probly just a coincidence. Flip this loser, pleeeeze! #BIGFANS Tunisia &amp; #ISIS @HBO #RealTime w/ @CornelWest &amp; @JohnAvlon: http://t.co/8t0pQ5zF4U #Canada: Turns out the attacker was Islamic - what are the odds, huh? Its almost like there's an elephant in the room. #ImTheLiberal Hey #MNO2 we're getting down to the wire; polling shows Kline slipping! Keep spreading the word and we will #FlipKline! Joe Biden's son ousted from the Navy for cocaine? If the son is like the father, that's a scary thought: think of Joe Biden. Now add cocaine Free Pigs From the Abusive Crates:  @nytimes http://t.co/zherzkYs0l Ebola on cruise ships now too? You know who's getting the last laugh? Those Orthodox Jews with the plastic bags over their heads. #NYCF http://t.co/C1QDIuKh8e You know what, Nigeria? I take it back - we'd have to improve to come up to your standards. #JesusFuckingChrist Nigeria has successfully contained #Ebola. We don't have to be perfect to win this. No offense, Nigeria, but if we can't at least do you... Headin to Vegas for tonight and tomorrow at the Palms hotel -come see me if U wanna laugh! OK, you're right, that was kind of a blatant plug Bill Maher’s: Why progressives must defend enlightenment, critique religious extremism http://t.co/473nw4vpAr via @Salon RT @SamHarrisOrg: Here is my breakdown of my collision with @BenAffleck: \n\nhttp://t.co/cx22MnC2wT Getting ready for my town hall in Northfield, Minn. to #FlipKline http://t.co/43MYX0W6nj I like Texas' new tourism slogan: Come to have an unwanted baby, stay because you're dying of Ebola. @BenAffleck vs @SamHarrisOrg: #MulsimWorld Liberal #Islamophobia Debate #RealTime http://t.co/e47sNNILas I hope the microbes and insects like the planet when they have it all to themselves. Sorry about the mess. You know #RealTime is trying to flip #JohnKline, right? I need eyes on the ground in #MN02! He's hiding - get me video! Tag #FlipADistrict #NewRule #iPhone6 #BendGate @HBO Real Time: http://t.co/Ck1oARH2HP RT @totallytucson: Live Stand-Up! @BillMaher Performance stuff some of us live for... #TucsonMusicHall 8p Sun10/5 http://t.co/ep9knJ7qCb 26… Defense stocks way up:Hey, broker,I live in a nation of sheep that spends unlimited $ on whatever bogeyman they see on tv,get me in on that! Why The #MuslimWorld &amp; #ISIS #Coexist: @HBO #RealTime (video) http://t.co/UZrcupREVd Does anyone know if in fact #DerekJeter is retiring? Hit me up if you have any information, cuz i can't find anything about it in the media Hey foreigners,i know U get me, fyi tonight's Overtime on http://t.co/0PDStFyP3Z is Special Edition: Issues for Overseas Viewers! After RT Black in America: @WendellPierce @HBO #RealTime (video) http://t.co/osbTquBA0h Thank god we're bombing #Khorasan cuz they're SO much worse than Isis! Even tho 2 days ago I thought Khorosan was a restaurant in Brentwood RT @KOOLradio: Enter daily for a chance to win tix to see @billmaher, 10/4 at @ComericaTheatre from KOOL FM: http://t.co/A0gEoHmU7k http://…"}