{"tweets": "¡No puedo vivir junto a ti y sin ti es imposible!\n#FrasesArjona\n(WT) https://t.co/dt8fVGLICq Desde el principio de los tiempos las protestas sociales no caen del cielo, ni son antojos masivos, ni formas de distracción, ni caprichos de la naturaleza. Las protestas sociales obedecen siempre a la explosión… https://t.co/KWJnNLbfgU “Yo siempre le decía #Señorita usted no tiene porque estar tan sola”\nVideo completo disponible aquí https://t.co/VziHKSXY0E \n(WT) https://t.co/Lb7XTTfDzO RT @InfoMundoArjona: 🌟 Nominado por @quieromusicatv 🌟\nEl último show #CircoSoledadEnVivo es muestra del trabajo de un gran equipo de artist… La entrevista más importante del #CircoSoledadEnVivo que nunca salió. https://t.co/x15NdixI5K \n (wt) Piénsalo, puede que sea yo #LoMejorDeLoPeor peor que has conocido... #FrasesArjona (WT) https://t.co/LupkfpZW4s Momentos del #CircoSoledadenVivo ¿Saben que canción causa ese efecto?\n(WT) https://t.co/NsilXDcgF9 Mucha vida a todas las madres. 🇦🇷 (WT) https://t.co/5GyE6T0hfO RT @InfoMundoArjona: Termina la semana y palpitamos los próximos días de descanso.\n¿Qué disco de @Ricardo_Arjona escuchas para relajarte?… #Repost mandiz_barragan\n・Arjoneana de corazón ♥\n(WT) https://t.co/P9hUZCNJRq ¿Se la saben? \n#CircoSoledadEnVivo\nDisponible en todas las plataformas.\n(WT) https://t.co/uRCeUoDfQ4 Hace 4 años fue nuestro último concierto. El #CircoSoledad en cines será nuestra manera de volver. 🇻🇪 Ingresa ya en  https://t.co/ihqOKfZ0hU y reserva las entradas TOTALMENTE GRATIS o puedes ir directamente a la… https://t.co/OiqEhFqQ8M Te regalo esta canción desesperada.\nDesabrida como lunes por la tarde...\n#Apnea en el #CircoSoledadEnVivo\nDisponible en todas las plataformas\n(WT) https://t.co/9vfY6eUNlt RT @InfoMundoArjona: ¡Atención Miembros Mundo Arjona!\nDisfruta en exclusiva la música de #CircoSoledadEnVivo. 🎪\n\nDescárgate el app oficial… El problema es que .... ¿completan la frase?\n#CircoSoledadEnVivo Disponible en plataformas digitales\n(WT) https://t.co/n9oCcIwzXA Hace 8 años fue nuestro último concierto. El #CircoSoledad en cines será nuestra manera de volver. 🇻🇪 Ingresa en  https://t.co/ihqOKfHpqm y reserva las entradas TOTALMENTE GRATIS o puedes ir directamente a taquilla, revisa el post de Instagram o Fb para saber que Cines participan https://t.co/pQIHYMiQHm Cuando mi niña dice : Hello boys, yo siempre supe que había que salir corriendo. @adriaarjona https://t.co/2zOafDYQB1 Júntate con niños, no tienen prejuicios ni egos maliciosos.  Sonríen o lloran cuando lo sienten. Que Dios nos libre de los adultos. Un Niño grande.  Eso quiero ser. https://t.co/GEtdTcz5P8 Ustedes la cantan mejor #TeConozco #CircoSoledadEnVivo (WT) https://t.co/VwY9UI3rw7 Ensayos en el inicio del Circo Soledad 2017. Canta, toca,  dirige, maneja el drone y duerme poco. Nosotros observamos. (WT) https://t.co/SHwnMypXhG #TBT Detrás de cámaras del video #LoPocoQueTengo https://t.co/2KLlGjffoo \n(WT) Quédate con quien te mire así. Circo soledad,  el testimonio.  (WT) https://t.co/lhyrSUe2TQ No es ninguna payasada la bufanda en la cara. Cuando se nace en uno de los lugares más bellos del mundo ( Antigua Guatemala ) y el aprecio de la gente hace imposible que la puedas caminar como antes  a cara… https://t.co/8IaWsLEIE8 Sorprendimos a Ricardo llegando a la oficina por primera vez en un año. (WT) https://t.co/rO8CMTuxvw #Tbt ¿Saben en que #Tour fue esta foto?\n(WT) https://t.co/GXbUDqA0ib Seguimos tratando de elegir nuestra parte favorita de #CircoSoledadEnVivo pero es complicado, ¿Cuál es la tuya?\n.\nHISTORIA DE TAXI disponible en el link de la Bio\n(WT) https://t.co/SqoWwSTuBC Fuimos niños inmaduros, maduramos con trabajo, nos quejamos, celebramos, bailamos los 15 y perdimos la inocencia una noche de invierno.  Hoy con 24,  ya no nos dicen cómo es la cosa. La amistad madura, no le teme a los insomnios.  Se les agradece el tiempo y la solidaridad. https://t.co/19R9N0N4PZ Mi amigo Dan en la guitarra , como un presagio.  https://t.co/rKPaCQXmMG Responsable de tantos momentos felices.  Mi aprecio y admiración . Te dejo un abrazo Kiko y a Carlos, mi amistad intacta. @Carlos_kilo1 https://t.co/zOjNv2pDiB No fue fácil decir adiós al #CircoSoledad. ¿Lo vieron?\n#CircoSoledadEnVivo ya está disponible.\nhttps://t.co/jzMLHteoHc\n(WT) https://t.co/qbQWFsYrDY ¿Cuál es tu frase favorita de esta canción?\n#CircoSoledadEnVivo\nLink en Bio para #HistoriaDeTaxi\n(WT) https://t.co/GwsyXO5if7 Y todo empezaba con “Ella”...\n#CircoSoledadEnVivo\nhttps://t.co/jzMLHteoHc\nLINK EN BIO PARA “Historia de Taxi”\n(WT) https://t.co/J0Burc6Pbm Feliz Cumpleaños a la princesita de nuestro Circo. \n#CircoSoledadEnVivo\n(WT) https://t.co/UG9cFb2UwU De los momentos más especiales del show, las señoras del #CircoSoledadEnVivo\n.\nLa canción “Historia de Taxi” disponible en el link de la Bio\n(WT) https://t.co/o7aDs6a6il Hermano de tantas batallas, músico extraordinario y ser humano único. Te fuiste antes de cumplir el proyecto que soñamos. Yo lo terminare por ti.  Dan Warner, tus guitarras seguirán sonando.  Brother of so many battles, extraordinary musician and unique human being. https://t.co/CQ6Ds4yPoT “Circo Soledad en vivo es mi propia oportunidad para no dejar ir en el tiempo la puesta en escena y la gira que empecé a extrañar el mismo minuto después de finalizado el último concierto.”\n#circosoledadenvivo\nYa Disponible\n(WT) https://t.co/b0OZzi906G RT @DeezerLatino: Todos sabemos que @Ricardo_Arjona nunca decepciona. Escucha su nuevo álbum #CircoSoledad 👇🏽 RT @InfoMundoArjona: Fans!, ¿Qué es lo que mas les ha gustado del #CircoSoledadEnVivo ? Los leemos! 😎 deja tu comentario aquí! ❤️🙌🏼\n.\n#rica… RT @SonyMusicLatin: ¿Ya le diste play a #CircoSoledadEnVivo, de @Ricardo_Arjona? 👏🎪🤩 ¡Hazlo en tu plataforma preferida! https://t.co/p21qlV… RT @SonyMusicLatin: ¡Mira todas las canciones que puedes encontrar en #CircoSoledadEnVivo! 🤩🎉🎪 Disfrútalo junto a @Ricardo_Arjona en tu pla… RT @Fund_Adentro: ¡Un aplauso de toda la comunidad educativa de la ENMA a nuestro fundador @Ricardo_Arjona, por el lanzamiento de Circo Sol… RT @notiarjona: Preparativos en el cine\n\n#CircoSoledadEnVivo \n \nQue linda es mi bandera !! \n\n@InfoMundoArjona @Ricardo_Arjona https://t.co/… RT @Univision: \"Esto es un pedacito de emoción\": @Ricardo_Arjona presenta su nueva producción 'Circo Soledad En Vivo' (EXCLUSIVO) https://t… RT @prensa_libre: ¡Whoah! La nueva producción de @Ricardo_Arjona está compuesta por 23 temas en vivo de la gira #CircoSoledad. ¿Cuál es su… RT @UforiaMusica: ¿Cuál fue el gran cambio que tuvo @Ricardo_Arjona de sus giras anteriores a #CircoSoledad? 😌🎶 Descúbrelo en este video EX… RT @sonymusicmexico: @Ricardo_Arjona nos presenta su nuevo álbum “Circo Soledad En Vivo”  🍿🤹‍🎭🎪\nEscúchalo en @SpotifyMexico 👉🏽 https://t.co… RT @InfoMundoArjona: 🚨 #CircoSoledadEnVivo ya está disponible! 🚨 Búscalo en físico o digital 🙌🏼❤️ Si te encuentras en el video pública tu f… Llegó el día de revivir la magia del #CircoSoledadEnVivo. Ya Disponible en todas las plataformas digitales. \nhttps://t.co/jzMLHteoHc\n(WT) https://t.co/yXa1l1wwce El Circo se detiene en el tiempo. Faltan 2 días #CircoSoledadEnVivo\nhttps://t.co/jzMLHteoHc\n(WT) https://t.co/p45k6zRiph Si tuvieras que elegir una canción ¿Cuál sería? 🎪 🗓 3 días para el #CircoSoledadEnVivo\nhttps://t.co/jzMLHteoHc\n(WT) https://t.co/DUSeqlCld4 El conteo regresivo empieza hoy. Faltan 4 días #CircoSoledadEnVivo\n30 de agosto. https://t.co/jzMLHteoHc \n(WT) https://t.co/CG6NtjtyYn La continúan?....\n#HistoriaDeTaxi disponible en el canal de #YouTube 🎞 \n#circosoledadenvivo 30 de agosto.\n https://t.co/MfPtxBPjb7 (WT) https://t.co/6y1ybVKx68 Una semana más.\n#HistoriaDeTaxi disponible en el canal de #YouTube 🎞 https://t.co/MfPtxBPjb7\n#circosoledadenvivo 30 de agosto.\n(WT) https://t.co/c64OkUqTmt Ricardo siempre dijo que todo empezó aquí. Saben donde es?\n\n#HistoriaDeTaxi https://t.co/MfPtxBxHMx \n#CircoSoledadEnVivo\n(WT) https://t.co/fkgHm0M2As En el circo, a veces, para no olvidarse de donde se viene, también hay que cocinar.\n#CircoSoledadEnVivo\n30 de Agosto\n(WT) https://t.co/jNDiCq721g Intentamos guardar la energía del CIRCO SOLEDAD y ponerla en tus manos. 30 de Agosto #CircoSoledadEnVivo https://t.co/MfPtxBPjb7 \n(WT) https://t.co/MKw4waT3eP RT @Ricardo_Arjona: La espera valdrá la pena. 30 de Agosto #CircoSoledadEnVivo\nLink en Bio. 🎪\n(WT) https://t.co/d7m2o5UDOY ¿En que ciudad viviste el #CircoSoledad?\nEste 30 de Agosto #CircoSoledadEnVivo https://t.co/bcLIiKD4Fv (WT) https://t.co/PN6QHcFWF0 RT @SonyMusicLatin: ¡Haz clic 👉 https://t.co/p21qlVbNfW 👈 y reserva #CircoSoledadEnVivo de @Ricardo_Arjona. 🎪🎉 https://t.co/0MjmBT719x Más de 2 millones de espectadores, más de 20 países con más de 115 funciones #CircoSoledadEnVivo\n30 de Agosto\nhttps://t.co/MfPtxBPjb7 \n(WT) https://t.co/s1DcF0z6oy “Mira si es grande el destino y esta ciudad es chica...” #HistoriaDeTaxi #CircoSoledadEnVivo\n30 de agosto https://t.co/MfPtxBPjb7\n(WT) https://t.co/3dXUNbQi57 RT @InfoMundoArjona: El video completo de #HistoriaDeTaxi esta DISPONIBLE 🙌🏼❗️ ¿Sales es el video? Sube un screenshot y etiquetanos para co… Para hacer la espera más amena , “Historia de Taxi” #CircoSoledadEnVivo (WT)  https://t.co/MfPtxBPjb7 ¿Serás el tira fuego o el bufón?\nEste 30 de agosto, #CircoSoledadEnVivo estará en tus manos.\n(WT) https://t.co/2P5D6jvnPD “Y arlequines que se presten pa’ comprarlos...”\n#CircoSoledadEnVivo 30 de agosto\n(WT) https://t.co/Ilnm46EKaC Solo 17 días ⏳#CircoSoledadEnVivo\n30 de agosto\n(WT) https://t.co/53ZYHf5BUu “Siempre habrá un buen domador pal’ que se deje...”\n#CircoSoledadEnVivo\n30 de agosto\n(WT) https://t.co/779PPHwoTo “Al final siempre resultaba tocando canciones, es lo que me gusta es lo que paro haciendo siempre”\n#CircoSoledadEnVivo 30 de Agosto\nhttps://t.co/jzMLHteoHc \n(WT) https://t.co/D22jR4BgKv #CircoSoledadEnVivo 🎪 Solo unos días más. \nLink en Bio.\n(WT) https://t.co/DkG5nHJPLO La espera valdrá la pena. 30 de Agosto #CircoSoledadEnVivo\nLink en Bio. 🎪\n(WT) https://t.co/d7m2o5UDOY #CircoSoledadEnVivo Para que viva contigo. Agosto 30\nLink en Bio.\n(WT) https://t.co/yUyElslPAM https://t.co/Ok1snX78gY \n(WT) #CircoSoledadEnVivo 🎪 Solo unos días más. \nReserva y verás. Link en Bio\n(WT) https://t.co/bkid9c5V7V Estén muy pendientes...\n#CircoSoledadEnVivo\n(WT) https://t.co/yv4yzXpeLe La espera acabará pronto.\n#CircoSoledadEnVivo\n(WT) https://t.co/L61weBq4fo Nada como tú.  Hace un par de años.  Feliz cumple campeón. ( el movimiento de cintura se lo enseñe yo jajaja ) https://t.co/rwZufJ30xw “El tiempo va gastando el reloj de arena en tanto esperar” #FrasesArjona\n.\n.\n#circosoledadenvivo (WT) https://t.co/obkKvpZxkC RT @InfoMundoArjona: ¿Cuál es la canción de @Ricardo_Arjona que te pone mas feliz? #EncuestaArjona Sara Tavares, volando con ella antes del concierto en Milán 2018.\nCirco soledad el testimonio.\nMuy pronto.\n(WT) https://t.co/EJcanOUK0N Otro momento muy especial del #circosoledadlagira 🎪\n.\nPronto, el testimonio.\n(WT) https://t.co/wLIhn5ZaVP Recordando momentos del #circosoledadlagira 🎪\n.\nEl testimonio, muy pronto.\n(WT) https://t.co/hXSMJr2jDJ RT @Fund_Adentro: 🙌 https://t.co/jiaEPT5T6o Nuestra primera escenografía, junto con 30 toneladas de equipo, la secuestró junto a 15 policías armados  y uniformados un innombrable dominicano sin que ninguna entidad de gobierno o particular de La República… https://t.co/fUNYZmZ5rZ… https://t.co/ziw1bNt5By Gaby Moreno. Mi cantante preferida. Con su aporte una vez más a la buena música. Con Jackson Brown.  La pelea no es estar de moda, o hacer lo qué otros quieren, la pelea es seguir haciendo lo que nos gusta. https://t.co/SHcuY34cdG El tiempo es cuestión de tiempo. La vida es cuestión de vida. La vida dura un momento y el tiempo ...... toda la vida.  El que tenga miedo que se quede en la sombra. https://t.co/e7o1xBM8kP RT @INFOMUNDOARJONA: ¿Te imaginas aparecer entre el público en la película #CircoSoledadLaPelicula? ¿Quién te acompañará a verla?\n.\n@Ricard… #CircoSoledadLaPelicula ⏳\n(WT) https://t.co/fw09QhuRCx Reviviremos momentos inolvidables que dejo el Circo Soledad.\n#CircoSoledadLaPelicula\n(WT) https://t.co/VzFARV3dDW Seguiremos llevando el Circo por dentro. El testimonio, muy pronto.\n.\n#CircoSoledadLaPelicula\n(WT) https://t.co/r5iEfdPD0k Más de 2 millones de espectadores, más de 20 países con más de 115 funciones, muy pronto #CircoSoledadLaPelicula\n(WT) https://t.co/q9tpSfBQkV Intentamos guardar la energía del CIRCO SOLEDAD y ponerla en tus manos.\n#circosoledadlapelicula\n(WT) https://t.co/x4WzLzrdPa Nadie sabe a donde va. https://t.co/hvOgEKDCyw RT @Fund_Adentro: En nuestra escuela enseñamos a nuestros niños a ser mejores perseverando y luchando de la mano de sus maestros y compañer… El Circo Soledad y su testimonio, muy pronto.\n#circosoledadlapelicula\n(WT) https://t.co/Xm8XXO0yYP La experiencia del Circo ya tiene un testimonio.\n#CircoSoledadLaPelicula\n(WT) https://t.co/AsX3VfeQJr Nunca terminaré de reprocharme el haber sacado a mis padres del barrio donde vivimos. Los mudé a un barrio fantástico pero insistían a diario en abordar un transporte colectivo para pasarse el día con sus vecinos de siempre. En resumen.... leer +&gt; https://t.co/UKl2IdacUl https://t.co/vPCZyPLJyt Una manera de que siga entre nosotros. #CircoSoledadLaPelicula\n(WT) https://t.co/3dJQBbypAx El Circo se detiene en el tiempo.\n#CircoSoledadLaPelicula muy pronto.\n(WT) https://t.co/QMJk02Zbjl No fue fácil decir adiós.\nCirco Soledad, el testimonio, muy pronto.\n.\n#CircoSoledadLaPelicula\n(WT) https://t.co/ltptcjcPyK Seguiremos llevando el Circo por dentro. El testimonio, muy pronto.\n.\n#CircoSoledadLaPelicula\n(WT) https://t.co/yk8Y2lwF5F Muy pronto, CIRCO SOLEDAD, el testimonio.\n.\n#CircoSoledadLaPelicula\n(WT) https://t.co/vs9sNfKti4 Para que viva contigo.\nCIRCO SOLEDAD, el testimonio.\n#CircoSoledadLaPelicula\n(WT) https://t.co/BByp5Kg0w5 El testimonio del Circo Soledad, muy pronto.\n#CircoSoledadLaPelicula\n(WT) https://t.co/nHlohPBPc3 El circo nunca dejó de soñar.  DVD el testimonio.\n#CircoSoledadElDvd\n(WT) https://t.co/aEnJK6tWe8 CIRCO SOLEDAD, para que viva contigo.\nMuy pronto DVD\n#CircoSoledadElDvd\n(WT) https://t.co/5hk7u7kNCx Alguien estaba viendo el show por los ojos del celular.\n(WT) https://t.co/9PtfhdSNhU No fue fácil decir adiós.\nCirco Soledad DVD muy pronto.\n🎪 \n#CircoSoledadLaGira\n(WT) https://t.co/nIGkQYHvU5 Julio. El video que tanto te prometí. Sabes que soy malo para estas cosas.  Solo espero que no te juegue en contra.@jjalkymia https://t.co/W5wKySrwLE RT @INFOMUNDOARJONA: Felicidades al club de fans @historiasarjona 🍾✨🙌🏼 ya son 21 años! Gracias por tanto, se les quiere! ❤️ 🇦🇷 https://t.co… Pero por favor, no preguntes como estoy.\n#FrasesArjona #73 #CircoSoledadLaGira\n(WT) https://t.co/9Qmhw7Hum9 La gente crece. https://t.co/dizYoMcPbL ¿Recuerdas que canción sonaba en esta parte del show?\n#CircoSoledadLaGira\n(WT) https://t.co/TyIjAFK1lS El cuarto y Manager  se quedaron en casa. (Abbey Road) Aires de futuro en esta ciudad. https://t.co/ViJp2wyuKC Mucha vida a todas las madres.\nhttps://t.co/kcWaTpzmLC Los Ricardos, los ojos que más te cuidan. https://t.co/riPxRr4Rjz Hace unos meses.  Gane a pesar de los calcetines. https://t.co/Ygh2JDAaL3 Las coautorias olvidadas en los créditos de los discos.  El boceto de una canción hace algunos años y el músico anónimo con su aporte. https://t.co/Rbr7sidWSx Cuando su familia decide agregar a los equipos un cepillo de dientes en su estudio (la cueva) es señal de encierro, canciones nuevas y mucha inspiración.  Leer más : https://t.co/0OpBNQOaJx\n(WT) https://t.co/HMOUBsyrgS Buenas noches, niña buena.\n#FrasesArjona #72\n(WT) https://t.co/hr7fhoKZoK RT @LuisvonAhn: Me da increíble satisfacción haber donado casas para víctimas del volcán. Gracias @Fund_Adentro y @Ricardo_Arjona por haber… RT @notiarjona: #BuenMartes  lindo día en #BuenosAires , si alguien lo encuentra @Ricardo_Arjona , le puede dejar nuestro saludos ? https:/… https://t.co/bVmcofi35S LAS CANCIONES SON DEL QUE LAS VIVE. \n#Repost @reencuentrosvez \n・・・\nJoan Pedreañes tiene 5 años viviendo en Panamá y tenía dos años sin ver a su mamá!!! Por eventos fortuitos tuvo q viajar a maracaibo, pues su madre está muy grave a raíz de un cáncer terminal... https://t.co/86Q3ZFxpEr Livingston, Puerto Barrios. El pedacito de caribe que nos dejaron los ingleses. \nRecuerdo llegar en bus a la estación de Puerto Barrios.  Alguien había contratado a un cantautor para el Bar del lugar. Llegue por la tarde.... &gt; Leer más : https://t.co/5sckqUpK1y https://t.co/AOrFagVGz7 RT @INFOMUNDOARJONA: ⁦@Ricardo_Arjona⁩ anunció en sus redes que pronto se viene el DVD!, aquí les dejamos una entrevista con el ⁦@clarincom… Yo no puedo ser rico sin ti,\nNi pobre cuando estás conmigo.\n#FrasesArjona\n(WT) https://t.co/m66Q7WfHwF Acompáñame al misterio de no hacernos compañía. #Tbt\n(WT)\nhttps://t.co/OjrWBXpG7P RT @Fund_Adentro: UNICEF en la escuela sumando en el desarrollo de la primera infancia 👦📒 https://t.co/dPoWfoaFyh Algo más que un concierto en vivo. El DVD está por venir. Aquí con dos de sus estrellas hace algunos años. Con el CLAN ninguna entrevista es posible.\n@adriaarjona\n(WT) https://t.co/tCjsNyV76S VERONICA. Estarás conmigo siempre. Por el contagio de tu luz de lucha y la energía de tus ojos de esperanza. Te quiero, porque sigues aquí, la gente como tu no se va nunca. https://t.co/CUFyERkvdf RT @Fund_Adentro: Empezamos abril agradeciendo a las personas que hacen posible la iniciativa de la Fundación Adentro de dar un hogar a las… RT @rubenblades: Conocí de Alberto Cortez en Panamá, justo antes de salir del país, en 1974. Una canción suya, ¨Distancia¨, me sacudió prof… ALBERTO CORTEZ\nCUANDO UN AMIGO SE VA. \nhttps://t.co/85ERxvKHsO https://t.co/YKlPtckuwf \"Quien ganará la batalla de este amor desperdiciado,\nTu creyendo que me quieres, yo queriéndote creer\"\n\n#FrasesArjona\n(WT)\nhttps://t.co/HHZmNnMluw RT @MetamorfosisMed: “Apnea” fue el primer sencillo del álbum “VIAJE” de @RicardoArjona, álbum que este mes cumple 5 años. Sabemos que vist… Animal Nocturno.  Aquellos tiempos. (WT) https://t.co/x08g4SGoBw #FrasesArjona\n#70\n(WT) https://t.co/6UOIWewwnW RT @INFOMUNDOARJONA: Post dedicado a fans en el #CircoSoledadLaGira 🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼 tienes más fotos?, etiquetanos! .\n#MundoArjona https://t.c… Su mayor tesoro no vuela, no navega, ni se deposita en ninguna parte.  Su mayor tesoro, su palo de mango.  Solo en Guate hay de estos. (WT) https://t.co/2lijkG7Mfd https://t.co/YQ6FIKhOiV #FrasesArjona\n#69\n(WT) https://t.co/tWkiL2FffQ Escribir una canción no es ir deprisa... https://t.co/bnKCIFzaWK https://t.co/LRw089aXlX Presidente del club de fans de esta actriz. El club de fans se llama.  Mi pedacito de Guatemala. @adriaarjona https://t.co/sbOAdL5HEo #frasesarjona\n(WT) https://t.co/iA9eZjaPnn RT @Funjunej: Cuando la nueva voluntad se transforma en acción y realidades concretas. Gracias @Ricardo_Arjona Un nuevo comienzo en finca l… Digo lo que pienso.  Hago lo que siento.  Soy un inadaptado. https://t.co/eNd3tDxM72 Lo que nos pidan podemos.\n https://t.co/NfmK0B5sPn El que se peina mucho, se lo pierde todo.  Perderse........pa encontrase. https://t.co/dwiMUrXyTM Dejaste tu sombra merodeando sin permiso por la casa.\n#Quien\n https://t.co/q1wy1vgFcs\n(WT) https://t.co/B6OSIvzrhN Hace algunos años el profe Arjona era un maestro atípico. Sus métodos son recordados hasta el día de hoy.\n( WT) https://t.co/2UczvnthqY La fe se nutre con la injusticia.  No hay fuego que queme la esperanza. Nadie sabe más del futuro que la voz de un pueblo que reclama lo que le pertenece.  Venezuela, volverás renovada. https://t.co/ivZz7JybGh El había sacado su primer disco y nadie se había enterado. Esta noticia vino a terminar de sepultar su primer proyecto. Nadie le hablo de canciones, todos hablaban de los 79 puntos.  El balón le ganaba a la guitarra....\n// Instagram •• @RicardoArjona\n(WT) https://t.co/aReEDOtgdy No sé quienes son, pero si alguien le hace daño a mi niña  se las verá conmigo. @triplefrontier @adriaarjona https://t.co/uaf3kQdnoL Belleza.  Usted cada vez más linda. Con dos acordes más tenemos esa canción lista.   Espero ser  yo el que se los enseñe cuando la vea. Le mando un abrazo del tamaño de su fortaleza. https://t.co/pTTddGRwul https://t.co/u4cT8ar21K Mi niña. Con usted, ya nada es sorpresa.\n#Repost @adriaarjona\n・・・\n💥MORBIOUS💥  Very excited to join the  @sonypictures and @marvel family! Let the bloody venture begin! https://t.co/FJASm0KU1m #Dios, este papa que me toco y sus locuras. (WT) https://t.co/7VUrGdv2NR Perderse pa encontrarse.\n(WT) https://t.co/XuM2tF8etx Y si hay sumisos ..... habrá una bota que gobierne su sudor.\n#Cisnes\nhttps://t.co/TI6vCJb48V… \n(WT) RT @INFOMUNDOARJONA: ¿Pueden creer que el video de “Sin Ti, Sin ami” tiene 9 años ya? Se publicó el 27 de Enero del 2010. 😳\n@ricardoarjona… RT @notiarjona: #BuenDomingo #EmisorasUnidas @Ricardo_Arjona https://t.co/fMUoGXheTL #ArjonaFanVideo - CAUDILLO\nhttps://t.co/yxfXOMxydA \n(WT) https://t.co/yCOrUmVf6a Gracias mil, en especial a esta belleza\n#Repost @INFOMUNDOARJONA \n・・・\nLos fans club de diferentes partes del mundo festejaron por todo lo alto el cumpleaños de @ricardoarjona \nQue cumplas muchos más maestro!!! https://t.co/w3aBhJtWMd RT @notiarjona: De la historia de Vero Luque @Ricardo_Arjona https://t.co/MkiLrgKFhQ RT @notiarjona: #DelegaciónCórdoba #Notiarjona festejando el cumple de @Ricardo_Arjona https://t.co/sQpDcczgh0 RT @notiarjona: En el #guatepicnic el #FelizCumpleArjona #Notiarjona #BuenosAires https://t.co/8ma0a9CpTq RT @INFOMUNDOARJONA: 🎉🎉FELIZ CUMPLEAÑOS RICARDO!, 🎂 que sigas llenándonos de felicidad con tus letras, tus melodías, tus buenas acciones y… RT @Fund_Adentro: ¡Celebramos tu vida @Ricardo_Arjona, que cumplas muchos más!  🎂 🎂 https://t.co/m6Opv7V1tD Gracias por acordarse de los años.  Se les quiere.  Como decía mi madre. Ticinco cumplo. https://t.co/Tzu1ix5CxM “El Cielo A Mi Favor” con 25 millones de reproducciones en #Youtube\nhttps://t.co/qirq5CGu7P \n(WT) https://t.co/tzsOsbmLjr #FrasesArjona #67\n(WT) https://t.co/9s2VCNWUNh RT @ArjonaSpain: #miercolesdefrases\n#DAME\nLas  #EspartanasArjonianas te cantan 🎵🎵\nHazme una #hamaca, con el menguate de la #luna ,\ndame tu… Empezar el año con mis mejores amigos. Importante. https://t.co/NYIYplaFM5 “Amnesia de pelear por respirar,\nDeseo de rendirse en soledad”\n#Apnea #Tbt\n(WT) \nhttps://t.co/pzFnNsGsH4 https://t.co/2dUEFZhxbS Alguien ha estado trabajando mucho. (WT) https://t.co/ZHs0lLmhtq #FrasesArjona #66\n(WT) https://t.co/B6f5sxr82o Esta es la primera entrega, vienen más y agradecemos enormemente la participación de algunos de los que ya aportaron para nuevas casas. \n @Fund_Adentro \nhttps://t.co/xluZa5IcY9\n (WT) https://t.co/15ygb247Fu Día de reyes. Las primeras 5 familias damnificadas por el  Volcán ya tienen casa, incluyendo a la familia de Esmeralda López. Además, personas y empresas se están sumando para que sean muchas más las casas y las familias reubicadas.\n(WT) https://t.co/mVua2Kcgl5 Tengo un domingo en stand by por si algún lunes te deprime.\n(WT) https://t.co/uS9UJFl1No #FrasesArjona #65 #TBT\n(WT) https://t.co/mEXBIXkcFQ Yo me instale en el mes de enero, afuera creo, que es abril.\n(WT) https://t.co/CEUF0sVKn2 RT @BillboardArg: Resultados de la encuesta de Billboard AR, donde se recibieron más de 250 mil votos, los cuáles fueron fusionados con mét… \"Te ves jugando a la escondida\nY al voltear preguntas.....\"\n#TBT \n(WT)\n\nhttps://t.co/amnUmUjUAZ Limpiando todo.  Empezando de nuevo.\n(WT) https://t.co/o3MWhI1kEg Que todo el peso se haga más liviano. Feliz navidad. https://t.co/9j3MxN9J8x @notiarjona Una belleza. Veronica es un poquito de luz, un instante de inspiración y una sonrisa que hacen un todo de fortaleza qué hay que imitar.  Mi abrazo para ella y para ustedes por tenerla pendiente. #FrasesArjona #Loco\n (WT) https://t.co/dIvVJEloSm Esa manía de hacer conciertos. La gira terminó, quien le dice?\n(WT) https://t.co/1Uxh38CJdB RT @INFOMUNDOARJONA: Cuando tienes varias novias, tienes también varias obligaciones. Cuidado, protección, afecto. La poligamia no es fácil… #TBT Cavernícolas\nhttps://t.co/X4tcM38LAf \n(WT) #FrasesArjona #63\n(WT) https://t.co/Qr5PizgASm “Se entrega el corazón y se trabaja desde ADENTRO para lograr lo que queremos”\n@Fund_Adentro \n(WT)\n\nhttps://t.co/QQhhMvKyWA “FUISTE TÚ” cuando los guatemaltecos se unen.\n (WT) https://t.co/R3NdcOX4uj Una noche de mucha luz.  Nuestro profundo agradecimiento a todos los que dijeron presente.\n(WT) https://t.co/2PoUTPHJuY A menos de 24 horas de una noche mágica y del final de un ciclo. En algún lugar del Atlantico.  Solo,  pa aprender de nuevo a estar en compañía. https://t.co/oVSMfEzaGX Se pueden cambiar vidas, se pueden agregar sonrisas y se puede ganar un músico fantástico.  Anoche un sueño hecho realidad y el principio de muchas cosas. El público aplaudió de pie a Cesar, alumno de la escuela de la @Fund_Adentro \n.\n.\n#fundacionadentro\n(WT) https://t.co/ievRISp5hh Alguien llegó por sorpresa al montaje.  Ya está en Guate. @Fund_Adentro Concierto íntimo . (WT) https://t.co/dg2gOZXRlE Ya en Guatemala músicos y staff. Emocionados iniciando el montaje del concierto íntimo a beneficio de la @Fund_Adentro que dará Ricardo Arjona. Ya estamos trabajando.  Nos vemos mañana. Hotel Camino Real.\n(WT) https://t.co/piBN4JkQAx RT @INFOMUNDOARJONA: @Ricardo_Arjona dio una entrevista EXCLUSIVA para Guatevisión y Prensa Libre en la cual comparte su visión de país y s… RT @MetamorfosisMed: @Ricardo_Arjona dio una entrevista exclusiva para Guatevisión y Prensa Libre en la cual comparte su visión de país y s… https://t.co/y4jkKp2ahi https://t.co/H2mcy89rnh \nEste 4 de diciembre. Concierto Íntimo por la causa de todos. Guatemala. Nadie sabe a donde va. (WT) https://t.co/RaIK0gwLS3 Adonde vayas voy. @adriaarjona https://t.co/JXAX1M1XZZ No le pidas futuro a lo que no tiene presente. @Fund_Adentro \n(WT) https://t.co/TUS1YRYBLW LA DESPEDIDA en GUATEMALA.\nDos conciertos AGOTADOS con más de 60mil paisanos despidiendo al CIRCO después de año y medio desde la primera función. \nGracias GUATEMALA.\n\nhttps://t.co/0i8NPXlqt8\n@Zenit_Films \n#CircoLaDespedida\n(WT) Urge más gente como vos. Se te quiere.\n#Repost @panchorizoguate\nUn momentito de parcería con el profe @ricardoarjona .  Agradecido con la vida por esta etapa en mi carrera .  Siento como si algo apenas empieza 💥👊🏽🌙⚡️🎪 Gracias TOTALES!!! #circosoledadlagira #payasodelas4decadas https://t.co/m5PGnFnVgj Los ganadores del sorteo solo para Miembros de @INFOMUNDOARJONA despidieron al Circo en Guatemala. \n#MundoArjona \nhttps://t.co/XVc00f0sjE\n(WT) En las nubes.  Así me dejaron en la despedida.  En el país mas bello del mundo. https://t.co/igxjAKfpdF GRACIAS GUATEMALA 🇬🇹 #CircoLaDespedida\n(WT)\n📸@monodelespacio https://t.co/07YwCQ3LhP Segunda y última función de la gira, simplemente mágico. #CircoLaDespedida en Guatemala.\n(WT) https://t.co/JKuTlRNoj9 Más de 2 millones de espectadores, más de 20 países con más de 115 funciones, el Circo se despide en su casa. 70 mil personas nos acompañaron a decir adiós.\nGracias #Guatemala.\n(WT) https://t.co/xPHZl1W4bd Esta noche es el último show, esta noche despedimos al Circo. Nos vemos en unas horas de nuevo #Guatemala.\n(WT) https://t.co/FwHLyR91y4 La suerte de encontrarte. https://t.co/CSRWNQ2F0m RT @MetamorfosisMed: Así amanece el periódico @Prensa_Libre de #Guatemala . #CircoLaDespedida con miles de fans como testigos. Esta noche e… RT @prensa_libre: ¿Se perdió el concierto de #ArjonaEnGuate? Estos fueron los cuatro momentos que enloquecieron anoche a los seguidores ►… GRACIAS #Guatemala, mañana nos volvemos a ver. El Circo se despide donde todo empezó.\n#CircoLaDespedida\n(WT) https://t.co/Yn0U9hp0GX Momentos del #CircoLaDespedida en #Guatemala. \nPrimer show, 1/2.\n(WT) https://t.co/GccM4zUAGn Esta noche 35 mil corazones latieron al mismo ritmo. Gracias por tanto #CircoLaDespedida\n#Guatemala 1ra función.\n1/2\n(WT) https://t.co/wkKaHoNOpG Después de un año y medio de gira el Circo se despide en su tierra, #Guatemala.\nEsta noche primera función del #circoladespedida 1/2\n.\n(WT) https://t.co/YUFV04LaHI Me podría tomar una foto con usted antes del concierto? Y si es posible darle un beso para agradecerle el esfuerzo? https://t.co/TOdwxPIaTa Y es tanta mi fe, que aunque no tengo jardin...... ya compré una podadora.  Así salí hace muchos años... Chapin siempre. Ya en Guate para gritar vida con mis paisanos. https://t.co/7gYLKpOAuN Guatemala, el Circo Soledad termina donde todo empezó. A solo dos días del #CircoLaDespedida.\n(WT) https://t.co/PRlrMClXAe Un arlequín con buenos gustos, los Beatles, y un Halloween por los que se fueron. https://t.co/m2efVAZJFj A los 11 años, alguien lo inscribió en el concurso de canción más importante de los estudiantes en su país. Era el más joven de todos. Se acompañó con la guitarra que le había regalado su padre unos años atrás. Adivinen quien ganó?  ••••Leer más&gt;  https://t.co/EuUKYUOF0r\n(WT) https://t.co/34qwvR6tau Cuando la llevas al mar para convencerla. https://t.co/pDbvD03zv0 Cuando la que te gusta..... te niega un beso. https://t.co/PM4QfNBgih #Repost @adriamaggiore\n・・・\nCuando Suena tu canción Favorita, estás en Fila Uno y no podes contener tanta emoción 😂😂😂 #Adriadas #6años #RicardoArjona https://t.co/MRDVzNOjAl https://t.co/vf73VWRSAZ Cuando te dejas peinar por tus hijos. https://t.co/vwtj9z15HR Guatemala. El Circo Soledad termina donde todo empezó. https://t.co/obVa0g4eXd #ElCieloAMiFavor con más de 20 millones de vistas en #YouTube.\n(WT) https://t.co/2QIwCTNDIQ De la calle Florida y el piano bar de la calle Suipacha en Buenos Aires a las más de 40 mil almas que fueron testigos de la despedida del Circo Soledad. \n#CircoLaDespedida\nhttps://t.co/r2jrdQrhyn\n(WT) La estación del tiempo, armada para reencontrase con los amigos. La del viaje que continúa, la de las despedidas como puerta abierta para volver.  Argentina, gracias por la magia.  Se les quiere. https://t.co/CzWCwZ3Pa9 Verte llegar fue luz, verte partir un blues...Fuiste tú, junto a @IndiaMartinez directamente desde España, para esta noche. \n#CircoLaDespedida\n#Campodepolo (WT) https://t.co/UnIZlCSyl3 Gracias #BuenosAires , más de 40 mil personas fueron testigos del #CircoLaDespedida .\n(WT) https://t.co/YGOogAH4ho Despidiendo al #Circo en el #CampoDePolo de #BuenosAires.\n#CircoLaDespedida\n(WT) https://t.co/L5x0QcXSD1 Esta noche más de 40 mil personas acompañaron a aquel muchacho del piano bar.\n#CircoLaDespedida en #BuenosAires\n(WT) https://t.co/vCuXINTMWK UNO SE ESCAPA PARA REENCONTRARSE CON LOS LUGARES DONDE EMPEZÓ TODO. \nYa estamos en Argentina. \n#Argentina #arjona #CircoLaDespedida\n(WT) https://t.co/6k6lUYbhYa Fuiste tú Argentina ... desde siempre...\n#MetamorfosisTour 2012\n#Tbt #thowbackthursday\n(WT) https://t.co/4ikaWRBwJm Quien dijo Mate.  Argentina....como en casa. https://t.co/xgHpdTNccS En el sur del sur, los mapas se visten de blanco para ponerse un nombre. https://t.co/5iDsUMxNaS Aires de tango, olor a mate y a historias que aún no empiezan. Cruzando la cordillera para el reencuentro. El circo y la procesión van por dentro. https://t.co/NkCwG5cUpu Concepción. Ni lluvia, ni frío......pura magia.  Se recordará esta noche por siempre. Gracias por las risas #Concepcion.\n#CircoLaDespedida\n#Chile\n(WT) https://t.co/clbaTsG0x0 Contra lluvias y granizos en el #EstadioEsterRoa, gracias #Concepcion .\n#CircoLaDespedida\n(WT) https://t.co/4iUKo5oKTB Esto está pasando ahora mismo en #Concepción #Chile , 16 mil personas disfrutando del #CircoLaDespedida.\nFoto por @panchoen35mm  \n(WT) https://t.co/WGnGgcvIGp Más de 55mil personas viviendo el #CircoLaDespedida en #Santiago #Chile\n(WT) https://t.co/CUNGwS7K9B Esta noche el #CircoLaDespedida en el segundo show en #Chile , #Santiago estamos listos.\n(WT) https://t.co/JL6p4FbhcW El primer #SoldOut del #CircoLaDespedida en #Antofagasta. Gracias #Chile. (WT) https://t.co/Wh6TaSYyQg El comienzo del #CircoLaDespedida en #Antofagasta. #Chile siempre es bueno regresar.\n(WT) https://t.co/n9yRHaQrz4 Esta foto fue el primer ensayo de CIRCO SOLEDAD.  Hoy, empieza el final.  Chile, ya estamos aquí. (WT) https://t.co/2BDF8HM57N Se acabó la espera. #CircoLaDespedida llega a #Chile 🇨🇱.\n#Antofagasta sep 26\n#SANTIAGO sep 28\n#Concepcion sep 30\n(WT) https://t.co/fpHiBiT84F GUATEMALA, ya está disponible la venta de boletos para la SEGUNDA FECHA del #CircoLaDespedida este 4 de Noviembre. \nhttps://t.co/ymtEZAJOMO\n(WT) https://t.co/9BXk1emqtZ Es o no es?\n(WT) https://t.co/dvTvvMCafq Los guatemaltecos hacemos historia, NUEVA FECHA #Guatemala, #CircoLaDespedida estará el 04 de Noviembre en #CardalesDeCayala.\nBoletos a la venta pronto. \n(WT) https://t.co/7VaHFl34An Una persecución en taxi que dura tanto tiempo, deja cosas en que pensar. Cómo la suerte de tenerlas como amigas al grado de querer haber sido yo quien perseguía. https://t.co/EuTBuemnPf Gaby. Donde pones la voz, pones la magia. Esta vez en enorme compañía. Tres bellezas. Gaby, Joss y el verde guatemalteco.\n \nhttps://t.co/qfsKEZIQZo  \n\n#GabyMoreno  @JossStone https://t.co/fPy6ra9Y3b RT @Fund_Adentro: Luego de una capacitación de 5 meses, la @Fund_Adentro, la Agencia Japonesa de Cooperación Internacional #JICA y el Depar… GUATEMALA, entradas agotadas en solo 4 días.\n#CircoLaDespedida\n(WT) https://t.co/GrRjPhVmEr RT @MetamorfosisMed: El esfuerzo de poner a la disponibilidad del pueblo de Guatemala, con precios al alcance de todos, el concierto de est… GUATEMALA, \nYa están a la venta los boletos para #CircoLaDespedida, el 3 de Nov.\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/SjQQ96YKQo Esta vez le toca al pueblo de  GUATEMALA.\n#CircoLaDespedida\n(WT) https://t.co/mn4p4P1NxO #ElCieloAMiFavor con más de 8 Millones de vistas en Youtube.\nhttps://t.co/ylfR44BPja\n(WT) https://t.co/rQy5BFygZr Mi agradecimiento inmenso a Luis Von Ahn por unirse a esta causa y convertirse en ejemplo para más gente y entidades guatemaltecas. Vamos por mas. https://t.co/eZuiaLmxq3 A Venezuela mi solidaridad desesperada en esta y todas sus catástrofes.  Que la luz de su gente elimine las sombras. #ElCieloAMiFavor\n#MakingOff Agosto 22.\nhttps://t.co/6bC3VUwPHM\n(WT) https://t.co/7dPRC1RnvB Es tan poca cosa la que ofrezco,\n#ElCieloAMiFavor hoy se equivoca. \nhttps://t.co/6bC3VUwPHM\n(WT) https://t.co/CjeemHaxNi Mi agradecimiento emocionado a todos los que hicieron un Puente mágico entre este esfuerzo centroamericano y el mundo. La nostalgia y la emoción se abren paso a puro sentimiento. #ElCieloAMiFavor llega a 3 Millones de vistas en #Youtube en solo 24 horas. ¡Gracias!\nhttps://t.co/6bC3VUwPHM\n(WT) https://t.co/YafOaV03sw #ElCieloAMiFavor Cortometraje Oficial\nYA DISPONIBLE\nhttps://t.co/6bC3VUwPHM\n(WT) RT @TIDAL: Mira a la hermosa obra maestra visual de @Ricardo_Arjona para \"El Cielo a Mi Favor\": https://t.co/k9xKQh1uas https://t.co/5ZhYMa… #ElCieloAMiFavor Cortometraje Oficial\nYA DISPONIBLE.\nhttps://t.co/6bC3VUwPHM\n(WT) https://t.co/A57fYAV9qc #ElCieloAMiFavor Cortometraje Oficial\nYa está Disponible\nhttps://t.co/LsoTRXYqR5\n(WT) RT @billboardlatin: Did you watch @RicardoArjona new \"El Cielo a Mi Favor\" Music video? Prepare to cry!  https://t.co/6in9VJFgvC #ElCieloAMiFavor\n(WT) https://t.co/zsfgstRJo7 #ElCieloAMiFavor \nGracias @Telemundo y a @UnNuevoDia por el lanzamiento.\n(WT) https://t.co/iCNnnhwnb0 #ElCieloAMiFavor\nEl rescate de las canciones con alma y una producción que ya compite en los festivales de cine más importantes.\nMuy pronto\n15 de Agosto\n(WT) https://t.co/M2hdXTxFVl Una luz de marzo entre los ojos. La ternura pone casa en la animación.\nUn cortometraje que toca los sentidos #ElCieloAMiFavor\n15 de Agosto\n(WT) https://t.co/SBUo8NizXI Cuando descubres la emoción....descubres la vida. #ElCieloAMiFavor\n15 de Agosto\n(WT) https://t.co/aNgsvALrZZ Cuando dar, es recibirlo todo. #ElCieloAMiFavor\n15 de Agosto\n(WT) https://t.co/1mETg15RZS Donde esta historia cobra vida.\n#ElCieloAMiFavor\n15 de Agosto\n(WT) https://t.co/V4VTK5VToM #ElCieloAMiFavor \nEl rescate de las canciones con alma y una producción que ya compite en los festivales de cine más importantes. \nMuy pronto\n15 de Agosto\n(WT) https://t.co/TGFt8weMhr RT @Fund_Adentro: ¡Con el corazón lleno de alegría tras la visita de nuestro fundador @Ricardo_Arjona! #AsíEsMiEscuela 😍😍 https://t.co/GaA3… Dividido entre 2 mundos - la realidad y la animación.\nEstén muy atentos .\n15 de Agosto\n(WT) https://t.co/SJzU8E54Jf Siempre es bueno reencontrarnos con nuestro futuro. @fundacion_adentro\n(WT) https://t.co/eQ6vKOzfbj Alguien no ha querido ir a la playa, quien lo saca de este encierro.\n(WT) Guatemala. https://t.co/zG3QJZt6Gc Dos surfistas se metieron en mi vida. Están locos...... nos llevamos bien. https://t.co/SuMcvtzkHx LAS COSAS COMO SON\nQue no se borre la\nmemoria. Hay más familias que necesitan tu ayuda.\n(WT) https://t.co/0m0WrFNvlc El Circo crece, más músicos ,más canciones, más personajes.\n#CircoLaDespedida\n(WT) https://t.co/y5z21EsKdL @notiarjona Jajajajajaja.  Andan lejos. Recordando #CircoSoledadLaGira \n(WT) https://t.co/biugZrdh90 Uruguay, Uruguay. \nSudor, garra, talento y amor propio. El resultado es lo de menos. #TBT\nNo hay reloj que de vuelta hacia atrás , gracias Madrid, los quiero.\n(WT) https://t.co/4ufHj2Ogl0 Son más peligrosos los que tienen pies. Y si usan corbata, más peligrosos aún. https://t.co/l9X80d5S2H @notiarjona No duele la duda del corte de pelo.  Duele la duda del talento para manejar el balón. Jajajajja. Besito bellezas. Perderse......pa encontrarse . https://t.co/bMYegED5Bo RT @notiarjona: Uds que piensan del video que subió @Ricardo_Arjona ? Que el mar lave los males y el\nmundial mientras tanto nos haga olvidarlos. https://t.co/WDWV6PC7Nb #ElCieloAMiFavor se equivocó.\n#FrasesArjona\n#63\n(WT) https://t.co/WAmFmHvqei Siglo XXI, las sociedades protectoras de animales harían más de un escándalo por una atrocidad así con perros.  Nuestros niños merecen mejores presidentes que impidan la fuga de personas en busca de lo imposible y también merecen mejores corazones en los países que los reciben. https://t.co/AXK3IzUTrO Después de 20 países, 75 ciudades, más de 100 conciertos, más de un millón y medio de espectadores, llegó la hora de LA DESPEDIDA.\n#CIRCOLADESPEDIDA será la Metamorfosis del Circo.\nhttps://t.co/Amne1eSGlA \n(WT) Lo que fue Circo Soledad se convertirá en CIRCO LA DESPEDIDA.\n#Chile 26,28 y 30 de SEPTIEMBRE\n#Argentina 05 de OCTUBRE\n\nSerá la METAMORFOSIS DEL CIRCO.\n#CIRCOLADESPEDIDA\n(WT) https://t.co/KIJpTTmMM9 Al sur. LA METAMORFOSIS DEL CIRCO, SERÁ LA DESPEDIDA.  (WT) https://t.co/YzAGdBdnVR Comenzó la venta general de boletos para el show del \"Circo La Despedida\" en Buenos Aires. #CircoLaDespedida\nhttps://t.co/mC2dFKHpuL \n(WT) https://t.co/Ol41mKeB7b RT @Fund_Adentro: Desde #Fundadentro acompañamos a la Escuela #EnriqueCastilloMonje ante las irreparables pérdidas sufridas tras la #Traged… @notiarjona Cuento siempre con ustedes. Mi familia del sur.  Se les quiere. R.A. Las cosas como son. https://t.co/tVOFKdg3vO Un pedacito de esperanza. Que Dios la bendiga. Fuerza Guatemala https://t.co/lVi8ABPmwB Hermanos de Guatemala. Mi solidaridad con los damnificados por este desastre de la naturaleza y mis condolencias a las familias de los fallecidos. Esa manía de cambiar de sitios.  Ayer la emoción y el ruido.   Hoy, en medio de la nada, rumbo a cualquier lugar. https://t.co/kBbm8H5CgM Monterrey.  Mi agradecimiento profundo por ser el primer lugar que se fijó en mi trabajo. Esta noche lo celebramos.  Gracias por la magia. Esta noche escuchamos a más de 10.000 voces cantando “Te Conozco”, que linda manera de finalizar esta etapa. GRACIAS #Monterrey fue mágico. \n#SoldOut\n(WT)\n@chuypedraza\n@arenamtyoficial https://t.co/IeeMvU5Ijz Más de 90 fechas en 12 meses, más de 1.5 millones de espectadores, #CircoSoledadLaGira les dice GRACIAS a todos, en especial a ustedes #Monterrey, los llevo conmigo.\n#soldOut\n@arenamonterrey\n@chuypedraza\n(WT) https://t.co/6wUrMeVKCp Ella fue la última #señora de este #circosoledadlagira , sin duda un momento muy especial para ambos. 🇲🇽 #SoldOut\n(WT) https://t.co/uLAYTaxTp2 El #CircoSoledadLaGira dice adiós en #Monterrey, Gracias por todo.\n(WT) https://t.co/uVCSp8np2c @notiarjona Jamás tan extremo como volver bellezas. @laura_lafetagui @notiarjona @XtaseaTirolesa @MetamorfosisMed Por medio suyo,  belleza,  mi agradecimiento inmenso a las Espartanas por ser responsables en gran medida de lo que nos pasó por su tierra. Mucha vida.  Se les quiere. Volver a donde todo empezó con la misma energía del primer día. Gracias, los llevo en el corazón. @auditoriomx \n3/3 #SoldOut\n(WT) https://t.co/wegzX9uq3K Mi novia se me está poniendo vieja junto a Manuel Mijares en el @AuditorioMx \n2/3 México #soldout\n#CircoSoledadLaGira\n(WT) https://t.co/cDSGeklqdZ 🇲🇽 #circosoledadlagira por segunda noche en el Auditorio Nacional #SoldOut Gracias México. 2/3\n(WT) https://t.co/pKTMiri4Fu México, el cielo a mi favor se equivoco con ustedes. Muchas Gracias.\n#soldout 1/3\n#circosoledadlagira\n(WT) https://t.co/OLswVq9BH5 MÉXICO!, el #CircoSoledadLaGira regresó al #AuditorioNacional\n#SoldOut 1/3\n(WT) https://t.co/XTt2gIH4yy Siempre ha habido algo especial Argentina 🇦🇷 , esta vez, será histórico. 5 DE OCTUBRE #muypronto #CircoLaDespedida #CircoSoledadLaGira\n(WT) https://t.co/7ltf0hAgq5 #CircoSoledadLaGira y su paso por #Europa\n(WT) https://t.co/XnR1prEeQC México nos vemos pronto. #circosoledadlagira regresa a donde todo comenzó.\n(WT) https://t.co/h6JCCwST0Y #CircoSoledadLaGira llega a su fin, donde todo empezó. MÉXICO nos vemos pronto. 🇲🇽\n🎟 \nCdmx 24,25,26 mayo\nMonterrey 31 mayo\n(WT) https://t.co/izVxh8467I Corte dominicana falla a favor de Ricardo Arjona https://t.co/MzSnDRHkGb De Barcelona al D.F. Sin escalas.  Auditorio nacional, Arena Monterrey Mexico.  Allá nos vemos. https://t.co/EwS0FB43Vc Volvemos #México\n#CircoSoledadLaGira\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/ySj0kNkp54 RT @programa_hoy: Descubre qué famoso fue a disfrutar del concierto de @Ricardo_Arjona en Madrid 😮 https://t.co/ABlbWtpP7f https://t.co/mMtPfbTFXS https://t.co/M9bvupQvx6 Gracias por dos noches increíbles, los quiero.\n#barcelona 2/2\n#circosoledadlagira\n(WT)\nFoto by @ramirezeduard https://t.co/A82vSoXUdh #Barcelona fue un placer.\n2/2  #CircoSoledadLaGira\n(WT)\nFoto @theveraview https://t.co/7jH146qdiD Segunda y última noche en #Barcelona.\nhttps://t.co/3o1gkSafwC\n#CircoSoledadLaGira\n(WT) https://t.co/BetuQCCKwA Para @AlejandroSanz y Antonio Álvarez y Bernal mi agradecimiento por enviarme a esta dama Sevillana para que me haga compañía por siempre. https://t.co/jbtrnHBClw Noche mágica Barcelona. Por suerte hay una más. Se les quiere. RT @PalauSantJordi: Una puesta en escena espectacular @Ricardo_Arjona #circosoledadlagira https://t.co/N1ODPS3nDT RT @PalauSantJordi: La magia del circo envuelve el conciertazo de @Ricardo_Arjona  #circosoledadlagira #santjordiclub @PalauSantJordi https… Una noche de dos, el #CircoSoledad se queda en #Barcelona, nos vemos mañana.\n#soldout\n#circosoledadlagira\n(WT) https://t.co/JIDGtayRFt Gracias BARCELONA.\n#SoldOut\n#CircoSoledadLaGira\n(WT) https://t.co/tDQzTRJNes Madrid #CircoSoledadLaGira\nhttps://t.co/Q0AjECOAos\n(WT) Barcelona.  Ya estamos aquí.  ( WT) https://t.co/WWbBsTnEAz https://t.co/U7YYe7t5jP Madrid. Gracias por la magia y el cariño a la distancia. Noche para recordar. Llenaron el lugar de una energía increíble... Gracias a todos por el cariño, el calor y la entrega.  Gracias Madrid.\n#SoldOut\n#CircoSoledadLaGira\n(WT) https://t.co/sfidYzWhln Después de 9 años aquí estamos Madrid. 🇪🇸 #SoldOut\n#CircoSoledadLaGira\n(WT) https://t.co/1xzKFcmhct Amor del bueno desde que la vi, Feliz Día de las Madres.\nhttps://t.co/kcWaTpzmLC\n(WT) Circo Soledad La Gira llega a ESPAÑA.\nMadrid 10 de Mayo, Barcelona 12 y 13 de Mayo.\nhttps://t.co/3o1gkSafwC\n#CircoSoledadLaGira\n(WT) https://t.co/uL9ohViiu6 Madrid.  Volver . https://t.co/wiCT5Kpm1M Toda una vida compartiendo con el piano del maestro Victor Patron.  Me encuentro con esta belleza de mensaje, típica de su talento paralelo a la música. Me uno a su campaña maestro. https://t.co/ImoiKNTgcJ #CHILE , volvemos, para despedirnos.\n#CircoLaDespedida\n#CircoSoledadLaGira\n(WT) https://t.co/TFJw35lj1Y RT @carlosbaute: Domingo de locura en casa con los peques, familia, caos y más, pero con algo de música, eso si la mejor.\nRecordando temas… Con el Sr. Arjona Torres.  De los pañales a las responsabilidades. Como si el tiempo tuviese prisa. https://t.co/fj4eto1abj Milán\n#CircoSoledadLaGira \n(WT) https://t.co/wTeq0Nl11t Sin más que decir que GRACIAS #Milan. \n#CircoSoledadLaGira\n(WT) https://t.co/q7mrHLD3KE #Milan el placer fue mío , una noche para guardar en la memoria.\n#CircoSoledadLaGira\n(WT) https://t.co/8hepTFoFvo Más, hubiese sido insoportable. Milán,  una de las noches más especiales de este CIRCO SOLEDAD.  Se les quiere. https://t.co/fNuc71gWWj Llegamos Milán. Nos vemos esta noche. (WT) https://t.co/KMqBcsQM6U Así vivió #Zurich el #circosoledadlagira , #Milan nos vemos mañana.\n(WT) https://t.co/ih6qbD8kbk Que gran noche! , gracias por tanto. Hasta la próxima! #zurich #soldOut\n#circosoledadlagira\n(WT) https://t.co/fjTN6ob7fU #Zurich Gracias por hacerlo posible! #SoldOut \n#CircoSoledadLaGira\n(WT) https://t.co/pH87pfE0lo Cantar en lugares que nunca sospeché    Otra manera de saltar al vacío.  Suiza ya estamos aquí. https://t.co/Tk5fJMnrdS #Londres gracias, nos veremos en otra oportunidad. Se les quiere. #soldout\n#CircoSoledadLaGira\n(WT) https://t.co/JeUykby1Tb @DiegoEnrique_24 Vamos para allá Italia.  Abrazo grande. Esto de cantar en Londres fue una locura que quiero repetir.   Gracias hermanos por la magia. Se les quiere. #CircoSoledadLaGira suma otro #SoldOut , gracias por tanto #Londres 🇬🇧🎪\n(WT) https://t.co/SHL0Y27CUU Que gran noche #Londres , una para recordar. Gracias.\n#CircoSoledadLaGira\n#soldOut\n(WT) https://t.co/Uo7AhThizN GRACIAS LONDRES 🇬🇧 🎪\nA casa llena se vivió el #CircoSoledadLaGira en el #eventimapollo \n#soldout\n(WT) https://t.co/7aiXlv35Se La caída libre de todos los días, Pa sentir que se vive de verdad. Londres ya llegamos . https://t.co/W4COfRnyhD 🇬🇧🎪 0 2 / m a y o \n#circosoledadlagira\n(WT) https://t.co/Wi1CKyPrOj #TBT\n#CircoSoledadLaGira en Perú 🇵🇪 🎪\n#throwbackthursday (WT) https://t.co/3lmZj8ZqSo Europa falta muy poco.\n #CircoSoledadlagira\nhttps://t.co/BpNOwNLpIn\n(WT) https://t.co/LOO2XYSQry LA GIRA CIRCO SOLEDAD LLEGA A EUROPA.\nMayo:\n🇬🇧 Londres 02\n🇨🇭 Zurich 04\n🇮🇹 Milán 05\n🇪🇸 Madrid 10\n🇪🇸 Barcelona 12-13\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/3VEFnB4HuA El CIRCO SOLEDAD está presente en Lima,Perú. \n#SOLDOUT\n#CircoSoledad\n(WT) https://t.co/K9wohEXOwK Y si no existieras   Donde viviría la felicidad.  Feliz cumple hijo.  Te quiero. https://t.co/0y2oyOAfl8 @cristy06082 @ArjonaperuFans Usted fue? Abrazo grande y mi agradecimiento total.  Quise saludarlos pero se complicó. Besito linda. Así nos recibe Peru. Bendito sea el milagro que hoy nos hace coincidir.  Ya estámos aquí hermanos. https://t.co/yFsKqIEtFQ Con mas del 92% de los votos el Circo se mantiene Solo.\nGracias.\n\nhttps://t.co/uQtirNsHNM \n @LatinBillboards @billboard \n#CircoSoledad\n(WT) https://t.co/J4J3wx8lEj Perú. Allá vamos. Releyendo los  cuadernos de don Rigoberto y rumiando el tiradito que vendrá pa estar a tono.   Suerte la de volverlos a encontrar. Paraguay 🇵🇾 ya se les extraña.\n#TBT #CircoSoledad \n(WT) https://t.co/ZQmtt1dDzQ A nuestra \"Señorita\" se le devolvió la llamada.\n#Señorita #PrimerImpacto #Univision\n(WT)\n\nhttps://t.co/N6QUwbCZLw Gracias por la noche Paraguay.  Me la llevo para guardarla donde se pone lo especial.   Los quiero. Paraguay esta es una de esas noches que no se olvidan. Gracias. 🇵🇾\n#SOLDOUT\n(WT) https://t.co/hplNFQWgZs Paraguay 🇵🇾 el #CircoSoledad ha llegado.\n#SOLDOUT\n#CircoSoledadLaGira \n(WT) https://t.co/Yd3N0hnblT Barcelona el Circo Soledad anuncia #SOLDOUT CON MÁS DE UN MES DE ANTICIPACIÓN.\nA petición popular se abre nueva función en #Barcelona nos quedamos un día más. \n13 de Mayo en el Club Sant Jordi \n(WT) https://t.co/NsTgGf7EFx Del viejo continente directo al sur de America.  Paraguay . A curar estas ganas de verlos. RT @notiarjona: Video subido por #GinaTatiana #RuedaDePrensa #CircoSoledadLaGira #España @Ricardo_Arjona @MetamorfosisMed https://t.co/Lbuv… Gracias España.  La mesa está puesta para volver en Mayo. Se les quiere. Abril era el futuro anticipado de un marzo que se fue sin darnos cuenta. Lo recibo en Madrid para anticiparnos al regreso, después de tantos años. Tu brazos Guadalquivir.  Confieso que escribí la frase sin conocer este río magnífico. Hoy, en… https://t.co/O9MlDm0dvp Gracias Honduras. Me los llevo conmigo.  Noche mágica. https://t.co/Ajshnhp8tL Gracias Honduras. Me los llevo conmigo.  Noche mágica. Gracias Honduras 🇭🇳 \n#CIRCOSOLEDAD\n#SOLDOUT\n(WT) https://t.co/kfbmBP91SG 1(844)-SOY LOLA \nMarzo 23 - \núltimos mensajes \nLLAMA YA!\n#Señorita (WT) https://t.co/AKE4BYiqgQ Honduras. Por fin, nos encontraremos este viernes. Belleza me la perdí. Donde la encuentro para darle un besito? https://t.co/CCBYmLeD8K El #CircoSoledad desde tu punto de vista #Sacramento.\n#SOLDOUT\n(WT) https://t.co/aekh7lDmk6 Dando el primer paso en Sacramento @Golden1Center.\nNo será el último.\n#SOLDOUT\n@circosoledadlagira \n\n📸-@m0_exclusive\n(WT) https://t.co/rInPLnyCfW No puedo explicar lo mucho que  he disfrutado esta gira por USA. Aunque la procesión va por dentro, lo inmenso que ha sido el contacto con nuestros paisanos latinoamericanos hace que cantar sea una manera de estar al día con la tierra de la que venimos. Gracias Fresno.\nLa siguiente parada de nuestro #CircoSoledad será en la capital de California. #Sacramento nos vemos muy pronto.\n#circosoledadlagira \n(WT) https://t.co/JAFuVyATFx \"El problema no es tu ausencia\nEl problema es que te espero.\"\nFresno la espera se terminó. El #CircoSoledad a llegado.\n(WT) https://t.co/U5fIkrATut Gracias por la magia California. Se les quiere. Más de 10,000 voces se unieron esta noche en San José para cantar con nuestro #CircoSoledad. \"Te Conozco\"\nGracias San José.\n#SOLDOUT\n(WT) https://t.co/N0XrLdbUFo El Taxi se estaciona esta noche en San José. Bienvenidos al #CircoSoledad.\n#SOLDOUT\n\n(WT) https://t.co/rESLqsEw0c \"También es mi primera vez.\"\nQue no sea la última. \nGracias Ontario, California.\n#circosoledadlagira \n#SOLDOUT\n(WT) https://t.co/zqRQ95Uobr Hago apnea desde el día que no estás... Ontario, California esta noche el #CircoSoledad está con ustedes.\n #SOLDOUT\n(WT) https://t.co/kVdfOcW52M Gracias Los Angeles.\n@circosoledadlagira \n#SOLDOUT\n(WT) https://t.co/NptdnKzPMF El CIRCO SOLEDAD sigue hasta que ustedes digan.\n@circosoledadlagira \n#CircoSoeldad\n#LA #SOLDOUT\n\n📸-Xtreme _entertainmentla\n(WT) https://t.co/MURGO9EaK1 Dime si el te ama la mitad, de lo que te ama este loco que dejaste en libertad... Los Angeles.\n#LA\n#SOLDOUT\n#CircoSoledad\n@circosoledadlagira \n(WT) https://t.co/5tL0oaoWhI Honduras se termino la espera. \nEste 23 de marzo confirmamos la llegada de nuestro #CircoSoledad en #Tegucigalpa \n#Confirmado\n(WT) https://t.co/IAuuQDyV9a Más de 5,000 llamadas.\nMás de 2,000 mensajes escuchados.\n#señorita\n… posiblemente regresaré la llamada.\n\n(WT) https://t.co/sIaV3Bosvo RT @ramfisdt: Cuál es la imagen que promovemos de nuestra Patria, cuando el hijo de un funcionario muy de @DaniloMedina, embarga irregularm… Ya vieron \"Realmente no estoy tan solo...\"\nGracias Atlanta.\n#circosoledadlagira \n#Atlanta\n#CircoSoledad\n\n📸- @karencalverphotography\n(WT) https://t.co/h8F3ZKtelF 📍#Atlanta\n#circosoledadlagira \n#CircoSoledad\n(WT) https://t.co/S0ev1jHQXf RT @mynormcknight: @Ricardo_Arjona en 1989 vendió su moto al productor de sus primeros videos, Rigo López, para agenciarse de fondos y pode… Con lo que hacen falta más como el. Martin Luther King Jr. https://t.co/B0sqvdqQfP #Señorita logra 2 Millones de Views en tan solo un día. Gracias.\n(WT) https://t.co/2wM606JrtL Deja tu mensaje, podrás recibir muy buenas noticias...\n#señorita #llamaya\n\n(WT) https://t.co/qIYlSu7eMR Siempre es especial llegar a un lugar nuevo. Gracias Carolina Del Norte por dejar que este #CircoSoledad llegara, disfrutará y se encontrará con una casa llena. Una casa llena que disfruto con nosotros de esta nueva experiencia.\nHasta la próxima...Gracias. @circosoledadlagira \nWT https://t.co/6jsZa3nVJy RT @billboardlatin: Exclusive premiere: @Ricardo_Arjona's 'Senorita' Is More Than a Blind Date in a Bar https://t.co/5IcrSumy0w https://t.c… RT @quieromusicatv: ATENTAS todas l@s fans de @Ricardo_Arjona que se viene el estreno de #Señorita  YA por @quieromusicatv #EnAlta // Siemp… RT @billboard: .@Ricardo_Arjona's \"Senorita\" is more than a blind date in a bar (exclusive premiere) https://t.co/qvXZXzJeEN https://t.co/h… Circo Soledad La Gira Llega a Europa este Mayo.\n#Londres\n#Zurich\n#Milán\n#Madrid\n#Barcelona\n#CircoSoledad #EuropeanTour #Europa #Italia #Suiza #Inglaterra #España \n\n(WT) https://t.co/r2qTRwjdPp @Nodoubtcris @notiarjona Por Dios. Quién es esta belleza. ? RT @Nodoubtcris: Las fans de @Ricardo_Arjona hacen pogo con #Señorita 🤣 https://t.co/E5Wh0x430r #Señorita\nTrailer Oficial en Facebook. Nos vemos ahí...\n(WT) https://t.co/d5nSabnu40 RT @billboardlatin: Ricardo Arjona Astounds With Hits, Fan Favorites, &amp; Circus-Themed Entertainment at Madison Square Garden Show https://t… \"Los martes se llamaba Margarita...\"\n#Señorita \n\n#MuyPronto\n\n(WT) https://t.co/IkwP7Hfm9w Lenin. Hermano.  Me sorprende tu partida. Que suenen los tambores a donde quiera que vayas. https://t.co/iKtjtJvy6E #Señorita\nMuy pronto...\n\n(WT) https://t.co/P5iR0Uqf7q Gracias Miami, pedacito de Latinoamérica. Por la magia y la buena vibra. Llego y termino en muy buenas manos. #Señora \n\n @circosoledadlagira \n#CircoSoledad\n(WT) https://t.co/FwWCHnQkSZ Así llegó la señora en el AA arena de Miami que estaba en la fila más lejana.\n#circosoledadlagira \n#CircoSoledad \n\n(WT) https://t.co/HesevIwvd6 Minutos\nSon la morgue del tiempo\nCadáveres de momentos\nQue no vuelven jamás\nNo hay reloj que de vuelta hacia atrás... Gracias Miami.\n#SOLDOUT\n#CircoSoledad\n@circosoledadlagira \n(WT) https://t.co/QHRA9HbnVZ Miami, las múltiples banderas y emociones que habitan en este lugar hacen que nuestro micrófono, nuestro circo y nuestro todo se luzca con firmeza.\n\n @circosoledadlagira \n#CircoSoledad\n#SOLDOUT\n(WT) https://t.co/GokdlbeejY American Airlines Arena. Miami. Aquí están buscando un cantante? https://t.co/h2fzNQKLEz RT @notiarjona: https://t.co/g8LVEki4FO Los que ven al suelo, se quedan en el suelo.  Habiendo tanto que ver en el cielo.  \nARJONA \n(WT) https://t.co/HReuD3XVA5 Puerto Rico, Madison Square Garden, Boston.  Sold Out.  La felicidad del circo, la gira más importante en español, es la tristeza de unos pocos.   \nPorque el circo lo llevamos por dentro.  \n(WT) https://t.co/xdtcJf3SbF Boston esta noche nos brindaron toda su energía. La energía necesaria para olvidarnos por completo de este invierno y sentirnos en casa. Gracias. #circosoledadlagira \n#CircoSoledad \n#SoldOut\n(WT) https://t.co/J2iLJ9APJI Boston después de mucho años de ausencia, nos reciben de la mejor manera posible. Gracias\n#circosoledadlagira \n#CircoSoledad\n#SOLDOUT\n\n(WT) https://t.co/yi3iBKY3le @notiarjona Sorprendente agilidad    No lo puedo  creer. Se quedaron hasta con mi ropa estos malandros, tuve que sacar del cajón de los recuerdos. https://t.co/O5GJp2k0wC RT @notiarjona: Excelente ! @Ricardo_Arjona https://t.co/qxHm1mhKNJ https://t.co/4qZj4yrSPP Gracias Nueva York.\n@thegarden\n\n(WT) https://t.co/W9zkWU2AcV Así se canta en Nueva York.\n\"Te Conozco\"\n\n@thegarden \n#SOLDOUT\n#CircoSoledad\n\n(WT) https://t.co/C6lYfuHDUr El Circo sobrevive con piruetas. Llegamos Nueva York.\n@thegarden \n@circosoledadlagira \n#SOLDOUT \n#CircoSoledad\n(WT) https://t.co/3DZTpy53AP Un Guate en New York.  Por segunda vez con CIRCO SOLEDAD, esta noche Sold Out Madison Square Garden.  La mejor venganza contra los enemigos,  es estar bien. (WT) https://t.co/mSBJWRYu50 Los enemigos que genera la independencia, valen mas que los amigos que genera la subordinación. Cuando la prensa no tiene voz.  Los pueblos no tienen paz. 🇵🇷\n\n(WT) https://t.co/lA6KpR0KRE Que hace el sexo en internet... emociones puras y sonrisas improvisadas tienen un solo culpable #PuertoRico 🇵🇷.\n\n#circosoledadlagira \n#CircoSoledad\n(WT) https://t.co/aO5qfZGxJh Gracias Puerto Rico por llenarme de su magia. A veces la naturaleza y sus avisos termina fortaleciendo aún más lo corazones. Se les quiere por siempre. RT @notiarjona: Los artistas de verdad. Siempre tienen un plan B . Su talento.  14 mil personas fueron testigos. \nCholiseo  Puerto Rico. #C… Esta noche se cumple nuestra asignatura pendiente Puerto Rico.\n\n#circosoledadlagira \n#circosoledad #SoldOut\n(WT) https://t.co/3bKs81FRhS Los personajes escoria,  son más peligrosos que la explosión simultánea de todos los misiles del Planeta. Pudren la sociedad, contagian a los niños con su ejemplo y huele mal por donde pasan.  Pululan en todas partes. incluso en los países con la gente más linda del mundo. Ya en suelo boricua, Puerto Rico estamos aquí. https://t.co/XxipPyvLYx Puerto Rico.  Estamos llegando.  (WT) https://t.co/51qFxBuJaM \" De mi puño y letra.  ESPAÑA vamos para allá.  Compromiso y gusto personal.  Un hecho.  Feliz de volver.\"\n\nMadrid y Barcelona en mayo estaremos con ustedes. \n\n#CircoSoledad\n#CircoSoledadLaGira\n#España\n#Europe\n\n(WT) https://t.co/5maAvsNP7d Contágiame caribe. De tu sonrisa clara y tu alegría plena. Santo Domingo, los quiero. https://t.co/4mpERsjE0T Más de 25,000 dominicanos nos acompañaron en esta noche tan especial. Gracias.\n#circosoledadlagira \n#SOLDOUT\n#CircoSoledad\n\n(WT) https://t.co/bPRQmG4M48 Santo Domingo 🇩🇴buenas noches.\n#SoldOut\n#circosoledadlagira \n#CircoSoledad\n(WT) https://t.co/OnMTVCjMUK Llegamos a Santo Domingo. Y mis amigos de Boca Chica se hacen presentes. https://t.co/MmRvuD5CMH Ya rumbo al caribe.  Santo Domingo, Puerto Rico.  Felices de volver. https://t.co/m5CQOwXDsX De mi puño y letra.  ESPAÑA vamos para allá.  Compromiso y gusto personal.  Un hecho.  Feliz de volver. Un placer Panamá 🇵🇦 1/1 #soldout\n#circosoledadlagira\n#TBT\n#CircoSoledad\n(WT) https://t.co/mQyhO8nYr1 Seguimos sin poder olvidar estas noches realmente especiales que nos hicieron pasar ustedes en estos últimos días.\nPura Vida Costa Rica 🇨🇷2/2 #soldout \n#circosoledadlagira \n#TBT #CircoSoledad\n(WT) https://t.co/S6Z7M5IwIV @rubenblades En cada barrio hay por lo menos un https://t.co/NVq0JT1jBk locura es la única  manera de sobrevivir con dignidad. Panama tiene el suyo, se llama @rubenblades  que vengan mas como vos. RT @tvnpanama: ¡El gran maestro @rubenblades ya le dio la bienvenida al cantautor guatemalteco @ricardo_arjona a Panamá! 😍 https://t.co/jIl… 🇵🇦Te Conozco 🇵🇦\n\n@circosoledadlagira \n#CircoSoledad\n\n(WT) https://t.co/YchfPR6paN 🇵🇦Panamá🇵🇦                               \"El problema no es tu ausencia\nEl problema es que te espero...\"\n \n#circosoledadlagira \n#CircoSoledad \n(WT) https://t.co/X062LtrPyE Panama llego nuestro Circo Soledad.\n\n#circosoledadlagira \n#CircoSoledad \n(WT) https://t.co/IfFBo2ELJz #Repost @javierrolo \nAyer Pedro Navaja fue un Animal Nocturno y tomó decisiones Sin Daños a Terceros. @rubenblades https://t.co/tAbBgitZ2B Panama llegamos. Siempre es un placer poder volver. \n\n#CircoSoledad\n#VisitPanama\n\n(WT) https://t.co/uV9W4y1INT https://t.co/3o1gkSafwC\n(WT) https://t.co/rJnp1YPyvB No creas en nadie que te quiera hacer creer en algo. Muchas gracias Costa Rica,\nagradecidos por dos noches llenas de energías únicas.\nEnergías que solo se encuentran en su tierra tica.\n2/2 #SOLDOUT\n@circosoledadlagira \n#CircoSoledad\n#PuraVida\n\n(WT) https://t.co/TnyBqocyo3 Panamá. Ya nos pusimos la camiseta. https://t.co/1f3esRB1dm RT @nube_deLuz: No me hagan esto, voy a querer ir a verte a Panamá hermoso!!!!\n@Ricardo_Arjona https://t.co/bgIktZpEs3 RT @La_Camafufu: Una falta de respeto que andes en Guate y no me respondas ningun tuit mucho menos me des un abrazo 😔 @Ricardo_Arjona \nTe a… Costa Rica. Un poco me los llevo conmigo con la esperanza de mantenerlos intactos hasta el próximo encuentro. Se les quiere. Pura Vida 🇨🇷\n\n2/2 #SOLDOUT\n #circosoledadlagira \n#CircoSoledad\n\n(WT) https://t.co/bkqCzE0N1N 🇨🇷siempre es un buen \n\"Remiendo Al Corazón\"\n#CircoSoledad\n#CircoSoledadLaGira\n(WT) https://t.co/gDLour0pEw Pura Vida 🇨🇷 #CostaRica\n#SoldOut 1/2\nEl #CircoSoledad los espera mañana...\n\n @circosoledadlagira \n#CircoSoledad\n(WT) https://t.co/PuDLAihsLY Gracias Costa Rica.  Como la primera vez . La magia la pusieron ustedes. Pura vida.  Se les quiere. Esta noche lo que se respiró fue Pura Vida.\n\n@circosoledadlagira \n#circosoledad \n#CircoSoledadLaGira\n\n(WT) https://t.co/lcGg8zkmjW #TBT Costa Rica, después de 3 años, acá estamos de nuevo, todo listo para el #CircoSoledadLaGira .\n(WT) https://t.co/qecpqdWIti Después de 3 años de ausencia regresamos a Panamá.\n#CircoSoledadLaGira\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/xw8x4mtZ4Z Costa Rica, falta muy poco.\n#CircoSoledadLaGira\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/PoRqyCio8D RT @MetamorfosisMed: @Ricardo_Arjona anuncia SOLD OUT a un mes de su show de la Gira #CircoSoledad en Boston.\nhttps://t.co/wE6flO74pW https… En solo 3 días estaremos en Costa Rica.\n#CircoSoledadLaGira\n(WT) https://t.co/DxROiVrHzk Entra en la cuenta oficial de instagram en el siguiente link y haz clic en la foto de perfil para participar \nhttps://t.co/Qy4R65OMQ9\n(WT) https://t.co/8akRVZ5QMM RT @Fund_Adentro: En tu día, todos los que estamos ADENTRO de tu escuela, te\nabrazamos con respeto, cariño y admiración. ¡Feliz Cumpleaños… Otra vuelta más al sol.  Con mis tesoros.  Gracias por sus mensajes. https://t.co/bluZNrgTvm #CircoSoledadLaGira vuelve a Estados Unidos.\n(WT) https://t.co/yw5mU0j8UO Alguien visitó a unos amigos en la Casa Ronald McDonald de Guatemala.\n(WT) https://t.co/yLKwWtsxZ5 #CircoSoledadLaGira continúa su paso en el 2018.\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/UfmR5DjtHn Guatemala.   A dos minutos del cielo. https://t.co/VnADB35yOy Todo lo que es bueno volverá.  Gracias a todos y feliz 2018.\n#FelizAñoNuevo\n(WT) https://t.co/e848M8HnWv Que llegues a donde quieras y te detengas cuando prefieras. Que quieras y que te quieran. Lo demás es azar. Feliz navidad y el mejor año. Nicaragua. gracias por la magia de esta noche. Así se despide el #circosoledadlagira del 2017.\nGracias por todo, fue un año lleno de pura electricidad, nos vemos en enero.\n(WT) https://t.co/RWt99PEOuf #Nicaragua, gracias por esperarnos.\n#circosoledadlagira\n(WT) https://t.co/BlTSGS9TWg Último show del año 2017.\nGracias Nicaragua.\n#CircoSoledadLaGira\n(WT) https://t.co/JKLscZ4J0V NICARAGUA, todo listo para esta noche. #CircoSoledadLaGira \nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/Tg3OgIHQaj Dicen que te fuiste hace unos días. Los que te queremos sabemos que habitaras por siempre en el humo que inventaste. El concierto de Nicaragua, la tierra de tus tabacos, será dedicado a tu memoria. https://t.co/HXc8nh8Aue Nicaragua , ustedes son los siguientes. \n#CircoSoledadLaGira\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/qU6ghWoxWh Más de lo que se vivió en Guatemala con el #CircoSoledadLaGira 🇬🇹\nDesliza a la izquierda 👈\n(WT) https://t.co/wGG23Pq7lo Gracias El Salvador.\nNicaragua , nos vemos mañana. 🎪\n#circosoledadlagira\n(WT) https://t.co/cRHyyeAoTc Lo logramos , acá estamos, gracias por el recibimiento hermanos del Salvador 🇸🇻\n#circosoledadlagira\n(WT) https://t.co/v3HIZvGQQl 🤡🤳🏽Comparte tus fotos usando  #CircoSoledadLaGira \n(WT) https://t.co/xHYBP6dDG5 🇸🇻\n#circosoledadlagira\n(WT) https://t.co/g13aOBKI5E El Salvador 🇸🇻 se hizo presente.\nBienvenidos...\n#circosoledadlagira \n#SOLDOUT\n#CircoSoledad\n(WT) https://t.co/zN6bVB4mSz El Salvador me recibe como debe de ser.   Como los viejos tiempos. https://t.co/qVMhu2RvCy 🇸🇻 El Salvador, acá estamos. Nos vemos en poco.\n#CircoSoledadLaGira\n(WT) https://t.co/bGHr9sWfVS @PepsiGuate\n#CircoSoledadLaGira\n(WT) https://t.co/KN8D7uuJBM EL SALVADOR, es tu turno de vivir el #CircoSoledadLaGira\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/1ys3S2XWU8 Atención USA, agregamos nuevas fechas. #CircoSoledadLaGira\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/eNwJgLRB9F Gracias.\n#CircoSoledasLaGira\n(WT) https://t.co/kawdI7CNXj El Circo sobrevive con piruetas.\n#CircoSoledadLaGira\n(WT) https://t.co/YZcAmRO81R Gracias por estas dos noches inolvidables Guate.\n#circosoledadlagira\n(WT) https://t.co/rN5HuLxxDd #señoradelascuatrodecadas\nGuatemala 2/2\n(WT) https://t.co/pugM5I18ne Después de dos años y por segunda noche consecutiva. #circosoledadlagira #mipais\n(WT) https://t.co/unoigNBNkD #CircoSoledadLaGira en su segunda noche en Guatemala.\n\n(WT) https://t.co/ITQsgITgkc Nada como cantar en mi tierra..Guatemalteco hasta los huesos.  Los quiero. https://t.co/cKE6SuJPm9 GUATEMALA ♥️\n#CircoSoledadLaGira\n(WT) https://t.co/vOxSNa48Fw Lánzame un si camuflajeado clávame, una duda y me quedaré a tu lado.\n#CircoSoledadLaGira\n#soldout\n📸 @JoseCL9 / @Liveinfest\n(WT) https://t.co/PbnoMaUWws Gracias por la espera Guate.\n#CircoSoledadLaGira\n#SoldOut\n#RecordsArjona\n(WT) https://t.co/kmZMLjnwqA El #CircoSoledadLaGira está en su casa.\nGUATEMALA.\n(WT) https://t.co/zpX7igT2vu RT @PepsiGuate: ¡Ya estamos aquí! 🎉\n#CircoSoledasConPepsi https://t.co/Fr398Cf1ug RT @PepsiGuate: ¿Estás en el concierto? \nSube tu selfie con el HT #CircoSoledadConPepsi \n¡Le estaremos dando RT a todas las fotos! 📷 https://t.co/stgitZ4TFi RT @PublinewsGT: #ArjonaEnGuatemala Miles de personas se han aglomerado para corear nuevamente todos los éxitos de @Ricardo_Arjona  Vía: @O… ¿Guatemala están listos para el #CircoSoledadLaGira?\n(WT) https://t.co/kephS8B16q Guatemala, ustedes son los siguientes.\n#CircoSoledadLaGira\n(WT) https://t.co/6J3EJg9mgx RT @marielalvarez1: @notiarjona @INFOMUNDOARJONA @Ricardo_Arjona Los testimonios en redes, las fotos, los videos y los rostros de alegría d… Ya en Guatemala, STAFF Y EQUIPO. A la cancillería y al embajador de Guatemala en Argentina GRACIAS. A 6 pasos gracias por ponernos a prueba, que les vaya muy bien si es que queda alguien que se arriesgue.\nArgentina, nuestro afecto intacto,  volveremos pronto en mejores manos\n(WT) RT @MinexGt: Reiteramos nuestro compromiso de atender con calidad y calidez a todos los guatemaltecos que nos necesiten en el exterior. Un… !!!!!!Ya estamos aquí Guate!!!!! https://t.co/WS6CMMhQ3k Cuando la tierra se acerca. https://t.co/vWcltZGn71 #ELLA\n40.000.000 de views\nG R A C I A S\n(WT)\nhttps://t.co/W2cAQhk153 https://t.co/Pg8iZPqGzz EL SUR.\n#CircoSoledadLaGira\n(WT) https://t.co/lpuR5J44dR Posponer un concierto duele el doble cuando debe de hacerse en el lugar donde uno nació. No quedo ninguna alternativa.  Entiendo el malestar y espero entiendan el nuestro. Buenos Aires.  Volver es siempre como empezar de nuevo. Se les quiere y se agradece la magia y la complicidad. 5 noches como tatuaje. Así vive Argentina la última función del Circo Soledad. #SoldOut 5/5\n#CircoSoledadLaGira\n(WT) https://t.co/5eEX1s9NMB Gracias por estas 5 noches de pura electricidad Argentina.\n5/5 #SoldOut \n#CircoSoledadLaGira\n(WT) https://t.co/E0YyUDaX2w 🙌🏼 #BuenosAires \n#CircoSoledadLaGira\n(WT) https://t.co/YxhBhcxSNk Esta noche Buenos Aires cantó desde el pelo hasta la punta de los pies.\n4/5 #soldout #CircoSoledadLaGira\n(WT) https://t.co/7m7NZO1Pmu 4/5 Buenos Aires.\n#SoldOut #CircoSoledadLaGira\n(WT) https://t.co/Di4N2AiKnz TE CONOZCO... Buenos Aires\n2/5\n#SOLDOUT\n#CircoSoledad \n#circosoledadlagira \n(WT) https://t.co/6Q7OMIzkMA Buenos Aires, otra noche con ustedes.\n2/5 #SoldOut #CircoSoledadLaGira\n(WT) https://t.co/bJUULguk0H Veronica nada es como tú.\n(WT) https://t.co/5UndpJdtMI 🇦🇷 1/5\n#SoldOut\n#CircoSoledadLaGira\n(WT) https://t.co/y5w8UWOsXf El Circo Soledad volvió a Argentina, y para quedarse por unos días.\n1/5 #SoldOut #recordsArjona \n#circosoledadlagira\n(WT) https://t.co/2BeVYp3IuN Cuando existir vale la pena. Veronica,   tu sonrisa, es el mejor premio que recibí.  Todo estará bien. https://t.co/2bpAabjltH Magia, mucha magia. Gracias Chile Por 5 noches que me durarán toda la vida. https://t.co/vGCEuoVmbB Esta noche cerramos el telón del Circo Soledad después de 5 noches consecutivas, muchas gracias. 🇨🇱 5/5\n#CircoSoledadLaGira \n#SoldOut #MovistarArena \n(WT) https://t.co/7v18DZ87r0 RT @T4FBizarro: Cae el telón. 5 fechas en @movistararena , @Ricardo_Arjona las repletó todas. Gracias a l@s fans que hicieron posible Circo… RT @T4FBizarro: El @movistararena se llena de sonrisas cada vez que @Ricardo_Arjona entona una nueva canción #conciertost4fbizarro https://… Todo lo que es bueno volverá, gracias por estas 5 noches 🇨🇱.\n@CircoSoledadLaGira\n#SoldOut #RecordsArjona #movistararena\n(WT) https://t.co/iuIGF704mf Te acuerdas de mi...\n#CircoSoledadLaGira\n#SoldOut 4/5 🇨🇱\n#movistararena\n(WT) https://t.co/tLP5Gtz7SK Los que hacen que este #CircoSoledad siga andando son ustedes...\n4/5 #movistararena 🇨🇱\n#SOLDOUT\n(WT) https://t.co/sblpzUUvjc 4/5 🇨🇱\n#soldOut #CircoSoledadLaGira\n(WT) https://t.co/IkDDYiO4ym 🇨🇱 Gracias Chile por hacerlo posible.\n#27MovistarArenas\n#RecordsArjona #CircoSoledadLaGira\n(WT) https://t.co/oJDr1vXhAj https://t.co/bjCdNF8rDK Aunque suene a pose, yo trato la manera de siempre salir a cantar y no contar, muy agradecido.\n#CircoSoledadLaGira\n#RecordsArjona\n(WT) https://t.co/3k1Uy2E4f1 Y es que tanto te conozco... 🇨🇱 🎪\n#CircoSoledadLaGira\n(WT) https://t.co/caLMmHxWak Chile 🇨🇱💥 por tercera noche consecutiva.\n#SoldOut  3/5\n#CircoSoledadLaGira\n(WT) https://t.co/IsicJQTpTg RT @MetamorfosisMed: https://t.co/Z8m664v3Cu 🇨🇱CHILE, Ya son más de 20.000 personas que han vivido el #CircoSoledad\n2/5\n#RecordsArjona\n(WT) https://t.co/jXpYkb83Lg 🇨🇱 CHILE\n2/5 \n#CircoSoledadLaGira\n(WT) https://t.co/541C4Y36jg @marielalvarez1 @Vale975 Beso grande. Gracias por la complicidad @ale_guevara1 Todos los días pienso en eso Cesar. RT @GarridoVal: @Ricardo_Arjona Mira ésto: no sé si te provocará más insomnio o te robará una sonrisa 😁 https://t.co/aUPlvLjlWi @GarridoVal @INFOMUNDOARJONA Por Dios.  Una belleza. Niko lo sabrá. Y ahora? Después de la magia.  Que hago con este desvelo. Gracias Chile. \n#CircoSoledadLaGira\n(WT) https://t.co/TipCyrreLD 🎪\nCHILE\n1/5 #SoldOut\n#CircoSoledadLaGira\n(WT) https://t.co/9m49D4qNov Chile, bienvenidos al #CircoSoledad, serán nuestro hogar por los próximos días.\n5/5 #SoldOut\n#CircoSoledadLaGira\n(WT) https://t.co/oQhYGenMSP A 15 años del disco más tormentoso de todos. El animal nocturno de la segunda vuelta.  El recambio de una generación que no abandonó la primera.   Santo Pecado. https://t.co/13WA1gb51g RT @JohaCaiJocoteca: Como un sueño que soñé!!! GRACIAS @Ricardo_Arjona... aún seguimos emocionadas! Madre e hija te amamos! @JocotecoFanClu… En la cornisa de Los Andes (Gabo) listo y feliz. MENDOZA 2/2\n#SoldOut\n#CircoSoledadLaGira\n(WT) https://t.co/gXQzVQlCRM Mendoza.  Como Pa  quedarse a vivir. Salud. https://t.co/Oa0oomCLEg RT @MetamorfosisMed: https://t.co/XgHgNhvvHg 🇦🇷Momentos del #CircoSoledadLaGira en #Mendoza\n(WT) https://t.co/C0CFiaZSbk MENDOZA\n#SOLDOUT \n#CircoSoledadLaGira\n(WT) https://t.co/TdcP8pvPQ3 Algo se hizo para tener el regalo de la complicidad    Cada ciudad un mundo nuevo dentro de un mismo país   Argentina, mañana Mendoza un buen vino y otra historia para escribir. Gracias #Neuquén\n#CircoSoledadLaGira\n#SoldOut\n(WT) https://t.co/0j2sckxtYC Del camerino al escenario, siempre acompañado con la guitarra.\n#Neuquén #CircoSoledadLaGira\n#SoldOut\n(WT) https://t.co/I7lWwAtlCF 🇦🇷#NEUQUÉN\n#SoldOut\n#circosoledadlagira\n(WT) https://t.co/YDwfQpROLU 🇦🇷#Neuquén viviendo el #CircoSoledadlaGira.\n#RecordsArjona \n(WT) https://t.co/gTYEhrzpy6 #CircoSoledad \n\n(WT) https://t.co/UMgim4SOv7 #Neuquén , todo listo para vivir el #CircoSoledadLaGira esta noche.\n.\nSigue la cuenta en instagram del @CircoSoledadLaGira y conoce a todos los personajes del circo.\n.\n(WT) https://t.co/S6LcI0br1D PANAMÁ, después de 3 años volvemos con #CircoSoledadLaGira .\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/48QePteVFX En exclusiva con @clarincom.\nhttps://t.co/7QWmcxXsOZ\n(WT) https://t.co/QoFzeh0qLP RT @MetamorfosisMed: Entra aquí para leer la entrevista exclusiva que hizo @clarincom a @Ricardo_Arjona  en medio de su gira Circo Soledad.… 🇦🇷🎪\n2/2 #SoldOut - Córdoba.\n\n#CircoSoledadLaGira #recordsArjona\n(WT) https://t.co/59BWh79y5N 🎪Muchas gracias Córdoba. \n2/2 #SoldOut\n#CircoSoledadLaGira\n#RecordsArjona\n(WT) https://t.co/v1gYFFLIbc 🎪Córdoba, esta noche nos encontramos de nuevo en el #CircoSoledad. \n(WT) https://t.co/0Y4OHmwetb Córdoba, gracias, nos vemos mañana.\n#CircoSoledadLaGira #SoldOut #RecordsArjona\n(WT) https://t.co/EJdLd1WWYc 🎪Gracias Córdoba. \n#CircoSoledadLaGira\n#recordsArjona\n(WT) https://t.co/vrYYKTl2hE 🎪Córdoba, la magia nunca se irá de este lugar.\n#CircoSoledadLaGira\n#recordsArjona\n(WT) https://t.co/aj4T4FU9gB PANAMÁ, tenemos fecha confirmada, 30 de enero.\n#CircoSoledadLaGira\nPre Venta disponible, 14 de noviembre.\n(WT) https://t.co/TOwgtkdwTK 🇦🇷🎪\nCórdoba, este fin de semana es para ustedes. #CircoSoledadLaGira\n(WT) https://t.co/EqsidFoBjq RT @clarincom: [AHORA] Entrevista exclusiva a @Ricardo_Arjona. Seguila en @clarincom https://t.co/ZGKVGVsI9F https://t.co/M8im8z1UXa 🎪🇦🇷Y todo lo que es bueno volverá.\n#CircoSoledadLaGira\n(WT) https://t.co/aG3hdO4aYE Ya son más de 50.000 personas las que han vivido el #CircoSoledadLaGira\n#RecordsArjona\n(WT) https://t.co/2x7jsD33Kl 🇦🇷\nCorrientes viviendo el #CircoSoledadLaGira\n#RecordsArjona\n(WT) https://t.co/Va0SyZb5pw Lo que se escucha fuera del camerino antes de cada concierto. Argentina felices de volver.\n#CircoSoledadLaGira https://t.co/kSx2HngRgd República Dominicana,\n#CircoSoledadLaGira llega el 10 de Febrero.\n(WT) https://t.co/jmt6d2JAXJ 🇦🇷🎪\nPróxima parada Corrientes, #Argentina #CircoSoledadLaGira\n(WT) https://t.co/kc2im10OOF Se dieron cuenta... \"Realmente no estoy tan solo.\"\nRosario -Argentina\n#SOLDOUT #circosoledadlagira\n(WT) https://t.co/J42EbYDHjD 🇦🇷Rosario también vivió el  #CircoSoledadlagira #soldout #recordsArjona\n(WT) https://t.co/YG7W6Q4Bqc 🇦🇷🎪\nAZUL, Argentina.\nRosario, nos vemos esta noche.\n\n#CircoSoledadLaGira\n#RecordsArjona\n(WT) https://t.co/T1VPLB5JY5 Rosario, llegó su turno de vivir el #CircoSoledadLaGira\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/H100gSJjYa Sin daños a terceros.\nAzul #SOLDOUT #CircoSoledadLaGira #recordsArjona\n(WT) https://t.co/DbhPhhlv9y Azul, también es mi primera vez.\n.\nBufanda hecha a mano por una azuleña, gracias.\n#CircoSoledadLaGira\n#recordsarjona\n(WT) https://t.co/XcEi6aUXME Argentina. Bendito sea el milagro que hoy nos hace coincidir......de nuevo. https://t.co/1Pn1qWbiDT 🇦🇷\n#CircoSoledadLaGira\n\n(WT) https://t.co/ax428a4zxR El CIRCO SOLEDAD a llegado al Argentina 🇦🇷\nLos primeros cómplices fueron ustedes, bahienses.\n#SOLDOUT\n#circosoledadlagira \n#CircoSoledad \nWT https://t.co/G8rg4zNqKm BAHIA BLANCA, nos vemos esta noche.\n#CircoSoledadLaGira\nhttps://t.co/GHbDAPGH17\n(WT) https://t.co/yc3A52yvnS RT @MetamorfosisMed: https://t.co/ITK54JKanc ARGENTINA, después de dos años volvemos.\n#CircoSoledadLaGira \nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/lEiojch5JY ARGENTINA, ¿están listos? , ustedes son los siguientes.\n\n#CircoSoledadLaGira\n(WT) https://t.co/N9C4FkaZnX Gracias Uruguay.  Por dejarnos dar nuestro primer paso por el sur,  con este CIRCO SOLEDAD Excelente inicio del #CircoSoledadLaGira por el sur. Gracias URUGUAY. \n#RecordsArjona\n(WT) https://t.co/6Dq9nmqWVb 🎪\nEl #CircoSoledadLaGira llegó al sur. \n#RecordsArjona \n(WT) https://t.co/F2wSPJE85T Momentos del #CircoSoledadLaGira - SEÑORA https://t.co/b7ZKn3xyXl \n(WT) RT @billboardlatin: .@Ricardo_Arjona's #CircoSoledad tops latest hot tours tally\nhttps://t.co/0p5MbTGRUy Más de 60 funciones, más de un millón de cómplices, ahora te toca a ti. Vive el #CircoSoledadLaGira\nhttps://t.co/piSmPhqdL0 \n(WT) 🎼\nNo consigo respirar, hago apnea desde el día en que no estás.\n#CircoSoledadLaGira\n(WT) https://t.co/VPkAQzt8Ud Costa Rica, serán dos los días que viviremos juntos el #CircoSoledadLaGira . Nueva Fecha : 27 de enero.\nhttps://t.co/3o1gkSafwC \n(WT) https://t.co/Lj3ZxjaqZx RT @billboardlatin: Ricardo Arjona Tops Latest Hot Tours Tally https://t.co/Kql7SCStHQ #PorquePuedo #BehindTheScenes\nhttps://t.co/5TsvbQPkrM\n(WT) https://t.co/dHA0YGWgrY 🇲🇽#Tbt Recordando #CircoSoledadLaGira\nen Ciudad de México\n.\n(WT) https://t.co/NodhSPUwCR 🇲🇽 #Tbt Recordando #CircoSoledadLaGira\nen Ciudad de México.\n.\n(WT) https://t.co/9zEObtxgRO Momentos del #CircoSoledadLaGira\nVer Video : https://t.co/dAlsAgkEtj\n(WT) https://t.co/EhsOri6S1V #CircoSoledadLaGira \nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/nIGG1jkhd9 URUGUAY, nos vemos el 1 de noviembre.\n#CircoSoledadLaGira\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/6x6ViyFIZm 👏🏼\n#FanCamArjona\n#CircoSoledadLaGira\n(WT) https://t.co/DIAXQ1j8CV Si te quiero es porque sos mi amor mi cómplice y todo. A iniciar el sur en la tierra de Benedetti. En el bajo, @isaacsakko de #PuertoRico 🇵🇷\n\n#circosoledadlagira\n(WT) https://t.co/KPNPcg1sO4 “Minutos” - #CircoSoledadLaGira\n\n(WT) https://t.co/kASO2Y6RXH Gracias Mexico.  Por hacerme volver al Taxi y al bar EL CHATO el de la señora de las cuatro décadas. Dos noches mágicas. Así se vive la segunda función del #CircoSoledasLaGira en el @arenacdmexico, gracias.\n#SoldOut 2/2\n(WT) https://t.co/nCdbALgIqP México, doblemente agradecido.\n2/2 #Soldout\n\n#CircoSoledadLaGira\n#recordsArjona\n(WT) https://t.co/xcvJA1J7SU Ciudad de México esta noche nos volvemos a ver.\n#CircoSoledadLaGira\n#arenaciudaddemexico\n(WT) https://t.co/HVvBqBaOR7 Ciudad de México\nPrimera función #SoldOut\n#CircoSoledadLaGira\n#RecordsArjona\n(WT) https://t.co/EcfNNhNBzf Gracias hoy y siempre México.\n.\n#CircoSoledadLaGira\n#arenamexico #recordsArjona #soldout\n(WT) https://t.co/TVX5zu2cEH México, donde empezó todo.\n.\n#SoldOut #ArenaMexico #CircoSoledadLaGira\n#RecordsArjona\n(WT) https://t.co/pIc40r29Pn México , donde empezó todo.\n\n(WT) https://t.co/zjFh3OO84i “Dices No y no tengo miedo,\nDices vete y yo me quedo,\nHasta que digas que si.”\n#PorquePuedo \n#CircoSoledad\n\n(WT) https://t.co/3AS8oW4uFB Ciudad de México\n19 y 20 de Octubre\n#CircoSoledadLaGira\n.\n.\n.\n(WT) https://t.co/d1z3V6kqEa Ciudad de México, nos vemos este 19 y 20 de octubre.\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/3bOrpZrIIY Entrevista exclusiva a @UnNuevoDia desde el @TheGarden en New York. \n(Parte 2)\nhttps://t.co/QAcEfofFqq\n\n(WT) Entrevista exclusiva a @UnNuevoDia desde el @TheGarden en New York. \n(Parte 1)\nhttps://t.co/JWF1vnBOJt\n\n(WT) #TuSeñoraArjona\n#CircoSoledadLaGira \n\n(WT) https://t.co/6rPYCQ39QP #CircoSoledadLaGira\n(WT) https://t.co/ZhSehio0hu El #AmwayCenter de Orlando también vivió a casa llena el #CircoSoledad.\n#RecordsArjona #SoldOut\n(WT) https://t.co/CBSFyVfF71 Así nos recibe Orlando. \n#CircoSoledadLaGira\n#recordsArjona\n(WT) https://t.co/gKim2nKmxW Gracias Orlando por la magia y por los aires de Puerto Rico. Una noche para llevarla en la memoria.\n\n#circosoledadlagira\n#RecordsArjona https://t.co/sXTr1ZtbOE RT @AmwayCenter: Bienvenido a Orlando @Ricardo_Arjona! 🎶 #CircoSoledasLaGira https://t.co/TXwnkcHzu0 Miami estuvimos ahí para hacer lo que a ustedes les diera la gana. Mejor no pudo haber sido.\n#CircoSoledadLaGira\n#RecordsArjona\n(WT) https://t.co/N27sIk2i2h 🎪\nMIAMI\n#RecordsArjona\n#CircoSoledasLaGira\n#SoldOut\n(WT) https://t.co/P0UhrSZlzP Simplemente gracias #Miami.\n#RecordsArjona\n#CircoSoledadLaGira\n(WT) https://t.co/thbAWaX89I Asi se vive el #CircoSoledad en #MIAMI.\n#RecordsArjona\n#SoldOut\n(WT) https://t.co/FaAKEjP8BX MIAMI, de nuevo mucho por agradecer. Está noche nos vemos.\n#CircoSoledadLaGira\n#Miami #RecordsArjona \n(WT) https://t.co/dtiNjb11ez Miami, llegó su turno, esta noche conocerán el #CircoSoledad .\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/vJw1SUVNED #MadisonSquareGarden\n#CircoSoledadLaGira\n#SoldOut\n(WT) https://t.co/XM96Q16oif Madison Square Garden \nComo los Sueños que no soño. (WT) https://t.co/maHUMr4exS Madison Square Garden \nComo los Sueños que no soño.  (WT) https://t.co/la8g6sebBf Madison Square Garden \nComo los Sueños que no soñé. https://t.co/aWmmkWLMey RT @TheGarden: An unforgettable night as always with @Ricardo_Arjona at @TheGarden! #CircoSoledad https://t.co/Bs1G67ofat Alguien decidió vestir su auto de Arjona.\n(WT) https://t.co/m9rNLqeF1q Washington, fue un placer. Gracias.\n#CircoSoledadLaGira #RecordsArjona #SoldOut\n(WT) https://t.co/BRfUpQOcDB 🇦🇷NUEVO RECORD!\nArgentina, #CircoSoledadLaGira anuncia su 5ta fecha para BUENOS AIRES.\n.\n#recordsArjona\n#CircoSoledad #SoldOut\n(WT) https://t.co/soX8ZQnSfi RT @Fund_Adentro: #McDíaFeliz es este 11 de octubre. Con la compra de un Big Mac apoyas a @Fund_Adentro ¡Gracias @McGuate y @FirmGuatemala… RT @Fund_Adentro: ¡Hoy es el #McDíaFeliz 2017!  Por cada Big Mac que compres en @McGuate    estarás apoyando a los niños de @Fund_Adentro y… RT @Fund_Adentro: Hoy en #CasaRonaldMcDonald hay un ambiente de fiesta y agradecimiento por esa 🍔  que comprarás este #McDíaFeliz https://t… #CircoSoledadLaGira llegó a Washington. Nos vemos esta noche!\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/NFGJg5oHms RT @Fund_Adentro: Para los padres cuyos hijos están en tratamiento, hospedarse en una casa de @FIRMGuatemala es una bendición, allí está su… RT @Fund_Adentro: Ve a los restaurantes @McGuate a comprar tu Big Mac este 11 de oct y apoya el #McDíaFeliz. @Fund_Adentro recibirá parte d… RT @Fund_Adentro: Este 11 de octubre sin falta apoya el #McDíaFeliz y ve por tu 🍔🍔, @Fund_Adentro es una de las causas beneficiadas.  ¡Grac… RT @Fund_Adentro: Este 11 de octubre, todos a comprar Big Mac. Así apoyarás a las @FIRMGuatemala, #FundaciónAldoCastañeda y @Fund_Adentro.… #PorquePuedo\n2 Millones de gracias.\n#RecordsArjona #Vevo\n(WT) https://t.co/cq1W5pdD9Z Chicago\n08/10\n#CircoSoledadLaGira \n#SoldOut #RecordsArjona\n(WT) https://t.co/E22N8C2Klx RT @Fund_Adentro: Todos a apoyar el #McDíaFeliz de @McGuate el 11 de octubre. Los niños de @Fund_Adentro #AldoCastañeda y @FIRMGuatemala lo… #CircoSoledadLaGira \n(WT) https://t.co/5svsp0AImz RT @Fund_Adentro: Este #McDíaFeliz también apoya la causa de la @funda_dentro, por eso ¡todos a apoyar este 11 de octubre! 🍔🍔 https://t.co/… RT @TheGarden: THREE DAYS! @Ricardo_Arjona is bringing the #CircoSoledad to The Garden! #RicardoArjona https://t.co/FAmqhEeUXW https://t.co… Gracias Chicago.\n#SoldOut \n#CircoSoledadLaGira #RecordsArjona \n(WT) https://t.co/IfVn1GWog4 La gente me está pidiendo canciones que no se cantan hace mucho tiempo. Hay que ensayar.  Chicago, a minutos de encontrarlos. https://t.co/8ZaxxGJMK6 Chicago esta noche. Y el mate tomando pista. https://t.co/XHH2Njuios Nos vemos esta noche CHICAGO!\n#CircoSoledadLaGira\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/RSVX90f7XX #PORQUEPUEDO Video Oficial\nhttps://t.co/6xwdMQGdAi\n(WT) Primera vez de muchas más Reading, Pennsylvania. Gracias.\n#CircoSoledadLaGira\n(WT) https://t.co/sDGLG0rHwA RT @SonyMusicLatin: ¡El nuevo video de @Ricardo_Arjona  ya está aquí! Dale play a #PorquePuedo: https://t.co/NSQfTX5x2F #PorquePuedo\nVideo Oficial, Ya Disponible.\nPorque Puedo estoy aquí...\nhttps://t.co/ujkynKeNOc\n(WT) Al que le gusten las armas que las vea desde el punto de vista del que le apuntan. Todo lo que da miedo. Al final da fuerzas. Porque vivir es el acto de superar los temores recogiendo felicidad incluso del mismo fango #Repost @actornoelg\n・・・\n@BigChato\nAparenta: Hombre Rudo \nRealidad: Hijo de Mamá\n#PorquePuedo\nVideo oficial, 6 de octubre.\n(WT) https://t.co/itYeZaZL88 RT @billboardlatin: .@RicardoArjona to premiere #PorquePuedo video: See Behind-The-Scenes Photos https://t.co/g2tGai4seg #repost @franchezco68\n.\n@ChentePatron69\nAparenta: Hombre de Poder\nRealidad: Mecánico\n#PorquePuedo\n Video oficial, 6 de octubre.\n(WT) https://t.co/tZlwlG6Kj9 #CircoSoledadLaGira continúa por Estados Unidos.\nhttps://t.co/3o1gkSafwC.\n(WT) https://t.co/tn7k3kasuh #Repost @ddrop_\n・・・\nAdmirador secreto de @ sofixoxo /@aliciasanz_ \n#PorquePuedo\nVideo oficial, 6 de octubre.\n(WT) https://t.co/KZb3uhHlGa #Repost @aliciasanz_\n・・・\n@ Sofixoxo\nAparenta: Modelo\nRealidad: Recepcionista de Motel\n#PorquePuedo\nVideo oficial, 6 de octubre.\n(WT) https://t.co/JGaG02rzH9 #CircoSoledad por primera vez en Pensilvania, nos vemos en 3 días Reading.\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/Bl8EtIYI6C #PorquePuedo\nVídeo oficial, este viernes 06 de octubre.\n(WT) https://t.co/68aNFudWQX #PorquePuedo\nVideo oficial, este viernes 06 de octubre.\n(WT) https://t.co/hSGJUp1Fub #PorquePuedo\nVideo Oficial\n6 de Octubre\n(WT) https://t.co/rFmbs6dDs4 #PorquePuedo\nVideo Oficial\n6 de Octubre\n(WT) https://t.co/SFhTdpiDI1 #PorquePuedo\nVídeo oficial muy pronto...\n(WT) https://t.co/z8sayJwPVs Agradecidos Houston.\n#CircoSoledadLaGira\n#SoldOut\n(WT) https://t.co/7pIilSYC69 \"Esta noche nuestro concierto y sus aplausos, si no tienen inconveniente, van dirigidos a México y Puerto Rico\"\n#Mexico #PuertoRico \n(WT) https://t.co/Egk0kjuW1a RT @ToyotaCenter: .@Ricardo_Arjona and @MaestroCares will donate some of the proceeds from Saturday's show to @RedCross to help with #Hurri… HOUSTON, ya estamos aquí.\n#CircoSoledadLaGira \n(WT) https://t.co/Zj8KsZ4O6p San Antonio, gracias.\nMcAllen, ustedes son los siguientes, nos vemos esta noche. \n#CircoSoledadLaGira #RecordsArjona\n(WT) https://t.co/1Xgisx5JmO RT @ToyotaCenter: We're excited to have @Ricardo_Arjona back in Houston tomorrow!\n\nTickets: https://t.co/5NeDQ078uq https://t.co/jtvLGcqyev En tiempo récord se agotan las entradas del Circo guatemalteco, el Circo Soledad. Gracias Guate.\n#CircoSoledadLaGira #RecordsArjona \n(WT) https://t.co/hK1tEhzcIf San Antonio llego el día. Nos vemos esta noche. #CircoSoledadLaGira\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/0GH2Rwi6al Bendiciones Puerto Rico.  El padre de dos hijos tuyos reza por ti.  Que el viento se lleve lo malo y deje intacto tu corazón noble. Mi corazón y solidaridad con ustedes México. Si hay un pueblo que sabe abrazarse en momentos difíciles, es el suyo. https://t.co/vwrWXj6Hlz Porque el Circo lo llevamos por dentro.\n#CircoSoledad\n(WT) https://t.co/c4D1sbQ3tI Te Conozco, Señora, Mujeres. Volvieron al lugar donde fueron grabadas. Dallas gracia por la noche.\n\n5/5 #SOLDOUT\n#circosoledadlagira https://t.co/5DSMkp1Yb3 Dallas, nos vemos esta noche.\n#CircoSoledadLaGira \nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/icl5udA4LE 🇲🇽\nMuy pronto\n#PorquePuedo\n(WT) https://t.co/plr23fZeDS @notiarjona Que sean 22 más. Se les quiere. @laura_lafetagui @ertrivi69 @TwitterEspana @ArjonaSpain @canalfiesta Llegaremos. Nadando, volando o como sea. Las ganas también son de aquí. Las Vegas. Gracias por una noche latinoamericana. Que la independencia que celebramos nos llegue de verdad algún día. Justamente ahora llego el Circo Soledad a Las Vegas.\n4/4 #soldout \n\n#circosoledadlagira \n#circosoledad \n(WT) https://t.co/vdmgwUFZIP PORQUE PUEDO.\nVideo oficial muy pronto.\n#PorquePuedo\n(WT) https://t.co/7wo98m29Qh LAS VEGAS, nos vemos esta noche.\n#CircoSoledadLaGira\nhttps://t.co/3o1gkRSE82\n(WT) https://t.co/y44BGeBxyi De Jocotenango a Las Vegas. Todo es cuestión de actitud.\n(WT) https://t.co/GYQr5bODk3 #TBT 🎪\n#CircoSoledadLaGira en el Forum de Los Ángeles.\n9/8 #SoldOut\n#RecordsArjona\n(WT) https://t.co/O0HWSr9w7I #CircoSoledad hizo vibrar al Forum de Los Ángeles, desde Elvis hasta los Rolling Stones lo convirtieron en el templo del espectáculo.\n(WT) https://t.co/4lo4Iurpsz RT @billboardlatin: This is @Ricardo_Arjona's video evolution! https://t.co/lxAQY6xRSD Ustedes y solamente ustedes nos siguen recordando noche tras noche que \"Realmente no estoy tan solo...\"\n3/3 #SOLDOUT #US\n#CircoSoledad\n(WT) https://t.co/VtsoN7v8k7 RT @MetamorfosisMed: 3 SOLD OUTS, logra @RicardoArjona y el #CircoSoledadLaGira en sus primeras fechas en #USA.\n.\n#RecordsArjona https://t.… #CircoSoledadLaGira\ndesde otro punto de vista...crea el tuyo. #RecordsArjona #USA #TheForum\n(WT) https://t.co/WrnOXOXKHP RT @theforum: A memorable night with @Ricardo_Arjona and a SOLD OUT Forum crowd! #RicardoForum https://t.co/nCjPN5ZduO #CircosSoledadLaGira en Los Ángeles.\n09/09\n#SoldOut #USA #RecordsArjona \n(WT) https://t.co/VmEnNRWknB 👏 https://t.co/ZAryyavFn1 Una de esas noches que no se olvidan nunca.\n#SOLDOUT\n#CircoSoledad #circosoledadlagira (WT) https://t.co/d7mL7m2ZRD Los Ángeles bienvenidos.\n#soldout \n#CircoSoledad #circosoledadlagira \n(WT) https://t.co/L9QcNUQmB6 Mientras alguien me copia el peinado antes de salir al emblemático FORUM de Los Ángeles. Nuestro corazón está en el Caribe y la Florida. https://t.co/jO9kotv45J Un vistazo dentro de la carpa del Circo Soledad.\n#CircoSoledadLaGira\n#RecordsArjona\n(WT) https://t.co/zDTVOmQYqP El Circo Soledad llega con pura electricidad.\n#USA\n#CircoSoledadLaGira\n#RecordsArjona\n(WT) https://t.co/vkYTnUYMZC Tiempos difíciles. La tierra enfurecida. Fuerza y solidaridad. El Circo Soledad llegó a Estados Unidos para quedarse.\n#Sold Out - El Paso\n#CircoSoledadLaGira\n#RecordsArjona\n(WT) https://t.co/qyXCJsE5Q6 RT @INFOMUNDOARJONA: Mundo Arjona y la Fundación Adentro se unen y te dejan vivir de cerca el Circo Soledad. Fotos, mercancía oficial y pre… 🎼\n#PorquePuedo\n#CircoSoledad\n(WT) https://t.co/zAjG6QzP14 RT @MetamorfosisMed: Buenos Aires ya está disponible la venta de boletos para el 4to show de #CircoSoledadLaGira de @Ricardo_Arjona .\nhttps… RT @BillboardArg: Tras agotar sus tres primeros shows, @Ricardo_Arjona agrega una cuarta fecha para el 26/11 en el DirecTV Arena.\nhttps://t… Hoy comienza la gira por Estados Unidos.\nEl Paso, ustedes son los primeros de la lista. Nos vemos esta noche.\n#CircoSoledadLaGira\n(WT) https://t.co/jRyeXknyFD BUENOS AIRES, debido al éxito agregamos 4ta FECHA.\n#CircoSoledadLaGira\n(WT) https://t.co/Ik7ssJv8FI Acompáñame .... comenzamos en El Paso,Tx la gira por Estados Unidos 🇺🇸\n#CircoSoledadLaGira\n(WT) https://t.co/5xQYzqx6pG RT @MilenioLaguna: @Ricardo_Arjona llenó el Coliseo Centenario con 'Circo Soledad' 🎧\nhttps://t.co/zm7ZvpSLWE https://t.co/h3Sfk8Z6nX Anoche retumbó el Coliseo Centenario de Torreón al mejor estilo de Circo Soledad. Gracias.\n#CircoSoledadLaGira\n(WT) https://t.co/vw5QwpEYXX Gracias Torreón, por la alegría. Volveremos Llegamos Torreon.  (WT) https://t.co/3MAnutaoHJ 🎪\nComo olvidarme de usted señora.\nMonterrey 01/09\n#CircoSoledadLaGira \n#laseñoradecircosoledad \n(WT) https://t.co/1Dwy8dspXh \"Fuiste Tú\" Monterrey, gracias.\n2/2 Sold Out\n#CircoSoledadLaGira\n(WT) https://t.co/P3OPuVxWXS Guitarra y voz. https://t.co/jyVdB9VE5i GUATEMALA, ya está disponible la Venta General de boletos.\n#CircoSoledadLaGira\nhttps://t.co/V6vv9iF4qj\n(WT) https://t.co/90Zwtrweji 🎪🎥\nDetrás de escenas del vídeo #RemiendoAlCorazon\nVer Aquí : https://t.co/WpUHDDx7Uw\n#CircoSoledad #segundosencillo #makingof \n(WT) https://t.co/4JmKGjziua 🎪\nMonterrey, hoy nos volvemos a ver.\n#CircoSoledadLaGira\n#ArjonaRecords #ArenaMonterrey\n(WT) https://t.co/gN75LNjfUi Monterrey, sin palabras.\n1/2\n#CircoSoledadLaGira\n#ArenaMonterrey\n#arjonaRecords\n(WT) https://t.co/qFQCB3UYsN Regios ..... por Dios.  Como pa quedarme a vivir. Gracias por la emoción. Prueba de sonido, nos vemos en muy poco Monterrey.\n#CircoSoledadLaGira \n(WT) https://t.co/6iakMTx0yg ESTADOS UNIDOS\nFechas confirmadas #CircoSoledadLaGira\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/Bno0uw44S0 Monterrey ya estamos aquí.\n (WT) https://t.co/mxZ02aVQ8V #PorquePuedo\n#CircoSoledad\n#FrasesArjona #62\n(WT) https://t.co/DE2y7KHTN2 ¿Puedes adivinar que canción estaba sonando al momento de tomar esta foto?\n#CircoSoledadLaGira\n(WT) https://t.co/8MdEs3QL6f GUADALAJARA\n26/08/17\n@CircoSoledadLaGira\n#CircoSoledadLaGira\n(WT) https://t.co/2jB51cxDBZ Momentos inolvidables.\n2da función en Guadalajara.\n.\n#LaSeñoraDeCircoSoledad\n#CircoSoledadLaGira\n(WT) https://t.co/e0ys5sxMfC 🎟\nGuadalajara , estamos a muy poco de volvernos a encontrar. \n#CircoSoledadLaGira \n(WT) https://t.co/fbAav7QQ38 🎪\nAsí fue la 1ra función en Guadalajara. Falta poco para volvernos a ver. \n#CircoSoledadLaGira\n.\n@circosoledadlagira\n(WT) https://t.co/d4vYzH5CsP RT @Fund_Adentro: ¡No necesitamos tener los mismos poderes que Batman o Spider-Man para cambiar el mundo! https://t.co/6Od34ZEkxm 🎪🎟\nAsí se ve la taquilla del #AuditorioTelMex en Guadalajara para la segunda función de #CircoSoledadLaGira . Nos vemos esta noche.\n(WT) https://t.co/4zXMP0mSfW RT @MetamorfosisMed: @Ricardo_Arjona está entre los artistas más influyentes de Facebook Live https://t.co/5v4qQJto0D RT @SonyMusicLatin: .@Ricardo_Arjona te cuenta todo sobre su nuevo trabajo en #ASolasConElCircoSoledad #CircoSoledad ¡Disfruta! \nhttps://t.… 🇲🇽🎪\nGuadalajara, agradecido por tanto.\nMañana nos volvemos a ver.\n#CircoSoledadLaGira\n(WT) https://t.co/TWgKG5tekw RT @PepsiGuate: ¿Estás listo para disfrutar la primicia de la gira más esperada del año? \n#CircoSoledadLaGira de @Ricardo_Arjona en Guatema… 🎪\nGuadalajara, 1ra función.\n24/09/17\n@CircoSoledadLaGira\n(WT) https://t.co/3JTpBhqbKs Guadalajara una noche para repetir. Nos vemos mañana.\n#CircoSoledadLaGira\n(WT) https://t.co/xKO1xhgHip HISTÓRICO!\nA 3 meses de nuestra llegada a CHILE se agota la cuarta función.\n20,21,22 y 23 de Noviembre.\nNUEVA FECHA: 19 de Noviembre!\n(WT) https://t.co/sVg0fbytaG 🇲🇽\nGracias León.\n#CircoSoledadLaGira\n(WT) https://t.co/fHs9kIRoZB Alguien está a punto de salir a cantar.\n(WT) https://t.co/YK2LifNPnr Bahía Blanca - Argentina\nFecha confirmada: 03 de Noviembre\nPreventa Disponible 24 de agosto\n#CircoSoledadLaGira\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/9YOUAfBhqs LEÓN\nSolo 1 día más.\n#CircoSoledadLaGira\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/UqzyvAGRGL 🎪🇲🇽📆\nLeón y Guadalajara, empezó la cuenta regresiva #CircoSoledadLaGira.\n(WT) https://t.co/5Os5SLCWoL #Repost . . . @ricardo_campello .\nPlaya con los maestros @ricardoarjona @gollitoestredo @campelloeyewear #arjona #ricardoarjona https://t.co/TBJ0uvLXw0 \"El Cielo A Mi Favor\"\nEl 8vo capítulo del especial #ASolasConElCircoSoledad\nYa está disponible.\nhttps://t.co/vvrH9lIgZZ\n(WT) https://t.co/mfAZP3rNnr PUERTO RICO, NUEVA FECHA.\n20 y 21 de Octubre\nVenta general de boletos disponible mañana, 18 de agosto.\nhttps://t.co/3o1gkRSE82\n(WT) https://t.co/4xxVWsgthV \"EL CIELO A MI FAVOR\"\nEstreno, mañana 18 de Agosto.\n#ASolasConElCircoSoledad\nhttps://t.co/WbKarV516U\n(WT) https://t.co/2MhoKUYijc https://t.co/XFmuJICC8H 🇵🇷\nEn la Rueda de Prensa también  se anunció que habrá una segunda fecha para #CircoSoledadLaGira en Puerto Rico.\n(WT) https://t.co/CmTG95oE2Y RT @peopleenespanol: Esto fue lo que inspiró el último disco de Ricardo Arjona. https://t.co/02xb6ynOlW Sorprendiendo a los invitados entre relatos y canciones, terminamos todos más que satisfechos.Una noche difícil de olvidar\n#CircoSoledad \nWT https://t.co/wYgQvkascu El Circo Soledad llega a Estados Unidos. Conferencia de Prensa  en Puerto Rico.  (ver vídeo &gt;https://t.co/1pCIRKYEGG )\n(WT) https://t.co/Uosur2Vkq9 RT @SonyMusicArg: 🎉 ¡@Ricardo_Arjona agregó una nueva función a su gira #CircoSoledad! 🎉\n😍 25/11 en @DIRECTVARENAOK 😍\nEntradas 👉 https://t.… RT @DLasAmericas: #Música @Ricardo_Arjona admite ser él sin aparentar ni \"ser víctima de la moda\" https://t.co/8zF5USXfHj https://t.co/iqOM… RT @notiarjona: La historia detrás del abrazo.        \"NO ME DEJES CUMPLIR 80 SIN UN ABRAZO\" decía el cartel de doña Ada ,suegra de @ripoll… RT @MetamorfosisMed: https://t.co/iQLwgpUw2i El circo soledad viajará por 20 ciudades de USA.  (WT) https://t.co/yA3uIHFdmH Más de 20 ciudades de USA se visitarán a partir de septiembre.  El banderazo de salida Puerto Rico   En una noche de bohemia con la prensa https://t.co/USzacAt3DE Una noche llena de improvisación, preguntas y melodías.\nConferencia de prensa en la Isla del Encanto(WT)\n#circosoledadlagira #recordsarjona https://t.co/E2uUxg1oFX Todas las noches tienen un sol esperando al otro lado. Ya está Disponible\n\"Hasta Que La Muerte Los Separe\"\n#ASolasConElCircoSoledad\n(WT)\nhttps://t.co/Ai91Bw4i0E 🎪\n\"Hasta Que La Muerte Los Separe\"\nEstreno mañana , 11 de agosto.\n#ASolasConElCircoSoledad\n(WT) https://t.co/OEnbOxSGsu RT @INFOMUNDOARJONA: En Tiempo Récord se acaban las membresias de MundoArjona.\nNueva función- 25 de noviembre \n#RecordsArjona #MundoArjona… El Circo Soledad se queda una noche más en Buenos Aires.\nEn tiempo récord se agotan las primeras dos funciones.\n#CircoSoledadLaGira \n(WT) https://t.co/6fRLOoB9Dq Otra anécdota detrás del #CircoSoledadLaGira \nhttps://t.co/8treAHdqA4\n(WT) RT @notiarjona: #VotoDoble  @vale975   #Ella #RemiendoAlCorazon @Ricardo_Arjona #RankingVale #YoEscuchoVale975 https://t.co/P0wTRCcNcY \"VIVIR\" el 6to capítulo del especial #ASolasConElCircoSoledad\nYa está disponible.\nVer aquí: https://t.co/6PTSY27UY4\n(WT) \"VIVIR\"\nEstreno, mañana 4 de agosto.\n#ASolasConElCircoSoledad\n(WT) https://t.co/6tOdVDR1YU #TBT\nYa son 3 años desde la publicación del vídeo oficial \"Lo Poco Que Tengo\", el segundo sencillo del álbum \"VIAJE\".\n(WT) https://t.co/Jm4pzemqZQ RT @MetamorfosisMed: Sigue la gira #CircoSoledad paso a paso a través del App Oficial.\nAndroid : https://t.co/db4fHtDxqv | Apple : https://… \"Remiendo Al Corazón\"\nYa Disponible el 5to capítulo de\n#ASolasConElCircoSoledad\nhttps://t.co/JcpmXyqNn2\n.\n(WT) https://t.co/euEB42yKp7 🇪🇨\nIncreíble noche Guayaquil.\n•sold out•\n#CircoSoledadLaGira\n(WT) https://t.co/gFkHjE420S GUAYAQUIL 🇪🇨\nMás de 25,000 espectadores.\nSOLD OUT.\n#CircoSoledadLaGira\n(WT) https://t.co/ZHVJcc65NC 25 mil corazones contradiciendo a la moda. Gracias Guayaquill por la complicidad de siempre  (WT) https://t.co/v4aqMaTSfI El circo soledad encuentra compañía en Guayaquil.  Ya estamos aquí. (WT) https://t.co/EVZmQ9FLv3 \"REMIENDO AL CORAZÓN\"\nEl 5to capítulo del especial #ASolasConElCircoSoledad y segundo sencillo,Ya está disponible\nhttps://t.co/8rfM6ymnd6\nWT 🎪\n@CircoSoledadLaGira \nCuenta Oficial en instagram.\n#CircoSoledadLaGira\n(WT) https://t.co/aSzlYIRr4B 🇪🇨\nQuito, explotando en libertad.\n#CircoSoledadLaGira\n(WT) https://t.co/lUicpYgdr9 Un taxi mexicano en Quito Ecuador? Nos persiguió por todos lados. Al final en plena calle,  no quedo más que un abrazo y la foto.  (WT) https://t.co/DUpw5seKZY \"REMIENDO AL CORAZÓN\"\n#ASolasConElCircoSoledad\n(WT) https://t.co/jjY4pJ2lzk \"Remiendo al Corazón\"\nEstreno, viernes 28 de julio.\n#ASolasConElCircoSoledad https://t.co/JcpmXyqNn2\n.\n(WT) https://t.co/pIPp3Xmwwx QUITO, llegamos. https://t.co/eTBBlCnqWq 🇪🇨\n#CircoSoledadLaGira apenas está comenzando. Más que excelente noche Cuenca. Quito nos vemos este jueves.\n(WT) https://t.co/IenhwicNUX Un puñito chapin en Cuenca con #Panchorizo.\n#CircoSoledad \n(WT) https://t.co/5lOFQtzTmQ Ya está disponible \"PORQUE PUEDO\" el 4to capítulo del especial #ASolasConElCircoSoledad\n\nhttps://t.co/IhmUcYOhV2 \n(WT) @adriaarjonaa Solo dije la verdad. En buena compañia, cualquier rumbo es bueno. https://t.co/m602HH4lbu ARGENTINA nos vemos en noviembre #CircoSoledadLaGira  \nhttps://t.co/yCwz8nz7FA \n(WT) https://t.co/enIKhOdIKt RT @INFOMUNDOARJONA: Concurso del Camerino en Bogotá 🇨🇴🎪, otro sueño cumplido para estas venezolanas 🇻🇪...\n#mundoarjona #miembrosfelices #c… \"Señorita\" el 3er capítulo de #ASolasConElCircoSoledad\nhttps://t.co/5W214w6GWS\n(WT) 🎪\nFechas de #CircoSoledadLaGira\n.\nhttps://t.co/3o1gkSafwC\n.\n#CircoSoledad\n(WT) https://t.co/i3axhNu4JE Gracias Cali 🇨🇴\n#CircoSoledadLaGira\n(WT) https://t.co/T9RlC3k6vD RT @Ricardo_Arjona: Ya está disponible \"SEÑORITA\" el 3er capítulo del especial #ASolasConElCircoSoledad\nhttps://t.co/vdxHhazci9 \n(WT) Todo un éxito Pereira.\nCali, nos vemos esta noche.\n#CircoSoledadLaGira \n(WT) https://t.co/uls7CjJr2L 🎪\nPereira ha sido un placer. \n#CircoSoledadlagira\n(WT) https://t.co/LwOQVteqEY Ya estamos aquí Pereira https://t.co/SyI5Nm6WrF Philadelphia, fecha confirmada!\n6 de Octubre #CircoSoledadLaGira\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/AJMny9zsBv Ya está disponible \"SEÑORITA\" el 3er capítulo del especial #ASolasConElCircoSoledad\nhttps://t.co/vdxHhazci9 \n(WT) Increíble noche Medellín.\n\n#CircoSoledadLaGira\n(WT) https://t.co/gTlts5zoTY Entre la energía, la emoción, la buena vibra y los aguardienticos estoy que no termino de aterrizar.  Gracias Medellín. Una noche como pocas Medellín 🇨🇴llegamos.\n#CircoSoledad \n#circosoledadlagira\n(WT) https://t.co/mWm9uxLJNP \"Señorita\", 3er Capítulo del especial #ASolasConElCirsoSoledad\nEstreno mañana, 14 de julio.\nhttps://t.co/rzjvjHuELL…\n#Vevo\n(WT) https://t.co/lDGcz1inp6 México, nuevas fechas:\nLEÓN\nPre Venta MA:13 JUL\nVenta:14 JUL\n\nTORREÓN\nPre Venta MA:15,16 JUL\nVenta:17 JUL\nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/inVx0Vn8zz ¿MEDELLÍN, están listos? \n#CircoSoledadLaGira \nhttps://t.co/3o1gkSafwC\n(WT) https://t.co/8pWBuYCRjl \"Señorita\" 3er capítulo #ASolasConElCircoSoledad\nEstreno viernes, 14 de julio.\nhttps://t.co/JcpmXyqNn2\n(WT) https://t.co/FWu1RfpIVi RT @BillboardArg: 🎤@Ricardo_Arjona hizo una presentación sorpresa en Argentina: https://t.co/fNRAqKi9Yq Presentación del especial #ASolasConElCircoSoledad , una noche llena de sorpresas en Argentina.\nhttps://t.co/IwSlsJEgtT\n\n(WT) https://t.co/DiR8izWppN Se desbloqueó 3er video del detrás de cámaras #ASolasConElCircoSoledad sigan escuchando para desbloquearlos todos\nhttps://t.co/jzMLHteoHc\nWT https://t.co/TEU4JXNGnj RT @lacapital: 🎤 🎪 #VIDEO @Ricardo_Arjona presento su nuevo disco y recordó de manera especial su último concierto en #Rosario\n➡️ https://t… RT @Vale975: Así se vivió la Avant Premiere #ASolasConElCircoSoledad con @Ricardo_Arjona sorprendiendo a sus fans en vivo! 💫#YoEscuchoVale9… Volver a Buenos Aires, incluso por unas horas,  es volver a los amigos y la complicidad. Se les quiere A Solas con el Circo Soledad, que mejor que contarlo personalmente.\n#ASolasConElCircoSoledad\n(WT) https://t.co/UCqouxaiTY Vienen?\n#ASolasConElCircoSoledad https://t.co/bLyGJWapQy #ASolasConElCircoSoledad https://t.co/frLa72680N \"El Que Olvida\" - 2do Capítulo #ASolasConElCircoSoledad\nhttps://t.co/snHOOBEwdE\n(Ver link)\n\n(WT) https://t.co/A0NiSx0RPH #CircoSoledad no tiene nada de lo que está de moda, pero todo lo que tiene está bien hecho...\n#CircoSoledadLaGira\n(WT) https://t.co/9S7qtxWZHU Bogotá. Gracia por la noche. Me la llevo conmigo. https://t.co/VR93xSB26e Bogotá 7/7/17\n\"Con Pura Electricidad\"\nSumamente Agradecidos.\n\n#CircoSoledadLaGira\n#CircoSoledad\n(WT) https://t.co/FDKibGdEOR Gracias al Club de Fans de Colombia \"RAC\" por esta maravilla de regalo 🇨🇴🎪.\n#CircoSoledadLaGira\n#CircoSoledad\n(WT) https://t.co/LwmZe7uOGk 🇨🇴🎯\nA tan solo horas Bogotá. \n#CircoSoledad\n(WT) https://t.co/cHze2LWlTC Ya está disponible el 2do capítulo de #ASolasConElCircoSoledad , \"El Que Olvida\" .\nhttps://t.co/pJ68GitSt5\n(WT) 🇨🇴\n#CircoSoledadLaGira ya está en Bogotá.\n\n#CircoSoledad\n(WT) https://t.co/Nh4PPnEtBj Llegamos Colombia. Como en casa. #ASolasConElCircoSoledad\nEstreno 2do capítulo, 7 de Julio. \nhttps://t.co/zqEmKw7GwK\n(WT) \"A Solas Con El Circo Soledad\" - En Exclusiva\n\"El Que Olvida\"- Capítulo 2\nEstreno 7 de julio.\n\n#ASolasConElCircoSoledad\n(WT) https://t.co/hwHs5K8Hf0 El cielo a mi favor se equivoco.   En tiempos de ruido.  Mi canción. 🎪\nFECHAS\nCirco Soledad La Gira\nhttps://t.co/3o1gkSafwC\n\n#CircoSoledadLaGira\n(WT) https://t.co/8fAUz5UlvF GUADALAJARA\nDebido al éxito anunciamos nueva fecha.\n24 y 26 de agosto.\nVenta general de boletos: 6 de julio.\n#CircoSoledad\n(WT) https://t.co/HntddY0T3F CIUDAD DE MÉXICO\nDebido al éxito, anunciamos nueva fecha:\n28 de septiembre.\n\n#CircoSoledad\n(WT) https://t.co/b4y34j3nYz RT @billboardlatin: .@Ricardo_Arjona launches 'A Solas con el Circo Soledad' docu-series on #YouTube\n https://t.co/VLo42vJFZs https://t.co/… 🇦🇷🎪\nARGENTINA, seguimos sumando fechas.\n#CircoSoledad \n(WT) https://t.co/Xtjxw8kKSl Alguien se nos escapó de nuevo.  Será vuelo New Orleans Bogotá.  (WT) https://t.co/lYq0hacR1i \"A Solas Con El Circo Soledad” ha llegado.\n1er Episodio- “ELLA”\nYa Disponible!\nhttps://t.co/dnNKvNxG9C\n1/8\n#ASolasConElCircoSoledad #VEVO\nWT https://t.co/TtzNfmBsvu El Circo Soledad llega a la Isla del Encanto.\n#PuertoRico\n#CircoSoledadLaGira\n\nEntradas en https://t.co/ssKAH3uMne\n\n(WT) https://t.co/SJGTb1YrJX Anunciamos oficialmente la llegada de Circo Soledad la Gira a Buenos Aires.  #DirectvArena #circosoledad  (WT) https://t.co/vi6WsLWkF8 RT @ClaroMusicaCO: Estaremos a solas con @Ricardo_Arjona y su circo soledad ¡HOY! A las 8:30 pm en exclusiva por #ClaroMúsicaLadoA 📺 Canal… RT @Fund_Adentro: Gracias a #VizualizaClínicaDeOjos elegimos con alegría e ilusión los colores y formas de nuestros lentes #ENMA https://t.… Se suma URUGUAY a la lista de destinos de la gira #CircoSoledad.\n1 de noviembre, Estadio Centenario.\n(WT) https://t.co/nW3lzybM9N PUERTO RICO\n20 de octubre, confirmado.\n-PreVenta Mundo Arjona 29 de Junio\n-Venta General de Boletos 30 de Junio\n#CircoSoledad\n(WT) https://t.co/Y4GXtYmbzN Y todo lo que es bueno volverá...\n#CircoSoledad\n(WT) https://t.co/e19bh90112 Escucha Circo Soledad y desbloquea el detrás de cámaras del especial #ASolasConElCircoSoledad \nhttps://t.co/jzMLHteoHc\n(WT) https://t.co/MF7QZUYttp RT @FMDOS: ¡Éxito total! @Ricardo_Arjona confirma que tendrá cuarto concierto en Chile https://t.co/yxArwAKI52 https://t.co/5mJ4xXKQYv RT @lacapital: 🔴🎤🙌 #Escenario El furor por el show de Ricardo Arjona ya está instalado en #Rosario\n➡️ https://t.co/P9p6WbHLpE https://t.co/… CHILE!, debido al éxito agregamos nueva fecha.\nVenta general de boletos : sábado 24 de Junio.\n#CircoSoledad \n(WT) https://t.co/D9ynvHCwLd \"A Solas Con El Circo Soledad\" - En Exclusiva\nEstreno, 30 de Junio.\n#ASolasConElCircoSoledad\n(WT) https://t.co/p9Fq9ghPQw Veracruz\nNos reencontramos después de 6 años sin vernos.\n#SoldOut \n#CircoSoledad\n(WT) https://t.co/PByAxI5ANm Muy pronto \n#ASolasConElCircoSoledad\n(WT) https://t.co/1KRqcjBIE6 Muy pronto \n#ASolasConElCircoSoledad\n(WT) https://t.co/XiaEQJbTo3 Muy pronto...\n#ASolasConElCircoSoledad\n(WT) https://t.co/ZgBLb9XZUi Argentina. Estamos en camino. En noviembre nos vemos en el CIRCO SOLEDAD. https://t.co/bGqhPCdHQh Verlos bailar, fue mi regalo. https://t.co/QnLq8HxO8A Las barras y las estrellas se adueñan de mi bandera...\n#CircoSoledad\n(WT) https://t.co/p585LWRqTz Así se vive #CircoSoledadLaGira\n#CircoSoledad\n(WT) https://t.co/V9SBjoWhHW RT @Fund_Adentro: ¡Feliz #DíaDelPadre! En especial a nuestro fundador .@Ricardo_Arjona desde la #ENMA va un saludo en este día especial. 😍🤗… Cancún el #CircoSoledad llegó.\n#CircoSoledadLaGira\n(WT) https://t.co/apWjjOb677 Gracias por participar , \"Remiendo Al Corazón\" es elegido por ustedes como el  Segundo Sencillo del disco #CircoSoledad.\n.\n(WT) https://t.co/czxnc1kbV7 Cancún. Como pa quedarse. Ya estamos aquí. https://t.co/BUgYWyevfX Alguien me regaló esto. No sabemos quién fue. Nos ayudan a encontrarlo.  Se ha convertido en un símbolo de CIRCO SOLEDAD https://t.co/wfsKA2T64J Este Viernes se define el Segundo Sencillo de #CircoSoledad.\n¿Ya votaste?\nhttps://t.co/jzMLHteoHc\n(WT) https://t.co/A2pNdYSDaR 8 MILLONES de gracias.\n(WT) https://t.co/MTGrhpU8Ss &gt;&gt;RONDA FINAL&lt;&lt;\nNo pudimos elegir solo dos.\nVota por tu favorita en el Link de la Bio o en el App Oficial y Comparte.\n#CircoSoledad\n(WT) https://t.co/Io6BmMdws9 RT @Ricardo_Arjona: El Segundo Sencillo de #CircoSoledad lo eliges tú.\nVota por tu canción favorita aquí.\n(WT) Mis amigos de Bahamas. Para ellos soy el SECO y creen que soy pintor https://t.co/EO2PCHvQEY GUADALAJARA, Circo Soledad llegará el 24 de Agosto.\n-Preventa Mundo Arjona: 12 y 13 de Junio\n-Venta General de Boletos: 14 de Junio\n\n(WT) https://t.co/31aFZ7mjOM CUENCA, Ecuador\nYa está disponible la Venta General de Boletos:\nhttps://t.co/yI9hLB3fRv\n\n#CircoSoledad\n(WT) Por fin alguien ya la menciono. @jonyremolina Varias Es la era de los sencillos Una tristezaTengo una preferida si, pero debo decir que para mí el sencillo es sentarte a vivir el viaje completo @ohskyisfalling Dime. Puedo votar yo? Saben cuál escogería? Y si les digo que no está en las cuatro? RT @tvtelehit: #CarteleraTelehit #CircoSoledad y @Ricardo_Arjona con paso fuerte en Latinoamerica y con nueva fecha en la cuidad de México… ECUADOR \nVenta General a partir del miércoles 7 de junio a las 10 am.\n#CircoSoledad\n(WT) https://t.co/kMZ9uwoKf6 El Segundo Sencillo de #CircoSoledad lo eliges tú.\nVota por tu canción favorita aquí.\n(WT) \"SEÑORITA\"\nEntra en el Link y VOTA por tu favorita!\nhttps://t.co/qyiw65ZNSx \n\n#CircoSoledad\n(WT) https://t.co/1czaBDwtl1 \"REMIENDO AL CORAZÓN\"\nEntra en el Link y VOTA por tu favorita!\nhttps://t.co/qyiw65ZNSx \n\n#CircoSoledad\n(WT) https://t.co/yNHa2IblR2 \"PORQUE PUEDO\"\nEntra en el Link y VOTA por tu favorita!\nhttps://t.co/qyiw65ZNSx \n\n#CircoSoledad\n(WT) https://t.co/CRop2x914F \"EL QUE OLVIDA\"\nEntra en el Link y VOTA por tu favorita!\nhttps://t.co/qyiw65ZNSx\n\n#CircoSoledad\n(WT) https://t.co/iYEbKTAxpj El Segundo Sencillo del Disco CIRCO SOLEDAD lo eligen ustedes.\nEntra y Vota .\nhttps://t.co/qyiw65ZNSx\n#CircoSoledad\n(WT) https://t.co/GsKvQSPyB4 Ciudad de México\n27 de Septiembre\nhttps://t.co/8BOUCrFFPd\n#CircoSoledad\n(WT) https://t.co/c9qKdW3mQK Nico dice que esto es el DAP.  Tambien dice que lo hacemos muy mal. https://t.co/QreZFZAHvp MONTERREY, ya no es uno, sino DOS los Shows confirmados de CIRCO SOLEDAD.\nNUEVA FECHA: 1 de Septiembre\n#CircoSoledad\n(WT) https://t.co/UPT4uYiIQK RT @El_Universal_Mx: .@Ricardo_Arjona vuelve con su espectáculo “Circo Soledad la gira”, el 27 de septiembre en la Arena Ciudad de México h… ECUADOR, \nNos vemos en JULIO\n#CircoSoledad\n(WT) https://t.co/TQqqOVFBIJ @notiarjona Fragmento del especial A SOLAS CON EL CIRCO SOLEDAD.  BORRACHERA?  Jajajaj. Tendremos que hacerlo de nuevo???? !!!!!!POR DIOS!!!!!!!!! CIUDAD DE MÉXICO,\nFecha Confirmada,27 de Septiembre.\nPreventa Mundo Arjona : 29 de Mayo\nVenta General : 31 de Mayo\n#CircoSoledad\n(WT) https://t.co/9LPPrQx0Uu CIRCO SOLEDAD .Cuando la soledad se comparte. (WT) https://t.co/PnNikTWyLQ @Eliramaa Eliana. Traducción   Quiere decir que tienes ganas de ir? Cuando la convulsión es muy grande, esto corrige . Jajaja Argentina Noviembre. Madurara el circo y estaremos allá cuando está gira este entrando a la adolescencia con toda su convulsión  y ganas @ArjonaSpain @MetamorfosisMed España.  Mi asignatura pendiente. Llevaremos el circo , cruzaremos el Atlántico , y nos encontraremos. Es una promesa. @leovanvanegas Yo la invito campeón, faltaba más, y a vos también solo si se te antoja. #CircoSoledadLaGira\n(WT) https://t.co/Adli3vhGZt #CircoSoledad \n#FrasesArjona #60\n(WT) https://t.co/mot9K6etmq MÉXICO, El Circo Soledad Vuelve.\nCANCÚN,17 de Junio\nNueva Función - VERACRUZ, 22 de Junio\nhttps://t.co/3o1gkSafwC\n#CircoSoledad\n(WT) https://t.co/mLQzssOZPH Esta semana CIRCO SOLEDAD cumple un mes en sus manos...\n¿Ya lo viviste?\nwww.ricardoarjona.con\n(WT) https://t.co/rLGlqurZLD RT @FMDOS: ¡Lo hizo otra vez! @Ricardo_Arjona suma tercer concierto en Chile y lo celebramos escuchándolo por partida doble 👏👏 https://t.co… GRACIAS CHILE. Record Histórico, se agotaron en menos de 30 días las entradas del 22 y 23 de Noviembre. NUEVA FUNCIÓN 21 de Noviembre.(WT) https://t.co/IXAGn2j2MJ COLOMBIA, \nhttps://t.co/uuNaUyLET9\n(WT) https://t.co/d6LTrU51rI Gracias 🇲🇽\n6 Fechas/ 6 Sold Out \nAsí comenzó #CircoSoledadLaGira\n(WT) https://t.co/Xsa0ZO8vW2 Te quiero....\n#Merida\n#CircoSoledad\n(WT) https://t.co/uBODAkjnOb MÉRIDA \nSiempre haces nuestra llegada especial.\n#CircoSoledad\n(WT) https://t.co/zdCntJjmWe CANCÚN, Se mueve la función al 17 de Junio y se amplía el aforo. \nAhora seremos más de 10 mil espectadores disfrutando del Circo Soledad.\nWT https://t.co/hzD86ERx04 Mérida, está noche ustedes serán los testigos de este Circo Soledad.\n#CircoSoledad\n(WT) https://t.co/R4C3mjMF6D TUXTLA\n12/05/17\nSOLD OUT\n#CircoSoledad\n(WT) https://t.co/knWaktooIp TUXTLA! Ya está todo listo.\nMérida y Cancún atentos, falta muy poco.\n\nMérida - 15 de Mayo\nCancún - 20 de Mayo \n#CircoSoledad\n(WT) https://t.co/2RYLY5s4Ul Colombia, Circo Soledad llega en Julio.\n#CircoSoledad\n(WT) https://t.co/Uql8h8aL3V Para Silvia, para las señoras de las 4 décadas y para las mamás , Feliz Día.\n#CircoSoledad\n(WT) https://t.co/ZEvwqWl7VG Estados Unidos, Circo Soledad llegará muy pronto.\n#CircoSoledad\n(WT) https://t.co/etweb3jl9W Puebla 👏\nSOLD OUT.\nAgradecidos.\n#CircoSoledad\n(WT) https://t.co/DNlbxlEoHZ Puebla, yo soy el culpable de tanto tiempo sin vernos... pero también tengo el remedio.\n#CircoSoledad\n(WT) https://t.co/itfTiJYtuP Puebla, nos vemos esta noche. \nhttps://t.co/rsjOkitRTE\n#CircoSoledad\n(WT) https://t.co/GbsX5uuzDC RT @INFOMUNDOARJONA: Monterrey ya está disponible la Preventa Exclusiva para miembros! #MundoArjona #CircoSoledad #ViveLaExperiencia https:… MONTERREY, confirmado Jueves 31 de Agosto.\n#CircoSoledad\n(WT) https://t.co/JhbEAvtRFf San Luis Potosí 🇲🇽 \nAgradecido por una noche como la de ayer.\n#CircoSoledad\n(WT) https://t.co/5RJF8WyYAZ Falta muy poco San Luis Potosí.\nhttps://t.co/jzMLHteoHc\n#CircoSoledad\n(WT) https://t.co/LNYBLzs0KX Otro SOLD OUT, QUERÉTARO.\n#CircoSoledad\n(WT) https://t.co/HOEYJOc93S Sin Daños A Terceros \n#CircoSoledad \n40/50\n(WT) https://t.co/CGAyAFxLDf RT @leilacobo: .@Ricardo_Arjona nuevamente es No. 1 en Billboard. Trabajo independiente con resultados de primera https://t.co/2TmzzF5c7u Querétaro.  Un jugo de piña no se le niega a nadie. Ya estamos aquí. (WT) https://t.co/V9WzcCSkTr RT @billboard: .@Ricardo_Arjona's \"Circo Soledad\" debuts at No. 1 on Latin Pop Albums chart https://t.co/0naqWbe8bp https://t.co/NT6GNfd2jx Querétaro y San Luis Potosí son los próximos.\nBusca tus entradas en https://t.co/uuNaUyu41B \n#CircoSoledad \n (WT) https://t.co/sFDfbMv3Wo https://t.co/xy1f421dgi Toluca. Gracias por despertar al duende y darnos una vez más la bendición para este nuevo viaje. CIRCO SOLEDAD Dos SOLD OUT en una noche. Gracias Toluca, siempre un placer comenzar con ustedes.\n#CircoSoledad\n(WT) https://t.co/OAbdwxcFkQ Minutos después. SOLD OUT , Primera Función Toluca.\n#CircoSoledad\n(WT) https://t.co/ydYVLRgFQs Minutos antes del comienzo de este Circo Soledad.\n#CircoSoledad\n(WT) https://t.co/2urnqgQGVz \"Remiendo Al Corazón\"\n #CircoSoledad \n#FrasesArjona #59\n(WT) https://t.co/75Q9IHKY9d El Circo sobrevive con piruetas.\n36/50\n#CircoSoledad\n(WT) https://t.co/uqny5VMwPK El Show está por comenzar.\n#CircoSoledadLaGira\n#CircoSoledad\n(WT) https://t.co/ucH0VfnRSO MÉXICO 🇲🇽, solo un día más.\nhttps://t.co/jzMLHteoHc\n#CircoSoledad\n(WT) https://t.co/qnjmgXsRl3 RT @SpotifyMexico: ¡Muchas felicidades @Pula_Lors y @ysa_malflo! Que hayan disfrutado mucho la previa de \"Circo Soledad\" con @Ricardo_Arjon… El CIRCO SOLEDAD Ensaya.\n#CircoSoledadLaGira\n#CircoSoledad\n35/50\n(WT) https://t.co/OCS57OBLZJ Felicitaciones @Pula_Lors y @ysa_malflo\n(WT) https://t.co/bbI3Bsogrm RT @Carol_mateo_a: @Ricardo_Arjona España te espera y se desespera 💕💕💕 #CircoSoledad  @INFOMUNDOARJONA @ArjonaSpain https://t.co/6VGjgGbqxs Cancún, nos vemos el 20 de Mayo.\nhttps://t.co/kvyQjwn9S9\n#CircoSoledad\n(WT) RT @INFOMUNDOARJONA: Mexico Estan Listos? #CircoSoledad #MundoArjona #MiembrosFelices https://t.co/2kPNAUrPyc RT @SpotifyMexico: Buscamos al fan más grande @Ricardo_Arjona para pasar una tarde inolvidable. ¿Eres tú? ¡Participa! #SpotifyBackstage htt… Gracias #Billboard\n(WT) https://t.co/nkLYeoL1vv RT @LatinBillboards: \"Dime si él te conoce la mitad, dime si él...\" Estamos seguros que te sabes esta canción #Bilboards2017 @Ricardo_Arjon… RT @Telemundo: .@Ricardo_Arjona nos regaló un recorrido por sus mejores temas 😍❤️ 🎶 #Billboards2017 https://t.co/IRCjF8r3zM El Que Olvida\n#CircoSoledad \n#FrasesArjona #58\n(WT) https://t.co/xEcvQ3j1qQ RT @adriaarjonaa: Never felt in better company.                             Nunca me he sentido en mejor… https://t.co/3kLirxKAgb Viviendo el Circo.\n#CircoSoledad\n34/50\n(WT) https://t.co/k7yeCwPR8p RT @rubenblades: Sobre Ricardo Arjona y CNN.\ntexto en https://t.co/ygKP69sPLQ y https://t.co/KvPMWHCnh6 RT @notiarjona: Un café con #Arjona https://t.co/SA4TIZMQAf Coincidir con mi paisana en México.  La voz, no se diga más. https://t.co/NX4CEYMGzb El circo soledad, se defiende solito. (WT) https://t.co/Rb3iTXN9vd 🎪\nCirco Soledad\nDisponible en todas las plataformas.\nhttps://t.co/jzMLHteoHc\n#CircoSoledad\n(WT) https://t.co/qbuQklmseK Y que empiece la función de este Circo Soledad...\nLanzamiento Mundial\nYA DISPONIBLE\nhttps://t.co/jzMLHtvZyK\n#CircoSoledad\n(WT) https://t.co/VmJx7SMdUo 🎪\nHay payasos con sonrisas de colores, Que se ríen pa' ocultar cuánto les duele...\n1 Hora más para el Lanzamiento Mundial\n#CircoSoledad\n(WT) https://t.co/XmZdn9pDIU Feliz cumpleaños a mi mejor amigo. Cualquier parecido es mera casualidad. Te quiero hijo. https://t.co/xCqNC4BCW4 Rueda de Prensa desde el #CircoSoledad\nLIVE desde Facebook\nVer aquí:\nhttps://t.co/QCFEr4Czd7\n(WT) https://t.co/evuW7Ijbrt MAÑANA\nLanzamiento Mundial\n#CircoSoledad\n(WT) https://t.co/q6o8JI3eFr Quien habla mal de ti, para tener de que hablar contigo.  Cuestión de consonante en el apellido. Supuestamente listo,  pero ENGAÑA CIRCO SOLEDAD\n21 de Abril\n#CircoSoledad\n(WT) https://t.co/zi2ooxbmEJ El Alma Muere Si Eres Marioneta...\n30/50\n#CircoSoledad\n(WT) https://t.co/IIBuWuw2qW Espiando al mago de Circo Soledad. \n29/50\n#CircoSoledad\n(WT) https://t.co/89vtooabSw Mimos sin libertad...\n28/50\n#CircoSoledad\n(WT) https://t.co/debZqNyTvP https://t.co/szDQgDptRk Porque El Circo Lo Llevamos Por Dentro.\n#CircoSoledad #7Dias\n27/50\n(WT) https://t.co/vSuT2ORa95 @IVETTEARJONANY @INFOMUNDOARJONA Usted es una belleza. Hay que vivir. Todos los días.Vivir. No distraerse en lo superfluo. Vivir. No para contarlo . Vivir para no quedar en deuda con uno mismo. ¿Aún no tienes tu entrada para #CircoSoledad la gira?, búscala aquí:\nhttps://t.co/uuNaUyu41B\n(WT) https://t.co/i4Ilt0kZ1m 10 dias más, en el circo se comienza a escuchar el murmullo de la multitud.\n26/50\n#CircoSoledad\n(WT) https://t.co/liYhyGNjMY México, falta poco...\nBusca tu entrada en https://t.co/jzMLHteoHc o en el App Oficial. \n#CircoSoledad #ArjonaApp\n(WT) https://t.co/eOvXES1Npe Entra en https://t.co/jzMLHteoHc para obtener tu PreVenta de Circo Soledad.\n(WT) https://t.co/60rHyM822B CIRCO SOLEDAD \nPreVenta- 7 Abril\nLanzamiento Álbum- 21 Abril\n#CircoSoledad \n(WT) https://t.co/lbQHTVI3iR #Billboards2017\n(WT) https://t.co/jLb8pEXgX6 Cada vez hay más movimiento tras las cortinas del circo, cada vez falta menos para la primera función. \n25/50\n#CircoSoledad\n(WT) https://t.co/FcUMlLXiGi Luces, piruetas, disfraces, muchas cosas pasan tras las cortinas del Circo.\n24/50\n#CircoSoledad\n(WT) https://t.co/7iZnsEFSwD CIRCO SOLEDAD.\nMuy pronto en tu ciudad.\n#CircoSoledad \n(WT) https://t.co/FJtK0SidHY Del viaje al Circo. Listos para la magia.  (WT) https://t.co/4uU4PEJxke Alguien no se enteró que el challenge termino. https://t.co/7h7jbh6Git Londres, París, Barcelona y Madrid estarán entre los primeros conciertos de la Gira Mundial CIRCO SOLEDAD.\nhttps://t.co/SaxtoLMxD5 … …\n(WT) https://t.co/BRjtC8kpqR FRANCIA, busca tus entradas para CIRCO SOLEDAD aquí. https://t.co/ciENKKEkp2 \n\n#CircoSoledad \n(WT) https://t.co/nP0eGyCGOU ...Y los elementos comienzan a ponerse en su lugar.\n22/50\n#CircoSoledad #Ella\n(WT) https://t.co/BD8tsjeDJi De a poco ELLA entra a nuestro Circo Soledad ...\n21/50\n#CircoSoledad #Ella \n(WT) https://t.co/enaX3nTLWg Londres, París, Barcelona y Madrid estarán entre los primeros conciertos de la Gira Mundial CIRCO SOLEDAD.\nhttps://t.co/SaxtoLMxD5 …\n(WT) https://t.co/NvYgXgLyhW Un chef fantástico me sorprendió ayer. https://t.co/vEZ6F8HJm4 Desde China grabaste eso? Vos estas peleando contra robot gigantescos ocúpate de eso y te liberas a los 50 jajajaj.\n\n#Repost @adriaarjona https://t.co/nrGpnFpnAB @adriaarjonaa jajajaja  Nunca perdi mas batallas que con vos. Siempre me ganas. Pero si ganas vos, mas gano yo. @adriaarjonaa jajajaja claro que si. Ya funciono los primeros 20. Te quiero. @adriaarjonaa Te quiero mi amor. Siga cumpliendo con su papa. jajajajajaj @adriaarjonaa Desde China grabaste eso? Vos estas peleando contra robot gigantescos ocúpate de eso y te liberas a los 50 jajajaj @adriaarjonaa Noooooooooo mamita usted no se tiene que liberar todavía. Déjeme consentirla otros 20 años. @adriaarjonaa Noooooooooo mamita usted no se tiene que liberar todavía. Déjeme consentirla otros 20 años. #EllaChallenge Hazte escuchar.\n(WT) https://t.co/d7T7Z33lzl ELLA, 10 millones de reproducciones en 10 días.\n#Ella #CircoSoledad\n(WT) https://t.co/JKBnG8fQFJ RT @PalauSantJordi: .@Ricardo_Arjona regresa a Barcelona con su gira #CircoSoledad, 9 de junio en el Palau Sant Jordi. Entradas en @Ticketm… RT @eventim_uk: 🎵🎶 Get your tickets to see unique singer/songwriter @Ricardo_Arjona at @EventimApollo. 🎵🎶\n👉https://t.co/cNC0mkdxcb👈 https:/… RT @notiarjona: Nico cantando Ella !!El video de ricardoarjona https://t.co/e4BHoFIZp0 LONDRES,\nYa está disponible la PREVENTA Exclusiva solo para miembros @INFOMUNDOARJONA .\n\nhttps://t.co/OMdnH5aXwl\n(WT) https://t.co/pZ1mSBuLxw 20/50\n #CircoSoledad\n(WT) https://t.co/xXrhJnIUMo 19/50\n #CircoSoledad\n(WT) https://t.co/FMu0nPOUiU 18/50\n #CircoSoledad\n(WT) https://t.co/uy8bTSgpIr CIRCO SOLEDAD, llega a España.\nÚnete a @INFOMUNDOARJONA y disfruta de la Preventa Exclusiva.\nhttps://t.co/DnwdsnKzZl \n#CircoSoledad\n(WT) https://t.co/KSrzeBYWzp 17/50\n #CircoSoledad #ELLA\n(WT) https://t.co/tKhXIraHVf 16/50\n #CircoSoledad #ELLA\n(WT) https://t.co/U236fVIHrk 15/50\n #CircoSoledad #ELLA\n(WT) https://t.co/poA7Rs915F Ya puedes ver el Detrás de Cámaras del Vídeo \"ELLA\" entrando al App Oficial Ricardo Arjona.\n#CircoSoledad #Ella #ArjonaApp\n(WT) https://t.co/zvyWPXVZtN CIRCO SOLEDAD https://t.co/Wmzkl4yhFu ELLA habla por sí sola. \nGracias.\n#CircoSoledad #Ella\n(WT) https://t.co/WumJdADoG5 @cpgalaz Una belleza este campeón. RT @cpgalaz: @Ricardo_Arjona Desde Chile mi hijo Facundo de 6 años tocando ELLA. https://t.co/QpPqj1U2KR 4 Millones en un día ? Ella tiene mas poder que yo. De eso no hay duda. ELLA tiene más de 4 Millones en 24 horas. \nEso pasa cuando uno explota con libertad.\nGracias.\n#CircoSoledad #Ella https://t.co/fdPkrr3zDI ELLA quiere besos en la esquina,\nSexo en la cocina, \nGimnasia en el sillón...\n https://t.co/FxIq3xGJy2\n#Ella #CircoSoledad \n(WT) https://t.co/1oHQIDEc8c RT @INFOMUNDOARJONA: Un saludo especial para Mundo Arjona de Ricardo Arjona #MiembrosFelices #Ella #CircoSoledad https://t.co/PjQmTulGdX RT @billboardlatin: .@Ricardo_Arjona drops new single and video 'Ella': Listen https://t.co/CuANXOfvL6 https://t.co/IvpXw32U5e RT @SergioADippW: Regresó el mejor de todos... con pura electricidad!!! 🎧 \n\n#PapáArjona #PapáEsPapá https://t.co/nW3KURZA2e Ya \"ELLA\" está aquí , Video Oficial \nhttps://t.co/FxIq3xGJy2 #CircoSoledad #Ella https://t.co/QNSDeSOV8r RT @jessiecervantes: ¡Buenos días! Hoy mi columna en @PublimetroMX 👉🏼  Regresa Ricardo con el circo de la mano --&gt; https://t.co/68UzpAnHBU… Ya está disponible, \"ELLA\" Video Oficial \n#Ella #CircoSoledad\n(WT) https://t.co/W2cAQhk153 ELLA está por llegar.\n14/50 \n#CircoSoledad #ELLA\n(WT) https://t.co/BJZ1Pi5iTR Fuimos a Londres a buscar los sonidos de las guitarras viejas, el Rock añejo y la musica de verdad . Y nos encontramos con ELLA. ELLA\n13/50\n#CircoSoledad #Ella\n(WT) https://t.co/4U8dMpEq01 RT @INFOMUNDOARJONA: Sube tu foto #ESPERANDOPORELLA #ELLA https://t.co/Dx3GxSDu2K Y celebrar que está viva\nExplotando en libertad...\n\nFeliz día a todas Ellas.\n\n12/50\n #CircoSoledad #ELLA\n#FrasesArjona #59\n(WT) https://t.co/NhOQRmAfZt Cumplió con su papá poniendo freno\nAl peligro del veneno\nDe toparse algún Don Juan...\n12/50\n#ELLA #FrasesArjona #CircoSoledad #59\n(WT) https://t.co/Di25fnMn1e Ella ya hizo todo lo que es bueno\nEstudió para Galeno\nSe cuidó del que dirán...\n11/50\n #ELLA #FrasesArjona #CircoSoledad #58\n(WT) https://t.co/hH9mmgKMPz ELLA llegará este Viernes. \n10 de Marzo\n#CircoSoledad #Ella\n10/50\n(WT) https://t.co/WsRitluwsI Todo listo para la llegada de Ella.\n9/50\n#CircoSoledad #Ella\n(WT) https://t.co/Z9LYoR9iig RT @Univision: .@Ricardo_Arjona estrena el sencillo 'Ella' y se va de gira a Europa  https://t.co/4UY3ahgKc5 https://t.co/3hlvVDKcCI RT @cmtvargentina: #CircoSoledad // #RicardoArjona presenta \"Circo Soledad\", uno de los proyectos más ambiciosos de su carrera👉🏼https://t.c… RT @UforiaMusica: .@Ricardo_Arjona estrena el sencillo 'Ella' y se va de gira a Europa con 'Circo Soledad' https://t.co/F54WgeZoES  https:/… RT @billboardlatin: .@Ricardo_Arjona sets date for new album 'Circo Soledad' https://t.co/uDd4UTo7F1 https://t.co/wgCDXggOG5 Volvimos.\nCIRCO SOLEDAD\nLondres, París, Barcelona y Madrid los primeros conciertos de nuestra Gira Mundial\n#CircoSoledad\nLink en Bio\n(WT) https://t.co/NLecX35gAt RT @ElGordoyLaFlaca: 👌 @Ricardo_Arjona regresa con #CircoSoledad el 10 de marzo será el lanzamiento mundial de #Ella primer sencillo de est… CIRCO SOLEDAD\nLondres, París, Barcelona y Madrid serán los primeros conciertos de la nueva Gira Mundial.\n#CircoSoledad\n(WT) https://t.co/ySNpyugiFK Empezar con risa, para continuar la lucha de defender este CIRCO SOLEDAD. Mientras ELLA se asoma por la esquina. \n8/50\n #CircoSoledad #Ella https://t.co/mts2t4o40P SECO \nEl Arjona que nadie conoce - Costa Rica.\nCapítulo 1 en #ArjonaApp\n#ReencuentrosArjona #MundoArjona\n(WT) https://t.co/IUKZCWUbdJ RT @MJraudes: @Ricardo_Arjona flaco no pude decirte tantas cosas gracias por la mejor noche de mi vida https://t.co/aqXHVFGOYS Como me gustas Costa Rica. Como pa llevarte conmigo.  ELLA el video que me faltaba hacer, donde lo tenía que hacer. PURA VIDA. https://t.co/UIJ7Ze0ci1 ELLA\n7/50\n #CircoSoledad #ELLA\n(WT) https://t.co/ZunCzHqnLg 6/50\n #CircoSoledad #ELLA\n(WT) https://t.co/Clpukmwj1A ELLA\n5/50\n #CircoSoledad #ELLA\n(WT) https://t.co/bxMlHzchzx App Oficial.\nAun más cerca que nunca.\nDescárgala mañana mismo y descubre el nombre de nuestro NUEVO SENCILLO\n#CircoSoledad #AppArjona\n(WT) https://t.co/1ggrt87kq0 RT @FeeerGuti: #TBT del día de hoy dedicado a #AnimalNocturno que fue dado a luz un 09/02/1993 @INFOMUNDOARJONA @Ricardo_Arjona https://t.c… 4/50\n#CircoSoledad\n🎪(WT) https://t.co/gL9j86BZVs Valdrá la pena la espera, este 14 de Febrero sabrán porque ... muy pronto...\n#ArjonaApp #CircoSoledad https://t.co/VYwNQSXRtg Hace falta un circo. Hacerlo rodar. Para solo así,  entender con magia lo que la realidad no permite. CIRCO SOLEDAD 3/50\n#CircoSoledad\n(WT) 🎪 https://t.co/h8xW1NiFWt \"Que me odies con todo el amor de tu vida...\" #TBT El circo comenzó a formar parte de nuestra atmósfera hace varios años\n #CircoSoledad (WT) https://t.co/dA1a5F3DxH 2/50 #CircoSoledad \n(WT) https://t.co/cCDCNN2Yj0 RT @MetamorfosisMed: Feliz Cumpleaños @RicardoArjona los mejores deseos para usted Maestro.Que viva su poesía, su creatividad, y sus enseña… Ni tan joven pa andar de inocente. Ni tan viejo pa no tener su film de niño a color. Gracias por el afecto. https://t.co/REhleFOY18 #CircoSoledad\n1/50\n(WT) https://t.co/Y1igN9LPJQ RT @Ricardo_Arjona: !!!!!No me gusto nada!!!!! https://t.co/FI6WZWXKyG !!!!!No me gusto nada!!!!! https://t.co/FI6WZWXKyG RT @NBCEmeraldCity: Welcome to our wicked world. #EmeraldCity https://t.co/KWyklSaYmI Asado para saludar el 2017.  Mucha familia, lo demás viene solo. (WT) https://t.co/QpQNjUHQ01 Ni los astros ni los gobiernos dirigen tu sonrisa. Ser responsables de nuestra felicidad, sera nuestro mejor regalo. RT @NBCEmeraldCity: Are you a good witch, or a bad witch? #EmeraldCity https://t.co/i63ign97xC CIRCO SOLEDAD. (WT) https://t.co/BcsevsJpsa RT @Ricardo_Arjona: Zapatos para este circo. Risas para este llanto. Circo soledad....... mi nueva casa. https://t.co/8cSYo2BLGY Zapatos para este circo. Risas para este llanto. Circo soledad....... mi nueva casa. https://t.co/8cSYo2BLGY RT @Ricardo_Arjona: Vivió entre musas,música y desvelo los últimos meses,fue difícil hablar con él.Hoy sabemos que estaba haciendo el mejor… Vivió entre musas,música y desvelo los últimos meses,fue difícil hablar con él.Hoy sabemos que estaba haciendo el mejor disco de su vida(WT) https://t.co/m3CA3ZMNcV Millonario De Luz\n#FrasesArjona #56\n(WT) https://t.co/GyfPndD0s2 Para todos un abrazo grande. Se les quiere. @_SoldadoRaso Abrazo paisano. @LauraDaS2016 @El_inge_ebrio Beso Charrua para usted @LalisTruths Un novio que te deja por eso. No se acepta esa linea como reclamo. Ese fue un favor. Besito linda. @jimenezk78 Paisana no se me enoje. Beso @erikahs26 Ahora que se que sos de Mexico imposible leer esto sin albur. Beso linda. @MJraudes Pura vida linda. @Rociosandovalg De Sonora tenias que ser pa ser tan linda. Besito @SolMariam36 Beso linda. @JOS_DEM Abrazo hermano. Muchos recuerdos de tu tierra. @luisodonto08 Empezaba con eso los 7 de diciembre . Abrazo @gaturrocapo Saludos Tano. Y un abrazo también @mamaniSil Enfermera sin estar enfermo. Suena mejor @GarridoVal Los viernes por las noches ya era Lola. Un anticipo. @angeldemon20121 No estes tan segura. Vas a aprender a imaginarme muy pronto JAJAJAJA No puedo creer que subieron el video. Una locura. 🤘🏽\n(WT)\nVideo completo en #MundoArjona https://t.co/pI3WK5NHmp #FrasesArjona #55 (WT) https://t.co/MSLKcnpnA5 Si el norte fuera el sur , 1996. #TBT  (WT) https://t.co/9fFfyNx4QN Si tú no existieras.\n#FrasesArjona #54 (WT) https://t.co/rJjyKP1CNU RT @notiarjona: @Ricardo_Arjona https://t.co/Pmr98O43lr Señora no me hable más. (WT) https://t.co/GlLYa5t9cc RT @Ricardo_Arjona: #FrasesArjona #53\n(WT) https://t.co/cerAL0aW5b #FrasesArjona #53\n(WT) https://t.co/cerAL0aW5b La Nueva Colección \"Apague la Luz y Escuche\" brilla en la oscuridad.\nhttps://t.co/KlGC2zrsEH\n(WT) https://t.co/VtYJKvPaNK #SoyMalena\n#FrasesArjona #52\n(WT) https://t.co/0oa45mrOVA 7 millones de gracias Veranos que se asoman trasnochados. Inviernos que mojados no escarmientan. Dime tu, que hago conmigo . RT @notiarjona: #FundaciónErickQuiroa junto @Ricardo_Arjona cumplieron un sueño https://t.co/DPIcYBlT3A RT @notiarjona: Ricardo Arjona cumple el sueño de una fan guatemalteca https://t.co/YSjGGFQdTK #eu #emisorasunidas Ponle tu rostro a #Malena\n#SoyMalena\n(WT) https://t.co/hqDtVVZDKk Invertebrado #FrasesArjona #51 (WT) https://t.co/5nt0J2Vb3E Carlota. Ya escucho todas las canciones nuevas. Solo ella y yo sabemos de qué se tratan. Se comió la mitad de mi asado, pero es una amiga https://t.co/kD0UIBq8bh https://t.co/PWA27bJg4a Cuando...\nYa son #50\n#FrasesArjona\n(WT) https://t.co/zP1KjrC3Qo Nuestras nuevas artes , #ApagueLaLuzYEscuche . 6 de Octubre (WT) https://t.co/nDAE7aEBRe Buscando los sonidos que acompañen las mejores canciones de mi vida. Hace dos meses no existían   Qué pasó ? Quizás las  ganas de volver. #FrasesArjona #49\n(WT) https://t.co/D53TbHA0MJ RT @adriaarjonaa: Siempre en países diferentes en escenarios distintos pero nunca lejos. https://t.co/Ti7T3tvEfR Una más. https://t.co/tfY4IzeZFe Voló millas para buscarme en mi trabajo cuando era niña. Hoy, recorro el mundo para encontrarla en el de ella. La mejor actriz del universo https://t.co/4h5AsHE82s @Fund_Adentro mi agradecimiento por su contribución al fortalecimiento de la educación en Guatemala.Más como ustedes. Gracias spadd RT @Fund_Adentro: ¡Nuestras voces serán el eco de nuestra Tierra! Celebremos nuestra independencia. #EscuelasAdentro #AfinandoSueños https:… Noti ARJONA Ya son mayores de edad en cualquier lugar del mundo  21. Se les quiere.  Que vengan más. #MiercolesDeFrases #47\n(WT) https://t.co/OoTG8xZn8s De nuevo??????  (WT) https://t.co/PDQLFiLNXR RT @INFOMUNDOARJONA: Para ver mas ingresa en https://t.co/f915tOZPB2 #MundoArjona #MiembrosFelices https://t.co/qL48KmJZwF RT @INFOMUNDOARJONA: Para descubrir como terminó esta barbaridad entra en https://t.co/f915tPhqZC #TBT https://t.co/Co0376VgOW #Mujeres , lo que nos pidan podemos. #TBT #(WT) https://t.co/ZH9aLHmghc Su Menester #MiercolesDeFrases #46 (WT) https://t.co/vMGGhNtc2A Mi Biografia Literaria #ApagueLaLuzYEscuche \n(WT)\nhttps://t.co/g6KEDU6Fa2 https://t.co/Otpk2mdMkT RT @Fund_Adentro: ¿Cuál es el sonido de esta letra? No son solo palabras, son nuestra puerta al mundo #EscuelasAdentro https://t.co/6VZtPg7… Historia De Taxi.\n#TBT\n (WT) https://t.co/fDtQqsI0jZ RT @INFOMUNDOARJONA: \"El mar todito para mi\".. #ContenidoExclusivo #MundoArjona #MiembrosFelices https://t.co/dx76ilsFZc Buenas noches a todos. Apaguen la luz y sueñen. Hasta siempre @AndreaIsambertt jajajaja beso grande @Poluchita Hoy, hoy fue el dia linda. RT @carolarjonera: @Ricardo_Arjona será que vale la pena esperar por un sueño?y recibir mi retweet @gise0478 Beso linda. No se duerma. @_Susanrenata Si. Hay alguien que la administra para que yo la desordene. @MicaDusserre Cuando? y otra cosa,  que hacemos con el de la foto? Por suerte entre  los POKEMON Y DONALD TRUMP siguen habiendo guitarras para escribir un mundo que se vea un poquito, solo un poquito mejor. RT @CosmicaArtists: @gaby_moreno's new album #Ilusion is now available for pre-order on @iTunes! Officially out Sept 9! #NewMusicFriday\nhtt… RT @INFOMUNDOARJONA: Contenido Exclusivo \"Apnea\" en sus inicios a piano y voz #TBT #MundoArjona #MiembrosFelices #ViveLaExperiencia https:/… @Arjoneana_xD Muy lindo lo suyo belleza. @florijandar Yo se lo mando. Como no No puedo escribir mucho. Estoy acompañado. https://t.co/pJGg1qk04j Apague la luz y escuche.Ese disco tan mío, el mismo que pense no compartir en tiempos de ruido,se abre paso con su silencio a pesar de todo Quisiera nadar en tu boca, convertirme en ropa y pegarme a tu cuerpo\n #Malena #ArjonaenDibujos \n(WT) https://t.co/URedEuFkOS #ApagueLaLuzYEscuche \n#1 Latin Pop Álbum en USA y PUERTO RICO. \n(WT) https://t.co/c8wOhIpWSO # 1\n#ApagueLaLuzYEscuche  (WT) https://t.co/BFBw6zUijN RT @LatinGRAMMYs: Estes são os #SocialMediaHighlights desta semana. Compartilhe sua 📷 favorita... \nhttps://t.co/fF6bQF0ydq https://t.co/D1k… Gracias por el Disco de Oro Argentina #ApagueLaLuzYEscuche (WT) https://t.co/NoFhqZpFkW Acústico. #Tbt #throwbackthursday\n#ApagueLaLuzYEscuche (WT) https://t.co/GTvV3yj8lh RT @billboardlatin: .@Ricardo_Arjona rounds out the top three on Top Latin Albums with #ApagueLaLuzYEscuche https://t.co/FaK6TF09NT https:/… ¿Y tú?, ¿Ya apagaste la luz? #Apaguelaluzyescuche (WT) \nhttps://t.co/Lbw1PFsCDa https://t.co/1IkWPBB2dX RT @INFOMUNDOARJONA: #MartesCreativo\nNuestros miembros continúan mostrándonos su creatividad. Se parte tu también y envíanos la tuya. https… \"Silencios absolutos que comparto con una guitarra\".\n#ApagueLaLuzyEscuche https://t.co/WmJu1ZRbZm  (WT) RT @notiarjona: Excelentes detalles !  https://t.co/nEtRCY4sLK @VanessaMCerda feliz cumple belleza RT @MaraCastaneda: @Ricardo_Arjona Gracias querido por el regalo maravilloso. #ApagueLaLuzYEscuche Un beso https://t.co/ARVhyfuund Amor del bueno desde que la vi. \"Mi novia se me está poniendo vieja Feat. Carlos Varela\" #Apaguelaluzyescuche (WT) https://t.co/q2ORBQcZew RT @mdzonline: [Video] Todos los detalles sobre el nuevo disco de @Ricardo_Arjona  https://t.co/eOqrClBkDW https://t.co/aPKHK0GsaY Ellos apagaron la luz y están escuchando, ¿y tú? #Apaguelaluzyescuche (WT) https://t.co/5KWeLFxmyy Escucha la historia detrás de cada canción, Exclusivo de @Spotify \n#AmorAmorConArjona\nhttps://t.co/I0swN53EOR \n(WT) https://t.co/aAPXfrczFa RT @notiarjona: Ya pasamos los 2 millones @Ricardo_Arjona  👏🏻https://t.co/EEjIXBBsOo vía @youtube #APAGUELALUZYESCUCHE \nen tiendas y digital por  https://t.co/rt8c7Sq0WJ  (WT) https://t.co/2gHLIASAdP RT @RadioDisneyLA: #ViernesDeEstrenos @Ricardo_Arjona lanzó #ApagueLaLuzYEscuche, solo se podrá conseguir físico o en su página web. https:… RT @Telemundo: Exclusiva: Mira un adelanto del nuevo álbum de @Ricardo_Arjona. https://t.co/IyN0Iy49t9 -vía @TelemundoEnt https://t.co/TXc4… RT @TvsEspectaculos: El cantautor @Ricardo_Arjona revela que su nuevo álbum #ApagueLaLuzYEscuche, tiene influencia de las radionovelas. htt… RT @TelevisaTVmx: @Ricardo_Arjona regresa a la simplicidad ¡Entérate de los detalles de su nueva producción! https://t.co/ZzGmkSlhPS https:… RT @programa_hoy: 🎼  Ahora, la musa de @Ricardo_Arjona son las radionovelas de la #XEW 📻  📹 https://t.co/oXboo1hsfz https://t.co/Uohl59ATVf RT @GarridoVal: @Ricardo_Arjona Desde el sur del sur, mi niña Lola, tu pequeña admiradora... ¡apagó la luz! https://t.co/Vo6hoH3zcD RT @olgui18: @Ricardo_Arjona Ricardo mi familia ya esta feliz con este lanzamiento @ArjonaChile @INFOMUNDOARJONA https://t.co/2LkyhOVoGi Ricardo Arjona on the Silence Behind His New Album: Watch (Exclusive)  https://t.co/2Ucswx1ft6 vía @billboard #APAGUELALUZYESCUCHE \nen tiendas y digital por  https://t.co/rt8c7Sq0WJ  (WT) https://t.co/7yBDMyE370 RT @SonyMusicLatin: .@Ricardo_Arjona presenta su nueva producción: #ApaguLaLuzYEscuche \nConoce los detalles en: https://t.co/JCa0GQNtNF htt… RT @SpotifyMexico: ¡El último álbum de @Ricardo_Arjona está por llegar! Con esto la espera será menos larga: https://t.co/4p3RofYucM https:… RT @DANIELSARCOSC: Llego regalo de @Ricardo_Arjona #apagalaluzyescucha ,más detalles mañana en @unnuevodia ,nada… https://t.co/raAaPhERHz RT @portalmvd: Hoy sale “Apague la luz y escuche”, el nuevo disco de @Ricardo_Arjona. Adelanto: https://t.co/OIekXs20xw https://t.co/XLF2AG… RT @LatinBillboards: Exclusiva de @billboard mira donde puedes conseguir el nuevo álbum de @Ricardo_Arjona https://t.co/nuZGzBHoIr https://… RT @Vale975: En minutos  ganá el nuevo CD de @Ricardo_Arjona, en el día de su lanzamiento mundial! #ApagueLaLuzYEscuche https://t.co/cC3ckQ… RT @FMDOS: EN EXCLUSIVA ¡Escuchamos los nuevos temas de #ApagueLaLuzYEscuche de @Ricardo_Arjona! https://t.co/FtE5U2nXoz https://t.co/R8RSB… RT @FMDOS: ¿Quieres saber cómo se creó #ApagueLaLuzYEscuche? Escucha este video de @Ricardo_Arjona https://t.co/FtE5U2nXoz https://t.co/6vT… RT @Tigo_GT: La voz de @Ricardo_Arjona se enciende en cada tema de su NUEVO disco!! #SigueLaMúsica aquí https://t.co/3AefgXHmfs https://t.c… #APAGUELALUZYESCUCHE Ya está DISPONIBLE \nen tiendas y digital por  https://t.co/rt8c7SHBOh (WT) https://t.co/2FWMTgEHcz Escucha la historia detrás de cada canción, Exclusivo de @Spotify \n#AmorAmorConArjona\nhttps://t.co/I0swN4M3qh\n(WT) https://t.co/AmVftHKjU5 RT @Nodoubtcris: @Ricardo_Arjona Adria está feliz porque ya llegó❤️ #ApagueLaLuzYEscuche @INFOMUNDOARJONA @notiarjona https://t.co/7vGfqTEj… Apaguemos la luz #ApaguelaluzYEscuche (WT)  https://t.co/vjuUwpsDS2 Apaguemos la luz. #ApagueLaLuzyEscuche (WT) https://t.co/jbX8N6o41Y Apaguemos la luz. #ApagueLaluzYEscuche (WT) https://t.co/cp8fLxegsS Apaguemos la luz. (WT) https://t.co/WKMR2CyaLV Pero primero apaguemos la luz.\n#ApagueLaLuzYEsuche (WT) https://t.co/4tI7LNWD0s Fuí víctima del ruido, hasta que descubrí mi silencio. https://t.co/KmHslwn6eA #ApagueLaLuzyescuche (WT) https://t.co/S0GCXalirK RT @billboard: .@Ricardo_Arjona on the silence behind his new album (exclusive) https://t.co/8dSoQAgpOw https://t.co/OgYrULH8SD Mañana. #ApagueLaLuzyEscuche (WT) https://t.co/TrGfsBjvJa Qué te dice el dibujo?, sabes a qué canción pertenece?.\nDescúbrelo en una hora.\nLink en… https://t.co/jE37jfGsrv Este Viernes, 29 de Julio, Lanzamiento mundial #ApagueLaLuzyEscuche (WT) https://t.co/fW1jsVrczN RT @billboardlatin: Watch @Ricardo_Arjona's new music video 'Nada Es Como Tu' https://t.co/Jqjgd6OS8X https://t.co/c0yCYcugC6 RT @SonyMusicLatin: \"#NadaEsComoTú ni la mar en calma ni la tempestad\" ¿Conoces lo nuevo de  @Ricardo_Arjona? https://t.co/eGoVsyV6da Sabes el nombre?, descúbrelo en 1 hora. \nLink en la bio  2/6 #ArjonaEnDibujos \n#Apaguelaluzyescuche (WT) https://t.co/MhD49lynq2 La reconoces?, descúbrelo en 1 hora. \nLink en la bio  1/6 #ArjonaEnDibujos  (WT) https://t.co/raP5vrVhpM Rescatar la esencia #ApagueLaLuzYEscuche \n29 De Julio\n(WT) https://t.co/YxbpUGCuJJ Acústico.\n#ApagueLaLuzYEscuche \n29 de Julio.\n(WT) https://t.co/zH7aibAfZc RT @NBCEmeraldCity: #EmeraldCity's @adriaarjonaa has landed in the magical world of #SDCC2016. https://t.co/vT8Ow4wjZI Por Dios.  Mi niña.  Se me hizo grande.  Muuuuy grande. https://t.co/B1OTqcMtgX “Apague la luz y escuche es una invitación a dejar el ruido y reencontrarse con nuestro silencio… https://t.co/I34d3ciIhq Si participaste en la Preventa ya puedes descargar el álbum #ApagueLaLuzyEscuche una semana antes que nadie!\n(WT) https://t.co/8HM1bHdho0 \"Con guitarra en mano nace esta canción , producto de una casualidad.\" #NadaEsComoTu \n(WT) https://t.co/804m8ZdhAO RT @INFOMUNDOARJONA: Disfruta del detras de camaras del video oficial \"Nada Es Como Tú\" #MundoArjona #MiembrosFelices https://t.co/MqIdk889… Video Oficial de \"Nada es como tú\".\nEntra aquí!.\nhttps://t.co/n9g9hCXVMH…\n(WT) Ya está disponible el Video Oficial de \"Nada es como tú\".\nEntra aquí!\n https://t.co/dDn809MXj4 \n(WT) https://t.co/5Ac84sqlx3 Como un sueño que soñé https://t.co/IKu541NfZD Último vistazo. Mañana , 20 de Julio , Video Oficial #Nadaescomotu\n(WT) https://t.co/OJtZDk8dn6 Mañana , 20 de Julio , Video Oficial #Nadaescomotu\n(WT) https://t.co/omvQmXcfSN Mañana, 20 de Julio , Vídeo Oficial #NadaEsComoTu . (WT) https://t.co/pc9pQX9c7o Yo se lo mando linda. Para que haga las dos cosas. https://t.co/XC8L8uIn1q @Arjonatica Yo te lo mando linda,  para que hagas las dos cosas. Queda solo 1 día más para que aproveches la preventa #Apaguelaluzyescuche Que esperas?\n https://t.co/yWJwKba4Ao\n(WT) https://t.co/olfnou5BH3 La cuenta regresiva comienza hoy!. Miércoles 20 de Julio , Video Oficial #Nadaescomotú (WT) https://t.co/leI9llxUG0 Demo hecho en casa,\nguitarra desafinada. \n#Nadaescomotú #Arjonaendibujos #Apaguelaluzyescuche https://t.co/QcoOeLb8px Contando los días para el estreno mundial del Video Oficial  #NadaEsComoTu \nDisponible en solo 7 días.\n(WT) https://t.co/FcVaoeRMJj RT @INFOMUNDOARJONA: Ingresa ya y conoce las primeras fotos del Behind The Scenes del video \"Nada Es Como Tú\" #MundoArjona https://t.co/RVw… RT @INFOMUNDOARJONA: #MartesCreativo  Mostrando la creatividad de nuestros miembros  #MundoArjona  #MiembrosCreativos #MiembrosFelices http… Aprovecha la PreVenta exclusiva por tiempo limitado!. Entra en https://t.co/jzMLHteoHc,y obtenlo solo por $5.99 (WT) https://t.co/AM3SpyXSlM Apague https://t.co/31WEROQM9v RT @Telefe_musica: @Ricardo_Arjona toma un buen mate argentino https://t.co/k1exemGpyE RT @billboardlatin: Ricardo Arjona compiles fan videos for 'Nada Es Como Tu' lyric video &gt; https://t.co/IHDSqI0qkj https://t.co/ArqwAcoqi9 Fuiste de los que envió vídeos para el #FanVideoLyric de \"Nada es como tú\"? ya está LISTO! #NadaEsComoTu https://t.co/4zugioRo95 (WT) Las dudas sobre el mate https://t.co/h0b0mEbj5T Solo Por-\nhttps://t.co/kLgt7638jP…\n(WT) https://t.co/l565GdiXp8 Fuiste de los que envió vídeos para el #FanVideoLyric de\"Nada es como tú\"?ya está LISTO! (WT)https://t.co/4zugioRo95 https://t.co/7254CmO8KN https://t.co/4zugioRo95 (WT) https://t.co/Fn4NT9mq0K Solo Por-\nhttps://t.co/kLgt7638jP…\n(WT) https://t.co/VbrpboN7tO https://t.co/4zugioRo95 Entra a el canal de #YouTube ARJONAOFICIAL, y disfruta del Fan Video Lyric hecho por ustedes, de nuevo GRACIAS! (WT) Mañana podran disfrutar del #VideoLyric #NadaEsComoTu hecho por ustedes (WT) https://t.co/CCOG71jdOW Solo Por-\nhttps://t.co/kLgt7638jP…\n\n(WT) https://t.co/aIkpmczGjb El miércoles 6 de julio es el lanzamiento oficial del Video Lyric creado por ustedes. #NadaEsComoTu https://t.co/umpU1cjUVL RT @Vale975: #YoEscuchoVale975 ♫\n@notiarjona @historiasarjona @INFOMUNDOARJONA @JocotecoFanClub @HistoriasSedeMz @Historiasbsas1 https://t.… Solo Por-\nhttps://t.co/kLgt7638jP…\n\n(WT) https://t.co/8RO67PhMX6 RT @mariana82394026: Poner a @Ricardo_Arjona y que mi hija venga corriendo me enamoro .loca como la madre salio!!! Jeje @notiarjona https:/… @lulycorrea Lulita beso. Buenas noches Los quiero. No los desvelo mas. Les mando un abrazo y apaguemos siempre la luz para evitar el ruido que no nos deja escucharnos a nosotros mismos. @ViqqoDobra @JuliFronti jajajaLas  giras pasadas estaban vestidas de grandes producciones, esta casi en cueros, puras canciones. Si las estrellas confabulan pasaremos a verlos pronto, a tres guitarras y el sueño de estar ligeros de prendas cantando por donde se pueda. Ayer terminamos el video de NADA ES COMO TU. Sospecho de que ni sospecho cuanto me gusto. @notiarjona Un dulce Guatemalteco con forma de pierna. Por Dios. No se ve nada.  Siempre respetuoso del concepto.\nApague la luz y escuche EN DIRECTO en #Periscope https://t.co/9DdgHsYKvB Les mando una canción , dejen afino la guitarra. @Romyg4 buenas noches linda @lauuupereyra Nada de golpes. Pura vida como dicen los ticos. Estamos mas felices que nunca de emprender nuestros propios caminos @RadioArjonaCast Marta jamas se llamo así.  Asi de secreta fue. Esta salida de APAGUE LA LUZ Y ESCUCHE esta llena de riesgo y atrevimiento. Nada de este valor seria posible si no contáramos con ustedes. @KariBenok  Niña? jajajaja yo soy el que esta parado. @JESSIK_YK un poquito @Andrewws_10 Mira esta otra https://t.co/8197qRiJfC @jxbernardez No quiero ponerme muy superficial. Saben lo que quiero a  La Antigua. Pero lo primero que viene es CANILLITA DE LECHE @Marianny_GarciaLos que nos dedicamos a esto lo hacemos para espantar  fantasmas Por eso los artistas son tan complicados, yo no los aguanto @CarlosTurizo7 Jajajajaj viste lo que era ? y ademas media 1.45 metros   En guatemala mi nombre es SECO asi me dicen que quiere decir flaco. @Vaneten Mucha de mi fortaleza viene de mi debilidad. Nadie lo sabe y nadie lo sabrá... solo nosotros. miren, jajajajaja https://t.co/louyxu1ZFg En la escuela cuando cantaba,  tenia la impresión de que al único que le gustaba lo que yo hacia era a mi. Y ojo, tenia mis dudas. Muchas preguntas  tienen que ver con la gira. No se cansaron de mi con la pasada? Tengo la impresión de que acabo de arruinar esta canción. Que quieren saber. Como estamos. Abrazo grande para todos. EN DIRECTO en #Periscope https://t.co/sZxDJ0xtZE Preventa Disponible Solo por-\n\nhttps://t.co/yWJwKba4Ao\n\n(WT) https://t.co/tVU5W4zEFT Me refiero al sur del sur. @RosaMar96064389 de las mias, 12 de la noche me gusta. Nos vemos a las 12 del sur. Mucho que contar.  Un abrazo. Argentina dice 11.30 Guatemala dice a las 11, me esta gustando mas. Chile dice a las 9, esta bien para los demás? A que hora, ustedes dicen. Apagan la luz mañana en la noche conmigo? Miren a quien encontramos ensayando en la oficina esta tarde.\n#ApagueLaLuzYEscuche \n(WT) https://t.co/aTuIGnw8gq #NadaEsComoTu https://t.co/X4Qo5M9YNt Será tuyo con beneficios adicionales el 22 de julio.\nUna semana antes que nadie.\nSolo por- https://t.co/jzMLHteoHc https://t.co/WXNNnSZ0zv Estamos a menos de un día de la preventa que han estado esperando.\n#ApagueLaLuzYEscuche \n https://t.co/jzMLHteoHc\nWT https://t.co/6OfFXHYEhG Estamos a solo dos días.\nPreventa\n#ApagueLaLuzYEscuche \n\nSolo en- https://t.co/jzMLHteoHc\n\n(WT) https://t.co/4gZKFD5Ze8 Nada Es Tan Perfecto Como Tu.\n\n#NadaEsComoTu\n(WT) https://t.co/aO2cK9dVbs Nada Es Tan Perfecto Como Tu.\n\n#NadaEsComoTu\n(WT) https://t.co/K0hED6dZat Forma parte de la Preventa y tendrás dos canciones y un anticipo del demo \"Nada Es Como Tú\" un mes antes que nadie. https://t.co/3CINieSCxK Ellos ya enviaron sus vídeos.\n Ya hiciste el tuyo? \nEnvía tu Video Lyric a-Contacto@mundoarjona.com #NadaEsComoTu\nWT https://t.co/Ihtg4zL9ft Nada es tan perfecto como tú.\nSu creatividad podrá formar parte de nuestro Video Lyric.#NadaEsComoTu #ApagueLaLuz\nWT https://t.co/EYjRrvEpRD RT @Profe20091: @Ricardo_Arjona Dulzura, Sencillez, Fuerza Interior y un Profundo Sentimiento de Amor en tus palabras MAESTRO!!! NADIE ES C… Su creatividad podrá formar parte de nuestro Video Lyric.\n#NadaEsComoTu \n#ApagueLaLuzYEscuche \n(WT) https://t.co/7NxsMCf1UG Ni La Luna Llena,\nNi El Atardecer....\n\n#NadaEsComoTu \n#ApagueLaLuzyEscuche \n(WT) https://t.co/0NUDv0NyA5 Lunes 27 de junio.\nComienza La Preventa.\n  \"Apague La Luz Y Escuche\" \nSolo en -www.Ricardoarjona.com https://t.co/VP9aSPnc1E Día del padre. Mejor imposible. https://t.co/oagJmPOMwJ RT @billboardlatin: Ricardo Arjona's Website Crashes: 100,000 Fans Download New Single in First Minute https://t.co/zosnQ0a5cl NADA ES COMO TÚ\nVideo Cover Oficial.\nhttps://t.co/Cub62jJVBO\n\n(WT) https://t.co/8ASjXsTQFD Una hora más.\nEstamos listos!\nhttps://t.co/jzMLHteoHc\n#NadaEsComoTu \n(WT) https://t.co/HdxpWqdKTM 100 mil personas en los primeros 50 segundos. Pagina colapsada Nos preparamos para un trafico grande,jamás para lo que esta pasando Agradecidos y ocupados en ponerlo a su disposición(WT) Ingresa Ya!\nLas dos horas han comenzado.\n#NadaEsComoTu \nHaz Click En El Link.\n\nhttps://t.co/Oczv3TVH52\n\n(WT) https://t.co/XVWvsP5qk1 Acuérdate hoy \"Nada Es Como Tu\" 2pm- 4pm hora Mex sera gratis para nuestro publico.\n\nhttps://t.co/jzMLHteoHc https://t.co/qbf84KklOv NADA ES COMO TU  fue hasta ayer de mi autoría, hoy,  la escribimos todos. Se las regalo pa´ que la pongan donde quieran. Exclusiva.\nNuevo sencillo #NadaEsComoTu \n(WT) https://t.co/97yrPwou7f 1 Día Más\n\n#NadaEsComoTu \n#ApagueLaLuzYEscuche https://t.co/raw7jwCexg NADA ES COMO TÚ\n\nLa espera se reduce a solo 2 DÍAS.\n#NadaEsComoTu #ApagueLaLuzYEscuche \n(WT) https://t.co/lNHe9mKFW2 NADA ES COMO TU #ArjonaEnDibujos #1/14\n\nPor primera vez podrás ver una canción antes de escucharla.\n#NadaEsComoTu\nWT https://t.co/OgIgCjnZpj Sigan compartiendo y seguirán descubriendo.\n#NadaEsComoTu\n#ApagueLaLuzYEscuche \n(WT) https://t.co/jPtWzS9YXa RT @INFOMUNDOARJONA: Contenido Exclusivo ingresa ya! #MundoArjona #MiembrosFelices #ContenidoExclusivo https://t.co/KbBKkPsJrr #NadaEsComoTu \n#FrasesArjona\n(WT) https://t.co/dpcnxTGXcD RT @billboardlatin: .@Ricardo_Arjona teases new single 'Nada Es Como Tu': Listen https://t.co/eHltD3JXVI https://t.co/f5lUdlMqN4 #NadaEsComoTu \nDisponible Este 17 De Junio.\n(WT) https://t.co/QCPhAU05CU Llegó la hora de adivinar el nombre de su nuevo sencillo. \n#ApagueLaLuzYEscuche\n(WT) https://t.co/lAXJZ0Dgkk Solo 24 horas más tendrán las últimas pistas. Estará en tus manos adivinar el nombre del Nuevo Sencillo.... \n(WT) https://t.co/WD8LQtmNRX Con mis dos mejores amigos. https://t.co/MAyd29Hlla Dalí ????? (WT) https://t.co/hcH45v0hfd Más pronto de lo que te imaginas... #ApagueLaLuzyEscuche https://t.co/BBXdFWM8II https://t.co/XNlEdT6CC6 #Apaguelaluzyescuche https://t.co/opiRzr1Zxz Amo el riesgo que me agita cuando juego al escondite. \nAmo lo que quieras darme aunque sea la mitad.\n#ApagueLaLuz https://t.co/FMBDfiKc8W Marc Cohn el cantautor que mas me gusta me hizo esperar 7 años para su nuevo disco. Lo tengo.  Apague la luz no se tardara tanto, lo prometo 🕯\n#ApagueLaLuzYEscuche https://t.co/OvZgKlMPmH Y la sospecha de que ni sospechas... #Apaguelaluzyescuche (WT) https://t.co/p8Rg5gyUlV RT @notiarjona: Y Nico su otro bebe @Ricardo_Arjona https://t.co/wQw0KA4rOl RT @notiarjona: \"y ella es....... y el es..... mi bebe \"   @Ricardo_Arjona https://t.co/IgxQcpUtWH Se acerca algo nuevo.... #ApagueLaLuz (WT) https://t.co/5vG7KOSLNU Un castillo para una reina y sus dos príncipes dormidos    Buscando a Adria nos encontramos con Dorothy https://t.co/6OuJ2QGvH0 @INFOMUNDOARJONA A la escuela, mientras el tiempo pasa. https://t.co/jsgOHjmo8W 💡\n#ApagueLaLuzYEscuche\n#FrasesArjona #45 https://t.co/BBFd1M2gnm APAGUE LA LUZ.  (WT) https://t.co/LG5BqvRC0x Ayúdame Freud\n#FrasesArjona #44 https://t.co/uVBi1vad8Q RT @patry9138: #MartesCreativos #MartesCreativo @Ricardo_Arjona apaguemos la luz por favor!No podemos esperar más! @Historiasbsas1 https://… Mi abrazo solidario a los hermanos Ecuatorianos. APAGUE LA LUZ Y ESCUCHE https://t.co/HurgwpgujP https://t.co/vCGdmZwbzn Feliz cumple bellezas. https://t.co/UmK58yqumV Lo Poco Que Queda De Mi...\n#FrasesArjona #43 https://t.co/Ze2Ee4SHgC RT @Arjona_SDATPERU: @INFOMUNDOARJONA @Ricardo_Arjona 🎶Demás está decir te extraño y el resto de cursilerías🎶❤️ https://t.co/KuladNJ3L7 https://t.co/Sk6rFZS31L Gran dia para Guate. Tiene una escuela mas. Nada se le puede pedir al futuro si no educamos a nuestra gente en el presente.\n#FrasesArjona #42 #FundacionAdentro https://t.co/RmQoLGskjn RT @Fund_Adentro: Una inaguracion grandiosa. ¡Con emociones unicas! Los instrumentos y libros están en sus lugares. ¡Hora de aprender! http… RT @EdinBHernandez: Los que piden deben esperar y los que dan, tener prioridad para construir más escuelas, dijo Arjona al presidente. http… RT @prensa_libre: .@Ricardo_Arjona saluda a estudiantes de escuela recién inaugurada antes de retirarse. (Fotos: Esbin García) https://t.co… 👏\n@Fund_Adentro https://t.co/nZ4mLzLYJI @Fund_Adentro no es una invitación al cambio, es el cambio que ya empezó. #SegunaEscuelaCBC #FundacionAdentro \n(WT) https://t.co/mDiIwCV6Zn RT @Fund_Adentro: @Ricardo_Arjona dando su discurso en la inauguración de la segunda escuela. https://t.co/XEBtQ6ef0X #FundacionAdentro https://t.co/nS7LiW1n20 Fundación Adentro inaugura la segunda escuela. Poblar el país de centros educativos que beneficien a los niños. https://t.co/rlWC2eFkaD RT @Fund_Adentro: Hoy ¡Inauguración de la segunda escuela! #FundacionAdentro https://t.co/OhV0BBmyH3 RT @INFOMUNDOARJONA: #LunesDeLaborSocial Notiarjona Argentina Delegación Córdoba colaborando con el comedor \"Un Mana del Cielo\" https://t.c… #FrasesArjona #41 https://t.co/QhqUZdRdAm https://t.co/6KTcQ7vtOi.       PUENTE. (WT) 3 confesiones para una noche Una de mis favoritas, la que me hace llorar y mi triste inglés No es de long es The long An winding road.  Jaja Y que de long and winding roads Es la unica cancion que me hace llorar? Sweet home Alabama.  Alguna vez les dije que era de mis favoritas? https://t.co/uzPEqJP281 @irisasselbon @notiarjona Nadie sabe a donde van a parar las palabras. Beso grande linda y que no se arrepienta nunca. APAGUE LA LUZ Y ESCUCHE se termino hoy y es tan el inicio. (WT) #FrasesArjona #40\n¿Se acuerdan de esta canción? https://t.co/OgBRVOqlpt Apaga la luz. https://t.co/woxBhZmKLx El que mira al cielo, entiende el suelo. @DJIGlobal https://t.co/9qtxV7ShrL #FrasesArjona #39 https://t.co/Vfzd63kHp9 #FrasesArjona #38 https://t.co/xZd2c8wjnL @Fund_Adentro @gaby_moreno @Tommy_Torres Gracias Gaby, gracias Tommy por un dia en familia. Ya casi termino. Si me quedo me tardo. Les dejo un beso y el titulo del nuevo disco que ya se los dije. @DeniaElvi Animo linda. No pasa nada @evelinvallejos3 @notiarjona jajajajajajajjaja   besito linda @notiarjona CANTAUTOR no se llamara así . Radionovelas de la abuela en la XEW, y despues la musica de la época . @larubia56 Por Dios rubia, como se entera usted de esas cosas. Me asusta En un radio de onda corta  escuchaba mi viejo las canciones que años despues me enseño, el programa se llamaba APAGUE LA LUZ Y ESCUCHE APAGUE LA LUZ Y ESCUCHE @GaleriaCaribeRD @stefanie_cortez MUY BIEN........ ASI SERA. APAGUE LA LUZ Y .................. #FrasesArjona 38 https://t.co/0kAIz9ZwKa #FrasesArjona 37 https://t.co/rOrmQtFEVK NADA https://t.co/fwufdUYW8A Nada en los últimos muchos años tiene el nivel de BUENA FE \nhttps://t.co/B4l2AWonsv @GarridoVal Esa dejo de ser una premonición . deja poner en tu ombligo\nlas cosas que digo\ncon tal de que entiendas. Apaga la luz @notiarjona besito Ya se que no es hora de saludar. Pero nunca es tarde para decir que se les quiere y que apagar la luz podría ser una premonición . #FrasesArjona 36 https://t.co/WIVGnLQ2Pc RT @INFOMUNDOARJONA: Buenos dias! Hoy es #MartesCreativo y nuestros miembros nos sorprenden. Muéstranos tu creatividad. #MundoArjona https:… RT @Fund_Adentro: ¡Desde Adentro brota hoy agua en el Ixcanal! Para los niños y sus familias https://t.co/w99TyM2OBz RT @Fund_Adentro: ¡Desde Adentro brota hoy agua en el Ixcanal! Para los niños y sus familias Si no enseñas .... No aprendes . https://t.co/oEoqSjOIX9 #FrasesArjona\n35 https://t.co/iOClVFbCiT Lo poco que tengo es tan poco que no hay quien me ordene. #FrasesArjona 34 https://t.co/LHPYxMzsN3 @notiarjona salud y gracias. RT @notiarjona: #Salud #Guatepicnic https://t.co/bZv0d37MRa Gaby, Gaby. Paisana,  usted una vez mas el mejor regalo. A las SoundBirds mi agradecimiento. Besos linda y gracias. https://t.co/mKNm0gNBoI #FrasesArjona 33 https://t.co/FIsKyQD2m8 Gracias anticipadas a todos. Saben que los quiero. Y a los que no le pongan número, mi gratitud y corazón entero jajaja.Empezando a vivir. !!!!!!!Quién diría !!!! https://t.co/ipsFp4AZlp RT @Fund_Adentro: HOY se llenó de alegría la escuela Nohemí Morales de Arjona en el primer día de clases!!! Bienvenido el 2016. RT @Fund_Adentro: Con emoción de regreso a clases! #FundacionAdentro\n#Elcambioestaentusmanos https://t.co/766Z3pauiX Salud a las memorias y saludos a lo que está por venir. \n#Tbt\n(WT) https://t.co/8DTBJ2bwHC #FrasesArjona 32 https://t.co/Jh5xit4MNI RT @Fund_Adentro: Y así damos por inaugurado el ciclo escolar 2016 en la Escuela Nohemí Morales de Arjona! #Elcambioestaentusmanos #Fundaci… 1994\n\n(WT) https://t.co/m31EvrYC2w RT @LatinBillboards: ¿Cuál es tu canción favorita de @Ricardo_Arjona? https://t.co/O6Hh8Mtf4f #FrasesArjona 31 https://t.co/lKsjk9B2JA Mi agradecimiento inmenso por este 2015  Mucha vida para todos.  Que el 2016 nos sorprenda felices #FrasesArjona #30 https://t.co/gQA5tKxoiN !!!!!!!!!!Feliz Navidad !!!!!!! RT @notiarjona: Querido Amigo @Ricardo_Arjona Muchas Felicidades!!!\nSe te Quiere https://t.co/sMd7dV0NJL RT @notiarjona: #Notiarjona les desea muchas felicidades! Capital Federal Última reunión del año 2015 @Ricardo_Arjona https://t.co/2r73eiXe… #FrasesArjona #29\n(WT) https://t.co/XR0jBbcwzi @Fund_Adentro Orgulloso de ustedes y del trabajo extraordinario que se ha hecho. La educación es el mejor regalo. RT @notiarjona: Santa en la escuela Nohemí Morales de Arjona #FundaciónAdentro @Ricardo_Arjona #Navidad2015 https://t.co/OfOMNWARq7 Me regalo de Navidad mis canciones como siempre las soñé. Pa ustedes será el regalo de año nuevo https://t.co/aUm305iPcd RT @Fund_Adentro: https://t.co/dP2ssVAtCe #FrasesArjona #28 https://t.co/iNKW9y8VhS #FrasesArjona #27 https://t.co/tmUT061vhp Gracias America Latina  por hacer posible este viaje. Amores que se gastan con el uso merecen libertad  y descansar. https://t.co/mBAIrELY7r RT @INFOMUNDOARJONA: Misión cumplida! #AmancayHerrera ya tiene su premio #MiembrosFelices #MundoArjona #ViveLaExperiencia @Ricardo_Arjona h… Los testigos del Viaje completo. Emociones inexplicables. Gracias a todos. \n#ViajeTour #ViajeTeam \n(WT) https://t.co/SprzX3KUA5 Minutos\nSon la morgue del tiempo\nCadveres de momentos\nQue no vuelven jamás.\n#ViajeTourLaDespedida una noche única.WT https://t.co/i2soZtft7P El Taxi llega a su destino final.\n#ViajeTourLaDespedida \n(WT) https://t.co/UzRtGa9LU7 Es difícil saber que este es el último concierto de esta gira. Escogimos esta ciudad por varias razones.#LaDespedida https://t.co/zkZRvasazy Cuando fue la última ves que te quisieron tanto... Argentina.\n#ViajeTourLaDespedida\n(WT) https://t.co/j4LTwgaCJp RT @INFOMUNDOARJONA: Un día de celebración total para todos, en especial para @notiarjona Lo logramos! @Ricardo_Arjona #20Aniversario https… RT @INFOMUNDOARJONA: Hoy se vivió mucha emoción en #GuayanaBar Todos unidos por @Ricardo_Arjona Lo mejor está por venir... #LaDespedida htt… RT @INFOMUNDOARJONA: Lo que ocurrió hoy es histórico... Todo es posible en la vida. #LaDespedida #Vélez #ViajeTour @Ricardo_Arjona https://… La despedida Argentina del viaje. Nos trajimos a Buenos Aires al escenario.  Hoy, la ultima noche (WT) https://t.co/baAVHbnxMP Argentina. SIN PALABRAS. Se los resumo en argentino. USTEDES SON LO MAS.  Los quiero Hago apnea desde el día que no estás.Gracias 🇦🇷 Segunda y última función de #LaDespedidaViajeTour mañana.¡Listos!\nWT https://t.co/Z13W29PiH1 Primera función Velez. Momentos nunca antes vistos. #LaDespedidaViajeTour #ViveLaExperiencia \n(WT) https://t.co/vYdMsYLEsE Encontrar el punto exacto donde explotas al amar. #LaDespedidaViajeTour #ViveLaExperiencia (WT) https://t.co/oVFybbP3yH Llego la hora señores. Sentados y poniéndonos cómodos para este Viaje.#LaDespedidaViajeTour #ViveLaExperiencia\n(WT) https://t.co/wPbirNSM2V Ensayando como si fuera el comienzo. Ha llegado la hora. #ViajeTourLaDespedida \nun Viaje nunca antes visto...\n(WT) https://t.co/NaFzXmVdrL Será el viaje de la historia porteña desde sus primeras canciones y la despedida de este último tramo. (WT) https://t.co/d714oRMzc2 #FrasesArjona #26 https://t.co/YLXZo6vD8m La#MaletaViaje hace su ultimo recorrido…Mañana por las calles de Buenos Aires.¿Cual debería ser la primera parada?WT https://t.co/wBneyMQBcx Noche inolvidable.Siguiente parada..Estado Vélez 4y5 de diciembre La Despedida.#ViveLaExperiencia#NuncaAntesVisto WT https://t.co/yQJlCQIxnl La Bicicleta ha llegado a Junín... Pedaleando hasta morir...\n#ALaLunaEnBicicleta #ViajeTour\n(WT) https://t.co/jB9n3jzYi4 @claudearjona jajajajajajajajaja. Yo te invito linda RT @INFOMUNDOARJONA: Si los sueños se cumplen! @karenagustinaR Nunca pensó que llamaría la atención de @Ricardo_Arjona con su tweet :) http… El barrio de Boca y lugares significativos de esta historia aparecerán como marco a esta despedida porteña. (WT) https://t.co/8LD27D0zUJ RT @Fund_Adentro: ¡A JUGAR SE HA DICHO! GRACIAS Lignum por no dudar en apoyarnos. https://t.co/qnQ1vtQa7E RT @INFOMUNDOARJONA: #LaDespedida 4 y 5 en #Vélez https://t.co/ZelsvcO8tW @Ricardo_Arjona Gracias Santa Fe, Argentina 👏 https://t.co/Et9h81Ke4u @chikifierce @notiarjona Felicidades Rafa @FelicitasAmaya Linda. Usted y Benicio serán mis invitados. Abrazo. Gracias Santa Fe, Argentina 👏 https://t.co/VOITVtnS6U RT @INFOMUNDOARJONA: #SantaFe cantando todos juntos...  👏🏻👏🏻👏🏻 3ra parada #LaDespedida  #MundoArjona #ViveLaExperiencia @Ricardo_Arjona htt… El taxi ha llegado a Santa Fe...\n#ViajeTour #ViveLaExperiencia\n(WT) https://t.co/oBRba8zqLy RT @NiuverOfficial: https://t.co/TMU9KpTdbu RT @INFOMUNDOARJONA: Como deshacerme de ti, sino te tengo... 🎧🎤 2da parada #VillaMaría energía increíble! #ViajeTour #ElProblema 🇦🇷 https:/… Gracias Villa María por la emoción. Junto con la  #MaletaViajeTour pasamos por Villa María, Argentina.\n#ViveLaExperiencia #ViajeTour\n(WT) https://t.co/JarQdilQx0 #FrasesArjona #25 https://t.co/xM1pnKz1Tk El staff de Viaje ensayando como si este final fuera un principio. #ViajeTourLaDespedida #ViveLaExperiencia (WT) https://t.co/m2fB7Faxb8 El último tramo de este Viaje que nos a llevado a muchos destinos regresándonos a ustedes Argentina. #Tucuman https://t.co/jpVwWADhEs Baires. Buenas noches @letysirias @notiarjona Mandarme una campera para este verano. jajaja @notiarjona El sur con sus encantos y sus noches frías de verano. No soy mas que el mismo flaco....de siempre @notiarjona Se acuerdan de mi?  aquí estamos Otro músico más en la familia? !!!!!!!!!Nooooooooo!!!!!!!! https://t.co/hHyGrK4NVo Oportunidad única para retomar nuestra historia de más de 20 años y decirle adiós a este viaje. (WT) https://t.co/qrEZye4cnV Mate y lluvia, Buenos Aires de testigo.Llegamos  A prepararnos para este final que se parece tanto a los principios https://t.co/9pKSf519Vg Cuando volveras a ser lo que no fuiste nunca. #FrasesArjona #24 \n(WT) https://t.co/rOnwu4G5Cq BAIRES Volvimos a empezar para despedirnos Ensayando como si fuera el principio. Estación retiro bandoneón, caminito. Así nos tienen. Gracias por la noche Perú. Que se repita. 👏\n(WT) https://t.co/8aXan9Uj6K Peru después de 3 años de ausencia nos reencontramos y el #ViajeTour arranca.\n#Lima#Peru\n(WT) https://t.co/kASbd97Bt6 La #MaletaViajeTour llegó a la Plaza San Martín.\nAlcánzanos si puedes...\n#Peru #ViajeTour\n(WT) https://t.co/0HnfnAabX2 Entre bruma, tiraditos, rocoto, un libro de Vallejo y amigos de tantos años. Llegamos Perú. #FrasesArjona #23\n(WT) https://t.co/loDhyog9oT Me voy para hacer algo que es lo único que se hacer para acercarme de nuevo a ustedes. Buenas noches. @artedeleon jajajajaja. Beso grande linda @gisellebluefile jajajajajajajaja algo hay de eso.Se les quiere y las maletas se desarman para volverlas a armar. Los quiero @eclipse1708 @vilcalzetta Eclipse. Este psicoanálisis cibernético ya me esta asustando @SolMariam36 Ya esta Sole, copiado. Empezaremos a ensayarla @notiarjona con esta bendita y maldita mania de verlo como un principio Así me preparo Hay tantas cosas que no se y me da por irlas a buscar RT @eclipse1708: @Ricardo_Arjona Ricardo sos reservado,no confias con facilidad, + d una vez pareces frio, etc.aún así yo creo en tu interi… @Luces_ECpe ni una sola palabra de esta entrevista fue respondida por Ricardo Arjona. Lamentamos los inconvenientes   (WT) Fuiste tu...\n#FrasesArjona #22\n(WT) https://t.co/qjdFEXnhJi Perú. Vuelvo siempre en cada parte del mundo donde te encuentro. En unos días, a la sede del sabor y a cantarte  como la primera vez Así o mas feliz. (WT) https://t.co/xFZyldirGv #FrasesArjona #21\n(WT) https://t.co/s5SWAEs63R RT @adriaarjonaa: La princesa encontró a su rey en Budapest. Colorín colorado este cuento.... Solo está empezando… https://t.co/feZL5zam8D Guitarra, guitarra,guitarra. Así suena París. Apago la luz y escucho. Grabando por todos lados. Taxi, a donde ahora? https://t.co/1pnytQRaJX Ingresa a través de https://t.co/jzMLHteoHc\n(WT) https://t.co/FvxNkuvMvo Algo se está fraguando. (WT) https://t.co/KwVKmPzQuQ #FrasesArjona #20\n(WT) https://t.co/KM7wZxRkLJ VIAJE\n(WT) https://t.co/q5Pqt4QsvL A un mes de volvernos a ver. Ningun tiradito en el mundo sabe igual como el que se comparte en Lima. Para allá vamos Peru . Gracias Argentina. Un dia mas. Pa despedir esta fiesta, este año,  esta historia y empezar una nueva. Se les quiere. @karenagustinaR JAJAJAJAJAJA Te puedo invitar?????? me encanto. Un abrazo Señores nos quedamos un ratito mas. Se abre la segunda función.\n¡Gracias Argentina!\n#ViajeTourLaDespedida \n(WT) http://t.co/hRQ0zlReWL #FrasesArjona #19 http://t.co/dV5G9IKya2 ¡Gracias Argentina!\n(WT) http://t.co/oFLtwUXa0G Y volar a donde sea...\n#FrasesArjona #18!\n(WT) http://t.co/IWvSB2EAfG Dame...\n#FrasesArjona #17\n(WT) http://t.co/pxSbbuTkl4 ¡Al Fin!\nDespués de muchos meses de espera, el #ViajeTour llega a Lima, Perú.\n(WT)\nhttp://t.co/fhI0WHVXw3 http://t.co/orBrW72QcV Tu tienes alas que vuelan poco. Yo tengo sueños que no aterrizan. http://t.co/MSqN3SHftF Ser un animal nocturno era una bella rutina. #TBT\n(WT) https://t.co/OvhIVjWYvU Vamos aclarando el panorama...\n#FrasesArjona #16\n(WT) http://t.co/UtlznWii7F Tiempo récord! En menos de 1hr se vendieron las 100 membresías Mundo Arjona en Buenos Aires! #ViajeTourLaDespedida.WT http://t.co/DWBXb53O98 LA DESPEDIDA DEL VIAJE TOUR.\nBoletos a la venta hoy mismo desde las 6pm! \n4 de diciembre,Vélez!\n#ViajeTourLaDespedida http://t.co/TlJP6dIWxT 5 Años viejo. Y parece que no te fuiste nunca. Te quiero padre. Muchos dicen que es el mejor concierto que han visto.\nOtros todavía no lo han visto.\nFinalizamos el Viaje en Velez.WT http://t.co/5JpxcsfWbV #FrasesArjona15 http://t.co/S5lDhHfqj0 Este viaje que nos llevo por todas partes terminara en diciembre en BUENOS AIRES, Vélez, como si fuera un sueño Ultimo concierto y despedida Es algo único poder compartir con un pedacito de cada cultura latinoamericana en un solo país.\n#ViajeUSA #Orlando(WT) http://t.co/yo5bdoAFeG RT @campelloricardo: Que honor ver al maestro @ricardo_arjona utilizando mis lentes campelloeyewear !… https://t.co/9MmscEdar7 Maestro José José   Gracias por venir de sorpresa. Admiración y respeto de siempre. (WT) http://t.co/FYnbpJnKWA LIVE on #Periscope: @BillboardLatin Q&amp;A https://t.co/yUVmU1khqj LIVE on #Periscope: Fans Q&amp;A @BillboardLatin https://t.co/hmQwuLFm2V LIVE on #Periscope: Mujeres https://t.co/wf4HdQnhiS LIVE on #Periscope: Minutos https://t.co/j0qzo2lSzG LIVE on #Periscope: Comenzamos con el acústico que canción quieres? https://t.co/1FKVE9KVEi LIVE on #Periscope: Puente https://t.co/9HE5hRzBnU Miami hemos llegado 🚕.\n#ViajeTour #Miami\nEn Vivo Por Periscope.\n(WT) http://t.co/yCUb2eeiYC LIVE on #Periscope: Nuestra señora https://t.co/lvYO7q5Y6N LIVE on #Periscope: Señora https://t.co/1byBozuWNx LIVE on #Periscope: Historia De Taxi https://t.co/Zqinzv6z8A LIVE on #Periscope: Cavernícolas  https://t.co/upBkpJfBD0 RT @billboardlatin: Estamos buscando a la persona que más lejos se encuentre dentro del AAA en el concierto de @Ricardo_Arjona envía foto a… RT @billboardlatin: Envíanos tu foto desde tu ubicación en el concierto de @Ricardo_Arjona utilizando #vivelaexperiencia, esta noche tenemo… http://t.co/inxDnaHITV LIVE on #Periscope: Sound Check https://t.co/YTp6BCKr5c Prueba de sonido.\nEn Vivo por Periscope.\n#MaletaViaje #ViajeTour #Miami @billboardlatin (WT) http://t.co/H19y8UbbU4 LIVE on #Periscope: Prueba de sonido! https://t.co/U4ZbdFittc La #MaletaViaje ya esta a la espera de su llegada Miami. (WT) http://t.co/U93sb5ofiZ LIVE on #Periscope: Comenzamos  https://t.co/qP1BqCO8fy RT @LatinBillboards: Ya comenzó nuestro #Periscope takeover con @Ricardo_Arjona pendientes en la cuenta de periscope de Arjona http://t.co/… Esta noche.\nEn vivo por Periscope.                   #billboard #viajetour \n(WT) http://t.co/CFHLFUmL2Z El problema no es cambiarte el problema es que no quiero.\nBuenas noches Atlanta.\n#ViajeTour #Show102 (WT) http://t.co/BXgNcO7Vae @Ohknataly vengase para acá de inmediato.  Yo la invito. Ya deje dicho en la puerta   Corra. #FrasesArjona #14 http://t.co/NFt1HHJLqu RT @INFOMUNDOARJONA: #MundoArjona celebra con #Notiarjona sus #20Años 🎉🎉🎉 Gracias por tanto!!!! #TeamArjona #Argentina #Metamorfosis #Fans … NOTIARJONA 20 años. Nos estamos haciendo adultos. Gracias por la solidaridad en las buenas y en las malas. Se les quiere. Vamos por 20 mas Alguien esta buscando algo. (WT)\n@DJIGlobal http://t.co/VMHPRjj5lx \"Hoy es un buen día para empezar,\nhacer borrón cuenta nueva y dejar todo atrás.\"\nBuen comienzo de semana. \n(WT) http://t.co/khA3oUKgn9 @notiarjona A ninguna le gusto mucho mi cocina. Pero verlas, como siempre, fue muy especial. 20 años ameritan un nuevo intento, nuevo menú. Vamos por más.\n(WT) http://t.co/yzRcuXZT1R #FrasesArjona13\n(WT) http://t.co/BfjLSjkMqK Te vi me viste,\nnos reconocimos enseguida pero tarde... \nSin Daños a terceros.\n#ViajeTour #newjersey #ViajeShow101 http://t.co/kUcPx90WZb Gracias!\nShow #100\nMuchas emociones distintas.\nFuerte abrazo.\n#ViajeTour #vivelaexperiencia \n(WT) http://t.co/0hHbwwUcWf LIVE on #Periscope: Salida https://t.co/2FJ0Wz82VZ LIVE on #Periscope: Mujeres https://t.co/7BV5rxdwr9 Te quiero.\nShow #100 #ViajeTour\n(WT) http://t.co/v2A0PETx9o Acompáñame a estar solo.\nShow #100\n(WT) http://t.co/8Z8voCHKfI LIVE on #Periscope: Señora https://t.co/DmZSspd4jx Comenzó el show #100 Nueva York. Con la #MaletaViaje presente.\n#ViajeTour http://t.co/9jUpK4Sadu LIVE on #Periscope: Taxi \n https://t.co/Ne3S1JWlZt LIVE on #Periscope https://t.co/uytVRTplBo LIVE on #Periscope: Comenzamos MSG https://t.co/ASIMsT01CG http://t.co/2jPGoT3TKm LIVE on #Periscope: Tanta calma anuncia un tormenta https://t.co/voleG3oVBz La maleta Viaja por el Subway de Nueva York.\nEn Vivo por Periscope.\nEncuéntranos si puedes!\n#ViveLaExperiencia http://t.co/YnqufLFgoP La #MaletaViaje a llegado a Time Square.Síguenos en vivo por Periscope.Ahora para donde?\nEncuéntranos si puedes!\n(WT) http://t.co/iKgApowdvb De esta manera comienza el VIAJE por muchas culturas reunidas en solo país. (WT) \n#ViajeEstadosUnidos #Connecticut http://t.co/AZ28BiXwy2 Mañana en vivo por Periscope.\n No se lo pierdan! \nComenzamos por las calles de Nueva York, pero no termina ahí.\n(WT) http://t.co/H3Rize42Va A días del show #100 \nEstán listos! \n#ViajeTour #ViveLaExperiencia\n(WT) http://t.co/RobzkCmPS0 Sábado por Periscope,\nLos mejores momentos del concierto #100 En Vivo.\nPendientes a Twitter.\n\n(WT) http://t.co/DEFokoXwiO #FrasesArjona #12 http://t.co/Fs91pt6xgj El Viaje Tour llega a su fecha #100 en el @madisonsquaregarden \nSerá un día muy especial, con muchas  sorpresas.\n(WT) http://t.co/nJWzn8Ezfe Viaje Tour acompañado por su #MaletaViaje vuelve a Estados Unidos.\n(WT)\nhttp://t.co/uuNaUyu41B http://t.co/9XSCmywEnU Donde no hay honor, hay caos. http://t.co/cschN1c2Gy #FrasesArjona #11\n(WT) http://t.co/5hdRe0Y4r8 Gracias Santo Domingo por la noche y la energía.  Se les quiere. Otra noche eufórica, gracias.\n#ViajeTour #SantoDomingo \n(WT) http://t.co/1F3ZXb9ku3 Comenzamos. \nA La Luna En Bicicleta.\n#SegundaFunción.\n#SantoDomingo #ViajeTour \n(WT) http://t.co/JuOwKObJVr @SorDestruccion @Gepersopon Siempre es bueno saber que por lo menos alguien entendió . http://t.co/bSqMlQxtym Extraordinario lo suyo Santo Domingo.\n(WT) http://t.co/HnrmTDl8Rf Comenzamos, sin gana de parar.\n#ViajeTour #SantoDomingo \nPrimera función.\n(WT) http://t.co/aUkFHYpJRL Mis amigos de Boca Chica se acordaron de mi.  Pura energía   Vamos con todo. http://t.co/A18FjUpvLZ La #MaletaViaje hace su primera parada #ElObelisco ¿Cual debe ser la segunda?\n(WT) http://t.co/jQl2zFa8Pt Dominicanos. Estamos aquí pa lo que quieran.   Felices de estar en su tierra. Frase #10 \n(WT) http://t.co/ltdvD7jZlh RT @vivoguatemala: De #Viaje por tu figura.... #MartesCreativo @INFOMUNDOARJONA @Ricardo_Arjona @chikifierce http://t.co/soAJ5SqECp (WT) http://t.co/7abtE4j68y 🌊🌅\nMi Pais.\n(WT)\n @DJIGlobal http://t.co/Dh8YeyIeNV \"Galería Caribe\"\nCuando fue la ultima ves que te quisieron tanto...\n#RepúblicaDominicana #TBT #ViajeTour \n(WT) http://t.co/YjhQZvQFZ6 ¡Histórico!\nPor primera ves 3 Palacios De Los Deportes. #ViajeTour #ViveLaExperiencia \nVamos por mas!\n(WT) http://t.co/Qjp4kuyt2c Viaje\n#FrasesArjona #9 http://t.co/Y5mbcwPpKt Un honor compartir con los constructores de la segunda escuela de este sueño de educación para nuestra Guatemala. http://t.co/RhzrxWkATd RT @BuenaFeAr: Disponible en todos los formatos digitales disco #SOY #Metamorfosis #Argentina @iTunesMusic @amazonmusic @GooglePlay http://… Gracias Puerto Rico por tanto. Noche enorme por su culpa. @Tommy_Torres Abrazo grande Tommy Mi boricua, mi india mi amor\nmi asignatura pendiente...\n@Tommy_Torres\n#ViajeTour #MomentosÚnicos\n(WT) http://t.co/dPqfJ7RIQF RT @notiarjona: Ya está elegida la #Señora  https://t.co/cqzUJNg32l Comenzando el Viaje 🇵🇷.\n (WT)\n#ViajeTour#PuertoRico#MaletaViajeTour http://t.co/t5yYkFPzuI La #MaletaViajeTour ha llegado a Puerto Rico\nA horas del comienzo. \nEstamos listos?\n(WT) http://t.co/lQOCAFJoWr Llegamos Puerto Rico. http://t.co/oPow1o7sxb Quiero.\n#FrasesArjona #8 http://t.co/qZeqFv5tAu Nadie envía a su hijo a examinar con un pediatra pederasta.  Seamos igual de rigurosos a la hora de votar. Es un país lo que se entrega. Más de un año de emociones distintas,\nemociones inolvidables. El #ViajeTour continua... \n(WT) http://t.co/UBdVvIMdd1 Recuerdos únicos. Puerto Rico a solo 5 días de reencontrarnos una vez más. El  #ViajeTour a regresado.  (WT) http://t.co/cv9jf3xGH7 Hoy es el aniversario oficial del Viaje Tour.(WT) \n#1Año#MasDe90Fechas\nY seguimos... http://t.co/IuAX5GeFUE Te Juro.\n#FrasesArjona #7 http://t.co/PQn5Eg5Mzi Que hace un lunes en verano...\nY que estoy haciendo yo?\nSin ti.\n(WT) http://t.co/DAkb0vQNCk 6 Millones! \nGracias hermanos se les quiere. (WT) http://t.co/gZkDo7sbi1 @bebymerce Mercedes. Le mando un beso grande y otro al grupo. Usted sabe quienes son. @cristm03 Doctora mis felicitaciones y mi respeto.  A curar se ha dicho El problema es lo que callas...\n¿Tu que callas?\n(WT) #TBT http://t.co/nlt78VVXxB Del Otro Lado Del Sol ☀️.(WT)\n#Historias#FrasesArjona #6 http://t.co/YWDf4Fjeyt La gira latinoamericana más importante del mundo llega al caribe #PuertoRico Agosto-7 #RepublicaDominicana Agosto-22 http://t.co/En5A4JLGkT Santo Domingo.  Para allá vamos. Mas cerquita que nunca, como debe de ser. Mi boricua, mi india, mi amor. Mi asignatura pendiente.(WT)\n#PuertoRico#7DeAgosto http://t.co/82KdewmzU9 #FrasesArjona #5 (WT) http://t.co/EvAVMpgMZ4 El Viaje regresa a la Isla Del Encanto.(WT) #ViajeTour#PuertoRico http://t.co/btY62lvXsm Mis condolencias a la familia de Joan Sebastian y al pueblo Mexicano por la perdida de un grande. Así nos despedimos, Colombia lo suyo es algo único.(WT)\n #ViajeTour http://t.co/r4wA6DKqoQ 👏 http://t.co/IvWCeRz186 👏 http://t.co/gpVoj6PMup Después de un par de aguardienticos veremos que es lo que pasa Medellín.(WT)\n#ViajeTour#Colombia http://t.co/QTu0u1SYhq @notiarjona @INFOMUNDOARJONA @Fantastica969 Todo listo Medellín   El Paisa de Guatemala, ya llego.  (WT) http://t.co/6OeTGg1V59 Cerremos con algo interesante.La inocencia no muere con el tiempoLa mata la realidad. Quien mata la realidad se arruga pronto de tanto reír. @KarinRiquelme1 Claro que si. Te mando un abrazo grande. @BrendaOsotin si linda. Claro que si @gisellebluefile Me acuerdo de usted. Como no. @RobHer10 Aqui estoy campeon. Hay conciertos que no te dejan dormir. @gisellebluefile A usted le mando un beso belleza. @ArianaM2 Me dijo me llamo Ariana, mientras cruzaba la pierna. @notiarjona NOTIARJONA Prometo volver lo mas pronto que se pueda y si no se puede,  prometo volver igual. Se les quiere Argentina @Agosto17_12 Hola Amanda. Pereira. Gracias por la noche. Lo poco que queda de mi, brindará a su salud. Y a la de Colombia. Si señor. Pereira el taxi a llegado a su destino. #ViajeTour http://t.co/pyAiS5h4f2 Pereira. Tocando tierra. http://t.co/lflYM1yVQ2 Confirmado Pereira (WT) http://t.co/gk5RraSiXu Les seguiremos informando (WT) http://t.co/K24hA4mf0Y #FrasesArjona #4 http://t.co/sEFIcJN7if Bailando y cantando hasta no poder mas. Karaoke Cali Mundo Arjona.\n#MundoArjona #ViveLaExperiencia #Cali #Colombia. http://t.co/sPfSUBVuS7 Luego, seguimos con nuestro segundo Karaoke Mundo Arjona en Cali,  Colombia. Donde nuestros miembros… https://t.co/FSRuxZVIGE Una semana llena de eventos para nuestros miembros #MundoArjona.\nEmpezamos con un viaje divertido en… https://t.co/p2m4u9cbgS Noche muy especial aquí en Cali.\nEmociones únicas. Gracias.\n #Cali #Colombia #ViajeTour (WT) http://t.co/QtaYranFzt El micrófono está puesto y\nCali se sube a la experiencia #ViajeTour (WT) http://t.co/meHAeDHDoz El micrófono está puesto y\nCali se sube a la experiencia #ViajeTour (WT) http://t.co/3QHHURmwYh Momento especial, Jorge pudo convivir un rato y explicarnos los detalles que lleva armar la maqueta. (WT)\n#MomentosMA http://t.co/qUuEgngZQW Momento especial, Jorge pudo convivir un rato y explicarnos los detalles que lleva armar la maqueta. (WT)\n#MomentosMA http://t.co/LHg9TYpeDg Sobre los últimos 6 años Luis y su hermana han creado maquetas impecables de las escenografías de… https://t.co/1naLj3oHOt Estadio El Canpin.\nRealmente no estoy tan solo.\n(WT) http://t.co/m723mEukvP Uno sabe que esta en Bogotá cuando esto es lo primero que le da la bienvenida. Una sopa de ajiaco. (WT) https://t.co/0IVIp3CDBc Campin Bogotá.  El cantante se esta preparando    Felices de volver a este país. http://t.co/CzbzS4iVVC Escala en mi tierra. La luna chapina, la mejor de todas. nos vino a saludar .  Colombia, está noche con ustedes. http://t.co/7XB0kNwSSj #FrasesArjona #3 \n(WT) http://t.co/1bAvRtm2at \"Me enseñaste de todo excepto a olvidarte.\"\nColombia estaremos con ustedes en sólo cuatro días.… https://t.co/QY93tDB6g3 Grande Paraguay. Fronteras. Como líneas de la mano. http://t.co/MlZijD4brH Fronteras. Como líneas de la mano. http://t.co/LNJV8Zsxtu RT @NoraElenaDuarte: El estres, la corrida,la remojada, la espera, el gasto, y posiblemente la enfermedad. Tooodo definitivamente valio la … Gran noche Hermosillo.  Se les quiere Hermosillo aquí estamos. Si la lluvia nos deja, vamos con todo. RT @claudia25717701: @Ricardo_Arjona @notiarjona queremos que vuelva pronto http://t.co/UzlwLjn5TQ Últimas paradas del #ViajeTour en México.\n#Hermosillo #Ensenada les toca a ustedes. (WT) http://t.co/7RjmfjRGRk A llegado el miércoles. (WT)\n#FrasesArjona #2 http://t.co/mHqjJbASGz Gira Latina #1 EN El Mundo!\nPara ver fotos y detalles emocionantes! Accede al Link! (WT)\n http://t.co/zWOtXwNtXg http://t.co/RGlIwKGBXz Feliz día del padre viejito. Donde quiera que te encuentres http://t.co/1mVyOrhEOt Feliz día del padre. De parte de las 3 personas que mas te quieren en este universo. (WT) http://t.co/bHLZRvXqe7 Que nadie vea...\n#Tbt http://t.co/1zns81epBO Llegamos hermanos!\n500K seguidores en Instagram. \nVamos por el Millón. (WT) @ 🌎 https://t.co/plKDNxrBqa Desde hoy cada miércoles será un miércoles de frases. #FrasesArjona\n(WT) http://t.co/DabrA70Xx3 #Repost @infomundoarjona with repostapp.\n・・・\nQue no dejarías de colocar en tu #MaletaViaje ???… https://t.co/fd7uYyfn6h Cuando fue la ultima vez que te quisieron tanto. #Pachuca #Culiacán #Hermosillo #Ensenada. Ya vamos.… https://t.co/CC9ApD9WEj Un salto que viajo por todas partes.        🏀  #TBT 🏀(WT) https://t.co/BsHuz2j5sJ Recuerda elegir siempre tu TAXI favorito... Ellas si supieron escoger! Que es lo que hace un taxista… https://t.co/GHUslgnFtG Gira Latina #1 En El Mundo, y a este #Viaje le falta mucho mas por recorrer.… https://t.co/5HmvowurNt Niños Jugando. (WT) http://t.co/mNURsja4tu Quien te dijo que yo\nEra el sueño que soñaste una vez,\nQuien te dijo que tú\nVoltearías mi futuro al… https://t.co/0x9FBpfPTV México \nel destino me pintó el camino \nque me trajo hasta aquí...@Auditoriomx #54 #ViajeTour (WT) https://t.co/TWFRkFLs5f Un sueño que se va de fiesta #Mexico #ViajeTour @Auditoriomx #53 @ Auditorio Nacional https://t.co/egF50kmzfo Un recuerdo al pasado. 52 fechas en el @Auditoriomx hasta este instante y dos más por venir.… https://t.co/k3NXHJ6mxY En camino ✈️. México nos vemos pronto... #ViajeTour (WT) https://t.co/yE8r6YpYQt Volver a Macondo. En el tren de la hojarasca. Colombia, para alla vamos. Un recuerdo al pasado. Ultimo encuentro que tuvimos @Auditoriomx  #ViajeTour Hay que reinventarlo México. (WT) http://t.co/qA7K6JErzr RT @INFOMUNDOARJONA: Karaoke Mundo Arjona! @recorcholis  #KaraokeMundoArjona #karaokeArjoniano *Revisa tu email y confirma tu asistencia* h… Continuamos México. Se parte de este #ViajeTour #MundoArjona #ViveLaExperiencia. Adquiere tu membresía.(WT) http://t.co/ruCr979A8Q Hay tanto a donde ir... #ViajeTour \n(WT) http://t.co/uGJMJYb13Z #Repost infomundoarjona with repostapp.\n・・・\nKARAOKE MUNDO ARJONA! Disfruta una noche cantando los… https://t.co/yeB3OytFMv RT @Fund_Adentro: Les compartimos un mensaje de nuestros niños en Fundación Adentro: ¡Te queremos Ricardo Arjona! http://t.co/QqrgSqyS6F \"Te quiero porque así es como te quiero\nTe quiero y sabes bien que me refiero.\" #Tampico #Mexico… https://t.co/z8SF9oOGQ8 #Repost infomundoarjona with repostapp.\n・・・\nEsta noche todos nos vamos \"A La Luna En Bicicleta\"… https://t.co/DSzo4vzk8z Descubre la sorpresa que recibió Rosalinda de parte de sus hijas a través de Redes Sociales. Ingresa… https://t.co/ccQ6E3yS5U Monterrey. Tanto que agradecerte siempre. Donde empezó todo. Se les quiere. \"Señora no le quite años a su vida póngale vida a los años que es mejor.\" Una historia inolvidable… https://t.co/Ke6znjV5NH \"El Reloj De Pared Anunciando Las 6:23\"\n#ViajeTour #PruebaDeSonido #Monterrey @ Monterrey Arena https://t.co/AHQebVEmge Hemos llegado. #Monterrey #Tampico comenzamos este #ViajeTour por México con ustedes. Listos? (WT) https://t.co/gdLzO5wQ70 Emociones siguen creciendo en este #VIAJE  sabiendo que nuestra gente de #México nos sigue invitado a… https://t.co/o9TwjOlRvx #Colombia pronto el #ViajeTour llegará a Bogotá, Cali y Medellín http://t.co/uuNaUyu41B (WT) Riega la voz (WT) http://t.co/rLGzY2RyWd Pocas cosas son mejores que compartir un habano Padrón  con mi querido amigo Don Orlando Padron. http://t.co/IohAVqwdVi Gracias Nicaragua se les quiere. Así cerramos este estupendo #Viaje por #CentroAmérica Gracias #Guatemala #Salvador #Honduras #Nicaragua (WT) http://t.co/toDxw9n87C Última parada de la maleta y del #ViajeTour en #CentroAmérica en el Estadio Nacional Managua Gracias  #Nicaragua (WT) http://t.co/M5guOGdXxS Y en esta ocasión la maleta viene acompañada! Por tres buenos amigos que forman parte del #ViajeTour (WT) http://t.co/d98MlHP5rB Segunda y penúltima parada de este  #VIAJE por #Nicaragua la maleta paró a visitar la cruz en el Volcán Masaya. (WT) http://t.co/YscsVJehtG #Nicaragua empezamos esta visita con un #VIAJE por la refrescante Laguna De Apoyo. #ViajeTour (WT) http://t.co/d3uLfrV4qk #Nicaragua están listos para el #ViajeTour ? (WT) http://t.co/AvSzRUAdWS #Honduras  se les quiere. #ViajeTour #Tegucigalpa #SanPedroSula (WT) http://t.co/PIncODqIS5 6 giras y nunca salí a cantar sin que lo ultimo que vea sean estos dos personajes. Tex y semilla. Amigos y amuletos http://t.co/2yVAMi8JBO Tegucigalpa gracias por la emoción Esta noche compartimos el show #80 de este #ViajeTour con ustedes Tegucigalpa. #Honduras (WT) http://t.co/d4C4uv862K Honduras estamos listos? #ViajeTour #Tegucigalpa #Honduras (WT) http://t.co/uMq6ftGVZb RT @INFOMUNDOARJONA: Honduras tienes tu #CartelViajeTour para esta noche? Compartelo con nosotros!! #Tegucigalpa #MA @Ricardo_Arjona http:/… Estar limpio es demostrar que  se esta limpio Nadie en ningún país debe de estar aislado de la obligación  de rendirle cuentas a la historia Hermanos Salvadoreños. Me llevo su emoción como energía para continuar. Una noche mágica El Salvador. Ahora el #ViajeTour llegará a Honduras. Están listos? #Tegucigalpa # SanPedroSula (WT) http://t.co/87VPP2M9SR RT @INFOMUNDOARJONA: @arjonaoficial #ViajeTour  rumbo a #Honduras Tegucigalpa #Mayo16 #ChochiSosa San Pedro Sula #Mayo17 #FCOMorazan #MA ht… El #ViajeTour ya ha llegado a ustedes! #ElSalvador (WT) http://t.co/xvfMg9HTuU Emociones inolvidables. #AquiEnElSalvador #ViajeTour (WT) http://t.co/33klsLKylb La #MaletaViaje se nos perdió. Ayúdanos a encontrarla. En que letra del SALVADOR esta? #AquiEnElSalvador (WT) http://t.co/Msc9jdFVTB Vecinos el #ViajeTour a llegado a su tierra #AquiEnElSalvador (WT) http://t.co/7gOHBSCKGy El taxi del #ViajeTour ya está en camino a #ElSalvador mañana nos vemos (WT) http://t.co/5lUvBtvkUt RT @INFOMUNDOARJONA: @arjonaoficial y #ViajeTour llegan a El Salvador!!! #Mayo14 #Metamorfosis #MundoArjona #Salvadoreños Están listos?? ht… Un año lleno de novedades, sorpresas y emociones. Siente el valor de ser parte de la experiencia #MundoArjona https://t.co/jlEdxPzn9Q (WT) Recuerdos del encuentro con las ganadoras del concurso Viaje a #Guatemala @INFOMUNDOARJONA #ViajeTour  (WT) http://t.co/mXqkAYaRkj Bendita tierra, bendita gente. Que te traten como te mereces Guatemala. Los quiero hermanos. Dos noches inolvidables #Guatemala #MiPais #ViajeTour (WT) http://t.co/itB3UrtaFD Y yo Ricardo de #Guatemala #MiPais #ViajeTour (WT) http://t.co/HVP4KmYeBp Dime si él te conoce la mitad #MiPaís #Guatemala #ViajeTour (WT) http://t.co/Q12xwXMY0m Guate estamos listos. Concierto #2. #Guatemala #MiPais (WT) http://t.co/bcv9vUdq6D Shhhhhh. Se durmió ???? http://t.co/P1F5uLxWGk RT @INFOMUNDOARJONA: Así llegaron a  #guatemala las felices ganadoras #viajetour #inguat  #copa #mundoarjona\n\nhttps://t.co/hhcAViwA6a #MiPais #ViajeTour #Guatemala https://t.co/G2pgIXUiHO (WT) RT @INFOMUNDOARJONA: Concurso exclusivo para Guatemala Participa ya! http://t.co/z9FQCGhdgo RT @INFOMUNDOARJONA: Textiles Mayas #LaFuente #AntiguaGuatemala #10Ganadoras #MundoArjona #ViajeAGuatemala  #ViajeTour https://t.co/MJUBfOS… RT @INFOMUNDOARJONA: Las ganadoras felices de estar en #AntiguaGuatemala #Inguat #CopaAirlines #CalleDelArte #MundoArjona… https://t.co/Uof… Llena de emociones la primera noche de #ViajeTour en el Estadio Mateo Flores #MiPais (WT) http://t.co/5BsKixXuzr Lo poco que queda de mi esta noche es todo de ustedes paisanos. #Guatemala #MiPais (WT) http://t.co/MXSLfeR67T Caminata al escenario. #MiPais (WT) http://t.co/PdHkcvMgfE RT @INFOMUNDOARJONA: La primera en llegar de las 10 ganadoras katy_zl instalada en su suite 🏨 Un sueño hecho realidad...… https://t.co/irUp… A unas horas de que el #ViajeTour llegue a #Guatemala. #MiPais (WT) http://t.co/y7dTcAUPGA El Mateo Flores ya esta listo para recibir el #ViajeTour #Guatemala (WT) http://t.co/rirTdSBXkN RT @INFOMUNDOARJONA: Las ganadoras del concurso están listas para viajar a #Guatemala http://t.co/2kpkfYchpE @Fund_Adentro #Guatemala #Elcambioestaentusmanos (WT) http://t.co/FyLDvp7cWZ RT @lilimonzai: @Ricardo_Arjona @INFOMUNDOARJONA #copa #viajetour #guatemala #inguate  alla voy Guate. Estoy Feliz!!!!!!! http://t.co/h1qdJ… Así se escuchó Fuiste Tu desde la Escuela Adentro (WT) http://t.co/ewfsoAzWxD Emociones y sorpresas se vivieron en la Escuela Adentro https://t.co/5fEUmziec3  (WT) Suplico a todo el publico Rojo q después de mi declaración mundial de que soy crema No devuelvan sus boletos para este fin de semana jajajaj Como cuando iba con mi viejo a ver a los cremas El me soñaba jugador Hoy juego a cantar http://t.co/t7ROkM6HdJ @Ricardo_Arjona mientras mas escuelas menos enemigos. http://t.co/QnNmGgCPKE Mi novia se me esta poniendo niña. Encontré un amorcito http://t.co/zQUSzuluzo Hay conciertos que no se olvidan nunca. De los mejores de mi vida. Los niños del Ixcanal fueron nuestro publico hoy http://t.co/tSQ7rWmOwQ RT @INFOMUNDOARJONA: Te enteraste de quienes son los ganadores del VIAJE a Guatemala con  @Ricardo_Arjona Arjona? https://t.co/37uEfqB4T9 #… Todo viaje vuelve a su origen.  Guatemala,  a una semana de tocar  tierra sagrada. La mía, la nuestra. @CristinaRuizGT_ belleza la veo en Guate. Quiere venir al concierto? Mucho talento , como debe de ser El viaje se mueve a la escuela El Ixcanal para darle clinicas y ofrecerles un recital a los niños. Gracias al staff por hacerlo posible. Feliz cumple mis bellezas. 20 y 25 de abril cuando se detuvo el mundo http://t.co/s1gyX29Mcs RT @norelysrod: 🎶Yo tengo el aire que respiro y el mar To'ito para mi...amores viejos y suspiros y si alguien dice… https://t.co/U511wlJvun Ni los Tepuy.petróleo,Amazonas y Los Roques juntos,se comparan al patrimonio de tu gente extraordinaria.Que el futuro los sorprenda unidos Te vas sin anunciar cuando me empiezo a enamorar #ViajeTour (WT) http://t.co/506yTZd7Gy RT @Fund_Adentro: Hoy, junto a la #ONU , celebramos un día en el cual reconocemos nuestra responsabilidad por promover la armonía... http:/… RT @campelloricardo: Con el maestro @ricardo_arjona - #windsurf#arjona# https://t.co/3Ke7uw7aMw Me enseñaste #ViajeTour (WT) http://t.co/tQwWcwjjSg Barquisimeto. Por su culpa este desvelo. Mucha adrenalina pa ponerla a dormir. Gracias por la energía y el esfuerzo. Gracias Caracas. Me hacían falta. Se les quiere. Llegamos en pocas horas a la parada del #viajetour en el Poliedro de #Caracas (WT) http://t.co/8XH0i9iOr0 Maracaibo, Valencia.  Gracias por el esfuerzo y la emoción   Se les quiere. Dos noches pa recordar   . RT @MetamorfosisMed: Ricardo Arjona lidera el ranking de los tours que más recaudan en Estados Unidos http://t.co/rbrIXAXcu7 RT @INFOMUNDOARJONA: Ricardo Arjona Leads Hot Tours Roundup With Stateside Trek | Billboard http://t.co/VAZVKiL9CL @MayNohelyth Yo la invito linda. La veo en el concierto #Venezuela estamos a pocas horas de llegar a nuestro próximo destino #Valencia (WT) http://t.co/m18bPgu7I9 Anoche en Maracaibo comenzó el #ViajeTour  de #Venezuela (WT) http://t.co/AMfSYNqX0k Llegamos Venezuela. Maracaibo ya estamos aquí. http://t.co/OiwyEpgS7J #Venezuela  Están listos para irse de viaje con el #ViajeTour ? (WT) http://t.co/GGLPCJ24hM RT @INFOMUNDOARJONA: #Venezuela llegó el momento del #ViajeTour2015 Próxima Parada #Maracaibo http://t.co/fcaww9DKhD SE BUSCA \ncansado de andarte buscando vine a encontrarme harto de nunca encontrarme por andarte buscando http://t.co/2KTV8voG8x Que bendición la mía despertar junto a ti cada día (WT) http://t.co/WFKCckkspg @raizaag Niña por Dios. Tendre que acompañarte a caminar el resto de tu vida. #TBT Con estas canciones comenzó el #ViajeTour (WT) http://t.co/mkqS7ftEgQ RT @INFOMUNDOARJONA: Grandes cosas están por venir en #MundoArjona http://t.co/y5chy4nuMG No me considero ni poeta, ni cantante. Hice canciones, me gusto, conseguí cómplices y sigo en esto. (WT) http://t.co/lrNYDmTWH2 Más de un millón de personas ha visto el #ViajeTour cuéntanos en qué ciudad serás parte tú?  #ViajeTour (WT) http://t.co/wCQAHEspSG Jesús es mas que cinco letras formando un nombre...Jesús es verbo no sustantivo (WT) http://t.co/FLi46p82zl Soy el mismo que hizo Dios para hacerte feliz (WT) http://t.co/Sp2xy1IfI4 No hay reloj que de vuelta hacia atrás! Venezuela estás lista para el #ViajeTour (WT) http://t.co/9nvwmhbjW6 VENEZUELA Vamos para alla. Gracias #USA por un #ViajeTour sin igual. #Venezuela nos vemos pronto. (WT) http://t.co/nSxsiyJKSV Tenemos listas las maletas. El #ViajeTour llega hoy a #SanDiego (WT) http://t.co/q2ro31iGLm Gracias #LosAngeles por dos noches increíbles del #ViajeTour #SanDiego nos vemos al rato. (WT) http://t.co/D3S4sHMsdy RT @iloveklove: Los Angeles se rinde a los pies de @Ricardo_Arjona @aeglivelatino #ViajeTour #iloveklove http://t.co/KLbcX5QkkG #LosAngeles nos morimos por regresar. Mañana nos vemos. (WT) http://t.co/p6Wj8jhign @Marianushk07 Doctora beso grande pa que no se queje. Doctora empezo a dolerme una muela jajajaja beso. En Los Angeles hay que saludar de uno en uno a cada pais Latinoamericano Gracias por la noche,salí con alas Vuelvo mañana.. si  aterrizo Viendo desde el aire el lugar del concierto de esta noche y mañana . Ya llegamos Los Ángeles http://t.co/lcV8IFFOWL #LosAngeles nos vemos hoy y mañana en el #ViajeTour (WT) http://t.co/q9kH1Mz8Xk El #ViajeTour ya paso por #SanJose nos vemos mañana #LosAngeles (WT) http://t.co/j1dTfNfUZf #LosAngeles falta poco para subirse al tren del #ViajeTour este viernes y sábado. (WT) http://t.co/ifVi7ydHsE #SanJose no dejes que se te escape el taxi del #ViajeTour (WT) http://t.co/x2FdoxntPD Quieres escuchar #Cavernícolas? Entra a http://t.co/kCLruv0jCN y pídela en la estación  de radio de tu país! (WT) http://t.co/INmkFo5fWv #USA el #ViajeTour continúa mañana el tren hace su parada en #SanJose (WT) http://t.co/iRUkZICnXh RT @INFOMUNDOARJONA: #Mundoarjona hizo posible esta emotiva sorpresa a @nphi No te la pierdas en los videos exclusivos para miembros http:/… Gracias Houston. Los paisanos Latinoamericanos nos trataron como en casa. Se les quiere. RT @ToyotaCenterTix: .@Ricardo_Arjona has everyone singing every word here at #ToyotaCenter http://t.co/NY7Kemcdvw RT @adriaarjonaa: \"@NickDamiano1Ent: Have some big announcements forthcoming for @adriaarjonaa .. Stay tuned! #blessed\" Caigo hasta el fondo el mar, arañando la burbuja en que no estás.  #Apnea #ViajeTour #Houston (WT) http://t.co/vOPbQQEZYP Houston vámonos a La Luna en Bicicleta con el #ViajeTour (WT) http://t.co/GwVnJtaopn Como en aquellos tiempos, Arjona ayer estuvo en la NBA y hoy canta en el mismo lugar. Houston. (WT) http://t.co/cUEZIOaXFG Mañana llega el tren del #ViajeTour a #Houston (WT) http://t.co/iRtm13HfRN #TeQuiero #Dallas #ViajeTour próxima parada #Houston (WT) http://t.co/d3e268zfuf #Dallas hoy nos vemos en el #ViajeTour (WT) http://t.co/bi0AzJZ7TO #Mcallen se fue a la Luna en Bicicleta. Próxima para del #ViajeTour #Dallas (WT) http://t.co/yBpPXUNK2r Los Angeles! Boletos a la venta ya. Nos vemos pronto https://t.co/bKnmdVLm39 (WT) http://t.co/ckB8o4JuPM Las Vegas, la ciudad que nunca duerme. Ahora se porque  Quienes se vinieron a meter a mi cama? http://t.co/uC4v3EnO86 A pocas horas de nuestra próxima parada #Mcallen #ViajeTour (WT) http://t.co/dvRlCiwHbX Uno no esta donde el cuerpo, sino donde más lo extrañan. #ViajeTour (WT) http://t.co/fUCABlx4OC El #ViajeTour ilumina #LasVegas #AxisTheater (WT) http://t.co/wPzddTKub1 @notiarjona  Saben que se les recuerda Argentina y se les extraña. Desde muy al norte un abrazo viajero para todos. El Paso, Phoenix. Graxias por la emocion. Hoy Las Vegas En camino el #ViajeTour a #LasVegas están listos? (WT) http://t.co/bv8ABO32AW Momentos del #ViajeTour en #Phoenix fuiste parte del Viaje? Comparte tu foto seguido por #ViajeTour (WT) http://t.co/1Z07z5ppUc http://t.co/bT1mQ5UXlU @Ricardo_Arjona Verte representar a este que te quiere tanto en esta historia es mas de lo que uno puede imaginar. Gracias flaco Culmina el #ViajeTour en #ElPaso próxima parada #Phoenix (WT) http://t.co/reSIPuKHa5 RT @NiuverOfficial: Primera vez que canto en New York y tiene que ser en el ''Madison Square Garden''. Gracias a Ricardo Arjona, a la... ht… @mariaanmuniz Usted es una belleza El #ViajeTour llega pronto a tu ciudad. Quedan pocas entradas, ya tienes la tuya? #ElPaso #Phoenix #LasVegas (WT) http://t.co/9Psssya1jZ Momentos del Viaje Tour en Nueva York. http://t.co/eu1IWL5VWw #ViajeTour #NuevaYork #MSQ (WT) RT @TheGarden: A viaje de musica fulfilled at @TheGarden, fans were embraced by the love of @Ricardo_Arjona's voice. #ViajeTour http://t.co… Madison Square Garden   NY. Llenos de vida.  Así nos vamos. RT @TheGarden: One of the most successful Latin artists of all time to ever take @TheGarden stage - @Ricardo_Arjona. #ViajeTour http://t.co… Lo que nos pidan podemos .....Mujeres.   Feliz día. Que es lo que hace un taxista seduciendo a la vida? #newyork mañana llega el #viajetour al #MadisonSquare (WT) http://t.co/a9Zr1KuTlq El #ViajeTour se despide de #Chicago próxima parada #NuevaYork (WT) http://t.co/8iQG1OAc6H \"Vivir es buscarte a ti y seguir lo que piensas, aunque no sea lo que piensen los demás\" #Guatemorfosis http://t.co/qFK6dPrkb3 (WT) El viaje continúan mañana en #Chicago y el domingo en #NuevaYork #ViajeTour (WT) http://t.co/WGDYfHhltP @RArjonaSPAIN @Cadena_Dial Sueno a pesar de la distancia en su reproductor personal con eso es suficiente. Lo demas esta demás. Los quiero La #MaletaViaje de paseo por #Chicago a solo dos días para el #ViajeTour (WT) http://t.co/HxSUliEPJm Paisanos si no se puede en el Mateo Flores nos tocara ir con la guitarra de casa en casa. Pero de que vamos vamos. Abrazo a todos. El #ViajeTour continúa y a ti que te gustaría escuchar del baúl de los recuerdos? (WT) http://t.co/gucAN2O1J3 Espectacular #ViajeTour en #Washington #Mojado próxima parada #Chicago (WT) http://t.co/5zd5wrenG7 #Washington ya estamos cerca. Quedan pocas entradas, ya tienes la tuya? #ViajeTour (WT) http://t.co/Z6cBjGI7rv Miami Es como cantar en todas partes     Mucho Cuba mucho Venezuela  Mucho Colombia No puedo dormir. Una de las mejores noches de este viaje Y la ideología no se meta más en lo que no le importa... #Puente #Miami #ViajeTour (WT) http://t.co/yWCeQ9COt7 Acércate al puesto de mercancía oficial del #ViajeTour ahora en Estados Unidos (WT) http://t.co/YdNOPdDbm4 METAMORFOSIS ... Como en familia. Al fin juntos  (WT) http://t.co/l69PM3Srp6 RT @MarcoASolis: #tbt #PLN https://t.co/CT7QbwXVfR La gira en Estados Unidos comienza en Miami Sold Out. Nos vemos mañana #ViajeTour #Miami (WT) http://t.co/HEIuzn44au Guatemorfosis - vivir es exprimir cada minuto y soñar; soñar y despertar para seguir soñando http://t.co/sMW5G7s8MH #Guatemorfosis  (WT) \"Llevo esto conmigo siempre, como los llevo a ustedes por lo mucho que ha representado Chile en mi carrera\" - RA (WT) http://t.co/vKNhutL16y Mágica noche en Viña del Mar #ViajeTour #ElFestival (WT) http://t.co/qdwJ6ckxiK En vivo hoy desde el Festival de Viña del Mar a las 21:45 horas de Chile. #ViajeTour (WT) http://t.co/6K4OPKcy7H Gracias Puerto Rico ..como pa llevarselos conmigo. Asignatura pendiente completada #PuertoRico #ViajeTour (WT) http://t.co/OuYJjCOlPi La Isla del Encanto #ViajeTour #PuertoRico (WT) http://t.co/0t466C5HUO Ayer Lo nuestro hoy y mañana Puerto Rico el lunes viña del mar y de vuelta a Miami al AA el jueves. Pura emoción fuerte..Como debe de ser. “No cambiaría ni uno solo de los múltiples errores que he cometido en mi vida para llegar a donde estoy”  (WT) http://t.co/EauR3yyVUv A minutos de salir al escenario de Premio Lo Nuestro (WT) http://t.co/Lsp0N72BUm El #ViajeTour llega a Puerto Rico y Estados Unidos. En que ciudad serás parte de este viaje musical? (WT) http://t.co/k6tIy7J8Hh Como la primera vez que te conocí, llena de luz, así te recordaré .  Lorena Rojas. http://t.co/RmoMjU6WYX En este día del amor y la amistad que te parece regalar \"Besos y croissants por desayuno\" #Cavernicolas (WT) http://t.co/cFLL3KwG07 Vive los momentos del #ViajeTour en Instagram. Sigue @arjonaoficial (WT) http://t.co/36C7CwIYeP #TBT a punto de saltar en el Bungee más alto en Macau, China (WT) http://t.co/DhkkzgkdLP Así se divierte Ricardo antes de abordar al #ViajeTour (WT) http://t.co/xMt5u50vYQ Gracias Mexico, noche especial. Mañana vamos de nuevo. Así regreso el #ViajeTour al @AuditorioMx mañana el #VIAJE continua. (WT) http://t.co/Lnv4pX5kXC #TBT El #ViajeTour regresa hoy al Auditorio Nacional. #Mexico (WT) http://t.co/zaVD7CeMDK Guatemorfosis ya no es una invitación al cambio, es el cambio que ya empezó. http://t.co/Us8hutYyN8 (WT) Un día para no pensar en nada se lo merece cualquiera http://t.co/JwuxvnT6ml Carajo, las cosas buenas deberían de durar por lo menos lo mismo que las malas. Costa Rica, como pa quedarse . Se les quiere. Se despide el #ViajeTour de #CostaRica Gracias por el calor en dos noches frías. (WT) http://t.co/TanhBXcOEq COSTA RICA, COSTA RICA, COSTA RICA. Gracias por la magia. Hoy vamos de nuevo. Cavernícolas eso fuimos... http://t.co/5jmC2K8hdV #ViajeTour #CostaRica (WT) Gracias Panama . Buscando el sueño en alguna parte. Gracias por la emoción. Así comenzó el #ViajeTour 2015 #Panamá (WT) http://t.co/r4DleRpAnH RT @MetamorfosisMed: ¿Ya viste el video de Cavernícolas? https://t.co/069fhJAcka #daleplay #Cavernícolas #ViajeTour RT @premiolonuestro: Honrados de reconocer a @Ricardo_Arjona con el Premio a la Excelencia. RT para felicitarlo. #PremioLoNuestro http://t.… Ya puedes ver el video del nuevo sencillo #Cavernícolas entra aquí! http://t.co/Uzcjw81oNI (WT) http://t.co/hRdRTY97uO Cavernícolas nuevo sencillo de Ricardo Arjona. #Viaje #Cavernícolas  (WT) http://t.co/YUm1ktdpDJ @Nodoubtcris @notiarjona Gracias por todo, les mando un abrazo grande. Se les quiere. @notiarjona Me guardaron algo? Panama nos vemos mas temprano que pronto   Abrazo Costa Rica , para allá vamos  PURA VIDAAAAAAAAA. Solo faltan 5 días para embarcar en el #Viajetour2015 (WT) http://t.co/L8kcLqQ6nM RT @MetamorfosisMed: Escucha la sorpresa que le dio  @gaby_moreno a @Ricardo_Arjona http://t.co/UCPFocFizD Gracias a todos Feliz cumpleaños a mi Que quieras y te quieran y que dures lo que tengas que durar Con una canción preñada y una guitarra que se deje tocar \"Es mejor cometer un gran error por convicción que un error por imitación\" - Ricardo Arjona (WT) http://t.co/qOHZhjED6D RT @Fund_Adentro: En #FundacionAdentro celebramos el Aniversario de Inauguración de Escuela Adentro Nohemí Morales de Arjona... http://t.co… ¿Ya sabes cual es el nuevo sencillo? comparte tu respuesta usando el hashtag #NuevoSencilloArjona (WT) http://t.co/8HfvpeAd5B #FF @Fund_Adentro @MetamorfosisMed (WT) #TBT Desnuda que no habrá diseño que te quede mejor que el de tu piel ajustada a tu figura. (WT) http://t.co/i6qCz6wTnY Buen año para todos. En Guate recargando pilas para empezar de inmediato con la vida y la alegria de seguir girando. Abrazo grande. No valgo por lo que tengo, valgo por lo que perdí. (WT) http://t.co/TKF1MiE6ik Sutil veneno tan afrodisíaco #Viaje (WT) http://t.co/j1ekWPkwgF Éramos dos y nos bastaba #Viaje (WT) http://t.co/olJ0t8iRia La cueva se convirtió en casa #Viaje (WT) http://t.co/1mozcLUwiq Que tengan fuerza para luchar por lo que quieren este nuevo año.  Les mando un abrazo  y los quiero No había reloj ni presupuesto #Viaje (WT) http://t.co/JH5DfpKFBs RT @Fund_Adentro: Un saludo de parte de las alumnas de nuestra escuela en Ixcanal, deseándoles una feliz Navidad #FundacionAdentro... http:… Descubre el mensaje de Navidad de Ricardo Arjona. Entra aquí http://t.co/IIaSe1zyhI #RicardoArjona #Navidad  (WT) http://t.co/VO3ZEyyUgT RT @INFOMUNDOARJONA: Gracias por ser parte de este maravilloso Mundo. Feliz Navidad a todos nuestros Miembros de #MundoArjona #ViajeTour ht… RT @Fund_Adentro: Fundación Adentro se construyó pesando en los que viven con grandes desventajas, los que encuentran con... http://t.co/rs… Puente https://t.co/NuFjsVsOZ2 #TBT (WT) Puente (WT) http://t.co/z6jVxYphda Puente, tendria que haber un puente. http://t.co/NLQNtud1mK Se despide el #ViajeTour en el 2014. Para ver el video completo entra http://t.co/hfSuYgdpkz (WT) @campelloricardo Tu alumno mas destacado. jaja ¡Gracias! ya somos 16 millones http://t.co/7YS0wMpnZt #RicardoArjona http://t.co/ucuCZQsZJU #Tepic disfruto del espectáculo #50 del  #ViajeTour y el último del 2014. Gracias el Viaje continúa en el 2015 (WT) http://t.co/1rYH4mZYiC A #Minutos de terminar el #ViajeTour en #Guadalajara http://t.co/rhfJa7AveE (WT) Prueba de sonido. Guadalajara falta poco para el #ViajeTour (WT) http://t.co/evu9Bfywwi Guadalajara solo falta un día para el #ViajeTour (WT) http://t.co/RZlP5gl5DH #Panama Hoy Pre-Venta exclusiva para miembros de #MundoArjona. Adquiere tu membresía en http://t.co/hfSuYgdpkz. Membresías Limitadas (WT) RT @HPVocesEnt: Mira el momento en el que @Ricardo_Arjona sorprende a los niños de la escuela que construyó su fundación http://t.co/eAhZ7H… #Guadalajara #Tepic adquiere tu membresía y disfruta del #ViajeTour #MundoArjona #Mexico (WT) http://t.co/GytxEsm2DJ Imposible contestarle a todos. Pero a todos les dejo mi agradecimiento y un abrazo del tamaño de la distancia. Buenas noches. @LaCusme jajajajajajajaja no me dejan ir con estos comentarios. Beso @gisellebluefile Se le agradece la consideración . Besito @prisset_yenai jajajajajajajajajajaja me encanto este. El chantaje femenino a la maxima expresion. Todo lo contrario linda. Te dio resultado @TathiiEspindola tremendo, que no te arrepientas nunca. beso @IlianneParodiO Las mujeres son increíbles . Para muestra este mensaje  . jajajaja una belleza. besito @chechu_ad JAJAJAJAJAJA nooooo  beso @vivoguatemala BESO GRANDE PARA USTEDES Los abrazo y los quiero de verdad. A todos, no importa de donde sean. Espero verlos pronto. Ahora, a ver que le robamos a la noche. @elii_avalos Paisanita un besito para vos @CAlanGnzlz Alan un abrazo @Bogotanita27 Un aguardientico y voy volando.  Colombia estaremos también  saludos @eectorres @rulobono jajajajajaja abrazo http://t.co/6bUg9xsP02 @PatricioRuiz22 abrazo hermano  jajaja @lau_calderonl jajajajajajajajajajajajajaja como me hiciste reir beso grande linda @SusyAspani Abrazo grande. Tu marido se va a enojar. jaja @valeria_zavala Hola linda. Tu muñeco es parte de la escenografia, gracias. @mlcambar upa, y eso???? @SO_GRA_FA No llores. besito @lesMT_ Beso linda @oscarhugg mejor que vos jajajaj claro como no lo voy a conocer. @johacasafranca PERU , que quede claro, cambio concierto privado, guitarra y voz porque me lleven a comer. La mejor comida del mundo  Besos @SoolMuller jajajaja beso grande para vos linda @neyrondon Tan linda, yo te aviso. Vamos para Venezuela también . Como de que no. @RomiCardozoo jajajaja, beso grande para Argentina, saben que se les quiere mucho. @64_rachel Vamos a ir a Honduras, Abrazo grande @JChamagua8 Vamos a ir. Seguro que si @wuizoo COMEDIANTE??????? JAJAJAJAJA Nunca me habian dicho eso jajaj @_arjonaa A vos te andaba buscando. Me pediste DIME ALGO MALO me hiciste reir mucho. Porque me pides eso? @CEspinosa88 Con la seriedad que Gorbachov aborda el tema de la caida de su cortina. Abrazo hermano. NOTIARJONA que curiosidad por Dios. Vieron que no lo saben todo. Ya los puse serios. Nada de eso. @renenoelfuentes que hiciste???? jajaja Mis viejitos, guapos no? mi madre cumplió un año de que se nos fue. http://t.co/0pJNPg61VY Intentaremos estar donde no estuvimos con VIAJE, es mas,  estaremos donde no estuvimos con VIAJE. Así se habla. @paofernandez14 No te contesto entonces @MelissaSanche41 Abrazo grande a los Ticos. Saben que los quiero desde siempre. @Coorre Abrazo hermano Esta claro que no soy normal. En una noche envio mas mensajes  que en un año. Es una medida cautelosa para que no se aburran de mi. Paisanos, se que en mayo estaremos con VIAJE por nuestra tierra. Muchas ganas. @notiarjona Tremendo. Ellos cantaban la cancion de Mojado y en una pausa entre a cantarles con la guitarra. Gente clara, mucho que aprender. @lornapg7 Usted me quiere quitar el trabajo? @notiarjona Ustedes son tremendos. Se fijan en todo. Me encanta esto de volver a ser Profe. Uno de los mejores días de este año. Fundacion adentro, una realidad http://t.co/DktqZ4Bdz4 #FBF Casette Si El Norte Fuera El Sur.  #casette #SiElNorteFueraElSur (WT) http://t.co/ZokasWZkUv Mas guatemalteco que nunca. De vuelta en mi tierra. \"Ir a la luna en bicicleta es más fácil que olvidarte\" #ViajeTour #Lalunaenbicicleta (WT) http://t.co/KQdLKlsQHJ Lo poco que tengo es tan poco que me hace feliz... https://t.co/pbZXUfVTXX (WT) La sonrisa blanca esta de luto. Carta de R.A al staff de la gira VIAJE a un dia de la partida de Coco nuestro ingeniero de sonido. (WT) http://t.co/gBjBafM2hL EL CIELO, A PARTIR DE AYER, SUENA MEJOR. Nuestro ingeniero COCO  de las mejores personas que conocí.Se nos fue. Solo me quedara extrañarte Los dias del sur se estan quedando en el tiempo. Mientras reciben el verano  a nosotros el frio nos hace recordar que se les extraña. #México el viaje continúa pronto en #Guadalajara #ViajeTour (WT) http://t.co/cOs5AEd67d RT @MetamorfosisMed: Oferece Arjona un viaje fantástico http://t.co/Q6tF3yF0Me #Torreón ya comenzó el #ViajeTour (WT) http://t.co/3nETuNMsue RT @MetamorfosisMed: Arjona, Listo para Torreón http://t.co/N1o6R53V6I #TBT Video Apnea http://t.co/VQlfJ4p39N (WT) http://t.co/m7ePQqr26E #Mexico el viaje continúa en #Torreón #ViajeTour http://t.co/dxsBB5ggH7 Componer juntos ... Él y yo http://t.co/6h35XoFhEw Acompañame #Acapulco #ViajeTour (WT)  http://t.co/4YW9fMH0vm Guerrero. Que todo vuelva a ser lo que fue. Porque nadie aquí se merece lo que es. Acapulco http://t.co/OBbI3k6una Será que cuanto más al sur voy en México más en mi casa me siento. Hoy. Mérida como en casa. #Mérida se fue de viaje a Luna en Bicicleta. #ViajeTour (WT) http://t.co/b9Cd3vdqvE Te conozco... #VillaHermosa #ViajeTour (WT) http://t.co/CxnkZqasu8 Pancho, Pancho López, chiquito pero matón. Para ver video exclusivo entra a http://t.co/1NvFznB8gW (WT) http://t.co/pPSLykzCjg"}