{"tweets": "Hey @JDallinga, Thank you for the follow! Today tested my patience of the human race Does anyone else remember when they tried to make a Muppets TV show that was edgy? And the couple behind me screams. And then the man says...\n\nIf they had gotten hit that would’ve been very Darwin...\n\nI was scrolling through Twitter and wanted to tweet right then but they were behind me!!! I put my hand in front of my mouth to stop me from laughing too loud So today on the bus to the train station there were some probably drunk people sitting in the front of me. I didn’t have headphones on because I forgot them. Anyway, they get out at a stop and walk IN FRONT OF THE BUS (which you’re not supposed to do) and almost get hit... (1) You know it's Utah when you get a Hulu ad for a small town car dealership that mentioned how much you'd save by mentioning how many diet Cokes you could buy. RT @benfrandsen: Yikes. Let's turn this around by biking and using public transit more. Provo has recently been making strides in this dire… RT @adamjmclain: Friends, I’m at the end of my rope, and just very, very tired. Today hasn't been a great day and it's only 11:25. RT @crtv_drctr: Last night, @westmemphispd cops accosted and attempted to arrest my grieving sister for STANDING OUTSIDE OF OUR HOTEL AND M… RT @crtv_drctr: For those looking for a way to support, please consider supporting my family’s expenses for my niece’s services: https://t.… Unwritten by Natasha Bedingfield’s music video is an example of racial equality. RT @kilIacourt: The salvation army forced a trans homeless woman to freeze to death bc they kicked her out of a shelter bc she was trans. D… I just saw a trans flag in front of a house on the bus and almost cried!!! Hey @McconneyMichael, Thank you for the follow! @krisis86 Please!!! Hey @gingersteve926, Thank you for the follow! Why they be hating! 😭😭😂 So I was watching TikToks because I’m basic and I was watching choir TikToks and they had a stereotypical musical theater person in class and then I realized that was me RT @xomorgxn: SOMEBODY PLEASE HELP ME SHARE THIS IT DOESN'T MATTER UNTIL YOUR OWN KIDS DON’T COME HOME https://t.co/J5RNzUhAze It took me some research but the show is called Flirty Dancing. https://t.co/qrCEBle2ga @ellle_em \nTop 10 Pokémon:\n1. Pikachu (but only the female Pika Libre one)\n2. Eevee \n3. Mudkip\n4. Piplup \n5. Rowlet \n6. Gulpin\n7. Wailmer \n8. Castform (Rainy)\n9. Pikipek \n10. Unown RT @Papa_Ostler: Increased spiritual activity isn’t going to solve mental health challenges just like it isn’t going to solve physical chal… RT @RosemaryCard: If a baby boomer randomaly sends you a YouTube link via FB messenger you assume they’ve been hacked, right? Once when a kid called me a f****t at a mission camp I cried and prayed that night until I felt specifically Heavenly Mother’s love so I agree. Heavenly Mother cares just as much about her sons and she does her daughters and boys deserve to have a relationship with her too!!! https://t.co/1WYf9tUoAl I don't know how to write a human development paper about puberty without sounding like a creep for mentioning the development of breasts in females... 😐😳 I thought we were out of hot cocoa and then I found some more and I’ve never been more happy!!! It was in a spiritual way when the teacher asked about experiences with faith. So I came out in my Sunday school class today in a healthy way because I thought everyone knew...\n\nTurns out there were some surprised people. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Hollywood exclusive Marilyn Monroe Pop! #Funko #Pop #FunkoHollywo… so a quick crash course.\nSexuality has two parts, romance and sexuality. I know for a fact I am homoromantic (romantically into the same sex) but am questioning the sexual part.\n\nIt's more about if I am into sex or not (asexual). I'll update this as I figure it out. Scrolling through Facebook and I see this link: https://t.co/zeIEdWiw1y\n\nAnd realized that something I've only told a few people is relevant to this and I wanna share.\nSo currently I am questioning my sexuality. Which is probably confusing to people outside the LGBTQ+ community 1 I need someone to find me the video that a woman posted where she gave her boyfriend’s little sister a @buildabear with her dead father’s voice. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @HamillHimself exclusive Pop! \n#Funko #FunkoPop #Giveaway #Exclusive #P… Hey @RTPCCIE, Thank you for the follow! That article is all I can think about rn I don’t care about people’s opinions on gun related stuff. I just think we gotta stop it! Honestly what this woman said in this interview is life-changing, especially for what I'm going into. She said her classroom was a safe space and also talked about remembering the good stuff that comes from their school and not this incident.\nthe tears are here even more RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Loungefly x Star Wars Princess Leia Backpack! #StarWars #Loungefly #Fa… I agree that this shouldn't be what a teacher has to do. As someone who is going into education, I think about this a lot. This woman is amazing!\n\nThis needs to change!!!\ni'm crying... https://t.co/RNn30kykMO RT @judithwilbury: 👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿\n👉🏿👇🏾👇🏾👇🏾👇🏾👇🏾👇🏾👇🏾👇🏾👇🏾👈🏿\n👉🏿👉🏾👇🏽👇🏽👇🏽👇🏽👇🏽👇🏽👇🏽👈🏾👈🏿\n👉🏿👉🏾👉🏽👇🏼👇🏼👇🏼👇🏼👇🏼👈🏽👈🏾👈🏿\n👉🏿👉🏾👉🏽👉🏼   I saw     👈🏼👈🏽👈🏾… Not to repeat what a million other people have said, but USE YOUR TURN SIGNALS WHEN CHANGING LANES PLEASE!!!! One of these days I'mma get hit by someone cuz they didn't use their TURN SIGNALS. Am I the only one who is terrified that someone has hit me anytime I have to emergency brake or sometimes even just brake but I just don't feel it or hear it because I'm cranking them bops! For scenes for a directing class I'm playing both @LeoDiCaprio and Robert De Niro's character's from Marvin's Room! @timtamburg Depends. Sometimes it sucks for a few days and I’m fine but I also have it pretty mildly Guys I was 8!!! I freaking loved this game! https://t.co/CCb8kjyQOV I can’t get over the fact that @chrissyteigen ‘s bio says what it does!!! I’m quaking!! https://t.co/s2IjzpPjca @hayzul_nut Then I really don’t know. Maybe drinking water or sleep? Wow popular Twitter threads about anything Mormon related can be toxic\n\nHonestly I’m excited cuz he’s voice is golden https://t.co/vBJNdiha4q @hayzul_nut Have you eaten enough? @timtamburg Either just those random pains or it could be exercise induced. Does it happen when you breathe deeply? Love, marriage, heal\n\nBut like I'm only gonna be 19 in 2020... https://t.co/6wEaqFhXoy Hey @annieferrin, Thank you for the follow! Hey @Univers16085124, Thank you for the follow! RT @Papa_Ostler: If you see a threat to a school on social media call authorities ASAP.  \n\nYes, ASAP 💯 @Heres2humans Did you report this?!?! @minty_jane Wtf is a framer? Does anyone remember the as seen on TV automatic toothpaste dispenser, or am I just tripping? Hey @LaurenceFuller, Thank you for the follow! Anyway, in conclusion, and why I was writing this primarily is to say: I think personally the only reason I am still active is that I've had positive experiences in the Church. Alright, I'm going to bed. Goodnight. (7) an experience he felt terrible about when his brother, who later came out as bisexual, asked how he felt about legalizing same-sex marriage and he said it's disgusting but equal rights. He has definitely changed (just like the subject of this thread). He is so loving. (6) I sat down today with one of my classmates in theatre who is a veteran and told me all about his opinions and life and I found it fascinating. It doesn't mirror my own and some of his views don't match mine, but I don't care. He is genuine and kind and told me about (5) I love everyone who decides to do anything in their lives. If we didn't then life would really suck. I love listening to people's experiences with things, but I don't enjoy people telling me how to experience things (the not being happy about the missionary girl and the gay man)4 think because God loves me. For now, I know the Church is going to be a part of my life but it doesn't have to be for everyone. There are still problems outside of my section of the Church that irk me sometimes and I sometimes speak out and sometimes ignore them... (3) The Church has a long way to go and sometimes it's hard for me and it's even harder for others because I've had a great experience with my personal ward/classes. I've only had a few bad experiences which really strengthened me to learn to not really care about what others (2) Some people I've seen on Twitter were complaining about how the Church isn't doing great with LGBTQ+ issues, that you shouldn't be happy that a missionary cared about a gay man, and that you shouldn't pay tithing... (1) @RosemaryCard This is how I communicate now, but you need it!!! https://t.co/mNbTMjySMc @AriWRees Reading the comments someone said she was found but idk if it's about this but I'm gonna believe it for my own sanity 9 year old me had no idea that being gay was gonna happen, but he was still so confused why he didn't have feelings for girls.\n\nHe'd also lose his kind knowing he was going into theatre education https://t.co/1MAb149lCE I got invited to hang out after I saw a show at my old high school with the cast and declined because they are crackhead children, but then as I was driving I was like why didn't I and I had to convince myself that it was weird and I'm fine for not always hanging out so... yeah @ramblycambly honestly gonna vom RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Target exclusive 10” Squirtle Pop! \n#Funko #FunkoPop #Pop #Exclusive #… Hey so I have this tab chrome extension called Tab for Charity and it raises money by putting ads in the corner of your screen (very small) on a new tab and it's for a good cause. Here's a link to my invite https://t.co/ELtAYSzNXU and if you use it you'll also plant a tree! @ColourPopCo #frozen2andcolourpop RT @ColourPopCo: ❄️ #GIVEAWAY ❄️\n\nFor the first time in forever, we are giving away the complete Frozen 2 collection to 2 lucky winners!\n\nT… RT @SGAMormon: Being attracted to the same gender isn't wrong. How could it be? You didn't choose it!\n\nYou are fine the way you are. You do… After watching theatre tiktoks for the past 30 minutes I can't wait to deal with the teenage girls who think they deserved a part and are gonna show off they can in front of me. https://t.co/GHdAnFyizq https://t.co/FEjJ0guFGI https://t.co/5IhgpDfuaf Did you know that people of the LGBTQ+ community have higher rates of sexual assault than the general public?\n\nNow you do! Someone cast me as the drunk white girl in consent videos, please!!! The video I watched had a white guy as the creep and a black guy as the hero and that's what we call progress. I am completing sexual harassment/assault training for college and we all need to remember it's never the victim's fault NO MATTER WHAT!! and we need to believe them!\n\nThanks for coming to my TedTalk! I think I'm an old woman because I got excited about the coupons in the mail, even though I'll probably never use them. I just commented on a Facebook comment that said, \"there's only one race, the human race.\" with \"WHAT ABOUT NASCAR!?!?!\" Who let me exist this long? Liked on YouTube: \"The Train Song\" - Morgan Hollingsworth | 2018 Johnny Mercer Songwriters Project https://t.co/lgG8FkfBeb Liked on YouTube: Rami Malek As Kenny In The War At Home Being A Gay Disaster For 11 Minutes and 6 Seconds https://t.co/eJGi79KVB5 Everyone be proud of me: Whenever I've talked about my non-binary friends I've been so good at using their preferred pronouns and haven't made a mistake in like 2 days!!!! TIL that @BroadwayWorld can nominate an LDS stake production of a show. You're made of a solid, liquid, and gas so you triple matter. 😊 https://t.co/mjMQp3nBV8 State Fair Fried Pickle Burger https://t.co/IhxwcNjLVE\n\n@krisis86 - would this work for what you want? https://t.co/zcecIwDoq2 https://t.co/RIpskLJQAL Sometimes I forget what stop happens before mine on the train and panic 2 stops early. @rachelsteenblik When I was too young for much more than a lawn mowing job (like 8th or 9th grade) my friends and I went to a strip mall and ate a restaurant and a nice older man paid for our entire 3 person meal. We've freaked out happily ever since randomly!! @krisis86 I'm only communicating in Queer Eye gifs and this one is for you!!! https://t.co/tAcCSTpuyR Would anyone stop me if I went? https://t.co/KSyT58Emns Have you ever wondered if you're supposed to wake up sleeping people on public transport? Both discovered I had anxiety and depression and got help for it\nRekindled my love for theatre\nTraveled with school arts programs at least 4 times\nDiscovered my sexuality\nExperienced first love\nGraduated high school\nStarted college https://t.co/HUg4I57gvF Hey @BlockDNat, Thank you for the follow! @lukasbattle Energy drinks and early morning choreography #NewProfilePic https://t.co/ijSkwvGDOA @KevinSGillespie Nah fam. Too scary. So I just did a whole thing: I was in front of my mirror talking to myself like a crazy person and then pretended to be God telling me that I was gonna be gay and my response was “Yass Queen” and now i feel like that’s how it probably actually went down. Hey @KevinSGillespie, Thank you for the follow! What if I started tweeting like Tori from @Victorious where I say things that are happening in my life that is so specific that nobody gets it but like 3 people and sometimes it’s vague AF and sometimes it’s BOTH. HOW?!?!?! Yesterday I had a moment in the @WeberStateArts Browning Center 3rd floor men's bathroom where I had a mental crisis realizing how much it would FREAKING such to have periods. People should send me comments that I can make dumb dad jokes on. Thank you. https://t.co/ZbmzMmKLMp RT @sttepodcast: To celebrate the release of #LastChristmas we have this prize bundle to giveaway\n\nSimply follow @sttepodcast and RT this t… Yeah now I wish I hadn't engaged with them. But I followed this thing that blocks all the scary deeznutheads (I'm coining that term for d**n** https://t.co/3DhYzZynCo @KevinSGillespie @redblackties @jortday26 @SocialistPhelan More like an oxyMormon\n\nI'll see myself out https://t.co/5US0AXVeOO @annarpeacock https://t.co/O1Xe9ouDxf The fact that I saw the Provo community be so good with this restores my faith in them https://t.co/9o631Yidqy Either the guy who friend zoned me last week after rehearsal or the guy who said we should date and then freaked out and said we should chill https://t.co/kU2cdzxo8K RT @liyahbobeah: u guys \npls take care of yourselves \nif u get in a dark spot\npls i beg u fucking fight for the light \nu deserve it \npls me… I woke up, heart beating, because I had a moment of realization that Animal Crossing comes out in March!!! In Season 1, Episode 8 of @Victorious Cat says she visited her “Uncle and Uncle” and I’ve never been so happy at a subtle gay reference in my life! How does he bend his arm that like!!! 😳 https://t.co/RBpW3m4wiB I think I'm changing my twitter account into my commentary on my homework. This baby is so cute! https://t.co/IQhLYCYlBf So this makes sense to me. https://t.co/RjidA3NQhj My textbook told me that I'm most likely to not have romance because I'm young and gay... I think that I'm into baristas. Like I looked at one picture of a male barista from Germany in my human development textbook and I can't stop thinking about it. YAAAASSSSSSSSS!!!!! https://t.co/IWHeA6VfOk I found an error in my human development textbook and my big nerd energy loves that this happened. @ShelbyHintze Broadway baby...\nYeah that would be the best\n\nAnd travel And then it says there are 11 men for every 15 women and then considering that being gay is a minority...\n\nI don't know if this works in my favor. I read in human development that there are only 4 all-male colleges and my first thought was, \"Maybe I should transfer there.\" and I don't know how I feel about this... @krisis86 I'm upset!!! “Make It Shine” from Victorious slaps!!! And I’m gonna sound like I’m 60 but there’s that one dance with the “Why you so obsessed with me?” part and the girl who taught to me is like 15 and it’s kinda shady Sometimes I think about how in the last show I was in everybody who was younger than me did TikToks and knew the dances and stuff... @msmistyeyee No problem. Just stick it out and if they're being homophobic just know that Heavenly Father/Mother love you and that they're definitely sitting there shaking their heads at those who are not being great. RT @SketchesbyBoze: To every young person looking in the mirror and wishing you were funnier or smarter or better-looking, I hope you know… And how she said when I mentioned it said I like kids even if they're not my own that all my future students would be my kids and how I almost started crying because this was yesterday and I was an emotional wreck. Sometimes I think about how I spent an entire hour reading my birth chart in the back room of the costume shop at Weber with my friend Anna Carr... Tips for anyone who feels super busy and then the bad stuff happens (from an 18-year-old gay man)\n\n1. Cry\n\n2. Text your friends who you can trust (😉 @marie_howell19)\n\n3. Treat yourself\n\n4. Actually take time to feel emotions\n\n5. SLEEP\n\n6. Get back out there Hey everyone. If anyone has been worried about me because of what I tweeted about my life over the past few days I just wanna say:\n\nI'M DOING SO MUCH BETTER!!!!!\n\nIt sucked for a bit but we out here thriving again. Hey @srmicheelca, Thank you for the follow! I’ll just leave this here https://t.co/1ns0DzhVZA RT @SGAMormon: Often, members of the church want to dismiss the difficulty of being gay in the church because they can't reconcile it\n\n\"We… RT @kurtisconner: I thought of a really funny tweet then I forgot what it was so just pretend that this tweet is very funny and good please… The guy who says diarrhea in the Pepto Bismol plane commercial says it too sexy and breathy... After all this crap I've read today, I still feel the love of my Heavenly Parents and know that they're sitting there shaking their heads and wondering wtf happened to those who decided to spread hate. Also, I feel closer to my community today. I think that's enough today. GN! And this guy. He was in the @BYUPolitics thread and I checked out his profile. He came after my man @Papa_Ostler and I'm upset. He's also too far gone and I don't know what to do. https://t.co/8lrZH1a2Fe Hey everyone, go ahead and block this account. He clearly doesn't get or want to understand human sexuality and thinks that being gay is a choice and it's terrifying. I know earlier I fought against this but this man is too far gone for help. https://t.co/I29QJH1Gxa @msmistyeyee In my personal experience, it's been overwhelmingly positive in my Institute class (since I'm not at BYU, I'm at Weber) to come out. My teacher's daughter-in-law's brother is gay and ever since I've come out to that class (which was terrifying) everyone has been chill. Good luck! @templebdparadox I used to sneak my DS in my room. I'm still highly anxious anyone walks in late at night and I'm not paying attention and try to hide even the most innocent of things. Yes this is what the community needs after what happened at BYU this week. https://t.co/FPwmHEy5eD RT @laney0g: Being gay is not a sin. But mocking, belittling, and bullying someone who is gay, is a sin. And the Lord is very disappointed… @annarpeacock https://t.co/8jxoCZlRtp Did I just comment on the @BYUPolitics post under everyone who was homophobic: yes! Did it feel great: yes!! Am I a hero: ...yes @LiveWiseBossy @Maalla00396018 @BYUPolitics @StJohn724 This doesn’t really help the LGBTQ+ community of members of the Church feel accepted @LiveWiseBossy @BYUPolitics I just commented this under someone else’s comment but think of their persecution just like early saints. Pretty good comparison if you ask me @CMHammer732 @TaranTrinnaman @hawkeye_1276 @1000HolyPlaces @BYUPolitics Not helping the cause of bringing people into the Church without making them feel like outcasts man @theshizzy777 @TaranTrinnaman @hawkeye_1276 @1000HolyPlaces @BYUPolitics So not addressing the problems with mental health in LGBTQ+ youth is part of the plan? I think it is. Heavenly Father loves all of us and wants us to actually enjoy life without being targeted and hated. Early saints were targeted like this too in case you forgot Hey @cooopsy, Thank you for the follow! I want to world to appreciate this https://t.co/Q0OZkRaOwJ It’s the end of a really terrible week and all I can say is, “Thank heavens we’re done.” So I spent the last hour looking at my birth chart and things make sense!!! @LiveWiseBossy @BYUPolitics Agreed. I think people trying to stop it and not engaging in healthy debate can be hateful to an already targeted community. @LiveWiseBossy @BYUPolitics I still think it’s a good discussion to publish. You know freedom of speech!!! I don't usually do this but can y'all pray for me? I'm still slightly shaken up after the car accident yesterday and I didn't study last night for a test that I need to take by tomorrow.\n\nThanks. @sarahlynn465 Pray for me. 😂 Note to any straight LDS people out there. Never ever freaking ever say \"You can't be LDS and gay\" because either I'll freaking show you how or that'll make someone leave even faster. Thanks. Have a good day. Honestly I stan the people who liked my comments on the @BYUPolitics thing. @DrewRoyster @BYUPolitics I never said I was. I can thrive and be a happy single in the Church. I just don't like it when people target other people in the LGBTQ community. What happened here is not appropriate and not great for a community that already struggles with feeling safe and secure. @sarahlynn465 Thanks! @sarahlynn465 Ok. I'll stay! @sarahlynn465 There was one this past spring in the parking lot of Fiiz.\n\nI have really good bad luck. I always hit very nice people, but it happens. Hopefully like I said it won't happen until next year. RT @megkasparr: Post show depression is so freaking real :( @RealTJHale @BYUPolitics No idea but I wouldn't doubt it @krisis86 Oh shoot. No this is so great. My mom is amazing when it comes to this stuff. She's learned a ton about the community and she'll tell me about stuff that she sees at her school related to LGBTQ stuff. @hayzul_nut ❤️❤️❤️ @BYUPolitics Hi I would like to comment as an outsider to BYU on this topic.\n\nHello strangers, I’m gay and LDS and thriving. I love the Lord and the Church. What this newspaper would say is something important to me. Equal rights for everyone. It doesn’t affect us that people are free. Thanks Someone needs to stop me from picking fights with these people @LiveWiseBossy @BYUPolitics It’s a political college - it deals with issues encompassing everyone I love 1 1/2 hour long talks with my mom about LGBTQ 🏳️‍🌈 stuff!!! I need to stop tweeting for like 2 weeks so goodbye. While typing this I started feeling peace. I realized that I get into one car accident a SCHOOL YEAR so hopefully, that means I won't get into any until next fall or later. Knock on wood! I wasn't anxious at all today. I got stuff done, I knew that I could get things done, a boy broke my heart, and I got into my 2nd car accident of the year and now I'm feeling anxious hours later. I just remembered that Martha Speaks was a TV show about a dog that learned to speak from eating alphabet soup. Or a day, week, month, semester, year, lifetime can change in a moment It's so strange how everything can change in a moment. Literally, since I've come out to my family I've been in 2 car accidents. I don't know if I\"m waiting to cry or I'm fine with the fact that my heart is broken. Honestly, there should be a warning when people decide they're gay that they will suck at driving. This girl in the writing lab at Weber complimented my black nails and it made me so happy. Except I love the ok boomer comments Reading the comments on this makes me happy that I don’t go to BYU. https://t.co/LBcNIWGW5J @krisis86 I’m so sorry for your loss. RT @liyahbobeah: hi! \npls eat today!\ndrink water!\niced coffee is not a meal replacement!\nu deserve to be loved!\nu are beautiful!\ncry those… @vancebryce \n\nyear i was given: 2013\nage: 12\nnow: 18\nrelationship status: sexually confused\nnow: hopelessly smitten/single\nliving in: Farmington\nnow: Farmington\npets: Simba and Nala\nnow: no one\nwas i happy: highly anxious\nnow: college anxious\n\nreply \"hi“ and i‘ll give u a year @vancebryce Hi RT @OriginalFunko: In honor of #StrangerThingsDay we are giving away a Maya Hawke signed Robin Pop! RT &amp; follow @OriginalFunko for a chance… RT @calvinjburke: My friend Matthew Gong, the gay son of Elder @GerritWGong, has posted a beautiful &amp; heartrending letter to friends &amp; fami… Does anyone know how people do those cool healthy things like bullet journaling and contacting extended family weekly and stuff that takes time in their lives but improves moods?\n\nBecause I'm barely getting through school and work and having a little time to just chill. @molly_moo_who As a theatre person I’m offended. I literally lost weight in a show recently and feel great. It was like a sport. I had a family who I had to show up for a play the game (perform) so we could win (actually have good reviews/audience reactions and donations for charity). @annarpeacock Did you get another one?!?!?! It was awesome. I also had my wallet in my hands and may have dropped some change but I still have some and idk how much I had before and it’s only change so idc. I’m also writing this stream of concious because I’m still catching my breath Sometimes I don’t think I”m gonna make a train and then a bus that will take me there comes and I take it and i think it’s gonna be late, then he gets there right as the train should leave but me and this other guy sprint there and he drops his gloves and I pick them up for him. Liked on YouTube: The Masked Singer STOLE our cover of Bad Guy https://t.co/nZyaBII8A8 What they did disgusts me!!! In Florida, you can still be fired for being gay!!! So upsetting!!!! I love people. Even the weirdos on the internet that when I read their comments I cringe and wonder if they think that other people are gonna see it. Or extreme people in any ideology or way of life. As long as you are not hurting people verbally or physically, you are good. Liked on YouTube: When Florida had a committee to terrorize gay people https://t.co/SUWBkiyxfw The people who lived back in the day when racism was prevalent and fought against it are badasses. Same with extreme homophobia and transphobia and other social injustices. They are my heroes because today life is better for people like me and people who I love. Straight men who haven't had a gay experience are a myth Hey @krisis86, Thank you for the follow! It’s usual to stab someone and I’m scared now that one day I’ll be so tired I will https://t.co/igPtXVa2Sg RT @liyahbobeah: in case you haven’t been asked in a while: how are you? have you eaten today? did you get enough sleep to function? do you… Liked on YouTube: Visual &amp; Musical References in Crazy Ex Girlfriend (Season 1) https://t.co/TyaryXwKUm I want to meet @PattiLuPone so bad!!! Liked on YouTube: We Built This City - NSP https://t.co/Y78Ms0RQCa RT @pop_o_cIock: ENDS TONIGHT! 🔮 RT + Tag A Friend below for extra entries ⬇️ https://t.co/ev2u2bry8R Hey @daily_broadway, Thank you for the follow! RT @cooopsy: love my frens &lt;3 &lt;3 I literally forgot what I was going to tweet... I have no idea why I'm anxious and yet I am. My dad made me an admin on our Mac so now I can call myself an adult. RT @lucyken30862624: boy: i like you\nme: i believe you \nme to me: he’s lying RT @TheEllenShow: The children are our future. And our future is apparently at a strip club. https://t.co/ZD457sFW48 Beginning https://t.co/fuRLWpKmIn RT @ap_thleen_price: I'm very excited for THANKSGIVING I love FOOD shut up about Christmas already I just realized that this girl was probably hitting on me at the bus stop two days ago... @musicallaneous Me to this tweet https://t.co/XQY3Vuug69 @PresidentBishop You’ve probably already finished but this is my costume @BeetlejuiceBway https://t.co/e8beeWmL8y Anxiety today:\n\n- Thinking about how I straight up walked through a rehearsal at school yesterday (freshman mistakes)\n\n- Thinking about how I got home late last night (3am) and my mom was freaking out for me (I'm fine and everything is ok)\n\n- Getting stuff done\n\n- Life in general @jay_douglas23 Do you need some? The top 2 songs that theatre people sing at karaoke parties are:\n1) Something to Believe in from Newsies (either as a joke between two best friends, or two people who are maybe in love)\n2) Cabinet Battle #1 from Hamilton Hey @marie_howell19, Thank you for the follow! I love my mom. She texted me today saying, “I’m running errands. Fend for yourself for dinner.” 😂😂😂 Honestly I really love my black nails. I feel so sexy with them on. Hey @gdukesss, Thank you for the follow! Hey @gkbooks, Thank you for the follow! RT @ellieryanh: my sleep schedule is literally the worst thing ever but I think the real problem is the fact that I \n✨d o n ‘ t   c a r e✨ So I painted my nails for my Beetlejuice costume and I'm kinda into it. https://t.co/o6grrbQpCS Focus on the wins and not the loses (that’s what she said). Life after high school, college, this job, etc. Is better than you can imagine. You are all gonna do great things in life. I can’t wait to see what you do and support you all. Love you guys. (Sorry for the long post) This was pretty sobering so I just wanted to share this because I love you guys. So if you are having trouble please get help. Understand that you have impacted my life in a positive way and your death would impact all of us. You are needed. You are loved. Well anyway, I figured out that almost 50% of people are depressed and 40% have considered suicide (this is at weber) and a few have attempted and 3 have been successful this semester. Each death affects 150 people and 30 (minimum) permanently. Hey guys I forgot to send this earlier cuz I had to help do sound for a show but today in my intro to theatre class we had this lady from the counseling center come and talk to us about suicide because the plays we read for class were weird and about glorified suicide... Liked on YouTube: The Try Guys Plant 20 Million Trees (PSA Music Video) https://t.co/B53aBhPN7m Honestly hanging with people who have a history with the other people there and you are like a first time friend is an experience... Liked on YouTube: &amp; Juliet 2019 musical | West End trailer https://t.co/QZVOTLVSYy I'm ok with mine https://t.co/plsRSw0HFH https://t.co/q5aq4AxeNh Hey @_nicotyler_, Thank you for the follow! Hey @liyahbobeah, Thank you for the follow! I never done this many body rolls So Mind Over Matter by @ARamosofficial is stuck in my head and you know what I’m ok with this! @_nicotyler_ What’s the book? I need to know!!!! RT @sarabrains: Sisterhood. ❤️ https://t.co/6WaOYSlRYO RT @rileighsmirl: I was on tumblr and someone posted about our past pride episode with a brief transcript and I was reading /my own/ words… @DallingaJj https://t.co/gb4xYBTphd @annarpeacock I love you!!!! You’re amazing! https://t.co/iEirDgAnU4 So I saw The Hunchback of Notre Dame the Musical tonight and let’s just say I saw it in a gay lense. Esmeralda is queer and Frollo is trying to make her straight, but she’s in love with Pheobus (who is also queer). Quasimodo is a supportive ally. I literally felt it hardcore!!! @amandapanda814 I might be gay and 18 but I'd marry you #TeamHalloween all the way. Catch me at #HHN29. Amirite @horrornightsorl? Liked on YouTube: How do you know you're a lesbian? https://t.co/D97NhfLDcC Today I missed college for the first time ever. I literally had to calm my sick self down that it was fine and needed. #adultproblems Just a nostalgic reminder that Freaky Friday 2003 with Jamie Lee Curtis and Lindsay Lohan is a treasure. I think I should write a book about how to be a good gay to the straight people in the world. It will have the responsibilities you have when you are gay to help the straight people in the world. Hey @hussain31320, Thank you for the follow! *get The gays don't possessed by demons because we already have one inside us making us gay #mcdonaldsmidnightthoughts Hey @megkasparr, Thank you for the follow! Hey @AbbyEborn, Thank you for the follow! Hey @cait_stewart13, Thank you for the follow! Hey @Chad_theRad_Dad, Thank you for the follow! @copcar97 Why thank you ☺️ Hey @AegisChris, Thank you for the follow! @megsanalien @rachillax This made my life!! @copcar97 https://t.co/e2AtItxXLw @metteharrison @ElleMaeGal Done RT @metteharrison: If you can, please send an email to constituentservices@utah.org to insist Governor Herbert continue with his pledge to… People's replies to brand accounts and famous people are genuinely great entertainment. @ladygaga Today me, my bi best friend, and two straight best friends were talking after class and I brought up how I walk fast and my bi friend said, “it’s cuz your gay and have to walk fast because we gotta outrun the homophobes” and I’m dying 😂😂😂 Hey parents, bishops, and anyone else this applies to: don’t make your kid do conversion therapy if they are LGBTQ+. That is child abuse (thanks human development).\n\nAlso that terrified me as a closeted gay before. #banconversiontherapy RT @alexmuench: Signs you need a break:\n* loosing interesting in things you’re usually passionate about and bring you joy\n* short temper an… @NathanConder My genuine reaction was the oof sound from Roblox https://t.co/zvYkqoErcp @AtomicFirebird @greylikestorms I’m not a huge fan of horror movies but I enjoyed the sixth sense which is like my level of horror movie RT @calvinjburke: My first year at BYU I was pressured by a professor (who should've known better) to participate in conversion therapy\n\nEa… @ap_thleen_price Ben Platt\nAnd musicals I have vague memories of a poem or book or something that looked like Shel Silverstein or something about being sick and once she figures out it’s Saturday she’s fine. And honestly it kinda made being sick look fun. I do remember there being cinnamon toast too. #vaguechildhood *So How am I the only gay person in a cast of a musical? Which then has a group chat which talked about the office and you were Oscar because you’re the only gay one Do I just made $10 by shaving a 6 pack into the stomach hair. @jay_douglas23 https://t.co/fllk7XquJv I was today year's old when I figured out that colors in the rainbow are kinda mixed. Like red mixed with yellow is orange (so ROY) and yellow mixed with blue is green (YGB) and then I'm assuming that Indigo is (and minimum research) is blue and purple (BIV). #tootiredtofunction I was today years old when I find out earrings are just ear     rings. #1amthoughts I literally don't know why I've never thought of this spooky username In 4 days it will mark the 4 month anniversary of me coming out! #NationalComingOutDay So honestly we stan leads in musicals that are so nice to everyone and not divas.\n.\n.\n.\n\nI'm talking about my two amazing lead friends who are freaking amazing @annarpeacock and @jay_douglas23! Hey @annarpeacock, Thank you for the follow! So a little awesome testimony thing: I was feeling really anxious about life and problems and stuff I gotta do and I prayed and I feel good. #midnighttestimony I figured out that I'm also anxious about other people that have done more than me - if I know them personally - (which sounds selfish and kind of is).\n\nI am also anxious about the future and anxious that I don't know what I want exactly to do and be.\n\nWell, that's all for today. ... gotten better over the years but it still sucks sometimes.\n\nI'm afraid of failure which kinda sucks if you are in the entertainment industry.\n\nAnd finally (for now) I'm anxious about my anxieties but sharing them feels good! I thought of more anxieties to share on this #WorldMentalHealthDay.\n\nI'm anxious about not doing enough and not getting recognition. It all stems from seeing people who've \"made it\" and how their lives are.\n\nI'm anxious about being sick and not feeling well. This anxiety has... ... about what I've said in group chats or with people. I'm worried what they'll think and I'm 18 years old and passed high school where that should matter. I used to have a persona of not caring but now I do. It's something that I have to sometimes just forget. That's it for now ... not taking this opportunity that I was given (wedding reception I forgot to go to, tickets I was given to something) and I have to keep thinking why I didn't go. Sometimes, of course, I have rehearsal but sometimes I kinda wish I'd still gone.\n\nI also get anxious thinking... For #WorldMentalHealthDay I'm going to share some of my random anxieties:\nI get anxious when I think of things that I had wish I had done and I can't stop thinking of it over and over again and have to find excuses for why I didn't. Examples are: not auditioning for this show... Here are some resources:\n\nSuicide Prevention Hotline: https://t.co/KJ8vBfGIR5\nhttps://t.co/hOYHky0oZ9: https://t.co/m8aP55onA7 Hey, remember on this #WorldMentalHealthDay that you are amazing and you can get through this if it is something that is for now and if it is for your life you can live a wonderful life and find help. I stand with you as someone who had/has some mental health problems. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a 2019 #NYCC exclusive Captain Marvel (Mar-Vell) Pop!\n#Funko #Exclusive #… My dad, Chris, who I love and is so amazing \nMy old neighbor friend, Christian, who is on a mission and is very smart and kind\nAnd my new college friend Christian, who “proposed” to me in class and now we have a marriage pact for 30 https://t.co/1FQVn8i6PO @julia__ghoulia LOL ok. But I appreciate your love for Shakespeare and you should go for it!!! @julia__ghoulia Become the theatre teacher!!!! @_samigrey Don't deactivate your twitter plz Can someone please write the Ronald Mcdonaldlogues!? #BigMouthSeason3 Hey @mapmaster32, Thank you for the follow! Hey @jay_douglas23, Thank you for the follow! Definitely hey y’all https://t.co/IG1LMVWO9Y Liked on YouTube: ADAM SANDLER Gave ME A Standing Ovation! https://t.co/nM6p4mPpHU @templebdparadox Honestly this all made my day. You guys sound so amazing!!!! Liked on YouTube: Hidden Miracles: Life After the Sandy Hook Tragedy https://t.co/UpVQhcptU0 Does gay twitter who are struggling after conference wants to hear how I watched Love, Simon with a boy last night who I'm kinda into. And we decided that I'd be Simon cuz I'm white and he'd be Bram because he's black and my heart hasn't stopped racing since then. @templebdparadox I think you've found a dream man and I'm kinda jealous rn.\n\nAnd obsessed with this tweet! I'm going to be like all my college friends who are girls and say \"I really want a baby\". I just got a 100% on my practice test first try! #HECKYEAH!! So my human development textbook called out adoption agencies that don't allow gay couples to adopt and so I say officially: WE STAN KATHLEEN BERGER!!! And the author of the textbook agrees. But Sigmund Freud is canceled. Nevermind I'm really dumb and didn't realize it was just a theory. I think my human development book just canceled itself? @calvinjburke What talk was this? Human Development makes me wish I was rich so I could take care of all the unfortunate kids in the world! So idk how the rest of Queer Mormon Twitter feels about it, but I really am enjoying Elder Soares talk. When he mentioned same-sex attraction and wasn't super heavy about \"getting over it\" or \"not giving in\" etc. but was like, \"it sucks I know, but you're awesome\" I liked it. To continue: Ask your straight friends if it something that is worth considering. Then skim through it and find the good bits, or ask them to tell you.\n\nAlso remember the difference between homophobic and hurtful things and “calling out” or telling us change is important My Queer Conference Survival Guide:\nIf someone mentions something homophobic, transphobic, or something that would effect your emotional health than just mute the video/TV and wait they’re done. I haven’t done it yet but I feel good about it. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a 2019 #NYCC exclusive Iron Man Pop! #Funko #Exclusive #Giveaway #FunkoNY… RT @sttepodcast: Day twenty of our twenty days of Funko is this set of Jaws Pops! \n\nJust follow @sttepodcast and RT this tweet to be in wit… Liked on YouTube: The Touring Cast of Once on This Island Will Make You Dance With This Opening Number https://t.co/5UuFAcDJ5L Liked on YouTube: Mj Rodriguez &amp; George Salazar: Suddenly Seymour https://t.co/4fZBJzvTsw Liked on YouTube: the best of: Ben Platt https://t.co/W9t76BLkWA Being an adult means forgetting you didn’t cancel a subscription and wasted $30 on some stupid sleep app Liked on YouTube: connor walsh being an underappreciated gay icon for 8 min and 14 sec https://t.co/rhnAsLdaJ1 Hey @musicalmanpod, Thank you for the follow! Ok this wasn’t a fever dream or elaborate prank. Phew 😌 https://t.co/dQUjvVUyA2 Did anyone else get the email about changing how witnessing ordinances happen in @LDSchurch ? Liked on YouTube: Spelling Bee-Kini Wax #3 w/ Courtney, Matt, and Tommy https://t.co/zsAETQFWqv I definitely read this ad as musi cal like high school musical https://t.co/mkUETGQzxw RT @ellieryanh: wintertime is just me and my vitamin C gummies against the world So I had the most Utah and yet the gayest thing happen: In my freshman seminar this boy who has become my best friend but we've only known each other for like 6 weeks said, \"Adam, we should just get married.\" #ofcoursethisisajoke #butmaybenot Liked on YouTube: Captain Holt plays the gay card https://t.co/hhytny1GTT Liked on YouTube: The Comprehensive Guide To Boomers On The Internet https://t.co/D8C4wJMxAz RT @OriginalFunko: To celebrate the announcement of #StrangerThings Season 4 we are giving away a @baskinrobbins exclusive Steve Pop! RT &amp;… I really hope the lady on the train with me doesn’t think I was judging her because her daughter was a little loud. I really didn’t care. #ikindafeelbad #overthinking #anxietyproblems There was literally a probably 4-6 year old posting on the life hack Snapchat story and I'm shook RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Walmart exclusive 10” Oogie Boogie Pop! #Disney #Giveaway #Funko #Funko… The epidemy of being gay is not realizing that one of your female friends from college is married until you become friends on Facebook. #gaycollegelife #gaylife #iguessidontcheckgirlslefthands Doing human development homework makes me worry whenever it mentions something that relates to me and makes me wonder if it's because of what it's saying. #stressingaboutlife #college RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a 2019 #NYCC exclusive Ms. Marvel Pop! #Funko #Exclusive #Giveaway #Funko… Hey @MJCaan, Thank you for the follow! @BenSPLATT playing an emotionless character after seeing him as Evan is amazing! I love @lauradreyfuss' character! @BenSPLATT mentioned that #JuliaSchlaepfer's character speaks 6 languages and I immediately thought of the song from #The25thAnnualPutnamCountySpellingBee. #theatrepeople #theatreperson @GwynethPaltrow's character in @the_Politician makes me feel!!!! I'm watching #ThePolitician on @netflix and @BenSPLATT's character is the gay I want to be. RT @began_7: A video you never thought you needed til now. Aristocats v Lizzo. 🙌🏻 https://t.co/mex06gDccN RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #NYCC exclusive @Loungefly Star Wars backpack with pouch! #Loungefly #F… Probably Pink-6-A https://t.co/Jfs1U74A7q RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @disneyparks exclusive Chef Figment Pop!\n#Disney #DisneyParks #Funko #F… So I know that God cares about my stupid issues because I forgot to buy a cast T-shirt for the show I'm in and I was mad. I contacted marketing and he said if they had extras I could get one. Turns out one of the men accidentally ordered two XL shirts so I can get one. #heckyeah RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a social media Freddy Funko! \n#Pop #Funko #Exclusive #FunkoFamily #Freddy… @sydneemcelroy I got a flu shot by myself for the first time in a dark Target. https://t.co/YFWLID6E6g RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a 2019 #NYCC exclusive Pop! Rides - Matterhorn Bobsled with Mickey Mouse!… Hey I'm grocery shopping and getting a flu shot https://t.co/kY6ziffLHz Hey @broadwayslyrics, Thank you for the follow! Hey @monetswilson, Thank you for the follow! Hey so one of my friends from high school got scammed out of some money and needs to pay bills. She's literally only 17. Here's her GoFundMe: \nhttps://t.co/6xiYmilbNh So this past week has been a crazy week for Sweden. We had @GretaThunberg being a legend at the UN summit but then we had (spoilers for tall girl) freaking Stig being the worst. RT @Johnny_Allman: There’s nothing that can stop you from becoming popu–\n\n–ler                              –lar https://t.co/iotY2q9TRN 16-year-old @GretaThunberg will be the reason that I actually have a future! #stanninggreta I was eating a blue ring pop and looked at myself and the mirror and realized that blue kinda looks good on my lips so I need recommendations for blue lipstick. @MessyPod @aristotlepolite @kylemarve @MTV What’s some behind the scenes tea? RT @AlanHenry: respect 👏🏻 your 👏🏻 stage managers 👏🏻 Liked on YouTube: Being a teacher is one of the hardest jobs in this country... https://t.co/NRHMcfhOgr We stan an institute teacher and class that tries to set you up with a girl and you awkwardly avoid it but just act flirtatiously awkward as a gay. @hayzul_nut https://t.co/udHHx7WkKx I don't usually get political but I think it's about time we had a woman president. I freaking hardcore stan my sister @sarahlynn465 so freaking much!!!! https://t.co/SKWWk9h3HO Today my Human development class homework mentioned a gay couple parenting kids and I officially stan it so much. RT @sttepodcast: Day seven of our twenty days of Funko is this Little Shop of Horrors Pop!\n\nJust follow @sttepodcast and RT this tweet to b… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Target exclusive 10” Charmander Pop! #Funko #Pop #FunkoPop #Giveaway #P… Literally, everyone who is the teenage ensemble of the show that I am doing rn is dating someone. Literally everyone but me (and like 2-4 of my friends). I'm dying because some of them are like 15. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a 2019 #NYCC exclusive Pink Chrome Batman Pop!  \n#Funko #Exclusive #Givea… So sometimes I'm sad and alone and I watch Great Big Stories and start crying. #livingaloneadventures So the next two weeksish is going to by my life living alone. I'm already kinda terrified, but I got this. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a 19” Batman Pop! \n#Funko #FunkoPop #Giveaway #DC #LongLivetheBat  #Batma… I've figured out by being alone for less than 12 hours and counting that I will always probably want a roommate when I move out. #lonelyandbored Liked on YouTube: Lizzo Sings Beyoncé, Rihanna, and Janelle Monáe in a Game of Song Association | ELLE https://t.co/PdLLEgajId Also \"Wish You Were Gay\" by @claudmp3 is my new theme and I listened to it today while staring at this cute boy on the bus, also it was rainy. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Loungefly x DC Comics Batman 80th Anniversary Backpack. #Batman80 #Lon… So I was watching a @WatchMojo (MsMojo) list of Top 10 Best LGBTQ+ Coming of Age Movies and it had the scene from @lovesimonmovie with Jennifer Garner and I wasn't ready to cry, but now I am. So I'm probably gonna go to bed and cry even more. Does anyone else get excited when they write an essay and they cut out a terrible section and everything falls together and makes complete sense. RT @sttepodcast: Day four of our twenty days of Funko is this Beetlejuice POP! \n\nJust follow @sttepodcast and RT this tweet to be in with a… So I was just informed that I am now the freshman rep of AAT @WeberStateArts and am hosting the freshman showcase tomorrow at 4pm in room 230. Come and support or maybe if you’re feeling brave come perform literally anything. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a 2019 #NYCC exclusive Kevin With Up House Pop! Town! \n#Funko #Exclusive… So I bought a \"Wish You Were Gay\" shirt from #Claud and now I think I can be an official gay. So I have to listen to this speech from Toni Morrison's acceptance of the Nobel Prize for Literature in 1993 and I think y'all should also listen to it: https://t.co/4uuiggv8b3 @Caesar_Martinez I also realize that I am going into education so I'm now terrified for myself and my future students. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a 2019 #NYCC exclusive Suzie Pop! \n#Funko #Exclusive #Giveaway #FunkoNYCC… @Caesar_Martinez Yes and this still terrifies me as someone who goes to college even though I live off campus. RT @alishbahah: This is the best video I've ever seen https://t.co/I6HR5sdt5H RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Pikachu Pop!  \n#Funko #FunkoPop #Giveaway #Pokémon https://t.co/d3zKVWE… Liked on YouTube: Go ⏳ | Freaky Friday | Disney Channel https://t.co/nJHYbg337Y I was trying to search for Weber and I accidentally typed in Wee. So I think that should be it for today. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Funko Shop Exclusive Freddy Funko &amp; Huckleberry Hound Vinyl 2-Pack!\nhtt… @PattiMurin What’s the craziest thing you’ve done? (I’m excited to see how this’ll work) RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN the Golden Freddy Idol Pop! pin! \n#Funko #Exclusive #Giveaway #PopPin htt… TODAY IN HUMAN DEVELOPMENT: If you suppress women it is more likely you will have malnutrition. #scientificfacts RT @sttepodcast: Thank to our friends at Universal we have this Downton Abbey prize bundle to giveaway \n\nJust make sure you follow @sttepod… At Weber I more just notice so much flirting and am pretty oblivious when it's me being flirted with. https://t.co/QVsVGXQX6o @kurtisconner you gotta react to this!!! 15 Men Compete for 5 Women https://t.co/rQ9rnsTAoh via @YouTube Today I actually got invited to hang out with some friends I met in COLLEGE. Guys this is the first step in to actually having college friends, not from High School. #imsofreakinexcited #thisisthebeginning #partyitup Looking at every show and musical out there and shows that I could do and shows I probably won't be able to do is so overwhelming. #theatre #theatrelife #internalizedanxiety Hey @PresidentBishop, Thank you for the follow! @Kyrsten_Marie96 No problem @Kyrsten_Marie96 And finally, end with \"Thank You\" and then go grab your music and leave/sit down (some theatres have a group in together).\n\nAlso just breathe throughout it all. You'll do great if you are prepared!!!! @Kyrsten_Marie96 They can usually tell your skill right when you start, but they usually want to see some character. Move around a little and make sure your movements are thought and not little nervous ticks. They usually are very relaxed with that, especially community theatre. @Kyrsten_Marie96 Tell them how fast you want the music (usually under your breath kinda sing it) and where things start and end (always clearly mark it too) and you can ask for a starting note.\n\nWhile performing make sure you show more than just singing. @Kyrsten_Marie96 The format is usually: \"My name is ______ and I'll be singing ____ from ___ (and if you have a monologue) and performing (either ____'s monologue or a monologue) from ______.\n\nBefore you do that, when you walk in, hand your music to the accompanist (if you have one). @Kyrsten_Marie96 You are always auditioning while in the rehearsal process (so if you've done a show with someone on the production team hopefully you were nice) and right when you walk in the door. Walk in shoulders up looking confident. Introduce yourself (we call it slating). @Kyrsten_Marie96 If you need a monologue you can find them online. The call should usually say how long they want that.\nIn the audition: make sure you are dressed business casual at least. Dressing up as the character is too far and stifles what they can see from you, but don't be too sloppy. @Kyrsten_Marie96 Third, figure out what they want (that should be first technically but I just remembered it). They may want a monologue as well and a certain cut. Follow these things exactly. Some theatres only like 30 seconds, some allow up to 1 minute and even 1:30. @Kyrsten_Marie96 First, you need to pick a song. Matilda is contemporary and kinda quirky and comedic. You can usually google songs to audition for _____.\nSecond, find a voice teacher for one or two sessions. If you do 2 they can find you a song, if you do one make sure you've already found one @Kyrsten_Marie96 If you need help still I can help @YourGingaNinja @sfosternyc @PattiLuPone @PattiMurin @SOPHIANNECARUSO @lesliekritzer @KerryButlerNyc @KRYSTAR0DRIGUEZ Barbara Streisand and Anne Hathaway really most Broadway actresses Ok so more like an hour and a half but I did it You want proof that I did it!! I really did https://t.co/6QXSLO2DCG RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Funko Shop exclusive Colonel Sanders Pop! #Funko #Pop #FunkoShop #Exclu… How come nobody told me about #BarbaraStreisand's album, Encore! Freaking @YouTube had to recommend it to me and I'm in love with it. Why are some people just themselves?! Literally everyone calm down and just stop. I'm dedicating the next 6 hours of my life into learning the choreography from \"Rain\" by @BenSPLATT. @megamindirl I literally keep getting this on Facebook and was tempted to read it. Thankful I haven't. Holy cow RT @Loungefly: RT &amp; Follow for a chance to win this Lion King Wallet! \n\n#Loungefly #Disney #LionKing #Wallet #Giveaway https://t.co/ySHWTsi… The epidemy of being gay was being confused if this girl was hitting on me while she literally walked me to class. #imstillconfused #theatrepeopleconfuseme Liked on YouTube: Ben Platt - RAIN [Official Video] https://t.co/FT8c2iKBGH RT @NerdyGayMormon: Last night we had our annual Ask The Stake President Fireside. \nThe final question of the night was, \"What if someone i… @ElleMaeGal Me when my cute friend came out to me and I wanted to be supportive but he's cute RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Funko Shop exclusive Big Yella Pop!\n#Funko #Pop #FunkoShop #Exclusive #… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a PX Exclusive Pop! Batwoman Pop! \n#Funko #FunkoPop #Giveaway #DC #Batwom… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a 2019 #NYCC exclusive Edgar Allan Poe Pop!\n#Funko #Exclusive #Giveaway #… Liked on YouTube: when characters in musicals transition from speaking to singing https://t.co/AS6LZM0egg Um, so I think that the service for my online class's textbook doesn't like criticism because I was trying to submit an error (because I couldn't tell who was the father and the mother based solely on the names) and it said \"Error submitting report\" so... we have fun Does anyone else get overwhelmed by how much Gospel Centered literature and scripture study ways there are? Ah, the stupid news video in the article!!!!!😥 I thought I was done, but then it came back!!! And the tears are here. We've done it, boys. I'm crying. Welcome to my live-tweeting about this section because I'm about to be in literal tears because of this super cute picture of a boy with down-syndrome. Ah, the section on Genetic Abnormalities is making me feel. So I almost started crying while watching a video in Human Development, either it's too late, I'm losing my mind, or I'm extremely sensitive. RT @calvinjburke: STOP talking cr*p about the Modern Prophets of the LDS church. All of them are good\n\nNelson was a heart surgeon\n\nMonson w… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a 2019 #NYCC exclusive Dwight Schrute Pop!\n#Funko #Exclusive #Giveaway #F… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Hottopic exclusive Pennywise with Skateboard Pop! \n#ITEnds #ItMovie #I… T - I'm too last to redo it I remember last week when my mom mentioned to me when I got home one day that she saw this kid at her job at a junior high who was gay and being bullied and how she wanted to stop it (it's good now) and I told her I'd throw hands for this kid And I had to tell her what that mean RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Funko Shop exclusive Pennywise Pop!\n#Funko #FunkoPop #Giveaway #IT #ITC… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a @PostMalone Pop! https://t.co/BE7JkvB49s The Twitter Mormon Gay community literally makes me so happy!!!! 🏳️‍🌈🏳️‍🌈🏳️‍🌈😊😊😊 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Conan as Pennywise Pop!\n#Funko #FunkoPop #Giveaway #IT #ITChapterTwo #P… My Intro to Theatre teacher used Disney movies to talk about critical literary theories. #collegelife RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a 10” Pennywise Pop! \n#Funko #FunkoPop #Giveaway #IT #ITChapterTwo #Penny… Hey @R89Vnukov, Thank you for the follow! Last year in salt lake City #WeAllComeFromAway Liked on YouTube: Joe Lycett Impersonates RBS Boss to Get £8,000 Back to Scammed Customer | Joe Lycett's Got Your Back https://t.co/cFIMHdPNZ9 Liked on YouTube: Two Sisters https://t.co/6GyMlrGF6q Liked on YouTube: OUR BIRTHDAY :) https://t.co/gx3JiagPGw @ElleMaeGal Crying in the shower listening to Sam Smith Today's mood is crying after rehearsal in the shower listening to @samsmith Hey @ElleMaeGal, Thank you for the follow! My credit checking program told me I was and this kid at auditions thought I was at least a junior cuz I knew how to audition well. #ifeelattacked https://t.co/RXQ3siPUTI RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @officialfye exclusive Deet with Baby Nurlock Glow-in-the-Dark Pop! #Fu… @ElleMaeGal I had crushes subconsciously, they just thought I was really nice. If gay Twitter is reading this I need advice: this cute guy came out to me after l came or publicly because he says was inspirational. I told him I'd be good support but he's so cute. What do I do? RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Walmart exclusive Pennywise with blade Pop! \n#ITEnds #ItMovie #It #Penn… People in the comment section for movie trailers should shut up. I don’t care that this actor is in everything, I don’t care about stupid things from the trailer, I don’t care about your opinion, and I don’t need you to tell me that the trailer told everything. #adamssoapbox Liked on YouTube: MISS VIRGINIA Trailer (2019) Uzo Aduba, Matthew Modine, Vanessa Williams Movie https://t.co/nk3rMOiQio So @WeberStateArts gives out coloring books so I can officially say that I'm ready for college. @ellieryanh Literally TBT https://t.co/rX53avGevz RT @molly_moo_who: If the red team and the blue team just work together they'd score way more points...... RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @BoxLunchGifts exclusive Jack Skellington in Fountain Movie Moment! #Fu… Liked on YouTube: Encore! | Official Trailer | Disney+ | Streaming November 12 https://t.co/AjnLJsyTUu Liked on YouTube: Drake &amp; Josh in Minecraft https://t.co/T34wBNFjFp Liked on YouTube: Team YouTube REFUSE to Help Pewdiepie... (Replied to me) https://t.co/ijSBBocDha Somehow this far in my internet usage, I haven't been hacked, yet literally, all my friends have. Is this good luck or is this a sign that I'm not cool enough to get hacked. @the_tomsters THEATRE!!!!! 3\nBut I couldn't. But anyway enough about me. Just know that if you are bisexual, you are valid in your emotions. It's tough, I've kinda been there. It's such a strange struggle that I had and tbh being gay is kinda the easier option in that case.\ntl;dr: If you're bi, we stan!!! 2\nOn my journey of self-discovery, I once thought I was you and that I could be in the \"straight-passing\" group (which I know some people think is different than bisexuality and I respect that) and that I love and marry a woman but just feel feelings for men. Thread 1\nI've been reading a ton of tweets about the bisexual community and as a gay man I have to say I am so sorry that people on both the gay side that I am a part of and the straight side that many people I know (who are still so supportive of me) don't understand you. Hey @Stepaniezpp, Thank you for the follow! RT @homohex: if your favourite childhood characters were:\n\nmulan\nmarceline \nvanessa doofenshmirtz \nkim possible\nwendy from gravity falls\nth… RT @ThePopPros: Applications Now Open.\n\nhttps://t.co/EX9D5rxJUb\n\nIf you are selected to join, we will contact you via email with instructio… Liked on YouTube: I Auditioned for a West End Musical https://t.co/FAw2JRkWzB Liked on YouTube: TIM: a short film (feat. \"Mr. Sandman\" by SYML) https://t.co/3Gy0KhEjlX Hey @JewishRen, Thank you for the follow! Liked on YouTube: if vines were made by cartoon characters https://t.co/ZhEPSF94JM RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @BoxLunchGifts Exclusive 6” FLOCKED Appa Pop! #Funko #FunkoPop #Giveawa… So my institute teacher said today is the beginning of the rest of my life and I'm about to have an existential crisis RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a PX Previews Exclusive Miles Morales Pop! #Funko #FunkoPop #Pop #Giveawa… Liked on YouTube: Why Are Weird Musical Adaptations So Popular? (ft. Sarah Z) https://t.co/Tf6fNe3nf3 So I finally watched the video of me after wisdom teeth surgery... Liked on YouTube: HELP LUI CALIBRE COME BACK TO YOUTUBE! https://t.co/b7B0X91ANI This girl I \"dated\" my junior year (when we were both immature - and I thought I was bi) is the lead in the show I'm in. I texted her today apologizing and also telling her I was gay...\n\nand we're fine now. I think it's great. A year and a half of stress and resent is gone. Liked on YouTube: I STILL BELIEVE Trailer (2020) KJ Apa, Teen Romance Movie https://t.co/DxWmvAVK9i Also WTF is this story: https://t.co/ByftZTDPak RT @sttepodcast: Day sixteen of our twenty days of Funko is this Die Hard Target Exclusive Pop! \n\nJust follow @sttepodcast and RT this twee… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win the Golden Freddy Idol Pop! pin! \nHead to the blog for more information o… I was doing research on being a high school jock (for a role) and it turned gay. https://t.co/902jexY7Tr - this story is great. #imlaughing #whydoesthishappentome #gay Does anyone else keep getting ads for the SAT on YouTube? I'm about to start college and I think YouTube thinks I'm still 16. #whaddayado RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Funko Shop Exclusive Rainbow Bigfoot https://t.co/i44O89PDee https://t.… Liked on YouTube: Sketch Group The Valleyfolk Performs in the Comedy Clash Round - Bring The Funny (Comedy Clash) https://t.co/qDtpOlSV5S Liked on YouTube: We Bought 10 Products On Wish for ONLY $1! https://t.co/G0XhTD9YKI RT @KickinItPerSe: My 6yo, about to leave for his first day of 1st grade: “I’m not all the way brave, but I’m brave enough.” RT @pop_o_cIock: RT + follow @pop_o_cIock for the chance to win a FREE SDCC 2017 Exclusive Tony Stark holding Iron Man Helmet Pop! 🎁 https:… RT @OriginalFunko: RT &amp; follow @OriginalFunko\n for a chance to WIN a social media Freddy Funko! \n#Pop #Funko #Exclusive #FunkoFamily #Fredd… RT @Twitter: Retweet for night mode\n\nLike for day mode Liked on YouTube: A DAY IN MY LIFE https://t.co/1KivUleOY5 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Target Exclusive Goldenface Pop! #TheOffice #Funko #Pop #Exclusive http… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Hobbiestock Collectibles Exclusive glow-in-the-dark Jollibee Pop! https… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @RobZombie Pop! https://t.co/U0qpSlwYnA RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Funko Shop Exclusive Mister Sprinkles 3-Pack Pop! bundle! https://t.co/… What if I became a drag queen and based my persona off a Broadway diva? #randomthingsikindawannado Liked on YouTube: Avengers What If Comic Con Trailer Footage Breakdown - Marvel Phase 4 https://t.co/HmIA8cCaX2 Liked on YouTube: I now have the only Volvo 240 in the world that plays Toto’s Africa as the open door chime! https://t.co/JvTHhgpjZQ RT @OriginalFunko: RT &amp; follow @OriginalFunko\n for a chance to WIN a social media Freddy Funko! \n#Pop #Funko #Exclusive #FunkoFamily #Fredd… One of my relatives on Facebook posted a post about finding a 9 in a group of 6s and I don't know if he just accidentally shared a 69 meme by accident or it was genuine \"challenge\". RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Loungefly x Disney Maleficent tote bag! #Disney #Loungefly #Fashion #B… Liked on YouTube: Jonathan Groff Sings a Voice Memo as Frozen's Kristoff for Jimmy's Kids (Full Version) https://t.co/UyASkc0F8j Liked on YouTube: 10 Toy Weapons That'll Make Your Friends Jealous! https://t.co/gTlM3cSyeE @sarahlynn465 @cthellewell27 He doesn't use it often Hey @cthellewell27, Thank you for the follow! Sometimes I drunk tweet after wisdom teeth surgery!!! Those Chen's Ted she window He's got good work She died Her face looks like. N My teeth hurt Mupitj feels silly https://t.co/ebRCEXr2AG How he not read I don't know how to tweet tooen : my favwbandnjeas feel silly haha tjisbgiy hotnhisb head filled with Rick how much more can I tweeit3 In heterospect those \"crushes\" on girls where more like me wanting to just be best friends https://t.co/Y8EQHhfHZe Liked on YouTube: Bohemian Rhapsody by Queen but https://t.co/ogdR7pEHM3 Liked on YouTube: Iconic Vines Recreated in Animal Crossing Compilation https://t.co/URV9V6vKfg https://t.co/viesbpNTjd https://t.co/qDfOk8ijIv Ok, my anxiety moment is over. I know don't care about the count of my twitter followers. On the day of auditions, this happens. I figured this out. Phew! RT @SurgeProxies: 🎉GIVEAWAY (3 WINNERS) 🎉\n\n1️⃣Metallic Children of the Forest, Lifetime Pop Pros &amp; FK , Surge Monthly Proxies\n2️⃣ Flocked B… 3) and YouTube videos I like because I set up a thing that shares them and I don't really care to change it/I'm too lazy After looking over my past tweets I've decided that I tweet about:\n1) Random retweets from celebrities/magazines (somtimes with commentary) that I think are cool and funny - like most people\n2) Giveaway crap (I think I have a problem because half the time I don't even care #onlycovermyfood @TheTylt Sometimes I have random moments of anxiety about stupid things: like just barely I went on a hunt through Twitter analytics to see if I have lost followers. I have, but then I realize, do I care/why would really anyone follow me anyway because of my trash tweets and stupid tweets Hardest decision!!! But I'd probably say @sfosternyc https://t.co/cRf2SAdx8i RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Reds exclusive Eugenio Suarez Pop! Prize pack! \n#Pop #Funko #Exclusive… RT @sttepodcast: Day thirteen of our twenty days of Funko is this Austin Powers Pop!\n\nJust follow @sttepodcast and RT this tweet to be in w… @ShmannersCast Do you/how do you share the cost when sharing food delivery? RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win @disneyparks exclusive glow-in-the-dark Madame Leota Pop!  #Disney #TheHa… Sometimes for a nostalgia kick I listened to the @SpongeBobBway Cast Album and sing loudly while mowing my lawn and my mom gets a text from my neighbor saying: \"Adam was singing this pirate song and I love it, it had a lot of after\". I think I got too into Poor Pirates. 😂😂😂 @sarahlynn465 I'm having fun rn. It's a nervous excitement!!! Also idk how to put this but I'm getting my wisdom teeth out tomorrow so if people who know me wanna do anything, you can. I don't really care but I thought I'd leave it out there. I'm practicing riding the bus for college today. #AdultingAndStuff Liked on YouTube: Theater Kids https://t.co/yDKQLjUfZ7 @DallingaJj https://t.co/Td5XLGIxlB RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a MTV Moon Person Pop! \n#Funko #Pop #MTV https://t.co/Gr09MGoMpC @sarahlynn465 mom 😂😂😂 https://t.co/8CzIHnyoLe RT @sttepodcast: Day twelve of our twenty days of Funko is this flashing Gremlins Funko Pop!\n\nJust follow @sttepodcast and RT this tweet to… @smaisley The hate u give @jessthelarper My cousins kid on Snapchat filter https://t.co/7QAtoKj805 Hey @MrsMerc49680619, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop exclusive The Hunter Pop! https://t.co/JXTUBfOpm0 #Funko #Po… @LaurenW21359754 I don't know you in person, but I already love you!!!! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a @boxlunchgifts exclusive Mansion Groundskeeper Pop! #Disney #TheHaunted… RT @sttepodcast: Day eleven of our twenty days of Funko is this Die Hard Target Exclusive Pop! \n\nJust follow @sttepodcast and RT this tweet… Which Store Makes The Best Custom Sandwich? https://t.co/k2M8BJ0zvP via @YouTube @ellieryanh Liked on YouTube: LAST CHRISTMAS Official Trailer (2019) Emilia Clarke Movie https://t.co/2mT9LjBQ9O Liked on YouTube: Claud - Wish You Were Gay (Official Music Video) https://t.co/6HY3OF84mu RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a @DisneyParks exclusive Basketball Mickey Pop! \n#Disney #DisneyParks #Di… RT @sttepodcast: Day ten of our twenty days of Funko is this Bob Ross Target exclusive pop!\n\nJust follow @sttepodcast and RT this tweet to… @vancebryce @NickAltishin I'm gay but I'm going up there was no problem Hey @funkonotify, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a social media Freddy Funko! \n#Pop #Funko #Exclusive #FunkoFamily #Freddy… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN three @HotTopic exclusive mini vinyl figures from The Haunted Mansion! \n#… This is the best thing!!!! Thanks @landonlee907 https://t.co/EsiIAwwmNT Have you seen this @BeetlejuiceBway @ABrightMonster @SOPHIANNECARUSO @lesliekritzer @RobMcClure @KerryButlerNyc beetlejuice musical on crack https://t.co/WmUdhAyMbd via @YouTube RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win the Golden Freddy Idol Pop! pin! \nHead to the blog for more information o… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a @OtterPops Pop! Prize Pack! https://t.co/e1cDv4oA8G RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a  @EverettAquaSox  Exclusive Webbly Pop! #FunkoField #FunkoFriday #MiLB… @landonlee907 If you haven’t already done if you could hie to kolob @kblairhirst If you’re still doing it RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a 10” Ursula Pop! https://t.co/WvZqlvdIVL RT @sttepodcast: Day eight of our twenty days of Funko is this whole set of Lost Boys Pops!\n\nJust follow @sttepodcast and RT this tweet to… RT @mastracola: @adamdoestw Cardinal Flower! https://t.co/khREs5DVvl Liked on YouTube: My Bathroom Is On Reddit (Mildly Interesting #11) https://t.co/6hFfxz3sOk RT @mmmeeggss: i mean the obvious answer here is BOTH, I'm an ambivert with social anxiety and fomo but 🤷🏽‍♀️🤷🏽‍♀️🤷🏽‍♀️ RT @mmmeeggss: Okay but\nAm I truly an extrovert with social anxiety \nOR\nAm I actually an introvert with chronic FOMO?\n🤔🤔🤔 RT @sttepodcast: To celebrate the release of our Hobbs &amp; Shaw episode that’s released today we are giving away this The Rock Funko Pop\n\nJus… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop exclusive Jim Halpert Pop! https://t.co/JXTUBfOpm0\n#Funko #P… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win the Golden Freddy Idol Pop! pin! \nHead to the blog for more information o… 9 https://t.co/plavWFNesj RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win #SDCC exclusive Kang and Kodos Pop! 2-Pack! #SDCC #FunkoSDCC #SDCC50 #SDC… Love, Marriage, and Health. 🙃 https://t.co/A04UluNp0s Umm, yes. https://t.co/lzMBvscWH9 @derchadmeister https://t.co/LVegF9anc0 Liked on YouTube: PARENTS/KIDS REACT TO MR. ROGERS (Won't You Be My Neighbor? Trailer) https://t.co/8swM0EtsBM Liked on YouTube: Mr Rogers ... Cool Dude https://t.co/y8Ag07pJIF Liked on YouTube: Mister Rogers as a Father and Grandfather https://t.co/quwSxn7tcn RT @sttepodcast: Day three of our twenty days of Funko is this exclusive Beetlejuice pop!\n\nJust follow @sttepodcast and RT this tweet to be… Liked on YouTube: My drunk friend sent this to me at 4:04am. https://t.co/48vi0Sii7M Liked on YouTube: The Kind of Story We Need Right Now: Waitress Body Slams Groper https://t.co/Ldg4rRgRls Blowing Bubble Gum https://t.co/6NJVwsg5fb RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win #SDCC exclusive Man-Thing Pop! \n#SDCC #FunkoSDCC #SDCC50 #SDCC2019 https:… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Harry Potter Funkoverse prize pack!\n\nThe Funkoverse is now available… @DallingaJj https://t.co/sOX00O8mEC @ellieryanh Believe by Cher @sarahlynn465 Which ones? I need recommendations for work on Monday. Liked on YouTube: Arrogant Tik Tok Star Pretends To Have A Girlfriend For Views... https://t.co/XKg11gIAIn Liked on YouTube: Sketch Group The Valleyfolk Performs in the Open Mic Round - Bring The Funny (Open Mic) https://t.co/0FN8LKbQQl RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN two #SDCC exclusive Flinstones Pop!s - Hoppy the Hopparoo &amp; Baby Puss! ht… Liked on YouTube: Puppet Randy Feltface Performs in the Open Mic Round - Bring The Funny (Open Mic) https://t.co/CY74MZwm69 I'm dying https://t.co/T1CZIppOYO RT @OriginalFunko: RT &amp; follow @OriginalFunko for your chance to WIN a #SDCC exclusive flocked Fawkes Pop! #HarryPotter https://t.co/NsJo7N… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SDCC exclusive 'Teen Wolf' Scott Howard Pop! #FunkoSDCC #SDCC2019 http… Liked on YouTube: Mr Fred Rogers - - Emmy Award Speech   1997 https://t.co/4QPBwAK0Pm Liked on YouTube: Comforting A Dying Rabbit - A Documentary https://t.co/PpAoJAKiwn RT @ColourPopCo: #GIVEAWAY\n \nIn honor of our new collection VIVA with @iambeckyg, we are giving away all of Becky G X ColourPop collections… Liked on YouTube: We Bought A GIANT Goodwill Mystery Box! https://t.co/0aPp5r4AAy Liked on YouTube: Mister Rogers Robert F Kennedy Assassination Special https://t.co/77nxGKawKw Liked on YouTube: Paul and Morgan Have Gotten Much WORSE https://t.co/d0Bb7D7tbC RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Jim Henson with Kermit Pop! https://t.co/LM0NdWV81w @DallingaJj @sarahlynn465 https://t.co/KZDS2FH4IH @sarahlynn465 @DallingaJj https://t.co/f6RiWTwwV8 RT @sttepodcast: To celebrate the release of Lost In Space - The complete first season. We have the dvd boxset to giveaway. Simply follow @… @ShmannersCast How do I get people to go camping with me? RT @ColourPopCo: 🍊 #Giveaway 🍊\n \nOrange You Glad for our newest Monochromatic Palette 🍊We are giving away Orange You Glad &amp; a $100 Colourpo… Liked on YouTube: 10 Absurd Board Games That'll Take Your Party To The Next Level! https://t.co/A9imIkkshN Liked on YouTube: This Man Got Arrested For Sucking Toes... https://t.co/sWjT9TIC7Q Let's be friends in Pokémon GO! My Trainer Code is 0255 0560 5514! Liked on YouTube: My Journey to Recovering from Bell's Palsy https://t.co/BFxooqIILh Hey @vpn_gate, Thank you for the follow! Also believes the earth is flat. My great-uncle believes the moon-landing is a hoax. #whatisfamily #isthiswhyihaventseenhiminalongtime RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #SDCC Exclusive Teen Wolf Pop! #SDCC #FunkoSDCC #SDCC50 #SDCC2019 https… @jodirhodi -genuine interest in your life\n- consideration of your life in regards to assignments and projects\n-inspiring you to want to do something, not holding you back to a “more realistic” standard I love my grandma so much! When she visits she’ll bring pictures and information about her family and tell me stories. Guys I'm a high school graduate and I still had a back to school nightmare. #thingsdidntgetbetter RT @ColourPopCo: #GIVEAWAY\n \nTwo lucky winners will be able to win a $100 ColourPop Shopping Spree and the @HaloTopCreamery x Colourpop Pr… @sttepodcast @RicherSounds Harry Potter has been my jam since I was like 8 Hey @britney_to, Thank you for the follow! Hey @gracemi47162059, Thank you for the follow! @Papa_Ostler Has @calvinjburke been on #ListenLearnandLove @sarahlynn465 😉 https://t.co/kjXnzvBIDi RT @AmberScholl: if Harry Styles gets cast as prince eric i will literally audition to play a grain of sand I remembered: Does anyone in the world wanna start a podcast? I think it'd be fun! 😊😊😊 Have you ever forgotten why you wanted to tweet and sit there for 5 minutes wondering what you were saying? #andthentweetaboutit Have you ever procrastinated posting about an event on social media so it then becomes irrelevant. #procrastinater Hey @Jackie_Boii_T, Thank you for the follow! Liked on YouTube: We Discovered H2O Delirious’ Evil Lair! - Minecraft https://t.co/n8BfygPVwM RT @jonasbrothers: When you take a trip to the Year 3000. https://t.co/O9Dxpwj6ex Me too https://t.co/0F0OJCKTB9 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #StrangerThings Pop! prize pack! https://t.co/IcyeoLDRXR Liked on YouTube: Types of Ravenclaws https://t.co/bWYGCJ3ZOc Liked on YouTube: The Hogwarts Houses as Humans E1 https://t.co/ifctERvBS1 Liked on YouTube: The Hogwarts Houses as Humans E2: The Cat https://t.co/2mE76VEpUV Liked on YouTube: Gill &amp; Gilbert Are Playing Celeste and Enjoying Berries — Gill &amp; Gilbert, Episode 1 https://t.co/bHsRJowRvO Liked on YouTube: Types of Gryffindors https://t.co/qVptVmUlTl Liked on YouTube: Types of Hufflepuffs https://t.co/8Q604VDt2U Sometimes I randomly try to fix some broken Xbox games and it works and I'm really happy!!!! Liked on YouTube: Why are the Harry Potter dorms set up like this https://t.co/aORvZ5ZHc4 Liked on YouTube: SUCKER but on Google Translate and Song Maker! https://t.co/YSJGciDSoS I found this ad in the classifieds for where I live and I think it's hilarious: https://t.co/gO9yfV1Oph Does anyone else watch how the Deacons pass the sacrament when they go to a new ward to see how they do it? RT @sttepodcast: Day seventeen of our twenty days of Funko is this Funko Shop Exclusive The Lost Boys - Frog Brothers 2-pack\n\nJust follow @… This was insightful. Because of my location I don't have the opportunity to engage with as many people of color as I would love to. I would hope that this wouldn't apply but, in the future when I have the opportunity to I hope I remember this things in conversation. https://t.co/4n0ED0RpQ2 RT @sttepodcast: Day sixteen of our twenty days of Funko is this Beetlejuice POP! \n\nJust follow @sttepodcast and RT this tweet to be in wit… RT @sttepodcast: It's #podcast time! We review #SpiderManFarFromHome and rewatch British gangster movie Sexy Beast. Get it in your ears:\n\nh… RT @ColourPopCo: 🚨 SURPRISE 48 HOUR #GIVEAWAY 🚨\n \nWin every single Colourpop Palette! Go check out our IG &amp; FB for another chance to win!… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SpiderManFarFromHome Pop! Prize Pack! https://t.co/CxI10ib0N7 Liked on YouTube: This Creepy Woman Won’t Stop Eating Her Husbands Ashes https://t.co/Mmj8ffD4Md I'm waiting at a parade and it's raining...\n\nI hope you are now thinking of a specific song now (that's been stuck in my head for the past 40 minutes). #theatrekidproblems Omg plz do @taylorswift13 https://t.co/AXFXZNVuzt RT @sttepodcast: Day fifteen of our twenty days of Funko is this Austin Powers Pop!\n\nJust follow @sttepodcast and RT this tweet to be in wi… RT @discordapp: found some leftover exclusive 2017 discord pins and lanyards. retweet for a chance to win this u l t r a r a r e combo. htt… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Loungefly x #StrangerThings Backpack. https://t.co/ZaX4tGLmLL Liked on YouTube: This Channel is WORSE Than GIRL DEFINED https://t.co/3rDnag52MD Sometimes work sucks cuz I feel like crap and am only here to fix my timecard, but then during break we relentlessly tease this girl about a boyfriend and we now Stan work!!! #changeofattitude RT @conangray: i’m tired of being embarrassing and stupid who wanna evaporate off the face of the earth with me RT @sttepodcast: Day thirteen of our twenty days of Funko is this Jaws Quint pop! \n\nJust follow @sttepodcast and RT this tweet to be in wit… Hey @LorrieBond5, Thank you for the follow! Omg this is  @BenSPLATT 's song Grow as We Go https://t.co/IEbNK52fyP RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SDCC2019 exclusive Chuckles Pop!\n#FunkoSDCC #SDCC50 #ToyStory https://… @sarahlynn465 She said before returning to work in the summer of 2020 RT @TheTylt: Mandy Moore was a pop star way before making you cry on #ThisIsUs. RT to vote #TeamMandyMoore if you loved her '90s bops! http… RT @jakeyapp: Omg they thawed out a worm and it started wriggling and it is FORTY-ONE THOUSAND YEARS OLD https://t.co/xzWSb4FVDm I'm not a burger poser I just keep it #ButteryJackClassic RT @ewplant: PLEASE SHARE: Our family friend is #missing in the #NYC area. Last known location was West 50th between 8th and Broadway. If y… Is it bad I want to do this and rewatch all his videos, but do the underage thing and drink literally anything else. https://t.co/BbfYi1GoR5 Hey @roadmanmusic, Thank you for the follow! I just voted for #TeenChoice 2019 winners! Vote for your faves &amp; more at https://t.co/5a6s38mkQg! @scarncarndall @ElleMaeGal Before I was comfortable and felt pressured to come out to him I didn't want to meet when he said we should. Thankfully he was so chill. Now he's one of my biggest supporters. Hellewell 2020: Yeah I had to find underwear really quick. I'll tell you about my adventure later.\n\nUmmmmmmmm.......... https://t.co/J0GmFjaeka RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #StrangerThings Pop! Prize Pack. https://t.co/UJJ4Qhg0pt RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop Exclusive Fin Du Chomp Pop! #FantastikPlastik\nhttps://t.co/G… @sarahlynn465 @ShmannersCast Maybe 😉 @ShmannersCast How do you have your own moments so you don't go crazy? But like... Me too https://t.co/0zBbbFzaTh Too easy: that I'm straight\nDeeper: that I don't have any insecurities https://t.co/ypj6gakpjR @hendycth Ravenclaw, Pisces, Gay Use this link to get Tab for a Cause. Every time you open a new tab you earn hearts which help the people behind Tab for a Cause know where to donate their profits. Here's my referral link: https://t.co/ELtAYSzNXU @AFCU @UtahJazzGaming Yee Yee Praise to this man!!!! I would hope I would do this! https://t.co/kjwSYa1poo @ellieryanh I would say I'd take them, but I bought myself Oreos after my coworkers started talking about them Saturday and have already probably eaten a whole thing by myself.\n\nBut still... Today at work I was talking to my coworkers finally (it's been like 3 weeks) and I figured out that two of them are theatre people and work wasn't so bad. #theatrepeople #theatrecoworkers https://t.co/y2Dyjy0SBH RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SDCC exclusive Mr. Picklepants Pop!\n#ToyStory #SDCC50 #SDCC2019 https:… Liked on YouTube: QUEEN【Don't Stop Me Now】fish ver. https://t.co/oM531rbVcG Happy birthday to my ever supportive and loving (and sarcastic) sister @sarahlynn465 https://t.co/qZx646hG1P I'm marrying an email https://t.co/8TEy3wPF9D @ellieryanh You still got the goods? 😉🤨 RT @lynda_jens: Cameron Boyce trending on Twitter has got me weak. RT @lynda_jens: I keep refreshing my insta every five seconds just waiting for a “psych” from Cameron Boyce. This is so heartbreaking. I wa… Liked on YouTube: Most Adorable Moment At Disney World https://t.co/nO1FsHWi1j Sometimes I get bored on Twitter and an hungry at work https://t.co/2nr1rOVI9b RT @buntmemothdaddy: A raccoon got into the chapel cupboard and ate all the communion crackers and drank all the communion wine and the pri… RT @BLEH_17: Can we please appreciate Alexei \"Smirnoff\", cuz god! His smile is so cuuuuuuuuute!!!! He's like a lost Russian child hahsndwvv… But like what if I do that and am so ok with it. 🤨 https://t.co/Oak1wwYZCA Surprised there are any left. If I had to pick I #NeedCurlyFries This seems cool. Thanks @Papa_Ostler for retweeting this.\n\nI want to echo what everyone has been saying on this thread. The book is true, there's no point in my mind that it isn't. It's so good and has changed my life. It's been an anchor in my life and helped me a ton. https://t.co/SSbMw8EWwe RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #StrangerThings Pop! Prize Pack. https://t.co/6dBUFgbJVo Liked on YouTube: Lucas The Spider - It Slipped https://t.co/g3jHHb8RoP I'm not a burger poser I just keep it #ButteryJackClassic RT @haileehenson: To my friends, https://t.co/eY26f3QOtu Surprised there are any left. If I had to pick I #NeedCurlyFries RT @i_saritav: Idk who needs to hear this but:\n\nwhite Mormon gay boys are incredibly privileged, too loud, and also need to learn RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Loungefly x #StrangerThings Character Chibi Print Backpack. https://t.… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SpiderManFarFromHome Pop! Prize Pack! https://t.co/t8yxlKPuHn Liked on YouTube: 10 Strange Candies That Actually Taste Good! https://t.co/LqCWVpk9tF The end of #StrangerThings has me screwed up!! https://t.co/OF3BLICC7e RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #StrangerThings Pop! Prize Pack. https://t.co/iU6xRtDiRX @Stranger_Things #StrangerThings - Episode 3: I feel personally attacked by what Steve said about Robin. Can I please get cast as every teacher in everything ever. \"Now can we play D&amp;D?\" - Will Byers #StrangerThings3 @Stranger_Things (best quote so far) RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #StrangerThings Pop! Prize Pack. https://t.co/UPniGlaAJS RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop Exclusive America Cares Bear Pop! https://t.co/GxcugRZi74 ht… Robin from Stranger Things explanation of how qualified she is (btw spoilers)\n\nto translate the Russian reminds me of \"I Speak Six Languages\" from The 25th Annual Putnam County Spelling Bee I definitely am relating to Will Byers and Max Mayfield. Will because he got ditched and Max because she gives the advice to the women in the relationship. So everyone is gonna have to deal with me tweeting about @Stranger_Things  #Season3 @lynda_jens The Mormon thing. I died! https://t.co/a9f5U4nDcy I think my casting type is Jim Hopper from @Stranger_Things RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #StrangerThings Pop! Prize Pack. https://t.co/cjdB0vOpI5 @sarahlynn465 I was on my phone for a second and my manager walked in. You know those \"it's not what it looks like\" moments in life, yeah I think I experienced that today at work! 😟😟😟 Hey @Namaste13371, Thank you for the follow! Liked on YouTube: kid in vrchat talks about getting bullied - Syrmor Animated https://t.co/vllQCw0LqC It’s currently 12:42 am and I have to be up early for work, but I was dumb and napped and drank caffeine so I’m cleaning my bathroom. https://t.co/YyFe99rkD5 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Stranger Things Pop! Moment, featuring Eleven and Demogorgon. #Stranger… Hey @Kate36929316, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @BNBuzz Exclusive Hydro-Man Pop!  #SpiderMan #FarFromHome https://t.co/… RT @ThePopPros: 🎉 GIVEAWAY 🎉\n\n3 WINNERS:\n1️⃣ - Lifetime Membership to The Pop Pros &amp; Metallic Iron Spider Pop!\n2️⃣ - 3 Month Membership &amp; W… @ThePopPros @PitchingNinja RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an @Amazon exclusive Buzz Lightyear Pop! \n#ToyStory4 #BuzzLightyear #Funk… @london_theatre @ComeFromAwayUK @sarahlynn465 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a SpongeBob SquarePants Pop! https://t.co/X9Ir4ekdK3 #StillHappening - help stop conversion therapy in Utah. Contact your lawmakers. https://t.co/VtT5Th6jNH #TurnUpTheLove yasss #LOVELOUD https://t.co/ItGCvxdJjK RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @HotTopic exclusive Mysterio Pop! \n#SpiderMan #FarFromHome https://t.co… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SDCC2019 exclusive Teen Wolf Scott Howard Pop!  #FunkoSDCC #SDCC50 htt… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SDCC2019 The Simpsons - Treehouse of Horror - Kang and Kodos Pop! 2-Pa… @LEGO_Group Rowena Ravenclaw Make real money by walking with @cashforsteps #cashforsteps https://t.co/ZdDonHOCYs RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SDCC2019 exclusive Peter Pez Pop! #FunkoSDCC #SDCC50 https://t.co/wumX… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SDCC2019 exclusive Quisp + Quake VYNL 2-Pack. #FunkoSDCC #SDCC50 https… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SDCC2019 exclusive Chuckles Pop!  #FunkoSDCC #SDCC50 #ToyStory https:/… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SDCC2019 exclusive Teal Chrome Batman Pop! #FunkoSDCC #SDCC50 https://… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SDCC2019 exclusive Mr. Pricklepants Pop!  #FunkoSDCC #SDCC50 #ToyStory… @makall666 Oooo honey 'Green' Alternative Fuel Set for First In-Space Test via NASA https://t.co/XxApiDvlUr https://t.co/l8Us0DCE4I @mikeyeddie @NetSmartz Oh my gosh. My childhood self is quaking. This is amazing. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #ToyStory Dorbz Prize Pack, featuring all 6 Funko Shop exclusives. #Buz… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Loungefly x Red Minnie Ears &amp; Bow Red Faux Leather Mini Backpack! http… RT @TobyontheTele: Before the launch of my exciting little Toby next week, it seems only fitting to give away 10 of the adorable little bug… @NetSmartz I'm kinda starstruck. This was nostalgia in all of elementary school. Does anyone else remember this? https://t.co/mLIsjavtHS RT @jodirhodi: Our very own CPR/ First aid team is going to the second round at Hosa international competition @WeAreViewmont RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SDCC2019 exclusive Glow-in-the-Dark Loot Llama Pop!\n#FunkoSDCC #SDCC50… I mean idk, let's try this: https://t.co/irfkkvuFRf To anyone who's interested my Harry Potter: Wizards Unite friend code is 2843 5868 7979. @AtomicFirebird @Aras_Sivad @sonerdwear @PaolasPixels @dieharddice https://t.co/NotAqulFWD RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SDCC2019 exclusive Astronaut Snoopy Pop!  #FunkoSDCC #SDCC50 https://t… Liked on YouTube: Todrick Hall - Nails, Hair, Hips, Heels (LA Pride, West Hollywood CA 6/7/19) https://t.co/dyaMY3AnLs RT @thekwakuel: Thread about LGBTQ+ and the Church of Jesus Christ of Latter-day Saints 🏳️‍🌈⛪️ (long/controversial?)\n\nOne of my best friend… My social media posts make me cringe when I read them in the future (sometimes like 5 minutes later). Sometimes I'm sharing too often or too much and sometimes I'm broke and want free stuff from giveaways and have to stop myself from sharing the links that get me more entries. But I'm really glad I used @EugeneLeeYang 's video. I was feeling it that day! 🏳️‍🌈🏳️‍🌈😊😊 I'm kinda disappointed I didn't use Boys by Lizzo for my coming out post. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SDCC2019 exclusive Gold Demogorgon Pop!  #FunkoSDCC #SDCC50 #StrangerT… Make real money by walking with @cashforsteps #cashforsteps https://t.co/ZdDonHx1zS RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SDCC2019 exclusive H.R. Pufnstuf Pop!\n#FunkoSDCC #SDCC50 https://t.co/… Liked on YouTube: Tony Awards Controversy &amp; Colleen Ballinger's Broadway Debut | My Thoughts | Katherine Steele https://t.co/SGkLnOlZZ6 Counter Culture Giveaway https://t.co/xStdn2RHLZ twitter,\ni'm sorry that i post random \"stuff\" from giveaways\ni'm broke and i want random stuff so shoot me\nand i'm too scared to ask facebook (that's where i get most of them)\nbye,\nlove you RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SDCC2019 exclusive Ultraman Pop!\n#FunkoSDCC #SDCC50 https://t.co/5QEL8… Cruelty-free glitter cosmetics made from 100% renewable plant starches. https://t.co/TAg4gnfszu I entered for a chance to win a 12-Pack of pureLYFT, FOR FREE! here is the page to sign up:  https://t.co/Cswx9LtGsX RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Lucas Pop!\n#StrangerThings https://t.co/4AtRVKsLwa RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an @officialfye exclusive flocked Ducky Pop! #ToyStory4 #FunkoToyStory ht… Liked on YouTube: Phineas &amp; Ferb - Busted Live-Action Remake Ft. Dan Povenmire https://t.co/tujgb3foyp Liked on YouTube: Taylor Swift - You Need To Calm Down https://t.co/7sFeT20qLq Liked on YouTube: Meet Ali Stroker: the First Actress in a Wheelchair to Perform on Broadway | Mashable Docs https://t.co/xARtYzV4qy @chismosaaass Andy Samberg @bae_hartley @nataliecsolomon Hi I'm down Hey @WarriorsOfCode, Thank you for the follow! RT @proxactears: if y’all have ever cried at your job or school in the bathroom can you retweet this? \ni wanna see something RT @tryguys: “I’m Gay.” Written, directed and choreographed by @EugeneLeeYang featuring music by @odesza https://t.co/MaAA6l4wQ4 Played a 48 year old man with a daughter and then she was actually my daughter after the show https://t.co/f0tFSQsgeZ RT @hankrsmith: What a great opportunity to be kind we have at church. We can be welcoming and accepting of every single person there. Chur… RT @queentrashcan: i think i’m a background friend. i don’t fit in with any particular group of friends, they all are closer with each othe… @EugeneLeeYang Your music video inspired me to come out Hey @Horrorchick1311, Thank you for the follow! Also, I just came out on Facebook. So #feelingstressedbutrelieved Dear Childhood,\nYou were cringy and very awkward but I grew from you. I figured out who I am. I wish I could change somethings about my childhood, but I grew from those experiences too. So hello adulthood I can't wait to live my life. Liked on YouTube: I'm Gay - Eugene Lee Yang https://t.co/dGtyfyFnMr We discussed ignorance in Davis County.\n\nI want everyone in Davis County to know that they need to learn to love. Your negative impact/ignorance can be destructive. Learn love. Right before I left while we were discussing mission questions I asked (I already knew) about what happens when someone has same-sex attraction and wants to go on their mission.\n\nI told my mom about what happened. My mom calmly comforted me. I know that she had my back. When I went to bed that night, I cried. I prayed to feel comfortable and I was comforted. I wanted to ask my leader if I could call my mom (we didn't have phones) and leave early. I didn't and stuck it out as I did in seminary.\n\nThe next day I had to leave early for work. When he asked if it was offensive I said it was, other people agreed with me thankfully. I couldn't stand up for myself there because of such homophobia. Other words were thrown, \"that's gay\", \"dude, you're gay\" and stuff like that. That didn't bother me like that extreme word. While playing cards with some people at a camp in my dorm room there was this kinda cute boy with a southern drawl who I was kinda crushing on. Within the first 2 minutes of our conversation, he said (thankfully not directly to me) the most offensive word to the gay community. I told him how I felt and he was my biggest supporter outside of the theatre community and my parents. He protected me from small homophobia.\n\nBut those scars that started to heal reopened this last Thursday night. I was scared about how things would go, but they went so well. I cried from feeling the spirit so strong. The things the people said in that class changed my heart and made me understand that God loved me more than I could imagine. I loved that class and that teacher. Then the second semester rolled around and I was thankful to get out of that seminary teachers class, at first I was terrified of this new teacher because of some things he had said during some summer seminary lessons. A few weeks later we had a lesson about LGBTQ+ matters. But I did because my parents didn't know I was gay at the time and wouldn't understand why seminary was hard. I become cold and unfeeling towards seminary and stopped caring at all, but still put on the persona of the \"perfect Mormon boy\" His words hurt my closeted soul and I felt hopeless and depressed. While he was teaching I had one of my friends from high school on the other end of a Snapchat message telling me I was loved and that I should leave the room. I didn't. I was scared. I didn't want to ever go back. I had a seminary teacher the first semester of my senior year who in one lesson was uneducated and said that Tom Christofferson was helped out of his gay relationship, which is false. He said that gay people can't be good parents, which is also false. I know that God loves me. I've gone through something similar earlier this year and made it out the other side, but not with some scars. And these experiences opened up those scars. Now that I'm out, I want to share what happened earlier and what we can learn. At that mission camp, I heard words said about all different types of people that should and hopefully, would never be said to people like that. Nobody there knew I was gay, and I hope that they wouldn't say what they said if they knew. I wanted to say that I was but couldn't. But parents need to teach their kids about love. As Gordon B. Hinckley said (this is paraphrased from what @tanfrance said in his SLC Book Tour): Christ said to love one another, not judging them based on who they are. Christ taught the sinner. They have no control over who chooses to live here. But what needs to happen is education. Parents already teach their kids how to act and behave and sometimes they forget that, but they are told by other adults (teachers, church leaders, older friends, etc.) It was that many of the kids were ignorant. Now I don't blame them. I blame the community that Davis County, Utah is. Because I live in \"Wonderbread Utah\" I know only a few out gay kids and less than 10 ethnic people. Now I don't blame the county for not having more diversity. This last Wednesday through Friday I had the wonderful experience of going to a missionary camp with my stake. It was a wonderfully powerful experience, but I want to reflect on something that wasn't right. It wasn't that the kids trashed the dorm rooms or staying out too late. Because these are some important thoughts I'm gonna keep them in this thread. RT @tryguys: Eugene comes out as gay in his original, deeply personal music video, featuring music by @odesza 💜🏳️‍🌈\nhttps://t.co/d6IvQSSUIP… RT @nedfulmer: I’m so happy for you Eugene!! It’s such a moving &amp; powerful work. https://t.co/zbHGuaMd2p RT @TwitterMoments: YouTuber @EugeneLeeYang came out as gay in a music video featuring music by @odesza.\nhttps://t.co/ayqlpXMRpz I'm Gay - Eugene Lee Yang https://t.co/dGtyfynMnR via @YouTube. Everyone watch this. This is a powerful video: RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Loungefly Mickey Mouse &amp; Donald Duck Hawaiian Holiday Backpack. https:… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win an #E32019 exclusive Kingdom Hearts 3 Sora (Lion Form) Pop! https://t.co/… I would love to have been in the production team of @BeetlejuiceBway! I have a literal countdown until release https://t.co/oSFvWz6tZb I'm offended 😂😂😂😂 https://t.co/zFUGzkfcA5 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an #E32019 exclusive Fallout 76 Excavator Armor Pop! #Fallout76 https://t… I don't think the world knows how much I love this https://t.co/PliUmI3I2d RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #StrangerThings Dustin Pop! https://t.co/hPYSe08V4g RT @jvn: Feeling so much love and support from yesterday’s article 🏳️‍🌈 not everyone gets such treatment .. donate to @TrevorProject @Trans… RT @JelaniAlladin: I’m trying not to be selfish.. but how much longer do we have to wait for the rest of @hadestown album?!?! I NEED THIS W… @Twitter For the future English major (me) When @Twitter is done with your bad grammar. https://t.co/BwS4BNaaUQ RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #GearsofWar Pop! Prize Pack. #GEARS https://t.co/iQ3CdStlk4 Hey @sethllarsen, Thank you for the follow! I just finished listening to the album of @BeetlejuiceBway and holy 💩 it was amazing!!! @sarahlynn465 I wanna be the red or yellow one Hey @juaquinos, Thank you for the follow! Liked on YouTube: The Evolution of Michael Jackson's Dance - Masterclass https://t.co/UdaH4WJriL Last thing: I freaking love @ABrightMonster like a lot.\n\nOk bye RT @broadwaycom: Which 2019 Tony Awards performance was your favorite?https://t.co/gfWVaDwokH That's all for my #TonyAwards2019 tweets!!! Orpheus in @hadestown is 🔥(pun intended). #TonyAwards2019 Can I play an M&amp;M in a commercial! @StephanieJBlock 's husband standing up made me #believeinlifeafterlove @TheCherShow 😉 #TheTonyAwards2019 @SantinoFontana 's speech where he thanked his coach gave me feels. #TonyAwards2019 #futuretheatreeducator Marin Mazzie's memoriam made me genuinely tear up. #TonyAwards2019 I freaked out when I saw @ReginaKing presenting and realized she was in #ACinderellaStory only after she spoke!! #TonyAwards2019 I would love to be a puppeteer for the the @KingKongBway puppet. RT @taylizlou: That opening was my favorite! Yes we are LIVE! It is so special.  @TheTonyAwards You know there's not much news when to promo it they talk about saving baby ducks. 😂😂 This is that beef I was talking about! https://t.co/qlpeL7SVeK The shirtless guys from @TheCherShow = 🔥🔥. #TonyAwards2019 I freak out when I hear that someone I love is going to present at the Tony's!! #tonyawards2019 Who won the bet, #andrewrannels and @sfosternyc? #TonyAwards2019 @KChenoweth doing a solo standing ovation for Kiss Me Kate is a mood and I love it!!! #TonyAwards2019 Anaïs Mitchell's words were so inspiring. #TonyAwards2019 #moanyawards @Eddieperfect 's hair looks like Beetlejuice's @BeetlejuiceBway #TonyAwards2019 Excellence in theatre education award is what I could get and I would die!!!!! #TonyAwards2019 \n\nAlso @theebillyporter is a queen! The beef section makes me dead 😂😂😂😂😂😂😂 #TonyAwards2019 Ben Platt's beef made my day!!! #theatrecommunity #TonyAwards2019 When you get an ad for sports in the #TonyAwards2019 https://t.co/8oQd4LoJQg There's this commercial on rn about queer people and their families and I'm crying. He also played my dream role Leaf in The 25th Annual Putnam County Spelling Bee I think I'm in love with #JessieTylerFerguson. #TonyAwards2019\n\n\"Sam Mendes couldn't make it tonight so now we have a Tony award. Yeah!!\" *Runs off giddily Yes @BroadwayLeague #broadwaybridges!!!!!!!! #TonyAwards2019 James Corden is so FREAKING TALENTED!!! #TonyAwards2019 I love the #TonyAwards2019 theatre cameos and jokes. Hearing #jamescorden sing a parody of \"Micheal in the Bathroom\" is surreal. @BeMoreChill #TonyAwards2019 Also that final high note. #holycow #ChoirBoy #TonyAwards2019 #TarellAlvinMcCraney 's speech hit home. #imgay #tonyawards2019 Seeing everyone's responses to my tweets makes me love the #theatrecommunity @msmistyeyee History of Wrong Guys from @KinkyBootsBway #jamescorden 's parents and their relationship is kinda #relatable #tonyawards2019 @ThePromMusical @KChenoweth 's speech was amazing. And inspiring. #imgay #TonyAwards2019 Uncle Barry is now on my dream role list!!!!! #TonyAwards2019 @ThePromMusical I like to play the \"guess the instrumental musical theatre\" game. #TonyAwards2019 When @LucyLiu talked about theatre education should be a right not a privilege I screamed \"Heck yeah\" a bit loud and thought I woke up my nephew. But still. #TonyAwards2019 #futuretheatreeducator I'm playing a drinking game with the #TonyAwards2019 (https://t.co/eacWmH9HGu) with water because #underage and I've had to pee every commercial break. I wanna to see but more importantly be in @BeetlejuiceBway I want to be nominated for #bestdirectionofamusical or #bestdirectionofaplay one day. #dreams #goals #TonyAwards #TaylorMac is fabulous. #TonyAwards2019 Also backstage @ChrisisSingin was playing tic tac toe. 😂😂😂😂 #TonyAwards2019 I thought #AliStroker was gonna fall of the stage at the end of her solo. #TonyAwards2019 But seriously his speech was really inspiring. #TonyAwards2019 Andre de Shields' boots are amazing.\n\nAnd his speech was pretty good too. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an @Amazon exclusive #ToyStory4 Buzz Lightyear Pop! #FunkoToyStory #Funko… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #StrangerThings Eleven Pop! https://t.co/NQpS0v3eqi RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Gamestop exclusive #Forky Pop!   #FunkoToyStory #ToyStory4 https://t.c… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Loungefly Winnie the Pooh Convertible Tote/Backpack. https://t.co/Vd1z… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #Ghostbusters Pop! Banquet Room Movie Moment! #Ghostbusters35 https://t… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #Ghostbusters Pop! Prize Pack!! #Ghostbusters35 https://t.co/Kmxxl60il2 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Funko Shop exclusive Fantastik Plastik Wolfgang Pop! https://t.co/eIphB… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #NSYNC Justin Timberlake Pop! https://t.co/4oRnkeKakh I'm watching the #TonyAwards2019 and #ElaineMay makes me want to cry. She's so cute and sweet. Can she be my grandmother. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an #E32019 exclusive Gears of War Kait Pop! #GEARS https://t.co/wxDqAt5xrb Liked on YouTube: 10 Easy Science Tricks That'll Impress Your Friends! https://t.co/f3ZU3VnYHV Hey @AveiJessica, Thank you for the follow! Liked on YouTube: Nails, Hair, Hips, Heels by Todrick https://t.co/SQDRm03aXo @captainhollis https://t.co/S7PevURavQ RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an #E32019 exclusive #Fortnite Battle Hound Pop! https://t.co/2gACpxVeUE RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Funko Shop exclusive Fantastik Plastik Monkey Assassin Pop! https://t.c… @OriginalFunko #FunkoApp  I love @QueenWillRock but still need these https://t.co/bWJI0INhla RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #ToyStory4 Prize Pack, featuring Duke Caboom and Combat Carl Jr. #Funko… @Ravenclaw509 @MariaNate @calvinjburke I'm confused. Are you saying @MariaNate is not wanting to know because I have the same question and I love and support this. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @HotTopic exclusive Super Sized Dragon Ball Z Shenron (Jade) Pop! #DBZ… Liked on YouTube: Lucas The Spider - Where Did It Go? https://t.co/ECuji792Pc @OriginalFunko #FunkoApp https://t.co/WQqmsnH9PD RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #ToyStory4 Prize Pack, featuring Sheriff Woody and Jessie! https://t.co… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an #AvengersEndgame Rescue Pop! #FunkoAvengers https://t.co/G2yt0SLya7 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #Ghostbusters Pop! Pez Prize Pack!! #Ghostbusters35 https://t.co/v7CmUS… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an #E32019 exclusive #Overwatch Hanzo and Genji Pop! 2-Pack. https://t.co… Make real money by walking with @cashforsteps #cashforsteps https://t.co/ZdDonHx1zS Hey @sierra23allen, Thank you for the follow! Hey @Papa_Ostler, Thank you for the follow! RT @AlanHenry: Thrilled to get to bring back the BWW pride logo I designed two years ago today in celebration of Pride Month! https://t.co/… RT @hannahboning: sure sure money can’t buy happiness but it can buy:\ntherapy\neducation\na house\nvegetables\nclear skin\nhealthcare\nfree time… RT @Papa_Ostler: So this happened during my morning walk.  Happy Pride Week 🌈 https://t.co/1yX06gpZ4R RT @heyitsbunker: Prepping for pride weekend 🏳️‍🌈 https://t.co/I3Sw6erEIg RT @WesTayTay: happy 1st day of #pridemonth 😘 https://t.co/XJrbwwTQjp RT @calvinjburke: Tune in to @KSL5TV this Sunday at 9am— @Papa_Ostler &amp; I are appearing on @KSLSundayEd with Doug Wright! We talk about som… RT @georgesalazar: Happy Pride, my friends. This month (and honestly every month) is for you, for me, and for us. 🏳️‍🌈✌🏼 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Loungefly Dumbo Backpack! #FunkoFashionFriday https://t.co/mRabISP6xD @OriginalFunko #FunkoApp I really love @QueenWillRock like a ton, but I still haven't bought these! https://t.co/G8h8R4xoJy RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an #E32019 exclusive 'The Witcher' Ciri Pop! https://t.co/DIc6uFfSoy RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Gamestop exclusive 10\" Super Sized Stay Puft Pop! #Ghostbusters https:… @ThePopPros @molly_moo_who RT @ThePopPros: 🎉 GIVEAWAY 🎉\n\n3 WINNERS:\n1️⃣ - Lifetime Membership to The Pop Pros &amp; Captain America w/ Mjolnir Pop!\n2️⃣ - 3 Month Membersh… Liked on YouTube: HOW TO GET ONTO LWIAY (SLWIAY #1) https://t.co/C2CBvf21jy Hey @1983Shahov, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a 'Beverly Hills Cop' Pop! Prize Pack!! https://t.co/NNPBiKU8sA Shoutout to the girl in my yearbook who still thought I was bi and wrote Bi Buddies. @emma_layt I realized that you didn't sign my yearbook and I'm shook!!!!! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Ghostbusters Pop! Town 2-Pack (Dr. Peter Venkman with Firehouse). https… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a 6\" Super Sized Hulk with Gauntlet Pop! \n#FunkoAvengers #AvengersEndgame… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop Exclusive Pink Wolfgang Pop!  \n#FantastikPlastik\nhttps://t.c… RT @jarvis: https://t.co/bqOVJT9YmU\n\nITS OUT IM SO HAPPY RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Ghostbusters Pop! Prize Pack!! https://t.co/CStJGgRx29 Liked on YouTube: [OFFICIAL VIDEO] Waving Through A Window - Pentatonix https://t.co/sqNn4hay2Y Hey @awinchester18, Thank you for the follow! Hey @DallingaJj, Thank you for the follow! Hey @sarahlynn465, Thank you for the follow! Thanks to all my friends who were there and I can't wait for our future journeys (maybe together and maybe not). I hope I made an impact on your life and the lives of your children and I hope you teach them to love and support each other. (I'm legit crying right now). Thank you! And I'm excited to be a part of my friends' lives and being the gay person that their kids know and I hope to teach them about loving and respecting others no matter who they are. And if one day one of my best friends' kids turns out to be gay I'm there to be supportive. I am happy to not be one of those angry gay people in the Church of Jesus Christ of Latter Day Saints who are angry that they'll never get married. I know my purpose in my life and I'm excited for all my straight friends to get married and have kids. As this school year comes to a close I was thinking about this. I am very happy with where I am in my life. I have figured out my sexuality and anxiety. @ellieryanh https://t.co/M7PGuJsiHf Liked on YouTube: 10 of the World's Smallest Products that Actually Work! https://t.co/680jWa4mTk RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @GameStop exclusive DC Collection Jim Lee Green Lantern and Batman Comi… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @HotTopic exclusive Super Sized Dragon Ball Z Shenron (Jade) Pop! #DBZ… @WaitressMusical Sleeping in Hey @andyjwinder, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Jaws🦈 Pop! Prize Pack!! https://t.co/zP8NMx6ilc @OriginalFunko #funkoapp I wanna start my marvel collection and need to pick up some momentum https://t.co/nmkwnO0ZTI RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #E32019 exclusive #Borderlands Maya Pop! https://t.co/nWh6uDL4CV We had a discussion about LGBT+ stuff and a girl talked about how she wishes people knew that God loves him and I cried a ton. https://t.co/QZFqDNwPlg RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an #AvengersEndgame Thor Pop!\n#FunkoAvengers #Thor https://t.co/dgZlsWszG3 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #ToyStory4 Forky Pop! #FunkoToyStory https://t.co/hL2yT2EJbF I'm excited for #MoreLoops with my 3 extra days at Universal Orlando Resort. What about you? RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Funko Shop exclusive Princess Jasmine Pop! #AladdinMovie https://t.co/R… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #ToyStory4 Prize Pack, featuring Buzz &amp; Woody! #FunkoToyStory https://t… RT @calvinjburke: We need to be careful not to be cliquey\n\nI felt isolated &amp; left out at school &amp; in many of my wards bc I never fit in w/… RT @harambevan: Can we stop shaming queer folks who choose to involve themselves in the Mormon Church? There’s so much gray area on the spe… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an #AvengersEndgame Hawkeye Pop! + @EntEarth exclusive collectible cards!… Liked on YouTube: 2019 Tony Awards: Beetlejuice The Musical https://t.co/nzp3fqbz75 So sometimes I just sit at home and eat a whole bag of banana chips and nobody can stop me. Ya know? RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop Exclusive Rice Krispies 3-Pack Dorbz Bundle! \nhttps://t.co/i… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an @Amazon exclusive War Machine Pop! #FunkoAvengers #AvengersEndgame htt… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Simpsons Pop! Prize Pack! https://t.co/v5oS9z0Ks2 Liked on YouTube: Testing 10 Food Gadgets That'll Make Eating More Fun! https://t.co/B87cNbK3k5 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #ToyStory4 Prize Pack, featuring Bunny &amp; Ducky! #FunkoToyStory https://… So I learned that what comes along with being gay and being with a ton of straight friends is relationship drama and gay 3rd/5th/7th wheeling. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Target exclusive 10\" Bulbasaur Pop! https://t.co/J0FLCCyS5E RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an @officialfye exclusive flocked Ducky Pop! #FunkoToyStory #ToyStory4 ht… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Addams Family Pop! Prize Pack!! https://t.co/Suc2KxIaOi RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Funko Shop exclusive flocked Rafiki Pop! #TheLionKing https://t.co/imtg… Hey @WestEndLDN, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Target exclusive flocked Bunny Pop! #FunkoToyStory #ToyStory4 https://… Hey @Gureishichan, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Walmart exclusive Gabby Gabby with Forky Pop! #FunkoToyStory #ToyStory… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win this @Loungefly Minnie Mouse Wallet! #FunkoFashionFriday https://t.co/D… Hey @JJWhitesnake, Thank you for the follow! RT @ColourPopCo: #Giveaway \n \nWin a weekend getaway to Hawaii and our full Birthday Collection for you &amp; your BFF!  \n \nTo Enter:\nReply w/ #… @ColourPopCo #BIRTHDAYCOLLECTION RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Jaws Pop! Prize Pack!! https://t.co/vKqIMpR8wy Hey so my friend is going to the hospital tonight to see if he has a brain tumor. Can you all remember him in your prayers? Thank you!!! Hey @TannerJMusic1, Thank you for the follow! RT @Op00h: FLIP YOUR PHONE UPSIDE DOWN \n\n˙ʍou sʇɹɐʇs ʞǝǝʍ ʇsɹoʍ ɹnoʎ 'sıɥʇ ʇǝǝʍʇǝɹ ʇ,uop noʎ ɟI ˙ʇɥɓıuoʇ sʍǝu pooɓ ploʇ ǝq llıʍ noʎ 'sıɥʇ p… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an #AvengersEndgame Tony Stark Pop! + @EntEarth exclusive collectible car… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop Exclusive Bullseye Pop! #ToyStory4 \nhttps://t.co/i44O89PDee… Hey @NashNices2, Thank you for the follow! @Abritte340 7 is too unripe though 9-11 https://t.co/HXoPfEU0Fz RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an @Amazon exclusive Buzz Lightyear Floating Pop! #FunkoToyStory #ToyStor… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Target exclusive Red Chrome Darth Vader Pop! #StarWars https://t.co/5t… RT @pop_o_cIock: RT + follow @pop_o_cIock for the chance to win a #MyHeroAcademia Deku (Full Cowl) Glow-In-The-Dark Entertainment Earth Exc… RT @pop_o_cIock: 🗡 🎁 ARYA STARK GIVEAWAY 🎁 🗡 \n\nOne lucky follower will win a FREE Arya Stark Convention Exclusive #GameOfThrones Funko Pop!… RT @pop_o_cIock: RT + follow @pop_o_cIock for the chance to WIN a #GameofThrones  Tyrion Lannister w/ Battle Armor Pop! #FortheThrone  #Tyr… RT @pop_o_cIock: RT + follow @pop_o_cIock for the chance to WIN a BTS Jimin Pop! 🎁 https://t.co/7oc7gr43Qg RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #GameofThrones Tyrion Lannister on the Iron Throne Pop! #FortheThrone #… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #HULK Pop! #FunkoAvengers #AvengersEndgame https://t.co/RKtiWlADMo RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #ToyStory4 Forky Pop! #FunkoToyStory https://t.co/b9zbYwk8Uf D https://t.co/zxe0qacCDF 62% of people believe the best days of science are still to come. I hope science will help find a #CureForDiseases in my lifetime. Let @3M know what you think science will achieve. RT @AlexBoniello: 8 hours of sleep: Yes, I feel okay and can function efficiently. \n\n7 hours and 59 minutes: I am in hell. This is hell. My… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Walgreens exclusive #Hawkweye Pop!! #FunkoAvengers #AvengersEndgame ht… Liked on YouTube: Teachers Play Never Have I Ever https://t.co/h0eaosu4s1 RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win this #ToyStory @Loungefly mini backpack! #ToyStory4 https://t.co/jtCLRa… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a @Target exclusive 10-inch Pikachu Pop! https://t.co/XE11nEiVlL RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an #AvengersEndgame Pop! Prize Pack, with #CaptainMarvel and #WarMachine!… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #ToyStory4 Alien Pop! #FunkoToyStory https://t.co/sL0sX5yrEv RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an #AvengersEndgame Pop! Prize Pack, with #Thor and #Nebula!  #FunkoAveng… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an #AvengersEndgame Black Widow Pop! + @EntEarth exclusive collectible ca… Liked on YouTube: TikToks that make me lightly blow air out my nose https://t.co/cO00hk0xux RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop Exclusive Flocked Rafiki Pop!  #TheLionKing\nhttps://t.co/i44… Because that's almost my literal future Um, so can we do a new version of #NedsDeclassifiedSchoolSurvivalGuide and can I be Mr. Monroe RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #GameofThrones Night King on Iron Throne Pop! #GOT https://t.co/R9F2mzb… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Walmart exclusive  #AvengersEndgame Rocket Pop! #FunkoAvengers #Rocket… Liked on YouTube: SPIDER-MAN: FAR FROM HOME - Official Trailer https://t.co/Mwqo4Y2vfz RT @pop_o_cIock: RT + follow @pop_o_cIock for the chance to win a Target Exclusive Red Chrome Darth Vader Pop! #StarWars https://t.co/pD7eQ… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Target exclusive 10\" Super Sized Wicket W. Warrick Pop! #StarWars http… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #GameofThrones Daenerys Targaryen on Iron Throne Pop! #GOT #DaenerysTar… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #ToyStory4 Buzz Lightyear Pop! https://t.co/VUTmhs2Xty Liked on YouTube: Disney on Broadway celebrates 25th anniversary with magical mashup (FULL PERFORMANCE)| GMA https://t.co/4z2vOA9Q34 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #StarWarsCelebration Darth Maul Pop! #StarWars https://t.co/1oa8pngIpL My thoughts when seeing the pictures of the General Authorities and their wives was \"Oh my gosh, their wives are gorgeous\". #LDSdevo Brother Cook just tried setting up an entire congregation of young single adults and I’m living for it. #LDSdevo Liked on YouTube: SpongeBob: Endgame Trailer https://t.co/UynBu4lFIp I’m waiting for an interview with my stake president rn and this cute old couple came in and the man said that in the next life she’d be leading the way because she lead him to the office. I love it so much!!! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #StarWarsCelebration exclusive blue chrome Princess Leia Pop! #StarWars… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win this @Loungefly Captain Marvel mini backpack! #CaptainMarvel #FunkoAven… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #StarWarsCelebration exclusive Blue Chrome Yoda! #StarWars #Yoda https:… RT @HendGarrett: Every kid in Utah says “let’s go buy dry ice!” The day they turn 18 https://t.co/vKR7wqroiO https://t.co/OvhxY1RBts Hey @ryanscottoliver, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #GameofThrones Mounted White Walker Pop! #ForTheThrone #WhiteWalkers ht… @ellieryanh You'll freaking nail it RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an #AvengersEndgame Captain Marvel Pop! + @EntEarth exclusive collectible… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop Exclusive Mariachi Freddy Funko Vinyl Figure! https://t.co/i… Liked on YouTube: Radio Gaga with Prisoners https://t.co/HGtwlBPlfs Liked on YouTube: (Marvel) Tony Stark | I love you 3000 (spoilers) https://t.co/SBwUu2nvpg Have you gotten your tickets to Little Women the Musical at Viewmont High School.    No.    We’ll get them here: https://t.co/1hg050QYai\n\nAnd if you want to support than you can bid on prize baskets here: https://t.co/VPpGX6Rr4t RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #CerseiLannister on the Iron Throne Pop! #ForTheThrone #GameofThrones #… RT @unionjackgamer: RT + Follow for a chance to win this #Funko bundle for me hitting #1kfollowers on #Twitter\n\nAlso, double your chances!… Liked on YouTube: Darren Criss \"Getting Married Today\" - Broadway Backwards 2019 https://t.co/9FWlp6xSDi And also along with that is the fomo from everyone leaving on their missions right out of high school while I'm waiting Ok so I'm bearing my heart on my sleeve RN but I do kinda feel lonely. Of course I have a specific someone but they are far away. I haven't ever had a group of besties for more than a few years. It's gets pretty lonely being just a small part of many groups. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an @Amazon exclusive War Machine Pop! #FunkoAvengers #AvengersEndgame #Wa… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Galactic Convention exclusive Gold Chrome Stormtrooper Pop! #StarWarsCe… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an #Endgame Pop! Prize Pack, with #TonyStark &amp; #CaptainAmerica. #FunkoAve… Hey @sarahbarlow164, Thank you for the follow! Liked on YouTube: Jimmy Fallon and Paul Rudd side by side with Dead or Alive's You Spin Me Round (Like A Record) https://t.co/OUaa81xkmY RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #GameofThrones Tyrion Lannister on the Iron Throne Pop! #FortheThrone h… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Walmart exclusive Purple Chrome #Thanos Pop! #AvengersEndgame #FunkoAv… Hey @GGSIII, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #StarWars Smuggler's Bounty Wookiee Box!\n📦 Get yours before the box clo… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #GameofThrones Bran Stark Pop! #ForTheThrone #GOT https://t.co/a86ap8Fq… Liked on YouTube: 10 Amazing Kid Toys Adults Use for Themselves! https://t.co/2s8IuDSCsr Currently in notes for Little Women the Musical at Viewmont and I'm trying to set up two people by making my friend sit next to this girl and rub her back when she leaned forward. #gaybestfriendgoals RT @Callmemabeyh: If 87.35% of Utah is Caucasian, why does half my school turn orange during prom season Sorry to be annoying but...\n\nHAVE YOU GOTTEN YOUR TICKETS TO LITTLE WOMEN THE MUSICAL AT VIEWMONT HIGH SCHOOL!!!!!!! WELL WHAT'RE YOU DOING!!!!!!! feel free to share with your friends. in fact please do\nGET IT HERE!\n |\nV\nhttps://t.co/1hg050zmLI RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @BNBuzz exclusive #AvengersEndgame Hulk &amp; Thanos Pop! 2-Pack. \n#FunkoAv… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Walmart exclusive #AvengersEndgame Rocket Pop! #FunkoAvengers #RocketR… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a @Target exclusive 10-inch Bulbasaur Pop! #Pokemon https://t.co/1199MT… Liked on YouTube: sweet dreams but i put kahoot music over it https://t.co/UcvP8kig0k Hey @omghotels, Thank you for the follow! Thanks for helping me reach 25 followers! Who else do you think should be following me? Liked on YouTube: What a Pikachu World https://t.co/JOjKipVzZh Liked on YouTube: Every Single Upcoming Movie Musical https://t.co/TqakhzaBf8 Liked on YouTube: Stage Builder was a Mistake https://t.co/HnIbM0sRnU RT @IAmSusanEgan: Best news ever!!! https://t.co/WqcVn5pmpd RT @Amyjayyyyyyyyyy: Hello I will no longer be letting people treat me poorly Yo, have you gotten your tickets yet to Little Women at @ViewmontHS!!! No! What’re you doing!!!  https://t.co/1hg050zmLI RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Jon Snow on Iron Throne Pop!\n#GameofThrones #ForTheThrone #GOT #JonSnow… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop Exclusive Diamond Collection Princess Jasmine Pop! https://t… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Walgreens exclusive #AvengersEndgame Hawkeye Pop! #FunkoAvengers https… Liked on YouTube: Old Town Road (feat K. K. Slider) https://t.co/wqkFskuEOG Liked on YouTube: White Boys Try Learning Hip Hop Dance Routine in 15 Minutes https://t.co/5K1LcEKvdw @kurtisconner Me and my friend who have never talked about you before found out today that we both like you after I said, \"Yee Yee\". We open in a week (and 2 days). https://t.co/K7BMP4RRCU Hey @lizgraceknudsen, Thank you for the follow! Liked on YouTube: Sondheim teaches 'Not Getting Married' from Company https://t.co/A4Gby2KYHO RT @OriginalFunko: RT @ follow @OriginalFunko for a chance to WIN a @BoxLunchGifts exclusive #AvengersEndgame Iron Man Pop! #FunkoAvengers… RT @lizgraceknudsen: Man ya know what?\n\n I’m gay :) and it feels good to say it ☺️ 💕 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @BoxLunchGifts Earth Day exclusive EVE Pop! #EarthDay #WallE https://t.… Hey @hoover_angelia, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a White Walker Pop! Rides! #GameofThrones #ForTheThrone #GOT #NightKing h… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a PEEPs Pop! Prize Pack! @PEEPSBrand https://t.co/gYRYIZXRoi RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a @BNBuzz exclusive BTS Pop! 7-pack! https://t.co/4pRprvhJ6K RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an @Amazon exclusive War Machine Pop! #AvengersEndgame #FunkoAvengers #Be… Hey @tfry002, Thank you for the follow! @ellieryanh I read this as sinister sisters https://t.co/MTF7RfGDiq Liked on YouTube: 10 Products the World Doesn’t Need! https://t.co/KCBQ211Yx4 RT @QueerEye: you made it through another week. we're proud of you. you deserve rest this weekend ❣️ and for our weekend workers, you got t… RT @Papa_Ostler: Is ‘stan’ a noun, verb, adjective, preposition, dangler, conjunction, place or a thing 🤷🏻‍♂️?\n\nAsking for a friend 😉 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop exclusive Fantastik Plastik Chet Pop! https://t.co/i44O89PDe… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win this @BoxLunchGifts exclusive @Loungefly Bambi mini backpack! https://t… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop exclusive Glow-in-the-Dark Zouwu Pop! #FantasticBeasts https… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win an @Walgreens exclusive Ronin Pop! #AvengersEndgame #FunkoAvengers #Bec… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a @SW_Celebration 2019 exclusive blue chrome Princess Leia Pop! #FunkoS… Have you gotten your tickets to @ViewmontHS production of Little Women. If you haven't what're you doing!!!!!! Get them now right here: https://t.co/1hg050zmLI RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win an @EntEarth exclusive Ant-Man Pop! #AvengersEndgame #FunkoAvengers #Be… Hey @lifted_legacy, Thank you for the follow! Liked on YouTube: ARTIST TESTS INSTAGRAM ART HACKS! PART 2 https://t.co/XEmHDKSlRm RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Daenerys Targaryen and Jon Snow Pop! prize pack! #GameofThrones #ForThe… Liked on YouTube: 10 Products that Got Extreme Upgrades! https://t.co/l8gJOxhZHX RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a @BNBuzz exclusive Hulk and Thanos Pop! 2-pack! #AvengersEndgame #Funk… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a @Target exclusive 10-inch Thanos Pop! #AvengersEndgame #FunkoAvengers… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a PEEPs Pop! prize pack! https://t.co/WXHjjdF2UC RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a @ATT exclusive @GameOfThrones Metallic Night King Pop! #ForTheThrone #G… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Star Wars Celebration exclusive Watto Pop! #FunkoSWC #StarWarsCelebrati… Liked on YouTube: Goodwill Games #7 - PBG https://t.co/9QEQ1yIPkP Liked on YouTube: Glee - Getting Married Today (Lyrics) https://t.co/g9EIZOq5t3 RT @AudraEqualityMc: I’m am so ready for Elephants to take over everything. ❤️🐘 https://t.co/N65iIOHbPu Donkey because of the ADHD https://t.co/tClrsVJ5sM RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Star Wars Celebration exclusive Gold Chrome Princess Leia Pop! #FunkoSW… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Star Wars Celebration exclusive Darth Maul Pop! #FunkoSWC #StarWarsCele… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Star Wars Celebration exclusive Gold Chrome Yoda Pop! #FunkoSWC #StarWa… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win this @loungefly Star Wars Celebration exclusive Wompa mini backpack! #Fun… Hey @getgoculture, Thank you for the follow! Liked on YouTube: Isabelle Sings Fireflies https://t.co/YVbKMvZQ1f RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Star Wars Celebration Exclusive Gold Chrome Boba Fett Pop! #FunkoSWC #S… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a @PostMalone Pop! https://t.co/p10dmGo8it Liked on YouTube: Brennan Caldwell as Chip Tolentino https://t.co/3uR0UQGfvS RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win an @EntEarth exclusive Captain America Pop! #AvengersEndgame #FunkoAven… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop exclusive Direwolves Dorbz 3-Pack bundle! https://t.co/i44O8… I got this too. It was really convenient. https://t.co/VadEYVfW48 https://t.co/tnLXCmBHVx I just entered to win 2 tickets to the @AFCU private screening of Avengers: Endgame #AFCUEndgame @JaidenAnimation 's new video about relationships is GOLDEN!!!! RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Nebula and @Walmart exclusive Rocket Raccoon Pop! prize pack! #Avenge… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Disney Parks exclusive Rainbow Unicorn Pop! #NationalUnicornDay https… I just entered to win an Ultimate Author Prize Pack from @EditingWizard. Join me and I'll get another entry - there are 30 packs to be won every month, including free memberships! https://t.co/hccyntyb5i Liked on YouTube: I Bought the First 10 Products Instagram Advertised to Me! https://t.co/ARmkmvyqcQ Liked on YouTube: 10 Products with Hidden Features You Wouldn't Expect! https://t.co/QvVEdv0AuY RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Hawkeye and Black Widow Pop! prize pack! #AvengersEndgame #FunkoAveng… Hey @londontheatrer1, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop exclusive HQ Globe Freddy Funko Vinyl Figure! https://t.co/i… The Walgreen's here isn't on a corner!!! 😱😱😱 https://t.co/uv4uMRJl1m Hey @EPOSfanpage, Thank you for the follow! RT @NBCNews: Meet the women who helped break Japanese and German military codes during World War II. - @TODAYShow https://t.co/ZAAVk2OeKH RT @nytimes: A man suspected of being a rhino poacher was killed last week by an elephant and his remains devoured by a pride of lions at a… RT @traceyfanclub: today is jackie chan’s birthday and this is the only thing that matters https://t.co/RchulECwTj RT @gaby_val345: SEX TRACKING MESSAGE, DO NOT CLICK IT !! https://t.co/C9WqPJGEeY This tour has made me a diva. My Blanche is slipping out while on tour in Tennessee. @QueerEye @jvn $2.1 million a day to fund the St. Jude's Hospital. Beale Street is the birthplace of Rock. Blues came from the far south. Our tour guide is the most stereotypically sweet southern women and I love her. Mr. Lansky met Elvis when he bought a suit for Senior Prom on credit. Anastasia is coming to Memphis. The Chisco hotel was where Elvis's first hit record was played. It's now an apartment building. The Lorraine Motel was converted into a homeless shelter. Jaqueline Smith is protesting the museum because she lived there. Elvis's first hit record was played on a radio station in Memphis. My tour guide said she didn't get an art piece that's supposed to look like a mountain. I'm bored on my bus tour so I'm gonna live tweet cool Memphis facts:\nMemphis and Nashville are competitive AF about who's bigger 😂😂😂 RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a #WrestleMania Pop! prize pack featuring @MsCharlotteWWE, @RondaRousey… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a @SW_Celebration exclusive Darth Maul Pop! #FunkoSWC https://t.co/pMwy… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #SHAZAM Prize Pack, with all of these Pop!s. https://t.co/GxZkHBmX1E RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a CHASE @Target exclusive Twinkie the Kid Pop! #NationalTwinkieDay http… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win this @Loungefly sequin Minnie Mouse mini backpack! https://t.co/V3ZbUrN… @OriginalFunko @footlocker This one https://t.co/8mLeM4v4Ic I'm in Nashville and I love the accent but sometimes I copy it and can't stop so... Here we go!!! RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win an @amazon exclusive Wookiee Star Wars Smuggler's Bounty box! https://t… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #Shazam Pop! https://t.co/FvftJGxdj5 Liked on YouTube: 4 basic chords, 35 songs on ukulele https://t.co/h4TUKQrK37 I love when I haven't had a paycheck in a while and think I figure it out, and then it's still not working. #dosomethingplz The episode of @QueerEye Season 2, \"Big Little Lies\" so far makes me cringe. #wishmeluck #prayforme #imcringing RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win an @EntEarth exclusive Thanos Pop! #AvengersEndgame https://t.co/wf7zZf… https://t.co/zXUOVyGxHY RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a @PEEPSBrand Pop! prize pack! #PEEPSBunny https://t.co/MoeAURioLp RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a @Target exclusive 10-inch Aggretsuko Pop! https://t.co/8tz4BKIwP2 Hey @fmofmpodcast, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Marvel's Avengers: Endgame Funko Shop exclusive Dorbz prize pack! #Aven… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Thor and Captain Marvel Pop! prize pack! #AvengersEndgame #BecomeALeg… Today I felt unmotivated but was bored so I Googled, \"I'm bored but I don't wanna do anything\" and now I have depression. I wish my life was not put together enough so that @QueerEye would come to me. RT @QueerEye: life can be super overwhelming, it's good to take a break every now and then and care for yourself. TRUST US, you deserve it… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a set of #AvengersEndgame Black Widow &amp; Captain America Pop!s. https://t.… Liked on YouTube: 5 Year / 5 Genie Medley - ALADDIN on Broadway https://t.co/IXEwsvoCQI RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a @HotTopic exclusive Diamond Collection Genie Pop! https://t.co/8dgsvq… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Marvel's Avengers: Endgame Thanos and Ant-Man Pop! prize pack! #Avenger… Liked on YouTube: Playing Wizard101 in 2019 https://t.co/ZewM4Gsgxs RT @the_tomsters: Driving in Utah while it’s raining is like:\n\n🌧🌧🌧🌧🌧🌧🌧🌧🌧🌧🌧🚧🌧🚔🚑🌧🌧🌧🌧🚛🌧🌧🌧🚧🌧🌧🚒🌧🌧🌧🌧🚚⛈⛈⛈🚧⛈🌩🌩🌩🚘⛈🌧⛈⛈⛈🌧🚧———————🚗🌧🌧🌧🌧🌧🚧\nl cosmopolita… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Funko Shop exclusive red chrome Batman Pop! #Batman80 #LongLiveTheBat… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win this @Loungefly sequin Minnie Mouse mini backpack! https://t.co/QQ4VC1O… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @BoxLunchGifts exclusive 'The Little Mermaid' Ariel Pop! #International… Liked on YouTube: Musical Theatre Spotlight: Aaron Tveit https://t.co/Bzqsy0644i RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop exclusive Fantastik Plastik Orange Gill Pop! https://t.co/Fq… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop exclusive Colonel Sanders Pop! https://t.co/RcQz4DcVvc RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Star Wars Celebration 2019 exclusive blue chrome Princess Leia Pop! @… Hey @chandra7thomas, Thank you for the follow! Happy #WorldTheatreDay!!!!! Would they fix it if you did, probably not! #stillangry https://t.co/U9oBUzgOLi Hey @emma_layt, Thank you for the follow! Liked on YouTube: Mic'd up Mason - GoPro Edition https://t.co/6WwzX2Yvp2 Liked on YouTube: 10 Absurd Road Trip Gadgets That Shouldn't Exist! https://t.co/EyQIi2enNE Hey @pop_o_cIock, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a @BNBuzz BTS Pop! 7-pack exclusive! https://t.co/nspQwhXS7X RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Star Wars Celebration exclusive gold chrome Darth Vader Pop! #FunkoSWC… Hey @riya_8539, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Star Wars Celebration exclusive gold chrome Boba Fett Pop! #FunkoSWC… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con exclusive 'Lord of the Rings' Grishnákh Pop! #L… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a CHASE Goose the Cat [Flerken] Pop! #GooseTheCat #CaptainMarvel https:… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a CHASE Alex Trebek Pop! https://t.co/5xdEiPWc3T RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Target exclusive The Lion King Pop! &amp; Tee! https://t.co/g9Ddsrqkhh Liked on YouTube: 4 Year Old Mic'd up at Hockey https://t.co/aOeKzUzX9I Hey @Z3nPunk, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Star Wars Celebration exclusive Watto Pop! #StarWarsCelebration #StarWa… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC exclusive Harry Potter 3-Pack Pop! #FunkoECCC https://t.co/ncdW2h… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC exclusive Lime Sour Patch Kid Pop! #FunkoECCC https://t.co/29pJFs… @UmbrellaAcad I need to answer someone to a dance, they love Umbrella Academy. How can I do this? RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a @officialfye exclusive Freddie Mercury Diamond Collection Pop! https://… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Social Media Freddy Funko Pop! https://t.co/KTeToWod1N I relate to @QueerEye 's Fab 5 more than I've ever thought I would. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC Green Ranger FunkO’s! #FunkoECCC #FunkoSaturdayMorning #SaturdayM… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Patina Stan Lee Pop! https://t.co/4K2Md0NRjv RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win this @Loungefly Sequin Minnie Mouse mini backpack! https://t.co/31W9UTX… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC exclusive Banzai, Shenzi &amp; Ed Pop! 3-Pack! #FunkoECCC https://t.c… Hey @cnccadillac, Thank you for the follow! @queereye + #JonesBBQ + 🌈 I wish I could make an @Etsy shop but all my talents are performance related. The types of YouTube comments I see:\n- long stories that nobody really asked for bringing the attention to you\n- editing because people like your comment and thanking them because it brings you satisfaction\n- seeking attention from the channel\n- meme comments\n- first RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop exclusive Direwolves Dorbz 3-Pack bundle!  #ForTheThrone #Ga… So that Florida man birthday thing is popular so here's mine. March 11th - Florida man accused of intentionally pressure washing his neighbor #FloridaManChallege #floridaman Hey @Cerebral_Games, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con exclusive Fin Du Chomp Pop! #ECCC #FunkoECCC ht… Hey @CutPupy, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @BoxLunchGifts exclusive 'The Little Mermaid' Ariel Pop! https://t.co/4… Liked on YouTube: We faked a model to the top of London fashion week https://t.co/O2Xj70Ml4M RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @HotTopic exclusive Diamond Collection Minnie Mouse Pop! https://t.co/c… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Pokémon Charmander Pop! https://t.co/vUUQt0Y5YI Liked on YouTube: Stranger Things 3 | Official Trailer [HD] | Netflix https://t.co/4FyXAwdEzM RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @HotTopic exclusive Red Wing Robin Pop! https://t.co/4Z23OtFlxi RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop exclusive Presto Vinyl Figure! https://t.co/hQJRf54Qzg @ColourPopCo @dnhandbags @RockLoveJewelry #DisneyVillainsAndColourPop Liked on YouTube: I am a Latter-day Saint, I am LGBTQ, and This is What I Know https://t.co/kLDeLtiVxl RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Deadpool Pop! PEZ! @PEZCandyUSA https://t.co/c8JeID7HKP RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con exclusive Starfire Rock Candy. #ECCC #FunkoECCC… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a DC 5 Star exclusives prize pack, featuring NYCC &amp; #ECCC exclusives of B… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a CHASE Goose (Flerken) Pop! #CaptainMarvel https://t.co/6kSO0ToQew Liked on YouTube: Toy Story 4 | Official Trailer https://t.co/oeZvpSa8op Hey @LoveYouBothFilm, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Patina Stan Lee Pop! https://t.co/bI9dJXViXM Note to Twitter: If you have a goldfish, make sure you leave water out for a day or so, so it doesn't drown your fish.\n\nI had a scare tonight, but thank you @Google for helping me figure that one out. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con exclusive Pillsbury Doughboy Pop! #ECCC #FunkoE… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Captain Marvel Pop! #CaptainMarvel https://t.co/be68AUwTnH RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con exclusive 'The Wizard of Oz' VYNL 2-Pack.  #ECC… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Hermione Granger Pop! PEZ! @PEZCandyUSA #FunkoWomenOfPower https://t.… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC Ramona Flowers Pop! #FunkoECCC https://t.co/TctTpc5XgC RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC Diamond Collection Carmen Sandiego Pop! #FunkoECCC https://t.co/U… Hey @TylerSmalley15, Thank you for the follow! Hey @Abritte340, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con exclusive 'The Life Aquatic' Steve Pop! #ECCC #… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC Green Ranger FunkO’s! #FunkoECCC #FunkoSaturdayMorning #SaturdayM… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con exclusive 'Incredibles 2' Voyd Pop! #ECCC #Funk… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC exclusive 6” Porunga Pop! #FunkoECCC https://t.co/ETGYQOhMUR @unionjackgamer what's your discord? @unionjackgamer @Snowbunnybeth90 @guyhoff Done @calvinjburke Thankfully (and this is sadly rare) I have a a supportive family RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con exclusive 'Office Space' Pop! 2-Pack. #ECCC #Fu… Being an adult means entering sweepstakes and realizing that I did it legally this time. #IFTTT #AdultingAndStuff I don’t know why I never knew this, but Utah actually has a law that you can’t discriminate someone for being gay in jobs and housing and stuff. #randomgooglesearches RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Cap'n Crunch Pop! PEZ! @PEZCandyUSA https://t.co/skl7edCxjR RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con exclusive Mister Mxyzptlk Pop! #ECCC #FunkoECCC… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con exclusive 'The Lion King' Hyenas Pop! 3-Pack. #… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con exclusive #GameofThrones Arya Pop! #ECCC #Funko… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Charmander Pop! https://t.co/uW4xHd5S55 Maybe I didn't give yesterday a chance. 😍😍😍 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Carol Danvers on Motorcycle Pop! Ride! #CaptainMarvel #FunkoWomenOfPowe… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con exclusive Thor Pop! #ECCC #FunkoECCC https://t.… Dear Diary,\nToday sucked and I could say why but I only have 240 characters and want to be vague, but it sucked.\nSincerely\nMe So sometimes I have to play a character who has an accent, and sometimes that character has to say Kant, and sometimes that sounds like something else if it is said in the accent (cough cough Original Broadway Cast) so... time to purposefully not say it as he did. #shook RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Bob Ross Pop! PEZ! @PEZCandyUSA https://t.co/ckoZ3cJnfY RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC exclusive Pillsbury Doughboy Pop! #FunkoECCC https://t.co/figFT0L… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC The Big Lebowski Funko Skateboard\n#FunkoECCC https://t.co/4pxUUvb… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Marvel Collector Corps #CaptainMarvel Box!!\n📦Order your MCC box now (cl… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Target exclusive 'The Lion King' Pop! and Tee. https://t.co/qP3C0GoxZo RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win an #ECCC 2019 exclusive Office Space Pop! 2-pack! #FunkoECCC https://t.… Adam has been doing Viewmont theatre since Catch Me If You Can in 2016. He began as an ensemble man with one line as a waiter. The next year he made his breakthrough as Pickering in My Fair Lady. Adam also is in Viewmont's madrigals and concert choir. Thanks family for your supp. I only have 300 characters to write a bio so I'm using Twitter. RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Yogi Bear Pop! PEZ! @PEZCandyUSA https://t.co/oNqUPWzrST @BeMoreChill 💊+🥤 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop Exclusive Captain Marvel 3-Pack Dorbz Bundle! #FunkoWomenOfP… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Goose the Cat Pop! #CaptainMarvel #GooseTheCat https://t.co/KnE3WTRGxd RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Walmart exclusive #CaptainMarvel Pop! https://t.co/lwZcaKBFSy RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC Lime Sour Patch Kid Pop! #FunkoECCC https://t.co/6yeGi5mxTc RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC exclusive Freddy Funko Pop! #FunkoECCC https://t.co/vKsdKVaJDo RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con exclusive Black Canary Pop!  #ECCC #FunkoECCC h… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC exclusive Mister Mxyzptlk Pop! #FunkoECCC https://t.co/JNUXG8UsmP RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con exclusive 'Lord of the Rings' Grishnákh Pop! #L… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Social Media Freddy Funko Pop! https://t.co/LjUgHfavLn People worry me in the YouTube comments. Weird personal stories that nobody really cares about, the thousand edits when people like their comment, off putting comments when children are involved sometimes, etc. Why do I read them? I can't stop. #helpme @Snowbunnybeth90 @guyhoff @OriginalFunko How did you know you did? RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a CHASE Captain Marvel Pop!\n#CaptainMarvel #FunkoWomenOfPower #Internatio… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Bulbasaur Pop! https://t.co/gFfumem0Or Hey @ShinobiNinja, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Harry Potter Pop! PEZ! @PEZCandyUSA #HarryPotter https://t.co/hLHFdcvHsm RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC exclusive Fin Du Chomp Pop! #FunkoECCC https://t.co/Xk3y88S1LM RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #CaptainMarvel Carol Danvers on Motorcycle Pop! Ride. #FunkoWomenofPowe… Happy #IWDay2019 !! Yaaassss feminism. #girlpower Love all the women who inspire me everyday and who I love. Sometimes I participate in an English assignment that causes me stress because people are supposed to call you out when you're not doing it right. And sometimes those people are dumb because I'm trying so hard and I keep getting\"caught\" and half the time it's BS I think. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC exclusive Korath Pop! #FunkoECCC #CaptainMarvel https://t.co/nKyU… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop exclusive Tony the Tiger Pocket Pop! &amp; Tee! #NationalCerealD… Hey @Callmemabeyh, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Marvel Collector Corps #CaptainMarvel Box!!\n📦Order your MCC box now (cl… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC Lime Sour Patch Kid Pop! #FunkoECCC https://t.co/jBgt0xKL7r Mormon moms: (listening to mission calls) Oh my gosh was that where so and so went. Let me check. RT @hxxllxxh: straight guys flirt better w their homies than w girls While reading scriptures a verse ended with a - so I cut off my mom right then, then had to explain why I did. #accidentlytheatrical #theatrechild Kim Possible has probably one of the best TV theme songs out there. Don't @ me! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @MichaelsStores exclusive DIY Mickey Mouse Pop!   #Mickey90 https://t.c… Hey @FJandAssociates, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Hermione Granger Pop! PEZ! @PEZCandyUSA #FunkoWomenOfPower https://t.… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop Exclusive Monkey Assassin Pop! bundle! https://t.co/JXTUBfOp… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @GameStop Exclusive DC Collection Jim Lee Aquaman Pop! &amp; Tee. https://t… Hey @kenlovve, Thank you for the follow! RT @hankrsmith: A person who has had depression for years is like a soldier who has been stuck behind enemy lines. They ran out of ammo lon… Fun adventure today: I had permission to go to Kaysville during stage crew to pick up ply wood. It was rainy and windy and the wood was muddy but thankfully I had my best friend there who helped me out or I would've been lost. Scary driving back to school with tons of wood. Hey @jake_mounteer, Thank you for the follow! Demand Honey the dolphin and other animals released to a sanctuary - Sign the Petition! https://t.co/LAkBDSC3OQ via @Change RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @HotTopic exclusive The Joker (Death of the Family) Pop! https://t.co/U… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Grape Ape Pop! PEZ! @PEZCandyUSA https://t.co/cBFV6Sooq0 RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a 2018 Fall Convention exclusive #GameofThrones Beric Dondarrion Pop! htt… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win an #ECCC 2019 exclusive Office Space Pop! 2-pack! #FunkoECCC https://t.… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win an ECCC 2019 exclusive Banzai, Shenzi, and Ed Pop! 3-pack! #FunkoECCC h… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @Target exclusive #KingdomHeartsIII Sora (Monsters, Inc.) Pop! https://… Famous Broadway people are so nice to each other!!!! RT @MisterRogersSay: “All we’re ever asked to do in this life is to treat our neighbor—especially our neighbor who is in need—exactly as we… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @BoxLunchGifts exclusive Dr. Facilier (Masked) Pop! https://t.co/SuCAyo… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop exclusive Agent J Pop! https://t.co/i44O89PDee https://t.co/… Hey @liciromo34, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con Exclusive #Overwatch Sombra Pop! #ECCC #FunkoEC… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con Exclusive Diamond Collection Carmen Sandiego Po… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance for a chance to WIN this #TheWalkingDead Prize Pack (featuring an Ezekiel Pop! &amp;… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC exclusive Harry Potter Pop! 3-pack! #FunkoECCC #HarryPotter https… SpaceX Demo-1 Launch via NASA https://t.co/rttHiWZP1N https://t.co/9RAWFx2aJi RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a #ECCC Green Ranger FunkO’s! #FunkoECCC #FunkoSaturdayMorning #SaturdayM… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con Exclusive #RickandMorty Jaguar Pop! #ECCC #Funk… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a @Target exclusive Michael Jordan Pop! https://t.co/yg5Ayr4XVV RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a @Target exclusive DC Comics Bombshells Deluxe Collectors Box! https://t… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a @Target Exclusive flocked Mufasa Pop! &amp; Tee! https://t.co/sYGD7CByHV RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #CaptainMarvel Goose the Cat Pop! https://t.co/NAlgJt5Lfl RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a @Target Exclusive 10” Hedwig Pop! #HarryPotter https://t.co/9CHwZBoE9q RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop Exclusive Orange &amp; Teal Mickey Mouse Pop! #MickeyMouse #Mick… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN an Emerald City Comic Con Exclusive Ramona Flowers Pop! #ECCC #FunkoECCC… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #CaptainMarvel Carol Danvers on Motorcycle Pop! Ride. https://t.co/0a5f… Hey @Victori30365725, Thank you for the follow! Sometimes my mom has connections with people at the local theatre and they ask me for suggestions for the Christmas show. This sounds like a brag, but I knew that one day my extensive theatre knowledge would come in handy. RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win an #ECCC Exclusive Arya Stark Pop! #AryaStark #ForTheThrone #GameofThrone… I think I’m gonna use the word #gank now @Victorious Every girl deserves a #gaybestfriend How were we all just ok with how selfish and rude Jade from @Victorious was? I hate being sick. #thingseveryonesays Especially when you have to perform and you didn’t do that great so you kinda feel bad but you’re too sick to care at the same time #morespecific RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a @Target exclusive 10-inch Pikachu Pop! #PokemonDay https://t.co/bSVuk… @OriginalFunko I love the basic elements like fire 🔥 Hey @LuckyRandomKeys, Thank you for the follow! Hey @Kate41118188, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Emerald City Comic Con 2019 exclusive Starfire Rock Candy! #ECCC #ECCC2… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a Disney Parks exclusive 'Inside Out' Rainbow Unicorn Pop! https://t.co/c… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a @Target exclusive Pikachu Pop! #PokemonDay https://t.co/HV0pqSfcMW Sometimes I have to sing for choir when I’m super sick and literally didn’t care what I got, could have done better but I felt like shirt. RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Bulbasaur Pop! #PokemonDay https://t.co/AHw9txASAF RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a CHASE @BoxLunchGifts exclusive Dr. Facilier Pop! https://t.co/WR9PtiH… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @HotTopic exclusive The Joker (Death of the Family) Pop! https://t.co/V… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a NYCC exclusive #Supergirl Pop! https://t.co/o293fxZvfF Hey @Evelyn_Edwards1, Thank you for the follow! RT @GibiOfficial: ✨SIGNED Blue Yeti Giveaway!✨\nHi there! Here are the rules ~\n❤️Follow @GibiOfficial \n❤️Like &amp; Retweet this post!\n❤️Interna… RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #BlackPanther Pop! Prize Pack! #FunkoOscars #Oscars2019 https://t.co/B6… @hankrsmith I used one of your tweets in my talk today and it got a laugh. Thank you! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a #Queen Pop! Prize Pack! #BohemianRhapsody #FunkoOscars #Oscars2019 http… This woman at my college auditions is going to back to school for her bachelor's and wants to pave the way for wig designers to be educated in theatre. #wholesomesaturday #wholesome #canshebemycollegemom @adamlevine has mine but he's ripped and an adult man and I'm still a weak 17 year old so probably not. But I would hang out with him in a heartbeat. https://t.co/0Fy39bvvEa @jessiejensen https://t.co/czJl55NQiC RT @calvinjburke: sorry I can’t hear your homophobia over the deafening roar of my relationship with God &amp; Jesus, as well as my in-depth kn… Get in\nTurn water on\nWait till it gets hot\nTurn into shower thing with the dual bath/shower\nSing like 4 songs\nFinally wash myself \nShampoo \nTurn water off\nLeave tub \nHang out \nDry off finally \nSometimes shave \nSometimes brush teeth\nDress\nGo on https://t.co/UUZq9aUVC4 I'm chilling out because my root fear was what about airplanes but after some research and checking if SLC international was running smoothly I decided that I'm not afraid. Does anyone else not find wind relaxing at all and like kinda freak out about it a lot in your mind. Like I went to therapy for generalized anxiety but this stuffs been recent. #whatdoido RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to WIN a @GameStop exclusive Jim Lee The Flash Pop! Deluxe https://t.co/KR5nJXVh… I love when the weather app is like, \"oh it's just a 20mph wind\" and I research gust speed cuz I can hear it and that's all like, \"wind advisory warning gusts are up to 55mph\" and the freaking weather all didn't even tell me that. There's no gust speed on it. #highlyanxious RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Bulbasaur Pop! https://t.co/gft5clX59y RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Funko Shop Exclusive Glitter Light Fury Pop! #HTTYD #HowToTrainYourDrag… RT @KylaPadbury: do you ever wonder how many people talk about you in therapy RT @MisterRogersSay: “We live in a world in which we need to share responsibility. It's easy to say \"It's not my child, not my community, n… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win an ECCC 2019 exclusive Banzai, Shenzi, and Ed Pop! 3-pack! #FunkoECCC h… RT @ByCommonConsent: I'd rather have people live the gospel imperfectly than not at all. Currently panicking because of miscommunication and other drama drama stuff. #firsttimedirector #sicktomystomach RT @calvinjburke: *Really vulnerable thread* \n\nTW: suicidal ideation\n\nI’ve been thinking a lot about this thread today by my friend Addison… Hey @wokeprovotweet2, Thank you for the follow! Hey @HeatherBrooker, Thank you for the follow! RT @AriWRees: I think another valid contribution to this is that we need to think of our LGBT brothers and sisters. The temple can already… Hey @wokeprovotweet1, Thank you for the follow! Hey @jonmosesvocals, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for a chance to win a Patina Stan Lee Pop! https://t.co/kFhZLSyZfK Hey @soecihozo64, Thank you for the follow! What the fork? https://t.co/C6AaXrZMN5 If you can read this, you’ve helped me reach 10 followers. Thank you! Hey @_DarkMoonLilith, Thank you for the follow! Hey @AuthorityOnline, Thank you for the follow! Hey @brogtumbnodo88, Thank you for the follow! Hey @KarpRandel, Thank you for the follow! Hey @bernabephoto, Thank you for the follow! Hey @Patrici33839204, Thank you for the follow! Sorry, I want went on that #provaxx rant with all the @Change petitions. I just felt something tonight. Compensation for the negligible number of children affected by vaccines! - I didn't personally sign https://t.co/E9fXJSrkQC via @Change (I wanted to type something with this - I really like how they acknowledge it works and say they just want to help the 1) Facebook: Urge Facebook to promote REAL Vaccine Safety - Sign the Petition! https://t.co/IGBJaAp9lp via @Change New Jersey State House: Support New Jersey Vaccination Reform for an Informed Decision in Vaccines - Sign the Petition! https://t.co/juhLkX8iqZ via @Change Filii Iura: Childrens rights - Sign the Petition! https://t.co/y4xMII1fXX via @Change Facebook: Facebook should close down anti-vaccination pages and groups. - Sign the Petition! https://t.co/VDJfNk3deE via @Change Honorable John Horgan: Mandatory Vaccines in BC (with medical exemptions) - Sign the Petition! https://t.co/rRNNSm0d2U via @Change California Governor: Eliminate the \"personal belief\" vaccine exemption that's putting sick California kids at risk. - Sign the Petition! https://t.co/kHsfzWSQ3v via @Change Justin Trudeau: Make Vaccines Mandatory in Canada - Sign the Petition! https://t.co/dpUsQlbBwE via @Change doing them a disservice. Those diseases are DEADLY in children. Many kids want them and search for ways of getting them if their parents won't let them and have to wait till their 18, where they can THANKFULLY get them. So please vaccinate your kids!! - a 17-year-old (vaccinated) and that they use that to kill us (untrue) and to control our minds (also untrue but kinda hilarious) but that is bullshirt (I've been watching @TheGoodPlaceNBC ). There is abundant evidence that vaccines work and are safe. And if you don't vaccinate your kids you are (thread) This may be an unpopular opinion, but after searching \"proof that vaccines work\" and \"proof that vaccines don't work\" and looking around both pages came up with the answer that they do. Now I know somebody is going to think that the government is controlling this (thread) @JennColella went to @USUTheatre as a guest presenter and that may be a major reason I wanna go/ Demand a full investigation into the death of 7-year-old Jakelin Maquin - Sign the Petition! https://t.co/kxM78BKqz3 via @Change Man sometimes I hate people. People who bully others for having even slightly different opinions than then, people who bully groups of people who have had major bigotry, etc. Ugh! I hate Twitter sometimes. #saturdaydeepthoughts Tell Neutrogena to stop all animal testing - Sign the Petition! https://t.co/QfaeSiuoGg via @Change RT @GMA: This teacher fixing a kindergartner's hair in gym class is warming the hearts of millions! https://t.co/RXzmXIvEUO https://t.co/gT… RT @bwayducks: Okay-let’s get serious @Nickelodeon @TinaLandau @landoftrust @Mikedobson19 @BwayRecords \n\nHow many RTs for a @SpongeBobBway… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Bulbasaur Pop! https://t.co/mWMaTgJSVY Demand Google Stop Peddling Dangerous ‘Pray Away the Gay’ App Targeting LGBT Youth - Sign the Petition! https://t.co/eKJLm5pJZu via @Change @kristenkauwe Plz don't leave. I love your tweets. Sign my Petition:  They Stood with Us; Save Iraqi Family Under Immediate Threat for Working with U.S. Troops - Sign the Petition! https://t.co/8QZpkonWnJ via @Change Ask Congress to Pass the Preventing Animal Cruelty (PACT) Act - Sign the Petition! https://t.co/e7ldushk5X via @Change Hey @RealPika, Thank you for the follow! RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to win a Disney Parks exclusive Diamond Collection Abominable Snowman Pop! Sta… I'm in this with the white tank top. https://t.co/1fyo0w9Xmt Hey @KhandaRishab, Thank you for the follow! Swissport: stop making profit from greyhounds shipped to Pakistan - Sign the Petition! https://t.co/3I4R9LSyR3 via @Change RT @broadwaycom: Today’s tea:\n\n          )         )        )\n    )     (         )       )      )\n_(___(____)____(___(__ (___\n\\      It's… Hey @Ethan88793360, Thank you for the follow! RT @broadwaycom: .@AnastasiaBway will complete its journey on Broadway in March. https://t.co/M0ceUg1l2j Help Us Save The Asian Elephants by Liking and Sharing This Post #savetheasianelephants https://t.co/Dnbf2ddIzO via @UKChange Hey @artMISSIONARY, Thank you for the follow! Sometimes I google that scene from @lovesimonmovie where his mom tells him she loves him and cries. You know you've peaked when you can rap all of #Wannabe by #TheSpiceGirls. My old account got deleted but that's ok because I can restart I guess. #lookatthepositive"}