{"tweets": "Quiero compartir con ustedes una inmensa alegría.\nHoy Dios me permite ser padre nuevamente honrándonos con la llegada de Samuel a nuestra familia. Estamos felices en casa viviendo este momento. De antemano a ustedes muchas gracias por su amabilidad, respeto y prudencia. https://t.co/nsWzbkTxjD 😁⚪️ https://t.co/WytLgVfB3m Que sensación de volver a marcar en el Bernabéu. 😍 #HALAMADRID https://t.co/cembHsMVJn Ganar te da confianza para lo que viene. Este es el camino equipo. 💪🏼 #halamadrid⚪️ https://t.co/rIEGlGHlfN Seguimos juntos. Gran victoria, Ahora pensar en lo que viene. #HalaMadrid⚪️ https://t.co/57MSFdmGdt ⚽️😍 https://t.co/F24weGfRgd Domingo 🏋🏽‍♂️ preparado para lo que viene. 👍🏼 https://t.co/CNPv0kCeSb Aquí estamos otra vez. 😃 https://t.co/V2ceUJy5Wf Después de un largo tiempo he vuelto al Bernabéu ❤. Ha sido una una sensación única. Gracias a la afición por el cariño. Seguiremos trabajando para mejorar. https://t.co/xaf0WMOeHI Feliz con mi princesa. ❤️ https://t.co/o0Hs8cZYGd 🇨🇴🚴🏻‍♂️🥇@Eganbernal grande. https://t.co/EWqKMPWJuz @Eganbernal que alegría , los sueños con disciplina y esfuerzo se cumplen. Orgullo de colombia🇨🇴 Nairoman. 🤫 https://t.co/TSHXgGgPVf 💛💙❤ #independenciadecolombia   Nuestro amado país https://t.co/yp5YuvHq3D No te precupes, siempre hay una nueva ocasión! Libertex lleva a tu teléfono nuevas oportunidades cada día. Instala la app y aprovéchalas!\n      Android 👉 https://t.co/n7SXmb8lxu\n      iOS 👉 https://t.co/UeepMXCYYn https://t.co/4pcGlfKUUu 💭 👌🏼 https://t.co/k6hztSj6IM El mejor regalo de cumpleaños😍gracias por sus mensajes. #28 https://t.co/ovGXlJTKcQ 😎 https://t.co/W4WoChDEbX Frustración es lo que se siente ahora. Así es la vida, el fútbol aún más. Levantar la cabeza y seguir adelante. A muerte con mis compañeros, hemos luchado hasta el final.🇨🇴 https://t.co/oPHoLCnnhh Cuartos de final. 🇨🇴🔜 https://t.co/EXLfhCm8ai Siempre intentar y nunca dejar de luchar. Gran partido de todos. 🇨🇴 https://t.co/4XOQ6ambtq 10/10 para anotar tanto dentro como fuera del campo! Instala @Libertex_europe - Su scout financiero 😎\niOS 👉 https://t.co/xUMiSllrUv\nAndroid 👉 https://t.co/7lz5Y2lBl6 https://t.co/vTi74CWOmF Empezamos muy bien, victoria ante un rival que es de los mejores, paso a paso seguiremos construyendo nuestro sueño.🇨🇴 obrigado Brasil pelo apoio, siempre e bom estar aqui. 🇧🇷👏🏻 https://t.co/AqajwGqcb2 Un triunfo que da confianza. Ahora a pensar en la Copa América. La afrontaremos motivados y con mucha ilusión.🇨🇴 https://t.co/XTcNLwgBKD Orgullo por estos dos años de trabajo, respeto y logros en esta fenomenal institución. Gracias @FCBayern fue un honor. #MiaSanMia https://t.co/DQBXCcdISM 🇨🇴 https://t.co/ovvOcqs14r Hace 6 años el día más feliz de mi vida. Feliz cumple hija, te amo. https://t.co/B3L1dYhmb9 #warriorchildren @WChildrenGame esta batalla la vamos a ganar  RT💪🛡⚔️ descárgalo ahora 👉 https://t.co/OgjPZwd6nG https://t.co/lt5qGrn8W6 Ahora el cáncer infantil se combate jugando. Mira este video 🎬⚔️🛡https://t.co/zZE9ybW0ZN \n\n#WarriorChildren @wchildrengame @col_somostodos @FundacionHOMI Juega ya, dona ya! https://t.co/iStr33mAbA #warriorchildren https://t.co/WpilqY2j3a Doblete. 🏆😘 https://t.co/V23zXMEW4Z Si nada te detiene, eres de los míos. Mayo 27 #JamesWarrior https://t.co/5qYRiZZdei Mi segunda Bundesliga y mi séptima liga. Mi título número 21.  que linda sensación es ser campeón!  Que nunca se acabe. https://t.co/FA3X7qSJnW Ya vuelve ⚽💪🏼🙏🏻 https://t.co/EGZyDXuitf Mucha fuerza Iker, Recupérate pronto amigo. 🙏🏻🙏🏻 https://t.co/4V7HMegZVq Domingo ❤👧🏼 https://t.co/pcp7rmw8Wa Día de descanso. 😀☀️ https://t.co/FYslJD6Ubm Sensaciones positivas en estos partidos, con nuestro talento y sacrificio estaremos mejor. 🇨🇴 https://t.co/5Vg1bMbZfl Gran trabajo de todos los compañeros. Seguimos pensando en grande. 🇨🇴 https://t.co/CSUpLP5bnC Estrenando con orgullo nuestra nueva \ncamiseta 😍🇨🇴 @adidasfootball https://t.co/mkiTlJoyvW Mi primer hat trick con @FCBayern ⚽⚽⚽ https://t.co/sRaN8sVZHy La app de OTRO está aquí – ¡Click al link ahora para descargarla y participa para conocerme, gana, mira y chatea conmigo como nunca lo has hecho! Descárgala y únete a nuestro club https://t.co/EGEWSlRImr #OurOtherClub #ad https://t.co/NTjQLRKRA3 Gol y victoria. 🔝 https://t.co/roJsYwna0e Comunicado a la opinión pública. https://t.co/0j346f8T8n Que gran partido hoy de todo el equipo 🔥 https://t.co/FgYvlZiOJa Gran esfuerzo de todo el equipo ante un gran equipo. Contento por mi partido número 50 en @championsleague ⚽ https://t.co/MN4z4h4n0C Después de una buena victoria.🤙🏼 https://t.co/CMtVcOxx4i @Hublot #HublotlovesFootball Un orgullo 🔟 https://t.co/pe1TAmWOs8 You ask, I answer! Go to https://t.co/WEchKylfCD to submit your questions for me by Sunday, 27 January and I’ll answer as many as I can. @OTRO #OTROasks #OurOtherClub https://t.co/CpVSrDiW3N Feliz semana 😃👍🏼 https://t.co/bK2z5dfjrn ⚽✈😃 https://t.co/SRKtxd2QK8 Que mejor manera de empezar el año. 😍 https://t.co/zFw3ORb6KD 2019 🔥🙏🏻\n😎 @marcjacobs\n#marcjacobssunglasses https://t.co/k6XK9VQ4e8 Con mi ídolo, admiración infinita. 🔟+🔟 #todobien @PibeValderramaP https://t.co/vAXKoSDMNJ 🏀🔥 https://t.co/NQn4ueoHHJ Feliz navidad para todos.🎄🎁 https://t.co/u3ulprpbyH Verlos sonreír fue mi mayor regalo 🎄🎅 https://t.co/cdSYsi80C4 Feliz de haber presentado mi edición limitada de @Hublot y ser parte de esta gran familia. #hublotlovesfootball https://t.co/5BtZKmKFW6 Medellín 👏🏻👏🏻increíble como han competido. Felicidades a los hinchas del junior,  Que gran final en el fútbol colombiano. Que final estamos viendo 😱😃 👍🏼o 👎🏼? 😁 https://t.co/Hg5l838ASL Sigo y no quiero parar 👍🏼sensaciones 🔝 https://t.co/JdCSb9YDvV Boca vs River en el Bernabéu 😃🏆 https://t.co/ve1U9Uqf72 🏃🏽‍♂ 🙏🏻 https://t.co/iJIdYN6LG7 ¡@Libertexesp está de gira por Latinoamérica! Organizarán eventos en Argentina, Colombia, Chile, Perú, México… en los que analizarán los mercados financieros locales y darán consejos de inversión. ¡Les invito a todos a inscribirse! https://t.co/j1WkWhVI8j https://t.co/tkqqdoo9CT Felicidades lukita. 🎩 @lukamodric10 https://t.co/IcnSde9hDn 😀\n@OTRO #OTROisHere\nhttps://t.co/TbUFHIy3wg https://t.co/F75IogVKWg See Our Other Side, Join #OurOtherClub @OTRO #OTROisHere https://t.co/gkBCgAbuvf https://t.co/9T92QKbX4w Welcome to @OTRO #OTROisHere\nhttps://t.co/wlvXxQRrPH https://t.co/3yuyIll0Q3 Can't wait to share this with you! Get ready. @OTROofficial  #OTROIsComing https://t.co/TFjFTpEd2V https://t.co/q9NchM9Fy9 Con mi entrenadora personal 🤩 https://t.co/YfrDwT790n Todo empieza y termina en tu mente. Tu decides a que darle poder. @marcjacobs #marcjacobssunglasses https://t.co/IUrtyl9DiP Volveré muchísimo mejor y más fuerte.😀 https://t.co/4CrcWZIzmw Like football, trading is all about passion, emotion, and training. It is essential to be prepared, and thanks to the free Libertex training course, trading has never been easier, safer, or more fun https://t.co/hvg7UZFWat https://t.co/Pd126GaDpK Es mejor sonreír 😃 https://t.co/fVIPNEhtQT Gol y victoria. ⚽️🔴 https://t.co/nxaXmGMTxK 🇨🇴❤️ https://t.co/dpHp6Rev8Q Hoy justo hace 7 años debutaba en la selección. Es un sueño ponerme esta camiseta 🇨🇴. Gran victoria! https://t.co/ct3n12gKsG Preparados para mañana 🇨🇴 https://t.co/jJjFmU6gkc Hay alguien que me pueda ganar ? 🤔🏓😂 https://t.co/LY8rJlltEH 3 puntos más, una nueva anotación. Buen partido equipo! 🔴🔴🤙🏼 https://t.co/p6ObqkLkDl Gran noche de #UCL #MiaSanMia buen trabajo equipo. 💪 https://t.co/rx4WvUeQm8 Vuelve la #UCL⚽️🏆 https://t.co/hDSMCTpBkd Primer gol de la temporada,vamos por mas. 🔜⚽️ https://t.co/4bOGhUjTHD There’s nothing like a feeling of success, both on and off the pitch https://t.co/9PsR3qdRtL\n\nNo hay nada como un sentimiento de éxito dentro y fuera del campo de juego. https://t.co/Xa2bkipX9H This place is amazing.\nUn Lugar mágico https://t.co/MXX4etnS1w Sólo puedo agradecer por todo lo que diste a Colombia, nos devolviste la FE y la ilusión de ser los mejores. Me has hecho creer que soy mejor de lo que pensaba. Con tus consejos crecí a todo nivel. Te deseo lo mejor para lo que viene José. Serás siempre mi mejor maestro. https://t.co/VLYpV4cFYQ Sunday fun. @KingJames ☝🏼💪🏼 https://t.co/pXdlstTUfF Regreso a Bundesliga con una victoria. Lo mejor está por venir. https://t.co/2ZrkLQRhXn Think, want, work, do it! https://t.co/fzadCVBqrn Entrenamiento 💪🏼 cada día mejor. https://t.co/iCXghCiWOx I’m ready.💪🏼 https://t.co/ogDCR48JlE En la ciudad y fuera de ella siempre conduce con precaución. @ansvcol #ansv @col_somostodos https://t.co/T1ADBnqNrN 🤣🤣🤣😂😂😂😂😂😂😂 https://t.co/QNrh7Puvea Bye vacaciones 👋. Hora de volver a trabajar ⚽💪. https://t.co/47o6YYcRU0 Having Fun 😃 https://t.co/8GEsPDoGKN Hora de entrenar 🏋🏼‍♀ https://t.co/ZVUor0cCQa Feliz regreso 🙂 #ANSV @ansvcol @col_somostodos https://t.co/9g8zY17Iyu Les dejo este paisaje Colombiano🇨🇴 en el Día de nuestra independencia.  Que hermoso es mi país #20deJulio https://t.co/ecADZXPUgw 😎👍 #cool #style #fashion #ad #Marcjacobssunglasses @marcjacobs https://t.co/ijF1eq0K1W Gracias por sus mensajes en este día tan especial. Obrigado pelas mensagens 🤙🏽 Thanks for your messages. https://t.co/KAXpWYiMav 27 🎂🔜 https://t.co/oc5RGySCr4 Toma siempre medidas seguras #ANSV @ansvcol https://t.co/6quR2ywzD8 Mejorando, volveré mejor.                           I will come back stronger. https://t.co/9HuAUmBjqG 💔 https://t.co/vnL2yl54ha Gracias por sus mensajes. son de gran apoyo y energía positiva, Volveré más fuerte. https://t.co/x8l2Z5HBIZ Estamos en octavos 🙏🏻.  La fe está intacta. https://t.co/9uREMov74o Vivamos con precaución la fiesta más grande del fútbol #ANSV @ansvcol https://t.co/3e97nyeLGx Una alegría construida en equipo. 👌🏼 https://t.co/0tzGJgBw1T Seguimos juntos muchachos 🥚🥚💪🏼💪🏼 https://t.co/oJFfh928zX A los ganadores no los detienen los errores. Levantan la cabeza y esperan con paciencia  la próxima oportunidad para hacerlo mejor. Confío en mi selección 🇨🇴. https://t.co/moyZTvXNkP Lo único imposible es aquello que no intentas. Vamos 🇨🇴un nuevo sueño. https://t.co/L0OGyhnrnq Aquí vamos. Here we go🇷🇺 https://t.co/ZuEMexzDFS @cdtolima Campeón. Felicitaciones a todo el pueblo tolimense.👍🏼 A los que no han encontrado sus héroes, les comparto los míos.\nhttps://t.co/hGRfSXJ8fv \n@col_somostodos @FundacionHOMI #heroes #guerreros #luchadores #niños #valientes #fundacion #colombia #vida #alegria #SORPRESAS 🔟 https://t.co/HQRPeYCCFz Seguimos sumando cosas positivas para nuestra selección, buenas sensaciones ayer. 🇨🇴 https://t.co/4srx7q6YIw Seguimos entrenando fuerte y concentrados 💪 https://t.co/nBjVACvYNd Tu cara cuando estás con la selección. 😀🇨🇴⚽️ https://t.co/7mPeYrW4wH Nos vamos llenos de ilusión y muchos sueños por cumplir. 🇨🇴 https://t.co/xlS53J0HvK El mejor café del mundo 🇨🇴✌🏼 https://t.co/5GODzu4pv3 🇨🇴 https://t.co/kSJp5ld4xe Bundesliga 2018🏅 https://t.co/EOKZTkbwit Feliz de poder presentar mi edición limitada de HUBLOT.                          Happy to present my limited edition @hublot #hublot #HublotLovesFootball https://t.co/gRNPHKdPkq Día de recuperación, Ahora pensar en lo que viene que va ser aún mejor. 👍🏼🙏🏻 https://t.co/TSmflg56zl Hemos luchado hasta el final.             Wir haben bis zum Ende gekämpft. https://t.co/uO1fgFqGYj Siempre es especial regresar al Bernabeu.  #UCL https://t.co/1thfDUDZOE 👀🔜🔴 https://t.co/Peu8Qd9gm1 Estamos en semifinales 💪🏼#UCL @FCBayern 🛑 https://t.co/vJvgBhMt2d Campeón de la Bundesliga, Deutscher Meister 2018 🏆🔴 @FCBayern https://t.co/cWcSLCeFFE Buena victoria, bien hecho equipo.🔥👍🏼 Grandioser Sieg heute! Gut gemacht Team! https://t.co/qH58QTyr2N 🔟🇨🇴⚽️ https://t.co/OSs4z1RdAF Mi inspiración. 😍🇨🇴 https://t.co/isRXS66a4i Linda victoria con jerarquía, para adquirir confianza para lo que viene. El objetivo es llegar bien al mundial. 🇨🇴 https://t.co/QO0BKklx6L Mañana 🇨🇴⚽️😀💛💙❤️ Llegó la hora... Vive lo nuevo del 10! Clic aquí https://t.co/yfCsF4vIoD https://t.co/xmrTZP1yrE Un país, una pasión. 🔥🇨🇴@adidasfootball #HereToCreate https://t.co/cEgkKH5ZzT Feliz de estar de vuelta, y en cuartos de final de la @ChampionsLeague 👌🏼 https://t.co/9i1Z1gpCSH Sonríe que lo mejor esta por venir. 😀👍🏼 https://t.co/CZO9qKyrc2 Siempre he sido un admirador de la mujer. De su fuerza y su valor. La vida me dió una abuela, una madre, hermanas y esta hermosa princesa. #Felizdiadelamujer mi respeto para todas. https://t.co/OyTLqgVmwx 😁 https://t.co/hK1avFh9bJ #enjoylife 🎥✌🏼✌🏼🔜 https://t.co/Qm6YlxXFDl La mejor compañía del mundo. 😍 https://t.co/8kgzLxV4U0 Que bueno verte otra vez hermano. Te deseo lo mejor siempre pepito. https://t.co/hhkFJpaUy2 😎☀️ https://t.co/1Fv1ixOQhz Nunca rendirse.. https://t.co/0pkr2GfCuy La celebración es para mi hija. https://t.co/DX3kiYymdc Los momentos buenos quedan para siempre y mas cuando es con buenas personas. https://t.co/IEXSjKobZu Sim, brasil e umas das favoritas. https://t.co/bfXD1vEVdQ Bandeja paisa sin duda 😜😀 https://t.co/IOdvuU65Sy Es un grupo parejo, tenemos que saber competir muy bien para poder pasar la primera ronda, confío mucho en mi selección. https://t.co/SyJXakDYYW No se, muchos fueron golazos 😄😅 https://t.co/JQKzDvA1BL Jugué en Banfield. Entonces soy del taladro! https://t.co/7isbBtK1pA Obvio que si. Merece jugar un mundial. https://t.co/AHwpnSIa2p Solo lindos recuerdos mi paso por madrid, 3 años inolvidables. https://t.co/W5VBkHIYsx Me siento feliz en Múnich. Saludos! https://t.co/ZxGEHvAoSJ Eso me lo guardo para mi mejor 😆 https://t.co/wBLz1YweVC Buena pregunta, prefiero hacer una asistencia, pero me gusta también hacer goles. https://t.co/cpVWG9xFmV Sempre vou ser portista. https://t.co/SyORGmXuhw Calidad tenemos, Creo que es posible. https://t.co/OevyavzV5o Hasta ahora, Mundial 2014 vs uruguay. Por lo que significo también. https://t.co/VcDyQPyZ5Y 16 million followers thanks! 🙌\n\n16 millones de seguidores. Gracias! ... Responderé algunas de sus preguntas...los leo! Que buen partido, vamos bien.         Great game. 👌🏼 https://t.co/QYcAktCGDv Alegría siempre. 😁 https://t.co/z7tcDwZTzP Yo creo que las dos. 😛😁 https://t.co/lLMwn2EurD Equipo! Excelente juego. 🔝 👌🏼 https://t.co/9fR08VxryP Congratulations @esmuellert_ 😜 https://t.co/cyr75H8ykK Más momentos así. https://t.co/DJRENIm6Li Iniciando la semana. 💪🏼 #hardwork https://t.co/aYF7wruRQ5 Welcome 2018👌🏼 https://t.co/SvEXZEhO6k Eres todo lo que soñé, siempre a tu lado. https://t.co/XHmP5UCHIl Feliz semana. 😃👍🏼 https://t.co/dxN2K6xkTn Me encanta esta foto, momentos únicos. 😍 I love this photo. https://t.co/19zIbaJvfc Equipo. 🛑⚽️ https://t.co/uKxKY2Jyoc Qatar 🇶🇦 @FCBayern @FCBayernES https://t.co/FhRzYMpWci 2018! Muchos sueños por cumplir.🛫 https://t.co/9CRyRASoRe Feliz año, happy New Year! 🎉🎆 2018 🔜 https://t.co/J6qW2qf9PP #2018iscoming https://t.co/2A8voLaruF Gym 🏋🏼‍♀️ https://t.co/38tiHieJ0G 🇨🇴#EnjoyLife https://t.co/INGY1UUCNw 25 de diciembre también se entrena, Feliz día. https://t.co/FBq1t4UbiJ Feliz navidad 🎁 Merry Christmas 🎄 https://t.co/KzF11KPlKZ Disfrutar de los pequeños momentos. https://t.co/nJeVQvoB7U ✈️😃 https://t.co/d4S4kSe8i7 Acabamos el año en un buen nivel, 2018 será aún mejor. 👌🏼 https://t.co/m0kWlAbn54 Después de una gran victoria una buena cena. ⚽ Nach einem schönen Sieg, ein schönes Abendessen. https://t.co/aY8mRLYsP8 👌🏼⚽️ https://t.co/xKeDyOFkHB Quien quiere jugar?                              who wants to play ?🎮 ⚽️ https://t.co/LE9ohrvbmM Navidad 🎄🎁 https://t.co/Pv4bsXvMj3 ❄️#MiaSanMia https://t.co/JvkilKf5dc 15.000.000 millones de seguidores. 👏🏻👌🏼gracias. https://t.co/pXFdNHZWJL Parabéns Cris. Tu mereces irmão 🔝@Cristiano https://t.co/nuBnkW1tQN #NuevaFotoDePerfil https://t.co/KH3ShOTOLG Que gran partido. 👍 Great game. https://t.co/dVGi5hr3ro 1️⃣1️⃣👏🏻🛑 https://t.co/TKjTipQ4HU Desde ya empezar a soñar. Difícil pero nada es imposible. https://t.co/PYO72OrLzn Domingo tranquilo. Me siento bien y mejor del golpe que he sufrido ayer. https://t.co/OEwownWSAu RT @fcb_basketball: .@jamesdrodriguez trifft den 3er und macht den @KingJames! 👌🙌😉 #FCBB_live #FCBayern #Basketball #FCBayernBasketball @NB… Seguimos sumando! 🔴🔴 https://t.co/pauhAx2NpM 🔴🔴 https://t.co/QA0PhduZni Congratulations to Fabian Villablanca 🇨🇱 &amp; Leandro Mariategui 🇵🇪. I'm excited to meet you and can't wait to show you my football skills in Munich this month! ⚽🏆 @libertex_europe #Libertex https://t.co/2q4yZh6GaR https://t.co/LITh1tJ50n De vuelta a Munich. Back to Munich 🇩🇪👍 https://t.co/GN8eKYY3GF 안녕하세요 한국🇰🇷✌🏼 🇨🇴🔟👍 https://t.co/Mcr6QTLHWd 2⃣ winners of the @Libertex competition 📈Alejandra Schmidt Chile 🇨🇱 and Mario Razo Mexico 🇲🇽.  See you ✈🇩🇪 #Libertex\nhttps://t.co/2q4yZh6GaR https://t.co/DppuXhEgkC Lleva nuestros colores cerca al corazón🇨🇴 Nueva camiseta de Colombia con la que iremos a Rusia 2018. #HereToCreate @adidasco @adidasfootball https://t.co/TAwcRog59o Überragendes spiel Jungs.                       Extraordinario partido. 🔴🔴 https://t.co/JabBUOfJi6 🙏🏻🛑 https://t.co/Q9fw3xYFWO Glasgow #UCL https://t.co/qsJoIaJQAk Winners of the competition @libertex Elias Gil 🇲🇽 &amp; Juan Gallardo 🇨🇱 ⚽ Soon we will see each other to play\n#Libertex https://t.co/2q4yZh6GaR https://t.co/M0TdamXgzG Un gol con dedicatoria especial. Para ti mi hija. 😘 https://t.co/Tb3FY3vVf8 Tranquilidad 🌿🍂 https://t.co/OHUip5QNKp Two more winners of the @Libertex competition. 😎⚽️🙌🏼\nSantiago Amura 🇸🇻 &amp; German Gomez Rubio 🇲🇽 !! See you  #Libertex https://t.co/2q4yZh6GaR https://t.co/IV1urvYjSk Vamos sumando. Positivo 😉🔴🔴 https://t.co/4ZRw5SN8jk RT @FCBayern: ✈️📸 @kingarturo23 @R13_official @jamesdrodriguez @Thiago6 https://t.co/O0LNRG5amY 🔟 https://t.co/UOimPOhSGd Winners of the #Libertex competition\nFelix Romero 🇵🇪 &amp; Juan Francisco Blanco 🇸🇻 see you soon ✈️ 🇩🇪  https://t.co/2q4yZh6GaR https://t.co/WQOd79KpBJ Very excited to join an esport team ! \nhttps://t.co/faLd1JCCn4 🎮\n@TeamAresEsport \n#GAMEISALL #AresEsport #Esport https://t.co/8jQOOANgak Me enseñaron a NUNCA dejar de creer. Vamos mi Colombia querida  🇨🇴 https://t.co/gAuHkDDpDU Estamos en el mundial, orgulloso de ustedes muchachos, gracias por tanto. https://t.co/VZNWPZtNrM 🇨🇴 https://t.co/Nd3ETnXwTp Un lindo día para seguir haciendo historia. 🇨🇴 Modo selección, Con la mentalidad de hacer otro sueño realidad. 🇨🇴 https://t.co/J3dbW77t4t París #UCL https://t.co/xgtRHL3CJ3 📸⚽️🔴 https://t.co/x9yxfRaZuY Divertido momento en el Oktoberfest. https://t.co/nj5PwvMtUR Celebrar conmigo sí es posible, ingresa ya mismo a: https://t.co/Kzhf5uqHMZ, Podrás ganar un viaje a Europa y más  #LoHagoPosible https://t.co/txeXpIbK0W 🍴✌ https://t.co/T7iTjaYGq6 RT @CH14_: Es momento de ayudar, me gustaría anunciar la iniciativa @YoXMex. Sólo juntos podremos salir adelante. Dona aquí https://t.co/4D… Fuerza para todos los hermanos mexicanos 🇲🇽 👏🏻 Contento por marcar mi primer gol con la camiseta del @FCBayern 🔴 https://t.co/Iq5QlfayR1 ¡Conocerme, viajar a Europa y ganar 10 millones de pesos! Es algo que @HuaweiMobileCo puede lograr. Descúbrelo aquí: https://t.co/aquEX0FWxW https://t.co/GsVG4IWpAq ⚽️🔴#UCL https://t.co/PAZMjOARzC Vuelve la UCL😜👍🏼 https://t.co/2gvkvlP2Oe 🔟⚽️ https://t.co/Qq7FFZfNko Creer, siempre creer.🇨🇴 https://t.co/JXgtvWADPz este es el primer paso. Vamos!!🇨🇴💪🏼 https://t.co/AWJZeOgmqC Me siento bien.💪🏼 https://t.co/WPtSlTQ3fl Selección 🇨🇴🇨🇴 https://t.co/S8vs9P2UNB 🔝✌🏼😜 https://t.co/dAD32AAyHf Que felicidad tenerte a mi lado. #mylove🍦😍 https://t.co/2knpbxDtJm Your focus determinate your reality https://t.co/vjmlFy0ctE 😁🤙🏼 https://t.co/1unnNkGNp7 @FCBayernES ⚽️⚽️ https://t.co/ER5JuMviF1 Esto es mentira, no he dicho esto, respeto total por el Madrid! por favor déjenme tranquilo, ya me he ido de España, gracias. 👍🏼 https://t.co/cLF6J0NM40 🔴🔴🔴 @FCBayern https://t.co/nFiIQUff5n Me gusta la app de @libertexesp. Sigue el siguiente link y entérate del concurso https://t.co/2TK6m4tFmR podríamos jugar fútbol próximamente https://t.co/pPiVztVktm Hi China 🇨🇳 你好中國 https://t.co/7YLQHCT1B3 China ✈️中國 https://t.co/y297tpmJd5 Siempre con @adidasfootball 👟👌🏼\nCreating my @fcbayern story with adidas ⚡ #HereToCreate #X17 https://t.co/P6ucUWlTdP La vida me ha puesto un nuevo camino. Ilusionado con un sueño que empieza hoy. 🔴🔴🔴 #MiasanMia https://t.co/UlBNC6s93x Queridos madridistas me embarga la gratitud, 3 años maravillosos vistiendo con orgullo esta camiseta. Llevo en el corazón su cariño. Éxitos. https://t.co/vD5byXisIz 😍 https://t.co/GNBg7s5RCT Pasan los años y es imposible no emocionarse. 🇨🇴 https://t.co/pxeOXbgDJZ Faltaron algunos  🤣 https://t.co/WXb5LY1ZNe Gran profesional y gran ejemplo para muchos, te deseo lo mejor para lo que viene. @aarbeloa17 💪🏼 https://t.co/uIFZUkRNaY Que buena final estamos viendo. nacional vs Cali, Que lindo cuando salen a jugar al fútbol.  quien será el campeón ? La alegría de un gol. 🇨🇴 https://t.co/lrWupXhmIB Día de partido. Hoy juega Colombia 🇨🇴 🤙🏽 ¡Participa en el concurso Libertex y gana un viaje para jugar al fútbol conmigo más adelante en el año \n👉 https://t.co/pYnKGB597q https://t.co/y5WmhW3leT Que lindo es jugar con esta camiseta. 🇨🇴 https://t.co/XCj2Q9ZMZQ Modo selección.🇨🇴😃 💙 https://t.co/PYRdzvfa62 Dios tiene el control de todo! Una más 🏆 https://t.co/ucg1HQC4rY ⚽️ https://t.co/bxAkrMkLpd Un título más! Gracias a Dios. 🇨🇴HALA MADRID https://t.co/bdJCYKepr2 CAMPEONES!!! 🏆 👏🏻😀 https://t.co/fmwYvAAGQP ✌ https://t.co/P8HZGa2ExL Una acrobacia para alegrar el día ⚽😉 https://t.co/62oluf4Fh8 Training #UCL https://t.co/RuNNwI6rvk Bien equipo! Bien luchado hasta el final. @MarceloM12  você é foda joga muito. https://t.co/8S3QuChiVp ⚽⚽ https://t.co/nRlLjULIuL Celebración para una personita que me tiene loco de amor. Seguimos dependiendo de nosotros. Hala Madrid! https://t.co/nySMD5FWuD ☀ Enjoying! https://t.co/a0H2aXSuzJ Con el hombre de la tarde, dos goles de @isco_alarcon  la rompiste . Que gran victoria! https://t.co/LXC8LLBOK0 Triste noticia! Sus canciones y su pasión nos hará recordarlo siempre. Fortaleza para sus seres queridos. @martineliasdiaz 🙏 https://t.co/3zFjPi3n0X Not allowed to give up. 🏆⚽ https://t.co/RYmBcwDFK0 Muchas gracias a todos por el apoyo y por pertenecer a esta gran comunidad. 30 millones en Instagram. 🤙🏼👏🏻😜 https://t.co/VqyQ0Vbtf7 👆😜 https://t.co/L9EhY8Dhlc Esto es Colombia Carajo !  🇨🇴🇨🇴🇨🇴lucha y entrega. Gracias muchachos. https://t.co/9LQDySeZVE Tres puntos de oro. Gran esfuerzo muchachos. Vamos por más! ⚽ https://t.co/K7WgiAMMJ3 Modo selección 🇨🇴😀 https://t.co/RxkDUbPtha Ella es genial 😍 https://t.co/X77JIRnEOp Gran juego en equipo, siempre unidos. https://t.co/HS8XrmHajn 100 partidos con la camiseta del Madrid ! https://t.co/KrHjlrO5iQ Guys, if you’re trading with #Libertex, will it be oil or gold today? Share your opinion in the comments https://t.co/6uV7SOY8Bh https://t.co/m7OloHx2sa Elegancia y diseño, características de #HuaweiNovaPlus. ¿Ya tienes el tuyo? https://t.co/Rk7zKwUB9E 😎👍 https://t.co/3fNwWhCnJd Un niño con gran corazón. Johan Ramírez el niño \"ángel\" del Chapecoense. https://t.co/ZyUXVvVQnx Now it’s time to check Libertex online 😄👍https://t.co/OQtGwaXXze  #libertex https://t.co/UeMxcKxDOH Gran trabajo el día de hoy en Champions. #halamadrid https://t.co/jP8t13gpeT Mañana vuelve la Champions. https://t.co/7lnlGRLgQL Triunfo importante. #HalaMadrid https://t.co/l5BRpp9apP Seguridad! #HuaweiP9 y su huella digital, ¡solo yo lo puedo desbloquear! https://t.co/GgyxPg1AMv Con mi princesa 😍 https://t.co/XcSyc37uqp RT @CAB_oficial: #EfemeridesBanfield 📆📌un día como hoy pero 8 años atrás, el colombiano @jamesdrodriguez hacía su debut con la camiseta de… ❤⚽ https://t.co/zYJpmt4lDQ Feliz Semana ! https://t.co/zpUgerjxJg Mejorando cada día 👍 https://t.co/FyE2orBOOs Enfócate en lo que más te gusta, con #HuaweiNovaPlus podrás hacerlo. Descubre su increíble cámara e impactante diseño https://t.co/nL1yJMxe4O Gol.. se puede vamos 💪🏼 Con #HuaweiP9 cualquier lugar se convierte en un instante perfecto. Compra el tuyo ahora. https://t.co/pkdYrSeMky #HuaweiNovaPlus te da mucho más.\nEscoge tu mejor foto, llénala de color y compártela.\nAhora ya sabes cómo #DesafiarExpectativas https://t.co/KrhGe23WtW 🔟 https://t.co/dvCsm94VNL Felicidad ⚽⚽ #HalaMadrid ! https://t.co/z8nc0l1rBd Hoy ⚽ 👍 https://t.co/TOde1TLduQ Feliz año!!!!! que el 2017 este lleno de muchas alegrías y bendiciones.\nHappy New Year 🎉🎆 https://t.co/8T1zDqRmTv Estoy orgulloso de convertirme en embajador de Libertex - la app de trading más inteligente. https://t.co/6uV7SOGxcH #Libertex https://t.co/X7ctRgBNLB Feliz Navidad. Merry Christmas https://t.co/BZb2RB2chC Momentos ❤🎄 https://t.co/aBvsKZWHh3 Impactante diseño, así es #HuaweiP9, ve por el tuyo ahora. https://t.co/4eottIZwfY Una más🏆!! Campeones del mundo. https://t.co/dv0xO9IKHi Estamos en la final. #HalaMadrid https://t.co/m7mItcoPQT En la mejor época del año sonríe, disfruta, comparte y sobre todo captura grandes momentos con tu #HuaweiP9 https://t.co/CWVfFvJ3qM Hola Japón  🇯🇵こんにちは日本🇯🇵 https://t.co/6IjHqoSY8H Calidad de día o de noche. Así es el nuevo #HuaweiNovaPlus siempre #DesafiandoExpectativas https://t.co/SzDEz1UzMo https://t.co/tKPYIiD6Bn Hoje o mundo chora, meus sentimientos a  todos os familiares  e amigos  #forçachape Controla tu mundo y estabiliza tus momentos #DesafiandoExpectativas. Nuevo #HuaweiNovaPlus adquiérelo y descubre su increíble cámara. https://t.co/dU6Sii9A5w All weekend #FIFA17 is FREE! https://t.co/USJJyIrbBP @easportsfifa #ad https://t.co/7pSJhlUjVj Gym 🏋🏼‍♀️ https://t.co/lna64Ivnpy Vamos país! Hoy juega la selección ! Fuerza Colombia 🇨🇴💪 https://t.co/s45Dt8oWdv Bienvenido tigre @FALCAO  Vamos a soñar juntos de nuevo ! ⚽ 🇨🇴🇨🇴 https://t.co/JDZQfuiZhd Se ven deliciosas las #PringlesPollo. ¡Celebremos un gol, @Pringles_LATAM! https://t.co/X27eOr1bmX @Pringles_LATAM ¿Qué tal si celebramos un gol? #PorUnasPringles ⚽ ¡Uff! ¿Qué tal unas #PringlesPollo? 🍗🍗🍗 Barranquilla 👍 https://t.co/Q37qHYCqw2 Modo selección 💛💙❤️ ⚽⚽🔟 https://t.co/TQUGyXmSQB Meu irmão https://t.co/NSyDKk8WrP Vuelta a casa después de un triunfo muy bueno. 👍🏼 https://t.co/3gciFI2VVe Besito de buenas noches 😍 https://t.co/xKAnYLD00g Solo hay una forma para dejar marca. Abre la imagen y descubre #HuaweiP9 https://t.co/OhGMaSEbFp ⚽👍 https://t.co/vdZ76RgllD I'm super excited to play some #FIFAMobile with me on my squad. https://t.co/cWfZvSa6eB #ad https://t.co/880DHySwrf De vuelta al campo con buenas sensaciones ⚽💪🏼 https://t.co/kL0UZlr5Em Gol!! Vamos se puede Hoy me toca ver el partido desde casa pero con mucha energía positiva para mis compañeros. Vamos Colombia. https://t.co/ihEVsYIjjg Trabajando para volver mejor 👍 https://t.co/BNGKQwflLA Grande muchachos. Tres puntos de oro, 😀😀vamos 🇨🇴 Para cambiar tu mundo solo\nnecesitas tener un enfoque claro.\n#HuaweiP9 https://t.co/9G7XDJMBTu Recuperación para volver mejor y más fuerte. https://t.co/vwOfpkLwKJ ⚽️ https://t.co/GHL809q5K3 Finally let's play \n#FIFA17! It's available NOW! @easportsfifa https://t.co/h7XXY6bDI9 #ad https://t.co/r50V3xGxvd Yo escogí el que más se adapta a mi estilo #SoyHuaweiP9 https://t.co/KEAHDMnyj7 Here we go! Play #FIFA17 now with @EAAccess @easportsfifa #ad https://t.co/FD5JryEx0s https://t.co/ynH2fNpWxr 😀😍 https://t.co/VdsYHbKab7 Porque tu Dios eres mi soporte. Gran trabajo de todo el equipo. https://t.co/ITiEAa6nVN Que gran victoria @realmadrid nunca se rinde ! https://t.co/ogBdDASE5A It's here! @easportsfifa #FIFA17demo #FIFA17 #ad\nLink: https://t.co/ps7MU9bLwY https://t.co/SFX7ncIfxi 👀⚽ https://t.co/efYB4cuMpC Gracias Colombia! Un lindo triunfo, ahora a pensar en lo que viene. Gloria a Dios! https://t.co/yhCBQau8o3 Con mucha ilusión y motivación para mañana ⚽👍 https://t.co/YjSNWnGHTx Cambia la manera de ver el mundo. #NuevoHuaweiP9 https://t.co/3hdVUteeqx 😊 https://t.co/SHxIPZ6tY8 Muchos estilos para comunicarme con mi #NuevoHuaweiP9 https://t.co/16SnWf48JH Buen Inicio https://t.co/XQgahHouWx Que orgullo! Gracias a todos nuestros deportistas por darlo todo representando nuestro país. Colombia es de oro. https://t.co/12kLhy6Vsz ⚽⚽ https://t.co/wUc0XkszVR Football is back! Let's go!  #HalaMadrid #FIFA17 @EASPORTSFIFA #ad https://t.co/gxCWY45dsp No hay tiempo para descansar 💪 https://t.co/wPDBOZx9Qq Campeones #HalaMadrid 🏆 https://t.co/V8AlzcFYgg Pretemporada 👍 https://t.co/OAKiwaa1Rx Go! #FIFA17James Vamos por la carátula\nVote to me on https://t.co/CIvTh7pOjZ Clic!\nThanks! Falta un poco! Gracias ;) https://t.co/lmrpt5lDse From @realmadrid to @ClubDeCuervos De Madrid para México #Firstneverfollows https://t.co/H7mGzPVh7k You´re the first to wear it @TokuraFreestyle Nuestra camiseta ya está en Japón!\n#FirtsNeverFollows @realmadrid https://t.co/SLJV5J3VU4 Special delivery to @clubdecuervos !\nEntrega especial al @clubdecuervos !\n#FirstNeverFollows #HalaMadrid https://t.co/8ACxAZ4FLn A present to my friend @TokuraFreestyle !\nPara mi amigo en Japón!\n#FirstNeverFollows #HalaMadrid https://t.co/CMlRT0E5xE 25 🎁🎉 https://t.co/iLPy31AvJe Celebrando! https://t.co/6NnOk0i6Dh Thank you very much for your birthday messages, they are an inspiration for me. #FelizCumpleJames Muchas gracias! Sus mensajes son inspiración para mi. Gracias por tanto. #FelizCumpleJames I just voted @jamesdrodriguez to be on the FIFA 17 cover. https://t.co/JyzgCcG6Ce #FIFA17JAMES #FIFA17CoverReward vía @EASPORTS Gracias por tu apoyo! Vota aquí https://t.co/PrE0Yxvvd3 #FIFA17James Vamos ;) https://t.co/7pZ4fBKBsy Vote for me #FIFA17James CLIC https://t.co/PrE0Yxvvd3\nI helped out with the Set Piece Rewrite in #FIFA17 🔥 Look this https://t.co/Xnw2mj7NwX Ver el mundo de otra manera #OO https://t.co/PCSeSgbR1b I all star #mycalvins.  @calvinklein https://t.co/S613azODjP Vota por mi #FIFA17JAMES Put me on the #FIFA17Cover! 😊 Clic https://t.co/CIvTh7pOjZ https://t.co/PVRucmMxFf Con pasión se ve el mundo de otra forma #OO https://t.co/yGWxnrOVTi Feliz semana. 👍🏼⚽️ https://t.co/bjaNXlGUdi Felices por el paso a semifinales .... El más grande @D_Ospina1 https://t.co/ci3krv6ngZ Con mucha ilusión para mañana. https://t.co/QSFjqEsX0G Juega hoy conmigo el partido Vive v. Sueña de \n@KelloggsLATAM. Tuitea con el ht #KelloggsSueñaFútbol \ny gana la oportunidad de conocerme. Te esperamos en @KelloggsLATAM para la revancha del cascarita Vive v. Sueña. ¡Apoya al equipo #KelloggsSueñaFutbol! https://t.co/2EXeyA7sSW ¡Salgo en #FIFA17! 💪 🎮 https://t.co/tnfjg0p1pq New Jersey. Con mucha ilusión y unidos como siempre https://t.co/B7eR6RysZr Vivamos juntos la pasión del fútbol! Entra a https://t.co/hbJZgWbqOT y gana una experiencia conmigo #KelloggsSueñaFútbol. Gran partido muchachos. Grandes! ❤️🇨🇴 https://t.co/fTC1NoenpI Próximamente más noticias sobre #FIFA17 https://t.co/aMNTeiGsW3 Gran partido ayer de todo el equipo. 🇨🇴 https://t.co/tIp2iP7poW Inicia un sueño!! Con el corazón, todos juntos. https://t.co/sePNrKf2HX Súmate al equipo #KelloggsSueñaFútbol y gana la oportunidad de conocernos. ¡Sigue a @KelloggsLATAM ⚽️⚽️⚽️ Colombia 🇨🇴 https://t.co/5oytN6cqoC ¡Ganemos el partido Vive v. Sueña Sigue a @KelloggsLATAM y usa el ht #KelloggsSueñaFútbol https://t.co/dKaA9E91rX Hace 3 años que llegaste a nuestras vidas, Eres una bendición de Dios. Feliz cumpleaños mi princesa hermosa. Te amo! https://t.co/6AamIM0HNb 11. History. #FirstNeverFollows @adidasfootball @realmadrid https://t.co/J3fmQVjWhR La undécima. 🏆 #HalaMadrid https://t.co/M2mvAnLO26 Campeones!!! Champions!!! https://t.co/WsMs6DZddY Con #HuaweiMate8 tengo un servicio VIP. @HuaweiMobileCo https://t.co/fcZOIruhYd Quedan 2 días para la #UCLFinal\n2 days left, I’m ready! https://t.co/hHL8ET2m8Z\n#FirstNeverFollows #X16 https://t.co/sS2AuhQGD3 They’re Perfect. #X16 #FirstNeverFollows @adidasfootball https://t.co/C1sszyXdAI Feliz día a todas las madres del mundo! #GraciasMamá Clase, estilo y diseño, eso tiene el nuevo #HuaweiMate8 de @HuaweiMobileCo https://t.co/0ucO2lFF50 Excelente equipo ! ... Ahora la mente puesta en Champions! https://t.co/uYSNVKLtsC Preparado para la Champions League! I'm ready for the #UCL! https://t.co/RhG5nfqNKI https://t.co/aceOWFGV9x ⚽⚽⚽⚽⚽ https://t.co/PRRAWOUhSD 😄⚽ https://t.co/kiJhr0DRlB Hoy empiezo una nueva aventura con @adidasfootball , ahora soy #X15 #BeTheDifference https://t.co/B7zFQ5qCVq La pasión de un país. https://t.co/okzibABkAD Gran triunfo equipo. Como hermanos! https://t.co/E5GF1QC3t9 Grande equipo! Esfuerzo total resultado justo. Feliz con el gol 100 ahora concentración para el reto en Barranquilla https://t.co/trPn2ceOy6 Para viajes largos, clave tener batería de sobra en el smartphone. https://t.co/B6eEWuQieC Que alegría y orgullo estar en la selección . https://t.co/9xv1pH9E2v Miedo es quedarte sin batería. Nuevo Huawei Mate 8, ¿qué te parece? \nhttps://t.co/Ann4opk3Bu Mira mi #PepsiMoji Check out my #PepsiMoji https://t.co/Ca1QwqEBFf Download them here: https://t.co/GIe0xUOMbg ⚽️ https://t.co/1HdIK8qlMr Felicidades a todas las mujeres del mundo. Su rol da equilibrio a la vida y fortalece la humanidad. Respetémoslas, valorémoslas. Match Day with @Pepsi #BlueCard https://t.co/s5TOVpo6E0 Things are about to get exciting. Introducing @Pepsi #Bluecard click!! https://t.co/QhdifJkmSZ https://t.co/qCCGdIsUd4 Buen juego . #halamadrid https://t.co/VsZblkgfRD Parabéns mano. happy Birthday bro. https://t.co/YZk7xVZUWm Buen partido a seguir así equipo.            Well done guys. #HalaMadrid https://t.co/1ixl27iUKv El equipo ganador de hoy. #alegría 😂🔝 https://t.co/gARR40r4MD Sólo admiración Capi! ...Un honor compartir el fútbol. Los mejores deseos en el nuevo camino gracias por tanto. https://t.co/iogbDhLwCO Con mis nudillos en la pantalla de mi Huawei Mate S puedo acceder a las aplicaciones #ReinvéntateConHuawei https://t.co/QKOTlm1306 Nada puede ser un límite, ese el camino. 💪🏼😜 https://t.co/LyjZsz9e4v Hasta el 15 de enero puedes participar para viajar y poder conocernos en España.https://t.co/Q6IwlQo0My https://t.co/UKdWK21lX9 ⚽️⚽️ https://t.co/CMY5nIe60k Feliz año, les deseo un 2016 lleno de alegrías y mucha salud. Gracias a Dios por todo.       Happy New year! https://t.co/n2ziQIjpQq ¿Qué esperas para ser uno de los 15 ganadores de la promo Navidad de Huawei? ingresa a https://t.co/eOECoPbqM7 https://t.co/tAK3zRDXVw Así termina mi día, Feliz Navidad a todos. Merry Christmas to all, lovely time to share with family . https://t.co/1UT2trdzdK Nuevo Huawei Mate S, el Smartphone que reinventó el Touch #ReinvéntateConHuawei @HuaweiMovilesCO https://t.co/WEA15JeT0R Ya puedo ver mis fotos usando el sensor de huellas de mi Huawei Mate https://t.co/XL2wsK2QRq  #ReinvéntateConHuawei https://t.co/vjcY34EYBd Buen trabajo. https://t.co/nWBDH1xpDW Feliz, gracias a mis compañeros que me ayudaron a ganarlo, Gracias por el apoyo y en especial a todo el madridismo. https://t.co/lawcUVYjov Vamos mi Madrid. https://t.co/LHAWZbURj4 Con mis amigos de @HuaweiMovilesCo en el lanzamiento del nuevo Mate S #ReinvéntateConHuawei https://t.co/vhJW4Yq9hk La alegría y la unión de la selección. https://t.co/yN2VYLh4zP 💛💙❤️ https://t.co/Nrsi6jvRtS Juntos somos mejores. https://t.co/HxDxBaerpc Quiero compartir con ustedes esta edición limitada que hemos hecho con @HuaweiMovilesCo https://t.co/3EQi0QGPeP No estoy considerando la compra de ningún equipo de fútbol en Colombia. El rumor que circula es falso. Muy feliz de estar de nuevo con el equipo. Esta noche gran partido de Champions League. #halamadrid https://t.co/473T737iUc No laces? INSANE new boots from for next year! No hay cordones? MIRA los guayos del futuro! #BeTheDifference https://t.co/Afhu6sUrdY Entrenamiento, Con mucha ilusión. 💪🏼🔟 https://t.co/y7suoZYb6a Falta poco. https://t.co/2IXBNPILmo Keylor increíble. 👌🏼 Segundo gol. 🔝 #HalaMadrid Con muchas ganas e ilusión. Y más importante aún, con muy buenas sensaciones. http://t.co/FywFLM2Hld Con los fenómenos. #bros cada día mejorando. ✌🏼️@Benzema #lukita http://t.co/356c2x4l1U Fe, el camino es largo. Vamos muchachos, vamos mi selección, toda la buena energía para que todo salga bien. Feliz semana. 👍🏼 RT @CAB_oficial: #GolesHistóricosCAB Inolvidable golazo de @jamesdrodriguez en el Clásico ante Lanús https://t.co/G8e0269fNj Cuando sonríes todo es mejor!  Dentix sonrisa 10 https://t.co/D21sjCPE2c Gol gol liquidado. Vamos Que sufridera Gol gol 🇨🇴🇨🇴🇨🇴🇨🇴 Con el corazón y el pensamiento allá con el grupo! Hoy inicia el camino por un sueño. #VamosColombia confío más en el trabajo que en la suerte.\nUn día menos. http://t.co/Rqc0LK2FM6 Vamos mi Madrid. #HalaMadridYNadaMas Transforma la noche con el light painting del Huawei P8  #ColombiaDeNoche https://t.co/IG76uDdaF1 http://t.co/VfGGg7BjGa Domingo de 🚴🏼, no hay día libre.  #noexcuses https://t.co/oRaFZqnFbC Intentar, intentar. vamos que ya vendrá el gol . @realmadrid El éxito es la suma de pequeños esfuerzos, repetidos día tras día.  #motivation http://t.co/YeQyVmUtHF No hay mejor que esto, Gracias.  https://t.co/RT5LjcAf2F @nielsvaniperen recorrió Colombia con su P8 para mostrárnosla tal y como es #ColombiaDeNoche http://t.co/Rzdu9CMAPh http://t.co/O56NzP76gc Colombia es una en el día y otra en la noche. Conoce a #ColombiaDeNoche en  http://t.co/Rzdu9CMAPh http://t.co/DhmW5FcyAK Gol gol 😀 Vamos día a día. @SergioRamos http://t.co/KkD1d35gVT Ya quería verte. #dylan #bestfriend http://t.co/5XEPI0Wb4F ¡Feliz día! Amor y amistad sentimientos que lo hacen todo posible #makeitpossible #AmoryAmistad #love http://t.co/GZPRkCzaMB Juntos por siempre. #mylove http://t.co/PXy1Bwt9K1 Las noches se ven diferentes con mi P8 de @huaweimovilesCo http://t.co/jxL528gIMI Imágenes para recordar a mi #ColombiaDeNoche http://t.co/Rzdu9CMAPh http://t.co/H25KW48NYv Feliz día, 👍🏼 #happyday http://t.co/z0160rHRvC Día a día. #Fe http://t.co/we37uTQl5Z En mi mente solo está volver mas fuerte.                                              Coming back stronger! http://t.co/F5YB13NnuR Princesa😍👍🏼 #Mylove http://t.co/GvGKuFWzdv Selección Colombia. #NY #joy http://t.co/kWXlqIkfqM NY. 🇺🇸 http://t.co/FW5OsspUG9 Los mejores momentos contigo! http://t.co/ZI5bJmu1ep Gran noche ayer, great night yesterday. http://t.co/uUzoLPdrFQ 🔝 #HalaMadrid http://t.co/7LlqoCP3Qs Momentos especiales. 👋🏼 http://t.co/0K2rKx6jw9 Mejor que nunca ! Better than ever 💪 http://t.co/9fl6ru5sPq RT @MarceloM12: Mi Hermanito !!! ❤️ https://t.co/ZGDTiQEGoW http://t.co/LAcUIRxRUs La luz interior siempre ha sido más brillante en la oscuridad #BienvenidoP8 http://t.co/7PqOOHvzKM @HuaweiMovilesCo http://t.co/OM3PRAcrR5 Noche perfecta. http://t.co/pP98hygGfV @RodrigoGalvez81 Muchas gracias rodri, el mejor. http://t.co/90Z32LhKVP Que bacanas son mis raíces #ColombiaDeNoche http://t.co/JeIsQn0zEf on another occasion we will make a photo.👍🏼 https://t.co/iONhrO8qcR Mi princesa ya quería verte. My love ❤️ http://t.co/4XZylfiE8L Que buen tema de los parceros, mucho nivel. #DeliciaPiso21 @piso21music  https://t.co/eYUUNbwX6e Entrenando fuerte.  💪🏼 training hard. http://t.co/0M9xvkCzL2 RT @adidas: Your heroes are now your competition. Don’t just follow; go out and create your own game.\nhttps://t.co/kMA9ermV0S Día de descanso.  Day off. https://t.co/L2rrBrQ4xD Preparados! Ready! http://t.co/0ftHfoHCjl Buen partido, a seguir así. http://t.co/Gn4CnZT0Jk Múnich. 👍🏼😜 with my bros #HalaMadrid http://t.co/Dlqbiw96dl Madrid. http://t.co/T8MfBVYJqC China. @MarceloM12 @Cristiano @officialpepe http://t.co/Q9hLDm4a4g Hoy hace un año se cumplía un sueño, jugar en el mejor equipo del mundo.  #HalaMadridYNadaMas http://t.co/nX8jP2jrlH Amemos nuestro país, cuidemos nuestra tierra! Feliz Día de la Independencia para mi Colombia! http://t.co/oULhNdKRS1 Un nuevo año de oportunidades de la mano de Dios y siempre con su apoyo! #FelizCumpleJames http://t.co/oKSUrvsotB Un honor haber compartido vestuario con una leyenda del fútbol y del madridismo. Gracias por todo capitán. http://t.co/4EVbXhgcQF Houdoukyoku  #fujitv http://t.co/OlmZgveHr5 Divertido programa. #fujitv #toneruzu #kuwazugirai 楽しいプログラム 🇯🇵 http://t.co/XUPcWAawsj Feliz de estar en Tokio.                                    Very nice to be in Tokyo . 東京にあると幸せ http://t.co/lGDguXrrJL Hi Tokio, こんにちは東京. http://t.co/8rAAbJQPrb Buena cena, Great dinner, My guy @yg_trece 😜 https://t.co/UEWj0nHs58 RT @Yg_Trece: Great dinner with great friends! My guy @jamesdrodriguez ! https://t.co/fhqB1ipX3W Hollywood.  #LA #Nice 🇺🇸 http://t.co/u1626ZcBAw LA. @Dodgers #Dodgers https://t.co/2YALf5BVhW RT @EnvigadoFC: Nuestro crack @jamesdrodriguez visitó la cancha donde se formó como futbolista. \n\n#CanteraDeHéroes! http://t.co/OqzNrgAAeT Felicitaciones @dezzie225 por mostrarme cómo te animas a jugar. ¡Te pasaste! http://t.co/M0UZ0fEkk6  #PepsiChallenge I really couldn’t have done better myself. Congratulations @dezzie225 for showing me You Got Game. http://t.co/M0UZ0fEkk6 #PepsiChallenge Medellín. 🔝 https://t.co/rcs8NgEmaL Sólo hay una manera... Unidos!!! #VAMOSCOLOMBIA http://t.co/gowfarRktJ Loved playing with #ACE15 Got a special pair from @adidasfootball just for me.Only one in the world. #BeTheDifference http://t.co/yYvZypaOlX ¡Encantado con las #ACE15! Recibí unas especiales de @adidasCO sólo para mi. La única en el mundo. #MarcaLaDiferencia http://t.co/cEGgvsi6i9 Me pregunto si @serenawilliams sabe que no puede ganarme. ¿Y tú crees que puedes? ¿Te animas a jugar? #PepsiChallenge http://t.co/TjJGA8vglh I wonder if @serenawilliams knows she can’t beat me. Can you? You Got Game? #PepsiChallenge http://t.co/fz0KYs7omJ http://t.co/7hFEtqNYta #MarcaLaDiferencia @adidasfootball #BeTheDifference http://t.co/DsYee8Um92 La alegría es la fuerza que nos hace luchar por los sueños! http://t.co/Im0eIcV2I8 Si el video de @Mrs_Ossa  es una pista de lo que se viene…¡me encanta! Ella se anima a jugar. ¿Y tú? #PepsiChallenge http://t.co/xN6gTVVNPV If @Mrs_Ossa 's submission is a hint of what’s coming, I’m excited! She’s Got Game! Do you? #PepsiChallenge  http://t.co/xN6gTVVNPV Es momento de relajar un poco.                            time relax. https://t.co/CC9h5anzwp Ya somos 10 millones en instagram, gracias.   We are 10 Million, thanks for you support. https://t.co/pQCMBuLZ42 ¿Listo para un reto amistoso? Mira este video y muéstrame tu estilo. ¡Incluye #PepsiChallenge al compartir tu video! http://t.co/CTe2WiLNf6 Down for a little friendly competition? Check out the video, and show me what you got. #PepsiChallenge  http://t.co/Xqk6R1ZDW7 Confianza e ilusión para este nuevo reto! #ColombiaSomosTodos http://t.co/HUQ2z7Q1HJ You Got Game?  Watch this, then make yr own vid &amp; share it on yr social channels.  Must include #PepsiChallenge https://t.co/NXm8rXOsNM Simplemente orgulloso de mi país que nunca para de soñar en #ElPaísDeLosPosibles. ¡Únete! https://t.co/9eLICBw2bc Gracias por todo mister, en poco tiempo aprendí mucho de ti. http://t.co/2zVvymqsLo Gracias a todos por el apoyo en esta temporada. Thanks for your support this season! http://t.co/RFsgJ2hwsj Las cosas pueden ser más emocionantes ! dale clic https://t.co/NbnJEruJh8 Kick it up a notch with the latest #PepsiChallenge! Are you in? RT @realmadriden: Download Real Madrid App\nIOS: http://t.co/r4uMGA2KC9\nAndroid: http://t.co/d1oMHl6uZV\nWindows: http://t.co/kUVZXZvoJr\nhttp… RT @realmadrid: Descarga Real Madrid App\nIOS: http://t.co/D3zKPRvDm6\nAndroid: http://t.co/16gnFca1GB\nWindows: http://t.co/DS56Q3Vvzi\nhttps:… Feliz día, happy day.  👍🏻 https://t.co/hV9rvtOoYT noche mágica en el Bernabéu. Equipo y afición unidos. Vamos #HalaMadrid http://t.co/r8b2g7DHtY @Gatorade http://t.co/KQTU6UOT9h Sweat and hard work fuel my engine. See how @Gatorade fuels my journey. El trabajo duro y el sudor me motiva. Mira https://t.co/OqhT0o34LO Saber que mi país es #ElPaísDeLosPosibles me llena de orgullo, gracias por creer en mí @HuaweiMovilesCo Ganamos,Equipo unido. #HalaMadrid http://t.co/lnF29ULEM2 Feliz por el gol y lo mas importante ganar. Happy with my goal tonight, but three points are more importan! http://t.co/wphH4yOR5D Gran victoria en Vigo. Hasta el final vamos Real! Great win tonight in Vigo! Nothing will stop us! #HalaMadrid http://t.co/2PmPo1wv40 Ganar en equipo fue grandioso, el apoyo del Bernabéu fue increíble! #HalaMadrid http://t.co/5FnpMFb2uk Llegaron mis nuevos guayos #Primeknit, me encantan!\nMy new Primeknit boots have arrived, I love them! @adidasfootball http://t.co/gFlXrxCFRP A proud moment: signing my new contract with @adidasfootball. Now I’m ready for our next match! #UCL http://t.co/bazw9GBAIM Un momento de orgullo: firmar con @adidas_ES míralo aquí http://t.co/bazw9GBAIM Ahora estoy listo para el próximo partido! #HalaMadrid Gran victoria! A todos gracias por su apoyo! Great win! Thanks for the support! http://t.co/d4HAPwOVY2 No te pierdas el nuevo episodio especial sobre el @RealMadrid de Gamedayplus de @adidasCO ! #HalaMadrid #UCL https://t.co/7TRTTwK078 Don’t miss the @RealMadriden Special on @adidasfootball Gamedayplus. I can’t wait to play tomorrow #HalaMadrid #UCL  https://t.co/oU6wdACRzO Vamos. #HalaMadrid http://t.co/p9xu5Su7nU Tarde de tennis! Great afternoon playing tennis! http://t.co/hXJEQAVRuU Feliz por el gol y mas por la victoria ayer. Happy for the goal and even more for the win yesterday ! http://t.co/NrlVDmXSzK Muy agradecido con todos. Regresar y sentir su cariño fue fantástico! http://t.co/t3l6mgtuWE Gran partido de todo el equipo! Great match for the whole team ! http://t.co/90BPRnE4Ve Después de dos meses vuelvo con motivación y sueños por cumplir. http://t.co/vr6TKVMgKA Gran día con adidas. Had a great day with @adidasfootball HQ, finally got to vist! Been with the brand all my life! http://t.co/Qs22AiokK1 Hoy nuestra selección empieza el camino por otro sueño. Apoyando en la distancia. Vamos Colombia! http://t.co/KwK8sBZe4e Respondiéndole el cariño a todas las personas en cada parte del mundo. Thank you all for your love and support. http://t.co/4zUbrh41WG Cada vez más cerca, con mucha motivación. Each day I'm getting closer, super motivated! http://t.co/M0SJ941jAK Con mi equipo y mis compañeros siempre, vamos. \n\n¡HALA MADRID Y NADA MAS! http://t.co/LvNX3eDnXQ La puntería sigue intacta. 😜 http://t.co/6PTJfTSrmZ Entrenamiento, feliz semana. #alegría                              training, happy week. https://t.co/Kq3f2j14eX Check me out in a different light. Atrévete a mirarme bajo una luz diferente. #pepsichallenge @pepsi http://t.co/6QGNoVwb1F Seguimos, Cada día mejorando.                             improving every day. https://t.co/2XlCBUJcEy The new #PepsiChallenge is here. Jump in!  @Pepsi \nYa está aquí el nuevo #PepsiChallenge…¡No te lo pierdas!http://t.co/tFF93AsVXp Vamos. #halamadrid https://t.co/cvjoV2l5Ra Buenos días, entrenamiento. #alegría                good morning. training, happy day. http://t.co/DwLtgV6DTc Cada día entrenando con mas intensidad, progresivamente. https://t.co/faw3zlGWlj Feliz cumpleaños @realmadrid 113 años de historia y títulos, orgulloso de estar en el mejor club del… https://t.co/JFWhjnvE16 De menos a más, con muchas ganas día a día. http://t.co/FQKfO7LQf7 Tercera semana y las sensaciones son buenas,  Mas fuerte que nunca. https://t.co/VdG3uGYOtT Día a día mejorando. @SergioRamos #lukita http://t.co/lxy3Fls5uA El fútbol te deja amigos de siempre. giomoreno10 me alegra verte hermano. http://t.co/u9jUL97X7B Con mis hermanitos @cuadrado @d_ospina1 estamos juntos. http://t.co/KqKfDrNVaL Importante victoria.  #HalaMadrid Es un orgullo tenerla, un honor. Todos con la camiseta oficial de Colombia @adidasCO 2015! http://t.co/iqGMla70z6 @FALCAO Feliz cumple hermano. Que cumplas muchos más. Bendiciones, Abrazo de gol! http://t.co/60dZy53btf Vamos #HalaMadridYNadaMas Me recuperaré y volveré más fuerte que nunca. Sus mensajes son de gran apoyo! Gracias. http://t.co/OGtuZObvtc Mis nuevas #f50 están aquí! My new #f50 boots are here! #therewillbehaters http://t.co/LCrBh0LYX5 http://t.co/Tu8Q6NwOgt Ganar y además anotar siempre trae alegría! Winning and scoring goals always brings joy! http://t.co/UD7hCfoMET La visita del gran 10. Mi ídolo. Toda mi admiración para @PibeValderramaP http://t.co/QizZhQgwvw Equipo ideal de la Copa del Mundo. Gracias a todos! Dream team of the World Cup. Thank you all! http://t.co/IGXdHd8MWc Mis nuevas botas f50. My new boots f50 http://t.co/Z9qvxBY371 Dale play, se convertirá en oro. Press play right now, there will be gold #therewillbehaters https://t.co/4ig6Le3n4r http://t.co/9KBJsqa3tk También esta alegría es para mis compañeros de selección y todo un país que vibró en ese lindo momento! http://t.co/qxKdoRTOAu Felicidad al ganar el FIFA Puskas. Gracias a ustedes también. Happiness to win the FIFA Puskas award. Thanks! http://t.co/66CPytUzyg A continuar así. To continue well. http://t.co/HCmQCoqTX1 Gracias a Dios por el 2014. Que se venga el 2015. Thank god for 2014. Welcome 2015 full attitude and good wishes. http://t.co/SNJfktm3mf Gracias por sus deseos. Feliz Navidad en sus hogares / Thanks for your good wishes. A Happy Christmas to all at home! http://t.co/oPU8OyX4hX Solo alegría y felicidad a tu lado, Feliz domingo. http://t.co/Pf8ZkElrm4 Campeón del mundo. World Champion! http://t.co/A9grwOauWw Entrenando para la copa mundial de clubes FIFA. Próximo objetivo. Training for FIFA Club World Cup. Next target. http://t.co/SLwMlZzUyy RT @almacenesexito: Si un hombre 10 no mide sus esfuerzos en verse y sentirse seguro... ¡Lo está haciendo bien! #BronziniBlack http://t.co/… aquí http://t.co/cQo4h9Tz2h la recreación del gol elegido con @Rexona ganador  #Sudapasion. ¡Felicitaciones ALDAIR ! http://t.co/41clKrmLXL Feliz día, mucha alegría.                                         happy day,  lot of joy. http://t.co/2W8RarxL1V Gracias a todos en Colombia  por el reconocimiento \"Personaje del año\" El deporte es el medio de un futuro grandioso. http://t.co/rj7n57jxAS Hasta el final. #halamadrid http://t.co/saUydW2Kml Navidad  época de amor, paz y de compartir en familia. ⛄️ salomerodriguezospi @danielaysalome http://t.co/db29dZN73I Buen juego en el Bernabéu. Gracias a todos. A good game at the Bernabeu. Thanks to all. http://t.co/8KJfchZk0N Vamos por todo. http://t.co/xF7L7kA3we En equipo siempre.                                                In team always.  marcelotwelve… http://t.co/5O1YFJlPyH Recuerda que puedes ganarte una camiseta autografiada por mi #Sudapasion este es el link http://t.co/cnupzHkozt Lindo sábado, a seguir así. Beautiful Saturday! This is how we should keep on. http://t.co/kE0A1TteSl 2014 inolvidable para nuestra selección. Las ganas que tenemos nos llevará a cumplir grandes sueños. Gracias a todos. http://t.co/gX2FTupKl3 Hello Eslovenia. 👍\nYa estamos en Eslovenia. http://t.co/5xklsL6mlJ Un placer haber conocido a un fenómeno del tenis. @DjokerNole profunda admiración. http://t.co/u4IePYcAUq amazing, a legend. @rogerfederer http://t.co/aaR4ntyGai RT @DjokerNole: Goool! Got to meet @jamesdrodriguez and some of the guys from @FCFSeleccionCol. #FCFFutsal http://t.co/uUHVPBcbvQ Colombia es pasión.                                                Colombia It's passion. http://t.co/8WCEDPpnNh Simplemente orgulloso. Gran victoria,  siempre unidos. Just proud. Great victory. Always together. http://t.co/g3eAr6c8a1 Viernes de selección! Todos con la camiseta. http://t.co/o5c2wscxgC Alegría.                                                                    Joy. #unidosporunpaís http://t.co/RT9vkeoDmu GANATE UNA CAMISETA AUTOGRAFIADA POR MI.\nSólo debes participar en: http://t.co/sqkCjugZh7   #Sudapasion http://t.co/JCQCx9rTt8 Buenas noches. good night. http://t.co/DQ4nVGxjNF Y tú ¿Ya te enteraste de esta comunidad?  Entra en: http://t.co/PmHe1NR0cd http://t.co/8ohuoxwvWC Saludo al genial DJ @DavidGuetta y pronto una sorpresa para el. #GuettaEnColombia Noviembre 14 http://t.co/uAWLSHiarv Gran día y buen triunfo. Great day and good win! http://t.co/hRCfZLeg0G Feliz día. happy day http://t.co/wdqiZdMBAk Thank's china. 非常感謝 http://t.co/bFyeWB8aN1 Felicidad. Happiness. #HalaMadrid http://t.co/D4edvwGNjQ Buena victoria ayer en Champions. Great win yesterday in Champions! http://t.co/Vv5ivPIJLb Desde Colombia está llegando mucha gente para el partido entre ellos los ganadores de @milocolombia Bienvenidos todos http://t.co/cpvT0EzCwb Feliz Semana. Happy Week! http://t.co/vp99y4s0iX Gran victoria. Desde ya Pensando en la semana que viene. Great victory. Already thinking of the coming week. http://t.co/mb6sZxWr9L Entao Brasil. O que acham da foto ? marcelotwelve fera demais. http://t.co/raxrFNCdeS Pensando en lo que viene.               thinking about what's to come. http://t.co/EkeYsHwsXE Gol dedicado A mi selección y al profesor Pekerman. http://t.co/Sx8PEAntEX Y aquí estamos juntos. El momento de emoción, No se tiene noción cuando se hace un gol con la… http://t.co/m1aZBkwgqs Cuando Colombia juega es un día especial.                                 When Colombia plays… http://t.co/MDc0z5jvG5 Eres un persona increíble cristopher. Siempre con una sonrisa, demuestras felicidad, amor, alegría.… http://t.co/ZLZX4TBc0c Hoy juega Colombia, es un día feliz! http://t.co/vf6ejJHVub Good morning New York, buenos días nueva york. http://t.co/XmDLLUFUwn Excelente triunfo hoy. Great win tonight, Nice dance @12MarceloV @Cristiano 😂 http://t.co/AVvuxI7anc Después de una victoria importante de vuelta a Madrid.   After an important victory its time to go… http://t.co/PyOaf0EAGU Mañana tenemos un nuevo duelo, esta vez con la nueva indumentaria del @realmadrid #wearitorfearit #HalaMadrid http://t.co/gYwtJJ6z7S en Sofia para el partido de mañana.                                      In Sofia and all set for… http://t.co/eD5M0RJOw9 Nueva semana, nuevos guayos! Presento mis Yohji Yanamoto #f50  / A new week, new boots! Yohji Yanamoto @adidasCO http://t.co/ZgTfcx9kvE Buena victoria ayer, Nice win yesterday. #Halamadrid http://t.co/n58aZaK3kg Importante victoria que da mucha confianza para lo que viene, el trabajo continúa. #HalaMadrid http://t.co/xQYj0XU2ge Regresar a Champions League con victoria y gol. Gran alegría! http://t.co/cWhrcg5YAu @paulocoelho seria un placer. Solo admiración, Eres grande. Con la ilusión de siempre, emprendemos el camino a nuevos retos. Vamos Colombia. Como si fuera el primer día. Ilusión y sueños. http://t.co/TduBWYIDCy Presentación de la tercera camiseta del Equipo. @realmadrid http://t.co/b11asTGHWO RT @Nando_Rueda: @jamesdrodriguez Yo merezco ganar porque soy tu mayor admirador! Hasta me hice tus rayas en el pelo jaja. Hala Madrid http… Congratulations @nando_rueda, you have won my gold miadidas #f50 boots. @adidasfootball will send them to you! Felicidades @nando_rueda, ganaste mis guayos miadidas oro #f50. @adidasfootball te las enviará! Ya @AngelicAzulita ganó con @adidasfootball las botas doradas. Felicitaciones! En segundos mi ganador. RT @AngelicAzulita: Linduras, este fue el número de @jamesdrodriguez que me tatué (el tipo de números). Muy a lo @adidasfootball. http://t.… Primer gol. http://t.co/k6fg0JMtOe Que bueno empezar así. Con un título! UEFA Super Cup. #HalaMadrid http://t.co/8yDuriGcMZ Hoy UEFA Super Cup #HalaMadrid http://t.co/yEQVVdCCAu Mis guayos nuevos, miadidas oro #f50 Voy a entregar un par a mi mayor fan en Twitter, muéstrame por qué mereces ganar http://t.co/soPyL9ASBf My new boots, gold miadidas #f50! I will give a pair to my biggest fan on Twitter, show me why you deserve to win! http://t.co/2cuma2Jrje 6 goles en la @FIFAWorldCup. Un sueño hecho realidad. Gracias por todo su apoyo! #allin http://t.co/dbGJQOQiyq 6 goals in the @FIFAWorldCup. A dream come true. Thank-you for all your support! #allin http://t.co/c9rh4oFwHv Primer entrenamiento y mucha ilusión. http://t.co/fIvj4d7GUU @juanes muchas gracias, éxitos siempre. Antes de los retos diarios, un buen descanso. http://t.co/vjwevUYJ5P ¿Quieres conocer como participar por una camiseta autografiada? Haz clic acá para conocer más http://t.co/cHTKxKBN9g http://t.co/rrLc2lZuOI Merci @AS_Monaco d'avoir eu confiance, Je ne garderai que de bons souvenirs,ceux de personnes m'ayant aidé à grandir à tous les niveaux. Emotiva bienvenida. El sueño continúa #HalaMadrid http://t.co/bWdhqFkQPI @aarbeloa17  que buen saludo. Con deseos de encontrarme pronto contigo y con el grupo. Es un honor! Thank you @GarethBale11 Can’t wait to meet you and the team. #allin #HalaMadrid El sueño ya es REAL. Feliz de hacer parte del mejor club del mundo. #HalaMadrid @realmadrid Gracias a quienes votaron por el mejor gol del mundial. Fue un lindo gol, un lindo momento para nunca olvidar. Recuerdos que quedarán para siempre. http://t.co/hB4vpjYmKL Gracias a Dios. A todos ustedes por la fuerza que hicieron. Y a mis compañeros de selección que lo hicieron posible. http://t.co/pkoIjyBjjE Con el corazón en la mano, FE. Gracias por sus mensajes.                      Thank you for your messages.            Merci pour vos… http://t.co/LrcBlpTnVV Thank you all for the birthday wishes. All your messages make me very happy! #FelizCumpleJames Emoción y alegría al recibir esos buenos deseos y esa linda energía cuando me escriben #FelizCumpleJames GRACIAS. Milhares de mensagens do povo brasileiro, muito carinho em cada um deles. Obrigado Brasil. http://t.co/sIjHGwU7fQ Que lindo es el fútbol. Aveces es injusto pero de todas las formas se aprende. Que bien chiquito, Se lo que luchaste y tuviste paciencia para todo esto. Grande! Gracias a todos , me siento muy orgulloso de ser COLOMBIANO. http://t.co/yMr3Xq25Ul Lindo mensaje @KingJames Thank you for your support #JamesGang @DavidLuiz_4 obrigado craque, boa sorte. Sólo puedo decir GRACIAS COLOMBIA. http://t.co/ybknBhtSDr De la mano de Dios, FE. http://t.co/QLuhjqwG1j La alegría es de Colombia, la gloria es de Dios. http://t.co/J9h3zzJxW7 Un sentimiento, un país... Nuestro SUEÑO. Queremos seguir dando todo por este país. Cada día, paso a paso. http://t.co/DtVnHvuqTI Que se entere el mundo, hoy juega Colombia. Siempre de la mano de Dios. Un equipo, un país que se siente feliz. http://t.co/bz694U0A3Q Siempre con FE. Linda forma de empezar. El apoyo ha sido impresionante, gracias. http://t.co/BzzWqwtlqD Hoy es un día con el que soñé toda mi vida. Compartir la alegría. http://t.co/o32BkPSwyS Victoria que da confianza. http://t.co/xprYpP35Pn Buenas noches. http://t.co/0qjX8p8meA @NairoQuinCo @UranRigoberto @jarredondo32 @fabioaduarte @5_henao Gracias. Su profesionalismo y esfuerzo pone nuestra bandera en lo más alto! Hoy hace una año llegaste a nuestras vidas para llenarnos de alegría y felicidad  día tras día, feliz… http://t.co/vRIgWDRfjN Que final emocionante. “@JamesR_Fans: @jamesdrodriguez Feliz sábado para ti crack! que Dios te bendiga.” Feliz sábado para todos, gracias. “@OmarArias78: @jamesdrodriguez James mi hijo te pide un saludo y que ayer te espero hasta la 1:00am en el  dorado\" Saludos para tu hijo @carlosvaldes5 agarrame pues Carlitos 😂 http://t.co/ZVAUJLxBdz RT @Locampos15: Me hackearon esta cuenta., Siganme en @11lucasariel...\n Muchas gracias a todos mis seguidores los espero por allá http://t.… “@tutiotito: @jamesdrodriguez  las mejores energias  desde Somondoco Boyacá http://t.co/bqd4vDsGEE” gracias muy bacana “@Belkis__10: Humildad Ante Todo @jamesdrodriguez @danielaysalome http://t.co/074CHflxAo”bonita foto. Gracias RT @shakira: Messi! Fabregas! Abidal! Neymar! Rodríguez! Agüero! Falcao! Piqué! &amp; Shakira! Watch / Míralo http://t.co/dacmQVy6Fw ShakHQ #da… RT @WFP: Thanks @jamesdrodriguez for appearing in @Shakira's video in support of @WFP! http://t.co/4sb73RCs6p RT @JorgeSanabria11: https://t.co/ZXbTAt5Yaq Ya vieron el video de @shakira con @FALCAO y @jamesdrodriguez ? ESPECTACULAR Inseparables 👍 http://t.co/OTaLs7QHSV “@EAbidalOfficial: Felicidades @jamesdrodriguez, eres un grande, sigue así. http://t.co/7T9xsyREJu @AS_Monaco”gracias grande De nuevo en la selección. http://t.co/UoBGtcVIkG “@FansJamesR_SM: @jamesdrodriguez felíz domingo para ti, CRACK!”gracias por el apoyo, Buen día. “@AS_Monaco: Un nuevo orden está en marcha. Advertencia.  Aquí es  la primera equipación del @AS_Monaco . http://t.co/4i4IdLMGu7” muy buena Feliz domingo. “@Mugibarhi: Felicitations a @jamesdrodriguez meilleur passeur de la @Ligue1 Congrats, next year will be better” merci RT @danielaysalome: Mi primer peinado ! 🎀💆💅 que tal ? Feliz sábado lleno de bendiciones !  @jamesdrodriguez http://t.co/9gDoag3GeJ Muy feliz por banfield, vuelve al lugar donde de verdad tiene que estar. Felicitaciones. #BanfieldEsdePrimera Battle Pack de @adidasCO. Muchos para elegir #allin or nothing http://t.co/PNRMUa77BU @adidasfootball http://t.co/FQ9Y4rsC6s RT @AS_Monaco: La finalización de @jamesdrodriguez ! Cuatro tiros, cuatro goles y tres escuadras...! http://t.co/MV9hGlfUG6 ¡Feliz con mis nuevos Battle Pack #f50 @adidasCO ! #allin or nothing @adidasfootball http://t.co/N51bxUVeyb Gracias a todos los que se comunicaron y se conectaron estos minutos, fue muy agradable #LlegoElMomento Estamos hablando en vivo, Ingresen aquí http://t.co/aXzZ3w4MYs #LlegoElMomento Ahora mismo en vivo ingresando a  http://t.co/qSyMERaT7c podemos vernos en vivo. Sus preguntas en #LlegoElMomento http://t.co/cvTsfWZgtY Hola mañana en vivo desde Mónaco estaré con ustedes. Aquí toda la información http://t.co/t7S6rdY0SY envíen sus preguntas a #LlegoElMomento RT @AS_Monaco: Follow @AS_Monaco para jugar + RT este mensaje para intentar ganar el jersey de @jamesdrodriguez ! #TropheesUNFP http://t.co… Estar al lado de grandes jugadores es un logro importante, trofeo del 11 ideal de liga 1. http://t.co/525vzwxUNv RT @layvinkurzawa: Très heureux d'être dans l'équipe type de la ligue1 saison 2013/2014 avec @jamesdrodriguez ⚽️ Apreciadas madres un gran abrazo por esa importante labor, admiración por ustedes. Especialmente por @marjajua y @danielaysalome las amo. Más de 3 años conectados por Twitter Hoy somos 2 millones, sus mensajes son un estímulo. Gracias por tanto! http://t.co/nimjlUDeO3 Noche para compartir en familia! http://t.co/tFBbzK50R4 Muy feliz por mis dos nominaciones. Mejor jugador y revelación de la Ligue 1. Gracias a mi equipo… http://t.co/VBiJasmeMP RT @Davixito: @jamesdrodriguez nominado al mejor jugador de Francia y a la revelación de la #ligue1. Importante reconocimiento para #El10de… Un fenómeno del fútbol, como siempre muy gentil. @cristiano http://t.co/XXUnTo7rTA RT @RoustandKevin: Muchas gracias a mi amigo http://t.co/hREfAxIw7k Salgo del partido y me encuentro esta buena sorpresa https://t.co/mjVopFn7KD gracias @RivaPopMusic y @alkilados por el aliento. Me gustó :) Lindo día en Monaco. http://t.co/7vsECHYNvo Felicitaciones @EnvigadoFC por la clasificación a las finales, vamos naranja. @CanteraDeHeroes RT @fospina01: Mi mayor inspiración, eres mi ídolo desde muy chiquito siguiéndote! @jamesdrodriguez #El10 #PasiónPorEl10 http://t.co/F00qlK… Muy triste por la partida de Gabo. Su obra hizo gigante el nombre de Colombia. Condolencias a su familia. Hoy por Coupe de France EA Guingamp Vs @ASMFC_MONACO partido clave ( 21:00 Fr - 14:00 Col ) la mejor vibra y de la mano de Dios! Hoy S. Rennais Vs @ASMFC_MONACO (20:00 Fr - 13:00 Col) #ligue1 con la energía que todos me envían y de la mano de Dios Un saludo para todos,  Bendiciones. http://t.co/9Gk4lLVX92 Importante victoria, y doblete. http://t.co/ttTlIZBnEH RT @danielaysalome: Mi princesita y yo ! 👭 http://t.co/soMfSqU5NK Hoy @ASMFC_MONACO Vs FC Nantes (21:00 Fr - 14:00 Col) #Ligue1 de la mano de Dios ante cada reto, con alegría cada día. Hoy Evian Vs @ASMFC_MONACO #ligue1 (20:00 Fr - 14:00 Col) alegría siempre! #LlenemosDeHéroesaColombia una iniciativa de @EnvigadoFC atentos! http://t.co/bgo6iaqqe4 hoy @ASMFC_MONACO Vs RC Lens (20:55 Fr - 14:55 Col) Coupe de France RT @Daniel_Nilsen: Signed boots by @jamesdrodriguez!! Thank you @adidasfootball http://t.co/3RXccmpjFA Hoy @ASMFC_MONACO Vs LOSC LILLE  (21:00 Fr - 15:00 Col) De la mano de Dios siempre. RT @telefoot_TF1: VIDEO #telefoot - Le portrait de James @jamesdrodriguez @ASMFC_MONACO ▶ http://t.co/jn0V0GEPlH / Photo : http://t.co/VM7g… RT @danielaysalome: Mi familia lo mas hermoso de mi vida ! Gracias Dios por tus bendiciones . 😍🙏❤️ http://t.co/r9sfR8oKeR RT @JamesR_Fans: James Rodríguez en el álbum del mundial. http://t.co/XHhweIanmz Me gusta, \"cuando somos grandes en humildad estamos más cerca de lo grande\" Feliz día Gracias a Dios por permitirme celebrar el gol 50 en el exterior. http://t.co/i6l2dIyIXj Hoy O. Lyonnais Vs @ASMFC_MONACO (17:00 Fr - 11:00 Col) De la mano de Dios, con la Fe de siempre! Aujourd'hui Séance de dédicaces à la boutique officielle. Ce fut un moment très agreable avec les fans… http://t.co/j9CJBj8Uwz Un saludo muy especial para @FCFSeleccionCol por su primer año informando de manera oficial todo sobre las selecciones Colombia! RT @ASMFC_MONACO: James est prêt ! Coup d'envoi de la séance dédicaces à la boutique officielle... @jamesdrodriguez http://t.co/GBKCuWR7eH Haz de tu vida un sueño, y de tu sueño una realidad. http://t.co/Epf4Cbw9v5 Hoy @ASMFC_MONACO Vs FC Sochaux ( 20.00 Fr - 14.00 Col) alegría y buena vibra para este encuentro de la #Ligue1 Respeto por ellas. Un saludo de admiración a la mujer en su día internacional. Somos una familia, siempre unidos ante cualquier circunstancia. http://t.co/HtMGJeF2PQ Gracias a Dios por brindarme la inmensa alegría de representar a mi país una vez más.  #unidosporunpaís Que buena energía entre amigos. @fguarin13 pabloestifer @cuadrado http://t.co/eJHmsnUnVs He estado trabajando en un nuevo proyecto para todos los colombianos.  #LlegóElMomento http://t.co/nhFiwrjsnh http://t.co/1b4WRk8cFr Atencion! Quiero informar a todos que no apoyo a ningún candidato o partido político. De existir publicidad ha sido sin mi consentimiento. Feliz de estar nuevamente con la selección ! Orgullo inmenso. http://t.co/qf5KmSlBqx Hoy #Ligue1 S. Etienne Vs @ASMFC_MONACO (17:00 Fr - 11:00 Col) a la cancha con fe, siempre de la mano de Dios. RT @entrenacarlos: @jamesdrodriguez en Monaco http://t.co/Ps804Pd6u4 “@Juancho_Style: Dale play a #desdequetevi http://t.co/ZRy88MHTWv ZOUK and REGGAE , sentimiento y puro caribe\" juancho muy bueno el tema. Hoy @ASMFC_MONACO Vs S. de Reims #ligue1 (20:30 Fr - 14:30 Col) a los sueños, nunca hay que renunciar! Hoy! S.C Bastia Vs @ASMFC_MONACO (17:00 Fr - 11:00 Col) ánimo y buena energía para este partido de la #Ligue1 No es grande aquel que nunca falla si no el que nunca se da por vencido.\nFeliz semana!! Feliz cumple @falcao de parte de todos, que cumplas muchísimos mas amigo.  @danielaysalome… http://t.co/Yf2nAtdB5R @ASMFC_MONACO Vs PSG Hoy #Ligue1 (21:00 Fr - 15:00 Col) De la mano de DIOS y con mucha FE para este importante partido. Feliz domingo. 20 ans, ça se fete. joyeux anniversaire aux Ultras Monaco 94 !@ULTRASMONACO94 Disfruto mucho de hablar con ustedes feliz noche! @FansJamesR_Bta gracias @FansJamesR_Col gracias por el apoyo. @95Wanda gracias. Linda foto @TipsFutbol si cierto. Saludos @JESSBONETT_O1 gracias jessica, un abrazo @bbcitalj 😜gracias @elisjohanamadri saludos a la gente de sincelejo. Abrazo @Wilshere1994 merci. @Tanya_CastroEsp gracias. Te respondí. Abrazo @AlbaCruz10 gracias. Que linda  camiseta @yuliethcaroli11 son muchos mensajes, pero te mando un saludo. @Stevhens10 gracias amigo @DianaCarolineP un abrazo diana. Gracias @daniloroa11 bendiciones amigo @JuanCelia que lindo barranquilla la casa de la sele. Saludos @AdrianHinojos30 gracias un saludo @danielaysalome jajajaj estas a lado mio loca @laurasuaza15 gracias bendiciones “@Camilejo: @jamesdrodriguez Saludos desde Arauca - Colombia #SosunCrack” gracias un abrazo @lilisoprano tienes razon. Saludos “@AlejoVelez92: @jamesdrodriguez saludos desde Pereira, crack!  Suerte este domingo” un abrazo y saludos a la gente de pereira @Tatan99 gracias @raquelbarros103 muito obrigado. Bjs @EstefaniaEtr manizales hermosa ciudad. Gran abrazo @JeankOswzMznet Santa Marta, buenas vacaciones pase ahi. Un abrazo @PaoTafur que lindo cali, saludos @ForeroJeisson con la ayuda de Dios. @sant_94 un saludo, abrazo @HeribertoPerezH gracias Leyendolos Buenos días, un abrazo para todos y mucha alegría siempre. Hoy FC Lorient Vs @ASMFC_MONACO Victoria para vos amigo. @falcao estamos contigo. http://t.co/mKnNxOceDH @ASMFC_MONACO Vs O. Marseille (21:00 Fr -  15:00 Col) De la mano de Dios y con mucha ilusión para este importante partido. fuerza y fe hermano. Te necesitamos, el fútbol necesita de vos. http://t.co/1bk1bpDhP1 RT @danielaysalome: Que felicidad sentimos poderlos ayudar ! 😍 gracias amor @jamesdrodriguez por tu apoyo  para este tipo… http://t.co/U4K9… Con la mejor vibra para hoy en el Toulouse FC VS @ASMFC_MONACO (17:00 Fr - 11:00 Col) Siempre de la mano de Dios. RT @ASMFC_MONACO: El mejor pasador de la @Ligue1, @jamesdrodriguez, le desea un Feliz Año Nuevo ! #ASMonacoFC2014 http://t.co/0UwX41WVyj Cena con amigos @fguarin13 @falcao _may_76  #ivan. Hoy de cumpleaños un ejemplo de jugador y mas de… http://t.co/fnKIeuGu4C Saudades destes jogos, um dia que marcou a minha vida e a de todos os Portistas! Sao só mais 90… http://t.co/Sf5li2KlUf Hoy Montpellier Vs @ASMFC_MONACO (20:30 Fr - 14:30 Col) de nuevo por la #ligue1 con toda. Cuando expresas alegría todo funciona mejor! http://t.co/AlqshspCmT Hoy por la de Copa Francia. Vannes vs @ASMFC_MONACO 17:00 (Fr)  11:00hrs(Col)  con mucha fe y confianza para comenzar el año bien. Sin duda lo mas hermoso que me dejo el 2013. http://t.co/otc93311T6 Gracias a todos por el incondicional apoyo del 2013. Que sus hogares reciban muchas bendiciones para el nuevo año! Los mejores momentos es a tu lado hija hermosa. http://t.co/TSXsZ6OzQ0 La familia es lo mas lindo. @danielaysalome @marjajua juanavr98 salomerodriguezospi http://t.co/PKP3iiO1NL RT @ASMFC_MONACO: #ASMVAFC @jamesdrodriguez RT pour gagner son maillot collector dédicacé - para ganar su camiseta collector dedicada http:… Hoy @ASMFC_MONACO Vs Valenciennes ( 20:30 Fr - 14:30 Col ) linda oportunidad para seguir ganando. #Diosalmando RT @danielaysalome: Feliz viernes para todos lleno de inmensas bendiciones ! salomerodriguezospi @jamesdrodriguez http://t.co/Hrbd0xA47F RT “@ASMFC_MONACO: @ASMFC_MONACO será el primer club de @Ligue1 con su Twitter encima de su camiseta! http://t.co/AEzevBxka4” Con mi amigo @falcao en la fiesta de Navidad del club. http://t.co/s0HH2mu4ES d_ospina1 fabinhotavares93 http://t.co/5oZPScKBdQ Hoy visitantes, EA Guingamp Vs @ASMFC_MONACO , (20:00 Fr - 14:00 Col) confianza en Dios y buena energía en cada paso. “@TiagoPiche: @jamesdrodriguez Gracias por todo ídolo, siempre vas a estar en los corazones de la gente de #Banfield”gracias @entrenacarlos feliz cumple grande! Pásala bien. Abrazo RT @chino_cab: @jamesdrodriguez Como olvidar tu golazo a Newell's, y a Rosario! Gracias por esta alegría. En Banfield sos ídolo, crack. RT @PolaaBanfield: @jamesdrodriguez. Gracias  crack todavia tengo grabado tu gol vs Newells de afuera del area, grcias x tu humildad. Banfi… RT @NikoCab18: #BanfieldCampeon a 4 años de la gloria gracias @jamesdrodriguez joyita del campeon, rompela en todos lados que vamos a estar… RT @nicozuvi: @jamesdrodriguez gracias crack por darnos una alegria tan inmensa al pueblo banfileño #Campeon2009 “@dani3palacios: Señor crack @jamesdrodriguez toca hablarnos en @CarteLdeLaMega saludos desde Colombia y mas éxitos!”gracias,ok saludos RT @solrossi: LOS QUIERO DE NUEVO EN EL PLANTEL A @jamesdrodriguez y a ERVITI JUNTOS!! #4Años &lt;3 http://t.co/1iNwXIgz7P RT @carlosuzquiza: Gracias @jamesdrodriguez por la Gloria http://t.co/mkAiTZ7cwx #13-12-2009 #Banfield RT @FedeNobile: Gracias @jamesdrodriguez por haber formado parte de #BanfieldCampeon. ¡Nunca te vamos a olvidar IDOLO!  ✮13/12/2009✮ http:/… Merecidos finalistas, Cali y Atl Nacional mano a mano por la primera final del fútbol colombiano. Los mejores deseos a hinchas y jugadores. @ASMFC_MONACO Vs AC Ajaccio (21:00 Fr - 15:00 Col) #Ligue1 todos invitados con la mejor energía para hoy,Dios al mando de todo. Buen grupo, rivales exigentes. Con trabajo, respeto y humildad lucharemos por un sueño! Una victoria mas y con gol! Gracias a Dios. http://t.co/9Ysj8quJZT Hoy por la Ligue1 OGC Nice Vs @ASMFC_MONACO (21:00 Fr - 15:00 Col) de la mano de Dios. De nuevo al gol, gracias DIOS. http://t.co/7CNox3AL8J Hoy @ASMFC_MONACO Vs Rennais FC   ( 17:00 Fr - 11:00 Col ) día a día de la mano de Dios. Mi amigo Dorlan Pabón tiene una nueva cuenta de Twitter @08dorlan síganlo esa la única la oficial. RT @Davixito: @jamesdrodriguez 211 partidos como profesional a hoy, más de 50 goles, 10 veces campeón... 22 años haz hecho mucho http://t.c… RT @danielaysalome: Gracias Dios por mi familia ! 🙏 http://t.co/BTRkePdwSI Buen día, hoy Nantes Vs @ASMFC_MONACO (21:00 Fr - 15:00 Col) su apoyo un aliciente a nuestro trabajo. @JamesR_Fans no me olvido, muchas gracias por el apoyo, es importante para mi!  Saludos. Feliz cumple tio y muchísimos años mas de vida! @AMRG_21 Luchado y aguerrido partido. http://t.co/TmFYlDBBmc “@kinerendon: @jamesdrodriguez mostrando su aprecio por @kinerendon http://t.co/BQLxYWpm9s” que grande RT @medicoulloa: @MetCMD @CMD_MET  @entrenacarlos presentes con @jamesdrodriguez http://t.co/F2TFutlu0t Con corazón y orgullo por Colombia, un nuevo reto. #UnidosPorUnPaís RT @santiagoarias13: Estadio Amsterdam Arena, con mis amigos @jamesdrodriguez y Steffan Medina, seguimos unidos por un gran país Colombia h… RT @gabywainer: Con @jamesdrodriguez antes del entrenamiento en el Amsterdam Arena. Magia y fantasía en una foto !!! http://t.co/wat04pffGX Siempre unidos, alegría! http://t.co/M5Ugi5BYXh Un país apoyando la selección, una familia de jugadores representado la patria. Familia unida. http://t.co/YQtxBez37e Asustamos a Miñia  @cuadrado @luisfmuriel09 jajajja @armero7 tranquilo no paso nada jajajaja http://t.co/wwFTTvA4nn Nueva pinta. http://t.co/YDwgfV3fIP Un sentimiento único. http://t.co/vYKMhta5VN Hoy por la Ligue1 @ASMFC_MONACO Vs Evian TG (20:30 Fr - 14:30 Col) con toda la actitud. La pasión de mi país en la nueva camiseta de la Selección. Encuéntrala en http://t.co/6UtkpWmwiX #UnidosPorUnPais Nuestra nueva camiseta ya esta aquí. http://t.co/M5hc39c4DY Si no sueñas, nunca encontrarás lo que hay más allá de tus sueños. Feliz Semana. Contra nosotros nunca es falta! http://t.co/IaUN0k7Rxi Hoy Lille Vs @ASMFC_MONACO (Fr 21 hrs - Col 15 hrs) con la compañía de ustedes y de la mano de Dios. RT @gomezjuans: @fabryy_tala @jamesdrodriguez Ese taladro era imparable!. Entre erviti, el tanque silva, papelito fernandez y James, bailab… RT @fabryy_tala: @jamesdrodriguez gracias james x acordarte siempre de banfield....a ver si se m cumple el sueño d volver a verte cn estos … RT @tato_taladro: @jamesdrodriguez @Daricvitaok 2 animales! Orgulloso de que hayan vestido mis colores! RT @eltaladro1978: @Daricvitaok @jamesdrodriguez dos grosos que a los hinchas de #banfield nos marcaron “@Daricvitaok: Les dejo una foto con james p los hinchas d banfield.... http://t.co/dlZunJJOxT”  para los hinchas de banfield. Contento por la victoria de hoy. http://t.co/p8MXe9ouwu Invitados a ver hoy @ASMFC_MONACO Vs O. Lyon (17:00 Fr - 11:00 Col) Importante reto por la Ligue 1. Con voluntad y pasión las cosas salen como las soñamos. http://t.co/L62AWhZor2 Felicidad por lo alcanzado y compromiso por lo que viene, El sueño continúa. http://t.co/3qgsi44Ab5 Continuamos el camino con nuevas metas. Hoy a ponernos la camiseta con alegría y pasión, DIOS al mando de todo. RT @danielaysalome: Mañana día de labor social de parte de @jamesdrodriguez #Salome y @col_somostodos Compartir hace feliz nuestro hogar ht… Colombia te mereces esta y mil sonrisas más, Vamos al mundial. Gracias a quienes con fe y corazón nos acompañaron en cada instante de este lindo sueño! Hoy es un lindo día para hacer los sueños realidad. De la mano de DIOS. Siempre unidos. http://t.co/TFfNeBt9Zl RT @juanferquinte10: Con los dos crack's @abadiaAMARAL y @jamesdrodriguez http://t.co/NZlf2R2QHV Llegamos a casa. @fguarin13 @falcao #mario #david http://t.co/ckWeShF4bH Ahora para la selección con orgullo y alegría, el sueño esta cerca! http://t.co/Yb1JAaklhM Hoy todos invitados @ASMFC_MONACO  Vs S. Etienne (10 hr. Col - 17 hr. Fr) a la cancha con fe. Empezamos hoy, 24 horas CERO violencia unámonos porque #TodaBalaEsPerdida @ELTIEMPO http://t.co/Ee3FXsMciB Buenos días para todos, con mucho cariño y respeto les quiero dejar este mensaje http://t.co/KWJuCUZ71e con todo mi corazón de hincha! El fútbol es alegría y debemos cuidarlo entre todos. Es una pasión que no resiste agresiones ni violentos con disfraz de hinchas. AS Monaco Vs Bastia hoy (14hr Col - 21hr Fr) de la mano de Dios. Nada ni nadie me va quitar la alegría, vamos para adelante de la mano de DIOS! http://t.co/SdXQPiGDwl Hoy PSG Vs AS MONACO desde París (14hr Col - 21hr Fr) siempre conectados con su importante apoyo! Para Colombia un feliz día del amor y la amistad. Que la unión y el cariño siempre nos acompañe. Un fuerte abrazo! Mañana muy temprano AS MONACO-LORIENT 14:00(fra) 7:00(col) Feliz noche! El tiempo de Dios es perfecto y el camino que recorremos es el adecuado, El sueño esta mas cerca que nunca. Corazón y sueños. Eso tenemos para hoy! Que DIOS nos bendiga. #ColombiaSomosTodos para Uruguay, DIOS al mando de todo.  @oficialcuadrado @camilozuniga18 @sanchezcarlosa http://t.co/U5YbwgKmIu La alegría del país nos llena el corazón. http://t.co/WsippIzTaJ DIOS guíe nuestro camino. #colombiasomostodos #unidosporunpaís Siempre unidos. http://t.co/zWsQ4obuKt Mi amigo de habitación @fguarin13 http://t.co/0phAFFxcOK RT @fabioandresz: @jamesdrodriguez con sus nuevos #springblade  #explosiveenergy  @adidasCO @adidaslatam @adidasrunning #adidas http://t.co… RT @fabioandresz: Mi parcero @jamesdrodriguez con sus nuevos #SPRINGBLADE! El 1ero en tenerlos! Abrazo !!  #explosiveenergy http://t.co/o1R… Pa COLOMBIA jajajajja juanfer22 @falcao #david #chacha http://t.co/7M4qDSs4mI Ahora pensar en la  selección! Vamos con toda la fe y alegría, DIOS al mando de todo. http://t.co/OasxFfEZ6T La energía se siente, la buena vibra llega. Hoy O. Marseille Vs @ASMFC_MONACO (21h Fr - 14h Col) gran reto! Mucha magia al lado mío @joaomoutinho #deco #carvalho http://t.co/nyYWwTM1LO RT @danielaysalome: Hoy hace tres meses empece a escribir la historia mas linda de mi vida SALOME hijita te amo.DIOS TE BENDIGA SIEMPRE htt… Las tardes en Monaco son fantásticas. http://t.co/XOPpZzMqBt bienvenido a Twitter arrozito frito @Armero7 alegría macarena jajajaja abrazo. Me llenas de felicidad. http://t.co/wdrdZeM2wB Jamas te rindas ni retrocedas ante nada ni ante nadie. http://t.co/oqDN9BHueo disfrutando de un lindo espectáculo en monaco. http://t.co/k9Dtpk1D3v RT @danielaysalome: Mi vida entera !! Entrando en la onda del twitter . http://t.co/H1WhB0JLGC Ver la bandera de Colombia en la cima es nuestro reto como deportistas. Gracias Catherine por esta alegría! Gran triunfo, seguimos sumando cosas buenas! http://t.co/TO1OZqNYyt El honor y el orgullo de representar a mi país en las canchas del mundo es una bendición. #unidosporunpaís http://t.co/IhFWCOlgd1 RT @camilozuniga18: Qué buen reencuentro con los parceros de la Selección. Un grupo unido con un sueño claro. http://t.co/gzksYH6BDB Aquí es solo Alegría @luisfmuriel09 @lspiwi @fguarin13 @oficialcuadrado pabloestifer #zuiñiga… http://t.co/EAItszjN1X Rumbo a Barcelona, alegría de selección! http://t.co/21GyGJjLJ4 Importante inicio en la #Ligue1. Ahora a vivir la linda sensación de ponerse la amarilla de Colombia. http://t.co/4q1Z7J5pWE Hoy comienza la #ligue1 Bordeaux- As Monaco 21:00fra 14:00col DIOS al mando de todo. http://t.co/nGAtPEnIC8 Ya viene la #Ligue1 http://t.co/4tN7FK2689 disfrutando el día libre. joaomoutinho8 #carvalho http://t.co/P67rXVKzeE @ASMFC_MONACO Vs Tottenham para cerrar pretemporada e iniciar una linda temporada. 18:30h Fr - 11:30 Col. Feliz Sábado Mi vida http://t.co/4EdocOcDRo Una penosa pérdida para el fútbol. Dios alivie el dolor de la familia de Christian Benítez y los hermanos Ecuatorianos.  Q.E.P.D Desde qué tengo noción siempre me gusto tenerla entre mis brazos,tratarla bien y acariciarla! ella es… http://t.co/2vUs0S5yfy Nairo Quintana, sobran las palabras Gracias!! #orgullosamentecolombiano Bem vindo ao twitter a um grande jogador @JoaoMoutinho bienvenido al twitter a un excelente jugador! síganlo. La bandera de mi país siempre en mi corazón. Me siento orgulloso de ser colombiano. http://t.co/3StEpBbhPZ “Uso la humildad como un escudo”  dice nairo Quintana ! eso es lo que te hace grande! orgullo colombiano. Acabo de publicar una foto http://t.co/Ksw0KhZGd6 atlético nacional campeón, felicitaciones a su gran hinchada. Hoy es la gran final del fútbol colombiano, les deseo éxitos a los dos equipos. Que gane el mejor!!  #FutbolEnPaz #LaFinal no te olvides de mi ley, y guarda en tu corazón mis mandamientos; http://t.co/tpI8mIwqJe El fútbol es diversión. http://t.co/KE0AwCi9dy con mi amigo @falcao después de una jornada intensa de entrenamientos! Vamos bien. http://t.co/AmbAy56WUD Muchas gracias! http://t.co/zD9JwJWdVR Sus mensajes han sido el mejor regalo los estoy viendo por #FelizCumpleJames Muchísimas Gracias Un año más de vida dándole gracias a DIOS por tanto! Gracias por ese #FelizCumpleJames RT @ASMFC_MONACO: Bienvenido a nuestro Nº 10 @jamesdrodriguez http://t.co/FmgQPG8hai Sueños por cumplir! http://t.co/TwIQAtD7vz Se acabaron las vacaciones, ahora Rumbo a Monaco lleno de ilusión y muchos sueños por cumplir! DIOS al mando de todo. Pasándola bien! de eso se trata http://t.co/UftFT39iDK @GIOVATORO @Juangcuadrado @CRISS_COL @YOSOYRONNY tenemos que hacer otro pique jajajajaj saludos RT @REYKON_: Repost @jamesdrodriguez la buena parcero!! http://t.co/Cq2m0dqf7d que sorpresa me tenían, cumple adelantado! a disfrutar. http://t.co/HoWfzROf59 vamos con toda, #alegría http://t.co/j7E3npz1e4 RT @ASMFC_MONACO: @FALCAO @jamesdrodriguez #JoaoMoutihno... Premier rendez-vous dans quelques jours... http://t.co/fWkMLLrm9Z no importa,cualquier puede fallar! Gracias @juanferquinte10 @sperez_24 @cristianboni1 y a todo el equipo por dejarlo todo por un país. golazo! FE, la fuerza de todo un país. vamos!!!!!!! Vamos que ahí es, FE muchachos Como colombiano deseo que santa fe gane y pase a la final. éxitos! RT @JUANPABLOANGEL: Aca les dejo esta foto ,a pic with @jamesdrodriguez #classact http://t.co/LE729hXhzT RT @susoelpaspi: Hoy en @TheSusosShow el 10 de la selección @jamesdrodriguez y el monólogo sobre viajes en crucero y a Cabasllo. 8pm x @Tel… nunca dejes de soñar. nada mejor que esto. http://t.co/yUR9xVrtxB campeón miami heat, lebron james es una fiera! 39 segundos puede pasar cualquier cosa! le voy al Miami heat. RT @susoelpaspi: Muy pronto en @TheSusosShow estará de invitado el calidoso @jamesdrodriguez Miami heat, increíble!! Mi primer día del padre. http://t.co/218llgWUW9 #amigos #familia http://t.co/ULjNT2UvRK All in por el mundial, estamos cerca! http://t.co/srczZeNKQv Lindo juego de mis compañeros que nos deja muy cerca de la meta. Somos un gran equipo, un gran país. Amor de patria, Un sentimiento que a todos nos mueve. #Unidosporunpaís Amistad, unión. http://t.co/qO2QgnFenI RT @ASMFC_MONACO: @jamesdrodriguez #JoaoMoutinho #RicardoCarvalho @FALCAO joueurs de / players of / jugadores de @ASMFC_MONACO ! http://t.c… Rumbo a buenos aires llenos de ilusión. http://t.co/rcGA0ATYrA RT @FALCAO: Quiero compartir con todos oficialmente mi vinculación al @ASMFC_MONACO Nuevas metas, nuevos retos! Sé q van a estar ahi para a… Bienvenido al Twitter a un gran arquero y excelente persona todos a seguir a  @D_Ospina1 http://t.co/3vTXSspxBl RT @FarydMondragon: Felicitaciones y muchas Bendiciones para @jamesdrodriguez y su esposa Daniela por el nacimiento de su Bebe #nacioSalome Gracias por los mensajes, es un día muy especial para mi y toda la familia. Hoy en Medellín acaba de nacer mi hija Salomé, todo salió muy bien! estoy muy feliz con esta  bendición. Ambiente de alegría! http://t.co/jKJnUjKxa9 La alegría se comparte. http://t.co/Te449zCmec La #subastachampions por la @fundacionjuanfe sigue adelante. El fútbol nos une por un bien social http://t.co/2mJuHUnwCT Ahora un nuevo reto que me llena de ilusión con @ASMFC_MONACO acompañado del apoyo incondicional de ustedes. Gracias a todos. A la adeptos nunca voy esqueçer o carinho que me Derem, para sempre no meu coraçao! Obrigado por tudo. http://t.co/YSDTO1UHQr Obrigado FCporto pela oportunidade de jogar num club enorme e ganhar muitos titulos,(cont) somos porto http://t.co/MmFmqJHyZz Tricampeones! http://t.co/lGJEmIw13m Unidos lo logramos. http://t.co/sTKnnIhDmL El día anhelado llegó. Paços de Ferreira Vs FC Porto (18:30 Pt - 12:30 Col) Todos unidos por la misma meta. Vamos! Me gustan las nuevas F50 http://t.co/YaxHYbyIdW RT @zamorandres: @jamesdrodriguez Un gran corazon lleno humildad. Grande Campeon!!! @TONKAfilmmakers RT @dazaco: Eterna gratitud a @MARJAJUA y @jamesdrodriguez por sus atenciones con los niños en Porto. Un Dios les pague http://t.co/RbPRwEL… Mamá: la palabra más bella pronunciada por el ser humano! \nfeliz día a todas las madres. grande vitoria e a equipa sempre unida, os adeptos estiveram fantasticos! Obrigado pelo apoio. día especial FCporto-Benfica 20:30pt 14:30col a disfrutar de este lindo partido. #somosporto que lindo es ver la sonrisa en cada uno de ellos, la alegría es única! http://t.co/nX1bzauRjU De vuelta a porto, triunfo importante, aqui con cha cha y atrás @andrecastro88 http://t.co/XJhtcgdz48 Hoy CDNacional-FCporto 20:30pt 14:30col a disfrutar y hacer las cosas bien! #somosporto a madeira. http://t.co/4iAGyKbVF8 momentos http://t.co/mnxmsPbHGE Se viene un gran partido, cual es su favorito. Remontará el Madrid? Esa la clave, para ser grandes..... http://t.co/CZpDSdI2Hf Siempre unidos! http://t.co/D1GV8lPyub Hoy FC Porto Vs V. Setúbal (20:30 Pt - 14:30 Col) energía positiva! http://t.co/mAJQ6q2ZHq Entrenamiento http://t.co/0Hv591iU8s No te canses de intentarlo y convertirás lo imposible en una realidad. Feliz semana! hoy Moreirense- Fcporto 20:30pt 14:30col #ForçaPorto  feliz fin de semana! http://t.co/FRgQDzmbFO Las cosas del fútbol, ahora a levantar el ánimo aún tenemos que luchar por la Liga! Siempre daremos todo. Hoy FC Porto Vs SC Braga (19:45 Pt - 13:45Col ) Final Taça Da Liga. Un lindo día! Victoria importante y gran trabajo en equipo, aquí con el goleador de la noche @kelviiin93 http://t.co/wuCalKFftU Hoy FC Porto VS SC Braga (20:00 Pt - 14:00 Col) lindo partido. #ForçaPorto esperando por ti. http://t.co/TJjyh6qcyW Ahora de regreso a porto. El sueño continua lo intentamos hasta el final, gracias por el apoyo! #UnidosPorUnPaís De nuevo todo el país unido con  fe y alegría! #ColombiasomosTodos   #UnidosPorUnPaís con mis amigos @fguarin13 @FALCAO @juanferquinte10 siempre con alegría! http://t.co/ThieqavVaO Después de un esfuerzo grande, un poco de hielo para recuperar energías! http://t.co/N1XcAFuBFK Día especial, Vamos por un sueño! #UnidosPorUnPaís siempre juntos! http://t.co/iFBSF5wmzu la alegría se comparte! @juanferquinte10 @fguarin13 http://t.co/X323C14cex Ya desde la casa de la selección. Hay ambiente de fútbol #ColombiaSomosTodos #UnidosPorUnPaís Por la Liga HOY. Marítimo Vs FC Porto (18:00Pt - 13:00Col) un lindo lugar, Madeira. Feliz domingo! http://t.co/I4g7fqjr5n Una nueva convocatoria que me llena de mucha alegría y esperanza, La amarilla siempre en el corazón. Hoy Champions , Málaga Vs FC Porto (19:45 Pt - 14:45 Col) Gran reto, el apoyo se siente! También quiero aportar a @TeletonColombia estas dos camisetas . Aun hay tiempo para ayudar en http://t.co/AQ6WgzqGnY http://t.co/pAzN4Iy9nf @TeletonColombia nos necesita. Hagamos los aportes en http://t.co/AQ6WgzqGnY #ColombiaSomosTodos y hay que demostrarlo Hoy por la Liga. FC Porto Vs Estoril (20:00 Pt - 15:00Col) vamos con toda la energía. RT @Fernando_Reges: Revista dragoes com meus parceiros @4Maicon @daaniloluiz  @jamesdrodriguez #Alex_sandro    http://t.co/K3A6P1Tkk4 Todos tus sueños se pueden convertir en realidad,mientras tengas el coraje para perseguirlos. Feliz semana! Hoy en Lisboa Clásico - Sporting Vs FC Porto (19:45PT - 14:45Col) la buena energía siempre! @DocLizAriza @jasonlizarazo gracias, abrazo grande! Feliz cumpleaños @JorgitoPineda02 que cumplas muchísimos más. 30 años, estas joven todavía. “@rogergzz: @jamesdrodriguez ese es colega de negocios tuyo hermano!! Abrazo” abrazo papa RT @LIDIFFAA: @jamesdrodriguez corre por nuestros héroes #heroes10k danos un RT y patrocina un héroe @corpomatamoros http://t.co/4W7uzhurTR gran victoria ante un rival difícil, vamos muy bien! http://t.co/GRaqfJcr1T Hoy por la Liga, FC Porto Vs Río Ave ( 20:15 Pt - 15:15 Col ) buena vibra, vamos bien! “@ChoferForero: @jamesdrodriguez  regálame una respuesta genio... Haciéndole fuerza a Porto y Arsenal esta champions” porto o nada jajaja “@Maicol1394: @jamesdrodriguez Si no es mucha molestia respondemeeee porrrfaaa.... Seria un orgullo!” Molestia porque? Abrazo maicol “@PedritoFacio: @jamesdrodriguez Seria un placer que vuelvas a Banfield, siempre seras bienvenido james!” Gracias “@GordilloLuis10: Respondemeeee @jamesdrodriguez para que me de un infarto jajaja, eres el mejor de todos” saludos luis. “@ElTanque56: Seria Un Honor recibir hoy en Mi Cumpleaños una felicitacion del Idolo @jamesdrodriguez Dios Te Bendiga calidad!!” Felizcumple RT @FCPORTO_1893: Muchas bendiciones @jamesdrodriguez, dios y la virgen estén con toda tu familia. Siempre recibe los mejores deseos de  ... “@Kevinmejia2326: @jamesdrodriguez Crack! Q humildad tienes! Saludes desde Bquilla..” Muchas gracias, abrazo “@ValeriiaGomezL: @jamesdrodriguez Idolo Ers Grande Un Saludoo desde la Punta de Colombiaa La Guajira 😄” saludos “@LiaMartinez__: Hola, @jamesdrodriguez eres el mejor, Dios te bendiga, aca en colombia estamos orgullosos de ti.” Gracias “@Gabrielvski7: @jamesdrodriguez Saludos desde Brazil!” Abraçao RT @CesarBarrios88: @jamesdrodriguez RT por fa acá en Barranquilla se te quiere como un hijo más, sigue así que #VamospaBrasil2014 RT @JeissonPulgarin: @jamesdrodriguez Mi total admiración para vos James, que gran futbolista, felicidades por dejar en alto el nombre d ... “@JCRC5691: @jamesdrodriguez Hola calidoso me toco entrar en la nueva moda del Tweet. Saludo” bienvenido juanca. te falta el avatar! @jorgehernando22 claro me acuerdo, saludos jorge! Hoy FC Porto Vs Málaga (19:45 Pt - 14:45 Col) octavos de final en la #UCL por un sueño. mañana #UCL http://t.co/lDlgbwij @LINCPAL gracias parcero, me imagino que hiciste goles como Siempre jjajaja abrazo. Muy feliz con el regreso haciendo lo que mas me gusta y mas con esta importante victoria fuera de casa. @JacksonChacha09 esta cuenta es falsa, Jackson no tiene Twitter! RT por favor. Momento único. http://t.co/66telQKT @MICHAELORTEGA_8 Buena foto papa, abrazo grande crack! Noticias | James Rodríguez Web http://t.co/6l7fYQbm - Móvil http://t.co/VVmRTVur Falta poco para regresar! Desde la distancia toda la energía a mis compañeros, apoyo total. #UnidosPorUnPaís http://t.co/pFxslmxu Felicitaciones a la selección  sub 20 por el titulo del suramericano. #ColombiaCampeón  #OrgulloColombiano RT @PipeeeG10: En recuerdo con el mono @jamesdrodriguez teniamos por hay 10 años o q?  Jejeje http://t.co/ei9uZb62 @kingJames #JamesStyle  miami heat. http://t.co/UyP2NISx Felicitaciones a los jugadores de la sub 20 por su excelente trabajo. Ese es el camino!  #ColombiaSomosTodos @fsanchezparodi tienes razon fue el mismo dia, abrazo fede! “@josedeva20: @jamesdrodriguez que haces pa? Como va” hola josesito como estas? Abrazo papa! “@ValenTorrez: @jamesdrodriguez  ES MI CUMPLEAÑOS! MEREZCO UN SALUDO JAAAAMES! #UnSaludoParaValen” feliz cumpleaños. Pasala bien! A la Sub20 de colombia todo el apoyo, Buena energía y los mejores deseos para este buen grupo de jugadores. @mathiascardacio que grande, abrazo crack! @filipemacalves obrigado, abraço. RT @juanferquinte10: Respect por este senor @jamesdrodriguez y la verdad una persona y un amigo que no se compara #humildad http://t.co/ ... @santitv99 es con gusto espero lo disfrutes mucho jajajaaj RT @santitv99: El regalo q me mando mi parcero @jamesdrodriguez de Portugal!! Q detalle calid. Un abrazoo jaja http://t.co/60KIrQGv “@elninotowers: @jamesdrodriguez JAJAJAJAJJ demasiado chistoso jajajajajjaja” demasiado! Ya vieron el estilo de Peter anguila? Aquí esta  http://t.co/5G6qHi4F jajaajaajja muy bueno! “@Fguaro: @jamesdrodriguez. Q mas pues calidad como esta esa ciudad de oporto sabrossa o no????” Calidad bien! Abrazo fiera La Marte 1, el lugar donde se hacen los goles y nacen los sueños del  #PonyFutbol  de @PonyMalta_ Hoy fuera de la cancha pero con toda la buena energía para mis compañeros. Hoje mais um desafio,Força Porto! Recuperándome paso a paso! La alegría no puede faltar. http://t.co/dVgqMCSx “@santitv99: Que Cáritas teníamos !! Jajaja @jamesdrodriguez  @JEstrada_21 http://t.co/X6YuYLBU” la tuya! Jajjaja Recuerden enviar las fotos de la #LaPasiónPorEl10 quedan pocos días para concursar por la Camiseta 10 del Porto https://t.co/D0kp33F0 Esta buenísimo el tema (TE VAS) de @Juancho_Style vamos apoyar a nuestro talento colombiano! http://t.co/OiZn4qFH @cro_21 muchas gracias, un abrazo! Hoy toda la buena vibra para Colombia sub20. un nuevo reto, una nueva ilusión. #ColombiaSomosTodos http://t.co/lWidai5a Que buena frase me gusto   mucho. http://t.co/H9sMHoXw es un orgullo decir que juego con el mejor 9 del mundo! http://t.co/psoRIOOX El tigre en el once ideal de la fifa. Merecido,que grande! vuelve la liga y con muchas ganas de comenzar el año bien!FC porto- CD nacional 20:30PT 15:30COL gracias por el apoyo. http://t.co/JL3vstS7 El comienzo de un sueño. Todo el apoyo para los que son Grandes desde pequeños con el Torneo #PonyFutbol XXIX de @PonyMalta_ @Janny_Arzuza jajaja claro! me levante un poco dormido sin noción de lo que pasaba y agarre  un zapato diferente a otro, me di cuenta http://t.co/C3sYTYny En mi Facebook Oficial https://t.co/1vmRmSej también pueden ver las bases del concurso #LaPasiónPorEl10 RT Premio La 10 del FC Porto Empezamos el 2013 con concurso de camiseta, aquí las bases del concurso http://t.co/fw3Eltk8 #LaPasiónPorEl10 RT  http://t.co/y17oV7dF Ya queda poco para que empiece el torneo #PonyFútbol XXIX de @PonyMalta_ los mejores deseos para los participantes! @dylanmontalvo es verdad, Muchas gracias. Feliz año! @MARJAJUA gracias ma!los extrañamos y pásenla bueno por nosotros jajaaj dios los bendiga! Mi deseo para todos es un 2013 lleno de alegrías y bendiciones. Feliz año! http://t.co/a7gycYMa “@Juana_VR: I miss you bro te amo @jamesdrodriguez ♡ http://t.co/ulEqIhXO” yo también juanis! @susoelpaspi muchas gracias! feliz año. A ti. ¡Oh señor!, tributare gracias con todo mi corazón. Contare todas tus maravillas. http://t.co/YjagySbe feliz navidad que lo disfruten en familia que es lo mas importante. dios los bendiga siempre! Con mi hermosa daniela_ospina5 disfrutando de la navidad,las amo demasiado! http://t.co/brv386we @fguarin13 @falcao lo mismo guarito! Feliz navidad. Se te quiere bastante! al tigre tambien. Que el año 2013 sea lleno de muchas alegrias! Ya llego papa noel jajaja Feliz navidad, los mejores deseos para todos! http://t.co/t31gIazq http://t.co/qo6mnhK8 - hola seguimos http://t.co/GKIP6Gxw - Hola http://t.co/Qdn7Tupq - HT #JamesTwitcam http://t.co/nyaEXQUx - HT #JamesTwitcam para sus preguntas En 20 min Twitcam #JamesTwitcam para sus preguntas. Ya viene el link “@Davixito: Usen el HT #JamesTwitcam para escribir sus preguntas y leerlas al aire en la twitcam de @jamesdrodriguez” // 4pm hoy! Hola, Hoy twitcam a las 4 p.m  hora Colombiana atentos! Feliz Navidad. RT @col_somostodos: Hoy @jamesdrodriguez nos visitó y trajo mucha alegría a los niños de la Fundación. Gracias James por tantas alegrías ... Es muy lindo compartir con los niños de la Fundación @col_somostodos, entregarles sus regalos y recibir su cariño http://t.co/W8XOqXed me encanta Medellin. http://t.co/9NHvISic La navidad es linda en cualquier parte del mundo, pero en colombia es unica! Felicitaciones Colombia. Es un motivo de orgullo. Vamos recorriendo un buen camino todos juntos! http://t.co/tSOmpPYu Hoy por la taça da liga CDnacional - FCporto (pt 18:00) (col 13:00) a terminar el año de la Mejor manera! Felicitaciones también al DIM porque hoy jugó un gran partido! Campeón millonarios, felicidades a sus hinchas. Preparado para ver la final,Que gane el mejor y lo mas importante que disfruten en paz! http://t.co/Im9LG7LA “@andresrocha12: @jamesdrodriguez q tal este ambiente q se vive  http://t.co/aOEzqwza” se ve un lindo ambiente RT @Juandacasasbuen: @jamesdrodriguez No tengo foto, pero te digo que Medellín está paralizada y esperando estar de fiesta en dos horas. ... “@JuanVelezinho: @jamesdrodriguez desde New York me toca ver la final asi, http://t.co/pTseqVpn” me toca asi tambien. Saludos “@HectorQuinho: @jamesdrodriguez en tu casa cochino...” Jajaja RT @Amartinimartini: @jamesdrodriguez no soy de ninguno pero acompañando a mi papa de millonarios, ojalá todos celebren en paz http://t. ... @santitv99 negro le hago fuerza al buen futbol jajaja saludos papa! “@Rocstefan: @jamesdrodriguez  enchufados desde los Ángeles CA http://t.co/1kTJYxgX” buenisimo “@byAngelicaC: Orgullosos de tus triunfos @jamesdrodriguez Crack” gracias! Saludos “@wcamargoforero: @jamesdrodriguez en el Lleras en Medellín. http://t.co/9TE5ClxW” que buen ambiente! RT @D10James: @jamesdrodriguez Heeey Grande tocayo :) USTED ES UN CRACK!\nRT!  Por fa “@santy_chacon_R: @jamesdrodriguez @FALCAO @guarin13  SEGURO NO SE PERDERAN LA FINAL DEL FPC! MILLOS VS DIM” claro que no. RT @vivi6482: @jamesdrodriguez millos vamos por la 14 con toda http://t.co/g2nmcpmb “@DaniFRamirez: @jamesdrodriguez Jaja así, con frío. Un abrazo querido James. http://t.co/oO3dxlUq” mucho frio jaja saludos RT @sagadar: @jamesdrodriguez james un saludo desde itagui ant y con el rojo siempre http://t.co/Q7grS7qa RT @BDVtecnologia: @jamesdrodriguez AHÍ VA LA PRIMERA CAMPEÓN!!! con afecto desde su colombia http://t.co/y6D4L2s6 RT @kidfaz: @jamesdrodriguez mi esposa es del millos, toca ayudarla a hacerle fuerza aunque yo soy del nacional http://t.co/u4634QD7 RT @mariaisabelaria: @jamesdrodriguez Fiesta de la final en mi casa. James, mírame yo existo y te amo. @oficialDIM http://t.co/7dRV07As Cómo están viviendo la fiesta de la final hoy en Colombia? Bienvenidas las fotos desde sus casas , el estadio, el barrio. Hoy por la liga,Vitória Setubal Vs FC Porto (20:15PT - 15:15Col) desde dónde nos apoyan? @iomatrix23 Hola Marco. Todo bien! Abrazo. Primer partido de la Gran Final en Colombia! Cómo están sus pronósticos? “@matheus_uribe: @jamesdrodriguez parcero esta jugando mucho lo felicito que Dios lo bendiga siempre.” Gracias mate,felicitaciones sigue asi Hoy de nuevo en el dragão por la Liga (20:30 Pt - 15:30 Col) FC Porto Vs Moreirense. Desde donde estén el apoyo se siente. Feliz día de las Velitas, La Navidad es para la familia. http://t.co/SSMIvZKg Es doloroso despedir a ese gran ser. Calero un emblema al que admiraré eternamente #GraciasCalero Hoy PSG Vs FC Porto, (19:45Pt - 14:45 Col) #UCL lindo partido! Cae la noche en París, aquí junto a mis compañeros después del entreno. #UCL http://t.co/mZvJqqdR Hoy, SC Braga Vs FC Porto (15:15 Col - 20:15 Pt) esta vez es por la Taça de Portugal. Gracias por el apoyo! Una oración para un colega, un profesional admirable #FuerzaCalero nuestros mejores deseos están contigo. Importante victoria fuera de casa ante un gran rival. 3 puntos muy valiosos para nuestras aspiraciones. #somosporto Hoy por la liga, SC Braga Vs FC Porto (15:15 Col - 20:15 Pt) Buen partido con la mejor vibra! Esto es fraternidad. http://t.co/zTjV7Mq3 RT @Bibliaenlinea: Clama a mí, y yo te responderé, y te enseñaré cosas grandes y ocultas que tú no conoces. Jeremías 33:3 “@AMRG_21: Celebrando mi cumple junto a @jamesdrodriguez #Dani,  muchas gracias por todo, :) :) http://t.co/ImyHIp1T” feliz cumple tio! Hoy la Champions vuelve al Dragao FC Porto Vs D. Zagreb (14:45Col - 19:45Pt) el apoyo se siente #UCL Hoy el reto es por la Taça de Portugal Nacional Vs FC Porto (15:15 Col - 20:15 Pt) Saludo grande! Terminamos un año con la selección de buena manera, buen fútbol, entrega y mucho cariño por esta camiseta! Hoy Colombia Vs Brasil (19:30 Col) a dar lo mejor por esta camiseta! #UnidosPorUnPaís Ya en New Jersey con la selección. Preparado y con mucha alegría de vestir los colores de Colombia. Celebramos una importante victoria en el Dragao. Ahora con toda la alegría a mi Selección. FC Porto Vs Académica (13:00 Col - 18-00 Pt) la mejor energía para disputar este importante partido por la liga en el Dragao. Recordar es vivir! Que linda época! http://t.co/nBFPiu7G \"@AndreCastro88: Muito feliz pela estreia na champions :) um abraço a todos ! Parabens mano, mereces! Punto muy valioso en Kiev, gran trabajo en equipo. Ahora de regreso a Porto. Abrazo! #UCL Dínamo.K Vs FC Porto (14:45 Col - 19:45 Pt) modo Champions activado, la mejor vibra para hoy #UCL RT @daaniloluiz: Boa tarde amigos! Hoje temos mais um compromisso pela Champions! agora pra passar o tempo, jogando play com #Kleber e @ ... Rumbo a kiev, el martes #UCL. Feliz domingo! “@kelviiin93: Indo jogar pelo Porto B contra o Maritimo B, com meus parceiros @Juan_iturbe93 , @HectorQuinho e outros #forçaPorto” bom jogo. Gran presentación la de hoy junto a mis compañeros. 3 puntos para el liderato en Liga y confianza antes del encuentro por #UCL Hoy por Liga en el Dragao FC Porto Vs Marítimo (15.15 Col - 20.15 Pt) Buena energía de todos para mantener el liderato. Les comparto la entrevista que me hizo @championsleague en el portal #UEFAcom aquí el enlace http://t.co/Atv1f1kw http://t.co/XQ9Nv32T TRANQUILA https://t.co/YnXEvhvD Escuchando lo nuevo de @JBALVIN la rompiste Jose! “@col_somostodos: El deporte es su motivación. http://t.co/9TNm2kUS” http://t.co/iPi8O2HX Los que teméis al señor, amadlo; y serán iluminados vuestros corazones. http://t.co/OcXfaIVi Mais uma vitoria muito importante! #somosporto Hoy Estoril Vs FC Porto (15:15 Col - 20:15 Pt) regresamos a la competencia por la Liga Portuguesa. Feliz Domingo! RT @Davixito: Aquí en @futboltop10 las únicas canchas de jamesdrodriguez en Ibagué. Todo un museo de fútbol [pic]: http:/ http://t.co/Pt ... @Davixito feliz cumpleaños disfruta este dia al maximo. Abrazo! Bendiciones RT @Davixito: Buena imagen la de @jamesdrodriguez en el Partido de Champions que dejó con 9pts al Porto http://t.co/Hd99WUQO http://t.co ... Volvemos a sumar 3 puntos en esta dura competencia. Optimismo en el equipo y la afición #UCL Hoy FC Porto Vs Dínamo de Kiev (13:45 Col-19:45 Pt) El Dragao vibra y ustedes conectados desde diferentes lugares con la mejor energía #UCL Rumbo a la concentración. Cómo han visto esta jornada de fútbol Europeo hasta el momento? #UCL @Juanddiaz2008 cuando quieras jugamos pes 2013 jajaja saludos! “@CrisitanOv: @jamesdrodriguez buena james  y si se recuerda parce cuando usted jugo en academia con perdomo y con migo\" claro que si,abrazo @Davixito andres esta comiendo mucho por aca jajaja @AMRG_21 Por aquí ando con mis dos mejores amigos, se los presento Manolo y Dilan ! Feliz Noche http://t.co/9G7yGxPV Nueva semana de Champions, continuamos preparando el encuentro del próximo miércoles. #UCL “@UNICEFColombia: Ya te lavaste las manos con agua y jabon, por minimo 20 segundos?. …” // Ya lo hice, es una costumbre sana ! hoy en la distancia con la camiseta puesta apoyando a mis compañeros! Nadie me mueve del TV #colombiasomostodos http://t.co/NYMWHXOy @EnvigadoFC ya son 23 años y que sean muchos muchos más! Felicidades. “@nikorubio17: @jamesdrodriguez hoy es dia de descanso, de reflexión.. Y en la noche ir al polideportivo a ver al @EnvigadoFC\" abrazo niko “@DocLizAriza: @jamesdrodriguez Mucho Futbol, mucha oracion, mucho relaxxxxxxx y muchas buenas peliculas para ver! Saludos liz. “@4618Song: @jamesdrodriguez que gran partido hicistes contra paraguay exitos en tu carrera james10 #unidosporunpais.” gracias! “@JussepRoaP: @jamesdrodriguez playita y descanso” que bacano! Pasala bien. “@KhrizTiianVilla: @jamesdrodriguez Parcero , Salir Cn La Familia , i Por Hoy Domingo Ver Futbol Argentino =)” lo mejor! Que hacen este puente festivo en colombia, Que planes tienen? Fue trabajo en equipo: Ustedes y nosotros. Ganamos Todos. El país apoyando con alegría, la motivación es total. A todos nos une la misma ilusión. Hoy hace un año se me cumplió un sueño, hice mi debut con la selección Colombia, el sueño continúa! Esto es colombia! @falcao @alcatraz2720 @macne10 @teog29  @carlos7bacca  http://t.co/Y5sPIoW0 Ya en Barranquilla, de nuevo con la gran fortuna de vestir los colores que llevo en el corazón #UnidosPorUnPaís que lindo recibimiento! 3 puntos de local muy valiosos, resultado del trabajo en equipo y la buena energía de la gente. Muy feliz con el premio al mejor jugador del mes en la Liga Zon Sagres. Dedicado a todos los que apoyan! http://t.co/AWwghrGa Hoy FC Porto Vs Sporting (20:45Pt - 14:45Col) Motivación total para un lindo clásico en el Dragao. Buena energía! RT @MikeRamosR: @jamesdrodriguez Esta es mi favorita. Espero ver marcando y festejando muchos goles. Saludos http://t.co/Blg3syQH RT @Alejandro0C: @jamesdrodriguez  Esta me gusta! (y) http://t.co/2GJg4gg8 RT @adagrh_: @jamesdrodriguez mira esta? me encanta.. http://t.co/PIHdJhIc RT @FutbolMundialSo: @jamesdrodriguez Estaa me gusto mas http://t.co/nwe7ORym RT @ApoelRealMadrid: @jamesdrodriguez usted fue increíble anoche contra el PSG.Tú eres el mejor.Nosotros l'apoyamos aquí en Chipre del A ... RT @DimeTavo_: @jamesdrodriguez Me gustoo, que tall esta? http://t.co/fRafZ4vo RT @jvelezmigliore: @jamesdrodriguez Me gusto esta... celebrando ese golazo que te mandantes con tus compañeros. Saludos y éxitos crack. ... RT @DimeTavo_: @jamesdrodriguez Esta me gusta muchoo a ti? http://t.co/4mCBu7np Del partido de Champions  me gustó mucho esta imagen, cual les gustó a ustedes? Tienen alguna? Quisiera verlas ! http://t.co/tc9e3SyZ “@estradaisa: @jamesdrodriguez muchas felicitaciones! Mas que merecido! Colombia se siente muy orgulloso de lo q representas!gracias,saludos Cada vez que llega la convocatoria de Selección Colombia se siente algo muy especial... Creo que se llama: ilusión Victoria muy importante de local, teníamos que ganar y el equipo jugó para lograrlo. Gran noche de #UCL Hoy (19:45 Pt - 13:45 Col) FC Porto Vs PSG por #UCL Lindo partido en el dragao,aunque la buena energía llega de todas partes! Rumbo a la concentración para el partido de Champions frente a PSG. Mañana el Dragao con toda la buena vibra! #UCL Hoy visita a Vila do Conde. Rio Ave Vs FC Porto (20:30 Pt - 14:30 Col) con Toda la actitud y energia! “@alcatraz2720: @jamesdrodriguez  socio ya llegaron los juegos http://t.co/qE7ysSF6” eso papa. Entrena bastante jajaja abrazo crack! @Cartel_de_Sapos  @manolocardona11 @juanpabloraba\" excelente, sera un exito total. Saludos! “@LEOMANTILLA22: En campeonato de PES 2013 con @jamesdrodriguez y @HectorQuinho   No he visto una” aca hay mucho nivel Jajajaja “@LEOMANTILLA22: Ya en Porto donde el parcero @jamesdrodriguez, atendidos como príncipes, linda ciudad .” esa es la idea jajaja disfruta! RT @silvia_31416: @jamesdrodriguez Si señores así es...muy verídica..Dijo DIOS \" Sean mansos y Humildes de Corazón \" Exitos,bendiciones  ... Comparto con ustedes Esta frase que acabo de leer ''El secreto de la sabiduría, del poder y del conocimiento es la humildad'' RT @Davixito: Esta es la versión oficial de @jamesdrodriguez en #pes2013 está calificado con 83 en promedio y centros de l http://t.co/r ... Buena noche del equipo en el Dragao, se hicieron las cosas bien y la gente feliz! Gracias por todos esos buenos mensajes! RT @AMRG_21: Realizando labor social en Ibague en nombre de @jamesdrodriguez que gran corazón, son bendiciones @col_somostodos http://t. ... Hoy la cita es en el Dragao FC Porto Vs Beira Mar por la Liga, (20:30 Pt 14:30 Col) Buena energía en el estadio y en la distancia. “@sergio0802: @jamesdrodriguez Saludame, siempre he estado apoyandote, suerte en esta Champions.” muchas gracias. Abrazo! Empezar ganando en la Champions League es muy importante y más de visita. Ya regresamos a Porto ahora a descansar. Feliz noche! Hoy Dínamo Zagreb Vs FC Porto (19:45 Pt - 13:45 Col) de nuevo la #UCL Ya es noche en Zagreb Croacia,mañana regresa la UEFA Champions League. La mejor energía para esta linda competencia!! RT @Juan_iturbe93: Viajando para Croacia ! #porto @jamesdrodriguez #otamendi #jackson  http://t.co/witmS0Oe Los niños de este colegio tuvieron un lindo detalle. Unidos hacemos cosas buenas. Véanlo https://t.co/hzYPWvm8 RT @MauricioC74: @jamesdrodriguez gracias James, desde la selva los soldados d la patria tuvimos una alegría inmensa con tu gol, haces r ... Ahora mismo rumbo a Porto. Quiero agradecer sus amables mensajes. Les dejo aquí imágenes y video de ayer http://t.co/GigEtvXa 6 puntos que suman en ese gran anhelo de todos. #brasileslameta gracias por su apoyo! http://t.co/L3OHN30g Las ganas son inmensas, la buena energía se siente. #Todosunidosporunpaís Ya en Santiago, hoy práctica y con la mejor energía para enfrentar el partido frente a Chile. RT @Davixito: junto a @mario2rubio y @AMRG_21 nos encontramos esta escena de el Pibe con la camiseta de @jamesdrodriguez #delujo RT http ... Unidos logramos buenas cosas. Ahora a pensar en Chile. Feliz noche! http://t.co/hddvLE9C Colombia unida apoyando, el equipo listo para darlo todo. El ambiente es ideal. #todosunidosporunpaís Hoy día de acondicionamiento, aquí con @gio10_moreno y el tigre @falcao amigos y compañeros de siempre! http://t.co/SvZSJQ3j Ya en Barranquilla, lindo recibimiento. La buena energía es el mejor regalo de la gente. @DNicolasD  jajaja claro,de pequeño fui varias veces me divertia muchisimo! Saludos. RT @Davixito: Video de @jamesdrodriguez Hoy, Imperdible el gol RT pls!! http://t.co/RP0Vmu5T RT @MiPerfilOficial: El Perfil Oficial de Radamel Falcao en twitter es @FALCAO &lt;&lt; Cuenta Verificada √ &gt;&gt; 3 importantes puntos en la visita a Olhanense. Ahora a Colombia, tenemos un gran compromiso. Mañana visita al Olhanense por la Liga Portuguesa y luego viaje a Colombia para unirme a la selección. Hat trik del tigre, eres muy grande @FALCAO Que alegría! Siempre es bienvenido vestir los colores de la selección y trabajar con optimismo frente a los retos que vienen. Un saludo para todos, gracias por sus mensajes.  Andamos muy activos trabajando pero siempre hay un momento para leerlos! RT @LSPiwi: Alquiler de yates,apartamentos,carros,casas,lanchas en cartagena para mayor informes aqui al cel 3013642530 @abelaguilart buena abelito, felicitaciones! fcporto-v.guimaraes pt 20:30 col 14:30. A hacer las cosas bien! Buen finde semana para todos. Gracias a todos por sus mensajes, son una gran motivación y una manera de mantenernos cerca! La buena onda siempre es Bienvenida aquí. “@Lauraklose: Mi hermanito de 6 años dice que cuando crezca quiere ser el nuevo James @jamesdrodriguez :D” saludes a tu hermanito! “@ladamore: @jamesdrodriguez Gracias a personas como tú, me siento orgullosa de ser colombiana!. &lt;3” yo tambien! RT @Juana_VR: @jamesdrodriguez el es mi broo el es mi idolo :)♡!!! RT @josehrodriguez: Nosotros los Rodriguez somo unas makinas o q dice priii  @jamesdrodriguez  solo talento! @JorgitoPineda02 @PipeeeG10 ... RT @Davixito: @jamesdrodriguez en las buenas y en las malas el apoyo a la selección el aliento sigue vivo y confiamos en ti! “@herdayavez: @jamesdrodriguez saludame en portugues ps o un rt que veo que ya dejaste el paisa” jajajaja no nada! RT @santivad: @jamesdrodriguez en Banfield somos todos hinchas de Colombia y el Porto, aguante James!!!! RT @danielsuarezcl: Se acuerda uno cuando lo veia pasar diario por la casa para ir a entrenar en la cancha del Dorado en Envigado @james ... RT @ser_mar1712: @jamesdrodriguez no te olvides de la gente de banfield que esta pasando un mal momento pero pronto volvera a primera do ... RT @FutbolQuerido: @jamesdrodriguez Damos info de todo el fútbol mundial, se agradece RT crack ! Se extraña tu fútbol por Argentina... “@Barbara_Isabeel: @jamesdrodriguez: Parabéns, pelo seu trabalho no PORTO! &lt;3” obrigado “@fangunners: @jamesdrodriguez James! no te vayas sin darme un saludo o RT! te admiro muchísimo CRACK” gracias RT @julietterangelP: @jamesdrodriguez hey que chevere tu actitud no todos se ponen a ver todoos los tweets que le mandan saluditos RT @PabloMaury: @jamesdrodriguez James un RT para la gente de Barranquilla que te apoya “@numlimas: @jamesdrodriguez saludos desde Cúcuta ojalá algún día vengas” algun dia! “@Maru_Taladro90: @jamesdrodriguez James cmo t extraña Banfield!!! cmo olvidar el gol con lanus!!! GOLAAZO!! sos crack!!” abrazo! “@JoshuaAlvarado2: Grande James!!! Buenos deseos en esta nueva temporada, con toda! @jamesdrodriguez” gracias RT @NINIPAOLA78: @jamesdrodriguez comparto contigo la belleza de mi Guajira! Un saludo y que Dios siga bendiciendo tu vida! ÉXITOS http: ... “@HuevoSamarin: @jamesdrodriguez volve a Banfield james, hacerlo x la gente que te necesita !!!!!! Lo mejor para vos locura” grande saludos RT @Pablo9006: @jamesdrodriguez Saludos James desde Pasto-COL, gracias por dejar el nombre de Colombia en alto, ¡vamos al mundial!. Dios ... RT @cfmendezs: @jamesdrodriguez muchos exitos esta temporada y ojala se den las cosas para que los resultados positivos vengan pronto en ... “@Yo0oJii: @jamesdrodriguez  un saludito desde Barrancabermeja Santander Sos grande sos james!” saludos a la gente de barranca RT @SalomonGuerraN: @jamesdrodriguez Grande, muy grande gracias por dejar a colombia tan alto Aquí leyéndolos prepárense para RT . RT @EnvigadoFC: @jamesdrodriguez @juanferquinte10 @fguarin13 @Gio10_Moreno danos RT ;) las boletas para el martes ya están a la venta, h ... Un saludo para todos, mañana regresa la liga al Dragao. Gracias por el apoyo permanente y los buenos mensajes. Los deseos son mutuos. aqui pueden entrar y leer la entrevista con @fifacom_es muy buen articulo,http://t.co/B9YuM3jR Hoy Gil Vicente Vs FC Porto (18:15pt, 12:15Col) inicia un nuevo reto, el apoyo de ustedes siempre importante! RT @daaniloluiz: Bom dia! Hoje temos a estreia pelo campeonato portugues!  Sempre importante comecar com vitoria! FeemDeus Mañana iniciamos una nueva Liga. Les envió desde la concentración un gran saludo! Feliz Noche. RT @fifacom_es: Atención Colombia: http://t.co/EAMyARZ3 habló en exclusiva con @jamesdrodriguez . Visítanos el próximo lunes para leer l ... “@NachoSainz8: @jamesdrodriguez eres un espectaculo señor!!! un placer habertr visto jugar tan cerca!” gracias!Saludos “@jaime101360: Gran experiencia haber entrenado con la seleccion Colombiana y en especial por haber conocido a @jamesdrodriguez !!”abrazo! “@juan1234jose: @jamesdrodriguez un partidito o qe james jaja qe dice ps ome” listo jugamos cuando quiera! Jajaja saludos. “@alcatraz2720: humillante derrota acabo de sufrir jugando play a manos de @jamesdrodriguez Hay que mejorar bastante jajajajaja” jaja si @EnvigadoFC juega la clasificación en la Suramericana el miércoles. Hay que acompañar al naranja en casa, está donde siempre lo quisimos ver RT @santitv99: Les dejo esta foto con mi parcero james bond jaja @jamesdrodriguez  http://t.co/RJq2wiag Emotiva clausura de las olimpiadas. Estoy pegado a la tele.todo es impresionante! “@abelaguilart: En Madrid con la selección! Con ganas y alegría siempre, importantes días para trabajar... Abrazo!!!” asi es abelito. Ya en Madrid con los compañeros de selección para preparar los importantes retos que vienen. Aquí junto a Cha cha cha que empezó con gol de título.  http://t.co/496LIYY2 Un nuevo título. Súper Taça de Portugal un gran motivo para ir por todo en esta temporada. http://t.co/QTRhrbt9 Hoy Final de la Supertaça de Portugal FC Porto Vs Academica (20:45 Pt, 14:45Col) “@AndreiRiano: @jamesdrodriguez #CodigosDeFeExpress Tu Código de hoy: Renueva tus fuerzas. http://t.co/VbBEkoiI” importante, saludos! Jackeline Rentería, eso si que es lucharla. Bronce para Colombia felicidades! Un gran saludo para Oscar Muñoz, Bronce Olímpico en Taekwondo. Representante ganador de la nueva  generación del deporte Colombiano. Triste la partida de Jairo Varela creador del Grupo Niche. Gran legado musical el que dejó. Todos gozamos con su música. “@santipluis7: #GolesInolvidables el de @jamesdrodriguez a lanus en el lencho sola. Gracias por la magia crack!!” nunca se olvida,gracias! “@alepamo2007: @jamesdrodriguez , hola, pero si Envigado ganó la B en el 2002 y la medalla dice 2007, nom entendí”tambien gano la B en 2007 En época de medallas aquí un lindo recuerdo. La gané con Envigado en el título de la B en Colombia. http://t.co/adj12GMq RT @FCPorto_1893: Feliz inicio de semana Jamees! Ha empezar con buen pie en esta semana de preparación. Recibe las mejores bendiciones í ... Katerine Ibarguen Plata Olímpica. Muchas felicidades! Lo tuyo es un gran salto para el deporte de nuestro país . Jugar con la 10 es un honor, un orgullo, un sentimiento especial que exige dar lo mejor. http://t.co/k9k3H2wo Hoy de vuelta al Gran Dragao. FC Porto Vs Lyon. (20:45 Pt, 14:45Col)  Presentación del plantel y reencuentro con los hinchas! Proverbios:\nLa vida de los hombres buenos brilla como la luz de la mañana,va siendo más y más brillante hasta que alcanza todo su esplendor. “@AndreiRiano: @jamesdrodriguez  #CodigosDeFeExpress Tu Código de hoy: Desarrolla habitos ganadores. http://t.co/rNTmHgMt” gran codigo. Abrz Yuri Alvear, Felicitaciones una nueva medalla para Colombia en Judo. Un bronce que representa el gran esfuerzo de nuestros deportistas. “@JeisonMurillo19: Unrecuerdo con @jamesdrodriguez @luisfmuriel24 @LucianoOspina http://t.co/k73Aydib”donde esta la joda estas vos muri jaj Toda la fuerza hoy para @EnvigadoFC y @Jpuefc que empiezan a escribir su historia en Suramérica.  #Orgullonaranja Todo un país hizo fuerza por Óscar Figueroa y él hizo fuerza por todo un país. Felicitaciones merecida plata olímpica para Colombia en pesas “@HualfonsoB: @jamesdrodriguez James Cristo te ama, no te olvides nunca de el busca a Dios ahora mientras pueda ser hallado” claro,gracias! Nuestro equipo femenino de fútbol hoy en su segunda salida olímpica. Vamos niñas apoyo total! Fuerza! @uranrigoberto nos regala la primera alegría olímpica Felicidades! Qué gran hazaña! Plata Olímpica Un gran saludo para nuestros deportistas en Londres. Vamos Colombia!  http://t.co/0O1vlj31 @jamesdrodriguez: Continuamos el trabajo de cara a la temporada 2012-2013. Hoy partido frente a Valencia CF “@MaxiDelmas: @jamesdrodriguez IDOLO.. BANFIELD TE AMA! http://t.co/2rksB5lW” gracias,abrazo! Lo que faltaba, este personaje encima del comedor! Jajajajaajaj http://t.co/Tgt2Cj5m Jajaja miren la foto que tomé con Otamendí. La alegría no puede faltar! http://t.co/CpIukYuV Hoy el equipo femenino de fútbol de Colombia debuta en los Olímpicos. Fuerza súper poderosas #ColombiaSomosTodos “@futbolcolex: #AFCEcuandoNiño Imagen de @jamesdrodriguez en su infancia http://t.co/SWJ7CigP” que gracioso! Jajaja “@victorbonett: @jamesdrodriguez jajaja cogiste de hijo a cha cha cha en play” jajaj no,el juega muy bien! 3 partidos jugados,marcador final,JR10 dos partidos ganados y uno empatado! estoy pasando por un buen momento,jajaja buena noche! Voy a jugar un partido de play con mi amigo \" cha cha cha\" atentos al marcador jajajaja! http://t.co/di55758r Domingo libre, y aprovechando para hacer un asado en casa!Se ve buenísimo! A comer se dijo jajaja http://t.co/9HFCAJyE \"@daaniloluiz: @jamesdrodriguez Grande jogo jao! rs Parabens!\" Obrigado jao! Haha abraço! Hoy jugamos nuestro tercer partido de pretemporada. Resultado positivo seguimos trabajando para los retos que vienen. Hoy día de Independencia de Colombia. Saludos a todos en mi país y a los colombianos que nos encontramos afuera. http://t.co/pSpVZZdd Que orgullo decir #SoyColombiano \"@jkquintero: Tremenda adquisición @jamesdrodriguez http://t.co/PYtx4oYo\" esta muy buena! \"@LEOMANTILLA22: Les dejo esta foto del amanecer. Cartagenero, buen dia para todos http://t.co/LpJRghdW\" buenísimo leo, pasala bien. Abrazo! Entre los que me siguen aquí y en Facebook dan me gusta en http://t.co/GigEtvXa pueden ganarse esta camiseta http://t.co/sucDOsia \"@John_Cruz11: @jamesdrodriguez cuando este en Colombia jugamos PES 12, apostamos alguito jajaja #GrandeJames\" jajaja ok. Trato hecho! \"@dylanmontalvo: @jamesdrodriguez Fifa o pes?? saludos parcero\" PES12. Abrazo! \"@jairos1301: @jamesdrodriguez , que juega #PS3 o #Xbox360?\" #PS3 soy el mejor, jajajaja mentiras! Saludos. \"@Nico_Briant: @jamesdrodriguez genio, ídolo, siempre en el corazón banfileño!!! Saludos desde acá y gracias eternas por todo!\" Gracias. \"@anagabriel_37: #GrandesPreguntas sera que mi ídolo @jamesdrodriguez si leerá todos lo tweet que le mando??♥\" claro que si,los leo a todos! \"@LucasJllodelC: @jamesdrodriguez eso mostro!! Esa foto me gusta mas que la otra!! ✌pudiste embarcar a Manolo al fin ?\" Esta aca lucas! Abrz Continua la pretemporada ahora desde Porto. Buenas rutinas de entrenamiento para estar a punto. A la gente del pasto también felicitaciones,lucharon hasta el final! Felicitaciones a los hinchas de santa fe. Merecido campeón! Que gran final hasta ahora, Buen ritmo y por momentos muy emocionante. Que gane el mejor! #Cuandoerachiquito siempre tenía un balón bajo el brazo para jugar en el barrio. Hoy el fútbol colombiano corona al campeón. Felicitaciones a los hinchas de SantaFe y Pasto por la disputa del título. Fútbol en paz. Segundo amistoso de la temporada fcporto-evianfc 19:15suiza 12:15col. Buen finde para todos! Ahora que nos cambiamos de hotel me toco una vista mejor jaajajajaj! Les gusta? http://t.co/ruNi218c De nuevo gracias por este día lleno de buenos deseos. Mi TL nunca se detuvo con el #FelizCumpleJames gracias a ustedes. Un muito obrigado a todos os que me deixaram mensagens de feliz aniversario! Gracias a todos por sus mensajes de #FelizCumpleJames se siente bien el cariño de todos. “@AndreCastro88: Feliz cumple amigo :) Parabéns :) @jamesdrodriguez :) ,com Pedro Moreira e Sereno http://t.co/9EMiJzTh” obrigado mano “@Juan_iturbe93: Feliz cumple a un amigo y compañero @jamesdrodriguez ! http://t.co/kWS6B9Mu” gracias juan! Con \" cha cha cha\" en la pre temporada, bienvenido al FCPORTO! http://t.co/qOXfBxiD Hoy primera parte de la final del fútbol Colombiano.... Quién pegará primero?... Desde aquí atento! @davidosp1na  NO pertenece a David Ospina que de momento no  tiene twitter. Pido a todos difundan la falsedad de esta cuenta y denunciarla Ya en suiza para el inicio de pretemporada,miren la vista que me toco desde mi habitación.Feliz semana! http://t.co/hkPK9lYy Ya desde Porto. La mejor energía para esta nueva temporada que empieza. Buenas vacaciones en Colombia con la familia, los amigos y toda la gente que me demostró tanto cariño. Gracias a todos! Anoche en @gairacafecumbia me encontré con esta versión de James Rodríguez fue muy divertido. Gracias! http://t.co/zZo1LZ1Y RT @bibliaenlinea: El mundo premia el éxito, Dios corona la fidelidad. En @gairacafecumbia con @mario2rubio @AMRG_21 @leomantilla22 @MARJAJUA @karenwittinghan http://t.co/kdnkBCOw Muchas gracias a @claudiaelenav y @carlosylaprovin por la atención en @gairacafecumbia http://t.co/A3MWEvcP el detrás de cámaras de los  Pony Balones de @PonyMalta_ está buenísimo aquí se los dejo https://t.co/bOAHIcQT Listo para ver la final de la copa libertadores,quien será el campeón.Boca juniors o corinthias? RT @msueldo27: Sorteo de la camiseta firmada por @jamesdrodriguez Seguí los portales: twitter: @msueldo27 http://t.co/rfM60xnb… http://t ... “@filikocu: @jamesdrodriguez jjajajajjaj james eso no es nada mirame a mi !! http://t.co/0SgliOsc” jajaa buenisima! “@pilarcaceres: @jamesdrodriguez jaja yo quiero yo quiero saber somo seré” es un programa que se llama aging booth lo descargas de tu iphone Qué tal. se supone que así seré en el futuro. Que mal o no?Jajajajaja http://t.co/bgYr8POR Este gordito nos acompañó pero tuvo que irse muy pronto. Adiós Gru te queremos! http://t.co/pxjWYPOH Viendo la final de la #Eurocopa cual es su favorito? “@LINCPAL: buen parche parceros, mil gracias! “@Davixito: @mario2rubio @amrg_21 @jamesdrodriguez @lincpal  http://t.co/qUKlilBQ”” Un saludo para @futbolmaniarcn y @fueradlugarrcn que hoy pasaron por @futboltop10 aquí fotos https://t.co/xIDjfYEX Noche de música en casa! http://t.co/6vDWIUCQ Disfrutando de mis vacaciones, cual es el plan de ustedes hoy viernes? Yo con ganas de escuchar salsa. Mucha fuerza para la hinchada del taladro, siempre en mi corazón, gente con fuerza y aguante, de esta salimos. Banfield volverá a primera! RT @NanoBanfield: @jamesdrodriguez James hoy Banfield se juega la historia. Nos tenemos que quedar en la A. Gracias por todo crack y  es ... Otra linda noche de Fútbol ahora en Miami. Soy un afortunado de hacer parte de este hermoso deporte. Feliz cumpleaños a @LSPiwi  que esta cumpliendo 35 pero parece de 40. Estas muy viejo de verdad jajajaja. Pasala bien! \"@ValenTorrez: @jamesdrodriguez Hola, ASCENDIO RIVER, estoy muy feliz! SOS EL MEJOR.\" Felicitaciones, river merece estar en primera división Hoy se repite \"La Batalla de las Estrellas\" en Miami todo listo para el partido. qué tal este video https://t.co/3k7sUipd! Bueno, no? \"@Daniel10AmayaLl: @jamesdrodriguez vas a jugar hoy en el partido en Miami?\" Si voy a jugar, saludos. \"@Davixito: Fotazaaaaaaa de @jamesdrodriguez la tomé yo jejeje ;) http://t.co/MNo2rQYs\" buena foto. Gracias! Todo sobre el partido de anoche, fotos, vídeos, todo aquí https://t.co/1vmRmSej. Un saludo para todos https://t.co/0TZrcPn4 Aquí está el video de los Pony Balones, ya tienen el suyo?… más información en https://t.co/CIbfXzfi \"@johnalexandero: @ArtistasFC y @jamesdrodriguez Y YO gracias james http://t.co/zijfecOn\" de nada, un abrazo! Linda noche de fútbol hoy en Bogotá. Gracias a los que se mantuvieron atentos. Les dejo la imagen de este ganador http://t.co/2t5LfNjJ \"@M_Fontenla: @jamesdrodriguez grande james volve a banfield algun dia es tu casa genio ; )\" algun dia. Saludos! Mañana el partido junto a un estelar grupo de futbolistas a favor organizaciones benéficas Muy contento de poder aportar,Vamos a divertirnos \"@CrissHurtado: Ya llegó el grande de Colombia @jamesdrodriguez!!! Una noche maravillosa http://t.co/ql84NuQh\" gracias, saludos! Imagen de vacaciones, los niños siempre con buena vibra y la mejor energía. Grandes seguidores. http://t.co/PGCzozKY @pipepaniagua pipe la nota quedo muy buena, Que lindos recuerdos. 'ENVIGADO CANTERA DE HEROES' un abrazo! RT @EnvigadoFC: Compartimos las imágenes de la visita de @Jamesdrodriguez a la sede deportiva de @EnvigadoFC http://t.co/bcNmtlAa RT @Juancho_Style: Gracias a @jamesdrodriguez por el detalle , que alegría y que orgullo tener la del bicampeonato , bendiciones papa ht ... \"@DJPOPEJB: @jamesdrodriguez que gusto conocerlo !! En estos días le doy unos trucos de fútbol pa que se ponga a mi nivel. Jjje' jaja abrazo RT @JBALVIN: Muy buen show ayer junto @LINCPAL \n@jamesdrodriguez @Juancho_Style \nDavid Ospina y Dorlan pabon .\n#DabiznesTeam http://t.co ... @JBALVIN saludos parcero. Escuchando #nadiecomotu de mi parcero @juancho_style  esta demasiado bueno. Recomendado! Un saludo muy especial a todos. Por estos días en un corto periodo de vacaciones pero siempre teniéndolos muy encuenta. Abrazo A pocas horas de enfrentar a Ecuador. Gracias por su buena energía que motiva a trabajar de la mejor manera esta tarde. Abrazo Ya en Quito, donde llegamos nos apoyan, mañana nos acompañarán muchos en el estadio y millones en la distancia. Gracias #ColombiaSomosTodos #MásActitudMásEnergía la que puso David Rincón el último ganador de los premios. pueden verlo en http://t.co/14HAaQyr @PonyMalta_ muchas gracias a @DanielSamperO por el libro sálvese quien pueda, que gran detalle! Saludos. http://t.co/SbBY7233 \"@santiagoarias13: @jamesdrodriguez muchos éxitos y felicitaciones por el gol y la victoria\"gracias santi, saludos! Buena noche a todos, continuamos preparando el próximo partido. Entrenamiento, concentración y ganas es la fórmula. Aquí algunas fotos y videos de ayer https://t.co/1vmRmSej no se las pierdan. Feliz semana para todos! Valioso resultado, un rival difícil como todos en eliminatorias. Ahora a pensar en Ecuador! Gracias a los que no paran de alentar! Motivación al 100%. Nos la jugamos toda por esta camiseta. Hoy 5pm Perú - Colombia. Se siente todo su apoyo! Ya en Lima. Mañana una gran oportunidad para dar lo mejor, Gracias por sus mensajes. Feliz noche! Empieza la fecha de eliminatorias y ya los veo a todos conectados con #ColombiaSomosTodos , buena por esa! Todos con la camiseta puesta. Ahora a votar por los nuevos nominados de #MásActitudMásEnergía David, Juan, Yonny, Juan M, Jesus ya  en http://t.co/I6kWUYW6. #MásActitudMásEnergía es la que tiene Andrés Castro en su bici, es el ganador de esta semana. Véanlo en http://t.co/14HAaQyr \"@GolCaracol: ¿Qué tal este video @jamesdrodriguez ? http://t.co/1SjfRT4s #FuerzaTricolor\" esta muy bueno. Gracias por todo su apoyo, ahora vamos a escribir #ColombiaSomosTodos en los mensajes, que se sienta la buena vibra en días de selección RT @juanferquinte10: Les dejo una fotiko con @fguarin13 y @jamesdrodriguez #somoscanteradeheroes DLB a todos feliz noche\" http://t.co/LW ... RT @Davixito: Llevando al pana @jamesdrodriguez a la concentración de la selec en la flecha       Plateada ;) http://t.co/bMfOKv0G Una foto con @showsalerta gran persona, gracias por esta noche de humor! http://t.co/1mxxHtlT Que buen show nos ofrecieron algunos humoristas, la pasamos muy bien fue un rato agradable. http://t.co/6KJpL3VB RT @LINCPAL: Q buen regalo! Linda camisa la del Porto d Portugal, gracias a @MARJAJUA y al parcero @jamesdrodriguez abrazos a los 2 http ... Vamos día a día trabajando concentrados para entregar lo mejor en el terreno de juego. Ya falta poco. Los nuevos nominados con #MásActitudMásEnergía son Michael, David, Pablo, Andres, Jaime aquí los puedes ver en http://t.co/I6kWUYW6 Hoy es un viernes de #MásActitudMásEnergía y la ganadora de la semana es Sandra con este video http://t.co/dWOfI0pt A todos ustedes muchas gracias por los mensajes que no se detienen. Se siente el apoyo, esas son las cosas lindas de la selección. El grupo cada vez más completo seguimos entrenando #colombiasomostodos \"@FCJamesRodrigue: Esta es la pared de una tienda Adidas en la que esta @jamesdrodriguez :) el mejor!!  http://t.co/BN6NeeWF\" muchas gracias Domingo de descanso, mañana volver a los entrenamientos con todo!  Como los trata el finde semana? \"@Lii_Sanchez: @jamesdrodriguez nada como el humor colombiano no??? Jajajajaja\" es el mejor RT @HumorColombiano: -A mi me gustaría q mi suegra fuera una estrella -Si? Para q te lleve a Hollywood? -No, para q este a 3OOO años luz ... \"@HumorColombiano: Más peligroso que Garavito en una guardería. @jamesdrodriguez\" jajajaja Feliz cumpleaños a mi hermanita  @Juana_VR disfruta este día al máximo! Esta fue mi primera copa que gane en el pony fútbol con tan solo 12 años, que lindos recuerdos! Momentos inolvidables. http://t.co/HW1ngRLV Lo de el tigre falcao no tiene nombre. Impresionante! Que obra de arte que hizo. Preparados para ver final de Champions? Algún favorito?... Que empiece la #UCL Quisiera responderle a todos pero son muchos mensajes. como siempre recibiendo buena energía de parte de ustedes. Muchas gracias! \"@CristianJimnezD: @jamesdrodriguez Mis respetos para este sr jugador, además un caballero.\" Muchas gracias. \"@varelandrea: @jamesdrodriguez Si lo lees todos por que nunca me respondes? :c\" porque no puedo responderle a todos! Son muchos mensajes \"@juan3140: @jamesdrodriguez ve james vos te acordas del equipo de la selección tolima beto,gusi,JP torres, el paisa y cota; si me acuerdo! \"@futbolcolex: @jamesdrodriguez Gracias por dejar el nombre de Colombia en alto, en las canchas del mundo\" muy bueno el trabajo que hacen! \"@juankiruedafcb: @jamesdrodriguez Cuantas menciones te llegan cada min?wow jajaja te he hecho como 4 y no respondes ninguno. Los leo todos \"@oscardra: @jamesdrodriguez @sanint_j a todos dos les gano en el pes 2012jejejejeje yo juego mucho...\" Ojo que yo juego bien pes  jajaja \"@guadraos: @jamesdrodriguez vos en ese PES 2013 vas a salir con muchos atributos\" entonces a comprarlo pues jaja saludos! \"@AniCapizzi: @jamesdrodriguez Un mensaje para los hinchas de Banfield ... ¿?\" Siempre en mi corazón! \"@Sanint_J: @jamesdrodriguez jugando PES 2012. Ahí me acabó de eliminar el Porto de la Europa League\" jajaj me gusta mucho jugar pes 2012. \"@LaProfeCorral: @jamesdrodriguez Te gusta venir a Ibagué? Acá te queremos muchoo.\" Claro me gusta ir, bonita ciudad! \"@nenitawwe: @jamesdrodriguez que musica te gusta ??? ;)\"  de todo un poco! \"@ivanmartelo: @jamesdrodriguez Gracias por haber nacido en Colombia!\" Yo feliz! porque nací en un hermoso país. \"@krlosCASH: @jamesdrodriguez hola james, escuchando musica para relajarme y descansar, existos!!\" Buen plan! Saludos. RT @Jhankfutbol: @jamesdrodriguez Crack, saludos desde Santa Marta, toda la buena vibra para ustedes, recuerdo un Envigado-Unión, tú de  ... \"@EvelinDiSol: @jamesdrodriguez viendo @YomeLlamo por @CaracolTV recomendadisímo gozasss de lo bueno con tanto talento que hay!!!\" Es verdad Hola como están, que hacen en este momento? Yo haciendo hielo y masaje para recuperar rápido de la intensa jornada de hoy! Sandra, Andres Esteban,  Andres Felipe , Federico y Daniel. Los nuevos nominados de #MásActitudMásEnergía con @PonyMalta_ Quién ganará? Un gran saludo a Juan Manuel Correa el ganador con #MásActitudMásEnergía de la semana en http://t.co/14HEIqHB hay que verlo! Estas dos cosas tienen que ir a donde voy,la biblia que es importante y por supuesto la música que no puede faltar! http://t.co/Rk2LcarX Les comparto esta foto antes del entrenamiento de la mañana, feliz dia! http://t.co/1XkEWcDe Nuevo avatar con la amarilla puesta. Feliz noche hora de descansar! en un rato estaré hablando con @dani3palacios en el @carteldelamega atentos! Ya en la concentración, Reencuentro con compañeros y buen ambiente. Que bonito es estar con la Selección. RT @Velandia5: @jamesdrodriguez Parcero Fue Un Gran Gusto Haberme Tomado La Foto En El Aeropuerto El Dorado Con Ut, Que Calidad De Perso ... \"@Davixito: un saludo a mi pana @jamesdrodriguez Bienvenido a la nevera papá!\" Gracias parcerito, abrazo Feliz!! un nuevo llamado a vestir los colores de mi selección. Una nueva oportunidad para dar lo mejor. RT @dani3palacios: SALUDOS A @jamesdrodriguez Y BIENVENIDO A COLOMBIA!!!!!!!!!!!!!!! ESPERO ENTREVISTARLO EN SU PROGRAMA FAVORITO @Carte ... #noalterrorismo http://t.co/6E1p8xX6 RT @NoticiasUno: Recompensa de 100 millones de pesos ofrecen las autoridades por  informaciones que permitan establecer los autores del  ... Es triste y lamentable lo que esta pasando en Bogotá, Las imágenes son impactantes! Mucha gente inocente sufre. #nomasguerra Feliz cumpleaños ala mujer que me dio la vida @MARJAJUA gracias por tanto mami. Disfruta este dia tan especial! Que les parece esta foto Con algunos de mis compañeros de equipo. Excelente foto http://t.co/YNAqkSMa Es emocionante todo esto! http://t.co/RwCT9Kl1 Impresionante la gente festejando en la avenida dos aliados! #somosporto http://t.co/uWHfXS3Z \"@daaniloluiz: @jamesdrodriguez booooora jao! Eh nooiz\" e isso jao! Bora Queremos muito os adeptos nos Aliados para festejarmos todos a vitoria de uma luta muito grande!! http://t.co/BrHJP1QS Se cerró esta temporada de forma satisfactoria para todos y con un buen resultado, Gracias por el apoyo. atentos vienen fotos! \"@jasonlizarazo: Es un Honor portar la Camiseta de este gran Jugador @jamesdrodriguez Gracias/ disfrutala, saludos! Hola a todos, hoy Río Ave vs FC Porto 18.30h Pt, 12.30h Col. Último partido de liga 2011/2012.  Feliz sábado! Juan Miguel, Mateo, Alejo, Oscar y Sebastian son los nominados\naquí pueden votar por ellos #MásActitudMásEnergía http://t.co/I6l1syX0 Los premios #MásActitudMásEnergía  tienen ganadora de la semana Laura Ximena Ramírez aquí la pueden ver http://t.co/0S6lUyZX Que bueno es tener la oportunidad de interactuar con ustedes. Un abrazo! \"@kike_caballero: @jamesdrodriguez saludos desde España jamessssss! aki tienes un admirador español que ama colombiaaaaaa\" que bueno, abrazo \"@NELSON0519: @jamesdrodriguez saludos desde Yarumal antioquia.\" Upa!! yarumal, saludos. \"@teresacarvalhoo: @jamesdrodriguez solo un hola? todos los portistas estan contigo! #somosporto\" um abraço a aos adeptos do fcporto \"@JoseAlfredoRD: @jamesdrodriguez saludos viejo James, no se te olvide el gol olímpico en la Pony.\" Nunca me olvidare de ese gol. \"@AngieVargasP: Yo también quiero un saludo de @jamesdrodriguez que transforme mi energía en actitud!:D jajajajajaja\" que gracioso, saludos RT @DJguty: @jamesdrodriguez No solo los hinchas d Banfield te admiran acá en Argentina,tu juego también nos llena a los hinchas d otros ... \"@Palomino05: @jamesdrodriguez James, nunca se olvida el golazo que le hiciste a Lanus!!!, Abrazo Campeón!!\" Yo tampoco me olvido. Abrazo \"@terne77: @jamesdrodriguez Saludos desde Medellin!!! Saludos, ciudad que también llevo en el corazón! \"@IAmJuanEsteban: @jamesdrodriguez seguis al Envigado?\" Obvio, equipo donde me hice todas las inferiores y pude debutar en primera. \"@PatriciaDfrts: @jamesdrodriguez quiero un saludo tuyo ! :) Abrazo desde Francia Idolo !\" Buenísimo desde francia también. Saludos \"@Carolaygarciaj: @jamesdrodriguez Yo se que me lees, jajaja sludes desde Barrancabermeja. :*\" los leo a todos! \"@Caritopako: @jamesdrodriguez Eres un ejemplo para las nuevas generaciones, mi hijo de 8 te admira' saludos a tu hijo! RT @maykol0209: @jamesdrodriguez huy papa que humildad viejo de los poquitos que se toman un tiempo para saludar los seguidores vacano p ... \"@jorgeoso_: @jamesdrodriguez james deberías de visitar Cúcuta !!\" Saludos ala gente de cucuta, ciudad donde naci! \"@NataBuritica: @jamesdrodriguez q orgullo Colombiano, q jugador! Pero leyendo sus tweets me doy cuenta q es una personota; muchas gracias \"@julisandoval89: @jamesdrodriguez james, si se acuerda cuaando estudio en el tolimense en ibague???\"Claro que si me acuerdo! Saludos \"@hernantala: @jamesdrodriguez James el domingo se juega banfield vs Lanús , danos tu apoyo\" desde aquí haciendo mucha fuerza al taladro! \"@dayis0403: @jamesdrodriguez james y a tu fan #1 no le dices nadita? Jejeje\" gracias por el apoyo! \"@_ComeGalletas: Saludos desde ibague @jamesdrodriguez eres un crack!\" Ibague ciudad que siempre va estar en mi corazón! \"@luisM92: @jamesdrodriguez crack saludos desde Cali, sos ídolo\" saludo a la gente de cali. \"@JOVENESGENEVIC: @jamesdrodriguez Hola cordial Saludo. Dios siga derramando salud y bendiciones a tu vida y familia!!!!\" Igualmente para ti \"@NachoIba: @jamesdrodriguez Te preocupa la situación actual de Banfield? que opinión tienes?\" Quiero que salga del momento en que esta! \"@DanielaFD1: @jamesdrodriguez boa sorte James , apoiamos-te em tudo , és um idolo,/ muito obrigado \"@Jessica_PinedaM: @jamesdrodriguez Bendiciones James Desde Barranquilla :) Lo Mejor Para Ti♥\" en barranquilla me quedo! Jaja saludos \"@larry04037951: @jamesdrodriguez mostro lo amamos en este país\" jajaj uy gracias, que orgullo! \"@josebon54850924: @jamesdrodriguez desde@buenaventura te deseamos buena suerte james\" saludos. a la gente de buenaventura! \"@LuiizFigueroa: Apoyando La Fabrica Colombiana c: @jamesdrodriguez\" así tiene que ser, saludos! Seguimos preparando el último partido de la temporada frente a Río Ave, la idea es acabar la liga de la mejor manera. Un saludo para todos! Felicitaciones a @falcao y Amaranto Perea que ponen la bandera de Colombia en lo más alto. #orgullocolombiano Cómo están sus pronósticos para la final de la #UEL? Yo haciéndole fuerza a mi amigo @FALCAO desde acá enviándole energía positiva! \"@jhonnyrivera: @jamesdrodriguez que buen comercial parcero, un abrazo http://t.co/C4lzFWcW\"gracias jhonny, abrazo! RT @PLinero: Yo deseo que todos mis pensamientos, palabras y acciones, que todas mis respiraciones, todos los latidos de mi corazón sean ... Hola a todos, hoy día de descanso por aquí ando leyéndolos y viendo fotos de las que me envían. Ustedes qué hacen? @cristianboni1 @luisfmuriel24 saludos! Mis respetos y admiración para un excelente profesional que hoy se despide de los aficionados en San Siro. Grande Iván Ramiro Córdoba! Para todos los aficionados que amablemente están atentos a mi carrera, aquí una palabras http://t.co/ZAAmGJYU Una imagen de la fiesta ayer en el camerino. Pueden ver más aquí https://t.co/EX7H2Itb http://t.co/RhROpx0b \"@MARJAJUA: Otra fotico...linda la imagen no? @Juana_VR @jamesdrodriguez #dani http://t.co/n5HdQXn2\" hermosa foto! Festejando despues de un gran triunfo, les dejo una foto con la copa. Como siempre con la bandera de mi pais. COLOMBIA! http://t.co/17JASDv3 Hoy FC Porto Vs Sporting 20:30Pt - 14:30Col será una linda noche! Abrazo para todos! http://t.co/xG5IBqdP Premios #MásActitudMásEnergía cada vez se ponen mejor. Aquí los nominados de esta semana http://t.co/nw3n9dOg participen y voten Buenisimos! El ganador de esta semana en Los Premios #MásActitudMásEnergía de @PonyMalta_ es Yeison Ricardo Pineda vean el porqué http://t.co/sS5qHeID Este sabado a festa e no dragao! Vamos todos celebrar a conquista deste titulo no jogo frente ao sporting. Impresionante mas de 400.000 seguidores. Es un orgullo contar con su apoyo! Gracias \"@Guille_Raffetti: @jamesdrodriguez  me gusta mas esta, que golazooo. Abrazo Banfileño crack!!! http://t.co/wPux1I1O\" gracias, abrazo! Que les parece esta foto? A mi me gusta, esta buenisima! http://t.co/a0ghdf7a Aquí les dejo un detrás de cámaras del comercial de @PonyMalta_  #MásActitudMásEnergía http://t.co/CUnLhII1 Me cuentan si les gustó! Se viene el clásico en Manchester, Buen fútbol para ver! United o City? A quién le van? \"@PonyMalta_: ¡Felicitaciones! a @jamesdrodriguez por su buen desempeño con el balón y porque ahora es #PortoCampeón\"// Gracias por el apoyo RT @Davixito: http://t.co/TKFYYJmJ @jamesdrodriguez \"Promesa hecha realidad\" lo dice MARCA “@abelaguilart: Felicitaciones a @jamesdrodriguez por el titulo en Portugal, un abrazo hijo jajaja”  jajajja abelito gracias! Abrazo #PortoCampeón aquí la noticia http://t.co/AqOqToJz. Gracias a todos por el HT #JamesCampeón lindo detalle. más adelante fotos de ayer “@dani3palacios: @jamesdrodriguez felicitaciones desde Colombia!!!!!!!!!!!!!!!!!!!!!” gracias dani, saludos! Impresionante la gente hoy! http://t.co/tib0VDXJ Quedamos Campeones y hay que celebrarlo, #Portocampeon y #JamesCampeón a Full en sus Tweets. Gracias Por su apoyo en este logro! Agora e so no dragao! Bora a festejar gente Muy feliz un titulo mas en mi carrera, agradecido con DIOS por disfrutar esto. #PORTOCAMPEON #SOMOSPORTO CAMPEÕES CAMPEÕES NÓS SOMOS CAMPEÕES!!!” #SOMOSPORTO RT @pasion_naranj: Recordando a @jamesdrodriguez en @EnvigadoFC #Somoscanteradeheroes http://t.co/ixLl7MZn “@josedeva20: @jamesdrodriguez uhhh que carpa Dios!!! Todo bien flaco????” hola josesito ya te sigo papa, abrazo! “@AMRG_21: @MARJAJUA sera que llego a los 320 antes de que termine el mes, gracias por tu apoyo jajajajajja ☺” vas a llegar, yo te apoyo! 3 puntos muy importantes, estamos cerca del titulo! Marítimo Vs Fc Porto HOY (20:15Pt, 14:15Col) como una Final. Un saludo para todos y gracias por el apoyo. Muy dificil la elección de los nominados a los premios #MásactitudMásenergía ingresen a http://t.co/nw3n9dOg y voten por sus preferidos Con todo preparado para enfrentar mañana al Maritimo, Ya estamos en Madeira para este compromiso. @daaniloluiz boa conversa, agora a Descansar bem. Abraco mano! RT @daaniloluiz: Terminando o jantar cvsando com meu amigo @jamesdrodriguez ! Daqui a pouco voltamos aos quartos para descansar bem ! \"@juanopardo: \"@jamesdrodriguez:  que lindo seria volver a verte con la de #Banfield, gracias por el futbol James\" gracias, lindos recuerdos \"@dani3palacios: @jamesdrodriguez chevere saludos desde Colombia. desde @CarteLdeLaMega\"saludos daniel,excelente el cartel. Esta buenisimo! Estrenando Avatar. Qué tal? Todo sobre los premios #MásActitudmásEnergía aquí http://t.co/14HEIqHB pronto los primeros nominados! Gracias a todos los que han dado \"Me Gusta\" aquí http://t.co/Jcvuhw2H ya somos más de 400.000 increíble apoyo. Ahora a descansar, no olviden ingresar a http://t.co/14HEIqHB ahí todo sobre los premios #MásActitudMásEnergía los invito! RT Buenas semifinales dejó la #UCL y una gran final se vivirá en Múnich. Ustedes qué opinan? Para ustedes quién acompañará en la Final de #UCL al Chelsea? \"@PonyMalta_: Hey! ya vieron la invitación para participar en los premios #MásActitudMásEnergía http://t.co/r0eE1orA\"// No se los pierdan! Imagen del partido pasado frente a Beira-Mar, Saludos a todos. http://t.co/6QaxpWLb Buen entrenamiento el de hoy. Un saludo para todos ustedes aquí estoy leyéndolos un rato. Veo en los comentarios que el video de @PonyMalta_ les gustó. Se hizo con #MásActitudMásEnergía Ya transformé mi energía en actitud y aquí está el video http://t.co/7NpKrPbZ con @PonyMalta_ Grande triunfo, vamos paso a paso en busca del titulo. Faltan tres finales! #somosporto Hoy vuelve la Liga, FC Porto Vs Beira Mar (21:15 Pt 15:15Col) con el mejor ánimo, Bienvenido todo el apoyo! Les presento a Manolo, el mejor amigo y nuestra compañía aquí en casa! http://t.co/GMydc0YO @falcao Una fiera! goleador tigre. Hola, por estos días preparando el partido del próximo sábado contra Beira Mar en El Dragao por la Liga Portuguesa. \"@carlosrojas21: Saludos a @jamesdrodriguez bacano mostro hablar con vos, no dejas tu humildad !!! Siempre en contacto\" abrazo carlitos! Hola, feliz semana futbolera. Paso a dejarles un saludo y como siempre agradecer sus mensajes. Extrañando la comida Colombiana salí a buscarla y aquí la encontré. (Restaurante La Fonda - Madrid) http://t.co/bAu24dFI Por aquí ando leyendo mensajes. Este fin de semana no hay competencia pero seguimos entrenando para el remate de temporada! RT @LINCPAL: @jamesdrodriguez felicitaciones parcero!! Jejeje Gracias por todos sus mensajes! Un año lleno de motivación y apoyo en sus palabras es una gran premio y compromiso para ser cada día mejor! #James1añoentwitter RT @JFCadavid: César Pastrana Presidente de Santa Fe y James Rodriguez, algunos de los que ya pusieron un granito en la recuperación de  ... Quiero compartir con ustedes este video http://t.co/UlPXKFIq un año donde su apoyo siempre se sintió. Si les gusta RT #James1añoentwitter Porto. Ciudad con mucha historia, lindo lugar para visitar. Recomendado! http://t.co/BmH1KNwy \"@pasion_naranj: Recordando a @jamesdrodriguez en @EnvigadoFC #Somoscanteradeheroes http://t.co/mmw55LfZ\" lindo recuerdo. Importante resultado #somosporto a seguir así. Hoy partido por la Liga, Braga Vs FC PORTO (20:30 Pt, 14:30 Col) partido importante, su apoyo se siente. Preparando todo para llegar de la mejor manera al importante partido de mañana por la Liga. Reciban un saludo muy especial. Disfruten su semana, yo a seguir entrenando para el partido de liga. Nos estamos hablando. Muchos de ustedes entran en una semana de merecido descanso, qué hacen?, qué planes tienen? Felicidades a las familias que en Colombia hoy celebran el regreso de sus seres queridos. #libressiempre Hola, les comparto esta foto del fin de semana pasado hay muchas más en https://t.co/1vmVUsfd  http://t.co/MEyBxwjb Un gran saludo para todos, gracias por sus mensajes, hay que seguir así. Aquí les dejo fotos y vídeos de ayer  https://t.co/1vmVUsfd Hoy por la Liga FC Porto vs Olhanense a las 19h Pt, 13h Col. El apoyo de ustedes se siente desde donde estén! Buenos chistes, gracias a todos aquí me quedo leyendo y luego a descansar. Mañana vuelve la Liga! \"@MICHAELORTEGA_8: @jamesdrodriguez saludos, sabes que fue una experiencia linda jugar junto a ti, bendiciones\" igualmente, abrazo michael. RT @G_YepesGalvis: @jamesdrodriguez - Que aburridos son ahora los programas de la tele! - abuelo, no es la tele, estas mirando el microo ... RT @HumorColombiano: ¿Quieres venir a mi casa a ver una película? —Y si, ¿no me gusta la película? —Nada pues, te vistes y te vas. @jame ... RT @sebas08marin: @jamesdrodriguez abuela que hizo la marihuana que estaba en mi cuarto? : mijo eso se lo llevo el pato donald RT @sebastianperez9: @jamesdrodriguez Dato curioso: El 98% de las mamás escribe la contraseña en usuario. Jajaja RT @camilodaza97: @jamesdrodriguez señor deme una cerveza brava No señor no hay pero si quiere le emputo un tutti frutti jajajaja :D RT @FelipeMuBe: @jamesdrodriguez Un Hombre tan Ñato, que se callo de frente y se raspo los ojos.. Jajaja RT @Sandythar: @jamesdrodriguez Di #NoAlLicor, es perjudicial para la salud, produce alucinaciones..............Me lo dijo un elefante r ... RT @ManuelOchoa8: @jamesdrodriguez mas peligroso que un barbero con hipo RT @anittabustos: @jamesdrodriguez En la escuela, la maestra dice: A ver Luis, ¿cómo te imaginas la escuela ideal? ¡Cerrada, maestra! RT @Peterturixo: @jamesdrodriguez Dos locos jugando a las adivinanzas: - ¿Adivina que tengo en la mano? - ¡Un elefante! –No vale, ¡lo viste! RT @MariaCla09: @jamesdrodriguez Mi amor, yo no estaba tan borracho —¿No pendejo? Mataste a mi tortuga diciendo \"SOY MARIO BROS\" RT @NP_90: @jamesdrodriguez Más peligroso que un odontólogo con el mal de Parkinson...hehehehe RT @Milehernandezp: @jamesdrodriguez  -Ayúdeme doctor sufro de amnesia, todo se me olvida. -¿Y desde cuando sufre ese malestar? -¿Cuál m ... RT @Lina_Tejeiro: @jamesdrodriguez Una mujer tan fea tan fea! Que le cantaban Quihubo quihubo... Quihubo quihubo.. Jajajajajajaja RT @Davixito: @jamesdrodriguez Un tipo a una señora: Verdad que a Ud le dicen Campana?, y ella: Ay noo sea tan ton tin! Jejeje #ff para @HumorColombiano buena cuenta para reírse! Apropósito que chistes tienen por ahí, RT a los mejores. Mi primer #ff de hoy es para mis dos amigos @PipeeeG10 y @JorgitoPineda02 saludos. Gracias a #adidas hoy tuve la oportunidad de compartir con muchos aficionados. Genial el apoyo! aquí la imágen http://t.co/DdPiQL5H Un saludo para todos ustedes, gracias por el apoyo permanente, como siempre bienvenidos todos los mensajes. Feliz domingo para todos, Hoy Paços Ferreira Vs FC Porto (20:15Pt) (14:15Col) cada partido una final! En el Fútbol Colombiano fin de semana de clásicos, disfrútenlos en familia en el estadio. Unidos todos por unos #clasicosenpaz Aquí me quedo tomando nota de sus recomendaciones. Ya quedo actualizado en todos los géneros. Gracias. @susoelpaspi gracias por el consejo paspi, las voy a tener en cuenta! Escuchando un poco de música, cuales son sus 5 recomendadas para actualizar mis listas! RT @elMousetro: @jamesdrodriguez caricatura de este mostro del fútbol http://t.co/X9bVwxXI Gracias por las fotos, caricaturas, dibujos y todas esas muestras de apoyo. Talento grande el de ustedes. Abrazo! \"@zivanehoyos: en homenaje a @jamesdrodriguez (que espero entregarle personalmente algún día)  http://t.co/NtREPtyP\" gracias. Hola a todos, este domingo una nueva jornada de la Liga para defender el liderato. Noticias | James Rodríguez http://t.co/4yQQrxVv Feliz Cumpleaños a @lincpal un amigo en Colombia que siempre trae la buena vibra. Hola, hoy benfica vs fc porto 20:45pt  15:45col partido por la  Taça da liga. Hola, que tengan una excelente semana, nosotros preparando el clásico por la Taça da liga frente a Benfica. @daaniloluiz e isso mesmo mano, abraco Hoy Nacional Vs FC Porto por La Liga Portuguesa, (19H Pt, 14HCol). Partido muy importante. Abidal: admiración es lo que se siente por alguien que como tú las lucha todas. Fuerza! #animsAbidal Rumbo a madeira, Mañana partido por la liga. Buenas noches, paso a dejarles un saludo. Como siempre muchas gracias por sus mensajes. Aquí los veo a todos! Bueno amigos gracias por las historias, que tengan feliz noche! http://t.co/Mcqwdk13 aquí 13 historias de cábalas en el fútbol hola, cómo van con su martes 13?… alguien tiene una historia para contar? Un saludo para todos, hoy quiero recomendarles a Gilberto Garcia @alcatraz2720 buen defensa del Deportivo Pasto en Colombia. Hoy por la Liga Portuguesa, FC Portó Vs Académica, 20:15PT, 15:15Col. Su apoyo siempre se siente. #somosporto De nuevo viene el fútbol, el próximo sábado frente a Académica. Hemos entrenado fuerte para defender la Liga. A las mujeres feliz día, son la inspiración. A los hombres a consentirlas, protegerlas y respetarlas, son nuestra felicidad. #EL_CHOCÓ_NECESITA_PAZ como todo el resto del país, pero por estos días esta región aun más. Apoyemos #colombiasomostodos Hoy entrenamiento temprano y en la tarde estudio, ahora me sentaré un poco en la compu! Cuéntenme, como fue su día? He recibido muchos mensajes este fin de semana, quiero darles las gracias a todos por escribirme, ahora mismo estoy leyendo! Noticias | James Rodríguez http://t.co/x9KZzcVd también el video de en mi web Gran triunfo el de hoy, un buen resultado que hace feliz a nuestros hinchas, Un abrazo! Os 3 pontos de hoje sao muito importantes para o titulo, um bom resultado que deixa feliz os Portistas. Esta vitoria e de todos!! Ya en Lisboa junto al equipo, esperando la hora del Clásico Benfica - FC Portó (20:15PT, 15:15 Col) #somosporto Noticias | James Rodríguez http://t.co/jPF6VNQy ...Todo Listo, rumbo a Lisboa Se hizo una presentación muy positiva, hay que continuar por este camino. Buenas noches a todos! #colombiasomostodos Con la camiseta puesta hasta en el avatar, un saludo a todos. Bienvenido todo el apoyo de parte de ustedes para esta noche. Una buena práctica, un buen grupo, ponerse esta camiseta siempre eleva al máximo la motivación, Un abrazo a todos. Viaje largo, pero ya en Miami junto al grupo, mañana actividad Feliz Noche! Hoy un buen trabajo para el equipo para lograr los 3 puntos. Ahora a unirme a Mi Selección Colombia. Hoy FC Portó Vs Feirense 20:15 PT. 15:15Col acompáñenos #somosporto 350.000 Fans en Facebook una motivación más https://t.co/1vmVUsfd Hola un saludo para todos. Siempre atento a sus mensajes. Les dejo este video http://t.co/FwIbqLwN abrazo! Buen día, Hoy Mancity - Fc Portó (17Hr Pt) (12Hr Col.) La mejor actitud siempre! Un nuevo llamado. Que alegría se siente vestir de nuevo los colores de mi país. #colombiasomostodos RT @Davixito: @jamesdrodriguez en la más reciente edición de la Revista Fútbol Total presentando miCoach la nueva tecnología d adidas ht ... Un saludo para todos, buen resultado ayer, seguimos en competencia por la liga local. Mañana viaje a Mánchester por #UEL Hoy vitoria setubal vs fcporto 18:15pt 13:15col partido importante para seguir luchando por el titulo. Todo listo para el partido de mañana por la liga, seguimos trabajando concentrados. \"@AndreaAguilarD: @AndreaAguilarD @jamesdrodriguez Pliisss Una Mencion Para Esta Niñaaa Q Te Admira Tantooo\" muchas gracias, saludos! \"@daaniloluiz: Boom diaa! Ja pegando pesado aqui na fisioterapia pra voltar o mais rapido possivel! Forca mano,Vais voltar rápido! Hola como están? Yo por aquí leyendo esas buenas cosas que siempre escriben RT @msueldo27: http://t.co/a6rG0yhl vía @youtube Video de Adidas, nuevas secuencias en las que aparece @jamesdrodriguez RT @MARJAJUA: Hoy mi primer #ff es para mis dos grandes amores. que día a día traen felicidad a mi vida mis hijos @jamesdrodriguez @Juan ... Hola amigos,Hoy fcporto vs mancity 20:05pt 15:05col. Día especial, siempre con buena energía. #somosporto \"@Davixito: HOLA, ES PARA MI UN GUSTO PRESENTARLES A @JUANA_VR , UNA PISTA ES LA HIJITA LINDA DE @MARJAJUA ;)\" bienvenida a la onda twitter! Mañana de vuelta a la competencia internacional en la Uefa Europa League, partido muy importante. Adidas ya me envió los nuevos F50, me gustaron mucho y a ustedes? http://t.co/EzT62k9W @daaniloluiz vamos fazer um grande jogo! #forcaPorto RT @daaniloluiz: Boa noite amigos! Estou aqui ao lado do fera @jamesdrodriguez indo para o jogo! Vamos em busca da vitoria, certo mano?  ... Hoy fc Portó vs ud leiria 20:15pt 15:15col siempre con buena energía. #somosporto Le deseo una pronta recuperación a @trencitoval  ya regresaras con toda, animo y fuerza! Entrenos con mucho frío pero muy alegres. Feliz Viernes! http://t.co/eVBrYaKb Le deseo un feliz cumpleaños a mi amigo @FALCAO dios te bendiga tigre! Feliz día a todos los periodistas que con responsabilidad llevan al mundo la información y con profesionalismo su opinión. RT @CamCardozo: @jamesdrodriguez con Messi, dani Alves y otros en este comercial de ADIDAS http://t.co/eIzCDUDM  #Seleccioncolombia Entrenando fuerte esta semana para las competiciones que vienen, Un saludo para todos. RT @PLinero: Tarea: no tengas miedo al sacrificio esa es la base para el triunfo. Muchas gracias por sus mensajes y por mantenerse atentos a los partidos. Feliz semana! Hoy Fcporto vs v.setubal partido por la Taça da Liga,18:30pt. 13:30col. FELIZ DOMINGO! Mañana partido por Taça da Liga, Vamos con muchas ganas para dar lo mejor, Sigan atentos! #somosporto Hola amigos, leo un falso rumor sobre mi para el Fútbol Argentino. Recuerden todo lo oficial lo sabrán por aquí y por mi web, Feliz Día! Un saludo para todos los que cada viernes me dan #ff muy amables por recomendar mi cuenta. \"@luisfmuriel24: @jamesdrodriguez ayudanos a @cristianboni1 y a mi jajajaja un abrazo a los dos\" igualmente muri, saludos! \"@cristianboni1: Quiero llegar a los 6.000 seguidores pa alcanzar a mi amigo @jamesdrodriguez #jajaja ayudenmen un abrazo\" jaj abrazo boni! Los que querían premios en Ibagué @Futboltop10 tiene un concurso imperdible, cuénteselo a un amigo futbolero, Saludos. http://t.co/TPxlUe12 Tuve la oportunidad de ver sus mensajes uno por uno,gracias porque  en cada palabra siento un cariño especial. Eso me llena de felicidad! Estoy leyendo sus mensajes, ustedes que hacen? @fguarin13 se te va extrañar calidoso, pero estas dando un paso muy importante en tu vida. Ojalá todo salga  de buena manera. Éxitos! RT @Futboltop10: @KEVINROLDAN y @jamesdrodriguez nos recomiendan, nosotros los recomendamos a ellos por que son \"Lo máximo, lo mejor\" Hoy gil vicente vs fcporto 19:15 pt 14:15 col partido fundamental, energía de la buena para hoy. Feliz fin de semana a todos. Ya con fútbol colombiano andando para seguirlo en la distancia. Apoyen sus equipos en los estadios y en paz. RT @jcgallegokr: @jamesdrodriguez un saludo parcero gracias por el apoyo a@KEVINROLDAN y mi gente en ibague recuerden visitar la canchas ... 300.000 seguidores, que bien, un buen motivo para hacer las cosas cada día mejor. RT @fguarin13: buen día gente ya casi llegamos a los 100mil quería pedirles q me ayuden con un RT para q mi cuenta sea verificada #guari ... Será que llegamos primero a 300.000 seguidores en twitter o 350.000 en Facebook https://t.co/1vmVUsfd qué dicen? Buen cartel de fútbol hoy por la TV,Cómo están sus pronósticos hoy para el Derby? Mi cuenta ha sido verificada por twitter, agradezco a todos difundirla. Esta es la oficial, la única. Gracias. Hola amigos, las fotos y vídeos del juego de ayer están en mi facebook oficial http://t.co/YTueOPsg Abrazo para todos. RT @Yulianakemp: @DaniyJames Esta no es la cuenta de Dani Ospina... Ella no tiene Twitter.. @LINCPAL @jamesdrodriguez ayudeme para bloqu ... Buen resultado contra un equipo muy difícil, lo importante era ganar. Hay q continuar por el mismo camino! #somosporto Feliz Domingo. Hoy FC Portó Vs v.Guimaraes 18.15 Pt 13.15 Col. Están todos invitados, su buena vibra siempre se siente. A todos en Banfield Feliz Cumpleaños, ya son 116, que orgullo hacer parte de su historia, los llevo en el corazón, abrazo para todos. @Futboltop10 Que buenas canchas! Yo jugué en Ibagué allá, todos deberían ir! Buenas! Amigos para seguir en contacto de manera segura apoyo #jamesverificado agradezco sus RT, Feliz Viernes! ya saben, en lo posible tendré premios para ustedes que siempre están apoyando. De nuevo gracias nos estamos leyendo. A los ganadores Felicidades! los contactarán vía e-mail los amigos del http://t.co/Co7GhOUe #superfansjamesrodriguez para acordar la entrega 3er Ganador de www.jamesrodriguez.com.co se llevá #laamarilla de mi selección. #colombiasomostodos hoy la gana Angela Rodríguez de Bogotá ;) 2do ganador de www.jamesrodriguez.com.co se gana una camiseta del FC Porto firmada, la #19 es de Camilo Andrés Loaiza Cardozo de Manizales. 1er ganador de www.jamesrodriguez.com.co Harold Mauricio Amaya Triana de Floridablanca gana Balón Adidas con autógrafo, Felicitaciones! ya tengo los 3 ganadores, elegidos al azar entre el grupo de registrados. Antes de los nombres. A todos gracias por seguirme y estar ahí Hola en 40 minutos el sorteo de www.jamesrodriguez.com.co 2 camisetas oficiales y un balón solo para los que se registraron. Atentos Hoy Fc Portó Vs Estoril juego por Taça da liga Pt 20:45. Col 15:45, Saludos! \"@mario2rubio: en vacaciones con @jamesdrodriguez http://t.co/2WUzw3kU\" sos grande tio jajaj saludos! Aquí junto a @cristiano gran persona, RT si les gusta, abrazo! http://t.co/scc3agWe ya están en mi facebook oficial las fotos y los vídeos de la dupleta aquí les dejo el link http://t.co/YTueOPsg Feliz domingo para todos, muchas gracias por sus opiniones y mensajes. Siempre bienvenido el apoyo! Buen sábado para todos, Hoy FC Portó vs Rio Ave por Liga Portuguesa, 20:30 Pt, 15:30 Col. No se lo pierdan! RT @msueldo27: @jamesdrodriguez hola estamos cumpliendo un año www.elanalistadeportivo.com.ar info de Fútbol y Marketing. Puede ser un r ... “@Juanpex7: Un abrazo mi llave @jamesdrodriguez ,mañana con toda a ganar!! Éxitos!”// Gracias, ojalá sea así, un saludo para tí. \"@JorgitoPineda02: #ff es para los pánitas @jamesdrodriguez @PipeeeG10 @StivenOchoa los quiero mucho Dios los bendiga'' saludos hola amigos, un saludo para todos. Recuerden el sorteo de los premios de www.jamesrodriguez.com.co es el 20 de Enero RT @jesicacediel: Familia hoy  los invito a seguir a la fundación @col_somostodos de @jamesdrodriguez que apoya a niños menos favorecido ... RT @gemelasdavalos: Los invitamos a seguir a @col_somostodos la fundacion de @jamesdrodriguez que apoya a los niños menos favorecidos!!  ... \"@richylizarazo79: @jamesdrodriguez pero en el Portó porq seguirán siendo tridente en la selección.\"  Ojala que si, saludos! Compartiendo un almuerzo en madrid con @FALCAO y @fguarin13 #extridentecolombiano jajajaj Saludos! http://t.co/ynMSRPaG Gracias por la buena onda en sus mensajes y sus buenos deseos! Un abrazo. semana de  entrenamientos, pero por aquí ando leyendo sus mensajes,ustedes que hacen? Feliz noche, empieza una nueva semana, la mejor energía para todos ustedes. Abrazo. Para sonreir con buenas frases sigan a @MisterPhrases buenos pensamientos y reflexiones! Hola a todos he publicado nuevas fotos en mi Facebook http://t.co/YTueOPsg también pueden verlo por www.jamesrodriguez.com.co Abrazo. Hoy Sporting Vs Fc Portó 20:15 Pt, 15:15 Col. Primer partido del año, no se lo pierdan. Bienvenida la buena vibra. Gracias por compartir conmigo este rato! Abrazó para todos nos estamos leyendo “@Vitocosanchez: @jamesdrodriguez #FF para un grande bendiciones y exitos orgullo colombiano// #ff para todos ustedes que me escriben “@EnriqueFragozo: @jamesdrodriguez con el nuevo proyecto de la seleccion esperamos exitoss.. CRACK” gracias, ojalá sea así “@JulianaFCB9: Te deseo dos cosas en la vida: TODO y NADA. Todo lo que te haga feliz y nada que te haga sufrir.\n…\"// Mil Gracias “@JAINERBARROS: Brother, Sería chévere si me enviara saludos” Saludos que estés bien. “@hugofeg: http://t.co/NV70ZZm0     todos a votar !!!”// Como siempre gracias por sus muestras de apoyo y aprecio. “@DiegoMenendezV:  saludos desde Perú maestro! Metele un RT”// Saludos a todos en Perú, Colombia, Argentina y todos los q me escriben “@Jouleysi_18: Que Lindo que saques tiempo para tus seguidores .! Un beso y 1001 Bendiciones...// gracias a ustedes por sacar tiempo para mi \"@AllisonFdzC: @jamesdrodriguez estoy essperando tu respuestaaaaaaaa!!\" Son muchos mensajes pero los leo a todos, saludos. \"@JAINERBARROS: @jamesdrodriguez: Le deseo muchos éxitos y bendiciones para este nuevo año 2012, Un Abrazo desde Ciénaga, Magdalena\" “@ValentinaPonceM: ...#Colombiasomostodos es un buen ejemplo de todo lo que eres!// Gracias @col_somostodos “@davidthtetto: James eres un orgullo del Tolima Saludos desd Melgar conoce Melgar ? nunca responde mis tweets :S ?” Claro, saludos! \"@CangrejeradPyP: @jamesdrodriguez Te extrañamos en banfield espero que algun dia vuelvas muchas exitos y feliz año. “@diego_torres7: quiero la camisa de James Casanare-colombia”// regístrate en www.jamesrodriguez.com.co sorteo 20 enero \"@MejiaDaniella: @jamesdrodriguez muy bonita labor la de #ColombiaSomosTodos muchos éxitos para ese gran proyecto!\" “@AndreRios2: le respondesss. A todo el mundo menosss a mi☹”// no es eso, son muchos para responder pero a todos los leo. saludos \"@AndreaaMarin: @jamesdrodriguez Que este año solo sean éxitos para la @Seleccion_col para el #Porto y para ti.\" Muchas gracias! “@marcosspg: ¿Para la gente de Banfield que no deja de extrañarte?”// es mutuo, se les quiere y recuerda. “@AndreaCaHerrera: … exitos en tu vida y felicitaciones por todo lo que has logrado,Dios te llene de bendiciones”// gracias igualmente “@CamiloTorresL: Saludo desde Cali James!!!! necesitamos ir al mundial”// si tenemos que trabajar unidos para eso. “@achacon31: TODO BIEN JAMES DE LA MANO DE SU ZURDA Y DE PEKERMAN VAMOS PAL MUNDIAL PANITAAA”// todo el apoyo para él. “@Davixito: ...apenas para jugar un partido en @Futboltop10 las canchas de Ibagué donde juega @jamesdrodriguez cuando viene”// recomendadas “@tommyrf: eres grande, mi idolo, haz um gol mananã por toda la nacion portista , RT por favor ! #somosporto” //ojalá se de gracias “@LauraDan_n: Oye eres un gran jugador!, que tengas un buen año y que todas tus metas se hagan realidad! c;”// igual para ti Antes que todo gracias por sus saludos y mensajes de esta semana. Atentos vamos con unos RT ya! El año empieza con premios, 1 camiseta de Portó, 1 de selección y Balón. 20 de enero sorteo para registrados en www.jamesrodriguez.com.co “@Futboltop10: Ya vinieron? La cancha está disponible reservas abiertas, llamen ahora.//En Ibagué lo mejor aprovechen las vacaciones para ir Gracias por todos sus deseos de año nuevo, motivan mucho. Listo el primer entreno del 2012, empezamos trabajando. Y Ustedes que cuentan, cómo empezaron? El 2011 fue un gran año, el próximo será mejor con buena energía y fe! Feliz 2012 para todos! RT @GolCaracol: Con ustedes: @jamesdrodriguez, el 10 de Colombia http://t.co/AqlyTIBa Lo mejor del año en nuestro especial #GolesyJugada ... Hoy de vuelta a Porto, Gracias a todos los que hicieron de esta visita a Colombia algo tan especial! Abrazo. Gracias a los medios de comunicación y a todas las personas que han estado atentas al lanzamiento de @col_somostodos, vamos por buen camino. http://t.co/vbeoSoAh - twitcam ahorq En pocos minutos Twitcam atentos! Hoy haré Twitcam, estén atentos entre 3 y 4pm desde el lanzamiento de @col_somostodos #colombiasomostodos RT \"@col_somostodos: Llegó el día en que Fundación Colombia Somos Todos pasa de ser un sueño a una realidad.\" Así es! Les dejo un Saludo de Navidad en www.jamesrodriguez.com.co Feliz Noche, disfrútenla en familia! http://t.co/DBs5NT0G RT @col_somostodos: Hoy junto a @jamesdrodriguez en el Hospital Federico Lleras en Ibagué http://t.co/92DfiWPk RT @col_somostodos: He publicado una nueva foto a Facebook http://t.co/gh4RBfj1 Hoy tuvimos la oportunidad de entregar algunos obsequios con @col_somostodos en Ibagué! http://t.co/KznEuWKm RT @col_somostodos: Hoy un equipo de la Fundación en compañía de James Rodriguez Oficial entregó algunos obsequios a niños del... http:/ ... RT @JarviAugusto: @jamesdrodriguez te recordamos mucho, aun la memoria de esos goles olímpicos y esa magia en la marte. Desde Teleantioq ... Para los que quieran ver, hay más fotos del recuerdo de la Pony en www.jamesrodriguez.com.co sección imágenes/otros. Les dejo otra foto de la Pony, grandes recuerdos, apenas para la Navidad. http://t.co/jthG1WMG Un recuerdo muy especial para todos estos días de Navidad! http://t.co/w8YdcR1f RT @JohnGaNissa: @jamesdrodriguez esta entre las 20 figuras europeas para este 2012! http://t.co/W5iZ7jCz vía #COMODEBESER! Es un orgullo poder dar estos detalles y poder ver la sonrrisa de cada uno de ellos. http://t.co/VydtPpLE Me llena de felicidad ver alos niños recibir regalos y apesar de su limitaciones son felices! http://t.co/uF6YHU1r RT @luisfmolina: @jamesdrodriguez La única forma para ser grande, es ser pequeño. Siga con la modestia que le caracteriza y llegará lejo ... RT @JoseSarmiento: Me acabé de encontrar de frente a @jamesdrodriguez! Buena, loco! Bienvenido de vuelta a Medellín! Les dejo una foto con @sperez_24 gran persona y excelente jugador. http://t.co/flhEGOcS El Fútbol Colombiano hoy tiene nuevo campeón, que gané el mejor y que se celebren en paz! Quien sera el campeón? RT @Futboltop10: Vista a la cancha de fútbol Top 10, desde el campo de juego. http://t.co/ItWpoZ8X \"@AndreaGuerreroQ: Adivinen a quién ve Neo mi #amigofiel? Cc: @jamesdrodriguez http://t.co/92f1Nnat\" que bueno,jajaja saludos! Gracias por escribir sus deseos en #estaNavidadquiero síganlo haciendo con mentalidad positiva que sus sueños se cumplen. RT @anagabriel_37: #138 #estanavidadquiero que la fundación @col_somostodos salga adelante y pueda cumplir el sueño de muchos niños @jam ... RT @AMRG_21: @jamesdrodriguez #estanavidadquiero comer buñuelo, natilla, tamal, lechona, y entregar regalos junto a toda mi familia. RT @juanky1990: #EstaNavidadQuiero un RT de @jamesdrodriguez. Jajajaja! RT @JorgeDAVILUNA: @jamesdrodriguez #estaNavidadquiero pedir No mas Farc, no mas corrupcion, no mas invierno, mas futbol, mas alegria, p ... RT @TeffiKassner: @jamesdrodriguez #estanavidadquiero que no maltraten mas a los animales inocentes de cualquier cosa!! RT @mabelRIKOBgcc: @jamesdrodriguez #EnEstaNAvidad NO Quiero Mas Niños Tristes Quiero Que Todos Disfruten Sin ViolencIa Sin Inundaciones ... RT @Liesery25: @jamesdrodriguez #estanavidadquiero que los que estan ausentes, puedan venir y estar en familia. RT @DavidEstebanTu: @jamesdrodriguez #estanavidadquiero pasarla en familia, por que este es el único mes que se la pasa alado de los mas ... RT @DanielCastaeda3: #estanavidad quiero estar con los amigos y familia @jamesdrodriguez RT @WilTetto: @jamesdrodriguez #EnEstaNAvidad Quiero Que Liberen a Todos Los Secuestrados Que Esta Privados De Sus Familiares :( #estaNavidadquiero sacar adelante el proyecto de @col_somostodos y ustedes que quieren? RT para los mejores q usen el HT RT @EduardoOrtiz95: Tarde d futbol con los primos n las chanchas d @jamesdrodriguez n #ibague @Futboltop10 q buena grama http://t.co/5Wn ... RT @JRodriguezPT: @jamesdrodriguez a veces nuestros sueños son imposibles, así como tener una camiseta tuya es imposible. por eso dame s ... RT @MisterPhrases: Nunca te rindas si crees que lo puedes lograr. Puede ser difícil y larga la espera, pero al final todo valdrá la pena. Igual felicitar a patriotas, si esta en la A es por que es un buen equipo y merecía estar en la máxima categoría del fútbol colombiano. No es bueno para el fútbol colombiano que un grande como el América este en la B. Ojalá regrese rápido ala A,fuerza ala hinchada del América \"@eduardomdiaz: Gracias parcero @jamesdrodriguez q buen detalle y q gran jugador http://t.co/CMpHrgPE\" de nada! Saludos. RT @col_somostodos: Ayuda a @teletoncolombia fácil sms al 8888 Comcel con texto 5000, o ingresa a www.todosporlateleton.com y Banco de B ... RT @eduardomdiaz: Listos en porto para el juego en el estadio do Dragão con @klvin_03 y @daoc1983 FcPorto @fguarin13 y @jamesdrodriguez  ... Hola, hoy fcporto-maritimo 20:30pt 15:30col. Siempre con buena energía, no se lo pierdan! Hoy empieza la novena de aguinaldos, época para estar en familia, a disfrutarla! \"@MisterPhrases: #FF para @JamesdRodriguez excelente futbolista, selección de Colombia. Es una gran persona y amigo. Síguelo!\"Gracias,abrazo RT @dani3palacios: @jamesdrodriguez MUCHAS GRACIAS POR LA INVITACIÓN QUE ME ENVIÓ PARA EL LANZAMIENTO DE SU FUNDACIÓN COLOMBIA SOMOS TOD ... Para los que gustan del fútbol en cancha sintética sigan a @futboltop10 excelente opción en Ibagué Para ustedes cual va ser la final del Fútbol Colombiano este año? Nuevo avatar, les gusta? para ganar uno de estos solo hay q estar registrado en www.jamesrodriguez.com.co y esperar el sorteo http://t.co/9Z6EpOws \"@dani3palacios: @jamesdrodriguez que bueno que oiga @CarteLdeLaMega, siempre la escucho, un abrazo! RT @ifilosofia: No te preocupes por la gente a la que no le agradas. Disfruta a aquellos que te quieren. @CarteLdeLaMega escuchandolos desde portugal,voy con un miedo al entrenamiento jajajaj saludos! Un día como hoy levantamos la copa con CA Banfield, un abrazo para todos los hinchas del taladro! http://t.co/60jOEIL7 @col_somostodos necesita apoyo de Empresas y Marcas para el desarrollo del primer proyecto. Contacto col.somostodos@jamesrodriguez.com.co Todas las menciones que me hacen a @jamesdrodriguez las pueden ver en mi web www.jamesrodriguez.com.co en tiempo real,gracias por el apoyo! Buena semana para todos, se acerca la época de Navidad, disfrútenla en familia! Ya en mi web www.jamesrodriguez.com.co la noticia y el vídeo del gol de ayer, gracias por estar pendientes! Un triunfo muy importante el de hoy, da mucha mas confianza para lo que se viene. A seguir así! Hola amigos, hoy beiramar-fcporto 13:30col, 18:30pt. no se lo pierdan,Muchas gracias por la buena onda! Recuerden que en www.jamesrodriguez.com.co regalaré 2 camisetas oficiales y 1 Balón entre los que se registren, no se los pierdan! Quiero agradecerles por los mensajes y apoyo que ha recibido @col_somostodos con la ayuda de todos lograremos buenas cosas. Llegaron premios a www.jamesrodriguez.com.co Regístrense y participen por la #19 del Portó, la oficial de selección  y un balón adidas Desde la distancia, pero con mucha energía apoyo la causa #nomasviolencia Nuestro país merece la paz, los buenos somos más. Hoy #UCL  Portó Vs Zenit. Col. 14:45, Port 19:45. Con muchas ganas de seguir adelante. Gracias por el apoyo. Hola un saludo para todos, muchas gracias por la buena vibra que envían y ahora más, Mañana #ucl por la clasificación. RT @col_somostodos: Buenas Tardes, este es nuestro twitter oficial agradecemos a todos el apoyo para adelantar este proyecto orientado a ... Los invito a seguir @col_somostodos y en facebook http://t.co/Tt8cO7hD Bienvenidos a este proyecto social, Mi fundación! RT @Davixito: Siguiendo ya y con mucha energía a @col_somostodos es la oficial de la fundación de @jamesdrodriguez Un #ff para todos los que han entrado a mi página web www.jamesrodriguez.com.co veo que les ha gustado! Vamos todos a votar para que el tigre este entre el once ideal de la fifa.. Lo merece! http://t.co/RRrjX9lF @R9FALCAO Seguiremos sacando mas funciones en www.jamesrodriguez.com.co hasta ahora que tal? Les gustó? www.jamesrodriguez.com.co está es su primera etapa, día a día iremos conociéndola más. Hola el apoyo de ustedes me animó a crear a www.jamesrodriguez.com.co mi web oficial, gracias por seguirme! Y Bienvenidos! Estén muy atentos ya se acerca la hora para presentarles mi página oficial!... Les estoy contando! http://t.co/Xwdb8YKo Hola un saludo para todos, hoy dia de descanso... que tengan una excelente semana! RT @PLinero: Aceptemos hoy a Jesucristo como el Dueño y Señor de nuestro corazón y vivamos para El. Que se nos note que somos suyos en l ... Un excelente resultado que da confianza para lo que viene, muchas gracias por el apoyo y sus palabras! Hoy FC Porto Vs SC Braga 13.15 Col - 18.15 Port. #somosporto la mejor energía se siente! Conteo regresivo, un gran saludo para todos! http://t.co/0uQJmyDo Un saludo para @davixito el pana del Marketing y la publicidad, recomendado! Abrazo. Feliz viernes para todos, se acerca Diciembre y con el varias sorpresas, muy atentos! Hoy día de recuperación! Un saludo para todos twitteros, siempre atento a lo que me escriben! Gracias! Conseguimos un importante resultado de visita, a seguir así Conseguimos um bom resultado ,  muito orbigado pelo apoio! ágora vamos pensar no braga. Forca! Hoy Champions #UCL Shakhtar Donetsk vs FC Portó, Col.14.45-Port 19.45, a todo! Bienvenida la buena vibra! Buen entreno el de hoy, mañana #UCL partido definitivo! @lorepulecio Buenas #tardesw saludos a todos los oyentes de tu programa! Hola, desde Ucrania con mucho frío,el miércoles partido de champions league, abrazo para todos! Gracias por todos estos mensajes, la muestra de cariño de ustedes es increíble! RT @Mr_Tudd: Todavia no me olvido el golazo de @jamesdrodriguez a newells cuando jugaba en Banfield, gol importantisimo para el campeona ... RT @Augusgabi_97: @jamesdrodriguez Gracias James por el buen fútbol. Que hoy  escasea, lo demostras desde que jugabas en banfield saludo ... RT @data_futbol: @jamesdrodriguez Crack regalanos un RT para este nuevo portal de futbol con toda la informacion y analisis del futbol m ... \"@alexram0411: @jamesdrodriguez el talento no tiene edad...gracias crack por ese bonito fútbol que parece se esta acabando\" gracias, saludos RT @ROrtizCayon: @jamesdrodriguez Hace unos días conocí un francés quien me preguntó de dónde era. \"De Colombia\". Me dijo: \"Colombia!!!  ... RT @GersonMartinezp: @jamesdrodriguez siga trabajando como lo hace que tarde o temprano  quienes lo critican termnarán valorando su trab ... \"@MariajoMoratto: @jamesdrodriguez leelo porfis ; Sin (cont) http://t.co/ppLlFbHk\" ya lo lei, muchas gracias! Saludos. \"@JEstrada_21: @jamesdrodriguez Gracias O James, #grandeabrazo Calidad, Dios te Bendiga mijo !!\"Igualmente, #grandeabrazo Feliz domingo y buen inicio de semana para todos! Semana importante en todo sentido! RT @PLinero: Tarea: pensar bien de las otras personas Ya en Porto, a reanudar trabajos porque el fútbol no para. Un saludo gigante a tanto aliento positivo! Hay que seguir trabajando, no es un camino fácil pero siempre daremos todo por lograr la meta y así será! Hoy es un buen día para entregarlo todo #colombiasomostodos Sigan muy atentos al concurso \"Piensa Rápido\" en mi facebook http://t.co/WKYIbHag y el de #fcf_adidas mañana se eligen ganadores! RT @PLinero: Te invito a confiar en ti mismo, en Dios y en los que te aman, ese es el primer paso para construir un proyecto de vida lle ... RT @MARJAJUA: Con mi monito te amo♥ hijo http://t.co/hubxIyyM Hola, quería agradecerles tantos mensajes que llegan con ese apoyo incondicional, la buena onda sigue arriba! Fuerza @fguarin13 vamos para delante guarito! Optimismo al 100% somos locales y tenemos todo por lograr #colombiasomostodos y vamos con más fuerza #colombiasomostodos esa es la frase hoy! Feliz viernes! Para ganarlo entren al FB #fcf_adidas http://t.co/g28yt5xi y den su marcador en el post del balón http://t.co/6NRgzB98 RT @LSPiwi: Visitando al compadrito @jamesdrodriguez en el hotel http://t.co/Sglta0qr Feliz noche, ya se acerca la hora del partido, gracias por todos esos mensajes con buena vibra siempre bienvenidos! #fcf_adidas me entregó los nuevos Adizero f50 prime con micoach! http://t.co/7TFPxmu9 RT @susoelpaspi: En Barrasquilla me quedó con la selección! Vasmos pa Brasil Leo, los muchachos y yo!! #vosteimaginas  @jamesdrodriguez  ... Les traisgo un cosmesdiante que hace tirar mucha caja! Jajajaja aquí con @susoelpaspi http://t.co/zBInE8EB Buena energía para el entreno de la tarde, acompañados de la gente barranquillera! RT @LINCPAL: Cambio de avatar!! Con la camiseta puesta #colombiasomostodos Empieza una semana de buen trabajo, ahora de locales con todas las ganas! Gracias por el apoyo #colombiasomostodos El ambiente de selección es excelente, recuerden que en mi facebook http://t.co/WKYIbHag hay premios de #fcf_adidas Les va a gustar! por estos días con la amarilla los acompañaré con este nuevo avatar!... qué tal, les gusta? Ya en Colombia, con muchos deseos de hacer las cosas de la mejor manera. Un abrazo para todos! Hola amigos, buena vibra eso es lo que me llega de ustedes  Olhanense Vs FC Portó, (Col 3.30 pm- Port 8.30pm) RT @PLinero: Bendiciones para todos, hoy con las ganas de ser feliz y decidido a gozarme este día. Dios nos acompaña a todos. Animo Feliz viernes y un buen fin de semana, muchas gracias por todo el apoyo que día a día se siente. Un #ff para todos ustedes Atentos, estos premios imperdibles. Den Me gusta a http://t.co/QjTInRi1 y http://t.co/g28yt5xi http://t.co/ofLMzPMD Una nueva oportunidad para dar lo mejor #colombiasomostodos pronto nos vemos. Muchas gracias a todos los que han votado por mi aquí http://t.co/elSbiVyy en la nominación que me hicieron a #Goldenboy. Abrazo! Un feliz cumpleaños para la linda Medellín que siempre se lleva en el corazón! Querían premios? Muy Atentos a estas páginas de FB ahí les estaremos contando como ganar http://t.co/6hAvtBPr y http://t.co/RujNJGYB RT @PLinero: Tarea: qué estás haciendo para crecer y mejorar? No vale perder el tiempo en lo que nos hace decrecer! Con la mejor energía y el apoyo de todos ustedes Hoy #UCL Apoel Vs Fc Porto (Col 14.45) (Port 19.45) Fuerza! RT @colombiagol: #GoldenBoy | En este #LINK pueden votar por James Rodríguez | @jamesdrodriguez | Está abajo y no tiene su foto | http:/ ... RT @colombiagol: #GoldenBoy | James Rodríguez nominado para el premio \"Balón de Oro SUB 21\", junto a Alcántara, Wilshere, entre otros |  ... RT @fguarin13: Dando el paseo habitual con @jamesdrodriguez #palito #hulk #kleber abrazos.. http://t.co/L9Pensfs Como les va en halloween?... Quien se anima a mostrar el disfraz? Ya en Chipre, ahora a descansar, un saludo para todos. feliz domingo a todos, que hacen en estos momentos? hoy viaje a chipre el martes #ucl. Atentos /@lorepulecio Esta noche #SalsaConEstilo con @jhpelaez http://t.co/ihIIPh4U @WRadioColombia A las 8pm... Bueno amigos ustedes saben como es esto, dar RT a todos es muy difícil pero aquí me quedo viendo sus mensajes, abrazo! RT @Rute_09: @jamesdrodriguez solo un RT nada mas :) Por favor IDOLO! =) RT @MoniiCobos: @jamesdrodriguez Que dice mi mami que si por favor me das RT hahah... Un abrazototote... muacssss RT @MaguideBanfield: @jamesdrodriguez desde Banfield te deseamos lo mejor en tu carrera y te extrañamos tanto! RT @DebateTodelar: @jamesdrodriguez Un saludo y una felicitación especial de todo el grupo de El Gran Debate de Todelar... RT @Nathaliaparada: @jamesdrodriguez Muchas bendiciones estamos super pendiente de los partidos dandote mucha bna vibra saludos desde Cu ... RT @Edisonrodriguez: @jamesdrodriguez  ey parcero un saludo y mucha suerte para todo  lo que falta,  desde Envigado. RT @AdrianaGomezQ: @jamesdrodriguez espero que este sea solo el comienzo de muchos exitos, besos y abrazos. RT please RT @AndrezzTP: james ando estudiando fisica y no entiendo nada, un RT depronto me motive mas jeje saludos desde ibague sos grandee @jame ... RT @oskymarin: @jamesdrodriguez es un gustazo seguirte y saludarte... Sos un orgullo para este país. Abrazo desde Medellín. RT @alxsports: @jamesdrodriguez Gran partido James, ahora punteros. Exitos en Portugal y exitos con la seleccion de Colombia. Acá un fan ... RT @javittobernez: @jamesdrodriguez Parcero Un Abrazo, Gigante desde el Huila!!! Mil Exitos.. RT @maurolopez12: @jamesdrodriguez saludos auno de los mejores futbolistas del pais¡¡¡ buena vibra¡¡ RT @DiegoSandoval23: @jamesdrodriguez Sigue asi nos vemos en quilla en el partido con venezuela! vamos por los 6 puntos. RT @colombiagol: @jamesdrodriguez Un abrazo muy grande James. Esperamos verlo con más éxitos en FC Porto y la Selección Colombia. Merecido! RT @JonaAlmeira: @jamesdrodriguez escuchá esta cancion, es mia, canto yo, http://t.co/YEEoEv87 criticas y RT por favor! gracias!!!! Hola twitteros, aquí súper conectado, voy a dar unos cuantos RT, envíen sus mensajes ahora! Fin de semana de Halloween, ya tienen listo el disfraz?... De que es? Bienvenidas las fotos! Buen partido hoy, tres puntos importantísimos. A seguir así!! Hola, Nadie sabe de lo que es capaz hasta que lo intenta! Hoy fc Portó vs pacos de ferreira 20:15 pt 2:15 col. buena vibra para hoy. Desde aquí un gran saludo a esa buena representación de deportistas que tenemos en los panamericanos #colombiasomostodos Muchas gracias por la buena vibra en sus mensajes por el premio. Siempre hay que buscar nuevos retos! RT @LINCPAL: @jamesdrodriguez Felicitaciones por ese premio y los que faltan, segui asi parcero que sos una gran persona!! Abrazo. Hola, les comparto el título #dragao de Oro Revelación que recibí del Club Gracias por la buena onda http://t.co/KRmxGaqL Si no sueñas, nunca encontraras lo que hay mas allá de tus sueños! Que tengan una excelente semana. Llena de éxitos! Feliz Domingo, Rumbo a Dragao, Fc Portó Vs Nacional 18.15 (port) 12.15 Col. Fuerza!! Hoy entrenamos, tenemos competencia el fin de semana, y ustedes que hacen? Estoy en este momento súper conectado leyéndolos, un saludo para todos! @PLinero que buenos mensajes y consejos le das ala gente sobre DIOS. Saludos! RT @ifilosofia: Cuando pierdes, no te fijes en lo que has perdido, sino en lo que te queda por ganar. RT @Gol_Caracol: ¡Vea Porto vs. Apoel por el http://t.co/ML1MRfU0 a la 1:35 pm! http://t.co/9YdWXqS0 Hola amigos hoy con toda la energía, fcporto vs Apoel 19:45 PT 1:45 COL no se lo pierdan! #ucl RT @PLinero: Señor sabes cuales son nuestras batallas de hoy, te pedimos nos des tu fuerza para vencer y vivir en tu presencia. Te confí ... Mañana Champions league, #UCL todo listo para afrontar este duro encuentro. Estoy muy agradecido con todas sus manifestaciones de cariño y buenos comentarios. De verdad q son un gran impulso cada día. RT @ifilosofia: Cree en tu propio éxito, y lo obtendrás Les había prometido sorpresas aquí la primera de ellas, un buen espacio para los mejores fans,  http://t.co/DTPLiM1Q RT @EnvigadoFC: Este recuerdo del ascenso 2007 con #JairoPalomino, @Gio10_Moreno @jamesdrodriguez @PabonDorlan... #SomosCanteradeHéroes  ... Hoy están de celebración en 2 lugares que quiero mucho FELIZ CUMPLEAÑOS a la gente de @EnvigadoFC y la ciudad de Ibagué, ambas son mi casa. Mensajes como el de #fcfadidas http://t.co/7IqMXfnD junto a los que recibo de cada uno de ustedes invitan a seguir #dandotodoporelpais Feliz viernes para todos, Yo ya integrado en el equipo. Y ustedes en que andan? Ya me encuentro en Porto, desde mañana comienzo actividad con el equipo. Feliz noche a todos, hoy demostramos que #colombiasomostodos Gracias por todos sus mensajes que también pueden dejar en http://t.co/6hAvtBPr RT @R9FALCAO: No hay que conformarse con los resultados obtenidos, hay que trabajar día a día para lograr nuevas metas en la vida! Mucha ... Un resultado muy valioso, empezamos de la mejor manera en este sueño de todos. Gracias a todo el equipo y a ustedes los que siempre apoyan! RT @fguarin13: Buen día gente..hoy inicia la corrida por un sueño.. #colombiasomostodos.. Bendiciones.. http://t.co/xiUce3xN Hola amigos buen día, Hoy #Colombiasomostodos Ya nos encontramos en La Paz, un saludo grande para todos en Colombia, muchas gracias por todo el apoyo brindado. Abrazo! Feliz semana para todos, hoy viaje a La Paz, Bolivia.  Empieza el gran reto! Buena noche twitteros, les dejo esta foto con @LINCPAL y @carocruzosorio. Buena visita! http://t.co/Ay76AyRO Muchas gracias a @FCJamesBta @dayis0403 @FCJamesRMedel @iloveJAMESdr @TeamJamesRo y todos los q siempre están ahí http://t.co/pxvSbuwk Hoy la gente vino al entreno y recibimos calurosos saludos y mucho apoyo, muchas gracias! Hoy visitamos a los más grandes hinchas, los del corazón más valiente. http://t.co/G5HjSqbp Buen fin de semana para todos, ya desayunando para ir a entrenamiento, esto cada vez está más cerca! Hoy noche de viernes que hacen los twitteros?.. Yo estoy leyéndolos! un #ff para todos ustedes que siempre con el apoyo nos hacen sentir que #colombiasomostodos Llegando de entreno, seguimos preparando el primer partido que está cada vez mas cerca, #colombiasomostodos Muchos me han pedido twitcam, concursos de camisetas y más... Pues les cuento que todo eso vendrá junto a una sorpresa q les estaré contando Para todos ustedes que me llenan de buena onda, les dejo esta foto con @gio10_moreno http://t.co/Sr5eoXZH Hoy tuvimos entrenamiento a doble jornada, buenos compañeros, gran grupo! #colombiasomostodos Ya en Bogotá, listo para empezar trabajos y unirme al grupo de selección, gracias por los mensajes. Ahora a ponernos la amarilla, mañana desde muy temprano viaje a Colombia para iniciar el gran reto! #colombiasomostodos Logramos un buen resultado para el liderato, el equipo funcionó muy bien, gracias a todos los que nos siguen por estar atentos! Hola amigos hoy liga zon sagres academica-fcporto 20:15 pt 2:15 col la buena onda llega! No se lo pierdan. Llegó el Fin de Semana, les deseo un buen descanso a todos. Hola, muy feliz con la noticia, es una oportunidad muy anhelada y Gracias a ustedes por el apoyo permanente. Muchas gracias por esos mensajes de apoyo para este partido, Los espero mañana  a las 11:00am Col. - 17:00 Port.  Zenit -fc Portó #UCL Ya nos encontramos en Rusia, hoy descanso, mañana entreno y el miércoles nuestro segundo partido de #UCL contra el Zenit. Rumbo a St Petersburgo, Rusia. El miércoles Champions league, #UCL éxitos para todos! Hola amigos, feliz resto de domingo. Se viene una semana llena de expectativas y grandes retos. RT @ifilosofia: Cada ser humano tiene, dentro de sí, algo mucho más importante que él mismo: su don Gracias por las recomendaciones,pero mejor voy a ver atl de madrid vs barca. Excelente partido para disfrutar del buen fútbol. Noche de cine, cual me recomiendan para ver? Mi primer FF es para todos los seguidores del Porto, hoy estaré desde la tribuna con ellos enviando la mejor energía para ganar! RT @ifilosofia: Si quieres triunfar, no te quedes mirando la escalera; empieza a subir escalón por escalón, hasta q llegues arriba RT @ifilosofia: Solamente lo bien hecho resiste al tiempo. Solo lo creativo Alcanza el futuro. Semana de entrenamientos y buen trabajo, paso a dejarles este pequeño saludo y un gran abrazo para todos! RT @lorepulecio: @caracolradio transmitirá partido entre Barcelona vs A.de Madrid este #sabadonuestro 100.9 con @rafa_cifuentes @diegono ... RT @PLinero: Dios tiene que ser lo primero en tu vida. Hazlo y verás su Gloria y victoria posarse en tu vida. Su Palabra se cumple siemp ... Hola, Aquí les dejo una foto Con alvaro 'palito' pereira. Quería compartirla con todos ustedes. http://t.co/Qg0p6yW8 Hola amigos, nueva temporada, nuevas fotos aquí http://t.co/WKYIbHag en mi Facebook Oficial! Abrazo! Hoy leyendo sus mensajes, atento a esa buena onda que siempre tienen conmigo! Gracias! RT @PLinero: Tarea: aprovecha tu Dia siendo feliz Hola amigos,Hoy fcporto vs feirense 18:15 pt 12:15 col. la buena energia es importante, No se lo pierdan. Hoy los Colombianos celebramos el día del amor y la amistad, espero que todos tengan un día muy feliz lleno de buenas sorpresas. Llegó el fin de semana, un #ff para todos los que lo van a disfrutar con sus seres queridos y buen fútbol. Hoy día de descanso, mañana volvemos a entrenamientos, y el domingo otra ves partido por la liga. Abrazo Se logró el objetivo, 3 puntos en casa nos dan confianza. La Champions es una gran experiencia! Gracias por la compañia #UCL Hoy la cita es en la Champions, los espero con la mejor vibra, Porto Vs  Shakhtar Donetsk, Por.19:45, Col. 13:45, #UCL Mañana emprendemos uno de los grandes retos de la temporada para el equipo y en lo personal un sueño #UCL Para los que no han visto el gol de ayer, aquí se los dejo, abrazo para todos! http://t.co/Zohkn9n Hola, aqui les dejo una foto   con @fguarin13 http://t.co/FNSXYsy Feliz fin de semana para todos y muchas gracias por sus mensajes. RT @FCPorto_Vzla: @jamesdrodriguez James, nos regalarias un RT? Somos de Venezuela e informamos sobre todo lo relacionado con el Porto.  ... Les dejo esta foto con la mencion como jugador del partido! Como siempre gracias por su apoyo! http://t.co/DikLJHa De nuevo se logró hacer una muy buena presentación gracias al trabajo en grupo y al buen nivel de todos en el equipo!"}