{"tweets": "This clip makes me happy and hopeful. Enjoy your weekend! https://t.co/uBSuLWQQH0 Some things go together and some things don’t. @TheKalenAllen #OMKalen https://t.co/gG9gWUcYHx Who’s ready for more #GameofGames?! We’re back January 7th!! https://t.co/7wW3q24wCF .@KristenBell gave up a BIG secret about #Frozen2. @KenJeong https://t.co/0fK8zbgKPr .@WinnieHarlow surprised one of her biggest fans... who really needed to hear from her. @ashleygraham @ellentube  #WeAreFearless #ThanksSponsor https://t.co/HmWgvYb3zv .@KristenBell’s kids are on their way to being the best pranksters of all time. https://t.co/ckqTJma3N5 .@KenJeong is an actual doctor and actually hilarious. #AskDrKen https://t.co/bezhwJvWiM #GreenEggsAndHam is now streaming on Netflix. Who’s ready to go HAM on it this weekend? https://t.co/Oxpujmv1bl\n\nWatch it now! @netflixfamily  https://t.co/xZslMzAyar https://t.co/eUa6rKnhBt The @JonasBrothers WISH they were @DaxShepard and @KristenBell. @kenjeong https://t.co/U9V7GjsFYL These two are so cute finishing each other’s sandwiches. @nickandsienna #Frozen https://t.co/e0xGrxW3BY For a while I thought @SteveCarell was only going to answer with one word. #BurningQuestions https://t.co/gscc8N826k This was wonderfully weird. #TBT @ZacEfron @taylorswift13 https://t.co/ngv0JpumbP Normally, I don’t kiss and tell, but I had to come clean about this. @HowardStern https://t.co/6RjFxja4h8 .@SteveCarell told me his secret about his @iamcardib commercial, and his plan for an \"Office\" reboot! https://t.co/H0cXnxsUAc I’ve got 5 pairs of tickets to the People’s Choice Awards in Los Angeles! Which of you peoples wants them? #PCAs @peopleschoice https://t.co/KrJYgh4aEy Here’s the powerful first episode of \"Fearless\" Season 2 with @AshleyGraham! I hope you share it with someone who’s ready to make a change. #WeAreFearless #ThanksSponsor https://t.co/Nv7U6f41v2 .@AshleyGraham is very pregnant and is having a… https://t.co/wIIEoE18sG @kerrywashington I would say he was more of a featured background actor. These firefighters were at my house during the fires, and they left me a note. I was very excited to meet them in person. https://t.co/2Ksmk4phvA We now have a rescue fly. https://t.co/cCap3ZQ6y6 #Momsplaining is back with @KristenBell and a whole lot of teenagers. @ellentube @momsplaining https://t.co/Pv9GkUweHA .@KerryWashington loves gazpacho. https://t.co/XDLO8yJvno Everybody wave to @Meghan_Trainor! @MikeSabathMusic https://t.co/cb6uP7MX3S My boobs are up here. https://t.co/B2BoSR7aRQ CC: @jimmykimmel https://t.co/kSIiawfSWd Shia LaBeouf was the perfect person to put in the hot seat to answer my #BurningQuestions, and he did. https://t.co/mpU7YuFvHM This is what kindness looks like. https://t.co/ixVhGXt9cV I meant every word. You ARE an amazing producer, and you have the maturity of a 10-year-old. @andylassner https://t.co/67eIjyDEiO TikTok is so weird and hilarious. Follow me! https://t.co/kUlVYqYRoT https://t.co/dGEpNaU53N Hootie &amp; The Blowfish are BACK with a new song, and it’s really good. @HootieTweets https://t.co/rtGWIJLM2m You may know @JonDorenbos as a football player or a magician from @AGT, but his story is absolutely incredible. \n\nCheck out his #LifeisMagicbook. https://t.co/oavx2jaz6d https://t.co/RVjbRdOgUO Shia LaBeouf told me about his new movie \"Honey Boy,\" and what inspired him to write it. https://t.co/k821U58SWc My \"Greatest Night of Giveaways\" is next month, and it’s gonna be really, really great. Just ask @MichelleObama, @JTimberlake, Jennifer Aniston, @RobertDowneyJr, @MelissaMcCarthy, @MichaelB4Jordan, Jason Momoa, @SterlingKBrown, @ChrissyTeigen, @StephenCurry30 &amp; @AyeshaCurry. https://t.co/YRxzOoJMfM It's #ElectionDay! If you’re in Virginia, Kentucky, New Jersey, Mississippi, or in certain cities across the nation, check your local elections and VOTE. https://t.co/mrWzdBXmtG Happy birthday, @KrisJenner! I hope you get celebrated by all your Jennerations. Great news! The alphabet song just got worse. https://t.co/ekYChrGNPY Well, this is an amazing way to start your week. Thank you, Hollywood Foreign Press Association. https://t.co/LvekeJFht6 Happy birthday, @Bethenny! This Skinnygirl Margarita is for you. .@MayaRudolph makes me laugh no matter what she’s talking about. https://t.co/XifJedBDMq .@AskDrRuth is a very tiny person with a whole lot of sex advice. I don’t know how it all fits in there. https://t.co/ZAlrs6kl7M Happy birthday, @Diddy! I can’t wait to find out what you did for your birthday, or as some people say, do a diddy diddy what diddy do. Reuniting this couple was magic, but the surprise after was unforgettable. @JonDorenbos #ThanksSponsor https://t.co/stV7I8Jg3k Watching a millennial trying to use a rotary phone made me 😂 https://t.co/Ao7NRMjH7q Happy birthday, @KendallJenner! You’re a supermodel and animal lover, just like me. This is sweeter than any peanut butter cup you could ever want. https://t.co/TVH2WXnDLL Sending @TheKalenAllen and @HannahBrown through a haunted house was a wonderful idea. #OMKalen https://t.co/LK7QYN5SLR It’s Friday. You made it. You can do ANYTHING. https://t.co/mFFlvxAxCK The children are our future. And our future is apparently at a strip club. https://t.co/ZD457sFW48 There’s never been a bigger scare fail than when I tried to scare @GarthBrooks. https://t.co/Ozmss7f5I4 I flew these dancers here all the way from Belgium. That’s how good they are. https://t.co/3qTm7BYrth When I found out @MaryConnelly spent $1,000 on a treadmill desk and wasn’t using it, I needed to do something. https://t.co/9lotiJAg75 Happy birthday, @Tim_Cook! Thanks for the sweet gift. I promise I won’t tell anyone. \n\n–Tweeted from my iPhone 12 I was honored to meet the amazing @GretaThunberg.\n\nFind out how you can make a difference: https://t.co/HeDcWcHcTE https://t.co/bqNJV38Ekj It’s true - now you can text me. Here’s my Community number. This is gonna be fun. 310-455-8858 https://t.co/sivV8mtrLQ Anyone know how to get diamond pasties off? Asking for a friend. Here’s an exclusive first look at the #GreenEggsAndHam trailer! You will like it here or there. You will like it anywhere. @NetflixFamily https://t.co/KfkVXJhyGm @lizzo Thank you so much @Lizzo! I promise to not get it twisted. .@AndyLassner loves Haunted Houses so much, I sent him through another one with @Lizzo. Happy #Halloween! https://t.co/BWJzGJy6fr @KelseaBallerini It’s real good. I look forward to this every #Halloween. Here are some of my favorite kids' costumes. https://t.co/EciDDefv16 I’m still waiting for my $20. @iamcardib https://t.co/W6hQ3RSj3m Mackenzie’s scare reflex hasn’t changed a bit. #Halloween https://t.co/LR3s5CUVTu .@TheKalenAllen’s favorite person in the world is @Beyonce… so this happened. #Halloween https://t.co/TM0ttkKq08 Some lucky fans got to watch the show from the GEICO Scarebox! Well, “lucky” is a complicated term here. #ThanksSponsor https://t.co/tVZYlt6whX Jason Momoa really is the King. #Halloween https://t.co/6fxrj6dPHz @iamcardib You made my Halloween. It’s here! It’s here! Oh, happy #Halloween Day. @TiffanyHaddish @AndyLassner https://t.co/Dh2m9Ml5Qv Cardi E is here! And so is her friend, Cardi B. Happy #Halloween! @iamcardib https://t.co/YfSFeMCzHs Don’t miss my costume tomorrow. Any guesses? #Halloween https://t.co/VDlzW4nCUV It’s almost here! #Halloween @TiffanyHaddish @AndyLassner https://t.co/6dcqFzb7Rs Saoirse Ronan’s valley girl impression is perfect. https://t.co/K4hPRqHEsB @halsey Nobody augments reality like you do. Happy birthday, @AshleyGraham! I can’t wait for Season 2 of \"Fearless\"! https://t.co/mO48PqrWgf Need a great idea for a last-minute kid's #Halloween costume? I’ve got you covered. https://t.co/SWC6UKfi3b This performance of “Graveyard” from @Halsey was so cool! https://t.co/gtW2XiN3Mh .@KristenBell recruited Andy Lassner to talk about his favorite subject – lady parts. Check out the new episode of #Momsplaining on @ellentube! https://t.co/dIRD7s1xEI @lizzo I heard a different story. https://t.co/cYd5C7fDx7 It was a big day for @Halsey. https://t.co/2JNw3HB2nb Saoirse Ronan almost ruined this #Halloween scare. https://t.co/y2Aa6UO4Bh Your life really is magic. @JonDorenbos https://t.co/rNgQi5ppyB RT @hbomax: No more searching. The most beloved TV, movies, and family favorites, plus new originals, all on #HBOMax https://t.co/7ZKfi0mWLj RT @hbomax: Little Ellen is the animated escapades of 7 year-old @TheEllenShow in her childhood home of New Orleans is in development. Firefighters are the very definition of heroes. ❤❤ @LAFD #GettyFire I need to meet Story. https://t.co/vN3U1EAtdn I had @CharliePuth interview himself. Don’t ask me how. Or why. But I did. https://t.co/tebtwwBd08 Buckle up. @HowieMandel is my guest host today. https://t.co/YDB87Cp4AM @howiemandel You made me LOL and ROTFL and PMGTHB... that’s when I laugh so hard I hit my head on the keyboard. Don’t miss the exclusive first look at my #GreenEggsAndHam trailer this Friday with your @NetflixFamily. Love, Eggen. https://t.co/VNA342MVDg This week on my #EllenOnTheGo podcast, my Senior Talent Executive and Co-EP @CoreyPalent drops by for the first time, and he’s here for one thing. A man. #IWannaGoInCoreysBox \n\nListen here: https://t.co/TZxLrpfSU2 https://t.co/ADx4BXwFGg What happens when you cross #NationalCatDay with #Halloween Week? \n\n 🎥: @otisandjr https://t.co/7vydst23sx I don’t know if you know this, but I’m on TikTok. Tikkity-tok your way over my page and follow me! https://t.co/kUlVYrgsNt @tiktok_us They just took a DNA test... turns out she’s 100% that bitch, and he’s 100% petrified. Don’t miss this Haunted House this week! @Lizzo @AndyLassner https://t.co/bTO7LsrhXj .@HowieMandel hid in the bathroom and scared people. We had a great disguise for him, but he went his own way. https://t.co/t9pvpVvLs4 The only thing better than a free iPhone is one Jennifer Aniston gives you. https://t.co/GPpUfDSEfO I introduced Jennifer Aniston at the Power of Women lunch. It was powerful. https://t.co/GFWavZnb7o .@RobertIger was President of ABC when I came out on my sitcom. Today we talked about it. https://t.co/CNEkOHyqIp Happy birthday, Julia Roberts! We look good together. https://t.co/Ap4I9KybzL I turned my Skybox into the GEICO Scarebox. #ThanksSponsor https://t.co/D9iDGEIcGi As if Dory wasn’t already sexy enough. https://t.co/8MJzEkpGbr First @HowardStern kisses me, now Jennifer Aniston kisses me. I’m gonna have to set up a booth and charge. https://t.co/xhHHrJtWmn This kid is gonna get you movin’ this Monday. #MondayMotivation https://t.co/IOiahZwhI1 .@CharliePuth is a big fan of the show \"Friends.\" https://t.co/GI5wwmrTSE Best. Week. Ever. @TiffanyHaddish @andylassner https://t.co/Rc9gI1GjKK Find out how this happened. Tomorrow. https://t.co/Y4DwWJXBPE A wonderful world indeed. @ellentube https://t.co/iXL48QsMlZ Happy birthday, @HillaryClinton! I hope you’re partying this hard. https://t.co/PDTTyOFaXW This week I’m sending @AndyLassner through TWO haunted houses. First with @TiffanyHaddish. Then with @Lizzo. I’m so happy. It’s like my Super Bowl. .@official_tWitch and @Ciara can 1, 2 Step all day! https://t.co/88qNVFfJ5P Happy birthday, @KatyPerry! You make me feel like I’m living an early '60s dream. .@HannahBrown told my guest host @JustinHartley if she’s ready to start dating again. https://t.co/9YwlMc4Yxi .@YoungDylan did a rap for CLIF Kid, and I officially can’t even. #ThanksSponsor https://t.co/tPeS8Pn9X1 .@Ciara! You were automatic, hypnotic, supersonic funky fresh on my show today. Happy birthday! https://t.co/wIEyey8kdP .@JustinHartley is a hunk, and 8-year-old Finn Hathaway has a hunk of platinum. I knew they’d be a good duo. https://t.co/CMBg8OdMNk .@JustinHartley is hosting my show today! This was only the monologue, and I’m already crying. #ThisIsUs https://t.co/DiTtXJm1fb I’m ready for #Halloween. I can’t speak for @AndyLassner. https://t.co/sPEk3c7Bzq RT @_brocious: 4 months ➡️ 8 months 🥰 we love our #BEKINDbyellen box!! https://t.co/VMyn4J1LVK .@LoniLove and @iamgreenfield are very good at captioning photos. @official_tWitch https://t.co/22soz0FpbY Happy birthday, @Drake! 33! You started from the bottom, and now you’re here. .@arielwinter1 talked with @official_tWitch about the last season of \"Modern Family.\" https://t.co/mi3dMR7y6S Getting a #Halloween costume has got to be easier. If you see a costume that’s scary for the wrong reasons, send it to me with #badcostumes4ellen. https://t.co/DoawghYsZJ Meeting @official_tWitch feels like a lifetime ago. This was so much fun. Happy #TBT! #SYTYCD https://t.co/wKp8dTDddw ZaZa is back and better than ever. @official_tWitch https://t.co/yZECguQDoa @ericstonestreet @andylassner @MsSarahPaulson @ArianaGrande @chrissyteigen @iamjeanniek He’s never been safer. @DrOz You were wonderful. Text me back if you know what that rash is. @MsSarahPaulson @andylassner @ArianaGrande @chrissyteigen @ericstonestreet @iamjeanniek It should. I’m not done with you yet. No comic wants to bomb in front of Eddie Murphy, but it sure made a funny story for @AliWong. https://t.co/4Dn0bQEBtA I love playing \"Blindfolded Musical Chairs,\" especially with people like Khiara. #ThanksSponsor https://t.co/nVkiB3uR1u We couldn't have 3-year-old Liang Liang fly all the way here from China and NOT teach @TheKalenAllen his dance. https://t.co/BMJxu9XGqb When most people hurt their neck, they take the day off and ice it. When I hurt my neck, I book @DrOz. https://t.co/esrhFXBXRw Happy birthday, @VancityReynolds. https://t.co/fpzHfKd1L4 Happy #TVTalkShowHostDay, @ConanOBrien, @JimmyFallon, @jimmykimmel, @JKCorden, and @StephenAtHome. https://t.co/E57KhhJ9S8 @chrissyteigen @andylassner @MsSarahPaulson @ArianaGrande @ericstonestreet @iamjeanniek You two make a great team. Not a brave one, but a great one. On today’s #EllenOnTheGo podcast, my Executive Producers gave some exciting hints about Andy’s haunted house. I can’t wait, @AndyLassner. @EdGlavin @MaryConnelly @kevinlemanII https://t.co/TZxLrpfSU2 .@Jaden_Reports interviews tennis star @Naomi_Osaka_. https://t.co/LSfncE6wsm I played my game \"Do You Think They Can Dance?\" I did. They could. Well, most of them. https://t.co/Y0HoJ1zAtq Thank you to my friends at @Shutterfly for supporting @JohnKrasinski’s birthday wish. I couldn’t think of a better guy, or a better organization. #JKbday @familyreach https://t.co/6QyyjmE38y .@KeeganMKey told me he’s afraid of spiders. That’s never a great idea. https://t.co/dPCUhfmzkU Happy birthday, @JesseTyler Ferguson! You’re a wonderful, hilarious human, and each of your names would be great for a cat. You all love it. It’s almost time. @AndyLassner’s annual trip through a haunted house. Here’s a look at years past. @MsSarahPaulson @ArianaGrande @chrissyteigen @ericstonestreet @iamjeanniek https://t.co/DWlG7ujTZw .@KeeganMKey reading a Dr. Seuss book as Barack Obama. https://t.co/iayEni0kkY When I ask my writer Lauren how things are going, she usually responds, “Not great.” That gave me an idea for a show. Please enjoy “Not Great\" with Lauren. @pommyrantz @ellentube https://t.co/gTwM3IZN9N I think about what you said on my show all the time. Happy birthday, @JudgeJudy. https://t.co/L4PbsDuQrj Too cool for skull. https://t.co/FvTfhwBg7i This is still one of my favorite moments from the show. You can always watch it on @ellentube! @adamlevine https://t.co/DqyChDQDmc Season 4 of #Momsplaining is here! @KristenBell and Jennifer Garner share some hilarious truths about motherhood. @ellentube @OnceUponAFarm https://t.co/a3xGfzDYJy @johnkrasinski @familyreach Oh, and how would you feel about $20,000 from my friends at Shutterfly? #JKbday @familyreach I already got you a gift card to Macaroni Grill but I guess I can cough up some macaroni for this as well. #JKbday https://t.co/3W2I9pvxcZ I’m very excited about this new Enterprise. @HeadsUp #StarTrek https://t.co/3kJqnF5AcV It was only fitting for @TheKalenAllen to make something with marshmallows, since he was hanging with @marshmellomusic and @KaneBrown. #OMKalen https://t.co/AnFeMhEiPy #Momsplaining is an Emmy-nominated digital series that I couldn’t be more proud of. Season 4 drops Monday on https://t.co/R61fUUUfUk. It’s so good. @ellentube @KristenBell https://t.co/zvoNGJu74F @salmahayek Lupe is still my favorite cake topper. Happy birthday, @ZacEfron. You make the world a better, hotter place. https://t.co/TjwJSIXxYD .@SeanHayes meets one of my favorite 7-year-old kid geniuses, Nate. https://t.co/Y9IST1k2ah .@JennaDewan told my guest host @SeanHayes what she’s been craving in her second pregnancy. I might be pregnant. https://t.co/Ju8Sop7v5y @BebeRexha ❤️ .@BebeRexha performed #YouCantStopTheGirl. I tried to stop her, but I couldn’t. https://t.co/vXsYXl8QHb .@SeanHayes is back as my guest host for the second time this season, and he already wants a raise. https://t.co/jMGLfsRLWH @BebeRexha She’s not lying. Now is your chance to save baby elephants. Here’s how. @HSIAfrica #BeKindToElephants https://t.co/C3ofNYdQoR I played a new game called \"Do You Think They Can Dance?\" Spoiler Alert: Some of them definitely could. https://t.co/6KxdKFzH82 RT @EdGlavin: Happy #SpiritDay from @TheEllenShow! @MaryConnelly https://t.co/spu7g3YEXv @KelseaBallerini Wait for it… Scarlett Johansson’s new Netflix movie is already making my staff cry. #ThanksSponsor @MarriageStory https://t.co/8NSfqeS8Ju Happy #SpiritDay! Show your support for LGBTQ kids by going purple. Thank you, @GLAAD.💜 https://t.co/BMY5lO0YqV My executive producer @kevinlemanII met a viewer while he was drunk at Disneyland, and we decided to reunite them for something very special. https://t.co/jEUDNC97Z2 #Momsplaining is back Monday! Believe me, you need to see it. @KristenBell https://t.co/hNkkEfJfVH Scarlett Johansson has worked with some of the biggest stars in the world... whether she can recognize them is another question. https://t.co/DD5Kpn4e5D .@AndyLassner is the perfect person to deliver this new Be Kind Box to Ilene. #BEKINDbyellen \n\nSubscribe here: https://t.co/z15yzJj3yU https://t.co/0wHAHllKRp Scarlett Johansson has a very big weekend update. @ColinJost https://t.co/rg1VMjdtQi Scarlett Johansson gave me an exclusive look at her new trailer for @MarriageStory. Go grab a kleenex. #ThanksSponsor https://t.co/sAm82jQGQA #RelationshipGoals @JessicaBiel @jtimberlake https://t.co/99dflEuO4r I love when you scare your family and friends. I love it even more when you send me your videos. @ellentube https://t.co/0v1vemdUiF Happy birthday, @Naomi_Osaka_! I’m gonna do something for your birthday that I know you’ll love. I’m not even gonna mention the insane crush you had on @MichaelB4Jordan. Remember? Not even gonna bring it up. @DebraMessing @ellen Thanks, Debra. You’re smart, you’re blessed and can do ANYTHING! Here’s your last chance to vote for me in the People’s Choice Awards! Voting is the most important job we have. I feel like this is excellent practice. Retweet this for a vote! #PCAs #TheSocialCelebrity #TheDaytimeTalkShow https://t.co/zk6DYLAojc Alfie Allen was here to tell me about his new movie and his todger. https://t.co/YVM1Q2uVUX Liang Liang came all the way from China just to dance for us, and nothing has ever been more worth it. https://t.co/iLFpEnDFro If you have my #GameofGames app, you can now play the Halloween challenge for a chance to come to one of my #12DaysofGiveaways! https://t.co/8WXf7r3zw7 https://t.co/IbADIyeLZe I can’t stand how adorable he is. It’s too much. https://t.co/LGYAyzE6pq @JillJelnick @BryceWisdom20 @JudsonFootball @JudsonISD @dianawisdom I’m marching in my living room for you, @BryceWisdom20. It’s pumpkin spice season. There’s a pumpkin, and I’m the spice. If you have a wonderfully horrible picture of your kid in a pumpkin, send it to me with #pumpkins4ellen! https://t.co/nEIpjjsU0z Thank you, thank you, thank you to everyone who helped make #Gorillapalooza possible. We were astounded by the support we received, and feel incredibly grateful. #WeNeedGorillas https://t.co/RKuGZGB4IA It’s just about that time of year... scaring time... https://t.co/9NVK53u3LS My talent executive Lori Blackman was on the #EllenOnTheGo podcast today, and I learned how she booked Julia Roberts on my show. https://t.co/fzxB0efHzP Nicole Kidman, @CharlizeAfrica and @MargotRobbie told me about their incredible new #Bombshellmovie. https://t.co/6eTsTxpRWM @TheEllenFund Thanks to Walmart for supporting #Gorillapalooza, as well as sustainable banana farming, so gorillas can keep their last remaining habitats. Good on ya. #ThanksSponsor #WeNeedGorillas https://t.co/2HWEIEySIm I had the best time at #Gorillapalooza. Thanks to everyone who helped make it so wonderful. @TheEllenFund #WeNeedGorillas https://t.co/7zr9iYeuOd This 3-year-old’s daily affirmation was so adorable, it almost shut down the internet. Now he’s here to shut down my show. https://t.co/nvTStrJp6b Nicole Kidman, @CharlizeAfrica and @MargotRobbie gave me the exclusive first look at the #Bombshellmovie trailer. Wow. Wow. Wow. @bombshellmovie https://t.co/7dTqzM9WmN Tomorrow you’re gonna be smart, you’re gonna be blessed, and you can do anything. https://t.co/c4e0uveKI0 .@HowardStern told me about all of the pot smokers in California. https://t.co/NwyqBxhHkl This is a great idea from @JayShettyIW. #ThanksSponsor https://t.co/oROJyoGIiN I sent my writer Adam to Universal City Walk in a security guard outfit and a “No Photos” sign. This is hilarious. https://t.co/I05hMDONso .@HowardStern was here for the first time. I know it was his first time, because nothing like this has ever happened before. https://t.co/y1J1gaovgp Kids hold the key to the future. Let’s hope they don’t get it stuck to their forehead. Here’s one of my favorite segments, “The Future Looks Bright.” https://t.co/ktMICogrYv Happy birthday, @Usher! Peace up, A Town! .@HowardStern just got married on my show, and bachelor @Colton officiated. Here’s the proof. @BethStern https://t.co/U2lmTxJJPY .@GavinNewsom, this is incredible. https://t.co/PEBpSVlTA8 Tomorrow, @HowardStern does something nobody was expecting... including me. https://t.co/nBEv7Fz6wY Here’s some Halloween costume ideas for ya! https://t.co/KSH8IoLDz7 #Gorillapalooza was insane! Thank you, @thesettingwines, for helping. I don’t wanna name names, but Sofía Vergara enjoyed you a LOT. #ThanksSponsor Is it lunchtime? https://t.co/0T6YbMpfYz RT @ScottIcenogle: Here’s an amazing moment from last night’s “Gorillapalooza” fundraising event, hosted by Ellen DeGeneres &amp; Portia de Ros… Out with my favorite date for my favorite cause. #Gorillapalooza @TheEllenFund https://t.co/2JENH8YNsB Thinking about Matthew Shepard today, and continuing the fight to #erasehate in his honor. https://t.co/fH8eZYYexr .@TheKalenAllen got scared. He got scared good. #ThanksSponsor #OMKalen #Huluween https://t.co/FQyOQLFPEx Have you heard of the #MaskedSinger? Well, on my show we play the #MaskedDancer. It’s totally different. @official_tWitch @NickCannon @NicoleScherzy  https://t.co/D50qfo23oM I guess I need to put a ring on it because I LIKE IT! @official_tWitch @TheKalenAllen https://t.co/li0CFdtrZc Do you wash your legs in the shower? Is a Cheeto a chip? All will be revealed when @Smosh faces off in my Debate Club. https://t.co/TMjcHc7nub .@official_tWitch dancing with his wife @Allisonholker is one of my favorite things in the world. https://t.co/QyqM6nMh2n .@NickCannon and Andy played \"5 Second Rule.\" It sounds like Andy’s kids and I would get along great. https://t.co/pPkMH0twLj Happy B Day, Cardi B! @iamcardib https://t.co/cCVHnUupAU The only person who can beat tWitch in a dance off is tWitch. \n@official_tWitch #ThanksSponsor \n\nVote below! I asked some of my LGBTQ staff about coming out. I’m so glad I did. I love them so much. Happy #ComingOutDay! https://t.co/P3EIjOy7Ms RT @mj_lee: This Elizabeth Warren answer was quite a moment at CNN #EqualityTownHall https://t.co/ThpI7YSO8M My friend @AndersonCooper and several other @CNN anchors are hosting a town hall on LGBTQ issues with the Democratic candidates. I know I'm gonna watch, and I hope you will too. #EqualityTownHall @HRC https://t.co/kezKQLAVCf We’ve all had this cashier. https://t.co/7deioAQjwm Michael Douglas is a Hollywood legend. https://t.co/cYMHMYn4sm We either picked totally wrong players for this game... or the totally right players. https://t.co/GlFiXjxMvA Andy, I love you so much it hurts. #CatWeek https://t.co/It0THWUDj0 It’s #CatWeek! The cat's out of the bag. And in the bucket. #EDbyPetSmart https://t.co/4FjmIugG7o I’m still not totally sure if @WoodyHarrelson has a cat. https://t.co/uAcav7MQCv It turns out the White House isn’t the only place that has a “mouse dropping from the ceiling” problem. #ThanksSponsor https://t.co/7EASIvGR5B .@iamcardib and @YoungDylan had a rhyme throwdown. @ellentube https://t.co/BKSHXeWBAn @superm I’m jopping just thinking about it. Here’s the world premiere of #KPop supergroup @SuperM's new song! It's gonna make you jop. #SuperM_Jopping #SuperMonEllen https://t.co/g8rnqN8lT6 I talked to @WoodyHarrelson. Who wants to guess the topic?🌳 https://t.co/83r0blZkyS Jopping is a combination of jumping and popping. That’s what I learned from #KPop supergroup @SuperM. #SuperM_Jopping #SuperMonEllen https://t.co/8aXuHtKIDj @JonDorenbos ❤️ Tomorrow I learn how to jop with @SuperM. Yesterday I didn’t even know what that was. https://t.co/s7ZuzFOwgK Before you send that email, watch this. @JayShettyIW @ellentube https://t.co/hPzwRofcf8 My apologies to Kieran Culkin’s wife. https://t.co/i2kArPpSlA The @JonasBrothers are here with their new song! Get ready to dance in the living room. https://t.co/Ze5TLf3mrs .@MaryConnelly wanted to call this episode of the #EllenOnTheGo podcast “The Meltdown,” and you’re about to find out why. @AndyLassner @EdGlavin @kevinlemanII https://t.co/viuaTsZOZl @ReeseW ❤️❤️ Today I learned the biggest bone in @NickJonas’ body. https://t.co/6LhPfygFvD @KelseaBallerini ❤️ Happy birthday, @BrunoMars! I can’t wait to celebrate you this weekend at Gorillapalooza. Two people on my staff, Rachel &amp; Shira, are big fans of the @JonasBrothers, so I thought they should meet them… \n@nickjonas @joejonas @kevinjonas https://t.co/WgmWtCYBgH @daxshepard ❤️ They haven’t been here together for 10 years, but the @JonasBrothers are finally back! @nickjonas @joejonas @kevinjonas https://t.co/DPf8yaVFij @blakeshelton Sounds like someone’s trying to get a seat in the suite with me.😉 @gwenstefani ❤️ @nickjonas You’re gonna make a great judge. They’ll all be a sucker for you. Yes, that was me at the Cowboys game with George W. Bush over the weekend. Here’s the whole story. https://t.co/AYiwY5gTIS I got @NickJonas’ big news right here. https://t.co/3zQBqrVOBi I got a huge booking for #CatWeek. Gina is back and she brought her jugs. https://t.co/hL5jam0dV9 #CatWeek starts NOW. https://t.co/wQGlhGVxFT @nickjonas The least you could do is come to my dressing room and tell me before you tell America. What LGBTQ people will ask the Supreme Court for tomorrow is the right to be treated fairly, and not to be fired just because of who they are. You know, just basic equality.  #ThankYouAimee https://t.co/36ika3zeS7 @chadgoesdeep Oh yes, the mighty Monday stoke. Did I use it correctly? I am obsessed with \"Succession.\" I had to have @NicholasBraun on my show. https://t.co/DkFHqOvxed I had so many more #BurningQuestions for @TiffanyHaddish. https://t.co/8AnKUB6ckC ❤️ #MondayMotivation https://t.co/4IzkyMcRTN Happy birthday, @SimonCowell! I hope you’re wearing my helmet. .@AdamLevine told me about leaving #TheVoice, staying home, and why he didn’t watch my comedy special. https://t.co/PwvsbB2b5T Check out the trailer for the new #NancyDrew series on the CW! When is it on? It’s a mystery! Actually, it’s Wednesdays at 9/8c. Mystery solved! #ThanksSponsor https://t.co/abpY5rI4kG Start ‘em young. https://t.co/87dXgOMOg3 .@SuperM is taping my show on Tuesday! If you want to be in the audience to see SuperM on SuperE, tell me about it here. SuperMonellen@gmail.com If you’re a fan of #MonstaX, you’re gonna want to watch this #OMKalen. #MONBEBE @TheKalenAllen @OfficialMonstaX https://t.co/Nm2NlKHsCg Gorillapalooza is sold out! I'm so grateful to my friends @BrunoMars, @MileyCyrus, @JKCorden and others who are showing up to help save gorillas. You can help too. https://t.co/3Ci6R60U4p @TheEllenFund #WeNeedGorillas https://t.co/78PyjaoaF4 I had to turn back time and watch this twice. @SeanHayes @Cher https://t.co/kMh7kJ9FOb I’m not crying, you’re crying. https://t.co/T2K4wE7fZk Happy birthday, Tayt! I love you so much! https://t.co/yeN9qVzKiA .@SeanHayes met a 7-year-old insect expert... and a few of his friends. https://t.co/wG5LFzZE4d .@iamcardib, @chancetherapper and @Tip played a round of #NeverHaveIEver that will be in the \"Never Have I Ever\" Hall of Fame. #ICYMI https://t.co/K6MLYf13gN @brandicarlile @TheHighwomen Thanks for the hat.❤️ .@SeanHayes tore his meniscus the last time he was my guest host. I’m glad he was more careful this time. https://t.co/WeAwYTewJw Cheeto dust is the glitter of the snack world. https://t.co/zSlfyaMc2e I love my old friend @NachoFigueras, and I love my new friends Prince Harry &amp; Meghan. https://t.co/ohzpJEPfCN If you don’t know who @TheHighwomen are, you will now. @MarenMorris @amandashires @brandicarlile https://t.co/Y4rc0R91Tv Watch what happens when you put @iamcardib, @chancetherapper and @Tip in a room with me. https://t.co/RxKizIW8Yu I love @JayShettyIW’s perspective on the world. I especially love it on this topic. #ThanksSponsor https://t.co/8lGH3wkX5C This is my pre-show workout. It’s edited, obviously. The whole thing is 5 hours long. @official_tWitch https://t.co/fPaMja3FhY .@chancetherapper told me why @OffsetYRN is the reason he proposed to his wife. @iamcardib https://t.co/aBDuqLIJpE Happy birthday, @GwenStefani! I left you a VM. Holla back, girl. .@iamcardib, @chancetherapper and @Tip were all here to play a round of #NeverHaveIEver you will never forget. https://t.co/WMjUP3pHPd RT @johnlegend: Iconic trio! @rhythmflow https://t.co/3jRRTZMbwt Tomorrow, these 3 wonderful people are here. Don’t miss it. @iamcardib @chancetherapper @Tip https://t.co/leXPFiZmtx Please enjoy Nick and Jackson’s appearance in this thirteen-second supercut. @JacksonRickun @NickStopTalking https://t.co/MQ5HeRdP20 .@AshleyGraham helped a lot of people face their fears in her @ellentube show #Fearless. Do you have a question you’d love to ask Ashley? Ask it here! https://t.co/qfZ2AEXPJp @marshmellomusic @kanebrown I love it when you’re here. I always want s’more. Tattoos are meant to be permanent, and some of these are permanently stuck in my memory. https://t.co/sNKyKZuJPK .@TylerPerry told me the weirdest thing he’s ever witnessed in Wyoming. https://t.co/8OjyISpiIJ Oh, no. @Marshmellomusic and @KaneBrown were late for their performance. https://t.co/XKufIrYq21 Young Dylan’s whole life just changed in front of my eyes. Thanks for doing this, @TylerPerry. https://t.co/Z2fqJeNKyD Jackson loves to scare his friend Nick. I love to scare Nick too. If you see Nick, you should probably scare him. @JacksonRickun @NickStopTalking https://t.co/8WNAoc7Tht .@TiffanyHaddish’s impression of a lazy stripper is everything you need to get through Tuesday. https://t.co/8VMSOyWWLV I’m proud to call Meghan and Harry friends, and I’m even more proud of them for finally saying enough is enough. https://t.co/HWy4FQ0oLr I played a new game called \"Do You Know What I Meme?\" And I officially don’t know what anyone memes. https://t.co/T9QuaO8xF0 .@TiffanyHaddish isn’t afraid of a burning question, or a burning oven it seems. https://t.co/F9oZQt8WrT This is the moment you’ve been waiting for… my favorite young reporter, Jaden, got to interview @Oprah backstage at my show! @jaden_reports https://t.co/oQTfxrUpSV Happy October, @AndyLassner. 👻 https://t.co/MNuNWJZbrT @JohnCena @fit_ops ❤️ Couldn’t agree more. I don’t know what these ads are selling, but I’m sure not buying it. https://t.co/yVVSgkuHom .@PeteYorn is here performing “Calm Down,” and I can’t calm down about it. https://t.co/rt1508Btt0 Cats are wonderful creatures, even if they sometimes try to destroy your life. If you have a photo of a cat-astrophe, send it to me! https://t.co/B7OugPY1nV .@JohnCena was not about to miss the #JohnCenaChallenge. @official_tWitch https://t.co/y6NRmDR4ck @JohnCena ❤️ My writer Lauren makes me laugh more than almost anyone, so I’m making her do a new show where she tries new things. It’s called \"Not Great.\" And it’s so great. Reply to this tweet if you have a suggestion for what Lauren should do next! @pommyrantz @ellentube https://t.co/iY8ksoigZW I wanted Alexis to win \"Holey Roller\" so bad, I may have cheated. https://t.co/fqkF3fWFkb .@JohnCena’s fashion inspiration is gonna make you jump. https://t.co/oDGKLikDuQ #EllenOnTheGo just won a People’s Choice Podcast award! I knew they would win (even if they didn’t). If you haven’t yet, subscribe now! Happy #InternationalPodcastDay! @EdGlavin @MaryConnelly @AndyLassner @kevinlemanII https://t.co/cDmMk35VgF Happy New Year to all of my Jewish friends! I’m so sorry I didn’t stay up til midnight to watch the matzo ball drop. Quick, everybody point to their favorite person. Happy birthday, @official_tWitch! I love you so much. https://t.co/Y6HG3E1i6z If you want to be my next red carpet correspondent, be sure to check out today’s #OMKalen for some dos and don’ts from @TheKalenAllen himself! @ellentube https://t.co/uSx20Uhnaw Natalie Portman has lived one heck of a life, and she’s got the stories to prove it. https://t.co/46zwC1Uam2 There was more tea to spill in my new favorite game, and of course, there was Carol. https://t.co/ZWlP2hkImv Billy Bush found himself at the center of a huge controversy. Today he talked about how it changed him. @thebillybush https://t.co/GT02pAdB2l I’m very excited to be partnering with #HBOMax. I thought it was time to take things to the MAX. https://t.co/eobe6b04S4 I honestly can’t describe the interview I just had with these two, but I can say this – I’m stoked for the naysh. @chadgoesdeep https://t.co/zQfSDOkRbk @kanebrown @marshmellomusic We’re rollin’ Just because I’m not there doesn’t mean the scare table is empty.  @BethBehrs https://t.co/obfDmJIy7w I wasn’t there to watch @LadyAntebellum today, but fortunately I can watch their performance right here with all of you. @ellentube https://t.co/R4LGzn3gPL UGH. My 5 most epic prank fails. #cantalwaysbeperfect https://t.co/dszGEKNTjW @WhitneyCummings @BethBehrs @andylassner @yashar I’m letting him go today. The debates would be so much more fun with @BethBehrs and @WhitneyCummings as moderators. https://t.co/lc5gtgYsQH Randall Park is a big #KPop fan. I'll have to remember that the next time @BTS_twt is here. @parkrandall #BTSArmy https://t.co/VYZGSxN7nh .@WhitneyCummings and @BethBehrs co-hosted my show today! I knew they’d make a great duo. https://t.co/56ZejVZTck I love this. https://t.co/daOVTXaKTA https://t.co/3sUj3iy0x3 I sent Lauren and Bente to IKEA to speak song lyrics to strangers. It makes me very happy. https://t.co/AjpuwGBMmr I still can’t move my neck, so I needed someone to tweet this for me. Also, @AndyLassner is one of my favorite people and very handsome. https://t.co/ZxtIgOYhdu I got a special bonus performance from @OfficialMonstaX. Oh My!  #MonstaXonEllen #MONBEBE https://t.co/pxLXYEMNe8 Happy birthday, Will Smith! You’re a prince. https://t.co/OxDVYCbrCU .@KenJeong has an MD in comedy, and fortunately for my neck, he also has an actual MD. https://t.co/SrSYVUT7HQ Tyler Butler-Figueroa just turned 12, and he was a finalist on #AGT. When I was 12, I thought AGT was how you spelled “eight.” @TButlerFigueroa https://t.co/5RypTEDTSD It's #NationalVoterRegistrationDay. Listen to me, I'm a celebrity. https://t.co/ihfBr2bBv5 https://t.co/VMsCyksvSH @Oprah @oprahsbookclub ❤️ .@LennyKravitz has a home in the Bahamas, and he’s on a mission to help the country rebuild. https://t.co/4noJx9HEe1 Demi Moore hasn’t been here for almost a decade. What she had to say was honest, heartfelt, and very personal. @justdemi https://t.co/vlfwM2cRyx Revenge is a dish best served cold… with mustard. Just ask my Executive Producer @MaryConnelly, who made me dye my hair blonde for 5 hours. #EllenOnTheGo 😊 https://t.co/TZxLrpfSU2 @LennyKravitz ❤️ A pain in the neck is a real pain in the neck. https://t.co/4bwnhtBGbj @LennyKravitz I couldn’t stand for you to be apart any longer. It’s #WorldGorillaDay. We can save the gorillas, but we need your help. https://t.co/3Ci6R60U4p @TheEllenFund #WeNeedGorillas https://t.co/dmUaYaG3pA Be a good friend and make sure your friends are registered to vote. I’m starting with @AndyLassner. Tag your friends below. #NationalVoterRegistrationDay https://t.co/ihfBr2bBv5 https://t.co/LwZ7WfRnNC Your life is not complete until you see 5-year-old kid drummer Justin’s reaction to this surprise. Thank you, @LennyKravitz. https://t.co/4vJDFSQ5rc The only thing better than seeing myself in the “Old Town Road” music video is seeing @AndyLassner in it. @LilNasX @billyraycyrus https://t.co/WJeTraonGN .@Oprahsbookclub is back! It’s on Apple, and you can find out the first book right now. @Oprah https://t.co/7K1nZmvJ2l Today, @Oprah and I are sending love to our new friend Linda. https://t.co/H7WvrzBvnc .@JayShettyIW on keeping it simple. #MondayMotivation https://t.co/Nlxzp5ewLm Coming out can be scary. @LilNasX https://t.co/7p6uGDpesV Check out this exclusive daytime television performance of @LilNasX’s \"Panini\"! https://t.co/fr4sl9Yoar Happy birthday, Bruce @Springsteen. You’re one of my favorite people from Jersey. (Don’t tell @EdGlavin) Happy First Day of fall! I could feel it in the air the moment I woke up. I knew autumnatically. Tomorrow, @LilNasX meets Lil Ol’ Ellen and @Oprah. https://t.co/4eMwb85HMT Happy 25th anniversary. Love, your unofficial 7th friend. #FRIENDS25 @CourteneyCox @MatthewPerry @FriendsTV https://t.co/vgbkCZLJL7 It’s #PeaceDay. You can participate by making a #peacecrane and sending it to someone. Here’s how. I love this. @PeaceCraneProj https://t.co/DMaNABld4i .@TheKalenAllen is off the rails in this week’s episode of #OMKalen. https://t.co/40uFi5XxcO Jaden Jefferson is so adorable, I ALMOST forgot to stare at Brad Pitt. @jaden_reports https://t.co/9GaW6m2dkF This is my kind of selfie. #BeKindToOneAnother https://t.co/fiNexKahIb Kristopher and Antwain surprised their classmate, and I wanted to surprise them with Will Smith. https://t.co/y3ahWbKaJ7 Bachelor in Paradise’s @Demi_Burnett was here with her soon-to-be wife. @Kristianhagg #BIP https://t.co/A39FXALa1I You think you know me? You don’t know me. https://t.co/tPeb80yag8 I had so much fun with @DavidDobrik, @TheKalenAllen, @AustinMcbroom, @lelepons, @CatherinePaiz and @harto in my Booth of Internet Wonders, I couldn’t fit it all into one clip. Please enjoy Part 2! https://t.co/ISpMBtCaI2 I see you, @GretaThunberg. I support you. #ClimateStrike @amnestyusa https://t.co/BmQ4OO1Bhe https://t.co/eRdhEvlr7q People of Los Angeles! Who wants a VIP ticket to @OfficialMonstaX’s performance on my show?! Email me here!! And don’t be mad, we’re not gonna be able to accommodate everyone.❤️ #MONSTAX #MONBEBE monstaxonellen@gmail.com @jimmyfallon Happy birthday, @JimmyFallon. What do you call a nut with facial hair? A mustachio. @jimmyfallon Happy birthday, @JimmyFallon. I hope NASA organizes your party. They really know how to planet. Who doesn’t want a video of Brad Pitt confessing their love to you? @daxshepard https://t.co/0ktrT4IO0T @jimmyfallon 😂 Happy birthday, @JimmyFallon. I had a dream about you last night. We were swimming in an ocean of orange soda. I guess it was just a Fanta sea. This still might be my favorite game we’ve ever played. #TasteBuds @KristenBell @daxshepard https://t.co/Cl0LT39wP7 OMG. This is like when the substitute teacher is in and you ask questions you normally wouldn’t ask your regular teacher. @daxshepard https://t.co/5muz0ZCYbh @katyperry I get it. That’s why I have my assistant feed me with a spoon while making an airplane noise. @andylassner Oh look. 3 babies. RT @ellentube: Raise your hand if you love the @JonasBrothers, then take that hand and use it to tap on this link. https://t.co/fqY4TxP5Gs… .@official_tWitch and I like to do a little preshow workout together. He’s doing a great job keeping up with me here. #PreShowWorkout https://t.co/Mso9u2VzeE .@KatyPerry and Orlando Bloom have a good thing going on. https://t.co/CtBUKE5vCv New Bachelor #PilotPete was dumped by Hannah B. So what happens if she shows up for his season of #TheBachelor? https://t.co/RHpKyVu5xq Happy birthday, Jason Sudeikis! Let me know if you need a trim. https://t.co/A6s5COHfD9 I guess I can finally invite @KatyPerry and @TaylorSwift13 to the same bingo night at our house. https://t.co/ArNMCmOjN2 These toddlers hugged, and it warmed the world’s heart. Today they’re sitting next to me. https://t.co/SZsWVc8Gce This might be my favorite performance from last week. #ICYMI #Señorita @nickandsienna @Camila_Cabello @ShawnMendes https://t.co/vgNj2hxLqD We found out a lot about the smartest person in the room, @SimonCowell. #ThanksSponsor https://t.co/RmrsBwUD7H I hope these people find each other. If you see a Burning Man missed connection, send it to me. https://t.co/JXMUr8YLXR I hope my new series with @JayShettyIW gives you the chance to add some mindfulness to your day. #ThanksSponsor https://t.co/gEUYl55kIE If you wanna know how Brad Pitt wound up sitting in my audience, don’t miss today’s episode of my podcast, #EllenOnTheGo! @EdGlavin @andylassner @MaryConnelly @kevinlemanII https://t.co/bgBYLSgF4k Be neat. Eat less meat. It’s good for the planet, for the animals, and you. @WATWbook #wearetheweather #eatdifferently #EatLessMeat #BeNeatEatLessMeat #ByeBye https://t.co/BOA32PUHbk @BoyGeorge Of course I did. I didn’t really want to hurt you. It’s a GIRL! I’ve never been so happy, and so tired. https://t.co/Ke0Ao7Z8az I’ve always said those @ewarren supporters have exquisite taste. @HeadsUp https://t.co/562YaHXmgF @localnatives Thanks for being here. I’m so glad you were local. .@KellyClarkson knows a thing or two about talking. The listening is a work in progress. 😁 https://t.co/Ix6niLsn0E I played “Push Your Fortune” with my audience today. Any similarities to the game “Press Your Luck” are coincidental. https://t.co/G15oLvHeVP Everyone in my audience just got an enormous gift from @KellyClarkson. https://t.co/gZcnGRx6l7 Tracee Lopez has been waiting for this moment since she was 12. https://t.co/A2zj5Xch5t .@KellyClarkson has a new talk show. I invented a game to help her. https://t.co/tbG4HpI1k7 Happy birthday, @NickJonas! I’ve been jonasing to see you. I played a new game called “Spill the Tea.” I’m gonna need Carol here every day. https://t.co/4EZnY3Jmdj Happy birthday, Prince Harry! I got you tiny headphones for Archie. I call them \"heir pods.\" #HappyBirthdayHRH @RoyalFamily .@MelissaMcCarthy was so much fun in our hidden camera prank, we didn’t have time for it all in the show! Check out the #exclusive extended cut right here! https://t.co/FzSSjV2Fda .@TheKalenAllen reacts to his first appearance on my show 2 seasons ago. #OMKalen https://t.co/rk4UrH7hAW Jaden Jefferson is only 11 years old and he’s already my favorite newscaster. https://t.co/KFEBpsHBLJ @daxshepard Brad Pitt can even make a full chicken suit look hot. https://t.co/LuPXhlTTcs @SeanHayes I’ll send an invoice for the use of my likeness. @ReeseW @TheMorningShow 😂 We should all find someone who looks at us the way Brad Pitt looks at @DaxShepard. https://t.co/W3YunCqnTI My podcast is back! It’s so easy to subscribe. In the 2nd episode, my executive producers talk about the moment they realized someone was dialing 911 after I told @MelissaMcCarthy to faint during our hidden camera prank. @andylassner @EdGlavin @MaryConnelly @kevinlemanII https://t.co/WGzsnyFNH7 All your favorite YouTubers are in my Booth of Internet Wonders. I’m wondering why you’re still reading this tweet and not watching. @DavidDobrik @TheKalenAllen @AustinMcbroom @CatherinePaiz @lelepons @harto https://t.co/WOpf4q0Ory @Naomi_Osaka_ 🤗 When Brad Pitt is in your audience... https://t.co/7Oj4YdeCxj This is how @AndyLassner feels. Every. Single. Day. https://t.co/QM6X4safSK Find someone who looks at you the way @SeanHayes looks at Brad Pitt. https://t.co/MGQd3fPMCZ .@Naomi_Osaka_ is one of the world’s greatest tennis players, which is why it’s so surprising I need to help her so much with her game. https://t.co/BjNJCcXg5H It turns out Brad Pitt and I have similar taste in women. https://t.co/rYP8JK4ayt My friend Brad Pitt’s new movie #AdAstra opens September 20th! But I thought you’d like to see the trailer right now. @adastramovie https://t.co/NyqJTrPauf This employee was such a good sport at the dry cleaner where I made @MelissaMcCarthy faint, I had to meet her in person. https://t.co/MJCfg5seh6 @ReeseW I love you no matter who your best friend is. @JLo If you want, he can give you some pointers. .@KylieJenner did it again! Check out what happened when she surprised this superfan at her hotel. https://t.co/czv2k0SjnS @chancetherapper @Spotify We did it! Where are you taking me to celebrate? Every day he’s hustlin’. @AndyLassner #AverageAndy #HustlersMovie https://t.co/yZJjniMHy9 .@ReeseW and my best friend Jennifer Aniston look SO GOOD in their new Apple show. #CantWait https://t.co/MVlMIF4rIK I sent my writers Lauren and Bente to Barnes &amp; Noble with some hidden cameras. They came back with a new boyfriend. https://t.co/Vc6VnfiWV5 .@KylieJenner answered some of my #BurningQuestions with the help of her adorable daughter Stormi. https://t.co/Eyaya00AKa .@ReeseW and I debated who is really Jennifer Aniston’s best friend. Unfortunately for her, I have video evidence. https://t.co/yZeDnMI5NP I’m so excited about all the things we’re doing with Ellen Digital Ventures. @ellentube https://t.co/GswYFJ8ydQ @gwenstefani @blakeshelton ❤️ @Camila_Cabello COME OVER NOW I’D LOVE TO SEE YOU WHY ARE WE YELLING AT EACHOTHER? I love @ChancetheRapper, and after hearing him talk about his wife, I love him so much more. https://t.co/vTnkCgjZlk Today we play a game called “Chrissy, Can You Fill In Your Blanking Tweets?” @chrissyteigen https://t.co/i4U11PVWqI This is why I love you, @BlakeShelton. Let’s get @cmorganmusic to number 1. https://t.co/OXeHOoL5qj @chancetherapper We look good together. @chancetherapper https://t.co/88RO1rpJiT .@ChancetheRapper was looking fresh for this performance. https://t.co/9fvx81nrSu This little girl and her dad singing “Señorita” will melt your heart. https://t.co/2kxXAIO7F3 Apple just gave their keynote address, and I’ve already pre-ordered everything. https://t.co/VVWbZy4juB Happy 40th birthday, @pommyrantz. You laugh like you are lit from the inside. It’s probably the tequila. https://t.co/bEcCBOpmfR .@ChrissyTeigen told me about her Twitter feud with the President of the United States of America. https://t.co/igmeActgOV Today and always, sending all of my love to NYC. #NeverForget https://t.co/gnXBqcmy8f Tomorrow, @ChrissyTeigen tells me how she feels about being called a “filthy mouthed wife” by the President of the United States. https://t.co/lceG2PXpPc I loved every second of my chat with @MelissaMcCarthy today. #ICYMI https://t.co/MLqoQhhEfr Do you know someone who deserves a Christmas miracle? This could be your chance to give them one! Tell me about them right here. https://t.co/oCFPqweU5l Who’s a big boy? https://t.co/q9vlqvvIX6 .@MelissaMcCarthy’s gift to her husband will haunt your dreams. https://t.co/kVZIc3RBql If you saw this firefighter dad giving his baby daughter a pedicure, you have to see what happened when they stopped by today. https://t.co/ZrEY5ev1ts I sent @AndyLassner to NYC to drive a pedicab and tell people about Season 17. I’m surprised he made it back alive. #ellenpremiere https://t.co/tUuMkVpPub If you’ve ever wanted to know what it’s like to work on my show, there’s no better way than to listen to my podcast! Check out @EdGlavin, @MaryConnelly, @andylassner and @kevinlemanII on the premiere of Season 2 of #EllenOnTheGo! https://t.co/TZxLrpfSU2 I sent @MelissaMcCarthy to a dry cleaner with a bunch of hidden cameras and an earpiece. An instant classic. https://t.co/zYHHEJ9zsV https://t.co/HMSwij1PIe I shaved my head over the summer. Time to go wig shopping! https://t.co/buJ86BrHVv @KylieJenner Thanks for being here! Love, Ellen “Millionaire and a Lot of Great Houses” DeGeneres. .@KylieJenner was here to tell me about her perfect little girl Stormi and her family’s new nickname for her. https://t.co/tRttlxFpK0 Some of my favorite new videos are on TikTok, so I came up with a fun new game to show them to you. https://t.co/AnmhUPaqK0 @matteksands @andylassner @jamie_murray @usopen I’m thinking that might not be a great idea. Kylie “Billionaire” Jenner gave me all the details on her epic birthday party. @KylieJenner @KrisJenner https://t.co/SUnBipgbjB Sending love to my friend @KellyClarkson on the launch of her new show, @KellyClarksonTV! I can’t wait to watch it. Good luck to whatever show is following you! @andylassner @usopen Thanks for trying to teach my beloved @AndyLassner. @rogerfederer @Simona_Halep @Naomi_Osaka_ @RafaelNadal @JohnIsner @Madison_Keys @matteksands @Bryanbros @Bryanbrothers @DjokerNole @stanwawrinka #USOpen .@AndyLassner got trained by the world’s biggest tennis stars at the @USOpen. Nobody mentioned anything about belts. #USOpen https://t.co/2ix34Hv8mZ It’s @EricStonestreet’s birthday today! If you see him out somewhere today, give him a scare from me. For my very first show of the season I wanted to do something incredible, and @KylieJenner and @KrisJenner did not disappoint. #ellenpremiere https://t.co/n4JI0aBKjW This summer I got to meet Prince Harry and Meghan’s son Archie in England. Would you like to see the picture? https://t.co/gdNpYwrsXv Today’s the day you’ve been waiting for! My show is BACK! #ellenpremiere I’m starting the season with the thing I love most – finding incredible people and changing their lives forever. Don’t miss what @KylieJenner and I do for Samantha and her friends, tomorrow. #ellenpremiere https://t.co/Mchfz8bBv0 Happy birthday to the two most badass divas I know, @Pink and @EdGlavin. Trying out a new look for Season 17. #2days #ellenpremiere @official_tWitch https://t.co/qTyZLijL1b These two are my new favorite dance duo. @TayeDiggs @official_tWitch https://t.co/YVcLZUSJuk Beyoncé shared Kalen's post, now check out the behind-the-scenes of @TheKalenAllen’s epic @Beyonce tribute video! #BeyDay #OMKalen https://t.co/kfXCt6ujym Premiere Week starts Monday, and it’s coming in hot. You won’t want to miss a moment. #ellenpremiere @KylieJenner @KrisJenner @melissamccarthy @usopen @DjokerNole @andylassner @pommyrantz @official_tWitch https://t.co/ZDRL1TS9fj This is my kind of party. #ellenpremiere https://t.co/uvBxehMCap Every day I’m hustling. #HustlersMovie @JLo @iamcardib @KekePalmer\n@ConstanceWu @lilireinhart https://t.co/iGXLOXVzIL .@brckhmptn was here for the first time to perform “Sugar.” It was dope. Is that what the kids say? https://t.co/bh1HvdkGMu .@TayeDiggs’ dating advice from his son is something we should all listen to. https://t.co/HKBUGEGqvr I was wondering why I saw you with a table on Olive Avenue. https://t.co/s5smlskGXg @katiecouric I get it. I knew @official_tWitch could dance with what was behind him, but I didn’t realize @TayeDiggs would be this good at it. https://t.co/EuoyBgADIQ The hosts of @TheRealDaytime stopped by to help my guest host @official_tWitch with some hot topics. @AdrienneBailon @LoniLove @JeannieMai #Popeyes https://t.co/h9TGS17GXg Happy birthday, @IdrisElba. I had a card for you, but I sent it to the wrong Idris. RT @TayeDiggs: Fun w @official_tWitch on @theellenshow WATCH TODAY https://t.co/xxrXKmF3hp ZaZa is our favorite kid of Season 17, and it hasn’t even started yet. @official_tWitch https://t.co/6MNRjaBP8N I just taped my premiere show with @KylieJenner &amp; @KrisJenner. It airs Monday, 9/9. It's gonna be big. #ellenpremiere https://t.co/lOuZdQUAcE There. Ready for Season 17! #ellenpremiere https://t.co/2LL13AtEyT Do you ever get texted waaaay too much information from your friends or family? I wanna see it. Tweet it to me with #TMIforEllen. I hope you have enough battery left. https://t.co/cJHyaB5D4S This was an interesting piece of news from @TaylorSwift13. Nobody tag @JoeJonas https://t.co/SdePuuQdoV Here’s your chance to win big without having to leave your living room. Tell me why we should show up at your house with a game show, right here. @JonDorenbos https://t.co/ksmpJdUIsf I’m nominated for 2 People’s Choice Awards! I’m so glad I have you peoples to tell. 75% of the people in my house are pets. Retweet this to vote! #PCAs #TheSocialCelebrity #TheDaytimeTalkShow https://t.co/zk6DYLAojc Season 17 is gonna be the GOAT. #5MoreDays #ellenpremiere https://t.co/lg99TZtmob Thanks to Sandy Segerstrom Daniels for her incredible support of @TheEllenFund. She also created #NationalChildAwarenessMonth in September to support kids. I love it when people do good things for the world. #FestivalofChildrenFoundation #ThanksSponsor https://t.co/cwaV7ct6Qw Screenshot this. Season 17 starts Monday 9/9! #ellenpremiere https://t.co/JPa0dc0boq My friend @Bethenny’s organization #BStrong is sending barges and planes full of supplies to the Bahamas. If you want to help, here’s your chance. #ThisIsACrisis #HurricaneDorian https://t.co/MnyWQwYfQT @TheKalenAllen Happy bday, @Beyonce! Good luck topping that, Jay-Z. #BeyDay Happy September! It’s time for the September Ellen’s List! #ThanksSponsor https://t.co/ocnOjF0Snv https://t.co/fhzOl8F6pA I’m so excited for my season premiere, I’m giving one of my Twitter followers a pair of VIP tickets to the show! RT if you can’t wait for Season 17, and enter here. #ellenpremiere https://t.co/0WuFQgdTDS I am so grateful for heroes like this. I know these dogs are, too. https://t.co/xXJIoEV0eG Been working on some new moves for my new season. #ellenpremiere #6days https://t.co/OapI5m1x2r @vancedegeneres 🤷🏼‍♀️ Happy birthday, @vancedegeneres! I was gonna send it yesterday, but I was in Labor. George Clooney told me why his kids are taking after his wife, Amal. https://t.co/GlkXvFyfuY This must be an adoradactyl. https://t.co/pm50q1dvnC I made a Booth of Internet Wonders, and @AliWong, @MattBomer, @nikolajcw, @shailenewoodley, @Trevornoah and Kunal Nayyar found some wonderful things. Who knew Ali Wong made such a handsome man? https://t.co/lBagV63szv ONE WEEK UNTIL SEASON 17. GET READY TO DANCE. @GenePark https://t.co/LPB64sE6Ot Happy #LaborDay! In honor of all your labors, here’s 25% off in the Ellen Shop! https://t.co/HDBOosvc6J #HotGirlSummer https://t.co/XlyILmE76T How many days until my Season 17 premiere?! Happy birthday, silly Lily. Sending you lots of love. @LilyTomlin Congratulations, @Naomi_Osaka_! @CocoGauff you’re a great player and great sport. Naomi, you’re a class act. I still play with the racket you gave me, but it hasn’t helped. #USOpen We are all ready and excited for the match. #USOpen https://t.co/2mFmVmZC4W I’m sending luck to @Naomi_Osaka_. I’m also sending luck to @CocoGauff. I love them both. This is gonna be an amazing match. #USOpen Everybody’s excited for Season 17. Only 9 more days! https://t.co/bPBdP7qsNc Congratulations, @TaylorTownsend! That was a fun match to watch! #USOpen .@TheKalenAllen reviewed the Deep-Fried BBQ Chicken #Pizzadilla! #OMKalen https://t.co/QzRMbPICFp Do you think you have what it takes to be my next red carpet correspondent? Let’s see whatcha got! \n\nEnter on @ellentube: https://t.co/5suueA5nR9 https://t.co/SEtoL0bcHi I’m glad my target audience is excited for Season 17. https://t.co/t8TyijusBe Jason Momoa just threw an axe right to my heart. https://t.co/Ty0w8SrPku This kid is a star. I ❤️ Young Dylan. https://t.co/XbEQ1Kwa2u @MissyElliott @AlysonStoner ❤️ #11moredays https://t.co/LLnuI3BNY5 @AlysonStoner I still have the bandana. Asking if you’ve ever accidentally texted your boss was my best idea this week. Thanks for sending! Get ready to see if your response is on Season 17. #SorryBoss https://t.co/Y8LgJdIcyr I scared @ChrisHemsworth with a mouse. I hope he isn’t Thor about it. https://t.co/9Jxjg5IPos 16 years before she was dancing on the #VMAs, @AlysonStoner was dancing on my show when she was 10 years old. #TBT @MissyElliott https://t.co/VCPbv0A9Pu .@AROD set the bar a little high with @JLo’s anniversary gift. https://t.co/b6pLy0Dwip .@AndyLassner is getting ready for Season 17. https://t.co/gmgT5cXeZR .@JLo was feeling the burn on these #BurningQuestions. https://t.co/yqAZn4pRnP Me at 9am. Me at 9:15. https://t.co/GOvIrg4Z0l Season 17 hits newsstands September 9th! @KylieJenner @Oprah @ReeseW @chrissyteigen @chancetherapper https://t.co/JyxRR37Wgy Season 17 starts September 9th! Here’s your chance for tickets. Get them before they’re gone. https://t.co/I85GaQLvHa Have you ever thought you were texting your significant other or friend, and accidentally ended up texting your boss?! We want to see your text exchange! #SorryBoss https://t.co/b8xglzaFgP It’s after noon, but I still thought you’d like some W.A.F.F.L.E. https://t.co/6xrQae8T9V Season 17 is coming. Tag your friends who you know will be excited. @AlysonStoner https://t.co/paU6yxODHD If this is what Will Smith asked @jadapsmith to do for his 50th birthday, she’s probably already planning where to hide for his 60th. https://t.co/DEUzeVmSPg That’s right. Only 13 more days until Season 17! https://t.co/BxlqRn814A @LeoDiCaprio ❤️ I love you @TaylorSwift13. Signed. You can do the same right here. #VMAs #EqualityAct https://t.co/8Vmx7wArSd .@MissyElliott, you are a legend. You worked it and it was absolutely worth it. #VMAs I’m so happy for @TaylorSwift13 and @Todrick. You really know how to do good. #VMAs If you want to help the #Amazonrainforest, here’s how. I love you, @LeoDiCaprio. https://t.co/GuOLNK6BvI Happy #NationalDogDay from my 3 National Dogs. https://t.co/xFoxl7KD4p I can’t believe how much has happened in a year. @TheEllenFund #WeNeedGorillas https://t.co/hSoVvIE5uC Happy birthday, @MelissaMcCarthy. You make me happy just thinking about you. https://t.co/uM3EfkeQP8 Today is #WomensEqualityDay. I am so honored that I get to talk to incredible women on my show every day. #EqualityCantWait https://t.co/zVuyWnpUv5 Remember that time I stole Bo Obama from the White House? Happy #NationalDogDay! https://t.co/22mRvN9KxE .@TheKalenAllen’s taste buds are in for a spin in this week’s episode of #OMKalen. https://t.co/0PiZgpRn4s Scarlett Johansson and @BrieLarson are a lot better at saving the world than they are at saving this balloon. https://t.co/YND8H9uNIm If you love Netflix, but don’t love smoking, I fixed it for you. You’re welcome. https://t.co/n8Xe1eTunt These must be kitten heels. https://t.co/gjsppiGgrJ Thank goodness for these products designed for women. Now I can escape from my car in an emergency like a lady. https://t.co/OMThzq7Vw0 Ready for the new album, @taylorswift13. #LoverOutNow https://t.co/fMfG39i2Mp My Instagram account was hacked last night (despite my clever password “password”). We apologize, and we thank everyone who brought it to our attention. I’m going back to sleep now. I don’t know a lot about science, but I do know that allowing massive destruction of the #AmazonRainforest is terrible. Here are some ideas how to help. https://t.co/8DNE9Nu9F9 @andylassner wassup D @Darkhshanmughal Playing #NeverHaveIEver with @Madonna and @JustinBieber could never not be fun. #TBT https://t.co/S0XbyydUb7 It’s time for Debate Club! The LaBrant Fam went head-to-head to decide some of the internet’s toughest controversies. @Thesupercole @SavannahSoutas https://t.co/H3r1WvbDj3 https://t.co/9qFpvURtQD Happy birthday, @JKCorden! 41 is a great age. Especially in cat years. The one where Jennifer Aniston wasn’t famous yet. #FRIENDS25 https://t.co/k025TN6kJR Bradley Cooper answered my Burning Questions. Tell me something, boy… https://t.co/o96WoC1cpJ Everyone loves a back-to-school photo. Okay, maybe not everybody. If you get a bad back-to-school photo, send it to me. #EllenBacktoSchoolPhotos https://t.co/SA4V9zqSay This is your chance to do something great for someone who really deserves it. If you know someone who could really use some help, tell me about them... then get ready to see what @KylieJenner and I do for them! https://t.co/fK3C1QuApn Three gorillas just texted me about how excited they are. @TheEllenFund #WeNeedGorillas https://t.co/BmPeZO471c .@AyeshaCurry is a great chef. Jennifer Aniston and I are great taste-testers. https://t.co/4CJoKIP3R4 This is one of the many reasons I love @Pink. https://t.co/vcTiNiMMpW Happy birthday to the incredible Demi Lovato. I ❤️ you. I’m so cute, I can do it upside down. https://t.co/j4rkMAZlyH Congratulations to my friend Dwayne Johnson on getting married. I can’t wait to see the rock. @TheRock The Ace family just aced my #BurningQuestions. @AustinMcbroom @CatherinePaiz https://t.co/FnzFqnGac0 It’s official – even Jennifer Garner’s gums are beautiful. https://t.co/DmBIsUuUy7 This #WorldHumanitarianDay, let’s celebrate the #WomenHumanitarians who are changing our planet for the better. https://t.co/c7PKqPuHg1 Dr. Dre, meet Dr. Seuss. https://t.co/Xxc3tjXY11 Portia and I met Prince Harry and Meghan in England to talk about their work on wildlife conservation. They were the most down-to-earth, compassionate people. Imagine being attacked for everything you do, when all you’re trying to do is make the world better. https://t.co/226pRO1fj1 Season 17 is almost here, and YOU could be sitting in my audience! https://t.co/JSLG0JjraM \n\nWherever you’re gonna be sitting, don’t miss my season premiere September 9th. We should all see the world through strawberry-colored glasses. https://t.co/DpOD0c4Dut Roman is gonna change the world, one dog at a time. #MondayMotivation https://t.co/CI4WQ2Dmjg .@TheKalenAllen did a mukbang with K-pop super group @ATEEZofficial. If you understood three of the words in that sentence, you’re under 22. #OMKalen #ATINY https://t.co/WSDzQftYVE It’s #ClearTheShelters day! If you were thinking about adopting a pet, today is the day. @ClearTheShelter https://t.co/T4Q5pGubFs https://t.co/KdfALXSkE3 .@DrewBrees is one of the most incredible friends. He wore these custom cleats, and now he’s raffling them off. He has some big shoes to fill. Here’s your chance. https://t.co/i7g2dQ4Xuo @TheEllenFund #WeNeedGorillas https://t.co/FWyw26oXoU I am so proud of my niece Eva, who donated her hair to Locks of Love! Kindness has never been this adorable. https://t.co/CXj4PWGA3n Working can be scary. https://t.co/3JRIcO7D8C .@SterlingKBrown was not gonna let me scare him again. I was not gonna let him leave without scaring him. https://t.co/uzHf4em5BP Happy birthday, @Madonna and @SteveCarell! I hope you celebrate like a 40-year-old virgin. Happy anniversary, Portia. 11 years. My favorite number with my favorite person.\n\n📸: Lara Porzak https://t.co/H5RmULBETc Happy birthday, @DebraMessing! I hope Will has something wonderful planned for you. Happy #BestFriendsDay to Jennifer Aniston, @Oprah, and Reese Withersp… oops, I ran out of characters. I’m always here to help. @kellyclarkson https://t.co/mpF5z38lh1 #TBT to that time I had a cold. I’m as healthy as a horse now. Unless it’s a horse with a cold. I’m as healthy as a healthy horse. https://t.co/auXK7ciIKw Happy birthday, @JoeJonas! I can’t believe you’re only 30. I feel like you’ve been famous for 42 years. I need an emoji of this immediately! https://t.co/zn1XeAtNSW This is one of my favorite scares of the season. Good work, “Justin Bieber.” #TBT @billieeilish https://t.co/BfgcoQpLpr Celebrate #NationalRelaxationDay with this gorilla. @TheEllenFund #WeNeedGorillas https://t.co/uRSzyqdDhD Happy birthday, Mila Kunis! You’re not on Twitter, so I started an account for you. It’s called @ellentube. Everyone go follow it! This round of #BurningQuestions with @Pink was LIT. https://t.co/9RUZFsZYCc It takes a big talent to be a little woman. #LittleWomenMovie  @LittleWomen https://t.co/O17kSrLSdQ Justin Wilson II is only IIII years old, but he can play the drums like a IIIIIIIIIIIIIIIIIII-year-old. https://t.co/b6nPztgyzC What just happened?!?! @ellentube #MirrorChallenge https://t.co/nz3Jo2oCgJ Remember that time I tried to prank @MiloVentimiglia, and he wasn’t having any of it? https://t.co/d1fiVCLIuh I want everyone to #BeKindToElephants, and I love it when you do it with style. @SheldrickTrust https://t.co/qd4QaSYFgm https://t.co/5pCOQjCRfs Dr. Ruth knows a lot about sex. For starters, she taught me how to say it. @AskDrRuth https://t.co/31eZzR3cXB My premiere week is coming up! @KylieJenner and I are looking for some people who deserve a lot of money. If you know someone who deserves a premiere week-sized surprise, tell me about them here. https://t.co/fK3C1QuApn I have the voice of an angel and the mouth of a sailor. https://t.co/XJHpTa1KmU #TheBachelor’s @Colton &amp; @CassieRandolph tackle the internet’s biggest questions in my debate club!  https://t.co/X6PdHjrW6m #AverageAndy is way above average at making me laugh. @andylassner https://t.co/lRfQpxzRJ1 Let’s celebrate #WorldElephantDay by pledging not to ride elephants. Let’s love these incredible animals by allowing them to live free lives. @WildlifeSOS #BeKindToElephants #RefusetoRide https://t.co/ub0VjDlVcS https://t.co/mJ2Bp6Up5i Two years. I still think about this mother and the pain she and our country are still in. https://t.co/K6H9CaML0W Happy birthday, @KylieJenner! See you in September. We’ve got some big surprising to do! @ellentube https://t.co/fK3C1QMbNX Thank goodness it’s #SaturKay! Sit back and relax with this brand new @TheKalenAllen video. #OMKalen @ellentube https://t.co/gzSpNgkGkM How incredible is this? @DrewBrees is wearing these tonight in the pregame against the Vikings, and next week the Brees Dream Foundation is gonna raffle them off! https://t.co/tvWMIqKlrz If you can’t stand the heat of @MelissaMcCarthy @TiffanyHaddish and Elisabeth Moss on my show, then get out of the kitchen! Here are my favorite moments from the cast of #TheKitchenMovie. https://t.co/95P4XblVLd My season premiere week is gonna have some big surprises, and one of them could be for you. It all starts September 9th! https://t.co/PDgtHrPIM9 RT @KylieJenner: So I am teaming up with my friend Ellen DeGeneres @theellenshow to start a nationwide search to find some incredible peopl… This extended version of @BillieEilish scaring @MelissaMcCarthy is simply Eilishious. https://t.co/RQGd92YBtF Happy #TBT, @Oprah and @TiffanyHaddish! https://t.co/WHlWOPwC1b “Chasing the Cure” is a new show that connects patients with possible cures. Amazing. #ThanksSponsor https://t.co/7HLxoJofFM RT @ellentube: We wish we had a best friend raccoon. https://t.co/st6wVVFwqt When life hands you lemons, hand them to a baby and get your camera. https://t.co/JCUURgxb1f Piñacoladoodle. https://t.co/pNq4zyqBkj Ever wanted to know who @JKCorden’s dream guest is? Watch James answer these \"Musical Burning Questions\"! https://t.co/Aghmw2X7GE I hope they make this ensemble in my size. https://t.co/DwP0Az8gRM Happy #MotivationalMonday from your friends @KingJames and @ChanningTatum. https://t.co/leVHF5Sw2i Happy birthday, @BarackObama. I miss you so much, my eyelashes hurt. RT @PeteButtigieg: How many more? Celebrate your #SaturKay with a brand new @TheKalenAllen video. #OMKalen https://t.co/yJyIeqXOAR \"Fast and Furious Presents: Hobbs &amp; Shaw\" comes out this weekend! I had a lot of fun with the cast on my show. @TheRock @idriselba https://t.co/s3UrAjRc3R .@FLAGALine answers who their first celeb crush was, their favorite CD growing up, and more #BurningQuestions! https://t.co/3LqKlWLXXv Fetch https://t.co/jGKevWHZtJ I may not have kids, but I sure love this one. #TBT to the first time I met kid geography expert Nate Seltzer. https://t.co/nXVHWVAMdJ Here’s a list of wonderful things you could buy me... or yourself. #ThanksSponsor https://t.co/OtLmRlVUPi https://t.co/nbho3CIyn3 RT @ellentube: We made this montage au naturel. https://t.co/bs74skBguv If you’ve got a cuter photo than this, I’m all ears. #EllenSummerPhotos https://t.co/1Gi0CIZeen I still light a candle for this couple every night. https://t.co/yoJGbsxp48 Happy #NationalAvocadoDay! I meant to tweet this last year, but avocado. Some of my favorite #Bachelor stars answered some of my hottest #BurningQuestions! @Colton @CassieRandolph  @kaitlynbristowe @Jason_Tartick @ashleyiaco  @haibon_jared @AmabileJoe @KendallPatrice @jadelizroper @ttolbert05 @carlywaddell @ebassclinics https://t.co/1ETlnKMaS2 If you watch my show this week, you will have a chance to win $20,000! I’m totally 100% serious. https://t.co/Ra9tdudjGG I’m very excited for my friend @DavidSpade’s new show #LightsOut, premiering tonight at 11:30. ELEVEN THIRTY?! I’m gonna have to watch on my DVR when the lights are back on again. I can’t wait! @LightsOut https://t.co/xDvL0UuueC Wake me when it’s September. https://t.co/t6Fnc2ZUvg I’m not gonna tell you how many times I’ve watched this, but I’ve seen 5,341,906 abs. @ZacEfron https://t.co/9YUC8tBGOH .@GwynethPaltrow gave some of her goop to Kate Hudson and @GoldieHawn. https://t.co/IqTLULkSyr Jeannie Klisiewicz, you are a light in the world. Have a wonderful birthday. I love you. @iamjeanniek https://t.co/dva1OIKmmk Start your #SaturKay off right with a new episode of #OMKalen with @TheKalenAllen. https://t.co/ZhJ0PIMHuk Who’s excited to see #OnceUponATimeInHollywood? https://t.co/89fldRaA1a .@HeadsUp is the game of summer. https://t.co/3vCOz5jWLc https://t.co/VvAq9REXbm This clip is for all the little monsters. @LadyGaga answered my #BurningQuestions! https://t.co/fxKeIZJWkv Best chin rest ever. https://t.co/8zn8Waain1 .@BarackObama and I have one thing in common that you would not believe. #TBT @MargotRobbie https://t.co/JUV4Qg1ADZ .@KenanThompson was here for the first time this season, and it will definitely not be the last. https://t.co/xP8ytFVrSh This family makes me so happy. https://t.co/ybDxXGuLvC RT @ellentube: We’d rate all these tiny passengers 5 stars. #ellentube https://t.co/iFX2Div5Ye .@MsSarahPaulson might be my all-time favorite person to scare. https://t.co/Wbmjx1FFOG Happy birthday, @JLo! Love, your Maid of Honor. It’s @DavidDobrik’s birthday! David’s #BurningQuestions are even hotter than his flamethrower. https://t.co/LKpeWQt1sz I loved watching Seth on our show \"Fearless.\" I’m glad @AshleyGraham checked in on him. @ellentube #ThanksSponsor https://t.co/GFRVqS2RdP .@IdrisElba is still currently the Sexiest Man Alive, if you were wondering. https://t.co/WIYwbtHeNm Brielle is adorable. Baby goats are adorable. This video is adorable squared. It’s simple math. #ThanksSponsor https://t.co/Ka7iRRsclx Happy birthday, @SelenaGomez! You’re the 3rd most followed person on Instagram, so I thought I’d send you this on Twitter. The snuggle is real. https://t.co/DXUXF6f0AW Happy birthday, @DavidSpade. I love it every time you’re here, even if you do steal all the light bulbs from the dressing room. Of course, @JesseTyler Ferguson does an incredible @CelineDion impression. https://t.co/a3XbkrpzCo Watching this clip of Ellie inspired me all over again. #MondayMotivation https://t.co/2NgfGBuWFG I had a lot of fun with the cast of #BigLittleLies this season. I can’t wait for the finale! #BLL2 @LauraDern @ReeseW @shailenewoodley https://t.co/kTIuuewtKh What do you and @TheKalenAllen have in common? You’re both ready for the weekend with this episode of #OMKalen. #ASMR https://t.co/liKbB1ypIZ #TheLionKing is here! Okay lions, now let’s get in formation. #HakunaMatata @Beyonce @iamjohnoliver @donaldglover @billyeichner @Sethrogen https://t.co/d1tS2nRpr5 Her future’s so bright, she’s gotta wear shades (and a big hat). https://t.co/tZpf7OJJ8P We all scream for great ice cream videos. Thanks for sending these to @ellentube! https://t.co/2aKXAbTobu True story... @itsJulieBowen had been hiding in there for 3 days. @BlakeShelton https://t.co/VSiEY0bkUn You have to see what @TheKalenAllen is doing tonight. #TheLionKing https://t.co/6UVZ4Dlyau Still the greatest scare of all time. #TBT @TaylorSwift13 https://t.co/wHZ9wUSctK See, what I did here was I took one cute thing, and then I put it with another cute thing, and I called it two cute. You’re welcome. @ellentube https://t.co/1cblSjKJJy I’m officially acting as @PINK’s daughter’s manager. https://t.co/34Za93sQgZ Happy birthday, @IMKristenBell. You’re always the bell of my ball. https://t.co/1CXNlP5jSI Remember, every pair of ellen underwear has my name on it, or your money back! #WorldEmojiDay https://t.co/aCEUgw944H https://t.co/gtlcmiASsD Marcos went from playing the piano during his breaks at Costco to an internship with @HansZimmer. Congratulations, @Marcosb62, and thank you, Hans! https://t.co/ZylXkfa0JO I always enjoy a short flamingo. https://t.co/WEXok7rqaJ It takes two to make a thing go ri-ight. @ellentube https://t.co/kaG8xxYdSo @aieegosong @NBCGameOfGames @EdGlavin @andylassner It takes a lot of people to make a great show and you’re one of those people, Ron. #GameofGames .@JustinHartley and Macey Hensley make a terrific duo if you need to know presidential facts and things about #ThisIsUs. https://t.co/oLbqS9cD5T I’ve met some incredible foster parents and some incredible foster kids. A family is who you love. You can learn more about fostering here. https://t.co/7BEAqMsQie #DonateYourSmallTalk https://t.co/dyTEbi3QD2 This game is always a good time, so long as you didn’t eat any spinach dip. @ellentube https://t.co/3sLFANS4pT Didn’t you get the memo? https://t.co/KgOt2KEFlv YouTuber @lelepons spills the tea in a sizzling game of #BurningQuestions! https://t.co/fGgDjaq7j1 Our new joy mug is available at @BedBathBeyond, and it holds a full cup of coffee, or one whole dog snout. \n\nCheck out the mug here: https://t.co/QWsDL44CtW https://t.co/YwsagPBTbF These dancers are in. sane. https://t.co/nirTjRdRvb I love making college dreams come true, especially for these two. https://t.co/ZK00A0GxlW Someone watching my show this week is gonna win $20,000! But only if you enter here. https://t.co/Ra9tduuUye When you forget it’s Monday and think it’s Thursday. @ellentube https://t.co/z5JZHvb2kk I’ve got a 3-day 2-night voucher for @CaesarsPalace in Las Vegas, and it could be yours! So long as Brutus doesn’t steal it. https://t.co/CG8jsIJwkU Big news. @TheKalenAllen announces his run for presidency in this week’s #OMKalen. #PresidentKalen #2020 \n\nDownload Kalen’s presidential poster here: https://t.co/0hISXjco6G https://t.co/jwCK8XCBrW I love a dog you can limbo under. https://t.co/IcYfW88ujG If you watch too many clips on @ellentube today, blame it on the boogie. @ShawnMendes  https://t.co/e5M3fSd2o2 https://t.co/ChFyJKjvWp Who doesn’t have a burning question for @AdamLevine? #BurningQuestions https://t.co/lBsJY5kL8E I know you love the great outdoors, now show me! Send your outdoorsy videos to @ellentube. https://t.co/7U0IHdZ067 .@AdamLevine doesn’t scare easily. Fortunately, I had a giant rat. https://t.co/xA1xxT4F6j Who needs a hot new summer look? https://t.co/PeXDMNmVcF I hope @AllisonBJanney has found her hot pants. https://t.co/9CSqGz4wmf This might be my favorite #TBT of all time. @IMKristenBell @DaxShepard https://t.co/y4B0jEUpvB Here, I’ll take it. My arms are longer. https://t.co/mUz6mp5CWA Everybody likes a nice dip in the pool. @ellentube https://t.co/5bKzl8R7Vc If you thought @DavidSpade was funny, wait ‘til you hear about his mom. https://t.co/8Gxugbwxu5 Feliz cumpleaños, @SofiaVergara! Reventa las velas! (That’s supposed to say, “blow out the candles,” and if it doesn’t, I am so sorry.) https://t.co/EG3puUhN7L #BringTheFunny premieres tonight at 10pm on NBC! https://t.co/6Utn5cmHE1 Bows and stripes forever. https://t.co/Oz87vWGOrl As far as I’m concerned, @SamuelLJackson can always have the last word. https://t.co/qOLFnhr8XY I found out how well @johnlegend knows @chrissyteigen. https://t.co/Td2slnm4gt Emeka really moved me. He inspires me every time I think of him. #MotivationalMonday https://t.co/eZTjZSRMDH ❤️❤️❤️ https://t.co/ehq0ndKlgd The US women’s soccer team are the world champions! I’m so happy. These women are the best of what our country represents. You’re welcome on my show any time. My World Cup runneth over. @USWNT #USA #FIFAWWC THIS IS IT! THE WOMEN’S WORLD CUP FINALS! WE COULD GO ALL THE WAAAAAAYY!!! #USA #FIFAWWC #OneNationOneTeam .@TheKalenAllen tests his taste buds to see how many ingredients he can name... in this baseball stadium food. #ThanksSponsor https://t.co/K2TueNTt27 You know I love funny. Here’s a sneak peek of #BringTheFunny, premiering July 9th on NBC! https://t.co/qxSzoMWBnO Somebody please put me in this basket. https://t.co/L2vWbUg99T .@ReeseW and I aren’t competitive with each other, which she would try to be the first to tell you, but she wouldn’t, because I would tell you one second faster. https://t.co/66OYOSTdPS I hope you’re having a wonderful #4thofJuly, but if you’re not, here’s a video of @official_tWitch getting waxed on my show. #TBT https://t.co/EoctK64TA2 RT @ellentube: Happy #4thofJuly! These videos definitely sparkle. #July4th #USA https://t.co/cHTbxypl7K Nothing says \"Happy #4thofJuly\" like a sale! https://t.co/PeXDMNEw4d https://t.co/jC04BeeNzO This is definitely a can-do attitude. Happy #4thofJuly! https://t.co/msa6eKwJde Happy 4th of July to my fellow Americans, and to everyone else, happy #July4th! Did you record an epic summer video or an epic fail? Either way, I wanna see it! @ellentube https://t.co/MiHyo1vzXu I hope you’re crushing summer as hard as this baby. https://t.co/WCzW5fyHdG Who needs a cocktail? Come back every Friday for a fun new recipe on my Insta stories! #ThanksSponsor https://t.co/8zA9QIwVfP Twins Brittani and Brandi are both doctors, and both are absolutely inspiring. https://t.co/Etr2uVPNGA I could watch y’all play @HeadsUp all day long. @ellentube https://t.co/HDXJke0Ona My producers are celebrating the greatest moments from Season 16 on our podcast. I couldn’t possibly pick favorites, so I made them do it. #EllenOnTheGo @EdGlavin @MaryConnelly @AndyLassner @kevinlemanII https://t.co/PKXUAzVqoW I can’t wait for the new Spider-Man movie. I hear he has to defeat a giant, overturned cup and a piece of cardboard. #SpiderManFarFromHome https://t.co/GfsoQpw7ge .@BillieEilish put on a disguise, and surprised her biggest fans backstage at my show. https://t.co/ZLo6trbLfv Red, white, and adorablue. #USA https://t.co/LemfUKP5EB @USWNT WE’RE GOING TO THE FINALS!!!!! HAPPY BIRTHDAY @AlexMorgan13!!!! @USWNT #USA #FIFAWWC Happy birthday, @MargotRobbie! I hope I run into you again on vacation. With your husband. In longer shorts. It’s the Semi-Finals of the Women’s World Cup, and I’m semi-delirious with excitement. Go Team #USA! @USWNT #ENGUSA #FIFAWWC #OneNationOneTeam #TheBachelorette herself, @AlabamaHannah, answered all of my #BurningQuestions! https://t.co/bc6YnXhd5H Today I put the HAA! in Jake Gyllenhaal. https://t.co/JJTy7tOmkV Henry Winkler got schooled by my geography experts Nate and Landon. @hwinkler4real https://t.co/m4sSXIeygl Happy birthday, @MissyElliott! Your birthday pancakes are almost done. I just have to put my thing down, flip it and reverse it. We have to stand up for elephants, or there won’t be any left to stand up for. #BeKindToElephants @TheEllenFund https://t.co/WnC6zAmQ7f It’s #InternationalJokeDay! Here’s an international joke. If you’re American in the kitchen and American in the bedroom, what are you in the bathroom? European. .@TheKalenAllen has you covered for your next cookout! Learn how to make some BBQ staples with a lot of BBQ sauce... with this video. #OMKalen https://t.co/1vFtsIagNS AAAAAHHHHHHHHHHHHH YOU DID IT!!!!! @USWNT #USA #OneNationOneTeam https://t.co/AvKnUatpYq This montage is definitely in the splash zone. @ellentube https://t.co/WjLPCL1vaA .@BlakeShelton and Sandra Bullock played \"5 Second Rule\" with me, and I loved every second of it. https://t.co/4NviunCofO Here’s a sneak peek at one of the funniest things happening this summer. #BringTheFunny https://t.co/kNT1bb7b3f #USA is still in the Women’s World Cup, and they play France today! I’m rooting for you, ladies. Remember, do not use your hands! @USWNT #FIFAWWC #FRAUSA  #OneNationOneTeam .@Pink, this song is still my jam. https://t.co/G292JKX6Mp @Lavernecox @ashleygraham ❤️ Wanna hear my Executive Producers’ favorite moments of the first season of our podcast? It’s right here! #EllenOnTheGo @EdGlavin @MaryConnelly @AndyLassner @kevinlemanII https://t.co/TZxLrpfSU2 It’s a good thing I don’t have a segment called “Ellen Rate My Baby and Dog,” because this would win. https://t.co/Jb7VgwYSdn When @KenanThompson was here for the first time, I had to get his first impression of a few celebrities. https://t.co/u0ojfmEozL I was moved by Rickey’s story on our show #Fearless. I’m so glad @AshleyGraham caught up with him after the surgery. Sending you love, Rickey. Happy #Pride! @Lavernecox\n\nCatch up with Rickey on @ellentube: https://t.co/e1ndd4kFph https://t.co/9es29ZkKmq Happy birthday, @khloekardashian. If you’re wondering if you’re gonna have an incredible year, it’s True. .@DavidSpade ran into Nelly at an ironic moment. https://t.co/SzVnp33ze7 My ride to set. #GameofGames https://t.co/ccPkd2E4RY Happy birthday to Aubrey Plaza. I’m celebrating on my stage in the Aubrey Plaza right now. @evilhag https://t.co/uMBr5FQAh2 If you don’t know what “ironic” means, hopefully these ironic things I found on the internet will explain it. https://t.co/1wSflEdBYZ 5 seconds is more than enough time for @MayaRudolph to make me laugh. https://t.co/RFfzPyJmIv Happy birthday, @ArianaGrande! If you can’t blow out your candles on the first try, just keep breathin and breathin and breathin and breathin. I’m always happy to stand beside Scarlett Johansson, @BrieLarson and @harto. https://t.co/KmyouleOeR Happy birthday to a man who makes every day a birthday party, @SeanHayes. ❤ @rickygervais I can’t think of a better way to discourage people from buying ellen underwear. Happy birthday, Ricky. .@ArianaGrande premiering her song on my show was one of the best moments of the season. #thankunext\n\nWatch the full performance on @ellentube: https://t.co/zw3eODpooe https://t.co/1oGAP9qnG7 .@AlabamaHannah is on #TheBachelorette Recap Show playing \"Never Have I Ever.\" https://t.co/8xnEUSlMWL My new favorite pool floatie. https://t.co/GEYQWfdBk5 This hilarious clip of audience dancing has been haunted by Annabelle. Watch out. #ThanksSponsor #AnnabelleComesHome https://t.co/eJswXOfvaQ Hi from the set of #GameofGames! My Executive Producers are talking about how things are going and their favorite moments from Season 16 of my show in this episode of #EllenontheGo. @EdGlavin @MaryConnelly @AndyLassner @kevinlemanII https://t.co/7fwUlkcMjO Brittany and @DrewBrees went to Africa on a humanitarian mission, and they got to see the gorillas! I couldn’t love these two more. #WeNeedGorillas @TheEllenFund https://t.co/qDvfTsDMUh .@BillieEilish had zero idea what was hiding in that box next to her. https://t.co/F41cD9B8C3 After this, Costco told me that I wouldn’t “Becoming” back to this store. @MichelleObama https://t.co/FCJPU1L3iZ This one’s a wiener. https://t.co/CQw6LQSKih .@LadyGaga and I went off the deep end in this round of #BurningQuestions. https://t.co/7wEOWnwuUV This family’s story will touch your heart. What @iamjeanniek did for them will overflow it. @ellentube #FirstEver #ThanksSponsor https://t.co/KathmebdQD It’s official – Jennifer Garner is gorgeous from every possible angle. https://t.co/oFHCBLciBt It’s @TheKalenAllen’s gay #pride episode! #OMKalen #PRIDEMonth https://t.co/hJTqJDycE9 One of my favorite things about my show is surprising people. That and the free coffee. https://t.co/jHFC96Uuo0 Happy #WorldGiraffeDay! I love giraffes. I don’t care how long it takes them to swallow. @HSIGlobal  https://t.co/6MARFOkq0R https://t.co/C9tEgLjsFi Happy birthday, Meryl Streep! I’m so glad you’re my friend and extra glad you’re not my mother-in-law. #BigLittleLies I asked @TomHanks some #BurningQuestions, and while I was at it, I answered a few of my own. https://t.co/UeYUA1uWYq @AlexDiLalla @andylassner Thanks for the great photo, @AlexDiLalla. Jerry Morrison III might be from some other adorable planet. https://t.co/10CUhcRliw My kinda dog. #Pride #FirstDayofSummer https://t.co/N2cVYj7hOk They say imitation is the highest form of flattery. In which case, I’m very flattered. Keep ‘em coming! Send your scares to @ellentube. https://t.co/mlIUVBIwvR I hid tiny microphones in my audience... and heard some very interesting things. https://t.co/X75MvbWvGA Send me your favorite summer photos! Use #EllenSummerPhotos and tag @ellentube. Just don’t drop your phone in the pool while you do it. https://t.co/WoeELe8hKo I love my viewers. That’s why one of them is gonna win $20,000 just for watching my show this week. That’s a lotta love. #ThanksSponsor https://t.co/qSotAeqqeP Refugees are people hoping for a better life. That’s the promise of America. I support #WorldRefugeeDay @NewAmericanEcon https://t.co/pldv3IztmR I just watched “Life in the Doghouse” on @Netflix. What this couple has done for rescue dogs is incredible. Go watch it, and then if you’re like me, you're gonna wanna support them. #HappyPride @DannyRonsRescue https://t.co/0FqjAKjiM9 #USA is about to play Sweden in the Women’s #WorldCup! I’m rooting for the US team. Most of my furniture is rooting for Sweden. #FIFAWWC #SWEUSA @USWNT Bradley Cooper answers all of my #BurningQuestions. Tell me something, boy. https://t.co/T9GlA8ieMo Happy birthday, Nicole Kidman! As a present, I’m agreeing to be in #BigLittleLies Season 3. Have your people call my people. I’m nominated for #ChoiceComedian in the #TeenChoice Awards! You can vote for me here. Shout out to my stans! 💯 https://t.co/QwIkhvUSrG .@KimKardashian has posted some revealing photos. On this show she revealed how @KanyeWest feels about them. https://t.co/CM07R5F43d My audience comes to have a good time, but some of them also come here to crush it on the dance floor. https://t.co/YylhhAtvcx You guys, something really weird is happening on my YouTube page today. I don’t know what’s going on with my videos. Be careful. https://t.co/heusAh97fP Happy birthday, @macklemore. You’re a hero for social change, for the LGBTQ community, and for petty Thrift Shop shoplifters. I finally answered the most important question on the internet... Does @TaylorSwift13 wash her legs? https://t.co/5c1bwozQko The only thing I love more than my @YouTube channel being in Pink’s new music video is the idea that Pink spends hours watching my YouTube channel. Love you, @Pink. https://t.co/2ZwdEUH9Es If you wanna hear what my producers had to say about last night’s \"Bachelorette\" episode, Luke no further. It’s #TheBachelorette Recap Show! @ellentube https://t.co/Sgb6D3iz2s Meeting @emekannaka was the best thing that could’ve happened to me this season. https://t.co/R86rW3Br9T Happy birthday, @BlakeShelton. I hope this is a big, big, big year for you. 💍 Our music producer @jonnynormanLA has made a lot of celebrity connections over the years, so he should be okay with my EPs going through his phone on today’s podcast. #EllenOnTheGo @EdGlavin @MaryConnelly @AndyLassner @kevinlemanII https://t.co/SxsOxCxt1y This #PRIDEMonth, I celebrate Seth. If you don’t know his story, take a look. https://t.co/OsTYv0bsGF #FindingDory premiered 3 years ago today! I’ll never forget where I was. Okay, I can’t remember where I was, but I had the best time. Take a look. https://t.co/8OWFPNA4fB My hidden camera prank called \"Speak the Lyrics\" is great for making new friends in public. @pommyrantz @BenteIngrid https://t.co/rFKzxz0sWm If there's one thing @iamjeanniek knows best, it's how to make people's dreams come true... while wearing a mustache. The new season of \"Life's First Evers\" is going to a whole new level. @ellentube #FirstEver #ThanksSponsor https://t.co/Tz1mr1e6i4 I love @GaryClarkJr. https://t.co/ek3lUrX4BC Yoyoka is an incredibly talented drummer, and her reaction to the gift I gave her is something I will never forget. https://t.co/ey9HyjBbkb It may be Monday, but there are still puppies. https://t.co/iyBhHu2blN I’m proud of @TaylorSwift13 for making this video. I’m proud to be in it. I’m proud to be a member of this community. Happy #Pride. @adamlambert #YNTCDmusicvideo https://t.co/UJXRBXRtE0 https://t.co/3x0OxNhNnF This oughta wake you up. Happy Monday! #MondayMotivation https://t.co/60yd1N9Wdi I’ve done some pretty big surprises on my show, but I can’t imagine a better surprise than meeting your new best friend. https://t.co/62AgAlJHzW My friend @TaylorSwift13 asked me to be in her new music video, “You Need To Calm Down.” It premieres tomorrow! Now I need to calm down. https://t.co/NQFMY0e12q @thelizfeldman ❤️ Happy #FathersDay! https://t.co/M0fGPjNJeF Happy birthday, @CourteneyCox, @LeahRemini,@ActuallyNPH and @IceCube! How I haven’t thrown you a joint birthday party before this is beyond me. .@TheKalenAllen has a new music video, and he is taking it to the skies. #OMKalen https://t.co/VRYpWV7oSV .@kumailn is in the best shape of his life. https://t.co/cec2KtdlER Y’all know I love a giant check. Thanks, @Shutterfly! #ThanksSponsor https://t.co/xUA1ISNFrs My friend Jennifer Aniston’s new movie with @AdamSandler, #MurderMystery, is on @Netflix now! After that, you can watch my Netflix special again. https://t.co/IHPkKbcQuy Life’s First Evers, Season 2 premieres Monday! I don’t think you’re ready for this, Jeannie.  #FirstEver @ellentube @iamjeanniek https://t.co/anoCzz92YH We all have #burningquestions for Jake Gyllenhaal. Today, I have burning answers. https://t.co/OQTT9EEWVy Everybody makes mistakes. Not everybody does it on television. https://t.co/idtupAa2u7 Aubrey Plaza was playing \"Speak Out,\" but we probably should’ve called it \"Scream Out.\" @evilhag https://t.co/OqHBnAlpV5 When I saw the viral video of @MaggieRogers in her music class with @Pharrell, I knew she’d wind up doing something incredible. Here she is doing it. https://t.co/ChrF12ac2m On today’s episode of the #EllenOnTheGo podcast, we all learn how closely @AndyLassner is paying attention. @EdGlavin @MaryConnelly @kevinlemanII  https://t.co/TZxLrpfSU2 Raise your hand if you’re adorable. https://t.co/eKA8AkWvU5 Aubrey Plaza still hangs out with her old \"Parks and Rec\" gang. @evilhag https://t.co/0JyEU2JHZR Some champagne went missing from our office kitchen. Good thing Adam was here to investigate. https://t.co/RX1hk0sNMU Elephants Without Borders has been hard at work proving that there’s a growing problem of poaching in Botswana. I couldn’t be more grateful to them. @ElesWoutBorders #BeKindToElephants https://t.co/Ct1OVRjDLB If you love the #AvengersEndgame, wait til you meet the new Average Avenger. @AndyLassner https://t.co/FteswSSF5h Jason Sudeikis did a monologue, and the people in my audience have never seemed more unusual to me. https://t.co/OYBqd8NMGb It’s not easy to make an engagement ring disappear, unless you're Fabio or a divorce attorney. @oliviawilde @standupmagician https://t.co/T879snEjxC This is my friend @official_tWitch dancing with my niece, Eva... Or as I now call her, Lil Niecy. https://t.co/K8AjFHyWlb Someone listening to my podcast is gonna win a year subscription to my BE KIND Box. But ya gotta listen to win! Subscribe here. #EllenOnTheGo https://t.co/TZxLrpfSU2 Jason Sudeikis sat down with kids, and it’s safe to say none of them will ever be the same. https://t.co/DnLOcg8WX2 See what my producers have to say about Luke P. in this week’s episode of #TheBachelorette Recap Show! @ellentube https://t.co/sfyYsxGmtf Growing up in the Sudeikis/Wilde house sounds like an adventure. @oliviawilde https://t.co/LqUWBhYbmQ Let’s make this the next \"Baby Shark.\" @oliviawilde https://t.co/ZjsWRuBiLU My staff is so excited for the new season of \"Younger.\" It premieres tonight! #YoungerTV #ThanksSponsor https://t.co/jMRXJV06XN It’s summer, but this sure feels a lot like fall. https://t.co/ALlJnjO0MG Next time we do #TheMaskedDancer – air holes. Sorry, @HowieMandel. https://t.co/xsPD6V9rkt The perfect look for your office #pride party. They have those, right? #PrideMonth https://t.co/8YnLKxNvo2 Everything was fine, and we were talking about healthy eating, and the next thing you know we’re talking about erections. @DeanOrnishMD https://t.co/nUHC3KT1IJ Watch this whole episode of #DoGoodDaniels on @ellentube today. #ThanksSponsor https://t.co/BhGHDTJCCS Forty years into his marriage, there are still some things @HowieMandel doesn’t get about women. https://t.co/KQ4MvcwPe8 You can’t see it, but I have a lawn chair set up on my coffee table, wearing a beer helmet. @USWNT  #FIFAWWC #USA #USATHA https://t.co/whNyXF4J5d In honor of today’s #EllenOnTheGo podcast, here’s a photo of @KevinLemanII’s 8th-grade graduation. We couldn’t love him more. https://t.co/TZxLrpfSU2 https://t.co/2ICX9z5ZTL When it comes to anatomy, @AndyLassner might be a little below average. https://t.co/kt9khZCA1e Going back to standup was scary, exciting and challenging, but I’m glad I did it. I’ve loved of every second of it. #FYC @NetflixIsAJoke\n\nhttps://t.co/ohHbsl0G0A Rolling a ball into a hole 50 feet away with no practice is almost impossible. Almost. https://t.co/VTkWXypeek I know people go on Yelp to review things, but these I couldn’t believe. https://t.co/OVWMFOHmHI It was only a matter of time before someone in my audience turned out to be a robot. https://t.co/Bti9jUtU8O When you need a people walker, there’s no one better than @Kevin_Nealon. https://t.co/dc8XPBeT2C .@MarioLopezExtra mopped the floor in this game with my Executive Producer @AndyLassner. Literally. https://t.co/t83Ht3nnUL I’m so ready for #BigLittleLies Season 2. I stole the graphic. https://t.co/PIY0NRp3zZ Carousel of a carousel with my brother. @vancedegeneres https://t.co/dBteSYdeJE Don’t forget to wash this new episode of #OMKalen! (See what I did there?) @TheKalenAllen https://t.co/Y1rMqiz7EM @jimmykimmel ❤️❤️ There are countless countries around the world where there are no mass shootings, and people can still have guns. Let’s have the conversation. Our lives depend on it. #WearOrange I love @officialJaden, and I love how he’s helping the people of Flint. https://t.co/SHLNwC9MWn Jaden and Willow Smith make a great team for @HeadsUp. Do kids not know what the wave is anymore? @officialjaden @OfficialWillow  https://t.co/xdCpFkCExP How did I wait this long to meet @JanetMock? https://t.co/cX6ywOjaTu Happy #NationalDoughnutDay! However you spell it. @ellentube https://t.co/HdFquz2d5B @danjlevy ❤️ Thank you for being the perfect interviewer, @JimmyKimmel... and the most amazing friend. @NetflixIsAJoke https://t.co/6laDvrB5z6 Rest in Peace, Dr. John. Your music made me so happy. https://t.co/7rYc2YpPaT RT @BarackObama: Last week, it was Virginia Beach. But day after day and year after year, too many families and communities are shattered b… There was no other performer like Dr. John, and there never will be. Tonight my heart is in New Orleans. .@SherylCrow, @TheBonnieRaitt and @mavisstaples. Three legends performing their new song together. That’s my kind of ladies’ night. https://t.co/GWv5cB8uzD .@DanjLevy is here! He’s funny, he’s sweet, and I loved meeting him. https://t.co/uMnQcRJ7dA .@EricStonestreet accidentally showed up in the middle of my hidden camera prank. https://t.co/dUhAdB9m3v New month, new list of favorite things! @Walmart #ThanksSponsor https://t.co/OtLmRmdvGQ https://t.co/t6U5PxqRrr Still got it. @official_tWitch https://t.co/IjfcsiUBS6 On this captivating episode of my podcast, @AndyLassner orders lunch. #EllenOnTheGo https://t.co/TZxLrpfSU2 .@EricStonestreet has this game licked. https://t.co/jt2gLPG6Y7 Here’s your chance to see #GameofGames live! Seriously. https://t.co/DAJgS5NMBV Jennifer Aniston knows the dress code for George Clooney’s house. @AdamSandler does not. https://t.co/qlsN126rvq My new BE KIND Box is available now. And one lucky person is coming to my Season 17 premiere. https://t.co/NE9Wu8VGru No matter how your day is going, it just got a herd of baby goats better. @Walmart @YogoatL #ThanksSponsor https://t.co/mIzOo2UgGw I heard my new friends talking about me on the @MorningMashUp, so I gave them a call. Shout out to mom! @SIRIUSXM https://t.co/maRae9smBu Happy birthday, @MarkWahlberg. You’ve become one of my favorite people. Hey, @StephenCurry30. Your wife tells me you’re interested in playing my #GameofGames. See you here. @ayeshacurry https://t.co/YLrBQjZo4j We all agree. There’s something about @MaryConnelly’s rash that makes you want to sing. https://t.co/mR0aX9Gbvq Jennifer Aniston survived a scary plane incident. Guess the first person she talked to, @ReeseW? https://t.co/NgHWgtnUiq It’s #GlobalRunningDay! I woke up this morning and immediately started running, mostly because @Oprah’s sprinklers went off and I was sleeping on her lawn. But also, because I love to run. @mlebear ❤️ Jennifer Aniston is in for a \"Friends\" reunion. Anyone else? https://t.co/Ro4jWBiZTE Happy #PRIDEMonth. #MyNextGuest @Netflix https://t.co/J3vSA0XmRO Emily Bear was here as a piano virtuoso when she was 6. You won’t believe what she looks like today. @mlebear https://t.co/X7kHfTN1H0 This is some of my best work. https://t.co/YxVqqmPjUy There’s no better guest for #TheBachelorette Recap Show than the actual Bachelorette, @AlabamaHannah! https://t.co/zbco2wChf9 I love this family so much. We gave the Daniels family $500,000 to give to deserving people in their community. Watch the whole episode of #DoGoodDaniels on @ellentube! #ThanksSponsor https://t.co/F9rY4uNa5R Harrison Ford told me about two of my favorite topics – dogs and gorillas. #WeNeedGorillas #TheSecretLifeOfPets2 https://t.co/OW32g4O2PJ I’m looking for someone incredibly special who deserves a life-changing surprise. Wanna do something incredible for someone who deserves it? Tell me about them here. https://t.co/SRhZftYbAu Harrison Ford watching Jake Gyllenhaal’s impression of Harrison Ford. https://t.co/fHpfpuYQJm I’m glad the hosts of my podcast are finally starting to listen to their subscribers. @EdGlavin @andylassner @MaryConnelly @kevinlemanII #EllenOnTheGo #Subscribe\n\nListen here: https://t.co/TZxLrpfSU2 https://t.co/RNRhIPYkYg .@AndyLassner, I love you. Whatever gift basket you sent to that Cirque du Soleil performer wasn’t enough. #AverageAndy https://t.co/hoir3YwkKW Dr. Ruth is here on her 91st birthday! @AskDrRuth #AskDrRuth\n\nWatch the full clip on @ellentube: https://t.co/5ObLjZc4Zd https://t.co/FGuRK8VSNT Spa day. https://t.co/rjCiKVxE75 .@KymDouglas is back! And Lauren might be gone forever. I’m not sure what happened in that shower. #ThanksSponsor https://t.co/MqyBFq2857 The best part about having your own show is that you can make up your own award ceremony and give yourself awards. https://t.co/SldqrLPzZ9 .@MattBomer has an exceptionally high pain tolerance. https://t.co/IzHeJk0g0c @kymdouglas ❤️ @mindykaling Next time let’s do it in matching onesies. .@KymDouglas is back, and her butt is so hydrated. https://t.co/eSSgXGdWah .@MindyKaling wrote her new #LateNightMovie for Emma Thompson without having met her. She’s met me at least 3 times, and I’m still waiting.   #ThanksSponsor https://t.co/h9XTM5CZHm I know most of the things that will happen on my show. I had no idea I was about to do a duet with a Whitney Houston impersonator. https://t.co/26lixrZnmT .@TaylorSwift13, you make me so proud. #PrideMonth https://t.co/nbVZoKOzub .@MindyKaling’s daughter and I have a lot in common. https://t.co/61VyLmom1z Happy birthday, @heidiklum! I love all 7 feet of you. Happy birthday, @amyschumer! I hope baby Gene got you something nice. Ever wanted to have breakfast with @TheKalenAllen? Here’s your chance. In this week’s #OMKalen, he has a pancake mukbang (whatever that is) and answers your questions about life, his new dog, and more. https://t.co/EyZMtwXH2Z My friend David @Letterman’s show needs no introduction. We laughed, we scared people in my office, and we talked about things I wasn’t expecting to talk about. It’s on @Netflix now. #MyNextGuest .@OfficialStedman was here! https://t.co/zy2hQBKluS When I stay in the Taco Bell hotel, I definitely want a deluxe room. https://t.co/wvZqGUGwQ4 Happy birthday, Colin Farrell. I hope you have a wonderful day, despite the fact that it won’t be with me. .@MarkWahlberg and his brother Paul shot some hoops for Million Dollar May. Which Wahlberg do you think came out ahead? https://t.co/zs3i1beDoz I can’t decide who I love more... @JonDorenbos, @iamjeanniek, @rhyshoskins, or the City of Philadelphia. #ThanksSponsor https://t.co/4eAwwlFqka Happy birthday, Clint Eastwood! I got you a bag of peanuts. It’s for your squirrel. But I didn’t tell him, if you don’t want to share. .@MarkWahlberg and I both love designer watches. You won’t believe the one I gave him today. https://t.co/KGYpSQzidS This is one of my favorite scares ever. I love you, @BillieEilish. \n@MelissaMcCarthy @TiffanyHaddish https://t.co/BUiEtSrJxj I love David @Letterman. In my new interview with him, we talk about some serious things and some funny things, and I appreciated all of it. #MyNextGuest @Netflix https://t.co/9Wl4jJDpWJ OMG, did you hear it’s been 16 years since #FindingNemo?! OMG, it’s the 16th anniversary of #FindingNemo! Wow. I may not have a lot in common with Dory, but I sure loved playing her. Mahk is heah tomorrah. @markwahlberg https://t.co/MiyBzHxlCL @1capplegate ❤️ Who wants $25,000? Watch every episode of \"Go RVing with tWitch and Allison,\" and it could be yours! #ThanksSponsor https://t.co/4iqhPuWH4P Remember Salif, our incredible dancer from Paris? He’s in the new @DavidGuetta video! Way to go, Salif! https://t.co/GgqUTG8rqU .@MelissaMcCarthy, @TiffanyHaddish and Elisabeth Moss are in #TheKitchenMovie together. I think they should do everything together. https://t.co/TPh6IFIwkq Jarvis had the best attitude when he didn't win a car at my Astros live shot. It was so fun... I had to give him another chance. #ThanksSponsor https://t.co/eMnJgSj6hv People claim @ShaileneWoodley has done some unusual things, and that is true. https://t.co/W4JMCZuCEG Now you can listen to my podcast on @Spotify using Alexa! How 2019 is that? #ThanksSponsor https://t.co/dONcTFhfng What can I say? I’m honored to have made the list. #Billions https://t.co/PZzpHtrBdx Happy birthday, Adele Dazeem! @idinamenzel @thelizfeldman ❤️ Do you floss every day? I have to know! @ShaileneWoodley I finally got to binge watch @DeadtoMe on @Netflix, and loved it so much. @1capplegate, @lindacardellini  and James Marsden are fantastic in it. So proud of my friend @thelizfeldman who created it. .@ShaileneWoodley got a master class from Meryl Streep on the set of #BigLittleLies Season 2. https://t.co/9MRvnCF4Ms .@MelissaMcCarthy is a big fan of @BillieEilish, so I thought of the best way for them to meet. Thanks for being here, Billie. https://t.co/IbKIe7z63M .@MelissaMcCarthy, Elisabeth Moss and @TiffanyHaddish brought me the exclusive first look at the trailer for their new movie, \"The Kitchen.\" You’re welcome, everybody. #TheKitchenMovie https://t.co/lwtC3gxWMx Now this is some good news. https://t.co/ft7Q8XpwI0 @Mariska ❤️ The weather isn’t great in Philadelphia – please stay safe. We love you, Philly! @JonDorenbos, @rhyshoskins &amp; @iamjeanniek were wonderful. Consider me a @Phillies superfan. https://t.co/5yVZuIXlZp This is why I love #AGT. https://t.co/PzhaNdzyHP I can’t believe I missed this @2Chainz performance, but I’m very glad it’s on @ellentube! https://t.co/fnlGL58PnK @Phillies #Philly, you still have time to come! You do not need a ticket to the game. We’re right outside the stadium with lots of surprises. Thomas Middleditch told my guest host @iamWandaSykes about his plane and the new #GodzillaMovie. https://t.co/EVBokIhxL6 My \"Bachelorette Recap Show\" is back with another recap of @AlabamaHannah’s journey! #TheBachelorette @thezenor @tracysgold @coreypalent https://t.co/pdPKcA7dJz RT @JonDorenbos: Let’s go Philly! Here at Phillies stadium now.  Come now and have a chance to win a sick new ride! @TheEllenShow https://t… I love playing “Oh, Straight People,” but I love @iamWandaSykes' game “Oh, White People” even more. https://t.co/M8WpHSTmGe @Phillies My Executive Producer @EdGlavin is a big @Phillies fan. Take a photo of yourself at Citizens Bank park, and tag Ed. He’ll be so excited. RT @TheKalenAllen: Listen up, don’t say I didn’t tell you because I did! But, if you live in Philadelphia get down to Citizens Bank Park AS… @Phillies Philly! My show is in between the intersection of Phillies Drive and Citizens Bank Way. You still have time to get here, galoshes and all! @Phillies Happy birthday to the incredible @LaverneCox. The world needs more of you. .@iamWandaSykes asked Thomas Middleditch to do his best job selling this item that he couldn’t see. I love when we play \"Pitch Please.\" https://t.co/hVDv0RuwGv @iamwandasykes ❤️ Who’s the biggest @Phillies fan? Grab your rain boots and head over to Citizens Bank Park by 4PM if you want to be on my show. Jasmine’s class singing \"Old Town Road\" has been tearing up the internet. @iamWandaSykes did a wonderful job surprising her. https://t.co/8QdzqxtA7i .@iamWandaSykes is hosting my show today, and it’s fantastic! https://t.co/9ZzV5WvsFk My show is coming back for 3 more years! That means 3 more years with these nutjobs. #EllenOnTheGo @EdGlavin @andylassner @MaryConnelly @kevinlemanII\n\nListen here: https://t.co/TZxLrpfSU2 https://t.co/a8kqrw65Hm Gillette, this is nothing short of incredible. https://t.co/jGS1962lh2 I heard @WillaAmai’s music, and I immediately invited her on my show. She is amazing. https://t.co/3QdwM79nGx I hope you ride like you ski. @guskenworthy  https://t.co/UxXXTeomEg https://t.co/aN3UPxa7Jm .@AliWong is hilarious... especially with her face in a plate of Fruity Pebbles. https://t.co/Vrc0e54fhx I’m glad @BeePrinsloo made time to watch my comedy special, considering everything else going on in her life. She’s a true friend. @adamlevine @adamlevine @adamlevine https://t.co/w5PuLu9WUO If you know how to say “Schuylkill,” then you’re probably ready to be on my show tomorrow. Rain or shine, see you at Citizens Bank Park at 4pm, Philly! @Phillies @WillaAmai ❤️ This teacher deserved something really incredible. What a coincidence it’s Million Dollar May. https://t.co/K4AKddUwqK I can’t imagine a show making you feel any better than this. Please enjoy the first episode of #DoGoodDaniels. #ThanksSponsor @DoGoodDaniels https://t.co/F3ozcP1LXC .@AliWong taught me what a GILF is. https://t.co/AbBKOeS5CR I’m a big fan of David @Letterman. It was an honor to be on his @Netflix show, even though he didn’t introduce me. https://t.co/nWv9Adc4OH Philly! Pack up your cars, drive home from down the shore, my team is coming to your city on Wednesday. (My executive producer told me to say that. I won’t mention names. @EdGlavin) It’s #MemorialDay! When you’re done shopping for a new mattress, you can save 20% in The Ellen Shop. https://t.co/PeXDMNmVcF https://t.co/QxPWNIuccm Sending love to everyone who has served and are serving our country this #MemorialDay. https://t.co/cIRvUVadnQ Poor, sweet Joel. Nobody expected @SnoopDogg to throw this well... or this hard. https://t.co/dkdPKZbjdL I didn’t want you to miss a minute of my interview with Will Smith, so I put it all here. You’re welcome. https://t.co/qsABdpAJPO Happy birthday, Ma! @octaviaspencer You’re not gonna want to miss this @TheKalenAllen Reacts. Unless you’re chicken. #OMKalen https://t.co/iLZWtQasQ4 @SnoopDogg Come back as soon as you possibly can. Well, that kept them busy for an hour. @ellentube https://t.co/UgWNTEZyER Going to Rwanda was a trip I waited my whole life to take. This banana split outfit is a costume @AndyLassner has waited his whole life to wear. @TheEllenFund https://t.co/9ggal8zqkm The trick to great parenting is patience. https://t.co/myiuvfFxrK I wasn’t expecting to give a car away this fast. This was crazy. @JustinVerlander @Astros #AstrosOnEllen #ThanksSponsor https://t.co/5e8GpNbhWl .@SnoopDogg was here, and I’ve never seen my staff eat more chocolate chip cookies. https://t.co/3PqJUKGrN6 .@SnoopDogg was not playing. https://t.co/0BJH06vmNW Taiwan is now the first Asian country to allow marriage equality. Let’s celebrate every step in the right direction. https://t.co/RXLarW5TJO .@official_tWitch and @LoniLove met some incredible animals on my show while I was out. I was wondering why there was sawdust in the bathtub in my dressing room. https://t.co/DdIfbil0vd We’ve been posting a lot of fun, never-before-seen moments on my @Spotify page. Have you seen it yet? #ThanksSponsor https://t.co/XsQ7nJWBSu .@LoniLove has a new love. @official_tWitch https://t.co/V9HK9OEdCM .@official_tWitch and his family are so adorable, I sent them traveling around the country in an RV for a new digital series! This is gonna make you smile. @Allisonholker @ellentube https://t.co/bu3ibpbqVM .@official_tWitch played a new game called “Do You Think They Can Dab?” As usual, he was very good at it. https://t.co/VBCp6cxDkV This is what I miss when I’m out? 😡 https://t.co/MiYnBwp3Tn I love Philadelphia, and I’m sending my team there next Wednesday. Be ready, and tell us why we should meet you. https://t.co/wjRcETgHoB I got my nose. Did you get yours? #RedNoseDay #NosesOn https://t.co/unTLzjxDFG .@official_tWitch and @kunalnayyar danced brilliantly with the dance move playing behind them in our game “Can tWitch and Kunal Dance… with What’s Behind Them?” https://t.co/J25oSoexbh Jerry is a big #buzzlightyear fan... which is hard for @TomHanks. #ToyStory4 https://t.co/pYTrOYqpj2 Thanks to everyone who showed up at the @Astros game, especially @JustinVerlander. Y’all were fantastic! Not at throwing, but... 😃 #AstrosOnEllen airs Friday! .@TomHanks answered all of my #BurningQuestions, and then some. Hi, @Cher. https://t.co/xcixsLLW3e President Masisi, for every person who wants to kill elephants, there are millions who want them protected. We’re watching. #BeKindToElephants @OfficialMasisi https://t.co/iTSAYXvrfM @astros Houston, we have a problem. You’re almost out of time. @Astros #AstrosOnEllen You guys, I finally figured out all of it. #GameOfThrones #AvengersEndgame https://t.co/oHKe7tFeJ7 .@TomHanks has two Oscars, but he couldn’t get a beer at Stagecoach. https://t.co/k1VjsSJS49 Houston, you still have time! Grab your cap and head over to the Plaza on Crawford Street right now! I promise you won’t regret it. @Astros #AstrosOnEllen I did a special version of Million Dollar May called Million Dollar Milo, and I had the perfect Million Dollar Milo to help me. @MiloVentimiglia #NosesON https://t.co/UHjUAXS7dh If school was as fun as it is in this episode of #Momsplaining with @IMKristenBell, I never would have left. #ThanksSponsor @momsplaining  https://t.co/Iz7oTZJmdg Hey, Houston. I have a big surprise for you at the Astros game today, so come dressed like you’re the biggest @Astros fan in the world. #AstrosOnEllen I met 6-year-old space expert Jerry Morrison III for the first time today, and he just about knocked me into orbit. https://t.co/7ZecGlVKWH @astros Head over to Minute Maid Park by 3PM for a chance to be on my show – or it’s one, two, three strikes you’re out at the @Astros game! #AstrosOnEllen https://t.co/kKGL1UQaja I don’t know if I’m ready for the final goodbye between Woody and Buzz. @TomHanks #ToyStory4  https://t.co/Hmen20DLYU Hey, Houston. I’ll be looking for the biggest @Astros fan at the game today, so come dressed in your finest Astros gear, because ya might just be on TV. #AstrosOnEllen https://t.co/kKGL1UQaja @BethBehrs @andylassner ❤️ Houston, I’ll be looking for the biggest @Astros fan at the game tomorrow. I hear everything is big in Texas, so I’m expecting a lot. Dress up BIG, and you could win something GIANT. #AstrosOnEllen https://t.co/kKGL1UQaja Doing this show has been the ride of my life. https://t.co/Mytkjxj4xa On today’s podcast, my Executive Producers talk to my celebrity producer Matt Wright. I hadn’t heard this story from my birthday party. #EllenOnTheGo @EdGlavin @andylassner @MaryConnelly @kevinlemanII https://t.co/cU97HMOQeu I don’t care what Portia wants for her birthday, I’m never doing what @jadapsmith did for Will Smith. https://t.co/DEUzeVmSPg .@MenaMassoud and @NaomiScott are about to be really big stars.  #Aladdin #Jasmine #Genie https://t.co/BObYBSSC5F If you watched #TheBachelorette last night, you got an eyeful. Now get an earful from my \"Bachelorette Recap Show\"! @tracysgold @coreypalent @thezenor @ellentube https://t.co/NFkhd4u36t Will Smith is so afraid of mice, he can’t even look at the one I have right next to me. https://t.co/UCS4Y9ZxrK The last time the WAFFLE crew was here, I had a subway car built just for them, so I brought them back to use it one more time. https://t.co/AuaHWLXGUG Will Smith and the cast of #Aladdin played a memorable game called “Rub My Lamp.” @MenaMassoud @NaomiScott https://t.co/0mIFSiq6os She’s the 100m record holder and the first openly gay sportsperson in India. I guess she knows a thing or two about being first. I’m so proud of her. https://t.co/auoyWY8yvk @rickygervais I’ll start right now – everyone go watch #AfterLife! As for pants, I’m sending you these ASAP. #Relatable @netflix https://t.co/ObAskQUQI5 .@ReeseW was wonderful at \"5 Second Rule.\" She just needed a half hour or so to figure out the buzzer. https://t.co/qg6jJYgf9P @ReeseW 😂😂😂 #photoshoplies This billionaire gave a commencement speech at Morehouse College, and then paid off all of their student loans. You are incredible, Robert F. Smith. https://t.co/IvP31Y2tNe The only thing I love more than giving money to deserving people is giving money to deserving people who give money to deserving people. It’s a vicious cycle of kindness. #ThanksSponsor https://t.co/U05usr6Fuj Happy birthday, @cher! I got you, “Babe.” https://t.co/rM3vRzL3BQ I couldn’t be happier for @ReeseW, her impending twins, and her new career as a plastic surgeon. https://t.co/Ywvtn078LQ It’s the last episode of this season of Go RVing with @official_tWitch &amp; @Allisonholker! I promise it’s more satisfying than anything you may have watched last night. #ThanksSponsor https://t.co/4iqhPuWH4P I sent my writer Adam to the very last Blockbuster Video to do a hidden camera prank. It’s time for Kevin the Cashier at Blockbuster! https://t.co/eAin6KY8FT @BenergyEAC @EdGlavin @Eagles @FOX29philly @SWilsonFOX29 @LucyNolandFOX29 @JClarkNBCS @JonDorenbos You’re amazing, Ben. Happy birthday! If you’re planning to go to an @Astros game this week, I hear it’s gonna be a good one on Wednesday. 😉 #AstrosOnEllen https://t.co/gOS6PZQLhF .@ReeseW took this whole “Jen Aniston is better friends with me” thing too far, so I took it all the way to the top. https://t.co/voskonZlxG Look at this... my friend @Oprah gave half a million dollars to one of my favorite principals, Akbar. He’s such an amazing guy. @PrincipalAkbar https://t.co/PvFWUcMjv3 .@ReeseW told me about #BigLittleLies Season 2 and \"Legally Blonde 3\"! Someone should declare this a national holiday. https://t.co/a1DLVRFluZ I’m so excited for #GameOfThrones. I don’t know what I’m excited for, but Portia will explain it as we go. She loves when I ask her questions during the show. #GameOfThronesFinale Happy birthday, @SamSmith! I love you... and I know I’m not the only one. Can you believe there are people who have never watched #GameofThrones? #OMKalen @TheKalenAllen https://t.co/uTukZnShL6 Look, I made it easier for you. It’s all of the @TaylorSwift13 clips in one. You're welcome. https://t.co/0pZkGG3HmP Someone is jealous of Charlie. https://t.co/3JgAcElIig .@OneRepublic is here with a new song and a new show. https://t.co/VpkuzsRLZT Hey, #GameofThrones people... we should make a crossover episode. You’re welcome. https://t.co/8doeJplGrI This Lil' Mushroom has some giant skills. https://t.co/yq20nGENGG Nate and Landon are hilarious together. You can’t not watch these two. #ThanksSponsor https://t.co/GAFHPmgvMM #KeanuReeves has an incredible talent for doing stunts. His signature on the other hand... https://t.co/8187fJpfdw Lil' Mushroom gave my big mushroom a good scare. I love you, @AndyLassner. https://t.co/SK3iItNScR .@KrisJenner gave me a cold. Worse than that, I now owe her 10% of my NyQuil. https://t.co/wZzZmDvJ19 #KeanuReeves was here for the first time. Hey, Sandra Bullock, he had a crush on you too!! https://t.co/rKXNrTsFbT @JJWatt I feel you may not be eligible for this one, but you should definitely show up, assuming there will be something to show up for. 😊 My friend @OliviaWilde is here today, and brought me an exclusive first-look at the “Booksmart” trailer, and it looks hilarious. #ThanksSponsor #BooksmartMovie https://t.co/RZYMIGb2mS My new Alta bedding collection at Bed Bath and Beyond is the perfect gift for your bed. It deserves something nice. https://t.co/jYzAlMDGUe https://t.co/GUvirWjB7o If you’re a fan of the Houston @Astros, and watch my show, I am looking for you. I can’t tell you why, but you’re gonna want to click this link. https://t.co/OJPddbOx5p Everything @MelissaMcCarthy does makes me laugh, including playing #DangerWord. https://t.co/6E41yZvNbB .@MelissaMcCarthy guest hosted my show today! Maya Rudolph knew just what she needed to calm her nerves. https://t.co/3u2KOiqKnY .@MelissaMcCarthy met Chassidy and Jaida when we gave them something to help pay for school. Today she brought them back for something even more wonderful. https://t.co/reuMstyn21 .@MelissaMcCarthy and @MayaRudolph talked about how the movie \"Bridesmaids\" changed their lives forever. https://t.co/HylyIjNo97 Look what you made me do, @TaylorSwift13. #BurningQuestions https://t.co/nUmL6y7en2 You could win the engagement ring of your dreams, thanks to my show \"A Decent Proposal\" with @Harto and James Allen. Your chance ends tonight! https://t.co/ZModRCTl1m .@MelissaMcCarthy took over as host of my show for the day, and her friend @IMKristenBell had some beautiful words of advice. https://t.co/JvmVINiY1x I stand with the women in Alabama, Georgia, Kentucky, Mississippi, Ohio, Missouri, and everywhere, who have the right to decide what happens to their bodies, as we all do. .@MelissaMcCarthy loves @BillieEilish. This is my new favorite music video. https://t.co/52jzsREcCP Tomorrow, @MelissaMcCarthy is guest hosting my show. I made her a new show opening and theme song. https://t.co/ptOrGY3SqR Do you know someone who really deserves a holiday miracle? Tell me about them here! And then don’t forget to watch my \"Greatest Night of Giveaways\" this holiday season on @NBC! https://t.co/SRhZftYbAu .@TaylorSwift13, we never go out of style. https://t.co/1lRfzL7ufZ Those tiny, tiny microphones I hid in my audience catch everything. https://t.co/p79rllveLC This episode of #Momsplaining is about to fill you with so much joy. @IMKristenBell #ThanksSponsor https://t.co/fE33BtjqFD .@chefjoseandres is a brilliant and hilarious chef. I don’t care what the vegetables say about him. #VegetablesUnleashed https://t.co/z0i7jUeJo2 https://t.co/tQskqYHH9P .@TaylorSwift13 hasn’t done an interview in years. She has a lot to say. https://t.co/bAks45CAK2 Do you wash your legs in the shower??? https://t.co/ROBQ9ICgbo .@TaylorSwift13 left some Easter eggs about her Easter eggs. I haven’t been this excited since Easter. https://t.co/CZYHXW75jW @chefjoseandres @taylorswift13 You and the vegetables were both unleashed, and it was wonderful. .@TaylorSwift13 answering #BurningQuestions is kind of amazing. https://t.co/9CGaw91el3 .@TaylorSwift13 is here tomorrow! https://t.co/gKuAtnEZQp I couldn’t be more excited to be on the new season of “My Next Guest Needs No Introduction” with, well, he needs no introduction. (It’s David @Letterman.) https://t.co/sspmrCrmwJ Just one more reason why I don’t have kids. https://t.co/hcyqEeQwNU There’s no one better than Clayton Kershaw to help a huge @Dodgers fan pitch her way to a big prize. It’s Million Dollar May! #SparkKindness @ClaytonKersh22 https://t.co/W7HN4Hd17l @foofighters I’m rocking as hard as I can. @Dodgers @ClaytonKersh22 @KershsChallenge A whole lotta people at my show were excited about this today. I am guest on my EPs' podcast today to talk about how we knew @KimKardashian’s surrogate was in labor before @KrisJenner did. #EllenOnTheGo @EdGlavin @MaryConnelly @andylassner @kevinlemanII\n\nSubscribe here: https://t.co/TZxLrpfSU2 https://t.co/Hn4FmHY9ri Yoyoka is only 9, but she’s drumming at a @FooFighters level. I surprised her with a message from the lead Foo, Dave Grohl. @yoyokadrums https://t.co/HCJWceuzIm Love is all you need. https://t.co/qsi0AEw1Zc It’s that time again! My producers are back for another season of the #TheBachelorette recap show, and @tracysgold has a very special announcement. @thezenor https://t.co/q2qg9leyHz .@MaryConnelly's rash is spreading. #TheBachelorette https://t.co/V2RB9IfAgo It turns out making @OctaviaSpencer and @official_tWitch dance like the dancers I put behind them is a lot of fun. https://t.co/UAs1VxuGVD @andylassner Lol. You’re fired. Get ready, Swifties. Wednesday’s the day. @taylorswift13 https://t.co/unN24XtEeQ Here’s a little something to make your Monday better. You could be sitting in my audience for the next season of #GameofGames! https://t.co/DAJgS5NMBV I can’t put into words how adorable this 9-year-old Irish magician is. https://t.co/v6XMUJvJAl Tarrina thought her husband was deployed in Egypt. She had no idea he was backstage. https://t.co/RjGnA5ixWg The sexiest dad on TV, @SterlingKBrown, told me what he was like in high school. https://t.co/7ZncY3oWr4 Christopher Abbott told me about acting naked with George Clooney. https://t.co/r2FcnLgyms Jason Momoa can really throw an ax. https://t.co/lrSzGhrsOJ After a performance like that, we’d all need a little snow to cool us down. @official_tWitch and @Allisonholker head from #MagicMike to Park City, Utah on \"Go RVing\"! #ThanksSponsor https://t.co/Cpv4BvYXbz Happy birthdet, Stephen Colbert! @StephenAtHome .@SterlingKBrown may never come back to my show after this. https://t.co/uzHf4em5BP This is gonna be epic. https://t.co/NlTmQxvC88 3 more days! 3 more days! 3 more days! @taylorswift13 https://t.co/755Xx3cDbs Remind me not to go to this bar. #MothersDay https://t.co/yJGCNlJOB8 Happy #MothersDay! Here’s my GIF to you. https://t.co/l3CbyOuuW4 Surprise! We’re having a baby! #MothersDay https://t.co/0dLlnRuvrJ We never go out of style. See you in four days, @taylorswift13. https://t.co/V1zJMrUG64 .@TheKalenAllen’s mom reviews are just what you need this weekend. #OMKalen #MothersDay https://t.co/8TYvH0V4U9 \"Shuffle Baby\" is a game I invented where you use babies as pucks. Obviously, I don’t have any children. https://t.co/sbxF5rBQkO Mother’s Day came early for these lucky, first-time pregnant moms in my audience. It’s my #MothersDay Show! #ThanksSponsor https://t.co/ew2LPJa7fj Wednesday, May 15th, @TAYLORSWIFT13 is gonna be talking to ME! https://t.co/QXKIa1ijbt I really know how to make a pregnant lady cry. #MothersDay https://t.co/D6L0lDvoHQ .@KrisJenner told us how she helped deliver some of her grandchildren. https://t.co/RpVDjc8e6t Can’t stop listening to \"I Don’t Care.\" Clearly this is about me. @edsheeran @justinbieber https://t.co/fmJ4WNywQ2 I can’t believe these guys left my show and went to Rwanda. I need more fans like this. #WeNeedGorillas @TheEllenFund https://t.co/FmLi4xb6XZ It’s my #MothersDay Show! @KrisJenner helped me give away some very exciting gifts to some very pregnant ladies. https://t.co/UgJKVKv5l2 You may remember Pickle Boy from my #MothersDay Shows. Today I’m introducing Banana Split Man. @AndyLassner's never looked better. https://t.co/NpMABL5cgF I knew @KimKardashian’s surrogate was in labor before @KrisJenner knew. That was fun news to give. https://t.co/T8W4FBiIsW I surprised @KrisJenner with 6 of her grandchildren. Then I surprised her with one more. Sending love to you, @KimKardashian and @KanyeWest! @kourtneykardash https://t.co/7SzHA2sahM .@KrisJenner is here tomorrow to catch up with the Kardashian Sister/Kousin. #KUWTK https://t.co/MuklHauL0D If you were upset by the continuity mistake on #GameofThrones, I spotted one more. https://t.co/uJbph9OjFQ The Sultan of Brunei passed a law that made being gay punishable by death. George Clooney spoke up. I couldn’t be more grateful. https://t.co/TYZNdrHMN8 After his accident last year, George Clooney doesn’t ride motorcycles anymore. So I got him this. https://t.co/aRJgjiVYIy Oh, the fun we had when George Clooney was my work neighbor. https://t.co/cqyTvdtv8g If you don’t have a great present to give for #MothersDay, this is gonna make you feel a lot better. https://t.co/cHZBFnGN5K George Clooney knows exactly where to go for baby advice. https://t.co/GlkXvFgE6o I had no idea how snakes made babies. #Momsplaining with @IMKristenBell is BACK! https://t.co/Cu1CmqSmqp A word to you mothers from Jennifer Garner. https://t.co/jWxoT7hE23 I found out why Jason Momoa was shirtless at the Oscars after-party. https://t.co/a1CtyeDzDz Who’s ready for more Million Dollar May?! At some point, someone is gonna win BIG. #SparkKindness #ThanksSponsor https://t.co/I4RP33IUn7 My producer @kevinlemanII has a big crush on Jason Momoa, so @EdGlavin arranged something special for him. https://t.co/dMburzv89C Young Dylan had a dream come true right on my show. @kenanthompson https://t.co/EUqtQgs9cx Do NOT hang out behind the fridge at Jason Momoa’s house. 🐍 https://t.co/YIKVEQpMTV Happy Teacher Appreciation Week! I ❤️ teachers. https://t.co/RX4ppTSDUN Is it hot in here, or is Jason Momoa throwing axes? https://t.co/Ty0w8SrPku Tomorrow. Momoa. Whoa-a. https://t.co/ByQtO7UQrL @PaulaAbdul ❤️ @hwinkler4real ❤️ This is the moment Andy Zenor talked about on the #EllenOnTheGo podcast today. #Classic #GetMeABib  @thezenor https://t.co/PsVbfC2SZq Don’t worry, @AdamLevine. From now on, Jake Gyllenhaal can text me directly. https://t.co/j9hQylfg0k .@hwinkler4real was here, and we scared the Fonzie outta him. https://t.co/r7WQA72I4F .@PaulaAbdul can do things I don’t think even she knew she could do. #BBMAs https://t.co/AeXuPZ7uxb The man in the short shorts, Andy Zenor, is the guest on the #EllenOnTheGo podcast! I had no idea how he got hired on my show. @thezenor @andylassner @MaryConnelly @EdGlavin @kevinlemanII https://t.co/TZxLrpfSU2 My hilarious friends Nate and Landon took on @hwinkler4real in my new game, “Are You Smarter Than Two Kid Geography Experts?” https://t.co/m4sSXIeygl .@TheKalenAllen is here to recap the good, the bad, and the camp from the #MetGala. https://t.co/8cafQoXu2L Congratulations, @AmySchumer! I found some good advice for you. @GoldieHawn https://t.co/2BgNnRaJks Nate and Landon’s pen pal friendship is one of the greatest things to come out of my show. https://t.co/4jVKmLUur6 There were a number of problems with our new game, “Words of Danger.” https://t.co/KoOUyaq147 Y’all saw this scene in the #AvengersEndgame when #RocketRaccoon sings Shallow to #Thor? https://t.co/DPcDiEDgWN Jake Gyllenhaal is handsome even when he’s screaming at me. https://t.co/YIUO4k8uGP @NaomiWadler I’m so happy you’re a part of it all. Coming out is a brave act. You’ve got to watch this. @easton_matty https://t.co/Wm3rtia9c4 .@official_tWitch, @Allisonholker and their kids could be dancing their way through your town on this new season of \"Go RVing\"! #ThanksSponsor https://t.co/GGp6Q2VZXH Just call me mother of shredding. #GameOfThrones https://t.co/2ZjjLtmrWa Our voices are louder than you think. Keep them raised.  https://t.co/7kgoBsjrYV This might be the highest stakes marshmallow toss ever played. #ThanksSponsor #SparkKindness https://t.co/POIG6l6R6o Happy birthday, George Clooney. Thanks for making the world a better place. https://t.co/7kgoBsjrYV Nobody scares @BlakeShelton and gets away with it. Including @itsJulieBowen. https://t.co/gKvDP9uuWg @Lavernecox ❤️ Monday morning with BAE. https://t.co/CaIpqyJCV7 The #royalbaby is here! Congratulations, Meghan Markle and Prince Harry. The baby is 7th in line for the throne, which is crazy, because right now I’m 7th in line for the key-making kiosk at my grocery store. @RoyalFamily Congratulations to everyone who works so hard to make this show what it is. And no you can’t have tomorrow off. #DaytimeEmmys I asked @JohnBradleywest about the ending of #GameofThrones. Spoiler alert! He didn’t really have any spoilers, but he did have some info. #SamwellTarly https://t.co/pRChMPmyyc Happy #CincoDeMayo to everyone celebrating responsibly! And to everyone celebrating irresponsibly, put your shirt back on, sit down and have some water please. Happy birthday, @Adele! I hope whatever age you are turning is the title of your new album. The only thing I like better than @harto’s one take intro to \"A Decent Proposal\" is this blooper reel of all the times it went wrong. https://t.co/20BLqB107I It’s #AntiBullyingDay and #FirefightersDay! Two things I love to celebrate. Nobody better THINK about bullying any firefighters today. .@TheKalenAllen is back at it, reviewing Mac &amp; Cheese recipes. #OMKalen https://t.co/K22H1znYJK May the force forever be with you. ❤ #StarWarsDay #MayThe4thBeWithYou https://t.co/WmJfvEqXW9 I knew @SophieT and @JoeJonas would end up together. If you watch #GameofThrones, there were a lot of signs. #SansaStark https://t.co/P3bojgmcUq Being able to do this for Zion and his mom was the best feeling I had all week. #ThanksSponsor https://t.co/9yGXARG2jA It’s almost #CincoDeMayo! I played a special round of Cinco Second Rule, and my audience won tickets to Doce Days of Giveaways. https://t.co/IJ0DKSYCIh @BethBehrs Then my work is done. .@KenanThompson did an impression of @JayLeno for Jay Leno. How’d that go? https://t.co/Cu435HDH7W Zion and his mom Kimberlli are two of the most incredible people I’ve ever met. As far as I’m concerned, they both deserve a gold medal. https://t.co/JfklpFdJGI This 10-year-old girl is a violinist, and she’s about to wow you. @PostMalone https://t.co/ofXOjGygaW .@KenanThompson was here for the first time and he brought famous friends. https://t.co/gyyD8Cj2yq After 279 episodes, @kunalnayyar told @official_tWitch  how he felt saying Raj’s last words on The #BigBangTheory. https://t.co/7kEEBWW5kC @JayShettyIW @ellentube This is very very very very very good news. .@BTS_twt’s incredible performance of “Mic Drop” is now on my @Spotify playlist! #TBT #ThanksSponsor https://t.co/Pv8XUtKuUN Unlikely, untested, unprecedented and absolutely  wonderful. @TIME @PeteButtigieg @Chas10Buttigieg https://t.co/tPU78zStcn This made me very happy. Thanks, @Walmart, for helping me #SparkKindness all month for Million Dollar May! #ThanksSponsor https://t.co/PNfpLjbQ0f Achieng is in my audience, and hasn’t seen her family in 2 years, since they’re in Kenya and South Africa... which is weird, because I’m pretty sure I have some people from Kenya and South Africa backstage. https://t.co/Sa4L0xMby8 .@AndyLassner and Bridget are this generation's Laverne &amp; Shirley. They did an amazing job at the Billboard Awards. #BBMAs https://t.co/uuehSkO3gN Happy birthday to 3 of my favorite people, Ellie Kemper, David Beckham and @TheRock... or as I now call you: Tall, Grande and Venti. On this episode of the podcast, hear how @MaryConnelly’s epic rash surprise came together! #MarysRash #EllenOnTheGo @EdGlavin @andylassner @kevinlemanII https://t.co/TZxLroYi2u What the blank just happened? https://t.co/Kc7DIFVUxM .@Diane_Keaton needs more than 5 seconds to answer these questions, so today we’re playing \"10 Second Rule.\" Diane’s movie \"Poms\" is out May 10th. Go see it! https://t.co/8Hq9nW2mYR You have a chance to win $10,000 every week this month! Find out how in my #GameofGames app! \n\nDownload the app: https://t.co/8WXf7qLYEz\nhttps://t.co/Y7jxzHtiz0 #SamwellTarly is alive! @JohnBradleywest was here for the first time. I love this guy. Don’t ask him how #GameofThrones ends though. https://t.co/QHhCAHYFBF My apologies to @BTS_twt for the very average interview conducted by the very average @andylassner. See the whole thing tomorrow. #BBMAs https://t.co/Sjmg2dFqq5 While you’re shopping at @Walmart for my new spring #EV1 collection, you can also check out my favorite items for May. https://t.co/yrsYPoQcvm https://t.co/kgQM3OB5X2 When I gave @JLo my proposal countdown clock, she was engaged in weeks. I hope you’re ready, @gwenstefani. @blakeshelton https://t.co/Llc2QJrmQT Who wouldn’t want Marcos to rotate your tires and play you some @HansZimmer? https://t.co/8AbEEmn0m3 It’s a good thing @BlakeShelton has a new pair of Ellen underwear in his dressing room. https://t.co/j0HUaWWhYU Las Vegas peeps! If you don’t have plans tonight and wanna see my friend @Kelly_Clarkson host the Billboard Music Awards, I have a pair of tickets. #BBMAs are on NBC tonight. https://t.co/U6kVcJw6F1 I have playlists for #AllTheMoods on @Spotify. #ThanksSponsor https://t.co/h2sn9ATI5y Something about Costco makes me wanna shoop shoop shoop. https://t.co/WE8uWz91gk I tried my hand at drawing the hand. https://t.co/kDtvcVVj96 Megan is all of us when we get to meet @ZacEfron. https://t.co/KiKXLPeO6d It’s #HairstyleAppreciationDay. #TooSoon https://t.co/cSNy4Kx4Tv One of our favorite podcast episodes. @TheKalenAllen stops by. #EllenOnTheGo \n\nListen here: https://t.co/TZxLrpfSU2 \n@EdGlavin @andylassner @MaryConnelly @kevinlemanII https://t.co/DTq9LtrAur .@ZacEfron has a very good grandpa. https://t.co/NuNNiBqWv7 Maggie didn’t win the $5,000 I hid in one of my BE KIND boxes, but I had another surprise for her. #ThanksSponsor #SparkKindness https://t.co/NlPOZMQNgz Travis Scott, I hope your birthday is sicko. @trvisXX @KylieJenner https://t.co/1TBooEr9GZ RT @ellentube: Hi, @ZacEfron’s abs. @TheEllenShow https://t.co/k8g03qPZ0g Whoa, baby. https://t.co/fK6HtQd0BR I’m very glad @ZacEfron made it down the mountain with at least one knee intact. https://t.co/0cccFMml6f Have you ever had a terrible, terrible hair experience that took hours and hours to fix? Me too. https://t.co/nleAiB2lsd @ciara ❤️ @ZacEfron You always make me happy. Shirt on or off. .@ZacEfron looks like he’s been carved out of marble. The wax version isn’t so bad either. https://t.co/t6v2j65I24 .@KourtneyKardash gave me all the details on her 40th birthday party. I’m glad it wasn’t a liability, @KimKardashian. https://t.co/Fb2XqSQ8BA .@KourtneyKardash’s @pooshdotcom has arrived. #ThanksSponsor https://t.co/GeJh5RHnAX @easton_matty I’m proud of you, Matty. ❤️ Have you ever bought something while you were drunk? You’re not alone. https://t.co/nQGeekPni7 This dancing family just danced their way to a big surprise. https://t.co/U1tSizyMKA My Executive Producer @MaryConnelly’s rash has a sponsor. https://t.co/djlWQYgyDl .@AndersonPaak just made Monday a whole lot better. https://t.co/cqopXGGJvD Happy #InternationalDanceDay! Everybody dance now. @ellentube @official_tWitch https://t.co/j1OKlByeBN I may have just made my first Kardashian match. Thanks, @kourtneykardash. https://t.co/Lsp3Xt3Ki7 I’m feeling terrible about that trip to Winterfell I gave my audience. #GameofThrones #BattleOfWinterfell Check out all of the amazing pieces from @GenPubArt available at Restoration Hardware. #MyWifeIsAmazing https://t.co/D42lzOYuYQ I ❤️ Hannah Hart. #BurningQuestions @harto https://t.co/Ufc77UywkZ #Thanos isn’t gonna get this one. #AvengersEndgame https://t.co/5f5YdPn6Ow If you film a movie in Italy with Jennifer Aniston, make sure to drop by George Clooney’s house in Lake Como. @AdamSandler https://t.co/3DNdtPpxHB @NaomiWadler @jameelajamil @oliviawilde @josietotah @serenawilliams @sophialillis @lanacondor ❤️ #AvengersEndgame shot 5 alternative endings. They may have gotten that idea from my show. https://t.co/92yi4OaOnJ Crystal had a chance to win big with one basketball shot. That’s a lot of pressure, so I brought in @kobebryant to help. #SparkKindness https://t.co/I4RP33IUn7 .@KobeBryant told me about the little basketball team he and his wife are working on. https://t.co/9k2TSam17A Thank you to everyone who watched this season of \"DiversiTEA.\" We had a lot of fun. @NaomiWadler is so special. Watch the entire series on @ellentube. https://t.co/SKKXsj1khG Bridget’s reaction to getting a video from @AndyLassner was unbelievable. Clearly, she had to come here and meet his averageness in person. https://t.co/Zj8nHQQir5 Happy birthday, @channingtatum! Wherever you are, I bet you’re in your birthday suit. .@AdamSandler’s mirror has seen a lot. https://t.co/p20ysOA5HY I’m so excited for this weekend. #AvengersEndgame @taylorswift13 #GameofThrones https://t.co/OAZGT22rrD The only thing I love more than a new movie with Jennifer Aniston and @AdamSandler is when I get the exclusive trailer for it. #MurderMystery is on @Netflix June 14th! https://t.co/6UqyGgSQ0X Bradley Cooper told me a fun fact about filming #AStarIsBorn in front of giant festival crowds. His mic was off! https://t.co/fC9gGyKUnu Courtney won tickets to my #MothersDay show by listening to our #EllenOnTheGo podcast! Are you subscribed? https://t.co/TZxLrpfSU2 \n\n@EdGlavin @MaryConnelly @andylassner @kevinlemanII https://t.co/Kau4R5XBLt I got to know Bradley Cooper a lot better in this round of \"5 Second Rule.\" https://t.co/RbhiRLZAhC Do you have a funny or embarrassing secret you need to get off your chest... and want me to read it aloud on my show? We want to hear all about it! Tweet it with the hashtag #ForgiveMeEllen https://t.co/BCuhtFlhBK As we approach the epic weekend for #AvengersEndgame, Bradley Cooper told me about his love of playing #RocketRaccoon. https://t.co/cCNpIvl1P6 This is as good as it gets. Congratulations, Kailan and Dean! https://t.co/JeVFcuoVtY Now you can win $10,000 every week by watching my show! Download my #GameofGames app to find out more! \n\nDownload here: https://t.co/8WXf7r3zw7 https://t.co/r0PMk7v9cB https://t.co/VfOl6sYoOW @ReeseW Actually, @Oprah told me triplets?! 🤱🏼🤱🏼🤱🏼 We all have some #BurningQuestions for Bradley Cooper. Today, he’s got some burning answers. https://t.co/2xbuDyp92j #LSD (@Labrinth, @Sia and @diplo) is SDG (so dang good). https://t.co/eLcisPL2pd Congratulations, @ReeseW! Jennifer Garner shared your exciting baby news. https://t.co/yDVk2qwP2c I sent these two audience members to @Walmart during my show to do a scavenger hunt and win $20,000. #ThanksSponsor https://t.co/XBTwEbZ2wS Only two days til Friday. https://t.co/ynaZx8lpTO Happy birthday, @BarbraStreisand and @Kelly_Clarkson! I really really hope you sing happy birthday to each other. This dad is about to rap your socks off. https://t.co/z2URpaf5iH .@People magazine’s #BeautifulIssue 2019 cover star Jennifer Garner is here, and if you thought she was beautiful before, wait til you see her gums. https://t.co/DmBIsUuUy7 Happy #AdminProfessionalsDay, @iamjeanniek! I’m not sure what that means, but you put it on my calendar with a smiley face, so I’m tweeting it. Here she is! I revealed @People’s Most Beautiful person... and I couldn’t agree more. Don’t miss any of it, tomorrow. https://t.co/M799ejnDra We loved surprising Bridget with @andylassner so much... we put her on the #EllenOnTheGo podcast! This might be my favorite one yet. @EdGlavin @MaryConnelly @kevinlemanII https://t.co/TZxLrpfSU2 Thank goodness I was able to help Elena out for #StressAwarenessMonth. https://t.co/du6vdSnem6 @harto I had a wonderful time. And that’s exactly the eye color I have listed on my driver’s license. This game with Scarlett Johansson and @BrieLarson was poppin’. https://t.co/YND8H9uNIm This study says women who are funny at work are taken less seriously. Well, take this. @harto @brielarson https://t.co/r0Jxerf8cV I’m trying this new spinoff of #ThisIsUs called \"This Is Me.\"  @MiloVentimiglia https://t.co/qqDtobHn4M Go check out \"A Decent Proposal\" on @ellentube now – it’s so good! @harto https://t.co/4cVBOLVC73 Something's up with #Thor. #AvengersEndgame @chrishemsworth @andylassner https://t.co/uNXRrTsXr8 Showing @BrieLarson and Scarlett Johansson tattoos of their faces on other people’s bodies is kind of a must-see. #AvengersEndgame #CaptainMarvel #BlackWidow https://t.co/rO5PYtcRaq Happy birthday, @JohnCena, wherever you are! Maybe you’re right here and I can’t see you. https://t.co/lDCaefr337 @Pink ❤️ My friend @Pink is incredible. https://t.co/Cn3yiJcrum I’m so happy Addy won \"Holey Roller.\" It’s my show. I can play however I like. #ThanksSponsor https://t.co/Pv74UCa58K A pair of The Ellen Fund sneakers signed by me can be yours! Place your bid on @eBay – all proceeds benefit @TheEllenFund! https://t.co/kWfSTamgsA #WeNeedGorillas https://t.co/0DPPqQz1fc .@Pink helped me give away some amazing gifts that my audience will love, not to mention the Earth. #EarthDay https://t.co/sIG3ffJT5O .@OsheaJacksonJr told me the parenting advice he got from grandpa @IceCube. https://t.co/6cWVV9k0Ke For #EarthDay, I played a game called \"Green or Clean\". Heads up – it wasn’t clean. #ThanksSponsor https://t.co/IsiD7DpA81 For the first time on TV, please enjoy #WalkMeHome by @Pink. https://t.co/fERP06JnuB Here’s a great idea for #EarthDay. What if all recycling labels were the same? https://t.co/Mf7bw1HS58 I’m pretty sure @Pink is f@$&amp;ing perfect. https://t.co/d4wmlQvAYJ Happy #EarthDay! To everyone who drove by my house this morning on the Hollywood tour... I was not passed out face down on my lawn. I was giving the Earth a hug. It’s gonna be wonderful. And then I’ll walk her home. https://t.co/cKTslkgId3 It’s been so long since I was on #GameofThrones, I almost forgot I did this. #GoT https://t.co/UGg7RlKgtH Happy birthday to the Queen! What kind of weather does the queen like on her birthday? All hail. Ellen OUT! @RoyalFamily #HappyBirthdayHerMajesty 💔 https://t.co/Nj842PALT6 Happy Easter to everybunny. https://t.co/VaYQFM3AMA You may or may not wanna watch this, depending on what you were wearing at #Coachella. #OMKalen @TheKalenAllen https://t.co/YGYfbr9hTb .@JohnCena and @official_tWitch played a game called “Marijuana Strain or Show Dog,” which is exactly what it sounds like. #420day https://t.co/Jd8Id8vaFE ❤️ https://t.co/sB7yLex3Ao @JohnCena @tictac You did a great job. I did much worse wrestling all those people for you. Leslie Mann has seen a lot of @JohnCena. #CanYouSayButtMeat? https://t.co/JdaXZ0lsir @jennadewan @JohnCena You’ve never looked better. .@JohnCena did a wonderful job hosting. I hope I’m insured for this. https://t.co/5RcEZ7mDcf .@NaomiWadler gives me hope for the future. #DiversiTEAxNaomi @sophialillis #ThanksSponsor https://t.co/a1bW3sD9R2 Brielle introduces @JohnCena to Mr. Bones, who surprisingly is not a new member of the WWE. https://t.co/wtBRlm0j10 Leslie Mann and @JohnCena do not mess around when it comes to sumo @HeadsUp. https://t.co/BDp4I3mc7F .@JohnCena hosted my show today. This was his Johnalogue. https://t.co/s9JFl7nW0Q Okay, somebody come here and snuggle me right now. @ellentube https://t.co/cncw56rG0R .@lildickytweets, @justinbieber, @MileyCyrus, @katyperry, @ArianaGrande and more, all in one music video. My head might explode. #WeLoveTheEarth https://t.co/SKVUaWNPjq I might be in the wrong profession. #TBT https://t.co/7v2PqHzmec RT @robdelaney: Discussing the Mueller Report on @TheEllenShow: https://t.co/6hV0oNnWNx DUN DUN. @KimKardashian @KourtneyKardash @KhloeKardashian https://t.co/ug6Lg435Bo I’m available for music video work. @TEYANATAYLOR https://t.co/NU0lbTYEU0 Sounds like there’s some infighting between my producers on this episode of the #EllenOnTheGo podcast. @EdGlavin @MaryConnelly @andylassner @kevinlemanII \n\nListen here: https://t.co/TZxLrpfSU2 https://t.co/JcRPP9PV9c You think you’ve heard it all from your guests, and then along comes @LilyTomlin. https://t.co/QJAVDuLAy1 RT @ellentube: We are so excited! https://t.co/ZE6ZLlxr9D and the ellentube app won #ShortyAwards! Thank you to everyone who voted, and to… Happy 40th birthday, @KourtneyKardash! I hope your poosh is good. Please God, tell me I’m using that right. @TheKalenAllen ❤️ This is our new show, “A Decent Proposal” hosted by Hannah Hart. I love it so much. Thank you, @harto. #ThanksSponsor https://t.co/bJ46ehRryK Happy birthday, @SophiaGrace! I can’t believe you’re 16. In my mind, you’re still the 2nd @NICKIMINAJ. [start chanting silently wherever you are] #Webbys! Webbys! Ellen! Ellen! Vote now! Vote now! Last chance! Last chance! Click the link! Click the link! Tell your friends! https://t.co/8WwjMiICFd .@TEYANATAYLOR is 🔥. https://t.co/tlsM3V6x5h @britmarling You were wonderful. And I hope that camp was shut down. This video is going to be huge. Don't miss my teaser clip tomorrow. #WeLoveTheEarth @lildickytweets https://t.co/KO5wIXNdJ9 Happy Easter Week from us two bunnies. @taylorswift13 https://t.co/KDnsrP1Z80 .@ianaIexander gives me hope for the world. https://t.co/NnakHTodrw .@DaxShepard has a theory about his unforgettable round of #TasteBuds with his wife @IMKristenBell. https://t.co/9YfuwHxj1I This is still one of my favorite things I’ve ever done. I love you, @Adele. https://t.co/NZXoLCru8z I want this job. @ellentube https://t.co/c4fBUVxe6I @ianaIexander ❤️ .@britmarling is the writer, creator and star of #TheOA. That show is bananas. https://t.co/tlc0H8vDDa Today I want to talk about the birds and the bees. Or maybe just the bees. https://t.co/u4OxTOVbQK Doctor @DaxShepard is in the office with some wonderful dating advice. #AskDax https://t.co/2x83qvW7hJ Happy birthday, Jennifer Garner! You are beautiful from every angle. ❤ https://t.co/3t1PAv1cy1 ❤  #BeatCancerLikeABoss https://t.co/sDZuRJ2WqQ https://t.co/odRWGawROt .@TrevorNoah has a new dream guest who he thinks would Be Best. https://t.co/IVGAYZNAB7 I hope your Tuesday has been a piece of cake. Hopefully not this cake. @ellentube https://t.co/IS2u6ykfZU How amazing would it be if all classrooms were like this one. #ThanksSponsor https://t.co/nI0nm0ziL7 .@TrevorNoah as every New York driver. https://t.co/kWya99yBDH I can’t stop playing this game. https://t.co/UoTsTa3ZaK There is a BE KIND box out there with $5,000 in it. I called Maggie to help me track it down. https://t.co/z15yzJj3yU https://t.co/FftFtHgIEp I didn’t know I was gonna find out about what @TrevorNoah’s anaconda wants. You're welcome, @NICKIMINAJ. https://t.co/yFaUAggIHN Happy birthday, @ChancetheRapper! Come back and perform here anytime. No problem. https://t.co/ci8mi6Qgvc Tomorrow, @TrevorNoah tells me what it would be like to interview Trump. See the full interview tomorrow. https://t.co/2Yegnyei4B RT @yashar: Mayor @PeteButtigieg on the Notre Dame fire  https://t.co/BS88OXCLf7 I asked my audience some personal questions. Frankly, I’m shocked. https://t.co/hoBAs3G0Uh My new game came in like a wrecking ball. https://t.co/eor4mRqWYF Feel better, Lindsay! @accessonline https://t.co/TGrB3HcovM I love it when my guests, especially Bill Hader, have ghost stories. https://t.co/aiikVElt0E RT @BarackObama: Notre Dame is one of the world’s great treasures, and we’re thinking of the people of France in your time of grief. It’s i… In case you woke up thirsty. Happy Man Crush Monday! #MCM https://t.co/VE1MQiNBvF Bill Hader is a bowl of interesting answers. https://t.co/SxRU47qcDB I’m playing #GameofThrones @HeadsUp to make sure I’m ready for tonight. Just like Samwell Tarly studied to cure Jorah Mormont of greyscale. Boom! #GoT \n\nDownload the app here: https://t.co/3vCOz5BxCK https://t.co/C2p2sfVNdH These words make me very, very happy. \n\n“My name is @PeteButtigieg. They call me Mayor Pete. I am a proud son of South Bend, Indiana. And I am running for President of the United States.” I hope you’re having a blast at #Coachella. Let me know if you run into Rico Nasty. https://t.co/ztnmsst4tC Happy #SaturKay! In the latest #OMKalen, @TheKalenAllen interviews @GreysonChance about being discovered, his friendship with @LadyGaga, and staying away from girls. https://t.co/QnEYgVBgwp Here are some of the best #GameofThrones moments on my show to get you ready for Sunday. https://t.co/2GsWmSoaUd Happy birthday, David @Letterman! I got you a membership to Dollar Shave Club. Kit arrives Monday! I can’t believe I’m saying this, but it’s time for the second episode of the @TigNotaro Show. https://t.co/CvIfzOAaQm Becoming a Dame was nothing compared to the honor I awarded Emma Thompson. https://t.co/DtMTMRNEh8 Emma Thompson tried to ruin this game of #BurningQuestions, but she couldn’t. https://t.co/RkfhyAofct Here’s @PeteButtigieg responding to Mike Pence’s comments. https://t.co/0K9fBmGTsy @PeteButtigieg ❤️ #DiversiTEAxNaomi is back for another episode! @NaomiWadler sits down with @JosieTotah to talk transgender rights and how to be a good ally. #ThanksSponsor https://t.co/PurLw6yWTP Happy birthday, Ed O’Neill, from me and all the people you don’t recognize. I think we found @AndyLassner’s biggest fan. https://t.co/rWJMCrkWd7 I had a great time talking with Mayor @PeteButtigieg and his husband @Chas10Buttigieg. https://t.co/q3TrMMtUFZ Nearly 80% of LGBTQ students experience verbal harassment at school, silencing their voices. Join me and @GLSEN for a #DayofSilence. Be kind to one another. \nhttps://t.co/z1u03gsTkQ https://t.co/YyMTePi7AK I really enjoyed meeting @PeteButtigieg. Don’t miss him on my show tomorrow. https://t.co/A6IQmB0zpj @cmclymer ❤️ Happy #NationalPetDay from our pets to yours. Don’t miss Wolf at the end. https://t.co/8Y0coVKVBc Tomorrow, the President’s ban on transgender people serving their country goes into effect. This isn’t about budgets. It’s hatred. https://t.co/trWZuEFovM This story is the good side of the world I needed to see today. https://t.co/zwVFL1Gjdo Calling all baseball fans! If you know someone who loves baseball and my show, and deserves something incredible, tell me about them. I realize that’s a lot to ask. https://t.co/QdOaOLWbez @Chas10Buttigieg @TheMandyMoore She should have driven you right onto my stage. @TheMandyMoore If you’ve been following \"The Real Housewives of Beverly Hills’\" puppygate, you cannot miss this video. @ErikaJayne https://t.co/3cikRpxAHc My guest host Mila Kunis played a game of \"5 Second Rule.\" I think this is what the kids call “off the rails.” @joshgad https://t.co/6x3jaIBhcX We should all try new things. @ellentube https://t.co/SBMeDMzInQ #TheBachelor is going AR. @colton https://t.co/toDDC2Ncfe This little boy is only 6 years old, but what he knows about astronomy is out of this world. https://t.co/Xdc5epauXz I learned a whole lot about my neighbors Mila Kunis and @aplusk today, thanks to @JoshGad. https://t.co/U3Po1WxANR This airline has a new welcoming committee. @ellentube https://t.co/QGdewn9tCg @SaraBareilles ❤️ .@DavidSpade has a new talk show. I helped him prep the best way I know how. https://t.co/tbmWFk3Vlv Beautiful. @SaraBareilles https://t.co/0kQsmYkNne .@DavidSpade and @CelineDion are my new favorite comedy duo. https://t.co/nHWh25bjCK .@TheKalenAllen made a wonderful DJ while @official_tWitch was away. https://t.co/oIM8itOQFA Happy birthday, @MarenMorris! Just tell me where the party is, and I’ll meet you in the middle. The perfect beach coverup for Jude Law. https://t.co/adLTeCC4Pd If you know what a VCR is, you may need CPR. https://t.co/TQBAWuOdd0 Happy birthday, @TheMandyMoore! I hope you have a wonderful year and Mandy, Mandy, Moore. .@DavidSpade’s story about running into Nelly. 😂 https://t.co/SzVnp33ze7 Happy #NationalSiblingsDay to this handsome soldier. Love, your favorite cowgirl. @vancedegeneres https://t.co/mKWey3M97V On this episode of the podcast, my Audience Producer Claudia has tips for getting tickets to the show. #EllenOnTheGo https://t.co/TZxLrpfSU2 https://t.co/60pQ2Z4mTi Tonight is the season finale of #SplittingUpTogether! It’s time to find out #WhatHappensNext. @SplittingUpABC .@Hozier’s voice is from another planet, and I want to live there with him. https://t.co/BDBwlrqnQf .@ChrisHemsworth can even make rash cream sexy. https://t.co/BnIR52gZTp RT @Hozier: Always such a pleasure to visit @TheEllenShow! Tune in today and watch our performance of #Almost here: https://t.co/5U1RW7fyca… Eduardo is either a background actor in a lot of movies and TV shows, or he’s part of the Illuminati. https://t.co/kTiBXUwyWb I asked @ChrisHemsworth what’s next for Thor. #AvengersEndgame https://t.co/lLUlDinCcF Jaime Lannister, also known as Nikolaj Coster-Waldau, stopped by my throne today. #GoT @nikolajcw https://t.co/gwXhlaHgD1 .@ChrisHemsworth isn’t afraid of anything... except whoever is hiding in my table. https://t.co/9Jxjg5IPos .@TaylorSwift13, this lit up my heart. https://t.co/xfkRNvbPOt @ReeseW @Oprah I think I know where that photo came from. https://t.co/gZu9GhykRv Tomorrow, the handsomest Chris in the world is here, and I scare the Hemsworth out of him. @chrishemsworth https://t.co/2QMdyurYkA .@HeadsUp was nominated for 3 #Webbys! You can go vote for it. Webby, set, go! https://t.co/3vCOz5BxCK I love the show #KillingEve, and I couldn’t wait to talk to one of its incredible stars, @JodieComer. https://t.co/DANX7RDBwS If these two knew what they were playing for in this game of “Find the Thingy,” I think they’d have run a lot faster. https://t.co/rOr7pyGiOH .@ChelseaHandler and I decided to give my audience some advice. https://t.co/rNxJteZEoi Amber is a fan studying in Rome. It’s too bad she’s so far away and I can’t surprise her with Jeannie at her dorm room door. Oh, wait... https://t.co/9tQ9cDwP66 .@BillieEilish hid in disguise backstage to surprise some of her biggest fans. Check it out on my @Spotify page! https://t.co/REcMYHTmWo This is one Mueller Report from @ChelseaHandler that no one was expecting. https://t.co/8gd5uXyyLE Tip for a great #Mondaymorning –wake up next to a dog. https://t.co/Z1WYRrsxAV Congratulations, @AnzeKopitar, and congratulations @AndyLassner on this brilliant performance. https://t.co/r4xPsKbFpe .@TheKalenAllen is here to answer your questions about @JordanPeele’s #UsMovie. #OMKalen https://t.co/RxXnmzFCz0 I made a new list of my favorite things at @Walmart this month. Go check ‘em out! #ThanksSponsor https://t.co/9g6RMinIQd https://t.co/akQlHGmFLn Happy Saturday! Here’s an all-new episode of DiversiTEA with @NaomiWadler and @OliviaWilde! #DiversiTEAxNaomi https://t.co/oZ7EgyCa27 #NancyDrew and the Hidden Staircase is out on DVD! I sent this from my hidden staircase. https://t.co/yazEotPA4h Texting the wrong number could be the best thing you do all day. https://t.co/W0se7HIHdb Shazoink! #ThanksSponsor #SHAZAM https://t.co/9jkFJMTEIh @driverminnie @TheEllenFund ❤️ @MarenMorris ❤️ @LightfootForChi ❤️ If there was anyone the world needs two of, it is definitely Brittani and Brandi. https://t.co/tXGZlxuxP6 Get your mind out of the gutter. They're churros. https://t.co/gBa6Xkv7RU This is me today. Thanks, @LilNasX and @billyraycyrus. #OldTownRoadREMIX https://t.co/4j1FooxSFx Please enjoy the first installment of my new original show, \"Audience Got Talent.\" We’re gonna play this 'til we get sued. https://t.co/W4E80xh19n My next investment is a percentage of Minnie Driver’s swear jar. @driverminnie https://t.co/4KGwwfT8w7 .@MarenMorris is back with “The Bones,” and it’s beautiful. https://t.co/MoeWUdjIGX Happy birthday, @Pharrell! I hope it’s Phantastic. .@KathieLGifford, it’s been an incredible run. Thanks for taking us along for the ride. You’re one of a kind. #CheersToKLG @MarenMorris We’re practically twins. https://t.co/qE9LInOjwz There’s something we can all do about the horrible situation in Brunei. Please take action. #EyesOnBrunei https://t.co/UC3gexcon1 If you’re reading this and you’re pregnant with your first baby, you’re gonna want to click on the link. #MothersDay https://t.co/4VkAq0q2DO https://t.co/V4Fm4TKNiG I really enjoy @MeganMullally. https://t.co/OjxbDjZxNw In this game, I try to guess if a news story is real or fake... or as you call it, scrolling through Facebook. https://t.co/1stTG00RfH @greysonchance You are the same wonderful person. Just a lot taller. .@GreysonChance grew up to be an incredible person. https://t.co/uiwyqpBBJm This makes me want to have a baby. Or another pet. Probably a pet. @ellentube https://t.co/8QekbKifFl I asked my audience on my birthday to spread some kindness with $1 million from Cheerios. Taylor Rowe is doing that and more. #ThanksSponsor https://t.co/AibB67Ttt5 I learned how to say @HasanMinhaj from Hasan Minhaj. \n\nWatch Hasan's full interview here: https://t.co/UovqMMgCgW https://t.co/Y4wPK6anAb When he was 12 years old, @GreysonChance was here to perform \"Paparazzi.\" Now he’s here to perform his new song, and you won’t believe how much he’s changed. https://t.co/DLZaf8HnaN @hasanminhaj Your mom is wonderful at picking talk shows and raising children. Yesterday, Chicago elected their first black female mayor. She also happens to be gay. Amazing, Chicago. Congrats, Lori Lightfoot. @LightfootForChi Tavaris knows some great dance moves. This may be the world’s cutest dance tutorial on my @Spotify hub! #ThanksSponsor https://t.co/3Qs3a3livt She was wonderful as a crayon on my show, but afterward her husband posted her hilarious reaction on @ellentube, and I knew I had to meet Lohren again. https://t.co/IUXNqlToKI My friend @ThisIsRobThomas stops by. https://t.co/cYRxYraRPG I think #KillingEve is one of the best shows on TV right now. @IamSandraOh is brilliant. You should check it out. https://t.co/dQmjDyieTe I played a new game and learned some things about my audience. It’s official... I’m never using an airplane lavatory again. https://t.co/fk4QvSqtdb Easter is coming! I wanna see your best Easter moments and pictures. Send them to @ellentube! https://t.co/3UEZhyP7zz It’s been one day since @official_tWitch has had a dance accident. https://t.co/Hdd5J3tK1L I’m so grateful to Jane Goodall for all she has done to make the world a better place for animals. @JaneGoodallInst https://t.co/hpgKo6DCJJ 12 times celebs clapped back at me. https://t.co/5evs4qPhYN .@IamSandraOh played \"Speak Out,\" and she had zero pucks to give. https://t.co/7YIMhr7ebd Congratulations, Melissa M. and Hannah Z.! You won $5K from the watch-along game in the #GameofGames app. That’s more than Thomas! Y’all are the real winners. https://t.co/BijcBNmnlf Thomas, Thomas, Thomas. 🙁That’s why you have to play #HotHands. The rest of you, go start practicing for Season 3!! #GameofGames This is it! The final episode of #GameofGames Season 2! I hope you’re tuned in, West Coast. This episode is a doozy. @NBC \n\nPlay along in the app: https://t.co/8WXf7r3zw7\nhttps://t.co/UKdqNduc17 If you think you can win my #GameofGames, here’s your chance to be a contestant on Season 3. https://t.co/F6zPvjSsK1 Oh, Thomas. You know what they say: The bigger you are, the harder (&amp; farther) you fall. #GameofGames #KnoworGo That gives me a great idea for a new game – #SkinkTank. #GameofGames #KnoworGo It’s time for my #KnoworGo poll. Who do you think is gonna win? #GameofGames We’d all love to have @Drake’s baby, Nina, but that doesn’t mean you get to stay. Byeee. #GameofGames Everything is better with @Oprah’s 2nd best friend, @ReeseW. #GameofGames #SayWhaaat So many things went wrong in that round of #SayWhaaat, I don’t have enough characters to talk about it. #GameofGames Do you think penguins live in the Arctic? THEY DON’T! I JUST GOOGLED IT TO DOUBLE CHECK. #GameofGames #StinkTank The first rule of #StinkTank is you don’t open your mouth in the stink tank. The second rule is... don’t forget Brad Pitt is also in the \"Ocean’s\" movie. #GameofGames Fun Fact: Sandra Bullock was running the #StinkTank arm backstage. #GameofGames Justin, I was totally kidding, guv’na! #GameofGames #DizzyDash Here we go! It’s time for the season finale of #GameofGames! Are you watching, East Coast? The ending is crazy. Get your \"Game of Games\" app up &amp; running! https://t.co/8WXf7r3zw7\nhttps://t.co/UKdqNduc17 Don’t miss the finale of #GameofGames tonight. Extra points if you can figure out what @official_tWitch is saying. https://t.co/3VozOUFapF If you haven’t heard @BillieEilish’s new music, reevaluate all your life choices and listen to it now. I love it so much. https://t.co/6prqvxWIRs You were incredible. Somebody raised you right. Way to go, Trish. https://t.co/BxJd2aOseD The Season 2 finale of #GameofGames airs tonight! We’re working on Season 3 right now. https://t.co/d756GkAUwD I played a game with my audience, because now you can watch my #NancyDrew movie on DVD and Vudu! Hudu? Yudu. https://t.co/FeY4DjgXf2 Don’t miss the Season 2 finale of #GameofGames tonight 8/7c on @NBC. You will not believe the ending! Tomorrow, the country of #Brunei will start stoning gay people to death. We need to do something now. Please boycott these hotels owned by the Sultan of Brunei. Raise your voices now. Spread the word. Rise up. https://t.co/24KJsemPGH I love kids. I also love when my couch isn’t sticky. @ellentube https://t.co/ziJCH14Rjr RT @billieeilish: Watch Billie perform \"when the party's over\" on @TheEllenShow. https://t.co/HE11r2WAqy https://t.co/5K1DWjH1IF .@WoodyHarrelson jumps off the second floor of his house into his pool every day. https://t.co/FrGuv95sgC .@BillieEilish was here, but her “Caution, Pool Ahead” sign was not. https://t.co/VbOe5rhnOh .@JoeyKing is a brilliant actress and an exceptional prankster. https://t.co/qehXv9OyUl This. https://t.co/Yf3WOtO5e0 Ok now one with @AndyLassner’s eyes open. https://t.co/6BDuPE08gU #SplittingUpTogether is back tomorrow night! Pull up a chair and light a candle. https://t.co/EByOaOWlAd .@DaxShepard makes me laugh. https://t.co/54Wo9YrxrQ I’ll see you tomorrow night for an all-new #GameofGames, so I’ll See Ya Later, Alligator. https://t.co/6J0Fi6zcJ8 Ed O’Neill didn’t recognize @BritneySpears when she came up to him in an airport. So, I thought we could play a new game called “Who’s This?” https://t.co/kwiEGRuU4W My audience was electrified by @BillieEilish. https://t.co/AMDCr1sSOG Whatever you do, do not say the #DangerWord. https://t.co/9rEQk20Mbb These police officer partners are about to warm your heart. #ThanksSponsor https://t.co/3yKAkPKzrq I had a big surprise for @BillieEilish (I ❤️ u @JustinBieber). https://t.co/lWhmhr2ahX .@BillieEilish has had the most incredible year, and she’s here to tell me about all of it. https://t.co/AInVJxOKaA .@BillieEilish is here tomorrow, and her performance is gonna knock your galoshes off. https://t.co/7t2XHYEemy Happy birthday, @CelineDion! I hope there are moments of gold and flashes of light. Happy #SaturKay, y’all! @TheKalenAllen is back with a brand new #OMKalen. https://t.co/hPbf89jnpt Just a friendly reminder to get yourself ready for Tuesday’s all-new #GameofGames. https://t.co/XkjG8ioq5y Never too early to start working on your summer body. @ellentube https://t.co/6YrxLhnTX9 Nate and Landon go together like rama lama lama ka dinga da ding a dong. https://t.co/4sDITSgo7j I got to unravel some of the mystery that all started with the Big Bang. https://t.co/Z4DAW4aF7S I love what \"The Good Place’s\" @JameelaJamil had to say to young @NaomiWadler in this episode of DiversiTEA. #DiversiTEAxNaomi #ThanksSponsor https://t.co/KjwFMmhqqU Spring into spring with a sale at The Ellen Shop! https://t.co/HDBOosvc6J https://t.co/bTuBhoczIO I wish I could make this video my ringtone. @IMKristenBell @DaxShepard https://t.co/yU3Kd5sDax Happy birthday, @LadyGaga! You’re on the right track baby, you were born today! https://t.co/XRGKwatMXn @justinbieber Seems like we need to make this meeting happen. I know the perfect place. I wish they all could be California dogs. https://t.co/SGeaabXnLY Do you have a brilliant baby? How about a talented toddler? If you do, send in a video to @ellentube! Your kiddo could wind up on my show. https://t.co/8tL5yowFiZ Well, that’s one way to celebrate spring break. @ellentube https://t.co/DmIit22lOr .@FLAGALine answered my #BurningQuestions on @Spotify! I hope this didn’t cross the line. #ThanksSponsor https://t.co/3Qs3a33HDV .@BillieEilish is here Monday, April 1st. And believe me when I tell you, it’s an event. https://t.co/rRxxQRmnXJ I will never be able to thank my wife for this incredible gift. What a year. @theellenfund #WeNeedGorillas https://t.co/E3TQ2uJ2T3 Shelvia, you crushed that round of #HotHands! Amazing! Also, congrats to Denise H. and Gina G., my at-home app winners tonight! What a time to be alive. #GameofGames https://t.co/BijcBN4MtH Okay, West Coast! Go download your #GameofGames app, and get ready to watch and play! https://t.co/8WXf7qLYEz\nhttps://t.co/UKdqNdLNpH Where my West Coasters at?! It’s almost time for #GameofGames! You have just enough time to download my watch-along game. https://t.co/8WXf7qLYEz\nhttps://t.co/UKdqNdLNpH RT @AyannaPrescod: Ellen’s #GameofGames is the joy I need right now. That apple game gave me the laughs I needed! See what I did there? #GameofGames #KnoworGo If Ashlee gets this wrong, she’s gonna be in denial. #GameofGames #KnoworGo It’s time for our #KnoworGo poll! Who do you think is gonna move on to #HotHands? #GameofGames I’m pretty sure the great state of Seattle touches the ocean. Jessica would’ve known that. #GameofGames #DontLeaveMeHanging Let’s see how our @Twitter audience measures up. Have you been blackout drunk this week? #GameofGames #OneEyedMonster I guess it was 2-for-1 day at the contestant store. #GameofGames #AwSnap Shout out to all my fans from the great state of Seattle! #GameofGames #StinkTank They’re identical mirror twins?! Does that mean if I dunk one in the stink tank the other will smell it? #GameofGames #StinkTank East Coast! It’s your turn to watch #GameofGames! Who’s with me? Don’t forget your Game of Games app! \n\nhttps://t.co/8WXf7qLYEz\nhttps://t.co/UKdqNdLNpH I love these 4 people very much. They’re all crazy. But I love them. Check out the newest episode of #EllenontheGo! @EdGlavin @MaryConnelly @andylassner @kevinlemanII https://t.co/EMWGFyDeLj You can get my new movie, #NancyDrew and the Hidden Staircase, on iTunes today! Then you can watch it tonight, and then thank me tomorrow. https://t.co/D8liqKDCNW .@IdrisElba is DJing my next birthday party. https://t.co/KTiRZ3SBtR The One-Eyed Monster returns! #GameofGames https://t.co/kAKQlrtRwC I’ve gotten to do some incredible things on my show, but I still can’t believe I got to do this. https://t.co/yGkX7CpQWU You think you’ve got cute videos? Prove it! Post them on @ellentube, and you could win my Cute Overload Challenge! https://t.co/jcDIfEDbHA Actual footage of me on spring break. https://t.co/2MuE20sxea I want @MelissaMcCarthy to be my basketball coach. https://t.co/YV6WIq0Ui5 Happy birthday, @eltonofficial! You can tell everybody, this is your tweet. .@ErikaJayne told my guest host Mila Kunis everything you want to know about puppygate. https://t.co/RfYWukmnZ8 It’s the 1-year anniversary of #MarchForOurLives. @NaomiWadler’s words at the march inspired me, and I couldn’t be more proud to share her new series today. Thank you, @SerenaWilliams and @JameelaJamil. #DiversiTEAxNaomi https://t.co/6cXR5FEpqO It’s #NationalPuppyDay! It’s too bad I don’t have an adorable puppy montage. Oh, wait. I do. https://t.co/Bd2DRA3cER .@OffsetYRN told me how he survived this car accident. Thank God he’s okay. https://t.co/AjjJzBb3tf I’m very glad @JakeTapper’s daughter Alice raised her hand. @Oprah https://t.co/V8KxJSfZyc Chaka Khan, happy birthday, happy birthday, @ChakaKhan. Saying happy birthday is all I wanna do. I sent @TheKalenAllen to the Salt Lake City with a brand-new sidekick. #OMKalen #ThanksSponsor https://t.co/55Xq5JWgOJ When @NaomiWadler spoke at #MarchForOurLives, I knew she was special. That’s why I’m so happy to introduce you to her new series on @ellentube. Thank you, @SerenaWilliams and @JameelaJamil. #DiversiTEAxNaomi  #ThanksSponsor https://t.co/iXMCvwG08X Do you have a great #WorkFail video? Send it to me, and you could win our new challenge! I’ll let @AndyLassner start... \n\nUpload yours to @ellentube: https://t.co/dnADBcJulO https://t.co/f06ymF4tdm @jaketapper @penguinkids @RaiseYourHand5 @girlscouts Alice can come back any time. She can even bring the Tap Man. .@JakeTapper will stop at nothing to give me the breaking news from backstage at my show. https://t.co/mne22KBztZ It’s #WorldWaterDay. Clean water is a right no person should be without. Find out how you can help. @UN_Water @CleanWaterHere https://t.co/BeyY8iw62G https://t.co/N2lSaPRJUV .@OffsetYRN told me about his relationship with @iamCardiB. I’m glad they’re okurrr. https://t.co/AaaZUcwTGY OMGOG! #GameofGames is back with an all-new episode Tuesday! https://t.co/Bi1LJegZV0 Today I’m talking about a topic that affects all of us. Man-spreading. https://t.co/fyBUEmHj5k Happy birthday, Reese Witherspoon! This is how I’m celebrating. @RWitherspoon https://t.co/8MsguFOQIg Here's a sneak peek at my new series with @NaomiWadler. She sat down with @serenawilliams, @jameelajamil, @oliviawilde, and @josietotah. I’m so proud of her. #DiversiTEAxNaomi @ellentube https://t.co/8cZeEUEXmi Ben Stiller is a wonderful director and actor, but he’s even wonderfuller at \"5 Second Rule.\" @RedHourBen https://t.co/hZStiwSQS3 Congratulations, @IMKristenBell and everyone at Ellen Digital who helped make this EMMY-NOMINATED series a success! #Momsplaining @ellentube https://t.co/QLKAK3q6nl Excited to show you my brand new Nike commercial. Thanks, @SerenaWilliams. Thanks, @Nike. (You can send my payment at your earliest convenience. I also accept shoes...size 8.) #justdoit https://t.co/6lxEnDGDYZ I know you’ve been busy with homework and IGTV, and secretly feeding your broccoli to the dog, but it’s your last day to vote for me in the Kids' Choice Awards! #VoteEllen #KCA https://t.co/DzrAV8XYz9 Epic or Fail: Snow Edition https://t.co/rxyGHUi30V Next time a white-bearded man says hello to you on a star tour in Hollywood, just assume it’s David @Letterman. https://t.co/FTgqhy2zZY David @Letterman went to Easter Island, and he brought back some wonderful travel advice. https://t.co/jmQ0HDOtMj On this episode of our #EllenOnTheGo podcast... https://t.co/EMWGFyUPCR https://t.co/NHzzqe4Q9x David @Letterman isn’t afraid of a burning question. https://t.co/ZRnemedsq4 .@DermotKennedy is here by way of Ireland for this beautiful performance. https://t.co/aanHA6uz4K Hearing David @Letterman talk about his history with my EP @MaryConnelly was the highlight of my week. https://t.co/haHMvW7CqK He was here for the first time, and I celebrated David @Letterman the best way I knew how – with a monologue. https://t.co/ydrCyJg1rz .@TaylorSwift13 listed 30 things she learned before 30. Here are almost 61 things I’ve learned after turning 61. https://t.co/wpdUKcRajm If you haven’t heard @MrJacobBanks sing, stop whatever you’re doing and watch this. https://t.co/RQ5HCr24Gq Happy birthday, Spike Lee! I hope you and your Oscar have a wonderful day together. Emily was upset when she woke up from wisdom teeth surgery and I wasn’t there to greet her. I hope being on my show can help make up for it. https://t.co/1yozgo40dl It took some nudging, but @CoryBooker made a big statement about his future VP. https://t.co/Iu6jLljUBr .@MarkRonson had some secrets to share backstage that you can watch exclusively on @Spotify. #ThanksSponsor https://t.co/3Qs3a3livt Halfway out counts. https://t.co/jqvtiLpMGj I asked @CoryBooker how he felt about our President’s Twitter spree last weekend. https://t.co/3ZPXll3ssw @CoryBooker We loved having you. Happy #firstdayofspring! For all the bears that just came out of hibernation, no, Mueller still hasn’t published his report. I may have suggested @CoryBooker should marry @RosarioDawson in the White House. And I may have suggested we do it during sweeps. https://t.co/qGxoQyWXZP Congratulations to my winner Steven and my #GameofGames app winners! Now here’s something else new – a brand new episode of #SplittingUpTogether on ABC! Steven may have won only $2,500, but Mylan W. and Timothy B. won $5,000 each playing my #GameofGames app! And next week you could too! Thanks for watching and playing! Okay, West Coast! It’s your turn to play #GameofGames! Grab your apps and get ready for your chance to win 5K! https://t.co/8WXf7r3zw7 You saw them play their games. Who do you think will #KnoworGo? #GameofGames Nichole, here are some funny F words I would have accepted: Farfegnugen, fluffernutter, flopsy, and of course, floozy. #DontLeaveMeHanging #GameofGames I’m rooting for Steven. Gutter Kitty needs a new collar. And probably a new name. #DontLeaveMeHanging #GameofGames Oops. #MtSaintEllen not Mt. St. Helen. ☺️ #GameofGames This game is giving me collywobbles. #OhShip #GameofGames What does a weird obsession with Abraham Lincoln mean? Does she keep jars of pennies under her bed? #OhShip #GameofGames Wonderful work, @ChrisHemsworth. Remind me again, is it boxers or briefs? #DangerWord #GameofGames .@HodaKotb, people who drink from glass chardonnay bottles shouldn’t throw stones. #DangerWord #GameofGames Uh-oh, @MelissaMcCarthy, your #DangerWord was a little too dangerous. #GameofGames Gee thanks, @TomHanks! By the way, way to make everyone cry in that #ToyStory4 trailer. #DangerWord #GameofGames East Coast! It’s time for #GameofGames! Turn on @NBC, take out your \"Game of Games\" app, and get ready to live tweet the fun. \n\nhttps://t.co/8WXf7r3zw7\nhttps://t.co/UKdqNduc17 Today on the #EllenOnTheGo podcast, my Executive Producers talk about where baby goats came from. .@AndyLassner had no idea. @EdGlavin @MaryConnelly @kevinlemanII https://t.co/TZxLrpfSU2 @JayShettyIW You keep doing that thing you do. This child o’ mine from Australia is pretty sweet. https://t.co/eLR6arlYkb Is she ready to be #TheBachelorette? Yeah. @AlabamaHannah https://t.co/hEeUZ1rZIH I wish we could all get along as well as this pig and hedgehog. @ellentube https://t.co/veUQqESU63 These contestants may not know many ways to say “hello,” but they’re about to discover I definitely know how to say goodbye. #DontLeaveMeHanging #GameofGames https://t.co/tn7O1Q7YcV .@MichaelKeaton is a brilliant actor. But I will not be letting him fly me anywhere. https://t.co/LPO98Vkz5M Picture Day isn’t for everyone. #BadSchoolPhoto https://t.co/4OL1lOg2rm This is for everyone who has spent time on hold with CVS. https://t.co/cOa7ZgjTQz These teachers in Tennessee absolutely touched my heart, so I absolutely had to make them play #TasteBuds. https://t.co/pwYnibyJNU If you haven’t heard of @JayShettyIW yet, your life is about to get a whole lot better. https://t.co/DpNnfZEc3X RT @NBCGameOfGames: Get ready to laugh with @TheEllenShow! 🤗\n\n#GameofGames is on TONIGHT 8/7c on @NBC. https://t.co/Y3DKepOLUJ #MtSaintEllen is back tomorrow by popular demand. We would’ve done it sooner, but I was waiting for my barrel of mountain lube to get here. #GameofGames https://t.co/aFiGhSWzjM Life is like a box of broccoli. Send me videos of your baby tasting food on @ellentube! https://t.co/88r3yxNcGK .@RobLowe is my neighbor. When he’s not headlining in Vegas, that is. https://t.co/vmykVm67Ov .@OliviaWilde was hoping Jason Sudeikis would get a haircut. I helped her the best way I know how. https://t.co/gQyLYF3oZt .@AndyLassner and @official_tWitch did this little dance for me in rehearsal. Andy is the one on the right. https://t.co/woovjQ3kfc .@TheKalenAllen is a #MentalSamurai. I always knew it. https://t.co/HXHgWzioVk #TheBachelorette Hannah B. gave me the inside scoop on Colton and Cassie. @AlabamaHannah https://t.co/oTSmCKKcgi Thanks to Will Smith for sharing Mike’s video. OMG, he’s amazing. https://t.co/gTTZSJv9q4 Happy birthday, @AdamLevine! You should think about doing a Vegas show. I already have a name for it: Levine Las Vegas. It’s like looking in a mirror. @ellentube https://t.co/bOJUjxwZvp .@GayleKing can keep her cool during almost anything. https://t.co/UUr9qSsN80 Hannah B. is #TheBachelorette! And she just played a memorable game of “Who’d You Rather?” @AlabamaHannah https://t.co/eQrYhT9dlj Happy #StPatricksDay! I hope you watch this while eating a green bagel. @headsup @iamgreenfield https://t.co/BWc7aAZlkE What food tastes good with fruit punch? To find out, @TheKalenAllen &amp; @AdrienneBailon play a game of “That Don’t Go Together.” #OMKalen https://t.co/soYN1a7xjp Happy birthday, @theLaurenGraham. I love you so much, I can’t stahand it. Sometimes your school photo doesn’t turn out the way you were hoping. If you have a school photo that didn’t make the fridge, send it to me! #BadSchoolPhoto https://t.co/oR5KVTqNrq #NancyDrew is in theaters today! And you thought you didn’t have any weekend plans. My host Jason Sudeikis and guest Max Greenfield decided to celebrate #StPatricksDay. @iamgreenfield https://t.co/C8Z644Zs3b Somebody call the frosting police. @ellentube https://t.co/JwH7KLclHg Mike Pence met with Ireland’s openly gay PM and his boyfriend. This makes me very happy. https://t.co/yQU48MkcO5 I love what Andre McDonnell is doing with “It's From the Sole.”\nThanks, Jason Sudeikis, for bringing him to my show. @itsfromthesole https://t.co/rwfH95TWYY Max Greenfield and Jason Sudeikis did some Dadsplaining. @iamgreenfield https://t.co/43QlNlYhRH Jason Sudeikis has a brand new segment that’s nothing like my segment #OhMyMom. Please enjoy #OhMyDad. https://t.co/mdsvVNVEVk Happy birthday, Ruth Bader Ginsburg! Don’t get Ginsburned by your candles. Jason Sudeikis had a dream to host my show, and I had a dream to sleep in. It’s a win-win. https://t.co/DSqHsUJyZl Big news for @billieeilish fans in the LA area. You can be here for her performance. Clear your schedule for March 18th, and email me here. billieeilishonellen@gmail.com Tuesday’s #GameofGames will send you spinning! Don’t miss it. https://t.co/FHrBOvrZPT https://t.co/sfrJ6JSYWu Now I know why they call it a cold snap. When it’s cold, you can snap some great footage. https://t.co/ngH8o0wOvp I couldn’t stop listening to @TaraWestover’s book, “Educated.” I’m so happy she was here today. Thanks, @MichelleObama! https://t.co/y8JWrUr29I My new movie, #NancyDrew and the Hidden Staircase, is in theaters tomorrow! Even my Alexa is excited. https://t.co/W7UUnQ19rc Happy birthday, @StephenCurry30! Sending love to you and your adorable starting lineup. Someone on Cameo just got a Ben-Affleck-rapping-sized bonus from @AndyLassner. @BenAffleck @TheEllenFund https://t.co/wwMHltwZuC Happy birthday, @Simone_Biles! Whatever you do today, I’m sure you’ll stick the landing. Here’s an exclusive sneak peek at my new movie #NancyDrew, in theaters tomorrow! Go see it! https://t.co/E9ZmHIiMHz @CoryBooker Me too. Special thanks to my Booker booker. .@BenAffleck’s back! I mean, he’s back on my show. He also told me about his back tattoo. https://t.co/QOb53SQOdk Broadway star @BenSPLATT was here to tell me about his big life updates. https://t.co/8YPJjne9GY If you were glued to last night’s finale, you can’t miss the last episode of our Bachelor Recap Show! #TheBachelor https://t.co/eVqYTY5xhu I was blowing bubbles for hours to get this shot. #EDbyPetSmart https://t.co/8LP2guTyzn You’re done, right? @ellentube https://t.co/ONDkUdr7XN Don’t you love it when you love a song and then @ChakaKhan comes and performs it for you? https://t.co/kMf2IP0WJu This story really touched my heart. I’m pretty sure it’s about to touch yours. https://t.co/QCQx2GJFOp I’m happy my friend @TigNotaro has a new talk show. I’d be a lot happier if she didn’t do it during my talk show. https://t.co/gX3sS5T3qM I love a second chance... especially when it involves my game #TasteBuds and these hilarious teammates. #GameofGames https://t.co/QFzRUSSFsY @ChakaKhan @diary_records @ChakaKhan is a legendary legend. Seriously. Facebook and Instagram are down! Don’t worry. I made this great playlist for you to watch on @ellentube. https://t.co/R9EUv23F7o @OffsetYRN You be bad, I’ll be boujee. .@TheKalenAllen and @EllaMai played my new @HeadsUp deck. Watch it all on @Spotify! #ThanksSponsor https://t.co/x4a8lNjCL3 https://t.co/hqFsmRm8lu Me on Ellen\n \nEllen: So, I heard you like the “Me on Ellen” meme. \n \nMe: OMG, Ellen, you didn’t. \n \nI did. https://t.co/DpekBxj3LF .@Lupita_Nyongo told me about making “Us,” and I don’t think I’ll be able to sleep tonight. #UsMovie https://t.co/rEgoc18ub2 You’re not gonna believe all of the amazing guests on my show next week. The legendary David @Letterman, Presidential hopeful @CoryBooker, #Bachelorette Hannah B, and @OffsetYRN is performing with Travis Scott @trvisXX! We got our hands on the exclusive footage of #TheBachelor after he jumped the fence. @colton https://t.co/V4K3lUagfx Congratulations, Tania Z. and Merray A.! You both won more than the winner on the show tonight and you didn’t even have to go in the #StinkTank! Download the #GameofGames app, I don’t know what you’re waiting for.\n\nhttps://t.co/8WXf7r3zw7\nhttps://t.co/UKdqNduc17 Oh, Jenny. YOU HAVE RED HAIR?! WHAT? WHY? NOOOOOOOOO. #GameofGames #HotHands West Coast! You waited so patiently. Now it’s your turn to watch #GameofGames! Turn it on now! And get your app ready. \n\nApp Store: https://t.co/epqlFQCL7K    \nGoogle Play: https://t.co/pjF3RTQv5s \nhttps://t.co/UKdqNduc17 I knew a leopard who also couldn’t change the toilet paper roll. Leopards, am I right? #KnoworGo #GameofGames @mrs_jennyv @NBCGameOfGames You really know your way around a song. #KnockinBoots #GameofGames You’ve seen them all play games so far. Who do you think will win #KnoworGo? #GameofGames Kristopher’s mother, are you on Twitter? Do you really make him whipped cream for dinner every day? How many days a week do you make him whipped cream? I need to know. #GameofGames #TasteBuds Helen and Christine did great. Let’s see if Kristopher and Elizabeth can ketchup. #GameofGames #TasteBuds Holly’s about to get real low. #GameofGames #KnockinBoots OMG. Songs with “night”? What were you thinking of? #GameofGames #KnockinBoots RT @bossking832: Love this show makes me laugh feeling like a kid again.#GameofGames RT @zaynarose89: #raisethemright. \n\nOur family is addicted to #GameofGames  ❤️❤️❤️❤️❤️❤️❤️❤️ https://t.co/uUSTPw33br Zack almost came back from behind, but they couldn’t beat Meghan and Allen and Allen’s behind. #GameofGames #ScaryGoRound Oopsie. I think I should start making Ellen suspenders. #GameofGames #ScaryGoRound You know what they say... if @NBC buys you two high tech hydraulic arms, ya gotta use both of ‘em. At least that’s what I say. #GameofGames #StinkTank Oh, Karen. You picked a terrible day to wear a top without shoulders. #GameofGames #StinkTank That’s right! Get your #GameofGames app ready for your chance to win $5K. Unless you think you can’t solve today’s puzzle. (That’s called an intimidation tactic.)\nApp Store: https://t.co/epqlFQCL7K    \nGoogle Play: https://t.co/pjF3RTQv5s \nhttps://t.co/UKdqNduc17 We all know he picks Cassie. So, check out #GameofGames right now on @NBC. #GameofGames is back tonight! I couldn’t wait to tell @AndyLassner. https://t.co/xCRDum3xB2 This dress is my favorite pick so far. @JLo @ARod https://t.co/aa7CaToome My jaw is still on the floor somewhere. https://t.co/4ZspnJma7E .@SophiaLillis is starring in the new version of #NancyDrew, and I’m executive producing. I hope you enjoy it. https://t.co/WjRDQbQpuT Hold on to your seat cushions! We’re baaaack tonight! A brand new episode of #GameofGames is on @NBC 8/7c, and you’re not gonna want to miss it. https://t.co/FU655aSlry You can find this jacket and so much more in my #EV1 line at https://t.co/KKOnPt1pDG. We’re gonna look so good together. #ThanksSponsor https://t.co/iMl6QbClBx Do you have the best crew of BFFs? Do you all love my show? You can win VIP tickets for all! Tell me about them right here. https://t.co/iAc7WhCpVX Jaheim and Darius have a dream of getting into college, and I’m holding an envelope. #ThanksSponsor https://t.co/TkoZY663zS This is adorable. If you have a video of a baby with a pet, I wanna see it on @ellentube! https://t.co/bfwY07O5gf https://t.co/Uc3sVGSWHB It’s official. @ARod and @JLo are engaged. THANKS TO ME. https://t.co/RR9xfPQtDJ I love some clowning around with my friend Colin Farrell. https://t.co/d05JhPnxgr Brand new #GameofGames tomorrow! Remember how much you loved #StinkTank? And #TasteBuds? Well, they’re baaaaack! https://t.co/EnRgP1XArz This is what @ellentube was built for. We did it. https://t.co/Sc3kxE5eLR Please enjoy my new favorite game, “Churro Chomper.” https://t.co/UDcD7a8wEu Here are some funny memes to get you through this Monday. Stay strong. https://t.co/hhovTZlKny .@JonDorenbos performed the most magical gender reveal I’ve ever seen. https://t.co/LdDDe3jSJw My writers help me in so many ways. The least I can do is try to help them find love in a grocery store. @pommyrantz @BenteIngrid https://t.co/oil13WDBd8 .@BethBehrs is about to become a goat mom. You heard me. https://t.co/eznotTGoub Happy birthday, @oliviawilde! Your husband and I are big fans. Happy birthday, @carrieunderwood! It’s your birthday. You can cry pretty if you want to. Do fruit punch and tuna fish salad go together? @TheKalenAllen and @AdrienneBailon find out! #OMKalen https://t.co/L1DDMesexn @HRC ❤️ @MaggieLindemann ❤️ Have you checked out my new bonus videos on @Spotify yet? https://t.co/NLOEAQiDUv Well, at least one of them can say it. @ellentube https://t.co/KjxGWaTaQn Yoyoka is a brilliant drummer. I’m not sure she’ll take to the xylophone. https://t.co/DekBxSXCrc I’m celebrating #InternationalWomensDay with some of my favorite womens. https://t.co/wB6hRLhcWf .@BrieLarson is Marvelous. #CaptainMarvel https://t.co/1HFiSrfxfa I’ve been shooting exclusive videos with some of my musical guests backstage at my show, and today you can WATCH them on @Spotify. #ThanksSponsor @johnlegend @JKCorden @HERMusicx https://t.co/UEzPBJfRfK https://t.co/5HMOExKY38 Yes, it’s true! Watch tonight! (Somebody please translate this into Spanish.) #JuegoDeJuegos #GameOfGames @silviabril https://t.co/thyYIVasOC This had me on the edge of my seat the whole time. The ending is worth it. @ellentube https://t.co/FPVUcGKbHS Go listen to today’s podcast to find out why I posted this. #EllenOnTheGo @portiaderossi @EdGlavin https://t.co/yH7Eb3WdLv https://t.co/YavLwDLjjU I learned a lot about @JLo in this round of #BurningQuestions. I also learned a lot about myself. https://t.co/bzGu1eVhts Hey, Heads Uppers! Now you can play “As Seen on TV,” a deck of all TV shows for FREE, thanks to Mental Samurai! @HeadsUp #ThanksSponsor https://t.co/3vCOz5BxCK https://t.co/uD736ipR7c We’re back. #TBT #Maleficent #Elleficent https://t.co/HnfCbAOTh8 @iamwandasykes 😂 Salif is worth the train fare from France, and so much more. https://t.co/t7Q7wwEgwi Happy birthday, @JennaFischer! I’m celebrating with a #SplittingUpTogether marathon. Do you two wind up together? Don’t tell me. I don’t wanna know. Cats. They're just dogs with attitude. @ellentube https://t.co/TRinpkIYUZ .@JLo told me about how @ARod surprised her with @JoannaGaines. https://t.co/cG3tyEux8W We have a very special guest on our podcast today. @PortiadeRossi! Oh, and me. #EllenOnTheGo https://t.co/yH7Eb3WdLv Happy birthday, @iamWandaSykes! Wherever you’re going to celebrate, I’m sure your kids will take a separate plane. Do you have a great video for my game #EpicOrFail? Upload it to @ellentube, and you could win a $150 gift card! https://t.co/lABTcjXgTd https://t.co/jWhbl6h82W The women told all last night, and Caelynn tells even more on my #Bachelor Recap show. #TheBachelor @ellentube https://t.co/8C19cB0riD Well, that’s one way to make your broccoli disappear… https://t.co/XOAEgTRKN2 I woke up in a hamper once. I didn’t look like this. #EDBundlesOfJoy https://t.co/cwzHHtNG8k .@KendallJenner felt bad that I never scared her. https://t.co/Qwb85ZHrae This season has been more fun than a baby goat in a bouncy house. https://t.co/aj0gKIwqQy Happy #MardiGras to everyone in my hometown! https://t.co/BcCgJOVjz6 My Executive Producers revealed a fun secret about the show on our podcast today. Got a question about the show? Tweet it. You never know who might stop by to help answer. #EllenOnTheGo @EdGlavin @MaryConnelly @andylassner  @kevinlemanII https://t.co/iLL5FQ3d3R .@official_tWitch brings a little joy into everyone’s life.\n\nUpload your videos to the @ellentube app! https://t.co/Y4q0Y6Gdzw https://t.co/ImCzwS6kZX She’s gonna spend it all on catnip. @ellentube https://t.co/F7EanuGyqx I love the people who work on my show. I just have a funny way of showing it. @andylassner @EdGlavin @MaryConnelly @kevinlemanII @coreypalent @pommyrantz https://t.co/vmqh1koGsc .@AlecBaldwin and his wife @HilariaBaldwin are a reality show I would watch. https://t.co/wT2EEwjJaB I’m watching @Oprah interview James Safechuck and Wade Robson from #LeavingNeverland on @OWNTV. I hope everyone watches this. #AfterNeverland It's Monday, and that means my producers are going live on Twitter with our Bachelor Recap Show with the most dramatic episode yet! #TheBachelor \nhttps://t.co/kUP9u3mqmf .@JonDorenbos could be coming to your front door with a game show and a lot of fun. But first you have to tell us about yourself here. https://t.co/8VUQHleHDk #DollarsFromDorenbos https://t.co/gu6Xs43GRf Spring is just around the corner, and the Spring #EV1 Collection is here! Check it out at Walmart today! https://t.co/uy10dgv2xh https://t.co/BNTFmXJR4a Happy birthday, Young Dylan! Love, Funny Ellen. https://t.co/kJAWUxuYCJ I love this song so much. @MarkRonson @MileyCyrus https://t.co/TguBXRS7lp They just found out they’re not related. https://t.co/nS4x9o6SgY Thank you so much to everyone who came out to see me in Toronto and Montreal. Time for this goose to fly back South. https://t.co/OjbauGvtY1 Made a quick visit to our neighbors up North. The crowds in Canada were amazing. https://t.co/GDeyp8YciD @CoryBooker @PrincipalAkbar He’s a great principal and I should know. I spent a lot of time in the principal’s office. Happy birthday to two of my favorite JBs – @itsJulieBowen and @JessicaBiel! I hope it’s Just Brilliant. .@Camila_Cabello! Happy cabirthday! Happy #WorldWildlifeDay. Let’s protect and cherish the world’s greatest creatures. @TheEllenFund #WeNeedGorillas https://t.co/LqBPj5wkkB Happy birthday, @RebelWilson. Love, Rebellen. https://t.co/xke7Hrx9jO We wanna hear the most embarrassing thing your dad ever did. Use the hashtag #OhMyDad, and we might read it on my show. Happy birthday, @Lupita_Nyongo. You’re 36 years Nyong’o. Everything about @TPain’s run on #TheMaskedSinger was surprising, including his appearance on my show. https://t.co/feRiJ8vtBl Happy birthday, @JustinBieber. This is just one of the reasons why I love you. Remember this? https://t.co/Xv8pL0uYEO .@JohnMayer told me he’s too old for best friends. He has dear friends. https://t.co/28C7Iianbf When life hands you lemons, give those lemons to a dog and film it. @ellentube https://t.co/5Mlt7wjRkb Here are a few things from Walmart that are perfect for your weekend. #ThanksSponsor https://t.co/z813Hc2vAB https://t.co/o66OsTuhye @TPAIN ❤️ Nothing gets between @AndyLassner and his Calvins. @ShawnMendes @KendallJenner @asvpxrocky @noahcent #MYCALVINS https://t.co/XtJ8A96SoT Akbar Cook is the principal every school needs. It made me so happy to do this for him. #ThanksSponsor https://t.co/7xFhByN6zd Spain’s version of #GameofGames airs tonight! Quick! Everyone fly to Spain! #JuegoDeJuegos @antena3com @silviabril @juegodejuegos Be careful out on the ice today, folks. https://t.co/3c5KLL5bwA If you’ve ever had a question you were dying to ask @JohnMayer, I asked, and he answered all of them. #BurningQuestions https://t.co/F0iCoeqbE2 .@PattyArquette’s new Hulu show, #TheAct, is based on a true story, and it’s absolutely chilling. https://t.co/XMhGrqQwAM This is un-flipping-believable. @ellentube https://t.co/8g81YNuBmR I made an unboxing video! Check out all the wonderful things in my newest BE KIND Box. #ThanksSponsor https://t.co/z15yzJj3yU https://t.co/k9DTNWcZXL @ParisHilton I miss us. This baby goat video might be the GOAT. @ellentube https://t.co/bSkkfbDb8y I got my hands on the trailer for the new Mueller report. https://t.co/VLfqPUO8Zj It’s official. @TheKalenAllen is a big star. Thanks, @christiancowan! https://t.co/KqxlWcEuqC My Executive Producers answered questions about my show on the #EllenOnTheGo podcast. Do you have a question about the show? Ask away! @EdGlavin @AndyLassner @MaryConnelly @kevinlemanII https://t.co/niWX8hzD7K We couldn’t guess who this very handsome #MaskedDancer was. Can you? https://t.co/XfVgig0ahO Don’t miss the finale of #TheMaskedSinger tonight 8/7c, and then watch the winner on my show this Friday! This group of incredible people became friends through my show. The fact that they are supporting each other through the loss of our friend Lisa Jarmon means so much to me. https://t.co/i0UY88dNL0 The world isn’t the same without Lisa Jarmon. https://t.co/CJqqmsiimd Lydian is only 13 years old, and he can play Mozart blindfolded. I’m 61 and I can’t spell Mozart blindfolded. #WorldsBest https://t.co/xXK2NCbjEP .@IdrisElba told me about being the #SexiestManAlive. https://t.co/45DJG5LOWf My wife is the best wife in the world. Thank you for this beautiful campus, Portia. #WeNeedGorillas @TheEllenFund @SavingGorillas https://t.co/PQoJB5Vcza This is the cutest rap battle you’ll ever see. @ellentube https://t.co/FZWLElpNEr .@IdrisElba told me about DJing Prince Harry and Meghan’s wedding. #RoyalWedding https://t.co/RqzWMslqJU I’ve seen lots of people post about how they’d be great on my game show, #GameofGames. Here’s your chance to prove it! Enter here, and you could be a contestant on Season 3! https://t.co/IUQgojfuGh This week on the #EllenOnTheGo podcast, @AndyLassner explains to everyone what he does on my show #GameofGames. #ExecutiveNapProducer https://t.co/6Y9BdtOegA I’m nominated for a Kids' Choice Award! You can vote for me right here. But no peer pressure. #VoteEllen #KCA https://t.co/DzrAV8XYz9 https://t.co/rwuxBmHYdy Tavaris’ tooth fairy must be loaded. https://t.co/vGMBc9TsYB Kate won $5,000 playing my watch along game during #GameofGames. Then I challenged her to a live version. https://t.co/4HCX8ZrOGb Who knew Mila Kunis was so obsessed with #TheBachelor? https://t.co/GQTGaCqdyT The new Be Kind box is here! Get yours before they’re all gone! https://t.co/yoo25sOxao https://t.co/aBMCWRg6uL #SplittingUpTogether is on tonight at 9:30PM on ABC! We’re all about to find out a whole lot more. https://t.co/JsdZiMlBUG The world will never forget the Los Angeles blizzard of 2019. https://t.co/GdrKjQH6py @MarkRonson ❤️ .@AndyLassner is still on Cameo making videos for fans. Apparently, he’ll say hello to your cats if that’s what you want. https://t.co/OZaP4yTPoc https://t.co/sD0hRp085U I love @JLo for wearing my dress to the #Oscars. You looked beautiful. So did your whole row. https://t.co/qcsth7UFr8 .@MarkRonson won an Oscar with @LadyGaga for \"Shallow,\" and he was here to tell me all about it. #Oscars https://t.co/YNvXUMB5eZ It’s Monday, and that means my producers' Bachelor recap show is live! Check out everything they have to say about Colton’s hometown dates. #TheBachelor https://t.co/XroHvwoz00 Me at rush hour. @ellentube https://t.co/R4UcSv00yV You know what they say... the couple that eats a ridiculously hot peppers together, stays together. #ChocoChallenge @DaxShepard @IMKristenBell https://t.co/j3GDBtWrkP “It’s not about the pasta!” #RealityShowClips https://t.co/hvD2cXEZbi This just in… https://t.co/gt8e4EiyUy @DevinScillian Thanks for constantly interrupting my show. It’s my birthday gift to you. @chelseahandler https://t.co/dBomUbTSiJ @itsjameskennedy Maybe if you weren’t too busy focusing on the pasta you would’ve seen it. I can’t imagine a better duo to tell you about the birds and the bees than @IMKristenBell and @DaxShepard. https://t.co/toKegd4kE1 You can watch the entire season of #TheBuildUp on @ellentube. After watching it, I can’t imagine wanting to do anything else. https://t.co/93GDixpbmE I’ve never seen anyone shred a ukulele like this. https://t.co/A3VIoFwvxX .@IMKristenBell and @DaxShepard make an incredible couple. It turns out they do not make a great #TasteBuds team. https://t.co/27IMyZDawQ #NotReadyForMonday https://t.co/YNRmLKKbSM .@AllisonBJanney makes a great bedtime story reader. https://t.co/8q00KyjVcL If your kid has moves, I wanna see ‘em! Post a dance video on @ellentube in our new challenge, \"Can Your Kid Dance... with @official_tWitch?\" https://t.co/2LF7xLPQOI https://t.co/uQVYvfgvkU Before sending @TheKalenAllen to @NYFW for the VIP treatment from @EndeavorExp, I made sure to have @KendallJenner help him with his walk. #OMKalen https://t.co/8COYXbl1bq @MeekMill You two should perform together on my show. The Be Kind Subscription Box is back! Go to https://t.co/z15yzJj3yU to subscribe. https://t.co/6PEl6eJQV8 It was so cold in L.A., you’re not going to believe this, but rain froze into these little flakes and fell everywhere. https://t.co/t3DVQHd8jE I have never seen a gender reveal like this. @ellentube https://t.co/DYRpzrzH4c Do you have what it takes to be a contestant on #GameofGames and win $100,000? Here’s your big chance! https://t.co/VYonqpjVrU https://t.co/FSorl7LtEG OMG. I love this video. I need @ChakaKhan here now. https://t.co/ueF6PnjNam Happy birthday, @DrewBarrymore. I hope you eat cake, get hugs, and phone home. @idinamenzel Have you thought any further about my title idea? “Frozen: Ice Ice Baby 2 Cold”? Walmart now lets you pick up your items curbside – like bananas and mops, and daughters you haven’t seen for two years. #ThanksSponsor https://t.co/pvUxi8e4ee Young Dylan met @KingJames, @StephenCurry30, @DwyaneWade, and @MeekMill at the NBA All-Star Game, and let me tell you, the @NBA All-Star Game has never been so adorable. https://t.co/31XRy3R0ST Spain’s version of #GameofGames is on in an hour! Quick, everyone get on a plane and fly to Spain! #JuegoDeJuegos Less than an hour left to bid on #SuperBowl MVP @Edelman11's beard. Bid now, and I’ll throw in the Ziploc bag for free. https://t.co/nxhyvmIcuV I think @iamWandaSykes just applauded me for not having kids. https://t.co/xfLHwjMaYG Very excited to release the newest #Frozen2 trailer. 🙏 https://t.co/HQeCuwPu2v Everyone’s a critic. https://t.co/AJ402tN532 If you’re in a bad mood, @FLAGALine is about to talk you out of it. https://t.co/f6Ou2P1ws3 Actual footage of our government coming to a deal on the border wall. #DealOrNoDeal https://t.co/vIT3yYsykT My Executive Producers gave a sneak peek on my podcast about something coming up on the show. Subscribe today so you don’t miss a moment! #EllenOnTheGo https://t.co/yH7Eb3WdLv https://t.co/kNPs1XgndM I could watch this little boy drummer all day. https://t.co/9HdQTNK3eU This was an epic prank fail on #ThisIsUs star @MiloVentimiglia. https://t.co/gViuRBEJXs Today I revealed whether the newest @FLAGALine is gonna be a pink line or a blue one. https://t.co/hOXE9F4tuG .@MiloVentimiglia told me about the end of #ThisIsUs. https://t.co/9odUGhBuFt Do you have a specific question about my show for my Executive Producers to answer on our podcast? Tell me about it here! And yes, I did recently switch to my winter wig. #EllenOnTheGo @EdGlavin @MaryConnelly @AndyLassner @kevinlemanII https://t.co/UYDoR9FI1t DONKEY! https://t.co/Rn4bvYAvIH I got Portia a special gift for our anniversary... that didn’t go according to plan. I’m not making that mistake again. https://t.co/C6jBkYqLxo Portia hiked through the forest in Rwanda with this stuffed gorilla. It can now be yours. @theellenfund https://t.co/kV1F996ZS4 https://t.co/NhRmLQRHNg Check out my new @Spotify playlist! Perfect tunes for doing whatever you’re doing right now. #ThanksSponsor  https://t.co/HEUwyUgfgp Heartbroken about the Mars Rover. https://t.co/vOxp0KwuMi The incredible @ShinLimMagic blew my mind! https://t.co/qhp6M7yWwV Nothing makes me happier than finding two best friends and pitting them against each other for a chance to win $12,000. #ThanksSponsor https://t.co/2yKKLjSYFp My 61st birthday was slightly different from my 60th. @portiaderossi @theellenfund @savinggorillas https://t.co/0Gh54EPA1E I’m not saying Kanye stole my idea, but... https://t.co/LTkKO4vOBs .@Rihanna is 31! Happy birthday-eh eh eh eh eh. This has been one of the most incredible years of my life. It’s all because of Portia. And you. @TheEllenFund https://t.co/peB7o2aONz Jacqueline A. just won $5,000 at home by playing my #GameofGames app along with the show! Congratulations, Jacqueline. You're not only brilliant and rich, you also have exquisite taste. https://t.co/ThIBNMMWWE You’ve got a few weeks to practice in my app. We’ll be back on March 12th with a brand new episode of #GameofGames! https://t.co/8WXf7r3zw7 Pam, for someone who wasn't sure about #HotHands, I'd say your hands were pretty darn warm. Congratulations! #GameofGames West Coast! It's almost time for #GameofGames! East Coast, don't spoil it for them. I don't want them to find out about the giant live snakes. I'm kidding... or am I? Congratulations, Susan S.! You won my watch along game from home! $5,000! That's more than you get for watching old reruns of The Commish. #GameofGames https://t.co/Z8yMrz4kVU When I throw an apple at someone, it means I want a new iPhone. #GameofGames #KnowOrGo John, you didn't win #BlindfoldedMusicalChairs, but I hope you will live long and prosper. #GameofGames .@MelissaMcCarthy, @PrattPrattPratt, @MargotRobbie, &amp; @DavidSpade – thank you for putting the “dang!” in #DangerWord. #GameofGames I think \"balls\" might be another #DangerWord, Mike. #GameofGames I don't think that was a very good plan, Mike. #GameofGames #DangerWord Wow, we're down to two contestants. IT'S GETTIN' HOT IN HERRRE! #GameofGames I wish I could've given Rad more time, because THAT'S WHAT FRIENDS ARE FOR. #GameofGames Something must happen to people when there's a giant boot behind them. Quick, name a song that has \"baby\" in the title. #GameofGames I was once in a chicken nugget competition on Twitter. I'm not ready to talk about it yet. #GameofGames I don't think Stephen could’ve made it one more round. #GameofGames #DizzyDash Hurry! It's game for Time of Times! Okay, maybe slow down a little, Ellen. It's time for #GameofGames! If you're gonna watch #GameofGames tonight (and I know every single one of you will), make sure to download my \"Game of Games\" app so you can play at home and win $5,000! \n\nApp Store: https://t.co/epqlFQCL7K    \nGoogle Play: https://t.co/pjF3RTQv5s \nhttps://t.co/UKdqNduc17 Retweet if you're gonna watch #GameofGames tonight. https://t.co/XzE4V26Iq3 This movie's gonna be really huge and absolutely terrible. @HeadsUp https://t.co/tqO3gAJilh .@JohnLegend can \"Preach\" on my show anytime he wants. https://t.co/3bEFOJsyD8 Did @WolfgangPuck and @Diane_Keaton just become a celebrity couple on my show? https://t.co/5mpVpYZXpk This is @EdGlavin's new fanny pack. Hear all about it on today's episode of my podcast, #EllenOnTheGo! https://t.co/yH7Eb3WdLv https://t.co/DeU1r24M82 This little boy meeting his little brother just melted my heart. @ellentube https://t.co/2BFUhlncOb It was the best of games, it was the worst of games. #GameofGames https://t.co/sorlcQAgg3 I have a reward for when @JohnLegend learns how to swim. https://t.co/qRifrduymq Happy bobby birthday, Millie Bobby Brown! @Milliestopshate Do you like green eggs and ham? I made it a TV show, because I can. I made it with my friend Diane. @Diane_Keaton https://t.co/t8ZlNx2i8h .@JohnLegend told me how his wife @ChrissyTeigen tweets him right. https://t.co/a3uUSViUxn #TheBachelor Recap Show is LIVE on Twitter to spill the tea on what went down in Denver from tonight’s episode. I hope they remember to clean it up after. https://t.co/Gx2M2CdvoI #DizzyDash is back on #GameofGames Tuesday! I’m so excited, I can hardly stand up straight. https://t.co/ihKQUQ2GZK I love sending @JonDorenbos to surprise people at their door. How come everyone knows it’s me on the phone? https://t.co/3aImiFhqnp Macey Hensley, you always have my vote. https://t.co/QQdXlS72tg .@JustinHartley showed me how he’d play James Bond. I was shaken AND stirred. https://t.co/oBexftLe3w This might be my favorite thing we do... having @pommyrantz and @BenteIngrid speak to strangers by speaking only in song lyrics. https://t.co/XDbx4SjGiC My new segment #TheMaskedDancer is taking the world by storm. You’ve never seen anything like it before... except #TheMaskedSinger. https://t.co/Iah22pEerc #SplittingUpTogether is back Tuesday! It’s all been leading up to this. This is gonna be a big one. https://t.co/0JCMUjbiJc Macey Hensley is a 9-year-old presidential expert, and there’s no one better to explain to me what’s happening in the government. https://t.co/ikte3YotFT What do you do with presidential expert Macey Hensley and @JustinHartley? Play \"This Is U.S.,\" of course. https://t.co/tXCCtML0So Happy birthday, @EdSheeran! I hope you have something wonderful planned. Something tells me the bar is where you’ll go. #OMKalen is back for another wonderful #Saturkay. @TheKalenAllen @ellentube https://t.co/6JNxNwzCWM This Tuesday, four of my favorite contestants make it to #KnowOrGo on #GameofGames. Make sure you’re watching. https://t.co/KTvnWt6hjo Young Dylan is the perfect start to your 3-day weekend. https://t.co/M8brxgNGDf It’s the final episode of this season of #TheBuildUp! This show makes me so happy. @ColaneriJohn @CarrinoAnthony @A1chopsTrill #ThanksSponsor https://t.co/HF2mmPJXpa .@CharlizeAfrica and @SethRogen are my new favorite bobsled team. @HeadsUp https://t.co/suDYmiQdg4 .@AliciaKeys, meet Ellen Keys. https://t.co/0H6s8a0L6m I was so flattered to be a part of this magical moment. @KimKardashian https://t.co/KurIbGGp7u .@Pink may have just incriminated herself in this round of #BurningQuestions. https://t.co/a280EZJ9IK I shaved off #SuperBowl MVP @Edelman11’s beard, and now you can own it! No, seriously. I’m auctioning it off for charity. I’m not gonna ask what you want it for. https://t.co/69dmzVCkNv .@SethRogen and @CharlizeAfrica have great chemistry. Almost as good as Charlize and her inner elbow. https://t.co/u8YmupMsPU #GameofGames is coming to Spain! It premieres tonight at 22:30 on Atena 3 channel! Buena suerte, @silviabril! #JuegoDeJuegos https://t.co/oviVvN7bvB I’m really proud of my friend @EllenPage. https://t.co/Y47iAfqGTN Here’s the new trailer for @CharlizeAfrica &amp; @SethRogen’s new movie, #LongShot! It’s a valentine from me to you. https://t.co/fSERr0nWfa Que bueno! Bonita! Casa Dragones! (I don’t know much Spanish, but why'd they change the name to “Egg of Eggs”?) @silviabril #JuegoDeJuegos https://t.co/nffF5hZznd It’s a #ValentinesDay @ellentube exclusive! I spiced up my favorite romantic movies with a little boogie. https://t.co/1HOqVQOfO9 You Bet Your Fiancée is a game where couples bet on what their significant others will know, and I bet on who’s gonna break up afterward. https://t.co/2lau4wcdoR .@BrandiCarlile is so talented, it’s a joke. https://t.co/q42hF1g1cP I can’t think of a better example of #GoodGoesRound than this. #ThanksSponsor https://t.co/E9Km8GPBVc Today is supposed to be a day about love. It’s also the anniversary of the Parkland shooting. Cherish the people you love today. I send love to the families and friends of those we lost. #MSDStrong @kenjeong Love to you and your Ho. I love a great match. That’s why I had my audience play my \"Mix n' Match\" game. Happy #ValentinesDay! #ThanksSponsor https://t.co/w23hT8Eeks .@official_tWitch brought some of his Magic Mike friends to the show. @magicmikelive #ValentinesDay https://t.co/tISbXsnHAJ My audience went nuts for #WallytheWalnut and @CaWalnuts on #ValentinesDay. #MyNuttyValentine #ThanksSponsor https://t.co/nDJC6fJTji Love is everywhere. #ValentinesDay https://t.co/oaORn8L7pF That is one lucky Ho. @KenJeong https://t.co/JT2Vhe6xJK I didn’t know how it would go with @RebelWilson talking to kids. But I didn’t think it’d go like this. https://t.co/WgAtmPg14i Nothing says #ValentinesDay like @KenJeong and a Mad Lib. https://t.co/KeP8Q6qidf @vancedegeneres @portiaderossi Thanks Vance. I know the gorillas appreciate it. But they never tweet me. I tried to eat like @JLo, and it was the longest day of my life. https://t.co/ZPCeQzOljL I made my French friend Salif say “Sacré bleu!” https://t.co/d2wufYzkqt I played #BurningQuestions with @JLo, and it turns out she loves @arod’s big… shoulders. https://t.co/aUGndJcm9N This series brings me so much joy. I couldn’t be more excited to see what #TheCousins are doing in the City of Baltimore. @CarrinoAnthony @ColaneriJohn @A1chopsTrill #TheBuildUp #ThanksSponsor https://t.co/NNJKrV8csZ @DrewFromTV The world has changed so much. And we still have a ways to go. ❤ you Drew. Salif and his crew are so good, it was worth driving them here all the way from France. https://t.co/z7l6XNXg7x @JLo You were ABsolutely wonderful. .@AndyLassner was so popular on Cameo, we had to up his price to $500. Don’t worry, it’s going to a great cause. Mine. @TheEllenFund https://t.co/kXJ8ah0B4K For #ValentinesDay, @official_tWitch and I answered some audience questions about... well, let’s say “love.” https://t.co/Hp22JzYDSi I think I gave @JLo and @AROD the perfect anniversary gift. https://t.co/C9oCakHCZh Hooray, Monica M.! You won my play-along game in the #GameofGames app! Do you know what that means? You just won $5,000! https://t.co/Z8yMrz4kVU Way to go, Brenna! You came, you confessed your love for Mrs. Butterworth, you conquered. See y’all next week! #GameofGames Okay, West Coast! It’s time for a wild ride on my #GameofGames! Please keep your hands and arms in at all times… Congratulations, Kathleen K.! You didn’t have to get slimed by Son of a One-Eyed Monster, but you still won $5,000 by playing the #GameofGames app! Way to go! https://t.co/Z8yMrz4kVU @chrishemsworth @andylassner @CentrFit Let me check Andy’s schedule. Wait, I’m being told he’s available literally every minute of every day. That was a great end to a great game. Congratulations to all the players. West Coast, you’re in for a treat! #GameofGames #HotHands I’m sorry, but those answers were both digiridon’ts. #GameofGames #KnowOrGo Working on my taxes. Does anyone know if mountain grease is deductible? #GameofGames #MtSaintEllen If you’re watching something else right now, you’re missing grown women scream about how their belly buttons smell like popcorn. #GameofGames #SayWhaaat I think the one thing we can agree on is that Mrs. Butterworth deserves better than this. #GameofGames #SayWhaaat This game is making me thirsty for a nice big glass of chunky milk. #GameofGames @istolethecatspj Then you should be playing in the #GameofGames app! \n\nApp Store: https://t.co/epqlFQCL7K    \nGoogle Play: https://t.co/pjF3RTQv5s \nhttps://t.co/UKdqNduc17 We were gonna play this game last week, but the 4,000 avocados I bought at Trader Joe's weren’t ripe yet. #GameofGames Something else that flies... whatever was in that egg. Sorry, Paige. #SorryNotSorry #GameofGames East Coast! It’s time for #GameofGames! Open the app! Someone will win thousands!\n\nApp Store: https://t.co/epqlFQCL7K    \nGoogle Play: https://t.co/pjF3RTQv5s \nhttps://t.co/UKdqNduc17 RT @TheEllenFund: It’s a big day! @PortiadeRossi was at the groundbreaking ceremony in Rwanda, and she sent us this video. #WeNeedGorillas… Look at my incredible wife breaking ground on our gorilla campus in Rwanda. I hope she changes her dress before she starts pouring the foundation. @TheEllenFund @SavingGorillas #WeNeedGorillas https://t.co/tyRmCU0JKM https://t.co/ptjBEXJpE8 It’s time for another episode of #EllenOnTheGo! It’s like watching my show with the director’s commentary on. And wearing a blindfold. https://t.co/OGnCxaf6uv Ziqi Li also known as Lil' Mushroom gave me a new dance nickname. Turns out, my old dance nickname was Ziqi Li. https://t.co/VTsQwsxfq7 H. E. R. is H. E. R. E. \n\n@HERMusicx https://t.co/0zDIFUAmow I flew Lil' Mushroom all the way back from China, because I can't get enough of her. You’ve got to see this! https://t.co/fz9k9G8i8a You bet your wife I’m gonna be watching #GameofGames tonight. Don’t forget to download the Game of Games app to play along and possibly win $5,000! \n\nApp Store: https://t.co/epqlFQCL7K     \nGoogle Play: https://t.co/pjF3RTQv5s  \nhttps://t.co/UKdqNduc17 https://t.co/dsKgRs7fXo Chris Hemsworth wants to help you look your best. So does @AndyLassner. https://t.co/hrMQ6ucY6d .@RebelWilson thought @LiamHemsworth was too hot to be funny. https://t.co/O4R03RzavX #TheBachelor Recap show is live on Twitter! It’s almost better than the actual show. https://t.co/DAi9otNfDK Holy Son of a One-Eyed monster! #GameofGames is on tomorrow night! https://t.co/KoMpe8vxXp We’ve all experienced some #ValentinesDay fails. Tweet me yours! #Failentines I want to ride every theme park ride with @PrattPrattPratt. https://t.co/Y7j5YEOSAu This guy knows how to #WorkItAtWork. #ThanksSponsor https://t.co/Em4qU0P8za Mark was my favorite part of last week’s #GameofGames, because his answer was so, so, so wrong. https://t.co/aiIbYuQ0HM .@PrattPrattPratt had a very busy year. https://t.co/6f2gsRWh5o Thanks to everyone who is requesting videos from @AndyLassner on Cameo. I feel like his agent... except I take all the money. https://t.co/HdAN4iUkVN Bachelor @Colton played a round of #BurningQuestions, and spilled the tea about #TheBachelor. Which contestant did he feel the most comfortable with? Watch on @ellentube to find out. https://t.co/3pebFgtEPG Are they splitting up, or together?! We’re getting closer to finding out on #SplittingUpTogether, tomorrow. https://t.co/zbQCMLmIe2 Grammy winner @EllaMai was here for the first time. She is so crazy talented. https://t.co/wNxgeJcTrT Happy birthday to my BFF, Jennifer Aniston. She’s not on Twitter, so if you see her, will you tell her I did this? I sent @MissyElliott’s funky white sister to the funky red carpet of the #Grammys. https://t.co/SgaNOEVp4o Whatever @PrattPrattPratt is selling, I’m buying. https://t.co/PuuakDncsK .@LadyGaga &amp; Bradley Cooper won for Shallow! Congralalalalalalalatulations! #GRAMMYs Happy birthday, @YaraShahidi! You’re getting old-ish! Happy birthday to a wonderful human, @LauraDern. I couldn’t imagine a better person to come out to. It's #SaturKay! @TheKalenAllen is back with an interesting food review... would you try this? #OMKalen https://t.co/LiHINKXSj7 Happy birthday to @Naomi_Osaka_’s future husband, @MichaelB4Jordan! If you live in the L.A. area, I’ve got two pairs of tickets to give away for the #Grammys on CBS this Sunday night! Who wants 'em? https://t.co/jFjL22spI8 It’s all fun and games 'til someone gets dropped in guac. Then it’s even more fun. #GameofGames https://t.co/AIUcT6gkNL My audience has amazing talents, but I was NOT expecting this. https://t.co/GaCxxnIVHo Pop, lock and record it while you’re at work, and you could end up at my show! #ThanksSponsor https://t.co/gH1uwKlCqH I promised this family a VIP trip to the show. I’m just saying I held up my end. https://t.co/8SZGPNiW87 Timothy &amp; Malik’s performance at the @Ravens game is awesome! #TheBuildUp @a1chopstrill https://t.co/MBXOnGm7BF .@KendallJenner told me why she was left out of the Kardashian Khristmas photo. https://t.co/BEKNi3c0NG Happy birthday, @KevinLemanII! I love you more than I have characters to say. https://t.co/rPJN7fc5kd There’s no better way to learn how to shave off someone’s beard than with the MVP of the #SuperBowl, @Edelman11. https://t.co/oX0sSdzvPL .@KendallJenner told me she was disappointed that I had never scared her. That felt like a dare. https://t.co/6ha8ffS2t3 @BarbraStreisand @melissamccarthy @RichardEGrant Ok. Stop yelling at me Barbra ☺ This is how you dance when you just got half a million dollars. https://t.co/5A2h3DjguO Happy birthday, @GarthBrooks! I hope you’re staying warm. I’ve got friends in snow places. I think my Alexa might be spying on me. https://t.co/NU9bK9vGuc @cheerios And we are so grateful to be able to reward the kindness of families like the Daniels family. #OneMillionActsOfGood Happy birthday to my friend @ChrisRock! Where's the party? Remember, my bedtime is 7PM... You’re gonna wish you ordered some of these before Valentine’s Day. https://t.co/X06eDnXDoO https://t.co/rwobUg0KIZ @kunalnayyar ❤️ .@BarbraStreisand I hope you’re watching this. Barbra, can you hear me? @RichardEGrant @MelissaMcCarthy https://t.co/gSKbIccN5c .@AndyLassner got so many Cameo requests! It’s amazing how many people have $4 to burn. We hit our Cameo capacity, so we’re suspending his account... for now. Sometimes you gotta throw an elbow. @official_tWitch https://t.co/RzFIDCj5Mn Happy birthday to someone I’ve seen in their birthday suit. I love you, @aplusk. https://t.co/Gk52mRnY6Z My Executive Producer @AndyLassner is on Cameo! If you’re looking for a wonderful Valentine’s Day message, or really any message, Andy can record it for you. https://t.co/xxQT6s9nLT These audience dance moves will really knock your head off your shoulders. https://t.co/urD4LrRg4W I can’t think of a more deserving family to receive the biggest gift in the history of my show. #ThanksSponsor https://t.co/5Fbv2Pq93s .@MelissaMcCarthy told me about the moment she found out she was nominated for an Oscar. https://t.co/qMAzHethbe I was blown away by what Candice did for the homeless people in Chicago. You can help her too. https://t.co/WTmjcdPgtG I’m drafting this kid for the Saints. https://t.co/AK5zMk7cz5 I’m lucky to get to see the world through @pink colored glasses. https://t.co/kvyJZoSuuO Somebody was happy to see @AdamLevine. @andylassner #SuperBowl https://t.co/V0FkCGpXmf You have to give these guys a hand. #WorldsBest https://t.co/C0SNzosb9Z .@ElizabethBanks told me about her kickass new version of #CharliesAngels. https://t.co/T7svBC2UmR When temperatures in Chicago hit -20 degrees, Candice bought hotel rooms for 30 homeless people. She doesn’t think she’s special, but I do. #ThanksSponsor https://t.co/TWUefYYO0o Happy birthday, Nate &amp; Tavaris! You’re two of the most impressive kids I’ve ever met. https://t.co/9uVNm5Pmsl @Pink Are you reading through all the compliments on Twitter? Another thing to check off my bucket list. I’m a LEGO. #GameofGames #TheLEGOMovie2 #ThanksSponsor https://t.co/H82I9GCZGj There has never been two more wonderfully ill-equipped people to go to the #SuperBowl than Ellie Kemper and @AndyLassner. https://t.co/YRwbdXnWaU What @ColaneriJohn and @CarrinoAnthony did to music teacher Mr. Brown’s school band room is incredible. #TheBuildUp #ThanksSponsor \n\nWatch the episode on @ellentube: https://t.co/Yb4tOljVv8 https://t.co/jITPtCIXXF Happy birthday, @AllisonHolker! Thanks for letting your husband be my work husband. @official_tWitch My friend @Pink needs to get better at taking compliments. Quick, everyone please tweet a compliment to P!nk right now. https://t.co/ULYzJJEVBX RT @NBCGameOfGames: Hey West Coast, what can we say?\n\n#GameofGames is coming for you NOW. ❤️ https://t.co/08JHC0fK0n Sarah, you crushed this game from start to finish. Incredible! Enjoy your $100K. Has anyone told you about @TheEllenFund? 😉 #GameofGames #HotHands .@VinDiesel, if you’d ever like to challenge Mark to a pie eating contest on my show, you know how to reach me. #GameofGames #KnowOrGo P.S. Remind me to never eat the pie at Mark’s house. Who droppin’? You droppin’! #GameofGames #KnowOrGo OMG. MARK! I couldn’t stop laughing when we taped it. And @portiaderossi &amp; I can’t stop laughing now. #GameofGames #KnoworGo East Coast- this episode is new but the watch-along puzzle in my app is a repeat. Oopsies. Don’t worry. I’ll still pick a winner. She was thinking, “How do you like them Apples?” #GameofGames #AwSnap QUICK COMMERCIAL GAME: What famous movie quote was going through Natasha’s head after she won? #GameofGames #AwSnap Who do you think is gonna win? Natasha is used to getting things done while people pull at her, but Jaimee’s probably used to dragging people out of a bar. #GameofGames #AwSnap I hope you’re watching, (CAR)D(BEE). @iamcardib #GameofGames RT @TheAnnieAntonio: im just waiting to see where Vin Diesel put his pies tbh #gameofgames I think even Margie was surprised she won. That was amazing! #GameofGames #MtSaintEllen That round of #DangerWord was full of surprises, but not even close to the surprise that Mark has in store for us with #KnoworGo. #StayTuned #GameOfGames .@MelissaMcCarthy the Academy just called and they’d like to give you another nomination for your #DangerWord performance. You are tonight’s winner! #GameOfGames .@IMKristenBell – How can you get the rap air horn to follow you around everywhere you go? Amazing. Best clue of the night. #GameofGames #DangerWord Fun Fact: @PrattPrattPratt hung upside down for two hours to get that shot. Now, that was the best one. #GameOfGames Wait. Demi Lovato. That was better. Sorry, @DavidSpade. I have to say, @DavidSpade, that was the best #DangerWord anyone has ever done. #GameofGames It’s time for #GameofGames! Get your Game of Games app! Get some popcorn! Get a confetti shooter! \n\nApp Store: https://t.co/epqlFQCL7K    \nGoogle Play: https://t.co/pjF3RTQv5s \nhttps://t.co/UKdqNduc17 Tonight everything on network tv is a repeat besides #GAMEOFGAMES! Come check out an all new episode! I promise it has an ending you will not want to miss. I’ve got such a big surprise for Stephanie Wiguna, it can hardly fit on my stage. #ThanksSponsor https://t.co/GlyJGNCEuY Got a question for my executive producers? Reply to my tweet, and they could answer it on our podcast! @MaryConnelly @EdGlavin @AndyLassner @KevinLemanII #EllenOnTheGo https://t.co/yH7Eb3WdLv Hey, @TacoBell, have you heard your new podcast? #EllenOnTheGo https://t.co/5fMHDHA8rA @TorreySmithWR @Oprah @TheRock @BarackObama @MichelleObama I just donated 10 tickets. I don’t want to get in a throwdown hoops shootout with Oprah. Again. .@Kelly_Clarkson’s got lots of Moxy. #UglyDolls https://t.co/WByhnXK5Ul It’s not easy being Ray Romano’s kids or wife. https://t.co/xBnfddFh97 Tonight! Find out where Vin Diesel put his pies on #GameofGames! https://t.co/e1kyqihr65 .@Kelly_Clarkson is getting her own talk show! https://t.co/yRCucbsqNX There’s nothing more exciting than being on the field of the #SuperBowl... except whatever @AndyLassner has on his phone. https://t.co/rg7VaUbogg The new #UglyDolls movie had me at @Kelly_Clarkson. https://t.co/wkU7ghO6Q1 .@Colton makes a special appearance on our Bachelor Recap show, coming to you LIVE! #TheBachelor  https://t.co/aQtaJrfx9a This dog is adorable. How did he make that mess without getting anything on that bear?! https://t.co/z9pP0f06J1 .@AlecBaldwin and his wife @HilariaBaldwin are, well, hilarious together. https://t.co/ndzLGlMysS What’s in the Box? You’ll have to watch to find out! #ThanksSponsor https://t.co/Ykutex0WmZ Oh, the fun we have. https://t.co/9w1m5ayCRl Carli Peace is a piece of work. https://t.co/hRISvir7pE #MtSaintEllen is back! Bigger and slipperier than ever. #GameofGames is on tomorrow night at 8/7c on NBC! https://t.co/V3aumbaBrM What really did happen with the parking space, @AlecBaldwin? https://t.co/j2sMDS0q4i Congratulations, @Patriots! And what an incredible season for the LA @RamsNFL. You made us proud. #SuperBowl .@AndyLassner is a big football guy. #SuperBowl @RamsNFL https://t.co/wQLwY6jtBS .@TheKalenAllen is here for the snacks. Here’s the world premiere of his new #SuperBowl anthem. https://t.co/ysFtNcuoYw I might have to do the show from Montecito. Not a polar vortex but there is some crazy weather in southern California today. Hope everyone is safe. https://t.co/SKPNVYL96E .@ColaneriJohn and @CarrinoAnthony renovated an awesome apartment for inspiring drummers Timothy &amp; Malik in the 2nd episode of #TheBuildUp. I wish I had this apt. when I was their age. https://t.co/fPBH9wKedC After your #SuperBowl weekend, don’t forget to watch #GameofGames this Tuesday! https://t.co/O3i70SCLNq .@BrieLarson can hold her own on a dance floor. @official_tWitch https://t.co/wAQIs3OABh I predicted the winner of the #SuperBowl by the most reliable means I could think of – Grubhub. https://t.co/AMiS41ICrO I had a gift for 9-year-old Yoyoka, who doesn’t speak English. Fortunately, “disappointment” translates into every language. @yoyokadrums https://t.co/b7RB12smzx You might think this round of \"Super Bowler Holey Roller\" was rigged to go wrong. It was not. #ThanksSponsor #SuperBowl https://t.co/HhiBhU314g .@AndyLassner, you make a great @RamsNFL cheerleader. #SuperBowl https://t.co/gAC1fjPqpe This month, my Walmart list has something for everyone from #EV1! https://t.co/z813Hc2vAB https://t.co/nS4nxRXyoV .@Colton has some revealing things to say about the Fantasy Suite. https://t.co/mRRFaoCXDb"}