{"tweets": "#TakeBackDay is today! Let’s keep drugs out of our communities and schools.  You can dispose of unused drugs - including vaping devices and liquids! Find the nearest collection center here: https://t.co/Df7OfO6d5t #BeBest  @DEAHQ https://t.co/M1P8yEiIgf RT @WhiteHouse: Tomorrow is Take Back Day—an immediate way that you can protect your household from drug overdose and misuse! \n\nFind the lo… Earlier this month at @DEAHQ we recognized the dangers of illegal drugs &amp; honored the agents who keep us safe. Today &amp; during #RedRibbonWeek, we have an opportunity to come together in our fight against drug abuse. Take the pledge, choose to live #DrugFree #BeBest https://t.co/NEfeljkl4X A year ago, our Admin signed into law the SUPPORT for Patients and Communities Act. #SUPPORTAct provides the necessary tools to fight this opioid crisis. We’ve made great progress and my support on the critical issues of opioid abuse will continue through my #BeBest initiative. https://t.co/kZHPyqP6Ci RT @thehill: Melania Trump makes first solo visit to Capitol Hill https://t.co/aCsr1MBSGM https://t.co/qtGEUCn85K RT @WhiteHouse: This morning, @FLOTUS made her first solo visit to the U.S. Capitol, marking the one-year anniversary of the SUPPORT Act, w… Thank you to members of Congress who joined me today for a discussion re the #SUPPORTAct, signed last year as the largest piece of legislation on a single drug crisis yet. Your efforts in this opioid fight are instrumental &amp; we'll continue working on this important issue #BeBest https://t.co/l97pljxLUh Today starts #RedRibbonWeek. There is no room for illegal drugs in our schools &amp; communities. I encourage youth to take the pledge this week &amp; choose to live #DrugFree. #BeBest https://t.co/JXzCoKbaXL Teens from @TruthInitiative talked to me about their struggles &amp; experiences w/ e-cigarettes &amp; vaping. There's no place for these dangerous products in our schools &amp; among our youth. I'll continue addressing these health concerns to protect our most vulnerable. #BeBest https://t.co/gVIEAeeTDL RT @WhiteHouse: Christopher Columbus' watershed voyage ushered in the Age of Exploration, setting the foundation for development of our Nat… Ally's courage to share her story can help save so many of her peers from starting the dangerous habit of youth vaping.  Keep up the good work, Ally!  Be strong &amp; together we can help fight this addiction for children. #BeBest @TruthInitiative @BaytownSun https://t.co/4wzOQBlEuL https://t.co/eEBHYBMcGU Thank you to the @truthinitiative teens for joining me today &amp; sharing your experiences w/ vaping. It exposed just how invasive these dangerous products have become in our schools &amp; communities. I'm listening &amp; will continue tackling this important issue. #BeBest https://t.co/O5lHwTMPvb https://t.co/a4jFFus3nT It is my hope that this private space will function as both a place of leisure and a gathering place for future First Families.  Thank you to the many talented people involved for their dedication and support. I am pleased to announce the ground breaking of a new tennis pavilion on the White House grounds. This structure will be a testament to American craftsmanship and skill. https://t.co/6sY3anuOk2 Exciting to break ground on the new tennis pavilion project at the White House today. Thank you to all who will help in making this legacy piece possible for future first families to gather at and enjoy for years to come. @theNationalMall @NatlParkService https://t.co/UcYLeJ27Ni It was wonderful to host senior military leaders &amp; their spouses at the @WhiteHouse tonight. Thank you for your service to our great nation. 🇺🇸 https://t.co/uyZMIGQlzM #BeBest #RedRibbonWeek https://t.co/7w5NryzAF3 A wonderful Red Ribbon rally at @DEAHQ this AM. Schools are getting ready for #RedRibbonWeek beginning on 10/23. We honor the many law enforcement agents who keep our communities safe &amp; celebrate the students who pledged to live drug free lives today! #BeBest #DEARedRibbon https://t.co/7eR6wWbprk A great visit in #WY last week at @GrandTetonNPS. Sharing the #BeBest message w/ kids so they may continue learning about &amp; exploring our amazing outdoors! Thank you @NatlParkService &amp; all programs that work hard in preserving our natural heritage. #BeBest #EveryKidOutdoors https://t.co/OOWZ4hViXw RT @daily_cowboy: .@FLOTUS visited Jackson, Wyo. this week — her first visit to the Cowboy State since \n@realDonaldTrump was elected POTUS.… RT @SecBernhardt: Honored to welcome @FLOTUS to @GrandTetonNPS today and promote the #EveryKidOutdoors program through her advocacy for chi… RT @KWWL: First Lady Melania Trump takes a trip with second and fourth graders. https://t.co/oqJmLt8gn5 Thank you Craig Thomas Discovery and Visitor Center in #Wyoming for hosting me. Talked about important outdoor survival skills w/ thoughtful 2nd &amp; 4th graders &amp; joined @SecBernhardt in a @NatlParkService Arrowhead Ceremony.  #BeBest #EveryKidOutdoors https://t.co/YdCVBzbexJ Yesterday I visited the beautiful Grand Teton National Park @GrandTetonNPS.  We thank the many dedicated organizations and @NatlParkService for all they do in protecting and taking care of our national landmarks and parks. \n#BeBest #EveryKidOutdoors https://t.co/MaN1EjqJ1i Yesterday I met Jackson District @boyscouts at the elk antler arches in town square learning about their conservation efforts w/ Nat’l Elk Refuge. Explored #WY on Snake River w/ 4th graders observing the natural beauty of our lands. @NatlParkService  #EveryKidOutdoors #BeBest https://t.co/VvvAEKFIBG A great first day in #WY. Met w/ Jackson District @boyscouts at the elk antler arches in town square learning about their conservation efforts w/ Nat’l Elk Refuge. Explored Snake River w/ 4th graders seeing lots of natural beauty. @NatlParkService #EveryKidOutdoors #BeBest https://t.co/c86bwKzDUx Looking forward to traveling to Wyoming tomorrow and visiting beautiful National Parks and landmarks with 4th grade children. \n@Natlparkservice #EveryKidOutdoors #BeBest    https://t.co/RXjfFOhFY8 RT @PressSec: .@FLOTUS will travel to beautiful #Wyoming Thursday. Mrs. Trump will meet w/ children and encourage them to spend more time o… .@POTUS &amp; @FLOTUS #UNGA19 https://t.co/F7W0ggmoQY A great morning at the historic @NYSE w/ 4th graders who also shared with me their school’s powerful mission statement which has the same values as #BeBest. https://t.co/fiMeeKctSF Thank you @Stacey_Cunning &amp; @NYSE for welcoming me &amp; celebrating Be Best w/ such bright &amp; uplifting students from @UNISNYC! #BeBest https://t.co/wJsjNngdZJ https://t.co/9QJWOjLLPT Honored to participate in this timeless tradition of ringing the opening bell @NYSE with @UNISNYC students. #BeBest https://t.co/rSOkiE9cfC RT @NYSE: Special moment at the NYSE today as @flotus Melania Trump visited with students from the UN International School to highlight her… RT @NYSE: NYSE Opening Bell🔔: @FLOTUS &amp; fourth-grade students from @UNISNYC highlight the #BeBest Campaign https://t.co/P7xrq5lfZJ .@Potus and I send our sincere gratitude to all who made yesterday’s visit and last night’s state dinner such a success! Thank you to the military, State dept, East wing, usher’s office and residence staff for all of your hard work. https://t.co/ZYtW9zTJwl It was a great honor to host Prime Minister @ScottMorrisonMP and Mrs. Morrison at the @WhiteHouse! 🇺🇸🇦🇺 https://t.co/nTPnRPdrNX RT @realDonaldTrump: I want to express my gratitude to America’s magnificent @FLOTUS for tonight’s exquisite evening where we celebrated mo… RT @WhiteHouse: Tonight, the Rose Garden will be filled with American varieties of yellow and white roses, place settings will feature hist… RT @realDonaldTrump: 🇺🇸🇦🇺 https://t.co/LsGz56Zc1s Welcome to the @WhiteHouse PM Morrison and Mrs. Morrison! 🇺🇸🇦🇺 https://t.co/kYznIkJf9H After three years of renovations, the Washington Monument is open! Thank you to all who supported the project. We need to preserve all of our national treasures for generations to come. https://t.co/9pHHPCO8gk RT @WhiteHouse: The White House is getting ready to welcome Australia for President @realDonaldTrump and @FLOTUS' second State Visit, happe… It is wonderful to see the Washington Monument shine again. Thank you to the @NatlParkService for the care you give our many national treasures. https://t.co/6WkuxkBxh8 It is wonderful to work alongside @WhiteHouseHstry to restore our national treasure, the People’s House @whitehouse. I look forward to announcing more exciting work in the months to come! https://t.co/nz7Qafc3uk Proud to recognize Mariano Rivera at the @WhiteHouse today to receive the Medal of Freedom.  We celebrate his incredible career in baseball and ability to bring people together not only through love of the game, but also his philanthropic efforts. https://t.co/Zo3r0bgw36 Beautiful Saturday on the South Lawn of the @WhiteHouse. Members of the military are rehearsing for Friday’s State Visit with Australia. Thank you to all who serve our great nation! https://t.co/ZNpTFk72If Looking forward to helping reopen one of our many historic treasures, the Washington Monument, here in the nation’s capital next week! https://t.co/g03YitzMF3 Data shows a high usage of flavored e-cigarettes among our youth. It's our responsibility as parents to understand the dangers that come from vaping. Our Administration supports the removal of flavored e-cigarettes from stores until they're approved by @US_FDA. #BeBest https://t.co/02O5waTgIj RT @FDACommissioner: We appreciate @POTUS, @FLOTUS &amp; @SecAzar’s ongoing support of our efforts to prevent youth use of e-cigs, including th… We grieve for our lost loved ones and cherish their memories. Our nation is strong and united by the shared goal of protecting the American people.  May God Bless our men and women in uniform.  We will #NeverForget #September11 https://t.co/9XheGiVSxT RT @dougmillsnyt: .\n@realDonaldTrump &amp; @FLOTUS participate in a moment of silence at the September 11th Pentagon Observance Ceremony at the… We will #NeverForget #September11 https://t.co/UjjhV07Li4 https://t.co/Rcblh8MpZc The Kennedy Center’s new addition The REACH is an investment in the future of the arts and humanities for our next generation. I look forward to the incredible work that will come from this living theater. @kencen \n#KenCenREACH https://t.co/wXEeNGt6gH RT @GMA: First Lady Melania Trump sounds alarm about vaping dangers. @TomLlamasABC has more. https://t.co/YSuvNYpqCS I am deeply concerned about the growing epidemic of e-cigarette use in our children. We need to do all we can to protect the public from tobacco-related disease and death, and prevent e-cigarettes from becoming an on-ramp to nicotine addiction for a generation of youth. @HHSGov Honored to join the Kennedy Center @Kencen last night in celebration of the grand opening of the REACH. This is an amazing investment in the arts and our next generation. #KenCenREACH https://t.co/mj0RhvslAj Our Administration continues to fight the opioid epidemic. Today we announced $1.8 billion in funding through @HHS to continue helping local communities in all 50 states combat this crisis. @ONDCP #BeBest https://t.co/4SzlH8YECu As students across the country head back to classes, I want to wish everyone a successful school year! #BeBest https://t.co/7wjJgmY6Qo RT @fema: Prepare today and stay informed as #Dorian approaches. \n\n✅ Follow @Readygov for information on how to prepare and visit https://t… Hurricane Dorian continues to strengthen – Make sure you are listening to your local officials &amp; have an emergency plan for your family to evacuate safely.  Checkout @fema for more safety tips https://t.co/rzS5OjtydI #G7 in Biarritz was a great opportunity to spend time w/ other spouses during this important summit. Thank you Brigitte Macron for hosting a very engaging program that included visits to charming towns &amp; engaging with some of France’s youth. https://t.co/QX9utdYqtH A great way to end our visit w/ youth surfers and biodiversity workshop members at the beautiful shore in Biarritz 🇫🇷Thank you Brigitte Macron for hosting an engaging program for us. #G7 https://t.co/TwsfsJtjU2 Enjoyed a beautiful afternoon site seeing traditional Basque Culture in Espelette, near Biarritz 🇫🇷 #G7 https://t.co/4mSZJwPOYW Thank you President Macron and Mrs Macron for a beautiful welcome to Biarritz 🇫🇷 #G7Summit https://t.co/Nqq8JnHATj I met many incredible people in Dayton, Ohio &amp; El Paso, Texas yesterday. Their communities are strong and unbreakable. @potus and I stand with you! https://t.co/SHzV6zcVKR RT @realDonaldTrump: Incredible afternoon in El Paso, Texas. We love you, and are with you, all the way! https://t.co/pTNhHapx86 RT @realDonaldTrump: We love you Dayton, Ohio! https://t.co/IaCZAdyuzL Today we are reminded of the tremendous sacrifices made by members of our Armed Forces. To all our Purple Heart recipients, on behalf of a grateful nation, we thank you for your service. #PurpleHeartDay https://t.co/2nu0OaLD3E A lovely evening at the Kennedy Center tonight! Thank you to @kencen for your influential role in preserving the arts &amp; for the @VSAIntl program that provides important &amp; life-changing opportunities for so many.  #BeBest https://t.co/5TNyB2dgHf #Christmas planning has begun in the East Wing at the @WhiteHouse. I'm looking forward to sharing our final vision for this unique tradition in the coming months. https://t.co/oxt6Bdggcl Delighted to host PM and Mrs. Morrison of Australia for a State Visit at the @WhiteHouse     https://t.co/pLAW6QXHQ8 Great to have Prime Minister @ImranKhanPTI of Pakistan at the @WhiteHouse today! https://t.co/W4ChxxfwQp We remember the extraordinary life &amp; honorable work of Justice John Paul Stevens as @POTUS &amp; I paid our respects inside the Great Hall of the @USSupremeCourt this morning.  Our continued prayers &amp; sympathies are with the Stevens family. https://t.co/jBEgTR94YQ RT @realDonaldTrump: https://t.co/aG45A3Ugnp An incredible achievement in our history. We celebrate the 50th anniversary of the #Apollo11 Moon landing. Honored to have @therealbuzz @astromcollins &amp; family of Neil Armstrong join us today.  America is built by those who make the impossible possible. @NASA https://t.co/hrFh4K4VUf A beautiful piece of history returned home today. Thank you PM Rutte for presenting an American flag that flew aboard a US Navy Ship on D-Day.  The historic flag will be on display at the @smithsonian. A reminder of the service &amp; sacrifice of so many Americans. @amhistorymuseum https://t.co/uzwrU20Okj RT @realDonaldTrump: Today, @FLOTUS Melania and I were honored to welcome members of Team USA to the @WhiteHouse for a great celebration of… Today, we welcomed members of Team USA to the @WhiteHouse, commemorating their incredible accomplishments at the 2019 Special Olympics World Games.  @specialolyUSA @specialolympics  @WorldGamesAD https://t.co/tPcg9a614D Finding resources &amp; programs to help families affected by opioid abuse is a bipartisan issue needing support at all levels of gov’t. I'll continue to help communities combat this crisis. #BeBest @DHSMcAleenan @WVGovernor @HuntingtonMayor @SenCapito @Sen_JoeManchin @RepCarolMiller https://t.co/ilpYWa0Iat #BeBest https://t.co/ZwUHEhmtZv Through #BeBest I will continue to promote programs and highlight resources available to all those who are seeking help with this national opioid epidemic. https://t.co/erLafDLXBn Thank you Huntington, WV for welcoming me today &amp; sharing your incredible stories. Your community has made great progress in combatting the opioid epidemic. \n@lilysplacewv @blazinwv https://t.co/XynTcpO4Bj RT @SenCapito: Honored to have @FLOTUS join us in Huntington today. Her heart for children affected by the opioid crisis is so clear, and h… RT @Sen_JoeManchin: It’s an honor to have @FLOTUS in West Virginia today to join our roundtable discussion with local, state and federal le… There is great work being done in Huntington, WV. Thank you to all who attended &amp; shared the incredible strides this community has made in combatting the opioid epidemic.\n@DHSMcAleenan, @sen_joemanchin, @WVGovernor, @senCapito, @repcarolmiller, @Huntingtonmayor  #BeBest https://t.co/nB0S1SBc7A RT @StephGrisham45: HAPPENING NOW: @flotus is wheels up &amp; on her way to West Virginia to participate in mtgs w state &amp; local leaders and le… Congratulations to 2019 Women’s World Cup Champions @TeamUSA! ⚽️🇺🇸 A beautiful tribute to our Nation &amp; the American spirit tonight. We honor &amp; celebrate our cherished history &amp; all those who served &amp; sacrificed so much for the freedoms we have today. God Bless our great military &amp; God Bless the United States.  #IndependenceDay https://t.co/c2tcFO7wz4 RT @realDonaldTrump: #SaluteToAmerica🇺🇸#July4th \nhttps://t.co/CMxvvow5um Happy 4th of July 🇺🇸 https://t.co/sIyVMiBjPN I am pleased to announce @StephGrisham45 will be the next @PressSec &amp; Comms Director! She has been with us since 2015 - @potus &amp; I can think of no better person to serve the Administration &amp; our country. Excited to have Stephanie working for both sides of the @WhiteHouse. #BeBest Looking forward to collaborating with all of our #BeBest Ambassadors. Delighted to be working alongside so many people both inside and outside of government to better the lives of children everywhere!\nhttps://t.co/VXxwgg6DFz A memorable night on the South Lawn at the @WhiteHouse this evening. Thank you to the members of Congress &amp; their families who joined us for our traditional Congressional picnic celebrating the start of summer!  #SummerSolstice2019 https://t.co/ZPtr1TfwFE This afternoon @POTUS &amp; I were briefed by @NOAA &amp; @fema regarding the preparations the Administration is taking for the 2019 hurricane season. To be safe in any time of crisis listen to your local authorities and find shelter. https://t.co/l973SDafYF Last night’s rally was so full of energy! @potus and I will fight for this incredible country as long as we can. Thank you Orlando! 🇺🇸 https://t.co/ZzjWDX3Uck RT @realDonaldTrump: THANK YOU ORLANDO, FLORIDA!https://t.co/Va9FhByJi0 RT @WhiteHouse: \"On this day, we thank all amazing fathers for their unending dedication and leadership.\" https://t.co/lk8RH9FGjl This Administration remains committed to the fight against the opioid epidemic. Thank you to all who participated in this week’s briefing @WhiteHouse #BeBest @ONDCP, @HHS_ASH, @SecWilkie,  @DHSMcAleenan @SecretaryAcosta, @USPISpressroom, @Kellyannepolls @DEAHQ https://t.co/pnMLYooTd2 Yesterday we honored the incredible friendship between the United States and Poland, and celebrated our proud Polish-American community at the @WhiteHouse. https://t.co/Ym7a522ms8 Great to welcome back President Duda &amp; Mrs. Kornhauser-Duda of Poland at the @WhiteHouse today! https://t.co/A3UxqNUqzn We must never forget the lives lost and heroic actions made by so many on D-Day in Normandy, France. https://t.co/Uhl3VUPleq RT @WhiteHouse: Opioid addiction can happen to anyone—and we must work together to fight the stigma and save lives, says @Surgeon_General J… Thank you U.K. 🇬🇧 https://t.co/BJFRKU4O75 We paid tribute to our fallen heroes at Portsmouth for the D-Day commemoration ceremony. Was lovely to meet our brave veterans, as well as some of the women &amp; men who serve in the Armed Forces. https://t.co/kFgtfXlExI Thank you Ambassador Johnson @USAmbUK &amp; Mrs. Johnson for hosting the Prince of Wales &amp; the Duchess of Cornwall, @POTUS and I at Winfield House. \nBeautiful evening to celebrate friendship between U.K. 🇬🇧 and USA 🇺🇸 https://t.co/57DhRmP7IZ Was a wonderful day at @10DowningStreet with PM @Theresa_May &amp; Mr. May. Great meeting children and employees from the US Embassy! https://t.co/QFnc87hwiw A memorable day in London! Thank you to Her Majesty The Queen &amp; @RoyalFamily for welcoming us in our official State Visit. A beautiful visit to Westminster Abbey &amp; Grave of the Unknown Warrior to pay tribute to all who have given their lives in protection of their country. https://t.co/Px2QjkNoxm On the 75th Anniv. of D-Day, the world remembers the strength &amp; bravery of our allied forces. Honored to be at Omaha Beach &amp; Normandy American Cemetery. God Bless the vets. &amp; fallen soldiers, they are true heroes. #DDay75thAnniversary #DDay75 https://t.co/B0Vl2sBtLF RT @realDonaldTrump: Thank you! 🇺🇸🇬🇧 https://t.co/hm6RXLeWpp RT @ABCPolitics: JUST IN: Pres. Trump and first lady Melania Trump arrive in the U.K. for three-day state visit. https://t.co/zdgr51rlf8 ht… A lovely evening at Ford’s Theatre honoring this year’s Lincoln Medal recipients &amp; the great work they’ve done. Thank you to @FordsTheatre for hosting the gala &amp; the opportunity to come together in celebration of the arts &amp; the legacy of former President Lincoln. https://t.co/wna5EJK7TW RT @RoyalFamily: #US #UK flags adorn The Mall ahead of @POTUS and @FLOTUS’s State Visit to the United Kingdom which starts tomorrow. \n\nFoll… Thank you to the families who joined us at @WhiteHouse in honor of our Nation’s fallen heroes. To Gold Star families everywhere, we remain indebted to the selfless sacrifices made by these heroes. Thank you to all those who have served or are serving in our Armed Forces! https://t.co/cw2dUo7HYW A wonderful visit to Japan &amp; a great opportunity to reaffirm the strong friendship between our countries.  Thank you to PM @AbeShinzo &amp; Mrs. Abe, Emperor Naruhito &amp; Empress Masako, for sharing more of Japan’s culture with us! https://t.co/P80QGBuSyG Great visit to @teamLab_net exhibits at Mori Bldg Digital Art Museum in Tokyo. Congratulations to Kazumasa Nonaka, TeamLab Artist &amp; Project Manager, and Mr. Michiho Kishi, Museum Designer &amp; Tour Guide on incredible work! https://t.co/zqV1R4qM46 Thank you Emperor Naruhito and Empress Masako for hosting us in the Imperial Palace. We enjoyed meeting so many wonderful people! https://t.co/Nt3E5sxYox RT @thehill: \"Thank you for your service and sacrifice and all that you do on behalf of our country.\"\n\n@FLOTUS Melania Trump delivers #Memo… Thank you Mrs. Abe for a wonderful afternoon at Akasaka Palace. https://t.co/kzUm26Uoc1 RT @ABCPolitics: First lady Melania Trump and Japanese first lady Akie Abe enjoy a nature-oriented cultural experience during the Trumps' f… RT @ABCPolitics: Pres. Trump becomes the first world leader to meet the new emperor of Japan as the president and first lady Melania Trump… Another productive day in Japan.  @POTUS &amp; I were honored to meet the new Emperor &amp; Empress at the Imperial Palace today. https://t.co/BS2enAFE9j We honor our Nation’s fallen heroes today. Our prayers remain with all those deployed overseas and to the families supporting their loved ones from home.  #MemorialDay A great day exploring Tokyo with Mrs. Abe! Thank you to @teamLab_net exhibits at Mori Bldg Digital Art Museum for a wonderful interactive experience. https://t.co/Kv7cLuJeG7 RT @AbeShinzo: President Trump and the First Lady are staying in Japan as the first State Guests of the new era “Reiwa”! TOKYO SKYTREE welc… Honored to be at @ArlingtonNatl today &amp; take part in #FlagsIn to remember our fallen heroes. God Bless our military, their families &amp; God Bless our great Nation! @USArmyOldGuard https://t.co/lJ3lu2KfJG Wonderful to be back at @WRBethesda today.  It was an honor to present the Purple Heart &amp; meet some of our wounded warriors. Prayers for a swift recovery &amp; thank you to the incredible leadership &amp; staff at Walter Reed.  God bless all our men &amp; women who serve! https://t.co/MEug3G1720 It was a wonderful evening celebrating @WhiteHouseHstry and our great partnership in preserving history. Thank you to the leadership of WHHA &amp; its supporters for joining us at the @WhiteHouse. https://t.co/kS03kBUi4o The @WhiteHouse is lit blue tonight in remembrance and honor of our fallen law enforcement officers. Thank you to all the men and women in law enforcement who work hard to keep us safe.  #NationalPoliceWeek https://t.co/5moPlmsEDt Honored to take part in the 107th First Lady’s Luncheon today hosted by the Congressional Club. A wonderful opportunity to come together w/ spouses for a bipartisan event. Thank you for all you do &amp; the generous donations you give that support &amp; care for our communities. #BeBest https://t.co/zxip7q7XoJ RT @WhiteHouse: \"Today, and every day, let us ensure that our mothers know and feel our deep gratitude for the gift of life and for their u… Happy Mother’s Day! https://t.co/J8KDCCYNVK #BeBest Anniversary was a day to remember!  Thank you to all our guests who came to share in the #BeBest message – there is so much good work happening in our country &amp; around the globe. I look forward to future opportunities to work together! https://t.co/U8AvtJOQid A wonderful tribute to our military mothers &amp; spouses at the @WhiteHouse today. Thank you to all who came to celebrate &amp; to the United States Army Chorus for an amazing performance! #MilitarySpouseAppreciationDay https://t.co/pg11C0h6vF A productive meeting today with Microsoft’s President @BradSmi.\n#BeBest will continue the discussion about online safety for our children! @MSFTIssues @Microsoft https://t.co/78IOaZ9UXT Thank you @rogue_robotics for changing the life of Rocco and his family @tgwrh. This is what it truly means to be #BEBEST\nIt was wonderful to have all of you at the @WhiteHouse yesterday. https://t.co/JIynuiDW1B RT @GOPChairwoman: The #BeBest initiative is giving children the tools and skills they need for emotional, social, and physical health.\n\nTh… Melania Trump honors Farmington robotics team at the White House https://t.co/oRszaBlTjh RT @WhiteHouse: \"First Lady, you've raised awareness about a deadly killer. You've helped lift the stigma, which will save countless lives… RT @WhiteHouse: \"Microsoft has been committed to the principles advanced through Be Best, protecting children, teens, and individuals onlin… RT @WhiteHouse: \"To help every child be their best, we need to cultivate their physical, emotional, and spiritual well-being.\" \n— Dr. Franc… RT @WhiteHouse: On the one year anniversary of @FLOTUS' initiative, Be Best, take a look back at some of the highlights! #BeBest https://t.… .@POTUS and I welcomed many influencers of faith in observance and celebration of the #NationalDayofPrayer to the @WhiteHouse today. God Bless this great nation where we cherish the freedom of religion. https://t.co/ZvLuVDuoZ0 It was an honor to host so many wonderful faith leaders who joined us for dinner at the @WhiteHouse in celebration of tomorrow’s National Day of Prayer. https://t.co/xGhGQEyzWk Wonderful to host children of our @SecretService agents today in the newly renovated bowling alley in the residence of the @WhiteHouse!  My family appreciates all that Secret Service does to keep us safe.  Thank you!  #BeBest https://t.co/JSmxU9VFK7 It was wonderful to visit the Washington Monument and US National Arboretum with Mrs. Abe on Saturday! Cc: @Natlparkservice @USDA_ARS @WhiteHouse https://t.co/cA90ZQ4hPj Enjoyed showing Mrs. Abe the Washington Monument, US National Arboretum &amp; of course the @WhiteHouse today. Thank you to @Natlparkservice, @USDA_ARS &amp; @WhiteHouse for taking care of these precious landmarks. https://t.co/NuSi4d4cuT On this last day of Passover, I was heartbroken to hear of another senseless shooting in a place of worship. My heart &amp; prayers go out to all affected in the community. RT @WhiteHouse: It's @DEAHQ National Take Back Day!\n\nAs you safeguard your household from unneeded prescription drugs, read @ONDCP Director… It was wonderful to host and celebrate my birthday with Prime Minister Abe @AbeShinzo and Mrs. Abe last night at @WhiteHouse https://t.co/5sBtnR6VGD #TakeBackDay is a reminder to dispose of your unused prescription drugs responsibly! Find your nearest collection center at https://t.co/Fi8vz9bLxh #BeBest @DEAHQ Thank you to everyone for the beautiful birthday wishes! Tomorrow is #TakeBackDay.  An opportunity to safely dispose of unused prescription drugs.  Help keep our communities safe! @DEAHQ #BeBest Fun day at the @WhiteHouse yesterday! #TakeOurDaughtersandSonstoWorkDay #BeBest https://t.co/1fZveZNCBF Thank you to all the kids who visited the @WhiteHouse to participate in Take our Daughters and Sons to Work Day.  I enjoyed helping children write letters to the military &amp; learning about photography! #BeBest https://t.co/cHojXK4i0n RT @WhiteHouse: Under President @realDonaldTrump, @DEAHQ National Take Back Days have shattered records. The next #TakeBackDay is Saturday,… RT @WhiteHouse: President @realDonaldTrump and @FLOTUS traveled to Atlanta, Georgia, yesterday for the Rx Drug Abuse and Heroin Summit, con… RT @WhiteHouse: The death toll from \"the crisis next door\" is nothing short of a national tragedy, leaving countless American families and… Productive day in Atlanta, GA as @potus &amp; I gave remarks at the 2019 Rx Drug Abuse &amp; Heroin Summit @RxSummit. This Administration will not stop until this opioids crisis is over. @SecAzar @HHSGov @ONDCP @KellyannePolls @WhiteHouse #BeBest https://t.co/KDCNt3Dyob We had a wonderful time at yesterday’s #EasterEggRoll2019 @WhiteHouse. Thank you to all who came out! #BeBest https://t.co/G1OIYfnRLA Thank you for the beautiful commemorative Egg @IncredibleEggs! #BeBest https://t.co/Jyje6g8irH Another wonderful Easter Egg roll!  @POTUS and I enjoyed meeting everyone!  Thank you to the many volunteers and vendors who worked so hard to help keep this @WhiteHouse tradition alive!! #EasterEggRoll2019 https://t.co/O5ULBuNapp RT @WhiteHouse: The 2019 Easter Egg Roll is almost here! \n\nPresident @realDonaldTrump and @FLOTUS will welcome guests to the White House fo… Wishing everyone a blessed #Easter! Many blessings to all around the world celebrating #GoodFriday Great visit yesterday to @FtBraggNC with @SecondLady and @SecArmy. The United States Military is a national treasure and I am so grateful to all the hard working men, women and families who serve our great nation. Thank you! https://t.co/kDHSdbGkdJ RT @WhiteHouse: On April 24, President @realDonaldTrump and @FLOTUS will speak at the Rx Drug Abuse &amp; Heroin Summit in Atlanta, Georgia, ab… I am always so impressed by the capabilities of our Armed Forces. Thank you to @FtBraggNC for yesterday’s wonderful visit. God Bless all of our men &amp; women who are forward deployed &amp; the families &amp; military children who sacrifice on behalf of our nation. 🇺🇸 https://t.co/ZgWXJ2vzmA @SecondLady and I had a wonderful visit to Albritton Middle School @FtBraggNC today. Thank you for your kind welcome! #BeBest https://t.co/zyTufjRI0O My heart breaks for the people of Paris after seeing the fire at Notre Dame Cathedral. Praying for everyone’s safety. RT @WhiteHouse: Tomorrow, @FLOTUS and @SecondLady will travel to Fort Bragg in North Carolina to visit with our great U.S. service members… Looking forward to traveling to @FTBraggNC with the @SecondLady tomorrow so we can thank all service men, women &amp; families for their bravery, sacrifices and all they do to keep us safe. #MonthoftheMilitaryChild  https://t.co/nUwCxk3Dxc So grateful to all the @WhiteHouse volunteers who give their time &amp; talent helping in so many ways.  Thank you for all you do! #VolunteerWeek https://t.co/mi53Cd7KvX RT @WhiteHouse: The White House gardens are in full bloom for this weekend's garden tours! \n\nStop by and discover the beauty of the South G… RT @WhiteHouse: President Trump and First Lady Melania Trump met with President Moon Jae-in and Mrs. Kim Jung-sook of the Republic of Korea… A great visit with President Moon Jae-in and First Lady Kim Jung-sook of the Republic of Korea at the @WhiteHouse today. https://t.co/GdR9iMf4iv Thank you to the Senate spouses for hosting the annual Senate Spouses luncheon.  It was a wonderful opportunity for many of us to come together &amp; enjoy an afternoon in the beautiful and historic Library of Congress @librarycongress  #BeBest https://t.co/adNLhVivo1 April is #MonthoftheMilitaryChild.  We honor and thank our military families for the support they give and the sacrifices they make for our great country. The @WhiteHouse is lit blue tonight in support of #WorldAutismDay https://t.co/uMKKSIS3nz RT @realDonaldTrump: Today, we celebrate the tremendous accomplishments of Americans with ASD and reaffirm our commitment to work together… Wonderful visit to West Gate Elementary School in Florida last week! When schools partner excellent academics with character education, they have a real opportunity to cultivate the whole child. #BeBest https://t.co/33qADvdTlo RT @WhiteHouse: First Lady Melania Trump continues her \"Be Best\" mission! @FLOTUS recently visited West Gate Elementary School in Palm Beac… Spring has arrived!  Come enjoy the 2019 @WhiteHouse Garden Tours happening April 13 – 14.  Tickets are available through the @NatlParkService.  You can learn more about the tours here: https://t.co/Saaq7Ok9in RT @WhiteHouse: Maybe you've heard the statistics, but they seemed hard to believe.\n\nMaybe you've witnessed the tragedy of opioid addiction… RT @USNavy: On this #VietnamWarVeteransDay, we want to honor and thank all those who served and sacrificed for their country. \nLearn more a… An inspiring meeting with @FabiiRosales as she shared her passionate ideas and plans to restore democracy and to care for the children of Venezuela.  We stand with you &amp; Pres @Jguaido. https://t.co/4Oj5bHCqHk Thank you West Gate Elementary School for letting me join you in your morning classroom discussions. Education should include not only academics, but also a firm foundation for understanding our own feelings &amp; those of our peers.  #BeBest https://t.co/ccZKcHGNsz We are humbly reminded of the invaluable cost of freedom. Staff Sergeant Travis Atkins, United States Army, receives the #MedalofHonor posthumously today through his family. We honor SSgt Atkins. His last actions were made to save the lives of his teammates. God Bless our troops. .@Nicklaus4Kids continues to do wonderful work on behalf of children - helping them heal physically, mentally &amp; spiritually. Thank you for your amazing work. https://t.co/1lkEa3HLzP .@WhiteHouse &amp; @ONDCP continue taking steps to prevent drug use in schools.  Today a school resource guide was released for teachers, administrators &amp; parents to better educate &amp; protect children.  View  guide here: https://t.co/d8rkhsz3Ex\n#BeBest Enjoyed hosting the leaders &amp; their delegations from the Bahamas, Dominican Republic, Haiti, Jamaica, and Saint Lucia with @POTUS at Mar-a-Lago today. https://t.co/JgWFWe5wJk .@POTUS and I look forward to welcoming the leaders of Commonwealth of The Bahamas, the Dominican Republic, the Republic of Haiti, Jamaica, and Saint Lucia to Mar-a-Lago  tomorrow afternoon! Enjoyed hosting such an informative meeting Monday at the @WhiteHouse w the Interagency Working Group on Youth Programs.  I continue to be impressed with the programs within each agency and look forward to working together on behalf of children everywhere.  #BeBest https://t.co/0y2ADnDhma Happy Birthday BWT ❤️❤️❤️ https://t.co/uN8hECMk2P Excellent briefing by @DHSgov @HUDgov @HHSGov @DEAHQ  @DeptVetAffairs in the Oval Office with @POTUS. My office will be highlighting several Administration successes in combatting the Opioid Epidemic in the coming weeks. #BeBest https://t.co/db5Eq0Rkoy A productive &amp; successful morning at the @WhiteHouse. Thank you to all who take part in the Interagency Working Group on Youth Programs. I'm looking forward to our continued work together! #BeBest\n@HHSGov @USAID @StateDept @NEAarts @ONDCP @FEMA \n@DHSgov @HUDgov @usEDgov https://t.co/IIhMrXe70V Happy St. Patrick’s Day! 🍀 https://t.co/GF0Bxk7E9R The @WhiteHouse Easter Egg Roll is coming up! Learn more about this family fun tradition &amp; see the beautiful 2019 @WhiteHouse Easter Egg Collection: https://t.co/nGUOLTQRa8 https://t.co/Yf9zMME9uY Yesterday Prime Minister Leo Varadkar @campaignforleo visited the @WhiteHouse to honor #StPatricksDay. Thank you for joining us in celebrating the many wonderful traditions of Ireland! https://t.co/2guft4oJwM My deepest condolences to the families who lost loved ones in the horrific shooting in Christchurch, New Zealand. We pray &amp; grieve with you and stand against all of the hatred. While you may never personally become addicted, the chances of knowing someone who struggles with it are high. If you, or someone you know needs help, please be brave enough to ask, or strong enough to stand with them as they fight through the disease. https://t.co/gWTyC0SQXG Great visit to @Microsoft in Washington State last week! #BeBest https://t.co/pdObkVHIL3 Thank you Tulsa, Oklahoma #BeBest https://t.co/b6VHgpU3QK RT @TIME: \"Courage takes sacrifice, bravery and humility.\" First Lady Melania Trump honors women from around the world https://t.co/4XBaR4m… Keeping the people of Alabama in our thoughts &amp; prayers. We are with you. 🇺🇸❤️ https://t.co/9elFure9m1 On our way to visit the great people of Alabama! 🇺🇸 https://t.co/lBklOgCUx1 Happy #InternationalWomensDay2019 https://t.co/MtecsanuEo It was wonderful to welcome the Prime Minister &amp; his wife Monika Babišová of the Czech Republic to the @WhiteHouse today. I enjoyed speaking with Mrs. Babišová about the many important issues children are facing around the world today. #BeBest https://t.co/4QZsF7Wb32 Honored to celebrate a group of extraordinary women today at the @StateDept’s #WomenofCourage ceremony.  These women are making a real impact around the globe! https://t.co/nIC5XMFfZu Proud of the work that is being done all across our nation to fight the opioid crisis.  Thank you to @EricBolling for inviting me to talk about this important issue.  #BeBest will continue to promote programs that help address this crisis. https://t.co/e7oKBqBj3m Thank you #Microsoft @MSFTIssues for showing us your innovative tools &amp; platforms to help children. What an informative visit!  #BeBest @Microsoft https://t.co/Lo0QCHgGzd RT @StateDept: On March 7, @SecPompeo and @Flotus will honor a group of extraordinary women at the 2019 International Women of Courage Cere… Thank you to the teachers, leadership &amp; students of DOVE School of Discovery in Tulsa for welcoming me today. There is great work being done! It is so important that education includes not only academics, but the importance of a strong sense of character &amp; values. #BeBest https://t.co/sRRMMASrlx RT @CNNnewsroom: First lady Melania Trump is going on a tour for her “Be Best” initiative.\n\n“She is focused on helping children,” her commu… #WomensHistoryMonth is an opportunity for our country to celebrate our history and challenge women everywhere to continue being strong, resilient leaders in all that they do. Looking forward to visiting OK, WA and NV next week. Through #BeBest I will continue to help promote successful programs that provide children the tools and skills required for emotional, social and physical well-being. Beautiful to hear what @k_satyarthi and @rachelroy are doing to save children and give them a voice. Wishing you continued success! https://t.co/hkHp15ompC Enjoyed spending time with so many wonderful men &amp; women at The National Governors Association spouses’ luncheon at Untied State Navy Memorial yesterday. I look forward to working together to make our country stronger, safer &amp; healthier for our children.  #BeBest Thank you to the members of the @NatlGovsAssoc and their spouses for joining @POTUS and I for an evening of community and bipartisanship at the @WhiteHouse. https://t.co/sCuQt6ueVZ Wonderful evening at @WhiteHouse celebrating #AfricanAmericanHistoryMonth! https://t.co/ZBJop8kxTY Met strong and brave young patients @Nicklaus4kids on Monday. Wishing them a speedy recovery and joyful life! Thank you @jacknicklaus and Barbara, doctors, nurses, and caregivers for saving lives. https://t.co/sXszQSOg1N Today the world lost a creative genius. We will miss you Karl! #RIPKarlLagerfeld https://t.co/8MMcWqDphE RT @ABCWorldNews: NEW: President Trump and first lady Melania Trump deliver remarks to the Venezuelan American community in Miami, Florida… A beautiful ceremony at @Nicklaus4kids hospital today to celebrate their new changes! I hope the garden nurtures &amp; heals all the young patients who visit. Thank you to the generous donors &amp; to @Nicklaus4kids for all the important work you are doing. #BeBest https://t.co/qrxXgOGWkR Melania Trump, Miami-Dade mayor visit Nicklaus Children's Hospital https://t.co/W9WI7tHvqP RT @ABC: NEW: First lady Melania Trump unveils “Morton and Linda Bouchard Healing Garden” at Nicklaus Children’s Hospital in Miami, Florida… Loved sharing an afternoon with such sweet valentines! Your bravery, strength, and love is amazing. Thank you to the @TheChildrensInn and @NIH for the lifesaving work you are doing! #HappyValentinesDay https://t.co/VRrZwjWG5r Thank you to the First Lady of Colombia for a productive visit at the @WhiteHouse today. The opioid crisis is a global issue that we must continue to raise awareness on. Our children deserve a safer &amp; healthier world.  #BeBest https://t.co/lXUv59OHCS RT @WhiteHouse: Yesterday, @FLOTUS spoke to 500+ young leaders at the Community Anti-Drug Coalitions of America Leadership Forum, then visi… Melania Trump, Youth, Administration Combatting Opioid Crisis https://t.co/SWJaPGk0ws An informative visit  to @ONDCP this afternoon. @ONDCP currently supports over 700 Drug-Free Community Coalitions – these are vital in protecting our youth. Our administration will continue to work hard to provide healthy &amp; safe places for our children.  #BeBest https://t.co/eB4J5sS7s0 Thank you to @CADCA youth leaders for welcoming me to the 29th #CADCAForum.  Your energy is motivating &amp; you are truly making a difference within your communities!  #BeBest https://t.co/EGbeNA6m6C It was an honor to be joined by our inspiring guests at this year’s #SOTU.  Each of them has a remarkable story to tell.  Thank you to everyone who shared the evening with us! https://t.co/8mm8svcn2i .@POTUS and I are honored to welcome our inspiring guests to join us at #SOTU.  Each of them have a story - however painful, joyful, or hopeful - these stories bring all Americans together. RT @realDonaldTrump: Melania and I send our greetings to those celebrating the Lunar New Year. Today, people across the United States and a… RT @WhiteHouse: First look: the special guests joining First Lady Melania Trump at President @realDonaldTrump's second State of the Union A… February is #BlackHistoryMonth. Let us come together in celebration of our diversity to remember our past and look towards our future. On International #HolocaustRemembrance Day, let us pay tribute to those who were lost and reflect on the tragedy of the Holocaust during World War 2. https://t.co/KXDX0jK2mg RT @StephGrisham45: .@FLOTUS often refers to opportunists out to advance themselves by disparaging her name&amp;image. Mrs.Trump will not let p… Our work in the East wing continues into 2019 with online safety, fighting opioid abuse &amp; supporting the well-being of children everywhere! #BeBest https://t.co/4TayvDP0y4 Today we honor the life and legacy of #MartinLutherKingJr #MLKDay It has been an unforgettable two years in the @WhiteHouse. I am honored to serve this great nation! 🇺🇸 https://t.co/C05gMotmX2 ❄️❄️❄️ @WhiteHouse https://t.co/VxGFzETv95 #HappNewYear2019 ✨ https://t.co/zvR9YqjNB3 RT @usairforce: #ICYMI: @POTUS &amp; @FLOTUS visited #RamsteinAB #Airmen, Dec, 27, 2018. The president stopped in @RamsteinAirBase on his way b… Melania Trump's trip to Iraq marked first war zone visit by a first lady in over a decade https://t.co/bwY0H3JqSx Loved meeting with members of our military at @RamsteinAirBase in Germany. Keep up the great work and thank you for all that you are doing! Your country is proud of you. 🇺🇸 https://t.co/fyfC9j4Mup The men and women who serve in our nation’s military give up so much so that we can be free. @potus and I were honored to surprise deployed troops at Al Asad Air Base in Iraq. 🇺🇸 https://t.co/isLZT5S7YV RT @realDonaldTrump: .@FLOTUS Melania and I were honored to visit our incredible troops at Al Asad Air Base in Iraq. GOD BLESS THE U.S.A.!… Wishing you all a day filled with peace, love and joy. Merry Christmas from @WhiteHouse https://t.co/2lbNhFm2Po RT @WhiteHouse: Merry Christmas from President @realDonaldTrump and @FLOTUS! https://t.co/DDITJDxDaI Helping children across the country track #Santa is becoming one of my favorite traditions!  @Potus and I enjoyed working with @NORADSanta - #ChristmasEve https://t.co/CYNkARbFaI December at the @WhiteHouse! #MerryChristmas https://t.co/ikTuuc5xEP Merry Christmas from President Donald J. Trump and First Lady Melania Trump. @POTUS &amp; @FLOTUS are seen Saturday, December 15, in their official 2018 Christmas portrait, in the Cross Hall of the White House in Washington, D.C. (Official White House Photo by Andrea Hanks) https://t.co/nIuplZSDBe It is an honor to be #FLOTUS to this incredible country &amp; thank you to @DepSecDef for joining me on all of the day’s visits! https://t.co/qg2KlWSxla RT @StephGrisham45: .@flotus will continue to demonstrate her commitment to helping kids &amp; advancing the causes she cares about. But there… Thank you to the @USMC for another successful @ToysForTots_USA drive!  What a wonderful way to give back in your community this Christmas season. https://t.co/MLMFDLlCMM #MerryChristmas to all the patients at @Childrenshealth!  Thank you to all the nurses, doctors &amp; medical staffers who work around the clock to take care of people this holiday season. https://t.co/XMWILttFua An incredible day spending time with our men and women in uniform on USS George H.W. Bush. Thank you for your sacrifice &amp; service! #USA https://t.co/WWncNQfiMj Wonderful to be in Hangar 789 with many service members &amp; their families at @JBLEnews! Our prayers remain with all those serving overseas this Christmas. God Bless you all! #USA https://t.co/MkCeZlB23k An incredible flight today on a V-22 to visit the service members aboard the USS George HW Bush. Thank you to ALL who serve! 🇺🇸 https://t.co/ylRIl37qwa We are off to visit some of our brave men &amp; women in uniform today &amp; thank them for their service.  I’ll be visiting Joint Base Anacostia-Bolling, Joint Base Langley-Eustis &amp; the #USSGeorgeHWBush aircraft carrier today.  Looking forward to meeting everyone!  #USA https://t.co/XrYsFyItJJ Looking forward to spending some time with our brave men and women in uniform today!  I’ll be visiting two military bases &amp; an aircraft carrier to thank our service members.  God Bless all those who serve in our Armed Forces.  #USA Enjoyed spending time with children &amp; the @USMC at their annual @ToysForTots_USA drive.  Thank you to everyone who came out to help in this wonderful opportunity to give back! #MerryChristmas https://t.co/bYEnLS2tOx RT @WhiteHouse: “From the depths of despair, the Jewish people built a mighty and majestic nation, a thriving democracy in the heart of the… RT @realDonaldTrump: Today, we honor those who perished 77 years ago at Pearl Harbor, and we salute every veteran who served in World War I… RT @WhiteHouse: Today, America's 41st President is laid to rest in College Station, Texas.\n\nGeorge H. W. Bush's legacy as a veteran alone w… RT @realDonaldTrump: #Remembering41 https://t.co/9xbFYlZzNs Wishing all who celebrate, a very #HappyHanukkah ! A great opportunity to come together with many spouses for the #G20Argentina. Thank you First Lady @JulianaAwada_ for hosting us! https://t.co/rBDxcbV9OC My heart goes out to the entire Bush family. https://t.co/raZ4SZQo1c \"... I believe education and learning is key to making the right decisions on your own behalf.\" https://t.co/nLIsTjXzoL RT @WhiteHouse: Tonight, President Trump and First Lady Melania Trump lit the National Christmas Tree in President's Park on the Ellipse! h… Thank you @LibertyU! What a great crowd of smart and committed students. Together, I know we can make a real difference in the opioid crisis and save lives! https://t.co/b49GdNgwJS On my way to @LibertyU to participate in a town hall about our country’s opioid epidemic. Sending our love &amp; support to the troops this holiday season. Honored to visit the @RedCross w @SecondLady yesterday to help create comfort kits for military who are currently deployed. Thank you for all you do! https://t.co/Hnvw0awKBu As the holiday season begins, we remember all our brave men and women serving overseas.  Honored to join @SecondLady at the @RedCross this morning to make comfort kits for our troops currently deployed.  Thank you for your service! https://t.co/zlrZBmkLBI The @WhiteHouse is sparkling for the Christmas season! https://t.co/ncNhlkZAWl The People’s House @WhiteHouse is ready to celebrate Christmas and the holiday season! https://t.co/oejKW3mC15 Thank you to all the volunteers from across our great nation who are working hard to decorate the @whitehouse. Can’t wait to view it all tomorrow night! #ChristmasattheWhiteHouse 🌲 https://t.co/rfhR7uGtf6 Wishing you all a very happy Thanksgiving! As we give thanks, let’s keep those who can’t be with their families in our thoughts today. #Thanksgiving We started the holiday season with the turkey pardon at @whitehouse yesterday. \nHave a wonderful Thanksgiving! https://t.co/5SfFJKXLnp RT @LibertyU: Liberty University welcomes @FLOTUS @MelaniaTrump and political commentator and author @EricBolling along with other special… RT @WhiteHouse: President @realDonaldTrump, joined by @FLOTUS, has officially pardoned this year's National Thanksgiving Turkey, Peas—and h… We received the @WhiteHouse Christmas tree yesterday! It will grace the Blue Room throughout the season – hope you will come to the People’s house to see it! https://t.co/nP8J7vJNv9 The @WhiteHouse is getting ready for the Christmas season! Thank you to the Smith Family &amp; the National Christmas Tree Association for providing this year's tree.  And to our @NatlParkService for their hard work in trimming the tree for the Blue Room. https://t.co/jiyYBwCeXO .@POTUS and I honored the lasting legacy and impact of the #MedalofFreedom recipients at today’s ceremony at the @WhiteHouse.  Their dedication, passion and service to this nation will be remembered for many years to come. Enjoyed hearing from some very bright students on how they are taking action around the importance of online safety and responsibility. Thank you @FOSI and all the participants from today for tackling this very important issue.  #BeBest #fosi2018 https://t.co/RcurLQhlTs A great visit to the Marine Barracks to thank some of our @USMC.  Thank you for celebrating an early Thanksgiving with us. @POTUS &amp; I are so thankful to all those who serve! God Bless the United States! https://t.co/mxPZekCsqA On this #WorldKindnessDay I had fun surprising visitors to the @WhiteHouse! Thank you to all who come through and visit this magnificent home.  #BeBest https://t.co/vhwBGk31pv A wonderful afternoon at Versailles yesterday with Mrs. Macron and many other spouses. After honoring the heroic actions taken during WWI, we gathered to reflect on our past &amp; celebrate our future. #VeteransDay #Armistice100 #Paris https://t.co/E65RipHVuw Thank you @EmmanuelMacron and Mrs. Macron for the beautiful celebration that allowed so many countries to commemorate the end of  WWI. #VeteransDay #Armistice100 #Paris https://t.co/9u5Gs3qIuf RT @WhiteHouse: Our veterans represent the very best of America. Today and every day, we thank each one of you for bravely answering the ca… Today we remember the brave actions of our troops and those of our allies during WWI. Honored to be spending this day honoring heroes in Paris. #VeteransDay https://t.co/NQoteCqecH Congratulations Justice Kavanaugh. I know you will continue to serve our country with honor. 🇺🇸 https://t.co/OuAosgrYoc My sincere condolences and prayers go out to all affected by the senseless shooting in Thousand Oaks, California. Vote Red 🇺🇸 MAGA 🇺🇸 https://t.co/i95OiBimxA https://t.co/ncvDcAP8LZ RT @realDonaldTrump: Together, we are Making America Safe and Great Again! https://t.co/0pWiwCHGbh https://t.co/rWl5aSpY3O Have a safe and Happy Halloween!! 🎃👻 https://t.co/IcQHlxONz9 Enjoyed meeting the hardworking medical staff at @UPMC yesterday! Thank you to all doctors, nurses and medical professionals for the incredible work you do every day! #Pittsburgh https://t.co/eF8jJ6qTJq A heartfelt thank you to all law enforcement officers for your selfless service to your community and our country. You run towards danger in order to keep all of us safe and deserve our utmost respect and gratitude. #Pittsburgh https://t.co/DumSItjyG9 Actions of hate will never win against the strength found in love &amp; faith. Our country grieves alongside the Jewish community &amp; we extend our most heartfelt sympathies to the families &amp; friends of the Tree of Life Synagogue. https://t.co/cNeSv68YpH RT @WhiteHouse: The American flag is flying at half-staff above the White House as our Nation grieves the victims of the shooting at Tree o… Trick-or-Treat @WhiteHouse #Halloween2018 https://t.co/cOjVV8mmS1 RT @FoxNews: .@POTUS and @FLOTUS host Halloween at the White House. https://t.co/4mFptjO17A My heart breaks over the news out of #Pittsburgh. The violence needs to stop. May God bless, guide &amp; unite the United States of America. #BullyingPreventionMonth reminds us that we have the power to #ChooseKind. So enjoyed my time w the children from @DPApcs in the @WhiteHouse theater this week to see the film #Wonder. #BeBest https://t.co/qr6ZF80eop Don’t forget #TakeBackDay on Saturday, Oct 27th. Find a site near you: https://t.co/H2htM1nvGq https://t.co/3ENHlTd9q4 I am proud of this Administration’s continued efforts in combatting the #OpioidEpidemic. Thank you to all who are dedicated to helping in this cause. #BeBest https://t.co/5e6Q2WUMt6 Thank you to the students &amp; teachers from @DPApcs who joined me &amp; @BetsyDeVosED to watch the movie #Wonder in the @WhiteHouse theater today.  What a wonderful message!   #BeBest #BullyingPreventionMonth #ChooseKind https://t.co/rdGjOfcnCm Thank you Thomas Jefferson University Hospital for a productive visit.  The MATER program is a prime example of how we can provide help to mothers &amp; babies w/ NAS.  I’m looking forward to learning more about @hhsgov developments for a new tracking system. #BeBest https://t.co/RmZarIo3qW Thank you Sergeant Major John Canley for your service to our nation.  It was an honor to have you &amp; your family at the @WhiteHouse to receive the #MedalofHonor for your heroic actions &amp; leadership under enemy fire. Melania Trump to focus on opioids, newborns in hospital tour https://t.co/v30YJz5gAT via @phillydotcom Yesterday’s visit to see damage from #HurricaneMichael in #Florida and #Georgia was difficult to witness, but the strength &amp; resilience of those affected was heartening to see. We are with you! https://t.co/fjAhuUuP1T Context matters @Forbes @ForbesUnder30 @christopherrim  https://t.co/gV9WebTotf https://t.co/oCXc6edbjT RT @ParisMatch: Melania Trump en Afrique : Tapis rouge pour la First Lady https://t.co/Acl9gkDS1k https://t.co/2J6MBN2sJh RT @StephGrisham45: How is this acceptable? \n#disgusting #boycottT.I. @Tip https://t.co/HvnFahfsVK RT @ABCWorldNews: 'TRUE TO MYSELF': First lady Melania Trump tells @TomLlamasABC in an @ABC exclusive interview that there is “no differenc… RT @ABCWorldNews: When asked about a second term in the White House, @FLOTUS: “I believe that my husband is doing an incredible job for thi… RT @ABCWorldNews: “His action is his action.” Melania Trump reveals to @TomLlamasABC that she speaks to her husband Donald Trump about his… RT @ABCWorldNews: NEW: During our exclusive interview with her, @FLOTUS Melania Trump told @TomLlamasABC: “I made the White House home for… An unbelievable experience visiting the Great Pyramid and Sphinx in #Egypt last week. Thank you President Abdel Fattah Al Sisi &amp; First Lady Entissar Amer for welcoming me with such warm hospitality.  #FLOTUSinAfrica2018 https://t.co/S0MfdSJv2j RT @StephGrisham45: Thank you @seanhannity for calling out the media bullies who attack @FLOTUS every day. https://t.co/MysLTcK8yv 2/2: In #Kenya visiting children at The Nest Children’s Home impacted me greatly, &amp; I so enjoyed the cultural performance at Kenya National Theatre. Thank you @FirstLadyKenya &amp; U.S. Embassy staff for making me feel so welcome. #FLOTUSinAfrica2018 #BeBest https://t.co/Xs5EZQ3bBg 1/2: In #Kenya at @DSWT last week feeding orphaned baby elephants &amp; learning about conservation efforts while exploring beautiful Nairobi National Park. #FLOTUSinAfrica2018 #BeBest https://t.co/D3SUf9iDhu An amazing stop in the “warm heart of Africa” last week. The staff&amp;children @ Chipala Primary School were filled w/ enthusiasm for education,key to success for generations to come. Thank u #Malawi for warm welcome&amp;Prof. Mutharika for your hospitality! #FLOTUSinAfrica2018 #BeBest https://t.co/93xirPlBhq Please listen to local authorities as Hurricane #Michael approaches, &amp; follow @FEMA for updates &amp; tips to help keep you safe. We are with you #Florida. Thank you Egypt 🇪🇬 🇺🇸 https://t.co/7i0POn29XN Thank you Kenya 🇰🇪 🇺🇸 https://t.co/5FXP7Ki3Zw Thank you Kenya 🇰🇪 🇺🇸 https://t.co/JrHncob8Qp RT @StephGrisham45: Thank you for the correction @katierogers - a shame that reporters &amp; outlets all over the world have now reported the w… Thank you Malawi! 🇺🇸 🇲🇼 https://t.co/rE03LMNzOZ Thank you Ghana! 🇺🇸 🇬🇭 https://t.co/d34cqFyRdN Day two in #Ghana was so impactful. My visit to Cape Coast castle was a solemn reminder of a time in our history that should never be forgotten. Thank you to Chief Osabarima Kwesi Atta &amp; the chieftains for the warm welcome &amp; cultural ceremony. #FLOTUSinAfrica2018 https://t.co/pdf9yrmQL8 Thank you #Ghana! The arrival ceremony, visit to Ridge Hospital, tea at the Jubilee House &amp; meeting the hard workers at the U.S. Embassy made for an amazing first day. Thank you to @RAkufoAddo &amp; the people of #Ghana for such a memorable visit. https://t.co/BCSqgCyGOM We are taking off for #Africa!  So looking forward to visiting #Ghana #Malawi #Kenya &amp; #Egypt as I take #BeBest international. #FLOTUSinAfrica2018 https://t.co/8P7r0evXcU This year’s #UNGA reception was a success – thank you again to all who attended &amp; @USAID for your support. Looking forward to spreading the message of #BeBest &amp; representing the #USA as I travel to #Africa next week - #Ghana, #Malawi, #Kenya &amp; #Egypt https://t.co/UGTJdHw73t #HRSA’s #HomeVisiting #MIECHV Program helps parents &amp; #caregivers connect w/ services &amp; resources to raise children to be physically, socially &amp; emotionally healthy. Learn about the prgm and its impact at https://t.co/WMnXwIzqCe #BeBest https://t.co/BQORRTmERo Thank you to all who attended my #UNGA reception today! Looking forward to working with @USAID to take my campaign #BeBest to Africa next week. Together, we can do great things on behalf of the next generation. https://t.co/OG99wwP5Aj A very productive visit with President Andrzej Duda &amp; First Lady Agata Kornhauser-Duda at the @WhiteHouse this afternoon! https://t.co/0PmXhstjuu RT @fema: If you evacuated for #Florence, follow local officials to know when it's safe to go home.\n\nIf you're sheltering at home, stay ins… RT @HHSGov: A disaster or tragedy is unexpected and often brings out strong emotions. If you or a loved one is seeking help in coping with… Thinking of the people in the Carolinas. Thank you to the first responders who are taking immediate action to help. Be safe! #HurricaneFlorence Thank you to the #MedalofHonor recipients and all who attended the Congressional Medal of Honor Society reception this evening at the @WhiteHouse.  Thank you for your service to this country. If you or your loved ones are in the path of #HurricaneFlorence, be sure you are listening to local officials.  Stay safe &amp; evacuate dangerous areas.  Follow  @FEMA for updates. Helpful information at https://t.co/rzS5OjtydI A somber tribute at Flight 93 National Memorial this morning.  We honor the many lost at the hands of evil on 9/11.  It's a time to remember the strength of this nation &amp; the power that comes from unity, leadership &amp; courage.  God Bless this great nation. #NeverForget https://t.co/lDxx4ccwe3 #NeverForget 9.11.01 https://t.co/BWeDfxj21W RT @WhiteHouse: A message from President Trump on Rosh Hashanah: https://t.co/hYwR5HWjXS https://t.co/O6MQARSIGo RT @HHSGov: #BeThe1To to make a difference. Stepping forward &amp; reaching out can help save lives. If you or someone you know needs to talk,… RT @FEMAregion3: Learn your evacuation routes NOW in case you’re directed to leave by local officials for #Florence. Where will you go, how… Students – as you head #BacktoSchool, think about what you wish to accomplish this year.  You have so much power in your individual voices. Will you strive to #BeBest? #HappyLaborDay https://t.co/vNCd4yBoOx Congratulations to @WhiteHouseHstry on a successful #PresidentialSites Summit. It was great hosting you at the @WhiteHouse https://t.co/R8imhuvKhw It was wonderful to host Evangelical leaders at the @WhiteHouse tonight. https://t.co/8R4jC6VVJr I had the honor to contribute to the beautiful &amp; historic @WhiteHouse grounds today by planting a sapling from the Eisenhower Oak.  Thank you to @WhiteHouseHstry for organizing the #PresidentialSites and to the previous first family descendants who joined us today. https://t.co/uqzKxNbL9H .@POTUS &amp; I welcomed @UKenyatta &amp; Mrs. Kenyatta to the @WhiteHouse today. I enjoyed my time with the First Lady of Kenya, discussing our shared concerns for children. #BeBest https://t.co/opNnJjTgUc It was a pleasure having @FirstLadyKenya at the @WhiteHouse today.  I enjoyed learning about @BeyondZeroKenya &amp; discussing our shared concerns for the well-being of children. #BeBest https://t.co/MNrXaL7f16 Very meaningful visit to @Nationwidekids on Friday. We must continue to do all we can to educate people about the real dangers of opioid abuse, especially during pregnancy. #BeBest https://t.co/MThKGdIevR Our thoughts, prayers and deepest sympathy to the McCain Family. Thank you Senator McCain for your service to the nation. Happy Birthday and thank you to the @NatlParkService for 102 years of commitment to this country! https://t.co/Zy25uSXbq6 RT @Scavino45: Today, President @realdonaldtrump and @FLOTUS Melania toured the neonatal intensive care unit at Nationwide Children’s Hospi… A great visit to @Nationwidekids today. #BeBest supports this Administration’s continued efforts in battling the opioid crisis&amp;the effects it has on NAS babies. Thank you to the dedicated team of doctors,researchers&amp;caring staff who work hard daily to carrying out this mission. https://t.co/rXeJItfqrF Honored to have the family of Technical Sergeant John A. Chapman at the @WhiteHouse today to receive the #MedalofHonor in memory &amp; gratitude of TSgt. Chapman.  We will always remember his heroic actions under enemy fire.  God bless all who serve. #BeBest is dedicated to the well-being of children. Thank you to @HRSAgov @SecAzar for allowing me the opportunity to be part of the efforts in providing a safer &amp; healthier online presence at the #CyberbullyingSummit https://t.co/R3dJxhcarV @potus &amp; I enjoyed dinner with @tim_cook last night in Bedminster. Proud of the job he is doing at Apple - big innovations &amp; investments in the USA, which positively impacts our economy! https://t.co/zTNZ16N2eh New from the @CDCgov: studies show that in 2015 there was an infant born w/ NAS every 15 mins in the U.S. Untreated opioid use disorder (OUD) during pregnancy is a growing national problem. #BeBest continues to raise awareness on the heartbreaking results of OUD. Was a great evening hosting business leaders from across different industries w @potus for dinner last night in Bedminster. Thank you to all who attended! https://t.co/2Bcv3jkPVh It’s #Backtoschool for many youth this month.  As you begin a new year, how will you be the best you?  #BeBest Though I was not able to attend in person, it was a privilege to speak to the youth campers at Camp Unite.  Thank you @uniteky - your mission of promoting education &amp; providing leadership to our children is so important! #BeBest https://t.co/ErJRFZHFzJ Planning is underway for this year’s #Christmas at the @WhiteHouse!  There is still a lot of work to be done, but I hope everyone will enjoy our final holiday vision for the People’s House. https://t.co/BXeV9xi69W Thank you @MarshaBlackburn and members of local law enforcement for warm welcome! #Nashville #BeBest https://t.co/pJaIspr3br RT @WhiteHouse: Opioids killed more people last year than either car accidents or gun violence. We cannot let stigma or silence prevent us… #BeBest will continue to bring attention to NAS.  A very big thank you to @VUMCchildren &amp; staff for an informative &amp; moving visit. It is a joy spending time w/ such courageous kids &amp; to witness the strength of families who must deal with these tough situations. https://t.co/WuZtjee1EQ I had a wonderful time visiting @MicrosoftIPC &amp; meeting the students on their Council for Digital Good. Thank you students for being leaders &amp; sharing your creativity  in the cyber community.  #BeBest https://t.co/aSHnu0XYc2 The dedicated @SecretService work tirelessly &amp; often behind the scenes to keep our family safe.  @POTUS &amp; I thank you for your service &amp; all that you do. Our deepest condolences go out to the family of Special Agent Nole Edward Remagen. RT @SecretService: In Remembrance: Special Agent Nole E. Remagen. This week the U.S. Secret Service lost one of America’s finest. We ask fo… Congratulations to the @FEMA YPC members for being best &amp; leading their communities in building a culture of preparedness.  Their hard work can help in case of hurricanes &amp; other natural disasters. #BeBest #YouthPrep https://t.co/ZQLSEPYkIN Belgium 🇧🇪, UK 🇬🇧, Finland 🇫🇮 \nThank you for your warm hospitality! 🇺🇸 https://t.co/WRe94ZMXDW RT @realDonaldTrump: Thank you Helsinki, Finland! https://t.co/rh4NUjPSwU Enjoyed conversation with the First Lady of Finland today - good conversation about issues facing our nations. Thank you to @JenniHaukio for hosting me! https://t.co/wSzjA7cQq1 RT @realDonaldTrump: 🇺🇸🇬🇧 https://t.co/CwnBfe3smd It was an honor to meet and have tea with Her Majesty Queen Elizabeth ll. @POTUS and I enjoyed the visit and her company very much! https://t.co/hTYIEPcjs6 2/2: Speaking with children from George's Primary School to discuss their program \"Be the Best You Can Be\" was such a treat &amp; I had much fun in my 1st bowls match! #BeBest https://t.co/uZmvkoR0H5 1/2: Thank you Royal Hospital Chelsea for the warm welcome! I enjoyed my tour of the Wren Chapel &amp; Great Hall &amp; mtg your lovely Pensioners. https://t.co/ZKz6axd9QW Wonderful dinner at Blenheim Palace last night with Mr. Philip May &amp; @theresa_may. Thank you for your gracious hospitality - @potus and I enjoyed the evening very much. https://t.co/P4Fk1iUfFk A great visit in Belgium! Proud to represent the US at the spousal program during @NATO. Thank you to our host Belgium, @usembbrussels, @musicchapel &amp; @Nato for a wonderful program. These opportunities are important to building lasting relationships w/ our foreign allies. https://t.co/79AMLwNjKI Wonderful to hear all 12 boys &amp; their coach are out of the cave in #Thailand. What an amazing &amp; heroic global effort! Wishing them all a speedy recovery. @POTUS &amp; I were honored to welcome members of our military &amp; their families for our second military #FourthofJuly picnic at @WhiteHouse today. 🇺🇸 https://t.co/e1oVMTYdGt Happy #IndependenceDay\nMay God bless this great nation &amp; all the people who protect it! 🇺🇸 I had a wonderful visit to @WRBethesda today.  Thank you to the many dedicated service members &amp; medical staff who take such good care of our men &amp; women in uniform. https://t.co/iPjxyRhY4H Yesterday, I visited @CBParizona facilities &amp; a nonprofit social service shelter of @hhsgov in #Arizona. Thank you to the compassionate &amp; dedicated law enforcement &amp; care providers working hard to secure our nation &amp; take care of children in a difficult situation. @CBP #USBP https://t.co/goFdaJCaWt Today's violence at the Capital Gazette was tragic &amp; evil. My heart goes out to all affected in this brutal &amp; senseless attack, &amp; I send thoughts &amp; prayers for comfort to the friends, family &amp; colleagues of those killed &amp; injured. “It is easier to say nothing than to say words of kindness. It is easier to judge quickly than taking time to understand.” Thank you again to @SADDnation for allowing me to help kick off your inspiring conference! #BeBest #SADD2018 https://t.co/5pDcqkfo3h It was a privilege to welcome members of the armed services to the @WhiteHouse today for the #MedalofHonor Ceremony. We honor the memory &amp; service of First Lieutenant Conner to our great nation. Thank you Pauline, for accepting this honor on behalf of your husband. RT @WhiteHouse: Today, @realDonaldTrump and @FLOTUS welcomed @KingAbdullahII and @QueenRania of the Hashemite Kingdom of Jordan to the Whit… A great visit with the King &amp; Queen of Jordan.  @POTUS &amp; I were glad to welcome them back to the @Whitehouse. @QueenRania &amp; I shared an open &amp; productive discussion about the many issues our countries are challenged with today. https://t.co/JjKwurfCS3 I enjoyed speaking to our future leaders at @SADDNation about the power they have in their schools &amp; communities through positivity &amp; kindness.  Thank you students, for sharing your stories with me.  #BeBest #SADD18 https://t.co/DikphPexBl I applaud the House of Representatives for passing more than 50 bills to combat the opioid &amp; drug demand crisis in our country. I hope the Senate will follow suit so the legislation can be signed into law and we can help people &amp; families affected by the crisis. Visiting w children at the shelter in #Texas yesterday was very touching. Despite the difficult circumstances children were in good spirits &amp; very kind. It's my sincere hope Congress will be able to reach across the aisle &amp; find a solution! https://t.co/4ZumcDVVMc Today's visit to #Texas to spend time with children &amp; thank the many hardworking individuals helping to care for them was very meaningful. Thank you to @SecAzar @HHSGOV for traveling w me today &amp; the care you are giving these children in such a difficult time. https://t.co/P5orrJ4k6p A great visit with the King &amp; Queen of Spain at the @WhiteHouse today.  Queen Letizia &amp; I enjoyed tea &amp; time together focusing on the ways we can positively impact children. https://t.co/IiaMQOil3K Thank you @HHSGov &amp; @CMSGov for all you do to protect our children. I encourage everyone to learn more about how your state can help protect our most vulnerable from the effects of opioid abuse. #BeBest Thank you @Fordstheatre &amp; the talented performers for a special evening celebrating the arts &amp; the legacy of former President Lincoln.  Congratulations to @jacknicklaus &amp; Sheila Johnson, the recipients of the Lincoln Medal! https://t.co/EEJLhLn5qb Proud of this administration’s continued efforts in combatting opioid abuse. Visit https://t.co/xl3UA2l8Lc to learn more on how we can protect our youth from harmful drugs.  Thank you to @AdCouncil, @Truthinitiative, &amp; @ONDCP for your work on this campaign. #BeBest Informative meeting with @FEMA today. With the hurricane season is upon us, you can download the FEMA app https://t.co/GOa1yv41KH to start receiving alerts &amp; safety reminders. https://t.co/mdUMVo1JZq I invite Americans across our great country to visit this wonderful, historic home with the White House Experience app from @WhiteHouseHstry. Distance is no longer an excuse not to visit the People’s House. Tonight @POTUS &amp; I were honored to pay tribute to our fallen heroes.  Thank you to the Gold Star families that joined us in celebration &amp; remembrance. https://t.co/6oSh1t88G7 I see the media is working overtime speculating where I am &amp; what I'm doing.  Rest assured, I'm here at the @WhiteHouse w my family, feeling great, &amp; working hard on behalf of children &amp; the American people! On #MemorialDay we honor the many Americans who laid down their lives for our great country.  As one nation under God, we come together to remember that freedom isn’t free.  Thank you to all the service members &amp; their families who sacrifice so much to keep us safe. 🇺🇸 https://t.co/H6yhNQXyPg Thank you Master Chief Slabinski for your heroic actions.  @POTUS &amp; I are proud to have you @WhiteHouse today to award the #MedalOfHonor.  Thank you &amp; thank you to all our military who risk &amp; sacrifice your lives for our freedom. My heart goes out to Santa Fe and all of Texas today. A sincere thank you to Walter Reed Medical Unit @WRBethesda &amp; to all who have send good wishes &amp; prayers! I am feeling great &amp; look forward to getting back home @WhiteHouse soon. Happy Mother’s Day! https://t.co/DqAlvtmt2v RT @realDonaldTrump: On behalf of the American people, WELCOME HOME! https://t.co/hISaCI95CB We had a wonderful celebration @Whitehouse today to honor some incredible military moms for #MothersDay. My heart &amp; continued prayers stay w/ all our brave military members. I’m proud to support @POTUS in today’s signing to help increase opportunities for military families. https://t.co/VCs8KsScOF The Senate Spouses Luncheon has a history of paying tribute to First Ladies &amp; I was honored  to attend today’s event. Thank you for your continued support &amp; generous donation to Preston’s Veteran Flowers &amp; Flags. Through #BeBest we can effect positive change for our children. https://t.co/vJ7sSIopGi Thank you to all who attended yesterday’s launch of #BeBest. I will continue focusing on ways to help children be their best selves. Please visit https://t.co/npPChhBGPT to learn more! https://t.co/dMsSJHgMBs RT @StephGrisham45: https://t.co/j1KX85NIQH I am very excited to kick-off #BeBest - a campaign dedicated to helping children #BeBest in their individual paths.  For more information please visit our webpage at https://t.co/S3FrTpLwDJ 🇺🇸 #BeBest 🇺🇸 https://t.co/ziI09BW4i1 Tomorrow is the day! Very excited to announce my initiatives. Tune in live at the @WhiteHouse at 3 PM! Everyone can agree on the importance of teachers &amp; their instrumental role in the development of our children.  I want to thank teachers everywhere for all they do &amp; the lasting impact you have on kids.  Congratulations to this year’s #TeacheroftheYear National #TakeBackDay is one step closer to fighting the #OpioidEpidemic.  Parents, take action and get rid of unneeded medications.  Find your nearest disposal site at https://t.co/Df7OfO6d5t and help protect our children! Thank you to everyone for all of the wonderful birthday wishes! It was an honor to host President @EmmanuelMacron and Mrs. Macron for our first State Dinner! 🇺🇸 🇫🇷 https://t.co/uJRmo5Iuyu Thank you @NGADC for the beautiful tour among your many galleries.  The paintings are a testament to the influence art has among all cultures. I was glad to be able to view the exquisite works with Mrs. Macron. https://t.co/4bpw7BBhPL Welcome to the @WhiteHouse President @EmmanuelMacron and Mrs. Macron. 🇺🇸🇫🇷 https://t.co/aUrgYNO89k Sending healing thoughts of strength, along with prayers, for President George HW Bush tonight. Spent yesterday with my team checking on the final details of our first State Dinner with France. https://t.co/vHoQ1rTA3s After months of preparations, @POTUS and I are looking forward to hosting our first State Dinner with France! Thank you to everyone who has worked so hard to make this visit a success. 🇺🇸 🇫🇷 https://t.co/j7fKmUhISJ Thank you to #Texas law enforcement for ensuring the safety of everyone today. https://t.co/ThFEyeQOfl It was my honor to travel to Houston to give my respects to Barbara Bush and the remarkable life she led as a mother, wife, and fearless First Lady. My sincerest thoughts  and prayers continue to be with George H.W., and the entire Bush family. What a beautiful tribute to a wonderful woman who lived for God, family and country. https://t.co/sBKNmkgsI6 Wonderful visit to the @FlaglerMuseum with Mrs. Abe in Florida this week. Grateful to the Prime Minister and Mrs. Abe for their friendship. https://t.co/65N66WMuUj Thank you to the @FlaglerMuseum for the engaging tour this morning.  It was a treat to step back in time w/ Mrs. Abe &amp; admire the beauty of Whitehall. https://t.co/J35gX631tm Very moving visit today - \"Prescribed to Death\" Opioid Memorial on the Ellipse is a worthwhile partnership between @WhiteHouse, @Interior &amp; @NatlParkServuce. #StopEveryDayKillers https://t.co/ciJ0W5PBnN 2/2: And to all military families, especially the children, thank you for your sacrifice. #monthofthemilitarychild 🇺🇸 1/2: Thank you to the strong &amp; courageous members of our U.S. military all over the world! Your continued contributions &amp; commitment to the safety of our great nation will never go unnoticed or unappreciated. RT @FLOTUS: Thank you to all the students who participated in an informative discussion at the @WhiteHouse! Children should be seen AND hea… Thank you to all the students who participated in an informative discussion at the @WhiteHouse! Children should be seen AND heard - their input is an important part in finding ways to help them be their best selves. https://t.co/1BGf1TlLUa We had an informative listening session at the @WhiteHouse today.  Thank you to each of the students who shared their thoughts &amp; feelings with me.  I am listening and know that together, we can work towards ensuring children everywhere can be their very best. https://t.co/tOzhJD6Qbj The @WhiteHouse is lit up in blue tonight in honor of #AutismAwarenessDay  #LightItUpBlue https://t.co/Y0QMVkZulf Loved seeing everyone at the @WhiteHouse for this year's #EggRoll2018! Thank you to all the hard-working volunteers who helped decorate over the weekend. #EasterEggRoll https://t.co/j3zP9Td93I Happy #Easter https://t.co/xVNXuvlVSm Wishing everyone happiness and health on this #GoodFriday. https://t.co/I49O9pZaoG Enjoyed my visit to @StMarysMC today. So great to spend time with some of their brave patients and hard working doctors and nurses. https://t.co/pm4UgMe0Gr Enjoy 2018 @WhiteHouse Spring Garden Tours! 🌸          Tix are available through @NatlParkService \nhttps://t.co/DIQwE6CH6R https://t.co/5BS6qGSXqo We welcome the opioid memorial to the Ellipse in President’s Park in April. I encourage everyone to take a moment &amp; visit this powerful exhibit. Thank you to @NatlParkService &amp; @NSCsafety for remembering the victims of this deadly crisis. Enjoyed meeting with leading social media and technology representatives last week. Together, I know we can make a difference for children! https://t.co/RIkeqFLFuD Thank you @StateDept for hosting the International #WomenofCourage ceremony that both recognizes and celebrates the strength and leadership of women around the globe. https://t.co/nyIOsQQXbK A big thank you to Celia and her big sister Natalie from Clarksburg, MD for traveling to the @WhiteHouse to visit!  I had a wonderful time watching you bake cookies! #ChocolateChipCookies https://t.co/UrervLPusm Looking forward to today's  @StateDept’s International #WomenofCourage award ceremony, which both recognizes &amp; honors the strength &amp; bravery of women around the globe. Greetings from @WhiteHouse https://t.co/mjuHFqglYz Snow day ❄️ @WhiteHouse https://t.co/D5JquT9qiv RT @politico: “In my role as First Lady, I receive many letters from children who have been bullied or feel threatened on social media,” Me… It was a very productive meeting on cyber safety &amp; how to teach our children to be responsible digital citizens. Thank you @amazon @Facebook\n@FOSI @Google @m_Beckerman @Microsoft  @Twitter &amp; @snap for coming to the @WhiteHouse today &amp; sharing your valuable insight and expertise. https://t.co/YY2srrbYhP Great day in New Hampshire visiting w 1st responders at @ManchesterFD. Honored to give remarks &amp; intro @potus at Manchester Community College as we continue to fight this country's opioid crisis. https://t.co/3WDZcjJfZM Happy #StPatricksDay https://t.co/JmxqyQPl3y Thank you Prime Minister Leo Varadkar for joining us in our traditional #StPatricksDay celebration at the @WhiteHouse today. May this year bring you and the people of Ireland the best of good luck! https://t.co/N1E9Fp1KN4 Heartened to see children affected by tragedy using their voices to try and create change. Wonderful to meet and speak with Stoneman Douglas High School student @KyleKashuv today at the @WhiteHouse. His message of unity inspires us all! #MSDStrong https://t.co/N5ZqdGruwT Wonderful to meet @KyleKashuv today. His message of unity is one we should all share. Thank you for visiting us at the @WhiteHouse &amp; hope you enjoyed your surprise meeting with @potus! Wishing you much success w @TheReachOutApp. https://t.co/K4aGydo1uX Happy #IWD2018.  Today we recognize, celebrate &amp; honor women around the globe.  On March 21, I will be at the @StateDept to present the #WomenOfCourage award to some extraordinary women. Great visit with Prime Minister Benjamin &amp; Mrs. Netanyahu!  Enjoyed hosting Sarah Netanyahu for lunch to discuss how we can make a better and safer world for children. https://t.co/gn1MwfdAHT Thank you to everyone who attended today’s opioids summit @WhiteHouse. A special thanks to Betty Henderson for having the courage in her grief to share her son’s story-we will continue to celebrate Billy’s life as we work to stop the epidemic that has taken hold of our country. https://t.co/yTVJ3zYTJa Looking forward to the White House Easter Egg Roll! Learn about the history of this wonderful tradition &amp; see the beautiful 2018 White House Easter Egg collection: &gt;https://t.co/ucriYkQA10&lt; https://t.co/eWQGZ8Ziv3 March starts #WomensHistoryMonth, a time to celebrate the ways American women have historically changed &amp; continue to shape our society.  As we also recognize #RedCrossMonth, we see the result of one woman’s call to action through the humanitarian relief efforts of the @Redcross Looking forward to hosting members of the @NatlGovsAssoc &amp; their spouses at the @WhiteHouse this evening. Wonderful opportunity to come together in friendship on behalf of our many communities across the country. Thank you Prime Minister Turnbull and Mrs. Turnbull for a great visit to the @WhiteHouse today. I enjoyed talking with Mrs. Turnbull about our shared concerns for children and solutions to making the world a better place for them. https://t.co/WEUudE6nOC Last week, I had the pleasure of meeting with some exceptionally strong children currently patients at @NIH. Thank you @TheChildrensInn for all that your wonderful staff and facility do to help our children. https://t.co/UlLe291J6k Saddened by the loss of Evangelist Billy Graham.  He led an impactful life, touching so many people with his spiritual teachings.  He will be deeply missed. I encourage everyone to test the power of kindness on #RandomActsofKindnessDay.  It’s an opportunity to teach our children the importance of taking care of one another. My heart is heavy over the school shooting in Florida. Keeping all affected in my thoughts &amp; prayers. Looking forward to a very sweet afternoon visiting @theChildrensInn &amp; celebrating Valentine’s Day with some kids at @NIH! #HappyValentinesDay It was wonderful to welcome guests to the @WhiteHouse this evening in celebration of National African American History Month.  We look forward to hosting many more events that celebrate our unique and diverse cultures. #BlackHistoryMonth2018 Yesterday’s visit to @CincyChildrens was very informative. Learned their latest studies on babies exposed to opioids during pregnancy &amp; the development of NAS. Enjoyed my time with children who are patients there! https://t.co/OMVGNmjQZ6 Thank you @CincyChildrens! Your research on the #OpioidEpidemic and understanding its effect on babies helps us grow in our awareness of the devastating effects it has on children. Also enjoyed spending time with some of your most inspiring young patients! https://t.co/fFUIMt2oZE Very much looking forward to visit @CincyChildrens today &amp; learn more about their efforts in combatting the effects opioids are having on our children &amp; how we can continue to work towards ending the #OpioidEpidemic. February is #AmericanHeartMonth. I encourage parents to take this opportunity to teach children about the importance of a healthy diet &amp; exercise! https://t.co/mgoZYdMGAV Today marks the start of #BlackHistoryMonth Let this be a time to come together in a celebration of diversity. Last night I was surrounded by a wonderful group of guests for the State of the Union. It was a privilege to meet them and hear their incredible stories. #SOTU https://t.co/9riX7LB6Qg I will be joined tonight by an honorable group of Americans. Sitting with me are heroes who have served our nation in times of need, families who have suffered at the hands of evil, and citizens who have embraced the American dream. #SOTU We recognize International #HolocaustRemembranceDay so that #WeRemember all the innocent men, women, and children lost. May we continue to educate our children on one of history’s most devastating events and always #AskWhy. https://t.co/dzTQqLmlGA Thank you @HolocaustMuseum for a powerful &amp; moving tour that honors the millions of innocent lives lost, and educates us on the tragedies and effects of the holocaust. #WeRemember #AskWhy https://t.co/za8MN6pKRZ This has been a year filled with many wonderful moments. I’ve enjoyed the people I’ve been lucky enough to meet throughout our great country &amp; the world! 🇺🇸 https://t.co/MMRi72ENd0 Today we honor Dr. Martin Luther King Jr. &amp; his service to this great country.  I am honored to be First Lady of a nation that continually strives for equality &amp; justice for all. #MLKDay It was a productive week with meetings, meetings &amp; more meetings!  Lots of work to be done in 2018 - looking forward to the year ahead as FLOTUS! https://t.co/4e6rQs7541 Thank you to the brave men &amp; women who sacrifice so much to protect &amp; keep us safe. We appreciate all that you &amp; your families do! #LawEnforcementAppreciationDay https://t.co/Zb8IIY19qf Wishing everyone a Joyous, Healthy and Prosperous #NewYear2018! ✨ RT @realDonaldTrump: MERRY CHRISTMAS!!! https://t.co/mYtV5GNdLl #MerryChristmas 🎄🤶🏻 https://t.co/IahMZhf5gc @POTUS and I had fun helping  children track #Santa tonight. Wishing everyone a wonderful #ChristmasEve 🎄 https://t.co/vzsRfNlrx3 Looking forward to helping kids track Santa today with @NoradSanta! Wishing everyone a very Merry #Christmas Eve! RT @realDonaldTrump: My thoughts and prayers are with everyone involved in the train accident in DuPont, Washington. Thank you to all of ou… Merry Christmas from President Donald J. Trump and First Lady Melania Trump.\n@POTUS &amp; @FLOTUS  are seen Tuesday, December 5, in their official 2017 Christmas portrait, in the Cross Hall of the White House in Washington, D.C.\n(Official White House Photo by Andrea Hanks) https://t.co/WRvY1sUUuw RT @AP_Politics: Melania Trump says she hopes the giving spirit that Americans displayed during a season of devastating hurricanes will con… Great day with military families at @JBABdc as we sorted toys for children. Thank you to @ToysForTots_USA for all that you do for kids across the country.  Merry #Christmas! https://t.co/SdZdxGEMu9 Looking forward to visiting @JBABdc today to help @ToysForTots_USA sort &amp; pack toys to be shipped to children across the country in time for #Christmas!  Thank you to all who volunteer time for others – esp during the holidays. RT @realDonaldTrump: Wishing all of those celebrating #Hanukkah around the world a happy and healthy eight nights in the company of those t… Enjoyed last week’s visit to @childrenshealth in DC. Was wonderful to meet brave patients &amp; their families. Wishing everyone a happy &amp; healthy #Christmas season &amp; #NewYear! https://t.co/eBe5Rs4WA2 A special thank you to all the amazing volunteers who made this year's @WhiteHouse #Christmas decorations a success! https://t.co/K4jR5fNx2H The effects of the hurricane season are still being felt &amp; residents still need our help. As Christmas &amp; the New Year approach, I encourage people to lend time volunteering or providing financial support to those still in need. https://t.co/uUkmVUNH8n Beautiful morning @WhiteHouse #Christmas. First #snowday2017 https://t.co/m2YGh4e18M I was so grateful at the opportunity to spend time with the children and their families yesterday, and want to thank the medical staff @Childrenshealth for their lifesaving work. https://t.co/dkQvUM3RMl Fun questions from the kids @childrenshealth 😀 https://t.co/T5oIMBoIA6 On my way to @childrenshealth to read a #Christmas book and visit with some of the brave patients. Please keep all who are struggling with health issues in your thoughts &amp; prayers this holiday season. Wonderful to spend time with @secondlady Mrs. Pence, @TexasFLCA Mrs. Abbott and @georgepbush Mr. Bush. Thank you for your service to the great state of #Texas. #TexasRebuilds #TexasStrong https://t.co/5WsvLD0AqP Today we honor Pearl Harbor Heroes. 12/7/1941\nThank you to all military for your courage and sacrifice! https://t.co/fuxvoaXAno Thank you #Texas! So enjoyed my visit with everyone today. Special thanks to 1st responders &amp; @CoastalBendFB for all that you do! We are with you Texas. #TexasRebuilds https://t.co/GwPHoUrJVl Thoughts &amp; prayers to those affected by the wildfires in California. Thank you to all first responders for their heroic efforts. Headed to #Texas tomorrow with @SecondLady to continue support those affected by #HurricaneHarvey. We are with you every step of the way! “Today, on #WorldAIDSDay, we honor those who have lost their lives to AIDS, we celebrate the remarkable progress we have made in combatting this disease, and we reaffirm our ongoing commitment to end AIDS as a public health threat.” Potus https://t.co/tvF53d3ixA RT @ABCWorldNews: MOMENTS AGO: Pres. Trump, first lady Melania Trump participate in National Christmas Tree lighting in Washington D.C. htt… Thank you to the talented performers from Vivid Ballet Company who helped us unveil this year's decorations at the @whitehouse. https://t.co/qFole9nmzs So important to thank our service members for their service, especially those away from their families during the holidays. https://t.co/QSOM8elUNx Had a wonderful visit from @JBA_NAFW children today at the @whitehouse! #WhiteHouseChristmas https://t.co/Hnw758zHzL The decorations are up! @WhiteHouse is ready to celebrate! Wishing you a Merry Christmas &amp; joyous holiday season! https://t.co/d6ZuyeFvrw Thrilled to spend part of our Thanksgiving w the local Coast Guard station in Florida. Thank you to all members of the military who keep us safe! #HappyThanksgiving2017 https://t.co/WKpDCoi2Rx Preparations are underway to celebrate the holidays at the @WhiteHouse! https://t.co/N5qZ1NP8ez Congratulations to Drumstick on the pardon from @Potus ! We loved having you &amp; Wishbone at the @WhiteHouse. https://t.co/4KGKOVZGHq Thank you Silent Night Evergreens in Wisconsin for our beautiful tree! @POTUS, Barron &amp; I are excited for Christmas in our new home! https://t.co/so6HVG1st8 RT @ABCWorldNews: First lady Melania Trump, son Barron welcomed the White House Christmas tree today, a 19.5 ft Balsam fir grown in Endeavo… This year's @WhiteHouse Christmas booklet is in printing!  Excited to receive the beautiful tree Monday! #ChristmasTraditions https://t.co/x1bbnXch0z Thank you #China! 🇨🇳 🇺🇸 https://t.co/dNm9Qts8W2 Thank you Republic of #Korea! 🇰🇷 🇺🇸 https://t.co/Wyxg2np8RQ Thank you #Japan! 🇯🇵 🇺🇸 https://t.co/EGpGetDCed Unforgettable memories! The Great Wall of #China #FLOTUSinAsia https://t.co/tEJ10uUOXo Wonderful to met Gu Gu 🐼 #FLOTUSinAsia https://t.co/ZdWWrj9bV8 Wonderful to spend time with military families at JBER #Alaska. Thank you for your service! #HappyVeteransDay https://t.co/dIn7RbKdvs Thank you President Xi &amp; Madame Peng, for your warm hospitality. Enjoyed our time &amp; looking fwd to future visits between our countries. https://t.co/UrX1Y4S9YC Thank you USA troops and families for your sacrifice and your service! #FLOTUSinAsia https://t.co/mEz49Yupf0 Thank you for wonderful welcome President Moon &amp; First Lady Kim and people of Republic of Korea 🇰🇷 https://t.co/37p1WF53Lv #FLOTUSinAsia                        https://t.co/7qJksffxdH Our hearts are with #Texas Wonderful visit w Mrs. Abe today! Enjoyed conversation over tea &amp; the cultural presentation on the history of pearls. #FLOTUSinAsia https://t.co/g7Oax90SbN On the way to Asia. I am looking forward to seeing Mrs. Abe 🇯🇵, First Lady Kim 🇰🇷 and Madame Peng 🇨🇳 again! #FLOTUSinAsia Our visit to the @USSArizona memorial at #PearlHarbor was very moving. May those we lost always Rest In Peace. Thank you to all who serve. https://t.co/11F9ituH8O Thank you for a warm welcome Hawaii! Aloha! https://t.co/reAHw9ItNo Thank u @WhiteHouseHstry for all you do to preserve, collect&amp;exhibit the artifacts of American history&amp;culture in the @WhiteHouse 11/3/1961 My heart breaks for #NYC today. Thoughts &amp; prayers as we monitor the situation. Fun night handing out treats to kids who visited @POTUS &amp; I at the @WhiteHouse. #TrickOrTreat #HappyHalloween2017 https://t.co/qa4gwHtyOR The People’s House @WhiteHouse is ready to celebrate #Halloween2017 https://t.co/35p3AbnM9o 2/2: Find nearby locations to safely turn in expired, unused, or unwanted prescriptions! https://t.co/hVKAPXC84O 1/2: Today is Nat’l Prescription Drug Take Back Day. Visit https://t.co/hVKAPXC84O ... Enjoyed spending time with the students of Orchard Lake Middle School in Michigan on Monday. Thank you for leading by example! https://t.co/zldcxTmUv6 RT @FoxNews: WATCH: Full @FLOTUS speech on battling the opioid epidemic in the United States . https://t.co/6kCWvMCYuQ Proud to support @potus today as he declared our nation's opioid crisis a public health emergency. https://t.co/CZETljrq5N Thank you for all you do! @MichStatePolice @oaklandsheriff @WestBlmfldPD W Bloomfield Fire Dept &amp; Waterford Police Dept https://t.co/4tyOF9wmLG Wonderful to see kind children at Orchard Lake Middle School in Michigan! Thank you for having me! #nooneeatsalone https://t.co/0m1k2OwTXZ Honored today to donate my inaugural couture piece to the @amhistorymuseum! https://t.co/ENU1BeJA02 2/2: My goal as FLOTUS is to positively impact the lives of children &amp; effect change within our next generation. 1/2: Thank you to Kuwait-America Foundation for this year's Humanitarian Award! My determination on behalf of those affected by recent hurricanes remains steadfast. Please help if you can. https://t.co/I0RbP7bBTL https://t.co/9N7pDzPi90 Welcomed PM @JustinTrudeau &amp; Mrs. Trudeau to @WhiteHouse yesterday! Productive mtgs between Canada 🇨🇦 &amp; USA 🇺🇸 https://t.co/Kd1IOv3xFr Enjoyed hosting Sophie Trudeau at the @WhiteHouse today.  Thank you neighbors to our north, for the visit. https://t.co/ZPUxtISRE7 Today's visit to @LilysPlaceWV was incredibly special. Let us all find ways to help children grow into happy, healthy adults. https://t.co/YUv7WJdPk4 Tmw I travel to WV on behalf of kids. Babies born addicted to opioids often end up in foster system-we must help parents overcome addiction. Wonderful celebration of Hispanic Heritage Month @WhiteHouse this afternoon! https://t.co/lGxbglXp3l Welcomed spouses of Senior Military Leaders to the @Whitehouse last night. \nThank you for your service! https://t.co/R1oagHCsgo Yesterday’s visit to Las Vegas was both somber &amp; uplifting. Those lost will never be forgotten. #VegasStrong https://t.co/onFHVos8Cy RT @realDonaldTrump: WE LOVE YOU LAS VEGAS! https://t.co/nxRWeR1gEz After speaking w/people affected by #HurricaneMaria yesterday we are reminded of the fighting spirit of Americans. @POTUS and I are w/you! https://t.co/DTGXG2ivBk RT @realDonaldTrump: My Administration will continue to work around the clock with Governor @RicardoRossello &amp; his team. Great progress bei… My heart and prayers goes out to victims, families &amp; loved ones! \n#PrayForLasVegas In honor of National Breast Cancer Awareness Month we lit the @WhiteHouse pink! https://t.co/w3M3XlpXos Congratulations to all the competitors at this year's Invictus Games! You've served your country proudly at home &amp; @InvictusToronto https://t.co/nRhoyCNx75 Oct is Natl Breast Cancer Awareness Month.  Please talk to your doctor about early detection &amp; reducing your risk. #BreastCancerAwareness Thank you to all who participated in today's discussion on opioid abuse. By talking about it, we can start to make a real difference. https://t.co/e9KJU6zWPn Today we celebrated advances in pediatric health care! Thank you Barbara &amp; @NCHCF for all you do on behalf of children. #HealingGarden https://t.co/bt7wA8aSQ0 Wishing all competitors at @InvictusToronto the best of luck this week! Thank you to all who serve. Go Team USA 🇺🇸!!! https://t.co/nIBOZIDWjI Wonderful spirit &amp; determination of ALL the competitors @ opening ceremony @InvictusToronto! Honored to lead the U.S. delegation! Go team 🇺🇸 Productive &amp; fun day @WhiteHouse Kitchen Garden today! Thank you @BGCGW for all of your help! #HealthyEating #HealthyLiving https://t.co/lecdgqQnyu Thank you @BGCGW Boys &amp; Girls Club Washington for helping us plant &amp; harvest @WhiteHouse Kitchen Garden today! #HealthyEating #HealthyLiving https://t.co/1FdVHuvCYM \"No child should ever feel hungry, stalked, frightened, terrorized, bullied or afraid with nowhere to turn.\" https://t.co/Z7F6JsSvGF So enjoyed hosting yesterday's #UNGA luncheon.  Thank you all who attended &amp; will help support my efforts on behalf of children. https://t.co/8Z2URyvQfd Sending strength to our friends in Puerto Rico. #HurricaneMaria Thinking of those in #Mexico affected by today's #earthquake. Happy Birthday @USAirForce! Thank you to the heroes who protect us &amp; the families who love them! https://t.co/K88ik9be02 It was an honor to host dinner for @whitehousehstry https://t.co/nSGPxYuGfA Thank you @JBA_NAFW for allowing me to spend time w the kids at your youth center! Fun &amp; smart kids w very good questions. https://t.co/tcyWbAPinE We are with you #Florida! https://t.co/S8ugpOjq6f Thank you @WhiteHouseHstry for all you do to help preserve the people's house. @potus &amp; I are honored to call @whitehouse home. Before touching down in Naples, air tour of hurricane damage. There is much work to be done, but America is with you Florida! https://t.co/eWdJHmuQUK Taking off to #Florida w/ @Potus to meet with @FEMA and people affected by #HurricaneIrma. https://t.co/qvdm4jIRSC My concern continues for all impacted by the hurricanes.Will fly to #Florida on Thursday w @potus to survey the damages from #HurricaneIrma. Remembering September 11, 2001 #NeverForget https://t.co/5mrRa23054 Today's video conference #HurricaneIrma briefing by @Fema at Camp David.  \nThank you to 1st responders! Stay safe! https://t.co/jLF6vSvgDO Look fwd to hosting members of the cabinet &amp; their spouses at #CampDavid this weekend. Much work to be done as we monitor #Hurricane Irma. If you are in or near projected path of #HurricaneIrma please listen to local law enforcement in the area. Stay safe!!! RT @realDonaldTrump: I encourage EVERYONE in the path of #HurricaneIrma to heed the advice and orders of local &amp; state officials! https://t… #ReadABookDay https://t.co/wBAzbEcUDb On National #ReadABookDay I encourage everyone to read a book. Let every page educate you &amp; take you on an exciting journey! On this #LaborDay2017 we honor American workers for their many contributions to the prosperity of these United States. 🇺🇸 Beautiful service today at St. John's. @potus and I wishing you many blessings on this National Day of Prayer. Spent today with the wonderful families helping each other after #HurricaneHarvey #Texas https://t.co/ia9696reLd RT @realDonaldTrump: Departing for Texas and Louisiana with @FLOTUS Melania right now @JBA_NAFW. We will see you soon. America is with you!… I met w @RedCross @SalvationArmyUS &amp; Southern BaptistDisasterRelief to thank them for efforts during #HurricaneHarvey &amp; receive update. https://t.co/DMxM2sZ8Ms Sept. is Nat'l Alcohol&amp;Drug Addiction Recovery Month. Together we can strengthen families&amp;communities &amp; beat addiction. Call: 800-662-HELP Recovery efforts in #Texas will be long term. If you were affected by #Harvey, apply for help &amp; resources at   https://t.co/V6WEmbQ356 Thank you @RedCross, @FEMA, 1st responders &amp; private citizens for helping people on the ground after devastation left by #HurricaneHarvey Thank you @GovAbbott @fema @uscoastguard @RedCross &amp; local officials for the briefing today on #HurricaneHarvey. We are with you #Texas! https://t.co/vX8sLhwrh1 I will travel with @POTUS tomorrow to lend my support to the people of #Texas. We are with you! RT @RedCross: #RedCross is providing shelter, meals &amp; comfort to people impacted by #Harvey. To find a location: https://t.co/sizEp51qtg or… For those living near the path of #HurricaneHarvey stay safe! Thoughts &amp; prayers of an entire country are with you. Thank you @ChelseaClinton - so  important to support all of our children in being themselves! \n#StopChildhoodBullying https://t.co/UCUpFc5ZjR RT @realDonaldTrump: We pray for our fallen heroes who died while serving our country in the @USNavy aboard the  #USSJohnSMcCain, and their… Exciting to watch the total eclipse with @potus today! #Eclipse2017 😎 https://t.co/85Y8R4yJU7 RT @realDonaldTrump: Thoughts &amp; prayers are w/ our @USNavy sailors aboard the #USSJohnSMcCain where search &amp; rescue efforts are underway. h… Thoughts and prayers to #Barcelona Our country encourages freedom of speech, but let's communicate w/o hate in our hearts. No good comes from violence. #Charlottesville Opioids are destroying our youth/people. Mtg w @Potus &amp; @SecPriceMD today to give my support to #STOPDRUGADDICTION https://t.co/aAjNNnu98n Thank you to all of our East wing interns for their dedication! The future is bright with these hard workers! https://t.co/teScGK8xUe Honored to lead US delegation to this year's 2017 Invictus Games in #Toronto #Canada @WeAreInvictus https://t.co/6y4j2CvVVS Thank you #Ohio! Great mtg American heroes at AMVETS Post 44 event &amp; thanks to all who came out to support @POTUS at rally! #MAGA 🇺🇸 https://t.co/MGNoFqKaqJ Thank you @EmmanuelMacron &amp; people of Paris for your kind hospitality - @potus &amp; I enjoyed our visit. #BastilleDay2017 #Paris #France https://t.co/1btuyihfEA Enjoyed my tour of #Paris on the Seine this afternoon. Thank you to Mrs. Macron for being such a gracious hostess. https://t.co/uzbR2dREww What a beautiful &amp; special visit to Notre-Dame Cathedral with First Lady Brigitte Macron. Blessings to all. https://t.co/Wa8YGxQecm Thank U @hospital_necker for allowing me to visit your wonderful patients &amp; inspirational staff. Continued prayers for good health for all. https://t.co/3keri8EUC4 My deepest sympathy to all of the military families who lost their loved ones in the Mississippi plane crash. Thoughts &amp; prayers for all. .@potus &amp; I enjoyed our visits to #Warsaw &amp; #Hamburg. A lot of work was accomplished, friendships made. Headed home! 🇺🇸 https://t.co/wJOCMMPdD0 My husband @potus &amp; I enjoyed a lovely evening w many great leaders. When countries work together, everyone prospers. #G20Summit #Hamburg https://t.co/gelBvOutbd Thinking of those hurt in #Hamburg protests. Hope everyone stay safe! #G20 Thank you for a warm welcome President Duda &amp; Mrs.Duda. Poland is a wonderful country with great spirit &amp; people! #Warsaw https://t.co/h5bRopgNOE Thank you Copernicus Science Center for the lovely tour. The children were brilliant &amp; kind! I enjoyed it very much. #Warsaw #Poland https://t.co/ah6P4l7cnO Thank you to the @USNavy Country Current &amp; @USArmy Down Range bands for performing at tonight's picnic to honor the military. #Happy4th https://t.co/hUjAlPUPrG .@POTUS &amp; I were honored to host members of military &amp; families for a picnic at the @whitehouse this evening.  #HappyIndependenceDay https://t.co/40XI2iuFzM #HappyIndependenceDay 🇺🇸\nWe are the land of the free because of the brave. Thank you to the heroes who serve! .@potus &amp; I had lovely evening hosting President Moon, his wife &amp; delegation for working dinner @WhiteHouse https://t.co/NmFJagVfxq Happy belated 3rd bday (yesterday) sweet Monty!  Thank you for visiting us at @WhiteHouse today! https://t.co/ZnENYjB7zE Welcome to the @WhiteHouse Prime Minister Modi! https://t.co/JEAgtlUQcw Looking forward to this evening's Congressional \"Picnic in the Park\" @Whitehouse ! https://t.co/7gpFxT1Oj8 Congrats @usedgov 2017 Presidential Scholars Program students!!  An honor to speak w some of our nation's most distinguished graduates. https://t.co/XeLw1I1C9v Enjoyed hosting Mrs. Varela of Panama @WhiteHouse for lunch today. I look forward to working alongside her in the future! https://t.co/lTxH2YpuR7 #HappyFathersDay @POTUS ❤️ Barron, @Potus and I enjoying beautiful Camp David! #family #sport #weekend https://t.co/K20G8YpkKm Congratulations to Justice Neil Gorsuch on today's official investiture ceremony! It was an honor to witness unforgettable moment! ❤️❤️❤️🇺🇸 https://t.co/TKGtMA4YnN Thank you to the first responders who rushed in to help protect those who were hurt in Alexandria, VA. My thoughts &amp; prayers to everyone! Looking forward to the memories we'll make in our new home! #Movingday https://t.co/R5DtdV1Hnv .Potus &amp; I paid personal tribute to #GoldStarFamilies tonight @WhiteHouse. Thank U to all the brave men&amp;women who have fought 4 our freedom! Thank you to everyone at @fordstheatre for tonight's performances!  @POTUS and I enjoyed the evening very much. .@POTUS &amp; I enjoyed hosting pre-gala reception at @WhiteHouse in honor of @Fordstheatre. RT @realDonaldTrump: Whatever the United States can do to help out in London and the U. K., we will be there - WE ARE WITH YOU. GOD BLESS! My thoughts &amp; prayers go out to the people in #Manila, #Philippines Today let's take time to remember those who have died so we may be free, and thank the brave men &amp; women who serve our country. #MemorialDay .@Potus &amp; I are heading home after a very successful first International trip. Thank you to all of the host nations for your hospitality! https://t.co/uWTgNgnA6O It has been an incredible trip, and great strides have been made. #G7Taormina #Italy https://t.co/9V6nkdtVF2 Gorgeous evening #G7Taormina #Italy #Potus&amp;Flotus https://t.co/vpDLHFFPB8 Thank you to the @usarmy 1-214th Aviation Regiment for getting me &amp; my staff to our mtgs safely! #G7 #Catania #Italy https://t.co/UtfjAKFBtC Thank you Mrs. Gentiloni &amp; Mayor Bianco for hosting me at Chierici Palace today. #Catania #G7 #Italy On my way to a lunch &amp; mtgs as part of #G7. Taormina ➡️ Catania #Italy https://t.co/xMJAcsZXgx .@POTUS &amp; I were happy to greet the families of those who work at the #American embassy in #Brussels. Thank u for your work on behalf USA! Wonderful tour of the @museummagrutte @fineartsbelgium as part of the official @NATO spouses program! #Brussels #Belgium Thank you @ChildFocusNL &amp; Queen Mathilde for the presentation yesterday. Let's all work together to combat child exploitation! #Belgium Thank u to Queen Fabiola University Hospital! Enjoyed creating paper flowers with amazing patients &amp; getting a tour. #Brussels #Belgium https://t.co/igeOaVSyf0 A little boy who I visited today &amp; had been waiting for a heart transplant will be receiving one! #Blessings #Faith https://t.co/DZU3ojxXVC Wonderful news after I visited @bambinogesu in Rome! ... Thank you @bambinogesu for the heroic work you do. I ask that everyone keep these amazing children in your thoughts &amp; prayers. https://t.co/UfVAc9lXv2 Today's visit with His Holiness Pope Francis @Pontifex is one I'll never forget. I was humbled by the honor. Blessings to all. https://t.co/NiomkFQqJb The @Potus &amp; I are looking forward to our visit w His Holiness Pope Francis @Pontifex. This promises to be a personal &amp; very special visit. Thank u @IsraeliPM &amp; Sara Netanyahu for your warm hospitality. Such a beautiful country with rich history &amp; wonderful people. #Israel https://t.co/nwQUGJi2mk My thoughts and prayers to the families of #Manchester. So enjoyed my visit to the Hadassah Medical Center w/Mrs.Netanyahu. The children had such open hearts, strong spirits &amp; inquisitive minds. https://t.co/G68BDHzEiD Today's visits to The Church of the Holy Sepulchre &amp; Western Wall w my husband @POTUS were very meaningful for me. Blessings to all. https://t.co/KU1SpxBKcJ .@PresidentRuvi &amp; Mrs. Nehama Rivkin Thank u for your gracious hospitality at the residence &amp; showing us your lovely gardens. #Israel What a wonderful visit to #Riyadh where I met amazing women &amp; children. Thank u to @KingSalman &amp; the people of #SaudiArabia. https://t.co/T9DTw8GnC0 When the international community comes together with shared ideas around peace &amp; prosperity, amazing things can happen. #RiyadhSaudiArabia https://t.co/oiLUbCmFCA Enjoyed talking to the incredible women working hard @GE_Saudi service center. Great strides being made towards the empowerment of women. https://t.co/bXdES83w3P Had the honor of visiting 1st all-women  process service center in #Riyadh, #SaudiArabia. Thanks to @GE_Saudi for the invite! https://t.co/qTloc4PtCJ I had a wonderful time with the students at the American International School #Riyadh today. #SaudiaArabia https://t.co/AVzVV0W9Dm Thank U American International School #Riyadh for hosting me today! Giving Intl perspective &amp; education to children is so important. https://t.co/U0ZIT4GKLi Thank you for a beautiful welcome to #Riyadh! #SaudiArabia https://t.co/BcrMR0OYSK .@Potus &amp; I are honored to light @WhiteHouse blue tonight, in honor #PeaceOfficersMemorialDay. Thank u to law enforcement for your service! https://t.co/dRHlt2l1rQ Happy Mother's Day! https://t.co/y7r4PZiwC5 I enjoyed hosting the mothers of those who serve in the U.S. military.  Thank you to all who sacrifice so much so that we can be free! https://t.co/k56KbSZk5C Self-guided tours in the @WhiteHouse now include movie theater! This house belongs to the people &amp; everyone deserves to enjoy its history! .@Potus and I celebrated 75th anniversary of Battle of the Coral Sea w/ Australia's Prime Minister Turnbull https://t.co/w0WyYfDP46 Enjoyed spending time with Congressional spouses at today's annual luncheon. I look forward to working with such an impressive group. https://t.co/XPvzOVAgB5 Wonderful opening ceremony today for the new Healing Garden @childrenshealth. It will play vital role in recovery of extraordinary patients. https://t.co/xybzYPkJYq .@POTUS and I hosted President Macri &amp; First Lady of Argentina @WhiteHouse today to further the partnership between our countries. https://t.co/dcPuYrUQwf Emotional moment @ National Teacher of the Year Award @WhiteHouse\nCongratulations to all wonderful teachers! https://t.co/THm2lD6oiU I was delighted to be the guest of honor @ Senate spouses luncheon. Thank you everyone for their kind words &amp; support. https://t.co/Uymq1OafPt Looking forward to today's Senate spouses luncheon at the National Gallery of Art. A wonderful group doing great things for our country! .@Potus and I visited brave men at Walter Reed Medical Center today. Thank you for your service! https://t.co/AAJbQkeH8h .@POTUS &amp; I are pleased to welcome visitor's @WhiteHouse #Spring garden tour.  We hope everyone enjoys exploring the beautiful grounds! Hope everyone had fun at today's #EasterEggRoll at @whitehouse. We enjoyed seeing all the kids enjoying themselves on the south lawn! https://t.co/w57gNVVB2i Our family truly enjoyed hosting today's #EasterEggRoll. Thank you to all of the volunteers who worked hard to make it a success. https://t.co/QsLWUlW8I5 Happy Easter! https://t.co/pzJ7ouViDZ Looking forward to hosting the annual Easter Egg Roll at the @WhiteHouse on Monday! https://t.co/nz7vucugx9 I had a wonderful time visiting @HomeSafeFla today! The young ladies I spoke with hold so much promise for the future. https://t.co/3W5i2Xpo5m Madame Peng and I visited Bak Middle School of the Arts. Thank you to all talented students for a wonderful performances! https://t.co/y2MVjGKuId Wonderful visit from the President of the People's Republic of #China, Xi Jinping &amp; Madame Peng Liyuan! https://t.co/xsZiFYztBu .Potus and I hosted our Heroes from the Wounded Warrior Project Soldier Ride in the @WhiteHouse today. 🇺🇸 https://t.co/TIgxmOEEVV Thank you students &amp; teachers at @ExcelAcademyPCS today! Had so much fun speaking w the girls in science class. Thank you for having me. https://t.co/T0PFTYWr9J I was honored to welcome Queen Rania of Jordan at the @WhiteHouse today.  I enjoyed spending the time speaking about our countries. Official Portrait of First Lady https://t.co/K1DUVE5kSI .POTUS &amp; FLOTUS\nFrom East Wing to West Wing  \n#fbf #MAGA https://t.co/UX9gdBDCwT .POTUS &amp; I were thrilled to stop by the Women's Empowerment Panel held at the @WhiteHouse today! https://t.co/OuE3DnUKtN We must continually reaffirm our American values as we join w the international community to make our world safer! \"I urge you to not be afraid to fail - as failure will never have the power to define you, as long as you learn from it.\" -@FLOTUS I was honored to share the stage with the amazing recipients of the IWOC awards! Thank u for your courage &amp; determination! #WomenOfCourage https://t.co/CWNeCOGWYf Thank you to the @marineband &amp; @theusarmyband for their wonderful performance at the @whitehouse this evening! https://t.co/ULhmVXEMlR .@POTUS and I enjoyed hosting members of the Senate &amp; guests this evening, along w @VP &amp; @SecondLady. Great conversation &amp; music. Celebrated #InternationalWomensDay in the White House with incredible women https://t.co/7l1I6pcdqf Honoring children #worldbookday @NYPhospital https://t.co/SsUNPPj7fH Thank you for welcoming me @ChildrensHealth. My prayers and thoughts are with all of the children and families. #GROWUPSTRONGER https://t.co/J8JoFTXniw Proud of supporting signing #closingthegendergap in #STEM \n#PowerOfTheFirstLady https://t.co/IboTzT8Aae It was an honor to spend yesterday afternoon @MountVernon with the @NatlGovsAssoc spouses. It was an honor to visit the Smithsonian National Museum of African American History @NMAAHC https://t.co/rai8keSoEN Thank you Mrs. Netanyahu for your friendship and dedication #PowerOfTheFirstLady https://t.co/IiUjtTglOu Applause to all women around the world who speak up, stand up and support other women! @emrata \n#PowerOfEveryWoman \n#PowerOfTheFirstLady We are responsible for empowering our next generation with values #powerofeverychild #Powerofthefirstlady https://t.co/L1FcuTNKwg Proud to share part of my family history with Mrs. Abe @BBTSchurch where @POTUS &amp; I were married, where we celebrate and we pray https://t.co/t6VfQIPHDV Thank you @morikamimuseum for the inspirational presentation of your sacred gardens &amp; life &amp; culture in Japan. https://t.co/JxfwaPjX06 I am deeply honored to serve this wonderful country as First Lady! https://t.co/tRTRVkDG6z"}