{"tweets": "https://t.co/dPBuAzyp1U Happy Diwali from us to you and your family. I hope we all find the light in us and may truth always triumph. 💜✨🙏 https://t.co/QupvcXjcMT https://t.co/XG8ao3iSaW But seriously, I just watched this film and it’s an eye-opener... helps you a great deal related to understanding fitness and beyond. \nIf you guys want to check it out, here’s the trailer : https://t.co/AxZlxJZU3r\nLove and light always ! Since I turned vegetarian, the question I’m asked the most is ‘Where do you get your protein from?’. The film, The Game Changers on Netflix is my answer to all those questions forever 😂 . https://t.co/CrQfW6uayS .@VOGUEIndia https://t.co/I4ZdNEqhWg https://t.co/HmEjEQsrLi Just casually fixing my hair https://t.co/ZCPLQpbb4e 🕴🏻🕴🏻🕴🏻 https://t.co/8JJE9GCwDH Can't hear the haters👂🏻😉😜 https://t.co/lIPAq5jTyI सूटेड और बुटेड https://t.co/VMjSRgKbmN 👔 https://t.co/adBK9ll7lw We are grateful that people like her exist in this world. And kudos to KBC for highlighting such amazing people on the show. @SrBachchan The incidents and the dirty realities that a crusader like @sunita_krishnan brought to light on the KBC episode are so shocking and hurtful. She has done and is doing such incredible work in rescuing women and young girls as little as 3 years old from sex trafficking. My partner for lifetime &amp; beyond  and my fasting partner for the day 🥰 \nHappy karvachauth to all 🌝💜 https://t.co/gslOUMKPIn https://t.co/BVmilJvGgU https://t.co/npZlWqHnVg https://t.co/wMR17RBKrt Even though I couldn’t make it for the launch, I wish the entire team of #MAMI @MumbaiFilmFest the best for their 21st year. This edition is going to be a cracker for all cinephiles , a true celebration of cinema . Happy Birthday @SrBachchan. Thank you for being you and being this fabulous and amazing and such an icon to look upto. You are a true, true legend.🙏 https://t.co/1cR0TUqVYY Congratulations @MangteC for your 8th medal and qualifying for the semi finals at the Women's World Boxing Championships in Russia.\nYour passion &amp; dedication for the sport is just inspiring, motivating and very encouraging for everyone. Here’s to many more milestones. 🙏🏻🥊 “Like a shadow, I am and I am not” - Rumi https://t.co/fz1tIquOIP ‘Hand’le with Care https://t.co/scSvFfbRJG 🌓 https://t.co/h1F1585OVD Happy Dussehra 🙏🏻 Let’s celebrate the triumph and the spirit of goodness ! May this auspicious day bring joy and prosperity to you and your family. RT @swachhbharat: The journey of 130 crore people in creating the world's largest behaviour change Jan Andolan, with one powerful war cry -… Who said grey isn’t a happy colour ?! https://t.co/p3y8XfkBGD Why pick one? #FickleIsFun. BTS shenanigans with @LavieWorld #LaviexAnushka https://t.co/VAHxaA12zD It's time to splurge on some of the best deals. @LavieWorld #fickleisfun #LaviexAnushka #TheBigBillionDays https://t.co/nnzvC2qbLD 💜 \n@sportshonours https://t.co/StqD8sue5W 💜 \n@sportshonours https://t.co/IABVGAdzJO 💜 \n@sportshonours https://t.co/9cWDopX3Fo 💞 https://t.co/hzlxH71SXA 💞 https://t.co/eyM32TyQ0q 💞 https://t.co/CJGxb7hRpH Congratulations sir @SrBachchan on being graced with the #DadaSahebPhalkeAward. You embody inspiration, grace, humility and all things genius. It is truly an honour to have witnessed your work and seen you shine in all your glory. 🙏👏 🚫 https://t.co/6zvFpsWwFG Hear her speak. Think about what she’s saying. Climate. Change. Is. Real. @GretaThunberg https://t.co/Y0afNNfvjp 🆘 https://t.co/8aoEKtfNcP 🐼 https://t.co/KUshXFPCrZ 🐼 https://t.co/9OhjDLRlgM 🐼 https://t.co/loSWMbzWpT Laugh so loud that you can’t see the eyes 🤭😚 https://t.co/TqEPKwcudH Everyone’s expression over the weekend 🤭 https://t.co/a49pvpBY9p No ! I wasn't yawning at work . Obviously not 🤭😉😘 https://t.co/2CyuIK8FyX लिटिल मी https://t.co/ZThTBv8BeZ लिटिल मी https://t.co/BKc1D7iRDC लिटिल मी https://t.co/VVA6P8wWsW 📣 NUSH AUTUMN WINTER COLLECTION 2019 COMING SOOOON ! 📣\n@NushBrand https://t.co/Cf5gHzCTc7 📣 NUSH AUTUMN WINTER COLLECTION 2019 COMING SOOOON ! 📣\n@NushBrand https://t.co/j6RKV1OHFJ 📣 NUSH AUTUMN WINTER COLLECTION 2019 COMING SOOOON ! 📣\n@NushBrand https://t.co/X2dpHWs9ae वॉटर बेबी 🌊 https://t.co/GV4j9QtxXa वॉटर बेबी 🌊 https://t.co/lFUmex8XdZ वॉटर बेबी 🌊 https://t.co/9IRmuogSf2 These are only steps forward and not backward and we as a nation stand by , celebrate and are very proud of our scientists at @isro for their perseverance and achievements so far . You all are truly inspiring. My dad always told me two things- do the right thing always &amp; have compassion in your heart no matter the circumstances. It takes special substance to be compassionate. This world is a circle of life.What goes around comes right back around. #HappyTweets #LoveAndLightProject💜&amp;✨ https://t.co/q2rYoHH9Ui Got them food cravings? Get deals on deals with your @StanChartIN DigiSmart credit card on food, travel, entertainment and much more! Get yours now : https://t.co/4tGC2yhgat #StandardChartered #LiveOnline https://t.co/j3NvclyJNR It’s raining deals with @StanChartIN DigiSmart credit card!\n\nNow get deals anytime any day on fashion, food, travel, groceries and more! Get yours now https://t.co/4tGC2yhgat\n\n#StandardChartered #LiveOnline https://t.co/iXyUWhyQMv The Kerovit TVC is action, drama and entertainment packed… Check it out and share your crazy bathroom moves along with me…\nWatch the TVC here.\n#KerovitIsFreedom #KerovitByKajaria @KerovitIndia https://t.co/PbVdtLXmuI #LoveAndLightProject 💜&amp;✨ https://t.co/BlWKM66vY0 Chat . Chat . Laugh . Laugh . Make faces . Crack up . Pause . Check mirror . Chat. Chat . Make faces . Laugh . Laugh . Loud . Love . What . You . Do . #LoveAndLightProject 💜 &amp; ✨\n#WorkLoveGratitude https://t.co/RwLGeIdtwf In a world where you can be anything , be kind. 💜&amp;✨ #LoveAndLightProject @NushBrand https://t.co/Zs01KHOzH6 First Indian to win gold at the #BWFWorldChampionships2019... @Pvsindhu1 what a terrific performance! Congratulations.. you go girl ❤ Sometimes it really is so simple ... 💜 &amp;✨ \n#LoveAndLightProject https://t.co/PrSEwdLbB7 Time for some internet positivity rn. ✨🌼 #HappyTweets #LoveAndLightProject https://t.co/6ZUxXavrQT Sun kissed &amp; blessed 🧡⛱️ https://t.co/mDnMeGnF4L India sprinted towards the gold at Athleticky Mitink Reiter event in Czech Republic. Congratulations @HimaDas8 and #MohammadAnas on the victory. To celebrating the independence of the largest democracy in the world. Happy Independence Day to all my fellow Indians 🙏🏻🇮🇳 This #IndependenceDay you've got the freedom to go crazy shopping! 🤩 Get FLAT 60% off on all styles with the #NUSH Independence Day Sale from 13th-17th August only on https://t.co/9fRUsKRtPU 😎 @NushBrand https://t.co/U9My2wh1bd The POCSO Amendment Bill was an absolutely necessary step in the right direction. Putting children’s safety in the absolute forefront should not be an option but a priority. Saddened to hear about the sudden demise of Sushma Swaraj ji . May her soul rest in peace 🙏 I hope and wish and urge justice is brought upon this atrocity at the earliest . And punishment so severe that anyone else shudders to commit such a heinous , demonic crime ! (2/2) A 3 year old girl who was sleeping besides her mother at a railway station was kidnapped, gangraped and beheaded in Jamshedpur. This is so inhuman and vile, it is literally making me shake in anger. Absolutely horrifying. (1/2) ✨✨✨ https://t.co/nRE7lfpOHm RT @aliaa08: People for the Ethical Treatment of Animals (PETA): Stray dog beaten ruthlessly in a society in Worli, Mumbai for sheltering h… @filmfare https://t.co/3t6LbwEpXU @filmfare https://t.co/YgzE7QyNwF 🙏☺ https://t.co/UBz8sk3nNC @filmfare https://t.co/74QAIvLng3 Sapne aur pyaar, dono hi size dekh kar nahi kiye jaate. Watch me as Aafia and catch Bauua and Aafia’s romantic journey in the World TV Premiere of ZERO, tonight at 8 PM, only on @zeecinema\n\n#ZeroOn28July #SeeneMeinCinema @iamsrk #KatrinaKaif @RedChilliesEnt @cypplOfficial https://t.co/jcTGPjMKX6 https://t.co/QYpCRx2hOi https://t.co/xg5GyIHItK https://t.co/DxMGW6cWsY A salute, homage, respect and gratitude to all the heroes in our armed forces who lost their lives in line of service for their country. 🙏🏻#KargilVijayDiwas #NeverForget #RememberTheGallantry Over a billion dreams rocketing to the moon! And it is so empowering and inspiring to see 2 women helm the project. Ritu Karidhal and Muthayya Vanitha are nothing short of superwomen! A salute to their entire team. @isro #Chandrayaan2 Thank you &amp; I am a big time fan of YOU 😘 https://t.co/wlVCSRGZeG 19 days - 5 gold medals - 1 golden girl ! Congratulations @HimaDas8 ! You are an exemplary example of solid grit &amp; determination &amp; a huge inspiration to young girls  👏💪❤ Seal the silly moments ❣️ https://t.co/9fkX54OsIa Happy girls are the prettiest - Audrey Hepburn 🦋 https://t.co/Tkn4jiH9g1 Shining ✨ https://t.co/1k1bn6MCLN It's time to shop! The @myntra End Of Reason Sale has started and all your favourite brands are up to 50-80% off! So, ‘Add to Cart’ 🛒 and… Happy Shopping !🛍   . \n#MyntraEndOfReasonSale #MyntraEORSisLive #TooBigToMiss \nLink - https://t.co/P0XO6lzibW https://t.co/9n1Nug6mA3 Thank you for teaching me to always do the right thing no matter how hard it is or what the consequences may be... \nLove you Papa ❤ #MyHeroForever (2/2) From taking silly selfies like these to letting me make ponytails in your hair (while you still had them 😉) ... You are the coolest dad a girl can have and are THE best inspiration . (1/2) https://t.co/zaafly1XCI RT @yrf: #SuiDhaagaMadeInIndia is the only Indian film to compete at the Shanghai International Film Festival - Belt and Road Film Week | #… @AnupamPKher @imVkohli Thank you sir ... It was a pleasure meeting you today . More power to your talent 🙏😊 Eye Test 👀 https://t.co/ZyI4far1PB Thank you for the memories @YUVSTRONG12 . You've been a warrior and inspiration to so many. I wish you the best in the next inning of your life 🌟🌟🌟 It's sickening to read about the horrific way in which an innocent life was denied the right to live by an inhuman , monstrous act ! My deepest prayers are with the grieving family . What has this world become !! Fashion’s come with a purpose! So pleased to join hands with @aliaa08 to share my wardrobe with you all and making my contribution towards a sustainable environment. This one is close to my heart! All proceeds will go towards animal welfare, so shop till you drop girls 😘❤👗 https://t.co/UZTNsfMg7Y To peace, happiness, prosperity and joy to you and your families. Eid Mubarak Spec-tacular 😎 https://t.co/9CeHDRdsRG Take a moment to stop and smell the flowers 🌸 https://t.co/Ve2UFMfc7J Rounded up the cheer-team with @Sukhbir_Singer on a #GoogleDuo group call when @imVkohli was feeling homesick :) 💃 https://t.co/u0WaFfYnWc Congratulations @narendramodi ji. India is looking to scale newer heights of growth and success under your leadership. Gritty, gripping and real. Well done team #IndiasMostWanted for backing the story of our unsung heroes. @arjunk26 you were amazing in the film! All the best to the entire team @foxstarhindi @rajkumar_rkg. Go watch! 🍭 https://t.co/VJuidBlL8i Happy be, happy do . 🙃🙃 https://t.co/ai0SqY6FUG Fashion is super personal to me and I'm sure it’s the same with you all too.. Happy to be associated with @myntra … #GoMyntraLaLa ☺ https://t.co/eRLWo62AO1 Maa ❤🥰❤ https://t.co/FikrwQjy46 Thank you to everyone for the wishes. You made my day special with your love and warmth. Your continuous support makes me so so grateful for this life 🙏❣🥰 Go Vote ...🙏🏻 https://t.co/BVkdc7fY18 With #GoogleDuo, I can always pull his leg from wherever I am ;) @imVkohli https://t.co/NJA2hA6WrK This #EarthDay , it is important for us all to remember that the Earth belongs as much to all the other species as much as it does to us human beings. Let coexistence be our motto. Let them thrive. Let them live. Let our Mother Earth flourish. Our hearts go out to everyone affected by this tragic act of violence in Sri Lanka. We are praying with you in this painful moment of sorrow, grief and shock. RT @NushBrand: The #NUSH Sale is here! 🥳 Buy one, get the second one at 50% off! Visit https://t.co/Zq9IUPrNgZ  &amp; stock up on your favourit… 🎬.... and action ! https://t.co/OyqP6bw4hV 🐝 https://t.co/lUO0rDjqoQ 🐝 https://t.co/49kwsMP1Ik 🐝 https://t.co/KhdAdBcVs8 https://t.co/AR2S4NmRjN https://t.co/NDkylntk1y https://t.co/DWZN9eV66z RT @NushBrand: Your favourite #NUSH styles are now available at a new destination - @mykoovs 😎 Shop now - https://t.co/5nVlKEyGSl  | @Anush… We must all exercise our right to vote. Let us join hands and celebrate this glorious democracy. \nGo vote! Empower yourself and this country. https://t.co/CGCEMNKgod RT @NushBrand: All things bright and colourful 🌞 Bring on the summer feels with the #NushSS19 Collection! Available now at @shoppersstop ,… https://t.co/tEonvNxds1 https://t.co/uuwvccPAzj https://t.co/W4xu0x5SDo https://t.co/TpLb5SKN3N https://t.co/DRRGlQKJWo Popsicle pinks, bright blues &amp; sunshine yellows are here 😎 Welcome this summer with the #NushSS19 Collection! ☀ Get all the latest styles at @shoppersstop, @myntra, @jabongIndia, @AmazonFashionIn &amp; https://t.co/9fRUsKRtPU https://t.co/dFs6EeW2kr 🎥💑🌼 @VOGUEIndia @Anaita_Adajania https://t.co/E5CQvc7y45 The entire nation welcomes you home Abhinandan. You are a true Hero. 🇮🇳 It is extremely painful to read about the attack on our brave #CRPF jawans in #Pulwama. My deepest condolences to the families and loved ones of our martyred soldiers. RT @NushBrand: Celebrate #ValentinesDay with #NUSH ❤ \nShop for the #NushForLove Collection on https://t.co/J2mcFOmO2Y &amp; use code #NUSHFORLO… All you need is love 💕🌈 Celebrate it with the limited edition #NushForLove collection OUT NOW only on https://t.co/w4D4wez0JR\n\n| Avail Flat 30% Off on this collection using the code #NushForLove, valid only till tomorrow midnight. | Charity partner @Naz_Foundation | @NushBrand https://t.co/h7zXylEd8H OMG YES!!  😲 I've been looking for you and the remaining 5 of our dopplegangers all my life 😂 https://t.co/SaYbclXyXt Best friend forever ❤️ https://t.co/7YCskHYydl You're only always one breath away from Bliss ... ☺️💏💜 https://t.co/jMc4z6VsnC To always respecting our independence, freedom, rights and celebrating virtues of peace and humanity. Happy Republic Day 🇮🇳 Moving at the pace of nature ... 💛👒🌞 https://t.co/zplspixvE0 RT @NushBrand: Love is all we need! #NushForLove coming soon, this February. | @AnushkaSharma https://t.co/IZPGWocOML No filters needed #NewZealand 🥰 https://t.co/uVwt9sLL6c Beautiful sunny day at tennis with this beautiful sunny boy ❤️ #AustralianOpen #ausopen https://t.co/8yj9ztjprH What an unforgettable &amp; outstanding tour it's been !! Happy to have witnessed the historic victories by the men 👏 🙏 👏 HUGE congratulations 🇮🇳 And so proud of you my love @imVkohli ❤️ 😁 https://t.co/QdAdN9OFaz There is nothing but gratitude to the men and women in uniform, the veterans and their families who have kept our nation safe and have put the country before themselves. Jai Hind 🇮🇳🙏🏻 #ArmyDay Let goodness shine ! ✨✨✨ #AchchaiKiChamak @DS_SilverPearls   #RajnigandhaPearls https://t.co/JsoxvvA6iI Days like these ❤️🥰 https://t.co/Tmh2dCPH3o Life partners se business partners tak… this story is all heart. Dekhiye #SuiDhaagaMadeInIndia @PrimeVideoIN par. \nStream Now: https://t.co/XXr6zKprWN @yrf @Varun_dvn https://t.co/NQ8VpeCPeV Congratulations @MangteC !🥊🥊 🥊 World No. 1⃣ ... Take a bow ! Bring on your shopping carts🛒 #NUSH collection is now available at one more destination - @AmazonFashionIn. Shop now - https://t.co/4asVt2H5s8 @NushBrand https://t.co/7O3TTc3Sl5 Happy face 😀 ✈️ \n#workmode #canberra https://t.co/4kdNc6Bvtb it takes undying perseverance &amp; solid conviction to focus on what’s important and shut out the rest .🇮🇳🙏 So so happy and proud of you my love @imVkohli ❤ (2/2) https://t.co/6O9y8ilYYy They came. They conquered !!\nHistory written and created by this bunch !!\nHuge congratulations to all players, coaching unit and support staff ; (1/2) https://t.co/lm3vnagjeb You make me such a happy girl 💜 https://t.co/9n6r3AnV2z Hope you all wake up to the new year filled with hope ,  peace and compassion ... May we all strive to be kinder to one another and illuminate the light and beauty that resides within 💫 ... A very happy new year from us to you 💗 https://t.co/H4TDuZM3Db In the company of these fantastically talented ladies 😁https://t.co/MBDUzEdXP3\n #RaniMukerji #Tabu @deepikapadukone @aliaa08 @taapsee\n@RajeevMasand A merry merry christmas to everyone ! To happiness and good cheer always 🎄💗✨ RT @RajeevMasand: Not sure it can get any better than this! Here’s a glimpse of The Actresses Roundtable 2018 with #RaniMukerji @deepikapad… ▫️◽⬜ https://t.co/JQmIftWFab ▫️◽⬜ https://t.co/AKIomlphwB ▫️◽⬜ https://t.co/yBoAvzDjHV RT @NushBrand: The shopping season has begun🛒 Get your hands on all your favourite #NUSH outfits at #MyntraEndOfReasonSale right now on htt… 🖤 https://t.co/mneD6X5Iwr 🖤 https://t.co/IA6eMmPy1j Mamta always believed in strong partnerships. No wonder Mamta and her camaraderie with Mauji made ‘Sui Dhaaga’ the ‘Business Story of The Year’.   \nWatch me as Mamta during the World Television Premiere of #SuiDhaagaOnSonyMAX tonight at 8 PM. @SonyMAX https://t.co/82Xwcfe8DJ Watch it with your family and friends! #ZeroDay\nBook your tickets now: https://t.co/V9It3WZ9mH \n\n@iamsrk #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial https://t.co/pEuT2TUvLw https://t.co/4sraAjnUHX https://t.co/SmqtQX4XfR https://t.co/Ap0APDbkoJ https://t.co/XDjbunjIaE Iss mohabbat mein hum kahan se kahan aa gaye .. \n#ZeroTomorrow\n\nBook your tickets now: https://t.co/tFXRzAvEaP\n@iamsrk #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial https://t.co/7Tjd1Pp5mp RT @RedChilliesEnt: Sitaaron ke toh naseeb mein hi hai tootna.\nWatch #HeerBadnaam here: https://t.co/57xEzdI628\n#ZeroTomorrow\n\n#KatrinaKaif… 👭 #KatrinaKaif https://t.co/Zur7GMLlk1 Naye dost banana koi Bauua se seekhe! Aa rahe ho na inn se dosti karne?\n#2DaysToZero\n\nBook your tickets now: https://t.co/tFXRzAvEaP\n@iamsrk #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial https://t.co/qLFDHoLiIC https://t.co/LfvyL0qXQ2 RT @bookmyshow: This Christmas, @iamsrk arrives to win your hearts as the charming @BauuaSingh along with the nation's beloved leading ladi… All in one frame 🌟#ZeroPromotions @iamsrk #KatrinaKaif @aanandlrai https://t.co/GaD9xus4Cs Well played @Pvsindhu1 👏🏻 Congratulations on becoming the first Indian to win the #BWFWorldTourFinals! 🌟 Natkhat raho, raho nadaan, chidkaayein tum par sab yun hi apni jaan! Happy birthday @BauuaSingh ! #BauuaKaBirthday https://t.co/5f0GHexbZA Jo bhi mile, saath le aana. Bauua, Aafia aur Babita se milne zaroor aana! Book your tickets for Zero today!\n#BookingsOpenForZero : https://t.co/V9It3XgKLh \n\n#5DaysToZero\n@iamsrk #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial https://t.co/WGoVPke41L RT @iamsrk: Itni mushkil se saath aaye hain, aise thodi na jaane denge! #6DaysToZero\nNew dialogue promo: \nhttps://t.co/kZA1gjVmpq\n\n#Katrina… RT @RedChilliesEnt: Aadhi sawaari mat samajhna, poora toofaan hai!\n#1WeekToZero\nhttps://t.co/u7YDgTRnT7\n\n@iamsrk @AnushkaSharma #KatrinaKai… In the digital age, holding physical prints feels special...  With my Fujifilm Instax Mini 9, I've captured happiness forever in my Book of Joy ! @fujifilm_india #instaxicated #makememorieswithinstax #fujifilm #instax https://t.co/diuGgWhuH7 From where it all began! A movie that changed my life ... #10YearsOfRabNeBanaDiJodi @iamsrk #AdityaChopra https://t.co/VMUFkJk7QL Aa gayi hai Babita Kumari lehraane apna #HusnParcham! Song out now \n\nhttps://t.co/F4SCtpXuWm\n\n#KatrinaKaif @iamsrk @aanandlrai @Mdzeeshanayyub @BoscoMartis @AjayAtulOnline @Irshad_Kamil @TSeries @RedChilliesEnt @cypplOfficial It's heaven, when you don't sense time passing by ... It's heaven, when you marry a good 'man' ... 💞 https://t.co/bvZc2x62NM #8YearsOfBandBaajaBaaraat 💥🌈🌝\n@RanveerOfficial #ManeeshSharma https://t.co/FXPFyQdYqZ #HusnParcham... on December 12th!\nhttps://t.co/W75wlouDck\n#KatrinaKaif @iamsrk @aanandlrai @ajayatulonline @irshad_kamil @Mdzeeshanayyub @BoscoMartis @RedChilliesEnt @CypplOfficial @tseries https://t.co/OMjpaCPRJz When I was asked to wear a nightsuit for the entire song, I thought it was going to be super comfortable! Then they brought out the water and the colors! #MereNaamTu’s making ➡️ : https://t.co/T7abZpzerB\n#2WeeksToZero\n@iamsrk @aanandlrai @RedChilliesEnt @cypplOfficial @TSeries @nowme_datta 😂 Winter chillin' 😎\nStock up on all your favourite #NUSH looks, available at @shoppersstop, @myntra - https://t.co/1hSfEVjoQZ, @JabongIndia &amp; https://t.co/9fRUsL94Hs  @NushBrand https://t.co/5OxmTYB7gl ✨ https://t.co/3T8Hy8qrdZ Dekhti reh gayi duniya, isne pyar mein aisi baazi chala di.Ishq karte hai sab hi,isne Issaqbaazi kar di #IssaqbaaziOutNow \nhttps://t.co/HA6yG0w4JX\n@iamsrk @BeingSalmanKhan #KatrinaKaif @aanandlrai @AjayAtulOnline @Irshad_Kamil #SukhwinderSingh @aslidivyakumar @TSeries @remodsouza Kaise rakhe koi Bauua se naraazi,\njab iss tarah karta hai ye #Issaqbaazi .\nSong out tomorrow! Stay tuned!\n\n@iamsrk @BeingSalmanKhan #KatrinaKaif @aanandlrai @AjayAtulOnline @Irshad_Kamil @RedChilliesEnt @cypplOfficial @TSeries https://t.co/H429sCKgtg https://t.co/BMf84Z9TOF RT @NushBrand: Walk into every day with panache! Find all your favourite #NUSH styles at @shoppersstop , @myntra - https://t.co/b2R4COcRDo,… 🖤 https://t.co/kVlgI0Wvgn #ZeroPromotions https://t.co/gXmKCqXEsS 🌟 @arrahman @aanandlrai #ZeroPromotions https://t.co/hMSCTY4Vpw Congratulations Champ!! So proud to see you creating history 👏🏻👏🏻👏🏻 @MangteC you are a wonderwoman !\n#MaryKom RT @RedChilliesEnt: Thank you for all the love pouring in for #MereNaamTu. Keep watching!\n#MereNaamTu18MnYT\n\n@iamsrk @AnushkaSharma #Katrin… RT @NushBrand: Today is the day to amp up your style quotient with #NUSH. Visit @shoppersstop, Malad to have a fun evening filled with a st… Dekha nahi toh nazar mein aane ke liye itna taam jhaam lekar aaya hai! Jaisa bhi hai, kuch alag toh hai ye @BauuaSingh ! #MereNaamTu\nhttps://t.co/57HNK3uCKm  \n@iamsrk #KatrinaKaif @aanandlrai @AjayAtulOnline @Irshad_Kamil @RedChilliesEnt @cypplOfficial @TSeries Jitna ye poora hai uss se lamba toh Aafia Yusufzai Bhinder ka naam hai, phir bhi mujhe kehta hai tu mere naam hai. #MereNaamTu, coming out tomorrow!\n@iamsrk #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial https://t.co/3K0tyZgjcp RT @BauuaSingh: Ab se theek ek mahina reh gaya hai inki dukaan ke bane meethe ko, aap ki zubaan tak pahunchne mein :) \n21st December Zero r… Winter ready ❄ Shop for this #NUSH jacket at @shoppersstop, @myntra - https://t.co/1hSfEVB0fz, @JabongIndia &amp; https://t.co/9fRUsKRtPU @NushBrand https://t.co/xdXJ3S4sve Cute nahi hai, guitar bhi nahi bajaata aur poora gawaar hai, par jaisa bhi hai, pyaara bohot hai ye @BauuaSingh! Watch #ZeroPromo now: https://t.co/WHwO4N0HMv\n\n@iamsrk #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial Stay your wonderful, quirky, sorted self always... Happy happy birthday @RajkumarHirani 🤗💛 https://t.co/pqS3bUurcr Eternity &amp; Beyond ✨\n#MadameTussaudsSingapore https://t.co/vZbwLwd1kO 🤩 \n#MadameTussaudsSingapore https://t.co/7nxYD9VsF8 Wishing you both a world of happiness and a beautiful journey together. May the love &amp; respect you have in each other, grow leaps and bounds. And welcome to the club 😁💜👫@RanveerOfficial @deepikapadukone RT @NushBrand: You'll run out of occasions, but not out of styles 😉 Get this look &amp; more with the #NUSH AW Collection! Available at @shoppe… A film that has immense soul, love, joy and happiness. To be directed by Yashji was nothing short of sheer magic. @iamsrk and #KatrinaKaif, you guys are as warm and amazing as everrr! Lots of love and a big 🤗 to you! #6YearsOfJabTakHaiJaan https://t.co/TV5jYX5SHP 🍭 https://t.co/7dvzRl75ca RT @AnimalPlanetIn: . @AnushkaSharma joins hands with Discovery for #ProjectCAT with @WWF Tigers are in real danger of getting extinct and… Happy Diwali from our home  ✨ May you all find the light in you this Diwali .... 🕉✨🙏 https://t.co/B6i4EBzWKI Happy Diwali to all . Hope you all find the light in you . Be happy , be kind, be safe . ✨🙏💜 https://t.co/X1TmaWSpa6 Big thank you to everyone who has seen and loved the trailer! \n#ZeroTrailer100MnViews\n@iamsrk #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial https://t.co/EuUfjdHaXi 😍🐶 @ELLEINDIA https://t.co/DJt4yVrswN Sach kab tak chhup sakta hain. Jaaniye abhi 😜 \n@iamsrk #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial #ZeroKaSach https://t.co/hrYcC7wo5b Thank God for his birth 😁🙏❤✨ https://t.co/SzeodVBzum Capturing festive vibes with my Fujifilm Instax SQUARE SQ10 - hybrid instant camera.\nClick it. See it. Save it. Filter It. Print It. \nOld world charm with a modern take.. ! @Fujifilm_India \n#instaxicated #makememorieswithinstax #fujifilm #instax #selectandprint https://t.co/uvirYZwvNI So much love for the #ZeroTrailer ! Thank you so much 🙏🏻😃😃\n@iamsrk #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial https://t.co/9Ery9HQIMp https://t.co/NEcALmRvOV Just this doggo and me hanging with @ELLEINDIA. No biggie https://t.co/B9Ye2nl5QA RT @RedChilliesEnt: 54 Million in 24 hours! Thank you so much for watching and loving the trailer! @iamsrk @AnushkaSharma #KatrinaKaif @aan… Overwhelmed with the response on the trailer.. Thank you for all the love! 💫😃#ZeroTrailer @iamsrk #KatrinaKaif @aanandlrai \nhttps://t.co/9Ery9I8kaZ 🌹💫 @ELLEINDIA https://t.co/RFZ8ooTypG Laugh and Shine ✨✨ #KatrinaKaif https://t.co/xIo9JLhsXz Hamaare mukaam pe aana kahaan aasaan tha, par 4 foot 2 inch ka Bauua baraabari kar gaya.\n#ZeroTrailer out now - https://t.co/9Ery9I8kaZ\n@iamsrk #KatrinaKaif @aanandlrai @RedChilliesEnt @cypplOfficial Happy happy happiessstt to the most amazing &amp; charismatic actor I’ve had the pleasure of working with! Hope you continue to dazzle and inspire us with your drive and passion for years to come💝💫 @iamsrk https://t.co/ep5LLc3bFj RT @NushBrand: Let your style speak for you 😎 Get this #NUSH top at @shoppersstop , @myntra - https://t.co/J28p99tvis , @JabongIndia &amp; http… Dekhiye toh zara! Abhi tak haan naa kuch bhi nahi bola hai isey, aur phir bhi kitna khush lag raha hai🤔 \nWaise jodi buri nahi hai :) kya kehte ho?\n#ZeroPoster @iamsrk @aanandlrai #KatrinaKaif @RedChilliesEnt @cypplOfficial https://t.co/2p2WfMEG59 Alizeh..... she’s been and will be one of my most favourite characters .. A big 🤗 and thank you to @karanjohar ... You have been so much fun to work with.. #AishwaryaRaiBachchan... you are all ❤. And working with #RanbirKapoor is always a mad ride... #2YearsOfADHM https://t.co/JJGi3MjIi7 My moon , my sun , my star , my everything 🥰\nHappy karva chauth to all 🌕🎉 https://t.co/7saMNS6jdy Log on to @NetflixIndia and watch the story of #Sanju unfold! #RanbirKapoor @RajkumarHirani @sonamakapoor @deespeak @vickykaushal09 @SirPareshRawal @mkoirala हमेशा 😊😊🙏🏻 https://t.co/XxhGf3Pnfe बचपन✨❤️ \nPS - Our reaction to the photographer when he said cheese.......was this 😂😂\nthanks #NaimeeshaMurthy for this memory ❤️❤️❤️ #FlashbackFriday https://t.co/yx1z06IU8Q Let the festive shopping begin! Stock up on #NUSH AW18 Collection by availing special Diwali offers at @shoppersstop.\n@NushBrand https://t.co/rozqAgSSUP Hues-day done right with #NUSH 😎 Shop for this dress at @shoppersstop, @myntra - https://t.co/1hSfEVB0fz, @jabongindia &amp; https://t.co/9fRUsKRtPU \n@NushBrand https://t.co/RtMCAfGklY Just look at this gorge face 🥰😍 https://t.co/bCl9f7hWFv It is so disturbing and shocking to hear about the Amritsar train tragedy.. Prayers and strength to the families and loved ones of the people affected by the disastrous accident. This is just heartbreaking. To the ones who make it all happen. My gratitude and love always ❤❤❤ #MakeMemoriesWithInstax #FujiFilm #Instaxicated @Fujifilm_India https://t.co/uLMKIZmg5H Wishing everyone abundant happiness and prosperity , lots of positivity and joy this Dussehra.. ! 🌼💫 Collect all the best #NUSH styles at @myntra's Big Fashion Days sale &amp; add it to your cart right now on https://t.co/1hSfEVB0fz @NushBrand https://t.co/D6EJyyXxgi It’s the festive season .. which means time to shop eat and have some fun ! And with @StanChartIN get Unlimited Cashback of 1% assured on your credit card spends... with no max. cashback limit too! So... Swipe away #TheUnlimitedLife https://t.co/TaDOx0jfIx https://t.co/omkDeaEKnp Orange or Grey? @LavieWorld’s left me confused... tell me below which look you like the best? Buy the #LavieXAnushka collection at great prices during the Big Billion Days.\n #TheBigBillionDays #fickleisfun https://t.co/KyhRWSHI57 Happy NUSHing to you @NushBrand https://t.co/MrJvSbYxiq “Very little grows on jagged rock. Be grounded. Be crumbled, so wildflowers will come up where you are.” - Rumi 🌸🌸🌸 https://t.co/oaVGgVIO6A 🌺🌺🌺 https://t.co/cKPAGRwBus This #GandhiJayanti, we salute the teachings of the man who's truly Made in India. Let's celebrate his spirit with #SuiDhaagaMadeInIndia. @Varun_dvn @yrf  @SuiDhaagaFilm https://t.co/wxdSvYeQGn Hey Faridoon ! Thank you  🙏😊🌺 https://t.co/zEsHsyzfl2 🌹🌺🌹🌺 @GraziaIndia https://t.co/NoqBPzJRhH 👌🏻👏🏻😃🙏🏻 #SuiDhaaga\n@Varun_dvn @yrf @SuiDhaagaFilm @Sharatkatariya #ManeeshSharma https://t.co/YvZX1w7K1c Thank you Bhumi 🙏💜 https://t.co/8jFnZZc3kE 💜🙏 https://t.co/QUZ5nYLLSX Thank you sir 🙏 https://t.co/mVwHPKOQTr RT @MissMalini: .@Varun_dvn and @AnushkaSharma's Mauji and Mamta are going to become iconic Bollywood characters for sure! #SuiDhaaga - @pa… Thank you Karan 😁💜🙏 https://t.co/dtDqMbQWTL RT @karanjohar: Congratulations to #ManeeshSharma #SharatKatariya @yrf for this lovely film! #SuiDhaagaMadeInIndia is a film for every fami… बोहत धन्यवाद ,🙏 https://t.co/CUOgxkxfHz RT @SuiDhaagaFilm: Thank you for all the love🙏 Enjoy this \"Made in India\" story at a cinema near you. Grab your tickets here - https://t.co… 😁🙏 https://t.co/Yom1kpiA4y RT @ReutersIndia: Anushka Sharma brings a quiet strength to Mamta, getting the mannerisms and body language of a small-town woman right htt… 🙏 https://t.co/kMaVNfdQFq RT @boxofficeindia6: #SuiDhaaga Is an earnest well made film.Never a dull moment..Short and sweet @Varun_dvn Is just outstanding while our… @iamtnvr_ 😉 https://t.co/eISTdU5y1l RT @tanejamainhoon: Watching #SuiDhaaga first day, first show in Boston. Just finished the first half and what a BEAUTIFUL film it is so fa… RT @KushanNandy: #SuiDhaaga. @Varun_dvn @AnushkaSharma shed their star personas to pull off such heartwarming performances. Raghubir Yadav… RT @amul_mohan: Saw #SuiDhaaga today must say @Varun_dvn is growing leaps and bounds as a performer with every thing he does and there aren… RT @DeccanHerald: #DH_Talkies\n\n#SuiDhaaga is a like a beautiful dress that Mauji and Mamta hold together as a strong double-stitch, writes… RT @livemint: India emphasized that peace and tranquillity in the India-China border areas was an important prerequisite for smooth develop… RT @rediffmovies: Review: #SuiDhaaga is a winner #VarunDhawan #AnushkaSharma #YRF https://t.co/4fIn0IP8Wq https://t.co/TogMee9FX5 🙏😁💜 https://t.co/N2zg0LnxrR Sab BOHAT badiya hai 😁🙏🙏🙏 #suidhaagamadeinindia #SuiDhaaga #SuiDhaagaReview https://t.co/ZZhEIcCWR0 RT @TheReel_in: #SuiDhaagaMadeInIndia film review | https://t.co/gMJGIa6kIg https://t.co/asSBsCBsYu Thank you Prosith 💜🙏 https://t.co/KPe9ug6Wl5 Thank you so much 🙏😁 https://t.co/K6meu8cDKk 💜💜💜 https://t.co/0031MwzaU4 🙏🙏😁 https://t.co/9tTrFDpeL4 RT @shominisen: It is a known story, but #SuiDhaaga works because of its actors and detailed screenplay by @Sharatkatariya. My review of th… RT @MiLOKMAT: Sui Dhaaga Movie Review : शॉर्ट,स्वीट अ‍ॅण्ड सिम्पल! https://t.co/Fm6GX8YvbN @AnushkaSharma @Varun_dvn #SuiDhaaga #SuiDhaagaM… Mamta aur Mauji Bator rahein hai khoob saara pyaar 🙏💜 #SuiDhaagaMadeinIndia  #Reviews https://t.co/Eju1ElRXEw RT @ashchanchlani: #SuiDhaagaMadeInIndia is such a beautifully made film\nOne of the best films to come out of @yrf \nBoth @Varun_dvn (bhai y… RT @RaviKapoor: Watched #SuiDhaagaMadeInIndia and thoroughly enjoyed @AnushkaSharma &amp; @Varun_dvn's fabulous performances. \n\n@Sharatkatariya… 🙏👊 https://t.co/HJjFQvTnKd Thank your 😁💜 https://t.co/9y97b1MMiK 🙏 https://t.co/GcItj2Vj8o RT @CastingChhabra: What an amazing choice of script by @Varun_dvn and @AnushkaSharma. A striking topic and a brilliantly made film. Superb… 🙏💜 https://t.co/n9bynXJyCV We made #SuiDhaaga with a lot of love.. and are giving it to you all today with as much and more. Mamta and Mauji are now yours.\n@Varun_dvn @yrf @SuiDhaagaFilm @Sharatkatariya #ManeeshSharma https://t.co/WIw6r1CaTQ 😁😁😁 thank you ya 🙏 https://t.co/nOKprWJ5Xi RT @ShashankKhaitan: #SuiDhaga is a simple adorable film with a very strong message... its honest and absolutely loveable... the writing an… 😁😁😁thankkkk you 🙏💜 https://t.co/mmR1Vy25Um Thank you 😁😁🙏 https://t.co/AXv9Kj1cm9 Thank you 😁🙏 https://t.co/PPRTJKBbzy Thank you 🙏 https://t.co/DgOBBSUCYI RT @varunsharma90: Just Watched #SuiDhaaga Such an Honest Film!! With such super Fine Performances!! Absolutely Amazing Haaste Haaste Rulay… RT @priyagupta999: We so underestimate the power of simplicity!!! #SuiDhaaga is such a beautiful film. So well written &amp; Directed by @Shara… 😁🙏 https://t.co/A7yB2wnXIk Thank you so much 😊🙏 https://t.co/2n7geH0D2a Thank you 🙏😁 https://t.co/AYc4UTSyKm Thank you sir 🙏😁 https://t.co/62SnRbyzSW RT @GulfNewsTabloid: #SuiDhaaga film review: @AnushkaSharma and @Varun_dvn bring an endearing small town story to life in this charming tal… @deepxanu @AnushkaNews Darling ! Don't hide your beautiful face with that emoji .. RT @khaleejtimes: Sui Dhaaga review: Varun, Anushka will warm your heart\nhttps://t.co/ZwLRprtFeE https://t.co/ch1MryU193 Our Made in India story will be yours tomorrow. Just 1 day to go for #SuiDhaagaMadeInIndia. See you in cinemas tomorrow. 👌🏻🙋🏻‍@Varun_dvn @yrf @suidhaagafilm @Sharatkatariya #ManeeshSharma https://t.co/pDP7ey9kvA 🙏🏻 https://t.co/boluiGf1eN Sab Badhiya Hoga when you get your tickets for #SuiDhaaga ! Karo karo .. jaldi book karo : https://t.co/FwY3KJxBNa @Varun_dvn @yrf @SuiDhaagaFilm @Sharatkatariya #ManeeshSharma https://t.co/UumistjKWK Warmth , Love , Greatness, Brilliance are some of the many qualities we remember Yashji for. Will always be grateful and honoured to have been directed by Yashji.. \nWill always miss him 🙏🏻❤ https://t.co/kGzpSdJ8v4 👏🏻😂 https://t.co/bC3kWUMNIs Two days for #SuiDhaaga ! #SabBadhiyaHai👌🏻👌🏻 https://t.co/XboReZB5Q8 ADVANCE BOOKINGS ARE OPEN for #SuiDhaagaMadeInIndia, releasing this Friday. Go book your tickets - https://t.co/75e0c74rhz \n\n@Varun_dvn @yrf @SuiDhaagaFilm @Sharatkatariya #ManeeshSharma https://t.co/joO4fDVr92 🙋🏻‍♀ @FortuneIndia https://t.co/knaFE1zKkq Thank you for the wishes and congratulations for Stree! 😃😃👏🏻👏🏻 https://t.co/Kre3m0Q83y RT @yrf: Enjoy all the Made in India moments of Mamta &amp; Mauji's journey in just 3 Days! Watch #SuiDhaagaMadeInIndia in cinemas near you on… 3 days for #SuiDhaaga https://t.co/s0iyVQN54k RT @yrf: From block printing to dyeing @Varun_dvn and @AnushkaSharma learnt new skills to portray their roles. Watch them in theatres on 28… 😂 great attempt @AnilKapoor https://t.co/FfiOBVln5d RT @yrf: Meet Mamta &amp; Mauji's family in 5 days! #SuiDhaagaMadeInIndia releasing on 28th September.  \n@AnushkaSharma | @Varun_dvn | @Sharatk… #SuiDhaagaMadeInIndia ke songs for you all with lots of love on @WynkMusic, @gaana, @Saavn, @JioMusicHD, @GooglePlayMusic, @AppleMusic and @iTunes.. 🎵🎵🎵 https://t.co/jgMq51JSer Thank you so much 😁🙏 https://t.co/PCJdUO8HzL RT @sidpmalhotra: Just watched #SuiDhaaga at the cast and crew preview @Sharatkatariya is a master craftsmen who has woven such a heartfelt… One more way to get your hands on everything #NUSH! Get the ​AW'18 Collection now on @JabongIndia : https://t.co/J0HHFU4MEP @NushBrand https://t.co/Ywf0FoJ1H5 RT @SuiDhaagaFilm: Have a story like Mamta and Mauji's? Tell us your story using #OurSuiDhaagaStory &amp; tagging @yrf &amp; @SuiDhaagaFilm and 3 l… Zindagi mein problem jitni bhi ho, life ​ph​ir bhi ta ta thaiyya hai! #SabBadhiyaHai song is here!​\nhttps://t.co/QwCeUT2PC2\n\n@Varun_dvn @yrf @SuiDhaagaFilm #SukhwinderSingh @varungrover @The_AnuMalik ​@Sharatkatariya ​​#ManeeshSharma The Promotions Hustle.. #suidhaaga https://t.co/mFqtkzzM0R #SabBadhiyaHai is not just talk... Is gaane pe karega Mauji ke saath pura India rock!!! Kyukiii...... Arre wait for tomorrow 🕺🏻🕺🏻💃🏻💃🏻🕺🏻🕺🏻💃🏻💃🏻\nhttps://t.co/0IkeGmGCZW \n@Varun_dvn @The_AnuMalik #SuiDhaaga #ManeeshSharma @Sharatkatariya @yrf @SuiDhaagaFilm 0.000000001 SECONDSSSS! #SuiDhaagaChallenge world record ! Ultimate !! Give him the award already now !! 😂😂😂👏👏👏 https://t.co/uFMaT8WpHo You guys were awesome !! Thank you so much for being this fun &amp; entertaining always ! Lots of love!! https://t.co/e2q6wJhghD thank you guyss !! #SuiDhaagaChallenge https://t.co/V37oIXBMQH Brett Lee always remember “Joote ki talli Kitni bhi Moti ho... ghisat zaroor hai..” https://t.co/rY0UkcwQsV Your future in Bollywood is bright 👌🏻😇 https://t.co/ElcOcNuZbv thank you 🙏🏻 https://t.co/Z740XnTwAd @mirchiprerna @Mirchimumbai @AnushkaSharmaFC @AnushkaFC_ @iAnushka_Sharma @AnushkaShrmaFC @SuiDhaagaFilm @yrf @RadioMirchi ❤❤ The amount of hard work that goes into making clothes in a factory is nothing less than amazing! Catch all the behind the scenes action in this video https://t.co/aBZzhgMxD5\n@Varun_dvn @yrf @SuiDhaagaFilm #ManeeshSharma @Sharatkatariya #SuiDhaagaMadeInIndia 😆 https://t.co/hsHqGUIcUF 👌🏻👌🏻 #SuiDhaagaChallenge https://t.co/uyC5hRXY1l While making #SuiDhaagaMadeIndia, me &amp; @Varun_dvn came across many stories of skilled artisans who don't get their due. We're proud to join hands with @MSDESkillIndia through which the government supports the talented skilled force of the country.\nhttps://t.co/afwvuZKIwp superrrbbbb!!! 👏🏻👏🏻 #SuiDhaagaChallenge https://t.co/KA5EaFNPv2 Humne toh kar diya! Ab aap sab ki baari! @iamsrk, ready to thread the needle for the #SuiDhaagaChallenge? The challenge is open to everyone.\nSo share your videos on social media tagging @yrf, @SuiDhaagaFilm with #SuiDhaagaChallenge &amp; nominate your friends! #SuiDhaagaMadeInIndia https://t.co/ZuYdEaHjRO RT @Varun_dvn: Me and @AnushkaSharma met some real heroes of india @Joydeep709 @GhoshMehuli @lakshya_sen at @IndiaToday #MindRocks18 https:… RT @yrf: Mauji aur Bauji ki nok jhok hai toh bahut mazedaar!\nWatch #SuiDhaagaMadeInIndia in cinemas on 28th September. \n@AnushkaSharma | @V… Instant photos , instant prints with the adorb Fujifilm instax mini 9 ! Capturing moments.. making memories ... #Instaxicated #MakeMemoriesWithInstax #FujiFilm @Fujifilm_India https://t.co/7CfOC22HcV RT @SuiDhaagaFilm: गणपती बप्पा मोरया! 🙏🏻This #GaneshChaturthi, weave some magic into your lives with #SuiDhaagaMadeInIndia \nReleasing 28th… 🙏🏻 Celebrating this auspicious occasion with a beautiful eco-friendly Bappa made with Dhaaga ❤ #GaneshChaturthi @Varun_dvn https://t.co/AQOLK7je7e RT @NushBrand: 'Tis the season to get shopping for the ALL NEW #NUSH AW18 Collection🎉 Stock up on the latest styles, now available at @mynt… RT @yrf: #SuiDhaagaMadeInIndia in association with @FairTradeIndia brings to you, https://t.co/pD1QqXZEVV, a platform that helps you buy ha… Power nap during #SuiDhaagaPromotions... Sab badiya hai 👏🏻 @Varun_dvn https://t.co/PiOiDCZtkJ Get ready to slay everyday with all the new styles of #NUSH AW18 Collection 🍁🍂🍁\nAvailable now at @myntra : https://t.co/1hSfEVB0fz, @shoppersstop, @JabongIndia &amp; https://t.co/QFp9AlhYfL @NushBrand https://t.co/leblxOoKRo What a concept and trailer. Blew it out of the park! Can't wait to watch...\n#BadhaaiHoTrailer @ayushmannk @sanyamalhotra07  @CinemaPuraDesi @raogajraj @Neenagupta001 https://t.co/mWaQrT8eUg Ufff loving the song and chemistry you guys !! \n@arjunk26 @ParineetiChopra #TereLiye https://t.co/bxHHHzYivF From life partners to business partners. Come join Mamta and Mauji on their journey. #SuiDhaagaMadeInIndia in theatres on 28th September. #SuiDhaagaPoster\n\n@Varun_dvn #ManeeshSharma @Sharatkatariya @yrf @SuiDhaagaFilm https://t.co/VSPAe6sW9h Filming in the northern heat and cycling for 10 hours was difficult, but extremely rewarding! Watch Mamta &amp; Mauji's journey through the roads of MP. https://t.co/CDzKh6SG2l\n#SuiDhaagaMadeInIndia @Varun_dvn #ManeeshSharma @Sharatkatariya @yrf @SuiDhaagaFilm Waah yeh fan made poster - bohat hi \"badiya hai\" 👌👌👌#SuiDhaaga https://t.co/0RyjkdZGaE RT @yrf: Create your home/society's Ganpati decoration using the theme of #SuiDhaagaMadeInIndia and stand a chance to win INR 50,000! Don't… सुई सीधी खड़ी नाचे धागा! Here’s our song #KhatarPatar. https://t.co/lEspIZJtch\n@Varun_dvn @yrf @SuiDhaagaFilm @paponmusic @varungrover @The_AnuMalik #SuiDhaagaMadeInIndia @Sharatkatariya #ManeeshSharma ◻◽◻ https://t.co/dUP6TVWvak 💃🏻🕺🏻 because... Sab Badhiya Hai! 🎵🎵\n@Varun_dvn @The_AnuMalik @VishalDadlani @iAmNehaKakkar @ManishPaul03 https://t.co/dwdRfaYZxJ RT @yrf: Mumbai woke up to a colourful morning yesterday as #SuiDhaagaMadeInIndia yarn  bombed the city! #Matunga, #GirgaonChowpatty, #Than… #KhatarPatar lekar aa rahe hai main aur Mauji @Varun_dvn … Watch our new song from #SuiDhaagaMadeInIndia TOMORROW on #IndianIdol at 8 PM on @SonyTV. \n@yrf @SuiDhaagaFilm #ManeeshSharma @Sharatkatariya https://t.co/Sg3jvk1v6T Love 🌈 Victory 🌈 Freedom 🌈 #Section377 https://t.co/691enmpad4 A huge step forward today for love and the right to love. ❤🧡💛💚💜💖🌈#Section377 #377Verdict Sui Dhaaga-fying Aamchi Mumbai. \n#SuiDhaaga #Chowpatty #Worli #Matunga #Bandstand #Thane \n@Varun_dvn @yrf @suidhaagafilm \n#ManeeshSharma @Sharatkatariya https://t.co/OnNZCUYVNw Sui Dhaaga-fying Aamchi Mumbai. \n#SuiDhaaga #Chowpatty #Worli #Matunga #Bandstand #Thane \n@Varun_dvn @yrf @suidhaagafilm \n#ManeeshSharma @Sharatkatariya https://t.co/152W9rlQUT ✨ https://t.co/qejcb7jGsn Celebrating the ones who teach us how to be the best version of ourselves with their own experiences of hardships in life... Happy teachers day 🙏\n@Varun_dvn @Sharatkatariya #ManeeshSharma @yrf @SuiDhaagaFilm https://t.co/dno7TvbqXR Such fun with this lot. Mazaa aa gaya! https://t.co/7Q7cVZw00Q Becoming Mamta, meant truly transforming myself into her. Here's a glimpse of my journey! #SuiDhaagaMadeInIndia\n@Varun_dvn #ManeeshSharma \n@Sharatkatariya @yrf @suidhaagafilm \nhttps://t.co/nlA2urLjgf Mauji ne bus pakad hi lii! Lekin kaise? Dekho Making of #ChaavLaaga \nhttps://t.co/CGDaXtHjHW\n@Varun_dvn #SuiDhaagaMadeInIndia @Sharatkatariya #ManeeshSharma @yrf It is such a great feeling to see athletes across the board perform the way they did at the #AsianGames2018 ! Only to greater achievements 🇮🇳 🥇🥈🥉 What a trailer !!! Ufff !! Can't wait to watch this one ! #SriramRaghavan at his best and @ayushmannk , @radhika_apte, #Tabu and other actors look so so good ! #AndhaDhun \nhttps://t.co/3y9dTEP1Xt 🌸 @BazaarIndia https://t.co/s89DaJi2Ms 4 hafte mein aa rahi hai #SuiDhaagaMadeInIndia! Aur kya kahein.... Sab Badhiya Hai :) Releasing on 28th September\n@Varun_dvn @yrf @SuiDhaagaFilm #ManeeshSharma @Sharatkatariya https://t.co/GFazCdtRTP A big hug to @nonitakalra and the @BazaarIndia team for a fab shoot! 🌈 https://t.co/QNPPjOfBqW Jo bhi karo mauj se karo! Kyu @Varun_dvn? \nhttps://t.co/hajlaRbyIi\n\n#SuiDhaagaMadeInIndia @yrf @SuiDhaagaFilm #ManeeshSharma #SharatKatariya Bhai tu mera bhai hai 😍 @MsPunvanity https://t.co/FtGIXOAqRW RT @SuiDhaagaFilm: Winning hearts, one stitch at a time! #ChaavLaaga crosses 11 MILLION VIEWS! ❤️Watch it here once again -  https://t.co/0… The best part of playing Mamta?\nI was ready in 20 minutes flat! ❤️ \nWatch what went into getting Mamta's look right. \nhttps://t.co/PdxEg3EV1z\n\n#SuiDhaagaMadeInIndia @Varun_dvn @Sharatkatariya #ManeeshSharma @yrf @SuiDhaagaFilm 😆😆👏 superbbbb !! https://t.co/bwuq4p1hwT RT @SuiDhaagaFilm: 🎶तेरा चाव लागा जैसे कोई घाव लागा 🎶 We're overwhelmed with the love!  #ChaavLaaga crosses 5 Million Views! #SuiDhaagaMade… RT @SuiDhaagaFilm: Fall in love all over again! Listen to #ChaavLaaga on @AppleMusic, @iTunes, @gaana, @Saavn, @JioMusicHD, @GooglePlayMusi… Hahaha namaste to you from @Varun_dvn and me ! 🙏🏻😃🙌🏻 https://t.co/HPnUzimVDg Jaipur mein bhi \"sab badiya hai\" 😃🌟 @Varun_dvn https://t.co/TkwzMYLrQ6 Life partners से business partners...Our new song #ChaavLaaga is here! https://t.co/CVygrubcvi\n#SuiDhaagaMadeInIndia\n@Varun_dvn @yrf #ManeeshSharma @Sharatkatariya @paponmusic #RonkiniGupta @The_AnuMalik  @varungrover Mauji and Mamta can’t wait for you to see #ChaavLaaga ! Out sooooon ✨🌟 @Varun_dvn #SuiDhaagaMadeInIndia https://t.co/MsEbg69nWM Best 🙌🏻 https://t.co/sitdO4UkOq A beautiful song from #SuiDhaagaMadeInIndia will be unveiled\ntomorrow in the beautiful city, Jaipur! #ChaavLaaga gaana lekar aa rahe hai hum... @Varun_dvn \n@Sharatkatariya #ManeeshSharma A song that celebrates the simplicity of love. #SuiDhaagaMadeInIndia ka pehla gaana #ChaavLaaga is on its way! Watch it TOMORROW.\n@Varun_dvn #ManeeshSharma @Sharatkatariya @paponmusic #RonkiniGupta @The_AnuMalik @varungrover https://t.co/WHto3bGbKv Got my hands on this cool Instax SQUARE  SQ6… An Instant camera brings out so much nostalgia 😊 #Instaxicated #MakeMemoriesWithInstax @Fujifilm_India https://t.co/VPawQvkNoA I’m always up for a challenge. Here’s my journey of becoming Mamta! #SuiDhaagaMadeInIndia​  @Varun_dvn @yrf @SuiDhaagaFilm #ManeeshSharma @Sharatkatariya\nhttps://t.co/zV71RMDVlX Thank you to everyone for sending in your messages &amp; congratulations to the winners. Special somethings are coming your way! ✨🌟\nEmail your details to suidhaagatrailercontest@gmail.com\n#SuiDhaagaMadeInIndiaTrailer @Varun_dvn @yrf @Sharatkatariya #ManeeshSharma @SuiDhaagaFilm https://t.co/ge2jSyuM3T RT @SuiDhaagaFilm: बधाई हो to all the truly #MadeInIndia champions at #AsianGames2018 #SabBadhiyaHai 🎉  | #SuiDhaagaMadeInIndia | @Varun_dv… .@Varun_dvn bana Mauji! &lt;3 #SuiDhaagaMadeInIndia @yrf   @SuiDhaagaFilm #ManeeshSharma  @Sharatkatariya https://t.co/HB6QwYvh67 RT @yrf: Nestled 7000 ft in the Nilgiri mountains, the Toda tribe is hidden away. Sheela &amp; her NGO Shalom enable their art to reach every p… RT @yrf: Every Pipli design has a story behind it. And Sharda’s amazing story is weaved through this art from Odisha, an art that she wants… A story of determination, spirit and art. Watch the undeterred entrepreneurial journey of Pabiben ... It will definitely win your heart. #HeroesMadeInIndia @Varun_dvn  @yrf @SuiDhaagaFilm @Sharatkatariya #ManeeshSharma https://t.co/XjfM5AuITN Lots of love , immense joy and happiness to you both @priyankachopra @nickjonas... Here’s to starting the most beautiful journey of your lives ✨💕 The devastation caused in Kerala by the floods is gut-wrenching. Whatever we can do, we must. 🙏🏻 #KeralaFloods https://t.co/jg8lxDRVaC May #AtalBihariVajpayee ji’s soul rest in peace. Heartfelt condolences to his family 🙏🏻 Guess what's arriving sooner than winter 😊#NUSHAW18Collection on @myntra &amp; @shoppersstop @NushBrand https://t.co/OmMOCghCbx 🙏 https://t.co/a127rooayF Happy Independence Day 🇮🇳🙏\n@Varun_dvn @yrf @suiDhaagafilm \n\n📷 - @htTweets https://t.co/5bQ3vb8cKk RT @SuiDhaagaFilm: अपनी आज़ादी, अपनी कला में. #HappyIndependenceDay  🇮🇳 #SuiDhaagaMadeInIndia | @AnushkaSharma | @Varun_dvn | @yrf https://… Thank you Anya✨ #SuiDhaagaMadeInIndiaTrailer https://t.co/yRnSP5xk0F Thanks Aadar:) #SuiDhaagaMadeInIndiaTrailer https://t.co/baPGUNK0n3 हमारी तरफ से आप सबको स्‍वतंत्रता दिवस की शुभकामनाएं #HappyIndependenceDay 🇮🇳 #SuiDhaagaMadeInIndia | @Varun_dvn | @yrf | @SuiDhaagaFilm https://t.co/7LNGirPtSO Thank you ✨ #SuiDhaagaMadeInIndiaTrailer https://t.co/L5Hctuopl4 Thanks :) #SuiDhaagaMadeInIndiaTrailer https://t.co/kYkpPQhgrc Thank you ☺️🙏 https://t.co/9YRbE7tfmo Thank you 🙌🙌#SuiDhaagaMadeInIndiaTrailer https://t.co/fv50Jx7dQC Thanks Sophie 💞 #SuiDhaagaMadeInIndiaTrailer https://t.co/FexCoj5MmZ Thanks joon 😁😁😁#SuiDhaagaMadeInIndiaTrailer https://t.co/zoCT5XKi2v Thanks.. ☺️ https://t.co/sqz1PHnXsC Thank you Esha ✨ #SuiDhaagaMadeInIndiaTrailer https://t.co/I5PxNIzQ7w Thanks ☺️#SuiDhaagaMadeInIndiaTrailer https://t.co/GfRAcmMRJ1 Thank you :) #SuiDhaagaMadeInIndiaTrailer https://t.co/M3K9jfSofD Thank you Mini💞#SuiDhaagaMadeInIndiaTrailer https://t.co/Sv5XV7HyMX Thank you Bhumi...💞✨#SuiDhaagaMadeInIndiaTrailer https://t.co/DFis9mQJ9t Thank you :) https://t.co/kXj4kRDUkr Thanks Riteish 😃🙏 https://t.co/IIy6E56uhD 🙌🙌 https://t.co/3sD2Km9IL1 Thank you 🙌  and all the best to you also sir for Sui Dhaaga... #SuiDhaagaMadeInIndiaTrailer https://t.co/DiswJgsfYQ Thanks Ayushmann 😀🙏#SuiDhaagaMadeInIndiaTrailer https://t.co/wDmTxN8h08 Thank you Vaani ✨#SuiDhaagaMadeInIndiaTrailer https://t.co/qERwS1wNCH Thank you Diana 🤗#SuiDhaagaMadeInIndiaTrailer https://t.co/EENQEpw81S Thank you so much 🙏 #SuiDhaagaMadeInIndiaTrailer https://t.co/sjD0vUuNNM Thanks Dia ❤#SuiDhaagaMadeInIndiaTrailer https://t.co/heCuPnQUmK Thank you Alia 😘#SuiDhaagaMadeInIndiaTrailer https://t.co/vwnqQ9GTiv Thank you Yami! 💕 #SuiDhaagaMadeInIndiaTrailer https://t.co/XjgZUEu7Fz Thanks a lot Atul 🙌 #SuiDhaagaMadeInIndiaTrailer https://t.co/F1qILDR3Ca Thank you sir! 💕#SuiDhaagaMadeInIndiaTrailer https://t.co/UAg9yCQfLQ Thank you! 💕#SuiDhaagaMadeInIndiaTrailer https://t.co/RjKH5gYG2K Thank you Karan! 😘 #SuiDhaagaMadeInIndiaTrailer https://t.co/Rsw731MQNr Thank you Suparn... #SuiDhaagaMadeInIndiaTrailer https://t.co/z16gI0LcxS Thanks a lot 🙌 #SuiDhaagaMadeInIndiaTrailer https://t.co/QfmVIzxEPi Thanks...#SuiDhaagaMadeInIndiaTrailer https://t.co/hjSvsljfsT An explosion of colors for the explosion of love you've given #SuiDhaagaMadeInIndiaTrailer! Here's a special gift for you guys! @Varun_dvn | @yrf | @SuiDhaagaFilm | @SharatKatariya | #ManeeshSharma https://t.co/p6PnlIpq4g #DontAsk...\n@Varun_dvn @suidhaagafilm @SharatKatariya #ManeeshSharma #SuiDhaaga https://t.co/iLdJA6nmKd Tell us what you love about #SuiDhaagaMadeInIndiaTrailer in the most unique way possible. Stand a chance to win!\n\n@Varun_dvn | @yrf | @SuiDhaagaFilm | @Sharatkatariya | #ManeeshSharma https://t.co/RpTTly1UT4 Something exciting coming up soon ✨ #SuiDhaagaMadeInIndiaTrailer\n\n@Varun_dvn | @yrf | @SuiDhaagaFilm |@Sharatkatariya | #ManeeshSharma https://t.co/hUeeq4sgKk In between interviews..✨\nDid you watch  #SuiDhaagaMadeInIndiaTrailer yet? \n@Varun_dvn @suidhaagafilm @yrf @Sharatkatariya #ManeeshSharma https://t.co/DkY4Qhay1L A story stitched with threads of India. A story Made in India. सब बढ़िया है...Here's #SuiDhaagaMadeInIndiaTrailer | @Varun_dvn | @yrf | @SuiDhaagaFilm |@Sharatkatariya | #ManeeshSharma\nhttps://t.co/kEawyBdUC1 Tomorrow is a very, very special day coz #SuiDhaagaMadeInIndiaTrailer is on its way! @Varun_dvn | @yrf | @SuiDhaagaFilm |@Sharatkatariya | #ManeeshSharma https://t.co/caNGODA3kt RT @deespeak: Our Ode to Our Nation! Presenting #MereDeshKiZameen, a first of its kind anthem that celebrates our rich biodiversity. JaiHin… .@Varun_dvn ke sawaalon ka jawab hai....13th Aug ko! Just 2 days to go for #SuiDhaagaMadeInIndiaTrailer | @yrf | @SuiDhaagaFilm https://t.co/CxPADuvzMv धागे धागे पे लिखा है, सिलने वाले का नाम! आइये हमारी बुनी हुई कहानी सुनने! #SuiDhaagaMadeInIndia TRAILER OUT ON 13TH AUGUST! ​\n@Varun_dvn @Sharatkatariya #ManeeshSharma @yrf https://t.co/20j5UXw0pB 🖤 @FeminaIndia https://t.co/8NdZXubB9E India से बंधा हुआ, सुई धागे से जुड़ा हुआ. Presenting a logo that’s truly unique. \nhttps://t.co/lFL6e1Fl81\n#SuiDhaagaLogo \n#SuiDhaagaMadeInIndia @Varun_dvn @Sharatkatariya #ManeeshSharma @yrf Too good ! Sahi jawaab hai Pipli @Varun_dvn ! Acha chalo last one. Yeh toh I know nobody will be able to guess. ;) #SuiDhaagaMadeInIndia https://t.co/RaJjKzkTQ5 Abhi pata lag jaayega @Varun_dvn . Chalo ek asli ‘Made In India’ paheli session ho jaye? Kyu Twitter vaasiyo? #SuiDhaagaMadeInIndia https://t.co/cVTgR7kqwT @Varun_dvn Before we launch the SUI-DHAAGA MADE IN INDIA logo, let's have some fun! @Varun_dvn , tumhe paheliyan suljhaana aata hai? #SuiDhaagaMadeInIndia सुई धागा की तरफ़ से एक तोहफ़ा #comingtomorrow #SuiDhaagaMadeInIndia \n@yrf @Varun_dvn @Sharatkatariya #ManeeshSharma https://t.co/3lGi10kAxR Happy friendship day 👫❤️ https://t.co/fe4RNCPBoE Sultan in China.. August 31, 2018 💪🏻 💪🏻\n@yrf @aliabbaszafar @BeingSalmanKhan https://t.co/XkLtE607WS ममता और मौजी से मिलिए २८ सितम्बर को अपने नज़दीकी सिनेमा घरो में! #SuiDhaagaMadeInIndia @Varun_dvn @yrf https://t.co/OYoGRGyTFO The only way forward for me is through a way in which I take care of the world around me and co-exist with my environment. This is the best decision I’ve made and I am content with the knowledge that I’ve made a little difference in the world in this way. @PetaIndia https://t.co/WG036cLiVh Happy happpyy birthday #KatrinaKaif ... You’re going to wow everyone in #Zero.. Have a great year 💕🦄 https://t.co/zT8rYpx1n5 💙 https://t.co/dgIxLM1f9a #HimaDas, congratulations on creating history by winning India its first ever track gold at the World U20 Championships. You are an inspiration to every aspiring athlete out there. It's a HUGE achievement and you have made us all proud 🙏🙏🙏 Her pain lives in us all. #NirbhayaVerdict 🙏🏻 A truly special film by a truly special story-teller, #SharatKataria.. Mauji and Mamta are coming to tell their story on Sept 28 at a theatre near you.. @SuiDhaagaFilm @Varun_dvn #ShootWrap https://t.co/Ky4bPXnOvE Playing @RajkumarHirani sir’s spirit character in #Sanju was so fun! This movie is his labour of love... go watch it guys 🌟 \n#RanbirKapoor @sonamakapoor @mkoirala @deespeak @vickykaushal09 @SirPareshRawal https://t.co/hsWw7EyIOC To lots of conversations and laughter .. happy birthday @aanandlrai 🌸 https://t.co/O1pfDWPYPa Zero is all heart. Zero is these two wonderful people &amp; everything they’ve endeavoured to create. Zero is me going on this journey with them. What a pleasure it’s been.Big hug @aanandlrai &amp; @iamsrk for your belief &amp; to #KatrinaKaif for being the amaze one that she is! #ZeroWrap🎥 https://t.co/X2ZPPF5FLw Own #NUSH at up to 51% off! Shop for it at the @shoppersstop End of Season Sale now. | @NushBrand https://t.co/pjRTWDGM2T Chilling with @Suppandi on set 🎥| #NUSHxSuppandi | @nushbrand | @TinkleMagazine https://t.co/cxHIR0hnkx Your shopping cart is about to get bigger than ever🛒😃 Create a wish list with all the #NUSH looks you love &amp; shop 'em all at @myntra's End of Reason Sale from 22nd to 25th June! #MyntraEORS | @NushBrand https://t.co/tKe4oQVDXq ❤ https://t.co/SkNomSCV1L #EidMubarak to you and your families! To a life filled with good cheer, happiness and peace always :) Print-swept 🌼🍃 Get this #NUSH look at @shoppersstop, @myntra - https://t.co/1hSfEVjoQZ &amp; https://t.co/QFp9Alzz7j | @NushBrand https://t.co/Zf5O5gObdX Itna mazza aaya ki jiyara chaknachoor ho gaya! #ZeroCelebratesEid https://t.co/LylMUaiBBF @iamsrk @BeingSalmanKhan @aanandlrai @RedChilliesEnt @cypplOfficial ❤️ https://t.co/tSY3Ahq8Xg Game on 🎲 Find this #NUSH shirt at @shoppersstop, @myntra - https://t.co/1hSfEVB0fz &amp; https://t.co/QFp9AlhYfL | @NushBrand https://t.co/8p8D3gcEwE OMG! I'm legit upset I didn't think of doing this. 🤣Loving your moves and your #NUSH tee ✨@NushBrand https://t.co/A7tnXGLpHL Ready to stripe it up? This #NUSH ensemble is available at @shoppersstop &amp; @myntra - https://t.co/1hSfEVjoQZ | @NushBrand https://t.co/YlcJqAvom6 The #SanjuTrailer is here ... ⭐  https://t.co/4I8PDNTe5S @RajkumarHirani #RajkumarHiraniFilms @foxstarhindi @VVCFilms #RanbirKapoor What a special project this is 😊\nIt’s a joy to be a part of anything you create sir @RajkumarHirani ⭐ #Sanju trailer out tomorrow \nDon’t miss this one 👌🏻 https://t.co/9QZ6P8UJtW RT @NushBrand: Feeling Blue-tiful😉💙 To slay this #NUSH dress as gorgeously as @AnushkaSharma, shop for it at @shoppersstop, https://t.co/fP… May your pout grow stronger, sassier and snazzier with each year ! Happy happiest to you 💖✨💖 @karanjohar https://t.co/x58yoEhBUZ I accept your challenge @imVKohli. Here’s my video for the #HumFitTohIndiaFit #FitnessChallenge. I’d like to nominate my friends, @DipikaPallikal and @Varun_dvn Great initiative @Ra_THORe sir! #ComeOutAndPlay https://t.co/SmdmkArT6U In life, what we do to positively impact the lives of others has greater meaning than what we accomplish for ourselves. You’ve managed to do both beautifully &amp; always with such grace &amp; integrity. Wishing you &amp; Danielle a blessed, happy life ahead 🙏 @ABdeVilliers17 @DanielleDV27 🍂🧡🍂 https://t.co/Wv6AGiwkEN My kurta from The Breakup Song is up for grabs at a charity auction benefitting animal welfare NGO Janice's Trust! Bid to win at https://t.co/0vWnSQEkEK 🙏🏻 https://t.co/4dCmiHwVOz Self-empowerment for the win 😎  Get your hands on this #NUSH tee at @shoppersstop | @nushbrand https://t.co/N4TEeP3VYb These lovely kids are the most amazing,purehearted &amp; beautiful souls❤️ We need to go the extra mile ensuring that the world is a more open,inclusive space. Love this song by #6PackBand2 with @VishalDadlani &amp; 100 kids from a special needs school! https://t.co/VdLqhBgga9 @Y_films My favorite @Suppandi is the best company ! #SuppandiInUSA https://t.co/OBbvuoWeBQ Come on boys❤️🏏🎈 https://t.co/XZi8WnkoMH The @Suppandi Summer 🌟🌞 Suppandi chale America ! #SuppandiInUSA\n•\nCollection in stores now ! @shoppersstop &amp; @myntra | https://t.co/1hSfEVjoQZ | @TinkleMagazine | @nushbrand #NUSHxSuppandi https://t.co/maLh0PmYWk I’ll just give them to you . Send me your address . https://t.co/EXHBmUOlhz RT @NushBrand: Lazy summer afternoons, Tinkle comics &amp; @Suppandi...Don't you miss those good old days😀 Choose your favourites from #NUSHxSu… A tranquil temple &amp; my shoot location today... #Zero #TeamPixel #Pixel2XL https://t.co/ukxG9YNhhq Summers &amp; @Suppandi - A match made in my childhood😉 Bringing it back with #NUSHxSuppandi collection. Now available at @shoppersstop &amp; @myntra | https://t.co/1hSfEVB0fz | @TinkleMagazine | @nushbrand https://t.co/88wLQamAbr Happiness, love &amp; a life time of joy to you both @sonamakapoor &amp; @anandahuja &amp; Welcome to the club 😉! It’s such a beautiful journey of life, love &amp; growth 💑✨💫 ⏪ Rewinding to my favourite summer memories💖... With #NUSH 💁🏻‍♀  Get the SS18 collection at @shoppersstop &amp; @myntra | https://t.co/1hSfEVjoQZ | @NushBrand https://t.co/NRc5YJoFIP It’s going to keep you up at night. Watch #Pari on @primevideoIN https://t.co/29bpHknJqn https://t.co/mPtw2c60wP This absolutely made my day. 💖The love each and every one of you send me, fills my heart with such happiness and positivity. Keep shining guys. ⭐️🎈 https://t.co/RYSVUSE9bH Sending as much and more love to all who have sent me such heartfelt wishes ... A big big thank you. Thannk you so much Riteish 😊 https://t.co/hy6QJoMOUf Thank you for your wishes buddy ! 😊😊 https://t.co/3NEPXRXZYE Thanks Priyanka! Hope you’re swell ❤ https://t.co/sFMmlXAsQT Thank you ! 😊😊 https://t.co/lFPtBbGpgJ Thank you so much 🙏😁 https://t.co/4iiFw19vNh Thank you so much 🙏❤🌸 https://t.co/hICOvMMg4B Hahaha thank you mauji 🙏😁 https://t.co/oS537cogMB Thank you so much Alia !! 🙏❤🌸 https://t.co/QV7fSVlVSX Thanks soo much Shraddha ! ❤ https://t.co/bitQCYV6PU Thank you Diana !  😊 https://t.co/5SbBsiuMBo Lots and lots of love Dia ❤ Thank you for the lovely wishes ... https://t.co/ZKQgNro9rz Thank you Aditi ! ❤ https://t.co/53zhpuTwYY Thank you thank youu Boman sir! Lots of love to you ... https://t.co/6yGuc5mpJX Thank you Babita! Keep shining ... always 💫❤ https://t.co/uPMJmW7ExL Thank you ! To entertaining times and conversations :)) https://t.co/fQIYGYJzw5 Thank you for the wishes Rajatji ... 🙏🏻 https://t.co/aWrIN9iefV The more the merrier ❤️ https://t.co/ETdsDwZAhP Thanks Yuvi paa ! https://t.co/H0ss5mNSf8 Very good very good 😂 thank you Mandy ! https://t.co/miYNSXPH2g Thanks Rahul 🙏🏻😊 https://t.co/MGQ29bRoHn Thankss ! 💫🙌🏻 https://t.co/kubxcf1ORE Thank you Malishka ... ❤ https://t.co/lQVGzy9q7p Arre arre ! 😀Thank you for the wishes Archana ... https://t.co/wAE7YyBvwA Thanks a lot Archana 🙂 https://t.co/O1czlYIan2 Thank you man ! 😀 https://t.co/kQ6FHSeFTy Thanks Amul 😊😊 https://t.co/R8SA4AUXqF You’re too kind Sonali ... Thank you so much 😊 https://t.co/jIiqQ32pJ9 Thanks a ton Maniesh ... 😊 https://t.co/HNoJHDs1A4 Thank youuu 😊 https://t.co/O5pkGumIze Thank you so much Sir, for remembering my birthday and sending your kind wishes! (Responding to your sms as I tweet this) 😊😊 https://t.co/dr01PUswIf 🙏 https://t.co/CgtI9xS20w Love the #MeriNimmo Trailer … A unique story put forth in an adorable way ! @AnjaliPOfficial is lovely and Karan is so organic, it warms your heart… All the love to @aanandlrai, @RahulShanklya and @cypplOfficial One man, many lives... The official poster of #Sanju ... #RanbirKapoor @RajkumarHirani #RajkumarHiraniFilms @VVCFilms @foxstarhindi https://t.co/m0T095Edi7 Here’s the very special #SanjuTeaser ! https://t.co/7TDM1xGoTv\n #RanbirKapoor @RajkumarHirani #RajkumarHiraniFilms @VVCFilms @foxstarhindi Happy birthday to the amazing co-star @Varun_dvn... Always a joy to be around, always cracks me up and is an absolute pleasure to work with. हैप्पी बर्थडे सबके प्यारे मौजी 🌟 https://t.co/T9wHwzQ46C Can I finally get my Maa and Nani to agree upon something? #KyunNahi! \nThanks to @StanChartIN, we all agree that banking is way simpler now. https://t.co/5MO3GyNndp Dressed to slay kinda day ;) Shop for it at @shoppersstop &amp; @myntra | https://t.co/1hSfEVjoQZ | @NushBrand https://t.co/8UioNETkdb It's so disheartening and terrible to see our plastic addiction destroy wildlife and mother nature. This #EarthDay it's time to wake up, start acting and put an end to it now! #EndPlasticPollution\n\nhttps://t.co/rD9H93YoL1 Can’t wait 🤗😁✨🌟 https://t.co/wxkzf56Npc RT @NushBrand: Summer wear is incomplete without sheer comfort. To get this #NUSH top from our SS18 collection, shop for it on https://t.co… RT @NushBrand: Breeze through this summer with #NUSH😉 \nShop for this look from our SS18 collection on https://t.co/b2R4COut1Y @myntra &amp; @sh… You are a wonderful actor and not that you need it, but, all the best @Varun_dvn for #October! 😃 It's going to be amazing, can't wait to watch it. 🤗 All the best to the team @ShoojitSircar @BanitaSandhu @writeonj @ronnielahiri The cruelest form of evil is harming an innocent child. What is happening to the world we live in??? These people should be given the most severe punishment there is! Where are we heading as humanity? \nShaken to my core.\n#JusticeforAsifa Ain't no summer blues. Just new #NUSH hues 💁🏻 Add it to your cart at @shoppersstop stores. ​Watch out for new styles everyday. | @NushBrand https://t.co/gJbSwwqHDm Get your hands on the all new Spring Summer Collection #Nush SS2018! Now available at  @myntra @shoppersstop, https://t.co/zxt7KEOAMS and https://t.co/QFp9AlhYfL ☀👗 @NushBrand https://t.co/yaoySSnGd9 RT @swachhbharat: जब मिलकर बोलेगी नारी तो सुनेगी दुनिया सारी! @AnushkaSharma का देश की महिला स्वच्छाग्रहियों के लिए संदेश.  #चलो_चंपारण   #… Super happy and exciting news guys ! Pari is releasing in Russia on April 19th ! 🤗💃🏼🙏🏼 #PariInRussia @paramspeak @OfficialCSFilms @kriarj @poojafilms #indianfilmsrussia #RisingStarEntertainment https://t.co/HYMneEhJNc Shashi was and will always be close to my heart! Can’t believe it’s already been a year! Thank you 👻 #1YearOfPhillauri @diljitdosanjh @ImSurajSharma @OfficialCSFilms @foxstarhindi #AnshaiLal #KarneshSharma https://t.co/3oK6ujXEMM Guess who’s summer ready 😉? #NUSH Spring Summer Collection 2018 coming soon! @NushBrand @myntra @shoppersstop https://t.co/9fRUsKRtPU https://t.co/Lpzar89Sg8 RIP Sudan. Your species survived a million years &amp; could have survived a lot more had we been more careful. The last African white male rhino passes away and just like that - the species is extinct. What. Are. We. Doing? #WeDidThis #SudansLegacy https://t.co/u4PYYLX6cM Can you imagine the world we live in ? Hurting a voiceless being that is being used to carry humans around for nothing all day !! Shame shame shame on these ‘humans’. Aches my heart to see such brutality by my own kind ! Sickening ! https://t.co/2t13KEug1d The body may sleep but the mind is awake…and scared! https://t.co/iLxIIJIrG4 #SoJaSoJa\n\n@aroyfloyd @rekha_bhardwaj @paramspeak @OfficialCSFilms @kriarj @ZeeMusicCompany This trailer looks so so good 👏🏼You want to know how the story unfolds! Can’t wait to watch this one 🤗 great job ya guys ! @ShoojitSircar @writeonj @Varun_dvn @BanitaSandhu @ronnielahiri https://t.co/ce2QGDxB4X It is SHOCKING to see a completely fabricated interview of mine in a reputed publication like @Ei_Samay. This is to clarify that I have NEVER done an interview on my personal life with them or with anyone else. Just shows how carelessly your personal freedom is looked at by them. https://t.co/ncmcuuJvVs Bravo to all the women who show courage in the toughest situations in life. That's the true essence of being a woman. Happy #WomensDay @IAF_MCC https://t.co/FWbpyuemIQ Every step makes a difference when you believe in something strongly and do your bit. It might not show immediately but the results do create a ripple and an impact. To all the women fighting for what they believe in, don't give up !! Happy #WomensDay 💖✨🌸 A lot of people closed their ears while watching #Pari. It’s because of the geniuses who created the eerie sound. #SoundOfPari\nBook tickets now - https://t.co/jPBWTnzquM \n@paramspeak @OfficialCSFilms @kriarj https://t.co/YtsxUxUkFN Thank you Raima 🌸🙏🏼 https://t.co/DF3GMYS1WZ Thank you so much 🙏🏼😊 https://t.co/bzLdLWVKpd That sounds great ! Thank you so much 😊 🙏🏼 https://t.co/9kvITUk3r6 It took blood (that’s right!), sweat and tears to bring #Rukhsana to life. #MakingOfRukhsana\nReserve your seats for #Pari now: https://t.co/wLILr3Aomz\n\n@paramspeak @OfficialCSFilms @kriarj https://t.co/f4AKaqH9sb Hahahaha thank you 🙏🏼 https://t.co/OdaMOR0BUQ Thanks Tahira 😊🙏🏻 https://t.co/NfiN4mLdXz Thank you Dia! ❤ 😘 https://t.co/GE9w9KHPLF The heart knows no fear… \n#MeriKhamoshiHai out now - https://t.co/iLTER1BnYf\n\n@aroyfloyd @paramspeak @OfficialCSFilms @kriarj @ZeeMusicCompany Time to move out of your comfort zone. #PariInCinemas - https://t.co/WTaZGmd1mh\n@paramspeak @OfficialCSFilms @kriarj Thank you Neil 🙏🏼😄 https://t.co/AnkMfxCEu9 Happy #WorldWildlifeDay! You can help endangered #BigCats by signing this pledge and sharing. Join @deespeak and help win this challenge. https://t.co/RDBJeABiLt #TeamSnowLeopard #PredatorsUnderThreat #WWD2018 @UNEP @UNinIndia Thank you so much 🙏🏻 so glad that you liked it 😊 https://t.co/w9jBgmmtwr Thank you for your kind words Sonam 🙏🏻 https://t.co/vXRGpEBa2K 🙏🏻🙏🏻✨✨ https://t.co/NKuvQub8eH Thank you buddy 🙏🏻💖 https://t.co/zGSCgHqJ1T Thank you Disha 💕🙏🏻 https://t.co/Av6cIp3MAB Winning hearts, one scream at a time.\n#PariInCinemas → https://t.co/wLILr3Aomz\n@paramspeak @OfficialCSFilms @kriarj https://t.co/Wtw9dDyJn9 RT @Spotboye: #MovieReview @PariTheFilm:  It's trippy. It's a horror story, which has been never told before. And it has a new but able dir… RT @ZeeNews: Check out #Pari movie review here.\n@AnushkaSharma\n\n https://t.co/ii5hqlZj4x #Pari-fied! 👻 https://t.co/jPBWTnzquM \n\n@paramspeak @OfficialCSFilms @kriarj #HoliWithPari https://t.co/bVo7A24Aao RT @renukaVyavahare: #Pari has the ability to redefine the genre as it’s refreshingly different, atmospheric and moody. Here's my #review o… RT @dnaAfterHrs: #PariReview: @AnushkaSharma thrills in this spooky #Pari’tale https://t.co/qGNu4jAhlT \nwrites @HirenKotwani https://t.co/v… RT @EntDC: #Pari movie review: India's Conjuring is here. \nhttps://t.co/cSy4EiMeQt https://t.co/INb6FQGSzn RT @DMmovies: Audience Movie Review: \"An absolute gem of a horror film\" says MJ @iamzinia 👍\n\n4 Stars for #Pari \n\nhttps://t.co/DOZPSy1JzU\n\n#… RT @gulf_news: #Pari review: this Bollywood flick will chill you! https://t.co/Y47ZjQ43vb RT @pinkvilla: #Pari Movie Review: @AnushkaSharma will give you sleepless nights with her scary as hell act-https://t.co/u0USucSEFv https:/… RT @indiatvnews: .#Pari Movie Review: As @AnushkaSharma already warned; Not a fairytale! @OfficialCSFilms \nhttps://t.co/77lHfueDJS When’s your date with the devil? #HoliWithPari → https://t.co/wLILr3Aomz\n@paramspeak @OfficialCSFilms @kriarj https://t.co/tK6S9xjmDC RT @ArreTweets: .@AnushkaSharma’s #Pari is one of the rare instances of an A-lister putting their weight behind the bastardised Bollywood h… RT @FilmCompanion: REVIEW: It’s rare to see a successful mainstream actress like @AnushkaSharma not only believe in this as a producer, but… Meet Rukhsana. I dare you! #HoliWithPari → https://t.co/jPBWTnzquM \n@paramspeak @OfficialCSFilms @kriarj https://t.co/ZAibhcoSrQ Now it's your turn to meet the Devil! #HoliWithPari → https://t.co/wLILr3Aomz\n@paramspeak @OfficialCSFilms @kriarj https://t.co/59mm92KgAr This Holi, the devil's coming to play with you. Are you ready? #HoliWithPari https://t.co/JsNfdpor8h Thank you! 😊 https://t.co/DaHUmJTJ7p Thank you Nayandeep, you’re always kind! https://t.co/2yoKJFxXXS I hope the different kind means the right kind… Thank you! 😊 https://t.co/uhMyaFYfbO Hope you guys slept well! https://t.co/m7CPe43Bv3 Thank you Faridoon! https://t.co/vDHwsj5ENs Thank you for the laav! 😊 https://t.co/zx4bRzBlaI Thank you, Subhash! 😊 https://t.co/6YX0TTAxxx Thank you Tushar! Hope you had a good night’s sleep :) https://t.co/1x84s6Im9z Thank you Mehreen 🤗 💕 https://t.co/kIKKmXvQfQ Mission accomplished 🙏🏻😃 https://t.co/DoEcJoCruO Thank you Jackky! Had already warned everyone 😉 https://t.co/AhiprLZ4KS Alok 🙏🏻✨😈🙌🏻 🧞♀✌🏻 https://t.co/5Rmg0UUy6y You can block your seats but you cannot block the devil! Book tickets for #PariTomorrow -  https://t.co/jPBWTnzquM \n@paramspeak @OfficialCSFilms @kriarj @poojafilms https://t.co/ApiCXCCLCx The devil arrives tomorrow. #PariTomorrow - https://t.co/wyueeMbgez\n@paramspeak @OfficialCSFilms @kriarj @poojafilms #Pari will make you uncomfortable, so you better get the best seats! Book tickets for Pari now: https://t.co/wLILr3Aomz\n\n@paramspeak @OfficialCSFilms @kriarj @poojafilms #HoliWithPari https://t.co/R2zuYLJ7Ra Make-up played a lead role in #Pari. Here’s the #MakingOfRukhsana. #2DaysToPari\n\n@paramspeak @OfficialCSFilms @kriarj @poojafilms https://t.co/B9IXhIWtI0 Watch your moves, because you are being viciously watched! 😉 #2DaysToPari\n@paramspeak @OfficialCSFilms @kriarj @poojafilms https://t.co/yAJFAfmE8u Sharing is scaring!\nTake a photo/video using Pari filter on Facebook with #HoliWithPari &amp; stand a chance to win free movie vouchers.\nhttps://t.co/C6QPVxkEp8 https://t.co/WEnnXxlRuN There is no way out, every option will take you to her. https://t.co/oXEjaOdTsT #3DaysToPari\n@paramspeak @OfficialCSFilms @kriarj @poojafilms #HoliWithPari I am shocked . I have no words. My condolences to the family , friends and fans of cinemas darling ... Sridevi ji .. #RIPSridevi If I have scared you enough with the Teaser of #Pari 💀  now watch me breeze through summertime sunshine ☀ in #NUSH 💖 👗  Spring Summer Collection, coming soon 😉  @NushBrand https://t.co/pYQNRgcnMD The devil arrives this Holi - https://t.co/i4I6GFM1Xw\n#HoliWithPari @paramspeak @OfficialCSFilms @kriarj @poojafilms Keep your eyes wide open. She won't let you blink. #HoliWithPari\n\n@paramspeak @OfficialCSFilms @kriarj @poojafilms https://t.co/erMkh53cLm She is coming and so are the updates. Click to subscribe now: https://t.co/Off7TGOD54\n\n@paramspeak @OfficialCSFilms @kriarj @poojafilms https://t.co/UI9y2tLye3 I’m waiting... https://t.co/RrKbrXsDCu \n\n#HoliWithPari @paramspeak @OfficialCSFilms @kriarj @poojafilms This Holi, the devil’s out to play. #PariTrailer – https://t.co/NhATazY7XZ\n@paramspeak @OfficialCSFilms @kriarj @poojafilms Will you be her Valentine? \nhttps://t.co/3xiKG8lYyZ\n#PariTrailerOnFeb15 @paramspeak @OfficialCSFilms @kriarj @poojafilms ममता और मौजी आ रहे है २८ सितम्बर को | #SuiDhaagaFirstLook #SuiDhaaga @yrf @SuiDhaagaFilm @Varun_dvn https://t.co/hJzpCjEt4H Here’s something more haunting than your #MondayBlues. #PariTrailerOnFeb15 \n\n@paramspeak @OfficialCSFilms @kriarj @poojafilms @KytaProductions https://t.co/LHNrNXmhsk Here’s a REMINDER. This is not a fairytale. #PariTeaser https://t.co/iKRwkYDZot \n\n@paramspeak @OfficialCSFilms @kriarj @poojafilms It's time to face your fears. #PariTeaser out today at 12 PM.\n\n@paramspeak @OfficialCSFilms @kriarj @poojafilms https://t.co/7kTWJ5gSVu Sooner or later, fate shows up at your doorstep.....\nUntil then keep your eyes wide open and watch out for #PariTeaserTomorrow\n\n@paramspeak @OfficialCSFilms @kriarj @poojafilms https://t.co/6fG8ZrR9Ry . @Varun_dvn &amp; I just hanging out, holding a pad, no big deal, just another regular day 🙃 🙃\n\nBest of luck @akshaykumar @sonamakapoor @radhika_apte for #PadMan. Nominating @karanjohar #katrina @iTIGERSHROFF. It was discussed and these are both our nominations!!! https://t.co/MvgFJRpGHm Been a wonderful journey with all of you! #Gratitude 🙏🏼❤ #15MillionStrong https://t.co/zqijNNYoHN The best ride in town with these two! #Zero @iamsrk #KatrinaKaif @aanandlrai https://t.co/BDkpIJsGtU She will grow on you... #1MonthToPari\n\n@paramspeak @OfficialCSFilms @kriarj @poojafilms https://t.co/lj2NxczQfi कतरन से बुनी कहानी\nपैबंद लगा के है सुनानी\n- सुई धागा\n\n@SuiDhaagaFilm | @yrf | #SuiDhaaga | @Varun_dvn https://t.co/9YTCmiNMX8 United we stand, divided we fall. Happy #RepublicDay to you all! Jai Hind! 🇮🇳 Guess who chilled with me on my day off 🐶 https://t.co/Qt4rtlmQSn A day is not enough to express the gratitude we have for what you do. Saluting you today and every day. #ArmyDay #HoliWithPari \n@OfficialCSFilms @paramspeak #PrernaaArora #KarneshSharma @kriarj #ArjunNKapoor @poojafilms https://t.co/aMePVg992G https://t.co/lTrXywsWSo Sweet dreams guys... #HoliWithPari \nhttps://t.co/aMePVg992G RT @foxstarhindi: The no-holds-barred story of Sanjay Dutt, directed by @RajkumarHirani, #DuttBiopic releasing on June 29! A Fox Star Studi… New year ki raat waali party toh ho gayi, par #2ZERO18 ki party toh aaj se shuru hui hai. Dekhiye Zero. @iamsrk @aanandlrai #KatrinaKaif  @RedChilliesEnt @cypplOfficial https://t.co/vzWQJFo32Q Wishing you all a very happy , healthy and prosperous new year ! Love and light to all ❤️✨ https://t.co/mV2vE595ji Kal ka surprise toh miss karna hi mat... Kyunki asli new year gift toh kal 5 baje milega! #Kal5BajeSRK @iamsrk @aanandlrai #KatrinaKaif @RedChilliesEnt @cypplofficial https://t.co/39rNbDpazb RT @NushBrand: This winter, wrap it up the sassy way with #NUSH😎 To get this look, shop for it at @shoppersstop &amp; @myntra​.\n@AnushkaSharma… May the spirit of the Christmas fill your home with peace, joy and love. Wishing you all a Merry Christmas! 🎄 🎊 https://t.co/pf75ZEFfb2 The End Of Season Sale is here! Shop for #Nush at shoppers stop now! https://t.co/jV8co8Ak1d Second time for me on Forbes, first for #Nush 👗. Thank you again @forbes_india 🙏🏼 #ForbesIndiaCeleb100 https://t.co/iVgaQrh79q Guys, don’t miss India’s biggest ever fashion sale. Shop for @NushBrand at @myntra End of Reason sale. Dec 22th to 25th. Log on to https://t.co/JpyGzVNEnh https://t.co/PB7hQ6VBfS The people responsible for making the most memorable occasion of our lives peaceful and beyond beautiful 🙏 - our lovely wedding planners @ShaadiSquad https://t.co/rsCz1Eustd Thank you Rohan! 🙏 https://t.co/5AThJx3uLF Thank you so much Maniesh! 😊🙏 https://t.co/FOSTeS60il Thank you Jacky 💖😘 https://t.co/FUQeZcXBuk Thank you for your words and wishes Ayushmann 🙏 ❤ https://t.co/69feXzUOBN Thank you for your wishes Sonali ❤ https://t.co/CCbPYBsGHK Thank you Farhan 🙏☺ https://t.co/pPtxAS75rJ Usual is boring! Prepare for the freedom from usual.. Introducing @KerovitIndia - #KerovitIsFreedom 💃🏽 \n\nhttps://t.co/YY73RptNjW Thank you Randeep 🙏😊 https://t.co/eOMR3u49oo Thank you so much 💖💖 https://t.co/RG5EOUg4AB Thank you! 🙏 😊 https://t.co/DWtLUc5159 Thank you for your wishes 🙏 https://t.co/toPPX8dVvZ Thank you 😇🙏 https://t.co/AI4lvIRpTf Thank you so much Athiya 💖 https://t.co/8CM1C08OOR haha thank you 🙏 ☺ https://t.co/jelQ41yiIF Thank you so much! 💖 https://t.co/RHX7WWYTdy Thank you Kriti! 😘 https://t.co/7w8lsTuwO8 Thank you so much 🙏 💖 https://t.co/2ITUJ3apK4 Thank you so much Kapil 🙏 😇 https://t.co/Yq2sOhXQFC Hahaha thanks Rohit! 🙏😊 And congratulations on your splendid innings 👏 https://t.co/xeo9whyx8T Thank you so much 😊🙏 https://t.co/RFRUEGaDXz Thank you 🙏 😁 https://t.co/L7l0Stf0wD Thank you 🙏 😇 https://t.co/msm8LTyowh Thanks Shami 😁🙏 https://t.co/MMOjAEWdPB Thank you so much Ileana! ❤😘 https://t.co/KpSycZa4dm Thank you so much ❤❤ https://t.co/xuMFf8IDO2 Hahaha thanks Riteish 🙏😁💖 https://t.co/63RuDNVsxe Thank you Anil sir 🙏😊 https://t.co/3hyvw20LLp Thank you so much! 🙏 https://t.co/Qw2dAQsguy Thank you 🙏🏼😇 https://t.co/39RsscGIsr Thank you my lovely 🙏🏼😁 https://t.co/3FnTe1vJB3 Thank you Punit 🙏🏼🤗 https://t.co/CAxL0sUyiQ Thank you 🙏🏼 https://t.co/Myv6Izd8ji Thank you 😊 https://t.co/UKNsO5XF8h Thank you 🙏🏼 😊 https://t.co/mT7M8W1c5K Thank you so much Mahira 🙏🏼 https://t.co/U3tXxCc3zI Thank you 🙏🏼 https://t.co/kd91iCCHRc Thank you sir . Your words are beautiful 🙏🏼 https://t.co/cT8WyN4Klw Thank you 🙏🏼 😊 https://t.co/0eXBtBL12m This is so beautiful . We are both grateful, thank you 🙏🏼 https://t.co/6dvZz95Aar Thank you Naman 🙏🏼 https://t.co/wkbivMyybz Thank you Rahul 😁 https://t.co/AWImfh87Fk Thank you 🙏🏼😁 https://t.co/YJZfmmUcj4 Thank you Shikhar! 🙏😁 https://t.co/YGxhTk2wyB Thank you so much Huma! ❤ https://t.co/C217CqodRG Thanks Abhishek! 🙏 https://t.co/SIsqFmfdAJ Thank you Priyanka! ❤ https://t.co/CGkVstwLCh Thank you so much 🙏 😊 https://t.co/1xBmwzSiMh Thanks Diana! 💖 https://t.co/6NDCJuOo6q Thank you 🙏 😁 💖 https://t.co/LnPqhJxCLL Thank you Genelia! 💖😊 https://t.co/xXqYqzpGZT Thanks Sonam! ❤❤😘 https://t.co/bM3sDgr2Np Thanks Bhumi! 💖 https://t.co/VwblyqrwOs Thank you my lovely 🙏 ❤ https://t.co/KQwDCGtjwp Thanks Varun 🙏 😊 https://t.co/li1iHlTVEb Thanks a lot Sid! 🙏 💖 https://t.co/xBQqxTMN7x Thank you joon! 🙏 😁 https://t.co/DuE66Gy6T6 Thanks Neha! 🙏❤ https://t.co/ziXv7sPejQ Thank you for the wishes 🙏 https://t.co/8m42Vk7Lw7 Thank you so much Pari! 💖😘😘 https://t.co/bfpEMvBsXu Thank you for the wishes 🙏 https://t.co/UnDy1lLItv Thank you for your blessings sir 🙏 😊 https://t.co/uWkgBpg3mx Thanks tiger 🙏 😊 https://t.co/KUZe9M8rXg Thank you ! 🙏😊 @TandonRaveena https://t.co/QhIqrBW8zw Thanks a lot @SAfridiOfficial  🙏 https://t.co/xYgALh1iU5 Thank you @karanjohar! ❤🙏 😁 https://t.co/SO1qsDi5o5 Haha! Thank you so much @iamsrk 🙏😊 ❤ https://t.co/vvld2xGQJv Thank you @aliaa08! 💖😘 https://t.co/VNvjfYVFSL Thank you so very much! 🙏😘 @realpreityzinta https://t.co/CDpukSYqE6 Thank you so much sir 🙏 😊 @SrBachchan https://t.co/kOKCKnMhmp Today we have promised each other to be bound in love forever. We are truly blessed to share the news with you. This beautiful day will be made more special with the love and support of our family of fans &amp; well wishers. Thank you for being such an important part of our journey. https://t.co/Scobdiqk7l RT @NushBrand: Get ready to flaunt your #NUSH look! Click &amp; share your pictures in a NUSH outfit using #InMyNush, tagging us &amp; you could wi… An era of great cinema belongs to you and will always do so. RIP respected #ShashiKapoor Ji. Coming from an army background myself, I feel so proud and absolutely honoured to be part of this. Here’s saluting the real life heroes of our nation. Jai Hind! 🇮🇳 #ArmedForcesWeek https://t.co/9wn3FPLY8C . @Harry0073 @iamkeitan @vfx_redchillies @RedChilliesEnt @OfficialCSFilms . The incredibly talented team that made Shashi the ghost come alive in #phillauri. Watch the making here - https://t.co/ntgoUwmYXV Thank you @geneliad ! Lots of love 💕 😘 https://t.co/tbpTmYhoYE Awww you’re the best ! You know I’m a huge fan 😍 @mkoirala https://t.co/1RmtL9SmyN RT @VOGUEIndia: What's the biggest challenge @AnushkaSharma's stylist faces when she's dressing the star? Find out in here.\nhttps://t.co/Lv… RT @evelyn_sharma: Loved this super cute top!! @AnushkaSharma thank you 😘😘\n#nush https://t.co/5HygPSEC0o Wear it like you say it 😉 Checkout tees that word up in the #NUSH collection. Available at @shoppersstop &amp; @myntra. @NushBrand https://t.co/9487fmrfhf Thanks for the love @MallikaDua! Enjoy the tee! 💖 https://t.co/PukKhu2GCJ Thank you so much @NSaina! Happy you liked it. 💖😊 https://t.co/64AooMHPGO Glad you liked it! 🙏 💖 @SunnyLeone https://t.co/IErRLio7yD RT @NushBrand: Saturday goals are incomplete without some SHOPPING! Get your hands on the #NUSH collection. Now available at @shoppersstop… RT @shoppersstop: The wait is finally over. We are super excited to announce that Nush is now available at Shoppers Stop.\nRush to the neare… Shopping Alert! 🚨 #NUSH is now available at @shoppersstop ! 🛍 🛒 https://t.co/2Tzr2LxwS2 RT @NushBrand: When your tee has a mind of its own 😉 \nShop for this #NUSH top on @myntra at https://t.co/eVG8wfykUc | @AnushkaSharma https:… Congratulations Amul,Anshul &amp; entire team @supercinemaent. Your dad would be proud of you guys! Here's to many more years of super cinema 🙌 https://t.co/2lruIYfcld Stripe it up! This #NUSH look is available on @myntra at https://t.co/895kUaJamW @NushBrand https://t.co/aKqh7GgQ4x RT @NushBrand: Prints have a wild side too😉 Wear 'em the #NUSH way! Shop for this look on @myntra at https://t.co/b2R4COut1Y | @AnushkaShar… You have 'copped' the look! 👮👌 @arjunk26 https://t.co/mx3vRXqfID Revealing the suspense is so not cool! Watch #IttefaqThisFriday in cinemas near you &amp; please #SayNoToSpoilers! https://t.co/2czsFhsQSi Thank you for the constant support &amp; love through it all..big love to my #13Million family 😘😘😘 https://t.co/DXB4FXpIoq RT @NushBrand: Let your #NUSH tee do all the talking. Available now on @myntra at https://t.co/b2R4COcRDo  | @AnushkaSharma https://t.co/wM… RT @NushBrand: No matter what, step up, dress up &amp; get going😎 Shop for the #NUSH collection on @myntra at https://t.co/eVG8wfgJvC | @Anushk… Pop that boring bubble with your #NUSH tee 🎈 Available on @myntra https://t.co/895kUaryYm @NushBrand https://t.co/davpJLz5WC Wishing you &amp; your family a blessed Diwali. May the light in you grow brighter this Diwali &amp; bring you closer to your life's purpose 💖✨🙏 https://t.co/SLzP8ywBze May you find the light in you this Diwali and help brighten this world with more compassion and happiness 🙏 💖 https://t.co/fyOMjLqvak Go easy-breezy with print on print 💁 #NUSH now available on @myntra https://t.co/895kUaryYm @NushBrand https://t.co/M46b0aJcLi RT @NushBrand: Floral feels on point🌸 Get this #NUSH look now on @myntra - https://t.co/VmofwaPVCo | @AnushkaSharma https://t.co/aL8oQpu0DJ Thank you so very much @nikhil_thampi 🙏❤ https://t.co/CoOzLKDnVa Thank you @deespeak 😘❤ https://t.co/6ctrAxTpVw There you have it ladies! This strong, responsible &amp; good looking man may just be delivering your Nush orders 👏 😜💪 @arjunk26 https://t.co/xTc2SSMyUD When your tee has something to say 👀 Checkout the #NUSH collection on @myntra https://t.co/895kUaJamW @NushBrand https://t.co/yv2UWP3dQs Nush boxes looking super good on such responsible shoulders! 😝 @arjunk26 @NushBrand #NUSH https://t.co/NXI5Z40AGk Step into the #NUSH side 😊 Now available at @myntra - https://t.co/895kUaryYm @NushBrand. https://t.co/BhctNryr4X RT @NushBrand: A colour for every mood ;) Choose your fav #NUSH shade. Available now at @Myntra. Shop here: https://t.co/eVG8wfgJvC | @Anus… RT @NushBrand: Don’t forget to wear that smile with every style! #NUSH is NOW AVAILABLE at @myntra. Shop here- https://t.co/eVG8wfgJvC | @A… RT @NushBrand: It’s shop-a-clock! #NUSH AW17 Collection NOW AVAILABLE exclusively on @myntra. Shop now 🛒 - https://t.co/NC31BKcmsz | @Anush… #NUSH is now available on @myntra 👚 😊  Shop shop 🛒  - https://t.co/aL5tgdL4O0 https://t.co/zMAMEwfFYv #NUSH available on @myntra tomorrow onwards. @nushbrand https://t.co/Hw0sNwSTBc Happy birthday @SrBachchan sir. You inspire always. 😊🙏🏼 What a magnificent cinematic #PadmavatiTrailer! Superb👍🏻@deepikapadukone @RanveerOfficial @shahidkapoor @Viacom18Movies #SanjayLeelaBhansali RT @NushBrand: Floral at play, the #NUSH way🌸 4 days to go y’all. Available at @shoppersstop &amp; @myntra from 12 Oct. | @AnushkaSharma https:… Being comfortably #NUSH☺…Own it in 5 days! Find it at @shoppersstop &amp; @myntra 12 Oct onwards. @NushBrand https://t.co/EowU5kD90n GQ Woman Of The Year 2017. https://t.co/ISTkUnlPcQ Hahah thank you 😘 sending you stuff v soon ! Hope you enjoy wearing it ❤ @Mehreenpirzada https://t.co/SxM8GJoEGI Thank you @ParineetiChopra ❤😘 https://t.co/moi39pE8rw Thanks for the ❤ guys! You can shop for #NUSH at @shoppersstop , @myntra &amp; other shop-in-shop outlets across India, 12 Oct onwards! https://t.co/vzL5gXCKCB Awww thank you so much 😁🙏 @aanandlrai https://t.co/xUM0jfR5Ze Thank you @raghuvendras 😊 https://t.co/OxFGXzudHG Thanks @ManishPaul03 🙏 https://t.co/dWXR7y0jTv The story of #NUSH ❤👗 @NushBrand https://t.co/k3lBEF2lAh Doors to this wardrobe open up tomorrow! 👗  👀 https://t.co/T5Dhutplfp Thanks @akshaykumar! 😊 🙏 https://t.co/1lSsR47L63 His greatness was &amp; is about understanding this &amp; speaking it out to millions. May you all find that greatness in you. Happy #GandhiJayanti https://t.co/mwmeRYcLEX To the man who began the #MadeInIndia journey. We salute the spirit of Mahatma Gandhi  @SuiDhaagaFilm 🙏 https://t.co/u4yElMAUQF Thank you so much! 🤗 Sending you something from the collection that'll look great on you. @evelyn_sharma https://t.co/yfQceJBMJA Thanks 🙏 sending you some from the collection ! Hope you like it 😘 @geeta_phogat https://t.co/Trw06FAa08 Taking off ... to land into your shopping bags in 2 days 😉 👗 💜  3rd Oct .. https://t.co/SBXMtM4TgL May this day clear the hurdles in your life and start a new era of well-being 😇\n#HappyDussehra! Hang in there ... 3 days to go 😉👗 https://t.co/C4ijMyQZ2O 🙏 🙏 https://t.co/HvImS2opUG \"An ounce of practice is worth more than tons of preaching\"- Mahatma Gandhi ji  🙏 #SwachhBharat #SwachhataHiSeva https://t.co/UfhB3sfRpy 3rd October 2017 - Girls... Make some space in your wardrobe 🤗  👗 💜 https://t.co/6Ssq551m7n You will always live on in our hearts and the hearts of so many lives your movies touched #HappyBirthdayYashji ❤ https://t.co/4Ca6TPUafe I am honoured to be a part of #SwachhBharat campaign and will do my best for the noble initiative of #SwachhataHiSeva (2/2) https://t.co/SrSt2GKBWF Happy Birthday to our honourable PM @narendramodi ji.Thank you Sir for the invitation to join the #SwachhataHiSeva movement (1/2) Few days to go :) Can't wait to present the collection to you'll #ComingSoon 👚https://t.co/SXOvA8oNu9 Thank you to the city of Kolkata &amp; @KolkataPolice for lending their support for the shoot of our film #pari. It's been great shooting here! Thank you for always being my strength &amp; support! #12MillionStrong https://t.co/ut3up4WcFV May good health, good luck &amp; happiness ring in your homes through the year. Have a tasty Sadhya! #HappyOnam 🤗 May Lord Ganesha bless you and your family with health, wealth &amp; wisdom! Happy #GaneshChaturthi! It pains me to see terrorism affect innocent civilians over and over again. My condolences. #BarcelonaTerrorAttack #HappyIndependenceDay to all of you! Jai Hind! 🙏  🇮🇳 Elle 2017 😎 https://t.co/Es5o49WOKB Thank you sir ji 😁🙏 ❤ @bomanirani https://t.co/z95HE8bHzw Thank you 😁🙏 @AshGowariker https://t.co/C015arolwr Thank you so much 🙏 💜 @karanjohar https://t.co/9WgCQkA26j Thank you so much for your kind words @AzmiShabana ❤ https://t.co/QRAgidRirZ Thank you so much @aamir_khan! 😊 https://t.co/99Aj468Fix Can't stop👐🏻 won't stop #Phurrr-ing👐🏻 https://t.co/obxr3O2UeE @diplo @ipritamofficial @iamsrk @RedChilliesEnt @sonymusicindia RT @iamsrk: Why do anything else when you can #Phurrr! @diplo @ipritamofficial @AnushkaSharma \n\nhttps://t.co/VOFPp1rIOd .@iamsrk see what happens when @diplo drops the beat &amp; starts Phurring! Song tomorrow till then here's #MiniPhurrr https://t.co/TZZcmZKQCw Herry! Yeh toh buss teaser hai... Kal @diplo aur @ipritamofficial se poochkar, Dilli mein poora bataaungi! #Phurrr @iamsrk @RedChilliesEnt https://t.co/scru0Ke93Q Pls excuse me lil champs, it's my loss that my ill health has kept me away frm having fun on the show with you today🙁 lots of love❤ Banaras gaye aur paan naa khayein aisa kaise ho sakta hai! Thank you Banaras for the love 🙏 ❤! #JabHarryMetSejal #4thAug @iamsrk #imtiazali https://t.co/JzyzOLdN8N RT @RedChilliesEnt: Look at Sejal go all #Phurrr! Is it Harry's effect on her or something else? 💁🏻😍💃🏻 @AnushkaSharma #JHMSThisFriday https… RT @RedChilliesEnt: Harry &amp; Sejal's story is going to be one mad journey! Just #1WeekToJHMS! Are you ready? #JHMSAug4 @iamsrk @AnushkaSharm… The news of #Hawaayein being the most streamed song in first 24hrs got me all💃💃\nVideo shot &amp; choregraphed by Herry from JHMS @iamsrk 😎 https://t.co/ATJqvKypZx Hawaon se bhej rahi hoon thank you..Harry! @iamsrk https://t.co/cR7qgWeUqw Tera naam lein deti hain jo sadayein #Hawayein https://t.co/bsBgS9j0yA @iamsrk @ipritamofficial @RedChilliesEnt @sonymusicindia #JHMSAug4 RT @RedChilliesEnt: Jab @iamsrk &amp; @AnushkaSharma danced in the 🌾🌾 of Punjab. Here's the making of #Butterfly: https://t.co/IBxEb8OJEu\n@sony… Salute the determination &amp; passion shown by the women in blue! Tough luck. But girls, you've won our hearts ❤ @BCCIWomen #WWC17 Wishing the @BCCIWomen team congratulations for the superb run &amp; all the best for the finals today! Go girls 🙌😘 #WWC17 #INDvENG #WWC17Final I lost my ring &amp; found Harry! What else does this journey have in store for me?#JHMSTrailer @iamsrk @RedChilliesEnt https://t.co/K0We2NtfPE RT @filmfare: Watch the making of our cover shoot with the coolest of ‘em all… @AnushkaSharma. https://t.co/Or64fOpGXm 💜 https://t.co/8JaFVC4Aol RT @RedChilliesEnt: Harry's Punjabi or Sejal's Gujarati? Which Tongue Twister Challenge are you up for? Take your pick! @RedChilliesEnt htt… Main jaanti thi tum Punjab jaake badal jaoge! Par aise? #Butterfly banke ☺@iamsrk @RedChilliesEnt @sonymusicindia https://t.co/AJCkaEoVM6 RT @RedChilliesEnt: Have you met Harinder Singh Nehra &amp; Sejal Zaveri yet? Here’s presenting hot from Punjab 😉 #Butterfly @iamsrk @AnushkaSh… Punjab ke kheton mein Jab Harinder Met Sejal 😍 #ButterflyTeaser @iamsrk @ipritamofficial @RedChilliesEnt @sonymusicindia https://t.co/rAabgYlTsq Absolutely shocked and horrified to hear about the #AmarnathTerrorAttack on innocent pilgrims. Thoughts &amp; prayers with affected families. The journey had begun. Somewhere on this #Safar we met👫 https://t.co/q4sSZic06u @iamsrk @ipritamofficial @RedChilliesEnt @sonymusicindia https://t.co/djRJj2eELm 9th Feb 2018. #Pari https://t.co/1e6w7EvMmP RT @RedChilliesEnt: Your Friday night playlist just got a super cool twist. #RadhaRemix out now- https://t.co/349RRlb8LF\n@iamsrk @AnushkaSh… Lots of love and best wishes for your future Anya ! ❤ @anyasinghoff https://t.co/1GRQlN137n RT @RedChilliesEnt: Harry &amp; Sejal's relationship = #BeechBeechMein, we tried understanding it through a fun game.\n@iamsrk @AnushkaSharma ht… Thank you @SunielVShetty! Your super fitness and cool attitude inspires always!😊 https://t.co/qlOkLY8QkT Welcoming @AadarJain and @anyasinghoff to the @yrf family! All the best and God bless! 😊 Put on your dancing shoes 💃🏻#BeechBeechMein Full Song https://t.co/j4LF5BVS7A @Iamsrk @ipritamofficial @redchilliesent @sonymusicindia सौ बटे सौ! चलो अब पिक्चर बनाते हैं साथ में - मज़ा आएगा :) @SuiDhaagaFilm @yrf https://t.co/XLlYoiPm4r Herry! Tum gaana bhi #BeechBeechMein se shuru karte ho? \n❤ this song! #SongTrailer https://t.co/K7yJ9zaSOf @RedChilliesEnt @ipritamofficial https://t.co/9TJXI3QGqL आगे आगे मौजी भैया, पीछे पीछे पूँछ,बढ़ते जाएँ मौजी भैया, घटती जाए पूँछ।बोलो क्या? @Varun_dvn MY RING Herry!!!! #JabHarryMetSejal 💃🏽 What I sought was seeking me! @iamsrk @RedChilliesEnt Wohi toh, Herry! Par now that I'm here, let's get back &amp; find my ring!‍🕵🕵🏻 @iamsrk @RedChilliesEnt #JHMSMiniTrail5 https://t.co/HpXGUitN1a After Mexican wave it's the #SejalWave 〰 .. but are you making fun of me Herry like you always do? 😠🙄 @iamsrk @RedChilliesEnt https://t.co/u4SMJgof6j RT @RedChilliesEnt: Enjoyed watching Radha? Well, @iamsrk &amp; @anushkasharma had more fun shooting for it! Watch the #MakingOfRadha now - htt… Mera naam hai Sejal! Sejal ka matlab pata hai? 〰 @iamsrk @RedChilliesEnt https://t.co/wPuza6CATo #JHMSMiniTrail4 May the goodness and blessings of God be with you all. #EidMubarak to all. https://t.co/oiSnWqNmKw Hahhaha that's so nice !! Thank youuu 😁💃 @aanandlrai https://t.co/dAuQrH8b8B Haan Harry! Banungi Teri Radha! \nI thought you always knew! @iamsrk @RedChilliesEnt @sonymusicindia #RadhaOutNow https://t.co/nR3RDuJpib Thanks 😁 @DianaPenty https://t.co/bvy4FhdtoY Thank you! 🙏 @Riteishd https://t.co/tChBW52Gr5 Sochti hoon 🤔 Kal batati hoon if I can be your Radha @iamsrk #RadhaComingTomorrow Herry! Suna hai you’re going to meet a lot of Sejals in Ahmedabad? Main kaafi nahi thi? @iamsrk @RedChilliesEnt https://t.co/RuMDAchHWW Thanks love! 😘 @sonamakapoor https://t.co/6frR5ra0RZ Thank you! ❤ @Vaaniofficial https://t.co/F6acLqpFl7 Herry, actually you have a problem with everything!😒What's your excuse?🙄 @iamsrk @RedChilliesEnt https://t.co/OUe9O67bm7 #JHMSMiniTrail3 LLB hoon, family matters handle karti hoon! Tumhe bhi handle kar sakti hoon Harry! @iamsrk https://t.co/bkXSE7xKhn #JHMSMiniTrail2 Herry! Tum mujhe daraane ke liye kya kya kehte ho🤷🏻‍ @iamsrk @RedChilliesEnt https://t.co/mdeAqN6GXX #JHMSMiniTrail1 The world would be even more wonderful if there were more men like you papa! Thank you for your strength &amp; kindness in my life❤🙏 #FathersDay https://t.co/qqaNKW30gb Plzzzzz explain to the world why you and I are posing with this particular expression along with the birthday boy @iamsrk https://t.co/kxfhPJeEJk Happy happy to Imtiaz sir ji !! Thank you for making Anushka meet Sejal ❤ https://t.co/6tLTd68di3 Thank you 😁🙏 @HarshKapoor_ https://t.co/RqzxOSrAZR Sometimes?? 😜 thanks @arjunk26 🤗 https://t.co/LHLZdhOpd9 🤗 Thank you my lovely 😘 @sonamakapoor https://t.co/wBuSza2UKz Pari...First Look @OfficialCSFilms @kriarj @paramspeak #PariFirstLook https://t.co/GvO6YfjIjz Oh really.... just like.... #JabHarryMetSejalAug4 @iamsrk @RedChilliesEnt https://t.co/Nby2gQSZ7y Tell me....@iamsrk https://t.co/uXr90at8At RT @iamsrk: ...is seeking you! @AnushkaSharma  @RedChilliesEnt https://t.co/8L6N7d5req What you seek... @iamsrk  @RedChilliesEnt https://t.co/I48uQ102Su Connect with nature, discover its beauty and pledge to protect it. Happy #WorldEnviromentDay 🌱 What has this world come to become? Saddened to hear about the #LondonAttacks. Thoughts and prayers with victims &amp; families! 85% of women in India lack access to Sanitary Pads. Make a difference, support - https://t.co/FK1hLBR4z2\nhttps://t.co/Er2WrGhInI Owning it all with @GraziaIndia 😎 https://t.co/eNsItDK1Aw #OpenDefecation is harmful for everyone, esp for women! Build &amp; use toilets, pl support #DarwazaBand @swachhbharat \nhttps://t.co/0l42E3IOB0 This is monstrous to say the least ! Sick sick sick to my stomach!! Humanity at an all time low ... again https://t.co/0Hh3WmHL9z RT @IndiainSL: 3rd Indian Ship arrived. Indian and SL Navy teams working hand in hand @SushmaSwaraj @narendramodi @indiannavy @MEAIndia #Fl… RT @IndiainSL: IndianNavy saving precious lives making sure no one is left behind #FloodSL @narendramodi @MEAIndia @SushmaSwaraj @DrSJaisha… RT @swachhbharat: We are going live soon. #DarwazaBand is a step towards progression. Construct a toilet and ensure the #SafetyOfWomen. @An… Guys! @authoramish new book #SitaWarriorOfMithila is out NOW!! Grab your copies! Thank you for the pre release copy!Can't wait to read it 📚 https://t.co/JAVNQJUj8K Honoured to be a part of @swachhbharat campaign. Please adopt healthy sanitation practices &amp; construct toilets to ensure #SafetyForWomen 🙏🇮🇳 https://t.co/NESTbTfXAv Learning about you &amp; your efforts,in such times that we are living in , gives a deep sense of relief &amp; hope 🙏🏼 @AfrozShah1 Many congratulations &amp; heartfelt respect to You 🙏🏼what You've done with Versova beach is truly truly inspirational 🙏🏼@AfrozShah1 Thrilled that I'm the newest member of the @PolaroidSun_IN family! Thanks for welcoming me with open arms &amp; the coolest shades! #PolaroidSun https://t.co/HncBHnwLWS So sad to hear about the devastating floods in Sri Lanka . My deepest condolences &amp; sincere prayers for everyone affected by it .... https://t.co/TcGqk9scPW Another spectacular innings delivered 👏 Congrats @sachin_rt &amp; team @ravi0404 ! #SachinABillionDreams out today! A must watch! Deeply saddened to hear about the Manchester attack . This brutality &amp; hatred is so so horrid &amp; frustrating.Prayers are with the victims🙏🏼 Grew up watching d warmth &amp; love #ReemaLagoo ji brought out on screen. Saddened by her sudden demise.Heartfelt condolences to her family... Thank u for this beautiful present &amp; all the very best for ur clothing line @sonamakapoor &amp; Rhea!You girls will smash it out of d park ❤️ https://t.co/1dG1ED78vP Thank you so much 🙏🏼😊 https://t.co/RUw9OPXLU8 Thank you Neha 🙏🏼that's so sweet of you 💜 https://t.co/e3u9kcvB1H Thank you 😘 https://t.co/7o4avKefa5 Thanks Ayushman ! Films looking great ! All the best 👍💜 https://t.co/sBli7uCamz Thank you Rahul 😊 https://t.co/niRELPt5RE Thanks buddy 🙏🏼😊 https://t.co/sKlc5SZwpC Thank you 🙏🏼😊 https://t.co/n3PcU75hmJ A big thank you to all my dear fan clubs for so much love on this day &amp; every day.. you are my strength &amp; make me smile always. 🙏🏻❤😘 Thank you so much for all the wishes, your love &amp; support means a lot. Thank you again 😇🙏🏻 Thank you Riya &amp; all the best for the movie ! Can't wait to see 😘❤️ https://t.co/AEo3kdQX1W Thank you so much 🙏🏼😊 https://t.co/ymXGRXN5Oe Thank you darling  😘❤️❤️ https://t.co/tzqN97o3EK Thank you man 😁🙏🏼❤️ https://t.co/r08c8BEyLg Thank you so much champ 😘❤️❤️ https://t.co/5eHWLIYZwO Thank you !! And for the flowers too 😘❤️❤️ https://t.co/eHhfj0qVuW Thank you so much 😁😁🙏🏼🙏🏼❤️❤️ https://t.co/yUK4bQjqmB Thank you my lovely 😘😘😘 https://t.co/DuXd1o8MnT Love you all !! Thank you ❤️❤️❤️🙏🏼🙏🏼🙏🏼 https://t.co/6UMelQ1zWc Thank you amullll 🙏🏼😊❤️ https://t.co/Sy8y2MrZy1 Thank you Mika ji 🙏🏼😊 https://t.co/NVGiW8vZI4 Thank you my lovely 😘🙏🏼❤️ https://t.co/UkUMR5SfST Thank you my lovely 😘🙏🏼 https://t.co/17g1rVIfVL Thank you 😁🙏🏼 https://t.co/B3JQYHsR5x Thank you Geeta !! 😘🙏🏼❤️ https://t.co/6DrhP94Vu2 Thank you so much 😁🙏🏼 https://t.co/EWUB3Qp0yJ Thank you guys 🙏🏼😊 https://t.co/C5DCCfp8UI Thank you Param 🙏🏼😊😊 https://t.co/EFXDDLR8et Thank you 😘❤️ https://t.co/PiZ7a8sRe7 Hahah thank you so much 😘😘😘 https://t.co/4R47joThye 😘😘thank youuu 🙏🏼 https://t.co/e0zp8PyL6x I'm so proud of YOU! Overcoming your fear of dogs &amp;spending entire day,actually walking out more loving &amp; fearless( well, almost) 😉.. ❤😘 https://t.co/DupCGqlPcr My heart goes out to all the Jawans and their families who risk everything for our safety, Please visit https://t.co/pkdC846sDz &amp; donate 🙏🏻 He will live on forever in all of our hearts as a true hero ... #VinodKhanna Remembering d glorious achievements &amp; contribution of Vinod KhannaJI in cinema&amp; his inspirational contribution as a human being in life RIP Spent the day at Udaipur's animal rescue shelter - @animalaid_india. Please visit or donate for animal care https://t.co/51ZXa0BM9d https://t.co/g7OmVnB0QN @AnushkaSharmaFC 😂U guys r so funny&amp;superCUTE 4 doin these awards!d fact tat U'll r crazy makes me SO happy❤hahaha #AnushkaFandomAwards2017 I request U all to place drinking water in bowls etc in &amp; arnd ur homes &amp; offices 4 birds to drink from.Summer's here &amp; they need ur help🙏🏼 https://t.co/Z9Wtvfa1fX Hey guys ! The dreadful summer heat is here . And you know it's too hot to handle. So , please… https://t.co/GlBm1sZnoQ The slate is ready again &amp; we're all set to roll on to a new adventure, a new film! @OfficialCSFilms 🙏🏼😊🙏🏼 https://t.co/IBrSt8CqnE For @FeminaIndia this month 💁🏻 https://t.co/lageBWKITL THIS is why we HAVE to talk about mental health openly !! At home ! In school ! At work place ! it should NOT be a taboo! So so saddened Hahahah thank you 🙏🏼😊 https://t.co/hvvV7AFAS3 It was entirely my honour to do so 🙏🏼 https://t.co/fqfvkrSXN8 Here’s how Shashi was created by @vfx_redchillies team! Incredible! https://t.co/A3Hs9q2D0p @diljitdosanjh @foxstarhindi @OfficialCSFilms 💃🏼🙈🙈🙈❤❤❤🙏🏼🙏🏼🙏🏼 https://t.co/6IDH5SEEeZ 😘👏🏼👏🏼waah waah !! https://t.co/ajYMl1yBF9 #DinShagnaDa 🎼❤️️out now https://t.co/GDpfNAFtOO @diljitdosanjh @foxstarhindi @OfficialCSFilms @TSeries @jasleenroyal #Phillauri 👻 RT @Martu_Annette: Look who decides to show up at work today.... #Phillauri @AnushkaSharma out version of u !!!😂 https://t.co/qZx9gVsOtK RT @ngill1994: @AnushkaSharma @diljitdosanjh The ending of the movie was the best part. #Phillauri RT @iankitnarang13: Jst saw #Phillauri, siraa laata @diljitdosanjh paaji.Amzng movie. @AnushkaSharma.Bhootan bare perception chnge ho gya e… This mug just got Shashified! Win it by sending a selfie with loved ones from the theatres while watching #Phillauri... 👻☺💃 @OfficialCSFilms https://t.co/dSH8D0dBm0 RT @javednama: @AnushkaSharma pahali baar aisa hua mere 5 saal ke bete ne aaj khush ho kar puri film dekhi..ab ghar aa kar wo shashi ko dhu… RT @REFLECTIVEBEAST: @AnushkaSharma I was a big fan of u anyway..But ..Phillauri... Wowsome..U touched the soul...Seen a classic after many… RT @UdayUbhasker: Watched Phillauri @AnushkaSharma  totally a great movie, please continue doing these kinda creative and original movies,… RT @amonsaini: @AnushkaSharma excellent story #greatmessage Words are not enough to Express about your movie.It was damm Awesome Loved ur m… RT @docgursev: @AnushkaSharma.. Saw Phillauri ystday.. Kudos to u n the entire team.. Heartwarming story.. Soul stirring music.. Keep up th… Thank you 🙏🏼🙏🏼🙏🏼 https://t.co/OXAuABi3w2 ❤❤❤❤❤😘😘😘😘 https://t.co/9vsy2dWMb3 😘yayy thank you !! https://t.co/558iNo8oJG @EsraSharma lots of love ❤ It's great ! Thank you 🙏🏼🙏🏼❤ https://t.co/KSbI4xuMs4 Anushka Sharma's Latest Bollywood Outing As A Friendly Ghost In 'Phillauri' Is Off To A Solid Start via @forbes https://t.co/Ygz9m5YFb0 Hey guys ! Thank you for the recognition 🙏🏼🙏🏼❤https://t.co/dg4BpSeucJ RT @Rishikhator: @AnushkaSharma Words are not enough to Express about your movie!!!It was damm Awesome Loved ur movie!!!Hope to see uhh soo… RT @ResKals: @AnushkaSharma You, enlightening poetry and Romy's voice! I did not know such a blissful experience was possible inside a movi… RT @sunbanerjee: @AnushkaSharma Beautiful Movie Mam, a family movie, original script and brilliant cast. DADI ZINDABAD ..Chalo Peg Banate H… RT @munish99897583: #Phillauri was a Fairy tale kind with a tinge of Humour! What an ending..I was in tears😭❤ Loved @diljitdosanjh @Anushka… RT @ankanroy2006: @AnushkaSharma 'Phillauri ' is a brilliant film,it makes you want to fall in love again,the climax reminds  me of 'Titani… RT @floralanki: Loved your film❤️❤️❤️ the films holds a special suspense in last which make it more interesting! .@Mehreenpirzada .@Anushka… Thank you Nikhil 🙏🏼😊😊 https://t.co/7sAXiBcktR RT @tanejamainhoon: Loved the simplicity of #Phillauri. the love with which it's been made was so visible. @AnushkaSharma @diljitdosanjh, t… RT @tanejamainhoon: Saw #Phillauri and found it to be such a sweet little Disney-like film that families *should* watch together. @AnushkaS… Thank you my lovelies !! 😘❤🙏🏼 https://t.co/7ERL9gJ9nm RT @TanviG: Just saw #Phillauri! Lovely film! Full of sparkles &amp; immense joy! Beautiful, bright &amp; brave! Congrats @AnushkaSharma #Kannu #An… 😘🙏🏼 I hope you do too 😁 https://t.co/fiVd7ZC8yf Thank you 🙏🏼😊 https://t.co/FgL5mL1Wcj Thank youuuu Prashant !! 🙏🏼💃🏼💃🏼👻 https://t.co/zH9oKZfpXV RT @SinghhPrashant: What a spirit-ed, 'complete' performance! Your range &amp; depth shine so bright in Phillauri, @AnushkaSharma! A unique wor… RT @lojaKLogic: @AnushkaSharma @diljitdosanjh just watched #Phillauri and it's brilliant. Innocently connects so many dreamers and lovers a… RT @xmaybabyy: Funny, romantic &amp; tragic all at the same time. The end completely shocked me but still left me with a smile :') Such fine ci… RT @xmaybabyy: #Phillauri is one of the those few movies that makes you smile &amp; weep at the same time. Makes one believe in true love ❤😌 RT @WWOTweets: We're proud of our girl power that brought about #ShashiWasThere @nikkikhandelwal @jigyasapanchal &amp; @cinemawaali! To the pow… Did you all enjoy the #ShashiWasThere campaign? Meet the amazingly talented girl gang behind it !! 🙌👇🏼💃🏼👻 @WWOTweets ❤you guys !! https://t.co/DQ5S34O4kq Thank youuu Raghuvendra !! 🙏🏼😊 https://t.co/BL4EsL2UlP RT @aniketmitra2013: #Phillauri pushes the envelope beyond benchmarks set before. @AnushkaSharma need more like this from you. High Hopes f… RT @jasminesandhu_: #Phillauri is such a heartwarming story. Kudos to @AnushkaSharma for supporting such beautiful films &amp; bringing them to… RT @AbhishekPathakk: Saw #Phillauri lst night. New benchmark in new age cinema! I alwys say filmmakin is abt passion money &amp; also Guts. Gre… Thank you 🙏🏼😊 https://t.co/dyrK1p0JDX RT @Anushka_S_FC: Watched #Phillauri with my family. Ofcourse I went with high expectations, yet the movie surpassed even that. Beautiful m… Thank You 🙏🏼 https://t.co/tXUzxXOs6n Thank you 😊 https://t.co/eeWSovAY11 RT @BhartiSahai: @AnushkaSharma  going to watch #Phillauri with my 8 yr old ,she will never get scared of ghosts after meeting #friendlygho… RT @Ridzi1: #Phillauri is different, progressive &amp; has great actors @diljitdosanjh @AnushkaSharma. Respect. *A fantasy movie yet so close t… RT @purvisparekh: Enjoyed #Phillauri - a fictional film yet so close to reality. Hats off to makers for daring to make this one so beautifu… RT @SaraogiChetan: @AnushkaSharma I usually go for a movie just to get a \"feel good\" feeling.. #Phillauri was an ultimate experience.  Enjo… RT @Chansoi: #Phillauri the movie that was pure sweet and leaves you with tears of joy! @AnushkaSharma @diljitdosanjh your phillauriness co… RT @rachitaprasadET: Loved #Phillauri! Unusual story, decent script, feel good and entertaining! I like what @AnushkaSharma is doing with h… RT @rockychoudhary: @diljitdosanjh @AnushkaSharma just saw phillauri... amazing movie ... love is internal... fully enjoyed #Phillauri http… Thank you uncle 🙏🏼😊 https://t.co/bm1TQoacEJ Thank you so much 🙏🏼😁 https://t.co/uRoMDamARM RT @unicornisland11: @AnushkaSharma felt so good to watch something new and fresh in a bollywood movie. That last scene is continously play… ❤😘🙏🏼 https://t.co/GZGvUDebib RT @Mamtahere: @AnushkaSharma saw the movie last night in Dubai.. all of us LOVED it ❤️ made me laugh, cry, and feel that aha moment when I… Thank you Akshaye 🙏🏼😁 https://t.co/27nMnpekmj RT @sandy3037: Success is when the work of a producer is appreciated not just about the money the movie makes.. Amazing one well done @Anus… RT @mrun29: @AnushkaSharma you are amazing in phillauri.true love is eternal&amp; that is what we all saw in this movie!Take you family for the… RT @preethamparigi: Movie Phillauri : an absolutely enjoyable movie ; do not miss it ;congrats Anushka indeed a great initiative @AnushkaSh… RT @LohiaDiwakar: @AnushkaSharma saw phillauri today. A great movie and as always best acting done by you. Once a fan always a fan. proud b… Thank you Rahul 😘👻🙏🏼 https://t.co/xjupU9tT36 RT @VikasKalantri: T-2(#Phillauri) contd - to top that the absolutely 1st rate performance by @AnushkaSharma amazingly supported by @diljit… Yayy thank you ! 🙏🏼 https://t.co/jDTMdyrXPv Thank you 😊! https://t.co/BfnjcaHQ1z RT @sunnybh1412: @AnushkaSharma awsome movie..tears in my eyes at the end\nI am Surgeon nvr believed in souls aftr watchn I do now.@diljitdo… Thank you 🙏🏼😘👻 https://t.co/RTZX7B7eZd RT @saminaUFshaikh: If you believe in true love &amp; its existence, then go &amp; to watch @AnushkaSharma @Mehreenpirzada @diljitdosanjh &amp; #SurajS… RT @taran_adarsh: #Phillauri opens well in UAE-GCC. Collects $ 260,000 [₹ 1.70 cr] on Thu + Fri [witnessed 40% growth]. RT @OfficialCSFilms: #Phillauri is garnering 💓 from all corners! Book tickets now- https://t.co/vpJS03LRfi @anushkasharma @diljitdosanjh @f… Thank you so much Amish 😁🙏🏼💃🏼 so happy you did ! https://t.co/oxuOtVDXoZ Kyunki .. main aap sabka wait kar rahi hoon theaters mein ! Who knows next seat pe maybe #ShashiWasThere 👻😉 #ShashiInTheaters https://t.co/slw5ToD4lC Iss weekend aapki family ke saath miliye Shashi ko ... #Phillauri 👻👻👻 https://t.co/pTRkWr6yUR Yayy 😁💃🏼🙏🏼🙏🏼🙏🏼👻 https://t.co/CfcTDDfHTA 🙏🏼👻 https://t.co/6zmqMTFtcu RT @Zak_Shraddha: @AnushkaSharma The most unpredictable actress in Bollywood. U were enchanting as Sashi! Thank U for gifting us such a bea… RT @12deepak3: #Phillauri a nice movie,superb performance by @AnushkaSharma after the hit movie NH10.nice family entertainer.sure shot hit RT @memusicnfewords: @shashwatology the music is epic in #Phillauri and thnks @AnushkaSharma 4 making us to experience a new genre Fantasy-… RT @sweta_mondal: Watched #Phillauri 2day vT my mom\nIts a Beautiful &amp; Unique Concept Movie! @AnushkaSharma &amp; @diljitdosanjh done an Outstan… RT @iHaroonRashid: #Phillauri is quirky and novel and yet emotional and intense. Loved it! Great performances from @AnushkaSharma @diljitdo… 🙏🏼🙏🏼❤ https://t.co/gMUZeBbJRj 🙏🏼❤ https://t.co/dqwXLOwIfv RT @bhanuvyas27: #Phillauri is a refreshingly cool breeze   as ☀️ begins its sprint. Pleasantly subtle film making. @AnushkaSharma kudos fo… ❤ hope you enjoy it ! https://t.co/33W0tFHlsD Hahahah thank you !! 😹👻 https://t.co/HMtD8ntSTq 🙏🏼Thank You 😊 https://t.co/LXQKIEc2kP 😂 hope you do 🤞🏼👻 https://t.co/JgW9FojFVN RT @bollytrollz: #Phillauri is different and one should give credit to @AnushkaSharma @OfficialCSFilms for it. The performances are surely… RT @Udit_Mishra24: #Phillauri is emotional, entertaining and good family watch. I liked it more due to the literary part. Kudos to @Anushka… RT @Dipeshtibrewal: @AnushkaSharma watched #Phillauri for the 2nd time,what an amazing movie! Enjoyed even more watching it again😊 RT @jdipali: @AnushkaSharma #Phillauri what a entertaining movie with a strong message for young generation, many many congrats @AnushkaSha… RT @anupamachopra: Wonder how movie ghosts are created? @vfx_redchillies tells @MissusDesai about @AnushkaSharma in #Phillauri: https://t.c… Hey!! Yes pls do ❤🙏🏼😘 https://t.co/xqd5MF0RU3 RT @ETPanache: #Phillauri review: A unique plot backed by brilliant performances.\n@AnushkaSharma \n@ImSurajSharma\n@diljitdosanjh\nhttps://t.c… RT @PratimDGupta: \"All that glitters is sometimes gold\" - my review of the heartwarming #Phillauri in t2, The Telegraph... https://t.co/GqY… RT @aaratiii: I swear I could see only happy, smiley faces in the theatre after watching #Phillauri! @AnushkaSharma take a bow! Loved watch… RT @MeenalNarula: @AnushkaSharma More power and respect for you after watching #Phillauri \nApplying for a job at #CleanSlateFilms right awa… RT @RajKhan71514406: @AnushkaSharma #Phillauri is one of the best movie of 2017, post DANGAL this is d movie i hv watched twice. I m in lov… RT @RiddhiNair: @AnushkaSharma #Phillauri is enchanting!Heartwarming tale of ❤️!All the sparkles left me both glittery &amp; teary at end✨Memor… RT @MeenalNarula: @AnushkaSharma Your movie made me cry with tears of joy! Happy endings ARE magical. Kudos! Keep producing many more such… RT @skyarora23: @AnushkaSharma  congratulations, for such a great movie. #DifferentNewConcept and loved the every scene.  💝💝💝 https://t.co/… RT @PoojaVGumber: #Phillauri loved every bit of the movie. Saw first day first show first time. Celebrated my bday wth 2 #Phillauri 's..ama… RT @SunakshiAgrawa1: #Phillauri unexpected and totally different concept movie @AnushkaSharma great work👍,loved watching it😍😘 RT @kfpanja1: Humare to koi tweet he notice nai krta 2 tweets ki to b no reaction ! #phillauri #sashi_isNotThere @AnushkaSharma RT @freezebyte: Happy to see simple stories with great execution back in Indian cinema. Great job #Shashi @AnushkaSharma #Phillauri Loved e… RT @faisalkingkkhan: @AnushkaSharma wtchd #phillauri night show awsme all in one movie👏.Lovd that Frndly horror scenes. A must watch family… RT @anwar0262: #Phillauri is a different movie.Thanks @AnushkaSharma For Phillauri! You're amazing in this movie.More power to you!\nhttps:/… RT @AnimeshJindal27: Goosebumps guaranteed in the Last scene of #Phillauri &amp; the music  and साहिबा!!! ❤️ the movie!!! Great work @AnushkaSh… RT @mhatreofficial: @AnushkaSharma  today i watch #Phillauri  amzing movie 🎥 anushka 🎩 off 2 u ✌🏻✌🏻✌🏻 RT @afsar09: @AnushkaSharma #Phillauri \nIs a must watch movie and it is a family movie with a super climax. \nThe story is Awesome 👏🏻😊😘 RT @jstrohit: @AnushkaSharma Superb story , climax 👍, &amp; both the #Phillauri were suuuuperb ! A must watch movie full too Family entertainme… RT @Barunnitb: #Phillauri is truly different try and well done @AnushkaSharma , Superbly done and well supported @diljitdosanjh n sweet @Me… RT @Satyam_raj1: @AnushkaSharma  What I feel is that these Kind of Movies #Phillauri also gives a boost to people who wants to watch pictur… RT @shrusti15: #Phillauri is a different movie.❤ Thank you @AnushkaSharma For Phillauri! You're amazing in this movie.👏 More power to you!😘 RT @SRKnitin_rathod: @AnushkaSharma #Phillauri is a family movie after long time. From kids to elders..All can enjoy it.. watch it for fun… RT @muskaan228: @AnushkaSharma #Phillauri .it was one of the best movie i have ever seen. Hatsoff anushka ma'am..the best part was the end,… RT @embraceelife: @AnushkaSharma what a different movie #Phillauri is😍 it was so damn touching!! I'm in love with your avatar- Shashi! Go r… RT @RohitduttPujari: @AnushkaSharma Phillauri is a perfect movie which makes us laugh and cry, also redefining romance on celluloid,emotion… RT @Rushmi9009: @AnushkaSharma watched #Phillauri beautiful film, dnt why i had tears,mastaa,full on Paisa Vasool entertainment @diljitdosa… RT @KatVeerMyworld: Phillauri!!! What an amazing movie!!! Hatsoff to @AnushkaSharma  for pulling it out in the best way possible! A must wa… RT @ThatBoyMusty: #Phillauri is Beautiful with VFX utilised with perfection.👏🏻 @AnushkaSharma is surely leading the way with @OfficialCSFil… RT @Hanan238Hanan: @AnushkaSharma wonderful creation #Phillauri loved it! Looking for more such films under clean slate banner!!🙋🙌 RT @Sivashankar7078: @AnushkaSharma I'm watching in 2nd time very nice movie.. RT @TheLoyalSRKFan: Hatsoff to you @AnushkaSharma .Take a bow.. #Phillauri is outstanding and your performance was amazing.. Will watch it… RT @puja49090: @AnushkaSharma My TICKETS R BOOKED. Me and my 2 little angels gona go and haunt #Phillauri lolz my 8years old is d most exci… RT @sonamsona55: @AnushkaSharma thank you so much for taking risk and making something different loved #Phillauri amazing movie👌🏻!! 😍 RT @shibani_kapur: #Phillauri is way beyond a beautiful love story.Extremely layered &amp; so relevant! Take many bows @AnushkaSharma Power on! RT @anniebaghatinni: @AnushkaSharma generally don't like any supernatural movie. On hubby' s insist I had seen #Phillauri.and I love him fo… RT @kumarpiyush2929: @AnushkaSharma Amazing movie! The concept &amp; acting 👏👏music is wow all was perfect!What a movie! Last part was truly ma… RT @Princesspakul: What a movie?!❤😍 Beautiful. Loved every bit of it. Laughed and cried. Just amazing.😀 #Phillauri @AnushkaSharma RT @shoib786: Concpt of movie is to gud #Phillauri 💫 Ending of movie is awsm &amp; also the acting of @AnushkaSharma 💫 again u stole my heart 💚… RT @saurabhm77: Mesmerizing movie! \nGreat story great message.👍🏻\nFeels good when Bollywood makes such beautiful movie\n#Phillauri must watch… RT @Beigevalls: @diljitdosanjh @AnushkaSharma warm n tender, I came out teary eyed, but with a smile...every character super, n punjabiat s… RT @skatheeth: @AnushkaSharma #phillari  is one of the sweetest movie I have watched in long time.guys go for it! U all will love it. RT @ScripsReader: @AnushkaSharma after a really long time I took my entire family for a movie including my kids, dad &amp; in-laws too! Proud o… RT @mimansashekhar: #Phillauri is for those who still swear by old school romance. It's a dreamy tale, a special film.. Thank u @AnushkaSha… RT @filmfare: Movie Review: #Phillauri \n\nRating: 4/5\n\nYou'll enjoy #Phillauri beyond imagination.\n\nhttps://t.co/pxJrgPYgzc Thank you love ❤😘 https://t.co/NeshTFEl4X RT @mimikasaha: A beautiful movie #Phillauri Heart fills with warmth and love, thanks 2 @AnushkaSharma for bringing such a simple yet heart… RT @aakashsai1: @AnushkaSharma \nIt's the first time that tears are rolling out of my eyes after watching a movie! \nBestest movie I've ever… RT @yashvidyasagar: @AnushkaSharma finally a movie in the market that I can watch over and over with family and friends😍\nJust loved it @Anu… ❤😘🙏🏼 https://t.co/ENPwzFAGFD RT @sandeep_adnani: @AnushkaSharma refreshing warm tale with solid content &amp; story, the film integrates history, love and music in a unique… RT @Swagz_VK: Main toh Phillauri dekhke pagal ho gayi hun!!😍😍😍 Uff...Just going mad😉😎🔥 @AnushkaSharma @diljitdosanjh Dhanyavaad for this am… RT @LetsDoItNw: @AnushkaSharma Very few stories makes that kind of impact. Mesmerized by the story specially the 2nd half... A story of lov… ❤😘 https://t.co/m41RdKo912 RT @thekumarpushkar: Soulful plus the most unexpected nd beautiful climax! @AnushkaSharma is the cutest bhoot ever and @ImSurajSharma was a… RT @apurvjessy: #Phillauri rides on the faith in its content,the courage to expt and on the sincerity to be different Like NH10.Well done @… RT @RVCJ_FB: Everyone Is Loving Phillauri ! Twitter &amp; Celebrities Just Cannot Stop Praising This Movie!\nCheck here:\n\nhttps://t.co/TACjDGHjo… RT @bhawanasomaaya: Read my review of @AnushkaSharma &amp; Diljit Dosanjh's #Phillauri\nhttps://t.co/y1yzS46vsM https://t.co/sLkAUE10i1 🙏🏼thank you 🙏🏼💜 https://t.co/xYc9GhTm59 RT @foxstarhindi: The 3 powerhouse performers of #Phillauri are the talk of the town! https://t.co/6erZ9worsQ @AnushkaSharma @diljitdosanjh… RT @thewire_in: #Phillauri finds a sincere new way to tell an old story, writes @Plebeian42 https://t.co/hXCi1sSrna https://t.co/jOvOxJc4oP RT @livemint: Film Review: Phillauri https://t.co/TyC8GLs3A0 RT @TheWeekLive: .@AnushkaSharma is the thread that holds #Phillauri together. Read our #MovieReview: https://t.co/vTF2Oe3Tnu\n@ImSurajSharm… Hahahah superb !! ❤😘🙏🏼 https://t.co/bv2HMTBxhn ❤👻 https://t.co/xPyBrtotIZ RT @thetribunechd: #MOVIEREVIEW - #Phillauri \nIn high spirit(s) \nhttps://t.co/kzoXAvbxrh \n| @AnushkaSharma | @diljitdosanjh https://t.co/Z7… RT @FilmCompanion: REVIEW: #Phillauri has many soft spots but you walk away with a smile - @anupamachopra. Watch her take on the film: http… RT @foxstarhindi: #Phillauri &amp; its 3 power performers are winning hearts! Book seats now: https://t.co/6erZ9worsQ @AnushkaSharma @diljitdos… RT @deespeak: Go watch #Phillauri!!! Experience true love ❤️@AnushkaSharma @diljitdosanjh #PhillauriToday RT @anupamachopra: REVIEW: #Phillauri feels at once fresh and old-fashioned. My take: https://t.co/JJJXjvUkc9 RT @manojdhakshan: guys if u want to know the meaning of true love then go and watch #Phillauri one of the best films in recent times @Anus… Wow thank you 🙏🏼❤#PhillauriDay https://t.co/LMONxtTUZd I love you 😘 #PhillauriDay https://t.co/uDW7rotRXl Arre baba ! I'm here ! And I see you 👀 lots of love #PhillauriDay https://t.co/PJYsbSuYR7 RT @ZeeNews: Phillauri movie review: Anushka Sharma as Shashi is bewitching; Suraj Sharma proves his brilliance in a funny way! https://t.c… RT @cinespeaks1: https://t.co/RRNfDZ3aT4\n\nWhat a movie!! Well done team #Phillauri\n@AnushkaSharma @diljitdosanjh @ImSurajSharma @foxstarhin… RT @bookmyshow: #FridayMovieReviews #Phillauri\n\nAnushka is the most sensible ghost wife ever. @AnushkaSharma @diljitdosanjh\n\nhttps://t.co/8… RT @IndianExpress: #Phillauri audience reaction: @AnushkaSharma as Shashi wins hearts, watch video\nhttps://t.co/0D2jvVsZmt https://t.co/lM6… ❤😘 thank you !! https://t.co/p6ZKPD0zlV Ok guys !Thank U for joining me ! And thank you for all the love &amp; best wishes for #Phillauri !Hope y'all like it cuz it's #PhillauriDay ❤👻 Thank you 🙏🏼🙏🏼🙏🏼 #PhillauriDay https://t.co/VjyVNtN99t Thank You 😊 so much #PhillauriDay ❤ https://t.co/XpKDZRHlDB Thank you 😘❤🙏🏼 #PhillauriDay https://t.co/Ty5IRWlyYV Cheer up !! 😘 and enjoy #Phillauri #PhillauriDay https://t.co/mx0nVuy8kV Awww thank you ! And take care #PhillauriDay https://t.co/zbqrzX4iUl Thank You 😊 #PhillauriDay https://t.co/KHeGoVpWOc THANK YOU 🙏🏼🙏🏼🙏🏼#PhillauriDay https://t.co/jRqGPMBMxI Love to both 🙏🏼❤#PhillauriDay https://t.co/Cfj0XPtqfb Very happy that people are loving it #PhillauriDay https://t.co/IEZnUNiHcV ❤😘😘😘#PhillauriDay https://t.co/OjqjBIOGXI Thank you 🙏🏼❤#PhillauriDay https://t.co/TrSny40lJm RT @OfficialCSFilms: It's not just a regular Friday, it's #PhillauriDay! Book your tickets- https://t.co/vpJS043s6Q @anushkasharma @diljitd… ENJOY with wifey !! #PhillauriDay https://t.co/0rgHNucjLa Love you 😘 #PhillauriDay https://t.co/tZxNwIlIFy 😘😘😘🙏🏼🙏🏼🙏🏼#PhillauriDay https://t.co/Wqq2XxsRNq You can watch #Phillauri with both friends and family.  It's a total family film ! And kids friendly too ❤🙏🏼#PhillauriDay https://t.co/3mMJsNWYXR Please send it after you're done watching 👻 #PhillauriDay https://t.co/mG1wDD0TJk Thank you !! #PhillauriDay https://t.co/xTjpMswVW1 I love you all so much😘❤🙏🏼🙏🏼🙏🏼 https://t.co/paj0hFe5Ll Thank you 🙏🏼 hope you enjoy it #PhillauriDay https://t.co/oIuZWFZiAN Hahah does it ? #PhillauriDay https://t.co/MMeq4siEfc ग्रेट ! Enjoy your evening with #Phillauri 👻👻❤❤🙏🏼🙏🏼#PhillauriDay https://t.co/WgGGzmywLn ❤👻#PhillauriDay https://t.co/dAuCfcZwqj Thank you so so much  🙏🏼❤#PhillauriDay https://t.co/deajiifQwe Amazing !! Please go with entire family &amp; friends !! #PhillauriDay https://t.co/yHVbs0XbnD Waah waah !! 🙏🏼😊💃🏼 send photo ! #PhillauriDay https://t.co/qSbyq8APqY I did 😊 it was lovely ! #PhillauriDay https://t.co/IdFDuvaQXe Lovely ! He is so talented &amp; such a good guy #PhillauriDay https://t.co/CNBVAuL1EH Awesome ! All the best to you and enjoy #Phillauri tomorrow #PhillauriDay https://t.co/FOqfPxHXn5 AWESOME!! enjoyyy again ! #PhillauriDay https://t.co/oCTG5mtOGf 💃🏼💃🏼💃🏼 enjoyyyy #PhillauriDay https://t.co/FO8Z5OLZ6d ❤❤❤#PhillauriDay https://t.co/kCkgNj4EvB Yes mostly I was I think 😊#PhillauriDay https://t.co/VaL5Sd6Hq3 Enjoy the show 👻❤#PhillauriDay https://t.co/GpViUnSWD1 So happy you liked it !! 🙏🏼❤#PhillauriDay https://t.co/tblsqJsacM Hahahah ok ! 😁👻🙌#PhillauriDay https://t.co/pJkiq2nRAv All are so so good ! But I love the brother sister track a lot ❤#PhillauriDay https://t.co/5S5Im9UCuZ Thank You 😊 🙏🏼👻#PhillauriDay https://t.co/51uMXcIMjS Same 🙌😊👻#PhillauriDay https://t.co/Xow5Ofy1ZQ Thank you so much ! Happy you want to watch again&amp; again 🙏🏼😘❤👻#PhillauriDay https://t.co/PrjlwvSTHf Prettt rad ! 😘🙏🏼👻#PhillauriDay https://t.co/jzyKSeoLC9 🙏🏼🙏🏼🙏🏼 thank you 😘❤ so happy you loved it ! #PhillauriDay https://t.co/D07S3FpTkD Thank youuu 😘😘😘👻👻#PhillauriDay https://t.co/32yKt1Wti8 Watch the film you'll know 😋👻#PhillauriDay https://t.co/8wAMDvE6td Have tremendous faith of audience hopefully! 🙏🏼😊#PhillauriDay https://t.co/T95nc2WNHh Hahah Enjoy watching #Phillauri then !! #PhillauriDay https://t.co/eZ5qM03smq Thank You 😊 🙏🏼👻#PhillauriDay https://t.co/hdp01wdlLi Yes something 👻 https://t.co/Rvg6Hq77ry पूछिये अपने सवाल मुझ से !! #PhillauriDay Hi guys !! Are we ready ? Let's chat cuz it's #PhillauriDay ❤💃🏼 😁🙏🏼Bhoot Bhoot Dhanyevaad 😁🙏🏼 💃🏼💃🏼💃🏼 #Phillauri #PhillauriDay https://t.co/maIKtWcMs6 RT @punjabkesari: LIVE AUDIENCE REVIEW \n\nMovie Review: “PHILLAURI” \n#PHILLAURI .@AnushkaSharma\n.@diljitdosanjh\n \nhttps://t.co/pTAjIsgMQK RT @KomalNahta: #Phillauri may have started slow but have no doubt. It is BOUND TO PICK UP due to positive word of mouth coz it's a wonderf… Ab jo main aapse theatre mein milne aa hi gayi hoon toh socha thoda chat vat bhi karlein! Theek 4 baje, yahin Twitter pe #PhillauriDay 👻👻 RT @filmfare: Movie Review: #Phillauri \n\n@AnushkaSharma's performance as a loveable and slightly sarcastic ghost is entertaining\n\nhttps://t… RT @TOIEntertain: Movie Review: #Phillauri\n\nhttps://t.co/afCd3YPfvh RT @ibtimes_india: #Phillauri Movie Review | \n.@AnushkaSharma-@diljitdosanjh shine in a soul touching ghostly affair \nhttps://t.co/VsJk9A8o… RT @BollyTonic: #Phillauri : An Incredible Entertainer Which Will Win Hearts of People!! 3.5/5 https://t.co/D37rd7xkvc @AnushkaSharma @dilj… RT @justscorpion: Here's my review on @PhillauriFilm @AnushkaSharma @OfficialCSFilms @diljitdosanjh https://t.co/w222qAxZnC 😘😘 https://t.co… RT @ndtv: #Phillauri: @AnushkaSharma plays Shashi with remarkable restraint 👏👏👏– read Saibal Chatterjee’s review\n\nhttps://t.co/BtJ0YttafR h… RT @radiochatter: #Phillauri is pure magic! What a \"super\"natural experience. 4 stars for this poetic and extremely funny film. Review soon… RT @EntDC: #Phillauri movie review: An incredible, dreamy tale comes to life.\nhttps://t.co/uzohZ4z9tX https://t.co/dPDucsa3eR RT @MumbaiMirror: #Phillauri: Here's what the fans told #Mirror about @AnushkaSharma 's film https://t.co/cHnfOrhFvv RT @vinamravinamra8: @AnushkaSharma delivers her career-best in #Phillauri.\n@foxstarhindi \n\nMy review-3.5 STARS\n\nhttps://t.co/9XrMWXclx5 RT @indiaforums: #MovieReview\n@PhillauriFilm : @AnushkaSharma taught us,'True love is ETERNAL'\n#PhillauriWithTixdo #Phillauri https://t.co/… RT @imMDP: Best Pair of 2017, Best Climax of 2017, Not seen such kind of purity in any recent movies. Thanks #Phillauri @AnushkaSharma @dil… RT @DMmovies: AUDIENCE MOVIE REVIEW #Phillauri wins because of its unusual story, says MJ @Smitavkumar @AnushkaSharma https://t.co/RnqlTSSm… RT @iamkajalthakur: Watched #Phillauri &amp; wattaaaa scintillating performance by you #Shashi jiii @AnushkaSharma 😁👏👌 &amp; @diljitdosanjh nailed… RT @SamRedefind: Such a refreshing movie with amazing performances and a stellar soundtrack. Loved #Phillauri. @AnushkaSharma @ImSurajSharm… RT @indicine: #Phillauri Movie Review https://t.co/8yqN9L8kTR RT @ChhotaRecharge: Hard not to fall in love with @AnushkaSharma as Shashi. Reminded me of the time I dreamed of finding Casper in my room… RT @panku_: #Phillauri is such a 💓movie! \nBrilliant is the casting of ALL the characters. Be it Punjabi Dadi or the Midget Chotu. Just perf… RT @Koimoi: #PhillauriReview: It is a fun watch thanks to its light-hearted story @AnushkaSharma @foxstarhindi @OfficialCSFilms https://t.c… It’s here! #Phillauri in cinemas today! 👻 https://t.co/Os1VoUu6ES @diljitdosanjh @foxstarhindi @OfficialCSFilms RT @Papupav: @AnushkaSharma is the cute and sweet ghost i have ever seen ☺❤ a very nice touching iternally romantic film #Phillauri gr8 mov… ❤🙏🏼pleassseee do !! https://t.co/zLCu4pyVTR RT @RjHarshil: Interval : Wah @AnushkaSharma #Phillauri looks so fresh. Wonderful story. RT @nikkikhandelwal: #Phillauri is magic! A beautiful concept brought alive in such an endearing manner. More power to the amazing duo @Anu… RT @rahulkantsingh1: #Phillauri btiful movie. 1 can watch it again and again. I would say a Romantic Comedy movie. But beautifully prsented… RT @priya_2530: @AnushkaSharma is the cutest ghost I have seen so far in films @PhillauriFilm has redefined the meaning of love. True love… 😘😘😘🙏🏼🙏🏼🙏🏼 https://t.co/6yHFbzIXcn RT @SanDhirObsessed: #Phillauri is a simple yet powerful movie and I'm so happy to see such beautiful movies being made in Bollywood ❤️ @An… RT @SunaraLovesArHi: @AnushkaSharma @diljitdosanjh #Phillauri ws a delight!Such an endearing tale told so lovingly.Watched t TWICE ALREADY!… RT @Aahutee: An untouched subject, a unique way of weaving the stories &amp; beautiful dialogues..that's #Phillauri @AnushkaSharma u're an insp… RT @iRidhiDogra: Be sure to catch #Phillauri in cinemas tomorrow. It's a family film, friend's film, children's film, lover's film. It's a… Simple &amp; pure fairytale rooted in reality .. wow .. thank you 🙏🏼😊❤ https://t.co/jQCTmaWppw RT @SwatiTrivedi: #Phillauri is a treat for movie goers..@AnushkaSharma this industry is so blessed to have a talent and producer like you.… Hahaha 😍😘❤👻👻👻 https://t.co/POobCJDvhk RT @iRidhiDogra: The power of simplicity.Eyes speak when dialogues stop. Kudos @AnushkaSharma @diljitdosanjh #surajsharma @MehreneKaur @man… RT @lovefarhanakthr: @AnushkaSharma anushka I saw the movie...really I can't explain my feeling about it...really I love u from my heart.❤️… RT @Tweet2Amish: #Phillauri is a refreshing film that Indian cinema needed ! The entire cast &amp; crew did an Amazing job! #ShashiWasThere cam… RT @Tweet2Amish: .@AnushkaSharma carried the film on her shoulders very perfectly! The role of producer and actor done to the perfection! K… RT @Tweet2Amish: .@ImSurajSharma does an awesome job along with @Mehreenpirzada who bring the characters of Kanan and Anu to life!👍🏻 RT @Tweet2Amish: .@vfx_redchillies has done a splendid job with the film #Phillauri ! Especially the last sequence was fantastic! It's quit… RT @Tweet2Amish: .@OfficialCSFilms You guys are on roll! Your second venture is as dynamic as the first one! Looking forward to your future… RT @Tweet2Amish: #Phillauri is a great film to watch with your loved one, family, friends! \nThe screening of #Phillauri 2day showed mind bl… RT @iRidhiDogra: The Beauty of simplicity &amp; innocence on celluloid is missed in this day and age. Take a bow team #Phillauri #Anshailal pro… RT @ShettyTejal: A forever reminder of your strength and supernaturalness @AnushkaSharma 🙌 #Phillauri is unbelievably magical. RT @cinemawaali: Absolutely loved #Phillauri! @AnushkaSharma is pure magic, literally! More superpowers to you for bringing forth such exci… RT @raisaghosh: .@OfficialCSFilms Congratulations for backing such beautiful stories with Magical storytelling @AnushkaSharma #KarneshSharma RT @raisaghosh: .@AnushkaSharma woman of substance strikes again. The best producer bankrolling these projects n outstanding performer! Lov… ❤😘🙏🏼thank you Ashish https://t.co/fEJkpscW9T RT @bhaktikmehta: #Phillauri is from the heart! Touched!\n#eternallove Zindagi ke saath bhi, Zindagi ke baad bhi\n@AnushkaSharma put her 'sou… RT @Ritikajain09: Loved #Phillauri\nSubtle and impactful!\nNew face, Mehrene, is such a breath of fresh air! Great ensemble\n@foxstarhindi @An… RT @tamannaW: Such a magical &amp; cute movie. Fab performances by @AnushkaSharma @diljitdosanjh #SurajSharma @MehreneKaur #Phillauri @Phillaur… RT @nikz25: @AnushkaSharma And she s back wid another great outing..a very sweet, innocent, and light hearted movie #Phillauri..(1) USA &amp; Canada! Book your tickets for #Phillauri now! It’s a special film: \nUSA👉https://t.co/5sC1uNBUXM Canada👉https://t.co/31WcHkPdZj https://t.co/nxony16BIy ❤😘🙏🏼thank you guyyyssss !!! https://t.co/EAJC5C31OK RT @OfficialCSFilms: Heart warming &amp; beautiful with killer acting! #Phillauri is getting immense 💓,  https://t.co/vpJS043s6Q @anushkasharma… Thank you 🙏🏼😊 https://t.co/eSEnjcZS47 Kya hota hai jab Shashi ek fun Punjabi wedding mein pohochti hai? #Phillauri👻 https://t.co/WUScaygA9O @foxstarhindi @OfficialCSFilms Hahaha 😁Thank You so much Farhan 🙏🏼👻❤ https://t.co/JXJrfpgVuG Bada mann kiya aap sabse baat karneka aur #PhillauriDay bhi hai kal! Toh chat karte hai kal - 4pm, yahan Twitter pe 👻😊✨ https://t.co/wRAoWjJctG Love you right back 😘🙏🏼😁 https://t.co/rK1UlpZBkU RT @Tweet2Rhea: #Phillauri superb casting #castingbay @ImSurajSharma is hillarious #ManavVij is outstanding.#karuneshSharma @AnvitaDutt #An… Arey @heer1006 aapne yeh photo lagana miss kar diya!! #ShashiWasThere 👻 https://t.co/tCoMVb8M2G RT @OfficialCSFilms: Shashi is getting love from all over. Book tickets for #Phillauri - https://t.co/vpJS043s6Q @AnushkaSharma @foxstarhin… Yayy ! Thank you 🙏🏼👻💜 https://t.co/HP3NnLGpm3 RT @dan1shaslam: Movies like #Phillauri give you hope that good, unique stories can &amp; will be told. And appreciated. Proud of you, #AnshaiL… Hahah Thank You 😊🙏🏼😊 https://t.co/2WgTNf7waV Yayy Thank You 😊 😘 https://t.co/0A7BelOUNK RT @aliaa08: And as usual @diljitdosanjh totally wins you over with his simplicity and charm! The film leaves you with a beautiful thought… Thank you Changa !! 🙏🏼😁 https://t.co/cTYMzc3LL4 😘😘 Thank youuuu ❤🙏🏼😁 https://t.co/txAEgQD6Nx Thank you 😘🙏🏼😁 https://t.co/YtwS2xibQz Thank you 🙏🏼😁😁😁 https://t.co/wTszxGgSMQ Thank you Badshah!!  😁🙏🏼🙌 https://t.co/AtQB9EUXKL Here comes the bride in spirit! 👻 #Phillauri releasing tom. Book now https://t.co/5BJhCH3svI @diljitdosanjh @foxstarhindi @OfficialCSFilms https://t.co/XgtCeu6waQ Thank you 😊😊💃🏻 #Phillauri https://t.co/2901HAbaPX RT @ShashankKhaitan: #Phillauri kudos to the team for making this film and wish u guys all the best ... @AnushkaSharma #karneshsharma @foxs… Thanks so much 🙏🏻😊 #Phillauri https://t.co/SxieoXew2z Thank you 🙏🏻😊 #Phillauri https://t.co/u2zSzMIWJt RT @Saqibsaleem: Everything abt #Phillauri is beautiful ..   Very well written n executed .. every performance so spot on!! Anshai you beau… Thank you 😘😘 #Phillauri https://t.co/Zx7ahlHYUb Thank you sooo much 😘❤️ Yes we will 😊#Phillauri https://t.co/HoMJQbsKWj Catch Shashi the bride in spirit on #24March! Watch https://t.co/XS3Db63RWL @diljitdosanjh @foxstarhindi @OfficialCSFilms #PhillauriMarch24 What happened when Shashi 👻 met the bhabhijis of #BhabhijiGharParHain? Don't miss @AndTVOfficial in 1 hour! @foxstarhindi @OfficialCSFilms https://t.co/2IiBLj4ceh Watch Shashi's fun video call with #AshutoshRajurkar on https://t.co/XJp7ygzgby #WhatsUpWithShashi .@MangosteenGuy Band, baaja, baraati aur ek friendly bhoot! Kya shaadi thi!! #ShashiWasThere 👻 https://t.co/5uuijk6tFT Shashi used 3D holographic projection to speak with people! Here's the fun video https://t.co/wRR93HaATi @foxstarhindi @OfficialCSFilms Shashi leke aa rahi hai ek maazedaar aur khubsurat love story. #2DaysToPhillauri 👻 https://t.co/Jcd86UsLug @foxstarhindi @OfficialCSFilms RT @voguemagazine: Bollywood's @AnushkaSharma is a style star to watch. https://t.co/arROn465zN #3DaysToPhillauri... 24th March #Phillauri @diljitdosanjh 👻👻👻👻👻👻 https://t.co/hdtnw2N0I3 Bhoot hoon! Apni superpowers use karke Mannat mein ghus toh gayi! Pata hai wahan kya hua? #ShashiWasThere 👻 @iamsrk https://t.co/R5QQsTaMm2 Meet Shashi &amp; know her story in just 3 days! #3DaysToPhillauri @diljitdosanjh @foxstarhindi @OfficialCSFilms #PhillauriMarch24 https://t.co/C4mue7Mr8O Koi toh joke tha ! 😁.But guyyysss!!  #4DaysToPhillauri ... #PhillauriMarch24 #Phillauri @diljitdosanjh https://t.co/GSmVolapi5 Meet Kanan-the manglik groom in Chapter 3 of #Phillauri https://t.co/VjbLBMiRGH @diljitdosanjh @ImSurajSharma @foxstarhindi @OfficialCSFilms Kya Mannat ki oonchi dewaarein rok payengi Shashi ko #ShashiWasThere ??... Find out soon 😉 https://t.co/Qxznim58Nd Don't miss @diljitdosanjh &amp; my performance on Mirchi Music Awards! Tune in to @ZeeTV now! @foxstarhindi @OfficialCSFilms #Phillauri 👻 https://t.co/rDe7pWitEE Watch me, Shashi, the friendly bhoot from #Phillauri on @SonyTV's #IndianIdol in an hour at 8 PM! @foxstarhindi @OfficialCSFilms #Phillauri👻 https://t.co/wJgbs8UDVQ Bada mazaa aaya aap sab ke saath! @SaurobhM #ShashiWasThere 👻 https://t.co/u9eRJzNNNS The joy of knowing ... #5DaysToPhillauri #PhillauriMarch24 #Phillauri 👻❤👻❤👻❤👻 https://t.co/RL0HmUsTks #5DaysToPhillauri .... 24th March.....\n👻👻👻👻👻👻👻👻👻👻👻👻👻#PhillauriMarch24th #Phillauri 5 days to go!! Know the friendly bhoot Shashi's story this Friday @diljitdosanjh @foxstarhindi @OfficialCSFilms #PhillauriMarch24 https://t.co/aNtQlWhIEj Thank you for yet another wonderful interview @anuradhasays 😊. Also, kudos to your cameraman &amp; team ! https://t.co/1MKc8VFOgD @anuradhasays It was wonderful talking to you as is always 😊Also, kudos to your cameraman &amp; team for shooting this so well 😊 https://t.co/1MKc8VFOgD Thank youuuu Kapil 🙏🏼❤👻 https://t.co/FYHcJXMu2U The friendly bhoot 👻 arrives in 1 hour on #TheKapilSharmaShow! Tune in. @KapilSharmaK9 @foxstarhindi @OfficialCSFilms #Phillauri https://t.co/3KJ3aOIeFU Catch Shashi 👻on #DilHaiHindustani on @StarPlus in just 1 hour! Don't miss the fun @diljitdosanjh @foxstarhindi @OfficialCSFilms #Phillauri https://t.co/fIcB5TWDgX Kya kamaal ki party thi!! #SangeetNight mein mazaa aa gaya!! @Dinesh_Anand #ShashiWasThere 👻 https://t.co/cAA1eNIXTc Main bilkul time pe nikal gayi... Maine kuch nahi dekha! #ShashiWasNotThere https://t.co/ppYdotBY1A Kahan gaya hai vo Shashi ka naam roshan karne? Watch https://t.co/Oxmza8e22E @diljitdosanjh @foxstarhindi @OfficialCSFilms #PhillauriMarch24 Saare bade friendly the iss shaadi mein @amanjn16 – sabne mere saath selfie li. #ShashiWasThere 👻 https://t.co/e6NfFeSK3e Tumlog kamaal ki party karte ho! Photo toh banti thi! @absolute_ley #ShashiWasThere 👻 https://t.co/3DgzwbuYlR RT @7UPIndia: Catch @AnushkaSharma's 1st ever #Chatpataka rap! Wait for the end and stand a chance to win cool prizes.T&amp;Cs apply. https://t… Pehle Sher Ke Saath Fasa phir Ek Bhoot Ke Saath. Thank God main Khunkhar nahin, friendly hoon. #ShashiWasThere 👻@ImSurajSharma https://t.co/rMh7y5vxZU Shashi got impressed by #PritiKanodia's whacky message! Watch the video-call now #WhatsUpWithShashi @foxstarhindi https://t.co/9QQX4eAYAY .@ghuamlocal Main bhi toh aaplogon ke saath dulhe raja ke liye wait kar rahi thi! #ShashiWasThere 👻 https://t.co/evRnSyLOaE Watch Shashi ka pyaar, in Chapter 2 of #PhillauriKiKahani https://t.co/zOdRQmHHDR @diljitdosanjh @foxstarhindi @OfficialCSFilms #Phillauri Yeh gaana ekdum galat hai.. inka naam Katrina hai, Sheila Nahi! Main inhey achchey se jaanti hoon.. #ShashiWasThere https://t.co/3jlcxf18bY Cool ! Boom! Boom ! #Phillauri promotions on #dilhaihindustani with @karanjohar &amp; @Its_Badshah https://t.co/yvC2Gb14fw Yeh hamari matching skirt dekh rahe hain aap log? Maine hi Aamir ji ko gift ki thi! Gift se mujhe yaad aaya, Happy Birthday Aamir ji! 👻 https://t.co/qv6ugY7Mi1 Apki wedding album mein yeh photo bhi zaroor dalna – yeh wali na missing thi..@iBratati #ShashiWasThere👻 https://t.co/4Sig7ONSAk The making of #DumDumReprise is out! Watch now https://t.co/B0M4d6b1jE @diljitdosanjh @foxstarhindi @OfficialCSFilms #Phillauri Today @OfficialCSFilms comes full circle with #2yearsofNH10 &amp; its next production #Phillauri 👻 ready to release on March 24! Grateful 🙏🏻😇 Ek group photo toh banti thi! @iNikhilChadha kya kamaal ki shaadi thi!! #ShashiWasThere👻 #Phillauri https://t.co/Yr8qVH80NY Alt way 2 make 'Hit bolly songs list'-sit in a quiet room.Listen2 all d music bein played arnd ur house on Holi.Top5 will b repeated 10times #ShashiWasThere jab ispe rang daala gaya.Jaanwaron ko rang pasand nahi.Insaan sirf insaano ke saath Holi khelein pls! Happy &amp; safe Holi. 😊🙏 https://t.co/h8LnG22VcT Amazing talent and an equally befitting Grand Finale of #TheVoiceIndiaS2 May the best Voice win @AndTVOfficial #ShashiWasThere 👻 👻😀👌🏻 https://t.co/Bep4HXuZZS BishtPlease 🖐🏻I was forced to be in this photo ! You said you'll won't leave my office otherwise 😶 https://t.co/RzFgJBDoAV Love the video ! 😁 https://t.co/KVdTxKURgw Group photo mein mai na rahoon? Yeh toh namumkin hai!! @niftianshyam #ShashiWasThere 👻 https://t.co/scf383jGbH Thank you to all for so much love &amp; for voting me Best Actress for Sultan 🙏🏼❤️😘 #ZeeCineAwards2017 #Grateful https://t.co/auMNIwSLkN Shaadi Ki Mubarak baat toh maine bhi di thi apko @shrutiprabhu_ #ShashiWasThere 👻 #Phillauri https://t.co/g00YHWmBcO Watch @diljitdosanjh's 1st Sufi song now! 🎶 @foxstarhindi @OfficialCSFilms #Phillauri 👻 https://t.co/tr2cE4p1Ng Just 1 hour to go for #DumDumReprise! @diljitdosanjh's 1st Sufi song @foxstarhindi @OfficialCSFilms #Phillauri 🎼😊 https://t.co/i8Jhap5i84 #DumDumReprise 🎶 @diljitdosanjh's 1st Sufi song, will be out tom at 11 am! Don't miss it! @foxstarhindi @OfficialCSFilms #Phillauri 👻 Hum bhi kam rockstars nahin lag rahe the chasma lagake @SkanndTyagi #ShashiWasThere 👻 #Phillauri https://t.co/7Rb78tjGVs 1 day to go for #DumDumReprise, @diljitdosanjh's 1st Sufi song!🎶 Out tom! https://t.co/l6fpNCcBzE #Phillauri 👻@foxstarhindi @OfficialCSFilms #Phillauri 👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻#Phillauri *24th March* se! @diljitdosanjh @OfficialCSFilms @foxstarhindi You did well 👻😁#ShashiWasThere https://t.co/p8okrI63qu Hahahah 👏🏼 https://t.co/5b61jqmyK3 👻 https://t.co/IsKgsFaujK .@diljitdosanjh is here with his first Sufi song, #DumDumReprise! 🎶❤Coming soon! https://t.co/C22XZmnCoG #Phillauri 👻 Tumlog ne kya kya gossip kiya mujhe sab pata hai! 😀@Shraddhsachan #ShashiWasThere 👻 https://t.co/6wnTpoKhoP .@KapilSharmaK9 ji se milke bhoot achha laga.Dekhiye yahan #ShashiWasThere #Phillauri @foxstarhindi @OfficialCSFilms https://t.co/JW4JXAyHaj Aap mujhe dekh nahin paaye. @ranirulesjapan #TeamBride mein main bhi toh thi! #ShashiWasThere 👻 https://t.co/wfBKq7al5t #WomensDay https://t.co/fp87Jp1uD9 Shashi se suniye #PhillauriKiKahani - Yeh hai pehla chapter 👻 https://t.co/82ydBt4Cag @diljitdosanjh @foxstarhindi @OfficialCSFilms Guys watch the hilarious trailer of @EkThapaTiger new show ! She killin it as always ... good luck to you Bisht!! ❤️https://t.co/kOGNrw7okW Ab aap jaan gaye ki Veeru Jai ke upar kyon baitha tha. Because #ShashiWasThere 👻 https://t.co/f2RWCKXiGH Kitne acche lag rahein hain hum sab 😁@rajpjhaveri #ShashiWasThere 👻 https://t.co/rnVFCOQed7 Here's the making of the party song loved by everyone, #NaughtyBillo! @diljitdosanjh @foxstarhindi @OfficialCSFilms https://t.co/69Y9y4teE8 Sangeet mein ek sath selfie lene ka mazaa hi alag hai @Mythri89. Shashi had fun because #ShashiWasThere 👻 https://t.co/84FvuGTs4u Love you my bolly brother !! Guys the man behind #NaughtyBillo ... super talented &amp; awesome choreographer ❤️😘 https://t.co/HQzOxWkHVv It was a beautiful evening .. thank you and more power to you ladies 🙏🏼❤️ https://t.co/kB8LzHBWVo Thank you ma'am !! It was such a beautiful evening . More power to you all 🙏🏼❤️ https://t.co/jl1rFLBFiu Pls add for daily dose of nonsense https://t.co/jQoNP4UPeE Thank you @AzmiShabana @ManishMalhotra @iamsrk #NamrataGoyal 4 this beautiful evening&amp;doing d noble work U do!! #MijwanSummer2017 🙏🏼💜 https://t.co/snJYq1VvAb Gazab ka selfie lete ho @StuffdYetStarvd lekin apke paas Bhootiya lens nahin tha. Yeh dekho pic aise aaya tha.. #ShashiWasThere 👻 https://t.co/BKpZVirFdL RT @diljitdosanjh: #Phillauri ਿਫ਼ਲੌਰ Ka Salana Junction Youtube par dekha ke Nahi...😈 Arey Baba Share bhi Karna Thaa 🤓😘 https://t.co/bps1vm… 😂Shashi was so happy that india ko doogna lagaan nahin dena pada ! #ShashiWasThere https://t.co/7mOtBHVJM2 Hahahah Shashi loved it ! Thanks for taking her out &amp; being helpful 💜 https://t.co/YnwQIpERwZ 🙏🏼thank you changa 😘 https://t.co/S1WyarrOGp 🙏🏼😘thank you champ ! https://t.co/bgFHWHiZww Just 30 mins left to go LIVE on #RisingStar &amp; perform #NaughtyBillo 1st time on TV💃🏻@ColorsTV @diljitdosanjh @foxstarhindi @OfficialCSFilms Watch us perform to #NaughtyBillo for the first time on TV, LIVE on #RisingStar💃🏻 @ColorsTV @diljitdosanjh @foxstarhindi @OfficialCSFilms Nahin nahin Karanji.Hit toh aap sab ki mehnat se bani.Main toh bas aap sab ko dekhne aayi thi.waise aap bhi bohat acche lag rahe the us din👌 https://t.co/Y5v1p3zZdN Koi mujhe bataye yeh teeno mujh pe ungli kyun utha rahein the? #ShashiWasThere https://t.co/kYvpsn0uiQ #Funkjabi ... 👟... 💃🏼.... #NaughtyBillo #Phillauri The #Funkjabi song is here! Pull out your 👟 &amp; 💃🏻 to #NaughtyBillo https://t.co/GXK3RHZ7Sb @diljitdosanjh @foxstarhindi @OfficialCSFilms Rapped for the first time 🎤#NaughtyBillo sirf ek ghante mein - let's party! @diljitdosanjh @foxstarhindi @OfficialCSFilms @TSeries https://t.co/NgECA7BIow .@NavtaV apke doston ne char chaand laga diya shaadi pe! Uninvited thi lekin, par maine bhi bohot enjoy kiya! #ShashiWasThere https://t.co/NGMjvE3p25 Watch @diljitdosanjh &amp; me live on Facebook today at 5.30pm. See You 😍 #NaughtyBillo @foxstarhindi @OfficialCSFilms https://t.co/guxbLGYGNP RT @OfficialCSFilms: .@AnushkaSharma  turns rapper with @diljitdosanjh for upcoming song, #NaughtyBillo! Stay tuned for more... \n@foxstarhi… Party begins tom! Going live with @diljitdosanjh on Facebook at 5:30pm. #NaughtyBillo @foxstarhindi @OfficialCSFilms https://t.co/OBVmvoaiRy Inko jhanda lagane mein madad maine hi ki thi. Muje oxygen mask,spacesuit ki zarurat nahi padti na so I was more comfortable😎#ShashiWasThere https://t.co/ekYMztdIjV Tum logon ke latke-jhatke kamaal ke the @m_azad – tum hume dekh nahin paye but maine bhi khub enjoy kiya! #ShashiWasThere👻 https://t.co/9iemozrNEn Have a surprise for you in #NaughtyBillo - the party track of 2017 Out tom https://t.co/8OWxVQRoTM @diljitdosanjh With happiness 😇🙏🏼❤️ https://t.co/vYN5w3ktyK RT @ndtv: Watch what @AnushkaSharma has to say about the #Oscars goof-up. She should know - Shashi was there\n\nRead more here: https://t.co/… Happy to be walking the ramp for #Mijwan - Summer 17 by @ManishMalhotra showcasing chikankari by #Mijwan women on 5th March. RT @ieEntertainment: .@AnushkaSharma was at #oscars2017. See her pic at Academy Awards\nhttps://t.co/o6km7H7WVv https://t.co/sHNiS1DfgN Yeh log mujhe sun nahin paye, main toh kab se Hindi mein keh rahi thi ki naam galat likha hai #ShashiWasThere 👻 https://t.co/KwZ3PffHtN Yaar sahi toh lag rahe the @AbhishekKapur10 nazar na laage apko ;) 👻 #ShashiWasThere https://t.co/UELZlwMOTe The making of the love ballad of the season #Sahiba, is here! Watch: https://t.co/USTvpBWhUl @diljitdosanjh @OfficialCSFilms @foxstarhindi Who is the next lucky person? Send Shashi👻 your whacky messages &amp; she could video-call you #WhatsUpWithShashi @OfficialCSFilms @foxstarhindi https://t.co/O0aBpfeFJS 👏🏼😄 https://t.co/eHDezbIyBB Hahahah 👏🏼 https://t.co/MIFPz4y1ao RT @jasleenroyal: What. A. Fun. Team. to have worked with &amp; look forward to working again🔜 #Phillauri #WhatsUp @saurabh0903 @MikaSingh @Off… 😘🙏🏼❤️thank you my lovely https://t.co/sJS5NC9nAf RT @EntrepreneurIND: The Wait is finally over! Entrepeneur's March edition on #Shepreneurs is out on stands. Subscribe Now https://t.co/A2Q… RT @sheikh_arbaz: #Shashi having a board meeting with other spirits. @AnushkaSharma https://t.co/nEwpiwVDYh Had a fun chat with @diljitdosanjh before next radio interview ! He is really funny !! #ShashiWasThere https://t.co/BGgXvQEdcy Hahahahaha https://t.co/h1EbsH9fi3 Thanks to @RedFMIndia for making me meet Hussain who baked this cake that I am cutting alongside @diljitdosanjh #ShashiWasThere 👻 https://t.co/mbNAsan9Y1 So, there I am with @diljitdosanjh promoting #Phillauri on @RadioMirchi . #ShashiWasThere 👻 https://t.co/692vKvbgU6 #ShashiWasThere 👻👻👻👻👻👻 Kala Chasma Jachda Ae, Jachda Ae Gore Mukhde Te #sangeet mein main bhi thi with the #swaggermoms @dbchirag #ShashiWasThere https://t.co/i2Fi4fF9pK Kuch toh hone wala hai... Starting today! #ShashiWasThere 👻 @foxstarhindi @OfficialCSFilms https://t.co/5vp8F3Efek #IshaanSharma ne jeet liya hai Shashi ka dil! Watch it here: https://t.co/AFlNxWXvx6 #WhatsUpWithShashi @foxstarhindi @OfficialCSFilms RT @rockybaggs: @foxstarhindi @AnushkaSharma @diljitdosanjh .. when you don't know any instruments but gotta impress her .. #sahiba #philla… Somebody should be studying today 😋 https://t.co/rZeDwl6oCh Hahahah pls study https://t.co/664kLSIXjC I'm happy Sahiba loves #Sahiba😊😘 https://t.co/e58Y079EAO RT @Minkar33: @AnushkaSharma woke up to a cold frosty beautiful day in London and heard this. Just perfect! Beautiful, soulful sound and be… Hahahah well done !! 😘 https://t.co/ekUZjpZ4GH Arre waah!! Kya baat hai 👏🏼🙏🏼 https://t.co/0DDUA9Fqo9 How beautiful ! 😘lovely !! https://t.co/pPx03jlveD How beautiful !! Thank you &amp; love you too 😘 https://t.co/ik73G9oehn Hahah 😄 https://t.co/b2xqAvwZry RT @theonlylikenpss: Sahiba is so beautiful song and I can't stop playing it again and again. Full of emotions &amp; depth. @AnushkaSharma Aap ki awaaz ka hi kamaal hai Romyji 👏🏼👏🏼👏🏼#Sahiba 👻 https://t.co/YZkXcb2W5J RT @Rajkhatri_: I Hv Vry bad cold tht I Cn't speak properly bt Dis Song #sahiba makes somehow make me sing this buatiful song 😘@AnushkaShar… RT @1a548071d328497: @AnushkaSharma thank u for giving such beautiful song Sahiba.I m not fall in love yet,but this song takes me to a very… Wow beautiful ... Feel blessed 🙏🏼 kudos to you little genius 😇 @shashwatology https://t.co/6ripRA3kW2 Participate in the #Sahiba Dubsmash contest &amp; win big! Follow @foxstarhindi to know more @diljitdosanjh @OfficialCSFilms https://t.co/0eXDUMRiP8 RT @Namitishere: Have been humming this tune ever since i saw the theatrical. Haunting melody #sahiba #Phillauri @AnushkaSharma @TSeries ht… RT @ambrose7581: @AnushkaSharma my wife is indonesian cnt undtnd hindi bt music of #shahiba has touch her soul now v r waiting #Phillauri RT @proud_viratian: #Sahiba is such a beautiful song that Im not even in a relationship but it's still making me feel romanticly sad 😂💕\n\nTh… RT @jagruti989: I've never heard anything like this before.It's just raw emotions melting me away into another world😍 #sahiba @AnushkaSharm… RT @Tasnim_triana: @AnushkaSharma @diljitdosanjh  thanks for such soulful song like #sahiba .....I'm getting goosebumps while listening it… RT @iCriticRoshan: @AnushkaSharma @EkThapaTiger  Was waiting for Sahiba after the trailer. Just heard it. New ultimate favourite. Kaafi fee… RT @Aida_Twinkle: @AnushkaSharma Loving #Phillauri song promos &amp; OMG #Sahiba is my favorite! It's melodious, soulful. Thank you so much for… RT @iamandeepchawla: Just listened to #Sahiba! Wah💕Dil Dhaaga Dhaaga kichaa. Awesome (lyrics &amp; composition) very well presented by @diljitd… RT @adarshtiwari2: Just listen #sahiba. Beautiful lyrics wid simplicity is d biggest highlight of d song. P.S Back 2 Old School\n@AnushkaSha… RT @mrun29: @AnushkaSharma Sahiba is so beautiful and serene that I can't stop playing it again and again. Full of emotions &amp; depth. 🙏🏼Thank You 😊 https://t.co/g3buz8ptrC The song you were all waiting for !feel the love ❤️️ #Sahiba! @TSeries @diljitdosanjh @foxstarhindi @OfficialCSFilms https://t.co/WlSwwB5RhR The wait is finally over ....Are you guys ready for ... #Sahiba !!! Sahiba… Sahiba.....\nChal wahan jahan Mirza… 💞🎶💞#Sahiba @diljitdosanjh .... https://t.co/1K9xZ92nt5 Dargah pe jaisey ho chaadron sa bichhaa\nYun hi roz yeh udhdaa bunaa! ☺️@diljitdosanjh  #Sahiba https://t.co/GuDb2mMiUr #Sahiba.. chal wahan Jahan Mirza. Coming out in one hour!! 🎶@diljitdosanjh @foxstarhindi @OfficialCSFilms @TSeries https://t.co/MWVu9hbMbP 🙏🏼thank you ! Magic of @shashwatology &amp; Romy 😊 #Sahiba #SahibaOutTomorrow 🎶 https://t.co/LnmVDWirhV The love ballad that you have been asking for #Sahiba will be out tomorrow at 11AM! 🎼❤@diljitdosanjh @foxstarhindi @OfficialCSFilms @TSeries 😘😘😘and happy birthday belated ✨✨ https://t.co/v1BTbBEl2W I'm totally loving all your crazy messages! Have u sent Shashi👻 your whacky message yet? #WhatsUpWithShashi @foxstarhindi @OfficialCSFilms https://t.co/oCQZroqsW4 Your wait for the love ballad of 2017, #Sahiba will end on Monday! 😀@diljitdosanjh @TSeries @foxstarhindi @OfficialCSFilms https://t.co/alWByoQ6h0 .@VOGUEIndia this month. \nShot by Tarun Vishwa, Styled by @Anaita_Adajania, Hair Gabriel Geougiou, Make-up Anil Chinnappa https://t.co/CfKnJOVBe1 कंकर कंकर हैं शिव शंकर। आप सबको महाशिवरात्री की अनंत बधाई। https://t.co/iD9JsH6UmX Follow these rules &amp; stand a chance to get a video-call from Shashi! Follow @foxstarhindi for details. #WhatsUpWithShashi @OfficialCSFilms https://t.co/ZFnJavTu0m #WhatsUp with this you guys !! #WhatsUp Trending #1 !! Woohoo 😘😘😘bhoot bhoot dhanyewad🙏🏼 https://t.co/Xwscj7pMWU Trend alert!! This is awesome guys. #WhatsUp is trending and I love you all for the response 😘👻🙏🏼 https://t.co/pCXxcat3TJ Thank you so much ! And and as usual you've killed it with the song ! 🙏🏼💃🏼#WhatsUp https://t.co/Lo5mj6mpPY Hey WhatsUp? Here's the bride with the 1st wedding song this season #WhatsUp @TSeries @OfficialCSFilms @foxstarhindi https://t.co/8Wk8Lo2pM5 Bilkul ! Let's go ... Let's #WhatsUp 👻✨✨💃🏼💃🏼💃🏼 https://t.co/UE0NvG8N3m ☺️Haan ! Khapp daal ne ke liye aur raita phailane ke liye 👻✨✨👻!! #WhatsUp https://t.co/qqWUyNVgpF Yahan pe toh 'spirit' high hain 😉👻..... toh .... aap ready ho ?!!? #WhatsUp https://t.co/pKWf3GRTok Vadiya ji! Aur fer Kya Chal raha hai ? https://t.co/0HYD4BTgfg Hello ji ...  What's up !?! @MikaSingh RT @MumbaiMirror: #Bollywood | In a fresh twist to marketing, @AnushkaSharma will connect with fans through @WhatsApp for #Phillauri\nhttps:… The wedding song of the season is here with the bride... in spirit! 👻 #WhatsUp coming tomorrow at 11 AM @foxstarhindi @OfficialCSFilms https://t.co/ZqqZ8kcq9l Have you messaged Shashi 👻, your friendly spirit yet? Activity starts tomorrow! #WhatsUpWithShashi @foxstarhindi @OfficialCSFilms https://t.co/xav00kTWCz Main dikhti nahin lekin sunai zaroor deti hoon.. toh dhyaan se suniye.. 👻#WhatsUpWithShashi #Phillauri @foxstarhindi @OfficialCSFilms https://t.co/PgfHeZd3j9 More details soon!#WhatsUpWithShashi #Phillauri 👻😀 @foxstarhindi @OfficialCSFilms https://t.co/y8DDCx2LkB Started my morning by casting my https://t.co/Z817hxXwb7 is our duty towards our country &amp; its progress.Pls go out&amp;vote #VoteKarMaharashtra https://t.co/fgXGxjkEcV RT @shashwatology: #dumdum @PhillauriFilm feat in Best of the Week @AppleMusic.Thnk u God @AnushkaSharma @diljitdosanjh @OfficialCSFilms @f… Tune in to watch the full #DumDum video song exclusively on @9xmHaqSe today! @OfficialCSFilms @foxstarhindi @shashwatology #Phillauri Participate now in the #DumDum contest and win merchandise autographed by me! Follow @foxstarhindi to know more. https://t.co/xdr1VL45jQ https://t.co/V6kscovC7u RT @RajeevMasand: Inside #CleanSlateFilms with @AnushkaSharma &amp; Karnesh Sharma - Now Showing, 11.30pm tonight on @CNNnews18 https://t.co/vm… Check out the audio of the 1st Sufi love song of 2017, #DumDum, on @iTunes! https://t.co/aBHyz4l9js Download now! #Phillauri 1st Sufi love song of 2017 #DumDum is now @Saavn https://t.co/0Sll94UQEB &amp; on @gaana https://t.co/NcAqqbXSL8 #Phillauri 👻 @TSeries And here it is... 🎶 #DumDum, the first Sufi love song of 2017. #Phillauri 👻 कैसा लगा? \nhttps://t.co/xdr1VL45jQ 🎼 Dum dum udhti hai dua, Sau pankh lagaa terey naam ke 🎼 1hr to go for #DumDum #Phillauri 👻@OfficialCSFilms @foxstarhindi @TSeries https://t.co/eiSIIcwAfp Just 2 hrs to go for the first sufi love song of the year! #DumDum from #Phillauri 👻 @OfficialCSFilms @foxstarhindi @TSeries @diljitdosanjh https://t.co/svBlrsCkIg RT @OfficialCSFilms: The soulful #DumDum releasing tom has a Punjabi version too. Written by Shellee, watch out for it in the album @diljit… #DumDum from #Phillauri, 2017’s first Sufi love song will be out tom at 12 PM! @TSeries @OfficialCSFilms @foxstarhindi @diljitdosanjh The first Sufi love song of this year #DumDum from #Phillauri will be out tom. Can't wait for you to see it. @OfficialCSFilms @foxstarhindi https://t.co/8osjeKUCUw Hahahahaha now that's just 'messi'ng with a photo 😂👻 https://t.co/kaGkHtENYd For some love stories a lifetime is not enough! Just like #Phillauri 👻 #HappyValentinesDay ❤@OfficialCSFilms @foxstarhindi https://t.co/u73NESEXWW 😄🙏🏼😘❤️ https://t.co/DNNbpQXVuN Presenting the third poster of #Phillauri! Here comes the bride... in spirit 👻 See you on 24th March. @foxstarhindi @OfficialCSFilms https://t.co/28P3KedBLj Thanks beautiful 😘🙏🏼 https://t.co/gCn4B0Ksu7 Thank you 🙏🏼😊 https://t.co/IPC5ssN7jg Putting to rest some rumours that have been doing the rounds for some days now https://t.co/bqS498U1tC Bhoot Bhoot 👻 Dhanyawad 🙏🏻 @foxstarhindi @OfficialCSFilms @diljitdosanjh @ImSurajSharma @Mehreenpirzada https://t.co/EjwmrJPU2H 😊Thank You 😊 https://t.co/qFSqLfFDvc 🙏🏼thank you https://t.co/EQBn6mACZJ Aww that's so sweet ya Aditi 😘thank you 🙏🏼 https://t.co/GK0rvPE2J6 Thank you https://t.co/0erkPyv9QH 😘😘😘thank you https://t.co/MCblFwgwzo Some love stories last beyond a lifetime! Here's the 2nd poster of #Phillauri @foxstarhindi @OfficialCSFilms https://t.co/NM0KyoZORF 🙏🏼thank you 🙏🏼 https://t.co/OdrFGZk8lL Thank you PC 😘❤️🙏🏼 https://t.co/HS8F0LMV0g 🙏🏼thank you https://t.co/9yiJSSUHeb Hahah thank you Geeta ... much love to you ❤️ https://t.co/0acRf9b9AW Bhoot Bhoot THANK YOU 👻for all the love &amp; unreal response for the #PhillauriTrailer😘 @SRKnitin_rathod thank you for the art work inspiration https://t.co/ywF6NTFQXh Hahah thank you man 🙏🏼😊 https://t.co/55I5z6sJww ❤️🙏🏼thank you https://t.co/h8EDI5qx4F Aww that's so sweet ! Thank you 🙏🏼😊❤️ https://t.co/ewdyBEF4Cs Thank You 😊 https://t.co/U6M58sy5VD Hahahah 👍👏🏼 https://t.co/Uu8K2bHjMZ Thank you Madhavan 🙏🏼❤️ https://t.co/kisOhXkdsl Thank you 😘 https://t.co/XTsspX9SVm 🙏🏼 https://t.co/q8IjNU6NwG Thank you 🙏🏼❤️ https://t.co/rPkEAhu3Q4 Thank you 😊 https://t.co/TbE0xWy7NE Thank you 👻of course bulaungi 😊 https://t.co/g7KFM0b6xw 😘thank you 🙏🏼 https://t.co/nGvdcERJP3 😁not really ! Just learning along the way . Thank you 🙏🏼 https://t.co/Xgcq4bNObE Thank you ! Bisht ji great hain 🙏🏼😊 https://t.co/geOq7kyeYi Hey guys, don't forget to watch the #PhillauriTrailer &amp; the bride Shashi.. in spirit ;) across the @startvnetwork channels tonight at 7.57pm Thank you so much 🙏🏼 https://t.co/qk7YXZtTM1 Catch the super fun #PhillauriTrailer and the bride Shashi.. in spirit ;) across the @startvnetwork channels tonight at 7.57 pm! Thank you paaji 🙏🏼👻 https://t.co/29cfvQP0rS Thank you 👻😊 https://t.co/Y7YQOhP3CN Thank you 😊🙏🏼 https://t.co/WqFirnTiWj Thank you lovely 😊 😘❤️ https://t.co/luvWJO0eUx Thank You so much 😊👻 https://t.co/fTWHz2doxn ThanK you sooooo much ❤️❤️❤️ https://t.co/3Zq1bpzKe5 The #PhillauriTrailer now on @hotstartweets https://t.co/owyeJygxa8 meet the bride... in spirit @foxstarhindi @OfficialCSFilms थैंक यू वेरी मच 🙏🏼👻 https://t.co/x8VJh9HXyE थैंक यू 👻🙏🏼 https://t.co/UYshT8IjUD थैंक यू 🙏🏼 https://t.co/FievjGdlAP Thank you Farhan 🙏🏼😊😊 https://t.co/5qoxggmMaJ RT @OfficialCSFilms: Presenting the first poster of #Phillauri - releasing March 24! RT if you can't wait to watch the movie! @AnushkaSharm… Oye! 😘 https://t.co/R3qkEAzAE5 Thank you Shruti ❤️😘 https://t.co/4chTI5FUWe थैंक यू 👻👻👻 https://t.co/SLrrPtPTAN बोहात बोहात धन्यवाद आपका 👻🙏🏼😘 https://t.co/REcn2WNwKK थैंक यू 🙏🏼👻 https://t.co/rrjOTqfxOg ❤️❤️🙏🏼थैंक यू 😘 https://t.co/bgjoisgXeI Thank you lovely ❤️🙏🏼😘 https://t.co/R7eSoUbHhW Here comes the bride...in spirit! 1st poster of #Phillauri - releasing March 24! Hope you guys love it! @foxstarhindi @OfficialCSFilms https://t.co/xz6n85lsC2 👻 Thank You 😊 https://t.co/vo23OuOrTf 👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻 👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻#Phillauri #PhillauriTrailer Arre bas bhi karo! Bacche ko rulaoge kya ab ! Hahah 😂 https://t.co/Bgr56Py3x8 🙏🏼thank you https://t.co/kgw62uHw4Z RT @atulkasbekar: This looks like fun 😄👏🏽👏🏽 https://t.co/c6zUKxyNcg Hahha love that ! 🙏🏼thank you ! https://t.co/vjZjZcJRUh Thank you ❤️ https://t.co/rMHYYWBBXD RT @ieEntertainment: #Phillauri trailer: @AnushkaSharma as a 'married' ghost takes fans on time travel to her love, @diljitdosanjh\nhttps://… RT @raghuvendras: Let's fall in love with a bhoot. #PhillauriTrailer is amazing. Can't wait to watch it @AnushkaSharma @diljitdosanjh\nhttps… RT @CNNnews18: The much-awaited trailer of @AnushkaSharma's #Phillauri is finally out and it does not disappoint\nhttps://t.co/I0xTwgJcBi RT @TheQuint: Watch @AnushkaSharma spook the hell out of #SurajSharma in #Phillauri. https://t.co/11AJ9ZqfZv Thank you sir ji 😁🙏🏼❤️ https://t.co/MSUXV18G9Z Thank you Bhumi 😘❤️🙏🏼 https://t.co/AVvWqUXpgr RT @MissMalini: The trailer of @anushkasharma's #Phillauri is SO good! https://t.co/yXfabmenuv 😘😁thank you !! https://t.co/MDQtzlgNcR 😘thank you https://t.co/0m6QT6rfo2 You beauty 😘thank you ❤️🙏🏼 https://t.co/cieRUJmBKj Hahah thank you so much 😘😊🙏🏼 https://t.co/joXObVQMPu Thank you 🙏🏼😊 https://t.co/mqSPP0rNAK You are too sweet 😊😊😊thank you 🙏🏼 https://t.co/IUa4y0v50C Thank you Harneet 🙏🏼😊😘 https://t.co/j1NR0njWS8 Hahah that's a great tag line ! 😂 https://t.co/du9PLRRics RT @shominisen: This looks like fun! Looking forward to this @AnushkaSharma!\n#Phillauri trailer\nhttps://t.co/h9SuwwyD9v RT @OfficialCSFilms: Here's the love story of Shashi, the bride... in spirit! \n#PhillauriTrailer out now- https://t.co/r8eftnNy2I\n@anushkas… 😘thank you ! https://t.co/TigdkuwnTk RT @taran_adarsh: A trailer that keeps you hooked. Absolutely WONDERFUL... #Phillauri official trailer. @AnushkaSharma @diljitdosanjh https… RT @pudiharicharan: .@AnushkaSharma has a great eye for stories as a producer too. Here's the trailer of her 2nd prod #Phillauri https://t.… Thank you 🙏🏼 https://t.co/mMwfPz8tD8 RT @zmilap: Brilliant! Hilarious and emotional! Congrats Anshai! https://t.co/Y4bulzVPng 🙏🏼🙏🏼🙏🏼thank you thank you 😘😘 https://t.co/5mbbva4da3 Watch the love story of the spirit... Shashi! #PhillauriTrailer on YT https://t.co/33XOb3i73J @foxstarhindi @OfficialCSFilms Let's chat 🤗 https://t.co/uhGkjVScdi Thank you ! Really appreciate your kind words 🙏🏼😊😊 https://t.co/ka0hkerukc RT @taran_adarsh: #Phillauri trailer is tooo good. Interesting plot + talented names [Anushka Sharma, Diljit Dosanjh, Suraj Sharma]. Traile… 😁😁😁thank you sir ! And for coming even though you are injured 🙏🏼 https://t.co/n2f2F6WEfu RT @vfx_redchillies: Tks @iFaridoon 4 such lovely words 4 #RCVFX Team on the #VFX &amp; #colorbyredchillies for #PhillauriTrailer *ing @Anushka… RT @KomalNahta: Saw Phillauri trailer today. It is too cute! Directed by Anshai Lal, it stars AnushkaSharma, DiljitDosanjh, SurajSharma. @O… Hahahah 😘😘SOOON VERY SOON https://t.co/2QZ6rV8LnY 😂 love you allll 😘😘😘 https://t.co/tJJcCLrjet Wow !! Thanks 🙏🏼😊 https://t.co/VFhMag9tOs RT @ritikanagpal: Coming Soon ⏳👌🏻#PhillauriTrailer https://t.co/QZqi0JKhXe Thank you 😊🙏🏼I truly feel blessed 🙏🏼 https://t.co/sT6dLYuTfh Thank you RekhaJi 🙏🏼😊😊 https://t.co/1FyInJqgJx Dia ! Soon soon 😁😁😘😘 https://t.co/IH8Hzmom7J Don't officially sulk !! I will show you the official movie soon 😘 https://t.co/whZWdyx7Ry RT @Spotboye: Take a look at @AnushkaSharma's next starrer @PhillauriFilm!'s LOGO!😍🔥 https://t.co/WIe5XX1xIm 😁😁😁 thank you 🙏🏼😘 https://t.co/Xth2DZ5DSL Yayyy !! Thank you 😁😁🙏🏼 https://t.co/mnEt2kslYE Oooodayyy! Dying to show youuu ! Coming soon 😁 https://t.co/7O9CtM0u34 😁😁😁🙏🏼 https://t.co/5ZLOHCuudg Yayyy thank you 😁 https://t.co/ZwAOzp9yil 🙏🏼😘😘 Thanks you guys !! https://t.co/bOjLW3J5OF Thank you Alok 😁🙏🏼 https://t.co/upfnuMZ4EE Trailer coming SOON 😀!! Watch this space for more 😘#Phillauri #PhillauriTrailer #ComingSoon @OfficialCSFilms @foxstarhindi @diljitdosanjh https://t.co/mV07l55AGZ Say Hello! @HELLOmagIndia https://t.co/sjHsslVjYd Heartbreaking https://t.co/5ivzvocNzV RT @varungrover: घातक हमला हो तो भी कलाकार कला से ही जवाब देगा। लेकिन मुक़ाबला उन लोगों से है जो मासूम कला का जवाब भी हमले से देते हैं। कला… RT @MaheshNBhatt: U don’t beat an idea by beating a person.U beat an idea by beating an idea.This politics of violence is chilling free spe… RT @baradwajrangan: So we've apparently reached a situation where goons can express dissent about a film with mere guesswork about what it… RT @AzmiShabana: Film industry must stand as 1 n do whatever it takes to ensure that d reprehensible attack on SLB becomes a flashpoint for… RT @S1dharthM: Angry at seeing how a group can violently attack without fear of police,this is not the republic India we just glorified,I S… Appalled &amp; horrified by what happened on SLB set.NO amount of diff of opinion or disagreement justifies this pathetic behaviour. Shameful! Word https://t.co/AEPpQ37XUQ RT @DharmaMovies: This #Friday, watch #AeDilHaiMushkil on @AmazonVideoIN &amp; bask in the feeling of love &amp; friendship while sitting at home!… 68th yr of our constitution..a gift from the hard struggle of our past. Value it with unity for our country. Jai Hind! Happy #RepublicDay 👏🏼👏🏼👏🏼 brilliant idea ! And with you doing it personally, it will definitely reach the soldiers family . Respect 🙏🏼 https://t.co/UCcJNGx3Qh And the DR 2017 shot is here! https://t.co/sLBiI6p6hq https://t.co/vB4YFAdWhK \"You make me feel proud to be an https://t.co/EezlRylQNL make me feel that what I hve in me-my body,my face,my age ... is enough!\" 👏🏼👏🏼👏🏼 https://t.co/7nk57sSBxi This is so bang on 😂They just can't fetch !! 😍❤️🐶what did we ever do to deserve dogs ! https://t.co/ZutZ620CY7 #OmPuri's talent and versatility has brought so many characters to life. An inspiration to many actors. May his soul rest in peace. Tu na bhai , Kabhi kuch naa likh 🙏🏼 https://t.co/4DnRuEvjoR https://t.co/kwNfObNlmP RT @akshaykumar: The Bangalore incident makes me feel we r evolving backwards,from humans to animals,rather beasts coz even animals are bet… RT @boxofficeindia: @AnushkaSharma 's production house #CleanSlateFilms has joined hands with #KriarjEntertainment for their upcoming film… RT @TOIEntertain: Makers of 'Rustom' team up with @AnushkaSharma for a joint venture!\n\nhttps://t.co/i9QwdzneLg https://t.co/Vu3na4VBpu Happy 2017 you guys ! 😘. Sorry about the no sound in the last tweet 😂#HappyNewYear https://t.co/40n6rsGojM RT @imVkohli: (2/2)Since news channels cant resist selling false rumours &amp; keeping you confused, we are just ending the confusion :) RT @imVkohli: \" we aren't getting engaged &amp; if we were going to,we wouldn't hide it. Simple... (1/2) Ultimately, it's all about cherishing the simple things in life that truly bring peace 😇🙏🏼❤️ https://t.co/nQN6GODZuj Have a blessed Christmas with lots of love and laughter!! 🎄❤️️😀 https://t.co/lud8r6WD9x Coming from hero no.1 himself feels even better. Thank you :) https://t.co/1qADgzHvsR Thank you Darshan 🙏🏼😊😊 https://t.co/PvswMhwzmx WOW!!!! This looks SPECTACULAR !! Cannot wait to see this 👏🏼 https://t.co/xjaYdEsUdt Thank you so much 😊😊😊 https://t.co/nvmfzRmIkg With the directors behind Alizeh &amp; Aarfa 😘❤️🙏🏼 @karanjohar @aliabbaszafar https://t.co/9dDSIdiMhS Thank You 😊 😘 https://t.co/s4sa7ekHoP RT @theprintindia: All set for #OTC with @AnushkaSharma &amp; @ShekharGupta at the lovely ball room of our partner @TajLandsEnd https://t.co/03… RT @LuxGoldenRose: Watch out for our Cutiepie @AnushkaSharma's performance that will surely enthrall you at the #LuxGoldenRoseAwards on @Ze… New venture! OUR production house #CleanSlateFilms teams up with @AmazonVideoIN for a kickass show. @nopisingh @tulseatalent #sudipsharma 🤗😇 Thank you for all the love. Eternally grateful to you large hearted souls 🙏🏼😘❤🙏🏼 https://t.co/42NvPLsOge Thank you for the memories and being the best co star ⭐️ 🙏🏼❤️ https://t.co/Pmecon8Y7i Thank youuuu 😘😘😘 https://t.co/lio7FcsQWa For @gqindia https://t.co/cmcd61tbTt RT @devduttmyth: The world's greatest fantasy: My Truth = The Truth No one has taken Ranbir's suggestion seriously! I think he is a strong contender too for the prize. @iamsrk https://t.co/e1p0kEtZt1 Mark your calendar guys - 11th August 2017 !! What you seek .... is seeking you ❤️@iamsrk #ImtiazAli https://t.co/6kPW21VbZE Thank youuuu guys !!  @BeingSalmanKhan &amp; @aliaa08 🙏🏼❤️!! And now back to thinking about our films title @iamsrk  💭 🤔🤔🤔think think think!! I knowww!! But now that @aliaa08 has said I guess we will have to na !? What say ??? @iamsrk https://t.co/UYQDd5bMAe What's this @iamsrk ?? Our release date's decided !?! https://t.co/WWCQd8rW1a Guyssssss... Phillauri Ki release date : March 24, 2017! Likh ke Rakho abhi se... Bohot maza aney wala hai... ;) #Phillauri And here comes the next song! #Alizeh video out now ❤️ https://t.co/fx7YntEMsM 😄😄😄🙈🙈 Thank youuuu again !! 🙏🏼❤️ https://t.co/UCkoUnbMcw Thank you &amp; always a pleasure to talk to you @TeamMissMalini !! I love you all too 😘❤️ https://t.co/BuroeS8Rn7 From Rab ne to now .... Loveeee you 😘❤️ https://t.co/HARmxLOfEp 😘😘😘 https://t.co/sq3qffuCVj Thank you 🙏🏼❤️😘 https://t.co/siucHQFQOS Your love didn't make it mushkil at ALLLLL!! #ADHM crossed 100 crores! Thank you for making it a success. #infiniteloveforADHM https://t.co/QqmNqsla6y A welcome bold&amp;courageous step by PM Modiji towards nation building.Each 1of us shld cooperate in d larger interest of d nation #BlackMoney Thank you 🙏🏼😊 https://t.co/wuTTQXlJbR Hope you had an amazing day Mehreen 😘😘❤️❤️ https://t.co/YycX5IZIFL Thank you 😁🙏🏼 https://t.co/MJcBiVk7xm Thank youuuu 😊🙏🏼😊 https://t.co/Np7TvHQ0ZO Thank you 🙏🏼😁 https://t.co/prvkklgh0N This becoming the official sign of friend zoning 😋glad I could contribute 😁 https://t.co/TWHgQwEdYk Thank you for all the love! Check out the deleted song An Evening in Paris! https://t.co/JNoF6Cb2RJ #WithLoveFromADHM ❤ Thank you guys !! This was fun .Gtg now .Love you all .Thank youuuuu for all the love for #Adhm &amp; #Sultan 😘🙏🏼😊 #AskAnushka TATAAAA 👋🏼 Be good people . Spread love not hatred . And do things without agendas always #AskAnushka https://t.co/6DnoTfUZoi Pleas don't speak rubbish #AskAnushka https://t.co/DPcXTRSeJw 🙏🏼 #AskAnushka https://t.co/Cs7mzPao05 &amp; thank god for that 😉I welcome honesty &amp; genuine criticism . #AskAnushka https://t.co/b2EkTseFKW In one scene 😢#AskAnushka https://t.co/iCe8S0glBj Ok guys ! So I'll be taking last five questions to end our chat #AskAnushka Thnx 4 d question.Pleas spread dis 2all ignorant,negativity spreading specimens on twitter- I am &amp; have been vegetarian for over 2 years !! https://t.co/wAGIcwzTpL Dude 🐶 #AskAnushka https://t.co/ORhjh5Z5Nl I love YOU !! You guys cheer me up . Your love does ! I can never repay . Thank you 🙏🏼🙏🏼🙏🏼 and also DUDE 🙈#AskAnushka https://t.co/NknMxI9dsp I accept my mistakes when I'm made aware of them #AskAnushka https://t.co/SRztGqrUox Literally no clue ! Hard work for any thing is key though . #AskAnushka https://t.co/zcdx7kaFvN Egos &amp; peoples need to prove themselves right and others wrong for self validation #AskAnushka https://t.co/ePwkrvj571 Failure leads you to self introspection like nothing else can ! That's very important #AskAnushka https://t.co/WZV2bjk26T All the best ! Chill ! You'll do great ❤️#AskAnushka https://t.co/Uq4MdyoGEV Love you back 😘#AskAnushka https://t.co/U76Xf5U1Do Weird na they all start with 'A' ! #AskAnushka https://t.co/DCVfIITnZt I love you till my last breath . Thank youuuuu 🙏🏼🙏🏼🙏🏼#AskAnushka https://t.co/H4Zk1ti4jl Passionate #AskAnushka https://t.co/OeRJ8TrQC4 Allia , Kangna &amp; Deepika . They do some real credible work. I respect that . #AskAnushka https://t.co/Xq6VclV2cZ I'm a bigggg phattu! I can't break rules 🙁#AskAnushka https://t.co/6btOoaJHdz My next release will be #Phillauri in march &amp; then #TheRing later next year #AskAnushka https://t.co/IdLU9Gldoi He asks TOO MANY questions 🙄hahaha #AskAnushka https://t.co/mQKPc5lLYf Thank youuuu 😘😘😘 https://t.co/gXEg515yik Im happy to have worked with most of them . But there are still many more !!! #AskAnushka https://t.co/ndOT76EvKf It's strange but I always knew I'd be famous . It's so strange but true 🤔#AskAnushka https://t.co/lMz33ftQhW I love em all !! And thank you 😘#AskAnushka https://t.co/FVh31Z9ALU Of course ! #AskAnushka https://t.co/6Map8QyT9t Everything happens for a reason so I don't regret anything #AskAnushka https://t.co/YDdGODy8NA Thank you 😘#AskAnushka https://t.co/FrzeBweWmD 😂😂😂 thank you weirdo ! #AskAnushka https://t.co/yNJzmrZUvx Chai at home . Coffee when I'm working #AskAnushka https://t.co/UIx0JhVXoM She like me is very upfront &amp; straightforward with her dealings in all relationships #AskAnushka https://t.co/kBSiTWpbHf Being fearful is my biggest fear #AskAnushka https://t.co/xotWVJimba What is a hug smiley now 🤔🤔. How bout a kiss 😘! #AskAnushka https://t.co/IfB4aUFguN Hey ! I thought he seemed quite chilled out ! #AskAnushka https://t.co/EF7cSzXj3e LETS BEGIN !!!! #AskAnushka Joining you guys in 5 mins for a twitter chat . Keep those questions coming 😘 #AskAnushka Let's have a quick Q&amp;A at 4pm today!!! Keep your questions ready #AskAnushka 🙋🏻🙋🏻 🙏🏼🙏🏼🙏🏼 dhanyawaad ❤️ https://t.co/LaVuJeEf84 Wow that's sweet 🙈thank you 🙏🏼 https://t.co/DJeMKkLPei Thank you Nikhil 🙏🏼 https://t.co/qANsoxBHzN Thank youuuuuu 🙈❤️😘 https://t.co/ujjZLaaEx6 Thank you very very much for your kind words 🙏🏼 https://t.co/ifzkEcrLUU Wishing you and your family a very #HappyDiwali. May all your lives be filled with light &amp; happiness. Stay blessed. https://t.co/5UZsVSQuw9 First Lakshmi Pooja at our Clean Slate office today. May god bless everyone's life with light &amp; happiness #HappyDiwali 🙏🏼😇 https://t.co/JWa2mRAQGo Thank you 🙏🏼😘 https://t.co/mr60Th7Zyc 🙏🏼 https://t.co/kSjR0OBEkr ❤️❤️❤️😘😘😘Sattu https://t.co/CftqCwDd96 RT @Asli_Jacqueline: Such a beautiful film with the most beautiful people #AeDilHaiMushkil @karanjohar RT @dop007: #ADHM is gorgeous film -daring yet sensitive new age romance .Ranbir, Anushka &amp;ash r a treat to watch. @karanjohar at his best. Hahahah thank you Amul 🙏🏼😊 https://t.co/HzgaYOKzux RT @amul_mohan: #AeDilHaiMushkil has been watched and absolutely loved. @karanjohar you've simply outdone yourself with this one. 🙌🏼🙌🏼🙌🏼 Oh my !! Thank you 🙏🏼😊 https://t.co/ZjRSthuHqO Thank youuuuu 😘 https://t.co/TCrRVNhGA7 😘😘😘 https://t.co/eYcxTW8Mqo Thank you Sid 😊😊 https://t.co/JbPDseIwur Thank you Akshaye 🙈😊😊 https://t.co/xYPWtZx0Sa ❤️❤️❤️ https://t.co/7in5vpfrqs Thank you Rahul 🙏🏼❤️🙈 https://t.co/u3WNcA31Ms Hahahahahahha thank you sne! ❤️ https://t.co/kiB7qebVJO Thank you 😊😊😊 https://t.co/RXr71FjDHj Thank you 🙏🏼 https://t.co/AXQ7kFg8Au Thank you 🙈🙏🏼 https://t.co/hdA1gMYLKt Ranbir, a new pet lover has a special #Pawsitive diwali msg for U all . Sharing screen space with him are his adorable babies 🐶🐶 https://t.co/uU0ssY6vp2 Ayana &amp; Amaira care about protecting Dude from all the noise by closing his ears. Instead, let's go noise-free for a #PAWsitive Diwali! https://t.co/8J1LFDRbOL We can't wait to see you at the theatres this Diwali!!! 😀 Book your tickets now on https://t.co/VrIT9YaiUw #ADHMOutTomorrow https://t.co/b0RKyKRcsa My nieces have Dude's ears closed to make sure he has a Happy Diwali.Be #PAWsitive &amp; share pics with your pet to get featured on my FB page! https://t.co/tRjwZxy8eP With his last video being loved so much , dude has decided to send y'all another msg 😎🐶🎤#AeDilHaiMushkil #AeDilKiDiwali https://t.co/H2nAXpf2Gt It’s time your furry friends stopped hiding in some corner and joined you in your #Diwali celebrations. Have a #PAWsitive Diwali https://t.co/oBkPsVVBAF Newest fan member of #ADHM music 🐶❤️😜 https://t.co/J5pYdRQ2XP As always, had a great time on the show 😀 Thank you so much for all the love ❤️🙏🏻 Guys, catch us tonight at 9PM on #TheKapilSharmaShow https://t.co/7C3hXONAke Are you ready for the filmy song of the year??? #Cutiepie out tomorrow.. Stay Tuned 😉 #AeDilKiDiwali https://t.co/JdzWn2g0ps #Cutiepie #AeDilHaiMushkil https://t.co/cXWefVZXFl Me - Pout game serious . Ranbir - just serious 😎 #AeDilHaiMushkil #AeDilKiDiwali https://t.co/pu8H7e2emA Here's the new dialogue promo. @karanjohar #RanbirKapoor #AishwaryaRaiBachchan #AeDilHaiMushkil https://t.co/WQdnkMTuUd Gonna miss the team &amp; non stop laughter &amp; life lessons courtesy - @iamsrk !! What a great shoot it's been ! See you sooooon 😊 https://t.co/hLHwi8SRj1 Thank you IIT Delhi for so much love.❤️🤗 Friday, the 28th come soon!!! #AeDilKiDiwali https://t.co/zo0PB4oQZj First dialogue promo. #ADHMThisDiwali https://t.co/PMC1peeBmq Sultan &amp; Aarfa are coming to your television screens with the World TV Premiere of #SultanOnMAX tonight at 8PM. Stay tuned. @SonyMAX Alizeh: a person who'll laugh loud in a foreign language class coz a word sounded like a Hindi cuss word, oblivious to others😜#AeDilKiDiwali https://t.co/badhQkbbGN This is so awesome !! 💃🏼💃🏼💃🏼yayyyy . Thank you everyone 😘😘😘 https://t.co/CNKXSJeIv3 Thank youuuu hottie !! 😘😘😘❤️❤️❤️ https://t.co/dpKrt4LuCk Come dance your heart out with Ayan &amp; Alizeh!!! Celebrate #TheBreakupSong #ADHM 💃🎉 @karanjohar #RanbirKapoor https://t.co/tV9AxwtIQm RT @karanjohar: #TheBreakupSong out on UC Browser tomorrow and on YT day after! Celebrate breakups with Ayan(Ranbir) &amp; Alizeh(Anushka)! htt… Here's to celebrating love, friendship &amp; breakups!! The #breakupsong will be out this Thursday!!! @karanjohar #RanbirKapoor #AeDilKiDiwali https://t.co/SNuSx3XEiX Peace, prosperity and love to all of you this Dussehra! Stay blessed.😇🙏 https://t.co/JoPClzziHd #Ayan &amp; #Alizeh's jugalbandi was mushkil to avoid...😎😜 #RanbirKapoor @KaranJohar #ADHM #AeDilKiDiwali https://t.co/utCSP29jyi Romancing Kjo while Ranbir watches 😋 #AeDilKiDiwali https://t.co/o6xUToks0N Yayy!!! A 100 million views on the #ADHM Trailer and songs.. So grateful. Thank you all. 🙏🙆🏻💃🏻 #AeDilKiDiwali https://t.co/FI7N2agLQA RT @DharmaMovies: She looked like a beautiful bride but @AnushkaSharma says she didn’t feel like one! #ThrowbackThursday #AeDilKiDiwali #AD… Elle this month. ❤ \nStyled by @sabya_mukherjee @ELLEINDIA https://t.co/1avPVZgq5D This is my absolute favourite song from the album!!! #ChannaMereya #AeDilHaiMushkil ❤️❤️ https://t.co/0KAmaH9yZ4 RT @karanjohar: Can't wait for you to experience this journey with us. One month to go... #AeDilKiDiwali https://t.co/K5KzgSuHFl Ok guys! So Caption this! - What could the b'day boy be telling me? #AeDilHaiMushkil #AeDilKiDiwali #HappyBirthdayRanbirKapoor https://t.co/JGNCfuBCzp Forever grateful for having worked with Yash ji in such a short span of my career &amp; to have known a great filmmaker &amp; an even greater person https://t.co/D0lRncAotc RT @karanjohar: Thank you for the continued LOVE!! The team and I are overwhelmed!!!! @AnushkaSharma #ranbir #aishwarya #AeDilKiDiwali http… And....the #ADHMTrailer is here!!! ❤❤❤ https://t.co/9qVwclLBnk Are you guys ready for the #ADHMTrailer????? Out tomorrow!!!💃❤ https://t.co/AgGiE6vt8e RT @DharmaMovies: The wait is very mushkil but here is @AnushkaSharma with a little message for all of you! #ADHMTrailer #AeDilKiDiwali @ka… The soldier above all others prays for peace,for its him who must suffer &amp; bear deepest wounds &amp; scars of war-Douglas MacArthur #UriAttacks I'm a soldiers daughter,I've seen closely tht army lives knowing death.My heart breaks for those who hd 2 face it &amp; their bereaved families RT @karanjohar: Some throwbacks are #mondaymotivation #AeDilHaiMushkil...#thisdiwali @AnushkaSharma #RanbirKapoor https://t.co/mmDZ8rATZL With the new, best-ever @Pantene_India you can enjoy a life with reduced hair fall. #14DayChallenge #PanteneHair https://t.co/08IVVjYZmq Discussion with Imtiaz on set before a scene. Couldn't have imagined a more beautiful backdrop #Rembrandt #Amsterdam https://t.co/lLYkVKHyCX Bulleya ❤️❤️❤️ \nhttps://t.co/dcgSgxnNvw And the full audio track of #Bulleya is here!!! 😇🙆🏻 Video out tomorrow!!! https://t.co/ThqRrJiLaf The melody of #Bulleya will touch your soul!! Stay tuned for the song tomorrow. Audio out tonight!!! ❤ https://t.co/7hyzCCx2jU What an inspiring story @DevJhajharia! 2 golds at #Paralympics, 12 years apart! You've made whole of India proud! 🙏 Take the new, best-ever Pantene's #14DayChallenge with me to win your hair fall battles #PanteneHair @Pantene_India https://t.co/odOQ9OjpdW Congratulations #MariyappanThangavelu and #VarunSinghBhati on the absolutely stellar performance and on creating history..👏 #Paralympics Win your hairfall battle with the new, best-ever @Pantene_India. Take the #14DayChallenge now. #PanteneHair https://t.co/Ugf5l6oSS3 The full music video for the #AeDilHaiMushkil title track is here !!!! ❤😍 https://t.co/WyByDMNAYT RT @karanjohar: The power of love...even if you lose...you win! #ADHMMusicVideo in less than an hour.... https://t.co/jyttX4dhyE RT @karanjohar: Today the song video breaks...and thank you again for all the love....#ADHMmusicvideo #AeDilHaiMushkil....4.30pm! https://t… Wishing everyone a very Happy #GaneshChaturthi 🙏😇 https://t.co/VOWkktdoa5 Sultan is now out on digital!!👊 Get it here @iTunes - https://t.co/Ng7dV2g5g9| Google Play - https://t.co/VUzzag7o7u https://t.co/0zb7n59DTe RT @DharmaMovies: The #ADHMTeaser is giving everyone so many feels, which one of these is yours... RT @DharmaMovies: Thank you for letting us into your dil! #8millionADHM @karanjohar @foxstarhindi #ADHMTeaser https://t.co/K3JagcRNoY https… RT @karanjohar: Catch the #ADHMTeaser across Star Network of channels at 8.58 pm and on Star Sports at 10.30 pm @foxstarhindi @DharmaMovies The wait is over. Presenting the #ADHMTeaser. 💃🏻😍 #Alizeh @karanjohar @dharmamovies @foxstarhindi https://t.co/FqPdckOv1J #AeDilHaiMushkilTeaser out in less than 2 hrs guys!Full Happy nervousness happening.Ab ,Ae wait hai mushkil 🙇🏻..😻 @karanjohar @foxstarhindi RT @karanjohar: 2 hours to go....for the teaser of #AeDilHaiMushkil @DharmaMovies @foxstarhindi https://t.co/7PKUks3b2M Are you guys excited for the #ADHMTeaser tomorrow? Presenting the 3rd poster😍@karanjohar @DharmaMovies @foxstarhindi https://t.co/uzFRvOjmM9 Here's presenting #Alizeh &amp; #Ayan 👫#AeDilHaiMushkil. @karanjohar @DharmaMovies @foxstarhindi #AishwaryaRaiBachchan https://t.co/Nl0feMBfKG And here it is, the first poster of #AeDilHaiMushkil. Teaser out tomorrow!!! @karanjohar @DharmaMovies @foxstarhindi https://t.co/lZRYldEQLh 😊 thank you @amul_mohan  https://t.co/Q6tOGLMsHI ADHM campaign gonna break soon The excitement got me going like..#ADHMTeaser @karanjohar @DharmaMovies @foxstarhindi https://t.co/oVouFGykUO RT @karanjohar: Ours was a team of love...making a story about love....we reveal our first phase tomorrow...#AeDilHaiMushkil https://t.co/3… RT @DipaKarmakar: Best birthday gift i could have wanted, from my father! #OlympicRings https://t.co/RNMBjj6mBP Congratulations to both of you &amp; lots of love &amp; good health for the baby girl !!! @shahidkapoor 👨‍👩‍👧❤️ Will always b grateful 4 Ur contribution in my lyf.2 my superwoman,my manager,my damager😉 @ritikanagpal HAPPY B'day https://t.co/qVrxYH8RXn #TheyFoughtLikeGirls 💃🏼kicking misogyny in its gut. https://t.co/6e3VIWJbV6 A highlight of d game was d incredible sports camaraderie shown by d 2 girls in d end.Tat shows strong character &amp; is something to look up 2 RT @stunner_karthik: Thank you #Sindhu you might have atleast impressed or convinced some 1000's of parents who believe education alone tri… What a game 🙀 !Congratulations @Pvsindhu1 on d Silver.Much much respect 4 ur spirited performance &amp; sportswomanship 👏🏼#PVSindhu YES YES YES !!!!!!! #SindhuForGold What a day it's been!First #SakshiMalik &amp; now #PVSindhu in finals👏🏼Here comes another medal.Silver haath mein Gold nazar mein.All d best👊🏼🇮🇳 RT @virendersehwag: #SakshiMalik is a reminder of what cn happn if u don't kill a girl child.When d going gets tough,its our girls who get… Yo se Haryana ki sherni aur India ki jaan @SakshiMalik.U've stamped it-'ladkiyan ladkon se kam nahin', inspiration4 billions #SakshiMalik 👊🏼 Happy Independence Day to you all 🇮🇳 Leaving you with these words of great wisdom &amp; courage . #HappyIndependenceDay https://t.co/53TBFY5oEJ Script &amp; ☕️-Best companions for prepping a new film. Wonderful feeling. Few days before we roll @iamsrk #ImtiazAli 🎬 https://t.co/BEow7xOiJE 🙏🏼😊 https://t.co/lj5J7z7Q7z 😘😘🙏🏼🙏🏼 https://t.co/F0b9PNHL7n Thank you for the memories team #AeDilHaiMushkil ! Such funnn it's been.Will miss you'll 😘😘😘❤️❤️ https://t.co/0qxrsSWu0d Trying to make a strong point to convince @aliabbaszafar that ice cream cones are better than cups 🍦😋 #Throwback https://t.co/e46nmn5EP1 I don't normally do this, But this to me is the most touching feed back on my performance in #Sultan .🙏🏼Thank you 🙏🏼 https://t.co/EY3YkpFITf Guys, check out this cool new #BollywoodKaApp #Flickbay Download here: https://t.co/oCjUlpxRao And the last song #TukTuk from @SultanTheMovie is here!! https://t.co/2lpQImAOW9 Here it is! the soulful song #Bulleya from @SultanTheMovie https://t.co/ocDgSywFAE #SultanFamilyWeekend get 2+2 on SULTAN movie tickets. Book your tickets here - https://t.co/ij9cuGalpZ RT @ritikanagpal: 13th March 2015 -NH10 \n2 years later you will witness another interesting film #Phillauri \nSave the Date ✍🏻 https://t.co/… I've got some news for you! #Phillauri will be out on 31st March'17. This one is going to be a crazy colourful ride, I promise😊@foxstarhindi With literally my 'back' on set 💁🏼 #AeDilHaiMushkil  https://t.co/pdcVOe3FzV Yayyy awesome 😀🙏🏼💜 https://t.co/CnqkDAVKTL Congratulations @vika7 !! And all the best with your life &amp; career ahead . Choosing motherhood over career is empowering. Choosing your career over motherhood is empowering. The Freedom to CHOOSE is empowering. Wntd 2 share dis.4 those who couldn't understand #Aarfa decision in #Sultan-mayb this will put thngs in perspective  https://t.co/PlUAZpdlCD Sir kind words toh theek hai , aap se toh words hi nahin Sunai dete 😉 @diljitdosanjh  https://t.co/Bvu2GfWSee So you coming to my #Filmfare photoshoot tomorrow then J ? 😉 https://t.co/y3OnZr2Bch Heartbreaking!! How many more times will we witness horrific attacks against humanity?cannot express the anger #NiceAttack . Keep your questions ready 😊👊🏼 https://t.co/LDkxcsTyfY Tu jaan hai #SachiMuchi @SultanTheMovie \nhttps://t.co/JVcdw3J7xO Lot of ppl think human lives r more important.its SAD.being humane is using ur intellect tht gods gifted us 2make this world a better place You can harm a voiceless puppy,pay a 50rs fine &amp; be FREE of your crime!?Is this the world you want children to witness &amp; grow up in? This heinous act is a mirror shown to the society we('educated') people live in.punihsment for this shld b SERIOUS https://t.co/gtsl5BMq3E What a way to celebrate Eid! Can't be better. Thank you for all the love for #Aarfa 🙏🏻 #EidMubarak #Sultan https://t.co/anqaLqs7A2 1 Day to go. @SultanTheMovie https://t.co/7j3wmbiks5 2 Days to go. @SultanTheMovie https://t.co/UH4lGxMaq7 Thank you thank you 😘🙏🏼❤️ https://t.co/Uzc5bx6w77 3 Days to go. @SultanTheMovie https://t.co/Yhv6d2OqUx Here it is! #JagGhoomeya female version from @SultanTheMovie https://t.co/1tGswPiOZB A surprise coming up for you guys in a few minutes. @SultanTheMovie https://t.co/l9XN4U8lyr 4 Days to go. @SultanTheMovie https://t.co/3NcWkKdvSS RT @aliabbaszafar: Aarfa. Eid se phele wala chaad. https://t.co/0fxJMHcqfY The harder the struggle, the more glorious the triumph #SultanOnJuly6 https://t.co/jbvK3r24dH Yes !! Thank you guys @foxstarhindi And here's to many more !! #Phillauri  https://t.co/5otaQgf0Km Film wrap for #Phillauri! Thank U every1 who worked on our 2nd production with so much love. its a happy-sad feeling https://t.co/kYfPKbIsAp Sultan \"Title Track\" https://t.co/Xsws8My4Js @DarshanKumaar congratulations Satbir !! Well deserved ! You're an extremely committed actor . Keep going ! A girl has no name. Just fierce sword fighting talent. #GameOfThrones moment on #Sultan sets at Budapest ⚔ https://t.co/tIeUES3FDQ Shot something really cool! Coming soooonnnn 😉 #StayTuned @SultanTheMovie https://t.co/BMB1VwBWiN Here's to all those families on Fathers Day 🙏🏼❤️ https://t.co/RrS1cUIUJD My biggest hero, inspiration &amp; the one responsible for making me the person I am today ❤#HappyFathersDay to all dads https://t.co/KLLEjUemeR frm being an assistant director in badmaash company 2 directing Sultan,we've come a long way🙌🏼  high-five directorji https://t.co/Iwqaw0uMmf Another proud moment for #India ! First three women fighter pilots! Congratulation Girls #TopGuns\n#IndianAirForce 👏 Thank you sir 🙏🏼 it's always wonderful to be interviewed by you .  https://t.co/5gLFKsWq44 Wow @karanjohar ! Beautifully put . Ignorance is bliss but being aware and unaffected is brave . High five you 🙌 😘 https://t.co/ffmezoGnhW RT @sachin_rt: 'Wrestling sirf ladkon ka game nahi hai, Ladkiyon mein bhi bahut zyada power hai' #VineshPhogat #AgainstAllOdds\nhttps://t.co… Kaun jaane kaisa tera mera hai connection @SultanTheMovie #440Volt https://t.co/295Ixh1Qfx Hatred is the single most deadliest epidemic to destroy the world . Live and let 'live' 💔#OrlandoNightclubShooting Congratulations @NSaina on your second Australian Open victory ! Keep smashing it !! More power to you 🙌 RT @aliabbaszafar: Maddest song from @SultanTheMovie out in 3 days... Eid is coming closer.. https://t.co/P4PMeIo4Uw Jaisi tu hai waisi rehna. #JagGhoomeya thaare jaisa na koi... @SultanTheMovie https://t.co/12E5VefEbH Window seat view like this 😍 #Budapest #ShootLife #onthego https://t.co/9yj4JUNq3P Finishing touches!! Last day shoot for @SultanTheMovie #Budapest https://t.co/MTbOaU5eCE RIP Muhammad Ali https://t.co/aBYAzdeBNL Touchdown in Budapest . Home for next few days shooting song for #Sultan !! 😎 https://t.co/artR7DnEhg Sultan Ki 'Baby' ko Kya pasand hai? https://t.co/Oqgwc9fdRO RT @SultanTheMovie: Get ready to put on your dancing shoes! #BabyKoBassPasandHai COMING TOMORROW! https://t.co/felj44gV8K RT @aliabbaszafar: Aarfa @AnushkaSharma simply beautiful @SultanTheMovie https://t.co/WnYpVEhiUb Grateful for the response to the trailer @SultanTheMovie. Back to Patiala for #Phillauri. Work mode always on 💪😊 https://t.co/BvRfLg3t72 The 'King' of pouters &amp; love stories. Happy Birthday @karanjohar 😎 https://t.co/4jDb2AJvPX Thoda Sa Dhobi-Pachad, Thoda Sa Pyaar \nhttps://t.co/Egz0OSPODC Happiness 🙏🏼😀👏🏼🐶 https://t.co/OIpHzvUuwf You make me so happy Ma. I love that you make efforts to stay fit and eat healthy.As I  grow I… https://t.co/TbTNyusxEJ Cannot stress enough: self entertainment is key to happiness 😜 partners in crime @ritikanagpal… https://t.co/k9LFiG2yN7 Self entertainment is key to happiness 🙃🙃🙃🙃🙃🙃😝😝😝😝 https://t.co/lIuFs3mGSm Thank you 🙏🏼😊 https://t.co/XJiMESn8gl Thank you 😊 https://t.co/oOUXEBTii2 Thank you 😊 https://t.co/XN2TtGvpX0 Thank you 😊😘 https://t.co/wFR9b52DQA ANDDD SPECIAL thanks to all my fan clubs for ur lovely wishes,videos, cards &amp; for your continuous support!! You guys are rockstars 😘,  ❤️U Thank you manish!! 😘❤️ https://t.co/kymUfgmgWC Thank you 😊🙏🏼 see you on set ! https://t.co/IYqzm64lbj Thank you 😘😊 https://t.co/iAHSJ29r1w Thank you 😊 https://t.co/oyhcw3C1WC Thanks a lot Sonali 😊 https://t.co/wB19VyYDNt Thank you 😘🙏🏼 https://t.co/aHarY1q6rn Thank you thank you 😘 https://t.co/m0e8TMth1H Thank you so much 😊 https://t.co/EaeqXXZV4N Thank you  sweetie!! And you are an inspiring one yourself 😘 https://t.co/etcPyQtGi6 Thank you so much pecee 😘!! Big hug !! https://t.co/nT4gAnykTH Thank you so much for the surprise 😘 #AeDilHaiMushkil  https://t.co/2YexbUYznI Thaara boht boht shukriya Sultan 😊@BeingSalmanKhan @SultanTheMovie RT @BeingSalmanKhan: Happy Birthday to my Sultani Arfa #SultanKiJaan @SultanTheMovie @AnushkaSharma . https://t.co/bII4Ij71bg Here’s presenting #AARFA @SultanTheMovie https://t.co/7XFjsfUE47 Anddddd another one !! So so proud of you ! You are truly making ur own mark. Well done @priyankachopra ! Many congratulations!! ❤️👏🏼 What better time than today to talk about #Phillauri ! https://t.co/NgcssDaPYY Whatte response to the #SultanTeaser 😁🤗  !! Haryana ka Sher Sultan chah gaya hai ! 💪👊🏼  https://t.co/cpZhatI4HS RT @HTMumbai: #SiblingDay: He is my best friend: @AnushkaSharma on her brother Karnesh, reports @shaallwe https://t.co/D4ES0inrah https://t… What a wonderful, beautiful , happy news !!!! Yayyyyy !!! 😊😇🙏🏼 . https://t.co/zNtB3gty5T CLIMATE CHANGE is a REALITY! Bhutan is suffering despite not playing a part in ruining our planet. Please do watch🙏🏼 https://t.co/OHr5g1dgb4 RT @aliabbaszafar: \"Coming Sooooooon\" @SultanTheMovie @BeingSalmanKhan @AnushkaSharma #7daystosultanteaser https://t.co/dE0OvhJJXw A humble Holi request. Please keep animals away from Holi celebrations 🙏🏻 https://t.co/Tr02TEteJJ Happy holi everyone! Enjoy this lovely day but pls be safe &amp; play with safe colours. And pls oh pls don't throw colours on animals 🙏🏼❤️🤗 Revisited my childhood with this 😀brings back such beautiful memories . Mowgli 😍 🐘🐅🐒🐻 https://t.co/XTOFzDAxfL 100 % TRUE . Love you FAMILY 😍🙏🏼 https://t.co/QgjchZpJ2p Indian Army does nation proud yet again ! 👏🏼👍👊🏼 https://t.co/m1zpef7xDN Look who is impressed by my gorgeous hair... None other than @karanjohar ;) Thank you, @Pantene_India #Pantenehair\nhttps://t.co/IYCXpcsR5R Very imp read- \"With jeeps &amp; technology available there's no justification for police using horses\" DAMN RIGHT! https://t.co/uADmyuTPaH Enjoyed the film 👌🏼 @chintskap @aliaa08 @S1dharthM @_fawadakhan_ @mrrajatkapoor #RatnaShah @shakunbatra @karanjohar Every family has a story to tell! Watch #Kapoor&amp;Sons for its heartwarming story and brilliant performances by the entire cast 👍🏼 https://t.co/tta90q5HCT &amp; pls dnt say -\"but wht abt ppl dying?\"God didn't put U on dis planet wid a voice&amp;intellect if U cnt use it to make it a better place. 2-That beast shld be punished appropriately.we cannt give up till justice is served.this is brutal using ur power over a harmless animal? 1-Couldn't even c dvideo.It is shameful tat v live in a country where a VOICELESS animal is attacked by a beast in broad daylight.ppl watch And it's so gratifying that we at Clean Slate Films start another production in one year after NH10 with Phillauri this April. 😀😇💃🏼🙏🏼 (2/2) NH10 completes a year today.The journey was a tuff one but so rewarding too.Thnx 2 an amazing cast&amp;crew who made it possible &amp; y'all🙏🏼🙌(1/2) True that 😎 https://t.co/Cn120ZfsrI Couldn't have imagined I could do this 2 months ago.Feeling blessed 😇   https://t.co/olfvuIJNMh Hahaha! Thank youuuu 😁I'll give off one or two dhobi pachads to the zombies too 💪 https://t.co/mLaVKTskjq From whom I have learnt the sport (wrestling) over the last 6 weeks 👊🏻👍🏻 grateful for having teachers like you'll 🙏🏻  (2/2) @SultanTheMovie On my way to the shoot, Thank you to these amazing teachers/ pro wrestlers (1/2) https://t.co/Wbss2XUzN3 @jiteshpillaai something nice @sonamakapoor Thank you, you beautiful person ! And you brought back school memories of using J to address jealousy hahahaah 😹 Word 👍 https://t.co/JWoKYiq1A7 RT @ArianaGrande: happy international women's day! ..... I mean week....... I mean month...... I mean year....... I mean life.....  💕 Thanks a '7 million' for the love, support &amp; fr being a part of my digital family.grateful 🙏🏼 \nthank you fr trending #7MillionAnushkaholics😀 @TheFarahKhan fighting cell phone radiation like a boss 😎 ! #Sultan #SongKaShoot https://t.co/Py0mTWEuZf \"There's no real reason for there to be a man &amp; a woman category in acting. It's not track and field !\" - Chris Rock .HILARIOUS😂#Oscars2016 Thannnkkkk you 😁 https://t.co/zjptec2K8A Very much thank you to you ji 😇 https://t.co/nZnuiNbDmc Thank you thank you 😘 https://t.co/lYrIXhMDe5 RT @foxstarhindi: It's took 100 yrs, a crazy Punjabi wedding &amp; complete strangers to complete a love story- #Phillauri @AnushkaSharma https… RT @foxstarhindi: Fox Star Studios is proud to partner with the super talented @AnushkaSharma - a co-production with her production house C… Happy 2 announce our next production venture - PHILLAURI, with @foxstarhindi &amp; co⭐️ing @diljitdosanjh,Suraj Sharma 😀 https://t.co/rqYUQ3h6gZ RT @SultanTheMovie: Haryana ka Sher aur Haryana Ki Shaan ka ghana ishq hai takkar ka. This #ValentinesDay, celebrate the love of equals. ht… Not easy but worth it. Wrestling mode ON! @sultanthemovie https://t.co/gR8q2sgQlk RT @aliabbaszafar: Girl power from Haryana @AnushkaSharma in sultan. https://t.co/RiCt8Qfx2u RT @adgpi: Weather permitting #IndianArmy will spare no efforts to move  mortal remains of nine Siachen heros to their respective families … RT @adgpi: The mortal remains of nine #SiachenBravehearts could'nt be brought down to  Base Camp despite all efforts due to  the inclement … RT @adgpi: The soldier in L/NK Hanamanthappa will continue to inspire generations in the Indian Army #COAS Deep respect for his unit,comrades who spared no effort and never gave up.THIS is the Armed forces, the fauji spirit.They never give up! Lance Naik Hanamanthappa fought till the very end like a true soldier. Heart goes out to his family &amp; his regiment.Deeply saddened. RIP No pain no gain so just train 👊🏻💪😁 #Wrestling #Sultan #Training https://t.co/AN2lwKnHHL #Wrestling #Training #Sultan 👊🏻 https://t.co/knEiNrohiW The video uploaded earlier seems to be from another rescue operation. https://t.co/repT90D4Ns This brings chills down my spine . Heroism is THIS ! Pray he recovers fully. Indian army , they never give up. https://t.co/QtEf1SW444 RT @SultanTheMovie: Sultan's new look without the moustache will bring Valentine's Day early this year! #OnTheSets #SultanEid2016 https://t… Awww man  that's really sweet of you thank youuu 😘  https://t.co/nSnxthV44P Here's wishing #Neerja aka @sonamakapoor a fearless run at the cinemas. #fearvsneerja\nhttps://t.co/he6Y3gvYoo Congratulations @NSaina &amp; @MirzaSania @priyankachopra on your well deserved awards. You inspire so many young minds.More power to U girls 🙌 A very happy Republic Day to all 🇮🇳🙏🏼 New beginnings ... New journey .. Heading for the first day of #Sultan shoot . Excited !! Here we go  .. !! 👊🏼 @RajkumarHirani Karnesh Sharma who pushed me (still does) beyond what I had ever imagined I could achieve 😊 https://t.co/gicTQ1qJqD This downright distasteful interview shows d journalists intellect &amp; lack of basic human respect &amp; nothing else.kudos @SunnyLeone Salute the Indian Army men and women on #Armyday2016 for their selfless service .Proud to be an Army kid . Jai Hind ! How hot and fit is #Katrina in the new #Fitoor song .Nailed the dance ! Lovin it !💃🏼👏🏼 Thank you much suuuuushanth 😁@itsSSR @DabbooRatnani Back again for @DabbooRatnani 2016 calendar 📸 https://t.co/9HSVMKOEml Helloooo it's that time of the year !! @DabbooRatnani calendar is back ! Check out the teaser here 😉 https://t.co/5DgfWgR6Bw 👊🏼SULTAN👊🏼 https://t.co/q54PWau1YG Hey @priyankachopra congratulations on the win !! So proud of you ! Keep rocking yaow !! Where words fail, music speaks :) Proud of #HumHainHappy by @y_films @The6PackBand, India’s first transgender band: https://t.co/XrtSHKPYQX Some of my travel essentials #Sunglasses #WhiteSneakers #Books #Pantene https://t.co/iUCBTnsADX Happy new year guys! Hope this year brings U all you desire. Have a smashing year ahead ! Lots of love 😘❤️ Congratulations to the Jio family for the new beginning. #DigitalIndia #CelebratingJio 👍🏻😊 Good on you @varungrover . But disappointing to know what you witnessed on road and in people ... #SwachhBharat  https://t.co/e0rjRIQdz9 Lag jaa gale ki phir ye haseen raat ho na ho ..... RIP Sadhna Wishing all of you a Merry Christmas 🎄! Hope you spread cheer all around today and everyday . Awww sweet ! 🤗🙏🏼 https://t.co/WJXAR42rvo RT @shreyadhoundial: A distress call.A pregnant woman.A daring airlift.A pair of twins ☺Meet the men who made it possible.#HelpChennai http… Thank you Thank You thank you 😘#7YearsofAnushkaSharma https://t.co/Rv19EAqvR9 YOU guys make it happen.THNK U 4 d support &amp; belief through 7 yrs! Feel blessed &amp; grateful🙏🏼😇#7YearsofAnushkaSharma  https://t.co/oDZyFXn6Q3 RT @forbes_india: .@AnushkaSharma features on the 5-cover special issue of the #ForbesIndiaCelebrity100 list\nhttps://t.co/lr0TpStVLZ https:… RT @ShivAroor: Pilots of the Cheetah in this video are Wing Commander Simon &amp; Wing Commander Venkat. Salute! Want 2point out d IAF pilot didn't come 2take credit 4 Doin wht he did,V don't even know his name.He JUST SHOWED UP!thats armed forces 4 you Salute d armed forces 4 repeatedly coming to d rescue of nation, selflessly, whenever asked ,whatever d situation. LETS NOT FORGET THIS TOO. Chopper airlifts pregnant lady during d #ChennaiFloods.it requires huge huge skill 2 airlift whil hovering.HATS OFF! https://t.co/i53vvAVVN1 Salute d armed forces 4 repeatedly coming to d reduce of nation, selflessly, whenever asked ,whatever d situation. LETS NOT FORGET THIS TOO. Presenting the new super hero.SuperKJO !!on a mission- Mission Ae dil hai mushkil🤘🏻😎 give it up for him @karanjohar https://t.co/JkOLaFcFSE RT @thenewsminute: View spreadsheet #ChennaiFloods Organisations to contact to donate money,aid material https://t.co/uPMyGBqf3Q https://t.… RT @shilpakannan: #ChennaiRains #ChennaiFloods can anyone help? @Chinmayi @RJ_Balaji @Raheelk  https://t.co/RJ4Qlr7jJQ RT @dhanushkraja: Marundeeshwara kalyanamandapam \nAnagaputhur is now open for people who need shelter in tambaram ,chrompet,tiruneermalai, … RT @chintskap: Chennai Helpline numbers. Please circulate thanks! https://t.co/t1Ycr6KnBQ RT @sunderramu: 1000 packets of food will be available in Saidapet by 1-00. Please let me know if someone can pick it up from that area. Th… RT @SivakarthiRagul: Forwarded by my friend @Senthil04622171 \n\n#ChennaiRainsHelp #ChennaiRains https://t.co/njrktCqAtp RT @Actor_Siddharth: Many people died in their cars in the Bombay floods because power windows and central locking jammed. Don't sit in bro… RT @MVignesh0106: #chennairains anyone near adambakkam or Guindy contact me at 9994434657 will do as much as I can Also open to accommodate… RT @CinemaCalendar: For rescues from reptiles such as snakes\nContact: Wild life biologist Nishant at 98-45-018969\n*Verified #ChennaiRains \n… RT @ModiBihar: \"@aravinthiron: #ChenniRain\n\naccommodate 10 to 15 ppl  at alwarpet.. kindly share it.. conta: Ravi 9003233127 \n\n#Chennairain… RT @Calvinator_18: Don't be cynical about what your tweet/RT can do. It can make this happen. #ChennaiRains #SpreadTheWord (cc @npueu ) htt… RT @dhanyarajendran: And big favour each one of us can do, do not spread unnecessary, unverified messages on WhatsApp. People are already s… RT @rajstr686: @anandappuu @AnushkaSharma Anyone can help in tambaram.. my frnds aged dad n mom stck in bustand. cntact 8056986290 RT @Jaitwits: If stranded in Adyar, BesantNagar, OMR, ECR &amp; Velachery, Please call Abinash @ 9790904355 for help. #ChennaiRains #PrayForChe… RT @sanketbmehta: Just as precaution, if water levels are rising, switch off your electricity mains. It's okay to sit in darkness. #chennai… RT @sairaghul: Shelter info from twitter tweets  \nullagaram 9094500856­ Vijay 4 ppl \nvenuvampet  paramjeet on9843969710 &amp;  9042105982 4 ppl… RT @anandappuu: People stuck near Camp Road areas can contact Mr. Bala:+918056096733. #chennairains RT @YOGEZZZ: Breakfast &amp; lunch for tomorrow will b provided for people at Jain Temple in T-nagar GN Chetty Road.5000 packets being prepared… RT @naqui_s: Tips 4 driving thru flooded areas.Very useful &amp; informative.Mite b helpful\nBy: @autocar\n#chennairains #ChennaiFloods\nhttps://t… RT @randysatha: Accommodate 20-30 people at #Korattur \n\nCall: 8553661791... #chennairains RT @mousyr1: 5000 food pkts are ready for distribution\nPls contact \nvineet Jain 9840426263/ \nGaurav Jain 9841062626\n#chennairains RT @Actor_Siddharth: We have a 5 car convoy patrolling affected areas in #Chennai . Please collect genuine transport issues and post to me … RT @jaswanth_thota: I have a school to accommodate 75-100 in Nungambakkam.food at Chetpet to closely around 1000ppl\n+917092020207\n+91893943… RT @sam9456: contact no. 9840293438\n\n#chennairains https://t.co/8ZVPpHXxPH RT @CinemaCalendar: If you're worried about pets contact: Ms. Paul Shefali Mohan\n@trishtrashers | #chennairains https://t.co/OdpGRoVgLh RT @ndtv: #ChennaiRains: Emergency helpline numbers here:\nLive updates: https://t.co/FML6rdyUiH https://t.co/X03gxykV8Z It's ironic you use the word 'ballsy' @HuffPostIndia RT @ANI_news: It lies in our unwillingness to let go of views that divide society into “them” and “us”, “pure” and “impure”-President Prana… RT @ANI_news: Real dirt of India lies not in our streets but in our minds-President Pranab Mukherjee I can feeeeel the love, guys!! Thanks a '2 million' for always being there... Here's sending you… https://t.co/ge4WzhprIx RT @RajeevMasand: Thank you @AnushkaSharma @RichaChadha_ @deepikapadukone @kalkikanmani for being on The Actresses Roundtable! https://t.co… So my parents walk our pet on the beach every morning... And fed up of ppl not having basic civic… https://t.co/B31Ru6OsHE RT @MarkRuffalo: Don't allow this horrific act allow you to be drawn into the loss of your humanity or tolerance. That is the intended outc… Woke up to the horrific news about attacks in Paris. Pray for more courage for the people in Paris against these cowardly attacks . Thank you @AnilKapoor Sir for your support #AnimalFriendlyDiwali #PAWsitive\nhttps://t.co/z6NqlnIgSU RT @lack_a_daisy: Happy Diwali, people! 🎆🎉💟\nBe like auto wallahs.\nTreat your crackers like passengers.\nSay no to them 😂 😘😘😘 you said it !!! @MeiyangChang  https://t.co/zPxUPvetdD May d festival of light remove all d darkness this Diwali.wish you all lots of prosperity &amp; growth in every way. Pls be safe &amp; noise free🙏🏼😇 Animal lover @iamsonalibendre urges ppl to act differently this Diwali. Thank you 😊 #PAWsitive #AnimalFriendlyDiwali https://t.co/7Uz1BkNM5o Here's @AlliaAR sharing the message of an #AnimalFriendlyDiwali 🐶😽🐴\n#PAWsitive https://t.co/GPvkAWDWeo Hey @priyankachopra thanks for doing this &amp; speakin frm the heart !! Lots of love 😇Guys listen up. #PAWsitive\nhttps://t.co/didURFH2cJ Here r @imVkohli &amp; Bruno spreadin a key &amp; v significant msg. B compassionate &amp; do d ry8 thing dis Diwali. #PAWsitive\nhttps://t.co/ym1ZNQR2Lx A HUGEEEE shoutout to all my fan clubs.U know who U are 😽U guys make me so happy!Thank you for the positivity always.#6MillionAnushkaholics Guys THANK YOU for this lovely chat.tried answerin as many as I cld.lots of love &amp; gratitude for y'all.Happy Diwali to all!be compassionate😇 She was what you saw #6MillionAnushkaholics  https://t.co/dAULIhxAg4 That's cool ! You guys make it happen ❤️ #6MillionAnushkaholics  https://t.co/tURqTmd03n They have their reasons . The reasons may not be true 😜 #6MillionAnushkaholics  https://t.co/qen5raUaAh YES I AM A VEGETARIAN ! #6MillionAnushkaholics  https://t.co/HDpFva5ytI Can't change people . You have to change your attitude towards them #6MillionAnushkaholics  https://t.co/YYFllWsZsD Yes ! I do ! Don't do endorsements if I'm not sure of what they are saying is correct . #6MillionAnushkaholics  https://t.co/67Gm3KEUbY Akshay Kumar #6MillionAnushkaholics  https://t.co/z97eN5ydkr Mostly ignore (I'm ace'ing it 😉) but blocking is a great tool too . #6MillionAnushkaholics  https://t.co/BPzgE3atY3 An initiative to make people more sensitive towards animals . Creating awareness #6MillionAnushkaholics  https://t.co/0fSEq00WJH That's cool !! High five Hyderabad 🙌 #6MillionAnushkaholics  https://t.co/WI8TJBA7YV Being misjudged . #6MillionAnushkaholics  https://t.co/RBEI1uoIKX Nope ! Loving it ! #6MillionAnushkaholics  https://t.co/378HKfH65P Yupp I love reading #6MillionAnushkaholics  https://t.co/M6D2zoGDxt Nope.In life I only do things if I'm completely sure.Proud of all my films.taught me a lot ! #6MillionAnushkaholics  https://t.co/fTs4B6Exbz Oh wow ! Thank you 🙏🏼❤️ #6MillionAnushkaholics  https://t.co/MsvsXGcQU9 🤗🤗🤗🤗🤗 https://t.co/ii4JqXhiIg लाती नौनी छे तू #6MillionAnushkaholics  https://t.co/FvPnQwXeBq Of course !! Have started a campaign for just that #PAWsitive . It's very close to my heart #6MillionAnushkaholics  https://t.co/fxDDxnAgAI Don't like nosy questions about personal life #6MillionAnushkaholics  https://t.co/MOl7PvTsYC Yea .. Now .. But I've always loved Tennis . Still do !! #6MillionAnushkaholics  https://t.co/ony8OHnTlS Meanness and lack of care for people around you . #6MillionAnushkaholics  https://t.co/XiDRCOFFC0 Eat , train , be with dude , watch tv ......:::::: #6MillionAnushkaholics  https://t.co/nnGoAwNyPC OMG that is amazing !! Oh I feel so grateful ! Thank you to everyone 🙏🏼#6MillionAnushkaholics  https://t.co/bQr8rHciuN Anything within reason 😜 lots of love to you no broken heart !#6MillionAnushkaholics  https://t.co/FiuzDwuTVl A learning curve and very fulfilling #6MillionAnushkaholics  https://t.co/rYPNBTg9ir I really like AB Devillers both as a player and a person #6MillionAnushkaholics  https://t.co/I2M6ge8OlQ I freakin love you all !!! Thank you for being so awesome always 😘❤️ #6MillionAnushkaholics  https://t.co/6c3b1DKoFA To be so many different people , live so many lives in one lifetime #6MillionAnushkaholics  https://t.co/2Wo7OhVpOq You should In fact like me cuz we both share good taste 😉 #6MillionAnushkaholics  https://t.co/cCTvjQe6Xx Manipulation , dishonesty and fakeness #6MillionAnushkaholics  https://t.co/VqF5yDWVfc I breath &amp; go away from the situation or person making me angry till I'm calm &amp; rational #6MillionAnushkaholics  https://t.co/4Oy0httA44 Hi my lovely !! #6MillionAnushkaholics  https://t.co/8U0haZItkL Hard work &amp;  courage #6MillionAnushkaholics  https://t.co/uPhODpfKtX Hopefully soon ! He's a friend and v talented ... So ya it'll be fun I think #6MillionAnushkaholics  https://t.co/9TmjtSV7dO How old Do you want me to be ? 😜😜 #6MillionAnushkaholics  https://t.co/dB2XhZM8Ua Oh ya !!! I'm a huge Federer fan !!! #6MillionAnushkaholics  https://t.co/HebhyiUcb1 All the best ! Rock it ! And everyone else taking exams now #6MillionAnushkaholics  https://t.co/UgqBCtjErL Hamla 😜 I'm happy with my gender and name though #6MillionAnushkaholics  https://t.co/R0Xp6lYa5G Will have to be NH10 . But it was equally rewarding too because of the appreciation it received from u guys https://t.co/6alb31Jago Humanity . It's a great one ! #6MillionAnushkaholics  https://t.co/EKFrs6Iodz For the work I did .. And the difference I made to someone's life #6MillionAnushkaholics  https://t.co/MA0FGUFjue Depends on the mood . Like soft on drives . Rock when chilling .. Love pink floyd 😍#6MillionAnushkaholics  https://t.co/H0EgLYiRsj Alrightttttt !! Here I am .. Shoot your q's !!!! I'm gonna be with you y'all in 5 mins for our chat ! Look forward to it 😊 #6MillionAnushkaholics Another animal lover @S1dharthM shares his pet story. Thanks for the support! #PAWsitive #AnimalFriendlyDiwali\nhttps://t.co/v7fc579j0r U guys r amazing. Thank u for ur love &amp; support. Love to chat with y'all at 5pm today. Comin?💃#6MillionAnushkaHolics https://t.co/6DhvXjxYx4 Here's Francis sharing a horrid Story of the manic torture a stray dog went through #PAWsitive #AnimalFriendlyDiwali\nhttps://t.co/9EV8rRXWIS Guys so Here's Alia talking about her cats .. Thanks @aliaa08 for your support 🙌🙏🏼😇❤️🐶😽\nhttps://t.co/jh44jdMvor Rishabh shares a personal experience that traumatised his pet. Hope this sensitises people this Diwali #PAWsitive\nhttps://t.co/rFPT9plq0S So heart breaking.People stop sending stupid irrelevant replies &amp; understand Just cuz ur human ur life isnt more imp https://t.co/tPeFVwIxwl If you liked the original Band Baaja Baaraat, you will love @Y_films ki crazy #BANGBaajaBaaraat. Watch ep 1 NOW: https://t.co/SkKj4AXsSR Animals can't protest but Diwali for them is one of the most helpless time of the year. #PAWsitive https://t.co/cb94wcgjAW Firecrackers alter the natural light levels of birds making it difficult for them to see &amp; breathe. #PAWsitive https://t.co/Ns5mfWqHUk 😁👊🏻🙏🏼 https://t.co/RzCBQsY50E 🙌😁🙏🏼 https://t.co/6joctTU30t Stray animals eat toxic waste of firecrackers which dangerously affects their health. #PAWsitive change this Diwali! https://t.co/8eY50wMRdu RT @ANI_news: Creativity has no religion.when we start questioning creativity or creative ppl we are doing the most disservice to nation: S… RT @karanjohar: The #AeDilHaiMushkil selfie!!! https://t.co/NOybVfsQSI Watch Meera's revenge unfold on the World TV Premiere of NH10 tonight at 8pm on @AndPicturesIN #NH10TVPremiere https://t.co/T71Aiyf9Ia Animals can hear sound frequencies above d range of an avg person.Spread noise abt helping thm dis diwali#PAWsitive https://t.co/9aYfaqdm0b RT @anupamachopra: .@Mumbaifilmfest celebrates Mumbai and Movies; An interpretation by the amazing #RahulNanda https://t.co/xwcAbUkWfA World Television Premiere of @DDDTheFilm tonight only on @zeecinema at 8pm. Don't miss it ⛵️⚓️ Wishing everyone a happy Dussera !!"}