{"tweets": "The Barnes &amp; Noble Kids’ Book Hangout is Saturday, 10/19 @ 2 PM, and #TheMagicMisfits is one of the featured books! Discover your next favorite book, enjoy activities, and get #FREE book swag while supplies last. Sign up here: https://t.co/199IkAW4YB #BNHangout https://t.co/0V2BidqNCZ Anyone in the Orlando area, come have brunch at Epcot with my husband and the family. He’ll sign stuff, teach stuff and take pics a’plenty. Proud to be part of the @Epcotfoodwine Festival this year! @Davidburtka https://t.co/ugob98ZM5D I thank my childhood piano teacher Jane Deyo and her musical dedication. Nominate YOUR favorite teacher to win $500 in school supplies from @Adopt_classroom - just pick up a box of Quaker Chewy and go to https://t.co/aXrZowkqHT! NO PURCHASE NECESSARY Ends 9/30/19 #QuakerPartner https://t.co/62ZphX23D0 A Series of Unfortunate Events lost at last night’s Emmys to Sesame Street. I’d say I was bummed, but Catherine O’Hara told me: losing an Emmy to ‘When You Wish Upon A Pickle’ is in many ways, a funnier way to end the story. I like that. #befitting  #countolaf @netflix @TheEmmys @zombah76 @halfpricebooks I’ll DM you an address - if you mail it back unopened, I’ll send you something utterly awesome. Does the new iPhone 11 Pro come with drool protection..? #want #need @Apple Sending thoughts and prayers to everyone affected by the tragic events of 18 years ago. New York is my home, and its diverse residents are a shining example of strength and resilience. #NeverForget911 This is fantastic! Thanks for choosing my book, I’m super honored. Hope you enjoy the sequel, and number 3 comes out in a matter of weeks! Yay, Book Clubs! https://t.co/igmNttgKgS Can’t believe that my THIRD Magic Misfits book comes out next month. It’s a proper series, yo..! Doing a bit of a book tour - if you’re able to come, please say hi. I’m super proud of the world that I’ve created. #MagicMisfits https://t.co/Xjcxa0oNGW Ending #AIDS, #TB and #malaria is within reach, but not yet fully in our grasp. We have no time to waste. The @GlobalFund is calling on the world to #StepUpTheFight and help save 16 million lives. Add your voice to the open letter today: https://t.co/qvaK8AUwfn https://t.co/tFG1Ntmoan Sign this petition and help save satire! https://t.co/t1lublSY1z #STAYMAD #SaveMADmagazine #IDIOTSUNTIE My husband and kids explaining how to make multiple flavors of popcorn just fills me with delight. They are all crazypants and make me so happy. Thanks @Food52 and @Davidburtka for making this video: https://t.co/PjzwAUfwop Just listened. So much fun! Thanks again for having me, @EscThisPodcast https://t.co/uRxhXi2Abh I’m the guest on an awesome audio escape room podcast! Still reading this? Awesome. Then check out @EscThisPodcast and play along. There’s even magic! Or just click here: https://t.co/XShDPOfwr4 Hey @DCcomics: please don’t cancel @MADMagazine! Losing satire is the LAST thing we need right now. The future of the weirdos who will change the world depends on it! #SaveMADmagazine Happy 4th of July! Have a great time today, and try to use some common sense. https://t.co/wNRpYO9PLK Recorded an episode of one of my favorite podcasts: @EscThisPodcast, where players figure out how to escape a themed room filled with puzzles, locks, codes, and all sorts of clever escape room trickery. Mine comes out soon, but I’d suggest you subscribe and start listening now. Are you watching the @HBO documentary WIG? It premieres tonight, and I’m so proud of it. Hard to believe that only 18 months ago @DavidBurtka had the idea of reviving the @LadyBunny77 all day drag festival Wigstock, and now a film exists to captures the show and so much more. https://t.co/9Qt4oYgy4W @Andy You have any contacts there? Drawback to #TelAvivPride being so successful: we went out tonight and every gay bar was so nutso crowded we wound up going back to the hotel. Harrumph. Perhaps tomorrow, Tel Aviv. I’m anxious to see your sights. 🏳️‍🌈 Pumped at the stellar job @winehive did making me look super fancy with this new wine storage. So much better than boxes... #winehive https://t.co/KEvtTe2JEs RT @joshgroban: In case you missed it, watch @JoshGroban, @JKCorden, @SaraBareilles, and @ActuallyNPH’s hilarious take on ‘Michael in the B… Go, @ThePromMusical, Go! #obsessedwithBrooks @TheTonyAwards Andre De Shields’ Cardinal Rules of Longevity are absolutely brilliant! @TheTonyAwards Watching the Tony Awards. Wishing all the performers great congratulation - what they all do eight times a week is remarkable. And loved that big opening number..! #bravo Mysterious Package Company. @themysteriousco. I’m not a sponsor, just think they’re awesome. https://t.co/oIwOONFlEC Broadway Pre-Tonys Date Night: saw @Hadestown and am high from their talent and energy. Its palate made me want to touch and smell and feel and dance. Such specific talent showcased brilliantly. @reevecarney is sickening, and he is but one of many. Go see this cast! #TonyAwards Honored to be a part of the discussion on LGBTQ rights with @EW and some truly incredible advocates. #lgbtq #pride https://t.co/uv68rxOjyZ https://t.co/idUpmNcIcX The new iPhone update claimed that I can use my phone to pay for subway rides, and what, whaaat? - IT WORKS! #awesome #apple #phoningitin #thefuture #MTA #fourfivesix https://t.co/WXZ7qXMYrQ Watched I Think You Should Leave with Tim Robinson (@RAeSTimR) on an airplane and was laughing so hard that other passengers were getting concerned. Binge on @netflix if funny is your flavor. Sad that this still exists in the world. Happy that @RainbowRailroad is saving lives. https://t.co/nNkSlnJQop RT @doctorofflaws: And to think Jaime only needed to hug Cersei right there #GoT https://t.co/J8ZlNb2qsO Tim Conway made me laugh harder than almost anyone on TV, ever. He shaped my sense of humor, inspired my love for comedy. So sad to lose someone so funny. #RIP https://t.co/XAcNxWbylm Looking forward to it. If the quality of their gyms is any indication, the @Equinox hotels should be stellar. https://t.co/yk1jav7Bh3 T-Minus 6 days until Mother’s Day! @PortalFacebook #FeelThere #PortalPartner https://t.co/jsrBPc8axx https://t.co/OJ7MvH5brT A big congrats to all the performers nominated for @TheTonyAwards. It’s an exciting time. An even bigger congrats to all those hard working performers who didn’t get nominated - the show doesn’t go on without you, and I’m crazy thankful that you’re so talented. #grateful Game. \nOf. \nThrones.\n\nGoodgod. \nOhmygod. \nThatwasbrilliant.\n\n#gameofthrones Lovers of VR and puzzles and creativity: there’s only a few hours left to back @firmamentgame on the Kickstarter. It looks rad. You should buy it. https://t.co/8itMeP3yXY I love escape rooms, and The Basement in L.A. is easily the best I’ve ever done. Great puzzles, stellar production values, live actors (!), awesome staff, just fantastic! Well worth a visit. Or four. @basementla #escapewedid https://t.co/IoiaiSCgme So proud of my husband @Davidburtka and his amazing cookbook. Last night’s LA launch event was awesome and the food (his recipes) was expectedly divine. Please grab a copy and see for yourself: https://t.co/fGF8twh2nX #LifeisAParty https://t.co/zP693FMjRc Playwright Mark Medoff passed away today. He essentially discovered me, I owe my career to him. Wrote Clara’s Heart, championed me for the role. Without him, I’d be nowhere. RIP, Mark. Thank you. Sending love to his amazing family. https://t.co/H6VhNtJzyV David’s book is available, starting TODAY! So psyched that so many people are buying it. What are you waiting for?? https://t.co/bhNW2Kpo1v @Davidburtka https://t.co/mGGkN8aS40 Let’s do lunch! Join David and me at the literary luncheon #AuthorsInKind on April 17 in support of @godslovenyc – David will be signing copies of #LifeisAParty and speaking about life, food, family, the works! Learn more and get tickets: https://t.co/3gyfmMY0Uk #soproud https://t.co/NvwSdzMpGJ Had so much fun on the first stop of my book tour tonight! Awesome to see so many kids reading, and asking great questions! Ruby was so cute I brought her up on stage! What’s gonna happen tomorrow in Phoenix? Come and see: https://t.co/cFUTESIn1i @changinghands #magicmisfits https://t.co/GgeMjtelJv Sorry I haven’t tweeted in a while. My son introduced me to this game called Hay Day, and now every time I open my phone to do anything, I just wind up harvesting crops and relocating my silo. EXCLUSIVE! The next #TheMagicMisfits adventure won’t appear on shelves until September 10, but with a little bit of magic, I can reveal the cover now. Preorder Magic Misftis: The Minor Third! https://t.co/I5PUt4KGA2 https://t.co/t4kiDdWEZo Don’t miss an early look at @davidburtka’s gorgeous new cookbook tonight on @QVC! So proud of my talented husband..! https://t.co/TvgY1gFhWP David and I partnered with @OpenTable to bring you our Tastemaker list featuring our favorite restaurants across the country. From SF institution @quincesf to our favorite Italian in KC @lidiaskc, we've covered it all! See the full list: https://t.co/jb5gpJ3ye1 #OpenTableTastes I love my big brother, he’s all kinds of awesome. Check out the big surprise  renovation I gave him on the latest My Houzz: https://t.co/T8D7gumrqO Wanna join me, @CobieSmulders and #HIMYM creators Carter Bays &amp; Craig Thomas for a legendary night out in NYC? To donate &amp; enter to win, go to https://t.co/fPY19qOfU5. Proceeds support Rady Children's Hospital-San Diego's groundbreaking research to help children w/ heart issues. Rest In Peace, Karl Lagerfeld. You truly were an inspiration. https://t.co/CPLJQU6nHC David and I are hosting the Burger Bash on Friday in South Beach at the #SOBEWFF . Come hang out and judge the best burger for yourself! @Davidburtka https://t.co/bleUjUewhV I love being in love. Thanks for accepting my Valentine, @Davidburtka. https://t.co/ZereOheMVE I’m not the Peacock. Immersive experiences aren’t just for the Halloween season, they make for exciting nights out all year long. If you’re in LA and looking to channel your inner Indiana Jones, check out the unique and cinematic @EnterDelusion: The Blue Blade. https://t.co/DiXWycLVEI Please go see The Band’s Visit on broadway before it closes in April. It’s so cinematic and unlike any other show playing right now. The cast is sublime, and the book by Itamar Moses is stellar. Check it out. @TheBandsVisit https://t.co/85hhGFQYvq Looking forward to it, San Fran. https://t.co/Sd5jzP02o7 San Francisco: I’m heading to your fabulous city this very weekend to participate in SF Sketchfest. Can’t wait to chat, laugh, wander, and eat amazing food. Come join the fun: https://t.co/DLrxx06y4D @SFSketchfest ‘The time is always right to do what is right.’  - Martin Luther King, Jr. Chef Andrés is an extraordinary helping machine! It’s simply amazing what he accomplishes. Follow him and be overwhelmed by his passion and compassion..! https://t.co/qpgrxDMN6V Normally I like my Broadway theatre with a big cast, sets that move, exciting visuals. But I just saw Mike Birbiglia’s solo show The New One and it was awesome, hilarious, and touching. I’m a new fan and hope it get recorded so others can love it too. Bravo @birbigs! @NewOneBway Carol Channing. A legend like no other. May she Rest In Peace. #GoodbyeDolly https://t.co/SnjT9m4P4j This could be us… on a double date… at the Central Park Zoo! But it’s your LAST CHANCE to support a great cause and ENTER: https://t.co/rEflhYuOCJ As I’m not hosting the Oscars, watch me host the next best thing: HQ Trivia! At 9:00 EST I’ll host their new show @hqwords ($10k at play!) and at 9:30 I’ll host @hqtrivia - all How I Met Your Mother questions. Boom. Whaat? Let’s do this. Download and play: https://t.co/AXUgo2PHG2 Haaa! Nice try, Anna. It’s spelled ‘understudey’. Boom. I’m gonna crush on Thursday. @hqwords https://t.co/FSQ6mztCNs Awwwww, yeah! Let’s DO this! Let’s solve some puzzles, stare at screens, watch me babble, win some scratch! @hqtrivia @hqwords https://t.co/iVsDGH2SU2 Trying to pull myself out of a @netflix rabbit hole called #Bandersnatch from @blackmirror creator Charlie Brooker. It’s spectacular technology, a visual choose your own adventure movie that is dark, clever, morbid, amazing. Can I please play in your sandbox?? https://t.co/p5nNsQDWCj The feeling when you start the New Year right. Thanks @Sailrockresort for such great good times. Happy 2019! #grateful @Davidburtka https://t.co/QKEnQ1rYVR #CapitalOnePartner What a night! Had a blast mingling with @CapitalOne cardholders in December and providing them with this exclusive experience. #SavorMoments https://t.co/o4XiJPkvVe Happy New Year! As a gift to you, I will SPOIL season 3 of Series of @Unfortunate Events (streaming tomorrow!) - I win! I catch the Baudelaire children, steal their fortunes, and end their lives. Ha! Well, I rewrote the script and am pretty sure they took my notes, sooo, 🤞🏼. https://t.co/e3XCnuoWHT As a tired parent, I’m legitimately stoked that the Barbie Dream Camper took no time to assemble. I’ve spent the last two hours appreciating that fact as I apply the 30+ stickers onto its various surfaces. #Christmas2018 My new book, The Magic Misfits 2, is a delightful holiday gift choice. It’s filled with spellbinding adventure, tricks to learn, codes to crack, and can arrive by Saturday! Annnd, it’s a flat rectangle, thus easy to wrap! You’re welcome. #themagicmisfits https://t.co/1UK01TdNao I’ll try to bring my A game. Wait, it’s Disney, so my D game. D game? That doesn’t sound... I’ll do my best. 🤞🏼 https://t.co/HcWKLK5JwN Well played. Hard to miss a sharp suit. #respect https://t.co/J7W9v6jR05 Always, @cavadeltequila. Your margaritas are the awesomest. https://t.co/axIY8J8XZH #CapitalOnePartner To celebrate the launch of their Savor card, @CapitalOne asked me a couple questions about 3 of my favorite things: dining, entertainment + @DavidBurtka. Savor rewards you for 2/3 of those things. #SavorMoments https://t.co/1JknPtKNmS https://t.co/AiaCVnXOKR It was totally the sipping of the water... https://t.co/YdWQjXWVr1 Having such fun narrating the #CandlelightProcessional at @WaltDisneyWorld. You can watch it LIVE tonight (their first ever livestream!), but only if you want to be filled with Christmas cheer. 8:10pm EST. Link: https://t.co/i7RoAj393L For Christmas, Harper wants Barbies and Gideon wants Hot Wheels, two timeless brands of awesome, better now than ever. Makes me happy, as David and I wanted the same things when we were young. #Barbie #YouCanBeAnything #Ken #is #hotwheels @mattel #NotAnAd #ijustliketoys With all the cyber offers today, I thought I’d add sweet sincerity to the mix: two friends (perhaps the nicest, wisest, kindest people I know) are selling delicious artisanal JAMS that come in wooden boxes. Yeah. A jam box. Go to @BFKitchen &amp; enter code #whatsyourjam for 15% off https://t.co/jZitlCVpTO Master magician and historian Ricky Jay has passed away. The breadth of his knowledge and appreciation for magic and the allied arts was truly remarkable. Such sad news, such a profound loss. #RIP https://t.co/VRYRxhkQKr Dancing With the Stars just confirmed why I don’t watch Dancing With the Stars. Please vote for Milo &amp; Witney during EAST COAST LIVE show, like, RIGHT NOW!! GO TO: https://t.co/lsz538ag54 You can vote from any time zone as long as you vote during the live broadcast of the east coast show.  People in LA have to vote at 5 PM before the finale. THANKS! #vote https://t.co/AnLRHnQ3w4 My book as the perfect gift? Indeed! If you’re already gearing up for the holidays @BNBuzz just made an exciting announcement: #TheMagicMisfits are part of the #BlackFriday promotion which means signed copies will appear 11/23 in your local B&amp;N https://t.co/EhhmW09qJI Had so much fun decorating holiday trees with @BusyPhilipps in our @MichaelsStores MAKE Off! It hardly mattered that it was a competition … or that someone’s tree was voted best. https://t.co/NY9cVf1neI Well this is very exciting for me, having #TheMagicMisfits as a finalist for the #GoodreadsChoice Awards. Cast your vote now: https://t.co/mfVFARA0Ks https://t.co/L0kC7yS267 Count Olaf and Lemony Snicket come bearing terrible news - the release date of A Series of Unfortunate Events, season 3! (Here’s a hint: it’s January 1st) #spoiler @Unfortunate https://t.co/QI2OntDKr2 Those who served and continue to serve in our military deserve respect and admiration all year long, not just yesterday and today. But having it written in everyone’s calendars demands recognition, which is always a good thing. #NeverForget #taketwo LOVING THIS! https://t.co/ySY291bbtT Competed with @BusyPhilipps in a holiday @MichaelsStores MAKE Off for the famous Maker’s Cup! I’m going for the MEGOT! #dadjoke #bad #ad #trim #tree #Michaels https://t.co/O5XlIoXi8P Well said, @chadwickboseman! Let’s VOTE tomorrow. If you want change, it’s the only way. https://t.co/3I5X4uOgug There's still time to enter the @StJude Best Dance Moves Challenge on @Duuple. Head over to the app, upload your best dance move video today for a chance to win $500. Win and, like magic, I will match with a $500 donation to help amazing kids. Let's do this!  #ChallengeAccepted https://t.co/1rFsM4sQf0 Up for a double date with David and me? And not just any double date… we’re going to the Central Park Zoo! Join us, support the Wildlife Conservation Society and ENTER HERE: https://t.co/G2PkPG4Qjs https://t.co/MhOvG58IVL Check out this year’s Halloween pic. It combines two of my all time loves: my family and Disney’s Haunted Mansion. It’s posted on David’s Instagram account. Hope you dig. https://t.co/u63DPjRanP I need one of these in my life. Or at least in my living room. https://t.co/LzWZwbheia I’m beyond excited to see #TheMagicMisfits nominated for the #GoodreadsChoice Awards. Help the Misfits bring home the gold by voting here: https://t.co/mfVFARA0Ks Can’t stop thinking about the victims of the massacre at the synagogue in Pittsburgh. Read their obits - each one gentle, sweet, generous, devout and loving. Pillars of their community - the neighbors, friends and family that any of us would want. #RIP https://t.co/pUKEOn7J1n Thank you Texas and @TBABooks! You’ve got magical taste in tomes!#TheMagicMisfits https://t.co/TW6lRsIliK Friends are fun. Last week on @Duuple we launched a #charitychallenge for @StJude. Next, #funwithfriends. I challenged my friend Leah to a few food dares - cue the video and let the hilarity ensue. Download the app and challenge/embarrass your friends today.  #challengeaccepted https://t.co/DAVgYXibCY Apparently, both Watson and Harper slept well last night. https://t.co/usKaGiMKMM This is @duuple - the new challenge-based app empowering you to do good and have fun. Today we launched the Best Dance Move for @StJude. Submit photos of your best moves for a chance to win $500. I'll match it and, voila - $1000 to help amazing kids! #likemagic #ChallengeAccepted https://t.co/nwhlwY9kYW I’m a highly trained TV Doctor who partnered with @Cigna for this #ad, so I’m qualified to remind you to get your annual check-up. I’m also pretty sure that this thing I’m holding is called a tongue stick. #GoKnowTakeControl https://t.co/uVCNxrSBgq I’m a big fan of ⁦@Gimletmedia⁩ and their podcasts. Just binged the entire 8 episodes of their latest scripted drama. I loved it.Dark, moving, very R-rated. Bravo ⁦@daphnerubinvega⁩ and @bobbycannavale1 #macabre #SweeneyTodd https://t.co/VLNjkQrBYc Amazing time sharing the stage with @Davidburtka at Broadway Tastes on Sunday celebrating @CapitalOne’s new dining + entertainment cash card, Savor! #NYCWFF #CapitalOnePartner #SavorMoments  https://t.co/1JknPtKNmS https://t.co/F6BGstMWvL A nice interview in @EW about books I dig: https://t.co/8oohJVKPLv Stand tall and be proud, comingouters. Now yer hotter. #NationalComingOutDay2018 My new book is #1 on the @nytimes Best Sellers List!! Thanks to everyone who purchased The Magic Misfits: The Second Story, and for those who haven’t, whatcha waiting for?? Click here: https://t.co/CiG084DLul https://t.co/pYabLPUqF3 My first time... @ChrisEvans, #ScarlettJohansson, @ChadwickBoseman, @MarkRuffalo, @DonCheadle, @ZoeKravitz, @RosarioDawson, and @AMarch4OurLives #VoteForOurLives #TurnoutTuesday #RiseUpRegister @WSUCampaign https://t.co/S0vqL63HRp Magic Misfits book tour lands me in Austin, TX! Good times here always! If you’re free tonight and in town, let’s spend an evening together! https://t.co/zjtm3TO284 Can’t wait to chat, Laura. Looking forward to a rousing, magical discussion. See you in a few hours! https://t.co/8LI68wF3KQ Next level balloon animal badassery.  https://t.co/va3d42qTBc Spent a day last week with @DavidBurtka celebrating the new @CapitalOne Savor card. It rewards you on dining and entertainment - two things we love. So we celebrated by… doing two things we love. Meta? Awesome? Both. #SavorMoments #CapitalOnePartner https://t.co/1JknPtKNmS https://t.co/VT5mAjaLBU Awesometown! Welcome to the club! Glad he’s reading the first - Book Two comes out soon! https://t.co/bsQacrngLV Seventeen years. I pay my respects to those lost in the Twin Towers collapse, and I pay respect to all those heroes who came to the rescue. #NeverForget #NYC Flying home to NYC. Unidentifiable mist seeping out from the cabin vents. Very James Bond. I’m equal parts concerned and delighted... https://t.co/XgL6FCY9p0 I’m working with #JifPowerUps to find a new solution to the after-school snack time struggle. When Harper and Gideon get picked up after class, they’ll be hangry and’ll need to eat something quick. Thankfully, I always have Jif Power Ups on hand. Kaboom, chomp! Problem solved! https://t.co/eCZ5DKMGd1 Come to Wigstock on Saturday! Let’s dance, mingle and flirt! I wanna sell this bitch out so there’s a SPECIAL DISCOUNT OFFER on general admission tickets: enter promo code WIGS for over 50% OFF! Limited Supply! https://t.co/hE4IoQY2xk Excited to partner with @CapitalOne for the awesome new Savor card launch – it rewards you for two things we dig – food and entertainment! #SavorMoments #CapitalOnePartner https://t.co/dxJOVVjuSh https://t.co/4aIyuJQKRQ I’m stunned and saddened the unexpected passing of Craig Zadan. He’s been a friend my entire adult life, championed me to host the Oscars, brought musical theatre back to TV. A wonderful, kind spirit. My sincere condolences to his family and his partner, Elwood. #RIP https://t.co/BWLDmViJar Can't wait to hit the road next month - it’s my book tour for the second book in #TheMagicMisfits series! Join me for candid conversation, backstage meet-and-greet opportunities and maybe even a bit of magic! https://t.co/Y9IpcQfnrU @LittleBrownYR https://t.co/U2Rq7lO451 Derek Cody Delgaudio - you, sir, are the mother fucking Roulettista. Congrats on a remarkable, record-setting run of @InandOfItself at the @DarylRoth Theatre. I am beyond proud to have had NYC witness your talent. @derek_del Just pledged to fund this home gym workout system that seems great for core and handstand work. Must. Accomplish. Handstand. Check it out: https://t.co/PHJVzBMLGK Thanks, Jacob, for bringing attention to this show and its fierceness. Drag fans unite! Take a read and buy tix quick - Wigstock 2.HO will sell out fast! https://t.co/v6rgC7sm5f https://t.co/TDY2w5vukN After a record-breaking week of box office sales, @inandofitself just added an extra row of seats.\n \nHead to https://t.co/rvRPeCxNUj to grab your tickets while you still can. #FinalPerformanceEver81918 https://t.co/2iLonWtE0F Honored to have seen the @Basiltwist underwater puppet extravaganza Symphonie Fantastique today with the family. Unlike anything, anywhere. Gorgeous, creative, hypnotic. And entirely underwater. Only in NY, for a limited time. https://t.co/6atESsJPnv https://t.co/1enFcEbdtT Honored to have been a part of the  @GOODPlusFdn event, alongside the dashing @Davidburtka. It’s a truly great organization, nobly helmed by @JessSeinfeld. Read more about it here: https://t.co/TM9iCwhLah https://t.co/sPxOqf1zFt Love this article so so much. Super proud. @InandOfItself https://t.co/87mBrQhKqk Color me impressed, NN. Nice job! @theory11 https://t.co/Un5YJuIGc2 Hmm. There seems to be an important card missing from your picture. Manipulate it for an assist. No prank. Good luck. @theory11 https://t.co/29l6KDZ009 Nice interview, David. With you as the charming host, tomorrow’s food and festivities should be even more deliciouser! @Davidburtka https://t.co/EqfOecUQkj I love card games - and of course, card tricks! So I made these NPH Playing Cards with @theory11 - and they’re available now @Target stores! Go get ‘em! #theory11 https://t.co/LPIzKeXXl5 Playing the rebel is always fun. Especially when it’s for a @Cigna #ad to get you to an annual check-up. #GoKnowTakeControl https://t.co/S7mWpw4YgS Happy 4th of July!! https://t.co/c0goO9rpsL Fantastic Papa/Daughter date yesterday. We shopped for her brother, got our nails did, and crushed some crudo at @Eataly. This is the best age! For both of us! #scallops #urchin #grateful… https://t.co/i4AJvpvhC2 I’ve partnered with #JifPowerUps to present a solution to the age-old snack-time struggle that is SO REAL in the Burkta-Harris house: kids want delicious, parents want wholesome. Share your snack-time struggle stories with #JifPowerUps for a chance to be in an upcoming live show. https://t.co/g16ntwwujH Last minute Father’s Day gift, perhaps? @InandOfItself https://t.co/cUiNIh0ZNH I received an awesome bunch of birthday gifts from an awesome bunch of people - thanks Twitter! As I was (mostly) joking about wanting lots of presents, I want to show my appreciation with a gift of my own: a donation to the @ACLU. (Yass @chrissyteigen!) https://t.co/XAr5i3ce8x 59 years ago today, the Submarine Voyage opened at the @Disneyland Resort. Exactly 14 years later, my mother was about to launch her own lil’ Nautilus vessel into the world. #Eticket What I want for my birthday, Part Last: for anyone irked by this bit to know I’m not being serious, I do this every year, and it’s mainly just to mention things I think are cool. Happy hump day! Sincere apologies to @Racheldoesstuff for my Tony tweet. I failed to research her before pressing ‘send’, and what I thought was a funny comment in our living room must have been far from funny to read, backstage, mid show. As a performer and a parent, I should have know better. Things I want for my birthday, Part Four: a melodica. It’s a keyboard that you play by breathing into a tube on the end. Also known as a ‘blow organ’ but, umm, I’m, err, probably better off calling it a melodica. https://t.co/QCsvciaBOV What I want for my birthday, Part Three: automatons. Moving mechanical marvels, either vintage or contemporary, like this from the amazing Thomas Kuntz. Awesome.  https://t.co/LxSMcBbzPb What I want for my birthday, Part Two: a newfound resolve to meditate and focus. To calm my mind and create a space for - oh, oh! - and any new VR games for @OculusRift and/or @htcvive! VR is soooo dope, yo! What I want for my birthday, Part One: anything designed by @elonmusk, or any intel on what future technologies he’s creating. Cough, cough, 2 day shipping with @amazonprimenow, cough! Congrats to the entire @TheTonyAwards production team. It’s a beast, and you tamed is incredibly well. So many performances, so many awards. Not an easy task. Well played. @Racheldoesstuff @TheTonyAwards Indeed! Well said. Thanks for the reminder. How was backstage? @MaryColon @thealexnewell @springsteen Seriously? Miking Actors isn’t because they can’t project, it’s for creating a proper sound mix. Using a teleprompter is just not being willing to memorize your lines. The director should have said something. Oh wait. @pope_meredith11 @thealexnewell @springsteen Umm, yes he was. How was @thealexnewell not nominated for a Tony? @springsteen won, and he uses teleprompters. I don’t get the logic... #livetweetingtheTonys It’s hard to watch @TheTonyAwards. I miss it. Who is the woman in the top hat backstage at @TheTonyAwards? Gideon remarked that she says ‘like’ and ‘oh my god’ a lot. I’m confused... Holy wow, watching @carouselbway makes me love  @TheTonyAwards! My birthday is less than a week away. Still plenty of time for gifts to arrive. Address in bio. Thanks in advance. I love it/them. Any suggestions on which video game platform might be best suited for 7 year old boy/girl twins? PlayStation? Nintendo? Intellivision? What’s better for first graders? Are there new technologies? Games that aren’t super violent? Oh wow, I sound old... #help Today is my awesome husband @Davidburtka ‘s birthday! I want this day to feel special - he deserves it - so if you have a free minute send him a tweet! https://t.co/AJKpt66IID I’m contemplative, appreciative, and thankful this Memorial Day. I raise a solemn glass to all who gave their lives serving the military of the United States of America, fighting for our freedoms. #grateful Saw ‘Solo’ (@StarWars_EpIX) with the family yesterday. We enjoyed, but at times it felt tepid. Would have been 100x awesomer if @philiplord and @chrizmillr had been allowed to direct the whole thing. Just sayin’. Those dudes rule. Just saw both parts of Harry Potter and the Cursed Child on B’way (@HPPlayNYC) and...wow. It is to plays what Hamilton is to musicals. Stop what you’re doing and see this magical show. Poetic, dramatic, respectful, exciting. The cast is sublime. Must. See. #gobsmacked https://t.co/OCgz32fCC3 Who will be crowned Genius Junior Champions? Tonight is the two hour finale of our inaugural season - tune in and find out!! I’m sure their moms are extra proud tonight. I know I am. Please watch @nbcgeniusjunior starting at 7pm ET/6pm CT. It’s the smart thing to do. https://t.co/PNUKtFQKdR Can’t believe that tomorrow is my last day as Count Olaf. For over two years I’ve gotten to play in the most creative, visual, challenging, fantastical sandbox of my career. I’m super proud, and will miss it greatly. @Unfortunate https://t.co/m8WnA8zPRm From one Neil to another -  thanks so much for attending! #respect @InandOfItself https://t.co/8srFTum4Na Albuquerque, I need an assist: looking for a trainer/PT/nutritionist/life coach to champion my amazing 70+ year old mother. Please send any legit recommendations to HealthySheilaABQ@gmail.com. Thanks, I really appreciate it. Thank you SO much for coming, @RuPaul! To the show, I mean! @InandOfItself @derek_del #werk https://t.co/vGjbHhnJ2E Love! https://t.co/DwqerUfDEk This is all I want for my birthday. https://t.co/7hu0tRVIHp Congratulations to @derek_del for this recognition of his astonishing work in @InandOfItself. So proud. Just, so so proud. If you haven’t seen this show yet, you’re really missing out. https://t.co/vz2FKjUeB5 I’m proud to support @RED in the fight to #endAIDS with the new @RED iPhone 8. Every purchase fights AIDS. Get yours now! #secretselfie https://t.co/qtJKwo1Ljl Coooooool..! https://t.co/QcNasMI0jh Huzzah! The @PeabodyAwards have exquisite, albeit unfortunate, taste. Bravo to @netflix and @Unfortunate  https://t.co/zbVz0QMeK0 Sad about Barbara Bush’s passing. She lived quite a life - relocated her family 27 times, thrived in multiple presidential bubbles, accomplished lots as a First Lady, fought for global literacy - and showed humor and class through it all. May she rest in peace. RT @AdCouncil: As we see our fellow Americans getting fired, evicted &amp; denied services simply for being gay or transgender, we’re reminding… Stunned by the passing of Harry Anderson, one of my comedy and magic inspirations growing up. We became friendly over the years - he worked at the @MagicCastle_AMA and recently sold me a handful of great magic memorabilia. My sincere condolences to his family. #RIP https://t.co/k9FITPIaBS Don’t forget to watch @NBCGeniusJunior tonight. The six kids we showcase forget verrrry little. You’ll see what I mean. 9pm/8pm central. https://t.co/dV8EFvRZph When I grow up, I wanna be @Pink in concert. She is a gorgeous, fearless, vocal powerhouse dancing acrobat super hero and I want to run away and join her circus. https://t.co/gIId0kyY5t Just one example of the uncanny braininess these kids showcase on Sunday’s @NBCGeniusJunior. Watch and be gobsmacked and/or inspired..! #geniusjunior https://t.co/Vske53AwD8 Check out this nice article from @ParadeMagazine about both @NBCGeniusJunior and A Series of @Unfortunate Events. And if you respond to it, then, well, watch both. Or either. But both. https://t.co/GjasA0Bkj6 Vancouver: #GlobalCitizenLive is coming to @commodorevcr on April 12 with @samrobertsband, @TheElwins, @horsepowar &amp; @crownlandsmusic. You can sign up here for FREE tickets and take action on climate change and women’s and girls’ health at the event! https://t.co/tL7HbCSvAP https://t.co/dssLuHYcg3 Yesterday In and Of Itself had its 400th performance. Well done, @derek_del. You’re crushing it. #awesome @InandOfItself https://t.co/OZOM2lAeXm I’m terribly saddened by the news that Steven Bochco passed away yesterday. He was a true game changer in television. His work ethic shaped mine, his words of wisdom stick with me to this day. I’m so proud of Doogie Howser, mostly for being a Bochco show. #quality #mentor #RIP RT @InandOfItself: Did you see the elephant on stage?\n\nRT = Yes\nLike = No This is so awesome, and only 1% as rewarding as @GBerlanti must feel from the response of his amazing, uplifting, heartfelt film @lovesimonmovie https://t.co/CAfiH2rBpR Best. Tweet. Ever. @NBCGeniusJunior https://t.co/huL0wHkVoX Well said. And....agreed. https://t.co/fnGY187E17 I am overwhelmed with pride and so inspired by the hundreds of thousands of people who are marching to end gun violence. And it’s all spearheaded by a younger, smarter generation. So awesome. #MarchForOurLives A nice review of Genius Junior in the New Yorker. Check it out, or even better, watch the show on Sunday! https://t.co/vFUgqv0jiF @StephenAtHome As the night ends on this Vernal Equinox, I regret but one thing - I didn’t get to the gym to work out. @Equinox Smile, indeed. And laugh and swoon and reflect and get inspired. Thank you, Bill, for not only being a part of Muppet Guys Talking, but for your ENORMOUS contribution to the art. Everyone who appreciates the Muppets should, nay, must watch this: https://t.co/B9ooHOVOCe https://t.co/P5YJAgzgU6 I’m beaming with pride and happiness today in hearing how many people watched Genius Junior last night. Thanks! I’m protective of these kids and want everyone to see them and their inspiring awesomeness. If you missed last week, tune in this Sunday! #worthit  @NBCGeniusJunior Yay! Thanks for watching! Next week @NBCGeniusJunior has new teams, new questions - hopefully you’ll get one or two right. 😏 https://t.co/YNlaPAs3dT Thanks, bud! Hope you dig it! https://t.co/mgdlmFWxXb One of the questions in The Cortex, the final stage in Genius Junior, premiering tonight. Difficult, yes? Not so hard for these 8-12 year olds. They’re amazing to watch. Please do so at 9/8 central on @nbc @NBCGeniusJunior https://t.co/RRJrGMk1gn Prepare to be amazed and inspired by these exceptional kids! They’re crazy impressive! #GeniusJunior premieres TOMORROW at 9/8c on @nbc. https://t.co/9Twg4sWVWn Two more days till the premiere of @NBCGeniusJunior on @nbc! Very proud of this show, please do tune in and celebrate the next generation of intellect. https://t.co/d8tegCsIZV Only 3 days until @NBCGeniusJunior premieres, Sunday 9/8c on @nbc, and we introduce you to the brightest kids in America. The countdown has begun! And let me tell you, these kids do so much more than count... #GeniusJunior https://t.co/9lCuZyq6O9 I'm doing an AMA on @reddit tomorrow, Thursday March 15th, at 1:30pm ET/ 10:30am PT. It’s my first one, so be gentle. Start slow. Then once I’m used to it, ask away. It’s sure to be great good times..! I couldn’t agree more, @derek_del. What you do during @InandOfItself is nothing short of breathtaking. Those who haven’t yet seen it, simply must. https://t.co/0Nw0bElEpJ Awful to see you again. Season 2 of A Series of Unfortunate Events arrives March 30th. 👁\n@unfortunate #ASOUE https://t.co/Ds18cyeJba Yay! YAAAY! Best tweet ever. So happy to help! https://t.co/2aULPf7efm Good gosh, I’m impressed with @jimmykimmel. I’m a guest on his show tonight and he’s just a class act, through and through. Even when interviewing the Bachelor and his (current) betrothed. #goodtimes I thought @jimmykimmel was an excellent Oscar host last night. He’s classy, clever, and makes it all look so easy (which it most decidedly isn’t). The fact that he’s one of the nicer people you’ll ever meet is just gravy. And who doesn’t love gravy? #bravo Thanks, Mr. Taylor. Love that teachers are reading @TheMagicMisfits to their students. Such taste..! https://t.co/UdITBLBcfK Absotively! Dude, your podcast brightens my day and splits my sides. Keep up the stellar work!    @ComedyBangBang https://t.co/FEQcNYS4hQ Thanks to the guy who helped me break out the @bublywater yesterday…your invite to my party still stands. Ish. https://t.co/hTizvehpI1 Well said. Literally. \n\n@InandOfItself https://t.co/T52ilGDzsp I’m inspired by young people following their passions and beyond grateful to be a part of #Doodle4Google as a judge. So, show me what you got, K-12 artists! Find out how to enter here: https://t.co/9FjiP71rOu https://t.co/SUrufyUneE Thanks for coming, @BillyCrystal! It’s a truly special show. Awesome that you got to see @InandOfItself before it, well, disappears. @derek_del https://t.co/M1svNdx61y Kickstarter: I just pledged for this cool version of Gin Rummy, but with a twist! Who doesn’t love a good card game? https://t.co/b8amLaSqBo So proud of @derek_del and this outstanding show. If you haven’t secured your tickets to @InandOfItself, you’d best do so quick, like. https://t.co/YQ12NeaEx8 Wow! My book @TheMagicMisfits is ten weeks on the @nytimes bestseller list! Thanks to those who bought it, and for those who haven’t: what the what?!? https://t.co/bynHWajJ1c RT @petersagal: In which the makers of #theheroexperience rip off the most creative and original person I know because I guess thinking up… I keep hearing stories from kids who read my book @TheMagicMisfits in their classrooms in school! Can’t tell you how happy and proud this makes me. So, thank you teachers! You’re even awesomer than I previously thought. #awesomer #notaword #oops #demerit https://t.co/521ihewduT Join me now as I’ll be live streaming on The IAm Neil Patrick Harris App from Vancouver on my day off from Series of Unfortunate Events. Download the app here and we can chat live: (https://t.co/izHhS580M9) A lovely article about my brilliant voice coach Liz Caplan (@LizCaplanNYC) in @playbill today. She’s awesome. I couldn’t have gotten through the rocks and rolls of Hedwig without her. https://t.co/MEq2Nf0Nr2 Hey, cool! @EW has an article about my next book - check it out: https://t.co/gH86lukkoq What’s with the annoying, angry article in today’s @nytimes about the movie Three Billboards? The author writes as if it’s terribleness is fact. Umm, it isn’t and it isn’t. I loved it. Martin McDonagh is rad. So it the cast, the story, the performances. It’s awesome. #odd Annnd, that’s a wrap. Thanks, Lip Sync Battle for helping check off another item on my ever growing, ever random #bucketlist. I had an exhausting blast and do want to thank the choreography and dance teams for working so hard and being so fierce. You inspire. @lsb https://t.co/1EFGyX0bwO Never mind. Whether you saw it or not, send me a vote text to #LSBNeil and quick! How crazy fun was that?? @lsb was a blast, (barely) channeling Michael Jackson. Vote vote vote! #LSBNeil I'm definitely bringing it tonight on @lsb! Whatever \"it\" is, it's been broughten. Vote for me throughout the night using #LSBNeil. https://t.co/Bqwlwo0bWw I’m super juiced to be performing on Lip Sync Battle Live: A Michael Jackson Celebration tonight! Not steroid juiced... Not fruit juiced... Ok, shoulda said pumped. Not breast pumped... Not bike pumped... Ok, shoulda said excited. Yeah, yeah! I’m excited! Hee heee! @LSB My book #themagicmisfits has been so well received, I wanted to let you in on one of the many secrets yet to come. So here’s a sneak peak at the cover for ‘The Magic Misfits: The Second Story’. Can you spot any clues? https://t.co/1p58P4BWnA RT @derek_del: Just saw #JohnLithgow in my audience,  completely phenomenal \n@JohnLithgow https://t.co/R7K97UJ08r “Nothing in the world is more dangerous than sincere ignorance and conscientious stupidity.” - -Martin Luther King, Jr. I like how, when you type the word ‘trump’ on your iphone, it doesn’t autocorrect and capitalize the ‘T’. I’m okay with that. The Magic Misfits continues to perform! SEVEN WEEKS ON THE NY TIMES BESTSELLERS LIST! I’m crazy proud of this book. If you haven’t, get your copy today! https://t.co/Y9IpcQfnrU The future is nigh. I took a self-driving @lyft ride at CES in Vegas from one hotel to another. Driverless cars..! Mind blown..! Thanks for the free ride @lyft and @aptiv! #RideIntoTheFuture https://t.co/8Q5LKDo2wM Much appreciation to @TOMFORD for the glam Golden Globes garb (also, grooming god @samspector)! #grateful https://t.co/jBzsRaa46i @PFTompkins I did. Enjoy. In Vegas for the night. Want to see a show. Which is the best? Hi there, Vegas! Looking forward to #CES2018 and my chat with @codywillard at 2:00 to discuss the IAm app that he’s created. Hope to see you there! https://t.co/izHhS580M9 https://t.co/jOOJYP2e5d Oprah is everything. Golden Globes. Enjoying the drama of Barbara Streisand relinquishing her seat back to Oprah Winfrey. It was a moment. At #CES2018 on the 8th I’ll be chatting with old friend @codywillard about the company he and I have partnered on: The IAm App. Will be announcing how you can soon find The IAm Neil Patrick Harris App ( https://t.co/izHhS5pCaJ ) on millions of smart TVs. Stay ‘tuned’. Yeah I did. I love sharing a lifetime of adventures with this man. Thanks, @burtka. May 2018 be our most exciting year yet! #Patagonia https://t.co/jkV6mGw42A This holiday season @WellsFargo and my family are getting into the holiday spirit by joining the fight against hunger. Help us support this cause by volunteering at your local food bank or donating non-perishable food at any of 5,900 WF banks. Check out our #ad for more details. https://t.co/uPQoUuxkJs My view as narrator of the Candlelight Processional at #Epcot. I’m the dude at the bottom, trying to get everyone in frame. #selfie @WaltDisneyWorld https://t.co/LO9bZhvKZf Finished Night One as narrator of the #CandlelightProcessional at #Epcot. My 10th year. Still love it - the songs, the talent, the audience, the tradition. It’s a special thing, and I’m honored to helm the ship for a few nights. Come see it! This I Want for Xmas: the instrument I played in middle/high school - a French horn (brass, not blue. Sorry, Ted). I’d love to relearn how to play one again. https://t.co/vidRrzP5Qd As the holidays are approaching, I think I’ll start tweeting gifts that I find cool and/or want, and perhaps you can respond with your own suggestions. First up, a robot dog to keep me company in Vancouver: https://t.co/lxY2iG4KUC Beyond excited to guest on @ScottAukerman ‘s brilliant and hilarious podcast @ComedyBangBang. He really does talk with the most interestingest of people. #bucketlist Take a listen: https://t.co/1jEc8xWFvy Arrived into Chicago. Excited to gab about @TheMagicMisfits, meet new people, and eat delicious food!Took this pic as we were starting our descent - I think it’s pretty decent. https://t.co/mBe8kA1nnQ RT @LittleBrownYR: Watch how I make this boredom disappear! Discover the magic of #TheMagicMisfits by @ActuallyNPH. https://t.co/KY9tDc8Mio… What’s up, Seattle? Looking forward to chatting tonight about my book #TheMagicMisfits but, more importantly: with only one night in your fair city, where should I go for dinner? What’s the best, sexiest, deliciousest restaurant? #help #foodie https://t.co/fxHXSoXnhs I’m guest hosting @JimmyKimmelLive tonight. Had a blast. Hope you get a chance to check it out. I licked a frog. Just sayin’. It seems that @Target has worked some magic of their own. A bonus chapter of #TheMagicMisfits has appeared in the Target special edition. Get a copy (or a few) today: https://t.co/e8NKzaO1oL Love is the cure! Join me in ending AIDS by sending my ❤️ to people you ❤️ via the Elton John AIDS Foundation channel on the @kwippit app. Subscribe at kwpp.me for only $.99/yr (as in 99 pennies) and 100% of proceeds go directly to @ejaforg to help end AIDS for good. https://t.co/8XQVsiqTIJ Final stop on the #TheMagicMisfits book tour will be #Chicago on December 8th with the one and only @AndersonsBkshp. For a chance to meet-and-greet me (that sounds tawdry!), get your tickets here: https://t.co/DVdRNP6urp The best gifts you can give are ones that save lives. Proud to join the @RED #SHOPATHON to fight AIDS! Here’s what I want to give—and get—this holiday season. https://t.co/I0JoFbVNRw Great news: my book @TheMagicMisfits debuted at #3 on the @nytimes Bestseller List! Huzzah! So get a copy or two quick, before they’re gone forever! (Wait, sorry, what?) Oh, I’m being told they can print more. Whew, that’s a relief. And logical. Regardless, let’s go for #1! #xmas https://t.co/wRsjFQcn7q If you’re in L.A. this Tuesday (12/5), come to my @TheMagicMisfits Q&amp;A Event. It’ll be like a Reddit AMA, but without the anonymity of your computer screen. Plus, magic tricks! Plus plus, moderator @DanielHandler! Info and tickets: https://t.co/g2mQUgyQxg Just saw @TheBandsVisit on B’way. It was divine, like a meal that seems too simple at first, but gets more delicious as you eat it, and when you’re done you can’t stop discussing your favorite ingredients and you have to tell everyone to try it. So, try it. Bravo to all involved. Wow. Just loving @kelliohara and @denisohare in The Accidental Wolf, an online thriller series that’s both free and freeaking me out. #WhoIsTAW https://t.co/zR5f6E8vIE This 9 will be a 6 until midnight: https://t.co/zdwrsMT5Fx #cybermonday @InandOfItself https://t.co/xsmyAwisA8 Wow - Amazon named my new book @TheMagicMisfits one of their Best Children’s Books of the Month! Very cool. @Amazon has excellent taste. The Magic Misfits https://t.co/rrTKdq86jo #CelebrateWithAPlate this Thanksgiving! A $20 donation to @godslovenyc funds a holiday meal for a client and their guest &gt;&gt; https://t.co/1yTp9cC47c https://t.co/TLE7aP5O6X So @USATODAY just named @TheMagicMisfits one of five new books you don’t want to miss this week! Great holllllidaaaaay gift, just saaaaayin’..! https://t.co/hUqeYrTKcy My book @TheMagicMisfits comes out TOMORROW! I’m so happy with how it turned out. Our dog Gidget can’t put it down. Well, can’t pick it up. But still. She’s already laughed twice, barked thrice, and learned two tricks. What say you? Order now on Amazon: https://t.co/CQ6RxHbIcF https://t.co/4pcJu2Ul6N Nice article in @ParadeMagazine about my book @TheMagicMisfits, out tomorrow! —&gt; Neil Patrick Harris Talks Practical Magic for Kids, Holiday Traditions and More https://t.co/iWpfO6Aqg8 Can't wait to be back with my friends in sunny L.A. on December 5th for #TheMagicMisfits book event with @lemonysnicket himself! Get your tickets at: https://t.co/g2mQUgyQxg I’d say between the ages of 7 and 97. Anyone older just might not get it. @TheMagicMisfits https://t.co/drD9pTKeuB You should come to my #NYC book event December 4th for #TheMagicMisfits - all the cool kids are doing it. And who knows? You just may win a meet-and-greet after the show! @SymphonySpace https://t.co/2csEK6tSx9 Good eye. It’s an original, actually. Got it at a Disneyana auction. #prizedpossession https://t.co/JdVQOnQI30 I just really do need to visit Australia now. They vote for love. Bravo! #progress Yahoooo! My book, The Magic Misfits, just arrived. Can’t believe it’s about to be released to the public. In less than a week! I’m a tad nervous, but very proud. I hope kids of all ages will diggit. Order a copy and tell me what you think! @TheMagicMisfits https://t.co/MGpu7j3fFY I think I’ll live stream this afternoon, babble a bit, answer some questions. Ask away. It’s on The IAm Neil Patrick Harris App. Android and iPhone: https://t.co/izHhS5pCaJ In &amp; Of Itself makes a gold brick appear on street corners at every performance. A picture of me and said brick is hiding in this interactive map. Find it, repost it and tag @inandofitself for a chance to win a playbill signed by me. https://t.co/W08tHi1Oz5 https://t.co/VOcPvEIXxO Still buzzing over Colbert’s rave for @InandOfItself and @derek_del. I’m so proud of this show and thrilled that more and more people get to enjoy it. If you haven’t, please go. You won’t regret it. Thanks @StephenAtHome! https://t.co/dtJdVcnhJr It’s the last day to bid on my sweet candy mosaic. Go to the @charitybuzz website or just click https://t.co/m7UPInv9K9 . All proceeds go to @ejaf. #DylansCandyBarSweet16 https://t.co/nbpYJa95zX @andrewtwalk The comments to your tweet are the most inspiring things I’ve read in a while. Thanks, Andrew, for bringing that to light. #progress Write On! My new book, @TheMagicMisfits, was just named an @amazon Editor’s Pick for November! Pre-order it now: https://t.co/JY9Uc4nqvn Hilarious. And terrifying. https://t.co/GVis6ASeaR Oh My Gourd! Loving this stop motion Jack-o-lantern short film. Happy Halloween Eve! https://t.co/UrKzn61Zf5 It’s almost Halloween weekend! I love this time of year! Hey, Vancouver: what are the best haunted houses or immersive events to attend? Bid on this sweet candy mosaic @Davidburtka &amp; I made for @ejaf! https://t.co/m7UPInv9K9 @charitybuzz @dylanscandybar #dylanscandybarsweet16 https://t.co/kw7K1jTHqu Can't wait for you all to meet #TheMagicMisfits. @EW revealed the official tour so see you soon... https://t.co/cyagrFIKrS @LittleBrownYR The word “stat” must only be used for important matters. Like in @Cigna's #ad to get you to your annual check-up, STAT! #GoKnowTakeControl https://t.co/j9UTJAVdy2 My #CarpoolKaraoke with @tylerperry is live now. Check it out! https://t.co/RaEPtZEDPj https://t.co/RZi0dwrvcz I just watched the #lastjedi trailer and now I just, you know, really want to be in a Star Wars movie. I feel like a kid again. So stoked. I just watched the #lastjedi trailer and now I just, you know, really want to be in a Star Wars movie. I feel like a kid again. So stoked. Happy Indigenous People’s Day. Growing up in Ruidoso and then Albuquerque, NM, I have deep respect for our First Nations. #research #history Tomorrow @tylerperry and I drive around, looking surprised at each other. Oh, and singing. And maybe doing magic. @CarpoolKaraoke https://t.co/gusxxtBFkP Happy Canadian Thanksgiving! I sure am thankful for Canada. I spend a majority of my time there lately, working, and there is a lot to love. Any fans of Double Dare (like me!) should check out Marc Summer’s new film On Your Marc! playing in select theatres. https://t.co/26b2k2DVSJ I can’t wrap my head around the atrocity in Vegas. Sending my heart and deepest regrets to the families and friends affected. #prayforvegas RT @CarpoolKaraoke: Squabble goals.\n\n@ActuallyNPH and @TylerPerry are coming to #CarpoolKaraoke on October 10, only on @AppleMusic! https:/… Only 1 day left to donate and enter! Let’s hang out on the set of @Unfortunate … The clock is running out at https://t.co/MAAAeA01Sh! https://t.co/YjDv9PCsKi Are you ready for a twitter EXCLUSIVE?! Here’s the magical new cover for the UK edition of Magic Misfits: https://t.co/vEz6Pd5M31 https://t.co/b9h5QvZy2E Just watched the season finale of @CBSBigBrother. Wow, was that jury THE biggest bunch of bitter bitches (except Cody). @DrWillKirby rules. https://t.co/hYZFKt1HZD So many natural disasters happening with such frequency... If you haven't already, please donate however you can. @RedCross @SavetheChildren I was blown away by the @AGT finale last night. Inspiring film intros, truly great performances - just an impeccably produced show. Bravo! Support @thewing + snag this t-shirt I designed + earn 750 entries to hang w/ me on the set of @Unfortunate! https://t.co/MAAAezIqtH https://t.co/FPN3FHyDuG Talk to me live on my NPH app today. iPhone- https://t.co/HeebyGbMHY &amp; Android- https://t.co/h7LdEVW6FR See u there! https://t.co/4jx9k2eiKM Happy birthday to @AsherMonroe, a great friend and talent. Listen to him chat with @eltonofficial on his podcast! https://t.co/Ld1APV4fA2 Great good luck to @StephenAtHome as he tackles the @TheEmmys tonight. Always a consummate pro, classy song &amp; dance man, and hilarious host. Haven't worn scrubs since '93. Now I'm back in 'em, helping @Cigna save 100K lives. Here's our #ad... Now #GoKnowTakeControl ! https://t.co/wnxr7m3C44 Happy National Gymnastics Day! https://t.co/tYZrHB5DBR Kickstarter Alert: I'm a massive fan of puppets, horror, and creativity. Give this well made video a look &amp; donate! https://t.co/kQnUzcrIsC Bravo to @NightmareNYC for creating a next level escape room called #ThisIsReal. Theatrical, challenging, immersive, terrifying. Loved it. The Iphone X has been unveiled. So, so awesome. It's becoming hard to craft this tweet due to all the drool on my (now archaic) screen... The Haunted Mansion has gained a valuable friend. Rest In Peace, X Atencio. https://t.co/J3JLz4Dmjs Proud to be a New Yorker. Proud of our city's resilience. #NeverForget Join me in supporting @TheWing! You'll feel good + you could win a trip to meet me...so... what are you waiting for? https://t.co/MAAAeA01Sh https://t.co/1KwVErRIX4 Happy Anniversary, David. It's so hard on Twitter to express my feelings toward you, with only 140 characters to do so. But I'll try: I lov Great cause, Markus! Hope it's a success... https://t.co/FC0KvCJzTN Recently bought the latest awesome drone from @DJI_MavicPro only to find they announced an even latester model this week. Grrrr, technology! So proud of @InandOfItself! Find out more about the show and a few my other NYC faves from my @giltcity collection. https://t.co/kIyLBspBWl https://t.co/ou8lY78xJK @GonzotheGreat @bibbymoynihan @HollywoodBowl I'm so jealous!! Bobby is hilarious and will be fantastic. Plus, with his experience working live, he's sure to not 'chicken' out. RT @common: Praying for #Houston. Please share to help our brothers and sisters in Texas impacted by #HurricaneHarvey. https://t.co/zkJRgk5… Enter for a chance to win one of ten advance reading copies of THE MAGIC MISFITS by Neil Patrick Harris (That's me!) https://t.co/sr0E1eR2eO Me + @prizeo are raising support for @TheWing! Give $10 &amp; you could WIN a trip to visit me on the @UnfortunateTV set. https://t.co/W55fnrMYyI Watching Jerry Lewis onscreen makes me laugh harder than almost anyone. His great contribution to cinema is undeniable. #RIP Absolutely loving this @derek_del video, focusing on his (brilliant) magic philosophies. Must see: https://t.co/1c5n7UFbSW @InandOfItself Podcast recommendation: Homecoming by @Gimletmedia Brilliantly acted and produced audio drama. So so good. https://t.co/kFKIU3PxRy Awesome pic taken by @davidwalliams in Nice. #grateful https://t.co/conLOTGoQv Err, win $10k by sitting on your couch and watching comedy? Yes please. https://t.co/3J9Fktt3kc Brilliant Disney Imagineer and legend Marty Sklar passed away. One of the greats. His legacy will live forever. #RIP https://t.co/0LWBdw1TzG Want to see exclusive NPH Live Streams? Starting next week on my app! iPhone- https://t.co/HeebyGbMHY and Android- https://t.co/h7LdEVW6FR Looking for a great summer album? Try my good bud @AsherMonroe's awesome new Inner Circle! https://t.co/wMjETqfUJM https://t.co/wMjETqfUJM I'm telling you, I'm telling you, I'm telling you - go see this awesome show! @InandOfItself  https://t.co/ufB7M8f6SU This week's @ThisAmerLife includes the brilliant @derek_del and @InandOfItself. Magic taken to another level. #proud https://t.co/J6AT2pDDaG Love it. I am my own app. Check out The IAm Neil Patrick Harris App for iPhone- https://t.co/HeebyGbMHY and Android- https://t.co/h7LdEVW6FR https://t.co/yrzgwnuVTM So proud of you, @Davidburtka. You've put so much passion and heart into this book. Well done! Err, medium rare! https://t.co/eGR4Gs8NDP Curse you, @TheEmmys, and all that you stand for! Vengeance...will...be...MINE!!  Um, possible to still get a ticket to the Governor's Ball? https://t.co/iRjvEc3UKI How cool is this: @SFMOMA has created a texting service that sends your phone art based on a sent emoji or phrase: https://t.co/C5dTAxmLBh Utterly ignorant and classless, Mr. Woods. I'm friends with this family. You know not of what you speak, and should be ashamed of yourself. https://t.co/ZrbtZH49sp So so worth it. @themysteriousco https://t.co/YLHqUW1tAw Just, wow: https://t.co/hyNqJ03B9m You exemplify a great parent. Happy Birthday, Dad. I love you so much. https://t.co/du96an0nGP Happy NY Pride!! I'm so proud to live in such an inclusive, accepting city. Have fun, stand tall, help others and make smart choices!🌈🕺🏼❤️ https://t.co/gc86biCrpN I believe that love is magic. Join me this Pride Month and get my exclusive shirt that supports the amazing @EJAF. https://t.co/HU2uS0b2AX https://t.co/EtiRTFZWWO Happy Fathers' Day from Daddy, Harper, Gideon and Papa. Being a parent is the single most… https://t.co/uf2h4idqjh Thanks for the birthday wishes, all. And for those yet to find gifts, time is running out. Are those @amazon drones still workin'? This is fantastic! Thanks so much, @KermitTheFrog! You're an idol of mine! https://t.co/StfrRuH3Xs So sweeeeet! Thanks, @TheEllenShow! https://t.co/a1RNcTUJBN TIWFMB (last one (probably not)): Harry Houdini's Historic House in Harlem. #alliteration #magic https://t.co/WJDD4plmN5 Today's my birthday! Yippee! All I ask is this: please, please no presents. Your twitterness is gift enough. #ish TIWFMB: for everyone to buy tickets to the amazing @InandOfItself, playing at the Daryl Roth Theatre. #shamelessplug https://t.co/rvRPeCxNUj TIWFMB: a small, new TV for the guest room. https://t.co/01t1VDbUkh TIWFMB: To be friends with Elon Musk. And loose lipped Disney Imagineers. I really want to know tech secrets of the future. TIWFMB: to be fluent in French. Also, for my new nickname to be Sweet-Pants. TIWFMB: Sweet-Pants, my favorite brand of sweats. I'd order online, but the website's in French. @sweetpants1982 https://t.co/Rv3JtPRrLV RT @billyeichner: One year later. Never Forget. #Pulse https://t.co/pCfbdccoU1 Best of luck to all the nominees, performers, and host @KevinSpacey at tonight's @tonyawards2017. So much talent on one stage! #inspiring TIWFMB: Just a small thing - the original conceptual map of Disneyland, as seen here: https://t.co/Kc2Y4itWGs THIWFMB: the latest high tech 3D printer. So I can make masks, or puppets, or parts to make another 3D printer. If you're reading this, you're not watching @InandOfItself in NYC right now. It's playing for a limited time. I can't recommend it enough. Things I Want For My Birthday (heretofore TIWFMB): an air compressor/airbrush kit. For painting faces, puppets or things from a 3D printer. Happy 49th Anniversary to my parents, Ron and Sheila. Your love and commitment to each other has… https://t.co/4RaeSuKPTW Given all the political discourse today I think it important to note that my birthday is in one week. That's all. Shipping info's in my bio. I want one of these so badly! Crazy cool ingenuity with old yet modern innovation. Dig it: https://t.co/pcSu08w1Cx Given the stunning and tragic circumstances, it seems important to be kind, not cruel. Stay strong, London. Don't let random hate overwhelm. Happy Birthday, David. You're the most glorious husband/father/person I've ever had the pleasure… https://t.co/nHGpPkb8p5 On this Memorial Day, try to spend a few minutes in reflection, honoring those who lost their lives protecting our country. #heroes #respect Watching @HelloDollyBway tonight was a joy. Perfect escapist hilarity. Rare to see an audience love something so much, deservedly so. Bravo! Let's go Yankees! And if you wouldn't mind, Gideon would love to catch a foul ball. Thanks. @… https://t.co/fODC8QHmFJ Lovers of magic, vaudeville, and all things awesome: get thee to Beyond Brookledge! It's happening this weekend! https://t.co/NFggQ6UOnj 10 of you were messaged at random to be sent a prize. No message? Follow @inandofitself on Twitter and Instagram for something special... https://t.co/FCrLKVA5jf Getting excited about my Vulture Festival discussion on Sunday. What should we talk about? https://t.co/TGOeD46GQc I still can't seem to master this iPhone touchsvreen keyboard. My hamds DO look like this for work right now, bit still... #autoincorrext https://t.co/xnlp6w9txq Always happy to support anything related to sideshows:\nThe Curiosity Micro Museum and Sideshow at Pandora's Box https://t.co/3ojxSXWRnT You never know who you'll run into at @inandofitself...\nDon't miss out: https://t.co/rvRPeCxNUj https://t.co/qdwn48yhun Join me Sunday morning May 21st at the #VultureFestival for an enticing conversation. Brunch that week can wait... https://t.co/TGOeD3P5YE Take a screenshot. Get the gold card and tweet a pic to @inandofitself. U never know what will happen. #inandofitself is EXTENDED thru 9/3. https://t.co/8NSvdUJHyz Excited to announce that @InandOfItself is extending thru 9/3! More chances to bask in the glory of @derek_del. Tix: https://t.co/rvRPeCxNUj https://t.co/Mik9ug8YUu Happy birthday, @derek_del. You're currently dropping jaws on the NY stage in @InandOfItself. I'm beyond proud and so glad to know you. Happy Cinco de Mayo! I applaud the Mexican Army's victory at the Battle of Puebla in 1862 but I'm just not sure how mayonnaise got involved. I'm so impressed and enamored with Chip &amp; Joanna Gaines that I wanna move to Waco, Texas just to redo a house. @chippergaines @joannagaines What the what?!? There's no @Heineken Light distribution in Canada?? It has won awards!! I'm both shocked and offended. And now thirsty. Amazing! @InandOfItself is almost sold out! But fear not - 30$ rush tix are available at the theatre, 2hrs before showtime. Don't miss it! https://t.co/sr8WazGXzE I'm missing my family. They're the bestest. https://t.co/lhi1EELL7m The genius behind the original music of @inandofitself opens @MMothersbaugh: Myopia at @NYUGrey tonight: https://t.co/KL944dWi2g #MyopiaGrey Vancouver is a delight, especially when the sun is out. I'm settling in, loving my new digs. Big thanks to @RickOrford for the assist. Thanks for the kind words. I couldn't agree more. @InandOfItself https://t.co/Hjy6Kvw4ar (inhale) Happy April 20th! (cough) Very happy to be working in Vancouver. (exhale) I was made aware of this great event and the cause it supports. Happy to spread the word. #awareness #donate #thanks https://t.co/8nKekZOo7a It seems the vanishing gold brick from @inandofitself appeared on the @todayshow set. Where'd it end up tonight, @derek_del ? https://t.co/sYvMVFQxoO Tonight @derek_del opens his one man show @InandOfItself in NYC. An extraordinary talent and genuine great person. #proud. Pic: @murphymade https://t.co/Gf52QdAtTF I AM ________? Screenshot to find your answer. @InandOfItself opens TONIGHT! https://t.co/gBFy2jWh1l https://t.co/JlW7lEm17Q Podcast recommendation: S-Town. It's epic, intimate, crazy, mysterious, informative, tragic and downright brilliant. https://t.co/6V8i3Nw8qh Vancouver. Trump Tower. It's twisted. https://t.co/jiAzPbEOQh Loving Vancouver. It's awesome. Still trying to find the right awesome place to stay while I'm here. #help Digs4nph@gmail.com Performances to see @derek_del and the phenomenal @InandOfItself begin tonight. I'm telling you, get tickets quick, before they're gone. https://t.co/gVrWHr7KO0 Platinum tix are still available for @InandOfItself. First row, limited edition print, &amp; meet @derek_del #worthit https://t.co/Q7yPq02kf8 Check out the cover for my new book, The Magic Misfits, coming sooooon: https://t.co/vEJc8pscgj #themagicmisfits #veryexcited Love this Kickstarter: I can draw something from afar and Joto replicates it at home. A Dry Erase Never Bored! https://t.co/KlExtfCMtk RT @InandOfItself: An experience so different, it’ll blow your mindhole. #inandofitself @ActuallyNPH https://t.co/ediyZllUZl Podcast Recommendation: Rabbits. Fictional mystery involving immersive theatre, intrigue and puzzles. Addictive. https://t.co/n3JyhUBkYA The @nytimes has written a brilliant piece on @derek_del &amp; the backstory for his upcoming @InandOfItself. MUST READ: https://t.co/8JRLMXvR1O David and I just watched the Meet the Queens preview for @RuPaulsDragRace and I'm already obsessssed. YAS, queens, werk! #imissHedwig I just finished my first at home spin class with @RidePeloton. Loved it! Tough workout, great music, fetching instructors. I'm hooked. Proud to be part of @OutoftheBoxDoc, about TV’s impact on #LGBTQ history. Join me in supporting this new series: https://t.co/bibEyqK5aI We got picked up for Season 2 of A Series of Unfortunate Events. I got this to celebrate.… https://t.co/7N8ILbxl8m A Series of @Unfortunate Events has been renewed for season two. Exciting! Unless, of course, you're a Baudelaire... https://t.co/aqXwxJdZwt Saw @SundayBroadway. Thanks to Jake Gyllenhaal, @theaashford the rest of the brilliant cast and… https://t.co/NPVjqW3j3V I was proud and honored to bike with #teamLuke at the awesome @equinox @Cycle4Survival this… https://t.co/BpkEqAdd7S The reinvention of dominoes. Super cool idea on Kickstarter. 10 days left: https://t.co/gI1U6yqsBO B'way documentary, worthy of a purchase. @NYTimes named it a Top 10 Film of 2016. @BestWorstFilm is NOW on @iTunes: https://t.co/wuJ3F5utNd I feel bad for all involved: Warren, Jimmy, Marc Platt and the incredible La La Land team. That said, congrats to Moonlight. It's brilliant. Warren Beatty seems to be opening an envelope that says 'Actress in a Leading Role'. He must have been handed the wrong one somehow. Yikes. https://t.co/Rma4wp80aX What the what what?? What just happened?!? How did Emma Stone's name get in a second envelope? Weirdest. Ending. Ever. I'm loving watching @jimmykimmel host the #Oscars and make it look effortless. He's awesome. Well played! You won't regret it, Mr. Famous Handsome Builder Man. https://t.co/iu1ZbbubNC Thanks @jimmyfallon for having me on the show tonight. I'm familiar with the term 'egg on your face', but that was ridiculous. #salmonella May be late to the game, but I'm loooving @Daredevil on @Netflix! Well written/shot, amazing fight sequences and talented cast. #bingeworthy So I may be heading back to Vancouver for a while. Anyone have a sweet penthouse in Yaletown that they aren't using..? Digs4NPH@gmail.com Happy Presidents' Day, for the most part. Happy Valentine's Day! I've had a wonderfully relaxing day full of romantic surprises. #staycation #flowers #hotel #husband #view #grateful https://t.co/U8NKovZaFu Holler. https://t.co/VvDc1rEKGC I'm happy that more people get to see this impossibly amazing show. It sold out in LA. Get tickets quick, yo. https://t.co/gBFy2jWh1l #yo? https://t.co/j6ImwjCIQt I've created the account '@nphfoodporn' on Instagram. If you crave pics of deliciousness give it a follow. Last night's meal is my 1st post. I'm gagging over @ladygaga and her halftime show. She was everything. Creative and fearless and inclusive. Loved. My big brother Brian's birthday was yesterday. A better, smarter, more clever or well spoken brother ne'er exists. Love you @PrettyBlueFox23 My friend @DanielVosovicNY just launched THE KIT. A new women’s brand that is the future of designer fashion, fast! https://t.co/qPbDKZxuFk https://t.co/nNtyVM3GC3 Excellent time in London seeing @Immersivegatsby. Great cast, great direction, Great Gatsby. Recommended! @VAULTFestival @GuildOfMisrule https://t.co/di2DE1QhAp Thanks, @PasteMagazine for this @Unfortunate article. All who work/ed on the show appreciate it. https://t.co/HYcEFUXRlr Proud of all who marched and/or took action today around the world. It was inspiring and, try as others might, impossible to ignore. Where should we eat on our date? @bflay restaurant? @Mariobatali? What show should we see? @HamiltonMusical? Hurry! https://t.co/bCVIhdmYRe 'I have decided to stick with love. Hate is too great a burden to bear.' - Martin Luther King, Jr. Loving the positive response for A Series of @Unfortunate Events, especially this one from @nerdist: https://t.co/xYXxFo2aJ8 I want YOU to come for dinner &amp; a show with me in New York! It’s all to help @CocaCola &amp; @RED #endAIDS. GO: https://t.co/stFDH0cp6K https://t.co/X3AdQ9Q9LO Spending an hour with @HowardStern has been a highlight of my year. Granted, it's only 1/11. But still. Thanks @sternshow for being rad. Just found out I'm going to be interviewed on @HowardStern tomorrow morning. Very, very excited. Listen if you can, I'm allowed to curse... Broadway Riff-Off between @JKCorden and myself. All kinds of good times. @latelateshow @TheFilharmonic @Unfortunate https://t.co/6NqJtDbV91 The pleasure was all mine. Welcome! https://t.co/5uNhqSqxfU Watch me get my sing on tonight, Broadway style..! Well played, @JKCorden. @latelateshow #LateLateShow https://t.co/4pfb74bkLD Follow this madman: @whoisgreggarcia  He’s funny and giving away money and stuff. On behalf of Count Olaf I graciously accept all of these awards, but, umm, with so much range how did they forget Best Director? https://t.co/ADq87d6zNB They forgot selfless, charismatic, and brilliant. Will Count Olaf ever get the credit he deserves? https://t.co/IYe3XvGU1u Thank you @Gogo for allowing me to be online while in flight. I appreciate the bandwidth.  That said, I'm just sitting here. Any questions? Happy birthday to the late David Bowie, who would have been 70 today. He was the coolest. Makes me miss Hedwig... 8 to 800. https://t.co/F9n1FkxJk2 HA! So am I. You will LOVE it. Okay, clarification: everyone who understands social media should see @DearEvanHansen. 'Nuff said. https://t.co/OxCyEJCzr5 Wowow. If anyone between 16 &amp; 45 loves theatre, they MUST see @DearEvanHansen. Complicated, emotional, original, and oh @BenSPLATT.  Bravo! It was meant for comedy, Stacey. Happy New Year. https://t.co/evHiZsIUMq My 2017 Resolutions: 1) do less, enjoy more. 2) stand tall. 3) take time for reflection, find contentment. 4) fly private more often. A great organization, indeed. https://t.co/3ZRigW9UI6 Debbie Reynolds played my grandma once, and she was the best. Hilarious, smart, bawdy, kind, classy. Losing her and Carrie this way? So sad. So a Bed, Bath and Beyond opened up around the corner. I'm spending way too much time collecting coupons from mail &amp; newspapers. Who am I?!? Gidget is really effing cute. https://t.co/F6itLz98BO This year, I partnered with @tylenol to celebrate all families and their holiday traditions. We love books! 👫+🎅+ 📖= ❤️👍❤️ #HowWeFamily https://t.co/IiRIIxf8ds I am so impressed by everything that #themckittrickhotel presents. Go see The Strange Undoing of… https://t.co/2Pq8YRxDGr Hope you dug my digs, @voguemagazine. I certainly enjoyed your barrage of queries. Watch me answer 73 questions: https://t.co/Psrc58wPeS I was a fan of Alan Thicke since the Thicke of the Night days. A true class act. It was a great honored to be pummeled by him. #RIP https://t.co/ilfqny2OS8 Good times had by all. Well, by three. https://t.co/Qw4Z8XlG7v Sorry, Tara. I had to rush to the NY Public Library and read holiday books to kids. 'Twas quite the busy day. https://t.co/jB3VYBVlCS I did the hilarious @ALNpodcast w/@adamraycomedy &amp; @funnybrad! 'Twas a blast of super random freshness. Get it here: https://t.co/01idhWpjpF About to go onstage and present at the @CNNHeroes Awards. An unbelievably moving and inspiring night. So proud to be a part of positivity. Dinner at Red Rooster. Gideon got the ribs. They were the same size as his head. He wasn't scared. #devour @RoosterHarlem https://t.co/8WEfQQGV4E Got a surprise visit from the oh so energetic Chrysler Pacifikids who taught me a thing or two about the new #Pacifica. Thank you @Chrysler! https://t.co/Wcc3qec4ZN How lovely are thy branches! #trim https://t.co/cN01L0mVLg Thankful for @RachaelRay’s generosity, donating $10k to support @animalleague. Follow her pet food brand @nutrish for more! #SantaPaws2016 https://t.co/rTuxlFzbL6 This is either a super cool Haunted Mansion figure I recently acquired, or how I feel when I… https://t.co/byUGLzoW2V Look, it's a newerer trailer for the @Unfortunate story of a handsome actor and three selfish orphans. Coming 1/13! https://t.co/iDmoll1Kxh A very surreal reality today. It feels like I'm on some strange Netflix show. Oh, wait...… https://t.co/UhunbyzWcc On my way to Comic-com madness in 🇧🇷! #netfliccxp https://t.co/zF2MWv1V6t YOU could join me &amp; David for dinner and a B'way show in New York! It’s all to help @RED this #WorldAIDSDay. WIN: https://t.co/6VRF3qhw8M https://t.co/r43QQpD0qd There's nothing like chips/guacamole and a margarita from @cavadeltequila in the Mexico pavilion at #Epcot. A highlight of the park. #hiccup Well played, my good man. #cooties https://t.co/H0cChwAwD7 Getting in the holiday spirit at @DisneyEpcotUS narrating the #CandlelightProcessional thru Friday. 'Tis a stellar way to start the season. Musical theatre lovers: a new documentary about #sondheim &amp; #merrily is out and amazing. Support it: https://t.co/aFV4r0HuH4 @bestworstfilm I love my friends. I LOVE my family. But in some ways they all pale in comparison to the Day-After-Thanksgiving-Dinner sandwich. Egads! The screen on my camera broke! Just got it in June! @lumixusa is there some way to repair… https://t.co/VrZcwW6Vrp It's Black Friday. Support @RED with NPH Playing Cards. Every deck makes a difference in the fight to end AIDS. https://t.co/plo5tenW6j https://t.co/nQHMGi84Ck I'm thankful for twitter, for social media. For amusing and entertaining. For educating me on stuff that is occasionally accurate. Gobblex2! Ah, the joys of a new dog... This year I am thankful for @Dyson for giving me the ability to be cord-free and #CleanEverywhere. #Gidget https://t.co/E1KdnymItU Saw @greatcomet1812. Wonderful staging but there is one reason to see this show: @joshgroban. He… https://t.co/lDwmZOCh3r NPH Playing Cards. Been working on them for over a year. Legendary, premium playing cards for a… https://t.co/Kve9ZKdEGC YOU can help deliver the first AIDS FREE GENERATION. Here’s how:\nhttps://t.co/SUJEyB4S9k At long last, the long first trailer for Lemony Snicket's A Series of Unfortunate Events | Official Trailer [HD] ... https://t.co/NEbqXDHXHv A new @Unfortunate trailer drops tomorrow. In the meantime take a peek at this Very Fetching Disguise of Olaf's - the hypnotizing Shirley: https://t.co/Fe42cQxnue My @Unfortunate sneak peeks continue in anticipation of Thursday's new trailer. Revel in my rakish Reptile Room ruse - I present... Stefano: https://t.co/nsrX41K4TZ I'm giving you sneaks peeks all week counting down to the @Unfortunate trailer release on Thursday. Prepare to swoon: Here's Captain Sham. https://t.co/SNvyzb1sFW Just got back from a week long @Unfortunate press junket in London and Berlin. Good times. Soooooo... What did I miss? \"Our lives begin to end the day we become silent about things that matter. - Martin Luther King… https://t.co/kLKJ7AgWt8 L.A. immersive theatre just got deeper, darker, and better with @the_tension_exp show ASCENSION. An awesomely exhausting mind trip. Loved! https://t.co/GQ5nrqm1tn Time to meet the incredibly handsome Count Olaf in this incredibly @Unfortunate teaser. Coming to Netflix Friday the 13th of January. https://t.co/48pyrBXHZs 📽🎞Hooray for Halloween!🎞📽#Marilyn #Groucho #Chaplin #JamesDean dbelicious @ Hollywood https://t.co/eev76HpMJ8 Listen2this: I'm on @ThisAmerLife singing a song as @PRyan, written by @lopezbobby and @Lyrikris10. Thanks @iraglass https://t.co/Pu0m50ULWb Egads! It's almost Halloween! I haven't been to a single haunted house or freaky immersive experience this year. Where should I go? #TBT to last week - no work, meetings, smartphones, or responsibilities. Just family. Thanks again @clubmedofficial #clubmedpuntacana https://t.co/fP8dVyjKDu Broadway is coming out in force tonight for @HillaryClinton! Tune in tonight at 8:30pm ET for live performances! https://t.co/6hQAZfXTMh At @clubmedpuntacana we dug their partnership with @cirquedusoleil and took to the skies! #trapeze #CREACTIVE #clubmedpuntacana @clubmed https://t.co/5cHuhmSTQ0 When theatre meets foodies. Come join the fun: https://t.co/y1f22MbCLF @NYCWFF Spent the last four days at clubmedpuntacana. Sun, surf and circus training - for joy we jumped!… https://t.co/7A3kW9owcJ Check out my friends @WhateverHangOut and will_mayo_film 's award winning short film. Here's a Vimeo link: https://t.co/oRsUJOhYkl Then congrats, you have options a'plenty! #awesome #lgBt https://t.co/aBSQY9oY3q It's National Coming Out Day. If you're a chick who chooses chicks or a dude who digs dudes today's a swell day to let it be known. #allgood Bully, good man! https://t.co/2zmEXVcVOH Let's add an old-timey word into our vernacular. My pick: bamboozle. 'He opened the door for me, then took my cab! I've been bamboozled!' Final four hours to order a creepy, awesome, mysterious, literary adventure like no other. A grand and garish gift: https://t.co/lYVeDlqwuw It's @Unfortunate and coming to Netflix Jan 13. The incredibly handsome villain Count Olaf is played by yours truly. https://t.co/h5wQsPvuun I'm really more of a grammar/punctuation whore but that's just me. https://t.co/8JrJ8FEhTJ 25 years strong leads to a lifetime of strong bodies. Happy 25th Anniversary. You've never looked better. @Equinox #Equinox25 So @Davidburtka and I are being interviewed by @gzchef Monday at 7:30 in NYC if you'd rather chat and not debate: \nhttps://t.co/cxS0bAtSbw If a video is written and directed by @Joss Whedon and called 'Important', I'd say it's worth a look: https://t.co/P0TETNdKjF Thanks @awallenstein for the kind words in Variety: \"..always seem to be trying so hard onstage that they risk projectile flop sweat.\" #ouch Thanks, current cast of @HamiltonMusical for tonight's show. Our 5 year olds loved it - know most of the lyrics. What you do is profound. Thanks again for putting me up this weekend @Airbnb and @Audi. Wouldn’t have\nminded if it had been this house! https://t.co/FMdCVuoKmO Thanks for the questions everyone. And for those who didn't see it, seek out Life's A Party with @Davidburtka on @FoodNetwork. It's rad. Good question: JJ Abrams, Amy Schumer, Barack Obama, Amy Sedaris, Nick Jonas. https://t.co/Y5azaxByZP RT @ChrisMichaelW: @Davidburtka sure can cook! @ActuallyNPH is awesome. Those kids are cute. Love @KellyRipa  @FoodNetwork  #LifesAParty Haggis. https://t.co/0xu7lGEk7P I like a simple citrus vinaigrette. Flavorful but not overpowering. https://t.co/a2pi90miuN Be yourself. Judgements are theirs, not yours. https://t.co/R1RcM1r3vD Well played, good man. https://t.co/aLrB9anc7I I did! 'Twas my idea, actually. Turned out well. https://t.co/j0d6FgkOlW Only in October. https://t.co/LeZHS2xz3p 20,000. https://t.co/wvHdaduOeE Gideon is quite an amazing sous chef. Harper loves to eat as she preps. https://t.co/kCAj9WUX5t Sloppy Joes, I think..? https://t.co/3zKJVbWZAR Sharpen the knives. https://t.co/OSDCCgp7PR Umm, err, cereal? https://t.co/jHzh9n9tMI 20,000 https://t.co/efBVA2290V Green chile chicken enchiladas at the moment. Beyond. https://t.co/Qw3jwIPHlr I WANT to do this! #so proud https://t.co/GKTC1Iz7Sg Ok, fine. https://t.co/WdYVADoxFf I'm on this very episode..! https://t.co/n1KDpVgmHT I'm live tweeting during @Davidburtka's show, starting in 7 minutes on @FoodNetwork. Ask questions about him and the show and such. My baby daddy has a cooking show! Life's A Party w/ @Davidburtka -watch TODAY at 12:00pm EST/PST on the Food Network. Super proud of it/him. RT @Audi: @ActuallyNPH @Airbnb Anytime—there’s enough house and horsepower to go around. #LiveToDrive https://t.co/v7bM5foPbJ https://t.co/… For moi? Thanks for the home &amp; ride this weekend, airbnb and @Audi. What amazing award… https://t.co/RDxzbz7G3o Edward Albee passed away. Prolific playwright, Pulitzer Prize winner, friend and mentor to my husband @Davidburtka. He will be missed. #RIP Thanks for the sweet story on @Davidburtka and our family. Come back for tacos any time. Well, any Tuesday... https://t.co/R6MWuTJP2B Start your Fun Friday with me and @KellyRipa. Today we fondle my husband's meatballs &amp; I get kicked in the stomach. @LiveKelly @Davidburtka Happy to be co-hosting @LiveKelly again today with @KellyRipa. Today Colin Firth reveals his accent is fake. Or maybe promotes his new film. The Mysterious Package Company makes these incredibly cool tactile experiences. Their latest is Filigree in Shadow: https://t.co/NINq1fR59K I'm co-hosting @LiveKelly tomorrow with @KellyRipa. We're gonna talk physics with Renee Zellweger. Or just talk about her movie. Not sure. Proud to be a NYer on this day. I still remember 9/11 in such vivid detail, first dividing and then uniting. Can't forget. #NeverForget The twins' first day of kindergarten. So many feels: excited, nervous, giddy, wistful. But mostly proud. Can't wait to see who they become. Gene Wilder passed away. Wow what a lovely career. Wonka, Dr. Frankenstein, Jim the Waco Kid... Sending strength to his wife of 25 yrs. #RIP Thanks @montagebh for making our vay-cay stay in LA so enjoyable. The rooms are classy, the… https://t.co/mNKLSOS0wX Donald Trump - for Pete's sake (and I don't even know Pete), release your tax returns. Some friends are hosting a magic event at Cicada Club in downtown LA. If magic is your thing, check it out: https://t.co/ndp8UJKgz3 One of the world's best choreographers @sonyatayeh is creating a new show and needs Kickstarter help. Worth a look: https://t.co/f3zqEe4ig4 My latest obsession: Sugru. Moldable glue that you can shape into anything. It's awesome. Check it out: https://t.co/3SIhRz8fKj Albuquerqueans, help! My brother's back is out, ribs locked. Needs professional relief, stat. Suggestions? (Everyone else, sorry to bother.) Loved reading this in depth story about @HowardStern in the @nytimes. He really does give great  interview. https://t.co/HxjYx5PV0n I'm excited to announce I will co-host the 2016 #GCFestival! It should be epic! Take action to earn your tickets—https://t.co/6jULt6McW1 Last chance to see @derek_del. Must see. As one who loves watching magic, I'm deeply honored to witness his choices. https://t.co/UATBDWphCa In Toronto for the weekend, what should I do? Looking for recommendations: Theatre? Fitness? Restaurants? Massage? Museums? Lemme know. Watched the Dallas shooting live on TV from Toronto last night. Such trauma. I yearn for positivity in a seemingly endless cycle of sadness. Today is my father's 70th birthday. Ron Harris is an extraordinary father. I'm beyond lucky to… https://t.co/ydfs8eOPhk Yay! Go Amy! #attentionmustbepaid https://t.co/ui0nO0184k Wow. A light-based Zeotrope. @Colossal curates the coolest stuff: https://t.co/QKfGoGJWO3 Right? I'm on 240something. Lots of boxes. https://t.co/QV50PZXWp5 Awesome. https://t.co/9skLaEKEW0 I can't stop playing Two Dots. Just acquired the Token of Love. Happy Pride! https://t.co/rpMa41KFWJ #TwoDots https://t.co/0vsFCPHUXS LA: The most awesomest magi @derek_del has extended his 1-man-show again! Breaking records! Brilliant effects! Go! https://t.co/UATBDWGStI Happy Pride Ever'one! Open your hearts, your eyes, your minds. All is love, all is good. Stand tall. Smile. Dance. Live life large! #pride Happy Father's Day! I'm so grateful for David being an amazing person, and for his selfless and… https://t.co/4TppvlXKcD Thanks for all the amazing birthday love! You Twitterers are the awesomest..! On this day 43 years ago - June 14th, 1973 - my mom was bustin' with baby. So honored to have been part of the @TonyAwards2016 and @HamiltonMusical 's historic night. Great to be in the room where it happened... The tragedy in Orlando is just beyond sad. My deepest regrets to all those suffering. There are no words that suffice. I'm...stunned. A locked room book? I'm obsessed: Mysterious Cases contain codes, puzzles, letters, and boxes within boxes! Um, yes. https://t.co/cSihdJKKTP Happy Memorial Day. Seems a strange adjective, happy, given the gravity of the occasion. My deep condolences to those who lost a loved one. Happy Birthday, @Davidburtka. Every year spent with you seems better and more exciting than the last. May this grand adventure never end... Thanks @DrWillKirby for the awesome shoutout last night on @PriceIsRight. You have great taste in words. And game shows. Much love. I love flying home for weekends. I do. But if the ENTIRE time is spent building Star Wars LEGOS, is it worth it? Time well spent?@LEGO_Group It hides my Olafiness. Thanks for the spectacular night. #fortunate https://t.co/bHhVBhJJ4E Ooooh - It's Saturday the 14th! Be careful today: you never know what luck has in stor... Oh, wait. Scratch that. I think I'm off by a day. (Non-Tony) Attention Must Be Paid: Big @HamiltonMusical props to @OakSmash, @JasCephasJones and @Anthony_Ramos1 for their amazingness. #werk I know I’m not up for any awards... but Siri and I remain optimistic. #iPhone6s https://t.co/MAIuU1Nln5 Happy Cinco de Mayo, everyone! Celebrate with some tequila - I wouldn't know, but I hear it's delicious. Another boffo review for @derek_del and his L.A. show In &amp; Of Itself (@GeffenPlayhouse). Grab tix quick! https://t.co/Lb3FXoyQoC LAers: One of the best people I know, @derek_del, has a new live solo show. Read this review then get tickets quick: https://t.co/zUcw00jgVd As it's May, the force be with you to donate to @MakeAWish &amp; win prizes. #ForceForChange will double your donation! https://t.co/xERqlotQKN Big congrats to @Lin_Manuel and @HamiltonMusical for your 16 @TonyAwards2016 nominations - the most in history. Well deserved! #satisfied LOVE Foster Brooks! Oh man, he makes me laugh. Well worth tracking down on the Tube of You. https://t.co/5WrQFJ7e4h Too cool for school. But not really - it's just an expression. Kids: stay in school. https://t.co/SVHbV7SxyM Working with @Hellmanns+Peppers+Allspice+Coconut=unexpectedly delicious spread. Got my #Strangewich, what’s yours? https://t.co/U2vwKUwQa2 Apparently the wording in my last post wasn't approved. Please forgive the ensuing redundancy, and in appreciation expect a kids pic. Happy 4/20. (snicker, snicker...) Ooh, a Snickers..! #munch Just saw @thatsnotusfilm a funny &amp; touching film about real relationships starring my bud @mpberger. Watch it now! https://t.co/C5U6jOB6k0 YES! YES! YESSSS! Congrats to @Lin_Manuel! #Hamilton won the Pulitzer! So well deserved! https://t.co/Y502peGNlU Thanks, Ryan. Nice chatting with you all. Have a great night. https://t.co/8XlR07C3Oh Survivor. https://t.co/fZ1uXlc9LB Hooker Card Rise performed by John Gaughan at the Conference on Magic History. Stellar. https://t.co/GdD5RMba9S Done. Eleven! https://t.co/XAHPvkiqcr Bob the Drag Queen. https://t.co/JK3yYprKUI He's gotta be in the hundreds of thousands. #yeahidid #yeahhedid https://t.co/B34CBin0xO Fletch. https://t.co/uc1o9fTsic Umm, yes. Right. Well said. https://t.co/oR0opAVPCx Nothing at all. Wish more people appreciated its awesomeness, but I wasn't that involv...oh wait, yes I was. https://t.co/j8lofOnXBe In production currently. My on/offscreen disposition is getting nastier and nastier. https://t.co/qsAmrAryyE Right now? Satisfied. But I'm digging hard on @DaveedDiggs, the Lancelot of the Revolutionary Set. https://t.co/zjPJOB1yKv #umm #noKyle #notfromme https://t.co/XeoTYdrPUr Discourage. Unless it was snuff films. I hear they pay a bundle. https://t.co/NK3Xh06pE9 They're awesomepants. Love them, but their taste in pants is exquisite. https://t.co/aZsdjgLlkP I'm bored, Twitter. Let's chat. If, like me, you like apps and the earth, this is for you. #AppsforEarth raises money for @World_Wildlife. Go to: https://t.co/S2NbbnHWh2 Kudos: @SParker &amp; @ParkerICI bringing together top scientists &amp; industry partners in #immunotherapy to #beatcancer. https://t.co/xyy44d6qFI Well played, @springsteen. You represent the ideals of millions. Hopefully many will value your words and morals. https://t.co/dTBFaF9jD1 Tomorrow is my first day of shooting as Count Olaf. I'd cross my fingers but I can't trim my nails. #unfortunate https://t.co/0nwcRJ2KWk The latter. https://t.co/gnIZZNk4N4 Happy birthday, @CobieSmulders! You're the coolest, hottest, awesomest girl I've ever had the pleasure to know/kiss/marry/divorce/love. Support the amazing @DemocracyPrep Scholars. \"Work Hard. Go to College. Change the World!” https://t.co/TXYBgghQ6n https://t.co/jRw3KUJgn5 Wow. Shocked to read about the sudden death of @GarryShandling. One of the smartest and sharpest comedians ever on television. So sad. #RIP One of my very favorite people, @derek_del, has a new live show at the Geffen in LA. Directed by Frank Oz! Must see: https://t.co/Q3adNP2ag9 I was honored to recently hang with the inspiring scholars from @DemocracyPrep. An amazing group &amp; program! #Harlem https://t.co/JnGo7UR0I1 The @justforlaughs variety show gala that I hosted, #CircusAwesomeus is on @HBOCanada tonight at 9ET/8PT. Check it oot. Check out the two greatest living physical comedians Bill Irwin &amp; David Shiner in Old Hats at the @SignatureTheatr https://t.co/iLrrJ4evuk With two minutes to spare: Leprechaun https://t.co/OxJashMqhq via YouTube My 'security' cell phone camera captured what our kids are quite sure is a leprechaun. It's been an exciting day. https://t.co/GbiSHoulrU This morning the family came downstairs to find that leprechauns had trashed the place! Gah! #mischief https://t.co/l8tGYgerHt Gosh, thanks USA Today for the glowing endorsement. https://t.co/a5ZSyLolPi Honored to represent Team Luke at the @cycleforsurvival event this morning. Thx @equinox for hosting!#inspiration https://t.co/AL45rhPnrN Just saw the opening of Disaster! on Broadway. The stupidest musical ever made and I CAN'T WAIT to see it again! @DisasterMusical #hilarious I discovered my ancestry on #FindingYourRoots w/ @HenryLouisGates. Watch the finale tomorrow at 8/7c @PBS. #tbt from when I got to be a badass bitch. (Photo by @ariannephillips) #hedwig #nowig https://t.co/JnCvvxUXRW I'm doing cardio at the gym while watching @FoodNetwork and looking at this pic. Seems oxymoronic. @Equinox @gzchef https://t.co/A0s45C5Nrm Want me to record your VM and support a cool immersive theater group at the same time? Bid here! https://t.co/gJh2mCwDs5 @WoodshedNYC Heading to the South Beach Food and Wine Festival. @Davidburtka and I will judge burgers and cook steaks. Come play! https://t.co/UUq4tYM7WM Wait, witches?!? Explore my family legacy in #FindingYourRoots with @HenryLouisGates TONIGHT at 8/7c on @PBS. https://t.co/79BOmkSyhs Happy Valentine's Day! Allow the love, find the love, make the love. Not necessarily in that order. Since I've reached 3 million followers on Instagram, I though I should finally post a dick pic. https://t.co/g2Af9cSSSI Listening to Elton's new album Wonderful Crazy Night. It's fantastic. No surprise - he's a wonderful crazy man. Recommended. @eltonofficial Good stuff, @TommyHilfiger. I can't decide which...umm...outfit I like better. #TommyFall16… https://t.co/fJnZltVjE7 It really would be such poetic justice to have this building, currently spewing hate, become a haven for hope: https://t.co/lneqCrepR1 History has it's eyes on you, @jamescordon. Congrats on @TheTonyAwards! Crush it: you are not throwing away your - shot! @Lin_Manuel Super proud of all involved in @GoGrease. Infectious fun, live on a high wire - dangerous yet walkable! Bravo @AaronTveit &amp; @VanessaHudgens A minute away from Grease Live! Go Aaron! Go Vanessa! Go Tommy! Sending good vibes. Hopelessly devoted to you all! Calling all who support LGBT causes - an amazing opportunity to turn vitriolic hate into heartfelt love: https://t.co/94HH6wpw3l #donate I'm trying to figure out Snapchat. Follow me if you'd like (friend me? Snap me?), I'm StoryofNPH. Apologies for the slow learning curve. Harlem. https://t.co/ySj9nr2iiZ 'If you can't fly, run, if you can't run, walk, if you can't walk, crawl, but whatever you do you have to keep moving forward.' -M.L.K., Jr. Just saw the luminous Kate Jennings Grant and the crazy talented cast of Noises Off on B'way. Maybe the funniest play ever conceived. #seeit I'm excitedish to portray Count Olaf - its spending all day with those three horrible child actors that will be a challenge. #sneer #shudder And why hasn't my butler told me to go to sleep yet? Or made me some tea? Or given me sage advice? Or reloaded my weapons? I'm so stunned that Alan Rickman passed away. A truly brilliant actor - his performance on b'way in Private Lives was a master class. #RIP Star Wars: The Force Awakens not being nominated for a Best Picture Oscar is horse shit. I love that my inexpensive online bench purchase is worth stealing. And that I apparently have a 'butler'. I feel like Batman. #benchgate Snorkeling with my husband and kids in the Bahamas, surrounded by tropical fish, is a memory I'll remember forever. #lifeisrad Shocked and sad to hear about the passing of David Bowie. He was the definition of cool. A true pioneer, a fearless trailblazer. #RIP Super duper beyond crazypants excited to be going on a relaxing adventure trip with the family! All aboooooard! https://t.co/jHXX5LQmVV My 2016 New Years Resolutions: meditation, flexibility, handstands, and a crazy cool acting gig or three. Not necessarily in that order. Happy End of 2015! 'Twas a nonstop thrill ride for me, both in work and life. I'm beyond grateful. Can't wait to see what 2016 brings! Merry Christmas to all, and to all a good sight..! https://t.co/3rg41HCrcb The most creatively inspiring website I know? @Colossal, fo sho. Check out the Top 15 Articles on Colossal in 2015 https://t.co/PEYAF0CDsn So happy for/proud of Matt/Blue/Crow and their new family. Welcome to the neighborhood! Play date? https://t.co/ir7TDIkCc9 via YouTube Curl up w/ the family &amp; read the free holiday storybook I narrated for @target. Like the olden days but with iPads. https://t.co/XWjeD4KPLm Dudes: use my referral link to get a $5 coupon at Amazon for signing into the Amazon App the first time: https://t.co/LT1pMIAA56 #Amazon How good is @leslieodomjr in @HamiltonMusical? Exquisite looks, skills, voice, focus, confidence - just everything. Perfection. #RiseUp Took the family to @HamiltonMusical (2nd time for me). It's brilliance of another level. Makes me yearn to be that good. Thanks @Lin_Manuel! Thanks @RachaelRay for donating $10K to the great organization @AnimalLeague. Hope you'll all join #SantaPaws2015 &amp; support their work, too! Love me some Sammy J and Randy. They're hilarious. Good get, @SeesoTV! https://t.co/OJWcgnSMpm Extended family coming into town for the holidays. What NYC events should we attend? @RadioCity? Nutcracker? Something new? So @BestTimeEver happened. Super grueling yet exuberant fun. I'm proud of what we did - live! - and still believe in variety. Stay tuned. Hey, Canadianites: my buddy @ChefAntonioPark returns to season 3 of @ChoppedCanada tonight at 9PM ET/PT on \n@FoodNetworkCA\nDon't miss it! Now THAT’S evil: if #BringBackMST3K hits $5.5M tmrw @BobbyLopez might write a new duet for me &amp; @FeliciaDay. Help! https://t.co/OyBB3f7YHs Just saw @BwayColorPurple. Incredibly powerful, moving, emotional, important, inspired. Spectacular cast. Get a ticket, it's great theatre! Kudos to @SethMacFarlane for his Grammy nom. Congrats, crooner. https://t.co/SyBPyLBRu3 Had a fun time at the opening of #TargetWonderland event tonight. And not contractually obligated to say it. Cool activities, toys, staff. Thanks to @sierraboggess and the entire cast of School of Rock for last night's performance. Those kids crushed it! Well played! @SoRmusical Putting up the Xmas tree. Want/need/must have a rad train set running underneath. Any suggestions on type/brand/etc? https://t.co/Nzt3SU7bN4 Illuminations at the World Showcase in #EPCOT. This theme park rules. https://t.co/Vge9EyFTNI My book makes a great holiday gift, plus it's paperback now, so it fits in a stocking. Boom. https://t.co/rTh84YJS4J https://t.co/GLdpbXulGS I gotsta do a show now. Nice chatting at you all. #EPCOT How debonair..! https://t.co/idT5bj5ffv Hamilton, the musical. #iamnotthrowinawaymy-shot https://t.co/8pz2NTGbbP Yes. https://t.co/4o60Qh5ryi Big Hero 6 - robots, inventions, Baymax. https://t.co/TkTu43Qjks It comes and goes, your handle. Sometimes it's amazing, sometimes just really good. https://t.co/dvtTd9PzKj Disneytacular magicalicious familytasmic. https://t.co/lVuvv69hmC I can only image that he'll, umm, rock. https://t.co/4VwkeaMpgT Yes: Drizella. https://t.co/AAIXkCl9MS I, err, umm, not just yet... https://t.co/DLs6dqJgUN Oh, eff yeah..! https://t.co/Wgm0hIXuzN \"What have you done..? WHAT HAVE YOU DONE?!? NOOOO!!\" https://t.co/v7uptWT5Dp Never gonna happen. https://t.co/gdW4ulugwC What a coincidence - mine is in the middle of June! https://t.co/QipzH1tTIa Excellent, hilarious follow through. A+, brother. https://t.co/d7lI3zr5YT Totally, but only if neither of us have to go full frontal. #GoneGirlGoods https://t.co/jezaVa7MHW I almost tazed you. https://t.co/V2J0PxuDOI My plezsh. https://t.co/bcaSyxUCAU Nice pic! Enjoy the show! https://t.co/YFToc7h2O7 Today is #WorldAIDSDay. It's important to stay educated and informed. Follow Elton's @ejaf and/or read this article: https://t.co/K6x3QBYBzL I'm honor of #GivingTuesday, here are ten charities I support (via the List App). You should, too. Take a look: https://t.co/De4sJ8vWsF Just finished my first Candlelight Processional show at #EPCOT. A great way to get immersed in the holiday spirit. I'm narrating thru 12/3. LIVE on #Periscope https://t.co/XICmQVZ41B LIVE on #Periscope https://t.co/J3O2ZR98c9 LIVE on #Periscope https://t.co/lBhnZ4ukIw Such a delicious turkey dinner! Thank you dbelicious and #chefcharlesnyc for the marvelous meal!… https://t.co/k0ksELx59t Happy Thanksgiving everyone! I'm so thankful for food, family, friends, and @Davidburtka. Loving today (and turkey)! https://t.co/GvfRy8V3Ox Took David to dinner at @gatonyc1. @Bflay is a genius. Delicious food, amazing space, a wonderful night. #respect https://t.co/qqU1IoUCtf This I Love (Holiday Edition) is coming soon. To remind: nothing sponsored, no agenda. Just stuff I dig, and want in my stocking. #presents Starting to think that the editors for new Apple product videos have subliminal magic Jedi powers. After 3 min, I'm fully iPad Pro obsessed. Indeed it is, D. If anyone wants to give donations as gifts this year, these are all worthy options. https://t.co/R5YbkR56qq I had the great honor of presenting one of the @CNNHeroes Awards tonight. So inspiring, empowering, amazing. Please watch and support. I support immersive theatre and like this idea a lot. Their fundraising ends soon, take a look: https://t.co/Q4pUzyDzPG @Billy_Bell Saw the @SignatureTheatr production of Incident at Vichy with the amazing @TheJimmyCarp. Great friend. So proud. https://t.co/zy5A2w3COK Woefully late in expressing my thoughts and prayers to all those affected by the bombings in Paris. #trulyterrible Wanted to pass along my personal thanks to @alfreddunhill for the dunhill Bespoke suits I was honored… https://t.co/xucfgi7V5o My canine friend Bullseye @target can’t read, so he asked me to narrate a holiday storybook for you and your family: https://t.co/XWjeD4KPLm Last day of @BestTimeEver season 1. Almost missed my @TODAYshow spot, still learning EOTSS song, so much left to do. https://t.co/qIiH88ymQN A long time ago in a Halloween far, far away.... https://t.co/cnXbcPRfFb I don’t care who you are or where you’re from... Get ready for @backstreetboys on @BestTimeEver Tuesday at 8/7c! https://t.co/DUoXKLgVMy I don’t care who you are or where you’re from... Get ready for @backstreetboys on @BestTimeEver Tuesday at 8/7c! https://t.co/Oi2oLzeSXw So glad you had fun, mom. @BestTimeEver enjoyed watching you be wowed! Love you! #bestmomever https://t.co/tvi89ep5Um Agreed. https://t.co/toc6VE8sJ5 It’s crunch time. Little NPH and I go head-to-head with @nicolescherzy and Little Nicole on tonight’s @BestTimeEver! https://t.co/ryr4WjD4bR Sorry for my lack of tweeting. I'm busting my hump with @BestTimeEver, and if I only mention that, I seem a shill. That said, please watch! My favorite Elton John song: Your Song. He sang it at our wedding. #AlwaysElton @eltonofficial Chris Rock is hosting the #Oscars. Brilliant choice. He'll be awesome. I'm in @JesseTyler's head and both of us are in this sneak peek of tonight's #BestTimeEver: https://t.co/iPWG9XlbTJ I love this season. Go see the Hudson Valley Jack-o-lantern Blaze. 7,000 pumpkins! @hhvalley #pumpkinblaze http://t.co/z6SbPUsfws It was an absolute honor. What a wonderful, deserving organization. https://t.co/L4ifOVuKI7 Ate the most delicious sushi tonight at the @NYCWFF, carved by @chef_morimoto himself. Amaaaaaazing! http://t.co/9HizT5FRzL Oh, how I want you to watch @BestTimeEver tomorrow at its new time: 8:00. Jack Black, B-52s and the wildest End of the Show Show yet..! I am loving Halloween season! Those in the know: what are the best haunted attractions in or near NYC? I wanna get spookt! Hey, @BestTimeEver is moving to 8/7 central on Tuesday! This will be the first of many reminders. Please schedule your week accordingly. One hour away from going LIVE! Just finished the dress rehearsal - it was messy. In the good way. You'll see what I mean. #BestTimeEver A vid of my first day rehearsing for the big Blue Man Group performance at the end of tonight's #BestTimeEver show: http://t.co/I88V0zSIdl 'Cuz I was born in Albuquerque. Love Ruidoso (go Braves!) but not where I was dropped down.  https://t.co/Lu25lupEyz It's pouring rain here in NYC. Normally when things are wet I'm far more excited. Next week’s #BestTimeEver is going to be HUGE! Especially with @Shaq as the Guest Announcer. Better start practicing my hook shot... Segment producer hiding in another room. Performer starts, they come out, hand singer a mic and wait off camera. https://t.co/7aQ1ATh2O0 Congrats! You're a natural born CeeLo singer! Well played. https://t.co/pLMY1ekmZq More good times to come. Thanks for being part of the team! https://t.co/KMXE5UmYrQ Sorry, and thanks. More fun to come... https://t.co/bhPZ6CieS2 Thanks for playing, @CeeLoGreen . You were, as expected, amazing. https://t.co/xrBYntNHuY I'm all tweeted out! Thanks so much everybody. I appreciate all of the nice comments and sentiments. Also, love that no one went over 140 ch It’s on! Signing Tweets for the next 90mins w/ @XFINITY! Get em in! And follow along here: http://t.co/JbnGjZCtWd http://t.co/kviuwYwPaL I'm signing your tweets LIVE this Thursday at 2:30PM EST! Tweet me a message with #SignMyTweet to @XFINITY now! http://t.co/jQ4ZJL08Dg My bud @MatFrancoMagic has a special airing tonight on NBC, with a cameo by yours truly. Check it out - magic is cool. What better way to start the day then with the King of all Media, @HowardStern. Best interviewer around. #bababooey http://t.co/DUMjBqFhYH Had two surprise guest come and visit. Greatest nerve-calming remedy in existence. @BestTimeEver http://t.co/SXwa0hwMRB Pick a number, any number. You may Get Lucky tomorrow night..! @BestTimeEver http://t.co/3yumLffTVh Read thru of the @BestTimeEver script. Fine tuning. Trying not to panic. http://t.co/MQYcsqpvGz My point of view as I taped an @AHLive interview. A good time. http://t.co/Zc2EKTo7ks Me, @WendyWilliams, and an errant woman's shoe. http://t.co/4NFO7sopzO During the commercial break with @KellyRipa as she freestyle laps. http://t.co/f8saYG2gSM During the commercial break with @michaelstrahan as he freestyle raps. http://t.co/d5ayrPKMNX About to go on for my interview for @KellyandMichael. Nervous! http://t.co/rp9uLmHepx Met @DrPhil. He called me out on some stuff. Made me cry. I'm a better person now. No he didn't. No I'm not. http://t.co/caFM4XYQMJ Waiting for our segments, I ran into one of the nicest, easiest people to talk to ever: @mindykaling http://t.co/hFMnzE8thM Such a sweet dog, this Wrangler. Tastes like chicken. @WranglerTODAY http://t.co/9nfbycaoIR Gonna document my longish day, this day before the @BestTimeEver premiere. First stop: @TODAYshow w/ dashing Matt. http://t.co/D6ZCZY6DWk Today is the final performance of @HedwigOnBway. To everyone who saw the show, thanks. To everyone who helped create it, lift up your hands! Just had one of the better times ever filming the awesome @LateNightSeth Meyers' show. Do watch tonight - it's award worthy. One year ago today I had the pleasure of marrying David Burtka. I'm so happy that I did - he's a… https://t.co/7AYuv4bav3 If you’re going to be in the NY area you could be in our @BestTimeEver audience and Get Lucky.  Click here to apply:\nhttp://t.co/DC04pOTfAE My book is out in paperback 9/15: lighter, flexible &amp; with a fancy new cover! #LifeofNPH http://t.co/rTh84YJS4J http://t.co/esJZdtTd8P Thanks @josecuervo for making @zoeburkec b'day with #ReservadelaFamilia a night to remember. Wait,… https://t.co/L4LJEAjhr4 The newest member of Team @BestTimeEver: the talented and titillating Nicole Scherzinger! @nicolescherzy #sidekick http://t.co/WZmZzWyvEx Just finished rehearsing part of the 1st episode's End of the Show Show for @BestTimeEver. It's hard as S and I'm sore as F. #whatamidoing? Saw @hamiltonmusical tonight. It's better than you can imagine. Inspired, inspiring, intelligent,… https://t.co/ALxuybTkna Just attended @sleepnomorenyc. New cast, still a remarkable experience. It's truly must see. Can't recommend it enough... Work. @ Provincetown Harbor https://t.co/OjDJt8dota Saw @TayeDiggs tonight in the truly wonderful production of @HedwigOnBway. Sad that the show is closing soon. If you've yet to see it, do. Check out the new promo for @BestTimeEver! It's hilariousish. http://t.co/Q6Ifgt4yty I wholeheartedly concur with the sentiment on Gideon's shirt. #proud #Provincetown https://t.co/gyMK5zAIQ0 The Storybook Land Canal Boats through the eyes of our four year old daughter Harper. #disneyland https://t.co/0pXVhyEslJ Took my first tour of the @BestTimeEver studios. Very very excited for the fun to commence! http://t.co/ez6yKtZWyR Hey thanks! Glad you liked it. I look way younger when projected on a screen of mist... https://t.co/tghPUyzbdn 'Tis true. https://t.co/iU1O99101z Indeed I do/he does. #yup https://t.co/8oI9evmh0B I've become more than a little obsessed with Zach King (@FinalCutKing) and his Vine videos. Super magic fantastic: http://t.co/nY6BEitVFs I love supporting both immersive theatre and Kickstarter. Check out The Grand Paradise and help make it happen! http://t.co/iX28JkmZDz RT @Deb_Clink: @ActuallyNPH Why oh why don't you and @Davidburtka have a cooking show?!?  @FoodNetwork LOVING the Watch of Apple. Whenever I interact with it, I feel like I'm a secret agent or a super… https://t.co/PECqpkdFx6 The awesome @fakedansavage podcast discussed the case of Zachery Anderson. You should read and sign this petition: http://t.co/ZWhDEHo9Cu RT @Just_For_Laughs: Listen to @funnybrad tell you why you don’t want to miss @ActuallyNPH’s Circus Awesomeus... http://t.co/4XPdhMnSol htt… Step Right Up: I'm hosting 4 rad shows in Montreal's @Just_For_Laughs festival on mon &amp; tues: http://t.co/r0kopRHeLc http://t.co/vLZ3lAB5Ro Loving spending time with the family in the Hamptons. Apparently Harper thinks she can fly. https://t.co/e7uPiqXXxB .@BilldeBlasio: 25K new residents use @Uber_NYC each week. How is a fixed # of cars supposed to serve this demand for rides? #UberMovesNYC Any time you can see my good chum @derek_del perform, you should. Magic + intellect = awesome. http://t.co/8bOiCh9xMt Wowza! As one of my b'day gifts, @Davidburtka got me grilling lessons w/ @BFlay: an amazingly gracious host/chef. http://t.co/HDOMjEJk8C Tomorrow is the next #EQXgoldrush challenge. Win the best membership ever with just a golden shovel! Can you DIG it? http://t.co/NekMIMg9Ui RT @Just_For_Laughs: 1 week until... @ActuallyNPH's Circus Awesomeus LIVE in Montreal! \n#AnythingCanHappen #JFLMTL http://t.co/WrcopNpbPL h… Huzzah! https://t.co/BABeRU1OCW I just competed in the @Equinox #EQXgoldrush challenge in Montauk. Swam 300m, then dove 20 ft for treasure. Didn't win but loved! What next? Harper prepping her audition for Steve Wynn's Le Reve. https://t.co/t9hQnxBUw3 Gideon prepping his audition for @cirque 's 'O'. https://t.co/rAK9PvOHPG Thank you pepsi for sharing world emoji day with me. Who knew that was an actual thing? #PepsiMoji https://t.co/cXiDa5rBwR Apparently today is World Emoji Day. Winky smiley tongue out happy face! Man, oh, man! @Equinox has a new Gold Membership. Can't be bought, it must be found - athletic, treasure hunt style! http://t.co/Dh29J6CFSe .@Amazon and I created a new holiday for my (belated) birthday. You’re welcome. http://t.co/xnYQ0Igx1T #HappyPrimeDay #helpfulharris Very excited for tonight's @nbcagt where I get to be @HowardStern 's special guest judge. NPH+AGT=AOK! Or, I suppose 'T-PHANG'. Both work. Super stoked to be the guest judge on @nbcagt this week! Here's a sneak peek: http://t.co/pLKcqM7u4e Amazing: this artist carves sculptures into the lead tips of pencils. To that I say, 'Write On!' http://t.co/s2BxTePpHX (via @Colossal) When I first came to L.A. and started auditioning, Amanda Peterson gave me advice, tips, friendship. She just passed away at age 43. #RIP I think I've decided that I finally want a third child: http://t.co/B7GybBume1 (via @uncrate) Lorraine Loots brilliantly paints tiny paintings, and has an exhibition in NY starting 7/8. I own two. Witness: http://t.co/7NIJ2ljm18 Thank you oreo for sending me new Oreo Thins and sponsoring this evening's treat. #oreothins #delicious https://t.co/bb0RzBgjo2 What a night..! http://t.co/bWQjGxBjwm I hope your 4th of July festivities are an absolute blast! But, in the good way. Not like this: http://t.co/686mpkMkcd Happy 4th of July! I'm so proud of/grateful for everyone who protected/protects us and all of our freedoms. #HomeOfTheBrave While you’re out enjoying the 4th of July water on your boat, surf board or sprinkler don't forget our waterways: http://t.co/JxziIZ8KaM Bravo @TheEllenShow for the launch of ED by Ellen (clothing, accessories, home goods). She's so classy. Check it out: http://t.co/CViUQ9Fb27 Anxious to see how unsuspecting audience members react on @BestTimeEver as we reveal our surprises. Nominate someone: http://t.co/ZLSjzpu7Xs A wonderful, albeit quiet week with friends for @Davidburtka 's bday gift. Amazing boat and crew! #allyachtsworldwide http://t.co/0iNasJLWCZ I'll be there, for four nights I think! Early December... https://t.co/y618fcJqh9 I'm looking forward to it. I think I've represented well. https://t.co/08x6IPfB09 It's a new day. Thank you Supreme Court. Thank you Justice Kennedy. Your opinion is profound, in more ways than you may know. #huzzah Just saw the new @TayeDiggs photo as @HedwigOnBway. SEXXXXY! Can't wait! Happy to be finally giving @Davidburtka his birthday present. Less happy that he's on vocal rest. #stillgrateful http://t.co/bQQSpTCeid Happy Father's Day to all hard working dads everywhere - it's the job of a lifetime! My dad, Ron, is simply amazing! http://t.co/moTjTmP2Jq Checked in on @HedwigOnBway and had a wonderful time. @DarrenCriss, @Rebeccasername, and the brilliant @TitsofClay are in great form! #seeit The great @Davidburtka took me on a boat ride around the city of NYC. What a fantastic way to celebrate my birthday! http://t.co/AsTYj4jQ4W Holy macaroni! Thanks to their skill and my dumb luck, we placed 1st in our class at the @NYYC_org 's 161st regatta! http://t.co/7GR0Xs8CgD Excited for Day 2 of sailboat racing here at @NYYC_org. Missed 1st place yesterday by 11 seconds! #firsttimesailing http://t.co/LJnNytazTv My birthday is Monday, so today is your last day to get free shipping with Amazon Prime. Please plan and shop accordingly. #helpfulharris Was a part of a badass @BatmanArkham vid directed by the hilarious @TaranKillam #BeTheBatman http://t.co/cbExNqDPjr 42nd B'day ideas: collar stays. They're awesome. 42nd B'day ideas: for everyone to stop using the word 'like' incessantly in conversation. It's, like, a constant and it's, like, egregious. Don't forget to watch the most entertaining show of the year - @TheTonyAwards and support all of the amazing performers on the big Broadway! 42nd B'day ideas: an interactive mirror built from 450 rotating penguins. So, so bad. http://t.co/5FiO5xIzOH 42nd B'day ideas: awesome wifi. Come on, @VerizonFiOS. Harlem deserves it. 42nd B'day ideas: a vintage looking globe with a modern world map. My geography skills are mediocre, at best. 42nd B'day ideas: BBQ skills. I gotsta start representing, culinarily. Bobby Flay videos, maybe? 42nd B'day ideas: puppet parts. 42nd B'day ideas: a creative, intelligent mystery screenwriter looking to join forces. Father's Day: I've teamed up w/ @thetiebar &amp; curated a line of products perfect for popular papas, $ goes to charity. http://t.co/48c2G1WXlF 42nd B'day ideas: handstand lessons. Sweet Pete, I really wanna learn learn how to slowly press into a handstand. Always have. 42nd B'day ideas: Super Magician comics. Classic, old school, I'm a collector and obsessed. #mint 42nd B'day ideas: Gogo inflight wifi gift certificates. When I log in, there's a promo code to enter. Ah, how I wish I had one, or three. 42nd B'day ideas: authentic Houdini padlocks, handcuffs, correspondence. In honor of #NegroniWeek, we went to @Eataly and had a fantastic lunch. Wow, David has never looked better. http://t.co/ocMmpXmbH5 It's officially June, which means my birthday is only 15 days away. I'll start tweeting my awesome random gift wish list soon. Prepare. Psst: know someone that you'd like to have the surprise of their life on my new show? Click here &amp; nominate them: http://t.co/bO1JHp260k A gigantic Happy 40th Birthday to @DavidBurtka, who looks fantastic, laughs constantly, and loves life. I'm a lucky husband! #DILF #DIF Happy Memorial Day - a day to honor the heroes of past and present. #grateful I proudly raise a pint glass of Guinness and toast the people of Ireland for voting by a sweeping majority to legalize same sex marriage! Err, #RedNoseDay is tonight, not tomorrow. Awkwarrrrrd..! So, um: Watch and donate TONIGHT at 8/7c on NBC. Nailed it. http://t.co/wZdpBtTVvc Excited to be a part of @RedNoseDayUS! Donate and watch me\ntomorrow at 8/7c on @NBC. #RedNose http://t.co/NEIYvaJ7Ud I already miss David Letterman... #legendary So impressed by the large turnout and delicious food from the local chefs here at the @HarlemEatUp event. @MarcusCooks did an awesome job! Loved LOVED watching @AmericanInParis today on B'way. Being swept up by people doing super human feats..! Now I need to take a dance class. Name Change: I'm officially NPH now on Instagram! Follow me here: http://t.co/J6UFNgwMk9 (if you're already following me, you're all good) Enjoyed a delicious steak dinner at @BenjaminSteak after David's show. Dee-licious! A great post theatre option. Very large, very macho. This night's awesome. Had a stellar dinner at @CatchNY, now heading to NBC shindig to shake many a hand. Can't wait for you to see the show. At the NBC Upfronts, as they announce their new season, including my variety show: Best Time Ever w/ Neil Patrick Harris. I hope you dig it. Happy Mother's Day. I am blessed with an absolutely fantastic mom - wonderful person, doting grandma, beautiful soul. I love her lots. 🌹 Just saw @HandtoGodBway. Maybe the craziest shit I've ever seen. In the best possible way. The entire cast deserves a hand. But just one. Come join the madness: I'm headlining a big variety show at the @Just_For_Laughs Festival in Montreal on 7/27. Tix: http://t.co/8RopsPt4gJ Mind kinda blown by the movie Ex Machina. The cinematography, commentary, coolness - loved it. @ExMachinaMovie https://t.co/foxRSdFKB4 Happy birthday to my friend in life and in magic, @derek_del. He's one of the great ones... Happy Cinco de Mayo, everyone! Hope your night is filled with celebration and drinks - a tequilabration, as it were. ¡Salud! What a night! Thanks @Zegna for the couture tuxes, courtesy of the great @samspector. @Davidburtka &amp; I felt like $1M! http://t.co/fsI1mKKCbm On my way to the fancy Met Ball with the ever handsome @DavidBurtka. Looking forward to a very James Bond evening. http://t.co/8dMvia5RuP Break a leg, @DarrenCriss. Your stint in @HedwigOnBway begins in a few short hours. Can't wait to see you rock those heels! This I Love: Bitmoji. An app that lets you create your own avatar and use it in texts. A hilarious time suck. \nhttps://t.co/C6f9VbaXJs This I Love: the acrobatic troupe of Sequence 8, the latest show from 7 Fingers (@7doigtsdelamain). Truly amazing: http://t.co/e0JjgFb6xc Spring dun sprung! #huzzah http://t.co/UiMjxjHiF8 Had a fun, busy, quick trip to Calgary in the amazing land of Canada. Awesome people, swank hotel, delicious food. Can't wait to go back. I'm just crazy proud of @Davidburtka as tonight @ShouldaBeenYou opens on B'way! Bravo! http://t.co/I1k4D4YQZ8 This I Love: http://t.co/f8b7yyCRLZ  Any future project starring @NathanFillion and @alan_tudyk will be brilliantpants. #conman #hireme Belated congrats to @LenaRockerHall for her epic year+ portrayal of Yitzhak in @HedwigOnBway. 2nd best husband ever! http://t.co/1dbEsDWh9l Happy Easter from the Burtka-Harris bunnies and one lil' chick! http://t.co/dZS8DZWxqK Even though it's raining, the warm weather of NYC makes for a very #GoodFriday. Enjoy your weekend! http://t.co/vusvtJ78Gh Eleven years ago today, I went on a date with @DavidBurtka. Now we're married, have two kids, and great good times. Happy Anniversary! I guarantee Heineken Light is the #BestTastingLight you’ve ever tasted. Err, I can't personally... I should explain.\nhttps://t.co/IKP7o4kOKd Happy One Year Anniversary, @HedwigOnBway! Glad to see the old cat still has her claws! #imissthoseheels “@7paws: @ActuallyNPH you were a puzzle on @WheelofFortune last night” Th_t'_  Aw_s_m_! This I Love: the podcast @Radiolab. It's fantastic. \"A show about curiosity\", as they put it. Intelligent, creative, witty. Do listen. I keep finding things to recommend. So, I'm starting a new thing called 'This I Love'. Not paid endorsements, just random stuff I dig. “@elsiete: @ActuallyNPH thanks in advance for helping out!” My plezsh. Hope he gets an A. “@elsiete: 1) fav animal? Dolphin 2) what do you miss about ABQ? Green chile 3) what's the 1st magic trick you learned? Nickels to dimes” :) “@elsiete: @ActuallyNPH My son chose you for his 4th grade paper \"famous people from NM\" he has a few questions for you...” Okay. Go. Watch #BreakingBorders (@travelchannel): @MVoltaggio travels the globe cooking meals for people with opposing views and films their debates. Had a stellar time last night on @itvtakeaway with the brilliant, kind and classy @antanddec. Excited to bring this show to the states! Loving London. Soaking in all of the behind the scenes producing of my new variety show, based in Ant and Dec's Saturday Night Takeaway. Congrats @Davidburtka and the entire cast &amp; creative team of @ShouldaBeenYou for a job well done at their first preview last night! #success Happy St. Patrick's Day!  Look out for leprechauns! http://t.co/wZ0aH31mNx Just realized it's Friday the 13th! All makes sen-Wait, someone's at the door. I'll let him in. Hmm. He has a hockey mask and a machet-OHNO! I picked up a face down penny, stepped on cracks in the pavement, a dog started howling and a bird flew in my window. Today be crazy! Hmm... Blurg! There's a water leak in the living room! Oh wait, here's an umbrella. I'll just open it up and use it to protect the couch. Hmm... Ug! I'm trying to eat lunch and this darned salt shaker keeps dropping onto the floor! There's salt everywhere!  Hmmm... RT @nikomcgregor: @ActuallyNPH #lookout http://t.co/mLYIUr3myd Following the kitty. Under a ladder? Okay crazy cat, if you insist! Hey, look there's a mirror. Hope it doesn't fa- oh, it shattered! Hmm... Happy 13th, everyone! What a lovely Friday. Oh look, a cute little black kitten just walked right in front of me. Hmm. What could that mean? Spectacular night with the kids. Karate class, dinner with Daddy, sneaking in to see him sing and dance at his @ShouldaBeenYou rehearsal. :) I'm loving this downtime with the kids - taking them to school, preparing meals, reading books. Lots of work but so worth it. #grateful Just saw The Audience on B'way. All hail Helen Mirren! Phenomenal! Reignited my love for the theatre. #masterclass #bravo Surreal. Just had the honor of introducing @BillClinton at an event for the amazing Clinton Foundation (@ClintonFdn). http://t.co/mP28Rx1OMm Go to @funnyordie and watch this video of me shouting at some seriously #ThomasObsessed kids! http://t.co/tnBYYjbNNR http://t.co/c6yMUyDj7I I kinda like that this winter storm is called Thor. #avengers Here's a taste of the madness you can expect from my new video out today on @funnyordie. #ThomasObsessed http://t.co/xKsm1iS5zJ Now that I'm back in NYC, I want to thank the @MontageBH for my LA digs. Such a remarkable place to stay - awesome room, great staff. #loved So first I saw the dress as white and gold, and only that. Now, it's absolutely blue and black. How?!? Does this make me bi-dress-ual? Hilarious.  An R-rated version of Scattergories!  Oh, how I love Kickstarter. http://t.co/5tmOu2DH7p #pledged My iphone shattered the morning of the Oscars. I probably should have read more into that. #harbinger It's the day of the show, y'all. #Oscars @TheAcademy Hey, I know that dude! @TheAcademy http://t.co/f3t9ooOMhM I'm super appreciative for the group of writers we hired for my #Oscars content. If only they could write everything I say always. #proud My brain hurts from all the #Oscars overthinking. It's time for the fine tuning, rewording, and 3rd guessing. So much minutiae! @TheAcademy No turning back: Dropped off my official #Oscars predictions to the two people in charge of the ballots at @pwc_llp. http://t.co/WXawVsDcbu Congrats, SNL - 40 years of classic, cool, courageous current comedy. Well played. @nbcsnl Question: what you're favorite movie that wasn't - and shouldn't have been - nominated for an #oscar? My choice: The movie Clue. So fortunate to see You Can't Take It With You today on B'way. Closes 2/22. Wish it could play forever! Absolutely loved it! @CantTakeItBway “@Obliviouswb: @ActuallyNPH From EW- CLUE?!  I LOVE that movie!  The cast, the quips, and multiple endings!” Right?!? Best. Movie. Ever. RT @Davidburtka: May this heart be with you! http://t.co/mYv5NzjG0A RT @Davidburtka: I am giving everyone a big kiss for Valentine’s Day!! http://t.co/nRz1B2OOGU “@Davidburtka: I’ll think about it okay yes!” Yes! If my Valentine's night was now up for an Oscar, it'd be for Best Original Score! Hey @Davidburtka - Will you be my Valentine? Ok, I realize you're already my husband, but a 'yes' would sure make my day/night/life. Congrats to the North Carolina Powerball winner! Way to make winning an #Oscar seem that much less impressive. @TheAcademy Rehearsals are intense for the Oscars.  And by rehearsals, I mean me singing\ninto a hairbrush in front of a mirror.  #Oscars2015 @TheAcademy Had a tremendous meal last night at @MVinkLA. Massively impressed by food is both exquisite to look at and delicious. http://t.co/YS1IckPucT Tonight, I'll be joining the hilarious @PaulGreenberg1 in the season finale of @IGIHollywood at 8:30e/p only on @AudienceDIRECTV #haunted Looking over the preparations for the #Oscars set. After last night, we've installed a second layer of Kanye-proofing, just in case. As always, unbelievable respect for the crew working backstage at the Grammys. Changing out set after set - their work is amazing. GAH! Our best of friends just had a child! Sorry Grammys, but the godfathers have to meet themselves a new baby! #goodnight Hmmm. Jamie Foxx reading braille next to Stevie Wonder. Not sure how to feel about that. Amazing. Beck and Chris Martin sure did... stand there super well. So much energy! Sam Smith is awesome. Who knew Kristen Wiig was such an amazing dancer! Wait. I think someone put something in my drink. This ain't right. #whatishappening Shia Lebouf sure knows how to read a teleprompter. Prince is so shiny..! Sam Smith is awesome. Add Mary J. Blige- just wow. \"This would be a real good tiiiiime.. to take a nap.\" Just loving the Grammys. Thanks to CBS and Jack Sussman for creating such an amazing show, year in and year out. If you get a chance, GO! Usher can sing. But did that harpist come from the Ariana Grande school of hair design? It's Ga Ga Game time! http://t.co/z8cYAQOT95 Wow. That was awesome. @katyperry as Princess Leia has never sounded better. Pharrell just can't stop wearing shorts..! Is this a Wes Anderson movie? Does he work at the Grammy Budapest Hotel? So @Davidburtka and I have agreed that if Nick Jonas responds to this tweet, our wedding vows will sort of kind of change a bit. Annie Lennox is awesome. Not only can she sing, but her bird calls worked! They are everywhere! #don'tcare #standingovation Annie Lenox makes everything better. Especially church. Adam Levine must be some sort of super hero person. Doesn't he want to have my baby? Gwen Stafani must be some sort of super hero person. Didn't she just have a baby?? I thought Beyoncé had a middle part, not a beehive. #goodtoknow Josh Duhamel is everything. Madonna is losing the Running of the Bulls. Oh wait, here comes a gospel choir. She's good. Oh, no. She's dead. She lost. Sam Smith is awesome. Who knew Miranda Lambert's set designer was her biggest fan? She's hot, but cool. Pharrell is actively disrespecting everyone on the frozen East Coast by wearing shorts in the winter. #howdareyousir Marion Cotillard is up for an Oscar AND singing on the Grammys with Tom Jones? What can't she do?!? Ariana Grande's eyelids seem really heavy. Anna Kendrick looks hot. No bra. Well played. I'm one envelope away from seeing Taylor Swift's lady parts. LL Cool J is talking. All I can hear is ringing in my ears. I think they're bleeding. #oldpersonjoke AC-DC opened then show, and now everyone is effectively deafened. And I think six people had seizures. And 50+ got 3rd degree burns. I gotsta live tweet the Grammys! Get ready: as a non-winner, I'm eleven drinks in. Aw, nerts..! We didn't win a Grammy for @HedwigOnBway. Kudos to Beautiful, but @stephentrask's music still rules my rock-ish world. Thinking of going with a solid gold tuxedo for Oscar night. Thoughts? #chafing @TheAcademy In honor of Birdman, we’re going to do the whole #Oscars broadcast in one continuous shot. Calling all foodies: Watch my bud @ChefAntonioPark's debut on Chopped Canada tonight at 9:00 p.m. ET/PT - Food Network. Oof. I am knee deep in #Oscars rehearsals. Why, oh why did I ask for a wading pool... Good on us, Lance and Michael. Represent! -- Why Lance Bass’s Big Gay Wedding Matters http://t.co/64ypKfbyFk via @kpfallon Here's a wrap up of today's #oscar nomine luncheon: http://t.co/J3u9Dl84Ln + a pic. They all look so white! #toosoon http://t.co/WtM3EFAUZZ @katyperry just crushed it at the Super Bowl! But, umm, that was my entire opening number for the #Oscars. Soooo, uhhhh... @TheAcademy Here's one more #OscarAnagram:\n\nThrob Sex Toll\n\n😁 Let the #OscarAnagram continue:\n\nValid Enema Another #OscarAnagram:\n\nWhoopee Reinserts Next:\n\nTrachea Drill Rink\n\n#OscarAnagrams Well played. Next:\n\nAnal Ruder More #Oscars Anagrams!\n(Late Night Edition)\n\nWho dis:\n\nLet Sperm Rye Prepping for the Super Bowl. This is my first attempt at a Super Plate. #nachos http://t.co/Lfb0jrTob3 Thanks, Mr. Verizon Man, for your inspired work installing the phone lines for my production office. Worth the wait! http://t.co/JBcjjKoazJ Prepping for my #Oscar night party. Anyone know a good onion dip recipe that serves 3,000? Super Bowl revelers: Do drink. Don't drive. May I suggest Uber? First ride's free (up to $20). Try it: https://t.co/TZ67uy2GSa Multitasking in my #Oscar prep: watching Best Cinematography nominees on mute, while listening to audio of the Best Sound Mixing nominees. Check out my Twitter video #Oscar exclusive! I gots me a scoop! http://t.co/SGQ3oJHDqZ Good times. Last one for tonight:\n\nThink Gayer Like\n\nSleep tight. #OscarAnagrams Movie-ing right along:\n\nOtherwise Reopens\n\n#OscarAnagrams So many Oscar contenders have oddly appropriate anagrams.  Like:\n\nA Ruled Narration Jig\n\n#OscarAnagrams Games are fun!  Next:\n\nRectal Elves\n\nYou're welcome. #OscarAnagrams You're good! How about this:\n\nReefer Envy Thigh Toothy\n\n(also the password to McConaughy's post Oscar party)\n\n#OscarAnagrams Let's do some #Oscar Anagrams! 'Cuz why not! Ready? Who's this:\n\nMr Decent Butch Cabbie\n\n#OscarAnagrams Thinking about wearing a Janet Jackson headset at the Oscars.   Just ‘cause.  #Oscars Due to the Patriots ball scandal, I’ll personally be making sure all the Oscars are fully inflated this year. #Oscars This year's #Oscars will be a little different: In addition to acceptance speeches, all non-winners must deliver concession speeches. Today we honor the legacy of Dr. Martin Luther King Jr., a remarkable humanitarian and civil rights leader. #greatness #respect Another good #Oscar read, again via Deadline: http://t.co/ml04aDrP8v Interested in a smart, insider conversation about this year's #Oscar drama? Check it: http://t.co/DkBdVmC6bU via Deadline. Had an absolutely delicious dinner with the family at St. Anselm in Brooklyn. One of the best restaurants in NYC. http://t.co/g4i96jUtnZ Tonight is the opening of brilliant artist Patrick Jacobs' new show at @PerogiGallery in Bklyn. Gideon approved! http://t.co/okDl68LQxu Last night was great: dinner at @Guarnaschelli's resto Butter, then @HedwigOnBway with the superb Michael C. Hall! http://t.co/EdAKfexYj5 My new Oscar commercial. Dig it. http://t.co/VLWYO4rUGO My #Oscars nominations thoughts: http://t.co/ZM1gylH4cu Can't wait for tomorrow, @neilmeron and @craigzadan. Let the #Oscars commence! BTW, we should probably start creating content soon... What's Chester got up his sleeve in tonight's #AmericanHorrorStory ? My guess is it's not good. And I should know, I filmed it. #Marjorie The Oscar nominations come out tomorrow morning. Damn, I really need to finish counting all these ballots..! #Oscars #procrastination RT @billboard: We spoke to @ActuallyNPH about #Hedwig's Grammy nomination and more: http://t.co/dQbN1TQn4S My stint in the American Horror Story: Freak Show begins tonight! Watch it.  I double-doll dare ya! #AHSFREAKSHOW #Marjorie Rosamund Pike was spectacular in Gone Girl. Glorious, absolutely remarkable. Oscar worthy, for certain. My boner concurrs. Attended a New Years Day Hangover party today. Everyone wore PJs, and I brought @TheIVDoctor, who rehydrated us all. Highly recommended. Happy New Year! May your 2015 be filled with health, humor and happiness. Love, the Burtka-Harris Bunch @Davidburtka http://t.co/UVehE2SStz “@nbeiter14: @ActuallyNPH I think you'd appreciate our Christmas card ! http://t.co/BX0F7KT4H0” -- Well played. Merry Christmas Eve! Hope your night is filled with love - whether it be by romance, friendship, or random circumstance. 'Tis the season! Took the family to see @Aladdin on B'way. Awesome watching Gideon be confounded by a carpet that actually flies, while Harper missed Abu. Massive congrats to Sir Elton John &amp; David Furnish - now officially married! @DavidBurtka are I are thrilled for you both! #sharethelove And if you're looking for a swank gift for your lady, check out http://t.co/tmFJVmkNBP. Exquisite clothes and one of a kind jewelry. #classy Like laughing? Watch this. Plus I guest on it in Feb. @IGIHollywood on @DIRECTV ch.239 Tonight 8:30pm. w/ @PaulGreenberg1 &amp; @DAnthonyHiggins “@jayceedoubleu: Your baby can read too with the help of @ActuallyNPH http://t.co/IdtXiNaBjJ” The book is magic! All done with my Q&amp;A. Good times. And oh oh oh man, is my book a great holiday gift idea! It has words and stuff! http://t.co/2WrsTX0swd Kay (@kmssssssssss) asks: What feels more natural to you acting, singing, writing or hosting? #AskNPH http://t.co/jZDdxVnuaK Robin Chesser (@Raechef2) asks: If you could have a cohost on The Oscars who would it be? #AskNPH http://t.co/d2fjF3MGD6 Selena Kyle (@Jamybitch) asks: please tell us something about the oscars! Any plans? #AskNPH http://t.co/S6NcHoMyIQ Samrin Hirani (@Sams_lfc) asks: what magic trick and recipe is your favourite from.your book? #AskNPH http://t.co/exkNGgwIjd .@LindsayHarper Did you find it difficult to talk about anything in your book? Did u enjoy the nostalgia? #AskNPH http://t.co/bfPIrbSJdl Vicky Evans (@yic147) asks: what are you reading at the moment? #AskNPH @kristopherjans @bjnovak http://t.co/I17weacF9T .@dcestates: what part of the book was most challenging/if you were a dog, what type of dog would you be? #AskNPH http://t.co/LPMCdKvpj9 Lauren Peterson (@Aerodiver7) asks: in the audio version why does a British guy narrate for your friends? #AskNPH http://t.co/nz8CXNFSQM @emmyxoxo84 asks: Was there anything that you didn't want to include in your book but did anyways?#AskNPH  http://t.co/MU6ugiua2Q .@rapawnish1133 : Did you ever experience writers block while writing and if so, how did you get unstuck? #AskNPH http://t.co/xYkKYyRgrM Jasmin(@Jasmin_96_) you were so busy how did you find time to write a book with Hedwig, HIMYM, Gone Girl #AskNPH http://t.co/CyCFNTh2YN Rebecca Stinson (@96Becky) asks: What’s your favorite ending in your book? #AskNPH http://t.co/rxI9ft0UXO http://t.co/Tjrt3NWfBo Joe (@JGH1211): what gave you the idea to write your autobiography as a choose your own adventure book? #AskNPH  http://t.co/nr7M7VnRsI Dani Francine (@DoctorSwarley) asks: Can your book still make me levitate even if I'm buying it late? #AskNPH http://t.co/qvMPNdKUMR Jenna N (@Jennateur) asks: Why were people posting pics of themselves levitating while reading your book? #AskNPH http://t.co/ZQFTWEfkJ5 #AskNPH Introduction - This is how I am, um, introduced. http://t.co/DndTNtOz1W About to start sending answers to your Twitter questions! Ready, set... GO! #barrage #AskNPH Dudes. I'm answering questions at a live Twitter thing on 12/15 about my book http://t.co/E7vv4IyAEr. Tweet me your queries now w/ #AskNPH May I present my Academy Award writing team! (It took four of us to craft that last sentence) #Oscars http://t.co/HiooVFDIjx Just finished filming my last scene for American Horror Story. I need to take a shower. Wash off all this horror. The @HedwigOnBway cast recording was just nominated for a Grammy! So proud! Now what happens? Bribery? Sexual favors? #WhatWouldHedwigDo? I'll be watching #PeterPanLive tonight at 8 pm on NBC. You? Can't wait to see what will happen!  Break a leg, cast. But not a wire... Support a cause near and dear to Team #HIMYM by going here and clicking on GIVING:  https://t.co/cDyEXqcn8c …  #GivingTuesday David and Gideon are digging these Disney days, too. Great waltdisneyworld memories all around..! http://t.co/GuR4EvCmkP Having a great time in waltdisneyworld hosting the Candlelight Processional at EPCOT. Harper is in… http://t.co/pIAc29pfVj Bid on my Hedwig beehive wig, all money goes to support NY Stage &amp; Film. It smells just like... the crown of my head. http://t.co/GNr6x2goQa Happy Thanksgiving! I'm super thankful for all of the blessings in my life, especially these three. http://t.co/a4gpjZOMl8 Heading home after @Davidburtka 's one man show. He crushed. So proud. If you get a chance, please  spend some time with this wonderful man. INC(RED)IBLE: These Apps Save Lives. For 2 weeks 100% proceeds go to @RED to fight AIDS. #AppsforRED Only @AppStore http://t.co/om1EOjWkEq “@CaraCompass: I'm getting a calico cat what should I call her” I'd name her Puppy. “@smichelle2121: @ActuallyNPH With more than 11 million followers how much tweets do you get to read in a day?” 83. “@DieselPitman: I found your 70's doppelgänger! http://t.co/5o3cW7lVdt” GAH! My secrets are slipping. You never saw this. A loverly review of my tome: http://t.co/xPf3jCWTua It makes a terrific stocking stuffer, assuming your stockings are stretchy. RIP, Mike Nichols. Brilliant director, lovely gentleman. Total class act. His work will live on forever. I haven't yet entered the Show of Freaks. But fair warning: I'm a'comin'..! #AHSLiveTweet #chameleons ...I was almost so sexy... R. A. Montgomery: thanks for all of the (Choose Your Own) adventures over the years. Rest in peace. \nhttp://t.co/7RgtoOvdv2 “@MackaMettey: @ActuallyNPH's new book makes me lighter than air! #nphbook #levitation http://t.co/yHJK88RLbg” Yes! http://t.co/2WrsTWIRo9 I'm solo in NOLA! Ate dinner at Cochon, unbelievably delicious. Pics of the dishes at @NPHFoodPorn, worth a look. Oh, and I'm filming AHS:FS Welcome to Broadway, Emma Stone! Can't wait to see your Sally Bowles in @Cabaret_Musical, starting tonight. Break a leg. And a heart. 48 hrs left to support a lovely cause by hanging w/ @himymcraig and @CarterBays at the inspiration for Maclaren's!  https://t.co/fRluIwleKS It's Veterans Day. Sincere thanks to all those who have served in the U.S. Armed Forces for protecting our country. I salute you. Vote for my book to be the funnierest of them all! https://t.co/2WhM7Pptuo “@CaraCompass: @ActuallyNPH Who won the #nphbook competition?” It's still in play!! Early holiday shoppers: May I suggest my autobiography? It's entertaining, educational, and easy to wrap! http://t.co/2WrsTWIRo9 #beatbox Penny made me laugh at Absinthe in Vegas, and also in this, her Kickstarter plea. Worth a look &amp; some scratch: http://t.co/KUUprLTJdF “@henrysodt: Some levitating at Costco with a great read... #nphbook #levitating http://t.co/YyWpu2KxUa” Yes! Costc-OH, I'm floating! “@samoss22: Just doing some \"light\" reading at walmart.. #nphbook #literallymagic #wow http://t.co/yMC6UoxKzE” Yes! Took the family to the @BigAppleCircus today. Had an amazing, circustacular time! #metamorphosis http://t.co/qonrD1Lt16 Know this: my variety show will absolutely be crafted by union writers. I've been assured by ITV that it will be a WGA show. Period. Watching American Horror Story: Freak Show. While everyone in the ensemble is amazing, @MrJCLynch is sublime. Wow. Bravo. #Twisty This video of the 2014 Albuquerque Balloon Fiesta makes me proud of/miss/love NM! Amazing! http://t.co/mj58cLF1kO (via @Colossal ) “@dannisiminerio: Hedwig and Yitzhak think that @ActuallyNPH's book is magical. #nphbook #levitation http://t.co/9mYRY3MVaP” Yes! No question. This year’s Halloween with @KellyRipa &amp; @MarkConsuelos &amp; @DavidBurtka was the best ever! #sothankful http://t.co/yb0EhiSUZf Happy Halloween from Gotham City!! http://t.co/3gzmG44iEf Papa, when are we putting on our costumes? We want to go trick-or-treating already!! #soon http://t.co/UbWOdxjBcz Happy Halloween! Have wicked fun tonight, but don’t drink and drive. Instead use Uber! Your first ride is free: https://t.co/TZ67uxL5K6 Happy Almost Halloween, everyone else! #harper http://t.co/s9t02okoXH Happy Almost Halloween, everyone! #gideon http://t.co/jyBELP5U54 My 2,000th tweet goes out to my handsome, high-rising husband @DavidBurtka. He’s very well read. #nphbook http://t.co/vuO2Q5dTa2 A very classy night at the gala for the Elton John AIDS Foundation ( @ejaforg). A truly important organization. http://t.co/KVad0yIRBP “@brisbanekris: @nhitong247 You have an Instagram don’t you?” Indeed I do, sorry. Just not on the Facebook. “@nhitong247: Neil, is this your only social media account? The FB that uses your name posts really annoying stuff.” No FB, just this. #fake “@laurelise23: To levitate, turn to page 107! @ActuallyNPH #nphbook http://t.co/o8Ayq6Hyae” Yes! G'night! “@Lonebinky: @ActuallyNPH's book is full of magic! #nphbook #levitate http://t.co/W4HOFiFS4I” Yes! My book tour travels are now complete!  Hope the book gives you a lift. Now back to these amazing knuckleheads. #NYC http://t.co/F1rqN6lHKw Any LA'ers looking to get scared while using their smarts should check out http://t.co/VaRoEmxK14. You have 45 minutes to escape. Or else..! Happy Birthday, @katyperry! Hope you have an amazing year. Can't wait for your Super Bowl Spectacular! “@yearoftheducky: Day 162. Challenge accepted, bro. #nphbook #yearoftheducky http://t.co/xVGZXORuI4” Well played, sir! “@PatMcCullough20: Enjoying Saturday with @Starbucks and a legen wait for it.....dary book! #nphbook http://t.co/Zh80uEVJp9”  Yes!! Even @JasonKennedy1 and @GiulianaRancic are 'moved' by my book! #nphbook #levitate http://t.co/Z8tpvkmoOR “@JBodine1122: does the originator of this automatically win something?” Umm, yeah. I gave myself an autographed picture of me. #nphbook Here's another good 'levitation' pic. Nice job, @CarlVolwerk. #nphbook http://t.co/OZpovMksj0 Take a pic of you 'levitating' while reading my book. My faves will win something random. A gift card? A regift from last xmas? #nphbook Oh my. Now @aishatyler is reading my book at @TheTalk_CBS, and levitating as well. So much magic! #nphbook http://t.co/YZbPL0EEIv When @JulieChen read my book at @TheTalk_CBS, she, too, started to levitate. It's magical. #nphbook http://t.co/RHuInRTHG5 Visit @BNEvents_Grove at @TheGroveLA tonight at 7 for my LA book signing! Let's have a nice moment together. #smellnice “@seeshaughnessy: Just levitating over my bed while choosing my own @ActuallyNPH adventure! #nphbook http://t.co/qtMcarWMA6” YES! LOVE! “@Lonebinky: Oh you know just floating around while reading @ActuallyNPH's new book #nphbook http://t.co/3yu39bbD1H” Yes! #levitate “@kmmeyer4: about to buy @ActuallyNPH 's new book #nphbook http://t.co/PFpqs2CkYp” Yes! “@thebookofalyssa: bonding over our favorite book!! #nphbook @ActuallyNPH http://t.co/KqlQbsOim6” Yes. “@LillyWeyers: @ActuallyNPH #nphbook Just me and my cat casually reading http://t.co/ri0dtdiW4W” YESSS! Love this one! “@Yaniero: @ActuallyNPH getting my levitating detective mode on deciding my next move #nphbook http://t.co/ps3ZMUJXga” YES!! “@Balisandra: Why is everyone who's reading @ActuallyNPH 's new book FLOATING ??!!” Levitating. The book is magical. #nphbook “@LisaNPH4ever: #nphbook just casually hanging out reading a bit of the best book ever 😁 http://t.co/wB5u9Tpo3f” Yes! #levitate “@tommyspecks: #nphbook really interesting stuff here! http://t.co/K29sMIcE3l” Yes!! #socks “@vfl_sarah: just hanging out, reading your amazing book. #nphbook http://t.co/C4652cJUy1” Yes! “@purrfectmadz: just doing some nightly levitating and reading #nphbook  http://t.co/geVkp1pCZf” Yes!! “@michaela_yay: @ActuallyNPH #nphbook http://t.co/7MxBWPggPl” Yes! Here's my autobiography levitation example. Join in. We will send our favorites something. Not sure what. #nphbook http://t.co/8ObH6N1AEs Such fun in Santa Cruz! I convinced the crowd to post a pic, reading the book, while levitating. You do it too! Add #nphbook. Prizes given. Heading to @BookShopSC for a Q&amp;A moderated by @Davidburtka. Annnd, stuck in traffic, wishing we had Inspector Gadget's car. #RunningLate About to arrive at the @BookPeople in Austin for book signing #328 (ish). Loving on this town. Let's DO this! Today is my mom's birthday! So grateful that I got to spend the last few days with her. Please send awesome @gladsheila your well wishes! A behind the scenes, err, pages of my book's creation. Worth a read: http://t.co/fIMfKPr9XF Delicious NM lunch. Food coma to follow. Book signing later at the B&amp;N at Coronado. 7:00. Come and play! http://t.co/bgRaIv2Gvg Love the haunted houses this time of year! Backed a @kickstarter doc about their creators. You should too: HAUNTERS http://t.co/hXeNuj7Y2d Just touched down into my home town of Albuquerque! So beautiful! The Land of Enchantment, indeed! http://t.co/lGBCUWBu46 Had an epic dinner with @MVoltaggio at Aggio, by his amazing brother @BryanVoltaggio. If youre in the DC area, you absolutely must go! Oops. The restaurant from last night's handle is actually @oyaboston. Worth another tweet. And pic! Kumamoto oysters: http://t.co/hB1PyFESnQ Sushi meal last night in Boston: @OYArestaurant was spectacular! One course was diver scallop with black truffle: http://t.co/1NbcrHVmGq Bostonians: I'm in town for the night! Come visit me at @Booksmithtweets, 7:00. I'll be hanging out and signing books! #goodtimes Found out about this wonderful organization: http://t.co/HCGyvWsqSg The stats are startling. Sign up and help. http://t.co/ZG1EC9ooxK My autobiography came out today! Huzzah! Buy it quick - the first printing is WAY funnier than the second. http://t.co/2WrsTWIRo9 Yesterday I celebrated the birth of my twins. Tomorrow I celebrate the birth of my book. I hope the book poops less. http://t.co/2WrsTWIRo9 My book event tomorrow @ B&amp;N Union Square just got special–er: the great John Cameron Mitchell will be moderating! http://t.co/SP1nuutfLT Happy 4th birthday, Gideon and Harper. I can't believer that you used to be tiny baby things. And now, this. http://t.co/aohJ7XAKai Balls!! @MichaelStrahan &amp; I accept @RealHughJackman 's #FeelingNuts challenge. We now nominate: @MarkConsuelos http://t.co/XWJhJoRwWa You must see @CuriousOnstage. Truly. I was moved, transfixed, transformed, inspired, gobsmacked. Filled me with creativity. Go at once. Saw The Curious Incident of the Dog in the Night-Time tonight on B'way. One of the most amazing things I've seen! So good I'll tweet again. I've been collecting @visionaireworld books for years - truly awesome. Now I'm IN issue 64! Doing magic! Check it: http://t.co/OetZb09jsj “@Neil69David: So are you loving the new Nick Jonas photo shoot?”- I'm, umm, married now so...um, yeah...I would never...umm look at... #yes Finally found our first of fall's fantastic foliage. #park http://t.co/UL5gbdocUU Walt Disney World opened on this day in 1971. Good times! Everyone Please Celebrate Orlando Tonight. Hey @SethMeyers, your very sexy wife was waiting for me backstage after my segment. She smells like heaven... http://t.co/2TFmDOL62m Had fun on @Letterman tonight. Talked wedding, kids, Gone Girl and my book. Tune in, it gets saucy - he asks to see my bare ass. #justsayin Seated uncomfortably close to MC Jerry Seinfeld at his wife Jessica's event for Baby Buggy. @LoveRecycled #stealthie http://t.co/5DovzzHIlP I'll be signing my choose-your-own autobio book at these fair cities: http://t.co/4Db2igbR2P Please show up and smell nice. Hey, here's a palate cleanser:  a robot cheetah! http://t.co/HGVq6sM3Lg Had a great night supporting @LGUS 's #ArtofthePixel gala. Friggin' @SamSmithWorld performed! Good times. We have our @LGUS #ArtofthePixel winner! Congrats to John Summerson from @PNCA! Here's a little split-personality promo for my new choose-your-own autobiography. 'Twas fun to film. Check it: http://t.co/3QAFpQk5jX Rube Goldberg awesomeness, this time with beams of light and magnifying glasses, courtesy of the brilliant @colossal: http://t.co/w8tPTZaZjE Commercial comedy: The @LGUS Ultra HD 4K TV makes everything bigger. Check it: http://t.co/tMuZmeqYmL Couldn't be more excited that Michael C. Hall will be the new @HedwigOnBway 10/16-1/4! Great choice! See him or punch yourself in the face. Guess what? @DavidBurtka and I got married over the weekend. In Italy. Yup, we put the 'n' and 'd' in 'husband'. http://t.co/R09ibF41rt My epic book promotion begins: Win an @ActuallyNPH adventure in #NYC or #LA! Click up in here: http://t.co/ZbSSJVmdDO Dinner for charity: https://t.co/PEEO7gkwDJ Let's get our Food Porn on, yo! “@mg6722: Question for you sir. Will book signings happen after your book becomes released?” Absotively! Doing a bit of a tour. Stay tuned. Congrats to @sethmeyers for his quintessential hostability at last night's Emmy Awards. Calm, classy, hilarious. Well done. Nine high fives are in order! Congrats to the finalists in in the @LGUS #ArtofthePixel competition! http://t.co/NepKigGJKV While I miss playing Hedwig, I may miss the open bar that I  had created in the dressing room next door a bit more...  #thankssvedkavokda Challenge Ice-cepted! #ALSIceBucketChallenge http://t.co/soVgryzwHs I couldn't be more in love with my family. Any reports to the contrary are woefully mistaken. #grateful http://t.co/QgNnsk3VC7 I only have this many shows left! #thentheglittergoesaway #hedwig http://t.co/qpWmjAHBVY ICYMI - Love the improved Heineken Light! Just wish @Heineken_US would’ve let me have one on TV. #BestTastingLight http://t.co/ULtnIePOpc I am stunned and just reeling from the news of Robin Williams' death. He brought so much joy and heart to millions... Just, wow. Harper won't leave her room. Thanks @PotteryBarnKids for the vanity, both literally and figuratively. http://t.co/I030MEpLdg Get tix to the 9/4 @TitsofClay gig at Mercury Lounge. They rule. Plus, their surprise guests are usually amazing! ;) http://t.co/E1SAPX0nHV @blakeleeblake thank you kind sir “@bluemilker: That is where @ActuallyNPH motorboated my girlfriend. http://t.co/q3p5G2dg04” A man's gotta do what a man's gotta do. Best friends. http://t.co/hGZVGwzurf Other dressing room. Post show. Post wig. Just did this. @HedwigOnBway http://t.co/qdI3B6Debc Dressing room. Pre show. Pre wig. Let's do this. @HedwigOnBway http://t.co/yTxYW2QeTO Today is the 10 Year Anniversary of the release of HAROLD &amp; KUMAR GO TO WHITE CASTLE! So a big...um...wait, what was I talking about..? Final two days to vote in @LGUS’s #ArtofthePixel competition. Vote at http://t.co/MAgzmEyMbU Amazing artists, inspired work. #proud My bud @EdAlonzoMagic is on the series Masters of Illusion starting 8/1 on the CW. Airs every Friday night. DVR it. Magic is rad. “@NJ_Callahan: @ActuallyNPH You were so moving in Hedwig last night my entire row of strangers hugged goodbye! Wow!\" -- Love it! @SpeirsyVEGAS I would recommend @CommeCaLV. Great food, amazing cocktails, and the @Cosmopolitan_LV is fantastic. It's my best friend @EdAlonzomagic 's birthday! He's awesome and magical and hilarious and deserves a shout out! Happy BD, ED! Went fishing yesterday with the family. Caught me a sea bass that was thiiiiiiiiis big! #truefishtale http://t.co/sdxmxHoCVW Time's running out to choose your favorite student artist. Check out this video: http://t.co/d6QKvJxBZt @LGUS #ArtofthePixel Hey are you guys voting for your favorite artist for the @LGUS contest I'm hosting? Do so - it's awesome: http://t.co/Ebkfxapyuw While in Montreal, ate at the always delicious @JoeBeef. Oysters, salad, leg of lamb, and this amazing lobster pasta: http://t.co/qMdJ0KbsLA Had the pleasure of observing @KatyPerry for 2 days. Left inspired and astonished by her work ethic and dedication to her show/fans. Bravo. I’m hosting @LGUS’s #ArtofthePixel competition. Vote for these mega-talented young artists: http://t.co/SI64LJUi62 Had a spectacular meal  @ChefAntonioPark 's restaurant Park in Montreal. Do whatever you can to savor his creations. http://t.co/ZnadEcB5Qd “@jessecflores: Apologies for comin' late to the 3pm show. Lesson learned: Be on time for an NPH performance or else spit” Spit happens. @Sethrogen @HedwigOnBway OK, I'll get right on it. You'll need custom kicks - I'm guessing you're a size 6, 6 1/2? @Sethrogen Thanks, Seth! You should take over the role for the holidays. I'd pay good, nay, great money to see that... @HedwigOnBway Happy 4th of July! Hope your day is a blast, but not literally: http://t.co/dFaVCYevbS I'm still loving @Uber! Try it - your first ride's free, up to $30! It'll change your ways: https://t.co/5Y1xtHffxU Let's hang out: 'Epic Broadway Sweepstakes to Meet NPH. Support Broadway Cares and Win a New York Trip' http://t.co/mXITpXwF88 Happy #Pride everyone! Stand tall, it's a beautiful day and there is much to be thankful for! Damnit! I'm already hooked on @CBSBigBrother. Every time..!  Right now, I dig Zach. \"@vfl_sarah: I'm wondering who Hedwig would be rooting for. #USAvsGermany\" She's rooting for the fluffer. Either team. Having an amazing day with the fam is Michigan: lunch at Vivio's, shopping at Cost Plus Wine next door, then a healthy nap. Great times! Your adventure continues... Here is an excerpt from my Choose Your Own Autobiography: http://t.co/mVShwWyXKp  #nphbook So much fun tonight at @HedwigOnBway. Great energy. Friday night crowds are hard to beat. #goodtimes A new @Equinox gym opened in NYC. It is, as expected, fantastic. Pristine, classy, hi-tech, empowering. Love it. Origin of Love: exclusive behind the scene video of the @HedwigOnBway recording. Enjoy: http://t.co/WcK9PnPFOT Had such a wonderful time tonight at @TrevorProject Live. So impressed by this organization. Please support them, or at least learn more. “@rowdyrohde: @HedwigOnBway @ActuallyNPH played a show w #mxpx last night and rocked my Hedwig swag! http://t.co/4pHXXA4NTJ” Well played! “@Legendary__17: @ActuallyNPH @Davidburtka http://t.co/YG76vYMm29” So sweet. Thanks! @96Becky very sweet birthday video. Thanks! “@Lin_Manuel: Took the missus back to watch @ActuallyNPH and @LenaRockerHall DECIMATE the Belasco in Hedwig tonight.” Love u Lin. Only one more shopping day until my birthday. I think FedEx delivers on Sundays now. I love presents. No pressure. Just sayin'. How random: a black cat walked right in front of me and I dropped the mirror that I was holding. What luck! Thrilled for @AndrewRannells to replace in Hedwig. 1) He'll be wonderful and 2) the fan reaction is so positive! @HedwigOnBway Forever! I didn't mention my friend, assistant, and trusty sidekick Zoë (@ZoeBurkeC) during my Tony speech! She's extraordinary and deserves thanks. I'm a big supporter of @TrevorProject. Get your tickets to #TrevorLIVE on June 16. Let's mingle. http://t.co/7TuwqeTqQh Why wait? Get the @HedwigOnBway cast album tomorrow, or in some places, right now? http://t.co/KwzPYQMR13 http://t.co/PxVE7craHK Thank you @tomfordintl for dressing us for the Tony Awards! Our tuxes were classy fantastic! http://t.co/dPbh7mkIVJ Just woke up this morning and found this. Turns out, it wasn't a dream! Thanks, everyone, for your sweet Tony tweets! http://t.co/4Jy7kdW5yr In fact, even less confusing: head to @VogueMagazine on Instagram for access to my night of #TonyAwards  debauchery. Oh, and @instagranph on Twitter is totally not me. So please don't include him/her in your responses/RTs.  Xo So @VogueMagazine is giving me access to their Instagram account for the #TonyAwards festivities. Check it out: my handle is @instagranph “@joshgad: @ActuallyNPH thank you for a perfect night. I'm in all sorts of awe of the magic of you and #Hedwig.” Thanks, JG. You rule! “@AHSDub2014: My High School made a video so huge it made national news.\nhttp://t.co/q4dsqFgVWB” Well played. Epic. Awesome. “@TrendingTMusic: Songs of @HedwigOnBway cast recording, singed by @ActuallyNPH!:\nhttp://t.co/ZxJ97ZGZDW\nhttp://t.co/UyU3rX9Tlu” SO singed! How fun is beautyandessex? Pawn shop turned speakeasy deliciousness. Thanks! This motley crew had a… http://t.co/wnBn6UoTna Starting at midnight, mofos: pre-order the @HedwigOnBway cast recording! It rocks! http://t.co/KwzPYQMR13 http://t.co/t2lsSh58rs So happy to have my best friend @EdAlonzomagic at @HedwigOnBway tonight. Meant a lot that he was there. Ed's super rad. If you haven't already, go see A Million Ways To Die In The West. Opened today. It's so funny, you just might shit yourself. A heartfelt HAPPY BIRTHDAY to the wonderful @DavidBurtka - the best dad in the world. I'm so glad you were born! http://t.co/KkdWZj0dkK “@urbanmythx: Hey Neil. Will you please give me $10,000. I could really use it. Thanks in advance.” Hey Barry. Nice balls. But no. Thank you, Dr. Maya Angelou, for your wonderful words and wisdom. Rest in peace. “@chadmom63: @ActuallyNPH Feel better!” Thanks. I have an Auntie that is lending a medical hand: Auntie Biotic. Love her. #TryToTearMeDown Oof. I got a sinus infection. I blame either our ill son or one of the 75 people I've kissed on the mouth during a #Hedwig performance... Rarely photographed: Two Daddy Long Legs. (Thanks, @ConeyIslandUSA &amp; @DickZigun) http://t.co/VW79t0XDhT Took the family to @ConeyIslandUSA today. Forever thanks to @DickZigun for showing us around: rides, pizza and freak shows! LOVED IT! Happy Memorial Day! So thankful for everyone who served/serves in the armed forces. Much respect. Had an amazing meal at Eleven Madison Park, as a precursor to @Davidburtka 's b'day on Thursday. Truly remarkable. http://t.co/yjDC7zDb8f “@michaelbuble: Watched \"Hedwig and the Angry Inch\" F*CKING AMAZING! !Turns out I'm in love with @ActuallyNPH\" Cum back anytime! #sayshedwig “@patternisland: Original pic of @ActuallyNPH (had to do it, perfect pic!)... http://t.co/tys0MbClKW” Love “@derek_del: Support this @conjuringarts project w/@davidblaine: https://t.co/V64gn7UcE6\" I've seen it in action &amp; it changes kids' lives. Your adventure begins…check out the cover for my new book, now available for preorder! http://t.co/rTh84YKpUh http://t.co/EyYA8gOq9C RT @HedwigOnBway: Hedwig likes a good poll. Vote for #HedwigOnBway @ActuallyNPH @LenaRockerHall here: http://t.co/hXo2K9OBNO “@GabbySidibe: @ActuallyNPH You are AMAZING! I had so much fun at @HedwigOnBway !!” You were a wonderful addition to the show. Thank YOU! “@dramaleague: The astounding @ActuallyNPH is the 2014 Drama League Distinguished Performance winner!\" A thousand thanks for this honor! “@LeonardLopate: Color us glitter!  @ActuallyNPH and @MichaelMayerDIR talk about @HedwigOnBway. http://t.co/YKcYh1oEkU” We had a blast! I think @Ladygaga needs to see her some @HedwigOnBway. #wigfight Go go Gaga! @ladygaga http://t.co/yOZSKmmqhi Just had a remarkable dinner with the radiant @DavidBurtka at Peasant restaurant, in Soho. Deeee-licious! #loveNYC NYC is the bestest. http://t.co/cjW72aCCCf Just read an awesome parenting book! Good advice is hard to come by... Check out http://t.co/yNUFGhWzHa #PermissiontoParent “@deesnider: WOW! @HedwigOnBway was flat out amazing! @ActuallyNPH rocked! @stephentrask” Thanks, Dee. Loved having you there! Happy Mother's Day to all the moms out there, especially @gladsheila. I may be biased, but she's the best in the world. Modern origami. Absolutely breathtaking. Via @Colossal , as per yuzh. http://t.co/KemHFGUYUs loved charring @Alaska5000 Let's make a video! RT @Alaska5000: Transforming @JSJdarling in @WorldOfWonder Presents:  TRANSFORMATIONS!  https://t.co/TMvS1Y4q53 Happy 3rd birthday, @LastBottleWines! So glad you were born! #raiseaglass Random Question: what tht best brand/type of (non-memory foam) mattress? Needing great nights' sleep. “@JulieChen: saw #hedwigonbway yesterday. @ActuallyNPH is phenomenal! Best thing I've ever seen him in. A real tour d'force! -Thanks, Julie! @BettyBuckley Fantastic! Such an honor to have you there! Keep the Shroud safe - there's only one of them. Umm, per show.\nXo Sooo stoked and honored to be nominated, but I'm just over the moon for the rest of the @HedwigOnBway noms! Incredibly well deserved! Just touched down from my 3-day, restful getaway with @DavidBurtka. Back on the grid. Get this: I got nominated for a Tony Award! #Gaaah! Woke up, and with 3 days off from the show, @DavidBurtka has surprised me away for a mini vacay! No heels, tucking, or kids. Can't wait! Want to win 2 tickets to @HedwigOnBway and meet me backstage? Bid now! Proceeds benefit the @TrueColorsFundhttp://ow.ly/vHrLT Calm before the glitter storm. Sitting alone on a quiet stage before the @hedwigonbway opening… http://t.co/zZplgK5B58 Super proud of @ariannephillips for not only her rad costumes in Hedwig, but for this great article about her: http://t.co/vUX8M7bhQp Wow. Instagram switched @DavidBurtka 's handle when I linked Twitter to the post. Gross. Sorry. Here's the pic again: http://t.co/wHNWi84v1w Oops. It's Reese's. Not Reece's. Sorry, I'm a fan of Ms. Witherspoon. Oh wait. She's Reese too. Um, the monkey? No that's Rhesus. Dangit! It seems my Hedwig improvs are making news, but one should have the full story/context. Gossip Cop clarified: http://t.co/hu7dhM75Mk #thanks It's Easter and 4/20? The Reece's Peanut Butter Egg must be quite the desirable commodity today! “@mattdwalton: In National Museum of Iceland when suddenly... Bjornabus Stensson, Player King of Reykjavik! http://t.co/o9lRGq2MpG” LOVE! @gbpack44 Umm, Randy, take a breath. I'm playing a character. Who is harsh. That's the show. That's Hedwig. Thanks for the lovely tweet. I'm a tribute in the #BwayHungerGames. Need citizen support. Learn more and sponsor Hedwig! http://t.co/O5CXeDWiQD “@Joetrolly: Glad that you appreciate the art. Retired. Miss it all. http://t.co/zzKRd9ETYG” Marionettes rock, as did your wardrobe! \"@VanityFair: @ActuallyNPH poses for Annie Leibovitz in the May issue of Vanity Fair http://t.co/GMFfeISqap\"” Annie rules! Loved doing this! “@CultureDesk: Backstage sketches from @HedwigOnBway  w/ @ActuallyNPH. http://t.co/hhpJlxsQiX” Fantastic images! I want them! I join the #UnderTheGunn judging panel alongside @heidiklum! See you for the finale TONIGHT at 9/8c on @lifetimetv. #TeamTim I'm thrilled for @StephenatHome replacing Dave. He's a fantastic choice. I'm a huge fan. Colbert is rad. Mickey Rooney's talent and energy and legacy have had such a lasting impression on me. He will be greatly missed. “@erichbergen: I'm so incredibly proud of my friends @spencerliff &amp; @ActuallyNPH &amp; their incredible work in HEDWIG on Broadway.\" Thanks, EB! Every New Yorker should pay top dollar to see Queen of the Night (@QOTN_NYC). Such talent! Immersive, delicious, sexy, stellar. #loved Subject change: I love Gideon and Harper, and love that they love NYC. http://t.co/zDz5GFjkK5 “@MoStormTrooper: would you have wished that Barney and Robin would've stayed together?” Sure, but most divorcees wish it had worked out. “@lisaduhovnay: @ActuallyNPH @hazteckoe You're fuckin kidding. It has to be joke!\" I'm not, and it isn't, and watch the fresh mouth. “@hazteckoe: do you prefer the other ending?” as far as I know, there is no other ending. We only shot one. “@tweetbohn: what was your opinion of the series finale?” I'm a massive fan of it. Well written, heartfelt and worthy of discussion. #my2c As a fan of old school game shows, I dig this t-shirt from Tic-Tac-Dough. Gotta love Wink Martindale. http://t.co/mGDTrBd8eL “@HedwigOnBway: Saturday night at The Belasco #SoldOut Great way to end the week. Love this pic! http://t.co/J1oaTuzYip” “@time2suitup: @ActuallyNPH Neil, do you realize you're basically a cat? http://t.co/6X7qWNL0MW” -- Meow..! Blast! The apparently amazing @VerizonFios wifi service stops 1/2 a block away from our new pad in Harlem! Who can I plead with? 😁 Happy 10th Anniversary to the gorgeous man I have the pleasure to love. davidburtka (Twitter), burtka… http://t.co/YsWZjgeEFA To all who helped create #HIMYM, well played. To all who enjoyed watching it, I respectfully request the highest of fives. #thanks Magic time: check out my tricks in this new @YoCrunch commercial! https://t.co/r0lsZaZ2X9 #YoCrunch #funyogurt So glad the first performance of @HedwigOnBway is over! Massive thanks to everyone who came. :) Can't wait to do it all over again tomorrow! Super cool dad makes super rad vids of super hero son: http://t.co/9aD5cqc8hO via @Colossal, as usual. Personal shout out: thanks\n@TheShadeCompany for the quick turnaround on blackout shades. When the kids sleep, then so do I. I'm a little bit obsessed with @TheBiancaDelRio right now. Just am. She gives the best face. I got to play with @billyeichner! The full ep airs Weds night at 11/10c on @FuseTV. Bonus scene: http://t.co/TgTGxI6Os1 #BillyOntheStreet Lookie! Hey, thanks AA! ‘You make our #A321T look even better, @ActuallyNPH! #TheLegendIsBack http://t.co/kTBgSjEm6j’ Just left the opening of the new Les Misérables. Still love that show. @TheWillSwenson was a fantastic Javert. Bravo! “@Just_Shreya: Do we get to know the name of the mother? or will she always be \"The Mother\"! #HIMYM &gt; Her name was always TM in the scripts. Join me in supporting #1night1drop imagined by @cirque to support @ONEDROP. Check out the awesomeness here: http://t.co/0S6nuf42QR In honor of today's holiday I present a Hedwig wound that, due to wearing fishnets, looks like a… http://t.co/R9VQar98E2 Non-stop rehearsing for @HedwigOnBway is kicking my ass, my knees, my elbows, my junk, my brain and my heart. It's a lot. #nocomplaints Loving @SethMacFarlane 's new science series Cosmos. Nerd chic fantastic. Makes my brain work, too! Trailer: http://t.co/wDCSfdixJV I'm super pleased with how my @OutMagazine profile turned out. Grab a copy, the pics are swell in person. http://t.co/NIcceeAQqE Started my 1st day if rehearsals for @HedwigOnBway with a glorious facial from @Kiehls #spa1851. Ah, to be a woman..! Took the kids to their first Broadway show today: the Lion King. Mine was 25 years ago: Les Miserables. It's the circle of life... Jefferson Mays is phenomenal. If you don't know him, you should. An actor of almost unparalleled versatility. A joy to watch. Good to have the family all together again. http://t.co/gF9EruWROa Mattresses are so much more effective than futons for sleeping toddlers. Thanks @potterybarnkids for the last minute save. #zzzz I thought my friend @TheEllenShow did a super great job hosting the Oscars. Hilarious. End of story. #nodrama I'm officially heading East. My wonderful west coast days are done. #goodtimes The Vanity Fair post Oscars party is crazy unbelievable. So grateful to be here. More to report later... Let it go! Let it go! Our kids will be so happy..! Idina crushed! Love it! Pink is fantastic. I'm over the moon about her Over The Rainbow. “@tmacwill: @ActuallyNPH Legen - eight for it - dary” winner! Well done! Hint: hint x infinity! Mpyza wlyzvu av adlla ihjr 'Slnlu - lpnoa mvy pa - khyf' dpuz! Puzzle time: solve my next tweet before anyone else and win something awesome from me. Holy smoke, I have 8 million followers! I should do something fun to commemorate. Hold please. I just uttered my last word as Barney \"Awesomepants\" Stinson today. Nine years. Man, time sure flies when you're having fun... The Winter Olympics are awesome. Never have a cared so deeply for someone I just learned about, maybe, seven minutes earlier. “@SethMacFarlane: A comedy version of \"All Is Lost\" starring @ActuallyNPH. Somebody make that. Neil, let's make that.” Ok. Can I be a mime? “@janiobi: Is it crazy for me to consider flying to NYC for a night just to see @ActuallyNPH in #Hedwig? Idk.” Crazy GENIUS! @HedwigOnBway If you NYers haven't yet, go see Outside Mullingar, a touching play on B'way directed by the brilliant Doug Hughes. #worthit Thea-tuh News: the @HedwigOnBway box office is now open at the Belasco Theatre! Run and grab yourself... a ticket or two! Loving my new iPhone case from @mophie. Battery drainage issues be damned - switch flipped, I'm back to 100%! Delicious props to chef Ian Coogan and the staff at @ABCCocina. The HIMYM cast just finished dinner and it was fantastic! #wellplayed Thanks @uber for having UberSky yesterday, and for \nmaking me seem all romantical and badassish. http://t.co/8UuEjsLwBP Happy Valentine's Day from Gideon and Harper! This was their gift to davidburtka and me (G's feet, H's… http://t.co/3lCBmN8kMv Just finished the initial read thru of the final How I Met Your Mother.  Ever.\n\nHoly moly. \n\nJust... holy dang moly.\n\n#soproud “@DaveProps: @ActuallyNPH doing his thing during last years Emmy sketch in MacLarens. \n#HIMYM http://t.co/WrVGqwv8Im” Love your tweets! Watch my new sexy slow jam featuring @drinkneuro @AsherMonroe &amp; @ItsAProblem You know you wanna... http://t.co/KCQX05re9Y I'm so proud of @RealHughJackman for hosting this year's Tony Awards and for calling me an hour ago to say, 'Suck it!' Gay football players rule. #represent Performed a secret set with @TitsOfClay for @HedwigOnBway prep at lower east side club rockwood. Crazy… http://t.co/2OtBKSO2Dz So honored to have been, um, honored by Hasty Pudding at Harvard last night. Their show was awesome… http://t.co/majkQ6CZIl Just got an historical tour of the Hasty Pudding headquarters. I have a feeling there will be lots of drinking later... #MOY Having a great day so far at Harvard with the Hasty Pudding gang. Wonderful lunch at Harvest. Oddly, no pudding. #MOY First day of staging rehearsal for @HedwigOnBway. My dogs are barkin'! #fishnotstockings http://t.co/JMvhrEwoZF Heavy snow and winter weather warning in NYC! Strange, I thought it had been warm on the East Coast… http://t.co/Q6aOh4Zj9V Ho hoooo boy oh boyo, these seats in the new @AmericanAir planes are super cush fantastic! Love it! #podsareswanky http://t.co/NZSMks5ZXn Never thought I'd be labeled as the 'Lady Tickler', but, there ya go. Follow @AMillionWays for updates! #AMillionWays http://t.co/gLPaoNyud5 Loving these new shirts from @TheEqualityT. Subtle, yet effective. Wear 'em with pride! http://t.co/S89Ry7dJ4g Just finished watching HIMYM #200. Cristin Milioti was superb, as was the writing. Made me cry. Very proud to be part of the show. #grateful Can't believe HIMYM's 200th episode airs tonight! It's a great one, starring The Mother! Lots of back story revealed... #watch Going home. Early call tomorrow. Best Grammys in a while. Longest Grammys in a while. Loved it. Congrats to all. #blackout My face hurts from smiling. That was one of the coolest things I've ever gotten to see. Much much love. Well done, Grammys. While performing with Metallica, Lang Lang kept trying to do Taylor Swift hair moves, but to a lesser effect. Daft Punk rules. 'Nuff said. Backstage. Willie Nelson just performed. The stage smells strange. Pungent. I like it! Imagine Dragons rocked so hard a couple people exploded in the front row. #truth I kinda wish Ringo Starr had worn a foam finger, stuck out his tongue and tried to hump Robin Thicke. #twerk Oh, @Pink! That was absolutely fantastic! I'd say you have balls, but that would sound weird. But you totally do. Amazing! Taylor Swift looks super hot. I'd try to steal her hair moves for @HedwigOnBway, but I fear I'd lose my wig. John Legend is phenomenal. I was sure he was singing to me, kept looking right at me. Realized his wife was one row behind me. #nexttime I kinda wish Chicago had worn foam fingers, stuck out their tongues and tried to hump Robin Thicke. #twerk On tonight's episode of American Horror Story: Coven -- @KatyPerry #loveher On behalf of the parents, spit out your gum. Only Pharrell Williams can prevent forest fires. Beyoncé is sexxxy! @Davidburtka said, 'She could turn a gay man straight!' Now I'm worried... “@CaraCompass: @ActuallyNPH @TheGRAMMYs What award are you presenting?” Performance by Daft Punk, and some special surprise guests..! “@tbhgoaway: @ActuallyNPH fags should be banned from the grammys”  Classy. “@jggoldberg91: @ActuallyNPH @TheGRAMMYs Who is your pick for album of the year?” Foo Fighters. No, NO! Kelly Clarkson! Heading to @theGRAMMYs with @Davidburtka. Best concert of the year. Expect some random tweets. http://t.co/98wpmoVoWI “@Infamousgay: Does @ActuallyNPH really tweet everyone back?”  No. Loving this @danreynolds concert! Such nice, talented dudes. Can't wait to see what they do at the… http://t.co/DtUDDWKQ2O Photo booth dorkiness at the @ImagineDragons concert in LA, thanks to @citiprivatepass and a cubicle with a camera. http://t.co/KUUijaZKM7 Stoked to be Hasty Pudding's Man of the Year. There's pressure, though, it's only January. I really need to accomplish some shit. #pressure Yesterday I asked for Doc Howser questions, and gave the wrong em'er eff'ing hashtag. Questions should include #QForDoog Thanks, and srooy. Writing my book. Stuck on the Doogie chapter. Any Howser related questions that you've always wanted to ask? Go for it: Include #QfodDoog Took Gideon and Harper to their 1st @Cirque tent show: Totem in Santa Monica. Experiencing astonishment with them was unforgettable! #Go “@guydesanct: @ActuallyNPH I thought you should see this. http://t.co/KaG33ttOZs” Best. Milk. Ever. Leaving our weekend of debauchery in Vegas. @Cosmopolitan_LV is a phenomenal place to stay/eat/shop/gamble. Can't recommend it enough! Having a surreal, hilarious, unique time at the opening of Rose.Rabbit.Lie. at the Cosmopolitan.… http://t.co/I1pHT4yw81 I'm thrilled to announce that @HedwigOnBway has found it's Yitzhak: the amazing Lena Hall (@LenaRockerHall). Minds/roof about to be blown! A new HIMYM is on tonight! I'm so slappy, err, happy! Please watch! I'm doing a crazy glam rock photo shoot. Over the top Bowie-tastic, but now I'm not sure how to get the glitter out of my iPhone. “@TVGuideArchives: CBS Primetime Jan 9 1994:\n9PM World Premiere Movie 'Snowbound' starring @ActuallyNPH http://t.co/kU5tUyyXwO” #TBT Our children are obsessed with Frozen. I've heard Let It Go 83 thousand times. #stillloveit #idinarules Magachita #3, 4 mebbe? : Bruuuglah dret scruh nuu rezzlooshun! Nigh nigh nowh. #annndblackout http://t.co/GDgpr3NBUK Margarita #W: I swinnin laps http://t.co/4eLeJDVaIh Margarita #19: ......hic!...... http://t.co/PbK2oVtbFC Margarita #17: Maaaybeee shud take break I shud maybeee. #ifoundahat http://t.co/pydj799uqO Margarita #12: I's the life of the party!! Everybodyone is LOVING me!! http://t.co/yw3HaaY8qQ Margarita #7: Yummy yum yum! Man, what's in these things?!? http://t.co/CXI0po9CO1 Margarita #4: Feeling great. Can't find my book... http://t.co/ZbiQ9Deew3 Last day of our Mexico adventure. Let's see just how many margaritas I can drink. Cheers! http://t.co/cvI0tOEbiL Hope your 2014 is filled with many chapters of adventure, wisdom, and great good times! Happy New Year!! My main gift to David. Called a Mechanical Flipbook. Fun to create, even funnerer to watch! http://t.co/nQLdjMOV6l “@terroir360: 2012 Sleight of Hand The Conjurer Red Blend http://t.co/J1bYZkCuEC  @ActuallyNPH” Nice label. Just a fantastic evening. Dinner w/ great friends @AmyAcker and @TheJimmyCarp, kids were hilarious, opened amazing gifts by @Davidburtka.#💝 Merry Christmas Eve from Watson the Red-Clothed Reindeer! http://t.co/1LR9N0aQtH A pic with with the some of the smashing cast of Sleep No More at the @Citibank event I hosted earlier this month. http://t.co/JDAtRtCich Here's a video showing the behind the scenes making of the @Disney Christmas Day Parade Opening Number: http://t.co/ZaFglohX23 Hope you dig. Enjoy the sweet holiday song/video from my pal @AsherMonroe: http://t.co/H3Vxvrgydb It’s that time of the year..! #neuro It's beginning to look a lot like Christmas! http://t.co/gk7E8W5WEJ “@fapubacasin: Best of 2013 (Behind the Scenes): @ActuallyNPH and producers talk Tonys opening number http://t.co/lOoCbkusiQ” Good times! Well done, New Mexico! Your decision of equality for all makes me proud to be born in your enchanted land! Is two day shipping fine? Or should I pay the extra and overnight her? http://t.co/ZLw2EMQa1e “@dmiproductions: Retro toys make up this Rube Goldberg contraption:\nhttp://t.co/2il8HSa3zv” Love this! I love UBER! Way better than a taxi. Sign up using my promo code, get $20 off your 1st ride: http://t.co/4e4zuXs9Q7  Don't drink &amp; drive. If you're a fan of old school variety arts, this Kickstarter is worth backing. Plus, one reward involves me! http://t.co/KQ3tobRiPv RT @himymprod: The @himympodcast with @ActuallyNPH is up at http://t.co/xecMjpH4iE  Let the word go forth! I don’t watch The Voice, as it’s opposite HIMYM. But @AdamLevine asked me for you to vote for @tessannechin. And I mean, come on. #TeamAdam So sad to hear about Peter O’Toole passing away. Lucky to have worked with him for a month in Prague. Wonderful man, remarkable talent. Enjoying my weekend of various holiday parties.  Bring on the nog! #hiccup Today I taught the twins how to open umbrellas inside, walk under ladders, and break mirrors. I figured this is as good a day as any… “@laurenlady81: Can you tell who my sons idol is? He asked Santa for a new tie! http://t.co/Q4ooxV18nd” Nice pose! Your son rules. LAers: hope your family will enjoy the Aladdin panto as much as I did. @jordan_fisher is fantastic. Dec 11-29 @pasplayhouse @lythgoepanto Well said, Fred. http://t.co/cvtMGO7CK7 “@connor_g: @ActuallyNPH tap and hold for focus lock” Focus LOCK! Huzzah! Thanks! If you’re visiting Mexico (at Epcot), do visit @cavadeltequila. Their tequila tastings make cranky kids bearable. http://t.co/2ShQDiU1BJ Dear Apple, what can you do to improve the near focus on still pics? Even when I tap a face, it still opts for drapes. Vacation pics suffer. Just wanted to say a big thank you, congrats, and well done to all of the cast members of the parade today. Job well done! #impressed “@jenniferrmarie: David and Gideon. #disneyparade @ Cinderella Castle http://t.co/nvlZlU1BNJ” Love this pic! “@MagJohnsonBlues: @Honda Why Andre?” Andre Odyssey. Excellent at both driving and tennis. “@BURTKAHARRISLUV: @ActuallyNPH You have a name for your new @Honda?” I do. It’s Andre. “@yellowbird118: @Honda You get a free car even though you can afford it?! Poo” Not free. I worked for them and it was contractual. #Poo? Happy Birthday, Walt! I can’t thank you enough for all of the happiness you’ve brought me. http://t.co/ZiU60qmHu9 Thanks, @Honda, for the best gift ever - my new Odyssey m̶i̶n̶i̶ maxi van! http://t.co/jo2m1TRyIh Nelson Mandela, rest in peace. What an unbelievable legacy… Voting closes tonight, yo! http://t.co/pwlb9PDrxR #yo? I’m having a blast narrating the Candlelight Processional here at #Epcot. Amazing orchestra, gorgeous voices, awesome crowds. Love Disney! Would you mind taking a quick minute or four and RTing this: “Neil Patrick Harris #comedictvactor #peopleschoice” like 86 times? Sexy beast! ♥️@DavidBurtka http://t.co/cVpcKGI364 “@heeytherehannah: @ActuallyNPH has arrived 🎉 http://t.co/pqUm4JAK7y” Thanks, UK. The pleasure is all mine #savemeapint #orthree I’m relieved to know that all of my panting over @TomDaley1994 at the Summer Olympics wasn’t completely misguided. Walt Disney World, here we come! Such sad news about Paul Walker! It’s so tragic and crazy how things can just end so suddenly. My condolences to his family. Delicious meal tonight at ink (@MVoltaggio), amazing as always. http://t.co/gfHMSl8n6h Having a most relaxing Thanksgiving with the family. So grateful. http://t.co/rBUat8e9ok “@annmarieadams29: @ActuallyNPH is SUPER BEHIND! WHERE R YOU FANS? Neil Patrick Harris  #comedictvactor #PeopIesChoice” Thanks. I work out. Super grateful to @MVoltaggio and all the other amazing chefs for lending their time and brawn. I was honored to be included. @TheLAMission Prepping the turkey for @TheLAMission 's annual thanksgiving meal. A wonderful organization. #thankful… http://t.co/TqKtFW4TAE Excited for Thursday. Lots to be thankful for: health, children, culinarily gifted fiancée. Not necessarily in that order. #hungry Toast w/ me backstage @HedwigOnBway after seeing the show! Bid @charitybuzz &amp; support @TheActorsFund! http://t.co/YxA5bYo2to #12daysofgiving Erg. Everyone who RT’d, thanks. But I wrote it out wrong, so none counted. Try again? Neil Patrick Harris #comedictvactor #PeoplesChoice Filming How I Met Your Mother's 200th episode this week. Can't believe it! So proud of everyone involved. http://t.co/qScdnecYNM If I, Neil Patrick Harris, win the #comedictvactor award for #PeoplesChoice, I’ll accept it with a live monkey on my shoulder. Please RT. Harper and Gideon at the premiere of Frozen. Wardrobe provided by Little marcjacobs, eyewear provided… http://t.co/whvtFXswoh I’m a big fan of, punctuation and “it’s” correct usage; Just took the family to the premiere of Disney’s Frozen. We absolutely loved it! Story, voices, songs - all brilliant! Want to see it again! Can’t wait to watch @DavidBlaine ‘s new special tonight! Should be great! Look at the blazing speeds AT&amp;T provides here in tech savvy Sherman Oaks, CA. Hoooah! http://t.co/BqblyvsqdK “@alex_b007: I’m so sorry, buddy, but Chris Colfer and Darren Criss have some dedicated fans.” Challenge accepted! Fans..? Just heard I’m in last place in the People’s Choice Awards, behind Michael Chiklis on The Shield. Please vote: http://t.co/tgAWiqlISY Great news! @nothingtohideny extended their run through January 19! So proud of awesome magic. Go see it! http://t.co/Q2o77EOqei “@HuldaBreen: You deserve it, but your behind. Neil Patrick Harris #comedictvactor #PeoplesChoice” Stop talking about my behind and vote! Mahalo, Hawaii. RT @smgselenag: Hey people lets vote to @ActuallyNPH \n\n1 RT = 1 VOTE\n\nNeil Patrick Harris #comedictvactor #PeoplesChoice Remember Myst and Riven? The creators are Kickstarting a brand new game: #Obduction. 3 days left to help fund - http://t.co/1gVwW25w84 After an exhausting workout at the Century City @Equinox gym, now I'm craving Indian food. #random “@its_JoeFig: wasn't that show supposed to be over like 3 seasons ago?! When are we gonna find out who teds wife is?!” Watch the show, dork. “@George__85: You better tweet some more Neil Patrick Harris #comedictvactor #PeoplesChoice You're losing on twitter votes!” Quick, RT! “@NoettinG: @ActuallyNPH Neil, my man you are a bad ass mother fucker”  Word. Dudes! A new HIMYM is on tonight! Ya gotta watch! It's the newest yet! So new, it's even newer than last week's show, which was SO new! That davidburtka takes taco eating to a whole other level. #emmgroupinc http://t.co/oK1U30nXJY Just found out that it counts as a vote every time you tweet the following 3 things: Neil Patrick Harris #comedictvactor #PeoplesChoice Saw my first opera ever last night. Rigoletto, directed brilliantly by Michael Mayer. What a classy, fancy night. Thanks @MetOpera! I gave the wrong handle for La Soirée, the fantastic and super hot show in NYC. It's @lasoireelive. See it and get all randy. Just attended the opening of @La_Soiree in NYC. Sexiest show ever! Brilliant variety acts. Hilarious. A perfect 2nd date! Must see! Hey @davidblaine, the magictastic @NothingToHideNY opens on Wednesday. If you're in town, would you come and be my guest? You'd dig it. Just had a blast watching @jinksxmonsoon in The Vaudevillians. Amazing characters. So inspiring. Go go go! Ticket sales for @HedwigOnBway start today! Warning: sit up close and you may get wet. #inmorewaysthanone http://t.co/ptrpK1athM Already missing Halloween. Here's a link to more great @projectphotoboo pics from our party last week! http://t.co/KFNzJHipth Have a spooktacular night! Here's our family Halloween pic (via @projectphotoboo):\nWell done, @DavidBurtka! http://t.co/2ThNeFKdYQ Just finished getting scared at @AloneExperience. Haunted house you go through alone, with a flashlight that doesn't help you. Terrifying. Still recovering from our pre-Halloween party. Thanks @stellaartois and @coppola_wine for the booze. Thanks @ondrinktoomany for the hangover I’m obsessed with Allison Janney. She was so sexy at our Halloween party on Saturday and now I’m watching her in The Way Way Back. Love her. New HIMYM on tonight! Newest episode EVER! Miss it and you’ll never see it again! Until repeats. But you know, for ratings and stuff, watch! If you go to live events, use Goldstar. They just released an app: http://t.co/rOxh72KxbC It’s the best of culture, distilled. “@Swoop1fan: Samantha’s Rendition of the 2013 Tony Awards Opening Song http://t.co/hDqigDTe1q ” That’s fantastic! Thanks, Samantha! Stoked to hear that @NothingToHideNY is starting to sell out! Get your tickets before you can’t! http://t.co/Nx7fxkmhkI  #magic Had fun just now with the gang from @theviewtv. Here’s more info about my special Sleep No More experience: http://t.co/i2kWFPH6rr #comeplay RT @NPHFoodPorn: Had a crappy meal at The London in NYC. Super pricey, rushed me through. Felt like a bad wedding reception meal. #RamsayFa… Rest in peace, Lou Reed. Your musical influence will never be forgotten. Halloween preparations underway. #Fred http://t.co/GbGqUmVqaj Maybe the best thing ever: High Speed Photos of Dogs Shaking by Carli Davidson: http://t.co/KNBrQzcfA1 (via @Colossal) “@EnterDelusion: Vote \"Delusion-California\" as \"Best Non-Theme Park Halloween Event\" here: http://t.co/DsiM4Bgil7” #VoteForStuffWednesday Ah, a more specific link to vote: http://t.co/L5tilhF8Ge Never expected this to be so complicated. “@risaeats1960: it says voting has ended.” Ya gotsta click on the tab that says ‘vote’ apparently. Vote for me, so I can ask you to vote for me again, but for reals like: http://t.co/q8gMbrrclz “@derek_del: It’s true, he did. There was literally no shit anywhere in the building by the time Neil left.”  Boom. Tomorrow’s the 1st performance of Nothing to Hide at the @SignatureTheatre. I directed the shit out if it. http://t.co/yYXRyiMvno My friend and amazing designer Heidi Abra is having a private sale to benefit Triple Negative Breast Cancer research: http://t.co/Dg1smIHKtq I may have said this before, but I’m not on Facebook. I don’t do the Facebook. So anyone claiming to be me is a jagoff. #twitterrules Is it weird that our daughter Harper is drawn to the villains more than the princesses? (Thanks, @TrueEnchantment) http://t.co/mm1BT8LOEr Thanks @Svedka Vodka for lending us booze for an event last week. However, I’m returning the bottles empty. Hope that’s okay… “@EnterDelusion: Jon Braver attempts to protect @ActuallyNPH from the #plague... Was he successful? http://t.co/Q3n98yPpek”  Barely… Check out what @TrevorProject and @ATT just launched for #LGBTHistoryMonth! http://t.co/UKSdvA7SJQ #ChangeHistory Hedwig News! The first ad image was just released, and I get to debut it! Tickets go on sale soon... @HedwigOnBway http://t.co/p4RZoban0O My great friend @MichaelSerrato has a new web series, turning macho movies super gay. 1st up, 'Rambo, but Gay!': http://t.co/CjctMqh0RZ New HIMYM on tonight! Tune in, it's the best episode ever! Well, not sure about that, but it's the NEWEST episode ever! Back in Missouri for a few days of filming. Our daughter Harper asked David where I was, and he said ‘Gone, Girl’. Save lives and money: Please join me in supporting @NoreenFraser by shopping @stelladot Breast Cancer Collection: http://t.co/Xxz1tiv47M Happy International Suit Up Day! Please, for the rest of the day, suit up!  But only in your international suit, for some reason. Happy 3rd Birthday, Gideon Scott Burtka-Harris! Love you SOOO much, too! http://t.co/H32iaWGFn9 Happy 3rd Birthday, Harper Grace Burtka-Harris! Love you SOOO much! http://t.co/8bfFXuENF3 “@Nanda1336: Thank you @ActuallyNPH and everyone for the RT - found the owners to lost dog. Sweet reunion. BUDDY is home!” Excellent! “@Memles: I will eat a shoe if he does. #ca351 RT @derekjohnsonUW: maybe this is the time @ActuallyNPH finally responds?” Boom. I want pics. “@Nanda1336: Found dog on Sierra Bonita &amp; Sunset in LA. No collar, no chip (bandana from groomer). http://t.co/hzFeo8I6Aj” - Anyone? NY magic fans: Nothing to Hide starts October 23rd. I’m directing. Buy tickets now before they…disappear! http://t.co/Q2o77EOqei I love this stunt so much:\n\nhttp://t.co/sP0uQRGjjd\n\nI wish I had telekinesis… If you like immersive theatre (like me), then go see Natasha, Pierre and the Great Comet of 1812! A musical War &amp; Peace in a tent? Loved it! RT @Davidburtka: Let's make pumpkin pie! http://t.co/o3L2YpWsUy RT @Davidburtka: Who's excited for Halloween!? http://t.co/wtS4VoJgSA I LOVE NEW YORK! Can’t wait to live here full time! #citythatneversleeps Make up removal at the print art photo shoot for Hedwig. http://t.co/tQE25yKZlY Saw First Date last night. Great to see @ZacharyLevi on Broadway. He’s wonderful! I can’t wait to see what he’ll do next! NY hotel living is expensive. Coffee, oatmeal, berries: $47.00! American dollars! How can that be possible?!? My friend Joanne Tatham is performing tonight and tomorrow in NYC, at the famous @TheCarlyleHotel. Great cabaret, check it out. Saw @thenSheFell tonight. Loved it. Similar to Sleep No More, but without the free roaming or chaos. Highly recommended. Seeing Then She Fell in Williamsburg. Right friggin now. Can’t wait. Loving NYC. About to get my immersive theatre on! Stay tuned… “@rorybottoms: I read that as dick enchiladas”  Also delicious. Had a great meal at the mexican restaurant @LaCenita. Just opened. The duck enchiladas were enchilicious. http://t.co/4piPuhBfMM New HIMYM tonight! Holler back now! Well, watch it now. Holler back after. Family Photo Fantasticness! Love this: http://t.co/tMNrWA7O51 Shitty day. #someonecutthepadlocktomygymlockerandstolemywallwtandcarkeysgreatgoodtimes Can you handle the most badass interactive horror play in LA? Go see @enterdelusion on it’s first preview, this Fri! http://t.co/hwG6NpMe8U “@jimfrisbie: are we talking like Variety headlines? If so, \"Barney Boffo With 'Benjamin Button' Boss, Big Bucks At Box\"” Ha! Here’s hoping! Finally filming with Fincher. Fantastic feeling. Fantasy fulfilled. “@broadwaycom: Magic extravaganza NOTHING TO HIDE headed off-Broadway, directed by Neil Patrick Harris: http://t.co/WEZO71HyER” Yeah yeah! While I’m at it, thanks to the Thompson Hotel for both their amazing rooftop post show party and a suite for me to crash in. @Thompson_BH Nice! This year’s Emmys had the largest audience since 2005. That makes my bosses very happy. Thanks so much for watching! Emceeing the Emmys was fun, but I’m sure glad it’s over. Looking forward to not hosting anything for a long time. Just saw Elton John perform at the dress rehearsal of the @PrimetimeEmmys. Amazing. He’s so craaazy talented! #mustwatch Mind mushy. Just finished a looong day rehearsing for 2morrow’s @PrimetimeEmmys. But I think it’s gonna be very watchable. I hope you do. Happy birthday, @AsherMonroe. Not only are you a rock star, you’re a great friend! RT @jasonlynch: Emmy host @ActuallyNPH talks with me about his most memorable hosting moments at @thedailybeast http://t.co/0zEzwxH32z Been dancing my face off in rehearsals for the choreographer’s # in the @PrimetimeEmmys. I’ve such crazy respect for these dancers. Unreal. We just won an Emmy for the Tony Awards!!  Yahoooo!! Happy Friday, the 13th! I really shouldn’t be tweeting while I drive, it’s a baaaA - AAAH! What have I DONE?!? Why? WHY SUCH LUCK?!? Ready to get yo scare on? An all new DELUSION is back, taking haunted attractions to the next level! http://t.co/fFpDlcC5Sp \n@enterdelusion As we read to our kids, I’m becoming more and more obsessed with the pop up books by Robert Sabuda. The man’s an absolute genius. Starting to prep for the @PrimetimeEmmys. I have a lot of TV to watch..! http://t.co/rZnjgpgVmV I will gladly lend support to any special honoring teachers across America. It’s on CBS tonight @ 8pm et/pt http://t.co/iG1qRq3uXO #TEACH Just ate dinner at Alder. My drink, Dr. Dave’s Scrip Pad, was great. The food, uniformly disappointing. Sorry. Love WD-50. This wasn’t that. Had a great meal last night at the new restaurant Juni. Thanks, somebody, for the recommendation. It was wicked! http://t.co/pNXU2VoEJG Had an absolute blast at the Lexus New York Fashion Week Show. Holograms, yo! http://t.co/XVKWAglLXz Check out my greatest role to date: a lint ball in the new @Honda spot! http://t.co/R1y1MJxZ7Q  #hopeigetacarouttathis Hey, NYers: what’re the great new foodie restaurants these days? Could be trendy or under the radar. Send me thoughts and links, thanks! Spent Labor Day weekend with the fam at my sister-in-lawmost’s lake house in Upper Michigan. What an amazing part of the country! Happy Labor Day, everyone! Hope you get to honor and celebrate working by… not. Oh man, do I love the Meijer in Canton, MI. Where else can you buy a 12 pack of underwear, Comté cheese, and tropical fish at the same time? “@Richridlen: @ActuallyNPH Can you recommend a good first magic book? History of kinda thing?” Try Taschen: http://t.co/dZ7FOgN1mc “@DamonLindelof: I cannot explain why this made me laugh so hard, I cried... but it did.  #ILoveJapan http://t.co/ASywlneOed” Hilarious! I've decided that I'd like to be J.J. Abrams' best friend.  I feel like that should happen. A hilarious must read for parents: http://t.co/epR3A1Koez  Flattery will get you everywhere. I don’t mean to scare you but DELUSION IS BACK!! I’d sign up at http://t.co/s577xIFDAl to get first crack at tix! #interactivehorrorplay The season finale of my guilty pleasure, Brother vs Brother airs tonight. Watch my friends the Scott Brothers declare a champion! #HGTV I had the great pleasure of meeting @GDeLaurentiis last night. She's even sexier in person. http://t.co/UobLT3C6fs “@Duff_Goldman: Good to see you, @ActuallyNPH! We’ll catch up in a few weeks over some meatballs, yeah?” Can’t wait dude. You rule. Having a fantastic time at the L.A. Food &amp; Wine Festival. The oysters are shucked, and our kids are wasted. #yum http://t.co/Bp8pYY5mRX We were forced by @SarahChalke to sign this HIMYM script. At knifepoint. Please bid and win at http://t.co/XPbCBBoo3q so we can be untied. Well done, Wentworth Miller.  Bravo. I’m channeling my inner Buster Keaton in a new @FunnyOrDie video exclusive (shot by @MattHoylePhoto).\n\nEnjoy: http://t.co/arL7ahjw3P Are you kidding?!? Intricate sculptures made with paper. These are unbelievable. http://t.co/fM1MFRcvZg Just finished shooting Season 9’s 5th episode of HIMYM. I’m happy to say, they are uniformly great. Excited about our final season! The hilarious dudes from @Rifftrax are riffing on Starship Troopers, in select theatres, tomorrow night! Check it: http://t.co/NCO5mX9wEz Food on Foot needs votes! Once per day, per device, thru Sunday: http://t.co/U5eO4bdga8\n\nPretty please? “@RobbPascoeGM: so if there’s a Smurfs 3 we have to see it 3 times” Let me do the math… (scribbling)…three…um…carry the one… Yes. You do. Smurfs 2 is not only the title of the movie, it’s how many times you must watch it in the theaters. Please adjust schedules accordingly. Great news! I think we found our Emmy opening number:\n\nhttp://t.co/SjURnVLVeS  Start at the 1:30 mark.\n\n Go for it! (via @tonysepulveda) “@kissywissyqt: Watching smurfs at the drive in! http://t.co/Vh5SbzODou” — The only scenario where I condone texting at the movies. @hitRECordJoe You’re the real deal, JGL. Keep on representing creativity at it’s finest. The more shirtless selfies @NickJonas posts, the better my day gets. Rest in peace, Eileen Brennan. Your performance of Mrs. Peacock in Clue was one of the funniest I’ve ever seen. You’ll be quoted forever. Come on, Time Warner Cable! For what you charge people each month, they should most certainly get CBS! Call 1-888-TW-CABLE and tell ‘em! Excited for the premiere of Smurfs 2 today! Can’t wait to see what Paris looks like through 3D glasses! Found a smart Kickstarter idea for a book/film about a mute boy &amp; a secret society of clowns. Sounds rad. Support: http://t.co/QTIF4lHa4D “@MattTni: settle a debate. Top 3 numbers: \"Santa Fe\" \"Skid Row\" \"Aquarius.\" Who wins? A delicious dinner is on the line.” Skid Row fosho. Ug! Autocorrect bowls chunks! A big happy birthday to my best friend, @EdAlonzomagic. Hope your year is filled with magic, and by that I mean well paying magic gigs. One of my favorite charities, @FoodOnFootLA, has the chance to win $10,000. But they need your votes. Represent: http://t.co/hN6fhITvI4 We took off the geofilter for that vid I tweeted earlier. World, try again! Check out this exclusive #HIMYM video that just premiered\nat #ComicCon … “Kids…” http://t.co/h1CYcxtQmC (via @HIMYMProd) Here’s a candid pic of the HIMYM cast before going onstage at ComicCon. Love this gang. http://t.co/im23dbFSBE And I must say, the dude that requested the highest of fives, that had multiple break away costumes, was absolutely awesome. That ComicCon panel was super rad fantastic! Our fans rule! http://t.co/T1iJjGYr8V We’re heading to our ComicCon panel, y’all! http://t.co/aBUllKnYcY Best Robot Gymnast Video EVER: this one lands a quadruple backflip!\n\nhttp://t.co/2vhwA8cmWH The ever sexy @CobieSmulders getting dolled up for a HIMYM photo shoot. A big one. Should be cool. http://t.co/iNB87Tg3h7 As HIMYM nears it’s conclusion, I urge everyone to follow @HIMYMProd. Lots of exclusive content, candid on set pics, etc. Good times. “@BaileyGehring: @HIMYM_CBS @ActuallyNPH we love HIMYM!! ❤ http://t.co/ANgtkL2J5m” — Best onesie ever. Took the twins to their first circus yesterday! Thanks to @RinglingBros and Kenneth Feld for creating such an impressive spectacle! How sad to read about Cory Monteith passing away. What a shame. He was a lovely, kind, talented guy and will be missed. RT @TheTweetOfGod: Even I think Zimmerman was guilty, and I'm an old white guy. Love this: a Kickstarter to create awesome trophies for everyday occurrences. Hilarious video, too. http://t.co/SdhCw1en5G Had a grand time at @AbsintheVegas. Question: Wire @TonyHernandez and I not taking this tightrope act on the road? http://t.co/VNQr67kpkc In Vegas for Smurfs 2 press junket. Sushi dinner at Wazuzu @ the Wynn, late show of @AbsintheVegas, cuz it’s awesome. http://t.co/hYZOy6GOgD Can’t believe it - just dropped the kids off for their first day of preschool! So quiet in the house now. What to do?#sleep #drink #freedom How I Met Your Mother, season 9 has officially commenced! We had our first read thru today. Can’t believe it - the beginning of the end. Happy 4th of July, everyone!\n\nHope your day ends with a bang, but the good kind, not like these people:\n\nhttp://t.co/Ri4eaphehZ I’m a little obsessed with @RuPaul right now. She’s both historic and current. And gorgeous. A modern trailblazer. #shebettawork I’m not saying that if you follow the account I just mentioned you could possibly be… rewarded. I’m just… typing. A special rose for #goodwingames fans: \n@ -… . -. —. —- —- -.. .— .. -. .-. .. .—.\nThe hidden location has yet to be found. #ushouldawatched Don’t drink &amp; drive this July 4th weekend. Use Uber instead - it’s rad. Sign up, use code ‘8lf32’ and you’ll get $20 credit. You’re welcome. I directed the series finale of The Goodwin Games (on Fox) and it airs tonight! Super proud of the episode, and the cast. Please watch! My thoughts go out to the family of Sarah Guyard-Guillot, an amazing performer in KA who died last night. Original cast member. So sad. So stoked for the opening tonight of One, the Michael Jackson Cirque show opening at Mandalay Bay! Bring on the awesome! #crotchgrab I was just sent this awesome video from YouTube. Made me smile. It’s been a good week. http://t.co/2FPwoe6CTD\n#ProudToLove “@FutureOfTheWWE3: @ActuallyNPH Are you watching Big Brother tonight?!?” Umm, only absolutely..! Join my live chat today with @goldderby at http://t.co/nnqdnHHsh9 at 3 p.m. PT. I’m gonna talk about all kindza good stuff! And Prop 8 was dismissed?!?\n\nHuzzah!\n\nChristmas comes six months early this year! (Less one day…) DOMA-it-just-lost-O\nMr. Roboto!\n\nSo, so happy for Edie, et al. Fingers crossed…\n\n#equality @LynNever - None, Lyn. Just had a good time at a bar. Yeesh. Holy wow! Just had a drink at the most amazing bar in Hollywood called No Vacancy. Theatrical speakeasy, sexy bordello vibe. You must go! Having an outrageously delicious dinner at Trois Mec. Get ready: food porn to come! (Check out @NPHFoodPorn) “@deylamariah: tomasitas is the most over rated restaurant here!”  You’re wrong, and I will fight you. “@Asmaa_NPH: I did my homework today and it was about YOU and how the media portrays you and I got a distinction” Well done. I’m flattered. Just left Santa Fe again, after more Million Ways filming. Oh man, I love New Mexican food. Best in Town: TOMASITA’S. ¡Delicioso! Great article in the NY Times today re: immersive theatre. First Sleep No More, now The Great Comet, Here Lies Love &amp; Murder Ballad? Yay!! Proud of Nik Wallenda for his epic high wire walk. Less proud of agreeing to drink a shot every time he said ‘Jesus’. I can’t feel my face. “@Charliebyrne14: @ActuallyNPH do you follow 69 people on purpose ?” 😁 I just saw that I have 6M twitter followers. Holy shit. I guess I need to start watching my language. Met nice people and had a great time just now at the Global Smurfs Day event at the Grove. Yes, you heard right - it’s Global Smurfs Day. Hope your 1st day of summer was great! If you’re in LA and looking for diversion, check out http://t.co/GP12jBgzNw. Food &amp; flicks outdoors! Had a nice actual birthday on Saturday. Thanks, @TheLondonWeHo for providing the great good times.… http://t.co/Oj6rJxUtms Never mind. I’ve got the two best gifts in the world sitting right in front of me. http://t.co/XQnhaJ4k6L For my birthday, I only want one thing for the world: lots of presents for me. And good ones. Well thought out gifts. So… tick tock. Oh, wait. Scratch that last tweet. I thought turning 40 would bring enlightenment. It doesn’t. I’m still pretty dim. So weird. I woke up this morning with infinite wisdom. Not sure why… Watch the amazing director and exec producer Glenn Weiss, in the truck, calling the shots for the Tony live TV feed: http://t.co/Dq3wxDEoWH Umm, yes please.\n\nhttp://t.co/lpebD6KkNJ Funny, draggy Downton Abbey spoof.  And, @DavidBurtka has a cameo! http://t.co/LVyT43wk1W I just love @Colossal and the amazingly creative art he curates. Check out these phenomenal origami creations: http://t.co/B2YBUJbPqI But truly, last night made me love theatre and revere the amazing and tireless performers working so hard each night. ‘Twas a great time. Really, Daily Mail?!? The N-word? That’s your story?!? I would NEVER be so disrespectful and frankly, neither should you. And while I’m at it, thanks to everyone that watched this year’s Tonys. We had the highest ratings in YEARS! Much, much appreciated. Also, thanks to @emmgroupnyc for hosting our post show shindig. And for @thegeneralnyc for the giant doughnut cake. http://t.co/9mwuT5lIpy Such fun last night hosting the @TheTonyAwards. A BIG thanks to the 121 performers from every show that played along. You’re remarkable! Please watch @TheTonyAwards tomorrow. Everyone works so hard on Broadway. I’m jumping through hoops to assure a good night. #OneDayMore Just saw Kinky Boots on B’way. Infectious show, tons of fun, made me cry. Cast is stellar, and @AnaleighAshford is a star! New York is the best! After Tony rehearsing, I had a fantastic meal with friends at Uncle Boons, comfort thai food in Soho. #delicious Just arrived into NYC! Get ready, @TheTonyAwards, time to get to work! #OneWeekMore I’ve re-newly fallen in love with green chiles. They put them on everything here in NM: burgers, eggs, cereal, pudding. I’m obsessed. “@tropangadam: @ActuallyNPH is hosting the tonys and the emmys! double yay!” Look at me. Pulling the Bi-fecta. Pssst, listen: today is @Davidburtka ’s birthday. Let’s hide and on the count of three jump out, surprise him, and sing! One, two, THREE! Had an absolutely wonderful and creative time with the kids at the Santa Fe Children’s Museum. One of the best we’ve ever seen! Loved it! Tired legs from a dance rehearsal for a big production number. How did I end up dancing so much? My twins have taken more lessons than me! I just can't believe the scale of that tornado that touched down in Moore. A mile wide?!? My condolences go out to everyone affected. Hey, check out this pocket watch! &lt;tick tick tick…&gt; YOU ARE NOW HYPNOTIZED. WATCH THE #GOODWINGAMES TONIGHT ON FOX! PASS IT ON! &lt;snap&gt; Bwaa! Dude! Tomorrow night, on Fox, is the premiere of The Goodwin Games. Please watch. I directed an episode. Great show. I promise. Santa Fe is filled with middle aged people who don’t care what they act like. The good kind of mid life crisis. It’s oddly inspiring. Free ep of the #goodwingames on hulu NOW! It’s by the HIMYM guys so you know the Q in the title, if it existed, would stand for quality. Shooting scenes for @SethMacFarlane ‘s awesome new western film. You won’t believe what I’ve done all day. #physicalcomedemented Season finale of HIMYM tonight. I promise you, it’s well worth watching… #watercooler My mom gives the best hugs. Happy Mother's Day! http://t.co/MuAmp1dPb5 A gigantic Happy Mother’s Day to @GladSheila - an amazing parent, person, and friend. Super proud that she’s my mom! Excited for the #survivorfinale tonight. I’m still a diehard fan. It’s been a crazy season, can’t wait to see who takes the title. Forgot to get a gift? Send your mom a #MothersDay e-card from yours truly, and help fight cancer!  http://t.co/UhoUkFO2Qp “@danielzev: @ActuallyNPH look what I found. http://t.co/Cpl6EvLgqj” — LOVE this!! Tonight’s new How I Met Your Mother is, from what I hear, laser tagalicious. At the Mayweather fight at the amazing MGM in Vegas. Never seen a fight up close like this. Undercards are unreal! http://t.co/INoiNbuq9E I got sandwiched between Elton John, Rod Stewart, and @MrsSOsbourne and I loved it! Amazing night for #racertoeraseMS http://t.co/OA4gpewTXH RT @mstockett119: @ActuallyNPH don't retweet this #pointlesstweet Artistic photo during work out w/ super trainer @Jeremy_Cisneros at the @Equinox in Woodland Hills. #12reps1pic http://t.co/Jl7TKIbKaa The fantastic @Colossal has found another gem. Check out this mind altering short film. It's like a magic trick! http://t.co/Af0gP5Smky Pacific Standard timers: put down the sushi and turn on HIMYM. New episode in 2 minutes! Barney’s bachelor party! Get up in there! Everyone from the Mountain time zone (except (weirdly) Arizona (?)), new HIMYM in 3 minutes! Grab a chair and grab your stuff - it’s great! East Coast: new How I Met Your Mother, in seven minutes. Hurry! New HIMYM tonight! It's Barney's bachelor party: expect grand adventure and a lot of stripper pole. And yes, that's a euphemism. Bravo, @JasonCollins34! Thanks for stepping up. For standing tall. And at 7 feet, that's saying a lot. At our great friends @BeckyBaeling &amp; Kris Lythgoe’s murder mystery wedding. The game, as they say, is afoot! http://t.co/YP8umF80c1 I’m officially on Instagram. My name (title? handle? nickname? alias? moniker?) is: instagraNPH. Come play! Just watched the @zachbraff video for his Kickstarter movie. It’s great! I want to be in the cast. But only in the @donald_faison part. My vote for Best Dad Ever (via @colossal): http://t.co/BE8pdyRi0N Love NY theatre! Macbeth tonight with the eternally talented @AlanCumming, last night Here Lies Love @ the Public. Immersive and amazing! Late night in NY. Lovely dinner with friends Mark &amp; Kelly. Drinks at a great spot, Wise Men. In the lower east side. Great times. RT @Bluesfan2181: @ActuallyNPH this helped me make a little more sense of it all... Well said @pattonoswalt http://t.co/SKockB6O5d I wasn’t making light in my last tweet. It’s all just so random and sad. “@mindmessed: Violence is never random; chaos never truly unpredictable.”  It is if you’re the poor person standing next to the bomber. Sending all good thoughts to Boston, after the madness. Makes me so sad. So crazy to think that violence can happen so randomly. Orphans is rad. Long live @ABFoundation. Can’t say enough about Cinderella. It’s the new Wicked. @LauraOsnes is perfect. The whole cast is! Bees seeing lots of B’way theatre: Hands on a Hard Body closed too early. Motown was a lot, and yet not. Cinderella was spectacular. Just went to the @PointFoundation Awards hosted by the magnetic @davidburtka. Great night, amazing organization. Check it out. Life is good when @DavidBurtka serenades you with Journey’s Open Arms (thanks, @JessiesGirlNYC for kicking 80s ass) http://t.co/KxAEqlSEtC Thanks @sleepnomorenyc, for a true once in a lifetime. More so, thanks to @Davidburtka. He is the most magnificent man in the whole world! The gang from @sleepnomorenyc created an adventure just for me. 6th Floor 1-on-1 beyond description. Finale: another massive surprise party! Rest of the night was a treasure hunt blur. Multiple clues at three theaters, tequila at Toloaché, then whisked away to… @sleepnomorenyc ! Another b’day clue! This one led me to @TommyHilfiger where we got to-wait for it- pick out fancy outfits for… later? http://t.co/7cWOvsmFJJ “@ReaganYelton: Watching Malcolm in the Middle @ActuallyNPH has grown SO much!! 💚 #transformationsaturday” — Err, umm… “@Nevalc: @actuallynph @davidburtka How about tweeting some pictures!? :))” — Done: http://t.co/vXV3VYTJ4O Complicated clue on bathroom mirror lead me to lunch at Babbo! (where @Davidburtka used to work) Delicious as always, @Mariobatali. Thanks! I need your help! Barney and Robin’s relationship is at stake! Vote here: http://t.co/LPJnG7wXOx This adventure has been truly epic. But nothing tops tonight’s dinner: Masa, in the Time Warner Center. Best sushi meal ever. EVER. Spent the day at the Animal Kingdom and mostly Epcot, drinking around the world. After Maelstrom, handed a clue. Solved puzzle, off to: NYC! Honestly? Disney is the best. Bar none. Every moment of this leg has been surreal and perfect. Thanks, Mickey! Now: what’s next?? Wow. Went straight to Disney World, rode rides, and where did we sleep? Let’s just say, I was the king of my castle! http://t.co/jj2W7BR6gC “@beau_birtwistle: My dad said if Neil Patrick Harris retweeted this he’d buy me a new car, @ActuallyNPH I need your help!!” Pay up, Pop. Room service woke me with coffee and a clue! Complicated, but I solved it. Drove to airport and boarding a flight to: Orlando! What’s next?? Spent a wonderful night in a suite at the @DriskillHotel. Champagne, romance, and two episodes of American Horror Story: Asylum. #goodtimes Drove for a bit on rural streets, ending at a restaurant called The Salt Lick. Best BBQ I’ve ever had in my life! http://t.co/ATK9uACCS5 Flew from DAL to SAT. Leaving plane, attendant gave me a clue &amp; a GPS. Rental car led to my own private ropes course! http://t.co/i8lKITOogj So last night I had a wonderful home cooked meal with my family and got some rest. Woke up, went to the airport, and am now in Dallas?? Hey, Barney and Robin fans: vote to make our coupledom official, awesome, and a win!  http://t.co/T41IAmGKKU I’m in The Game. Got pulled over by a cop, instead of a ticket he gave me a clue! Sent me to lunch: Frontier Burrito! http://t.co/hnSh6C0TEC More bday madness: took a bus thru Laughlin. Won $215 on a 1¢ slot-thanks, Sex in the City! Drinks at dive bar in AZ. Overnite train to ABQ. “@jojocdngirl: Sometime during this treasure hunt we better get some food porn!” Done - dinner at @RobuchonLV: http://t.co/DjvvOnpKja “@BTRfan_nr1: @cirque @davidburtka Haha sounds like you're having fun ! :D\nDid you take some pictures ? :)” — Yup: http://t.co/wh12FPb4DL “@PilsterJr: @ActuallyNPH Tweets some pics about it please.” — Done: http://t.co/IUmOaKzoVW @1trickponee: If @ActuallyNPH acknowledged me, I’d victory dance for 48 hours. — Annnd, GO! RT @96Becky: HAPPY 9th ANNIVERSARY, GUYS!!! I hope you have a wonderful day :') Love you! &lt;3 @ActuallyNPH @Davidburtka #BestCouple ht ... And FYI, if you’re in Vegas and want to get your acrobat training on, head straight to @ShineFitnessLV. Amazing facility! I’ve dug up locked boxes, driven to Vegas, trained with @Cirque folk, eaten amazing food, and now am on a train to ?? @Davidburtka rules! My b’day is 6/15. @Davidburtka threw a surprise party for me on Saturday -blown away. I’m now on some lengthy treasure hunt that is unreal! Happy Easter, everyone! Have a great night, and a word of advice: try not to put all your eggs in one basket. I’ll be attending the Magic Castle’s 45th Annual Awards show on 4/7. Open to the general public. Check http://t.co/hVz2xJftcb for info. Just shot my last scene of HIMYM’s 8th season. Enormous thanks to the writers and dynamite crew for their hard work. #bestjobever AT&amp;T wifi is killing me! Had so many problems! How can our Internet be so spotty? How?!? Curses! #shakingmyfist Ok, I’ve done research and narrowed my minivan choices to two: Honda Odyssey or Toyota Sienna? Is the Odyssey worth the extra $$? Love the new @Equinox gym that just opened in Encino. Best gym in the land, now even closer to my casa!  SWEET!  I mean, SWEAT! Super fun getting slimed w/ Sandra Bullock at the #KCA. Less fun ruining my iPhone as I text with goopy fingers. http://t.co/KgW020zKEj Are you a @Cirque fan? Don't miss this event: One Night for One Drop http://t.co/egmw4myigH Watch online! 237 artists from 20 countries! Wowed tonight at the LA Gay &amp; Lesbian Center Gala (@LAGayCenter) by the org, and honoree Amy Pascal’s amazing speech. http://t.co/DgR6bS4ZM4 For those that may have missed it - six words: Horror. Ghost. Puppet. Short. Film. Kickstarter. http://t.co/ofw70eDnNO I may be partial, but I'm loving this new song performed by @DavidBurtka, who I also happen to love. http://t.co/Hdwrh1s01O Seven Incredible Marble Machines by Paul Grundbacher. Via @Colossal. I loooove this stuff.\nhttp://t.co/7Mm5To2gOl A new How I Met Your Mother is on tonight! Please watch! From what I hear, it’s a hoot. But I hear owls a lot. So, grain of salt. New Pope news soon! You might want to follow @TheTweetOfGod for all papal updates. He has an “in”. Oh, snap! Nothing To Hide is on Goldstar?? Reduced price tix to the best magic around? Order quick, yo: http://t.co/O4xVNpvXD1 @wrclark1439 Dude. You’ve tweeted the same f’ing thing to me 150 times. Bad form. The answer is no. Looking to buy a brownstone in Harlem. Figure someone on Twitter might wanna sell. Any takers? “@MVoltaggio: Join @johnvarvatos and #stuarthouse give hope to abused children. Text healing to 80888 to donate, its that easy.” Yes, chef! Celebrated the 70th b’day of @Davidburtka ’s father Dan at Polish Village in Hamtramck. Best polish food in MI! http://t.co/sHEBOBFzkp Unbelievable! Every one of these objects is made of paper: http://t.co/dNTsqJrX63  (via @Colossal) One of my favorite wineries, Slight of Hand Cellars, released their 2011 Conjurer. Delicious, with a fetching label: http://t.co/EM3vfy4wDg Just finished a truly magical week with the family on the newest Disney cruise ship, the Fantasy. Ran into this guy: http://t.co/eJpr0v5hWD Please support this creepy ghost story puppet film on Kickstarter. Kevin is super talented and come on, it’s puppets! http://t.co/ofw70eDnNO My friend @jeffprobst has a NY TIMES best seller, STRANDED, a kids adventure book (ages 8-12). Survivor for kids! - http://t.co/QYsMeIVtfR The Nat Enq is cray cray. We've never had a wedding date, just engaged (Prop 8 and all). We're on a cruise as I write. He's rad. All good. Thanks @LAEyeworks! Your sunglasses survived a snowmobile overturn, but were no match for my son Gideon. #RIP http://t.co/Ux8mfPu6lI Today is International Sword Swallowers Day. I’m sure there are lots of jokes there, but figured the legit carnies deserve a shout out. I’d show what it’s like to act on the set of HIMYM all day! #ifihadglass RT @magiccastle: Calling all Magician Members! You have ONE WEEK left to make you nominations for the AMA Awards! Vote here: https://t.c ... Check out my beau @DavidBurtka host #CelebrityDish on Sunday at 8pmET on @CookingChannel. He profiles great restaurants owned by celebs! Look way arrived on set: Valentine awesomeness, via @DavidBurtka. http://t.co/v1MA5X4S Happy Valentine’s Day! Whether you’re in a relationship or not, make sure to tell those close to you that you love ‘em. Justin Timberlake is very, very popular. http://t.co/H69xDheX Some chick has a dress made entirely of razor blades.  I feel bad for her nipples. #Whaddup http://t.co/fFaJHWJP I had no idea Christian Bale could play the guitar and sing in spanish. What can’t that guy do??? Prince: heavy on accessories, light on vocabulary. I thought there were wardrobe restrictions, Carrie Underwood. I kept staring at your ‘puffy’ groin area during your entire number… Kelly Clarkson has one of the best voices in the history of ever. The Black Keys keyboardist wins best dressed.  End of discussion. Rihanna is gorgeous! But I thought that song was about Chris Brown, not some guy in a black knit ski cap. I wanna be Adam Levine’s clothes. You think Mumford &amp; Sons are pissed that the stage is still soaking wet? About to go onstage for the Grammys! This is my view from backstage. http://t.co/fmeabxhU Loving @Rupaul and the new season of Rupaul’s Drag Race! Can I get an Amen up in here?? #TeamDetox RT @whedonopolis: @feliciaday  Pls RT Robin Sachs (#BUFFY )  died &amp; his sweet dogs need a home http://t.co/X828maWq More info, conta ... Check out these UNREAL paper sculptures from artist Li Hongbo. Mind-blowing. I want one! http://t.co/TaSfi5rp Wouldn't normally say yes to a promoted tweet, but this @Kia vid is actually cute!...and has #spacebabies! sponsored http://t.co/lyW0cjBW My main squeeze @DavidBurtka is one of the main stars in a new feature film called Annie &amp; the Gypsy. The new trailer: http://t.co/zDcbm87R I’m a lucky guy. @Davidburtka made this for dinner: grilled fish, fresh produce from the garden. Delicious. Boom. http://t.co/wFH39xtk New HIMYM on tonight. Please watch. Here’s my simple pitch:\n\nIt’s Robin Sparkles 4, y’all!!\n\nEnjoy. Congrats Ravens! Great game, so fun to watch. Although I think someone picked my pocket during the blackout. I suspect @MrJohnCryer… Thanks goodness the lights are back on and the game has resumed. It’s a real nail biter. Man, Beyonce’s show was powerful… All the lights are out!! It’s pandemonium!! Thank god we have out Beyonce finger lights! http://t.co/JxUKr27i I thought Beyonce crushed it. Amazing. Though I did feel a bit bad for the poor person getting flogged by her hair at the end… Can’t wait to watch the @NolaSuperBowl. I’ll be talking about it live on @CraigyFerg tonight. Totally not pre taped. http://t.co/YEsqEtJE Perhaps my favorite account of someone’s experience seeing Nothing To Hide at the Geffen: http://t.co/nLwBlpiS @derek_del @whoishelder “@logibear__: You probably won’t answer this tweet.” You’re probably right. New Orleans sunrises can be pretty awe inspiring… http://t.co/eY9S1HqJ Best news ever: @DavidBurtka just arrived into New Orleans! Let the debauchery begin in earnest!! Having a lovely dinner with the M&amp;M’s gang, hosted by the legendary @ChefJohnBesh. Chocolaty goodness. @betterwithmms http://t.co/89jLt6wc Last night was I blur. Dinner at Herbsaint? Jazz bar and whiskey til 3 am? This photo was on my phone. My head hurts. http://t.co/VpVbsujZ Lunch in NOLA. Restaurant: Lüke. Happy hour. 50¢ oysters. Boom. http://t.co/InvyQxm8 Oh, and the Sheep Ricotta Gnocchi with Lobster. That, too! (Thanks, @RevolutionNOLA) http://t.co/cq46QXnw Dinner: @RevolutionNOLA. Outstanding. Best dish: Gulf shrimp and grits. Just wow. http://t.co/5fqUVhVt Drink of choice at the moment: Sazarac. This from the Carousel Bar. Best I’ve ever had. http://t.co/pHmxKRl0 Unbelievable lunch at Mother. Seemed only appropriate, given the title. Delicious Po’ Boy: http://t.co/353HsUD2 “@LewisGoose: You can also email the Scouts to give your opinion at nationalsupportcenter@scouting.org” Well said. Interesting: the Boy Scouts have created a line to call for your opinion on keeping the ban in place. CALL 972-580-2330 and affect change! Just arrived into New Orleans. First time. Bring it. Presto! $40 tickets to any performance of #NothingToHide through February 10. Saw it? Tell friends! Use code NPH. http://t.co/NhMzqvmW Wondered how Neil’s Puppet Dreams' opening sequence was created? Check out the amazing gang from Digital Twigs at work: http://t.co/UU8NyJCm Come on, Boy Scouts, do the right thing. Diversity should be honored and valued. There should be a merit badge for it. Looking forward to presenting w/ Amy Poehler today at the #SAGAwards. I bet we ignore the prompter and just make out with each other. Again. Check out the entire meal, dish by descriptive dish, tomorrow on @NPHFoodPorn. Heavenly, decedent stuff. ‘Night. Last dish was 1 of 9. Tuna, yuzu kosho squid ink tofu cream, mizuna, wasabi pea, sesame, bok choy, snap pea, avocado, green onions, ponzu. Crazy amazing meal. Thank you, @wolvesmouth. If you love amazing food and a memorable night, track him down! http://t.co/fRNMZzmk I’m eating an unreal meal. It’s a secret, exclusive underground supper club. Called @Wolvesmouth. Artistic. Outstanding. Details to come. Just told that the Bollywood song I sing on Neil's Puppet Dreams is on iTunes! All your bovine dreams will come true: http://t.co/D2WTtQc6 The final episode of Neil's Puppet Dreams is out: http://t.co/Gg1uzgQo Titled 'Bollywood'. This one is my favorite. Udderly entertaining. When sculpture meets magic - the unbelievable art of @jontyhurwitz : http://t.co/YZ08qBMf I want one! A brilliant speech today by @BarackObama. Inspiring stuff. I’m very proud to be an American. Currently watching and loving the @LadyGaga concert at the Staples Center. Maybe the best concert ever. So inclusive and amazing! “@MrSilverScott: @ActuallyNPH: u comin to the castle tonight?” No Magic Castle tonight. Hope you had a blast. Magic is the coolest. The ride continues. So proud of #NothingToHide. Magic is rad. http://t.co/S7kkhJre If you wonder what it’s like to be abducted by aliens, check out the new Neil’s Puppet Dreams. http://t.co/Lx9GNU8Y I may get probed. New HIMYM tonight! First one of '13! It’s a big one: we are finally revealing who the mothe… No. No we’re not. Still funny though. Do watch. If you watch Iron Chef America tonight, you’ll find @Davidburtka and me at the judges table. Two great meals. I’m still full. I just wanna say, @JoshGad is hilarious. Makes me laugh and laugh. Love his comedy. Truly. IRIS has expert direction, precision choreography, stellar visuals, and a remarkable cast of brilliant performers. Bravo! @Cirque Just saw the @cirque show IRIS. Once again, blown away. Can’t believe it’s closing on the 19th. One of the best shows I’ve seen. Go go go! Just watched TVs Stars In Danger. Highest marks go to @BeckyBaeling for her divine commentary. I love Becky. She’s rad. Congratulations, Noah St. John. Your passionate recitation made my day, and is an absolute must watch: http://t.co/DLyrduBC Now presenting: Dream Bump, the newest episode of Neil's Puppet Dreams! There may be a cameo by a True Blood stud. http://t.co/fqyI0TJN \"@Mongo22407: Where can I see some of the previous works of Neil's Puppet Dreams?\" Glad you asked, Karl: http://t.co/z0LGM0fP Also also, a brand new episode of Neil's Puppet Dreams will be released tomorrow! 'Dream Bump'. It's a good one. @Davidburtka may even sing! Also, I must say I'm very excited for the Super Bowl. I love football - look forward to it every year. #noagenda Awesome News! We've extended #NothingToHide again thru Feb 3rd! Read about it: http://t.co/oquvvJIb Congrats @whoishelder @derek_del Happy 2013 from the west coast of the USA! Yahoooo! Hope this year is infinitely better than ‘12! Let’s DO this! I’m looking forward to 2013. My New Year’s Resolution: underindulgence. Yours? Happy Last Day of 2012! I hope you spend at least a small part of your day in reflection, and a large part of your day in ebriated. Harper is, as usual, calm and understated. http://t.co/2fGMlpez Having a wonderful night with @TheJimmyCarp and his family for Xmas dinner. Gideon is rocking a bow tie. http://t.co/55uUVKiy Here is @Davidburtka enjoying his favorite, much needed, and well deserved gift. http://t.co/6ocku8x4 Ms. Harper likes Mr. Potato Head’s fashion sense. She is quite the looker, but I think it’s a bit shortsighted. http://t.co/ZJ9WOehH Up until 2am constructing a table with wooden trains for Gideon and all he wants to do is play with a broom. #MerryXmas http://t.co/9O4WAtuH “@getdough23: Ur the best. I watched you from malcom in the middle to how i met your mother. You're one of my favorite actors.” Umm, thanks. Site’s back up. Sorry. Go buy tickets for Nothing To Hide. Yay!  http://t.co/m4tZHNg4 Ug. My previous link directs you to a message that their server isn't working..! Maybe this IS the end of civilization! Please hold... On a related note, if you're looking for a last minute Xmas gift, may I suggest tickets to an awesome night of magic? http://t.co/m4tZHNg4 Nice! The play I directed, Nothing To Hide, just got a great review in the NY Times! http://t.co/8MELyCwH  What an amazing early Xmas gift! Latest episode of Neil’s Puppet Dreams - http://t.co/a7pw7iES  Title: To Catch a Puppeteer. Enjoy! There’s an awesome, hour long HIMYM on tonight. Lots of questions answered. Please watch. Please enjoy. Please giggle. Feeling so so sad for all involved in the Connecticut shooting. Deeply horrible in so many ways. As a parent, almost hard to even process. Tomorrow is the last day to vote for @peopleschoice. If you could vote nonstop from now until then, I'd appreciate it. http://t.co/7dBlZIMZ Happy 12/12/12 everyone! Hope something exciting happens today. The same number 3 times won’t occur again until 13/13/13. So take it in. Loved listening to @HowardStern interview Tan Mom this morning. Hilarity! Howard, you’re amazing. Episode 3 of Neil’s Puppet Dreams is now live! Titled ‘Restaurant’. Hope you get a chuckle or two. Enjoy: http://t.co/VviAkSN3 Ah, the holidays. I’m trimming the tree, decorating the house, and marveling at how f’ing glitter manages to f’ing get f’ing everywhere! Check out my good friend Asher Monroe’s new video. He’s easy on the eyes AND ears! http://t.co/KjpfgvbI Still can’t believe I just hosted the Nat’l Tree Lighting Ceremony. A true once in a lifetime. Fun, too, to stare at the rest of the crowd. David and I are enjoying a sneak preview dinner of @bryanvoltaggio’s new restaurant Range. Holy OMFG, it’s unreal! Details to come. “@meowfeb1988, I was just joshin’. I like to try and sound caustic by using 1930’s slang and words like ‘beeswax’. “@MaruDelGaizo: barney 's disappointing lately. What are your comments about that?”  …wait for it… “@meowfeb1988: what happened to keeping these posts on @NPHFoodPorn ?” What happened to you minding your own beeswax? Final stop on my DC Dining train: Izakaya Seki. Delicious, true Japanese meal served by a father/daughter duo. Great sake, too. ‘Night. Next stop on my DC food journey: @TokiUnderground. Sake, dumplings, tofu, and utterly delicious ramen. A must go. http://t.co/VEqFAxrA Dining my way through DC. 1st stop: @Graffiato. Delicious pizza and the best brussels sprouts I’ve ever eaten. http://t.co/UbjkxOy6 RT @davidblaine: Isaac Newton vs. Rube Goldberg\nhttps://t.co/0iteIE1a Now presenting the second installment of Neil’s Puppet Dreams: \n\nhttp://t.co/C0xlit43 \n\nHope you dig it. Long live @NathanFillion! Rehearsing for the Assassins concert on Monday. Getting chills. It’s very cool to see everyone again! http://t.co/yxkzPF3v Truly amazing anamorphic illusions! Check this video out: http://t.co/6YzKmoP2 Loved loved The Mystery of Edwin Drood! The cast was inspiring, Rupert Holmes is a genius. Go see it! You get to choose who-dunn-it! I could not be more excited to see The Mystery of Edwin Drood on Broadway at the Roundabout tonight! One of my favorite shows ever! Just left Orlando after a stellar 5 days at Disney World with the family. Some of the best memories of my life. Can’t wait to do it again. Final extension of Delusion - get scared after your holiday shopping! Use (not so) secret code DELUSIONAL for discount. http://t.co/uKagJA3g An awesome review for Nothing To Hide, the show I directed that just opened at the @GeffenPlayhouse in LA: http://t.co/AXic7HYE “@cdubeau5: How did i not know till now David Burtka plays Scooter on #HIMYM I think the twins should show up next!” They already have… “@GeffenPlayhouse: Happy opening night @whoisHelder @derek_del! Tonight the Geffen has #NothingToHide http://t.co/NhMzqvmW ” Break legs!! Big news! The 1st episode of my new web series, Neil’s Puppet Dreams, is now live! Hope you enjoy. Check it out: http://t.co/R2sGvh7f I found out I’m last in votes behind Eric Stonestreet who’s not even nominated. Tweet: Neil Patrick Harris #comedictvactor #peopleschoice At Disney World for the 1st time with our kids. Peter Pan’s Flight, their 1st ride ever. They loved it. I just sat there crying. #proudpapa Happy Gobble Day, everyone! Hope you took some time to recognize all that you’re thankful for. And to eat delicious pie. RT @GeffenPlayhouse: #NothingToHide premieres in 1 wk! Sat 5pm &amp; Sun 4:30 performances added! @whoisHelder @ActuallyNPH  @derek_del  ... Hey gay gang: this magazine looks cool. Three days left to support on Kickstarter. I did. http://t.co/Xp0SCLfO This just in: @Nerdist released the behind the scenes of my web series w/ the Henson puppets: Neil’s Puppet Dreams! http://t.co/NGaTSXoV How modern: you can now just tweet 'Neil Patrick Harris #comedictvactor #PeoplesChoice' to vote. Would you? Maybe 75 times or so? Rad. It’s been a long, long day at How I Met Your Mother. Like, crazy. I’ll explain more later. http://t.co/r9RRvl5e In 50 hours, artist Jason Mecier created a Honey Boo Boo Portrait made from trash.  http://t.co/C2ANV7Pt  Amazing, yet so many jokes… Dudes! I got nominated for a People's Choice Award! FavComedicTVActr. I politely request multiple votes. Start here: http://t.co/IOwwOZWI We here at Delusion will find you and carve out your nightmares unless you grab tickets at http://t.co/ixgBjTOs NOW! They won’t last long! Delusion fans have spoken! Final extension tix go live tomorrow, Nov 15 @10AM! Six added nights! Tix at http://t.co/ixgBjTOs “@TheBwayLeague: The 2011 concert version of “Company” is out on DVD today! http://t.co/pLz4Bfm6” One stop holiday shopping. You’re welcome. New HIMYM tonight. Make sure to watch: we are going to reveal the mother! Ok, that’s a lie. But it’ll still be good comedy shenanigans! I'm not one to solicit, but a fellow puppeteer is in cancerous financial crisis. He was Snuffleupagus, for Pete's sake. http://t.co/XN1dwct3 “@sedwards76: @cirque I’ve only been to “O”. It was fucking amazing!” Agreed, potty mouth. But my fave was Nouvelle Experience. #DavidShiner Now I’ve got @Cirque du Soleil on the brain! Ok, question: what’s your favorite Cirque show? Bummed I can’t make it to Vegas tonight for the @Cirque premiere of Zarkana at the Aria. Maybe I should go see Iris instead. It’s amazing. Maine, then Maryland, now Washington.  Another great day for equality! http://t.co/pCjTV41K Yahoooo!  FOUR MORE YEARS! RT @derek_del: This morning I woke up with a giant election. New HIMYM on tonight! If I were you, I’d watch. Barney is such a dog… Please please vote tomorrow. And spend some time educating yourself to make informed choices. It’s your civic duty. Heee. I said duty. KG asked me to Cher this.  I'm happy to oblige: http://t.co/zwm2PK2t My ask: when (and if) Fox does (briefly) air Goodwin Games, make sure to watch and show your support. The talented GG gang deserves it. Way to go, Fox! You ceased production on the new show Goodwin Games before it even aired! I directed episode 5 - the show is hilarious. #boo Has a scary good time at @Blumhouse last night! Between that and @HauntedPlay, it’s great to see L.A. haunts taking it to another level! Happy Halloween everyone! Hope your tricking and treating gotcha lotsa booty! Here’s our family costume pic: http://t.co/lRJNkR59 My new passion project: http://t.co/aPCiUnA0  For those who like magic and having their mind holes blown wide open. Get tix quick! “@sclements12: what do ya think of my jack-o-lantern? http://t.co/LI0hZVsA” Love it! Well played, sir. Stay strong, east coasters. You’re awesome and resilient. Sending you good and dry vibes. Set your DVR’s! “A-LIST LISTINGS”, a new series hosted by the dreamy @Davidburtka, starts tonight! 8:00pm ET/PT http://t.co/SePGl3Oz Dudes! Just went through Blackout in LA. You must go through it alone! Terrifying, intense, a little horny. I loved it. @NYCHauntedHouse “@lindira: @ActuallyNPH Just curious, but what are you having your kids call you and your husband?”  David is Daddy. I’m Papa. In the Center Ring: b’day party pic of the swell circus dog show, courtesy of Kyra Sundance and her dog Jadie! http://t.co/3xCKllol Two publications have said that I have twin sons. Unless I’m a truly uninformed parent, I’m quite sure one is a daughter. #factcheckmate Happy Birthday to @gladsheila ,the most amazingest mom ever! I’m so proud to be her son. Thank you @KatyPerry for having @DavidBurtka and me at your frightfully fun B’day Bash at the @MagicCastle last night! http://t.co/DvUjJcP9 We managed to extend the sold out run of Delusion for three more days! Nov. 15-17. Order quick, they won’t last long. http://t.co/ixgBjTOs A really nice article about @popuppantry. I’m excited to be involved. http://t.co/gbY5hjhv So @PopUpPantry's gourmet dinners now include meals created by @DavidBurtka! Sign up at http://t.co/K4OAiSZS and tell them I sent you! Any awesome food trucks interested in feeding the sold out crowd at Delusion this weekend? If so, email info@hauntedplay.com. Word. Yay! Our run of Delusion is now SOLD OUT (cue ominous/awesome music by composer, Siddartha (http://t.co/vKgHiZHm))! Trying for an extension… Please join me in supporting @stelladot and shop their Breast Cancer Awareness collection benefiting @NoreenFraser: http://t.co/BiWh8VzK Hey Instagramers: the jackknife who is claiming to be me - actually_nph - isn’t. 22k of you should let him know. Gideon and Harper turned two yesterday. In celebration, they slept 13 1/2 hours last night! #bestgiftever Happy Ten Eleven Twelve, everyone! I'm also voting for this adorable lil' critter because he too believes in equality #ForAll. Cutest pic ever! http://t.co/4fmg74Fk I'm voting for President Obama because I believe in equality #ForAll  http://t.co/fWxO29dx http://t.co/UbzrcANF If my life weren’t random enough, I’m now at the Madonna concert at the Staples Center. Madness! Sorry, Elton. http://t.co/rcmFNILV If my life weren’t random enough, I’m now at the Madonna concert at the Staples Center. Madness! Sorry, Elton. http://t.co/sxXtDTHi Another aces review for Delusion: http://t.co/7skzru6u  This weekend tickets are sold out. Still a few left for Thursday. Don't miss out! Mu haa haaa! Dr. Horrible is finally on TV, tonight on CW! Live tweeting, too! http://t.co/u8aUHw4k for all the info. @drhorrible “@PalomaMcfly: @ActuallyNPH say something in spanish please!!!” ¡No! Pro: got to eat delicious, green chile filled New Mexican food at every meal for the past three days. Con: now my bottom stings. I got so high this morning. Um, I should explain: I went up in a hot air balloon with @Davidburtka. Serene and surreal. http://t.co/R430ZT9E Made it to the Balloon Fiesta! Hot air balloons everywhere! Amazing! I love New Mexico! http://t.co/ylJV2lLa Fantastic dinner at El Pinto with the whole family. Utterly satiated. It’s good to be home. Thanks, @ElPinto! Brought the family to ABQ for the Balloon Fiesta. Too windy! They called it off! Grrr..! Fingers X’d for tomorrow. Time for green chile! Trying to track down a circus dog act for a party at my house. Any one have any suggestions? Holy Crapinoli! Read this review of our horror show Delusion: http://t.co/eco0PrVa Happy Birthday, @KellyRipa! You’re an amazing person, a sexy wife, a wonderful mother, and a true friend. Congrats on your life! Be forewarned! Tix are scarce for Delusion. Thursday is LGBT night, supporting @TrevorProject. Scream and then flirt. http://t.co/ixgBjTOs Spent all weekend filming 7 episodes of my new @Nerdist show, Neil’s Puppet Dreams, w/ @Davidburtka and the Henson puppets! #bestjobever RT @JAGOfficial: Just survived @HauntedPlay! THE HALLOWEEN ATTRACTION TO GO TO! Great job @ActuallyNPH &amp; the whole team! Buy ur tick ... I love when cool people do cool things. My friend Marc (@pixeldandy) has an art show on 10/31 called Horrorgami: http://t.co/ICnG9ilP “@NathanFillion: Just saw #Delusion (@hauntedplay) and @ActuallyNPH owes me a new pair of pants. http://t.co/bzAhXh2C” You owe me a new rug! “@feliciaday: Dr Horrible reunion at Haunted Play. So fun!  @ Haunted Play: Delusion http://t.co/AF0X2R0B” Horrible, yet awesome. Me, a novelist? Look: http://t.co/KIS4uuBb  I’m so gonna author, like, stories. And write longerer sentences and stuff. Can’t wait! #Nobel Lets get #himym trending! HIMYM season 8 starts TONIGHT! Tell your friends, alert the media, set your DVRs! Or buy the new album! What whaaaat? http://t.co/mKxvWrhd Life is better when you are in Vegas and drinking rosé by the pool. Just sayin’. http://t.co/KOL4P2EN Love Las Vegas! Never left the @Cosmopolitan_LV and had an absolute blast. Sexy hotel, pool, staff, and guests. Can’t wait to come back! Having a blast in the pool at the @Cosmopolitan_LV  Sexiest crowd in Vegas! The staff here rocks. Good times. Had a great night. Ate dinner at Jose Andres’ secret restaurant at the @Cosmopolitan_LV called E. Only 8 seats. Wow! Food porn pics to come. I’m on @CraigyFerg tonight. Quick, watch! He tries to murder me! I’m in Vegas for the night! Where should I go? What should I do?!? Go see @JoshRadnor ‘s new movie Liberal Arts. It’s good and he worked super hard on it. It’s also on VOD! https://t.co/xjusfGsd. Gadzooks! Lots of stories online saying I want out of HIMYM. Not true! I’m still loving the show, loving Master Stinson. Season 8 will rock. The easiest way to get involved is VOTING. Check me out in @Rockthevote's #WeWill PSA &amp; then register to vote!  http://t.co/uD8QEMrW Ben Folds Five did a music video with the Fraggles! Two great tastes that taste great together: http://t.co/YrFIRcCh  Good get, @Nerdist Formulate your frightening fall festivities fast! First and foremost: Delusion. Fancy a fun informal film? Phuck yeah: http://t.co/0HBmmhNm Duuuuudes! We just won an Emmy for last year’s Tony Awards!  What whaaaat? http://t.co/pTDbWZcG This HIMYM monologue took me over seven years to memorize:  \nhttp://t.co/0DJVZbep If you love @JaneEspenson as much as I do, YOU MUST CHECK OUT HER AWESOME WEB SERIES NOW!!! http://t.co/ifBN2moi  Here, here! Great show! You’re not gonna believe it, but The Book of Mormon is funny! Like, hilarious funny. I bet it’ll be a hit. Congrats, tour cast. You rocked! On my way to the Book of Mormon opening in L.A.  Can’t wait for the funny!  Break legs, @GavinCreel I wish I could move to Vegas just so I could work out at this gym: http://t.co/r85766OG  I want an acrobat’s body! Loving the game show brilliance (or lack thereof): 11 Awkward Canadian Game Shows — http://t.co/Ke3HzgcD  Thanks, @mental_floss It's been 11 years since the 9/11 tragedy. Can't believe so much time has passed, and yet in some ways it feels so recent. #remember Please dig magic. If you liked that last tweet, just wait a few weeks. I’m about to blow your mind hole… People in L.A.: If you like magic, as I do, check out @Justin_Willman and his show at Club Nokia 9/29. He'll explain: http://t.co/AsYyLHlo Spent the weekend with the family at one of the most fantastic weddings I’ve ever attended. Good times. So much love. Another amazing display of artistry, courtesy of @colossal . This time: cut away art on actual leaves! Unreeeal! http://t.co/gi5MSASm Hi Twitterland. Sorry for my lack of tweets recently. Apparently I have babies and stuff. I'll try harder. xo Check out my good bud @ashermonroe in his new video #HereWithYou on @mtvbuzzworthy\n\nhttp://t.co/Q22eo25y Happy Labor Day! Or, since you’re hopefully not working, Happy LayBRO Day! It’s a full moon tonight. How ominous. A perfect time to start formulating your scary plans for fall. Might I suggest http://t.co/ixgBjTOs Take a look: One man, 100,000 toothpicks, and 35 years - An incredible kinetic sculpture of San Francisco  http://t.co/w2IT31cy “@francoberry: no way! Pixar Studios!!” Way. Waaaay. Oh man, I just toured what is perhaps the coolest place of all time! Bucket list moment. Almost started crying. #woody http://t.co/0yhncYzy I teamed up with Hasbro on Catchphrase - check it out! Don’t dither (or get DITHER in Catchphrase - it’s impossible)! http://t.co/nv429dvD Relaxing at the beach, sipping on a drink from my good friend’s company. Cheers! @drinkneuro http://t.co/HsrLDpOc From one Neil to another: You affected the history of the world, Mr. Armstrong. Few will ever achieve that. Rest in peace. “@istandabove_: Are you acting in it as well?” Depends on the night. Go and find out. :) Never know who you’ll see… http://t.co/JHB9R5iR I’m co-producing a terrifying interactive horror play in a 107yr old mansion in L.A! Limited tix per night. Check it: http://t.co/ixgBjTOs Guess who visited HIMYM just now? Olympic Gold Medalist @McKaylaMaroney ! Here I am pointing at her: http://t.co/UnSipt7R Good Morning! G&amp;H are rocking their rad high chairs, about to have pancakes &amp; bacon. A lovely day! @babybjornUS http://t.co/ppBB1mU1 We have had amazing meal after amazing meal in San Francisco. An embarrassment of gastronomical riches. Food porn pics to come… Crossing the bridge to San Francisco. Excited to perform in back to back variety shows for @SFOutsideLands later today! http://t.co/1LRiQMDE Bret Easton Ellis thinks gay actors can’t play straight roles. Totally unrelated, I thought Christian Bale was amazing in ‘Welsh Psycho’. Had a first rate dinner: @ScarpettaBH  Thanks for the deliciousness, @conantnyc  Food pics aplenty: @NPHFoodPorn Ah, this explains the new necklace and why my legs are so sore..! http://t.co/EB4IU53E Goodbye, Nice! I’ll miss you, fancy vacation! Take care, dream reality! Back to work, driving, and changing diapers. http://t.co/6fsZ0ZDO Two sentences I never thought I’d say: I just hung out with Bono and The Edge at Elton’s. All three are spectacularly cool. I absolutely love the views here in the South of France! :) #District14 http://t.co/9Fxwhhy0 I absolutely love the views here in the South of France! :) #District14 http://t.co/47cGDDjI Thanks to everyone who called and are supporting the firefighters who saved the Magic Castle. All 150 tickets sold! A resounding success! Less political: travelogue photos of a dog Maddie and her precarious and absurd situations. Enjoy. http://t.co/McieZy9T Federal funded bigotry from my home town, Albuquerque. This one hits home: http://t.co/JQ2IQjQk “@koppitegrrrl: my fiancee just died of leukemia, help me raise money for research with this link http://t.co/A97LttVI” Leukemia sucks. The Magic Castle is opening its doors for 1 night only to 150 callers to honor the brave firefighters who saved our club. 8/6. 323-851-3313 And now: Miniature people living in a world of giant food, by artist Christopher Boffoli. Made me smile. http://t.co/eVxRWmmd Super random question: does anyone have a contact number for an Air France person at LAX? I left something on a flight and need to find it! RT @Davidburtka: On our way to the family picnic!  So chic! http://t.co/kSLCjyZ0 Spending time with the Burtka family in Michigan. I love this part of the country. Great people, beautiful weather. Loving life. My favorite thing about Paris is the ‘double kiss on the cheek’ greeting. It is both intimate and disarming. I’m totally stealing that. When I am with @DavidBurtka, Paris is steamy and culinarily complex. When I am alone, Paris is rainy and underseasoned. #homesick Annnnnd, scene. Ug. What a day. I need a smoke. No matches. There's a lit candle, nice. What's with these cracks in the sidewalk? I'll use the stree - WHAM! You won't believe this! The mirror slipped out of my hands and is now cracked! Merde! What did I ever do to deserve all this?!? Damnit. Dropped the salt shaker accidentally. Salt is everywhere. Oh well. Not my day, I guess. At least this mirror is still intact... I just bought an adorable victorian hand mirror and a small crystal salt shaker - still filled with salt!  What luck! Found a cool antique store while walking around Paris. Weirdly, my umbrella won't seem to stay closed while I'm shopping in here. Oh well. So hard to tweet while I walk. And all of this construction on the street! Oh, wait. There's a space there under that ladder. Perfect. Happy Friday the 13th! Have a great day! Ooh, look - a kitty walking my way. Dark as night. Here, kitty!  Aw man, she went right by me... Looking forward to the new Big Brother tonight. But if there aren't any super hot people that are also cool, I'm out! #MajorTimeCommitment I was very moved by this story when I read about it at @tlrd, happy to hear its becoming a documentary. Support: http://t.co/gebM0oHR My great friend and outstanding UK magician @DerrenBrown is finally available to the US via Hulu. http://t.co/3athjTNS Run! Do not walk! Thanks to @PaulFrankTweets for the very cool kid’s clothes! Gideon really seems to love his shirt. http://t.co/JLZ1FGVM ‘Night. It’s late in Paris and I must sleep now. I’m this tired: http://t.co/z0AhZS5D Broadway costume designer Martin Pakledinaz passed away this morning from cancer. He was a wonderful man and will be missed. Had the loveliest of evenings/mornings with an even lovelierest friend in Windsor. Exquisite home. One of the gardens: http://t.co/QVMeXhIv Taking the train from Paris to London. Am I wrong, or is travel by train the greatest, calmest, classiest thing ever? http://t.co/aJw3IhTy “@daddycolebomma: @ActuallyNPH If I had to go gay for one person it would be you dude. #rockoutwithourcocksout” Love it. Pip pip! I’m in Londontown! The fanciest of pics to follow. Cheers! “@MrElliottJack: my dad said I looked like u yesterday…Does that make it wrong to have a crush on you?” Nope. Just good taste in genetics. “@SteakkWhisperer: @ActuallyNPH I like boobs , can i get a retweet :’)” Totally. Boobs rule. “@tabret2004: I found the other week you were gay. I refuse to believe it.” You’re wearing a tank top and a cowboy hat. You believe it. “@404_no_username: @ActuallyNPH my great grandma turned 95 today, can I get a whoop whoop?” Would she even know what that means? .@ireno9 the NE article is bunk. D and I are awesometown. No wedding plans because it’s not legal yet. All is good in our world. I think I just worked out next to @MarcJacobs at a gym in Paris. If so, he’s looking great and I’m a fan. If not, other dude has mad tats. Paris: Dinner at Kong. Waited an hour for our table, wine uncorked onto my pants, entree dropped on my jacket. Bad form! #tweetpercussions Happy 4th of July, everyone! Enjoy your BBQs, burgers, and freedom fries! Paris is not so exciting and romantic when you’re jet lagged and alone. #crankysmurf Good for you, @AndersonCooper. You're awesome.  http://t.co/sVvtzIXO Since I’m back in LA, David threw me a belated birthday party today! Thanks @Perrier_jouet for the champagne! I’m D-runk! I love my gym. Just going to @Equinox makes me feel healthier. Working out is hard, yet easy. Plus they supply towels, which I dig. This is what I yearn for my dreams to look like: http://t.co/WBJEYXTD My final meal in MTL was an epic sushi feast at Park. Thanks @ChefAntonioPark for your spectacular taste in food! http://t.co/7e8b36cY Goodbye, Montreal! I had such a great time - the sights, the food, the people - I think you might be my favorite city in Canada! .@athorn90 is still pretty f’in awesome for even doing the first costume. Respect. You, sir, are rad. “@Colossal: Ukranian street gymnastics: Parkour meets contortionism meets gymnastics meets whooooa. http://t.co/vNvzZeqb ” OUCH! I love me some dominoes action. Saw this video, called Starry Night by Vincent Van Dominough. Well done.  http://t.co/3PuDz5VN Dr. Will Kirby, the greatest Big Brother contestant ever (and my good bud) is now on twitter: @ReallyWillKirby  Welcome! It's been 18 days, @athorn90 .  Where's my emmer effing clown pic?!? Just saw a most creative and inspiring music video. Love it! Gotta watch:  http://t.co/B4UYjnHL “@SamEckhardt3: was this for HIMYM, or a movie role?” I'm still filming the Smurf sequel. HIMYM starts back in August. This was me tonight. I love my job! http://t.co/5O1ti7ts Ate a gigantic meal at Le Filet in Montreal. Super delicious! I took pics - food porn on its way. Check out the courses at @NPHFoodPorn I love artist Scott C. (@scottlava) &amp; his Great Showdowns pieces. A book full of 'em comes out soon (foreword by me): http://t.co/siIa75X7 “@eve1dissolved: need the leather sofa in your living room for my new home! Where can i buy one!” Restoration Hardw, err, totally custom! Mike Tyson is heading to Broadway in a one man show directed by Spike Lee?!? Sweet gods of comedy, now I have to host the Tonys again! And now a most disturbingly awesome video to get you through the rest of the weekend: http://t.co/SOsbrobn  Thanks, @TonySepulveda! Happy Father's Day to all the amazing Daddies and Papas out there, especially this one, @DavidBurtka: http://t.co/UmfvDhSP We had lunch at Park (enjoy the pic), saw the new Cirque show, Amaluna, then dinner at Au Pied de Cochon! Yum! http://t.co/GlJ81UzD Thanks so much for all of my B'day tweets! I had a spectacular day in Montreal w/ the delicious @DavidBurtka. I'm liking this 39 stuff! “@SweetThang444: If you don't have it, gotta get kinect disneyland adventures for the xbox. You will love it!” Gah! Must have! Other excellent birthday gift suggestions: puppets, skin pics, anything magic or Disney theme park related. Games. Or scotch. My last b'day gift suggestion didn't fit everyone's price range. Don't fret - you could instead get me this: http://t.co/r24cgeZD Congrats to my friend @DanBucatinsky whose hilarious new book \"Does This Baby Make Me Look Straight?\" is now here: http://t.co/U380k3qB My birthday is Friday, so if you haven't already purchased your gift(s) for me, might I recommend: http://t.co/fLjUVZiu My great friend is a survivor &amp; has started: Living With Breast Cancer NEW SUPPORT GROUP @ L.A. Gay &amp; Lesbian Center http://t.co/gL9kVSc3 More unreal art! Are you kidding me?!? http://t.co/Df8yERHN This art is unbelievable! Now I know what I want for my birthday: http://t.co/LXajV49O “@dcedillo: The guy sitting behind the Lion King head was unamused by the prank” He was my writer, the hilarious Paul Greenberg. “@NicoleTesta05: What do you say to a production of Blood Brothers with @Davidburtka starring with you?” Love that idea! Ok, off to set. Have a swell, twitterific day. “@ekwalsh416: How is it being away from David and the kids?” It's the worst part. Miss them like crazy. Thank heaven for FaceTime! “@Alexanism: how was it to perform with Ms. Patti LuPone?” She's brilliant, and game for almost anything. Love her! “@NicoleTesta05: Out of all the shows running on Bway right now, which would you want to be in?” One Man, Two Guvnors. Physical comedy gold. “@Tamster21: If you could of switched with any of the performers to do their number, which would it be?” James Corden. Physical comedy rocks “@don_vare: Do you get to hang out with trey and matt from the book of mormon?” No, they're too fancy. They shooed everyone away. “@amnosjenn: What was with the crowd surfing girl? And the man with the Lion King head!” I wanted some 'WTF, DVR back!' moments throughout. “@dmmolloy: Did you write any of the jokes?” Indeed."}