{"tweets": "@ihartbearz Could you please report this user to our enforcement team? https://t.co/Vw7HdY5aNF @DoDTickles 100% accurate. https://t.co/X9iK2YYOQx @DoublemgA We're absolutely loving what you're making. Keep it up! Great gear for a great cause. Support veteran careers with The Call of Duty Endowment Defender Pack!\n\nGet yours today: https://t.co/8ZbPrDYF5V https://t.co/ZPfJkyvPKY @Braydenobrien13 Historically, \"holiday season\" is the time between or a few weeks before Thanksgiving until Christmas. @freddyfallz This might be your chance. Good luck if you enter. @KevinOBrienJr It'd go well with your current game obsession! Good luck. @potatosinham We're hyped for it as well! Keep checking back for more info. @luke34521 Thanks! We love how the design turned out. @tanya_sobel No need to thank us. Good luck! @christyestrada Good luck on your entry! @lToesTeal It would be. Best of luck! @FeldonWoodwind It is! We've had trouble putting it down. @walkerthegeek Meanwhile, we'll have to occupy our time doing this. https://t.co/V0lHfw6vye @doggaveli In bowling three strikes in a row is a \"turkey.\" So is that a \"turkey dinner?\" 🤔 https://t.co/IWTEwfR1p0 @SwirlyKalen Anytime we see something Star Wars related. https://t.co/0ZAQ7oayjY @Heyitsjk325 We'd prefer to Duke it out with a bigger controller, but that's just us. @ZachButera This might just be our favorite attachment. https://t.co/EkK4sroGdt @walkerthegeek Happy gaming! https://t.co/rkgxX13vZb Call of Duty: Modern Warfare, The Outer Worlds and more? Sounds like a good week to us.\n\nJoin us on @WatchMixer: https://t.co/a1miA1jxB3 https://t.co/huskjW6FEY @EZMoneySha We're glad to have someone like you in the community. Your type of passion is what motivates us to keep moving forward. @BarbaraAbramcz1 Good luck! https://t.co/tXVZZaEZzF @moitoi Okay, but that...that needs to go... https://t.co/PqcLXmJg81 @TheRealRocketz So hyped for it! https://t.co/pm8otIj1ZP @JoshBones It's for users who are new to Xbox Game Pass Ultimate, so if you already have Ultimate you would not get a 6 month trial code for Spotify Premium. @Missingafew7 Yes, you can download it on Xbox Game Pass for PC or console! @oceanr08 We know you can do it again! Nice work. https://t.co/UO48gJS60z @michaelcaryon Amazing game and a beautiful console. @SnyderVixky Love the artwork for it! Good luck. @TerryTheBuneary Soon (TM) (C) https://t.co/xynuQpRCoy @sagra_04 Noted. @TheEnchillada Everything is going to be fine... @YuriLowenthal The town hasn't changed one bit... https://t.co/kjisu6MboZ Coming online in 3… 2… 1… https://t.co/KhmOr5SrsN @eb_le We'll always have your back. https://t.co/PemVSrS250 @rawcinematic There are no romance options in this one. @DistroyrOfWrlds It's kind of a toss up between the gorgeous, vibrant world and the beautifully written dialogue. Oh and Pavarti. @CentrinoDoG Good games deserve good praise. The fate of the entire Halcyon colony rests in your hands. Try not to break it. The Outer Worlds is available now.\n\nBuy now or play with @XboxGamePass: https://t.co/hpAqDuUPeE https://t.co/2nAwFTg2mQ Exclusively available for #X019 from November 14, say hello to the limited run DPM X019 Aquabrush Xbox Controller.\n\nFind out how you can get your hands on one 👉: https://t.co/4wee8r0s5Y https://t.co/97T4BGihCH RT @WatchMixer: The King has arrived! Welcome to Mixer @Gothalion 👑 https://t.co/ibRyfisYCp A bundle fit for a Jedi. Pre-order an Xbox One Star Wars Jedi: Fallen Order bundle and get 2 additional games.\n\nPre-order now: https://t.co/HUilm4W6fO https://t.co/DHdzR0Rxbe Spookiest video game nightmare? It’s a bad day to be a zombie warship. Play the World of Warships: Legends Halloween Event today.\n\n🧟‍️: https://t.co/420vD993rg https://t.co/KdKkgG20xk The latest and greatest all the way from Halcyon! RT and tag #TOWSweepstakes for your chance to win this custom Xbox One X featuring Game Informer’s The Outer Worlds cover art.\n\nNoPurchNec. Ends November 9. Rules: https://t.co/gHKH6VGQjL https://t.co/uUG4OJHKUC Collect skulls, become an undead monster, get an XP bonus... You know, normal Halloween stuff.\n\nWitches Festival is live now: https://t.co/O7YFYdbGcN https://t.co/xkASQWR7vD From the NBA court to the #WWE2K20 ring, @DwightHoward is a force to be reckoned with. \n\nCheck out the latest episode: https://t.co/4iQU9GV2Wa https://t.co/oFtCafEW0F Introducing the Pegassi Zorrusso supercar. Whatever your question was, this is the answer.\n\nNow available in Grand Theft Auto Online: https://t.co/zWKmlQgCDb https://t.co/e886IgEbud RT @ID_Xbox: Killing Floor 2 from @TripwireInt has got you some GRIM TREATMENTS in our Shocktober sale! Get it now at 60% off!\n\nhttps://t.c… Keep your friends close, keep your neighbors even closer.\n\nSecret Neighbor is out now: https://t.co/3m1PBORtqi https://t.co/mrf85A1Pp9 Want to earn 5,000 Microsoft Rewards points? 👀\n\n⚽ Download the Rewards app on your Xbox One\n⚽ Activate the Scream Punch Card\n⚽ Complete the #FIFA20 punches\n\n#ScoreMoreWithXbox this Halloween.\n\nLearn more: https://t.co/Crlysc165R https://t.co/f96P9rOf7S @Greenskull Wondered where that office chair went. @PlainzSoapy Same here! We like having context from the story before jumping into multiplayer. @sjfostersound Now's a good time to pick up a new controller if you need one! @JesseChurch2 Nope, your math's spot on. We're afraid we can't help with the kid situation. @Gerbil1978 Commencing roll for good times. https://t.co/YsQXKH070C RT @OuterWorlds: And we are live! Come join us: https://t.co/6SESFo0ulx \n#TheOuterWorlds @PlainzSoapy Heck yeah! Going to jump on multiplayer first or the campaign? @FuleaAlex @XboxGamePassPC We got nothin. Glad you're enjoying it! @stewilson1989 The game should have a function to report the user. That's the best way to do it. @jayt_ini The opportunity is still open, everyone! https://t.co/RU5mOhtQRz @OneMajorRyan How could it get any better than that?? @AUXdub Whoa! https://t.co/Gi1pQauYFz @Chris45412 Same. It feels and looks amazing. @PlainzSoapy It's a lot of fun! Did you get a chance to play the beta? @hletically Have you already had a Game Pass Ultimate subscription? It's possible that you don't qualify for the promotion. @colinwdmann Awesome! Something great to look forward to after work. https://t.co/9HBfSdwex5 Combat-ready from the ground up.\n\nGet $10 off select controllers for a limited time: https://t.co/0eIEMeC1zD https://t.co/nULZIxf2sF @CrownedEmpress It's been an honor, and we look forward to a lot more epic gaming to come. @___LiteXing___ It's better than another ammo pack! @Chris45412 We feel like we only scratched the surface last night. Can't wait to keep playing! @saltyred_mxr Sounds like our kind of stream! https://t.co/958mZdNQn8 @Ammarfarid11 Ahhh, well we hope that's soon! @XboxPope It's going to be a very good weekend. @Quanicus Us, as we watch the chaos unfold: https://t.co/H4odKookIQ @Homicidal__Duck Good luck to the squad! What are your impressions so far? RT @dungeonsgame: What happens when you lock the best and brightest developers in a room with nothing but a camera? First, they start bangi… @TikaaniOfficial We're ready! https://t.co/3nGTxg0Omk @iRapierZz Don't forget to set it to W. https://t.co/Y6LOySScCd Consider the stakes raised.\n\nCall of Duty: #ModernWarfare is out now: https://t.co/Rai8KAL4wj https://t.co/yG0j0qM0IC @Rippxer It can take up to 10 business days. @DeityOfGaming Oh! We know where those are! https://t.co/g42luIAitq @CrownedEmpress From the empress herself! We appreciate the royal proclamation. @Ammarfarid11 You've still got time to pre-order it before it hits stores on the 4th. RT @XboxGamePass: The Outer Worlds is available today.*\n\n*Opinions expressed in this tweet are our own. there are no corporate overlords te… @GrandNOBLE Nice! Thanks for picking it up. @Staggerilla This is the quality content that we love to see on Twitter dot com. What in the world(s) is The Outer Worlds? Just the craziest sci-fi RPG this side of the galaxy. Check out the trailer and play the game today!\n\n📺: https://t.co/g85bMC1C3J https://t.co/zdGtLAt79A Ready for the world’s most powerful console? Save $100 on an Xbox One X bundle.\n\nLimited time offer. Details: https://t.co/NAwsvbAQPf https://t.co/iDXOr53g1p Get ready to ship out.\n\nCall of Duty: Modern Warfare is available now: https://t.co/CZgfQY46uE https://t.co/OLWftSZtAv RT @BandaiNamcoUS: The #ACECOMBAT7 Anchorhead Raid DLC is now available to purchase for @Xbox One! Your mission will be to strip the port o… Half pig, half cow, and completely terrifying. Get the Swine &amp; Bovine Halloween Costume in State of Decay 2. Available now till October 31.\n\n🐷: https://t.co/Suz0kVEl9O https://t.co/Xu51e959Rh @shogun573 Such amazing scenery! Been watching gameplay all day while we wait. https://t.co/Jrd5fynf6w Pull up for free, then pull up from three. \n\nFree Play Days with NBA 2K20 start today: https://t.co/D44GiXnT7I https://t.co/d9z8L6X9JD @DaymDrops We'll try to serve up those assists for you. https://t.co/Z2BJVAxaiz @ViralDenizen Sounds like you have a solid plan. Have fun! https://t.co/rud3U6GYbj @ViralDenizen Sounds like you're all set! Which one are you going to play first? Heavy on the treats, hold the tricks. Save big on digital downloads from now until the end of the month!\n\nCheck it out: https://t.co/8xPPS1UcjG https://t.co/dKsh3toGyF @ViralDenizen Happy early birthday! Hope tomorrow is a day filled with fun. https://t.co/tiuR7v5ylk @B3HShady We got you! https://t.co/0B6iNCgSKi RT @OuterWorlds: Greetings employees of Halcyon, \n\nDon't forget to join us for #TheOuterWorlds Launch Party TOMORROW! @Obsidian, @majornels… @cybernetic_cat First playthrough we'll be the hero and second playthrough we'll try to be evil and then feel too guilty. https://t.co/RqVuY5c7jS @B3HShady Watch out for possible chances of spook. https://t.co/SGmblHBMGP Oh you know, nothing major came out this week. Just Call of Duty: Modern Warfare, WWE 2K20, The Outer Worlds, and tons more!\n\nTune in to This Week on Xbox: https://t.co/cxv89LHSQy https://t.co/QbqbMg4RxN @DoodBearded They're essential fuel for the grind.  Good luck! @HiIAmMoot No problem! @LightItUpDan Awesome! @erraticagent34 Glad to hear! Hopefully you picked up some new followers that'll come back to watch more game play. @dude_ralf Such a great game! Have fun. https://t.co/xJzz4TvzUm @UnarmedGorilla Yes, it'll work with any controller that has a Bluetooth option. And you'll be able to use your Elite controller (with paddles!) @Revenant013 Yes, it should work with the Elite series controllers, even with the paddles. Prepare to haunt the battleground. The PUBG Halloween Collection is available now for a limited time in the in-game store.\n\n🎃: https://t.co/AYzpuKjLli https://t.co/xeKeh2mnIe @avatar122333 It'll depend on your region! Obsidian forums has a list of times. @2PProject True, but at least you'd get to see the sights and get into an epic ship battle or two. @DoodBearded You'll need that energy, it sounds like! 40+ hours is a pretty serious time commitment. @SkLLz_Audax No problem! @HenryASoliz That was some great timing! https://t.co/zCSKkJIONF @Halo5Moments Nice work! https://t.co/BveS8xYYLe NBA season just started. NBA 2K Playgrounds season starts today.\n\nCheck out the new content: https://t.co/hAlB1LOoPY https://t.co/U3csTKTiO4 @_JoshuaCooper Been watching so much gameplay! Hyped for tomorrow. https://t.co/ke7yp9lLCl @_JoshuaCooper Glad you're having fun! Are you jumping on the Outer Worlds when it drops? @_ZoDi_ Yes, the Outer Worlds will be on Xbox Game Pass for PC. You can also pre-download it now for console and PC. @MURXTER Looks like he already is! @ShadowKal_ We can't wait to check out all the new streams for it. @Staggerilla That's all we ask. Thanks! @h34d5tr0n9 Nice! Hope everything went well and you pulled down some wins. 🍗🍴 @LightItUpDan Thanks for signing up! Have fun playing it tonight. @erraticagent34 Sounds like fun to us! Are you picking up where you left off on your next stream? @cyb3rs34l The long, cold wait is almost over... https://t.co/AuJFvQFUS3 @2PProject We're sure you might be able to find a little time for a quick voyage or two. @HiIAmMoot No, it's just a clip. All current model controllers have Bluetooth which is used to connect with the phone. @Tactical_Pinup Time to squad up and put in some work! Have fun. @TikaaniOfficial We are ALREADY SPOOKED. https://t.co/PeuXtmJ3MS @WatchMixer We can't wait to check out the stream! https://t.co/VvLbN4CYDS New loot. New spooks. Borderlands 3’s Bloody Harvest event is happening now.\n\n🎃: https://t.co/spsWXVQf18 https://t.co/o7DnJmUX7O @babycartiereye It is! A sunset over a rolling sea is always an amazing sight. @LegitOOG Glad you're hyped for more mobile options! @TrystenHemmah Well, you could before but now you've got a way to hold the phone in place! @Staggerilla Okay, that's adorable. LOOK AT HIS LITTLE HAT AAAAA https://t.co/WEdM1xMsfb @SkLLz_Audax Sure, as long as the phone fits in the clip. @shogun573 Final countdown to liftoff... https://t.co/fSYkpIndP3 @Punk_N_Pi3 It was a pretty limited test group to start out with, so a lot of people who signed up didn't get in. Keep checking back for updates and there might be future options. @DoodBearded It's gonna be awesome! Are you going to try to finish the game in one go? RT @WatchMixer: The Mixer Community grows. Welcome @Shroud! 💙 https://t.co/CG6Nn5ioK4 @Gerbil1978 A little bit! Been wanting to play more, but we have so many games in our backlog. @Gerbil1978 It's a really great game for relaxing after a stressful day! New spooky raid. \nNew legendary loot. \nNew skeleton pets. \nNew chilling cosmetics. \nNew playable banjo. \n\nPlay Fort of the Damned now: https://t.co/OBa9Av1RZW https://t.co/K1HoyBjwty @MikeBGameGenie Happy Birthday! Sounds like a fun way to celebrate. https://t.co/PAXUFVQsv8 @redrocker1912 There's always quests! We just picked up Bad Juju last night. @EzMoney1239 Hey, we won't ever turn down an extra Enchacement Core. @R3tro64 It's a rare stat drop. @ShadowKal_ No problem! Are you loading it up this weekend? @___LiteXing___ Come onnnnn blue weapon! https://t.co/DP80JqDAXe @JoshOrion98 The best kind of family bonding time! https://t.co/Cgtys2deNl RT @CivGame: Tile info is just a button press away in Civilization VI on #XboxOne. @Xbox \n\n🎮 https://t.co/gmYhAupP0U https://t.co/hXbiGemvSK @AndrewKost24 Sure, you can loot under fire. But can you manage your inventory? @TrinalBulletX2 \"Wait, you just got that yesterday? I've been wearing this same armor for 18 years!\" @TevesTV Saint-14 always did have the coolest helmet. Introducing the MOGA Mobile Gaming Clip for Xbox Wireless Controllers, our first accessory in the ‘Designed For Xbox’ range built specifically for mobile gaming.\n\n🎮+📱= 💚: https://t.co/Fs5TwfLGvy https://t.co/gQthQV69xq @TwitterGaming Whatever one has the coolest armor. @Robo_503 We hope he doesn't change after all the fame. @Staggerilla Us waiting for that montage: https://t.co/Sztwl5kgXo @djbohdano Of course! Just let us know if you need help with that candle. https://t.co/G2SjZ8NtjH @ZuperBros Happy hunting! https://t.co/7km8QoyzND @Homicidal__Duck Another good option! It's nice to have a game to unwind with after a few stressful rounds of PUBG. @takeadirtnap Real world loot! That's awesome. @TerryTheBuneary We think so! It's got an amazing community and is still getting top-level support and updates, even years after release. @h34d5tr0n9 Open lobbies are always fun! We hope you get some pro squad mates. @LightItUpDan YES @archesiaus Keep up the awesome work! https://t.co/5loykUkXjk @djbohdano Almost forgot the cake! Hope you're ok with sharing. https://t.co/Nu6aRhMNl8 Will you bring hope to all of Halcyon or snatch it and run? The choice is yours in The Outer Worlds. Available October 25 on @XboxGamePass or pre-order now.\n\n🚀: https://t.co/DziTz5IKmB https://t.co/WwYpOI0NPO @_ForrestGaming Sounds like Thanos would approve. @viper1829 Just one (or two?) more sleeps. https://t.co/8b0cJ8BTIF @Maliceunchained 100% accurate. https://t.co/MknyNimVLB @kaley_creed It goes till November 6th. @Maliceunchained If we're being honest, puppies are the only reason we'll ever need. https://t.co/P9aBquxCml @djbohdano Happy birthday! Thank you for being part of the community. https://t.co/8GmGYo0ciT @Staggerilla We'd love to see some clips of the most hilarious crashes. https://t.co/2lhOyfVl4Y @only1ryan5136 If you sign up for Game Pass Ultimate it comes with a huge library of games that you can download at no extra cost. Plus you get access to Games with Gold! It’s monster vs. monster hunter in the Rainbow Six Siege Halloween event, Doktor’s Curse.\n\nAvailable for a limited time: https://t.co/eh5BoPCN0K https://t.co/cRzMUHKM8S @EleekaZ It can be tough at times, but keep trying. We'll be rooting for you! https://t.co/rizQAZkqez @ZuperBros The perfect stat roll is rare, but worth hunting for. @Phoney1999 The original loot grind. @ShadowKal_ Yes, it will be. @novaseat The rarest drop of all. https://t.co/o9BhHzcJ9Z @joshbullough Everyone starts in the same place. How'd the stream go? @CodyGreenwood14 Thanks for the heads up! We wouldn't want anyone to miss it. @SoEverdream We're glad you're having so much fun with Game Pass! Have an awesome weekend with Outer Worlds. @WarlockDawnMoor Anytime we get a legendary or exotic drop. https://t.co/sclz4wWyx4 @erraticagent34 That's one of our favorite new indie titles. How'd the stream go? @Homicidal__Duck How'd the PUBG stream go? Did you pull in some wins? @RealStealthyCat Sums up how we fight in Tomb Raider. @eddytronpie Having a great group of friends to squad up with makes all the difference. https://t.co/Pa8oYWiuHw Terrifying enemies, spooky rewards, a new boss, and more? We’ve got goosebumps just thinking about it.\n\nBorderlands 3’s Bloody Harvest event starts October 24: https://t.co/fdKo8mxVEk https://t.co/QNxCGdwbr1 @EleekaZ You must be really good at organizing inventories too. @michaelvein Where the adventure began for many. Thank you for being part of the community! https://t.co/stjI9xApER @SmilarMedia Relaxing with some games is a great way to spend a sick day. Hope you feel better soon! @GreatDekuStick He had such a motivating speech. https://t.co/xVhilWOXfV @michaelvein The music is so nostalgic! @Radeon Party favors for everyone! https://t.co/SVpJbvYK0v RT @TheSims: Show your school spirit with The Sims 4: DISCOVER UNIVERSITY!🎓Choose a dorm, set up a study session in the library, and when y… @michaelvein For the LOOOOT! https://t.co/bFdVM2t7JI @MrWillDeal Us, after getting dunked on like that: https://t.co/VuGb2hZ8s2 Do it for the loot. @LewieJay Sounds like you had a good experience! https://t.co/6ayGJ2dYR0 @Wolf_GameDev Gotta keep those twitch reflexes sharp! @TheOGMagma If it feels good to you, it's worth the investment. @illspit313 We're ready! It's going to be a great weekend. @Full_Flame13 Sounds like you'll be all set for a big gaming weekend. @dhaytyn Azhir Cave was awesome in the beta. Can't wait for Friday. @karabb04 She must be a super fan! Good luck to both of you. @TikaaniOfficial Good times! We've really been enjoying that mode. @thewavesoundz It shouldn't matter at all. RT @TheSurgeGame: We are excited to release today an update on all platforms, featuring fixes and improvements based on your feedback since… Time to get back in the fight. Call of Duty: Modern Warfare drops this Friday.\n\nPre-order now: https://t.co/9az3JkLnKr https://t.co/4wxKEBT79n @bigems2476 Happy birthday! Hope it's a great one. https://t.co/21i6UV4q1k Still want to make it to #X019? Get your tickets to #X019 before they’re completely SOLD OUT. Proceeds support UK charity @SpecialEffect.\n\nGet yours TODAY: https://t.co/44Dudf9inU https://t.co/zWb4Vr3XNR RT @EAStarWars: What does it take to make a new Star Wars droid? Find out now in our Behind the Scenes video of #JediFallenOrder. https://t… @PrivateDivision Too close! TOO CLOSE! https://t.co/YSV57L1dT0 @KingQuillo We don't believe in luck. Just accidental skill. https://t.co/bAUT1lhcbj @SoBreezyLive They can try! https://t.co/42zIjkMGfX @AntonellaMarr3 We have no doubt partner. https://t.co/IzvOduOLbs @SoBreezyLive More the merrier. https://t.co/jewXDIqejy Get ready to expand your horizons even further in Farming Simulator 19 Platinum Edition.\n\nAvailable now: https://t.co/ax7n5VQnUT https://t.co/NmoyVHRPJc @colingardner54 Time to bring back nap time. @SoBreezyLive If you're Bane can we still do the bounty together, or does this break some sort of unspoken Batman law? @AntonellaMarr3 Alligators are a tough fight! Especially, those legendary ones. @SoBreezyLive On second thought, we'll be Nightwing. https://t.co/rMVKCcScPa @nerdwhoisagamer An hour here and there is all we ask, sometimes. @TheOGMagma It really makes a huge difference to a serious gamer. RT @ID_Xbox: A first-person, story-driven cosmic horror game where the scientific exploration of Mars meets the supernatural dread of Lovec… @SoBreezyLive We'll be Robin as long as we can still do the Batman voice. https://t.co/PCGMHTSiZK @Wolf_GameDev Something tells us that you'll be the one carrying next time. https://t.co/n6DpnbOj4Q @AntonellaMarr3 Did you already complete it? @SoBreezyLive Perfect! Are we going into this Batman style? https://t.co/EbLZ2firzU @SoBreezyLive Let's go! https://t.co/6n5gOVMfkI Your only goal: survive the scary.\n\nARK: Fear Evolved 3 starts today: https://t.co/NHNRUELSsH https://t.co/3ZC6OlEHvk @Ammarfarid11 Her fade can be a good escape from his hook, but agreed. As a mercy main, we just hope to doge him by flying around to everyone. @Ammarfarid11 Moira is an excellent healer to main. The amount of damage and heals she can output is a game changer. https://t.co/UaIUIUg567 @lopezalfredo651 Hope you love it! https://t.co/BriitL6s1D @SteveMBowling We're pretty hyped to see how excited everyone is for it. It's going to be an amazing weekend. @MrWillDeal Absolutely. And sometimes you learn by teaching. @Ammarfarid11 Do you usually play support roles? @Ammarfarid11 It's fun playing as a Sunflower and giving all the heals. https://t.co/Tbxw84mLqt @lopezalfredo651 Yes, it will be available on Xbox Game Pass and you can pre-download it now. @JoshuaOrtega88 The characters look really interesting and like there will be some great humor elements. @Daniel47366985 Sounds like a solid night. Meet your next target, Bounty Hunters.\n\nHunt him down today in Red Dead Online: https://t.co/FE70Cn2oUh https://t.co/olJxfIcPhs @wakanamorizono Less than 5 days to go! @Jarpo We're glad you're getting some great use out of it.  Have fun playing it this weekend! @_Sytex_ @RyanKW90 @PrimalHD1 @VigilantWings @papachubbz @muzz_jack @nateesh08 @WaveCrashXX @b0ssladiii @IivMagz @smileykez Good times! How're you enjoying the new update? @brewbi Wow, 16 kills! What a way to come back! @nerdwhoisagamer We've blocked out our weekend plans just for this. Have fun with it! @colingardner54 Hopefully you've got some time set aside this weekend to get some play time in. @BBIAJ Friday can't get here fast enough! We're so hyped to play it. @acevip3r That would make your birthday tomorrow! Happy birthday to you! https://t.co/MONjYaDe1Z @TikaaniOfficial Halo and charity? The best possible combo! https://t.co/eVak20452K @TikaaniOfficial Halo and charity? The best possible combo! https://t.co/BiBi7cglkK @OriginalHipstcr We're afraid it wouldn't do much good, new games are not being added to the Backwards Compatible library. @SatisJaxon We hear a lot of good things about it! Thanks for sharing the info. What are you gonna do, call the crops?\n\nPvZ: Battle for Neighborville is available now: https://t.co/mjDz4k6nSW https://t.co/GmqHgoA4CY @xxmrkoolguy3d You go with your bad self. https://t.co/qIIFoBbYgi @TheOGMagma You've still got a few days to pre-order it! @0range_Gaming Free to game as much as you like! Now to start in on all those downloads... @txmadcat Just a couple more weeks to wait and you can get your hands on it! We'll look forward to hearing what you think. @XxGVTORxX New cam hype! That always adds to an already cool stream. @EarpXxx Smart use of your surroundings. We'll be keeping an eye out for more of your clips! New missions.\nNew location.\nNew specialization.\n\nEpisode 2 of TCTD2 is out now: https://t.co/07NpEkwcGr https://t.co/k5DW2mI6sJ @DragonSoulBorn Keep up the great work and we're sure you will someday. https://t.co/1dJllUpj35 It's a very special occasion. #WWE2K20 is available now!\n\nStep Inside: https://t.co/OhmMeaFtCO https://t.co/cjWBlwXnYB @EarpXxx Thanks for being part of the community! So do you have psychic powers or did you see that guy coming? @DragonSoulBorn That's really impressive! Are you using Unreal Engine? @DragonSoulBorn Looks great! Are you self-taught? https://t.co/lETuDWKExq @EarpXxx That was impressive timing! https://t.co/WgdiyKx4Y8 Greetings all Halcyon employees. The Board is excited to announce that The Outer Worlds is available to pre-order and pre-load today!\n\nLaunching October 25: https://t.co/BLdH0l4yzP https://t.co/GTKgmTQDzR @0range_Gaming Good call! @krisbell95 It's bee here soon! We're sure you'll love it. @_ForrestGaming The OTHER kind of drop. https://t.co/qLSsAwlgeL @h34d5tr0n9 We believe in you! Good luck hitting that 6k goal. https://t.co/MgZRWEmvK8 @MrSavageFox Nice work on cleaning out those zombies! Thanks for sharing the stream. @andypocock Awesome setup!  Thanks for sharing the pic. @RIParchdkeFranz Us, going to your school https://t.co/KGLyj8cM3P @soullesskrow Good luck on the stream! https://t.co/ipw4OmYXjC @0range_Gaming Yep! Xbox Live Gold (up to 36 months) converts over. @DSamurai That's pretty quick for a tough 100% like that. Well done. @E_RoxTTV Not long to wait now! @abs0lutDATA Naps during a stream?  We love this idea. @TheZbr Nice! Are you already making some good progress? We’ve got zombies. We’ve got wrestling. We’ve got spaceships.\n\nJoin us on @WatchMixer: https://t.co/EalUwrE8O9 https://t.co/YgOU2IvMyx @FrenchyFry24 We call that skill! You kept your cool under fire. https://t.co/BTwmtG5VM4 @h4mm32 Congrats on the milestone! You'll make it to 10k in no time. @krisbell95 We respect your priorities. Congrats on the new job as well! @DeborahBantry @Kathy_15xx We agree! Very well done. @raz280bear Hey, thanks for the heads up! @MaDzGaming_HC Hopefully you had an awesome Sunday stream. Thanks for sharing it! @DSamurai Amazing work! How long did it take you? @abs0lutDATA Nice! Did you make the full 24 hours? @RoninWolf02 It's time to get spooky! https://t.co/OJvXn5WNty @karen_conlan Those are two excellent choices! We're definitely fans as well. https://t.co/bRjd3JDcVz @ShopShawn Hopefully you'll have a chance to pick one up soon! @TheSoulRisen Sounds busy! But hopefully you'll have plenty of time to play next weekend. @TomBillington92 It might've been a bad day for the Spartans, but it was a very good day for you! @MrWillDeal At least it was educational for them. @E_RoxTTV We're wishing the same thing! But you'll have it in your hands soon. RT for a chance to win:\n\n🛒 36,000 FIFA Points\n⚽ North London Derby Tickets\n\n#ScoreMoreWithXbox #Sweeps. Open to 48 US/DC 18+ only. Void in NY, FL. Ends on 10/31/19.  \n\nRules: https://t.co/2jJwXBMg6q https://t.co/10BbnHDizL Time flies when you're causing mayhem. Happy ten year anniversary, @Borderlands! https://t.co/tfMNKnjMhj Game dev appreciation post. Tag your favorite. The end of the world is just the beginning.\n\nPlay Surviving the Aftermath: Founder’s Edition today: https://t.co/s8aDTYpTP2 https://t.co/TOkW5DDher RT @XboxGamePassPC: Meet William. The future of the kingdom rests in his hands. Also, he's an infant.\n\nGet ready for Crusader Kings III: ht… @Alan_Austin75 Will a congratulatory tweet from us do? https://t.co/EpYWtP76II @mattdenkers Congratulations! https://t.co/00UoroBYn6 @TerranceTheHole Guessing we know what game you'll play first on the new console. @navyjedi87 Guess who is about to get their game on? We're here for it! https://t.co/N2L4t27fir @thelunarfox That is the BEST lunch! https://t.co/D00RoHEuib Nothing is more important than family.\n\nChildren of Morta is out now: https://t.co/vK08HUW80W https://t.co/sEnYIqHOlQ @tacobell Someone needs to show us how to pop achievements over our heads. Call of Duty: #ModernWarfare launches in one week. When the time comes, be ready.\n\nPre-load it today: https://t.co/drdlgW3FDe https://t.co/hoSLdxULYy Playing video games is fun. Playing video games for free is even better.\n\nFree Play Days ends October 20: https://t.co/13XwyEy0vp https://t.co/G0F0dhi5cX @VulpixGanda They did a great job with his design. It makes us happy to know you're having fun! @VulpixGanda Awesome! The rotating seems like it would make fighting tricky. @VulpixGanda How are you liking the Spiral Mountain Stage? RT @tacobell: Achievement unlocked. Get a $5 Double Chalupa Box for a chance to win an Xbox One X Eclipse Bundle. \n\nFree entry available. C… @VulpixGanda Excellent choice! https://t.co/6pNqx6ONTZ @MintySte Oh nice! The gameplay looked like it was going to be similar to FFXV. Hit the skies in style with the exclusive Golden Squadron Stinger Mantis Skin when you pre-order Star Wars: Jedi Fallen Order!\n\nGet yours: https://t.co/8HchASFpfp https://t.co/XkEBwWOlab @kaned5590 A full weekend indeed! Good luck and enjoy. RT @EASPORTSFIFA: The first team of #FUT20 #UltimateScream has risen, with terrifying permanent upgrades. 🧟 Second team will be available n… @IlluminaTerra We've definitely found yourselves stuck like that at least a couple times. This is Horde-o-ween. Play the Gears POP! Halloween event now till October 31.\n\n💀: https://t.co/632HINVshn https://t.co/RZF146LSWj @GonzoJoe007 Looks like such an interesting world! Can't wait to start exploring it. https://t.co/UZX9NxQBYK @Residentweasel1 Those are some of our favorite games. So excited for this! https://t.co/7wLjp7yBOy @ZolsticeTV Thanks for that early pre-order. We're glad you're so excited for it. @ErickOc52338462 Same here! Just a few more days to wait. @h4mm32 We've mostly been carrying them around in backpacks, but a holster would be a pretty cool idea... @kaned5590 Sounds like fun! Do you have more weekend gaming plans? RT @mercurysteam: These weapons aren't gonna forge themselves\nThese talents aren't gonna build themselves\nAnd these bad guys aren't gonna t… @shellshocked691 It releases on the 4th of next month. @lorsux You'll be there soon! https://t.co/RKTI7jQY2B @erraticagent34 The best way to spend a rainy evening at camp. https://t.co/DHqE5Fx9n1 @TheZbr Same here! What's your favorite new feature so far? @DestinyAdidas A great way to kick off a Friday! Are you making progress in the Iron Banner? @jayt_ini That's always a worthy goal. Did you have any luck? @Lorul21 It's a perfect time to get back into the fight. https://t.co/8qJZ2xkWmh @hater_nz Congrats on the new partnership. We're sure you'll do awesome! @Wandering_Dutch Have an amazing time at X019! @infaveloz1166 It's almost here! We're so excited for it. @TheSucciestLad It's the tough battles that we always remember. Even if they keep us up at night sometimes. In The Outer Worlds, who you become will determine the fate of the entire Halcyon colony. No pressure.\n\nAvailable October 25: https://t.co/MUoTSG5o5Q https://t.co/CFccR4rFnR @Na_Hendo Sometimes you just have to put your head down and power through. What a relief to finally finish him! @GunnplayFPS It's looking like a pretty amazing year all around. We're excited to play them all! @TattoodMatt It's already improving our commute! @Ox_Michael Awesome! Hope you enjoy trying it out. @ThundurusXz Now that was a seriously impressive shot. https://t.co/hirJDTe7QA @ThundurusXz Mobility advantage! @MintySte It'll be interesting to see how the newer Final Fantasy combat mechanics in the remake influence boss battle like these. @VulpixGanda Oh wow! Let us know if you want any game recommendations. https://t.co/jG3w9X6IVn This Halloween, win big prizes &amp; earn big rewards when you #ScoreMorewithXbox.\n\nSign up to Microsoft Rewards and complete the #FIFA20 Scream Punch Card to earn 5,000 points: https://t.co/QoKfAm51MV https://t.co/1oUPPr9bGL RT @RockstarGames: Presenting the Weeny Dynasty, the latest installment in 50 years of proof that size doesn’t matter if you know how to ri… @VulpixGanda Indeed! https://t.co/q1zUivFwfT @spes_bona You're more than justified to yell at any poster after you've chased by those things. Working Joes deserve a big nope. https://t.co/bTQJUrvbBE @Freiteez We always want tacos. Pretty sure that's just a default setting.. @MintySte Got to call us out like that haha. @spes_bona The posters added a subtle level of creepiness. Really appreciate how much detail they added and kept the tech close to the original movies. @LeftyLiberal Try entering your code again if you didn't receive a response after your first try. @Freiteez Don't get us wrong, that day one controller is completely worthy - but we can't wait for you to get your hands on the Elite series 2. \nAlso, you're going to hear a bit of a difference in the sound when you turn this Xbox on. lol @JoelSherring That's a big milestone! Congrats! https://t.co/3wC9i0CG5z @ThevigilateT That's why he's one of our favorite villains. https://t.co/Mh1VdknG4q @Nomad378 Good source of inspiration. https://t.co/q4aZaL0GeV @ThevigilateT Wouldn't be the Joker if he didn't add a twist somewhere in the story. RT @MergeGamesLtd: #StrandedSails – Explorers of the Cursed Islands is out now on #XboxOne - save 15% until Oct 30.\n\nAn exploration &amp; farmi… @bolano_marcus It's real, we promise. Let the freak out commence! https://t.co/FJ9jze2IBO RT @anthemgame: Fog rolls across the jungles of Bastion and the air fills with ominous sounds.\n\nFreelancers! Today marks the beginning of t… @ThevigilateT When we first saw Titan Joker: https://t.co/tgdicIQzb3 @Nomad378 Looks awesome! What inspired the orange dpad? https://t.co/udcVC8060i @Freiteez We believe it! You're about to get a sweet gaming setup. https://t.co/dSobVow4xF @killjoys2019DBS Yes, the Elite 2 controller will be compatible with Project Scarlett. @SawyerMurray7 The 4th of next month. @R2LSD2inHD It's so cool to see it out in the wild! Glad you're having a great experience with it. @edwardchik Perseverance and determination are key! So rewarding when you finally beat a boss you were stuck on. https://t.co/q72VmnLSzX Slice and dice your way through October’s mid-month Games with Gold.\n\n🔪: https://t.co/yRh0y2IZo0 https://t.co/LhoMp1vNGe @edwardchik Sounds like it was a close fight! RT @PlayBlackDesert: The Halloween season has crept upon Black Desert.\n\nJump in game and subdue Isabella the Black Witch, exorcise the evil… @MnBurger Love that you can adjust the tension on the thumbsticks. @lllAguirrelll That's all you really need! @OwenCarter7 Have fun playing them again! @adrianlovell That's so cool! We're glad to hear it's working so well for you. @shmiddlerslist It'll make playing the games we've already got even better. Just a couple more weeks to wait... This week's good stuff: Sea of Thieves updates, Plants vs. Zombies behind-the-scenes, and a bunch of new games to play.\n\nWatch the full episode: https://t.co/JNGihwcbc9 https://t.co/FThP8brYw1 RT @ID_Xbox: It’s the wildest Party Pack yet, with the absurd deathmatch Trivia Murder Party 2, the weird word circus Dictionarium, and mor… The Xbox Elite Wireless Controller Series 2 is about to change the game. Unbox it and find out how.\n\nPre-order now: https://t.co/pTmjZk6qTE https://t.co/UFOB7hIQNy @The_Geektrovert We've got at least one option to win a bundle that includes one going right now, so watch your local Xbox account to see if they have a similar option. @XboxQwik We'll always have controller here for you. https://t.co/Y7pVzD2WU7 @smashbro__ Bayonetta taught us that no challenge is too great if you do it with enough style. https://t.co/gg0dYrYoXx @Bilal73540115 Even one of them would've been tough. Two just seemed excessive. @kylejsutton Finally putting him down was such a good feeling. @TikaaniOfficial It's cool to watch you layout coming together! @DeMasterchief7 Sometimes it's just more satisfying with the classic games. @oceanr08 Hurry back! Hopefully it's an easy fix. @OwenCarter7 It should be out now! @Luca_Auditore Just being able to explore the lore like that is a great feeling. @Warhorse103 It's a tough raid, but one of our favorites! @quinful That raid was hard to do with a full team. Really impressive you did it solo. https://t.co/HbJCkVF5zl RT @minecraftearth: Minecraft Earth is here! Starting today, we will begin to roll out early access from country to country, starting with:… @anton1oth3g Sometimes those things go hand in hand. Especially in Ninja Gaiden games. @ShaDOWnOMi That's a tough fight even on regular difficulty. @MintySte Seriously though! Destroyed us the first encounter. @jackimations_yt Just have to do this a thousand times and you got him. https://t.co/270uE8hzqP @StrangeFord Handsome Jack just had a very punchable face. https://t.co/mUEYYF7BNO @7CG_Ganondork A weight off your shoulders. https://t.co/YGTbVqmu9h @FalconRiot We love games where you have to put in some serious work to make it to the boss. It's just more rewarding. @mattpalmertree He could block so many hits! https://t.co/ZPvDOrdcq3 @Faisal36368 It's always a good feeling to go back and finish something from your backlog. @Stiletto_This Hopefully you both had a fun stream! @Lovttit We didn't even see him there! Amazing shot. @06Strive Our thumbs are sore just thinking about that fight. @LineappJNS Not summoning help does make for a more intense fight. There were a few that seemed almost impossible without support. @Murpdirt Always really impressed by the people who do solo playthroughs on Insane. https://t.co/mxnaJuxsHY Think you can handle the Exclusive Xbox One X Eclipse Bundle? Head to your nearest @tacobell for a chance to win:\n\n🔥Limited Edition Xbox One X\n🔥Xbox Elite Wireless Controller Series 2\n🔥6 Months of Xbox Game Pass Ultimate\n\nUS, 18+. Ends Nov. 23. Rules: https://t.co/4x7cFJ9bFi https://t.co/vFiFcYiF7u @Anabolic_Sean Sorry for any confusion, we do refresh games in our library from time to time. Keep an eye on the \"leaving soon\" collection in Game Pass so you can catch up on any games before they go. @JaybKella That's very true! https://t.co/EzdxAOOOu1 @ReAnimateHer_ Camp activities that are fun for the whole group! @Adam407 Happy to hear that you and your controller survived. https://t.co/kRMtVxD8oF @Elijahtorrez7 We just love great games. Doesn't matter where you play I'm. @LEGIQN Not just victory, but justice. @oceanr08 It is! Just gotta make sure your teammates capture the points. @nomaaddd Sometimes persistence is the greatest weapon. @NaclynE You raise a valid point. https://t.co/LekCiwQC9W @ladygaga @Ninja The Fortnight guy @Adam407 Was so intense, but the music helped us keep our cool. @SeekerOfEmbers No need to be sorry! It's a tough battle and you can be proud of beating them. https://t.co/amlUjKj1pa @JonGrrrr Didn't realize Dark Souls could be used as a verb until now. 100% accurate. @CamillaLNews Worth it to get the Wyrmhero Blade though. Resist the evil within or embrace it? The choice is yours in Baldur's Gate and Baldur's Gate II: Enhanced Editions.\n\nPre-order now: https://t.co/fLu9fxS3BS https://t.co/YRlw4glrZw @CamillaLNews It had so much health! @JerrySoCal Love Crypto's Deadly Byte and Bloodhound's Protector of the Patch! @_NWGaming Of course! We look forward to seeing more. @KrayZmnd Gamer goals. @TranceObsessor Sometimes it's just too much work! Even hard is tough enough. @_Game_Screen And the 51st... https://t.co/TR3tbLY3gV Judgment Day has come and gone, but the threat lives on. Get the #TerminatorDarkFate Character Pack DLC today. @Terminator in theatres November 1. \n\nAvailable now in Gears 5: https://t.co/VQFSAZTd3Y https://t.co/nvVYYCXeft @KrayZmnd Awesome start! You'll be picking up #1's in no time. @ronnie78910834 They seem to be off to a great start with the new chapter. @KrayZmnd There's never been a better time to jump in! Good luck out there. @Karamavroscoe11 That and taking out Androids with the bolt gun @OneZenDarius We're really been enjoying the updates to bases. So many new things to build! @briandeking12 That was pretty intense for 6! @oceanr08 That 5.67 efficiency though. https://t.co/rd0kR9zbpk @XboxP3 https://t.co/CtyWZuEgcP @TikaaniOfficial We just love the sheer scale of it. There's always something new to explore. @_Game_Screen How the first few seconds of the fight felt. https://t.co/XY9q5X8CfF @KirkPotter6 That was a tough fight! We relied heavily on using the sniper rifle to keep our distance. @VWiley1988 Hats off to anyone who could do that raid solo. https://t.co/RdYEsZoavB Think you can handle this much power? Head to @tacobell for your chance to win the Exclusive Xbox One X Eclipse Bundle, starting October 17 through November 23.\n\nUS, 18+. Rules: https://t.co/xiedE2WbVw https://t.co/24NP0YTbrK @TomInAlf Playing on Legendary made us remember. https://t.co/2dqoy0NTTi @Prod1gyXx Sounds perfect for the spooky season. https://t.co/ff6j6gsAiJ @PAULOCALLOFDUTY One of our all time favorites. Lara just keeps getting more amazing. https://t.co/0blE7QP7bt @supersonicx2003 We'll update everyone with new info as soon as we've got it to share. Glad you're enjoying it. @kancer Thanks! We think it's a nice touch to keep your games a little more organized in your mind. @Coltaine777 It really is! Glad you're having fun with it. @Kuribo4 That last fight is a long one, but worth it. https://t.co/4fCehr0JyR @AKAWist @RufusBlackwood @qoubah @maaayoking @11bitstudios @PatrickKul Amazing! We're glad to see the console edition getting such a great reception. @dililiznizzo Now's the time to pick it up if you haven't yet! @_NWGaming Looking good out there! We love that fast paced action. RT @CivGame: Keeping tabs on the world around you is the key to success in Civilization VI, available November 22 on #XboxOne. @Xbox \n\n🎮 ht… @SceptreDisplay A fight to remember. https://t.co/2HJ8c7uNgf @SoberParty1 We're glad you enjoyed it so much! @_Omegez_ That's a pretty good candidate, for sure. @BuschWizard It was just the best feeling when they finally went down. @MAdventure69 That could've gone better... https://t.co/lZs4kZXmhR @ReAnimateHer_ Sounds like a good time for everyone. https://t.co/JS0B96zl9K @redbox She didn't stand a chance against the dream team. https://t.co/lsRfZa1YYJ @Prettysickgami1 Perfect for the spooky season. https://t.co/a9KshSdrYt @Matthew05960333 New games are not being added to the Backwards Compatibility library. @Synistyr_X Embers! That's awesome to hear. Most satisfying boss you’ve ever defeated? @peliondave So much hype. @RealRosalinaL The name of the upcoming console hasn't been announced yet. @markecclesEFC Crowd pleasing moment. Every tomb to raid, every outfit to rock, every weapon to wield. Shadow of the Tomb Raider: Definitive Edition arrives November 5.\n\nWatch the trailer: https://t.co/ugN95EM2Y2 https://t.co/gggsLxHjfe @KRenniegade Yes! Such a great idea and we'd love to see what you draw. https://t.co/bbJqlLAYVJ @KRenniegade Well it looks like your patience paid off because Arthur is perfect for today's prompt. He'd also work well for tomorrow too. @KRenniegade Awesome! The white highlights add a lot of extra detail and depth. Is this digital? https://t.co/FNxG4bY0ND BOUNTY HUNTERS! Your next target has been identified.\n\nFind him first: https://t.co/yMagY3Tr5s https://t.co/6RQJ6KomWl @EpicPins They are pretty awesome. https://t.co/i5PRUfzEYJ @Staggerilla That's awesome! Have fun taking on the Swarm. https://t.co/N64WWqtq1m @stickerboy Glad you've been having a positive experience. https://t.co/GpriMBBvVg @Facium That will be a nice way to wind down between classes. What game are you going to test out? RT @Borderlands: It's raining Eridium this week in #Borderlands3 with increased Eridium drops and Eridium discounts! This update will be ap… @Halo Cosplay idea. https://t.co/6fAMwbJaZq @MrC0A Us right now: https://t.co/XOahClDbPI Hope you’re not afraid of the dark. Play the Fight or Fright Collection Event today in Apex Legends.\n\n🎮: https://t.co/nbdknar56K https://t.co/SMRogxInnV @PrimalHD1 Good to hear! We'll be checking it out in depth this evening. @DudeGoBack They're basically just land lobsters. RT @TheSims: What a magical day for a game pack release! #TS4RealmOfMagic is OUT NOW on console! 🧙‍♀️🧙 Simmers and Sages, let's gather toge… @MaDzGaming_HC Keep I'm coming! @PrimalHD1 Time to check out all the new stuff! Having fun so far? @SoupaBuoy Great to hear it's working so well for you! Thanks for the feedback. @nation_lewd Take it slow. Fight hard. Praise the sun. https://t.co/VXu32SbgB5 @NasserHomsi We always love to see them! @FritoCrash Our pleasure! Thanks for sharing the clip. @DudeGoBack We like that the Australian perspective is \"At least the spiders are big enough that you can see them coming rather than have them hiding in your shoes.\" @XboxPope Community designs like this are our favorites. @MaDzGaming_HC Good times! We hope you had an awesome stream. @RatedIM No new titles are being added to the Backwards Compatibility library. @YoDabz How are you enjoying the update so far? @Prod1gyXx Time to fight the good fight. https://t.co/08DaOCODpi @alicialovins Back on stream! Always glad to see it. @FritoCrash It's looking great! @CaptainJoeBoss We can still take a moment to appreciate Skeletor. https://t.co/jsbKXC0bsE @maggie_plays Glad you're having fun! We've been playing Dead Cells lately. @HdEvo91 We love to see that community support! @pyrosplayhouse The dead will rise. https://t.co/0VrsDF5L8T @mancave_tv That's awesome! Hope you keep having fun. https://t.co/pUlhKTHCo6 @HanksRylan You know we love it. https://t.co/PqRzuG547Q @oceanr08 Awesome work! https://t.co/fWYTVplVQy @GarbageGrove253 The environment adds interesting variables to keep track of. It's a lot of fun. Drop into a New World 🌎 \n\nFortnite Chapter 2 is available now. https://t.co/GlJZ6dgDmx @meltdown_mp4 We're pretty sure nobody can skate as well as they do in that game. @Nifty_Nick32 Both are great games! Love all the captures the Forza community takes. @DudeGoBack Oh, we never go underground if we want to relax. Spiders are stressful. The arctic apocalypse takes no prisoners. Frostpunk is available now.\n\nLearn more: https://t.co/unj3f0XiaM https://t.co/ykBC67M2FD @NasserHomsi No problem! Hope you're enjoying Gears 5 and we look forward to seeing what other captures you take. @NasserHomsi @SocietyOfVP @Chris25551 @_GameScreenshot @GamerGram_GG @Brokenvegetable @seanwisp1099 @Mr_Pebb You're really great with lighting! @NasserHomsi @Brokenvegetable @Mr_Pebb @desperado9009 @Chris25551 @DonJoewonSong @W89PL @SocietyOfVP @oggis_prsx That sunset is amazing! https://t.co/NRWPy5r1Ej @druyii That's awesome! https://t.co/XAtQJXbq2U @Jakeyp86 It looks very lost in thought. @TheMadGamerHere You found a nice spot to overlook the area! https://t.co/8XjeOqIRWd @BenedictChoy Seems like sound logic to us. https://t.co/kZ3tthJvIh @Element3579 A good run indeed! Excellent work. @TikaaniOfficial Glad to hear it! We've had a great time so far, and it's been fun to watch all the new players checking it out. @meltdown_mp4 That's cool! So you took up skating after you played it? @The_Michelle620 It's spooky season and we couldn't be happier! Have a great week on stream. https://t.co/5eDtiZ7ad5 Join us on @WatchMixer for a frightening good time:\n\n💀 The Dark Pictures: Man of Medan\n⚓ Sea of Thieves\n🧟‍♂️ Plants vs. Zombies: Battle for Neighborville\n👑 Dishonored 2\n\nAnd more! Tune in: https://t.co/EalUwrE8O9 https://t.co/ruNriUqK1d @TragenHerrick Hmmm.. what have you played lately? @Element3579 How'd the rest of the raid go? Pick up any good loot? @TikaaniOfficial We love a good co-stream. @CNieldMusic How awesome! Thanks for sharing the pic from your meetup. @DudeGoBack We usually call it \"relaxing mode.\" @gizmogamestv He's a really mobile character which helps us land combos easier. @Trippy_HippieTV Ah yeah space pizza! @gizmogamestv Nice! We've been playing mostly as Cinder. @the_king1089 Spookiness checks out. https://t.co/d0FcMTnpD0 @leviathanbrown Making some chicken dinners for yourself! @oceanr08 Whewww! You've got some serious skills there. https://t.co/EynLjJ2ae6 @Crazygamer360 Best wishes to our northern neighbors! https://t.co/EJ9EOdYBI6 @CrystalTeeger One of the first, still one of the best. @gizmogamestv Is Spinal your go to? https://t.co/gOtq7XUQ84 @TikaaniOfficial How are YOU enjoying it so far? We've been having a blast. https://t.co/VJUZCwbvXs @HanaSongFan Does this count? https://t.co/f7g2UJSF4p @TheLazyKoala1 Sounds like the perfect excuse for a family co-stream! @Dylan_Lawson02 New games are not being added to the Backwards Compatible library, we're afraid. @HanaSongFan Think we're getting closer. https://t.co/abMQhpcpGk @AhmedA4129 Spider Jockeys get us in the Halloween spirit. @HanaSongFan Hmm... https://t.co/NgFsZRthy4 @TwitterGaming Not sure if favorite is the right word. https://t.co/642AnrvnSe @Muzlqmaker There was so much to find and unlock in ODST. We spent a ton of time on it! @roaring00s Nice! Now you can just pick up another game! ;) @Lovttit That WAS pretty clutch. @ryan_khay It's going to be great to take to the skies again. @TheMadsoda Project Scarlett was announced during E3. You can read about it here: https://t.co/utgOn08KcE @motes_landon Please monitor @FortniteGame for any questions about the #FortniteBlackout. @StitchAndSpyro There is nothing to update for Fortnite on our end. Keep an eye on @fortnitegame for questions about the Fortnite Blackout! @TrashAtFortnit2 Keep an eye on @fortnitegame for questions about the Fortnite Blackout! @gearnuke We can confirm that Xbox Live is online and operating normally. Please monitor @Fortnitegame for questions about the Fortnite Blackout. @lilsewer666 Did you try the Konami code?\nUp, up, down, down, left ,right, left, right B, A, Start @Michell59651354 Looks like something is going on here...\nhttps://t.co/1Ke90WbPUd @nickpower179 Looks like there is something going on here...\nhttps://t.co/1Ke90WbPUd @AWildHanimal That looks like a cat with some strong opinions on Demogorgons. @MicrosoftStore This little buddy can join our fireteam any time. Preferably after what looks like nap time. https://t.co/7azDjI5Nrf RT @ID_Xbox: Play as a reluctant hero or villain to save the world, or just save a colony of bears from lumberjacks. However you play, you’… Want to be a part of all the #X019 action? Now’s your chance.\n\nHead to your local Microsoft Store for some fun-filled days of gaming on October 13, 20, and 27. Two lucky participants will win the Grand Prize: tickets to X019 in London!\n\nLearn more: https://t.co/4Hvo065bpH https://t.co/w6ugpAY9xy RT @WWEgames: The full #WWE2K20 roster is live! Who are your favorites? https://t.co/lnFDulmRqp https://t.co/xrhxduNn10 RT @satyanadella: It’s National Disability Employment Awareness Month, and the Xbox Adaptive Controller is a great example of the power of… @kimiboss77 Glad we could brighten your day. Hope you have a wonderful weekend! There’s never been a better time to join Xbox Game Pass Ultimate.\n\n✅ Xbox Live Gold\n✅ Over 100 console games\n✅ Over 100 PC games\n✅ 6 months of @Spotify Premium\n\nGet your first month for just $1: https://t.co/jcKfplo9hy https://t.co/MU9BsIPEg8 @MegaBadseed Nice to meet you Eagle Eye. https://t.co/Z2weBcVlQk @kimiboss77 Love the different angles for these captures. https://t.co/CaPw06knpy Time is running out to get your tickets for #X019! Thursday’s session tickets are officially sold out, and the rest are going FAST. Proceeds support UK charity @SpecialEffect.\n\nGet your tickets ASAP: https://t.co/hxNxNHoAc2 https://t.co/vQ6NVulO8b @DJermolowicz Luis just wants to make sure those zombies stay dead. @DJermolowicz We'd play as Zoey! Love how many different kinds of creepy zombies there are to fight. @Tragedyjr3 We love keeping in touch! Amazing community to talk to. @Merginator That look of pure enjoyment is priceless. Best achievement ever. https://t.co/gqVqP5yLXd ....aaaaaaand fight!\n\nPlay for free October 11 - 14: https://t.co/3xUGSczg8Z https://t.co/xiwSwUXU9M @SylentlyKilling Awesome! Love all the artwork you have too. https://t.co/XF8s9sP6cV @gamezstaa So much H Y P E https://t.co/kzw7oZCKJA @Wwefan82007 Then we'll just say all of them brother. https://t.co/RpTUwmuT9o @Darlene61418758 This sums up the first time we ran into a witch. https://t.co/8iv63hfZlC @Jones96Nathan Happy account anniversary! Thank you for being part of the community for so many years. https://t.co/m4mbtAYInj An absolute unit.\n\nThe hunt for Rajang starts tomorrow: https://t.co/on2tAtdHUl https://t.co/U7FUgLdKIK Presenting the hot-blooded, cool-headed Ocelot Jugular.\n\nGet yours today in GTA Online: https://t.co/JqeGVoIE9y https://t.co/KulfvUFOV4 RT @CivGame: Exploring the map and moving units is a snap in Civilization VI on #XboxOne. @Xbox \n\nTake your turn on November 22. https://t.… It's a brand new week (on Xbox) which means...\n\n-New indie games from @ID_Xbox \n-New games coming to @XboxGamePass \n-Even more new games because why not?\n\nWatch the full episode: https://t.co/VD2IblWLUF https://t.co/gGNiZ3CEEB @S1N1ST3RF0X Hope you love it! Happy gaming. @VIBE_BLUE Those are both really fun modes! We played a lot of Team Deathmatch and Kill Confirmed. @ny_nonchalant The offer is available to new subscribers of Xbox Game Pass Ultimate, so if you had the standard Xbox Game Pass subscription and wanted to upgrade, you could still get this. RT @TheSims: The Sims 4 just got more colorful on the @Razer Turret for Xbox One💚With @Xbox Dynamic Lighting support, your keyboard &amp; mouse… @stouph87 We got so nostalgic when we saw John Marston in RD2. @shadow64dd What are your favorite game modes for BO2? Join Ajna and friends in an action-packed RPG platformer you have to see to believe.\n\nIndivisible is available now: https://t.co/t0ilqhxSu4 https://t.co/nMnl2NvGlV @nick71223 Glad you like it. We're excited about being able to save 3 custom profiles. @Javierjr201 Then we won't make you pick! https://t.co/ZfUkwM7YZo @jason_delph Bet it makes things more special when you can game with your kids too. https://t.co/staMjtkp8F RT @RockstarGames: WANTED: Dangerous military defector Sergio Vincenza is on the loose.\n\nTake on Vincenza and his anarchist gang in this we… @Bigfern7707 Definitely! Which Xbox One controller do you have your eye on? @XboxQwik You’ll always be on our friends list. Thanks for 20 awesome years! @Keys60datman Yep, Ghostbusters: The Video Game Remastered released on October 4th. Here's the launch trailer: https://t.co/K561FyQVmb @queenxpawn Got to love any game where you get a doggo companion. @echeniqg See what you did there. https://t.co/PHldTfyBJA @rhysholt1 Some of our favorites too! https://t.co/T5zeuMPdkZ @TRYmeRUCK They both deserve a lot of love! https://t.co/A7GwwqwmcW @Wendys Loved exploring Albion with our goodest doggo companion. @Kingdom_Soldier We also accept \"everything\" as an answer. @S13Piotr You all are fun to talk to! @AlexjDowns Yes, this and other Xbox One controllers will work on Project Scarlett. @AdamFad84 We're still playing it! https://t.co/kYzOcezfmx @XboxOneReece Good to know we're not alone. https://t.co/UMWAFLCSHy @271Raptor A solid reason to. https://t.co/91sB5Z5yrd @RTD_62 Was so hard at the ending to let go. Just wanted to keep fighting and hope there was a way out. @DanielHeithorn Still have so many feels from Gears of War 3. https://t.co/VwxBF2pZB8 @TrimmyHedgesTV Still remember seeing Rapture for the first time. https://t.co/o4f9NzOiNv Who’s excited to unbox the world’s most advanced controller?\n\nPre-order the Elite Series 2: https://t.co/Uo3hdbClmB https://t.co/OjfckAmD4O @_LarZen_ That is a very good call. https://t.co/1sNnIF2Xvf @ScufGaming Breathe! Breathe! https://t.co/BLxPlvzXka @XblDwizurd Hope it's a fun nostalgia trip! @SikDeathstroke Hijacked and Nuketown 2025 are still our favorite COD maps. @moitoi Or as we call it around here \"the friendship tester\" @A_i One for adrenaline fueled battles and the other for winding down on a scenic drive. https://t.co/jR162C3LI6 @ddoguzman We put a lot of hours into Hardcore Team Deathmatch for BO2. @_LarZen_ Yes! This is storytelling at its finest. @MckinzieEvan Can still hear the witches crying. https://t.co/TWuhhQlaCt @shinobi602 Squad goals. https://t.co/rMpYMdIMkO @littlesiha It's like we're the same person. https://t.co/ZGIWIYCvev @Meg_Kaylee Still remember the moment when Morrigan considered us a friend. https://t.co/8CrsZ78hKH @skully_u Looking forward to seeing what you build! Holiday themes are always fun. @bochia Remember Reach. https://t.co/OboaubMmI8 @ClareGrant That game kicked off an amazing series. https://t.co/KNv80XFbFC @XblDwizurd Have you played the remastered version? https://t.co/mxc6APiL2a What’s your favorite Xbox 360 game? @Grimreeper720 Hmmm... https://t.co/SMqM6dSIQY @Cameron_Balser_ We strongly encourage you to report them. Check out enforcement here: https://t.co/94xVodf6LK, and there are more instructions and info here regarding reporting a player: https://t.co/coMhQI8WX3 RT @WWEgames: Check out #WWE2K20’s MyCAREER mode featuring both male and female MyPLAYER characters! More details: https://t.co/yjF8BkqIxs… @skully_u Looks like an awesomely spooky realm! https://t.co/0jKkEe9LVC @Lonewolfgame12 No, sorry it is not on Xbox Game Pass. @darksilence669 Can only imagine! Hope you keep enjoying yourself and continue to reach your goals. We'll be cheering you on. https://t.co/pYN3jZrEYU @DarrenBinHD Looks like you're ready to bust some ghosts. Remember, https://t.co/ocHWBY1mYS Batten down the hatches. The online pirate world of Atlas is available now on Xbox Game Preview.\n\n☠️: https://t.co/BJODEzXp1I https://t.co/93m8axMp5l @Section0931 Us too! https://t.co/hk5H8lbzP5 @darksilence669 Huge congrats! That's a major milestone. https://t.co/xd0SxQledt @NasserHomsi @SocietyOfVP @DonJoewonSong @ralphmfulton @_GameScreenshot @Brokenvegetable @Mr_Pebb @desperado9009 @Chris25551 @DaCoPilot @XboxANZ So beautiful! https://t.co/WUf2Df0EYS @BadandBrokeGee The monthly pricing is listed above the promo price at the following page. You can also check out more details under the FAQ: https://t.co/4huBYTyxAD RT @TESOnline: Ding ding ding! We have hit 100% in the #DragonRise event. All players who own Elsweyr can unlock all of the rewards – just… Assemble your squad and get to work. Call of Duty: Modern Warfare is bringing the massive 4-player co-op world of Special Ops to Xbox One on October 25.\n\nPre-order now: https://t.co/03GwDdtN46 https://t.co/h6FgZGHttT RT @Team17Ltd: Have you got what it takes to beat Capital B’s Impossible Lair?\nYooka-Laylee and the Impossible Lair is available now on Xbo… @Georgekon4002 It would be the perfect for someone who is newer to gaming!  Hope you both love it. @actinglife3 Back at you! https://t.co/x8v2FEl5Ra @Kathy_15xx @xboxuk @RockstarGames @RedDeadSnaps @RockstarRDR @RedDeadBase @RedDeadNet @gametographers @SocietyOfVP This is stunning! Love the colors. https://t.co/McSIsBCIPM @Yaelosos Gamers for life! https://t.co/R7qfzVsBXA @Georgekon4002 The developers did a great job with their commitment to realism. Feeling the H Y P E https://t.co/yygoBw0MZ6 @actinglife3 May I stand Unshaken makes us want to ride off into the sunset. Also, loved Train Heist Theme since it fits so perfectly with the mood. https://t.co/2sRwFqplHf @actinglife3 Those are all awesome games! Love how beautiful Read Dead Redemption 2 is. https://t.co/zExuCgQVUd RT @Borderlands: Let the hunt begin! More Rare Spawns dropping even rarer loot, this week only in #Borderlands3!\n\nLearn more: https://t.co/… @NoobCreations No problem. Wishing you the best on all your future goals. https://t.co/iud0Oped4N @SikDeathstroke Aww thanks for being part of the community! https://t.co/q6nf71tiVU @Yaelosos They have introduced us to so many great friends and amazing stories. @Kirbylight_2 Got a lot of love to go around. https://t.co/SLXzRcbWG0 @TheKingdom1115 What are your favorite ones? @GentooWizard Project Scarlett was announced during E3. Here's a link to reveal trailer if you want to see it: https://t.co/onbWOAmazh @barton_vojtech Thank you for being part of the community! https://t.co/ye1NZsCL19 @acidlure That is adorable! https://t.co/Db67UvxXxR @NoobCreations You can download Unreal Engine and Unity for free. They have great documentation and classes. Might be worth checking out to see if you want to pursue things further. Out of the shadows and into the fight.\n\nGet the Night Ops Camo Special Edition Controller now: https://t.co/znuCkS3jeK https://t.co/OhDh8d8nzG @NoobCreations If it's something you're passionate about, then you should go for it!  Are you interested in programming or animation? @iintrovertted Project Scarlett is arriving Holiday 2020 alongside Halo Infinite. You can read more about it on our website: https://t.co/UjjEvMdw7E @ErnestSandova19 We love our community! https://t.co/7jgnEx3uck @itzmekytrexx Same. https://t.co/ig1xPADmg1 @acidlure Sending love back! https://t.co/pPsRNROSX2 @Stefan55803652 It's a great game. https://t.co/1i6HXe2Uev RT if you love video games. @ChrisHurley44 Love the art style for it. Good luck! @TikaaniOfficial That's a great cause to stream for. \n\nAlso, just saw that double kill while you were defending! So awesome. https://t.co/g8oClGzoPC @louwouhou It's not part of the Game Pass library, but we're happy to pass along feedback that it's something people are interested in having on Xbox Game Pass. @slowhed That is the proper coffee cup size for us. https://t.co/HIGGwCeDDJ Congratulations @TannerFoust on the ARX Championship. 🏆 https://t.co/GaLb7nlJCm @Christan3390098 If you signed up as a new subscriber to Xbox Game Pass Ultimate while this offer was available, then yes. It takes up to 10 business days for the Spotify codes to arrive via email and the message center on your Xbox. @Khaenin You both will do great! https://t.co/gsit5F6wQX @KatrinaRoets A code will be sent via email and the console or Xbox (Beta) app message center, following your purchase of Xbox Game Pass Ultimate. This could take a few days. To learn more you can go here: https://t.co/kqbCNWWewS The rules of engagement have changed.\n\nModern Warfare is coming soon: https://t.co/pAyTTLqzRD https://t.co/6QUAWjkt89 RT @ChildrenOfMorta: So excited about #ChildrenOfMorta coming to @Xbox on 15th of October!\n\nJoin the family of Bergsons and fight against t… @NNortherners Remember, don't cross the streams. https://t.co/9UpYfwKrLI @Redtears1011 That's true! Those diamond achievements feel extra special. https://t.co/hzVpafxYJp @Ya_Boi_Mitchino As support main, we appreciate it whenever our tank can pull off an epic ult. @Khaenin Family can make the best co-op team! Also, think it's awesome you didn't give up and came back to beat Halo 2 on Legendary solo! @Khaenin It's the best feeling when you do beat it on Legendary! Did you do it by yourself or co-op? https://t.co/LACXfGT62O @Ya_Boi_Mitchino Landing a good Dva ult is so satisfying. Especially, in comp! https://t.co/KTSGZJR4OA @rosekiller1187 Love the floors! Whole house feels cozy. Join us on Mixer this week for:\n\n🚀 Destiny 2: Shadowkeep\n🏰 Bloodstained: Ritual of the Night\n👑 Apex Legends Season 3\n🏒 NHL 20\n\nAnd more! Tune in: https://t.co/EalUwrE8O9 https://t.co/dUeNJEmx4r @Atrus7 Anyone who gets that achievement can talk about it as long as they want. https://t.co/r21OQwDB70 @shmitt_TTV That was impressive! https://t.co/khLqQS1stU @TeckJunky37 Helps you create mayhem in style. https://t.co/SSQwi4wLSy @Ya_Boi_Mitchino We were so proud when we got Zen's pixel spray. https://t.co/5mopaIcVkZ RT @FortniteGame: Demonstrate complete control in The Combine for a chance to win 1 of 10 Special Edition Fortnite Xbox Controllers! \n\nRepl… @M21Gaming We like that team comp too! @HazzadorGamin Something to be proud of for sure! The Full Crew is a hard one to get. https://t.co/daIBaEAujg @ears_801 That's really impressive! https://t.co/PQbt3y7bue @RedDeadBase And just like that, all those feelings came flooding back https://t.co/pGS6TvrkOq Grab your squad. It’s hunting season, Ghosts.\n\nGhost Recon Breakpoint is available now: https://t.co/LWEvzOOekH https://t.co/d367xjuwU1 @recastaldi Couldn't agree more! Which games have you been checking out lately? @OrioTar That's exciting! https://t.co/pvFWqfcBLR @makeithoppy This is really wholesome. https://t.co/dxSbRHL5s4 What achievement are you most proud of unlocking? RT @xboxuk: Tickets are still available for #X019, the biggest Xbox celebration of the year 🔥🎉\n\nBut be quick, they are going fast 😱\nSecure… Totally Psycho-delic. RT and tag #BL3Sweepstakes for your chance to win this custom @Borderlands 3 Xbox One X.\n\nNoPurchNec. Ends October 19. Rules: https://t.co/WvK9lt7VoH https://t.co/A6uIuIQHPp Call the shots this Pre-Season. Get the right @NBA2K Xbox One bundle for you.\n\n🏀 Xbox One X Special Edition Bundle: https://t.co/LiKlyMh8zE\n🏀 Xbox One X Bundle: https://t.co/s2e86qD9rC\n🏀 Xbox One S Bundle: https://t.co/7KgesnMBfI https://t.co/jBHcIzXVp5 RT @EASPORTSNHL: New Season. New CHEL. #NHL20 https://t.co/Q1na2whmN2 https://t.co/fAw6WynYrt We have a pretty solid idea of who you’re gonna call.\n\nGhostbusters: The Video Game Remastered is available now: https://t.co/bvScsT9qPX https://t.co/nQhXN7MndW @KakashiWasHere Also hats off to your Gamerscore! https://t.co/Zjtwaaptun @Trevr1111 Y i k e s https://t.co/3ETbDpcdkw @Trevr1111 We're listening. https://t.co/PK2r36WtOO A Haunting new track, sinister new racers, and spine-tingling new skins are making their way to CTR Nitro-Fueled.\n\nThe Spooky Grand Prix starts today: https://t.co/tLeXF9nNic https://t.co/L5aKVmYa83 @NoviKaiba23 @Captured_Collec @GamerGram_GG Absolutely beautiful. Love the lighting in these. https://t.co/ql8F9fM0Nq @KakashiWasHere Happy account anniversary! Thank you for being part of the community for so many years. https://t.co/JnQ9qyuPcv People’s custom characters are a window into their soul. @JerrySoCal Great use of the high ground and grouping them into that corner. https://t.co/TKSuoAcfO7 @AnthonyLobato Struggling through it with a friend is what makes playing on such high difficulty so fun. @AnthonyLobato Right? Still need some time before doing a second playthrough on Insane difficulty. @AnthonyLobato Both games have great stories! Are you mostly doing multiplayer in Gears 5? https://t.co/gd786DQdPr @AnthonyLobato Glad you're happy with it! What have you been playing lately? @The_Michelle620 Same! At least they give you closure at the end. https://t.co/k8yEl1jetC @The_Michelle620 Our main concern was to make sure Bullet was safe. They make you so reliant on him, it's hard not to get really invested. @DanielleBlair4 It's running through April 1, 2020! Your court. Your team. Your console.\n\nCheck out the Special Edition #NBA2K20 Xbox One X: https://t.co/xvVBdRbheI https://t.co/GQYYnpLcyn @EpilepticZ0mbie Afraid not, this offer is only available for new subscribers to Xbox Game Pass Ultimate. @atfirstplay You have a really good eye for them! Excited to see what captures you take in Gears 5. @The_Michelle620 Did you finish the game? https://t.co/DajMb9THOG Jump in. Jam out. Sign up for @XboxGamePass Ultimate for only $1 and get @Spotify Premium free for 6 months.\n\nJoin now: https://t.co/UBZO679qjI https://t.co/rqoh9PfMGx @The_Michelle620 Getting close to the end of the mystery! https://t.co/RYHDi6cKdc @TudorMiulescu It's such a beautiful game! @MysteryStrangrr We feel too guilty and there are so many people that look up to him. https://t.co/m3BiSruISp @Ashton87498785 What character have you been playing in Borderlands 3? https://t.co/hBI9kDYpLr @ACID360 The graphics are amazing. Can't wait! @atfirstplay Great captures. Love the close up! https://t.co/9e6pjtBonm @M21Gaming Love running around with Garrus on our team! https://t.co/P6MkMafFCD @BLUBBERxMAN So many fun shrines. Did you find them all? @kharzenius23 That's a mighty fine ship. https://t.co/DmG8nGqN6W We're taking the show to new heights this week (35,000 feet, to be exact).\n\nAll aboard: https://t.co/OhQqHyIUXy https://t.co/pfJTDx2Yss @MysteryStrangrr There's so much depth and unique variables to the game you can play it multiple times and have different experiences. https://t.co/6L0JP6fPq7 @KenzieRetroYT And we'll be right there with you. https://t.co/z5fqtIBjGF RT @RockstarGames: With traction like this, the only obstacle is your imagination.\n\nBorn in the desert, brought to the city. The Annis Hell… @KenzieRetroYT Ori and the Will of the Wisps isn't too far off either! That's what we tell ourselves anyway, to make the wait easier. @RatQueenEXE We'll just pretend like it never happened. 😇 RT @TheDailyShow: Trevor is LIVE with @Ninja right now on @WatchMixer: https://t.co/fvUCkzMVJK https://t.co/1FM2h02oro RT @XboxGamePass: Every tweet happens for a reason. this one is because we just added a bunch of games\n\n(extremely pro tip - download games… @FrankGarza117 It's hard not to feel closer to your little space crew on each playthrough. Now we want to go back and play them again... @TomNewm31238534 We really enjoyed the combat too! Profiles were a game changer. @RatQueenEXE Puzzles are fun and all, but we're still not over the ultimate betrayal. https://t.co/QGQR68wOcq Hockey season is in full effect. \n\nPlay for free October 3-6: https://t.co/npk1xuce5o https://t.co/SzmncgqaRE RT @Borderlands: It’s Boss Week, badasses! This week only, select bosses have an increased chance to drop various Legendary items in #Borde… @KSilverclaw For us the first playthrough was mostly spent ignoring the main objective and just exploring the world. So much to find! @AwesomeC08 Afraid not, this offer is only available to new subscribers of Xbox Game Pass Ultimate. @The_Michelle620 How often is he instalocked in the select screen? @LadyAlexiel22 Both game narrations make you feel like you're part of the story. Wonder if part of that is due to the horror themes. @LadyAlexiel22 Right there with you! The next time we play, we're going to focus more on using photo mode. @LadyAlexiel22 Especially the way they built up the final battle. We were not ready to let go. @LadyAlexiel22 Missed a few in the beginning because we were on edge wondering when the next battle would come. https://t.co/5lKhhmugvB @CavAlbie Love the foggy background and the tree's reflection on the car. https://t.co/rDNGjRVtB4 @LadyAlexiel22 There are so many little details that immerse you into the game. The Lorestones were a big part of that and how Senua interacted with the voices. RT @Borderlands: It’s been 10 years since Borderlands first made its debut in October 2009. Join us for a month-long celebration of the O.G… @LadyAlexiel22 We could talk about Hellblade: Senua's Sacrifice all day!  The symbolism was so powerful and loved the combat. https://t.co/e6zoUsVvNt @FlyinBodyParts Replaying FF8 right now! Trying to get all the GFs. https://t.co/vWc6NQEzGf @LadyAlexiel22 It has such a cute art style, but the story is dark. @BWA_CJ There's always a new dark alley to explore. https://t.co/WVFgWmNlDL @AmerDaneel That's awesome to hear! @eckoxsoldier It seems like there's always something new to see. @Clashmain The most dangerous game. https://t.co/2w86qyUBPK @LostMusicfreak We've had pretty smooth sailing since last afternoon! Hopefully you haven't had any more speedbumps. @LyonHart_ Can confirm https://t.co/WqNehB41sd @sheekonfiya That was such a cool mechanic! That era of Final Fantasy games had the best mini games. @LadyAlexiel22 Us right now. https://t.co/SFujHuct7I @LadyAlexiel22 No worries! We're just excited to hear how you like. @Virtue_BR You've got so many of these! https://t.co/SCUxl39BYp .@LeVeonBell and @TheAdamsEra are friends on the football field and the battlefield. @ghostrecon @BleacherReport\n\nPre-order Ghost Recon Breakpoint: https://t.co/4EW3gTtIeR https://t.co/n9WACDv8by @LadyAlexiel22 So many games to play and revisit! Did you ever get a chance to check out Crawl? @StevenM1989 Our motto with that game: If at first you don't succeed, die and die again. https://t.co/WNjv93ao1s @GlebLapham Nothing that playing through Mass Effect again won't cure. @SmilarMedia Sounds like a fun way to spend a Wednesday. How'd the stream go? @LadyAlexiel22 All those have great stories and are worth another playthrough or 5. @ZephyrStormBorn Sounds like you're an expert! https://t.co/t3tUfLmV0p @NickPick_13 Sounds like! We always have fun re-playing the previous game just before the new one comes out. Approach with extreme caution. Take on the murderous Owlhoot family in Red Dead Online’s latest Legendary Bounty Mission. \n\nAvailable until October 7: https://t.co/3cllu4JrOh https://t.co/kWXl9XAvCm @PS_Eire_Dylan18 We had a lot of fun going back and giving that another play through. Especially after learning John's backstory. @MadMontyMN Once you really get the hang of the controls you start to be able to do the really fun stuff. https://t.co/ChBBsTjrfN @43Silencer Nice! We were thinking No Man's Sky-are, but it might be a stretch. @DurcanDonuts It's one of those games that takes a little while to get going, but it's well worth it. @LambentHammerB Having a buddy by your side improves any experience. https://t.co/m9c9wsTBCW @ThunderbyrdLive The random encounters also added another variable! We usually like helping people out, but a couple of those could turn dangerous if you let your guard down. @juk52011 It's easy to miss things the first time! Witcher games are always well worth another play. @rhysholt1 Jack will always be one of our favorite robots friends. https://t.co/jiRCyMuYPx @Meyrick94 Sometimes it's just the right game for the right time. @marlonb1984 First time we were Moze and now playing as FL4K. Love his pets! https://t.co/3PbcSzM3kT @Brad_Artych Sometimes the Witcher games can almost be overwhelming. You've got it be ready to give them lots of attention. @skeppyluv Forza Horrorizon 4 https://t.co/GkOrWWYDZc RT @WatchMixer: Squad up with Team @Xbox as they take on a Ghost-gone-rogue in Tom Clancy's #GhostReconBreakpoint!\n\nLIVE: https://t.co/CdrK… @ZephyrStormBorn Well, with Borderlands you have to do at least one playthrough with each character. https://t.co/6hm54Fx4EQ @bradysharp12 Would you kindly... play Bioshock again? @ThunderbyrdLive Red Dead Redemption 2 has so much to discover. Depending on your choices you can have really different experiences on each playthrough too. https://t.co/xI3N8TNjw6 @fearthrower The code should come to you in your Xbox messenger. It might take up to two weeks. @bret_owen99 This seems to be a really common answer! It's almost like The Witcher 3 is a massive, incredibly detailed game or something. @BKinggamer It's one of those games that is just too stunning to catch everything the first time. @0kuyasunijimura NG+ is always a whole new experience. https://t.co/NHIofvYj0Q @lukashi_sensie Some games get better when you really get into the backstory. Reach was definitely one of those! @EternalSling They made some pretty serious updates for Season 2. https://t.co/Ea1X6viMlo Home grown 🎮\n\nSave big on Xbox Game Studios titles: https://t.co/5ljijh3OZI https://t.co/tuV9UdKNyn @Havoc50K Do you prefer the \"start from scratch, just harder\" or \"keep all your stuff\" versions of NG+? @RonanTheVillain That's a good one! https://t.co/ZHs1Gsnjrr @KajanPetit Knowing the lore and getting more invested makes every Witcher game that much more engrossing. @rhysholt1 It's fun trying to find all the components for Jack's upgrades too. @TwitterGaming Boo-derlands 3 https://t.co/fnjPcuYbIz @MikeyLowe6 Hard to do anything bad around this good boy. https://t.co/ZZdr3Dg0N1 @MBoy_10 What do you think changed for you that made it better the second time around? @ButterflyDraws We loved it the first time, and the next time it was even better. @ITSUPPORTBRYAN Nice! Playing it on the Master Chief Collection? @thatmantaz We're been super excited for the updates that just came out.  So many new things to do! @Riident 1st time: \"How do I shoot aliens?\"\n2nd time: \"WHY do I shoot aliens?\" Your squad just got a lot bigger. PLAYERUNKNOWN’S BATTLEGROUNDS cross-play with @PlayStation is officially here.\n\n🍗: https://t.co/dfpP9PAckL https://t.co/QO8tsbbwyW @3_monk Your existing Gold subscription as well as your Game Pass subscription will be converted into Game Pass Ultimate. You should be eligible as long as you haven't subscribed to Spotify or haven't had a Game Pass Ultimate sub. @Axelthemexican1 Waking up in that rusted out car all over again... https://t.co/yGIRTawxSe @rhysholt1 There's so much to explore in Gears 5, it's worth a few playthroughs. https://t.co/qCvEN1NkZM @albinomachina Awesome! Got to show him where it all began. https://t.co/JvugjKeUKX @Paper_Cut11 Between the positive community and how beautiful the game is, it is an awesome game to stream. https://t.co/WESZjhFDZy @IpsilonTheBard We tell ourselves on the second playthrough we'll be evil, but end up feeling too guilty. https://t.co/iT4AhAdYHi @albinomachina Playing co-op with someone else makes a game more special. Did you and your son play the other Halo games together? @MrLJDennis Such an amazing series and the story has a lot of depth. Loved Elizabeth's character development in Bioshock Infinite. https://t.co/HTgsqALhlN @ChrisNajar Well, technically the T-800's already in it. So just him without any skin? @CastTonSetUp We definitely need to replay that one. @EpicGamingAU We got a little spooked just watching the clip! @Paper_Cut11 Photo mode is awesome. Love seeing all the beautiful captures everyone takes. @TheSoulRisen That's an excellent reason to push it back. We're excited to watch some streams of it! @KrayZmnd Nice! How'd you like the new map so far? @GoffRokkit \"offer ends 4/1/2020.\" So about six months. @ungramsYT You'll be mailed a code! Keep an eye on your messages, it could take up to 10 business days. @jDot_BumbaClot If you're looking for one, the Series 2 of the Xbox Elite Controller has an internal rechargeable battery. I'll be out in a little over a month. @kcarp009 Check out some of the exclusive titles on Game Pass. Gears 5 is a great place to get started. @RoninWolf02 The real ones remember. https://t.co/s8cwQQJLqk @OMGItzProYT Sorry, this offer is only available to new subscribers. What game got better the second time you played it? @FUTcoaching When the day comes, they'll have an awesome teacher. https://t.co/MXfuTJQAkL @FUTcoaching That's really sweet! Will they be gaming with you? https://t.co/0J5SFI1RVS @jm86579 You do need to be a new subscriber for this offer. @kamelraw Sorry, but the offer is only for new Game Pass members. @JoshuaSullivan You'll have to 1v1 her for it. https://t.co/d5tr1dlNGc He said he’d be back. The Terminator T-800 comes to MK11 on October 8.\n\nWatch the full trailer: https://t.co/fkd2oKjOog https://t.co/EwLHVlBwPV RT @PlayBlackDesert: The Tamer has finally arrived to Black Desert Xbox! Experience the power of the Tamer, and her protector, Heilang.\n\nRe… Some things shouldn’t be woken. Prepare to conquer your fears.\n\nDestiny 2: Shadowkeep is out now: https://t.co/uVS5dD7lRM https://t.co/uSbekz3gKa @JoshuaOrtega88 Hope you can make it! We'll keep our fingers crossed. https://t.co/Hq8hHMBhhS @LostMusicfreak Hopefully you'll be back online and back to work on the moon soon! @LyonHart_ Dogs and elephants and... ninjas? @pmak1104 We're afraid not, the promotion is just for new subscribers. @JerrySomervill6 No, that was a separate promotion. @JoshuaOrtega88 Are you planning on going? @Yakuzasaga That's awesome! https://t.co/ySs8YaGOhx Can we talk about the badass elephant in the room?\n\nBolt and Tembo the Badass Elephant are available now: https://t.co/64MaZPHPT3 https://t.co/xEcqTMtJQg @CallumEastham So exciting! https://t.co/T0dqdK3vfE @x_MatrixGamer_x Or in your case, blowing them up. https://t.co/9KKIJ2NR4j @Cubanees Happy to be of help! @x_MatrixGamer_x It's important to look good while running away from zombies. https://t.co/snyHzPFgZm @esaapayne Always fun fighting zombies. https://t.co/q5o2pNthmZ @The_Doctor1984 We'll see you there! https://t.co/cIkynJkOXb @Wandering_Dutch @XboxP3 @XboxPope @XboxGamePass @AceyBongos @aarongreenberg @ForzaErwin84 At least you'll make it out for one day! Have an awesome time. @GGMattt_ Unfortunately that won't work, but good call on having Spotify already! @Real_Sad_Boi No, it's only an option for new subscribers. @kagarwal552 Hey, that's awesome! What bundle did you pick up? @RNL241510 Please forgive us for assuming. https://t.co/IlJwa7Z7xK @Ensor42 Some of us like the mystery. https://t.co/cTGtC5olZt @PinkRoseVA Ooof, we'd blocked that fight from our memories. https://t.co/tZOfjDDHB1 @Neon__Synthesis We DO have lots of games, yes. @Cubanees We're afraid this deal is only open to new subscribers. @lilweebz Unfortunately you wouldn't qualify for the deal. @peterdotedu We're afraid not. It's only for new subscribers to both services. @AhmedA4129 Hopefully plenty of music fans will be able to take advantage of it. @BlakxSwag Way to end it on a high note! https://t.co/2EXUMTXS53 @XtrackerT It's coming right up! We're so hyped for such an epic event. @NanoPolymath We're going to have to pack very carefully... https://t.co/h514MjqRsI @annix_xbl Have an epic time in London! @Monkster1978 Time to do some sightseeing and check out some games! https://t.co/jgW13gOKdr @crajijakku No, it's only open to new subscribers. @The_OY We're afraid new games aren't being added to the Backwards Compatibility library. @ANagusame No, only new subscribers during the promotional period. @AmerDaneel Are you going to have a chance to sign up? Thanks if you do! @LowBeastm9 We're afraid not, it only applies to new subscribers for both services. @DougS_AG6 You should be able to find it in the online store, or check here: https://t.co/mTwEoy7vJt @DuffyRose14 Have an amazing visit! We're so excited for it. @TheChillestVill Get hyped! We're so excited to play it. RT @XboxGamePass: ❗️\n🧙‍♂️- greetings tweeter,\n\nnew Xbox Game Pass quests have arrived. finish them before 11/1 to earn those sweet, sweet M… @TokenGreen We can relate to this strategy. https://t.co/tfRpUPhr60 @Christyna_64 No analog games for you then. https://t.co/gBfSO7IkCG Drop behind enemy lines three days early with Ghost Recon Breakpoint Gold and Ultimate Editions.\n\nWatch the newest trailer: https://t.co/7kSAt81Vhj https://t.co/qDqECVybc0 @Christyna_64 Are you also the friend that reads all the rules before starting a board game? https://t.co/sL6XMrSbe7 @LadyAlexiel22 The best way to get S rank was...well back to Youtube. https://t.co/CGKHGQs6pV The State of Decay 2 Outfit Customization Update won’t make surviving easier – but it will make it more stylish.\n\nGrab it now: https://t.co/ZHe0eSHzEV https://t.co/zzjpwddUiD @LadyAlexiel22 At least that's how it goes in fighting games. https://t.co/h8E2VcZ7xH @Kickassjamas It's how we can look out for each other later on. https://t.co/i9fv639sfe @Clayton82524207 No idea what you mean. https://t.co/MFgSf639d5 @Christyna_64 You're the gamer we aspire to be. https://t.co/5BUskfV7qd @cat5kable We critically failed on our attack roll. https://t.co/aLoK5bIgOM @skipthetweets Did this help? https://t.co/PVCifCP451 @LadyAlexiel22 The Flash describes us perfectly. Button mash until we know what we're doing. https://t.co/5ZaQZGQ8FH No ads. Just adventure. Sign up for Xbox Game Pass Ultimate for only $1 and get Spotify Premium free for 6 months.\n\nJoin now: https://t.co/0t33fimiPJ https://t.co/Cxv9xpmkik @RoadToX0 Love it. https://t.co/PBQA0uX15Y @MrMrsGamers Unfortunately it is only 18+, so no children (including babies) are allowed. @RoadToX0 Pics or it didn't happen. @XboxPope Calling the event space \"yes we need a red carpet, but make it green. No, it has to be a red carpet... but green. mmhmm, yes, green.\" @XboxPope See you there! https://t.co/IkwoAMDmvf @Dydus18 Yes - See you there! https://t.co/FAsQb2t31u @oldarobot Yes. https://t.co/MdtThf5Ybu @Dydus18 Give this a shot: https://t.co/QHWbhipmUp Get your #X019 tickets NOW and join us as we bring the best of Xbox to London 🇬🇧🎮🎟\n\nAll proceeds support UK charity @SpecialEffect 👉: https://t.co/67JVexne7q https://t.co/8nhG1trC61 The time has come for you to understand what power truly is.\n\nWatch the Operation Dark Divide trailer: https://t.co/t3QsHBEdNR https://t.co/tQCDIhuUV5 May you have the confidence to skip the tutorial and the wisdom to return to it ten minutes later. @WinObs Nice! Looks like you're ready to go. @Braddock512 Thanks! We're so excited to work with such a great charity. @david_shields_ Looks like an amazing event! If you missed #InsideXbox, get caught up with:\n\n🎮 @XboxGamePass additions\n☁️ Project xCloud preview\n🚀 The Outer Worlds\n\nCheck out the full episode: https://t.co/nNDn0SzXHO https://t.co/3YXgpXIfZz @yeet13423914 We're glad the first one served you so well. @DargeKnight Ticket purchase information is available on our website here: https://t.co/K4EJn0zXA4 @MarkDickson1213 What made Mass Effect 2 standout so much for you? @jennylayfluffy @MicrosoftUK How cool! Thanks for sharing your pics. @Synistyr_X It'll be good to watch someone other than ourselves die for a change. @ravens5fan2 New games are not being added to the Backwards Compatibility library, so we're afraid not. @PALFoxPlays Especially if adorable foxes are involved. https://t.co/ZdGC08SP7l @SatisJaxon We're glad to hear you're having such a great time with it! @MaDzGaming_HC Appreciate how you have clips and catchphrases ready to go. That was some serious wall riding. @Neon__Synthesis It's a lot of space, for sure! It'd take an epic amount of effort to fill it. @LE0_PWNS_U That works so well! Meet Crypto. He'll be joining you for Season 3.\n\nGet acquainted: https://t.co/pLQDGq8Jjv https://t.co/mv0Lbe6m84 @AjFelton That's the perfect way to get prepped to head back to the galaxy far, far away. https://t.co/zLU2vxX2cm @MaDzGaming_HC That was an insane dunk! https://t.co/usdVMzwkTQ @Tearfury76 Thanks for the shout out! It's an amazing cause that we're glad to be a part of. @djman22681 That's the goal! @BrunsteinBears It's an amazing charity and we're so happy to be a part of such a worthy goal. @P15T0L_P3T3 We'll keep our fingers crossed for you! @redarmy6899 We're very ready for both of them. @Kathy_15xx The kind of sunset that just begs to be rode off into. @MaDzGaming_HC Did you score any goals? https://t.co/mQoIafy1IS RT @Minecraft: Missed the MINECON Live livestream? Worry not! Here’s ten magic moments from the show, packed with exciting reveals and Mine… @Trippy_HippieTV This is just the kind of vibes we need for a Monday. @kateyeager So many people have been super hyped to see a new Flight Sim! We can't wait for it to be in the hands of the fans. @CrazyBolt That's always the struggle! But having too many good games to play is just the best kind of problem. @Chris25551 @Kathy_15xx A perfect capture of that sunset! @papachubbz We had to pour our Monday sized cup. https://t.co/p6hwmT1K9R @sp4rr0wsw3nch Absolutely. Sometimes it's nice to have a campaign that you can do at your own pace. @redarmy6899 On that Fortnite grind! Getting ready for season 11? @ScorchedLashes Getting the week off to the best possible start! https://t.co/0ktTgimQMK @AlstonCaery There's a lot to choose from there! @Mizudori_DE That game WAS pretty epic in the story department. @wolfychan95 Arkham Origins is already backwards compatible! The others had Xbox One editions, which usually means the Xbox 360 version will not be supported. @ElGrindz Gotta get that loot! But did you make it out of the storm in time? @DalianHaynes They made something really special there, for sure. https://t.co/olAj7ig53Y @Prod1gyXx Two of our favorites in one stream! We hope everyone had an awesome time. @The_Michelle620 That is the proper reaction. @PinkRoseVA There were some awesome moments in there. You're making us want to play it again! @_ForrestGaming Back at you friend. https://t.co/YeI5w8bcjI Sometimes you have to break the rules to break new ground.\n\nFIFA 20 is available now: https://t.co/MUUKPy0XN9 https://t.co/YjTCyOFmnq @AlmightyFeniks T U F F When everyone plays, we all win. That’s why all #X019 ticket proceeds go to @SpecialEffect, a UK-based charity that helps people with physical disabilities get in the game.\n\nTickets go on sale tomorrow, October 1: https://t.co/eyEek9L1Zb https://t.co/pOrfTLy4zK @staryvoy Still remember the first time we fought the flood. https://t.co/gKN3rf5RFY @PALFoxPlays Love the design you made. Very fox like. https://t.co/gRi3H24Zdj RT @StudioMDHR: Cuphead turns two today, and we're so humbled to announce: it has officially gone five-times platinum!!\n\nStarting now, the… Sometimes all it takes is a little coffee – and some extra shots 👉👉👉 #NationalCoffeeDay @StudioMDHR https://t.co/Tmo3IsejY7 Save big on all the family-favorites.\n\nShop now: https://t.co/AGVbQmFCqU https://t.co/WDR5RgNfhv @He_Bot8 A sad day for our community, our hearts are with Murk's family and friends.  💚 RT @dungeonsgame: What happens when a lonely, outcast Illager stumbles upon a mysterious object with terrifying powers? Find out in the all… RT @minecraftearth: Time to get your phones charged and ready! Minecraft Earth is almost here, with early access rolling out to select coun… RT @Minecraft: MINECON Live, our celebration of all things Minecraft, is just 30 minutes away! While we wait for the pre-show to begin, let… Saving the world is in your blood. \n\nPlay Code Vein today: https://t.co/tnngevDRPL https://t.co/2NdVUhTP8Z @R_CaTT Some of our favorites too. They both have great stories and are action packed. https://t.co/atfyIQL0Ni @DuganSzeliga Sometimes it's about the memories you make while playing with others that makes it so special. @Erisz_ It is a classic. https://t.co/I4oNkEXCCP @MixerJamieLIVE Thank you friend! https://t.co/VG5gGJXV5f @Justin15Ellis Still recovering from all the feels on our first playthrough. https://t.co/EJx5Rx78jJ @ogplaysfortnite Right here! https://t.co/SZsoQhRRc6 @DaeshawnBallard Having magic certainly helps with that haha. @Gaming_4_Dayz Then we won't make you choose! https://t.co/MEFqSPjxr2 @tiredwltch There are so many awesome characters and different ways your decisions can influence the story. https://t.co/slJfgTk6Jn @MrMaclaster Wait? How did we not make that connection? https://t.co/yqBs1thvBc @DaeshawnBallard We were too charmed by his sass. @IIIWeldXV Yes, Shadowkeep will be standard price, but the only expansion not included in the free package (Forsaken) will be reduced in price. @DaeshawnBallard We had Solas as one of the main members of our team. What a twist for his character at the end! https://t.co/NVOkfEnci6 @OfficialMarkLaw Nothing like a good flamethrower to help you conquer your fears. https://t.co/PwjTVMOf9E @Slietaert1 Our highlight was when Morrigan considered us a friend. https://t.co/sl5m6m9cV5 @DaeshawnBallard Heavy Rain is intense!  We've put a lot of hours into Dragon Age: Inquisition. @fivethegamer The two classics. Solitaire and Minesweeper. @Dylan___mcbride Been creating a lot mayhem lately as Moze. https://t.co/agA1ozoNQL @assassinscreed Either way we'll finish the fight! @JertaveusLove27 We'll always remember their sacrifice. https://t.co/ZkoZ5RS3La @MixerJamieLIVE Please give your doggo a treat for us. https://t.co/fyjwTgEzCa @joopfoop Solid choice. https://t.co/NYpRnka0hA @RyanCaw20983165 Sums us up too. https://t.co/pNnWugKULw @RealGameMedia We'll never forget. https://t.co/qcXMZetzow @assassinscreed Can we take a leap and guess? https://t.co/piZd3qoFkf RT @minecraftearth: #MINECON Live is not just a live celebration of Minecraft – it’s a live celebration of ALL THINGS Minecraft, including… @FlamingMonkee This is definitely an impossible decision. @shinycolazt Didn't mean that kind of draw. https://t.co/4Sy71QaV6h @XX330_XX Some games just didn't end up having digital version. Afraid this is one of them! @2FlyGamin That's a grandmaster move, for sure. @chainsawsquirel We're still hiding in Alien Isolation. https://t.co/j0LkNMXSEV @lauraAMB_ It also gave us one of the best quotes ever: \"City at the bottom of the ocean? Ridiculous.\" @Skunkie It's easier if you just choose all of them. https://t.co/o59JFFsORi @shinobi602 Knew we could count on you to bring some Mass Effect love to the table, err thread. @seasonalupswing How about we call it a draw? https://t.co/0ZHdXWxiKo @Brad_Sanction_I We get it. That final speech Shepard gave during the suicide mission still crosses our mind from time to time. @IIIWeldXV All of that content will be free for everyone when Shadowkeep launches! @yourk0nis You spent some time down in the trenches! Thanks for sharing the clip. @mcavanah You can say Last of Us. Just don't make us fight any Clickers. @photo_gt97 @Kathy_15xx We absolutely agree! @XX330_XX We're not seeing the option to buy it digitally, but if you can find a physical copy it should work on your Xbox One. @2FlyGamin Well, it turned out flawlessly. Thanks for sharing the clip! @Staggerilla That is some seriously retro gameplay! Which game has the best single player campaign? @DyspraxicRob An \"emotional rollercoaster\" assumes that there are ups to go with the downs.  That's not the kind of game What Remains of Edith Finch is. @rectanglechips Very same! We're so hyped for it. @blletsolspeaks It's time to get. that. loot. https://t.co/tWy0Sl3F8w @XX330_XX It already is! https://t.co/PF4bqY4X2d @ObiBertKenobi Borderlands streams all day! Have fun. @2FlyGamin Passing on 4th and 10 in your own end zone? Fortune favors the bold. @2FlyGamin Wide open spaces for that run. Their defense didn't know what hit it.  \n\nAlso: How many consoles do you actually own?? https://t.co/6aLP3hDIga @CleverestGirl22 The sticker sort of matches your hair! Way to represent. @DyspraxicRob The art and music for it really drew us in. Plus that ending made us tear up, but not as much as What Remains of Edith Finch. @DyspraxicRob Then we should congratulate you both on the 50k Gamerscore haha. That's a really cute game. @ReAnimateHer_ Time to do a \"Camping 101\" class for all the new players coming next month. @GJCP911 We're currently testing on Android environments, We'll have more info about other platforms at a later date. @JellyJellyHam @AfterpartyGame @PlayApex @ForzaMotorsport @dungeonsgame @RareLtd @BleedingEdgeNT @GearsofWar @OuterWorlds @Respawn @OriTheGame So many awesome pins! https://t.co/zKzZseCt0r @DyspraxicRob Congrats! What game got you to 50k? https://t.co/qaEhxWVdoK @rectanglechips An Ori superfan! Are you hyped for the new game as well? @CommandZer01 \"I love this plan. What could go wrong?\" @PHO3N1X79 It's a really scenic game with amazing storytelling. Excited for you to see Gears 5 and how beautiful it is too. https://t.co/Ga55gqpW2O @Chris25551 @Visual_Moods @Captured_Collec @GamerGram_GG @_GameScreenshot @photomodeaddict @TCCFeatured @SocietyOfVP So creepy! @ReAnimateHer_ We're glad that all the new players will have such a forgiving and patient teacher. https://t.co/4Q3ZLb342G @Karma_killa21 Good luck! Are you getting prepped for Shadowkeep next week? @JohnyTwoTimes13 Us heading to pick up our pre-orders every Tuesday: https://t.co/pcgq0DOjEs @Crazygamer360 Yeah it is! We love a good Star Wars bundle. @BlondiebutGeeky Time to rock the weekend! What games are you working on? @OriTheGame Welcome new friends. We'll be here if you need a shoulder to cry on. https://t.co/eZj3QrhsIy Feel the Force with Xbox One. Pre-order the Star Wars Jedi: Fallen Order™ Xbox One X and S Bundles today: https://t.co/B8CKe8S9ht https://t.co/bnGeiItRrr @starwars They can try... https://t.co/dL4HIf9nZS Time to make (or break) history. Civilization VI and its Expansion Bundle arrive on November 22. @CivGame\n\nPre-order now: https://t.co/jNkrfrBtHr https://t.co/d58KRn3Yph RT @PlayDauntless: Dauntless 1.0 is live. Aether Unbound is here. Get in there, Slayers! https://t.co/yGxCQWJrIY RT @RockstarGames: WANTED: The Wolf Man\n\nResponsible for a string of brutal murders, this feral vagrant is believed to have retreated into… @imtrashbroo Yes indeed! You can check out what games are available now on Game Pass here: https://t.co/0nZQ7jsjRr @OriginCookieMan Going to start writing these down on sticky notes for when we need inspiration haha. https://t.co/tZlcEJg2p5 Ready. Set. SAVE 🏁\n\nShop now: https://t.co/iLnqugvrvq https://t.co/7OsOchPBxK @AggroAFK Over and out! https://t.co/bQ0gnDAZcp @LukeWebster91 Perhaps this will change your mind. https://t.co/MfnlLtacbT @FergietheTaurus Has an amazing story and is a beautiful game. Really excited for you to start it! https://t.co/RBNV7gARHB @KatieRyRy_ That's amazing! https://t.co/16qR1ZoXiD @BestXboxOneGam1 This is us when it comes to Gears 5. https://t.co/pcT7zaUc7p @Fetered \"I know! Let's make him even harder to hit!\" New game launches, new Games with Gold, new games with Xbox Game Pass... are we seeing a theme here?\n\nCheck out the full episode: https://t.co/ErQhTuGpF5 https://t.co/8loCoykoqu @LukeWebster91 But we need to know! https://t.co/BdScQ7EiQT RT @RockstarGames: The new SURVIVAL SERIES in GTA Online\n\nFend off a Ballas attack on Grove Street, battle heavily armed Juggernauts in the… @shalegac Is that what your backlog says to you? @LukeWebster91 Please teach us your time management skills. https://t.co/sja8IQpUXO @BestXboxOneGam1 Our backlog whenever we download a new game. https://t.co/bfDZeIYDbx @OriginCookieMan That was beautiful. https://t.co/cIrrHhQj5m No Ghost left behind. Play the Ghost Recon Breakpoint Open Beta now through September 29.\n\n👻: https://t.co/gwsRDjGCl2 https://t.co/vLC6syNuXV @Dul_Incaru The purple goop is how you maintain the pebbly, leather-tough hide that all your friends will envy. RT @XboxGamePass: The team here at Xbox Game Pass is proud to present... more games\n\n(and you can download them remotely with our mobile ap… @Dul_Incaru It does require that you really, REALLY like statues of the emperor, however. @nolanpgill Is there any other way to play? https://t.co/4vwjHGT8Tz @RealBooky06 A recipe that Gordon Ramsay might even approve of. https://t.co/HLOlrTcBRE @ObiBertKenobi Ohh, you got some of the spicy guns. @Gerbil1978 That'll last you into the new year, easy. @Dul_Incaru He seems secure in his philosophy. @Gerbil1978 3 out of 4 is a pretty good month! @xNSHADOWSx You're fun to talk to! Feel free to share any captures of your scorcher or epic battles with us. @Fetered It's a busy day on Pandora. That was a seriously hectic fight with that shrinking tink! @xNSHADOWSx Yay! You made our day. https://t.co/9wmJl5fu3n The dark side seeks to eradicate the light. Only you can hold it at bay in #StarWarsJediFallenOrder.\n\nPre-order now: https://t.co/np72U1VFMD https://t.co/iv0AsG0v9i @Siklootd Thanks! Have fun and good luck playing it again! @Joshuasalazar42 Already looking forward to the next game? We know the feeling. @Lorul21 The New Light program will be kicking off on the 1st, so the base game of Destiny 2 will be free to everyone! @xNSHADOWSx Always feels good when you can get some gaming time in. Especially, since it means you can give your scorcher some pets for us. @Amsuden333 Excellent choice! https://t.co/KN8WssIbw8 @tassiedad You'll get to them once you've expanded your farms, mined some more diamonds, and build a few extra rooms in your house. https://t.co/ayzT1hU2fX @FritoCrash That's a recipe for a pretty good morning. @TheCoolDave Please let us know when you've figured out how to do this. https://t.co/tNRkvfWBE9 @Gerbil1978 So many games to keep us busy this Fall! @Dul_Incaru \"Nothing matters, might as well party\" is just about the definition of CN, this is true. @DArmstrong1992 It's a good feeling to have plenty of epic games to play. @lifeoftrev26 We're always happy to add to game collections. Have fun. @jasonkerr214 We've all had that problem. Some of us just have a bigger backlog than others... @RoboAtari Just a friendly reminder. https://t.co/8xiyri51lJ @Gerbil1978 Thanks so much! Which one are you most looking forward to? RT @Razer: Don’t just hear it, feel it. Experience a new level of game immersion from your living room with the Razer Nari Ultimate for Xbo… @SSOUITSpodcast Sometimes it's best just to enjoy the ride. https://t.co/uByYq9ImgT @RorekKnight Well played. https://t.co/ofTnZgjIce @xNSHADOWSx They are really helpful when there's a lot of close quarter enemies! @titanmarsltd You got this! https://t.co/98ZgtwcMat @CarlosM29130678 It's truly never ending. But the joy is in the journey, not the destination. @xNSHADOWSx Best part about Fl4k is you can pet his...dog? https://t.co/fzky4xPUAX @NickoToGo Sadly the process doesn't catch everything, so it's always important to report things like this if you see them: https://t.co/Ku4SQ7K6jd \nAnd there are more instructions and info here regarding reporting a player: https://t.co/tyDkDtSQxz RT @EAStarWars: One hour until the @StarWars Triple #ForceFriday Global Reveal stream goes live!\n\n@CameronMonaghan will be showing off what… @ObiBertKenobi Good times! Pick up any good loot during the stream? @James9861 We're not sure of those guys will ever be finished with fighting. @Lazygamer122 That's kind of you to say. https://t.co/n0lFYCO5xR @MaxB117 We love our community! Thank you for being part of it. https://t.co/V3gJjK7Iee @titanmarsltd Not a terrible situation to be in though. https://t.co/07WXnJPxHf @TheRealSyde_ Thanks for still loving us. https://t.co/JkKhl6oLem @TwitterGaming Just a little bit of https://t.co/jvRyRGRzHu @bester_advice It's never too late! @INSeternal You've got a busy schedule this week! @x_x_Raven_x_x Glad you're so hyped for the new games! @titanmarsltd Meanwhile, your backlog. https://t.co/kX5pS2VT48 RT @XboxGamePass: The latest installment of ID@Xbox Game Pass is full of interviews, announcements, and of course… more games\n\ncheck it out… Any month with action-packed puppies and badass elephants is a good month.\n\n🎮: https://t.co/01LCMbhJjp https://t.co/E144CoM0uU Welcome to Damned City. Killer cyborg panda population: 1\n\nContra: Rogue Corps is available now: https://t.co/jN4kIXkp61 https://t.co/pSHqwGU2MG @ExoRaider27 Indeed, we can Thanos snap our own backlog if we try hard enough. That's a deep metaphor friend. @xNSHADOWSx In case you need help choosing a character, Moze's mech suit is awesome! Done a lot of damage with her. https://t.co/hXboZ6MVKt @ExoRaider27 You mean our backlog might get Thanos snapped? @xNSHADOWSx Have fun taking on the Children of the Vault. https://t.co/CVCSaxw7t7 @ExoRaider27 Perhaps we need our friends to assemble and help us decide. https://t.co/FbEMPJJ2Gq @flashpointzero That's a reasonable approach. https://t.co/J3RKAUcPjp @xNSHADOWSx Are you talking to us or your backlog? https://t.co/83X2mqVJMg @ExoRaider27 Us trying to figure out which game to play next. https://t.co/VGb54kw0aS @DayZ Whoops, wrong date. https://t.co/Tk2O1HhSEf @MetroidFREAK21 We'll pass our condolences onto your backlog. https://t.co/N8GiZdC9jf @xNSHADOWSx We're sure they understand. https://t.co/y9pmrX6K1h @ExoRaider27 Well, since you insisted. https://t.co/b8w7T4Osle @MetroidFREAK21 To be fair they did just drop Crypto. https://t.co/4QKgnQqbUA @framelagdotcom It's amazing how much gaming has evolved since then. We're looking forward to seeing where Master Chief's next adventure takes us. https://t.co/wCk2wXglm6 “Yesterday you said tomorrow.” - Your backlog @JAlmighty0 And your teammates don't use it. https://t.co/AJ56sgKElG @ThomasA07402178 Something to be proud of for sure. Dark Souls takes a lot of strategy. https://t.co/oiHUe7exJe @EricWallace117 Always have. https://t.co/uwG6hd6h1u @LincloGames An accurate way to describe anything Master Chief does. https://t.co/S7ck1zTE5m @thereelbrent The different psychic abilities made combat really fun. https://t.co/9vQmnafCn9 @hysteppes10 Solid enough reason to be proud. Master Chief also makes us feel like we can finish any fight. https://t.co/lZGcYHBWXF @0fficial_JINX Sounds like you're more than ready for the Moon. https://t.co/CuDDuun3Px Summer’s biggest transfers are ready to make their mark in FIFA 20.\n\nCheck out the FUT 20 Ones to Watch: https://t.co/A2JFWKQttp https://t.co/qLDXym393c The Activision Blizzard Publisher Sale is nitro-fueled and ready to go.\n\nSave up to 60% on select titles: https://t.co/oWYdpNiYAO https://t.co/PKuB2Qa5C7 @Remilution @LeonidasJulianX Congrats indeed! Good luck to everyone. @heading_out_rn That flashbang was a thing of beauty. @HeyItsMe_Scott Glad you enjoyed it so much! We definitely appreciate a dark sense of humor. @vccarvalho Loved the open world aspect of the campaign and how beautiful the maps were! https://t.co/IkqXJ9w1P1 @Phsycotater360 Each one of them had its own challenges. Well done! @supportCHAS More gamers is always a good thing! We're so glad it's helping kids have fun. @primspy93 The Elite 2 Controller will be out November 4th. You can pre-order it now: https://t.co/BBOaeTAtv8 @Boa_Deemoney Your avatar is looking good! Thanks for sharing the clip. @Ch1r0n3x_2_1 No mercy in those eyes. @TopStiGear Hopefully you got underway quickly! What games were you playing? @Chris25551 @Visual_Moods @Captured_Collec @GamerGram_GG @GamerGram_RT @_GameScreenshot @photomodeaddict @TCCFeatured @SocietyOfVP @Urban_Tentacles We love planets with rings like that. @MissaRed24 Has to be one of the coolest figureheads for a ship ever. https://t.co/007tpoCWza @MncMstr2000 Could you please get into contact with our support team? We'd like to learn more about what happened. https://t.co/bE6ZtcM6hX Earn rewards, win prizes and score more when you play FIFA 20 on Xbox One.\nPlus, get 6,000 bonus Microsoft Rewards Points.\n\n#ScoreMoreWithXbox ⚽: https://t.co/PDiOK6Jzim https://t.co/OtzJ246Yhi @ZachCooper182 Us running around on the moon: https://t.co/DppTbfwy2Y @KronosCypher Way to dance through the negativity. @AlexH2198 Thanks! You made an awesome choice there. @libbyk101 Time to get that stream on! Hopefully everything goes smoothly. @GeorgeK79623140 To be fair, we did spend the last whole season hanging out with Emperor Calus. @Cadaberio Just a few more days to go! @PRETTBOYDAVID There can be no doubt. https://t.co/OSf0XCWfoC @STRONK92437510 Anytime we had to be around Micah: https://t.co/g31BHtRty9 @wiserweevil \"Please stop the car, dude!\"  \nAmazing. https://t.co/tQD78n2Sc9 @hoshamziad Inside our hearts, bubble-shielding us from harm. https://t.co/4kP51AcjLr @GuiltyGamerz Good call! Thanks for the pre-order. @Christyna_64 Same! It looks better with each new trailer. @LorePleez We're glad to hear it! How did it happen? Did you pick up an Xbox to play KI and check out some of the other games? @DroogJanus It was a high water mark, for sure. @N3xusMaximus Currently we're focusing on our work with Android based partners. We'll have more info about other platforms at a later date. Become evil’s worst nightmare in Destiny 2: Shadowkeep.\n\nPre-order now: https://t.co/eddoCEXblk https://t.co/1Q1wgIMccf @Chris25551 @Visual_Moods @Captured_Collec @GamerGram_GG @Urban_Tentacles @GamerGram_RT @_GameScreenshot @photomodeaddict @SocietyOfVP @TCCFeatured It takes some work to find some warm pictures in such a grim game. @wreckitr0ger We'll have more information about Project xCloud on other platforms at a later date! @ajmerrington Currently we're working on Android devices, but we'll have more to share about other platforms at a later date. @cottyyoung1 Hard to tell... But that cape tho... https://t.co/GJ0Q3gvW8e @daryiljohnson25 It does! We can't wait to play it. RT @Halo: Twelve years ago, we learned to keep a promise and finished the fight. Happy Birthday, Halo 3! https://t.co/ucups5Lh0x @EAStarWars Us, 30 seconds ago: \"There's no way we could be more excited about this game.\"\n\nUs, now: https://t.co/aR8bQHfHEt @AMANOFGOD95 We didn't think we could be any more hyped.  We were wrong. @RocketManKian The man himself! @EliSiegel2 That's a definite \"better late than never\" situation. @MordenNZ It was a truly epic event! @SamaelSam1 We felt so accomplished after finishing the Cucco Roundup quest. https://t.co/lEZAL9bwXz @Lootz117 So wholesome. You're loved too! https://t.co/zJgjE8p63Q You don’t win a war without getting your hands dirty.\n\nPre-order Call of Duty: Modern Warfare: https://t.co/GZqpVVHsTC https://t.co/htcZlesZ9s @WulfwoodsSins From enemies to comrades. https://t.co/CyzIJgt6pl @Halo We thought we lost him, but not yet. https://t.co/lrwHAsBVBg \"He's searching for something...something very precious to the Empire.\" #StarWarsJediFallenOrder\n\nWatch live on Thursday Sept 26 at 11am Pacific:\n\n@WatchMixer: https://t.co/71EpzRdszA\n@StarWars YouTube: https://t.co/qtv6v6VP40 https://t.co/v4CZMMCE30 @Chris25551 Thank you! Makes us want to try taking a few captures there. @LadyAlexiel22 That's another game with some really awesome artwork! The narration has almost a D&amp;D vibe to it too. RT @XboxGamePassPC: We’re excited to officially announce the games that we just officially announced on Inside Xbox.\n\nCheck out the dates:… @SoxyGamer Sleep well and have a safe trip! @WoA_Mortis That jump over the other player at the 1:50 mark was awesome too! https://t.co/nauMThTeda Tickets for #X019 go on sale Tuesday, October 1.\nWhat can you expect? \nShort version: a great time. \nLong version: https://t.co/Zh3lwcQp3P #InsideXbox https://t.co/asLqRnUqxM @DavidEllis Hoping our bus ride is long enough for a Legendary campaign level. You in? @LadyAlexiel22 Yes! Have you played Crawl? https://t.co/OguvBZhL0T We go another round with @nightschoolers Director Sean Krankel on the hellacious Afterparty. #InsideXbox\n\nhttps://t.co/EalUwrVJFH https://t.co/4cg57IaXRu Don’t hibernate on the latest DayZ expansion coming November 13. It’s big. #InsideXbox \n\nSurvive Livonia: https://t.co/FUSt25s1qD https://t.co/iF3eVQZasb @WoA_Mortis Nice use of the high ground! https://t.co/WdijjrNC7x @LadyAlexiel22 The art style looks awesome! Also, excited to explore the dungeons. @TMobile *Tosses Lancer* Let's get started. It’s a deadly job, but someone’s got to do it. #InsideXbox \n\nFelix the Reaper is coming for you: https://t.co/QlQRqjOUnQ https://t.co/PlYO4whZmq @UnpureApostle We love dungeon games and how you can play as different family members. Wolves are meant to lead. @jonnybernthal fought tooth and claw to bring intense realism to the enemies in Ghost Recon Breakpoint. #InsideXbox\n\n🐺: https://t.co/JiGPpRKnO2 https://t.co/95RAl62F8d You can sneak, talk, or shoot your way through The Outer Worlds—but for this interview with Senior Narrative Designer Megan Starks we recommend you just watch and listen. #InsideXbox\n\n🌌: https://t.co/OJVzSXHPLC https://t.co/eLlESmAMAb Dropping new games on @XboxGamePass for Console and PC never gets old:\n💥Jump Force\n🏰Bloodstained: Ritual of the Night\n🧱LEGO Worlds\n\nFull details: https://t.co/B8a5kkEEvM #InsideXbox https://t.co/n6aVcrQ8RT A collapsed world. A legion of Lost out for your blood. Danger around every corner. The fun starts September 27. #InsideXbox\n\nGet ready for Code Vein: https://t.co/b1oJXYh78L https://t.co/ONi1tHh4aa The upcoming Project xCloud preview will start with Gears 5, Halo 5: Guardians, Killer Instinct, and Sea of Thieves—then expand with more games over time. #InsideXbox\n\nHelp shape the future of game streaming: https://t.co/YFwzNNy7uH https://t.co/iskV2xEH55 Why play as a single character when you can play as an entire heroic family? #InsideXbox \n\nChildren of Morta launches October 15: https://t.co/w5O0ZyPlMv https://t.co/GWTLW3MeEY Atlas Lead Game Designer Erik Waananen drops in to talk the pirate’s life on #InsideXbox\n\nhttps://t.co/EalUwrVJFH https://t.co/ZLXnsFjC5c @CDizzy13 That cannery scene? You know what's coming but so heartbreaking playing it! https://t.co/OcJAdPQuE6 @Meg_Kaylee We can't stop staring at his fresh hoodie. Here we go! #InsideXbox is live 🔴 https://t.co/SgpVzFD4xW Join us live now on #InsideXbox for:\n✅ X019 updates\n✅ Xbox Game Pass additions \n✅ Reveals, trailers, and MORE! https://t.co/tD92vXAoAP @Chris25551 @GamerGram_GG @GamerGram_RT @photomodeaddict @SocietyOfVP @Captured_Collec @TCCFeatured @Visual_Moods @_GameScreenshot These are beautiful! What town was the first capture taken? @_daveirwin You're so welcome! It's always nice to save some money when you can. @PrimalHD1 Time to go to work.  Good luck on your next round! @BigaDaBird We're ready to tune in and learn more! See you on the stream. @CrossedFingers0 We love your taste in house decor. https://t.co/7P5S2H0BZI @A3_Melle Waiting for the stream to start like https://t.co/bQvG7VJkJl @kevinallensc That's how you earn respect from The Chief. https://t.co/7hFdlHE0c0 @LindaCoxPhoto It's a very striking view, no matter where you're seeing it. @_xKatana Two excellent games! Great work. @CrossedFingers0 You're looking stylish! Also, is that a Gears of War poster on your wall? https://t.co/k3KRLbofUy @Lootz117 That's what we like to hear! Good luck to you. @XboxMik29 Not yet. But SOON. @Synistyr_X It's always a good time to PUBG. @_Sytex_ @Proximo1104 @PrimalHD1 @DannyCShow @papachubbz @RobbieLyell @Razorwireenergy @_RageOfAchilles @muzz_jack @emmmmsie @VigilantWings What new game will you be playing? @unibiolifeform That is some serious drive and dedication! Amazing work. @TheProGamerStev The force was truly with you. @RobbieOverlord Current focus is making sure games are supported on Project Scarlett next year. New games are not being added to the Backwards Compatibility catalog. @SoxyGamer Having a partner watching your back is absolutely the way to play. @Bilal73540115 They do an amazing job.  You just have to be a bit of a glutton for punishment. https://t.co/7aAiaSKYtE @Chappy4214 It does! We're hyped to play it. @Devendr60717479 Yep, it's dropping on Xbox Game Pass October 25th. @arronbaymaslin It did make us more motivated to take out the Swarm in multiplayer. Bring it on horde mode! https://t.co/albufmAzsE @XboxMik29 Have you played through the rest of the series the same way? @arronbaymaslin The campaign gave us so many feels. https://t.co/1qsdwHat25 @bendude86 That's really impressive! Nice work. https://t.co/Fq7p5vpZqy @chasedaron It starts at 3PM Pacific Time! @coltsfan1986 We put a lot of hours into the original Final Fantasy game too. There's so much strategy involved in the combat and understanding how to create the best class builds. https://t.co/YmYdo24DzH A little bit of hacking, a little bit of slashing, and a whole lot of awesome.\n\nThe Surge 2 is available now: https://t.co/xB2rFuDFge https://t.co/HcJeBCP55w @Markind_0 We'll be sure to let everyone know as soon as preorder details are announced. @WoA_Mortis We will see you on the moon, Guardian. @Lootz117 Don't let your dreams be dreams! https://t.co/DZY9EQ1ZT3 @xboxBG Those mini Master Chief figures are cute! Did you use a 3D printer? https://t.co/4RIv7g1p2O @mancave_tv Congrats! It takes a lot of hard work to get where you are now. https://t.co/Gh9IUFOUwU @XboxMik29 They don't call it Insane for no reason. https://t.co/3GR3xOyONw @BMichsel Nice! We've tried to beat them all on Insane difficulty and its...insane. https://t.co/h6mGxNhfUL Race, build, and explore with the Xbox One Forza Horizon 4 LEGO Speed Champions bundles.\n\nIncludes Xbox One S or X, Forza Horizon 4, and the LEGO Speed Champions add-on.\n\nBuy now: https://t.co/9jTAyVQM4C https://t.co/ax29mWqmJ8 @rmmax89 No problem! Hope you have fun watching. https://t.co/QZpqhQuba7 @atmgavin All the Gears of War games or the first one? @rmmax89 It will air 3-4pm PT. You can watch it on our Mixer channel: https://t.co/hzUZel5c0U RT @EAStarWars: See the next generation of @StarWars products on September 26 at 11AM PT during the Triple #ForceFriday Global Reveal!\n\nTun… We’re back today with an all-new Inside Xbox bringing you the absolute latest updates, reveals, news and more!\n\nWatch here: https://t.co/YWU3IEMHba https://t.co/VdlfYbmYwG @alexrubeng They absolutely do not. @Ibrahim75422528 These are great captures! https://t.co/C7bXdXbEcQ @Miichaela18 That's really impressive!  This was our main strategy: https://t.co/hd2KZRlYxX @Ryan_Bruuuh That's still an impressive amount of playtime! @Xavier1415 We're looking forward to tomorrow! https://t.co/vmnSVSxyHD @gamezstaa We're really excited! See you there. https://t.co/uEi2VWbU8H @Th3Extreme Plus a villain we love to hate. https://t.co/pR10ba8g0y @Incomity We'll see you there. 😃 @Technical_Pick We'll say yes. https://t.co/kWdeRP18K2 @redbox Us right now. https://t.co/dlh3OiTwQQ @h0bey1 It all happened so fast we had a hard time counting. Can we ask what weapon setup you had? @h0bey1 That was awesome! Was that a 10 player kill streak? https://t.co/aeQKrwAUou @CrazedOne1988 We're no dentist, but they look like some nice pearly whites to us. https://t.co/T9iz1LAkic RT @XboxP3: Everyone has work to do to meet the challenge of climate change.    Look forward to learning from this pilot so we can do our p… @ZomBree_03K64 Thanks for the love. Hope you both keep having fun! https://t.co/6G8NTjs9B0 @Spinalpoem We still have all the feels from it. Such an amazing story. https://t.co/DWPU9r0vxa @WreckitGamingAU Sometimes that added pressure shows up at just the wrong time. @alexrubeng Oh, that monk. \n\nWe know that monk. \n\nShe is not friendly. @MaDzGaming_HC With the right teammate, things just start getting easier. @ZomBree_03K64 We love hearing how games bring people together. You two must make an awesome team.\n\nP.S Your cake toppers and tattoos are awesome. @Jebus8279 Indeed. You can tell the characters all have relationships. For better and for worse. @CT167 He'll be a challenge to fight against, for sure. @HowCynful We can imagine there was some... frustrating moments... in that playthough. @Crazygamer360 Glad you're hyped for it! See you tomorrow. @ChicagoLegacy23 By the end we didn't think we'd beaten it, more like survived it. https://t.co/tIf6NI0yjv @i_schiggy We'll be eagerly waiting for it with you! https://t.co/Y7vyg5XBNM @Xdreamxv3gas What a great gift! Have fun playing it. @Ryan_Bruuuh That was a tough one! How long did it take you? @Markinsutton Sometimes a game just gets ahold of you and you don't have any other choice. @i_schiggy It brought us back to the classic COD games like Modern Warfare 3. Strategy and placement are crucial! @Jebus8279 That's awesome. Have you finished Gears 5 already? @alexrubeng We almost gave up a couple times on that game! It gets pretty seriously hard in a few places.  Good luck! @betta_rdr2 Plenty of wide open spaces.  Perfect for someone with the law on their back. @i_schiggy We're so excited and we loved the maps! Azhir Cave really stood out for us. @i_schiggy Thank you for sharing with us. Did you get a chance to play the Call of Duty: Modern Warfare Beta? @PlanetPakki Beating any Souls game is always an accomplishment. @IRGRL Spark waaarrrrsss https://t.co/BVeFnPW9TH @Cali_Mar_ That melee hit from the side was some quick thinking! https://t.co/6bBkPbRAhd @MaDzGaming_HC Rocket league to start out the week? Sounds like a plan to us! @JakobTiz Good luck if you enter! @TypewriterChaos We'd be seriously proud of either one of those! Great work. @Slurpy95264156 We're down for any opportunity to put on the cowl. https://t.co/i2JN0Tvn7U @Tristan_Brdbrry Nice work! Takes a lot of dedication and quick thinking. https://t.co/ksMI6khe4v @SouthPaw343 Us every time a game has a photo mode: https://t.co/s3tMPJHTOz @davemb80 We're proud of you for not giving up! The story gave us all the feels. https://t.co/rYb90TAYvU @_daveirwin Nice! We had a blast with that game. It never really felt grindy because there's such a big variety of enemies to fight. Have fun! @i_schiggy It takes a lot of skill to get all the achievements in both of those games! https://t.co/zWaS5bofWc @WreckitGamingAU Well done! Did you pull down the win for the HypeZone? @Alexhamer28 If the game is a Play Anywhere title you should be able to install it on your PC as well. Details here: https://t.co/WlmXndGcVd @keitheyoung We're so glad you're looking forward to it as much as we are! We can't wait to check it out. @BromilowBrendan We laugh every time we see that .gif. RT @FortniteGame: Explore the new Gotham City Rift Zone or complete a variety of challenges to earn free @DCBatman rewards! \n\nGrab the new… @professor_hobo That was a LOT of work, but the payoff was worth it. @moitoi 2 spooky 4 us. https://t.co/YhgmESBcvH @tenacityworks Always important questions. When everyone plays, we all win! We’re coming at you LIVE tomorrow with:\n\n🇬🇧 X019 updates\n🌌 The Outer Worlds\n👻 Ghost Recon Breakpoint\n🎮 And more!\n\nJoin us on Mixer: https://t.co/dyRlrnI4ft https://t.co/9IVlFP4Q7j What game are you most proud of beating? RT @Minecraft: MINECON Live, our Minecraftiest Minecraft show ever, is now only one week away! Tune in on Saturday, September 28th, for a l… Achievement unlocked: become an answer on @Jeopardy. https://t.co/U4maZS9kck Incoming transmission: the @CallofDuty: Modern Warfare Open Beta is available now for free.\n\n🎮: https://t.co/eSudgvs3Xr https://t.co/u3gBlAbWfo @Jeopardy We are SO NERVOUS right now. https://t.co/FFLZHLjeQd Can you guess who is going to appear on @Jeopardy tonight, September 20?\n\nWe’d like to wager it all, Alex. @St_Katzer Always! The grips are so crisp, the sticks are so tight. Critics are calling #Gears5:\n\n✅ “The definition of a great action game.” @WashingtonPost\n✅ “Packed with more of the best of Gears of War.” @Kotaku\n✅ “Captivating, credible, and incredibly well-polished.” @Polygon\n\nWhat do you think? Let us know below 👇\nhttps://t.co/UdQORU8vwf https://t.co/noVm1Fbclr @Georgekon4002 It's definitely a new experience when you have a few people backing you up! @KirkRebel That's a bit tougher to say. It might be an issue with the controller? You can check here for troubleshooting steps: https://t.co/KoU1EQWYhG @HELLRAISERGamin That's a really pretty capture! Have fun taking on the Swarm. https://t.co/4N13C4PcrV @richiebaseball Are you and your friends going to jump right into multiplayer or will you start with the campaign? @Christi31441651 We really love how vibrant the blue is. @CheeChip Nice work! Long range rockets need good timing. https://t.co/jp4kbfl69w @KirkRebel Just monthly. It will be set to auto bill by default. @KarmaGotNothin And keeping to strict building safety codes. @Georgekon4002 Did you solo your way though it, or did you have a team? @richiebaseball Excellent choice. https://t.co/Vdt4uqNQlu @Ramon_Gonzales3 *Save icon pops up* \n\nUs: https://t.co/K9PvavdQRx @SilentWarlock Just that smile would be enough to put us on high alert. https://t.co/FcYoPHaDjd @SamuelW77513284 We love the GT update! Wear the new gamertag with pride. @iamdryx And you already used your most powerful items and moves. https://t.co/tli9tD5CiJ @swp2241 Every fiber of our body can hear that .gif. @JudgeMandolore Best music period, TBH. @NotRealZelo The most stressful music! @ianeditz We are SO HYPED to see his new setup! Thanks for sharing the picture. @Iorelyn_ Us, each time that little icon pops up https://t.co/ch97U4AU4m @chiknvicnugget Oh how nice! We were running low on...wait a second. https://t.co/Ll2ZaRLYxb @neonescent_vp Us in any game with a photo mode: https://t.co/a6xLc7Jcw3 @KirkRebel Yep! You'll be covered for both subscriptions. @CASHMON3Y1297 We're sure all that hard work will pay off. https://t.co/EVA0CpUPp2 @KarmaGotNothin Perseverance in the face of adversity. @NintendoAmerica @OriTheGame is beautiful, and will get you right in the feels. Can't want to share it with you! https://t.co/KpFyrIwRun RT @ID_Xbox: A tale of light, darkness, and the nature of reality.\n\nThe Sojourn from @Iceberg_Int and @ShiftingTidesUK is available now on… Take your personalized controller one step further.\n\nCreate yours at Xbox Design Lab: https://t.co/WtSnf1SKVi https://t.co/yJQ7DfBGG2 @KirkRebel In essence. $14.99 a month translates into what you'd pay yearly if you had Xbox Game Pass at $9.99 a month and a $60 per year Gold subscription.  Plus you get some exclusive benefits and Xbox Game Pass for PC on top of that! @LadyAlexiel22 When you respawn and understand how to defeat the boss. https://t.co/IZEkfyowFD @KirkRebel No, Xbox Game Pass Ultimate replaces your existing Game Pass or Xbox Live Gold subscriptions. So you'd be paying that instead. @a_baltierrez When you look at your level and health: https://t.co/JaInX0GSdi RT @SOEDESCO: If you've missed the launch trailer for Truck Driver, we've got you covered 🚛! Truck Driver is now available on @Xbox. Get yo… @KarmaGotNothin Having to do fire control would just add insult to the explosion injury. @neonescent_vp Truly a masterpiece of a game. @Hunter4678S We are SO EXCITED. https://t.co/R4LQwXNnOu @HaloCreation We're hyped to see them! @TheDancingFr0gg Us trying to find the last enemy because the music hasn't settled: https://t.co/mrR8SMs5Uf @KirkRebel After your initial subscription expires (depending on which option you go with) it will revert back to a monthly payment of $14.99. @DGLT005 Stormed that point like a boss! Thanks for sharing the clip. @Georgekon4002 Oh nice! We really enjoyed that one. @upyourarsenaltv Some of the old, some of the new. Which one are you playing first? @stuntaacon Certainly gets our hearts racing! https://t.co/JmMA1VYLQI @dmerzib_m Happy to help! @TheShaunCooper Our reaction is more like: https://t.co/k7baRHAFqS @dmerzib_m Xbox Game Pass is a separate service and Xbox Live Gold is required for all online multiplayer. @daniel_switzer WE GOT THIS. THERE'S NO PROBLEM AT ALL. https://t.co/ApuBH6dNoR @M1necraftmast3r When you maxed out your character's level and have the best weapons. https://t.co/sVNS63pr6u @Pelux94 The real ones will remember. https://t.co/6lJrPgt0zx @derek_smed We're always glad to hear from Gears fans! Glad you enjoyed it so much. @Chris25551 @TheFramedShare @Visual_Moods @Captured_Collec @GamerGram_GG @GamerGram_RT @_GameScreenshot @photomodeaddict @TCCFeatured @SocietyOfVP We love how they all have different color palates. SO cool! @CASHMON3Y1297 Put in the work, get yourself 💰paid.💰 @richiebaseball Congrats on your new Xbox! Which bundle did you pick up? @Halo One fight we're ready for. https://t.co/AY5VeNYxaB @EarpXxx A full meal indeed! Good work. @Deklen2jacobs What? Everything will be just fine. https://t.co/sFRtoX3cCp @YtcBrian Nice. Are you enjoying it so far? https://t.co/acln7GRtTj @Remixxify Look at all this room I have to run arou .... wait a second. @slyprid Congrats! Taking out the Swarm is an extra fun way to get over 100k too. https://t.co/GJeG49yuAp @MaximumEffort05 This is the most stressful thing. https://t.co/Xys2qvDlD0 @LAW3TV We're glad you enjoyed it! Making a good start is always a great feeling. @Mahlangu_art You did an amazing job with the lighting effects and coloring. The details on Kait's weapons and armor are also impressive. Did you use Procreate for this? Nothing puts you on alert more than boss battle music. @fireprofcargo That's a perfect area to take captures! We love driving around during winter too. @Diddle1980 Spencer is rocking that bandanna. Where are you both headed? https://t.co/uggttt7QXZ RT @RockstarGames: Accelerate your progress toward becoming a Distinguished Bounty Hunter, Trader or Collector with these useful tips:\nhttp… @fireprofcargo @ForzaMotorsport @WeArePlayground @Porsche Love the flowers! Was that by Lakehurst Forest? @Ryan36659128 Sounds like a fun swamp. https://t.co/8OuEj8ZNCT Bring the fight with you wherever you are with the Seagate #Gears5 Special Edition 2TB Game Drive.\n\nBuy now: https://t.co/OagTMGRDO2 https://t.co/3afzJFpXjr @Drunkenbear_87 They are resting up to get ready for a day filled with treasure hunting. https://t.co/JxGGybYp7t @gamezstaa Anyone have a cloning machine we can borrow? It's getting hard to keep up! RT @EASPORTSFIFA: Get 10 hours with #FIFA20 NOW on @PlayStation and @Xbox with your @EAAccess subscription or get unlimited play on PC with… Incoming intel: Call of Duty: Modern Warfare Open Beta Early Access is now available.\n\nPre-order and get early access: https://t.co/90Al1Ti5Sy https://t.co/TyxnBANh8x @Johnathanz_10 Nice work! Good use of strategy and situational awareness. https://t.co/aKatNdtHvV @shagood07 Extra points for style. https://t.co/nEFz2hPrf3 @Emo185 Blair Witch has such an interesting story! We loved how the game play makes you dependent on Bullet. It helps create a deeper emotional bond with him. https://t.co/8JFg6hZode In the drug war, sometimes good men need to do bad things. Experience the hit Netflix show like never before in Narcos: Rise of the Cartels.\n\nWatch the trailer: https://t.co/kiRAkw45Au https://t.co/SuEIyj6tCd @GirlsMakeGames Can't wait to see what games you all make! @GirlsMakeGames Can't wait to see what games you all make! @Secret_Pandaz You know we do! RT @PlayApex: Prepare yourselves for Apex Legends Season 3: Meltdown! Dropping October 1, Meltdown brings a new contender to the arena, Cry… @GrampGamer You found yourself a good thinking spot. https://t.co/r2qhqgTRZ8 @Secret_Pandaz Congrats on 10 years! https://t.co/HbmFcXFmLl @Hermyoneee You're so brave. Stay strong! https://t.co/MorEolfQBp @AlphafoxV @GamerGram_GG @Captured_Collec @TheFramedShare @VGPUnite These really encompass her character's strength. Love the different angles too. @Chris25551 Yes! Keep I'm coming. @_ForrestGaming Looks like strategy and placement are really important. \n\nP.S Nice flank over the wall. A lot can happen in 7 days… like A LOT.\n\nTune in to This Week on Xbox: https://t.co/TUxTp4vuVl https://t.co/Qihu0njewk @AhmedA4129 Perfectly balanced, as all things should be. @_ForrestGaming Your stream got us hyped to play later! Brought us back to the old classic COD days. @AhmedA4129 Us: Want to team up for this miss-\nEveryone: https://t.co/BeLdjEZuGH @Hermyoneee Our condolences on your future illness. https://t.co/oSDSyjqGLa @AhmedA4129 We can't decide if this would be a perk or not. @MothmanOf A lot of hard work went into that! Thanks for sharing the pics. @AhmedA4129 Some people come up with really...creative designs. https://t.co/3so0dCXmfu @ShonRockerz It's always nice to have your co-op partner right there when you need them. https://t.co/jmhbj75hlW @NifflerOfD00m Did you get it finished up this week? @onyx62is We've all been there. Just take care of you and we'll hope to see you back online soon! https://t.co/ERDgFNacdG @Pit_Viper121 Thanks for the recommendation! We'll be sure to check it out. @GoogleStadia Sees another player running around.\nMe: https://t.co/LH0C2ZM41e RT @XboxGamePass: using standard gif technology we are excited to inform you that there are good games out right now for console and pc\n\ndo… @PowA_PxL So much cool new stuff to check out! @redbullgaming Nothing better than a DVa ult saving the match. https://t.co/Fb89HnbaqL RT @wwzthegame: New Missions, Horde Mode Z, Prestige Ranks and more are coming to World War Z in Season 2 of free content updates! \n\nGet Wo… @WiIsonRage We can feel the rage! https://t.co/kOkAN8j1Y3 @Mlp_Ry Try setting a password! That should require any other instances of your account to enter it before access. @What_Da_Hale We've got teams looking into it right now! Check here for updates: https://t.co/6l7U1ut6gP @Robeyonekenobi We always appreciate lighting effects and tidy cable management. https://t.co/g79s3X9Cy2 @SCP035rblx We're hyped to play it! @seymourjm The team is looking into it right now! Watch here for updates: https://t.co/K4Ob2rDlN2 @NoneToon These are so cute! We really like how you added the explosion damage type and movement details too. https://t.co/cxL5ixNVGl Why more Free Play Days? Just cause.\n\nLearn more: https://t.co/mZiHMeri0N https://t.co/iKRFtgBvMY RT @RockstarGames: 80’s nostalgia is one hell of a fuel, and the Zion Classic from Übermacht runs on nothing else.\n\nPick up the Übermacht Z… @ktorbeck Hello Ken,\n\nWe'd like to learn more about what happened. Could you please get in contact with our support team? https://t.co/7uTuTUckcO RT @DCAORtactics: Take a look behind-the-scenes in our latest trailer for #DarkCrystalTactics, where you can see Deet, Aughra, and the Cham… @BAlive84 We're sure it'll be a blast wherever people decide to play. The game looks amazing! @TheSkinnyStream Oh good! @CASHMON3Y1297 That's how to do it! Build up those fundamentals and keep grinding. @jain_aady Sometimes it's easy to lose track of solo games when all your friends are wanting to group up in co-op titles. Glad you're getting back to it! @StormluxRNBW6 The Wolves aren't there so you should be safe to just browse haha. @fireprofcargo @ForzaMotorsport @WeArePlayground The toned down grey and white really make the red on the tires pop. Great capture! https://t.co/pChSO3INuR @StormluxRNBW6 If you're interested in the Sentinel Corp Pack we say go for it. @StormluxRNBW6 We really like the stealth elements in it and the take downs. @_LarZen_ Us in a competitive match with a friend.\nFriend the second the phone rings: https://t.co/8FUYAXuXR4 RT @ID_Xbox: Trailmakers from @flashbulbgames exits Game Preview today on Xbox One: https://t.co/q8L0fg9mw8 https://t.co/IgvjVmxoq3 @Deku_TheKnight1 Of course! That'll definitely put it through its paces. @Deku_TheKnight1 Sounds like an awesome combo!  What game are you going to test your new controller with? @Weverton_RY What we all aspire to be! https://t.co/4axvCnhvbu @albertoflora68 That's an awesome collection! https://t.co/jqd4K9nCvQ @TheSkinnyStream *Current Xbox One controllers, we should say. Afraid your favorite Xbox 360 controller won't be back. @Chris25551 You always do! https://t.co/19V7wpywR9 @Chris25551 No problem. This will be us waiting to see what you capture next. https://t.co/QdGYnyzwlh @Chris25551 Thank you for sharing! The area after the bridge called Shipwreck Beach will have some really amazing spots to take captures. There’s nothing stealth about Lil Wayne. Watch him light up Ghost Recon Breakpoint and check out the Open Beta starting September 26.\n\nWatch the trailer: https://t.co/lnoqCVOwbn https://t.co/URhRvSOeat @Chris25551 @TCCFeatured @GamerGram_RT @photomodeaddict @Visual_Moods @_GameScreenshot @TheFramedShare @SocietyOfVP @GamerGram_GG This fight on the bridge was so intense! You captured that moment really well. We especially love the one with the Runes. @MaDzGaming_HC We'll look forward to seeing it. @Watterx_ Something to look forward to, for sure! @TheSkinnyStream Good news! All current controllers will work on Project Scarlett. So if you enjoy what you're working with now, it'll work on the new console as well. @XFlzh Awesome work. Are you going to run it again at a higher difficulty? Or jump into some multiplayer? https://t.co/f6OgygGcNM @BlackBeardRyan How cool is that skin?? Great work on getting it. @JerrySoCal Looks like you found the guy hiding till the end of the game. https://t.co/JM9rlVkdE5 @itmekhalo Guess there's only one way to find out. https://t.co/dHHgVRJRVJ @MrMrsGamers Sounds good! Have an awesome time. @MaDzGaming_HC Of course! Keep those great clips coming. https://t.co/4ATGld9P4f @Derrick34014131 Have you thought about starting your own stream? @IRGRL Thanks for putting on such a cool event. Glad it went so well! @TheAvgCrusader It's like there's a Noble squad shaped hole in our hearts. @Hulusync It's a pleasure and an honor to be part of such a worthy cause. Everyone should be able to play the games they love. @Watterx_ We love the clean color schemes. Do you have one already? RT @Roblox: Wreck your car. 🚗 \nAnd your friend’s car. 🏎️ \nAnd the entire island. 💥\nUnleash mayhem in Car Crushers 2, now available on @Xbox… @BoschGaming It'll be out in early November! 11/4. @TheSkinnyStream It's important to have a controller that you're comfortable with. Thanks for sticking with us! @LeomitePlays Which one are you the most hyped for? @RAsaWFTV Yes, but which button is \"turbo boost?\" @CASHMON3Y1297 Not a bad start at all! Good luck on the career mode. Sport Blue has joined the squad.\n\nGet yours today: https://t.co/GY4KULOTaw https://t.co/tnDuzMAnod @Aidan51728407 Love it! Never get tired of seeing this beautiful console. https://t.co/h3S9Q3gwO6 RT @RE_Games: The #ProjectResistance Closed Beta Test registration ends in under 24 hours - don't forget to sign up on @Xbox for a chance t… Save big, play bigger.\n\nShop the Square Enix sale: https://t.co/9YzeHnHbjY https://t.co/WbMajHdOPU @AznSlickSlaya The song for this dance started playing in our heads instantly. https://t.co/3V0A9l2YLg RT @PlantsvsZombies: Hordey ho Neighbor! Week 3 is live 🙌 \n\nFight off waves of enemies in Ops Mode that will test your taste for terra-fic… @Aidan51728407 You know we've got to go hard for a new Gears game.  Enjoy! @ZomBree_03K64 Now all the gaming stuff is just a bit more compressed. @mannyre4 Us whenever we see it. https://t.co/2rLXVer9Hv @AznSlickSlaya And some of this. https://t.co/bs8kklTR1Q @JDotAlderson That's a big milestone! Thank you for being part of the community for so many years. https://t.co/udAiidRgur @nuka_queen It's what we do! @BirdmanTfg That's not the kind of mistake that you make twice. https://t.co/M0QovSLdDS @Hanniba03898431 Good luck if you enter the sweepstakes! Bastion’s Brick Challenge is bringing new sprays, player icons, and the legendary Brick skin to everyone’s favorite, lovable omnic.\n\nAvailable now through September 30: https://t.co/kbGQwPDTnA https://t.co/hb94oaPzmu @Aidan51728407 Congrats on picking it up! How's it looking in your gaming setup? @FritoCrash That always makes for a fun stream. How'd it go? @Kai67453357 A firsthand recommendation is always good to hear! @AyeGeezus Time to pick up a new main controller? @ZomBree_03K64 We love little details like that. @AshtianiRon It's a worthy cause! We're happy to be a part of it. @AznSlickSlaya Yep, the contest entry ends today. We'll keep our fingers crossed for you. https://t.co/Bqtl8HQksX @Bryanarellano22 We like the mono-colored buttons as well.  It really brings the look together. @SCP035rblx Yes! Microsoft Flight Simulator will be out next year. @ZomBree_03K64 Don't know what we love more: the curly pig tail on the back or the carrot. https://t.co/QIqEBG3vGp @ISwallowYoMama Just the color! @MennyLandis Have fun with it! @TreatsYouXBL That's the only way to be sure. @UNMASKEDAV3NGER Check with your local store, but they should be out in the wild now. RT @RockstarGames: WANTED: Barbarella Alcazar\n\nThe first of 10 new weekly Legendary Bounties in Red Dead Online\n\nThe de facto leader of the… @ZomBree_03K64 Those Ikea shelves really are absolutely the perfect gaming cabinets. @OrioTar You shouldn't pass on this one, in that case. @MrMrsGamers Sorry, it is strictly 18+ that day. @MaadDabber Oh, we got it, just teasing back. 😉 @ZomBree_03K64 Gotta make sure that picture is high quality enough to show off the details. @NickkReyes Amazing work! What are you moving on to next? @turtle_dan49 We know you'll crush it like... well... that. @BirdmanTfg Made them look like turkeys. @MaDzGaming_HC We caught the recording! You almost had that 0-3 comeback. Nice work. @nuka_queen Picking it up just for the color is perfectly fine. @Gemannihilator No, you can still expect the tickets to go on sale at 14:00 GMT that day. @sam_hotstepper Yes! Good luck finishing it up. From the open plains of Red Dead Redemption 2 to the sun-soaked metropolis of Grand Theft Auto V, there’s no shortage of worlds to explore with the Rockstar Games Publisher Sale.\n\nSave up to 65%: https://t.co/bTrrnb9qzi https://t.co/jV5TIWr8xd @Kaito1991 Same to you! https://t.co/4OsrblgwqR @MerlinNZGames We're glad it turned out to be an epic self birthday gift. @IRGRL Congrats to all the spark.. throwers?  Sparklers? https://t.co/sdHWLGXosc @scott_neath We're working on it! There's always going to be more work to do, but we love to see progress being made. @SquishyUnicornn Perfect for Fortnite fans and gamers of every stripe! @saurogon Battlefield 3 brings us back. We've been loving Battlefield 5 and how beautiful the maps are. @OrioTar We like that it's a subtle, dark shade. It'll look great with any setup! @DarthRaLLe Thanks friend! https://t.co/D0o5iKCWYA Dead by Daylight keeps getting stranger and stranger.\n\n🎮: https://t.co/2MlPgcq3cp https://t.co/vkzzU4AuZT @DarthRaLLe Like this right? https://t.co/SuxgnX3SqE @MaadDabber It works just fine for any game. @ZomBree_03K64 We love the collection! The lights are a nice touch. https://t.co/xSWBViJg0L @30sNintendo Thanks much! @DarthRaLLe You're welcome brother! https://t.co/B98dWqyv24 @ssouls_ Happy account anniversary! Thank you for being part of the community for so many years. https://t.co/VtuD684Czm @DarthRaLLe Had to do a double take because of how amazing this is! Congrats! https://t.co/2SbJTBKnol Introducing your newest squadmate. The Fortnite Special Edition Controller is here: https://t.co/UhkrEIGNBC https://t.co/JHQUrs710z @LabibM7 You guys make it easy! Consider this your invitation. #X019 tickets go on sale October 1 at 6am PDT/2pm BST. 100% of the proceeds go to support @SpecialEffect.\n\nMore info: https://t.co/AYHevweyoP https://t.co/LZ2GF8L3y1 @mrjordilicious Oh right, we were reading it the wrong way. But glad to hear it went well in any case! Staying true to form for this series of games is quite the complement. Don’t let the evils of the ancient Corruption get between you and your family.\n\nChildren of Morta launches October 15: https://t.co/L034uaLHSx https://t.co/pbFtYFYMbG @_bizzski_ A solid lineup! We know what you mean!  We wonder if this is how our queue feels whenever we download a new game. https://t.co/57ccR3yAPz @_bizzski_ Glad to hear it! What have you been playing? @RomeoBravo_ Makes us feel like we're watching the sunrise on an early morning hike. https://t.co/nXNr5c6xWr @Chris25551 There are a lot of amazing opportunities for screenshots. We're looking forward to seeing what you capture as you progress! @Chris25551 The ending gave us chills! Such an amazing game. @AsdEagle_ We're so glad to hear that! Everything we've seen so far looks amazing. @Chris25551 @TheFramedShare @Visual_Moods @GamerGram_GG @Urban_Tentacles @GamerGram_RT @_GameScreenshot @photomodeaddict @SocietyOfVP We remember this fight well. https://t.co/QbeD0pO6B5 @Sarcastic_Wolfe That makes for a lot of work. Good thing the game is so much fun! @mrjordilicious It's almost time to stream! Good luck out there fighting the swarm. https://t.co/t73Viwa1B8 @Axskis Accurate. https://t.co/wL4YNHspvJ @NeonThanos We're always down to watch a few rounds of Apex. Good luck on your next stream! https://t.co/qXIyOvxCJo September still has some fight left in it.\n\nGet the mid-month Games with Gold: https://t.co/SzJt834VDJ https://t.co/hL8TOcGGK4 @happypommes We loved every whisper in our ears. @Chris25551 @Captured_Collec @TheFramedShare @GamerGram_GG @GamerGram_RT @_GameScreenshot @Urban_Tentacles @SocietyOfVP @photomodeaddict @Visual_Moods We love how they're just outlines with light behind them. Very cool. @JwTsion Ohhh, we need to finish up that one as well! @Cryptic61332314 We love our community! Thanks for talking with us. @Cryptic61332314 Let us know what you think! We loved the campaign and are having a blast with multiplayer. @SteveRic13 These are beautiful! Nice work. https://t.co/v66pzxiC4R @ShawnBell1881 We can certainly see it haha. https://t.co/gNzF0XnKaU @Sephgaming1 And a happy Monday it is. Thank you Mothy. https://t.co/IfTt9cx55c @DependaH You made it through that fight with style. https://t.co/IMEEojJxXI @TwitterGaming How could we forget? https://t.co/C6vwQXKBem @MorganRandyBal1 But will you finish it today? There's a lot of game there. @THE_PUPPET33R It's so good! Making good progress? @MehdiYahia2410 That's awesome! Fahz is a pretty entertaining character. https://t.co/hnranQWkwk @Jordanevans_97 Takes a lot of hard work, but it looks like it paid off! @gamezstaa We love how it turned out! Eyeing one for your collection? @boomtaplive We hope you can all reunite soon. In the meantime, LFG (Looking For Group) might help you find a group to play with. @AlchemystTifa This makes us want to play Dragon Age: Inquisition again! Last time we played as a Dalish Elf warrior. @vendetta_g_14 Ohh, are you enjoying it so far? @E_Vaan Nice work! Are you diving into multiplayer now? @SpartakusUXP You know we are! @JoshCyber_ FOR DOM! https://t.co/HM32afoTTA @AlchemystTifa It's hard to narrow down a favorite character in Mass Effect, but we always love having Garrus by our side. In Dragon Age, we usually have Morrigan on our team. @JoshCyber_ Have fun taking out the Swarm! https://t.co/JTWLtmExMF @mr_delcampo But it was worth it, right? @AlchemystTifa They all have such amazing stories! We love how much influence our decisions have on outcomes in Mass Effect and Dragon Age. Get battle-ready in the Call of Duty: Modern Warfare Open Beta.\n\nPre-order and get early access September 19: https://t.co/M7DeZYj1Uz https://t.co/edFeGCqTFo @JoshCyber_ Dom's story left a powerful impression and it's amazing how his sacrifice has helped the next generation continue the fight. https://t.co/FieVvHxgCs @iJaesin Have fun in the beta! @JoshCyber_ That was a tough moment for sure. We're proud of you for carrying on. https://t.co/H3nlDjhvB6 @Pedro17183203 That's the way to do it. It's a great way to de-stress. Unless you're playing on the highest difficulty. https://t.co/LZcsPVqawY @boomtaplive That's pretty good! Do you have friends jumping in a squad with you? https://t.co/43LWEO7Q9x @PrimalHD1 Some Monday action sounds like a great way to get the week started. @Johnny_X_G4m3r We're glad you're back online! Good luck with your collection. @boomtaplive We love horde mode! Have you made it through all 50 waves yet? https://t.co/CAvmWVhw9W @TwitterGaming Well, there are some fights that you need to finish. @oceanr08 We are so hyped up after watching that! @Kowalewski_FWH Thanks for picking it up! Are you moving on to some multiplayer? @e_pingin We wouldn't want to guard you.  Good luck! @Mr_Stobs @DannyCShow @Simply_Tinx @PrimalHD1 @_Sytex_ @_RageOfAchilles @muzz_jack @JM95_YT @Denxh29 @papachubbz We're ready for some DOOM! Game on. @garraouiaziz Well worth finishing up! Good luck. @Kohlert2 Boom. Mind blown. https://t.co/9u2HSkZRYI @Antitinkerbell We can feel our Monday blues fading away as we watch! @boomtaplive Sounds like an awesome weekend plan. Are you going to jump on multiplayer after you finish the campaign? @Eyeganism Repping that Gears t-shirt as well! Nice. @DarrylMalone7 One of our favorite parts of the game is that you can brush and feed your horse. https://t.co/BcO5T5JsTD @boomtaplive Have you finished the campaign? https://t.co/821588dbtM @RemyAMS Everything! https://t.co/zPSk8YQRsc @vgamer0000king There are also a lot of beautiful areas to explore! https://t.co/Tepj9bneO1 @Cryptic61332314 It's a classic! Hope you can jump back in and play soon. @Jordanevans_97 Congrats! Also, taking a moment to admire your power level. https://t.co/RDjePOU7SD #Gears5 is a hit with critics and the biggest launch for Xbox Game Studios this generation. \n\nhttps://t.co/h8MFspEyqW https://t.co/2uTNqrtbpI @e_flores_13 It's been an amazing experience! https://t.co/Con1wuve1x RT @Fallout: Scorchbeasts are dropping like flies with over 300,000 taken down in just 6 days!\n#Fallout76 Project Clean Appalachia status:… @PetersonAlvin A console renaissance man! @SpeediWill Your setup's looking great! Thanks so much for sharing the pic. @MaDzGaming_HC We're always down to watch some League play! Good luck out there. @Pedro17183203 Nice! Will you be putting some game time into Gears 5 this week? @Strive4greatnzz Be sure to report the accounts if you have the chance. @germanmu10 We love playing through co-op with friends! Who steered the skiff? https://t.co/XTOMkO0Sln @ObiBertKenobi Have fun! Pet a skag for us! https://t.co/tvMgq4WUDq @_SamEther Our thumbs are getting sore just thinking about it. https://t.co/t48SGR1hEs @WreckitGamingAU We'll be keeping the lights on for all Blair Witch streams, thank you. @NickkReyes They didn't name it \"perfectly sane.\"  Working as intended! Still gives us chills. Get the #Gears5 Kait Diaz Limited Edition controller and Pro Charging Stand.\n\n🎮: https://t.co/A6zZP7pRFY https://t.co/aQ2uIWkZZA Every fight needs the perfect gear. Complete your setup with all the best #Gears5 accessories for Xbox One and PC.\n\nBuy now: https://t.co/F358q3YEcs https://t.co/lAI3k3V1wv Today’s a good day to finish that game you started. What is it? @II_Blittz_II We love engaging with the community! You all are a lot of fun. Hope you have a great weekend. https://t.co/qborc7Yqrw New game modes, new shots, new stars.\n\nNHL 20 is out now: https://t.co/ArSLbbdqFC https://t.co/dOf9XNu3T1 @PharaohNight We appreciate the gaming community regardless what you play. Hope you have a great weekend! RT @RE_Games: Awful lot of zombies out there. Better take cover inside that mansion - wait, not that one! You have once again entered the w… @II_Blittz_II It's because we care about your nutrition. https://t.co/Mp01KxNFJc @II_Blittz_II Don't forget the tomatoes. @OfficialMarkLaw Sounds like you two are going to be the perfect team for some future co-op games. He might like Team Sonic Racing too. https://t.co/IkJDva6MFy @II_Blittz_II It's important to fuel up before jumping back into the action. https://t.co/Oe9MAbmzN8 @II_Blittz_II Nice! So now it's onto Gears of War 4? https://t.co/bVEJ9mhI6L Stay in the light. The free trial for A Plague Tale: Innocence starts today.\n\nPlay now: https://t.co/r8kaU2KgKM https://t.co/JCKRPkSyrm @i_schiggy We're hoping that'll be soon! @EzMrcz One of these will work! https://t.co/lwsQDFurBG @RocRobinson1 You should totally complete the set! @fpsmattyb Beautiful mayhem! https://t.co/35WBANDfSK @pluslunar Sounds like you'll be ready to go as soon as you're done with work! Hope you have a great weekend. @Kyle377 The campaign was an amazing journey. Really appreciate the story and how scenic it was along with new elements that were introduced into the game. We're looking forward to where it goes next! https://t.co/yIkzH3fsxd @FLYRiP1 Nobody should ever feel bad about the games they want to play. @franklez Nice work! Blue team was probably wondering what happened. https://t.co/H2fMtzGfKS @XRunforcegamer Thanks for being an awesome fan! And you're right on time. @CrazedOne1988 Spartans never skip leg day. https://t.co/9LhAM7QtG2 @Zyzer_RL We'd love to have you in the community if you find an Xbox that's right for you. @domicpr We are right there with you! @Steven_Cring We do love us some curly fries. @JustLiveHappy We're glad to hear it! @Alba_MacP Nice! No new game gets past you. @Solareon96 And it was 🔥good🔥 @Shawn66Hall Hopefully you'll have plenty of time over the weekend! @i_schiggy We're not seeing how you could go wrong, there. @Synth2568 Thanks for the love! https://t.co/6MVerDmbBD @Id3alV3locity We hope you have a happy one too! https://t.co/woB4rQd234 @Hloniphizwe4 Thanks so much for the shout out! @II_Blittz_II Looking good. https://t.co/rwL3NTYRbL @minecraftdemai1 Respects have been paid. @CoreyB85491665 No, it will be another generation of console, like the difference between the Xbox 360 and the Xbox One. @Buck25425 Only the finest for OUR community. https://t.co/K7zU7vkvej @HadesSomber How goes the fight? https://t.co/xEKTl8riIL RT @FocusHome: It's time to set off to Teer Fradee! \n\nGet a chance to win this beautiful Xbox One X customized for the game by @RandomPrint… @LGhostrecon We love these captures you've been taking. You've got a really good eye for them. https://t.co/Hme5pJ8wZn @Rafaelthree That's awesome! A new gaming crew is always a good thing to find. @Scudda85 Well oiled and fully fueled! Fight hard out there. https://t.co/FqPp9Qn4G2 @Nyxi117 When it comes to gamers, at least. https://t.co/wUxnRIMqfz @SpaceOfficialC1 We're just glad to see them kicking butt again. @bourbon_cheap It's all BD all the time up here. @AceyBongos Thanks, boss! https://t.co/wYaSReKhc4 @II_Blittz_II Not that it's a problem. https://t.co/CA3oMnmFlT @II_Blittz_II Sounds like you got a busy gaming schedule! We have a lot on our list too and it's starting to look like this. https://t.co/HofrFnVblE @II_Blittz_II We like how you can get Sparks and level up for watching or streaming too. Also, Crackdown 2 is awesome! @pluslunar That's so exciting! Do you have everything all setup? https://t.co/f2eHsXdz9A @RodrigoMagaa12 You would need Gold for the online multiplayer. @II_Blittz_II That's awesome to hear! What have you been streaming lately? @Alcoholikaust Hope those claws are ready. https://t.co/QySrGBTHIf @joshgaming126 At least now you can relax by the fireplace. @SasuKun01 Game on. https://t.co/kJm2OoH1Fe Mayhem is back for thirds.\n\nBorderlands 3 is available now: https://t.co/8IVjYWOLqq https://t.co/li4HP8zbaV Epic battles, never-before-seen story moments, and The Great Saiyaman himself are just scratching the surface of DRAGON BALL Z: KAKAROT.\n\nPre-order now: https://t.co/NiSInX25Ko https://t.co/biDuqKZorF He’s a 99 in Madden and a 100 in real life. @DeAndreHopkins dropped by Xbox Sessions with @Sling for a Madden NFL 20 “2 Minute Showdown” and more!\n\nWatch the full episode: https://t.co/5GwVITVpPq https://t.co/fjoBSNk4Hs @ooharmi They are so cute! Love the eye patches. https://t.co/xKXthpP6ix @KourtsideKing @Squircle_MFT What's happening when you try to download the game? RT @XboxGamePass: *you've got mail voice* You've Got Games\n\nand you can install them remotely with our mobile app: https://t.co/FUZXaj5ljq… @MagicWhiskey Love has been received. https://t.co/tXIsKR5ErV @Electronix_247 Sounds like you'll have a lot of gaming to do this weekend. @masterchiefalt And we love our community! https://t.co/Uae55iJU0r @De_Vice Thanks for the love! https://t.co/vqv9CeUT5R @Og_Keshawn Late next year, and we'll find out closer to launch day. @LAW3TV Watching this stream like https://t.co/0XkKm4CklI @SMASHEDUREGO Hope you're having an awesome day too! @SInow It changes with each new cover. https://t.co/VsgdYFWeUw @Arbys Do finger guns count? https://t.co/IJA5VtFw9M On this week’s episode, we get reacquainted with our old pal Claptrap and show you how to get free characters in Gears 5! \n\nCheck it out: https://t.co/VDtrlXi3Fn https://t.co/uZQBafRukn @corybarlog https://t.co/SXZXuRBMti @PlayOverwatch Game on. https://t.co/sB4ba3nY1C @wingstop We're gonna need some extra napkins. @cartoonnetwork Always our number one pick. https://t.co/yO9OdXztxB @starwars We're looking forward to this game too. https://t.co/PsgqXNuRgL RT @Team17Ltd: Step right up to the Carnival of Chaos – the brand new DLC available now for #Overcooked2!\n\n🌭 New recipes!\n🤡 New chefs!\n🎪 Ne… @505_Games We're ready to press every key and button! https://t.co/0VPOy9eRwM @PlayStationEU ALL OF THEM https://t.co/Y1eKzloxxB @Total_Debacle Press [X] to game. @DamianMtz27 We hope they're tears of joy. @stephenB80 Excellent choice. https://t.co/70nmWQgses @JayMann0 We got you. https://t.co/apq0pEPMW0 @xander_frangos Is this us right now? https://t.co/yMbqVz93yT @Complex You already know. https://t.co/OQMPVV1l2N @MrLemmyLemmy Always. https://t.co/mk5znqK8Mr @Aymplify We caught the 2nd pan win. It looks like a kick to play. @espn Guess we're playing some No Mercy. https://t.co/VPRUuP2FTn The road is yours.\n\nThe Benefactor Krieger is available now in GTA Online: https://t.co/M6whOEyh9r https://t.co/rMSeDqJXxK @DiGiExPoSamm It's how you bring people together. https://t.co/Ypp3phPzws @GoogleStadia 💚 @WreckitGamingAU Would YOU stop a train in a place where getting robbed at gunpoint was a daily thing? @brokeasshunter We're all gamers at heart. @Trecheon Us seeing the positivity and support https://t.co/AdFhWoW6GL @Outright_Games Well, BMO does get us. https://t.co/lVRISsP67G @MicrosoftStore Tagging in @XboxGamePass, always our player 2. https://t.co/6ivdmsWhEs @lorsteibel We love how varied the environments are! Thanks for sharing the pics. @mattwer3 We love all our gaming community. https://t.co/8jg2YFYoeR @Rk3Sh3 I n d e e d @Zuby2510 You can call the button whatever you like, we don't mind. Jump into the @CallofDuty Modern Warfare #OpenBeta Early Access starting September 19.\n\nPre-order now: https://t.co/9VsMQLsUxs https://t.co/CAIoejsVjF @AhmedA4129 h e l l o   g a m e r @LunaLight7_ Shout out to all the multi-platform gamers. @TwitterGaming v i d e o g a m e s @NovaStar556 We love seeing how perfectly they fit in with the Smash Family. https://t.co/4hWgx1nUGr @XboxPope We've got your back because you've got ours. @redbox Thanks for the love! https://t.co/bFZzjusroe @Enzzo_2911 More joy for everyone! https://t.co/0xKYD7WXJ5 @neighborhood704 And some of this. https://t.co/em8flqWTIN @Aymplify It's the perfect day for it! But what is this GAME?? @OpusHopeless Everyone should just enjoy the games they love. @DeltaDood Sending love back. https://t.co/FfUKcpU2Ms @iMahyar77 And you keep being awesome! https://t.co/wx9oZp9PNx @StigPlayer How we feel about the gaming community. https://t.co/Dscp9W7MEs @MaxB117 We hope you make it out! It's such an awesome time. @Enzzo_2911 We just want everyone to enjoy their games. @Scudda85 You're showing up for the fight, that's the important thing. https://t.co/Xvzwu3e22R @SHIIFTERYT We had a chance to handle one and we've gotta tell ya...  It's real nice. @sonicseriesfan We're all just cool gamers. https://t.co/dnLLo1Kml4 @ObiBertKenobi Thankfully even Borderlands 3 is a fairly low-impact activity. Feel better soon! @Gabe69105475 They didn't even have button lettering technology in those days. @JenMsft And making life long friends with teammates. https://t.co/FguIaS3GJo @Stormtroopaahh Doesn't matter what you play. We love the gaming community! https://t.co/vA6VAYbokA @RobinWithTheD We are all gamers! https://t.co/ruLkXEs806 @shanejewula We've got much love for the gaming community. https://t.co/rvT6iYOCqB @Jnorr2211 That's fine too. https://t.co/bRutwtEWHr @Infitytweeter And we like you. https://t.co/RqVYIMmCyq No matter what you call it, one thing that unites us all is the X button.\n\nHappy #NationalVideoGamesDay @PlayStation @NintendoAmerica - and everyone! https://t.co/kj2jSUo53X @ROLANDO04809135 Stay tuned, more info will be announced the morning of (tomorrow). @hoppy_1996 We haven't dug into that as much as we'd like yet, but this weekend for sure. Smite grotesque monsters and escape eternal agony in this gruesome new action-platformer.\n\nCheck out the trailer: https://t.co/K3H6lx2yNr https://t.co/FwljVXFduq @MaxB117 Same to you, bud. https://t.co/hifhgKURwl @iamCurseMind That's what we always like to see. @pasanonix We love the art style for it! @sciencepie So cute! Miya looks like the best gaming companion. RT @WatchMixer: Ready to get back to the Moon, Guardians? Go back in style with this custom Shadowkeep-themed Xbox One and Controller! #Swe… @darrenkerwin Sounds like you're making responsible choices!  Hope you and Peter have a lot of fun adventures together. @darrenkerwin If you do go with either of those please tag us! Would love to see Peter all dressed up. @sciencepie Love your parrot's coloring! What's their name? @darrenkerwin Aww the name suits him well. What outfits were you thinking of for Peter? @TheLoStRoman1 Time to get your squad geared up and take it to the Swarm. https://t.co/BEkYc7tVkk Rusty isn't your everyday knight... yet.\n\nDiscover the knight within: https://t.co/4r9xipehTY https://t.co/Gt2YXF5jH3 @Dylan___mcbride We loved that little dance. https://t.co/K4KIL2i3uo @hoppy_1996 Have you had a chance to get into the multiplayer yet? @MaxB117 We're glad you're having such a blast! @darrenkerwin So cute! Did you name them yet? https://t.co/B3taywGqEQ Introducing three new ways to forge your path in Red Dead Online.\n\nFrontier Pursuits is out now: https://t.co/AXiC6vn6Ke https://t.co/bfp21bVyOJ @iamCurseMind We'll take a Jack co-op player any day. He makes for awesome support. https://t.co/tcKLMDLZQP @StayAtHomeGamr That can be fun too! Plus watching people win all the time makes us depressed about our own stats... @BlakxSwag Nahh, you're the one bringing the talents. @Chris25551 @SocietyOfVP @Visual_Moods @TheFramedShare @Urban_Tentacles @_GameScreenshot @GamerGram_RT @Captured_Collec @GamerGram_GG @photomodeaddict Getting our umbrellas ready for round 2. https://t.co/x8qEY7o1bd @StayAtHomeGamr We might have a chance to watch a round or two. Fight hard! @iamCurseMind Hopefully you've got a partner that'll be on at the same times as you. @butwhybro1 We see you got good advice on how to report it. Thanks for taking that step! @madseedjoe Good luck not dying! @Jeystron Some serious voice acting skills right there. https://t.co/uoNG7mqSOP @Synistyr_X Sounds like the purrfect stream to watch. https://t.co/wK3TsR0czK @PimpsDontCry710 Huh. Might as well try it and see? @dragonightmare_ That was really sweet of him. Are you two going to squad up and play it together? @PrimalHD1 You know it! Hope the Swarm is ready. https://t.co/ZoEYQRSLsE @Chris25551 Please do! https://t.co/l6ZqEjJTnY @PrimalHD1 You'll be all warmed up for Gears 5! https://t.co/M6rVw1clov The Couch Co-Op Sale was cool but then we thought, what if we doubled it? #DoubleDiscounts\n\nSave now: https://t.co/9HWmJCrQup https://t.co/ranW1oej91 @Chris25551 @TheFramedShare @Visual_Moods @Captured_Collec @GamerGram_GG @Urban_Tentacles @GamerGram_RT @_GameScreenshot @photomodeaddict @SocietyOfVP We're ready to start singing in the rain. https://t.co/NfdApfu8PO @StayAtHomeGamr Good luck out there! Any wins on stream so far? @uhan89 Good luck! It'd be a great addition to any setup. @khaos_playz Same here! More loot is always a good thing. @EBlog11 Oof, you've got to be slow and careful at that difficulty level. https://t.co/M87q96ePBj @BlakxSwag The wascallist wabbits.  Nice shot! https://t.co/ItUGi5kjUv @dixhelen That is a brilliant idea. https://t.co/H9uKuQWIir @JoshQuake We're sure you'll power through! Have fun. @ElliottShindel It's going to be a very good weekend. @LGhostrecon This is amazing! https://t.co/7o82HVspBv @STM__OXY Those were some amazing moves! Really smart use of cover. https://t.co/9iNtrirtAP @iamCurseMind That's a great way to play it! @AdamFrederick10 That'll help keep your reflexes sharp, for sure.  Have fun and good luck! @ajoccio Excellent choices! @MarkiMora Props for reviving that vintage meme. @chrissyboig87 Watching that download bar like https://t.co/Z3gz90D2Bu @GuiltyGamerz Do it.  \n\nFor the puppies. https://t.co/2LCU8R64Zo Sea of Thieves Smuggler’s Fortune is packed with loot, adventure, and treasure.\n\nLearn more and keep an eye out for monthly updates: https://t.co/rb55w9F1WZ https://t.co/6ebWbrUyEW @ededdneddy96 The rare and powerful double thumbstick claw technique. https://t.co/53YAXpHHow @BSteve1107 Best of luck if you enter! @DrOlDurty Love it! @steimer @GearsofWar You've got a strong nature vibe. https://t.co/eK0phCclLs RT @PlantsvsZombies: 🔊Time to get weird - and vanquish-y!🔊 \n\nWeek 2 of Battle for Neighborville is live. Gain points by vanquishing or revi… @gamrgurl4life That is an epic Cayde figure too! https://t.co/9uTAsr1hlo @TrunksWD Sounds like you're an OG Xbox gamer. https://t.co/Zf3pDkK9GL @TrunksWD It's amazing to think about where it all began and how the fight continues with awesome old and new characters. https://t.co/vVB3xOMRY6 @AdamFrederick10 So exciting! Are you going to jump into the campaign first? @Dom3sticH3ro Some of the best story telling! https://t.co/oFxg8uzBoC @Fleischerj1221 Also a little bit of this. https://t.co/6Fi8XfqZYQ @BAJOE_88 This is an awesome capture! https://t.co/4IIuSRYjS2 The biggest sport on the biggest stage.\n\n#eFootballPES2020 is out now: https://t.co/NTAW92EGnX https://t.co/gHU4AphFr6 @Bungie When we saw it. https://t.co/e1lk2s9HLW @RoseGold1224 The dream.  🤩 https://t.co/5ZeUu0UE4K @WatchMixer @Bungie https://t.co/HqnpQBgXQK RT @WatchMixer: The most legendary Fireteam ever needs a third! Join @pparsons and @XboxP3 now for your chance at the Year 3 Bungie Bounty… @AdamFrederick10 We admire your hard word and dedication. Have you taken it out for a test run yet? https://t.co/CEN25IJP1P @RoseGold1224 To SPACE! https://t.co/H0tt0ZcMrE @iamCurseMind Awesome work. Are you picking up on the multiplayer as well? @GarbageGrove253 So much hype! @DancingViru It's okay, just don't play with our emotions like that. @xuav_Rice You are in LUCK @PrimalHD1 Man, we love that Bloodhound skin. @youngzinj That depends on the game! @DaRokisLTU They did such a good job with it. We had trouble putting down the controller all weekend. @tdub4b That's what we like to hear! Glad you're having fun on it. @SMITHxNC Good to see you streaming! @korishiva Making gains every day! Hopefully your stream went well. @IncXbone Sounds like an awesome stream! Thanks for sharing. Some things never stay dead. The Walking Dead: Telltale Definitive Series is available now.\n\n🧟‍: https://t.co/Svw4ZfW5EV https://t.co/vzvfmXHtTs @stu_yoakam We'll be online with you! @Dakronicsi We put that in the fun category haha. @Dakronicsi Having fun is what it's all about. https://t.co/NJCYUhVorF @zaz420gaming Let nothing stand on your way! 🚅 @AH_Michael Mmmmmm. Gears cookies. https://t.co/cDnA0nNTaJ @StilKyle Nobody enjoys it. https://t.co/4H6JnwBkAW @PaulSims91 The English countryside is just about as far from Sera as you can get. @Dakronicsi Maybe they are still learning how things work. We have faith in you and your teammates. https://t.co/O8LbMnv3qu @Dakronicsi Horde mode is amazing! Have you been able to get through all 50 waves? https://t.co/n89JOc1fzq @Dakronicsi Awesome to hear! Are you almost done with the campaign or you mostly playing multiplayer? @JTrainAComin We'd be watching for the delivery driver like https://t.co/rcbgrjGehJ @WaitesMathew Ahhhh we're so excited for you! https://t.co/mNaQgk8uJW @iamCurseMind Good times! How's the story coming along? Let’s goooooooooooooaaaaaaaaaaaaallllllllllllllll!\n\nThe #FIFA20 Demo is here: https://t.co/MarCqzL2f3 https://t.co/7vcbBQ84pa @JediLunchBox Home sweet home. @ChloesaurasRex It'll go along perfectly with your POP! collection. @JTrainAComin Just a couple more days to wait! @GarbageGrove253 We're envious! Hopefully we'll be getting in some play time tonight. @Deathcea21 Are all your guardians at 750 already? @CryptoClopz The campaign was so much fun! We loved riding around on the skiff. https://t.co/ctmvbfTzah @caviey_ Just stopping by to pay our respects. https://t.co/eTaqgXQh4u @StilKyle Just imagine how gritty that armor would get with all that sand. @ShawnBell1881 We'll see you there! https://t.co/3JHF0QkrHd @Dakronicsi We loved the detail in all the maps. For sure, took the skiff around to enjoy the scenery. @BrandonTyler We're glad you're thinking so! @zaz420gaming Almost to the big five-oh! What will your next goal be? @ShawnBell1881 Hope you're ready to jump into the action. https://t.co/Bdv764B8UY Mystery, magic, and mischief await all who set foot on the Island of Teer Fradee.\n\nGreedFall is available now: https://t.co/N3nvfSa7Zc https://t.co/zLy40K3c1H @Dakronicsi We really love how Jack's upgrading system works and their combat abilities. https://t.co/KOA0ybtpm4 @Chris25551 @TheFramedShare @GamerGram_GG @GamerGram_RT @_GameScreenshot @photomodeaddict @SocietyOfVP @Visual_Moods @assassinscreed It's hard to imagine wanting to! @PaulSims91 Which banner did you end up flying? @DancingViru ಠ_ಠ https://t.co/14SCUDEfZB Time to fight like you mean it. #Gears5 is available today.\n\nPlay now: https://t.co/RZkErOMv0s https://t.co/RAtxWJO0hh Don't make plans on September 13. There's an intergalactic psycho cult that needs to be dealt with.\n\nBorderlands 3 is almost here: https://t.co/PeEEURNxqe https://t.co/tllSZKPcuH @The_Michelle620 We know you will! Good luck out there. @gannon19xx We hope to see you on both sometime in the future. 👍 RT @Bungie: Phil Spencer. Pete Parsons. \n\nTomorrow @XboxP3 and @pparsons team up with YOU.\n\nXbox Live - 3pm PT - https://t.co/UeVBy7TX7b ht… @_ForrestGaming Treating ourselves on Monday like https://t.co/CC1MErDJkw @_ForrestGaming At least we've got Gears 5 to get us through the day. @gannon19xx Good luck hitting that goal! @Darth_Gibbious How cool is that?? Wear it with pride. @tuckervasher Time to aim for 200. We're sure it'll be no problem. @thedestinyshow Has it been that long? It seems like just yesterday that we woke up.. https://t.co/Dx0dxM6OR6 @DanielHibbert51 We'll raise our coffee to that! https://t.co/zRaWBeppk5 @WooDRowWillSON3 They learned that important lession. @LAW3TV Congrats on the new partnership! @Ms_delFino We remember it well! @KingThorne91 Your character is looking amazing! https://t.co/EZN0PMzia4 @gsagabs1 So many great memories from it! @thunderluca The best boy. https://t.co/p3Zw9Rf9dt @Kat8110 It's impossible to choose! @DanielHibbert51 That's awesome!! Belated congrats on getting past 100,000 Gamerscore. https://t.co/89c2TGLI6J @DanielHibbert51 That's some good feedback to have on PC Building Simulator. Good job! Getting 100% of those achievements takes a lot of dedication! @DanielHibbert51 For sure, we usually switch to Farming Simulator after doing competitive matches in Overwatch. That's awesome you've been learning from PC Building Simulator. If you like puzzle games you might like Inside or Limbo too. @DanielHibbert51 Farm Simulator is a really relaxing game. Have you been learning about some cool builds with PC Building simulator? @DanielHibbert51 Have you been jumping on that Farm Simulator? @PrimalHD1 Get in there and flex on 'im. https://t.co/xggM7wz8r2 @Bungie https://t.co/1mGsdhvqFL @Antitinkerbell Happy hunting out there! @g8merdayz You've got a great setup going there! What games are you currently playing on them? @dmverreau If you're signed up with the regular Xbox Game Pass service, the game should unlock at 9pm your local time. @DJG1nge_gaming That mode's so hectic! We're getting stressed just watching. @AbdullahAX4 We're having the same problem, we can offer no help! https://t.co/EfDnR55kQI @BigOPumpkin That sounds like amazing fun. We're glad it's bringing back memories for the both of you. https://t.co/UcjaMHRlKw @IGFrankmaxx @GearsofWar You got some great shots there! @RoseGold1224 We're gonna play so many video games! https://t.co/lEZfG396Jn @ajoccio We're glad to hear you're getting some good use out of it! What games are you playing right now? @117Jake The campaign was a lot of fun and we loved how beautiful the maps were. Also, your controller collection is awesome. @BrickrMarine Never too late to appreciate a classic. https://t.co/xEmqa9ehWq @endollaz That sounds like someone who was ready for an epic Gears weekend. How'd it go? @manicundead How'd your Gears weekend go? @Zmarksthespot94 But just think how cool and adorable your setup will be. https://t.co/7xNDZNgL7z These custom #Gears5 @RockstarEnergy cans from @luke_preece are straight up metal. \n\nhttps://t.co/MwTKuLCyOZ https://t.co/b3IdHYbMjy Noise complaints are the least of your concerns.\n\nBecome a Founding Neighbor: https://t.co/YdB7gSWo9W https://t.co/UmvjjFXHc7 Play #Gears5 now through September 15 and get the Terminator Dark Fate Character Pack free.\n\nRedeem now: https://t.co/W4nczNIdFf https://t.co/vLkqH2cnsU Every hunter has something to fight for. Find yours in Monster Hunter World: Iceborne.\n\nAvailable now: https://t.co/wSAHIiYo7V https://t.co/uLaiwRDRMY Prepare to bring da ruckus.\n\nRT and tag #HuluXboxSweepstakes for a chance to win this custom Xbox One X in honor of the new @WuTangOnHulu show Wu-Tang: An American Saga.\n\nNoPurchNec. Ends September 28. Rules: https://t.co/X4tngAg5QQ https://t.co/o3Fsqrz6WD There’s only one way to stop the ancient, ominous, all-seeing Creature… some good ol’ fashion pinball.\n\nCreature in the Well is available now: https://t.co/xLJS2zXXcE https://t.co/nxKjWb3E6V The Hyperspace Xbox One X is dripping with star power.\n\nGet the #NBA2K20 Special Edition bundle: https://t.co/skesldJswU https://t.co/3Zyocc1sUt Put your squad to the test in the Ghost Recon Breakpoint closed beta now through September 8.\n\nWatch the trailer: https://t.co/x0hfLRJ6Lk https://t.co/PjfXvqlh91 Gear up for the fight with the right Xbox One for you.\n\nChoose your #Gears5 Bundle now: https://t.co/8RaRhIKvTX https://t.co/2qQFc1vkW1 @MsAshRocks Same to you! https://t.co/EiK2qvSjqn @JerrySoCal Happy hunting as you look for more! RT @NBA2K: 2K Day Giveaway 🚨 We're starting things off right with 2️⃣ chances at a special edition @Xbox bundle! Reply with #2KDay and #giv… Play “The best Gears of War game yet” on Xbox Game Pass Ultimate now: https://t.co/e3TFarkWVq\n#Gears5 @GameRant https://t.co/4QESep7boq Add some style to your starting lineup.\n\nGet $10 off select controllers before the clock runs out: https://t.co/f0UFOpU6uk https://t.co/UrKLoM4KEJ @MicrosoftStore Feelin' the vibes. https://t.co/tA53nSLnal The one and only @RZA drops by Xbox Sessions for #Gears5 co-op and an early look at his new @WutangOnHulu show Wu-Tang: An American Saga.\n\nWatch the full episode: https://t.co/YW8neVUcXh https://t.co/DjZK0DWroP @endollaz Glad you're having an awesome time with it so far! @Steve3Thumbs You're taking \"gearing up\" to the next level. @AcKingbutch That's our usually strategy too. We like having context for characters and maps. @LordX___ Gears hype! https://t.co/EQsS0iQUWl @AcKingbutch Are you starting with the campaign or did you jump right into multiplayer? @JerrySoCal It's fun to find easter eggs like that! @Yoshi101Live Even a little lag can't slow you down! https://t.co/IxgxDC6nEj @Cynguy1 \"Yes, yes, I know you're busy doing something boring, but I need attention now.\" -Cat @RafaNintendo57 Hope you have a lot of fun! https://t.co/T6g7regEKM @wllall99 Us every time we see this console. https://t.co/VHKUjm6fEC @AcKingbutch That is an amazing setup! Betting those speakers really help with the immersion into the game. https://t.co/tYcfcagFpr @uhhbreea Sorry to hear that! One possible solution would be to set up an Xbox Game Pass Ultimate account. You'll get the game and all Ultimate edition features as part of the subscription. https://t.co/ayw8zp8Azg @ThundurusXz Double👏👏clapped👏👏 @HazelEyedEspada Us this morning https://t.co/I0hvd19MAM @wllall99 We try to cultivate a kind of zen on insane modes. Deaths will happen. Be one with the death screen. @ElliotGray7 We really like what we've seen so far from you both! Maybe they will be willing to share a few protips. @PsychoUKNas666 The shading and line work for this is really well done! https://t.co/0moRSOuCRU @ElliotGray7 Thank you for sharing it with us! We're always impressed with how skilled the Forza community is when it comes to taking captures. @W89PL @WeArePlayground @ForzaMotorsport Really creative work! Love how much the blurry background makes the car pop. https://t.co/tnSKJarBWR @ElliotGray7 Love the blue. This is a beautiful capture! https://t.co/3KGuRz8qsu Show the Neighborhood what you’re made of with the #NBA2K20 bundles.\n\nBuy now: https://t.co/h0qAwQIQCl https://t.co/D7USXcl09Q @jose_otero Da da da dat da dat da da da da ya da @Sway1888 If you upgrade your existing Game Pass subscription will be converted into Ultimate. Details: https://t.co/uE4APAdfDO @WPumpkin262 Yes, you'll have options to filter both. https://t.co/3EJzCPoMSp @master77g Do you have Game Pass Ultimate, or just the standard Xbox Game Pass? @MaxKHill Happy birthday to you! https://t.co/TOQCCqxGjU @BlakxSwag That midair shot was especially impressive. @m_whitfield Looks like you're all geared up! https://t.co/JSQYybAFX4 @ShawnBell1881 That's great to hear! Supporting your favorite streamers is a great way to pass the time while you wait. @ACID360 That's a good start, at least. Hopefully you have some time blocked out over the weekend to make some more progress. @GSGRUSHER That hat must be getting HEAVY. @CmdrCrashdown There might be a few more in the backlog after the first couple of millennia. @oceanr08 Whatever it is, you know we'll watch it. @Zmarksthespot94 That's really exciting! Are you going to set General RAAM up next to your console? @DjSammyV Glad you're so happy with it! We had an epic time getting started on the story last night. @ki11ingerk Sounds like they have troubleshooting options posted here: https://t.co/rplSx0jRlp @RoseGold1224 When Rosie posts something awesome about space games. https://t.co/whCsPNsTdJ @Redman577 No problem! If you want to see a more detailed comparison you can go here: https://t.co/kcUOd408ta RT @XboxMexico: Celebraremos el lanzamiento de #Gears5 en #XboxGamePass Ultimate con #GearsInk y una transmisión especial.\n\nNo te la pierda… @KD8FWV Getting some solid play time in is totally an accomplishment in our books. @Trecheon Get that fireteam together! https://t.co/NvT8EV7dRX @captain_jay21 It can wait for a few days while you get your Gears on. @Muckyhandz Your existing subscription will be rolled into a Xbox Game Pass Ultimate sub. You can see more details here: https://t.co/wPS9e3d6NZ @ShawnBell1881 You've had a night to play it (we assume!) What do you think of it so far? @giddyypixie It can't hurt! https://t.co/yfFTvQcdwS @x118xParrot We love the orange! Good luck! @Beantownblockhe We loved hearing about the creative process behind the design. https://t.co/1H4hHi4Id0 @Redman577 Xbox Game Pass Ultimate bundles Xbox Live Gold and Xbox Game Pass into one subscription. Additionally, you'll have access to Game Pass on PC and console. There are other perks such as having early access or getting items such as skins. @openmikke_ Looks like you're all geared up! @ACID360 How'd the first night of Gears 5 go? Happy #2KDay. You already know what we got you.\n\nPlay NBA 2K20 now: https://t.co/9ADf8t9Seu https://t.co/hL0FFF6w9V Locked, loaded and just in time for #Gears5.\n\nGet the Xbox One X Limited Edition Bundle: https://t.co/l0f2kcWoEq https://t.co/7nOtL5sAoI Get your Lancers ready. #Gears5 is available today.\n\nPlay now: https://t.co/vcK952UTpq https://t.co/1ToFY0jhSu Who’s ready for some football? Celebrate the start of the season with Madden NFL 20 Free Play Days.\n\nPlay free September 5-8: https://t.co/dKuJn1kaEN https://t.co/lFOIZxbfqL @Bungie https://t.co/0vdmWMzsYm @WatchMixer @Bungie @DestinyTheGame https://t.co/DjJ6OiqEP1 And this BANDAI NAMCO sale is to go even further beyond… with up to 75% off select titles.\n\nSave through September 9: https://t.co/9N4mlce0oh https://t.co/GsIa8HGGh0 @LordSion45 If you've got Xbox Live Gold and Xbox Game Pass already, it doesn't cost any extra to switch over to Game Pass Ultimate. Might be a good time to check into that! @antishotoz We're afraid not, early access is a feature of the Ultimate edition or Xbox Game Pass Ultimate subscriptions. @Rakoshnor Nice! You'll have a special edition collection going. @KristofferAnd9 We're sure there will be some freaky stuff as you go. https://t.co/DevldFHYYh @LordSion45 No, the early access is a feature for Game Pass Ultimate subscriptions. @dkenpachi87 Should be 9pm local time unless stated otherwise here: https://t.co/08F2V4KwN1 @MelonMatt93 This might be a timezone issue. Check here to see what time Gears 5 is available in your region: https://t.co/NoJ938nR3V @ThisIsNinjaMike We're happy to see them join the Smash family. Hope you have a lot of fun playing! https://t.co/Hmh2We9WEH @AnotherUkGamer1 Awesome to hear! Take all the screenshots for us. Where’s your allegiance lie? RT for Ghost, Like for Wolf.\n\nGhost Recon Breakpoint Beta is live! https://t.co/sT05MVwFpN @QuietT3x Love it! Excited to see the finished version. https://t.co/eVvaBi8ipf @ShuaReborn May you and Banjo-Kazooie have many victories! https://t.co/XVRaO1rHI8 @lu_casrs Yes, you will! RT @EASPORTSNHL: Get your hands on #NHL20 with @EAAccess - available on both Xbox One and PS4 NOW! 👀\n\nPlay Now 👉 https://t.co/GxiHpeCFRw ht… @TwistedPro_ It is, yes! @kinglee213 So excited for you! Have fun! https://t.co/9nTK6JXj9i @LGhostrecon Educational discomfort. @Itjustworks4 Good luck and fight hard. https://t.co/OJtCGhJq9A @SmashStudiosGG Banjo bringing everyone together. https://t.co/hl2qbb6lpH @ShadowOpsFN Whoop! Whoop! https://t.co/tmR7u6BmV0 @Audioslave_Kiri It's so close! Have an awesome night getting started on it. @Bitcoin_Pasha Yes, if you're accessing it through Xbox Game Pass Ultimate. @marcapwier64 Let us know what you think when you do get a chance to play! From the Locust of Gears 5 to the monsters of Iceborne, This Week on Xbox is taking no prisoners.\n\nWatch now: https://t.co/9qIOAlUj4u https://t.co/uqCmHS0mBx @ShadowOpsFN Nice! You starting with the campaign? @ShadowOpsFN Depends on your time zone! You can read when it's available to you here: https://t.co/IC2hmMEMKd @SkorpXL We're all waiting for the release window to swing around! You'll be playing soon. @Turntablez Us running to the nearest Xbox. https://t.co/L3kQ5qKCkW @LGhostrecon The close up on that heath bar really makes the clip. @JacobTitus09 That's what loading screens are for. @demetri73675774 We're excited to learn more about Kait's link to the Locust! https://t.co/F9TQPwXI9u"}