{"tweets": "@iogicLucas No, you need to put it on a bearing And one more! https://t.co/o3dW9QvDnN Hi Mechanics!\nWe are deep in to survival work, but we don't want to leave you hanging without something new to check out.\nHere's the first look at the drill! https://t.co/30FNKeXPgW @Xell076 You will not have to pay extra! @MAGNETIDE @AlveSvaren @Fatikis @BlueFlame_SM @kan_gaming We hear you! Right now we just want to wrap up Survival mode and make sure it's great. After we release it we will start doing a lot more frequent updates @Plzbanme Super busy but good! but that means a lot of things are getting done. We will post some new stuff soon! @BlueFlame_SM @kan_gaming It would take us a lot of time to move things over from the survival version in to the steam version. We rather put that time in to wrapping up Survival. When we did smaller updates, many mechanics where unhappy and wanted survival. So we decided to focus on that. @CountessRK Most things are in place now. Mostly balancing work and tweaking left. It will definitely come out when we are happy with how it all plays Hi Mechanics! \nIt's that time again! Devblog 19 is here! All the latest news from the Scrap Mechanic HQ\nhttps://t.co/Ht1LoOoWXb https://t.co/2fFlLqUigr @Universe_666 It will be up soon! @KwadratKox Yes! :) @DesertReyes That is correct! @McBoyLeo1 @MarpasCZ Slight delay, but it's up now :) Hi Mechanics!\nWe have a new awesome devblog cooking.\nIt should be up this Friday if everything goes well.\nTill then, here's a little teaser. What could this be?? https://t.co/MYzm2B0l0m @MAGNETIDE Sorry! Team is in crunch mode :) We will have a new devblog up end of next week with a lot of new stuff. @getting_wooshed Next week! Hang in there :) @MarpasCZ A teaser should pop up on monday next week :) @RhinoRiley1 End of next week is our aim. It will be a good one! @Plzbanme No worries! We are just heads deep in work. \nWe have a new devblog cooking that we will post end of next week. It's a good one! Hi Mechanics!\nWe are preparing a new devblog that will come later this month. We will be showing a lot of cool new things for the first time! Stay tuned! https://t.co/colG5bNCSs Hi Mechanics! \nWe have been really pushing the size of the world and how far you can see in the survival terrain! It will be really fun to explore! https://t.co/ShIJeqSfFN @Insomnicron Creativity is still key in survival. We let the player approach a problem in many different ways. @QuestionMark_ We will try to have them in with survival. They got put on hold before @QuestionMark_ They will be added! Hi Mechanics!\nHere's some warehouse combat!\nYou have to be quick when going head to head with a Tapebot. Those tape rolls pack a punch! https://t.co/wZv0CzGfmR @YoUjUsTgOtPrnkd We did some tests, but it was to easy to build creations that made you nauseous. Hi Mechanics!\nWhen you run out of potatoes to shoot, your best bet will be to do sneak attacks with the sledgehammer! https://t.co/AEUEIdNqkE @Milosz_2 We are still iterating on this. Right now they glow for a few minutes before they stop @joewhale33 It will be before 2021 for sure! Sorry to keep you waiting @LeBogooo Glow sticks in survival are a lifesaver. \nThey are also really fun to use @basiletho007 @the_Tweety_Birb @joewhale33 This is the tricky part :) @draganovski417 Yes, they explode after they stop moving. You can't pick them up again as it is now @QuestionMark_ Yes, it needs more work. It's just a early sneak peek @Sp1r1tD3v Yes, we might let you craft it with different colors. @toby_tck They make a flush sound when you exit them @Plzbanme Got one up now :) More to come Hi Mechanics!\nToday we are testing out a new glow stick that mechanics will craft in survival. \nVery useful for lighting things up in the dark when on foot! https://t.co/tmSXis12R2 @JoeyPer09287112 Yes, there are still things we can do to make collisions better. We hope to have these fixes in with survival @JustAGu38700727 Hey! cool design! :) @productivemars2 For sure, these are things we have to do. We are trying to find a slot for that atm. @CountessRK You are right! It is @zheerias Yes, this is something we would like to do. The survival world is huge. When it's done, we can add it to creative. HI Mechanics!\nIntroducing the scrap gas engine!\nIn survival you will sometimes just have to make things work with a less reliable gas engine. Luckily, you can build a better one! https://t.co/8Rz2uSOHDY @Charlie65352337 Will show this to the coders! Thanks @MAGNETIDE We are still here! Just covered in Survival work @SteveMakerspace This is amazing Steve! @Plzbanme We will try to get some smaller update out before that @BurritoRecruit There will be a part that does that for you @Holden15982927 Both! Plant by hand and by using creations will be in survival @BrentBatchYT Not sure we will keep the usernames there. We will see. Do you like that idea? @futurevlad2 They are not loot boxes like in free to play games. These are just boxes with random parts and consumables :) @CountessRK We are working on them right now. They will not have dubstep sounds. It's something more unique and intimidating. @KempEVGA It's just a design sketch. Don't look that close :) @KempEVGA It's up now :) Hi Mechanics!\nDevblog 18 is finally here! We have a lot of new things to share!\nhttps://t.co/1QhG5tG3K6 https://t.co/i5ObtGke2M @getting_wooshed Today! @RhinoRiley1 It will be up soon :) @DavitzRo This one is in Survival. It's coming @Holden15982927 No, however, that is a cool idea! @kan_gaming @Steam_Support Yes, this needs to be fixed. We will dig in to this. @EthanHe20019105 We hear you! We will get to it after survival is in the game @yaboijohn4216 Yes, as soon as survival is in the game we will look in to it @SamEdwa43285334 Yes, we will add wings in the future + more @antonis67171656 @kan_gaming Yes, this is something we might do. We also like to make it easy to see what mods are used on creations and challenges before downloading them @MAGNETIDE @Plzbanme It's up now! Hi Mechanics! \nA new devblog coming next week packed full with a lot of new things we've been working on! It will be a good one! As always, here's a teaser! https://t.co/pf4lGAdkZD @Plzbanme There will be a teaser later this week! @MustaSimpanssi Next week! @Plzbanme Will be up next week! @No27947510 Can you send us a screenshot so we can see how it look? @SamEdwa43285334 Coming next week! @SeniorCaution New devblog coming next week :) @MAGNETIDE @NoodleAzul It's coming! next week @AlveSvaren Next week! @SamEdwa43285334 Yes, key rebinding is on the list! Hope to have it in for the survival release @LEO18810 We will give them some love after survival is in the game. Thanks for the example! @xlimgaming Oh yes! We might have a devblog for you next week! @jwkrenik Yes, we will look at other platforms after Survival is in the game @NoodleAzul We will do some updates, but right now we are going 100% on survival. @SamEdwa43285334 Soon! We have a lot of new things to share @JohnBla75767317 Yes, we will try to get a new devblog up soon :) \nWe have a lot of new things piling up here! @gamesmusic454 We are working hard to make it happen as soon as possible ;) @Clintter1 It’s hard to say since we keep adding and tweaking. But it’s going really well. Game design requires a lot of testing and iterations to get things right. @MarpasCZ We hope soon :) @MAGNETIDE Yes, we want to make that possible. You will however have to craft the creation. More on that later. @kan_gaming That was the plan, but then other things where more priority. But we want to get that in at some point for sure @MarpasCZ What language would you like us to add? @dung43618667 Thanks! Yes, after survival mode is in the PC version, then we will look in to other platforms. @Letsgo00HUN @kan_gaming Right, we have been exploring other ways of doing welding. Welding block is one of them, or in our case it has been a welding “bearing” Programmable block is something we are also looking in to. @Letsgo00HUN @kan_gaming Happy to hear your suggestions :) @Plzbanme It's going great! We still want a few more elements to get in place before we do a devblog however. We have some really cool things in the works. @AjPeterson05 Yes, more on that later @TK116S @Dart_Frog_YT @DrahcPro It's still in the making. We keep adding things and update it @kan_gaming Thanks for the suggestion! Will bring it to the team @Dart_Frog_YT @DrahcPro It was at the start, then we took it out and made our own engine @blueman444444 It's a good idea! We might do that @Hansonnnn1 Yes, we might let the player choose hotbar design @Travis84414216 Oh yes! that part will get a lot more extra love @DrahcPro It's our own engine. The Scrap Mechanic engine is built from the ground up with physics and multiplayer in mind. @SJ4gsdDMmaxJrc8 We will try to do some here and there but we need to focus on survival right now @lennart_beatz Night mode will be in Survival for sure. Maybe in creative later @MAGNETIDE We have been playing with some ways of making tank tracks but nothing set in stone yet @Plzbanme We might change to numbers, just testing bars now Hi Mechanics!\nWe are currently working on a menu redesign that will come with survival \nMaking it more user-friendly and better looking. \nLet us know what you think? https://t.co/r8LK6lwziK @LarsLarslego @IceGamers We have a terraforming system in the tile builder already. \nBut it would need to fit our survival design to be added. We will however explore it more if players keep requesting it. @DoubleRedGaming Are your drivers up to date? @IceGamers No plans for that at the moment. But if we get a lot of requests for that, then we might look in to it. @ManSparkler @zwolfs23 We are 100% on survival now. But we will get to fixes soon again @JohnBla75767317 Neat car! can you give us your specs? @LEO18810 Can you explain more? @Matthew71704327 We might do that after survival is added to the PC version @kan_gaming Thanks for the feedback kAN, we will take a look at this. @MoonboSM @AxolotGames Looks awesome! you even made the backpack RT @MoonboSM: Hey @AxolotGames, I felt like getting creative by cutting up some paper, but I just couldn’t get away from @ScrapMechanic! ht… @xlimgaming Yes! it's on our list @xTRe75JCPnDpB3H Yes, we will look in to it after survival mode is out. @Mato11_on_Mixer @ScrapManYT Yes, this is something we want to have in the game for survival @Spesi42 Yes! we are working on that @Wikiwawo Thanks for the feedback! @Fotoradar1 No, they will just be parts. We might make them breakable for survival however. @kan_gaming We want to add that at some point after survival comes out for sure! @GentryBrodie Thanks Brodie! It will just get better with the things that we are working on now :) @Kevin43r5 We will look in to it after survival is in the game @zwolfs23 All the things you bring up are things we would really like to add/fix at some point. We just need to find a window to put time in to it. Hi Mechanics!\nDevblog 17 is here with some new Survival news!\nhttps://t.co/ncctdyuU5b https://t.co/7GBg5Ydd2p @speediplayz_G It will be up soon :) Hi Mechanics!\nWe need to push the new devblog till Monday next week. \nBecause we want to include one more extra thing that needs more time!\nHowever! here is a teaser on what's to come!... What could this be? https://t.co/sCL6hnIEAQ @heyjude1971 Hi! \n1. We might make it bigger or loop the creative mode world.\n2. We are looking in to this now for survival. Maybe with upgrades @Plzbanme A long time ago we did some VR tests for Scrap Mechanic.\nThe main problem is the driving. You can really get nauseous when you flip and spin to much in your creation @KwadratKox Most likely with survival mode @Plzbanme Hi! not at the moment. Maybe later @ScrapFan27 We want to do this! @iogicLucas It's a Scrap Mechanic mystery @CountessRK Don't think we did any changes to the Radio recently, but we might tweak it. Thanks! @kan_gaming Thanks for the suggestion Kan. I will send it over to the team @MadsGjellerod We have one cooking now. Next week @ThatisThom Hi! we will start working on these things after survival is in the game @KwadratKox Very soon :) @Spesi8 Next week! @ScrapManYT Thanks! we will look in to this! @speediplayz_G We are aiming for next week! We have a lot of new stuff to show Hi Mechanics! \nThe challenge builder is finally here! \nPlay, build and share your own challenges on the workshop!\nhttps://t.co/IKnnB6dgqi https://t.co/REoqb8JaYO @DerpyDurf We haven't decided this yet @GamingSkill_YT Will give it a go! :) @iogicLucas @CountessRK You got it :) @CountessRK For example, It will let you set turn degree on bearings Hi Mechanics!\nAll interactive parts will be upgradable in Survival Mode.\nThis time we are taking a early look at the upgrade steps for the Driver's Seat!\nLet us know what other interactive part would you like us to show next? https://t.co/nVUoUh2nwB @DoubleRedGaming No plans for that now. But that might change if a lot of players will ask for it. @dvajda656 Can you send us a email with more details and your computer specs and we will look in to it for you @RGCreeper1 Menu and settings will get a lot of changes for survival mode @PSrW0dy8Uqytc4I Yes! it will be added with survival mode @Fungi31363821 Early next month! We are wrapping it up. We might have a test up next week. @DoubleRedGaming Hi! For now we don't have plans to let players add their own sounds. @byr_tyr Do you miss them? @SlasherssOffic @AxolotGames Hi Jan! We will explore this more for sure! @Clintter1 Yes! @PhillyTara Hi! We don't have a date for a Xbox version yet. But it's something on our to-do list for sure. @MistGo22 Coming early next month Hi Mechanics!\nWe have a improvement update on the test branch today with some fixes. But before we release it, we would like to see how it runs for all you mechanics. \nCheck out the update list here! https://t.co/o0lRw3YmgO @RishabhNeeshath Thanks! We don't want to commit to a date since it could make us have to cut corners. Our first priority is to make sure mechanics will have a great time playing Survival Mode. Our aim is this year however. @qubitstudios More on that in a future devblog @qubitstudios @iBallisticSquid Thank you so much :) @MrEddie_Rocks Hmm, we will look in to that. @iBallisticSquid It's what we are aiming for :) @DashN19 Survival Mode is made like a mod from the ground up so that modders can have a ton of freedom Hi Mechanics!\nAll interactive parts will be upgradable in Survival Mode.\nHere is a early look at the upgrade steps for the Electric Engine! \nLet us know what what other interactive part you would like us to show next. https://t.co/31o0XQsaOy @Luke01495864 @49elYfALVdOwJYQ It's the collision checking when big creations collide.\nWe will do more improvements that should make it better @Kubbson It's in the works! :) Hi Mechanics!\nHere is a early look at the builderbot that you will play as in the Challenge Mode Builder! https://t.co/MNIxV6qQSR @Kealan5199 @AxolotGames Thanks for sharing! How did you trigger this? @__The_Wrench__ Thank you! Challenge builder is next up! @LukeGeraghty63 @AxolotGames Strange, will share this with the team so they can dig in to it. @theunisdk We will look in to it. Dose it crash at any specific time? @BillyBo11091312 Try again now, we just made a fix that should fix this @ikeyzeroseven We checked your video! Was really fun to watch :) @LukeGeraghty63 @AxolotGames Sorry to hear that your having issues with our game. \nCan you give us some details that we can work with. For example your specs? @Dtwar_ We have a fix up now that should solve this issue for you @__The_Wrench__ We made a fix today. Check if it works now @MistGo222 You are a master mechanic! RT @SHuddart: @ScrapMechanic Got Bored and found the model and poses for the observer bot in the new challenge modes. Took a while to get i… @SHuddart Nice one! :) @Friz64_ We care! We will check it out @Draconic_CPU Thanks! we will look in to it Hi Mechanics! \nWe hope you are enjoying the new Challenge Mode!\nWe at Axolot would like to wish you happy holidays and a wonderful new year!\n2019 will be a great year for all Mechanics and Rafters! https://t.co/hnoUixVztK @Eatmorechips441 Happy to look in to it. Can you give more details Hi Mechanics!\nIn case you missed it, Challenge Mode is finally in the game. Can you beat all 40 Challenges?\nCheck out the new trailer here: \nhttps://t.co/7y6vVW6Go4 https://t.co/A7d1nkx632 @InsanePxl Later when we added more challenges @JudeLau95 Yes we will @DKullerd Yes it is! Challenge Mode is a appetizer Hi Mechanics!\nChallenge Mode is finally in the game with 40 Challenges! Check out the new trailer and read the update notes here!\nhttps://t.co/38JI5mLvis https://t.co/RwHdS9nfNC @edvioaxed We will look in to it. We will do a lot of fixes in 2019 @MAGNETIDE It's a neat idea. However we need to put all our team on survival. We might look in to something like this after if a lot of players ask for it :) @P1gn0 Hey! that place is staff only :P @BoIn_ger Not us, but players should be able to put levels like that together when the Challenge editor comes out @jiinjan Multiplayer with Challenge mode should work. But both of you have to be on the test branch @ScottBloomberg_ How many canisters did you place? @AlveSvaren @LEO18810 That is the plan :) @rEtRo_sPexX Great time! @puffadder04 When survival comes out @PhillyTara Yes! after survival mode is added @IvanConcha452 The blue sky is just a place holder in the test. We have a new environment for the Challenge mode being added when we release. @kan_gaming We might add it after the release together with other improvements. @LEO18810 No, for the final release we will release all 40 and then keep adding more after @TheMineTrooper Yes, it's on our to-do list @AlstrakBG Wow! that's a really good time! :) Hi Mechanics!\nWe just updated the Challenge Mode test with some new improvements. Also! we added one more challenge for you to try out! More coming soon! https://t.co/XDXWQiNQbq @futurevlad2 Make sure to send the bugsplat report and we will look in to it Hi Mechanics!\nTime for a VERY early Challenge Mode test! \nKeep in mind that a lot of things are still missing that will be in the final release. More info here:\nhttps://t.co/HxnZHPh0ON https://t.co/napNPC5haY @Plzbanme Pretty good! should have something up for the mechanics to test this week @LoneSideGaming We have that :) @kiellmepls Thanks for the feedback! @dvajda656 @futurevlad2 Survival mode has 11 male skins and 11 female skins right now. We might add more. Also a lot of customisable options like hair and skin color. @thegamerman88 We've been joking about it at the HQ. But if the community wants it, who knows :) @Thirty__Thr33 Thank you Rodrigo! It will be worth the wait for sure :) \nRegarding water canisters, we will explain how that works in the future devblog! @Plzbanme We will put up a very early test these coming days @KempEVGA Adjustable steering is something we are playing with for the driver's seat upgrade @Plzbanme We are still here getting the challenge mode ready! @JasonHorkles The survival world is huge, so yes @Man_Guy_ Yes! Friends can join and help you build @flvmll @kan_gaming We might do something like that for the battery @kan_gaming We tried to do that. But it made things less flexible and inconsistent. \nConnections with consumables will be done with the connect tool. But objects will have to travel trough a pipe. However, modders will most likely be able to change this as they like. @MAGNETIDE It's up now :) Hi Mechanics! \nIt's finally time for devblog 16 with more news from the \nScrap Mechanic HQ! \nhttps://t.co/JyfBSwwNEc https://t.co/7JiHS1j1TJ @Podlum4 In a few hours. It will be up today @Marius_Oyjord Yes! it will be up later today @d0ugh_nut Don't worry, it's not :) Hi Mechanics!\nDevblog 16 is coming Friday next week with a ton of new stuff. For example this strange box?? https://t.co/wu7D1ZFzGn @Ynoita @DarticoLambar Sure! we will look in to this @max_machac The survival world is huge. It should not be a issue. We might also look in to growing trees in the future. @DarticoLambar That skybox is just a placeholder. It will look even better :) \nMore on new spud parts later! @Fatikis It's not fluff. Day/Night cycle is big part of the gameplay @JohnBla75767317 Maybe in creative, not in survival @LEGIT_ANDREW_ It’s a hard decision since there are so many creations using it. The community will decide @KaneHart Not yet! It's still in the works @alven_gamers @LEGIT_ANDREW_ Yes, it will be similar! @nlwarnack Thanks! It will! We are not cutting corners :) Hi Mechanics!\nThis last week we made a really nice day/night cycle. \nHere is a beautiful sunset from our survival build. Still work in progress! More news coming soon! https://t.co/rO6oWCnp0Y @joedonttell Not in the next update but we will do a lot more improvements before survival @RoanMerens Still here! working hard on survival and challenge mode. A lot of cool stuff coming up! @Plzbanme We are alive and we have made a ton of awesome progress this month. We will try to share some of it soon! @MAGNETIDE Yes, stronger spudguns will be added in Survival @DashN19 Not yet, but we are getting a nice stack of new awesome things to share soon @MarpasCZ What language would you like us to add? @Ep1c_M1n10n Not yet, but we will add it @kakka27240664 Hope to post soon! @alven_gamers @MAGNETIDE @andreas5524 Thanks! Good thing is that there is still a lot we can do to make it better @futurevlad2 We will look in to this, thanks @JohnBla75767317 We have been doing some amazing progress on survival. We hope to post a devblog soon with a ton of new things @alven_gamers Agree! We will get to all of these for sure @MAGNETIDE @andreas5524 There is still a lot of optimisation that we will do before survival. A lot of nice fixes planned :) @Rolfje2004 Yes, that's something we want to do soon @Qik____ Hi! Yes, but we don't have a release for that yet @futurevlad2 Yes, we plan to add ropes and if we add them, they will also be in creative @Cheeze82980723 We will look in to it after Survival is in the game @andreas5524 We hear you and we will improve on a lot of these things! @LEGIT_ANDREW_ This one got pushed back a bit but it will be added @ikeyzeroseven Thanks, we will look in to it @axl0012 Thanks for the suggestion! @InsanePxl As soon as we have enough new things we can share. Should not be to long till the next one @Plzbanme If the twitter is a bit silent it means we are doing some good progress on survival. We will have a bunch of new things to share soon! @SammyTheTwiter We are working on something like that :) @kan_gaming Shoot us a email and we will help you with that @thimmyk10 Do you get this issue in the new test branch? @Mrmcfeffers It's in the update list. Should be working now. Do you have the same issue in the test still? @kan_gaming We will fix that, looking in to it now! Thanks @campbellino9 We are happy to hear that! :) Hi Mechanics!\nWe just put up a new test with some nice improvements. Read more here: \nhttps://t.co/tQYL3ceUTw @DarquosLeblack When we feel confident that it will be something you will love playing :) @JasonHorkles Yes, we have a jammer like that as well :) @Insomnicron You win :) @DarquosLeblack It will come out with survival mode Hi Mechanics!\nRemember that we hinted about a new warehouse robot in our latest devblog? Here is a early sneak peek! Can you mechanics guess what type of warehouse work he was designed for? https://t.co/dCP9Ez4PCL @MadsGjellerod When we have a bunch of new stuff that we can show. Next devblog will have some really awesome new things in it. @ScrapManYT We will look in to this, it's for sure something that we need to add @JohnBla75767317 @Charlie65352337 They will be limited @Charlie65352337 Probably challenge mode, but we still have some work left. \nWe want to make sure it’s really awesome. We are mainly working on survival mode now. Hi Mechanics! \nIt's time to blow thing up! The explosive update is finally out! Check it out: https://t.co/u13guzqTtE https://t.co/l6zefhJZ82 Hi Mechanics!\nWe're super excited to announce that we will be doing a building event with Raft this weekend, starting now! Read more here:\nhttps://t.co/0sPRfwqPAa https://t.co/dYekxyCNEE @JohnBla75767317 @MoonboSM We have made them more sensitive now. Will be in the next test update @MoonboSM Thanks! we are happy to hear that!\nWe will look in to adding that setting @kan_gaming Both are fixed. Coming soon :) @GavinWi46194224 That's strange. Dose this only happen on the test branch? Hi Mechanics!\nThe explosive canisters are now on the test branch!\nhttps://t.co/xIXxUIrL6R @Mrmcfeffers It dose not spread at the moment but for sure something we plan to add Hi Mechanics!\nWe are almost ready to put the explosive canister to the test. Unfortunately we need to push the test till Tuesday next week, since we need to do a bit more internal testing. Hang in there! https://t.co/EzMY8mNlzc @Kgamer64x Yes, in creative they push you back @Lingontuva2 @Steve1Killer Scrap Mechanic is made in our own engine @Creep_Unicorns Yes, they will explode on impact if you go fast enough @Steve1Killer In C++ @I__I0__0I__I Yes, but only in survival Hi Mechanics! \nWe hope to release the explosive update on the test branch next week. Here's a sneak peek! https://t.co/mEQ7AcNBGj @Edvin_xD @AxolotGames That's amazing! RT @Edvin_xD: @AxolotGames @ScrapMechanic I may or may not have made a 3d model of the Bearing and then I 3d printed it. And it spins like… @DerpyDurf Thanks Durf, will share this with the team @ScrapManYT Yes, we might have a test up next week for the canisters @frostyshorts89 Can you send us your computer specs so we can take a look? @Paxon57 Yes :) Hi Mechanics!\nThe Woc from our latest devblog got a lot of love from you, so here's some more. Will you be nice to these guys? https://t.co/2AHyIEIphm @Plzbanme @Mr_JefferyShaw Challange mode? No, it's a little bit later @XernecYt Much bigger worlds will come with survival mode @Plzbanme We are alive and working :) Explosives coming up @theogamer479 Fix is coming in the next update :) @Mr_JefferyShaw We are working on them now! Hopefully next month :) @Gal_Horowitz It's fixed! coming in the next update @kolya3500 Yes :) @kan_gaming This is fixed now, we just need to put it in a update with some other things @Engineeringenis What version are you playing? @rEtRo_sPexX Yes, this will get fixed :) @kan_gaming Watched part of your stream. The fall trough the terrain bug is something we fixed but it seems to be back. We will look in to it asap!\nThink it's related to the tile builder. @NikolajLVolkman In survival mode, yes! @kan_gaming We might do that, but we will do mountable paint guns first Hi Mechanics!\nDevblog 15 is finally here with the latest news from the \nScrap Mechanic HQ! Check it out here!\nhttps://t.co/DnabQKYG31 https://t.co/sg3Uses8ul @clb0013 Coming soon, it's a big one :) @KaTooLi_Gaming That will get fixed, thanks Hi Mechanics! \nThe Spud Gun and more is finally in the game!\nCheck out the latest trailer and read the update notes here!\nhttps://t.co/B9vRdcyevS https://t.co/C1gMtyyPyi @speediplayz_G This is a small chest :) @clb0013 It's a grow light for plants. Might come back when we have farming in Scrap Mechanic @xXkaimerXx Can you guess what it could be? :) Hi Mechanics!\nDevblog 15 is coming early next week with a lot of new exciting stuff. For example this amazing thing! https://t.co/ZuexQBv0zW @KDT00011 Was this on the test branch or not? @KDT00011 Nope, how did you trigger this? @PappaDarryl @CocoaCoCi We have a devblog coming soon! @kan_gaming Yes! we want to add this. We just have to decide how to add multiple interactions with a interactive part in a nice way. Now we just have (E) \nWould love to get some suggestions! @KrYojeNiX What would you like us to fix / add? Would love to hear more feedback @LeonElstrup We will look in to it as soon as Survival mode is in the game @alven_gamers @PhotosByAlbin Sorry, we decided to delay it so we could include two new things we've have been working on. It's coming. @Magwol0807 Yes :) @CocoaCoCi Survival mode is happening 100% :)\nBut we understand that it's frustrating to wait. @Creeperman1112 It's not abandoned. It's the opposite. There are more people working on Scrap Mechanic today then ever before. @Kubbson Yes! the team is working on it full time @speediplayz_G Soon, we are waiting to get a few things done so we can include them as well. @Plzbanme We delayed it so we can include two more things that we want to show. @Plzbanme The fundamental game design for survival has not changed that much actually. But we did add a lot of new things. @kan_gaming We will take a look, thanks @clb0013 More news coming soon! @ChrisWhippit Survival är under utveckling. Det vi gör är väldigt stort. \nMen det kommer vara värt väntan :) @Lord_Lima_Bean Interesting idea :) @PhotosByAlbin We know it's frustrating to wait. But survival is coming. When it's out it will be very clear why it took time. We are really adding a ton of new stuff. We will try to get a devblog up next week with some of the thing we've been working on. @kolya3500 Yes, we will add that later @ScrapManYT It's delayed since we decided to make more improvements to the multiplayer before we release it. As soon as possible. @MachineWithAPet Yes, we want to change it so you can play it offline @WillemHanhart We will look in to that after survival mode is in the game @Juup14Juup @AxolotGames Thanks! We are happy you enjoy it. It will get even better with our future updates @kan_gaming We got a lot of requests for that. It's something we would love to add in the future. But right now we are focusing on the survival core features. @fOElEppE Are you playing on the test branch? @Gaming_Patriot_ Strange, send us more info and spec and we can take a look Hi Mechanics!\nSensors will soon pick up potatoes from the spud gun! We hope to add this to the test soon. We are curious to see how you mechanics will use this feature! https://t.co/kFcDnadcRL @MAGNETIDE We have something like that in the works :) @MoonboSM This should not pop up for you anymore @Calvin_Khor99 We have been looking in to ropes and chains. They could be possible if they didn't have collision. \nWe will explore it more. @APB___ We will look in to consoles after survival is in the game @Engineeringenis We found a few bugs that we needed to deal with. We hope soon. How did you trigger this glitch? @kan_gaming They should be gone now :) @AiTorror Send a email to Axolot games and we will get it. @ettio54 No :) Survival for Scrap Mechanic is in the works and its coming along great! @Kampftroll1 restart Steam and it should appear after you press \n\"Add to cart\" Hi Mechanics!\nRaft is out on Steam and we are giving everyone who owns Scrap Mechanic a 20% discount on Raft!\nhttps://t.co/50jnyw402g https://t.co/k5qr9PN4Qg @Reece_riles This will get fixed soon @slobbyslush It's coming! @robotthomasNl Feel sorry for the player who would drive behind you :) @blueman444444 They might be later. They are actually made out of two parts in survival. But we had to make it in to one part for Creative. @ScrapManYT Oh yes, we have things like that in the works. \nA lot more destruction fun is coming :) @DerpyDurf Yeah, we will try to have this in the final Spud Gun release :)\nGlad you like the destructible blocks! @Marius_Oyjord @AxolotGames One of them might be added before @rEtRo_sPexX Yes, but it might be for a later update. It needs a bit more work. @loganthawolf Oh, we have some fun things like that in the works @SabiqShahab Yes, we are still doing improvements @ScrapManYT Thanks! we are fixing these things now :) @kan_gaming We are fixing this right now. Should be up soon! @STAMSITEs Vi vill lägga in det. Men det är inte prio just nu. Men det kommer att komma in.\nÄven när man går eller hoppar på en knapp. @LeBogooo How would you use that? :) @slobbyslush We will change it! We are still working on that animation. @MarpasCZ Yes, in later updates @Ynoita Yes! @STAMSITEs Vi ska försöka få till så sensorer aktiveras av potatisar. Men kanske blir i en senare uppdatering :) @kan_gaming Yes, we will fix that @ScrapManYT Thanks for the feedback! We are working on some of these fixes now. \nWhat do you mean with Multiplayer \"wobble\" @LeBogooo Did you expect the boxes to break? We will add damage to them as well. Hi Mechanics!\nThe spud gun and more is up on the test branch\nCheck it out!\nhttps://t.co/NeOl2pMKQF https://t.co/Amvs0LUPDd @DSLModem1 The test should be up today :) @teeson10 Yes! with right mouse button @ScrapFan27 It's cardboard @Plzbanme Yes, and we will keep improving it during the test period Hi Mechanics!\nGetting closer to the spud gun update.\nWe should have a test up early next week.\nIn the meantime, here is some potato destruction! https://t.co/TCYUqSbY9n @ScrapFan27 @speediplayz_G @alven_gamers @Khi49963988 We might have a spud gun test this week or early next week. \nWe are aiming for that now. @Khi49963988 Yes! @Reece_riles Yes! there will be a test @SammyTheTwiter Thanks! The Spud gun update is coming next month! @CloroxBleach5 Oh yes! but we will introduce that a bit later @makseke23 That's the mountable spud gun @Dart_Frog_YT Yes! @HyperLemonPL @kan_gaming Not yet! :) @kan_gaming Both are in the same update. Also multiplayer improvements and a lot of new animations. @tabure7 They will activate buttons and switches if you shoot them. Sensors need more work and might not make it in time for the update. We will do our best. @Plzbanme @Gnorshk In Creative it’s fine where we have unlimited ammo, but doing that in Survival will cost a lot of potatoes :) @Plzbanme @Gnorshk Yes! They have kickback now @Plzbanme @Gnorshk There will be, but not with a normal potato. That's a later update. @Plzbanme @Gnorshk The glass and cardboard blocks are one hit with the spud gun @Gnorshk There will be ways of destroying harder blocks. But not with a potato. @Denuandor Hi! It’s always a balance of working on survival, new fun updates and improvements on our end. But we will defiantly do more optimizations to make complex creations work better. @Friz64_ Yes! @Reece_riles Yes! Right mouse button will aim @Marcus_Otter Both are in the next update @Letsgo00HUN Next month! As soon as possible :) Hi Mechanics!\nThe spud gun can destroy two types of blocks. \nThe glass block and the new cardboard block. \nComing in the next update! https://t.co/gtKdT5phNL @Zoltcrusher Nope! thats not true. When we have the date we will make a proper announcement @Fatikis It's going great thanks! We are really excited to get this update out next month. It has the spud gun, but also some big improvments. @MoonboSM Thanks Moonbo! Looking in to this. @theogamer479 Thanks! ok, seems it's still happens in some cases. We will look in to it. @Asriel707 Thank you! @OcarinaOfCraft @AxolotGames Thanks for the suggestion! @theogamer479 This should be fixed now. Did you see this in a recently? @Zoltcrusher Spamming will get you muted. Please be nice @Zoltcrusher @KASP0 @AxolotGames Unfortunately, that’s not how it works. How much fun would you have with a working crafting bot, when trees can't be cut down yet for resources. It would be a waste of your time. We release features when we know they will be fun to play with. @Reece_riles Should be between end of april to middle of may. There will be more new things in that update, not only spud guns. @Zoltcrusher @KASP0 @AxolotGames Survival is not done yet. However we will release some new features from survival like the spudgun from time to time if we can make them fit in creative. Hi Mechanics!\nHere is a first look at the mounted spudgun! https://t.co/rbNtW3HHLT @Bobsecret5 @CrackGear @Zoltcrusher @Snaker_The_Law You can't die in creative mode when using spudguns. They just give you a pushback. However, healthbar will be in survival. @Plzbanme @Snaker_The_Law In survival, most blocks break with explosives. But the spudgun will only break a few. But we might change this later. @KaTooLi_Gaming Can you tell us more about the blue screen. \nIs that all you see after loading a world? @Gnorshk Yes, we plan to add that. But survival features are priority now @Snaker_The_Law Yes! For example the glas block will break when you shoot it with a spudgun. We are also working on new blocks that will break as well. @ponygirlz18 @MoonboSM Thanks! We are looking in to this now @Fatikis It's a cool idea. But it's hard to do that since all the parts we make have a specific place in the survival world. @MoonboSM How often do you get this? @ScrapFan27 Do you get this issue with non modded wheels as well? @Zoltcrusher It’s not like we don’t want to update the game. But it all needs to be done and implemented the right way so you will have great time with the update when it’s out. @kan_gaming @ScrapManYT We will try to get that in to the next update @BrentBatchYT @CocoaCoCi Thanks! @kan_gaming Thanks for the suggestion! @CookieGamer6538 It's a small update that makes it possible to add custom terrain assets to the Tile Editor. @CocoaCoCi We will free up some time for that also. Anything specific you have in mind regarding the Tile Editor? Hi Mechanics!\nUpdate 0.2.14 is here. We also have more news on the Spud guns! https://t.co/AhvpHPZooF https://t.co/u2yatu6iP4 @Fatikis Hi, More info here\nhttps://t.co/AhvpHPZooF @Zoltcrusher @MOBlox28 There is no point for us to let players play with a crafting system that is working. \nWhen trees can’t be cut down yet for resources. Features are dependent on each other. But we are working as fast as we can to get this stuff in your game. @Zoltcrusher @MOBlox28 Yes of course!\nBut we are not there yet. Still a lot of things that have to get done. @Zoltcrusher @MOBlox28 When we have enough new things to make a good devblog post @jeffwonderblast Watched! thanks Jeff we will see what we can do @kolya3500 We have no plans to add digging right now @Zoltcrusher @MOBlox28 Please read our devblog where we share the latest news on our progress. Unfortunately good games take time to make. @WouterDeBanaan A fix is on the way @MOBlox28 We want to do it, but right now our focus is on getting Survival mode in the game. @MJM_Builds We will try to have it in the final update release if we don't encounter any problems @STAMSITEs Hej! Vi ska titta vad vi kan göra åt det. Den skulle behöva fler lägen. Tack Marcus! @Magwol0807 We might add that for Survival. But how would you use that in Creative mode? @MJM_Builds Thats awesome MJM! @jmere36 Thanks for sharing. We will look in to it @InsanePxl Sure, we will post more @Fatikis Hi Fatikis, Seems people want them in Creative mode. Our plan was to hold on to them for the Survival release but we are changing our minds. @UNFriteuse Yes! Hi Mechanics!\nDevblog 14 is finally here with the latest news from the Scrap Mechanic HQ!\nhttps://t.co/XUP8jzZwCv https://t.co/uEzuRkho9q @CookieGamer6538 Waiting for one last thing and we should have it up by tomorrow @Plzbanme No worries! the devblog should be up tomorrow @kan_gaming @ScrapManYT Hm, can you give more details? @theogamer479 Ok, we are working on mod support for terrain assets now. Should be up on the test this week. That might make things less buggy. Not sure what the problem is there. @theogamer479 Do you have these tiles on the workshop? @Plzbanme Hey! It should be up next week @kan_gaming @ScrapManYT We have a fix coming in the next update @ViMetzler Working on it! We will make a new devblog soon @rfortson222 Hmm, what graphics card are you using? @shinevisionSV @AxolotGames There where some players that had some issues with AMD graphic cards, so we put it up to run some tests. @Korwinmanzen The one we just did just fixes issues with AMD graphics cards @Draconic_CPU Can you change to the rendering test branch and see if you still have this issue there? @JensLetsPlay How did you solve it? @Fiete55548628 What is the email subject? @MoonboSM Let us look in to that for you! Can you email us the corrupted save file and the log from when it crashed. @jmere36 @AxolotGames Can you see if you still have this issue on our test branch. It's called \"rendering test\" @JensLetsPlay Can you see if you still have this issue on our test branch. Look for branch \"rendering test\" @Draconic_CPU Can you see if you still have this issue on our test branch. It's called \"rendering test\" @LordPain1010 @AxolotGames Thanks, looking in to it! @JensLetsPlay What graphics card are you using? @KrYoZombie @AxolotGames You are creating some amazing things with the tile editor :) @chauhansaimc Thanks! we are fixing this now @Fiete55548628 Can you email us with more info. It would be great to see the latest log file. @Fiete55548628 Did you place assets outside of the tile space? @0Timolan0 We got this issue reported from other players as well. We are checking what it could be @ScrapFan27 Ok, we will look in to that. Is any of your tiles on the workshop? @_clapos What graphics card are you using? @Thirty__Thr33 Yes, we will add that.\nA lot of mechanics have been asking for this. @SgtCuckoo Thanks, we will look in to that. But not anytime soon. Our focus is on fixes and survival mode atm @chauhansaimc @DerpyDurf We collected a lot of great feedback from him!\nWe just have to find a time slot to do some fixes.\nNext up will be multiplayer improvement. @KrYoZombie @AxolotGames That's awesome! @ScrapFan27 But you are not falling? It's just the sound? @0Timolan0 What graphics card are you using? @blueman444444 Thank you!\nWe still have a lot to do so it will only get better! @Fiete55548628 Thats interesting. Dose this happen all the time or just once for you? @ScrapFan27 We are looking in to that now @CookieGamer6538 Yes! We are actually working on tree cutting and other terrain interactions right now @LordPain1010 @AxolotGames Thanks, looking in to that @TheDoctorLink It was a bug, it's fixed now! Thanks @Engineeringenis What graphics card are you using? @CocoaCoCi We have noted all these pointers. Thanks the feedback! The tile builder will get a lot of improvements. RT @steam_games: Midweek Madness - Scrap Mechanic, 40% Off #MidweekMadness https://t.co/4GvLlmcc79 https://t.co/YfwcYYb0RR @ikeyzeroseven Ok, we will look in to it Hi Mechanics! \nGood news! The Tile Builder is finally here!\nCheck out our latest trailer and more here\nhttps://t.co/JDZhoqMR2S https://t.co/3TSVvYQ7AO @LordPain1010 Thanks, we just fixed the icon generator @ikeyzeroseven Did you suddenly just fall trough the ground? @alven_gamers @DerpyDurf Thank you! we got them @alven_gamers @DerpyDurf I can find logs in the games installation folder @alven_gamers @DerpyDurf Can you email us the log file after you do that? @alven_gamers @DerpyDurf Hmm, that's interesting. What happens when you save the tile exactly? @DerpyDurf Thanks for the great feedback! \nThe tile editor will get a lot of improvements. Textures is one of them.\nBy the way, we will bring back particles to modders. @j0hnbane Not yet, but we are looking in to that @DerpyDurf For sure! We are looking in to custom terrain asset support for the tile builder. @ScrapManYT Hi! We will add more features and improvements. \nThis is just the beginning. Great feedback! @0Timolan0 How did you trigger that? @LordPain1010 @AxolotGames Wow! That is a really cool way of using the rocks! Hi Mechanics!\nWe just added new race tracks to the tile builder on the test branch. Now you can make your own stunt tracks!\nhttps://t.co/xRViTCT81g https://t.co/Jg7yXSpHIQ Hi Mechanics!\nNew test is up with the tile builder! \nhttps://t.co/xRViTCT81g https://t.co/vwMBN6cMFo @Plzbanme The tile builder will most likely come up on the test branch today @LuapThegreat Hmm, our last update was the 3rd January @LuapThegreat Hi! When did you play Scrap Mechanic the last time? @shinevisionSV @AxolotGames You are correct! @MassUltraGaming Thanks for the suggestion. Its a fun idea! @BergvallB Yes! we can't wait to start working on that. But we have other things that need to get done first. @josephbrewer181 @8bitadc We will look in to that when survival mode is in the game @DSLModem1 Spud guns and survival is coming. It's just take more time. It will be worth the wait. @CocoaCoCi Thanks Cocoa!\n \n2018 will be a great year for Scrap Mechanic players! @Plzbanme Yes! everything is on track. Should come out end of this month. @Letsgo00HUN What was the subject name? @theogamer479 What mods did you use? @8bitadc Yes, we will start looking in to it when survival mode is in the game. @STAMSITEs Det är en bugg! Vi ska fixa den. Tack Marcus! @Reece_riles That is something we really want to add @Magwol0807 Team is back! more tweets coming @GavinWi46194224 @AxolotGames Oh! we have done something cool with that. Hope to share it soon! @kan_gaming Thanks Kan! We will look in to it @kjxcam Great idea! It can be done with the tile builder @Zoltcrusher We are still here! :) More devblogs coming. Hi Mechanics!\nHere is a little update on the awesome tile builder we are working on. It will allow mechanics to create and share tiles via Steam Workshop. We can't wait to release it! https://t.co/jBcyDiTWGm @Dart_Frog_YT We read all the bug reports that we get sent our way. But we get a lot of emails and tweets so it's hard to answer all of them sometimes unfortunately. We would also not block anyone. We appreciate all the feedback that we get. Hi Mechanics!\nThe world builder update is here! Build your own unique worlds. Check out the full update list\nhttps://t.co/DSNP9vq37g https://t.co/l2puTTAhBG @noahbeeri We are fixing this, thanks! @AshkerNms @ScrapMechanicFr That looks great! @ScrapFan27 Thanks Andy! @steam_steel Thanks! we will look in to it Hi Mechanics!\nNew test is up with the world builder. \nhttps://t.co/VCQvEXtq61 @LordPain1010 Yes, all the terrain props will be in the tile builder @RaedDeon We aim for later this month Hi Mechanics!\nHere is a early look at the world builder for placing tiles. \nWe are also working on the tile builder that will let you create your own terrain and share via Steam Workshop https://t.co/3YRN0It6gI @Plzbanme Hi! We still plan to have both the World Builder and the Tile Builder out this year. @blueman444444 Yes, we plan to add something like that in the future @ryryjoe @AxolotGames We will look in to that after survival mode is in the game @VulperionUrrr We agree! they will get updated before survival with some nicer sounds @moahgmnauns Yes, we plan to do a lot more improvements to that @ScrapManYT Yes! @Mateusz8017 Right now 33% on Steam Hi Mechanics!\nDevblog 13 is here! We have some exciting new things to share!\nhttps://t.co/UBIjIpBfUZ https://t.co/DKrn8PdzuC @GhostGamer_111 @YouNeedToSignIn https://t.co/UBIjIpBfUZ @YouNeedToSignIn Early next week @ikeyzeroseven What is the resolution on your screen? @ikeyzeroseven Hmm, since when do you have no sound? @theogamer479 Did you use any mods? @CookieGamer6538 You can always send us a email @CocoaCoCi What are you missing when it comes to the Paint Tool? @MoonboSM Happy to hear that Moonbo! Hi Mechanics!\nGood news! Update 0.2.11 is finally here.\nNew features, improvements and parts!\nhttps://t.co/WHB1NQAAHu https://t.co/jCp2YeMrPk @Plzbanme We are putting together a new devblog now with more info on that Hi Mechanics!\nNew test is up with some nice new improvements. Check it out! https://t.co/22pIer9sCH @ScrapFan27 Strange.. Did you try to update your graphics driver? @ScrapFan27 Hmm, did you send us a email with more info? @Chillie19924 Thats amazing! great idea :) @Plzbanme Mostly some useful improvements. The update will be out next Thursday or Friday. @therix591 Please feel free to email us your specs so we can take a look @GavinWi46194224 We took a little break from updates to work on survival. \nBut we have one in the works now. Maybe next week @leon250402 No, it's for survival mode Exploring the warehouse office floor for the first time!\nIt's under construction https://t.co/jegAaOHLFe @Plzbanme Don't worry :) We will show some things that we've been working on soon. \nPotato gun mechanics, new biome and so on. Exciting stuff. @Kampftroll1 A lot of things in the works right now. We will try to update soon with some new things @DarkkowardDFirs We will look in to it after survival mode is in the game @thegamerman88 We will add it @Creeperman1112 How would you like to have the menu scroll? @MANGamingYT Can you tell us more? @Plzbanme Things are going well. We should have some new stuff soon! @Damgaard85 No way, we are just busy with survival mode. We should have some new stuff to share soon :) @ikeyzeroseven It should work @kan_gaming Let us look in to it! Thanks @Zoltcrusher @Camodo_Gaming @MoonboSM As soon as we have something that will fit in creative mode. \nNow we are working on survival stuff only. @maxrapp03 Yes, for sure! We only work on Scrap Mechanic. \nRaft is not being developed by us. @MoonboSM @Camodo_Gaming Can you send us a save where this happened? @Camodo_Gaming @MoonboSM That's interesting. We didn't do any update @blueman444444 Oh yes! they are not so happy about all mechanics making music with their heads in creative mode. That will be clear :) Hi Mechanics!\nWe are getting some great feedback from you!\nSo here is a potato pistol our artists are working on https://t.co/ozbCUuLh0m @sauserkhone Upgradable with parts @ThePyroPsycho75 Building would work great, but driving some creations could make you really nauseous. We did some tests long ago. @hahahnamajeff We are working on a potato shotgun. We will share it with everyone soon! @ThePyroPsycho75 Yes, for sure @melvin_mikey We don't know yet. We keep adding and changing things still. We feel we need to let it take the time it takes to make it as good as possible @LemurEmu We will look in to it as soon as survival mode is done. @CookieGamer6538 Not sure we add that or wings first @toohappy101 Right, we wanted it to look like it's made out of scrap @kan_gaming Yes! @Plzbanme No, don't worry Seems 50% Yes! 50% No! so far @pcfreak9000 Yes! @Srg_Ozza As it is right now, they break @Srg_Ozza All blocks have durability in survival @Lauraw831 Say hi to him from us! You can buy it here https://t.co/jYmHSJlzqE @ScrapManYT We want to! Problem with ropes is that it will maybe not be possible to have collision on them. But we will try to find a good solution. @McDonaldsJunior Yeah, we had a feeling. That's why we are asking for opinions @Kampftroll1 Thank you! @Dimitri_De_Vos Not good? Should we not keep this design? :) Hi Mechanics!\nWe are working on a potato gatling gun right now.\nThis one is made out of fidget spinners!\nWhat do you think? https://t.co/eLriQXhSFs @thegamerman88 @Zoltcrusher It depends what you look forward to. But it's for sure something that opens up to a lot of new fun gameplay :) @omarhamad1999 We are still thinking how to implement it in a good way so it's easy to use. \nIf you mean for controlling vehicles with a lot of triggers. @Zoltcrusher Yep, it will be in survival :) @blueman444444 We might make the buttons and switches work that way also. @Zoltcrusher Right now we are busy with survival so we want to focus on that. \nBut we have some exciting updates coming before survival. @Zoltcrusher That is not true. When we know we will tell everyone @Plaf337 It's a fluorescent lamp @Insomnicron We might put it in creative mode. Hi Mechanics! \nToday we are doing some modular tests for the spud gun. \nHere is a potato sniper setup that the player might be able to build https://t.co/SuQIaf6ags @MCjasperMC Everything in the warehouse is made from blocks and parts and can be destroyed @WOFGH1 Everything inside the warehouse is made out of blocks and parts @AraragiSenju We will tell everyone as soon as we know :) @RealSteveboyYT Not yet @ThePyroPsycho75 If you tweet it to us we will see it @kan_gaming That's strange. Would love to hear more so we can try to find the problem. @CocoaCoCi Hi Cocoa! It will come out with survival Exploring the warehouse restroom for the first time! https://t.co/IR0b1nEoxa @leon250402 It fits the updated visuals we have in survival mode Hi Mechanics! We’re delighted to reveal that @AxolotGames will be publishing Raft! Check out the latest update here! https://t.co/KPIInrq5kp https://t.co/BiXJfpN4U7 RT @AxolotGames: We will make a big announcement tomorrow! We can’t wait to share it with all of you. Hi Mechanics! New devblog is up! We have some really exciting stuff to share!\nhttps://t.co/ndljhke5oO https://t.co/8aPpJbU0yX @arabbas747 Hi, what are your computer specs? @ShrinkPlays Thanks, looking in to it @Plzbanme Saturday it should be up @Kampftroll1 It will be up on Saturday Hi Mechanics!\nWhat could this be?\nFind out In devblog12 coming next week https://t.co/IAYfbe9zuD @AlexMihelcic This works for us, are you sure? @DerpyDurf Ok, this should be fixed in the latest test. @ikeyzeroseven Happy to hear that! @kan_gaming Thanks Kan, looking in to it @Plzbanme Devblog should be up next week! Hey Mechanics! \nNew test is up with some nice improvements.\nhttps://t.co/hpzJTYIvr1 @kan_gaming @BrentBatchYT This should be fixed now in the the new test branch\nhttps://t.co/hpzJTYIvr1 @danielofwarp Yes, for sure @thegamerman88 This can happen when there are a big amount of blocks/parts separated in a world. We will improve that even more. @LordPain1010 We will look in to it! thanks @Ido_Halamit No, we plan to make a lot of changes to it @LordPain1010 There should not be a limit. Can you send a screenshot? @kan_gaming @BrentBatchYT @KASP0 Yes! We are on it @GingerNation5 We will look in to that after survival mode is in the game @OfficialTheMrAJ It's coming soon. We wanted to wait for some stuff to include. Took longer the expected. @AlexMihelcic We might change that. We noticed a lot of mechanics want it to be off @kan_gaming It will be before. We hope to free up some time for that soon. @kan_gaming Yes, it's coming up @Mrq8t @AxolotGames @steam_games Yes! we will look in to that when survival mode is in the game @Plzbanme Hi! More optimisations so mechanics have less frame drops @APEX_studioz @AxolotGames Thanks for sharing! Looks great! @Camodo_Gaming Hi Camodo! Since when did it start to crash for you? \nAre you playing on the test branch? @HyperLemonPL Here you go! This is from 2012 :) https://t.co/sRt0OM7Gn7 @Chillie19924 Thanks for the suggestion @FrontYT This fix should be in the next update @_MzDanish Sure! We really want to add magnets but they are not high priority right now @Plaf337 We will look in to that after we added survival mode @QuackerJack123 We will try to free up some time for that @HyperLemonPL Yes, this is true :) But development started in 2012 @drtintercept Not yet. It's still being worked on @drtintercept Yes, we will explore these things more. But they are not our priority now. @MagikSword We should have new devblog up soon with more info @Stargaming626 It's something we will look in to after survival mode is in the game @IanGammer Feel free to send us a email @MoonboSM Thanks Moonbo! We will look in to that @friend_zonedguy What happens? Dose it crash on start? @Quati2003 More optimizations are coming @Paul19988 There is probably a lot of collision checking going on. Try to have the carriages more far from each other. @ivar666_Roblox It should update automatically when you log out and restart steam @lumilesff It's coming. We had to delay it a bit. Survival is our priority right now. @DeadWeight4U You can send us a email to info@axolotgames.se with your feedback @MCjasperMC Thanks for the suggestion! @MageFries It's not a beauty, but It helps us a lot to find issues. @simonjonnemeth @XesauMC Thanks for the feedback Simon @Gal_Horowitz We really want to add water. But we are still looking at the best way of adding it. @S43_Gaming Thanks for letting us know! @XaxionGaming Is that the duck from @DerpyDurf mod. Nice one! @Darkstar488x We might after we add survival mode @kan_gaming @YouTube That's amazing Kan! @kan_gaming Thanks for reporting that @vtl98 Can you link us one that is on the workshop and has this problem? @McDonaldsJunior Yes we are @MoonboSM @rEtRo_sPexX We hear you! we will see if it can be done @Paxon57 We still plan to add it. But we have a few other things that we need to do first. @j0hnbane Thanks for the suggestion! @firefr0st Yes! and also make your own tiles @matt4o3ew02 Thanks for the suggestion. We have reverted back to the original suspension now @ScrapFan27 Yes, that and survival. @haenen_martin Maybe, but not this year @AraragiSenju We are waiting for a few things to get done that we want to include. After that we will make a new one @manssimba As soon as we are happy with it. But it's a huge update and it needs more work. @PolskiDrzewolaz @AxolotGames How did you trigger this? Did you use any mod? @CamCassidy_love We hope to have more info in the next devblog @LordPain1010 Hi, we might change back. We are testing more optimized suspensions now. Would be interesting to hear why you like the old ones better. @vtl98 We just made a new patch that should fix that. Can you restart and make sure it's version 0,2,7 build 241 @vtl98 Hi! In what way do they not work? @Microstario55 @AxolotGames What are your specs? @failatusername Ok! Can you send a link to this creation on the workshop so we can look in to this for you? @omarhamad1999 Dose it help if you turn off dynamic lighting in the settings? @LilShuples Awesome! @lightrailtycoon Dose it help if you turn off dynamic lights in the settings? @DieselDesignsYT Let us know if it keeps happening and we will look in to it more.\nWe can't seem to trigger that crash here @maxtresh1 We are looking in to it @LikeMyDeathNote We have a bearing optimisation coming that should help a lot @i_guardsman Did you recently update your graphics card? @N8Flagg Hi, How did you trigger that? @lumilesff We are waiting for some stuff to get finished that we want to include in the next one. It's coming @JeromeVelge Did you recently update your graphics card? @lightrailtycoon Did you recently update your graphics card? @EinBurgbauer Thanks, not sure this is on our end but we will look in to it for sure! @matt4o3ew02 Did you email it to info@axolotgames.se? What date? @DieselDesignsYT Hmm, that should not happen. What did you place the block on? @TedGuijt No, that's a mod from the workshop :) @FenoworkTR That dose not look right, what are your computer specs? @Srg_Ozza There is a way to get it to open again.\nWe explain how to fix it in this post under \"Updated\" https://t.co/vNHCoZR2Lp Hope this helps @MasterFunk73 Yes! out today @Paul19988 Thanks for letting us know! Hi Mechanics! \nGood news! The piston is finally here. Check out our latest video!\nhttps://t.co/77Wvk5mAkJ https://t.co/TVyXq06TWP @FenoworkTR Are these creations on the workshop? We can try to take a look if you can link them to us. @daupaloffer Is this in the latest update we did? @Vinora21 We will tweak them! we agree @leon250402 We are fixing this now :) @Not_ITZ_Caleb The sound will get tweaked. Agree! @kan_gaming We will do our best! @Lord_Lima_Bean Yes, you can set the speed by pressing E on the Piston Hi Mechanics!\nHelp us test the piston!\nA early version is up on the test branch right now.\nhttps://t.co/UoBDtGy1yl https://t.co/qQRL1mrW1W @failatusername We will! @tml55yt Thanks for letting us know! @GhostGamer_111 We are working on survival right now. But we don't have a release date yet. There are still a lot of things we want to add to survival. @ScrapManYT Thanks, we will look in to it @FenoworkTR Strange, don't think we did any changes to that. @ScrapFan27 We hope so @Paxon57 Thanks! this is on our to-do list @ImaFlyNmidget You should be able to select them when you start a new world. Can you see anything in the mods window? @CamCassidy_love The pistons are not on the test branch yet. They will be in the next update @KBGAddeSv We hope next week @NobodyTheThird It was improved in this update even more. It's in the update list. @CrackGear They are next up Hi Mechanics! \nUpdate 0.2.6 is finally out. Here is the full update list\nhttps://t.co/3YVUvtsix3 https://t.co/R2ZNlHWCcv @kalle_kallinski Thanks! that's a big compliment @d3dw0d @craft636 Yes for sure @GatesTemple @DeadKenny_ Not yet. Survival mode is in the works, but it takes time since we are basically making a new game. However, it will be worth the wait. @craft636 We would love to, but that will have to be after survival mode is done @KBGAddeSv No, but next week @DeadKenny_ We aim for end of this month if nothing goes wrong. Hope to have it up for testing next week. @iTzGamerReviews When did you email us? Do you remember what day? @ScrapManYT Thanks Scrap Man! @kalle_kallinski Hi Kalle, both are in the works :) @kalle_kallinski Are you playing on the test branch here? @kan_gaming Sure, email it to info@axolotgames.se @kan_gaming Hi kAN! We can't seem to trigger this? In what way do they break? @PlayWessel Ok thanks! @DwavernMechanic We want to do it, but it will not be this year unfortunatlly @ScrapManYT Thanks! We will investigate @ToastedMarcus Switching to Chinese takes a minute or two right now. \nIt's not optimized yet.\nAre the saves still in Chinese after restarting the game? @PlayWessel Do you have this creations on the workshop? We can take a look @Srg_Ozza We will look in to that.\nThanks! @harelTV We aim for this month if all goes well @ScrapManYT That's interesting, how large was that surface? @DaCokeMaster Thanks for reporting that. That button should take you to our steam store page https://t.co/jYmHSJlzqE @CocoaCoCi Thanks, we will look in to it! @iiDa7man Hi! Did you try to restart your computer? @iBallisticSquid Hi! Can you try the test branch that we just updated? We might have fixed that. Please let us know if you get the same crashes there. @DeadKenny_ Hi! We aim for this month Hi Mechanics!\nWe just uploaded a new test with some improvements. Check it out!\nhttps://t.co/oR2OhKpVuU @WillemHanhart Hi! All we can say right now is that it will not be this year unfortunatly @PlayWessel We might have a fix for this. It should be in the coming update @PlayWessel Did you weld parts together on this creation? @_Tiberius_k Yes, it will be added together with survival mode @Letsgo00HUN The aim is this month @CocoaCoCi The tricky part with the pistons is to make them have collision when they extend. We are trying to work that out. Not sure yet. @TheMothron It's very possible :) @KritikillHD Mechanics love to play with the suspension glitch. We don't want to take it away from them @SofaOfAdam Hi! Can you give us some details? @Paxon57 They are in the works. Hopefully soon Hi Mechanics!\nWe found this old sketch for the loading screen art. We never made the corn shoot popcorn when heated. But it was a fun idea! https://t.co/FFXZrhs6nK @realDrumi In the making right now @adamshady08 Where did you buy it? @ScrapFan27 Sorry, it didn't fit where it is in survival mode. Maybe someone will make a mod with the old one @DeadKenny_ I don't think we did any changes to the sound. Is it all the time? @TedGuijt @cybercyber100 Sorry, there is no Android version right now @Br4mm3n Hi! We have some improvements coming fairly soon. It's a little more work @MJM_Builds Ouch! We did not foresee that happening :) @MoonboSM Thanks Moonbo, we will look in to it @vtl98 They are in the making @Letsgo00HUN It's not more important. It's just less work to add a language Hi Mechanics! Update 0.2.5 is finally out! Here is the full update list\nhttps://t.co/TT1KSdjpES https://t.co/Va7AiJQoPs @Plzbanme Just some improvements. For example so there won't be two big tiles that are the same in a new world @MJM_Builds Hi MJM! We have started working on something similar @JulianGeppert Should be this week @Srg_Ozza We think the creative mode terrain has a good size. But the survival mode terrain is huge. @S43_Gaming Looks awesome S43 Gaming! @JoostJVisser We need to take a look at your specs to investigate it for you. Did you send them to us? @Srg_Ozza How much bigger would you like it to be? @TankBika Thanks for sharing! @JoostJVisser Hi, what was the email subject? @DeadKenny_ Next up are some needed fixes for the weld tool and then Pistons. They are coming! Hi Mechanics! \nHelp us test over 20 new creative mode terrain tiles!\nhttps://t.co/VCrNPvR22n https://t.co/mgIFx844rq @thegamerman88 @CocoaCoCi We know waiting is frustrating. But it will be worth the wait for sure @CocoaCoCi Sorry Cocoa, we decided to move it to next week so we could focus 100% on survival. But we should have the terrain update out soon. @thegamerman88 Its will be next week @Plzbanme Unfortunately we had to move it to next week. We had to focus on survival this week. @Plzbanme They are looking good @DeadKenny_ Yes, that will be added later @kan_gaming @CocoaCoCi @ScrapManYT We will just fix it so it works properly. The team has been busy with survival. We will free up some time soon for some improvements. @CocoaCoCi @ScrapManYT The weld tool needs some fixing. We will try to get some improvements in soon. Sorry for the wait guys @Plzbanme @CocoaCoCi They will not make it on time for the next update. But maybe the one after. We will do our best. @fOElEppE We agree! we will change the texture @CocoaCoCi If all goes well, next week @joshuavnkamp @AxolotGames Did it work 6 days ago? Our latest update was 13th April. @PolskiDrzewolaz We plan to release our terrain editor so everyone can make a terrain and share on the workshop with other mechanics. @leon250402 What are your specs? @miggyvp This screenshot is from our terrain editor. They will not be in the game :) @MoonboSM It's over 30 new tiles that will randomly mix with the old ones when you start a new world. Some of them are really big. Hi Mechanics!\nHere is one more sneak peek at the new creative mode terrain https://t.co/oAdPWZkOni @joshuavnkamp @AxolotGames Do you know when you started getting the black screen? @DaSausage_ Yes, we want to add controller support but it will not be soon. Survival mode is our priority now. @Galaxy1138 Feel free to email us your specs with a link to this tweet @DeadKenny_ Hi Kenny! They still need some polishing and testing. It's not days. @ShrinkPlays If we get a lot of requests to add it, then we might look in to it. But no plans for VR support now. @AlexMihelcic The next update is still in the making so not today. @MoonboSM Thanks Moonbo! We will check it out RT @steam_games: Midweek Madness - Scrap Mechanic, 33% Off #MidweekMadness https://t.co/8bRYAwRmuf https://t.co/otm4PrRmT2 @DasEtwas_ Still here, just busy with survival mode and other new things! @thegamerman88 Should be next up! Hi Mechanics!\nWe've been working on character costomization for survival mode. \nBut what outfits would you like to see in Scrap Mechanic? https://t.co/6AhFY9sHDI Hi Mechanics!\nWe just uploaded a new test with some improvements. \nCheck it out! https://t.co/MY0TN3UTS9 @ikeyzeroseven @ScrapManYT Thanks for the suggestion. Always great to hear what you would like us to add. @kan_gaming @MoonboSM Yes! You have a lot more control over the vehicle when driving @thegamerman88 Yes, we will do that @jacob_alzen If everything goes well, tomorrow. Hi Mechanics! \nWe did a improvement so cars will drive much smoother and don't jump around as much. Coming in the next patch! Hi Mechanics!\nWe are testing a new steel net block!\nDo you like it? https://t.co/wr8oHnIHu0 @sup3rbuman We are not sure if we will add it to creative. It could be a little annoying when you build things and it suddenly gets dark. @GabeTurner Hi Gabe! here is more info https://t.co/o86UyrihBC @kan_gaming Hi Kan, sure! email us at info@axolotgames.se and link this tweet Hi Mechanics!\nNew devblog is up! We have some new exciting stuff to share!\nhttps://t.co/ERbWp0OJoE https://t.co/HJiBZqPntR @Plzbanme Yes, tomorrow! @johwla Hi, hard to say. Need more info. Did you check if your computer follows the minimum requirements? @cocoacoci @moonbosm What mods did you use? @moonbosm Hmm, how did it happen exactly? Hi Mechanics!\nMod Update 0.2.3 is finally out!\nhttps://t.co/5fouwuUPQB https://t.co/BVaTI5osrk Hi Mechanics! Devblog 11 is coming next week with a lot of new exciting stuff. For example this amazing thing! https://t.co/dDeMm0OSC7 @tinmanaustin200 Maybe the mod was still downloading? @failatusername Sure, the plan is to add more possibilities to the mod support. Right now it's just blocks and parts. @CocoaCoCi Think we got it from your video, so thanks! @AlexMihelcic Next week @ScrapManYT Hi ScrapMan! Let us look in to that. Not sure @Lord_Lima_Bean It's on the todo list. But as you mention, strings would not have any collision. @97babycakes New devblog coming next week @mrsjlawrence Hard to say, we need more info. Can you send us your computer specs? @PolskiDrzewolaz Yes, we plan to release our terrain editor @PolskiDrzewolaz This is fixed now @CryingSquid Yes, it's something we want to look in to more. But we are still looking for a good way to add that. @ItsNeato125 Yes, we have something awesome in the works @Rachelhannan4 I suggest you email us your specs so we can take a look @xfoxx37 How would you use this in a creation? @mikeymike227 @AxolotGames Do you still have a problem starting the game? @WolfWraithGames Like a selfie? @ftw_boris In what way do they not work? @AlexMihelcic Nice catch Alex! @Ma_Bisho Yes, in survival mode @o_o__Mayo__o_o Happy to hear that, thanks! @J0ey1010 We are balancing both right now @TR1F1N1TY That can be the case. Send you your specs so we can take a look @Paul19988 We are looking in to that @AlfaNickGaming We will have some answers in the next devblog @CantStopRyan We plan to, but no release date yet @isaacclee003 This will get fixed. Thanks for reporting that @ScrapFan27 We might add more radios in the future @GavinWi46194224 Do you see a mod menu when you create a new world? @TheRobotPikachu Wow! that looks great @firefr0st Maybe! @ottovanzanten version 0.1.32 is still up. Not sure why you can't select it? @ikeyzeroseven @kan_gaming This is one of our biggest challenges. Optimizing collision is tricky. But we are taking the bull by the horns. @ikeyzeroseven It's because there is no mod support in 0.2.2 yet and you have used mods in that world when in test. So it has mods in it. Hi Mechanics!\nThe Scrap Mechanic Mod Tool is on the test branch. We also made some crazy mods that you can try out!\nhttps://t.co/LlecdnzSRb https://t.co/YbpFlYA8Mp Check out this awesome connect tool by @CdR_gamer https://t.co/azfl9hbhgc @Nikki_Rennardo Yes, its on the to-do list @GavinWi46194224 Do you get that when loading small creations also? @MCl0s We didn't do any updates recently so it could be the internet? @KBGAddeSv @Jacob_Gharib It's coming this week @ScrapFan27 @AlexMihelcic Sorry, had to move it to make sure it works better. Expect it this week. @ColeMar42916833 Can you send us your specs so we can investigate it for you? @alex_tittley Thanks for the suggestion Alexandre @RonnyDarkTeam Sorry, been really busy with survival and the upcoming mod support @AraragiSenju This week, yes! @CdR_gamer This might be the first Scrap Mechanic cosplay we've seen. Love it @TheViemo We didn't do any updates. When did this start? @CdR_gamer This is awesome! @KrowkaPl Yes! @thegamerman88 Coming this week @Phoenixleonova Thanks for sharing @TR1F1N1TY Coming soon! @samsamm That's not good. What did you build? @MoonboSM We will try. The limit is bad for flying creations @Shai302Shai Yes, it's a bit to squeaky now @OfficialTheMrAJ Thanks! Survival will be great. We are not cutting corners. Taking our time making something special. @drtintercept When we think it's great. No release date yet. But we are doing good progress. @Lord_lima_bean If we get a lot of requests the we might look in to it. @Q1Studios It will come with survival mode @BasileHamann Yes, the survival map is huge @Jacob_Gharib Not yet! but the things that will be in the next one will be awesome. @augustheeboll We want to do something like that. It's however not in the works yet. @DeadKenny_ When survival comes out @vincius0000 That thing would knockout a farmbot for sure @sirLeonJellyfis If you mean blueprint then most likely yes, but you will need to have the resources @alextennis2000 Interesting suggestions! @Lord_lima_bean Mmm, Maybe @augustheeboll What would you do in space without planets? @TankBika Right! It leans that way. @sup3rbuman @AxolotGames We are still here! But it has been busy with all the new awesome things we've been working on @AlexMihelcic Next update is the official mod support. Should come out next week. @Taughnex Not yet. We are doing a lot of changes back and forth as we work on Survival. We also want to keep things a surprise for now. @TankBika Cogwheels are tricky if they are based on physics. It could easily get very heavy. But we will explore it more. @thegamerman88 Both will have it when survival comes out. Yes! @kan_gaming We hope someone will make a mod like that in the future @Lord_lima_bean This is true, we had a very small team for a long time. @ikeyzeroseven For sure, we will improve this @DieselDesignsMC That’s exactly what we aim for. Giving creations more purpose in survival mode. @Q1Studios We can say that there will be no hunger or thirst. @4L3ST3R Players are having good fun with it so we have no plans to patch it. @CocoaCoCi Thanks Cocoa, we will look in to it! @4L3ST3R Yes, we would like to do that. But that will have to be a bit later. @CharliePNDA To early to say. We will let everyone know when we know for sure! @The_Cookiesteve How would you use it? :) @Lord_lima_bean No plans to add more, but we hope modders will do that when that will be possible. @AlphaChap Thanks for your suggestion! @benjaminbatty76 Sorry, not yet. But we are doing good progress working on a lot of new content for it. @callum5347 Hi, it's Ctrl when you are seated @kan_gaming The plan is to release it with survival mode later. Would you find it useful in creative mode? @_clapos If there are to many moving parts close to each other the game has to do a lot of collision checks and that can get heavy. @ottonlyt It's up, not sure why you can't select it? You have to select the beta you like to opt into from the properties menu @BrentBatchYT Brilliant! Nice one Brent @chelondo Thanks Chelo! @_clapos Dose it have a lot of bearings with moving parts close to each other? @Lord_lima_bean It's in our to-do list @ScrapFan27 We hope around the 17th @GamingSkill_YT Dose it have a lot of moving parts? @Lord_lima_bean Like a flight cam? We might add it if we get a lot of requests @miggyvp Do you still have this issue after restarting steam? Hi Mechanics!\nUpdate 0.2.2 is finally out!\nHere is the full update list\nhttps://t.co/LcTDIvDf76 https://t.co/1OMs767hAf @jeanpau29154646 Unfortunately not. But we will let everyone know as soon as we know. @moonbosm @alysonnicole97 @camodo_gaming We will investigate it. Thanks guys! @camodo_gaming @alysonnicole97 @moonbosm Do you have this issue in the test version also? @jeanpau29154646 We plan on doing it but we don't know when @scrapfan27 We want to make the flat world loop instead @scrapfan27 @scrapmanyt Ctrl will toggle camera when seated. We are adding it. @scrapmanyt We agree, we will add this Hi Mechanics! \nGood news! Our upcoming update is now live on the test branch. Help us test it!\nhttps://t.co/trjLxFyxdw @casdieast So you didn't get help from them? @paxon57 @kan_gaming It’s a also a balancing issue with survival mode.\nBut we will look in to it. @joshmahto Thanks! Yes, we plan to keep improving the visuals step by step @ikeyzeroseven Thanks for letting us know. What sound is it that you hear? @drbocca Yes, but we don't have a release date yet @craftedfilms_yt Yes, the camera follows in first person as well @super_sunny_6 We don't know yet. But it's something that we will do. @casdieast Guessing you got the game via Humble Bundle? Please contact their support and they will help you out. @cdr_gamer It has a delay now. Let us know what you think when you try it out. @kan_gaming @vtl98 No plans for that now. Would you like them to have a longer range? @d3dw0d That is a pretty extreme example. But you can turn it off. @vtl98 You can turn it off in the settings Hi Mechanics!\nA lot of you have requested a follow cam, so we are adding it. \nWorks great! https://t.co/zzXyyhZzwg @Block_Digger This week if all goes well @vincius0000 Yes we are @AlexMihelcic It works in game. Not on the main menu. @SHuddart You can't enter the world again? @ScrapFan27 We have a fun update this week if all goes well with some new stuff @ikeyzeroseven This is on our to-do list. Should optimize this soon @leon250402 @AxolotGames All blocks will get corners, we are working on a new system @ScrapManYT Thank you @ScrapManYT !! @Lord_lima_bean Thanks for the suggestions. We love to hear them @vincius0000 A lot of the features that are in the game now where suggested by the community @heyjude1971 @AlexMihelcic Happy to hear that. However it will be awesome when your creations will have a real purpose in survival. @Tylermlacey Thanks, looking in to it @Plzbanme Not yet, but hopefully soon Hi Mechanics!\nHere is a sneak peek at the new thruster fire we are working on that also triggers dust on the ground https://t.co/XJmyc6bE5D @thegamerman88 Thank you! That’s right. Was aiming to have a fun update today but survival is taking up all of our time now unfortunately. @hezlitfr We where planing to release a fun little update today. \nbut unfortunately we won’t make it on time today so it will be next week. @alexmihelcic Yes, we are doing a lot of work on survival mode. But a update is coming soon. @kan_gaming Great, thanks! @leon250402 @axolotgames Not yet :) @kan_gaming Sure, is it a large creation? @cocoacoci @quackerjack123 Good suggestion! We will look in to it. @jdevingo21 Hi, guessing you got the game from Humble. This is how you do it. https://t.co/q7sGld44Qa @joao_0213 Hi! it's our own engine @ikeyzeroseven Yes, right now its 256 lamps @mojangy300 Sure, can you send us your specs so we can take a look? @lumilesff Next week! @potato_king98 It’s actually the ground that is the main problem. We will fix that soon @ronnydarkteam Looks great! @joao_0213 We are looking in to that @scrapmanyt Thanks for letting us know @craftedfilms_yt Yes! when survival comes out @iulian99211834 No such plans right now @scrapfan27 The main menu will get completely remade for Survival. We are working on something really fun. @kan_gaming Not yet, but multiplayer improvements are coming @lumilesff Not yet, sorry @alstrakbg Very flattering to hear that. Thank you! :) @ToxicHumor That's not good.. We are not sure what could have made it disappear? Is it still gone? @ChemicalColin Did you use mods? @CrackGear Not sure yet. It means that the light needs to collision check and that can be expensive. @Camodo_Gaming @kan_gaming Yes! we will look in to it more @lumilesff Thanks for the suggestion! @Lord_lima_bean No such plans right now. What would you build with that? @jenjen1936 We hope so! @Dimitri_De_Vos That is something we will look in to more for sure @Bazzarinio They are random when you create a new world @igxxerbest Pistons are coming! @lior_hassin Yes! @CheetahSoccer1 We hope so! @zOmbie1919nl How did you trigger this? @DavidSL448n Yes! we want to do that @Incredi_Stache Do you still have this issue? @p_t_k_97 Hi, is the game still not starting for you? @thegamerman88 Thanks for sharing! We will take a look @vincius0000 That's a awesome truck! nice one! @krohmkoala Yes, should be in the next update or the one after @ufarlie Hi, you can play with your friends right now. Just join or invite them from your steam friend list @helliethecharty The work on survival is going very well. Day and night cycle will most likely be added before survival. @thegamerman88 Yes, we will add day and night cycle later @mrscrapy1 Dose the game crash right away? @scrapmanyt Hmm, we are not sure why that is happening in your game. We will keep investigating @camodo_gaming Can you send the worlds to us? info@axolotgames.se @camodo_gaming Did you use mods in them? @kan_gaming Thanks! we will look in to it Hi Mechanics! \nOur big winter update is finally out!\nHere is the full update list https://t.co/AXg2OXWKDd https://t.co/PcZ9u2gM9k Hi Mechanics!\nGood news! A lot of new exciting things are on the test branch now.\nHelp us test it!\nhttps://t.co/YKBHB4Vx3m @robhero19999 No code needed @robhero19999 What graphics card do you have? @alphachap Early next week if nothing goes wrong @robhero19999 Dose it still crash when you change to our test branch?\nhttps://t.co/YKBHB4Vx3m @thegamerman88 Nothing to worry about. Update coming soon @scrapmanyt New update coming soon @koko11133 Official mod support will be added early next year. It's on top of our to do list. @brentbatchyt That’s awesome! Pistons are coming. We just want to hold on to them a bit longer. \nGive them some extra features. @vincius0000 We will do more fps improvements early next year. Still a lot we can do @scrapfan27 This might be fixed in the coming update @blitzcube You turn them on and off with switches and other triggers. You change the color with the paint tool. This might change @svenj2003 Day and night will be added later @dowzer72 Please send us a report with your computer specs to info@axolotgames.se and we will investigate @fittlebob Hi, did you try changing to our test branch? Dose it still not work? @thegamerman88 The lights will be added this month @Da7manPlays both! Hi Mechanics!\nWe forgot to mention in the latest devblog that we're now also working on dynamic lights! https://t.co/FzybVwRDLF @bastianogandy Strange, we didn't do something that should lower the fps. Are you sure? @vtl98 Hi! Suspension settings will most likely be numberless bars @realytfusion Sure, the best is to email us at info@axolotgames.se and include your computer specs and a crash report @galacticdimond What was in the email subject? @bobbyhill781 Did you try to change to our test branch and see if it works there? https://t.co/7GrqfikCwN @thegamerman88 That will be fixed soon @thegamerman88 The glass blocks where fixed. Not the windows. They are up next @crackgear Still working on that @Chillie19924 This is on the test branch right? Hi Mechanics!\nWe just updated the new engine on the test branch. Workshop and blueprints are now working.  https://t.co/YKBHB4Vx3m @pistonpat_ Thanks for letting us know! Do you have a screenshot of that? @astrax22 Wow! thanks! :) @crackgear Interesting, are you on the test branch or main? @vtl98 We will! We have some interactive parts cooking now @kan_gaming Most will be added after the engine update comes out on the main branch. @luislee17 Not yet, hopefully soon @bastianogandy We are aiming for that! @theviemo Both are not working on the test branch right now. But will soon. Hi Mechanics! In case you missed it,\nhere is devblog 10 with the latest news!\nhttps://t.co/NZ96OIVFw8 https://t.co/hPo9EftJIb Hi Mechanics!  \nNew devblog is up! As always, we have some cool new stuff to share!\nhttps://t.co/NZ96OIVFw8 https://t.co/EYObygIspZ @thegamerman88 It will be added soon, it's just not on the top of the list yet @scrapmanyt Thanks! @nickwj13 We are looking in to it but no release date yet @thegamerman88 Thanks, that will be fixed @scrapmanyt Would be interesting to see your computer specs @kan_gaming Very cool! @vtl98 Maybe next week @WegPast Do you mean the blueprint menu? It's not added to the test yet. @vincius0000 It's on our to do list @Block_Digger Yes! his face was glitching out when seated. It did not happen to the female. Hey Mechanics!\nWe just updated our game engine on the test branch with some new improvements and fixes! https://t.co/YKBHB4Vx3m @xisumavoid We are doing good progress. But no release date yet Hi Mechanics!\nDevblog 10 is coming next week with a lot of new exciting stuff.\n For example this strange device! https://t.co/hhtfOsIXQW @hotwheels37_yt More info here https://t.co/7GrqfiCdol @anfobe2010 Did you check if you have this problem when you switch to the test version? @anfobe2010 Thanks, we will look in to it @hotwheels37_yt You can already access it on the test branch. It’s work in progress however @anfobe2010 What graphics card do you use? @anfobe2010 That dose not look right. Are you playing on the test branch? @kan_gaming Thanks Kan, a lot more improvements are on the way. @scrapmanyt Hi, do you get this every time? @markivanhercegn It's a bug in the test. It will be fixed soon. @hareltv The glass is not fixed yet on the test branch @voxelloop Thanks for sharing! @thegamerman88 Is this in the test branch? @thegamerman88 Very often @leon250402 Bothe the glass and the workshop are not yet working in the test branch. But they will soon. @scrapmanyt Did you always have this issue on the test branch or is this new? @ma_bisho Great to hear that! @vtl98 We will in the next devblog @_dimij_ It’s in development Hi Mechanics!\nWe just updated our game engine on the test branch with some new fixes!\nhttps://t.co/YKBHB4Vx3m @camodo_gaming @kan_gaming @moonbosm Guessing they are playing on the test branch? Blueprints don't work on the test branch yet. @foulawer Thanks for sharing that with us! @jellyremake Its a big update to our engine. Workshop is not working in the test branch yet. @jeromevelge You mean outside of the test branch? As soon as possible @guillaume_du83 This will be fixed @biosidede thanks for sharing! @thegamerman88 what was the subject? @alstrakbg New fix is up! Should work now @alstrakbg Yeah, we know what it is now. Try again tomorrow. Should work. @kan_gaming Thanks, we think we know what it is now. Should be a quick fix. Will be up tomorrow. @cocoacoci @scrapchanic It's up! try it now https://t.co/YKBHB4Vx3m @jordanwunsche @scrapfan27 We will update the test brach again today with new fixes. \nPlease let us know if it works when it's up. @scrapchanic @cocoacoci Yes we did. Big thanks for that guys @alphachap Hi, there is a good reason for that. We explain that here: https://t.co/7GrqfiCdol @scrapfan27 Yes, that one is new. Another nice detail is that the paint tool now shows the selected colour on the tool itself. @scrapchanic @cocoacoci Please do. It will only help us solve these issues faster @cocoacoci can you email us your specs to info@axolotgames.se and link this tweet? @shinevisionsv We found a crash related to loading the terrain in the main menu. \nThat might be the problem here. Working on a fix @supermcstar The glass is one of the thing that's still not working correctly in the test branch. @christianliwo @cocoacoci There is a crash now related to loading the terrain in the main menu. \nThat might be the problem here. @benjaminbatty76 Thanks, that will be fixed @cocoacoci @kan_gaming @stevemakerspace Did you restart Steam and made sure the test branch was updated? @hareltv The workshop dose not work on the test branch yet. @kan_gaming @cocoacoci @stevemakerspace We just updated the test branch. It should work now if you have Windows 7 @stevemakerspace Dose it crash when you start the test version? @hampandampan @mjm_builds Hi, check our news post on Steam. There are some features that are not added to the test branch yet. @stevemakerspace Hi, are you on Windows 7? @alstrakbg Ok! We will update the test again today. It should fix it for you. @alstrakbg Are you using Windows 7? @alstrakbg Thanks! dose it crash as soon as you start it? @chickenguy5 Did you change to the test branch? @crackgear Thanks! but keep in mind it's just a first test. @cocoacoci Still working. Found some game breaking bugs @thegamerman88 We are still working on it @felixmanuel251 In a few hours. It will be up on a test branch at first. @robi_1_ Mainly if you couldn't play the game because of crashes or couldn't see some textures then it will be a big difference. @da7manplays @axolotgames No, its not related. Today is just a test version of the new engine. @incognito_54 Thought you meant the engine update at first. That is out tomorrow as a test. Survival is not this year. @hempa2 Sorry, it was a miss read. The engine update is coming tomorrow. Thanks @derpydurf We are looking in to that @kampftroll1 It's later @camodo_gaming Great! Keep in mind that it will be a test at first. @crazychr1s Tomorrow and it will be on a test branch at first. @mjm_builds Mod support is a bit later. Tomorrow we will be testing the engine update mainly. @guillaume_du83 The engine work kept us busy. We will go back to more frequent updates soon @lewis3370 We still plan to have it up on a test branch tomorrow @jymyzz What was the email subject? @moddingear It will be on the test branch on the 31st this month @thehelpfulhelpe No plans for that right now. But that might change in the future. @paxon57 It's a great idea. It's on our to-do list @zeethertx That's not normal. Thanks for sharing it. @jymyzz info@axolotgames.se @stathiprud_baco It will be up on the test branch around the 31st Oct @jymyzz That's not good. Hopefully the new engine update will fix it. Did you email us your specs? @ottonlyt Yes, it will be up on the test branch on the 31st. But we will keep adding stuff to it after that. @thegamerman88 We plan to have it up on the test branch on the 31st. @retro_spexx @hempa2 @stevemakerspace We will add it @capnstef Not yet but it makes it easier for us to add it later. @alstrakbg Not yet, but we might do it in the future @hempa2 Do you mean dynamic lights? @moon_lord2000 Yes we will. Its on our to-do list @97babycakes Its going great, expect it later this month @camodo_gaming @scrapmanyt Can't think of something that we did lately that could cause this. But we will look in to it. @SifAlexander Yes to both! @kan_gaming So it even has a frame drop when they are in the air? Cool creation by the way. @kan_gaming Hi Kan, do you have a workshop link? Hi Mechanics!\nHere is a little update on the engine progress.\nhttps://t.co/VYnQFPrUyv @nedman001 @phoenixjenny What graphics card do you have? @brentbatchyt @alstrakbg Thanks! That needs to be fixed @alstrakbg That's a new one. How many did you place? @benjaminbatty76 Yes, that is on our to-do list. @thegamerman88 We are doing our best to get it out as soon as possible. It will be worth the wait. @camodo_gaming Hi Camodo, the engine update still needs more work. As soon as it's done we will get back to more frequent updates. @techedupteacher Steam is unfortunately the only way right now. @zeethertx Thanks! @zeethertx Do you have a screenshot? @powerpreston101 @techedupteacher Yes, as soon as we get more time for that. @ottonlyt Thanks! we added him @techedupteacher A few teachers have contacted us but we don't know if some of them ended up using the game in their school @scrapmanyt hmm.. If you upload it to the workshop. Please send us a link and we will take a look. @ScrapManYT Could it be that the loop is to fast so it dose not get the chance to trigger a sound? @kan_gaming Can you send us a link again? @ahmedps4gamer Yes @scrapmanyt Are they connected to sensors? @dieseldesignsmc Can you email us the world save to info@axolotgames.se and include the mods you are using? @DieselDesignsMC What happens when you try to load it? Dose it crash? Hi Mechanics!\nWe found more awesome creations on the Scrap Mechanic Workshop!\nCheck them out\nhttps://t.co/yIAxsJbNRz https://t.co/6j1KuayWZn @AlstrakBG This or next, depends if we need to polish it more. We will start testing parts of it on the test branch first. @97babycakes Our focus is on the new game engine now. So we might have to move any other update for later. @thegamerman88 Next update will be us mainly testing parts of the new engine on the test branch. But we have more cool updates coming later! @colonelferzak Hi, Scrap Mechanic is a PC only game right now. There is no Xbox version yet. @Th3DRep Maybe, not set in stone yet. @RogalskiAdrien We will look in to that later for sure. It can get pretty messy on complex creations. @TobyTheGam3rYT Please email us the laptop specs to info@axolotgames.se and we will take a look. @Latepatelate There is a lot of optimization left for us to do, so don't worry. We are on it. @Hedsma They will be added but not in the same update. @erren_mendirez We currently have a issue with that graphics card. A fix should be up within two weeks. @BlueFireBR_GMR Yup! they are done @justforjunk2022 Please send us a email to info@axolotgames.se with more details and we will try to help you out. @robsonben Hey, we don't have a release date for that yet. When we know we will let everyone know. @chickenguy5 It will be added @erren_mendirez What graphics card do you use? @erjohnson85 Hi, please send us a report and your computer specs to info@axolotgames.se and we will look in to it for you. @scrapmanyt Do you have a world save with this issue that you can send us? We would like to see if we can repeat this @mjm_builds That's awesome guys! Keep it up and let us know if you have any mod support requests that you like to see added. @thegamerman88 Yes, they should Hey Mechanics! Time for another fun little update!\nNew parts and Totebot Head sounds!\nhttps://t.co/zy4XjwM2ml https://t.co/cZ4g8eQtKC @JPO_D You can also read it here https://t.co/YHZXMc0noI @shinevisionsv That is being worked on as well. More news on that at a later stage. @ScrapMech Can you send us that world save with info to info@axolotgames.se Hi Mechanics! \nNew devblog is finally up with some exciting news!\nhttps://t.co/fYCgjttDhF https://t.co/HFPEsQmzTb @thegamerman88 Always both @xesaumc Are you sure? @brozzillatv Can you send us a workshop link so we can take a look? @chillkroetentv_ Where dose it crash? Main menu or before that? @zombie1919nl Can you repeat it? Or did that happen once? @poison0dragon Ok, we have a problem with that one. We are working on a fix that should be up this month. Sorry to keep you waiting. @poison0dragon What graphics card do you use? @krohmkoala You can always send us a email at info@axolotgames.se @oscars_mummy Hi, please send us a email with your computer specs to info@axolotgames.se and we will do our best to help you out. @yastrebov_tales Should be up this month. Not much left to fix. @dieseldesignsmc Hi Diesel, no update this weekend. We are still busy working on our game engine. Hi Mechanics!\nNew devblog coming next week with a lot of new things!\n\nHere is a sneak peek https://t.co/IrxkN2UN92 @ottonlyt That's interesting, never seen that before. Thanks for sharing! @iheartkode Later in September. We are doing a lot of improvements. @_petercs_ Hi, we currently have a problem with that graphics card. We aim to have a fix up in September. Sorry to keep you waiting @_petercs_ What graphics card do you have? @kan_gaming It's on our to do list @mjaow1 Not this week. We are focusing on updating our game engine. Maybe next. @carlycollins30 If you are lucky you can catch it with the lift when it flies by maybe? Or build a flying machine and go on a rescue mission @thegamerman88 Not a exact date but we aim for middle of September. @djgreen2010 Hi, please send us a report to info@axolotgames.se with your computer specs and we will investigate it for you. @poes_kat We have a fix on the way. But make sure your graphics drivers are up to date. That can help @CocoaCoCi Do you have it on the workshop? @CocoaCoCi Ok, we will look in to it @miggyvp How did you trigger this? @T1mp4l1 We will check it out @lewis3370 Yes, that is one of the improvements @CocoaCoCi Hi, Can you explain what happen here? @agentkandrew Yes, it's in the update notes in our latest update. https://t.co/55uXxvSX6r @kan_gaming That's awesome! Thanks for sharing! @scrapmech Thanks for the suggestion! @zapawaf Sure, the best way to get support is on info@axolotgames.se @zapawaf Do you have a screenshot of your lift? It sounds like there is a lot of collision checks in that lift slowing it down. @andrewmassari What graphics card do you use @zapawaf @PokerfaceCactus We are happy to support but sometimes a tweet slips us by. Sorry about that. @zapawaf It should work. Where dose it crash exactly? You didn't have this issue before? @Scrap_ManMechan Hi, it should be done in September. Where dose the game crash when you play? @agentkandrew They should work correctly now compared to before. Thrusters should no longer apply its force twice at low framerates. @Esse_gamer We want to do that for sure. But it's not a priority at the moment @renofonzie Can you give us more details? @soccerstar99952 Hi! Steam or Humble Bundle @jonaseikrem Hi, How did you trigger it? @flamehd55 Hi, what graphics card do you have? @ottonlyt When the test is over you automatically move over to the main branch. You don't have to change it manually at that point. @ottonlyt It shows the length of a signal also now. In the test it was just showing you the delay time. @kan_gaming @scrapmech Ok, we will investigate @kan_gaming @scrapmech Can you hear the welding sound when you weld? @kan_gaming @scrapmech Are the particles on in the settings? @the_crewmc It seems like it happens to players with older graphics cards. We think we know what it is now. We can fix it but not quickly. @scrapmech Can't seem to repeat this. Is the creation you are welding on stuck to the ground? @netizen78 Good idea! @chickenguy5 It seems like it happens to some players with older graphics cards. We will investigate this. Hi Mechanics!\nLogic Gate and Timer are now added to Scrap Mechanic! \nHere is the update list https://t.co/55uXxvSX6r https://t.co/C1RD4JwNaT @markivanhercegn By the way, are your graphics drivers up to date? @markivanhercegn The new engine update should fix that. We will try to have it done asap. Sorry to keep you waiting. @scrap_manmechan Hi, What happens exactly? @subzerobr_gmr The UI needs to get adjusted first @cocoacoci @camodo_gaming Hi, We are looking in to that @kamkongmom Ok thanks. In that case you should contact Steam support: https://t.co/vmNyVlCjxF @subzerobr_gmr Hi, Yes we might increase it. The translations for the game are already done. @kamkongmom Hi, We need to know where he got the game before so we can direct you to the right costumer support. @kamkongmom Hi, where did you get the game? Steam or Humble Bundle? @aroperpaiciere They are smaller on logic gates. But we might have to scale them down a bit more @ottonlyt Yes that is new. But we are not sure we will keep it that way. Did you find any issues with it? @markivanhercegn Thanks, we will look in to it. @markivanhercegn That will be fixed with the new game engine we are working on. Should be up in September. @Plzbanme Oops! that is a mistake. Thanks Hi Mechanics!\nJust added the Logic Gate and Timer for testing!\nHere is how you try them out\nhttps://t.co/jlByWyw0xd https://t.co/SNHOAPeAW9 @t1mp4l1 Not yet but soon @plzbanme @ottonlyt Almost done :) @t1mp4l1 It's almost done. Hang in there @ottonlyt We are still aiming for today @pikavader We want to add it. The suspension needs more work in general. @02axed02 Like for trains? Is that what you mean @aroperpaiciere Hi, Thanks for the suggestion @the_crewmc @tomika8874 It looks like it's delayed one day @thesalemgamer Hi, please send us a report and your computer specs to info@axolotgames.se @tobythegam3ryt Hi, what graphics card do you have? @mariusmetois Hi, We are looking in to it but we don't have a release date yet @thegamerman88 Hopefully tomorrow! A new feature test @ottonlyt Hi, not sure what you mean with the welding? The beta branch are only for testing new features that will be added soon. @tomika8874 If everything goes well we should have the Logic Gate and Timer up for testing on Monday @garnec1997 Not yet, we will let everyone know when we know @lewisjgaming3 Yes, in the future @thegamerman88 Hi, not sure what you mean by stuck? @the_titanbreak How would you like it to sound? @crackelyy Thanks! We unfortunately have problems with this graphics card. We are currently working on a fix. @crackelyy That is not the graphics card @crackelyy Hi, what graphics card do you have? @lewisjgaming3 Yes @theorgnlErol_A We will do our best to make that happen @Paul19988 We will change the glass in the game to make it more clear soon. @Baz_Man_03 We are working on that now @Noah1234547 It should be out during August @tazzycarey123 Dose this always happen when you press E on the lift? @FirelabGaming Yes, it's up now Hi Mechanics! \nNew patch is up with some requested fixes! \nhttps://t.co/N5opbbv7z8 @matt4o3ew02 Early next month @mcl0s It's something we will change before the final release. @idiaxx This is related to the Intel issue we have. It will not be a problem once we update our game engine in August. @chickenguy5 This is a known issue. We will fix it. @Archiesam_1972 We need more info about your computer. What are your specs? @harelTV Not sure what it could be. What graphics card do you have? @Seifeld29991994 Hi, can you send your computer specs. It would help us find the problem @ido102003ItsMe It's the one that pops up when you put something on a bearing @97babycakes Beginning of next month. We are doing good progress on that. @rEtRo_sPexX No, it's a bug @heyjude1971 It's a bug in the test. It will not be in the hotbar @SurosVW That is a bug. We will fix it @AndyVel38399455 Yes @harelTV Hi, What computer specs do you have? Hi Mechanics!\nWe found some hidden gems in the Scrap Mechanic Workshop.\nhttps://t.co/RNQpKmDts4 https://t.co/2peg9MFOVt @scrapmech Hi, yes we are @andyvel38399455 Hi, Is that in the test branch? @reals7eel Thanks for sharing that! @ottonlyt Hi, do you have a screenshot showing what you can't weld together? @ottonlyt Thanks, it's strange! Needs to get fixed @ottonlyt Can you send us that world? @chillie19924 Great suggestion! thanks for sharing that @OttoNLYT It's impossible for us to check everything that get's uploaded unfortunately. @Chillie19924 Sorry, how can we help you? @ComradeHotDog Glad you're are having a good time with it. We're just getting started. @OttoNLYT We will look in to this after we deal with the lag and engine upgrade. Hang in there. @BulmerAshton They will not be in Survival mode @JymyZZ @AxolotGames We noticed that some players have this issue since the last update. Can you send us your specs? @SketterPlayZ Are you still having problems playing the game? @lumilesff @kan_gaming If all goes well then it should be done end of this month or beginning of August. @SketterPlayZ We do our best! Thanks @Hhectorborderas We will add aerodynamics, but not just yet. @justforjunk2021 Dose it crash when you place it down or when you press E on it? @kan_gaming When we update our engine we will look in to the fps issues. There is a lot we can do to improve it. @Thkubik7rs Thank you! The mod might have been the issue @OttoNLYT Thanks for letting us know. Dose the fps improve after some time or dose the fps stay the same in these worlds? @Thkubik7rs Hi, and you did not have this issue before? @Enzo_dus Yes, it will be added in Survival mode @AntonlarsAnton Hi, We need more info. Where did it crash exactly? What are your computer specs? @benjaminbatty76 Hi, are you still having the same issues with the latest update? @SketterPlayZ Where dose it crash exactly? When you load a world? @laser_03 Hi, that one is new. Do you hear any sounds when it's black? @two_10 Awesome! thanks for sharing! @AkitakeKun If you mean the Intel 520 and 320 issue then it should be up end of this month or close to that. Hi Mechanics\nSteam Workshop here!\nNow we really look forward to see your awesome creations!\nhttps://t.co/qt5gd88bKy https://t.co/AvcMln00wi @SmokeWheatMC Interesting! thanks for sharing that @SubZeroBR_GMR Hi, what is the mail subject name? @HMauriello What graphics card do you use? @matt4o3ew02 More bugs squashed Hi Mechanics!\nWe just updated the Workshop test beta.\nMore Workshop bugs have been dealt with! @hmauriello Thanks! and graphics spec please? @bradomail Hi, yes, we are doing good progress. Hopefully done by the end of this month. @hmauriello Hi, can you send us your computer specs so we can investigate? @tontonzob This is already fixed. Will not be a problem once we release workshop @oscarpaulsson02 As soon as possible. We are working on it right now @dustmine We will add that, but we don't have a set date for it. @dragan417 Some day this week @retro_spexx Thanks! Guessing you don't have a video of that? @gbeunier We don't have a date yet @ottonlyt It will be possible once we add more mod support @mcl0s We have noticed some players having this issue. A fix should be up later this month. @gsg900 Hi, We are working on a fix that should be up later this month. \nHere is more info about Steam refund https://t.co/o86UyrihBC @ottonlyt Can't seem to trigger it. What where you doing in the game before the force quit? @dieseldesignsmc Yes, we just have to find a good way of doing that. @n8flagg Thanks, looking in to this @sweski_diski That should not happen. If something falls trough the ground it should spawn back up. @gamingskill_yt We noticed some players having this problem. We will look in to it. @drpigi Thanks for the suggestion! @ottonlyt Thanks, we will check it out @DieselDesignsMC Hey! not yet. It’s tricky to do a system like that.\nBut it’s something we are looking in to. @Plzbanme A true minimalist @CocoaCoCi Thanks! we will look in to it Hi Mechanics! \nThe Scrap Mechanic Workshop beta is up! Help us test it out  https://t.co/0NBRxC7Ptb https://t.co/6VcVF7eI99 @krohmkoala Thanks we will get to it. @smokewheatmc Sure, contact us at info@axolotgames.se with a report and your specs so we can investigate. @guihayashida Hi, You are welcome to send us a email to info@axolotgames.se with more info. @cocoacoci We are working on this @smokewheatmc Strange, we didn't do any updates two days ago @theturtle04 Yes, we are looking in to it @ametueraspirant No, will you be the first? @subzerobr_gmr You are welcome to send us a email with more info @fmlotek1 We want to add it later in development @vikasahuja Scrap Mechanic is currently creative mode only with a survival mode in development. @vikasahuja You can play it single player @vikasahuja You need to be connected to the internet to play it for now. This is a temporary solution. @vikasahuja Hi, no age limit. But it can be a bit complicated for players that are below 10 @thkubik7rs We have noticed some mechanics complain about this. We will look in to it @ottonlyt Keep em coming, we note reported bugs down and put them on our to-do lists. @kampftroll1 Yes, some of them will get beta tested before release @yeoldmamayt @axolotgames That's awesome! Hey Mechanics! \nNew devblog is up! As always, we have some cool new stuff to share!\nhttps://t.co/3LSLEj8dqo https://t.co/qDDxKEWqY7 @mental_scars You can email us your world and we can take a look @glacier_nub What graphics card do you have? @crackgear They will both be added in the future @mental_scars Strange, can you open other worlds? @ottonlyt Hi! Sorry for the wait but this is far from ignored. Improvements are in the works. @krohmkoala sure, link us the video. Love to take a look @trickey445 We really want to add it @hellodaavey It will have in survival mode @pso2sleuth It's available now. Just invite your steam friends to your world @dany_chaddad It's delayed, we want to add one more thing to it before we post @gamingskill_yt Yes, we plan to add more sounds to the Totebot heads in the future Attention Mechanics! Scrap Mechanic is now on Steam Summer Sale! Now is a great time to pick it up https://t.co/sPPowFtgfh @AndyNelson07 How would you like to use magnets in the game? Hi Mechanics! New patch is up! \nhttps://t.co/ADUOwTXWLl @cocoacoci Aww, we got some stuff coming soon @mineslime2000 @axolotgames Yes that is correct @flyingfajitas Yes, it's on our to do list @thkubik7rs Yes, we have something in the works that will let you do that @dany_chaddad We will post a new devblog next week. A lot of cool stuff @pikavader can you send us that world? Happy to look in to it @taolegends What specs do you have? @soratheprogramm Strange, specs look good. It should work. @soratheprogramm What specs do you have? @soratheprogramm But you can start the game and get to the main menu? @taolegends That is interesting. Did you manage to trigger this every time? @alfanickgaming We always aim to make you Mechanics happy. Some of these will be added for sure in the future. @thegamerman88 We have a lot of improvements planned. That is one of them. @rosalietenseth That dose not sound normal. Is your fps low? @imboss_247 Thanks for the suggestion! @matt4o3ew02 This or next week. @sweethoneycake6 Hi, what are your computer specs? @yelloworanges41 A fix should be up in a few weeks. We know what the issue is. @caisamuels what was the subject name? @yelloworanges41 What graphics card do you have? @cr_crlewis1 We are working on survival but we don't have a release date yet @percipiengaming Steam seems to be a bit slow atm @brozzillatv That is not on our end unfortunately Hi Mechanics! \nThe multiplayer fix is up. We also added two new windshields. \nhttps://t.co/Z2kJiSo5R0 https://t.co/QhxS0PqVcZ @pokerfacecactus @axenil Yes, but not yet @97babycakes It will be tomorrow. @fr_maximilian Yes @ottonlyt Monday or Tuesday @pikavader @lumilesff It will be Monday or Tuesday @cocoacoci More info on that soon! @dragan417 Next week @charliecr565 We don't have a date yet @ottonlyt Thanks for that vid. We will check it out @scrapmech That's awesome! @pikavader @jordanwunsche Our guess is latest next monday @caisamuels Hi, send us a email with a report and your computer specs and we can take a look @mb_br Thanks for letting us know. We will fix this in the next update We have found the bug that makes saved worlds not work in multiplayer for some. It will be fixed in the next update. Hang in there Mechanics @axenil Yes, we will make that possible in the future @pikavader We will investigate that @xesaumc We will look in to it @gugegugegege Yes, the survival map will be different and much bigger @mrsuperepicman Hi, Send us a report with your computer specs to info@axolotgames.se and we can take a look @myshko2001 It should be, if the creation is on the lift when you weld them together. Hey Mechanics! \nThe Weld Tool is now in Scrap Mechanic. Check out the update here\nhttps://t.co/7bwOYrLBjL @brasholt Still dealing with some mini bugs @ma_bisho Still fixing some mini issues @bitter_canadian We will look in to it. But you can make suspension forks with the Weld Tool. @Ctop_24 Very soon @krohmkoala Yes Hi Mechanics! \nThe Weld Tool is coming soon! Check out the latest video!\nhttps://t.co/HpUukk2spM https://t.co/jzfAedG65K @plzbanme @xesaumc Should be up in one or two hours from now. @heuwie We have a terrain editor that we want to release at some point. @pinguping One or two hours is our guess. @yylarsyy We will add it @alstrakbg We are aiming for later today @xesaumc Yes, As long as you weld on the lift @sapioit Thanks for the suggestions Mechanic! @roastyatoast Yes we are @iballisticsquid Hey! you will be able to build new things that were not possible before like tank tracks, and suspension forks and more. @_furstgun_ Yes! You can do that Hi Mechanics!\nWe're excited to let you know that the Weld Tool is coming this week! https://t.co/6fwJi0SxKV @neebsofficial Great video! @mrphlyte We are looking in to it @fabianoratao Hi! It's a temporary solution as it is right now. We don't want it to be this way and we will change it. @blitzkriegsler That sucks.. Good news is that the Weld Tool is almost done. @pepexd555 We are working on that now. Hope to have it working in a few weeks from now. @ottonlyt Hi, yes we have to fix that. But it will not be in the next update. @cottinge Hi, Scrap Mechanic is PC only for now @raptorchh The next big update will be the Weld Tool @monkeygeek343 It's in the works right now and it's going great @caiotaquess We aim for weekly or bi weekly updates. @ottonlyt Is the thing on the bearing big and heavy? It could be that it's way to heavy maybe. Screenshot? @ilyashaldenko We will at a later stage @twisted_hbg Not today, but we might have something really cool next week instead @gamingskill_yt Sure, send the world to us and we can take a look for you. @dinneljackson We don't know yet. But we are looking in to it. @gamingskill_yt We are working on improving the fps @kan_gaming @nightrts @ytretweets Very cool! @ottonlyt Happy to say that not that many :) @handsomenidai Hi there! What happened? @davka003 Hi David, best is if you can email us your specs so we can investigate. info@axolotgames.se Hi Mechanics! New patch is up!\nThis time we added the new Driver’s saddle\n.\nhttps://t.co/nUW88G58Yx https://t.co/4tf88RfaIh @heuwie Yes! we have a update today @phoenixjenny We have to do a few big changes to our engine to make it work so our guess is in July @dupondtlouis Hi! Did you make sure your graphics drivers are up to date? Also what graphics card do you use? @dragan417 Not sure, how old are the saves that are empty? @ottonlyt Can't repeat this @ottonlyt Yes, Pressing space will eject you from the seat. Even if you press + W @chickenguy5 Go ahead. Happy to take a look @st3am_mach1n3 Yes for sure @skytheconqueror Interesting, never got that one reported before. @phoenixjenny This is the issue \"Intel HD Grapics 520\" we have problems with that one. We are working on a fix now. @kan_gaming You will be a happy mechanic soon :) @phoenixjenny Hi, happy to help out. Can you email us your specs? It would help us investigate. @one01cloud Hi, im guessing you are asking for a weld tool? That will be added to the game soon @krohmkoala Hi, we get a lot of emails, I'm sure we will get to it. Sorry to keep you waiting @chickenguy5 We will add mod support for sure @st3am_mach1n3 Dropping bearings? can you explain more @dudeanatergamin We are looking in to that @denismathieu4 We will do it but not very soon @dragan417 Later this week @bbk95196269 Hi! @timilybob We know what the issue is now and we are working on a fix for that. Unfortunately it might take a few weeks. @its_ze_meow Here it is: https://t.co/eOyh1Ay9gr @kampftroll1 There are a few exciting updates coming this month @its_ze_meow If it's requested by many mechanics then we will look in to it for sure @kampftroll1 Still here and we are not going anywhere :) @fabianoratao Yeah the engine can get a bit loud @natureanddraw Wow! that's awesome :) @denismathieu4 yes at some point @matt4o3ew02 @ottonlyt Yes, it got delayed. We will do some improvements next week. What is making it mainly unplayable for you? @matt4o3ew02 If we notice many mechanics requesting it we will look in to it. @thkubik7rs If you can't find your creation. Try using the connect tool and see if you can see the connection lines trough the terrain. @thkubik7rs You might have to build a new flying machine and go on a rescue mission. @mainframeyt No, It’s in our to do list. @mainframeyt I think it might be something on our end. We will look in to it. @mainframeyt Thanks for letting us know! We will investigate @thegamerman88 We aim for fridays but if we encounter issues we have to delay it. @zonken77 Yes! @ottonlyt Did you restart after that. Did that fix the issue?That is odd. Never got that reported before. @xpronix_sm_csgo hmm, interesting. Not sure what that could be if it was working before. Last update was last Friday. @xpronix_sm_csgo Dose it always do it? @97babycakes There can be one tomorrow if all goes well @shai302shai There might be one tomorrow @joshuajr90 Not today, maybe tomorrow @shai302shai Thanks! We aim to add water to the survival mode. The world will be a lot bigger. @bradomail We know what the problem is and we are working on a fix. Unfortunately it will take a few weeks. @muellermax1 Sorry, no plans for that right now @ottonlyt We force the hotbar to change now. Let us know if that helps after the next update. @ma_bisho Survival is being worked on. But we are not yet ready to talk about it. However it's going great @ma_bisho No @thegamerman88 Not this weekend, but it's not far away @ottonlyt use info@axolotgames.se @ottonlyt Great, that could help us @kronoszhun We might have something like that in the works :) @ottonlyt Still can't trigger the UI issue you reported. Im guessing you already email us your specs @kronoszhun For example? @jackernils Old? @sgticetea Yes we will @sgticetea @camodo_gaming Well the good news is that should be able to put it back together later this month @metaskyz Yes we do but we get a lot of emails and it can be hard to answer all. So don't hesitate to send the email again. @wastelanddustin Hi, yes, we own it. Please make sure to follow our EULA that you can find on our Steam store page. Thanks for asking! @draaxlp Hi, this is a temporary solution. We also don't want it to be this way. We will change it. @latepatelate A lot of players mention this so we might have to tweak it a bit more. @mrboomts Yes, we want to add it in the future. But not anytime soon. @ottonlyt Mandatory updates are necessary for us to get bugs reported and improve the game. This bug is in our to do list now. @inatyethe_ty Are your graphics drivers up to date? @termit093 Yes, for sure @biffnlol You can't stick two creations together just yet. Welding tool is in the works. @ottonlyt Think it's random. Still can't trigger it. But we will keep investigating. @steedi46 It's PC only right now @camodo_gaming Sure, link this tweet in the mail @soymassimo We will improve the reflection @camodo_gaming You are the first reporting this. We will have to investigate. Not sure what it could be atm. @camodo_gaming That's interesting. But it works when you start a new world? @derz4le We appreciate the feedback! No worries @derz4le It has a touch of blue in it actually. Might look very green against grass. But we will add more clear windows in the future. @myshko2001 Use the Paint Tool to change the color @henry_ftw1 Early next month @Inatyethe_Ty Please send us your specs and a report to info@axolotgames.se Hi Mechanics! New update!\nIt’s finally time for you to get your hands on the glass block\nhttps://t.co/HZnR3wYsuX https://t.co/yZLikilWOc @ottonlyt @matt4o3ew02 Can't seem to trigger it. What seat are you using? @matt4o3ew02 Do you remember what you did to trigger it that way? @dutchgamegroup Hi, it's hard to say without looking at your specs. You can send us a report to info@axolotgames.se @dragan417 Not yet, still some work left on it. But we are doing good progress @chickenguy5 We might add plastic. That will be lightweight @kan_gaming That's awesome and congrats on the subs! There is still a lot we can do to improve the fps and we will @gameforsz The welding tool is still in the works @dragan417 On Friday @thegamerman88 Depends on your connection. When Survival comes out the world will be a lot bigger @sihtegaming It's a great video! @plugpayplay Sure, you can email info@axolotgames.se @alysonnicole97 Yes, we will at a later stage @kronoszhun It's still in the making. @angryhermit Hey thanks! @dragan417 Found a bug that we had to deal with first @ottonlyt We will try to have a fix for it in this weeks update. Guessing Thursday or Friday. @joshuajr90 We had to push it forward a few days @hustonpetty Thanks, feel free to email us your suggestions to info@axolotgames.se @tawphyyt We don't know yet. We are looking in to it. @mama_code It's PC only right now @raptorchh Right now we work on the Welding Tool. Piston might be up next. @bmaster4114 That's awesome! @alysonnicole97 Players are having fun with it so we have no plans to remove it atm @huntershutt It's already in development @ottonlyt Feel free to send us your world save to info@axolotgames.se so we can test it out @poppadoola Hi, Send us a email to info@axolotgames.se and we will try to help you @admiral_t2a We usually update every friday @lewis3370 We will give you a hint. Glass @ethanm6102 Thank you! @raptorchh We work on a lot of things that have been requested. What would you like us to add the most? @ottonlyt Thanks! Should be a easy fix. We will look in to it @ottonlyt If you have a video we would love to take a look Hi Mechanics,\nThere will be no update today unfortunately.\n \nWe found some issues that we have to fix. \nHopefully early next week. @ottonlyt Did they go on and off even when something was in front? @st3am_mach1n3 We will look in to that! @chickenguy5 Thank you, we do our best for our mechanics @flyinggrandpa7 Yes, we will add Pistons @thechanceprism Random, when we have a nice batch of new stuff to share. @adahopalex We are on it @puppiesinlove It's a one time payment. All future updates are included. @itzluckepvp It's in the works @themaasta Modding will come with survival mode @sqrltv Hi, the small updates we do, don't collide with the work we do on optimisation and bigger updates. @realevan_jo Yes, we will but we don't know when yet. Hi Mechanics! We like to hint future updates in our videos. Totebot video is no exception. Can you guess what’s next https://t.co/4YkG7LIp6k @dieseldesignsmc @crafttheorymc Hey, thanks for making all the great SM vids! @thegamerman88 Yes, we will add it @timilybob What is the mail subject? @cocoacoci @dieseldesignsmc The Welding tool is not affected by small updates. @dieseldesignsmc Great video! Yeah, we should add a volume slider @ottonlyt This is a fix on our end. But did you try to have a wheel underneath the bar as well? @dukestylegaming Just follow the EULA that you can find on our Steam store page. @mterjesen We aim for this month. We are really busy with survival mode and other more requested features atm. @zephgrey Yes, it's our main focus Hey Mechanics! Here is the full list from today's update\nhttps://t.co/wNpTevmktG Hi Mechanics!\nA new music update is out!\nYou can now create tunes like this\nhttps://t.co/4YkG7LIp6k https://t.co/JiVNtlOLrT @timilybob Thanks! @haguetech Think you need to have two Steam accounts. Don't think you can be logged in to the same account from two different computers. @timilybob What email did you email? @esn_tyler Hi, Can you send us your computer specs so we can take a look? @anakinlinux @axolotgames No, how did you trigger that? @matt4o3ew02 We have done it and we might do it more if necessary. @myshko2001 Hey, that's awesome! @97babycakes this weekend @callipygianmoos Depends on the connection honestly. But we say 3 players. But that will change when we add dedicated servers later on. @crvenobradi @axolotgames Wow, congrats from the dev team! :) @lilmanplaystuff Only the ground? Is your computer following our minimum requirements? @timilybob make sure you send it to the right email. It's .se not .com @timilybob Hi, send us a report to info@axolotgames.se and we will try to help you. Please include your computer specs. @sarahshinyhunts You are welcome to email us at info@axolotgames.se @francisco13581 Yes, but please follow the EULA that you can read on our Steam store page @ninjachris77 There i a lot more we can do to make it better. The challenge is to keep a balance with new content, fixes and survival mode. @NinjaChris77 A lot of bearings close to each other makes the game do a lot of collission checks right now. That might be the issue? @ottonlyt We will try to fix it till next update. Awesome pixel cars by the way @thegamerman88 How dose your creation look? A lot of bearings close to each other? @matnno Still have some work left on that @sammy4night the stuff in the last devblog will start to show up from next week Hey Mechanics! New patch is up with some requested fixes!\nCheck it out!\nhttps://t.co/hiWJPkPcL8 @givemeapuppy No, they will be added @nb4rq Thank you! Hey Mechanics! \nNew devblog is up. As always, we have some new stuff to share!\nhttps://t.co/nLAsSMYLsJ https://t.co/pKhcSB44kz @jamesev61429602 Hey thanks! :) @0_0ckaep0_0 info@axolotgames.se @bob_three Yes, that would be awesome. But right now our main focus is Survival mode @mterjesen I think you will like our next devblog coming up tomorrow :) @endernetherfox Tell him to email us the problem and his computer specs to info@axolotgames.se and we will try to help @ratedsstuff Yes, this will be possible. We have done some progress on that. @t_kawamukai Hi, can you send us your computer specs for example graphics card and so on to info@axolotgames.se and we will investigate. @atomant22 Great to hear that. Well, survival mode. But we are keeping it a secret for now till more things are in place. @purppine_ That's not good, can you send us a email to info@axolotgames.se with your specs so we can investigate? @benhogie Can you resend that email to info@axolotgames.se and we will do our best to answer it tomorrow. @themrmeola We will post a devblog in a few days with some news @n0xiss We don't know when yet. But we will keep you updated here on Twitter :) @benhogie Hi Ben, when did you email us? What was the subject title? @beefy_tim Yes, we will add Pistons, but they are a lot of work since we want to give them extra features. @themrmeola Hey thanks! A lot of cool stuff in the works. Loving that flying burger by the way! @dchappen You might like something that will come out later this month :) @anakinlinux @axolotgames We will do that @inatyethe_ty We might do that. We did play with a jetpack idea. @the_toiletpaper Yes it will be when we add logic gates @ottonlyt Where did you send the messages? @ottonlyt Hm, interesting. We will look in to that @myshko2001 This month! Hey Mechanics!\nNew patch is up with sensor settings and more!\nCheck it out: https://t.co/0PNXH1NEbH @james_bob2 We are working on this @cocoacoci Yes if you follow the EULA that you can read on the Steam store page @gamingskill_yt Yes! it will be added later @batavo1428 Hi, can you send us more info on how it crashes and also more info about your computer to info@axolotgames.se? Thanks @fuzionaxes No plans for that yet, but we are looking in to it @turtlefromusa We like to do this at some point @c_burgholz Yes, we have to fix that at some point. The shocks are a special case @powerfulghost2 Happy to hear that :) @jacob_gharib We don't have a date for it yet. Later this year @fraction123123 Yeah, sounds like there was some issue. What computer are you playing on? Curious about your specs. @thechanceprism Yes we will add it @fraction123123 Hi, do you get 1fps when you play the game? @myshko2001 It will be possible when we add logic gates in the future. @besiegethis Thank you! love your self-driving vehicles by the way. Really impressive Hi Mechanics!\nA new patch is up! Check out the patch notes here\nhttps://t.co/xdFNgnio2C @refinight Hi, we are optimising it. We will have a patch up this week improving it further. @slyby_hippo Yes! @lambocreeper We are looking in to it but we don't know when @wibjoe Japp! @jbcasp Hi, that is not normal. Please email us at info@axolotgames.se so we can help you out and look in to it. @cipherdec Awesome idea! You seem to have a lot of lag. Are you playing this on a older computer? @j0hnbane Great looking dragon! @crackgear Dose pressing alt+Z help? @adammcc_xx Yes in the future. But not yet @benhogie Hi, ok in that case please send us your computer specs to info@axolotgames.se so we can investigate more. @benhogie Can you check so your graphics drivers are up to date? Let us know @slow_nielsen Hi! Check the minimum requirements on the store page. You can always refund it if it would not work @alexgearx Hi, send us a report to info@axolotgames.se and we will take a look. @jch773 Welding tool is next in line @two_10 That looks cool :) @inreallifealex Nice Alex! @jerwuqu They will be once we add night and day @Dahl_Dantill That looks awesome! @crackgear press Q Hi Mechanics! \nThe Paint Tool update is up!\nhttps://t.co/VhdrgJKWlu @Damon1315 Very soon @Chillie19924 Yes, the next tool Hi Mechanics! The Paint Tool will come out later today. Check out the new Paint Tool video! https://t.co/jbLs8UorAP https://t.co/12161TESKm @aroperpaiciere Saving that for the Survival mode @daddio66 Yes, we really want to do that @BesiegeThis We are working on a few fixes but not sure they will be out this week @Dahl_Dantill We started working on it @Paul19988 Yes! maybe next up Hi Mechanics! We're happy to let you know that the Paint Tool is coming out this Friday! https://t.co/HGzzxJmG85 @the_toiletpaper Thanks! we are working on it. @medjes_cpc We will add that option @v22pilotswife Please send us more info about your computer. It's we need to know more to investigate @mart30y We are looking in to it but no plans like that yet @chkngame Sorry, we are not at GDC this year :( @amper0003 Hi, please send us a email with details and your computer specs to info@axolotgames.se and we will take a look @skeletorssack Sorry, send it to info@axolotgames.se forgot to mention that. @xfoxx37 Working on it @xxluz_17xx We will add combat. But that will come in Survival mode. @skeletorssack Can't seem to find it. Can you re-send it and link this tweet. @Rcreations7 Thanks! We will investigate. @BryanFl77733660 Yes, all coming updates are included @Rcreations7 Hi, What are your computer specs? @SkeletorsSack Do you remember what you wrote in the mail subject? @fallskarm811 Paint tool is one of them @SkeletorsSack Did you send that save file to us? @thegamerman88 Yes, but not in the near future @oli414 No, they need more work still Hi Mechanics!\nNo update this weekend. We need more time to test the things we are working on.\nHere is a sneak peek!\" https://t.co/UhMGOcXE1r @draegast Great video! Would you like us to take a look at the save files you can't open? @wasterdustinyt Did you email us at info@axolotgames.se? We would love to look in to it. @myshko2001 We are on it! Should have a fix soon @thegamerman88 We will look in to that. It's just a temporary solution how it works now. @theawkcast That's impressive! @dan_roro777 Sure! send us a email to info@axolotgames.se with your specs and we will take a look @j0hnbane Nice one! @bubsonhd @axolotgames Good to know! We will keep optimising the game so it runs better. @windiesthook Yes, but it's a bit more work with glass @bubsonhd @axolotgames That looks cool! @islandredguy We are looking in to it @davidbent @axolotgames Hi! where did you buy our game? @gamingskill_yt It's great! @gamersahoy That's really cool! and yes we will keep optimizing the game so it runs smoother. @hareltv can you send a screenshot to info@axolotgames.se @mpw_ @steam_games Can you send us a email to info@axolotgames.se and we will look in to what the issue is for you. Please link this tweet @gharib_jacob Thanks! Did you always have this issue since you got the game? @minuskube Thanks, we will check it out @pixel_packer Later this year @thaa_strawberry Ganska snart :) @giesemor Thanks, we will take a look @giesemor No worries :) More information about your computer @giesemor What are your specs? @hannaconda Scrap Mechanic is PC only @giesemor That is not normal, dose it crash randomly or when you do something? Hi Mechanics! New patch is up. https://t.co/JQ8Eu7NPaZ @nickseaton81 That's a good start :) @thegamerman88 No, it's the same since release. @gamingskill_yt Awesome! Great idea @thomas_apol We will add a welding tool @mrsalva00 We are looking in to it now. But no plans yet. @blitzkriegsler You made it at the end. That was cool @nico12073695 Did it work? :) @xbcrafted @tangoteklp Wow! https://t.co/9iZLtieUPg @junetreedraws @xisumavoid Yeah, he has built some fantastic creations Hey Mechanics, \nWhat is the most impressive creation you’ve seen in Scrap Mechanic so far? @mistikknight That's good, if you sent a report then we have the crash info so we can take a look @mistikknight Is there a specific time when it crashes? or do you feel that it's just random? @xbrhoom_506 Start by checking if this is the problem https://t.co/CSauIfSFZZ @minecraftdance Thanks for reporting this. We are investigating it now @nidrona Thanks! @nidrona Please send it to crashlog@axolotgames.se as well, just in case @ottovanzanten We would love to but it would not help us unfortunately. We need to see the issue to fix it. @neronix17 Some real frambots actually have a drill in that place to plant seeds. It's a thing :) @joestarztt Some farmbots are almost done. This one however is new and only a concept so far. @afrofarfar We have it, but we are still changing it a bit. Hi Mechanics!\nOne more concept. These farmbots used to manage the food supply but they’ve now absolutely lost it. https://t.co/gpl5qXuhsN @kingjay826 Yes we will @ben_bagle Yes we are @jakob258 Did you always have this problem or is it new? @ninjachris77 That's just a temporary fix the way it is now @ninjachris77 Ok thanks, we will look in to it @ninjachris77 Did it happen in a new world or old? @skeletorssack Thanks, we will check it out @winker_watson1 Hi, we need more info. Can you send a report with your computer specs to help@axolotgames.se Hi Mechanics! We have a new patch for you today. Check it out\nhttps://t.co/rgmh6pnURz @skeletorssack Hi, go to \\AppData\\Roaming\\Axolot Games\\Scrap Mechanic\\User\\User_(randomnumber-here)\\Save @damianlau2 We are looking in to that! @petiteyouenn We read all emails that come in, but instead of answering all one by one we rather get to work on the issues. @stomeus1231 Can you send us your specs to help@axolotgames.se\nWould we love to take a look and investigate this more @mrsalva00 We are looking in to it @stomeus1231 Even when he starts a new world? @ctop_24 Could you send us the save file to info@axolotgames.se and we can try and dig it up again. It's a bug we are working on. @skeletorssack Are you playing on the test branch? Can you send us the save file for it to info@axolotgames.se? @skeletorssack Was the race track on a lift? @jebnicholson Hey thanks! @petiteyouenn Sure, send us a report and your specs to help@axolotgames.se @at_a_click @ninjachris77 Thanks guys! we will look in to it. @ninjachris77 Did you send it to info@axolotgames.se? @ninjachris77 What did you write in the mail subject? @ninjachris77 Can you send us your save to info@axolotgames.com so we can test it out? @kkthnxtv Looks like they are having a good time :) @06769750067 Hey! awesome truck @flakstadsondre What graphics card do you have? RT @PontusHolmbom: Updated multiplayer physics are on the test branch. If you had problems with the previous one. Plz try this patch and te… @ninjachris77 Is this a new save or old? @mrhypernova Yes, we will add pistons @sharingankarasu We are looking in to that @ddgsoftis Vet du hur du triggade den? @pinkeyeglitch Hi, please read the EULA on our Steam store page @makamido0 Yes it is :) @xrrarma Yes @asphyth Sorry, we had to take that out for more testing. But soon! https://t.co/2E5qjai5gr New patch is up! Check it out https://t.co/2E5qjai5gr Hi Mechanics! There seems to be an issue with the new update. We are looking in to it now. New update should be up in 30 min @draaxlp We have a lots of stuff in the works, but it's a priority to make sure the game runs well for everyone first. Hey Mechanics! New patch is up with some new improvements. We also added a few new parts! Check it out\nhttps://t.co/uqb02GVp7B @hunterxmaster4 Att det inte går att hosta egna servrar. Går bara att bjuda in folk via Steam @legandarytobi Yes, that is on our to-do list @onecraftysahm Hi, ok in that case please send us info and the computer specs to help@axolotgames.se @onecraftysahm This is a bug in Steam. This should fix it for you https://t.co/CSauIfB4Bp @dualdgaming Toppen! @gigorin69 Oh no! What went wrong mechanic? @kogermax We have a patch coming up that will make this better. The processor has to do a lot of collision checks when it's this compact :) @bbbmarko01 That's awesome! Paint tool is in the works @dualdgaming Är du säker på att beta client är av? https://t.co/fUK3NG5RAN @dualdgaming Tjena, då är det lite konstigt. Hackar det även i huvud menyn? @twitchactivater @ninjachris77 Yes, we will make that possible for sure. It's on our to-do list :) @thehotcrafter Did you try to reinstall the game? @domronda We are looking in to it @masheengunmatt It's not possible yet. But it will be in the future @amonoros Hey thanks! :) @anmexmc This might help https://t.co/CSauIfSFZZ @jack_young04 Strange, not sure that issue is on our end @jack_young04 Did you try to quit steam properly and start it again? @mcdoodlespie @gtwscar We are looking in to it @blitzkriegsler Noted :) @coasterfan312_ That looks awesome @gtwscar What did you build in that world? Anything huge or complex? @luuk777w Maybe there is not point to add hinges since it would work the same as the bearing technically @hunterxmaster4 Gå in i en av dina världar, tryck på ESC och sedan invite friends. Du kan bara spela med steam vänner just nu. @chickenguy5 It's random everytime @xisumavoid On it :) Early next week @chickenguy5 It's generated out of terrain tiles @diehlcarson They don't reply to all emails. But they read all and start looking for fixes for next patch @jilligen This should help you  https://t.co/jNFHYcoaSs @diehlcarson Are your graphics drivers up to date? If they are, please send us your specs to help@axolotgames.se @cr_crlewis1 That would be awesome, but nothing we will add this year. @ruecate We can improve it a lot. That is what we are working on now. @xeptik94 This should help https://t.co/CSauIfSFZZ @karimmasri50 Yes! we plan to add pistons @lumpdizzle666 We have plans like that yes :) @currentincursci Thanks for sending us a email. Did you include your computer specs? @kappacj14 We posted a fix here: https://t.co/pyIbySw06Q @hazmat_w It might be a known fps issue that you can fix. Please check: https://t.co/eAwUPas0je @MrHatman_ Thanks!, we will read it and try to track down the problem. @hardballer25 Did you send us a report with your specs to help@axolotgames.se? We read all the reports and investigate. @hardballer25 Most known crashes are fixed now but not all. Still investigating. @hock215 We are looking in to that @MrHatman_ Don't forget to include your computer specs @MrHatman_ Most of the crash issues have been fixed but not all. Still investigating.\nDid you send us a report to help@axolotgames.se? @Maxido_ It will make more sense in Survival mode :) Hi Mechanics! We are now 100.000 strong! We also have a new patch for you today! https://t.co/f6k5N08G5J https://t.co/NHm9prmuwF @dualdgaming Problemet är att en steam beta update ställde till det. Den slogs nog på då även fast du inte slagit på den själv. @therobogamer This is a common issue for startup crashes. Please see if this fixes the issue. https://t.co/eAwUPas0je @ottovanzanten We do reply to emails and Steam forum topics but we can't respond to all. Send to help@axolotgames.se. We read all emails. @dualdgaming Hej, det kan bero på så mycket. Kan du testa att se om Steam beta client är igång. Om det är fallet, stäng av den. @therobogamer We don't respond to all. But we read all, note all the issues down and work on fixes. @bczubacki Do you use 32bit Windows? @etamingaming Just press ESC when in a world and click on Invite friend @capnstef Yes! @letsgo00hun Yes, you have to build a new ship and go up on a rescue mission :) @manjengaa Hey there, thanks! Sure https://t.co/eOyh1Ay9gr @bczubacki How did you get it working? Interesting to know :) @laxclag23 It's a \"we hope so\" @mrhatman_ Sure! send us details and computer specs to help@axolotgames.se But please check this first: https://t.co/eAwUPas0je @bczubacki This is bugsplat trying to report a issue but fails to do so. We are investigating this. @zerobuzz83 When we add a welding tool it will. But it's still on the drawingboard @edwarddonnell69 We are working on it right now. But it might take a few weeks. But it will be worth the wait. @sodapop2011 We need more info. Specs and where it happens? Send it to help@axolotgames.se @prktmachaki Thanks for the suggestions! @skytei We aim for this week @gigorin69 Good news is that we are improving it right now. It will only get better. @schubylp @auroragamesmc No it will be multiplayer @xtoasterbrains Yes, for sure. It didn't make it till release but we will add it. @aaz_mineboy It's not possible right now, but it will be in the future @ninjachris77 We recommend playing up to 3 players max now. If 6 people build complex creations it can get pretty heavy. @ninjachris77 We will do a lot of improvements this month and next @thedegree0 Sorry, it's not possible yet @binnsy03 That's interesting. This is also in a new world? Can you send us your specs to help@axolotgames.se so we can take a look. @prktmachaki Hallo! sure, go ahead @davidstaffe This is the place :) https://t.co/eOyh1Ay9gr @boylectom Even when you start a new world? @laxclag23 We will see @wick0302 Yes! this is our nr1 priority now. @zantheyt That's great! what did you do to make it work? @lucreciogaming Yes, we are already working on it @zack_salaah Yes, this will be possible soon @thomasreaubourg @zantheyt We read all emails. But we focus our time on fixing the reported issues instead of replying to everything now. @zack_salaah Right now our priority is lag issues and crashes.\nAfter that we will finish the Paint tool up. @zack_salaah We are happy to hear that :) Thanks @cam_stott_05 Later in 2016 @ninjachris77 That is our priority right now! :) @jebnicholson Yes, it's possible that we will add that. @zack_salaah When you buy the early access game, all the future updates will be included. Yes @netmindylan Yes @ben_stokman Yes, we might @zantheyt We aim to look in to it early next week. @zantheyt Ok, can you send us these details and your specs to help@axolotgames.se so we can take a look. @zantheyt Hi, we need more details. When and how dose it crash? @incrediblehal That's awesome @topgunpartz We are working on optimising it. There is a lot we can do to make it better. @xxoniebuerxx Oh no! :) @crazypharaoh Hi there, did you make sure you have the latest drivers running? Let us know if you still have issue after that. @ottovanzanten We will deal with the fps issues soon. It will just get better :) @hotgamingpotato Yes, we will get to that soon @asphyth We will deal with the lag soon. A lot we can do to make things better. Thats the good news :) @icomeinpieces Right now you have to rebuild it. But in the future we will add a welding tool that will help with situations like this. @crazypharaoh We read everything and take notes. Instead of answering all, we try to put that time in to fixing the issue. Looking in to it @michell22463186 Did you check minimum requirements? @pompey4468 PC only right now @pompey4468 Im afraid not @timmpalainen @axolotgames Tack! Kul att ni gillar :) @ganjotv Wow! how is the fps? @alipallibee Sure, we need more info to look in to it. Send us a report with your computer specs to help@axolotgames.se @mennace_plays Not yet! Hopefully in time for Survival mode @xisumavoid Can you re-send it? @soaryn117 info@axolotgames.se @xisumavoid @tangoteklp We will start working on a welding tool that will let you weld things back. @matnno We also want to add that. But optimisation and bug fixes come first. After that new content. @accusedrocko Yes! it's a thing :) @rashkavar It's a suspension exploit @mainwaygaming Please add your twitter name in the mail as well @mainwaygaming Can you resend it again now and we will take a look. Make sure we did not miss it @mainwaygaming Ok, And you did mail help@axolotgames.se? Hi Mechanics! New patch is out! This one should fix more crash issues. Check them out. https://t.co/WQoJMBrllT @hardballer25 We need more info to know what it could be. Send us a report and your specs to help@axolotgames.se @sykotavo Hmm... and what happens when you remove the lift? @boxfigs Right now the game is in Beta @asphyth How many did you place down? @mirginbails Maybe :) @thethiefofeden @deadweight4u Always welcome to send us a email to info@axolotgames.se @boi_jude Yes, you can do that now. It works :) @MainWayGaming New update coming tomorrow that should fix more crash issues @webbster64 Yes :) @Moddingear Working on it, no date yet Hey Mechanics! \nTime for a new devblog. As always, we have some exciting stuff to share!\nhttps://t.co/3MlWI7t1t5 https://t.co/grc1Lg3a9S @sorryiwin @axolotgames We read all help emails and take notes. Instead of replying to all, We put all our time in to fixes right now. @sorryiwin @axolotgames Was it a support mail? @jpo_d Thank you! :) @wes_gibbings You mean voice chat? You can already chat by pressing enter @jeffporter111 Hi, we need more details. Can you send us what happens and also your computer specs to help@axolotgames.se @golleligan Kul att höra! @firebrider This is high priority. There is a lot we can do to make it better. It will get better over time with coming updates. @pawer08 Very smart solution :) @sodapop2011 Great to hear that! @abritishfox This is really funny @krojak How long did that take you? Impressive :) @hildrayk You mean the game stop working for you since the update? @teary_ash Thank you! :) @itsgime @twitch @twitchtvsupport First we where told it automatically sync the image from Giant Bomb. Then that it should be uploaded. @windstaerkeacht hmm, in that case please email us details and your specs to help@axolotgames.se @willewarn It's up now @ganjotv perfect circle! @windstaerkeacht New update just went up. Let us know if it fixes your problem RT @PontusHolmbom: A new Scrap Mechanic patch just went live (0.1.16). This patch should make life better for a lot of mechanics! Hi Mechanics!\nNew patch is up! This one should fix a lot of issues. Check them out. https://t.co/YYce4y8oLK @endjoe64 So you got it working? @ganjotv WOW Impressive! i hope the bearings can handle that :) @willewarn Today! @luyhjkk Update coming up today that will prevent this from happening @garnec1997 Yes we will @endjoe64 Can you send us a email with details and computer specs to help@axolotgames.se @sodapop2011 Tomorrow we are updating the game with a better auto save. Let us know how you think it works out for you. @jakb3000 Good news is that there is a lot we can do to optimise it. And we will as soon as we get some more bugs out of the way. @AuxPlumes_ Great ending! Well done :) @sensvideos Yep, it's a known issue. We will look in to it. @befuddledg Oops, how? @eronix_ alt + z @aforjack Yes, in the options. Then you go to the graphics tab @aforjack Did you try lowering the graphics settings? @aforjack Hard to tell, can you send us the specs? @iambigboynow That seems to be an issue with Steam. Not with the game. Did you restart steam? @thomasreaubourg Can you send this info and your specs to help@axolotgames.se That would help us investigate @explicablekato Hi Peter, most likely yes. @shadow_frax What kind of pie? pecan pie? @reynielane No plans like that right now. But that can change @drfun1231 Can you give us some details? @whitehatvandal New dev blog will come up next week that will show some new stuff @ganjotv Just a tip when you build huge things like that. Don't make them separated from the ground. It gets to heavy for most computers. @ganjotv i have to investigate if there is anything we can do. Did you do any save backups on early progress? @ganjotv If the plane is a free object, then the problem can be that it makes to many collision checks and it drags down the fps."}