{"tweets": "Mac Miller: A Celebration of Life. Like or retweet this tweet to donate to The Mac Miller Circles Fund, supporting youth arts and community-building programs in Mac Miller’s memory, or visit https://t.co/zM41C0Je0L.\nhttps://t.co/s7cZYmGzkS Join us tonight. https://t.co/s7cZYmYaJs Join us for the livestream of Mac Miller: A Celebration of Life on 10/31 at 6:30pm PT. The event will benefit The Mac Miller Circles Fund to support youth arts &amp; community-building programs in Mac Miller’s memory. Visit https://t.co/zM41C0Je0L to donate. https://t.co/s7cZYmGzkS RT @CraigSJ: I hung out with @MacMiller last month and talked about fame and anxiety and the making of 'Swimming.' https://t.co/MRx8J0zkh8 @CurrenSy_Spitta Ima just pull up to the venue 2 months early and start soundchecking Go get tickets for tour.\n\nThundercat\nJ.I.D.\n\nI’m bringing a band.\n\nThe show is going to be special every night. \n\nI wish it started tomorrow. \n\nIt starts October 27th.\n\nhttps://t.co/RGYZC5DTza @desiresgrayson Sending you love I just wanna go on tour Hurt Feelings (Live @ The Hotel Cafè) - https://t.co/uxj4TC0R3P This is a solid reading experience. \n\n♥️ https://t.co/UWMjQBy784 @LilpTV No it doesn’t extremely well rested Go listen to Dylan Reynolds - No Control. It’s a beautiful song. Thank you. @TierraWhack https://t.co/TmLeLSAJrK @TierraWhack Taco Bell has a lot of great choices at great prices Hey, I’m with my friends talking about things, go listen. https://t.co/LwY56EZUYV @rembert Love u dude @snohaalegra I think it’s a pretty solid theory always remember\n\npicking the correct shirt can do unbelievable things for your day @gracelove_xoxo ♥️ @elephant_xo Your tattoo is awesome @lildickytweets I like to think I can hold my own @ThisIsMax Chris.\nRock. no sex in the champagne room @N_oahG_olden That’s one of my favorites have no fear, there are reasons for everything and methods to the madness. we listening to Prince all day. Larry Fisherman has to go on sabbatical. My instagram is now https://t.co/rbw2hFheM3 To Whom it May Concern,\n\nIt’s 2018. Why is there not cellular service everywhere? Please fix.\n\nSincerely,\n\nA Concerned Citizen How do they make saltwater taffy? @terracemartin 👀 @Innerviewq Same @madeintyo 👀 If you not bustin a sweet dance move to What’s The Use I don’t know what type of time you on. @AndersonPaak #AskAndy how many push ups can you do? This goes out to all my friends that send me music to listen to. You are appreciated. coming soon... https://t.co/HFZzxRpTQu @JOAKEEEN hell yeah man I wanna show you guys the performances from the Hotel Cafe shows To everybody hitting me about merch, \n\nThey didn’t expect this many people to order things so everything was backed up. They are getting it all shipped out. You’ll have it ASAP. Won’t happen again. ♥️🤠🕺🏊‍♂️\n\nLove,\nMalcolm How do you internet? looking for people to play tennis with. serious inquiries only. @andile_who 🏊‍♂️🏊‍♂️🏊‍♂️ @6twentytwo I used to make those all the time. Delicious. @JGarnj It’s so good This is a Hugh Laurie appreciation tweet really good raps with Malcolm https://t.co/L8A7arfOjV VIP / M&amp;G Tour packages have arrived. Love always. \n\nhttps://t.co/RGYZC5DTza @DrGetaheadspace Thank you thank you thank you so very much. I appreciate you and am glad you are enjoying. Love to you and yours. RT @LilTunechi: We lost a Queen today but heaven gained an angel. Rest in peace to the legend Ms. Aretha Franklin 🙏🏾 😁 https://t.co/DX9gJlbSi6 To everybody telling their friends about the album and spreading the word just know you are appreciated. Can’t wait to see you guys at the shows. \n\n🏊‍♂️🏊‍♂️🏊‍♂️ @seanclytle Yes. Pockets are necessary. I performed Ladders on Colbert \n\nhttps://t.co/JARts8C9bC @LEONLEANIN Love you @mangocococherry I’m sorry man I was on a mission @sierrainbl00m Holy shit. Happy you’re ok. Stay safe. @dte_angel @John_Corona Lol @Thozama_Gawe @osincula Thank you ♥️ @GeorgeBenioff There are black shorts 🤷‍♂️ @Innerviewq Sign me the fuck up see what i mean The cry while listening to Swimming challenge @audreyyloo Always https://t.co/MSjwKytkmy https://t.co/sG6Pe1Tlxk JUST DROPPED NEW MERCH IN THE STORE.\n\n🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️\n\nhttps://t.co/MSjwKytkmy hello friends The Tiny Desk performance is on YouTube now. Tell a friend. \n\nhttps://t.co/5XWwt48bB7 Tour starts in October. Tickets are available now. Come to a show, it’s going to be magical. \n\nhttps://t.co/RGYZC5DTza https://t.co/3k2LGtDSQH Hi\n\nPutting this album out is such a beautiful feeling. I just want to take a moment to thank you for lending me an ear. Music is such a special thing and moments like these never cease to amaze me. I hope you find something in these songs just as I found something making them. @kevinabstract it’s amazing TINY DESK https://t.co/8DZ0qdoFkZ RT @amoebamusic: .@MacMiller's new album \"Swimming\" is out now on CD and will be available on vinyl October 26th. Get the CD or pre-order t… Tiny Desk drops tomorrow RT @ericakristine_: @MacMiller Emmett likes hurt feelings and I like dunno. That is all. Thank you for always sharing your love through the… @domi_renee yes you can Stop keeping score. Just keep swimming. @CoryTownes Thank you man @quintabrunson 💙 @KingThelonious you’re just an all around good human being @VARSITY2020 not all heroes wear capes @katie_severance all the way yes @LiveLaughSmoke This is awesome @lexisky25 Tell him he’s a solid individual and we appreciate his opinion @mokae_neo 🙏🙏🙏🏊‍♂️🏊‍♂️🏊‍♂️ @asherroth Ayeeee thank you man! Thank you https://t.co/ZERXIEcGCA Here’s a good read. https://t.co/5WQeWqgvLG RT @LILBTHEBASEDGOD: Mac miller new album out let’s GO - Lil B Swimming \n\n🏊‍♂️🏊‍♂️🏊‍♂️\n\nhttps://t.co/kp9UnGplVf in my own way this feel like living\nsome alternate reality\nand I was drowning but now I'm swimming...\n\nhttps://t.co/Qp2T5qy2jx Come Back To Earth: https://t.co/Qp2T5qPDI7 2 hours 😬 It’s all happening\n\nstay tuned\n\nlove always\n\n🏊‍♂️ the song is called inertia.\ni made the beat. \nthundercat played the bass.\nsam balaban put the video together. \ni’m playing my jupiter. \n\ngood times. \n\nhttps://t.co/0DimWAs1ht Hey everybody Be you. \n\nYou’ll be fine. ayyyeeee look at that guy https://t.co/11Db1Gx8Ws @cindy_barajas Stay tuned @Innerviewq I love you with all of my heart 🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️🏊‍♂️ You guys are awesome Merch Bundles. https://t.co/uMua2pCSJJ All presale tickets to The Swimming Tour are available now on https://t.co/RGYZC5miHC Pre-sale password is “swim” Pre-sale begins tomorrow at 10 AM local time. https://t.co/8gFVJLSF9A The Swimming Tour feat. @Thundercat and @JIDsv https://t.co/0dfIWImyfO What’s The Use?\n\n\nListen: https://t.co/HvxdzuyL5S RT @zanelowe: NEW. Today's #WorldRecord from @MacMiller 'What's The Use?' 👉🏼📲 LISTEN https://t.co/oaM0HemR5M https://t.co/sQsTdxJIts RT @intanetz: HIVE MIND OUT NOW  \nhttps://t.co/ADyoTPVfnx https://t.co/zGwpGJtF4Y Monday with @zanelowe https://t.co/lzkYFJVTxB Listen: https://t.co/VtjACH3WFD You can pre-order Swimming now: https://t.co/aEsuYHTuGM https://t.co/juC0p0Z2c4 Self Care. https://t.co/ZqEgMT44mh 9 PM PST Swimming. August 3rd.\nhttps://t.co/XLcaeppRp3 💔 https://t.co/WvBfRuZ83M RT @DylanReynolds: it’s a beautiful day out and i just finished my last round of chemo. new song “no control” out june 27th. can’t wait for… https://t.co/1rC01qRGlh https://t.co/SrkZMAao4o https://t.co/G3NQuCBkCS https://t.co/uFK3IpowGj https://t.co/BNPRMyDvKU https://t.co/Le0gv8WDc3"}