{"tweets": "Scenes from by the Sea\n\n*on film, by me https://t.co/o6JKhMOdUS Oh! And big thank you’s to @PaulSmithDesign for dressing me (a boy got COMPLIMENTS) and @GettyImages for these photos 😌 massive shout out to all the bright and brilliant students who flew in from across the country to attend last night!! you’re a bunch of inspirations and your speeches make me cry every. single. year. GLSEN Respect Awards ♥️♥️♥️ https://t.co/xTzJKhxVgR @jccaylen @StevieNicks @MickFleetwood @chelseyamaro cute. also, i couldn't resist. https://t.co/UNSOQ9fXLd good morning to selena gomez and her two slapping songs ONLY I’ve been to Croatia, Bosnia and Montenegro today!! https://t.co/UlelLJPEct @coldpizzasIice arun gets that. i’m still learning. @multayply birthday cake flavor my friend just ordered an entire birthday cake for dessert on a wednesday and nobody’s birthday\n\ni can’t believe rules no longer exist i read your secrets...and i fully regret it\nhttps://t.co/7SnJRAgq4e https://t.co/HyRr7LZ0LH @guodanping @vmagazine @angelababyct that’s incredible! wow! @vmagazine @angelababyct this is a big first for me, so massive thank you to Stephen Gan and everyone at V for trusting me with this cover!! 😌♥️ ANGELABABY for V MAGAZINE \n\nThis is my first ever cover. Shot by me.\nAnd, I'm so proud of it ♥️♥️♥️ https://t.co/gJAQixBjOz @spideystommo 💛💛💛 i read your secrets...and i fully regret it\nhttps://t.co/7SnJRAgq4e \n\n👀📝 https://t.co/0Si6p7xzSg @spaceyromo it’s very hehehe @msbuffoon first actual one in kinda forever?? in some sort of paradise, i think https://t.co/bhJ3VT0Bjl today’s color palette https://t.co/TTnwKIWj7A some days i feel like an icon\nother days i feel like icant https://t.co/8V2UmMwHbP i love you a whole lot happy #comingoutday all you beautiful souls! ❤️🧡💛💚💙💜 You BELONG. You MATTER. You are BRAVE. And ultimately, you are more than enough in this very moment, but deserve to be exactly the human you deep down know yourself to be, okay?  Don't let anyone, including your own self, convince you otherwise 👊🏻♥️ @kurtisconner i can't unsee the demonic furby here RT @ACLU: Trans and non-binary people belong in workplaces.\n\nTrans and non-binary people belong in schools.\n\nTrans and non-binary people be… @JustDestane01 you rang? @httpzerkaas i wish my brain could comprehend this, i really do...but it loves to complicate everything 🙃 who’s the reckless idiot who allowed ‘affect’ and ‘effect’ to be so similar in both meaning AND spelling @JacobWhitesides aw, ty jacob! Joker...was something else, man. Clever writing, phenomenal acting, unorthodox directing, and overall, I'm shocked at how heartbroken I could feel for someone so clearly sinister...Wow, my mind is in a knot. @nowthisisliving thanks shannon 😌♥️ @heardwell @Lilly @Jenna_Marbles @DavidDobrik ohmygOD. 🌹 This is 27 🌹\nhttps://t.co/A9CgWpddHD https://t.co/LAcpAizFUD @califrxnta THANK YOU. also, done! \nit’s now in the description 🧚🏻‍♀️ @mmitchelldaviss thanks mitchell ☺️ New Video / This is 27\n*https://t.co/A9CgWpddHD \n\n🌹👁🎞 https://t.co/Sl2akL3voc @lastkissperry it oddly has a bit of everything!\ncinemtic landscapes, bit of poetry, vulnerable insight, etc not to incite violence or anything, but can you believe it’s October and we still don’t have a new Rihanna album these autumn temps have me absolutely swooning keep yapping yourself into a corner you raw chicken thigh, we have you right where we want you https://t.co/csH3t14HCy we’re clearly trying to send your ass to jail https://t.co/c0iL8O6x6S https://t.co/MGwHjM8lzS @OhWonderMusic make me weep, lyrical goddess @MattChampionASF @Nashgrier @taylorgiavasis oh wow...that poorly placed (though still oddly accurate) comma 😅😅 @Nashgrier @taylorgiavasis ah massive, congratulations!! 💕🤲🏻💕 RT @WIRED: ”People are suffering, people are dying, entire ecosystems are collapsing. We are in the beginning of a mass extinction and all… WELL DONE to the millions of people around the world attending + supporting the global #ClimateStrike today!! Your passion is radiant and your voices have never been this loud!! Change is coming🤲🏻♥️🌎 @setofjaws us:                            him: https://t.co/Ws0T5cRnLA my little brother is officially back home from his 2.5 years away volunteering and we just added him into our sibling gc again!! my heart is doing backflips...also, im excited to bombard him with memes 🥺🤪 https://t.co/q4xQUpicnx @ItsTylerYoung c’mon inspirational pennywise thanks for all the birthday messages! feeling very loved ☺️♥️♥️♥️ https://t.co/Mx7iOdzuLI 27 :) im dating me and myself https://t.co/9zz6QHSiMq @yeababenowayyyy happy to provide 🤲🏻 im always out for a walk around this time, can you blame me? https://t.co/TcMCLb19Vf dyed my hair dark, im ready for autumn !! https://t.co/0OqlG6Kz6M too afraid to fall in love again The Most Important Thing is...\nhttps://t.co/WioBefJqmo https://t.co/4TCydB8JrE here, eating all the dragon fruit \n🌴🤲🏻⛱ https://t.co/meoIjvkzdF @R5Latvia *anxiously glances at the full iced latte 4 inches from my hand* @coldpizzasIice VERY CUTE !\n\n(also, babe, your @ is incredible) @thimas_selena im just supposed to look THIS cute in front of my walls?! they don't speak and a boy requires immediate compliments. @troyeshood to share a pic that means i must wear them. dangerous. very very dangerous. THRILLED i finally bought a pair of white pants...TERRIFIED i'll ruin them the first time i wear them out. i’m bitches https://t.co/jBumQgYrie @feeIingIove tf i didn’t do that? twitter, come on... got you back ✊🏻♥️ @sammmysamsung new levels of lonely. i dig. @aIoving the blocked text is about to look so *chefs kiss* over your profile @lesliesivan18 https://t.co/zE125rf0kG i, just like every dog ever, will do anything for a spoon full of peanut butter exploring ☀️ https://t.co/THQlCr3LzC somewhere in northern Cambodia https://t.co/Usd4MfFjIl @Lottie_2801 I was listening to yesterday morning! probably didn't help 😅 to clarify: this was a guy in his 30s with a massive, old, white van...im sorry but mama didn’t raise no fool. @OurWeeklyHeroes babe...it was an old ice cream truck with no windows, blankets everywhere inside and on a side street...you weren’t there. calm down. Well it’s official...True Crime Documentaries have completely ruined how i interact with strangers.\n\nWhile out for a jog, some guy asked if i could ‘help lift his bike into his van bc he hurt his foot’ so naturally i yelled NOPE and sprinted away from that blatant serial killer. @jccaylen this is mad cute saturated in shanghai \n\n*on film, by me https://t.co/RPy0zcCz61 @Iunarcon @commonculture love it 💕 🌿 A Tour of My Plants 🌿\n\nhttps://t.co/qHyuMUOzKC https://t.co/R92tCjbPKb @1994FTCABELLO just do it 🤪 @spaceyromo siiiick, i like your style! @loobeeloou the apple fritter i had a few nights ago was out of this world 🤤 I’ve been pushing myself to run 10 miles every day for the last 5 days, then rewarding myself with a absolutely filthy dessert every night.\n\nAnd somewhere along the line, this has become my twisted idea of a good time. @ItsTylerYoung i feel like our ~plant journey’s~ have been happening concurrently, so you know this is a pretty special moment 🌱 @weareshura @iandavidmonroe 🥰🥰🌱 somebody come sweep me off my damn feet im tired of walking @kjburlingame wow, INTELLIGENCE. I don't know what I'm tweeting about. My grass is lush honey. @kjburlingame well now this is a perspective i can get behind the grass is always greener RT @heardwell: All new from @CouldEverMusic! His debut single \"I Got It Wrong\" just dropped. Stream it everywhere today!\n\n🌵🏜: https://t.co/… nǐ hǎo 你好 https://t.co/QkOXy2XA53 @Delta can i just say, i had the longest 8 hours of flight issues today, but the Delta staff at LAX were the absolute most wonderful/helpful human beings out there. Sonya on the medallion assistance phone number is a pure gem and queen deserves a raise ♥️♥️♥️ :) https://t.co/RFMkePRBJB @antoni “ladies &amp; gentlemen, please welcome to the stage...Tequila Mockingbird” analyzing popular song lyrics... \nhttps://t.co/L2jiL3L5Og\n\n🎶📝🤭 https://t.co/QParcuzudh in the middle of a heat wave https://t.co/GLC4eJ18jA don't underestimate my punk ass, i'll take HOURS to make one simple decision @hernameisBANKS @vmagazine congrats on the album, love! ♥️ @elizasbIake @hernameisBANKS @vmagazine a paper backdrop i painted Banks for V Magazine\nPhotographed in Los Angeles\n\n*by yours truly https://t.co/9ehYBItZ9T @waydamneedy aw @sapphicblossom that’s the follow up video where i roast all of you addressing your assumptions...\nhttps://t.co/yvsa7lVXZl\n\n🤦🏻‍♂️💭⁉️ https://t.co/jEagY3aU7t @heardwell growing up so fast 🥺🎈 ran my first 25k trail race and placed in the top 5 overall!! not a bad view either 🏔🤷🏻‍♂️ https://t.co/mSHwEvHnAH summer baby :) https://t.co/Pq16uOIOmJ RT @heardwell: OUT NOW! What it's like being LGBTQ+ in 2019 with @JamesCharles, @TheMilesMcKenna, @Kingsleyyy &amp; @AnnaAkana. Hosted by @Conn… @tanebouton these are models hahaha humans in nature\n\n*in b&amp;w, by me https://t.co/oCRwh9oeEw @AStanOfAll99 i am very aware but the peer pressure finally worked and now here we are @lastkissperry oh trust me i have i discovered ‘Love Island’ the other day and it’s safe to say the little social life i had is now over well damn, this is nice. can i pay you to yell it at me every morning? https://t.co/hybEDcjC2H @AmazingPhil p.s. the next gay mafia meeting is this coming saturday. be there. no plus ones. 🕵🏻‍♂️🌈⚔️ @AmazingPhil AW, PHIL!! CONGRATS! proud of you and so so happy for you ♥️☺️♥️ @finneas damn. this is so painfully beautiful. my eyes are glossy. serious business dad vs giddy gym rat https://t.co/PAX4KUkEW5 @ellessirhc seeking out passionate purpose every single day in even just the smallest of ways @rosechlorine give it time, things change ♥️♥️♥️ @juvesbreathin not to jinx anything but he's here! he's been around for months now and he's blissful! idk im just really loving life right now Absolutely brilliant to be apart of this and to honor all the brave LGBTQ+ people that took action 50 years ago at Stonewall! Thank you for paving the queer way ✊🏻♥️ https://t.co/frlquikvQX @ripleychasee at the moment.. Mayor Pete, Senator Harris &amp; Senator Warren are speaking to me. @ardenrose CUTE and TALENTED @httpzerkaas WILD TIMES. I have more questions. Put me on again, cowards. the democratic debates have me extra EAGER for the 2020 election... there are so many interesting, articulate, qualified candidates and im READY for all the progressive change they can make!! showing you EVERYTHING in my closet\nhttps://t.co/7sOLbWrhjl \n\n👖♥️🥼 https://t.co/ccVxUUkzUQ Since coming out to my mom, we’ve truly never been closer ❤️\n\nI'm proud to partner with @PFLAG &amp; @Verizon to share our reconnection story and to highlight all the LGBTQ+ educational resources at https://t.co/MPqL3aUdCZ #ConnectedByPride https://t.co/mYdsppvBWX here’s a photo of me with a rainbow under a waterfall https://t.co/SxGItppnI8 @ManuHeaven me @ the trees @Ace_Aliex thank you, that is exactly how i feel 🥰 im back from a weekend away off frolicking in nature and i feel spectacular https://t.co/xAdIAITT3W Speak your love to the people you love in your life. You never know how much that support can truly mean to them ❤️\n\nI’m proud to partner with @PFLAG and @Verizon to let the world know that it’s never too late to call someone back. https://t.co/cwEtAp1RG8 #ConnectedByPride https://t.co/safh4kFdYP silence is overrated @1997DlANA https://t.co/eNfRzWTO54 @Iovebastille stoppp lmao 3 days difference https://t.co/2lJJoatM1L love you, dad ♥️ https://t.co/eWR0Ic8UdI 3rd place overall in the Santa Clarita Half Marathon this morning! new PR of 1:24.08 too!! https://t.co/S1nQUnaT2U my supportive dad is being extra supportive today https://t.co/vfGV0XOTvn @danielhowell oh and an official welcome to the gay internet mafia. we meet the first saturday of every month. coffee and donuts are provided, however we do recommend you bring a snack to share. no plus ones. dont be late. 🌈⚔️ @danielhowell daniel!! im over the moon for you right now. this takes courage to share and you should be so so proud of yourself. well done ♥️ yes!! let's change the world together ✊🏻♥️ https://t.co/gf22Nfzddo @thequiet6_ @onlyfools sh sh i've been listening to it since it came out. im only late to that public praise!! im late but the new miley cyrus ep is damn good @maria_natalia ♥️♥️♥️ gay gay and more GAY\nhttps://t.co/TMrFdy70by\n\n❤️🧡💛💚💙💜 https://t.co/W8SUO1APEj RT @GLSEN: We’re thrilled to announce @connorfranta will be the keynote speaker at Speak OUT, a youth-led summit for #lgbtqstudents and the… @guiItyart first few that came to mind. absolutely wrecked me. https://t.co/iJOPDkzHmL places of peace\n\n*on film, by me https://t.co/KbZlDiGucm @ItsTylerYoung go on.. Utilizing a platform to sell merchandise with a slur on it, repeatedly using a person’s sexual orientation in a derogatory way, sending targeted aggression towards an individual for years.. these all appear to be actions fueled by hatred to me.\n\nUnacceptable. Do better, @YouTube. https://t.co/dJTb43M65N @Casey challenge accepted. happy pride everyone! thanks for being you 👊🏻🌈♥ Pride month is not the ONLY time the LGBTQ+ community needs attention, aid, and policy reform. Minority communities are deserving of year-round support. This is hypocritical tokenism bullshit. https://t.co/l6Tc8kVAtC my trust issues have trust issues RT @heardwell: LOUD&amp;CLEAR: CREATORS FIGHTING FOR CHANGE 🌎💙\n\nWatch the New Episode here https://t.co/gOukLjw3ST\n\n#LOUDandCLEAR https://t.co/… @ardenrose BABE, thank you!! I love you. I miss you. Come home. just for fun 🕊 https://t.co/Qo4MrgehtJ @EnriqOmar im just thrilled to see so many people care too! girl, i checked the watch time.. viewers stuck around!! 😩💗 1 million views on my video purely about social good?? how lovely is that! im blown away by all the support this week, thank you ♥️♥️♥️ https://t.co/Fvc3aKjyyZ @IISuperwomanII thank you, love. happy to do my part ♥️ @CHAOTlCGAY @oliviawilde queer people galore, honey Saw Booksmart last night, and man oh man, I haven’t laughed that hard during a film in ages. An inclusive, female-driven story with radiant acting that's also absurdly entertaining? Go support it! Well done, @oliviawilde. minnesota minimals\n\n*on film, by me https://t.co/mVHOQavOy0 somebody has to say it..\nhttps://t.co/t2bDZNdAhn https://t.co/hTcQoUsT4s @JuliaBenitez11 omg.. the emojis.. i sense judgment @malibuonfire i hit pause on it actually and have been deeply involved with Schitt's Creek instead 🙃 @onlyfools avoiding the shit storm that the internet has been over the last week uh i also think this is the coolest thing ever?? https://t.co/zYOfwiv6nG https://t.co/59qAWFBdxS im pretty sure that is connor franta https://t.co/KG54v42M2Q The same applies for trans men and nonbinary people! Government officials should have no say in these unimaginably difficult, individual choices for ANYONE.\n\nAn attack on one person’s freedom is an attack everyone’s. REMEMBER THAT. Men and the government should NOT be allowed to make personal decisions for women. Especially ones used to restrict their rights, police their freedom and control their own bodies. PERIOD. https://t.co/zzwO1WFcYa she owns my whole heart 😰🥺 https://t.co/9cUdOWvPYn love you, mom ♥️ https://t.co/h8bfD0pN6H Detective Pikachu was SO much fun. Every moment of that film was laced with nostalgia, quick humor and glaringly adorable Pokémon. I’m full 🥺🥰🤓 right now. Looking at Dogs &amp; Crying for 10 Minutes\nhttps://t.co/ZW0U4S6Ov9\n\n🐶🥺♥️ https://t.co/qZzqvNWFXI @grandexdreamer my favs atm are: janelle monae, ezra miller, gaga, lizzo, billy porter, lena waithe, mister styles, jordan roth, zendaya, cody fern &amp; laverne cox a plain black tux at.. the met gala? not trying ain't cute, cowards. Nicholas Galitzine for V Magazine \nPhotographed in California\n\n*by yours truly https://t.co/iKHnjKjjUK 3 months of training. Averaged 7:13 per mile. Nearly 9 minutes better than my best time. I’m pretty proud to say the least 😇 What a damn thrill. My body aches, but I’m elated. 2 continents down, 5 to go! FINISHED THE LONDON MARATHON WITH A PR OF 3:12:27!! https://t.co/tx15qannJP i love you 3000 @taylorswift13 omg sweet sweet precious little boy i want a kimono. like, real bad. 🥺 RT @frantasdaddario: this is such a mood @connorfranta https://t.co/zWLmNzS6Kt @YTCreators hey sis what's poppin !! Hello again, YouTube 👋🏻♥\nhttps://t.co/egOPqABc4P https://t.co/7hj5uWMf08 big ty to angel boy @LukeFontana for taking these x 4 months of disciplined marathon training does wicked things to your body! a fair reminder though: i sure as hell don’t always look like this and that’s a-okay by me 👼🏻 might as well flaunt it while i have it https://t.co/GFaLo35wPt the big day is only one week away!! vitamin c and rest are my BEST friends https://t.co/Eu3kHUHFZR @dsnyemily not.. in the slightness. im seeing it the night before my marathon so that i can dissect it while im running for 3 hours. @herondalessia dunno but who cares! nothing can stop this fine ass mood! physically? she's fit!\nmentally? balanced as heck!\nproductivity? all boxes are checked!\nfulfillment? through the roof!\n\nwhat a time to be me https://t.co/EVcaJ8em1v i feel so GOOD this week. WOW. @hurtlikeheavens superb darling @ellessirhc she's thriving but i miss her @LautiiFigueroa ¡es verdad la reina tomará su corona! rihanna's next https://t.co/b1C2mTIy4F RT @heardwell: It's LIVE! Check out EP.1 of our series \"Loud &amp; Clear\" feat. @TheGabbieShow, @ImNotScottySire, @lifeaseva and hosted by @con… be kind to others, live sustainably, pet a pup, paint your nails, eat less meat, buy that croissant, call your representatives, lay in the grass, yes! you’ve got this!! @simonvsfoxes i already have, like, 12.. and they need friends.. my phone knows i was looking at plant websites earlier today bc now it keeps serving me ads for various NEW plants websites to browse.. enabler!! stop it! im too weak to handle these constant temptations 🥺🌱 @Madi_Ivie 1) oh...mfg\n\n2) not if i have anything to do about it @louvrely impossible to choose just one.. but.. https://t.co/sMuYGMJa5v @lastkissperry why would you have to explain to them who their president is.. ? so there you are.. in the year 2049.. explaining to your kids what vine was and why you still always quote it @simpIemistake https://t.co/iuZGgQmyaZ @youweremyspring im bella https://t.co/aHdvdG2o19 @ezrasnbhd jasper and alice were lowkey the cutest @queenleaross CRACK COFFEE?? @1997DlANA nah, team edward 🥴 @ezrasnbhd always honey my coffee had to have been laced with some type of crack this morning bc i felt like a twilight vampire sprinting around town today @sukanamparorang https://t.co/oSMSxTMFRv @bloomlipa SHES TRYING HER BEST, MORG @petalsbix how about i start with a dog first @foolishglee that’s... sarah... wow, fake https://t.co/35J0NtRQ4O thinking about you thinking about me @simpIemistake @GLSEN I think it was around 450? the solo 30 minute keynote I gave had me shaking in my boots !! Had the absolute pleasure of speaking at @GLSEN’s annual Washington State LGBTQ Youth Conference last weekend! Seeing all the bright and brilliant humans in attendance only further reminds me: the future is in good hands 👐🏻🏳️‍🌈 https://t.co/VIDs9qUpFX @PeteButtigieg lmao my heads lost in tomorrow and i keep forgetting to be here for today update: i ran 22 miles this morning! 22! and my body was surprisingly not dead afterwards either! wow, i feel powerful.. it’s time to celebrate with lots of pasta 💆🏻‍♂️🍝 https://t.co/45nUcpv7ZR @sassymaynard01 isn't that what it's for..? @idriscreen i appreciate you 💗 @jasminsivan when i finally get it together\n\n(((never))) years later and I still have reoccurring nightmares about being late to class or lost in the school hallways or forgetting to do a severely important homework assignment.. *yells WHY into the void* @metinthespring me to the demons chilling in my head @antonipml my podcasts won’t listen to themselves the red scarf emoji represents my internal desire to have said scarf in this moment\n\n..opportunities were missed *regretful sigh* 🙆🏻‍♂️🧣☁️ https://t.co/SogPidP8Qa @wallowsghc me and the opposite of me @juvesbreathin i just adore her omg https://t.co/zS0SerOZel love and be loved @KimPie314 @glaad ♥️♥️♥️ @jvn ♥️♥️☝🏻 when all my emotionally unstable friends and i get together https://t.co/uOYnXUPVkQ @willdarbyshire im ready @iknowsomeplaces confidence, fashion, kacey musgraves, hot sauce, acne studios, befriending strangers, sustainability, the great outdoors, stationary, doc martens, spontaneous laugher, pillow cuddling (lol), squash, dog watching, etc &amp; so on @jamescharles sister SERIOUSLY snapped @multayply just 5 today haha \n\nboy needs to cool down these legs after yesterday’s long run @eyeoutforseleno use my platform initiate change and my privilege to educate the ignorant.. i always try my best to do so already, but im now going try even harder @femangeI GRRAT\n*great\n\n..ugh, 🤦🏻‍♂️ @femangeI hope the eyelashes turn out grrat 💆🏼‍♀️ Shocked and speechless reading about the tragedy in Christchurch this morning.. it’s impossible for me to understand how hatred and violence that horrific even exists.\n\nMy heart is with the people of New Zealand and everyone in their Muslim communities. 💔 @MelissaarnaudAZ @stumptowncoffee uh idk if you’re kidding, but that sounds incredible rn and im close so.. consider me on my way 🤷🏻‍♂️🤷🏻‍♂️ 20 miles in New York City this morning!! im feeling a bit sickly from the lack of calories, so ispy a sweet stack of waffles with my name all over them 👀🍽💓 https://t.co/dLy6ci44H7 @heardwell claude monet @heardwell @caffeine 👏🏻👏🏻♥️ @loveyourselfu8 *mystery of love by sufjan stevens plays softly in the background* climbing more mountains, finding sweet scenes like this ! https://t.co/fOCUK3uQlO time moves too quickly nowadays @charlycox1 hey babe! thank you to all the amazing women in my life who make my day every day! you listen, you guide. you fight, you inspire. And i love each of you so so much. happy international women’s day ♥️ @shipsmyoxigen appreciate it 👊🏻♥ @tantrumtrench omg \n\n(but yes, no, not in a good way) anxiety blows let’s get drunk and make out @withhearts @ItsTylerYoung thanks bud!! my beautiful friends, part two\nwith Tyler Young 🌿\n\n*in Los Angeles by me https://t.co/SNxahiblhX @Masonmcpickle https://t.co/zcDcRsHfT6 @idriscreen i.. can't. like, all the sounds are so different. solange, jonas brothers, kehlani, carly rae, ben platt.. !!? deeply overwhelmed by all the new music that's out right now @analariosss https://t.co/IvYdyH1zXS @C0SMlCDREAMS thanks b 💗 @idriscreen mental stability and countless bowls of pasta @hoIybound uhh, let's see: today, i was going around 7:35 pace so roughly 2hrs 20mins I’ve been pretty bad at sharing marathon training updates so here’s one for ya:\n\nI did 18 miles this morning (my longest run yet) and felt confident, strong &amp; downright gazelle like every step of the way! all is well so far 👼🏻 https://t.co/BkPT4yU74I @shanedawson this! but with intense emphasis on the over analyzing and spiraling parts OLIVIA COLMAN this thread made my heart swell quite a bit 👇🏻💗 https://t.co/KBFfmEt4Bn @Tha_Randy_Man_ 💓💫💕💘💕✨💖 https://t.co/0V9DvVmANe @myangelbiersack mhmm but only a little bit! \n(too much sugar) @flyingsup oh come on now, participation is key here @cupcxkeharold brussels spouts, squash and carrots.. own. me. eat your veggies and be nice to people “My Mom Sent Me Cookies and I Cant Stop Eating Them” -a romantic comedy with a touch of drama, starring me (2019) @loobeeloou they may not be listening yet but we’ll keep yelling until they do @jasminsivan it's quickly become a deep passion of mine (both on and offline) so ya boy is happy to help!! This right here is IT, folks! All movements towards a greener future are crucially important! Live sustainability and we can save mother Earth 🌎💕 https://t.co/RPCDCKDXza happy love day, lovers ♥️ simple shit can be so hard to say @1999dobrik nothing hurts yet so incredible thus far! thanks for asking 😌 @troyestruth human interaction @multiplestan duh 🤪 @aidenstweetin nah, normally i go full chameleon just in case you were wondering how my week is going.. ive now worn the same outfit 3 days in a row @flyingsup @ardenrose sorrrry, i draft a billion tweets but end up never posting them bc 🤷🏻‍♂️ my beautiful friends, part one\nwith Arden Rose 🌹 \n\n*in Los Angeles by me https://t.co/NAa4boHqf7 @IovesoftIy and now it’s evenly spread across my entire body. powerful. @montresornjh yes!! mine’s 15lbs and i feel appropriately CRUSHED I impulse bought a weighted blanket the other night, and can I just say, it is hands down the BEST purchase my anxious ass has ever made. I’m calm. I’m warm. I’m secure. WOW. @_justQueenCC_ anything below 3:10 would be a dream im officially registered to run the 2019 London Marathon in April!! can’t kick the habit i guess 🤷🏻‍♂️🇬🇧 @jasminsivan uh odd choice to miss out on all this great, scientifically proven content.. but, lol like, okay https://t.co/uAu7mBuepo @TroyesToy where do i even begin @visualizesivan BAH room temp water is infinitely better than ice cold water, facts are facts @DavidDobrik i cried salt &amp; coconuts https://t.co/9wf9U0XYgb pull him closer\nkiss me slower @ardenrose well, shoot.. i knew we were soulmates @ardenrose uM.. ma’am.. is that HALLOUMI @Otteritch um woah where is this @niicesocks my goal is to de-stress the entire planet Jet lag has done me favors on this trip bc I’ve been up &amp; awake to see the sunrise every single morning.\n\nIt’s pure bliss, ladies. https://t.co/sSo0l8kXFs my dad is a living meme https://t.co/WpRMYLvhz5 a bit of a different perspective !\naisles and aisles of eye candy 🤤 https://t.co/8dGMw2ZPKa the supermarket i went to this morning was so carefully organized it gave. me. chills. like, how simple and vibrant? https://t.co/MajPPBxnfX bonjour de cette île paradisiaque https://t.co/DaaFLyxckm @Sierra36430807 Aw, I’m flattered! that’s one of my personal favorites from that book @lovelythebands some things never change #2009vs2019 https://t.co/ai0JqJ8Aie @iandavidmonroe ☆ britney, bitch ☆ p.1 of 2001 AMAs fantasy look https://t.co/cHgbyKC1Rz @beckoningbix mathematicians have my back as well @smalldreamsuga omfg.. you win \n\ncongratulations!! no offense but i just found the *perfect* pair of vintage jeans so my day is scientifically superior to yours @narryholdinitup Aw, I’m glad to hear it’s resonating with you! 💌 @alexdoestv thanks b!! appreciate the encouragement! ♥️ @allison_ptx you’ve gotta start somewhere! try 1 mile every day and work your way up :) @ItsTylerYoung come on, go for a jog with meeeee wow, my runner’s high was on another level today. i set out to run 3 miles and ended up going 13. \n\nFINE! I’ll sign up for another marathon 🤷🏻‍♂️🍃 https://t.co/k90iSHhGvn @bazzicult @BarryJenkins Roma\nThe Favourite\nHereditary\nEighth Grade\nWon’t You Be My Neighbor\n\n(just to name a few) If you have yet to see ‘If Beale Street Could Talk’, I cannot recommend enough you go this weekend.\n\nThe entire cast flourished (especially Kiki Layne), the score was hypnotizing and every visual left me breathless.\n\n@BarryJenkins, you’ve done it again. Wow. https://t.co/KtWfUvoqBT @beaufranta sublime, couldn’t ask for a better day one @__ixavier there are... other things ? @hcartfelt not fully certain yet! im going to brainstorm and write them all down in my notebook tomorrow morning :) also, this is a bit late because i.. uh.. had far too much fun last night. 2019! weeee! happy new year everyone! im overflowing with love and couldn’t be more ready for this clean slate! here we go ✌🏻♥️🥂 In summary: im gooooood, sis. And I wish this level of positive self-progression on anybody else who wants it. No shade, only tea. I fucked with myself for far too long to compliantly allow anyone else fuck with me now, okay? If that somehow makes me a villain in your eyes, then ✌🏻honey it’s been real. The exit is down the hall and to the right. The last 4 years of my life have been quietly dedicated to becoming healthy, strong, fulfilled, enlightened and ultimately, the best version of myself im capable of being. And I’m SO proud of the progressive I’ve been able to make. As a person coping with depression, anxiety, and at it’s worst, suicidal thoughts for my entire adult life, I refuse to be brought down by unwarranted outside influences when most days are already an internal fight to keep my head above water. My choices have everything to do with me and nothing to do with you. warm bottled wines and general store liquor / i swear that im fine but ive never been sicker Hi Twitter. This is my dad. He planted a few Christmas trees in his garden 10 years ago and this is the first one he gets to use!! It’s a bit big and a little wonky, but he’s super proud of it 😊🎄 https://t.co/xOMMfU19em heartfelt, he makes my heart melt @noodlevmin 2018 @IlmaSmile i brought 3 cameras (yes, im ridiculous) so expect more in the coming days ! @flickrirwin hell yeah, s/o to all the sheep hiked up a big ol’ mountain\nin Wales this morning! https://t.co/G5JjUmNghk New Video / https://t.co/LzRdU5Wuvh\n\n*on 'Exposing Celebrities &amp; Cancel Culture' https://t.co/61nKB2pOFi @willdarbyshire nah i was just late to breakfast again. predictable, typical. 😪 even when i set myself up to be impossibly early, i somehow always manage to be late Alec Benjamin in Silver Lake 📌🏜\n\n*by me, on film https://t.co/gyoVdBeAgA @ItsTylerYoung give us fans what we want i still have people come up to me nearly every day (today, it was a flight attendant) and tell me this video helped them.. it never gets old hearing your stories! they leave me a teary-eyed mess every damn time!! my coming out video is only 4 years old???\nwow.. this moment feels like a lifetime ago\n\nhappy gayiversary to me ❤️💛💚💙💜 https://t.co/DeLusw6gcE @verde_cian aw that’s sweet. im around and loving life! ☺️ hiii from miami\nmama atlantic is serving looks https://t.co/Hf7IYte1P6 @17PLUMS it's an excerpt from our future history books @trenchtroye i thought it looked weird and felt self conscious about it tbh zoom in for a surprise https://t.co/E6aHIjVcsv on 'Assuming Someone is Gay' \nhttps://t.co/a3c2XdWMZH\n\n*a chat sparked by a Shawn Mendes x Rolling Stone interview https://t.co/6ybopxoyKL i finally found myself again *clink clink* beach https://t.co/9ubEB2wkS9 new video / i've been faking it this whole time\nhttps://t.co/PidA2kNj35\n\n*a chat about confidence &amp; uncertainty https://t.co/AJUGTwkpEh im a simple gay.\n\ni hear frank ocean made his instagram public.\n\ni follow. i happy. loners &amp; landscapes\n\n*on film by me https://t.co/AfOSSElZCG @heardwell @commonculture woah @loogiya don’t die but i saw it thinking about the 12 victims of the thousand oaks shooting. thinking about the thousands of people and animals currently being affected by the california wild fires. thinking about the family in my hometown who suddenly lost their 26 year old daughter yesterday. just thinking. https://t.co/GPl9v9Ot9O Change is happening and progress is being made!\nLet's celebrate these massive wins tonight ❤️\n\nIlhan Omar &amp; Rashida Tlaib / 1st Muslim women elected to Congress\nJared Polis / 1st openly gay person elected as Governor\nSharice Davids / 1st Native American woman elected to Congress https://t.co/89smvLhMM3 i voted!! hope you did too! https://t.co/xLgjZP2V2L new video | let's get candid https://t.co/IgSND2bq7J\n\n*pls enjoy my hungover ramblings https://t.co/oWAbsECJOo *cc Mobolaji Dawodu / ty for your advances in art, science and culture here on this day the stylist for Ezra Miller's new gq shoot deserves a nobel peace prize https://t.co/XyCK61GUFv ugh fine i’ll be happy\nBUT ONLY THIS ONE TIME @naureennashid thank you sweetie darling honey booboo love muffin bb!!! @httpzerkaa idk do you see who it's up with!! i feel small and inadequate but alright ok i'll werk this!! um my first book is somehow up for good read's best book of the decade??? pardon my new york times best selling vernacular but that's fucking unreal WOW https://t.co/9TTefSPO16 Tonight, I was honored to be first LGBTQ recipient of my hometown’s Wall of Excellence award! I gave a speech about the importance of inclusion and donated a whole section of Queer Literature to my old high school’s library to celebrate 🏳️‍🌈♥️ https://t.co/urk6Nq85KM if you’ve ever wanted a glimpse into my creative process, now you can! i partnered with @SamsungMobileUS to give you a behind the scenes look in my new episode of /make! watch here https://t.co/xjcXvLxy4b\n\n*all captured #withGalaxy S9+ 👊🏻💛 https://t.co/uKOG97gJec sup punks https://t.co/jBu7xEP4Va ATTENTION IDIOTS: stop killing our planet\nhttps://t.co/np9VjdXYOj\n\na serious video, by serious me https://t.co/YOKqHvUfMC @nightvocals i feel like a new person 😭 don’t ask me how my closet got that bad.. just focus on what it looks like now!! https://t.co/0uVxevD7PM @ItsTylerYoung @BoysByGirls thx b!! how cute would it be if our pages were next to each other 🤭 me for issue fourteen of @boysbygirls magazine, by amber mckee https://t.co/1oUeLCdLHx @justabitofjacob fine you’ll run the next one with me 👀 @multayply yup! i already started jogging again yesterday bc i missed it so much 😇😬 How I Ran A Marathon | https://t.co/rvSlMVcimm\na lengthy chat about my race, the process and far too many feelings\n\nenjoy! x https://t.co/IJZfAFUo5S part of me wants to get ice cream \n\npart of me wants to sell everything i own, adopt a dog, retreat into the woods, grow a garden, take up yoga, become a beekeeper, knit a sweater and just call it a day Harry Houdini really put the dab in abracadabra RT @Jordan_Coombe: \"It's just one straw, it's just one disposable cup, it's just one plastic bag\" - 7.4 billion people. https://t.co/8BKFxG… a pleasant #WorldMentalHealthDay reminder to take care of yourself. We nourish our muscles and bones. We pamper our skin, teeth and hair. Don’t forget about your mind! It needs love and attention too! If you’re struggling at all, please talk to someone about it. It helps a lot 💛 i love my family so much tf @brgtbrwn woohoo well done! @ilIuminated today is about making sure everyone is registered! text https://t.co/6Zlap76SQz to everyone 18&amp;older (maybe start with your family) and remind them it only takes 2 minutes + it means a whole lot to you 😊😊 @dklalexis that's fine! text everyone you know that's 18 or older and remind them! Your to-do list for today:\n1. Make sure you’re registered to vote\n2. Text your family + friends and make sure they're registered to vote\n3. That's it! You're done! It's easy and it's your last chance!\n\n✨✨ https://t.co/6Zlap76SQz ✨✨ https://t.co/BMSqXtgEDZ @kensisdeeks @NicolaFranta this meme was literally my parents the whole race omg i love them sm @live_love_troye @NicolaFranta im a bit much \n\nwe’re all friends, we can be honest @multayply @NicolaFranta my whole body (just my legs) hurts pls send help @RickyPDillon @NicolaFranta Tails is better\n\nthere i said it this is the moment we first saw all our family+friends during the marathon and our reactions are just priceless https://t.co/u3hQbgV61n FINISHED MY FIRST MARATHON IN 3:20.59!! https://t.co/mljwKtaUo9 RT @YTCreators: #CreatorsforChange Ambassador @connorfranta is running a marathon to raise money for @GLSEN, an organization that supports… @ardenrose love you!! runaway’s done running away\n\nty for all the love on my short film!! all your donations will do so much good for the lgbtq+ community https://t.co/02apXOG6We 💕 https://t.co/dGpnK61viA @HanHaynes_ both in collaboration with @Timtothewild! coincidence? I THINK NOT. No Time to Run Away | A Short Film https://t.co/02apXOG6We\n\nThis is a project about mental health &amp; personal identity I've been wanting to make for years. I'm thrilled it's finally real and more than I ever imagined it could be! Hope you like it x\n\n#CreatorsforChange https://t.co/1D0ZNzMk0U heads up all: im uploading a special video this friday that im genuinely so proud of. i got chills finishing the edit this morning.. can't wait for you to see it 💛 i know im not perfect but we were @MrLaReeRee @CTMarathon ty for the encouragement! congrats on your first race 💛 @reveIation mmhm- banana, oat &amp; almond butter 👼🏻 im running a marathon exactly one week from today!!! excuse me while i go bake cookies to avoid thinking about all the anxieties that are beginning to build up https://t.co/EpoVEczaUd a walk through kenya’s\nwelcoming countryside \n\n*on film, by me https://t.co/8HcJTberOH I see you. I hear you. I stand with you. And I want to remind you that you matter. Stop revictimizing victims.\nListen to all survivors who speak up.\nAcknowledge every ounce of bravery that act takes.\nBelieve them.\nBelieve them.\nBelieve them. @beaufranta @metowe @WEMovement just there to lend a hand and to see all the wonderful work WE is doing! :) Here are a few shots from my trip to Kenya: a week overflowing with kindness, education, conversation and so much love. I’m forever changed by this unforgettable experience. Asante sana, @metowe | photos by Luke Clarridge https://t.co/tAeMjzzgS3 @CaseyNeistat don’t you go and play with my heart neistat!! @CaseyNeistat in a word: yes 21 miles and my last long run before marathon day = complete!! and i felt light and confident the whole way too! can’t wait to do the damn thing already 🏃🏻‍♂️🔥 https://t.co/6FZU34HIWI kindness brightens every darkness @beaufranta sweetie idk how to break it to you but.. that's a chicken @validatetroye hi cody 👋🏻 @holofranta stunning jungle queen 15/10 @Iightisgrande she's an old lady who enjoys her privacy he’s such a sweet boy 😩 https://t.co/JUzzS9okoT @willdarbyshire why are you like this @togethxrgarrix quiet perfection 💆🏻‍♂️💆🏻‍♂️ @1997DlANA read my book and ate cake!! 😩👌🏻 thank you for all the warmth and kindness today!! feeling nothing but loved! i appreciate you guys so so much ❤️❤️🍰 birthday boy ! https://t.co/3kEv1aOu4v @shuthebook sh im 👵🏻 all the bts boys have really incredible style. like, every other day i find myself in private investigator mode searching the internet for where exactly one of their outfits is from 🕵🏻🕵🏻 weddings 🥂🍃 https://t.co/OGEJBUjl7S bright sun has me squinting https://t.co/TIfQGRr7CA the updates continue: i ran 20 miles this morning! 20! and it was up along the coast in Portugal!! a vida pode ser louca mas é linda 🤲🏻🇵🇹 https://t.co/yRVoln7K3n @FlavianaMatata we drove along the border while on safari yesterday if that counts!! jambo from kenya 🦓🌾 https://t.co/DHsOEu9JtF @wickedoverpass you do too!! @herondalessia jetlaggeddd 🧚🏻‍♂️🌀 hi i love you @middlegrier @commonculture @heardwell done! @upsinceyouleft @commonculture @heardwell me queen 💁🏻‍♀️💁🏻‍♀️ GUYS!! Common Culture VIII is officially out worldwide! Grab a copy, support emerging musicians and tweet me which you’re feeling the most https://t.co/sOxM3yWs0j x https://t.co/1Bcr6rMqAH @olivia_mae07 💛💛💛 when i deleted my twitter app last week, my dumbass forgot all my saved drafts would go with it!! RIP to dozens of melodramatic thoughts and all the shade i was too afraid to throw 🤘🏻😩😩😖 @breathindua https://t.co/YOvc1UETOA @easeftbroods BUT.. they could have been something 😢 @arunkarra_ you’re apart of the problem you rat!! @IlmaSmile some hoe inconvenienced me @abbiepambourr apparently it's cinderella @Miss_Benny i can't.. unsee me a lost photo of me in drag https://t.co/95ihIPz4Dr RT @WilliamsSonoma: Here's our 2018 #WSNoKidHungry collection! 15 celebrity-designed spatulas to raise money for @nokidhungry's campaign to… fyi: i took up rock climbing recently so in a few months when i build up my strength and im physically able to climb out of all my emotional pits.. its over for you hoes me: i wonder what’s going to kill me first? the chemicals i rub on my body every time i shower, the pesticides they spray on the food i eat every day or the radiation that’s coming out of my phone right now\n\nthem: sir this is a Starbucks drive thru cute training update here: i finished a 16 mile run this morning which i believe is the furthest ive ever run in my life!! and now i have 3 massive pancakes in my tummy to celebrate 🥇🥞 https://t.co/jSCwCPR70X @lumoshoying @1997DlANA marathon preparation actually can take 3-4 months! and typically people run up to 22 miles while training for the big 26.2 🏃🏻🥇 @1997DlANA oh that's still months away but thank you! @onlyangelics im running my longest run yet tomorrow so i mean it when i say i needed this tweet rn. thank you. you a star. @fantastictroyes OOoo! here are the last three ive read and really enjoyed: Origin Story: A Big History of Everything by David Christian, Everything Happens for a Reason: And Other Lies I've Loved by Kate Bowler, &amp; The Girls by Emma Cline @jasminsivan yes!!! @ripleychasee if myself counts as a secret project then yes i have https://t.co/wZFzxmORUG @lightersancandy tell your grandma connor says hi 👋🏻 @rainingfranta it's a cute word! \n\n(and i made hummus today) @movedaIong honestly quit bragging and bring me to your timezone hello chickpeas how are ya 🤸🏻‍♂️🌞 the gay godfather (2018) https://t.co/zciMQ3LSZV @laneboyfranta every time ryan gosling and rachel mcadams are on screen together @drivinatninety it might be a clichè but ugh.. i fucking love that movie i watched 'the notebook' on tv last night by myself and i have this weird desire to watch it again tonight..\n\neither im sad or im very unhappy hi guys!! @GLSEN is holding a contest to win a coffee date with *yours truly* in here Los Angeles\n\nall entry donations go towards the super important work they do for LGBTQ+ kids in schools across America! learn more here https://t.co/ls2lT4WUGi 💛☕️ https://t.co/Ke5JfkTbFt New shoot for @papermagazine x\nphotographed a few beautiful humans\nat Beautycon Los Angeles https://t.co/zdZHrCSynD @adoredtruly @itsbigtee @Harry_Styles you.. you really know me 😢\n\ntv play all stars 3 episode 1 @itsbigtee @Harry_Styles I PLAN MINUTES INTO THE FUTURE AND HAVE THE ATTENTION SPAN OF A CASHEW @AlexaFluffy16 @Harry_Styles ((im already on my second listen)) @fadeswithtime @Harry_Styles dont kick me when im down wow fully regretting not getting tickets to see @harry_styles perform tonight\n\nim so sad alexa play from the dining table things im good at:\n1.\n2.\n3.\n4.\n5.\n6. practicing my order at a restaurant 57x times in my head and still messing it up when i try to tell the server @Iostinmahone happy day! so glad you're being you! ✨ @hesclickbait im reading a book about the history of the universe and honestly rn.. i'm wondering the same thing!!! 13.7 billion years and somehow this! what! @heavenrih the MOST appropriate gif! the sun was setting at the beach in front of me, so hey, she's feeling that natural glow 👀🍊 orange slices https://t.co/RYWQH05TBQ i want to do more, i want to be more it’s all about love, love for others and love for yourself @introsbutera stop hahaha from the beaches in malibu\nto the streets in london \n\n*on film, by me https://t.co/R12ytKztiE @Ietstopmybaby  https://t.co/GHxPzyHOuE @jessiepaege get outta here! some type of fate! congratulations on being you, today’s so special 🌈💘 @joshuateal we only hire by salary at\nConnor Franta inc®️\n\nexpect benefits @Iuckstrikes WHAT KIND @prideparades now that’s love 😢 can i pay you to yell this at me a few times a day https://t.co/4H0UDfQtQ9 i walked in on my house being robbed\nhttps://t.co/1YIjXQCg4p https://t.co/JhcprQbl41 🏳️ https://t.co/jSkhg13jhE RT @heardwell: It's Here! Pride is now available on @iTunes with all proceeds benefiting @GLSEN. Check out some of these trailblazing artis… @garciamelissaa aw thank you, mel! @frantadolans happy for you 💛 @loobeeloou i am!! more to come on that soon @uItralife im.. competitive af @stateofkook i'll take all the positivity and kinda encouragement i can get! 🌞🌞 @hurtingher not to freak you out but ive never ran with headphones in my life! i like being present and/or letting my mind wander while i wander, ya know? neat update here: i am officially registered to run my\nfirst marathon this october in minnesota!! 🔥🔥👟 https://t.co/urhdLBDgc4 a soul soaked in honey @AndreaRussett appreciate this ♥️ palm springs https://t.co/vsljB9d2ek A few days ago, I came home to find my glass door broken and a burglar right in front of me inside my house. I’m not hurt.. just really shaken up and violated by the whole thing. @mypaleskinblog you’re FAR too kind 🙇🏻‍♂️🙆🏻‍♂️💋 @kindaloved yeah sure why not @VLOGGlNG omg i just spent over an hour trying to explain “wig” and other gay slang to a few straight friends.. ‘twas RIVETING sup 🏁 https://t.co/dh2imUGDiy @polaroidpml ♥️💋 i feel lonely even when\nsomebody’s close to me @girlsbix i was going for more of a wowEE! 🤠\n\nyou know? happy pride everyone! a whole month dedicated to individuality and humanity’s spectrum wowee! the world is so lucky to see you being your youest you ❤️🧡💛💚💙💜 im so good at putting things off until the very last minute and still getting them done like wow i impress myself @lovelessdan i suffer for the lewk, darling https://t.co/MYUYHXuPNi @moyojadekadri just downed an iced coffee\ndoes that count? 🤠 @hisblacksoul little vintage shop in LA 😌 it’s... 95° https://t.co/o3157lAzlw fully melting over the new @ShawnMendes album.. so smooth, so much soul on every track. bravo, prince! 💐♥️ *photo creds to my mom https://t.co/xRQ3CWObHq @bloomsforsivan nothing! but also everything! @idriscreen well reading this makes me even happier ! being happy for no reason might\njust be the best type of happy barefoot through the cherry gardens\ni stop to turn and stare at him new video // reacting to my childhood photography..\nhttps://t.co/qppdl0XJHp https://t.co/fJIzkurtLf i need to find the bon to my pon 😩 https://t.co/PssGH2y9qb a kind reminder that every human is a person. your parents, your teachers, every waitress, every stranger on the train, the homeless man on the sidewalk.. all people. treat everyone with warmth and be equally respectful to them all. thank you x @disneyflicker half a decade?! honey, i got ya 🍯💫 @filthymisbehave honestly..   ʸᵉᵃʰ ᶦ ʳᵉᵃˡˡʸ ᵈᵒ @IovesoftIy wait.. aw @bIoomly @xosivan  https://t.co/VWX0F8memD @xosivan @frantaphil im a damn mess, we've been through this @madeinmaIibu they were in full wave today!! @xosivan this question if far to complex for me to even begin to answer in a single tweet classic like helvetica https://t.co/Gtf0Pk7P2a ya boy won an award tonight!! shout out to all who voted and to my stunning friends for being my dates @BritLGBTAwards 💛🥂 https://t.co/3O9FJ8J10X i feel like im getting better at film photography!\na few recent shots from my travels 🌿👕📮 https://t.co/HAnfKLq2CW @ripleychasee darling, we copy &amp; paste away our mistakes in this home just pulled my clothes outta the dryer and realized i may not have put detergent in while washing so i smelled them (to check for ick) and still couldnt. tell. SO either the laundry industry has been scamming us all for decades OR im a forgetful idiot and this tweet is pointless! men at the met gala need to 1) step it up or b) not attend!! new video // talking about things i never talk about..\nhttps://t.co/Ov5Ubjc61N https://t.co/YwnsEI8uw0 @itsonIyright bakin’ scones! havin’ fun! you? i can’t stop watching the new childish gambino video!! donald’s artistic pov is so raw and beautifully unorthodox.. mans a visionary seeing infinity war again because im emotionally destructive and obviously feel like crying @mymymy_planta one day i think i'll run one with all my siblings\nimagine all of us together \nbein' all cute n shit\naw @IoveIoveh exactly!! now i’m committed 🏃🏼‍♂️🥇 @iiSandersii idk idk marathon me i'm going to run a marathon this year ispy bullshit @conangray i mean i’ll gladly take the title now @justliketini THATS WHAT I KEEP SAYIN i’ve nearly reached my full form: guncle https://t.co/2Ljz1fUoTv we’re always focusing on all these little things that don’t even matter @lilacdaddario never, darling ho.. ly shit. Avengers Infinity War was phenomenal. hands down the best superhero film ive ever seen. just.. wow. @arunkarra_  https://t.co/P73vz202k9 you have two daughters, a transgender parent-in-law and an extended family filled with strong woman. your “independent thoughts” support a man who is actively against all of them. you might want to rethink who you give your love to. https://t.co/HbHH0kqheK RT @arunkarra_: me after the smallest inconvenience https://t.co/TuNNrlOzpg @wisdom_dumm debatably the most important @troyestruth an unreal a cheese focaccia 🤭😩 this tweet was about eating bread https://t.co/SbIZSg9hG2 sometimes you gotta do what’s right in the moment even if it’s wrong in the long run im too hard on myself @leavemeinblue @WEMovement i am amazon https://t.co/cAn4g9Dvby spoke to 15,000 beaming, young faces today about the importance of love, acceptance + inclusion!! i feel like i snuck a peek into the future and let me just say, it’s in good hands #WEday https://t.co/Bix3batdrO @itsonIyright she got bangs long walks are just the greatest\n \nit’s like my brain had a glass of water and the world got a new haircut\n\nthank you walks!! A Little Nostalgia For You\nhttps://t.co/XpBcVjnAu5\nxx https://t.co/0uOY0cEax5 ☀️✨ https://t.co/eWY3TTTHqZ @shanedawson  https://t.co/9IZmSNlQ6V my horrible day by connor franta\n\npart 1: the wind blew a cup of coffee over onto my laptop\n\npart 2: the wind blew a tree over onto the electrical lines that were powering the fan that i was using to dry my laptop\n\npart 3: the wind blew sadness into my heart \n\nthe end 😢 happy #NationalPetDay\ni miss my lil buddy heaps https://t.co/iEX5JruTrr @fellmoreinlove GENUINELY new video // why i haven't eaten meat in 2 years.. \nhttps://t.co/UIVnBJmL4X https://t.co/aKECNz4SIp @Timtothewild you've done it again! the sound was particularly mesmerizing on this one buddy 🔮⚡️ everything feels right when you’re around where is the album! release the damn album! https://t.co/ecDaFV2iWg some lady in my workout class fully assumed me and a random man next to me were father + son bonding this morning.. she then proceeded to point and yell \"aw isnt this just precious!\" at us... two complete strangers https://t.co/gTT9WefyZu @rocketfueIs you do not take that cute little bunny for cute little walks every cute little day https://t.co/ngqKZo6OP4 @lovesiickfranta wish granted 🧞‍♂️ @carisiagallegos this is precious wow @idriscreen  https://t.co/S1StGvqvoc new video // comparing yourself to others.. \nhttps://t.co/WSRXdoido6 https://t.co/o6YkEhFbCC @frantamalfoy no stress it has walnuts 👌🏻 im making vegan banana bread 👨🏻‍🍳🍌 https://t.co/0jfkL9WxXk @fazedme @kennethcole BICOASTAL BUSINESS BOY @_TiffanyTran_ @kennethcole its the filter bb, probs coffee stained irl 🤠 @stanxbands @kennethcole feeling like the sun today 🌞🌞🌞 how cool is this!! \n\n@kennethcole #thecourageousclass https://t.co/8mhyZWYbXN @willdarbyshire IM A PROUD MOM @Iovedafter that’s the dream!! first time in vogue baby!! 👋🏻💋 https://t.co/jyeShrbwGO @stigmafranta drinking a la croix, watching the incredibles.. truly cant complain 👶🏻 @yamifranta @lovesiickfranta that tweet burnt my tongue @lovesiickfranta o\n\n    m\n\n                       G Enough is Enough. #MarchForOurLives https://t.co/jIwHUXBhnA @KeiynanLonsdale we are moving this SERIOUS convo to tEXT @84jug I WANT TO BE THERE 😭 @wildheartsivan that's the dream time right there !! can somebody go to tokyo with me pleaseeee @ardenrose @InterviewMag @KezibanBarry BABE 😌😚 🕊🌿 https://t.co/aV8jHLWkyk @ShawnMendes @Spotify my level of excitement is irresponsibly high rn there's something different about you @frantalilac i got cha love 💗 @lightestkisses @stripfranta the people, hands down @yellowishfranta mama needs a solid break first but MHMM @thoroughFranta just did 🤓 @stripfranta i love this city so so much. lowkey need to move here. @suburbiadaze pretty run down atm but i plan on sleeping for 12 hours again tonight so hopefully that’ll help! @godhatesme_too thanks hun 💫🧚🏻‍♂️ im back in new york and just wrapped photographing the coolest group of LGBTQ+ people for a big billboard campaign!! man 2018 is pretty great ah!! RT @InterviewMag: LGBTQ+ activist and YouTube sensation @connorfranta sat down with top model and founder of the Flaviana Matata Foundation… RT @kennethcole: #TheCourageousClass members @connorfranta and @flavianamatata know how to step up their spring style. https://t.co/s1rNqMU… 911? yeah hi i’d like to report a case of identity theft https://t.co/YHGOQCTDiZ @elyahm omg @__ixavier one time i was running in the park and an old man was so convinced i was ‘the good doctor’ he would not let me pass so... i said ‘yeah fine ya got me’ and took a pic 🤷🏻‍♂️ @MattMMcLain sadly im not so sorry love, been all over the place lately.. try to get one up friday or next monday for sure 🤲🏻💫 @savvyfizzy hell yea sis but my legs hurt from all the walking!! @MADElNMALlBU green on patches on patches on green! a shy hi from amsterdam 👋🏻❤️ https://t.co/Myvajr95sx @peachfooIs @UrbanOutfitters @heardwell @commonculture IM SORRY BAH yooo all my favorite cc compilation songs are now pressed on vinyl!! grab one of the super cute + limited copies here | https://t.co/mrpHZ3EK40 💐🎶 https://t.co/vCds3RUX7r @Dan_Baynham95 had the opportunity to speak to 12,000 kids about lgbtq things today 🌈✨ @ali_cool400 ive been using this coffee, sea salt, coconut oil (yeah yeah i knOW) exfoliator recently and its doing wonders for me ☺️🤫 touched down in london town ✰✰✰ https://t.co/gttTwHRmK4 RT @WEMovement: 'Stand up and speak out. Be a part of the change you wish the world to embrace!' @connorfranta tells #WEgeneration. 'The wo… @foolsfallsivan and tom and mahershala and lupita and armie and emily and and and i keep yelling ‘SNACK!’ at my tv\nwhat is wrong with me every night fucks every day up\nevery day patches the night up super excited to rep the lgbtq+ community as a face of the new @kennethcole campaign!! loud and proud, baby. loud and proud. #thecourageousclass 💗✊🏻💗 https://t.co/iCLsapyvEF @fellmoreinlove @heardtroye @gqvinconnors @hisgoodside oh course! have a good one 🥂💫 @divedillon oh hey 🤠 @CaseyNeistat oh damn it's crystal wow @abstractIawley the humidity bring them out 🌀 happy in hawaii https://t.co/80OaNFpCEp RT @LOfficielUSA: The @CalvinKlein x #AndyWarhol collection, captured by @connorfranta: https://t.co/1HQTczo3MX https://t.co/m3wYv6bRj0 i photographed the calvin klein x andy warhol collection for @lofficielusa magazine and it’s on newsstands everywhere today! such an honor!! 😙♥️ https://t.co/5sM46UtRaQ @frantasguac she sneakily moved into my top fav colors !! @lovelessdolans tysm @heyitsbreen no problem 🧚🏻‍♀️ last four photos from my insta // idk really into their collective vibe 🌿🍯 lush honey ~ https://t.co/K41GiEFsYF new video | https://t.co/JMBOEtfbQo | let's take a deep dive into this year's oscar nominated films shall we 🤭🎬‼️ https://t.co/2RwbrZq49R @dodieftoakley ohhhh shit we in canada !! @JenIsArtsy @commonculture so good jen, love your style 👩‍🎨💛 RT @BarackObama: Young people have helped lead all our great movements. How inspiring to see it again in so many smart, fearless students s… he speaks and my heart flies im having a meet &amp; greet in Los Angeles this thursday to celebrate the drop of my new clothes and would really love to see you there ♥️🚩 https://t.co/jKv1o5Uggl new clothing collection\nfor urban outfitters \navailable today  \nxx\n\nshop here | https://t.co/76gyvv0O1z https://t.co/c2Eo8jiiNF new video | feelin' cute + answering your cute questions | https://t.co/lCV6p8mSHT 😘😘 https://t.co/9S4CijMXKf our generation is going to save the world RT @MichaelSkolnik: Emma Gonzalez. A student at Marjory Stoneman Douglas High School. \n\nAn American Hero. \n\nWatch This. \n\nAll of it. \n\nThe… @appIejuice i knew i shoulda worn a cute apron 😪 @em333ly aw that's so great! do me a favor and dm me your address? i'll send over a pair of shoes + a few things for marely 😌💛 @em333ly hey emely! would love to support marely and buy a pair of her art if possible. she's so talented!! 👩‍🎨🔥👟 my clothes are in 50 stores | https://t.co/Jc3Zh9imYw\nhaul + explanation + general excitement!! 💓💓💓 https://t.co/3InjfRRQ6U still thinking about this night tbh https://t.co/PIdpCQEfUa I don’t know much about guns but I do know there have been 18 school shootings this year in the US and that’s absolutely horrifying. Everyone can agree that’s not right. Everyone can agree that number should be 0. Nothing will change unless changes are made to the current system. https://t.co/l3uHmZxoBD [ insert the fire emoji here i suppose ] https://t.co/bndfyMyEFq @michaelxanqelo kinda odd to think that book was, at one point, in my hands and now it's wherever in the world where you are right this second 🧐🧐🤭 @feeIingIove aw no isa don't be sad ! sup new york 🍓🍓👦🏻 https://t.co/ExvE1lOZOE a person to do everything with and tell everything to would be nice @elaine_elaine8 DAW CUTE PRECIOUS LITTLE ONES @upintheislands yet another reason why i get along with everyones mom @commonIove this is my weekly reaction so do what you want with that information !! @alrightvisual WHATS YOUR POINT ‘this is us’ ruins me week after week https://t.co/KjcSOUEp4Z my parents saw ‘call me by your name’ on their date night tonight and both just texted me how much they loved it\n\ncan you BELIEVE i was raised by adorable legends AND the gay agenda is thriving?? https://t.co/VBUrZnttiY @Peoplesbeloved have i been cloned wtf @84jug ah!! now i just need to get the real me there 🤭😩 i photographed myself and wrote a little piece on self-love for @papermagazine // https://t.co/5laf1Z2V9O 💌🍒💬 https://t.co/v8zpIgngl1 @puregoldwings weird bc the only thing i do is cry in front of my friends @mydeartro @GordonRamsay roast me @/king 🥞🤟🏻 yeah sex is cool but have you ever laughed with your friends until you cried about something no one else would ever understand new video | things im changing about myself | https://t.co/gVvQUOoLVR | really adore how this one turned out! show it some love ❤️❤️ https://t.co/CBoRbytNQu @gomi_show remember when i wrote an entire book chapter about mY HAND @sivanspaege just my phone 😇 @feeIingIove i have a pikachu on my back?? there's irony in there somewhere today’s walk aesthetics https://t.co/TdlsKLHdPG @louispeaceful wish granted 🧚‍♀️💫 @justliketini aw izzy RT @them: We talked to @connorfranta about growing up, being emotional, and the importance of validation. https://t.co/cSwUQQ5m9y @jaqcuesadit that’s how im feelin!!! wow thank you!! 💋♥️♥️ https://t.co/eMXJ649iAU @onthistreasure @Gap babe i simply cannot !! so so happy to announce ya boys a part of the new #GapLogoRemix campaign!! im in good company, wearing vintage @gap clothes! my heart is warm ❤️❤️❤️ #ad https://t.co/cXlN50uQ5u he’s so cute and he doesn’t even know it @brielarson its.. its a hamster kangaroo elephant bunny 🤭 so much love to all who attended a Women's March today!! ✊🏻✊🏼✊🏽✊🏾✊🏿❤️ @RickyPDillon i saw your liTerAL doppelganger while out for a walk today and it was fucking weird and im still convinced it was you with red hair having a serious conversation with what appeared to be a girlfriend ! !! my cares are nestled amongst all the right things lately \nno time gifted to the bad, no rooms made vacant any longer @AnselElgort bleh sadly i didn’t catch it but rihanna was on before you so clearly the mystery station has taste @ladbible go for it bud 👻 new video | a few current clothes and looks | https://t.co/cVNELjHiUP enjoy 🙆🏻‍♂️❤️ https://t.co/HDCpgNsiwC @AnselElgort um i just heard you on the radio in nyc wtf!! the new songs so good 👊🏻🔥 @Isilovestroye less than a month 🤭🤫 @todayfranta always a wonder. im jetlagged af tho so i feel like im floatin around the city 🙃🙃🌀 @justliketini ty!! it’s so surreal so im in New York rn and i just finished photographing models for a big fashion magazine! that’s a first for me!!! @macknorth2587 thanks hun!! 👦🏻👦🏻 au revoir ma chérie https://t.co/6oSVh8ZdoH i met satan today https://t.co/YmNvO53lFe @arunkarra_ @justabitofjacob @willdarbyshire @MattrKing we covered him in tide pods and an ironing board! TIDE poDS and aN IROning BOARd!!!! https://t.co/xgMYqCdsAp @justabitofjacob @willdarbyshire @MattrKing 5 alarms ‼️‼️‼️ https://t.co/MpiIMOS24g @doddleoddle it’s amazing right?? beyond yummy @shatteringlove i been sleep oh shit hey https://t.co/JTlIl2x21E new video | the old me | https://t.co/SNUY1SVrpZ | its a new year and i couldnt be happier 🙆🏼‍♂️🌵☀️ https://t.co/Rylmp7RArG hiked a mountain in f’in France today!! we got hell lost but it was a good time ☃️🇫🇷 https://t.co/cbimSamFmP i dyed my hair weee 👻👻 https://t.co/3qXwX4CaYN @consivanqueen  https://t.co/uMNT0xs5sv @AngelusLies the cold then the hot and now back to the cold again tomorrow ✈️✈️ @emilysheIdon hi im here miss no longer 👋🏻🌿 @thisIoving is that last one a dark blue? im feeling a dark blue @sincerelyjena aw babe @sequinstroye such a thrill!! the pilot man let me fly it for a minute too 👀 @BenJPierce 2500 ft!! i dont get spooked easily buttttt 😬🙃 YO decided to start the year off in a hot air balloon and im quite literally on cloud nine rn!! weeee 👼🏻🎈 https://t.co/9u5FP0nGS9 happy 2018 everybody!! thanks for another stellar year!!! this ones gonna be on some new levels and i cant wait ✨🥂💛🌟✨🥂🌟💛🥂✨ the world is cold but my hearts on fire // self portraits from home https://t.co/A2hwqF50NV hm to watch the new season of black mirror and be fully consumed by hopeless sadness tonight or tomorrow hm https://t.co/IfCULFAFXp @stephenbyrne woah i was just thinking about this today and thought i was the only one. it’s only specific teeth for me though?? @neptunefranta  https://t.co/HX20a9s7sA @midnightdolans yes @sayitfirst strongly agree.. i get goosebumps just thinking about that teeth mold tray goop stuff 🤢 @evolutiondua wait that's it.. i need to find a hot dentist then i'll want to go 🧐🧐 we all agree going to the dentist is an awful experience right? its not humanly possible to enjoy that miserable hour of right?? Merry Christmas from your friendly neighborhood Franta Claus!! 🎅🏻🌟 https://t.co/FDAz7MOX8G @livefools get a net\ncatch him heyo kiddos hope you’re having a nice day!! surrounded by love, appreciation and feelin all types of those good feels, okay? 💆🏼‍♀️🍡💓 @strangegIow  https://t.co/wfj2wurUHt @sivanades the oolong is far too scalding. could ruin lives. shhh. g2g. @xobriley that’s.. me in the kitchen with my mom, gossiping and spilling major small town tea. we love the holidays xoxo🤶🏻💋💋 wandering through my dreams\nlingering on my mind\n\nit’s you\nit’s always you @fIickerdjh @charli_xcx and i got it and porsche and backseat and lucky and and and yo @charli_xcx out here being a pop radical, dropping bangers left and right! we femmebots stan!! new video | things we should leave in 2017 | https://t.co/uPxZgDoGgH 🤷🏼‍♂️💆🏼‍♂️ https://t.co/wXHr931Koj 🌞🌞 https://t.co/SnQVKGtOyB maybe they’re thinking about you too ❌ ATTENTION FRIENDS ❌\n\nNet Neutrality keeps the beautiful oasis that is the internet\nsafe, fair and free for all forms of expression BUT its\nat risk and we need to save it.\n\nCALL / 202-418-1000\nTEXT / Resist to 504-09\nLEARN / https://t.co/wUEO7sAcOO\n\ndont wait on this.\nplease. https://t.co/woFSqGHDBu @troyepilotos ‘common culture choice meats’ 🌸💭 https://t.co/gvCjrm9l2b @pyrenaxlrh it's a christmas miracle 💖👐🏻💖 @craftyfranta this glow henny cant you tell @todayfranta sì also *sigh* i miss italy.. i desperately wanna go back @IoveIoveh i already forgot haha but i do remember there was a FULL cast like we're talking a dozen family members + friends.. i guess im mentally preparing for christmas ☃️☃️ i slept for 12 hours and feel like a new person https://t.co/MsF9XoREUs @joncozart  https://t.co/hrkaj5f6Kp @brookemckenz18 @commonculture woah you’re quick\nthanks brooke ❤️ @lovsercharley @commonculture good luck you'll do great you're so smart i believe in you !! cult classic // designed by me\nhttps://t.co/hySwTd69xV x https://t.co/6vL5c01mjX RT @commonculture: NEW CLOTHING | AVAILABLE IN OUR STORE NOW | https://t.co/KkMeZ6PK96 x https://t.co/tF2M6Rod2b @HannahPanda08 😊😊💖 @StemmTaylor  https://t.co/1tIpdFR4eh @deustroye good ! uploaded in an airport ! im proud of me ! new video | i was so uncomfortable | https://t.co/xo2Dvh8BHt https://t.co/mY94Ld78Uf @aworktoself im catching a flight rn so it’ll either be up later tonight or tomorrow morning!! 🧐🧐 im a hopeless romantic what more can i say @avxnsmgc an easy 10/10. one of the best films i've ever seen in my life. update: i am a fucking raisin https://t.co/MOvEdz46uc im seeing 'call me by your name' tonight and plan on crying until im a human raisin @upintheislands omg @alrightvisual i love my corn field well this feels like a personal attack https://t.co/sVn1Ygo4xz @3amshadows working on that too! hang tight!! @beaufranta @frantaftsiivan a lot of these are already kinda sorta in the works ngl but im a perfectionist and bigger projects take tiiiiiime @frantaftsiivan *BIG* requests babes but i’ll my best okay 👊🏻👊🏻🧐 @S47URN1N3 + super smash bros @ConnellaFranta it was a test and you pass ❗️❗️ @sincerelyjena ive found my new favorite person RT @tmrwmag: It’s with pleasure, joy and collective excitement that we introduce Volume #22, complete with four – yep, four – beautiful cov… giggling on the cover of the latest @tmrwmag issue!! pick up a copy and show them lots o love 🧡🧡🧡 https://t.co/h4LpfqZRhX i suppose feeling too much\nis far better than feeling nothing at all new video | exposing my internet search history | https://t.co/3I9jnnAKfL 🙅🏼💻🙅🏼 https://t.co/hTDAlChCxJ 💋💋 https://t.co/Z22b3JGxot @sunsetsfranta happy birthday ☺️🎈 @doddleoddle @_anushka19 i have goosebUMPS @trishhh10 @commonculture @GLSEN stunning as always trish ❤️❤️ @georgiaroselyon you're so smart you'll do great !!! @onlyangelics one of my favorite films from this year!! i saw it twice 🤡🤡 @strangegIow i fell for papa steve hard man @youtubesboca just ask i guess followed ya bb 👵🏻 YES AUSTRALIA IM SO HAPPY FOR YOU!!! LOVE WINS ALL THE WAY YIPPIEEEE 🌈🎉✊🏻🌈🎉✊🏻🌈 @DeniseMagill1 @commonculture yippie they made it! enjoy ❤️🍒 new video | i met an icon &amp; other things | https://t.co/P7uFczm3pH | just a fun little chat 💛🌿💆🏼‍♂️ https://t.co/LBoGNT9TyP BØRNS in Los Angeles 🌿🖐🏻🌹 https://t.co/2To4RRFO77 you deserve the best @TANGOYOONMIN the real tea is i watched 2 movies and 1 tv show and cried during all of them @kinneyradar the heath ledger documentary 😓😢 why is it that just as i begin to cry while watching a movie on a plane someone always breaks into my private emotional circle to talk to me https://t.co/yxtd4AH5gf @easeculture my legacy new video | well this is actually embarrassing | https://t.co/Xn4UqVFWvb enjoy kiddos 🍿📽🤦🏼‍♂️ https://t.co/aO95TUbcP9 @forhirm 🇧🇷💋🔥 @divinitybix ah she continues to travel! where WONT she go!! i think about you often @joe_keery you look different here https://t.co/7UUMDaY7Iy @aworktoself @notetosivan 1. done\n2. easy peasy\n3. neat\n4. you're welcome! @EstelleFitz ‼️❤️💋🏁 @frantawrabel wtfff i was just there but now i MISS it @edelweisscon my 2nd born !!! 😍☺️ @mjnyards that's my favorite time of day um, canada, who said you could do this? this must be illegal? https://t.co/zAf6HjBzY4 @pinkteasivan im SO excited\ni rewatched season one the other week in preparation @lumosdrxco binoculars @3amshadows just starting now ahhh stranger thiiiiiings !! https://t.co/mEposNrJkp out here living my best life ngl https://t.co/sRlKCNCTUm RT @CalvinKlein: Game-changers: @connorfranta, @AlishaBoe and @tommydorfman, all wearing CALVIN KLEIN #205W39NYC at last night’s 2017 @GLSE… the @GLSEN respect awards always leave me feeling so inspired!! the LGBTQ community is bold, courageous, and our future is beautiful ❤️❤️❤️ sunrise over san francisco this morning https://t.co/G9XHFMAOUU @emilysheIdon drag my past 7 years of #content @adoptmeconnor bored frog boy 2020 🐸🇺🇸 @AlexMiDroga_ omg that last one @swallowedsea the question of my life honestly as you can clearly see, im very busy today https://t.co/rD1muyEIh9 @macknorth2587 @commonculture @GLSEN yippie! they're arriving! c'mon friday the 13th lets get https://t.co/5GbRd5A8ee @conscondiments 11yr old connor externally: im not gay \n11yr old connor internally: im gay af im gay af im gay af im gAY aF Becoming yourself is a difficult, personal and in hindsight kinda funny process. Take your time, you'll get there. #NationalComingOutDay ❤️💋 https://t.co/o3eClaBJ27 @rocketfueIs o.m.g. @smilewithfranta omg @champscalamity i was born elderly @CENTRALClTY oh no honey.. hoNEeeEeEEY.. its a repeat it's a bop https://t.co/7zSqD3r6US i only love you\nwhen im lonely\n\n10.8.17 https://t.co/ctERDhsbyK @samsmithworld yo, king of falsetto and making me cry at odd hours, both singles are timeless beauties and im dying to hear the rest 😯😢 @stylesrogue @/vaguebullshit was my username in a past life but well apparently my dad is feeling nosy and has no time for vague bullshit today https://t.co/ppRqTYmyFx @stylesoftlmes dammit. i was going for 80s. brb gotta try a little harder. @pfpicardi @Them ah massive congrats\nthis looks wonderful 👐🏻💞 new video | my first lookbook | https://t.co/BqLxRNciYd 🔥👟 https://t.co/qKwEPyyVKY 1500+ mass shootings since 2012\n210,000+ gun incidents since 2014\n270,000,000+ civilian-owned guns in 2017\n\nAMERICA NEEDS GUN CONTROL NOW. RT @HRC: Sandy Hook.\nVirginia Tech.\nAurora.\nSan Bernardino\nPulse.\nLas Vegas.\nCountless others.\nCongress must act to finally end gun violenc… Las Vegas, all my thoughts and all my love are with you. Things like this should not happen and yet things like this continue to happen. 💔 @Julian_Xaiver and yet she's still looking cute as ever. look at my baby. that's my baby! Paul Klein from LANY in Los Angeles 🍒🏁 https://t.co/SmLwdHAQeq @ChrisKlemens @DianeKang @shannonsydneyy boy he in well @DianeKang @joncozart fair @kylekuhns a mixture of fear, fun and vodka soda all dressed up 🥂✨ https://t.co/iijkIl0fA1 new video | if im being honest | https://t.co/OacjreBjDH https://t.co/Z5FM37s6xF @i_D the content i signed up for hello! only 24hrs left to support my charity campaign for LGBTQ+ youth! grab a cute hoodie like mine here https://t.co/hJG0Wltv7a ❤️💛💚💙💜 https://t.co/6vUP22lg3l @novatroye @womanlaIala i sense a drag @womanlaIala sweetie\nhoney\ndarling\nit hasnt even been 6 months yet @thisbemesara oh.. my god under lavender skies\nwith our fingers intertwined \nwe lie kissed by the afternoon sun had my first boxing lesson today! thought i'd throw that out into the world to hopefully impress and/or intimidate at least one person! @mattjbernstein wait this is me @faustovalcarlos and hopefully this friday too !! @flexiblemuke babe 'IT' was damn good @onlyanathema life honestly couldnt be better\ndrowning in work, meeting new people\nand just loving every second of it @stbbrnlove listening to 'feel it still - lido remix' by portugal. the man\nas i type this @onlyoleff only on the inside @praisefrantaa my jetlagged ass slept right through it @georgiaroselyon throw me a chic funeral please and thank you i MISS you guys tf im not dead i swear omg hi @SaraSiddiqui211 @georgiaroselyon 😵😵😵 @georgiaroselyon 😱😱😱 @Charlie_Carver @commonculture @GLSEN thanks buddy ❤️ i guess 25 is pretty alright https://t.co/kQhLOrNHoP thank you for all the kind birthday wishes today ☺️❤️ @iKnowSomePlaces @commonculture 👀👀 very happy to share my birthday campaign for @GLSEN!! all proceeds go towards bettering the lives of LGBTQ youth https://t.co/hJG0WlbUfC 🌈❤️ https://t.co/dS7Zfrkxv0 new video | watch this before they're gone | https://t.co/5GVkqW5gWA ❤️🎈 https://t.co/Pbzaxo1VO6 you are loved today, tomorrow and all the days that follow ♡ if you're struggling, it's more than ok to ask for a little help\ncall: 18002738255\nchat: https://t.co/vftyrEAJ5A\n\n#WorldSuicidePreventionDay 🗣🔥🗣🔥🗣 https://t.co/VUwUOL3PkH @ardenrose honestly you know you've found the one when bitch im so happy i could explode nyfw with @calvinklein 🖤❤️💛 https://t.co/fS1IhrcQtk @unusualevie infinitely me as well business woman means business ! https://t.co/x89zeSBjsq @MannyMua733 nice to meet you! 😇 @Kian the real me just got here too\ntext me keen bean 👐🏻 miss me when you have me\nkiss me like you lost me @sebsziam i just drank a la croix in the shower and have take out on the way so darling life is gooood ty for asking 💛 @beaufranta i mean they're not wrong.. im an emotional wreck after watching that new video | you've gotta see these | https://t.co/ut7z1OSAVx | all my favorite films from 2017 so far 🎬😍🍿 https://t.co/ZunoOYtMq3 @strangegIow yup!! editing it rn and its gonna be quite long @dazzlingIester HOT and EXHAUSTED but other than that really well thank you @frecklesanders you'll know in just a week! don't have to wait a year for this one lol big day ! big things !! ! @xnicolegarofalo it's my natural state @capturedfranta who told you about my purse if i were a dog i'd probably end up being one of those tiny anxious ones that get all shaky and bark at random curtains and pineapples 🙄🙄🐶😩 dreams can feel so real sometimes @lifeaseva 🤷🏼‍♂️🌻 i bought these giant plastic sunflowers for a little thing im workin' on and its truly stupid how giddy i am about finding them 🙄😍 https://t.co/rZu9M16NUl frank ocean has me feeling calm/nostalgic/sad/euphoric/lonely all at the same time somebody get this woman an oscar or make her an asmr channel i have chills https://t.co/WWwRiIJmtM @scotthoying @mitchgrassi go off a little @frantawrabel yea either way.. same too relatable it hurts https://t.co/8c2Zni4zox @notetolawley little babyyyyy @shatteringlove had to use a redeye remover and it had a green option 😬😩 vintage jacket &amp; ysl sneakers https://t.co/pvZSTGqkcj im watching straight people fight on tv for money and all i want is a lip sync 🗣CAN🗣A🗣GAY🗣GET🗣A🗣SICKENING🗣LIP🗣SYNC🗣UP🗣IN🗣HERE🗣YES🗣GAWD @pineapplefranta i accept cash or credit 😛 @FEMlNlZE aw im sorry =/ join a club or do a sport! thats how i made all my friends and where i had to most fun in school @rosesontario 💋💋💋 @olivia_kingsley that beat the clip makes when you let it loop tho im saving it for a fashion crisis or trumps impeachment.. nothing less, nothing more https://t.co/nXAomiuloV FINE if nobodys gonna save 2017 then the bright purple knee length coat i bought today WILL i don't mind having you on my mind ✦⋆ https://t.co/vFqrQxm1Gt happy 7 year youtube anniversary to me! 🙋🏼‍♂️🎂 new video | im a lucky guy | https://t.co/YZ2WvSK99K 🎉🎊 https://t.co/J0WLgBX5GT \"whats all the hullabaloo? it happens every two years. why all the mishegoss? huh!\"\n-my uber driver on the eclipse @ardenrose its what a star deserves the lovely @ardenrose has a lovely audiobook i think your ears need ta hear! honest, witty and a total gem https://t.co/qFnVvGHgvS #ad 💃🏻📚💋 https://t.co/XqFDqSR8EX billie eilish in venice ⛓🍭 https://t.co/Jzw2pIpAXA can we keep the 'open for a surprise' trend going a little longer.. the worlds mad sad lately and those cute animals get me every damn time lonely lane new video | drunk stories, music videos, internet drama | https://t.co/86vrgT4dTe 🍻🤷🏼‍♂️💋 https://t.co/Kqz3Rjluur @trulytrxye ty darling ☀️💎☀️ also, FUCK white supremacists.\nyou're disgusting and can rot right next to your racist ideology. the world seemingly turning to shit is no excuse for you to turn too.\nprotect, preserve and promote all the good we have left. so much joy in my soul at this very moment i think i may explode @LaurenJauregui ba..babe my boys an ugly crier\nbut hes such a pretty liar @aworktoself omg i had to delete it twice please send heLP sup kiddos! im filming a video rn and would love to answer a few of the burning questions you have so send 'em my way pretty pls #askcon 💌 happy #bookloversday! i wanna celebrate by giving away 3x note to self bundles! shipping anywhere in the world, simply retweet to enter 💌 https://t.co/KVRnJoNeSf @velvetlines @inIoves omg were you tapping my phone?? my mom told me she watched it 10x today @edelweisscon 💖💖💖 @inIoves oh but what could i possibly gossip about 🤷🏼‍♂️🤷🏼‍♂️ @artistictyIer it's SO much better and just nearly back to normal! :) @divinitylovers fixed it https://t.co/GS5ZrTNyvl drinkin' pink grapefruit sparkling water on my patio and chattin' with my family on the phone sis this night is gooooood RT @DannyDutch: Did anyone else know what a talented artist Jim Carrey is? I had no idea. https://t.co/JAV4BmbLJR @scaringsivan 😚💌 @quitonme thanks bitch i appreciate you a whole lot bitch his little blanket\nhis big spirit\nim going to yell until the neighbors come over and watch this with me https://t.co/m18pVaem6Z @ChappellRoan @InterviewMag actual chills wow @Imagine_Cass happy to hear you're enjoying it ☺️ new video | reacting to the animated short film 'in a heartbeat' | https://t.co/Jysa6DXHZ0 💕👬💕 https://t.co/MbS0z1q6j5 @willdarbyshire thank you! now come back please. @iKnowSomePlaces @RuPaulsDragRace  https://t.co/vISFJVKMxF @billieeiIishs WATCH MY NEW VIDEO IN THAT GOOD HD SIS https://t.co/74Q2hIHJYa watch this beaut in 1080p pls and ty new video | a summer road trip | https://t.co/KmRNEHpQ6Z 🏔🚙🙋🏼‍♂️ https://t.co/XATfOJJ3LB road trip 🐍🌾 https://t.co/AhJ3vrjAzT this tag has me cryin in the club https://t.co/YCop1KsEz3 @frantaxobrien wtf im famous 🤷🏼‍♂️⁉️🤷🏼‍♂️❗️ *covers hands over face and smiles* summer bummer @sarah_hill_99 who what pleasant day 👨🏼‍🎨🏔 https://t.co/RzqoMYKE5M RT @billboard: Sony/ATV enters deal with social-powered label Heard Well (exclusive) https://t.co/wzQpYoErn5 https://t.co/fGXQ8LMAJl just a boy who likes boys thinking about boys in @charli_xcx's new music video to her song boys 👼🏼👼🏼 https://t.co/F4Kfk1Njtw dont stay silent to ignorance or allow this disturbingly discriminatory behavior to be normalized. this is not okay and cannot be tolerated. transgender people are NOT burdens. they are valued human beings who deserve the same treatment, rights and opportunities as everyone else. its late at night and my dad just called to tell me how much he likes 'that new despacito song' then he said goodnight and hung up i want a dog 😢 @strangegIow cRAzYYyY riGHttTtTT cooking is so much fun\ni may not be good at it\nbut i have fun https://t.co/4SVzAo6000 new video | my first thrift store haul | https://t.co/NMzQBHaoN5 💁🏼‍♂️👠 https://t.co/OkHzLy8nEj gooooood afternoon kiddos! due to popular demand, i have a thrift store haul video coming your way in a little bit so hang tight 💁🏼‍♂️👠✨ @MistaGraham im glad im with you in spirit @Timtothewild never clicked so fast today was easy! today was fun! today was my favorite today! @lNSUBURBlA a few hours im sure \ni tend to get inspired, turn up my music and just goooooo @goingoninmymind im laughing @trulytrxye dont dont get too close now\n\n7.19.17 https://t.co/t8fP8XiCO1 a kind reminder to not\ntext and drive, please ❤️ lying by myself\njust thinking about him \nand nobody else @aworktoself 💋💋💋 @wjthconfidence i really enjoyed it!! visual effects were stunning and cara did so well 👊🏻🚀 @iandavidmonroe dont ruin this for me moment IAN @likelovrsdo im already dead dont kill me @strangegIow your @ is thriving\n\n(also thanks babeee) just thinking about how i was breathing the same air as rihanna last night https://t.co/rY5trXV9AL @gIitterize kick him in the shin, steal the cat and sashay to spanish class @qaisaradmia aw terima kasih! nikmatinya 💌 according to a recent study conducted by me, eating eggs at one in the morning increases levels of happiness by 10000% breakthrough\nor just another\nbreakdown\n\n7.13.17 https://t.co/HOrBppJLGY @palettegwen we all make choices\n\n(some make better ones than others) emotional guilt is the strangest thing.. making people feel undeserving of their happiness or ashamed of their sadness.. pretty messed up feelin' pretty out of it today https://t.co/15YBWYdUXe @versaxxx https://t.co/oAwl6Bv1na @dsnyemily https://t.co/V3aBRQpkN7 @arunkarra_ i'll make a dropbox for ya bb 💋 new video | lying about my injury | https://t.co/6I164l5DwM 🤕🚑 https://t.co/njaXL1MdS3 @satanmellet @commonculture 🚀 safe travels 🚀 @crimsonfranta hell yeah ! she makes a feature in my new video i filmed for tomorrow @frittatafranta ARM UPDATE: it still hurts more than i thought it would at this point? very.. achey. BUT im jwonderful otherwise ! @gaIlavichslut my eyes are glistening 😢💗 @BelieveInLester we all make mistakes\n\n(some bigger than others) @KeshaRose 'praying' made me cry under my covers this morning. its beautiful. happy new beginnings queen! 💖 @sequinstroye oh and thanks for checkin' up on me babe! very sweet 💗💗 @sequinstroye hiiii ! still hurting quite a bit so im icing it every few hrs\naccording to dr. peter franta i'll need to keep it in a sling for 3 weeks 🙃😷🙃 RT @commonculture: signed physical versions of CCVII are now up on https://t.co/7J91VXayig | $1 shipping on orders in the us for the next 2… ordered a cute arm sling on amazon this morning https://t.co/4ZehwGcDUx @lgbtqhoran isnt it everybodys?? honestly somebody wife me https://t.co/u5My847xO8 @stripefranta my parents were medical angels @consbernstein @heartencon omg we almost had to call an ambalenciaga @frantaphil a solid 'FUCK' i'd say bad news is i dislocated my shoulder\n\ngood news is i learned how to relocate my dislocated shoulder after watching a single youtube tutorial all i see are empty computer screens and four white walls that frame a false horizon im my best me when im around you @shipsmyoxigen oh sis, yo conozco esos new video | this is what 5 years of spanish got me | https://t.co/As770h9hjT | enjoy my shock and disappointment 💃🏻💔 https://t.co/gbptTKJcAe @baileytube15 omg a family reunion loved like the beginning\neven in the end sup kiddos! i'll be live on https://t.co/qTbNkB4qOo for the next hour if you want to hang / chat / listen to music 💆🏼‍♂️🍒👊🏻 RT @commonculture: COMMON CULTURE VOL. VII | NOW AVAILABLE WORLDWIDE | DOWNLOAD YOUR COPY HERE | https://t.co/51R9xJQVtZ https://t.co/MHZO2… @SUP3RFRUIT @scotthoying @mitchgrassi WTF IS THIS SMOOTH PIECE OF CONTEMPORARY ART GENIUS O.M.G. @ohwondersivan_ that i did! glad you like it 👻 @aworktoself @commonculture @heardwell goot mortink 😀 @commonheavenn aw ty! glad you're enjoying my favs :) @gaIlavichslut happy anniversary honey 🥂 SURPRISE!! the new cc comp is here! download your copy and support 12 artists im absolutely in love with rn https://t.co/4QG3lJxrZk 🌿🔥🌿🔥🌿 https://t.co/ysel3QF0dR @SAINTSUBURBlA um pics please im eating ice cream and there's a thunderstorm outside @xsoftmoonx omg go watch 'the keepers' right. this. second. its a doc series and its crazzzzzy @gabbyisela thanks babe!! im really really loving everything im working on / putting out lately @boysfixcars sis im getting that GOOD rest lately and i am glowing @goIdenletters aw @crayonoakley so so well. enjoying time off and away 👼🏼 hi just stoppin' by to say i love ya and i hope you're doing alright today ! RT @billboard: @connorfranta photographs this year's NYC Pride https://t.co/H7Xz4GMdvY https://t.co/hMt7waaAhC @scotthoying glad i could inspire 😍 so cooool\nso prettttty\n😚🌈🎈 https://t.co/cZp4G2WOvm @suggysbitch love you too! be safe please! @hotfriesluke appreciate you 💕 @blushdjh its not even that hot im just weaaaak @hopelessforest stay hydrated babe @reprisings just white BUT i did buy a yellow tee today !! @edelweisscon do it for the looks 🤘🏻😩 me: *complains about the heat*\nme also: *wears jeans and a cropped sweater in june* @billieeiIishs never @divinitylovers my legacy https://t.co/qx32Rx2WWm @tfio_5sotroyler the silver boots look was sooo much fun to wear @Iowkeytaehyung dont my answer to 'whats one thing u wish u could tell ur younger self?' has recently shifted to 'boy u gonna rock a d🍆ck coat in 2017 get ready' https://t.co/nGybYiATxI @CartiaMallan aw thanks babe 💗💗 @thegreatkhalid actual legend RT @outmagazine: Connor Franta is a Queer Voice For the Digital Generation: https://t.co/7HkUslXC5g ❤️ you @connorfranta. https://t.co/zxdQ… 🖤 ty for the feature, @outmagazine https://t.co/GuEU8diZdg 🖤 https://t.co/5exmxkh0ZQ @EstelleFitz ☺️💓 you know that purply pink color the sky turns when the suns down and its just a few minutes away from dark? yeahh i really love that new video | look what i found on my phone | https://t.co/wMoad9ZJV0 | enjoy 💗 https://t.co/vbqv473x06 hi hiiI! exporting my new video rn. i really really like it. hang tight and make some friends in the #frantasticmonday tag while ya wait 👼🏻🌈 @lavishingtroye 💗💗💗 @meIodytroye @vesselsfranta @barelyfranta breathing a little less after this music but i did it anyways @Kailey004 thanks kailey 💆🏼‍♂️🌟 @smilewithfranta circles. circles everywhere. @alterlovebix listening to it again rn and ughhh. a bop was born. @trippingontroye which ARENT my favorites the new lorde album makes me wanna go out dancing with friends until like 4am or lay in bed under the covers all alone ugly crying for hours @TOOCOOLfranta @dddalyaa love love love !! BITCH I PASSED !! 🚗🔥!🚸!!! im legit so nervous to take my california drivers license written test i brought a fidget spinner to play with and help calm me down https://t.co/aypTOTMWDo @IISuperwomanII i remain convinced you were watching Ratatouille and simply took a screenshot keeping the 49 victims of Pulse Orlando in my thoughts today and sending heaps of love to their loved ones. they're all so deeply missed ❤️ new video | where have i been??! | https://t.co/zYGn0Upude | retweet and show it some love ❤️❤️ https://t.co/wwSls347ua shh perfect places by lorde is playing for the 67th time shh @crzyfranta awww !\nisn't it great??? @LauraLovesTaylo @commonculture come through latvia tf ??  👯‍♂️🥉 RT @britneyspears: Does anyone think global warming is a good thing? I love Lady Gaga.  I think she's a really interesting artist. guys the film i helped produce is out TODAY!! its so so funny and has wonderful LGBT representation! check it out https://t.co/snLSGorV1G 🐶💞 https://t.co/J8rKoi2ibF @slowlysivan 💎 https://t.co/r83AvPezoQ 💎 @tintedrosess a ton yeah! i actually was hired for my first photography gig the other day and its like.. a really big deal for me 🙇🏼🙇🏼🙇🏼 @femangeI i love that about me @blushdjh 😩live 😩il @alextrophe how bout a blurry pic of that cheese i cant stop thinking about https://t.co/UwJJCuP3Ta @drivinatninety @whiterosefranta thought it was a potato or radish for a solid 5 seconds @stbbrnlove how does one simply.. add an adorable brick wall @strangeconnor ive gotta highlight all of that after this!! i say im resting but really im working on a million things from home in my pjs @whiterosefranta i knowww makes my soul warm @rosegoIdhalsey @oceanease no but i had the best ricotta &amp; bread combo of mY LIFE in nyc and i cant stop thinking about itttt @balconycigars aw sorry darling,, gonna be getting that good r&amp;r for a bit after tour👩🏼‍⚕️🏥 @oceanease im goooooooood ! seeing friends, sleeping in, eating healthy again.. much needed off(line) time 👼🏻 sweet angels i MISS you how ARE you @people  https://t.co/nmcfYKgdod RT @billboard: .@ConnorFranta's Pride playlist includes Kehlani, Sia, Miley Cyrus &amp; more https://t.co/1cJPrJgzl0 https://t.co/McITgpm9Gy @YaraShahidi ah congrats!! @poetastrologers bout right queer ! people ! are ! so ! much ! fun ! i ! love ! them ! a ! lot!!!! anddd thats a wrap on all 33 cities on the note to self tour!! i dont need a florist but i do need the longest nap 🌷🙆🏼‍♂️🌷 https://t.co/LJBwf3ZNvX im in manchester today and i have to share one of the most moving sights ive ever seen.. the street was completely filled with this.. 😔💐 https://t.co/SXJJ6VNx1H covfefe is me trying to say coffee when im drunk my mind is a mess \nobsessed with the things\nthat cause all my stress \"you know whats crazy? if i get a dog right now its almost guaranteed to meet my children\"\n\n😳😳🐶😢 hello from a tired boy who finally made it to england https://t.co/EEvMSq5lnC i LOVE you my sweel darling angel baby cake muffins 💗🌸🙋🏼‍♂️ https://t.co/vnZYG0lGh4 @OhWonderMusic oh noooo. poor guy that's the worst.. it was so good to see you both though!! the loveliest 6am airport surprise ever 👼🏼✈️💓 sweet dreams from new york city x https://t.co/r99ey4eIxB @reasonwerhyme .@AllOfValentina was my girl and im still shaken over it pls try again later https://t.co/0jv3Dfu6WT @HeyItsSamD  https://t.co/MXGkZDhGgx @cozydodie im a man of my word @infinityondun 🐛🐛 @feeIslikeveIvet thank queen ! currently have three different beverages in front of me @frantaphil solo brunch right now then who knows 🤚🏻🌈✋🏻 @generousfranta *blushes* leaving for my uk book tour tomorrow!! cant wait to meet a whole bunch of you https://t.co/Iw9CHsp5DC 💌✈️🇬🇧 https://t.co/Dh1Hdg0Rvk RT @UpdateOnFranta: the Note To Self Experience Tour is officially over, finishing 18 cities! Next stop is the U.K. buy tickets here! 💌 htt… constantly reminding yourself to not think about certain things really begins to take a toll after awhile.. 🤕😣 gonna miss this group a lot ☹️😢 https://t.co/yGhloBgZ6S this past month has been killerrr. thanks for making it so much fun. im a lucky one 🙋🏼‍♂️💛🙆🏼‍♂️ guysss i just wrapped my us tour !! if only i could dive behind those eyes\nto see what swims beneath their surface @alliex 💋🙅🏼‍♂️💋🙅🏼‍♂️💋 hiii guys i didnt sleep on this.. i used a random number generator and it chose @TSuperThrowback as the winner!! CONGRATS LOVE 🎉🥂🎉 @lizakoshy your best video 💌 only two stops left! thanks to all who came out and made this month so memorable!! https://t.co/8rmzkdF1k3 💌 https://t.co/iZBNxjbPiL sending love and support to anyone who needs it tonight.. im off to bed x all my thoughts are with anyone affected by the event in manchester tonight. concerts are supposed to be safe spaces. im so sorry 😔❤️ @middlegrier the next season of cc is my number one priority post tour, promise 🙏🏻 @salmonfranta love it also im eating salmon rn so congrats @suburbiahearts around 16 hours or so! it's kind of like voice acting in a way, so we had to do a lot of 'takes' to get each page right :-) @INLOVETSM @ashtraytsm actually adorable aw @tiahn thanks angel, enjoyyy hiii guys! i recorded a really lovely audiobook for note to self awhile back and its out rn.. give it a listen? https://t.co/qFnVvGpFEk #ad https://t.co/BrsSkkxtDo we all live in the same world\nbut we all see it differently\nhow beautiful @OakleyxFranta they're the best, right? im lucky to have them 🙋🏼‍♂️ @luIIabyshawn 💓💐 no i didnt get lost on a run for over an hour and nearly have a nervous breakdown on the streets of toronto wow quit spreading rumors 💌 sending one person a signed copy of my book + a journal / pencil for your own notes to self! shipping worldwide, simply retweet to enter 💌 https://t.co/Bng49Gj3Ti its been one month since my book came out wowohwow thats nuts @unusualevie нет @frantaphil MITSHIGAÑ @uItralife @anastasia_sia18 @toulousetroye no but i did fall in love with my waiter last night @anastasia_sia18 @toulousetroye i DID. one was in vegas, the other was at my house in minnesota. both had very strange plots.. @toulousetroye goooood ! having a late breakfast after the longest sleep of my life @AbbyDoww it me woke up at six and watched the sunrise this morning / lifes pretty cool i guess some girl said 'note to self' as i walked by her and honestly my neck aches from how quickly my head whipped in her direction someone drop me this man's location so i can go flick my leftover toast crumbs at him https://t.co/vWSNAq45iL SEE YOU THIS WEEK\n5/16 St Louis, MO\n5/17 Columbus, OH\n5/18 Detroit, MI\n5/19 Toronto, ON\n5/21 Pittsburgh, PA\nTICKETS https://t.co/OeRKT3t5OQ https://t.co/H3o65ANnQ2 @mspook11 so happy you enjoyed it ! @lovewentcold wish granted @stylinsonfranta took me legit 30 seconds to find it new video | my ideal husband | https://t.co/M9jK1V8DI5 | enjoy the chats from unexpectedly large hotel room 👬💓 https://t.co/eB3zQsmPff happy mother's day ♡ https://t.co/U4FUZZ10L8 @theweeknd tysm @GoneToNeverland ❤️💋 https://t.co/F78Hfe0bEe dreams are a pleasant escape new video | im not drunk, im just impatient | https://t.co/dDW0aaPy2w https://t.co/YNOiCZHXLi a few photos ive taken over the months but never posted x https://t.co/owPviEXHAl @tokyoangeIs @cherishedconnor no problem dear, followed you both 💓 @childishedsta HELP IM UNDER ATTACK @theemmablunt where 🛶 wont ✈️ she 🚀 go\n\nenjoy emma x @frantaphil ^^this @georgiaroselyon  https://t.co/umpULk8pR5 @interweblester pad bye when you eat so much pad thai you want to pad die @TomDaley1994 @DLanceBlack married men, congratulations!! im so happy for you two. the day looked beyond perfect 🥂❤️ @invalidIove its only 10am i dont feel like crying just yet @kinkhoweII ***awfully fun @foolsfallsivan with all that blank space, one would assume you weren't learning much.. before i tweeted @talkmedownjade my smart smart smart kathi!! well done @therefryou well that was the easiest block i've ever clicked drinking that good coffee, eating that yummy oatmeal, driving through those cute mountains.. i love my life as a touring grandma ✌🏻👵🏻 @Joe_Sugg that's unreal. congrats joe!! @frantasfanboy i laughed im sorry RT @oatmeaIfranta: note to self: flowers are a good concept 🥀🍂 @connorfranta https://t.co/PJdCrYShUd *lady gaga voice* \n\ntalented, brilliant, incredible, amazing, showstopping, spectacular, never the same, totally unique https://t.co/HsCax0j8bd @NatashRuss i look like this emoji -&gt; 😮 this week im traveling to /\n\n5/7 San Diego\n5/8 Las Vegas\n5/9 Denver \n5/11 Milwaukee \n\ngrab your tickets / https://t.co/8rmzkdnpVt https://t.co/VXaZoQgW0n @glitterygansey been there sis glad we could finally meet @robertsemma 💌🌹 https://t.co/hlhT4Q8rGr @valleyfranta dónde está mi puto hamburguesa @fazedme it revolves around a book. books are educational. education provides people with a promising future. parents of kayley i only see good here. @dylanhopcraft yay! i'll save one of my fries for youuuu @feeIslikeveIvet jealous, live that good life baby 🌌 just ordered a double vegan burger with sweet potato fries and thats pretty much as crazy as its gonna get for me tonight folks @Iostlive just wonderful. slept in, ate oatmeal, took photos, drank water, talked, laughed, the works! @youreglory bless'ed be @frittatafranta like a proud mom @hopefulrenegade 💌 @harlequinfranta note to self: think of a better bio about note to self @invalidIove the lovely emily is workin on them rn! should be up soon 👸🏼 @monetsouls see you soon x @lorde that... that coat 😩 @kylervanherpen1 ❤️ @phandomunicorn1 thanks for coming tammi !! @emilyisntdrake i now pronounce you committed af, you may read your bride #5 Sunday Times Bestseller and #12 NY Times Bestseller for week two!! thanks everyone 💛💛 https://t.co/myvju0jNJn @dklajayden @commonculture i meannn \nwe killed this massive shout out to mother nature for bringing that pretty pretty this morning 👼🏼🌤🏔 https://t.co/lPJQJblhi9 @AmesImel so many giggles today @Dane_AE she ventured so far! enjoy 💖 @nick_vincenttt @heardwell ❤️💋 RT @TrevorProject: \"remind yourself you have value. you define yourself\" @connorfranta 🌈💜 via @TheAdvocateMag #lgbtq+ https://t.co/aq9jeKvg… hey i dont say this enough but you guys are the sweetest and i love you endlessly 💛 @adoredbychai ah no can't have that !!  are you still here? 5.2.17 https://t.co/GqC32vBdho @freddyvr no worries bb, have fun!! @IISuperwomanII *shivers* look who's on @theadvocatemag's 50th anniversary cover!!\nman oh man is this cool and a true honor, wow. https://t.co/lj4hApDqsf @talkmebIue fair new video | my new house is haunted | https://t.co/qUdOePWd2p these spooks are gettin' scary but more importantly ANNOYING 👻🙅🏼‍♂️ https://t.co/gc5hW3Gjym @shatteringlove it's so badass, ugh, i cry 💌 two days until tour!! grab your tickets and get ready to have a good ol' time, alright? https://t.co/8rmzkdnpVt 💌 https://t.co/8pO86wYYxc @trishhh10 she's growing up so fast 😥 @edelweisscon @tyleroakley @heardwell ah! isn't it so legit?? we've been working on it for MONTHS @dabskoury enjoy !! @tyleroakley @heardwell ty sis 👯‍♂️💓 @frantashadow ellen 👏🏻 has 👏🏻 her 👏🏻 copy 😩 do 👏🏻 you 👏🏻 have 👏🏻 yours 👏🏻 @honeysuburbia thank you kirstin 💗 @RiaSantiago14 an entire herd WOW !! @thegreatkhalid im beyond late to the game but man your album is so fresh.. the whole body of work makes my ears happy wow @jn_percussion oh i love that concept ! @Mia__Nguyen 💛💛 @LelandOfficial funny.. i dont see a cankle @IISuperwomanII @tyleroakley @BenJPierce i have nothing to add here but i do love to be apart of things so here i am @invalidIove @incenseoakley if i could block myself i would too @incenseoakley cats are RAVING about it !\n\"best book of our 9 lives\" -cats shes giving you '10 flights in 9 days sleep deprived the house down realness' henny https://t.co/56bdYHzfRp this is gonna be intimate as hell! the installation is unbelievable and the speaking portion is very vulnerable/playful.. see you soon 👏🏻💓 💌 NOTE TO SELF TOUR | OFFICIAL TRAILER | https://t.co/OeRKT3buqg  | SEE YOU IN MAY 💌 https://t.co/Nx9vzFVK5S @tyleroakley you did it first, i did it better okay imma go eat mexican food and get drunk or something \n\n((oh wait i already am)) heres me cheesin on the phone when i found out i made the nytimes bestseller list https://t.co/mwznsfcdps thank you for the overwhelming support and love you guys have given note to self!! its so so special to me and you all are too 💛💛💛 #3 whaaaattt my first book debuted at #8 thats ridiculous just found out my book is New York Times Bestseller!!! im #3 on the list ah this is so surreal wowww https://t.co/xg8JNKnBKG @Caspar_Lee miss ya buddy 👻 thank you thank you thank you to all my amazing supporters in the UK!! couldnt have done it without you ❤️❤️❤️ JUST FOUND OUT NOTE TO SELF IS A #1 BESTSELLER IN THE UK AHHH @KylaMagennis enjoy! let me know what you think 😇 @nofiltertyler her name is pistachio 😰 my tiniest m&amp;g guest from today 😢 https://t.co/lVzZUfmL9g 4.25.17 https://t.co/xDGSHsGgv7 i have cameras in my house that i can watch on an app while im away which is really cool bc i can see all my plants dying slowly in realtime @tindersivan i always give them a talk beforehand asking them to be kind/respectful/sensitive so i hope they really listen but so sorry if they ever dont @lSOLATEDLOVE i'll tell them they have to let you guys do your cute poses, dont worry 💁🏼‍♂️ beyond excited to announce that im heading to the UK for tour!! all details and ticket info are on https://t.co/BKMsRwmwdj! see you soon 💌💋 https://t.co/4z8B5TCegP feels good to be home, see you tonight minnesota!! https://t.co/aDJ9QOqACK @uItralife @MYFlRSTKISS *jaw to the floor* @frantababble 😍 showered in flowers 🙆🏼‍♂️💐 https://t.co/Vbzvot8mvc @vipieu currently being harassed so im here to end this violence..\n\nfollowed ya 💓 @winnieekwong i have tears in my eyes, you are too precious for this world @flowerboypmll cute cat. nice fur. quality lay. 10/10 @wtfiitsjayyy omg a family of four @kyliesdetail gimme that kidney @blurrysivan ty caitlin! also wow that ships quickly @ilysbsav forget my book\ngive me your cat @proudkiss precious angel looks so innocent in her slumber @flyawxylwt ah ty emma!! ❤️ retweet + use #notetoself ❤️ https://t.co/Z8QKKjYYMP hi so i havent followed a lot of you guys in ages,, anyone up for that tonight? 🙇🏼 RT @frantamalfoy: they ask you how you are and you just have to say you're fine when you're not really fine.. https://t.co/grwV0rTo2H @eclipsetears woah that display @mirumariniuc ah great i downloaded it for my flight !! bill's a gem @Frantasfools honestly a canon t3i is a great intro model into the world of dslr cameras @selflessdrunk neat ! ty for recommending my book @WHSmith @spaceboylester this is a cute fact @freshlyphil 💋🌹 it just started raining outside, so now i truly could not be more excited to go to sleep im participating in this #DayofSilence to protest the bullying/harassment of LGBTQ+ youth in schools. support and spread love to all ❤️💛💚💙💜 https://t.co/b8bVfRYD27 @shanedawson omg i wanna see my baby engulfed in your iconic monetizable flames\n🔥😍🔥\n\n..um i mean.. no. stop. dont. please. im blushing over this, wow, thank you https://t.co/kt01h4ruI7 @Frantasticriss je t'aime aussi 💐👄 @adrianbliss i see you saw my indirect @likethisfranta gimme 'self' pls @frantasguac hope you like it!! i think the audiobook is really really worth it. you're able to hear exactly how i intended the poems to be read 🙆🏼‍♂️ @fooIscon @commonculture that last one is IT abby wowohwow kissed by bliss @williamsimone very flattered, ty william ✨ @fIanneIfranta where ! doesnt ! she ! go ! @ShawnMendes  https://t.co/SHFfe2dKzA @frantasflawless @ROCKETCAYLEN SHES GLOBAL @greeneyesfranta @KeywordsPress 🌸😌🌸 @ROCKETCAYLEN an international traveler !! \nthey grow up so fast 😢 im most certain i like hummus more than i like myself @wildchildsivan @tyleroakley tySm @tyleroakley TWINK ?  ..yeah okay fair\n\nthanks ty hope you like it 💁🏼‍♂️💛 @doddleoddle PRECIOUS LADY! hope you like ittt, miss you 💓 @arunkarra_ @willdarbyshire well great now i have to deal with sudden emotional trauma @cantsleeploving @commonculture thank you sarahhh 💗💐 @whiterosefranta ☕️☕️ https://t.co/9WVxIqJmn5 @poisonease she travels!! @heardwell 💋💋💋 💌 note to self 💌\nonline: https://t.co/O6uzhunGm5\nebook: https://t.co/zFIIQpQuXF\naudiobook: https://t.co/cC2W1IoeDW\n*also in bookstores today https://t.co/kjDJp03m3s @wtfogelmanis 30% off at target? grab that deal mumaaa\n(also thank you darling) 👼🏼⚡️@NylonMag https://t.co/YlYJMR9Xu0 RT @outmagazine: 3 Exclusive Excerpts from @connorfranta's Intimate New Book: https://t.co/N9k4rFtOSL #NoteToSelf 🌺 https://t.co/NxZBC4qoz7 @fIanneIfranta obsessed ! @lNSUBURBlA wait.. kinda cute??\n\n(also dms) RT @NylonMag: We're getting our makeup done with @connorfranta as we chat about his new book \"Note to self\" https://t.co/ndMEo3PgCj https:/… oh and as if i werent a wreck already, im now emotionally ruined over my cat turning 13 so life is just A LOT FOR ME RN OK. SHES A TEEN WTF. https://t.co/2AL4nAidH9 regardless, thank you for all the love thus far. im overwhelmed in the best way and couldnt be more grateful to have you all in my life 💛 im nervous not gonna lie bc ive never been this vulnerable.. emotionally. artistically. which is not pretty at times but its always honest. i know im proud of this book thats for sure. i worked damn hard on it for 18 months and my fingerprints are on every detail of every page. currently sitting on my bed after many calls/texts from family and friends about tomorrow and man of man idk what im feeling.. RT @heardwell: .@LoveYouBothFilm will be On Demand, iTunes and Amazon on 6/9. Produced by our very own, @ConnorFranta! Let us know what you… well the #notetoconnor tag is making me cry.. ugh\nyou guys are the sweetest and i love you so so much @etasomechips my baby !! ! quite nervous about this one. verrry different. be kind to me 😶 new video | frames: a poem | https://t.co/qFCAcb4uW9 | 💌 https://t.co/xmFR36Hhs7 @psychobabble im on it and idek @ruinyouth wtf i love these @starsfaIling sending love your way 💗 @greedyforlove me as a pot @uItralife notttt much just in a bath reflecting a little on the last yr. craziness. feelin like the big release will be quite literal for me, ya know? @adoredanieI for me to send you a copy? hm\n\nhow about 5,000 just for giggles\n🤔💌 @unusualevie of course 🌷 @buriesourlove fern, apple, mrs gertrude @hawaiianashton thank you my darling 🌟 @gagasfranta that jokes old, next @aIlofyourglory not what the youtube videos are showin, they're throwing it in the ocean n shit and its fiiiiiiine relax 🌊💆🏼‍♂️🌊 why have i never fully appreciated the fact that my phone is waterproof *said the boy fearlessly browsing twitter during an evening bath* two days until my book comes out https://t.co/bCSmz98v7G harry styles, man, harry styles 😩 @lgbtyellow aw babe! very cute! also i adore the semicolon add on 💞 @roseIoving this made me smile ngl i wish i were able to forget my fav series/films so i could watch them and feel everything i felt for the very first time again *quiet sigh* RT @people: Connor Franta on his secret battle with depression and coping with change https://t.co/UMesNIDa9J https://t.co/RjtAowsErN new video | more gay questions | https://t.co/6tJ6uB0Tsy 🌈👼🏻 https://t.co/IZLspWFDrY 👉🏻 https://t.co/oy12wfRTSQ 👈🏻 @slowlysivan that's been me for weeks 🙄 @wrabel 💋♥️ @frandomislife 💞💞💞 @lNSUBURBlA there are two images in the very center of the book that i can never take my eyes off of. you'll know when you see them. @HOLDONHANNAH love that. the images tell coinciding stories and stories of their very own as well so keep your 👀 on those too. @tintedrosess my child deserves SAFETY @uItralife utterly terrified. i want it to be loved and appreciated for what it is, not for who i am? does that make sense ?? ? @kelsey_ktruitt excited for you to read it kelsey!! @velvetlines overnight it pls @distancefranta thanks alllllllly @notetoieu very smooth.. you win just now realizing if you order nts today it will be in your hands in six days.. wowoahwewow suddenly im wheezing https://t.co/Da2pRgmbSx 😷💞 https://t.co/2rejzR0t2m @alessiatulips i just want you to have note to self @trulytrxye fair imagine if i were as consistent in all aspects of my life as i am with clicking \"remind me tomorrow\" on every software update notification @frantaphil the accuracy stings i couldnt sleep last night bc a window mysteriously opened and set my house alarm off.. *sigh* im far too busy atm to host the paranormal 🙄😪 @twitter thanks for the @ edit, babe\nmuch easier on the eyes now 💛 @mitchgrassi i. am//. thOroughLY. GAGGED! !! @SantosRanns 💓 tysm 💓 @suboobia adobe lightroom just for tonight \nno strings attached\nit felt right \ni felt wrong\nnecessary evil\ntakes its place \n\n// note to self, 2017 https://t.co/lylLhAs8Ai @slowlysivan personally im shrieking @stripefranta your @ is thriving in 2017 claudia new video // what the homeless man said to me.. // https://t.co/iJV1UUOVnx // enjoy the story and pretty pls rt this 💛 https://t.co/H4JZxHpPzu @arunkarra_ honestly, all lawsuits aside, that camel is super cute.. i cooked a squash @colourmefranta @GayTimesMag awww chloe @tyleroakley ps it looks like your magazine is side-eye laughing at my magazine @tyleroakley cover sisters!! @TROYEGlRL sh.. should i.. come to brazil? 🤔🇧🇷 @realnapolitano yup! @tintedrosess WELL THEN THATS ACTUALLY REALLY NICE BUT HE CAN WAIT PATIENTLY JUST LIKE EVERYBODY ELSE 💌 New York, Chicago, Minneapolis | sadly, no ticket pre-sale 💌\n         (all info for the 27 tour stops | https://t.co/46dnLqxC6H) 💌 April 22 | Cincinnati | https://t.co/4o1T6wk4JC\n💌 April 25 | Seattle | https://t.co/HZ1czG6uHB\n💌 April 26 | SF | https://t.co/IRkYyThpZM https://t.co/lmV3kTv8nv 💌 April 19 | Orlando | https://t.co/AXCSoY5wJc\n💌 April 20 | Houston | https://t.co/bNsLdti5Wj\n💌 April 21 | Dallas | https://t.co/E1xBwJlDLd https://t.co/3tDoHwpyXI 10 more days !! https://t.co/46dnLqxC6H 👼🏼⚡️ https://t.co/IvuyWi7zgv @mattjbernstein get. it. loved like there's nobody else @RickyPDillon 👼🏼👼🏼 @advenarena there are these two photographs in the dead center of the book i can never not smile at when i see them @honeysuburbia 🌻✨ @MCALLASSTER IM ABROAD @ROCKETCAYLEN 💋🌹💋🌹💋 @strangeconnor i cant take care of myself or my plants @adoreconnor bring me to a court henny @alexsreasons 😙 @cloudninefranta who? me? 💆🏼‍♂️ @conradsparadise great questions a blossom covered the sky https://t.co/saPkByQGpv @whiterosefranta ™️©️®️ @doddleoddle an actual masterpiece ready to party in london tonight with @CalvinKlein!! wearing their new CK ALL and feeling like a little trouble #ad 🙆🏼‍♂️💋 https://t.co/6cbJg3GWrj hello, it's me 👋🏻 https://t.co/s0nKL5vQkP @TanyaBurr where did you get this gif of me.. hiii lovelies im falling asleep rn but a kind reminder to grab your tickets to the https://t.co/8rmzkdF1k3! its gonna be a grand ol' time x https://t.co/tfC1M642nQ @frantawrabel makes my heart swell @controyes mostly just that one scene in that one episode... no spoilers but you know what i mean wow 13 reasons why was really good.. chilling.. a bit unsettling.. but good. well worth the binge 🎧😲🚳 @hotfriesluke she's a diva but i love her 🙄 hope today is wonderful\nlove you guys ✨ @MistaGraham no graham no @withhearts @bethanymarieco aw thanks favs 🙆🏼‍♂️ @buckhollywood @people ty 😊💛 new video | critiquing strange fashion trends | https://t.co/mIWpDNZq6X https://t.co/ibtjZuHTiq @doddleoddle  https://t.co/Uc1TC4UYdI have you got your ticket yet? https://t.co/8rmzkdnpVt 🙇🏼💌 https://t.co/SUQ43kbLpG this is what i look like when i catch myself doing a ridiculous pose during a shoot https://t.co/mA37D22szA RT @glaad: Thank you @ConnorFranta for being with us tonight at the #glaadawards! https://t.co/YQMkewTEqp @hypercoIor hun its saturday, i simply do not feel like starting a war again @rosesforconn opened my eyes @horx__ tired just so tired @sivanncrybaby oh boy, um.. either chapter 8 or 15 @queerstewart this is so f'in cute @salmonfranta aw caylie thanks @fooIscon 👻 @frantashadow you a ⭐️ sometimes i forget ppl in cars can see me in my car and when i remember, ive already been staring at them for an unacceptable length of time makes me happy to see how happy you all are getting for this *sigh*\nthank you my darling angels https://t.co/MihoVjeZwx @truthfranta 💛💛💛 @tyleroakley \"the last word is rol-aska-tox.. rol-aska-tox was SURPRISED when jinkx took the crown\"\n\nmy husband is funny @madelinerose312 🙆🏼‍♂️🙆🏼‍♂️ @FeaturingMat i'll be in Dallas and Houston for book signings! come to one of those if you can 😇 https://t.co/kzbLuWnB6N 💋💌 NOTE TO SELF US/CANADA TOUR TICKETS ARE NOW AVAILABLE!! GRAB YOURS TODAY AND SEE YOU THERE https://t.co/OeRKT3buqg 💌💋 https://t.co/sk6LId4uLy @easystreetcon 😙😙 guysss tour tickets go on sale tmrw at 7am pst / 10am est!! cant wait to see all your precious little souls there! https://t.co/8rmzkdF1k3 https://t.co/PEBXdCXPwn would 10/10 sell my soul for cuddles right about now https://t.co/AYGFxMPctF @dklaloving make your bio 'connor was here' @impIicitroye good luck with the essay ❤️ https://t.co/XCpxOrg8IX ah yes i love the smell of legal action in the late afternoon https://t.co/XJ1TPjFEr7 https://t.co/Pgm3hsW2hB oh but just bc it looks that way\nsurely does not mean it is that way @MlDHEAVEN NO HONEY I WANT TO LIVE @HoodieAllen thank youuuu buddy, been working hard on this. trying to do something different 👊🏻💥 💌  THE NOTE TO SELF US/CANADA TOUR IS HERE | TICKETS ARE ON SALE THIS FRIDAY 3/31 AT 7AM PST / 10AM EST | https://t.co/OeRKT3buqg 💌 https://t.co/ygrnIdgjWZ new video | there's something i need to tell you.. | https://t.co/MHv9nUWIWW https://t.co/Js5Cp05scT any ! minute ! now !\nhttps://t.co/k5iwpNRfcm posting a massive announcement video this morning! get excited bc you're going to love this!! 🙇🏼💌🙇🏼 @Iovelycon i wouldnt change a single thinggg its 100x better than i imagined 😭 @pitypml i'll show you all the details later but fuck man they're all next level perfect. im seriously so thrilled. @MlDHEAVEN its honestly the prettiest piece of literature ive ever seen @queermellet sweet sweet bliss the first official copy of baby arrived in the mail and i think i might just be the happiest boy in the world rn https://t.co/PZgWoVkyKF not to cause drama or anything but..\n\ni had blueberry pancakes this morning and they were really good @myyouthsuburbia https://t.co/eNfRzWTO54 @bangingbaran now this is the content i signed up for @LaurenJauregui *snaps profusely* my head is full of fiction omg i just remembered its friday and the new season of drag race is on ah omgggg @frantababble @commonculture i actually gasped @wiltedfranta ugh i MISS college connor @impavidfranta wear them every day for the rest of your life @junipersivan my dad's brand @commonIove here,, im itching my nose https://t.co/w3ffbln8gx @fooIscon anytime abby @lustgoldwyn ✨💛 @youaresweets the king has clearly preordered.. have you 👁☝🏻 @ThatMike95 @heardwell omg enjoy i dont even have one lol @touchitdraco yes u purchase a book from the bookstore im going to (to support them) and thats ur ticket! also just call them for all q's ☺️ @Kingg_Oakley the agenda is GAY its always GAY\n\n(probably like go for a run, work, feel things, eat things, etc) @stripefranta my eyes are closing rn but let's chat / live stream tomorrow, okay? @scotthoying BABE CONGRATS WHAT THE HELL i've never more related to a 90 year old https://t.co/03dzbkwy9N RT @UpdateOnFranta: Just another month just Note To Self hits the stores, have you preordered it yet? ✨ | https://t.co/QpaqRkCht5 https://t… @CheskaWeisinger see you soon ✨ hiii i was informed for some new important info on this yesterday so i reuploaded the announcement | enjoy cuties https://t.co/kRI0M6dp3Y 💛 https://t.co/DWr9J5WLLI @andrewlowe the video: surprisingly chilling\nthe narrator: my newest and brightest star idk why but for some reason LGBTQ+ kids keep crossing my mind tonight.. quick reminder to you all that you are so warmly loved by so so many @koreykuhl yeah duh snorey we need to my other cover for gay times 💋💋 https://t.co/GcHSwBm5ZP @youaresweets made me think of this gif https://t.co/kD1wAKPIBq 💌 | 💌 | THE NOTE TO SELF BOOK TOUR PART ONE | 💌 | 💌 https://t.co/IemCl2Allt hello my darlings! posting a big announcement on https://t.co/k5iwpNRfcm this morning 🙆🏼‍♂️💌✈️ @astridsofficial help i cant stop listening to breathe @tbhbyron persecuting a company that has otherwise been an incredible ally seems wrong. if someone messes up: inform, educate, then resolve. // @youtube, im not about to start throwing hands just yet but i kindly request an explanation and resolution on this issue asap. thank you. https://t.co/wKRmctTYC9 have a good day everyone 🌻🌤 @pecanoakley tysm babe @validatemellet human garbage @lgbtwiId do not recommend new video | tasting strange donuts with @rosannapansino | https://t.co/jvBrRZFfFQ 😷🍩😷 https://t.co/a3mhtDYMFz good morning darlings and happy weekend,, let's start today off with a new collab video, shall we? https://t.co/k5iwpNRfcm 👩🏻‍🍳🍩👅 im on the cover of @gaytimesmag april issue out monday!! my queer little heart is so full right 🌈💓 https://t.co/nROwtJigOA @trulytrxye or better yet sponsor me am i right ladies starburst https://t.co/XwwRsKEC1w @frznta thanks! also your username.. i like @pigglesman cute couple lowkey @kindayours hopefulllllllly not but realisticallllllly yes most definitely @quiffranta the note to self audiobook @spotifyfranta living my best life 💆🏼‍♂️🥂‼️ @intoyusivan 🧀🐀 @ilysbjena cannot confirm nor deny 🤔 @youngIoving 💗💗💗💗💗 @honeysuburbia done and done @crimsonfranta aw thanks @taintedloving thank you my sweet sweet sierra 💌 about a month until my baby is out in the world!! pretty pls use #notetoself if u preorder so i can send u some love https://t.co/46dnLqxC6H https://t.co/Jvx54aIlT0 @trulytrxye thanks caitie! i love when a subtle theme unintentionally pops up ha @velvetfools no (but yes) ((but no)) my house got robbed in my dream last night but the surprise twist was that me + the burglar ended up together!! i love my fugitive boyfriend 😘😘 https://t.co/vqsXsyrawq new video | that time i wore a dress | https://t.co/8KiqRCvVFD | enjoy the reflection, i had a little moment here 💜 https://t.co/53cXEIORG6 hey hi happy #frantasticmonday darlings! new video coming at ya any minute now,, hang tight https://t.co/oZvipRzQn9 @LaurenJauregui aw thank you love! just sent you a dm btw 😇 @LaurenJauregui didnt get a chance to chat today but wanted to say you were beyond captivating and i was entranced/inspired by your passion! @JovannaGerardo thanks for attending!! the crowd participation and attentiveness was just so great kept boasting about how u all are the most intelligent, passionate, inclusive bunch and how proud i am of that today! thanks for being u 👊🏻🌈 @charli_xcx this is far too good charli wtf 👊🏻😩🌹 @latefranta oh @_TiffanyTran_ thanks babe @cloudtsm relaxing, trying to get over my 😷🤧🤒 rushed \ni am flushed \nfrozen\ndead in my tracks \ndazed \ni am phased \nghosts\nflood your memories back @Charlie_Carver rats.. fooled again\nalso 👋🏻🙇🏼 💌 ,\nhttps://t.co/46dnLqxC6H https://t.co/iIjFHtBbgK @tyleroakley i was desperately confused until the very end.. but yes i agree 😪 @JonCozart if you insist a few shots from my sunday shoot with @lukefontana https://t.co/p2DQu1mPl6 @Charlie_Carver was that you i drove by just now and stared at for an abnormal amount of time? @Iostwriter just got here, gotta blast 🥗👨🏼‍🚀🥗 @foolslovers i gotta watch the new ep of this is us first tho @lovebitefranta lemme check my cal\n...\n..\nyup it's today, welcome! @dklaist soup &amp; salad bc im ill but healthy.. if that makes any sense @wiIdIovers cereal, the bowl on top, then throw the carton of milk at it @youngIoving same https://t.co/j2TWQiJaUc @taintedloving but im waiting for my food and i miss you guys @mindfultroye thank you love @easealyssa me @heartencon ive been a bizzie bizzie 🐝 lately and have been doing all the things @_megsglenn love ya tooo @foolforcon i miss her 😢 thank u to all the strong, loving, intelligent and totally badass women in my life. i wouldnt be who i am without u. #internationalwomensday @CaseyNeistat @maxjoseph well this was just fantastic ok but like.. how cute are @commonculture x @pintrill pins i designed? grab 'em here before they're gone https://t.co/OUfYE1aBBs 🙆🏼‍♂️👄 https://t.co/KTTIyJFIHG New Video | This Morning's Hangover Thoughts | https://t.co/frLX4dShla (ft a quick story about the brunch with beyoncé and jay z) https://t.co/FMLXOHriHF happy #frantasticmonday all! new video should be up any minute.. it feels a little 'old school me' i think ?? https://t.co/oZvipRifvB well, beyoncé and jay z sat next to me at brunch today so looks like im emotionally, physically &amp; spiritually unavailable for the next 20yrs @GTsepis i will and i cant recommend it enough ! theres an extra level of depth in there this time thats really worth the listen :) @blacquieregk01 thanks gabrielle 💋 @youtholly i kinda love that @wildheartsivan happier @kerdyyy i felt cute @confranta_ease perhaps connie frannie v2k17? yesterday i wore lipstick and a dress, today im eatin a fat stack of pancakes.. is this what they call 'living the dream' ? @Timtothewild i feeeel @lorde oh ps i was in the middle of a shoot when it dropped so i halted the entire thing and made everyone sit and listen with me @lorde welcome back you were missed!! green light exceeded all my highest of high expectations and i cant wait to hear the rest 💚❇️💚 💌 happy #worldbookday | cant wait to share this with you guys in just under two months wowohwow | https://t.co/46dnLqxC6H  💌 https://t.co/1YKYToiU9H @zedd @alessiacara thanks for the tune to my late night drive. stay is killer (and even better in a fast car) 💫🏁👅 @singularlove just now yeah drove to malibu on the drop of a dime with the air smelling of summer and night humming a whisper as i drove sixty up the coast into nowhere @flamingotroye yeah but not in really a good way i think not like happy but not like sad but not like nervous but not like mad @HaileeSteinfeld finally watched 'the edge of seventeen' and ugh so so good. you killed that performance. thanks for the wonderful film 👐🏻💞 sup https://t.co/jZIrI1N8OG @easevinyI fair.. that was clever.. i'll meet your demands well today i learned i cant say the word \"effortlessly\" out loud.. it took me 12 attempts.. to say a word.. that means 'requiring no effort' peaches in the sky https://t.co/4l15jFDOkG @smoIfIower maybe insta?? i'll be in the booth for a solid 5hrs so it'll have to be around dusk sadly no new video today kiddos but hows about a live stream later when im back from recording my audiobook?? 🙇🏼💋 @heardwell *feels left out* moonlight is such a necessary film and deserves to be given that spotlight. what a win for lgbtq+ representation in the media. wow wow wow. i have a headache \nwhat just happened OH MY GOD @jimmykimmel deceased casanova fucked me over\nleft me dying for your love @wrabel \"most best\" lol @cooIafi if youre reading this then pls send @connorfranta 🥞🥞🥞 @sgfgcaylen im having a breakdown at the thought @trulytrxye i give worship to her daily and you know it @ilysboakIey *screams into pillow* i will not get out of my bed for anything LESS than 3 pancakes @wiltedfranta talent hot important kind adorable a man yes tysm @frantaxobrien shit im wasted @VLOGSIVAN its different! but i think you'll really like it. you wouldnt believe how many hours went into ittt @petaIstroye 👻👻👻👻 @ruinlove yup! it's fresh! also i went to party the other week and she preformed and she was 👌🏻🔥 @starsfaIling so so dope ! hope you like it @sIightlysivan hi loyal ass 🍑👋🏻 @easevinyI tbh i love most scones.. okay most pastries in general actually @actorfranta love you too sweet sweet chey @thirstyfrantaa i do that quite frequently actually @SOLELYFRANTA thanks lauti 🌟 \"i would do bad things to good people to have a blueberry scone in my possession right now\" -me, 2017 transgender kids in 2015:\n75% felt unsafe in school\n54% verbally harassed\n24% physically attacked\n13% sexually assaulted\n\n#protecttranskids RT @SarahEMcBride: Sending love to all the trans students out there. You matter. #ProtectTransKids https://t.co/PTy2rTJmuV trans youth: you are loved, you are supported, you are valid, and you are not alone in this. we are right here beside you. #protecttranskids @blushingIove who even has the time @ardenrose @BenJPierce me as well. @cheerstoconnor on it! i'll see what i can do bb 💛 💌 CONTEST TIME | IM GIVING AWAY A CUSTOMIZED COPY OF MY NEW BOOK | YOU HAVE ONLY TWO WEEKS TO ENTER | https://t.co/X6FBVOrOPb 💌 https://t.co/baC2NkEpOX how dare the man who proposed this degrade and devalue women to the level of 'hosts'?! a womans body is HERS and has nothing to do with MEN. https://t.co/gEpCvzs5JM @banksfranta lol @hypercoIor actual chills not sure im capable of adoring milk &amp; honey by @rupikaur_ more than i do. her honesty is magic. give it a listen https://t.co/qFnVvGHgvS #ad https://t.co/VRFc7Zk6kn @colormebix @/nike the weather may be gloomy but my outfit sure is not https://t.co/rr4O5MnMAW new video | a pretty honest q&amp;a | https://t.co/u4ih61gYfZ https://t.co/EZv0b7aQU7 happppy #frantasticmonday! i have a little vid for you all that'll be up shortly,, make some friends in the # in meantime alright? 🌼🙇🏼🌼 @foolsfallsivan robbery isnt a joke, nicole *suddenly remembers anti didnt win a single grammy* https://t.co/voNdAZIMH1 @LALGBTCenter i thought i could get through today without crying BUT NOPE @darisold love you too babe @lethargicoakley no tears pls @orchidfranta 100% false @lovingsease how much @vidconlester but are you 100% certain your cat is not me ? @gaybayieu p🍿pc🍿rn @baehar03 honestly i'm so sorry @solidsivan what did you just call me @easystreetcon i prefer to call this destiny @milke_miley so so good, you? @notedtolove no thanks im alright @_sameoldlove ok aw in my tipsy state im extra blushing @csmmartin009 glad you liked it, chris ☺️ @JadeHinrich thanks love 💛 hopeful of his future\nwith innocence unknown\ntoo precious for a\nsunken reality \nalready set up\nto set him down\n\n💌 // https://t.co/46dnLqxC6H @heardwell lol andddd you guys already crashed it\ngive it a few minutes, it'll come back up after months of work, my record labels website is finally done!! give https://t.co/qTzyc5suL0 a gander + follow @heardwell pretty plsss 🌷🍒👄 https://t.co/HQIHZ8I9Ym @jadedfooIs on the edge of my seat darling @vidconlester aw haha @boysfixcars duuude so crazy. but like nice too?? watched movies with friends with the windows open and listened to the rain @darkroastfranta gimme that donut.. @EvanEdinger no(a)te to self @youtholly i'll just bury myself with it and call it day @frantamalfoy me in a word https://t.co/4T5MMRbn1z @donutloveshazza spiders ? eat ? oatmeal ? do you think it will evaporate if i walk away slowly and just go back to bed.. ? https://t.co/JfJ8j9JNGs RT @commonculture: new cc color palettes available today | https://t.co/lIj3rYOhuk | enjoy x https://t.co/XliR33FloY never good enough @sivantarjei it's alright i am too lol @THINHEARTSIVAN you brace soul doing that good work i appreciate you @bluemoonsforhim did you learn anything c0oL today sending love to my loves\non this day of love 💋♥️🌹 @pitypml my parents win over everybody else, not an ounce of hesitation @lNSUBURBlA i feel like ive been gone for days for some reason and idk why @_connorsheaven very aw @sunsetsfranta shhhh its a surprise @closeIove cheryl wouldnt send them any other way my mom+dad sent me cookies and chocolate from across the country today. i stan the right people. ❤ @NicolaFranta STOOOOPPPP now im sad 🙁 my precious sweet humble beautiful talented kind gracious loving angel... \n\nwow BRUNO YOU SEXY MAN YOU chanceeeeeee ah!!! c'mon adele you got this baby that beyoncé performance was NEXT LEVEL. that grace. that regality. ughhh @wildsiyuan the yellow jacket doesnt want it to be seen and the yellow jacket always gets its way @PTXofficial @scotthoying @mitchgrassi @kirstin_taylor @Avi_Kaplan @KOlusola CONGRATS BABES AHH !! ! remembering i clinked glasses with raf simons last night https://t.co/VrVYN2JDMW um thank you??? https://t.co/pc842xA1jU wearing @rochambeaunyc at #nyfw https://t.co/xAEHm4eXYe the @calvinklein show was\n*exhales slowly* ..everything 💋❤️ https://t.co/ysqNRIBeus @realDonaldTrump what's it like to be a 70 year old child, im curious? @wiltedfranta i feel like i identify with the blond one the most for some reason @colourmefranta oh i dont lol the blizzard is here and so am i\nwhats kickin' new york ❄️💁🏼‍♂️❄️ @controyes people started saying 'bless u' after a sneeze bc they thought part of ur soul escaped when it happened.. incase u were wondering @delusivesivan an impromptu lunch with my two best friends 😊 @troyehs a genuine \"aw\" just escaped my mouth @FrontSeatRifles oh girl I AM AWARE. this cannot air soon enough. aw thanks babe ❤ https://t.co/LV1ejspWrw @trulytrxye i see you received your copy of note to self early @frantaisbomb 🔥🏊🏻🔥 @SOCALSIVAN no but i collected bugs once upon a time.. but thats a story for never i g2g @bencoakley317 honestly tysm @stripefranta 💌 @mraaronbharucha wait that's so nice to hear im not alone on this! thank YOU @acrylicfranta @homeworkfranta happy birthday &amp; happy day @sammykat1313 ty ty ty 💋 followed you btw @jkraynin 💕 @KianLawley @jccaylen again new video | my one gay regret | https://t.co/C7IFxuDb5w https://t.co/VoxGXuMv9o @Stranger_Things *whispers* yes bitch forever an absolute legend!!\nwell done, @ladygaga ❤❤❤ that \"hi dad, hi mom\" had me in tears so damn quick @gracehelbig @tyleroakley @joselynhughes @raymondbraun @IISuperwomanII my resurrected college self was truly thriving last night i am home in those hands\ni am lost in those lips @playingfranta this freaked me out for a good 5 minutes.. then i noticed it's just the tip of the finger under it @iamjocelynalice 💛💛💛 @strangeconnor OooOoo! i'll check that out @sososivan the last one i watched was called 'class divide'.. it was pretty interesting, definitely recommend! @weirdxmendes WHAT ..um i mean where am i able to listen to this cover? @frandomislife OH NO BABY poor thing, feel better ☹️ @chinuplany maybe a little.. @pmlscutletbowl great right??? @rubycjf just came out this morning! love love love @iamjocelynalice's new song,, oh man there's some serious magic radiating from that chorus https://t.co/eevx5iqwZ6 #ad life has ya boy feelin very content atm 💆🏼‍♂️💫 overheard on the plane:\n\n\"i come to hawaii every year with my wife but she passed last month so this was my first trip alone\"\n\n..my heart 😢 @mitambitch peppermint is a current fan favorite 🍃🍵 @glamourizes honey, thats not vegan @fateofmendes well now doesnt that sound just lovely @babyboosivan tan very tan @Iovelybix million reasons taxi driver: *reaches to change the station playing gaga*\nme: *whispers out of the shadows* ..dont\ntaxi driver:\nme:\ntaxi driver: ...\nme: 🎶🤠🎶 RT @HRC: MUST WATCH: Personal &amp; powerful interview with @ConnorFranta via @attn https://t.co/62qclcMK5s RT @attn: .@ConnorFranta dropped some serious truth bombs about sex, politics, &amp; more in our new episode of #PayingAttention. https://t.co/… @danisnotonfire i'll prepare a tutorial for you daniel 🙄 @scotthoying drink vodka out of a slipper @yellowishfranta buzz buzz @countingtosivan im baaaaaccckk @foolsfallsivan what if the plot twist was: ..this wasnt my first drink @ardenrose i dropped my drink https://t.co/ztdW44VPBz @starsfaIling hell yeah binch @notetoselfnat @/drinkie @YouTube dont !! encourage ! my past ! !!! @AP ah amazing news!! ty ty ty @boyscouts for taking a massive leap in the right direction for transgender youth ❤🌈 @kicktroye thats fuckboy connor get it right RACHEL @slowlysivan sis he dead @doddleoddle sometimes i watch my own videos while drinking my own coffee and wearing my own clothing line new video | reacting to my old tumblr blog | https://t.co/cq3AaQQPlG https://t.co/iztUKHnJtJ @pasteIculture ⏳ im ⌛️ on ⏳ island ⌛️ time ⏳ henny ⌛️ hello muffins 👐🏻 although im on holiday, i still have a new https://t.co/k5iwpNRfcm vid for ya! enjoy #frantasticmonday tag until its up 🌴☀️ on this day in paradise https://t.co/uQVOWwCtQw RT @WajahatAli: If you do support the #MuslimBan today, remember this: you will be remembered as the villains of our children's history boo… @wildheartsivan no just cute @SKAMTR0YE finchies RT @HRC: \"No ban, no wall. Sanctuary for all!\" #LoveConquersHate https://t.co/0eOgVkTQXs @LelandOfficial sh let a girl holiday with her fruit in peace aloha 🍍🌺 https://t.co/xVY8T2wxI9 @frantaxobrien a little indie film called \"why did i tweet this\" and in that moment with his voice shaking, he whispered aloud\n\"i.. i love you\" then turned from the mirror and danced out the f💃🏻cking door @TrevorMoran a popstar my body restless in the present \nmy mind reckless in the past \nmy hope relentless in the future 💌 💌 💌 https://t.co/U0YTjF0WW3 duuuude the Maison Margiela runway from yesterday is unbelievable https://t.co/KtaqrIsNHl ok but if i were a trumpeter rn i'd be furious at what politics have done to my professional brand my darling, my darling @rosesuburbia cannot comprehend @distantsivan 🔥🔥🔥🔥 @distantsivan WHAT i need receipts chloE @wiltedfranta 'yummm noodles' -connor franta, author (2017) @aestivalsivan 320 🌞 @INanaWins love you mom! @cuterthansivan thanks bb @devotionsivan you say this with such confidence?? my book is in amazon's top 10 rn thats crazzzzyy 😲😳😵\nhttps://t.co/nCL9sGGwMM https://t.co/KGqCnmKzzH i want to get a beer with @edsheeran 🍻 new video | let me explain | https://t.co/p3QZLgWrIr | a full explanation of anything and everything that is my new book 💌🙇🏼💌 yooo happy #frantasticmonday monday kiddos! quite a lengthy new video heading your way any minute now https://t.co/k5iwpNRfcm @troyeshalcyon happy bday dudeee hope it's a good one xo @silencesivan THIS 👏🏻 MADE 👏🏻 MY 👏🏻 DAY 👏🏻 @youtholly ty darling! i will @notetoselfnat the way you say 'gotta go' im gasping for air beyond inspired. today was pure magic. well done world, well done ✊🏻 #WomensMarch https://t.co/Oxy0SvWXDc oh you know for damn sure im out here supporting all the unbelievable women that do so much for this world #WomensMarch ❤💋 https://t.co/SzprM7DtoT you've gotta speak up for what you believe in and stand your ground until you're heard, alright? the time is now, dont wait for tmrw 💓👐🏻💓 @vinylfools she doesn't have a name... yet 🤔 @satinmilk just wait until you see the inside.. it's, dare i say, sublime @jolisivan sweet (potato fries) @gxssipfranta ((so yeah luv it)) @gxssipfranta feels very escándalo @RooftopConnor all of the above.. there are most definitely a few good cries melted into those pages tho @iadoreyoutroye ily2 vanessaaaa @collidingsivan this is beyond precious ugh @youthfulfranta ty my sweet @comicfrantas ❤ @starsfaIling love love love 💌 https://t.co/txyk7CCyII 💌 https://t.co/wnrvDJAn3W 💌 if you preorder my new book, pretty pls let me know by using #NoteToSelf | https://t.co/46dnLqxC6H 💌 https://t.co/AoS8b75W98 RT @outmagazine: YouTube Star @ConnorFranta to Release Intimate Sophomore Book, 'Note to Self:' https://t.co/UcQD12Vjqb https://t.co/c34XSi… RT @people: Connor Franta finally reveals his super-secret project https://t.co/c5yuKA9774 https://t.co/DycUzVgLYj 💌 💌 #NoteToSelf 💌 💌\n\nUS: https://t.co/BoSdsY7kA3\nCAN: https://t.co/P7T4NUJQrR\nUK: https://t.co/iLLPGnmzWb\nAUS: https://t.co/55hv31UQ2N https://t.co/TXacKVy8R3 i havent been this happy in forever i loveeee you guys is this what it feels like to get a 14 month secret off your chest HOLY SHIT MY NEW BOOK, NOTE TO SELF, WILL BE IN STORES APRIL 18TH | PREORDER IT HERE | https://t.co/X6FBVOrOPb https://t.co/GZYRLZYQDp Note To Self | Trailer | https://t.co/tXvsf2hhV4 https://t.co/UZNNvAvwer im so exciteddddd ah!! TOMORROWS THE DAY | 11AM PST/2PM EST | https://t.co/UdBiZ0o8or | SET A REMINDER I https://t.co/hGSp8mh1gC my family enjoys the football and they text me a lot when people are footballing and i must say they are extra excited about todays football https://t.co/GQNQDNWprw well now ive ingested far too much caffeine today II https://t.co/WxZ6B10Ohk @greeneyesfranta good good! in the middle of my 'wrapped in blankets, coffee in hand, internet checking' morning routine @pinksnowsivan whaaaaat thats so flattering omg?? III https://t.co/CHf0ZBtqtS kiss me warm again @Ioveskam my foot hurts gotta go bye @isakforhim nope! im 10x more likely to cry while watching any movie on a plane.. not sure what the @science is behind that tho @preservabIe 👋🏻 @comicfrantas brb calling my dad @tortellinitroye dat good sheeeet @adidasfranta 7.5 today 🙌🏻 @vaporrsivan oh the king is apart of the lineup for sure @easeIy tbd.. it doesnt, um, feel good @foolsfallsivan hopping.. with bits of seated choreography mixed in i hurt my foot on a run this morning but all the music im blastin is too\n🔥💃🏻🔥 to not painfully hobble around my living room to IV https://t.co/be9tGmdu9k V https://t.co/tZxnCctOBl so this is narcissism https://t.co/6XZVbzd994 VI https://t.co/MDuKbG70br RT @POTUS: Thank you for everything. My last ask is the same as my first. I'm asking you to believe—not in my ability to create change, but… VII https://t.co/644fKZSZZ5 1.17.17 @foolsfallsivan hey i enjoy calling people bud too! i think.. i think we might be friends now @starsfaIling end this madness @lizakoshy um hi you looked beyond gorgeous last night.. had me very 😮😍 @frantaxobrien sweet dreams, mariam 🌟 @Iovemefranta okay i wont @Iovelycon @IISuperwomanII new year, new brain collab? @trashcannottrsh i dont like this i appreciate you all, thanks for existing ❤️ new video | goodbye me, hello me | https://t.co/WkQjgxCFue happy #frantasticmonday kiddos! hang tight, use the hashtag and make some friends https://t.co/k5iwpNRfcm new video comin' at ya in a jiff 💋 @justinbieber wait meeeeeeeee i was feeeeelin myself today https://t.co/4P9llnIQnv @mads_37 now we're talking @rootsfranta soft, flowy, fun.. i approve @hoIyverses this week is about the pants ! @doddleoddle @commonculture @_JOSHEDWARDS_ i like manager josh on that note.. i woke up thinking about needing more colorful pants in my life so this weekend imma go buy some damn colorful pants 😛 a message to the masses: wear whatever tf you want and let other people wear whatever tf they want, simple as that xo RT @VanityFair: Michelle Obama's emotional final speech is a must-see. https://t.co/hSmp9HqTvN eds two new songs are out omg im sweating @commonIove sh im flirting git @quiffranta i fall in love with the fictional serial killer.. again *spoils* @frantaphil enough of them to make me feel weird about it ! ! @lostboycurls would 10/10 spend the rest of my life with matthew gray gubler why criminal minds gotta go make the serial killer hot and make me feel weird for thinking a completely fictional serial killer is hot 😩 im overwhelmed\nby the mere\nthought\nof you @CaseyNeistat thanks bud! you still owe me that run next time im in nyc 🏃🏻🔥 @frantaspotify https://t.co/sjLz8XiFYc not to brag but i just ran a half marathon...\nok im bragging but wtf go me right??! @MistaGraham enjoy your getaway, grahammm ❤ @people dont https://t.co/znqwSyNeyR @odetosleepsivan thank god it was the only photo i got before i leapt i have my cameras 'live mode' turned on and it caught my midselfie reaction to a person walking into the restroom https://t.co/3dm2c5hqr0 @nervemendes YES I RAN OUTSIDE BC BEAUTY i know sunset photos are overplayed but mother nature really showed up tonight and deserves her recognition 😩🥇 https://t.co/Nj2721u2uJ @ardenrose i MISS you. come HOME. new video | if im being honest about last year... | https://t.co/2RBc3KDwQf\n\nretweet for a new year follow x 🎉 happy first #frantasticmonday of 2017 everybody!! let's get the ball rolling with a new video in a few https://t.co/k5iwpNRfcm 🎉 @blushingIove my new favorite account. i stan bread lady. @islandsivan im incredibly bored @ConnorFranta https://t.co/tOlnxPHhMX @ConnorFranta i feel bad, i should only use my photoshop skills for GOOD... 😪😢 new year, new meme https://t.co/FTNYEMBLbh hello new year, nice to meet you RT @NYRE: Hiiiii @ConnorFranta! 👋 Happy New Year! #RockinEve https://t.co/n4UwLdJJsV @impIicitroye i see this indirect. i see it and do not appreciate it. epiphanies with connor https://t.co/W5NT83PJdI @whiterosefranta i screenshotted and sent to her 👍🏻 @moderntroyes im happy if you're happy @kitchnsinksivan ❤❤❤ @FRANTASSTARS that's the nicest thing anybody has ever said to me @Igbtjade honestly tysm @aspirefools it's a tree but it plays the part well, right? @Ioveitall more for me @sivanscoffee 👶🏼🌳 @countingtosivan found that out a couple month ago too... blew my mind current tummy status: \nhappily filled with brussels sprouts ☀️🌊 https://t.co/GWqjHoYv8D @ConnorFranta i guess its all in my head 🙆🏼‍♂️🤷🏼‍♂️ new things will forever be uncomfortable to me but whats cool is how significantly more comfortable they seem to be the second time around @lovebitefranta im desperate please love me @exhaleyouth https://t.co/MEM07ad5It @crayonoakley https://t.co/TREoWB8ToI @easevinyI my brand https://t.co/Lb6m7DQtyh @wildboutroye what about same products, new colors 🤔 @cosmicphilipml im boring af @heardtroye fair enough @countingtosivan roses are bread, violets are stew, i'm really hungry and messed up this poem bye @passionIove https://t.co/pVi7tD8EUE @talkmebIue a subtle peach perhaps @frittatafranta moonlight and la la land are two of favorites from this year @thetiffomatic ive run roughly 50 miles in the past week 🕺🏻💥 @sinceritysivan the happiest i've been in a very long time ☺️ life is good, hope you're well too xo surely you’ll regret a life you lived in regret @dressedindrama thought of you https://t.co/Eu0hMkT117 @youtholly done &amp; done 💋 new video | what i wear in a week | https://t.co/jvSmNCZU6j 👕👟🎒 @RestlessSivan i idolize her @AaronRhodes @raymondbraun @tyleroakley QUIT YELLING BOTH ARE GREAT thankful for my family and thankful for you all, merry christmas everyone 🤶🏻❤ @lushsivan home alone home alone home alone @frantasushi truly terrifying @stickersivan ..you really should get that checked out @sunsetsmellet (((((yes))))) due to popular demand.. ho ho ho im back bitches 🎅🏻 i know holidays are not the greatest time for everyone, so to anyone struggling in anyway, im sending endless love to wherever you may be 💌 happy christmas eve everyone!! 8:33am https://t.co/dq7tM4sYRI @koreykuhl asdfahdsjflkdahfofa @ConnorFranta typo *sigh* reverting to my old ways 🙄 not even 24 hours into our holiday and my siblings has already gotten me to run 13 miles,, only in my family lol @regionallove so relaxed, maggie 🐣 @frandomislife new season GET READY @suburbiasivan i got it at a thrift store and strongly believe it was made for me king of fashion or prince of the gay agenda.. you decide https://t.co/6rhrUjsJOh for the love of humanity \nlove all within humanity @heardtroye ??? https://t.co/HrugpWAVtH @_bree_clayton_ mmhm! all over.. 😇 @maia_cats seeing my familyyyyy! we are never all in the same place at once anymore, so every time we are, it's beyond special to me @alyannafllsgn my garbage disposal broke so i called a plumber for the first time (i think ever??) and had him fix it for me! *adult* @frantaissues 💛💛💛💛💛 @JoshstAndrew aww precious!! i remember this/you @wydugIy nah let's keep going 🙈 @Allistar88 aw that's great @troyesfoolz here are a few locations:\nhttps://t.co/Y6sqsPXUaL\nhttps://t.co/W002QlIz6A\nhttps://t.co/sygKdBqv4t\n\nor simply volunteer ur time! *pause* \nquick q: does your family help others over the holidays? if so, how? there are SO many ways to help those in need this season 🙇🏼❤ @vaporsculture practice practice practice \n\nwrite about your day, make up a fictional story, rift on a humorous interaction.. anything! @stephanie_zayn so my family isnt doing gifts this year, we're picking out clothes/toys together and bringing them to a children's hospital @sparkstronnor dozens actually,, i write a new poem almost every day https://t.co/qH8bZ7MFCV @fetchfranta and that was a goal of mine from last year (see 'new year, new me') that i wanted, but was unsure of how to.. do? @fetchfranta i think i know myself on a vastly deeper, more personal level than i did last year @senpailukey honestly i cannot get here quick enough.. @liontroye omg play the license plate game or ispy or or um.. that's all i got @toulousetroye i do for but only for a couple weeks. it's pretty and all, but im a small human and get cold very easily ❄️😬❄️ @satinmilk i am actually! but i like to take my time when i do it. i make it a joyous activity. listen to music, be very precise. all that. @beIovedsivan NOPE \n\nany secrets i would like to hide? YUP @iluconnorfranta sooo good! i was beyond productive. yours? @MlGRAlNEFRANTA 🎁 done 🎁 @pacifiiy https://t.co/i6OVo7LfrR @feeIatease im such a sucker for @michaelbuble's 'its beginning to look a lot like christmas',, so classic everythings winding down for the holidays and im READY for relaxation.. lets catch up on everything before i pack and head out #askcon #ad https://t.co/4KY1oyx1vU morning / afternoon / evening https://t.co/BdNG1uxAAz @talkmebIue https://t.co/B14QXr86BK @trxyegeorgie we are a blessed collective arent we?? @deepdishsivan pls exit stage left @xnyannsx wow that's incredibly thoughtful of you,, i have NO plans to quit, simply to.. reimagine how i use my platforms i guess @wiltedtroye ugh so so nice to hear,, i want to get to a place where i upload frequently AND am consistently proud of what i make, you know? @devilsgotmysouI an easy 11/10, not playing one bit @brightestfranta https://t.co/jeh1xxYQs3 @sivankiss thats um... thats a strange way to phrase that @BunchofCodyness nope! thanks for the reminder actually @onlyfoolsbieber everything honestly @stylesrogue not yet but i will!!\n\n⚠️no⚠️spoilers⚠️please⚠️ happy day, happy me ☺️ @easeIy always henny @aIwayswill 🍳☕️🥐 @koseisak no violet beams drift me to daydream https://t.co/YtfAk1JLY8 @Iocalfools https://t.co/A97I2gs1zW @sweeseytodd things could have been different https://t.co/UzgadBn4iE RT @commonculture: 💋🥀 | https://t.co/v6Hj7KO4nB https://t.co/C223eDhrRA @ConnorFranta look how CUTE my replies are,, i feel blessed 🙆🏼‍♂️💓 https://t.co/6yXJ8lkL1w hi i love you @Frantabucks_ @commonculture AH this is first order ive seen anyone receive from the new collection AH @scotthoying come over NOW try the US, we have plenty of it\n\nand if you come back in 2017, we'll have even more for you in the White House! https://t.co/mvm479TxMl @reflectedsivan i just used my phone @edsheeran WELCOME BACK when you finish eating that first reese's and remember they come in packs of 2 https://t.co/6bZEOs50Sq @blushingIove i finally got it back today !! la la land https://t.co/FPYyM3ORIa @frantashadow STOP new video | i cant believe you asked me that | https://t.co/SFa1SNr7Uu\n\n💛 rt / share it with your friends 💛 @starboysivan omg never,, this was a super extreme edit bc i was bored and felt like a challenge photoshopped this on my phone in like 5 minutes.. 😳 https://t.co/1Hqb9nxmdY @nicwkelly 🙇🏼🙇🏼🙇🏼 RT @commonculture: new season of clothing | available now | https://t.co/lIj3rYwGCM https://t.co/OsgnZotakI hey hi i only have this hotel room for another hour so hows about i film something,, send me some q's? preferably odd/bizarre ones?? #askcon @darkroastfranta they were actually so cool,, i ❤️ my large security team @yikesconnor my dad made them, no joke @blushingIove they wouldnt do it and made me look bad !!! \n\n(but i appreciate them) lol https://t.co/X2VImQ6nqy minnesota you have my heart\ni f💛cking love you @ConnorFranta this for everyone who keep telling me to ! vlog ! again ! new video | what happened in new york city |  https://t.co/cLavEka4VJ 💛 new season of @commonculture clothing is now available +\n  shipping worldwide https://t.co/Y5Z20kgmbE 💛 https://t.co/5pDy1d3C4d @pecanoakley not really actually ha new video and new cc drop this morning kiddos 👶🏻💋 what a cute day to remind myself to be proud to be myself 😌🏳️‍🌈 if only little closeted connor could see where he is today and how comfortable he feels being himself.. wow would he not believe it ive been openly gay now for 2 whole years wow thats craaaazy 😳 @fruitfulfranta currently 20° 😳 @sourpatchfranta ive been singing that ever since the first snow sighting @talkmebIue i havent seen her in a YEAR ‼️❄️‼️ https://t.co/hxanmB7Ojz what a day. thank you new york, you're a special bunch and i love love seeing you 💋✨ @easeIy VERY. also thoughtful / fun do carpool karaoke with @JKCorden? [✔︎]\n\n..in the year of realizing things i realized literally ANYTHING is possible https://t.co/zeLkAu58oa @wrabel *grabs mic* \n\nBABY I WAS BORN THIS WAY @iandavidmonroe play that bop at my funeral #2006v2016\n\nless hair, more gay https://t.co/lLfk3XRKNB 💛 https://t.co/AGFOxsC4Nb @edgefranta done xo @bubbly_franta @commonculture cuuuuuuuuute @capturedfranta has there ever been a statement laced with more truth? @MikeyMurphy i... i think im your mom's #1 fan @tragictroye @UrbanOutfitters ahh it continues to make me happy!! hope you liked everything :) @distantvalley not 100% sure yet! i kinda wanna do a daily vlog in nyc and maybe something more cinematic? thoughts?? @blueskyfranta thank you, i appreciate you/that 💛 sadly i didnt have time to film a video for today sweet angels but im thinking of uploading one friday and possibly two more next week 🌻🌻🌻 @tyleroakley you've never seen an episode of the greatest show on television?\n\n..what's sadness like? if you're not here to talk about shameless consistently being the greatest show on television then im not here to talk to you i ! hate ! how ! early ! it ! gets ! dark ! a few for JÓN Magazine | by Leigh Keily https://t.co/lhRYIIhDzL @MarcusButler ..i love you too https://t.co/k51JtStrwK @craftyfranta quit it hey folks im live streaming right. this. second. come hang out with meeee https://t.co/VsMMIkgwjr #ad anyone up for a live stream in like 30 minutes?? download the app for free rn and i'll be right there https://t.co/VsMMIkgwjr #ad 🙋🏼‍♂️🌻 thank you for tonight austin!! ya'll were the sweetest and there were so many longtime fans which made my heart happy 💞💞💞 im on the cover of JON Magazine's Winter Issue | available online today + on newsstands 12/9 |  https://t.co/bU2sobcwbl x https://t.co/tuLX0kkTmd just found $10 on the ground and honestly this must be what it feels like to win the lottery,, mama's eatin' good tonight honey 💸😩💸 @dreamyfools oops.. my b.. or rather my t... ypo\n\ni'll see myself out now @Ietsgohavefun im head over heals for the green hat @faintedrose mayyyyyybeeeeeee @howellsoakley right back at ya evelyn @countingtosivan ...go on @lumosconnor after seeing fantastic beasts the other day im even more here for this that i would normally be ! ! @qualityfranta how'd it go?? @sososivan a strange combo of stress and peace.. @MikeyMurphy congrats buddy!! very very proud of you today was a dream,, thank you for coming out my loves in los angeles 💕💕💕💕 @GlLMOREGlRLS @commonculture @UrbanOutfitters omg the sign. the sign is cute omg."}