{"tweets": "Si hay algo común a todos los deportes, son esos gestos que reflejan la pasión con lo que los vivimos. No te pierdas ninguno con @Movistar_es, sea cual sea tu deporte. #UnPaísDeExpertos https://t.co/KTabhUlxFd Acaban de comunicarme la triste noticia del fallecimiento de #AndresGimeno. Sin duda uno de los pioneros del tenis en España y un gran deportista. Un sentido saludo a su familia. D.E.P. Los loros de @movistar_es han descubierto los juegos de #MovistarHome, y me parece que ya han gastado el comodín de la llamada 😉  #ExpertosEnTenis https://t.co/AdUeKsRy9J Sad I won’t be able to play today. \nI have an inflammation on my left wrist. \nI will be supporting #teameurope from the bench! \n\n#vamos 🇪🇺 \n@lavercup \nwhat a week it’s been! https://t.co/iVx43qg0Et ¡Hoy empieza el master del #RafaNadalTour! Este año no podré estar en esta última etapa del circuito juvenil, que además se juega en la @rnadalacademy, pero aquí va un mensaje para los jugadores ☺\n@frnadal https://t.co/s144YUVZJ4 Do you want to meet me at the Australian Open? Flights, hotel and courtside seats are all included! Support Special Olympics Spain and enter for your chance to win: https://t.co/eKPuaJLODN RT @rickyrubio9: ... 🌹 https://t.co/cbFg8Uw08A ¡¡¡¡¡Enhorabuena CAMPEONES!!!!! \n@BaloncestoESP @FIBAWC muy contento por todos !!!!! 🇪🇸 https://t.co/WJCBNdhNou ¡Qué grandes! En la final del mundial de basket! Gran victoria hoy. Suerte para la final!!! @FIBAWC @BaloncestoESP #VamosEspana 💪🏻🇪🇸 Thanks @babolat \n#PureAero https://t.co/H3EBDNXGLU Thanks @rnadalacademy!!! https://t.co/bZKVQuoiob Triste por la noticia del fallecimiento de una deportista importante en la historia del deporte español. Pionera en nuestro país en su deporte. Mucho ánimo y fuerza a su hija y familia en estos momentos tan tristes y difíciles. D.E.P. Blanca Fernandez-Ochoa Acabo de enterarme de la terrible noticia del fallecimiento de Xana. \nEstoy muy triste y no puedo ni imaginar el dolor de la familia. \nUn abrazo enorme a Luis enrique y toda la familia desde la distancia. \nMucha fuerza y ánimos en estos momentos tan duros! All set for the last slam of the year with my #PureAero from @babolat \n#vamos @usopen https://t.co/VGJ834HSRq Hey guys, once again excited to join all the kids at #ArthurAsheKidsDay to kick off the @usopen on Aug. 24! See you in NYC! https://t.co/cpaYSIRocR My relationship with @babolat and the #PureAero https://t.co/A9bQV4aBne Contento de que por primera vez el #RafaNadalTour se juegue también en #Bilbao, donde esta semana se disputa el último torneo antes del master. ¡A darlo todo, chic@s! @frnadal https://t.co/V5Hm1NwVUg Amazing match well deserved win by @rogerfederer  I had some chances but... Roger played better. Good luck for the final @Wimbledon 2019. Thanks all for the support. Always fantastic to be here. See you next year! 😘 ¡Empieza #Wimbledon 2019! Y gracias a @MovistarPlus podréis vivirlo sin tener que estar presente aquí en persona.\n#EscuchaCrecerLaHierba disfrutando del mejor tenis 💪 https://t.co/2Bv1pk2gVa Enhorabuena la selección española 🇪🇸Sub 21 por el título. Felicidades campeones! #EurocopaSub21 @rfef Competing or just for fun, whatever, simply enjoy and try your best. Ready for #Wimbledon\n@babolat #PureAero #WeLiveForThis https://t.co/iWafJ7kxVE Fantastic night with #teameurope @LaverCup #2019 #london pre @Wimbledon #dinner @ZelaLondon @ZelaRestaurants RT @Charlymoya: Después de una buena semana de entrenamiento en Mallorca,@rafaelnadal ya está en Wimbledon.Como es habitual desde que entré… El #RafaNadalTour es un circuito juvenil a beneficio de mi fundación @frnadal. Tenis, entrenamientos en valores y solidaridad. ¡Hasta el sábado en Alicante! #Vamos https://t.co/j5AIQeB0Qd https://t.co/Mv1JHd6iSL This Monday.. after @Rolandgarros back to practice &amp; starting to prepare for @wimbledon at the best place possible for me.. Nothing like being at home and practice. Thanks @mallorcaopen organisers for allowing me to practice at their tournament and best of luck! 💪🏻👏🏻😉 RT @fundacionTef: 🎾\"Un partido en el que nadie se queda atrás\".\n@RafaelNadal, con #ElLadoSocialdelaEraDigital https://t.co/3zVCwhefkt Thanks @Nike for your support. Nice video! https://t.co/fCLyadv6mI Merci @rolandgarros for this amazing experience. 12!! Still can't believe it https://t.co/iNj8Me4iRJ Thanks all for the messages today! 🙏 #vamos @ Paris, France https://t.co/wRHYxPkRet Comme chaque année, merci d’avoir fêter mon anniversaire avec moi. Merci pour vos vœux. #fft #staff #happybirthday @rolandgarros @ ROLAND-GARROS https://t.co/SWmXi1WAVP Desde Paris aquí en @rolandgarros quisiera mandar un fuerte abrazo y muchos ánimos a la familia de #joseantonioreyes D.E.P. El #RafaNadalTourbyMapfre estos días hace parada en Valencia. ¡Un abrazo desde Paris! \nAntes que rivales, compañeros. Así se vive la competición en este circuito.\n 👋🏻💪🏻😉 https://t.co/bhwI0rSQEy Muy ilusionado de poder compartir esta nueva colaboración con @cantabrialabses @heliocare y teniendo muy en cuenta el #DíaMundialDelMelanoma. ¡Hay que protegerse de las enfermedades de la piel! https://t.co/UOVevtBugF I look back 15 years ago and it seems incredible to me everything we’ve achieved. Thank you friends of @kiamotorsiberia, for trusting me then, during and now. Can’t wait to see what our future holds https://t.co/EhgzWUacp8 I always work with a goal, and the goal is to improve as a player and as a person. Ready for #RG19.\n@babolat #PureAero #WeLiveForThis https://t.co/wWN6XpLibF @ATP_Tour @DavidFerrer87 @TennisTV Special moment, special player, great person. Thanks Ferru! Una vez más, GRACIAS FERRU!!!!! https://t.co/Ta4JZackto ¿Qué te hace ser mejor? El trabajo diario, rodearte de un buen equipo, el nivel de los rivales... #SuperarnosParaSerMejores @movistar_es https://t.co/NmYkiWWHrO ?Qeu selupñ aatgre mjjjt Mañana estaré con mis amigos de @MAPFRE en su espacio de innovación. 10 años ya acompañándome. Muchas gracias 🙏 #MAPFREpreguntaRafa RT @rnadalacademy: 😊 @RafaelNadal + @Naomi_Osaka_ = 😍 VAMOS!! Welcome to the #RafaNadalAcademy! 🔝📸 https://t.co/5yIZroAP04 Un abrazo enorme a @IkerCasillas en este momento. Fuerza Iker ! Going to sleep still under shock with the images we see in Paris. All my support to all Parisians and French people and authorities. @PompiersParis @notredameparis #NotreDamedeParis RT @rnadalacademy: Last practice at the #RafaNadalAcademy! 🔥\n\nComing 🔜... Montecarlo! VAMOS @RafaelNadal! 💪🏼 https://t.co/hzbubeQGS6 Me gusta ver como juegan, como aprenden y comparten experiencias. A partir de mañana, 500 jóvenes tenistas participarán en el #RafaNadalTour en Valldoreix (Barcelona). ¡Vamos! \n@frnadal https://t.co/p7npv1a136 Oggi appena rientrato in Spagna, ho saputo della scomparsa di una persona del nostro mondo del tennis. Sempre triste quando accade una cosa del genere. Le mie condoglianze alla moglie e la famiglia di Cino Marchese. Ci sarai sempre nei nostri pensieri. #RIP #CINOMARCHESE ¿Dónde vivir? ¿Ciudad o pueblo? No te pierdas la charla que tuve con @Jrhodespianist en https://t.co/EXbfL16jyk https://t.co/vzOpNRclN9 RT @FundacionCruyff: Es un honor contar con el apoyo de uno de los mejores tenistas de todos los tiempos. ¡Muchas gracias @RafaelNadal!\n\n#C… Hello #IndianWells, here we are! 😉💪🏻🙏😘 Gracias a todos los fans en #Mexico siempre es especial jugar aquí en #Acapulco nos vemos el año que viene https://t.co/fFUPc8QxEK Únete al #RetoSolidarioOscarMayer de @valdemoro13 Con cada pronóstico, @oscarmayerspain donará 2€ a mi fundación, @frnadal.\nY gana 2 entradas + alojamiento para #FinalFour🏀 en VITORIA.\nCómo participar y bases legales aquí: https://t.co/BRywKrc8O1 https://t.co/phcNIeoNSb Rafa Nadal Tennis Centre will kick off at Sani Resort, Greece, in May! 😃 https://t.co/sX2ZGoo3cJ A partir de mañana, el #RafaNadalTour llega a Sevilla! Además de jugar a tenis, estos son algunos de los valores del deporte que se entrenan en cada etapa de este circuito juvenil. ¡Muy importantes todos ellos! @frnadal https://t.co/68uKzmCDgN Buenas noticias 😀🇲🇽 Nos vemos por allí el próximo lunes donde asistiré a la inauguración \nGreat news and I see you in Costa Mujeres on Monday... inaugural day of the @RafaNadalTC https://t.co/hCwU9ZOxdx RT @BancoSabadell: #LiveRafaNadal | El próximo 7/02 a partir de las 18h, nueva cita con nuestro embajador @RafaelNadal. Podrás seguirlo #en… @StefTsitsipas Thanks for your post and as I said on the court you have everything to become a multi grand slam champion! Difficult to explain. Very happy!!! https://t.co/I0MR9KI8LQ Thanks for the support!!! Vamossss https://t.co/J1IcnAQKsA Desde Melbourne, enhorabuena a la @frnadal y gracias a @eldesmarque por el premio! https://t.co/nIFyNmZaNG Congrats @andy_murray for all your achievements all these years. It was great to play against you all these years. Good luck with everything! https://t.co/BaOsYZ5KTo At the new @RafaNadalTC in Costa Mujeres, México players can train following the guidelines of the @rnadalacademy \nas they enjoy their family. Come &amp; enjoy the facilities of @palladiumhotels &amp; live a high performance experience in the Mexican caribbean! 🎾🌴#RafaNadalTennisCentre https://t.co/l25jqvgqI8 Nuevo año, nueva edición del #RafaNadalTour👏 Mucha suerte a todos los que estos días estáis en #Barcelona participando en el primer torneo del circuito. Y sobre todo, ¡a disfrutarlo! @frnadal https://t.co/Tlcvy3Wl2J Throwback to when I won four previous #MWTC titles! Hoping to grab my 5th one this year @MubadalaTennis. #YallaRafa https://t.co/DER3nA3cLO Gracias!!! 👏 https://t.co/nAzDU8fLrQ Evento maravilloso de la @frnadal y @sportmundi #olazazabalnadalinvitational 2018! Todos los beneficios por nuestro lado para los afectados en #SantLlorenç  muchísimas gracias a estos profesionales por su presencia https://t.co/Pl32sRQd5u Os animo a ver esta película sobre personas extraordinarias. ¡Enhorabuena a todo el equipo! #championsthemovie #FYCforeignlanguagefilm #Spain #campeoneslapeli https://t.co/fBtVGVGPvv 👇🏻💪🏻 entrenamiento, practice! https://t.co/z0nQNQvWnv Hey Marc! I accept the challenge and here’s my video💪 I nominate @jamunar_38 @marclopeztarres &amp; @llorentefer19 #VolleyingChallenge #GoToTheWallAgainstCancer https://t.co/GibcWAiQU0 Las conexiones más importantes son las humanas https://t.co/01HheJ14ZL What do you think of my new video?\nPreparing for 2019 with the new @babolat #PureAero. https://t.co/Yl5puUQaYZ La dieta Mediterránea es también una de las mejores cosas de nuestro país 😊 @spain has one of the best cuisines in the world! #SpainIn10Sec #VisitSpain #Gastronomy https://t.co/PkQCmBKKj7 https://t.co/UOWQuFNGZv @nalbandiandavid El placer fue lio tenerte en casa! Abrazo y gracias David! Me voy pocos días de vacaciones.... ya de camino a Miami. Ahora toca relajarse en el Dreamliner de @aireuropa  😉 https://t.co/shumyk60XV Hola a todos. Gracias por los mensajes que he recibido ayer y hoy. La operación en el tobillo fue bien y ya desde casa comentaros que aplazamos el partido de exhibición previsto en beneficio de los damnificados en Llevant de Mallorca. De esta manera espero estar en plenas condiciones para la próxima temporada. \nGracias a todos por el apoyo. Es cierto que lo teníamos detectado desde hace tiempo y de vez en cuando me molestaba. Sin embargo dado que el problema en el músculo abdominal me impide también jugar en Londres, aprovechamos el momento para remover el cuerpo libre y evitar futuros problemas. Desafortunadamente tuve el problema del abdominal en Paris la semana pasada y, además, tengo un cuerpo libre en la articulación del tobillo que tiene que ser removido en quirófano hoy. He hecho todo lo posible para llegar a final de temporada en buenas condiciones, tanto a Paris como a Londres, haciendo las cosas bien y me apetecía mucho jugar. Hola a todos:\nOs escribo estas palabras como final de temporada. Ha sido un año complicado, muy bueno a nivel tenístico cuando he podido jugar y a su vez muy malo en lo que a lesiones se refiere. Hi all! Back home... Great to host the world’s best triathletes at the #RafaNadalSportsCentre world champions @jgomeznoya and @mariomola! Super League Mallorca this weekend 3 &amp; 4 Nov at Porto Cristo. It’s going to be a fantastic weekend here in Mallorca 🇪🇸 https://t.co/dQazrZMdxF @BlancheMelvin1 @goib @conselleriaCPE @esportsIB Yes. We will give that information shortly. Thanks Muy contento de anunciar que el próximo dia 7 de diciembre jugaremos una exhibición en Palma de Mallorca a beneficio de los damnificados de San Llorenç. Gracias por la ayuda y apoyo a @goib @conselleriaCPE y @esportsib RT @MAPFRE: La #confianza es uno de los valores que compartimos con @RafaelNadal. En este vídeo, el nº 1 del mundo nos comparte su cara más… Hoy he participado en la presentación de #MovistarHome, el nuevo dispositivo que reinventa el hogar, con los loros de @movistar_es que no paran quietos 😉 #DiHolaAMovistarHome #OKAura https://t.co/ttKFElgb4S Aquí podemos todos ayudar. We can all help here 👇🏻 https://t.co/1t5b8BbkGc Día triste en Mallorca. Mi más sincera condolencia a los familiares de los fallecidos y heridos por las graves inundaciones en San Llorenç. Tal y como hicimos ayer volvemos a ofrecer hoy las instalaciones de @rnadalacademy para todos los afectados que necesiten alojamiento Thanks for the invitation and looking forward to playing and visiting for the first time ! https://t.co/hAKr5K4bnq Apoyemos a esta joven atleta española que puede ganar este premio https://t.co/P6VO5Oenm6 ¡Todo mi apoyo! https://t.co/ZPLf7swNTQ Do you know why I like doing sports at home so much? Let me show you in 10 seconds! ¿Sabéis por qué me gusta tanto hacer deportes en casa? Os lo enseño en 10 segundos! 🏃☀ @spain #SpainIn10Sec #VisitSpain\n\nhttps://t.co/tCH3hmoc0j https://t.co/4XC7TwnCqv Lamento no poder estar con todos los fans en China que son tantos y con los organizadores de los torneos de Beijing y Shanghai que siempre han tenido todas las atenciones conmigo y mi equipo. hemos decidido junto con mi equipo médico y técnico la no participación en la gira asiática para recuperar la rodilla de la manera que siempre hemos hecho. Hola a todos, como sabéis tuve que retirarme del partido de semifinales en el US Open y este pasado lunes estuve en Barcelona mirando con los médicos la situación de mi rodilla. Si bien las molestias en mi rodilla no son nada nuevo, Feliz de haber participado hoy en este evento tan especial ! https://t.co/mf2UOntHYT Feliz de haber participado en la clausura del encuentro « Más que Tenis » para deportistas con discapacidad intelectual que ha sido promovido por la @frnadal y #SpecialOlympicsEspaña.… https://t.co/yQRnY2vFty Espero os guste, @davidbroncano y yo con el equipo de @Vamos! A partir del día 16, hay un nuevo lugar donde vivir el deporte: #Vamos de @MovistarPlus https://t.co/CfL2HC3Ls3 les deseo todo lo mejor. Estaré animando como un aficionado más. Había hecho un buen calendario pensando en mis objetivos, incluido la copa Davis, una de las razones de no jugar Cincinnati. \nMuy triste por no poder intentar ayudar al equipo para jugar la final y estoy convencido que los que van a jugar lo van a hacer de la menor manera posible Hola a todos, ya de camino para casa, además de haber perdido la oportunidad de jugar una nueva final de Gran Slam aquí en Nueva York, ya sabréis que finalmente no puedo jugar la Copa Davis este próximo fin de semana en Lille contra #Francia. On my way back to the hotel now. Amazing match against a great player and great guy! And thanks #newyork for the amazing atmosphere and support @usopen https://t.co/DuT2N9YcPg Let’s go practice! On my way to the stadium @usopen practice from 12 to 1 💪🏻 On my way to the @usopen draw ceremony ... let’s see how it goes   De camino ya para participar en el sorteo del cuadro del @usopen 💪🏻🙏😉 Good morning to all... On my way to #NYC happy to announce I'll be back at #ArthurAsheKidsDay Aug. 25 at the @USOpen––playing for @FRNadal. See you there! 💪🏻🎾 #vamos\nBuenos días a todos... camino de NY... estaré en el Kid's Day el sábado 25 en NY 😉\nhttps://t.co/8DbAFziHug Gracias por esto. Many thanks. Unforgettable moment. Momento inolvidable 😉💪🏻☺️ https://t.co/rGSqYNmg3I Hola a todos... interesante esto y además... me he colado en el spot de los futboloros de Movistar España 😜\n#Holafutboleros +SPOT 😉\n\nhttps://t.co/w88fKyRTLU I am sure I’ll see them next year and I am sorry I won’t be with them this year.\nThanks for all the support as always. who after speaking to him on the phone understood what I said and understand the situation. I am sure the tournament will be a success and I wish him and his team all the best.\nI am also sad for those amazing fans in Cincy and around who always gave me great support. I am very sorry to announce that I won’t be playing in Cincinnati this year. No other reason than personally taking care of my body and trying to keep as healthy as I feel now. \nI am very thankful to my friend Andre Silva, Tournament Director of the Cincinnati tournament, RT @rnadalacademy: ¡Ya entrena @RafaelNadal en la @rogerscup! 💪🏼💪🏼 https://t.co/UqZ7tE4sP5 Hoy me han dado una triste noticia. El periodista de @abc_es  Domingo Pérez que durante años siguió el circuito al principio de mi carrera, ha fallecido hoy en el día de su cumpleaños. Todo mi apoyo a su familia y en especial a su mujer. Un beso grande RT @ClinicaTenis: Así son los Servicios Médicos de la @ClinicaTenis by @MAPFRE por dentro. ¡ Os esperamos ! 👍🏻\n\nThis is how de medical serv… 👀 @babolat https://t.co/XPASath2mA En el #RafaNadalTour hay dos rankings: el de tenis y el de valores! Estos días en #Madrid, última oportunidad para clasificarse para el master que se disputará en septiembre en @rnadalacademy junto con mi fundación @frnadal ;) https://t.co/GdBWSpuxig La playa es una de las cosas que más me gusta de España. ¿Y a vosotros qué es lo que más os gusta de España? #SpainIn10Sec #VisitSpain @spain https://t.co/CZaC7pOi7g Todo mi apoyo a mi equipo en la academia. ¡Importante noticia! https://t.co/kMt3wsVmOP Un pequeño mensaje a todos mis seguidores. Gracias por el apoyo durante Wimbledon. No pudo ser y ahora sólo felicitar al campeón @DjokerNole  yo ya de vuelta en casa y ahora me tomaré unas vacaciones antes de empezar a preparar la gira norteamericana 💪🏻 Warm up done....  feeling good.... waiting now for my match @wimbledon #vamos 💪🏻 ya esperando el partido después del calentamiento esta mañana @ Wimbledon https://t.co/Ujy9s3KXWC Mid Sunday practice @Wimbledon with some know guys sharing the three courts 😉 https://t.co/ZIZmeXRFpS Believe me that the brakes on that 🚲 are not the best, downhill wasn’t that much fun ..... 👍🏻 but I made it 😃 https://t.co/QXpZGEnDeq #vamos :-) https://t.co/xbNI6u36Tl Always smile! 😊 #vamos et merci 🙏 https://t.co/0kOfIadKPh Espectacular el sitio y gracias por el apoyo @Wimbledon https://t.co/GrXMEi1jgh Great to be here 😘🙏 and thanks for the support! https://t.co/8ncS6L1oCN Tenía ganas de que llegara #LaHoraDelTenis. Es el turno de Wimbledon, síguelo en exclusiva en @MovistarTenis! https://t.co/srry4lVeTY RT @Wimbledon: Rafael Nadal began his quest for a third #Wimbledon title with victory on Tuesday\n\nhttps://t.co/K2XT6ONQA9 #vamos https://t.co/9rF2Mv4zFp Good morning everyone! Less sun today at Wimbledon but still good weather 🎾On my way now to practice @Wimbledon #aorangi Great news before we start playing @Wimbledon Check out the video... 😀 #vamos https://t.co/iw1eS2TobT On my way to practice @wimbledon then off to the beautiful club  #Hurlingham to play my last match @Tennis_Classic at 2pm. See you there? 😉💪🏻🎾 Here we are @Wimbledon ! Aquí estamos! 💪🏻😉👇🏻 https://t.co/pkRpmBHDCK Happy to announce that I’ll be back at @AspallTennisClassic as part of my @wimbledon warm up! 😀💪🏻👇🏻 https://t.co/cqJudXgfo0 Mañana acaba la etapa de #Alicante del #RafaNadalTourbyMapfre, el circuito de #tenis a beneficio de mi fundación @frnadal. Suerte a los finalistas y enhorabuena a todos los que habéis participado! https://t.co/QScgIhnPJK Día espectacular y por una buena causa. Gracias a @Richard_Mille y @24hoursoflemans por la invitación y el honor https://t.co/WO7Psc3aAR With @Babolat, I’m giving away one of the 11 Limited Edition #UNDECIMA packs.\nEnter by posting your own “11” celebration using #UNDECIMA!\n📲 https://t.co/T78tM30Qh4 https://t.co/xAklF2gYPk RT @movistar_es: Porque no hay mayor triunfo que tener el apoyo de una afición incondicional. Ahora más que nunca todos con la @SeFutbol. ¡… Very sorry to announce this withdrawal but I have to take some rest according to my doctor after q long clay court season. Hope to see you next year at this great tennis and social event! https://t.co/m3O7izIDMq Facing a new opponent. You might just recognise him… @NintendoEurope #MarioTennis https://t.co/CHK9Aied9l https://t.co/bGtmxTRuBy Hello everybody. You can imagine the happiness today. Now back at home in Mallorca and will post later some pictures on my Instagram account from these weeks at @rolandgarros thanks all for your support https://t.co/mXcyz1m5TO Gracias @rnadalacademy!!!! #NOL1M1TS https://t.co/bJWNYyvzkk Bonjour Paris! Desayuno y vamos para el entrenamiento! Breakfast and let’s go to practice! 💪🏻😉💯 Love this court, the most important in my career, these are amazing moments. Many thanks to all. Another final in Paris !!!!! #vamos \n\nImpresionante esta pista, la más importante de mi carrera, momentos increíbles. Muchas gracias a todos! Otra final en Paris!!!!\n@rolandgarros https://t.co/Z803HSCtVy Ready !!!! #vamos @rolandgarros https://t.co/mQ2ArPxOHM Rain ☔️ in Paris, match postponed. Back at the hotel and time to regroup a bit for tomorrow #weknewitwastough\n\nDe vuelta en el hotel y ya con el pensamiento en el partido mañana. A descansar y mañana más. https://t.co/AEuh3hn77m Good morning, on my way to the tournament for my pre match warm up I send you this link to help the Victims of volcano eruption Guate in Guatemala. #help #guatemalavolcano https://t.co/mdDOkLYUZG Buenos días a todos. Camino ya del torneo para el calentamiento, os envío esta dirección para que ayudemos a los afectados por el volcán en Guatemala #ayudemos https://t.co/mdDOkLYUZG Día lluvioso hoy en Paris, de mucha espera para poder entrenar. Así que algo de gym ahora y después esperemos que deje de llover y vayamos al torneo a entrenar 💪🏻 #vamos Buenos días, Bonjour, rainy day here in Paris... lot of waiting today for practice... so a bit of gym at the C.N.E. of the @FFTennis before heading to @rolandgarros for practice 💪🏻 Jumping to quarter finals! Very happy with the match and deep into the second week! \n\nUn salto a la siguiente ronda!  Ya metido de lleno en la segunda semana del torneo! \n\nVamos! \n@rolandgarros https://t.co/38OEvgIbpj Muchas gracias!!!!!!!! https://t.co/X2fmYG0rkA 😀😘 https://t.co/v8agR8vEIW Time to go to practice.... Thanks for all your birthday messages :)\n\nHora para ir a entrenar 💪🏻 y gracias por todos los mensajes por mi cumpleaños 🎂 https://t.co/RoDPCm9lDr Good morning to all.\nBuenos días a todos \nBonjour \nEste fue un momento también especial ayer tras la victoria. Gracias y espero que lo pasaras bien 😃 https://t.co/hUTTghpbLj Contento por el partido de hoy! El sábado siguiente ronda contra un buen amigo!\nHappy with today’s match! Saturday next round against a good guy and friend! \n@rolandgarros #Vamos https://t.co/KLINy1ytO4 Bueno días a todos! Good morning all! Bonjour !\nOn my way soon to @rolandgarros to my warm up and getting ready for the match  / Camino pronto del torneo para el calentamiento pre partido #vamos Enhorabuena al Real Madrid por los títulos. Champions y Euroliga en un mismo año, increíble. ¡A disfrutar este momento histórico! https://t.co/P5d2Hxj39h Enhorabona! A disfrutar d’aquest moment tan important! Estic molt content! L’any que ve a primera!💪🏻 https://t.co/59lowcuG2e All smiles and getting ready. Tomorrow first round, looking forward to my first match @rolandgarros 2018\n\nMañana primera ronda aquí en Paris. Por ahora todo bien y siempre con la sonrisa 😁 https://t.co/rMLyACK3Jn Pero... ahora de nuevo a las 5, entrenamos por la tarde. 💪🏻😀  and back to practice at 5pm today https://t.co/OmosI7bOWs Primer entrenamiento en @rolandgarros con un buen amigo, @PabloCuevas22 #tennis #paris #tenis https://t.co/RxCnZcDtwZ De camino a Paris... nos vemos allí?\nParis, j’arrive! On se voit là :) (je essaye en Français cette année) 😉👋🏻 #vamos @rolandgarros This is how I celebrate winning a big point. What about you?\nShow me your celebration using #TheDecima for a chance to be my VIP @babolat guest at @RolandGarros.\n📲https://t.co/itdKta3iX9 https://t.co/PEbqStUqH3 Grazie 😊 https://t.co/4l8QS2llhs Grazie della intervista. Si è fatta prima del torneo ed e andato tutto bene. Gracias por la entrevista! https://t.co/QwtF9LtRgd Couldn't be happier traveling back home now with this trophy in my hands... Took this picture at the locker room for you guys, Thanks for the support!!! https://t.co/iNbbdOKGXe Molto molto felice di ritornare a giocare una finale qui a #Roma #Grazie #Italia #tennis #tenis #gracias #Vamos Great crowds today playing the local hero. Many thanks Rome for an amazing sportsmanship and respect for both. \nGrazie Roma per il tifo oggi in maniera molto rispettosa. A domani ! https://t.co/CaVwyARBK2 ¿Y a vosotros qué es lo que más os gusta de España? @spain #SpainIn10Sec #VisitSpain #Challenge https://t.co/nxzyVebngP https://t.co/8xqZbbjsDS ¿Sabéis qué hacemos los días como hoy que llueve mientras nos dan una pista de entrenamiento en #Roma ? Yo lo tengo claro 😬☔️🤔 @MariaSharapova Thanks Maria! It’s been a pleasure hitting with the you a few balls 👍🏻😊👏🏻 Ciao a tutti !!! vi aspetto a Roma!  😉😜😘 https://t.co/DKuYPQc1P5 Buenos días a todos, Good morning to all! Lástima por la derrota de ayer, pero #dominicthiem jugó mejor y mereció ganar. Sad for yesterday’s defeat but Dominic played better. Hoy ya viajamos para Roma. Today we fly to Rome. Ci vediamo questa sera a #Roma Good start to the tournament. Thanks all for the support. Great to play at home with this amazing crowds. https://t.co/N7B2G2GiDH ¿Cómo será el deporte dentro de unos años gracias a IoT? \nCambiarán muchas cosas, pero seguro que seguiremos haciendo lo que más nos gusta, jugar al tenis.\n#BienvenidoATelefonicaIoT #MovistarLikesRafa https://t.co/VRSaGhp4DV Check out my Instagram account and see if you’ve done this before. The question is: 3 minutes or just 1 at -196 Celsius.... very very cold !!! #madrid #postpractice https://t.co/GD2Mh8R9Ff Cena entretenida con equipo y amigos. Mañana a seguir preparando el inicio del torneo aquí en Madrid. Buenas noches a tod@s https://t.co/y3gLdGcF5x Last chance to win a trip to Paris &amp; meet me in person with one of your friends! You still have one last chance to enter my @Prizeo campaign by donating to @onedrop &amp; the Rafa Nadal Foundation @frnadal, two causes that are close to my heart! https://t.co/0LApUeneJu https://t.co/fgEYJspCbc My @babolat rackets are a big part of #TheDecima story.\nWhat about your story?\nShare a pic with your racket using #TheDecima for a chance to be my VIP guest at @RolandGarros.\n📲https://t.co/itdKta3iX9 https://t.co/fmfN0rPnxQ Interesante participar en este foro de tecnología y deporte #Madrid #España #telefonica https://t.co/jkHKYouBam Así fue el pasado torneo del #RafaNadalTourbyMapfre. Me gusta ver como disfrutáis jugando a tenis y entrenando valores 😉 A partir de mañana, ¡turno de Zaragoza! @frnadal https://t.co/zdTF5S6gWk Mañana jueves, a partir de las 19:00, estaré respondiendo preguntas en directo a través de un Facebook Live organizado por #kiaespaña . ¡Mandadme vuestras preguntas en los comentarios de este post! \nPodéis seguir la retransmisión en directo en este enlace: https://t.co/WhV7ZGo4yP https://t.co/YlUi7BBvP5 Don’t forget to donate $10 to @Onedrop and @frnadal and get a chance to win a trip to Paris to meet me in person- with a friend!  #onedrop #fundacionrafanadal https://t.co/0LApUeneJu https://t.co/Igdp1vMfxe Tengo una pregunta para vosotros… 😉 #SabadellFuturos https://t.co/P46tk5k6sE Gracias a todos y en particular a mi equipo aquí en #barcelona #bcnopenbs #vamos #undecima https://t.co/d1ZhHZbsJR Contento de mi debut en #Barcelona \nAhora toca descansar, cenar bien y prepararse para el partido de mañana \n#vamos\n@bcnopenbs https://t.co/Hr2vcP0NLH Ya en #Barcelona para saltar mañana a la tierra batida del #BCNOpenBS. Con ganas de compartir más tenis con los amigos de @BancoSabadell y con todos vosotros 😉 https://t.co/038MBZxoRX Gracias siempre a los niños que nos ayudan en cada torneo! Qué momento tan especial! https://t.co/BppUMWMfQn Ya en Barcelona !!!! Gracias a todos por los mensajes. Fue una semana especial!!! #feliz . Thanks to all for your messages from Barcelona !!!! What a great week it was! #happy #MonteCarlo #nowinbcn https://t.co/2KfT4PEu2D Otra final en #Monaco muy contento! Another final in #Monaco and very happy! https://t.co/cvNQ2i7bAO Gracias por el apoyo. Merci pour le soutien. Thanks for the support! \nGran partido hoy! Muy contento de estar en semifinales :) #Vamos https://t.co/gyizmH98tR Enhorabuena @RICARDODEDIEGO te lo mereces !!!! Congrats, you really deserve this award!!! https://t.co/BAbUNMgw4c For only a $10 donation to @Onedrop and @frnadal, get a chance to win a trip to Paris and to meet me with one of your friends! https://t.co/0LApUeEPB2 https://t.co/6QZwu7DXCf #TheDecima began at Tennis Club Manacor.\nWhere does your story start?\nShare your tennis court with #TheDecima for a chance to be my VIP @babolat guest at @rolandgarros.\n📲 https://t.co/itdKta3iX9 https://t.co/P5E2k1BGAB Bonjour Monaco. Toujours bien cette tournoi ! :-) #vamos https://t.co/wgx0kJXvk3 VAMOS! New @babolat #PureAeroDecima. I’m ready to challenge #MyDecima at @rolandgarros. https://t.co/jzzitaqHh1 Cuando te los pasas bien en una entrevista con chicos, esta tarde, con el equipo de España @CopaDavis :-) https://t.co/m3f0BSYzGw Hoy día en familia... Aquí en #Mallorca, Sa Punta 🙂 https://t.co/iHNTWZzwl2 Un abrazo grande desde Mallorca y muchos ánimos en estos momentos tan duros @santicanizares https://t.co/tdALwF0B0w Hoy ha empezado en Valldoreix, Barcelona, una nueva etapa del #RafaNadalTour. 10 días por delante para dar lo mejor de uno mismo, dentro y fuera de la pista 😉 ¡Vamos!\n@frnadal https://t.co/IvUb5qWkGk Hoy en Barcelona, visita al Dr. Ruiz-Cotorro para ver la evolución de la lesión 👌👍 https://t.co/vwxEzWQ1Uw Hi all, I'm happy to introduce the new Official Online Store of #RafaNadalAcademybyMovistar  You can also collaborate with my Foundation through its products on sale. Check it out!\n\nhttps://t.co/w8UuaKfMfM ¡Hola a todos! \nOs presento la nueva Tienda Online Oficial de #RafaNadalAcademybyMovistar, donde además podrás colaborar con la #FundacionRafaNadal y sus productos solidarios.\nhttps://t.co/w8UuaKfMfM Hola a todos. Lamentablemente me veo obligado a escribiros esto.../ Unfortunately, the injury I suffered in Acapulco... https://t.co/IqrEHvMhHH Os presento a Aura #HelloAura. Impresionante cómo la inteligencia artificial de @Telefonica me ayuda a disfrutar con el mejor tenis y mucho más #MovistarLikesRafa #TelefonicaMWC https://t.co/KYL8GUUj6x @paugasol Qué intriga Pau... ya nos dirás! 😉 En juego la etapa de Sevilla del #RafaNadalTour. Este es el 5º año del circuito y no deja de sorprender el buen nivel de los chicos y chicas! Seguid así! Con @frnadal https://t.co/elWTe9yulF Amazed by @PostcodeLoterij social commitment. It's an honour to be an ambassador for this organisation, which I thank for their support to my foundation @frnadal. Happy to have shared the #goedgeldgala experience with #LeonardoDicaprio https://t.co/tbi68ipXin Impresionado con el fuerte compromiso social que tiene @PostcodeLoterij. Es un honor ser embajador de esta entidad, a la que doy gracias por su apoyo a mi fundación @frnadal.  Muy contento de haber compartido la experiencia de la #goedgeldgala con #LeonardoDicaprio! https://t.co/q8VyvS1q9g Querida Debora, por favor dale las gracias de mi parte a tu bisabuela por esta emotiva carta y su contenido que llega al corazón. Todas las cartas y muestras de apoyo que recibo de todos vosotros significan mucho para mí. Muchas gracias https://t.co/jgkh7Hdjpv Es increíble todo lo que pasa en internet mientras estoy jugando al tenis #MovistarLikesRafa https://t.co/Vf9nZeckii Excited to be playing here again... https://t.co/BOZdPA7Vk1 Nothing to do with yesterday’s event or tomorrow, but I played it in Melbourne and was great. https://t.co/45S8wb7LlE #NYC https://t.co/NPmdQimbMr RT @ClinicaTenis: Momento en el que iniciamos una nueva aventura con @MAPFRE \n\n👌🏻Todo el equipo estamos muy ilusionados con este proyecto q… Vamossssss! Siguiendo la eliminatoria desde casa en @rnadalacademy #DavisCup #España https://t.co/QsAEn37Qqy RT @BancoSabadell: Nuestro embajador @RafaelNadal estará con nosotros el miércoles a partir de las 17:30h. Síguelo #endirecto 🔴 con @inform… RT @babolat: What’s your tribe? \n#PureAero #PureDrive #PureStrike https://t.co/2YOeR7ZRYs @cilic_marin Thanks Marin and congrats on your match! You played unbelievable! @paugasol Gracias Pau!!!!! Eres un fenómeno. Un abrazo amigo! Sadly leaving the #ausopen tonight. I’ll get an MRI tomorrow morning to see what is the injury. Thanks for the support to all my fans https://t.co/KwTf56G7aG Txs @AustralianOpen for making this nice piece on my Academy, exciting project that is already fully active and working back in Spain https://t.co/6NPE7SuhuA Tough match to go into the QF! Vamosssssssssssssss! https://t.co/WNeJlNP73c Hey all, tomorrow 3rd on RLA, looking forward to that. In the mean time, today, we had lunch at the beach. #team #teamnadal #tradition #weekend #AusOpen https://t.co/ERiNh6yhDu RT @FundacionEcomar: RECORDATORIO #ConciertoSolidario Invitación Concierto Homenaje a Deportistas Españoles 26-01-18 @OCRTVE. Organiza: @de… RT @AustralianOpen: Wow... a @RafaelNadal special! \n\n#AusOpen https://t.co/aR2QBQfKHA RT @AustralianOpen: No. 1 seed.\nNo. 1 smile.\n@RafaelNadal \n#AusOpen https://t.co/SYNQglkfKF Buenos días a todos, good morning!!! Hoy (today) a las @ 7 en (on) #margaretcourtarena aquí en el (here) @AustralianOpen #vamos :-) #newwaytowrite :) UNTIL WE ALL WIN #EQUALITY https://t.co/eaVKpeQ4zk RT @kiamotorsiberia: Todos juntos somos uno, preparados para crear una gran #sorpresa. Preparados para el espectáculo. ¡Vuelve el @Australi… Monday start @AustralianOpen getting ready. #vamos https://t.co/02zv7g5Opv RT @RICARDODEDIEGO: Australian Open VIK Ceremony with Rafa Nadal and Lleyton Hewitt &amp; KIA Stinger @RafaelNadal Special Edition 😍 @Australia… Thank you Iain for always taking care of us during the @AustralianOpen and for your hospitality. It was lovely to spend some time with your family! Gracias de corazón https://t.co/PZs8zDmMrg Draw came out and I’ll be playing @la_pouille . Really looking forward to stepping onto the #margaretcourtarena to play my first #TBTens on Wednesday night! https://t.co/QVmh8RTi1V Already in Melbourne! Practiced today @RodLaverArena and also excited for the @tiebreaktens coming up on Wednesday 10th! https://t.co/gXGZjnVqwZ On my way to Melbourne @AustralianOpen and will be playing the #tiebreaktens on Wednesday 10th looking forward to seeing you there! You guys ready? @DjokerNole @stanwawrinka @NickKyrgios @lleytonhewitt I will be seeing my Aussie fans when I land on the 4th in Melbourne and start there my preparation for the Australian Open. I am sorry to announce I won’t be coming to Brisbane this year. My intention was to play but I am still not ready after last year’s long season and the late start of my preparation. \nI had a great time there and it was a great start to the month I spent in Australia Os deseo una Feliz Navidad a todos los que la celebréis. Que tengáis un buen día con vuestros seres mas queridos. ¡Felices fiestas! \n\nI wish you a merry Christmas to everyone celebrating it. Have a good day with your beloved ones. Happy holidays! RT @babolat: HAPPY HOLIDAYS! #PlayToBeWild https://t.co/hvYxjS0dul Gran clase de #spinning en #RafaNadalSportCentre!! Buen trabajo a todos! @RNadalAcademy #somsporttime  👏👏🎅 https://t.co/GyvsNJgH7S Ya no queda nada para la 5ª edición del #RafaNadalTour! En este circuito los chic@s juegan y aprenden valores y los beneficios van a la @frnadal. Primera etapa en Barcelona! Suerte a tod@s! https://t.co/sdQru5PODt Excited to be on the cover of the new @AustralianOpen video game. See you soon #AOTennis https://t.co/f2cnU9apho Gracias @AirEuropa!👏 https://t.co/s7KMlfYim0 Muy agradecido al Conde de Godó y al @bcnopenbs por la entrega de la segunda réplica. #gracias https://t.co/8Ql17RIobg RT @CasaReal: Los Reyes entregan los \"Premios As del Deporte\" #As50Años @diarioas @miss_belmont @RafaelNadal @Ruthypeich https://t.co/AmYfA… Muy afortunado de conocer a los pilotos que nos llevan de vuelta a casa, tras estos días de vacaciones. Gracias @AirEuropa! Lucky to have met the pilots that will fly us back home after the holidays. Thanks #AirEuropa! https://t.co/AL77Fx9Ix4 La semana que viene en @Telefonica Flagship Store Madrid podrás ver los trofeos del #RafaNadalMuseumXperience y jugar conmigo a través de un increíble juego VR! https://t.co/g06mBClvZN Disfrutando de estos días con mis amigos y familia... Adivináis dónde estamos? 😉\nEnjoying some days of holidays with my friends and loved ones... Can you guys guess where we are? https://t.co/HUdr2nHYZF RT @MAPFRE_ES: 7.000 millas después nuestros #Valientos ya están en Ciudad del Cabo tras una gran segunda etapa ¡Enhorabuena equipo! 🙌🏼#Vam… RT @GranRecogidaMad: ¡Ya puedes apuntarte a la @GranRecogidaMad ! ➡ 1, 2 y 3 de Diciembre. Necesitamos 22.000 voluntarios ¿Nos ayudas? http… Check out how you can join the surprise at Australian Open 2018! Thanks for the great opportunity! @Kia_Motors https://t.co/7f92lqpLg0 RT @bcnopenbs: Cuatro campeones del @bcnopenbs coinciden en la pista del @rctb1899 https://t.co/5MJMtUTff0 As you can see in the media, today is a happy day for me, my team and my fans. The French justice... https://t.co/Pt4bnwQQU0 Como podréis ver en los medios de comunicación, hoy es un día feliz para mí, mi equipo y mis fans. La justicia francesa ha resuelto en favor de mi honestidad e integridad como deportista... https://t.co/Pt4bnwQQU0 RT @MAPFRE_ES: ¿Qué le pasa a @RafaelNadal? ¡Haz clic y entérate! Porque ni los deportistas profesionales pueden controlarlo todo.. https:/… RT @Kia_Motors: We believe in the power to surprise. See how #Kia’s special visit to Keon Park Tennis Club made everyone smile - the #AusOp… Having a great night out at the #ATP gala! https://t.co/YWgcWBvkk9 Ya camino a casa después de una dolorosa decisión... // Leaving Paris now after a painful decision... https://t.co/sV8zNKyARE Calentando para el partido de esta noche en el gimnasio del hotel #DCmoments. @Plaza_Athenee @DC_LuxuryHotels https://t.co/LO7jjDwGsg A message to thank you for all your support. #Vamos https://t.co/mk9cfcIRRu Un mensaje para agradeceros todo el cariño y apoyo. Muy contento por este logro... #Vamossss https://t.co/BqQYAl9nq2 ¿Sabes cuántas horas juego al tenis al año? #RNMovistar https://t.co/twYsGAU9nk RT @RCD_Mallorca: 👉#SomelMallorca 🔴⚫️ https://t.co/26jLmeTLU5 This morning we'll be posting some special videos for all of you on @rnadalacademy... stay tuned, you'll love them! Esta mañana desde @rnadalacademy publicaremos un par de videos especiales para todos vosotros... Estad atentos 😉 Os encantarán... Espectacular el nuevo Kia Stinger que me han entregado en la #RafaNadalAcademy! Gracias @RICARDODEDIEGO https://t.co/xmuvmgaf9J I sadly announce that I have to pull out of the Swiss Indoors Basel, after... https://t.co/hXuflDRZLJ Tristemente tengo que deciros que no participaré en el torneo de Basilea tras ver... https://t.co/hXuflDRZLJ Lamentando lo ocurrido en Galicia, Asturias y Portugal... Horror e impotencia...Todo mi apoyo a los familiares de los fallecidos. Great tour in China, with the title in Beijing and the final in Shanghai! This isn't over, let's keep going! Gran gira en China, con título en Beijing y final aquí en Shanghai! Esto no ha acabado, seguimos! Outdoor play today here in Shanghai.  Vamos! https://t.co/ZAdxTAT9aq On my way to practice. Court 5 #shanghai #tennis #practice pics on my IG account later :-) Gracias a todos y en particular a mi equipo esta semana aquí en Beijing! Vamoss\n\nThanks to everyone and to my team for this week in Beijing! https://t.co/IDhHFeqeqC Resting at home after these intense days in #Prague. Very happy for yesterday's victory and for such an exciting @LaverCup!! #TeamEurope 👏👏👏 https://t.co/vtVGQ8HSNB En casa descansando tras estos días intensos en #Praga Muy contento por la victoria de ayer y por una @LaverCup tan emocionante! #TeamEurope https://t.co/zY35mGuCWx 📸 con mi compañero de dobles @RogerFederer👌Muy contento de haber jugado con Roger @LaverCup #TeamEurope https://t.co/lVtfVE0WPC 📸 with my doubles partner @RogerFederer! Happy to have played with Roger for a change😉 @LaverCup #TeamEurope https://t.co/uHqXAN9Pk6 An hour ago, in the dressing room talking tactics. Today I'm so lucky to have @rogerfederer next to me on the court! #TeamEurope @LaverCup https://t.co/OjaNf2Wkfp Hace una hora hablando de táctica en el vestuario. Hoy tengo la suerte de tener a @RogerFederer a mi lado de la pista! #TeamEurope @Lavercup https://t.co/iazqul6CGy RT @LaverCup: They've played against each other 37 times at tour level.\nNow they play together for the first time.\nIntroducing #FedalUtd \n#… RT @rodlaver: Great tennis from @RafaelNadal and @rogerfederer today. Like everyone else, I am looking forward to seeing them play doubles… RT @TheSergioGarcia: History will be made today @LaverCup with @rogerfederer &amp; @RafaelNadal playing doubles together for the 1st time vs @S… Empieza el master del #RafaNadalTour en @rnadalacademy Desde Praga deseo mucha suerte a los 32 clasificados!Los beneficios son para @frnadal https://t.co/WY2IKSWmye Terribles noticias de Mexico. Todo mi apoyo a los afectados y a los familiares de las víctimas. Hoy a las 17:30h hablaré con @marclopeztarres y @lolaochoaribes en el evento de @BancoSabadell!! #RafaNadalEnMálaga https://t.co/gFs3SYStKD Enhorabuena @PauGasol por otro torneo fantástico y llegar de nuevo al mejor 5º del #Eurobasket2017. Eres enorme!!! https://t.co/lbMu60b9cH Enhorabuena a @Carlossainz55 🇪🇸por su primer 4º lugar en la #F1  #gpsingapore🇸🇬 https://t.co/wH4UdUlwLe Acabo de darme cuenta de que terceras personas han entrado en mi perfil haciendo un uso inaceptable.Ya la he recuperado.Lamento lo sucedido. Dos dias de descanso antes de hacer un breve viaje... ya os diré algo... RT @babolat: #PlayToBeWild @RafaelNadal https://t.co/jihSKyQoZh RT @usopen: 2010.\n2013.\n2017.\n\n#usopen https://t.co/oJsuvzQTKG RT @usopen: Oh hey there Champ 🏆\n\n@RafaelNadal #usopen https://t.co/ZMOGb9niP8 Leaving NY shortly. My last moments of work was with these guys, Spain's media reps. @NewYorkPalace thanks for a great hospitality! https://t.co/eP6JMY2Yjj .@Nike has put this poster in the big city!! It looks amazing, don’t you think? Thanks @nike for your support #NY https://t.co/70JXK6N4hf Mensajito para agradeceros el apoyo. Ahora toca celebrar #usopen 17 https://t.co/lByqdBNBN7 Vamossssssss thanks and celebration time #usopen 17 https://t.co/O0k0lhHtvT .@RNadalAcademy has made this video for me!! Thanks to all the students, players, coaches and staff!! #Vamosss https://t.co/XieNlcBpMC Match point. Always a special feeling and a tough one! #USOpen https://t.co/UpGRCTf9hD Very happy for this win, and ... I'll go live on my Facebook page live in around 15-20 minutes ;-) @RafaelNadal Great win today, back in the SF @usopen special moments again here #USOpen 17 | Muy contento por la victoria de hoy. Momentos especiales https://t.co/Du0Y6C18eH Vamossss!!! Thanks NY!!!! https://t.co/C1fbuMP46V RT @usopen: Out of this world for most...\n\nStandard for @RafaelNadal...\n\n#USOpen https://t.co/rtOKwXtY7h Into the second week of the @usopen !!! #vamos #ESPN https://t.co/iO4tpMGC68 Congrats Serena!!!  So much joy for you!!! https://t.co/u4edTrqIbB Order of play out and tomorrow day 3rd on Ashe #USOpen Looking forward to this new challenge! Mañana 3 de la central del @usopen. Vamos! 2nd round tonight, warm up now &amp; getting ready for the match. Looking forward to an exciting &amp; electric night session @usopen #USOpen 2017 RT @ClinicaTenis: Would you like to have the official towel of @usopen ? RT and follow us to participate!Good luck🎾😉 https://t.co/uWJMIHSS4u @misterjonesmtl @usopen 😳 Guess what, had a good practice today, went out for lunch and now back at the hotel waiting for the OOP @usopen for tomorrow. Guess when RT @usopen: Rafa rolls through his R1 match vs Lajovic, 7-6, 6-2, 6-2!\n\n#USOpen https://t.co/SXuB3nLXt0 … https://t.co/JRYspcORyj . @usopen here we go! Getting ready for tomorrow. 3rd on Ashe day match! #vamos https://t.co/gSjh4gPHpE Hoy es el cumpleaños de alguien del equipo.... Feliz cumpleaños @Charlymoya https://t.co/lOSYCmfN3B RT @babolat: 🗽#PlayToBeWild https://t.co/irjw7m5S5i Had great fun at the “Lotte New York Palace Invitational” @newyorkpalace  #PalacePerks https://t.co/v6BTuzT80N @newyorkpalaceny, #PalacePerks, had great fun at the Lotte New York Palace Invitational @ Lotte… https://t.co/jrNktx7D1R Gettin' ready on Armstrong court. Thanks guys for coming! Big crowds #aakd #usopentennis https://t.co/HQFZ5XoXG4 Thank you very much for 10 years of support. https://t.co/UVimx01c7N https://t.co/H2DOia3n6r https://t.co/klr2YRB9gi Destrozado por lo que ha ocurrido en Barcelona! Todo mi apoyo a las familias afectadas y a la ciudad. Entrenando en #Cincinnati! Practicing in Cincinnati! https://t.co/b7BMY4hfpo Muchos días de alegría en el deporte español y hoy uno de los peores y más tristes para nuestro país. D.E.P. Angel Nieto. #leyenda12+1 https://t.co/89GfudHNwd Happy to have practiced at @rnadalacademy these days 😉👌 https://t.co/psRawiZ1N7 Muchas felicidades @miss_belmont por tus 3 medallas en este Mundial! Enorme!! https://t.co/jcNDinHPHp Thank you @Kia_Motors for giving me this present for #LaDecima. Really appreciate your support! https://t.co/fyYi91QlxX Mucha fuerza Angel Nieto. Estamos todos contigo. Ánimos Great practice today with @GrigorDimitrov at @RNadalAcademy https://t.co/sVHEr4ofTi RT @babolat: We are @babolat. #PlayToBeWild https://t.co/EXTY1R3LdS Feliz con la entrada de @cristiano en TATEL @tatelrestaurant @ZelaRestaurants. Bienvenido! @paugasol @enriqueiglesias #TATELrestaurants https://t.co/KmbHDtAuj0 El #RafaNadalTour se juega estos días en Madrid, donde además del tenis los chic@s disfrutan y aprenden con los valores del deporte @frnadal https://t.co/zr8G9kxxMo Muchas felicidades @GarbiMuguruza campeona de @Wimbledon!!! Gran éxito para el tenis español!\n\n📸 @Wimbledon https://t.co/wdkQdQJFfO Suerte @GarbiMuguruza!!! https://t.co/DavdWKeEt8 Apuesta aceptada @PauGasol. @RealMadrid volverá a demostrar lo que vale! Prepárate para invitarme pero mejor en #ZelaIbiza #HalaMadrid https://t.co/NyHVDf81S9 Bet accepted @PauGasol! I'm sure @RealMadrid takes it all. Be ready to invite me but let's meet at #ZelaIbiza #HalaMadrid https://t.co/I366i1BrK6 Ready for the match! https://t.co/B7MJJxN2TP RT @ClinicaTenis: Would you like to have the official towel of @Wimbledon 🌱 ?RT and follow us to participate!Good luck🎾😉 https://t.co/tUh7G… De excursión en bici con mis primos! Cycling with my cousins! https://t.co/ySVGX04cy7 Always thankful to have people helping when you are having problems 😂 Thank you for your help Nick! https://t.co/jgdrh34LLS Getting ready for tomorrow. Good news no rain ☔😉 https://t.co/zo8UD4OhsH #WeLiveForThis @babolat https://t.co/EKAyUy7jwL Back to Wimbledon, back to Centre Court. Happy!!! https://t.co/mCaCbBalzh https://t.co/6kczPActNl Un placer conocer a los invitados de @telefonica en #Hurlingham! @O2 https://t.co/4Y3I7bfXKQ Thank you @Nike for the tribute in the Nike Store #PortaldelAngel in #Barcelona! #VamosRafa #justdoit https://t.co/O6USm5wEYb Gracias a @Nike por el homenaje en la Nike Store #PortaldelAngel en #Barcelona! #VamosRafa #justdoit https://t.co/DnJJVTqdYS Check out the gear @babolat sent me for @wimbledon! #WeLiveForThis https://t.co/tKqwCNmNpS Training at #Wimbledon! https://t.co/BSVBOa7AyT First practice session at #AorangiPark! https://t.co/d0TQ7SJK0Z At the @Olympics, I did this. Let it inspire you to get active for #OlympicDay on 23 June. What are you going to do? https://t.co/BVIo49lwkg Loving my new Gocycle G3! Encantado con mi nueva Gocycle G3! https://t.co/vXY89mP0wU Estos son algunos de los #valores presentes en el #RafaNadalTour, que hasta el sábado se juega en #Alicante. ¿Cuál añadiríais? Con @frnadal https://t.co/A6Nq1hOVzk Such a lovely night with incredible people at Zela Restaurant in #Ibiza. Thanks a lot for the amazing food. https://t.co/OEbRiwC2nj RT @ChinaOpen: 2005 Singles &amp; defending Doubles champion @RafaelNadal will return to Beijing for his 7th appearance in #ChinaOpen ! Welcome… A special La Decima @babolat #PureAero! I'm giving one away to say thanks to you. Download &amp; follow me to enter: https://t.co/5lFz727Cgv https://t.co/PJoNMLE4RY I’m so proud about our students! Congratulations guys! #RafaNadalAcademy https://t.co/mTJsc6wRaW I'm very sorry to say that I'm not going to be able play Queen’s next week. I am sad to make this decision.  https://t.co/TNczE7Iifv La Décima de @rolandgarros ya está en #RafaNadalMuseum ¡Gracias a todos! Os esperamos en Mallorca. https://t.co/OgaWhMdDkV https://t.co/XFKygHJuD5 The 10th title of @rolandgarros is in #RafaNadalMuseum. ¡Thank you all! We are waiting you in Mallorca. https://t.co/OgaWhMdDkV https://t.co/oTamQYX7Ex #CHAMP10N https://t.co/BV0M1qE7NE #CHAMP10N RT @rnadalacademy: The kids are sending strength to @RafaelNadal for @RolandGarros! If you want to join, post a pic doing the 💪 gesture for… Ahora puedes conectarte en directo en #Eurosport y comentar los partidos gracias a @movistar_es https://t.co/WOF86a4BPU Thank you all for you birthday wishes. Here's a pic with the amazing people in @rolandgarros https://t.co/LstDgXcNxD Gracias a todos por las felicitaciones de cumpleaños. Aquí esta foto con la gente maravillosa de @rolandgarros https://t.co/hMRsW3ZiVD Muchas gracias a todos por vuestras felicitaciones! Nos vemos pronto!\nThank you for your birthday wishes! See you soon!! #RafaNadalAcademy https://t.co/V4SAh5AulS RT @rnadalacademy: Upload your pic/vid doing Rafa 💪 gesture with #VamosRafa💪 to send him the strength he needs to win the 10th @RolandGarro… Nueva apertura del restaurante #ZELAIbiza! Contento de que nuestros proyectos crezcan! #GrupoKABUKI #TATELRestaurants @tatelrestaurant https://t.co/AciO0cjd3C Entrenando en la pista #SuzanneLenglen // Training at #SuzanneLenglen court @RolandGarros https://t.co/huLVna4jFm Look what came from @babolat! @rolandgarros #RG17 https://t.co/vEPi9RyTgo My #DayToDay is now live on my website, where I'll be posting exclusive pics! Check the first one from @RolandGarros https://t.co/Eaa385WhVk https://t.co/MLhay9m6og La sección de mi web #DayToDay ya está abierta, donde publicaré fotos exclusivas. Ya está la 1a de @rolandgarros 😉 https://t.co/w6HrW8PvUp https://t.co/q3vXTk6Mng RT @babolat: All access. Unfiltered. Live from central court @rolandgarros. @RafaelNadal &amp; @JackSock interview each other. #WeLiv https://t… RT @F_Luzon: Comparto con vosotros la videoreseña que el gran @RafaelNadal realizó sobre mi libro #ElViajeEsLaRecompesa. ¡Gracias Rafa! htt… Gran día jugando con vosotros vía #RealidadVirtual en @Movistar_es! 😉 #VRNADAL https://t.co/S1Z477PTA6 RT @Richard_Mille: Before @rolandgarros an intimate dinner for @RafaelNadal to present the new RM 27-03 Tourbillon Shock Resistance.\n#Vamos… Spring clay season has been incredible. Thank you team! Now on to Paris. https://t.co/dt9lYBrCMf https://t.co/4Q38yiMVPD Great to hear that @vika7 will be coming back for the @MallorcaOpen! Enjoy the great tournament and the island! The #RafaNadalTour, supporting my foundation, kicks off in Mexico &amp; China, where young people will play #tennis and train #values! https://t.co/NdgxUZKDO4 El #RafaNadalTour, a beneficio de mi fundación, arranca en #México y en #China, donde los jóvenes podrán jugar a tenis y entrenar #valores https://t.co/Fm2CjiIu5B RT @frnadal: La I carrera solidaria #CursaMillorJunts este sábado 27/5 en Palma #Mallorca. Para grandes y peques! https://t.co/0sMeyc8jQE O… Training at the @rnadalacademy 😉 https://t.co/iOJe7JOUxf I’m interviewing @JackSock May 25 live on @Babolat! What should I ask him? #RG17 https://t.co/R5A0Ne239H RT @rnadalacademy: Take some rest and get well soon @NicoAlmagro. Thanks @RafaelNadal for showing us that #values are the most important th… Buongiorno Roma #italianopen2017 https://t.co/zQb9jslltw Segundo día entrenando en #Roma! / Second day training in #Rome! https://t.co/KdYY23hTzh GRACIAS Madrid por todo!! / THANK YOU for everything Madrid! https://t.co/Y4PvHZEPoo Celebrando con el equipo!! / Celebrating with the team!! #MadridOpen https://t.co/r12wF6IPVq Esta es mi taquilla en el #MadridOpen 😉 Preparado para la final! / My locker at #MadridOpen. Ready for the final! https://t.co/51dyYIzLER Recta final de la etapa de #Valencia del #RafaNadalTour. Intensos días de tenis a beneficio de mi fundación @frnadal https://t.co/SPKR5ZiAs7 Florin Angel pintó este cuadro con la boca. Muchas gracias Florin por este increíble regalo!! @pie_bocaPintor https://t.co/krI2S2gIdR Entrenando en Madrid! / Training in #Madrid! https://t.co/E01SFYMROQ .@feliciano_lopez que vaya bien esta tarde por ahí. Nos vemos en Madrid! A ver si lo ganas, con tu servicio y la altitud.... https://t.co/IhVeiwTu5F RT @ClinicaTenis: Would you like to have the official towel of @bcnopenbs signed by @RafaelNadal ?RT and follow us to participate!good luck… El equipo con la Copa del #Godó. Muchas gracias equipo! https://t.co/6TpyF56A8g Celebrando una de las tradiciones del #Godó!! Muy contento con la victoria! https://t.co/xMG38tjRwF Preparado para la final aquí en #Barcelona. Ready for the final in #Barcelona. Vamos!!!! https://t.co/Yfhv6t1XV4 Ready for the #semifinal! @bcnopenbs https://t.co/KiHGFMVclG Playing Barcelona &amp; couldn't attend the opening of #TatelIbiza like in Miami.Glad it's expanding @paugasol @enriqueiglesias @tatelrestaurant https://t.co/YPwVg8JzbN Some of your pics are already in my website 😉 Keep uploading photos with #RafaFan to be a part of it! https://t.co/V5i8Y6Tqmz https://t.co/5KjnGneupw Algunas de vuestras fotos ya están en mi web 😉 Seguid colgando con #RafaFan para formar parte de esta sección! https://t.co/V5i8Y6Tqmz https://t.co/0qR1Pu73MG LEGEND @Totti @nikefootball #Nike https://t.co/9tnH5E2TXJ Do you want to be part of my website? If we've ever had our photo taken in a tournament, in the street, in any city, upload it with #RafaFan Very happy with my new website: https://t.co/V5i8Y6Tqmz Hope you like it and enjoy the content I'll share here! https://t.co/vC6A6YlCkZ ¿Quieres ser parte de mi web? Si alguna vez nos hemos hecho una foto en un torneo, calle, ciudad…súbela con #RafaFan https://t.co/V5i8Y6Tqmz Contento con mi nueva web: https://t.co/V5i8Y6Tqmz. Espero que os guste y disfrutéis con el contenido que compartiré por aquí! https://t.co/IYZUgsKCxe Un honor ver esto en el #TenisBarcelona! Muchas gracias @bcnopenbs 🙂 https://t.co/RMGZaKzuw4 Un honor celebrar los #25años de los #JJOO en Barcelona con #AntonioRebollo quien encendió la antorcha en 1992! Gracias por enseñarnos!! 😉👍 https://t.co/XEiMxyyDZv Very happy for the win and the title in #MonteCarlo. The 10th in this tournament in my career. Thanks team and all of you!! https://t.co/GxynF84Rqb #Vamos https://t.co/wQxnmoUgsN Ready for the final in #MonteCarlo! https://t.co/WeubRvVcPS A shot from yesterday's game 😃 Ready for the semifinals today! #ATPMonteCarlo \n\nhttps://t.co/9bI9I3kEGO Ready to play in #MonteCarlo! https://t.co/DHFKZWBQYW Glad to have you at the #Academy! Sorry I missed it, training in #Montecarlo! https://t.co/ldoJnWWCCk Contento de estar entrenando en #MonteCarlo / Already training in Monte Carlo! 👍 https://t.co/7vx1iVzEg7 Mañana ya en Monte Carlo. También os espero en el #MadridOpen! Tomorrow Monaco &amp; also looking forward to Madrid! https://t.co/ZS48KPa3wU https://t.co/3awZ9CJSqj #practice 👍🎾 \n@rnadalacademy https://t.co/3YhgqVxVzZ El #RafaNadalTour estos días en #Barcelona (Valldoreix), y con récord de participantes! Suerte a cada uno de los 520 😀 Junto con @frnadal https://t.co/3qSDR2T2TD En el #gym de la @RNadalAcademy después del entreno de hoy 😃👍 https://t.co/HTy1NBPKEp ¡Qué grande @TheSergioGarcia muy emocionante después de tantos años luchando tanto!, ¡muchas felicidades!, ¡qué alegría! Vamos @TheSergioGarcia!!! Que vaya bien hoy. Todos en casa siguiéndote y animando!!! Gracias a #RafaNadalSportCentre podréis entrenar con #MiguelIndurain! Toda la info aquí: https://t.co/TV9HvxHL6D https://t.co/9ybWh9wziZ Aquí podrás participar en el #mosaico #solidario de @BancoSabadell y @LaVanguardia https://t.co/M5qEZLxktw Nos vemos en el #BCNOpenBS! ;) https://t.co/LTqjYB0xMU Many of you guessed it... I'm home training at the @RNadalAcademy! https://t.co/tmodEiWzX8 Almost a year later, I'm back on clay... Can you guess where I'm training? 😉 https://t.co/1HCiA8HUsO Llegando al hotel. Esta noche cena con el equipo y la familia, y mañana la final! https://t.co/HVlm9BRodo Back at the gym after the match... Happy for the win 😉 https://t.co/PxAgzzErHw Día de entreno en Miami / Training day in Miami 😉☀ https://t.co/5Ke8zbA2z4 Muchos ánimos y que te recuperes pronto Emma! https://t.co/UnaT7xZMoY https://t.co/KLD7yMBUUo RT @ATPWorldTour_ES: Así entrena @RafaelNadal para preparar el debut en el @MiamiOpen. ¡Sin tregua! https://t.co/PFsZYn5HNj Great night in Miami. Had fun with my friend @enriqueiglesias!\n#Opening #TatelMiami #Miami @tatelrestaurant @mahou_es @grupocosentino https://t.co/ezQChKjkoY Entrenando antes del partido 👍☀ https://t.co/zofnYuEC6y https://t.co/TNfOP42RxL Getting ready for the final! https://t.co/AOVlXyPCOr RT @ACC_Castillo: Los talentos detectados se formarán en la #RafaNadalAcademy en Mallorca #España, donde además se capacitará a los mejores… Preparing today's match 😉 https://t.co/bhNPawCu45 https://t.co/h3mB0RIoBp Encantado de estar nuevamente en México. Gracias @AbiertoTelcel por recibirme, ¡os espero a todos en mi primer partido! #AMT2017 #NoLimits https://t.co/RhGnUU2qpo Compiten en la pista, pero a la vez son compañeros que se divierten y aprenden juntos. Estos días #RafaNadalTour en #Sevilla, con @frnadal https://t.co/Ut0AnqnEC5 Happy to be back at Queens!!! https://t.co/kjy3AczTep Wearing my #SneakersforGood to support @LaureusSport as a symbol of the power of sport. Show me yours @rogerfederer @andy_murray #Laureus17 https://t.co/QTwIg65k6u I am very sorry to announce I won't be able to play in Rotterdam next week. After last year's absence... https://t.co/Vj7VltxGv5 RT @BancoSabadell: Este martes a partir de las 19:30 horas, conversamos con @RafaelNadal tras su regreso del @AustralianOpen. Síguelo en #R… ¿Os gustan mis nuevas zapas? #nike #lunarcharge @nikesportswear https://t.co/sU6tUXr1PK Muchas felicidades equipo por pasar a cuartos, después de 3 días muy duros! #VamosEspaña @SpainTenis ¿Te gustan las series, el cine y el deporte? Quizá yo te pueda ayudar a elegir 😉  #NosGustaMovistarPlus https://t.co/XUzG4ykpU8 At home after a month in Australia. Huge thanks to all of you, for your unbelievable support https://t.co/zy7M0HDTHx Ya en casa después de un mes en Australia. Muchas gracias a todos por vuestro increíble apoyo https://t.co/Ox2ifQL5vI RT @rnadalacademy: Very happy to announce that #RafaNadalAcademybyMovistar will be partnering with @TennisAustralia! #GreatThingsToCome htt… Thank you for the constant support! As you already know, we are making the #ausopen together #PowertoSurprise #byEveryone and #Kia https://t.co/LMfqNnAsta Going back to the hotel. Recover and practice tomorrow. Thanks for all your messages! https://t.co/VHHDrMOAkx RT @ClinicaTenis: The official towel of @AustralianOpen that we raffle in @ClinicaTenis will be signed by @RafaelNadal !To participate http… Seguimos con el #recovery // keep recovering! 😉👍 https://t.co/mvQ9TWvRDg Recovery time after today's match! 😉 https://t.co/TLBa9REPOz Happy for the win! Amazing crowd at the #ausopen Heading back home to rest! https://t.co/kz05VF3CSp #PlayToBeWild @babolat https://t.co/QQksyRlvjT Time to rest after a day training at the #ausopen! https://t.co/hziOxqDTfk Just like me, you are one of strings in Kia Giant Racquet! Thank you for making #AusOpen possible with me. #PowertoSurprise #byEveryone https://t.co/oEXhNZnIkP Are you with us? @babolat #PlayToBeWild https://t.co/YE3vmpDoVK https://t.co/iztIiCaiwJ First practice session in #Melbourne! https://t.co/RDmtql2NHK Just arrived in Sydney and excited for #Fast4tennis Monday night at International Convention Centre! Vosotros completáis mis partidos en el Open Australia. You complete my match at Australian Open #byEveryone #PowertoSurprise #SoyNadalista https://t.co/eDTIwLnVuG https://t.co/FAH99B13Ac Empezamos el año con una nueva edición del #RafaNadalTour, y ya van 4! Suerte a los participantes de esta 1a etapa en #Barcelona @frnadal https://t.co/B5qmRRc8NZ Happy to play in #Brisbane for the first time in my career! #BrisbaneTennis Happy for the victory in #AbuDhabi! Happy New Year to everyone! https://t.co/RxhhyAwWwb https://t.co/nOYuqFelRU .@ferranadria hoy es el día perfecto para #LaRevancha. Prepárate! No me he olvidado del chimichurri https://t.co/UPdJhOMQgw #FelicesFiestas a todos!!! @Mapfre_es https://t.co/Vp2MkklKKZ Terrible news. Wishing a speedy recovery for @Petra_Kvitova. Keep smiling as always! #Christmas dinner with the team, family &amp; friends! https://t.co/Q7CvTDOR7c .@ferranadria, @jdiego_florez y yo tenemos una sorpresa para ti. Descúbrela en https://t.co/lxQIjy23vI #MasUnidosQueNunca https://t.co/PYQqxqjdST Check out the new charity products we’ve worked with my Foundation. These ones for the younger kids! https://t.co/iHQT7xkEcB https://t.co/X6xfgNKMuS Hemos creado estos productos solidarios desde mi Fundación! Esta vez para los más pequeños ;) @frnadal https://t.co/iHQT7xkEcB https://t.co/FquJe69zCj Happy to be back on court with Marc!! @MarcLopezTarres @RNadalAcademy https://t.co/WbhXAk1Dqm RT @ATPWorldTour: It's here! 🤗🎅🏼 Our stars spread holiday cheer in this year's #ATP holiday card (+ some surprise messages!). Watch: https:… RT @rnadalacademy: Our student #AdilKalyanpur has been selected as #reserveplayer in the #IndianTeam of the @DavisCup! Huge congrats! https… Mucha suerte #JakeHersey @rnadalacademy en la final de hoy #EddieHerr! https://t.co/Wy0PuqQo8z RT @OpenFuture_: ¿Tienes una solución tecnológica que pueda mejorar la propuesta de valor de la @rnadalacademy? ¡Apúntate! https://t.co/TGE… Mis condolencias al @ChapecoenseReal y a las familias de todas las víctimas del accidente de avión. RT @rnadalacademy: A month ago @RafaelNadal &amp; @RogerFederer inaugurated the #Academy! #GreatMemories https://t.co/NizPzYWaPK Excited to announce my first tournament back will be in Abu Dhabi at the #MubadalaWorldTennisChampionship in December. @MubadalaTennis Unos días de relax...\nRelaxing days #SainteAgnes https://t.co/Iv9wQyxP1s Cuando eliges dormir una hora menos y entrenar una hora más, tu mundo crece. #EligeTodo en https://t.co/DZq3SkcLIR Congrats to my friend @Andy_Murray on becoming World Number One! https://t.co/Co2sO66JoN Descansando estos días. Gracias por los mensajes de apoyo que recibo por aquí😊\n\nResting these days. Thank you for your messages of support 😉 https://t.co/00WrsADGH1 Para disfrutar el Australian Open 2017 de la mejor manera, visitad https://t.co/kA8TTXmpkM para conocer su programa! #VisitKia #ausopen https://t.co/tVoWr0gqP0 You can find the best way to enjoy Australian Open 2017 with full hospitality program. Visit https://t.co/kA8TTXmpkM! #VisitKia #ausopen https://t.co/cqtV6A9bPi Check out the #RafaNadalAcademybyMovistar experience with this spectacular 360 video. Welcome! https://t.co/n8lfPuyMiB Te invito a vivir la experiencia #RafaNadalAcademybyMovistar con este espectacular vídeo 360 ¡Bienvenido! https://t.co/n8lfPuyMiB Creo que no es ningún secreto decir que llegué muy justo a los JJ.OO. y el objetivo era ganar una medalla para... https://t.co/bvU9pfQfGd It is no secret that I arrived to the Olympic Games short of preparation and not fully recovered, but the goal... https://t.co/bvU9pfQfGd Thanks @RogerFederer for helping us with the inauguration of the @RNadalAcademy! A pleasure to have your support!! https://t.co/ENw7kvkDlf RT @rnadalacademy: .@RafaelNadal, @RogerFederer and the President of @Telefonica, #JoséMAlvarezPallete at the inauguration of the #RafaNada… Flying colors. @NikeCourt\nhttps://t.co/bq62lfIM55 https://t.co/gB2yVROqbt https://t.co/BJsfyHZxA2 Good memories of yesterday. Thanks to my friends @CharlyMoya, #JohnMcEnroe &amp; @mwilander for coming to the #rnscsportscentre’s #openday https://t.co/T8Zz6smHfv Thank you @Charlymoya #JohnMcEnroe and @mwilander for joining me during the #rnscsportscentre open day! https://t.co/6SY1gmGvd5 Hoy he estado en las finales #RafaNadalTour, en #Mallorca. ¡Enhorabuena a los ganadores y finalistas de esta 3a edición! Con @frnadal https://t.co/BSZzo0q4v2 Le hemos preparado una pequeña broma a un grupo de chicos junto con @vivetelefonica. ¡No te pierdas su reacción! #NosGustaLaGente https://t.co/Ythd6r0EIg RT @BancoSabadell: Aquí tienes el vídeo de la conversación con @RafaelNadal tras la #CopaDavis y #Río #BSabadellTV🔴https://t.co/TNEAXMPxCt… RT @sabadellprensa: Conversamos #endirecto con @RafaelNadal tras #CopaDavis 🔴https://t.co/jjxfmN8oVS @sabadellprensa #EstarAhíyResponder ht… Eres un ejemplo @DaniCaver! https://t.co/mDuDDX7N7A RT @vivetelefonica: ¡Enhorabuena @NairoQuinCo! Gracias a ti y @Movistar_Team por vuestro esfuerzo, coraje y compromiso #EstaEsLaNuestra htt… Felicitar también a #JairoRuiz por su bronce en #triatlon e #IzaskunOses por el bronce en 1500metros! #Rio2016 #Campeones #Paralímpicos Otro #oro para #TeamEsp!! Felicidades #NuriaMarques!! Y enhorabuena también a #AlfonsoCabello por el #bronce #Rio2016 @Paralimpicos GRACIAS A TODOS!!! https://t.co/EIdTHLhb5A Ya tenemos medallas! Enhorabuena @KimDiscus por el #oro y a @teresa_perales por la #plata #Campeones #Paralimpicos The #Paralympics start! Good luck to #TeamSpain! We’re all supporting you! #Rio2016 Comienzan los #JuegosParalímpicos! Mucha suerte al equipo español! Estamos con vosotros!! #TeamEsp #Rio2016 Thank you for all your messages of support... See you soon NY @NewYorkPalaceNY https://t.co/PnE2QHnSnW Gracias a todos por vuestros mensajes de apoyo.... Nos vemos pronto NY @NewYorkPalaceNY https://t.co/5w1yOnQyG4 Preparando el partido de #octavos #USOpen https://t.co/0R4hVUTqi1 Getting stronger each and every day.\nCheck out my new @NikeCourt t-shirts\nhttps://t.co/bq62lg0ntF #justdoit https://t.co/Bjw6v1Mwa7 Comodidad que supera límites.Sudadera con capucha Nike Tech Fleece https://t.co/UQDzOrBri2 @nikesportswear #techpack https://t.co/sBo0PrZzfh Calentando para el primer partido de este #USOpen2016. #Vamos!\n\nWarming up for the first game at #USOpen2016 #Vamos! https://t.co/25jlqYOm6H Looking forward to some good #tennis, and #newyorkcity. What a combination! @NewYorkPalaceNY https://t.co/Fj8hrV3H9x Happy to sit next to the great Rod Laver for the @LaverCup. It will be an exciting event in Prague in September 2017 https://t.co/1SGihj1URS Yesterday I was in the @TasteofTennis kitchen with the best ingredient world, @OliveOils_Spain https://t.co/stfMTrmu3h Ayer estuve en la cocina de @TasteofTennis con el mejor ingrediente del mundo: @OliveOils_Spain https://t.co/t3V8Sl7Qcx I’m coming to @BrisbaneTennis for the first time. See you there? #BrisbaneTennis https://t.co/ANNzyuYYZH Mi apuesta para fuera de la pista. https://t.co/Y5T4koqHco @nikesportswear #techpack https://t.co/WkPqGItzZ7 Ready for the big stage and bright lights.\nA punto para el gran escenario. @NikeCourt https://t.co/bq62lg0ntF https://t.co/TeGAS93fRm Soon I’ll be cooking with @MarcusCooks and @OliveOils_Spain at @TasteofTennis. Check it out: https://t.co/dChNxTo0IT https://t.co/wLQZM6KxpN En breve estaré con @MarcusCooks en @TasteofTennis. ¡No te lo pierdas, aquí! https://t.co/dChNxTo0IT https://t.co/XGe4e4vJ2r A la vuelta de Rio con mi equipo #TenisKia Seguro que nos quedan grandes logros por conseguir @jamunar_38 @DaniCaver https://t.co/a2dN5k3EOV Reading the news of the earthquake in Italy. Sending all my support to all the families that have been affected. Desde NY leo las noticias del terremoto en Italia y me gustaría mandar todo mi apoyo a las familias afectadas. #USOpen2016 https://t.co/VzaJSLH9LH #USOpen2016 https://t.co/9q0yqZNT2q Great #TeamSpain! #bronze for the men's #basketball team and for @colomacarlos in #mountainbike! #silver for #rhythmicgymnastics! #Rio2016 Enorme #TeamESP! #Bronce para los chicos de #baloncesto y para @colomacarlos en #mountainbike! #Plata para el equipo de #gimnasiaritmica Congrats to Spain's women national basketball team for the #silver and to the amazing Ruth Beitia for the #gold #Rio2016 Muchas felicidades a todo el equipo de #SelFem por la #plata! Y a la increíble Ruth Beitia por el #oro! #campeonas #Rio2016 Great Carolina!!! Congrats for the deserved #gold!!! #Rio2016 @caro_marin2 Enorme Carolina!!! Felicidades por el #oro tan merecido!!! #Rio2016 #badminton @caro_marin2 More medals for #TeamSpain! Congrats @evusa91 &amp; @joelgonzaleztkd for the #silver and the #bronze in #Taekwondo! Más medallas para #TeamEsp! Enhorabuena @evusa91 y @joelgonzaleztkd por la #plata y el #bronce en #taekwondo! Congrats to @Saul_Craviotto &amp; @Toro_CT7, olympic champions! #gold #TeamSpain #Rio2016 Felicidades @Saul_Craviotto y @Toro_Ct7, campeones olímpicos! Qué grandes sois #oro #piragüismo #Rio2016 Congrats Orlando Ortega for your #silver medal in #Rio2016! Felicidades Orlando Ortega por tu medalla de #plata en #Rio2016! Congrats @MarcusWalz for your #gold medal! Another one for Spain! #Rio2016 #TeamSpain Enhorabuena @MarcusWalz por tu medalla de #oro! Una más para España! #Rio2016 #TeamEsp Emocionados, felices, difícil describir estas sensaciones. Tenemos la medalla de #oro!!! Grande @marclopeztarres https://t.co/nLnOK1Aqtq Congrats to Maialen Chourraut for her #gold medal! Another one for #TeamEsp! #Champion Enhorabuena a Maialen Chourraut por la medalla de #oro!! Otra para #TeamEsp! #Campeona Congrats again to @miss_belmont, this time for the #goldmedal! #Champion #Rio2016 Felicidades de nuevo a @miss_belmont, esta vez por el #oro! #Campeona #GrandeMireia #Rio2016 Congrats Mireia! First medal for Spain in #Rio2016! Let's get many more! @miss_belmont Felicidades Mireia! Primera medalla para España en #Rio2016!!! A por muchas más! @miss_belmont Un orgullo poder representar a #España en #Rio2016!!\n\nProud to represent #Spain in #Rio2016!! https://t.co/CtnmwCem3o Con el equipo en #Rio!! https://t.co/42cbgsz0vZ Mi más sincera enhorabuena a la familia Cosentino y todos sus empleados por conseguir el Premio Nacional de Innovación 2016. Very happy to have officially opened #SportXperience in Manacor. A unique and interactive space for sports lovers. https://t.co/YezJU9Sug3 Disfrutar de la voz de @jdiego_florez y apoyar una buena causa será posible el 4 de Octubre #TelefonicaconFlórez \nhttps://t.co/jEkix2E0aR Estos días en #Madrid última etapa del #RafaNadalTour antes del Master.Los beneficios son para mi fundación @frnadal https://t.co/twz1VyoIWp Muy contento de ver cómo el proyecto #StudyandPlay arranca con la entrega de las primeras becas. ¡Deporte y estudios en EEUU! Con @frnadal J'apprends les nouvelles, et je suis horrifié par ce qui se passe à Nice. Soutien au peuple français, toutes les victimes et leurs familles. Viendo las noticias y horrorizado por lo ocurrido en Niza. Mi apoyo al pueblo francés, todas las víctimas y sus familiares. RT @BancoSabadell: ¡Gana una pelota firmada por @RafaelNadal! Sube tu foto con el hashtag #EstésDondeEstés https://t.co/nTwEsVCe9V https://… Happy to be with the kids at the @rnadalacademy!! https://t.co/uJYMhvJYyE WE ARE 10 MILLION! Big thanks to all of you for your incredible support!! https://t.co/O5hQXN01K5 YA SOMOS 10 MILLONES! GRACIAS por vuestro increíble apoyo!! https://t.co/5oWbz20w67 RT @rnadalacademy: Check out our #tennis classes with #ToniNadal! #RafaNadalAcademy #SummerCamp https://t.co/u5IimaKN2C https://t.co/RUdaRF… Orgulloso de ser embajador de @BecasPodium que hace realidad el sueño de jóvenes deportistas. Gracias @Telefonica https://t.co/KiLtaxZG7Q El #RafaNadalTour ha arrancado ya en #Alicante. Una nueva oportunidad para competir y practicar los valores del deporte! Con @frnadal RT @rnadalacademy: .@RafaelNadal visited our #stand at the @MallorcaOpen. Thanks for coming Rafa!! ;) https://t.co/80GLL9RmMJ RT @rnadalacademy: .@RafaelNadal ha visitado nuestro #stand en el @MallorcaOpen. Gracias por venir Rafa!! ;) https://t.co/lWJ8kaTEME Hoy estuve por el @mallorcaopen Los árbitros se sienten cómodos también ;-) @rnadalacademy https://t.co/TK4Ec8YBnl Mucha fuerza a la @SeFutbol en la #EURO2016!! #Grandes #VamosEspaña\nhttps://t.co/0QWODBmZCL Mañana empieza el @mallorcaopen. Que disfrutéis por mi tierra! Suerte a las jugadoras y en especial bienvenida a la campeona @garbimuguruza Hi everybody. I’m sad to announce that after talking to my doctors, and receiving the results of my last medical... https://t.co/BBl4BOtL45 Hola a todos. Quería anunciaros que tras consultar con mi médico y vistos los resultados de la pasada revisión... \nhttps://t.co/BBl4BOtL45 Bienvenido #saschazverev a la familia de @Richard_Mille ojalá tengamos muchos éxitos que compartir #ARacingMachineOnTheWrist How exciting! HUGE Feliciano &amp; Marc!!! I'm very happy for my friends' win at #RolandGarros!!! Congrats! Que nervioss!! GRANDES @feliciano_lopez y @MarcLopezTarres!!! Estoy muy contento por la victoria de mis amigos en #RolandGarros Felicidades! Congrats Garbiñe for your win at Roland Garros. Great news for Spanish tennis! Felicidades Garbiñe por tu victoria en Roland Garros. Muy buena noticia para el tenis español! Thank you for all your birthday messages. A big hug to everyone! Muchas gracias a todos por felicitarme hoy. Un fuerte abrazo a todos! Muy triste por la noticia de Luis Salom. Aunque en estos momentos ninguna palabra reconforta, todo mi apoyo y ánimo a la familia y amigos. Muchas gracias por las felicitaciones y sorpresa de @ViveTelefonica @Telefonica por mi 30 cumpleaños #Felices30Rafa\nhttps://t.co/HOywbusejL Today is one of the toughest days. Having to withdraw from arguably the most important tournament of my career... https://t.co/ZAdS8lWmp2 RT @ClinicaTenis: Would you like to have the official towel (men) of Roland Garros? RT and follow us to participate! https://t.co/mdV5nb160a Seguimos entrenando... #RG16\nWe keep practicing... #RG16 https://t.co/W9AVA83yDx RT @TommyHilfiger: The score's been settled! Watch @RafaelNadal &amp; @Gvanderwiel in our 1st #TommyXNadal football-meets-tennis match! https:/… Un entrenamiento diferente en París!!\nA different practice session in #Paris! https://t.co/ck3I6sirNA GRACIAS! https://t.co/Qc3lpw6V2h https://t.co/wc1zGO4MRs Primer entrenamiento en Roland Garros... :) \nFirst practice session at Roland Garros... :) https://t.co/HQnWQh8Akn Happy to hear about this event in MALLORCA!  https://t.co/YGpaVv787a RT @MallorcaOpen: Nuestro embajador Toni Nadal, en el evento de presentación del #MallorcaOpen. 🎾🌱 https://t.co/UqxouT2h5o Check out all my @NikeCourt looks exclusively at https://t.co/bq62lg0ntF #stealtheshow https://t.co/6H3IhCktE6 Entrenando en casa... ;)\nPracticing at home... ;) https://t.co/wrVugl2jMT Entrenando en #Roma antes del partido de hoy! \nPracticing in #Rome before today's match! https://t.co/WlAwkCqtta Muchísimo público... Como siempre... En el Foro Itálico!! :)\nBig crowd... like always at the Foro Itálico!! :) https://t.co/nWFODCB0Jj https://t.co/0j45Hlx16P Mañana el #RafaNadalTour empieza en #Valencia. Ya sabéis, no basta con competir: los valores cuentan! No dejéis de practicarlos con @frnadal Having a snack with Tuts before heading off to watch the #Champions game! #RafaNadalAlimentosEspaña #MadridOpen https://t.co/NkVbdJnWYK Tomando algo con mi amigo Tuts antes de ir a ver el partido de\n#Champions! #RafaNadalAlimentosEspaña #MadridOpen https://t.co/4q8MP5Zgtp Great celebration of Spanish Hall of Famers on court at the #MadridOpen @TennisHalloFame https://t.co/ujE3c81sa0 RT @rnadalacademy: .@rafaelnadal has visited us today at our #stand at the #MadridOpen! https://t.co/9AFiudQkDD https://t.co/Yz2HdPXlFT #nosgustalagente #FelizDiaDeLaMadre\nhttps://t.co/YkEuUYz47Q RT @rnadalacademy: Check out our #stand at #MadridOpen &amp; join in the raffle to win a week at our #SummerCamp! https://t.co/9AFiudQkDD https… Thanks to my friends from @Kia_Motors for giving me the spectacular Kia #Sportage! https://t.co/IXMVqZ9e2Z Gracias a mis amigos de @kiamotorsiberia por hacerme entrega de mi nuevo coche, un espectacular Kia #Sportage! https://t.co/emMnuRmZbf RT @rnadalacademy: Happy to have @andy_murray here!He played with @RafaelNadal after showing him our facilities https://t.co/4kJwgOWwPh htt… Último entrenamiento en casa antes de ir a Madrid!!\nLast practice session at home before going to Madrid!! https://t.co/LVXGXqicoA I’m really proud to be Spain flag bearer in #Rio2016!! Muy contento de ser abanderado en los Juegos Olímpicos de #Rio2016 https://t.co/bZuYjBSkX8 It’s a tradition in #Barcelona to celebrate the victory with the ball boys &amp; girls! https://t.co/H73d67knoJ Una tradición del #Godó celebrar la victoria con los recogepelotas! https://t.co/jXgsBS4Pnh Reading your messages. Thank you for your support, on and off the court. Very happy for the win in #Barcelona! https://t.co/trUflPZGSm Leyendo vuestros mensajes. Gracias por el apoyo, dentro de la pista y fuera. Muy contento por la victoria #Barcelona https://t.co/TtQ7MqzIA6 RT @babolat: Discover the story behind @RafaelNadal's Pure Aero racket. #SpinMachine\n\nFull video: https://t.co/6Vq3sMTRTZ https://t.co/xuu8… RT @sabadellprensa: #LaTierraDelTenis | 🔴 Entrevista completa a @RafaelNadal\nen #BSabadellTV : \"Ya tengo ese extra que necesitaba\" https://… RT @BancoSabadell: Hablamos \"sobre\" #LaTierraDelTenis con @RafaelNadal en #BSabadellTV y @sabadellprensa https://t.co/3LiQgCHbNw https://t.… Felicidades chicas por la victoria en @FedCup_es! #campeonas @GarbiMuguruza @CarlaSuarezNava @sara_sorribes @anabelmedina @conchitamartinz Thank you all for your support. Very happy for this win and now it's time to celebrate it with the team. https://t.co/v2zlhkC8M3 Gracias a todos por el apoyo. Muy contento de esta victoria y ahora a celebrarla con mi equipo. https://t.co/sthCGXav3P RT @rnadalacademy: #VAMOSRAFA All our support to @RafaelNadal in the final at #Montecarlo!!! #100final https://t.co/OuP2Zh7w7S RT @rnadalacademy: Check out our latest offer! Enrol to our annual program before June 1 to get a 10% discount! https://t.co/nh9BaoqOat htt… RT @rnadalacademy: Join us in wishing @RafaelNadal all the best in the #ClaySeason &amp; in #MonteCarlo #VamosRafa https://t.co/mWsvVsygOi Buen partido hoy y ayer con @aljazbedene también. Su novia sacó este clip! #Kimalie #YoureNotSorry @OfficialKimalie https://t.co/8tg8DpcwIz Honoring a legend #mambaday #justdoit @nikecourt https://t.co/EmS4pp4yRb The best gear for my favorite time of the year. Gracias @NikeCourt! https://t.co/bq62lg0ntF #justdoit https://t.co/ZrchyFsUWw #mambaday #justdoit https://t.co/kxv7ZInhC4 https://t.co/uyANlZWaxi My fastest @Babolat PLAY serve was 189 km/h. @CaroWozniacki, show me what you've got! #NoMoreRadar https://t.co/D7e86XoH6l Gracias a nuestro partner AirEuropa por su colaboración!  https://t.co/6w4t9zvVHb Guess my fastest serve speed (km/h)! RT w/ @Babolat &amp; #NoMoreRadar to be entered to win a Play racket. https://t.co/N7rIQKzrfh Home now &amp; feeling good. Thanks for all your messages of support and to\n#jwmarriottmarquismiami &amp; @jwmm_miami for their hospitality in Miami De vuelta a casa, me encuentro bien. Gracias por los mensajes de apoyo y a\n#jwmarriottmarquismiami y @jwmm_miami por el trato en Miami. Very sad to hear of the passing of Johan Cruyff, who I was lucky enough to\nmeet. A very important person for our sport. Muy triste por el fallecimiento de Johan Cruyff, a quien tuve la\noportunidad de conocer. Una persona muy importante para nuestro deporte. Ya entrenando en #Miami!! ;)\nAlready practicing in #Miami!! ;) https://t.co/wDGveNdZyn Once again, a terrorist attack has left many innocent victims. My thoughts and support are with all their families. Una vez más, un atentado terrorista con muchas víctimas, todas inocentes. Mi pensamiento y apoyo para todos los familiares. La 3a etapa del #RafaNadalTour en #Barcelona, #Valldoreix. El valor es la #superación, así que…no vale rendirse! https://t.co/Aj7VMksLD9 Preparando el partido de #semifinales! #IndianWells \n\nGetting ready for the game! #semifinals #IndianWells https://t.co/qurpEM0xNp Every year, before the tournament starts, I enjoy playing in one of the best golf courses I know #IndianWells https://t.co/uEoKvBwPjd Cada año, antes de que comience el torneo,disfruto mucho jugando en 1 de los mejores campos que conozco #IndianWells https://t.co/uEoKvBwPjd Bienvenido @jdiego_florez, gran tenor y nuevo embajador de @Telefonica Preparando el siguiente partido!\nGetting ready for my next game! https://t.co/TGzsGLCMW1 RT @rnadalacademy: .@RafaelNadal keeps practicing before his debut in #IndianWells! All the best for our player! #VamosRafa https://t.co/eH… Snacking after the photoshoot and before starting at #BNPP016 The #olives look delicious! #RafaNadalAlimentosEspaña https://t.co/h1BieTg8b2 Aperitivo tras la sesión de fotos, antes de empezar en #BNPP016 Las #aceitunas van a volar #RafaNadalAlimentosEspaña https://t.co/GJRm01f11c El filosofo de mi tío ;) https://t.co/cyhNkk3KQm\n\nMy uncle, the philosopher ;) https://t.co/qIbaKT2lD0 RT @rnadalacademy: .@RafaelNadal practicing in #IndianWells! Our best wishes for a great tournament! #VAMOSRAFA https://t.co/z0KhvDIhLY Felicidades al @RCD_Mallorca por sus 100 años de historia! Per 100 més!! 💯 Check out my new Nike Air Max 1, make yours at https://t.co/PeX1Rlpd3R #AIRMAX https://t.co/AlQ4pxBU1P https://t.co/zTLGkdV5yj This @NikeCourt crew color is perfect. I’m ready to stand up and stand out at\nIndian Wells https://t.co/EJbQz9Q6rt https://t.co/wPX4Dx9YT0 Aquí mi nuevo vídeo con @kiamotorsiberia! Descubre el Kia Sportage y sus superpoderes ;) https://t.co/H7Fez1lx7d RT @rnadalacademy: Faster &amp; stronger. From technical preparation to eye training. Learn more about our method: https://t.co/fJ2GUnzPjI http… RT @rnadalacademy: Another exercise that helps @RafaelNadal improve his #speed on the court. #VamosRafa https://t.co/GeSTE9zMYd https://t.c… Yo pienso que las cosas no cambian por sí solas, las tienes que hacer cambiar tú ;) #Nosgustalagente\nhttps://t.co/28VKi9320V Seguimos entrenando en #Cozumel!\nWe continue practicing in #Cozumel! https://t.co/wTcrlJszzz Empezando con los entrenamientos en pista dura en Cozumel!\nStarting our practice sessions on hard court in Cozumel! https://t.co/qFfLStj2MS RT @rnadalacademy: From the tennis courts to the rooms. Learn more about the #Academy’s #facilities: https://t.co/KA7of7tExY https://t.co/F… Looking forward to playing at #Queens this year! https://t.co/gavxrfsLOV RT @rnadalacademy: Would you like to go to a #University in the #US with a #scholarship? All the info here https://t.co/uUVws7Vck3 https://… Gracias #PlácidoDomingo por hacernos disfrutar tanto. Y felicidades por el homenaje del 29/06! #PlacidoEnElAlma https://t.co/YkgC8X2sZy ¿Estáis listos para jugar en #Sevilla? El #RafaNadalTour empieza mañana. Me gustará ver vuestras fotos! https://t.co/6NO9q8DYZD RT @vivetelefonica: Mide tus habilidades con el @RafaelNadal más virtual en el #EspacioMovistarNadal https://t.co/nzPRCG9J80 https://t.co/S… I ignore the odds and take every serve as a fresh start. https://t.co/ceU97g4JnD https://t.co/VmLrSbvazi A pleasure to spend some time with @MauricioMacri, President of #Argentina. Thanks for making me feel at home. https://t.co/mxAgotsfQJ Un placer pasar unos minutos con @MauricioMacri, Presidente de #Argentina. Gracias por hacerme sentir como en casa. https://t.co/OOLVX1yaca Contento de estar en #BuenosAires y conocer a la gente de @Telefónica!Gracias por el apoyo a mí y a @rnadalacademy https://t.co/BFy18odowq Contento de estar ya en Buenos Aires, justo a tiempo para una entrevista rápida con Vive Telefónica\n\nHappy to be... https://t.co/NZdFdUTxJZ RT @rnadalacademy: Think about the #summer for just a second. Tennis, Mallorca, trainers, friends #SummerCamp https://t.co/KJf0JCMb2l https… He tenido el placer de ver cómo trabaja la familia @GrupoCosentino. Es un honor colaborar con este gran equipo! https://t.co/DQrM4BJBkJ RT @rnadalacademy: Upload a video showing us a tennis trick in pairs, groups of 3 or more.Use #RafaTricks2 There’s a prize for a winner htt… https://t.co/L2VNEQR30c RT @rnadalacademy: Shooting a video with @RafaelNadal! Here's a pic behind the scenes 😉 https://t.co/0zOJhAxAVs RT @rnadalacademy: Upload a video showing us what tennis trick you &amp; your friend can do! Use #RafaTricks2! (2/2) https://t.co/93sE9TaoqV RT @rnadalacademy: Get a chance to win a signed prize from @RafaelNadal! #RafaTricks2 (1/2) https://t.co/HHHCVFzcar THANKS to each and every one of you who follow me on #Twitter! Your support and kind messages make me very happy. #ThankYou GRACIAS a todos y cada uno de los 9 millones que me seguís en #Twitter! Os agradezco vuestro apoyo y todos los mensajes de cariño https://t.co/zzw7kTVAag It's important to eat well before practice. My first match in #AusOpen is on\nTuesday! #RafaNadalAlimentosEspaña https://t.co/yUlZQy4fla Importante comer bien antes de entrenar. El martes debuto en el\n#AusOpen! #RafaNadalAlimentosEspaña https://t.co/ME4anJ3Mta Con mis amigos de @GrupoCosentino en #Melbourne! https://t.co/QeRzcOvTIC Practicing this morning at the @australianopen https://t.co/mVGGk91pEp I’m ready for the OZ thanks to the new @NikeCourt Melbourne Collection. Vamos! https://t.co/bq62lg0ntF https://t.co/SlbKPe1L8y First practice sessions in #Australia... With good temperature!! ;) https://t.co/VVC0Qn0Vo0 Primeros entrenamientos en Australia... Con buenas temperaturas!! ;) https://t.co/qezlBmi50Z https://t.co/DqMRZbXzDf RT @rnadalacademy: Good nutritional habits help to improve performance #RafaNadalAcademybyMovistar https://t.co/cGDgEwmr4L https://t.co/Zva… I vote Pau Gasol for the #AllStar! If you want to see Pau in the All-Star, vote for him tweeting Pau Gasol &amp; #NBAVote! Vamos @paugasol!!! Voto a Pau Gasol para el #AllStar2016! Si queréis ver a Pau en el All-Star, votadle usando Pau Gasol y #NBAVote! Vamos @paugasol!!! #NBAVote Great night playing #Fast4Tennis with @lleytonhewitt @NickKyrgios @Gael_Monfils #iloveSydney https://t.co/m4jiFsvuHr Enjoying the day in Sydney. Bring on #Fast4Tennis tonight. Vamos! #ilovesydney https://t.co/8RsDPbsySh Great to be back in Sydney. See you at #Fast4Tennis tonight. #ilovesydney https://t.co/3OfI0VlVpd RT @rnadalacademy: .@RafaelNadal gets ready for the final in #Doha! #VAMOSRAFA https://t.co/NclmPjnmK0 Quieres 2entradas para @BCNOpenBS y la posibilidad de verme entrenar?Participa en concurso de #RafaNadalTourbyMapfre https://t.co/Pvx1ZXRSkN Amazing views of the city from the practicing courts in #Doha!! https://t.co/gbJfPSfntn Espectacular vista de la ciudad en las pistas de entrenamiento del torneo de Doha!! https://t.co/XbUishJmbN RT @rnadalacademy: Another exercise that helps @RafaelNadal move better on court. Which routines help you? https://t.co/GeSTE9zMYd https://… Tennis and values to start the new year! The 2016 #RafaNadalTour begins this week in Barcelona, with @frnadal https://t.co/lH25QYPSYR ¡Tenis y valores para empezar el nuevo año! Estos días 1a parada del #RafaNadalTour 2016 en Barcelona, con @frnadal https://t.co/lH25QYPSYR ¿Sabéis porqué juego con la zurda? ¡Por fin revelo mi secreto! @Kia_Motors @AustralianOpen https://t.co/L5h8o5bWrQ Wonder why I had to be left handed? I'm finally revealing my secret! @Kia_Motors @AustralianOpen  https://t.co/zHTglcaUVZ Ya en Doha... Con ganas de empezar!\nIn Doha...can't wait to start! https://t.co/dU6ndv0JTk RT @rnadalacademy: .@RafaelNadal starts #2016 practicing in #AbuDhabi! Happy New Year everybody! https://t.co/yg2Zaj2A14 https://t.co/cFP3XJUN1w Celebrando con la familia! Celebrating with the family! HAPPY NEW YEAR!!!! #2016 https://t.co/CPqaA7CXnL Feliz año a todos de nuestra parte!! Happy New Year's Eve everybody!! https://t.co/klWRtnRGdm .@AustralianOpen está casi aquí y estoy de vuelta con el nuevo #KiaXcar. Con ganas de enseñaros el vídeo @kia_motors https://t.co/IQGdVYFrvW .@AustralianOpen’s around the corner &amp; I’m back with the new #KiaXcar Looking forward to showing u more @kia_motors https://t.co/WE2vws0JA0 Ilusionado y agradecido por este proyecto @tatel_madrid junto a @enrique305  y @paugasol! Feliz 2016 a todos!  https://t.co/DfrTIuLl9R RT @ClinicaTenis: Do you want the T-shirt of the Spanish Davis Cup team signed by @RafaelNadal ? RT and follow us to participate! https://t… RT @ClinicaTenis: Quieres la camiseta del equipo español de Copa Davis firmado por @RafaelNadal ? RT y Síguenos para participar! https://t.… Últimos entrenamientos en casa... Deseando empezar!!\nFinal practice sessions at home... Can't wait to start!! https://t.co/tvDegECuY2 El regreso de #Nadal y #KiaXcar para @AusOpen2016. Muy emocionado! @Kia_Motors https://t.co/afVpCLh26P The COMEBACK of #Nadal and #KiaXcar for @AusOpen2016. The excitement is pulsing through my body! @kia_motors https://t.co/x7kENx7T56 ¡Feliz día de los Inocentes! @FerranAdria me la pagarás 🔥#Chimichurri  #NosGustaLaGente https://t.co/9qK2Xkj58H RT @rnadalacademy: MERRY #CHRISTMAS EVERYBODY!Can you find where you are on the map?#RafaNadalAcademybyMovistar https://t.co/HhSZW5J82w htt… ¿Quién puede cantar este villancico sin equivocarse con la letra? ;) En @MAPFRE_ES y @MAPFRE #NadalesNavidad https://t.co/xxtieRu00l Semana dura de entrenamiento... Muerto!!\n\nTough week practicing... Exhausted!! ;) https://t.co/A3AohRyuQK Así es un anuncio detrás de las cámaras ;) Con entrevista incluida! https://t.co/Rur1H5xO22 The #KiaXcar I will be driving is inspired by X-Men hero Mystique. Isn’t this awesome? @ausopen2016 @Kia_Motors https://t.co/SbHPpClp0v RT @rnadalacademy: .@RafaelNadal in his physical practice session. Check it out! #RafaNadalAcademybyMovistar https://t.co/GeSTE9zMYd https:… RT @rnadalacademy: Find out where you’ll play tennis, practice, rest &amp; live here!: https://t.co/KA7of7tExY https://t.co/nG409r4OmY Felicidades a todo el equipo por este merecido reconocimiento!!  https://t.co/20KGZfU8Nv Me encantó conocer a @MichaelRobinson y hablar de deporte con él! https://t.co/XKHlGDmYcS Ace your New Year with me at the Mubadala World Tennis Championship in Abu Dhabi! https://t.co/PBx7CS0F1f RT @rnadalacademy: How will you all practice this #Christmas? :) #RafaNadalAcademybyMovistar https://t.co/tACwxSaR9S https://t.co/dpuTDUKKdX The @frnadal Center is finally open! Very happy to spend the afternoon with kids who take part in this project! https://t.co/TCk3XUzG61 ¡El Centro de @frnadal es ya una realidad! Contento de compartir la tarde con niños/as que participan en el proyecto https://t.co/Ple3582DJ7 Con la increíble @DeepikaPadukone en #Delhi :) \nWith the incredible Deepika Padukone in #Delhi! #Bollywood https://t.co/YZDsUbMDcN One of the things about tennis is getting to meet interesting people from all over the world… ;) https://t.co/MP0s0nGB8Y Una de las cosas del tenis es que vamos conociendo gente interesante de todo el mundo... ;) https://t.co/paqnVcPW14 Hope you all like TH Bold! :) #TommyXNadal RT https://t.co/ninB514NkF RT @rnadalacademy: Thanks to everyone in #India for making another #RafaNadalAcademybyMovistar clinic possible! https://t.co/sOWPp2mIgB Pasando un buen rato con mi amigo Guillem en Manila... 😊\nHaving a great time with my friend Guillem in #Manila! https://t.co/gpW1FZ1FIG RT @rnadalacademy: Having fun at the #RafaNadalAcademybyMovistar’s clinic in #Manila! https://t.co/WoARYwwqXR RT @rnadalacademy: Thank you all for another great #RafaNadalAcademybyMovistar clinic. This one in #Manila! https://t.co/r8MvXs1koQ My first practice session in #Manila before playing my first game at the #IPTL https://t.co/agX1gqPFYl Mi primer entrenamiento en #Manila antes de jugar mi primer partido en #IPTL https://t.co/FN1jgNIcGd Gracias @lorenzo99! Me alegra ver también tu implicación por esta causa!  https://t.co/QcL03gqybP RT @rnadalacademy: fill it in together. Leave a comment and you may win @RafaelNadal’s shirt! #RafaNadalAcademybyMovistar 2/2 https://t.co/… RT @rnadalacademy: We want to fill up this map with you! Tell us where you’re following us from &amp; we’ll #RafaNadalAcademybyMovistar 1/2 htt… Finally I'm filming something special yet highly confidential with @Kia_Motors. It's coming soon, so stay tuned! https://t.co/kZz3nEPZ7i Estoy grabando algo especial y muy confidencial con @Kia_Motors. Llegará pronto, ¡así que estad atentos! https://t.co/csva2nczkN Felicidades María y Marc. Os deseamos lo mejor! ;) https://t.co/E8UCPRENQJ Warming up very hard for @Kia_Motors’s major secret project https://t.co/27a1eC5CNx Preparándome a fondo para el gran proyecto secreto de @Kia_Motors https://t.co/fK45t0xY54 The 3rd edition of the #RafaNadalTour: 6 stages + 2 Spanish Championships + 1 Master + many values! https://t.co/lH25QYPSYR with @frnadal La 3ª edición de #RafaNadalTour: 6 etapas + 2 campeonatos España + 1 Master + ¡muchos valores! https://t.co/lH25QYPSYR Con @frnadal RT @rnadalacademy: At #RafaNadalAcademybyMovistar we use video analysis to improve our student’s game https://t.co/KCijQmeC5i https://t.co/… Agradecido por contar con el apoyo del Dr. Cotorro en #Londres @ClinicaTenis https://t.co/1DiB8ZKTPU Felicidades @I_Con_Sports por vuestro trabajo y hacer posible que tantos jóvenes jueguen su deporte favorito y sigan estudiando! Going back to the hotel, reading your messages! Thanks for your support! ;) https://t.co/kOzkHtBJsa De vuelta para el hotel, leyendo vuestros mensajes! Muchas gracias por el apoyo! ;) https://t.co/PchlKWjnIh Grande @paugasol por haber ganado el premio de jugador con mayor impacto global. Felicidades crack! #GlobalGasol Feliz por la victoria de hoy... :)\nHappy for today's win... :) https://t.co/KIOV1mzc59 Je suis anéanti par ce qui s'est passé hier soir à Paris. Je tiens à apporter toute mon affection et tout mon... https://t.co/clBda4SDOl Je suis anéanti par ce qu'il s'est passé hier soir à Paris. Toute mon affection et tout mon soutien à la France et aux Parisiens. Con mi amigo David Ferrer disfrutando de otro Master\nWith my friend Ferrer enjoying another Master https://t.co/m3srNqu2oc RT @rnadalacademy: In 2 days we’ll announce the winner of our contest #RafaTricks on Instagram. Last chance to join in https://t.co/VIK0eVb… In London after a great event with my @TommyHilfiger friends in Stuttgart https://t.co/BeRMXSjfkj RT @frnadal: Hoy en @teledeporte (19.55h) no te pierdas el reportaje sobre #RafaNadalTour con entrevista a @RafaelNadal . #Valores de la @f… Ayer presentando la nueva campaña #NuevosTiempos con mi tío Miguel Ángel para Banco Sabadell. Deporte, derrotas y... https://t.co/rDaPCg2OGs Check out @rnadalacademy Instagram account &amp; join in the contest! You can win my racket! https://t.co/iKdNcGlumD #RafaNadalAcademybyMovistar Participa en el concurso de Instagram de @rnadalacademy! El ganador se lleva mi raqueta https://t.co/iKdNcGlumD #RafaNadalAcademybyMovistar RT @rnadalacademy: We have a contest for you on our #Instagram account. Follow us and join in! You could win @RafaelNadal’s racket! https:/… Vote for fans' favorite player of the ATP here: https://t.co/QEP2qheqJd Ayuda a la ATP en nombrar al jugador preferido de los fans en este enlace:\nhttps://t.co/QEP2qheqJd RT @rnadalacademy: The #RafaNadalAcademybyMovistar wishes @RafaelNadal all the best in today’s classic final in #Basel! https://t.co/Br5bmc… Thanks for your support!! https://t.co/ylKJrFhl54 Paseando por #Basilea \nTaking a walk in #Basel\nhttps://t.co/P8jzXUNNma RT @rnadalacademy: Learn more about @RafaelNadal’s training and #RafaNadalAcademybyMovistar’s training method https://t.co/UN2LbKR1BV https… In Valencia, at the presentation of Banco Sabadell's new campaign https://t.co/noyJgVPdOL En Valencia, en la presentación de la nueva campaña de Banco Sabadell https://t.co/pydxX0RYgS RT @rnadalacademy: At #RafaNadalAcademybyMovistar we develop physical activity as well as mental strength: https://t.co/NKcM1T5DJb https://… #BreastCancerAwareness Best wishes to all the women fighting against breast cancer, today and always. #DiaContraelCancerdeMama Hoy y siempre, mucha fuerza a todas las mujeres que luchan contra el cáncer de mama. Happy to have qualified for the ATP World Tour Finals in London. Special tournament &amp; special city. See you in London! Contento de saber de mi clasificación para ATP World Tour Finals en Londres. Un torneo especial en una ciudad especial. See you in London! De tertulia con el equipo después de la cena... ;)  \nChatting with the team after dinner… ;) http://t.co/abNTRMYTYK Happy for today's win and as always thanks for all your support! http://t.co/1P0ITYkVCK Contento por la victoria y como siempre muchas gracias a todos por vuestro apoyo! http://t.co/rvir4Retij Here’s a pic of yesterday’s practice session… thanks for your support in Shanghai! ;) http://t.co/AfURG6M2Ut Os dejo una foto del entrenamiento de ayer… gracias por vuestro apoyo en Shanghai! ;) http://t.co/i1quIOsNYh On the other side of the world, having dinner like I’m home: bread and #IberianHam #RafaNadalAlimentosEspaña http://t.co/giII6Flh09 Aunque estoy en la otra parte del mundo, ceno como en casa: pan y #jamónibérico #RafaNadalAlimentosEspaña http://t.co/atja1yzcME From Beijing to Shanghai... Ni Hao!! http://t.co/hPCqbYP61b RT @rnadalacademy: Congrats to @RafaelNadal on today’s victory and all the best for tomorrow! #Vamos #ChinaOpen http://t.co/mgqY9UCH77 Happy to be back in a final! Thanks all for your support! Vamos!!!!! https://t.co/WNigtsRUgh Con mis amigos de Cosentino! http://t.co/eOwxxeHv4w Watch the @FIA film by @LucBesson and help us #SaveKidsLives http://t.co/JLJdB8Rviz #500perday #roadsafety #FIA http://t.co/GcNP2EhgXG RT @rnadalacademy: These are the goals the #RafaNadalAcademybyMovistar pursues http://t.co/Rlif0YsCOa http://t.co/rtSgXD0p8z RT @rnadalacademy: Os presentamos los objetivos que sigue #RafaNadalAcademybyMovistar http://t.co/gmLml5CZrC http://t.co/PLq0wbwPPp Aquí siempre hay mucha gente! :) \nThere are always lots of people here! :) http://t.co/QpVO6hKMIm RT @rnadalacademy: Beijing: primer clínic de la #RafaNadalAcademyByMovistar. Gracias a todos los que lo habéis hecho posible http://t.co/6E… Entrenando... Antes del partido con Novak en #Tailandia! \nPractice session... before the match with Novak starts! http://t.co/qLYriopsQA De visita al Palacio real de Bangkok con @DjokerNole! \n\nVisit to the Royal Palace in Bangkok with @djokernole!  \n\nhttps://t.co/fkfLJJk5UC RT @rnadalacademy: ¿Qué opinas de los valores de #RafaNadalAcademybyMovistar? Descúbrelos aquí http://t.co/riRX3t8xwp http://t.co/39TjzNlZgi Practicing in Bangkok... Where tomorrow I¹m playing a match with Novak! http://t.co/gccIliCJZm Entrenando en Bangkok... Donde mañana jugaré un partido con Novak! http://t.co/SIkXE9J5jL RT @MubadalaTennis: Ace your New Year. Watch Nadal &amp; Raonic in Abu Dhabi starting Dec 31st. Tickets on sale now: http://t.co/SXY53I5yNm. ht… RT @frnadal: No te pierdas los detalles del Master del #RafaNadalTour, celebrado en #Mallorca ¡Dale al play a este vídeo-resumen! http://t.… RT @rnadalacademy: No os perdáis la primera entrevista de @RafaelNadal en la #RafaNadalAcademyByMovistar @TF1 @SkyNews #tf1lejt http://t.co… Felicidades a @PlayStationES que cumple hoy 20 años! @frnadal y yo os deseamos #Felices20PlayStation! RT @ClinicaTenis: Visita esta semana de @RafaelNadal con regalo incluido,la mejor manera de inaugurar Twitter de la Clínica del Tenis! http… RT @rnadalacademy: Conoce la residencia de #RafaNadalAcademybyMovistar aquí: http://t.co/QjUaQqm2Ig http://t.co/di5YPwtHTF RT @nikebasketball: Nos has mostrado el camino hacia la victoria @paugasol gigante entre gigantes. #DueñosDeNuestroDestino http://t.co/DJBB… Felicidades por el oro equipo!!! Y a @paugasol por ser MVP #VAMOSESPAÑA In Lille supporting Spain, our team, this afternoon #ESPBasket\n@baloncestofeb http://t.co/fd6LHodIe6 Ya en Lille para animar a España, nuestro equipo, esta tarde #ESPBasket\n@baloncestofeb http://t.co/JgJgbpM2E7 RT @RFET_tenis: El Equipo Español de #CopaDavis manda un mensaje de ánimo a la selección de baloncesto para la final #EuroBasket2015 http:/… Vamooooooooos partidazo de España... Felicidades!!! Here with the #DavisCup team supporting Spain #SomosEquipo @baloncestofeb http://t.co/SXjuDheRiX Aquí con el equipo de #CopaDavis animando a España #SomosEquipo @baloncestofeb http://t.co/ZZM8ZmS3Yn Yesterday I visited the Museum of History in #Odense. Here standing in front of a painting by PS Kroyer 👍 http://t.co/1Gxf45wqMo Ayer visité el Museo de Historia de #Odense. Aquí delante de una obra de PS Kroyer 😊 http://t.co/TNCs1YROQx The #RafaNadalTour Masters starts tomorrow in Mallorca with @frnadal. I can’t be there this year guys, but I’ll be supporting you! Mañana empieza el Master #RafaNadalTour en Mallorca con @frnadal. Chicos, aunque este año no podré estar, ¡os tendré muy presentes! Congrats to @baloncestofeb for yesterday’s game and all the best for tomorrow against France! #SomosEquipo #Vamos Enhorabuena a @baloncestofeb por el partidazo de ayer y muchos ánimos para mañana ante Francia! #SomosEquipo #Vamos Con fans después del entrenamiento!\nWith fans after practice! http://t.co/pehcTi35s6 Can't wait to try it!  https://t.co/xpcGGN3Zuh Participa en http://t.co/Y9RfJpkV7w y consigue mi raqueta! Qué valores te hacen triunfar?Usa #RafaNadalTourByMapfre http://t.co/jC3wCrmo6p RT @rnadalacademy: ¿Ya conoces el programa semanal de #RafaNadalAcademybyMovistar? Descubre este y muchos más http://t.co/TRitxO1sxb http:/… RT @rnadalacademy: Infórmate sobre el programa de #becas en USA que ofrecemos en #RafaNadalAcademybyMovistar http://t.co/v16Qcwe8XH http://… Having breakfast before the match. Bread with #OliveOil &amp; #IberianHam #UsOpen #RafaNadalAlimentosEspaña http://t.co/VuGUy9v5f5 Desayunando fuerte antes del partido. Pan con #AceitedeOliva y #jamónibérico! #UsOpen #RafaNadalAlimentosEspaña http://t.co/vZfl0mlTZn Love playing in NY @USOpen https://t.co/GtSUSTvCSp Sistema de entrenamiento - Rafa Nadal Academy http://t.co/SaHuKF1Tki RT @rnadalacademy: Conoce el sistema de #entrenamiento que ofrecemos en #RafaNadalAcademybyMovistar http://t.co/mnjBTcaetg http://t.co/6Y6x… RT @TommyHilfiger: .@RafaelNadal was born to be BOLD. Were you? Presenting: TH Bold, now on http://t.co/2AQn9bgzGI #TommyXNadal http://t.co… Had the chance to meet the New Town High School tennis folks today at the US Open Tennis Championships. All my... http://t.co/ovGBsikqfS Fun today playing table tennis at The New York Palace #nadalxpalace https://t.co/ktlilW0kMg Not your everyday tennis match! Had so much fun with @TommyHilfiger and everyone in NYC yesterday #TommyXNadal http://t.co/nzKj7xNDR0 Excited to share my new collaboration with @TommyHilfiger underwear. Meet us in NYC today to celebrate! #TommyXNadal http://t.co/aTSY4MD5rM Headed to the streets to play some tennis with @nikecourt #stealtheshow http://t.co/lP6GbmNNbz Can’t wait to get out on the New York courts! Ready to #stealtheshow @Nikecourt http://t.co/EMaRARpuJi Instalaciones - Rafa Nadal Academy http://t.co/EY0DEIbriA My sincere congratulations to @caro_marin2 for all that you've achieved. A great example to us all. Mi más sincera enhorabuena a @caro_marin2 por todo lo que ha logrado. Un gran ejemplo para todos. Primer entrenamiento en Cincinnati... A puerta cerrada ;)\n1st practice session in Cincinnati...Behind closed doors ;) http://t.co/kX1WMckHFp RT @rnadalacademy: Hoy estrenamos Twitter! Seguid aquí todas las noticias de #RafaNadalAcademybyMovistar! Ayer... Ración Doble!! ;) Yesterday... Doubles!! ;) http://t.co/9ntBV8j7NG Hola desde Montreal! Os anunciamos que la web de la Academia ya está funcionando. http://t.co/fiXBHehuHl http://t.co/KSb66zYVOm Seguimos entrenando en Hamburgo... Verano o Invierno?? ;)\nPracticing in Hamburg… Is it summer or winter?? ;) http://t.co/S2dqnK9krO Primeros entrenamientos en #Hamburg!\nFirst practice session at #Hamburg! http://t.co/Lqktlte6ko Bad luck today in doubles, all the best for tomorrow... big hug to all the team Lástima hoy doble, muchos ánimos para mañana... Abrazo a todo el equipo All my support to Jules Bianchi's family and friends. RIP Jules Todo mi apoyo a la familia y amigos de Jules Bianchi. DEP Jules Hey, if you’re going to be in NYC, come see me on August 26st at big benefit with Johnny Mac http://t.co/Vp4YbkWksh #JMTA Intense final stretch of the 2nd edition of the #RafaNadalTour: Zaragoza now, then Madrid, and in September...Mallorca! With @frnadal Intensa recta final de la 2ª edición del #RafaNadalTour: ahora Zaragoza, luego Madrid, y en septiembre…¡nos vemos en Mallorca! con @frnadal Gracias a #Kia por apoyarme desde el 2004 y por la confianza para seguir unidos 5 años más! http://t.co/cPLxLscUvR http://t.co/QkepiS92tC Happy to be working w/ #Kia for another 5 yrs! Check out my journey w/ @Kia_Motors http://t.co/cPLxLscUvR http://t.co/CmR5P9hFjJ Very happy to see a colleague, @GarbiMuguruza, in such an important final. All the best! @Wimbledon Me alegra mucho ver a una compañera, @GarbiMuguruza, en una final tan importante y le deseo todo lo mejor para la final @Wimbledon ¿Quieres una camiseta firmada? Mis amigos de @Drasanvi tienen un sorteo para ti http://t.co/sXLHoxxRik #NadalDrasanvi http://t.co/nSbF6U3dct GAME, SET AND MATCH. #SOFAST #NIKEZOOM http://t.co/gVsNXIgJQT GAME, SET AND MATCH. #SOFAST #NIKEZOOM http://t.co/mdzqHIgzFq I was the chef today. First course, salad with olives! #Wimbledon #RafaNadalAlimentosEspaña http://t.co/BJ3dK9gnOB Hoy he sido yo el chef. De primero ensalada con aceitunas! #Wimbledon #RafaNadalAlimentosEspaña http://t.co/yj99KPNjYX Practicing at Wimbledon. Can’t wait to practice on the courts at #RafaNadalAcademybyMovistar http://t.co/WVITO73DOi http://t.co/Cz1aBoTEBj Entrenando hoy en Wimbledon Con ganas de probar mis pistas en #RafaNadalAcademybyMovistar http://t.co/WVITO73DOi http://t.co/nf9teIUl0m The draw is made and now it's time to practice until my first game in #wimbledon2015 on Tuesday http://t.co/5izVHjWyzR Ya está el sorteo hecho y ahora a entrenar hasta el martes que jugaré mi primer partido en #wimbledon2015 http://t.co/VlH7FXQWbC Primer entrenamiento en las pistas del torneo en Wimbledon! ;)  First practice session in the Wimbledon courts! ;) http://t.co/FXj5JBMRaY Entrenando en Aorangi Park... :)\nPracticing at Aorangi Park... :) http://t.co/AbkCxfjAqe Muchos ánimos @XS_XaviSegura! Estoy seguro de que pronto volverás donde te mereces estar, de vuelta en el equipo! Un fuerte abrazo Tennis is more than just a sport this weekend at the #RafaNadalTour in Alicante. #tennisandvalues with the @frnadal El tenis volverá a ser más que un deporte a partir de este finde con #RafaNadalTour en Alicante.  #Tenisyvalores con mi fundación @frnadal Happy to see that the #RafaNadalAcademy is making good progress! ;) http://t.co/WVITO73DOi http://t.co/rGxM5Ko2M1 Ilusionado por ver que la #RafaNadalAcademy va viento en popa! Ya queda menos ;) http://t.co/WVITO73DOi http://t.co/M5iohzSG1M @paugasol @tatel_madrid Probaste la tortilla trufada? es brutal!!! #Castellana36 #ViveTATEL RT @paugasol: Por fin en @tatel_madrid!!! #Castellana36 #ViveTATEL http://t.co/b1CNze66sP Todos con @desafioMAPFRE! Comienza la última etapa de la vuelta al mundo y el podio está a su alcance! A tope equipo! #VamosMAPFRE Mucho ánimo y suerte en la operación Delpo. Te queremos ver pronto de vuelta en el circuito Ya entrenando en #Queens! Already practicing in #Queens! http://t.co/DI7DgZCbLM Primeros entrenamientos en hierba #Stuttgart!  \nFirst practice session on grass #Stuttgart! http://t.co/cdeM6zyX5M Working hard to make our #RafaNadalAcademy a reality in 2016. Find out more about it here: http://t.co/WVITO73DOi Seguimos trabajando duro para que la #RafaNadalAcademy sea una realidad en 2016. Descubre los puntos claves en http://t.co/WVITO73DOi Let’s lend a hand to Manos Unidas in the fight against hunger and poverty #ManosUnidasONGD #giveandreceive http://t.co/xr2nr3eizc Echemos una mano a Manos Unidas en su lucha para erradicar el hambre y pobreza infantil #daryrecibir #ManosUnidasONGD http://t.co/4URYifOvPz Hoy no pudo ser. Gracias por el apoyo a todos mis fans, al público de esta maravillosa pista y ciudad de París... http://t.co/uPKWedvBbp RT @becaspodium: La foto de familia de este año, juntos seguiremos trabajando para seguir consiguiendo un éxito tras otro #Podium2015 http:… RT @Fun_Realmadrid: Mensaje de @RafaelNadal para apoyar nuestro partido solidario! http://t.co/Fj1zsbfnyE #CCM2015 #TuEntradaSuFuturo http:… Un tentempié para pasar la tarde #RafaNadalAlimentosEspaña\nHaving a snack this afternoon #RafaNadalAlimentosEspaña http://t.co/8kWedZXyVa Happy to present #RafaNadalAcademy combining tennis excellence, high-level academic development &amp; education in values http://t.co/WVITO73DOi Presentamos #RafaNadalAcademy para alcanzar la excelencia en tenis con una formación académica y de valores de nivel http://t.co/WVITO73DOi I’ve joined #Instagram!!! &amp; I’m starting with a contest for all of you! This is my account: @rafaelnadal Thank you ;) http://t.co/e9KoyrcAoT Me he unido a #Instagram!! Y empiezo con un concurso para todos! Esta es mi cuenta: @rafaelnadal Gracias por el apoyo http://t.co/shQh2unB37 Thanks to the City of Paris for giving me their highest award http://t.co/NCHCrDv2Cs Muchas gracias a la Ciudad de París por entregarme su máxima distinción http://t.co/GmHkHJpsXn @delpieroale Thanks for your support! It was nice talking with you here in Rome! @Arni_Abd Thank you! I appreciate it very much! @cambriaca Thanks for your support! @VamosRafa_Fans Thank you! I really enjoy playing in Italy! @esteladelatorre Muchas gracias Estela! @CharLaborde Gracias Charline por tu apoyo incondicional! Just took the pokerstars poker test and my poker IQ is 157.. Do you think you can beat me? Take the test and find out http://t.co/ZyRQ9RhTuM Ya en Roma entrenando... En un bonito entorno!!\nPracticing in Rome... in a beautiful environment!! http://t.co/Jm0xnsR2cZ Ya estamos en... ROMA. We are in... ROME. Bella città. Ciao Italia! http://t.co/niJDnjrBZg Here's a pic at the restaurant @tatel_madrid! Pleasure to work in this project with @PauGasol &amp; @Enrique305 #Tatel http://t.co/58QFdOXNlJ Aquí una foto en el restaurante @tatel_madrid! Un placer compartir este proyecto con @paugasol y @enrique305 #Tatel http://t.co/LH1D0OJdFx The #RafaNadalTour visits Valencia for the 1st time. Enjoy playing #tennis and working on your values with @frnadal guys! Por 1a vez #RafaNadalTour llega a Valencia. Chicos, disfrutad jugando a #tenis y entrenando valores, con @frnadal Having supper with the team after my debut. Time to enjoy the #Champions ;) #RafaNadalAlimentosEspaña http://t.co/nVmrHwck0Q Cenando con el equipo después de mi debut. Ahora toca disfrutar de la #Champions ;) #RafaNadalAlimentosEspaña http://t.co/XQ8ggtNp3R Bájate Epidemia The Game en tu móvil y ayuda a acabar con el #sida: http://t.co/N3jfOqMzIA #EpidemiaAlert Very happy to be Doctor Honoris Causa by the @UEuropea Thank you very much for this great honor #nadalhonorisue http://t.co/u9RK8NX5eg Muy feliz ser doctor Honoris causa por la @UEuropea Muchas gracias por esta inmensa distinción #nadalhonorisue http://t.co/4mE2LoaDTk Es un honor para mi haber sido premiado con la Medalla de Oro al Mérito en el Trabajo. \nMuy agradecido al... http://t.co/40qDdd8Fl0 This was great to be a part of! Check me out in the latest @NikeSportswear #techpack campaign: http://t.co/UQDzOrBri2 http://t.co/2o49blPFr5 Otro buen día entrenando en #Madrid!\nAnother great day practicing in #Madrid! http://t.co/L0xjQirgPE Thankful to KIA for the trust they’ve always shown in me @kiamotorsiberia @Kia_Motors http://t.co/oba2DNvILz Agradecido con KIA por la confianza que siempre ha demostrado conmigo @kiamotorsiberia @Kia_Motors http://t.co/cIRlnB9OGi Yesterday I met @caro_marin2 in the Caja Mágica in #Madrid! Here's a pic: http://t.co/vNr0al4oTs Ayer coincidí con @caro_marin2 en la caja mágica de #Madrid! Aquí una foto: http://t.co/FUOJTAue90 Un placer compartir pista con los ganadores de #YoretoaNadal en Distrito Telefónica. Espero que lo hayáis disfrutado http://t.co/JTgSsBNkgu De camino hacia Madrid!\nOn our way to Madrid! http://t.co/v8MRuF5yi6 Happy to start working with @Drasanvi and take part in their #health &amp; #wellness projects. Take a look http://t.co/GtzV8QqzgW #NadalDrasanvi Contento de empezar a trabajar con @Drasanvi y sus proyectos de #salud y #bienestar Echadle un vistazo http://t.co/GtzV8QqzgW #NadalDrasanvi Entrenando en Manacor con @Charlymoya \nPracticing in Manacor with Carlos Moyà. http://t.co/TObg6pQGBQ I vote for my friend #PauGasol for the #NBACommunityAssist award for his great job with the community! Thanks Pau for all your work! Voto a mi amigo #PauGasol para el premio #NBACommunityAssist por su labor con la comunidad! Gracias por tu gran trabajo Pau! All my support to the families of the victims of the terrible earthquake in #Nepal &amp; #India. Todo mi apoyo a los familiares de las víctimas del terremoto en #Nepal e #India. Thank you very much for all of your support these days in #Barcelona Muchas gracias por todo el apoyo que he recibido estos días en #Barcelona A pleasure to see a good friend after my debut in #Barcelona! Thanks for your support @neymarjr http://t.co/wPRF2m96mT Un placer recibir la visita de un grande tras mi debut en #Barcelona! Gracias x el apoyo @neymarjr http://t.co/j23rFTlnGN Con ganas de jugar a tenis con algunos de vosotros. Para participar en el sorteo responded este quiz http://t.co/pOruwGz7bU #YoRetoaNadal After practicing, we’ve done a meet&amp;greet with the team of @BancSabadell. Here’s a pic: http://t.co/vG0U7qsm9p Después de entrenar, hemos hecho un meet&amp;greet con el equipo de @BancSabadell. Aquí os dejo una foto: http://t.co/6blbJ0IofR Hoy mi tío Toni presenta su libro #TodoSePuedeEntrenar en el #bcnopenbs http://t.co/3YaQ6kIXsL Happy to be back in Barcelona for the #openbarcelonabancsabadell http://t.co/7ceH2TZfIP Contento de volver a Barcelona para disputar el #openbarcelonabancsabadell http://t.co/q1cXI02qaM RT @onacarbonell: Quieres venir conmigo a conocer a @RafaelNadal? Participa en la campaña #MujerYDeporteOnaYRafa. Aquí la info! Vamos! http… Mucha suerte a mi tío Toni con su nuevo libro #TodoSePuedeEntrenar El 29/04 jugaré a tenis con algunos de los que participéis en este quiz http://t.co/pOruwGz7bU  Con ganas de veros en la pista #YoRetoaNadal Preparing my debut in Monte Carlo with amazing views and great company ;) http://t.co/QEBBejkuEJ Preparando el debut en Monte Carlo con vistas increíbles y en muy buena compañía ;) http://t.co/JGmryFmOU6 En el coche con dos amiguetes!\nIn the car with my two little friends! http://t.co/4OjDsRfCM0 Incredible view of the #MonteCarlo Tournament. One of the most beautiful places of the year! http://t.co/RvYIMlCtWX Vista increíble del torneo de #MonteCarlo. Uno de los sitios más bonitos de todo el año! http://t.co/6b9KakQmO4 Congrats @andy_murray &amp; Kim for your wedding. I wish you all the best! Enhorabuena a @andy_murray y Kim por su boda. Que seáis muy felices! Ya en Monte Carlo... :)\nAlready in Monte Carlo... :) http://t.co/kqUNc4jUHV Último entrenamiento en casa antes de salir hacia Monte-Carlo!\nLast practice session before leaving for Monte-Carlo! http://t.co/GmcSWvYiHv Entorno muy agradable para entrenar! :)\nGreat environment to practice! :) http://t.co/bBsOl8Dvlo Preparando la temporada de tierra! Preparing the clay season! https://t.co/Q79MgPoALH Día de entreno en Miami!\nTraining day in Miami! http://t.co/ztGKlrTItO RT @fclavet: \"Por menos de 1€ al mes puedes ayudar a curar a los niños enfermos de @laminopatia. Menos de lo que cuesta un café. http://t.c… Happy to see how the #RafaNadalTour is progressing. All the best to everyone competing in the stage that starts tomorrow in BCN! @frnadal Contento de ver como #RafaNadalTour sigue avanzando. ¡Ánimo a los que participáis en la etapa que empieza mañana en Barcelona! Con @frnadal Entrenamiento matutino... bajo el caluroso sol de Miami :)\n\nMorning practice session...under the warm sun in Miami :) http://t.co/4s6I4loONA RT @BritishTennis: We’re delighted to announce @RafaelNadal will return for #AegonChampionships @TheQueensClub! http://t.co/SWgixDCFWo\nhttp… Air Max day is around the corner. I am ready with my #airmax zeros #airmaxday http://t.co/2HcfAGRFOp I woke up in the US and I just heard about the plane accident. My thoughts go to the families of the passengers and crew. Me levanto en EE.UU. con la terrible noticia del accidente aéreo de hoy. Mi pensamiento con las familias de los pasajeros y la tripulación. I had a great time last week playing with Vanessa. There is nothing like learning from the best. http://t.co/XwRFdOqV7o Fue muy divertido jugar con Vanessa la semana pasada. Nada como aprender de la mejor. http://t.co/gvvGG48rc2 @CasillasWorld @TRobredo @feliciano_lopez Gracias por los ánimos Iker! A ver si lo conseguimos. Mucha fuerza para el clásico! RT @CasillasWorld: Tres españoles siguen adelante en Indian Wells. Ánimo @RafaelNadal , @TRobredo y @feliciano_lopez , a ver si os traéis e… Ambiente impresionante en el entrenamiento de ayer!! :)\n\nAmazing environment in yesterday's practice session!! :) http://t.co/kvohB3zRWO Practicing in California under the warm sun…and among its warm people!! :) http://t.co/weJuDTK8k2 Entrenando bajo el calor californiano... Y el de la gente!! :) http://t.co/XssRayawBO @Isabel2106 @alejogarciacai1 @CarlosLlanoFdez @AlbertoVarela17 @NoeliHuarcayaC Espero lo hayáis pasado bien! Seguimos en contacto ;) Así viví el torneo de Buenos Aires con mis fans, ¡Gracias por hacerme compañía! #MovistarFanNadal http://t.co/eNfYu2tWXR On our way to IW after resting some days with the family in @DreamsLasMareas, Costa Rica :) http://t.co/nr0BO8lmdX De camino a IW después de unos días de descanso en familia en @DreamsLasMareas, Costa Rica :) http://t.co/Sb5PpP9zv5 Pic of yesterday taking a walk with the team in Granada, Nicaragua. Have a great day! :) http://t.co/H4zJmSS8td Foto de ayer paseando con el equipo por Granada, Nicaragua. Que tengáis todos un buen día! :) http://t.co/5fvBzGjsXj Quiero compartir con vosotros una experiencia única con @ValeYellow46, @lorenzo99 y @Movistar_Team http://t.co/DMsYQEzA2l Disfrutando de 4 días de vacaciones antes de volver a viajar para Indian Wells, un gran torneo! Gracias a todos... http://t.co/w1xnCASzMI RT @RICARDODEDIEGO: Ya en @GVAMotorshow @kiamotorsiberia SPORTSPACE premiere mundial http://t.co/P1nFVWExOI ¡Gracias por vuestro apoyo incondicional amigos de #MovistarFanNadal! ¡Ha sido una experiencia inolvidable! http://t.co/IpvXSlrzph Tras mi debut en #BA tuve la oportunidad de cenar con los #MovistarFanNadal. Gracias por acompañarme en el torneo http://t.co/BhQIL41A5s Primer partido en Buenos Aires, con un invitado especial en el box de mi equipo! :) \n\nFirst game in Buenos Aires,... http://t.co/NxNH6Ax5i0 Foto de desayuno con #MovistarFanNadal @Isabel2106 @alejogarciacai1 @CarlosLlanoFdez @AlbertoVarela17 @NoeliHuarcayaC http://t.co/D74DcQrjvc @vivetelefonica ¡Bienvenidos #MovistarFanNadal! Espero que viváis una ¡experiencia inolvidable en #BA conmigo! Entrenando ya en Buenos Aires!! :)\n\nAlready practicing in Buenos Aires!! :) http://t.co/6bqguxVp46 .@Isabel2106 @alejogarciacai1 @CarlosLlanoFdez @AlbertoVarela17 @NoeliHuarcayaC Queda 1día para conocer a los #MovistarFanNadal…¡os espero! All my support to @alo_oficial in your recovery! Best wishes! Todo mi apoyo @alo_oficial en tu recuperación! Mucho ánimo y fuerza! Already in Buenos Aires practicing for the tournament! Thank you all for your support :) Ya estamos en Buenos Aires entrenando para el torneo! Gracias a todos por vuestro apoyo :) Good luck to all the boys and girls taking part in the 2nd stage of the #RafaNadalTour in Seville. #Tennisandvalues with @frnadal Mucha suerte a todos los chicos y chicas que participan en la 2ª etapa del #RafaNadalTour en Sevilla. #Tenisyvalores con @frnadal Anoche disfruté en el Sambódromo de Rio, con David y Guga!! :D #RioCarnaval\n\nLast night I had a great time at the... http://t.co/otBHLZKUMF El calor no es tan asfixiante por la noche! ;)\n\nThe heat isn't too suffocating at night ;) http://t.co/hpaQ0ouaSm Entrenando bajo la mirada del Cristo Redentor... Ya en Río de Janeiro!! ;) \n\nTraining in full view of Christ the... http://t.co/adB9OJ6uLw Preparándome para la tierra batida!! ;)\nGetting ready for the clay!! ;) \n\nhttp://t.co/Q3FW6p1kxi http://t.co/Do3xZ6aXhC Night Session!!! ;) http://t.co/pADjIWtoug Taking time to analyze #AusOpen data with @babolatPLAY, preparing the next challenges. #connectedtennis http://t.co/XpSLJDWFM8 All my love &amp; support to everyone who fights against this disease #WorldCancerDay Todo mi cariño y fuerza a las personas que luchan contra esta enfermedad #DiaMundialcontraelCancer Que viene la tormenta!!! The storm is coming!!! http://t.co/82S7YINso9 Mi segundo día de entrenamiento en tierra de este año. Hoy sol, pero mucho frío!\n\nSecond day of practice on clay. Sunny but very cold today. De vuelta a los entrenamientos y vuelta a la tierra con nubes aquí en Mallorca\n\nBack to my practice sessions and... http://t.co/0glkdo4U76 @Elenaider Sois los mejores! Muchas gracias por el apoyo :) @CharLaborde Gracias por esperar ;) Igualmente, que os vaya genial a todos! #Vamos @happyslamtennis It’s an honor. Thank you for your message and your support! I always love being in Australia @anastasiakoukla Thank you very much for your support!!” Heading back home. See you soon #australianopen and Melbourne. Thanks to @crowntowers for their attention these weeks http://t.co/lytfFHxm7M Salimos para casa. Hasta pronto #australianopen y Melbourne. Gracias al @CrownTowers por las atenciones estas semanas http://t.co/8ZR65z1O5t Time for me to go to sleep after a tough day. Thanks all for the support. Love being here in Australia. See you next year! Hora de ir a dormir tras un día duro. Gracias a todos por el apoyo. Me encanta estar aquí en Australia. Hasta el año que viene! Almuerzo en equipo lejos de las pistas hoy.\n\nLunch today with the team far away from the tennis courts. http://t.co/3I9c2eqii4 Congrats to my friends @PauGasol &amp; @MarcGasol, starters in the #AllStar2015! #Historic #GasolvsGasol http://t.co/qxvs6oQAyM Muchas felicidades a mis amigos @paugasol y @marcgasol elegidos titulares en el #AllStar2015 #Histórico #GasolvsGasol http://t.co/qxvs6oQAyM Many of you were right! My shoes are the blue&amp;yellow ones, the ones that have my name on them ;) http://t.co/Ovha5YyMaC Muchos habéis acertado! Son las azules y amarillo, que llevan mi nombre ;) http://t.co/bpllp4oeMY Thanks for your messages of support. Yesterday was tough. Today I had a light training session &amp; everything went fine http://t.co/Tj3eZgtaP1 Gracias a todos por los mensajes de apoyo. Fue duro ayer. Hoy tuve un entrenamiento ligero, todo bien. http://t.co/995dakT76s These are the shoes of the Australian Open Team… which ones do you think are mine? #justdoit http://t.co/qIBe8iwaYH Estas son las zapatillas del Team para el Australia Open … Cuáles creéis que son las mías? #justdoit http://t.co/fL6STTScNI Tarde de descanso después de la primera victoria!\nResting this afternoon after my first victory! http://t.co/oMoVGzA0N7 RT @NikeTennis: Comodidad respirable para un ataque implacable. @RafaelNadal\nNA: http://t.co/SW92Qj4PtT\nWE: http://t.co/E3CbO8pBJJ http://t… RT @NikeTennis: Breathable comfort for a relentless attack. @RafaelNadal \nNA: http://t.co/SW92Qj4PtT\nWE: http://t.co/E3CbO8pBJJ http://t.co… Enjoying a @Babolat event to talk about my new @BabolatPLAY Aeroprodrive connected racket #connectedtennis! http://t.co/iIUBnARUpu Nothing like playing at home. This is how the Dekton/Cosentino shooting went @Dekton http://t.co/iZJGAPTUU8 Nada como poder jugar en casa. Así fue la sesión de fotos para Dekton/Cosentino @Dekton http://t.co/iZJGAPTUU8 Good practice session with sun!! http://t.co/lMvEjRHdlS Buen entrenamiento y sol!! http://t.co/lMvEjRHdlS RT @charlyberlocq: Gran entrenamiento con un ídolo @RafaelNadal en Melbourne http://t.co/Y7qTpxrP8p Thank you for your support at #MCA! A pleasure playing with @FerVerdasco @australianopen https://t.co/LobIEldZZQ http://t.co/vQ2VSPn87H Gracias por el apoyo en #MCA! Un placer jugar con @FerVerdasco #fast4tennis @AustralianOpen https://t.co/LobIEldZZQ http://t.co/YuWlHY6jPK Cena de despedida de Doha en casa de mi amigo Karim!! Próxima parada... Melbourne!!\n\nGoodbye dinner in Doha at my... http://t.co/Rzzvu28YSb RT @RICARDODEDIEGO: #prohibidorendirse @JmCalderon3 Animo Jose, tienes mucha gente que te apoya! @nyknicks http://t.co/XY6oFMADS8 Great end of the week... Even better with a good friend! @picomonaco http://t.co/EvHCj04ne9 Buen final de semana... Y aún más si es con un buen amigo! @picomonaco http://t.co/n4V4Gmk5z5 Yesterday it wasn’t meant to be, now doubles with @picomonaco in Doha and on Sunday I’ll travel to Melbourne to prepare the #ausopen No pudo ser ayer, ahora dobles con @picomonaco aquí en Doha y el domingo viajo para Melbourne para preparar el #ausopen RT @babolat: Tennis will never be the same. @RafaelNadal @babolatPLAY #TheNewMove #connectedtennis: http://t.co/PyMd2y9wt9 The 2nd edition of #RafaNadalTour by Mapfre began this weekend in Barcelona. Tennis, values, friendship…together again with @frnadal! La 2ª edición del #RafaNadalTour by Mapfre ha arrancado en Barcelona. Tenis, valores, compañerismo…¡unidos de nuevo! Con @frnadal Siguiente torneo Doha y… con muchas ganas de jugar ante Verdasco, Philippoussis y Jasicka en el nuevo Margaret... http://t.co/QAbrGuYsgu Con mis amigos del equipo Mapfre de la VOR! Muchas gracias por haberme atendido tan bien... Y muchísima suerte!... http://t.co/NfKaL7Edef Ya estamos despidiendo el año aquí en #AbuDhabi. Mis mejores deseos para este inicio de 2015!\n\nSaying goodbye to... http://t.co/W8UBDWG55C Cada vez mas cerca de empezar la temporada. Con ganas de llegar al torneo de @MubadalaTennis .\n#AbuDhabi http://t.co/ki80pM6aG0 Para aquellos que celebréis la Navidad, os deseo una Feliz Nochebuena, en familia o con los seres más queridos!... http://t.co/dGf7OVKZvm http://t.co/r1dn5LI2i3 RT @vivetelefonica: ¡Hemos encontrado a los #MovistarfanNadal que acompañarán a @RafaelNadal a Buenos Aires! http://t.co/8iH30GStFU http://… Entrenando duro estas semanas antes de empezar el 2015. Os gusta el vídeo? \n\nTraining hard these weeks before... http://t.co/Dp1lcPOMop Esta semana entrenando duro con Richard Gasquet y su entrenador, Sergi Bruguera! :)\n\nTraining hard this week with... http://t.co/t5ihU3w2Dj Día de eventos con sponsors en #Barcelona, mañana de vuelta a los entrenos en #Mallorca! \n\nDay of events with... http://t.co/jEvJinazFm RT @NikeTennis: Train On: @RafaelNadal http://t.co/fdx4OoM896 Today is #HumanRightsDay. All my support in creating a more equal society. Hoy es el #DiaMundialDerechosHumanos. Todo mi apoyo en construir una sociedad más justa e igualitaria. ¡Sólo quedan 5 días para saber quiénes me acompañarán! http://t.co/GqUv5dHuSz http://t.co/80XhBJDmkw Te gustaría venir a Buenos Aires conmigo? http://t.co/GqUv5dHuSz http://t.co/CEnpzhemCV RT @albertcostilla: Fui del 1º equipo español en ganar la copa Davis!tú puedes ser el 1º #MovistarFanNadal Acompaña a Rafa a Buenos Aires h… Muy contento por volver a los entrenamientos y con mucha ilusión para preparar la próxima temporada\n\nVery happy... http://t.co/iQKx5Dq5oG Ha sido un placer jugar a golf con buenos amigos en este evento con fines benéficos  \n\nIt’s been a pleasure... http://t.co/sv0DXae1pi RT @PulaGolf: Gracias por todo y hasta el año que viene #OlazabalNadal @frnadal @RafaelNadal @sportmundi @castro_maca @santitaura @Berasate… @TeamNADALes Mil gracias! Me alegro de que te guste! @Vamosgirl1 Thanks! I’m very happy with this project! @melinas1998 Thank you! All the best for you too! @inmanavarrete40 Muchas gracias por tu comentario! @D4n13ltweets Gracias y suerte para ti también!! Shocked about the news of Oz's cricketer Phil Hughes. My thoughts with the family and the cricket fans ¿Quieres venir conmigo al torneo de Buenos Aires? Conviértete en mi mayor fan en http://t.co/GqUv5dHuSz y acompáñame #MovistarFanNadal Yesterday, today and always we support #DomesticViolenceAwareness Ayer, hoy y siempre hay que apoyar #DiaInternacionalViolenciaGenero Cena de Navidad con el equipo!\n\nChristmas dinner with the team! http://t.co/1P1uAIZkTE Sorprendido por la repercusión mediática. Gracias a todos por asistir a la inauguración de la  #RafaNadalAcademy... http://t.co/BEengJe4BO Delante de un gran reto, esta es la primera piedra de la #RafaNadalAcademy by Movistar. Hoy empieza la cuenta... http://t.co/JqDdji3AR7 Carlos Moyá siempre al lado de Nadal, ¡ahora Rafa te busca a ti! http://t.co/etNYGfOgPg RT @frnadal: Hoy se conmemora el #DiadelNiño Es fundamental conocer, proteger y reivindicar sus derechos #ChildrensDay #infancia We are now #7Milion in Twitter! I’m extremely happy. THANK YOU http://t.co/GZ3nRc2KF1 Ya somos #7Millones en Twitter! Estoy muy ilusionado. GRACIAS http://t.co/1mvyrkddR2 Here’s a video of yesterday’s #theduel with @Ronaldo! http://t.co/V0cgqubIPh Os dejo este vídeo de #elduelo de póker de ayer contra @Ronaldo! http://t.co/SsryHurQNK RT @Charlymoya: Mi amigo @RafaelNadal ¡ahora te busca a ti! #MovistarFanNadal.¡Acompáñalo a Buenos Aires! http://t.co/1ZepYIoxAc  http://t.… I won #theduel!! A great game of poker with @Ronaldo! The benefits will be donated to charity http://t.co/45bnhLWguA Gané #elduelo!! Una gran partida con @Ronaldo! Los beneficios irán destinados a proyectos solidarios http://t.co/bR5FFIxv3r Ready to play #theduel with @Ronaldo. The game starts now! http://t.co/9ARgdcZAMR Listo para jugar #elduelo con @Ronaldo. Empieza la partida! http://t.co/pT9rzNfSjf Today’s the big day. Hopefully I’ll do well after all my training! Wish me luck! #theduel http://t.co/8gO7jxMTAN Hoy es el gran día. Después de tantas horas practicando espero que salga bien! Deseadme suerte! #elduelo http://t.co/NfTojKbwtx De visita a Madrid por un evento. Gran día y gran ciudad! \n\nVisiting Madrid for an event. Great day and great city! http://t.co/8MdCDRKIbL Ayer fui a Londres para cumplir con mis obligaciones con el ATP. Torneo espectacular, lástima no haber podido... http://t.co/XU8pL26hD9 ¿Quién quiere venir conmigo al torneo de Buenos Aires? http://t.co/pW3LSqt6YH #MovistarFanNadal RT @vivetelefonica: ¿Estás preparado? ¿Te atreves?\nAlgo está a punto de empezar… y ¡te busco a ti! #MovistarFanNadal http://t.co/YDQ4pHIFws Empieza el proceso de recuperación. Primer paso: paseos por Porto Cristo.\n\nThe recovery process starts. First... http://t.co/E4aIGPmDFd @FansNadalARG Gracias Argentina!! @Anna_ale10 Gracias por esperar ;) @genny_ss Sí, muy buena compañía la verdad! Te agradezco el apoyo @honesgirl Yes! I’m resting these days to be back as soon as possible! Thanks for your support! @rafffffa1986 Gracias por tu apoyo! @paugasol Gracias Pau! Ya estoy en casa recuperándome. Te agradezco los ánimos ;) Todo ha ido muy bien. Muchas gracias por vuestro apoyo. Abrazo! \n\nEverything went great. Thank you very much for... http://t.co/0b8pYTd7jr Gracias por vuestros mensajes de apoyo! Camino del quirófano para una pequeña operación. \n\nThanks for all your... http://t.co/NRudXillU7 Como todos sabéis no jugaré en París ni Londres. Operación de apéndice el 3 de noviembre. Gracias por vuestro... http://t.co/BrVGFLzmDY Aprovechando el día libre. Os dejo una foto paseando por Lucerna :) \n\nI’m taking a walk in Lucerne during my free... http://t.co/QoNRZqDXvl Thanks for playing poker with me. I’m ready now for #theduel with @Ronaldo. Here’s a video of the highlights: http://t.co/s9qhNXs7sX Gracias por jugar conmigo a póker. Listo para #elduelo contra @Ronaldo Os dejo un vídeo de los mejores momentos http://t.co/s9qhNXs7sX Entrenando para debutar en unas horas en #Basilea!\n\nPracticing for my debut in #Basel in a few hours! http://t.co/XoUqfIsrNd Amazing #CarlosSainzJr #WorldSeries champion! Congratulations! #Jerez Grande #CarlosSainzJr campeón de la #WorldSeries! Muchas felicidades! #jerez Ya está listo el proyecto #Conversaciones en el que he participado con @BancoSabadell y @JohnCarlin5  http://t.co/qKvmbykCbU I’m ready to play poker and answer your questions! http://t.co/gljcjYHyHK Ya estoy preparado para jugar a póker y responder a vuestras preguntas! http://t.co/gljcjYHyHK @Ronaldo Jajaja I’m on fire too my friend! #theduel #theduel Tomorrow I’ll answer questions during poker game. If you have questions use #AskRafa http://t.co/gljcjYHyHK http://t.co/DW1933rYVk #elduelo Mañana en la partida de póker responderé preguntas. Si tenéis preguntas usad #AskRafa http://t.co/gljcjYHyHK http://t.co/pvyQEZWIMo Congrats to @marcmarquez93 for becoming once again #MotoGp World Champion! Muchas felicidades @marcmarquez93 por volver a ser campeón del Mundo de #MotoGP! I'm keeping up my poker training for #theduel against @Ronaldo Check what happened on the golf course today: http://t.co/ptGjn4UidR Sigo con el entrenamiento de póker para #elduelo contra @Ronaldo Descubrid qué ha pasado hoy en el campo de golf: http://t.co/ptGjn4UidR I slipped on the green ;-) I'll let you know more in a while #theduel http://t.co/qkZ2XjcFBo Resbalón hoy en el green ;-) Luego os cuento más #elduelo http://t.co/nst93p0NT3 Now I’m looking for you! #MovistarFanNadal http://t.co/eL5rjlvr8q Ahora te busco a ti! #MovistarFanNadal http://t.co/eL5rjlvr8q Entrenando ya en Shanghai...\n\nAlready practicing in Shanghai... http://t.co/LUiC8rXspX Congrats to the Women’s @usabasketball and to the Spanish team #SelFem for the great games you played throughout the World Cup #silver @FIBA Felicidades a @USAbasketball y a #SelFem por los partidazos que habéis jugado de principio a fin! #plata @baloncestofeb Gracias a todos por el apoyo en Beijing. Lamentablemente no ha podido ser. La semana que viene otra oportunidad... http://t.co/7Xuf1EY4oY Felicidades ganadores #RafaNadalTour by MAPFRE @frnadal Gracias a participantes y sponsors por la edición inmejorable http://t.co/Z0Cx4oh8qF Una agradable cena con el cuerpo técnico español del equipo de fútbol Guoan de Beijing!\n\nA nice dinner with the... http://t.co/TujpzC32v5 @paugasol Muchas gracias Pau! Te deseo lo mejor en tu nueva aventura en Chicago y mucha suerte en esta temporada! Te iré siguiendo! Feliz de volver a las pistas. La mejor sensación es esta…Happy to be back on the court. The best feeling is this one… http://t.co/dly0iAaj3y Thanks for playing with me &amp; helping me prepare for #theduel against @Ronaldo! Here are the highlights: http://t.co/rC8fGC4anN Gracias por ayudarme a practicar para #elduelo contra @Ronaldo! Aquí los mejores momentos de la partida: http://t.co/rC8fGC4anN Are you ready? The game starts now! http://t.co/gljcjYHyHK Estáis listos? Empezamos la partida ya: http://t.co/gljcjYHyHK Hey guys! I challenge you to play poker at 7pm! To play with me or to watch us play click here http://t.co/gljcjYHyHK http://t.co/RnrGtFFt8i Chicos! Os reto a 19:00h a una partida de póker!Para jugar conmigo o vernos jugar entrad aquí: http://t.co/gljcjYHyHK http://t.co/2yQPEekYv9 Aquí os dejo una foto con los finalistas del #RafaNadalTour by MAPFRE. Un placer conocer a estos tenistas! @frnadal http://t.co/VCmofO2Jqk Congratulations for your career and I wish you all the best in your new life #LoveLi http://t.co/jinXolrJND Muchas felicidades por tu carrera y que disfrutes de tu nueva vida #LoveLi http://t.co/v0LV9dylvF .@Ronaldo wants a rematch! I start my poker practice for #theduel pretending to be a pilot ;) http://t.co/9SatDdDQlf .@Ronaldo me pidió la revancha! Empiezo el entrenamiento de póker para #elduelo haciendo de piloto ;) http://t.co/aptx9s66lc Ya está aquí la final de #RafaNadalTour by MAPFRE! Felicidades a los finalistas por vuestro juego y valores! Nos vemos allí cracks! @frnadal All my support to my friends from the Spanish tennis team!! Todo mi apoyo a mis amigos del equipo español de tenis!! Muchos ánimos y a seguir siempre adelante! Watching the #DavisCup and supporting my teammates! Good luck to @BautistaAgut and all of the team!! Siguiendo la #CopaDavis y dando apoyo a mis compañeros! Mucha suerte @BautistaAgut y a todo el equipo!! All my support to my colleagues from the Spanish National Team. Yesterday was a bad day. I'm sure you'll give us many more great moments!! Muchos ánimos a todos mis compañeros de la selección de basket. Ayer fue un mal día. Seguro que nos seguiréis dando muchas alegrías!! Ayer entrenando se nos volvió a hacer de noche! Buena sesión!\n\nYesterday we practiced until it got dark again! Good training session! A tope con la iniciativa #ReciclaTuIlusión de @kiaenzona! A por el Mundial de basket!! #VAMOS http://t.co/xYFBz95W0l http://t.co/04iP8fupm4 Many asked so here's a closer look at my @NikeTennis outfits and where you can get them! http://t.co/pXyKsNVkkA http://t.co/Ngvbe6Kl1L Muchos habéis preguntado y aquí podréis ver y conseguir mis uniformes @NikeTennis http://t.co/pXyKsNVkkA http://t.co/ijGzkVAADv Muchas gracias por todos vuestros mensajes de apoyo, me ayudan a seguir trabajando día a día y así poder volver... http://t.co/ULa5aYZHgW I enjoyed last night's great game of our #NationalTeam. Congrats to all the players for another victory! @baloncestofeb ​ Anoche disfruté de otro partidazo de nuestra #Selección! Felicidades a todo el equipo por una nueva victoria! @baloncestofeb Este año para el US Open tenía ilusión de volver a llevar el uniforme sin mangas. Como por la lesión no he podido... http://t.co/9uMWSReMLb @paugasol Mucho ánimo @sergeibaka9 @23Llull Juan Carlos Navarro @rickyrubio9 @SergioRodriguez Felipe Reyes @paugasol Brutal la exhibición de ayer. Mucho ánimo @MarcGasol @alexabrines @josemcalderon8 @Victor_Claver @rudy5fernandez Congrats @Caro_marin2 World Badminton Champion 2014 Felicidades @Caro_marin2 por su victoria en el Mundial de bádminton 2014 Buena suerte a la Selección Española de Basket en el comienzo del #Mundial2014\n\nBest of luck to the Spanish... http://t.co/rBnbmffsrK Con mi amigo David Bisbal en Mallorca.\n\nHaving a great time with my friend David Bisbal in Mallorca. http://t.co/DNLK4S7dJQ Acepto el reto  #ALSIceBucketChallenge para crear conciencia sobre el ELA y reto a @miss_belmont @Charlymoya and... http://t.co/O3FP7Bb912 Siento anunciar que no podré participar en el US Open, torneo en el que en los últimos años he tenido muy buenos... http://t.co/ryV4CzWCBh RT @es_centre: obertes inscripcions de l'escola de tennis pel curs 14-15! Per a mes info contactau amb Tomeu Salvà al 645338380 http://t.co… Entrenando con Dusan Lajovic en Manacor\n\nPracticing with Dusan Lajovic in Manacor http://t.co/JRdQHB6YMz Buena sesión de entreno hoy! Aquí os dejo un vídeo:\n \nGood training session today! Here’s a video:... http://t.co/2YDP9QY9hv Aprovechando estos días para seguir entrenando, siempre con ganas y optimismo.\n \nTraining these days, always... http://t.co/SrU7R8H9PG Durante dos semanas cambiaré el reloj por esta férula\n\nFor two weeks I’m changing my watch for this splint http://t.co/0XK8VrW5BH Triste por no poder participar en Toronto y Cincinnati a causa de una lesión en mi muñeca derecha. Lo siento... http://t.co/Z4yYLk14Tr Con mis amigos del Inter Manacor. Mucha suerte en la nueva temporada!\n\nWith my friends of Inter Manacor. Good... http://t.co/ZAlg4avwbw Precioso dia de relax en muy buena compañía \nWonderful and relaxing day with good friends. http://t.co/upGFnLWXTa RT @pfizer_spain: ¡Conseguido! #TresHombresContraElMar cruzan el Canal de #Menorca a nado! Vuestro sacrificio y superación, nuestra eterna … Mi apoyo a Jacobo, Felix y Peio en el reto #treshombrescontraelmar En especial a Jacobo por su increíble esfuerzo. Ánimo chicos #1KM1sonrisa Muy buen entrenamiento con Christian Garin en Manacor.\n\nGreat training session with Christian Garin in Manacor. http://t.co/CQ0lZjKW8I Very happy for this award! Thanks to @ESPYS and to all of you for always supporting me. Muy contento por este premio! Gracias a los @ESPYS y a todos vosotros por apoyarme siempre. Tomorrow the #RafaNadalTour by Mapfre starts in Madrid. Have fun competing and learning the values with @frnadal http://t.co/VffSFmpUpR Mañana #RafaNadalTour by MAPFRE arranca en Madrid. Disfruta compitiendo y aprendiendo valores con @frnadal http://t.co/VffSFmpUpR De vuelta a los entrenamientos con mucha ilusión!\n\nBack to training with great enthusiasm! http://t.co/IyETYdrSgn Maravillosa la Sierra de Tramuntana en Mallorca\n\nWonderful Tramuntana Mountains in Mallorca http://t.co/Sa8J2o7DWO Ya estamos todos sentados a punto de cenar! Muy contento de pasar estos días en Ibiza con mis amigos \n\nWe’re all... http://t.co/KW4HX1lSWM Disfrutando de una gran comida con unas vistas espectaculares. \n\nEnjoying a great meal with stunning views. http://t.co/4lwXcU8yYc Hoy es un día triste para el mundo del fútbol porque nos ha dejado una leyenda. Un caluroso y sentido abrazo a su... http://t.co/wHihdMcZ9v Marchamos ya de Wimbledon. Quiero agradecer vuestro increíble apoyo, cuando salen bien las cosas y cuando no.... http://t.co/gJW7C8vmyI Middle Sunday en Wimbledon!\n\nMiddle Sunday in Wimbledon! http://t.co/gbXt0MpGIB Camino al entrenamiento con Marc López... Hoy no hay nadie! :)\n\nOn our way to practice with Marc López… There's... http://t.co/8L05kxTMvM Después de mi partido... Toca mundial!!\n\nAfter my game... It's time for the World Cup!!! http://t.co/VuOPZsr8S4 Very happy to be nominated again for the @ESPYS Awards in two categories. http://t.co/vsLogq0SmP Contento de volver a ser nominado a los premios @ESPYS en dos categorías. http://t.co/vsLogq0SmP Cocinando la cena tras un largo día de entreno y cogiendo fuerzas para mañana!\n\nCooking dinner after a long day... http://t.co/IyQV0DVIkZ Al final lo hemos conseguido! Genial pasar estos momentos en familia!\n\nWe got it at the end! Great to spend these... http://t.co/2XdeWOyDVN Jugando fútbol con mis primos \n\nPlaying football with my cousins\n\nhttp://t.co/335E8JOsfs http://t.co/gdVNeYBhsT Can you guess my score at @babolat #Wimbjuggledon? Watch my practice: http://t.co/k8Ky5oXcgx Buena sesión de entrenamiento hoy en Wimbledon, con mucho sol!\n\nGood training session in Wimbledon. It was very... http://t.co/dC6aVI6Djg Winning @wimbledon is a challenge. Winning @babolat #Wimbjuggledon? I’ll try my best. You agree with my prediction? http://t.co/iU0SitNxaA I want to share with you this video #NadalenTelefonica http://t.co/jIYxBd4qEk Quiero compartir con vosotros este video #NadalenTelefonica http://t.co/jIYxBd4qEk ¡Listo para #endlesstennis en Londres con @NikeTennis! http://t.co/UrEeF3jPUp Ready for #endlesstennis in London with @NikeTennis! ¡Listo para #endlesstennis en Londres! http://t.co/inPfpEZiAs Happy for the tribute from @Nike Spain. You can check it out in Nike Portal del Ángel Barcelona #endlesstennis #RG14 http://t.co/k5dGBQ5aRo Muy contento por el homenaje de @Nike Spain. Podéis verlo en Nike Portal de l'Àngel Barcelona. #endlesstennis #RG14 http://t.co/IPW037auMq Es un día histórico para España, estoy seguro que Felipe VI sabrá dar continuidad al gran legado del Rey Juan... http://t.co/9uLrdCoBGV A punto de ver el segundo partido de la #SelecciónEspañola! Todo mi apoyo al equipo contra Chile en Brasil! Desde... http://t.co/qwsLIOZi1T Primer entrenamiento en Wimbledon! :)\n\nFirst training session in Wimbledon! :) http://t.co/JsCXTONCcP Ya en Wimbledon! Primera parada: supermercado, para preparar la cena de esta noche siguiendo a la Selección... http://t.co/0iiiy18OkP I want to thank everybody in Telefónica for their warm welcome on my visit to Ciudad Telefónica. THANK YOU all for your support Quiero agradecer a toda la gente de Telefónica por su cariño en mi visita a la Ciudad Telefónica. GRACIAS por vuestro apoyo Ya estoy en casa, me esperan unos días de descanso antes de viajar a Wimbledon… No estoy contento con el... http://t.co/l9NOaKD3wr Gracias a Mapfre por apoyar este proyecto tan importante para mí y mi Fundación. http://t.co/QlP8EtQmrY Nine titles on this special clay. Honored @NikeTennis have made me from the same stuff. #endlesstennis #RG14! http://t.co/fdXL6zeaq7 9 títulos en la tierra batida más especial. Un honor @NikeTennis me haya hecho con ese material #endlesstennis #RG14 http://t.co/Ydof5qrgMc Thank you @NikeTennis for making this video! #endlesstennis http://t.co/n63bhVZfuL Muy agradecido a @NikeTennis por este vídeo! #endlesstennis http://t.co/ksYWjpqLtg RT @babolat: Do you believe in #MA9IC? @RafaelNadal http://t.co/wK2ZBfjQ1Q RT @Richard_Mille: 9th title for Rafa Nadal in French Open. Unbelievable ! http://t.co/HzsbpqIGt9 RT @kiamotorsiberia: Noveno #RolandGarros de Rafa!! Eres enorme campeón!! #vamosRafa http://t.co/KO0cXgfWIH Ya en pista entrenando tras el viaje.\n\nAlready on the court practising after the trip. http://t.co/XdnxO9p8Kt GRACIAS @gerardeulofeu @TheRealPatCash @MarcBartra91 @26_DaniPedrosa GRACIAS @feliciano_lopez @Benzema @llorentefer19 @alizecornet @Clijsterskim @swish41 @R9Soldado  @AlexCorretja74 @_AlvaroNegredo_ GRACIAS @delpotrojuan @tomasberdych @albertocontador @alexmarquez23 @AleixEspargaro @josemcalderon8 @AndujarPablo GRACIAS @TigerWoods @paugasol @marcmarquez93 @Charlymoya @23Llull @FerVerdasco @DavidFerrer87 @aarbeloa17 @M_Granollers Thanks to all!!!! http://t.co/GZuH6Fng7a Gracias a todos!!!! http://t.co/wvHJ9hCPYh GRACIAS A TODOS POR VUESTRO APOYO!!! YA ES UNA REALIDAD. #DREAMIN9 http://t.co/iS94wwG9Qm #DREAMIN9 Agradecido con todo el trabajo que están haciendo todos los responsables del #RafaNadalTour by Mapfre y... http://t.co/rJf4O7Fz2S Acabo de recibir una llamada de apoyo del Rey Juan Carlos I. Agradezco mucho el cariño y apoyo que siempre recibo... http://t.co/ktfrqU5kHu Celebrando la victoria de hoy en familia. Gracias por acompañarme siempre! \n\nCelebrating today’s victory with... http://t.co/roLllP2jIu Muy contento después de la victoria de hoy. Muchísimas gracias a todos por vuestro apoyo!\n\nVery happy about... http://t.co/tL4HcK4EsB Gracias al Café de la Paix por su tarta y sus atenciones en el día de mi cumpleaños. Y gracias a todos mis fans... http://t.co/9jAucOHGl4 Muy contento por todas vuestras felicitaciones. Muchas gracias a todos, sois increíbles!\n\nVery happy for all your... http://t.co/LqsZcVujwy Y gracias también a toda la organización por esta fantástica tarta!\n\nAnd thanks to all the organization for this... http://t.co/Ya1Ijg3HXC Big thank you to the #RolandGarros drivers team for this great birthday surprise! http://t.co/Z5SJpANaW1 Muchas gracias a todo el equipo de choferes de #RolandGarros por esta genial felicitación! http://t.co/Z5SJpANaW1 Entrenamiento matutino con el júnior con el que coincidí en Corea cuando visité las instalaciones de KIA!\n\nEarly... http://t.co/LAyR3xW6T1 Ayer tuve el placer de conocer a Owen Wilson! :)\n\nYesterday I had the pleasure of meeting Owen Wilson! :) http://t.co/Y7lWvkc2uu Cenando en buena compañía\n\nHaving dinner with great company http://t.co/dkPuv5bu0l A dos minutos de Roland Garros... Un sitio tranquilo y agradable para entrenar! :)\n\nTwo minutes away from Roland... http://t.co/TjVMeZWeAv Cenando con unos amigos en el Café de la Paix. Gracias Paz... \n\nHaving dinner with friends at the Café de la... http://t.co/F4P1hiDVdI Ya en BCN el 2o circuito juvenil #RafaNadalTour by MAPFRE! Disfruta de la competición y entrena los valores @frnadal http://t.co/hObMgIM24l Ready for #endlesstennis in Paris! @NikeTennis http://t.co/3DELFwOte7 Listo para #endlesstennis en París! @NikeTennis http://t.co/3DELFwOte7 Preparado para disfrutar la gran final.....\n\nReady to enjoy the great final..... http://t.co/YafT93h6Of When they lose they blame their luck, but I’ve put more hours than they have, that’s why I win. That’s my trick ;) http://t.co/gFU5HC4KtS Ya veis. Los que pierden siempre piensan que es suerte pero yo llevo más horas que ellos en esto y por eso gano ;) http://t.co/Dd5bzAhGaB Who do you think that won the poker game: @picomonaco, @FelicianoLopez or me? Here to see the last play ;) http://t.co/EPmREkFQPd Quién creéis que ha ganado la partida entre @picomonaco, @feliciano_lopez y yo? Aquí la última jugada ;) http://t.co/EPmREkFQPd Playing poker in the players lounge at #RolandGarros with @picomonaco &amp; @Feliciano_López before #ChampionsLeagueFinal http://t.co/GvYJr1bBxz Jugando a poker en la zona de jugadores de #RolandGarros con @picomonaco y @Feliciano_Lopez antes de #FinalChampions http://t.co/MtIHxbyDRV Played a bit with @SerenaWilliams and some kids today at a @niketennis event in Paris. #endlesstennis http://t.co/1j07WSBVwZ He jugado un poco con @SerenaWilliams y algunos chic@s en el evento @niketennis en París. #endlesstennis http://t.co/TwEBbmPqNo Just 100 days left for the Basketball World Cup in our country, are you going to miss it? #Spain2014 http://t.co/Zl7yh7K0GM Sólo quedan 100 días para la Copa del Mundo de baloncesto en nuestro país, te lo vas a perder? #Spain2014 http://t.co/0T1MBe3If9 RT @frnadal: Adéntrate a través de este vídeo al circuito juvenil #RafaNadalTour by MAPFRE: http://t.co/vFWFFV306Q  ¡Tenis, valores y diver… RT @DjokerNole: \"@nenadzim: Podrška svima!! Pomozimo ugroženima!! Uključite se u akciju prikupljanja pomoći!!\n@DjokerNole http://t.co/1XvMy… Your help in Serbia &amp; Bosnia is fantastic @DjokerNole. My support &amp; best wishes to the victims of the terrible floods http://t.co/kOjHU2dsR5 Increíble tu ayuda @DjokerNole en Serbia y Bosnia. Mi apoyo y cariño a las víctimas por las terribles inundaciones. http://t.co/kUaP51VuXe Esta vez no pudo ser pero me voy de Roma con lo positivo de la mejora en mi juego. Ed anche ringraziare lo staff... http://t.co/Df6j8HIA6Q En el hotel no había comida así que mi restaurante favorito en Roma, Le Tamerici, me envió la comida. Gracias... http://t.co/0N8jWVzcfv Entrenando en Roma... La Ciudad Eterna! ;)\n\nTraining in Rome... The Eternal City! ;) http://t.co/ZVY6LGNUlq We don't always win the way we'd like. Happy for the award &amp; grateful for the support! Playing in Madrid is a very special experience for me A veces no ganamos como deseamos. Contento por el premio y agradecido por el apoyo! Jugar en Madrid es una experiencia muy especial para mí Having dinner with two great people... @AlejandroSanz &amp; @CasillasWorld ... Good idea Alejandro, thank you very much http://t.co/9wzKmK8TNp Cenando con dos grandes ... @AlejandroSanz y @CasillasWorld ... Gran idea Alejandro, muchas gracias. http://t.co/4FaimOxvxK Very sad to hear that Elena Baltacha passed away. RIP. Muy triste por la muerte de Elena Baltacha. Descanse en paz. Having dinner with friends in Madrid @picomonaco @JoanSuasi Rafel Maymó http://t.co/wMXKO9pO9L Cenando con amigos en Madrid @picomonaco @JoanSuasi Rafel Maymó http://t.co/ieEm1gZ4C1 Hello everyone, here's a pic with my friend @jamunar_38 #selfiewithjaume http://t.co/lDW6A3Kvdk Hola a todos, aquí os dejo una foto con mi amigo @jamunar_38 #selfieconjaume http://t.co/RVFYgZG7Dy ¡Emocionado de compartir mi nueva indumentaria @NikeTennis French Open! #endlesstennis http://t.co/Pr7Wy78TmO http://t.co/a0KnkPs9k8 Excited to share my new @NikeTennis French Open look! #endlesstennis http://t.co/Pr7Wy78TmO http://t.co/CfP3GSJUit De camino a Madrid...\n\nOn the way to Madrid... http://t.co/EOTleiGURo Día de entreno físico en Mallorca \n\nPhysicall training day in Mallorca http://t.co/o8IMSU7fib Muchísimas gracias a @DANIROVIRA y @giselaoficial por apoyarnos en el #CharityDay junto a @CasillasWorld . Estáis preparados? Solo 4 días!! RT @DANIROVIRA: El 2 de Mayo estaremos en el #CharityDay junto a @CasillasWorld y @RafaelNadal. Dios perdónales, porque no saben lo que hac… Últimas pistas para el #CharityDay amigos!! Nuestra voz en Disney españa..y un cómico con 8 apellidos junto a @CasillasWorld Quién es quién? RT @thibautcourtois: @RafaelNadal. Vamos a llenar la pista el 2 de mayo junto a @CasillasWorld  en el #CharityDay del @MutuaMadridOpen. Tie… @CristiPedroche @thibautcourtouis  muchas gracias amigos por vuestro apoyo! No te quedes sin tu entrada del #CharityDay con @CasillasWorld Amigos! Más pistas del #CharityDay el 2 de mayo junto a @CasillasWorld en Caja Mágica. Tiene 21 añitos, es belga, portero del.... quién es?? Cuenta atrás para #CharityDay el 2 de mayo con @CasillasWorld. Otra pista! La rayista más famosa de la TV estará con nosotros!! Adivináis?? Hoy nos ha dejado un gran hombre. Mi más sentido pésame a la familia y amigos de Tito.\n\nToday a great man has... http://t.co/tkhZFykVyI RT @lasanchez: @RafaelNadal estoy con vosotros @CasillasWorld !!! Nos vemos el próx 2 de Mayo en el #CharityDay del @MutuaMadridOpen Tienes… Muchas gracias amigos @lasanchez @ChristianG_7 @Andy_Murray @rudy5fernandez por vuestro apoyo!!!Todos el 2Mayo @CasillasWorld #CharityDay Experiencia única gracias al Banc Sabadell Open. Partido de tenis con David Ferrer en el Liceo de Barcelona.\n\nA... http://t.co/c1aXY3Ic8y Amigos! Nueva pista para #CharityDay : un tenista escocés y un jugador de baloncesto de mi tierra!! Todos el 2 de mayo junto @CasillasWorld. Amigos! 2 de mayo en el #CharityDay junto a @CasillasWorld contaremos con una poli muy guapa y el rey de las palabras! quien es quien??? En Barcelona, entrenando ya de nuevo!!\n\nBack to training in Barcelona!! http://t.co/VshoZ60oBN Gracias a todos por vuestro apoyo en Montecarlo y suerte a mi amigo #DavidFerrer \n\nThank you all for your support... http://t.co/sXHgHdmoCW Partidos al mediodía bajo el sol de verano.  \nEncuentros nocturnos hasta quedarse sin luz. #endlesstennis Midday matches in the summer sun.\nLate night meetups that last until the lights go out. #endlesstennis ¡Hola amigos!\n \nEl próximo viernes 2 de mayo, tengo una cita en la Caja Mágica con Iker Casillas y muchos amigos... http://t.co/swNk4ImK7S Espectacular salida al mar en el Tuiga de Monaco y su equipo. Gracias al Yatch Club de Monaco por esta... http://t.co/f7nHTr9f4N Congrats to my friend @BubbaWatson for winning the #MastersAugusta and to #MiguelAngelJimenez for his great tournament. Muchas felicidades a mi amigo @BubbaWatson por ganar el Masters Augusta y también a #MiguelAngelJimenez por su gran torneo. Great experience playing with the world's number 1 female poker player Vanessa and very happy to have learned a lot. http://t.co/6oz9t3Wuxn Gran experiencia jugar con Vanessa, la jugadora de poker número 1 del mundo. Muy contento de haber aprendido tanto http://t.co/FQI6ElH7JT Saliendo hacia Montecarlo. Con muchas ganas para lo que viene. \n\nHeading to Montecarlo. Looking forward to what's... http://t.co/Sa7FqkLBeE Aprovechando este día tan bueno para tomar un baño después de entrenar. \n\nGreat day for a swim in the pool after... http://t.co/shp5lIm8FM Feliz cumpleaños a mi amigo y compañero Ferru! Happy birthday to my friend and teammate Ferru! @DavidFerrer87 http://t.co/zXV4jPwSLt En el tren destino a Madrid, jugando un Sit and Go.\n\nOn the train to Madrid, playing a Sit and Go. http://t.co/Hmr32DqYXz Hoy a pesar del esfuerzo no ha podido ser. Increíble apoyo en Miami. Os mando esta foto saliendo del hotel camino... http://t.co/iCMSSgItdQ Are you ready to celebrate the air max day? #airmax \n\nEstáis listos para celebrar Air Max Day ? #airmax http://t.co/FMHFL4jOiV THANKS for the work he did for all us Spaniards #AdolfoSuarez. My thoughts are as well with his family GRACIAS por su trabajo para todos los españoles #AdolfoSuarez. Mi pensamiento también está con su familia Listo para el partido! Gracias por vuestro apoyo incondicional! ;)\n\nReady for the game! Thanks for your... http://t.co/dW84ZUbKlr Hope you enjoyed the 1st #rafanadaltour by MAPFRE tournament in Sevilla, competing &amp; training in values of @frnadal http://t.co/amnhPreIGu Espero que hayáis disfrutado del 1r torneo de #rafanadaltour by MAPFRE en Sevilla, entrenando los valores de @frnadal http://t.co/WU8CjQEprB Had great fun the other day playing with fans and answering your questions. See the highlights http://t.co/6YKH0OOeqo http://t.co/ah9vQyTxjc Having fun playing and answering your questions live – watch me now! http://t.co/rw41SB4CGG Looking forward to playing and answering your questions live – watch me at 5.30 ET. http://t.co/08Y2mOh3B6 http://t.co/ZwCoOneRAm Had a great day yesterday visiting with the @NikeTennis Team in Oregon http://t.co/iK0F18WPwB Congrats to my friend @flavia_pennetta for your great victory today in Indian Wells. Grandissima e tanti auguri! Enhorabuena a mi amiga @flavia_pennetta por la gran victoria de hoy en Indian Wells. Grandissima e tanti auguri! Hoy hace 15 años que mi amigo @Charlymoya se proclamo #1 del mundo. Desde aquí en Indian Wells: Felicidades... http://t.co/t1hhNYnQni A noble cause for an event which is being developed #NEVERSTOP http://t.co/VRAAAI8DLH Una causa noble para un evento que está desarrollándose #NEVERSTOP http://t.co/VRAAAI8DLH Seguimos entrenando en Indian Wells, con vistas a Miami! ;)\n\nI'm training in Indian Wells, looking forward to... http://t.co/6jMpPnpKiW Larry Ellison’s plans for the next #americascup sailing race look really interesting! Muy interesantes los planes de Larry Ellison para la siguiente #americascup de vela! Buen putt de @TigerWoods desde 27 metros! Great @TigerWoods who has made a 91-foot putt! #Cadillac Un día para olvidar... Pero cenando en muy buena compañia\nA bad day... But I have dinner with a great friend http://t.co/ATpef7GOWR Agradecido al Banco Sabadell por confiar en mi muchos años. \n\nVery thankful to Banco Sabadell for giving me their trust many years. Agradecido al Banco Sabadell por confiar en mi muchos años. Very thankful to Banco Sabadell for giving me their trust many years. Buceando en Cozumel! Una gran experiencia! He desconectado totalmente del mundo. http://t.co/9w4GbUCYKp... http://t.co/cWDbZhxFjl Entrenando un poco en la pista del Secrets en Cozumel! ;)\n\nPracticing at the court of Secrets in Cozumel! ;) http://t.co/7QBJTrsMh3 En aerotaxi de Cancún a Cozumel! Nos ha tocado un gran piloto, gracias por dejarme entrar en cabina!... http://t.co/K6Tc2vGMNv Muy contento después de la victoria hoy en Río. Very happy after the victory today in Rio. http://t.co/WpBYQIvXj8 I wish you a happy B-Day @MadAliceCudlip ! Thanks for your love and your uncondicional support :) Te deseó un feliz cumpleaños @MadAliceCudlip ! Gracias por todo tu cariño y apoyo incondicional :) A very strong hug to all the Venezuelan people. I hope everything is solved fast and the peace comes soon #SOSVenezuela Un abrazo muy fuerte a todo el pueblo Venezolano , espero que todo se solucione pronto y vuelva la Paz #SOSVenezuela Very grateful to the Laureus Academy members for nominating me for two categories @LaureusSport . Always an honour! Agradecido a la academia @LaureusSport por ser nominado este año en dos categorías. ¡Siempre un honor! My new stickers # LINE! You can talk with your friends using my drawings ;) http://t.co/vo9lucIYh4 http://t.co/PzxzJYbZqD Mis nuevos stickers #LINE! Hablad con vuestros amigos usando mis dibujos,ya estoy en ello ;) http://t.co/XpofQ3Qc0G http://t.co/PqGC2xN23d El torneo de Rio me regalo esta camiseta: 800 partidos jugados en mi carrera como profesional.. me voy haciendo... http://t.co/wMszNV7pQe Con amigos disfrutando de Rio! Una gran ciudad os la recomiendo a todos\n\nWith friends enjoying Rio! I recommend... http://t.co/SBWsl8SPwL Saque de honor en Maracaná! Kickoff in Maracaná! http://t.co/SPlwyJRqN1 Maracaná con Pico! Maracaná with Pico! http://t.co/bmMuLZLZ5w Encantado a vista ao Cristo. http://t.co/McBk9qwaJo All my support to #JavierFernandez !  Sure He will give many successes to spanish sport Todo mi apoyo a #javierfernandez ! Seguro que dará muchos exitos al deporte español Preparándome para el torneo de Rio en mi club de toda la vida!\n\nPracticing to the Rio tournament in my first club! http://t.co/31O6CqrRzj Felicidades a la la @policia  líder mundial en colaboración ciudadana http://t.co/C5UnOzNVKs Sorry announcing withdraw from B Aires. Fans &amp; Tournament can’t be better but stomach virus didn't allow practice. http://t.co/tfMNVx7LdD Lamento anunciar mi retirada del torneo de B Aires. Saludo muy cariñoso a mis fans en Argentina y a los organizadores.http://t.co/tfMNVx7LdD All my support to my friend #PacoGonzalez and his family, I'm glad that you are well. Todo mi apoyo al amigo #PacoGonzalez y su familia, me alegro que todos estéis bien. Thanks @mundodeportivo a great #galaMD. It wouldn't have won these awards without your support!http://t.co/qInZ0YHvJs http://t.co/MJNxbxEn8b Gracias a @mundodeportivo por esta gran #galaMD.  Dos premios que no hubiese conseguido sin vuestro apoyo! http://t.co/qInZ0YHvJs Very happy to collect the award for excellence in sport in the 66 #galaMD Thanks to all @mundodeportivo! http://t.co/xa93aMj2Zk Muy feliz por recoger el premio a la excelencia deportiva en la 66 #galaMD Gracias a  todos @mundodeportivo! http://t.co/7pOytczsJ4 Together with @frnadal we have created  #RafaNadalTour by MAPFRE, a junior circuit that combines tennis and education http://t.co/42JR9E6zoS Con @frnadal, creamos #RafaNadalTour by MAPFRE circuito juvenil que une tenis y formación http://t.co/6bNPgUL4Y1 http://t.co/O8WLELHMbd Junto con mi Fundación os presentamos Rafa Nadal Tour by MAPFRE, un circuito juvenil de tenis en el que la... http://t.co/DpwGCj1mIy Junto con @frnadal, hemos creado #RafaNadalTour by MAPFRE, un circuito juvenil que combina tenis con formación. http://t.co/lH25QYyhAh Siento una gran tristeza por la pérdida de Luis. Mis más sinceras condolencias para sus más allegados. http://t.co/rULtqFIQi3 Vamos Feli! Tu puedes!! Come on Feli!! You can do it!! http://t.co/bcL33bPE8w Vamos Feli! Tu puedes!!\nCome on Feli!! You can do it!! http://t.co/Fv2FeXjeIP Ya en Mallorca recuperándome. Mucha suerte a mis compañeros de la #Davis para mañana y en especial a Carlos en su... http://t.co/E7LCf02L9T Now at home after long trip. Stop at Barcelona to recive my medical  treatment and again on monday. Thank you for your support!! Ya en casa tras el largo viaje. Parada en Barcelona para el tratamiento médico y el lunes pasaré otra revisión. Gracias por el apoyo!!! ¡Listos para el viaje de vuelta a casa! Muchas gracias a todos por vuestro apoyo.\nReady on our way back home!... http://t.co/k2GvYrMqyu Getting ready for tomorrow's Melbourne Grand Slam ! Very exited!! http://t.co/jyJi30pOTm Preparando con ilusión la final de mañana en Melbourne!! ;) http://t.co/rqVKK8U8yv Mis condolencias a la familia y seres queridos de Rosi Carrasco, mucha fuerza en estos duros momentos. @aniie_98 Todo bien a seguir trabajando! Gracias por tu apoyo! @CharnyFoxey Hi! I always want to play! Thanks for your support @brincheiro Gracias! Con vosotros detrás todo es más fácil! @Dynastyni Con tu apoyo desde Twiiter vale :) Im amazed by all your posts. Thanks for your support. #vamos Estoy alucinando con todos vuestros mensajes. Gracias por vuestro apoyo! #vamos Thanks @Abd_fed! I hope you enjoy the next match! Gracias por tu mensaje @PamelaReay sin vuestro apoyo no hubiese llegado donde estoy @gercorrea1 gracias por tu apoyo!! #vamos Hi @adarshjagath99 I hope you enjoy the tournament! Thanks for your support @MrPlaney8 Después del entrenamiento aquí estamos comiendo el equipo en Donovan’s en la playa de St. Kilda en Melbourne. ;-)... http://t.co/h2xdFNTk4g Recuperando fuerzas después de entrenar bajo el calor australiano!! \nRecharging batteries after practice with the... http://t.co/morVrqpcVa Una foto difícil de tener habitualmente y bonita para el recuerdo del #KidsDay de ayer! http://t.co/r37sqqESmx Not easy to get this stamp but so special to remember yesteday's #KidsDay ! http://t.co/tHxHqDrnxT Hoy he recibido las zapatillas diseñadas por Tuts que ha preparado para todo el equipo!! :)\nToday I've received... http://t.co/3h9XXXjr6E Today I've received the team's sneakers designed by Tuts.!! :) http://t.co/k2hcMMDCNV Hoy he recibido las zapatillas diseñadas por Tuts que ha preparado para todo el equipo!! :) http://t.co/Fe61K71wHM Buen entrenamiento con mucho calor! Great practice under intense heat! http://t.co/WY3Kt7FlJx Buen entrenamiento con mucho calor! Great practice under intense heat! http://t.co/etllD0MqPp Después de casi dos años... De vuelta en Melbourne!! :)\n\nAfter almost two years ... Back in Melbourne! :) http://t.co/H8NWKzZF6F Contento por el triunfo en Doha! Os lo dedico a todos por vuestro apoyo.\n\nHappy for the victory in Doha! I... http://t.co/6V4D6T7UzC Preparando con ilusión la final de Doha contra Monfils! Practicing before the final against Monfils in Doha! http://t.co/aEZDo1dcWP “Ready to Give it my All in 2014” http://t.co/9hT0v1aCzh Feliz NocheVieja a todos y prospero Año Nuevo! Espero que podáis disfrutar con vuestros seres queridos de la... http://t.co/MJePgz8AQg Fighting hard #MichaelSchumacher , you are a strongman and you will be better soon #AnimoSchumi #Schumi Mucha fuerza #MichaelSchumacher , eres un luchador y te recuperarás pronto! #AnimoSchumi #Schumi Muy buen tiempo aquí en Abu Dhabi! :)\nSunny weather here in Abu Dhabi! :) http://t.co/CdGShTzpZp Último entrenamiento antes de partir hacia Abu Dhabi! \nLast practicing before travel to Abu Dhabi! http://t.co/u7LSjndHnf Thanks to @teledeporte! A great video! #bonnadal #feliznadal #merrynadal to everybody! http://t.co/A6KVoivbVr Muchas gracias a @teledeporte por este gran video! #bonnadal #feliznadal #merrynadal a todos! http://t.co/A6KVoivbVr This is a summary of all about #TGHP , included what we have been able to collect between all for this good cause.\nhttp://t.co/vR8dZP3EpG Éste es un resumen de lo ocurrido en #TGHP incluido lo que hemos conseguido recaudar entre todos por esta buena causa http://t.co/vR8dZP3EpG I had the pleasure of meeting and practicing in Mallorca with @BornaCoric.I wish you the best in the next tournaments http://t.co/c7oowoH1l2 Tuve el placer de conocer y entrenar en Mallorca con @BornaCoric. ¡Gracias! te deseo lo mejor en tus próximos torneos http://t.co/kDZF9UhMYb I've already sign this good cause @reimaginatenis http://t.co/gPlLhsGDYE Yo ya he firmado esta bonita iniciativa @reimaginatenis http://t.co/y0HFnRmSg9 Feliz y agradecido por recibir este premio en una ciudad especial para mi. \n\nI'm very happy and grateful to... http://t.co/vgbS3Oyu81 ¿Creéis que el remate entró o salió?\n\nDo you think the smash was in or out? http://t.co/hOm9JyeFgW It's a pleasure to partner with #TGHP donating this prize to Charity Challengue of EPT #Praga http://t.co/UITgmGii8z Es un placer poder colaborar con #TGHP donando el premio a Charity Challengue del EPT #Praga http://t.co/UITgmGii8z ¡Entrenamiento matutino en Manacor!\n\nPracticing in the morning in Manacor! http://t.co/FaDrayOaUE Tienes razón @paugasol ! Uno puede irse, pero no hacerse  :) http://t.co/V1c4Y0DOxu #hazteextranjero Cena de navidad con el equipo. Christmas dinner with the team. http://t.co/eavLPsv6iz Very happy for my victory in the charity poker tournament in Prague. All the funds raised will go to #TGHP http://t.co/lQ2c934X68 Muy feliz por mi victoria en el torneo benéfico de poker en Praga. El dinero recaudado se destinará a #TGHP http://t.co/XOEB9fHKhF Entrenamiento matutino... Disfrutando de un gran día!! :D \nMorning practice... Enjoying a great day! :D http://t.co/mmNbnYHSwr Jajajaja les habrás dicho que no verdad @paugasol ? Que se busquen a otro! Talking about the strategy of the Prague poker tournament  with my friend Ronaldo. http://t.co/H0r32yHjWD Comentando la estrategia del torneo benéfico de poker de  Praga con mi amigo Ronaldo. http://t.co/a54OZ0ds2g Will I beat my friend Ronaldo tomorrow in the charity póker tournament in Prague? The funds raised will go to #TGHP http://t.co/F5PqiC93FP Ganaré a mi amigo Ronaldo mañana en el torneo benefico de Poker en Praga? Lo recaudado se destinará a #TGHP http://t.co/qZO8liBpF6 Look what I have donated for a charity auction of #TGHP! It's for a good cause! http://t.co/D8rBJWK2lu http://t.co/j1zC75Hs2f Mirad lo que he donado para la subasta solidaria de #TGHP! Es por una buena causa! http://t.co/D8rBJWK2lu http://t.co/jGh5a8CSI3 Buen entreno por la mañana con mi amigo Tomeu. Esta tarde preparación física.\nGood practice in the morning with... http://t.co/8XzzBBJyV6 With the great @jgomeznoya cycling in this wonderful area of Mallorca. I recommend it to you! http://t.co/2ywcxU8kSh Con el gran @jgomeznoya recorriendo esta maravillosa zona de Mallorca.  Os la recomiendo! http://t.co/8nW79csnyp Primer día de entrenamientos en casa. Preparándome ya para 2014.\n\nFirst day of practice home. Getting ready for... http://t.co/WMHxSzX1P6 Last chance to play my last live poker game with my mates before the Prague charity tournament. http://t.co/FNvSm0krHo La última oportunidad de jugar en vivo al Poker con mis amigos  antes del torneo benéfico de Praga. http://t.co/qVZYklMEFl Rest in peace Nelson Mandela, you have been a role model to the world. My most sincere condolences to family and friends. Descansa en paz Nelson Mandela, has sido un ejemplo para todos nosotros. Mi más sentido pésame a la familia y amigos. Playing heads up with Alfonso, getting ready to beat Ronaldo in the Prague Poker tournament! http://t.co/EPwOc6yjaL Jugando un cara a cara contra Alfonso, preparándome para competir contra Ronaldo en el torneo de Poker de Praga! http://t.co/euPoDk1Jkq Congrats @Jules_Bianchi for be the #AutosportRookieoftheYear at the #AutosportAwards in #London ! Felicidades @Jules_Bianchi por tu premio como #AutosportRookieoftheYear en el #AutosportAwards en #Londres ! Good Luck @DianaLunaOdB in your last golf competition of the year on the #LadiesEuropeanTour, the #DubaiLadiesMasters ! Ánimo @DianaLunaOdB en tu última competición del golf #DubaiLadiesMasters de este año, en el #LadiesEuropeanTour ! My first live tournament in Prague! Not to be knocked out fast, Alfonso helps me to improve my game. A tough Job ;) http://t.co/ybuHHyOqrt Mi primer torneo en vivo en Praga! Sigo perfeccionando con Alfonso para que no me echen rápido, será complicado ;) http://t.co/pu5rCTJ9E7 I will take you on head 2 head, lets see if you will bust out or play the long game. #TeamRafa #TGHP  http://t.co/Z579nGieoy ¡Aquí tienes mi jugada @Tomeu_Nadal! Ganarte con los ojos vendados es mas facil que sacar un poker #TeamRafa #TGHP  http://t.co/Z579nGieoy My little brother @Tomeu_Nadal, you wish you had my skill. I will raise you, check this out and its not a bluff #TGHP http://t.co/xF338TJFod @Tomeu_Nadal Ya te gustaría hacer esos toques. Por cierto, yo también tengo algo y no es un farol #TeamRafa #TGHP http://t.co/xF338TJFod @Tomeu_Nadal Ok, im prepared and ready to show you that I will play the stronger hand #TeamRafa #TGHP @Tomeu_Nadal Ok, estoy preparado para cualquier jugada que me hagas, enseña tus cartas #TeamRafa #TGHP Thanks a lot to Txema and thank all of you for attending this event for a good cause! http://t.co/zZVSFNjbaT Muchas gracias a Txema y a todos por asistir a este evento por una buena causa! http://t.co/QLjU0uYd0P @gfcgolf Gracias Gonzalo por apoyar una buena causa! Thanks Gonzalo for supporting  good cause! RT @gfcgolf: 2012 Conmemorative Ryder Cup bag signed by both captains Oli &amp; Love III. Do you like it? It can be yours! Stay tuned http://t.… Esta mañana hemos presentado #Olazábal&amp;NadalInvitational en #PulaGolf , que tendrá lugar este fin de semana en... http://t.co/CbwLDx11Sj Thanks for your participation! The answer about fishing picture is @tomeu_nadal !Yesterday I tried a bluff for #TGHP https://t.co/xsydpFF8Cp Gracias por vuestra participación! La respuesta sobre la foto pescando es @tomeu_nadal ! Ayer me tiré un farol #TGHP https://t.co/xsydpFF8Cp Thanks a lot to all readers of #Marca for this award, It is an honor! http://t.co/zV78V6geE1 Muchas gracias a todos los lectores de #Marca por este premio, es todo un honor! http://t.co/dfbh0qxhOL Second challenge for #TGHP against @tomeu_nadal . Look at this picture and discover who's that #TeamRafa\nhttps://t.co/WAvjeuLYQQ 2º Reto para #TGHP contra @tomeu_nadal . Mirad esta foto y a ver si sois capaces de adivinar quién es #TeamRafa https://t.co/WAvjeuLYQQ I've just been in one of the most spectacular places that I've never seen before the #PertoMoreno ! Really amazing! http://t.co/IWNkckFioQ Acabo de estar en uno de los lugares más espectaculares que he visto, el #PeritoMoreno !Realmente hay que visitarlo! http://t.co/WRwNoQQ2uA Hoy tuve la oportunidad de visitar #Unquillo, la ciudad natal de mi amigo @nalbandiandavid http://t.co/XslACofk99 RT @almudenacid: Os juro que yo pensé que el peloteo era otra cosa!! http://t.co/bzA1doEQFs\n#TGHP Ya en Chile , acompañado de David  y Nole para homenajear a un grande, Nicolás Massu! Grande Nico!\n\nWe are... http://t.co/hWV5vtlfZc All my support to #RichardMilleInvitational where my colleagues @bubbawatson and @DianaLunaOdB  participate #RichardMilleFamily Todo mi apoyo a #RichardMilleInvitational donde mis colegas @bubbawatson y @DianaLunaOdB están participando #RichardMilleFamily Completar una jugada de poker derribando las cartas con un saque. Mi primer reto para The Good Hand Project #TGHP... http://t.co/Q4cw3fAJDS 1 poker move, knocking down the cards with a serve. My first challenge #TGHP Beat it, @Tomeu_Nadal! #TeamRafa http://t.co/u0UqkkLsUx Una jugada de poker, derribando las cartas con un saque. Mi 1er reto para #TGHP ¡Supéralo, @tomeu_nadal ! #TeamRafa http://t.co/u0UqkkLsUx Que ilusión volver a ver a nuestro amigo #LuisHorna !\nExcited to see again our friend #LuisHorna ! http://t.co/IIaVcjUbi0 Gracias a mis amigos de Perú por el cariño recibido!\nThanks a lot to my friends from Peru for all your kindness!\nhttp://t.co/7WiB5kZYw9 Yesterday at @NeckerCup I was lucky to play a doubles with a big champion #StefanEdberg ! http://t.co/sXPa2rAWnN Ayer, en @NeckerCup tuve la suerte de jugar un dobles con un gran campeón #StefanEdberg ! http://t.co/NinD8s82wS Hola amigos, espero que os guste la entrevista que nos hicieron a mi hermano y a mi.  ¡Gracias a The Good Hand... http://t.co/EsyUb7KIFp Tomeu and me are different but we have something in common a Good Cause: #TheGoodHandProject http://t.co/AGpwYp9cjC Tomeu y yo somos diferentes pero algo nos une, una buena causa: #TheGood HandProject http://t.co/AGpwYp9cjC It got to be something huge, so my brother @tomeu_nadal can be in front of the camera. http://t.co/QJ9oz92Mj7 Para que mi hermano @tomeu_nadal decida ponerse delante de una cámara, tiene que ser algo muy grande.http://t.co/QJ9oz92Mj7 And he is my brother @tomeu_nadal ... ¡At our first interview together! http://t.co/7w5extOVc6 Y este es mi hermano @tomeu_nadal ... ¡En nuestra primera entrevista juntos! http://t.co/js1RmP4iSY Mucho ánimo a todos los participantes del programa \"Mas que Tenis\" de la Fundación Rafa Nadal @frnadal\n\nGood luck... http://t.co/b0ubytEQe7 Mucho ánimo a todos los participantes del programa \"Mas que Tenis\" de la Fundación Rafa Nadal.\n\nGood luck all... http://t.co/wm56habzPm Congrats to my partner of @Richard_Mille family, @Felipe1Massa. I'm sure that you will do a great season in @WilliamsF1Team ! Muchas Felicidades a mi compañero de la familia @Richard_Mille , @Felipe1Massa . ¡Seguro que harás una gran temporada en @WilliamsF1Team ! Very excited to finally met my #fannumero1 Paloma López Del Cerro in London, thanks to my friends from MAPFRE. http://t.co/4RYAJBppwX Muy emocionado por conocer, gracias a mis amigos de MAPFRE, a mi #fannumero1 Paloma López Del Cerro, en Londres. http://t.co/CBToYRJ8Za Muchas gracias a todos por el apoyo. Gracias a mi equipo y familia! #contento\nThanks a lot for your support.... http://t.co/7HLNXMjrJx Noche de fútbol en #StamfordBridge!\nFootball night at #StamfordbBridge! http://t.co/RCpZj3Wdg0 Mucha suerte en #Singapur @miss_belmont y @Melani Costa!\nAll the best in #Singapore @miss_belmont and @Melani_Costa ! Esta mañana hemos volado de París a Londres y ya en el Millenium Dome. Feliz de estar aquí después de no haber... http://t.co/yCQojtKUyQ One week remains to take place @NeckerCup. We @frnadal are looking forward to participate, I'm sure it will be a great charity event! Solo queda una semana para que se celebre @Neckercup. @frnadal estamos deseando participar, será un gran evento benéfico. Ya os contaré!! Congrats @paugasol by the premiere of your web http://t.co/FWKAi6ADxy ! #PauHome Felicidades @PauGasol por el estreno de tu web http://t.co/FWKAi6ADxy ! #PauHome Demuestra tu apoyo a Champions Drink Responsibly y sigue hoy a @bacardichampions en Instagram!\n\nPlease show... http://t.co/epzbWGjcNu Después del entrenamiento matinal... paseando por las calles de París!\nAfter morning practicing ... walking down... http://t.co/o8qVqa8MJA Pasando una gran velada con mi amigo Richard! :D #RichardMile\n\nEnjoying a great evening with my friend Richard!... http://t.co/OxqrW69ouT Buen entrenamiento esta tarde con Fernando!\nGreat practice with Fernando this afternoon! http://t.co/Rtd1WxAy5p Entrenando en Paris-Bercy de buena mañana!\nPracticing at Paris-Bercy very early in the morning! http://t.co/o28poCJkXb Thank you very much to all for your messages, it has been very emotional and exciting to recall all your messages... http://t.co/2VdjyGWDdY Muchas gracias a todos por vuestros mensajes, ha sido muy emocionante y me ha hecho mucha ilusión rememorar otra... http://t.co/m85EhAkaBM I'm excited to play in the Necker Cup this November 12-16th (http://t.co/IdSKuN0opT) and have the possibility to raise money for @frnadal ! Qué ilusión participar en el torneo #NeckerCup este mes de noviembre (http://t.co/IdSKuN0opT) y tener poder recaudar fondos para @frnadal !! Vuelta a los entrenamientos... Con la agradable visita de José Luis Oltra! :) Back to training... With the... http://t.co/ueI0qPoxvh Esta era la sopresa! Los 12 elegidos recibirán esta camiseta firmada. Por favor escribidme mensaje privado con... http://t.co/Zh9rnJdNuW ¿Conoces el blog de @frnadal? Únete a su lectura. Do you know @frnadal 's blog? Join to its reading http://t.co/j989RuvtFW Hola a todos, deciros que siento mucho anunciar que no viajare a Suiza, al torneo de Basilea, ya que después de... http://t.co/LzXExKUiDA Very sad, since find out that @mariavillota has left us. All my support for family and friends. Muy triste, tras saber que @mariavillota nos ha dejado. Todo mi apoyo para sus seres queridos. En el calentamiento antes del partido. Este estadio es francamente espectacular!\nWarming up before the match.... http://t.co/5A7tiG2wtp I bring all my support to @YohanBlake Charity Auction @Richard_Mille the funds raised will be divided with the #JapaneseFoundation Quiero darle todo mi soporte a la subasta de @YohanBlake @Richard_Mille los fondos recaudados se repartirán con la #JapaneseFoundation ¡Muchas gracias por vuestro incondicional apoyo #NikeTennis!\nThank you for your unconditional support #NikeTennis! http://t.co/AwQrdRA1p6 RT @NikeTennis: If it's worth earning, it's worth reclaiming. #justdoit @RafaelNadal http://t.co/huyyYlyIjF Check out the new app from Champions Drink Responsibly.\nhttp://t.co/50n28Ywz31 http://t.co/XTQHVirXPD That's: http://t.co/lu5zXBXsms. A sports-humanitarian project of my friend #JoseManuelLopez, 30 # Ironman in 30 days. Good luck! Os presento http://t.co/lu5zXBXsms. Un proyecto deportivo-humanitario de mi amigo #JoséManuelLópez, 30 #Ironman en 30 días. Mucha suerte! A lot of fun in the #RallyedeFrance @SebastienLoebRacing @Richard_Mille ,  his last WRC appearance. Good luck for your home rallye! Mucha diversión @SebastienLoebRacing de la Familia @Richard_Mille , en el #RallyedeFrance con su última aparición en el WRC. ¡Buena suerte! Enjoying the day off! Visiting the Summer Palace in #Beijing http://t.co/uvKZ75suzN Disfrutando del día libre! De visita en el Palacio de Verano de #Beijing http://t.co/EvsxHivqFC Pasando un buen rato :)\nHaving a good time :) http://t.co/hQDM6g4Yva Así fue el gran recibimiento del público Chino!\nThat was the great reception of Chinese public! http://t.co/a6iRHUqr7F Con @FerVerdasco ! Después de entrenar con él en #Beijing .With @FerVerdasco ! After practice with him at #Beijing http://t.co/Rbg1r1Egkw Ya tengo a los 12 ganadores! En pocos días veréis que sorpresa tengo preparada para vosotros ;) #vamos http://t.co/DKGi578QM5 Mucho ánimo  #DianaLuna! Compañera de la familia #Richard Mille,  que participa en el #LadiesFrenchOpen que se... http://t.co/gLrUyuPryf Let's go @Diana Luna! Family Mate @Richard Mille, at #LadiesFrenchOpen  #SaintJeandeLuz Mucho ánimo @Diana Luna! Compañera de la familia @Richard Mille, en el #LadiesFrenchOpen de #SaintJeandeLuz. Boarding with @RICARDODEDIEGO and my team to #Seul to see my #KIA friends. http://t.co/JeGTkNGHaP Embarcando con @RICARDODEDIEGO y mi equipo hacia #Seul para ver a mis amigos de #KIA. http://t.co/djKN5O7CVH As I promised to my UAE’s friends, this December… ¡I will return to @MubadalaTennis! See you in #AbuDhabi ! http://t.co/dV2TcZ0zvQ Tal y como prometí a mis amigos de UAE,¡en diciembre volveré a participar en @MubadalaTennis!Nos vemos en #AbuDhabi ! http://t.co/NmK1h4dbxn Cenando con mis primitos en un día muy especial.\nHaving dinner with my little cousins in a very special day. http://t.co/psf8jVgf06 With my friends from @Kia_Motors mallorca at their golf tournament http://t.co/Cqfihqtvod Con mis amigos de @Kia_Motors  de mallorca en su torneo de golf.\n. http://t.co/P5f16mR7e4 Muchas felicidades @feliciano_lopez! Espero que pases un fantástico día! Happy B-day @feliciano_lopez! I wish you a very nice day! Vuelta a los entrenamientos con mi tío en #Manacor! Training again with my uncle in #Manacor! http://t.co/hAszgDOKZG Hoy he visitado a mis amiguitos de la escuelita de tenis del Jordi d'es Raco en #Manacor.\nToday I visited my... http://t.co/cZ9CgfRuH4 All my support to #Acapulco . Many habitants and turists still trapped in the area. #acapulcoayuda Todo mi apoyo para #Acapulco. Muchos habitantes y turistas siguen atrapados en la zona. #acapulcoayuda My deepest condolences to the families and friends of the Navy Yard Washington's victims #NavyYardShooting Mi más sentido pésame para las familias y amigos de los fallecidos en la base naval de Washington #NavyYardShooting. Follow @SportsFenix and being more involved in the drawing for tickets to see me against @nalbandiandavid on November 23 at @LaRural_BsAs ! Seguid a @SportsFenix y participa en el sorteo de entradas para verme jugar con @nalbandiandavid el 23 de Noviembre en @LaRural_BsAs ! Os espero en Buenos Aires el 23 de noviembre!\nI'm waiting for you in Buenos Aires at November 23! http://t.co/aMjL1JXVDg @vronval @LINE_Espanol Gracias por tu apoyo Verónica! @RVPMAGIC Thanks very much! Two amazing riders in the team #Ferrari Ferrari for 2014! @alo_oficial and  @K_RaikoneneF1 , challenging. Dos increíbles pilotos en la escudería #Ferrari para 2014! @alo_oficial y @K_RaikoneneF1, todo un reto. Preparado para la Davis ;) Entrad aquí  http://t.co/NAQgN9uuP8 descubrid cómo podéis ayudar a mi fundación @frnadal http://t.co/8vF9dUdNG1 Con el equipo de #CopaDavis Eperamos todo vuestro apoyo.\nWith the #CopaDavis Team We wait for all your support. http://t.co/JLIN6Wjhsx Muchas gracias a todos desde Central Park! :)\nThank you from Central Park! :) http://t.co/UJQ0gOPkhL Thanks for your support @LINE_Espanol , TW y FB! I want to give you Stickers at LINE&gt;Mas&gt;Tienda de stickers&gt;Gratis http://t.co/wdFOT2ahgK Gracias por el apoyo en @LINE_Espanol , TW y FB! Quiero regalaros mis Stickers en LINE&gt;Más&gt;Tienda de stickers&gt;Gratis http://t.co/IMVl0YAimm Buenas noches desde la Ciudad que nunca duerme! ;D\nGood Night from the City that Never Sleeps! ;D http://t.co/TC0olX3rM3 Hoy he entrenado con el chileno Christian Garin ,semifinalista  del us Open Junior. Today I trained with the... http://t.co/tEwADqZ6eY Unos momentos de relax... Antes de la final de mañana. Relax time... Before tomorrow's final. http://t.co/cEcGZs2AvJ Contento por volver a jugar la final de US Open y triste por la elección del COI de sede olímpica. #USOpen\nHappy... http://t.co/gE2VYWvb4T Contento por volver a jugar la final de US Open y triste por la elección del COI de sede olímpica. #USOpen http://t.co/2Jf94pSq7l Happy to return to play the final of U.S. Open and saddened by the COI election. #USOpen http://t.co/cdD9SHgQzM Gracias por todo vuestro apoyo. No hay nada como jugar de noche en la ciudad de NY #Niketennis. Thanks for all... http://t.co/oBIyxKuINl A 24 horas de la decisión, todo mi apoyo desde NY a #Madrid2020 \nVamos!!!!! http://t.co/I0ZkOQwFeD Only 24h to know the result, all my support to #Madrid2020 from NY. Vamos!!!!! http://t.co/zGQB3VJ7Kb Después del partido de ayer... Rueda de prensa! After last match... we had press conference! http://t.co/BquuD78Fgk Ayer cenando con el equipo! Tuts ha vuelto! Last night, dinner with the team! Tuts is back! http://t.co/mvzc9CiGSN Ayer cenando con el equipo! Tuts ha vuelto! Last night, dinner with the team! Tuts is back! http://t.co/RwjDKVzlSt Entrenando con #MarcLopez! Practicing with #MarcLopez! http://t.co/9nSmkp8NOS I'm new at LINE! I'll share messages and exclusive photos on this network, follow the link! http://t.co/kGuVhiG99C http://t.co/rGAFuDAEk2 Estreno cuenta en LINE! Compartiré mensajes y fotografías exclusivas , sigue el enlace :) http://t.co/IO9xtqJtCP http://t.co/b3QKnX91sH RT @InterManacor: Campaña socios 2013-14, agradecer a @RafaelNadal su apoyo. Él ya es socio, tú también puedes serlo por sólo 20€ !!! http:… Hoy se juega el último amistoso del #EuroBasket! España mucho ánimo frente Gran Bretaña! Today it's the last friendly match of #EuroBasket ! Get lucky Spain against U.K! Ayer anunció su retirada un compañero y amigo. Siempre fueron buenos momentos y así seguirá siendo. Suerte en tu nueva vida @massunico Yesterday a very good partner and friend announced his retirement. Always had great time together and it will be just like now @massunico\" RT @InterManacor: Campanya de socis, 2013-2014...necessitam l'aportació de tots per seguir creixent com a Club! #intersomtots http://t.co/3… RT @paugasol: The bid of @Madrid2020ES is ready to host the next @Olympics and needs our support. It will be an honor to be defending it in… Today #tracymcgrady announced his retirement. Great player and deserved rest. Hoy se ha anunciado la retirada de #tracymcgrady que ha decidido poner fin a su carrera. Gran jugador y merecido descanso. Muchas felicidades @charlymoya! Espero que disfrutes del día! Happy bday @charlymoya! I hope you enjoy your day! Hoy he sabido del fallecimiento de nuestro amigo BobGaffney. Descansa en paz. Today I knew    about the dead of... http://t.co/MtheruRlsT Este viernes la ATP celebró los 40 años del ranking y reunió a la mayoría de los numero 1, fue una noche especial.... http://t.co/xsqA9LPXHN Tonight we've dinner very good at #Manzanilla, the new adventure of #DaniGarcia  in #NYC! http://t.co/islFDkZLga Hoy hemos cenado muy bien en el restaurante #Manzanilla, la nueva aventura de #DaniGarcía en #NYC! http://t.co/9YkUJUXFM7 Felicidades @alo_oficial! Por tu podio ayer en Belgica! Congratulations @alo_oficial! For your podium yesterday in Belgium! @NJBayKer75 Thanks a lot Brittany @NT3984 @RafaNadalFANS @usopen Thanks for All your support! RT @niketennis: Give me No Excuses in NYC. @RafaelNadal http://t.co/ucWVsgD6TF De vuelta a mi habitación @StRegisNewYork. Mi hotel favorito en #NYC. A descansar un poco antes de my primera ronda. http://t.co/VPRcfqVbBE Back to my room @StRegisNewYork  my fav hotel in #NYC. Some rest before my 1st round. http://t.co/lNDCP3HJqY Estos días con los niños son siempre especiales. Él no es un niño pero también es especial compartir momentos juntos http://t.co/2BP3RiTBqZ These days with children are always special. Well he isn't a kid but is also special to share great moments with him http://t.co/obErNQpvDm Entrenando con mi amigo Feli! #UsOpen2013 \nPracticing with my friend Feli! #UsOpen2013 http://t.co/T2eY5ssxEf Disfrutando de un paseo por NYC! #UsOpen\nEnjoing a walk in NYC! #UsOpen http://t.co/9rzMHg8FaY @flynow8 Muchísimas gracias por tu apoyo! @OlguitaBarona Espero que disfrutes del #UsOpen, gracias! Vamos España!A darlo todo en el partido de hoy ante Francia! #EuroBasket\n Come on Spain!Give it all tonight against France!#EuroBasket Bienvenida @anaivanovic a esta red social. Estoy esperando poder intercambiar tweets contigo! @anaivanovic welcome to this mean of communication. Looking forward to exchanging tweets with you. Me hace muy feliz el homenaje a #Raúl... Sin duda uno de los mejores deportistas españoles de la historia! The tribute to #Raúl makes me very happy... With no doubt one of the best spanish sportman! @pattylu0508 Muchas gracias por tu apoyo! @linavasquez92 Gracias por tus ánimos! Espero que sí vaya bien. Una lástima que @MariaSharapova no pueda estar presente en el #UsOpen. Te deseo una pronta recuperación Maria! It's a shame that @MariaSharapova will not be present at #UsOpen. I wish you a soon reacovery Maria! Entrenando en #FlushingMeadows! :)\nPractising in #FlushingMeadows! :) http://t.co/u7hAOkC7N6 De vuelta en #FlushingMeadows, en unos días empieza el US OPEN 2013! http://t.co/iNfdSzlDsY Back to #FlushingMeadows, in a few days starts US OPEN 2013! http://t.co/FYAnip7ycH Ya estoy en NYC! #UsOpen\nI've come to NYC! #UsOpen http://t.co/N7fWLP8opJ Nike Tech Pack llega el 29.08.13: http://t.co/7oCUG2SEeJ #techpack @nikesportswear Nike Tech Pack is coming 8.29.13: http://t.co/7oCUG2SEeJ #techpack @nikesportswear Muy feliz por esta victoria de hoy. Ahora a preparar el US Open. Muchas Gracias a todos!\n\nVery happy for the... http://t.co/3XDL0s3t29 Muy contento después del partido de hoy!\n\nVery happy after today's match! http://t.co/Navehqf2Bf Con Marci y Bulet, semifinalistas... A ver si puedo acompañarles... ;)\n\nWith the semifinalists Marci and Bulet ,I... http://t.co/EOhyjnraAQ Publiqué una nueva foto en Facebook http://t.co/cfFafIRiqs Primer día de entrenamiento en #Cincinnati... Algo tormentoso!\nFirst day practice in #Cincinnati... Somewhat stormy! http://t.co/o8xeyc1jd8 Despedida en Montréal de nuestro amigo y conductor Jacky!! \nGoodbye in Montreal to our friend and driver Jacky! http://t.co/dINBz3sA4y Gran semana! Gracias a todos por vuestro soporte! Vamos!\nGreat week! Thank you all for your support! Vamos!!!! http://t.co/hNN1XtsQWG Autógrafos después del entrenamiento! Estamos listos!\nAutographs after the practice! We are ready! http://t.co/oAcG460D1J Desayunando en el Hotel. Muy contento de poder jugar la final de hoy contra Milos.\n\nHaving breakfast at the... http://t.co/cvKwelciHt Necesitamos vuestro apoyo, porque queremos los Juegos en #Madrid #Madrid2020. Siguenos y haz RT @Madrid2020ES We need your support: please follow @Madrid2020es and RT. We want the Games in #Madrid  #Madrid2020 Tan importante para Mateo y tan fácil para ti, sólo tienes que hacer click en:http://t.co/xO03ZoNHj6 #medulaparamateo http://t.co/OSRFGztTKZ So important to Mateo and so easy for you. You only have to click here:http://t.co/xO03ZoNHj6 #medulaparamateo http://t.co/ddtIsevygp A pesar de la lluvia, dos horas de entrenamiento que me han venido muy bien! http://t.co/kIzrjPF4rO In spite of the rain, these 2 hours practice have been helpful! http://t.co/tO5XvOoKzh Primer entrenamiento en #Montréal con mi amigo Richy!! ;) \nFirst practice in #Montreal with my friend Richy!! ;) http://t.co/cv6Se2iNVA Feliz de anunciar que participaré en la Arthur Ashe Kids' Day en el @USOpen 24 de agosto, jugando para @FRNadal.¡Sigue @AAKidsDay para más! Happy to announce I'll be back for Arthur Ashe Kids' Day this year at the @USOpen playing for @FRNadal. Follow @AAKidsDay for more! Recogiendo las maletas en el Aeropuerto de Montreal\nPicking up the suitcases at the Airport in Montreal http://t.co/zqHmIuIpCZ Gracias a mis amigos del #InterManacor. Y mucha suerte para esta temporada. http://t.co/ScoemapaPa Thanks to my friends from Inter Manacor. And good luck for this season! http://t.co/sCHzJumsdx Entrenando en #Mallorca con mucho calor. Practising in #Mallorca. It's very hot! http://t.co/CHfSRP8CH8 Estoy muy conmocionado por lo sucedido en Santiago. Todo mi apoyo y cariño a los afectados. I'm very affected because of the train accident in Santiago. All my support to the victims. Hoy buen entrenamiento... Con muy buena compañía!! \nToday great practice... With very good friends!! http://t.co/mRorVdup3D Hoy nos ha visitado el gran #‎GuillermoVilas!  Today we have been visited by the Big One #GuillermoVilas! http://t.co/xiPa2QBJVJ Sesión de preparación física esta mañana. Por la tarde tenis. Training session this morning. In the evening tennis. http://t.co/3bTgbBABIL Pasándolo muy bien en la #ChampionsParty. Recordad: siempre con moderación. http://t.co/YLH6akmQAO Enjoying very much at the #ChampionsParty. Remember: always drink responsibly! http://t.co/ZWNq7LjhuD Todo mi apoyo a mi amigo @YohanBlake después de su lesión . Espero que te recuperes muy  pronto. All my support to my friend @YohanBlake after his injury. I hope you recover well very soon. Buenos días a todos! Ya estamos en el gimnasio! \nGood morning everyone! Here we are at the gym! http://t.co/5BfHP2x55O Buenos días a todos! Ya estamos en el gimnasio! :)\nGood morning everybody! Here we are at the gym! :) http://t.co/mblij6ZOK9 Buenos días a todos! Ya estamos en el gimnasio! :)\nGood morning everybody! Here we are at the gym! :) http://t.co/ZSUIK69Bx5 Despues del etrenamiento, tarde con la familia.\nAfter practicing, I have spent the evening with the family. http://t.co/bcFXdBZnxa Mallorca will be rocking this weekend with me at the CDR Bacardi Limited Party #TheChampionsParty #vamos http://t.co/InnjsjwfjX Entrenando con Zimonjic en Manacor.\nPracticing with Zimonjic in Manacor. http://t.co/TlP9l7XNGx A punto de empezar a cenar! Buen provecho!\nAbout to start the dinner! Have a good meal! http://t.co/5uwZvOgB31 Cocinando un poco!\nCooking time! http://t.co/HzKsaTUj2A Todo a punto para empezar a entrenar.\nAll ready to start practising. http://t.co/P5dHKLd9mt Entrenando un rato con mi amigo Tomeu Salvà! ;)\nPractising with my friend Tomeu Salvà! ;) http://t.co/OBFHvXsd8W Muy grande Josh! Un placer encontrarme con él. Este si es un gran imitador :)\nBig Josh! A pleasure to meet with... http://t.co/vkHfRROkpL Preparado para entrenar! :)\nReady to the practice! :) http://t.co/FYfXfaDJv2 Looks like Alfonso has the better hand; but let's see who shows more skills playing his cards.\n \nParece que... http://t.co/rINgD7ImhT RT @JoanSuasi: @RafaelNadal @el_rage I think someone is bluffing and it's not me...hehehe Why such a face @el_rage? Something to hide@joansuasi? http://t.co/nNsATJa8YB Who do you think has the best hand?\n\nQuién creeis que tiene la major mano? http://t.co/DF9XYHC4kE Pasando un buen rato con mis primitos.\nHaving a good time with my little cousins. http://t.co/KQx0LQmYN9 Maravilloso!! Wonderful!! http://t.co/CxcwvBf43d Comiendo con mis amigos con un paisaje espectacular.\nHaving lunch with my friends. The landscape is amazing. http://t.co/5EOO5QvIDV Creeis que podre acabar de entrenar? \nDo yo think I can finish my practice? http://t.co/O54GS55vtR He publicado 4 fotos en Facebook en el álbum \"My new KIA Pro-CEE’D\". http://t.co/TMLr8O5E0z Quién quiere probar? Who wants to taste? http://t.co/wrSzLZIQAE Con Marc en Wimbledon! Clásico paseo por pistas. With Marc in Wimbledon! Classic walk between courts. http://t.co/B9fQgLRba9 Adaptándome a la nueva superficie con los consejos de Toni.\nAdapting to the grass with the tips from Toni. http://t.co/HUoIsztGYW Muchas Felicidades a la #sub21 y a su entrenador Julen  por proclamarse campeones de Europa! I got a very warm message from the #U21 when I won RG. Im very happy to the success you guys are having and best of lucks tonight! Cuando gané RG recibí un mensaje muy cariñoso de los chicos de la #Sub21. Me alegro mucho por éxitos que estáis teniendo. Suerte esta noche! Primer entrenamiento en Wimblendon. First practice in Wimbledon. http://t.co/41EOZgFxLg You'll like this: my friends from @mystarautograph give away my signed picture http://t.co/QtZYdPplIE RT if you want an additional reward :) Esto os va a gustar: @mystarautograph os regala mí imagen firmada en http://t.co/QtZYdPplIE Si haces RT puedes tener mejor premio aún :) Best of luck @Swim4G in your swim across Gibraltar to raise money for @Worldreaders. Vamos!! http://t.co/O1ly0zhhOu http://t.co/JHPqpvLWvE Mucha suerte a @Swim4G en su cruce de Gibraltar para recaudar fondos para @Worldreaders! http://t.co/O1ly0zhhOu http://t.co/TtqkTOfp0l Tenía información equivocada y por ahora #NelsonMandela no nos ha dejado. Ojalá este con nosotros mucho tiempo, lo que hizo estará siempre. Gran día el de ayer! Muy contento con el título. Gracias a Pau y Usain! Great day yesterday! Very happy with the... http://t.co/GlyVxWhZKi Vamosssss http://t.co/6zjSe7P74q Gracias por vuestro apoyo @TeamMatesBCN RT Enhorabuena Rafa, te has superado a ti mismo! http://t.co/nDHsjpPY3j RT @niketennis: 8. Enough said. @RafaelNadal #noexcuses http://t.co/rba90FH5JL #UN8ELIEVABLE http://t.co/dHcx8OTEGH Visita de nuestro amigo Pau antes de la final. Es un crack.\nOur friend Pau has visited us before the Final. He is... http://t.co/6wnkAm1Xuh No será posible ir a Halle este año, después de estos meses y todos los partidos que he jugado mis médicos me han... http://t.co/Xoq35a43yD Buen partido hoy. Ahora a prepararse para el domingo. Good match today. Now to prepare the sunday match. http://t.co/bYcberWpky Entrenando en Roland Garros, con la pista Philippe Chatrier de fondo!\n\nPracticing in Roland Garros, you can to... http://t.co/r5JnnMzCTB Celebrando mi cumpleaños con amigos en Paris. Muchas gracias por vuestros mensajes.\n\nCelebrating my birthday with... http://t.co/W4fsMZbr1e Con parte del equipo de Roland Garros. Muchas gracias a ellos y a todos los fans!\n\nWith a part of the Roland... http://t.co/LrziSd3vpo Ayúdanos a prevenir la muerte súbita en niños deportistas. Dona 2 euros a las Becas” Dani Jarque” @animafundacion http://t.co/5qPKJCaMGE Entrenando en Bois de Boulogne. Practicing in Bois in Boulogne http://t.co/qDlmrYv1Xy Hacia el hotel a descansar, que mañana vuelvo a jugar!\n\nGo to rest in the hotel. Tomorrow a new match! http://t.co/DPVh9pjV9t Cenando con el equipo en Paris. Desgraciadamente  hoy no pude jugar por la lluvia.\nHaving dinner with my team in... http://t.co/g8XHni9F5I All my support to the great @MarcGasol! You made a excellent season and you have a great future in the #NBA Todo mi apoyo al gran @MarcGasol! Has hecho una temporada buenísima y tienes gran futuro en la #NBA De paseo por París en mi tarde libre. Me encanta esta ciudad.\nHaving a walk in Paris in my free evening. I... http://t.co/H4P58hRPBI Thanks to all for your participation! I’ll send a message to the components of the #KingofClayClub to receive the jacket. Gracias a todos por participar! Me pondré en contacto con los miembros del #KingofClayClub para que reciban su chaqueta. @Dioniscv @SaneHost @mkdmnsr @RealKingofClay @vane_garciae @MariaNadalista @rafafan86 are the #KinfofClayClub your claim will be #Noexcuses! @Dioniscv @SaneHost @mkdmnsr @RealKingofClay @vane_garciae @MariaNadalista @rafafan86 sois el #KinfofClayClub vuestro grito será #Noexcuses! El #KingofClayClub ya está cerrado! Estad atentos. The #KingofClayClub is closed! Pay Attention Recordad ganarán los 7 que más utilicen #KingofClayClub!Remember.Use #KingOfClayClub The7people using both more times will win the jacket! Proud of my followers. You are very actives with #KingofClayClub You can participate until 24:00 (Paris time) Orgulloso de mis followers. Lo estáis dando todo con #KingofClayClub Tenéis hasta las 24.00 (hora París) Want to get in this club?Use #KingOfClayClub The 7 people using both more times will win a unique jacket, not sale :) http://t.co/mtpeGXefHt Quieres entrar en este club?Utiliza #KingOfClayClub Los 7 que más lo utilicen chaqueta única asegurada,no en venta :) http://t.co/Bt6KXIuSjk I want to create a #KingOfClayClub of 7 persons. Pay attention to the next tweets :) @NikeTennis Quiero crear un #KingOfClayClub de 7 personas. Estad atentos a los próximos tweets :) @NikeTennis Gran ambiente en la pista central. Kids day!\nGreat atmosphere in the centre court. Kids day! http://t.co/0KlgUNNTL6 A pleasure to compete with 200 of my french fans at a very special mobile poker tournament. May the best player win! http://t.co/ohBy6ik2E4 Un placer competir  contra 200 de mis amigos franceses en un torneo de poker en el móvil. Que gane el mejor! http://t.co/kxigdDKLub Keep an eye on my feed for a very special game I'm about to play with my French fans http://t.co/UWRd78VxNe Manteneos atentos! Veréis un juego muy especial al que jugaré con mis amigos franceses ! http://t.co/aUXa23SSvC Ayer jugamos en un evento de Nike. A oscuras!!!!!! Espectacular\nYesterday we played at the Nike event.Dark!!... http://t.co/mjrmSlpDWJ Menudo tiempo que me he encontrado en París!\nWeather in Paris today! http://t.co/5YgxogrmwA #MiguelAngelJiménez ya va por su torneo 600! En #Golf es muy complicado entrar en este club tan exclusivo Thanks for your words @adelya_1818! I’m working to you’ll enjoy my matches in Paris :) Thanks for your support! Gracias @_anapastor_! Un placer recibir estas palabras de una profesional como tú! All my Support to @MarcGasol for today’s match! Make history in the conferencefinal #VamosssGrizzlies Todo mi apoyo a @MarcGasol en su partido de hoy! Haciendo historia en la final de conferencia #VamosssGrizzlies Tarde con los amigos en casa! Muy concentrado en los partidos de futbol.\nEvening with friends home. Very focused... http://t.co/afuvFy5JLZ Ya en Mallorca! Muy feliz por ganar en Roma!\nAlready in Mallorca! Very happy for my win in Rome! http://t.co/0UE5HOtrxe Muchas gracias a todos los fans por vuestro apoyo todos los dias.\nThank you very much to all the fans for your... http://t.co/ak1QpuwYxe All my Support to the great @PauGasol!! Step by step to overcome the operation to come back early. Todo mi apoyo al gran @PauGasol! Paso a paso a superar la operación para volver en las mejores condiciones. Primer entreno en Roma. Comenzando a notar el ambiente.\nNow in Roma. I had my first practice. I’m feeling the... http://t.co/LPlOIFyONC Gracias por tus consejos @josemcalderon8. Espero que los míos te sirvan para el #europeo ;) @kiamotorsiberia Felicidades al #Barça por su nueva liga. Espero que tuviesen una buena celebración ayer. Nos vamos de Madrid... A Roma!\nFrom Madrid to Roma! http://t.co/KV9U3sJdO8 Estoy muy feliz por mi victoria en madrid. Gracias a todos por vuestro cariño y apoyo.\n\nI am very happy for my... http://t.co/7AdRq66emY He encontrado esta tarta en una de las salas del torneo. Qué os parece? I found this cake in a tournament room.... http://t.co/NaLU8oBChd Con el tigre Falcao despues del duro partido con David. Gracias a todos por vuestro apoyo!\n\nAfter a hard match... http://t.co/nQjQmXLRBQ A tragedy what happened in the #americacup. All my support to the family of the great #AndrewSimpson. Una tragedia lo sucedido en la #CopaAmerica de vela. Todo mi apoyo a la familia del gran #AndrewSimpson. Amigo @Paugasol espero que todo vaya bien en la intervención y la temporada que viene estes al 100% #GoPau! Cenando con amigos en Madrid despues del buen partido de hoy.\nHaving dinner with friends in Madrid after a good... http://t.co/EXyr29fb3L A great career fighting for the team! Admirable #SirFerguson. Good luck in your new way. Una carrera entera luchando por un equipo! Admirable #SirFerguson. Suerte en tu nuevo camino. Buena partida de tenis de mesa para desconectar un poco. Great table tennis match to disconnect. http://t.co/D8cmv88kbs Gracias @josemcalderon8! Te deseo mucha suerte en tus nuevos proyectos! Tampoco eras muy bueno con la raqueta ;) @kiamotorsiberia Cenando en Madrid con  amigos\nHaving dinner in Madrid with friends http://t.co/h11H1FNHGc Thanks @southpaw2009! I hope to make a great tournament Fue un placer pasar el día con vosotros! @josemcalderon8 @kiamotorsiberia @danidiez11 @jamunar_38 Me gusta la gente escueta @manuelcores1981 ;) Gracias por tu apoyo! Very interesting #golf season this year! Phil Mickelson's return to #top10 is a great new. Muy interesante la temporada de #golf de este año! La vuelta de Phil Mickelson al #top10 es una gran noticia. Hablando con Toni sobre el entrenamiento. Talking with Toni about the practice. http://t.co/JbzZ0w49oz De camino a cenar. Aun sigo vivo en el torneo de poker.\nOn my way to have dinner. Still alive in the poker... http://t.co/bxw6Hp99dV Relajándome en el hotel después del entrenamiento y preparándome para el torneo de poker de hoy.\nRelaxed at the... http://t.co/9MX0vAiO8X Entrenando en Madrid! Gran ambiente.Practicing in Madrid! Great atmosphere! http://t.co/KKKfGwR50c Hoy es un día muy triste para el deporte y para el tenis en particular. Nos ha dejado nuestro presidente Brad.... http://t.co/cqEzi9wPt0 Acabo de aterrizar en Madrid. Con muchas ganas de jugar en casa.\n\nI have just landed in Madrid. Very happy to... http://t.co/IUGFzh7otC Quería compartir con vosotros el vídeo que me han enviado. Un buen trabajo #imparablesjuntos http://t.co/E6q4GXzL1H Todo mi apoyo a mi amigo @PauGasol! Temporada difícil, espero que en los #Lakers tengan claro lo importante que eres para el equipo Contento por la victoria en Barcelona! Ahora a pensar ya en el Master de Madrid y a entrenar día a día.\n\nI’m... http://t.co/upU9k8W47Q Había un gran ambiente en la pista! Gracias por el apoyo durante toda la semana. Muy buen público siempre en... http://t.co/uMkQQMvN7A Una tradición.En la piscina celebrando la victoria de hoy.\n\nA tradition, celebrating the championship in the... http://t.co/eFkowDtcyM Descansando en el vestuario despues del partido. \nHaving rest at  the locker room after the match today. http://t.co/IAvLFD1P55 Muchos recuerdos vienen a mi cabeza cuando salgo a la central del Real Club de Tenis de Barcelona. Es un torneo... http://t.co/GqbTg0XKK1 Desayunando en el hotel antes de salir hacia el club a entrenar.\nHaving breakfast at the hotel  before going to... http://t.co/DEFQ9wOvTk Gracias @Orenetalliure4h! Con tu apoyo espero hacer un buen partido! Buenos días @iretwit882h! Gracias por tu apoyo! #vamos Entrevista con el gran Mats Wilander! Interview with the great Mats Wilander! http://t.co/v4GnVNZGCh Estar en Barcelona en #SantJordi es un placer! Me encanta como celebran este día. Espero que todos lo disfrutéis. Entrenando en el Real Club de Tenis Barcelona... Mañana empiezo!!\n\nPracticing in the Real Club Tennis... http://t.co/dFWmjbifx0 Enhorabuena a la #armada femenina que ha conseguido volver al grupo mundial! Lo hicisteis realmente bien Amigo me alegre mucho por tu gol de ayer! Espero que todo te vaya bien @llorentefer19! Buenos días , descansando y preparando el partido en el vestuario. A ver si hay suerte, la vamos a necesitar :)... http://t.co/XfURBk3Y8Z Buenos dias a todos, hoy me he levantado con esta Portada del programa del torneo de Montecarlo! me ha gustado... http://t.co/VZzZEKWUil Mucha fuerza a la #armada femenina este fin de semana! #Vamosss a por Japón!  All my Support to the female #armada the next weekend! Grande @Paugasol con un tripledoble consiguiendo la clasificación de Lakers. Enhorabuena amigo! Una nueva experiencia, el Players Show de Monte-Carlo con Juan Monaco... Unico!!\nA new experience, the players... http://t.co/Eik2TdJLcH Hoy me dieron una placa de la Policia Francesa. Muy agradecido!\n\nToday I received a french police badge! Thanks! http://t.co/io3CI4PYrp All my Support to all affected in the #Boston attack. A tragedy that should not occur again. Todo mi apoyo por los afectados en el atentado en #Boston. Una tragedia que debe no volver a producirse. #TheChampionsParty now has a Champion venue. Check out this photo. Follow link to join me http://t.co/xE5zdPyn0n http://t.co/t0pqCqiaGI Ya tenemos lugar para  #The ChampiosnParty sigue el link y descúbrelo  http://t.co/xE5zdPyn0n http://t.co/nf7DJg5auJ Difícil encontrar un club de tenis con una vista tan espectacular. \n\nHard to find a tennis club with this... http://t.co/IMofWoHKWV Event in Monaco to present the Champions Party http://t.co/xE5zdPyn0n http://t.co/nhtGt1RkIh Evento en Monaco para presentar la Champions Party!  http://t.co/xE5zdPyn0n http://t.co/TOcjXd8Oju Esta mañana entrenamiento de dos horas. Practicing two hours in the morning. http://t.co/LK0AR1wJ8x Ya en Montecarlo! Now in Montecarlo! http://t.co/gxdv25nsyQ Interesting #Champions draw. Good luck to the Spanish teams! Barça-Madrid would be a great final! Interesante sorteo de #Champions Deseo toda la suerte a los equipos españoles! Barça-Madrid sería una gran final! Great beginning of @thesergiogarcia! I hope you'll continue great at the #AugustaMaster Gran comienzo de @thesergiogarcia! Espero que sigas así en el #MasterdeAugusta Con el equipo de mis primos! He venido a despedirme de ellos porque mañana viajo a Montecarlo. \n\nWith my cousins'... http://t.co/3dlpwHuId9 Me gustó mucho el mensaje de este vídeo que me han enviado y quería compartirlo con vosotros http://t.co/XN1OCwidVc #ysinoslevantamos Hoy cocino my plato favorito:  gambas de mallorca.\nTonight I cook my favourite dish: mallorcan prawns. http://t.co/BarnMHSvl3 Wishing to see Guan in the #Augustamaster. This guy promises a lot and He's a great career ahead! Deseando ver a #Guan en el master de #Augusta. Este chico promete bastante y tiene una gran carrera por delante! Enhorabuena al #Regal por su victoria ayer en la #Euroliga! Mucha suerte para #RealMadrid y #Baskonia! #Vamosss A pleasure for a golf fan the  current season! We will live greats confrontations #RoryVsTiger Un placer para un aficionado al golf la temporada actual! Viviremos grandes enfrentamientos #RoryVsTiger Good Luck @Paugasol to the next important matches! I hope you’ll arrive to #playoffs Mucha suerte @Paugasol en los siguientes partidos decisivos! Espero que consigáis llegar a #playoffs Recuerdo cada uno de estos puntos, significaron mucho para mí! Gracias por el esfuerzo de montar este gran vídeo.... http://t.co/MukXvbDGTb Great #JulioIglesias! Congrats for the #guinness and your success in #China. I wish you a great #asiantour Orgulloso del gran #JulioIglesias! Enhorabuena por el  #guinness y tu éxito en #China. Te deseo una gran #giraasiatica Muchas felicidades Ericb! eres un gran ejemplo de superación para todos. Al final ya veis lo que ha pasado. Yo aprendiendo a jugar al póker y Alfonso poniéndose en forma. \nAt the end... http://t.co/OpGYrpwu17 Acabo de ganar el torneo @JoanSuasi. Me toca elegir el lugar donde @el_rage hace los abdominales. Alguna sugerencia amigos? RT @JoanSuasi: @el_rage @RafaelNadal. Pues yo sin hacer ningun video, acabo de ganarle dos manos a Rafa. Me pongo primero en el torneo. Acabo @JoanSuasi  de ganar una mano a @el_rage  en la que no tenia nada. Os acordais como  aprendi a farolear? http://t.co/nL0GfsdIXa We are all at the table. The loser will have to do 50 push-ups where the winner decides to. http://t.co/0GahRhTB9B Ya estamos todos en la mesa! Quien pierda deberá hacer 50 flexiones/ abdominales donde decida el ganador. http://t.co/pMveKywrSM In my free afternoon, @el_rage  has just arrived. While we’ve lunch , we are planning a póker night. Who Is in? http://t.co/0x7Z61fF0N Tarde libre y acaba de llegar @el_rage Planeando una tarde de poker y amigos ¿Quién se apunta? http://t.co/clOjb9YC30 Paseando por palma despues de una  sesion fotografica con Nike\nHaving a walk in Palma after a Nike shooting. http://t.co/XHER16qrRU Quien la sigue la consigue @sebaasalgado! Que tengas un buen día :) Gracias por tu apoyo @CCreppa! Sigo trabajando duro para la temporada de tierra! A overcoming story of #DuckHeeLee teaches us that we must fight! The youngest player in the #ATP Una historia de superación la de #DuckHeeLee que nos enseña donde podemos llegar luchando! El jugador más joven de la #ATP Proud of Spanish basketball, three teams in the quarterfinals of the #Euroleague ! Congratulations to all! Orgulloso del basket español, tres equipos en cuartos de la #euroliga! Enhorabuena a todos! Después de entrenar toca dejar la pista bien arreglada para los siguientes jugadores.\n\nAfter practicing it's... http://t.co/Uo0taBy9On Entrenando un dia más con Federico Zeballos, de Bolivia! :)\n\nOne more day practicing with Federico Zeballos, from... http://t.co/G4VehAWYOA #TheChampionsParty and you’re invited! RT if you’re excited. To win a place at the party enter now - http://t.co/xE5zdPyn0n Estoy organizando #TheChampionsParty y tu estas invitado. RT y participa  :) http://t.co/xE5zdPyn0n Un día fantástico de entrenamiento en Manacor\nA great day to practice in Manacor http://t.co/5AWvOQIMWm Hoy difruté de  una comida muy agradable junto a mis amigos.\n\nToday I had  a very nice meal with my friends. http://t.co/zqBSFJGbB9 Fancy partying with me at #TheChampionsParty? I'm hosting and you can join me by following this link! http://t.co/xE5zdPyn0n Si quieres conocerme  e ir conmigo a #TheChampionsParty clica en este link http://t.co/xE5zdPyn0n Quieres asistir a la Champion's Party y conocerme en persona? Entra a http://t.co/qXycJmmuNP   \n\nDo you want to... http://t.co/2YKD7KLB5z Tarde de entrenamiento en Manacor.\nPracticing in Manacor this afernoon. http://t.co/aTVIxe5uPH Hoy despues de entrenar recebi una visita muy agradable.\nToday after my practice I received a very nice visit. http://t.co/mo4m2kRNIb Hoy me toca ser el cheff!! A ver que pasa...!!\nToday it's my turn to be the cheff! Let's see what happens... http://t.co/ANL3DHaugE Muchas felicidades a la Roja!\nCongratulations to Spain! http://t.co/O9ExrOULcA A great new logo @paugasol! Thanks for the t-shirt friend :) http://t.co/XOhOn3UgFD Me gusta mucho el nuevo logo @paugasol! Muchas gracias por el regalo amigo :) http://t.co/NDHC4yn62i Vuelta a los entrenamientos en tierra con un día muy agradable! \n\nBack to the practice on the clay court. A... http://t.co/FXfmfGadRD Apoyando la roja con mis amigos!\nSupporting la roja with my friends! http://t.co/tyg01NOk9I Noche tranquila en casa  en casa\n\nRelaxed evening at home http://t.co/WNhoyZcbxY Descansando unos días en casa. Volveré a los entrenamientos para preparar la gira de tierra.\n\nResting for a few... http://t.co/OezpvY4aob Hola @MiriFnts está claro que puedo mandarte un saludo :) Gracias por tu apoyo! I’m working hard to the Clay season! Thanks for you support @adelya_1818 Gracias a todo el público de Indian Wells por su apoyo! Ha sido un placer ganar allí. \n\nThanks to the public of... http://t.co/E8y6qM2fiK I wish good luck to the Spanish players in #Miami! I hope you enjoy a great tournament. Deseo toda la suerte del mundo a los españoles en #Miami! Espero que disfrutemos de un gran torneo. Gracias a todos!!!! :) Thanks to all!!!! :) http://t.co/MKpajHtDe6 Preparado !!!!\nReady !!!! http://t.co/YvfwxvVVWk Me voy a la ducha, después a prensa y a descansar para el partido de mañana!\nI'm going to the shower, then press... http://t.co/Q4aqgU8rSS Un dia precioso en Indian Wells. Disfrutando de mi día de descanso!!\n\nA great day in Indian Wells. Enjoying the... http://t.co/CTSNzXTCcM Voy ya para casa después de un buen día! Muchas gracias a todos por el apoyo! \n\nGo to home after a great... http://t.co/QmliqEoxnm Descansando en casa por la mañana... Esperando a que llegue la hora! ;)\n\nResting at home this morning. Waiting... http://t.co/aqd1jYB0pm Me alegro por la vuelta de #Quirós a los campos! Espero que estés completamente recuperado. RT @DavidFerrer87: Seguidores por fin os puedo anunciar que soy #novatofb! :) Podréis seguir mis noticias también desde allí! :) http:// ... Bienvenido amigo Ferru!! Welcome my firend Ferru!! http://t.co/PL75E5o5o3 http://t.co/WAGgGOuK1x La verdad es que lo disfrute un montón @Noodle_snt! Ahora centrado en #IndianWells Gracias por tu apoyo @eduardguay! Espero hacer un buen torneo. Great win #Tiger! You know I am a big fan. Great to see you winning! Gran victoria Tiger! Sabes que soy un gran fan tuyo y me gusta verte ganar otra vez! Un abrazo muy fuerte para el gran #PepeDomingoCastaño! Espero que te recuperes pronto. Volviendo a casa después de que Leo no haya podido jugar... Un poco de gimnasio y esta tarde a entrenar un poco... http://t.co/cSmOSNHCHQ Hoy jugué con alguien que nos hace sentir muy especiales. Gracias Larry y cuando quieras jugamos otra vez!... http://t.co/YZ6hUHXE6Q Día de Relax! Day of relax! http://t.co/IYfUvl2tNy Hemos puesto la primera piedra del nuevo estadio aquí en Indian Wells. Increible Larry Ellison lo que esta... http://t.co/mq1u9VlHhn Ambiente espectacular en el entreno de hoy. \nSpectacular atmosphere during the training session today. http://t.co/NZP9XB8gAI Today we have laid the foundation stone of the new stadium here in Indian Wells. Larry Ellison incredible what... http://t.co/aYPZpG29gN Hoy hemos puesto la primera piedra del nuevo estadio aquí en Indian Wells. Increible Larry Ellison lo que esta... http://t.co/4XqIUyEZlg Entrenando en Indian Wells! Todo preparado para empezar a jugar. Practicing in IndianWells! Ready to start http://t.co/KF5BN32WHi Good Luck to #EduardoRiva! He’ll play for the first time in the #BritishOpen #Golf Toda la suerte del mundo para #EduardoRiva! Jugará por primera vez el #AbiertoBritánico de #Golf Me alegro mucho de que le hagan un homenaje en el #Godo al gran @juankiferri! Se lo merece Gracias Jawad por este vídeo! #VamosRafa! \n\nThanks Jawad for the video! #VamosRafa! http://t.co/56pCYwJ8Ag And the winner of the signed racquet of #tennisworldday is  @Sofiagtz! Y la ganadora de la raqueta firmada del #diamundialdeltenis es @Sofiagtz! La verdad es que me lo pasé genial en #NewYork @PauGasol mira donde estuve! http://t.co/ttw58L6cQc Primera vez que piso el Madison Square Garden. Lugar emblemático!\nFirst time in the Madison Square Garden. A... http://t.co/UmOZiIkRuD Today is the  #TennisWorldDay I want to give a signed racket. Who use #VamosRafa enters in the draw :) Que mejor manera de celebrar el #diamundialdeltenis que regalando una raqueta firmada. Quién utilice #VamosRafa entra en el sorteo :) Thanks for your Support @PauGasol! I hope you recovery soon and the Lakers will enjoy with you friend. Gracias por tu apoyo @PauGasol! Espero que te recuperes pronto y los Lakers puedan disfrutar otra vez de ti amigo. Con Azarenka, Serena y Del Potro en la rueda de prensa aquí en NY \n\nWith  Azarenka, Serena and Del Potro in the... http://t.co/mPmsUMSwdD With @vika7 @serenawilliams y @delpotrojuan in the press conference in NY http://t.co/3ALXBuuBYV Con @vika7 @serenawilliams y @delpotrojuan en la rueda de prensa aquí en NY http://t.co/3ALXBuuBYV Ya en Nueva York. Quiero agradecer especialmente a Montse, Ricardo y Diego por hacerme sentir como en casa en... http://t.co/XyggTJkulL Muy contento por mi victoria en Acapulco. Muchas gracias por vuestro apoyo siempre!\nVery happy for my victory in... http://t.co/XOoDbpOquD Cenando con el equipo después de una buena victoria! :)\nHaving dinner with the team after good win! :) http://t.co/9K7jCncgS6 Desayunando. Hoy día de partido! \n\nBreakfast,  today I'll play! http://t.co/PIv5x1ll36 Hoy tuve la suerte de ser entrevistado por uno de los personajes más conocidos de Méjico. Fue todo un honor... y... http://t.co/XiG5kaYVJ8 In a newspaper in #Mexico I read  something about the ecological houses. Sounds like a great idea to change this world slowly :) En un diario en #México he leído que desarrollan casas ecológicas. Me parece una gran idea para cambiar poco a poco este mundo :) La vuelta de @rickyrubio9 era esperada por todos y la verdad es que ha demostrado que sigue teniendo el basket en la sangre. Muchas felicidades a mi amigo @llorentefer19! Espero que pases un gran día con los tuyos. Ayer estuve con Rafa Marquez en un evento NIKE. Gracias  por venir y suerte el sábado con tu equipo aquí en... http://t.co/es3gEFKxzp Este tipo de vídeos me traen buenos recuerdos y me dan fuerza para seguir adelante! Gracias por vuestro esfuerzo.... http://t.co/ypTA3hm051 Having dinner with Titin after a good day  of training  and poker. http://t.co/Pmda5mT5bu Cenando con Titin después de un dia de entrenamientos y Poker. http://t.co/4XmzHEnTKf Tournament starts there's 41,000 other players all competing to \nwin. It's time to apply the strategy I have learnt. http://t.co/6EP5AfRNUD El torneo empieza con 41,000 jugadores compitiendo para ganar. Es la hora de aplicar la estrategia que aprendí. http://t.co/VGPwCoQMmN RT @JoanSuasi: what about this  Rafa?@rafaelnadal @el_rage ? http://t.co/qMbpXHqziE OMG @joansuasi @el_rage. Check this hand! joan, can you do it better?  hehe http://t.co/zSVEQQZsPL RT @JoanSuasi: ok @RafaelNadal. Remember I also prepared myself @el_rage @el_rage You will find it difficult to beat me! With @JoanSuasi about to start the online poker tournament. Today we'll compete to see who goes deeper! Vamos! http://t.co/qsiAhAy5tb Con @JoanSuasi a punto de empezar el torneo de póker online. Hoy competiremos para ver quien llega más lejos! Vamos! http://t.co/NwzCMhv9U1 Practicing with @VStrator against myself :) Such a great experience! http://t.co/wrTa4a1VVS Entrenando con @VStrator contra  mí mismo :) Una gran experiencia! http://t.co/wrTa4a1VVS Proud of #laarmada! We have a great players and They are showing at the tournament in #BuenosAires. Good luck for the quarters! Orgulloso de #laarmada! que grandes jugadores tenemos y lo están demostrando en el torneo de #BuenosAires. Suerte para los cuartos! RT @JoanSuasi: @RafaelNadal @el_rage Stick to playing tennis Rafa which you  do very well... There is no chance you beat me on Sunday !! I'mm ready @joansuasi  to go deeper than you on Sunday's poker tournament. These days I have practiced a lot @el_rage . I will beat you! Pues en este momento lo tengo complicado @7Montesinos! Disfruta de la comida! I haven't words! Thanks to all these people for their support and they have done great work ! #Vamos  #Thanks http://t.co/6sDoEHeSfi No tengo palabras! Gracias a toda esta gente por su apoyo y el gran trabajo que han hecho! #Vamos #Gracias http://t.co/6sDoEHeSfi Make your kms count with Nike +. Run  2,500 kms and help my foundation. Info here http://t.co/H8FX9u26  #nosotrascorremos Conviertan sus KM en ayuda con Nike Plus.Sumen 2,500  Kms y apoyen a mi fundación. Aquí las bases http://t.co/H8FX9u26  #nosotrascorremos I was with @joansuasi  and Alfonso @el_rage.He's teaching us poker and is preparing us to play a tournament on Sunday http://t.co/Jsx1Gcic Estuve con @joansuasi y Alfonso @el_rage aprendiendo a jugar poker. Preparándonos para jugar un torneo el Domingo http://t.co/Gq3veYej Mirad el gran trabajo de @AldeasEspana: http://t.co/GqdBDhEn ¡Son increíbles! Gracias por vuestro apoyo a @frnadal  RT How are your training sesions with @Vstrator going? I think it’s a unique technology that can help you http://t.co/bMHxRJhC Cómo van esos entrenamientos con @Vstrator? Creo que es una tecnología única que puede ayudaros http://t.co/bMHxRJhC En el aeropuerto. Muy feliz de poder ganar un titulo nuevamente! Obrigado Brazil.\nAt the airport! Very happy to... http://t.co/ZcjIrGv7 Ayer tuve el placer de estar un rato con Barrichello. Una gran persona, le deseo lo mejor para esta temporada!... http://t.co/dOKftqj3 Today #InternationalChildhoodCancerDay l want to send my strength and support to these fighters! Hoy #diainternacionaldelcancerinfantil quiero mandar toda mi fuerza y apoyo a estos luchadores! Le deseo lo mejor a Vergeer en su nuevo camino! Ha dejado el tenis definitivamente, se retira un mito.\n\nI wish... http://t.co/JrDMkZBI Con una leyenda del tenis, Maria Bueno, ganadora de 19 Grand Slams!!!\n\nWith a tennis legend, Maria Bueno, winner... http://t.co/JWVvZnTk Me acabo de enterar en #Brasil de la lesión de la presidenta. Espero que #DilmaRousseff se recupere pronto de su fractura de pie! En Brasil, en la sala de jugadores viendo un gran partido de fútbol!\n\nIn Brazil, in the players' lounge. We are... http://t.co/OefXuvjY Entrar en la pista de Sao Paulo con Nalbandian fue una gran experiencia! Que ambientazo hay en Brasil!\n\nCome into... http://t.co/eq7c8fPV Mi primer contacto con la prensa en Brasil. Hacia casi 7 años y me sorprendió el ambiente. Obrigado!\n\nMy first... http://t.co/MaW08C8O Oi Brasil. Ya estamos en Sao Paulo!\nOi Brazil. We are in Sao Paulo! http://t.co/He0OBJrx Feliz cumpleaños Titín! Molts d'anys!\nHappy Birthday Titín! http://t.co/sjDsLiR4 He publicado 24 fotos en Facebook en el álbum \"VIÑA DEL MAR. CHILE 2013\". http://t.co/JlBB2KvJ Gracias Chile por todo. Ha sido una semana especial!\nThanks for everything Chile. It's been a special week! http://t.co/kT6icFSM Enhorabuena a Horacio por su gran victoria. Ha sido una semana muy especial para mi. Gracias por vuestro apoyo... http://t.co/gOm8o713 Aquí en Viña, casa del gran Nico Massu!!!. Gran persona!!!! Tienes que volver a estar en el circuito!\n\nHere in... http://t.co/ItnFbNwC I want to wish to all brazilians a good #Carnival! In a few days I'll be there playing. I'm excited! Quería desearle a todos los brasileños un buen #carnaval! En pocos días estaré allí jugando. Me hace mucha ilusión! Tras mi victoria 100 en dobles espero seguir sumando con el gran @picomonaco en el próximo partido! #Chile #Viñadelmar @paloma_anton mucha suerte en el torneo! Ya me contarás como fue. I'm happy for @rickyrubio9 that he will finally at #AllStarGame! I hope to watch the great rubio! Me alegro mucho por @Rickyrubio9 que estará finalmente en el #AllStarGame! Deseando disfrutar de tus asistencias amigo! One win more with @picomonaco! I enjoyed the match with my great friend! http://t.co/LWVUPZk6 Una victoria más con @picomonaco! He disfrutado mucho del partido con mi gran amigo. http://t.co/A0qSanLM Un partido muy especial! El ambiente era único perfecto para la vuelta a la pista! GRACIAS CHILE!\n\nA very... http://t.co/5lFiUUIs From #Chile I wish to my friend @paugasol  a speedy recovery! I hope to see you play a soon as posible! Desde #Chile le deseo a mi amigo @PauGasol una rápida recuperación! Espero que al final no sea tan grave First win with Pico, we felt a great ambiance on court! Thanks to the crowd and you all for the support! #Vamoss http://t.co/NL9jn2Uy Primera victoria con @picomonaco buen ambiente en la pista! Gracias a todos por el apoyo! #Vamoss http://t.co/0h0R4vIq Good luck on your debut with your friend @picomonaco Nervous but excited to see Rafa! Encouragement of all your team! #VamosRafa! Suerte en tu debut con tu amigo @picomonaco Nervios pero ilusionados por volver a ver a Rafa en pista! Ánimos de todo tu equipo! #VamosRafa! Hoy sorpresa en el entrenamiento! Un grupo de niños han venido al torneo.\nToday surprise! Some children came to... http://t.co/jdkpzvSd I've been working with @Vstrator on a great training mobile app! Discover it here :)\nhttp://t.co/7YLd0jDb Llevo trabajando un tiempo con @Vstrator una gran aplicación de entrenamiento! Descubridlo aquí :)  http://t.co/7YLd0jDb Entrenando en Viña, estoy muy sorprendido por la respuesta del público. Gracias Chile!\n\nPracticing here in Viña.... http://t.co/SfyjeSj7 I'm ready to reveal my secret project! http://t.co/pupy5Gxl Por fin puedo revelaros mi proyecto secreto! http://t.co/pupy5Gxl Gran recibimiento en Chile! Con muchas ganas de jugar!\nGreat reception in Chile! Eager to play! http://t.co/eflQrbUu All my support to the affected by the earthquake in #Atacama #Chile ! I Hope the aftershocks are decreasing Todo mi apoyo a los afectados por el seísmo en #Atacama #Chile! Espero que las réplicas vayan disminuyéndose. Camino a Chile!! On my way to Chile! http://t.co/asroga9e RT @Diario_SPORT: VIDEO: No te pierdas a @RafaelNadal, @juankiferri y más tenistas ganando el 'Petit As' con 13 años http://t.co/2dmwDDB ... RT @FerGrisolia: Entreno de Rafa Nadal en Manacor, previo a su vuelo a Sudamérica. Mañana parte rumbo a Chile.  http://t.co/wCV55h7J Con mi amigo Tomeu Salvá! Una de mis parejas clásicas de entrenamiento. \n\nWith my friend Tomeu Salvá! One of my... http://t.co/xqLynbFf Hi @Kissmezayn_3 I come back in chile! I hope that you’ll watch me :) Gracias @abapul52! Estoy deseando llegar, espero hacer un buen torneo! Aprovechando el gran día que hace para seguir entrenando!\nA great day to keep practicing! http://t.co/M5EyAihw Preparándome para Chile. En pocos días estaré allí! Practicing. In a few days I'll be in Chile! http://t.co/4rvtx7Bi All my support and strength to the affected of the fire in #Brazil. This kind of situation should not happen again! Todo mi apoyo y fuerza para los afectados por el incendio en #Brasil. Este tipo de situaciones no deberían volver a repetirse! Que gran partido de los #hispanos! Enhorabuena por vuestro segundo mundial! Great match of the #hispanos! Congrats for your second worldcup! Ayer cenando con mis amigos antes de salir hacia Chile.\nYesterday I had a dinner  with my friends before going to... http://t.co/VzburZa7 http://t.co/uagfFjaA Me he encontrado a dos grandes amigos en el aeropuerto! Suerte en Vancouver!\n\nI meet two great friends at the... http://t.co/du3qHboN Estos días estoy entrenando con Tommy Robredo en Barcelona!\nThese days I'm practicing with Tommy Robredo in... http://t.co/dYRY0LeO Seguimos en el Real Club de Tennis de Barcelona. Paso a paso!\nContinuing  at the Real Club Tennis of Barcelona.... http://t.co/WVPwKYpq He publicado 2 fotos en Facebook en el álbum \"Poco a poco aprendiendo a jugar/Step by step learning how to play\". http://t.co/CRYlZukO Atentos a esta promesa del #golf http://t.co/lg9CvFRa A great golf player! Ayer por la noche lo pase muy bien cenando con amigos. Hoy a entrenar!\nLast night I had a really good dinner... http://t.co/wKWqaD1X De la mejor pareja de la #play a jugar en #Viñadelmar!! @Picomonaco entrena duro para el torneo! http://t.co/VShGbVU9 En el vestuario después del entrenamiento.\nIn the locker room after practice. http://t.co/YvdTmvQC Enhorabuena a @DavidFerrer87 por el partidazo que han hecho los dos! \nCongrats to @DavidFerrer87! I enjoyed the match! Gracias @Paugomezcuenca  por tu apoyo! Entrenando para la vuelta! Believe me  @tripleone0  I desire to come back soon! El otro día estuve un rato con mi hermana. La familia me apoya mucho en este momento.\n\nThe last week I spent... http://t.co/Up2NqYgy Un orgullo para el deporte español el duelo entre dos grandes de la armada! @DavidFerrer87 @NicoAlmagro que gran torneo estáis haciendo! Intentando entrenar... Trying to practice... http://t.co/3UGCbCln Muy agradecido por la acogida en #chile sobre mi participación en el torneo! Con muchas ganas de jugar allí! A pleasure to receive the visit of Ricardo and my KIA's friends. Thank you very much for your support! http://t.co/TyPXZXHs Ha sido un placer recibir la visita de Ricardo y de mis amigos de KIA. Muchas gracias por vuestro apoyo! http://t.co/btOcaFvR A mí me hace mucha ilusión @Cristina_24_4 ! Espero disfrutar de un gran torneo, estoy muy agradecido a la organización. @MirjanaaaD I hope to come back early! I want to be well for your enjoyment :) Esta semana estuve entrenando en el Real Club de Tennis de Barcelona! Agradezco el trato que me han dado allí... http://t.co/UPwq2c3E Estoy encantado de confirmar mi participación en el torneo de Viña del Mar en Chile. Me gustaría agradecer a los... http://t.co/jPbPyzsD Con mucha ilusión de volver a Brasil!\nHappy to be back soon in Brazil! http://t.co/IAujnuJg Esta mañana me he levantado con un noticia de las que no quieres oir. Nuestro amigo Brad dejara la ATP para... http://t.co/4iaAr5OM The @AustralianOpen already underway. I miss being in # Melbourne! Hope you enjoy the tournament! El @AustralianOpen ya está en marcha. Echo de menos estar en #Melbourne! Espero que disfrutéis del torneo! Gracias @CharlyMoya por tus palabras!! Espero volver a disfrutar pronto del tenis :) De camino a Bcn. On my way to bcn. http://t.co/kZnRabo8 Muchas gracias Jesús y David  por el libro. Os lo recomiendo a todos. http://t.co/OG3AdQSD Gracias por este gran trabajo! En este momento vuestro apoyo me ayuda a seguir trabajando.\n\nThanks for a great... http://t.co/QCe3La6v Me hizo mucha ilusión que mi amigo Carl de Toronto me visitase! I  thrilled that my friend Carl from Toronto... http://t.co/MR2YWt1s Thanks for your support @crzy_skywalker ! I hope to come back early. @LocaAnahiSerbia espero recuperarme pronto para volver a los entrenamientos. Os iré contando. Gracias por tu apoyo Gracias @Albertrdguez76 ! Con fans como vosotros todo es mucho más fácil ;) Amigo @Paugasol espero que te recuperes pronto! Espero verte en la pista en poco tiempo :) En Barcelona tratando temas de la Fundación y reunido con Carlos!\n \nIn Barcelona dealing  topics about the... http://t.co/momnU9NN Que orgulloso me siento de Del Bosque! Haciendo historia con esta gran selección. Merecía el premio Congrats to Leo Messi for his new golden ball. It was difficult with two cracks like Iniesta and Cristiano Enhorabuena a Leo Messi por su nuevo balón de oro. Era complicado con dos grandes como Iniesta y Cristiano. De visita en el club que me vio crecer. Aquí di mis primero pasos en el mundo del tenis :)\n \nVisiting the club... http://t.co/5ymC2ujO Feliz Año 2013, Happy Year 2013. http://t.co/b7GdU0ym Mi rodilla está bastante mejor, y el proceso de recuperación ha ido según lo previsto por los médicos, pero este... http://t.co/Uu58kZo9 Lamento mucho no poder competir este año en Abu Dhabi. Todo estaba preparado y tengo muchas ganas de volver a la... http://t.co/MzWLj54x Feliz Navidad a aquellos que la celebran y felices fiestas a todos!!\n\nHappy Holidays to all and ENJOY!!!! http://t.co/J3uloEj2 Llegó el momento del duelo contra Tsonga! It's the time for the duel against Tsonga! http://t.co/PoTNj4xO Cena de navidad con mi equipo!! Christmas dinner with my team!! http://t.co/Sf5DfozI Entrenando con Toni! Practicing with Toni! http://t.co/XZN33eCl"}