{"tweets": "My mom cooked the most delicious food and I’m so thankful she’s back in my life 💯 Everything happens for a reason ⭐️ And the #premium mystery box is now 100% sold out!!!! 🥴🥺😱 Also, ALL 3 #ExtremeFrost shades are about to be gone!!!! WTF!!! The Deluxe #MysteryBox sold out in under 20 minutes 😱❌ omfg The Jeffree Star Cosmetics 5th anniversary collection and #BlackFriday sale have officially launched!!! 💖 SHOP: https://t.co/nS6nMtl3yw https://t.co/YAStTxjpHd Oh my god!!!! 😱😱😱💯💯💯⭐️⭐️⭐️ https://t.co/ZEUkEXykPX 😭😭😭😭🥺🥺🥺🥺💖😱😇🤭💯🔥😘 @MrApple0956 😇😇😇🤭💯🔥💖 @bekindlovehug @shanedawson His store will be back tomorrow and the backpack will be available! We are less than two hours away!!!!! 😱🥺🔥⭐️ #JeffreeStarCosmetics #BlackFriday RT @AbstractAmanda: 2 hours people till @JeffreeStar launch! Hopefully we don’t break the internet again. RT @yousuckalysea_: Ummm less than 3 hours until the @JeffreeStar holiday launch and I’m NERVOUS My 102 year old grandma is wearing the top row from the #ConspiracyPalette to Thanksgiving dinner today!!!! 💯 Brb crying We also need chronological order back, thanks!!! Happy Thanksgiving 😘🍖 https://t.co/Anw3E8AC87 @Shopify can’t wait for today’s launch!!! 😇💖⭐️ @JessKo94 @shanedawson 🐷🔥⭐️ @Maria04701211 I’m not moving up the time at all! Goes live at Noon pst!! @amyagween_ No, the new velour liquid lipstick is in the medium size only! 😘 @JarrodMUA We put both back up yesterday after several months of them being out of stock! 🤭 Omg good morning!!!! My crazy launch &amp; #BlackFriday sale starts in 5 hours or less!!! 🤭🖤⭐️ https://t.co/8Ql63Hi78m RT @JessicaLR49: @JeffreeStar l had three separate dreams about trying to get your mystery box last night.. i think i reaaallllyyy want one… I can’t stop eating pumpkin pie 🥴 omg help RT @samnestrada: I wanna rub the new Jeffree Star highlighters all over my body The #PeppermintFrost palette is exclusive in tomorrow’s Deluxe mystery box ❄️ It will never be made again 🤭 No more sneak peeks! 🚫 https://t.co/qFyjwzJphp Should I give a few sneak peeks at what’s inside the #BlackFriday Mystery Boxes??? 😇😇😇🤭🥶 3 sizes are launching tomorrow  and they are EPIC 💯 Hi, who’s ready for tomorrow’s launch AND #BlackFriday sale??? 🔥💖⭐️ Here are all new items launching 🥺 Everything goes live at NOON PST time!! FREE U.S SHIPPING ✈️ https://t.co/mVNF8AW7p1 RT @shanedawson: this is a pic jeffree sent me when i was having a rough day to cheer me up. :,) seeing him hold our baby while also wearin… YES!!! @shanedawson’s ENTIRE merch store is restocking on Friday!! 🐷⭐️ Yes, backpacks, new pig Xmas sweater, robes and all previous designs!! 🔥 https://t.co/vWkdPYWUYO Obsessed w the new @shanedawson matte black pig tumbler 🖤 launching on his merch store this Friday!! https://t.co/qmCVUEjU5Q @aikz_makino @shanedawson You look amazing!! Have the best time ever 💗 Just woke up and it’s pouring rain outside 💦 #calabasas @mariie_mua @shanedawson 😘⭐️🐷 LICK MY GLIT 💍💦⭐️ #ExtremeFrost https://t.co/LbGt2NBtwA I’m wet 💦💦💦 #ExtremeFrost https://t.co/9LAGROrCAl Omg we are officially moving into our new house in December!!!! 😭😭😭⭐️🐶🐶🐶🐶 #StarFamily #newchapter The #JeffreeStarCosmetics INSANE #BlackFriday sale starts early on THURSDAY at Noon!!!! 😇 Who’s got their list ready?? 🧐 https://t.co/hZqxvHzp93 Of course #JeffreeStarCosmetics currently offers 3 other highlighter formulas! ⭐️ This new product is next level blinding and not for the faint of heart. If the price point is not for you, no worries, grab a #SkinFrost and still shine 💦 I made the #ExtremeFrost formula for bougie makeup loves who love luxury cosmetics and crazy shit ⭐️ The formula is really expensive to make so I had to price it accordingly ✅ All 3 shades R permanent. Free shipping 4 ALL U.S customers when launch! ❄️ https://t.co/iYHaHlNoRn I’m wearing #ExtremeFrost shade ‘Gag Me’ ❄️ Retail is $50.00 💧 Exclusive to JSC website &amp; limited amount on @beautylish ⭐️ Comes in white luxury box. Vegan. Cruelty-Free. Launching 11.28.19 @ NOON 🥶 https://t.co/CFRRDyVi2f High, How Are Ya? 💦🥶😭 https://t.co/0Uw7QCpXMp Yessss I was secretly wearing #ExtremeFrost while we were filming the whole series! 🥶 https://t.co/YAHfB4d1JO 💦💦💦⭐️⭐️⭐️ #ExtremeFrost https://t.co/kDvjT7loC8 Here is #ExtremeFrost shade “Lick My Glit” on top of blush 🤭🔥 https://t.co/wyncpZf32W There is nothing like these highlighters on the market 🔋 Extreme pay off w a touch of your finger. One pan lasts a life time 😇 https://t.co/vjf0bDHvUq The texture feels like smooth diamonds, not chunky or weird. Like powder butter with the most intense shine 💦⭐️ https://t.co/rHGHVT3ekc RT @glossayy: Here are the swatches In reduced lighting ❄️✨✨✨✨✨ I need gag me all over my vajajay 🤪🤪 @JeffreeStar #JeffreeStarCosmetics #ho… RT @Tonya_Stylz: Just a quick not filter ir BS swatch of the Newest and absolutely STUNNING! #extremefrost highlighter pigments from @Jeffr… RT @ChrissyGlamm: Listen I feel like I just got a rollie from @JeffreeStar  Thank you so much 😊 SCREAMING HAPPY FIFTH YEAR ANNIVERSARY 🎉🌟… I created the worlds most blinding diamond  highlighter 💍 #ExtremeFrost is pure pigment, no filler 😱 This is for the CRAZY highlight addicts. It creates a wet glass effect on the skin, no Facetune needed 🥶 https://t.co/k5BKrAMIZt It’s the 5th anniversary of #JeffreeStarCosmetics this week &amp; I’m launching new products!! 💚 Bringing back our original 5 shades from the very first Christmas collection! 🤭 Retail price: $75 ⭐️ All 5 shades will also be for sale individually! Launching THIS Thursday at NOON PST https://t.co/2W7I9dOdxh RT @keiseee: I never felt so connected to the internet. AHHHHH #ShaneXJeffree #ConspiracyPalette made it to the Philippines you guys!! 😍… How are we all feeling about yesterday’s review? 😱💖 https://t.co/MtQEiOdNQh 🐷⭐️👁 https://t.co/5sDqG11FPv RT @Isha_Bassi: regardless of how you feel about the last ep, the real star of the entire #ShanexJeffree series is the friendship between @… I’m on our 9 hour flight back home right now... ✈️ Reflecting on this entire year and I’m just so happy to be alive and living my dreams. To whoever out there that needs to hear this: Don’t give up. RT @AndrewSiwicki: Genuinely can’t believe it’s all over. This has been our entire year. Wholeheartedly, thank you for the ongoing support… 🔥NEW VIDEO ALERT!🔥 Does @Jaclynhill deserve a second chance? 🧐 Let’s talk... https://t.co/frg8uLYgat @Nick_LGrant @MACcosmetics Love that brow!! 🔥🔥 Omgggggg hi everyone, good morning!! 🤭 Omg tonight is our last night here in #BoraBora and I couldn’t be more grateful for this month 💯 https://t.co/i0XP8TQMH7 New video will be up tomorrow morning!! Sunday tea and redbull 🍵 I’ve been testing a new #JeffreeStarCosmetics long lasting product all week out here in Bora Bora while swimming and sweating, and it’s fucking amazing 🔥⭐️ Can’t wait for #2020!!! @cohlsworld NEVER!! ⭐️ @kamm_lester Yessss!!! 💯 HI, BLACK FRIDAY 😇 HOW ARE YA? ✅ My iconic mystery boxes are BACK and more insane! Launching Thanksgiving Day at NOON PST / 3PM EST time! 🎅🏼 THREE boxes, all with 1 or more exclusive items.. 😱 OH, did I also mention there’s FREE U.S SHIPPING?! 🔥 11.28.19 🔥 https://t.co/Na6ryWl2MR RT @kumikomae: Work of art, really. @JeffreeStar @shanedawson #jeffreestarxshanedawson https://t.co/aUdLAzRMqz We are working on releasing the stunning emerald green eyeshadow shade #PutItBack as a single shadow AS WELL as putting it in the next release of the mini controversy palette in March 💚 We hear you loud and clear and love the feedback 💯 How are we all feeling about the final episode? 🥺👁🦂⭐️🐷 What an insane journey... Feeling forever grateful for this roller coaster called Life #shanedawsonxjeffreestar @wiinterlavender @shanedawson We will discuss some options!! ✅ I can’t even put into words how I’m feeling right now… Thank you for changing my life and helping my heart heal and grow 💖 https://t.co/9OAYvZzjxi Hi, I can’t stop crying... How Are Ya?? 🥺😭 RT @shanedawson: The Beautiful World of Shane Dawson\nhttps://t.co/xaEFipmVLV\n🐷❤️🌟 https://t.co/nDKMZx8YwS Anyone that has ANY product issues with any JSC product, my customer service team is available Monday to Friday 💯 Palettes that were effected, we have sent out new ones and also given a full refund because that does not reflect how my brand should be represented. Here is a clip from the lab of how we press the eyeshadows. Moving forward my manufacturer will make sure this never happens again and have put in place several precautions and steps to avoid the ribbon issue. You all know how serious I take my company, thank you for listening ⭐️ https://t.co/jtXRWjPBnl Hey everyone, it’s come to our attention that a few dozen people out of 1.1 million palettes produced, have a few ribbon fibers embedded in their products. The lab has done a full investigation &amp; we found the issue. I pride myself on quality and fully apologize for this error 💯 https://t.co/8Hn9ndzFsa @officialkaylexx 💖💯🔥⭐️ Gooood morning everyone! ⭐️ Who’s ready for the finale today???? #ShanexJeffree My review of the @jaclyncosmetics highlighter collection will be up on Sunday 💯 Time to see what the real tea is... https://t.co/D5IKF0ipK0 Feeling fucking fabulous 💯🐠 #borabora https://t.co/KTmTz5G1LU Tomorrow expect the unexpected… We are not playing games 💯 https://t.co/wKn4YKhmoF Gooood morning everyone! By this weekend the #JeffreeStarCosmetics team should be done shipping all #ShanexJeffree orders from the launch! 👁 Then we will immediately start shipping the pre-orders and also preparing for Black Friday!! These new mystery boxes are fucking epic.. 😇 RT @WhatKaliWears: Finally Got this Baby in!!😍🤤 @JeffreeStar @shanedawson https://t.co/2eTEgXZrTa Taking a nap before a threesome and a conference call 💎 https://t.co/OlMZOMb1Vc OMG in 9 days it’s the 5th anniversary of #JeffreeStarCosmetics anddddd it’s also Black Friday!! 😭😁😍 There will be a new highlighter product launching and we are bringing back something OG! Expect insane deals and surprises 🔥 @spillseshYT @TeaSpillYT @beautybay I’m so sorry how this situation was handled, that does not reflect our company’s personal policies. We are handling this internally but in the meantime, please direct message me so I can send you a new palette right now myself. I love FaceTiming with our dogs when I’m feeling home sick 🐶🐶🐶🐶 Being in love and traveling the world with my best friend is truly unexplainable… 💯 Grateful for every second we spend together. https://t.co/mr0xJRAyPc Good morning from paradise 🗺 https://t.co/cB6HaQ4dhr Nail Update: They had one bottle of superglue on the entire island, let’s pray it holds 😇 https://t.co/jmtyL5Z2xx @natetdubs Same middle finger, different hand... cursed!! Haha 😭🙃 I just broke a nail while having sex 😭 Let’s pray this island has super glue 🔩 https://t.co/jYsnbzGQw4 Staying humble and grateful every step of the way 💯 https://t.co/Ahy8gfPLp8 RT @CallMeCarsonYT: jeffree star is my sleep paralysis demon How are we all feeling about yesterday’s review?? 🌋 https://t.co/IUXKFOJnEy In Bora Bora with my baby for a week 💙 #birthday #starfamily https://t.co/luqBGDTfze Time for a 9 hour flight ✈️ Off to celebrate my birthday for a week in paradise 🏝 https://t.co/3c5ZsaHjLJ Do we need a #JeffreeStar review of the new @Jaclynhill Highlighter Collection?? STAR KUSH BDAY 🦂 \nLast night was perfect and one for the books... I’m still high 💚 https://t.co/Ghw6M1STU3 I can’t stop eating birthday cake 🎂 NEW VIDEO ALERT 🔥 Reviewing Forever 21’s #Cheetos makeup collab... 🥴 Watch for the full tea: https://t.co/NxV0Kqw8aT Goooood morning everyone!! 😱 Who is ready for a brand new video today?? ⭐️💖🔥💚 #BirthdayBitch https://t.co/ugWMb60u0M RT @tacobell: @JeffreeStar Happy Birthday! We hope this year is fire. 🔥 RT @cynelectric: Happy birthday to one of the kindest souls ive had the pleasure of watching grow. You are an inspiration not only to the m… HUGE THANK YOU to everyone for all the birthday wishes and messages!!!  😭😭😭 This has been the craziest year of my life and I’m so grateful for every second of it 💯 RT @MorpheBrushes: Wishing a Happy Birthday to the ICONIC @JeffreeStar!! 🥳💖🌟🎂✨- From the Morphe Fam, xoxo 😘 https://t.co/WTyk5mq0ym RT @beautybay: Wishin' a huuuuge Happy Birthday to our ICONIC alien queen @JeffreeStar 🎉👽🔥 We hope your day is as SICKENING as you are 🙌⚡ h… @shanedawson Thank you for just being you… Love you so much ⭐️🐷 RT @shanedawson: Happy Bday Jeffree!!!! ❤️❤️❤️ https://t.co/Xd6SvAeZia 🦂🦂🦂🦂🦂🦂🦂🦂 Public Service Announcement: Make sure to check on yourself. How are we all feeling tonight? ✅ @Eugenia_Cooney 🙏🏻🙏🏻🙏🏻 @ChantalAlicia @shanedawson 💖💯🔥 I’m currently at Forever 21 right now shopping for the Cheetos makeup.... 🙃🔥 RT @shanedawson: working on the last epsiode of the jeffree series now. i don’t wanna give a day cause i don’t wanna disappoint anyone if i… RT @RedCassie81: My piggy family is complete!!! ❤❤ #ShaneDawsonXJeffreeStar @shanedawson @JeffreeStar ain't they cute?! https://t.co/8PoS5P… RT @Rainbowmom_Momo: Perfection😍🐷 @JeffreeStar @shanedawson #ConspiracyPalette #amazing https://t.co/YGMgxb2kH0 Do we need a Jeffree Star review on the new Cheetos makeup collection?? 🤯😂 That liquid lip set looks expired the house! https://t.co/E0lXk8phu3 In the makeup lab working on 2020... 🔥🔥🔥 #JeffreeStarCosmetics https://t.co/QMfPViKFY8 Hi everyone, how are ya?? This week you are getting a brand new episode of the #ShanexJeffree series 🤯🖤 Can’t wait to keep expanding #JeffreeStarCosmetics ⭐️ Going to need a lot of new employees in 2020 🏗 Don’t ever underestimate the underdogs 💯 @msmariapreda 💯💯💯 Gooood morning everyone! How are we all feeling today? 💯 Remember today is a federal holiday, and our offices are closed! We will begin resuming shipping orders tomorrow morning! RT @JeffreeStar: NEE VIDEO ALERT 👁 Time to sit down and tell you guys what’s been going on... 🐷 What @shanedawson deleted from the series:… I’ve been contouring my face with shade #TanaCon from the Conspiracy Palette 🤯 My cheekbones have never looked so soft and blended in my entire life 🥺 @Tonya_Stylz @shanedawson That inner corner is the cherry on top!! 💯🔥 RT @SadGirlenergy: Me trying to get people’s attention @JeffreeStar https://t.co/Cn95g7X6Tp It’s a highlighter palette from the brand @CTilburyMakeup 😂 It was sent to me in PR and was a gift! Love the formula ✅ https://t.co/CNFMvJedVS @brit_mun @shanedawson Amazing!!! Wow 🔥💯 RT @Jadelols: @JeffreeStar @shanedawson how are ya #ShaneXJeffreeStar https://t.co/Em6cvcHRQI NEE VIDEO ALERT 👁 Time to sit down and tell you guys what’s been going on... 🐷 What @shanedawson deleted from the series: https://t.co/bnPGzW4mvt These pig swatches of the #MiniControversy palette are so fucking cute 🐷⭐️😭 https://t.co/suRech3EIx NEW VIDEO TOMORROW on my channel! 🐷⭐️ FENDI PRINTS ON 💖 https://t.co/u9q52tfxCt OMFG in just 24 hours both Liverpool and Newcastle makeup classes are SOLD OUT ❌ https://t.co/2V3SJc0myj If you don't build your own dream, someone will hire you to help build theirs 💯 When two icons finally meet... 💉👁 #ConspiracyPalette #BloodSugar https://t.co/yjdjsyJHDC The #JeffreeStarCosmetics shipping centers will be working overtime on Saturday and Sunday this weekend. Our only priority is making sure all @shanedawson x JSC items are shipped in a safe, timely manner! I know it’s hard being patient but Shane really broke the Internet! Gooood morning everyone! ⭐️ SHIPPING UPDATE for all #ShanexJeffree orders from my website: we had one of the biggest launches in makeup history, we started shipping this Monday only five days ago and need 5 to 8 more business days to be close to being caught up! @betsyHuey1 @shanedawson @MorpheBrushes 😍😭🙌🏼 Finally filming a new video for my channel right now 😍😭💯 I’m sitting down w. the #ConspiracyPalette to talk about some serious life shit while I create a makeup look 👁 Video up Sunday. Omg @shanedawson’s merch store will be restocking some items today starting at NOON PST / 3PM EST 🔋 Who’s ready?? TICKETS are NOW ON SALE for my makeup masterclasses w @MMMMITCHELL 💖 Ireland, UK &amp; Amsterdam 🎟 Shop: https://t.co/xYMSGJLPf4 https://t.co/i1ZG6EKy0r @cohlsworld Thank youuuu! 💖 @ThreeDailey I’m ready!! ⭐️⭐️⭐️⭐️⭐️ I know my pink vault was just completed 6 months ago but... my mental health is way more important than a closet 💯 We found our dream home and our hearts are ready for a change 💖 Omg we are officially in escrow as of today!!! 😭 hi new beginnings, how are ya?? 🏰 The shade “Pig-Ment” in the #ConspiracyPalette is my new favorite blush to wear! Try it and you won’t turn back 🐷 @trishapaytas Can we get married next? Nate and Diva gave their approval, they want me back before Christmas! @2020predicts Someone else will be enjoying it, whoever buys the home… Time to build something bigger and better! I know it was only finished a few months ago but we are ready for a big change 🙌🏼 @EthanDolan 💯💯💯 RT @shanedawson: In honor of the “unnamed green shade” killer merch made me a green pig hoodie!🐷💚 out this friday https://t.co/egMPcAvzqU!… THIS Friday the @shanedawson merch store is restocking some items!! 🐷🔋 Also there will be a limited-edition emerald embroidered pig hoodie 🖤 Launching at Noon PST 🐽 https://t.co/08FA9TB60V We found the perfect new house only a few miles away but it’s more private, has everything we need and room to grow for our family 🤞🏼 Praying everything goes perfect! Next week Nathan and I are putting up our house for sale! 😱😍 We are ready for a big change... 2020 let’s fucking do this. HEY UK &amp; EUROPE, HOW ARE YA? 💖 Myself and the amazing @mmmmitchell are coming back BIGGER &amp; BETTER. We had the best time last tour, so we had to do it again 🔥 Can’t wait to see you all!!! 👽 TICKETS ON SALE THIS FRIDAY ON TATTI Lashes WEBSITE, 8AM! 🎟 https://t.co/IbwbsU8EKm @abigailchamblee @shanedawson @HanTyson This made my day 😭😭😭 RT @shanedawson: this is so cool!! :,))) https://t.co/dbyVUUYJkE Omg my birthday is in 9 days!!! 😱 #Scorpio #Nov15 Yessss! I love looking at the stages of birth 🛸 #ShanexJeffree https://t.co/uhZFq6vdXE @ColeCarrigann THIS IS EVERYTHING. OMG all 60,000 units of the #ConspiracyPalette have sold out in 26 minutes.... WOW. There are some Mini's left!!!! RT @KFinneagan: @JeffreeStar BITCH I FUCKING GOT ONE!!!!!!!!! I’m literally jumping up and down in my break room at work!!!!! I love you bo… The #ShanexJeffree Palettes are now up for pre-sale! 👁 This next batch will start shipping end of November and finish by December 12th! 🐷 SHOP: https://t.co/NdycBo1E19 🍏 https://t.co/dgLgiVqyHu Gooood morning everyone! 🖤 RT @sahaakhanxx: I am in awe @JeffreeStar @shanedawson u guys absolutely killed this, down to the tiniest detail!. To have watched this jou… @Abby_Mcfall We wish we could make more faster but it’s humanly impossible, but I really appreciate you saying that 🥺 thank you for being patient Thank you so much for saying that!!! I’ve never been more proud of something in my entire life 💯 https://t.co/VR8CKdyE1n @HerendiraHerna2 Yes! Episode 7 of the series is coming soon &amp; will show you everything that happened on launch day and all future plans.. It’s Shane and I, so expect the unexpected. The #Conspiracy collection is permanent. Thank you all so much for the biggest launch in our entire careers! 😭🤯🥺 UPDATE on @shanedawson merch store: This Friday Nov. 8th his store is restocking Black and pink embroidered logo hoodies! 🐷 Also the Conspiracy hoodie &amp; tee plus both phone cases! 🐽 All other items will restock on #BlackFriday ⭐️ TOMORROW... 👁 Pre-Order goes up for Conspiracy Palette AND Mini Controversy Palette! We have 60,000 units of each being made and they will start shipping late November going into early December 🐷\nFULL collection restock will happen early 2020! Watch my IG story for the full tea I’m announcing and discussing the #ShanexJeffree Collection restock plan on my Snapchat and Instagram Stories in 20 minutes 👁 RT @Eugenia_Cooney: Omg this completely made my day! Thank you so much for sending me your collection Shane! I am SO grateful. This is so g… Hi everyone, how are ya??? I will also be able to answer this question later today!! Hoping for some of the hoodies and stuff to be back this week! 🐽 Stay tuned! #shanedawsonmerch https://t.co/k8GnJ3E1T8 @kreativekow @siemer_ben @louisroqueiro Exactly! I’ll have more information soon 🥰 @LouMC1983 @louisroqueiro 😭😭😭😂😂😂 @TheReal_Gem @louisroqueiro 🙌🏼💯 @sTANAandfriends @louisroqueiro Thank you for saying that, this collection is permanent and we will keep making it as long as you guys want it!! 👁 @louisroqueiro I guess you didn’t watch our series, where we literally show you it takes months to manufacture that volume of makeup lol I have 5 separate meetings today about restock options for this month and 2020 for the #ShanexJeffree collection 🐷⭐️ Give me until later today to have some real answers for everyone!! Omg you look dreamy 💯🔥 Makeup on POINT!! https://t.co/NWUSIMP3mz RT @Nick_LGrant: Bearded and Glossin’\n#Shanexjeffree https://t.co/MzSKh4EYRd I can’t stop watching this! 💖⭐️ https://t.co/wAiRiLZoIZ @itsbretneybitch 😭😭😭💯🔥💖 WE ARE SELF MADE 💯 @shanedawson @AndrewSiwicki https://t.co/soHsopGDef RT @shanedawson: a day i’ll never forget :,) https://t.co/vx8gxGNzWp In the next day or two we will be announcing all of the statistics and records we broke from the #shanedawsonxjeffreestar launch 👁❌ It’s truly mind blowing and on the business aspect, fucking next level. Episode 7 will also show it all and what happened in the first 5 hours 🤯 OMG I'm watching reviews all morning!!! \nLove you @mytouchofglam 🔥 https://t.co/4csd1LD5Gp Seeing everyone’s swatches has me ‘happy crying’ in my bathrobe right now 😚 https://t.co/t0ZnkovepW Thank you for believing in us!! 🛸🐖 https://t.co/6nDnLCyACY Reading this makes my entire day 😭🥰 Going to watch right now! https://t.co/g6s2UNVql2 We will be addressing everything tomorrow! Have to wait until Monday to speak with all of our manufacturers 😫😍 https://t.co/HBqlOTMlTj 😭🙌🏼💯🥺 https://t.co/2j8DDPr3hu You did us proud babe!!!! THANK U for the love! 👽😍 https://t.co/oCpP6uCWPM I love you @shanedawson 🐷⭐️ We made history this weekend 👁 https://t.co/650mNdiSQV RT @mallofamerica: Hey, do any of you #MorpheBabes know these two who are hugging? 😉 @JeffreeStar + @shanedawson are #FriendshipGoals! #Sha… RT @gavinthomas: Congrats @shanedawson &amp; @JeffreeStar !! #ShaneDawsonXJeffreeStar https://t.co/y0pYHVC581 Omg NIKKIE!!! 😭😭😭 Check out her new video serving you TWO looks from the #ConspiracyPalette 👁 https://t.co/BUwRB2CWiL @ThreeDailey @TeaSpillYT You do you baby!! Thank you for all the love 🙌🏼 Giveaways are so fun Good morning world!!!! Shane and I are so speechless from yesterday’s magic!! Can’t wait to celebrate today with everyone 😭🐷⭐️ https://t.co/yj4rfQMdbA This has been the craziest day of my life 💯 RT @shanedawson: we’ve been traveling all day so my phone hasn’t been working much but i can’t wait to see all the feedback when we get to… RT @shanedawson: the pics look so pretty 😭❤️❤️❤️ https://t.co/3kH3Gu47k6 RT @shanedawson: Hey guys!! Shopify has almost fixed everything and the site seems to be working (a little better) and the mini controversy… Just landed in Minnesota and tomorrow is our @mallofamerica meet &amp; greet at the @MorpheBrushes store!! 👅 #shanedawsonxjeffreestar https://t.co/QhAgaCdvMu The website is starting to work again and the #MiniControversy palette is FINALLY up!!! 🛸 SHOP: https://t.co/NdycBojfpJ 🐽 #shanedawsonxjeffreestar I can confirm now that every single unit of the #ConspiracyPalette has sold out ❌ I’m so proud of you @shanedawson!!!\nThe website issues have us devastated but thank you all for being patient!! 😰👽 #shanedawsonxjeffreestar Before the full #shanedawsonxjeffreestar collection could even go live, you guys broke the site 😭😱 Not all of the products went live when we launched.. We are currently fixing all issues on our end and praying that @shopify can get back on track shortly 🐷 RT @cynelectric: Now that I finally was able to complete my order from @shanedawson and @JeffreeStar ..I'm dreaming of the day that it come… RT @TheStreet: Youtube stars @shanedawson and @JeffreeStar 'Conspiracy' cosmetic release runs into technical issues as @Shopify support att… We are waiting for the website that hosts our store to be fully restored, this is out of my and  #JeffreeStarCosmetics control as we wait 🤯 I’m so sorry everyone! This is the craziest launch of my fucking life!!! #shanedawsonxjeffreestar https://t.co/lv8BN1BAxv This is all so fucking crazy 🥺 You guys broke the internet and #Shopify 😭😭😭 Site is starting to slowly come back to life RT @AshlyeKyle: Why am I so proud of @shanedawson and @JeffreeStar for breaking the internet? 🤣 I hope Shane sees now how loved he is!!! #S… OH. MY. GOD. 🤯 RT @GytanaRoze: @JeffreeStar 16 minutes into the launch and the site is still down. I’m having a mental breakdown,he is having a mental bre… You guys CRASHED the site! Shane’s in a ball crying on the floor. Working on getting everything back up!!! #shanedawsonxjeffreestar We are now 10 minutes away!!!! HOLY SHIT!! 😭😭😭😭 #ShaneDawsonXJeffreeStar RT @axschei: 1 HOUR BIIIIITCH 🤩⭐️🐷 #ShaneDawsonXJeffreeStar #ConspiracyPalette RT @shanedawson: 😭🐷❤️🌟 https://t.co/g3O1Wueiop TWO MORE HOURS!!!!! 👁🤯 #shanedawsonxjeffreestar RT @shanedawson: Today’s the day our whole year has been leading up to. :,) i’m so grateful for every step of it. T MINUS 3 HOURS! 😭❤️ #Sha… HOLY SHIT!!!! Omg @shanedawson today’s the day... this all feels like a crazy dream!!! 😱👁😭🤯😍 https://t.co/RseilwgKNb @majag133 @shanedawson @mallofamerica Omg 😭😍🔥 Yasssss!! Omg seeing your guys at the @MorpheBrushes stores lined up has me so emotional!! 😭 I can’t believe today is finally here #shanedawsonxjeffreestar https://t.co/FoFAJ4CgDY Good morning world!!!! It’s officially #ShanexJeffree Day!!!!! 👁 We’re officially four hours away until the launch!!!!!!!!! 🐽 We are less than 12 hours away!!!!!!!! 🐷😱 #ShanexJeffree Oh my god I’m deceased!!! 😭😭😭🐷 You’re the GOAT!! https://t.co/ltNGIXnIvs RT @Ryland_Adams: I can’t believe I’m a lipstick!!! Shop the entire conspiracy collection tomorrow morning at 10am!!!! https://t.co/SDXrRuz… There’s no way I’m getting any sleep tonight!!!!!!! 👀🐷⭐️ No offense to Halloween night, but can it be November 1st already????? 😇👽 Thanks!! #ShanexJeffree Please still come!! We are giving out extra meat &amp; greet tickets in person to random people!! 👁😇👀 https://t.co/u7R9C6c70R See you Saturday!!!! 🐷⭐️ https://t.co/C5L4Ty9J7v @RayvinEh @shanedawson Yes! ICONIC!!!!!!! 😭😭😭🦂 https://t.co/GnDOZ53Rnr 💖⭐️💯🔥 https://t.co/kYoShIx370 RT @JeffreeStar: Here is everything available in the #ShanexJeffree Conspiracy Collection 👁 \n🖤 The Price List: https://t.co/qMA0FQzeh2 RT @MorpheBrushes: ONE 👁️MORE 👁️DAY👁️! #JeffreeStarCosmetics' The #Conspiracy Collection of @shanedawson  X @JeffreeStar launches TOMORROW… @TheeSamRios @shanedawson 🥰🙌🏼🔥 @classickarseat @MorpheBrushes @shanedawson Yes they will have the full collection! Only lip balm and pig bundle are exclusive to JSC website! 🐽 @Gothangel1997 @shanedawson We have no way of predicting how fast it will sell, tomorrow could be the only time to get it this year! @Guadalupe3163 @shanedawson Yes there will be! The @shanedawson x #jeffreestarcosmetics lip balm is hydrating &amp; infused w vitamin E. It’s diet root beer scented 🐽 Exclusive to https://t.co/d98OC5U6so 🐖 https://t.co/JrJNx8SpfL Zoom in on the sets and check out all the details! Shane wanted everything to be perfect and the JSC team KILLED it with him! So proud of every single image we took. #ShanexJeffree https://t.co/2jN8FAFej0 #ShanexJeffree velour liquid lip shades ‘Shane’ and ‘Are You Filming?’ 💄👁🖤 What shades do you HAVE to get tomorrow?? https://t.co/pXjTnll6LH Here is everything available in the #ShanexJeffree Conspiracy Collection 👁 \n🖤 The Price List: https://t.co/qMA0FQzeh2 OMG WE ARE LESS THAN 24 HOURS AWAY FROM THE LAUNCH!!!!!!!! https://t.co/l47p1mZc0o Happy birthday to my #Halloween baby, Drama Lynn Star 🎃🐶🎂 Our daughter turns 2 today and I’m so blessed to wake up to that loving smile every morning #StarFamily https://t.co/gImXFaDEvB The devil is in the details... 👁 The #ShanexJeffree Pig Liquid Lip box set retails for $90 or you can buy each #velourliquidlipstick individually 🐷 11.1 🐽 https://t.co/C0FU7F3rDf Introducing... Shane Glossin’ clear gloss in my iconic THE GLOSS formula 🖤 Retail: $18.00 👁 Vegan. Cruelty-Free. Diet Root Beer soda scented. 👀 Launching THIS Friday with the entire #Conspiracy Collection! #ShanexJeffree https://t.co/Gst28A2eZb RT @shanedawson: I just woke up after sleeping for like 14 hours and i’m catching up on all the feedback and it’s making me cry. i’m just f… Life has given me so many trials and tribulations every step of the way on this insane journey… One thing is for certain, I can’t be broken. Being abducted by aliens while Shane watches holding his pet pig... 🐷 I’ve never had as much fun on set shooting makeup campaigns!!! Thank you @shanedawson for believing in my brand and taking the creative direction to the next fucking level!! 👁 #ShanexJeffree https://t.co/1RjSVpzoT3 RT @mallofamerica: @MorpheBrushes @shanedawson @JeffreeStar Ekkk! We can't wait. Bring on the #ShanexJeffree Collection! 😍 This Saturday @shanedawson @AndrewSiwicki &amp; I are all flying to Minnesota to celebrate our launch!!! 🖤 Come see us at the @MorpheBrushes store in @mallofamerica!!! 👁 Enter to win the meet &amp; greet here: https://t.co/Geu1vxU7ql ⭐️ https://t.co/NUjh1rVv9N RT @krasirose74: I was just now able to see the new @shanedawson @JeffreeStar #ConspiracyCollection reveal and I’m not even half way throug… RT @MMMMITCHELL: Just when I thought I couldn’t fall in love and look up to a human more than I already do, @JeffreeStar &amp; @shanedawson pos… We are STILL filming!! 😭 We want to show the truth and behind the scenes of launch day.. Shane’s huge meet &amp; greet this Sat. and ALOT more 🐷 https://t.co/zxiEOqQoCV I only slept a few hours last night… I kept tossing and turning knowing we are only two days away until the #Conspiracy collection launch!!!! 😭👁🤯 How are we all feeling about the reveal??? 🐖 RT @JeffreeStar: I’ve never been more proud of a project in my entire life... 👁 Here is the #ShanexJeffree Collection reveal!!!! https://t.… RT @Blorange_Tiger: Let’s give these 4 the attention they deserve. #ShanexJeffree #Conspiracy 👁🖤 https://t.co/RCCJ7JArlT I’m rewatching the part in the factory seeing both palettes being made and I’m sobbing like a little bitch right now 😭😭😭 #ShanexJeffree @sassyy_sierra @shanedawson @AndrewSiwicki YES!! @MorpheBrushes The #Conspiracy Collection 👁 Honestly I couldn’t have asked for a better person on the planet to collab with 💯 Thank you  @shanedawson for giving this project your entire heart and soul! 🐷 #ShanexJeffree \nAnd thank you @AndrewSiwicki for being there every step of the way. https://t.co/lEfI5oWNW4 RT @shanedawson: i can’t stop crying. :,)))) i cant believe it 😭😭 https://t.co/niiux5gZxC I can’t believe everyone is finally seeing our baby... I love you @shanedawson 🐷⭐️ #ShanexJeffree I can’t stop crying 😭😭😭😭😭😭😭😭 HOLY SHIT!!!!!!!! 😭😭😭😭 #ShanexJeffree I’ve never been more proud of a project in my entire life... 👁 Here is the #ShanexJeffree Collection reveal!!!! https://t.co/kcgW5PPog1 RT @TeaSpillYT: Who’s ready for part 6?! #ShanexJeffree RT @shanedawson: Uploading!!! :')))) https://t.co/cqUA97WlIY RT @shanedawson: Video will be up a little later today! Last minute thing i wanted to change and i just don’t wanna have any regrets about… We are 2 hours away until the #ShanexJeffree reveal!!!!!!!!!!! 🔥 RT @KEEMSTAR: Dudes it’s so awesome to watch you make this product @JeffreeStar &amp; @shanedawson ! I don’t think you understand how many youn… RT @__ateIophobia: love him or hate him, jeffree star is a fucking beast when it comes to running his businesses. a true business icon Yesss!!! 😱🥰 We can’t wait to see everyone!! 🐽 #ShanexJeffree @mallofamerica https://t.co/irW4lhAqxR @norvina1 💯🦂 Omhomgomglmfomgomgggggg good morning!!!!! 😍😭😇🐷 Today is officially the #ShanexJeffree Collection REVEAL DAY!!! Video will be up soon… And it’s our longest video in the series ever!!! 🤯 @itsmePHANES I don’t have time to review trash on my channel! @babygurlshepp @MorpheBrushes @shanedawson @mallofamerica 🥰💯 @Confused_Ari67 @MorpheBrushes @shanedawson @mallofamerica The collection will be available both online on my website and in all @MorpheBrushes store locations and their online store! 👁 @KEEMSTAR @shanedawson I really appreciate you saying that 💯💖 RT @HayleyyyLouise: Honestly this made me tear up! I’m so glad through all the beauty &amp; bullshit they have each other @JeffreeStar @shaneda… RT @shanedawson: https://t.co/cd89P1Ng5k Also.... @AndrewSiwicki is still filming 👀 This week will be one of the most insane weeks of our lives 🤯 #ShanexJeffree Just for the record, @_morganadams_ is perfect and I never want anyone to ever make her feel low again 💖 You’re beautiful just the way you are 💯 @TeaSpillYT @_morganadams_ I’ll text you the names 😒🦂 THIS SATURDAY NOV. 2ND Shane &amp; I will be doing a huge meet &amp; greet at the @MorpheBrushes store at MALL OF AMERICA in Minnesota!!!! 🐷⭐️😱 I cant believe I got Shane out of the house again this year! Come celebrate our collection and meet us 👁 info to enter will be up Wednesday https://t.co/iGAYbKwYkZ @KimBran06045296 😭🔥🐷💯 Special announcement coming in 30 minutes… 😇🐷 I can’t wait for @shanedawson to reveal the final and finished #Conspiracy palette &amp; collection tomorrow! 👁👻💖🐷⭐️ #ShanexJeffree Who else NEEDS the #ShanexJeffree liquid lip pig box?? https://t.co/Dd8LVQKUzH Who’s watching right now???? ⭐️👁😱😭🐷 Use #ShanexJeffree to give us your live responses!! I’m so emotional right now!!! Hi, crying on my couch, how are ya??? 😭😭😭 #ShanexJeffree Grab a @redbull and a snack... I’m really anxious about Part 5 🤯👁🐷 Here we go. https://t.co/v7LJ4wzEIR RT @kamm_lester: Good afternoon! 👽 I’m ready for part 5 of the @shanedawson &amp; @JeffreeStar series. I ordered my panera bread. 😊 Time to handle some fucking business and get ready for Friday 👁 https://t.co/9Adyc0Dxca Goooood morning everyone! 🤯 Who’s ready for Episode 5 today??? 🐽 Shhhh... Friday is almost here 👁 #ShanexJeffree https://t.co/hKf5rzixb4 Hi.... We are only 5 DAYS AWAY until the @ShaneDawson x #JeffreeStarCosmetics Collection launch!!!!! 🤯🐷🦂⭐️👁 \n\nPart 5 &amp; 6 of the series goes up tomorrow &amp; Tuesday!! 🐽 #ShanexJeffree @norvina1 @Sephora Wow it looks so beautiful!!!! You never cease to amaze me 🦂🔥 caI can’t wait to see everything in person ⭐️ RT @shanedawson: 2 Part Reveal Mon and Tue 🐷❤️🌟 https://t.co/aUl36aIeLs High on the beach 💚 @AshlyeKyle That is extremely not normal!! Omg I wish I could fly in right now and do your makeup 😭😭😭 It’s almost midnight and I’m doing someone’s makeup right now ⭐️ I love creating and just playing with makeup with no restrictions.. 💖 EVERY $1 donated is one tree planted! 💚 #TeamTrees is a movement and their goal is to plant 20 million trees in 2020! 😭🙌🏼 Help if you can: https://t.co/dtFHP4NH7n 🌲 @MrBeastYT thank you for starting this movement, it’s really incredible and I just donated! Can’t wait to see how far this goes 🙌🏼 This is fucking incredible! I just gave $50,000 to plant 50 thousand trees 💚 Spread the word and help our planet 🙏🏻 https://t.co/X9118gn40R HALLOWEEN VIBES ONLY 👻🎃 https://t.co/GqywE4wBnj Instead of having breakfast this morning, I’m going shopping 💳 We are officially one week away from the launch!!!!!!!! Oh my god 🦂🐷 #ShanexJeffree @whimsical_spfx_ @shanedawson Not until after the makeup collection launch! @Etf_lover_money @shanedawson Yes #afterpay will be available! Don’t worry... The next 2 episodes ARE the reveals 😭👻😇 So much happens.. I’m anxious!!!! https://t.co/FOH9lSOMaa After the weekend @shanedawson and I will reveal the entire #Conspiracy collection and the actual final eyeshadow pallets! We have a lot more to show you before Nov. 1st!! 🐽👁 RT @btvsvixen: @JeffreeStar The year of 🐷🌟 is in full effect I'm living for it. Thank u &amp; @shanedawson for taking us on this journey into t… @thedevilzangel_ @shanedawson Both 💯 @blackxwollf 🎃👻🖤 YES!!! 🔥 The #ShanexJeffree Collab will be in ALL @MorpheBrushes stores on launch day!!! 👁 Hi Nov. 1st are we ready?? https://t.co/AhN40Ibt7p 🐷⭐️ Pray for California 😭🔥🙏🏻 So many fires have started today... Everyone be safe! https://t.co/95BORN8J6y The Conspiracy Collection 👁 Coming Friday Nov. 1st 10am PST to #jeffreestarcosmetics and all my online retailers 🐷 Parts 5 &amp; 6 of the @shanedawson series on Mon &amp; Tues! #ShanexJeffree https://t.co/iL41esXT00 The world is ready King!!! 👁🐷🐽 https://t.co/CoLHONbrX4 Girrrrrrrrrl... Good morning! 🖤 Rule number 8,543: NEVER suck dick with black lipstick on, it never looks cute after 👅🖤 @MMMMITCHELL Highhhhh girlies!!!! @beautybakerie @MorpheBrushes Omg welcome to the family!!! This is the best news I’ve heard all day 🔥😭🙏🏻⭐️ High, How Are Ya? 💰 https://t.co/4z4lbWULQ9 Happy Scorpio season!! 🦂🦂🦂\nMy birthday is Nov. 15th, how are ya? Today’s wisdom: Thank God for the block button 🙏🏻 @TeaSpillYT Saw him twice last year and it was one of the best shows I’ve ever seen!! How are we all feeling today?? Make sure to take some time out for YOURSELF and take a deep breath bitch. I can’t wait for the world to see the #Conspiracy palette ⚖️🐷⭐️ 11.1.19 #ShanexJeffree https://t.co/46axOpkhK7 RealiTEA. Gooood morning everyone! Nathan made me breakfast in bed and surprised me w a bouquet of cannabis 😭💚 I love waking up to his smile every morning 🙏🏻 @norvina1 💯💯💯 Nothing shocks me anymore in this insane dark beauty world.. We need more honest in 2020 or we're gonna have a problem. THIS MAKES ME FUCKING SICK!!!! Brands having their own employees post fake reviews to manipulate the customer. Huge lawsuit was settled today... 🤮 Wow. The FTC is not playing games: https://t.co/zNBPU9Yv0Y https://t.co/cOFjRW7bN0 @Fuffani 🎃🙌🏼💯🔥 Da Vinci makes it hard to leave the house! 👅 #StarFamily https://t.co/F1IYPE5Wjl Hahaha this is the first thing I see this morning when I open my phone 😭😱😂 https://t.co/OAlKGjoXx8 RT @shanedawson: sorry i haven’t been on twitter today. been editing the next episode with @AndrewSiwicki and squad. https://t.co/nGsOHe0i0D RT @TeaSpillYT: me when the exposed song comes on https://t.co/ZNUN4VpN1k @ChrissyGlamm Omg my bday is the 15th!! That is epic 🙏🏻 I can’t believe #Scorpio season is almost here... 🦂 November is also my favorite month of the year 🔥 This is so amazing!!! WTF!! 🐷 #ShanexJeffree https://t.co/Pzl0L8kjwD Who’s gonna be #JeffreeStar and @shanedawson for their Halloween costumes?? 👁⭐️ RT @analisa_mua: I cannot believe the @JeffreeStar x @shanedawson palette will be out before my wedding! You know damn well I’ll be buying… @jessienicholle @shanedawson Tell her congratulations!!! Omg 😭😭 @Elite_DarkLordd @Trendmood Email customer service and we will send you a new one!! 👻 The spooky and blinding Halloween #MysteryBox Skin Frost shade 🎃👻 This was only available in the medium size box and will never be made again! 😭 Next Mystery Box launch will be on #BlackFriday next month ❓ \nPhotos: @Trendmood https://t.co/AK0ckueZmU @JenLuvsReviews Always 💯 And auto correct changed *poor handling in my last tweet sorry 😭 @JenLuvsReviews I pride myself on my customer service team and all anyone has to do is email a photo of the broken product and we will send out a new one. No tea, just for handling from USPS but we prepare of these moments and always have extra stock for CS issues like this! @JenLuvsReviews the black splatter is for Halloween aesthetic purposes haha it’s spooky and has a ghost on the shade label, just like the jawbreaker highlighter I wanted to do something fun! A few hundred out of a VERY large amount arrived broken sadly What was everyone’s favorite moments from Episode 4?? #ShanexJeffree \nI can’t believe we are less than two weeks away until the launch!! ⭐️ Watch your mouth young man. I was trained by Sheev Palpatine 🗡 https://t.co/g092ZEAY4B @hiiroxanne @willoutsmokeyou @torilzalenski @shanedawson Two different buildings that are next-door to each other with two separate teams! The new Killer merch building will be shown in the next episode!  🐷 The #JeffreeStarCosmetics &amp; #KillerMerch teams have been shipping all day long and we are 90% done with shipping #MysteryBox orders and 100% shipped on all @shanedawson merch orders!! 🐷⭐️ I’m so proud of my crew, time for huge bonuses and celebrations 🙌🏼 I’m scrolling on Instagram and found this amazing special effects artist, look at how realistic this is!! 🐷 The new @shanedawson logo is already legendary 🐽 https://t.co/tXOxWsvRBX @bradmondonyc You must of been reading my mind! @Alison_626_ @shanedawson @killer_merch Omg you look incredible 😍😭 @MMMMITCHELL You are one of a kind 💖💯🙏🏻🔥 KNOW YOUR OWN WORTH!!! 💯 @ohvalerieshouts @MarlenaStell 💯💯💯 @kamm_lester @poutbeautybar You look fucking incredible babe!!! 😫 I want everyone to win… Anyone I’m friends with in the industry, I’ve only wanted the best for, helped them in any way I could and give them all of my contacts… But money makes people evil and I’m so grateful that I don’t have that dark mindset 💯 There are brand owners that behind the scenes, have told makeup labs not to work with me or give me certain formulas… Can you imagine being that insecure? You know who you are, and all of the disgusting behavior that goes on behind closed doors really needs to stop - Management @beautybay 👁😍🐷😘 @REVERSALYOUTUBE 😱👁🐷🙏🏻⭐️ @Lyssuhh7 I’m so down with that idea!!! Hence the reason why JSC has never done a brand trip 💯 But a customer trip?? LOVE that idea!!! Brb https://t.co/YzzPPtsOMn @MarlenaStell 200%!!!! It’s crazy to watch from the consumer stand point.. seeing someone else on an exotic island doesn’t make me want to buy a product 😂 Dear makeup brands, everyone including me is tired of seeing influencer brand trips... you shouldn’t need to fly 45 people out to a foreign country to sell some mascara… The way the industry works needs a major overhaul, the industry is stale so wake the fuck up ✅ I can’t believe how many people love seeing the business side of the beauty world… 😱 I’m always insecure and think it’s not entertaining or interesting, but you guys have proven me wrong again and I can’t wait to share more.. So much to tell and so many secrets 💰⚖️💄 It’s the year of the pig 🐷 #ShanexJeffree RT @DigisectChris: When @JeffreeStar stopped an important business meeting to play a music video and dance on the chair, I felt that on a s… @Jess_angelle7 No, we make them one time only, next time we will do them again will be on Black Friday next month! 💖 The #ShanexJeffree Collection launches officially on NOV. 1ST at 10AM PST / 1PM EST ⭐️ It will be available on my website and ALL #JeffreeStarCosmetics retailers! 👁 Who else needs a Nathan pillow??? They’ll be on my website soon 😭🙏🏻😍 #ShanexJeffree #episode4 😭😭😭😭😭🐷 https://t.co/QntVJkPDIX Smear campaign. Robbery. Flop. 😱 #ShanexJeffree RT @Tonya_Stylz: Two weeks from TODAY!!!! #ShanexJeffree https://t.co/4ERpEMGq2l RT @ThreeDailey: you’ve really got to give it up to @shanedawson @AndrewSiwicki and @JeffreeStar they’re literally showing us everything th… RT @queenSdawson: the palette comes out in 14 days. 14 DAYS. WERE GETTING A SHANE DAWSON X JEFFREE STAR PALETTE IN 14 DAYS HOLY FUCK LET TH… RT @crysxtxl: We love a headbanger 💗💗#ShanexJeffree @JeffreeStar https://t.co/0WPZgIy9NQ 💯👁🐷 #ShanexJeffree https://t.co/zzXHocduBg Who’s watching right now???? 👀👁😱😭🐷 Use #ShanexJeffree to give us your live responses!! We’re not whores... we’re engaged sluts 😫 - #ShanexJeffree Time for a rollercoaster of anxiety and beauty... here is episode 4 🐷⭐️ https://t.co/EJHCkdhrgW Today we are announcing in Episode 4 the launch date for the entire @shanedawson makeup collection &amp; #Conspiracy palette!! 👁⭐️ Buckle in and get ready... #ShanexJeffree This is the cutest photo I’ve ever seen!! Hi #ShanexJeffree Halloween costumes!! Omg 😭😍🙏🏻 https://t.co/OILGIQDwlY Magic Star really is that bitch... ⭐️💦 https://t.co/DWoJfu7wRX RT @maddyshadowss: I am watching the truck from my apartment building waiting for my @JeffreeStar Mystery Box to come off RT @shanedawson: omg yay!!!! 😭❤️ https://t.co/wwqWxoj92G RT @shanedawson: Part 4 coming Tomorrow!! \n#ShanexJeffree https://t.co/XJcBXAwbeu @ChrissyGlamm 💯💯💯 Protect your energy at all costs. ✨ @Nick_LGrant Can’t wait to see you wearing it!! 🐽 @ChrissyGlamm Yesss you know I just want the customer to get their things as fast as possible!! We are running full day and night shifts and I’m so happy with how fast it’s all getting out 🔥 @innesahb If you bought multiple boxes, they ship separate!! 💯 Goooood morning from the #JeffreeStarCosmetics shipping offices!! 👁 My team has let me know we are 50% done with packing #MysteryBox orders!! 🐷 We are also 1/3 or more of the way done shipping Shane’s merch!! Who’s ready for episode 4??? 👁⭐️🐷 @KEEMSTAR @shanedawson The hoodie is free but the palette will cost you $500K! 💰 Working on a few huge new videos right now for my channel… 😇 I wanted to take an upload break and let everyone enjoy my new series w Shane and focus on that but I’ll be back VERY soon with a couple new videos next week 🔥 PS. I want everyone to know that @shanedawson will be restocking his merch store very soon! Today was one of our biggest launches EVER for @killer_merch and we are so proud!!! 😍 Wow what a beautiful day 😭😭😭🐷😭 RT @shanedawson: I’ve never sold out of anything before in my life. Thank you guys for being so supportive today. i’m crying and in total s… OH MY GOD!!!!!!!!!!!!! 🔥 Shane's merch is selling out so fast I'm so fucking proud of him!!!!! SHOP the brand new @shanedawson merch store!!! 🐷⭐️ -&gt; https://t.co/cMKxBQdMkQ https://t.co/tIctTwRWc8 👀 Gooood morning everyone... How are ya?? ✨ @shanedawson @Jaclynhill @RichLux713 It’s a must 💯 Tomorrow is Shane’s new MERCH website!! Hoodies, back packs, clothes 😇 The makeup launches on a different date and w. #JeffreeStarCosmetics 👁💖⭐️🐷 https://t.co/4jk87eSfKp TOMORROW @shanedawson is dropping his new MERCH store!! 🐷😇 OMFG who’s ready?? https://t.co/ib3DgN6PbV I’m wearing #MidnightLick THE GLOSS right now 🖤 https://t.co/fKDiamYBjw @GraysonDolan Gooood morning! 💯💖 🧟‍♂️ My limited edition zombie #CantRelate tee is perfect for the #Halloween season 🕷 Available while supplies last! 🖤 \nShop: https://t.co/HKuAB5O8OO https://t.co/1NsJRJNcyh RT @shanedawson: The Dangerous World of Jeffree Star\nhttps://t.co/DDoiMv76rp\nthis one means alot to me. hope you like it :')) https://t.co/… RT @jackkeyy: I want my only wardrobe to be Jeffree Star tracksuits OMG @shanedawson this is so amazing I’m deceased 🐷😭⭐️ We love you!! https://t.co/szJzaztcbj We have a new member of the family joining us very soon.. 🐷⭐️ @shanedawson #ShanexJeffree https://t.co/eMyP0UqCUe Gooooood morning everyone... It's Sunday and it's time to wake and bake 🔥 One of my favorite days of this entire year… Oh my God it’s all happening 😭💖🙏🏻🔥 #ShanexJeffree https://t.co/53Os6HbreJ RT @xo_brittanyyyy: I’ve never seen so much different emotion in a video. Thank you @shanedawson &amp; @JeffreeStar for providing us the most r… I can’t wait for everyone to see the final collection!! 👁 You worked so hard on this project and put your entire heart and soul in it.. couldn’t be more grateful to work with you &amp; Andrew on something so special 🐷😍 https://t.co/xn8LUzqNnZ RT @SouthernSnack: How cool and unique as a consumer to be able to watch the entire production of a product from start to finish and then g… RT @blankaleal: Nate telling Shane the process of getting shades approved literally made me want to die. So. Fucking. Cute. #TheBeautifulWo… What’s your favorite moments from today’s episode?? 😢😍🐷 I’m still sobbing brb #ShaneXJeffree RT @erinkdarling: Also the #ShaneXJeffree palette(s) is/are literally going to be in my possession faster than Shane can say “are you filmi… RT @maddibarber1: Shane and Ryland's love is so real. That proposal part.. then the Diamond and Daddy part.. my heart.. so many emotions af… RT @selfhappily: SHANE REALLY MARE ME CRY THOSE LAST 7 MINUTES #ShaneXJeffree https://t.co/3GGUpkSp1N Just warning you all now... @shanedawson created THE palette of the year with me 😇👁🙏🏻⭐️ This fall and holiday season is going to be beyond iconic. #ShanexJeffree RT @shanedawson: omg my hearts racing and i feel like its going to explode. hahaha i hope u guys like todays video. so many emotions. :')))… Hi emotions, how are ya? It’s time to dive in... Buckle up 🤯👁🖤 https://t.co/IDZrivsh5k 👻 Shop the Halloween #JeffreeStarCosmetics mirrors and limited edition shirt: https://t.co/HKuAB5O8OO https://t.co/YrP4GI8ArC It’s almost time for Episode 3 😇 We dive in deep and there are so many emotions involved 🤯 Who’s ready?! The Deluxe and Supreme #MysteryBox’s are officially SOLD OUT! 🎃❌ Only Premium is left!!!! 👻 This is way more crazier than summer and I’m shook 🤯 Omg y’all almost broke my website 👻🧟‍♂️ #MysteryBox #Halloween HALLOWEEN MYSTERY BOXES ARE NOW LIVE!! 🎃🕷 SHOP: https://t.co/HKuAB5O8OO https://t.co/wmzr3Cx2G5 @SassierStella Every box has an exclusive shade of some thing. 😇 @CorbittSkylar We start shipping them immediately and are usually done in a week or less! ￼ @kgbeautyxo Yes of course!! @Rose32721194 Yessss!! 👀 @Ashley8Marie @shanedawson 💯💖 OH HIIIII... The Halloween #MysteryBox launch is in 4 hours!!!! 👻🎃 Don’t be late... 🕷🖤 What size are you getting tomorrow? 👻👀🕷🧡💀🖤 #MysteryBox #JeffreeStarCosmetics \nPS. Yes, AfterPay will be available tomorrow and the Supreme box has FREE U.S shipping! 🧟‍♂️ https://t.co/SbMDp6D1nH Tomorrow: 🎃 10AM PST #Halloween Mystery Box launch \n⭐️ 3PM Episode 3 of #TheBeautifulLifeofJeffreeStar (time pending @shanedawson) So many memories here but it might be time for a change. A lot of tragedy.. 💔 Time to build a bigger vault 💖 https://t.co/ryf7lbJqY7 Nathan and I have been house hunting all day 👀 We don’t know what the future holds but it might be time for something new ⛲️ There are 2 exclusive new #VelourLiquidLipstick shades for the #Halloween Mystery Boxes 🎃🕷 ONLY available tomorrow and will NEVER be made again!!! 👻 Launching tomorrow on our website only!! 🖤 10AM PST / 1PM EST  \n https://t.co/8HlFpy7Dg0 Good morning everyone… I’ve only been up for an hour and I’ve already cried, laughed and had an asthma attack. 🤯 How are ya? Time to watch a scary movie and eat too much ice cream 🧟‍♂️👻🍦 This is my favorite photo I have on my phone 🙏🏻💯 We’re missing them every second of the day https://t.co/4hG3I1F2MH Fuck. https://t.co/5SKVO4L1gQ I would really love for someone to come on my channel and let’s film a video transforming me into something fucking spooky and scary 😇🖤 How is everyone doing today? 💖😌 @basicbeatch Da Vinci was helping me w the lighting 😌 I love the fall vibes and the #Halloween makeup looks 🎃🖤 New Star mirrors launching THIS Friday 💀 Full orange will be a mystery box exclusive, the black one will be for sale by itself! 🧡 #JeffreeStarCosmetics https://t.co/9rEXuN1VIC It’s ok to have moments of hopelessness and doubt. That’s normal and don’t let anyone else tell you otherwise 💯 But you can’t let those thoughts consume you, you have to push forward no matter how hard it is. RT @courtneysburps: what if jeffree star had a kid??\nlike imagine being 5 and seeing a small jeffree star walk into your kindergarten class… HAPPY F🧡CKIN’ HALLOWEEN!! 👻🎃🖤 THIS Friday Oct. 11th our most insane #MysteryBox release ever!!! Buckle in and get ready for THREE different boxes. ALL with an exclusive item or ITEMS inside ⚠️ Mystery Halloween liquid lipsticks, merch and more 💀 What box is on your list?? https://t.co/aqgYSoDnM2 I wouldn’t want to be on this roller coaster with anyone else 👁🎃💯🔥 https://t.co/KkprSiU6fR 💯💯💯🔥🙏🏻 https://t.co/fZS3GftSGJ @CoartneyMeade @shanedawson Wow that means so much to me and us, thank you 💖 I know people associate drama with brand issues sometimes, but I only want the best for the CUSTOMER and that’s rare these days. I called out brands and was called a cunt for my honesty.. now people are seeing the full truth and finally get it 💯 https://t.co/WdKJUSzmPb That behavior is no longer tolerated and the standards must change.  ⚠️ So happy to have created a company with people who only want the best for everyone 💯 https://t.co/2HhtmHBDRx Business and beauty are my 2 favorite things.. 🙏🏻 So happy to see everyone liking the business aspects of the makeup industry… We will definitely be showing a lot more 👀 https://t.co/etmaXsfKOu Good morning everyone... Would love to get my mind off the sadness 😌 Can we all discuss Episode 2... What were your thoughts?? 👁 ALOT happened w @shanedawson and so many truths revealed I’m not okay but I’m good. 💯 It’s hard to breathe and the grief feels like a ton of bricks. 2 of our children gone in just 4 months is unbearable but they’re together playing and Diamond isn’t alone now. Our family is mourning but we are strong &amp; will somehow get thru this 🙏🏻 https://t.co/N63gW48Duc Nathan and I know that Daddy and Diamond are together watching over us 🐶🐶 My heart breaks in a million pieces thinking about not snuggling with him tonight. Thank you everyone for all the prayers and messages, we are so grateful for you all 😢 #RIPDaddyStar #RIPDaddyStar 💔 With heavy hearts we have to share the devastating news that our dog Daddy passed away early this morning. His body couldn’t handle the surgery + the complications of his medical condition. I can’t put into words how much we love our pets and how much this hurts https://t.co/qIDcFVQy4u RT @PHORAONE: you’ll outgrow a lot of people when you start doing what’s best for you.. Daddy is out of surgery and is stable! 🙏🏻 The doctor said it went as good as it could have gone and she’s hopefully.. He’s so strong and I’m praying he recovers well. On my way to see him right now!! Thank you everyone for all the prayers and messages. 😔😌 Flying back to LA right now. Praying Daddy’s surgery goes perfect 😔🙏🏻  I’m so scared The reason we are really scared is because Daddy has an auto immune deficiency in his brain and has been on medication for months which suppresses the body from fighting back and makes surgery very risky… I truly can’t believe this is happening. I can’t believe that I’m even typing this right now but our dog Daddy has to have immediate surgery &amp; has an abscess in his liver... 😟 The doctor just told Nate and I that he has a 50% chance of living… I’m so fucking devastated and wish I could trade places with him right now RT @AndrewSiwicki: For several reasons... this video means a lot to me. I hope you all enjoy it :) https://t.co/i1h31ww8Wo 😭😭😭😭😭😭😭 Everyone deserves to know and feel their own true worth 💯 Here we go... Grab a @redbull and buckle in ⭐️ https://t.co/2dtq8Pk7eN 👻👀😫💖👁 https://t.co/aVINHM8rBl @gabrielzamora 💯💯💯 RT @gabrielzamora: time is money and my time is valuable. I spend my time with you, cus I’m investing in us Tomorrow is going to be insane 🤯 Who’s ready for Episode 2 of #TheBeautifulLifeofJeffreeStar??? 💀👻 In the makeup lab right now working on 2020 🔥🔥🔥 #scorpioenergy #hihowareya? @MisterPreda End of story!!! #ReturnToSender 💯 PS. Can I come over and play with the puppies soon? If you're going to send me a PR package in hopes I help sell your boring, bland makeup, make sure you've said at least 2 words to me in the last year... Which you haven't. Thanks - Management #ReturnToSender Everything happens for a reason 💯 Who’s ready for #JeffreeStarCosmetics Halloween Mystery Boxes?? 👻🎃💀🖤 Release date and info coming soon... RT @enews: Shane Dawson's YouTube Series Reveals a Side of Jeffree Star the Beauty Community Has Never Seen https://t.co/ETEBNF0q6Y RT @etnow: After months of anticipation, @shanedawson, @JeffreeStar, and @AndrewSiwicki's have shook the Internet with 'The Beautiful World… Seeing all of the amazing feedback and first day response to the series has me feeling so unbelievably grateful 😭💯🔥💖 Episode 2 goes up on Friday and you are all about to embark on one of the craziest journeys of @shanedawson &amp; I’s entire life 👁 RT @shanedawson: thank u guys for the love on ep 1. i was really nervous about it so knowing u guys connected with it is the best feeling e… Just waking up... 👀 Good morning world, how are ya?? In my world, business always comes before pleasure. #thebeautifulworldofjeffreestar Who's already waiting for Episode 2?? #TheBeautifulLifeofJeffreeStar Mob boss mentality. #TheBeautifulWorldofJeffreeStar I live every day like it's my last.\nI don't have a fear of dying... I have a fear of not living out my dreams. No, you can't have the bodyguards, they're mine ❤️ Who’s watching right now???? 👀😇😭🔥💯 Here is Episode 1 of The Beautiful World of Jeffree Star 🍭⭐️💖 -&gt; https://t.co/r18FodrGUF\n\n@shanedawson @AndrewSiwicki Omgomgomgomgomg. RT @CandeeGlam: Impatiently waiting for @shanedawson to upload 👀 so excited!!! ❤ @JeffreeStar #thebeautifulworldofjeffreestar 👀🔥🍓👁 https://t.co/H3DI1ImeaA How are we all feeling tonight??! I’m so excited and anxious for tomorrow!!! 😇 At the end of the day, the truth is all we have. The fall season is here bitch... Can’t wait to see all the Halloween looks from everyone!! Feeling peachy today.. 🍑 Getting my makeup done by the color king @MMMMITCHELL https://t.co/KTO4Gd9Dtd RT @btvsvixen: Just a reminder that @shanedawson @JeffreeStar @andrewsiwicki are legends who spent 9 months filming an iconic series for us… TOMORROW 👁 Tuesday is almost here... 🔥😭 The first episode is an HOUR LONG. Hi, how are ya? https://t.co/2aPDFgvkv5 RT @hmsors: @JeffreeStar @ultabeauty @MorpheBrushes LOVE LOVE LOVE LOVE ❤️❤️❤️ https://t.co/KcwEufXuhO Goooood morning everyone!!! 🔥 Happy Sunday, time to wake and bake! Nathan and I are watching #LivePD and reading DM's in bed and maybe eating Cinnabon delights RT @IAnthonySmithI: @JeffreeStar You know what’s life changing ? This upcoming series on October 1st https://t.co/elvl8jvD5n She’s a pretty hoe! Shade ‘Millions’ on the lid is life changing 🔥 https://t.co/8urcbikZJl Hi @ultabeauty 🍓 Time to shop all weekend and visit my display!! Send me pix if you see the @MorpheBrushes x JS collection in person! https://t.co/9cW5CLIIPl Me pusieron mal de ojo 👁 https://t.co/GoKjatht3R RT @MorpheBrushes: Get your full beat ready @JeffreeStar style. 💖💖 #MorpheBabe @Evita424  is giving us a PINK fantasy with the full #Morphe… Hi makeup porn! How are ya?? 🍌 https://t.co/ci2A4f1YAq @kamm_lester How did you sleep gorgeous?? I miss you!! 💦🍑 https://t.co/6UVCBQSBgs A national icon 🍓💯 #BloodSugar https://t.co/ILlc5Zf6Tf @JarrodMUA hahaha yes it does! #thevault Omg Nathan &amp; I had a threesome last night and I broke a nail 😭💀 #rip #noregrets https://t.co/FC7fuYTIgm The formula for #MagicStar will change your life! ⭐️ https://t.co/EeUVb0eSLJ I’ll search for a spot tonight! 😂🌝 https://t.co/79xlTFDVtT @JessicaBlevins Come play with me!!! I really want to get a tattoo soon 😇😭 So many new @MorpheBrushes stores opening!! 💖⭐️ That means more places to buy #JeffreeStarCosmetics in person! 🔥 https://t.co/HLtZ1asePe 👀🎃👻 https://t.co/EegStq1L3x RT @StuckwishAngel: This is dreams are made up ⭐️ @JeffreeStar  @jeffreestarcosmetics #JAWBREAKER https://t.co/Xt84CLncL9 WE ARE 5 DAYS AWAY UNTIL OUR NEW SERIES #TheBeautifulLifeofJeffreeStar STARTS!!! 🔥 Time to rewatch the first series and bake cookies https://t.co/xp5ir5i8dh @shanedawson @AndrewSiwicki Stop giving a fuck what other people think about you.. it’s stunting your personal growth and you have so much to offer 💯 This is a subtle reminder that you are worth more than you think you are. @beautybay 💦⭐️ OMG this made our day!!! 🤯🐷 https://t.co/f24iy6V3JP 🍭💖 https://t.co/aBUfW0XUE1 @GraysonDolan SAMEEEEE ugh I can't breathe I'm so congested =( @KeshaRose We are all fucking ready!! 🔥 RT @saydcalg: Jeffree Star in a track suit reminds me of Sue Sylvester WHO'S READY FOR OCT. 1ST????? 👻 My new favorite anthem… This is fucking iconic 🤯💯🔥💖 https://t.co/CvmHEx2fLD @MoistCr1TiKaL brb watching now 👀 @Tonya_Stylz Your first class ticket to Calabasas is waiting for you, let me know when to book it!! Time for some beauty education 💄 Class is now in session! 💖 https://t.co/YkugGRJpTb I made myself some tea, and this is what happened 🍵😂 RIP to the #Versace robe https://t.co/iM9XmnUNyE RT @Shalfanonzo: Shoutout to @JeffreeStar concealer and powder that holds up through a crying session lmfao RT @shanedawson: so overwhelmed and happy that you guys are liking the trailer. :,) back to editing!! wish us luck! see u on Oct 1! https:/… 💯 @hashtagcatie you are one of a kind! 💯 RT @Katie_Jore20: @shanedawson @JeffreeStar here I am minding my own business and suddenly I’m sobbing over this trailer. 🖤 I hope you’re all ready for the next chapter... 💯 Thank you @shanedawson &amp; @AndrewSiwicki for changing my life. It’s been a crazy fucking year... https://t.co/NX1v11dYcT Gooood morning everyone!!!  👁 👄 RT @shanedawson: I can’t believe something we’ve been working on all year and put all of our hearts in is finally starting to come out tomo… Hi everyone... Tomorrow @shanedawson is revealing the trailer to our next documentary series 💄💄👁👁 I’m so fucking proud and excited for our next journey together... RT @sashx_: 5 hours later and I’m still watching @JeffreeStar YouTube videos. RT @MissyElliott: Not everyone will be happy for you  when you doing good🤷🏾‍♀️ and that’s ok🙂 you just stay MOTIVATED and KEEP ON MOVING!… Hi gorgeous!! 🔥💖 https://t.co/qOWQKu2S4C Wake and bake 💚 @anthoni_hardie 🧁 @EthanDolan 💯💯💯 Today is our last day in Michigan... Time to get back to LA and prepare for the FALL season!!!!! I’m so excited for everything coming up 😫😇👀🖤 RT @AllTimeHockeyFn: Mom: “here’s an Ulta as”\nMe: *gasps* it’s @JeffreeStar! \n\nGod i love the $3.50 coupons. https://t.co/cQg8nKCVex Hi makeup porn! 🍓 https://t.co/WyTkSLPnEk 💦⭐️💖 https://t.co/qmmWqwODeP RT @MonikaLoren: The cutest combo ❤️💙 @JeffreeStar https://t.co/FfIavDSM77 RT @Nikitajade96: @JeffreeStar my new favourite combination - Christmas Cookie and Shockwave 😍😍 #thegloss #jeffreestarcosmetics https://t.c… HI UK, the #MorphexJeffreeStar collab is here at @BootsUK!! 🍓 https://t.co/nyDsMwdT3H The FALL #Chrome Star Mirrors Are NOW available! ⭐️ Shop: https://t.co/U8eFsuROC8 https://t.co/MKOp21p2Od High, How Are Ya? 💚 RT @xxnikimariexx: Just got my @JeffreeStar Magic Star concealers &amp; they're as amazing as I expected them to be 🙌 #holygrail https://t.co/Z… Ok I’m baked too. It’s 1AM and I’m baking cupcakes 🧁 🏆💖 https://t.co/ZIBaAhfJo4 How are we feeling about today’s review everyone?? 💯🤘🏻 https://t.co/naMOSK0UsJ RT @wtfxsilasss: Me explaining to my other personalities what the agenda is today. @JeffreeStar https://t.co/g1TH5sUNeC These chrome mirrors are launching TOMORROW!!! 💦⭐️ https://t.co/BUkpSMoDY7 This next chapter will be insane... ⭐️ Saddle up. https://t.co/LZGrK0U4aJ @veronicam4591 the grind never stops!! I'm not going anywhere, get used to it. 💖 RT @starlessgalaxy: I'm loving the liquid eyeshadows omg @JeffreeStar  I live for your reviews https://t.co/y5lN3yH3u0 RT @jemimamua: @JeffreeStar being shook https://t.co/7aKpCMk4ei RT @breemae98: @JeffreeStar smelling the makeup is one of my favorite parts of his review. For someone, like myself who's skin is sensitive… RT @jinsofabhooker: @JeffreeStar 💓💓💓 https://t.co/8A2Cazdm9i RT @_AliDilsoz: I'm done with this Mood!!😂\nIconic @JeffreeStar's honest review time! https://t.co/qpe0ld2rNx @bissett_morgan @ladygaga OMG!!! THIS IS SO COOL haha hi!!! 🍵 NEW VIDEO ALERT! 🍵 Is @ladygaga’s makeup line #HausLabs Jeffree Star Approved?? 👀 WATCH: https://t.co/shDoTpyAbu OH HIIII 👀 https://t.co/j1dbTydsaY 💦⭐️ #MorphexJeffreeStar https://t.co/QBjbLjUQYI I had a meeting with the mayor of Grandville, Michigan today 💯 Can’t wait for 2020 https://t.co/42kjj7IQ0j RT @EthanDolan: Just 2 bros being baddies ☺️🤭 https://t.co/sczQRfH8i8 @cortyp22 I would go with shade Ice Queen! You really fucking did!!! 💖💯 https://t.co/xHgaXGQsMb TOMORROW NEW MAKEUP REVIEW on my channel!!! 🔥💯 The tea is hot!!! I’m adapting to my new life so well already #JeffDolan 🥤 https://t.co/p4HQGfqSvF omg just found this old video doing my makeup on autopilot hands free.. 💄it was one of my favorites to film hahaha https://t.co/2APvY4Hlar Literally flawless and that eye look is next level 🔥💯 https://t.co/UfCi6bMjHI RT @ItssBrittanyyyy: Sorry hubby, you’re being replaced 😍😍 @JeffreeStar #JeffDolan https://t.co/HnPH7r8PB4 ⭐️ STAR SIGHTING ⭐️ This Saturday I’m launching 5 new #chrome Star mirrors!! What’s on your list? 💖 https://t.co/J8e2MgJi4M GOOOOD MORNING!!! Here are the BIRKIN BAG and @MorpheBrushes x #JeffreeStar PR winners!!!!!! 🔥🔥🔥 https://t.co/rJ6a7cY3lx RT @CNN: YouTube personality Jeffree Star got a makeover, and his fans are saying he's unrecognizable https://t.co/M81Eo4nOH0 I just hit 16 MILLION SUBSCRIBERS on my @YouTube channel!!!! 😭😭😍 I’m truly so grateful for every single one of you... THANK YOU for allowing me to just be ME. That’s all I could ever ask for 💯 RT @gagaimages: Beauty Guru @JeffreeStar will upload his review of Haus Laboratories this Friday. His opinion is considered the most respec… @Beth_Lynn21 @imjustdimitri @GraysonDolan @EthanDolan I’ve picked no one, she’s lying lol 🌝 @AshlyeKyle Omg those look so good 😭😭 No one panic but I’m announcing the #Birkin &amp; @MorpheBrushes x #JeffreeStar PR package winners TOMORROW morning!!! 😭💯😇 Jeff Dolan For President! https://t.co/AIiRibQqSY RT @pumpkyy: @esilv01 @JeffreeStar like im not convinced jeffree aint 2 people somehow https://t.co/LsnMLvNZ0K RT @maddie_ballone: the aliens when they hear we’re raiding area 51 @JeffreeStar https://t.co/MdntuE2toQ RT @cocopantz: I’ve literally watched @JeffreeStar becoming #JeffDolan three times since it came out yesterday because it’s the funniest fr… RT @esilv01: Why is #JeffDolan EVERYTHING we didn’t know we needed??😍😍😍 @JeffreeStar please explain! 😘😘😘😘 Who’s ready to lift? 🤙🏻 @GraysonDolan @EthanDolan https://t.co/YqE1QQtt0J #FREEBRITNEY 🙏🏻 RT @meluhdeejayd: jeffree star: what’s up everybody welcome back to my channel✨✨✨ \n\njeff dolan: what’s up broo...what’s good?🤜🏼🤛🏼FuCk yEahH… @ColeCarrigann @MorpheBrushes Oh my Fucking GOD!!!! 🔥🤯💖 Stealing husbands worldwide... ⭐️ The Star Triplets Are Here!! \n💛 Watch @EthanDolan &amp; @GraysonDolan switch lives with ME for a day: https://t.co/kYeMWztOmh https://t.co/SGYkxri6YV How are we all feeling about my new video with the twins?? 🤯💪🏼😇 My new alter ego may need to make another appearance soon.. https://t.co/EJHV48Hw1x @gagamonster96 @itsgodgabitch @ladygaga The PR team sent me the products to my Michigan house! @EthanDolan I’ll take a cotton candy C4, thanks man!! 🤘🏻 Goooood morning bros!!!!! Just put down my contour brush and headed to the gym… 🤘🏻#JeffDolan 😂😂😂😇💪🏼 https://t.co/TlnxMXIP9y RT @Loeybug: My sexuality is Jeffree Star with brown hair RT @debb0r: So like, is Jeff Dolan single or what.. @JeffreeStar hook up a sister! RT @EthanDolan: My role model, my hero, my big bro. https://t.co/ZvdqNKyXcU When your makeup is perfect ✅ https://t.co/jn9o5VT26U @gabrielzamora The absolute worst!!!! 🌝 RT @JessicaBlevins: @JeffreeStar @EthanDolan @GraysonDolan I’m a little shook at how sexy Jeff is. Anyone else? 😭😭😭😭😭😭😭🤯🤯🤯🤯🤯🤯💯🙏🏻💪🏼🔥 RT @GraysonDolan: THIS WEEK’S VIDEO IS UP!!\n\nFt. @JeffreeStar \n\nI was really nervous before filming but I can honestly say it was one of th… RT @brocksgray: WHY IS JEFF DOLAN TRENDING IN THE US? @JeffreeStar @GraysonDolan @EthanDolan OMG JEFF DOLAN is trending worldwide on Twitter 😂😂😂 Watch me transform into @EthanDolan &amp; @GraysonDolan’s brother and switch lives: https://t.co/SF1kPJuo9W Hey bro, how are ya? 💪🏼 RT @Iyaz_White: This video has me so confused... like do I want to sleep with @JeffreeStar now ? https://t.co/3BdgGqsdsf RT @nurialondra: jeffree star who? I only know jeff dolan RT @_trashcandan: Holy shit the @JeffreeStar &amp; @EthanDolan @GraysonDolan videos have got to be the best videos I’ve seen on YouTube in awhi… Finally the secret is out... I’m @EthanDolan &amp; @GraysonDolan’s older brother 🤙🏻 https://t.co/jEMw6kUNtN @MarlenaStell I live in Grand Rapids and am here for another week! Let's do dinner! @curtistriesmkup omg hi @RheaLitre hahah would you hit it? RT @rockiesem94: “Fuck press powder, we’re pressing benches! Let’s do this.” I’m dead!! 😂😂 @JeffreeStar @EthanDolan @GraysonDolan https://t… 😱NEW VIDEO ALERT!!!💪🏼 I switched lives with the Dolan Twins... Introducing Jeff Dolan:  https://t.co/SF1kPJuo9W RT @EthanDolan: this Tuesday is gonna be a crazy day...😳 Omg this is so fucking cute!! 😭💖 https://t.co/xERvj4sXr6 @norvina1 hi, how are ya? @facecination It’s not! Shane will be announcing that himself! 🔥 I’m so nervous and excited about today’s video that I might piss myself 😂😫🤯 It will be up at 1PM PST / 4PM EST on my channel Yassss new Morphe launch!! 💯 Don’t forget to use code JSTAR at checkout for 10% OFF ALL Morphe products 🔥 https://t.co/dsW5mUYUO0 Since I'm in Michigan still, I'm missing the @ladygaga makeup launch party tonight! Do we all still wanna see if @hauslabs products are #JeffreeStarApproved? 🤔 I need to know the real tea... 🖤💯 https://t.co/SZXL3rBjOO Tomorrow I'm uploading a new video and it's one of the craziest things I've ever filmed... Life changing 🔥\n\nBitch buckle in. See you all tomorrow. Omg try it and let me know what you think! 🖤 https://t.co/xeckvVRNHF I’m in Michigan still and sadly will be missing it! https://t.co/BqQGtBmHKk RT @_AliDilsoz: What's that? LMAO😂\n@JeffreeStar https://t.co/YKg5PPttNe @BboyEZeh he remembers that exact moment haha that's cool RT @thatgirlcase: Current mood... at work today @JeffreeStar https://t.co/rmmZwuXUEE RT @itsNICKSNIDER: It’s ok to unfollow people in real life. RT @britt_pitts12: In bed sick today! @JeffreeStar to save the day! 💗💄🍭🍬 https://t.co/d3nZ4L3Axi @ChrissyGlamm haha and there were some hidden gems right in front of you!! How are we feeling about today’s new video? 🌝🤯 I’m still shook!! https://t.co/MbL3M6gH6o She's a pretty bitch! https://t.co/HbzjibyjoR I just had one of the best grilled cheese sandwiches in my entire life.... 😭😱 I’m gonna need a minute I flew in a tattoo artist to our house and Nate’s mom is getting a portrait of Dad right now!! 💉✈️ I love family bonding RT @colby_dubois: @JeffreeStar My face when my professor asks for the assignment I didn’t do yet https://t.co/WxIZ3Gcsyo RT @AFatGirlForNow: Ok y’all, the Do Not Disturb sign is officially on.  It’s time for the new @JeffreeStar video!\n#hihowareya https://t.co… RT @jemimamua: my brain while i watch @JeffreeStar ‘s new video instead of doing my homework 😬😂 https://t.co/tCVJcSGKef @businesspapi @MorpheBrushes 😂😂😂 throw it out miss thing!!! RT @BrookeYahne: Nothing like waking up to a new @JeffreeStar video. https://t.co/K0K5pscwvl RT @CassandraBeni16: AND I OOP- @JeffreeStar @JeffreeStar. 😂🖤 https://t.co/5r7HJmjFhr Guess it’s time for a 20 min break 😇 https://t.co/wTjQxvOFYx @levmalin1 yes!! @minterxsugg YES!!! 2 actually! RT @_AliDilsoz: @JeffreeStar https://t.co/F9dPRblJ4T RT @Jenna14738: When someone tells you a story but changes important details forgetting you were there\n@JeffreeStar https://t.co/kHrMdgs3pW ⚠️ NEW VIDEO ALERT!! 😱 I tried #DollarGeneral makeup for the first time!!! Jesus take the wheel... https://t.co/SwxJITer2E \n⭐️ How to enter the #Birkin giveaway is in the intro!!! OMFG who’s ready for today’s new video and giveaway??? 😭🔥😇🙏🏻😱 HI!!! How Are Ya? 😇🔥 In tomorrow’s video there is a huge giveaway! Grand prize for 2 winners: A brand new #Birkin bag!! \n6 runner ups: The entire @MorpheBrushes x #JeffreeStar collection!! https://t.co/vFqZPMKBfV Love you gorgeous 🔥 Thank you for coming today!! https://t.co/IaYrNaftJH RT @NicoleR0berts: @JeffreeStar  working it with his flawless spin 😍 yaaass queen ! https://t.co/bZNivZYY7M RT @AmandaHayley15: Sometimes when I’m laying in my bed and I’m too tired to wash my face I think about Jeffree star standing over my bed w… Goood morning!!! 🔥 Happy #Ulta meet &amp; greet day!!!! See you all soon!! https://t.co/doRI6y1ArH 🌝 @montysarah_x 💯🔥 @bell_alexx @ultabeauty Happy anniversary beautiful!! @Thekillermonsta @GerardCosmetics @RichLux713 @MorpheBrushes You are so stunning!! 🔥😭 Hi UK, how are ya!? 🇬🇧 https://t.co/qeWvgsgUDM STAR-BERRY OBSESSION 💦🍓 https://t.co/axRWwjgG5W When I made Michigan my second home, my goal was to bring more makeup culture and excitement to this city and show my love! THANK YOU @ultabeauty &amp; @MorpheBrushes for even letting me do an event at a store in a smaller town. It means the world to us! @trishapaytas @ultabeauty @MorpheBrushes Meeting people who support me is one of the greatest things! I’ll be doing this until I’m 80 in a pink wheel chair haha 💯💖🔥 Love you Barbie girl I'm so fucking excited for tomorrow's meet &amp; greet in #GrandRapids at @ultabeauty! 🔥If you didn't win a ticket, don't worry! We give away tix &amp; free makeup all morning! Come celebrate my @MorpheBrushes collab and join us! RT @therealedsonh: @JeffreeStar We Stan a #JeffreeStarCosmetics restock. Hi #MagicStar concealer in every shade! 👋🏼 How you doin’ girl? 💫 h… @BourneSadie @basssnectarinee yes ma'am, I live here as well and wanna bring some magic to our beautiful city that is sometimes forgotten! @TeaSpillYT it's a lesson from God to act like a cunt?? Wow, you learn something new every day!! RT @dylmaybe: JUST ORDERED MY MAGIC STAR CONCEALER 🤪💫 #pumped @JeffreeStar RT @JennVix: @JeffreeStar @JeffreeStar I just got my #MagicStar Concealer, in shade C5! I can't wait to try it! RT @emelielagerfoto: FINALLY!! Just ordered two wands of #MagicStarConcealer in the shade C6. My life/makeup routine is complete again. ✨🙏✨… RT @barriga_jocelyn: @JeffreeStar Just bought my #MagicStar concealer!!!! @bigbro_trash yessss!! hope you love it! @makedajbrowne yes love! we are expanding our shades soon and adding ALOT more! 🔥 SHOP all 30 shades of my #MagicStar concealer: https://t.co/t6JsSVYe6w https://t.co/Vf9UG4S9hD This is so amazing and cute!!! I’m honored and shook 😭😭😭🙏🏻 The tattoo artist killed it! https://t.co/i9G692ss2v @Amy_1322 I would never get my nails done out here, thank God I live in LA too!! Haha 😱 Gooood morning everyone!! 🔥😭💖 My massive #MagicStar™ concealer restock is in a few hours!!!! Who’s ready?? RT @AndeCarr: Omg I won the meet and greet for @JeffreeStar 😆😆😆 I never win anything! I’m beyond excited to meet a mf goddess! See you tomorrow!!! 🔥🙏🏻 https://t.co/GN7cYc3Jej RT @__RosyRodriguez: I WON THE MEET AND GREET TO MEET @JeffreeStar OMGGGGGG RT @OceanLenthall: @JeffreeStar The formula is unlike any other, best concealer ever! Jeffree never disappoints 💕 https://t.co/2ARCZjOBfA RT @suzettecindy: @JeffreeStar TALKING ABOUT MAGIC STAR concealer, I use it on a daily basis 😅💕💕💕💕💕 https://t.co/8fLpZkQKvX OMG tomorrow is the FULL restock of all 30 shades of my #MagicStar concealer!!! 💯 https://t.co/Hn1PJUBxfI Omg I have an urge to buy new makeup, time to head to the mall! 😇🌝 @NikkieTutorials Yesss we are so ready!! Who’s ready for this week’s schedule?? 😇\nFriday: #MagicStar concealer restock!!\nSunday: Dollar General makeup video + huge giveaway\nTuesday: Videos with the Dolan Twins! My asthma is really bad today… 😫 Hi lungs, get it together. Thank God for Cracker Barrel blueberry pancakes 🥞 @TeaByAli Wow this is really scary... 🤯 Who else was hunger after watching today’s video? 😭 https://t.co/Q4omn8a93F RT @BurgerKing: @JeffreeStar hi, how are ya Come thruuuuuu Michigan weather!! 🌪 The tornado sirens are sounding off outside and the rain is crazy 🙃 RT @samiism: He actually stopped fussing when this @JeffreeStar and @shanedawson video came on 😂 https://t.co/gihuKpIKWb RT @jemimamua: aww little vinci 🥰🥰 @JeffreeStar https://t.co/CUQ89Tkdpw RT @BelleGrass: @JeffreeStar @MorpheBrushes thanks for making my new favourite palette 🌟💗😘 https://t.co/WXUqDBCL5l RT @jemimamua: @JeffreeStar when there’s a pickle 😂😂 https://t.co/aUSowb5spL RT @Kayla38889747: @JeffreeStar @BurgerKing @JeffreeStar THIS GUY 😂😂😂 https://t.co/vlld2bajmT RT @RebekahNLuv: @JeffreeStar @BurgerKing Watching it right now!!! https://t.co/lW2n6P3rFV RT @ReinaDeLablahh: @JeffreeStar @BurgerKing When Jeffree said he'd land the flight for icing I was like https://t.co/6hKGsIp5Ut HI GRAND RAPIDS, How Are Ya? 💖 THIS Saturday I’m doing a huge meet &amp; greet at @ultabeauty to celebrate the @MorpheBrushes x #JeffreeStar collection!! ⭐️ Wanna meet me? Enter here: https://t.co/F53DuwYXih https://t.co/PxKhPlaRg4 RT @Sydney_Goodaker: I can’t 😂😂😂 squidward or  @JeffreeStar ??? https://t.co/qescbqqUhC ✈️ NEW VIDEO ALERT!!!🍔 Nathan and I do a @BurgerKing mukbang with all 5 dogs! 🍟 Is the Impossible Whopper #jeffreestarapproved?? WATCH: https://t.co/WXqIjfYURa Goooood morning everyone!! How the fuck are we all feeling today?? ⭐️ Why is it 11:30PM and I’m driving to @meijer to get peanut butter cookie dough to bake 🍪 The munchies just hit.... 🥛 FINALLY... ⭐️ THIS FRIDAY we are restocking EVERY shade of my coveted #jeffreestarcosmetics #MagicStar concealers and color correctors! 😱 Our 5 star formula comes in over 30 shades and leaves you flawless 🔥 Launching 9.13 @ 10AM PST / 1PM EST https://t.co/ZymguZXGUP NEW VIDEO UP TOMORROW... 😫✈️ We find out if the #ImpossibleBurger from Burger King is Jeffree Star Approved... and our 5 dogs join us 🐶 https://t.co/FamIMBxR8h Every day I’m blessed with these faces and I’m so in love 🐶 https://t.co/Nu59XJQuXR I’m about to film something I’ve never done before… 😱 A FULL face of @DollarGeneral makeup!! I can’t believe they have their own beauty line!! Should I be scared? @_megfinnegan05 Yessss 💯 Waking up to a lightning storm and rain is the best… 🌩🌦 So happy to be back in the Midwest!!! Time to wake up Nate and start the day 💥 Sorry but @milanicosmetics &amp; @elfcosmetics have the best drugstore foundations out right now, don’t even try me 😇 What’s everyone’s current fav?? Looking for new products always! 🤓 Omg it’s almost midnight here in Michigan and I’m out driving around drugstore makeup hunting 👀 I wish common sense was more common. 💯 @ThreeDailey @NyxCosmetics I really need someone to make it make sense before I go to sleep tonight!!! 😂😂😂 @makeupbymyke @NyxCosmetics @limecrime Exactly. @omandalyssa 💯🤯 @PRAY4THEWlCKED It’s called ethics, they didn’t tag lime crime so anyone with common sense would assume those lipstick colors are theirs… Stop trying to make excuses lol you on their payroll? Do these brands really think we’re stupid? @NyxCosmetics just tried to act like these old @limecrime lip swatches were there’s and deleted it after I said something... 🤮 girl, byeeeee. https://t.co/vrJtQDYQVx My world 💖 #StarFamily https://t.co/ozJKLjqSvT @elizabitch1997 We tried it for the first time today!!! @JosieeAllen Good idea!! Filming a #BurgerKing mukbang on the jet with Nathan and all 5 dogs (who are NOT eating BK) hahaha omg I’m so full I’m gonna puke 😂😫😱✈️ Gooood morning everyone!! ✈️ Time to get on the jet and fly to #GrandRapids ⭐️ Nathan got a new hair color today ⚡️ #citrine #starfamily https://t.co/yIbjvnSDZu RT @natural2slay: My beautiful #MorphexJeffreeStar mess 💦🍓 What's your favorite part or on your to buy list.?\n\n#JeffreeStar #Morphe #UltaBe… RT @GraysonDolan: Going shopping with Jeffree right now... \none like = one prayer for my bank account 🙃 RT @IdkNasson: I got my girlfriend the @JeffreeStar Jaw Breaker Pallet, what did you do today? RT @kamm_lester: It’s such a major step in beauty with @JeffreeStar &amp; @MorpheBrushes to be in @ultabeauty ....like to have that display be… I have one of my biggest #giveaways I’ve EVER done, coming up in one of next weeks videos!!! 🤯😇😫⭐️ Buckle in!! @bringmeinnout Omg thank you!!! 🔥💯 MOOD🔥💯 https://t.co/JijXVbE6kP @TheDemiMedina Wow straight up facts!!! @JavFlynn @ultabeauty @Sephora I hate that you’ve experienced that before!! You are stunning!! 🔥 @missnorajean Facts. @kylsblaze Right?? The times have changed so drastically! Why are @ultabeauty employees so much nicer than @Sephora employees usually??? 🤔 I remember when I was in high school, if you didn’t wear MAC makeup, you were a basic bitch... Now 10 years later I walk by their stores and they’re always empty 💔 The makeup world is constantly evolving and changing! I wonder what 2020 will bring us... @MarlenaStell 💯💯💯💯💯💯💯 RT @katemalacsics: Hi, @ultabeauty, how are ya? @JeffreeStar 💘✨ https://t.co/pkYL56IvWN RT @cassiekleinn_: @JeffreeStar YAAAASSS my Ulta had it! https://t.co/h9PiIEyDjw RT @peopleschoice: RT to vote for #JeffreeStar as #TheBeautyInfluencer of 2019 now! #PCAs https://t.co/K3iMQl9pLw RT @QuinnCrybaby: @JeffreeStar So excited!! https://t.co/4aZZyR44a8 OMG HAPPY #ULTA LAUNCH DAY STAR FAMILY!!! 🔥 https://t.co/jKKAyEEtUe @angeIkissez Yes! @beautylish is my official retailer! @leannexmariee @ultabeauty Yes it’s available online right now on #ulta website! 💯 PS. TOMORROW you can officially start shopping the entire #MorphexJeffreeStar Collection in all @ultabeauty stores!!! 🍓💯 Send me photos tomorrow when you guys see the displays!!!  🙏🏻 https://t.co/OefvGGiFm0 There are only two words to sum up the last few days of my life with the Dolan Twins… Holy shit. 💯 @totesmagoats__ Omg why does it work so well?? 🤡 https://t.co/aN5jaPttUd Filming all day again with @EthanDolan &amp; @GraysonDolan 🔥😇 Wait until you see these videos... definitely went wayyy out of my comfort zone but so worth it 😱 Grateful 💯 RT @dreamxbaddie: I’ve been a fan since 2015 and to NOW own my first Jeffree Star pallete is a dream 💛 #teamalien #hardworkpaysoff👽 https:/… RT @blllackbeaches: A NEW JEFFREE STAR YOUTUBE VIDEO HAS BEEN UPLOADED TODAY SO PLZ for the next half hour *DO NOT DISTURB* Simply iconic 💦🍓 The #MorphexJeffreeStar Collection launching in EVERY @ultabeauty store starting SEP. 8TH!! 🖤 Hi @MorpheBrushes take over how are ya? I’m so excited for everyone to be able to shop the full collection in person 🙏🏻 https://t.co/LuIOYD6kMN How are we feeling about today’s look?? 😱🤯🌝 Grandma Star was NOT playin games!! https://t.co/HGjQTLnNkj Time to film something insane... 🤯🔥 @EthanDolan @GraysonDolan https://t.co/6M5sF565TH 👵🏻 NEW VIDEO ALERT!! 😱 I followed my 100 year old grandma’s FAVORITE makeup tutorial!!! Omg pray for me.... https://t.co/WnnzkvuM3p Gooood morning everyone! 😍 What’s for breakfast today?? I have the munchies and I’m craving a @Wendys chocolate frosty to dip my fries in 🍟 BITTTCHHHH NEW VIDEO will be up TOMORROW MORNING!! 😭💯🤡 I promise it will be worth the wait... 🖤 @shanedawson https://t.co/AlyQT0bBUX On the way to @shanedawson’s house right now... Get ready for the craziest fucking fall season ever 🖤🤯 Can’t wait for these Halloween classes with my best friend @lipsticknick 🔥🖤 additional tickets released today!! https://t.co/SSrJ7wyaCn @CarmenAleex My collection doesn’t launch until September 8 in @ultabeauty stores!! RT @juliadefusco: my jeffree star metal straws (in my favorite color ever) came in today! we makin’ better personal decisions to help envir… @erosmua Brb let me re-create all my old iconic shoots! I can’t believe I just finished filming this and Nate said my makeup looked flawless... I used my hands to blend 🤡 Video up on Friday! #GrandmaStar #vintage @natural2slay 🔥😭 My 100 year old grandmother just sent me a video of one of the worlds oldest makeup tutorials from the 1960’s!!! 😱🤯 She wants me to film a video following it... Do we tell her yes or no? 😇 @Brayannbc Omg this is such a cool mind fuck!! Amazing work 💯 I’m so excited for my #MorphexJeffreeStar event in Grand Rapids!! 🔥😭 Nate and I are also filming a Michigan bedroom tour from our secret ALL BLACK house, literally everything (walls, chandeliers, toilet paper) are black and it’s so insane! 🖤 HI MICHIGAN, How Are Ya? 🔥💖 I’ll be doing a HUGE meet &amp; greet in my second home of #GrandRapids at the @ultabeauty store on 28th St. SE on SEP. 14TH!!! 🎀 Come celebrate the #MorphexJeffreeStar collab with me!! 😍 Next week I’ll post the link to enter to meet me! 🍓 https://t.co/9bGiNz4tLr @peopleschoice thank you for the nomination, love you guys 🙏🏻🔥 Wowwww #StarFamily this wouldn’t be possible without you all!! Thank you always 😭💯💖🍓 https://t.co/uZPUtC3bEu @chestermua Yesss this look is so cute!! 🍓💯 Good morning! I’m ready for some #Starberry 🍓 anyone else? https://t.co/JfvyDo7Mhj This breaks my heart!!! 😩🤯 DM me your address and I’ll send you new ones 🙏🏻  Love you 💯 https://t.co/3tDTmzasu4 @HotfireMakeup Shade extension coming later with new concealers and powders! 🔥 This is just restock of first 30 and color correctors 💖 Who’s ready for a #MagicStar™ Concealer restock?? 😇 Next week EVERY shade is finally returning!! Date and time being announced soon ⭐️ https://t.co/iehojGsXr3 No dream is ever too big… Don’t let anyone ever tell you otherwise 💯 RT @dede397_: @JeffreeStar @MorpheBrushes visiting the @mallofamerica  today and had to stop in Morphe Brushes after I remembered that toda… 🔥💖 https://t.co/p1DMWcjGmJ @marisaesmeralda @vereamaya They are still available in store!! 🍓 RT @JeffreeStar: HIIIII @morphebrushes x #jeffreestar Part 3!!! How Are Ya?? 🍓 Who’s ready to complete their ICONIC Collection? The #Morphe… HOLY SHIT the #MorphexJeffreeStar lip sets and eye brush collection are SOLD OUT! ❌ THANK YOUUUUU!!!! https://t.co/Meb6xBvHyh @Inkfected26 Yes!!! @audigutierrez1 @ultabeauty @MorpheBrushes Everything will be in Ulta starting September 8th!! 😫🔥🙏🏻 https://t.co/J4qPdg3AcM @AmandaPriestle3 @MorpheBrushes Omg thank you! 🔥 @zarilovesarig Yasssss!!!! 😀🍓 @KIWKristina 🔥💖😇 @xbabyxspice 🔥😭💯 @feliciacarey04 Ahhh yessss! 🔥😭🙏🏻 @j3ssi3rul3zd00d @bradmondonyc @MorpheBrushes @MMMMITCHELL Thank you so much for the support, we all love you!! 💯💖 HIIIII @morphebrushes x #jeffreestar Part 3!!! How Are Ya?? 🍓 Who’s ready to complete their ICONIC Collection? The #MorphexJeffreeStar NEW 👄 lip and brush sets are HERE!!  ⭐️ SHOP: https://t.co/Yne7XbIlBL\n\n🔥Don’t forget to use code JSTAR at checkout for 10% your order!! https://t.co/1dE712RMH0 OMGGGGGGGG!!!! 🔥😭😍😫⭐️ The #MorphexJeffreeStar lip sets and new brushes launch in 15 minutes!!!!! 🤯 Omg tomorrow morning the grand finale of the @MorpheBrushes x #JeffreeStar is launching!!! 🍓💯 See you at 8AM PST!! https://t.co/rM0xvsxI3D What is everyone doing today?? I’m at a family BBQ getting my 100 year old grandma stoned 💖 I love bonding time with family ⭐️ @itsNICKSNIDER @PaigeChristieUK I’ll bring the desserts! 💯 Stop what you were doing and watch my girl Nikkie SLAYYYY two looks with the #MorphexJeffreeStar palette 🎨 https://t.co/GCMZnR0NHE @bradmondonyc Oh hiiiii there 🔥 @ChrissyGlamm I’m so good babe! Enjoying this day off, how is life? Don't let people use your past to invalidate your current midset. Hi growth, how are ya? @xxxx_roisin Just the #MorphexJeffreeStar Full collab Collection! 🍓 So excites!!! Next week Nathan, all the dogs and I are off to Michigan to film 3 videos and do an iconic meet &amp; greet in #GrandRapids 💯 Details coming soon... 😇 Ice Cream Dream 🍦 https://t.co/R92gVJhrtT RT @chestermua: @MorpheBrushes @JeffreeStar Really love it 🍓🍓🤤 https://t.co/0N5yK1oYXW Omg I can’t wait to watch this 🎨😭 https://t.co/9Kbq1FxMce RT @NenisGothika: @JeffreeStar OMG this is sooooo freaking gorgeous 😍😍😍😍 https://t.co/aIKd80ooZj 😭💖🍓👅 https://t.co/j9MsIwOOZr @itsNICKSNIDER I’ll start putting up high res billboards of that photo all over town!! World tour coming soon 💦⭐️ RT @diabla98_: I’m fucken wet @JeffreeStar 🤤 https://t.co/jao5IYU9m4 RT @Kittykatmeowzz1: Fixin to attend a wedding, it was time to finally bust this bish open \n@JeffreeStar https://t.co/E3PvF7j97S Getting a facial right now and listening to the new @LanaDelRey album 🔥 Her voice is honestly perfect... RT @maggss_18: The best setting spray I’ve ever owned @JeffreeStar #jeffreestar #jeffreestarcosmetics https://t.co/PozrpWKPs8 Your artistry has come so far since you started, would love nothing more! 💯💖 DM me your address! https://t.co/nrX5H34LgQ RAINBOW CUNT 🎨\n\nWearing the @MMMMITCHELL x @beautybay palette on my eyes 🔥 https://t.co/QtLbyBG27h Sometimes I miss having short hair, sometimes I don’t... ✨ https://t.co/ZbQLNCOO9h 🤡💦⭐️ https://t.co/UdLl64IFZa Last night we celebrated @MMMMITCHEL’s new collab with @beautybay 🔥💖 Congratulations babe!! So so proud of you!!! https://t.co/VUOsWn9IkR @CierraWalker18 @MorpheBrushes @WaterTowerPlace Haha stop by there, the store has full stock of my brand!! And thank you for the sweet words 🔥 RT @natural2slay: @BlundellBeccy @JeffreeStar Definitely 100% my go to setting powder and concealer 💗\n\n#JeffreeStarCosmetics #magicstarconc… RT @BlundellBeccy: I've tried so many setting powders and all of them don't work with my dry skin. The @JeffreeStar powder arrived today an… RT @JeffreeStar: 😱NEW VIDEO ALERT!!!🔥 The ULTIMATE makeup battle! My makeup artists @lipsticknick and @mmmmitchell face off and each do one… 👅 Tonight’s vibe 💖 https://t.co/VeRqyiXKig 😇🔥👅 https://t.co/qq4OFetqjL @KMontie19 🎨💯🔥 @SwirlyKalen Thank you so much!! 🎀 PAINT ME TO FILTH 🎨 https://t.co/XxQLYEvwNQ How are we feeling about today’s video?? 😇 I was so obsessed with both looks 🤯 https://t.co/ZGUYvZq7i5 @julialeno Omg we would love that!! RT @VICTORIAxCHASE: @JeffreeStar @MorpheBrushes THESE SHADES MAKE ME WET 💦🥰  LOL. I just can’t stop playing with this palette ❤️ https://t.… RT @reinaavargass: Such a dream 💗 @JeffreeStar https://t.co/c0u0ua3Njr RT @jimbobrite: @JeffreeStar @lipsticknick @MMMMITCHELL Skills...all around...skills. https://t.co/vjnExWwtvc RT @aileenv04: How perfect is this @MorpheBrushes x @JeffreeStar ?!?! I AM VERY EXCITED TO START PLAYING WITH THESE COLORS ❤️❤️ https://t.c… 💦🍓 https://t.co/XiDvsqgsB6 RT @LachlanBaker17: @JeffreeStar \n...mood... https://t.co/TOxxcmrHDw Welcome to the Star Family ⭐️💯 https://t.co/8PrPPklmqt @kalinakuli1 @MorpheBrushes Unreal!!!! 😱NEW VIDEO ALERT!!!🔥 The ULTIMATE makeup battle! My makeup artists @lipsticknick and @mmmmitchell face off and each do one side of my face!!!! 💦  https://t.co/OHX0pefS06 Nothing like waking your man up with your tongue... who needs an alarm clock?? 👅⏰ Omg 💦🍓😫 https://t.co/xB4tfIPXcu RT @violetrisen: Got minesss 😜🔥 @JeffreeStar @MorpheBrushes ✨ https://t.co/hVgyhPLFR5 RT @MorpheBrushes: READ. MY. LIPS. 💋Morphe X @JeffreeStar Launching 9.3. #MorpheXJeffreeStar https://t.co/6DyTNPAYnI RT @Celiaesquivel15: If this ain’t a mood 😂😂😂 @JeffreeStar https://t.co/2KtHXY8T79 @Ashleigh43449 @MorpheBrushes @ultabeauty Yessss starting September 8th! RT @destinyniickole: Hi, how are ya? 😍❤️ @JeffreeStar @MorpheBrushes https://t.co/GNLnY5QNpl OH HIIIIII.... New video on my channel tomorrow!!! 🔥😱 THE GRAND FINALE! 🍓 You want it, you got it. More #MorphexJeffreestar coming your way 9/3 🔥 JSC iconic matte liquid lippies meet @morphebrushes high shine glosses in two jaw dropping sets and an eye &amp; face brush set you can’t live without. Bam. 💚💗 ✨ https://t.co/lmywC9EUKI I love wearing Nate on my lower lash line 💚 https://t.co/2HvFNMPg2o Bitchhhhh goood morning!!!! 💖 How are we all feeling today?? @NimhDavis1 @lipsticknick @MMMMITCHELL It will be up tomorrow!! @munchyfacer @Sephora @MorpheBrushes Only Sephora Canada online and locations, no other stores! RT @GiaRose001: Think I need a #jawbreaker moment @JeffreeStar blended with the best brushes may I add.. Yessss bitch @MorpheBrushes #Morph… @Nikki_is_ma_God @ultabeauty Yes 😇 RT @Blenderellla: Can we just talk about two of my favorite MUAs BATTLING IT OUT on @JeffreeStar makeup I’m shook I cannot wait to watch 😭 RT @JeffreeStar: The secret is out... 😱🔥 You can now shop the #MorphexJeffreeStar collab on @ultabeauty online!!! (IN ALL STORES SEP. 8TH!!… Tomorrow I’m revealing the grand finale of the #MorphexJeffreeStar collection on Instagram! 💦🍓 I can’t wait for everything to be available at every @ultabeauty location starting Sep. 8th!! @timcmua @MorpheBrushes You are so stunning babe!!! 💯 That blend... 😘 @kamm_lester You are one of a kind and I can’t wait to watch you grow and blossom 🔥🔥 @ChrissyGlamm @LVNDR26 Love you both so much!! 😭🔥 @xchrisfigueroa @lipsticknick @MMMMITCHELL Already planned that idea and have the artists picked, it will be up in October!! 😭🔥 Just filmed the ultimate makeup battle with both my makeup artists @lipsticknick &amp; @MMMMITCHELL 💖🔥 They each got one side of my face to create an iconic look! 💯 Video up Wednesday!! https://t.co/ry1t545IXd Today I’m filming an epic makeup video for my channel feat. a few special guests!!! 😱🙏🏻🥺 Can’t wait to get back to uploading on my regular schedule! @_priscilla_tm She’s busy counting money and couldn’t be bothered! My dogs are my life... I celebrate them every day 🐶🐶🐶🐶🐶💯 Happy #InternationalDogDay https://t.co/hd52fbSHBI RT @Tonya_Stylz: My happy place.... @MorpheBrushes x @JeffreeStar Artistry Palette https://t.co/Iy0ZyvJuZy @antphrodite We’ve discovered and uncovered who they were. It was really dark and it’s been handled 🙏🏻 The poison has been removed They can try and study my blueprint, but they’ll never get the same results 💯 The stunning ❓ liquid lipstick shade from my summer #MysteryBoxes 🔥 I’ll be doing new ones for October with even more exclusives! https://t.co/IekqfFGKcK She’s arrived 🍓💚 https://t.co/866ZRFMeWy Hiiii... 😱🍓🦂💯🎀 https://t.co/LtauPxqWn5 @todrick This is so major and amazing!!!!! Congratulations 🔥💯 Mood 🙏🏻 https://t.co/9W9q7X2UGj RT @SHuizar5: PSA: The new @JeffreeStar x @MorpheBrushes collection is on the @ultabeauty website AND you can use the 20% OFF COUPON! Go tr… Bitchhhh you better work!!! 🍓💯😱 https://t.co/c9ApnSoQ9T @tiffanyironrage @JarrodMUA @Sephora @MorpheBrushes @ultabeauty It will be available only on Sephora Canada and Canada stores! 🔥 🔥💯🎀 https://t.co/LBf9hxsQd1 The secret is out... 😱🔥 You can now shop the #MorphexJeffreeStar collab on @ultabeauty online!!! (IN ALL STORES SEP. 8TH!!!) 🍓 Shop: https://t.co/bswe84kTHy https://t.co/9b7uDzh7u0 Playing in the pink vault w. @MMMMITCHELL 🎀 https://t.co/0OR7hN9fpp Hi #Starberry 🍓 Shop my new iconic setting mist: https://t.co/6zsFEGh2G9\nUse code JSTAR at checkout for 10% OFF your entire order!! 💚 https://t.co/aejMCyuP3w PREACH!!!!! https://t.co/ZZhDJR6WId @Eugenia_Cooney A lot of people need to read this a few times ❤️ @kamm_lester the grind and growth never stops! YASSS another @MorpheBrushes store just opened in CALIFORNIA!! ❤️ You can now shop #jeffreestarcosmetics here &amp; the #MorpheXJeffreeStar collab!! https://t.co/kPIyuOvhIV @Tonya_Stylz YES YES AND YES!!! Your mind set is what the future needs @ChrissyGlamm You only speak facts! Change and growth are so important. Don’t let anyone ever stop you from evolving 💯 @GlamandGore Yes please. 🎀 @PHORAONE So down!! 💯 I rarely leave the house when I’m in LA, but I’d love to start filming collab videos on other people’s channels too 😇 Who would you guys wanna see me film with? Not just beauty channels either! 🍭 Love you too 💚🔥 https://t.co/zqnX7QRZ94 @ChristopherJmua @cohlsworld @WillehBeh I see all 👁 @cohlsworld @WillehBeh I adore Cohl and can’t wait to watch him grow and blossom! This is just the beginning for him 💯 @miz_anastasia Omg you are beyond amazing!! @thelodownbylo Yessss beauty!! Can’t wait to give more smaller creators some shine and a spotlight again 🔥 I want new blood to come feat. on my channel and transform me, tell your story. Inspire others. The beauty community is dying and is ready for a rebirth 👁 Who will survive 2019 and who will rise like a Phoenix? I’m ready for real talent to start getting showcased and the fuckery to take a backseat. Hi we want sickening content, thanks! 🍓💦💖 https://t.co/TWYkWnZEnV RT @britney_cruize: Let’s just take a moment to #respect #admire #love the #beauty of the #glow @JeffreeStar u never let a gurl down https:… RT @Hunnibunni: Yaasss my @morphebrushes x @jeffreestar collection came in!! I’m so happy!!! https://t.co/YNgQIYeNBY RT @Shylie_xo: My birthday present 💝 literally shook this palette is to die for  @JeffreeStar #jeffreestarcosmetics https://t.co/dx8mtNVw6a RT @_Chels_louise_: Okay, so I don’t normally use foundation brushes because I don’t like how they sometimes make the foundation streaky. I… RT @Bethaneyyyy: There are no highlighters better than @JeffreeStar highlighters. @ErikaCacek Love you gorgeous 💚🍓 There’s just one last secret... 🍓 Tuesday. Get ready. Hi @morphebrushes, are they ready? 💚\n#MorphexJeffreeStar https://t.co/gESHX3t6hB I woke up to so many people ready to do chores around my house!! 😂😂😂 Drama, Daddy and Delicious say thanks but we got it! 🐶 https://t.co/NFRZsCQYqc Just a reminder that the #Jawbreaker palette is THAT bitch! 🌈 Shop: https://t.co/thvazoiaNm https://t.co/h17Lh1bbET @Alita007 @cepe_13 @Sammy_Obrienn 😂😂😂 some people really don’t understand humor or sarcasm… Imagine!!! Love you guys 🔥 Drama has been saving up her chore money 🐶 #Pomeranian #StarFamily https://t.co/AMGZtUWMtM The best view... 😍 https://t.co/7oBWNuvYGy I love doing makeup late at night... 😍 Creating something insane with someone special This. Is. Everything. 💚 Hi #MorphexJeffreeStar Artistry Palette, How Are Ya? 🎀 https://t.co/tPBRdgqixQ RT @ClimateBen: Remember:\n\n1. The Amazon is burning\n2. The Arctic's on fire\n3. The Oceans are boiling\n4. The Coral reefs are dying\n5. Green… RT @tbudde213: Have you ever seen perfection! Well let me show you🙌🏻👑💖 Jeffree killed it yet again @JeffreeStar https://t.co/WsB5FHH2EK 💯💖🙏🏻 https://t.co/uys6BjZBzL RT @glamskullbeauty: This pigment, wow! @MorpheBrushes x @JeffreeStar https://t.co/tQfDNX4fxC RT @Cece_0731: @JeffreeStar I’m deceased with how beautiful this palette looks and don’t get me started on the setting spray 😍😍😫😫 https://t… RT @Y4Z: In love with my new @jeffreestar x @morphebrushes Palette 😍❤️ It’s gorgeous!! 🥰 https://t.co/876q5JrEZo RT @Y2SHAF: a reminder that the amazon forest has been on fire for 3 weeks now and because of the lack of media coverage people don’t know… Feels so good to be home and surrounded by dogs and love 🐶🐶🐶🐶🐶 @itsNICKSNIDER Him and the bag survived hahah 🤡 RT @Maxi_taylorr: are you KIDDING ME!? 😍 @JeffreeStar x @MorpheBrushes https://t.co/zVERyuvSps I wanted to film doing my makeup in my airplane seat but it’s too dark in here and my lighting would offend everyone in the surrounding area 🌝 Nothing is better than Michigan dick, just for the record 💯 @nataliedupre123 This is so incredible I can’t breathe My dogs are offended by this, but I laughed 😂 https://t.co/AagHniUkkG @cricket_411 🥺💯 Nate and I are on the way to Michigan for the night... Peace out #Chicago, we fucking love you ✈️ PS. Grand Rapids and all my MI Star Family, working on a fun event right now stay tuned 🥶 I FaceTime my dogs more than anyone in my contacts 🐶 Yes, Diva and Delicious have their own iPads, they’re old enough I wish we were filming because his facial expression was iconic hahaha 🙏🏻 https://t.co/G5YIaTXTn1 Nate spilled iced coffee all over my Himalayan Birkin at the airport an hour ago and I just got the strength to tell you guys hahaha 😭😱😧 The bag survived though!! 🤡 I have the worst back pain from 69-ing last night.. I know, it’s my fault 😑 Hi, I’m here... 🖤 https://t.co/AcrRi392Fj @TeaSpillYT Same!!! Can’t wait to try it 🥶 Omg Millie Bobby Brown is launching a new beauty line! 😱😍 What are your thoughts? Looks very on brand for her! Do we need a review?? https://t.co/idSEXQ5kQv RT @betsyHuey1: Having 2 is always better than 1\n⭐️\nWho agrees?\n⭐️\n#MorphexJeffreeStar \n@JeffreeStar @MorpheBrushes https://t.co/BPr7k7FuxD RT @julielynn1981: Damn @JeffreeStar! @MorpheBrushes killed it with this one! The glitters are soooooo creamy! https://t.co/mKzKsASVO1 Gooood morning from Chicago! It’s our last day here and we had the best time ever 😭🔥🥺 RT @Katiex93_: we only know quality products in this house, this new palette is SICKENING 💗🍓@JeffreeStar https://t.co/XObnAwa1L2 RT @MeganTylerMUA: I am STUNNED by the PIGMENT 😍😍😍 like ummmm hi??????? @JeffreeStar @MorpheBrushes #MorphexJeffreeStar https://t.co/1YyW2s… RT @Annebrly: Used my bf arm to do some swatches of the new @MorpheBrushes palette x @JeffreeStar Hello pigmentation, i’m shook 🤯😍 https://… 🔥💯 https://t.co/qDzbrPrd92 RT @kaypepperoni: my boyfriend just surprised me w this and im feeling BLESSED🤩🤩 my life just improved x1000 @JeffreeStar https://t.co/VBpV… RT @nikojade: They here 💕💕💕💕🥰🥰🥰 @JeffreeStar https://t.co/97WTqVHWFK HAPPY BIRTHDAY NATHAN!!!! 💚 My Leo king, my soulmate, my other half... I’m not complete without you and I’m so grateful for every second we get to spend together. Cheers to another beautiful year! I love you forever &amp; always 💯💖🔥 https://t.co/ayuoPY8kkK Having the best day with Nathan and our friends here in #Chicago 🔥😭 Tonight at midnight is his official birthday!!! #Leo HIGH, HOW ARE YA? 💚 #MorphexJeffreeStar https://t.co/hWMRUO7Unc SAINT VIRGIN GUCCI 🙏🏻🍓 https://t.co/UybSvCdRwH RT @bcompton311: @JeffreeStar this bitch smells SO good https://t.co/VSsliZtgiI I still can’t get over how insane today was 🤯🔥😭💯🍓 Thank you Chicago... #MorphexJeffreeStar https://t.co/uZKuIcqAWV RT @glambyjack: @JeffreeStar It was SO AMAZING meeting you today!! 😭💓🍉 https://t.co/Wa8QeZVEkg 🍓💯 https://t.co/r4Bb9hg3sY Goooood morning everyone! 🔥 Nate and I can’t wait to see everyone today in Chicago!!!! 🍓 I can’t wait for you all to see you tomorrow’s hair and makeup look at the Chicago @MorpheBrushes grand opening at #WaterTowerPlace 💖🍓💯💚 I love you 💖💚 GUESS WHAT’S BACK? 💖 The #JeffreeStar Mr. Diva heart shaped vinyl records are back in stock, with a new color way! 💋 Buy one in the next 48 hours and get a FREE #velourliquidlipstick AND FREE U.S. SHIPPING!!! 🔥  🎀 SHOP: https://t.co/U8eFsuROC8 https://t.co/J9iLtBWvkz RT @aubreeiously16: I’m in love 💖😍 thank you so much @JeffreeStar and @MorpheBrushes for this beautiful palette! I can’t wait to play with… RT @sydneyleighsing: that’s hot @JeffreeStar @MorpheBrushes https://t.co/0AEGicd31m RT @jadeboulterx: The formula of the #MorphexJeffreeStar Palette is insane😍 I can’t wait to create more !! @MorpheBrushes @JeffreeStar http… RT @Malisnotonfire: Soo I’m in love with everything from the #JeffreeStarxMorphe collection💕 the star-berry mist smells like the strawberry… The devil is in the details... 🍓 Hi #MorphexJeffreeStar displays!!! https://t.co/dJdUnLTVhV Omfg who’s entering?? 😇🎀 https://t.co/8RQ7TUXPEF We are on our to Chicago right now and the flight attendant is spraying herself with my #Starberry mist!!! 😭😱🍓 Brb @MorpheBrushes I’m deceased!! RT @staybloodred: @JeffreeStar Thanks for the sale. Finally got some cool stuff. https://t.co/uYUUff2XZR RT @dedeglows: The NEW @morphebrushes X @jeffreestar collection! Im in love.♡⁣ #MorphexJeffreeStar https://t.co/LljxPhhfR6 RT @ChrissyB8987: Finally visiting @MorpheBrushes at Somerset mall! Look at this beauty! @JeffreeStar #JeffreeStarxMorphe #morphe #jeffrees… FREE SHIPPING has officially started for 48 hours!!! 🔥 Shop the #JeffreeStarCosmetics website: https://t.co/In9HS73zw8 https://t.co/3UDs9jLtnh We are packing our suitcases for Chicago right now!! 😭🔥🎀 Can’t wait to celebrate the #MorphexJeffreeStar collab with everyone!!! Tomorrow for 48 hours, the #JeffreeStarCosmetics website will have FREE SHIPPING!! 😱🔥 Buy ANY accessory or fashion item and get a free liquid lipstick! 😇 https://t.co/O6xFQaT2BJ It’s Nathan’s birthday on Aug. 19th!!! 🔥 Where are all my loyal Leo’s at?? ♌️ I can’t stop watching this makeup video 🍓🔥 #MorphexJeffreeStar 💚 https://t.co/mkK4TS47h8 Oh my god!!!! 😭🔥 Who knew I could be hungry looking at myself… You are beyond talented!!! 🌮 https://t.co/bPURVsVqpV RT @oh_so_peachy: Okay but the @JeffreeStar x @MorpheBrushes setting spray smells incredible RT @HollyLong98: WTAF... absolutely unreal 😍 \nThe setting spray smells sooooooo good 🤤 #MorphexJeffreeStar @MorpheBrushes @JeffreeStar http… RT @chloe_snape_: @JeffreeStar &amp; @MorpheBrushes DID THAT😍😍😍 https://t.co/HVofeClnEh Makeup porn 🔥 https://t.co/KJNMXi3i1q @BarrowsJustin @MorpheBrushes You look amazing babe 🍓 @jojomojodee @ABHcosmetics @patmcgrathreal It will be on my channel this Friday!! Tonight’s mood: Might have a threesome or might fall asleep in 20 minutes watching Mean Girls 😭 I can’t decide.. RT @betsyHuey1: @JeffreeStar She is a Dream ⭐️\n@JeffreeStar #MorphexJeffreeStar https://t.co/qY182w0Yub RT @MorpheBrushes: It's a ⭐worthy collection! @Carolin90113462 snapped a moment with the entire #MorpheXJeffreeStar Collection in its best… Shop the iconic #MorphexJeffreeStar Artistry Palette 🍓 30 shades that blend like a dream -&gt;  https://t.co/Yne7XbZWtj https://t.co/oBtvkhzY9t Show me the final look when you’re done!! 😭🎀 https://t.co/XNcrz7Fhmt RT @Sydneyy57: I’d say our @JeffreeStar haul today at @MorpheBrushes was a success ✨ Hi, how are ya? 💅🏼 #MorphexJeffreeStar https://t.co/4J… HI CHICAGO, HOW ARE YA? 🍓 This Saturday I’ll be cutting the ribbon at the NEW @MorpheBrushes store at @WaterTowerPlace!!! 💚 Wanna meet me? Enter here: https://t.co/pCbOtGEFhh https://t.co/6wOuvDXla0 I woke up with the biggest smile on my face 😀😭🔥💯 Hiiiii everyone, How Are Ya? Today couldn’t have been more perfect 👌🏼 RT @HighSugar1: Oh, High @JeffreeStar and @MorpheBrushes! Just wanted to say ya'll really killed it with this #makeupcollab and the #Starbe… Marijuana backdrop ✅\nFinally meeting @Nick_LGrant &amp; @Justin_Moore ✅\nGetting Shane out of the house ✅ https://t.co/uvHrlAHuEo RT @leslieaileen__: @JeffreeStar 🍓✨ https://t.co/6yZWWErxLn RT @GajardoRianna: @JeffreeStar and @MorpheBrushes this collection is absolutely gorgeous!! Can’t wait to create! 💫 https://t.co/9YHstUIeQ7 RT @annnerrss7: @JeffreeStar I accidentally walked into your launch 😝 glad I did #JeffreeStarxMorphe https://t.co/bqVueK7Cto RT @betsyHuey1: Lifestyle not a collection ⭐️\nNo filter needed  🍓\n#MorphexJeffreeStar \n@JeffreeStar \n@MorpheBrushes https://t.co/xJGx4SAktP RT @Krystle_Lynne_: Hi new palette.....how are ya? 🍓💕 @MorpheBrushes @JeffreeStar so pretty #MorphexJeffreeStar https://t.co/KsHuRZqhRX RT @Dearbhlamcg9: Remember when @JeffreeStar said 2019 was gonna be the year?\nHe wasn't joking. The co-founders of @MorpheBrushes got me this insane stunning gift last night in celebration of our launch and for code JSTAR which I finally created for charity and spreading love! 💖 #MorphexJeffreeStar https://t.co/bU4QJetQaC @R_Zuryr @MorpheBrushes You look so gorgeous!! 🔥 @LucyPainterxo 🙏🏻🍓💦💖 RT @TheGigiGorgeous: Last night😋💖🦄💚🍓 https://t.co/zUwScvxntd THANK YOU for the support beautiful!! 🎀 https://t.co/DvYDlwtNfF RT @GIVENGRACELIFE: @JeffreeStar x @MorpheBrushes 🥰 so stoked https://t.co/rRoLcfHD1S RT @nairam_02: 😍💖 @JeffreeStar  #MorphexJeffreeStar https://t.co/e9UPWN5u2U RT @yazzepinka03: @JeffreeStar @MorpheBrushes pink everything is my life thank you for making things in my favorite color ever . https://t.… RT @aimee29828077: OMG so happy I got my hands on the @JeffreeStar and @MorpheBrushes #MorphexJeffreeStar palette🤤😲 It’s stunning 💕 https:/… Last night we celebrated the launch of the #MorphexJeffreeStar Collection with all my family and friends!! 💖 Thank you to everyone who has supported this collaboration, it means the world to me!!! 💯 https://t.co/b11d4lg5Co RT @chloeasanocean: hi @MorpheBrushes x @JeffreeStar how are we?!💖⭐️ this collection is UNREAL 🥰🥰 https://t.co/5xJV3rZgsL RT @celena_rose: Happiest girl alive right now 💖💖 @JeffreeStar @MorpheBrushes https://t.co/4YbTS7CIqU The volume of traffic on the @MorpheBrushes website in the first hour this morning was UN-FUCKING-REAL!!!! 💯 THANK YOU STAR FAMILY!! ⭐️ Current mood: Spraying Nathan’s naked body with #Starberry mist 💦🍓 RT @Scandalasia: MY HEART 🍓💗💖 @JeffreeStar https://t.co/UnwCearlU0 RT @candace_hollins: @Joshiboyxo @MorpheBrushes @JeffreeStar Fuck yeah!!!!! 😍😍😍 https://t.co/pie5yNP8ne I can’t believe today is finally here!!! 💦 If you guys are shopping at any @MorpheBrushes store today, send me photos of the #MorphexJeffreeStar displays, your purchases, I love looking at everything!!! 😭💚💖🍓🎀😍 @DivaCruz8 @MorpheBrushes Thank you so much for the support babe!! 😭💚 SHOP the Jeffree Star x @MorpheBrushes Collection!!!!!! 💖💚 Use code JSTAR at checkout for 10% OFF your entire order!! -&gt; https://t.co/Yne7XbZWtj https://t.co/FFiKZFNBOy @MorpheBrushes Omgomgomgomg 🔥😭💯🍓💖 RT @Joshiboyxo: Waiting for the @JeffreeStar x @MorpheBrushes collab to drop in so ready to get that palette and the starberry mist 🍓💦 RT @betinaartistry: Who else is waiting for the @JeffreeStar x @MorpheBrushes collab? I can't wait to play with it! 😍😍❤️ RT @makeupmandeeq: Sitting here ready to buy everything in the new @MorpheBrushes and @JeffreeStar  collab. And the time is being so disres… Hiiiiiii everyone, good morning!!!!! 😭🔥💚Less than 30 minutes away until we are liveeeeeee!! We are only 6 HOURS AWAY until the launch!!!!! 😭😭😭🍓💯💖🔥💚😀🎀 Omg I cant sleep!!!!! #MorphexJeffreeStar Walking into the #MorphexJeffreeStar launch party like... 💦🍓 https://t.co/yFy7ImA4aq Tonight’s vibe 💋 https://t.co/PVmuNmLMoz This weekend I’ll be flying to a @MorpheBrushes store location and doing a huge ribbon cutting AND celebrating our collab!!!! 😇🔥🍓 Can anyone guess what city? I’ll announce the mall with RSVP link in the next few days 👀 Getting my makeup and hair done right now for tonight’s #MorphexJeffreeStar party!!! 💖🍓🔥💚 Can’t wait to celebrate this huge moment 👌🏼 TOMORROW the iconic #MorphexJeffreeStar Collection launches on @MorpheBrushes website at 8AM PST!!! 💦🍓 What’s on your list? 💚 The #Starberry set &amp; refresh mist is a must have!! https://t.co/ua4COSezyv Goooood morning everyone! 👀 What’s for breakfast this morning?? When people only hit you up when they want something... ✂️ No bitch, time to cut you right out Who’s watched today’s video?? Nathan and I love going on adventures together 😭🔥💯💖🌶 https://t.co/JvuJqyLuf2 CAN IT BE TUESDAY ALREADY?? 🎀🌶💯💖🔥 My beauty soulmate @lipsticknick created all the makeup looks for the #MorphexJeffreeStar campaign and I couldn’t be more proud to have her by my side 💋 https://t.co/B0jH0E7wOH Now I’m hungry again... 😭🔥 https://t.co/fvMg3D1qky RT @smallhngrybitch: Nate is me when I eat @tacobell @JeffreeStar https://t.co/dQYBQoUtfW @prettynink924 @MorpheBrushes 8AM PST!! Oh my god tomorrow is my launch party for #MorphexJeffreeStar Part 2 and Tuesday is the launch day!!!!! 😭💖💚 🌮 NEW VIDEO ALERT!! 💛 Nathan and I spent the night at the @tacobell Hotel!!! Secret food item menus and so much more: https://t.co/3oC3lkQoKG RT @betsyHuey1: Good morning ☀️ \nBecause she’s everything you need for your overnight stay 🍭\n@JeffreeStar #minibreaker \n#JawBreakerCollecti… Girrrrrrrrrrl.... Good morning 👀 How are we all feeling today? RT @antman8o8: morning swim HI, HOW ARE YA! 🥤🏊\n\nthese @JeffreeStar straws tho! https://t.co/ZHEUUo17b5 Nothing is better than being in bed surrounded by a bunch of Pomeranians 🐶🐶🐶🐶🐶 #StarFamily RT @totally_Nicki: Obsessed @JeffreeStar https://t.co/GWYgmqSPln @VioletVorpal @MorpheBrushes Yes! TOMORROW... New video on my channel!!! 🔥💛 Sunday will never be the same. RT @_weirdandcrazy_: 😍😍😍 I’m so happy !!! @JeffreeStar  #jeffreestarcosmetics #jeffreestar https://t.co/5iREWFzVtE Today I’m wearing Nathan’s favorite Skin Frost highlighter #Neffree that we created together 🎀 https://t.co/NxIYoxNKsG @betsy73263675 👌🏼🙏🏻🔥 @AmberRangel17 I really appreciate that, thank you 💖💯 The highly anticipated Jeffree Star Cosmetics first ever Foundation formula will be launching in 2020 😭💖 It’s honestly humbling and really flattering to have a company I’ve been wearing since high school think highly of me. No shade at all, I just don’t want to create for anyone else but me.. I have ideas for 20 years &amp; so much more to prove to you guys with #JeffreeStarCosmetics 🔥 I woke up to an email from one of the biggest makeup companies on the planet, offering me alot of $ to help make their brand relevant again… Very flattering but I have my own empire to build sis 💯 RT @titfortattoo: New favourite 💕🍭🧁🍬\n@JeffreeStar #jeffreestarcosmetics  #Jawbreaker https://t.co/bKO0ODm64X 💦🍓 BEAUTY IS IN THE EYE OF THE BEHOLDER 💚 #MorphexJeffreeStar PART 2 launching THIS Tuesday!!! Use CODE ‘JSTAR’ at CHECKOUT for 10% OFF at checkout on @morphebrushes online AND IN STORE! 🎀 https://t.co/b3J7fY9NxZ Yellow Aesthetic 💛 https://t.co/5tmiynJ2jy Gooood morning world! 🥙 Day 2 filming w @tacobell 🌮 Time for a mukbang with exclusive hotel food items!! https://t.co/u6iDHtsgSa The essentials 🎀💯 https://t.co/YLNWFA7mOm I can’t stop eating 🥙🌮🥗🍲🥕 @R_Zuryr @MorpheBrushes Yes!!! HI TACO BELL RESORT, How Are Ya? 🔥🌮 https://t.co/Xho8EbqHf4 There’s a new bitch in town and she’s STUNNING! 💦🍓 The #MorphexJeffreeStar Artistry Palette has 30 gorgeous shades all Jeffree Star Approved™ 💚 Can’t wait to see everyone creating looks with this collection 🎨 https://t.co/WWLIPz2uXW When it’s 108° outside, what do you wear? ☀️ I’m thinking a diamond necklace and a thong The only thing I’m wearing right now is the #MorphexJeffreeStar Starberry Set &amp; Refresh Mist all over my body💦🍓 and some Gucci pumps 💋 Right before filming a foundation review today, I shaved my face with a new razor and took a chunk out of my face on accident… 🙃 Tomorrow Nate and I will be filming in Palm Springs and staying at the @TacoBell hotel on opening day!! 🌮 Get ready for an epic video of the entire experience! 🌶 HI PART 2!!!! 💚💗 ALL Jeffree Star Approved, and created for you. 🔥\nLaunching 8.13.\nWho’s ready? 🍓#MorpheXJeffreeStar https://t.co/sbUMVmfGqM Got woken up to breakfast in bed and Nathan telling me he’s so proud of me and my next collab 😭😭😭 Some days my life doesn’t feel real… Feeling so grateful this morning 🙏🏻 Lipstick prints 💋 I let @RichLux713 into my vault last night... Watch! 🍵 https://t.co/X4wtYvyRbr The secret is finally out... 🍓 Round 2 of the #MorphexJeffreeStar collab is so iconic!! 💚 Strawberry dreams forever ✨ Can’t wait for everyone to bathe in the #Starberry mist and liveeeeeee! 💦 https://t.co/Faf46Kpuz0 How are we all feeling about today’s reveal?? 🔥⚠️ I’ve been smiling so big today I’m gonna need Botox soon!! 😁 THANK YOU for all the love and feedback!!! 💦 https://t.co/zcQhJQS3Fk You can now use code JSTAR at checkout for 10% off ALL @MorpheBrushes products online AND in store! 🔥💖 https://t.co/PNSUjt6Vu5 @ThreeDailey Thank you boo!! 💖🍓 @Tonya_Stylz @MorpheBrushes 😭🍓⭐️🔥💯 HI, HOW ARE YA??? 💦🍓 The #MorphexJeffreeStar Artistry Palette AND #Starberry Set &amp; Refresh Mist are VEGAN. Cruelty-Free.. and so delicious ✨ https://t.co/CpDH6aDfvB Introducing #MorphexJeffreeStar PART 2... Feat. The Artistry Palette ⭐️ -&gt; https://t.co/0S1B95I7bW ONE MORE HOUR.... 🍓🤯💖⚠️ #MorphexJeffreeStar 👀 I’m so excited for tomorrow I can’t sit still 😭😭😭😁 RT @JeffreeStar: JEFFREE STAR x @MORPHEBRUSHES ROUND 2.... 💖 All will be revealed TOMORROW on my channel!!!!! #MorphexJeffreeStar https://t… We just closed a major deal on something we’re working on together ✅ #StarFamily \nPs. I’m obsessed with Nate’s new hair ⚠️ https://t.co/WY5CRl3yi6 What products do we all think I’m launching for PART 2 of the #MorphexJeffreeStar collab?? 😇 Video reveal will be on my channel tmrw at 10AM PST!!! 🍓 RT @Mekotsu: New @JeffreeStar @MorpheBrushes collab?\n\n*Wallet minding its own business*\nJeffree: https://t.co/rOVphoNUOv JEFFREE STAR x @MORPHEBRUSHES ROUND 2.... 💖 All will be revealed TOMORROW on my channel!!!!! #MorphexJeffreeStar https://t.co/SFoOYiLKIq @Germany512 Thank you so much for the message, it’s my pleasure to help and spread the word! @caseydband Seeing the continuous happiness of others from receiving help, is undescribable today after such a dark weekend 🙏🏻 There is so much darkness in the world lately… Make someone smile today and don’t lose focus on what’s important 💯 I love watching people blend when I’ve hit the indica 💚 https://t.co/8ffuZqtcFH This week is going to be verrrrry interesting 😇 Buckle up 💅🏻 Nathan just dyed his hair the exact shade of a @tacobell Baja Blast 💚 I was so blown away yesterday learning about so many school teachers in need of supplies for their students! I want to bring more attention to this and help @support_a_teach's movement! 🔥 I just donated $25,000.. please share &amp; help: https://t.co/Yp4hTFZE2K @caseydband Time to update that % 😁 RT @Ninja: Sickened by the multiple mass shootings in the last 24 hours... the fact that I can even tweet that is fucking disturbing. Somet… RT @FaZeRug: Wtf. 2 mass shootings in one day? Is this really becoming a normal thing? You can’t even go to your local Walmart without the… The beauty community is ready for some new faces.. She's hired! https://t.co/Dj3qpdEsGQ This world is so dark sometimes… All I ever want to do is inspire others through my makeup &amp; art and make people smile 💯 HI!! I just saw your tweet and wanted to let you know I bought all of your supplies for your students and wiped your whole list clean! God Bless and thank you for caring about education! ❤️ https://t.co/ZOALkCT6jp https://t.co/pEQzvZbBNz Happy Birthday and I hope you love them! 💖😁 https://t.co/UFUYxdcAjH Nathan and I are flying to the Midwest for the afternoon to look at real estate investment properties to buy ✈️ Taking a day off isn’t in my calendar, I love traveling and growing my empire 👑 JUST........ WOW 😍🙌🏼 My view. 🖤 https://t.co/xYrKYHizls BEHIND THE BRUSH is returning THIS FALL!!!! 🖤 My makeup soulmate @lipsticknick &amp; I are doing TWO exclusive Halloween makeup classes! 👻 Come watch Nicole recreate our iconic skull banana makeup look! ❤️ Phoenix and Denver see you soon!!! 💀 GET TIX: https://t.co/KQ3n0MrfwM https://t.co/OSDM5Zit2f So many new #Morphe stores coming soon.. 🔥😳 You will be able to shop JSC at every location!! https://t.co/dJ1EP9PowK SHOP the #JeffreeStarCosmetics eyeshadow palette’s for 30% off!!! 💖 -&gt; https://t.co/thvazoiaNm https://t.co/UccPz9ZYOH Yessss sale and restock start in 15 minutes!!!!! 😇 https://t.co/MIWHUb659J We are less than two hours away until my 30% off eyeshadow palette sale starts!!! 😭🙏🏻 What’s on your list?? https://t.co/4igJ9SrK8W Today was so perfect I cried happy tears on the way home 😭😍 #hifeelings I want to grow back my real eyebrows for one month only but I don’t have the patience 😭🐛 Tomorrow my pink &amp; blue #chrome Star mirrors will be BACK in stock!! 💙💖 My huge sale starts at 10AM PST / 1PM EST!! 💅🏻 https://t.co/HdXn53JhG3 So excited and proud of you!! 🔥 You’ve made your own lane and have worked so hard to get here 💯 https://t.co/8OwcvZNtSf Gooood morning everyone!!!!! Omgomgkngomg working today on something so major and important... 👁💄 You’ll see soon. @elijahdaniel CAN relate! RT @natural2slay: @JeffreeStar Yes, still  in love with the #BlueBlood palette &amp; #JeffreeStarxMorphe brushes are still favorites 💙 💦 https:… 👁💙 https://t.co/XMdlW6s6R4 🍭👅 https://t.co/HY0qt8YXLq RT @xElleiZi: Finally!! 😍 @JeffreeStar https://t.co/CokdfjuK30 RT @lexnd001: oh hi, how are ya? @JeffreeStar these are the prettiest straws i’ve ever seen in my life💙💙⭐️ #jeffreestar https://t.co/QkB0o2… 🍦 Are we all ready for Friday’s sale!? 😁💄 https://t.co/jLhcDpIgLC Bitch I need a @redbull and a blunt right now... Good morning world! 🔥💚 Late night beauty rituals 🖤 THIS FRIDAY... Introducing 4 styles of #JeffreeStarCosmetics slides 💖 Comfy and iconic 🦄 Launching 8/2/19 @ 10AM PST 💛 \nRetail: $40 https://t.co/Mtx3Pjqy9R RT @MeuAmorCadencia: When @JeffreeStar says we’ll see what he’s working on “after the weekend” and you realize it’s only Tuesday https://t.… I get asked about 100 times a day to review the skin color changing foundation.. 😱 I actually reviewed it 6 months ago!! 🤮 Watch: https://t.co/7wyzCFEf2A Today I’m shooting such an exciting video for something really special!!! 😭😭😭🔥💯💖 @babylovesrem The mystery boxes are limited edition every time and will never be printed again until the next one! OH. MY. GOD. 😭🔥😇 THIS FRIDAY I’m having a huge surprise sale!!!!! For the first time ever, we are giving everyone 30% OFF most of my eyeshadow palettes!!! 😱 Come shop the iconic classics and experience the #JeffreeStarCosmetics formula 🌈 https://t.co/1m2cCDB7XX RT @LeaBob_: @JeffreeStar happy national lipstick day 💗 https://t.co/rP456Fehj4 @trishapaytas Love you Queen 💖 So proud to see you killing it on stage and living your dreams 🙏🏻 Oh HIIIII do we need a review??? Can’t wait to try a formula that’s FINALLY not matte 💯🙌🏼😭 https://t.co/cG7me4gj5R Stop doubting yourself and just go fucking do it! 💯 @shanedawson Thank you always for being such a positive light in my life 🙏🏻💯 RT @shanedawson: @JeffreeStar i screenshotted this from your story because it made me so happy. i’m so so proud of you :,) ❤️❤️ https://t.c… ON MY BOSS SHIT 🖤 #MorphexJeffreeStar #Jawbreaker #storeopening https://t.co/CtEhU8nKCy 🖤😍 https://t.co/VflevOCA9A This is so cute!! 😭💯 I love how supportive he is!! https://t.co/m6dnlgUfoz RT @natural2slay: Buenos Dias 🍵 Have a great Sunday, enjoy your family 💚\n\n#JeffreeStarCosmetics #FamilyTime https://t.co/i8NSx1bvY9 I was told I’d never be anything 10 years ago... That I should give up my dreams.\nI’m glad I never listened and followed my heart 💖 https://t.co/shZPhzOn8V @yasmine_cynthia @MorpheBrushes We are at North Star very soon 😍 @gloss_yyy 👅🍭 @gloss_yyy 🔥💖 @Belle09005656 @MorpheBrushes Yes! 💯 There was a marriage proposal during my meet &amp; greet today and it was so magical!!! 😭😭😭💍🔥💖 @LVNDR26 Omg so good to finally meet you babe!!! 🔥💯💖 DIAMOND IN THE ROUGH 💎 https://t.co/I0AqA2mRy3 I’m on the way!!!!!! 🔥 @MorpheBrushes ribbon cutting in 30 minutes!!! 🤘🏼 https://t.co/QAAYTEOmlu Goooood morning everyone! 💖 So excited about today’s event at #KingofPrussia mall!! What color wig should we do on me today? RT @brookerobson18: my bf really surprised me with the #jeffreestarmysterybox i’m crying💓😭 @JeffreeStar https://t.co/6FiH3aUUcm @Cj_Harris02 🔥💯 What is the best pizza spot in Philly?? 🍕 The #JeffreeStarCosmetics team &amp; I have the munchies!!! Barbie’s Worst Nightmare 💝 https://t.co/1UhydzD3fg @riley_joe26 God Bless You 🙌🏼 Time for a #JeffreeStarApproved lunch 🍟 #Gucci https://t.co/XzsBXCABfv Time to hop on the jet and head to Philadelphia ✈️ See you this weekend love!! 🔥😭 Over 30,000 people RSVP-ed in under 20 hours so we are so shook!! 💖 Come to the store even if you didn’t win, I always meet more people then planned and I’m giving away free makeup all day! 💯 https://t.co/XeltVWPNZs TAsTE tHe rAInBoW #Jawbreaker 🌈 https://t.co/Jil2pn1DiT THANK YOU for the feedback!! 🔥 The #MorphexJeffreeStar brushes are BACK in @ultabeauty stores &amp; online! 💖 https://t.co/4sChVjqpdH @kendallalfred YASSSSSS! The weather is supposed to be over 100° today... 😭🔥 I need a bulletproof setting spray or I’m gonna melt RT @JeffreeStar: 😱 NEW VIDEO ALERT!! 🤯 I WORE MAKEUP FOR 24 HOURS...... Testing out the new @urbandecay #StayNaked foundation &amp; concealer!… I can’t wait to be on the East Coast this weekend!!! 🔥 Who’s coming to the new @MorpheBrushes store to celebrate with me?? 🚨 Hi Pennsylvania, how are you?? 🔥 Come celebrate the grand opening of the NEW @MorpheBrushes #KingofPrussia store! 💖 I’ll be doing the ribbon cutting + meet &amp; greet after! ⚠️ Enter to meet me HERE: https://t.co/2a6hlJTg8o https://t.co/vlEvqpidyD 💅🏻💅🏻💅🏻 How are we all feeling about today’s journey?? 🤘🏼😭 https://t.co/0Fl47aQrT6 Watching this with Nate now and we love you so much!! 😭🙏🏻 https://t.co/rYfu1ihQ0R @MsEd0511 Yesss I love hearing this so much!! Us in the pink vault uploading our 500th #Birkin unboxing video 👵🏻👨🏻‍🦳 https://t.co/6fqnkQdeQF I’m so in love with Nathan that sometimes I smile and cry because I can’t believe I found my soulmate 😭💯 😱 NEW VIDEO ALERT!! 🤯 I WORE MAKEUP FOR 24 HOURS...... Testing out the new @urbandecay #StayNaked foundation &amp; concealer! 🚨 https://t.co/NA64yCOxVE Gooood morning! 😇 In one hour there will be a new video on my channel 🚨 You deserve the world 🌈 I’m ready for the rest of 2019... 👁 https://t.co/1FH7BCu5CD 💅🏻🦄🌷🌺 #JeffreeStarApproved https://t.co/0XHIKidXeB Tomorrow I’m uploading a new video! 😇 Did my skin make it through 24 hours of makeup?? We will find out in the morning 🤯 Posing for my new drivers license photo... https://t.co/joqF9WzUPi Yassss Mystery Boxes have already started being delivered around the world!! ❓ https://t.co/LZQSvUz8Jv Officer Star reporting to duty, how are ya? 🚨 https://t.co/3gRUVsX57u Hi 🕷🕸 https://t.co/gZWYSsHRKE YEEEEE-hAw! 🤠 #CowboyJeff https://t.co/apcRxTJHls Gooood morning everyone! I just finished filming my 24 hour makeup review with @UrbanDecay’s new foundation and concealer 😱😁🙏🏻 I can’t believe I slept in make up… But did the formula last?? 😇  Video of my journey up Tuesday! 💯 I’m filming a makeup review right now wearing products for 24 hours 😭😁 I’m only 10 hours in.... Pray for my face!!! 😱 GOOOD MORNING! 🔥 Today’s meet &amp; greet at @VansWarpedTour #MountainView starts at 2PM!!! 🍭 Come shop JSC makeup and fashion all weekend long! https://t.co/7MreDyWKJ4 👽 How are we all feeling about today’s review?? 😱🍉 https://t.co/EwmCxQl2nO Welcome BACK to Youtube KING!!!! 💯😭💖 Happy birthday and I love you with all of my pink diamond encrusted heart 🔥🔥 https://t.co/6M4mb5ALBY Every #MysteryBox is now officially ❌ SOLD OUT!!! ❌ \nThank you all so much!!!! The JSC team &amp; I are so blown away by the response!!! We will do this again 2 more times before the years over 😇💢 @GeorgeMoral3s Thank you so much!! 💚 @ChristyMi92 love you 🧡 RT @SARICH90: @JeffreeStar DELUXE AND PREMIUM BOXES ARE SOLD OUT! Yasssssss! WORRRRKK! Glad I got my box literally right at 1pm EST! You di… I’m fucking shook ⚠️😁 RT @chaseashlantic: i got a @JeffreeStar mystery box today and i’m so ready SHOP all 3 iconic #JeffreeStarCosmetics summer #MysteryBoxes 💚🧡 -&gt; https://t.co/KFvRBvr7nk https://t.co/rshDXutjub 😱 NEW VIDEO ALERT! 🍉 Testing out @elfcosmetics new #JellyPop summer collection! What’s #JeffreeStarApproved? Watch: https://t.co/WXatDdyfJm Gooooood morning!!! Today is going to be insane 😁🔥🙏🏻😊 New video will be up in less than one hour!!!! @shanedawson @AndrewSiwicki We are so ready king!!!! 😭😭😭🔥💯💖 The #JeffreeStarCosmetics team &amp; I are on our way to @VansWarpedTour! 🔥 See you this weekend! https://t.co/uBry1Hvxc9 @MarlenaStell I've never been wrong... Right design babe!!! Looks so amazing. Tomorrow’s schedule:\n🔺 9AM PST - New video on my channel!!\n❓ 10AM PST - Mystery Box launch!!!! @LauraAnn_o yessss! @bby_baphomet exclusive to my website only! There is an exclusive new liquid lip shade called ‘?’ 😇 ONLY available in tomorrow’s premium and deluxe mystery boxes!!! It will never be made again... ❓hint: it’s very wearable and stunning, not a crazy color https://t.co/uK1AO7M4dS Omg hi good morning 😁💖🍭 @MrsDrAtlantis @kylieskin 💯 My phone’s Face ID doesn’t work anymore... 💀 https://t.co/yQZU1Ijrqn Come over after the weekend, we can sacrifice the McLaren or the pink Lamborghini... your choice 😁🥴 https://t.co/dBZM6qMjMz Hi Mystery Boxes, You Ready For Friday?? 🧡 I’m so excited to bring back our iconic ‘?’ boxes in 3 different sizes... Launching THIS Friday 7/19 @ 10AM PST / 1PM EST 🔥 https://t.co/ggsuKGiSis @elfcosmetics @AlyssaC55207516 I appreciated how secure it was!! 🙏🏻 HI @ultabeauty RESTOCK!!! 💖 Finally the #MorphexJeffreeStar brush set &amp; sponges are BACK online &amp; in stores!! 🔥 SHOP: https://t.co/zZjoRRPPvM https://t.co/H7uJOZofYB Good morning... Currently getting my full ass and legs waxed, how are ya? 😭 RT @JessicaBlevins: When two worlds collide. Beauty&amp;Gaming 💄 🎮 https://t.co/m8IxYoSOO4 RT @DottieCofficial: So excited to use these ❣️🎉 @JeffreeStar #JeffreeStarCosmetics #JawBreakerCollection https://t.co/6Gr8mx16Zk Hi double date, how are ya? 🖤 @Ninja @JessicaBlevins https://t.co/cPwft6zOQ0 I’m on my way to meet a few people I’ve never met before! 😇🔥 Any guesses? About to test out the new @elfcosmetics #JellyPop line for summer!!!😱💯 Review on my channel in a few days... 🍉 https://t.co/5V8O0Z05ab The iconic king @MarilynManson wearing my #BlueBlood palette 💙 He has great taste 😇 https://t.co/tivjppSLCR RT @risenshine70: This palette is perfection! Thank you @JeffreeStar for always creating such amazing products! #perfection #Jawbreaker htt… The highlight of Nathan's day today was finding out they're making Thor 4 and the who the director is ✨ There are SO many NEW @MorpheBrushes stores opening up this year!!!! 💄 I think it's time for me to cut the ribbon at a grand opening soon! 🔥 Just an alien among us trying to blend in 👽🧡 https://t.co/HwrdYYiXcw Ohhhh bitch, @UrbanDecay is launching a new foundation AND concealer!! 😭🔥 Claims to wear for 24 hours... Time to put it to the test!! Review coming soon 💜 https://t.co/lEyUQaVNeE RT @xStaciox: Oh my fuck @JeffreeStar https://t.co/2JQA7h9xA2 Oh you ready for Friday?? Happy early Birthday!! https://t.co/JYiZOE7tUT Welcome home Miss #Jawbreaker!! https://t.co/CIOaGcEdBw Omg yesterday’s video is #1 trending!! 😱💚  Thank you to everyone for watching and for all the love!! Nathan is SO in love with his #AstonMartin 🛸 https://t.co/AXvsLyyvZe I know what a PRE-ORDER is.. 😁 I just don’t like launches where we customers have to wait several months, the product should be available immediately when you’re at that level of success but that’s just my opinion. Doesn’t mean I don’t love Gaga, take a deep breath!!! https://t.co/3xM3ZISdme Everyone keeps asking me to review Lady Gaga’s @hauslabs makeup!! 😇 It went on sale last night but they’re not shipping until September... Ummmm 💀 How are we all doing today?? 😁 I can’t believe July is half over!! Pink Dreams 💖 https://t.co/Pn9qS1Eme2 How are we feeling about today's video?? Seeing Nate's face and his big grin was my favorite part 😄 https://t.co/QckTttCBU3 🧡 HI MYSTERY BOXES, HOW ARE YA?? 💚 Returning on JULY 19TH.... 3 sizes, all loaded with amazing items at an extreme discount 🔥 Mark the calendar... You don’t wanna miss it! #jeffreestarcosmetics https://t.co/wj4LI5kx32 On my way to Area 51 to warn my family about the human invasion... 👽 https://t.co/L3X8FUZsKV @fridaniicole aww so many good memories! @KelseyDickens4 😁🔥💖 @856Christine 💖💚 @mxyloxn Next weekend!! @wowQuinton aww yesssss! We ain't slick!!!! https://t.co/qw7TP7lGHT RT @sarah_lewisss: Cosmo and Wanda ain’t slick @JeffreeStar https://t.co/f5tFI3E8GU RT @iiiluminatiiii: Cosmo&amp;Wanda? We don't know her. \n@JeffreeStar https://t.co/FZci72tWKI 😱 NEW VIDEO ALERT!! 🥎 Surprising Nathan with his dream car... I love you baby!!!!! 🔑 https://t.co/AXvsLyyvZe Goooood morning everyone! 😇 Grab a snack and some lip scrub, new video will be up in less than one hour! RT @russianchola: She’s a beauty💕 @JeffreeStar https://t.co/RwzETISoDH 😇😇😇 RT @joely_62: @JeffreeStar Omg are you pregnant? Tomorrow I’m uploading a new video!!! 💚 Feat. Nathan and a huge fucking surprise 😇 OMG we are only ONE WEEK away from @VansWarpedTour in Cali!! 🍭💚 Who’s coming to shop #JeffreeStarCosmetics and meet me?? 🔥 PS. Everything will be at a discount the entire weekend 😇 https://t.co/wTSr7IknT9 RT @luckyzstar_: walking into area 51 and there is just jeffree star filming a makeup review @vicmram hi, how are ya? Time to add this amazing new @LouisVuitton #ArtyCapucines bag to my Vault! 💖💜  Welcome home.. https://t.co/YotFwxrSOC 👽😇 https://t.co/Yxzh3KQ5S2 I have the munchies. 😭😭😭 HEY DADDY, HOW ARE YA? 💚 https://t.co/tWNZ5J96D8 What color wig should I do tonight?? 😇 I’m surprising Nate with something crazy and the video will be up this weekend!! RT @KianaAudrey17: The #JawbreakerPalette is my favorite of all time 🙏😍😍😍👍👍 @JeffreeStar this is the most beautiful thing https://t.co/2Psq… The #Jawbreaker palette is officially back in stock!!! 🍭👅 SHOP: https://t.co/SVfSdq2ESn https://t.co/Kf2YQVN7H2 THE COUNTDOWN BEGINS... 🔥 We are ONE hour away until my major restock!!!\nALSO... Who's ready for all new METAL STRAWS?? 3 new colors launch today! #JeffreeStarApproved GOOOD MORNING!! 🍭👅 Today my iconic #Jawbreaker palette will be restocked on my website! ⭐️ Also Returning: shade C5 concealers!! https://t.co/YosQZ5S5Mw I was just trying to open a package and snapped off my left thumb nail 💅 RT @itshectormena: i want jeffree star metal straws TOMORROW I’m launching 3 new colors of my #JeffreeStarApproved metal straws 🔥💖 And finally the #Jawbreaker palette will be back!!! 🍭 https://t.co/8cmAb1pjV0 Ps. Tomorrow my #MagicStar concealer shade C5 will FINALLY be restocked!!! 🔥🔥🔥 Every other shade is in production and will be back next month but at least the stolen shade will finally have its return!! 😭🙏🏻 Filming the craziest video right now... Nathan is going to kill me 😂😂😂 I always feel complete with him by my side... 💯 https://t.co/9idu5Bw3sZ Who wore it better??? 😁🍑 https://t.co/lRfIO5YNC2 PUMP IT 🧠 https://t.co/sIfjkiYo1W LOUIS VUITTON BARBIE &amp; KEN 💖 https://t.co/5rrbmc3WPZ What new makeup launches are you all most excited for?? What products should I review next?? 😇 It’s not even 9AM yet and I’ve already had four donuts and a glass of milk… 🍩🥛 Good morningggggg! Trust is everything. @lindsaysimon97 C5 will be returning this Friday! HI RESTOCK, HOW ARE YA? 👅🍭 This FRIDAY the #Jawbreaker palette is BACK!! And of course, the iconic bundle 💅🏻 Mark the calendar! Don’t be late... ⭐️ https://t.co/DYFoq0tXF6 But the question is... Will it be Jeffree Star Approved? Can't wait to see the packaging and try everything on my channel! https://t.co/MdKyCRyXaK Goooood morning everyone... Has life been testing anyone else lately? Stay strong and don't let anything get the best of you.. 💯 In the makeup lab right now making 18 new #JeffreeStarCosmetics Magic Star concealer shade extensions and a few more color correctors 😇✨ Just saw this license plate on the freeway... 😂😂😂 Should I get their address?? #deceased #cremated https://t.co/9lyMdccstp Kinda craving a jawbreaker and Belgian waffles for breakfast 😇 When your man says get dressed, we’re going on a date... 💯 #Sunday https://t.co/Qo4N412WMM Sometimes YOU need to create what you want to be a part of… Let that sink in 💯 😇 https://t.co/zsxV2EqpAQ My iconic #MagicStar Translucent setting powder is finally back in stock! 💖 SHOP: https://t.co/XrT5xdUGL0 https://t.co/YnLtETYPf0 I’ll join you 😇 https://t.co/E8dsSXqjNN 😎 https://t.co/RnsT4Mq6OK RT @sirenasis: I AM SHOOKITH!!! 🔥 @JeffreeStar they are so soft 😭 https://t.co/u172TdmLbB RT @AshleyBurry613: 😍😍🍬@JeffreeStar https://t.co/afuca0jG3p RT @Type1Chlo: 🍭S W A T C H E S 🍭\n\n#JawbreakerCollection Velour Liquid Lipsticks by #JeffreeStarCosmetics 🍭\n@JeffreeStar https://t.co/luJda… 🔥💖 https://t.co/9CqmW8Y06G RT @barblovesmarley: This is beautiful @JeffreeStar https://t.co/xLFDqDMY5t RT @_s_jayne: Finally here 😍😩🙌🏻 @JeffreeStar https://t.co/PHsj5HKwOe Gooood morning to everyone but the earthquakes. Please leave California the fuck alone, sincerely Jeffree Lynn 🙏🏻 Going to try and get some beauty sleep now... Nate, the dogs &amp; I are all feeling anxious 🐶😌 I haven’t felt earthquakes this big since I was a kid... 🙃 This one was just bigger than yesterday’s. https://t.co/dJNvOifSqm How are we feeling about today’s new video?? 😜 Life really tried to stop me from filming this review 💀 https://t.co/bIqKPoyO7g RT @ashbongarzone_: @JeffreeStar BITCH IM SWEATING https://t.co/DfFKx427U4 MAKEUP PORN 🔥 https://t.co/5VE8fpd3lp Who else is only wearing #Jawbreaker all summer long?? https://t.co/ocOiE4OSC1 RT @dmvaars: @JeffreeStar My baby boy is LOVING watching your new video 😍 https://t.co/3vT4uIRq32 RT @Sarahray_10: @JeffreeStar new video &amp; Taco Bell  \nName a better combo. I’ll wait. https://t.co/cEoYGbxhsD RT @extraskinny2: Another day, another drugstore yaaas queen!😫⭐️💄 @JeffreeStar #JeffreeStar https://t.co/hb8BeXLn1e RT @WilliamsDaisy04: It’s so weird seeing @JeffreeStar using the makeup I use honeyyyyy we live for a drugstore queen🥵🥵 https://t.co/FnTdD7… RT @gmarieeeee27: This was literally me this morning trying to open a new lipstick I just bought, I can relate😂❤️ @JeffreeStar https://t.co… The best feeling. https://t.co/CXDNIWkVZC I found some good shit!! Who's watching right now?? https://t.co/oa22fRC6yb RT @Iightsxn: @JeffreeStar testing UK makeup honestly is life saving , now i know what to avoid and what to get 😌 RT @kneecoleayee: Making the break room watch @JeffreeStar 🥰 https://t.co/YGAVWWPFbQ RT @ZHWNzzz: @JeffreeStar yasssss♥️♥️♥️ https://t.co/iPgJLCG4kp 🤡 NEW VIDEO ALERT! 😭 Trying UK drugstore makeup for the first time... Missing Birkins, anxiety and the best $4.99 concealer in Europe: https://t.co/WPvfUkF4VT Goooood morning Star Family 😍⭐️ New video will be up in a few hours!! Waiting to give a fuck 💖 https://t.co/ThQo8AKQdY Guess what’s finally back in stock?? 💖 The #JeffreeStarCosmetics metal straws: https://t.co/TWNIlpxCLh https://t.co/erZP0H4G1j OK after almost a WEEK of hell to get my makeup and suitcases back, the DRUGSTORE VIDEO is filmed and done!!! 😂😂😂 Do we want the new video tomorrow or Saturday?? I love how earlier I was starting my drugstore makeup review and the #earthquake hit 🤡 Nathan just woke me up to say we need to start watching #StrangerThings3 NOWWWW! 😭🤣 Ok I’m up!!!!! RT @natural2slay: Happy 4th of July ❤❄💙\n\n#JeffreeStarCosmetics #JeffreeStar https://t.co/4ieoPPuLrF RT @fovvsflaws: It has arrived 😍 Can't wait to play 😻 #JawbreakerCollection #JawbreakerPalette @JeffreeStar https://t.co/DStZtvpMEA We just got the last good news we were all praying for!!!!! Zach just got his luggage delivered and all my drugstore makeup is safe!!!! 🔥 New video will be up this weekend!! Who else noticed my dog Da Vinci doing a hand stand while peeing on my Snapchat this morning? 🤣🐶 #talent #pomeranianlife Pink Pussy, Pink World 💖 https://t.co/518KHp6C1K Gooood morning everyone! How are we all feeling today? 🤩 RT @XxQuartz: I think what I love most about Jeffree Star is that he built himself from nothing and made himself into everything No new video tomorrow since all of the makeup is still lost in Zach’s bag, but at least there is a semi-happy ending so far 🤡 https://t.co/doNi9UA28U I can happily report that my ultraviolet Birkin bag is now safely in the vault!!!! 😭😭😭 Thank you @KLM for making sure it arrived safe 💜 #FreeTheBirkin https://t.co/CYcKexAAmq OH. MY. GOD. 😫 After four sleepless nights, 6 out of 7 bags are finally home!!! Sadly, Zach’s luggage still is lost and he had all of the UK makeup in his bag 💀 I quit hahaha https://t.co/6ub3Arjz2Z 🙃 PS. It's 2PM and still no luggage.............. They are telling us tonight. #FreeTheBirkin OH YA'LL READY FOR ANOTHER MYSTERY BOX? This month... Stay tuned ;) https://t.co/A5amQfGWum HI... Something REALLY huge and major is happening next month. I can't wait to share soon. #makeuptalk RT @KatDekema: Fucking shook. This is absolutely stunning 🥰💀🖤 \nThank god for @JeffreeStar https://t.co/X6icGUfNwL omg you WENT IN!!!! hope you love everything! #jawbreaker https://t.co/CDsBznew0E I can't believe the #Jawbreaker palette is SOLD OUT!! 🔥 We have more in production and my factory is telling me 2 1/2 weeks until next delivery! https://t.co/qYpXndkf81 @Lamborghini That’s major! Congratulations 🔥 Love my #Urus so much RT @JamilaGisselle: Got my hands on the @JeffreeStar Jaw Breaker palette and points were made 🍭 https://t.co/NLwxwafQZ2 RT @TheBeautyRadar: Omg don’t make me choose!! They’re all amazing 🤯 @JeffreeStar #JawbreakerCollection #JeffreeStarCosmetics #jeffreeprlis… If my luggage actually gets delivered to me today, I’m gonna film the UK drugstore makeup review and the moment me and my baby reunite… If someone didn’t steal it 🤡 #FreeTheBirkin RT @ConnerLinnic: @JeffreeStar Every @JeffreeStar Birkin bag right now is like “bring our sister back, bitches” https://t.co/0BVDaNHl2k @_juliannamolina Omg so many old photos!! Wow takes me back 😭😭 Finally some good news!! The airline says bags will delivered to me and my employees today 🙏🏻😭 #FreeTheBirkin https://t.co/pmAGIQS29o @skeaaaaaa hahha omg @Bellatrix_CSP @KLM lol no, that bag is safe in my pink vault! I'm filming this so you'll see which one soon if it ever comes home! RT @ScottyTLDR: @JeffreeStar The Birkin bag looking for Jeffree like: https://t.co/i58R2TaqWL @RebyHardy Jeffree Hardy is a given.. Let's make it easy!!! haha My Birkin is in that pile right now wondering where the fuck I am hahaha https://t.co/FuBH9UhWtH RT @kristinaaas_: OMG! Just got my hands on the brain freeze palette &amp; WOW my first @jeffreestar palette does not disappoint 😍😍😍👌🏻👌🏻🌟💫❄️ ht… RT @natural2slay: Jawbreaker and Candy Freeze 💙💗\n\n#JawBreakerCollection #JeffreeStar https://t.co/oKFHuZYVkm RT @Itsnotizzy: @JeffreeStar #PrayForTheBirkin Jeffree when he finally gets his bags back from @KLM https://t.co/nkniIO5Vas @2019_predicts @KLM working on buying one in 2020!!!! haha its time... MOOD: https://t.co/Iaa6RHJ6IZ @sebas_williams @KLM omg yes please!! send for back up haha And trust me, I'm aware of how stupid I am for packing it in my suitcase, but I honestly want the drugstore makeup back more so I can film hahaha #PrayForTheBirkin I HAVE A CONFESSION: I NEVER pack anything really valuable in my checked bags, but I did this time... A $60,000 rare Birkin is in one of my bags, @KLM give it back please or we gonna have a problem 😇 The UK drugstore makeup that I bought was in one of the bags so I can't film my new video today =( Praying the bags make it back to us all... I haven't told you guys this yet, but when Nate &amp; I flew home Saturday night w/the JSC team, @KLM Airlines lost all 7 pieces of our luggage... They promised it back Sunday, still nothing..... OH HEY THERE... YES BLEND!!!! 🔥 https://t.co/lvRdBc0Sby HOLY SHIT this is epic product photography!! HI!!!! https://t.co/jAZyLT8JWA RT @hannuh1517: My first palette ever from @JeffreeStar! This palette is huge and the colors are so pigmented. I can’t wait to use this bad… ENJOY BEAUTIFUL!!!! XOXO https://t.co/a0vqItA0yO @iamdorka thank you for the love! can't wait to hear what u think of it @_sophiageorgiou OMG INSANE!!! LOVE U! ❤️ GOOD MORNING... DELICIOUS! https://t.co/00Zd7Tl9CN @stephskowronski HOPE YOU LOVE IT!!! ❤️ RT @mattpowell09: LORD. HAVE. MERCY. ON. MY. SOUL. ON GOD THE PIGMENT THO, IM IN LOVE ALREADY. @JeffreeStar #JeffreeStarCosmetics #JawBreak… @lucyglows_ 😭🔥🙏🏻 RT @lucyglows_: @JeffreeStar using “yes ma’am” and “spank me” on top 💖 https://t.co/Jl754OSZrm Just a quick midnight snack 😂😂😂 https://t.co/UDhn0kkti1 RT @mattberlin7: Summer just got blinding.  😍 #JeffreeStarCosmetics #JawBreakerCollection @JeffreeStar https://t.co/x34K1Y5cHR Nathan just cut his hair short and wants to do a new color for summer... ✂️😁 What should he do?? https://t.co/Mh8u6FxL44 Anddddd welcome BACK to LA... 🍭 How Are Ya? https://t.co/pEPrDDHIvH RT @BethRoccisano: Diamond Wet💎💦✨ @JeffreeStar https://t.co/bETJgAgU9Z I’m on an 11 hour flight right now back home to Calabasas 😁💯 I’ll have new videos on my channel this week! 💖 Time to fly back home ✈️ What an incredible and inspiring week, thank you to everyone who came out and showed @MMMMITCHELL and I so much support 😁💯 https://t.co/VpdxOhLSlV LIVING BREATHING ART 🎨\nPainted by @MMMMITCHELL https://t.co/xgA9mXM5Kw Thank you Scotland, we are forever grateful 💖🔥 @MMMMITCHELL &amp; I love you so much! https://t.co/lSjDpcOT8J JAWBREAKER 🍭 https://t.co/nYwbK9du4N 💯 https://t.co/7tAjievW9P Gooood morning everyone! 🙏🏻 We are on our way to Scotland right now for today’s makeup masterclass 🏴󠁧󠁢󠁳󠁣󠁴󠁿 BARBIE &amp; KEN HAVE ARRIVED.... 🔥 https://t.co/ebZZL57C58 @safiyajn @tacobell I am exclusively filming there on opening night, Taco Bell is my life!! 😁 HIGH, HOW ARE YA? 💚 https://t.co/NLA9la3xqF @amandiecandy Hey! No, today is Thursday which means it’s only the 4th business day since we’ve been able to ship because of the weekend 💖 @chelsie_dunning Hey! Today is Thursday which means it’s only the 4th business day since we’ve been able to ship because of the weekend 💖 The #MINIBreaker palette is still in stock! 🍭👅 Jawbreaker may be SOLD OUT but grab the mini before she’s gone: https://t.co/SVfSdqkggX https://t.co/odN3z27YWT Gooood morning everyone ⭐️💖 So excited to have Nathan here with me for today’s #Manchester UK masterclass! See you all soon! RT @katdonoghue94: When @JeffreeStar casually comes into work. I CAN DIE HAPPY!😍😍😍 https://t.co/Rfljm0sFtA I’m roaming the city right now filming trying to find a full face of foreign UK drugstore makeup! 🇬🇧 #JeffreeStarApproved or nah? https://t.co/AmIqcJVJBB Studying to become a mortuary beautician, brb 🖤 https://t.co/xEPhD59AWy RT @misslauracoates: The @JeffreeStar brainfreeze palette is beautiful. I can’t wait to try freeze tag. JS highlighters are the best and it… She is a literal goddess!! 🔥😭 Send her my love and HAPPY BIRTHDAY! https://t.co/Fv9QcCxFjX Gooood morning everyone! 🙏🏻 Just waking up here in beautiful Manchester and can’t wait for tomorrow’s masterclass.. 😁 RT @Sugar_kis: ✨OMG it’s gorgeous!!!!!!🎉😭🙌💜 @JeffreeStar https://t.co/80LerTNHtC @MegaMilotic ⚰️🔥 @dgrimesx Yes!! FUNERAL GLAMOUR 🖤 https://t.co/zjXeXcga4s I’m working on a huge restock soon!! It sold way faster than we ever predicted and everything is now in production! 😭🙏🏻🔥 https://t.co/4v1koHigOk RT @MyMind02882686: My boyfriend just said he wished I loved his dick as much as @JeffreeStar loves his man's dick. 😩😂 RT @SophieJHM: Who knew a palette could get you moist? @JeffreeStar #JawbreakerPalette https://t.co/ygnIJtgjh8 @Kayydee25 thank you so much for the love!! @KreepyWithAK Yassss! GOOD MORNINGGG FROM LONDON!!! Can't wait for today's makeup class... Going to be MAJOR! 🔥 How are we all feeling? Excuse me, over here smiling with happy tears a few thousand miles away.. 😭😭 Thank you for always being YOU. https://t.co/j1neBWb7xk I’m speechless... 😭🙏🏻💖 Today’s makeup class was so unreal!!! I love you @MMMMITCHELL ⭐️ Thank you to everyone for coming!!! #soldout #uk https://t.co/CdHlDHtUTG I’m craving French toast and strawberries with a side of dick 😍🍓 Gooood morning from the UK!! 💖 Today is my first masterclass w. @MMMMITCHELL and I can’t wait to see everyone!!! https://t.co/cCvReYV2aS This is the most insane and incredibly talented artist I’ve seen in a long time!! 😭😭 The accuracy of my tattoos and dogs are so unreal!!! 😱🐶🙏🏻💖 https://t.co/5FjbEROwaM Stopping everything and watching now 👀😍 https://t.co/jGxEVImCUd THIS IS NEXT LEVEL!! 😭 Omg I’m deceased ⚰️ https://t.co/Se151LfBJs RT @Dayton_official: This is 🔥👌🏼 @JeffreeStar coming in HOT💯😘😍 https://t.co/bFmBXHr30o omg it's been so warm in London today!!! 🔥 we brought the California weather over... can't wait for my first masterclass w. @MMMMITCHELL tomorrow in Birmingham!!! @MrvynMCnificent WTF I would have just sent you the collection!!  😭😭😭 You. Better. Work. 💖 https://t.co/AJR6LfNlRe 🍬 Time to fly to London and meet up with @MMMMITCHELL for our makeup master class tour!!! 🔥🌈💯🍭 Cant wait to celebrate #Jawbreaker Collection all week long!! https://t.co/yx2zCkuCbg I can’t believe how incredible today has been already!!! 😭😭😭 We broke last years summer launch sales record in only 2 hours today!!! #Jawbreaker #JeffreeStarCosmetics https://t.co/YXK00ke53O 🔥💯 https://t.co/UbCRc1ZYbl 🌈 👅 https://t.co/Y3rjtux1LY RT @mariaagloriaa: Happy Jawbreaker Day. 🖤 @JeffreeStar https://t.co/1FYkTEVrTi @BrandyAHall1 Yessss!!! ❤️💖 RT @thejess_nicole: oh hey @JeffreeStar nice seeing you at Somerset in MI today 😉👋🏼 https://t.co/Ts1SxvqgKz RT @LuisOne17: What I spoiled my self with today so excited @JeffreeStar https://t.co/2v6J089i02 I’m so fucking proud of you!!!! 😭💖💯 https://t.co/oYAcC2sYDR Soft glam look using the #MINIBreaker palette 💖 https://t.co/oNb1ICtbYn RT @Its_Sammie_tho_: @JeffreeStar So thrilled that I got through checkout (with some hyperventilating) and got everything I wanted https://… @mariaagloriaa love you!!!! RT @Parrot_Fanatic: I mean. My bank wasn’t ready but I was.\n😂 #Shoppingspree #Brokebitch @JeffreeStar https://t.co/f1VFAD8fTb There is extreme traffic on my website so please be patient with checkout!!! We worked hard to make sure it didn't crash today ❤️  We heard ALL of your feedback after the #BlueBlood launch and appreciate you all so much! YESSSS BITCH!!! The white #Jawbreaker mirror and pink bag have SOLD OUT in 5 minutes WTF https://t.co/xW7qytq6yN SENDING SO MUCH LOVE!!!! 🔥 #JAWBREAKER IS OFFICIALLY HERE BABY!!! https://t.co/AfEukUwgZk oh my god the lines at @MorpheBrushes stores are INSANE!!!! I LOVE YOU GUYS!!!! https://t.co/IgdUBXc1Nf SHOP the #Jawbreaker Collection!!! 🍭👅 —&gt; https://t.co/SVfSdq2ESn https://t.co/34bYIUOFZm @bobbysglamworld omg this is so iconic!!!!! sending so much love to you all there!!! We are 20 minutes away!!!!!!!! 😭🔥🥴🙏🏻🔥💖 #Jawbreaker 👀 Gooood mirnungggg! 2 hours until the launch!!!!! https://t.co/AhqL9jeCbU Omg how am I gonna sleep tonight??? 🙏🏻🍭👅 We are less than 12 hours away from the launch!!!!!! Hi, tomorrow my #Jawbreaker Collection launches, How Are Ya?? 🖤 https://t.co/IVKiRlY2RF RT @bradleytodd12: @JeffreeStar launch tomorrow I've never been soo excited 😂🙏❤️🙌💜💙💚🧡🎉🎊 Omg I’m about to get my makeup done by an amazing celebrity makeup artist and film it for my channel!! 😭🔥 BITCH I’m nervous!!! RT @natural2slay: #GoldBreaker is hypno-fucken-tizing shade and blinding ⭐\n\n#JeffreeStarCosmetics #BrainFreeze https://t.co/GwRZr2PwAE RT @jaydemg4: @JeffreeStar YASS QWEEN. \n\nHi how are ya?! https://t.co/PvCFrgg0lk This is just the beginning for you!! Welcome officially to the #JeffreeStarPRList! I'm not doing a search right now but will be again in a few weeks! 💄 Thanks everyone https://t.co/Xjk4avB36e Hi, How Are Ya? 🧡 #Jawbreaker explosion https://t.co/Wq1FtpMxcZ YESSSS!!! WE. ARE. 2. DAYS. AWAY!!!!!!!! https://t.co/jUK3Wn5KIe RT @erinashleyisab2: The @JeffreeStar blue blood pallette has the best formula of any pallette I've ever used in shooketh \n#JeffreeStarCosm… 🌈👅🍭 RT @Brookeiful: Look what I got in the mail today 🙀👀 #MorphexJeffreeStar 💕 @JeffreeStar  Just leveled up my make-up game. 👌🏼 https://t.co/a… RT @JeffreeStar: Guess what’s FINALLY back?? 💚 My ‘High, How Are Ya?’ hoodies are restocked on our website!! AND we brought a new color alo… @TeaSpillYT Do I need to come and pay a visit? Yesss so proud of you!! 😭💯 If you guys buy any brushes today, use his code!! https://t.co/PBeqjPcNN7 OMG the #MorphexJeffreeStar BRUSHES are finally BACK in STOCK one last time online &amp; in all Morphe stores!!! 🔥 SHOP: https://t.co/scfhqQJtzW https://t.co/HboISp3PnM RT @SummarellAshley: Hi Mini Breaker, How are ya? 😍💜🧡 @JeffreeStar https://t.co/jSzYwqUehI OHHHH BITCH!!! He said HI, HOW ARE YA??? 🍭👅 https://t.co/Vq4O2nKk7n Good morning, time to sip some @redbull and watch some #Jawbreaker reviews!!! 🔥💯 This bitch is everything!!!!! https://t.co/jrn2bxk6rG This is beyond amazing, Nathan and I can’t thank you enough for the sweet gift 💯 https://t.co/W63U9lj2z0 @kathygriffin Yessssss please!!! 💯 HI SUMMER, HOW ARE YA? 🔥🍭💖 https://t.co/tEfPhcfQOC As a part time Michigan resident myself, I'd love to buy some land in Gay Hell! A cute pink mansion on a hill, nothing too fancy? https://t.co/ncBaRu48sk My mom just asked me if I ever have a \"normal boring\" day...\nAs I'm thinking of an answer, my door bell rings and it's an armored truck with 10 #Birkin bags 😄 I can’t believe the #Jawbreaker Collection is only 3 days away!!! 🍭👅 Finally introducing the 1st ever JSC #mini eyeshadow palette for only $28! 💖 We are also doing an amazing bundle deal of the mini breaker + Jawbreaker palette for only $75 😇 Mark the calendars... 6.21.19 🍬 https://t.co/hMZHXa2f6L The mornings are the hardest... The house is quieter, her bark was so special and distinct..  it feels so weird to feed 5 dogs instead of 6 now. 🐶 We love you Diamond, you are one of a kind and we think about you every minute of the day 💖 https://t.co/WERdFim6Lq Wow today was so beautiful, so many artists coming together for the love of MAKEUP and ART. 💄 Thank you to everyone who sent in their photos and work, I will be on the hunt again soon for more talent!! 💖 @erosmua @norvina1 Would LOVE to see this happen!! 🔥 🍭👅 https://t.co/Tc9TZ5Z0H5 Everyone being added to the #JeffreeStarPRList will automatically get every new release we have coming out this year! And bitch... wait until you see JSC fall and holiday. 😇 Also I'm sending all my other palettes and some JS essentials to get these amazing new artists started! @HYIMJEN @ThreeDailey omg it's overwhelming in the best way!! OHHHH YOU ARE STUNNING!! Love the UK so much! Welcome.. #JeffreeStarPRList https://t.co/HiGOXQsZyf HI FRIDAY, ARE YOU READY?? #Jawbreaker is almost hereeeeee! https://t.co/bAlkPge9Dn You are BEYOND amazing and I'm excited to see what you create!! Welcome #JeffreeStarPRList https://t.co/sYORerpfRk Let me add 5 more artists before my dinner date with Nate tonight.. First up: HOLY SHIT.. This is mind blowing!!! ❤️ Welcome to the #JeffreeStarPRList https://t.co/j74bUdJe0I I told myself I was only gonna add 25 people to the #JeffreeStarPRList but hours later and we have picked over 75 new makeup artists &amp; smaller influencers to the list!!! Most were DMed in private but had to share a few! 🔥 So many talented people out there.. I'm shook!! RT @shanedawson: me as a guru https://t.co/ncqoZW6T12 Guess what’s FINALLY back?? 💚 My ‘High, How Are Ya?’ hoodies are restocked on our website!! AND we brought a new color along... neon orange 🧡  Shop: https://t.co/tsbDRqdDUk https://t.co/KnewFVIDVk UMMM HI BABY!!! YOU ARE EVERYTHING. Welcome #JeffreeStarPRList https://t.co/u8ibyg40n0 @itsNICKSNIDER Respect. @CMercado1278 it's your time.. welcome to the #JeffreeStarPRList @vraamosmakeup Hi my love!! Wow 😭😭😭 welcome #JeffreeStarPRList @shanedawson Isn’t @ChrissyGlamm the best? Let’s have her take us makeup shopping 💯 I LOVE obnoxious and bright shades 💚 Here are swatch comparisons of my new summer #velourliquidlipstick shades #NoOffense VS. #VenusFlytrap swatched by @natural2slay  🍏 https://t.co/sZ0jLteUoz It would be my pleasure.. Wow these looks are insane and so detailed! Welcome #JeffreeStarPRList https://t.co/aqSI501pPK WTF!!! 😭😭😭 You’re incredible and it’s time you’re added to the #JeffreeStarPRList ⚠️ https://t.co/pDaeuubNXw RT @Nick_LGrant: I’m a hoe for makeup ✨ \n#JawBreakerCollection by @JeffreeStar https://t.co/Ko8yYtNbVh 💎 BRAIN FREEZE 💎 My brand new #SkinFrost Palette has 6 icy blinding shades to glow all summer long 💙 Launching THIS Friday w. the entire #Jawbreaker Collection 💖 https://t.co/ajujPdq4Ty Oh I'm doing really good now!! HI WELCOME #JeffreeStarPRList https://t.co/SaeQHJjggz YESSS THAT BLEND!! Hi, How Are Ya? #JeffreeStarPRList https://t.co/o16ZBhGrMT OMG WTF you are so beyond amazing!! Welcome to the #JeffreeStarPRList https://t.co/pQyprOkoKF YOU. BETTER. BLEND. Welcome to the #JeffreeStarPRList love! https://t.co/areIjqKJxk OMG HI! Your work is unreal and I can't wait to see what you create w #Jawbreaker 🍭 #JeffreeStarPRList https://t.co/wuTYGpTu1A Today is YOUR TIME babe! Wow... HI NEXT LEVEL TALENT, how are ya?? Welcome #JeffreeStarPRList! https://t.co/etAxGWbHX1 OH BITCH... You are everything!!! Welcome to the #JeffreeStarPRList! https://t.co/MtsxpYaTaY GOOD MORNING MAKEUP ARTISTS &amp; INFLUENCERS... I'm searching for more fresh faces to add to the #JeffreeStarPRList!!!! 🔥 Use the hashtag and send me your BEST looks! Going to pick 25 people today and will DM you for your address details if chosen💄 These swatches are so good! 🔥 Check out Tonya’s page for #Jawbreaker content, and she so happens to be brutally honest just like me 😇 https://t.co/5qziUH3el6 Good morning beautiful ⭐️ DM me so I can send you the entire Jawbreaker collection 😇 Who’s next?? https://t.co/zCxrN593Yp RT @ChrissyGlamm: 🥶Brainfreeze from the #JawBreakerCollection Sooo Icey &amp; literally sooo smooth 👌🏾 \n@JeffreeStar definitely killed it with… How are we all feeling about today’s review?? 😭😱 https://t.co/PCbVRo9A8D It’s almost time to unleash the #JAWBREAKER collection 👅🍭 We are only 6 days away until June 21st!!! 🌈  Who’s ready for THE summer collection? https://t.co/wxMZJKwPcZ I think @shanedawson’s beauty room has magical powers 🧡✨ https://t.co/r60w7QKJ2z @tanamongeau @sofiareumert Come over and ruin my Lamborghini collection!! @jjyoyo 🙏🏻❤️ @sofiareumert @tanamongeau 🙃 @VidjaGamez @juviasplace Thank you for watching ⭐️ @KNGGaGa @MorpheBrushes Yes! So many of you have been asking for a STAR MIRROR restock! ⭐️🔥 I just put up FIVE colors... Shop: https://t.co/U8eFsv9ptG https://t.co/kFyU4hr3pt 😭 NEW VIDEO ALERT! 🔥 Let’s dive into some makeup &amp; mental health... I test out the new @juviasplace foundation and concealer: https://t.co/2kVlMAIo3I @AnnaKnbl Welcome to the family ⭐️ The @elfcosmetics camo concealer! https://t.co/kF2OsbiNDe @heidipearman ❤️ @tiiasen86 yesss you look amazing!~ @mewnana2010 they go on sale this Friday on my website!! @ChrissyGlamm YOU DID THAT!!!! Wow making me so proud baby! Good morning... 🙏🏻 New video will be up in ONE hour and 30 minutes!!! 💯 Get a snack ready! Hi perseverance, how are ya?? 🙏🏻 Going to try and film a video right now and play with makeup.. and just vent about some real shit 💯 It will hopefully be up tomorrow... I’ve missed you guys so much 🙏🏻 This is so special, thank you so much 🙏🏻 Woke up for the first time not crying today.. Good morning everyone 💕 https://t.co/ovtvxjHreU We miss her every second of the day... 💖 https://t.co/qxifuwKKwQ Nathan and I have the most devastating news to share with you all… 🐶💔 #RIPDiamond https://t.co/yslBUwUCpF My heart hurts so fucking bad right now... it’s hard to breathe 💔😥 💔💔💔💔💔💔 RT @LeaBob_: Best formula! @JeffreeStar 🥰 https://t.co/iIzfUyJMMA RT @Anyvonterrormua: They’re even prettier in person 😭✨😍 can’t wait to get the jawbreaker collection too! 💕@JeffreeStar https://t.co/O81d2v… RT @LaPinkposh: @JeffreeStar New Claws &amp; New Gloss 💕💓 The Gloss ”Spank Me “ https://t.co/QU5QqTJlbg RT @makalahbeauty: My new aesthetic 💦🤤 @JeffreeStar https://t.co/CETJuIQebA HOLY SHIT!!!! My own jaw dropped... It's time you got added to the #JeffreeStarPRList 🔥 Welcome. https://t.co/YB8RsdDTud Thank you baby ❤️ https://t.co/Jf8FKbP4zi When anyone asks me what my favorite concealer is lately, it’s amazing that I can now say my own 😭😭😭 #MagicStar how are ya? ⭐️ RT @LyssaCharboneau: Okay but the real question is..why does @JeffreeStar think he can keep killing us with new drops? Blue Blood, conceale… @JoeyGraceffa Can’t relate!! RT @Solmita2009: Look what I received!!!! #Thegloss @JeffreeStar https://t.co/4U3homoSgj RT @Karinas_CC: @JeffreeStar Just received my FIRST EVER JSC purchase!!! I am so excited and obsessed!!! Can't wait for June 21st 😍 https:/… RT @HuntressTigress: I can officially say @JeffreeStar’s  #MagicStar concealer is wedding proof. I cried like a baby and it stayed put! Can… @MisterPreda I'll join you and we can search for a couple of them. RT @JeffreeStar: The inside of the #Jawbreaker palette 💦👅 https://t.co/ELd0TT04OA Who’s tried #TheGloss formula yet? Sparkle and shine, there’s a new bitch on the market ⭐️ https://t.co/IA2ELltMpy #Jawbreaker 🍭👅 I don’t know how to play it safe &amp; this entire collection is about being YOURSELF, being free to express yourself any way you want. Sometimes we create hard exteriors, to protect ourselves but it’s ok to open up and be who you want to be, unapologetically. 🍬 https://t.co/JSHQVYq3Rb @MorgaineMade WOW!!! This is incredible...!! How are we all feeling about yesterday's SUMMER REVEAL?? 🔥 The response &amp; feedback already has me feeling so grateful! 💛 I wanted to create the JEFFREE STAR version of a neon bright palette. https://t.co/VL4jnbZTy3 @Tonya_Stylz Can't wait for you to play with everything!!! 🌈 I love sucking on things. Omg WHAT the FU😭K!!!!! 🙏🏻 I’m deceased right now 🍭 https://t.co/qIzywANSqO The inside of the #Jawbreaker palette 💦👅 https://t.co/ELd0TT04OA THIS SUMMER. 3 Iconic Palettes. 🍭💚 I cant wait for you all to meet them soon! \n💦 full collection launching June 21st worldwide https://t.co/XYxME3cjGW Say HELLO to the #JeffreeStarCosmetics JAWBREAKER collection!!! 👅🍭💖 Watch the full reveal &amp; swatches: https://t.co/Tzpdbb92Bx Start your morning off with a deep breath, bitch. You got this. ☀️🙌🏻💗⭐️ Can it be tomorrow morning already??? THANKS!! Tomorrow we set another trend 🍭💚🔥🍬 #Jawbreaker Collection Reveal video will be live at 10AM PST https://t.co/0EopsnAgqE @AdrenBradley @beautylish Of course!! 🔥 Remember when I warned you about 2019 being insane? 😇👅🍬💖 For the first time ever, a #JeffreeStarCosmetics Mini palette will be released... 9 shades. $28.00 💯 \n\nSame iconic formula as #BloodSugar &amp; #BlueBlood 🍭 https://t.co/U7LR5M7GZL @100TPaint @Fleshlight 😇👅 Introducing the #Jawbreaker Collection feat. 2 eyeshadow palettes!!! 💦👅🍭 First, JAWBREAKER, 24 shades!!! My BIGGEST palette to date! 💚 Second, #MINIBreaker -the first ever MINI palette, feat. 9 shades!!! 💖 Entire reveal + FULL collection will be on my channel TOMORROW!! https://t.co/dMgYBngj6o Only God and my Mother can judge me... The rest is all noise 🙏🏻💎 https://t.co/BYqSRPYwCC 💖💯 One of the hardest things for me to do is turn off all my thoughts and stay calm. My mind is always racing.. If you've had a really long day, go watch my Snapchat or IG story and relax with me. @sweatyhairy @MakeupJackUK 😭😭😭😂😂😂 Nathan’s view 🙏🏻 https://t.co/AB1UsQVFeo Who else has gotten their THE GLOSS lip gloss yet?? Just warning you: The formula is fucking cute and smells so good 😇 https://t.co/JNcjY5P83n I’m about to go swimming naked in the Caribbean ocean w. Nate, be right back 💦 HI UK, I can’t wait to see you all in just 18 days with @MMMMITCHELL for our sold out masterclasses!!! 😭💖🇬🇧 https://t.co/1RnDA80OFn Every day I’m working on a better version of myself 💯 https://t.co/hGsCGKoiv1 Omfg 😭💯 LOVE how this looks!! #TheGloss https://t.co/tOIDzmDPf9 Experience THE GLOSS and turn up the shine 💦⭐️ Shop all 18 shades: https://t.co/PGnw8B8ykW https://t.co/BUutCw1N7d Goood morning everyone! 💖 Nate and I are flying off to our next destination right now ✈️ How are we all feeling today?? HAPPY BIRTHDAY to our baby Da Vinci! 🐶 He turned ONE year old today!! We are having a birthday party for him right 🙊💖 https://t.co/7VQYSHUjGf THANK YOU everyone for all the love on our new video!! ❤️ https://t.co/A4lGlLJk4V So proud of Nathan for working on his health and being dedicated 🙏🏻 We always push each other to be better versions of ourselves 💯 https://t.co/sY8X0i2Ei1 RT @smileysammiee: The best mail🙌🏼 #jeffreestarcosmetics  @JeffreeStar💕 https://t.co/ZO1gaoWmbf I'm gonna be filming some makeup reviews on an exotic island this week and testing out the much talked about @juviasplace foundation!!! 🔥 It JUST hit @ultabeauty today so let's see if I can find it before my flight!! How are we all feeling about yesterday’s review?? 😭 https://t.co/21MfyyZkEX RT @mackenzieskyd: *Boyfriend watches one @JeffreeStar video with me* https://t.co/wQewNUCdc5 RT @gaonadeb: I seriously want a friendship like @JeffreeStar &amp; @shanedawson \n😂😂😂😂 https://t.co/I97mM6Okvr This is what our Sunday night looks like 💚 https://t.co/jGQkyWUMoa Let’s all take 10 seconds to say a silent prayer for @shanedawson’s skin 🙏🏻 Only REAL friends can make you ugly laugh until you can’t breathe 😂😭 realiTEA 🍵 RT @AnnabelMorris98: @JeffreeStar @YouTube Hellooooooo https://t.co/ih3keGx53F RT @Walk_Away_Renee: @JeffreeStar @YouTube Wait is that my other package??? https://t.co/XZnrryLbHd RT @babym1027: “it doesn’t matter what brand..anything on the planet..you shouldn’t drink...a soap.” -jeffree star 2019 😂💙 @JeffreeStar @sh… OMG did Shane &amp; I break @YouTube again??? 😂😂😂 #YouTubeDOWN RT @JoannSh42229697: @JeffreeStar @shanedawson My morning reali-tea! https://t.co/sNZYb7cumZ 😱 NEW VIDEO ALERT!! 😭 Watch @shanedawson &amp; I test out every product from Kylie Skin.... https://t.co/QJsB5DhzjB Heeeey everyone, good morning!!! ☕️ When the weed hits... 💚 https://t.co/S12uGto1d2 We are working on a HUGE concealer restock!! 🔥 Everything is in production so I'll have a real date for you all soon!! https://t.co/7ouuuyhUYF This just made my entire day!!! CONGRATS on such a huge accomplishment!! Thank YOU for inspiring me to keep going. https://t.co/V0e0FlqUVF RT @Pamela_Ouafi: @JeffreeStar I’m in absolute Love! JSC is the best!!! https://t.co/ZC1H0FqO3M RT @lucyglows_: “ THE GLOSS “ by Jeffree Star cosmetics! 💖 absolutely love the feeling of these glosses on the lips, not sticky at all and… RT @natural2slay: @JeffreeStar Equality 💚💛💜💙🧡❤ https://t.co/YRNowSdKpO Happy Pride Month!! 🏳️‍🌈 https://t.co/piJvjH3lB1 Gooood morning everyone!! 💯 Even though it’s the weekend, take some time for YOU and work on a huge goal or idea you’ve been too insecure to start… The time is now. RT @_mirtaa: Sorry not sorry but I had to cop @JeffreeStar https://t.co/yeoSAfN7Zd The truth... 🍵 Video up Sunday. @shanedawson https://t.co/ijyh7fhQnM omg @shanedawson is on the way over to film... can you guess what beauty products we're gonna review?? Yassss watch my boo swatch #THEGLOSS collection 🖤 She puts the black gloss over #Weirdo liquid lip 😍 https://t.co/U6SYV2BWON RT @cindyaguirre_: @JeffreeStar 💦 \n#THEGLOSS #DiamondJuice 😍 https://t.co/TgyrwRyGGQ The Jeffree Star Cosmetics website now has AFTERPAY!!!! 🔥💖 SHOP: https://t.co/PGnw8Bq9cu RT @deniz_esa: I NEED the WHOLE @JeffreeStar #THEGLOSS set 😭🥵 RT @LexFolz: I NEED THE NEW @JeffreeStar LIP GLOSS OMG seeing so many of you at the @MorpheBrushes stores today has be DECEASED!!!! 🔥 https://t.co/7mEs2ZgaNE RT @Mcdoodles89: Omg I just got @JeffreeStar’s THE GLOSS and I’m so excited to try it!! \nI also made it in time. https://t.co/c4fY3nMESG WE ARE NOW LIVE!!! 🔥 SHOP all 18 shades of #THEGLOSS: https://t.co/PGnw8Bq9cu https://t.co/orVxWkvpsP @beautymcb13 YESSSS!! @CharleaMossner YESSSS!! We are less than one hour away!!!!! 😭😇😍💦💖 What shades are on your list?? Also the coveted #BlueBlood palette is finally returning!!!! 💙 Gooood morning everyone!! 🔥✨ We are 3 HOURS AWAY until #THEGLOSS launches!!! 👑 💦💦💦 Omgkmgomgomgomgomg only 12 more hours until my babies are out!!!! 😭🔥 #TheGloss 🥛 https://t.co/ZNypRYfyCP RT @MaerinB: Anyone else already have a @JeffreeStar cosmetics tab open in preparation for tomorrow? No, Just me? okay .... RT @JeffreeStar: I can’t believe tomorrow is the official launch of #THEGLOSS!!! 💦💖 All 18 shades + a HUGE restock of the #BlueBlood palett… HIIIIII... What new makeup products or launches do you want to see me review on my channel next?? 🔮 I'm pre-filming some content before I leave town again! RT @shanedawson: thank u @JeffreeStar for the new glosses! 👄🔥 https://t.co/Qq7PPjNDil I can’t believe tomorrow is the official launch of #THEGLOSS!!! 💦💖 All 18 shades + a HUGE restock of the #BlueBlood palette 💙 10AM PST / 1PM EST ✨ https://t.co/4mZ6uujFPz @antphrodite Sending you so much love 💖 The fact that I only started my makeup brand 4 1/2 years ago and now have the second most visited website for traffic and sales is SO UNREAL and humbling. I say this never to sound cocky, BUT... to remind you all that ANYTHING is possible. I never took NO for an answer ❤️ HOLY SHIT... Woke up to seeing Jeffree Star Cosmetics as the NUMBER 2 most ranked brand ONLINE! 🔥 Hi , how are ya? \nCONGRATS to @ColourPopCo for being #1! We are KILLING it! \nCC: https://t.co/zY1QuC0mpq @Nick_LGrant 😇😇😇 @MakeupJackUK There are so many out there I’m shook!!! Thank you for sharing some 🔥 @ChrissyGlamm Good morning my love 💖 She’s awake!! WHAT THE HELL!!! You are beyond your years! It would be an honor to have you on the #JeffreeStarPRList ⭐️ https://t.co/9nxieO9UM0 Hi! We love amazing blending 💯 welcome #JeffreeStarPRList https://t.co/6X1OvKLkQx Bitch... The talent!!! 😭😍 Would love nothing more than to add you to the #JeffreeStarPRList 💖 https://t.co/1ap0TRbaTO Good morning beautiful, welcome to the #JeffreeStarPRList 💯 check your DM’s https://t.co/2SqgtypNLM Omg I’ve been getting thousands of requests to review the new @juviasplace foundation!! 🔥 It’s currently sold out so I’m waiting for a restock! 😍 Who’s tried it?? Taking a nap in the pink vault brb 😌💖 https://t.co/gCw94t2oAY SWIMMING IN NOTHING BUT THE GLOSS 🛁💦 All 18 shades launch this Friday on May 31st!!! 💙 #jeffreestarcosmetics #thegloss https://t.co/DngFiXQHUc WOW HI, GOOD NEWS... Just got a huge shipment of #BlueBlood palettes from my makeup factory so I'm RESTOCKING the palette THIS FRIDAY with #THEGLOSS launch!!! 💙 Oh really?? Stay alive because you've officially been added to the #JeffreeStarPRList https://t.co/5PmNJX8wlE @norvina1 hahaha I'm preparing myself after I saw what you went through! WOWWWW!! You are beyond amazing.. Welcome to the #JeffreeStarPRList! Check your DM's https://t.co/0O59WaMaJM Long overdue!!!! Hi, welcome to the #JeffreeStarPRList ❤️ https://t.co/TG0lkR3xs9 OMG hi TALENT!!!! girl... welcome to the #JeffreeStarPRList https://t.co/k8WVDKje8W WOWWW that blend!!!! YASSSS welcome to the #JeffreeStarPRList! https://t.co/WRhO76UM7J OMG there are so many talented makeup artists out there, I wanna cry! Who should be added to the #JeffreeStarPRList?? UMM HI BEAUTIFUL!!! DONE AND DONE! 👅 #JeffreeStarPRList https://t.co/Q37MHH5qqc Can't wait to see some swatches babe! https://t.co/vPlVpjYP0B Baby you are a star!!! Hiii you’re officially added! DM me your address 💖 #JeffreeStarPRList https://t.co/RQiNkB02WJ Umm hiii! You are so behind talented!! Consider it done 💯 #JeffreeStarPRList https://t.co/aYK50Ek8M0 Love you too!! Who else should I add to the #JeffreeStarCosmetics PR list??? 😍😇 https://t.co/eO3PKtBpvj Pink Aesthetic 💖 https://t.co/bSk0nUkUca no love, Ulta doesn't carry Jeffree Star Cosmetics! (only my Morphe brush + sponge collar!) ❤️ https://t.co/o2H4Xb9GlB YASSSSS this Friday, EVERY AND ALL @MorpheBrushes store locations will have all 18 shades of THE GLOSS to play with and buy! 🔥 RT @CarrieMcgirl: @JeffreeStar Just over here trying to justify why I need all 18 shades of The Gloss. Holy heaven on earth they’re all so… RT @JeffreeStar: 🔥 NEW VIDEO ALERT!! 🔥 Introducing the FIRST ever #JeffreeStarCosmetics LIP GLOSS!!!! 💦  —&gt; https://t.co/NM1uiVBrA3 I'm ready to be dripping in shiny lip gloss and neon eyeshadow all summer longgggg!!!! T H E 👑 G L O S S \n18 shades. Extreme shine. Vegan. Cruelty-free. \n⭐️ Launching 5/31/19 https://t.co/mppBOx3rwn 🔥 NEW VIDEO ALERT!! 🔥 Introducing the FIRST ever #JeffreeStarCosmetics LIP GLOSS!!!! 💦  —&gt; https://t.co/NM1uiVBrA3 Goooood morning everyone!!! Omg I’m so excited about today’s reveal video that I barely slept 😭😭😭😍😍😍🔥💯❤️💖 Diva in the wilderness 🌾 https://t.co/obfkFrvEP4 Grateful 💜 https://t.co/km4O13GVao RT @JeffreeStar: LOOK WHAT’S BACK!!! 🥶 We’ve finally restocked our crossbodies ANDDDD added a blue to the line up! 💎 SHOP: https://t.co/tsb… Oh my goddddddd... The first ever #JeffreeStarCosmetics LIP GLOSS formula comes out this Friday!!!!! 😭😭😭🔥🔥🔥 Reveal video up on Tuesday 💯 STONED &amp; CONTOURED 🔥💜 https://t.co/CldhMHCZfa Remember to always take care of yourself 💯 https://t.co/fAxFE92TsD How are we feeling about yesterday’s new video?? 😇🤯 https://t.co/w9OenmrUdE FEELIN’ RED ❤️💯 https://t.co/si2jkAYfCU 😱 NEW VIDEO ALERT! 🔥 Full face of brands that DON’T hate me... YET 😇 -&gt; https://t.co/KtgOcDcaLC @ChrissyGlamm @beautybakerie We love you baby!!! Can't wait to see what you create OH HIIIIIII SURPRISE SALE!! 💖 Starting NOW until Monday night I’m having a 25% #MemorialDay discount on some major JSC makeup and fashion items!! 💯 Shop: https://t.co/y4dn99vzug https://t.co/i1kYTV46yD Tomorrow I'm uploading a new video 🔥 I missed playing with new makeup so much 😭😭😭 MY FIRST EVER LIP GLOSS FORMULA.... Launches on MAY 31ST!!!!! 💖 Reveal video up on Tuesday!! 🔥 \n18 shades. 2 formulas: Glitter Fantasy &amp; Extreme Shine ⭐️ #TheGloss was created to be iconic on it’s own or over any lipstick 🤩 Retail: $18.00 ⭐️ Vegan. Cruelty-free. https://t.co/re6QG4MZFl Remember to take a deep fucking breathe today and don't let the small stuff get you down. @EnvyImmortal Sending you so much love through this really difficult time ❤️ Gooood morning everyone! 💖 How are we feeling today?? CONGRATS JACLYN!!!! Can’t wait to try your formulas!!! 🔥💯 https://t.co/uoAlvr7xIX LOOK WHAT’S BACK!!! 🥶 We’ve finally restocked our crossbodies ANDDDD added a blue to the line up! 💎 SHOP: https://t.co/tsbDRqdDUk https://t.co/I1aViYmIYV Hi, How Are Ya??? ⭐ I miss you guys so much. We all need to talk.. I’m never doing this again. https://t.co/CJRYBCYw5o 🖤 OMGGGGG this is not a drill!! 🇬🇧 Tickets are NOW ON SALE for my UK master classes w. @MMMMITCHELL 💖 Shop: https://t.co/kxK0mHXX91 https://t.co/THsGQXC64V Taking a nap in the vault 😴 Wake me up in a hour... https://t.co/zvwzrO6rLo Daddy’s here 💜 @shanedawson https://t.co/HSaVc0XvKl 💯 https://t.co/uaS6pBo2NR @tanamongeau Yessss!!!! It’s a must. 🌮 Hi @Ninja! Come over and let’s do a T. bell mukbang 🌮🍕🌯 https://t.co/4XehlfMXJV Oh. My. God. 😱 Just heard that Taco Bell is opening a hotel this summer in Palm Springs! I’m gonna film me staying there as a guest 🌮 https://t.co/OWOzZVXWxC RT @tacobell: @JeffreeStar See you soon? 😏 Hi... I woke up craving @tacobell 😭😭😭 RT @BeeSlayinn: Unbothered \nHigh baby @JeffreeStar how are ya? 👀 https://t.co/e938VjDYyA RT @KylieMay_: Such a beautiful palette 💙 @JeffreeStar \n#JeffreeStarCosmetics #BlueBlood https://t.co/DZYRMyLyOS Hi Wig, How Are Ya? 💅🏻 Been on set for 12 hours and just wrapped! https://t.co/Kc2KVgZFXL SURPRISE RESTOCK!!! 🔥🔥🔥 We just got a HUGE shipment in of #JeffreeStarCosmetics FASHION and everything below is NOW BACK!!! 💖 SHOP: https://t.co/tsbDRqdDUk https://t.co/ygf6rmvDGZ Being in love is the greatest feeling in the whole world 🔥 #soulmates https://t.co/6TbISzpDAP Today I’m shooting one of the biggest campaigns I’ve ever done and it’s not for #JeffreeStarCosmetics 😇 RT @KimiKillem: @JeffreeStar https://t.co/PBh0VQE5bQ Happy Birthday Ryland!!! ❤️💯 https://t.co/HYhmQ2xvEZ @kylieobscene Omg 😂😂😂 Mood. https://t.co/ZhA54n6WFU PAINTED BY @MMMMITCHELL 💙 I’m so excited to go on our UK makeup masterclass tour together!! 👄 Silver, Gold &amp; VIP tickets will go on sale Saturday 18th May at 9am (BST) on https://t.co/v8Ni6KaJxo ⭐️ https://t.co/xiNE0LOlnH 🤮 NEW VIDEO ALERT!! 😱 Letting the person in FRONT of me order our food... omg I regret this!!! 🍔 PLUS a huge announcement: https://t.co/zM4Mzrxwbq Gooood morning everyone! 💖 In TWO HOURS I’ll have a new video on my channel! 😇 RT @loveejovi: The new @JeffreeStar concealer and setting powder has me looking snatched ALL DAY LONG @cezarsmakeup omg I'm i LOVE with this look!!!!! WOW. Hi talent!!! Time to get high ✈️ https://t.co/JoqmaNvPIU Tomorrow I'm uploading a new video feat. @MMMMITCHELL! We let the PEOPLE IN FRONT of us decide what we eat... ⭐ Jesus take the wheel!  \nPS. We have a VERY special announcement for all our UK babes ;) Goood morning Star Family! ⭐️ Today is our last day here in Michigan! What an amazing week here 😭😁 Just finished watching #GameofThrones and we have no words. Oh my god 😫😰😭 I'll be doing ONE more @MorpheBrushes grand opening event this month!! What city should I do?? ⭐ There are so many stores opening up, I'm proud to grow with my makeup family and expand JSC across the country!💄 @TeaSpillYT CONGRATULATIONS BABE!!! What a moment!!!!! Holy shit I can’t believe the first ever #JeffreeStarCosmetics LIP GLOSS formula launches in less than 3 weeks! 😭⭐️💅🏻💖 FULL reveal + launch date will be on my channel very soon 😇 Happy Mother's Day and special shout out to all the single mothers and fathers out there who have both shoes to fill AND still hold their own like my mom 🔥💯 #Respect HI! 💛 I welcome you with open arms! DM me, would love to be the first brand that sends you PR! https://t.co/w3ahJh6L5g OOPS, I must have been high yesterday.. Sorry, @GlamLifeGuru! 🔥💖 HUGE CONGRATULATIONS on hitting 8 MILLION subscribers!!!! https://t.co/JhybgiBfZU Breakfast is served 🍦Good morning everyone! https://t.co/JUBeaXDAUN @kamm_lester 😁 @MichaelFinchxo Missing you babe ⭐️ @_Kingkouture 💖💯 Hi, How Are Ya? 💯 @ChrissyGlamm And you are fucking beautiful and talented!! 💖 @AshlyeKyle You can have ‘em!!! 💛 @vicmram Come over ASAP!!! 🔥 While the beauty community is burning to the ground, I’ll be in my pink vault trying on new shoes... 💅🏻💅🏻 https://t.co/E6jONAGji2 Oops my bad, CONGRATULATIONS on hitting 7 MILLION subscribers!!!! 💯 Love you babe. https://t.co/42FoxkOge9 Unbothered 💛 https://t.co/Nj3VpPeVQ3 Gooood morning everyone! 😁 What color hair should I do for the store opening today?? 💖 #michigan #MorphexJeffreeStar I’m so excited for tomorrow’s @MorpheBrushes Michigan grand opening event!!!! 😭💖 Nate, Zach and entire our family can’t wait to see everyone! ⭐️ HUGE congratulations to the makeup queen @GlamLifeGuru on hitting 6 MILLION subscribers on YouTube today!!! 🔥💖 You are one of a kind. https://t.co/zXQOSjSIUQ RT @jewelian9: @JeffreeStar PINK VAULT CLOSET IS FUCKING INSANE. Bitch WE ARE LIVING.😩💕🥵💗 https://t.co/znkuOYUvLf @norvina1 @amrezy @RachelAlina iconic before it even starts!!! yassss @norvina1 Or we just collab and do a three way royalty moment 💵👜💰🕌 💖 NEW VIDEO ALERT! 🔥 The reveal of my PINK VAULT closet tour! Watch: https://t.co/E6jONAGji2 The Jeffree Star closet tour is going up in 30 minutes! 👜 WE ARE NOW LIVE!!!! 💖 Shop the #BeautyKiller &amp; #Androgyny palettes plus all restocked fashion ⭐️ https://t.co/thvazo0zVO https://t.co/XjIvKbkyCl We are 45 minutes away from today’s MAJOR restock!! 🔥 https://t.co/WAQPkaK6ak Omg thank God it’s Friday 😁 💅🏻💖👛👅👁 Grand Rapids vibes 🔥 https://t.co/dfjhITFPE8 CLOSET TOUR 👜💅🏻👛 TOMORROW on my channel. https://t.co/QJyrEeih5j SURPRISE!!! 💖😁 Tomorrow I’m doing a HUGE RESTOCK!!! My coveted #BeautyKiller &amp; #Androgyny palettes are finally making their return PLUS the red, black &amp; pink #JSC tracksuits!!! ⭐️ 10AM PST... Don’t be late!!! https://t.co/anK6AmZLmV Michigan @MorpheBrushes meet &amp; greet: I’m going to be meeting hundreds of people FOR FREE this Saturday! 🔥 If you don’t win to meet me, come celebrate anyway! 💖⭐️ we will be giving away brush kits, free makeup and having a huge party! I slept in for the first time in 2 years and I feel so rejuvenated 💯 Time for some pancakes, penis and shopping 👛 You GOT THIS baby!! We love you ❤️ https://t.co/hSwICkFSuY @linsmakeuplooks Wow so beautiful!! 😭💯💖 @sam_kunkel02 😂💯 The door to my closet weighs over 10,000 pounds, is bulletproof and can only be entered with my eye scan &amp; fingerprint… 💰👜👛 Full tour of my PINK VAULT will be on my channel this Friday! 👁 https://t.co/7yrFVaq9hA Just landed and it feels so fucking good to be back in Michigan!!! 🛩💙 Is Michigan ready for this weekend? 🔥💖 I’ll be cutting the ribbon at the GRAND OPENING of @MorpheBrushes store in @SomersetTweets! 🌟 Troy, MI this SATURDAY ⭐️ Wanna meet me?! Enter here: https://t.co/NkeJLSTx0G #MorpheXJeffreeStar https://t.co/3Z3vBzLXcL @MMMMITCHELL Love you always ❤️😭 I barely survived today while filming... 😫🤮 It will up on my channel soon! Thank you for all the prayers hahaha 🙏🏻 Omg why did I agree to film this?? 😭😭 I just  got into full drag to let strangers in front of me pick my food at the drive-thru 🤮 World’s pickiest eater is SUFFERING here! 🌶 CUNT GALA ❤️ https://t.co/CzTs2L9nFB I have a special guest coming over today and we are gonna film a wild &amp; fun video before I leave town tomorrow! 🔥 SET YOUR LIFE IN PLACE ⭐️ My #MagicStar setting powder is selling out fast but we will have a major restock soon! 💖 Who’s tried the formula yet?? It smells like soft cotton candy 🍬 https://t.co/BRWREd9fZR Who’s watched yesterday’s new video?? 😭🔥 I drug test Nathan and try $1 makeup hahaha 💵👅 https://t.co/RKsOciV21c In a few days we are jet-setting off to Grand Rapids, MI to visit our second home and film some fun content! 💙 We will also be celebrating the opening of the FIRST EVER Michigan @MorpheBrushes store opening at #Somerset mall! 🙏🏻 If you thought 2018 was crazy, get ready for the rest of 2019… Who else has a DRAFT folder full of tweet's they wish they could send out? I wanna keep it SO real sometimes about the behind the scenes in the beauty community... 🔮 but I'll let karma do it's work like it always does. @nicholassherry3 😇 Keep your lips smooth &amp; flawless w. my vegan and edible #LipScrub’s 💧👅 Shop: https://t.co/VrU2IJV6UU https://t.co/lm23fcTIgU @Wendys 🔥💯🙏🏻 @Ryland_Adams CONGRATULATIONS RYLAND!!!!!!!!!!!!! You are one of a kind. YESSSSSSS!!!!!! PROUD and so so happy! Love you all 💛 https://t.co/HYEwbJonJA Nate and I just finished tonight’s episode of #GameofThrٍones and we’re speechless 😫 Give yourself that extraterrestrial glow 💫 https://t.co/V7mdAuHETm How are we feeling about today’s video? 😭😇 What a roller coaster ride!!! https://t.co/VSUlfUcTGt No one wants sloppy seconds. When a store employee won’t let you use the store bathroom, there’s a REALLY good reason for that... 🤮🤢 #DollarTreeDiaries The Dollar Tree employee at the register legit told me: \"You're gonna need to exfoliate after you put this shit on your face!\" 😂😂😂 I'M DONE!!!! 😱 NEW VIDEO ALERT!!! 😭 Testing out @DollarTree makeup for the first time!!!! Feat. Nathan, crazy employees, and AlOT more 👀 -&gt; https://t.co/RKsOciV21c Goood morning everyone! ☕️🍵 New video will be up in 2 hours!!! @DarkoInc @gerardo_alicea 😁❤️ @prettypr0fanity I love you! ❤️🔥 @HYIMJEN @JosettyHurtado Wow I LOVE blue on you!!! 😭💙💯 Miss you friend! Tomorrow... 😭🌪😱💵🧨 https://t.co/bm7AvX98tV Tomorrow I’m uploading my FULL FACE of DOLLAR TREE makeup video! 😭😱 It was a wild adventure feat. Nate, bad yelp reviews, insane employees and cheap makeup 👀 RT @Wendys: @JeffreeStar Feeling Spicy bb 😉 Star Family, help make this happen!!!!! 💯 Wendy, How Are Ya? 🍔 https://t.co/MdjkGWgQme @jakepaul @Postmates 🌪💯 I’m so ready for summer 🔥 The next #JeffreeStarCosmetics collection is next level... 💧💦 @angela_boblitt Tomorrow! 😁😇 @LadyBaldy This made my morning!! Thank you for the feedback 💯❤️ @jmerrica 💯❤️🙏🏻 @Livibmakeupart1 😇 @kamm_lester Hi beautiful! 🔥💙 Nate and I ordered breakfast using @Postmates and the driver was so hot we almost invited him inside for a threesome but I was starving and wanted my pancakes more 🥞🔥 @brandonluxxe ⭐️🔥 @trishapaytas What’s aging?? Just finished filming today’s video and I’m shook 😱 RT @mariana96_d: I’ve never in my life smelled a makeup product that smells as good as @JeffreeStar’s setting powder 🍭🍬 Goooood morning everyone 👅 Today I’m filming at the Dollar Tree so say a quick prayer and let’s hope the makeup there isn’t as expired as TJ MAXX 🤮 @MorpheBrushes @SomersetTweets 🔥💯 RT @kaitlyn_sibley: such dreamy packaging 👅🌟💓💅🏼@JeffreeStar https://t.co/AWgIjAhpcU RT @Honeybadgeerr: I’ll never use another concealer ever. This is it. I’ve found the one 🥰💕👸🏻💍👑 @JeffreeStar #MagicStar #c13 #JeffreeStarCo… RT @Hannahortiz_16: Okay not to be dramatic but @JeffreeStar concealer is LIFE CHANGING This weekend I’m FINALLY filming my first ever closet tour in my new pink vault 😱 We are always watching.... 👁 @shanedawson https://t.co/unEajPmjxs Buckle in. @MrvynMCnificent @kamm_lester WOW this is so hot. The first ever #JeffreeStarCosmetics LIP GLOSS formula launches THIS MONTH!!!!!! 💧 I'm so excited to continue to expand my brand and bring you NOTHING BUT THE BEST products!!!! I just got woken up with breakfast in bed and flowers, how the fuck is this my real life? 😭😭😭 4 years later and he still gives me butterflies 🦋 👀👀 @Nick_LGrant @MorpheBrushes It’s already open! Tyson’s Center 💯 Hey Michigan... The first ever @MorpheBrushes store is officially open at the Somerset Mall in the city of Troy!!! 💄 You can now shop my entire brand!!! 👀 And guess what? We are having a huge grand opening party VERY soon 😇 Stay tuned.... WOWWWWWW. I'm deceased... Drop dead gorgeous! https://t.co/rscpcA2LgZ Ohhhhhh tea! 👀 Can’t wait to watch 💯 https://t.co/0K3dGSu7GY RT @Jennyfaaa303: Magic Star concealer is LIFE CHANGING. Thank you for putting your heart into it @JeffreeStar, it does not go unappreciate… RT @Suzyspeers: My skin felt like a soft blanket after trying @JeffreeStar new concealer and powder omg \n10/10 recommend I almost felt sad… There’s a new bitch in town... ✨ #MagicStar™ https://t.co/WEy3NTIXke CONGRATULATIONS to these 5 lucky winners!!!! \n⭐ GRAND PRIZE Gucci winner is @prettypettypete\n💛 THE 4 Blue Blood/@milanicosmetics winners are: @lipstick__lexx @AliceAlfaro_ @ayeleigh143 @rafyprz\nThank you to everyone who entered!!!! More giveaways will be happening in May! Hi... 😇 I’m announcing my 5 giveaway winners in 20 minutes!!!! Don’t underestimate me 💯 https://t.co/zb1iaxMsZH Nothing better than morning sex before work 😁 Arya is THAT bitch!!!!! 🗡 OH MY GOD. Ok I’m having a #GamefThrones viewing party at my house right now brb HOLY SHIT  ❄️⚔️ #BattleOfWinterfell Home 😍 https://t.co/DPV58rWWm8 ✈️ Time to head home for a few days before my next adventure... Beauty sleep brb Tomorrow my Gucci/Milani makeup giveaway ends!!! I’ll be announcing the winners here and on Snapchat/IG stories 😇😁 RT @CandyceLindeman: I just went through @Avengers #Endgame  I may have cried a little, but it helped me experience that my @JeffreeStar ma… I love you guys so much 😍🥺 https://t.co/6gE2Y5vWih @ceeethegee I’ll have an update soon! MOOD: https://t.co/LRSZa5jmeX @sakura87231 Thank you for the feedback babe! 🔥 RT @Doofus_doobis: I’m sorry this is iconic 😍 #jeffreestar @JeffreeStar https://t.co/dGe6pAdjAK Today was so fucking perfect 😁 RT @kamm_lester: I never lose. I either win or learn. @Brenda_Star66 There will be a @MorpheBrushes store opening up in Troy, MI next month! IT’S MAGIC BABY... ✨⭐️ https://t.co/52PwMwWOMB @shanedawson @GlamLifeGuru I love you guys so much. So happy we all found each other... 💯 Omg gooood morning!! 🔥😭❤️💯 Today we are opening up the brand new @MorpheBrushes here in #Portland 🌈 Can’t wait to cut the ribbon and celebrate! How are we feeling about today’s full face drugstore video?? 😁 We just landed in #Portland and I’m craving @VoodooDoughnut’s!!! 🍩 @raquelgifford Omg yassss!! Let me know what you think of everything after you try it! Yasssss #MagicStar how are ya?? ⭐️ Watch my boo @Tonya_Stylz review my new concealers: https://t.co/XpP45g0POn RT @JeffreeStar: 🔥NEW VIDEO ALERT!!🔥 Today I’m testing out a FULL face using ONLY @milanicosmetics makeup!!! 😱 ALSO.... There is a HUGE giv… 🔥❤️ omg yes!! https://t.co/T1D0jOEsmx I’m so honored and excited to announce that #JeffreeStarCosmetics will be joining @VansWarpedTour on the west coast!!! 🔥❤️ JULY 20th &amp; 21st 🎸 I’ll be doin’ meet &amp; greets for hours both days at my huge tent!! Who’s coming??? 😇 https://t.co/t0gYZgw1VO Thank you for trusting me and my team to bring your amazing visions to life!!! 😭💯 The world isn’t ready for what’s next!! ✨ https://t.co/pSjonvRT2x Bitchhhhh why didn’t you guys tell me how good the #Milani conceal + perfect foundation was??? 😭🥺💯 🔥NEW VIDEO ALERT!!🔥 Today I’m testing out a FULL face using ONLY @milanicosmetics makeup!!! 😱 ALSO.... There is a HUGE giveaway so watch the intro to enter!!! -&gt; https://t.co/iaZYiK2Hsw Get a snack and a @redbull ready, new video going up in ONE HOUR!!!! 😍🥤❤️ @TJKilla_0 noooo tell that that is a horrible idea!!! haha Girrrrrrl today’s gonna be good 🍵 📸⭐️ https://t.co/0qBkzVuZs8 ONG I can't wait to be in Portland, Oregon this weekend!!!!! 💜 Who's coming to celebrate the opening of the NEW @MorpheBrushes store with me?? Who’s ready for tomorrow’s giveaway? 💙 4 lucky winners will get: $500 in @milanicosmetics, and a #BlueBlood palette!!!\nGrand prize: brand new Blue Velvet @Gucci bag + palette &amp; Milani makeup!\n😇 Details will be in tmrws video intro! https://t.co/jUwgaioC1n Today I’m filming a new FULL FACE DRUGSTORE MAKEUP video!!!! 🔥 After thousands of requests, I’ll be testing out the brand @milanicosmetics! 😇 Video will also include a huge giveaway!!!!! @RhukyaD well you still have time today to knock out a session! OMG hi!!! I love you too!! Thank you for all the support and love 🔥 https://t.co/IHtvD3Z6vL @megaansaample @MorpheBrushes yes it will be! RT @huntergrandee: i’ve never seen a more beautiful display 🛍🖤 @JeffreeStar @MorpheBrushes https://t.co/UopKjvqs5w @americansam_1 let me know what you think of the formulas!! @LifeofMari_1 yasssss ENJOY!!! RT @LifeofMari_1: I’ve never seen something so pretty ✨⭐️ @JeffreeStar https://t.co/cbQeEoa4Q0 @JohnMil92540090 hey! no, you can buy them from my website though! Good morning everyone... time to wake and bake 💚 @TeaSpillYT Yasssss 💯 Welcome to the Star Family. https://t.co/0SJ50EAdBc RT @natural2slay: Swatched #magicstarconcealer C7 Light &amp; C13 Light to Medium both Neutral undertones 💦\n Rose &amp; Beige #magicstarsettingpowd… @kamm_lester baby blue!!! We are on set shooting DAY 3 of #JeffreeStarCosmetics summer campaigns!! 🔥💖 Cant wait to start revealing everything soon.... RT @MistyGQuartz: Well Shoutout to @jeffreestar he is a fucking genius, this shit is fucking magic bitch, I will never in my fucking life u… HIIII PORTLAND, OR! ⭐️ THIS SATURDAY I’ll be the special guest at the GRAND OPENING of the @MorpheBrushes store location at Washington Square mall!!!! 💖 Date: APR. 27TH ✨ Wanna meet me? Details: https://t.co/CYKuGL4qdA https://t.co/PKMQ2dgoXt Gooood morning everyone! 🔥 Let’s conquer the day and work on something we’ve been putting off but KNOW is necessary to accomplish. @Danielle_Alizia You are so beautiful babe!!! Omg love your content 😭🔥 @gabrielzamora Hi baby!!! 💯 TATTOOED BARBIE 💉💖✨ https://t.co/nBgyJFbcQo THIS REVIEW IS GIVING ME SO MUCH LIFE!!!! 🔥 https://t.co/FulAUxQ9JA RT @httptxsha: @JeffreeStar it’s the best concealer i’ve ever tried! the formula is soo gorgeous and lightweight but also full-coverage! 🙌🏻… RT @jadeboulterx: I don’t care what anybody says but @JeffreeStar WINS at packaging and formulas 😍 #MagicStar\nICONIC✨ https://t.co/GNitIbGr… RT @ScribnerNona: @JeffreeStar They are literally a dream! So smooth and creamy 💕 https://t.co/k0SSG3ICLP How are we all feeling about the #MagicStar formulas??? 😇 https://t.co/yot6Lrl4us @japanslayzz @ABHcosmetics WOWWWW this is magical!!! I'm so sorry for not uploading any new videos the last few weeks! I wanted to focus on my new makeup launches and spend time with my mom and family. Thank you all for understanding and I'll have a new video up this weekend! This weekend I’m doing a meet &amp; greet and I’m announcing the city tomorrow!!🔥💖 @gabrielzamora 🍵 As soon as this mouth numbing stuff wears off, I’m sucking dick 🧠 I’m at the dentist getting my root canal finished 😭🥺 Send help 🦷 @shanedawson 🦂 @GlamandGore @shanedawson 🐷 The truth always tastes better than a lie ☕️ RT @AmandaTheCatbus: I know I’m really late to the Blood Sugar party, but Jeffree Star really fuckin DID THAT. Preach!!!! 🔥💯 https://t.co/63F9PWRFj3 omg I'm #deceased https://t.co/6V6TfvJWjz RT @janneviset19: @jeffreestar Finally got my hands on these beautiful babies 😍❤️ Newest addition to my makeup collection https://t.co/5Ms3… RT @LeaBob_: By far the best concealer I’ve ever had!! 💞 @JeffreeStar https://t.co/eSQj9savmF @aliensalice Thank you love! ⭐️ Enjoy babe! 💉❤️ PS. #BloodSugar is officially restocked on my site https://t.co/BiQ7peRILJ Oh hiiiiii! 🔥 https://t.co/wGRuTdZVNi Hiiii everyone! 😇 The #JeffreeStarCosmetics team &amp; I have been packing and shipping #MagicStar orders since 5AM 🔥 RT @saneesha26: Got the Magic Star c15 concealer &amp; beige setting powder today! I'm dying over how creamy and velvety yet lightweight it is!… @TheSelfCareGuru Thank you for the feedback love!! 😭⭐️ I’m watching reviews on #MagicStar and seeing all the amazing feedback has me crying on the couch like a little bitch 😭😭😭 RT @t8barney: Oh, your Easter bunny didn’t bring you Blue Blood? \nCan’t relate. @JeffreeStar https://t.co/8fY0sBM49R RT @KrystalKBeauty1: ICYMI 🔥🔥🔥 The NEW @JeffreeStar Magic Star Concealers &amp; Setting Powders are insane! \nhttps://t.co/PhmU0b185J RT @Nick_LGrant: C13 kinda day\n@JeffreeStar #MagicStarConcealer https://t.co/v2WrzVnfuX RT @chellefries_: I wore the @JeffreeStar concealer all day yesterday, and it's safe to say that it officially has replaced my shape tape.… Full coverage AND hydrating? 🔥 Shop the #MagicStar concealers: https://t.co/Tc3ICCAEUM https://t.co/VbqfBfO50W High, How Are Ya? 💖🔥 @jake_b213 @baseballbello This is my favorite photo today 💚 Today’s plan: Hot box the entire house 🔥💚 RT @Kel_Bell124: High, how are ya? @JeffreeStar 💚 https://t.co/1jgJ6MB3dC @beauty_geekaz yes of course! waiting for my next shipment to come in! RT @TylerTelles: Happy 420✨💚 thank you @JeffreeStar for making the best #420 merch https://t.co/cd6U0FmHDG RT @TylerTelles: thank you @JeffreeStar for the most LIT 420 ✨💚 everrrr https://t.co/L2gZAb7GpM @jmari_artistry @ABHcosmetics @norvina1 YASSSS!!! WOW! #flawless RT @xxOnikki: Happy 420 bitches 💅🏼 @JeffreeStar you need to make rolling trays Im using the alien palette to roll my blunt lol😆 https://t.c… RT @JackWetherill: Right it's not even funny how unreal this packaging is (and the powder smells delicious) 😍 @JeffreeStar just killed it (… Gooood morning!! 🔥💚 #Happy420 everyone! Surprise restock of EVERY JSC grinder! 💚 Shop: https://t.co/U8eFsv9ptG https://t.co/05uGiUCz2L @sadfag_jpg @MorpheBrushes And how are we feeling about the formula? RT @Hepps_Laura: We live for a good packaging moment @jeffreestar #magicstar This bitch looks like she gonna cover up the last 10 years of… RT @Schnatziii: Look at what arrived today 😁 Perfect timing @JeffreeStar https://t.co/6xZYApiwLK RT @Curvykinkster: My @JeffreeStar grinder got here just in time for the holidaze 😍😍 https://t.co/T4lkr6BYE0 💚 @darienisaac_ Omg this is everything 💙 RT @makeupbyj5: I’m about to be snatched bitches 💁🏼‍♀️✨ @JeffreeStar #jeffreestarconcealer #jeffreestarxmorphe https://t.co/xTpaYpHNsI RT @Skylarverse_: @JeffreeStar I’m honestly in love. Sis got me shook. 😍😍😍 https://t.co/1P0w1Igl1b RT @Negrita2100: I see it, I like it, I want it, I got it 🤗🛍💅🏽🤪@JeffreeStar @MorpheBrushes https://t.co/ukPXp1cmut RT @san10mari: beautiful jstar concealer and powder display @MorpheBrushes  @JeffreeStar \n\n#jeffreestarconcealer #MorphexJeffreeStar #morph… RT @zombiiexgore: God that display tho!!. @MorpheBrushes @JeffreeStar https://t.co/DSAI0vcv53 RT @inkedmom83: @JeffreeStar The line at the Scottsdale Fashion Square Morphe store. 2 security guards and 1 cop making sure nothing goes w… @AdoreDelano @eynboado I've been ready baby. RT @chamujm: @JeffreeStar it’s here ,just in time 💚💚💚✨ https://t.co/ZUKxU6udi2 RT @AnnelieseBL_: @JeffreeStar 🥰😍 https://t.co/Dbx6rtrLK8 @xmollymccabex1 @MorpheBrushes yass thanks for the love!!! hope you like them! RT @honeybearcub2: Star power turn me into @JeffreeStar ....creasing we don’t know her.  #MagicStar #hihowareyou #sailormoonvibes #JeffreeS… @pjiminpersona thank you so much babe! RT @evestyle82: @JeffreeStar I’m in LOVE https://t.co/4BKYLY2TRN RT @LaPinkposh: @JeffreeStar MAGIC STAR CONCEALER &amp; MAGIC STAR SETTING POWDER #magicstar #jeffreestarconcealer #jeffreestarcosmetics https:… A new formula is in town... ✨💖 How Are Ya? #MagicStar https://t.co/f0UNn6CKaK RT @shanedawson: i’ve been filming with jeffree on the journey of this concealer launch &amp; i’m so proud of him for what he’s made. that pic… RT @makeup2themaxx: Hi Matching Nails, How Are Ya? @JeffreeStar #jeffreestar #jeffreestarconealer #makeup #MagicStar https://t.co/1Aa8tJb2nL RT @calvialy: Literally a few months ago I was saying “dude if @JeffreeStar made a concealer that would be a dream formula” now #MagicStar… YASSSSS the makeup review icon @GlamLifeGuru, sat down and played with the #MagicStar collection! ⭐ Watch: https://t.co/sK5QyTx0qu Hi #MagicStar how are ya??? OMG are ya'll trying to break my website again? SHOP the #MagicStar concealer &amp; setting powders!!! ⭐️ https://t.co/Tc3ICCSfMk https://t.co/oNFLKwyOHa ONE HOUR AWAY!!!! ⭐️ Who’s ready??? Omg seeing everyone line up at all the @MorpheBrushes stores for #MagicStar is making me so emotional!!! 😭💯 https://t.co/ZlkGqN5SSC Gooood morning everyone!!! 😇 We are 3 HOURS AWAY from the #MagicStar launch!!!! ⭐️ Here is a concealer chart with every undertone listed! https://t.co/qlOPm1nkAl RT @jennatthemouse: I’m at @MorpheBrushes in Orlando waiting for the #MagicStar concealer release. 40 minutes before store open there is a… RT @Panda16Manda: GUYS @JeffreeStar concealers literally launch is about 12 hours and I can’t even sleep, I feel like it’s Christmas and I’… RT @JeffreeStar: Who’s ready for tomorrow??? 🔥⭐️ The #MagicStar™ concealer &amp; setting powders launch at 10AM PST / 1PM EST ✨ https://t.co/lZ… RT @Trendmood: Cause we need it... Comparison #SWATCHES 🚨 *in sunlight\n The #MagicStarConcealer \nAlso Did Live Swatches on my YouTube Chann… @velvetwink 💯😭🔥 RT @velvetwink: I just tried @JeffreeStar new concealer and powder on a client... the smoothest skin ever 😛 (plus we both loved the cotton… Time to fly back to LA and get ready to celebrate tomorrow w. the #JeffreeStarCosmetics team! ✈️✨ Omfg I can’t wait for tomorrow’s launch!!!!!!!! 😭😭😭 🔥💯 #MagicStar™ https://t.co/umdWx9fJg0 Shopping in Atlanta with my boo @darienisaac_ 🔥 https://t.co/57OgXk9mNY Who’s ready for tomorrow??? 🔥⭐️ The #MagicStar™ concealer &amp; setting powders launch at 10AM PST / 1PM EST ✨ https://t.co/lZVnNNfjAR Good morning daddy ✨ https://t.co/NMMDVzSfkD 💦 Shade #C5 will be available on my website on launch day!! ✨ Just way lower quantity than the other shades.. we have more on order and will restock as fast as we can! #MagicStar™ Concealer is almost here... Hi coverage, how are ya?🔥 Swatches by @Trendmood https://t.co/nHViW5oqJl The iconic #BloodSugar palette is BACK in stock! 🧨🧯❤️💯 SHOP: https://t.co/OQA45CFmPG https://t.co/Wv9Vd8uI00 RT @AlfredLewislll: This @JeffreeStar concealer is fucking amazing whatttttt RT @JeffreeStar: The #MagicStar concealer is life changing ⭐️\nWill available ▶️ APRIL 19TH @ 10AM PST Online #JeffreeStarCosmetics + \n@morp… @ColeCarrigann Omg hiiiii 2019 content!!!! Great, your first assignment is Jeffree Star Cosmetics Inc. VS. TJ Maxx &amp; Burlington 💯 What’s your hourly rate? https://t.co/3Up6sSFmhq A new formula is in town... ⭐️ #MagicStar #Concealer feat. @gabrielzamora https://t.co/QOQYbSCPzh Umm HI!! I love your artistry! 😭💙 DM me your address and it’s official https://t.co/DNv89XqJIH BRB I have plans this weekend!! 😭🍔💚 https://t.co/FbKoXTXUNj CREASING WHO?! CAN’T RELATE 💫✨ My #MagicStar setting powders come in 8 flawless shades 🔥 Launching THIS FRIDAY 4/19/19 ⭐️ https://t.co/OWKX3KSLyu 💯 https://t.co/gbJ0HbkcKF 💚🔥 https://t.co/IRG463dLU4 It’s such an honor to have you a part this campaign Kam! 🔥⭐️ https://t.co/0654HvZWKB RT @sparklylush: She has finally arrived in all of her glory! @JeffreeStar worth every second of the wait! 😍 #blueblood https://t.co/iq1loI… Good morningggg everyone! I’m getting on a jet right now... ✈️ 💙 @ThompsonDTyler 🔥💯 💯 https://t.co/BJI4Z9f2JG SUMMER WILL BE FUCKING LIT 🔥 #comingsoon #JeffreeStarCosmetics https://t.co/G5z0Xe5z8q OH MY GOD 😱💙 Nikkie!!! This look is SO stunning 😭💯 https://t.co/DKHnlmJ9Ew Blood Sisters ❤️💙 https://t.co/YF4gRUIEOh @ElizaXfaith They launch in stores the same day as my release! Some people are really afraid of the truth. Can’t relate. RT @GabbyCeciliano: Running out of concealer just in time for @JeffreeStar 's new line. 😊😍🤯\n\n#magicstarconcealer #shook #Excited #snatched RT @Amber_Hdz: If my bf doesn’t get me the @JeffreeStar concealer and setting powder we’re breaking up MAGIC STAR™ SETTING POWDER 💫\n\nSet your life into place with the first ever #JeffreeStarCosmetics #settingpowder ✨ Blurring, soft focus effect and leaves you looking airbrushed. Vegan. Cruelty-Free. Retail price: $22.00 💖 Launching APR. 19TH! https://t.co/Ug6IxmvuHZ This is fucking crazy!! I’d love a night off lol 🥴 https://t.co/UBo87I6PGH Today we begin shooting the #JeffreeStarCosmetics SUMMER campaigns!!! 🔥💖 2019 is gonna be a wild fuckin’ ride 🎢 RT @allergictobeez: @JeffreeStar Happy Monday 💙😉🥶 https://t.co/QuRzZYIC2Y Gooood morning Star Family ⭐️ How are we all feeling today?? Everything happens for a reason 🔑 RT @xoxoonicole: Jeffree Star’s new concealer is the god damn mother fuckin business bitch &amp; I need it RT @kelsdmasters: Me normally- *never wears concealer*\nMe after watching @JeffreeStar’s concealer and setting powder reveal video- “damn I’… The #MagicStar concealer is life changing ⭐️\nWill available ▶️ APRIL 19TH @ 10AM PST Online #JeffreeStarCosmetics + \n@morphebrushes online and all their stores 💖\nComes in 30 shades. Vegan. Cruelty-free. Full coverage, hydrating. 20% pigment, can cover tattoos 🔥 https://t.co/KKdMGAkwBf All my household cares about tonight is #GameofThronesSeason8 🖤 Who’s ready??? ⚰️ Always @redbull with a metal straw 💦"}