{"tweets": "É aquilo que eu sempre digo. \n\nBoa noite. Um lençol.  \nUma bola dividida. \nOutro lençol. Uma matada no peito e um passe preciso. \nUm corte desconcertante - e um adversário escorregando na grama. Um chute de artilheiro. \n🙂 1. #shippados do @Globoplay é ótimo\n2. A @Tatawerneck é genial\n3. O @edu é genial 🤬➡️😶😶😶😶😶😶😶😶😶😶😶😶😶😶😶😶⬅️🤬Para a imprensa e a democracia, \na gritaria hostil dos intolerantes \npode ser até menos perigosa \ndo que o silêncio amedrontado dos demais. \n🤬➡️😶😶😶😶😶😶😶😶😶😶😶😶😶😶😶😶⬅️🤬 https://t.co/JNJHUvFNQf Muita vontade de chorar muito, muitas vezes, ao longo de um dia tão triste. Não uso mais isso aqui. Mas, hoje, senti necessidade de compartilhar esse peso que também os jornalistas tivemos que suportar em nome do dever profissional. E pronto. Está dito. https://t.co/dN55zwaTzi O que é que eu tô fazendo aqui? ? Somos momentos. https://t.co/Fwb8e1L0RZ A não-cerimônia de despedidas do meu pai durou quase 3 anos. A químio e o tempo se encarregavam… https://t.co/LtsrTOrVgW Eu gostei desse sapato logo de cara. Tinha um tom de couro cru, sem brilho nenhum, e o conforto… https://t.co/RNq9kBbuMu Quanto tempo! https://t.co/2mjPJOXlOe RT @LucasD_Mendes: @realwbonner Cisco no olho e sopro cardíaco RT @AnaCarlaMenezes: @realwbonner Desde aqueles tempos já gostava de tudo na horizontal! hehehehe Àqueles pra quem o tuíte  anterior faz algum sentido, nostalgia:\n“Que a noite lhe seja serena e as penas do dia pareçam pequenas. \nQue os sonhos lhe sejam amenos e anjos tranquilos lhe mandem acenos.” Mas as lembranças daqueles tempos são ótimas. E por causa dos seguidores que decidiram ser “sobrinhos” de alguém que vestia um pijamão listrado na hora de horizontalizar o esqueleto e de suprimir as retinas de fótons ao distender as gorduras pálpebrais. O que está acontecendo é que hoje eu arrumei minha sala na firma e encontrei presentes dos sobrinhos do TT, dos tempos em que isso aqui era divertido, cheio de criatividade e de gente com vontade de  rir. Aí bateu vontade de vir dizer: “que pena que o TT virou campo de batalha.” https://t.co/H1bwKDyprb Via @estadao: Unilever cogita cortar investimento em anúncios para o Facebook e Google -  https://t.co/VhgdEEjL9w O Carnaval político https://t.co/2sKspejLzR Alala x https://t.co/YEs16YFWFq Tinha também aquilo de eu perguntar \"quem quer #interativadotio agora diga EU!\". E quase todos os 27 seguidores respondiam: \"EU!\" \"EU!\" \"EU!\"  E lá no meio, o gaiato: \"EU... NÃO! KKK\" \nNaquela época as pessoas riam assim no Twitter. \"KKK\" ou \"huashuashua\".  Putz. Faz tempo. RT @RenataGCSilva: @realwbonner Eu votei e ainda usei esse\"case\" na minha apresentação de artigo da pós graduação! putz! https://t.co/BFwVuZnGK4 Lembrei agora. Vocês nem eram nascidos ainda. A essa hora do dia eu fotografava 3 gravatas e deixava meus 27 seguidores escolherem a que eu usaria no JN daquela noite. Não sou só eu? E ainda inventaram aquele jeito de travar o microfoninho deslizando pra cima! Aí que não tem nem aquela chance de o dedo escapar e a pessoa desistir de falar tanto... https://t.co/5Rew9W84TB É, mas já cansei. 👋 https://t.co/TKcHfDpFth 👊🏼 https://t.co/KpypNIfXdM 🤗 https://t.co/6sNr5fSBdA La Casa de Papel. https://t.co/7AzOeVvYp7 E lembre-se: a sua mensagem tem que ser com a câmera NA HORIZONTAL! Assim! Deitada! 😜 https://t.co/UoduCTNM2r A que te faz bem. https://t.co/sTUSinL4dE O risco de dar errado qualquer filme com o Ricardo Darin é bem remoto. https://t.co/zqXJw197t4 Onze semanas, de Ernani Lemos, Editora Chiado. https://t.co/hSI6w4vHj9 Pra sorrir. \nhttps://t.co/KYFUKYoRUx Oi, com licença. \nEu sou novo aqui. Será que você saberia me dizer onde é que se conserta ar condicionado nessa área? https://t.co/RQFG4fP0nA @AnaAlves180 Um ano e meio bloqueando perfis fakes dessa criatura. @crfnathaly Linda! Tá contratada! @AnaAlves180 É a mesma pessoa. Os mesmos termos. As mesmas agressões. @VictorNassif Deus NOS livre. A todos. @taliescher AHAHAHAHAHAH RT @juobserva: Eu já tinha visto essa doida @realwbonner #Denuncia https://t.co/XHf71P2oIf RT @Dimara_Souza: Andei com o pé no painel até ontem. #valeuadica @realwbonner RT @jbassuino: @realwbonner Muito oportuno o teu comentário sobre o pé no painel daquela moça que filmou o acidente. Muitas pessoas andam d… @psitato @jornalnacional  https://t.co/ZBJ9rf2tg5 RT @leonardocarioca: Se hoje não foi a melhor edição do ano do #JornalNacional, eu não sei qual foi. Uma leveza nas notícias e em tudo que… Queimando meu filme. https://t.co/8NOR9u3rXz Valeu, doutor.  Passô. \nObrigado. Eu não estou sendo seguido por dez milhões e meio de pessoas. Eu não estou sendo seguido por dez milhões e meio de pessoas. Eu não estou sen Oi, doutor. Sou eu. Desculpe a hora, mas é que voltou aquela noia de me sentir observado. Como se estivesse sendo seguido. Ah, putz...\nFoi mal. \nDesculpaê. \nNúmero errado. Alô?\nDoutor? #eusouumdosquefalamcomcemmilhoesdeuns https://t.co/dp575twtki https://t.co/GcpUwd3R9v Putz. @Rene_Bergantin Na torcida. Assim:\nAo torcer o pé, correndo, o tendão se esticou a ponto de arrancar um pedaço do osso. Foi fratura por avulsão. \n#DrTio #tiodemolho 🕳🏃🏻Pé quebrado. 🚑\n3 dias com ele pro alto. ⏳\nMas, na segunda, o tio volta. \n📺 \nDe bota e muleta, por 8 semanas. 😉 8 semanas. E contando. https://t.co/Y6F1NNmFal RT @_PierreRosa: @realwbonner JN é só a noite. Imagina se vc apresentasse o HORA 1. A segunda merece a cesta. \n🗑 Segunda é um dia de quinta. Quem acha uma injustiça que amanhã seja segunda-feira diga \"Eu!\" https://t.co/t99RgG4Yd5 Presente especial da repórter pro #TioTiete \n\nhttps://t.co/hx4Ooy1loU https://t.co/HvKeO0LGWE RT @tvnewser: The open for Brazil's national newscast @jornalnacional @RedeGlobo with lead story on the privatization of the state energy u… RT @tvnewser: Spotted in the @jornalnacional control room in #RiodeJaneiro @hardball. @RedeGlobo is a news client of @MSNBC https://t.co/5a… RT @tvnewser: Just got a look at real-time ratings, @jornalnacional is averaging 44% of the Brazilian TV audience right now. 3X its nearest… Já é 2018. \n\nWhatsApp sobre TV Globo é falso https://t.co/FPEt0AFBt0 https://t.co/VAdegZnSQX via @folha_com @farochasp Taí. RT @RosaDireito: @realwbonner calma!! Também to querendo o sábado 😘😘😘😘 Como assim? Hoje ainda é quinta? RT @realwbonner: Que a noite lhe seja serena e as penas do dia pareçam pequenas. Que os sonhos lhe sejam amenos e anjos tranquilos lhe mand… Tinha uns versinhos que o tio postava pra chamar o sono. Mas acho que não resolveriam. O garçom disse que era descafeinado. \"Rasgue a camisa, enxugue meu pranto.\"\n#RIPLuizMelodia Pausa no silêncio. \nSe o Jornalismo pudesse escolher a hora do descanso de seus ícones, não teria levado o Moreno num momento desses. Aos sobrinhos que divertiram muito esse tio velhinho, obrigado, de coração.… https://t.co/iWrDtdMZRQ É tudo o que temos a declarar sobre o assunto. Agradecemos a compreensão, o carinho e o respeito de sempre. \nFátima e William Continuamos amigos, admiradores do trabalho um do outro e pais orgulhosos de três jovens incríveis. Em respeito aos amigos e fãs que conquistamos nos últimos 26 anos, decidimos comunicar que estamos nos separando. Acho que esclareci, @constantinoinsp . Valeu a pergunta. Corrimãos e corrimões, @escobarviamao . Valem as duas formas.Nossa língua é rica e surpreendente. Que a noite lhe seja serena e as penas do dia pareçam pequenas. Que os sonhos lhe sejam amenos e anjos tranquilos lhe mandem acenos. 👼🏼👼🏾👼🏽 RT @rafaela16jacare: @realwbonner tio recita o versinho primeiro Tá puxado pro tio. É hora de horizontalização esqueletal e oclusão palpebral. A carcaça velha e cansada precisa. Foi o que eu disse. O Walace do Grêmio e o Walace do Flamengo são a mesma pessoa. \nMuahahahahahaha O Walace do vôlei e o Walace do Flamengo são a mesma pessoa. Vocês que acreditavam nesse papo de que parecidos. Fala sério. Também tive essa impressão, @leonilson_leon . Tipo: \"-Putz! Vai me passar não, né?\" Na próxima eu vou, @renata_capucci RT @chsferreira: Obrigado pelo livro @realwbonner, estou curtindo muito, espero que goste do meu tbm!\n#SomosTodosEscritores https://t.co/n4… Bolt e De Grassi se entreolham e sorriem correndo os 200 metros. Caraca! Que coisa sensacional!!! RT @RedeGlobo: Que moral hein, @realwbonner? 🏀 #BaladaOlímpica #SomosTodosOlímpicos #Rio2016 https://t.co/mTMwytKdll Muahahahahaha!!! https://t.co/6vShVVvLNr O tio numa visita épica ao #PlayNosJogos .\n#nóistrabaiamasnóissediverte\n#somostodosolímpicos https://t.co/973z3Q8NC5 RT @augustolameu: olha só Selfie da Selfie da Selfie, vlw por aparecer @realwbonner #playnosjogos https://t.co/BVPCRmqnw7 RT @JozedeGoes: Enquanto o @realwbonner trabaiaaa olha a Urca! E olha que a minha camera quebrou...!!! Tarde lindaaaa https://t.co/uZDKntc3… RT @bahmiranda: @antonellonadal viu, o @realwbonner falou ao vivo comigo :))))) Peraí que o tio vai ali no #playnosjogos O grego que teve a ideia de usar uma vara como alavanca pra saltar um obstáculo devia ser um cara muito doido, né?\nO Tiago Brás agradece. RT @cabecaodesobral: @realwbonner Cê vai acabar tomando uma advertência ou sendo demitido por Twittar no trabalho.Cê tem 3 filhos adolescen… RT @charlesbbrandao: @realwbonner Se mantiver em uma gafe por dia acho que é uma média boa O tio tá craque nas câmeras, hoje. Dois, três, dois, um... Só faltou chamar o Vladimir de Vladimir, em vez de Marcelo, que é o pai dele. O tio não vai errar câmera, hoje. O tio não vai errar câmera, hoje. O tio não vai errar  câmera,hoje. #hojenão\n#nottoday\n#nottodaysatan inté. Outro dia foi a tentativa de tapar uma careca reluzente.\nHoje, câmera errada.\nA aposentadoria se aproxima.. O tio combina em que câmera vai falar, todo mundo anota... e aí vira pra câmera errada, do nada.\nDeve ser a idade... Que privilégio testemunhar a terceira vitória olímpica do Bolt sobre os outros 7 seres humanos mais velozes do mundo. A História agora. O Bolt bota todo mundo pra sorrir. Olha só! A estupidez covarde dos que insultaram a Joana Maranhão é o que se encontra de pior na internet. E tem quem a reproduza no mundo real. Pois é, @jornalnacional https://t.co/hE0rX4DloC @zelia_guimaraes Muaaaahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahaha!\nMuahahaha 🙈Tá, não era pra ter aparecido. \nMas olha como funcionou a solução do tio pra careca que ofuscava a câmera. 👍🏼 https://t.co/GMf3vXjCLQ Vídeo de redeglobo https://t.co/bXfJ27wDMe Na porta do Maracanã, o tio, todo pop, tieta o @jrart @ Novo Maracanã https://t.co/rxOY2XgZM1 Só eu que rio desses comerciais do Zap? Ser pago, estar pago. \nTer pagado, haver pagado. \nÉ assim, @bruno_bauru .\nAbraço! Porque eu vou usar na sexta-feira, @sandracamargor RT @jornalnacional: Tem novidade no #JN! Conta aí, @realwbonner!\nhttps://t.co/mFQnRAFYdu RT @RedeGlobo: Parabéns, @realwbonner! 👏 #JN https://t.co/5mqp2CnZQ4 Obrigado, @RedeGlobo . O tio sente tem a #firma como família. @lauralucialaura obrigado. Valeu, @vitorino_alan . A violência contra as mulheres, de que tanto falamos, precisa reverberar mais e mais. Ou não mudaremos isso. É uma história triste, @rafaela16jacare Obrigado, @MarahBatista RT @KrystianeSPM: @realwbonner Parabéns por não esquecer   da  Cristiane #JN RT @jornalnacional: Hoje tem uma estreia especial no #JN. Veja o convite de @realwbonner &lt;3 https://t.co/kj4h60UTbL RT @jornalnacional: Quanta elegância! Boa noite! O #JN tá no ar. https://t.co/pJ1YtpejKA Que deselegância, esse tio... https://t.co/sXoyD0tkfB RT @MarcioGreporter: Desafio @realwbonner @evaristocosta @sandraannenberg @anapaulaaraujo e @chico_pinheiro a terminarem um jornal assim! h… RT @Adinei_Gazani: @realwbonner Nossa gata se interessando pelo @jornalnacional https://t.co/rYpQJvZGlI -Que deselegante... https://t.co/oP1ehfSbHt O tio e os estagiários da #firma. https://t.co/yH7ObMDWbP Terça, 8:30. https://t.co/xTkb4Tzg0j Que a noite lhes seja serena e as penas do dia pareçam pequenas. \nQue os sonhos lhes sejam amenos e anjos tranquilos lhes mandem acenos. RT @jornalnacional: Nossos amigos do estúdio desejam boa noite! 😃 O #JN tá no ar! 🎥 https://t.co/aTB8RIESJ4 Bilhete atirado pelo barista, preocupado, em minha amiga caruaruense que lhe havia pedido um café, segundos antes. https://t.co/IW9NjxXFwl RT @jornalnacional: Boa noite! O #JN tá no ar! 😉 https://t.co/XLolLYokRw Just posted a photo https://t.co/IL6UpiptWb Hora de o tio horizontalizar o esqueleto, estender gorduras palpebrais e entregar o corpo velho e cansado ao conforto do pijamão listrado. RT @CebolinhaSEP: @realwbonner  Obligado pelo leconhecimento....hahahahaha O #TioCebolinha tá que tá. https://t.co/Iaowpjr0mI RT @tvhistoria: William Bonner apresentando o Jornal Bandeirantes em 1986 https://t.co/m9Z9jrMtw4 Ronaldo Lemos - Na crise, viramos fantoches na rede https://t.co/dEYXDu6jSx \"A imprensa não produz grampos nem conduz investigações da polícia e da Justiça. A imprensa… https://t.co/mFrSEI56uB Preguiça blaster. \nOutra noite a gente conversa, que amanhã o tio pula da cama cedo. Desesperador programado para 6:00. Dia errado pra ter insônia. O @pefabiodemelo apagou antes da meia-noite. Chamou?\nO @pefabiodemelo me chamou? Só pra agradecer os minutos de diversão com os sobrinhos. \n#ocêistudoéshow Voltei. Mas é rapidinho. No mais, é como eu sempre digo:\n- Boa noite. Espero que gostem da foto de barba. https://t.co/t3Vo3FOjEe Espero que gostem da barba. Vou postar uma foto dentro de 3 m RT @candocinha: @realwbonner eu e meus primos esperando a selfie https://t.co/1RaLM1amff RT @louisoutlaws: @realwbonner esperando https://t.co/H4e8Rnkoc5 RT @daniorlando: @realwbonner Eu esperando o Bonner postar a selfie....kkkk https://t.co/wpxFjo7KCe Tô demorando, né?\n\nÉ que eu fico lendo o que a sobrinhada posta. Tá demorando, né?\n\nTirei 5 selfies.\nMas saí vesgo em todas. RT @Mirianelita: @realwbonner posta a foto das suas pedrinhas da vesícula que eu posto as minhas... Mas eu admito que a sugestão da foto \"só de toalha\" é sensacional. As reações dos sobrinhos me levam a reavaliar a pertinência da postagem supracitada. RT @rafsmars: Eu ainda prefiro a foto do umbigo, seria épico!! @realwbonner @evilmader Oi, vó da Nanda! RT @CarolCaiana: @realwbonner Tenho uma ideia melhor, tio! Poste a foto 3x4 do seu RG :) RT @gabriel_gontijo: @realwbonner Posta um nude pra gente medir outra coisa, Tio! Pela mais absoluta falta do que fazer, tava aqui pensando em postar uma selfie pra medir a popularidade da minha barba grisalha. Gente, na boa. Se eu acender a luz agora pra melhorar essa selfie, vai rolar uma noite no sofá. \nVão dormir, vão. E agora? https://t.co/iEYgNcMouL Não foi? A selfie não tá aparecendo? 🤔 #selfieinsone Nada não. \nÉ que o meu estômago sacou a hora e avisou que vai roncar até eu tomar alguma providência. Gente, eu disse \"putz\"!\nQuando alguém diz \"putz\", é de bom tom o outro perguntar: \"o que foi?\" Putz!!!! Da série \"clubismo não, tietagem sim\", dia desses fui dar um abraço nesse herói tricolor. https://t.co/VVkRfeyf7r 🙌🏼 https://t.co/cbaVhi98fA 😱 https://t.co/NvTtGjJikO RT @gracianonaty: @realwbonner te dedico auahahha #HojeNao https://t.co/5svz4wsHCz Insone. 👊🏼 https://t.co/kWo9cTstdV Você nota que perdeu a linha quando come uma noz pra tirar o gosto do naco de tender que tinha sido o jeito de se livrar do sabor do pudim. RT @g1: Quais são suas metas para 2016? 😄 Toda a equipe do #G1 deseja um ótimo Ano Novo para você! Feliz 2016! 🎉 🎉 🎉 https://t.co/3JBWAjeUsA Com base no que eu vi até agora, apurados 97% dos sites, a margem de erro permite afirmar que 2015 terminou mesmo.\nPodem voltar a dormir. RT @felipesantana: Obrigado pelas mensagens.Feliz que bastante gente tenha acompanhado.Foi um trabalho suado mas conhecer aquelas pessoas f… RT @felipesantana: @eduardofaustini obrigado, mestre, por ser inspiração desde o começo de tudo. RT @ppedrolira: Essa série \"O Quinze\" é digna de emmy ! Parabéns tio @realwbonner. Emocionante todos os capítulos! RT @Matheus78659561: Aplaudindo aqui de pé a série \"O Quinze: Travessia\". Um documentário maravilhoso e emocionante. Parabéns @realwbonner … RT @franciscoucha: @realwbonner Parabéns pelo Quinze, @realwbonner! Jornalismo de primeira! Emocionante e verdadeiro! RT @marygusmao: @realwbonner Parabéns a todos os envolvidos em #OQuinzeTravessia foi uma ótima reportagem RT @mgmolive: @realwbonner Linda reportagem do 15, estou com lagrimas nos olhos, esse é o nosso Brasil. Parabéns a tds envolvidos nesse tra… RT @FerEllen: @realwbonner eu não to aparecendo!!!! ABAIXA AÍ TIO Então  junta todo mundo rapidinho aqui à minha esquerda, que o tio faz a selfie. Assim é mais rápido. \nVocês estão em quantos?\nNove milhões? Que a noite lhes seja serena - e as penas do dia pareçam pequenas.\nQue os sonhos lhes sejam amenos - e anjos tranquilos lhes façam acenos. Odeio colchão de hotel.\nOdeio travesseiro de hotel. \nOdeio barulho de corredor de hotel.\nOdeio luz de fresta de porta e de janela de hotel. Exausto e insone. Tentando muito entender a sobrinhada. https://t.co/GUREuCVaql Tentando entender os sobrinhos. https://t.co/BzOfLfMKe0 Doutor?\nDesculpe a hora, doutor. \nÉ que me bateu uma sensação assustadora de estar sendo seguido. Por uns milhões de pessoas, sabe?\nÉ grave? @georgesagille Thank you, teacher. As a matter of fact, @felipesantana and his colleagues Alex, Douglas and Eric were responsible for that. RT @jornalnacional: Confira no segundo episódio de O Quinze: Travessia: https://t.co/i5mRP2bIKZ\nhttps://t.co/QkSnEoNRIa RT @Tcatiele: @realwbonner parabens a todos os envolvidos com a  reportagem do 15, minha família parou tudo pra assistir. RT @mountbatten_: \"O Quinze\" 👏👏👏👏👏👏 série MARAVILHOSA! Sem palavras! @realwbonner #JN RT @sandrobaiaco: Esse anos tivemos Morte e vida severina, 60 anos após, e O quinze, travessia. Parabéns rede @RedeGlobo  @realwbonner RT @CrissianL: Série maravilhosa e emocionante, parabéns @realwbonner e toda equipe do @jornalnacional 👏👏   https://t.co/TzkoDJdKEL https:/… Um século depois, o drama da seca retratado no livro ‘O Quinze’ se repete https://t.co/9R7SftITtV No #JN, #OQuinzeTravessia :\nreportagem-documentário arrebatadora de Felipe Santana, Alex Carvalho, Douglas Lima e Eric Romar. RT @sandrobaiaco: Quanta poesia nesse documentário o Quinze a travessia. @realwbonner RT @pietromeinhartt: Que reportagem sensacional !! Parabéns @realwbonner !! #JN RT @fireworkefera: @realwbonner tio, melhor reportagem do ano! O quinze me fez chorar 👏🏼👏🏼👏🏼 RT @dinhomartins: Em choque com a magnitude da série #OQuinzeTravessia no @jornalnacional ! @realwbonner , Felipe Santana e equipe me emoci… RT @jornalnacional: Quanto de 1915 ainda existe em 2015? Não perca a estreia da série no #JN, às 20h30: https://t.co/7by8ScIEyo\nhttps://t.c… \"@QuelSS: @realwbonner tio, minha mãe tá achando estranho você trabalhar no natal. Você não ganhou folga?\"\nO trabalho enobrece.\n#TioVisconde Voltando. Daqui a pouco, @ppaly . Daqui a pouco. Que a noite lhe seja serena\nE as penas do dia pareçam pequenas. \nQue os sonhos lhe sejam amenos\nE anjos tranquilos lhe mandem acenos. 👼👼👼👼👼👼 😉 https://t.co/J3GEeHXVBO Ok. Tipo: quem gostaria de ter um autógrafo do tio... diga EU. Tava aqui pensando e acho que é o caso de perguntar. Algum sobrinho aí ainda liga pra esse negócio de autógrafo? Alô, doutor?\nRapidinho. \nSó uma dúvida, aqui. \nTem algum jeito de parar de transpirar mantendo preservadas as outras funções vitais? Sabe sauna a vapor? \nÉ o que temos pra hoje no Rio de Janeiro. 😏💪🏼👊🏼 https://t.co/TkVR5qd1MH Ó, só mais uma coisa. \nA @Kefera ligo, perguntou se pode vir, que escutou a música de lá, se não tem problema.\nVocês abrem se ela tocar, ok? Aí.\nFalei, né?\nO vizinho já ligou. \nBaixa aí esse som, vai. \n\nÉ o Justin Bieber? @mariliapcc @amaralbrun 😊 Gente, na boa, eu tô morto. Vou me arrastar até a cama, mas vocês podem ficar, tá? Só baixa o som um pouquinho porque o vizinho reclama. Não chega a isso. Mas de 92,7 pra 85,5 em 85 dias faz diferença.  https://t.co/LFtJBC6Meh E a vencedora foi a gravata número 3. https://t.co/1l3UFKXtNy Aí achavam que o tio já tava de pijamão listrado no décimo-quinto sono quando eis que surge um tuíte surpresa. O tio usará a gravata vencedora, como reza a tradição médio-secular da interativa. \nDaqui a pouco o resultado. \nNo JN. Putz! Foi mal. \nDeixei vocês no vácuo.\nFiquei devendo o resultado da #interativadotio . VOTAÇÃO ENCERRADA. Mais 1 minuto pra votar. Da esquerda pra direita, vote pelo número. \nQual gravata fica melhor com camisa bege e paletó grafite?\n#1\n#2\nOu #3 ? https://t.co/Jaw4RnEz8Z Ok. Antes de o tio mergulhar no fechamento da edição, quem quiser palpitar na gravata de hoje diga EU. RT @littleKrys: @realwbonner o tio numerava 3 cores de gravata e a gente escolhia o número desejado. 😜 https://t.co/l4GH6qMIaj Quem me ajuda a explicar o que era #InterativaDoTio pra quem tem menos de 70 anos de Twitter? Alguém ainda lembra quando tinha #InterativaDoTio no TT? ❤️ https://t.co/eLgAClqnqS Depende. Deixa ver se o seu é melhor que o meu.  https://t.co/UjwyVrETe7 Com carinho, do amigo @REALWBONNER https://t.co/2wpYodnwjr O cirurgião acabou de tirar os pontos do meu umbigo novo. Significa que eu não posso mais rir, nem espirrar. \n\nAcho. 😐 \"É o que eu sempre digo. O que faz de mim alguém verdadeiramente especial é o fato de acumular tantas qualidades e ainda ser tão modesto.\" RT @oRafaRibeiro: o @realwbonner tem a voz do cara do Jornal Nacional, né? Que incrível isso. Queria ser assim RT @Katybyscate: Ler os tweets do @realwbonner de manhã faz qualquer um acordar de bom humor. #hojenão https://t.co/kU6i8rfSgP Agora me deem licença. \nBoa noite. RT @hey_ilah: Quando vejo o @realwbonner tweetando me sinto menos inútil @flavio140593 Sim. O que vale pra mim não vale pra todo mundo. E o tio não é louco de sair por aí tuitando dieta. Ok. \nA resposta é: procurei um profissional, uma nutricionista. E ela indicou o que eu deveria evitar e o que deveria procurar comer. Quem quer saber como a dieta me deixou 7 kg menos pesado em 81 dias...\nDiga \"eu\". Eu caí pra trás, com a pancada. E pensando, enquanto caía em câmera lenta: \"Putz, que jeito estúpido de morrer!\" \nMas não. A árvore em que o tio enfiou a testa dia desses, na caminhada, porque tava escolhendo música no celular. #TioMrBean https://t.co/VBzjQSHYX0 Olha que bonita a igreja Divina Providência, na frente da #firma. https://t.co/ArEX2Gd8WJ Não, @rainhafoguete . Eu entrei em dieta há exatos 81 dias. E tô 7 kg menos pesado. Tive que parar um texto pra dividir com vocês. Escrevi \"da inflação\". \nO corretor do celular registrou \"Davi flácido\".\n#NobodyDeservesIt No dia da volta ao trabalho...\n😳\nhttps://t.co/4eRZ7ZwgMI Um livro devorado com prazer nesses dias longe do trabalho. Muito bom! #OnzeSemanas , do Ernani Lemos. https://t.co/xdjRECa4Zw RT @ElisElis33: @realwbonner manda mensagem para o Vídeo Show https://t.co/jKuTWpZLQw RT @GerlaniaMedeir2: @realwbonner Aquela velha história, ngm olha para o próprio umbigo. Estamos todos de \"olho\" no seu, tio. Agora me deem licença que o doutor me mandou movimentar o esqueleto. \nQuando der vontade de voltar,\neu dou um tempo e espero passar. E a mais modesta e humilde, claro.  https://t.co/V6XT1yzYZl Ele disse que o inchaço vai sumir e o meu umbigo vai voltar a ser como era quando eu tinha menos de meio século de existência. 🙂 RT @sueniafernandes: @realwbonner e o que ele falou do seu umbigo? Ah tá. Então.  \nEle veio ver o umbigo novo. Acabou de ir embora. Eu não falei que o cirurgião veio me visitar, falei? RT @keilinhapoynter: @realwbonner eu tbm me surpreendi por ter gostado desta música!!! Mas tento negar para as pessoas para manter a pose h… Também achei boa. \nPutz. \nÉ grave? https://t.co/bMoHK5tAvY A do Justin Bieber? Aquele de que eu gostei?\nWhat do you mean? https://t.co/e9znh5S6G8 Acho que o cirurgião é meu sobrinho no Twitter. Acabaram de ligar da portaria. Veio ver a criação dele. Putz!!!! 😱 Esquece.\nPela classificação indicativa, meu umbigo novo não pode ser exibido no horário do #VideoShowAoVivo . O tio ia postar foto mas o contrato com a #firma é de exclusividade do uso de imagem. Inclusive do umbigo. \nVou mandar pro #VideoShowAoVivo Pior que rasparam a barriga, mas o peito, não. \nAí... ficou meio como se o tio tivesse vestido um coletinho de pele de raposa, sabe?\n#estilo Ontem eu troquei o curativo do umbigo novo. \nFicou meio...tipo:\nNão é o meu umbigo, sabe? \nFiquei olhando pra ele, tipo: \n\"E aí? Beleza?\" Os médicos disseram assim: \"Olha, a gente tirou a vesícula mas achou uma hérnia umbilical e resolveu consertar. Esperamos que você goste...\" 3 choques psicológicos pós-cirúrgicos.\n1-não tenho vesícula;\n2-mudaram meu umbigo;\n3-Eu... Eu ouvi uma música do Justin Bieber. \nE gostei.\n😳 RT @GalloMontella: Tio @RealWBonner o Wendell Lira é finalista do Fifa Golaço mais lindo de 2015 #BoraVotarNoWendell Votar clicar aqui http… Repouso. Arrancaram a vesícula do tio. \n#selfiedemolho https://t.co/TWtHgCyJ1P @BsSouzaBrunna Yesssss!!!👊🏼 hahahahahahahaha!!!\nbréquifraidei.\n#fácilpraninguém\n#easy4no1\n#JN Sobrinhos, vamos parabenizar o cara. 👏🏼👏🏼👏🏼👏🏼👏🏼 https://t.co/aOlMhiscUa RT @ojulhao: @realwbonner pensei que ia anunciar a volta da banda calypso RT @CrazyDouglasB: @realwbonner e a pessoa aqui sai enrolado numa toalha de dentro do banheiro pra ver o Plantão -_- Sustei ocêis?\nMuahahahahahahahahahahahahahaha!!! RT @ANoveleiraa: A o tio @realwbonner avisou que ia ter plantão Tucumdum- Tãã-tã-tãã-tã-tãã-tã-tããã-tã-tãããã...\nTãã-tã-tã-tã-tãtãtãtã-tã-tããããmmm... Essa série de reportagens do #JN sobre educação inclusiva é de uma importância enorme. É muito legal levar o debate a milhões de pessoas. Just posted a photo https://t.co/huYdZ9KsqR O jornalismo da #Globo foi indicado ao #Emmy 14 vezes, nos últimos 14 anos. \nSó o #JN  recebeu 9… https://t.co/TPXbfUaeBP Entrei na #firma em junho de 1986. Aprendi telejornalismo aqui. Aprendi a zelar pelo nosso… https://t.co/3d4ePi3NJC Como entender que alguém faça isso a um homem de 80 anos?\n#forçaGiancarlo \n#papadapenha https://t.co/l3ra3n5frs Torcendo pela recuperação desse octagenário argentino adorável, espancado dentro de casa por um… https://t.co/U5l0rmACX6 https://t.co/yAWKOyMWtz @sueniafernandes Não comi nenhum. Distribuí vários na reunião. E guardei os que sobraram. Perdi 5 kg. Falta 1. @lunaorigliasso https://t.co/jcxYlejMSQ @quemacontece 😎 RT @larinhamaral: @realwbonner TIO por um erro no meio da correria não foi o nome da @AlinefelixWF Mas ela tbm participou! Bjooooo to muito… https://t.co/McMy2v0a2e https://t.co/tHNm1CGoWw @quemacontece Não é no Projac. É no Jardim Botânico. Cisco no olho e sopro cardíaco.\n😘 https://t.co/QFsafPGFkm https://t.co/8rnzfJC2fF https://t.co/5n06SMB8Yr @RubenDa70995417 Muchas gracias! https://t.co/0f6ePC3va0 RT @pefabiodemelo: Eu gostaria de ter guardado a informação para a noite de Natal.  https://t.co/N0Vdy6dJCe Só pra dizer que vocês são show. \nFazia tempo que o tio não se divertia por aqui. \nObrigado. \nE boa noite. https://t.co/QywnC1ewID Peraí!\nVoltei!\nMas é rapidinho! Que a noite lhes seja serena\n- e as penas do dia pareçam pequenas. \nQue os sonhos lhes sejam amenos -\ne anjos tranquilos lhes façam acenos. Preparo-me, em meu velho e confortável pijamão listrado, para horizontalizar este esqueleto idoso e cansado e distender as pálpebras. Aproxima-se o momento da transmutação aboboral. Opa! Dez pra meia-noite! @kassyofragoso https://t.co/9tbbDjBjOv @Lita_Alcoforado É fila única, senhora. A senhora poderá estar aguardando a sua vez. Ou chamar logo o tio de tio, senhora. @Lita_Alcoforado Já pegou a senha? Silêncio! \nSilêncio, por favor! \nEstão derrubando o Twitter com essa bagunça. \nFaçam alguma coisa, por favor, @pefabiodemelo e @Kefera Ok,chegou a hora. Seguinte: você não é filho das minhas irmãs. Nem da irmã da minha mulher. #fato (ainda usam isso?) https://t.co/ZbdBoL7FZr Cadê as fotinhos de todo mundo? Eu disse pro @pefabiodemelo que isso ia dar confusão... https://t.co/fMza8ig8NE Tá, chegou a hora de revelar. Neste sábado à noite, aconteceu o improvável. \nA @Kefera o @pefabiodemelo e eu compramos o Twitter. Putz! A @Kefera falou de mim! \nCapaz de as minhas filhas até me darem beijo de boa noite! Ela diz ISSO de mim pra avó? 😳 https://t.co/6N3ZCLDpcP Mas aí tem que ver os radicais livres desbundados. https://t.co/AbYUpFLWO8 A descrição da sobremesa botou na minha taimilaine tanta pergunta que parece chamada do Globo Repórter. RT @asflorence: @realwbonner fiquei curiosa pra vê como é isso. Posta uma foto tio Nada! Super saudável!  https://t.co/7nV2lCg2Bf Agora, de sobremesa, castanha de piracutunjuba sem casca e geléia de nhonhoma adoçada com seiva de sândalo do Himalaia. \n😛 @flaviathaist 💐 @paulaOnfire 😆 @LimaDebis 😐😞 Sim, sim. É que a barrinha é americana.  https://t.co/aTaYmtgYYJ Gente, a minha barrinha de alpiste com alfafa sem glúteo tá sensacional. Alguém servido? RT @cleytonlqueiroz: @realwbonner Rralmwntw é a vosta mwsmi. RT @Lainy_Sam: @realwbonner kkkkkkkkkkkkkkk avontwce nqs mwlhpres fampkias. RT @drunkbabe_: @realwbonner psrwce munha mar Drpoiu de ima cwrta idsde patecw que o dedo fuca gtosso demaid pra dihitar. Mas o peobkema é a vosta, mesmi. RT @GalloMontella: Titio @RealWBonner o link direto do #BoraVotarNoWendell para o golaço mais lindo da Fifa 2016 é o https://t.co/GpQcWYeimL Wendell Lira Goal: FIFA Puskas Award 2015 Nominee #boravotarnowendel  https://t.co/4mqR49YeQZ @SDaffny 😉 Não consigo me imaginar num diálogo com uma azeitona. Sério. https://t.co/DZ4wg1QCqk #boravotarnowendel  https://t.co/rhcx2sIWsa Não, @manel_vargas , tem outros. O cara é brasuca, tá desempregado e concorre ao prêmio Puskas de gol mais bonito do ano com o Messi, que é archentchino.  #boravotarnowendel O tio tá ficando velhinho. Mas mandando muito bem nas fotos. 😏\n#ModéstiaÉaMinhaMaiorQualidade https://t.co/31O0TIY8Mc #somostodostaisaraujo https://t.co/Aa561tZfRb https://t.co/01xbZW0p8e via youtube \"E João não conseguiu o que queria quando veio pra Brasília com o diabo ter.\" http://t.co/lyEP1TRsUy Daí que 6565 foi meu número de matrícula na Globo de São Paulo ao ser contratado, em junho de 1986. \nE daí? Hoje, quando concluem o primeiro vestibular, meus filhos completam o sexto milésimo quinto centésimo sexagésimo quinto dia de vida. \nE daí? Gente, vamo juntar em grupo de 6 e deixa que eu faço a selfie. Vai mais rápido. Vocês vêm sempre aqui? Lembrei a senha! 😃 https://t.co/0PPlb8IzPc http://t.co/HB8wz76Soe Começando o #JN.\nAgora.\nBem-vindo. Esse 22 de setembro foi histórico.\nFoi condenado o primeiro político da Lava Jato.\nO dólar passou dos 4 reais.\nE o #JN já tá pronto. O tio tá engravatado e devidamente instalado na bancada, ao lado da Renata.\nO #JN vai começar em 3 minutos. Faltam 5 minutos pra começar o #JN. Minha solidariedade a todos os cariocas engarrafados nesta segunda de caos no trânsito. #EasyForNoOne Relembrando com o tio.  http://t.co/Mbc9Qt9qeg Osvaldo Seco faleceu. \nEm 86, câmera em SP, registrou a primeira vez que encerrei um jornal antes da hora. Descanse. http://t.co/FoBN6O3oeb Você vê nascer, carrega no colo, trata como o quadrigêmeo que você não teve. Aí você pisca. E ele tá fazendo isso.  https://t.co/0176FugSNb Problema aqui em casa. Patroa vascaína foi dormir injuriada. Pior que, na Copa do Brasil, o adversário é o São Paulo...😁 O tio são-paulino gosta de futebol e da emoção que ele oferece.Foi emocionante a reação do menino Marciel, do Corinthians,ao gol que fez. 👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼\n#EstreiaARegraDoJogo Putz. O tio cansadão. Mas não dá pra tirar o olho da #EstreiaARegraDoJogo Hoje o tio vai ter que sair correndo da laje depois do \"boa noite\" pra poder ver a novela nova. #EstreiaARegraDoJogo RT @TeuAmaral: @realwbonner Sao Paulo x Vasco na Copa do brasil. E agora? Aí o tio sai pra correr e encontra um vizinho tricolor em dia de estreia de novela. #aregradojogo… https://t.co/iiiQijzmfI https://t.co/ML0zsDVGU0\n\nMuahahahahahahahahahahahahahaha #JN no ar em 15\n segundos O tio subiu pra laje meio tarde. A #estagiária até tirou foto da muvuca que isso aqui virou. Mas tá tudo dominado. A postos pro #JN .\nMas depois de uma certa correria de última hora que  juntou uma multidão de operadores aqui em volta, no estúdio. RT @LojaGlobo: @uaiteve @realwbonner Já tem :-)  Aqui: http://t.co/2XxXBygJMa Um trabalho de que a gente se orgulha tanto - e que agora dá pra rever quando quiser. http://t.co/Gp4zJeNBhH Tá bonito issaê, @daniParaujo Caprichou, @Rpenetto Pra aumentar o rendimento é só manter a proporção, @Marilicek   \nNa foto parece bem bonzão. 💪🏼💪🏼💪🏼👏🏼👏🏼👏🏼 https://t.co/rDYzrjPoCZ RT @gshow: Aprenda a fazer o brigadeiro de @realwbonner! &lt;3 http://t.co/WAhXFEoGyB #Estrelas http://t.co/7ikqOLqUEw Muahahahahahahaha!!! https://t.co/2dtu1F8mfE RT @MaDiFi1965: @realwbonner Para eu saber como é isso, ó sendo #entrevistado por @angelicaksy http://t.co/topmipiLYf E o tio pede desculpas à @angelicaksy por impor a condição de quebrar um jejum de 10 anos pra ouvir meu 🐗. Mas o meu mico seria épico! 😁 O tio que não gosta de dar entrevista confessa que se divertiu demais com a @angelicaksy no #Estrelas. Anfitriã que deixa a gente à vontade. Manda beijo do tio,@eulitcha 🐗 É no mirante da Estrada do Joá, @daiananodari RT @angelicaksy: #brigadeirodobonnernoestrelas agora https://t.co/d4Xrvf3V54 @brunacnaves Manteiga. E sem sal. Muahahahahahahaha https://t.co/UZcQCsvuy9 RT @analutiz: olha o tio @realwbonner chegando no estrelas (aqui no interior é com delay. sorry.) 😉 https://t.co/oj5JYUb5h8 Não, @Ta_costaa   É um fastback. RT @FumeiMuito: @realwbonner tio Bonner e zika nos paranaue do brigadeiro mano RT @OutbreakRK: Nunca estive tão ansiosa para algo como estou agora! QUERO VER O TIO BONNER IMITANDO UM JAVALI SELVAGEM KKKK @realwbonner #… Mãe, olha aí o brigadeiro do vovô no #Estrelas ! @fe_dornelles Sim, é a original. RT @RedeGlobo: Opa! Da bancada do @JornalNacional para a cozinha do #Estrelas! 👏 @realwbonner http://t.co/XVUsKDtsq6 http://t.co/hqA0EddTyO O cinto de segurança de um Mustang 1966 é abdominal. É claro que estamos usando. Eu e a @angelicaksy É um Mustang 66, @_SilviOo_ O tio vai ali ensinar receita de brigadeiro pra @angelicaksy no #Estrelas e já volta. http://t.co/N04jKnMqh5 Alô tropa do ENEM. \nNovidade útil chegando. \n\nhttp://t.co/ScM5kRPWp1 RT @jornalnacional: Katharina paparicada no #DiadoEstagiário. Boa noite! O #JN tá no ar! http://t.co/Cfv07jcsSO Obrigado à Eliana Marques pelo período em que substituiu a Maju no #JN. @cbnrio Não adianta liberar o túnel e manter a blitz!!! @cbnrio Sim, cheguei à Lopes Quintas. Fui dizer a um PM da Lagoa que a blitz devia ser suspensa. E ele: \" morreu um motociclista no Zuzu.\" @cbnrio Cidade parada e a PM não suspende a blitz na saída do Zuzu Angel sentido Barra. http://t.co/6AUnTCIdtd RT @TVGloboInter: Que luxo!!! @realwbonner fazendo a chamada do #GloboNotíciaAméricas com a Mila Burns! http://t.co/Jx7B1Agjnl Boa noite, tropa @s_sequeira Legal. Boa sorte! @s_sequeira A gente tava indo ver Finding Neverland. @s_sequeira onde? Olhando as notificações antes de dormir, @_FuraBolo RT @majucoutinho: Gratidão! http://t.co/S8XgYmRk1C A @majucoutinho disse que a militância dela é trabalhar com seriedade. \nBom seria se os detratores apressados também agissem assim. “@PauloNetoNeves: que absurdo. As pessoas precisam ter limite. Não se pode publicar tudo sem verificar a veracidade.”\nExatamente! RT @GiseleMRC: @realwbonner @majucoutinho Estarrecida com a maldade do ser humano... RT @majucoutinho: A empresa em que meu marido trabalha NÃO TEM NADA A VER com a do escândalo. Leiam a nota. http://t.co/6xEIqnrC3J Maldosamente ligaram o marido da @majucoutinho a uma empresa investigada por corrupção. Mas são duas empresas distintas de nomes parecidos! RT @madeiradez: @realwbonner as pessoas perdem de vista quem é a vítima e conseguem ser tão más quanto os algozes :/ Alguém distraído ou mal intencionado saiu espalhando uma mentira daquelas que a internet acolhe e multiplica. E adivinha quem é a vítima. É absolutamente inacreditável o que eu acabei de ver aqui. Peraí que eu tô lendo uns absurdos aqui e já volto. Mudando de mortadela pra presunto: a peça \"Ensina-me a viver\", em cartaz no Rio, ótima. Fui ontem à noite. 👏🏼👏🏼👏🏼👏🏼👏🏼 “@cintiaaneves: @realwbonner jornalistas!!!”\nClaro, também. Mas se eu botasse na lista teria gente achando que foi corporativismo... RT @mailson_sou: @realwbonner valeu tio Bonner o Brasil não pode parar e povo precisa da gente na saúde # Rendo minha homenagem aos que estão ralando nesse domingo. Comércio, saúde, infraestrutura, transportes... RT @mountbatten_: @realwbonner só acho desnecessário amanhã ser segunda. Domingão preguiçoso. Mas necessário. Alguém discorda? RT @jornalnacional: #SomosTodosMajuCoutinho\nhttps://t.co/yeNhM5ell2 E você ainda dormindo. \nFala sério. \ntsc tsc tsc Boa noite. Exaustão existencial ascendente. Apagão cerebral evidente. Oclusão ocular iminente. Horizontalização esqueletal urgente. Que a noite lhes seja serena - e as penas do dia pareçam pequenas.\nQue os sonhos lhes sejam amenos - e anjos tranquilos lhes façam acenos. 1\nSuas pálpebras escorrem sobre a íris, distendendo suas gorduras de modo a suprimir de fótons suas retinas cansadas. 2\nVocê criou um top 8 quase à meia-noite de um dia como esse. 3\nVocê procurou uns remédios pra acalmar a tosse do seu filho à noite, mas não adiantou ele tá acordado até agora. 4\nVocê dirigiu por 20 quilômetros pra voltar pra casa depois de ralar o dia todo. 5\nVocê passou 1 hora e 20 minutos sentado na mesma cadeira enquanto apresentava o Jornal Nacional sem se levantar pra conversar no painel. 6\nVocê passou o dia num estúdio de TV. 7\nVocê correu 7,5km na praia antes das 8 da manhã. 8\nVocê acordou às 5:55 da manhã. E atenção para o top de 8 motivos pra horizontalizar o esqueleto agora. Alô? Doutor? Desculpa a hora, doutor. Mas é que eu tô me sentindo como se eu estivesse sendo seguido. Por uns 5 milhões de pessoas. É grave? RT @afarlins: @realwbonner Pastel de cane,quejo ou flango? RT @JessikaWF: @realwbonner  4. \"Boa noite. Açúcar ou adoçante?\" RT @AlanMansur: @realwbonner tulipa ou caneca? RT @brunoore: @realwbonner Boa noite! O senhor já tentou reiniciar o seu computador para ver se o problema persiste? RT @carolinamorim__: @realwbonner cpf na nota senhor? RT @_MarcosAmaral: @realwbonner boa noite débito ou crédito senhor 3. \"Boa noite. É convênio ou particular?\" 2. \"Boa noite. Salgada ou doce? Pequena, média ou grande? Qual bebida pra acompanhar?\" 1. \"Boa noite. Aceitam alguma bebida? Água? Refrigerante? A carta de vinhos?\" @JessikaWF @zero2guardaWB Não há de quê. @laura_nicolli pronto @vitorantoniovv boa. @WFBonemer ok! @nandajaardim receitas culinárias. Uma das maiores companhias de balé do mundo, Bolshoi volta ao Brasil http://t.co/Qo40CFBL4T RT @jornalnacional: #JN está no ar! http://t.co/0xlc5LDFCA Por que é que os brasileiros têm mandado pro conserto aqueles aparelhos que preferiam comprar novos, até outro dia?\n#JN Por que é que os médicos alertaram as meninas pro perigo de usar o jeans justo demais?\n#JN O que é que paga mais imposto no Brasil?\nCarro? Bicicleta?\n#JN Mas a tropa da internet só posta depois que #oJNestánoar 12 de junho tem foto especial da equipe do #JN no Facebook. oi. O nosso cinegrafista em NY Lúcio Rodrigues filmou e babou o filhote Luca. 👏🏽👏🏻👏🏿👏🏼👏🏽👏🏽👏🏻👏🏼👏🏿\nhttps://t.co/OXmXrdP4XR SQN https://t.co/Ga3w6Ejep8 IIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIT'S\nTAAAAAAAAAAAAAAAAAAAAAAAAAAAAAIMI! Valeu, tropa.\nObrigado pela companhia. RT @Sra_Grulha: Ela não me chamou de tio #chatiado \n@realwbonner http://t.co/ixo24gu0ha Rá! Vocês eu não sei.\nMas eu tô vendo a @majucoutinho ali no painel mágico do #JN , pronta pra falar da previsão do tempo. Agora é saber se a @majucoutinho vai mesmo chamar o tio de tio no #JN. Porque ela andou dizendo isso no #Encontro com a patroa. O tio saiu de casa às 9:50h. E por causa do túnel fechado só vai poder sair da firma agora, pra não ficar engarrafado. #nobodydeservesit Valeu, tropa.\nInté. Pensando bem, eu conheço gente que usa cavanhaque longo. Outras, que têm olhos esbugalhados. Mas elas não invadem computador de avião... valeu! Eba! https://t.co/d6nuCY8I0n Muito bom ver a sobrinhada toda do tio festejando o #JN desse jeito.\nA tropa daqui agradece a tropa daí.\nValeu! RT @FabianadeLiz1: @realwbonner eu moro em Floripa e acho fofo qdo a Maju a chama assim :) RT @cardosollukas: Jornal Nacional tá SENSACIONAL! Parabéns @realwbonner RT @PauloNetoNeves: Prefiro Floripa e BH mesmo #JN @majucoutinho @realwbonner @jornalnacional Tchau tropa! Gostei tanto desse cenário que eu já nem sinto mais falta das bermudas. já. 15 30 segundos. Vai começar o #JN. Abriu! Tchau!!! Legal. Túnel fechado. Tio parado. Mesmo sem poder usar mais aquelas bermudas classudas, o tio tá curtindo o cenário novo. RT @jornalnacional: #JN\nhttps://t.co/YwV9LapWdh Hoje o #JN vai estrear cenário novo. 👋🏻👋🏼👋🏽👋🏾👋🏿 https://t.co/uNt7moWuzX Hoje o #JN vai estrear cenário novo. 👋🏽👋🏼👋🏽👋🏼👋🏿👋🏾👋🏿👋🏻 https://t.co/bHlMPWPhuh Hoje o #JN vai estrear cenário novo. 👋🏿👋🏽👋🏼👋🏻👋🏻👋🏿👋🏽👋🏽 https://t.co/brpuOcywka Não é que vai ter só o cenário novo, entende? É que o cenário muda outras coisas...\nPutz. \nNão dá pra explicar aqui. Duas coisas:\n1.Força pra @Carolbarcellosc ,  @Conservani e equipe no Nepal. Jornalismo TOP!\n2.O @jornalnacional estreia cenário hoje. 😬 Eu sei. Isso causa estranheza. Mas o que eu queria dizer agora é que tenhamos todos um bom dia. Uma palavra só, sobre tudo o que eu vi ontem à noite no show dos #50anosdaglobo :\nE S P E T A C U L A R.\nhttp://t.co/JAvIl64aQo Muito obrigado, em nome de todos esses talentos que têm orgulho da profissão, da carreira que construíram e de integrar essa equipe. #CidMoreira #SergioChapelin #JN #50anosdaglobo \nÉ agora.\nTudo pronto. Prepare o lenço. O do tio tá aqui. #JN começando em 20 segundos. Bora rever a última década do jornalismo da Globo.\nE curtir a homenagem ao Cid Moreira e ao Sérgio Chapelin. RT @MarcioMoro1: @realwbonner lembro como se fosse hj, estava assistindo ao vivo, mesmo na tristeza q pairou pelo Brasil, vc consegui segur… RT @Rosesmv: @realwbonner excelente produção!! Vcs todos estão SUPER de PARABÉNS! Semana imperdível do JN!! Me emociono em cada década! :) O tio narrou os funerais, em 1994. #50anosjornalismodaglobo \n#Senna #cinquentio http://t.co/cdL7N5oNLF Hoje foi difícil segurar a onda ali na bancada depois da exibição da terceira década. Mas não foi só pra mim. Diga EU quem balançou. Tá. E como me ensinaram meus antecessores Cid, Chapelin, Hilton, Berto, Campbell, Hummel, Leo, Celso...\nDigo a todos: boa noite! Agora o tio vai pedir licença pra suprimir de fótons as retinas e horizontalizar o esqueleto velho e cansado. É hora do pijamão listrado. Só em todas vezes que vi o material editado, @manueleoliveir7 .\nMas acho que o capítulo que vai ao ar nesta quarta foi o que me tocou mais. Viu o Piquet deixando o Reginaldo sem a resposta? Hahahaha! Épico, @DeThabet ! Num sábado, passamos mais de 8 horas em estúdio, divididas em 5 décadas. E é claro que teve momentos em que a emoção balançou todo mundo. Lado a lado, num círculo, aqueles colegas talentosos, experientes, dividindo essa experiência com a gente. É legal demais. Nós também, @ruyjobim . Temos recebido mensagens emocionadas exatamente porque as pessoas vão revivendo aqueles fatos junto com a gente. A Globonews vai mostrar o making of no sábado. Sensacional ver repórteres chegando de NYC, Washington, Roma, Londres. E pegando a van. Valeu, @MeirellesFilipe . Na verdade, já fizemos isso há algum tempo. Olha lá no http://t.co/pIm1LzgvqG Obrigado, @_GalacticMonkey .\nNo JN, serão 5 capítulos até a sexta-feira. Com homenagens a Cid, Chapelin e cinegrafistas. RT @jornalnacional: A vida e a carreira de Marcelo Canellas fazem parte da nossa história. #Globo50 Mais aqui: http://t.co/xZ4kJz7r0P\nhttps… 1966-1991 https://t.co/pXgTVyWnNH RT @jornalnacional: Por que a cobertura de um acidente marcou o Heraldo Pereira? #Globo50 Mais aqui: http://t.co/xZ4kJz7r0P\nhttps://t.co/8K… RT @jornalnacional: #Globo50: a partir de segunda, no #JN. Mais aqui: http://t.co/xZ4kJz7r0P\nhttps://t.co/si4iKzzRX7 https://t.co/XQ43cf8qSs RT @jornalnacional: Se a Fátima Bernardes pudesse voltar no tempo, que momento ela reviveria? #Globo50 Mais aqui: http://t.co/xZ4kJz7r0P\nht… 👏🏻👏🏻👏🏽👏🏽👏🏼👏🏾👏🏿👏🏼 https://t.co/ZYorDZQCBV RT @jornalnacional: Pedro Bial testemunhou a história. #Globo50 Veja mais vídeos aqui: http://t.co/xZ4kJz7r0P\nhttps://t.co/qCqA3kViwL 👏🏽 https://t.co/JiZZ5LwfxZ RT @jornalnacional: Belezas e dramas do NE são parte da história do Chico José. #Globo50 Veja mais histórias: http://t.co/xZ4kJz7r0P\nhttps:… RT @jornalnacional: “Sofri enormemente”, lembra Caco Barcellos. #Globo50 Veja mais histórias aqui: http://t.co/xZ4kJz7r0P\nhttps://t.co/cfHI… RT @jornalnacional: Uma reportagem que salvou vidas. Veja o relato do André Luiz Azevedo. #Globo50 Mais aqui: http://t.co/xZ4kJz7r0P\nhttps:… RT @jornalnacional: O repórter é o cara que conta pra gente a história, quando ela tá acontecendo. #Globo50 Mais: http://t.co/xZ4kJz7r0P\nht… RT @jornalnacional: Um momento que marcou Galvão Bueno e a vida de milhões de brasileiros. #Globo50 😄 Mais aqui: http://t.co/xZ4kJz7r0P\nhtt… RT @jornalnacional: O que será que marcou a carreira da Ilze Scamparini? #Globo50 Mais histórias aqui: http://t.co/xZ4kJz7r0P\nhttps://t.co/… Esse é O cara. “@jornalnacional 😉 #Globo50 Veja mais histórias aqui: http://t.co/vvnpc6C0ds\nhttps://t.co/PRicgfeQzK” Mais um vídeo. Mais uma história. “@jornalnacional: A história da Glória Maria conta também com o acaso. #Globo50\nhttps://t.co/uiOq0Y17fV” RT @jornalnacional: Por que um enterro mudou a vida do Luis Fernando Silva Pinto? #Globo50\nhttps://t.co/JAyvYvROMW RT @jornalnacional: Qual cobertura marcou a carreira do Renato Machado? #Globo50\nhttps://t.co/LVLiJw70e1 ⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️⌛️ Alô @jornalnacional !\n2 minutos!\nQuero ver. Alô @jornalnacional !\nPrometi dar uma dica em 7 minutos. \nTô de folga mas tô de 👀 Daqui a 8 minutos vai ter uma dica. “@Ihearthebirds: @realwbonner é sobre o especial de 50 anos né?”\n😶 “@mateusboechat: Já sabemos que é cenário novo, tio. \n\nTsc tsc. Não é isso. É uma novidade que deu um trabalho enorme pra ser feita. Ficou emocionante. Mas vai levar mais umas duas semanas pra poder ser mostrada. Sabe quando vc quer mostrar uma novidade mas não pode? \nPois é. 1965 &amp; 2015 http://t.co/dGopSB16R4 RT @epsonaraujo: @realwbonner SHOW!! RT @rafaela16jacare: @realwbonner show RT @nelsongabriell: @realwbonner SHOW RT @SaaMagalhaes: @realwbonner shoooooow Assim.\nQuem conhece o tio sabe. \nMas é que faltou dizer que... Que vocês são... Peraí!\nVoltei!\nMas é rapidinho. @mountbatten_ Era... @JessikaWF Isso. Que a noite lhes seja serena - e as penas do dia pareçam pequenas. \nQue os sonhos lhes sejam amenos - e anjos tranquilos lhe mandem acenos. RT @mandy_in: @realwbonner Antes de sair tem que falar o versinho dos anjos tranquilos e não pode esquecer de dizer que a gente é show! ☺ Agora, se me permitem, a horizontalização esqueletal se faz urgente. Suprimirei de fótons as retinas, distendendo gorduras pálpebras. “@pattgab: @realwbonner Seu sobrinho Mandou Bem hoje na cena com a Savalla em Alto Astral”\nO @HugoBonemer é craque. #primotiete “@lael1972: @realwbonner http://t.co/NjoM3Iwtk0”\nNOVENTA E TRÊS VÍRGULA SETE. \nRÁDIO UNIVERSIDADE DE SÃO PAULO. USP FM. Essa praça ficava perto da Escola de Comunicações e Artes da USP, em frente à rádio onde estreei como locutor. http://t.co/F2Usu3VP5c Atrás do portão, no fundo, a tecelagem que faliu. Quando a chaminé soltava fuligem, era correr tirar roupa do varal. http://t.co/088XY30qgj Travessa Irene Semler, Tatuapé-SP. O menorzinho aí sou eu, orgulhoso de ter escalado o Himalaia de areia até o topo. http://t.co/9njXo9Cl9Y Sou paulista paulistano radicado no Rio. Na ponta do lápis, o #cinquentio morou em SP 9367 dias. E, no Rio, 9401. Aliás, como SP deu uma esvaziada, o tio aproveitou pra rodar de carro por lugares em que viveu experiências marcantes. Tatuapé, USP... @amandamarques_s Quanto tempo, Amanda! É que o tio veio a SP dar um beijo no... No tio-avô de vocês. \nEle completou 85 anos, hoje.\nE, antes de desmaiar no hotel, vim dar um alô. RT @_lucimedeiros: @realwbonner é assim, tio. Prossiga, estou louca pra ler o q cê tem a dizer. RT @BruuhAlbino: @realwbonner vale lembrar que somos chamados de sobrinhos e vcê de tio. Ah, twittar usando um pijamão listrado faz de algu… RT @DannynhaMansani: @realwbonner O bom tio a casa torna! Peraí. A gente escreve alguma coisa em até 140 caracteres e quem segue recebe. \nEra assim, né? https://t.co/E9h32gtGTD “@uma_Pianista: tio, você gosta de the killers? @realwbonner com a graça de Deus ele vai me responder, tenho fé, amém.”\nSim! http://t.co/lIEG98Htme O que tem que ser feito vai ser feito. \nAgora. \nMuahahahahahahahaha!!! http://t.co/6gIIdBs55K Talvez ficasse menos estranha se tivesse crescido mais. Mas esse #cinquentio não acha legal esperar pra ver. O que tá acontecendo é que essa barba do tio fica muita estranha numa tela de TV de alta definição. Muito! A pedidos, uma #InterativaDoTio pra ajudar a decidir. \n\n#cortaabarbatio\nOU\n#deixaabarbatio http://t.co/7vrmBOKldg “@martaleticia_: @realwbonner cisco no olho e sopro cardíaco”\n\n😘 “@sueniafernandes: @realwbonner tio visconde trabalha amanhã?”\n👍👍👍 “@JessikaWF: @realwbonner as bermudas são da cor da gravata??? 😂😂”\nNão. \nDas meias três quartos caneladas. Agora, se me dão licença, a horizontalização esqueletal se faz necessária e urgente. Tenhamos todos uma boa noite. Sem versinhos, hoje. “@acciogeezer: @realwbonner E nós somos o que mesmo, tio?”\nShow. \nQuando eu consigo passar aqui, é pra relembrar que vocês são muito show. RT @LocoMath17: @realwbonner tio, usa calçado adequado, senão vai dar joanete. “@zero2guardaWB: Quero ver o tchio @realwbonner de pé no JN igual ao Evaristo, William Waack.”\nMas aí o tio não poderia mais usar bermuda. RT @jpfilosofia: @realwbonner Bota marcha leve nisso, tio Mas eu passei aqui só pra dizer que 2015 vai ter novidade por lá. A #firma vai facilitar meu serviço e botar corrente nova pro tio pedalar. Esse negócio de pedalar debaixo da bancada pra girar o globo terrestre lá no cenário tá meio cansativo pro #cinquenTio Em nome de toda a equipe do #JN que trabalha com a gente no Brasil e no exterior, o tio deixa, aqui, os votos de um feliz ano novo. :-) Sim, @LucasRangelCwb . Você é craque, @gvizane . A tropa de SP fez mesmo um trabalho muito bonito. Tem mais já já. Brasileiros falando de esperança, no #JN. Muito legal. Feliz Natal pra todo mundo. Gente querida por perto, abraços, olhares ternos, paz. E saúde pra todos. 🙏 O tio agradece, @mtpolicarpo Sabadão. O Trabalho enobrece.\n#TioVisconde\nhttp://t.co/xuddOqlZV7 Valeu.\nInté. Quem não gosta que me perdoe, mas eu não consigo chamar o zápi-zápi de outro jeito desde que ouvi uma conversa aqui perto da #firma . Na chamada feita com celular eu me senti como se fosse um recado de zápi-zápi. Gostei. Quem viu a chamada que o tio gravou no clular pro #JN de hoje lá no fêici-búqui? Nunca tinha feito. O que tá acontecendo é que o #JN começou. Pronto. Esse #TheVoiceBrasil tem uma capacidade de me emocionar que chega a ser constrangedor. É choro e riso e choro e sorriso e começa de novo. 👏👏👏👏👏 http://t.co/oZk1I8wdO0 Luís Fernando Veríssimo, num texto pra ser saboreado em tempos de impaciência e intolerância. \nhttp://t.co/YmHPDD9kwh Que a noite lhes seja serena e as penas do dia pareçam pequenas. Que os sonhos lhes sejam amenos e anjos tranquilos lhes façam acenos. Obrigado, @luizcarlosaquin RT @Cacagiriboni: @netohelcio1 @realwbonner hahahaha falei.. Não era possível 😂😂😂 RT @LiuLiuprotecao: @realwbonner estava acontecendo um debate no meu trabalho sobre este vídeo, vc leu nossos pensamentos em citar esta mon… Todos demonstraram compreender perfeitamente a importância e a necessidade de as entrevistas serem como são. Diferentes da propaganda deles. E agradeço aos entrevistados, que aceitaram ser confrontados com questões polêmicas e desconfortáveis diante de milhões de eleitores. Esclareço, agora que terminou a rodada de entrevistas com os candidatos do primeiro turno no #JN  \nSabe aquele vídeo estranho? \nÉ montagem. Mas, neste caso, a multa indevida valeu o gostinho de ser o estraga-prazeres dos robozinhos. 😜 http://t.co/cGrlZX8LAU O tio não é candidato a nada. Como a maioria dos brasileiros, anda na linha e não gosta de pagar pelo que não deve. http://t.co/SoCXXsHvUK E lá foi o tio pagar o que, de fato e de direito, não devia. Atualizados, os 78 viraram 500 reais, mais ou menos. http://t.co/dULtmqj38B Meu contador recorreu. Mas a defesa do meu direito de contribuinte virou fofoca, nesses dias de entrevistas com candidatos. Coincidências... Assim. Em 2010, a Receita equivocadamente aplicou multa de R$ 78 (setenta e oito reais) por mora. Irrisória, mas indevida, na minha opinião. Puseram na internet que a empresa do tio devia dinheiro à Receita. Putz. Num domingo. E lá fui eu investigar essa história. Brimos. http://t.co/0hLAgm3g8X A História dos Amantes. Texto e direção do @marceloserrado1 http://t.co/PFBX0KlKH9 O filme do Branco Mello, \"A vida até parece uma festa\", deu uma nostalgia avassaladora no cinquentio. Vocês, crianças, não entenderiam. Bom dia!\nSabe o #DesafioDoGelo ? Foi só um jeito divertido de lembrar que QUALQUER ajuda voluntária é bem-vinda. 😉 http://t.co/8il9yATIiG Pois é. \nTinha 2 ao meu alcance depois do peixinho do jantar. \n#chocólatraarrependido Sabe aquele doce de marshmellow cilíndrico, achatado embaixo e abaulado em cima, coberto por uma casquinha de chocolate? Sim, a candidata Marina Silva aceitou o convite para a entrevista.\nSerá na quarta que vem. @fabiolafelicio Melhor pessoa? Cara, esse é o elogio mais TOP! Beijo do tio! RT @daniornelas: @realwbonner faltou um signo e uma frase pra terminar... HAHAHAHAHAHA RT @layanas_: @realwbonner Pergunta bônus!!!!!: sertanejo universitário ou de raiz? RT @ItsGuiRodrigues: @realwbonner \"Pedra, Papel ou Tesoura?\" hahaha Mas o tio divulga as sugestões dos robozinhos partidários pra quando entrevistar candidato DELES. http://t.co/xJgM9W0H3I Tão bonitinho ver robozinho partidário replicar mimimi porque fizeram pergunta difícil pra candidato! Uown! \"Jornalista mal-criado e feio!\" Retrata a Suécia, onde NENHUM cargo público assegura mordomia NENHUMA. Problema da leitura é que dá uma raiva danada. Aliás, neste período de eleições, eu recomendo a leitura do livro da jornalista Cláudia Wallin: \"Um país sem excelências e mordomias\". Show. Então, só pra dar a variada... Bom dia! Muahahahahaha!!! Valeu, @NandoBertazzo RT @Tatycatarina: @realwbonner vc mandou mto bem.. vc me representa ;) RT @AlessandraSSant: @realwbonner vc fez uma coisa incrivel: tirou tds os sujinhos da zona de conforto . Brigada,eu. RT @LariBriito: @realwbonner o importante é que nós, eleitores,  estamos muito satisfeitos.  Ótimo trabalho do JN! Robôs partidários de todos os matizes insatisfeitos! Corruptos insatisfeitos! Blogueiros sujos insatisfeitos! Muito bom! Obrigado mesmo! “@_CentralBonemer: @realwbonner Tio,hoje é dia da fotografia. Que tal compartilhar que o senhor tirou e gosta muito?” http://t.co/FlT8U06dQZ Sim, @DavidLTavares , se ela for oficializada e se aceitar, claro. Muito obrigado! ☺️ http://t.co/TPNrEYuCt0 Os sobrinhos mais jovens vão gostar de ver isso. Saiu no jornal Folha de S.Paulo em 2006. \nhttp://t.co/NxpsaE4qzl Agora sim.\nBoa noite. Pra você ver como bastaria tentar se informar...\nObrigado, @rafaelmaravalha . RT @rafaelmaravalha: @realwbonner a foto \"printada\" la da matéria http://t.co/CoWMERhBTy http://t.co/0SAitpedqb @medolabella @kellymenegas @Ca_Moredi \nNão senhora. FHC também foi entrevistado no Alvorada. http://t.co/uGS7xbjMsm Cisco no olho e sopro cardíaco, gente. Pô!\n😘 Cisco no olho e sopro cardíaco pra todos. Sempre, @zero2guardaWB . Agora, se me permitem, alinharei minha carcaça velha com o horizonte e estenderei pálpebras de modo a suprimir de fótons minhas retinas. “@JoaoGabrielTV: @realwbonner Matéria do PT reclamando das suas perguntas fortes a Dilma...”\n\nExato. Saiu em 2010... É. Derrubamos mesmo. Alguém conseguiu ver? Eu retuíto quem contar. Pô! Derrubamos o site do link! Peraí. Quem se informa evita erros por preconceito. Pra quem acha que as queixas sobre perguntas incisivas são novidade...\nhttp://t.co/O8H0Q4hrNB “@medolabella\nCandidatos à reeleição são entrevistados onde preferirem. Prerrogativa que não é novidade. Olha a foto. http://t.co/ADTGBAHptM E ser jornalisticamente incisivo é para todos os candidatos, claro. Gente, fazemos isso desde a eleição de 2002! É só pesquisar. Sobre a questão de ser incisivo nas entrevistas, já expliquei que se trata de um imperativo do jornalismo. É o oposto da propaganda. Ponto. @lumachadolima 😊 @niggasperry 😉 @BrunaLFC ☺️ @ritsuppy Não. Só uma parte. “@gersonfreire: @realwbonner Muito bom seu posicionamento em meios as ladainhas da internet”\nDe 2002 pra cá, aumentaram com redes sociais. “@Guerrilho: @realwbonner tio, quando crescer quero ser igual a você, só que não jornalista, e sim chefe de cozinha =3”\n\n?????????????? “@AdinaelGadelha: @realwbonner me tira uma duvida, de quando é aquele video seu imitando o Clodovil??”\n\nAcho que 1994... “@brunnaomp: @samarabFW @realwbonner Patroa já está dormindo ?\"\n\nShshsh! Fala baixo! “@breendaismael: E, consequentemente, do Pastor Everaldo na Terça?”\n\nDepende da disponibilidade dele. Não tenho confirmação ainda. “@Adri_Sch: @realwbonner Previsão de quando será a entrevista com a presidente Dilma pelo @JNTVGloboBrasil ??”\nProvavelmente na segunda. Bom dia. Sobrinhos, devo confessar que é hora de horizontalizar o esqueleto deste velhinho alquebrado. \nTenhamos todos uma boa noite. E o recado final pros robôs partidários de todas as siglas.\nMesmo com esse barulho ensurdecedor na consciência,\ntentem ter uma boa noite. “@RiMaciel: @realwbonner contamos com isso com TODOS os candidatos!!”\nTenho um compromisso com minha profissão, minha honra e meus filhos. Quem dera todos os eleitores compreendessem a importância de uma eleição como você, @fisio_daniel RT @VlNlClUSVIEIRA: @realwbonner A \"futebolização\" da política nacional é nojenta e emburrecedora. RT @ricardodebrito1: @realwbonner http://t.co/gaT52meXMx @edusilveira2010 Muchas gracias. http://t.co/5elWtniDev \"Fiz e farei as perguntas que os candidatos prefeririam não ter que ouvir\" http://t.co/RMubc3Z495 http://t.co/XuVzQ8M4dl\n#vocetambempode @NayaraaBy diga Dias pesados. “@AdilaAquinoS_:@realwbonner Pra dizer que somos show?”\nIsso. Porque os sobrinhos dos velhos tempos me dão saudade. Vocês são show. Valeu. Ah! Voltei. Mas é rapidinho. Vou distender as pálpebras de forma a suprimir de fótons minhas retinas velhas e cansadas, alinhando a carcaça com o horizonte. Boa noite. Bom, eu acho que vou indo. Amanhã o desesperador toca às 5:55h pra levar a molecada pra escola. Hora de horizontalizar o esqueleto. Alô. Doutor? Desculpe a hora. Mas é que eu preciso perguntar uma coisa. \nO senhor acha, assim, que eu sou, tipo assim, melhor pessoa? Mesmo? Não, agora não adianta. Agora eu sei que vocês dizem isso pra todos. 😞 Minha filha me zoando porque eu confessei ter gostado de um elogio que recebi. \n\"Pai, todo mundo chama todo mundo de \"melhor pessoa.\"\n😔 Brincadeira, tá? O Podolski não tem o meu número. \nNem o Messi. \n😅 Eu disse no #JN que o Podolski é brasileiro mas ainda não sabe. \nMas ele diz que sabe, sim. O Podolski ligou pra dizer que eu estou errado. E não é que o seu Joedir conseguiu finalmente ver a final no Maraca?\nO #JN acompanhou. Numa ação coordenada, recebi de presente uma lata de brownies e outra de cookies. Era pra ter sido o primeiro dia da dieta pós-Copa. RT @julio_calves: @realwbonner Bola de Ouro para o Messi?.. Comédia!!... kkk RT @mountbatten_: A copa acabou e o @realwbonner nunca contou o apelido que a Patrícia Poeta deu pra ele :( RT @aline_firmiano: Tio @realwbonner tem razão: \"O @Podolski10 é Brasileiro, só não sabe disso ainda.\" #FicaPodolski #SRN Mas não é? É brasileiro, só pode. Buenas noches. http://t.co/o9X2pJrNoI RT @MineiroAugusto: .@eugenioleal @realwbonner @BlogdoJuca @wmenezestupi @everaldomarques @odilonradiotupi @tulerbenny @delisiee http://t.c… El tiro de messiricôrdia. http://t.co/5QjtLqw6hL Voltei com o avatar original e ninguém nota. Ma PUTZ! Feliz Ano Novo pra todos. 😄😄😄😄😄\n😃😃😃😃\n😭😭 http://t.co/V1UKpegB8q RT @crazyforj0nato: @realwbonner aproveitando pra twittar no intervalo do JN não é? 😃 Hoje de manhã, meu cabeleireiro archentchino tirou material pra fazer uma peruca de David Luiz, fácil. A laje do #JN propriamente dita. http://t.co/nvm5s9IOnn O tio vai ali apresentar o #JN na laje. Pô, o juiz vê pênalti em vez de falta, não vê impedimento no segundo gol... E o  holandês que marcou se chama Blind. http://t.co/8H5vO6MHeS Eu tenho medo do jeito que o Robben corre, com bracinhos recolhidos. http://t.co/H4iM5cvpcv Vou dizer aqui algo que eu nunca disse antes. http://t.co/DKTimH2t80 “@trendinaliaBR: The tweet with the most impact of the 'Joedir' Trend, was published by @realwbonner: http://t.co/5ARHfhYZE9 (39 RTs)\nValeu! Daqui a pouco a gente vai contar a história incrível do seu Joedir no #JN. Que a noite lhes seja serena - e as penas do dia pareçam pequenas. \nQue os sonhos lhes sejam amenos - e anjos tranquilos lhes façam acenos. Meia-noite. \nAté amanhã. Até amanhããããã http://t.co/VGkxaJFfEB P U T Z ! Na boa, não é pela hora pro chope. Mas eu conheço a figura. Na terceira tulipa, o Podolski vai pedir táxi e querer me arrastar pra Lapa. É que me ligaram aqui a essa hora pra convidar prum chopp. E eu tive que dispensar. \"Pô, tô mortão. Eu acordo cedo, Podolski.\" Não. Deixa pra lá. Tava lendo as mensagens pro tio. E lembrei. Putz. “@PedroRogieri: @realwbonner tio, fala a vdd, vc viu no google como escreve o nome do jogador alemao ne kkkk”\nPior que não. Faltou o \"C\". Meu cabeleireiro archentchino também faz stand up. http://t.co/qkdxq5FZZw Mas queria dividir com quem torce pela seleção e com seus integrantes essa mensagem: estamos juntos. E vamos juntos pro desafio de sábado. Sei também que o fato de serem  bem remunerados alimentará o rancor dos que enxergam o sucesso como desvio de caráter, em vez de conquista. Sei como dói saber que desapontei alguém, ou muitos, com uma falha. E sei que é exatamente isso que sentem agora os integrantes da seleção. Eu estou triste. Mas solidário a cada um. Sei o quanto pode ser doloroso um erro. O quanto dói sentir que frustrou expectativas alheias. Os integrantes da seleção estão, neste momento, tristes como nós, os que torcemos por eles. E se sentem envergonhados, aposto. Mas eu, não. E, no entanto, cometi erros, imprecisões, ao longo de 3 décadas. Tive muita vergonha quando ocorreram. Muita. Mas os corrigi, sempre. Tenho 30 anos de jornalismo. Acho uma profissão bonita, digna. E, como todas, temos horror a falhas, erros, enganos, imprecisões. Horror. É natural que se envergonhem. Porque desejavam acertar. Vencer. Desejavam nos dar mais essa vitória. E a Copa. Mas falharam epicamente. Os integrantes da seleção disseram: \"pusemos essa derrota na nossa história, na biografia de cada um.\" É fato. Sentem-se envergonhados. Perder de 7 a 1 em casa é humilhante? Acho que sim. \nMas a humilhação é para os integrantes da seleção. Que, diga-se, queriam vencer. Mas os alemães foram extremamente respeitosos o tempo todo. E manifestaram surpresa com o que obtiveram. Não foram eles a nos humilhar. Mas a derrota não me fez sentir \"humilhação\". Nem acho que nosso país tenha sido humilhado. No terreno da abstração, nosso futebol, talvez. A derrota me provocou tristeza e frustração. Queria ver o Brasil ganhar a Copa em casa. Porque adoro a seleção brasileira. E adoro Copa. A derrota de hoje me entristeceu e a alguns milhões de pessoas que, como eu, torcem pela Seleção Brasileira. É pra esses que me dirijo. RT @ddkonkol: Eu acabei de ver uma vaca em cima de um poste no JN, confere isso, @realwbonner? RT @AzevedoLuana_: @realwbonner O negocio é torcer pra Argentina perder amanhã e perder para a gente... Acho que só assim melhora o animo! Eu adoro a Argentina e os argentinos, sério. Hermanos!\nMas nunca torço pra eles no futebol, no basquete, no tênis de mesa e no badminton. RT @anapaulaftp: @realwbonner tudo menos Argentina campeã RT @_PaolaGomes_: @realwbonner O jeito é secar os hermanos amanhã. Sem acreditar nesse resultado até agora. = (. RT @IsadoraZiza: Tio @realwbonner eu prefiro apanhar pra Argentina no sábado, do q ver eles serem tricampeões no Maracanã.  Sente o tamanho… Até pra secar os outros complicou, depois dessa...\n#numtáfácilpraninguém Se a Argentina perder amanhã, joga contra gente, sábado.\nGanhando amanhã, pode apanhar da Alemanha, domingo. \nOu ser tricampeã no Maraca. Bom... Se a gente olhar pelo lado positivo...\nPor exemplo...\nNo segundo tempo, foi jogo duro. 2 a 1... Olá.\nQuerem falar do quê? Isso o #JN não mostra. http://t.co/hg6y2zBvWJ RT @marylazarini: muito feliz por estar de férias e poder assistir o @realwbonner todas as noites pelos próximos 20 dias &lt;3 RT @DiianaR31: Assistindo o #jn e sentindo falta do @realwbonner  twittando durante o jornal. Preciso dizer que eu queria muito estar hoje no #Encontro especial de 2 anos. Parabéns pra patroa @fbbreal e pra equipe toda. Quem quer fazer pergunta pro técnico da Seleção aproveite agora por aqui. Opa!\nTeremos visita. o #JN está no ar. O #JN fala da situação em torno do viaduto desabado em BH.\nE começa em meio minuto. O #JN de hoje traz a situação do Neymar, da Seleção, da Copa do Mundo nesse dia crucial da competição. Daqui a 3 minutos. #ForçaNeymar http://t.co/5Retw4Cuuw Até o fim da copa, o tio vai ter esse avatar pra lembrar que a truculência não pode contra a irreverência. #ForçaNeymar #vamosBrasil RT @Dri_Carreiro: @realwbonner tio, esse jogador que atingiu Neymar tem que ser punido. Muito feio isso. Não foi só impressão. Que a impressão deixada pela violência da pancada sofrida pelo Neymar fique só na impressão, mesmo.\nVamos ver daqui a pouco, no #JN. “@MyrianLago: \nDupla de zaga que brilhou, hoje. #http://twitter.com/jose_simao/status/485181762499514369/photo/1” Aquela pessoa próxima e entendida... entende mesmo. @leonardombs 😏 @mayararech 😉 Uma pessoa próxima e entendida me diz que a Seleção entrará em campo com a disposição com que derrotou a Espanha há 1 ano. \n👍🙏💪 Eu tô aqui, mas sem clima pra tuitar, com esse desastre de BH. Desastre em BH, véspera de jogo decisivo pra Seleção. A redação do #JN ferve. http://t.co/1iw1aDCSSD RT @jhennerock: Amanhã vou assistir o JN e ficar observando o @realwbonner porque eu não acredito que ele fica no Twitter enquanto apresent… E, então, despediu-se, agradecido. E disse o tio, durante o #JN daquela noite, diante de olhares atentos:\n\"A curiosidade é a capacidade natural e inata da inquiribilidade.\" Pois então! Foi o que eu disse. Ninguém quer saber. A Patrícia Poeta me deu um apelido por tuitar, editar textos e responder a emails enquanto apresento o #JN . Mas quem iria querer saber, né? França?\nPeraí que eu também  tenho uma notícia da França pra dar no #JN . RT @alinepedroso77: @realwbonner 👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏😍😍😍😍😍😍😍😍😍😍😍😍😍😍 RT @Thaiany_Star: @realwbonner os super goleiros? *-* ah #JN muito obrigadaaa... os lindosssssss e competentes goleiros dessa copa! Taí o que a mulhegada queguia no #JN E esse falso cadeirante no #JN , hein?\n#facedemadeira #JN voltando. Agora. Minha vez, no #JN.\nPrestenção, por gentileza. RT @hick19: @realwbonner o #JN deveria fazer uma matéria sobre PESSOAS QUE SOFREM SEM JOGOS DA COPA. Tô em crise de abstinência. Quero Copa… Atenção, senhoras e senhores.\nO #JN está no ar. 1 minuto pro #JN decolar. Faltam 2 minutos pra começar o #JN . O #JN vao mostrar que os atacantes dessa Copa conseguem ser mais rápidos, na arrancada, que um carro 1.0. Na bancada do #JN, em contagem regressiva.\nFaltam 5 minutos pra começar. “@fillipe2010: Qual gravata o tio vai usar hoje?\nNa loja não achei verde-limão listrada com furta-cor-rúcula :(”\nVeja daqui a pouco no #JN . “@whereisraissa: @realwbonner já começou o #JN ? poxa tio, desacelera aê :( ainda to no onibus”\nAcelera. Vc tem 44 minutos. “@sueniafernandes: O tio e sua gravata espetacular verde-limão listrada com furta-cor-rúcula \nhttp://t.co/ImVL8O3qSv”\nA de ontem no #JN RT @bahattori: @realwbonner olha o tio aí na chamada do #JN http://t.co/0BezjDHFdB Alô mulhegada. Goleigos no #JN : EUA, ALE, GRE, BÉL, BRA, MÉX, FRA...\nTá bom procêis? 👍 O que está acontecendo é que o tio vai fazer a chamada do #JN http://t.co/mGXWglECbo “@MariiAnselmo: @realwbonner muitas imagens do Karnezis, por favor tio!!!”\nEsse já foi despachado, né? 👋 RT @TuttyTalebi: @realwbonner vcs deviam fazer um JN inteiro com o Julio Cesar! *-* RT @katyryban: @realwbonner Por favor quero mais foco nos goleiros da #gre e da #fra obrigada! RT @acsa_nx: @realwbonner mostrem mais o goleiro da bélgica tio “@luanccoelhotw: @realwbonner mas e pra rapazeada?? que que vai rolar?”\nA gente pode contar que eles têm mau hálito... Atenção mulhegada:\nO #JN de hoje vai ter reportagem com os goleigos da Copa. RT @JornalOGlobo: Cristo Redentor ao amanhecer. Foto: Fernando Quevedo/ Ag. O Globo http://t.co/j4PRSCT1hb Obrigado pela companhia agradável.\nBoa noite procêis tudo. RT @luciohoshi: @realwbonner Tio, a gente fica confuso c/aquele cara sério ali na TV! Mas a sobrinhada te conhece desde a época do Romário … Por que essa Copa é tão espetacular?\nDaqui a pouco, no #JN, a estatística da emoção.\nE a minha gravata sensacional, claro. Prenderam o marido da Carla Bruni. Daqui a pouco, no #JN . RT @LordKyoko: @realwbonner Na 2 ela fica espetacular... Mas na 3 fica marvilhosa.... Ai meu deus que gravata divina! É verde-limão listrada com furta-cor-rúcula, @brunolaurence RT @PlenaeAbsoluta: @realwbonner 3... Não, 2... Não, 3... Péraí. É na 3. Não, não... Na 2. Não... É na 3 mesmo. Ah! Sei lá! Nas duas! RT @Joanabernar: Não consigo nao rir do @realwbonner quando ele volta todo serio do intervalo do JN depois de ter postado alguma coisa engr… RT @Andreia_Ferrari: @realwbonner Tio vc twitta uma enquete e logo aparece ali na minha frente todo serio....eu ainda pensando na cameta 2 … Vote pelo número. A gravata do tio fica melhor na câmera 3 (aberta) ou 2 (fechada) no #JN? RT @mountbatten_: Vc olha o @realwbonner falando na TV e não consegue assimilar que ele está twittando! RT @vanmiaumiando: @realwbonner kkkkkkkkkkkkk ô modestia. Calma.\nA gravata espetacular do tio vai aparecer de novo já já no #JN . O #JN mostrando que nesta Copa, definitivamente, #numtáfácilpraninguém . Por que a Copa tá tão emocionante? O #JN vai explicar com números. E com direito a uma gravata espetacular do tio. RT @Petit_B: @realwbonner Imaginei o tio com uma gravata tipo Falcão, aquele cantor de brega. Pra falar de uma Copa espetacular, uma gravata espetacular.\nDaqui a pouco, no #JN . “@Sylvia_Nasc: Pronto @realwbonner, os gregos vão voltar para casa!”😜 RT @JenniferAnielle: @realwbonner Eles tiveram sim hem! Haha O Júlio César deles bateu um bolão. 😀\n#CostaRica RT @_licor_: @realwbonner mais um pouco de gregos pra sua patroa... Voltei. \nRapidinho.\nSó pra dizer que esse jogo ficou sensacional no fim. E que vai ser difícil a Costa Rica ter estrutura emocional agora... Neste momento, peço desculpas pela profusão de pios e me retiro. \nAdeus! RT @Bruno_veter: @realwbonner fala que a Grécia tá quebrada e que os gregos estão todos pobres. Funcionou com minha mulher. Kkkk Gente, na boa. O tio tá velhinho. Vocês querem falar de troglodita grego, brasileiro marrento, gol esquisito ou quê? Num tô entendendo. RT @Canal_Palmeiras: @realwbonner @LuizThunderbird É aquele Holandes: Van Der Lei Luxemburgo RT @deaalves: \"@lucasfelix: Onde assina o pacote do Twitter que tem comentários do @realwbonner em todos os eventos esportivos?\" Tbm qro!!!… “@LuizThunderbird: @realwbonner Muricylis Ramalhopoulos?”\nHahahahaha!!! NÃO! RT @luizgallo: @realwbonner Qual será a filosofia do time da Grécia? Esse técnico da Costa Rica me lembra um outro, brasileiro, tão marrento quanto. “@WI7IAN: @realwbonner A Seleção da Grécia pode até perder, mas, na minha geladeira, o iogurte grego venceu!” Esquisitaço. Mas valeu. Gol! RT @Criistiellen: @realwbonner Pode isso tio?? RT @aaihpepe: @realwbonner a chefia aqui tbm acha tio. Não esta facil pra ngm hj. Polêmica doméstica. A patroa teimando que um troglodita desse jogo GRE x CRI é bonito. \nFala sério. “@inowgb: TopMention(3hrs) 1:@DwyaneWade 2:@MCHammer 3:@realwbonner 4:@ochocinco 5:@MarlonWayans 6:@dkny 7:@FOZZYROCK 8:@LilJon ..”😏😏😏 “@jonatan_midt: Video mto bom sobre o assunto anterior @realwbonner : O CHUTE PERFEITO | Nerdologia 38: http://t.co/aoBZIj40Qm”\n😏 E que frase bonita, essa minha. Aplicando... Aplicada... Riqueza vocabular e estilo. “@fabinhoQJ: @realwbonner E, complementando, vai classificar ou Costa Rica ou Grecia para as quartas de final” isso é você que tá dizendo... @dra_bia Verdade, Doutora. RT @juniordiassouza: @realwbonner Tristeza agora nas ruas do México! http://t.co/YhweoxOTNd Aplicando meus conhecimentos recém-adquiridos de física aplicada ao futebol, prevejo que Costa Rica x Grécia será um jogo de Copa do Mundo. RT @Mandico86: @engcristianoc @realwbonner Na verdade tensão tb é uma força. O que foi mencionado é pressão. RT @engcristianoc: @realwbonner força é dada em Kgf ou N. A unidade que você aplicou foi tensão: força/área. Sei que fui chato tio. Sou seu… RT @Fabiosmoura: @realwbonner  Praticamente  um @StephenHawking “@LEANDRAECARLA: @realwbonner ahhhhh tiooo tu não existe, mas ângulo não foi de 15 tio, foi 16,5 faz a conta aí?”\nPUTZ!!! Errei a integral! Donde se conclui que futebol é uma caixinha de surpresas subordinadas à física. Mas se o ângulo de impacto da chuteira dele na bola tivesse sido entre 7 e 11 graus, em vez de 15... Aí teria tocado no mindinho do Júlio. Pelos meus cálculos, se o chileno tivesse aplicado uma força de 25,6 kgf/cm2 na bola em vez de 25,3, teria passado por cima do travessão. Cada seleção que marcar um gol na Holanda vai lembrar o que ela foi capaz de fazer com o México. #numtáfácilpraninguém \n#meda RT @ValdineiEstevam: @realwbonner  Técnico do México mexeu errado. Fechou o time cedo demais. @tarsopaulo Hahahaha Sensacional! Dá pena do México, mas a Holanda mostrou uma força assustadora. Que jogaço! Ochoa carrega o mundo. Dois timaços. Será que vira? Será que o México reage? Será que dá tempo de evitar prorrogação? Copa do Mundo é tudo de bom. E essa tá boa demais. Olha só a Holanda, forte, encantadora, sofrendo um bocado diante dos mexicanos que empataram com o Brasil. #numtáfácilpraninguém Aí dá tudo certo, claro. A gente passa pela Colômbia e vai pra semifinal. \nContra a Alemanha. \nOsso de novo. \n#numtáfácilpraninguém Encruzilhada. Torço pro México pra fugir da Holanda. Mas qual poderia parar a Argentina? Osso. E a gente ainda tem Colômbia pela frente. É como eu sempre digo. \nBoa noite! Mas um mané sem noção iria querer exatamente essa visibilidade, né? Vai rolar não. Gargalhada de desprezo pra ele. Muahahahahaha!!! Tô pensando. Acho que seria divertido retuitar os posts que o tio considera mais sem noção. RT @Luciana_Helena: @realwbonner Só faltam dizer que o Brasil comprou a trave. Oba! #CentraldaCopa Na Copa do Mundo, é o mundo contra a seleção brasileira, pressionando árbitros. O de hoje claramente sucumbiu à pressão. @AnaCarol1977  \nOlhe direitinho. A bola bateu na manga da camisa. Olhe direitinho. Esqueci de dizer. O juiz roubou o Brasil 2 vezes hoje. \nCadê os gênios que repetem estupidamente que o Brasil é favorecido pela arbitragem? Tchau, tropa.\nO tio vai descansar.\nMuahahahahahaha! Fala sério. \nO tio brilhou nesses 57 segundos em que apareceu hoje no #JN, né? \nMuaha!!!\nAgora tem a reportagem do'#JulioCesar \nPrestenção! Tadeu me copiou. Falou em sufoco. voltando. #JN E vou falar de novo no #JN. Peraí. Num disse? Depois que o Bassan disser que a Copa começou de novo... o tio vai entrar no #JN . Agora o tio vai se concentrar pra aparecer daqui a pouco no #JN. Peraí. HAHAHAHA!!! O Suarez dizendo no #JN que \"perdeu o equilíbrio\" e acabou batendo com os dentinhos no ombro do Chielini! Equilíbrio mental? O tio saiu bem, né@HugoRebal ? Tem algo a meu respeito que nem todo mundo sabe. Mas eu sou doido por Copa do Mundo e por Seleção Brasileira. Sempre. No #JN e fora dele. RT @laurabonemer: #FifaWorldCup #WorldCup2014 #Brazil2014 Nunca vou esquecer esse dia 💙🙏🙌 http://t.co/wPnvTQ5Oxh E digo mais.\nChoro de novo a cada vez que o #JN mostra a explosão da torcida nos gols e na vitória, nos pênaltis. Litros.Tipo agora. Ocêis tudo aí, num sei.\nMas o tio chorou muito com a entrevista do #JulioCésar no #JN #valeujuliocésar \nNossa gratidão! Ontem, quarto escuro, beijo o rosto da @laurabonemer.\n-Que foi, pai?\n-Você postou que o #JúlioCésar é divo. Ciúme. http://t.co/oKHyapKT0f RT @FofurasdaLu: @realwbonner tá bão demais sô! Tio manda bêjo pra mineirada! RT @flavioccastro: @realwbonner sim cumpadi Bonner Ocêis tão gostando do #JN? O resultado entrará no ar às 20:29h BSA. \nAcho que combina melhor com as bermudas. 👍 Votação encerrada na #Interativadotio Na chamada de telejornal, o jornalista apresentador fica melhor 1 com paletó \n2 sem paletó\nVote pelo número \n #Interativadotio #Interativadotio @ccampi Sim. Isso o #JN não mostra! http://t.co/xyBXKa60Qc RT @MillaSaoPaulo: @realwbonner ta esportivo hj tio...gostei de te ver so de camisa e gravata..acho q dava p tirar a gravata tbm..kkk..bjs … Olha o clipe de torcedores que a gente preparou no #JN. RT @crizcavalcante: @realwbonner ele confundiu beijinho no ombro com dentinho no ombro! RT @blogcitario: É meio estranho ler um tweet postado pelo @realwbonner há alguns minutos e, logo em seguida, vê-lo apresentando o JN. RT @Aline_rog: @realwbonner Imagina o Suarez com 3 aninhos na escola...coitadinhos dos coleguinhas!!! RT @ThayPorto: @realwbonner matéria do Tino Marcos foi linda, belas imagens. O Suarez disse que a mordida no Chiellini foi lance normal de jogo. E o #JN mostrou que, nos jogos do Suarez, é mesmo lance normal... @realdanielf HAHAHAHAHAHAHA!!! E quem aparecer na minha frente repetindo #mimimi de gringo recalcado vai ganhar a gargalhada do desprezo. Muahahahahaha!\n#vamosBrasil “@CarolinaPullig:  foi contra mas foi nosso! #marcelomito”\n\nHAHAHAHAHAHAHA #vamosBrasil RT @DaviRPG: @realwbonner O importante é que só o Brasil fez gol na abertura da Copa. Informação sem chute nem \"achismo\" pra você continuar torcendo pelo Brasil sem culpa. http://t.co/7aiwiHwXQd\n#vamosBrasil Veja a reportagem, @ViniSevero http://t.co/7aiwiHwXQd\nE torça sem culpa. Muahahahahaha @ohnanax Foi 3 a 1. \nO gol deles foi a gente que marcou. \nA FIFA já disse que a regra foi cumprida. \n#mimimi #vamosBrasil \nhttp://t.co/7aiwiHwXQd Pra contribuir com a discussão, nada melhor que informação. \nhttp://t.co/7aiwiHwXQd\n#vamosBrasil #JN PRA-CRA-TRÁ\nPRÉ-QUE-TRÉ\nPRI-QUI-TRI...\nTRRRRRRRRRR TRRRRRRRRRR... http://t.co/160e8nI2QF Sim, @felipefluzao ! Lembrei! Na vida e na arte, o Wilker foi um especialista em mortes improváveis. Caligaris, sobre o Wilker: \"morreu num dia errado. Céu azul, sábado lindo.\"\nNinguém lembra que um personagem dele morreu de rir em \"O Bofe\"? São ou não são, @welligion ? Putz! Bom dia. O tio vai ali tomar café sozinho. A patroa aqui ao lado descontou hoje todas as horas que o desesperador roubou durante a semana. Valeu. Triste mesmo seria se só tivessem sobrado os robôs partidários, insultando uns aos outros. Mas ainda rola algum humor por aqui. Falar bobagem pro psiquiatra imaginário?\n\"Doutor, tô com a sensação se estar sendo seguido. Tipo uns 5 milhões de pessoas\". \n\nNão, né? Ainda tem aquilo de imaginar uma situação absurda, tipo \"tô pilotando meu helicóptero novo\", e geral viaja junto com comentários absurdos? RT @Andreia_Ferrari: @realwbonner Tio o povo ta mais parado que minha vida amorosa Pedir isso ainda tem, né?\n\n“@oliveiramilen: @realwbonner é meu aniversario,poderia me dar parabens?:D” Receita de doce? RT @littleKrys: @realwbonner Meu Deus vc ta fora da moda! 😳 Tá. Então ninguém flooda mais, ninguém inventa mais #AlgumaCoisaModeOn . Certo. \nE contar o que se tá escutando? Tipo #nowplaying Mozart? Tipo: #FloodModeOn \nMas ainda existe isso de botar \n# seguida de \"AlgumaCoisaModeOn\"? \nDigo assim: \n#AlgumaCoisaModeOn O tio acordou, mas não muito. Semiescuridão, o pijamão listrado tá confortável, sabe? E bateu a vontade de floodar. No bom sentido, claro. RT @sembrinks: @realwbonner é meio antigo ja, mas tem gente q usa Sabe me dizer se ainda existe, se ainda se usa, aqui, o verbo \"flodar\"? Bom dia. Passadinha rápida pra agradecer os votos, o carinho. Foi uma honra. E foi muito divertido. Muito mesmo. Obrigado! http://t.co/ntmY1GzfG6 RT @ClaudiaLeitte: Eu os encontrei há pouco e foi massa!!! http://t.co/mUPFvs4cpq @fbbreal e @realwbonner :-) Que a noite lhe seja serena e as penas do dia pareçam pequenas. \nQue os sonhos lhe sejam amenos e anjos tranquilos lhe façam acenos. http://t.co/vWfqgdhkJs Achei que eu tava novinho, agora há pouco, numa imagem de 2002, aqui no #JN. \nPutz. \nEu tinha 39...\n#cinquentio http://t.co/HeFsxqvMc2 O editorial estará daqui a pouco em http://t.co/Xby0oepVwE \nBom noite. Obrigado. Em nome de todos os colegas, daqui da Globo e da Bandeirantes. Bom dia a todos os estudantes. E abençoados sejam os responsáveis por levá-los à escola no primeiro dia de aula. No caso, aqui em casa, eu. RT @crfgustavo: @realwbonner E os carecas, tio? RT @adrenalinke: @realwbonner e quem nao corta faz 2 meses é oq? Homens sérios cortam o cabelo a cada duas semanas. Boa tarde.\nIsso aqui é muito bonito. E ajudou a tornar histórica a última cena \"Amor à vida\". http://t.co/zhRv2xd56g A cena final de Amor à Vida valeu a novela inteira. 👏👏👏👏👏 A música de Mahler. Morte em Veneza. Quem viu o filme? RT @larinhamaral: Olha o cara que o @realwbonner falou #JN Um cara de sorte que a gente vai mostrar daqui a pouco no @JNTVGloboBrasil #JN http://t.co/EghrjtYBSY Sabe quem é? http://t.co/E2xeEe5ZBT @TIOBENPICAO Se o número de seguidores aumentar, terá sido culpa sua. @lorenaU1 Hahahahaha!!! http://t.co/SV9zyeWZpQ Em Londres, como os londrinos de 85 anos. Muahahahahaha! http://t.co/i3fxKoMAVC Na muvuca organizada de Londres. http://t.co/RBFud37aEP “@carloscidadania: @realwbonner Vai na abadia westminster, é lindíssima!!!” http://t.co/RbNvSQYrYf http://t.co/2MtXNhUUbw http://t.co/k4g7zjHmTm O que está acontecendo é que anoitece em Londres. http://t.co/UBTmKW99Uj RT @rede_globo: Com quase 29 milhões de votos, SAM ALVES é a nova voz do Brasil! Quem curtiu? ❤ !#TheVoiceBrasil Que um caminho bonito tenha sido aberto pro Sam e pros demais talentos revelados neste espetacular #TheVoiceBrasil Viva Renato Russo. #TheVoiceBrasil Simon &amp; Garfunkel, Elvis Presley...  O dueto de Daniel com Daniel emocionou. #TheVoiceBrasil Aniversário de São Paulo e da mulher do @TiagoLeifert em 25/01. E ainda tem cantores do #TheVoiceBrasil em Sampa? Sensacional! (2)\n#TheVoiceBrasil RT @DaniloDantts: @realwbonner Tenho certeza que sua torcida é pra Lucy, ou até o SAM, ou até o Pedro e quem sabe o Rubens, acertei? Caraca, @luizandreoli ! Não te vejo desde os tempos de praça Marechal! Hahaha! Abração! Sim, @zero2guardaWB , mas sem fanatismo. E em segredo. Manda outro pra ela, @zaza_bels Pra mim, o mais legal dessa final é que não tem risco de injustiça. Acho os 4 talentosíssimos. E a minha torcida é silenciosa. Sensacional! #TheVoiceBrasil \"Furo\" é quando um produto jornalístico revela com exclusividade um fato que os outros reproduzem em seguida. \nhttp://t.co/hvlIpDb4qY RT @folha_com: Administrador do Saint Peter é auxiliar de escritório no Panamá, diz 'Jornal Nacional'. http://t.co/dA4c0jqmEQ Inté, tropa.\nValeu.\nObrigado pela companhia! RT @rmary36: @realwbonner tá muito prosa com esse tal de HD. RT @fabianoduartep7: @realwbonner  Bonner, o tiozão interativo !!! Quem tiver perdido alguma reportagem do JN em HD (e a exuberância da gravata do tio) poderá sempre visitar http://t.co/ElKOTmcudk . Você já foi ao Panamá?\nO #JN foi. RT @JociBrito: @brunabarboza_ , observe @realwbonner interagindo com a galera do twitter, no horário do JN. Trabalho para nós, no TCC. haha… RT @heymissfanny: @realwbonner tio manda um beijo pra mim ai ao vivo no jornal RT @littleKrys: @realwbonner ta muito maneiro o JN em HD. Pedala que o globo ta parando. Daqui a pouco, a gravata do tio terá seu momento de glória em HD no #JN. Nunca, @eccendretti ! Nunca! O tio não tem disso! Incrível!\nFantástico!\nExtraordinário! http://t.co/D70nknkQnf #BlackFraudeBrasil  \nTUDO PELA METADE do triplo. Inté, tropa.\nObrigado pela companhia. Arena Corinthians abriu o JN, @TonFigueiredo Demos isso logo no primeiro bloco, @FERREIRAWAINER . @danestacom Foi no primeiro bloco. voltando em 20 segundos. Semana que vem, o tio vai aparecer mais velhinho ainda.\nO #JN vai começar a ser transmitido em HD. Voltando agora do intervalo. Boa noite, senhoras e senhores. E o Dr. Luís Eduardo Vaz Miranda, que cuidou dos nossos! Muito emocionante revê-lo. Hoje o #EncontrocomFatima me derrubou. Prematurinhos mexem muito, até hoje, com esse tio-pai. RT @g1: Fernanda Montenegro vence prêmio Emmy Internacional http://t.co/JnXCUEMD5f Putz! Meia-noite! Por favor, gente!\nSilêncio!\nOlha a hora! RT @fbbreal: Que gentileza do @WalcyrCarrasco. E q chique essa mistura de #EncontrocomFatima com #AmoràVida Boy magia? Obrigado, obrigado, obrigado!!!\n#cinquenTio Alô? Doutor?\nBom dia, doutor. Desculpe a hora. Mas é que eu acordei com uma sensação estranha. \nTipo... Como se eu tivesse uns 50 anos... Neste momento, o tio do pijamão listrado se concentra na gravidade das horas que antecedem o cumprimento de seu primeiro meio século de vida @TocaLulu SNIF SNIF SNIF... Clap clap clap clap clap clap clap!!! \"Apenas mais uma de amor\" é o maior hino da língua portuguesa ao amor platônico. #TheVoiceBrasil O tio chorou mais que o @TocaLulu   #TheVoiceBrasil Mas eu não subia naquilo ao vivo de jeito nenhum! O tio tem acrofobia. Queisso!!! HAHAHAHA!!! Tirem minha patroa daí! #Encontro Dia Mundial da Alimentação -- Ecobenefícios http://t.co/Ay39AlyV4e E... Sim!\nVocês são show. \nBoa noite. Que a noite lhe seja serena\nE as penas do dia pareçam pequenas. \nQue os sonhos lhe sejam amenos\nE anjos tranquilos lhe façam acenos. Aboboramento à vista. Horizontalizar o esqueleto se faz necessário, com simultânea distensão palpebral e supressão retinal de fótons. RT @larinhamaral: @realwbonner @wandynunes pópará em! O pijama do tio é um gramur!! Alô dona #Light!\n“@VivianneAF: @realwbonner \rNo Jd Guanabara na Ilha do Governador esta sem Luz e tenho avó acamada e utiliza aparelhos” “@wandynunes: Coitada da Fátima tendo que ver esta cena, você de pijama listrado. #tenhomedo”\nEngano seu. Meu pijamão é pura elegância. “@isabel_meyer: @realwbonner quero foto.” http://t.co/Dfkr1BnGm2 RT @Lublopes: @realwbonner TEM GENTE! SAIO JÁ.... Eu. O tio do pijamão listrado. Toc toc toc. Valeu, tropa.\nObrigado pela companhia.\nHora de o tio pegar o rumo da roça.\nInté. #JN voltando agora. A equipe #JN presta homenagem aos professores brasileiros. E agradece a todos. RT @erikadsant: @realwbonner tio twittando durante o JN. #gostei #JN RT @EdwardoFelipe: @realwbonner maravilhosa! chorei haha RT @gugazonta: \"@realwbonner: Parabéns pra Tia Emília. #tiaemilia #JN\" viva. Linda historia! @OPedroLemos :-) Parabéns pra Tia Emília.\n#tiaemilia\n#JN Alguém aí conhece quem tenha se aposentado pelo INSS recebendo o valor máximo? Professor é uma profissão que faz todas as profissões.\nO JN fala disso daqui a pouco. Começando o #JN em 5 segundos. Falta 1 minuto pra começar o #JN. O #JN começa dentro de 1 minuto e 45 segundos. O #JN começa dentro de 2 minutos e meio. O #JN começa dentro de 3 minutos e 15 segundos. Esse #TheVoiceBrasil é #Fantástico  \nSe bem que Fantástico é domingo. \n#seilá RT @BrasilTheVoice: Herli Dias aposta no pagode e consegue com que Carlinhos Brown aperte o botão. Gostaram? http://t.co/6irjqgTFPj Rá! Meus sogros no #Encontro ! Dessa nem eu sabia! Calma, seu Amâncio! Cuida dele, d Eunice! Parabéns, patroa @fbbreal ! Beijoooo! Foi só o olho esquerdo.\nO direito fica pra semana que vem. Gostei de trabalhar sem catarata nozóio. @EncontroFatima  Gostei! RT @robsontv: Plantão do tio @realwbonner hoje à tarde | Barack Obama anuncia que os EUA está pronto para atacar ...: http://t.co/vB4a8w3XO… RT @FCFataWill: Agora no blog: Resultado do Leilão das gravatas do William ( @realwbonner ) http://t.co/uYcZu1Gn1P por @zero2guardaWB RT @leolagecarneiro: @realwbonner participei leilão criança esperança, além contribuir bela campanha, usarei gravatas by Tio http://t.co/la… Tenho família, trabalho, saúde e alguns motivos de orgulho. Participar do #criancaesperanca é um.  Dividir esse orgulho com vocês é outro. Amanhã tem mutirão de colegas jornalistas, artistas e técnicos da @rede_globo pelo #criancaesperanca . Faremos com prazer. E o coração. A seriedade do #criancaesperanca a gente vê nos milhares de testemunhos  de legiões de brasileiros que têm experimentado seus benefícios. Sou paulista paulistano. Vim morar no Rio em 1989. E já naquele ano participei do #criancaesperanca pela primeira vez. Tem sido um orgulho. Amanhã é sábado e o tio que não costuma trabalhar aos sábados vai trabalhar. Porque amanhã tem o mutirão do #CriançaEsperança2013 “@eli_zia: @realwbonner @fbbreal @jntvglobobrasil foi show aqui no trabalho todo mundo adorou! kkkkk” Aqui na minha firma também! Taí. Gostei da novidade no #Encontro com a patroa @fbbreal . Também vou querer neve no encerramento do @JNTVGloboBrasil Que a noite lhe seja serena e as penas do dia pareçam pequenas.Que os sonhos lhe sejam amenos e anjos tranquilos lhe façam acenos.Boa noite. RT @Gabriella_WF: Como diz o @realwbonner ,tá na hora de horizontalizar o esqueleto! Tá, foi mal. Na boa. Eu nao como se pode rir litros. Litros de quê? Rir é verbo intransitivo, pô! Não sabem o que é ter nascido quando morreu JFK. Não sabem o que é ter a idade do Porsche 911. Riem porque não carregam meio século no coco. Riem porque não precisam comer pão de alpiste sem glúten. O metabolismo é show, não engordam como o tio velho e cansado. Também fui assim... Vocês não sabem o que é ver o Bom Dia Brasil na sala de espera do oftalmologista depois de já ter deixado filhos na escola. Por isso riem. Vocês riem porque não sabem o que é ficar velho, enxergar mal, trocar letras e tomar remédio pra controlar colesterol. Vocês não sabem. Putz. Pô! O #EncontrocomFátimaBernardes tem meu primo @HugoBonemer com a patroa @fbbreal . Devo buscar o trio na escola pra levar lá também? O JN começa daqui a pouco. E com o flagrante de uma situação dramática. Um cidadão tem um mal súbito. E cadê ambulância do SAMU? RT @ElisElis33: @realwbonner também fez questão de participar da campanha doando as cinco gravatas que ele usou para apresentar o #JN http:… A de ontem, azul, também tá na lista do #leilaocriancaesperanca . Assim como as que o tio vier a usar nas próximas 3 noites. O tio se despede, hoje, da gravata amarelo-Vaticano usada no JN, no sábado da J-M-J. Será doada ao #LeilãoCriançaEsperança Tipo essa, que fez sucesso no sabadãodiferéntchi da JMJ em que o tio trabalhou. Amarela Vaticano. http://t.co/cARDwA47l2 O tio vai doar ao #LeilãoCriançaEsperança as gravatas que usar nesta semana. Começando pela azul de hoje. RT @Crian_Esperanca: Já pensou em ter o vestido usado pela apresentadora Fátima Bernardes na estreia do @EncontroFatima? Confira: http://t.… Eu tava passando e lembrei que tinha que dar um recado. Oi. RT @CNJ_oficial: PAI PRESENTE: não é apenas na certidão de nascimento que o pai faz falta. Dê um RT e participe desta campanha! #PaiPresente “@CNJ_oficial: PAI PRESENTE: não é apenas na certidão de nascimento que o pai faz falta.  #PaiPresente” http://t.co/CnaG3nniam @zero2guardaWB Só uns 2 dias depois, quando ela ofereceu um dedo pro Vini sugar e estancar o choro, na incubadora. Tipo Princesa Diana. Aos que viram a patroa @fbbreal falar do parto do nosso trio e ficaram curiosos, digo que NÃO.  O tio não desmaiou e ainda fotografou. @Lucitita É a minha especialidade atual. @Lucitita 🐗🐗🐗🐗🐗🐗🐗 Boa sorte pra sua pessoa, @myh3ro “@JrStranieri: @realwbonner Phill Collins fez a música do Tarzan, tio!!! ^^” putz! Então é Tarzan. Rei Leão é Elton John. “@VinicCavalcanti: @realwbonner A festa não era do seu filho também?” Não. Ele não quis. Era delas. E ele dançou com as duas pra me ajudar. Na festa de 15 anos das minhas filhas, tocou uma música de Rei Leão, acho. Phill Collins. A batida é igual à do Pavão Misteryoso, do Ednardo #Saramandaia, a original, eu vi aos 13 anos. Essa releitura que o Ricardo Linhares faz de Dias Gomes é sensacional. Confissões de um #tiotiete \n#EntreTapasEBeijos é muito bom! http://t.co/ozGsmLPxqf Mas é isso. Passei só pra espiar. Agora eu vou ali horizontalizar o esqueleto e distender pálpebras sobre a íris.Qualquer hora o tio volta. “@sowhyAndy: @realwbonner grisalho, te sigo desde o tempo da receita de brigadeiro pra ganhar seguidores e tu nunca me deu um \"oi\". Oi “@ferkobaia: Lembro do dia que o Tio @realwbonner postou uma foto pra mim, pra provar q era ele mesmo. http://t.co/ysax5HNHHW &lt;3” HAHAHAHA! “@bseike: @realwbonner Receita do brigadeiro…” putz! Ganhou! Nada é mais antigo. RT @GERAfigueiroa: @realwbonner, eu ensinei o tio como dizer que \"cortou o cabelo\" em Inglês. Tenho, @Angel_lica   Postei em 2010. Merece, @JenniferAnielle . Verdade. @larinhamaral Isso! @sabrinalucke HAHAHAHAHA!!! RT @karlakogute: @realwbonner Tio, tava indo dormir, mas já que chegou, vou ficar mais um pouquinho, visita ilustre a gente trata bem! @lipstaylor oi. Tá. E quem lembra o dia que o tio contou piada de pivete na igreja de Minas? Opa, @flaviodepaiva ! Boa! Romário! “@arturzau: ainda lembro da brilhante análise do @realwbonner sobre os versos \"naldeanos\"” \nisso é recentíssimo! @kahluchesi Outro, então. Boa noite! @lucastardust Rá! Você é daquele tempo! Quem testemunhou alguma conversa delirante com o Doutor? “@yfeelings: @realwbonner EU” primeira a responder Quem seguia o tio desde os tempos de interativa diga EU. Isso de postar um tweet e receber centenas, milhares de respostas, é divertido e angustiante ao mesmo tempo. Não dá mais pra acompanhar. Pois é, @complexei , eu também sinto. Na verdade eu não pretendia vir, @laura_nicolli . Mas por algum motivo me bateu saudade dos velhos tempos em que eu me divertia aqui. Inté, procêis. A defesa do Victor valeu uma Libertadores. Putz. RT @Gabriella_WF: @realwbonner assistiu sangue bom hj? Tinha um marmanjo suspirando pela sua patroa hahaha http://t.co/jo7sxPu8Fq #EncontrocomFatimaBernardes de casa nova. RT @giseledosreis: Como diria @realwbonner .... Hora de horizontalizar o esqueleto! #boanoite Hoje o tio fez uns exames de vista e precisou ficar longe do trabalho. Segunda tô de volta. RT @fbbreal: Acabo de sair do prêmio Contigo com um troféu mas mãos. Muito obrigada a vcs que votaram em mim e me deram esse prêmio. #noite… 👏👏👏👏👏@fbbreal @EncontroFatima #maridotiete http://t.co/5WYy5yuFbE http://t.co/P1KILxVMBE Incêndio num ônibus sobre a ponte velha na lagoa da Barra. Primeiro de maio de dois mil e treze. \nhttp://t.co/OeLWDBVLlR\n#ayrtonsenna #ayrtonsenna \n1 de maio de 2013 http://t.co/fBnlCd4vXu #ayrtonsenna \n1 de maio de 2013 http://t.co/X1RejyfpZ1 #ayrtonsenna \n1 de maio de 2013 http://t.co/zP5KouP404 @SandroVaia @joaopaulom http://t.co/VtlGzdNY7t Aliás, o Heraldo tá comigo aqui porque a Patrícia está se recuperando de uma dor de garganta daquelas. Viram a patroa no JN? Participação especial. :-) RT @Michelifabiani: @realwbonner Muito importante essa reportagem sobre autismo,de muito bom gosto e importancia. RT @larinhamaral: @realwbonner  Que linda essa reportagem sobre Autismo!! &lt;3 RT @crisrpaiva27: Matéria brilhante sobre o autismo @realwbonner !!! :-)   http://t.co/pAondTy3xT “@evandroslira: @realwbonner Quando que vai passar esse show?” Hoje à noite. E hoje à noite a @rede_globo vai passar o show #Vemaí . Muito bom! No aeroporto Santos Dumont, Rio, o agente da Polícia Federal pra mim: \"O quê que vai acontecer em SP? Nunca vi tanto artista viajando!\" Aliás, andar no elevador do hotel em que estávamos todos era até engraçado. A cada parada, um artista. E o tio procurando câmera escondida. Sensacional o show do #Vemaí. Só que era tanto artista, mas tanto, que o #tiotiete desistiu de atacar com sua câmera. Vem aí... http://t.co/NmlWF5FW2C Boa semana pra sobrinhada toda. http://t.co/Q5KUvLQAPz Esperando a hora. Fazendo hora. RT @DanieladeVilla: @realwbonner acabei de ver a @fbbreal fazendo plim plim e lembrei de vc! Realmente eh bem fofo!!! ;) Depois de uma análise isenta e criteriosa, concluo: o \"Plim-Plim\"da patroa @fbbreal é o mais fofo. #prontofalei RT @insideofana: ME LEVA PRA TOMAR SORVETE @realwbonner RT @larinhamaral: @realwbonner tuitando durante o JN é massa!! Tava sentindo falta disso! O tio tá aqui, @JessikaWF O #tiotiete e a @ladygross numa tarde dessas na redação. http://t.co/KNGOXYs1d2 Bom dia, bom dia. \nSó eu que acordo a essa hora pra levar adolescentes pra escola? Visita ilustríssima. #tiotiete http://t.co/2aBfBKgD4f RT @JenniferAnielle: O primo do @realwbonner no BBB ! :D Olha o primo aí no BBB. @HugoBonemer no #RockInRioOMusical http://t.co/OaYcLlMdr0 Rá!\nMeu primo @HugoBonemer no BBB! #RockInRioOMusical Porção de 25 gramas, 129 calorias. \nSe a barra tem 130 g, são mais de 650 kcal. Isso vale 10km de corrida na esteira. #chocólatraarrependido Rá! Uma tietagem que faltou ontem no Faustão. Acabei de encontrar na porta do prédio do jornalismo, no… http://t.co/gHRkzEMpMM Agradeço aos colegas que me puseram na final do prêmio. E agradeço a quem votou no tio. Teve quem virasse madrugada. Um carinho enorme. O #MelhoresdoAno é decidido pelo público entre os finalistas eleitos pelos colegas funcionários da Globo e das emissoras afiliadas à rede. É que os artistas trabalham em Jacarepaguá e os jornalistas no Jardim Botânico. Quando o tio tem a chance de estar com eles... #tiotiete Ainda tem gente me seguindo depois dessa flodada fotográfica? #tiotiete http://t.co/D7gAvAU2dx #tiotiete http://t.co/UaapiJ1cZc #tiotiete http://t.co/ExRj663TIa #tiotiete http://t.co/z8ayrxxxsH Vódca oáguadi councum...\n#hahahahaha http://t.co/HcaOixikhZ #tiotiete http://t.co/kBc8VOofud #tiotiete http://t.co/Y7hw52yVjz #tiotiete http://t.co/l0MqLPy1ua #tiotiete http://t.co/Fg3sQrksds #tiotiete http://t.co/CIwnrmcvUM #tiotiete http://t.co/enfIsQTljV #tiotiete http://t.co/PfskfuN8cf #tiotiete http://t.co/OFjVTyUTCI #tiotiete http://t.co/AAGxRk2ggE #tiotiete http://t.co/LshjuXUxM5 #tiotiete http://t.co/To1xhA3tDc #tiotiete http://t.co/GZtogJRjUI #tiotiete http://t.co/ynIHde0HDN #tiotiete http://t.co/ZBuos6XzZy #tiotiete http://t.co/S3uQ6nOjeu #hahahahaha!!! http://t.co/Cg7FILzXMQ #tiotiete http://t.co/eHbix1QFzF #tiotiete http://t.co/uO63SnXqkd RT @Portal_TVG: @realwbonner tá super animado com a festa do #MelhoresdoAno!!! Fique ligado! #Faustão http://t.co/4RwgGXt66K RT @omarcosveras: Olha quem foi prestigiar o Atreva-se e o Falando a Veras hoje.  Obrigado @fbbreal @realwbonner @olalair http://t.co/QM ... RT @fbbreal: Quem não viu, tem que ver o @omarcosveras e @ajuliarabelo na peça Atreva-se. Demais! Estreia de documentário com Yoani é suspensa após protestos na Bahia http://t.co/jsNoCcKJ #G1 RT @yoanisanchez: #Cuba Como si alguien les hubiese distribuido a esos \"enérgicos\" del grito el mismo dossier en mi contra... que casual ... RT @yoanisanchez: #Cuba Imagínense que la contraparte en el debate todos tenían en el mismo material, impreso misma forma, con los mismo ... RT @yoanisanchez: #Cuba Esta noche participe en un debate que yo catalogo de \"gritos contra argumentos\" de \"consignas contra ideas\"... y ... Voltando. Sim. É chegada a hora. Horizontalização esqueletal carnavalesca. http://t.co/S7E8UJuB RT @fbbreal: “@TocaLulu: Hj no ar o Principe Pretinho da Serrinha e seu sensacional Trio Preto + 1.” Eles são feras mesmo. RT @fbbreal: Muito obrigada, @TocaLulu. Comecei bem meu carnaval com seu elogio. As portas do @encontro estão abertas pra vc. Vai ser um ... Bom Carnaval, sobrinhos. E juízo! http://t.co/jyfrOIJc Valeu, tropa.\nJuízo, no Carnaval. Voltando. Acho que eu nunca disse essa palavra, \"tadinha\", num telejornal... Mas eu também acho que a situação mereceu, no fim das contas. Tadinha! Eu falei isso? Eu falei \"tadinha da Elaine Bast\"??? Tá, eu também fiquei aflito por causa daquela neve toda. Mas eu disse isso? É como eu sempre digo: boa noite. “@GabrielaMarins6: @realwbonner não perder o que mesmo ?”\n\nO seu tempo. Ele é precioso e vocês vão perceber quando tiverem minha idade. E não percam, amanhã! E nisso vai dar meia-noite, horário limite do aboboramento deste tio velho e cansado. É chegado o momento da horizontalização esqueletal. “@megalomatheus: @realwbonner vc gosta de Elvis ?”\nSuspicious Minds toca direto numa das\nminhas playlists favoritas. “@TwittaproLash_: @realwbonner tu curte um Red Hot?”\nDe muitas coisas, sim. Stadium Arcadium é um álbum que acho muito muito bom. “@laura_nicolli: Tio @realwbonner a musica do momento para você é? ....”\nPutz! Dave Mathews, Ingrid Michaelson, Skank, Moby, Pedro Luís... Os comentários no Instagram viraram guerra verbal entre fãs e inimigos da banda. As pessoas quase pegaram em armas! Hahaha!!! Por música! Falar de música aqui pode ser explosivo. Outro dia eu postei a capa do álbum de uma banda que amigos do meu filho tocaram na escola. Putz! Sério. A letra desse negócio é inacreditável. Mas eu gosto da música. Talvez em coreano fosse um hit planetário. Também aprecio a riqueza dos versos naldianos: \"Alto, em cima, alto, em cima, alto, em cima, alto em cima! Em cima! Em cima! Em cima!\" “@DiegoUtzig: @realwbonner Até Naldo? rsrsrs”\nSim! Hahahaha! Quando eu deixo o computador executando minhas músicas aleatoriamente chega a ser engraçado. Tem de tudo. Eu costumo ouvir música quase o tempo todo. Mesmo na minha microssala, na TV, quem entra sempre acaba escutando alguma, de qualquer estilo. Rá! Nesse mundão aqui tem muito mais admirador de Renato Teixeira do que supõe nossa vã filosofia. RT @Ma_Marino: @realwbonner Sinto o coração flechado\nCercado de solidão\nPenso que deve ser doce\nA fruta do coração\nhttp://t.co/AIRbaOrQ! “@fhanogueira: @realwbonner e tem a das massas e das maçãs tb.”\nIsso é maravilhoso mesmo. Mas, como  Romaria, outra que considero uma obra-prima do Renato Teixeira é \"Amora\". Quem não conhece fará bem em procurar a gravação. Renato Teixeira é autor de algumas das canções mais doces que conheci. Esses versos são de \"irmãos da Lua\". Tem também \"Romaria\"... \"E a calma é irmã do simples. E o simples resolve tudo.\"\nRenato Teixeira \"E o homem possui a fala - e a fala edifica o canto. No canto repousa a alma - e da alma depende a calma.\" No mais, é o que eu sempre digo:\nboa noite. A cabeça. RT @CandinhoOficial: @realwbonner Não perder o q, tio? Não percam, amanhã! Ótimo. Ninguém tem problema nenhum. Posso dormir sossegado. Pois é. \nAlgum problema? Ema, ema, ema... O tio alinhará o corpanzil com o horizonte, nuca e calcanhares equidistantes do solo, sola do pé e couro cabeludo a distancia máxima. RT @RodrigoMarian: @realwbonner O senhor primeiro fecha os olhos pra DEPOIS se deitar? Nunca sofreu um acidente assim, não? Errar a cama ... O tio vai distender as gorduras palpebrais sobre a íris, suprimir de fótons as retinas e horizontalizar o esqueleto velho e alquebrado. “@Fred_paiva: @realwbonner vê se ela combina com a cor da gravata.”\nSó mais essa. Testes encerrados. RT @iriamarco: @realwbonner tira uma foto antes pra postar no twitter... RT @elitsuda_: @realwbonner para ela no ar com o olhar RT @lebolita: @realwbonner deu um triplo mortal carpado Teste número 2:\nAo ver que uma bigorna caía do teto do estúdio exatamente na direção de seu lugar na bancada, o tio imediatamente... Os sobrinhos têm fixação em botar o dedo no nariz. A maioria completou o teste com esse desfecho. Eca! Aí o tio chegou, olhou em volta e, como não tinha ninguém olhando... RT @kellima83: @realwbonner o/ =&gt; eu, achando q sou anjo e acenando. Que a noite lhes seja serena - e as penas do dia pareçam pequenas.\nQue os sonhos lhes sejam amenos - e anjos tranquilos lhes façam acenos. Horizontalização esqueletal urgente. @amandabarbara Mande DM. @amandabarbara Quinta agora? Ou semana que vem? @amandabarbara Marque com calma, então. Quinta. @amandabarbara Quando? Amanhã? @amandabarbara Quando? RT @mania__: Yuri ou Marcello, tio?! Qual a porcentagem? :P RT @realwbonner: Ok. Encerrados os votos. Ok. Encerrados os votos. RT @gabrielgaspar_: @realwbonner coloca água pra esquentar e coloca ela dentro, segundo minha vó é bom RT @lenyza: @realwbonner detergente/ talco+ferro de passar RT @Bueno_Thiago: Esse cara é GAY! @realwbonner RT @taniaregina15: @realwbonner .troca por uma lilas.kkkkkk RT @kidamaia: @realwbonner vai nao....passa veja, akele normal de cozinha. Borrifica com um pano branco e limpo...e pronto. :) RT @marina7sigolo: @realwbonner Joga um pouco de talco que não estraga u.u RT @tathip: @realwbonner Paaara com isso, tio. Vanish + água morninha e a camisa tá novinha em folha. RT @lari_ssacosta: @realwbonner detergente, tio Receitas pra tirar mancha de azeite de camisa azul de apresentar JN em 5...4...3...2... Olho gordo na minha camisa azul. Espirrei duas gotas de azeite da minha salada. Vou perder a camisa. Olho gordo... Shshshsh!!! Silêncio! Ela tá dormindo! Vou tirar uma foto! Minha camisa vai virar TT? Foi um prazer, @Manuccouto . Que as centenas de pais e irmãos da tragédia de Sta. Maria encontrem forças nas manifestações de solidariedade que surgem em toda parte. Hoje o #EvaristoCosta  apresenta o #JN pela primeira vez. E é muito bem-vindo ao time. :-) “@Deyselind: @realwbonner  Bonner  a @JulianaBerchan  tava te procurando, hj  vc ñ apareceu no jornal Naciona, Dá um oi pra ela?”\nCof! Cof! “@marcel1982: @realwbonner Tem um 'cif' se intrometendo na sua tosse.”\nToda sequencia longa de cofs é entremeada por um cif. Cof cof cof! http://t.co/nhOGPxZv Cof cof cof cof cof!!!\nCof!\nCof!\nCof cif cof!!! É. O vírus venceu a batalha da sexta-feira. Garganta em chamas. Fora de combate Boa noite, tropa. É verdade, @_AdilaAquino . Só tava dando uma espiada. O tio vai horizontalizar esqueleto agora. Si, @vapis , obrigado. Sim, @sugargon . É como o tio Visconde sempre diz: o trabalho enobrece. Sim. O tio tá gripado. Aquicubigo só tei aquele isprei que atira o jato de soro darizadeitro até o cérebro. Bais dão resolveu. É, @gilbertoleda , bazabaguiã cedo eu pego estrada... Doite errada pratê issôdia por causa didariz itupido, poxa. RT @isaiasaugusto: @realwbonner hahahaha boa noite sincronizado com o #JN. Aí sim! Boa noite! RT @SeniorCharles: Nossa tio, que gata heim... Eu pegava!! RT @realwbonner: A gata se encantou comigo. Não desgruda! http://t.co/Jm3rRQEX A gata se encantou comigo. Não desgruda! http://t.co/JQTVQEac Agora o tio vai pedir licença pra horizontalizar o esqueleto. Melhor dormir antes de a fome chegar.\nBoa noite. “@thallis_viana: @realwbonner  qual é o twitter oficial da fatimas bernades?”\nÉ o @fbbreal . Agora com avatar novo, muito mais bonito. :-) “@RenatoGarcia: @realwbonner Exigência da empresa manter o peso? rs”\nNão. Exigência financeira. Preciso caber nos ternos! Kkkkkkkk “@AparecidaSarah: @realwbonner vamo ver c tá gordinho msm nessa quinta hehehe” \nNão vão não! Vou perder os excessos antes! Muahahaha! Ok, respostas às perguntas mais comuns:\n1 Volto ao JN quinta-feira;\n2 @biabonemer está muito melhor;\n3 Estou em dieta pós-abusos-de-férias. @sueniafernandes @victoriarezend1 Não é assim que funciona. A perda vai diminuindo a cada dia. Mas se fechar a conta em 2kg tá ótimo. @victoriarezend1 Um pouquinho. 1,2 kg nas primeiras 24h... @barbosajeh Calma! Quinta-feira. @Gabriella_WF Até que enfim! 13 segundos para meditação.  http://t.co/TqTfT8A6 Passei pra dar um alô. \nJuízo. Vocês vão bem, né?\nO tio também. \nDe férias e tirando foto. #TioTiete http://t.co/qSWAZE5r http://t.co/h0tq3ciX http://t.co/FPcjAvwa Ah, sim!\nO tio andou trabalhando direto e só agora, em tempo, traz os votos de um Feliz Natal. \"O trabalho enobrece.\"\nVisconde RealWBonner http://t.co/aVPNl6WP Presente provocativo para um chocólatra assumido. http://t.co/2GSlqnxF Acabou nada! http://t.co/3u0VBHdV Muahahahahaha!!! Inté, tropa. Valeu a companhia. Viram a foto do tio em estilo bicho-grilo, anos 80, no blog do Marcelo Rubens Paiva? Não mudei praticamente nada, né? RT @biankajones: meu pai dizendo aqui que a gravata do tio @realwbonner é bonita! haha... onde será que ele comprou? a circulação de notas falsificadas aumenta no Natal. 5 minutos. Faltam 6 minutos pra começar o @JNTVGloboBrasil O tio vai horizontalizar o esqueleto. Inté, tropa. O @RealBarone é a modéstia personificada. Monstro! Criançada chegou. Eu e o filhote revendo showzaço dos Paralamas. Alô @RealBarone ! Vocês são aliens. Não adianta tentar esconder. @phecruz sim. @Kel_Paulista Sério? (null) http://t.co/kfxG3YHg (null) http://t.co/utKX3NUQ Amanhã o tio pega estrada pra ver os pais. Precisa dormir cedo. Mas cadê o sono? @Monicassilveira Como vai, doutora? Boa noite. http://t.co/VG3TWhFg http://t.co/Rdc9aAO6 @RealBarone Abração! Voltei pra casa ouvindo a tua bateria, num engarrafamento mega. Coincidência doida a gente se falar hoje por aqui. “@RealBarone: @realwbonner waak saiu de ferias ontem! Kkkkk!!! 12/12//12 Live in NY ta melhor de ver...”\nBate lata aí, João! Alô Cris, alô xará! Corram que o JG vai começar mais cedo! Muahahahahaha!!! É campeão! Ééé... Falei, não falei? Leitura labial... Vai dar mais 5 minutos. Leitura labial. “@DirceuJuniorFla: @realwbonner os argentinos estão tão mal, mas tão mal, que nem confusão eles arrumam mais direito....\" Vai lá, seu juiz! Bota ordem nesse negócio! Faz de conta que o nariz do Lucas jorrou molho de tomate. Mas vai! Eu tenho amigos argentinos. São gente boa à toda prova. Mas nenhum joga futebol. Ao Marcos, o abraço respeitoso deste não-palmeirense. E outro, agradecido, deste torcedor fanático da Seleção Brasileira. Grande atleta. Avante! Acabou que escolheram a verde. Nem a alvinegra nem a tricolor. Homanagem ao Marcos... Viram, né?\nRespeitando o voto da sobrinhada na #InterativaDoTio . Gravata número 2. A votação da #InterativaDoTio foi encerrada.\nResultado no @JNTVGloboBrasil . Ou a qualquer momento em edição extraordinária. Muahahaha! Camisa rosa, paletó preto. De cima pra baixo, gravatas 1,2 e 3.\nPeça pelo número. Valendo a #InterativaDoTio . http://t.co/UrsylkWr OK. Os sobrinhos escolhem a gravata na #InterativaDoTio . A foto das 3 candidatas já já. RT @taty_rodrigues2: @realwbonner sim, escolha das gravatas Alguém ainda lembra o que era uma #InterativaDoTio ? Ataque de nostalgia. RT @FatimaGBB: @realwbonner Vixi, ontem a @JessicaFerLbo deu um puxão de orelha no tio, hoje quem vai levar um do tio é a Bia, rs. Tadin ... @biabonemer Falta de juízo! Sexta-feira...\nE o tio aqui. Ligado. De olho. Sempre. O tio tá aqui. De olho. Sempre alerta. RT @patischmidt: @realwbonner Frase da semana: \"É melhor você salvar do que ser salvo\". Diga não à violência. Quando alguém te provocar, #conteate10 que a raiva passa. #whitefriday 1, 2, 3, 4, 5, 6, 7, 8, 9, 10.\nUfa. Tem gente com relógio adiantado. “@andressapb1: @realwbonner  Avisamos sim claro”\n\nObrigado. Aí eu explico. \nPor enquanto, 1, 2, 3, 4, 5... Quando forem 15h, horário brasileiro de verão, vocês me avisam, por favor? Negativo. \nDe novo. \n1, 2, 3, 4, 5... 1, 2, 3, 4, 5, 6 Horizontalizando o esqueleto e suprimindo de fótons as retinas, despede-se este tio velhinho e cansado. Boa noite. 🚙🚘🚗🚕🚖🚗🚙🚕🚗🚙🚖🚕🚖🚘🚕🚗🚙🚗🚙🚙🚗🚕🚖🚘🚙🚕🚗🚖 @arielcristinab 😕 Sério! Nada a ver postar foto de coleção, né? Ainda mais uma assim, que nem a minha. RT @suboatto: @realwbonner Cadê o pijamão listrado, tioooo??? “@debo_rodrigues: @realwbonner  queremos ver sim!!! O que coleciona?? Gravatas?”\nImagine! Coisa mais sem graça! “@JessicaFerLbo: @realwbonner SINTA O MEU ENORME PUXÃO DE ORELHA SENHOR BONNER!!”\nAaaaaaaaaaaaaaaaaau! A não ser da minha coleção, que não interessa a ninguém. Putz... Não dá pra publicar nada. O tio cai caçar algumas fotos inéditas aqui no celular. Peraí. Atendendo a pedidos, @fbbreal em seu sono reparador. \nLinda, como sempre. http://t.co/HGw5CT8L “@__Jeesika: Sonho : @realwbonner postar uma foto da @fbbreal dormindo. *--*”\n\nÉ pra já! RT @larinhamaral: @Naandrarayane @realwbonner Gente o nariz novo é o meu, não o do tio!! RT @ReginaRassilan: @realwbonner Eu conto uma novidade sobre a tia. Hj meu tweet foi exibido no Encontro com Fátima. Quase morri de emoç ... RT @samara7days: \"@realwbonner: Ninguém conta uma novidade aí?\" &lt;= Eu tô grávida! :D @FabiiiolaB ☺ “@larinhamaral: @realwbonner tenho uma novidade sim!! tô de nariz novo! kkk”\n😧 RT @majurol: @realwbonner NOVIDADE? LUIZ FABIANO FOI EXPULSO KKKKK RT @karin_arndt: “@realwbonner: Ninguém conta uma novidade aí?” Caiu uma arvore atras da minha casa http://t.co/1Kr6OMCC “@_andressacamara: @realwbonner @fbbreal Ela já tá dormindo? :/ rsrsr”\nPelos meus cálculos, há meia hora. Ninguém conta uma novidade aí? Shshshsh! Sem barulho, por favor. A @fbbreal acorda cedo. Chegando. @tiasandrinha Cuida desse pé aí! Bj. RT @gvizane: @ericoaires @tiasandrinha @realwbonner #beatriz tá comigo agora é lindo para ela. Ela manda agradecer. RT @rvizentin: @realwbonner será que a princesa foi atendida pelo sistema único de saúde? Ééé... RT @tiagosilvaprass: @realwbonner Esqueceu o Décio Pignatari... Brubeck e Niemeyer num intervalo de horas...\nNão me parece que o mundo esteja em condições de perder o brilho de gênios nesse ritmo. Alô? Doutor? Desculpe ligar a essa hora, doutor. Mas é que bateu  insegurança. O senhor acha que o meu caso é pior que o do Luís Fabiano? Caro @victorsarro , ainda deu tempo de  desejar um feliz aniversário, né? RT @JNTVGloboBrasil: Fraudes na internet fazem 18 vítimas por segundo no mundo inteiro. Veja logo mais, no #JN. tec tec tec tec http://t.co/M96tkyX6 @mauro_beting Mande um abraço ao GF e à sua mãe. Outro pra você. Tenho carinho enorme pelo casal com quem convivi na Globo SP por 3 anos. Lucila Beting, nossa colega na redação da Globo SP 25 anos atrás, quase me dobrou. Meu abraço com saudade. RT @PatriciaKogut: Gente, meu novo site está no ar. Convido todos para uma vista (de preferência demorada) http://t.co/NukM6H3j RT @victorsarro: Estão podando as arvores do meu prédio desde as 8 da manha, parece que o Jason esta no meu quarto. RT @EncontroFatima: Escolha uma das músicas da enquete e dedique a sua preferida para alguém! Seu recado pode ser lido e passar na TV. h ... RT @RealBarone: @realwbonner  Joelmir Beting por décadas alertava para o Brasil dar certo,inteligente, irônico e simples. Deixou um lega ... Era apaixonado pela família e pela profissão, devoto do Palmeiras e do Galaxie. Em defesa destes, fazia rir. Falando daqueles, emocionava. Uma honra imensa ter sido, um dia, colega de redação de um sujeito talentoso, divertido, decente e querido como o jornalista #JoelmirBeting RT @_AdilaAquino: Tio @realwbonner conte-me mais sobre ver a sua patroa LINDA divulgando em 1ª mão que Fellipão é o novo técnico na Seleção? @hellogih @larinhamaral Ficou bonito na minha salinha. Obrigado. http://t.co/mqNKBa62 Tirei até foto, @larinhamaral .Vou postar depois. Obrigado! Voltando já já. Peraí. Muito, muito #Massa essa emoção do Felipe no pódio! http://t.co/oEK4UdZV RT @victorsarro: Ultimo comediante no palco! Hj to de mestre de cerimonia , obrigado quem veio, teatro lotado! Daqui a pouco acaba! viva ... RT @fbbreal: “@victorsarro: Eiii @realwbonner e @fbbreal , a @laurabonemer existe hahahahahhaha http://t.co/C1PlmrJR”existe mesmo há 15  ... “@Fer_Castor: @realwbonner não acredito que eu sigo o próprio bonner e não sabia.. eu achando q era fake rapaz”\n hahahahahaha!!! @victorsarro Bom show! Passou. Sabe aquela vontade de comer brigadeiro? A patroa @fbbreal tem um #Encontro com o @brega_falcao daqui a uma hora eu tenho que ficar tranquilo... http://t.co/D0GmnyjI Bom dia, madrugadores. Apesar de ser quinta, claro. Dia de quinta, como sabemos. Bom trabalho, @ozielgomes . Tenho ótimas recordações de meus tempos nessa atividade. Ok, vamos. Acordem! Elogios pro meu paletó...\n:-)\n#TioSeAchando O tio agradece, de coração. 🎂\nBeijos, abraços, apertos de mão. RT @ZehdeAbreu: @realwbonner Hihihi! Hi hi hi hi hi hi hi!!! Só mais uma coisinha! Por favorzinho! É que quando eu leio ia risada do tipo \" hi hi hi hi\" no twitter, é impossível não me lembrar do Nilo... Preciso dizer só mais uma coisa antes de sair daqui. RT @amandamarques_s: @realwbonner  Já tô vendo a tia: William eu vou contar até 3 pra vc sair do tweeter e vir dormir. 1...2...2 e meio... Putz. RT @DuduGraffite: @realwbonner Fecha pra mim aí Bonner!!! Foram 2 pastéis e uma garapa!!! RT @larinhamaral: @realwbonner Pô tio, eu sou lerda pra digitar!  #Mimimi :( ;-) RT @AninhaGabiih: @realwbonner Q a noite lhes seja serena e as penas do dia pareçam pqenas. Q os sonhos lhes sejam amenos e anjos tranqu ... “@lili_oliveria: @realwbonner Que a noite lhes seja serena - e as penas do dia pareçam pequenas.”\nO que mais? O tio tá velhinho e com preguiça de escrever aqueles versinhos de despedida. O primeiro que postar terá minha gratidão e será retuitado. “@MatteusPonttes: @realwbonner Espirrei e vou ficar doente, eu sei que sou meio demente mas o aparelho não ta afastando meu dente.”\n?????? Exaustão existencial ascendente. Apagão cerebral evidente. Oclusão ocular iminente. Horizontalização esqueletal urgente. Este medicamento é contraindicado em caso de suspeita de dengue. A persistirem os sintomas, um médico deverá ser consultado. \"Doutor, me desculpe incomodar a essa hora, mas é que eu esqueci o nome do remédio que o senhor me receitou pra melhorar a memória.\" “@daltix: @realwbonner @tonafolga \"passinho pra trás, passinho pra trás, que todo mundo tem seus compromissos!\"” @ari_aneee :-) RT “@tonafolga: Um passinho mais pro fundo por favor\" É aqui que eu desço.\nBoa noite! Chuvinha chata, né? O dia inteiro isso... Quinto, por favor.\nObrigado. Olá, boa noite. Sapateado no @EncontroFatima ???\nHahahaha!!! Já sei como isso vai acabar... #tTapTapTap RT @fbbreal: Parabéns aos meus amigos e parceiros do @EncontroFatima. E obrigada a todos que dividem suas manhãs com a gente. RT @fbbreal: Seis meses depois,  http://t.co/qZC9RhAe via @UOLEntrete #UOL RT @g1: Morre o ator e diretor Marcos Paulo http://t.co/2CKZ8DYi Bom que estávamos lá pra ver uma atuação tão especial pra você, @victorsarro . E melhor ainda ter conhecido a família. Abração. Show, @victorsarro . Muito bom! Parabéns! Fuso horário. RT @marciotorva: @realwbonner Quem deu o Oi Oi Oi primeiro? Encontro casual depois do jantar num shopping. http://t.co/Xgay0Q51 Bristow, Virgínia, EUA,  sábado, 3 de novembro de 2012, 22:50h http://t.co/l2ikBBGp A gente nota que chegou quando se livra da Linha Vermelha e fica engarrafado na Linha Amarela... @mariawerneth Era o que fica em frente ao Hay Adams Hotel, do outro lado da rua. A gente percebe que chegou quando se vê engarrafado na Linha Vermelha... WAS-SPO-RIO\nÚltima etapa. http://t.co/5KHXIzdE @vanessa_aires Mande um abraço carinhoso daqui de Washington pra ela! http://t.co/iZIRfVt6 Que a noite lhes seja serena - e as penas do dia pareçam pequenas.\nQue os sonhos lhes sejam amenos - e anjos tranquilos lhes façam acenos. RT @maxferreira: @realwbonner Fica, vai ter bolo... Amanhã voo de volta pra casa. Saudade. RT @Willian_Alexes: @realwbonner o tal \"sobretudo\" é usado somente em ocasiões históricas.. O \"sobretudo\" daqui uns anos é o capitulo do ... “@TamiresP: @realwbonner Então você estava trajando esse sobretudo quando pegou carona com as freiras em meio à multidão? :)”  EXATAMENTE!!! RT @_Jeh_Cristina: @realwbonner Nosso tricolor deu show hoje !!! #SPFC 5x0 La U !! :) Desculpe, @_AdilaAquino ! O tio não viu! RT @PedroMalta_: @realwbonner NÓ! Me deu vontade de espirrar daqui. RT @larifreeitas: @realwbonner Simplesmente lindooo, tio!! *-* hahahahaha “@gabriellaolvr: @realwbonner Estava lindão, tio! Muito elegante. :)”   \n:-)  São seus olhos... Que elogio espontâneo! E vocês também! Nem pra elogiar o meu sobretudo que não saía do armário desde que eu voltei do Vaticano, em 2005... Pô...\nQué vê que vai nevar quando o tio estiver roncando? Todo encasacado na rua - e nada... Dizem que vai nevar aqui em Washington bem na hora do JN. \nNão demonstrarei nenhuma emoção. #ObjetividadeJornalística “@DoeUmLivroBR:  #DoeUmLivroBR http://t.co/xf70fyNw http://t.co/IQ81wHUT RT @davematthewsbnd: Join Pres Barack Obama &amp; Pres Bill Clinton in Bristow, VA on Saturday and enjoy a special acoustic performance  ... \"Eu vou, eu vou, ver Obama agoreuvou!\nParará-timbum parará-timbum eu vou eu vou eu vou...\"\nVisconde RealWBonner num sábado de trabalho. Ainda engarrafado. E um pouco mais febril. Engarrafado. E febril. http://t.co/6J3ZopYA RT @transitoRJO: RT @thamires_correa @julienefrez Na altura da Av.Ayrton Senna,proximo ao Gardenia,alem da Barra inteira parada,ate o Re ... RT @transitoRJO: Caminhao atropela ciclista e consgestiona transito na Barra. Longo congestionamento na via tem reflexos ate a Av das Am ... RT @transitoRJO: RT @OperacoesRio Atencao motoristas! Neste momento, as retencoes por conta de acidente na A Senna, chegam a altura da L ... As imagens de NYC me lembraram o tanto que se falou nos Maias. E temos 61 dias pela proa. “@_jucampelo_: E se estava assim mesmo, eles já editaram  http://t.co/1UpXFr7m”\nArmadilhas da profissão...\nMas pode ter sido  montagem. “@EncontroFatima: No Encontro de hoje, polêmica entre vizinhos. Vote na enquete e dê sua opinião: http://t.co/gfG6fDuB” “@MauroWainstock: Enquanto isto, em Portugal...\n (\"Jornal de notícias\"). http://t.co/OPSilCqK” Inté, tropa. Valeu a companhia. O tio vai descansar. A idade, a idade... tsc tsc tsc RT @JenniferAnielle: Quando eu arrumar um emprego sera que meu chefe vai deixar eu trabalhar e twittar ao mesmo tempo igual ao @realwbon ... Vocês viram que o tio tá velhinho, né? Quem entrou ao vivo foi o Hélter Duarte, em NYC. Até porque o Bocardi está em Nova Jersey. RT @filipedesouza: Adoro quando o @realwbonner apresenta o JN e twitta ao mesmo tempo haha RT @larinhamaral: @realwbonner  a cobertura sobre o furacão sandy ta espetacular! Parabéns equipe #JN Bocardi ao vivo de NYC. Já já. Vai começar em 25 segundos. O #JN de hoje tem a vinheta mais longa. Fazia tempo que a gente não usava. Eba! Vou trabalhar. Tava aqui pensando no que fazer agora de manhã depois de ter trabalhado no FDS. E decidi. \"O trabalho enobrece.\"\nVisconde RealWBonner RT @rede_globo: Que tal comprar o vestido usado pela Fátima Bernardes na abertura do \"Encontro\"? Você pode! Saiba aqui:  http://t.co/1Ip ... @zero2guardaWB tem geeeente... Leva um tempo pra atualizar quando se edita o perfil no celular. Obrigado. Putz. Não tenho mais no celular a foto original descongelada do meu avatar. Quem tem? Errado, @solange_sol89 . Aposentei o pijamão listrado. “@emy_lene2012: Olha aí,@realwbonner http://t.co/R71M8ame”\nVapt vupt. 15 anos. Hahahahahaha!!! E os comentários técnicos e filosóficos sobre #OiOiOiFinal ? RT @rede_globo: Como você está assistindo #AvenidaBrasil? Com os amigos? Com a família? Com o seu amor? Mande a sua foto! #OiOiOiFinal 3 palavras pra vocês. \nOi oi oi. Eu tirei 3 dias de licença pra dar um apoio lá em SP pra minha mãe, que precisava fazer uns exames. Por isso sumi da TV desde quarta. “@Raphaelertola: @realwbonner Por que vc não está na ponte aérea?” Porque não tenho paciência pra fila, atraso, barrinha de cereal. “@mhacarvalho: @realwbonner cooorre, tio! vai perder a novela!” Nada! Tô em casa vendo JN. 7 horas de carro entre SP e RJ. Trânsito nojento. RT @lunaS2alguem: @realwbonner pf! Dê rt nesse tweet pra sala @SabidosITB a gincana #webvibe3 realizada no itb Maria Sylvia dia 20/10? É ... RT @NayRoodrigues: @realwbonner  pf! Dê rt nesse tweet pra sala @INI2C vencer a gincana #webvibe3 realizada no itb Maria Sylvia dia 20/1 ... O tio vai horizontalizar o esqueleto e esticar as pálpebras. Boa noite. @astridfontenell Riponga que ama Chanel!!! Hahahahaha!!! Beijo, madame. E sobre o Neymar: um talento enorme e uma disposição inesgotável. O moleque sempre se apresenta, tenta, se esforça. Acho sensacional. Eu conto isso pra que os sobrinhos valorizem cada segundo da sua juventude. Porque esse gás todo, como o que o Neymar tem, um dia acaba. Eu dormia das 2 às 6:30 da manhã. Não tinha cabelo branco. E era magro. Na idade do Neymar, no século passado, eu tinha aula na USP de manhã, rádio USP à tarde, aula no SENAC à noite e TV Band na madruga. Sério que o Neymar tá jogando de novo? E marcando gol? Você pode não acreditar, @Geraldo , mas eu tenho uma camisa do seu time. @camilanunes Segunda-feira. RT @Candace__: @realwbonner AJUDE O PALMEIRAS PRFVR RT @emy_lene2012: @realwbonner Tio,então corre pro Morumbi e faça uma estadia aí.estamos precisando. RT @emiliobotta: @realwbonner Se o Flamengo vencer é caso pra canonização. Milagre! rs RT @tiagocirqueira: @realwbonner quando combinamos a sua visita na Cidade do Galo? RT @WaltDenn: @realwbonner Quer dá um pulo em Recife???\nO Sport tá precisado de uma forcinha!!! Aqui em SP, estou no mesmo hotel em que o Flamengo ficou, antes de enfrentar a Portuguesa... Sei não. No começo do ano me hospedei no mesmo hotel em que o Fluminense fez a pré-temporada. Foi campeão carioca e tá no caminho do tetra. RT @Desiree_AS: @realwbonner ai sim tio, aproveita e vai ver nosso Tricolor amanhã no Morumbi vc sempre dá sorte . ;) @katiabrasil1 Janeiro tá garantido. @Dri_Carreiro Não tô não. @lili_oliveria Não. @igorathayde Obrigado, tricolor. @RbdSo Tô! Visitando os pais em SP. \n3 dias das férias mais fragmentadas que já tive. @Roberta_Araujoo Parecido mesmo. Mas e o cabelo? RT @FCFataWill: Agora no blog: @realwbonner vai ao UFC Rio III http://t.co/usqkvb7E por @zero2guardawb RT @_Jessicaluana1: @fatimaewilliam1 As mulheres que estava assistindo a Luta \"  gritavam 'agora esfola \"By @realwbonner   http://t.co/g ... “@Elis_Regina10: E vocês veem semelhanças? http://t.co/i497jKH0”\nHahahahaha!!! http://t.co/9PNaUpwP RT @nairdecamargo: @realwbonner  Boner a Fátima tava muito linda!!!no altas hors.. @Luiza_Zacarias listrado @Werller_Blanco oi! @Werller_Blanco @ulissessk8 Sim, @UlissesSk8 . Parabéns! RT @bela_reis: Na cadeira da frente no camarote... ele! @realwbonner hahaha http://t.co/xJqm39KB Impressionante. http://t.co/eRtSJmWQ RT @jorgeojr: No camarote ao lado do meu estava o tio @realwbonner  http://t.co/vWQ5QOLZ Lembrei de lichias, agora. Por que será? @Biiah_vrds mande um beijo pra ela. Que a noite lhes seja serena - e as penas do dia pareçam pequenas. Que os sonhos lhes sejam amenos - e anjos tranquilos lhes façam acenos. Como é mesmo aquela estrofe de boa noite? RT @cronai: Como é que as pessoas se divertiam com novela antes do Twitter? A pedidos, um comentário sobre Avenida Brasil. Na verdade, uma citação. Ou um retweet, como queiram. É da colega Cora Ronai. @dudaIloveWF Agora, naninha. Nunu. Mimi. RT @ninascafutto: @realwbonner vixe, no dia q vc ouvir a música do Camaro Amarelo, vai precisar de exorcismo, pq o negócio dá metástase  ... RT @fabimarques: Fico tentando imaginar o @realwbonner ouvindo MOby e com a música na alma. Mas não consigo!!!! Sabe quando você não consegue tirar uma música da alma? Pois é. Desde cedo, hoje, Everloving, do Moby. Putz! @BruuhAlbino :-) Bem-vindos. Acabei de publicar uma foto http://t.co/2IEkvgQy Everloving, Moby. #NowPlaying Analogia nostálgica. http://t.co/8kTlsbD4 \"Criamos os filhos pro mundo\" - disse a vovó. http://t.co/FqrBdJmu Mas, de repente... http://t.co/tsxv3nVP Há 7 dias éramos assim. http://t.co/tGkjZ8iQ Éramos 3 sob os cuidados de uma mãe atenta. http://t.co/Rx68tKP7 Éramos 3. http://t.co/j4juks1C Sesta. http://t.co/ujdDT8s0 Evolução: 10 http://t.co/R516P7z2 4 minutos e 5 segundos. “@MTellesRPG: Liberação do visto J1 aos selecionados de Univ Federais para o Disney International College http://t.co/eZEaYDQB” hoje no JN. RT @picancojari: É uma sabiá e está fazendo ninho aí por perto! Sinfonias sempre às 5:00h da  madrugada. @realwbonner: Café da manhã. ht ... Comensais à espera. http://t.co/FwOffD4G Café da manhã. http://t.co/FpEuxjqa @murilorosa_ Abraço! RT @WalcyrCarrasco: Vamos confessar. O Joao E. Carneiro é o mestre dos ganchos! Avenida Brasil é super bem escrita! Queria o twitter del ... RT @tiodino: Nem a melhor safra da música sertaneja foi capaz de produzir tanto corno quanto Avenida Brasil. RT @Aguinaldinho: não basta ser uma super vilã e se chamar carminha tem que reclamar da rosquinha da igreja. #avenidaBrasil #Oioioi169 @Hilariohilz @lucianohuck O portão!!! Hahahahahaha!!! RT @LucianoHuck: Turma boa no #caldeirao de hj. Bial, Regina, Fatima, Preta, Bill, Bruno, Andre, Alexandre e Palito. Adorei.  http://t.c ... Aí, @LucianoHuck , a @fbbreal me disse que foi uma correria depois da gravação do Caldeirão pra ninguém perder a novela! Mania geral. Quem verteu ao menos uma lágrima hoje com #AvenidaBrasil diga #Eu! RT @Kel_Paulista: @realwbonner Temos que nos preparar psicologicamente p/ fim da novela Tio. Eu sei que é difícil,mas é a vida tá bom? F ... @tatianacajado Percebeu, né? @JenniferAnielle @sueniafernandes Já votei. @JenniferAnielle @sueniafernandes E tem gente perguntando se depois de 3 surras a Carminha pode pedir música pro Fantástico. Muahahahahaha “@MaMacedo: @realwbonner Avenida Brasil deu 52 pontos. Tava lá e perdi a carteira.” kkkkkk RT @verdadebela: @realwbonner Eu não chorei...Por coincidência na hora da cena caiu um cisco no meu olho, foi isso. RT @psyfitcho: nao tá facil pra ninguem, nem pro @realwbonner E o que foi a cena do Tufão Benício com o Jorginho Raymond? Putz!!! Chorei até com Adauto, hoje. Putz. RT @Fee_fa24: @realwbonner tioo a novela pegando fogo e você nem se pronuncia, aparareça!! Olhaí, @rodrigorcvieira http://t.co/jc5dWaO0 \"O trabalho enobrece.\"\nVisconde RealWBonner👏 #CiteCasaisLindos http://t.co/BnMeeMKT @Pandora0505 Ela não sabe dizer. Impacientes.  http://t.co/VdIVEgd5 Bom dia. http://t.co/tI0mfNOo @SaraScofield_ verdade (null) http://t.co/oCSbAzZb @TiagoLeifert Já nasceram. Olha isso. http://t.co/CGzcM4kQ Fui olhar a família ali na janela agorinha. http://t.co/Gti6HDow Sabe a mãe-passarinho que eu postei hoje, que tem 3 filhotes no ninho? #AvenidaBrasil http://t.co/OuaFOVdl Só digo que as cenas da Carminha a caminho do píer e se despedindo do Max são um marco da teledramaturgia brasileira. #OiOiOi #AvenidaBrasil RT @rodrigorcvieira: Sentindo falta dos comentário do tio @realwbonner durante a novela. #OiOiOi #AvenidaBrasil “@Ricardinjr: @realwbonner vc vai alimentar eles tio?” Não precisa. A mãe tá na área. http://t.co/u4KNX5V6 Surpresa matinal na janela de casa. http://t.co/2wxHnjT4 Endorfinas. http://t.co/ckjhBosJ Esse capacete é um troféu que ganhei do Instituto Ayrton Senna. Na cerimônia em que o recebi, encontrei Hebe Camargo. E ganhei um selinho. “@humor_remix: simboliza, duas grandes personalidades, que se foram e deixaram saudades,mais que sempre serao lembradas”\nOK. Que mais? “@ElizabethLima_: @realwbonner a morte de uma pessoa querida pelo povo brasileiro... Hebe”\nEsse é 1 pontoem comum. Tem outro. O que o capacete do Ayrton Senna tem a ver com este sábado? http://t.co/l36LJs2Q A grande dama da TV entristece o sábado. #Hebe É.\n#FimdoMundo RT @giovanigrizotti: Neve em São Joaquim (SC). Em plena primavera! http://t.co/K27wETaH Falta muito pra começar o próximo capítulo de #AvenidaBrasil ? O Jorginho despejou tudo na cara do Tufão. Amanhã vai ser tenso. RT @tabithalippi: Oi @realwbonner dá uma forcinha e divulga o twitter oficial da Ana Carolina ( @sigaanacarolina ) para seus seguidores? ... “@laura_nicolli: @realwbonner no momento deve estar deitado de pijama listrado lendo tweets dos sobrinhos sobre #FimdoMundo e rindo rios.” RT @anapaulagbrasil: @realwbonner o #FimdoMundo está previsto para o meu aniversario! #sóochocolatesalva ! RT @oluizeduardo: @realwbonner o Brasil não tem estruturas pra receber o #FimDoMundo RT @ribeirogean: @realwbonner CHAMARIA QUEM NÃO GOSTA DE MIM E MOSTRARIA O CONTRARIO Acho que uma providência seria suspender minhas atuais restrições ao consumo de chocolate, nos dias que antecedessem o #FimdoMundo . RT @Galvaofsg: @realwbonner se o mundo terminar 21 dez vou jantar em Bali RT @AndersonFVRJ: @realwbonner Ficaria muito P da vida em saber q tive q acordar cedo pra trabalhar durante todo o ano de 2012 RT @GabibiNogueira: @rede_globo @realwbonner  Iria passar meus últimos dias com as pessoas que eu amo, fazendo oque me faz completa!!! RT @rede_globo: Se as previsões dos Maias estiverem certas, o #FimdoMundo será em 21/12. O que você faria nos seus últimos dias? http:// ... Bom domingo, tropa. Como diria o filósofo-pop, peraí que eu vou ali viver a vida de verdade e volto já. Inté. Acho que a maioria ainda usa o Twitter pra se divertir, pra se informar, trocar ideias, conhecer gente. Mas tem uma meia-dúzia de 4 ou 5... Pior é que tem doido por aí que gosta de se apresentar como maluco beleza, louco manso. Mas não é não. \nCamisa de força... Podia ser só ridículo, o que alguns fazem/escrevem. Mas, quando se examina com mais atenção, nota-se que é patológico, mesmo. Eu, hein... Lendo aqui alguns tweets malucos e pensando  em como a admiração salutar por alguém pode se transformar em obsessão perigosa. E eu o bonequinho gorducho, @hquierati .Se bem que o tio comemorou, hoje, mais uma etapa vencida na balança. Posta a foto aí pra comprovar. O que produz um sorriso no rosto da minha mulher me faz grato. A todos que demonstraram afeto neste 17/09, agradeço muito, com sinceridade. RT @victorsarro: Olha ai eu e o @realwbonner  !!!!! #olhaaimãe http://t.co/onmSVh2K RT @omarcosveras: Eu e o tio @realwbonner no aniversario da @fbbreal http://t.co/iOGtH2e1 Pena que vocês não sabem guardar segredo. Tô meio sem ritmo, nessa correria do fechamento. Não deu tempo de tuitar. Mas fica um alô. Oi, tropa. Acho que nunca na vida recebi tanta mensagem de apoio. Agradeço quase em lágrimas. #PicanhaPastel&amp;PizzaXDieta Estão me testando. Cheguei do SPA, o almoço foi picanha. Lanche, pastel. À noite, amigos oferecem pizza e vinho. Tá difícil. Mas tô firme. @NathanDuarte_ Já tirei. Obrigado, @_mandis ! Em casa. Na conta final, 3,8 kg da manhã de segunda à manhã do sábado. Só o esforço da sexta valeu 800 g. Agora, uma dieta mais tranquila. Mas agora ocêis midão licença que tocou o sino do jantar. Vou lá comer espaguete de abobrinha com almôndega de berinjela, valeu? Fui! Vieram exatamente pra intensificar o esforço e renovar o ânimo. E estavam contentes com a perda adicional dessa semana. Esses irão longe. Encontrei aqui um casal de Natal. Juntos, antes de virem, os 2 tinham perdido mais de 30 kg numa dieta cuja meta era meio kg por semana. Agora sério. SPA é legal pra dar um impulso inicial, ou pra turbinar uma dieta. Mas, se a pessoa sai e não muda, é perda de tempo e grana. RT @Kel_Paulista: @realwbonner Quando o tio ler uma mensagem minha e me responder faço a promessa de não comer chocolate durante uma sem ... Eu não postar foto não, que é pra não traumatizar o Cauã, o Zulu, esses caras, entende? Nada a ver humilhar, né? “@Dri_Carreiro: @realwbonner tio tem que se cuidar mesmo porque a tia Fátima ta maior Gatinha” \npois é,todo mundo falando, + magra e feliz. RT @fa_ssa: @realwbonner olha que sorte, quando tirar a barba vai perder o 4° quilo! Os sobrinhos mais antigos sabem que o tio gosta de correr. De segunda até hoje, somei 50 km entre corridas e caminhadas. Mais abdominais... Mas o truque é simples: comida de baixíssima caloria, inventiva e saborosa. E muuuuito exercício. RT @tubaina: É um alívio saber que o @realwbonner também tem que fazer quebra-cabeça na firrrma pra conseguir tirar férias. Ô vidinha di ... Pois é, foi o que eu imaginei. E é claro que ninguém quer ver foto do tio 3 quilos mais magro e com barba de 7 dias... O lugar é um sítio em Itatiba, SP. Chama-se 7 VOLTAS. Eu mesmo já estou na quarta. Resultado: depois de menos de 6 dias, o tio vai chegar em casa amanhã pelo menos 3 quilinhos mais leve. Reservei uma semaninha num lugar muito legal que @fbbreal e eu visitamos pela última vez há 14 anos. Um SPA no interior de São Paulo. A ideia era guardar os 30 dias pra janeiro. Mas o tio andava tão cansado que precisou sair por uns dias. E como teria que ser sozinho... Todo ano a gente divide os 30 dias de férias entre julho e janeiro. Em 2012, não deu. Fátima no #Encontro , filhos viajando com a escola. Ocêis tudo qué sabê a verdade-verdadera do sumiço do tio? Intão ovô ispricá. “@NathanDuarte_: @realwbonner Minas, uai!” Não! Oncotô? O tio em férias... http://t.co/RUBz3ZJX Boa noite, tropa. O tio está 450 km a sudoeste de casa. E vai dormir em 5... 4... 3... Fim de tarde. Melhor que o quarto, que tá escuro e bagunçado. http://t.co/BrJhduPN RT @sueniafernandes: @zero2guardaWB @realwbonner quem acha q o tio vai posta uma foto no escuro diga EUU \\0/ “@NattRabelo: @realwbonner tábret quem tem é aquela do Zorra Total. Qual o nome mesmo? Eu esqueci.” Tem vinte centarro? Foto do quarto do hotel? “@sueniafernandes: @realwbonner tio troco um pao de queijo por uma barra de chocolate, topas???? rsrsr” \noncotô tem desses trem não. Agora há pouquinho eu conversei com a patroa @fbbreal pelo tábret. Ela tá gripadaça. Dariz beio itupido. O tio tirou uns dias de férias. Estará de volta na quarta da semana que vem. @zero2guardaWB Mas já? Putz! Dessa vez  foram rápidos! “@IAmAllysson: ta no banheiro entao RT @realwbonner Num posso dizê!” hahahahaha! Não! “@sabrinalucke: @realwbonner itaipava?” Não! “@LiviaTadioto: @realwbonner redação?” Não. Num posso dizê! “@RafiXavs: @realwbonner No trânsito?” Não! Oncotô? Oi. http://t.co/yOfyOMJj Regina Duarte! Beleza. O #Encontro não cortou a participação do tio. Só não pude ouvir, durante a reunião. Pior que reunião do JN começa agora. Lá dentro não posso ouvir minha  participação no #Encontro . A TV fica sem som. Depois vocês me contam. RT @marciorfer: @realwbonner vai q a apresentadora não vai muito com a sua cara né tio ! rsrsrsrs... RT @maristelaferre: @realwbonner DANDO INDIRETA  AO #ENCONTRO,PARA NÃO SER BARRADO Quer dizer... O tio participa da homenagem à #ReginaDuarte se o #Encontro não tiver cortado a gravação, né? Sei lá... Hoje o tio participa da homenagem à #Regina Duarte no #Encontro . RT @Crian_Esperanca: Renata Sorrah, Bianca Comparato, Nivea Maria, Lizandra Souto, MV Bill e outros estão no Mesão dos Artistas ligue ag ... @CamileMagalhaes Hoje! A @fbbreal revendo o @EncontroFatima  às 22:21h. http://t.co/kKrdZ1bN “@_CentralBonemer: Duvidamos tioo! RT: @zero2guardaWB @realwbonner duvido que você tira uma foto da @fbbreal twittando.”\nOlha... “@resende_roberta: @realwbonner @encontrofatima como faz para participar??? Eu quero!!”\nÉ só postar com  a tag #encontrofatima . “@hmnervosa: @realwbonner adorei a gravata do tio hoje o/”\nA mesma que usei ao receber o Emmy no ano passado. :-) Quando me convidarem, @Jessica_Argolo ... @_CentralBonemer É! RT @fbbreal: A @annabarros e @kathiapalladino @mary_n2012 @eleniravinotti e @raylson_lima mandaram bem hj nos comentários no @EncontroFa ... Pra usar uma expressão dos meus sobrinhos, o programa da patroa todo trabalhado nas redes sociais. Hoje o \n@EncontroFatima publicou tweets. 27 anos de campanha. Mais de 4 milhões de brasileiros beneficiados. Criança Esperança é show. E o show do Criança Esperança é sábado. OiOiOi no #Encontro ! Hahahaha!!! RT @claudiaariane2: Será q o @realwbonner apresenta o JN e twita ao mesmo tempo?duvido,deve ser outra pessoa né?! A equipe do @JNTVGloboBrasil agradece,  @gioschpe . RT @gioschpe: Vcs têm visto a semana dedicada à educação do @JNTVGloboBrasil? Muito boa, recomendo, tá disponível online. Gol do @realwb ... RT @Alecsiamiranda: @realwbonner. Fica de olho nisso tio !  #euamoafatima No salão do cabeleireiro...\n#EncontroComFátimaBernardes http://t.co/OPkIB9yc RT @_CaesarPhoto: #euamoafatima desculpa @realwbonner :-) Dan Stulbach: mandou postar #AmoaFatima e o tio apoia! #EncontroComFátimaBernardes Mandou bem, o Luan. Carinho com as fãs, respeito e pé no chão.\n#Encontro RT @Thonyn: @realwbonner A tia Fátima ta podendo seeeempre...quantos convidados..hahaha.. RT @elianabrito: @realwbonner tem também All You Need Is Love ao vivo! @fatimaewilliam1 Tá mesmo! Luan Santana, as bicampeãs olímpicas da seleção feminina de vôlei, Sônia Brido, Mariana Rios... A patroa toda toda, hoje. #Encontro RT @IncondicionaLs_: AMANHA TEM LUAN SANTANA NO PROGRAMA DA FÁTIMA BERNARDES , NÃO PERCAM ' http://t.co/QnMc8aOq Tempo, tempo, tempo, tempo.  http://t.co/LxyaSQCo RT @sueniafernandes: @realwbonner depois de ver a patroa @fbbreal em #avenidabrasil o tio ficou mais ainda apaixonado pela novela!! #oio ... @sueniafernandes @juh_luiz Isso mesmo! “@i_medino: Tio @realwbonner apresentando o @showdavida com cara de sobrinho! rs http://t.co/KjXNCgyO” \nCom cara de @viniciusbonemer !!! RT @kellenkastro: Tô aki esperando o @realwbonner  dá um Oizinho......  #Oremos!   rs EmaEmaEma\nCada um com seu problema. \n#filosofiaOiOiOi Que a noite lhes seja serena\nE as penas do dia pareçam pequenas.\nQue os sonhos lhes sejam amenos\nE anjos tranquilos lhes façam acenos. E agora, envelopado em meu pijamão listrado, despeço-me antes do aboboramento da meia-noite. Boa noite. “@Vanrocha2: @realwbonner O Tufão não estava?” Não. Ele chegaria dali a minutos, mas eu precisava ir trabalhar! Hahahahaha No dia em que eu visitei o estúdio de #AvenidaBrasil , vi Leleco, Muricy, Ivana, Zezé, Janaína, Ágata, Max, Nina e Carminha. Inesquecível. “@joaopaulom: @raulchristiano @raulchristiano Como faço pra fazer um avatar igual o seu e do @realwbonner?”\nPergunta pra @zero2guardaWB . Adriana Esteves, assustada com o grito, vira-se pros outros 2 e pergunta: \"Foi por minha causa???\" \nHahahahahaha!!! Aí, ela olhou pro lado e viu a Carminha toda agitada, com a @fbbreal .E soltou um grito aterrorizado de Sexta-Feira 13. A @fbbreal e eu descemos ao mesmo tempo pra cumprimentá-la. No banco traseiro, uma das nossas filhas não viu por quê. Ficou meio assustada. Cena real ocorrida há algumas semanas. Adriana Esteves surgiu de repente na frente do nosso carro quando saíamos de um restaurante. Tiete assumido e juramentado. #OiOiOi http://t.co/lmYoCsgS RT @leandrosioli: @HelenaAnjos_ @realwbonner tenho mais medo dos politicos do que da carminha... RT @HelenaAnjos_: @realwbonner tenho mais medo de Nina do que de Carminha. RT @Drigununes: @realwbonner A Nina era p ta com uma serra elétrica  na mão, quando a Carminha ligasse a luz!! @MerjoryAraujo E de pijamão! RT @ReginaBaltar2: @realwbonner Nina,uma ótima decoradora. E a Carminha Adorou,hahahaha #OiOiOi @Keshi Meu filho notou a mesma coisa. Ainda há pouco, Carminha aterrorizada, Nina-Rita extasiada e o tio aqui aplaudindo a imagem congelada. Vício.  #OiOiOi O tio veio fazer check up de rotina num hospital. Estava agendado desde maio  Não daria tempo de apresentar o JN. Mas tá tudo bem.. O tio vai ter que esperar o fim do primeiro bloco de Avenida Brasil antes de correr pra garagem. A @fbbreal vai entender, né?\n#OiOiOi RT @JenniferAnielle: @realwbonner Já se recuperou folego  de ter dançando \"Charme\" na redação do JN . Rs :P OiOiOi! Uma noite de rivalidade entre paulistas e cariocas.\nLá em casa.\nMuahahahahaha! Tá corrido, hoje. Não dá tempo de tagarelar aqui. Só dar um oi.\nAntes do OiOiOi. Exaustão existencial ascendente. Apagão cerebral evidente. Oclusão ocular iminente. Horizontalização esqueletal urgente. Conforme pedido da @zero2guardaWB http://t.co/pYQgnloF RT @MarthaFeitosa: @realwbonner xiiiiu, silêncio! @gabluiz Gagahsgsha!!! Cara, o brigadeiro ficou muito bom. Parabéns. Só agora lembrei de comentar. Pô, a @fbbreal precisa dormir - e eu rindo a essa hora! Hahahahahaha!!! Mas notícia que começa daquele jeito parece piada, mesmo. \"Um americano, um russo e um japonês...\"\nhahahahahaha!!! Sério. Hoje, os comentários dos sobrinhos sobre a notícia que parecia piada quase me fizeram gargalhar no ar, no @JNTVGloboBrasil . RT @emy_lene2012: Amanhã o @realwbonner deve manter aquele silêncio respeitoso que preserva  lindamente o seu casamento,né tio? Amanhã tem São Paulo e Vasco.\nPutz. Quando eu expliquei pros editores o teor dessa notícia, hoje à tarde, eu também me senti contando uma piada. Só faltou o português. RT @claubarbot: Um americano, um russo e um japonês... (jurei q o @realwbonner tava começando uma piada) RT @EncontroFatima: Envie uma foto tirada em uma viagem com a camisa do seu time de coração e tenha a chance de participar do Encontro:  ... Zzzzzzzzzzzzzzzzzz Sabe quano usóio qué fechá? RT @rodharden: @realwbonner Escreve \"fila na pauta\" no ipad para ver... RT @beakinho: @realwbonner Quantas vovós subiram no bolo? Era velinha. Mas esse tablet da marca da maçã mudou meu texto. Se bem que já foi pior. No começo, mudava grosseiramente a palavra \"nerd\"... Feliz aniversário, @solange_sol89 ! E pra todo mundo que botou mais 1 velhinha no bolo nesta segunda-feira. @lili_oliveria estamos. Muita! O @victorsarro de Corinthians, presumo... RT @victorsarro: @realwbonner eae Will Futebol amanha???? #fingindoqueeutenhointimidade RT @JNTVGloboBrasil: Procon proíbe a venda de novas linhas de celulares em Porto Alegre. Confira a seguir, no #JN. RT @lili_oliveria: @realwbonner boa noite tio, amei a @fbbreal congelada!! @Monicassilveira Seus bonequinhos fazem sucesso, doutora. Questão de justiça. \n“@iffmay:  fiz junto com a @zero2guardaWB . Cada uma domina uma parte. Aí juntamos as ideias. ;)” #OiOiOi \nBy @iffmay http://t.co/7XVslFZd @pfcolzani Também acho! Hahaha! @gracaaragao Também acho! O tio não faltou no serviço. É que tinha um evento da firma em outro bairro até as 7 e não daria tempo de pegar condução pra chegar lá no JN RT @NinaCongelada: Alá, até o tio que apresenta um jornal antes da minha novela quer congelar... RT @realwbonner OiOiOi! http://t.co/MRZ ... “@Thaiinabenites: @realwbonner Tio, diz assim \"Vocês são show\"? Por favorzinho?”\nTá. Vocês sabem que são. E agora que o tio pagou esse king kong, é hora de horizontalizar esqueleto e estender pálpebras sobre a íris. Tenhamos todos uma boa noite. RT @Priimoreira: novo segurança da Carminha @realwbonner OiOiOi! http://t.co/xmq0UKWQ Falei até amanhã por engano! O tio vai participar de um evento da firma! Até quinta, tropa. Amanhã tem Márcio Gomes com Renata Vasconcellos. Alguém aí avisa a @fbbreal , por favor, que o tio tá quase saindo do serviço aqui na firma? Rapidinho:\nNão, eu não vou tirar férias em julho.\nSim, a Patrícia Poeta está em férias. Quem é milionário aí e vai dar a volta ao redor da lua nessa nave diga Eu! Quem tá usando álcool gel aó diga Eu! RT @daysouzaa: \"Ressoa pelo Brasil a declaração de um amor insano!\"  é, @realwbonner, a abertura foi mt melhor do q eu imaginava.  *-* # ... Ressoa, pelo Brasil, a declaração de um amor insano. Daqui a pouco, no @JNTVGloboBrasil Patroa toda feliz no #EncontrocomFatimaBernardes   \n#prontobabei #prontobabei   \nBoa noite! :-) :-)  Obrigado! Lendo a matéria sobre Fátima na revista Cláudia. E reconhecendo a grandeza de minha mulher em cada palavra. Eu sei, pareço babão. E sou. A patroa não é fraca não. Hahahahahaha! Programa ao vivo é tudo de bom. #EncontrocomFatimaBernardes RT @filhopaulocesar: Adoção é um gesto de amor @fbbreal @realwbonner @EncontroFatima #EncontroComFátimaBernardes RT @mairaamarinho: O tio @realwbonner deve ser apaixonar várias vezes pela Fátima quando vê a abertura do #EncontrocomFatimaBernardes. E ... RT @wiliansmedeiros: @realwbonner @fbbreal Bom dia,#EncontroComFatimaBernardes eu nao perco nehnum dia.. Amo demais.... #ParabénsFatima “@evaristosouza83: @realwbonner Aí tio, quem o senhor quer como novo comandante tricolor?”  O Muricy. “@pryygomes: @realwbonner qual é o seu palpite com o jogo do boca e do corinthians???????” \nCOR 1 x 0 BOC RT @EncontroFatima: Quem cuida das unhas de Alcione? Rosimeri é uma artista das unhas! Será que você advinha quem é a verdadeira Rosimer ... “@ras_ramadan: Ééé @realwbonner a @fbbreal está se superando longe de vc! Linda! Parabéns..” Mas só porque tá longe? Hahahaha Hahahahahahahahaha. Hahahahahaha!!! Nem o Hassun se aguenta. #EncontrocomFatimaBernardes http://t.co/Lw4mv4If Chorão? O Hassoun? Hahahahahaha! Ele não conhece o tio... #EncontrocomFatimaBernardes Pronto. Lá vai o tio se emocionar com o Hassoun no #EncontrocomFatimaBernardes “@fbbreal: Boa noite e até amanhã às 10:30.” Muito, @djmota . Muito mesmo. Acho que não vou tirar da minha cabeça a expressão do rosto da Brenda. Deus a ajude e proteja. É um orgulho, @amandamarques_s . Ela estava radiante, segura, dona da situação. E na estreia, ao vivo, numa alquimia nova. Nasceu pra isso. 27 anos de TV não me tornam proprietário da verdade. Mas acho que #Avenida Brasil já assegurou lugar na história da nossa teledramaturgia. RT @sonia_garcia96: @realwbonner Parabéns ...a Tia @fbbreal  arrasou... Boa viagem, Daiana @zero2guardaWB  e @iffmay . Juízo! RT @taianececillio: Geente, amando o programa da Fátima Bernardes :D #Encontro RT @LETSGUARU: superando minhas espectativas #Encontro RT @MartinsCih: Estou adorando esse novo programa da Fátima sz #Encontro RT @AracyTopTherm_: Que coisa liiinda, gente, a Fátima Bernandes em pé! #Encontro “@Jheine_Lima: Fico imaginando a expressão facial do tio @realwbonner vendo a abertura do programa da tia ... Ownt”\nEmocionante demais! RT @brasil_dani: @realwbonner Moro em Ft. Lauderdale, FL e estou assistindo Encontro com Fatima online ao vivo. Está ótimo. Muito legal  ... O coração fala.  http://t.co/oSK6HNpX A inquietação que virou sonho, que virou ideia, que virou projeto, que virou o #EncontrocomFatimaBernardes estreia amanhã. Haja ansiedade. RT @guilyzinha: @realwbonner tem alguma reporter chamada Deborah?? Tambem quero!! RT @TicianaLopes_: @realwbonner Tomara que um dia apareça uma repórter Ticiana, pra eu ter a mesma felicidade que as \"Camilas\"! RT @Daily_Chrystine: @realwbonner Poxa tio, não tem nenhuma repórter com meu nome p eu ganhar um BOA NOITE tbm.. =( RT @camilafcorrea: Aí o @realwbonner Diz \"boa noite Camila\" pra reporter e eu aqui em casa: \"Boa Noite\". Achei que fosse boa noite, diga ... RT @chadecamila_: Ai eu passo pela sala e o @realwbonner fala: Boa Noite Camila. A @fbbreal é forte. O tio todo lacrimoso logo cedo com a Ana Maria Braga relembrando vida e carreira. Putz! E a patroa firme, ali na TV. RT @EncontroFatima: Encontre o melhor look para Fátima Bernardes! http://t.co/22q1dKUo @EncontroFatima Maravilhoso ver como a inquietação gerou o sonho que virou ideia que virou projeto que virou programa que rendeu twitter. RT @rede_globo: Barraco já já em #AvenidaBrasil: Carminha encontra Tufão e Monalisa juntinhos e sai no tapa com a rival: http://t.co/JTJ ... É como eu sempre digo:\noi, oi, oi. RT @rede_globo: Confirme presença na estreia do programa \"Encontro com Fátima Bernardes\": http://t.co/XShjYa0L 8 dias.  http://t.co/xaIFqZyG OiOiOi!!! @LeehhBelmonte boa noite. RT @clayton_psantos: Tenho certeza que o @realwbonner pensou em lançar um Oi|Oi|Oi ao invés de dizer \"Avenida Brasil\" no fim do JN. Deu  ... RT @peptus: @realwbonner Todos torcendo muito pra quando acabar o jornal, ao invés de \"boa noite\", rolar um OiOiOi! @Flavia_Dias_RJ Obrigado, ainda que atrasado! Tal como há 14 anos, quando nosso trio deixou a UTI neonatal pra ocupar 3 berços, em casa.\nÉ mesmo uma espécie de parto, o que se aproxima. Fátima atarefadíssima, ocupadíssima, apressadíssima... E felicíssima. Ainda há pouco, antes de a @fbbreal sair pro trabalho, eu disse que a situação toda só tem um paralelo, em minha memória. E só mais um comentário. É sobre a proximidade da estreia do \"Encontro com Fátima Bernardes\". Faltam só 10 dias, as chamadas estão no ar... Podia até usar mais essa vinheta, né?\n\n\"A seguir a comissão da cascata! E os gols da Libertadores!\nTãã-nãnãnãnãã tãnãnãnãnãnã!\nOiOiOi!\" RT @luliguimaraes: @realwbonner acho q o Brasil inteiro canta c vc e c a abertura de Avenida Brasil! #OiOiOi RT @rafoaguiar: Pagava pra ver isso ao vivo RT @realwbonner Fora que o tio não consegue ouvir o \"Oi-Oi-Oi!\" da vinheta sem cantar junto. ... RT @gessicass: @realwbonner Tio, confessa que além de cantar vc dá uma dançadinha também??? Fora que o tio não consegue ouvir o \"Oi-Oi-Oi!\" da vinheta sem cantar junto...\nPutz. Que micaço... Engraçado que, no começo, ouvi muita gente encantada se perguntar: \"mas será que o João E. Carneiro vai conseguir manter esse ritmo?\" hahaha E mesmo quem começou com papel pequeno brilha. Todos afinados, em todos os núcleos da novela. Acho Av. Brasil de uma felicidade raríssima. Há uns 2 meses, eu botei aqui a tag  #MedoDaAdrianaEsteves . E a Carminha nem alternava choro desesperado com sorriso diabólico, como ontem. E botei no carro uma TV que me permite ouvir o capítulo enquanto dirijo pra casa. E ver, quando o carro para no sinal e a tela desbloqueia. Tem sobrinho aí querendo saber como eu consigo ver, se é depois do JN. Pois é. Só saio da minha sala, na Globo, no fim da primeira parte. Primeiro, eu preciso confessar que a trama, os diálogos, as atuações e a direção de Avenida Brasil me deixam perplexo a cada capítulo.Vício. A gente fica longe do Twitter um tempo e de repente nota que deixou de dividir algumas impressões ou experiências marcantes. Obrigado! Só pra agradecer, de novo, as mensagens pelo restabelecimento da minha mãe. Ela está melhor, deixando a todos aliviados com a evolução. Oi. Imagens de uma caminhada (3) http://t.co/9h9w9njv Imagens de uma caminhada (2) http://t.co/kkX3RGU9 Imagens de uma caminhada. http://t.co/VpDwRR30 Acabei de publicar uma foto http://t.co/28k2Jj3O Obrigado, em nome de toda a família, pelas mensagens carinhosas, pelas preces, pelo carinho enorme. 5 dias depois de fraturar uma vértebra, minha mãe recebe alta hospitalar. A recuperação será em casa, com um colete, apoio e paciência. @Fabio_Turci abraço, Fábio. Muito obrigado. Um passo importante. E um alento, depois de 78 horas deitada. Com o colete ortopédico, minha mãe se ergue da cama pela primeira vez desde o acidente. E caminha, amparada, pelo quarto do hospital. @danipki parabéns! @angelicabritobr Está na  GloboNews. HA HA HA! Sobrou pro tio! Gente, eu sei que não tem nada a ver falar disso num momento como esse. Mas bateu um #MedoDaAdrianaEsteves   Putz. Obrigado, de coração. Por enquanto, permanece no hospital, deitada, recebendo analgésicos e os votos de restabelecimento que vocês têm enviado via Twitter. Os médicos, assim, descartaram a necessidade de cirurgia. E a maioria julgou mais adequado que ela se recupere com o uso de um colete. Notícias de minha mãe pra quem tem mandado tanta mensagem carinhosa. Ela completou hoje as 48 h posteriores à fratura da vértebra L3. RT @CasaeJardim: Olha quem apareceu aqui na redação de Casa e Jardim agorinha: o @realwbonner! http://t.co/KjStKkDv RT @crescer: Eis que no começo da tarde recebemos a visita de @realwbonner aqui na redação da @crescer. Boa tarde, Wiliam! http://t.co/Q ... RT @claudiapixu: @realwbonner que honra! Hj vc esta visitando a gente aqui na Editora Globo. Vi vc cercado pelas tietes Minha mãe no hospital, pede: \"Liga no Faustão que eu quero ver a Fatinha.\"\nE fãs levantam a tag #ADivaÉPenta  . Parabéns @fbbreal ! Beijo! Vista do hospital.  http://t.co/veHuA0e7 @flaviatostes Não estou em Ribeirão. Estou em SP. Agradeço, mais uma vez, tantas mensagens carinhosas. Vamos em frente. Obrigado pelas mensagens. Minha mãe nos deu um susto. Uma queda, em casa, e uma fratura pequena numa vértebra lombar. Estamos no hospital. RT @AleMattoso: @fbbreal Obrigado pelo carinho de sempre. Bjs da nova família! RT @fbbreal: Meus vizinhos de frente.:-) http://t.co/Bh0y1S9u RT @fbbreal: Nasceu o primeiro sobrinho do nosso programa. Leonardo, filho de Mattoso - nosso editor - e Priscila. Pela pressa, vai ser  ... @PAULOSITE Eu vi. Abraço! @ViviAlthoff @nugalichocolate Recebi s. Muito obrigado! @georgesagille See U tomorrow, teacher. Good night! E agora, se me dão licença, despeço-me com uma foto, em meu quarto, neste exato momento. Boa noite! http://t.co/KL8vg2wg Um abraço, @mariolucio23 . Depois da barbárie de ontem, é bom ver alguma civilidade no trato de torcedores de clubes rivais. “@FlaviiaAlvees: @realwbonner Tio poeta” \nNegativo. Poeta é a Patrícia. O tio é Bonner. @Repassos ha ha ha ha! @Juh_Luiz Excepcionalmente não. Beijo, mãe aniversariante da @iamRejane ! Sim, @zero2guardaWB . Sempre. “@hzambianco: @realwbonner dá um beijinho na tia fátima LINDA! estamos com saudades dela.” \nSeu desejo é uma ordem. É pra já! Que a noite lhes seja serena \nE as penas do dia pareçam pequenas. \nQue os sonhos lhes sejam amenos\nE anjos tranquilos lhes façam acenos. Tenhamos todos uma boa noite. Pijamão listrado, esqueleto horizontalizado, pálpebras esparramadas, cílios superiores e inferiores unidos, o tio, cheiroso do banho, diz: #JN #JornalNacional e #Malvinas nos TTs...\nValeu, tropa. Obrigado pela companhia.\nO tio vai jantar. Inté! RT @AndreinhaSilva: Aleluiaaaaaaaaaaaaaaaa...vai esfriar.... a melhor noticia do #JN hj ... @realwbonner RT @fannyladeira: Também gostei! RT @endersonrafael: Maravilhosa série sobre as Malvinas! Parabéns! @realwbonner Mas eu dizia: olá!\nÉ tudo o que dá pra dizer no intervalo... Olá. Prontos. Acho que agora nós vamos. \nInté, tropa. É SandeS Júnior, @AndrezzaRachid . Ué, @DboraLasMacedo . A @fbbreal  a @laurabonemer  a @biabonemer  e o @viniciusbonemer  se aprontarem pra sairmos. Esperando... Esperando... @binhakof_ ;-) RT @Daltnkstel: Pizza hj pra comemorar o aniver da pessoa mais important da minha #VIDA! Minha #MÃE Tropa, aniversário da Clea, mãe do @Daltnkstel . Vocês já cumprimentaram? Beijão, Clea! @binhakof_ Quase... #NowPlaying \"In the wee small hours of the the morning\", Ben Webster, JAZZ ROUND MIDNIGHT Agora a playlist recuou 30 anos. http://t.co/L1Bm7jz1 A patroa e uma filha se embonecam, outra descansa, o menino lancha. O tio, aqui, relembra músicas de quando era assim. http://t.co/16lsj8bA @hrodriguesttp Obrigado! @Monicassilveira boa tarde, Doutora! @juliareisgomes Beijos pras duas! #NowPlaying http://t.co/OKV18m32 http://t.co/VABsZr4F RT @normanbitner: @realwbonner O céu está em festa para receber o Chico Anysio! Costinha, Golias, Brandão Filho, Rogério Cardoso, entre  ... RT @VerinhaRolim: @realwbonner Chico Anysio fez o humor mais bonito do Brasil. Um humor inocente, puro e ao msm tempo, crítico. E agrada ... Uma daquelas edições inesquecíveis, mas por um motivo triste. RT @nubialima: @realwbonner os fãs do #EternoChicoAnysio agradecem a linda homenagem do @JNTVGloboBrasil ... jantar com a patroa @fbbreal , @patriciapoetap e o marido Amauri e o casal Tande. Aniversário do nosso medalhista-apresentador-amigão. E depois desse jornalão cheio de notícias nesta terça-feira movimentada... Que coisa... Acabei de publicar uma foto http://t.co/F0xbiWnZ O dia longe do ar condicionado e o remédio receitado pelo médico produziram melhora impressionante na minha garganta. Vou trabalhar, hoje. Quinta-feira diferannntchi...\n Garganta inflamada, fugindo de ambientes com ar condicionado. E acompanhando filho na aula de vôlei. \n:-) Limão. http://t.co/ysNNSshK @claudiaandrearj muito bem. Melhor que eu, que estou com a garganta dolorida. @TEKKA_956g Não... a voz tá ficando pequenininha Tá feia, a coisa. cof-cof-cof-cof... ãham! cof! cof-cof-cof! Pô, por que todo mundo olha pra mim quando alguém fala em paranoia? Aí eu cheguei e tava todo mundo olhando pra mim e alguém falou em paranoia, lembro perfeitamente. E não dava pra ficar calado e eu disse: http://t.co/TyIznygj @silvioluiz ha ha ha ha!!! Hotel Mercure, Vanves! Ou no IBC! Boa noite!! Tá bem, tá bem, os sobrinhos mais antigos perguntam e o tio responde: sim, vocês são show! Abraço, @silvioluiz . Quando estudante na ECA-USP, há 30 aninhos, entrevistei você. Figuraça. Simpatia e simplicidade. E a todos os sobrinhos desejo uma boa noite. Suprimo de fótons as retinas, esparramando as gorduras palpebrais até a conjunção de cílios superiores e inferiores, num magnetismo atroz. E recomendo a quem ainda não viu os dois. O Artista é genial e doce. \nA Dama de Ferro é magnífico. \nIsto posto, horizontalizo meu esqueleto. E já que os paparazzi que montam guarda no shopping não apuraram direito pras legendas das fotos, digo que fui duas vezes ao cinema no FDS. @NayaraAcioli A primeira vez a gente não esquece. Beijo do tio - e boa noite. Isso, @lisifabres ! Humilha! :-) @monalysi Sim, senhora. Tentarei conciliar, @pluisoficial .Já disse e repito: \"Tempo de menino\" é das melhores coisas que tenho ouvido em português. Será um prazer. @zero2guardaWB ;-) Hummm...\n“@beatriz_ana:  tantos minutos de riso equivale a tanto em perda de agua pela transpiração...então...no final você RI LITROS, TIO!” @leehmeloni @nauanaamarante Beijos do tio, meninas. Gente, a @pulodosuricato , também conhecida como Lindaura, está aniversariando. Vamos flodar a timeline dela? No bom sentido, claro. Como dizem meus sobrinhos de Twitter, rimos litros. Embora eu não entenda como se possa medir o volume espacial de risos. Mas tudo bem. - E aí, Billy? O quê que você anda fazendo? Ao chegar, fui cumprimentando um por um. Num grupo de umas 5 pessoas, um dos caras mais divertidos da turma de 82 me manda a pergunta: Foi um encontro ótimo, há 8 dias. Todo mundo contente de rever colegas. E o previsível: menos cabelos, quilinhos a mais. Normal. 30 anos... A organização antes e os comentários depois eram no FB. Aí meu tempo com Twitter foi roubado. Mas o tio tá na área. Derrubou é pênalti. Ando mesmo sumido daqui. Estive enrolado com outra rede social por causa do reencontro da turma da ECA-USP 30 anos depois da primeira aula. O Senhor tá no céu, @Marii_Vieira Boa noite, tropa. Tudo certo? Perguntem pra @Carol_cfontes , @thiagor_sp  e @fefito . @Jenni_Benato :-) Valeu, @JRPRATA . Obrigado. Corrigi agora mesmo. RT @Lublopes: @realwbonner QUE FOFA! A @fbbreal FAZENDO BIQUINHO POR CAUSA DO APARELHO... :)) RT @AubreyLucas: @realwbonner Tire o cachorro do sofá antes que ela volte pra casa, rsrs! RT @Eu_PriscilaLino: @realwbonner Ela está realmente radiante, né? Renovada, com brilho nos olhos... Feliz com o novo projeto. Que bom!! ... NÃO TEM PREÇO!  \\o/ http://t.co/u9hzVK4S Celular 3 G, uma fortuna. Plano de dados ilimitado, um despautério. Receber foto da @fbbreal almoçando no Projac com a @anapaulagbrasil... @Leehhbelmonte De nada. A @fbbreal acaba de flagrar o Twister sobre o sofá.  (de como um bulldog francês pode desrespeitar o Dia Internacional da Mulher) kkkkkk @Leehhbelmonte boa noite! @RogelioSpain falamos ontem, ué! “@Shumacher08: @realwbonner Fora,que quando você chega,a janta já tá pronta,não é?”  e quentinha! “@FasDaFatima: @realwbonner Já que sabe novidades do programa, conta pra gente tio. (risos)”  muahahahahaha! A minha curiosidade e o brilho nos olhos dela mostram como esse momento tem sido especial. Muito, muito legal mesmo. Ao chegar em casa, ouço novidades do programa, conto meu dia no JN. Os caminhos diferentes na TV criaram novas rotinas. E não é que é legal? Tropa, obrigado pela companhia.\nInté! RT @amx7777: @realwbonner Cuidado, da última vez em que você comemorou o fechamento de uma edição, um prédio caiu no Rio. #toc_toc_toc O bom de terminar a edição do JN ANTES de o programa começar é que eu consigo VER o JN no ar. Parece pouco e óbvio. Mas é raro... RT @LeoAnthonny_: @realwbonner Boa noite, meu nome é Leonardo, e eu tenho uma leve impressão que já te vi em algum lugar ... meio minuto pra começar o JN. @Pattriciacoelho Obrigado! Que honra! 2 minutos pra começar o JN. @lelamuriqui Parabéns! Mas a propaganda partidária obrigatória que retardou o #JN em 10 minutos me permitiu vir aqui dar um oi.\nPortanto:\nOi! Eu poderia tentar explicar em 140 caracteres o motivo de ter sumido por tanto tempo. Mas seria impossível. Resumo: trabalho pesado. E ponto. Estamos de vooooltaaa... Crescer - NOTÍCIAS - Mamografia entre 40 e 49 anos facilita tratamento do câncer e aumenta a chance de cura http://t.co/jKELFWQ5 RT @JornalOGlobo: Entra na avenida a grande campeã do carnaval 2012, Unidos da Tijuca, levantando o público com enredo sobre o Rei do Se ... O sinal no sambódromo é ruim. E aí? É...\nÉ como eu digo....\nA rapadura é doce, mas... RT @dpaesler: Olha o @realwbonner acabando com a minha produtividade no trabalho! http://t.co/nUBNe8xb Esse é o Willian Bonne Sousa Rodrigues, 21 anos, de Santarém. Encontro de xarás. http://t.co/a80dsehw Como é mesmo que se usa isso aqui? RT @thecoolhunter: http://t.co/4OMzxKS9 RT @diegocardena: @realwbonner moro aqui no paraguai e tah tenso mesmo.. nessa regiao o clima esta pesando cada vez mais.. Obrigado, tropa. Em nome da equipe toda. #JN com participação impecável da @patriciapoetap na cobertura do desastre no Rio. Bem-vinda! RT @amandamarques_s: @realwbonner Parabéns pelo trabalho equipe #JN. RT @carborma: @realwbonner Patricia arrebentando no JN de hoje. Pena que a matéria seja sobre uma tragédia."}