{"tweets": "You can finally livestream your underwater adventures https://t.co/xqiOg45BJO \"Even in announcing such a huge achievement, Trump couldn't help but do what he always does: make it super weird.\" https://t.co/20uIGHcURA https://t.co/dZEpgSQRC6 This home robot will clean up your house and remember what drinks you like https://t.co/lUPdPJxiu5 Reading glasses just got futuristic https://t.co/WiRWLTGsgL Print anything you want onto your nails. Literally, anything. https://t.co/sDtnG1B3sZ There's a new kind of selfie stick in town https://t.co/UG1nJEXqC5 This smart kitchen will help eliminate food waste by suggesting recipes https://t.co/AFB8kSYbcV This form of laundry helps your clothes last longer and it’s good for the environment https://t.co/PUjUOjkRsH Would you let this robot play with your child? https://t.co/GbK93E6xRD \"The Mandalorian\" trailer has dropped, and it looks goooood https://t.co/ydb7ql6zgA https://t.co/YnmfNAwgvw This VR workout helps you level up online and in real life https://t.co/tUicsWfYPO Bring the spa to your home with this personal sauna https://t.co/oP8LMO6FLP 'The Grudge' reboot's first trailer is here, and please pray for John Cho https://t.co/fK9hatyF7u https://t.co/qbsK3B03SP Keeping floors clean just got a lot easier https://t.co/fXWR6uXC16 So.Many.Cigarette.Butts. https://t.co/3rZ6pEaZy2 The new AirPods Pro are here and they've already delivered memes https://t.co/sqEAtN3apK Scientists have found a potentially super cool replacement to lighting https://t.co/iuRmVzI4Vn 15 spooky stories that will keep you up at night https://t.co/mvHSn1fOS5 Declassifying your pets on Twitter is a thing now https://t.co/evgGaZRnwz This trash can crushes your garbage to save space https://t.co/8VONRGwHOJ You can now bike through the snow https://t.co/7Anq9EMFGO These are made out of manila envelopes 😱 https://t.co/S959fUf0VK How can we achieve this level of relaxation? https://t.co/J5PCsmUXDi Diaper changes just got a lot easier https://t.co/7Se3eGaPEb This device could help people with limited vision https://t.co/aFa91TWHxd This hologram \"dances\" on your fingertips https://t.co/ztY7fYJWLp Who will bear the burden of America's nuclear waste? https://t.co/yA90AbNgnz This device is here to help you de-stress https://t.co/Ptj8d1jZDr Guy absolutely nails his 'woman yelling at a cat' meme Halloween costume https://t.co/hE55MlFctP The infamous 11 foot 8 Bridge is being raised and the internet is sad about it https://t.co/OfUV8lOhUc This device is basically a flying Segway and we want one now https://t.co/w0qQXmJvyn Join the the vinyl re-revolution and get ready to drop the needle on your own vinyl starter pack. Here's how to find the perfect turntable for your listening style. https://t.co/GccPQNOXFx @Walmart #ad https://t.co/LfYlIWiPol There's a cut 'Office' Halloween scene you haven't seen in years\nhttps://t.co/rLRhycaLs9 This device will make your life much easier at the airport https://t.co/BHntJUAT6g Relaxation with a little thrill! https://t.co/aRGZHlpO8Y Trump was served a Halloween-themed meal on Air Force One and it's...cute? https://t.co/T6ZtC10Gav This isn't terrifying at all... https://t.co/5gWNsWuuav The new AirPods Pro are here and they've already delivered memes https://t.co/NnkIFr9Hmn Hundreds of Facebook employees slam company's political ad rules in open letter\nhttps://t.co/LprMCp9ePN https://t.co/9bEW3iQE8z Facebook kept removing his fake Green New Deal ad, so now he's running for office\nhttps://t.co/u44FNBraTb https://t.co/EQUo0V4acE This student is playing a 3D printed violin https://t.co/doaq7ng0Tg 15 spooky stories that will keep you up at night https://t.co/HibRUc8Ozi THIS IS ADORABLE https://t.co/wI0VeSZ3ID Trump's latest merch is a bad rip-off of the legendary 'Hocus Pocus' poster https://t.co/cPfIO0Rtr7 Stay caffeinated with this portable espresso maker https://t.co/JhVugAhja3 Apple drops iOS 13.2 with Deep Fusion, new Siri privacy settings, and AirPods Pro controls\nhttps://t.co/4f4etGurTu https://t.co/MsXHfh2Amw For all the lazy dog owners out there https://t.co/tIn2syWNBi Top 20 worst Halloween candies we need to stop giving out https://t.co/aF1eE7Xof7 https://t.co/rPMan9zB57 This spoon is designed to scoop every last bit of goodness from almost any jar https://t.co/U6Wx9030yJ There's a cut 'Office' Halloween scene you haven't seen in years\nhttps://t.co/4FxrtGYPSy We are obsessed with these holograms https://t.co/2VmpoQmBIP The #PopeyesChickenSandwich is coming back and it's bringing lots of Chick-fil-A shade with it https://t.co/pDhnfbTJe3 This suitcase takes organization to a new level https://t.co/OhAoRXWgce 'Luigi's Mansion 3' is as good as we'd hoped, maybe even better\nhttps://t.co/KamE6EjFuo The infamous 11 foot 8 Bridge is being raised and the internet is sad about it https://t.co/PryDtierB9 Guy absolutely nails his 'woman yelling at a cat' meme Halloween costume https://t.co/qeoQcbnIjX This coffee cup is also made out of coffee... and meta just got sustainable https://t.co/SZqkYol9h5 There appears to be a human drawing time inside this giant clock https://t.co/hizSkfc3gy We tested that AI tool that lets you see what your pet would look like as another animal 🐶😼https://t.co/X88e6NbSwc This house can literally be built and ready for use in just hours https://t.co/6sGaVA5Aqr 'Watchmen': Everything you need to know from the comic after Episode 2\nhttps://t.co/QNjXo9MQTk This weird water vehicle is half boat, half submarine 🐋 https://t.co/Q4yJy8GmG8 Finally! Apple reveals $249 AirPods Pro with noise cancellation https://t.co/HOIG3YEvkf Trump was served a Halloween-themed meal on Air Force One and it's...cute? https://t.co/O7I903EbgV This device turns any manual bike into an electric vehicle in seconds https://t.co/VtlMJqY9nk The Popeyes chicken sandwich is coming back and it's bringing lots of Chick-fil-A shade with it  https://t.co/aToFpOpztM Master chef sculpts impossibly realistic pastries that look just like fresh fruit https://t.co/jhjvHARQMQ he future of food is here - and it's 3D-printed https://t.co/6H3pazFkXH Did you know vinyl sales are poised to outpace CD sales for the first time since 1986? Here's everything you need to kick start your vinyl record collection. https://t.co/Q1zjKyJX2S @Walmart #ad https://t.co/0sMT8IQKW4 This autonomous truck could totally transform the construction industry https://t.co/5Vr02ie5B5 'Luigi's Mansion 3' is as good as we'd hoped, maybe even better\nhttps://t.co/Iwlz0GAWDN 'Watchmen': Everything you need to know from the comic after Episode 2\nhttps://t.co/2Rnc0fa2FS Say goodbye to doggy bath time https://t.co/Q6lSmR6Wvb 15 spooky stories that will keep you up at night https://t.co/EQETICg9l8 Who run the Red Planet? GIRLS. https://t.co/1v1g6yJwbW Bye bye germs 👋🏻 https://t.co/mNWodnbvXH NVIDIA's new Shield TV ups the Android streaming game\nhttps://t.co/q8FWRtKsJY https://t.co/6QecnXxmbA The Boston Dynamics robots just keep getting more and more terrifying https://t.co/RyQUUicequ Robots can basically do everything now https://t.co/9krkGG305L What's in an iPhone? These scientists made an iPhone smoothie to find out https://t.co/IU4CEmUumG Tension and star power make Apple TV's 'The Morning Show' unmissable\nhttps://t.co/RmJl9qysiU Why camp by a river when you can camp on one? https://t.co/WQ7d5N1yC8 A Chinese news agency unveiled two AI anchors https://t.co/pT9RpNaTK3 Jennifer Aniston! Reese Witherspoon! Steve Carell!\nhttps://t.co/fjlvDXBDvC For the love of art ❤️ https://t.co/xBCt7aCMSV Watch Trump and Melania get booed at the World Series  https://t.co/tKJBtmwt7f This device lets you cook food on the go without a flame https://t.co/Ifa5yyTXu1 The Popeyes chicken sandwich is coming back and it's bringing lots of Chick-fil-A shade with it  https://t.co/B6l9YSDncM 'Silicon Valley' reaches the beginning of the end in Season 6: Review https://t.co/wgfZQH0lpA This egg-shaped capsule is actually a smart, self-sustaining home https://t.co/F2otkGSROs Tension and star power make Apple TV's 'The Morning Show' unmissable\nhttps://t.co/lzyrXcknKv A mince pie sandwich now exists and honestly it looks kind of delicious https://t.co/FFtI7oaBnu https://t.co/bEGAYOcCUR Fall asleep anywhere with this wearable sleeping bag https://t.co/inMiv5Wouz How to recycle all of your Amazon packaging https://t.co/uKIO5DHF5q https://t.co/zqHWuJLJ9x Best. Cakes. Ever. 🦄 https://t.co/rNacQYhcid Finally your cat can take a road trip without freaking out https://t.co/eugJjI3WxB Apple's iPhone SE 2 will come in late March, analyst claims https://t.co/aSKDEfJlg6 https://t.co/CNXDghfDBq Now you can explore the ocean without all the bulky equipment https://t.co/NXeIcIvdUp Brave soul channels 'Fleabag' character's terrible haircut for Halloween https://t.co/HP1KX9kS2J https://t.co/cDaViN9Yjo This portable air conditioner is actually solar-powered https://t.co/aqcDfiET1B 'BoJack Horseman' fans are getting pretty frustrated by this 1 thing https://t.co/1GtZPKYYl5 https://t.co/5OndRJwcQI Take the pain out of traveling https://t.co/WTxzPfdaqO Improve your posture with this neck exerciser https://t.co/xJFbY38w4L Would you eat a potato fork? https://t.co/Aald7sGGBR Not your average jet ski https://t.co/5Abg6na9kh John Oliver slams Trump's messy position on Syria https://t.co/F7a4SNeJJm https://t.co/Y3j6OdLwmz These chocolate faces are tiny works of art https://t.co/G6w8Jru3I4 This sandwich has your name on it (literally) https://t.co/9U4S4QdLrM Raise your hand if you would use this 🙋 https://t.co/1xB6zfqYGv New Xiaomi phone will have a 108-megapixel penta camera https://t.co/yIF21BKD4V https://t.co/yNSPEdkUTY These proposals are... unique https://t.co/V4NiUEo8Mr This flying taxi has officially tested its first flight https://t.co/iJWx8tOpTP This wearable device turns you hand into a keyboard https://t.co/eT472fkxNl These devices are vacuuming plastic from our oceans https://t.co/o2aZLmxXwD Welcome to the world's largest interactive mini museum https://t.co/YsEgdTtcSf Get from point A to point B in no time! https://t.co/1DgFFUaqx9 You don't need waves to use this surfboard https://t.co/c0Fwo1ohnl Watch John Cena and Jimmy Fallon play Fish Slap, which is exactly what it sounds like https://t.co/sGmNFY6YxL https://t.co/9aXNtcRh5U Who else NEEDS this table? https://t.co/ZShxyY1Ja0 We could watch these allllllll day https://t.co/fXg0wjOCPR You'll never have to buy another pair of shoes again https://t.co/QjILDlMFlV Why carry your purse when you could have a drone do it? https://t.co/POieg9LS3V This interactive performance combines dance and art https://t.co/hYhNNWZhEy These robot snakes slither on their own https://t.co/vNApziszd0 Trump probably thought they were saying 'boo-uild the wall' https://t.co/ExogH9wvYb Minimalists, rejoice! https://t.co/i4PvAfwRqL #SiliconValley takes a big swing at the tech gods https://t.co/vE6UNBxlur This dessert is stunning https://t.co/hAMoSJQe0r This company transforms old shipping containers into swimming pool https://t.co/5J85R2X12N Is this the ultimate tiny house https://t.co/NFnASiSdEK So uh, what did you think of that wearable chair on #SiliconValley? Here it is again: https://t.co/UrxnrrWKOY These stacks of blue ice are beautifully photogenic https://t.co/uRU3lhGInj This home robot wants to be your friend by keeping your private info safe https://t.co/znFmQcXGmN This pencil has a dual purpose https://t.co/KNKt3Vd3dS Watching this foam transform is like construction magic https://t.co/Ozy2KLoc0m This robot is half Segway, half droid https://t.co/NqP9ybtbcx Never lose track of your dog again https://t.co/dVOyudfcdF There's an important civil rights battle playing out online and in the courts right now. https://t.co/DKKK2TugmN This bike will definitely get you noticed on the street https://t.co/joMMptmCuw This is a robot for all the lazy people out there https://t.co/bejP8a5DxS These underwater lawnmowers are making rivers cleaner and healthier https://t.co/RT4GRTpBaA How to recycle all of your Amazon packaging https://t.co/EFcDKC8yUg https://t.co/QkMD1vZCAN Watch these sculptures disappear before your eyes https://t.co/cz6mmyoXKJ The ASMR trend isn't going anywhere https://t.co/dibUtT4aXl This food is almost too pretty to eat 😍 https://t.co/tTQbNYQicS He's using the money to pay off the medical costs not covered by insurance, because that's how we roll in the US of A. https://t.co/YxoOZLEiyl Just what we needed: More screens https://t.co/sOqvn1DT4w Ever had dinner with someone who can't stop checking their phone? https://t.co/p7NG3nVRwY These sushi pieces are straight up gelato https://t.co/yVSxsbSt1W This robot loves grooving to U2 https://t.co/LEsExd3JZb This unique artwork actually responds to movement https://t.co/W9yohPmzms It's time to stop murdering your plants https://t.co/wjsAikCNvA Emilia Clarke, the Mother of Dragons herself, celebrated her birthday on Saturday. https://t.co/AA6Dcf5yxW It's really more of a high altitude balloon. https://t.co/GWwbC1fEdC Someone didn't totally think this through https://t.co/xuOmqjWp9u Alternatively, maybe it's time for an upgrade? https://t.co/dGDbYsi6nA Witches flocked to the water over the weekend for annual charity paddleboarding events. https://t.co/w6pMyGuNIY Google is inventing thousands of new sounds https://t.co/6kfKFr9DPq Cinderblock is all of us. https://t.co/b3S1bE7JkC Become a secret agent for a day at this spy museum https://t.co/higIQUTYz3 This Tesla competitor has 3 wheels and only costs $10,000 https://t.co/muXAMVXyWt These incredible sculptures are like nothing we've seen before https://t.co/XHMEg0uMOK Monsters are taking over NYC, thanks to this artist https://t.co/XNuXurujA6 This bear is really feeling the spirit of fall https://t.co/tI8RctCjUB Can it tell me where to find the crunchiest leaves to step on? https://t.co/GWnz9T3Fzi Watch out Tiger Woods, this self-driving golf ball is coming for your titles https://t.co/1HxarN3NQz This ring is 100% lab-grown diamond https://t.co/279wNqxwbo This autonomous truck could totally transform the construction industry https://t.co/6wcKkAP30I Even now, Plath's career continues to unfold. https://t.co/lJWp6kOei4 Threepio stans please stand up https://t.co/KoJdtKg3Az Here's the only Halloween movie list without The Shining https://t.co/jefvMg0lxY This flying car is giving us visions of the Jetsons https://t.co/9UpUR4xhVn This backpack could save many lives when disaster strikes https://t.co/sDTi8xB78e Banana is the new leather https://t.co/DVtO27StdE Before going out, \"Silicon Valley\" takes a big swing at the tech gods https://t.co/I1S6B5fOEI This gadget will give you perfect cake slices https://t.co/NvRtidKm8r This glove could be the future of physical therapy https://t.co/pMsADvWAFy When a rainy day college football game takes a trip down to Bikini Bottom, magic happens. https://t.co/1mIyC4KYUK This wearable AI translator could change the way you travel https://t.co/iOqnMAG56K LED snowboard prototype lights up the slopes https://t.co/W3mdIdla9q Jason Momoa's surprise 'SNL' appearance almost brought the house down. https://t.co/EgsnMFh2wz https://t.co/A3xgBjtsX9 Strawberry robots forever 🍓 https://t.co/1CZIBdwE1m This vase doubles as a fire extinguisher https://t.co/trr3LvLQ1d The Internet Archive released a ton of retro games for free https://t.co/i918XJfvJ3 Chance the Rapper gets murdery on 'Saturday Night Live' with delicious Tasty Toaster Tarts. https://t.co/XwEM4TksGV https://t.co/uDsqwOsopw Water becomes magical with this gravity-defying device https://t.co/e0LaiPUbXp Chance the Rapper gets hilariously confused by esports on 'Saturday Night Live'. https://t.co/RNIbjHQjlm https://t.co/oZQHbFfWzz These cute little cones are not what they seem https://t.co/QbOXTEz3Gq 'Saturday Night Live' Weekend Update tackles Giuliani's butt-dial, Trump's bizarre Saturday tweets. https://t.co/7wYZh8r94d https://t.co/jGF9E2njWT How's this for fitness motivation? https://t.co/b3f4BkjCK2 Trump bonds with Bill Clinton (Darrell Hammond!!) and Mark Zuckerberg on 'Saturday Night Live'. https://t.co/viLQ6qXngm https://t.co/O2mHPQtnyR The rise of edible plastics, from whiskey pods to potato forks https://t.co/9He0qxU7iu Calling all #StarWars fans https://t.co/j7V42619TG In the farms of the future, tractors will no longer require human drivers https://t.co/etJua7Xec0 This robot fish will help us spy on shy sea creatures 🐡 🐠 🐟 https://t.co/xjqnZCnF8w This rocking chair knits you a hat as you sway back and forth https://t.co/znIpRLcTZP Is this the future of furniture design? https://t.co/6YvFUUG7N4 This robot is super dexterous https://t.co/vWYhWNGTjt This alpine skier tears down the slopes with the best of them - and she's legally blind https://t.co/wV6Y9pBWta Now you can have your plate and eat it too https://t.co/sS36xW7Z2L We've got little engineers in the making https://t.co/UmsovYzHLV Who needs a car when you can use this bionic suit instead? https://t.co/WBnL0tCuRx How to recycle all of your Amazon packaging\n\nhttps://t.co/5Pw7GkOCAX https://t.co/4XFmbxh8AL Turn your selfies into art with this 3D AR makeup https://t.co/8cUwq3OpUl This AR app lets you type in a 3D space https://t.co/RmzKRElM7R This robot's sole purpose is baking cakes https://t.co/ioJ6NVdYJQ These drones could help protect endangered species https://t.co/4AzlciA85e These robots built a bridge all by themselves https://t.co/z2g6LeJZ1Q This AR app can translate sign language in real time https://t.co/RbwSr3CqAI We could watch these intricate wind sculptures all day long https://t.co/vBZeoqOFsy This robot is breaking the rules and drawing on walls https://t.co/si7uVbOibe NASA wants to break the sound barrier without all the noise https://t.co/z42vrPPBYJ These metal animal sculptures are so realistic, you may need to do a double take https://t.co/aZNusvc2hr These highway pillars are turning into vertical gardens to help fight air pollution https://t.co/8HMkSiHSmw This suitcase could make traveling with a baby SO much easier 👶 https://t.co/rk8ATRQSWP Take a deep breath, and let these mesmerizing doodles calm your soul https://t.co/CNJzbFLVGE Finally! A better way to take those midday nap breaks https://t.co/Xt44wA4IVm We can hardly believe these aren't photographs https://t.co/8rTnNxSM2V Serato pranked us good with this faux Tesla collaboration https://t.co/9fJQmQsmCG Now you can have a roommate without the commitment or the dirty dishes https://t.co/k5fZn6gEiO Technology + art = amazing clay sculptures https://t.co/8PnTp7Nhgg Scientists are growing vegetables in Antarctica in preparation for space colonies https://t.co/uTV3luFRj2 Which robot would you root for? https://t.co/TM9EFyscni This AR headset will make you feel like you’re in a sci-fi movie https://t.co/0PmOKYHKdD Spread the buzz — this beekeeping app could save bee populations (and your food) https://t.co/bu2QFawjNc The handwriting of some of your favorite musicians are now available as fonts https://t.co/s1nLqFpYwO Turn your hand into a computer mouse with this new wearable device https://t.co/j0wcd5yXUT This man scanned himself and then created the tallest 3D printed human sculpture https://t.co/O3QQe8Mlvj This space hotel is taking reservations for a cool $9.5 million https://t.co/bwpZt1DPQU This artist uses magnifying glasses and mirrors to paint with the sun https://t.co/QyKyfUfM3u Jelly Mario is the trippy, slow motion version of your favorite game https://t.co/tFTEarix5j These 5 helpful robots want to be your new best friend https://t.co/FVSdg6aOdq These adorable service pups spent a day at Disneyland https://t.co/fXFAYWN7Zl NASA researchers have found a way to grow wheat on the International Space Station https://t.co/q3sQSS3x76 A neat little Easter egg for new Pixel 4 owners. https://t.co/RaHThlnlMD This female sushi chef explains why you almost never see women making sushi https://t.co/DgC0ql6VFE We'd like one of these in an adult size, please 😍 https://t.co/iPP8XdxZSo This great dog driving a motorbike on the highway is so happy with life. https://t.co/NdWHBOQnyu https://t.co/vD1T07MVxY From juggling to playing the guitar, these prosthetic fingers are helping people do the things they love https://t.co/nECiEuQevS This road can charge vehicles as they drive on https://t.co/q4EjRsGDxS These minimalist sneakers are also super eco-friendly https://t.co/SZfMotc7GL These gardens are in some pretty unexpected places https://t.co/TPrhJhaPQD Jane Fonda continues to be a badass. https://t.co/BIOqU6qDme This cute robot is a hacker’s ultimate nemesis https://t.co/OI3V1X2UDj This 3D-printed house took only 48 hours to finish https://t.co/f40Vl1ZzcX Traditionally, rodents don't operate motor vehicles. It's mostly a human thing. https://t.co/4C5i715rRX We're not quite sure how we feel about these videos https://t.co/fqFMvo4j7n The search for answers continues, but hard data is starting to pile up. https://t.co/DrdqhOLBV5 Robots can now assemble Ikea furniture and we've never been more grateful for technology https://t.co/5pak0tGEXU Roaming charges are such a pain. Even for eagles. https://t.co/PAOjqgHTke Every good doggo needs one of these https://t.co/LAObXEr0EX \"Bye, bye, bye\" - Jessica Biel to NSYNC https://t.co/HMTiQnANrI Who? Why? What? When? Where? How? https://t.co/7LKcQyIZxM Oh, this 7-Up? Gonna cure my headache somehow https://t.co/yBN8IWlAvi The world's first flying motorcycle is gonna be a reality in 2020 https://t.co/INukVhWFl7 Welcome to Mario Kart IRL https://t.co/kki1PTDnCS Yeah stars are pretty, but can you count them all up? https://t.co/5GyCxU0zdS Hell is 44,000 screaming World Series attendees doing the 'Baby Shark' dance. https://t.co/GxLpJQiqOt Who needs scaffolding in the age of drones? https://t.co/0WUwoy4kxb Microsoft got a big win over Amazon to close out the week. https://t.co/TAlpn4ggDf And now we're crying https://t.co/Y09WeAiTQT Ryan Reynolds is totally chill about this. https://t.co/o5eqcCtCsw Why walk around the airport when you can ride your suitcase? https://t.co/VBxi8PK08r Say goodbye to doggy bath time https://t.co/8NPIemuGXq TIP 👏 YOUR 👏 UBER 👏 DRIVER 👏 https://t.co/0xU865Lm8F A Dutch sculptor spent 27 years building giant kinetic creatures https://t.co/TWQMODoFri Do you ever sit there and think 'I could use another thumb'? https://t.co/xI6GMOS1QK Is this octopus the world's best escape artist? https://t.co/C8xwcWutZp A new runway could be coming to an airport near you... in 2050 https://t.co/z9SjQor0T6 The unique designs of European city streets are being turned into wearable art https://t.co/kAsOcGCpnQ 5 celebrities you probably forgot guest starred on 'Friends' https://t.co/LZK7xFoVIl When's the last time you cleaned your tech products? https://t.co/7kGqt7yzxq Turn your selfies into art with this mini smartphone printer https://t.co/J98L6kl39M Here's what you're doing wrong when it comes to recycling https://t.co/wgK8JmXd2T This awesome coffee stirring device will help you cut down on plastic use https://t.co/GUCgZ0rHCP Bored? Why not tour the moon? https://t.co/dR1iOSdFHw Meet Daisy, Apple's recycling robot https://t.co/cPdBF2Ypv4 Your workout just got a little more futuristic https://t.co/kdrnzktSyc These domes simulate the air quality of heavily polluted cities https://t.co/T5ehXq5CsW These sneakers are fulfilling all of our nerdy dreams 😍 https://t.co/envOkK2T8K This AI software can predict and fill missing pieces in photos https://t.co/Q4lBi6EWCD Infants in developing countries can receive proper birth records thanks to this biometric tool https://t.co/vIFSuN8nox The Cincinnati Zoo has saved more than 50,000 bees https://t.co/VPL3nk3v2O ‘Sonic the Hedgehog’ is teaching AI how to learn https://t.co/1wKobKSdbD These VR gloves allow people who are blind to “see” art for the first time https://t.co/sZAdLKthrX This puffy robotic arm looks like Baymax https://t.co/SDZgQiyE9A Michael Phelps breaks down for us how he runs his Instagram account https://t.co/uPSYw9daCs Desmond Is Amazing is the future and we're here for it https://t.co/R8laUh1kul Now anyone can own a famous painting thanks to this AR app https://t.co/O1w4fXtyZG Say goodbye to building your furniture https://t.co/zFpxO9bzyZ This high-end gaming gear was designed by esports pros https://t.co/OtksApoJDX Researchers at MIT are now able to program water droplets and move them individually across surface https://t.co/F1He6fFYto You won’t be able to resist virtual reality once you try on this headset https://t.co/ebgwdTGiM4 Here’s the technology behind those mesmerizing drone light shows https://t.co/Y5SasXVMh7 Watch not one, not two, but three giant submarines emerge from beneath the Arctic ice https://t.co/ds3HpMFDmb This woman is shaking up the conservative world of auctioneering https://t.co/1XrLWyr8P0 These water taxis could make moving around cities easier https://t.co/pqhsDnERWU Look ma, no hands! https://t.co/UrPyPRkIT5 The fashion industry is super wasteful, and this man has a solution https://t.co/nAgD69T3Tq You know you’re getting old when you remember using these phones https://t.co/f5A1MSGpK3 A new way of cycling is coming with airless tires that never go flat https://t.co/78K0WiwWPk These kids get to run around school for 15 minutes every day and it's improving their health https://t.co/ao4lws2AZX Can't. Stop. Watching https://t.co/9yq7XoHD9R This is how self-driving cars \"see\" what's going on around them https://t.co/ktovpYQ6kb We traveled to a recycling plant to see how our trash becomes another person's treasure https://t.co/GAJ3chh5WV MIT researchers developed a wearable that can communicate with the voice in your head https://t.co/Y1nbUUWzgZ These glasses can help people with disabilities use technology without their hands https://t.co/96gkyUfyNf This artificial human cornea only takes 10 minutes to 3D print https://t.co/9jAXT9NkXp This city is 3D printing a tiny neighborhood of sustainable homes https://t.co/9lmZkBkQBQ The next version of Tesla's Solar Roof is here https://t.co/RDd282iBZM This boy's life is changed when he is gifted color blindness glasses for the first time https://t.co/jTEeMYqnJG Donald Trump has a message for 'Tim Apple' about iPhone design https://t.co/TAVzMnRnET The future of the internet could depend on submarine data centers https://t.co/ayaHPKnLRz These shoes are made out of an unexpected material... chewing gum off the streets https://t.co/nBvgx7P73L People are making fun of Rudy Giuliani butt-dialing a reporter https://t.co/WLYDDCnzhM This leg suit lets you sit anywhere without needing to grab a chair https://t.co/itzPtAyDVO These sharks appear to 'glow' in the dark https://t.co/sRTSeiRwjr A teenage millionaire built a real-life Dr. Octopus suit https://t.co/tfFRZt33kb A coalition of YouTubers is tackling the climate crisis https://t.co/ROEw6zZ54N This electronic “skin” can bring touch and pain to prosthetic hands https://t.co/AlUH0van2W This prosthetic ankle is a game-changer https://t.co/Spa6gy29UC We got to see how Microsoft tests their devices to death https://t.co/xfloY2Ab5A People are making fun of Rudy Giuliani butt-dialing a reporter https://t.co/zgJPgQd2Ye Space is dirty and this satellite could help us clean it up one day https://t.co/nlhm7o0sEC Don't butt dial like Rudy Giuliani https://t.co/V0LoWDjyW1 Adobe exposed nearly 7.5 million Creative Cloud accounts to the public\nhttps://t.co/FYBISkreTy https://t.co/xn3NDDcZKZ The military is developing a shapeshifting wheel https://t.co/bolGqyFU0t Kanye's 'Closed On Sunday' Chick-fil-A shoutout has cooked up a lot of memes #JesusIsKing https://t.co/6ztcoYFJJs Not sure if we should be amazed or terrified https://t.co/euxJGYbM6D Watch Mark Zuckerberg duck a question about including Breitbart in Facebook's News tab\nhttps://t.co/t5RX9xMOMW https://t.co/wvjJJJlzpw These floating neighborhoods are affordable housing for students https://t.co/4Q1g5qC3L5 A family of 5 now lives in this 3D printed home https://t.co/E5RDUoBNym Facebook ad showing Lindsey Graham \"endorse\" the Green New Deal is a sign of what's to come https://t.co/ypYLjMkob1 https://t.co/R4JtfPVCFj This woman is cleaning up the streets by turning old chewing gum into new rubber objects https://t.co/aXWM7k4Twu 'Call of Duty: Modern Warfare' tells a story about terrorism. It's not great.\nhttps://t.co/RD1kaxwB1e This robot has human-like fingers that perform immensely complex tasks, like unscrewing bottles https://t.co/SFVa0EILJJ 'Call of Duty: Modern Warfare' tells a story about terrorism. It's not great.\nhttps://t.co/PlfLqw4bKi This floating park is made entirely out of plastic debris https://t.co/lcDqGjRSED We know you wish you were as cool as they are https://t.co/8S4CZ76Zmh Celebrity birthdays are inspiring more and more people to donate to charities https://t.co/4asjCDTyXv Miami is prepping for flying cars https://t.co/7RlbIdhKTv This is an exercise craze we could get into https://t.co/LXnb4Abpm5 Mars here we come! https://t.co/HbwofJAxoz Please look at this ridiculously photogenic puppy at the vet https://t.co/DfS5vahCtF https://t.co/Ca5kUAV03o Who run the Red Planet? GIRLS. https://t.co/Ue8nyft7KP So like...no more cleaning our sheets, right? https://t.co/ARog9VXUpP Google just added a brand 'new' way to create calendar events https://t.co/6rXRhoJzBQ via @PCMag Looks like I'm not leaving my apartment this November https://t.co/4Yri8BkLue Netflix and Spotify could one day send you emergency alerts\nhttps://t.co/wyuagPxk46 https://t.co/AmKRhGWSTJ The pop-up will give the option to read why the post was flagged https://t.co/hodxpU8p7s This app wants to be like Instagram, but for litter https://t.co/BMyn0j1FBw This bear is seriously cute and a seriously good teacher https://t.co/4rU8EXwgJy We still call it 9 Fast 9 Furious https://t.co/ij581PmxL8 Lizzo just took a DNA test and turns out she's 100% responding on Instagram https://t.co/iC25bYba1O Coffee addicts, this phone case will change your life https://t.co/GuOe3gSumO 7 of the best tech gifts you can find for under $20\nhttps://t.co/E1aO2bVl9r https://t.co/FyLTgD0CNQ This treadmill is easy on your knees.... because it's underwater https://t.co/o9RdOHNHol Google Pixelbook Go review: An excellent work laptop if you like ChromeOS https://t.co/7wWlg0OdXd https://t.co/T5JO1WsALN Finally, someone has reinvented the crutches 👏 https://t.co/I1OUtC7d2Z Everything coming to HBO Now in November 2019\nhttps://t.co/W1Yx30dXsE This smart luggage is a suitcase AND a scooter https://t.co/qi1mfRSPV5 Meet the loneliest robot whose sole purpose is to sort pebbles https://t.co/7cqbUbO0XH Celebrity birthdays are inspiring more and more people to donate to charities https://t.co/8J9BKuiIjZ This advanced 3D-printed robotic arm is seriously cool https://t.co/d37fXCOYOH Everything coming to HBO Now in November 2019\nhttps://t.co/5vJmzOvJBZ Goodbye used coffee grounds, hello reusable coffee cup https://t.co/GwIynL35HO Google Pixelbook Go review: An excellent work laptop if you like ChromeOS\nhttps://t.co/OaN9FcJww3 https://t.co/FZ7WJSjthw Can you tell these works of art were made by robots? https://t.co/4f80ZaEYFb By gum, they did it! They got the job! Get 'em a little somethin' somethin'. https://t.co/8yxP0kUXhn A lightweight, prefabricated concrete roof is just a taste of the coming revolution in architecture https://t.co/rQFBMLwGS3 This tiny robotic spider might one day perform surgeries inside your body https://t.co/nFRaJuzCto These biodegradable cups could help solve our planet's plastic problem https://t.co/iZ4w57iElG These boats are created from plastic from Amsterdam's canals https://t.co/UUgkQIUPWR Ever wonder why rain smells so freakin' good? https://t.co/dw9DXCwoJo This sexy Bugatti sports car is actually made of Lego https://t.co/6IxuWMk8HK When taking pictures of litter can do so much more https://t.co/Bms5nA95qD This artificial wave pool could change surfing forever https://t.co/FMwjLbXvUQ The future of movie theaters could mean even more screens https://t.co/NB7jUP73dF When 3D printing and biology collide https://t.co/VLEwPUYGjU OK, Volvo, we see you https://t.co/IeSm3aQlbk Steve Carell and Stephen Colbert can't stop giggling reenacting an old vomity sketch https://t.co/aKdskg03VI https://t.co/2pbYuD17nC Weird fact of the day: bacteria in your stomach can produce electricity ⚡️ https://t.co/gZFdNpR6Cu Keegan-Michael Key absolutely nails Jimmy Fallon's musical impressions game\nhttps://t.co/hyb1Ugihax https://t.co/YKHPjzu7GK Defy gravity at this interactive optical-illusion museum https://t.co/u7mWJQqBlx Experts were able to reactivate the spinal cord circuits of a paralyzed man https://t.co/8x5bDW21yb RIP https://t.co/8PGgubHrLE This edible food packaging could help solve a huge plastic problem https://t.co/PXBmGLA0UG We are thoroughly creeped out by these robots https://t.co/KmfHO4rZat Meet Vector, the cutest robot ever https://t.co/SFzIjvX9yS This satellite net is cleaning up space junk https://t.co/lJOLCrL4uw This farm is run by robots and AI https://t.co/98RA7gndqT Jimmy Fallon and Jimmy Kimmel issue a joint PSA to help you tell them apart https://t.co/3SAL6ACGgD https://t.co/wkJPeLFCXm As if we needed robots to get anymore terrifying https://t.co/8JVfeZHoUN This waterpark was designed for people with disabilities https://t.co/Cwdq8TlfFF This 11-year-old is a genius and a DJ champion. Chill https://t.co/wOSH7u3y4H This isn't your gym-class obstacle course https://t.co/cOuom0q5H6 A 2,400-year-old merchant ship has been found on the bottom of the Black Sea https://t.co/C3ON6SnnCY Seth Meyers mocks Sean Hannity and Republicans' increasingly limp defenses of Trump https://t.co/uwWnfs9Jsh https://t.co/0D8UUqAfkG This Lego-like bike path is made from recycled plastic https://t.co/ZY7cF42qlP These Lego-like bricks are actually robots https://t.co/r8zA4GTWYg This man is biking on water to save the planet https://t.co/QIgANh0Vzb You had one job. https://t.co/hKVPH1GXH9 We need more inclusive playgrounds like this one https://t.co/MSpNG961w5 Turn heads with this self-balancing scooter https://t.co/La2QxWZtAC Robots don't just live in warehouses, they're also herding cattle https://t.co/juoW2jd9NA Robots can basically do everything now https://t.co/4SjCte7bQo This projector will transform any surface into a touchscreen https://t.co/pF9MadHwbA These shapeshifting clocks are absolutely stunning https://t.co/oFb6xXn3Mz This algae 'curtain' could make city buildings into urban trees https://t.co/LxsfJrkM50 Finally, someone invented shoes that could actually be 100% waterproof https://t.co/alBnv2dABm You won't believe your eyes when you see this giant sea worm https://t.co/qojE5C5ACT These drones are taking on tasks so humans don't have to https://t.co/8eNEbeVOb3 This robot is being tested on 5G https://t.co/Juh5iKwFMs Wait, is this congressman's phone passcode just 777777?\n https://t.co/b3ZeUde2Bw This eco-friendly innovation could change the way we power cities https://t.co/0GmWrzRx9w This is what happens when food science and 3D printing collide https://t.co/NLgOWsGgUC This man's weight loss journey is seriously inspirational https://t.co/jsRtq6aquc These tiny drones are seriously impressive https://t.co/IsTxtLGWsH These friends dressed up as 'The Ben Still'hers' as part of a Halloween tradition that's been going for 7 years https://t.co/xGbGzqNYFH This AR motorcycle helmet is next level https://t.co/63L5cbk2Ey Jack Dorsey trashes Facebook's Libra, say it's not even a cryptocurrency\nhttps://t.co/P73lPGUbvg https://t.co/kJsDLgtoyc This great-grandma holds a record and she's a got a pretty amazing reason for it https://t.co/0lNqByv7f5 Wait, is this congressman's phone passcode just 777777?  https://t.co/RBJmW7g4hB This 3D-printed motorbike is sick https://t.co/NSdRzZtgWQ Cyborg plants are real, and we should make more of them https://t.co/wHJn2cj26b A Dutch designer is collecting food waste to turn it into 3D printed snacks https://t.co/XWRJzPtDBh NEED THIS https://t.co/7aqpPWCkC5 Guy's attempt to make a video gets bombed by his hilarious roommate https://t.co/pl316cjrU4 This is the 'world's cheapest electric car' https://t.co/RH2EfXoIwx This wearable AI translator could change the way you travel https://t.co/6XJj1ITUY5 Sounds scary, but it might be the future of smart homes https://t.co/JFyJ4rqgJK Twitter quietly killed its secret ad-free version for fancy people\nhttps://t.co/6rm3ELWfnd https://t.co/mOL1E8Vjjb This three-in-one device is giving us major throwback vibes https://t.co/ubykT2IlGR Trump's proposed Colorado border wall has inspired a lot of Sharpie memes #ColoradoBorderWall https://t.co/33EQem0rLI Welcome to the future of television https://t.co/T0pxTE5iRE These friends dressed up as 'The Ben Still'hers' as part of a Halloween tradition that's been going for 7 years https://t.co/uBklz3ayNI 007 has a couple more secrets up his sleeve https://t.co/xGcTMI8Rj1 Maisie Williams eats spicy wings and reveals she almost missed her 'Game of Thrones' audition https://t.co/GCaWph451D Bye bye germs 👋🏻 https://t.co/Y9A4vaBUyV You can have a pet and still be sustainable ♻️ https://t.co/v4Aoke60nQ Maisie Williams eats spicy wings and reveals she almost missed her 'Game of Thrones' audition https://t.co/xxbKj1rehU 007 has a couple more secrets up his sleeve https://t.co/JB79DebuAG 'Saturday Night Live' announces Harry Styles double act in November\nhttps://t.co/qygpxkEEH5 Say goodbye to stinky gym clothes for good https://t.co/ILdySwlXBa Guy's attempt to make a video gets bombed by his hilarious roommate https://t.co/c5pU7n4F4J Earth's darkest substance is absolutely insane and a little creepy https://t.co/swONRLyExX Everything coming to Netflix in November 2019\nhttps://t.co/EdW9p2aaqL \"Hmmm, Saturn still has rings, I see.\" - me https://t.co/vhNFpGDgJh This could help you FINALLY get some peace on your flight https://t.co/sQx0Xk2TZs Trump's proposed Colorado border wall has inspired a lot of Sharpie memes #ColoradoBorderWall https://t.co/mwg6nQjTfe 'Hey teens buckling up is totes yeet yo': Cringey highway signs might be backfiring a bit https://t.co/N6XjJskKVi Why walk around the airport when you can ride your suitcase? https://t.co/QVN09ZU1oZ Republican campaign put beacons on lawn signs to track phones, company says\nhttps://t.co/fk1ZlKCyQL https://t.co/pmyh6u73R4 The future of food is here - and it's 3D-printed https://t.co/UDWHyLXPkd Joe Biden forgets to buy 'Todos Con Biden' website, now Trump is trolling him https://t.co/gJrvJoZ7uo https://t.co/hNIgcR04Lk Here's where you can get mobile 5G service from major carriers in the UK https://t.co/G0Hgx6yKke https://t.co/iAPjbdYPVw 'Saturday Night Live' announces Harry Styles double act in November\nhttps://t.co/loiI1WpLdy There's a new, rapidly spreading fire in California :( https://t.co/K6NiCBRrtS Imagine never buying a plastic shampoo or shower gel bottle ever again https://t.co/wL8vkpFhAV Who's ready to take the single-use plastic challenge? https://t.co/qWjghmlYVI There is a saddle specifically designed for kids to legit ride on their parents https://t.co/so09cGF50s Cancel your gym membership — this resistance gadget will give you the gym workout right in your home https://t.co/rowLLLYv1Y Four MIT graduates have just opened a restaurant where a robotic kitchen is preparing the meals https://t.co/FQ2pcDxJsX 'Bojack Horseman' Season 6 builds to Bojack's final reckoning\nhttps://t.co/ThEv7QDtdm This anti-manspreading chair is absolutely brilliant https://t.co/Y0GnSX8jgt Netflix's 'Daybreak' sinks an ambitious premise with misguided dark comedy\nhttps://t.co/SVkr8nWALB This super strong artificial muscle brings us closer to lifelike robots https://t.co/vXar81p0lS Netflix's 'Daybreak' sinks an ambitious premise with misguided dark comedy\nhttps://t.co/KP3gttQGzH This glove could be the future of physical therapy https://t.co/WbY1jQfJLb Everything coming to Netflix in November 2019\nhttps://t.co/O011AAbZrF LG's rollable TV is here and whoa https://t.co/MXlsXkN3WK Burning Man's hardcore anti-trash ethos is desperately needed in the wider world https://t.co/p7KV2DxWZm Calling all vloggers: This AI-enabled camera could level up your vlog game https://t.co/lGyMhOjN2G 'Bojack Horseman' Season 6 builds to Bojack's final reckoning\nhttps://t.co/l3lxG63XZp There's more to this ski slope than meets the eye https://t.co/8I8Ga6zzNA See history in an entirely new light https://t.co/bYp33CH6qR Ronan Farrow tells of a master list of 'historical dirt' on Trump at the National Enquirer https://t.co/hA4qafr3PO https://t.co/rCTV4K01bD Nestlé is ditching plastic straws by 2025 https://t.co/d9txtChBEy This standoff between a leopard seal and a tiny penguin is nerve-shreddingly tense\nhttps://t.co/AtimnLuxom https://t.co/Yh5ON8pbOz Boeing’s self-flying car completed its first flight test https://t.co/yXVUG8eNlw Greta Gerwig's 'Little Women' first reactions: An original take on a beloved classic\nhttps://t.co/CzN9ChMjXy https://t.co/TcjRyF4yc6 These 3D-printed shoes are SICK https://t.co/of620fDmrK Turns out your Mac is not invincible https://t.co/GA3scHRWrQ Watch AOC light up Mark Zuckerberg during tense congressional testimony https://t.co/VlMIHyWZsz https://t.co/l7C02dC8g7 This LEGO truck is pretty impressive https://t.co/cGzqc935Oh Nothing creepy about this 14-inch tall robot. Nothing. https://t.co/dBwCEgFZGt Lilly Singh dances to angry YouTube comments about her and it's a work of performance art https://t.co/bNLBpHRmmK https://t.co/UULrdUGjzg You can run but you can't hide from single-use plastics https://t.co/GxkN75jNGF Welcome to the future of location tracking https://t.co/eBe2Qa9JMC Seriously, is there anything robots can't do? https://t.co/65CwqrdIJV Simone Biles casually busts out a backflip during World Series pitch https://t.co/cCDMLENUPw https://t.co/V9pIwRMtny You've never seen a 3D printer like this before https://t.co/ye1WoDu376 This could be a huge privacy concern in the future https://t.co/HVsUAcGqL6 Demi Moore glugs a disgusting mayo smoothie to dodge a very awkward question\nhttps://t.co/syx3yG05hE https://t.co/iHftOaVm41 This exhibit is filled with art made entirely by AI https://t.co/19i86EDoqC Just because you can buy it, doesn't mean you need it https://t.co/mslEqohz6v Health is wealth, friends https://t.co/sVceXy407t This tiny robot is basically an all-star gymnast https://t.co/Pu6JnMnq4F These photos are no joke https://t.co/pJBAeKNiHg Ever feel like the internet's watching you? https://t.co/aXcw0PaDvy This robot has no limits https://t.co/VirQXu3ua2 Trump's incredibly weird Syria 'victory' speech leaves Stephen Colbert speechless https://t.co/986stN7bor https://t.co/5HSt2pUbkE Job interviews are about to get a LOT weirder https://t.co/cJLJuL2ajF Conan talks 'Death Stranding' with Hideo Kojima: \"What is wrong with you?\" https://t.co/d9JkewpwT7 https://t.co/PothAvfcxL AI just keeps getting cooler and cooler https://t.co/PL2E9yQasD We took a tour of an underground farm in NYC https://t.co/N9DzzbAPDd Seth Meyers roasts Republicans' messy, angry protest against Trump impeachment inquiry https://t.co/pLReIkr3A2 https://t.co/i2dVelVhqB The \"internet of the body\" needs protection too https://t.co/Ww1zLwh6u7 The 2020 Olympics are gonna be pretty hi-tech https://t.co/SlGRpKrH6U The best inventions come from the least expected places https://t.co/fXHfWoEUYj This underwater restaurant is also a marine life research center https://t.co/lhVhwbni4L This self-driving bus is totally futuristic https://t.co/VQs1VfRYsV This could be the beginning of home robots https://t.co/bJTSyb3NCP Could this airport be any cooler? https://t.co/8fznHi986o A whole new way to grocery shop https://t.co/WOcCd1igq8 This taxi is next level https://t.co/76YLWhJinb Here's what Elon Musk's just promised about self-driving cars. And what you can really expect. https://t.co/4w3WramOYM https://t.co/IVxJbgg7wf This fully-electric concept car could be the future of transportation https://t.co/xKncqp8bCF Come on, grab your friends! https://t.co/8X8EPKmghy One small step for that robot, one giant leap for automated deliveries https://t.co/kaXv5jECdl Watch AOC light up Mark Zuckerberg during tense congressional testimony https://t.co/9NltjdnR4f https://t.co/Fiu9mBBX3B Astronauts could be living in these 3D-printed buildings on Mars one day https://t.co/o1ICTP61BP So. Many. BTS. Dolls. https://t.co/bnPMLE3m2V The McHive is keeping bees safe https://t.co/8RGVOgwIzq Blanket thieves beware! https://t.co/mSdFBrzi4h Rep. Rashida Tlaib grills Mark Zuckerberg on Facebook's hate speech policies https://t.co/IXeDrZx8xV https://t.co/JegBAfoEXy This robot farmer can harvest tens of thousands of raspberries in a single shift https://t.co/Sk1qcouAHL California power blackouts start again to avoid sparking fires https://t.co/6SshtPdstl https://t.co/pJKq46BbE5 This flying motorcycle sure looks...interesting https://t.co/jAzQPGAgiV Lizzo credits viral tweet for the most iconic line in 'Truth Hurts' https://t.co/upZJSeUgP9 https://t.co/jJDAcnzacI Meet the artist who uses her gift to celebrate blackness https://t.co/vMJpQNd0kY The 15 best horror movies currently streaming on Netflix\nhttps://t.co/ooLBjuFef3 Can you tell the difference? https://t.co/qcBl9ivyHI Rough terrain? No problem! https://t.co/2ziUbS2pld Google's new experimental wellbeing tools are very interesting https://t.co/tjOGZolX7d Time for take off https://t.co/lVYMWbhaTO New Mexico has the potential to become the future bearer of more and more of the nation’s nuclear waste https://t.co/YOlB5UaKgR The door handle of the future is here https://t.co/IFW2oCiiVT Strawberry robots forever 🍓 https://t.co/tuq1bTMGPQ Watch @AOC light up Mark Zuckerberg during tense congressional testimony https://t.co/uMb9nYudKC Who run the Red Planet? GIRLS. https://t.co/PZxkDOKt4s These aren't your average plants https://t.co/U1YqowXrqC TIP 👏 YOUR 👏 UBER 👏 DRIVER 👏 https://t.co/H3BBH1IKIN Study claims Twitter is full of Trump's greatest foes and most devoted fans https://t.co/qTTMEPcKUG Lizzo credits viral tweet for the most iconic line in 'Truth Hurts' https://t.co/fPqDLd95Wr https://t.co/Hj9lO9PrtO E-bike, but make it retro https://t.co/QG1CCMVzFg Never lose your smartwatch again with this touchscreen projection https://t.co/DIvHQZxIM8 California power blackouts start again to avoid sparking fires\n\nhttps://t.co/vAUtaDMEPr https://t.co/CZBr5jtitZ This 3D-printed bio-wall is making headway in sustainable architecture https://t.co/aQScnVdGTU Watch @AOC light up Mark Zuckerberg during tense congressional testimony https://t.co/e04c5ZbhHH https://t.co/pdDXy11EwN Rep. Rashida Tlaib grills Mark Zuckerberg on Facebook's hate speech policies\n\nhttps://t.co/vT8UdbI6DS https://t.co/rPZ3wjWfUE Mazda goes electric and concept cars garner attention as the Tokyo Motor Show opens  https://t.co/IBxGZQzax1 Planes, trains and automobiles all wrapped into one epic hybrid https://t.co/eQYF6Vzyd3 12 gifts for a first-time weed smoker https://t.co/CQO9y6Y2w7 Could pizza really be a healthier breakfast option than cereal? https://t.co/DzFpO88Seq Everyone, meet the 'ravioli' starfish https://t.co/yQvgVeFKo3 This robot will do the dirty work, literally https://t.co/ihXypPoJHl This robot could totally change gardening https://t.co/KPxKGlmDO4 Aaaaand the Mom of the Day award goes to... https://t.co/XxSwscAhzo Mark Zuckerberg arrived on Capitol Hill Wednesday ready to discuss Libra. Congress took the opportunity to grill him on everything else https://t.co/rr7tmHqHOU Watch Mark Zuckerberg fail miserably when asked about civil rights https://t.co/P03LWMBHOb This home-grown algae is equal parts home decor and air purifier https://t.co/rPkqMBcMjb This could be the bodysuit of the future https://t.co/GQgbnYopZG The newest hardware from Mark Zuckerberg does what it's asked to do, but that doesn't mean everyone will want it https://t.co/QOqfCq0lqJ A new meme on Twitter pokes fun at pop culture gatekeepers https://t.co/dvSzWR8Mjt Meet the women fighting sexism on Wikipedia https://t.co/s6Rroe1ihZ 18 things you didn't know about the 'Diversity Day' episode of 'The Office' thanks to @AngelaKinsey and @JennaFischer https://t.co/KNgZxvvUL5 BIG win for the bad guys https://t.co/ucKgwHvob2 Samsung users, you can breathe a bit easier now https://t.co/YBHYmGe8rC Burger King is celebrating spooky season with 'Ghost Whopper' https://t.co/xFT5HXeroQ Oh, you like memes? Name all of them. https://t.co/u0Cid2DgEx https://t.co/lUraSEXYi0 Oh, you like memes? Name all of them. https://t.co/OHRda5IVXM https://t.co/Zt54VIa8mM And the numbers get worse from there... https://t.co/5i5kcC1w7L Say goodbye to doggy bath time https://t.co/oJRd4cee2B Netflix's true-crime docu-series 'The Devil Next Door' could be your next obsession\nhttps://t.co/TkzNJWKUKg 18 things you didn't know about the 'Diversity Day' episode of @theofficenbc https://t.co/0TFKFUzCCY We're pulling for Threepio https://t.co/2NVU0xqnUp 18 things you didn't know about the 'Diversity Day' episode of @theofficenbc https://t.co/7AA4uYZRpr Apple hits number one in yet another category https://t.co/Ycc4FSx0L5 This is the man behind the voice of Freddie Mercury in 'Bohemian Rhapsody' https://t.co/Ar0QZwTtTo Who will be the ultimate bearer of the nation’s nuclear waste? https://t.co/A4ULDz8AlN Netflix's true-crime docu-series 'The Devil Next Door' could be your next obsession\nhttps://t.co/hwybyK5siS Walmart’s onn. brand is decluttering the tech space with products that balance form and function. Check out these three hot picks. https://t.co/UcQQPo2Co1 @Walmart #ad https://t.co/GA2wO1rwen Seth Meyers will have a Netflix special next month\nhttps://t.co/KDx4dJzQzY Mars here we come! https://t.co/d7BeNRHYKq Going zero waste and have pets? This is for you https://t.co/CJOybfQxAF Oh you like Instagram? Name every picture Seth Meyers announces 'Stand-Up Seth' to introduce surprise Netflix special\nhttps://t.co/5QhdOEoZLo This chainless drivetrain promises to make cycling a lot more efficient https://t.co/fVG1GIU9qW Hello hands-free umbrella! https://t.co/9aKugU40ls The 15 best horror movies currently streaming on Netflix\nhttps://t.co/rDsTYnLAl9 Somehow this is not yet illegal https://t.co/0SIrScW24S Huawei's foldable Mate X phone goes on sale on November 15 at a staggering price https://t.co/UmjJNBzXFr And it's soft! https://t.co/b0bZaHkJ1o 'Castle Rock' Season 2 delivers gripping, Stephen King–worthy horror\nhttps://t.co/GAtIETrssK Miami is prepping for flying cars https://t.co/8Lz84jUvMF You and your fur babies can help make the world a better place https://t.co/TQTiCQTWjI This anti-manspreading chair is absolutely brilliant https://t.co/49fRLpah2S Starbucks is launching a black Phantom Frappuccino for Halloween and it's goth as f***\nhttps://t.co/hUEWmS5bZC https://t.co/lWpGWPzTHi Welcome to Mario Kart IRL https://t.co/Lv15cnhmVN Paul Rudd trolls Conan with a 'clip' from his latest show and no, the joke won't ever get old https://t.co/dAwge2qY5M https://t.co/tCfUznSpKN 'Castle Rock' Season 2 delivers gripping, Stephen King–worthy horror\nhttps://t.co/a71Wdnua0d The 15 best horror movies currently streaming on Netflix\nhttps://t.co/fz7y8YgGOu Yeah stars are pretty, but can you count them all up? https://t.co/gP4tHN5iDh Selena Gomez drops stunning new video shot entirely on iPhone 11 Pro https://t.co/mcPVJ9sfwN https://t.co/JDy7TdZsap These robotic hands let the user feel what they're holding https://t.co/Rut5uN56Zs Jessica Biel and Jimmy Fallon keep cracking up during ridiculous spoof car commercial\nhttps://t.co/gPp9EWTlXB https://t.co/AzeCh45nhf Massive Tamagotchi or smart planter? You decide https://t.co/ilOjWcLNlQ \"Alexa, are we in the Matrix?\" https://t.co/hZBsY6Kxh0 Stephen Colbert uses the perfect 'Avengers' reference to slam Trump\nhttps://t.co/kBb6TrWnG8 https://t.co/nnIbDkKozp Yer a wizard, Hamster Potter! https://t.co/QTPz3KNc0T America's nuclear waste has to go somewhere. Which state will bear the brunt? https://t.co/nAaiuq5l2J Woah 😲 https://t.co/tB4gkdIhZ4 This digital art exhibit changes based on the visitor's mood https://t.co/7VJGvBhJID 10 easy Halloween costumes that are just an all-black outfit with one accessory https://t.co/WyL1CgSzKA https://t.co/uCsFoyfd3u Relive your first moments with this smart camera https://t.co/eKKksVBB2o How many cup holders does it have though? https://t.co/V5KFUeCQKz 3D printing human organs could be a reality sooner than you think https://t.co/zf3ThJDDO6 We know you wish you were as cool as they are https://t.co/k16IlGpcDB LG's new dual-screened G8X smartphone now has a U.S. launch date https://t.co/kZtVw8Qtyh https://t.co/dRCppycKU3 This 20-pound collapsible kayak is the lightest we've found https://t.co/lPmudDzu99 Say goodbye to back pain, parents! https://t.co/nLhUb493xs What could go wrong? https://t.co/u1EoWZMCMT This ball can entertain your pets while you're away https://t.co/f5as7OcFHE OK, trendy AR glasses. We see you https://t.co/dCfMsSqwJH Jessica Biel did not care for *NSYNC at all in 1999, in this awkward interview unearthed by Jimmy Fallon https://t.co/e3JGSG4xgq https://t.co/2VM0fm75WS Guided by magnets, this tiny thread could one day enter your brain to clear blood clots https://t.co/embPxdcdsa This digital art installation is completely mesmerizing https://t.co/pUpl8tkazo These water-filled headphones offer the listening experience of a lifetime https://t.co/k2GuWzkcoN 'Late Night' star Amber Ruffin shuts down Trump's lynching tweet in 2 perfect minutes https://t.co/qipK733crX https://t.co/sBDvB8Gvrh Turning orange peels into 3D printer filament https://t.co/9MaQJZDVzd Watch Scarlett Johansson, Pete Buttigieg, and Jimmy Fallon roast each other in tense interrogation game https://t.co/2qUrdhiLJG https://t.co/Obkg8Vmidy This coat doubles as a sleeping bag to keep the homeless warm https://t.co/6tQJl5OjuK This shape-shifting furniture assembles like LEGO https://t.co/35xGXuIKH7 This robotic spoon is changing the lives of people with limited mobility https://t.co/yAH5L4QlEO These glasses can correct colorblindness https://t.co/nf9OqyuEXR These cars could be super helpful in crowded cities https://t.co/MKm61G5rxy This device can turn any surface into a keyboard https://t.co/KQ7u5dxiH5 This house is made out of cardboard but can last a 100 years https://t.co/FZYgEV6hUZ This robot has mad penmanship skills https://t.co/h6izZINSmm This ingenious ironing board is perfect for people who hate ironing https://t.co/TlfgxdqjKh This car of the future comes with its own greenhouse in the back https://t.co/eiBtCQBPkw 10 easy Halloween costumes that are just an all-black outfit with one accessory https://t.co/c8TBHjA9s5 https://t.co/LBkbsdlJnP This isn't your average office lobby https://t.co/KrgDT9I9DS 17 'Star Wars: The Rise of Skywalker' memes that already have us in shambles https://t.co/kbdbnMN6lJ This MIT robot shape-shifts into various gadgets in seconds https://t.co/VeW6VTptU5 Chicken. Smoothies. https://t.co/2WyDcQy8XM Someone has reinvented the broom and dustpan to make cleaning much easier https://t.co/EQjHXC3Lgz Paul Rudd on 'Hot Ones' is being turned into a very spicy meme https://t.co/ZeDwqAc0Ez You'll never have to make your bed again https://t.co/NtEn7mkU1A Oil behemoth Exxon starts trial for alleged climate fraud https://t.co/5Kg62EwEv7 https://t.co/Njem9HNaC7 This mobility device allows paraplegics to move upright https://t.co/qKSxmiZYH3 This video of a tree burning from the inside is weirdly relatable https://t.co/OgGCZagN6y This 3-screen laptop is the dream of tech nerds everywhere https://t.co/HE6D7TMJ7J Is there a sexy Popeyes chicken sandwich costume? Sorry, yes.  https://t.co/n843Tpfw5r https://t.co/rhDmLMagDO This futuristic car is so intuitive it knows your needs — and even your emotions https://t.co/XTFKGw1C1X Mom freaks out after she thinks she sees a ghost on the baby monitor https://t.co/zt0mqY1mga Turn your average laptop into a touchscreen https://t.co/mqYLKObUTr Someone designed a notebook that can last forever https://t.co/t7qvgWcul4 17 'Star Wars: The Rise of Skywalker' memes that already have us in shambles https://t.co/WiaPOOOOvA Before you download the app, read more about it here:\nhttps://t.co/OQOSdKutZl This bike doesn't need any kind of kickstand https://t.co/6Gh6oacLwx What might be less clear to some users is that after that three-day window is over, you'll be opted into an automatically renewing $19.99 monthly subscription. The app appears to be using its current No. 1 status to get users to buy an expensive, automatically renewing subscription. Users are prompted to agree to a three-day \"free trial\" in order to try the lookalike feature. The app's sharp rise also raised questions about the app's origins. Its developer, called \"Ticket to the Moon, Inc.,\" has not released any other apps, and there's very little information about the company online. You might want a trendy app to tell you that you look like Courtney Cox, but at what cost? A mysterious Kardashian-endorsed selfie app, Gradient, exploded onto the App Store charts last week. But users are complaining about big credit card charges. It's been dominating social media thanks to its \"look like\" feature, which compares your selfies to photos of celebrities. You might want to think twice before downloading that viral celebrity lookalike app https://t.co/oRkAq6quPt 10 easy Halloween costumes that are just an all-black outfit with one accessory https://t.co/xdlrnYxhM0 https://t.co/i4SKShCAdt This umbrella is a weather forecaster that reminds you to take it when it's raining https://t.co/9eSGCtmizO FCC Chairman Ajit Pai gets very cozy with a major telecom lobbyist\nhttps://t.co/NKFl8PczSR https://t.co/p15jd1zV3q Forget the recycling center... here's a DIY recycle machine https://t.co/lK2pHEoxK4 Mark Zuckerberg's defense of Libra: It's all about China\nhttps://t.co/AaeC15P8iG https://t.co/icCOnzotmL What a way to upgrade your morning commute https://t.co/BxUZGNNOAE To combat terrible publicity, Exxon purchased some strategic Google ads for people searching for the climate trial :/ https://t.co/60ltoYZDjY Someone reverse engineered the umbrella - and it totally works https://t.co/5iodVSwi7T Netflix may try to limit password sharing without making customers mad https://t.co/4si0Fg0uaA via @PCMag This video of a tree burning from the inside is weirdly relatable https://t.co/phX0hLuN33 https://t.co/mbRpCNARX7 This sponge-like material is 10 times stronger than steel https://t.co/NShZkwnQlT Why did this coming-of-age pumpkin just make me cry https://t.co/hqQYZckQEY Paul Rudd on 'Hot Ones' is being turned into a very spicy meme https://t.co/jIe7lgAgVu We could see getting into this https://t.co/sGunM6BBhi Is there a sexy Popeyes chicken sandwich costume? Sorry, yes.  https://t.co/cO4YT6ttz2 https://t.co/f9uWNyKQXL Mom freaks out after she thinks she sees a ghost on the baby monitor https://t.co/nAJ6Vj5h1v https://t.co/5NAXzNbdmH Project a touch screen onto any surface https://t.co/PBFIg7EBpN Is there a sexy Popeyes chicken sandwich costume? Sorry, yes.  https://t.co/EhGOI5Phfe https://t.co/fmDzAo0kCa This is the world's first solar-powered road https://t.co/qqDJdP0XBr Mom freaks out after she thinks she sees a ghost on the baby monitor https://t.co/2Z9c89sjyO https://t.co/bSepl1kAfW This cute robot will teach your 3-year-old to code https://t.co/UsPCHV0VgN NASA researchers literally reinvented the wheel https://t.co/4km7pgUxDE This guy breathes new life into these old damaged paintings https://t.co/vKCgRlUxsv This desert farm is harvesting food using nothing but sunlight and seawater https://t.co/CVjNsHLSJ3 Netflix's bubbly 'Let It Snow' trailer is here to kick off your holidays\nhttps://t.co/MMvI8geLyE RT @realkrauswife: @AjitPaiFCC @ericgarcetti what was that about (de)regulation? \"We’re going to be one of the first big cities in the worl… This chainless drivetrain promises to make cycling a lot more efficient https://t.co/rPVpPVVzko Transgender cyclist Rachel McKinnon set a new world women's cycling record. Not everybody is happy about it. https://t.co/rph1OK0VVO The human brain is able to multitask, using both hands plus a robot arm simultaneously https://t.co/82nfgOBgV0 New Doogee phone is rugged, modular, cheap, and actually quite powerful\nhttps://t.co/UmofrV0ss7 https://t.co/GxQt5KCBzL Pizza Hut is the latest fast food joint to flirt with plant-based \"meat\"\nhttps://t.co/FMFCpMgXCB https://t.co/hhzyqwmU0Q Rubik's Cube inventor Erno Rubik breaks down the math behind the iconic toy https://t.co/sQOzWdK2Aq There's a new moped in town https://t.co/2Ywd4h9VyH This \"egg\" scrambles just like the real thing https://t.co/9s4Zz53h9e Couple attempts to recreate Pinterest engagement photo and it's adorably disastrous https://t.co/WpOHZsm27A https://t.co/nXoMTg84pB Imagine never buying a plastic shampoo or shower gel bottle ever again https://t.co/XMXsjeoLm8 How degradable are biodegradable shopping bags? https://t.co/tRgcBuSlEl Netflix's bubbly 'Let It Snow' trailer is here to kick off your holidays\nhttps://t.co/YNDHPXg9lP Millie Bobby Brown is a triple threat in the making https://t.co/1LXlFQSXyv Netflix's bubbly 'Let It Snow' trailer is here to kick off your holidays\nhttps://t.co/SDG9TwbK9M BMW just painted a car with the blackest black known to man https://t.co/2AkBUlWiIe Scientists made an enzyme that can eat plastic https://t.co/K6pzf0Smo1 That knockoff @GuyFieri Halloween costume isn't real, but it's still hilarious https://t.co/Gs52NbNUXD This advanced 3D-printed robotic arm is seriously cool https://t.co/2IfTVtTzvX Scientists made an enzyme that can eat plastic https://t.co/GDJlJ1LyAe 9 gifts for people who want to start meditating more\n\nhttps://t.co/KUoqmu2OTy https://t.co/FWqiIpS0eY This robot is training to become a construction worker https://t.co/fAvfEuj9y2 The world's first flying motorcycle is gonna be a reality in 2020 https://t.co/MRdCOGL6Ua This robot is being tested on 5G https://t.co/i0kMABcTHC 'The Outer Worlds' is like a Fallout game that never was\nhttps://t.co/Em7bQlliyo This eco-friendly innovation could change the way we power cities https://t.co/ZfqrJNeB2O The true story behind the mysterious prisoner in 'Catherine the Great' is incredibly tragic\nhttps://t.co/EtBNxqtNE1 More space and less stink - they're doing garbage right https://t.co/sMZvXAhqQy This will make even the least outdoorsy person want to go camping https://t.co/wK1vFPAnKM 'The Outer Worlds' is like a Fallout game that never was\nhttps://t.co/g7jrATu9iz Here's why you shouldn't download that viral celebrity lookalike app\nhttps://t.co/WwnZAzR3Tl https://t.co/g88pjf6eVU This entire castle was 3D printed with concrete https://t.co/6ojhnxJqvQ ICYMI that 'Star Wars: The Rise of Skywalker' trailer is here\nhttps://t.co/aJcbyH49qm These pens have unlimited color options https://t.co/YWrsHVtnZR The true story behind the mysterious prisoner in 'Catherine the Great' is incredibly tragic\nhttps://t.co/Qk6qnv8C00 These redesigned dumbbells are perfect for city apartments https://t.co/eGhbZIFcNX This bionic arm is giving patients the ability to feel sensations again https://t.co/L9ksYMVEt5 Stephen Colbert lambasts all the latest White House gaffes in a burn-filled monologue\nhttps://t.co/skUbnIkA3U https://t.co/yQ3cs00bQz Watching this sand table change patterns is the most relaxing thing you'll see all day https://t.co/Q4Zkvc1HRG Firefighters with jetpacks? You need to check this out https://t.co/wHwl5QZgz2 When your toothpaste gets low, you're going to need this device https://t.co/gDf3TtQsSx This invention is the new jet ski and we want one https://t.co/igqm99yBOi 1 key moment from the new 'Star Wars' trailer has fans seriously panicking\nhttps://t.co/7c3QnQpkE1 https://t.co/kAygXW0jwt Julie Andrews says therapy saved her life during a very difficult time https://t.co/C2MTnqXCVj https://t.co/oLud5Dp64Y Take selfies with Nemo and the gang with this underwater device for your phone https://t.co/exMyFS16E2 Never again will your laces come undone https://t.co/yMudlUCoAa This food recycler eliminates the grossest part of composting https://t.co/yCPisL7CE2 Looks like Elon Musk just tweeted using the Starlink internet https://t.co/2akOZVgNxv https://t.co/TqJTzfTgko This super strong duct tape can tape anything https://t.co/LvB5mZVgAY Paul Rudd is so tired he falls asleep in the middle of a James Corden sketch\nhttps://t.co/9sSV102vNx https://t.co/38mQXZKRRh This might be the rarest material on the planet https://t.co/JIc7YMJWb3 Oil behemoth Exxon starts trial for alleged climate fraud\n\nhttps://t.co/imiJNymTZh https://t.co/Dn0dVo1iKf This robot looks just like a bat and it's creepy af https://t.co/aihHsrOvcM Customizing clothes to your body is the future of fashion. Yes! https://t.co/q3zeMExuh5 Samsung Galaxy Fold gets update that makes its 6 cameras a lot more powerful\nhttps://t.co/k717DF8T7u https://t.co/ubWElQgTLU The world is your oyster! Er, we mean keyboard https://t.co/JcJPzIi9aX These beautiful vertical forests could help cities clean up air pollution https://t.co/Ih4fOBf3PI Seth Meyers nails why the White House's shocking Ukraine admission sums up Trump https://t.co/MoXPm35Pf0 https://t.co/ttg5zVAnJ8 Don't worry about remembering to water your plants, this planter does it for you https://t.co/rjnFRllrzL This cat got bionic legs and omg the cuteness level is off the charts 😻 https://t.co/qoF3ZlLbdH This robot is all legs and could one day deliver your groceries https://t.co/ZE77eEsJW3 Stephen Colbert mocks Trump's absurd attempt to hold the G-7 summit at his golf resort https://t.co/3QIRd4gcDz https://t.co/O9CjfHt3p2 Did you catch the hints of 'Return of the Jedi'? https://t.co/zCDIVIk9qb Can't. Stop. Watching. https://t.co/doWa9E1Uv4 How to cope when your best friend falls in love and pulls away from you\nhttps://t.co/caoVGuGFCk https://t.co/fL700m4v2h If you hate making salad, this is for you https://t.co/pi8wdlEgSY This is super cute AND extremely fascinating https://t.co/lveyY4d6eJ A cleaner alternative to sitting in your fruit bowl https://t.co/iUIu5qp3RO These bladeless wind generators are economic and bird friendly https://t.co/uqQ8pUY6L8 Bikers have needed this kind of helmet forever and it's finally a thing https://t.co/8thPESDD74 NASA's got you covered with this super cool workout tool https://t.co/LN6BZWx97S The trailer hinted at some characters meeting their end (and may also have killed off a few Reylo fans). https://t.co/qe1YYz7Q4t 'IceWind' is an innovative wind turbine that can actually withstand hurricane-force winds https://t.co/fZ75JxzxY3 Can't. Stop. Watching https://t.co/S3Eby3cif7 Skip all the baggage fees at the airport with this luggage jacket https://t.co/IYG4Kliv4m Just look at what this robot warrior can do https://t.co/9UOoZ56zhM The final 'Star Wars: The Rise Of Skywalker' trailer is here. And yeah, you're going to cry. https://t.co/m8R4yFarI7 https://t.co/uMGizDC92m This system will teach you how to play guitar in no time at all https://t.co/m4d0rdR96o The feat in itself is impressive, but it's the video that's a masterpiece.  https://t.co/T7TGmc2RPu Keep your bike safe with this handy smart bike lock https://t.co/lu2ji063Ws Mobile 3D printer can build an entire house in under a day https://t.co/jAlSGLPIDl Cult skincare brand Sunday Riley settles with FTC over fake Sephora reviews https://t.co/fvS7h7FJQS Never buy a birthday card again thanks to this device https://t.co/b0aWWN0BXZ No one wants to be this close to a mosquito, even if it has awesome hair. https://t.co/stLmOjfwGJ https://t.co/3tOeC0NGye Banana is the new leather https://t.co/OtcGSm7rWA Build your your space with adult Lego https://t.co/4qidAwRIX1 HBO's 'Catherine the Great' barely scratches the surface of Catherine the Great\nhttps://t.co/PIFCzaCHny This snake is covered in smiles https://t.co/97HMSaOl9A Turn any surface into an interactive display with this lamp https://t.co/9Dj3DEzBsB This keyboard is especially designed for pro gamers https://t.co/pxm4OSOmWI The beginning of a new chapter for Northern Ireland. https://t.co/w08JwR8jdl This piece of furniture transforms into art in one swift motion https://t.co/uNpoGIfbVK This dome home never gets too hot, it rotates itself away from the sun https://t.co/Ux3zF1Fe3E LEGO + camera = NEED https://t.co/pOP9h004nb This 3D printer works best in the middle of the Sahara desert https://t.co/i7arYoIFFg The designer is a GENIUS https://t.co/ddCYaaxq8t That knockoff Guy Fieri Halloween costume isn't real, but it's still hilarious https://t.co/12LsEbBoPA This gadget will give you perfect cake slices https://t.co/Ws4NGfFxgy Cult skincare brand Sunday Riley settles with FTC over fake Sephora reviews https://t.co/2XIXarcSUp Mercedes-Benz isn't looking too hot right now https://t.co/6zuG92hvIt Struggle no more with this nifty kitchen gadget https://t.co/pvWHLPweG4 This tiny device can alert your family if you're feeling unsafe https://t.co/GWFOtZBIN4 A big win for Badger and Skinny Pete https://t.co/e5nu8pyd6P It only took a couple days for this robot arm to build an entire house https://t.co/vEjxK29EPz Could you survive 'Back to the Future'? This video investigates. https://t.co/Objy2W4Sv0 https://t.co/g3dtVHpcg6 This could be the future of retail delivery https://t.co/LkLIIAohK9 That knockoff Guy Fieri Halloween costume isn't real, but it's still hilarious https://t.co/yVCX18BgiT You know you want this chair https://t.co/G6VHtnln1m A whole new way to grocery shop https://t.co/jY1Ea9LWgx Have you ever seen a tulip from this angle? https://t.co/kzSIAD6eAx https://t.co/SaxEnB22lH Now you don't have to miss your furry friend when you're stuck at work https://t.co/IPplAKnGXB This is actual backyard goals https://t.co/K2im6w4qfi Instagram adds 'false information' labels to prevent fake news from going viral https://t.co/6nNTp4XP2J https://t.co/zJmaSfrLFA Thanks for this @5m_crafts https://t.co/1TIAd3a1QH Someone invented a tricycle for adults and it's actually dope https://t.co/ahpIxZga44 Here's how Facebook wants to protect elected officials from the dangers of, well, Facebook https://t.co/eQ9ZQGj7T5 Moms and Dads rest easy, because now your baby will, too https://t.co/LZ6Srio1p9 Well, it's a step in the right direction https://t.co/wlvyAxREac Russian trolls on Instagram focus on Joe Biden\nhttps://t.co/vcHGzFBv9H https://t.co/eLG4TEh3Vs Make all your Etsy dreams come true https://t.co/Tv7wBiPWnB Netflix's 'The King' will test even the most patient of Timothée Chalamet fans\nhttps://t.co/btZ1E7o9iM Prince Charles grows up in tense 'The Crown' Season 3 trailer\nhttps://t.co/fXYRsEj6Aa Jail is on the table in 'Silicon Valley' Season 6 trailer\nhttps://t.co/JNRRpx95Jr BMW just painted a car with the blackest black known to man https://t.co/yXlaPnLwEa Are you watching 'Watchmen'? Here's what you need to know about the comic (no spoilers!) https://t.co/7uVGAUZOkT This is a lifesaver for any last minute essays/resumes you have to print https://t.co/gwgTsCThqj Netflix's 'The King' will test even the most patient of Timothée Chalamet fans\nhttps://t.co/Tf0ZRRmVcQ Who needs scaffolding in the age of drones? https://t.co/oJ6iNaovGn Yep, that's a spider face. https://t.co/L1jy0RGXWX https://t.co/TmGJFHzuaS And now we're crying https://t.co/cOK3Sn8DfI Creepiest Alexa and Google Assistant security fail yet\nhttps://t.co/NK1LCuI9Vi https://t.co/vdUzht65eQ The future of food is here - and it's 3D-printed https://t.co/4QMCsPN9ug This autonomous truck is seriously cool https://t.co/b6EELkbzys Pretty concerning. https://t.co/XgBOIz8rqW Important https://t.co/KRh0ebeC4R Forget candy, we're into elaborate spooky cakes this Halloween https://t.co/GV3Y8JOBJq 10 books about tech for every kind of person in your life\nhttps://t.co/w84oIqawVM https://t.co/IIe8iFSfgS Mitt Romney confirms 'Pierre Delecto' is his secret Twitter account https://t.co/YT1F0mpWJQ This lightweight bike helmet is a total game changer https://t.co/Z6b0yxpH50 This futuristic street light design is surprisingly eco-friendly https://t.co/Qr29cxhogT These 20 incredibly detailed, microscope photographs are quite the close-up https://t.co/b86T6QgjRU https://t.co/tmAovfqzj2 This backpack could save many lives when disaster strikes https://t.co/wRnwifAVxE This tiny washing machine is seriously cool https://t.co/2EbLdcRzxa Jail is on the table in 'Silicon Valley' Season 6 trailer\nhttps://t.co/iF8Jmn8adM Netflix's 'The King' will test even the most patient of Timothée Chalamet fans\nhttps://t.co/jjMaUN7q49 Prince Charles grows up in tense 'The Crown' Season 3 trailer\nhttps://t.co/jl9sQXYe8l HBO's 'Catherine the Great' barely scratches the surface of Catherine the Great\nhttps://t.co/vknQni49Ik Keeping floors clean just got a lot easier https://t.co/7WCnHVhNXN This airbag is next gen https://t.co/s1fdDjJqjq Dark Mode on the iPhone can save massive amounts of battery life, test shows\nhttps://t.co/yY9T7gOex0 https://t.co/m18j9qKENW Finally! https://t.co/havzZIww2H Let's talk about the ending of Netflix's 'Living With Yourself'\nhttps://t.co/mpJxDHrbZ6 No more traffic-causing construction https://t.co/41hbZNUjKh Google Pixel 4 and Pixel 4 XL review: New features don't justify the price https://t.co/EMTjlc5Izf https://t.co/mHgmAe89VQ Watch out, Iron Man, we've got a new 'super' suit to obsess over https://t.co/hRxqRrGteg HBO's 'Catherine the Great' barely scratches the surface of Catherine the Great\nhttps://t.co/ZiU7dDm5sc Let's talk about the ending of Netflix's 'Living With Yourself'\nhttps://t.co/5fHDSlbdVh The world's greatest (Photoshop) dad returns https://t.co/LEoQDQNXG0 Heavy scuba gear is a thing of the past https://t.co/V0X2KnSWwu This keyboard looks like a typewriter and you need this now https://t.co/6esKl4x9fo This is possibly better than an iPad and Kindle combined https://t.co/I1b5poau3K Now your hands will be free to hold all your snacks https://t.co/H7ioO39blL Kate Beckinsale is totally convinced that Ryan Reynolds is her doppelgänger https://t.co/QaRmwhrqsm https://t.co/VaJyV0BP9T This flying car is giving us visions of the Jetsons https://t.co/wKq0xqPsIa How long have those strawberries been sitting there? https://t.co/xyygyCAfAG Watch the real-life Spider-Woman smash a speed-climbing world record in under 7 seconds https://t.co/bRqffP5WpV https://t.co/e2zWgqlVmH 'The Simpsons' parodied 'Stranger Things' and of course Lisa was Eleven\nhttps://t.co/VUW8K8aXpg https://t.co/WXshtb6BJF For you minimalist peeps https://t.co/lb0dfElEkh Give those glutes a break https://t.co/e9JMtjBogQ 3 worrying takeaways from the #MeghanAndHarry documentary https://t.co/xqOK2GIrDn https://t.co/sxDKRFfb6x A house built in under 14 hours? Sounds crazy but it's true https://t.co/JJFcOp5ExU This origami robot is being developed to one day perform intricate medical procedures https://t.co/uz8QBcULrI Kinetic window blinds that act like a giant sundial https://t.co/qTzOnoKuu3 *extremely muffled squealing* https://t.co/yo9eXmSeI4 Could this be the car of the future? https://t.co/YGGLLCdm0o Your cat actually loves you, despite all those scratches https://t.co/9wWXMkYsC7 Google Pixel 4's face unlock will get more secure but not straight away\nhttps://t.co/fLRpBzxiCP https://t.co/4hXSDMC9O4 All of our automobile-technology dreams have come true https://t.co/zuEyPcw1h1 This robot gives us the creepy-crawlies https://t.co/voYu2UU8MR Now those incessant piggy back rides don't have to be such a pain... literally https://t.co/RVoizrMSwd Now those incessant piggy back rides don't have to be such a pain... literally https://t.co/g3PC6Jz4Ce All signs point to the best 'Terminator' sequel since T2. https://t.co/5xPJRsvxNg Try not to lose this teeny tiny iPhone https://t.co/KPIvB4nxxF Forget 3-D printing, this is way faster https://t.co/xvFoIPK8zq Talk about a paper cut... https://t.co/WlyMjS9WpV A levitating lightbulb is way cool 💡 https://t.co/4gLWu3Ra4U Watch the real-life Spider-Woman smash a speed-climbing world record in under 7 seconds https://t.co/hWORh8BBwF https://t.co/z4PHuhtECy Solar panels can live in your window blinds https://t.co/fmj5mOnRWV Snorkeling has been reinvented thanks to an underwater scooter https://t.co/DXkWMLISYa Clean the outside of your windows from the inside https://t.co/9AP2TeOL0z These solar panels are printed from conductive ink and are way cheaper https://t.co/naz2m9sfVn A floating caddie is a much safer way to scuba dive than a heavy tank https://t.co/B5wkqOOnXz These wax worms could help solve the plastic waste problem https://t.co/9kltfJf91h This grill requires no fuel to cook all your food https://t.co/XB74FJeqLF It's like something out of a Marvel movie. https://t.co/SiNGgDAL7m https://t.co/hFbQPmSaG7 This wheelchair could be a game changer for many users https://t.co/QtJHc8UqcP When you're too tired to walk through the airport, just take a seat and your luggage will drive you https://t.co/tVKqPqNmpv Take selfies with the fish with this super cool underwater camera https://t.co/SwFbnBXcSA Charge your phone in over 150 countries with one adaptor https://t.co/T8TZOcSU5U Imagine having a grip like an octopus https://t.co/x8O7YzgRMt This mini washing machine will let you check off laundry day and leg day all at once https://t.co/8SePMJ976h This could make some crazy changes in the medical fields https://t.co/61GOLFdgtw Gently wash your clothes with no electricity https://t.co/rjr4XxhzuU Settle in, because there's a lot to go over. Spoilers ahead. https://t.co/dVAvtvPllQ Pretend you've got the baker's touch with a pancake printer https://t.co/Gzkr10ljPh No Kinkos? No problem! Take this tiny cube with you to print your documents https://t.co/D81OjhkyzO Kids can learn to code at a young age now with some pretty cool tech toys https://t.co/N95rqMWzyz Keep those floors clean, even while wearing your shoes 👟 https://t.co/PklOzmvhcK These roads charge your electric car are you drive https://t.co/em8bddcoWo These solar panels do more than produce energy https://t.co/8pmO5RRWKE Donald Trump isn't the best at words, and Hillary Clinton had some fun with that fact. https://t.co/j3z5fk8fcg Pollution has nothing against this clean air machine https://t.co/H7UlYZt10T It was looking grim for NASA's Mars InSight mission back at the beginning of October. https://t.co/aPsA7xAM8o Can't get out of the house? This grocery store will come to you https://t.co/UOkL4dhJPX There's a very scientific reason behind the sparkle of this bioluminescent algae https://t.co/yN3mKYtfOi Party hard with your doggo https://t.co/XUAjNW9Bsp The surfboard just got a major upgrade https://t.co/RqDcK1K5DN This engineer is ecstatic about his DIY flying chair https://t.co/PqC0sl58gS The subway symphony we all need to brighten our day up. https://t.co/iludWU2Za9 3D-printed airless tire will never leave you stranded with a flat tire https://t.co/UwNH0p2OAY This flying surfboard doesn't require any waves https://t.co/3WDDlLKzli This augmented reality room is so trippy https://t.co/PUZobmMlJ3 This self-fueling zero-emission boat is on a 6-year trip around the world https://t.co/mZtNdPrD9w This home can fold and unfold in 10 minutes https://t.co/AJFm11jfRv These water-filled headphones offer the listening experience of a lifetime https://t.co/1qy2BLeEyx Kids these days, man. They just don't appreciate the classics. https://t.co/3rKUnpHNWc Turning orange peels into 3D printer filament https://t.co/svAWzSPsU4 This creator makes cameras out of pineapples, trees, and just about everything under the sun https://t.co/KqG7gkmLqr Whew. Not looking too good, Tesla https://t.co/UztmfeTKxL The app has since come back online with no further reports of of incorrect data showing up. https://t.co/jUsMoD9Dbx This autonomous truck is seriously cool https://t.co/P7EIPTEhbl Thank you for your service, Paul https://t.co/cinKwZQ7wp This lightweight bike helmet is a total game changer https://t.co/J3Hjvobtyu One eyeball cupcake, please! https://t.co/XpU2UHEsQa \"Let's watch 'Love Island!'\" - Me this Thanksgiving https://t.co/j0Z8gjXMJO Asphalt is so 20th century https://t.co/kHdKllt7fv Qantas could start offering these nonstop flights by 2022. https://t.co/Puedw7b3yU Don't worry about buying extension cords and surge protectors, just paint your electrical wires instead https://t.co/2eitaGqp4l These tubes bring natural light indoors and help reduce energy costs https://t.co/2GtkbL6zbQ Is this the ultimate tiny house? https://t.co/TAOyjahcoz Print any temporary tattoo right onto your skin https://t.co/XOYfrjxBMr How video game development has changed over the last decade\nhttps://t.co/RBC4EzESPn Meet the 11-year-old drag kid shaping the future of drag youth https://t.co/UEiy3QdzsF NASA researchers literally reinvented the wheel https://t.co/h5zUA8kixE How video game development has changed over the last decade\nhttps://t.co/mRKxVHZHxn This super strong artificial muscle brings us closer to lifelike robots https://t.co/y40ksYqSDS This coffee cup is also made out of coffee... and meta just got sustainable https://t.co/6nHBgDTKnk This car can swim in water about as well as it drives on land https://t.co/XBlmk8tskv A company is growing animal-free leather in a lab https://t.co/3WIa7vfBKk Why you need to watch HBO's 'Watchmen' https://t.co/xGxd8PGR56 This backpack is made out of old car materials but it looks super stylish https://t.co/OgB4YR9VsX A robot inspired by vines can grow 25,000 times its original size https://t.co/VVP6kOvcg5 These benches and sidewalks are made out of solar panel https://t.co/nvp0M6D5KJ This 'Star Wars 'Landspeeder for kids should also be made for adults, just sayin' https://t.co/jWplJ3a80w This electric unicycle is pretty easy to master https://t.co/Z4z3erbQFI Researchers have discovered the color psychology in Disney movies https://t.co/f8jR9SXpa4 Go for a run with your stroller hands-free https://t.co/KHHcif4mZq This snake-like laser robot is pretty insane to watch https://t.co/FMaPjUYqGF The art of globe making hasn't quite died yet https://t.co/IV5YoxEy0y This coffee cup is actually edible https://t.co/EX6vT14Gli Fire ants can create some crazy cool things 🐜 https://t.co/VQ9B6fHr8P All you need is warm water and this plastic card to mold whatever shape you want https://t.co/MbbDcM7NpY This wheel is actually a motor https://t.co/lvGrvNvy1A A designer has created cabinets that can change shape and it's mesmerizing to watch https://t.co/u6nPDpnYUu This gadget makes sure you stay connected in remote areas https://t.co/CgFflv8tNN 'Toybox' is a 3D printer for kids https://t.co/d6RGTd1rpg NEEEEEED! Now this is a work of art https://t.co/ABjLgBPeU7 Watch these sculptures disappear before your eyes https://t.co/zxw3XyXH4b These origami vehicles are actually tiny Transformer-like robots https://t.co/KZlTpMG6DY Now THIS is the future of transportation https://t.co/dsyo7KJ9Br Dark asphalt significantly affects how hot a city can get, so LA is cooling off with white pain https://t.co/SXTW10UAOr What's better than a hammock? A hot-tub-hammock https://t.co/Ib5knaSMEJ Save the planet, eat your dinnerware https://t.co/aZi4QtYQ5F Kiss your ironing days goodbye thanks to this gadget https://t.co/uqELjrvPlW This artist created a battery-powered paper city using electric ink https://t.co/cQQ3jncEm4 This shop functions without any plastic packaging—a first in London https://t.co/3mWIrlAmRt This unassuming robot could sneak into your home https://t.co/uh418QScnj This adorable napping baby has no idea her mom is dressing her in incredible costumes https://t.co/DYugUzL2dn Ah, construction robots, efficient and calming to watch https://t.co/iWe3ye9tet There's no such thing as too much cheese https://t.co/Ge28q1GBC3 Crafted from paper, these puppets literally pop into shape https://t.co/KHbaX9dWmh Farm-loving robots could change the future of agriculture https://t.co/4biYCq7sAN Someone reinvented the paper plane https://t.co/h4hQMztzje These wind sculptures are so mesmerizing https://t.co/rhv39T8St7 This weird desk lets you work while laying on your back https://t.co/5dPrpSt7VZ This app is like Shazam, but for works of art https://t.co/VlzfjIwR17 A bionic suit helped this incredible paralyzed woman walk 10 miles for charity https://t.co/RRHLrZUmVn Glide across the water with this electric bike 🚲🌊 https://t.co/2rf8qYXq82 Innovative bikes are everywhere.. this one is like a rowing machine on wheels https://t.co/O9aILYDP7d Classic moment. https://t.co/0uAT1vDiR6 These seniors are using VR to explore the world from their assisted living facilities 🌍 https://t.co/jJqcoQwIBo These robot ants can work together like a swarm https://t.co/pxDpBrC0ie A stainless steel bridge is being printed by robots moving in mid-air https://t.co/qxbCEKmBmV Watch this very good boy get his own towel to dry off with at bath time. https://t.co/vmZQ4XW7so https://t.co/ql7c6iRHEx Don't underestimate the strength of spider silk https://t.co/rE5TcdWy3r Say goodbye to boring furniture thanks to this dynamic invention https://t.co/jrhFB3GdGQ Do you want to feel closer to your smartphone? https://t.co/ArUc3ByhdV We rarely talk in public about periods, but this is changing with Saturday's first-ever National Period Day. https://t.co/ruZZ5lc2TJ Here's how high-tech crosswalks can prevent accidents https://t.co/MWCCyk4IeO Kanye West talks God and faith in 'Jesus is King' concert doc trailer. https://t.co/1TbBSTraO8 https://t.co/TB9SUhggT7 An architect turned pastry chef creates edible sculptures that will make your mouth water https://t.co/wvJZvZzv7E Looks like Star Wars' first-ever live-action television series is going to be a slam dunk. https://t.co/OVPUjHRhm8 This legally blind man was finally able to see his wedding day... 15 years later https://t.co/6uFAVE9kZM Spend the night in this Lego mansion 😍 https://t.co/AEDO9R2X7M There appears to be a human drawing time inside this giant clock https://t.co/V8nDvd2mQT These are fireworks you can feel https://t.co/9q1LN3Kmsc Uzo Aduba in 'Ms. Virginia' will have your heart\nhttps://t.co/Dhuo9krIe6 These hypnotic sculptures are made from Lego bricks https://t.co/vtsMGgFOtL Uzo Aduba in 'Ms. Virginia' will have your heart\nhttps://t.co/PJP7jo70mv Turns out bees have quite the artistic vision https://t.co/UKstFGtnvB Elton John's not feeling the love tonight https://t.co/xji16Sorou Riddle me this... https://t.co/yJJl0maWKc 'Dolemite is My Name' writers talk about making the greatest Eddie Murphy movie of all-time https://t.co/bXTmqgvINI Rugby is a brutal sport on the field, but this warm-up showdown was just as intense. https://t.co/dKD67ymtaa BRB, getting a Google Assistant so we can listen to Issa Rae all day long https://t.co/33lXlecGsE The future of food is here - and it's 3D-printed https://t.co/TmhLbmV2sQ Ever wonder what it's like to be a professional Halloween monster? https://t.co/IC3qpyKmMV This could be the hi-tech thermometer we've been waiting for https://t.co/VmjifuQHBu These smart glasses could help those with vision loss see again https://t.co/fPe57EbmIj Cereal boxes usually showcase the smiling faces of sports stars but Kellogg's is doing something different this time. https://t.co/hPRotI5eQn Imagine never buying a plastic shampoo or shower gel bottle ever again https://t.co/iHw4jp1T0z Chick-fil-A is in trouble again. https://t.co/cw7LmcthOA These wooden bricks will help you build your dream home in just 2 days https://t.co/oKGYwyIiuA Reason #5897543 why Oprah is a benevolent queen. https://t.co/0NaBVbfLfp Ice pyramids are bringing fresh water to the desert https://t.co/wtFQnCOKrC Meet the animal that will be here after human's disappear https://t.co/NDFCmBTeEF Rough terrain? No problem! https://t.co/EXJYeFROkt The 2020 Tokyo Olympic medals are made of 78,985 tons of unused electronic devices https://t.co/h8EmO2RwUh Do you need a dual selfie camera? That depends. https://t.co/p6VKHgifh8 More space and less stink - they're doing garbage right https://t.co/O6WGHa3aKJ Just look at what this robot warrior can do https://t.co/6nzMMc3keQ This designer used colored glass to convert sunlight into electricity https://t.co/5aqti28UMD This block of sand defies physics https://t.co/w8VMjQ4ogU This pedestrian crosswalk looks like it's floating https://t.co/y0l0MhQYs9 Apple TV+'s lineup looks pretty great so far https://t.co/gvC0779MFo I can barely explain this e-bike with a throttle, but it could change bicycle commutes\nhttps://t.co/kGiEsC39Va https://t.co/zo3R7iytka This isn't your average water filter 💦 https://t.co/LQTmZMcmYK Program this flying robot to follow you everywhere https://t.co/t8XcqgN0Nk Anything you can do...this robot can do better https://t.co/rXlqxq9zYa Architecture students completely reimagine the homeless shelter https://t.co/S4DwvZsYjy Music has never sounded so clear https://t.co/gb7xFpSBVH This shapeshifting wheelchair is designed to maneuver rough terrain and provide upright mobility ♿️ https://t.co/cSNAqlddhG This eco-friendly fabric can repel stains and odors https://t.co/zfGCZtvjfa This furniture is 3D printed using recycled plastic bags https://t.co/KYKqFJEJBN From window to balcony within seconds https://t.co/DQgG7079LW This weird water vehicle is half boat, half submarine 🐋 https://t.co/a5NAlWqsvg Hammock is life https://t.co/B1ntzZHXJl This is a new way to 3D print at home https://t.co/rtDk8jjYsB These bendy artificial muscles are super strong https://t.co/TZs7ET7h9O You've never seen pies quite like these https://t.co/cOVoBVffqQ This ridiculous bike invention wants to keep you dry https://t.co/PAI6wriIlv An amputee can feel the grapes he picks using a robotic hand https://t.co/nw2QXho31n Keep your dog safe with this puppy car seat https://t.co/zpdoUUbfvK Work out your legs while sitting with this mini elliptical https://t.co/DL67rb8jPT These 3D printed flip flops completely conform to your feet https://t.co/vvHR9yq3La This giant skateboard is actually a car's base frame https://t.co/PEoAn5iBKE Forget body painting—body marbling turns your skin into a psychedelic work of art https://t.co/AIvF6Bc4xX This device turns any manual bike into an electric vehicle in seconds https://t.co/weMgeTLwCc This building is unlike any other https://t.co/RZYFMiJPyq Best. Invention. Ever. https://t.co/FKvhd2PLzd Someone designed an accordion-like table that unfolds to double its length https://t.co/vKdZ7j5DvF Master chef sculpts impossibly realistic pastries that look just like fresh fruit https://t.co/g2rWGYHYm7 Tap water may not be as safe as you think https://t.co/hKtG4aEHEk Capturing snowflakes under a microscope is as beautiful as it sounds https://t.co/wCAceGkSet This rail line will make your stomach drop https://t.co/zw0m2NE7kE This shapeshifting furniture will blow your mind https://t.co/UIcutW0MpJ Entertain your kid and get a workout at the same time with this reinvented stroller https://t.co/eNXSuWS1Kz This designer \"paints fabric\" https://t.co/ZZpGwGrHKb Zero waste isn't just a trend, it's a lifestyle https://t.co/2wkQi8JvQH This water bottle will make sure you stay hydrated https://t.co/m7J8OoeCBR This electric wheelchair was made for any terrain https://t.co/zf3XbT6WEL Cycle ball is the weirdest sport you've probably never heard of https://t.co/mDDljchsmR 13 gifts for the aspiring dogfluencer in your life https://t.co/u855GXmMF2 Keeping floors clean just got a lot easier https://t.co/FwlGKl6hzl Scientists have found a potentially super cool replacement to lighting https://t.co/cnFMk2Uu8U This amazing exoskeleton is helping people with paralysis walk again https://t.co/cMGyiOuj7a This trash can crushes your garbage to save space https://t.co/KnSOqCBumH These are made out of manila envelopes 😱 https://t.co/3nU4TDRwOp Surprise! People don't want Facebook cameras in their homes.\nhttps://t.co/dmvFPSHxpK https://t.co/ysY9SxdKmm The tool that you never knew you needed https://t.co/TPdbgIqiNq This hologram \"dances\" on your fingertips https://t.co/Ruhucbx6VY This device is basically a flying Segway and we want one now https://t.co/l9jgoM1Sfb Would you stay in this luxury treehouse? https://t.co/KN1NCUY9Nt Watch Bon Appétit's Chris Morocco recreate Guy Fieri's weird nachos on taste alone https://t.co/1VgNi9amg9 This isn't terrifying at all... https://t.co/cot1JXHAwj Yamaha developed an AI system that translates motion into music https://t.co/hhtoTkimjP This futuristic exoskeleton is helping Ford factory workers avoid injury https://t.co/oYWAfXM2wd 13 gifts for the aspiring dogfluencer in your life https://t.co/4n9srEd3vU Say good-bye to coffee shops and hello to portable espresso makers https://t.co/mcdP7mJHCX Lyft launches 'trending destinations' feature for aimless (and adventurous) riders https://t.co/iUbHVzvbJ5 This spoon is designed to scoop every last bit of goodness from almost any jar https://t.co/VQ18IxIYIz This suitcase takes organization to a new level https://t.co/rOeYDil1rq This egg-shaped capsule is actually a smart, self-sustaining home https://t.co/teQf4e5owS Here's every single time Dwight shouts 'Michael!' in 'The Office' https://t.co/9NaYYd3f6z And now we're crying https://t.co/l9BwJ6Bat2 A proposed tax on WhatsApp calls leads to massive protests in Lebanon\nhttps://t.co/D2ZPqOJzZJ https://t.co/eyzbra1hLd It's scary how cute these kitties are https://t.co/CfSLGleXll This may be the most unique pet ever https://t.co/7AGCjvNttZ As 'Silicon Valley' ends, Silicon Valley itself is beyond satire\nhttps://t.co/JcFhUvLK7e The royals have quite a lot to say on climate action https://t.co/1jIbyCVQYa As 'Silicon Valley' ends, Silicon Valley itself is beyond satire\nhttps://t.co/VQhhRZX81x This sounds creepy, spooky, and kooky https://t.co/V3Kd0gss5o How the celebrity hair we loved this decade shaped who we wanted to be\nhttps://t.co/e7gh6LLJMS This autonomous truck could totally transform the construction industry https://t.co/i1Rtc82H47 After mass shootings, Google told Congress his arrest was progress. But the truth is complicated. https://t.co/nawZGD2RUA https://t.co/PTeNbwYsXn The average worker would have to work 2.8M years to earn as much as Jeff Bezos https://t.co/miZz1oRNeF Our sincerest condolences to anyone on their last Mango pod. Godspeed. Or should we say, Podspeed. It’s a sad day for Creme Brûlée flavored Juul pod lovers. The wildly popular vape company has announced the suspension of their dessert-iest flavors: Mango, Creme, Fruit, and Cucumber. Juul suspended sales of its most delicious flavor pods https://t.co/qhRYxeSPUN Looks like Google's coming for Apple's crown https://t.co/Sgh4OznxJ5 Report says new AirPods Pro could launch this month—and be very expensive\nhttps://t.co/2FeElZx5cN https://t.co/5b5ENdLNay This nature-inspired wind turbine is shaped like a tree to blend in with its surroundings https://t.co/XzKAqYueN2 Here's every single time Dwight shouts 'Michael!' in 'The Office' https://t.co/dOV6Yq8iAh Banana is the new leather https://t.co/ZSmfqK9ttN A robot bird that flies just like a real one https://t.co/iyKfkjyE6G 'Modern Love' is a good first date, but it'll let you down in the long run\nhttps://t.co/nMRnR8dlzo No more traffic-causing construction https://t.co/2Osw5SLrV9 How the celebrity hair we loved this decade shaped who we wanted to be\nhttps://t.co/tS2xDCkOSa How to (mostly) remove annoying Memoji from the iMessage keyboard\nhttps://t.co/dMHAqWBiZ0 https://t.co/YbIc0bjHuh These solar panels are printed from conductive ink and are way cheaper https://t.co/nUgGlQ3UV9 This grill requires no fuel to cook all your food https://t.co/3b7pI3t5j8 Everything coming to Hulu in November 2019\nhttps://t.co/IvfprB3maf These continue to terrify us https://t.co/KcutccDGVX This self-driving truck completed a coast-to-coast trip https://t.co/PveJp1jkop 'Zombieland: Double Tap,' the sequel to 2009's 'Zombieland,' might go bigger, but that doesn't mean it's better https://t.co/PkQX98lzN9 'Modern Love' is a good first date, but it'll let you down in the long run\nhttps://t.co/1i5vQnwI8y Everything coming to Hulu in November 2019\nhttps://t.co/rtJJpphrZL Meghan Markle opens up about the impact media scrutiny has had on her\nhttps://t.co/TOJFRqxbWh https://t.co/TdJN4OOKpP Finally your cat can take a road trip without freaking out https://t.co/q45y7qN8sS Jim Mattis mocks Trump over 'world's most overrated general' comments https://t.co/nkWJLD0LZQ https://t.co/m7gxK2wm1g Now you can explore the ocean without all the bulky equipment https://t.co/K89kEXDUAV 'Modern Love' is a good first date, but it'll let you down in the long run\nhttps://t.co/XFwlO78JFC https://t.co/ucVeZLSvm2 These giant hands could be your best travel buddy https://t.co/8zSe2gpvkt You can't run and/or hide... https://t.co/yIC3kfV72q What a day. https://t.co/6B6M6tzCYV This artist makes incredible optical illusion paintings https://t.co/rCkGbO6pQA Looking for Alaska is streaming on Hulu. We have feelings. https://t.co/l3JfGlvX4d Scientists have unexpectedly discovered 'ultramassive' black holes that are most likely the largest in the universe https://t.co/16LLypiSn1 Awwwww. https://t.co/CpS7VNnwYu This wearable device turns you hand into a keyboard https://t.co/WFuoacJGbq These devices are vacuuming plastic from our oceans https://t.co/g0oz72HIoN The most dominant shark of the deep sea was tagged at depth for the first time https://t.co/DAc1UHKrQA https://t.co/gkL4Ru5kXI This futuristic collar is actually a 360° camera https://t.co/Mnhh1lfr9w The internet loves it, but Stormi isn't into Kylie Jenner's 'Rise and Shine' song https://t.co/w0RdMFBbuo https://t.co/W7b8Z2mw7g From window to balcony within seconds https://t.co/4pgL03CHZT No waves? No problem https://t.co/YFKzrzWOzT So, not everyone's a fan.\nhttps://t.co/bX1ejDDK8s So, not everyone's a fan.\nhttps://t.co/BWEfLNYboc Shaky California turns on its long-awaited quake alert app https://t.co/dQgMiixYfd https://t.co/Oj9F1dMq1O Who else NEEDS this table? https://t.co/ZNevoCJq2X Kinetic sand videos are oh, so satisfying https://t.co/s8rlxYDnRZ Ouch. Ouch. Ouch. https://t.co/Okk2OlHe4r You'll never have to buy another pair of shoes again https://t.co/quCGgeqoy1 Yes, FootGolf is a thing now https://t.co/ajRANrLtqQ This company transforms old shipping containers into swimming pool https://t.co/wwYeu1Q6Jn These igloo shelters are helping the homeless survive low temperatures https://t.co/llEmZ6FmrE This pencil has a dual purpose https://t.co/Uaz0NDSZHk Sorry, but Paul Rudd absolutely cannot tell you if Bill Murray is in the new 'Ghostbusters' https://t.co/9ov2SJjtqc https://t.co/SffyYUvMIk These kids are running again with their new prosthetic limbs https://t.co/rBneYKlfPq Watching this foam transform is like construction magic https://t.co/cZg3bitmM5 The future of self-driving taxis may be closer than you think https://t.co/v3KB6ZJsvM Watch these sculptures disappear before your eyes https://t.co/cdPCdVBglu This mat lets you walk on water https://t.co/4IfbGU09Qr Just what we needed: More screens https://t.co/3XKE8hKUWp This 3D printer was designed to build homes in developing countries https://t.co/0awFxUYWz1 This ballerina is bringing the beauty of ballet to lower-income neighborhoods https://t.co/9vCRkHOLaF This unique artwork actually responds to movement https://t.co/r4lloDAWyy Someone didn't totally think this through https://t.co/wu9oxQrb6h These drones are being used to safely clean wind turbines https://t.co/aKAeEBEy6m This Tesla competitor has 3 wheels and only costs $10,000 https://t.co/uNDTVYFYRS Monsters are taking over NYC, thanks to this artist https://t.co/UkG3kPBdGU Your cycling actually powers this gym https://t.co/V7uVXpPArB These sculptures are not what they seem https://t.co/ed8cu9VZnh MIT researchers built a remote-controlled, bionic spy fish https://t.co/5Lm3YHRkjU Crowdsourced traffic is available for more Google Maps users https://t.co/pceVvuC5WL This rocking chair knits you a hat as you sway back and forth https://t.co/aN4U0sUKOv Mark Zuckerberg keeps lying about Facebook's origin story https://t.co/8bfpkzJvqs You can actually eat these plates https://t.co/QaeHKzYXM1 Dying to remove those memoji from your iPhone keyboard? Here's how to finally do it https://t.co/Uyop76woyO Forget planes, trains, and automobiles. THIS is how we wanna travel from now on https://t.co/JIRmYjK1Pb These robots built a bridge all by themselves https://t.co/0gigfVoKLU Shaky California turns on its long-awaited quake alert app https://t.co/FK0j1tdYVg https://t.co/qJIsDVFaId These highway pillars are turning into vertical gardens to help fight air https://t.co/npa71aXwDt Just give her the Grammy now. https://t.co/gF8J88wFpY This robot is breaking the rules and drawing on walls https://t.co/1kpgDQXhbM Watch Rep. Elijah Cummings' first House floor speech https://t.co/YpWFPkQSck https://t.co/qFRCsQxetp We could watch these intricate wind sculptures all day long https://t.co/ekSxT7NOXa These metal animal sculptures are so realistic, you may need to do a double take https://t.co/d6lK56GVrO The most dominant shark of the deep sea was tagged at depth for the first time https://t.co/6kpFigLlLo https://t.co/YtXwlJGpXD We can hardly believe these aren't photographs https://t.co/keUhIIG2Q8 Half of all active iPhones have made the leap to iOS 13 https://t.co/3Kx6pEPkri via @PCMag Scientists are growing vegetables in Antarctica in preparation for space colonies https://t.co/4U2N7ebILA How fandom won the 2010s and why it will keep on winning\nhttps://t.co/LvRvUYZZ3U This AR headset will make you feel like you’re in a sci-fi movie https://t.co/WHpEgbTxMn The handwriting of some of your favorite musicians are now available as fonts https://t.co/mXna26r6DN The new 'Dickinson' trailer casts Emily as a wild, feminist visionary\nhttps://t.co/SOABITNVaW Turn your hand into a computer mouse with this new wearable device https://t.co/1mOOvddZqH 3 new and affordable tech items for music lovers from @Walmart's new onn. brand. https://t.co/MISOrGU2vh #ad https://t.co/5eKdlYKKiP Blood floods a family's basement and we could not be more horrified https://t.co/fhLUlnOVfb Here's Rihanna smoking a joint, rocking a bikini, and minding her business- all in slow motion. Let this be the energy you carry into the weekend. https://t.co/SRmdwa3y7V This artist 'paints' using the sun 😱 https://t.co/h9BjAcCl8H Goodbye, mango, creme, fruit, and cucumber https://t.co/6x5n5FDxHz Stephen King's 'The Outsider' gets spooky HBO trailer\nhttps://t.co/rYAh6NVzR5 Person you’re                Guy grating \nmaking fake               Parmesan cheese\nplans with                   over your pasta\n                         🤝 \n              “Just say when” NASA researchers have found a way to grow wheat on the International Space Station https://t.co/18HboJAUVh Mark Zuckerberg says the real threat is TikTok and China\nhttps://t.co/0zYpNgXrsw https://t.co/JIUs1n6n1a Shaky California turns on its long-awaited quake alert app\n\nhttps://t.co/GLxnnYR3QB https://t.co/mHLSMvUFyI From juggling to playing the guitar, these prosthetic fingers are helping people do the things they love https://t.co/f2drChA5O7 Robert Pattinson Batman movie adds Paul Dano as The Riddler (we love it!)\nhttps://t.co/vpkdPbCN72 You love to see it https://t.co/YKKVmLxQCi This road can charge vehicles as they drive on https://t.co/q0DxnDC0OR Jennifer Aniston doesn’t even need Boomerang to make a Boomerang  https://t.co/9nZgPWBivd The new 'Dickinson' trailer casts Emily as a wild, feminist visionary\nhttps://t.co/y1ESAD3j8i This 3D-printed house took only 48 hours to finish https://t.co/YsuxCX9Rhq How fandom won the 2010s and why it will keep on winning\nhttps://t.co/NINxjMJrOK Robots can now assemble Ikea furniture and we've never been more grateful for technology https://t.co/u9tiJOBINK Robert Pattinson Batman movie adds Paul Dano as The Riddler (we love it!)\nhttps://t.co/XqwDFWkx7f This awesome coffee stirring device will help you cut down on plastic use https://t.co/bfHf7DZMLf Stephen King's 'The Outsider' gets spooky HBO trailer\nhttps://t.co/NaLI6tiZpy Meet Daisy, Apple's recycling robot https://t.co/ZUtKppeRG6 How fandom won the 2010s and why it will keep on winning\nhttps://t.co/DhzUoi2V8g Paul Rudd eating hot wings is what we needed rn https://t.co/JIwi1mwMBE OK vegans, it's your time to shine https://t.co/ShYVbQXc1B These smart glasses could help those with vision loss see again https://t.co/WeFwJKa8Io Facebook co-founder Chris Hughes has announced a fund to fight monopolies https://t.co/wFPTbMKPLu Earth's darkest substance is absolutely insane and a little creepy https://t.co/nPjKWKaiRk This may be the most unique pet ever https://t.co/cG9ojf6U4j The Turkish president apparently threw Trump's ridiculous letter in the trash https://t.co/EQowrlm3rU Would you try 3D-printed food? https://t.co/yVPNIrAj34 Watch Rep. Elijah Cummings' first House floor speech\n\nhttps://t.co/hfdcSYJzkZ https://t.co/cNMTWGf5ad We're not so patiently waiting for this song to drop https://t.co/2vSp6aMmpd Looks like Google's coming for Apple's crown https://t.co/0I0eLAmQ78 'Marriage Story' full trailer is here to break your heart\nhttps://t.co/v9qIpZ0BPh Wonder Woman herself is forming her own production company https://t.co/zTuQaPYjyY Blood floods a family's basement and we could not be more horrified https://t.co/oU7CiVjwpm Whew. Not looking too good, Tesla https://t.co/iv2ErmHnsM The average worker would have to work 2.8M years to earn as much as Jeff Bezos https://t.co/gS1J3ij5oD This Italian translator is all of us https://t.co/Qyj94SeXzM Things we loved this decade that everyone else...didn't\nhttps://t.co/AiNCzOFj02 Imagine never buying a plastic shampoo or shower gel bottle ever again https://t.co/Xr8vQVXDVw Space is beautiful https://t.co/Yq4XA8WEhw Don't worry about your extremely online devices spying on you. Worry about them dying unexpectedly. https://t.co/YBlteluLM3 'Marriage Story' full trailer is here to break your heart\nhttps://t.co/diP9l2GYyZ This anti-manspreading chair is absolutely brilliant https://t.co/FwLanjwJqZ Somehow this is not yet illegal https://t.co/fq5T57UdSc GoPro Hero 8 Review: The most stable GoPro ever https://t.co/bleklHrdCH https://t.co/sP0qCOKqZO Food delivery robots? Yes, please! https://t.co/F2grnJZfsl Samsung Galaxy S10 bug lets any fingerprint unlock it\nhttps://t.co/gBVM7l5jHI https://t.co/UGuh0IV7eL Someone reverse engineered the umbrella - and it totally works https://t.co/oeV33Y5xEy Things we loved this decade that everyone else...didn't\nhttps://t.co/Uy1WmOWMuX The Turkish president apparently threw Trump's ridiculous letter in the trash https://t.co/hTjBu0bDfz The moon looks even better in 4k https://t.co/a5TyV9j3bZ 'Maleficent: Mistress of Evil' is far from the fantasy we'd been wishing for\nhttps://t.co/fs48vv1sVU These domes simulate the air quality of heavily polluted cities https://t.co/dzQfDNNN6M Your favorite pop culture icons were given a sneaker makeover thanks to this artist https://t.co/S4TYr8HlSc This AI software can predict and fill missing pieces in photos https://t.co/Vt15O3VRyk 'Maleficent: Mistress of Evil' delivers too little Maleficent and too much of everything else\nhttps://t.co/Y12EKggDnr If you can't stand one more episode of 'Paw Patrol,' try the delightful 'Molly of Denali'  https://t.co/mxmFLG3nYX Researchers at MIT are now able to program water droplets and move them individually across surface https://t.co/jZRQholYVI A Brexit-free news channel has launched in the UK because we are all sooooooo tiredddddddd https://t.co/rqjyRXYZhH https://t.co/qQvXMgIlsE Here’s the technology behind those mesmerizing drone light shows https://t.co/pRTERm5hwM Jimmy Kimmel mocks Trump's mind-boggling letter to Turkey's president\nhttps://t.co/kFnNqbFu9v https://t.co/AqyThXduBp SO COOL! https://t.co/F2LkBbfTWy Lena Headey, Riz Ahmed, Benedict Cumberbatch say 'we are all hypocrites' about high-carbon lifestyles https://t.co/xi1LGxT89T https://t.co/HDnKrK41q5 This guy breathes new life into these old damaged paintings https://t.co/gZsIBkwBl6 These water taxis could make moving around cities easier https://t.co/moK0p7VglG The fashion industry is super wasteful, and this man has a solution https://t.co/xG6WiAzIS5 The most dominant shark of the deep sea was tagged at depth for the first time\n\nhttps://t.co/xh6fRGKLMf https://t.co/nbFVfAy8WI Look ma, no hands! https://t.co/zWYtcg8H5t Trevor Noah ruthlessly mocks Eric and Donald Trump Jr. over their nepotism self-owns\nhttps://t.co/DjitXzovJO https://t.co/zBl1GkAT0z Spraying this material on desert sand will turn it into fertile land https://t.co/bOfMLIco6F Don't worry about your extremely online devices spying on you. Worry about them dying unexpectedly. https://t.co/gulO0LgTHm \"Damn I jus passed out.\" https://t.co/xZjPKZcKJJ The Boston Dynamics robots just keep getting more and more terrifying https://t.co/WDuEeVBKht Jennifer Aniston reacts to her new, record-breaking Instagram account\nhttps://t.co/vvnE4Su8i5 https://t.co/KgPFlVTpbm You know you’re getting old when you remember using these phones https://t.co/pNRqMmVSnP A new way of cycling is coming with airless tires that never go flat https://t.co/kaotJb9unx These kids get to run around school for 15 minutes every day and it's improving their health https://t.co/cRAfiAy5kf Can't. Stop. Watching https://t.co/lru6kZhrGl Donald Trump Jr. delivered a stunning self-own in a Fox News rant about nepotism https://t.co/q1IcZ2SRkR https://t.co/rMREzzg5WF Inside the technology that helps self-driving cars \"see\" https://t.co/Jc55xiOSnq We traveled to a recycling plant to see how our trash becomes another person's treasure https://t.co/VfVPgmkNp9 These glasses can help people with disabilities use technology without their hands https://t.co/Zc1IuucwlA This artificial human cornea only takes 10 minutes to 3D print https://t.co/2rdFTNKXNw This city is 3D printing a tiny neighborhood of sustainable homes https://t.co/tc6NxoEgpy This boy's life is changed when he is gifted color blindness glasses for the first time https://t.co/peJmRPCERX These shoes are made out of an unexpected material... chewing gum off the streets https://t.co/VRCSx73Iou Trump's letter to Turkey's president is almost beyond parody, but not beyond memes https://t.co/TIcvDn6kVv The future of the internet could depend on submarine data centers https://t.co/UbixfDIo4d This leg suit lets you sit anywhere without needing to grab a chair https://t.co/MgL6E7OFRB These sharks appear to 'glow' in the dark https://t.co/Uwe2mIsejF A teenage millionaire built a real-life Dr. Octopus suit https://t.co/EslH5KWjMM This robotic fish could be used to collect data under water https://t.co/HAvWgZxKVJ This prosthetic ankle is a game-changer https://t.co/eX2LIRs1ZH Space is dirty and this satellite could help us clean it up one day https://t.co/YzHaqgpn69 Trump tweeted a photo of Nancy Pelosi to insult her, and it backfired spectacularly https://t.co/UHr66gpHRd We got to see how Microsoft tests their devices to death https://t.co/RLzywTGUs7 The military is developing a shapeshifting wheel https://t.co/2rlSskGR86 Trump's letter to Turkish president is so ridiculous people didn't believe it was real\nhttps://t.co/rE4KnO4wIa These floating neighborhoods are affordable housing for students https://t.co/SDW8HRBASr Not sure if we should be amazed or terrified https://t.co/s4goO5bFMM A family of 5 now lives in this 3D printed home https://t.co/F2f5T4G7Gc Trump's letter to Turkey's president is almost beyond parody, but not beyond memes https://t.co/rk8DiJQ18G This year's PSAT memes are here to anger the College Board https://t.co/8i8DbVdNER This woman is cleaning up the streets by turning old chewing gum into new rubber objects https://t.co/Zers4xtNRb Trump tweeted a photo of Nancy Pelosi to insult her, and it backfired spectacularly https://t.co/zJFKQnkJTD This robot has human-like fingers that perform immensely complex tasks, like unscrewing bottles https://t.co/DrsnTNAQaA This floating park is made entirely out of plastic debris https://t.co/aKg7pUVDMP Seth Rogen responds to underaged kid arrested for his fake 'McLovin' ID https://t.co/D2f5YBAHP2 Goodbye used coffee grounds, hello reusable coffee cup https://t.co/x0xnC5IlAz We regret to inform you this exists. https://t.co/ELjLSABrZ1 Can you tell these works of art were made by robots? https://t.co/O6FbIJRron Here's the real costs of the perfect homes you see in movies https://t.co/Qh8uIh05gD Honestly, @GIPHY's eyeball-melting \"micro-games\" are kind of genius\nhttps://t.co/aexmeXkO86 https://t.co/0z0Jrs1eDx This year's PSAT memes are here to anger the College Board https://t.co/dd85O3S7GO The Vatican wants you to pray with this smart rosary\nhttps://t.co/t8v1pykvpS https://t.co/RW4ODdSkWn Trump's letter to Turkish president is so ridiculous people didn't believe it was real\nhttps://t.co/dFwR2lOEfE These boats are created from plastic from Amsterdam's canals https://t.co/pYOZZLjlUY Here's why Google's Pixel 4 doesn't have 5G https://t.co/6X667RIQ4T via @PCMag It's so tiny! https://t.co/Wtd2nvpKzP Must see content https://t.co/0hK1uSreBV This artist's hyperreal pencil drawings look like photographs https://t.co/MLojtBSW1v Seth Rogen responds to underaged kid arrested for his fake 'McLovin' ID https://t.co/fYK3XOqdqM This sexy Bugatti sports car is actually made of Lego https://t.co/OhtvTRzhIm Just a fun fact to remember the next time you clock in to work! 😩 In the United States, a full-time salaried worker makes about $46,800, according to Quartz. If you take Bezos’ net worth of $130 billion and divide it up by the amount of time an average full-time worker spends on the job, you’d get 2.8 million years. It would take 2.8 million years to earn as much as Jeff Bezos https://t.co/zWzFPMJ4z4 These unusual sculptures are not what they seem https://t.co/vFwt53m3lU This artificial wave pool could change surfing forever https://t.co/BO54kwo6DF The future of movie theaters could mean even more screens https://t.co/EGzfbyozXL Here's why the 'Office Ladies' podcast is worth your time https://t.co/zgKxeGCCUv https://t.co/0ixZ3F6JKL 'The Man in the High Castle' pledges rebellion in high-stakes Season 4 trailer\nhttps://t.co/ek1nPFLzVx OK, Volvo, we see you https://t.co/z2boRyH3D3 Volvo's first all-electric car is here https://t.co/3xdFr0GZkg Looking back on a decade of comfort TV with creator Michael Schur \nhttps://t.co/k1LMpaV9zc Weird fact of the day: bacteria in your stomach can produce electricity ⚡️ https://t.co/1rlkTS6YKN Looks like you don’t need to be royal to take the crown 👑 According to Guinness World Records, Jennifer Aniston just broke one. Before she gained one million followers in 5 hours and 16 minutes, the previous record-holders were Prince Harry and Meghan Markle, who achieved the feat in 5 hours and 45 minutes. Jennifer Aniston reached one million Instagram followers in just 5 hours and 16 minutes, breaking the world record https://t.co/Q7lUWzy9UF Defy gravity at this interactive optical-illusion museum https://t.co/oR4mX6Hi4q NASA paid $5 million for SpaceX employee training after Elon Musk smoked weed with Joe Rogan https://t.co/I3CmKNj0Gb https://t.co/h9vHhPKemU Experts were able to reactivate the spinal cord circuits of a paralyzed man https://t.co/NXihKxA5Ll 'The Man in the High Castle' pledges rebellion in high-stakes Season 4 trailer\nhttps://t.co/Jt5VbVzXGr This digital art installation is completely mesmerizing https://t.co/ir04SYG5mu We're officially living in the future https://t.co/HLv3L9ntBX A sneak peak at the Pokemon Wave Hello, a quick demo to show how the Pixel 4’s new air gesture features work. 👋 https://t.co/hpIH6XReqv This could be the hi-tech thermometer we've been waiting for https://t.co/nRvkedspIy This sculpture looks like water suspended in the air https://t.co/B1GXTYCBPA Sad song aficionados, the 'my headphones' meme is for you https://t.co/w3AgsyEhQ8 Why camp by a river when you can camp on one? https://t.co/je0BkECsNl The future of food is here - and it's 3D-printed https://t.co/LTQKmDb7UR Here's why the 'Office Ladies' podcast is worth your time https://t.co/NFLMZBqlgL This wetsuit could protect you from shark attacks https://t.co/AZU5KXFfsf \"What does 'Jedi' mean?\" \"Look it up in the dictionary.\" https://t.co/7hYEsJnS2e The Analogue Pocket celebrates the history of mobile gaming\nhttps://t.co/V3MHQ0Roea Because we need someone to create the next \"Fortnite\" https://t.co/F0W50uUsNl UK government ditches 'porn block'. What happens now?\nhttps://t.co/ofSCNah6lM https://t.co/luGcL5lQIc These smart glasses could be totally revolutionary https://t.co/yp0TbmELfD The Phorpiex botnet is scamming people with a nasty email spam attack https://t.co/mZ843UoFyv LED snowboard prototype lights up the slopes https://t.co/UEqrLMiSXS 'His Dark Materials' stays faithful to the book in strong opening episode\nhttps://t.co/7PBp85WbQS https://t.co/S9pXUxgM8I What's in an iPhone? These scientists made an iPhone smoothie to find out https://t.co/ArvyPDzqbi The Analogue Pocket celebrates the history of mobile gaming\nhttps://t.co/CeNOFoZDBa 12 Keanu Reeves characters to dress as this Halloween https://t.co/Uy2QMYZ5xz These photos are no joke https://t.co/GY1QoEMtja If this is what the future looks like, we're not complaining https://t.co/nuGEHTr4g3 Elon Musk says monster Tesla seen on racetrack will go into production by summer 2020\nhttps://t.co/PuqvbZtfUl https://t.co/oqAHWAXBZh Seriously, is there anything robots can't do? https://t.co/fcIHc5eUps Transform your listening experience and discover the new tech every music lover should have right now. https://t.co/x6N6eqaATQ @walmart #ad https://t.co/mgMJaGJZdL These disposable plates are made entirely out of leaves 🍃🍽 https://t.co/J7hSbXBxIR Sad song aficionados, the 'my headphones' meme is for you https://t.co/qcd27HodKe These drones are taking on tasks so humans don't have to https://t.co/apVMe0MYPn Finally, someone invented shoes that could actually be 100% waterproof https://t.co/zCdegPCOdV Looking back on a decade of comfort TV with creator Michael Schur\nhttps://t.co/4oR41DTJDl Robots can basically do everything now https://t.co/spdAsEEPlF Looking back on a decade of comfort TV with 'The Good Place' creator Michael Schur\nhttps://t.co/X95E6glAu7 A Chinese news agency unveiled two AI anchors https://t.co/uupf2Wme00 This Lego-like bike path is made from recycled plastic https://t.co/lFrKZiKlYl This waterpark was designed for people with disabilities https://t.co/z7S7VSDenM As if we needed robots to get anymore terrifying https://t.co/Dexabh3cEn This is one the friendliest robots we've ever seen https://t.co/CGueWAdxnl Paul Rudd confuses Britney Spears with British beers and we've all been there mate https://t.co/ijtdLkGnPB https://t.co/KoTky9mcSY We are thoroughly creeped out by these robots https://t.co/ckeqEFPsoe Meet Vector, the cutest robot ever https://t.co/5fcOXViRHF Tarana Burke launches #MeTooVoter to hold political leaders accountable https://t.co/A0XVhAbMwy https://t.co/bR9gTtxAcY A lightweight, prefabricated concrete roof is just a taste of the coming revolution in architecture https://t.co/aVO1tpcffD This farm is run by robots and AI https://t.co/2EF6gAv8UD This tiny robotic spider might one day perform surgeries inside your body https://t.co/tIBhwdtAVd This satellite net is cleaning up space junk https://t.co/s4kcOlyPhE 'His Dark Materials' bosses confirm the new series will be just as dark as the books\nhttps://t.co/rNHtU7PAgm https://t.co/5aLzEN6k03 These biodegradable cups could help solve our planet's plastic problem https://t.co/II46o2oTIi The robot dog empire is upon us https://t.co/GIzcHTdKYx These custom dolls help young people feel powerful in their own skin https://t.co/r7iWEMUMU6 10 of our favourite British TV shows from the past decade https://t.co/4rHTaQ5txX https://t.co/vYSQRnZCoI This 11-year-old is a genius and a DJ champion. Chill https://t.co/F9e9Wz7GKR OK, this dancing robot is actually pretty cute https://t.co/N2V0KNDCqy When did Google become stingy like Apple?\nhttps://t.co/JOUOTXxe5o https://t.co/5kMxlnqzvi A 2,400-year-old merchant ship has been found on the bottom of the Black Sea https://t.co/Fg8PDbIuNt These Lego-like bricks are actually robots https://t.co/kEAovdkaGd This man is biking on water to save the planet https://t.co/xygVdghZCv Turn heads with this self-balancing scooter https://t.co/20Wbfp7SlY We need more inclusive playgrounds like this one https://t.co/WeMBONMUmH Robots don't just live in warehouses, they're also herding cattle https://t.co/dwMiLzaQRW BMW has designed a self-driving motorcycle https://t.co/ylaOHlKzF3 This algae 'curtain' could make city buildings into urban trees https://t.co/1zO7sA3qxi You won't believe your eyes when you see this giant sea worm https://t.co/laTkPxPHOa The moderators did not ask candidates directly about immigration, the climate crisis, campaign finance, housing, voter suppression, LGBTQ+ rights, or domestic violence. https://t.co/5c6ZeGLVe4 This robot is taking on everyone's least favorite chore https://t.co/7zEhJTr9nY A Dutch designer is collecting food waste to turn it into 3D printed snacks https://t.co/xYfKinuGva This computer could help maximize desk space https://t.co/K1Hs127SQN NEED THIS https://t.co/bo5lLQffsI This wearable AI translator could change the way you travel https://t.co/CgzQbKYZrg This is the 'world's cheapest electric car' https://t.co/VWnqomC9kx This could be the future of retail delivery https://t.co/EG1HMMJOJR This glove could be the future of physical therapy https://t.co/dexUhUv2Vk LG's rollable TV is here and whoa https://t.co/O6nJjRLePQ Calling all vloggers: This AI-enabled camera could level up your vlog game https://t.co/4KhMvBRGN7 Nike is really stepping up the creativity game with these... grass sneakers https://t.co/1ziv8ZI4LN There's more to this ski slope than meets the eye https://t.co/vuj9nqRRsL Nestlé is ditching plastic straws by 2025 https://t.co/jeCiR6DLk8 These 3D-printed shoes are SICK https://t.co/YaONQ9LZQq This LEGO truck is pretty impressive https://t.co/HeOJWc4LMA This robot is the perfect playmate for your pets https://t.co/JNZJAgwElY Welcome to the future of location tracking https://t.co/xcE9gPNlCv Website peddling 26 million stolen credit and debit cards got hacked https://t.co/p2xiNq1RiU Self-driving cars just got quite an upgrade https://t.co/CvUwSEjmYu Nothing creepy about this 14-inch tall robot. Nothing. https://t.co/IL1XOmOaVp Tarana Burke launches #MeTooVoter to hold political leaders accountable https://t.co/attYUGCWzG https://t.co/ECDu4hqwpY Seriously, is there anything robots can't do? https://t.co/EqjFCpCQjg Google Pixel 4 hands-on: Pikachu is fun, but the Recorder app is even cooler\nhttps://t.co/leN7p5d7Am https://t.co/dthtvVg2dJ Google's sustainability investments don't go far enough\nhttps://t.co/NrGdFD486T https://t.co/UvF5ISfHAV You've never seen a 3D printer like this before https://t.co/yXRNEEVUHC Our 15 favorite video games from the 2010s\nhttps://t.co/xIPvhsYQiT This kit gives wheelchairs an accessibility upgrade https://t.co/mTLBgFKGpd Less shaming in school is always a good thing https://t.co/8PpK5DoXSf May le force be with you https://t.co/yE6HcTwM31 Get ready to pop, lock, and drop in 2024 https://t.co/aAmWQ8OWGe Health is wealth, friends https://t.co/s25FSZnfH4 Idina Menzel may be adding another princess movie to her resume https://t.co/ODks4tMzJq This tiny robot is basically an all-star gymnast https://t.co/HURujZHCq2 'Wheel of Fortune' contestant quips about his 'loveless marriage' and it gets awkward https://t.co/W2vZBlUhI8 https://t.co/146uRW3XYW This is as close to perfect casting as we're ever gonna get https://t.co/GCFAOCCOG3 Ever feel like the internet's watching you? https://t.co/HddoJxvu0c Lady Gaga asked Twitter what 'Fortnight' is and it went about as well as you'd expect https://t.co/KQ2OPMI9wA The new Nest Mini is the Home Mini but better https://t.co/sQJb3PJra1 These photos are no joke https://t.co/laXAJrRUm7 Instagram adds a new feature that makes it easier for people to control which third-party apps have access to their account\nhttps://t.co/7lqITlB7ar https://t.co/LOijCiPD2r This robot has no limits https://t.co/faXpIEfrjj Tense 'Bombshell' trailer digs deeper into the Fox News scandal\nhttps://t.co/rq0WTVgS2d AI just keeps getting cooler and cooler https://t.co/qjCWFEb2yH Nobody tell her https://t.co/OCRYTgrgCO Tarana Burke launches #MeTooVoter to hold political leaders accountable\n\nhttps://t.co/b1r14odnz5 https://t.co/Nd3UAvePI0 Reduce, reuse, and recycled responsibly, friends! https://t.co/1LQfgsxv0y The 15 best TV shows of the 2010s\nhttps://t.co/yUImkTqA6V Awwwwwwww 🚗🚗🚗 https://t.co/XyWUg3wrs0 Is 200,000 folds enough? https://t.co/MZ4DvN7hNC Dwayne Johnson's biggest fan is his mom in sweet 'Hobbs &amp; Shaw' featurette\nhttps://t.co/FiHlKbDYc8 This futuristic street light design is surprisingly eco-friendly https://t.co/myOesH8vzw I wouldn't trust that hotel bed if I were you... https://t.co/GP3YSSvCAs What Google revealed at today's big event: Pixel 4, Nest Mini, and more https://t.co/BdbLXHN9nE Meet the women fighting sexism on Wikipedia https://t.co/3cJ9ULCZnE How Google, Samsung, Amazon, and Microsoft's earbuds stack up to AirPods\nhttps://t.co/aHZW7hhfUi https://t.co/2JQBZGFXsa 'Gone Girl' gave a face to an ancient monster of myth\nhttps://t.co/qc1lZShYb2 This suitcase aims to make traveling a ~little~ bit easier https://t.co/m8GydNTqup Tense 'Bombshell' trailer digs deeper into the Fox News scandal\nhttps://t.co/aTPnfyV2dj This is literally a dream, no pun intended https://t.co/APyS9a2Htu This thermometer is totally hi-tech https://t.co/kvZXFaLbpM Apple unveils Beats Solo Pro with noise cancellation and 22 hours of battery\nhttps://t.co/dHTJaIRj7o https://t.co/TY8CV1eHX8 Dwayne Johnson's biggest fan is his mom in sweet 'Hobbs &amp; Shaw' featurette\nhttps://t.co/gROLNBvqlK President Trump just literally begged us to impeach him https://t.co/ZXCdAlRHgi This plant-based egg totally changes the game https://t.co/yL3EEJ0GLM We have no choice but to stan icon Jane Fonda https://t.co/PSup7briNU 'Gone Girl' gave a face to an ancient monster of myth\nhttps://t.co/0HvpXLyUzK BRB, getting a Google Assistant so we can listen to Issa Rae all day long https://t.co/K2Xd0H15b3 The 'Friends' cast all finally reunited for a sweet selfie\nhttps://t.co/qUH56ZFtwZ Rubik's Cube inventor Erno Rubik breaks down the math behind the iconic toy https://t.co/37MwrsvgOR Happy Tuesday from the first group photo of all six Friends since 2004, courtesy of Jennifer Aniston https://t.co/VaSe4UrU5G This robot has mad penmanship skills https://t.co/7mpZE9O72W 'Gone Girl' gave a face to an ancient monster of myth\nhttps://t.co/kwWgUdmoFN This three-in-one device is giving us major throwback vibes https://t.co/n3IaDhLgTN Google unveils Pixel 4 and Pixel 4 XL after so, so many leaks https://t.co/2AIzAvF5HU https://t.co/ABKfBANjIA Irish man hilariously pranks his family at his own funeral https://t.co/psMMdkDo7z 'Wheel of Fortune' contestant quips about his 'loveless marriage' and it gets awkward https://t.co/CdtSQF1AAG https://t.co/EccuQRCdZl Google unveils new high-end Chromebook with colorful, grippy bottom\nhttps://t.co/0VAAAhwbdX https://t.co/68WLlxb7Rq LED snowboard prototype lights up the slopes https://t.co/3G4IUaOlpo Google drops sleek new Pixel Buds\nhttps://t.co/yO0CGlnUmJ https://t.co/bnCFcXd535 Say goodbye to plastic bottles https://t.co/gYCFJOUn33 Our 15 favorite video games from the 2010s\nhttps://t.co/2P4woHJxWw Is there anything drones can't do? https://t.co/yJds5g4qTQ Weird fact of the day: bacteria in your stomach can produce electricity ⚡️ https://t.co/39ACfo49k9 The 'Friends' cast all finally reunited for a sweet selfie\nhttps://t.co/LPI3nSn31r The big #madebygoogle event is about to start. Here is how to watch. https://t.co/Vdm6sLHXYh Google Pixel 4 pre-order pages reveal starting price https://t.co/CTLZ5ADD8Q https://t.co/WMgCDs2Xns This taxi is next level https://t.co/We7U6JqDI3 The 15 best TV shows of the 2010s\nhttps://t.co/8VT3LlMIhH And those kicks were fast as lightning https://t.co/GijuDgP8Fz 10 trends of the 2010s that changed how we see TV\nhttps://t.co/R4H4PD9Rd3 The 2020 Olympics are gonna be pretty hi-tech https://t.co/UG4jZGXmk1 Our 15 favorite video games from the 2010s\nhttps://t.co/a1FeJAgAhp The best inventions come from the least expected places https://t.co/IK0JyZcRk2 This underwater restaurant is also a marine life research center https://t.co/kjTPooXtvE The 15 best TV shows of the 2010s\nhttps://t.co/jeDzN86q54 This vase doubles as a fire extinguisher https://t.co/PxTDaxDxPo Here's all the new stuff to get excited about in 'Fortnite' Chapter 2 https://t.co/iFnQmPHTW5 https://t.co/zwF52aq5n5 OK, Amazon. We see you https://t.co/vRKB7IovMq This self-driving bus is totally futuristic https://t.co/Q8k7JGMfGD Oxford English Dictionary gets a major Star Wars update https://t.co/5d4wqpkhje https://t.co/eQMLjn27EC This could be the beginning of home robots https://t.co/DTpAHzt2e9 9 photos that show Typhoon Hagibis' destruction https://t.co/RBlWGEenwl https://t.co/11bkldjZyl Could this airport be any cooler? https://t.co/fcoVbM9RDE Simone Biles recreates her signature triple-double routine in Lego bricks https://t.co/Q3UCiEDRoY https://t.co/gSsVe36eWI A whole new way to grocery shop https://t.co/gwUKETQxaI Roku's newest audio equipment almost sells itself https://t.co/eqyIS2trEx Ryan Reynolds' tweet about auditioning at Marvel is classic Ryan Reynolds\nhttps://t.co/e7Ie0gfTWY https://t.co/nL6TRE1kRP One small step for that robot, one giant leap for automated deliveries https://t.co/Acm6DgpQTg 'Fortnite' Chapter 2 trailer is here and it looks every bit as epic as we'd hoped https://t.co/sGIiYvNf6t https://t.co/aSqdmwWFc5 Musk's idea is coming to life https://t.co/2gLYNBq8p5 The spelling and grammar rules do not apply on the Millennial Internet™. \nhttps://t.co/QNQuBpdYdS Astronauts could be living in these 3D-printed buildings on Mars one day https://t.co/luHte44rWg Absolutely brilliant. https://t.co/YNTZXmA1Dg Bruised and battered, Libra trudges on https://t.co/0MQ2hRQ6rX https://t.co/xE5chmJ7q8 The McHive is keeping bees safe https://t.co/Y2YQLFFtmu This 'helicopter' could be the future of air travel https://t.co/ofQzmLHPUo This robot farmer can harvest tens of thousands of raspberries in a single shift https://t.co/9hWlKPolx2 This flying motorcycle sure looks...interesting https://t.co/UGbpLk4TuR Meet the artist who uses her gift to celebrate blackness https://t.co/6JQLp2WC5N Can you tell the difference? https://t.co/sF4N1bDpQQ Time for take off https://t.co/SkQyovzLd0 The door handle of the future is here https://t.co/HplgFXxYpe Strawberry robots forever 🍓 https://t.co/sAcIttnqxM E-bike, but make it retro https://t.co/als0mE8UBa Never lose your smartwatch again with this touchscreen projection https://t.co/AkOTqdqhPG Space is beautiful https://t.co/fyYFWjacXy Planes, trains and automobiles all wrapped into one epic hybrid https://t.co/bK2d13Tkji This robot will do the dirty work, literally https://t.co/7tLh5PzryD Everyone, meet the 'ravioli' starfish https://t.co/kZYGfRZGW0 This robot could totally change gardening https://t.co/XC6sJKTJLH This speedboat/submarine is straight out of a James Bond movie https://t.co/5XbxwJhwmi Japan's bullet train tracks were flooded in Typhoon Hagibis https://t.co/toLyjaa3Cn This home-grown algae is equal parts home decor and air purifier https://t.co/kbl4LQ1Q85 New live-action 'Lady And The Tramp' trailer features canine flirting and Janelle Monáe https://t.co/4AdWA2QAs5 https://t.co/M9OSXWpHvr Food delivery robots? Yes, please! https://t.co/itjOl8agn4 Coinbase CEO calls Libra scrutiny 'un-American' https://t.co/i9S78y9JcY This could be the bodysuit of the future https://t.co/rqneMVmOnn Somehow this is not yet illegal https://t.co/bshgvhCGCD If you don't have time to watch 'Succession' this skit sums it up with M&amp;M's https://t.co/NZFc5EmSC8 And it's soft! https://t.co/bSi4rEUklI Things that go \"pfffffffffft\" in the night. https://t.co/BXolY1YL5m Miami is prepping for flying cars https://t.co/bmm0OAVAKY This anti-manspreading chair is absolutely brilliant https://t.co/BUnQqHivNh All hail the 2 best Halloween tweets of all time https://t.co/rmWJPCdyA0 Yeah stars are pretty, but can you count them all up? https://t.co/rLkFQmwprb 9 photos that show Typhoon Hagibis' destruction https://t.co/JzcvEraF67 https://t.co/bDG3ujd3uX You've never seen anything like this 3D-printed art before https://t.co/V3lFaOa6Wq The world's first flying motorcycle is gonna be a reality in 2020 https://t.co/SHmaTlMuvJ Massive Tamagotchi or smart planter? You decide https://t.co/RgVBcxa9qa These robotic hands let the user feel what they're holding https://t.co/lmLsx7FdvO Yer a wizard, Hamster Potter! https://t.co/XYkmZESEDc 6 states that recognized Indigenous Peoples' Day this year\n\nhttps://t.co/yp1Q3Ise30 https://t.co/xxRBBtXWEu NASA's climbing robot is totally fearless https://t.co/5r1pykqEXZ Woah 😲 https://t.co/aRPikMU57w Watch thousands of people do the wave at Lizzo's ACL set https://t.co/S00DE5o68v We have no choice but to stan icon Jane Fonda https://t.co/cxlZ2Lm2JF Sony's new wireless earbuds will kill the noise around you https://t.co/jnjJJgN1TK Gifts for people whose favorite TV show ended this year\nhttps://t.co/dm1vgd0Qvq 'Fresh Prince' could be making a comeback, so we'll be manifesting this until it comes true https://t.co/tYTvcCds83 This digital art exhibit changes based on the visitor's mood https://t.co/vFXU9thBxU #FacebookLockout: Facebook users report being locked out for reporting scammers and fake accounts https://t.co/OHf9n0TEnO https://t.co/CMVCzUrcMj Looks like Pope Francis may just be the #Saints lucky charm https://t.co/vA1D8LH7eD If you don't have time to watch 'Succession' this skit sums it up with M&amp;M's https://t.co/SmQRy53Gqa This upcycled camera is no joke https://t.co/M0J6IgxTgF All hail the 2 best Halloween tweets of all time https://t.co/Tvaz8CycZY Read more about \"Ouijazilla\" here:\nhttps://t.co/nmqojlY6lH Do you remember your mom's first smile? Now you can. https://t.co/BBJTQ105xb The board became a reality in Salem, Massachusetts after it was transported from New Jersey in pieces. Rick “Ormortis” Schreck came up with the concept for the gigantic summoning space. The board’s planchette weighs almost 400 pounds and is fully functional. It can be maneuvered across the board’s surface by just one user, or a large group. Gigantic summoning is indeed a possibility. The board - known officially as “Ouijazilla” - measures 3,168 square feet and weighs over 9,000 pounds. It was constructed out of 99 sheets of plywood and 20 gallons of wood stain. Here’s the world’s largest Ouija board. Ya know, in case you want to summon multiple dead people at once. https://t.co/NwunY7ctFm Which entertainer had the best 2010s?\nhttps://t.co/UdUFgOPYQH How Japan’s million dollar robot priest is transforming Buddhism https://t.co/jjxRVUkcDh Mark Zuckerberg reportedly met with Tucker Carlson, Ben Shapiro, and other conservatives https://t.co/uwDJGjTvKD https://t.co/oDBzJaVfYU The 15 best films of the 2010s\nhttps://t.co/F2KJ5EAUAg 3D printing human organs could be a reality sooner than you think https://t.co/vGTPHWzDoI So small, yet so efficient! https://t.co/L16QCRhCfW Trump wished the Navy a happy birthday instead of his daughter Tiffany https://t.co/YFmZA8raRm How many cup holders does it have though? https://t.co/MRgR0ZaWHD This friendly robot makes a great pet if you can't have animals in your apartment https://t.co/TMzyY7Kufq WeWork's other toxicity problem: formaldehyde https://t.co/ZLbHu0wtPG https://t.co/jAcIZrsYXU Irish man hilariously pranks his family at his own funeral https://t.co/kyjrosonYI The more this camera sees, the smarter it becomes https://t.co/ZTRIVX5eDP Disney's back catalog is coming to Disney+. Here are all the titles.\nhttps://t.co/HZSbHljAII This is what happens when food science and 3D printing collide https://t.co/iFjqudanOL These tiny drones are seriously impressive https://t.co/ddwhxZlQsq 12 meme costume ideas for Halloween 2019 https://t.co/Ljb20mNM4C https://t.co/pRocQIa4OL This man's weight loss journey is seriously inspirational https://t.co/szunKMPfYV Have an old Roku device? You may have trouble streaming Netflix starting this December https://t.co/R6NMCu01hs via @PCMag This AR motorcycle helmet is next level https://t.co/46YCF9Jh4y Disney's back catalog is coming to Disney+. Here are all the titles.\nhttps://t.co/QAyROZhHWG 9 photos that show Typhoon Hagibis' destruction\n\nhttps://t.co/XtslbnmwfD https://t.co/5G9mwWTVE9 This great-grandma holds a record and she's a got a pretty amazing reason for it https://t.co/gSN7GJPNjb This 3D-printed motorbike is sick https://t.co/PX5ziU3tJd 'He would be loving this right now.' \nIrish man hilariously pranks his family at his own funeral https://t.co/EW4VSnFtsl https://t.co/bKUekLq4SC Cyborg plants are real, and we should make more of them https://t.co/qVPNakJoR4 And now we're crying https://t.co/BS0vLehenk Which entertainer had the best 2010s?\nhttps://t.co/Vevjky9toK Fortnite players when the whole island got sucked into a black hole https://t.co/9YKj4v7RfO Trump wished the Navy a happy birthday instead of his daughter Tiffany https://t.co/X9XTsutJBl Watch thousands of people do the wave at Lizzo's ACL set https://t.co/TyOA7SEna1 How to watch Google's Pixel 4 event\nhttps://t.co/s0PTmNmYay https://t.co/UUNQYl1xdT OK vegans, it's your time to shine https://t.co/HW7k76hcxA Irish man hilariously pranks his family at his own funeral https://t.co/NREGTwkQXL So where do we buy tickets to see this movie?? https://t.co/pseXoO3xqg 12 meme costume ideas for Halloween 2019 https://t.co/xk7iPXsfiI https://t.co/PA98VBx2l4 We could see getting into this https://t.co/F2MzU1vdIF Happy Monday from us and Lizzo’s insane human tidal wave 🙌🌊 https://t.co/rCsUh8IZmD Singapore officially wins at best airport ever ✈️ https://t.co/ZGyOZ2kKKc 12 meme costume ideas for Halloween 2019 https://t.co/pmKHichBeY https://t.co/yuOxpspD0w This super strong artificial muscle brings us closer to lifelike robots https://t.co/HPnodRVCQo These igloo shelters are helping the homeless survive low temperatures https://t.co/ew6IOninck These sculptures are not what they seem https://t.co/bHfKAv8ZEt This artist 'paints' using the sun 😱 https://t.co/Du41a13U56 Elon Musk describes Tesla pickup as \"armored personnel carrier from the future\"\nhttps://t.co/F3ZrdnCOBx This simple plastic bottle cutter may be the answer to better recycling https://t.co/dEFbzyUUtu 10 trends of the 2010s that changed how we see TV\nhttps://t.co/VQMzMTXFXj What could go wrong? https://t.co/C2K91vPpAh Reddit wants more teen users. Can Snapchat help? https://t.co/tt2e2j4Ta1 This 20-pound collapsible kayak is the lightest we've found https://t.co/AOGltJl1d4 The 15 best films of the 2010s\nhttps://t.co/YhaKzN2Fje Say goodbye to back pain, parents! https://t.co/UmzdqedTqN The 15 best films of the 2010s\nhttps://t.co/42OcFdzo10 10 trends of the 2010s that changed how we see TV\nhttps://t.co/8DVVpfM6jZ Your pets will be begging you to leave after getting this toy https://t.co/y8RpmKUCXJ Guided by magnets, this tiny thread could one day enter your brain to clear blood clots https://t.co/yMRKfLY82t Once it's on Facebook, it's there forever https://t.co/giDOYjhgAH Into it. https://t.co/undPFPQOwK Don't fake it. https://t.co/w78ri3zhwN BMW just painted a car with the blackest black known to man https://t.co/Bfvk9Rtsfz This digital art installation is completely mesmerizing https://t.co/dlD1RX7SZA These water-filled headphones offer the listening experience of a lifetime https://t.co/HIH1lvaAMV \"Pumpkin spice might be a pillar of American society, but, to the outside world, it's just a bit weird.\" https://t.co/mDJ095UsH1 Ryan Reynolds' birthday message to Hugh Jackman got very brutal, very fast https://t.co/EKESUkKJBH https://t.co/yL024FpztA Turning orange peels into 3D printer filament https://t.co/sSpwfbPgpk Truly #blessed https://t.co/HK2yGewTdn This is a lifesaver for any last minute essays/resumes you have to print https://t.co/0c9JnLiHUk These glasses can correct colorblindness https://t.co/jtVl6G7Tso All your burning questions answered. https://t.co/bQoiR7EWU1 These cars could be super helpful in crowded cities https://t.co/sA4yfEjJ8T John Oliver's deep dive into weather forecasting gets seriously murky https://t.co/fWkA1maEWV https://t.co/jnQON0gfM8 Meet the mad scientist of the Internet who built an actual hoverbike in his garage https://t.co/1YkprX5JiS Porsche unveils electric Taycan 4S, starting at $103,800 https://t.co/GbbjEp9bFs https://t.co/YV6KADh7bJ This house is made out of cardboard but can last a 100 years https://t.co/6bdqJQQrRp This car of the future comes with its own greenhouse in the back https://t.co/pFFfGefMJk Apple's iPhone SE 2 might cost $399 and come in early 2020\nhttps://t.co/zMFK2c2s2a https://t.co/BRBJQKSnQk 'Fortnite' players are coping with The End with black hole memes, obviously https://t.co/JPk6A9xlK7 https://t.co/dwGthpFcPZ This isn't your average office lobby https://t.co/CNCQ7VFIxW This MIT robot shape-shifts into various gadgets in seconds https://t.co/GjdcEodGbO These moving 3-D printed sculptures are actually static https://t.co/9H9SMkH4Ma Someone has reinvented the broom and dustpan to make cleaning much easier https://t.co/dJRsXDrMml Meet the loneliest robot whose sole purpose is to sort pebbles https://t.co/UNna29gqxH You'll never have to make your bed again https://t.co/GYxGS3MKPz There is a saddle specifically designed for kids to legit ride on their parents https://t.co/qhMhzrlH6D This invention is the new jet ski and we want one https://t.co/hEmu92RjbC This mobility device allows paraplegics to move upright https://t.co/x5Seos0mse This 3-screen laptop is the dream of tech nerds everywhere https://t.co/tn04oddI4V Could this possibly be the TV of the future? https://t.co/1BZash7sDe Turn your average laptop into a touchscreen https://t.co/mypX7ANuYP Someone designed a notebook that can last forever https://t.co/gE2k7eVzbc This umbrella is a weather forecaster that reminds you to take it when it's raining https://t.co/EOsIMG7BVg Forget the recycling center... here's a DIY recycle machine https://t.co/C1cqbHa8cM Because pushing your chair back is sometimes too difficult https://t.co/GDgjxDMRTr This is the most intense gaming display we've ever seen 😱 https://t.co/hfAWnbGHiq This 2-year-old saw Bruce Banner turn into the Hulk and her reaction is priceless https://t.co/fVIRb4QG1k https://t.co/dVyaMC1yC9 This sponge-like material is 10 times stronger than steel https://t.co/HwKumLJUYX This video is guaranteed to mess you up https://t.co/eje4zWKzRr https://t.co/tIXCHGvsOI This is the world's first solar-powered road https://t.co/KvRVctCaPt How disgusting is your water bottle, really? https://t.co/KvaGyf7wi0 This cute robot will teach your 3-year-old to code https://t.co/lOgmcn0Txx Project a touch screen onto any surface https://t.co/moimLVMzPB This will make even the least outdoorsy person want to go camping https://t.co/FhbKWrQG7u This entire castle was 3D printed with concrete https://t.co/JwOo8myjpH These redesigned dumbbells are perfect for city apartments https://t.co/PJszAiY94A These pens have unlimited color options https://t.co/XERjxO9vA6 Watching this sand table change patterns is the most relaxing thing you'll see all day https://t.co/mUdYCQpJMZ He'll be one of the few in 'SNL' history to pull this \"double-duty\" gig on the show. https://t.co/pYhlO0auTK This bionic arm is giving patients the ability to feel sensations again https://t.co/yDRvaZ4XAK Uber is expanding its door-to-door delivery strategy down the grocery aisle. https://t.co/rjvMoxLU6S When your toothpaste gets low, you're going to need this device https://t.co/A9ZVH4i8QV Firefighters with jetpacks? You need to check this out https://t.co/2jaN6ofdqy Watch Olympic divers flawlessly take on the 'Avengers' pool challenge https://t.co/YBrKaPzGCX Take selfies with Nemo and the gang with this underwater device for your phone https://t.co/ZzwUQbLXWa It's more than twice the size of the previous record holder. https://t.co/LJlNHhj5bV Never again will your laces come undone https://t.co/scUF60IQEZ What it's like to get high and eat nachos at America's first cannabis cafe https://t.co/lpziGYNUaJ This super strong duct tape can tape anything https://t.co/5BiyCmLylW This might be the rarest material on the planet https://t.co/p7oHkxZ2K7 What is a vibe check anyway? https://t.co/mqV9TVrts4 This wheelchair is controlled using only the tip of your tongue https://t.co/Go25QAmxRn TV characters from 2019 that would make really great Halloween costumes https://t.co/W5qW7aokUJ This robot looks just like a bat and it's creepy af https://t.co/loxbp2TzFj The world is your oyster! Er, we mean keyboard https://t.co/8ZRf5rpBrO It looks like 'Fortnite' is over, folks. It was fun while it lasted. https://t.co/9VS1bPF9RS 'Dolittle' trailer shows us life after Iron Man for Robert Downey Jr. https://t.co/38gCqb3jSA https://t.co/3x0iasPCnb These beautiful vertical forests could help cities clean up air pollution https://t.co/ecRWu7XY9H Things are not looking good behind the scenes of the Atari VCS. https://t.co/gMx3Hss6zb Don't worry about remembering to water your plants, this planter does it for you https://t.co/HIzlTFAU90 If you have a bunch of old Lego pieces that you aren't using anymore, Lego has a program that will give them a new home. https://t.co/kLVIzcscDq This innovative thermometer could change the way we measure body temp https://t.co/BGfDdfz3qx I can't handle another chicken war https://t.co/46F6v4AhKI This is what happens when food science and 3D printing collide https://t.co/cr84EFZhzU This man's weight loss journey is seriously inspirational https://t.co/YivJzEtDWW This AR motorcycle helmet is next level https://t.co/Yz1DS9eAn3 These tiny drones are seriously impressive https://t.co/xk6xXlhjXQ We traveled to a recycling plant to see how our trash becomes another person's treasure https://t.co/Kx1Wt5ed9b Forget riding a bike... this one is powered by your footsteps https://t.co/VhcwVsBUqP Take selfies with the fish with this super cool underwater camera https://t.co/x2mGFhdAwL Program this flying robot to follow you everywhere https://t.co/ZKKsoqmGj7 Watch Olympic divers flawlessly take on the 'Avengers' pool challenge https://t.co/t4ILFny3aG This suitcase aims to make traveling a ~little~ bit easier https://t.co/oO8gvMUyIq This road can charge vehicles as they drive on https://t.co/mJIoaJkZpO This AI software can predict and fill missing pieces in photos https://t.co/jttCpdhP1H Four MIT graduates have just opened a restaurant where a robotic kitchen is preparing the meals https://t.co/GoNNoRqGml How disgusting is your water bottle, really? https://t.co/k2IZJHNSfz This desert farm is harvesting food using nothing but sunlight and seawater https://t.co/IUkYCidgJU Somebody needs to actually make this fake 'SNL' show, 'Dog Court'. https://t.co/Zzdbi761CU https://t.co/hGw9rKB3nd SoulCycle instructors hilariously try to motivate their class on 'SNL'. https://t.co/4GLWbiaIlF https://t.co/mSa2wRavJN This artificial human cornea only takes 10 minutes to 3D print https://t.co/TW71B1GJuD Watch Olympic divers flawlessly take on the 'Avengers' pool challenge https://t.co/G4siwD4pow Don't worry about remembering to water your plants, this planter does it for you https://t.co/AYvnOQxaxU David Harbour's 'SNL' monologue plunges us into the Upside Down. https://t.co/SE4yCDhqmj https://t.co/oKtiI3FzXh This vest is actually a wearable airbag https://t.co/1YCEXdNrKE TV characters from 2019 that would make really great Halloween costumes https://t.co/xk53BK1j5f Pete Davidson returns to 'SNL' for a Weekend Update segment on STDs. https://t.co/wgT5cEclE5 https://t.co/RGuQox1yxY This cat got bionic legs and omg the cuteness level is off the charts 😻 https://t.co/KCPOpG8MBA 'Joker' inspires a 'Sesame Street' nightmare for Oscar the Grouch on 'SNL'. https://t.co/xpoYAHRpFq https://t.co/82DVVq8LxI This robot is all legs and could one day deliver your groceries https://t.co/IX1xALKwSc All the Democrats debate LGBTQ issues in a guest-filled CNN town hall on 'SNL'. https://t.co/Ab43ieG2dD https://t.co/tcbxazBKqg 'Jexi' is, unfortunately, a movie fit for our times\nhttps://t.co/RDFoGU0vwn This 2-year-old saw Bruce Banner turn into the Hulk and her reaction is priceless https://t.co/0N96oxOKfn https://t.co/Pxu2YITTBR If you hate making salad, this is for you https://t.co/rOQzelL4BD Can't. Stop. Watching. https://t.co/pvLPBBTfDR A cleaner alternative to sitting in your fruit bowl https://t.co/O2Zw98ZDak This is super cute AND extremely fascinating https://t.co/4Ukf8xBbPh These bladeless wind generators are economic and bird friendly https://t.co/mq0D2nmZb0 Bikers have needed this kind of helmet forever and it's finally a thing https://t.co/vcDhb6lr2U Make your drawings light up! https://t.co/jRkVNBLtCb This 'personal aircraft' means you can take off into the skies from wherever you are https://t.co/IDIM4lPzgC NASA's got you covered with this super cool workout tool https://t.co/NdYOEdhh1Q Can't. Stop. Watching https://t.co/7pWIihBork 'IceWind' is an innovative wind turbine that can actually withstand hurricane-force winds https://t.co/2UPjB6Mfcu This lightweight plastic ribbon is as strong as steel https://t.co/jOkghX37hn This video is guaranteed to mess you up https://t.co/nl3G8K9OHr Keep your bike safe with this handy smart bike lock https://t.co/jSbqU1t0bR Cancel your gym membership — this resistance gadget will give you the gym workout right in your home https://t.co/vHeWtUR5rN This device can turn any surface into a keyboard https://t.co/nxZR8dXA5h Mobile 3D printer can build an entire house in under a day https://t.co/LoH5AS4SC8 Never buy a birthday card again thanks to this device https://t.co/cC0Sek0Y7F These wooden bricks will help you build your dream home in just 2 days https://t.co/YCwejSWuQL This snake is covered in smiles https://t.co/mdYmdaShhK Is this the future of transportation? https://t.co/Px2sYgXfdx Say goodbye to stinky gym clothes for good https://t.co/ME8r602TPq Turn any surface into an interactive display with this lamp https://t.co/Fl5mJ63m85 Every day can be leg day https://t.co/S7ii6mYIs9 The first housekeeping robot is here — and it has the best name https://t.co/PABR1kh0h0 We could watch this magical sea sparkle all day long 🌊💎 https://t.co/tXYgkgwrYE This robo-glove is giving some people a new lease on life https://t.co/nWFk4MRNMZ This keyboard is especially designed for pro gamers https://t.co/QVPncymiAf Don't pay a fortune to learn how to play instrument, just download an app! https://t.co/b9U5GPsdBj This dome home never gets too hot, it rotates itself away from the sun https://t.co/7rXydHToTC This nature-inspired wind turbine is shaped like a tree to blend in with its surroundings https://t.co/zi8j1aHgXA LEGO + camera = NEED https://t.co/XkiYkw3568 This video is guaranteed to mess you up https://t.co/lNlfpySoyW https://t.co/uiJpicWQaZ Earth's darkest substance is absolutely insane and a little creepy https://t.co/0EKBgQzXlH This might be the easiest way to clean your pet https://t.co/Li8qZI5sbD The designer is a GENIUS https://t.co/P2gUDP5KC1 Struggle no more with this nifty kitchen gadget https://t.co/h0RhDEUKXa This tiny device can alert your family if you're feeling unsafe https://t.co/21yy8eVA8e What is a vibe check anyway? https://t.co/rmGO2mAsje The bike of the future is here https://t.co/L847Zqe8Su On Saturday morning, Eliud Kipchoge did something previously thought impossible. https://t.co/1imtH8tQZv It only took a couple days for this robot arm to build an entire house https://t.co/8qe8sgbsJo You know you want this chair https://t.co/SLsktKBFol Turn your camping ground into a house party https://t.co/hBiUaE5yic How disgusting is your water bottle, really? https://t.co/NXfZ08G831 This device sticks on your back, reminding you to sit upright and have better posture https://t.co/HsjJgIfGcn A new runway could be coming to an airport near you... in 2050 https://t.co/yro32ZPMlG Simone Biles is incredibly talented, in case you hadn't heard. https://t.co/eRdzusO1zq They're not dealerships, they're energy retailers (*wink wink*). https://t.co/v6anYrCg1D This 2-year-old saw Bruce Banner turn into the Hulk and her reaction is priceless https://t.co/OdTuWh0TQ1 https://t.co/vmoLgZBdQg This is an environmentalist's dream come true https://t.co/ZheoZNrem0 This is actual backyard goals https://t.co/IEL0L5pcmo Someone invented a tricycle for adults and it's actually dope https://t.co/mkyjhLHgxg Watch Olympic divers flawlessly take on the 'Avengers' pool challenge https://t.co/oIT0DDuBwy Moms and Dads rest easy, because now your baby will, too https://t.co/6RyhmBOrOv What it's like to get high and eat nachos at America's first cannabis cafe https://t.co/Fr0ezqfVbo Members of the Trump family should think twice before challenging the 2020 Democratic candidates on Twitter. https://t.co/4Dj683IHUq These students just blew minds with their wheelchair prototype https://t.co/26WQkVCLkI Watch out, Iron Man, we've got a new 'super' suit to obsess over https://t.co/K19hqDtqIm This is possibly better than an iPad and Kindle combined https://t.co/bS6wCH2kmf Now your hands will be free to hold all your snacks https://t.co/IzWR3NS4B7 This flying car is giving us visions of the Jetsons https://t.co/yJXrbrx2iS How long have those strawberries been sitting there? https://t.co/Gx7Px3qH83 Blizzard finally spoke up on Friday after nearly a week of upheaval on the professional Hearthstone circuit. https://t.co/3clEb4r8dR Supersonic flights are the supersonic future https://t.co/lwDzZS3xK6 International Girls in Aviation Day takes place on Oct. 5, and for 2019 Delta celebrated in a special way. https://t.co/kxwOo4i6OL This Lego set lets you control a group of drones in real time https://t.co/F3tlVOj2pP Hollywood lost a legend on Friday. https://t.co/CsG0v0ePHo This could be a game changer for electric vehicles https://t.co/UQ9ijVc2XR Is there anything drones can't do? https://t.co/0ty4ZFbQx2 This electric car-subscription service wants to bring eco-friendly tech to big cities https://t.co/GTyxsOTtcp Rent is going up, so millennials are moving out https://t.co/ogmJeUsTWL We're officially living in the future https://t.co/zj6vkeS4mp Facebook allows politicians to blatantly lie in promotional material that then gets shared across the platform. https://t.co/Crq6SxQDNM This mattress changes shape for each user https://t.co/pDzplAuoiI How degradable are biodegradable shopping bags? https://t.co/3KPZjBumR5 'Jexi' is, unfortunately, a movie fit for our times\nhttps://t.co/IJ9csG8Avb Finally, someone has reinvented the crutches 👏 https://t.co/YcYnixSJyt Build your your space with adult Lego https://t.co/aVLl5Rx1Fp How disgusting is your water bottle, really? https://t.co/at4AdNAnL5 The hardest part of being a monster is the contact lenses https://t.co/sojsn4U9Tk The biophysicist who brought MRI into video age has been awarded the European Inventor Award https://t.co/NCDOGFkHCL The unique designs of European city streets are being turned into wearable art https://t.co/LJS5YSO5QF New 'Charlie's Angels' trailer is here to remind you that women are badass. https://t.co/ZtRJ18LMG4 https://t.co/FZFjNuBGpG AR and pool are simply meant to be together forever https://t.co/HwO7HdChSo 'Jexi' is, unfortunately, a movie fit for our times\nhttps://t.co/7GgaDrGK4j This video is guaranteed to mess you up https://t.co/iB5X5PrAQp https://t.co/ncLFvFxVBn We got to see how Microsoft tests their devices to death https://t.co/eiuJCD2vZA A family of 5 now lives in this 3D printed home https://t.co/e7vPRiggdI What is a vibe check anyway? https://t.co/FoSkLWbJWN Give those glutes a break https://t.co/MivQAKhfLL Watch Olympic divers flawlessly take on the 'Avengers' pool challenge https://t.co/A2iahpYHZR A house built in under 14 hours? Sounds crazy but it's true https://t.co/jnsrNQlpfF The presidential candidates sure use a lot — a whole lot — of em dashes https://t.co/6y8BMhZS5X https://t.co/pRjVq2wSZL This design for a skyscraper has us saying 'Whoa!\" https://t.co/KeW6k7Joec TV characters from 2019 that would make really great Halloween costumes https://t.co/UIuhdiFGZN Could this be the car of the future? https://t.co/c7bgVXY4ov This 2-year-old saw Bruce Banner turn into the Hulk and her reaction is priceless https://t.co/0nxvlJcscV https://t.co/lMs1lgdEoi Kinetic window blinds that act like a giant sundial https://t.co/uh0O2isYkD Your cat actually loves you, despite all those scratches https://t.co/kBFLBtaSQs All of our automobile-technology dreams have come true https://t.co/7s0YMYphHI This robot gives us the creepy-crawlies https://t.co/4YbAWPgSo8 Now those incessant piggy back rides don't have to be such a pain... literally https://t.co/PYjxuOzsCo Now those incessant piggy back rides don't have to be such a pain... literally https://t.co/lA2Xtpx9xr Try not to lose this teeny tiny iPhone https://t.co/m2mzW64Zhb Forget 3-D printing, this is way faster https://t.co/9vYTrpQgWj Talk about a paper cut... https://t.co/eREkNv5pQ1 Coffee addicts, this phone case will change your life https://t.co/Irst2FOLpv Solar panels can live in your window blinds https://t.co/vcZcq8mcts Snorkeling has been reinvented thanks to an underwater scooter https://t.co/PePFdUihmC Clean the outside of your windows from the inside https://t.co/ylQT2D8KZQ A floating caddie is a much safer way to scuba dive than a heavy tank https://t.co/eOjUg8cKIT This treadmill is easy on your knees.... because it's underwater https://t.co/fj3uHJodvO This wheelchair could be a game changer for many users https://t.co/g1BgDUiKD5 This 2-year-old saw Bruce Banner turn into the Hulk and her reaction is priceless https://t.co/fynVT0Nnvx https://t.co/mC7AO8LGM4 When you're too tired to walk through the airport, just take a seat and your luggage will drive you https://t.co/Gw206w5q15 Take selfies with the fish with this super cool underwater camera https://t.co/HVrKoN4heO Charge your phone in over 150 countries with one adaptor https://t.co/UoKGwU5ykQ This mini washing machine will let you check off laundry day and leg day all at once https://t.co/QLg3fY6X9L This mini washing machine will let you check off laundry day and leg day all at once https://t.co/Y66O8Pv1CS This could make some crazy changes in the medical fields https://t.co/CZL0TSKkUt Gently wash your clothes with no electricity https://t.co/NeqgGGpx9r Pretend you've got the baker's touch with a pancake printer https://t.co/2aBxw8R43W Kids can learn to code at a young age now with some pretty cool tech toys https://t.co/HP9h9H8fZr No Kinkos? No problem! Take this tiny cube with you to print your documents https://t.co/LGv6TEAoOl These roads charge your electric car are you drive https://t.co/Bu0XJ71jtd Ice pyramids are bringing fresh water to the desert https://t.co/NIoWoDJrR6 What is a vibe check anyway? https://t.co/Ej04E8aLtd Keep those floors clean, even while wearing your shoes 👟 https://t.co/KruqocJVth Watch as one woman unleashes her inner monster at a Halloween theme park https://t.co/m2NraCNaIx https://t.co/xaWGugUsZT These solar panels do more than produce energy https://t.co/STA4keUk8m Pollution has nothing against this clean air machine https://t.co/YN8NjvmvjP Can't get out of the house? This grocery store will come to you https://t.co/3zkNkXmpU4 There's a very scientific reason behind the sparkle of this bioluminescent algae https://t.co/mStjPntdGZ Party hard with your doggo https://t.co/VcLe2oNUvZ This engineer is ecstatic about his DIY flying chair https://t.co/9lRBZVrCgx The surfboard just got a major upgrade https://t.co/NTV1pesaHu The presidential candidates sure use a lot — a whole lot — of em dashes https://t.co/fcV5dCg5Ge https://t.co/PkLAfl73ar 3D-printed airless tire will never leave you stranded with a flat tire https://t.co/CvATUuZoB0 A new social media campaign aims to highlight the persecution of LGBTQ people https://t.co/kyto8iT6ld https://t.co/MbdgqH13WK This flying surfboard doesn't require any waves https://t.co/KZtdiZcGiE Double the arms, double the productivity? https://t.co/RFiI5XOUoU I can't handle another chicken war https://t.co/TMUK44hS9g This self-fueling zero-emission boat is on a 6-year trip around the world https://t.co/h2SESZMD9k It's Friday, so here's a dog vibin' to Post Malone and Swae Lee https://t.co/ZfmbIcpGoE Do you ever sit there and think 'I could use another thumb'? https://t.co/CZWtDqIL2Q The presidential candidates sure use a lot — a whole lot — of em dashes https://t.co/UHndWSSQ7x https://t.co/7uKJEwOa95 Not all Jokers are created equal... https://t.co/e4joStnQUb Print any temporary tattoo right onto your skin https://t.co/z2UfKJu527 How disgusting is your water bottle, really? https://t.co/JxPGOPzqfg *sigh* Google, what are you doing?!? https://t.co/FnS0F1pjZP Support for Facebook's cryptocurrency is already falling apart\nhttps://t.co/9ZeT2Vs3HI https://t.co/Iynw0McXdf This car can swim in water about as well as it drives on land https://t.co/RpoFTIC727 TV characters from 2019 that would make really great Halloween costumes https://t.co/IwXnkbehTF A company is growing animal-free leather in a lab https://t.co/N52ZVER5oI Here's a Halloween playlist for all your spooky music needs https://t.co/yFRTnyYHbG Sorry New Jersey :/ https://t.co/S61gyCloa2 You can do yoga with goats, and yes, it's amazing https://t.co/cWmaJvDYf0 What it's like to get high and eat nachos at America's first cannabis cafe https://t.co/Pz16gaMZ0H It's officially spooky season, which means the time is now for a reboot of #AreYouAfraidOfTheDark https://t.co/YQ9HDpN34W A robot inspired by vines can grow 25,000 times its original size https://t.co/ip246IGcMP This 2-year-old saw Bruce Banner turn into the Hulk and her reaction is priceless https://t.co/8pRVFAUXVl https://t.co/O77VfO0JpO These benches and sidewalks are made out of solar panel https://t.co/z3k8pWBbce Microsoft Adds Office and Emoji Keys to New Keyboards https://t.co/E0Re9dV3iu via @PCMag This video is guaranteed to mess you up https://t.co/UiLgPEcxkZ https://t.co/nUmLFZQyBl This wetsuit could protect you from shark attacks https://t.co/YHki7797D9 Scientists rushed to save lab specimens as California's PG&amp;E cuts power https://t.co/XvpqDno4nA https://t.co/ZZOLt7utIH This 'Star Wars 'Landspeeder for kids should also be made for adults, just sayin' https://t.co/PsGaMrUcaI Researchers have discovered the color psychology in Disney movies https://t.co/R8Y0qk51gO Elizabeth Warren drops the perfect response when asked about same-sex marriage https://t.co/V1YlXBnd8l Go for a run with your stroller hands-free https://t.co/8uT0WyBQiF Unsurprisingly, TV streaming devices are collecting data, too\nhttps://t.co/97WU4hGKC9 https://t.co/LUnpRUClT8 This snake-like laser robot is pretty insane to watch https://t.co/35W03iD3ly It's Friday, so here's a dog vibin' to Post Malone and Swae Lee https://t.co/u79hi0SOU4 See history in an entirely new light https://t.co/YTiVEsZOxm This is the man behind the voice of Freddie Mercury in 'Bohemian Rhapsody' https://t.co/adwNLTyycP Giuliani associates owned businesses named 'Fraud Guarantee' and 'Mafia Rave' https://t.co/BO91gAqva7 Is this octopus the world's best escape artist? https://t.co/lnsHdEl3vE Google's unique new Chromebook laptop leaked in photos and video\nhttps://t.co/ic2uFiM1BP https://t.co/v0bie14zTN This food recycler eliminates the grossest part of composting https://t.co/gf9jS1dld8 Michelle Obama is headed to Vietnam to advocate for girls' education https://t.co/HMVFzwDseo Disney's 'Jungle Cruise' trailer really leans into its roots as a theme park ride\nhttps://t.co/E1DNPbO3b0 And now we're crying https://t.co/nF16TDI2Ic How am I supposed to creep on my crush now? https://t.co/tcLShALi6u What critics thought about 'El Camino: A Breaking Bad Movie'\nhttps://t.co/kVjYq6qCJs Mashable Reporter Jess Joho (@liongirl528) found out what it takes to become a professional monster at Knott's Scary Farm https://t.co/Zn6G5hpO6P It sure seems like Trump already violated Twitch's community guidelines\nhttps://t.co/wQ3SjeWP3X https://t.co/T7njsPCVQj This could be a game changer for electric vehicles https://t.co/cJKVtdgWcn Here's a Halloween playlist for all your spooky music needs https://t.co/7WurLXGjmq This is literally a dream, no pun intended https://t.co/OLC4lC5hkg If you're gonna fly out of JFK, you might as well go all out, right? https://t.co/y5fMCecbjt Watch an extreme wave of wildfire embers pour over Los Angeles terrain https://t.co/HJO8avH3uh #MarchforSisterhood unites women and girls on International Day of the Girl https://t.co/KfmTejiQtE Disney's 'Jungle Cruise' trailer really leans into its roots as a theme park ride\nhttps://t.co/AOKgGx2UHV Watch one woman unleash her inner monster at a Halloween theme park https://t.co/VKe2aVnhD6 https://t.co/jI9l0viAHJ Why walk around the airport when you can ride your suitcase? https://t.co/qlIpJh67ap We tried Heinz's mayonnaise, salad cream, and ketchup cupcakes. Here’s the verdict. https://t.co/0Jv18nLocl https://t.co/Cf750HmZZQ What critics thought about 'El Camino: A Breaking Bad Movie'\nhttps://t.co/MzbH5Ya6WB Elizabeth Warren drops the perfect response when asked about same-sex marriage https://t.co/LCTGgr26C6 Crafted from paper, these puppets literally pop into shape https://t.co/CFoG5y9gQu A new social media campaign aims to highlight the persecution of LGBTQ people\n\nhttps://t.co/S41AY1OTn6 https://t.co/E0ywlpbhQE This adorable napping baby has no idea her mom is dressing her in incredible costumes https://t.co/9O0biNpeD5 'El Camino' is a cushy victory lap for 'Breaking Bad'\nhttps://t.co/tO5XdriDug This coffee cup is also made out of coffee... and meta just got sustainable https://t.co/MQ87C5aipX 'El Camino' is a cushy victory lap for 'Breaking Bad'\nhttps://t.co/pT4JkyCpBs Exclusive 'Walking Dead' clip teases the rise of Alpha and the Whisperers\nhttps://t.co/trFwmhDq6r This origami robot is being developed to one day perform intricate medical procedures https://t.co/cTQhGBULcv The art of globe making hasn't quite died yet https://t.co/5DcGOlK4DB Lilly Singh let her whole late night show be taken over by girls https://t.co/fNpVFnhhly https://t.co/rFpw2IcSsS This coffee cup is actually edible https://t.co/3fJsLEntXZ Fire ants can create some crazy cool things 🐜 https://t.co/O2MUj0pzNm John Oliver interviews Stephen Colbert in the most delightful 'first date' ever https://t.co/nMeSqNTPj7 https://t.co/McTf6PAeIq Scientists rushed to save lab specimens as California's PG&amp;E cuts power https://t.co/T8qejAM7FE https://t.co/Roawp3qR68 All you need is warm water and this plastic card to mold whatever shape you want https://t.co/icD8PckOGM Google is bankrolling climate deniers, report reveals. Here's the 3 most problematic ways. https://t.co/py07xXvla5 https://t.co/bu0AbQY8ce A designer has created cabinets that can change shape and it's mesmerizing to watch https://t.co/YS1qHvdScf Tim Cook on Hong Kong protest app removal: We did it to protect our users\nhttps://t.co/l7tu2PWtTg https://t.co/ZhuynK4Ppt Facebook unveils new Messenger tools for World Mental Health Day https://t.co/gkXQEkUxBJ https://t.co/SQjEEV4Jru This gadget makes sure you stay connected in remote areas https://t.co/xYkMqEuGKV Discovering the true spirit of Halloween with a monster makeover https://t.co/8T5bWdtP4m https://t.co/E5rI2AjAeF 'Hot Ones' makes Priyanka Chopra cry and Jimmy Fallon do laps eating spicy wings https://t.co/rj5gbAQAhU https://t.co/u0ATdbkDl5 A Dutch sculptor spent 27 years building giant kinetic creatures https://t.co/LHa8wPqS2c Stephen Colbert uses perfect 'Godfather' joke to mock Trump mob boss comparisons https://t.co/uzPNxGjkQp https://t.co/7zWZXoTvj8 These origami vehicles are actually tiny Transformer-like robots https://t.co/rWYs3WwskN This snake is here to help us battle water pollution https://t.co/HqpAoL5JhA Now THIS is the future of transportation https://t.co/h6eHTUBMAD Dark asphalt significantly affects how hot a city can get, so LA is cooling off with white pain https://t.co/fxPgzNvHdX Twitter returns to the Mac, but don't expect too much\nhttps://t.co/xxAZYlMF5D https://t.co/aKBaReFbnH Seth Meyers rounds up the weirdest Rudy Giuliani TV moments of impeachment season (so far) https://t.co/xYmWlYfwQn https://t.co/5JVoap7Iqi Kiss your ironing days goodbye thanks to this gadget https://t.co/L3OoVRn18e Save the planet, eat your dinnerware https://t.co/Jzxv5ceSmP This artist created a battery-powered paper city using electric ink https://t.co/yhig2nZMf1 This unassuming robot could sneak into your home https://t.co/tMLtfRcQzQ There's no such thing as too much cheese https://t.co/RSl7jplllB Ah, construction robots, efficient and calming to watch https://t.co/Bm3vNZH5kc Farm-loving robots could change the future of agriculture https://t.co/dHzrhtAJKX These wind sculptures are so mesmerizing https://t.co/C2MlToCKPA This weird desk lets you work while laying on your back https://t.co/h2u3xButGn Harry Styles drops dreamy new track 'Lights Up' with an extremely naked video https://t.co/pCtcLhNFit https://t.co/BeruQKLQEy This app is like Shazam, but for works of art https://t.co/iVeRUPRzns Ping pong has never been so fun https://t.co/FhU4qBgfhX Glide across the water with this electric bike 🚲🌊 https://t.co/fiBB9N6dfP Innovative bikes are everywhere.. this one is like a rowing machine on wheels https://t.co/58JXaGWChQ Instagram-famous hedgehogs are everything you didn't know you needed https://t.co/mgmbsRgcpB These seniors are using VR to explore the world from their assisted living facilities 🌍 https://t.co/eVHOSjlBRA Line of the night. https://t.co/smfxxRf8vs A stainless steel bridge is being printed by robots moving in mid-air https://t.co/z8A8ea4SVQ Don't underestimate the strength of spider silk https://t.co/MVzp09IkvV This levitating smart-camera could keep a 360-degree eye on your home https://t.co/xFb8mknsrh Here's how high-tech crosswalks can prevent accidents https://t.co/qDcytQUFIO This legally blind man was finally able to see his wedding day... 15 years later https://t.co/9NNqEU9HWL An architect turned pastry chef creates edible sculptures that will make your mouth water https://t.co/FJNFs4lAZv Aaron Paul's 2-minute 'Breaking Bad' recap is the only one you need before 'El Camino' drops on Netflix https://t.co/aUgUft3lUk https://t.co/Wy6jVxLhnD Spend the night in this Lego mansion 😍 https://t.co/lgTsPsaGQn This is going about as well as you might expect. https://t.co/N4WmwiyRNq Diagon Alley from 'Harry Potter' comes to life thanks to this Seattle dad https://t.co/pFHrMcaP2g AOC fights back after being accused of... paying for a reasonably priced haircut https://t.co/bSyvbWfqSq Turns out bees have quite the artistic vision https://t.co/xUN32eCrTq PG&amp;E's mandatory power cuts should be a case study in how not to manage a crisis https://t.co/zpRxGNjB8T This looks...interesting https://t.co/DRzmy1hRE4 It's not just the NBA and Blizzard. https://t.co/YTtaUEGDEZ Liza Koshy talks celebrity encounters while eating spicy wings on 'Hot Ones' https://t.co/TvADW2oDJT https://t.co/EhVeP0narX This block of sand defies physics https://t.co/2QACv7FzDW This pedestrian crosswalk looks like it's floating https://t.co/mGF4OQ9Riz 'Valfaris' is a blast of sci-fi metal action\nhttps://t.co/vyBBH9IikZ Program this flying robot to follow you everywhere https://t.co/jkfzMtJdJ3 California’s climate dystopia comes true https://t.co/MQd8kJIHYA https://t.co/Cnu7YgBLoA This is where electronics go when we're done with them https://t.co/XL02Y63o8Z Scientists rushed to save lab specimens as California's PG&amp;E cuts power\n\nhttps://t.co/g0VOnt5vPd https://t.co/7l1BnT8DrS"}