{"tweets": "I’ve always been so inspired by the military caregivers who give so much to care for our nation’s wounded warriors. I’m thankful for the work that @dolefoundation does every day to celebrate and support our caregivers. I hope you’ll find a way to do the same in your community. https://t.co/qpoIYINoNv RT @lanacondor: Happy #DayoftheGirl! I’m thrilled to share that in December I’ll be joining @MichelleObama to travel to Vietnam to meet wit… RT @Lilly: With #DayoftheGirl tomorrow, I'm excited to share Laxmi’s story. A young woman I learned about through the @GirlsAlliance, led b… RT @TODAYshow: This International Day of the Girl, former first lady @MichelleObama reveals that she and @JennaBushHager will be traveling… I hope you'll take some time today to learn about the organizations we’re spotlighting through the @GirlsAlliance—like the @RPSChildrenFund, which provides bikes to girls in Vietnam to help them get to school safely and quickly.\n\nLearn more: https://t.co/uAJh9LbSW0 https://t.co/FdyQING3wy Happy #DayoftheGirl! I’m excited to share that in December, I’ll be visiting Vietnam to meet some of the inspiring girls from the @GirlsAlliance community and the organizations that work so hard to support their dreams. \n \nI can't wait to share their stories with you. So much love for @TylerPerry, who just opened the first major film studio lot fully owned by an African American. Barack and I couldn’t be more proud of you—thanks for showing that no matter what, progress keeps marching forward. What an inspiration. 💪🏾 https://t.co/WwtyPqj0Do With #DayoftheGirl on Friday, I want you to meet Diana, whose life was transformed by a scholarship from @AGEAfrica. It’s an example of what happens when we invest in the promise inside every girl. Support their work through @GirlsAlliance: https://t.co/uAJh9LbSW0 https://t.co/NthggSn7zv RT @CrownPublishing: What’s your journey of becoming? A companion to BECOMING, this gorgeous journal features an intimate and inspiring int… I’m thrilled that @TIMESUPNOW named @TinaTchen—one of the most brilliant and purposeful leaders I’ve ever worked with—as its new president and CEO. I’ve seen how Tina’s hustle and intellect can transform policies and touch lives, and I can’t wait to see her thrive in this role! https://t.co/iWxPIaRQv0 27 years ago, this guy promised me a life full of adventure. I’d say he’s delivered. Here’s to our next chapter of becoming empty nesters and discovering what’s next—while still feeling the magic that brought us together all those years ago. Happy anniversary, Barack. https://t.co/ZKhvQGEo0B Yes, @AllysonFelix! #BlackMamaMagic 💪🏾 https://t.co/70nKRaUxsy RT @PranavNandaDC: These are three of my students who registered to vote last year at our #NationalVoterRegistrationDay drive before the Mi… RT @TraceeEllisRoss: Have you moved? Gotten married? Turned 18? Or just ready to make your voice heard? Well, today is #NationalVoterRegist… RT @tomhanks: Hey! America!  National Voter Registration Day is TODAY.  So, register you and a friend and a family member, and a few more o… Last month, 17-year-old David Ledbetter registered voters while he waited in line at a North Carolina Popeyes. \n\nOn #NationalVoterRegistrationDay, let’s follow his lead. Take @WhenWeAllVote’s pledge to get three friends registered to vote: https://t.co/EmngHKtGCt https://t.co/uueAa4OgwS RT @ReachHigher: We’re so excited to have our #YouTubeLearning playlist, \"A Student's Guide to Your First Year of College\", made in partner… Adjusting to life on campus can be overwhelming—that's why I'm thrilled to team up with @nowthisnews and @youtube on a playlist of videos that can help everybody’s transition, no matter what school you're going to. Watch now: https://t.co/qND3S564d6 @ReachHigher #YouTubeLearning https://t.co/EGFpV2lYDW RT @BarackObama: As we remember those we lost on 9/11, we also remember the spirit of unity and togetherness that defined the weeks and mon… RT @traci_crowe: On #WorldCharityDay, share your #BackToSchool photo and take action to recognize how many girls around the world do not ha… RT @kerrywashington: 8th grade ME (thx for the roller set mom😂), so happy to be #backtoschool &amp; back to Drama Club 🎭. More than 98 million… As students here in the U.S. head back to school, let's remember that more than 98 million adolescent girls around the world don’t have that opportunity.\n\nThis #WorldCharityDay, share your #BackToSchool photo and take action with the @girlsalliance: https://t.co/uAJh9LbSW0 https://t.co/p5mFJ2p1fo Sarah Hurwitz is a brilliant writer with a big heart and a kind soul—and I’m sure @HereAllAlong will reflect her thoughtfulness and eloquence, which I depended on for so many years. I’m so proud of you, Sarah, for sharing your journey and your voice with the world! https://t.co/STJVtEWj3q Whether they’re cuddling up with me on the couch or rolling around in the backyard, I love these two balls of fur. Happy #NationalDogDay to Bo and Sunny! https://t.co/Oyd3YHHFS5 On #WomensEqualityDay, I'm proud of all the women and girls who are out there empowering others in their communities to make their voices heard. Thank you all for the work you’re doing, and I hope you'll share your story with @USOWomen and @WhenWeAllVote! https://t.co/DyNel8uHtG RT @BarackObama: With summer winding down, here’s a sampling of what Michelle and I have been listening to — some new, some old, some fast,… Barack and I want to help more people see their own story in someone else’s. It’s why we started Higher Ground Productions, and it’s what we talked about with Julia Reichert and Steven Bognar, who directed @afactoryfilm. Check out their documentary, now streaming on @Netflix. https://t.co/8xjX7t9HL4 Always breaking barriers, @Simone_Biles—couldn’t be more proud of you! https://t.co/NFvktoaLAG One of the best experiences of my life has been meeting young people all over the world. They’re proof that our best days are still ahead. \n\nOn #InternationalYouthDay, check out the @GirlsAlliance to help girls lead us into the years ahead: https://t.co/uAJh9LbSW0 https://t.co/Y1GLtBDQOg So proud to join all these extraordinary women in this tribute to a legend. https://t.co/EpVZjuQpQN RT @YouTube: College can be stressful, scary, and overwhelming for students! Prepare for back to school season with #YouTubeLearning and wa… #EqualityCantWait because every woman deserves a seat at the table! Proud of my friend @MelindaGates and so many others for elevating this conversation. https://t.co/r98WlMlCO6 RT @BarackObama: Toni Morrison was a national treasure, as good a storyteller, as captivating, in person as she was on the page. Her writin… RT @BarackObama: https://t.co/nNOVtQ50O4 Thrilled to visit with @CocoGauff today—a wonderful young woman who’s showing us that we don’t have to wait to see what the next generation can do. https://t.co/zoVyp4PScA As part of #NationalGirlfriendsDay, let's give a shoutout to the friends who always have our backs! My girlfriends aren’t just people I like to hang out with—though we do plenty of that—they’re a vital part of who I am and who I’ll keep becoming. https://t.co/W3wmKuoi2m On  #NationalDanceDay, I'm shouting out the Lethal Ladies, a Baltimore STEP team who I saw perform back in 2017. I’m so proud of you all—and everyone who’s dancing today! https://t.co/U15Be9wSMs RT @ReachHigher: Five years later and we're still celebrating our #BeatingTheOdds Summit with @MichelleObama to help prepare incredible fir… I am so proud of everyone I met today at the #BeatingTheOdds Summit with @ReachHigher. \n\nTo anyone out there who feels like the world is stacked against them, know that I'm rooting for you to succeed and reach your full potential. https://t.co/vXlKnFhbZz RT @nowthisnews: We're at @MichelleObama's annual #beatingtheodds summit that brings together first-generation college students for a day o… What truly makes our country great is its diversity. I’ve seen that beauty in so many ways over the years. Whether we are born here or seek refuge here, there’s a place for us all. We must remember it’s not my America or your America. It’s our America. Next Tuesday, I'll host our 5th anniversary #BeatingTheOdds Summit with @ReachHigher. This event has introduced me to so many incredible students, including Darius Wesley, who overcame so much to become the first college graduate in his family. Can’t wait to see him again! https://t.co/2C3nn7hWhy So proud of the #ObamaLeaders gathered in Johannesburg this week! These folks are working hard and dreaming big—and I can’t wait to see what they’ll do in the years ahead. https://t.co/dZldiQfHy3 Wishing a very happy birthday to @Malala! To celebrate #MalalaDay, join me and the @GirlsAlliance in our work to empower girls around the world. Check out https://t.co/SKdrN9bzA5 to learn more and get involved. https://t.co/Dw8qfvnknU To all the teachers and school professionals out there: This fall, I need your help to show our young people that their voices matter—and that voting can make a real difference in their lives. Head over to https://t.co/xd58DAXiWh to team up with me and @WhenWeAllVote! https://t.co/SsWlCpv7al At the Women’s World Cup, we saw how sports can inspire and elevate us all. Thuba Sibanda is an @ObamaFoundation leader who uses sports to empower girls in Namibia every day. You can support leaders like Thuba through the @GirlsAlliance, and I hope you do: https://t.co/uAJh9LbSW0 https://t.co/esdiQPWbLV RT @people: Michelle Obama on Learning to Put Her Health First: ‘I Didn’t Have Time for Me’ After Having Kids https://t.co/P016lkOPYP RT @BarackObama: Proud to rep America’s best team! Congrats @USWNT and thanks for being such a strong inspiration for women and girls—and e… RT @PreventionMag: ICYMI: @MichelleObama and @GayleKing sat down together at #EssenceFest and had an honest, heartfelt conversation around… I was lucky enough to share a few moments with Cameron Boyce—on set, at the White House and on a service project—enough time to recognize that not only did he have incredible talent, but also an incredible heart. Sending love &amp; hugs to his family, friends and his many, many fans. https://t.co/CS0HdaNOwy So proud of you, Team USA—you inspire us all! #OneNationOneTeam https://t.co/YEHzyqOwZa Good luck to the @USWNT! You all are some of the most fearless, powerful, awe-inspiring athletes I’ve ever seen—and together, you’re nothing short of extraordinary. #OneNationOneTeam RT @Essence: \"We have to start having some conversations, number one, about why is it so hard for us as women to put ourselves first.\" -@Mi… RT @essencefest: “We all go through those moments where people try to define us before we have an opportunity to define ourselves.” - @Mich… RT @ChiomaChuka: \"Women have a hard time putting ourselves on our priority list, talk less of putting ourselves at the top of it. We almost… Hey, #EssenceFest! I brought a few of my girlfriends with me to New Orleans and we can't wait to join you tonight in the Superdome. Who's ready?! https://t.co/OHzh2ZD9UW Coco is terrific! 👏🏾 https://t.co/13vsVKdjFP RT @BarackObama: Congrats to the USWNT! A great performance from a great team—looking forward to Sunday. #OneNationOneTeam RT @BarackObama: Now we’re talking! Congrats to Team USA for moving on, and thanks for continuing to make us all proud. #USA https://t.co/D… We came, we dodged, we slayed.\n\nDodgeball will never be the same—thanks for hosting @latelateshow! https://t.co/g6xKgvs6xE \nhttps://t.co/XM8GpED8Xf Raising strong girls isn't just about what we do as women—it’s about the example the men in their lives set, too.\n\nThis #FathersDay, the @GirlsAlliance is celebrating dads who champion their daughters’ education and dreams. Support projects for girls at https://t.co/uAJh9LbSW0 https://t.co/TdfskufFbB Pretty grateful for this guy. Happy Father’s Day! https://t.co/VrT3nBKgIt Today and every day, I’m grateful for every imperfect photograph, for every incomplete memory, and for the many wonderful, beautiful years I had to learn and love—and be loved by—my father.\n\nHappy Father’s Day, Dad. I miss you and I’ll love you forever. https://t.co/LeRpbpZiPb RT @BarackObama: The @USWNT is something to smile about. It was great to celebrate with them back in 2015 and I'm excited to root them on i… My girlfriends are always there to lift me up and affirm who I am. On #BestFriendsDay, I want each of them to know that they are what keeps me centered through the ups and downs of life. \n\nToday, make sure your friends know what they mean to you! There’s something unexplainable that happens on @SesameStreet, some unique alchemy of aspiration and goodness that just can’t be replicated. That’s why I couldn’t be more honored to celebrate 50 years of Sesame Street tonight. \n\nJoin me by sharing a memory with #Sesame50. https://t.co/NkRwSXM6ag From an early age, my mom saw that I had a flame inside me and she never tempered it. Mom, thank you for kindling that fire within me, and for your example as a mother and a grandmother to our girls. We would never be who we are today without you. #HappyMothersDay, Mom. Love you. https://t.co/2LYOS7jzPD Today I joined students @SpelmanCollege, @CAU, and @Morehouse to talk about the importance of celebrating our stories. By embracing our whole truth, we don’t just understand ourselves better, we open ourselves to a better understanding of everyone else’s stories too. #IAmBecoming https://t.co/2vhABDbeo5 RT @BetterMakeRoom: On May 1, we celebrated #CollegeSigningDay with @UofCalifornia and over 10,000 college-bound students at @UCLA. \n\nCongr… Congratulations, Meghan and Harry! Barack and I are so thrilled for both of you and can't wait to meet him. #RoyalBaby https://t.co/mfE7uc6ooV RT @compton_college: When in Los Angeles, of course you represent Compton! Former first lady Michelle Obama sports a @Compton_College sweat… RT @talaashe: Such an honor to be a part of this amazing day with these future young leaders. 👏🏽👏🏽👏🏽 @MichelleObama, @ReachHigher &amp; @Better… RT @300CollegeClub: Our Spartans are going to college!!! Everyone got something to make their transition in to their next step a little eas… RT @StocktonScholar: #StocktonScholars rolling deep at the @BetterMakeRoom College Signing Day event at @UCLA 🤩 Thank you @MichelleObama fo… RT @RCOE: It’s here! #CollegeSigningDay @UCLA w/@MichelleObama. Kiayra @RUSDLink @JWNorthHS listening to Obama’s message as we approach and… I am so proud of each and every student out there who’s celebrating #CollegeSigningDay. I know how hard you've worked and how many hurdles each of you had to clear to make it to today. I can't wait to see what you all do in the years ahead! #BetterMakeRoom https://t.co/w2qqRP8OTj RT @johnlegend: My academic career at UPenn hugely shaped the person I am today. I'm proud to join @MichelleObama today for #CollegeSigning… RT @LeaMichele: Joining forces with the amazing @MichelleObama today to help celebrate nearly 9000 students committing to complete their ed… RT @BarackObama: Happy #CollegeSigningDay, everybody! I'm proud of every student out there who's taking the next step in their education. I… Happy #CollegeSigningDay! I am so proud of every single high school senior out there who’s committing to continue their education. \n\nTune in to join me, @ReachHigher, and @BetterMakeRoom as we celebrate all of their hard work. https://t.co/lXuSCZzuVE https://t.co/I9ufAmkVFF You guys are fired up! I can't wait to celebrate so many amazing students on #CollegeSigningDay tomorrow! https://t.co/0w5aUibtLa RT @BarackObama: Congratulations to the new class of @ObamaFoundation Fellows! Their work in every region of the globe is already making th… I'm loving all these photos from #CollegeSigningDay events happening across the country. Can't wait to celebrate in LA on May 1! #BetterMakeRoom https://t.co/Zah3A0omAn Congratulations everybody! Continuing your education is the best investment you can make in your future. #BetterMakeRoom #ReachHigher https://t.co/knnbZSzmuD It’s amazing what a few years and a lot of perseverance can do, Tina. Proud of you. #BetterMakeRoom https://t.co/aRzWXfRAxc It's great to see such focus, Melanie—congratulations on this step! #BetterMakeRoom #ReachHigher https://t.co/KjXqVFDCCr Happy birthday to my big brother, Craig, who’s always been by my side whenever I’ve needed him. No matter what he’s got going on, he’s always making sure those around him know they’re loved. So today, I want him to know he is, too. https://t.co/AzP3qnuS8F RT @BarackObama: The attacks on tourists and Easter worshippers in Sri Lanka are an attack on humanity. On a day devoted to love, redemptio… So proud of my girl! The Queen has done it again. @Beyonce, thank you for always living your truth. #Homecoming https://t.co/NlNkKIwqN6 The majesty of Notre Dame—the history, artistry, and spirituality—took our breath away, lifting us to a higher understanding of who we are and who we can be. Being here in Paris tonight, my heart aches with the people of France. Yet I know that Notre Dame will soon awe us again. https://t.co/p1mIDMbwe1 So incredibly proud of these students! Everyone at @IPROMISESchool—teachers, staff, and of course those incredible young people—is showing what can happen when we believe and invest in our kids. @KingJames https://t.co/JApeAYyiOu For as long as I can remember, my big brother Craig has always had my back. He's still one of my best friends today. Thanks for always coming out swinging for me, @CraigMalRob! #NationalSiblingsDay https://t.co/qJwM7stz07 Valerie was one of my earliest, and best, role models for how to be a confident woman and mother in the workplace. She helped me while I was #FindingMyVoice, and I'm so proud to see @ValerieJarrett helping others find and use their own voices. https://t.co/60AxLAbg7t So excited that you’ll be reading my memoir, @EkpeUdoh—can’t wait to hear what you all discuss! #IAmBecoming #EkpesBookClub https://t.co/KvtM5BxhmW Congratulations to my dear cherished friend and remarkable talent @RitaWilson! You pour so much love and passion into everything you do. https://t.co/aaoJ9azkbf RT @WhenWeAllVote: There are big elections happening next week &amp; many more to come in 2019. \n\nGet yourself, friends &amp; family registered to… Thrilled to be @bookbroads in Portland with a book club of young women juggling careers, relationships, family, and trying to find time for themselves too. \n\nAnd you don’t have to be here to take part in this conversation—let me know what you’ve been discussing! #IAmBecoming https://t.co/9MXNUMpd8o I'm so glad you guys had a good time. Keep working hard and believing in yourselves—I can't wait to see who you become in the years ahead! #IAmBecoming https://t.co/r7GbzrEm9p Recently I sat down with some of @Youtube’s #BookTubers and creators to talk all things #IAmBecoming. We covered everything from marriage advice, to what it means to swerve, to my favorite books. Watch the full discussion at https://t.co/k2FBZ5LUmO. https://t.co/t6851uqyG0 There’s never a dull moment with you, Conan. Thanks for the laughs! \n\nListen in: https://t.co/YFq3Hvevl6 #IAmBecoming https://t.co/Swg9HgaJto RT @ConanOBrien: I had the great privilege of speaking to @MichelleObama about her amazing journey and new book, “Becoming.” https://t.co/M… RT @BarackObama: Michelle and I send our condolences to the people of New Zealand. We grieve with you and the Muslim community. All of us m… Today my friend @ConanOBrien and I surprised some high school juniors from across Milwaukee who were meeting with @ReachHigher to talk about their college dreams.\n\nTo the amazing students out there, don't forget that I'm rooting for you, and I can't wait to see what you achieve! https://t.co/f0UYaCgbNt RT @BarackObama: .@MichelleObama and I are rooting hard for Team USA as the Special Olympics World Games get underway this week. Our Specia… @SusanBrott @questlove @michele_norris Yes! So glad you enjoyed it as much as I did, Susan. You can find the @QuestLove playlist here: https://t.co/2POb0wCe5X \n\nAnd some of my favorites from @Motown: https://t.co/ZaeEdlgs8s Thank you for such a warm welcome to Minnesota and for lifting up some of the amazing young women in your community, Sheletta! I hope you all have a great time tonight. #IAmBecoming https://t.co/aTw6Dl315g See you soon, Saint Paul! Don’t forget to bring a book to donate to area public schools—thanks to @XcelEnergyCtr for hosting the book drive! #IAmBecoming https://t.co/lcwlKbtqvW Still dancing at 110 years old—happy birthday, Virginia! https://t.co/IYuNYLJqT5 RT @michele_norris: This just in - I’ll be joining @MichelleObama onstage on the Twin Cities stop of her Book tour. To talk about this powe… RT @ValerieJarrett: Montreal here we come!  Thrilled to moderate another conversation with my dear friend, ⁦@MichelleObama⁩ ❤️#Iambecoming… RT @ConanOBrien: Excited to announce that I'll be sitting down with @MichelleObama during her #IAmBecoming tour stop in Milwaukee on 3/14.… RT @IamIshaSesay: I have exciting news! I have the honor and privilege of sitting down with @MichelleObama, twice, during her #IAmBecoming… RT @BetterMakeRoom: Mark your calendars! We'll be celebrating #CollegeSigningDay on May 1 with @MichelleObama + @UofCalifornia at @UCLA! 🎉… I can’t wait to celebrate #CollegeSigningDay at @UCLA for this spring! I hope you’ll help us celebrate the incredible young people in your community by signing up to host an event at: https://t.co/buv8TPtvjU. #BetterMakeRoom https://t.co/iQv0CKVb80 So proud of you guys @WorthingColts1—you inspire me! Always remember the power in your stories. I can’t wait to see what you become in the years ahead. #ReachHigher #IAmBecoming https://t.co/rnw6vuewxa RT @CraigMalRob: I’ll be in Austin tomorrow with my little sister @michelleObama. Have a question for us? Head to her Instagram account to… I’m so excited to talk all things #IAmBecoming with @YouTube’s BookTubers and book lovers everywhere.\n\nHave a question for me? Share with #BookTube and I’ll answer my favorite questions. The world needs to hear your story. That’s the message I had for the students at the Gila River Indian Community in Arizona—one of the brightest, most resilient, most inspiring groups I’ve met. I have a feeling we’ll hear more from them in the years ahead. #MondayMotivation https://t.co/ogMkV6UytG As mothers, sisters, friends, and mentors, we all have a role to play in helping our boys and young men of color fulfill their boundless potential. Get involved with the @MBK_Alliance:\nhttps://t.co/T9woP6vyWq https://t.co/bHvW3gsnEn RT @goodreads: Can't get enough of @MichelleObama's 'Becoming'? Read her personal letter for a behind-the-scenes peek of her memoir and don… So lucky to call these three my valentines for all these years. 💕 https://t.co/165TPtwft2 Girls run the world! #IAmBecoming https://t.co/ahYAucTjaq I ❤️ vets and caregivers. Hope you enjoy tonight, Jessica! #IAmBecoming https://t.co/j6mUeSKXzM A big part of friendship is showing up for your girls—that’s why I was thrilled to be there for the one and only @aliciakeys at the #GRAMMYs. She is one of the most genuine and thoughtful people I know—there’s no one better to help us all celebrate the unifying power of music! https://t.co/8cMhTmsClA Do I get a vote? #Ekpesbookclub https://t.co/AMTEaENkga Given the weather forecast, I want to make sure everyone can make it to my event in Portland safely, so I’ll be rescheduling my conversation at the Moda Center until March 19. Be careful out there this weekend, everyone—I’ll see you soon! https://t.co/qkzk77ouST With the snowstorm on its way into Tacoma, my biggest priority is making sure everyone stays safe—and that’s why we’ve decided to postpone my tour event to March 24th. I can’t wait to see you all next month, and in the meantime, stay warm and be safe out there! https://t.co/wBUU0upihd As I prepare for the final leg of my tour, I’m hoping to hear more from all of you who’ve been discussing Becoming in book clubs! Share your thoughts with me using #IAmBecoming. Also, your book club could get tickets to one of my events—learn more at https://t.co/tOEk59nT71! https://t.co/97PnvujwCb Now I want to hear from you: Tell me about how a school counselor helped you on your journey—and use #ReachHigher! Give it up for School Counselor of the Year @BrianColemanCPS from my hometown of Chicago! Hearing Brian's story is the perfect kind of #MondayMotivation for #NSCW19. To Brian and school counselors across the country, thank you for helping our students reach their full potential! https://t.co/Sa3OmZMwjy School counselors have the power to make a difference in the lives of students everywhere, and that’s why they’re some of the greatest champions for @ReachHigher.\n\nTo all of you out there, thank you so much for helping our students see that their dreams are within reach! #SCOY19 https://t.co/bHYedz4N79 RT @BarackObama: I’ve always drawn inspiration from what Dr. King called life’s most persistent and urgent question: \"What are you doing fo… Thank you all so much for the birthday love—I love you all right back! Feeling so incredibly thankful for my South Side roots, my soul-affirming partner and daughters, and every unimaginable twist and turn over these 55 years. Can’t wait to see what becomes of the next one! https://t.co/XPiPpFY4HT RT @CrownPublishing: What a year! Congratulations to @michelleobama— we’ve been thrilled to be your partner in Becoming! Looking forward to… As I reflect on the past year, I’m so thankful and overwhelmed by all the new experiences and memories. From launching new endeavors and engaging new voters to sharing my story with all of you. Thank you for joining me on this journey. There’s so much to discover in 2019! https://t.co/W0XhwPHcEp RT @BlueStarFamily: Thanks to our #BlueStarNeighbor @MichelleObama, 250 Blue Star Families members are spending the night together at her l… Let's give it up for all the independent booksellers out there for everything they do, including their support of Becoming these past few months! \n\nI hope everybody keeps supporting their neighborhood bookstore this holiday season and all year round! https://t.co/SHWHCKtznE https://t.co/PpYi7c3bHa As I told the ladies I met in Dallas, your story is the most powerful part of who you are—the struggles, failures, successes and everything in between. \n\nRemember to always stay open to new experiences and never let the doubters get in the way. You all are beautiful. #IAmBecoming https://t.co/j2jKgy1fTn Thank you, Dallas, for being on this amazing journey with me! And @ValerieJarrett, thank you for your continued support and for sharing the stage! #IAmBecoming https://t.co/26e0KZ1i8t RT @TCU_CAC: On our way to see @MichelleObama at her #IAmBecoming tour in Dallas! Thank you @AdvisingCorps and #BetterMakeRoom for making t… Here's a little #MondayMotivation from my new friends Rowan and Celiste. Thanks to everyone who came out to @TatteredCover last week in Denver! #IAmBecoming https://t.co/aLsfJ21hxP When our troops and veterans serve, their families do, too. I am constantly in awe of the strength and courage of these families—and I can’t wait to see so many of them in NYC for my final show of the year! #IAmBecoming https://t.co/e8pHsxw7Mo Starting @PublicAllies Chicago was the best job I ever had – formative and fulfilling, it was a daily reminder of the power and opportunity I had to create real change. I loved seeing that same spark in the young leaders I met in San Jose. We’ll hear from them again soon. https://t.co/Jp2HBPjh2D The music of Motown is one of the great joys of my life—I love the soul, the beat, the energy—and I’m excited to share this @Motown Records playlist with you. \n \nListen to some of my favorites from @smokeyrobinson, Ms. @DianaRoss, and many others. Enjoy! https://t.co/Ai1Q0Aei0u I'm so proud of the tremendous young men from @waynestate here in Detroit. They're working hard to build their community and leave an even stronger city to the generations coming up behind them. \n\nThanks to @KeeganMKey and my big brother @CraigMalRob for joining in. #IAmBecoming https://t.co/hgAXPPG2zY Crystal, I'm thrilled to let you know that I'll be heading to both Atlanta and Nashville! #IAmBecoming https://t.co/gCDO0P2dDo Kristi, it's happening! I'm coming to Cleveland! #IAmBecoming https://t.co/WY0iVqzIph Aimee, here I come—I’ll be in PDX on February 9! ❤️#IAmBecoming https://t.co/vJoUflCaJj Kim – I can’t promise you scientific reasoning, but I can say that I’ll be in Houston next year! #IAmBecoming https://t.co/XV3w0kpYNp I’m having so much fun with all of you on my #IAmBecoming tour that I decided to do one final round of events to see folks in some cities we missed! These conversations have been so meaningful for me, and I hope they’ve been meaningful for you all, too. https://t.co/tOEk59nT71 https://t.co/MMQTkZ4pMY RT @BarackObama: No jump shots. No ferns. No memes. Not this time. I’m going to give it to you straight: If you need health insurance for 2… RT @MAKERSwomen: “I loved it because by choosing to portray her hero as a college student, the focus was on Michelle’s accomplishments as a… I ❤️NY https://t.co/xZp5OTHnN3 In 2009, after just over two months in the White House, I was blown away by a visit to @EGA_School in London. It was a day that shaped who I became as First Lady. Today, I returned to catch up with the girls from EGA and @MulberryTH, and came away just as hopeful. #IAmBecoming https://t.co/TTRgPGTY6x RT @girlsalliance: \"I’m calling on all of you to help plant the seeds of change for adolescent girls all around the world.\"\n\nWatch @Michell… RT @GlblCtzn: .@MichelleObama talks about what Mandela means to her — and how we can continue his legacy by empowering girls and women ever… I hope readers and ticket holders will understand my decision regarding my desire to attend President Bush’s funeral, and join me in paying tribute to him and his tremendous contributions to our world. It’s important to me to join the Bush family in celebrating President George H.W. Bush’s exemplary life. This will unfortunately preclude my visits to Paris and Berlin. I’ve been deeply touched by the enthusiasm for my memoir, and I’m working to reschedule my trip for next year. To the awe-inspiring ladies of @girlsclubny: Always remember the power and the truth that lies inside your stories. I can’t wait to see what you do in the years ahead. I’m proud of you! #IAmBecoming https://t.co/AyE4thlA9E As a public servant, father, and grandfather, President George H.W. Bush was an extraordinary example for us all. His spirit of service and decency will be missed by many, including our family. I hope his memory will be a guiding light for our country and those around the world. https://t.co/jUSU82TnO1 RT @BarackObama: America has lost a patriot and humble servant in George Herbert Walker Bush. While our hearts are heavy today, they are al… I love you, Philly! Thank you all for a terrific night, especially @dopequeenpheebs for bringing the energy and the laughs. #IAmBecoming https://t.co/ve40AHMGTn The ladies of beGirl World truly inspire me. Your stories are always evolving. I can’t wait to see you tonight at the Wells Fargo Center! Have fun! \n\nWho are you becoming? Share with #IAmBecoming. https://t.co/OgvS40pygZ For #GivingTuesday, the Global @GirlsAlliance asked young women what they're thankful for this holiday season—and how they plan to pay it forward to girls around the world. \n\nI hope you'll follow their lead. Support projects for girls at https://t.co/Z5q8KOBrmF https://t.co/D5teV3x2L2 Thank you @BlackGirlsRock for hosting me at the @BGCBoston earlier today. To the young women I met today, you all blew me away with your stories, poise, and ambition. I’m so excited that you’ll be joining me tonight at @TDGarden! #IAmBecoming https://t.co/Ubo6SvxKvp RT @EPrzybylek: Kaylee is on her way to Boston to see @MichelleObama tonight! I couldn't be more excited for her to experience this opportu… RT @JossieValentin: Two buses have now left from @GirlsIncHolyoke and we are off to Boston with 100 strong, smart, and bold girls to see th… RT @people: Grandma Reunites with Stranger She Accidentally Invited for Thanksgiving 3 Years Ago https://t.co/XSng5kLlyR RT @SpotifyUSA: 🎶 @MichelleObama tapped @questlove to curate three playlists to be the soundtrack of her new book “Becoming.” Start with vo… What a great Thanksgiving story. Let’s invite each other in—not just during the holidays but in every season.\nhttps://t.co/0eQDxRf81L From listening to @StevieWonder and @EarthWindFire growing up to @Beyonce and @JanelleMonae during my time in the White House, music has always been a defining part of who I've become.  \n \nThanks to my friend @Questlove for curating these playlists! https://t.co/dcsUhIQVOt 98 million adolescent girls around the world aren't in school. Laxmi was one of them—until she enrolled in the Prerna Girls School. That’s when her life changed.\n\nI hope you'll support organizations making a difference for girls like Laxmi at https://t.co/Z5q8KOBrmF. https://t.co/klNb6DRo1W You guys amaze me! Keep working hard! https://t.co/ifTd9OK3VO What a week! From Chicago to Los Angeles to DC, I want to thank every one of you for picking up the book, diving into the pages, and sharing your stories along the way. Your photos and reflections on your own journeys have been so fun—keep them coming! #IAmBecoming https://t.co/k7Yu8WN2Wl A big shout-out to all the hardworking and inspirational community leaders from around the world in Chicago for the #ObamaSummit! I can’t wait to see the good that comes from these two days. https://t.co/292SZRJG0d Right now, members of the Global @GirlsAlliance are sharing their stories on stage at the #ObamaSummit. I hope you’ll take a minute to tune in at https://t.co/zdjmKu5Rjn to hear more about the power that comes from educating adolescent girls around the world. https://t.co/21kQIe9p50 So true, Joyce. We are never done growing or learning. I wish you the best on your journey. https://t.co/bjuSEMb2RS He is such a cutie. Thanks for all you do for students in Chicago! #IAmBecoming #ReachHigher https://t.co/JDEprjYwDI Love that all these writers and storytellers made it out last night. Keep up the amazing work! https://t.co/a2LYCF5glv Look who dropped by! ❤️#IAmBecoming https://t.co/cIQDbNIU8A Such an amazing crowd and energy in LA! Thank you to @TraceeEllisRoss for bringing the laughs and to each and every one of you for being a part of this incredible journey. #IAmBecoming https://t.co/lteS1eNH7e Beautiful, Hannah. Best wishes on your own process of becoming—the journey never ends. #IAmBecoming https://t.co/rZj5RGSRvy Great job filling out your #FAFSA, and keep striving! I know you’ll go far. Can't wait to be with you all in Dallas! #IAmBecoming https://t.co/yxmrTaK4zK I'm so glad I got to share this night with all of you! #ReachHigher #IAmBecoming https://t.co/GMLNSkfXLA RT @SuperSoulSunday: Oh yes, she went there. This is the no-holds-barred interview with @MichelleObama, in its entirety - with exclusive fo… My heart is so full after visiting the @paralosninosorg in the Skid Row neighborhood of Los Angeles. With big smiles and even bigger dreams, these beautiful kids and their families are the heart of the America that I’ve gotten to know so well, and that I’ll always believe in. 📚 https://t.co/IWIWSqAFNy Thank you, Chicago! To everyone who came out to our events — the students, the Girl Scouts, the moms and daughters and, as Oprah said, all those woke men — thank you for beginning this journey with me. #IAmBecoming https://t.co/QBRTTeOgxn I love this! We all need a little more kindness in our lives. #IAmBecoming https://t.co/vNKnNTMa8Q This makes me smile, Sammy. Thank you for sharing. #IAmBecoming https://t.co/64gEMBTwws RT @aliciakeys: The girl in this photo already thought she knew it all. On my journey #IAmBecoming more fearless. \nWhat are you becoming? B… RT @TraceeEllisRoss: #IAmBecoming more myself every day. And it feels amazing. What are you becoming?? \nThank you @MichelleObama for being… So glad you all had some fun. Keep reaching for your dreams, ladies! #IAmBecoming https://t.co/aZG4wNwK9r RT @2DopeQueens: New episode. @MichelleObama. Do we need to say more? Listen on @applepodcasts. https://t.co/ouhi9iAQtJ https://t.co/XZKtPk… My heart is with everyone affected by the devastating fires in California—the brave first responders, those who’ve lost loved ones or homes, and many others. Let’s all do our part to support these families. It’s who we are. RT @Oprah: Hey Chicago! I'm sitting down with @MichelleObama tonight to kickoff her #IAmBecoming book tour. Tweet at me a question about he… It seems like yesterday that @BarackObama and I were taking our girls to @57thstreetbooks store. Today, I was there with a book of my own. Thanks to everyone who braved the cold and stopped by. #IAmBecoming https://t.co/CiMskZf2SZ RT @questlove: As one of the lucky few to preview @MichelleObama’s #IAmBecoming I felt inspired to curate the playlist of her life. Present… We’re finally here! I hope that this book might help each of you embrace the beauty of who you are, and I wish you all the best in your own process of becoming. https://t.co/tOEk59nT71 #IAmBecoming https://t.co/1VD6nCZN41 Chicago made me who I am. I wanted to pay tribute to the South Side community that poured so much love into me from the very beginning, so I wrote this letter to the @ChiDefender. \n\nI hope you’ll read it: https://t.co/ah5VY6PUJ9 #IAmBecoming https://t.co/px3r1aI9cf Hey Chicago! I’m so excited to be in my hometown to kick off my #IAmBecoming tour! This memoir has helped me to embrace the fullness of my story—failures, triumphs, and all. I hope it inspires you to do the same. Who are you becoming? Share your story with #IAmBecoming. https://t.co/E7GXkKOATe Thank you, Oprah! I’ve been so grateful for your friendship and advice for so long. And now I’m honored to join your amazing book club! #IAmBecoming https://t.co/X4cBZTq4PS The service, strength, and resilience of our veterans and their families is one of the great inspirations in my life. As we observe #VeteransDay18, let’s all recommit to serving them as well as they’ve served us. https://t.co/J2kQ9w2hH1 My memoir comes out tomorrow, and I couldn’t be more excited. I honestly can’t wait for you to read it – so I’m not going to! Check out a little sneak preview of BECOMING: https://t.co/jhOOqJhfSF #IAmBecoming RT @BarackObama: Michelle and I are heartbroken for everybody who’s lost so much in California, and grateful for the heroism of the firefig… RT @BetterMakeRoom: Students, it's National College Application Month! And celebs are pledging to do your laundry if YOU pledge to apply to… Thank you to every single one of you who made your voice heard, volunteered, and reached out to your neighbors. You proved that we have the power to change this country—and that every single vote counts.\n\nNow it’s up to us to keep building this movement. We’ve only just begun. https://t.co/NOQY2Qtchm RT @Lin_Manuel: It’s pouring outside. \nBut my voter spot was packed. \nNever been so happy to wait in line. \n#Vote2018 https://t.co/ns4UYdt3… RT @CP3: VOTE✅ #WhenWeAllVote https://t.co/sCjnB7okAK RT @JanelleMonae: Do you know where you're voting? Text WHERE to 97779 to find your polling location. https://t.co/5lXkVrxSC0 Have you voted? There’s still time to get to the polls. Don't sit this one out and hand over important decisions that affect your life to someone else.\n\nIf you’ve already voted, check in with your friends and family to make sure they’ve voted, too!  #VoteToday #WhenWeAllVote #ElectionDay is here! It’s time to vote—get to the polls and make sure every single person you talk to today is doing the same.\n\nFind your polling place right now at https://t.co/cBTTn9yuTH. Because #WhenWeAllVote, we all do better. RT @WhenWeAllVote: TONIGHT the #TelethonForAmerica is getting people across the country to pledge to vote and to help get their friends and… Tomorrow, whether you're a first-time voter or you've been voting your whole life, your community—and our country—needs to hear from you.\n\nMake your voice heard by grabbing five friends and getting ready to vote at https://t.co/cBTTn9Q5Lf. #WhenWeAllVote https://t.co/MupCb5VxIX RT @byshondaland: - “…If you care about something but you don’t make your voice heard, this democracy will move on without you. That’s how… RT @WhenWeAllVote: The election is almost here and it’s time to use your power and VOTE. It’s going to be the people who show up that will… You nailed the look, Parker! I love it!!!! ❤️ https://t.co/40CArze8gT Meet Madalo Samati, who is working to empower adolescent girls in Malawi through education. Her leadership inspires me, and so does the ripple effect she’s created within her community.\n\nWatch Madalo’s story and head over to the Global @GirlsAlliance to learn more about her work. https://t.co/XX6h5OecEg There’s no better way to share my story with all of you than with a little help from a few of my friends. Can’t wait to kick things off in my hometown! #IAmBecoming https://t.co/AhGQ95ngY0 Can’t wait to sit down with one of the kindest and most thoughtful women I know, @michele_norris! #IAmBecoming https://t.co/7iTmYeUAGd We have some stories, don’t we @ValerieJarrett? \n\nLooking forward to talking with someone who’s had my back since before Barack and I were married! #IAmBecoming https://t.co/NHZtY5wIoI Dope Queen for a day? Sign me up—looking forward to it, Phoebe! #IAmBecoming https://t.co/fuSie4eFJm I always love talking with my dear friend, @TraceeEllisRoss. Looking forward to lots of laughs. And happy belated birthday!! #IAmBecoming https://t.co/iHDWurlf0b From our time in Chicago, to the Inauguration stage, to our friendship during the White House years, @ProfessorEA has always been there for Barack and me. \n\nSo excited for this tour! #IAmBecoming https://t.co/iQVvKQ7CXX RT @WhenWeAllVote: TONIGHT at 10/9c watch @angela_rye discuss the importance of voting during the midterm elections with @MichelleObama onl… RT @JanelleMonae: I’m on it @MichelleObama! I’m tagging my sisters @StBeautyband @LenaWaithe @YaraShahidi @aliciakeys @angela_rye ! Let’s g… RT @FaithHill: On it @MichelleObama! Getting my #VotingSquad together now. I will make sure we get five of our friends and family to the po… RT @tomhanks: On it!  Let’s go! @MichelleObama. Vote. Take your friends!  Give em donuts if that will help the turnout!  Hanx! https://t.co… RT @CP3: On it @MichelleObama! Getting my #VotingSquad together... I'm thinking @KevinHart4real @DwyaneWade @MooreMaya @michaelstrahan @ang… I’m challenging everyone across the country to start a #VotingSquad to get your friends and family ready to vote. That means you, @JanelleMonae, @TomHanks, @FaithHill, @TheTimMcGraw, @CP3 &amp; @Lin_Manuel!\n\nBuild your squad &amp; then tag 5 others to do the same! https://t.co/TyUUB9GhTi https://t.co/lO4Goedx8q Thank you for continuing to @ReachHigher, Riverside County! Excited to see you in LA! #IAmBecoming https://t.co/RZRTfj8UOs Can't wait to have all of you amazing storytellers with me in Boston. I love what you do at the Telling Room! #IAmBecoming https://t.co/LcWDmjqyGx .@826DC, I can’t wait to see the stories you write for yourselves in the years ahead. #ReachHigher #IAmBecoming https://t.co/CdXCBXXIME Keep up the amazing work! Looking forward to Detroit! #IAmBecoming https://t.co/Xr8MITXnG7 Keep aiming high! See you all soon. #IAmBecoming https://t.co/6MKULowgIc RT @girlscouts: What a great surprise to end our day! Girl Scouts from California to NY are thrilled to be attending @MichelleObama's #IAmB… You all amaze me! See you in Boston on November 24th! #IAmBecoming https://t.co/TBLbzdqMt0 I'm so excited that these incredible students from across the country will be joining me on my #IAmBecoming tour. I hope they can see a little bit of themselves in my story, and I can’t wait to see who they become in the years ahead! https://t.co/ec0DAbpu8B Early voting has already started in states across the country, which means many of you can make your voice heard right now!\n\n@WhenWeAllVote has everything you need to find out when, where, and how to vote—just go to https://t.co/cBTTn9yuTH. #VoteEarly https://t.co/2ymCxKgs3D They’re here! I just got a sneak-preview of the first copies of BECOMING, and I can’t wait for you all to read it. November 13th is almost here—pre-order your copy today at https://t.co/tOEk59nT71. #IAmBecoming https://t.co/wYw1Do1b8f RT @girlsalliance: On International #DayoftheGirl, the Global Girls Alliance launched our effort to empower adolescent girls around the wor… When girls get the chance to fulfill their potential by getting an education, they can transform families, communities, even entire countries. Follow Global @GirlsAlliance and head over to https://t.co/72b7C6ko0e to join us. https://t.co/IKu97YMivH The Global @GirlsAlliance is proud to support grassroots leaders whose work is helping girls around the world fulfill their potential.\n\nThese leaders need our help. So I hope you’ll read their stories, learn about their work, and support them however you can at @GoFundMe. https://t.co/OcxNVFh88X An educated girl can lift up her family, her community, and her country. That’s why I’m so proud that today the @ObamaFoundation is launching the Global @GirlsAlliance in support of adolescent girls' education around the world.\n\nJoin us: https://t.co/72b7C6ko0e. https://t.co/5mvFY814rD There are few things that inspire me like seeing the potential of adolescent girls around the world. Today, on International #DayoftheGirl, I’ll be on the @TodayShow to discuss the ways we can help adolescent girls get the education they deserve. I hope you’ll join me. https://t.co/XwBEoFK3nZ RT @tomhanks: Hey, America!  In some states today is the last day to register to vote!  Have you?  Have your friends?? Text WE ALL VOTE to… RT @WhenWeAllVote: 🚨 If you live in these states, make sure you register to vote by tomorrow, October 9:\n\nAZ\nAR\nFL\nGA\nIN\nKY\nMI\nMS\nNM\nOH\nPA… #WhenWeAllVote, we get a little respect. So I hope you’ll go to https://t.co/PA4LvmFR0D or text WeAllVote to 97779 to register right now. Then help your friends do the same. https://t.co/NJEKnLZGia Thank you @barackobama for 26+ years of love, trust, and respect - for being a man who always lifts up and honors me and our wonderful girls. Each day I’m with you, I’m reminded of what a treasure you truly are to us all. https://t.co/dfgJRMyWJj That was fun, Miami! Thank you for everything you’ve done to make the @WhenWeAllVote Week of Action a success. Now let’s get out there and make sure that everyone we know votes in November for something they believe in.\n\nText WeAllVote to 97779 or visit https://t.co/cBTTn9yuTH. https://t.co/AXAEIVtlFY Now’s the time to channel all your energy and emotion into getting fired up for Election Day—and I’m excited to be in Miami with @WhenWeAllVote to do just that! Join us live at https://t.co/eG4xstGNxY https://t.co/KwmyVBAZy8 .@ReachHigher was an initiative borne from my own experience—the idea that an education opens up doors that are otherwise closed for kids like me. I’m thrilled that thanks to @CommonApp's commitment to those same values, that message will thrive for years to come. #ReachHigher https://t.co/LC5EGiES2D RT @WhenWeAllVote: Join @MichelleObama in Miami 🌴 tomorrow at 4pm ET for the #WhenWeAllVote Week of Action!\n\nFind out how you can attend: h… RT @MiaHamm: Voting is the best way to make your voice heard. Register to vote right now -- it only takes a few minutes. Text WeAllVote to… RT @KELLYROWLAND: Miami! Sign up to see me, @MichelleObama, @KeeganMKey, @FaithHill and more this Friday: https://t.co/z0NTV8b6n2. Make sur… RT @WhenWeAllVote: #WhenWeAllVote, we all win. 🏆\n\n🏀 @WNBA’s @seimoneaugustus, @breannastewart, @S10Bird, and @_ajawilson22 remind us there’… RT @WhenWeAllVote: We kicked-off the #WhenWeAllVote Week of Action last weekend in #NYC with @GlblCtzn, Robert De Niro, @rachelbros, @keega… RT @WhenWeAllVote: .@CP3 speaking to young people in Houston, \"The more people that we can encourage to get out to vote, the more powerful… RT @WhenWeAllVote: \"It wasn’t until I had a family that I realized that I needed to make my voice heard at the ballot box. Not only for me,… RT @PittTweet: “Every single one of the elections in our country’s history are the most important elections of our time,” said @tomhanks at… RT @HuntingtonWVDST: Theta Omega Chapter Sorors doing their part for social action! #WhenWeAllVote #VoterTakeover2018 #DSTVOTES2018 #DSTMid… RT @LoniLove: This Thursday join @KeeganMKey and @LoniLove in Detroit to get pumped for Election Day: https://t.co/XG28HZLuoV #WhenWeAllVot… RT @StudentPIRGs: Florida PIRG students helped to register 260 students to vote yesterday for #NationalVoterRegistrationDay! @WhenWeAllVote… RT @LauraKMM: #NationalVoterRegistrationDay day at Bonanza HS in #LasVegas was a success with my trusty side kick @EriCastro07! \n\nYou can r… RT @LeoDiCaprio: It’s important to vote in every election. Today, on #NationalVoterRegistrationDay, take a few minutes to register yourself… RT @macklemore: Excited to announce the winner of the @atnfdn @WhenWeAllVote contest at #RecoveryFest2018 ... @QCC_CUNY student Jessica! Th… RT @LanaParrilla: Here with my girl @KellyMcCreary 🇺🇸👊⭐️ @WhenWeAllVote https://t.co/ZTeHsqq3Gu RT @PiperPerabo: If we want our voices heard, we have to vote in every election. #WhenWeAllVote, we all do better.\n\nText WeAllVote to 97779… RT @mfoleypdx: Mother-daughter voter registration teams! #WhenWeAllVote #gotv #StormTheMidterms https://t.co/13xzd77CmX There's a lot at stake this November. If we stay home, critical issues that affect our families and communities get ignored. Today on #NationalVoterRegistrationDay, register to vote and then get to the polls on Nov. 6. Text WeAllVote to 97779 to get started. #WhenWeAllVote https://t.co/YqQtWBEffA Thank you, Las Vegas! Now let’s get working to help our family and friends get registered to vote. Text WeAllVote to 97779 or head to https://t.co/PA4LvmXrSb to get started. https://t.co/TA852E8pfc I’m thrilled to be in Las Vegas with @WhenWeAllVote to help kick off our Week of Action. Let’s get fired up for Election Day on Nov. 6! https://t.co/NB2JtkF64f Truly humbled by the response to my upcoming book tour. I can’t wait to share BECOMING with all of you &amp; hope to see you somewhere along the way! https://t.co/uT7im9hnFk RT @WhenWeAllVote: We’re getting fired up for the Week of Action on a special call with @MichelleObama!\n\n📅 Tomorrow, Thursday, Sept. 20\n⏰ 6… When I was younger, thinking about going to college sometimes gave me a pit in my stomach. I came from a working-class family. I was young, black, and female. Of course I doubted myself. But I didn’t let those fears win. #BetterMakeRoom https://t.co/VwwJ9VelCX One of my favorite memories. Sharing this moment with my family and my mom is something I’ll never forget. https://t.co/j3LAMNsTiQ I’m done with my book! I’ve learned a lot about myself and I’d like to share my story of BECOMING—the plainness, the blemishes, the crazy turns—with you on my book tour, beginning 11/13 in Chicago. Go to https://t.co/dVXmPri4OS to find out how to get tickets. #IAmBecoming https://t.co/jmlbh19RXG RT @WhenWeAllVote: Women of color know how to get things done for their families, communities, and their country. Let's make sure we use ou… RT @WhenWeAllVote: We all can play a big role in what happens this November -- and that work starts right now, by stepping up to make sure… As you start this new school year, I want you to strive to work harder than ever before, challenge yourself to reach new heights, and seek opportunities that will help you grow. I believe in you! #BetterMakeRoom https://t.co/vMPZ3qBoP5 We can each do our part to help all eligible voters make their voices heard in this upcoming election and every election. And I'm thrilled that companies like @Lyft are working with @WhenWeAllVote to get people registered &amp; out to vote this November. https://t.co/Nej6auSy3w My father taught me that voting is a sacred responsibility, one that none of us can take for granted.  And #WhenWeAllVote, we can make our voices heard.\n\nJoin me and @WhenWeAllVote for a Week of Action this September to get fired up for Election Day: https://t.co/C4obhrE6mP https://t.co/94Rr7DOKYw Watching Aretha Franklin perform at the White House, and on so many other occasions, made time stand still. @BarackObama and I are holding Aretha’s family in our hearts right now. She will forever be our Queen of Soul. https://t.co/NhHsbKijpl RT @carlahall: Happy 53rd birthday to the Voting Rights Act - this September you can team up with @WhenWeAllVote to volunteer, register vot… RT @LanaParrilla: This September you can team up with @WhenWeAllVote to volunteer, register voters &amp; get folks fired up during the week of… RT @chefjoseandres: Do it! Just do it! #WhenWeAllVote https://t.co/hFqxcegUzg RT @AbbyWambach: This September, please join with @WhenWeAllVote to register voters! Learn more &amp; sign up here to attend an event during @M… RT @kerrywashington: Please join us and spread the word! #WhenWeAllVote https://t.co/NC2tIqvZnk RT @RWitherspoon: This September, please join @WhenWeAllVote to help register voters! Learn more &amp; sign up to attend an event during @Miche… The Voting Rights Act makes our democracy stronger, giving every American, from all walks of life, the right to vote. But the work is far from finished. Join me and @WhenWeAllVote for a Week of Action to get folks registered and ready to spread the word. https://t.co/C4obhrVHLp https://t.co/aAb1dS80Yv Happy birthday @BarackObama! The view is always better with you. https://t.co/7a6cAkjkAS .@BarackObama and I are so proud of @KingJames and @IPROMISESchool. Kids in Akron and across the US are lucky to have you as a role model on and off the court. Keep using your platform for good and giving our kids a chance to shoot for the stars. 🌟🏀 #ReachHigher #BetterMakeRoom https://t.co/hyS6UM2A7b RT @johnlegend: Vote!!!!! https://t.co/OwRtC5mttL RT @conniebritton: From now til Nov 6...what can you do to make sure EVERYONE votes?? Register and then volunteer at https://t.co/Yyt9gEuRf… RT @common: Hey, friends! I’m joining @MichelleObama, @tomhanks, @Lin_Manuel, @JanelleMonae, @CP3,\n@TheTimMcGraw &amp; @FaithHill to make sure… RT @kerrywashington: The #WhenWeAllVote checklist. Get Involved TODAY!\nRegister to vote.\nHelp others do the same with @WhenWeAllVote.\nVote… RT @TraceeEllisRoss: We can’t sit on the sidelines.\n#WhenWeAllVote we elect people who represent all of us.\nRegister to vote &amp; volunteer: h… RT @BTWFoundation: #WhenWeAllVote, we shape our communities, the laws that affect them, and the people who represent us. #BeKind + be a cha… RT @JanelleMonae: It’s gonna be our generation that corrects the mistakes of our past and creates a more inclusive future that works for us… RT @CP3: Voting gives us the power to create real change. I’m teaming up with @WhenWeAllVote to make sure Americans know about the importan… RT @tomhanks: What happens #WhenWeAllVote? We prove America is Free, of the People, by the People, for the People. Is Freedom important to… RT @Lin_Manuel: Oh hello. \nHold on I have a call...😳\nhttps://t.co/6A14VnQUeQ https://t.co/xYYhCDbwyO RT @FaithHill: Hey, friends! I’m joining @MichelleObama, @tomhanks, @Lin_Manuel, @JanelleMonae, @CP3 &amp;\n@TheTimMcGraw to make sure every Ame… In my family, voting was a sacred responsibility, one which we never took for granted. I’m excited to be a part of @WhenWeAllVote to inspire and empower all eligible voters to make their voices heard. #WhenWeAllVote, we can make history. https://t.co/cBTTn9Q5Lf https://t.co/6d5UT4gg9k Passionate, committed young leaders like these are the key to Africa’s future and to the future of our world. Barack and I are so proud of them! https://t.co/VemFlq9uD3 RT @BetterMakeRoom: \"I'm proud of all of you. You're going to do fine because I was where you were.\" —@MichelleObama talking to first-gener… Sometimes truth transcends party. https://t.co/TeFM7NmNzU To the first-gen students I met in DC yesterday, and those across the country, I want you to know that I’m so proud of you. This is only the beginning of what you will achieve! #BetterMakeRoom #FBF https://t.co/slc8RwG4or RT @BetterMakeRoom: Happening now: Join us for a conversation with @MichelleObama and our all-star #BeatingTheOdds panelists @ElaineWeltero… RT @ElaineWelteroth: This is a pic of the day I met @MichelleObama. I was 21 &amp; an asst. on the set of her @EBONYMag cover shoot. Today, at… So excited to join @lala, @DaveedDiggs, @DanPorterfield and others to meet with first-gen students at the #BeatingTheOdds Summit! #BetterMakeRoom https://t.co/s1Im5q9Q2q First-gen students are resilient, hardworking &amp; determined. As a first-gen myself, I know the challenges many students face on their journey through college.\n\nOn Thursday, I'll be taking your questions about college-submit them using #BetterMakeRoom. Can’t wait to hear from you! https://t.co/vPUrv5xL6I As I prepare to share BECOMING this fall, I hope you’ll also think about your own story, and trust that it will help you become whoever you aspire to be. Your story is what you have, what you will always have. It is something to own. #BECOMING https://t.co/agb7uJhYu8 RT @BarackObama: This Center is for the leaders of tomorrow who are ready to step up and build the world as it should be. Michelle and I ar… I’m so inspired by the young people I met today from the South Side of Chicago, my hometown and the future site of the Obama Presidential Center. These high school seniors have big plans for college and beyond and I’m so proud of each and every one of them. https://t.co/YShuJsbLpr RT @ObamaFoundation: This week, the #ObamaFellows convened for the first time as a class to exchange what they’ve learned from their work a… It’s impossible for any picture to truly capture what my mother, Marian, has meant to me. Happy #MothersDay to all of the moms out there, and especially to my own. https://t.co/GfJdJJ8oPR Thank you to the fierce and fearless @valeriejarrett, @tinatchen and @USOWomen for bringing together a crowd of thousands to reflect on the #StateofWomen, and for inspiring the next generation of leaders. #USOW2018 https://t.co/jU8hvtMpv7 Excited to join the @USOWomen Summit for a conversation with @TraceeEllisRoss! Today we come together to celebrate everything women have achieved and discuss what barriers we have yet to break. #USOW2018 #StateOfWomen https://t.co/LQWPgfMbAD RT @Lin_Manuel: Going to Wesleyan changed my life.\nI'm proud of all of you making that commitment to college.  \nShow me your pride, youths… Thank you to everyone who supported #CollegeSigningDay. I’m so proud of each and every one of these students! https://t.co/wzP1WUNmJI RT @BetterMakeRoom: Thanks everyone for supporting #CollegeSigningDay! We’re so proud to celebrate all of the young people making a commitm… RT @tvk_____: Proudly one of the 16 students UHSA  is sending to get that good HBCU education fall of 2018 🖖🏽‼️ #HU22 #CollegeSigningDay ht… So excited for you! https://t.co/s0OsriuC8G RT @kay_simone1: it’s official 🔵⚪️ #CollegeSigningDay #UK22 https://t.co/Brhj0O6FoL Congrats, Destiny! College will open so many doors for you. Keep reaching higher and never give up! #BetterMakeRoom #CollegeSigningDay https://t.co/ViMYV80oyC Happy #CollegeSigningDay! So excited to be in Philly to celebrate all the young people making the commitment to higher education. https://t.co/xWJz46dXXN On May 2, I can't wait to celebrate my 5th #CollegeSigningDay in Philly! It’s been amazing seeing this event grow into a nationwide movement where schools and communities celebrate students for committing to a higher education. #FlashbackFriday @BetterMakeRoom https://t.co/MoiRDfhY6Y I'm so happy for my friend @chefsamkass whose new book shares healthy tips &amp; delicious recipes my family has enjoyed for years. From launching the White House Kitchen Garden back in 2009 to becoming a successful entrepreneur &amp; author, @barackobama and I couldn’t be prouder! https://t.co/rq7GxzVBf9 Barack and I are thrilled to congratulate The Duke and Duchess of Cambridge on their newest arrival! We hope to meet him soon for a Kensington Palace pajama party. I’ll wear my robe! https://t.co/9zR7M049HR RT @ObamaFoundation: We just announced the inaugural class of #ObamaFellows. These 20 civic leaders have carried out inspiring work around… I'm so in awe of college-bound students all over the country—you inspire @BarackObama and me every day. We know how hard you’ve worked to make your college dreams a reality. That’s why #CollegeSigningDay is one of my favorite traditions. I can’t wait to celebrate in Philly! https://t.co/CZ0bEgIHi0 RT @BarackObama: Michelle and I are so inspired by all the young people who made today’s marches happen. Keep at it. You’re leading us forw… Hey @USOWomen! I just cleared my schedule and I’ll be there! Looking forward to joining such an inspiring roster of women. #USOW2018 → https://t.co/2CubvpF57w https://t.co/aTLtvi1P1Z RT @BarackObama: Four years ago, @MichelleObama and I had the privilege to host Lt. Cmdr. Dan Cnossen and his fellow Paralympians and Olymp… I teamed up with @Refinery29 to mark #InternationalWomensDay and to talk about my passionate commitment to empowering girls around the world through education. This will continue to be a core part of my work at the @ObamaFoundation. https://t.co/rczguiLYWP Parker, I'm so glad I had the chance to meet you today (and for the dance party)!  Keep on dreaming big for yourself...and maybe one day I'll proudly look up at a portrait of you! https://t.co/faUVTsYWun 😂😂😂 https://t.co/9Fh1qL2fyO Writing BECOMING has been a deeply personal experience. I talk about my roots and how a girl from the South Side found her voice. I hope my journey inspires readers to find the courage to become whoever they aspire to be. I can't wait to share my story. https://t.co/d7DxEG85NK RT @BarackObama: Young people have helped lead all our great movements. How inspiring to see it again in so many smart, fearless students s… I’m in total awe of the extraordinary students in Florida. Like every movement for progress in our history, gun reform will take unyielding courage and endurance. But @barackobama and I believe in you, we’re proud of you, and we’re behind you every step of the way. Congrats to the entire #blackpanther team! Because of you, young people will finally see superheroes that look like them on the big screen. I loved this movie and I know it will inspire people of all backgrounds to dig deep and find the courage to be heroes of their own stories. RT @BarackObama: We are grieving with Parkland. But we are not powerless. Caring for our kids is our first job. And until we can honestly s… Happy #ValentinesDay to my one and only, @BarackObama. To celebrate the occasion, I’m dedicating a little Valentine’s Day playlist to you!  💝 https://t.co/aHSQAL25mH To our nation’s young people, I see how hard so many of you work to #ReachHigher, and I want you to know that you inspire @BarackObama and me each and every day. We’re rooting for you! I am so proud of students all across the country who are getting accepted by their dream schools. These kids won’t let anything stand in their way! #ReachHigher https://t.co/jU0r6u4bHm There's Verlando, a first-generation college graduate who is now giving back to his community in Baltimore. https://t.co/QJLrEdl36R https://t.co/7smYOswOh9 There's Rachel, who I first met in 2014. She is proof that your past doesn't have to dictate your future. She'll be graduating in May from the University of Washington in Seattle! https://t.co/NhHTFOVeEr https://t.co/ss2KkGDDbx There’s Zaniya, who won our #BetterMakeRoom essay contest and got to be on the cover of @Seventeen with me in 2016. Now, she’s a sophomore at George Washington University and started her own campaign to empower young women. 👏🏿👏🏿👏🏿 https://t.co/g6casal3gS https://t.co/zTiOvBRnZ1 One of my greatest joys as First Lady was getting to meet so many incredible young people from across the country. I’ve always been in awe of students working hard to overcome obstacles to get a higher education &amp; build a better life for themselves. #ReachHigher https://t.co/bEd8ShB4ij This just made my day. I may not be a 3rd grade teacher, but this gets an A+ in my book! https://t.co/wBTzbyG8zr Hey everyone!  I had so much fun celebrating Ellen’s 60th birthday! It felt like old times at @TheEllenShow.  Tune in Thursday for the full episode…and check out Snapchat today for some behind-the-scenes snaps. #HappyBirthdayEllen https://t.co/ADExvBpXBp It’s because of school counselors like Kirsten Perry that our young people dream a little bigger, and reach a little higher. Kirsten, I can’t wait to honor you and your colleagues from across the country at the School Counselor of the Year Ceremony next week. #ReachHigher https://t.co/gw8pIDPaoJ RT @BarackObama: Dr. King was 26 when the Montgomery bus boycott began. He started small, rallying others who believed their efforts matter… So proud of my friend and former chief of staff @TinaTchen and the other strong women banding together to fight sexual harassment, and protect the women who are courageously coming forward. #timesup https://t.co/Qb1ty2bZ9s Getting covered means getting peace of mind for yourself and your family. So sign up today and tell everyone you know that Friday is the last day to sign up for coverage at https://t.co/v9EkLXQz0C. https://t.co/4dWS9v8geQ RT @BarackObama: Michelle and I are delighted to congratulate Prince Harry and Meghan Markle on their engagement. We wish you a lifetime of… I'm in awe of the courage, commitment, and talent of our veterans and military spouses, today and every day. Even though @BarackObama and I are no longer in the WH, we will always have your backs. #VeteransDay https://t.co/qUUJpnFKed RT @BarackObama: Michelle and I are thinking of the victims of today's attack in NYC and everyone who keeps us safe. New Yorkers are as tou… Thanks to my friend Prince Harry for joining me in my hometown to surprise these outstanding students! #ReachHigher #ObamaSummit https://t.co/QH7vwnKUBN Thrilled to be home with @BarackObama! Join us as we kick off the @ObamaFoundation Summit. Tune in: https://t.co/zdjmKu5Rjn #ObamaSummit https://t.co/mhkkelMO7V RT @BarackObama: Hello, #ObamaSummit! Thrilled to host civic leaders in Chicago from all over the world. Follow along at @ObamaFoundation. RT @BetterMakeRoom: Two years ago, Mrs.Obama launched #BetterMakeRoom at the White House to celebrate student voices &amp; shine a spotlight on… RT @ObamaFoundation: \"I’m never going to give up on you, so don’t you ever give up on yourselves.\" —@MichelleObama on #DayofTheGirl https:/… RT @BetterMakeRoom: .@MichelleObama wants YOU to complete the FAFSA &amp; sign up for Up Next. Go to👉https://t.co/nBdXOYdPkx #BetterMakeRoom ht… RT @ObamaFoundation: Time is running out to apply to be an Obama Fellow. Learn more from @BarackObama below and apply here before Friday: h… Happy 25th anniversary @barackobama. A quarter of a century later, you're still my best friend &amp; the most extraordinary man I know. I 💕 you. https://t.co/y0nevQmatB RT @BarackObama: Michelle &amp; I are praying for the victims in Las Vegas. Our thoughts are with their families &amp; everyone enduring another se… I'm so excited about what's coming up at the @ObamaFoundation. These young people have so much to contribute–and the work is only beginning. https://t.co/PlUFjLiBFR Hey Seniors! Applying to college is critical. Get the help you need by signing up for Up Next. Instructions 👇🏾#BetterMakeRoom https://t.co/4Xr6zvBVvD As we come together as one American family to help our neighbors, we are reminded how much we need each other. https://t.co/OMpsKlNAr2 The outpouring of support for Houston &amp; communities along the Gulf Coast represents the best of who we are &amp; what this country is about. https://t.co/4bGfy9vXjN Another year older, but the same phenomenal guy I married nearly 25 years ago. Happy birthday, @BarackObama -- we love you so much! https://t.co/3WrcGiKgz1 Happy Birthday Mom! Your unconditional love has made me who I am today. You are my rock. My ❤️.  I'll always be your Miche. I love you. https://t.co/37flZSKJ98 RT @BetterMakeRoom: Mrs.Obama wants to see every student succeed &amp; go off to college. Here's her advice to first-gen DC college-bound stude… .@RealMikeWilbon &amp; I are so proud of all the students who are beating the odds &amp; going to college. The world #BetterMakeRoom for all of you! https://t.co/Xg06y4NJFl RT @BetterMakeRoom: Stay focused. Stay determined. Work hard. You can accomplish anything with a higher education. #BetterMakeRoom https://… So excited to join you @RealMikeWilbon &amp; meet these inspiring DC students who are on their way to college this fall! #BetterMakeRoom 🎓🎓🎓 https://t.co/w69mZdsyqd Couldn’t be more excited for these phenomenal women I met at #CollegeSigningDay. Keep up the great work and congrats on @stepthemovie! https://t.co/Tcj9utD5LF It was an honor to stand with these incredible @SpecialOlympics athletes and celebrate Eunice Kennedy Shriver's legacy at tonight's @ESPYS. https://t.co/RXzkhAh4it Eunice Kennedy Shriver knew that when we give others a chance to fulfill their greatest potential, we all win. Happy Birthday, @Malala! Your courage inspires us all to keep fighting for girls everywhere to get the education they deserve. https://t.co/oTXwRWL1mU Happy #FathersDay @BarackObama. Our daughters may be older and taller now, but they’ll always be your little girls. We love you. https://t.co/SGZMmXaQ3a Congrats to @CNNFilms’ We Will Rise, honored at the @TelevisionAcad Honors. Thank you for spotlighting girls' ed. https://t.co/BLhpcuuBSK 📽️ https://t.co/72acSEZynp Happy #MothersDay to my mom. I strive to be the kind of mother to my girls that you have always been to me. https://t.co/ZXIjHAm7jC Glad to be back at the #PHASummit. No one should play politics with our kids’ health. We owe them. Let’s make our voices heard. https://t.co/g2ZDbwZk5u Thank you @NickCannon &amp; many others who supported #CollegeSigningDay. I am proud of every student aiming to #reachhigher. #BetterMakeRoom https://t.co/9DEhAqv4h4 RT @kerrywashington: Join me in celebrating #collegesigningday with @MichelleObama and thousands of students across the country. #Bette… ht… RT @angiemartinez: honored to join @MichelleObama @MTV tomorrow to celebrate #collegesigningday in NYC. the future is bright! #bettermakero… RT @AdvisingCorps: .@AdvisingCorps is celebrating #CollegeSigningDay today with @BetterMakeRoom! #BetterMakeRoom #ReachHigher https://t.co/… RT @nsndc: @ShuttleCDRKelly: education is the greatest gift you can give yourself. #Collegesigningday https://t.co/szFsIMJcKa RT @getschooled: Way to go future changemaker! We can't wait to see what you do at @YorkCollegeCUNY! #collegesigningday @MTV  #classof2017… ⚡️ “You'd #BetterMakeRoom, #CollegeSigningDay is HERE. ” by @BetterMakeRoom\n\nhttps://t.co/kD3S4rmPEC So inspired by the over 1,300 schools &amp; communities in all 50 states for shining a spotlight on higher education this #CollegeSigningDay. RT @chrisjsuggs: #CollegeSigningDay event with @MichelleObama, @MTV, @ReachHigher &amp; @BetterMakeRoom! Tune in at https://t.co/WMI5JCN6t1 at… I’m in NYC for my 4th #CollegeSigningDay. Can’t wait to celebrate today with 200 college-bound high school seniors! #BetterMakeRoom 👏🏾🎓👏🏾🎓 RT @ObamaFoundation: We’re building a working center for good citizenship. Right here on the South Side of Chicago. Join us. See more at ht… Excited by the potential of the Obama Pres. Center. Barack &amp; I will continue to champion the issues close to our hearts, including girls ed. https://t.co/3VVtNyKHLK Hey, @TheEllenShow! I may have schooled you in pushups, but when it comes to courage and kindness, you are always a champ.💪🏿#ThankYouEllen https://t.co/WQOPNKDc6r RT @BetterMakeRoom: ICYMI: @MichelleObama will celebrate #CollegeSigningDay with @MTV on 5/5 @PublicTheaterNY! #BetterMakeRoom 🎓🎉 https://t… Always inspired by your powerful contributions @Beyonce. You are a role model for us all. Thank you for investing in our girls.  👑🐝 👑🐝 https://t.co/kuXDdYz6JV RT @BetterMakeRoom: On May 5, wear your college gear &amp; post a selfie using #CollegeSigningDay. Register your event today at https://t.co/Vl… RT @BetterMakeRoom: ICYMI: The #IRSDRT is down until Oct. There's still time to fill out the #FAFSA. Reach out to your #schoolcounselor 4 h… RT @BetterMakeRoom: We'll celebrate #CollegeSigningDay on May 5 &amp; want to hear about yours! 🎉🎓\nSign-up: https://t.co/DAL5z8KmbD\nToolkit: ht… Look who has a spring in their step! Celebrate the #FirstDayOfSpring by grabbing a friend, heading outside, and getting moving. https://t.co/yQTb0sQgCc I was thrilled to meet the young chefs from @MasterChefJrFOX last year! Tune in tonight to see what they cooked up. #MasterChefJunior🌶️🍐🥕🍎 So impressed by the extraordinary girls I met at @CardozoEC who represent the beauty and diversity of this country. #InternationalWomensDay https://t.co/aGrmRuKsbR Thanks @chancetherapper for giving back to the Chicago community, which gave us so much. You are an example of the power of arts education. Always love visiting DC schools. Thank you for hosting me today @BallouSTAY. Stories of students #reachinghigher continue to inspire me. https://t.co/MPbctWThRF 7 years since launching #letsmove, so proud of what we've done to support healthy families. More to do! https://t.co/76JhK5ndsG https://t.co/Ua76t7bR5T Remembering those who have made possible the dreams of today. Will never forget. Will never stop honoring their legacy. #BlackHistoryMonth https://t.co/pTRS8AMAvU Happy Valentine's Day to the love of my life and favorite island mate, @BarackObama. #valentines https://t.co/n3tEmSAJRT RT @ObamaFoundation: Add your voice: https://t.co/mA9MSHmi7o https://t.co/Uf7oEvkZF3 After an extraordinary 8 years, I'll be taking a little break. Will be back before you know it to work with you on the issues we care about. https://t.co/o0ECJitXnw RT @letsmove: Watch live today at 11:10ET: @FLOTUS Michelle Obama joins her first Google+ Hangout about Let’s Move! http://t.co/aicxQ6tV ... RT @letsmove: 2 days, 3 states, thousands of kids and lots of dancing. Check out photos from #letsmovetour http://t.co/hGmyltV21w http:/ ... “We can give all our children the bright, healthy futures they so richly deserve.” http://t.co/EgStdzksym #LetsMove The First Lady on why healthier food options are good for American businesses: http://t.co/L1NIzgSjYe #LetsMove Watch Michelle Obama talk about the next chapter of our movement—then sign up to be a part of it: http://t.co/RDH2zllO RT @BarackObama: The next chapter of our work begins today. Say you're in, and ask your friends to join you: http://t.co/Uy6xaO8K Welcome to Organizing for Action: http://t.co/npTSXH7z Sign up for this Saturday's National Day of Service here, and ask your friends to join you! http://t.co/pF0uLexE, http://t.co/K5YTx84d \"A full life means giving back to our community and our country.\" —First Lady Michelle Obama http://t.co/QIiT8SJg RT @BarackObama: Happy birthday, @MichelleObama! http://t.co/brzSPUQK RT @FLOTUS: The @FLOTUS Office is now on @twitter &amp; will post updates &amp; pics. When it's her, she'll sign -mo. PS: RT to wish Mrs ... The First Lady invites you to take part in a National Day of Service this Saturday: http://t.co/1tJ3nuoa RT @BarackObama: Barack and Michelle wish you a Merry Christmas and Happy Holidays: http://t.co/9f4ajKuO, http://t.co/XkpjBLKK RT @BarackObama: The President and First Lady wish you a Merry Christmas and Happy Holidays: http://t.co/TwbI4WXH An open letter from the First Lady to parents on talking to your kids about Newtown: http://t.co/PS4pbrm0 RT @obamainaugural: Find out what First Lady @MichelleObama thought about life in the White House when she first moved in 4 years ago: h ... RT @BarackObama: From this family to yours, happy Thanksgiving. http://t.co/OPGyjTF8 We are grateful for each and every one of you. http://t.co/1igFbwD4 More than anything, I want to thank you all for everything. I am so grateful to every one of you for your support and your prayers.  –mo If the polls have closed where you are, help call key states in the West: http://t.co/AXz9z9r0 Today is a big moment for all of us. Help her have his back—go vote: http://t.co/K7bmQZxE http://t.co/gpq5MSeU All of our hard work these past 18 months comes down to what happens right now. Let’s not leave anything to chance. http://t.co/AXz9z9r0 —mo They believe in you. If you believe in them, use your vote: http://t.co/gzhu2u3l http://t.co/oAudfSc7 RT if you’ve already voted for President Obama today! #VoteObama Help get voters to the polls in key states—make a few calls now: http://t.co/AXz9z9r0, http://t.co/t0I7a048 Polls are open! Make a plan to go vote: http://t.co/6MXRyZOl The First Lady voted for @BarackObama for the same reason she married him—his character. http://t.co/6MXRyZOl, http://t.co/dQDAdvDb Today is the day we re-elect @BarackObama—it’s going to be a good one: http://t.co/4OKWq8cc Election Day is here and it’s time to go re-elect our President: http://t.co/oREBECFL, http://t.co/Dczarl0e Happy Election Day! Today we re-elect @BarackObama as our President. Be a part of it—vote. http://t.co/4OKWq8cc —mo I'll always remember the warmth of everyone back in the early days in Iowa. It just feels right to be back here to end this campaign. –mo Election Day is here—make sure your friends know President Obama’s plans for a 2nd term before they vote: http://t.co/ZWSisz4r Affordable education is a major part of the President’s plan to keep America moving forward: http://t.co/4K0Im7Z1 http://t.co/feNKmHSF We’re all in this together: http://t.co/dn78oWXL Barack is putting higher education within reach for millions more Americans by doubling funding for Pell Grants. http://t.co/drhHo5EA Barack is fighting for the American dream because he’s lived it: http://t.co/2FXbFW4S I’m so proud of everyone volunteering for #GOTV. See some of you in NC, FL, and IA today! –mo Tomorrow is Election Day. Make a plan and confirm where you vote: http://t.co/GdcI3Y7v http://t.co/TargrjBD Iowa: Today is your last day to vote early. Polling locations are open—confirm where you can cast your ballot: http://t.co/MvOlpj8t We’ll win this election because you were part of it. Sign up for a volunteer shift to help this campaign finish strong: http://t.co/jGJesjWt If this is what the President can do in 4 years, imagine what he can do in twice the time: http://t.co/ce2SASFN Something to keep in the back of your mind when you head to the polls: http://t.co/7RRo5Zkx Four more years. http://t.co/aqMrjM7S, http://t.co/6Nrr8vCN First Lady: \"All of the progress that we’ve made ... it's all at stake. The choice couldn’t be more clear.\" http://t.co/o4PfLIN9 If the President could sit down for a conversation at your kitchen table, this is what he’d say: http://t.co/hjaZYOTq Four years ago today, our country elected @BarackObama as President. In two days, let’s do it again. –mo The next generation is counting on us to shape the world they’ll live in: http://t.co/GGduP7FT, http://t.co/YpBDhU63 Pass it on: President Obama’s plan for a second term. http://t.co/kqaLVvvK Don’t let anyone tell you otherwise. MT @MiamiStudent: First Lady: \"Elections are always about hope.\" #MOatMU Make sure your friends get the facts on how President Obama is fighting for women: http://t.co/Ova21Gmp, http://t.co/5jDILfyG Call a few folks in key states—it’s a great way to do your part before Election Day: http://t.co/ZruQJp4z Every child should have a fair shot at the American Dream: http://t.co/mSHWy4W7, http://t.co/B2fzhjvw RT @OFA_OH: I-O! RT @MichelleObama: Back in the Buckeye State just 3 days before we sign Barack up for 4 more years! O-H… -mo Back in the Buckeye State just 3 days before we sign Barack up for 4 more years! O-H… -mo The President has been steady on the issues: http://t.co/5QxYhEtW GOTV weekend is here—sign up for your canvassing shift and bring a few friends with you: http://t.co/Qmkg0RBk President Obama knows that a good teacher can change a student’s life—take a look at his record on education: http://t.co/2KYfjFT3 Kids always seem to know: http://t.co/QAq9NegL Read Mrs. Robinson’s full message at @TheGrio: http://t.co/2Meashgb A note from First Grandma Marian Robinson: \"We’ve got to work our hearts out to help make this country better for our kids and grandkids.\" Take your kids to the polls—there's no better way to set an example for the next generation of Americans: http://t.co/5BsGeVFY #KidsVote Find out where President Obama stands on the issues that matter to you—and share this link so your friends know, too: http://t.co/aRB3ICu2 Don’t sit on the sidelines—a message from Maya Angelou: http://t.co/e6GmI3bz This time next week, we’ll know who the next President will be. Will you have done everything you could have? http://t.co/jKh98yT7 This election is going to be over before we know it—no do-overs, no extensions. Help us finish strong: http://t.co/ppJNdmr4 #Forward2012 I’ll be in the Sunshine State today, where folks have two days left to early vote! Have you made your voice heard? http://t.co/KsN8lkYa –mo First Lady: \"That’s what this election is about. It’s a choice about the America we want to leave for our kids and our grandkids.\" One more reason why this election matters: http://t.co/Mqn7lTrL Voting can be a family affair—check out @RedbookMag’s Take Your Child to Vote campaign: http://t.co/5BsGeVFY  #KidsVote Can you canvass this weekend? It’s our last chance to get out the vote: http://t.co/c4PbSDE3 The First Lady made a few calls for Barack  from Chicago today—can you pick up a shift? http://t.co/WRX8SEWs, http://t.co/RckMWjpx One week to go! Vote early if you can, and if you can’t, make a plan: http://t.co/DzV4GS2j –mo If you’re looking for a way to support storm relief efforts, please consider donating to the American Red Cross: http://t.co/qj2jgVWZ. –mo To everyone affected by the hurricane, Barack and my thoughts continue to be with you and your families today, and please stay safe. –mo \"Barack and I are so proud of the work our volunteers are doing, but the key is going to be to turn our people out.\" http://t.co/EHb8wyhZ Our thoughts and prayers are with everyone affected by Hurricane Sandy. In times of crisis, we pull together as one American family. –mo RT @BarackObama: If you're on the Eastern seaboard, please make sure to follow the instructions of your state and local officials today. ... Voting early means you can spend Election Day helping other people get to the polls—get the details for your state: http://t.co/eveX5qPF A message from the First Lady: Vote early—then get out there on Election Day and help other people get to the polls. http://t.co/aBXZDMf8 If you just read the First Lady’s @PopSugar post and want to learn more about Stacey Lihn, this is her family's story: http://t.co/glnzK9Hl \"No family should have to choose between caring for a sick child or going bankrupt.\" Read the First Lady's new post: http://t.co/GDArCYTe If this is what the President can do in 4 years, imagine what he can do in twice the time: http://t.co/ce2SASFN If you want the latest on how you can help build this campaign at a local level, check out Dashboard: http://t.co/YPfQ9peu Call a few folks in key states—it’s a great way to do your part before Election Day. http://t.co/Ig7B0zjj This campaign is in the palm of your hand. Give $10 to Obama for America by texting GIVE to 62262. http://t.co/YNEDn1X0. 6 msgs/mth. Thanks to Obamacare, insurance companies will no longer be able to charge women more than men for the same plan. http://t.co/SwOYnTR3 RT @BarackObama: Eric has a story that you need to hear: http://t.co/eCo8FFs8 Happy birthday to one of the most inspirational and fearless women I know: Hillary Clinton. –mo In case you missed it, catch the First Lady’s appearance on @JimmyKimmel: http://t.co/1pLCPwPl RT @OFA_NV: Nevada, show we have President Obama’s back by committing to get out the vote this weekend. Sign up here: http://t.co/XpkE77 ... Find out how the President’s health care plan benefits you and your family: http://t.co/cAw7uwE1 Good morning, Nevada! Follow @OFA_NV for updates on the First Lady’s visit today. President Obama stands up for middle-class families. Stand up for him by getting involved at your local field office: http://t.co/hMXZsPBu Go for that extra cup of coffee today—the First Lady’s on with @JimmyKimmel at 12am ET tonight! Find out where President Obama stands on the issues that matter to you—and share this link so your friends know, too: http://t.co/Jq3cObjw Hello from the campaign trail—the First Lady starts a conversation on @CafeMom: http://t.co/chsYYLL2 .@AliciaKeys is this week’s guest editor at @iVillage. The First Lady on why Alicia is such a powerful voice for women: http://t.co/ts0y8ClR The First Lady: “I’m feeling pretty fired up and ready to go myself because … I voted for my husband yesterday!!” http://t.co/Th3nmrIS Women will decide this election, and all our friends need to know what’s at stake before they vote. Watch and share: http://t.co/m1d7danK We’re only 13 days away from Election Day. It just takes one person to make a big difference: http://t.co/7iBZYmaX You can help get out the vote, right from your phone—make a few calls for Barack: http://t.co/hcblfwSs RT if you agree: Fair pay isn’t a women’s issue, it’s a family issue. http://t.co/Mez7I0eX To all the amazing volunteers out there in these last two weeks: Thank you for having Barack's back. –mo Florida: Thank you for a great day yesterday, from start to finish: http://t.co/ViS8p327 The First Lady talks about what’s at stake this fall—and how you can help @BarackObama win: http://t.co/DImnIa0w RT if you’re #ProudOfObama: The President’s steady leadership has made us stronger and safer. http://t.co/9vWy1nwJ Your vote is your voice—read the First Lady’s op-ed for @NewsOne: http://t.co/pZaDARe8 I am so proud of how Barack has represented us on the world stage for the past four years. Tonight he shined on the debate stage, too. –mo Barack's steady leadership has made us stronger and safer than we were four years ago. That was clear tonight. –mo #ProudOfObama RT @BarackObama: “He did what he said he was going to do.” Eli and Seth, twin brothers and veterans, on why they support the President:  ... Watch tonight’s debate starting at 9pm ET to show your support for @BarackObama! http://t.co/dJRqUlWV We’re getting fired up in Florida for tonight’s debate. Watch tonight, and then volunteer for #TeamBarack tomorrow. –mo Share the President’s plans to keep America moving in the right direction: http://t.co/SqVCnaz2 #Forward2012 Wisconsin and Colorado, the polls are now open. Don’t wait—support the President and vote early: http://t.co/Fpzw6Vg8 The First Lady is headed to Florida today. Follow @OFA_FL for the latest—and tune in for tonight’s presidential debate in Boca Raton. Volunteer with your local field office this weekend—and bring a buddy: http://t.co/PuRhj5RX The polls open today in Nevada. If you’re ready to keep this country moving forward, pick up a friend and cast your ballot early. –mo Barack is putting higher education within reach for millions more Americans by doubling funding for Pell Grants. http://t.co/lVEHmelQ Thanks to Obamacare, insurance companies will no longer be able to charge women more than men for the same plan. http://t.co/hEQKW2Hs Hello, Wisconsin! Send your photos to @OFA_WI if you’re attending the First Lady’s events today. President Obama stands up for middle-class families. Stand up for him by getting involved at your local field office: http://t.co/QPIDLQN5 RT @BarackObama: Forward, not back: http://t.co/GIXS4GBL, http://t.co/DGB6axFN Find out where President Obama stands on the issues that matter to you—and share this link so your friends do, too: http://t.co/7R7w1CWj The First Lady talks about what’s at stake in this election—and how you can help: http://t.co/DImnIa0w #Forward2012 Connect with the First Lady on Pinterest and help get out the vote. Check out the details from @BabbleEditors: http://t.co/WeiMAj1N RT @OFA_NV: 44 hours until #EarlyVoteNV begins in Nevada for @BarackObama the 44th President. Find your location: http://t.co/5Ii2qsgz # ... The organizing tip that you should put to good use this weekend: http://t.co/FtyWK3Hj North Carolina, starting today you can make your voice heard in this election. If you’ve got Barack’s back, vote early today. –mo The First Lady in NC yesterday: If you live in an early vote state, don't wait to cast a ballot. http://t.co/RbOHKASA, http://t.co/id7ZlatE Who inspires the First Lady on the campaign trail? Daughters Malia and Sasha. http://t.co/VKzCRBe3 via @ivillage We’re 20 days away from Election Day. It just takes one person to make a big difference: http://t.co/EKm0Nx7D –mo A photo that makes us smile: http://t.co/dPUCB5gS If you want the latest information on how you can help this campaign at a local level, you need to be on Dashboard: http://t.co/STq9CTWQ Head over to @iVillage for a special message from the First Lady: http://t.co/gOeYDD2v A word from the Grandma-in-Chief on supporting President Obama: http://t.co/1fDqiFrO via @EssenceMag RT @BarackObama: \"I've got two daughters and I want to make sure that they have the same opportunities that anybody's sons have.\" http:/ ... RT @BarackObama: If you're on #TeamBarack, pitch in $10 now to help win this thing: http://t.co/e6pnchut, http://t.co/KXmrKtpd I'm so proud of my husband tonight. Let's have his back as he has had ours. –mo #TeamBarack Tonight Barack showed, as he has every day as president, that he’ll fight to ensure everyone has a fair shot at the American Dream. –mo Tonight’s debate livestream starts at 9 PM ET. Tune in to show your support for @BarackObama! http://t.co/TrOnM5Nf I’m in because @BarackObama is strong, honest, and he’s always got your back. RT if you’re fired up to see him tonight. –mo #Debate2012 RT @Students4Obama: \"We want young people to get in the habit of being actively involved in the democratic process.\"—@MichelleObama http ... Affordable education is a major part of the President’s plan to keep America moving forward: http://t.co/4K0Im7Z1, http://t.co/kl4vBcc7 Thanks for a great day yesterday, @OFA_OH! http://t.co/6T2MAquk Good morning, Tarheels! Follow @OFA_NC for updates on the First Lady’s visit today. Yesterday, I did the most important thing I can do to support @BarackObama – I voted. Now it’s your turn: http://t.co/hrLao2aT  –mo The First Lady sits down with @ExtraTV to talk about about why she’s so proud of the President: http://t.co/Am8ZQwQI RT @aishatyler: President Obama is fighting #ForAll women. Make your voice heard: #WomenDecide2012 http://t.co/BJFJWh9I What a great Monday – this morning I voted for @BarackObama, and this afternoon I was with @OFA_OH! –mo Share the President’s plan to keep America moving in the right direction: http://t.co/RLW1hubQ #Forward2012 Virginia: Today's your last day to register to vote. Take 5 minutes to do it now: http://t.co/okQgQo6q The First Lady just cast her 2012 ballot! Find out if you can vote early too: http://t.co/KCjxpV2U, http://t.co/ArtmCgr2 Hey, @BarackObama, I just dropped my absentee ballot in the mail – I couldn’t wait for Election Day! Love you! –mo North Carolina: The First Lady is coming to visit on Tuesday. RSVP to see her in Chapel Hill: http://t.co/i4cWDVOp PopSugar follows the First Lady to Virginia on the campaign trail: http://t.co/5QL0iqQL A photo that makes us smile: http://t.co/AHBp0VCD If you’re in for four more years, sign up here: http://t.co/iTFvKaOh Obamacare has expanded access to breast cancer screenings, helping patients and survivors get the care they need. http://t.co/tQTdOT27 It could be one phone call or one conversation that makes the difference. Get involved: http://t.co/dwHGf1SX #ItTakesOne A photo that makes us smile: http://t.co/5pCcK7YC A powerful story from @JoeBiden’s trip to Florida: http://t.co/BmVtw3bz First Lady Michelle Obama: “Don’t let anyone tell you any differently—elections are always about hope.\" http://t.co/YqHishcl Alfre Woodard and @AishaTyler each share why voting is so personally important to them: http://t.co/sovKxpAo It’s up to you—whether you vote could help decide this election: http://t.co/m1rBlDld The vice presidential debate is on Thursday night—tune in and show your support for @JoeBiden! The Obamas on Bo's birthday: http://t.co/4q7zI2AF It’s a big 4th birthday for Bo! He’s getting some extra treats today. –mo RT @BarackObama: 28 days 'til Election Day, but today's the voter registration deadline in many states. Fill out your form &amp; mail it ... OH, FL, NM, PA, CO: It's the last day to register to vote. Take me up on this challenge—register one more voter by tonight. –mo A message from Michelle: Before you can vote for Barack, you need to be registered. http://t.co/JCKfYEpi #RegToVote Someone has a birthday tomorrow, and his brother Cappie is ready to celebrate: http://t.co/yvp9WVoJ Express yourself—vote: http://t.co/edExjckI, http://t.co/qH00TyOV Read up on the President’s plan to keep America moving in the right direction: http://t.co/pZqISLZH #Forward2012 Tomorrow is the voter registration deadline in CO, FL, OH, NM, and PA. Take 5 minutes to make sure you're good to go: http://t.co/BNuthylS Eight years ago, we paid off the last of our student loans. Now Barack’s working to make education more affordable for today’s students. –mo The First Lady’s full interview with @WomensHealthMag: http://t.co/iUWkvada We have just a few weeks before all the votes are counted. Your help will go farther now than a week from now: http://t.co/gLjBknD5 If you’re looking for an easy way to get your friends registered to vote, this is it. Spread the word: http://t.co/NqkrXwC2 #RegToVote Great day in Reno with @OFA_NV yesterday: http://t.co/wg6ge5t7 \"We owe it to our daughters—and our sons—to make sure we keep fighting for the world we want to leave for them.\" http://t.co/OT18YgwA A photo that makes us smile: http://t.co/jCsLpi1H Young people have so much at stake in this election—that’s why so many have gotten involved through @Students4Obama. #FF The First Lady joined @BlogHer from Denver—read her post from the trail: http://t.co/C2ccpJ6p The First Lady’s conversation with @PopSugar on the economy: http://t.co/RbOh5wIL 33 days. Let’s make the most of them: http://t.co/EAxLiyLa #ItTakesOne This is how Barack is going to keep fighting for our country: http://t.co/3K5jB4Wz Check out the First Lady's @BlogHer post from Denver for her thoughts on the debate and the choice we face this fall: http://t.co/vN5WWYwM I simply couldn’t be prouder of my husband tonight. –mo Be sure to tune into tonight’s first presidential debate at 9pm ET—and follow along for live coverage here: http://t.co/G2oTvmmO Big day in Ohio yesterday: http://t.co/YCVOGos0 \"If President Obama has had only one message, it has always been hope.\"—Evans from @OFA_NV: http://t.co/x6zdJ6Jx Thanks to everyone who voted early for @BarackObama in Ohio yesterday. Great first day—let’s keep it going! –mo Barack and Michelle on their 20 years of marriage: http://t.co/wgGtpRGz RT @BarackObama: Twenty years ago today, I married the love of my life and my best friend. Happy anniversary, Michelle. -bo Today is the Obamas’ 20th wedding anniversary. Help them celebrate by signing this card: http://t.co/X8gM0cXn The First Lady had a great visit with @IAmSteveHarvey last week—don’t miss the interview: http://t.co/GlHembr5 Happy 20th anniversary, Barack. Thank you for being an incredible partner, friend, and father every day. I love you! –mo The @FamilyCircle cookie contest was a lot of fun, so thanks to those who voted. Such a close race proves that every vote counts! –mo Get Barack’s back in tomorrow night's debate—join a watch party in your neighborhood: http://t.co/S3uRn9qY Barns for Obama: http://t.co/CHvWwsxH Cincinnati’s fired up today, and so are we. O-H-I-O! –mo RT @BarackObama: Elections do have consequences. For Ian, it was getting his dad back. http://t.co/CsMMNT2Q The First Lady is in Cincy today—follow @OFA_OH for the latest, then go early vote! Early voting starts today in Ohio, so make sure to cast your ballot—and bring a friend! http://t.co/mgceeiPm –mo If you’ve got Barack’s back, your ballot is the best place to show it. Be ready: http://t.co/qsKTzhXb Use your voice: http://t.co/0YdA7N6G RT @OFA_NV: Reno, First Lady @MichelleObama will be here on Wed 10/3. Here's your chance to be front and center at the event: http://t.c ... The first debate is on Wednesday night—show your support for the President by attending a watch party: http://t.co/ox7TlE2O 64,889 grassroots donations to go by midnight. Let's hit that goal: http://t.co/1yvxGqKN http://t.co/VTgscUrD \"We want to give all of our children a foundation for their dreams.\"—The First Lady in Wisconsin on Friday http://t.co/mpLqkQEk RT @BarackObama: We're facing a big FEC fundraising deadline tonight—and your donation will go further now than it will next week: http: ... We have just over a month before all the votes are counted. Your help makes a big difference: http://t.co/0l2YUvxq Have a couple hours free this weekend? Join a Weekend of Action event in your community: http://t.co/qwIzFgCN This campaign is coming up on a huge fundraising deadline. Pitch in what you can for the final stretch: http://t.co/49HGL8oj Barack has spent the last four years fighting for us. In Iowa and Wisconsin today, I saw thousands of people fighting for him. 39 days. –mo If you’ve got the time, we’ve got the mission—join the Vote Corps: http://t.co/bE0n1249 The First Lady's in Iowa today—the state where it all started: http://t.co/cwfONmOR It could be one phone call or one conversation that makes the difference. Get involved: http://t.co/HeqQxwxc Make it a beautiful day in the neighborhood: http://t.co/M06mWq3j The First Lady is visiting two crucial Midwest states today. Follow @OFA_IA and @OFA_WI for details. This weekend’s fundraising deadline is a big one. Pitch in $5 for the final stretch: http://t.co/a4P6kc6S One person can make a difference—and it starts with you: http://t.co/If2k5Zqw #ItTakesOne It's so nice to be back in Chicago. Looking forward to catching up with @IAmSteveHarvey this afternoon! –mo This weekend is an important weekend of action. Grab a friend and head to your local field office: http://t.co/Egd4cDlu Iowa, early voting starts today. You started it all four years ago, and Barack is counting on you again now. –mo Courtesy of a couple up-and-coming political reporters: http://t.co/QatDMfgC @TheEllenShow What did you say? You sounded a little out of breath. And next time, it’s sit-ups. –mo I hear @TheEllenShow is still sore about losing our pushup contest. What would have happened if I’d tried?  -mo You get one ballot—put it to good use: http://t.co/8u23uGIW A photo that makes us smile: http://t.co/S50T4SFT Please RT: Your vote is your voice—make sure everyone you know is registered. http://t.co/CHe3edL0 Dial this campaign up a notch, from anywhere. Make a few calls for the President: http://t.co/sJF4VDYO The Obamas' visit to The View aired today, and you don’t want to miss it: http://t.co/jqt7SNI4 If you’re looking for an easy way to get your friends registered to vote, this is it. Spread the word: http://t.co/ttzMyI3M #RegToVote This is how we work: http://t.co/iszVsaKR It’s National Voter Registration Day.  Register today and make sure your friends do, too: http://t.co/7ByNNIue –mo If you’ve got Barack’s back, your ballot is the best place to show it. Be ready: http://t.co/JGCCIYv2 We can always count on The View for a great conversation! Thanks for having us. –mo With 43 days until the election, make every single one count. Sign up for Dashboard to get started: http://t.co/h7cfcia1 Ashley Judd is speaking up for her choice in this election: http://t.co/snf3LsiD Tune into @TheViewTV tomorrow—the Obamas are making their first joint appearance: http://t.co/4vZP56xY We have 44 days to re-elect our 44th President. If you’re in for four more years, sign up to volunteer: http://t.co/detlEwhr –mo Already registered to vote? Great—now commit to making your voice heard: http://t.co/vYaTBCM0 There's a lot at stake this November and every voter we reach makes a difference. Register voters in your community: http://t.co/jITZSsp5 Volunteering is a great way to get to know your neighbors while stepping up for your country: http://t.co/TpzmQ9ML #ItTakesOne If anyone needs a canvassing partner, Bo is always up for a walk! http://t.co/FhxEpTwB Dare you not to smile: http://t.co/CnlWjBQ2 $10 goes a long way. It will also get you the car magnet of your choice: http://t.co/26Nfd37d Today’s #FF is @Students4Obama. Young people have a lot at stake in this election and they are working hard to re-elect the President. Great day in North Carolina yesterday: http://t.co/y0gee99Y Are you fired up? Are you ready to go? If not, this will help: http://t.co/egyjdlDb One person can make a difference—and it starts with you: http://t.co/OuDDEYrc #ItTakesOne DADT was repealed one year ago today. Our country is stronger, freer, and fairer because of it. Just one more way we’re moving forward.  —mo I met some exceptional college students in North Carolina today. You all are our future and we're going to keep fighting for you. –mo We can’t turn back now, we’ve come so far—but we have so much more to do. Say you’re in: http://t.co/NUcRipI5 RT @OFA_NC: .@MichelleObama: \"Let me ask you one last thing: Are you ready for this? Are you fired up? Are you ready to go?\" Our answer: YES Please RT: Your vote is your voice – make sure everyone you know is registered. http://t.co/LQ3hVJVw Happy Birthday, @JimmyFallon! I forgot to get you a birthday present, but we could always do a sack race instead. –mo The First Lady is joining grassroots supporters in North Carolina today. Follow @OFA_NC for the latest. These are the letters that keep @BarackObama moving forward every day. Hope you’ll watch Gloria’s story here: http://t.co/lkq3bDjx –mo A photo that makes us smile (widely): http://t.co/LR4CxaeT It’s been over two weeks since the First Lady spoke at #DNC2012 and we’re still fired up: http://t.co/svaBdaR2 The First Lady had the Gator chomp down in Gainesville, Florida yesterday: http://t.co/IciSNFz4 A few minutes is all it takes to make a difference—make a few calls for the President: http://t.co/r5yA42ki RT @OFA_FL: One of our favorite photos from the First Lady's visit to #Florida today: http://t.co/mQfsqeCv Three days in Charlotte: http://t.co/5X3sjHin Women for Obama are making a difference in this election. Join them: http://t.co/7zd8B4EE, http://t.co/xQSqOjbn Thank you to all of the incredible folks working hard in Florida—it was great to see so many new faces with @OFA_FL today! –mo RT @BarackObama: L'shana tova to everyone celebrating tonight. -bo RT @OFA_VA: PHOTOS: First Lady @MichelleObama in Fredericksburg, Virginia. http://t.co/bMGFTo07 #ItTakesOne Only eight weekends left until Election Day. Make this one count: http://t.co/0OCJJpQA It’s possible @TheEllenShow produced the cutest of the #DNC2012 recaps, thanks to correspondents Atticus and Rainer: http://t.co/AzpJP0yH You reach back: http://t.co/dayDtOWp Let everyone know you’re in for 2012—donate $10 now and we’ll send you your favorite magnet: http://t.co/hhjiY8Qk Midnight deadline: The President is heading to New York for an evening with Jay-Z and Beyoncé—be their guests. http://t.co/Rr9QecbE RT if this is the America you believe in, too: http://t.co/lssK6bIV It was great to be back in Virginia today. Thanks for your work to keep us moving forward, @OFA_VA! –mo First Lady to @WomensHealthMag: \"Every woman has a voice, and voting is one of the most powerful ways to express it.\" http://t.co/ZtSNGPXr A photo that makes us smile, @OFA_VA edition: http://t.co/QQtEOqH2 The First Lady dropped in for a chat – and a Dougie – with Dr. Oz. Watch here: http://t.co/JDjIjjdt RT @BarackObama: Jay-Z and Beyoncé will be meeting up with the President for an evening in NYC sometime soon—and you could join them: ht ... A letter from the Obamas: Thank you, Charlotte. http://t.co/Ipegq5RP As we reflect on those we lost 11 years ago, let’s honor their memories by serving our communities. –mo Registered to vote? Great—now commit to making your voice heard: http://t.co/XvHLPRuY Volunteers are the heart and soul of this campaign—thank you for an incredible weekend of action: http://t.co/TEM8WYaO Be the first: Make sure you’re ready for early voting—get registered. http://t.co/E5j7S3Kg, http://t.co/tNF7j1bD Front row seats: http://t.co/S7V0s5L5 It’s Grandparents Day, and we’re so lucky to have one in the White House. Love you Mom. –mo \"At the end of the day, my most important title is still 'mom-in-chief.'\"—First Lady Michelle Obama at #DNC2012 http://t.co/TSMpDvYL 60 days until all the votes are counted—make sure yours is of them: http://t.co/yOQjHR72 This campaign has a huge weekend of action this weekend—and you don't want to miss it: http://t.co/n09KP3nu If you’re ready to let the world know that you’re in for 2012, donate $10 now: http://t.co/X2CBXmVa If you’re ready to go, stand with the Obamas now: http://t.co/HyAhFZjY If you’ve got Barack's back, pitch in tonight and help build an America that continues to invest in opportunity: http://t.co/W91eDAPx Tonight is Barack's speech - can’t wait to watch him! Join us and let’s keep moving this country forward. –mo You guys had a question, @KalPenn asked it, and the First Lady answered. Pretty cool: http://t.co/iMHKiHDS Are you fired up for the President’s speech tonight? Make plans to put that energy in action—volunteer this weekend: http://t.co/fuex3oNS This week, the First Lady laid out what’s really at stake this fall. RT if you’re stepping up: http://t.co/5o84lzvr, http://t.co/rvs2UdS8 I'm thrilled to spend some time today @DemConvention with Jill Biden—a military mom, an incredible teacher, and a great friend.  –mo Say you're in. We've got so much left to do. http://t.co/Il23Mkg8 Make your voice heard by making sure you, your family, and your friends are all registered to vote. Please RT! http://t.co/X8Pbo3Mi \"Being President doesn't change who you are, it reveals who you are.\"—Michelle Obama  http://t.co/cnjkfvuH #DNC2012 The First Lady's story, as told by the people who know her best: http://t.co/fXdK7ePe #DNC2012 President Obama has revealed himself to be a man who cares about all Americans. If you’re with him, commit to vote: http://t.co/laZutrtc Tell the world that you’ve got their backs: http://t.co/6yh903J7, http://t.co/7rQy6ohj A letter from a high school student that made us smile: http://t.co/y4E1rUQU Michelle Obama: \"We must once again come together and stand together.\" http://t.co/OurtIgVF #DNC2012 A great moment from the First Lady's #DNC2012 speech: \"Barack knows the American dream because he's lived it.\" http://t.co/0Nw3Uwx1 The First Lady on what this election is about—a better future for our kids: http://t.co/6W2iFVzd Every American deserves to be treated as an equal citizen—no matter who they love. Stand with the President: http://t.co/2oPCNTv1 #LGBT Just in case you missed the First Lady's speech last night (or need to watch it a few more times): http://t.co/9eYt4gOU The First Lady joined the African American Caucus this morning at #DNC2012. We hope you'll join #AfAm2012, too: http://t.co/BUtNz9v0 If you're with the First Lady and you're ready to keep moving America forward, add your name here: http://t.co/wo7V7dEK RT @BarackObama: Michelle's biggest fans were watching from home: http://t.co/nOYmACPG Just one question at the end of an amazing night—are you in? http://t.co/lvUl7ocJ –mo RT @Obama2012: FLOTUS: “We must once again come together and stand together for the man we can trust to keep moving this great country f ... RT @Obama2012: “At the end of the day, my most important title is still ‘mom-in-chief.’ My daughters are the heart of my heart and the c ... RT @Obama2012: .@MichelleObama: “More than anything else, that is the story of this country—the story of unwavering hope grounded in uny ... RT @Obama2012: “I love that for Barack, there’s no such thing as us &amp; them—he doesn’t care whether you’re a Democrat, a Republican,  ... RT @Obama2012: “Today, I love my husband even more than I did four years ago…even more than I did 23 years ago, when we first met.”—@Mic ... RT @Obama2012: “When it comes to his character, his convictions &amp; his heart, Barack Obama is still the same man I fell in love with  ... RT @Obama2012: First Lady: “Barack knows the American Dream because he’s lived it; and he wants everyone in this country to have the sam ... RT @Obama2012: FLOTUS: “For Barack, these issues aren’t political—they’re personal. Because Barack knows what it means when a family str ... RT @Obama2012: “When we married, our combined monthly student loan bill was higher than our mortgage. We were so young, so in love, and  ... RT @Obama2012: .@MichelleObama on POTUS: “He believes that women are more than capable of making our own choices about our bodies and ou ... RT @Obama2012: First Lady on Obamacare: “He didn’t care whether it was the easy thing to do politically—he cared that it was the right t ... RT @Obama2012: Michelle Obama: “Barack refused to listen to all those folks who told him to leave health reform for another day, another ... RT @Obama2012: “When it comes to rebuilding our economy, Barack is thinking about folks like my dad and like his grandmother.”—First Lad ... RT @Obama2012: First Lady Michelle Obama: “I have seen firsthand that being president doesn’t change who you are—it reveals who you are.” RT @Obama2012: “How hard you work matters more than how much you make; helping others means more than just getting ahead yourself.”—Mich ... RT @Obama2012: Michelle Obama: “If you work hard, you should be able to build a decent life for yourself &amp; an even better life for y ... RT @Obama2012: .@MichelleObama on her father: “He and my mother were determined to give me and my brother the kind of education they cou ... RT @Obama2012: “Barack &amp; I were raised by families who didn’t have much in the way of money but gave us something far more valuable: ... RT @Obama2012: “Everywhere I’ve gone, in the people I’ve met, and the stories I’ve heard, I have seen the very best of the American spir ... RT @Obama2012: .@MichelleObama: “Over the past few years as First Lady, I have had the extraordinary privilege of traveling all across t ... RT @BarackObama: Watch live: First Lady @MichelleObama speaks at #DNC2012 about the values that guide the President: http://t.co/d1VbmBCX I'm honored to be introduced tonight by such an inspiring woman.  Thank you, Elaine—for your service and for your family’s. –mo RT @BarackObama: Get to know the woman the President calls “the best mom in the world”—First Lady @MichelleObama: http://t.co/9NIxKVgR Keep an eye on @Obama2012 for the full live-tweet of the First Lady’s #DNC2012 speech. A look back at what Michelle had to say about Barack four years ago: http://t.co/CztWMdJI Young people are at the heart of this campaign—join Young Americans for Obama today: http://t.co/nCPaMOWM RT @LatinosforObama: VIDEO: Estamos Unidos http://t.co/B4yNw6Qg #Latinos2012 The First Lady takes the stage at #DNC2012 tonight at 10:30pm ET. See the full Tuesday line-up here: http://t.co/22SbXjjy RT @Obama2012: \"This is about our mothers and our sisters and our daughters. That's what this is about.\"—Sen. @AmyKlobuchar at the Women ... I have so many incredible memories from the 2008 @DemConvention, and I'm excited to be here in Charlotte. Let's get fired up! –mo Hugs are a necessary part of convention prep with @KalPenn: http://t.co/byMjyjXl RT @helloross: Yes, this just happened. My Mom's gonna freak. cc: @enews @michelleobama http://t.co/100Ukmam It’s an exciting week for #Obama2012—the Democratic Convention kicks off in Charlotte, NC tomorrow! Follow @DemConvention for the latest. Craig Robinson, the First Lady’s brother, reflects on how far we’ve come since the Democratic Convention in 2004: http://t.co/tGX27wlK It’s the beginning of a new school year, and @iVillage has a few tips straight from the First Mom: http://t.co/gGVfugSY Tomorrow starts a new school year for a lot of families, ours included. Have a great first day everybody! –mo If you could ask the First Lady one question, what would it be? She’ll be answering a couple during the @DemConvention this week! Tonight's fundraising deadline is one of the most important we'll face together. If you’ve got Barack’s back, pitch in: http://t.co/swuJyyeO This week’s #FF goes to @LatinosForObama—your excitement is incredibly powerful. Keep up the great work! David and Rose had dinner with Barack and Michelle—a double date to remember: http://t.co/mhOzEIzl Today is deadline day—one of the last of this campaign. Pitch in $5 to help make sure we keep moving forward: http://t.co/5KZd9paI \"The day after the election, I’ll definitely be able to say I did all I could to make this happen!” –Mary, @OFA_SD: http://t.co/UxfsyHgq Are you the kind of person who can talk to anyone? Pick up the phone and make a difference in this election: http://t.co/kbcgogsB RT @OFA_NV: Natalie Portman shares why she joined #Women2012 http://t.co/XTlGJ5fT Summer may be coming to a close, but this campaign is heating up. RT if you’re in for four more years. #Obama2012 If you’re a part of this campaign, you have a story or two to tell. This is the place to share it: http://t.co/oVXOZE6L The First Lady visits David Letterman on the @Late_Show tomorrow night—don’t forget to tune in! Hear the First Lady tell the story of her family’s move to the White House: http://t.co/ZaHlFosU Join @LatinosforObama to help President Obama work toward a future where all kids have equal opportunities: http://t.co/tN1yMNqO Powerful motivation: our children’s futures. Add your name as a Parent for Obama today. http://t.co/0aUq8Gn6 Ivan’s lesson to his daughter: “If you want change, you have to be a part of it.” http://t.co/owhrFKqq #ItTakesOne Getting fired up was a family affair in Milwaukee last week: http://t.co/WVtYW1Sk Today is Women’s Equality Day. I believe equal work deserves equal pay—are you with me? –mo Rain or shine, it’s a great day to volunteer. Find an event in your neighborhood: http://t.co/tUdEXRV6 For all the romantics out there: http://t.co/bbZiWvmu Say you’re standing with #Obama2012 everywhere you go: http://t.co/kEkodcAy When the First Lady comes to town, even the smallest supporters get a big boost: http://t.co/BJ935pR3 High five Friday: http://t.co/t8aUHyMM Take an important step toward Election Day: Register to vote. http://t.co/RxWtpGzt The First Lady in Milwaukee today: “All of our kids are worthy. I want to give all of our kids that sense of limitless possibility.” RT @OFA_WI: .@MichelleObama greets a full room of supporters - \"I want to thank all of you for the work you do day in and day out...\" The First Lady is in the great state of Wisconsin today. Follow @OFA_WI for updates. RT @OFA_FL: Should be a great day with @MichelleObama in Ft. Lauderdale. We're excited! http://t.co/kk2BZord What’s your 2012 story? Add it here: http://t.co/RqDqZ14f Last chance: Enter now for a seat with Michelle at this year’s convention. http://t.co/NHc5jRR8 Why Betsie gives: “Barack Obama knocks my socks off.” http://t.co/f0APcBZo Go VIP at the DNC—here’s your chance to meet Barack and Michelle in Charlotte next month: http://t.co/jDO9pDNt For our daughters and granddaughters: http://t.co/ERoBlRt4 This is the time to join Women for Obama and the fight for fair pay: http://t.co/PqqiyPQg 77 days until Election Day—and women still earn 77 cents for every dollar that men earn. Barack is fighting to change that. –mo 78 days to go—pick up the phone and make a difference in this election: http://t.co/jsr9xQt6, http://t.co/SdK66vgE RT if this sounds like what you want for your kids. http://t.co/IlCG82Zm You’ll sit with Michelle to watch President Obama accept the Democratic nomination—after you’ve met him in person. http://t.co/XDQmetZK RT @letsmove: President Obama to young chefs at #KidsStateDinner: \"I could not be prouder of you, the young people\" http://t.co/OwuFHZc4 One volunteer shift could do a lot of good. http://t.co/ECRBJd5R, http://t.co/wkvFZh3j It’s been 92 years since women won the right to vote. We’ve come so far. Let’s keep moving forward. –mo Say you’re standing with #Obama2012 everywhere you go: http://t.co/hERNB7E2 It’s Friday. Give Barack five: http://t.co/QXNoicdF Celebrating World Humanitarian Day means giving back.  Listen to a special message on how to help from @Beyonce: http://t.co/qWwEk7n8 – mo One person could make all the difference in this election—and it could be the person you bring in: http://t.co/xDP08Fcp In case you missed it, the First Lady visited @JayLenoTonight with another special guest: http://t.co/uo7esY6k RT @BarackObama: You and a guest could score front-row seats—next to Michelle Obama—at the President’s DNC convention speech next month: ... It felt great to be back in Iowa with @BarackObama. @OFA_IA we are counting on you again in 2012! Thanks for your hard work. –mo .@JayLeno asked the First Lady what she's proudest of from @BarackObama's time in office. Here’s her answer: http://t.co/axfoaiqx RT @Obama2012: “We can’t turn back now. We have come so far, but we have so much more to do.”—First Lady Michelle Obama RT @Obama2012: .@MichelleObama: “At the end of the day, as president, all you have to guide you are your values and your vision and your ... RT @Obama2012: “Your President knows what it means when a family struggles. He knows what it means to want something better for your kid ... RT @Obama2012: “Thank you for the kindness, generosity, and love you have shown our family consistently.”—First Lady Michelle Obama in Iowa The First Lady is joining @BarackObama in Iowa today to visit the amazing volunteers of @OFA_IA! Check back for updates. Highlight from @JayLenoTonight: The “kiss cam” story. http://t.co/OJPGk5De This campaign is growing one supporter at a time—start your own grassroots fundraising page: http://t.co/ZRa34Phh The First Lady visited @JayLenoTonight yesterday with Olympian @GabrielleDoug. You’re not going to want to miss this: http://t.co/uo7esY6k From Diana in Texas: \"Thank you from the bottom of my heart for giving my dad a chance to fight for his life.\" http://t.co/gN5Xn53a Stand with @BarackObama and @PPact, and hear @ElizabethBanks inspiring message: http://t.co/lmPkuC5f That one conversation you have could be the one that puts @BarackObama over the top: http://t.co/71WHsVle, http://t.co/sUwZslAz 85 days to go—and you can make the difference. Sign up for a volunteer shift here: http://t.co/828mzKXD RT @whitehouse: I can't wait to stop by @JayLenoTonight on 8/13 to talk about the #Olympics, @LetsMove &amp; how this happened: http://t ... Quote of the day: “It’s a once-in-a-lifetime opportunity to play our trumpets for the First Lady!” http://t.co/z4xZB231 The First Lady in New Hampshire: “The grassroots work that you all are doing ... that work is at the core of this campaign.” A lot of ways to say you're a Woman for Obama: http://t.co/MTHxdjZd Commit to making 10 calls for #Obama2012 tonight using the handy online call tool: http://t.co/7qMSwdRN 88 days left—here’s how you could be spending them: http://t.co/Zgwsjzxh #ItTakesOne The First Lady was fired up in Philadelphia yesterday: http://t.co/UX6Pjovt This campaign is growing in Pennsylvania because volunteers are making it happen. Keep it up, @OFA_PA! —mo RT @SandraFluke: Check out my op ed on @HuffingtonPost on why I stood w/ @BarackObama yesterday in #Colorado &amp; will thru Nov http:// ... Let your #Obama2012 story inspire someone else’s—share yours here: http://t.co/JsiyVWXH The next 90 days are critical for this campaign—help make the most of them: http://t.co/40ZOsqZ6 Lilly Ledbetter: Proof that it only takes one person to make a difference. http://t.co/kDVAnGWL #ItTakesOne Don’t wait—get registered to vote today: http://t.co/wpI5R73o A good sign: http://t.co/CiMdnHSU \"Reaching out to one person feels doable. There's no reason I can't do that, then do it again tomorrow.”—Stephanie http://t.co/JE0bTtA7 Looking to get more involved with #Obama2012? There’s an app for that: http://t.co/PHJpuSeP A must-read story from @WomensHealthMag—take a look and pass it along: http://t.co/NYCHwoU1 Something to share with all of the women in your life: http://t.co/p29ZNMZs The President needs you to have his back from now until Election Day. Sign up to volunteer: http://t.co/jlhxlZuD Use this tax calculator to see the choice your family faces on taxes this November: http://t.co/cC29H7uF #2200dollars \"I want you all to remind folks that Barack has cut taxes for working families by $3,600.\" –The First Lady in NH last week. Remind=RT. Inspiration from @OFA_OK's Stephanie: \"Even if you don't think you have anything to contribute, chances are—you do.\" http://t.co/dddBfS8r RT @BarackObama: \"It was easy to invite people to volunteer—especially for a canvassing trip. It was kind of a big adventure.\" http://t. ... A Sunday afternoon idea: Vote in @FamilyCircle’s Presidential Cookie Bake-off, then test out a batch of your own! http://t.co/EWTDHLor Happy birthday, @BarackObama! Here’s an old favorite photo from three of your biggest fans. We’re so proud of you!–mo http://t.co/7alDwpDQ The First Lady took a tour of @OFA_NC's downtown Raleigh field office on Wednesday: http://t.co/U7NjmYlj White, dark, and mint chocolate chip cookies—one of the First Family’s favorite treats is up for a vote: http://t.co/Sx7Ux7Vu RT @OFA_NH: The First Lady tells the #Manchester crowd: \"Multiply yourselves, bring one person into the fold.\" http://t.co/vtkJF3bS #Mic ... President Obama turns 51 on Saturday—take a second to sign his birthday card: http://t.co/MnFlLGzR Your personal story of getting involved could get someone else fired up. Tell your story here: http://t.co/rMATcACg This campaign gets stronger one person at a time—share the story of how you got involved: http://t.co/uSyUurca The First Lady is in North Carolina today asking supporters to get involved through It Takes One: http://t.co/Rs3lGBLp RT @BarackObama: Today is one of the most important fundraising deadlines of this campaign so far. Pitch in $3 before midnight: http://t ... Join Michelle: Sign the birthday card for @BarackObama. http://t.co/YmaVgY4C RT @BarackObama: Deadline deal: Give $10 or more before midnight, get a Vote Obama car magnet. Simple as that: http://t.co/nAXQ0cvE A photo that makes us smile: http://t.co/Es1SP1LT The First Lady has a card going around for @BarackObama’s birthday—sign it here: http://t.co/5bDn3h5N Pitch in $5 before the campaign’s big fundraising deadline tonight: http://t.co/KFdkekIW RT @LatinosforObama: ¡Felicidades Mayor @JulianCastro! Join Latinos for Obama today. http://t.co/H8jrxZvK #Latinos2012 http://t.co/8sdwK4Cl The election is less than 100 days away—make all of them count: http://t.co/B9hXcMIx Join Young Americans for Obama today: http://t.co/kwd5bGEF Use your voice to keep us moving forward: http://t.co/MMsjDQRO RT @letsmove: Photo: After a match at Wimbledon, the First Lady hugs @Venuseswilliams &amp; @serenawilliams during the #Olympics: http:/ ... RT @letsmove: Just arrived at swimming w @SummerSanders_ ! Go #teamUSA! http://t.co/j7j5hIwi RT @whitehouse: Go #TeamUSA! The First Lady has her picture taken with athletes at the US Olympic Training Facility in London: http://t. ... RT @whitehouse: Photo of the Day: At the #London2012 #Olympics, the First Lady gets a lift from US wrestler Elena Pirozhkova: http://t.c ... This campaign grows one person at a time—share the story of how you got involved: http://t.co/Nri5qDKe Every parent wants a better world for their kids—and that’s exactly what drives the President. Join him: http://t.co/XNt5fwu0 Find a weekend of action event near you—and bring a friend along: http://t.co/BrPIM2fo RT @letsmove: The First Lady on leading the US Delegation to London: \"It will be awe inspiring...It will be proud moment for me personal ... Last call: Be a part of @BarackObama’s birthday party at home in Chicago—we’ll fly you in. http://t.co/vAp4Ob12 The First Lady heads to London today, leading the U.S. delegation to the 2012 Olympic Games. Follow @LetsMove for updates on her trip. One thing you can do this week to help this campaign grow: Bring a friend along when you volunteer. http://t.co/A0ZVZZWB If you’re a woman and you’re for Obama, this is the group you need to join: http://t.co/Vl4P94eB Saturday, people all across the country will be registering voters and reaching out to their neighbors. Join in: http://t.co/w8Cyz5NS –mo There’s a birthday party for @BarackObama coming up, and you could be on the guest list: http://t.co/tHZCK4Si The next time you volunteer for #Obama2012, invite a friend. Here’s how it makes a difference: http://t.co/03hQVDJU President Obama puts families first—if you’re a parent for Obama, this is the place to say so: http://t.co/8gxrPkQm The First Lady on what it's like to be First Mom: http://t.co/2WH3Z0fz The First Lady had a full house in Ohio today: http://t.co/HDoefgSV A colorful afternoon with a few new friends, thanks to @OFA_OH: http://t.co/hznLMahb Thank you to the thousands of Ohioans who made this an inspiring visit. I'm fired up! –mo Don’t miss the chance to help celebrate @BarackObama’s 51st birthday with him in Chicago—airfare’s on us: http://t.co/NqyMsJ51 Everyone has a story of how or why they got involved in this campaign—what’s yours? http://t.co/wPhRVrbV Attention Buckeyes: The First Lady will be in Columbus on Tuesday. Pick up tickets at your local @OFA_OH office today. http://t.co/MB9J9GT6 Watch a message from the First Lady kicking off a new way to get involved—It Takes One: http://t.co/ZQLYYfje Every single person can make a difference in this election.  Start today by committing to one action that will help grow our campaign.  –mo The President and First Lady honor Nelson Mandela International Day: http://t.co/OMAo2xI3 He’s fighting for our families: http://t.co/Sc1JvVQs In case you missed it, @Beyonce had a few kind words for the First Lady: http://t.co/GYsUFsTi .@BarackObama turns 51 soon—and here’s your chance to celebrate with him at home in Chicago: http://t.co/kXxr4v8B Four years after her first @BlogHer post, the First Lady reflects on promises kept and what's needed for the next four: http://t.co/61nxAHyk From one leading lady to another—here's @Beyonce on the First Lady: http://t.co/v6xWsZ8d A favorite Obama family recipe is up for a vote: http://t.co/Le8w4d7y The First Lady made some new friends while visiting a Florida YMCA yesterday: http://t.co/kSSOy7MR I had the chance to talk with some incredible Latina moms from around the country yesterday. Thanks @Mamiverse for hosting me! –mo For our daughters and our sons alike: http://t.co/vaXjPuhl Watch live: First Lady Michelle Obama talks to @Mamiverse at 12:45pm ET: http://t.co/yCnjSofg #Latinos2012 RT @LatinosforObama: .@MichelleObama is chatting with Latina moms today. Watch the livestream at 12:45PM EST here: http://t.co/os8UKeQD  ... Start the week off with a treat (and don’t forget to vote for your favorite!): http://t.co/H5i3t6eR RT @LatinosforObama: No te lo pierdas: @MichelleObama  chats with Latina moms tomorrow. #Latinos2012 http://t.co/2wsFHkiZ The First Lady is sitting down with a few of the moms from @Mamiverse in Orlando on Tuesday. Tune in here: http://t.co/xIok71qk #Latinos2012 A photo that makes us smile: http://t.co/Gqwz95jf A few favorite photos, a few good recipes—follow the First Lady on Pinterest: http://t.co/MuK6usjX The First Lady is winning, Jimmy: http://t.co/ymopqJ5S Check out a delicious cookie recipe (an Obama family favorite), then vote in the Presidential Cookie Bake-Off: http://t.co/HEfAVnzR Shaking hands and giving hugs on another Fourth of July: http://t.co/MKlngkIl Happy Fourth! What makes this day even more special is that it’s the day our first child was born. Happy birthday, Malia! We love you. –mo For everyone gearing up for Fourth of July celebrations, be safe and enjoy the fireworks: http://t.co/crk3XHz6 Tonight is one of the most important fundraising deadlines of this campaign so far. Pitch in $3 before midnight: http://t.co/qqeQI7zz If you support the President and First Lady, now’s the time to give to this campaign: http://t.co/WokXzGE9 President Obama: \"Today’s decision was a victory for people all across this country whose lives will be more secure.\" Cast your vote in @FamilyCircle’s Presidential Cookie Bake-off—we’re partial to the white and dark chocolate chip: http://t.co/aqVCcw2x We shouldn’t make it harder for kids to get an education. If you agree, pass this on: http://t.co/ULkE9IQf A photo that makes us smile: http://t.co/7vlUSWQC I just dropped in on our team at Obama for America headquarters. You all are doing a great job! –mo http://t.co/VV5FIxLW The President and First Lady recount the first time they went out (it’s pretty cute): http://t.co/DBhVd2cF As the son of a single mom, @BarackObama knows that pay inequality hurts families. That’s why he's fighting it: http://t.co/XIBeDJDA Today’s your last chance to join the Obamas for dinner—take a minute to enter #DinnerWithBarack (and Michelle!): http://t.co/tYHaltnl I'm really looking forward to the next Dinner With Barack. We've been a little busy for date nights lately! Hope you can join us. –mo Check out a favorite Obama family cookie recipe—then cast your vote in @FamilyCircle’s Presidential Cookie Bake-Off: http://t.co/1krH7vKi Throw your name in the hat for dinner with the President and First Lady before tomorrow's deadline: http://t.co/ENcSWyzf The Obamas tell their first date story: http://t.co/AdDo1oA6 The First Lady was out west last week, saying “thank you” to @OFA_NV and @OFA_CO volunteers. Check out the photos: http://t.co/XBcoyjSh Check out @BarackObama's op-ed on what the 40th anniversary of Title IX means to him as President and as a father: http://t.co/HHPv9u95 Cue a little night music: http://t.co/8hKX2ngC Volunteers are going to make the difference this fall. If you're in, sign up here: http://t.co/29jojZYu The First Lady is coming along for the next #DinnerWithBarack—here's your chance to be there: http://t.co/He6eITHv Fair pay for women means a stronger middle class. #Women2012 http://t.co/FibZKlpy First Lady Michelle Obama chatting with customers at Nacho's restaurant in Pueblo, Colorado today: http://t.co/Ax0u0Xjy Thank you to @OFA_NV and @OFA_CO for a great couple days. Volunteers like you are how the West will be won! –mo You have a chance to sit down with the President while supporting #Obama2012. It's the chance of a lifetime: http://t.co/2e4LuwMX The First Lady is a Woman for Obama. If you are, too, sign up here: http://t.co/fBWahmlh Great teachers make the difference for our kids. Stand with Educators for Obama: http://OFA.BO/vKsR41 The First Lady taped a Father’s Day video to thank @BarackObama and all the other great dads out there. Watch here: http://t.co/As0JJ4KA Father's Day is today—take a minute to sign the card for @BarackObama: http://t.co/Sa2XEd7W Thinking of two fathers I love dearly—the one who raised me and the one I married. Incredibly grateful for both. –mo The First Lady gives the commencement address at @OregonStateUniv today—congratulations to the graduates! Sign Michelle's Father's Day card for Barack: http://t.co/wC0nwSSK For any weekend pinners—be sure to check out the First Lady’s new Pinterest page: http://t.co/Xr65QDZR Hope everyone has some family fun planned this weekend: http://t.co/NJfPn2A8 It's not too late to join a Weekend of Action event in your neighborhood this weekend: http://t.co/HCN0s0C9 A big weekend of action starts tomorrow—help register voters in your community: http://t.co/2tC0adFN Join the First Lady in wishing @BarackObama a happy Father's Day: http://t.co/onLjGEhi 20,000 people have followed the First Lady since she joined Pinterest yesterday. Check it out: http://t.co/lE0S15OD Don't miss @BarackObama's address on the economy today—streaming live here starting at 1:45pm ET: http://t.co/QXTtNBO5 Sandra Fluke talks about why this election is so personal: http://t.co/rHc1gssu RT @BarackObama: Don't miss the President's speech tomorrow: RSVP to watch it live at 1:45 pm ET. http://t.co/9AQdjT7X The First Lady just joined Pinterest—check out her special Father's Day board: http://t.co/K3hTKlfO Sometimes even Bo needs a little help to get moving: http://t.co/LzLIS4fk The First Lady has one question for you: Are you in? http://t.co/lrgjeWqq Read Robin’s post here, and find out how you can help: http://t.co/T3l9sAAQ .@RobinRoberts, Barack and I have you in our prayers. We believe in you and thank you for bringing awareness and hope to others. –mo Wishing everyone a great Saturday, hula hoops optional: http://t.co/TfhiLcRe This week’s #FF goes out to @OFA_PA and @OFA_VA. The First Lady saw them “fired up” firsthand this week. Good work is happening out in NOVA! Thank you @OFA_VA and keep it up. –mo RT @OFA_VA: First Lady @MichelleObama got a short concert from 6 year old Sydney at Mom's Apple Pie in Occoquan. #MichelleinVA http://t. ... RT @BarackObama: The First Lady to @OFA_PA volunteers today: \"You will make the difference in this election.\" http://t.co/MPUMf8CF RT @OFA_PA: This 1st grader had to miss class to meet @MichelleObama, but made sure to get an absence note from the First Lady: http://t ... It was great to be back in Philly today with such a fantastic crew of supporters. You guys truly inspire me. –mo RT @OFA_PA: \"We worked tirelessly to elect @barackobama in 2008 and we're doing it again this year.\" #MichelleinPhilly http://t.co/SFwHfvDB In case you missed it, the First Lady answered a few questions from all of you on Twitter: http://t.co/JZPSEo7h RT @BarackObama: It's a family issue: http://t.co/ZO3onYKU A photo that makes us smile: http://t.co/BBIjtR2g Only a few hours left: Put your name in to join the Obamas at Sarah Jessica Parker’s home in New York—airfare's on us. http://t.co/wfnRqk9n An invitation from Sarah Jessica Parker: http://t.co/sTRZC7Hm A group of students joined the First Lady last week for a spring harvest from the @WhiteHouse vegetable garden: http://t.co/c2aPsFLb If you've got the President's back, say you're in for 2012: http://t.co/fTQX8lkT Photo that makes us smile: http://t.co/g3HJVPQv You asked and the First Lady answered: http://t.co/Wv4OoaPZ Sarah Jessica Parker is hosting the Obamas for a night in New York. Add yourself and a +1 to the guest list: http://t.co/8uS94NTk Summer is here and this campaign is heating up—join Women for Obama today: http://t.co/935QihDW Today we pay tribute to those who gave their lives for our country and offer our support to those who loved them. –mo This photo makes us smile (vintage edition): http://t.co/SyvtexOH Do you know what the voting laws are in your state? It’s easy—get the latest: http://t.co/050j63QC #RegToVote Every vote counts, and people like 96-year-old Dorothy Cooper are making sure their voices are heard: http://t.co/OnLv4hHH Sarah Jessica Parker is hosting the Obamas at her home in NYC. Win a spot on the guest list for you and your +1: http://t.co/XvDxw6rR The First Lady delivered a special message in person to @OFA_OH volunteers: \"I want to thank every single person.\" http://t.co/Y4rPYdhk The ACA means Katherine's daughter can’t be denied coverage for being a cancer survivor: http://t.co/1XMwRIny Our daughters are “counting on us to fight for them.” Beautifully said, and worth a watch: http://t.co/LWkVnxVK Join @Vets4Obama to help President Obama make sure those who have served this country continue to be a top priority: http://t.co/AOjfpjO8 “Veterans have done so much for this country—and your families set an example for all of us.” http://t.co/Ak03Dx1v RT @JoeBiden: Join Iowa's #Women2012 leaders call with Dr. Jill Biden tonight to discuss what’s at stake this November: http://t.co/40epfzha We’re giving away free Women for Obama bumper stickers. Show your support for @BarackObama and get yours here: http://t.co/DHabBIW6 Stevie Wonder, @Beyonce, @SaraBareilles, @JLo—find out who gets the First Lady moving: http://t.co/oGYCQBfI A message from the First Lady to graduates on Saturday: http://t.co/wHdDc8aN The First Lady shares her tips for staying fit and healthy, along with a few of her favorite workout songs: http://t.co/65a9TZ3R #NWHW RT @WomensHealthMag: A message from First Lady @michelleobama for National Women's Health Week: \"No more excuses.\" http://t.co/cjkNjhvg  ... I want to wish a very happy Mother’s Day to all of the moms out there, especially mine. She’s my rock every single day. Love you, mom. –mo The First Lady’s message for @NCATSU graduates today: \"It’s time for you to wake the rest of us up and show us everything you’ve got.\" This photo makes us smile: http://t.co/MP7VHFvo #FF: @VTnews, @NCATSU, and @OregonStateUniv, where the First Lady is addressing graduates and their families this year. Congrats, grads! RT @washingtonpost: WATCH: Michelle Obama's advice for VaTech grads http://t.co/3LiQ0frY #video Maxine's story about meeting the Obamas will make you smile: http://t.co/i1So2PC7 It’s safe to say Maxine won’t forget the time she met the First Lady backstage in Richmond: http://t.co/Co1mX5TT RT @BarackObama: \"Same-sex couples should be able to get married.\"—President Obama The First Lady is taking your questions! Reply with yours and she may answer it as part of a video Q&amp;A. Something to get you fired up this Tuesday afternoon—watch the First Lady’s remarks at Saturday’s #Obama2012 rally: http://t.co/mpybwwqC “We have come so far, but we have so much more to do.” http://t.co/CJUzywhl Join Women for Obama to get informed and get involved: http://t.co/MyAflPHT #Women2012 As the First Lady reminded students today: make sure to register at your new address this fall if you move this summer! http://t.co/az9HXxsM Incredible turnout at the rallies. I already knew you had Barack’s back, but today we really felt it. –mo Can we get another round of applause for our First Lady? http://t.co/bBc0lcc1 However you’re taking part in today's rallies, tag your tweets with #Obama2012 to share the excitement with other supporters. RT @BarackObama: President Obama and the First Lady are set to kick off the first #Obama2012 rally in Ohio—tune in at 12:45pm ET: http:/ ... It’s rally day. Are you fired up? Because we’re ready to go. –mo Ready for tomorrow’s rallies? Tag your tweets #Obama2012 for a chance to be featured on the big screen or the livestream. \"History has shown us that courage can be contagious.” A favorite FLOTUS quote is now a poster: http://t.co/RJJQi6je This #FF is inspired by this weekend's plans—the first official #Obama2012 rallies will be at @OhioState and @VCU tomorrow! Start celebrating Cinco de Mayo a couple days early by joining @LatinosForObama: http://t.co/yqv7aJNZ RT @OFA_NV: Thanks again to @MichelleObama for speaking to grassroots volunteers in Nevada yesterday. #Obama2012 http://t.co/BMsVVDod This is already a great week. I loved meeting so many amazing people at @OFA_CO, @OFA_NV, and the Warrior Games. –mo This photo makes us smile: http://t.co/FroPyxUq The First Lady thanked @OFA_FL grassroots supporters in Naples last week for all their hard work building #Obama2012: http://t.co/BmUFc6dR \"I want you to know that America does have your backs—and we're just getting started.\"—First Lady to military and vets today at Fort Stewart This week’s #FF is dedicated to some folks committed to improving our schools: @ArneDuncan and his @USEdGov team. Happy Take Our Daughters and Sons to Work Day! The First Lady spoke to kids and their parents today at the White House: http://t.co/Enimw49h The Obamas know the challenge of student loan debt firsthand. Stand with @BarackObama to make college affordable: http://t.co/rImJTkoY Watch live: The First Lady speaks at the White House's Take Your Daughters and Sons to Work Day. http://t.co/S48Nf7BM CeCe Ibson, an #ACA beneficiary, introduced the First Lady at the @OFA_IA event yesterday: http://t.co/Y3ujsow1 Met some amazing @OFA_IA volunteers yesterday. Thanks for everything you're doing. –mo RT @TheEllenShow: I'm proud to have a President who's as opposed to bullying as I am. http://t.co/hLToXsUL The First Lady is with @Girls_Inc in Omaha today, supporting their work to encourage “strong, smart, and bold” young women and girls. This photo makes us smile: http://t.co/5toAXpZs This week’s #FF: @GeorgeLopez, @MarcAnthony, @RocsiDiaz, and bienvenidos a Twitter, @LatinosForObama! This photo makes us smile: http://t.co/25RfiOLh If you're ready to play a part in this grassroots campaign, apply to be a summer organizing fellow: http://t.co/2loyVhqo #SumOrg12 In case you missed it, First Lady Michelle Obama spoke with @TellMeMoreNPR’s Michel Martin: http://t.co/OnLwLsE7 Talked to some amazing @OFA_PA volunteers today. Thank you for all of your hard work! –mo Equal pay is more than just a women’s issue—it affects every American family. Stand with President Obama for #FairPay: http://t.co/pVHu3wUc FLOTUS and @TheEllenShow teamed up with @JCPenney to surprise military daughters with prom dresses in Jacksonville, FL: http://t.co/q8Izx2kp One reason Gloria Steinem stands with the President: He “treats people with dignity.” Watch the rest of her message: http://t.co/3iWRy8G4 RT @Obama2012: .@stefcutter answers questions about the Affordable Care Act from @cafemom community members: http://t.co/KBKrjr2k .@Beyonce writes a lovely letter to FLOTUS: http://t.co/yfzOBnzs @Beyonce Thank you for the beautiful letter and for being a role model who kids everywhere can look up to. –mo Happy anniversary to @JoiningForces. Everyone can help support America’s military families: http://t.co/aFmy3Hqm First Lady Michelle Obama made a big endorsement on @ColbertReport last night—take a look: http://t.co/v3UGXBfX Every mother works hard, and every woman deserves to be respected. –mo The First Lady visits @ColbertReport tonight. You won’t want to miss this: http://t.co/WXCfoUX4 Did you catch the First Lady on @BiggestLoserNBC last night? http://t.co/YsYwi0Sb This photo makes us smile: http://t.co/RpCng80W Thanks to the President's support of Pell Grants, 3 million more American students can afford college—including Dakota: http://t.co/aWAL4NGy The Obamas hosted the fourth annual Passover Seder at the White House last night: http://t.co/ijEYSrUs From our family to yours, wishing everyone a wonderful holiday weekend. –mo This week’s #FF: @EvaLongoria, @KerryWashington, and @ItsGabrielleU, all #Obama2012 volunteers. Join them: http://t.co/EzpwbL1t RT @JoiningForces: Photo of the Day: First Lady Michelle Obama greets a #WoundedWarrior @ Walter Reed in #Bethesda: http://t.co/b8v8yzVL This photo makes us smile: http://t.co/3P7YfiTS Curious what the Affordable Care Act means for you and your family? Submit a question for @StefCutter on @CafeMom: http://t.co/UpQ7aIbp The First Lady invited @BiggestLoserNBC to the White House for a workout—be sure to tune in next Tuesday: http://t.co/RgYiXDJr RT @BarackObama: Five years ago, a woman named Edith Childs proved that one voice can change the world: http://t.co/h5piUq8O RT @ColbertReport: Nation! First Lady @MichelleObama will appear on The Colbert Report on Wednesday, April 11. Tune in at 11:30pm / 10:30c. Thanks to the Google Art Project, you can visit the @WhiteHouse whenever you like: http://t.co/BShveu9n The First Lady’s Facebook page has a brand new look—check it out: http://t.co/PetEaOdj The First Lady joined Russ Parr this week to talk about staying happy and \nhealthy: http://t.co/pvCWGu1E In case you missed it, the First Lady presented @TaylorSwift13 with the Big Help Award last night: http://t.co/3oWHubjB #KCA Watch the First Lady present @TaylorSwift13 with the Big Help Award tonight at @NickelodeonTV’s Kids’ Choice Awards: http://t.co/jkSo3q3T The President works hard every day to make sure we can finish what we all started together. Will you pitch in? http://t.co/e0tfKmOu Set the DVR for tomorrow night—the First Lady will be part of @NickelodeonTV’s Kids' Choice Awards: http://t.co/jkSo3q3T RT @BarackObama: Own a piece of this campaign—chip in $3 before Saturday’s critical fundraising deadline: http://t.co/JB506UkJ This photo makes us smile: http://t.co/p75wkjOJ Not many people get to sit down for dinner with the President—but you could be one of them: http://t.co/sNZpqgFP #DinnerWithBarack Women across the country are participating in a week of action. Join the work in your neighborhood: http://t.co/TWQWY4iH #Women2012 The First Lady joined D.C. students for the National Cherry Blossom Festival Centennial Tree Planting yesterday: http://t.co/MI281A90 Photo that makes us smile: http://t.co/kktO330Y Kids from around the country are helping the First Lady plant the White House Kitchen Garden today. It’s a tradition: http://t.co/zx9493yA The #Women2012 Week of Action is underway—help protect @BarackObama’s progress for women's health: http://t.co/TebI3ltY Spring is in the air—enjoy it! http://t.co/BvrgCFRD Barack signed the Affordable Care Act into law two years ago today. It's saving lives, and it's up to us to protect it. –mo We have a lot of progress to protect—sign up to join the #Women2012 week of action: http://t.co/ZW7zYsTb No parent should have to settle for less when it comes to the health of a child: http://t.co/8rK8Ylxp #ACA The First Lady is helping to kick off a #Women2012 week of action—will you join us? http://t.co/y5a7aFKm RT @JoiningForces: The First Lady talks #JoiningForces &amp; how everyone can support our vets &amp; military families on the @Late_Show ... Nine years ago today, the war in Iraq began. Let us all honor those who have served and sacrificed for our country. –mo RT @Vets4Obama: Today is the 9th anniversary of the start of the Iraq war. Watch this message from @MichelleObama: http://t.co/UqCk9rf0 “The Road We’ve Traveled” premiered last week—it’s an incredible look inside @BarackObama’s presidency: http://t.co/TPMJe3vT The First Lady was @JoiningForces in Minneapolis yesterday, celebrating servicemembers and their families: http://t.co/0dMZaAqv Zoe was born with half a heart. A video every parent needs to see: http://t.co/5HaImX6a #FacesOfChange Today’s #FF goes out to women making history—@DrMayaAngelou, the women of @JoiningForces, and #SecClinton of @StateDept. RT @BarackObama: Tonight’s the night—tune in to watch the live premiere of “The Road We’ve Traveled” at 8pm ET: http://t.co/6JFQVVFE #Ro ... Set your DVR! The First Lady visits David Letterman on the @Late_Show Monday night to talk @JoiningForces. Spike was skeptical about health reform. Then she was diagnosed with breast cancer: http://t.co/6K9fO7fy #FacesOfChange The First Lady and Mrs. Cameron teamed up with D.C.-area students to celebrate the 2012 Olympics and @LetsMove: http://t.co/4NhQi5Pn This photo makes us smile: http://t.co/FQT8NouD The brackets are out and the President is making his picks—have you made yours? http://t.co/OAQLcf3q #BaracksBracket Have you checked out the trailer for \"The Road We've Traveled\"? http://t.co/xt1p0SbE The First Lady was in Concord, NH yesterday celebrating the town's campaign to promote health and wellness: http://t.co/tiJ7Nb8I #LetsMove It was great to sit down for dinner with a few new friends last night. My date had a great time, too. –mo RT @BarackObama: Around the table tonight: Cathleen & John, Judy & Mitch, ReGina & Bob, Barack & Michelle. #DinnerWithBarack http://t.co ... \"She has been an inspiration to women and girls around the world.”—FLOTUS on Sec. Clinton at the IWC awards: http://t.co/qnPCChS5 #IWD Generations of Americans marched and organized for women's rights. This Women's History Month, let's honor them with our service. –mo Watch live: The First Lady presents at the International Women of Courage Awards, hosted by Secretary Clinton. http://t.co/wn1BXDWr #IWD The First Lady recruited a few members of the @BravoTopChef team for a @LetsMove challenge. Check it out tonight at 10pm ET! Singer @JanelleMonae on her song \"Tightrope\"—a favorite of the First Lady’s—and why she supports @BarackObama: http://t.co/fGgWCLg6 In case you haven’t seen it yet, there’s a familiar face on the March cover of @PreventionMag: http://t.co/uohGqO0s Met so many wonderful kids and athletes at the CIAA tourney in Charlotte yesterday. March Madness has arrived! –mo RT @Vets4Obama: A Nation's Gratitude: @BarackObama and @MichelleObama honor #Iraq War #veterans and their families. http://t.co/sZ6y7c4D The President and First Lady honored servicemembers at the White House last night: http://t.co/H1mL6f17 This was an important month for #AfAm2012. Keep the conversation going in your community: http://t.co/Zyoiycpf RT @JoiningForces: First Lady & Dr. Biden urge action from state governors on #milspouse hiring: http://t.co/lTJtQHcf Women for Obama is a great way to get involved in your community—sign up to be part of it: http://t.co/aqLCVNkG #Women2012 The First Lady visited two landmarks for African American heritage this week—@NMAAHC and @FreedomCenter: http://t.co/2lme69rX “This house belongs to you. These opportunities belong to you.”—the First Lady encouraging young musicians at yesterday’s blues workshop Happy President's Day to my personal favorite, @BarackObama. –mo The men and women protecting this country deserve our support, as do their families. Get involved with @JoiningForces: http://t.co/yzsTO5Qf Almost time to start ordering seeds for the White House vegetable garden! http://t.co/foE6ZGmx This picture makes us smile: http://t.co/FIWttwtI A child's habits can affect his or her academic performance—join @LetsMove and @FitnessGov in setting kids up for success. #FF In case you missed it, hear the First Lady’s answers to some of the questions you tweeted: http://t.co/7CHXlkC3 RT @whitehouse: Surprise! @WhiteHouse’s biggest celebrity (our dog Bo) & I are about to greet folks on their tours. Watch it live: http: ... RT @JoiningForces: First Lady & Dr. Biden urge state action to support military spouses with state licenses: http://t.co/q0Vz0xNf \"I have hula-hooped, I’ve played flag football, I got to dance to Beyoncé, do a little 'Dougie.'\"–The First Lady on keeping fitness fun Happy Valentine’s Day: http://t.co/T1I9OV5Z The First Lady loved answering the questions you tweeted! Watch what she had to say: http://t.co/frhuIypq What’s everyone else’s favorite song? http://t.co/AotOwxaC #Obama2012 I wonder how Al Green ended up on our playlist, @BarackObama! –mo Pets are the perfect partners for outdoor fun, even when it's cold. Bo loves a good snowball fight: http://t.co/3eJgKM5m RT @letsmove: Michelle Obama wants to see the healthy changes you are making in your community - send her a video! http://t.co/r5mXKLiZ  ... The First Lady celebrates “all those women who live each day with a spirit that is uniquely their own”: http://t.co/hhP1nqC1 #AfAm2012 The First Lady stopped in Des Moines yesterday to celebrate 2 years of @LetsMove. Spoiler alert: There’s dancing! http://t.co/AzlykpEX RT @letsmove: Today, First Lady Michelle Obama kicks off her #LetsMove tour in #DesMoines #Iowa to celebrate the 2nd anniversary of @Let ... The First Lady believes mentors can shape the next generation of leaders. Who has been a positive mentor or influence in your life? In case you missed it, check out the First Lady’s fitness challenge to @JimmyFallon at the White House: http://t.co/1z1bhbBk RT @jimmyfallon: We are back in NYC live tonight with the first lady!! A little fitness competition in the White House. #FallonTonight h ... I’m looking forward to answering some of your questions later this week—thank you for taking the time to submit them! –mo RT @letsmove: WH Office Hours: #LetsMove 2nd Anniversary with Sam Kass. Ask your questions now with #WHChat & join live at 2:30ET http:/ ... There’s more than one football fan in the Obama family: http://t.co/Pq5edsNC This year’s African American History Month honors the legacy and contributions of African American women. Are you participating? #AfAm2012 @LetsMove turns two next week. Have you joined the First Lady to fight childhood obesity? #FF In case you missed it, check out the First Lady on @TheEllenShow. Spoiler alert—there’s a push-up contest: http://t.co/kCX9vepO The First Lady on importance of mentoring, giving young people \"Someone they can trust, an example they can follow.\" http://t.co/41bCKJ3y It’s been a big week for @LetsMove, and it’s not over yet—check out the First Lady on @TheEllenShow this afternoon! If you missed the First Lady on the @RachaelRayShow, you can catch her appearance here: http://t.co/gqk81gUY #letsmove RT @TheEllenShow: Who do you think can do more push-ups -- me or @MichelleObama? Watch tomorrow #LetsMove\n  http://t.co/VshUqYCv In case you missed it, the First Lady expanded @JayLeno’s healthy-food horizons last night: http://t.co/D4cTNFL3 RT @jayleno: TONIGHT: First Lady @MichelleObama, Mark Harmon from #NCIS, performance by @ImeldaMay & all new Headlines! http://t.co/O1ayEBHk Thank you to everyone who submitted questions for the First Lady over the last few days. Stay tuned for answers! The First Lady is visiting @JayLeno later this evening. Are you tuning in? #letsmove One more reminder to tweet your questions for the First Lady by the end of the day—she’d love to hear from you. The First Lady and @HildaSolisDOL proposed a new rule today that could help a military family you know: http://t.co/LliayVvE #wecantwait Fair pay for women means better support for American families. Have you stood up for equal pay for equal work? http://t.co/IIgyLZVQ RT @BarackObama: The President signed the Fair Pay Act three years ago today. Stand by him to make more progress toward equal pay: http: ... The First Lady helped announce two healthy-food initiatives for families this week—do you have tips for getting healthy meals #onthemenu? Do you have a question for the First Lady? Reply with it by Jan. 30th—the First Lady will be answering some of the questions you tweet in. If you've ever wanted to ask the First Lady a question, here's your chance. Reply by 1/30—she'll answer a selection of what folks submit. Proud that the Fair Pay Act was the first bill Barack signed as president. http://t.co/VypsibPM –mo The First Lady joined @usda & @GranFamiliaGoya today to unveil the meal-planning tool #MiPlato. Read the announcement: http://t.co/JrM44et2 RT @USDA: USDA Blog: Healthy Meals and Healthy Kids http://t.co/NceNFjkX RT @BarackObama: Last night, President Obama laid out a blueprint for an America that's built to last. Stand with him: http://t.co/cSfKZADB Thank you to all who watched @BarackObama’s #SOTU2012, particularly the guests who joined the First Lady in person: http://t.co/0E1TUcr7 An auto worker, a mayor, and a teacher—find out who else is sitting with the First Lady tonight at the #SOTU: http://t.co/RIqHhcG8 I hope everyone's made plans to watch tonight's State of the Union—where will you be watching? -mo Join your neighbors tonight to watch #SOTU2012 and discuss the issues that matter to your community: http://t.co/v6OggDIQ #Obama2012 Make sure to sign up for a State of the Union watch party in your neighborhood before the President's address tomorrow: http://t.co/pGAruv8g The First Lady’s @letsmove campaign is about making staying active fun for kids and parents—how is your family getting moving this weekend? RT @BarackObama: Thanks to the Affordable Care Act, women won't have to pay out-of-pocket costs for contraception as of Aug. 1. http://t ... Want to get involved with the First Lady’s work with military families? Following @JoiningForces is a great place to start. President Obama will give his State of the Union address next Tuesday night—join an #Obama2012 watch party near you: http://t.co/RSL3hGmA Thanks to everyone who served their community on MLK Day, and sent birthday wishes on Tuesday. It's been a nice week. –mo This photo of the First Lady and President Obama makes us smile: http://t.co/Q2ji9AKj This was too much fun: http://t.co/oWvkXupv -mo The First Lady recently launched Women for Obama—have you signed up to be a part of it? http://t.co/RhSAC142 #women2012 RT @JoiningForces: World Series Champ @Cardinals are #AtTheWH today. Watch Mrs. Obama @ Game 1 in St. Louis to support military families ... RT @BarackObama: Happy Birthday to @MichelleObama! Singing is optional, but you are welcome to add a note to her birthday card: http://t ... Thanks to everyone who served today. Here's how the First Family spent #MLK2012: http://t.co/nn9j062s On this Martin Luther King, Jr. Day, what does progress mean to you? http://t.co/AnSAlQYz #MLK2012 You've still got time (but not a lot!) to find an #MLK2012 event in your community: http://t.co/MPtNlIAL Day off tomorrow? Use it to make a difference by volunteering in your community: http://t.co/iqufDfZd In case you missed it, check out the First Lady's interview with @GayleKing yesterday:http://t.co/3lJEhc5X RT @JoiningForces: Photo: Mrs. Obama and @MirandaCosgrove backstage @ the iCarly screening with military kids: http://t.co/QlYX9h19 There are some big iCarly fans in our household, so we're all pretty excited about today's event with military kids and the cast. –mo Here's something dear to my heart: the MLK Day of Service. Will you join me to serve your community on Monday? http://t.co/WQuutbjL -mo RT @JoiningForces: Yesterday, the First Lady announced new commitments that will improve health care for our heroes: http://t.co/qfHDIi9L Hi, everyone, and thanks for the warm welcome. Look forward to staying in touch with you here. -mo This account will be managed by campaign staff, with any tweets from the First Lady herself signed \"-mo.\" We're excited today to launch @michelleobama as a new way for you to connect with First Lady Michelle Obama and the President's campaign."}