{"tweets": "Akan LIVE di akun VLIVE gue sebentar lagi, tepat pukul 20.00 WIB. Gabung yuk guys, langsung click this link ya https://t.co/bP85AFeV9k RT @OfficialGTVID: Wow! Surprise mashup dari para coaches @thevoicegtv @isyanasarasvati , @armandmaulana04 , @vidialdiano , @ninokayam , @t… Update jadwal bulan ini! See you guys hopefully disalah satu panggung ini ya https://t.co/3Kh57e4RO4 Lagi di mall, baru selesai keluar dari toilet to do my own business, trus mas-mas yang jaga bilang, \"makasih\". Terus gue bilang \"sama-sama..\"\n\nWHY? Tegar 2.0 untuk menyambut konser bu @mynameisrossa malam ini. Click link down below:\n\nhttps://t.co/l8eFKcMsM5 HAHAHA! Kapan gue jadwalin deh live lagi ya. Well mainly isinya bakal gue ngetawain diri sendiri lagi sih.. disini ada yg udh download VLive? https://t.co/B512Rwoad8 RT @pophariini: Wah kapan lagi denger @vidialdiano nyanyi bareng @ralineshah dan @ArielNayaka?! https://t.co/KXmzWgAPN8 1 MILLION VIEWS WITHIN A WEEK! THANK YOU! \n#ReadyForLove\n\nhttps://t.co/jHrfJFkjQO https://t.co/8D3RECpKKQ Sampai bertemu malam ini di Condet teman-teman Jakarta Timur! https://t.co/qG8RMcbAOu RT @Billboard_INA: Menuju album terbarunya, @vidialdiano merilis sebuah lagu bernuansa 80an  bertajuk “Ready For Love”, hasil kolaborasi de… VLOG BARU BANGET TAYANG NIH!UP UP!\n\nhttps://t.co/VpFB6m2RNU Hari ini #ReadyForLove udah tembus 100k views di Youtube! Bisa tembus 1 juta views sebelum seminggu rilis ga ya?\n\nYg blm ntn, langsung hit link ini ya https://t.co/jHrfJF2IZg https://t.co/GeyMg0CLEs Selamat hari Senin. https://t.co/9nHUe0xE5u Yang belakang udah #ReadyForLove banget. Yang foto juga udah sih. Tinggal tunggu orang yang siap juga aja 😂\n\nYang blm ntn MV gue, click link ini ya   \nhttps://t.co/gDCRenNFuQ\nHappy Sunday, mblo! https://t.co/qz7tF4wAW5 Hello Bali, what's up?! Rehat sejenak sebelum perform malam ini di Pantai Mertasari. Perdana bawain #ReadyForLove diacara off air nih. See you tonight guys! https://t.co/zskieR2wId Yang tadi ga bisa dateng ke premiere party #ReadyForLove, bisa langsung stream di VLIVE skrg juga! Click link ini https://t.co/zhzrSxut2U Gue udah siap untuk membagi cinta gue besok. Masalah nya sekarang, siapa yang mau?\n.\n13.09.19\n#ReadyForLove https://t.co/oUzD2znEMQ Selamat jalan Eyang Habibie. Thank you for all your wisdom and knowledge that you’ve shared to my family and the whole country. We love you. https://t.co/lMJjXSQ5so September schedule is up! Semoga ada jadwal yang bisa bertemu bulan ini ya kawan! https://t.co/RilJKmPLns The secret is out! Introducing Ariel Nayaka &amp; Raline Shah as my collaborators for #ReadyForLove!\n\nTunggu tanggal mainnya!\n13.09.2019 https://t.co/smKs2juo6L VLOG gue dibackstage VLIVE sudah tayang di Youtube. Nonton disini https://t.co/br2Qs3YHRB https://t.co/llVUNZIlXO THE VOICE INDONESIA. Happening now on GTV. Let’s go! #TeamVidiNino https://t.co/gWp1Z3lzUr Jadi siapa nih idola kalian di The Voice ini? Yuk dukung #TeamVidiNino &amp; tonton The Voice Indonesia yang bisa juga disaksikan di aplikasi RCTI+. Download aplikasi RCTI+ sekarang! \n\n#RCTIPlus #NontonGakMonoton #BanyakPlusDiRCTIPlus https://t.co/CH3ce9k3e7 Akan ada 2 kolaborator hebat di lagu #ReadyForLove yang akan rilis tanggal 13 September 2019.\n\nBisa tebak siapa 2 orang ini? https://t.co/yDolrg6pBe Buat yang blm tau, hari Jumat depan tanggal 13 Sept 2019, gue akan rilis lagu baru berjudul #ReadyForLove.\n\nAkan ada teaser lagi sore ini. Stay tuned ya guys. Semoga kalian se-excited gue! 😁 Getting all sweaty before the big reveal today. Stay tuned on my social media this afternoon guys! #ReadyForLove https://t.co/cGnr6M9vFX It’s been too long, since I had someone right beside me..\n\n13.09.2019\n#ReadyForLove https://t.co/PJxEN54rE6 Hahaha its okay, my pleasure! https://t.co/W8TTnv2EgS RT @vliveindonesia: D-1 V HEARTBEAT in JAKARTA 🙌🏻\n\nKalian udah gak sabar mau liat penampilan siapa nih?\nYuk mention di bawah artis yang pal… Hari nya The Voice Indonesia. Wish me luck! https://t.co/ba1SGg6kWb Saat kesusahan nyari 2 hari libur untuk tidur aja... disatu sisi, alhamdulillah ya Rabb atas semua rahmatMu..\n\n, sisi lain...\n\nKASUR DAN TIDUR YANG LEBIH DARI 4 JAM, I MISS YOU KOK SUSAH BANGET KAMU DICARI KAYAK JODOH.\n\n..wow Pagi ini untuk pertama kalinya akan terbang ke Pangkalanbuun untuk mengisi sebuah acara. Wish me a safe flight guys! https://t.co/xHEbZdtdfs @Adriandhy Nyerah dari 1000 purnama yang lalu pak hahaha @Adriandhy IG lo kapan ga rapih sih yan..... Thank you for having me guys! https://t.co/2EjgwyH436 UNDIP Semarang! Energi kalian siang ini luar biasa gila!! Makasih guys! Selalu senang pulang ke kampung bokap gue. Until next time, Semarang! https://t.co/tLJAsdcyaj Indonesia 🇮🇩, negara dimana saya tumbuh, belajar, dan merdeka berkarya sebagai musisi.\n\nSemoga semakin banyak lagi orang yang bisa lebih menghargai karya-karya lokal dan semua seniman didalamnya. Merdeka terus bangsaku! #RI74 https://t.co/RPNDWc8vnP @orienn Gue 1000 TIKET LAGI UNTUK KALIAN\n\nUntuk kalian yang belum daftar event V HEARTBEAT in JAKARTA ada kabar gembira nih!\n\nAkan ada 1000 kursi tambahan untuk kalian✨ \n\nCek link berikut untuk detailnya!!!! 👉🏻 https://t.co/PeJmzW8DQj \n\n#VHEARTBEATINJAKARTA https://t.co/kBMET3YM8S Sudah keluar sangkar saat purnama masih berada diatas kepala. Selamat (terlalu) pagi guys :) Selamat pagi semesta. https://t.co/sx1RY57kep #EidAlAdha with Sammo Hung. https://t.co/CmXB1RopxR Selamat Hari Raya Idul Adha 1440 bagi teman-teman yang merayakan.\n\nSemoga kita diberikan iman yang kuat untuk makan secara bersahaja dan tidak berlebihan hari ini. Amin. #EidAlAdha https://t.co/BI2e1stZiT Wow kena azab Thanos. https://t.co/MUGNPt3sjP Ih ngambang. Takut. https://t.co/1Z4V8zfAqJ Oiya deng gue halu doang makasih ya udah dibuka mata batin saya... https://t.co/0Oa40zK4tg Wow anda betul juga.... https://t.co/1dCcI2yMtc Jujur ini horor! https://t.co/750y9B5wa8 INI MAKIN LONELY HALO?! https://t.co/cyNrNYG8Dx Yang ini Buy 1 Get 2..... 😔 https://t.co/bwYLUXly9o Maap. Ini terlalu rame sampe flicker. https://t.co/W11kIZhqDc Wow ini program Buy 1 Get 1 atau gimana? 😂 https://t.co/gjTB9Eq7g1 Dear netizen Twitter yang kreatif, tolong bikin gue ga sendirian di hari adek gue ulang tahun ini dong... 🙃 https://t.co/UR0oR3w3pK Teman berkendara hari ini. https://t.co/d7rcaiv8QC Selamat pagi agak menuju siang! Siap-siap menuju panggung pertama hari ini.\n\nJakarta, kamu udah ngga terlalu abu hari ini, walau masih sedikit. :) https://t.co/621EvbY5cL Jakarta masih gelap. Kalo masih mati lampu kayak gini, apa kita warga ibukota bisa lihat bintang dengan kurangnya polusi cahaya? Dalam judul, ngungsi sama adik. https://t.co/7x0Y2q8Sa9 Ok recap dari cuitan teman-teman.\n\n1. Jakarta dan sekitar mati lampu. Saya warga Tangsel juga rumahnya mati lampu. Innalillahi..\n\n2. Provider merah internet bisa, tapi ga bisa telpon. Beberapa emang ga ada yang mau telpon aja karna hidupnya sendiri. Miris.\n\nAda tambahan? Ya ini sih miris... -.- https://t.co/mwB47my0uf Hei Jakarta, internet hp nyala, tapi mau telpon ga bisa. Ada yang ngalamin hal sama? Ini info gempa barusan guys https://t.co/PaJyjuAjsv Jakarta gempa nih. Ada yg ngerasa? Sedikit teaser dari rekaman bareng sama Om Erwin Gutawa hari ini. https://t.co/Quvx2tLma7 16 jam berlalu. Masih di set shooting. I think this will be the most ambitious music video that I've ever done.\n\nWaktu persiapan minim, mimpi dan visinya maksimal. Bismillah lah. Tungguin guys! Selamat pagi dari lokasi shooting!\nAnother music project is on the way. Wish me luck! https://t.co/mGV52dGDuM @sherinasinna Pagi cantik @athasoemarko Ehm.. where's my invitation to this meet up? Have a great Sunday tweeps! https://t.co/jycwL9GEF6 A short cover to lighten up your weekend! Enjoy!\n\nWeak - SWV https://t.co/wsA3l3K0XC Welcome back to Jakarta!\nThrowback to the last time when you had your debut concert here! https://t.co/Hzaf1aC4MB https://t.co/hyuHvksVKh Makasih udah diingetin ya. Memang daun di pot ini penuh dengan fiber dan juga zat besi yang bagus untuk tubuh. https://t.co/fBRYVvrO3k Oh ya perih banget hidup..... https://t.co/rwOL4XjslB Tanggal tua blm gajian. https://t.co/QHQQfsf3s0 One mistake doesn’t define someone’s character. Be strong my good-hearted friend. Hoping all the best for you, @jefrinichol. https://t.co/Idv0sII04A Selamat pagi Jakarta! \n\nJam 11 akan perform di Area Parkir Selatan GBK, di acaranya SGM. \n\nYuk yang baru kelar CFD merapaat :) https://t.co/rqPzjeXryh BANDUNG MALAM INI! See you guys! https://t.co/Bk0xrbCMQj Sore guys! Dapet salam dari Bibi Lung. Sekian dan terima kasih. https://t.co/V87zUIc5Ub Selamat pagi Banyuwangi! Seneng banget semalem pertama kali manggung disini dan orang-orangnya no joke, SUPER RAMAH! Definitely will come back here to visit Ijen and your other hidden treasure. Thank you! https://t.co/0DASVQCvKJ Nunggu jodoh ga sampe mukanya jadi gini dong ya.. amit-amit. #VidiReadyForLove https://t.co/pyFZDnx8Nv INI JADWAL MINGGU INI YANG BENER YA GUYS.\n\nMAKASIH ATAS PERHATIANNYA DENGAN CAPTION SERBA CAPSLOCK INI. https://t.co/293HMk6p30 HAHAHA TERNYATA ADMIN GUE YANG KURANG MINUM. OK REVISI. https://t.co/XfoyZKVIRM Weekend loh ituu hari Sabtu halooo kurang minum ya anda. Haha 😂 https://t.co/cUKfbO2gC0 Ey semangat yang pada kerja juga ya! Selamat beraktifitas guys :) https://t.co/RsDTHDkrb4 Sungguh sebuah sikap. https://t.co/labuTMEMvp Selamat pagi Indonesia! Selamat masuk  sekolah hari kedua. Yang masih ngumpulin semangat untuk kesekolah mana suaranya? 😁 Hampir seminggu break kerja, kabur sebentar ke Labuan Bajo. \n\nHari Senin gue kebetulan pemandangannya gini. Yang pemandangannya laptop, meja, dan rekan kerja mana suaranya? https://t.co/4GqaSRvo4G Aku takut jatuh min, soalnya sering ditengah jalan liat orang cantik terus jatuh hati. https://t.co/4E0TSWXDZj Ga perlu di edit sama mantan juga sih... https://t.co/WyBFvP8QV9 INI BASED ON TRUE STORY https://t.co/CXNxZzbNeY Yang udah nonton Aladdin, liat gue ga di scene ini? https://t.co/dQcYrUaWT1 ASTAGFIRULLAH https://t.co/a7ZFESHwRQ Gue beneran zoom sambil nyari dong..:: https://t.co/RRr6t1FYjf Wow sesuai dengan tempatnya. https://t.co/EPsVA4iNTg HAHAHAHA!!! https://t.co/I5aRITTfLf Menyambut film Lion King. https://t.co/grkIWih03J Penantang maut. https://t.co/OceChkj3qx OMG. https://t.co/tBdy4Wjy5F Ya rabb..... Yaudah gue post lagi malem -.- https://t.co/IwGPLsfSNd Katanya netizen Twitter lebih kreatif-kreatif. Coba ada yang mau bantu edit foto gue biar gue ga sendirian? https://t.co/RYrY22XVCn Mendarat di Labuan Bajo, eh liat ada jemputan nya pak @jokowi. Semoga bisa ga sengaja ketemu Bapak disini ya. https://t.co/6hmh5Jme3u Team hampir 10k pagi ini ☀️💦\n.\n📷 willymulyadi27 @ Jakarta, Indonesia https://t.co/Hy8tv0Hi4g RT @athasoemarko: Note to self: your skin does not react well with santan; do not overdo your kolak consumption; ta’jil is not the main cou… Jogja selalu hangat dan menyenangkan. Terima kasih untuk karaoke bersama nya. Semoga kita bisa bertemu secepatnya lagi. \n.\n📷: willymulyadi27 @ Ambarumo Plaza(Amplaz) https://t.co/wWcUhWkwkB Bismillah untuk Indonesia 🇮🇩 yang lebih baik. @ Indonesia https://t.co/3UIksyGqE0 A short cover of “7 Rings / My Favorite Things” by @arianagrande from me and my bandnana_ 😊 https://t.co/HPRMi89GF1 RT @BreakoutNET: #NowPlaying Terambang by @vidialdiano https://t.co/RjmFjJd1X9 MV #Terambang is out now! Click the link below to watch it now\n\nhttps://t.co/reXOieowVS\n\nSiapa disini yang sudah nonton?? Giveaway alerts!\n.\nMV #Terambang sudah keluar. Coba comment scene mana yang menjadi favorit kalian. 3 orang dengan comment terbaik akan mendapatkan poster #Terambang seperti… https://t.co/mNTK3sbDte Terambang Premiere Party had a huge turn-ups! Thank you my VA Team who worked so hard to make yesterday possible, and also to everyone who  showed up!\n.\n#Terambang is available… https://t.co/fgzKbxcGcD #Terambang is out today!!!  #NewProfilePic https://t.co/xf0AnFnjow #Terambang series, episode 1: Sebatas teman saja. https://t.co/7pTNxMyxZ7 via @YouTube Terima kasih yang sudah menyempatkan hadir di @konsersalute! Sebuah tribute untuk 3 composer wanita hebat Indonesia @melly_goeslaw @deelestari dewiq_official! https://t.co/N1BLbfMPke Selain debat presiden, ada debat antara kami berlima juga malam ini di @thevoicegtv. Siapa yang lagi nonton sekarang? https://t.co/nDarnhkUmv Persiapan menuju Olimpiade 2020 di Tokyo. Doakan ya guys 🇮🇩 @ Zermatt Matterhorn https://t.co/oaEso3jh9z Happy ❄️ @ Luzern, Switzerland https://t.co/CcWdwIVMsT Ekspresi lo saat orang-orang ngira gue si VA yang ditangkep di Surabaya. Ya kali boss 😂...\n.\nAnyway, special thanks to @roxieve for the private tour around Luzern Switzerland 🇨🇭. Sampai… https://t.co/CFYSwPiMTe Jilat salju ❄️ @ Luzern, Switzerland https://t.co/oYE7kav6Il Tahun baru, resolusi baru. Resolusi apa lagi ya yang harus dicapai ditahun ini? Ide dong guys 😄 @ Winter Wonderland https://t.co/WScqB2KmJl Mengakhiri tahun 2018 bersama keluarga kedua saya di Trenggalek. Semoga penampilan terakhir ditahun ini bisa membawa banyak tawa &amp; senyuman untuk teman-teman disini. Last gig of the year!… https://t.co/efOUuPYNms Mengakhiri tahun 2018 bersama keluarga kedua saya di Trenggalek. Semoga penampilan terakhir ditahun ini bisa membawa banyak tawa dan senyuman untuk teman-teman disini. Last gig of the… https://t.co/9aY74L4cB6 Another great performances tonight. Also another great battle between coaches to get the best team @thevoicegtv. Who's with us? #TeamVidiNino https://t.co/Ih0AMkb2Lg #IDontMind for Sweet17 Transmedia.\n.\nSiapa yang tadi nonton? https://t.co/DHkmibkhi2 Bwek😛 @ Kuala Lumpur, Malaysia https://t.co/rI9sf1mTv1 I added a video to a @YouTube playlist https://t.co/tCbzhklCan Wahyu - Selow (Official Music Video) Perang lagi, perang lagi. Bakal ada pertempuran apa lagi ya malam ini melawan para senior-senior tersayang? You know what to do. Only on @thevoicegtv. #TeamVidiNino https://t.co/aF55NlYkSn Teruntuk manusia botak yang selalu mendukung karir dan semua passion gue dari belakang, dan kebetulan difoto ini dia ada di belakang gue, selamat ulang tahun!\n.\nTanpa manusia hebat ini,… https://t.co/G3Q7rYhuWF Berawal dari coba-coba rekaman sendiri dirumah dan menghabiskan hampir seluruh waktu SMA gue untuk membuat demo album. Walau pada akhirnya, kerja keras 3 tahun itu berujung penolakan dari… https://t.co/SVwJeK80Br Guru merupakan sosok penting dalam perjalanan hidup saya. Sedikit banyak mereka telah mengantarkan saya berada di posisi saat ini. Selamat Hari Guru Nasional untuk para guru di… https://t.co/CxHS6xb5mB Kencan saya semalam walaupun dibasahi hujan. I love you guys! Sampai berjumpa lagi teman-teman Universitas Indonesia! @ Universitas Indonesia https://t.co/lwBqIb3WRS BANDNANA COVER 🍌- Bohemian Rhapsody. \n.\nbandnana_ @viollarifilla nanajanetri @oxyaryawijaya @faizarfasya @adytalasa @dwikysyahputra @ Program Pendidikan Vokasi Universitas Indonesia https://t.co/zg3OBjsEE0 Berbagi panggung dengan si bayi. @ TRANS 7 - Jakarta https://t.co/9McgzYklWf RT @TRANS7: Persiapan para pengisi acara dari @vidialdiano hingga Reza Artamevia untuk @ISA_TRANS7. Berita selengkapnya di https://t.co/OAY… Gue selalu excited setiap duduk di kursi coach, karena bakal lihat aksi panggung yang manis dengan suara renyah para kontestan seperti #RomaMalkistKejuManis, yang renyah berlapis, kejunya… https://t.co/TWIdIyTA3M Teruntuk sahabat saya yang selalu ada for the last decade. Yang selalu hadir di titik tertinggi &amp; terendah hidup saya. Yang selalu membawa senyum kehati banyak orang. Selamat bertambah… https://t.co/VuiJpLwA2C Wah kita dibilang stylist nih @ninokayam sama om @armandmaulana. Perkelahian pun berlanjut malam ini di @thevoicegtv. #TeamVidiNino mana suaranya? https://t.co/cngQYetgyA RT @netmediatama: Welcome back to @BreakoutNET!\nBocoran playlist buat kamu hari ini, ada @weareoneEXO, @HaileeSteinfeld, @DUALIPA, @selenag… I'm live streaming on @YouTube. Come watch: https://t.co/1lrzq9qXmG Sabtu bersama Vidi. Out now on my Youtube channel. https://t.co/rRjk3iutAP Status lagi sendiri, tapi malam minggu ga pernah sendirian. Swipe kiri untuk ketemu sama kencan gue semalem 👈🏻. \nApakah ada muka kalian? @ Tunjungan Plaza 3 Supermall https://t.co/3C4Xyql4IZ Curhat agak sedikit blak-blakan bareng @raffi_nagita17. It’s on Youtube now. Go check it out :) #TakSejalan #IDontMind https://t.co/SDTCXkILmC Hari ini ketemu sama adik-adik luar biasa di RSCM. Niatnya menghibur kesana, malah saya yang dapet energi luar biasa positif dari adik-adik keren ini. Semangat terus adik-adikku untuk bisa… https://t.co/DZ2t641QFT Vidi Aldiano &amp; Bandnana (bandnana_) for the all new #PROPHERE. \n.\n#CreatedWithAdidas\n#adidasIndonesia\n#adidasOriginals https://t.co/xX57UCnosS RT @netmediatama: MALAM INI!!!\n\nJangan lewatkan Konser \"Sumpah Pemuda Ke-90\" yang dimeriahkan oleh @maudyayunda @MonitaTahalea @evaceliaa @… When your Gojek didn’t arrive. @ Nusantara Polo Club https://t.co/nWYZgVo90U Akhir pekan bahagia! Salut sama semua teman-teman Bekasi yang semangat banget nyanyi, meskipun hujan-hujanan! I love you guys so much❤️ @ SMP Islam Al Azhar 8 Bekasi https://t.co/MjZs0eCkR3 Sudah hampir 10 tahun berkarir sebagai seniman. Penasaran, karya saya yang mana yang sampai saat ini menjadi favorit teman-teman disini? @ Fairmont Jakarta https://t.co/Ew6MxShBSF Happy birthday to this beautiful lady with a beautiful heart. https://t.co/klVvxepnvC Saat Mickey &amp; Mickey bertemu. Yang kokoh sebelah udah ada Minnie nya. Mana Minnie saya?\n.\nSupporting @ikat_ind x @disney for their new collaboration, premiering here in #JFW2018. @ Senayan… https://t.co/XuyBnMfVZV VLOG ASIAN PARAGAMES 2018 | #VAgoVLOG eps. 35: https://t.co/V6NG0VG8tA via @YouTube Here is a RECAP of the submissions we received for the I Don’t Mind Cover Challenge in collaboration with adidasindonesia! Thank you to all of the participants. Can’t wait to announce the… https://t.co/VcXXYGzlfb RT @BreakoutNET: #nowplaying @jevinjulian @sherylsheinafia @vidialdiano - I don’t mind https://t.co/ITI93IVRcU Sebuah kebanggaan untuk dapat mengisi closing ceremony MTQ Nasional semalam di Medan. Semoga bisa kembali lagi untuk menghibur teman-teman disini. Next, kota mana lagi ya? @ Medan, Indonesia https://t.co/rFyj1XB3Si Si girang, kembali dibuat super girang dipanggung semalam bersama teman-teman Jakarta, diacara Wardah Days @wardahbeauty. Ga percaya? Swipe kekiri. @ Gandaria City, Jakarta https://t.co/VKNRB6NlKU Um, so guys, I think I have found a new best-crazy-friend. Bikin kolaborasi seru ga yah? @Lesti_Jenong_DA https://t.co/LSrVnDDeNg Team “Song Of Victory” last night at the opening ceremony of Asian Paragames 2018. @ Gelora Bung Karno (Senayan-Jakarta-Indonesia) https://t.co/zeGtyUpEBD A moment before hitting the stage last night at the opening ceremony of Asian Paragames 2018, wrapped in @ikat_ind. Siapa yang nonton? https://t.co/XiTJYOzb5u Just a bunch of appropriately inappropriate people. https://t.co/KNpLORHm87 Kira-kira kalo #IDontMind dinyanyiin sama Memsye, gimana ya jadinya?\n-\nSegera di channel youtube nya @raffi_nagita17! https://t.co/cRpqIqQrgw Can’t wait to spend another weekend with you guys. Ada yang mau ketemu gue dibulan ini? Swipe left ya. https://t.co/3W9fiEOW0e I am so excited to announce that Sheryl, Jevin and I will be collaborating with adidasindonesia for an #IDontMind Video Cover Challenge!\n.\nTerms\n1. Upload your video rendition of… https://t.co/eo1iHr5vJ4 The reason why I love my job so much 🙏 @ Sman 71 Jakarta https://t.co/4tXWAjB9j8 VLOG baru sudah tayang, dimana saya kegirangan kedatangan Milea dilokasi shooting #IDontMind. Link sudah hadir di bio saya. Selamat menyaksikan! https://t.co/WtcYvTzCnt #RoadToAlbum eps. 3: SHOOTING SAMA MILEA? I DON'T MIND.: https://t.co/bigL0rjAUI via @YouTube I added a video to a @YouTube playlist https://t.co/bigL0rjAUI #RoadToAlbum eps. 3: SHOOTING SAMA MILEA? I DON'T MIND. They say behind every great man, is a great woman. Congratulation adek @sherylsheinafia for your big win on @amiawards last night! I’m such a proud brother! Tahun depan, #IDontMind! 🔥… https://t.co/HbyZFcWqY4 Sebuah kehormatan untuk bisa terpilih mengisi official theme song Asian Paragames 2018 berjudul “Song of Victory” bersama @maudyayunda. -\nSukseskan bersama yuk @asianpg2018 mulai 6… https://t.co/OEb1Cdurkp Jevin loves his cone. #HeDoesntMind #WeMindABit https://t.co/XXvt8lTypI Saat peluncuran video musik #IDontMind beberapa hari yang lalu. Yang udah nonton, paling favorit scene yang mana? Kalo gue, udah tau dong yang paling favorit scene yang ada siapanya itu..… https://t.co/jsnUTcHosq Im so excited to announce that I will be joining @quipper_id as #QuipperSuperTeachers bersama Febby. Selain menyalurkan passion gue untuk ngajar, gue juga happy banget bisa berkontribusi… https://t.co/IpgE0cgTGP OUT NOW! #IDontMind\n-\nHit the link on the bio! https://t.co/1tuQI66w00 Vidi Aldiano, Sheryl Sheinafia, Jevin Julian - I Don't Mind: https://t.co/X2j6gh4Cbf via @YouTube I added a video to a @YouTube playlist https://t.co/X2j6gh4Cbf Vidi Aldiano, Sheryl Sheinafia, Jevin Julian - I Don't Mind Bersama ratusan suara yang menemani malam minggu saya. Tiap weekend berasa ga sendirian karena kalian. Terima kasih!\n.\nFoto ini diambil oleh @billsatya @ SMAK Penabur Harapan Indah https://t.co/aj5tHsu5Oi Say hi to the coaches for @thevoicegtv. Coming soon, this November! #TeamVidiNino\n.\n📷: @akbarmoose https://t.co/wPAN8kT0rf Terima kasih untuk semua ‘pengharap’ diluar sana yang telah mengapresiasi karya saya yang berjudul #TakSejalan, sehingga melalui karya ini, saya kembali dinominasikan di @amiawards… https://t.co/MiEejMYGwR Asian Games nggak kerasa udah jalan lebih dari seminggu dan udah mau habis aja beberapa hari lagi.\n.\nMau nonton Closing Ceremony Asian Games? Atau mau punya Smartphone Samsung baru? \nYuk… https://t.co/FdmJcUVFDp Bangga sekali semalam dapat melihat sahabat saya @sherinasinna di film terbaru nya, @wirosablengID. Please do watch her, kickin’ some bad guys’ asses on theatre, starting tomorrow! @… https://t.co/P1aup0Q92u This is the way how I create my own spirit to enjoy the games. Now, it’s your turn. Let’s share the same spirit through capturing the energy of #AsianGames2018 #WithGalaxy\n\nGet the chance… https://t.co/XINOzX89E9 Weekend booster untuk netizen-netizen tercinta. Siapa yang udah denger #IDontMind hari ini? Komen dong kalian paling sering denger lagu ini di platform apa. @ Don't Mind https://t.co/f7jeB8GyDK I know that two are better than one when it comes to work with my fellow adidasindonesia fam, @sherylsheinafia. https://t.co/unm1RqnSMu Merayakan Idul Adha bersama wanita pejuang disamping saya ini. Selamat merayakan hari raya bersama orang-orang tercinta teman-teman! @ RSPAD Rumah Sakit Angkatan Darat Jakarta Pusat https://t.co/esrdLN0wLP Red itu merah. #IDontMind https://t.co/X2BMldIiwN Bagimu negeri, jiwa raga kami. Bersama adik-adik dari Labuan Bajo tahun lalu, saat saya dan team @puyodesserts berkolaborasi untuk mendirikan perpustakaan untuk calon pemimpin bangsa yang… https://t.co/BkMDJMzEux BELUM ADA YANG TIDUR + LAGI PUASA, DISURUH FOTO. GIMANA? | #VAgoVLOG eps. 34: https://t.co/IEbctPafGL via @YouTube Tahun ini saya absen dulu upacara di istana. Berdoa untuk Papa &amp; @vadieakbar agar diberi kelancaran di tahun ke sembilan kami diberi kepercayaan oleh negara untuk mengatur tata suara… https://t.co/wNm2xfxKxY Selamat ulang tahun untuk my baby girl who’s not baby anymore. Happy legal age babe angelpieters! https://t.co/iThlxuzjuM This is how it’s gonna be. You’ll be you, and I’ll be me.\n.\nA great collaboration with our own @FREQUENTPRO fam! Ada yang udah bisa ngikutin dance #IDontMind kita blm? @ I Dont Mind It https://t.co/CUzHPcD4rD Tag temen lo yang butuh lagu ini karena malam minggu nya sendirian aja. 😂\n.\nMalam minggu sendiri? #IDontMind @ Zona Jomblo https://t.co/LhG1g0Hpcx Guess who’s gonna be the next coach for @thevoicegtv? @ GTV - Indonesia https://t.co/3TPdJ77vtk Wahai netizen yang niscaya akan komen dibawah, “Kak, kapan nyusul?”, ini jawaban saya: #IDontMind.\n.\nCongratulation @tasyakamila @randi_bachtiar! Senang bisa menjadi bagian dari acara… https://t.co/PcVXOicsrA Malam minggu sendirian aja? #IDontMind.\n.\nMana suara netizen yang malam minggu nya bangga sendirian kayak saya? 😂☝️ https://t.co/mFQHTw3cg3 Have you heard our brand new song, #IDontMind? Hit the link on my profile to check it out.\n.\nYang sudah dengar, gimana pendapatnya?\n.\n👕: @kenzo, styled by clarestapitojo @ NET TV https://t.co/MSztgoOtFe “Gendutan lo bang”. “Banci banget sih gaya nya”. “Suara lo cempreng”. “Jomblo lo”.\n\nTerserah orang mau ngomong apa. You’ll be you &amp; I’ll be me. ‘Cause #IDontMind.\n\nDo you? @ I Dont Mind It https://t.co/nLAe2qsMwz Vidi Aldiano, Sheryl Sheinafia, Jevin Julian - I Don't Mind: https://t.co/jQEZj5KZRi via @YouTube I added a video to a @YouTube playlist https://t.co/jQEZj5KZRi Vidi Aldiano, Sheryl Sheinafia, Jevin Julian - I Don't Mind Kegiatan besok pun akan penuh untuk peluncuran lagu #IDontMind. Sampai bertemu disini besok, netizen tercinta! https://t.co/xAMCp9WhJc Anthem Netizen 2018, #IDontMind, akan rilis besok! Check lokasi radio-radionya disini. https://t.co/0LTOPLyTNn Memperkenalkan, cover single #IDontMind dengan pose yang sangat aesthetic ini. Lo bilang pose gue ngasal? Well, I don’t mind.\n.\nI DON’T MIND - VIDI, SHERYL , JEVIN\n03 August ‘18\n.\n📷:… https://t.co/cLQ55IiJ18 Single kedua. Dua hari lagi. Gimana pendapatmu netizen? #IDontMind\n.\nI DON’T MIND - VIDI, SHERYL, JEVIN\n03 August ‘18\n. @ I Dont Mind It https://t.co/jnP3wjxChM Happy birthday @jevinjulian! Dari teman-teman tertulus yang ngasih surprise bukan cuma untuk sosmed aja. #IDontMind\n.\nI DON’T MIND - VIDI, SHERYL, JEVIN\n03 August ‘18\n. @ I Dont Mind It https://t.co/PPvbl4GQLx Teruntuk netizen yang maha benar dengan segala pendapatnya, #IDontMind.\n.\nI DON’T MIND - VIDI, SHERYL, JEVIN\n03 August ‘18\n.\n@vidialdiano @sherylsheinafia @jevinjulian\n. @ I Dont Mind It https://t.co/Rj6LTDOoqm Teruntuk netizen yang bilang kalo postingan olahraga gue cuma sebatas citra. Siapa bilang? #IDontMind\n.\nI DON’T MIND - VIDI, SHERYL, JEVIN\n03 August ‘18 https://t.co/Bth0nan62v Ekspresi lo saat selesai kerja 3 jam lebih cepat dari yang dijadwalkan. Starting my week with a good vibe. How’s your day netizen? @ JUJUR, KERJA KERAS, dan KERJA CERDAS https://t.co/IceyB7FDRP Lirik lagu ini merupakan karya terjujur yang pernah saya tulis. Apa lirik favorit kalian dari lagu #TakSejalan?\n.\n🍌: @oxyaryawijaya nanajanetri stanleysalawati @viollarifilla @faizarfasya… https://t.co/jnvrBIcTV6 Campur aduk. Hari ini saya baru saja merilis lagu #TakSejalan x Bandnana 🍌di Spotify, Joox, iTunes, dan semua platform digital. Video nya juga baru saja tayang di Youtube channel saya… https://t.co/v5qMdz557B Vidi Aldiano - Tak Sejalan feat. Bandnana (4K Official Music Video): https://t.co/9jZT6Rsmhx via @YouTube Beberapa jam sebelum #TakSejalan x Bandnana 🍌rilis di platform digital.\n.\nSiapa yang excited?!\n20.07.18 https://t.co/2NgvqZj04R 20.07.18.\n\n#TakSejalan x Bandnana 🍌 https://t.co/ffneqXJ6Li Akan ada yang baru pada tanggal 20 Juli ini. Ada yang bisa tebak? #TakSejalan https://t.co/M8puy1oHlt RT @KalimayaBaskara: #NA Tak Sejalan by @vidialdiano // Berpisah Itu Mudah by @rizky_febian ft. @maudymikha on #R12KBFM RT @radioLSPR: #NP Urutan 5 di #ATALINA @vidialdiano - Tak Sejalan RT @PlayingOnMadama: Posisi 9. @vidialdiano - Tak Sejalan  #MadamaIndo20 on @madamaradio RT @FavoritRadio: @vidialdiano via Hits - Tak Sejalan berhasil naik 2 angka di #Deretan5 \n\n#IndoHIts30 Edisi 28 Kompilasi MD @elltrindade RT @KualaKencanaFM: #KualaIndo20 8 Juli | No. 12 | LW No. 15 | @vidialdiano – Tak Sejalan | #VARecords RT @MGT_RADIO: MGT Fresh #MGTHOT30 bareng @ziechandra | @vidialdiano - Tak Sejalan | VA Records | MD: @andriew RT @Iradiojakarta: #Indonesia40 #IRadioNetwork 14 Juli 2018 posisi #30 Tak Sejalan - @vidialdiano Two lads in London. @ London, United Kingdom https://t.co/kOgoX8wtpm Saat rutin lari beneran lebih indah daripada rutin lari dari kenyataan. @ Manchester, United Kingdom https://t.co/2KIMjHO53q Beberapa tahun yang lalu, saya foto didepan bangunan ini sambil melempar toga. It feels so good to be back! @ The University of Manchester https://t.co/u5txijp2Vf Cerita gue yang kayak gimana yang ingin teman-teman dengarkan di lagu baru gue? https://t.co/nmZYYxKjAn / 📷 : dionmuharom @ Hockey Astro Turf Senayan https://t.co/j0UKkwKc4h Sebuah kebanggaan untuk dapat bergabung dengan Galaxy Team bersama @nicsap @hamishdw &amp; @ringgoagus!\n.\nMore exciting project is on the way. Coming soon. https://t.co/HQetwXOr8z RT @Iradiojakarta: Selamat ya @vidialdiano untuk lebih dari 1 JUTA VIEWERS buat lagu #TakSejalan. Gak sia-sia ya mengkaryakan kegalauan :p… Lebaran dari tahun ke tahun versi keluarga gue. Tahun depan kira-kira apa yah tema nya? https://t.co/4WhHHypAXH Minal aidin walfaizin, mohon maaf tahun ini… https://t.co/di3DMLU2kT RT @Iradiojakarta: Mau tahu curahan hati @vidialdiano I-Listeners? Dengerin Tak Sejalan ya di #10lagukeren #IRadioNetwork @meryshachandra h… 🙈🙉🙊 https://t.co/LLbDUgk9QU When your shirt speaks louder than words. https://t.co/7Buo7Dulvj Drama dari pembuatan music video #TakSejalan… https://t.co/ts5ot2We2i #RoadToAlbum eps. 2: DRAMA VIDI &amp; DEVINA \"TAK SEJALAN\": https://t.co/U9Fdhh3WgY via @YouTube Sejalan &amp; bersatu dalam bermusik. https://t.co/4JMZ9yzFTb Ingin bersama denganmu selamanya. Namun nyatanya… https://t.co/vYKGVWWp3U 400 ribu lebih jiwa sudah menyaksikan musik… https://t.co/X4J9XgWlZP Versi akustik #TakSejalan bersama Band-nana… https://t.co/58PjqTyORn I added a video to a @YouTube playlist https://t.co/u79k4zeP1V Breakout Showcase - Vidi Aldiano - Tak Sejalan RT @fiestaradio_: #NP @vidialdiano - Tak Sejalan berhasil jadi #7JAMAN minggu ini. selamatttttt RT @ozradiobandung: 10. @vidialdiano - Tak Sejalan | 9. @yurayunita - Harus Bahagia | 8. @maudyayunda Ft. @teddyadhitya - We Don't #OZINDO2… RT @Kiwarifmradio: #IndoHitsTop15 No. 4 @vidialdiano - Tak Sejalan   (VA Records) RT @okezonenews: Jangan lewatkan kongkow bareng @vidialdiano hari Jumat jam 14.00. Klik https://t.co/CduCOUogzB @warungkopioke_ https://t.c… RT @samsungID: We’re glad to have done an epic collaboration with the talented @vidialdiano in his newest music video, ‘Tak Sejalan’.\n\nHave… RT @CLEARIndonesia: .@vidialdiano menyemangati penonton di Konser CLEAR Ayo Indonesia Bisa dengan kolaborasinya bersama @ekagustiwana, @git… Hari ini membawakan lagu #TakSejalan dengan extra emosional di… https://t.co/tSSLRQg3oZ Vidi Aldiano - Tak Sejalan (Official Music Video): https://t.co/ThOi9sUr3i via @YouTube RT @netmediatama: Jangan lupa untuk sakikan musik video dari @VidiAldiano \"Tak Sejalan\" perdana dan pertama kalinya di @BreakoutNET ;)\n\nDon… RT @OfficialRCTI: akan ada penampilan dari judge @vidialdiano , bakal bawain lagu apa yah?  Jangan lewatkan malam ini Pukul 21.00 WIB @offi… RT @BoyGirlBandGTV: nanti malam judge @vidialdiano siap untuk ajak kita semua untuk nyanyi bareng di stage @BoyGirlBandGTV , jadi stay teru… Introducing, @devinaureel as my muse in #TakSejalan!\n.\nBesok akan menjadi hari penting untuk semua pengharap yang selalu berharap untuk bersama dengan orang lain, namun kenyataan nya Tak selalu Sejalan. Tunggu musik videonya besok!\n.\n11.05.18 https://t.co/Rmneae3tyw Introducing, devinaureel as my muse in #TakSejalan!\n.\nBesok akan… https://t.co/EaWeQcPk4Z 2 hari menuju perilisan MV #TakSejalan. Dari kemarin udah banyak… https://t.co/Brcv3pu8Zp RT @9020FBFM: Preview New Entry @vidialdiano - Tak Sejalan #HappyIndoTeratas RT @Iradiojakarta: #Indonesia40 #IRadioNetwork 5 Mei 2018 posisi #30 Tak Sejalan - @vidialdiano RT @suaradiponegoro: Play @vidialdiano Tak Sejalan Next @DadaliOrginal Di Saat Patah Hati @ASCADA_ID Next @theweeknd Call Out My Name @Univ… RT @masdhafm: #NP\n\nAda @vidialdiano - Tak Sejalan yang berhasil naik 2 peringkat dari minggu lalu nih, Sobat Muda, dan sekarang doi menempa… 3 HARI LAGI\n#TakSejalan\n11.05.18 https://t.co/GV9mKOWg5Z 11.05.18\n#TakSejalan https://t.co/JEmzw3sGMh Segera tayang. Musik video dari #TakSejalan. Jumat, 11 Mei 2018.\n\nhttps://t.co/tjjsvciSCm https://t.co/lR0fBP9I7I Bandung never fails me! Kondisi badan gue yang drop, langsung hilang liat… https://t.co/FWuAWljuQL Selamat Hari Pendidikan Nasional! Di pesta pendidikan 2018 ini, kami bersama… https://t.co/nWZS2Uxt8n Lampung is love ❤️ @ Universitas Lampung https://t.co/k0ogmzrMZN “Tak Sejalan” sudah bisa teman-teman dengarkan di JOOX, Spotify &amp; Apple Music!\n.\nSebuah karya… https://t.co/okTiUw6a9m VLOG kolaborasi millennials sudah tayang di youtube channel gue. Yang udah nonton, absen dibawah… https://t.co/7rYRTGsS00 KOLABORASI ANAK MILLENNIALS #AyoIndonesiaBisa | #VAgoVLOG eps. 33: https://t.co/YtzIW59S6i via @YouTube I added a video to a @YouTube playlist https://t.co/YtzIW59S6i KOLABORASI ANAK MILLENNIALS #AyoIndonesiaBisa | #VAgoVLOG eps. 33 “Ingin bersama denganmu selamanya... \nNamun nyatanya kau dengannya...”\n.\n#TakSejalan https://t.co/exIC5HIrKJ RT @BoyGirlBandGTV: @vidialdiano akuin kalo penampilan #TeamBoys harmonisasinya keren banget malam ini!! #TNBGBGTV https://t.co/tt9EENipwj RT @rasifm: Mengudara Bersama @vidialdiano - Tak Sejalan [VA Record] \n#FreshMUSIC\n\nDitemani @Vitha_Dhie \nMD @rara_go19 \n#SemanggiMAGETAN cc… RT @Iradiojakarta: Salah satu mimpi @vidialdiano yang belum tercapai adalah rekaman di luar negeri. Semoga segera terealisasi yaa.. Amiinn.… RT @dutafm: ~ Tak Sejalan - @vidialdiano \ncc : VA Records\n#IndonesiaHits #TakSejalan is available on itunes!! Siapa yang udah download? https://t.co/ba3iH5ZvWX Siapa yang udh nonton Lyric Video #TakSejalan? Ada yang punya ide kira kira nanti Music Video nya seperti apa ya? Yuk boleh comment #vidies? https://t.co/sbf3G3g0It Sebuah pengingat untuk jomblo yang selalu berharap, tapi kenyataannya ga pernah bisa bersama… https://t.co/v4bWRVYYfI Kegiatan hari ini. Sampai bertemu nanti malam di HUT @hardrockfm d W&amp;S Citos! Akan bawain lagu #TakSejalan juga :) https://t.co/i7V5cNCUTL Senang sekali bisa menjadi bagian dari gerakan #AyoIndonesiaBisa bersama clearindonesia, dimana… https://t.co/Mm5GCTf8Jo 3 kata untuk single terbaru Vidi #TakSejalan? Yang belum denger bisa di streaming di @SpotifyID ya: https://t.co/hPPWO52gQX https://t.co/oWIuOXgyD2 Mama Kawa &amp; Om nya. @ Hotel Mulia Senayan, Jakarta https://t.co/rWQ5WftM6x RT @Prambors: #PramborsPlaying\n\n@vidialdiano - TAK SEJALAN\n\n#NewHitOnPrambors\n#Trending20 https://t.co/GOPZB4opyR Saat yang membuat lo bahagia, ga bisa bersama lo karena kalian #TakSejalan.\n.\nVideo lirik yang… https://t.co/WZqJCCH80k I added a video to a @YouTube playlist https://t.co/wVvlHao8T6 Vidi Aldiano - Tak Sejalan Video lirik dari single terbaru Vidi #TakSejalan, siapa yang sudah nonton? Gmn tanggapannya? Siapa yang pernah #TakSejalan sama pasangannya? https://t.co/4GgTUOJv2H Video lirik #TakSejalan yang cukup emosional menurut gue, sudah tayang!\n.\nCheck Youtube channel… https://t.co/i56yQiBCOL Single terbaru saya #TakSejalan sudah bisa didengerkan di @JOOX_ID, dengan link berikut: https://t.co/tXWMtxQMkn https://t.co/KErlMrDLcC Vidi Aldiano - Tak Sejalan: https://t.co/wVvlHao8T6 via @YouTube #TAKSEJALAN\n\nStream my newest single on JOOX, Spotify &amp; Apple Music!\n\nYang udah denger, mana suaranya! https://t.co/s4Fnbxh8N0 #TakSejalan akhirnya rilis juga hari ini.\n.\nStream this song via JOOX, Spotify &amp; Apple Music!… https://t.co/fUTK51EljR The day! #TakSejalan https://t.co/jlC4N4JEXN Sebuah cerita singkat tentang #TakSejalan.\n.\nBesok, 13 April 2018. https://t.co/kJnmJ9aKS4 Saat harapan hanya menjadi harapan saja. Kadang apa yang kita harapkan, tak sejalan dengan… https://t.co/WUXKsPAdXD 3 hari lagi. Siapa yang ga sabar?\n.\n #TakSejalan https://t.co/QXrwtmcATK Sepenggal lirik dari lagu terbaru saya yang akan rilis tanggal 13 April 2018. Ada yang bisa… https://t.co/2eOr2oNfis Makan malam merayakan ulang tahun saya, bersama orang-orang yang paling gue sayang dan jarang… https://t.co/PvReLTW9dO VLOG #RoadToAlbum eps. 1 sudah tayang!\n.\nBanyak drama dipembuatan lagu pertama dari upcoming… https://t.co/iqMbceiTFH #RoadToAlbum eps.1 : TAK SEJALAN: https://t.co/9x37ECuGt0 via @YouTube Sebuah kado spesial untuk orang-orang paling berjasa diperjalanan karir saya. Selamat ulang… https://t.co/YlwwnUaq5d Vidi mau sharing nih ttg dunia entrepreneurship yang Vidi jalanin, yuk caranyaL https://t.co/Quh5oSxbxm atau langsung aja hubungi *500*288# dari no. Telkomsel mu @simPATI #simPATIpreneur https://t.co/QSHr31KKAN Merayakan hari ulang tahun bersama mbak @dualipa &amp; babang @brunomars! Swipe left for more… https://t.co/vklWPv890t Happy birthday juga adiknya #HBD28thVIDIALDIANO https://t.co/0tIxk0lRiJ RT @Syifa_aulianiss: Happy birthday @vidialdiano doanya sukses terus lah pokoknya, semoga bisa ketemu terus, jd gini, masih twitter party g… Terima kasih #HBD28thVIDIALDIANO https://t.co/nIIrdoQlBE Alhamdulillah, makasih ya, salam untuk semua nya #HBD28thVIDIALDIANO https://t.co/aNBjkB5pNi Haha begadang berkarya kok, terima kasih ya #HBD28thVIDIALDIANO https://t.co/4tXEcpIOpA Makasih ya #HBD28thVIDIALDIANO https://t.co/z63A64SOOa Pasti semangat terus dong! #HBD28thVIDIALDIANO https://t.co/PNL0EsCzdj Wah keren, soon dong! #HBD28thVIDIALDIANO https://t.co/qOpNV0TqSP Amin, terima kasih doanya #HBD28thVIDIALDIANO https://t.co/tcUliMQnDK Aminnn #HBD28thVIDIALDIANO https://t.co/65cYMtAkTc Nice! Makasih yaaa #HBD28thVIDIALDIANO https://t.co/9UCe7FjlKt Thank you so much! #HBD28thVIDIALDIANO https://t.co/6aRC2TqWgE Haha Amin aja deh, makasih yaaa #HBD28thVIDIALDIANO https://t.co/8IkZeHU939 Haha Amin, makasih yaaa #HBD28thVIDIALDIANO https://t.co/QaDyVyTyLG Sedang berjalan nih prosesnya, amin makasih ya #HBD28thVIDIALDIANO https://t.co/W7bubHu5HC Amin, terima kasih ya #HBD28thVIDIALDIANO https://t.co/MzROfAFtP0 Yuk! #HBD28thVIDIALDIANO https://t.co/EbRDCibSrU Terima kasih teman2 di Twitter, ucapan dan doanya, twitter party gak nih kita? Yuk pake hashtag #HBD28thVIDIALDIANO, go! Tahun ini merayakan ulang tahun di negeri orang. Hari ini terbangun dengan perasaan sedih karena… https://t.co/1vPboqmtiS Liburan keluarga bersama kesekian kalinya, dengan sahabat gue, @dyooy.\n.\nTag sahabat kamu yang… https://t.co/Qwlin2gv2I Enaknya liburan sendiri dikelilingi orang-orang yang pacaran. Yang lain foto sama pasangannya,… https://t.co/tXzttUpkQW Been working out with my trainer marettoaufra pretty hard these past few weeks, and I’ve seen… https://t.co/GGzMNcrowS A big congrats to my buddy @petra_sihombing &amp; @aquilafirrina! Di foto ini elo yang paling muda,… https://t.co/agIoQUynn9 Foto terlangka, bersama sang bapak manager bibitmu yang membuat gue selalu fokus dalam mengejar… https://t.co/zDa7DmWpVS Sebutin 3 kata yang terlintas di pikiran kamu, saat sehabis nonton video clip #Terbenar? Hayo apaa, #vidies? https://t.co/u6tSrbZZrU Minding my own business.\n.\n#PROPHERE #adidasOriginals #AdidasIndonesia https://t.co/hgo04vAJrr Selamat Hari Musik Nasional! Throwback ke salah satu lagu yang membawa nama saya untuk pertama… https://t.co/y0I5acUJj7 Finesse - @vidialdiano @gamal1990 @ninokayam @roxieve \n.\nSebuah persembahan lagi dari kami,… https://t.co/YFtvpCApXw Memulai hari dengan olahraga. Setelah ini akan kembali menjadi juri di  @BoyGirlBandGTV pukul 19.15 WIB. Episode 2! Who's rooting for #TeamGirls? https://t.co/UOa4qlTwFI Haha semakin banyak followers Instagram barunya mama Vidi, siapa yang sudah follow? Upload apa lagi ya kira kira ada ide?\n https://t.co/Ov1vZCnyXI Di @JOOX_ID single terbaru Vidi #Terbenar bisa kamu dengerin di album #PERSONA ya: https://t.co/srnsAIbMWK ini #VAgoVlog waktu Vidi lagi di L.A dan....kelaperan! Silahkan dicek: https://t.co/GrvBrJFQZy I’ve been seeing some real progress on my 21 days challenge with adidasindonesia.\n.\nI’m… https://t.co/ikzkBDe5wp Siapa disini yang dengerin lagu pake @SpotifyID? Dengerin #Terbenar di link ini ya:  https://t.co/pmbvq8iRaD Alhamdulillah sambutan lagu &amp; video klip #Terbenar masih sangat baik setelah 5 bulan dari rilis, check it out here guys: https://t.co/u6tSrbZZrU Happy weekend #vidies? Sudah pada nonton #VAgoVlog terbaru Vidi belum? klik link berikut: https://t.co/9ouAtFAwKo RT @dahSyatMusik: #TNBGBGTV tahun ini judges #TeamGirls  @gamal1990 @melly_goeslaw @vidialdiano yakin bisa merebut predikat ‘pemenang’ dari… Sebuah kehormatan untuk menjadi juri baru di #TNBGBGTV season 2! Siapa yang sekarang lagi nonton?! Comment yuk! https://t.co/aTkuuxL0vg RT @BoyGirlBandGTV: #TNBGBGTV tahun ini judges #TeamGirls  @gamal1990 @melly_goeslaw @vidialdiano yakin bisa merebut predikat ‘pemenang’ da… VLOG baru sudah tayang. Gue ketemu si Salt Bae di hari soft opening restaurant Nusret, di New… https://t.co/gZu2CMA1Tm BEGINI ISI RESTAURANT SALT BAE? | #VAgoVLOG eps. 32: https://t.co/EoMHFVspq6 via @YouTube Sukabumi, 24 Februari 2018. @ Smas Insan Cendekia  Al Kausar https://t.co/VcjJ9P6V8i Hari ini, Princess Syahrini kw 4 ulang tahun!! Doakan semoga Mama semakin lucu, sehat, ga minta… https://t.co/ZH0K60oP4q New VLOG is up people! Yang mau tau kenapa gue bisa gain 4 kg waktu di Los Angeles, ini… https://t.co/bifRtZcn71 HUNGRY TOURIST IN L.A. | #VAgoVLOG eps. 31: https://t.co/yA4Bqy3t9c via @YouTube Happy Chinese New Year!! https://t.co/1eblV510WO Resolusi tahun 2018, salah satunya harus hidup sehat. And I’m ready to deliver! Excited to write… https://t.co/FmqhwaPb3s Sangat bangga dengan wanita yang satu ini. Alhamdulillah kita diberi kelancaran tour 3 kota… https://t.co/HtM6cY6dlc So glad to be on another campaign with adidasindonesia. Introducing #adicolor for our new theme… https://t.co/wvpisDv5Ho RT @simPATI: Selanjutnya ada @vidialdiano yang bagi-bagi tips bikin anak-anak muda Indonesia makin kreatif di #simPATiCPC18 yeay! https://t… VLOG baru akhirnya tayang! Rencana rahasia gue &amp; putri_tanjung ditahun 2018 akhirnya terungkap… https://t.co/fLbMKyIbaZ RAHASIA TERBONGKAR! | #VAgoVLOG eps. 30: https://t.co/6UOeurBXUm via @YouTube Exploring NYC for a whole week with my baby girl. Can’t wait for our next impromptu adventure! @… https://t.co/oDLNPwbmW2 RT @simPATI: Penasaran kan gimana cara @vidialdiano membantu anak muda Indonesia jadi lebih kreatif? Yuk datang ke #simPATICPC18 tanggal 28… Berkelana di New York bersama si anak gembala @tasyakamila. @ New York, New York https://t.co/MlmPtC5vWl Drippin’ in finesse. It don’t make no sense.\n.\n📷: @richo_kyle87 @ Pike Place Market https://t.co/bKnxRl8q1o RT @DiginationID: Penyanyi @vidialdiano bikin startup digital \"Krowd\"! Layanan  yang pertemukan &amp; menjembatani para kreator Indonesia untuk… RT @Iradiojakarta: Selamat! buat @vidialdiano selaku Founder &amp; CEO KROWD, sebuah Platform yg dibuat bersama timnya untuk menjembatani karya… RT @hitsssdotcom: @vidialdiano launching platform kolaborasi online, KROWD. Klik -- https://t.co/k6rf8928tM https://t.co/1nWtWdyncZ Yansen Kamto (@yansenkamto) sebagai Chief Partnership Officer (CPO) di KROWD krowd.id\n•\nBapak… https://t.co/M8BxkfWWRY RT @NajelaaShihab: Teknologi adalah solusi perubahan pendidikan. Senang kolaborasi di @krowd.id. Platformnya kereen @vidialdiano Putri Tanj… RT @selebrita7: Lebarkan karirnya, .@vidialdiano bekerja sama dengan @putri_tanjung menjadi creativepreneur. https://t.co/lEFteC0gwx RT @TRANS7: Lebarkan karirnya, .@vidialdiano bekerja sama dengan @putri_tanjung menjadi creativepreneur. @selebrita7 https://t.co/mENJ3l1sW4 Team KROWD! Hari ini, kami bertiga resmi mengeluarkan platform kolaborasi pertama di Indonesia,… https://t.co/dRa9yuHvY2 RT @recapdotid: Mengenali tokoh di paling kiri?\nBenar, beliau adalah @vidialdiano , penggagas platform KROWD.\nVidi menjelaskan latar belaka… This is the day!\n\nKROWD (krowd.id) akan dirilis hari ini! Sebuah platform yang akan menjembatani… https://t.co/U1uvRsrdkm Bismillahirohmanirohim, 10 JANUARI 2018, InshaAllah start-up Vidi akan launching, platform… https://t.co/lMru9KrtXJ Merangkum 12 lagu paling hits selama tahun 2017, dalam waktu 4 menit! Semuanya ada di Youtube… https://t.co/kxuUTwXMVJ RT @benjaminkheng: 🇲🇨🇸🇬 UNCH UNCH\n@vidialdiano and I did the millennial thing and mashed up all the 2017 hits by the month. \n\ncheck it out… I added a video to a @YouTube playlist https://t.co/eH44o4Bfmn 2017 BILLBOARD HITS MASHUP - Feat. Benjamin Kheng 2017 BILLBOARD HITS MASHUP - Feat. Benjamin Kheng: https://t.co/eH44o4Bfmn via @YouTube My new collaboration with @benjaminkheng, singing 2017’s Billboard Top Hits is on my Youtube… https://t.co/vKedxiPh0y 10 menit lagi akan tayang video mashup hits 2017 di https://t.co/egcl5vPEGE !! Gabungin 12 lagu hits selama tahun 2017. Stay tuned guys!! RT @Prambors: Nih #Np @vidialdiano - Terbenar | #DGITMbarengVIDI RT @Prambors: Kawula muda mention 3 kata bebas buat dibikinin lagu sama @vidialdiano ! kata-katanya adalah_______?\n\ntweet ke Prambors pake… RT @Prambors: Selamat pagi semuanya!\n\nYuk Mangkal di #DGITM sama @missdongdong @kennydjafar @iqbaltwkkl @andyelsefeels sampai jam 10 nanti!… GOOD MORNING! Sudah hadir di @Prambors untuk menemani kalian sampai jam 10 pagi nanti! Cus stay tuned! RT @Prambors: Si @vidialdiano pernah ajak nyokapnya nonton acara disko lho!\n\nEh Kawula muda lo pernah paling gokil, ngajak pergi nyokap lo… Sudah berada distudio @Prambors! Akan menemani kawula muda sampai jam 10 pagi nanti! Yang mau request, curhat atau apapun, sok atuh mention kita! #DGITM https://t.co/XDTFNvXIZf Kembali ke Jakarta! Besok pagi akan siaran di @Prambors untuk 2 hari. Sampai bertemu diudara besok pagi kawan! https://t.co/gyzvm62wVP RT @Prambors: Kawula muda! Jangan lupa, besok dengerin Gina @missdongdong siaran bareng Vidi Aldiano @vidialdiano di #DGITM ya dari jam 6-1… Celebrating new year with some badass looks! Beruntung sekali bisa menghabiskan malam tahun baru… https://t.co/xU8UMDJ7f8 Persiapan untuk manggung terakhir di 2017!\n•\nBanyak hal yang harus saya syukuri di tahun yang… https://t.co/cEB7CD3ylQ Reunited with my Diva last night. @ Jember https://t.co/QylQiHpKhE IBU JAMAN NOW | #VAgoVLOG eps. 29: https://t.co/un7kPsVjPk via @YouTube Menutup kegiatan saya selama 3 hari di Surabaya bersama para pahlawan ekonomi setempat! Terima… https://t.co/k66hjE7dSg VLOG terbaru sudah tayang : Pergi ke DWP bareng nyokap! Go check it out!\n•\nPs: she loves… https://t.co/Rd6KjaxqZp AJAK MAMA KE DWP | #VAgoVLOG eps. 28: https://t.co/zk6WISQ9LW via @YouTube Siang ini akan meresmikan store kedua Vidi Vini Vici, di Stasiun Gubeng Surabaya 14.00 WIB. \n\nSEE YOU THERE KAWAN! Glad to be a part of the newest campaign from @adidasoriginals. Introducing a new member of the… https://t.co/Tppk609Aid Senang sekali bisa sharing krowd.id di acara #RoadToAsianGames2018 di unnes_semarang!\n•\nTerima… https://t.co/8W9qj5vNMy I added a video to a @YouTube playlist https://t.co/dS4yDCWe7v CURHAT DONG BUN! | #VAgoVLOG eps. 27 (feat. Maia Estianty &amp; Meichan) Pagi ini akan menemani pagi teman-teman di @979FeMaleRadio! Stay tuned yuk guys! #TERBENAR? CURHAT DONG BUN! | #VAgoVLOG eps. 27 (feat. Maia Estianty &amp; Meichan): https://t.co/dS4yDCWe7v via @YouTube RT @ninasapphira: Selamat #9thVidiBerkarya dear @vidialdiano! Semoga selalu bersinar dan tetap menjadi Vidi yang super baik sama #vidies ny… RT @fakevernon17: #9thVidiBerkarya Kini terasa sungguh semakin engkau jauh semakin terasa dekat @VidiAldiano Wow trending topic #1! Thank you for the support thank you for the prayers! Love you guys so much! #9thVidiBerkarya https://t.co/8iwTDD8qcY Hahaha tahun berapa nih ya? #9thVidiBerkarya https://t.co/nn0vyLyTIN Thank you @Prambors selalu support karir gue! Love ya! #9thVidiBerkarya #SunsetTrip https://t.co/ccsmcFt9r8 Setiap tahun, bulan, hari, detik berkesan #9thVidiBerkarya https://t.co/zEt5ztkrPu Inget banget dong, nice pick! #9thVidiBerkarya https://t.co/SU9GfGIUvV RT @sasasyafira: @vidialdiano Status Palsu ! pas awal denger lgsg suka\nAh iya, inget bgt ‘Status Palsu’ jawaban kuis tebak lagu yg dulu dia… Terima kasih ya #9thVidiBerkarya https://t.co/hVBkohg1ak RT @umi3_miumi: kayaknya emang @vidialdiano prince inspirasi dan semangat bagi vidies, inget tahun lalu udh down karna rangkain elektro yg… Thank you for the support yaa #9thVidiBerkarya https://t.co/nDuStd9Bd7 Thank youuu #9thVidiBerkarya https://t.co/0mGR4szIhT RT @Fitriyuningsihh: hampir semua lagu di album ka @vidialdiano suka semua!! 💃💃💃🙌🙌 #9thVidiBerkaeya https://t.co/eiwwWNnnKn Masih banyak goals yang belum tecapai, minta doanya yaa #9thVidiBerkarya https://t.co/q6heqCYksQ RT @xrkdou: #9thVidiBerkarya kayaknya baru kemaren liat alex di stereo, kayaknya baru kemaren liat sg @vidialdiano lagi selametan 8 tahun b… Wah thank you, nantikan yaa #9thVidiBerkarya https://t.co/txe3fYL4Wm Nice, baper yaaa #9thVidiBerkarya https://t.co/xpBnZFpsJJ Waah terharu, goodluck ya sidangnya #9thVidiBerkarya https://t.co/BAJjDmKNDE Niceeee #9thVidiBerkarya https://t.co/5G07o13bOO Amin InsyAllah, thank you ya #9thVidiBerkarya https://t.co/MysgV860AG Hai Makassar, see you soon! #9thVidiBerkarya https://t.co/GOaajQZREV RT @umi3_miumi: dari #9thVidiBerkarya lagu favorit semua kak, kenapa nya karna semua punya cerita dan makna apalagi #DefinisiBahagia yg pia… Nice pick! #9thVidiBerkarya https://t.co/XGP8lhSuY1 Wah inget, thank you ya #9thVidiBerkarya https://t.co/Ai2e0TenXE Thank you #9thVidiBerkarya https://t.co/mOBhfJ46yR Yes yes the power of #Vidies! Lanjutkan #9thVidiBerkarya https://t.co/onNIEIzS4y Nice idea, seru sih ya #9thVidiBerkarya https://t.co/SgYZXLhltZ Dalam sejarah #9thVidiBerkarya, apa lagu favorit kamu? Dan kenapa? #9thVidiBerkarya Alhamdulillah enggak sug, selalu semangat berkarya #9thVidiBerkarya https://t.co/Ah5EBASbz7 Wah pada gak sabar konser ya, Vidi pun gak sabar, nantikan ya! #9thVidiBerkarya https://t.co/PbNxRrmxjZ RT @chhacaa: @vidialdiano Gak kerasa udah selama ini ngefans sama ka vidi, semoga selalu menjadi inspirasi banyak orang ya ka #9thVidiBerka… Wah serius? Boleh dong! Semangat ya skripsinya #9thVidiBerkarya https://t.co/roiJQY5OD4 Love you so much! #9thVidiBerkarya https://t.co/2xa2RwTb6I Fokus sama goal, dan semangat terus mengejar goal tersebut! #9thVidiBerkarya https://t.co/NQtto6uIS7 RT @umi3_miumi: the power of #vidies karna kita lagi happy udah siapin jari buat ketuk ketik #9thVidiBerkarya @vidialdiano https://t.co/tE0… Amin, semangat! #9thVidiBerkarya https://t.co/m2pcwY9SYX The endless support, priceless #9thVidiBerkarya https://t.co/pLmnyEqX4F Coming soon! Doakan yaa #9thVidiBerkarya https://t.co/gQdCIY2Thc My pleasure, thank you! #9thVidiBerkarya https://t.co/DtN2zCJt1j Wuih udah trending topic aja! The power of #Vidies! Mari lanjutkan! #9thVidiBerkarya https://t.co/SBr5SkABo6 Terima kasih, ditunggu ya Purwokerto! #9thVidiBerkarya https://t.co/Gp8FgFPuo1 Yes, time flies! #9thVidiBerkarya https://t.co/iZQmOevkeh Semangat UTS nya! #9thVidiBerkarya https://t.co/k6A6AT2BOe RT @FYAR_Fy: Semoga kak @vidialdiano terus jdi inspirasi anak2 ZAMAN NOW yaaa 😂😂😂 #9thVidiBerkarya Amin, doakan selalu ya #9thVidiBerkarya https://t.co/XVZMm9G1Eu RT @FYAR_Fy: #9ThVidiBerkarya wiihh udh 9th aja yaaa, pastinya selalu di tunggu karya2 terbarunya dr kak @vidialdiano Wah terharu, amin amin, siap akan selau berkaryaa InsyAllah! #9thVidiBerkarya https://t.co/kTxmoAIuHS Thank you, and yes semangat semua! #9thVidiBerkarya https://t.co/cTqrli51zp Hahahaha those memorable days! #9thVidiBerkarya https://t.co/ty5QVLarM9 RT @vidiespalembang: sebagian foto-foto @vidialdiano dengan #vidiespalembang . We love you vid ❤️ #9thVidiBerkarya https://t.co/TyzzM27Wu5 Oh my God! Iya inget masa masa ini, amin, makasih yaaa #9thVidiBerkarya https://t.co/ih1gqyNibo Amin ya Allah, semoga bisa terus menginspirasi, semangat! #9thVidiBerkarya https://t.co/bGifkiFB5r Doakan ya, soom pokoknya soon! #9thVidiBerkarya https://t.co/jSr2gLbDbn Haha kita semua bersaudaraaa. Thank you! #9thVidiBerkarya https://t.co/vbuLEsyc2n Amin, makasih ya #9thVidiBerkarya https://t.co/sRV6Jnhc4S Haha evolusi ya, thank you Bogor! #9thVidiBerkarya https://t.co/ALcpl3zJgD Iyaaa, udah 9 tahun banget! #9thVidiBerkarya https://t.co/Y2PqcB6oF1 Hai Palembang! Thank you for the support ya #9thVidiBerkarya https://t.co/e1CqJnc3E8 Hamdallah happy, amin, thanks for the support! #9thVidiBerkarya https://t.co/ILJMMyyKdv Amin, doakan yaaa #9thVidiBerkarya https://t.co/t17wjyKq9Q Twitter #9thVidiBerkarya party dimulai!  Bersyukur sekali sudah 9 thn berkarya di dunia musik Indonesia. First of all, how do you feel, #vidies? Alhamdulillah hari ini tepat, anniversary 9 tahun Vidi berkarya di dunia musik Indonesia. #vidies jam 18.00 WIB kita twitter party yuk pake hashtag #9thVidiBerkarya, yes? Sending our loves to Bunga from Indonesia! Go #MissUniverse #Indonesia !!\n\nRT this!! I added a video to a @YouTube playlist https://t.co/uXo4oKXI19 Maroon5 - What Lovers Do (Cover by Vidi Aldiano, Sheila Dara, Boy ITS UP! Cover terbaru Vidi Aldiano feat. Sheila Dara &amp; Boy William sudah bisa teman-teman simak disini https://t.co/Ys0k3cGvrw Maroon5 - What Lovers Do (Cover by Vidi Aldiano, Sheila Dara, Boy William): https://t.co/uXo4oKXI19 via @YouTube Video baru! Cover lagu Maroon 5 feat. SZA bersama Sheila Dara &amp; Boy William. Go check it out! https://t.co/LEY6eNmcb3 RT @OZRadioJakarta: OZzers, buat lo yang penasaran sama acoustic performance dari @vidialdiano beberapa waktu lalu di #OZOTW, langsung cek… Next stop, @WomanRadio943FM! Yuk yang mau nanya seputar single #TERBENAR silahkan sekarang yuk. https://t.co/en5T1t26Oi RT @Iradiojakarta: Siang hari ini @vidialdiano juga berkesempatan membawakan lagunya yang berjudul “Definisi Bahagia” di #SatuJamBersama #I… RT @Iradiojakarta: Gara-gara kalah main game Terbenar sama @Sinta_ir, Vidi harus menjalankan hukuman yaitu ngerap. Penasaran gimana kalau @… Sedang berada di @Iradiojakarta nih untuk promo lagu #TERBENAR. Yang mau nanya dan dijawab on air, gue tunggu pertanyaannya skrg ya! https://t.co/SPzirXpxHg RT @Iradiojakarta: Kangen mendengarkan suara Vidi Aldiano di IRADIO? Dengarkan saja obrolan menariknya juga single terbarunya secara LIVE d… RT @netmediatama: Abis makan siang jangan ngantuk dong, mending lanjut kerja sambil nikmatin playlist @BreakoutNET !\n\nAda Dewa @sayHIVI @vi… RT @hardrockfm: buat hard rockers yang mau nanya-nanya sama @vidialdiano tentang single \"Terbenar\" atau lainnya langsung whatsapp 081187608… RT @CosmopolitanFM: 90.4 Jumat pagi jadi semangat karena ada @vidialdiano yang sudah ngobrol seru bersama @iwetramadhan dan @novitaangie di… RT @okezonenews: Saksikan Live Streaming Kongkow bersama @vidialdiano, Jumat 17 November 2017 pukul 15:00 WIB klik: https://t.co/446FFl4w9V… RT @OZRadioJakarta: OZzers, stay tuned terus di #OZOTW ya karena sore ini kita bakal ngobrol-ngobrol bareng @vidialdiano tentang single ter… RT @MeTubeID: Saksikan penampilan @vidialdiano di program ENCORE SEKARANG dengan live streaming di meTube.id. Klik: https://t.co/qNc6998RnM… RT @bimantararadio: Np @vidialdiano - Terbenar\n      @NiallOfficial - Too Much To Ask\n      @taylorswift13 - Call It What You Want\n#TnT #Ra… RT @RakaFMBandung: #Posisi10 #10TanggaNadaIndonesiaPilihan Terbenar ~ @vidialdiano | on 98,8 Raka FM Bandung | MD @hadyadoens | https://t.c… RT @VRadioFM: Stay tuned! Sebentar lagi akan ada @vidialdiano di #SKJ1066 https://t.co/MUZNwdkZCt RT @STARADIO1073: #NowPlaying @vidialdiano - Terbenar | next | @MaliqMusic - Bagaimana Kutahu. Enjoy! #PortalIndonesia RT @bahanafmjkt: Nomor 15 @vidialdiano - Terbenar, #IndonesiaTop20 w/ @rayicendana RT @MNCupdate: Tonton deh serunya kongkow bareng @vidialdiano https://t.co/uC5mFoaM8R https://t.co/E7jdEkGt9G RT @CosmopolitanFM: Good morning, Cosmoners! Jangan ketinggalan New Breakfast Club karena @novitaangie dan @iwetramadhan akan ditemani oleh… RT @bahanafmjkt: Nomor 7 @vidialdiano - Terbenar, #IndonesiaTop20 w/ @rayicendana RT @Cassanova102FM: #NP @tulusm - Manusia Kuat | @vidialdiano - Terbenar #FUNKYMORNING w/ DJ 3007 @adeyuliadewi &amp; DJ @antonw118 RT @RakaFMBandung: #Posisi10 #10TanggaNadaIndonesiaPilihan Terbenar ~ @vidialdiano | on 98,8 Raka FM Bandung | MD @hadyadoens | https://t.c… RT @ardanradio: Now Playing\n• @vidialdiano - terbenar\n#ARDANESIA w/ @eizaARDAN \n\nCumaDiArdan https://t.co/xcS66cQ8XA Vidi pulang kampung!\n•\nMerayakan malam minggu semalam bersama teman-teman di Padang. Ini malam… https://t.co/f5avguM3IN RT @RakaFMBandung: #Posisi10 #10TanggaNadaIndonesiaPilihan Terbenar ~ @vidialdiano | on 98,8 Raka FM Bandung | MD @hadyadoens | https://t.c… RT @bahanafmjkt: Nomor 3 @vidialdiano - Terbenar, #IndonesiaTop20 w/ @rayicendana RT @bahanafmjkt: Nomor 11 @vidialdiano - Terbenar, #IndonesiaTop20 w/ @rayicendana RT @ardanradio: Now Playing!\n@rocket_rockers - Ingin Hilang Ingatan\n\nNext!\n@vidialdiano - Terbenar\n\nOn RIAUW Rikues Layauw!\n#CumaDiArdan RT @DMS_AMBON: Rainbow - @Sia on #FreshMusic and next, Terbenar - @vidialdiano RT @Cassanova102FM: #NP @vidialdiano - Terbenar #warawiri w/ @nadyapuspa307 RT @Iradiojakarta: #Indonesia40 #IRadioNetwork 6 - 10 November #11. (18) Terbenar - 3 minggu di chart cc @vidialdiano Seneng banget hari ini ditonton sama Pak Rudiantara dari awal sampai habis! Bahkan beliau mau… https://t.co/Ntkp2xbqdp A wefie is a must to capture this beautiful crowd that we had earlier this morning! Thank you… https://t.co/wmjS4FGLPZ Berbagi cinta bersama netizen baik di CFD pagi ini. #siberkreasi\n•\nAda muka kalian kah di video… https://t.co/XpQXZr0dMR I added a video to a @YouTube playlist https://t.co/BUFyiYC6nq REUNI STATUS PALSU | #VAgoVLOG eps. 26 (feat. Fitrop) Thank you SMAK 4 Penabur! https://t.co/NFM5heMicj VLOG REUNI STATUS PALSU is ON!!\n@fitrop \n\nhttps://t.co/3lXk6N1dJC https://t.co/fY9t42eelR Hari ini akan menuju ke Semarang! Sampai bertemu di UTC Hotel sore ini diacara KMDGI kawan! https://t.co/0XAN54w6D5 Ready to be productive again on November! Check out my November’s scheds here! #TERBENAR?\n\nhttps://t.co/PMQqw4bBa9 https://t.co/d3Ifm7DnYk Saat bernyanyi bersama penonton di tiap manggung gue, gue selalu abadikan momen seru dengan… https://t.co/A15ftFeGlR RT @pro2bdg: #NP @vidialdiano - Terbenar\n\n#Baper \n#BangunPagiDengerinPro2\n#WilujeungMorningGaes RT @ADSRadioFM: Jawarapop indonesia ka 14 #np - vidi aldiano @vidialdiano - Terbenar - @VaRecordsJRatt - cc md @dang_citra RT @ozradiobandung: no.14 di #OZINDO21 ada @vidialdiano - Terbenar :) RT @JRadio917FM: #Posisi03 di #INDO20 edisi ke 43 --&gt; @vidialdiano ~ Terbenar | VA Management | Host: @sayakhsa | MD: @Egha_Aulia RT @ardanradio: 2.\n@vidialdiano - Terbenar\n3.\n@gloriajessicaID - I Just Wanna Love You\n4.\n@DMASIV - Tak Punya Nyali\nArdan Persada 7 Lagi Ed… RT @RMI_Fm: 8 - @vidialdiano sukses melaju 7 peringkat keposisi #8 Minggu ini dg TERBENAR #30IndoHitz: RT @adriDahlia: @vidialdiano visit @1015dahliafm untuk single #terbenar\n\nVideonya bisa ditonton di youtube channel 1015DAHLIAFM\nLike &amp; subs… RT @Cassanova102FM: #21 @vidialdiano - Terbenar (#POSTER 44th Edt w/ DJ 1212 @mahaputri1212 as ur Host &amp; 137 @joe_cassanovafm as our comp&amp;M… RT @KisiFmBogor: #np @vidialdiano - TERBENAR #MusiKisi bareng @celamonicaa sampai jam 2 siang nanti | https://t.co/RobM4UTp6G RT @StarRadioPDG: Posisi 21 #25JagoanKITA hari ini ada @vidialdiano - Terbenar, dari VA Record, peak #21 WoC: 1 https://t.co/EEIz8gtXDs w/@… Keseruan Halloween semalam ketika saya menjadi “Pembajak CD BCL”, mengangkat tema anti… https://t.co/lPwJQxkDVO #TERBENAR? bersama teman-teman Al-Azhar Pusat!\n•\nhttps://t.co/PMQqw4tcyJ\nLink on bio https://t.co/uT7tONp2MZ RT @Cassanova102FM: #NP @vidialdiano - Terbenar | @payungteduh - Akad #WARAWIRI w/ DJ 3007 @adeyuliadewi RT @radiotelstar: #Np @Cempaka_Apsella - Suara hati || @vidialdiano - Terbenar || Next @agnezmo - Sebuah rasa #IndokuIndomu RT @Iradiojakarta: #Indonesia40 #IRadioNetwork 23 - 27 Oktoberr #30. (BARU) Terbenar - 1 minggu di chart cc @vidialdiano RT @Flamboyanradio: special opening song on #flamboyanesia @vidialdiano with TERBENAR. \nlet's sing it 🎤🎤 RT @KARDOPAFM: #np ; @vidialdiano - Terbenar #BursaHitsIndonesia RT @radiodcs: #simak\n&gt;@vidialdiano #Terbenar\n&gt;@LCVirgoun #Bukti \n#DCSHits @ALiMEnaL_ @igunMD RT @986topfm: #NowPlaying On #MP3 \n@vidialdiano - Terbenar\nCc #VARecord\nw/ @utari_taslim  \nMD @prampermana986 \n\n#TopFMRadio RT @bahanafmjkt: Now Playing @vidialdiano - Terbenar , #IndonesiaTop20 w/ @rayicendana RT @pro2bdg: #NP @vidialdiano - Terbenar | @jasonderulo - If I'm Lucky\n\n#BAPER #MorningShow w/ @shen_dee RT @iradioBJM: #ONAIR @vidialdiano - Terbenar (VA) #Sorelam #100PersenMusikIndonesia #10LaguBaruKeren RT @netmediatama: Terbenar by @vidialdiano\n\nMatiin TV nya sekarang kuy! @TheComment_NET https://t.co/XmOn4VGLa1 See you guys! https://t.co/1AaMnh0PEX Tinggal satu kota, tapi berasa LDR. Gue libur, dia kerja. Gue kerja, dia libur😭\n•\nAda yang… https://t.co/djJ7oTscvs RT @MGT_RADIO: MGT Fresh #MGTHOT30 bareng @ziechandra | @vidialdiano - Terbenar | VA Record | MD: @andriew RT @mmtcradiojogja: #NP @vidialdiano - Terbenar (12) #TOPCHART selamat akhirnya ada di posisi 12 naik 2 peringkat dari minggu lalu #OKE RT @rasifm: #NeXt &gt;&gt; #INDOREQUEST Special #MalminG\nHadirkan @vidialdiano Terbenar #VAREcords\n\nw/ @edhe_luna MD @rara_go19 RT @RMI_Fm: 15 - @vidialdiano melesat keposisi #15 dg TERBENAR #30IndoHitz: RT @Cassanova102FM: #23 @vidialdiano - Terbenar [#POSTER] 43th edt w/ DJ 1212 @mahaputri1212 as ur Host &amp; 137 as comp&amp;MD @joe_cassanovafm Wah lagu baru nih..perasaan ga punya lagu judul itu hahaha https://t.co/5eK4WRDwid RT @ardanradio: 4.\n@vidialdiano - Terbenar\n\n5.\n@gloriajessicaID - I Just Wanna Love You\n\nArdan Persada 7 Lagi ed 351\n#CumaDiArdan RT @athasoemarko: Merayakan tahun pertamanya Falisha. Selamat, anak manis! Semoga kehadiranmu membawa cahaya dan bahagia untuk semua, selal… Its on! Go to my LINE official account now! https://t.co/9VBB18zdTi Sampai bertemu sore ini di Bintaro Xchange!! https://t.co/xx0p4Pljqz #TERBENAR? music video, reviewed by Fitri! @fitrop\n•\nReview kalian gimana nih yang udah pada… https://t.co/bmS8LxeXil RT @Official_MNCTV: Vidi Vini Vici akan ada di #KilauRayaMNCTV26 mulai 19-20 Oktober! Datang, lihat, rasakan di Bintaro Jaya XChange! @vidi… Haha gpp kak. Jalan juga ga bisa.. liat post sebelum ini deh https://t.co/p6xnKXNVxq Mau nya gitu. Trotoar nya ga available. Dipake motor jalan. Gimana dong drpd ketabrak.. https://t.co/0dLU8h4srC Kawa di daitokyo https://t.co/59qlOt8FBg Saat lo harus pergi dari satu tempat ke tempat lain disatu jalan, yg harusnya cuma 5 menit, ini udah sejam belom sampe. #WhenJakartaRains Ayu loves #TERBENAR? @aytingnew92.\n•\nYang sudah nonton, komen dong part mana yang jadi favorit… https://t.co/n2iNrFVMit Public service announcement from Sarah &amp; Dito! @sarahsechan_net @dittopercussion\n•\nSiapa disini… https://t.co/uUGl2y34jm RT @HeruPRYG: Now! Posisi 20 @vidialdiano - Terbenar #IndonesiaTOP20 @bahanafmjkt w/ @rayicendana RT @rribintuhan: #NowPlaying @samsonstheband Cinta Mati \n@geishaindonesia Mustahil Tuk Bersama \n@vidialdiano Terbenar RT @Hitsradiobdg: #HitsRadioPlay @vidialdiano - terbenar #hitsmusicupdate #Hitsrequest RT @iradiobdg: Lagu terbaru @vidialdiano 'Terbenar' yang ada di album 'Persona' #IndokustikSpecial #dnjcoustic https://t.co/yCXvIeK4wV RT @iradiobdg: #ONAIR @Iwa_Kusuma - Ku Ingin Kembali | @ruthsahanaya - Rinduku | @vidialdiano - Terbenar #SiaranTengahMalam RT @1023fmbandung: Yuk @VidiesBandung lihat performence dari @vidialdiano bawain single #Terbenar di @1023fmbandung via @YouTube   \nhttps:/… RT @DMS_AMBON: The Lie - @foofighters on #FreshMusic and next, Terbenar - @vidialdiano RT @radiovenusmks: #NP @yurayunita - Buktikan &gt; @vidialdiano - Terbenar &gt; @LCvirgoun - Bukti &gt; @sherylsheinafia - Sebatas Teman #PRIMEREQUE… RT @bahanafmjkt: Now Playing pendatang baru @vidialdiano - Terbenar , bareng @rayicendana di #IndonesiaTop20 Bandung selalu memberi kesan yang luar biasa. Terima kasih, Bandung! ❤️\n•\nIni adalah moment saat… https://t.co/kIH47J4gCk First stop of our second day here in Bandung, @1015DAHLIAFM! Merapat wargi Dahlia!\n\n#TERBENAR?\nhttps://t.co/PMQqw4bBa9 https://t.co/AZwzROwORf RT @iradiobdg: Hari ini jam 7 malam kita nyanyi bareng @vidialdiano di #indokustikspecial live dari @iradiobdg… https://t.co/KJrFOuX6vj 3rd and final stop for the day. Bakal hadir di @iradiobdg &amp; @hardrockfmbdg untuk #TERBENAR?\n\nYUK!\nhttps://t.co/PMQqw4bBa9 https://t.co/XKPyL37VqW RT @1023fmbandung: New comer chart #RaseIndonesia20 edisi terbaru @vidialdiano bakal bahas single #Terbenar bareng… https://t.co/WmoWZKBcsR RT @Iradiojakarta: Yang semalam membuat Bandung Pecah..!, yuhuuu ada @vidialdiano - Terbenar di Lagu ke 6 bareng @ermiliatania di #10Laguke… RT @ardanradio: Insan Muda sekarang di studio udah ada @vidialdiano nih\nPantengin keseruan @eizaARDAN ngobrol seru bareng vidi yaa\n\n#ARDANE… RT @Pro2_Merauke: #NP\n@vidialdiano - Terbenar\nyukz request bareng @AgustinusWahyu4 sampe jam 4 sore, bisa salam juga yaa #Pro2Entertaint RT @Pro2FMSumenep: yukpilih lagu @LCvirgoun - Bukti\n@vidialdiano - Terbenar\n@samsmithworld - Too good at goodbyes\n@evanescence - Imperfecti… 3rd stop di @RadioB956fm! Merapat guys!\n\n#TERBENAR?\nhttps://t.co/PMQqw4bBa9 https://t.co/VuldJmNC0Y Semalam di acara Indonesia Traditional Wedding Festival 2017. \n•\nWearing @ikat_ind by… https://t.co/7yf7hYs97v 2nd stop, @RASEFMBANDUNG! Lets go! \n\n#TERBENAR?\nhttps://t.co/PMQqw4bBa9 https://t.co/8sZGY4WJb2 Kalian memang selalu terupdate ya haha. Thanks guys! https://t.co/ooEQZRu9Dg First stop, @ardanradio! Yuk stay tuned Bandung!\n\n#TERBENAR?\nhttps://t.co/PMQqw4bBa9 https://t.co/lMBCViyHlY Selamat pagi Bandung!\n\nSelama 2 hari ini, saya akan tour ke beberapa radio di Bandung untuk #TERBENAR?\n\nhttps://t.co/PMQqw4bBa9 https://t.co/SBttVchfl5 B A N D U N G\nP e c a h!\n•\nTerima kasih untuk Minggu malam penuh energi ini teman-teman! Saya… https://t.co/tpKtRf4K0m ❤️ @ Summarecon Mal Bekasi https://t.co/2LyDVyOSnM Warga Tangsel mampir silaturahmi dengan warga Bekasi semalam! Ada wajah kalian kah… https://t.co/FbnKGs7ufw Merinding dengernya. Thank you Bekasi! #TERBENAR?\n•\nLink on bio https://t.co/4dAumQdh7w Bekasi selalu #TERBENAR dalam memberi energi disetiap performance saya❤️ @ Summarecon Mal Bekasi https://t.co/9yD1u5Jd6I Malam ini, #TERBENAR? akan hadir di 2 acara sekaligus.\n•\nPukul 19.00 WIB akan hadir di @wib_net… https://t.co/ttjdPY6A1l RT @914megaswara: #INDOFRESH w/ @ella_meong | #NP @vidialdiano - terbenar | Sms/tlp 08 11 12 09 914/ 215 286 | MD @anjasmegaswara | save th… RT @bahanafmjkt: nominasi terbaru minggu ini , Now Playing @vidialdiano - Terbenar , Bareng @rayicendana #IndonesiaTop20 RT @d_ozradiobali: #WEEKENDANTHEM by Ayu Sukma Dewi: @vidialdiano - Terbenar. NEXT @BebeRexha - I Got You &gt;&gt; @maroon5 ft @sza - What Lovers… RT @FavoritRadio: #DaftarTunggu #IndoHits30 Edisi 41\n8. @shalahita - Identity\n9. @vidialdiano Terbenar\n10. @Fade2Black_rap CukupDia\n\nKomp.… RT @ozradiobandung: 18. @RADHINI_ - Hampir Jadi , 17. @vidialdiano - Terbenar #OZINDO21 with @DishaArdiwinata || Streaming https://t.co/fh0… RT @JRadio917FM: #Posisi06 di #INDO20 edisi ke41 --&gt; @vidialdiano ~ Terbenar | VA Management | Host: @sayAKHSA | MD: @Egha_Aulia RT @8EHradioITB: #6 @vidialdiano – Terbenar #BULOK20 | https://t.co/1eQNKQLMxh RT @WIB_NET: Ada dua cowok ganteeeng...!!\n@benkasyafani &amp; @vidialdiano yang bakal main kuis TTS..!! #Wib_konsumtif https://t.co/hOaZ3baJEF RT @ardanradio: 4.\n@LCvirgoun - Bukti\n\n5.\n@vidialdiano - Terbenar\n\nArdan Persada 7 Lagi ed 350\n#CumaDiArdan Perbincangan sore yang menarik hari ini bersama om @triawan, untuk krowd.id! Bismillah. https://t.co/oRCgNbcXqz RT @Cassanova102FM: #NP @vidialdiano - Terbenar #SESIPRIBOEMI w/ DJ @antonw118 RT @Iradiojakarta: #ONAIR #IRADIONETWORK\n\nLAGU KE 9 #10LAGUKEREN PAGI INI..\n\n🎶@vidialdiano - TERBENAR\n\nBARENG #REZABIMA RT @BeRadioKRW: #NowPlaying @vidialdiano - Persona - Terbenar (VA Records) RT @Pro2FMSumenep: Playlist jook bok sore ini diantaranya\n@zaynmalik Ft. @Sia - dusk tilla down\n@MaliqMusic - bagaimana kutahu\n@vidialdiano… RT @RadioMercuBuana: #11 @vidialdiano - Terbenar w/ @ayuwidyy , @wswindaey &amp; @adi_user45 #TOP20LOKAL RT @Pro2_Merauke: The Latest Song:\n#NP @vidialdiano - Terbenar\n#JustMusic #AyoDengarRadio\nNext:\n#GenerasiKita With @AgustinusWahyu4 RT @sonoralampung: Hari ini kita bakal ngbrol2 bareng Juara ke-7 kita di #SIC\nyasss!\n@vidialdiano \n\nstay tune di #LUNCHNBREAK brg Arin Lubi… RT @FavoritRadio: Siap2 dengerin Sobat Hati live interview bareng @vidialdiano siang ini 14.45 Wita di #100PersenIndonesia https://t.co/BhP… RT @be107fm: #nowplaying @vidialdiano - Terbenar #FreshMusic w/ @Ollaaaa_05 sukses single terbarunya, Vidi. Salam dari Batam. Yup! LINE LIVE CHAT sudah dibuka! Silahkan chat ke Vidi curhatan ttg keraguan cinta kamu skrg, lets go #Vidies! — Hari ini akan “#TERBENAR? LINE LIVE CAST”, pukul 19.00 WIB di OA gue. Akan bales2in chat kalian! Follow lgs yuk! https://t.co/ZSiRvsc8HM https://t.co/gLAOv31ZDD RT @914megaswara: #INDOFRESH w/ @ella_meong | #NP @vidialdiano - Terbenar | Sms/tlp 08 11 12 09 914/ 215 286 | MD @anjasmegaswara | save th… RT @HAHOTV: Lagu ini bisa jadi kode buat kamu yang ragu dengan dia :)) tonton video @vidialdiano - Terbenar di playlist #Pop HAHO! #Subscri… RT @PissRadioCiamis: #NowPlaying @vidialdiano - Terbenar, @maudyayunda - Perahu Kertas  #REFRESH w/ @GitaDesera MD: @BangJosh19 RT @malbekasi: Happening THIS WEEK!\nJgn lewatkan penampilan @vidialdiano di The Downtown Walk Festival 2017, 14 Okt 2017, jam 8 malam. Free… RT @SerangRadio: #LagiMuter @vidialdiano -Terbenar @VaRecordsJRatt W/ @minazaria898 @faizginanjarinu Cc  @SheSomad #Koepaspagi #11Nation Saat bandungmakuta vidi.vinivici &amp; surabayasnowcake bertemu dihari bahagianya kak… https://t.co/PqeXpCnZnF #TERBENAR? sudah bisa teman-teman jadikan RBT kalian sekarang juga :)\n\nhttps://t.co/PMQqw4bBa9 https://t.co/flBNx2e7v6 A mandatory boomerang with the newly weds!\n•\nCongratulation kak laudyacynthiabella @iamkumbre… https://t.co/719HhBsB45 A mandatory wefie with the new couple laudyacynthiabella &amp; @iamkumbre! So SOO happy for you kak!! https://t.co/LoWvIOcFNL One of the best crowd ever! #TERBENAR? https://t.co/MBw80jTtKZ When the crowd sang your story out of their heart! #TERBENAR memang kalian semua! https://t.co/76nZVdMGYG Yeiy, hari selasa depan tgl 10 Oktober, Vidi akan ‘keliling’ Indonesia lagi. Catet jadwalnya ya, sampai jumpa diudara #Vidies! https://t.co/UDbG1wg4WH Santa ursula. Aku padamu ❤️ https://t.co/ISMOwLif6o Santa Ursula. Aku padamu. ❤️ https://t.co/MnWAOu3dO7 Tara loves #TERBENAR? @tarabasro \n•\nBuat kamu yang masih ragu sama pasangan kamu, simak MV… https://t.co/ilVCfsHT7F RT @ardanradio: BARU\n@LCvirgoun - Bukti\n@vidialdiano - Terbenar\n\nKELUAR\n@BillySimpson - Sendiri\n\nArdan Persada 7 Lagi ed 349\n#CumaDiArdan Ayu Dewi loves #TERBENAR? @mrsayudewi \n•\nBuat kamu yang masih ragu sama pasangan kamu, simak MV… https://t.co/aFwMlPGwAe Mumuk loves #TERBENAR? mumukgomez \n•\nBuat kamu yang masih ragu sama keputusan hidup kamu, simak… https://t.co/owhlXHYYyu Wrapping up Idea Fest 2017 with a wefie! @sheiladaisha @wishnutama @Triawan @MirLes https://t.co/uIQ3GPWL0F Sebuah persembahan kecil, dari saya &amp; Katanya Bandnya Vidi, untuk mengawali weekend teman-teman… https://t.co/cFgqaSjRCt Hari ini diberikan kesempatan untuk memperkenalkan krowd.id diantara kalangan orang-orang… https://t.co/wYgLfMbgsk Sore ini saya akan sharing pengalaman saya dalam industri musik, bagaimana kolaborasi… https://t.co/6144ZkpVLW Update jadwal bulan Oktober. https://t.co/fRcEPoQgXs RT @KARDOPAFM: #np ; @vidialdiano - Terbenar #BursaHitsIndonesia  Thx Obrolannya siang ini serru..suksees yaa abaang :) RT @prosalinaradio: at 18.15 WIB --&gt; Phone Interview @vidialdiano - Terbenar #JagoanBaru with @AudryRFajri cc MD @silvia_sonya RT @_VIDIES_: #TERBENAR? akan keliling radio Indonesia seharian ini. Cek yuk apakah kota kamu ada disini (line @vidialdiano )\n\nhttps://t.co… RT @Mandala964FM: Now Live Phoner Interview bersama @vidialdiano di #MUSICISME ngobrolin singlenya baru \"Terbenar\". https://t.co/oFoTTo77hs RT @starfmmedan: Yeay single terbaru @vidialdiano - Terbenar yuk kupingin di @starfmmedan yah! https://t.co/kj9dOGohSR RT @indriaajeng: Terbenarnya @vidialdiano nyasss juga. RT @986topfm: #livephone\n\nbareng @vidialdiano \n\nyang punya single terbenar RT @radiosushifm: sore ini sushi mitra, \"TERBENAR\" ada #TICTALKTIME bareng @vidialdiano . siapkan diri kamu sushi mitra,  streaming https:/… Selamat pagi!\n\n#TERBENAR? akan keliling Indonesia seharian ini! Cek yuk ada kota kamu kah disini?\n\nhttps://t.co/PMQqw4bBa9 https://t.co/GepQHUVXYa #TERBENAR? akan keliling radio Indonesia besok! Ada kota mu kah disini??? https://t.co/5xcr4lLG4F RT @LayariaNetwork: Keraguan dalam hati @vidialdiano diungkapkan dalam sebuah lagu terbarunya. Sebenarnya siapa yang terbenar untuknya? htt… Stay tuned di instagram @KapanLagicom, akan ‘ngebajak’ instaLIVE nya, nyanyiin #Terbenar sebentar lagi! Yuk #vidies! Pengabdi Setan bagus sekali! Well written, well produced!! Gambar, warna, set, tata suara dan tata lampunya top notch!! Harus pada nonton! Excited to finally announce my partnership with @samsung_id and its new Galaxy Note 8!\n•\nGlad to… https://t.co/GEISK5oNVc Kemarin di Grand Opening Aeon JGC! Terima kasih untuk energi nya kemarin kawan!! Semoga suka… https://t.co/PSEaApPutx Denny loves #TERBENAR? @dennycagur\n•\nBuat kamu yang masih ragu sama pasangan kamu, simak MV… https://t.co/9f4f6hkM8q Sampai bertemu sore ini di Grand Opening Aeon Jakarta Garden City! https://t.co/FvGW0HGttb RT @PramborsJogja: sekarang! #pramborsplaying INDO RE PRESENTS @vidialdiano TERBENAR. materi terbarunya nih. dengerin deh kawula muda! :p #… RT @pramborsmedan: sekarang! #pramborsplaying INDO RE PRESENTS @vidialdiano TERBENAR. materi terbarunya nih. dengerin deh kawula muda! :p #… RT @PramborsBandung: sekarang! #pramborsplaying INDO RE PRESENTS @vidialdiano TERBENAR. materi terbarunya nih. dengerin deh kawula muda! :p… RT @PramborsSolo: sekarang! #pramborsplaying INDO RE PRESENTS @vidialdiano TERBENAR. materi terbarunya nih. dengerin deh kawula muda! :p #T… RT @PramborsSMG: sekarang! #pramborsplaying INDO RE PRESENTS @vidialdiano TERBENAR. materi terbarunya nih. dengerin deh kawula muda! :p #TR… RT @ardanradio: KELUAR\n@joshua_march - Masih Mencintaimu\n\nULASAN\n@vidialdiano - Terbenar\n@LCvirgoun - Bukti\n\nArdan Persada 7 Lagi ed 348\n#C… Ruben loves #TERBENAR? @ruben_onsu \n•\nBuat kamu yang masih ragu sama pasangan kamu, simak MV… https://t.co/AfE3DoRcmz Raffi loves #TERBENAR? @raffiah54713432 \n•\nBuat kamu yang masih ragu sama pasangan kamu, simak… https://t.co/5DvraOpjtt RT @halidada: https://t.co/EWAO8Z9sMW lagi seneng banget liat MV #Terbenar abang @vidialdiano , problematika jaman now banget gitu 😅😂 RT @Prambors: sekarang! #pramborsplaying INDO RE PRESENTS @vidialdiano TERBENAR. materi terbarunya nih. dengerin deh kawula muda! :p #TREND… Yeayyy thank you!! #TERBENAR? https://t.co/sn6uInqpZx RT @umi3_miumi: Tiap hari nonton MV  #terbenar ~ @vidialdiano kok g bosen ya , kayaknya ini salah satu racun setelah beauty vloger https://… RT @ruswytha: Lagi suka lagu \"terbenar\" nya bang @vidialdiano 😍 RT @reshaditia96: @OZRadioJakarta @Marissayu Kak request lagu @vidialdiano yg terbenar kak #FRESH RT @914megaswara: #INDOFRESH w/ @ella_meong | #NPLAY @vidialdiano - Terbenar | Sms/tlpn 08 11 12 09 914/ 215 286 | MD @anjasmegaswara | sav… Selamat Hari Sarjana Nasional! 😁 https://t.co/443H95a1aU RT @Fitriyuningsihh: oh sempet di TTI toh hastag #Terbenar 😂🙌❤ cc @vidialdiano https://t.co/1NhcNqMag6 RT @iradiobdg: #ONAIR @Duo_Mahadewi - Satu Satunya Cinta | @mynameisrossa - Tlah Mencoba | @vidialdiano - Terbenar #SiaranTengahMalam Selamat pagi! Hari ini akan taping Brownis @ Trans TV untuk lagu #TERBENAR?. Tunggu tanggal tayangnya ya :)\n\nhttps://t.co/PMQqw4bBa9 https://t.co/Xy5tv9lVdU Thank youuu! #TERBENAR? https://t.co/Dd4YS3Tg09 RT @Prambors: #nowplaying @vidialdiano TERBENAR only on #SunsetTrip #VidiOnPRAMBORS https://t.co/s25jTUGpxc Woohoo thank you @Prambors! #VidiOnPRAMBORS https://t.co/lQD0F1B37D RT @RadioKencana: #NowPlaying @MaliqMusic - Bagaimana Ku Tahu, @vidialdiano - Terbenar, @yukatamada28 - Senja Yang Baru #IndonesiaPol RT @914megaswara: #INDOFRESH w/ @ella_meong | #NPLAY @vidialdiano - Terbenar | MD @anjasmegaswara |  Sms 08 11 12 09 914 tlpn (0254) 215 28… I added a video to a @YouTube playlist https://t.co/6fpNdPNGOH Vidi Aldiano - Terbenar (Official Video) Tweet/Instagram pertanyaan pake hashtag #Terbenar. Nanti Vidi akan bajak LIVE Instagram seseorang di @TraxFMJKT dan jawab pertanyaannya! https://t.co/jo3Vb6twBK Thank you #terbenar https://t.co/9ffmNdSNvG https://t.co/L6WlpZB1vk Hahaha wah gak kepikiran sebelumnya #terbenar https://t.co/9ffmNdSNvG https://t.co/GbTZmmvRDs #terbenar https://t.co/9ffmNdSNvG https://t.co/VU9YVgkCu8 Asik! Yuk lanjutkan #vidies! #terbenar https://t.co/9ffmNdSNvG https://t.co/GEUF504ema #terbenar https://t.co/9ffmNdSNvG https://t.co/4zdskJopxU Haha sekalian jualan ya #terbenar https://t.co/9ffmNdSNvG https://t.co/IwAwCGGf0M Hahaha baper #terbenar https://t.co/9ffmNdSNvG https://t.co/TZnT3mYTsq RT @EkaMelindaNurSa: This my opinion for your new music video. Suka bgt karena intro awal sm muka kak Vidi pas gitu zoom in zoom outnya 😄#T… Aah thank you banget ya, dibikin nyesek dan baper sama music videonya. Thanks once again #terbenar https://t.co/9ffmNdSNvG https://t.co/6jgPIX4FLo Hahaha senin aja baper ya #terbenar https://t.co/9ffmNdSNvG https://t.co/TAzoPN6ocj Hahaha kegep baper ya #terbenar https://t.co/9ffmNdSNvG https://t.co/D0JPrEdHbQ RT @ervitaanggraini: Sikap Vidi di MV ini beda banget bikin menggigil dingin \nPenasaran? Ntn aja #Terbenar @vidialdiano \nhttps://t.co/WVL4p… Thank you Bandung! Gmn tanggapannya? #terbenar https://t.co/9ffmNdSNvG https://t.co/kqODwMACaV RT @umi3_miumi: @vidialdiano #terbenar ya kita nantikan jangan bikin kita makin baper karna cuman kota sby yg gak (kayak sblm nya) @vidiald… RT @umi3_miumi: Karna baper it bikin laper, kebaperan di mata dn hati itu nonton MV #terbenar dan perut dikasih vicake @vidialdiano https:/… RT @tutitribdsss: Laris manis di pasaran ya kak. Amin. Haha! Ditunggu segera promo nya di Makassar @vidialdiano https://t.co/tjbzxyGc9f #Te… Amin, see you soon Makassar! #terbenar https://t.co/9ffmNdSNvG https://t.co/cbo71uPqN7 #terbenar https://t.co/9ffmNdSNvG https://t.co/cUFkAbpU9h Alhamdulillah, thank you ya #terbenar https://t.co/9ffmNdSNvG https://t.co/P2EehxFti3 Yup nantikan ya arek arek Suroboyo #terbenar https://t.co/9ffmNdSNvG https://t.co/JX5c3kSnEf #terbenar https://t.co/9ffmNdSNvG https://t.co/vC4jSnfOJw Yummm #terbenar https://t.co/9ffmNdSNvG https://t.co/enoT0bEc4x Alhamdulillah, terima kasih ya #terbenar https://t.co/9ffmNdSNvG https://t.co/R2nnVpC37e HAHAHAHAHA ngakak! #terbenar https://t.co/9ffmNdSNvG https://t.co/gHGRINH814 Yuppp #terbenar https://t.co/9ffmNdSNvG https://t.co/JFeYMfwTWj Ciye baper haha #terbenar https://t.co/9ffmNdSNvG https://t.co/5fCbXdHWxD #terbenar https://t.co/9ffmNdSNvG https://t.co/pcoR4NS4El RT @ervitaanggraini: Yg udah pernah ngalamin yg namanya #Terbenar kayak lagu baru @vidialdiano nih cocok bgt yg blm pernah pasti segera \nht… RT @FirmitaD: Surprise banget lagu ini udah ada mv nya. Perasaan @vidialdiano ga pernah update shooting eh udah jadi aja mvnya #Terbenar .… Yes setuju suka semua! #terbenar https://t.co/9ffmNdSNvG https://t.co/bl9yMwLtbQ Hahahah surpise ya! Gmn tanggapannya? #terbenar https://t.co/9ffmNdSNvG https://t.co/kiTuagAq5L Wah sampe dibikinin notes hahaha #Terbenar https://t.co/806KE3iyf6 RT @ervitaanggraini: Karya terbaru yg udah ditunggu2 dari  @vidialdiano akhirnya hadir #Terbenar lagu masa kini yg sering dirasain \nhttps:/… RT @sasasyafira: Rasanya lagi ngomong dicuekin itu........ \n@vidialdiano #TERBENAR https://t.co/OuEgvMs5UP Gimana rasanya kira kira? Es krim jadi gak manis ya haha #terbenar https://t.co/9ffmNdSNvG https://t.co/oCxuMSUg8W Amin, thank you ya #terbenar https://t.co/9ffmNdSNvG https://t.co/iPil3qtZyi Yes sudah baca reviewnya, Alhamdulillah semuanya memiliki arti masing - masing ya, thank you #terbenar https://t.co/9ffmNdSNvG https://t.co/806KE3iyf6 Yakan, pasti semua pernah / akan mengalami #terbenar https://t.co/9ffmNdSNvG https://t.co/fZHFesvM0V Hahaha lumayan, gimana yang denger? Baper gak? #terbenar https://t.co/9ffmNdSNvG https://t.co/ndySCRGS59 Asik! Thank you ya #terbenar https://t.co/9ffmNdSNvG https://t.co/mqHzCbciGe Alhamdulillah terima kasih ya #terbenar https://t.co/9ffmNdSNvG https://t.co/D13DHHP4Ci Hahahah #terbenar https://t.co/9ffmNdSNvG https://t.co/LZQu4OB0QQ Wah pas ya, semoga keraguannya segera berakhir hehe #terbenar https://t.co/9ffmNdSNvG https://t.co/K6bmLmlifa #terbenar https://t.co/9ffmNdSNvG https://t.co/yFruVJLJLp Hahaha baper ya #terbenar https://t.co/9ffmNdSNvG https://t.co/TeURoTlzWM Sebenernya sempet bingung karena suka sama seluruh lagu di album #PERSONA. #terbenar https://t.co/9ffmNdSNvG https://t.co/lUSldVX1Ti Twitter party! Baru saja merilis music video single terbaru Vidi #Terbenar, silahkan di tweet tanggapannya yuk! https://t.co/9ffmNdSNvG Aaah terima kasih, happy listening &amp; happy watching #terbenar https://t.co/9ffmNdSNvG https://t.co/xxHi5ZSQ1x Hahahaha #terbenar https://t.co/9ffmNdSNvG https://t.co/nGbZXWABtl Yup! Gmn kesan kesan nya nonton music video #Terbenar? https://t.co/9ffmNdSNvG https://t.co/cGk3dYkoXX Amin ya Allah #terbenar https://t.co/9ffmNdSNvG https://t.co/urPz8Vm9ZU Yup, you got it! #terbenar https://t.co/9ffmNdSNvG https://t.co/DVFcftU36B #terbenar https://t.co/9ffmNdSNvG https://t.co/TZ8DSUS12z #terbenar https://t.co/9ffmNdSNvG https://t.co/fN9B6gfpRP Hahaha kan lagi berfikir apakah dia yang Terbenar untuk ku? #terbenar https://t.co/9ffmNdSNvG https://t.co/On6AqfNOFb #terbenar https://t.co/9ffmNdSNvG https://t.co/5F5YgPYMcE Thank you, glad you like it #terbenar https://t.co/9ffmNdSNvG https://t.co/b5AyqZNnwM RT @ervitaanggraini: Mikirnya dalem banget @vidialdiano #Yerbenar jadi keikutan baper https://t.co/S5RnywUZRe Thank you #terbenar https://t.co/9ffmNdSNvG https://t.co/8MrYskED1L Thank you #terbenar https://t.co/9ffmNdSNvG https://t.co/sUaZ36o4te Mari ber baper bersama #terbenar https://t.co/9ffmNdSNvG https://t.co/0i2FfIHPJO Salah satu scene favorit Vidi juga ini #terbenar https://t.co/9ffmNdSNvG https://t.co/Fjsp8Gq672 Wah serius? Happy birthday #terbenar https://t.co/9ffmNdSNvG https://t.co/cTmqIgLXM4 Iyes, kebetulan pas kemarin jalan jalan ke US #terbenar https://t.co/9ffmNdSNvG https://t.co/q9c51r2rbB Hahahah salah fokus #terbenar https://t.co/9ffmNdSNvG https://t.co/ZYCt82arAP #terbenar https://t.co/9ffmNdSNvG https://t.co/pCoTDV9a6K Thank you ya #terbenar https://t.co/9ffmNdSNvG https://t.co/mEimNOXN2Y #terbenar https://t.co/9ffmNdSNvG https://t.co/WFqYn0xaIV Hahah semua merasakan yaa #terbenar https://t.co/9ffmNdSNvG https://t.co/OwyPuhVnJT Thank you! #terbenar https://t.co/9ffmNdSNvG https://t.co/ajRsMaFu5N Wah ngena ya baper nya, happy watching ya. #terbenar https://t.co/h9ZsTqxfAW Wah jadi baper ya hehe #terbenar https://t.co/Dx1G57jFyB Thank you #terbenar https://t.co/rBvkSJuUXh Yuk kita mulai Twitter Party nya! #terbenar https://t.co/5O8589SOqZ NEW: #TERBENAR Music Video, my latest single, watch here: https://t.co/9ffmNdSNvG Standby ya di youtube account Vidi, cannot wait! #terbenar https://t.co/4CCcuDZX3g Hahaha gak sabar! Kurang dari sejam lagi yaa #terbenar https://t.co/3TUU96Hspl Tweet ber kali kali dong boleh hehe #terbenar https://t.co/QUlRMCHWTO #Vidies! Jam 5 kita twitter party yuk! Begitu video klipnya rilis diyoutube, tweet ke Vidi gmn tanggapannya + tweet linknya + #terbenar ya! RT @SandistyaSusan: Artbook Persona \"Wonder\"  #Terbenar Today..  @vidialdiano Can't wait so excited.. 🤗 https://t.co/Ip9YRUtgVr Hahahaha “Terbenar gak ya si dia?” Gitu ya #terbenar https://t.co/6OOnTVP4Op Asik, stand by jam 5 sore ini ya untuk music videonya. #Terbenar https://t.co/4jbfB3L7Rz Sama sama, nantikan ya music video nya jam 5 sore ini. #terbenar https://t.co/WdOUBecxz8 RT @_VIDIES_: Request #Terbenar nya @vidialdiano kak❤ #FRESH https://t.co/qvHyAYZY34 RT @ainul_inong: Liat sekilas MV #Terbenar konsepnya beda banget\n@vidialdiano RT @feliciathaa: Dear @vidialdiano \nLagu #Terbenar nya pas bgt k hati, Pas bgt sm kondisi aku yg lg bingung buat ngambil keputusan dia itu… #TERBENAR?\n\n“Kau jelas miliki sesuatu..” https://t.co/VwQcmPwkJb #TERBENAR?\n\nPerdana hari ini! Bisa didengarkan disemua radio &amp; streaming services (JOOX, Spotify &amp; Itunes). https://t.co/OFcNNw3izH RT @dahSyatMusik: Biar semangat kerjanya dong dengerin lagu si ganteng @vidialdiano #SeninBerwarna https://t.co/4kngzoaQfP RT @dahSyatMusik: Siapa nih yang udah gak sabar @vidialdiano nyanyi? #SeninBerwarna https://t.co/pZRrwML88r #Terbenar?\n•\nBesok. 25 September 2017.\n•\nYoutube / Spotify / Itunes / Joox. https://t.co/mnVRWXMJ3h #Terbenar? https://t.co/CUpmbzM684 #Terbenar?\n•\n25 September 2017. 3 hari lagi!\n•\nYoutube / Spotify / Joox / Apple Music https://t.co/BLZ10FUfDT Musisi malem ini + 1 bintang cilik.\n•\nThank you optikseis for having us tonight! Thank you… https://t.co/qIO1irRvWA Sampai berjumpa besok di Senayan City! https://t.co/haG06rQIYC Bandung gileu!!! Alhamdulillah seru banget manggung hari ini! Terima kasih untuk cinta kalian… https://t.co/7ouVQFvBma SHOOTING DI SYDNEY | #VAgoVLOG eps. 25 https://t.co/4xw3CvPuok\n\nSiapa aja disini yang udah nonton? Ditunggu comment nya ya! :D Very honored to represent Indonesia on Adidas' newest ad. Saksikan disini: https://t.co/2aCaLOGysH https://t.co/v1ZnPnOw9P RT @diffafadhillac: NP:\n@vidialdiano @andienaisyah - Hingga Nanti RT @iradiobdg: #ONAIR @dewisandra ft @RayenPono - Buktikan | @vidialdiano - Definisi Bahagia (Piano Version) #SoreSore RT @bimantararadio: Np @vidialdiano ft @andienaisyah - hingga nanti\n      @FatinSL ft @Angelo_Mikha - kaulah kamuku\n#bincangub #radiobukitt… RT @MeTubeID: Mau lebih bahagia? Yuk dengerin lagu \"Defenisi Bahagia\" @vidialdiano disini https://t.co/7EghzhKprV #meTubeID https://t.co/v9… RT @diffafadhillac: NP:\n@vidialdiano @andienaisyah - Hingga Nanti Siapa yang udah nonton VLOG terbaru gue? Yang mau liat Syahrini KW 4 promo toko gue abis-abisan, check this out https://t.co/4By4ipluNG RT @christophorapg: Thanks for tonight @vidialdiano YOU ROCK!! Balik dari luar negri lgsg perform di SMA ReCis 😍 thank you so much kak! Ily… Malam minggu saya semalam bersama teman-teman dari Regina Pacis Jakarta.\n•\nIt's good to be back… https://t.co/ILO0quIPxv I added a video to a @YouTube playlist https://t.co/D9IWh9FkH0 ADIDAS SECRET PARTY | #VAgoVLOG eps. 23 https://t.co/4By4ipluNG\n\nVLOG baru sudah tayang! Yang udah nonton, mana suaranya? 😁😁😁 I added a video to a @YouTube playlist https://t.co/Ux11qfCCVK BUKA HARI PERTAMA | #VAgoVLOG eps. 23 Siapa aja disini yang udah pernah nyobain vidi.vinivici?\n•\nRasa apa yang jadi favorit kalian?… https://t.co/HSddcTc7Rh VLOG baru akan hadir sebentar lagi! Be prepared! https://t.co/JbX6fb4r2H Alhamdulillah selesai semua kerjaan &amp; shooting di New York. Bismillah semoga hasilnya memuaskan!… https://t.co/oWZq32OjVY Got a chance to meet @mkbhd at the #Unpacked 2017 event. Also got accidentally featured in his… https://t.co/TlnGysthID Siapa yg udh nonton VLOG baru gue ttg peluncuran #GalaxyNote8 di NYC kemarin? Simak disini https://t.co/d4QrTE4xLK. Tell me what do u think! RT @detikinet: @widimulia dan @vidialdiano ngejoprakan di pinggir jalan new york demi galaxy note 8 #Unpacked2017 https://t.co/DhO4gJfOCj RT @detikinet: 1 jam menuju #Unpacked2017, lagi antri masuk ke acara bersama @widimulia @sasonodwi  @vidialdiano dan @gadtorade https://t.c… RT @gadtorade: Semua ngantri #Unpacked2017 , ada penyanyi kita @widimulia , boss Detik @rourry , tetangga @sasonodwi , penyanyi dan vlogger… Minggu pagi ini masih bersyukur untuk semua dukungan, doa &amp; cintanya teman-teman Surabaya kepada… https://t.co/82lm0L9vL5 Pukul 13.00 WIB nanti akan bertemu dengan teman-teman Surabaya di toko VidiViniVici, di Jl. Diponegoro no. 48! See you guys there! Overwhelmed by the feedbacks from the opening of vidi.vinivici!!!\n•\nThank you so much for the… https://t.co/gWBRxpEROI Dirgahayu Republik Indonesiaku tercinta yang ke-72 tahun!\n•\nSemoga bisa menjadi bangsa penuh… https://t.co/zXomUiKLFA Good morning from Sydney! Team adidasindonesia is ready to explore the city. Can't wait to share… https://t.co/aagc6akgm1 Pre-launch \"VidiViniVici\" | #VAgoVLOG eps. 20 https://t.co/fBM8kly3Be via @YouTube Backstage @WeTheFest bersama rakyat musisi kemarin! @ JIEXPO Pekan Raya Jakarta (PRJ) Kemayoran https://t.co/C5RltmwFR8 Malam ini akan perform di Monas dalam rangka HUT Monas ke 42. Sampai bertemu disana teman-teman Jakarta! I added a video to a @YouTube playlist https://t.co/fDHlIXMgr5 Pre-launch \"VidiViniVici\" | #VAgoVLOG eps. 20 RT @Iradiojakarta: Sambil nunggu store VidiViniVici @vidialdiano buka tgl 17Agustus nanti,kita nyanyi bareng @andienaisyah IListeners HINGG… New vlog is coming to town. Get ready!\n\nhttps://t.co/JbX6fb4r2H Masih berbagi #DefinisiBahagia di @Ini_Talkshow @netmediatama! Siapa yang lagi nonton? #Jam8NontonITScitacita Jadwal hari ini, Live @Ini_Talkshow pukul 19.00 WIB! Don't miss it peeps! #DefinisiBahagia https://t.co/ijhlhQ4SMV Merayakan ulang tahun @vadieakbar bersama geng 'Ambisius'.\n•\n#HappyTompelDay @ Hotel Mulia… https://t.co/MyKFYz0RLo Celebrating this dude's 22nd birthday! Happy birthday, @vadieakbar! https://t.co/VaunMLGRxj Masih belum bisa move on dari acara to pre-launch vidi.vinivici kemarin! Terima kasih banyak… https://t.co/cP36buxJ3M RT @deteksi: Tanggal 17 Agustus 2017 nanti Vidi Aldiano akan membuka gerai VIDI VINI VICI di Jl.Diponegoro 48 Surabaya. @vidialdiano @vidi.… Surabaya. Seru. Banget!\n•\nTerima kasih banyak arek-arek Suroboyo yang sudah hadir di pre-launch… https://t.co/aZl3BXIDqs Selamat pagi Surabaya! Nervous untuk acara siang ini! Semoga acara pre-launch #VidiViniVici hari ini lancar. See you guys!! https://t.co/Zqs71gf4wg Update jadwal bulan Agustus #infoVidies https://t.co/OQMgmblGfA Ga sabar untuk bertemu teman-teman besok di Grandcity Mall Surabaya, pukul 13.00… https://t.co/FVgKxzlVUd #VidiViniVici is coming to Surabaya soon. Bismillah!\n\nSampai besok, Minggu 6 Agustus 2017 @ Grandcity Surabaya 13.00 WIB! https://t.co/frGJYynEzw Menuju bandara Soeta. Excited banget untuk pre-launch toko kue saya bersama mama besok di Surabaya. See you guys tomorrow! https://t.co/LO5cZwb2Dd Siapa yang mau ketemu dengan saya &amp; Syahrini KW 4 ini di Surabaya, hari Minggu, 6 Agustus 2017… https://t.co/DIVWMkcIDL I added a video to a @YouTube playlist https://t.co/oKsxTG8ZcM #SelaluTauMusik: Vidi Aldiano vs Devina Aureel main ABC OK Google Good morning! Start your day with my playlist at @SpotifyID https://t.co/hPPWO52gQX The most successful, sophisticated &amp; happy people, have just one thing in common. They are all… https://t.co/W57ND7s4T0 I added a video to a @YouTube playlist https://t.co/FzK1m3jZ7O Selamat Hari Raya Idul Fitri 1438H (Vidi Aldiano, Tulus, Kunto Aji, I added a video to a @YouTube playlist https://t.co/peSB4O1pY0 Kumpulan Lagu Anak 90an - Feat. Vadi Akbar Surabaya bakal kedatangan tamu baru dibulan Agustus ini, karena vidi.vinivici is coming to town… https://t.co/7hspqCaOVh RT @athasoemarko: Tadi malam di acara peresmian Menara by @KibarID. https://t.co/PkcRxDMxgb Beruntung sekali saya bisa berbagi #DefinisiBahagia di launchingnya google for Entrepreneurs x… https://t.co/GMRACtx0rb RT @enda: In the haus! @vidialdiano at Menara @KibarID and @GoogleForEntrep Lounge in Jakarta launched! https://t.co/w843rWhc8s APAAN SIH SHER https://t.co/lfOOnJsLZp I added a video to a @YouTube playlist https://t.co/0fX7Br30Ed #VAgoVLOG: Q&amp;A Bersama Vidies Reupload! Karena kesalahan teman gue yang lagi sok sibuk main HP ini, #VAgoVLOG episode Q&amp;A gue… https://t.co/sfIVZUW75N #VAgoVLOG: Q&amp;A Bersama Vidies: https://t.co/0fX7Br30Ed via @YouTube The best mom in the world, my first love, my best friend, and my own Syahrini KW 4. ❤️ @… https://t.co/O5Ni4pHsds Yeiy, stay tuned, kawan! https://t.co/ePO55rCS5U Summer in Italy. Looks like IKEA tho. @ Capri, Italy https://t.co/wNRB86HJVu Dalam edisi #BoysSquad dan tetap kami #BukanAnakPejabat 😂\n•\nKurang @adhrrf nih kayaknya. But no… https://t.co/LfhSPRJDQj #VAgoVlog : Q&amp;A Vidies Bandung, is here! https://t.co/wUbMmy90PK #VIDIES, SURPRISE! Stay tuned di official youtube account Vidi karena sebentar lagi 17.30 WIB, akan rilis #VAgoVlog terbaru, Bandung! What do you guys think about my latest music video for #DefinisiBahagiaPianoVersion? Watch here: https://t.co/snthfRhay1 Enjoying sunset at Sorrento with the best couple ever ❤️#sorrento @ Sorrento, Italy https://t.co/bktOpR3Oiw The best way to enjoy my holiday is definitely to spend it with these guys. #amalficoast @… https://t.co/SZAxlUCAlj Still can't get over the view of #Positano! Di Indonesia ada gak yah konsep vertical city kayak… https://t.co/LdbtUQKSJr TGIF! Siapa pengguna @JOOX_ID? Klik link ini untuk mendengarkan lagu terbaru Vidi #DefinisiBahagiaPianoVersion ya: https://t.co/MSU6kMXMNl Memulai liburan hari kedua dengan mengunjungi tempat bersejarah, Pompei.\n•\nDifoto ini, saya… https://t.co/Yx5YqlvAGx Watch my adventure to Flores on my #VAgoVlog, here:\nhttps://t.co/6Y60iSWNcv #DefinisiBahagiaPianoVersion special saya dedikasikan untuk program Peduli Anak Indonesia, listen here: https://t.co/BKuhgLFN57 Good morning! Yuk streaming #DefinisiBahagiaPianoVersion di @SpotifyID, klik link berikut: https://t.co/WseuhEqwqD Karya audio &amp; visual terbaru Vidi yaitu #DefinisiBahagiaPianoVersion, featuring @dudutna: https://t.co/snthfRhay1 When she doesn't want you to post this photo coz she's not comfortable with her pose, you gotta… https://t.co/7IVOZu2wSB Selalu merinding setiap nyanyi #DefinisiBahagiaPianoVersion diiringi dengan suara anak-anak… https://t.co/dZNf3w1IEF Udah pada stay tuned di @TheComment_NET ? Yuk #DefinisiBahagiaPianoVersion RT @TheComment_NET: Ayo tebak tuan @vidialdiano nyanyi apa? Matiin tv sekaraangg! https://t.co/PU5IJ3EnJg #DefinisiBahagiaPianoCover https://t.co/G7eqY3ezS2 Tema foto lebaran keluarga saya tahun ini:\n\"Pirates vs Batman\"\n•\nSiapa best dress &amp; best pose? I… https://t.co/cYt2X1UDb1 Let me introduce to you, me familia.\n•\nKeluarga Harry Kiss mengucapkan minal aidin walfaizin,… https://t.co/vDDFntLWCh Lebaran hari kedua. Badan sudah mulai merasa melebar setelah menikmati banyak sekali ketupat dan… https://t.co/rtqxVzXX4p Selamat Hari Raya Idul Fitri 1438H (Vidi Aldiano, Tulus, Kunto Aji, Teddy Adhitya &amp; Yura Yunita): https://t.co/FzK1m3jZ7O via @YouTube Persembahan dari kami untuk teman-teman dihari raya Idul Fitri!\n•\nSelamat menghabiskan opor… https://t.co/2C4P69xgKW #DefinisiBahagia https://t.co/nyjBx6cJvh Klik link berikut untuk mendengarkan lagu terbaru Vidi #DefinisiBahagiaPianoVersion di @JOOX_ID: https://t.co/PpjmbPwuM4 RT @netmediatama: Bener-bener definisi bahagia nonton @vidialdiano di @Ini_Talkshow 😍😍 https://t.co/tknwKscOoc Yuk stay put di @Ini_Talkshow @netmediatama. Pertama kali live di TV pake kacamata krn mata bengkak. Ada yg notice / terlihat cukup samar? 😂 Hari ini akan berbagi #DefinisiBahagia di @Ini_Talkshow @netmediatama. Kerja terakhir sebelum lebaran tahun ini! Woohoo! Sambil sahur sambil menyaksikan karya visual &amp; audio terbaru Vidi #DefinisiBahagiaPianoVersion, ada kesan &amp; pesan? https://t.co/jxm3yCyawp #DefinisiBahagia https://t.co/5kIbuSDpmY Keseruan akhir pekan ini bersama #DefinisiBahagia saya!\n•\nBahagia sekali bertemu kembali dengan… https://t.co/pVYEINhnJo Hari selasa akan sharing tentang Entrepreneurship / creativity / innovation di 'The Backstage', yuk daftarin diri kamu, cek infonya disini. https://t.co/CCaIwBQXiJ Asikk ditunggu covernya yaa hehe.. https://t.co/jPxLtp2Ssu Baru saja berbagi #DefinisiBahagia di Botani Square Bogor diacara Telkomsel Ramadhan… https://t.co/Zph20jxwdG Siap2 nemenin teman-teman Bogor ngabuburit di Botani Square. Sampe buka puasa. Lets go! RT @OfficialRCTI: Eits tak ketinggalan penampilan dari @VidiAldiano di @HijabLook_RCTI. Vidies mana suaranya?? :D #HijabLookGarnierFinal ht… Jadwal weekend ini! Hari ini ketemu di RCTI &amp; Botani Square Bogor ya. Besok ketemu di Bandung! Woot. #suaratapimasihhilang https://t.co/HVWMWhnh4A Karya special #DefinisiBahagiaPianoVersion, arranged by @dudutna, dapatkan di @JOOX_ID: https://t.co/PpjmbPwuM4 Sambil sahur sambil streaming #DefinisiBahagiaPianoVersion di @SpotifyID, klik link berikut / scan Spotify Code ini. https://t.co/M4nTP3gK81 https://t.co/hXfp9tRTvL Siang panas biar lebih adem silahkan disaksikan video clip terbaru Vidi #DefinisiBahagiaPianoVersion https://t.co/jxm3yCgzER Innalillahi wainnailaihi rojiun... selamat jalan kak  @juliaperrez. Rest in love dear kakakku.... kak jupe udah tenang disana ya... 😭😭😭 Selamat pagi! Siapa disini yang udah pada nonton music video #DefinisiBahagiaPianoVersion? Yang blm ntn disini yuk https://t.co/jxm3yCyawp :') #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/NEGdaqPi0C #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/dv25hpcPuE Yeiy Alhamdulillah #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/S01oHVyyfV Thank you Vennaaa! #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/gWLYczAYD1 Alhamdulilaaaah #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/gV1R7P73Iw Amin ya Allah. Terima kasih doanya #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/ru4QtZLYat #DefinisiBahagiaPianoVersion karya unk program Vidi &amp; @PuyoDesserts Peduli Anak Indonesia, kamupun bisa berdonasi  https://t.co/jxm3yCyawp Yeiy because of you guys! #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/iIxfutD4ZW #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/0KUnlBwr3n Kebayar banget, semoga bisa menginspirasi #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/5FdSmFY6z7 #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/j9WateZodK Alhamdulillah nikmat, thank you for the support #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/r4Wl7wEjON #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/jWNiutJQJd Yes! Dan langsung tweet ke Vidi tanggepannya gimana ya #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/ggOgr0wJMw #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/kg0KoJIzZI Haha selamat baper dan selamat ter inspirasi ya, makasih ya #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/covGvgYJDu Its all worth it! #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/RX9Bns9sfx Yeiy! Go #vidies go! #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/dOhTh5XGNl Thank you ya #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/zu4371hncd #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/M4RQr2XcVo Se happy itu sih, gak mau pulang, sangat menginspirasi! #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/E7Hfj2NXH7 #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/Qno701q84F Alhamdulillah makasih ya #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/bbZlXpAtxG Nyoh!!! Thank you so much love!! Bantu-bantu beli puyo ya haha https://t.co/ypA1j8fpAs Amin InsyAllah Alhamdulillah, terima kasih ya #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/l5BbRE5tg8 #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/FhoMahzhUu Aww thank you so much dude! #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/s3oDjFUBcR #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/9Wx5oobK4U Thank youuu #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/dhkFOZzgrM Beautiful Indonesia 🇮🇩 #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/EJiaKoq41E #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/FpCnFn8Urq Selamat ber baper hehe #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/FjXLzqKAQa Iyes sudah ada juga platform digital ya #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/mqYi6GPEFd Waah selamat berbuka Makassar dan sekitarnya! #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/xuUFQqKMfU #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/15fJ2hlhqN #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/jcbUpN5D3W Iyes om Andi is the best! #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/HSTb6BoeuE Thank you, see you soon! #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/DT8nX2K4Wa Aaw thank you #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/GWMyaT5n6r #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/dsJ230inlv Alhamdulilah #vidies you did it again! Trending topic #1,l! Yuk lanjut twitter party! #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/yuaW9Sb0Cy Haha makasih yaa #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/dDAABuSLQn Yeiy so happy to hear! #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/ianAyeMdwe #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/JiMzTv9FBQ Aaaw such a great feedback, thank you yaa #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/FrmVPA3fd2 Alhamdulillah terima kasih yaaa. #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/iLv1Gj5l6A #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/zpF25PnZnZ #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/XkCqLoZbvz Aaa terima kasih, semoga bisa menginspirasi yaa #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/zyMvqMhXjE Karya special ini di arrange oleh @dudutna &amp; video di sutradarai oleh @candisoeleman. \n\n#DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp Terima kasih atas titikan air mata nya, semoga bisa menginspirasi :) #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/8WKc3m0eiC Alhamdulillah Amin, thank you ya #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/A9xg0rz4VC Yeiy, bagian terfavorit yang mana? Alhamdulillah #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/osHXAHbDnn #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/bVV3jZCLi6 Hampir gak ada sih, karena segitu serunya! #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/ZUx0EtWGJW #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/ITVSp1HN3B Awww Alhamdulillah, bagian favorit yang mana? #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/FLCLU4vZCS Terima kasih, amin! #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/lQwz7TigRf Amin, semoga bisa membantu adik - adik di Flores. #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/zDrFwxcbgA Anak ini sunggu menginspirasi! #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/9oYOeryP4i Alhamdulillah #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/cusARmD4Mi Bagaimana kesana pertama nya setelag menonton #DefinisiBahagiaPianoVersion? Share ya, thank you kawan! https://t.co/jxm3yCyawp Yeiy! Thank you again #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/e7spgFvN4K Bagian favorit yang mana? #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/DjvDa4Z5Hz Aaaaww terima kasih yaaa #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/JpDELRdR0K Thank you #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/uei63cDvUo Glad to hear! Thank you! #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/pSXPEYkUjG Alhamdulillah thank you #DefinisiBahagiaPianoVersion https://t.co/jxm3yCyawp https://t.co/yJcdOERyE8 RT @VidiesJateng: Definisi Bahagia Piano Version!! @vidialdiano #DefinisiBahagiaPianoVersion https://t.co/MqPa0OPVow #DefinisiBahagiaPianoVersion https://t.co/GCbqFuCZFh Yeiy! #DefinisiBahagiaPianoVersion https://t.co/MvsE9buD5t RT @mitharizkytas: @vidialdiano versi ini adem banget, sukak deh vid! 💕💕 #DefinisiBahagiaPianoVersion https://t.co/Tb0YMLRtuf Its finally here! #DefinisiBahagia Piano Version feat. @dudutna Music Video!\n\nWhat do you think kawan??? https://t.co/jxm3yCyawp Vidi Aldiano - Definisi Bahagia feat. Andi Rianto (Piano Version): https://t.co/uRGh4Bosco via @YouTube Udah siap twitter party dengan tagar #DefinisiBahagiaPianoVersion? #vidies! Siap siap beberapa menit lagi video clip #DefinisiBahagia Piano Version akan rilis di official youtube account Vidi! Cannot wait! RT @rakahartono: @vidialdiano Keren paarrsss!! Merinding denger suaranya, terus berkarya masbroo💪#DefinisiBahagiaPianoVersion RT @aldianadindin: #DefinisiBahagiaPianoVersion bikin merinding ka @vidialdiano dengernya, ih sukak ❤❤❤ RT @SpotifyID: Vidies! Kalian sudah dengar Definisi Bahagia Piano Version? @vidialdiano punya pesan khusus lewat lagu ini! https://t.co/6eY… #DefinisiBahagiaPianoVersion (3/3)\n•\nPerdana hari ini! Lagu ini sudah bisa teman-teman request… https://t.co/bey4Imojbv #DefinisiBahagiaPianoVersion (2/3)\n•\nPerdana hari ini! Lagu ini sudah bisa teman-teman request… https://t.co/qszz641xwb #DefinisiBahagiaPianoVersion (1/3)\n•\nPerdana hari ini! Lagu ini sudah bisa teman-teman request… https://t.co/32XqSaZ35f RT @EkaMelindaNurSa: Bahagia buat aku cukup liat kak @vidialdiano pagi ini di @SarahSechan_NET 😊 thankyouuu! Aku suka bgt #DefinisiBahagiaP… RT @tutitribdsss: Pertama kalinya dengar #DefinisiBahagia piano version di @SarahSechan_NET ! Ga sabar utk video releasenya nnt sore @vidia… Thank you pe! https://t.co/VE0RmIIXv7 RT @mutiara_muvi: #DefinisiBahagia versi piano buat merinding vid. Suaramu bening banget @vidialdiano @SarahSechan_NET Perdana bawain nih! Semoga suka sama #DefinisiBahagiaPianoVersion ya! Bisa didengar lewat Joox, Spotify &amp; iTunes! https://t.co/Kf3HFpqBXV RT @SarahSechan_NET: Waktunya untuk ngeluarin unek-unek kamu di @sarahsechan_net \nDijamin kebingunganmu akan terjawab! \n#JumatCurhatOnSarSe… #DefinisiBahagia Piano Version Release day | Sarah Sechan NET TV 09.00WIB | Twitter Party &amp; Video Release (Youtube) 16.30 WIB. https://t.co/YsgKqcFS28 Wefie bersama adik-adik dari SDN 1 Kondas Flores NTT, dengan #TheGreatS8.\n•\nTunggu kehadiran… https://t.co/bGXsyzCaML 2 hari menuju peluncuran #DefinisiBahagia Piano Version disemua platform digital. Follow playlist saya di @SpotifyID https://t.co/hPPWO5jSfx My own version of #DefinisiBahagia.\n•\n2 hari lagi menuju peluncuran single Definisi Bahagia… https://t.co/OMZOaJRjio RT @_VIDIES_: Buru ditonton! Bagus bgt! Ngabuburit nya diajak Vidi ke Labuan Bajo, Pulau Komodo 💕💕 https://t.co/VSUGcNFwk4 VLOG baru sudah hadir : Perjalanan gw kmrn ke Pulau Flores! Check it out https://t.co/J1EmxOukDg https://t.co/QAhGAE8vkH #VAgoVLOG : A trip to Flores: https://t.co/vUPgVNQdG0 via @YouTube Keindahan alam tempat saya berdiri ini, akan saya abadikan dalam karya visual segera. Lagu… https://t.co/jbX3gljX8U Akan Live 2 lagu di Kampung Ramadhan @ Global TV sesaat lagi. Stay tuned kawan! Yuk @VidiesBandung dan sekitarnya, kita Bukber! Cek detailnya disini ya! #vidies https://t.co/m3W6zqQ9JJ Ngabuburit di Pulau Komodo setelah selesai shooting video #NewDefinisiBahagia bersama team… https://t.co/EtU1uSj21P RT @Globaltvseru: BESOK Kampung Ramadan meluncur ke Masjid PUSDAI Bandung! Dimeriahkan @VidiAldiano @BandArmada @GIGI_Band &amp; masih bnyk lg!… RT @Globaltvseru: Sabtu ini Kampung Ramadan meluncur ke Masjid PUSDAI Bandung! Dimeriahkan @VidiAldiano @BandArmada @GIGI_Band &amp;msh bnyk lg… Menunggu sahur dengan menonton kembali #VAgoVLOG edisi surprise ulang tahun saya, dengan… https://t.co/WqcpaMf93y That moment when your headache is finally gone. Selamat berbuka puasa untuk teman-teman Jakarta… https://t.co/Ors1VWGH9M Stream my latest single #DefinisiBahagia on @SpotifyID, or simply scan this spotify code! https://t.co/KrqBB9vlxX https://t.co/XgOW3gsex3 Thank you yang udah pada nonton di Komedi Sahur @TRANSTV_CORP! Selamat menjalankan ibadah puasa hari pertama! Selamat menjalankan ibadah puasa hari pertama kawan. Terima kasih sudah ikut berbagi… https://t.co/QVB0p0wjAL RT @vidies_sejati: Yay! Kak @vidialdiano akan menghibur sahur pertama loh #Vidies jangan kesiangan nanti sahurnya😝😁 https://t.co/XPJcROTSzE Marhaban Ya Ramadhan! Adik kakak ini siap menghibur sahur pertama dan pagi kalian! Bismillah! @VadieAkbar https://t.co/VzIXLyn77t With my fellow lads on the launching of \"Puyo &amp; Vidi Aldiano Peduli Anak Indonesia\"… https://t.co/oyZHKiHHZi Bismillah. Hari ini baru saja selesai photoshoot untuk surabayavidivinivici yang akan segera… https://t.co/n28S7Zb4eK Baru saja menyelesaikan press conference untuk program \"Puyo &amp; Vidi Aldiano Peduli Anak… https://t.co/yxpGuHCcxy I added a video to a @YouTube playlist https://t.co/jMAxsV7wSK ULANG TAHUN TER-\"BUDGET\" ULANG TAHUN TER-\"BUDGET\": https://t.co/jMAxsV7wSK via @YouTube Fix gue ngefans. https://t.co/s0XT0dXlTv I added a video to a @YouTube playlist https://t.co/wMWaklIHWN #VAgoVLOG reacts to TOP 10 BISKUAT AUDITION! VLOG baru sudah tayang dikanal Youtube saya!\n•\nYang mau liat TOP 10 Biskuat Audition versi… https://t.co/QfkiUcv7d2 Top 10 BISKUAT VIRAL VIDEOS, and how we react to it! https://t.co/wMWaklIHWN VLOG baru akan tayang sore ini pukul 16.30 WIB! Yuk turn on your notification &amp; subscribe to my channel: https://t.co/s3bQn2g2B3 https://t.co/TkdMRzuSfw Jdwl weekend ini :\nJumat (19/5): Vitacimin @ Mariott Medan 20.00 WIB. [Private]\n\nSabtu (20/5): Geekfest @ Siola, Surabaya 19.00 WIB. [FREE] My morning jam. @VadieAkbar #TanyaJadiRasa @SpotifyID https://t.co/nyHtGDN2vn Hehe maaf itu lagu adik saya, @VadieAkbar https://t.co/QxDUCaQZox Follow Vidi Aldiano di @SpotifyID, dan simply click link berikut untuk dengerin #DefinisiBahagia: https://t.co/KrqBB9vlxX RT! Senin pagi ini menyanyikan lagu Indonesia Raya diacara Musrenbang Polri 2017. Such an honor! @… https://t.co/U5GXRBdG9Y Siapa yang sudah nonton? Interview dengan @KapanLagicom bareng @VadieAkbar, super fun! https://t.co/9nVgkOELOe Konser Kisah Kita @vitacimin udah mulai di @Globaltvseru nih. Yuk stay tuned kawan. Jadwal hari ini :\n• Konser Kisah Kita @vitacimin @Globaltvseru 17.00 WIB\n\n• Perform @pikavenue 19.00 WIB. Free! See you guys later! https://t.co/g7pu4huYdA Malam minggu menghibur teman-teman Vitacimin Surabaya.\n•\nIni malam mingguku. Kamu? @ Wyndham… https://t.co/eNbaBp3oED Jdwl weekend : Sabtu (13/5), Vitacimin @ Surabaya. \n\nMinggu (14/5), Konser Kisah Kita @ GlobalTV 17.00 WIB &amp; Perform @ PIK Avenue 19.00 WIB Selamat malam mingguan, mblo. ❤️ @ Wyndham Surabaya https://t.co/xgUsOdIuRg RT @DAMAN_Magazine: Who do you think deserves to be in #DAMAN10TH best-dressed list? Here's @vidialdiano standing next to @absolutvodka, ou… Hahaha. Ayo dong kak @tommyprabowo ikutan #DefinisiBahagiaCover! https://t.co/PsEcSE78aN #DefinisiBahagiaCover https://t.co/gTLiaOF9l1 Caranya ada di IG gue. Bisa dapetin 3 ukulele special edition, and a chance to meet &amp; sing with me. Lets go! #DefinisiBahagiaCover Lagi bikin challenge utk cover lagu #DefinisiBahagia versi kalian nih bersama IndoMusikGram di Instagram! Yuk ikut! https://t.co/f0UbXVaDa6 Berdoa agar negara ini bisa tetap menjadi negara bhineka tunggal ika, yang tinggi toleransi &amp; diversity nya. Bukan negara golongan tertentu. Saat banyak orang yang menjadi antipati dengan sebuah golongan atau agama sendiri, \"keadilan\" ini jadi ga berasa adil kan? Sekarang lagi mau berbagi #DefinisiBahagia sama @vadieakbar, kak @carendelano &amp; tant...eh kakak… https://t.co/sUyVhx2G8T Live sekarang di Cerita Dewi Sandra , Trans TV! #DefinisiBahagia Terima kasih Vidies udah pada nonton @dahSyatMusik pagi ini. Semoga bahagia ya! #DefinisiBahagia https://t.co/K5seCnWfca Setelah #DefinisiBahagia, masih ada satu lagu lagi abis ini di @dahSyatMusik @OfficialRCTI. Hint nya, MAJOR THROWBACK! RT @dahSyatMusik: Ini dia prnampilan @vidialdiano \"Definisi Bahagia\" #JumatBahagia https://t.co/VCWDyJk1XS RT @FYAR_Fy: Pagi2 udah di ajak mendefinisikan kebahagiaan nihhh sm kak @vidialdiano 😍😍😍 #DefinisiBahagia @dahSyatMusik RT @ayuk_j: Batal ketemu dosen mending nonton kak @vidialdiano di @dahSyatMusik @OfficialRCTI #DefinisiBahagia RT @rizkiramadan205: Ini Yg Ditunggu2x Aku Banget Bener2x Definisi Bahagia Nih.. #JumatBahagia @vidialdiano  https://t.co/kdwad9ZXLI RT @dahSyatMusik: Jangan beranjak dulu yaa..hari ini kita kedatangan tamu istimewa @vidialdiano di #JumatBahagia 😁😁😁😁 https://t.co/6VL8fvRz… RT @pro2bdg: #NP @vidialdiano - Definisi Bahagia \n\n#Pro2MorningShow\n#ICUPro2FM_Raisyana_Rerun RT @debiiyyy: #DefinisiBahagia banget buat aku :) , pagi\" liat kakak kece @vidialdiano di @dahSyatMusik @OfficialRCTI #JumatBahagia :* :* &lt;3 RT @dahSyatMusik: Yuuk kita dengerin dulu nih \"Definisi Bahagia\" menurut @vidialdiano #JumatBahagia https://t.co/myB7hbzVLn RT @dahSyatMusik: Kita dengerin dulu definisi bahagia menurut para host dahsyat apa aja ya #JumatBahagia Selamat pagi kawan. Akan berbagi #DefinisiBahagia pagi ini di @dahSyatMusik @OfficialRCTI. Leggo! Selesai kerjaan hari ini. Besok pagi akan berbagi #DefinisiBahagia di @dahSyatMusik  @OfficialRCTI pukul 06.30 WIB. See you guys tomorrow! RT @Iradiojakarta: Sibuk promo #DefinisiBahagia dan juga jadi produser sang Adik, semoga @vidialdiano makin sukses ya! #10LaguKeren bareng… Sebentar lagi akan hadir merayakan ultah @mustang88fm bersama adik saya @VadieAkbar. Stay tuned! #DefinisiBahagia #TanyaJadiRasa https://t.co/e4tmmcQvis RT @TonightShow_NET: Definisi Bahagia by @vidialdiano menjadi penutup malam ini... terimakasih tonight lovers sudah nontooon 😁😁 https://t.c… RT @VadieAkbar: Malam ini jam 23.00 WIB, akan LIVE di Tonight Show @netmediatama bersama @vidialdiano, stay tuned ya! #TanyaJadiRasa #Defin… Selamat malam! Malam ini akan hadir di @TonightShow_NET brg adik saya @VadieAkbar pukul 23.00 WIB.\n\n #DefinisiBahagia &amp; #TanyaJadiRasa Selamat hari pendidikan nasional!\n•\nTerima kasih untuk semua guru dan dosen yang telah… https://t.co/XMKvdjtXIf Drtd pagi ga berhenti denger lagu karya adik sendiri. Bangga. @VadieAkbar dengan #TanyaJadiRasa \n\nhttps://t.co/zY0LJVIMfa Video lirik @VadieAkbar \"Tanya Jadi Rasa\" di https://t.co/c1lIOTQ60i\n\n• Spotify: https://t.co/zY0LJVIMfa\n\n• iTunes: https://t.co/16uzHMlrnV https://t.co/OWceAX6Byj RT @Iradiojakarta: wahh di lagu pertama ada @vidialdiano yesss..., Definisi Bahagia i-listeners, bareng @ermiliatania #10LaguKeren Besok, Vadi Akbar-Tanya Jadi Rasa akan rilis. Bismillah! Here's a little preview of his own song!\n\n@VadieAkbar #TanyaJadiRasa https://t.co/P1xnk6iBh9 Introducing the new #NMD that will launch tomorrow, 27 April 2017.\n•\nGet yours at… https://t.co/yQqGXG7nbo RT @pro2bdg: #NP @Vidialdiano - Definisi Bahagia \n\n#Pro2IndoRequest RT @Iradiojakarta: salah satu performance paling seru di Insert Fashion Awards 2017 semalam @vidialdiano DEFINISI BAHAGIA #10lagukeren @tom… RT @Iradiojakarta: Mungkin salah satu Definisi Bahagia - @vidialdiano itu bisa jalan-jalan ke Jepang brg sama teman-temannya #10LaguKeren b… RT @EBSFM: #LagiMuterin @vidialdiano - Definisi Bahagia  #ZonaKamu w/ Eqi RT @dutafm: #Playreq Definisi Bahagia @vidialdiano on #Petasan with @EbbyLessyl till 12.00 am @dutafm let's joint, guys #HappyWednesday RT @PissRadioCiamis: #NowPlaying: @GlennFredly &amp; Dewi Persik - Hikayat Cintaku, @vidialdiano - Definisi Bahagia #KOPI w/ @GitaDesera MD: @B… RT @Mradiosby: #MPlays @vidialdiano - Definisi Bahagia #DuoKepoShow w/ @duokeposurabaya RT @Cassanova102FM: #NP @vidialdiano - Definisi Bahagia | @nidji - Bila Bersamamu #SESIPRIBOEMI w/ DJ @antonw118 RT @Pro2Jak: #NP @V1MAST Cinta Itu Bisa Hilang\n@NDPCofficial Daylight\n@vidialdiano Definisi Bahagia\n#PanoramaJakartaPro2FM RT @KualaKencanaFM: #KualaIndo20 23 April | No. 15 | LW No. 18 | @vidialdiano – Definisi Bahagia | VA Records RT @VadieAkbar: Dua hari lagi akan me-release karya terbaru! Lagu baru. Dan Lyric Video baru. https://t.co/Msxi8njCWf Millennials be like... https://t.co/asboLnAJqm Cannot wait! Goodluck, Dek! @VadieAkbar #TanyaJadiRasa https://t.co/R5aEaibe03 Basic millennials.\n•\nStill rocking IFA 2017 with one more song. Stay tuned on Trans TV guys! @… https://t.co/rPEnppC8Sa Missin' Tokyo vibes already. But hey, I'm glad that I'm back home and ready to sing for you guys… https://t.co/UmQfMAFHOM Senang sekali bisa menghabiskan waktu di Jepang bersama sahabat-markom-mbak saya yang satu… https://t.co/fZsRngzc5t Selamat pagi Indonesia! Dan selamat pagi khususnya untuk semua wanita hebat yang sedang membaca… https://t.co/NijLX6Cj2I Sakura 🌸 @ Lake Kawaguchiko, Mt. Fuji https://t.co/Fs2AXr7RdR Menunggu detik-detik terpilihnya gubernur baru DKI Jakarta. Kira-kira siapa yang menang guys?… https://t.co/AuSV4faYcX Menikmati sakura sebelum sakuku rata.\n•\nGlad that I could still enjoy this beautiful view,… https://t.co/4qKNrqNYOv Saat teman-teman DKI Jakarta sedang bersiap untuk Pilkada besok, izinkan anak TangSel ini untuk… https://t.co/1xFeW2jtGi Wow. Bad boy alert.\n•\nMenikmati hari pertama di Jepang dan langsung ke DisneySea! Disneyland… https://t.co/xWZZH6Y9Pj Menghabiskan malam minggu ini bersama keluarga. Bagaimana dengan lo?\n•\nThis photo is taken for… https://t.co/HQnIY2PLt0 People said that an ideal prom night is to actually go and spend the night with someone special.… https://t.co/OQToMpOdGf RT @Google_IDN: Sekarang giliran @vidialdiano lawan @devinaaureel main ABC OK Google! Siapa jagoan kamu? Tonton→ https://t.co/M1zYdypRH9 #S… Thank you Anak Trax!!! #DefinisiBahagia https://t.co/ftHzBXnabE Ada isu bomb di Lotte Mall Bintaro sektor 9. Dan saya sedang berada didalamnya... -.- Brewin' something up with Google Indonesia and this AWESOME lady!\n•\nNantikan episode ABC OK… https://t.co/IApwiCOoBc RT @Google_IDN: Ini yg ditunggu! kayaknya @devinaureel bisa duet sama @vidialdiano nih! 😂  Penasaran? Teaser Ep.6→ https://t.co/JYDTdxZN2h… RT @KFCINDONESIA: Mau nyanyi bareng @vidialdiano ?  Yuk jam 5 sore ini ke acara #KFCZensasiZuper di Sarinah Parking Lot, Jakarta. https://t… Yeiy, see ya kawan! https://t.co/tQoNHhE5SO Schedule weekend ini:\n\nMinggu, 10.00WIB, Mangkal Bareng Prambors, Plaza Selatan Senayan GBK @Prambors https://t.co/K7bhdNsWt4 Schedule weekend ini:\n\nSabtu, \n\n10.00WIB: Seminar Kesehatan Nasional, BPPT\n\n16.00WIB: Visit Store KFC Sarinah https://t.co/mbcR356pu0 Touchdown!\n•\nSelesai bekerja di Frankfurt mewakili Indonesia di pameran Prolight Audio &amp; Musik… https://t.co/WSY44Lj4I3 RT @hz_foundation: #JumatBerkah Yuk masih ada waktu dukung Kak @vidialdiano berbagi kebahagiaan #UlangTahunVidi dengan donasi https://t.co/… TGIF kawan! Masih ada kesempatan untuk bersama Vidi membantu Misbah untuk meraih mimpinya, klik: https://t.co/G5YktblOe1 Baru saja update beberapa jadwal di Facebook, Instagram 'VAmanagement' dan website: https://t.co/UbkJnFjzkP, silahkan dicek ya #Vidies. Behind The Scene VIDEO: Ada penjelasan tentang konsep video klip #DefinisiBahagia dan orang2 hebat dibalik layar: https://t.co/2nqxkJVV5G RT @TraxFMJKT: Sebar keceriaan, @vidialdiano jadi jawara di #ChartJamu lewat single terbarunya \"Definisi Bahagia\"! #VisitTraxOnSky https://… Woohoo!! Thank you anak Trax! https://t.co/GeyCBqNahr Proud to be a part of the new Adidas NMD_R2 campaign that launched earlier today.\n•\nThis… https://t.co/Fyl8fHK5kp RT @_VIDIES_: Yang belum ada acara Sabtu ini, dateng yuk ke Seminar Kesehatan Nasional. Ada @vidialdiano sebagai Guest Star. Be there, guys… When you're getting ready for work, and you see a stair that Instagram-worthy.\n•\nSudah tahun… https://t.co/mgFVXp3yfa Hai happy anniversary #8thAnnivVidies https://t.co/psTXqg1rnv RT @nvhrf: @vidialdiano I hope u read dis and anyway happy anniversarry for us,Vidies😊\n#8thAnnivVidies https://t.co/iuH4FIrlsM RT @gandyss: @vidialdiano semoga bakalan ada trs anniv2 yg lain ya kavid! Sering2 ngevlog sm @adhrrf lagi 😅 sukses terus! 🙏 #8thAnnivVidies… RT @NesyaaSofiana: @vidialdiano konser spektakuler duo di balai sarbini,masih inget lucunya Vidi main biola mlm itu 😁 #8thAnnivVidies https… RT @NEVInettyART: Ngefans sm kak @vidialdiano dari rambutnya item gondrong (waktu jomblo) smpai skrng rambut nya warna pink (punya pcr )\n#8… RT @cinthyaputriy: @vidialdiano selalu jadi idola yang patut diidolakan ya kak vid :) hapoy anniv vidies.. Say hi to pku dong kak 😍 #8thAnn… Waaah more foto jadul! Thank you ya #8thAnnivVidies https://t.co/mSwkN5gxWq Happy anniversary #vidies genit! #8thAnnivVidies https://t.co/yfMILB5fLS RT @dewimaharanii15: Bawa bunga dari tangerang buat ka vidi &amp; setelah itu ka vidi langsung nyiumin terus karna suka sama wanginya😂🙋 #8thAnn… #vidies = keluarga. #8thAnnivVidies https://t.co/yb1FTr17w0 Terima kasiu juga udah selalu hadir dan support! #8thAnnivVidies https://t.co/7urhIqghC7 RT @feliciathaa: Saking keselnya selama jadi fans ny @vidialdiano  blm prnh ketemu, ampe akhirnya nulis diblog wkwk https://t.co/xKGyFsZjnE… RT @dewimaharanii15: #DefinisiBahagia bisa ngerayain ulangtahun idolaku &amp; ngasih bunga jauh-jauh bawa dari tangerang dan kaka suka😂 #8thAnn… Thank you yaa! #8thAnnivVidies https://t.co/hYfMeJwfzN RT @chieessaaa: Dr semua ksmpatan ketemu sm kaVid, paling berharga saat ini, 1st time foto bareng dan lgsg di reply huaaa ❤❤ #8thAnnivVidie… Waah terima kasih ya, sukses terus @Fidly_JKT48! #8thAnnivVidies https://t.co/i45je8Px5X RT @Papit_v3a: @vidialdiano Pertemuan keempat yg ngasih surprice pke dinodonut ,ngedadak bkin tulisan itu,yg kk seneng bnget,,\nInget kaan?… RT @PuteriyudhitaW: @vidialdiano kavidd, ga berasa ya udh kedelapan aja kita. Astaga dulu kayanya baru ngerayain 1st anniv😂😂. Btw #8thAnniv… Amin, terima kasih banyak yaa! #8thAnnivVidies https://t.co/mGzCOWoEWW RT @therealvidies: Thank you untuk twitter partynya malam ini @vidialdiano. Bahagia kan, vidies?Selamat malam dari Indonesia, Vid❤ #8thAnni… RT @utamichyntya: ini foto jam setengah 1 pagi di semarang, pertama kali ketemu. sejak saat itu suka nyamperin ke hotel walau sering gagal… Haha poni lempar! #8thAnnivVidies https://t.co/6NwONqDCKx Wah dihitungin banget! Thank you ya #8thAnnivVidies https://t.co/cdcaCmQHek RT @umi3_miumi: Harapan vidies terutama ak, semoga album lancar, tetep sayang vidies dan persiapan konser lancar sampai hari H @vidialdiano… RT @wahyudialdiano: Cuma satu lagi yang belum ku tiru. S2 keluar negeri. Semoga bisa sepertimu. Thankyou for inspiring me! #8thAnnivVidies… Thank you!! #8thAnnivVidies https://t.co/9H2Bb4xzsj Thank you sudah selalu men support karya Vidi ya, soon, nantikan ya Makassar! #8thAnnivVidies https://t.co/a4yHfFEFks Ya ampun, salam ya buat semua nya! #8thAnnivVidies https://t.co/xL08Rjgq0F RT @Papit_v3a: Alesan ngefans sm k @vidialdiano krna sllu memotivasi aku dr segi penddikan,nyanyi,gak neko2 dan krendhan hati nya... \n#8thA… RT @EkaMelindaNurSa: Harapannya tinggal satu, pengen bisa nyanyi sm kak @vidialdiano Gak cuma ngerekam aja. Entah kpn. Walaupun suara pas2a… Sudah hampir satu setengah jam, masih TT! Once again thank you ya #vidies! Susah banget sih nentuin siapa yg dapet oleh oleh #8thAnnivVidies Doakan lancar ya persiapannya #8thAnnivVidies https://t.co/YUfyCuPQAF Wah iya inget!! Thank you ya Malang! #8thAnnivVidies https://t.co/lySaFvhzLo Yes, thank you so much and cannot wait for the next journey with you guys! #8thAnnivVidies https://t.co/TxIgrhu4Io RT @Jeosephine: Happy Anniv! Kita msh tetep kompak dkung @vidialdiano nih walopun ud tahun ke 8 yeayyy! #8thAnnivVidies Nice! Thank you! #8thAnnivVidies https://t.co/8pjXxeZR1b Amin, terima kasih sudah menjadi inspirasi #Vidi juga ya #8thAnnivVidies https://t.co/xGxMOV23s1 Thank you! Happy anniversary yaa #8thAnnivVidies https://t.co/ds0pwT3OdS RT @naritafuji: di tahun ke-8 ini, semoga selalu jadi #DefinisiBahagia aku ya :D kak @vidialdiano #8thAnnivVidies RT @ann_aisyah: Cieee TTI #1 niiih~ jadi ingat 8 atau 7 tahun lalu tembus worldwide hihihi #8thAnnivVidies congratulation for US. @vidialdi… Amin, thank you! Terima kasih juga sudah jadi inspirasi Vidi ya! #8thAnnivVidies https://t.co/2xSVUu7SnW Yuk ngumpul yuk! #8thAnnivVidies https://t.co/waPF1QAfo2 Nice idea! Kalo ada pasti akan dikabarkan ya #8thAnnivVidies https://t.co/uDUWqUN1hs RT @Rizka_39: Sllu emosional klo soal vidies, ttap berkarya @vidialdiano agar terus memberi dampak positif bagi kami #8thAnnivVidies :) Harapannya #vidies tetap kompak, selalu mensupport karya Vidi, sehat sehat semua, dan tetap menyenangkan! #8thAnnivVidies https://t.co/GBfQhlfNJo Terima kasih Bali! Happy anniversary ya #8thAnnivVidies https://t.co/PqgkCL9z4f Kompak selalu yaaa! #8thAnnivVidies https://t.co/SISvVy5dJv Waah terharu, berapa lama nih ngumpulinnya? Thank you ya #8thAnnivVidies https://t.co/376CsJuD9r Ciye @adhrrf tuh, siap nantikan #VAgoVlog selanjutnya ya #8thAnnivVidies https://t.co/TFsqz34wEl See you soon! #8thAnnivVidies https://t.co/3QSdeOH53U Amin, nantikan ya, nanti hadir klo InsyAllah gelar konser #8thAnnivVidies https://t.co/GbbiM3mXBO RT @FYAR_Fy: Inget semua tanggal ketemu kak @vidialdiano dr dlu ampe sekarang! Selalu di tulis hihi ❤ #8thAnnivVidies Wah maaf banget ya, super ramai nih hehe anyway happy anniversary #8thAnnivVidies https://t.co/gZDM1RzUXW RT @sinonomecha: @vidialdiano aku bener bener bahagia\nWaktu ketemu kak vidi.. Niat banget nunggu sampe jam 8,padahal belom makan dari siang… Kompak selalu ya! Ciye masuk TV #vidies! #8thAnnivVidies https://t.co/77XmziT3qX Iya inget Aceh! Thank you ya, happy anniversary #8thAnnivVidies https://t.co/1ATrmZ56JU Mewakili bangsa Indonesia di Frankfurt bersama si 'pendiem'. Assalamualikum mas nya. Diem… https://t.co/MGKwn7wZpB Amin, tetap semangat ya! Thank you sudah jadi inspirasi Vidi juga #8thAnnivVidies https://t.co/oQOUHGSj1i Hahaha kocak! Thank you ya. Happy anniversary #8thAnnivVidies https://t.co/jEYIaN3E47 Ya ampun jaman masih pake behel! #8thAnnivVidies https://t.co/sQ8SGXGtVs Inget! Happy anniversary Jember! #8thAnnivVidies https://t.co/KXNS354maE Waah salam yaa #8thAnnivVidies https://t.co/0IorINjvgK Happy anniversary yaa #8thAnnivVidies https://t.co/mh9n2dFN7n RT @nelapurani: Cerita seru ngelive @vidialdiano: https://t.co/JCNAJMBsyr 😍 Tragedi nitip helm ke mbak2 ga dikenal 😅 #8thAnnivVidies Thank you for the support! #8thAnnivVidies https://t.co/SAg1SYtr6i Amin! Thank you ya #8thAnnivVidies https://t.co/9G3eAHXM4j Haha puisi dari lagu ya, nice one! Thank you ya #8thAnnivVidies https://t.co/quMH3dHqCr Gak pernah bosen! #DefinisiBahagia buat Vidi, thank you ya #8thAnnivVidies https://t.co/ZZXeXiInt6 RT @thalia_ds: KeluargaAldiano foto 1 mama Vs vidi,2:Papa Vs Vidi (Candid),3:Saya Vs Vidi,4:Abang Vs Vidi @vidialdiano #8thAnnivVidies kami… Wah keren! Thank you ya! #8thAnnivVidies https://t.co/BBoFHpnZET RT @ummygalihmunaww: @vidialdiano baca lagi ya kak😂😂 ini part #DefinisiBahagia gw sih kayanya HaHa #8thAnnivVidies https://t.co/WZMjlO4c1I Sudah dibaca, thank you ya #8thAnnivVidies https://t.co/VVPZiHwRfo RT @inggitap: Jadi #Vidies krn ptama kl dgr lagu @vidialdiano Pelangi Dimalam Hari kayaknya ngerti banget prasaan saya saat itu #8thAnnivVi… RT @vidies_sejati: Wah seru ya lagi bagi bagi pengalaman selama #8thAnnivVidies ayo semua tweet dan kirim ke kak @vidialdiano 😁 wish you lu… Sama sama ya thank you juga. Happy anniversary #8thAnnivVidies https://t.co/7dJzTbFWOL Ah iya inget! Happy anniversary ya #8thAnnivVidies https://t.co/NLBky09zWq Terima kasih sudah menjadi inspirasi Vidi ya! #8thAnnivVidies https://t.co/hOGJobLvDA Haha tuh @adhrrf cetar katanya. Thank you ya #8thAnnivVidies https://t.co/vJYXQAbGls Nice memories, thank you ya, happy anniversary #8thAnnivVidies https://t.co/qqW00es2uY Belum telat kok hehe #8thAnnivVidies https://t.co/JylwpB1uQx Waah nice banget nih, saling membantu, sesama keluarga #vidies! #8thAnnivVidies https://t.co/OV9VQnMGNW Haha jadi puisi ya #8thAnnivVidies https://t.co/LT0QUlni4n Alhamdulillah, thank you ya Wahyu! #8thAnnivVidies https://t.co/Cw8or8dxTP Amin, yes selalu menyenangkan #vidies! #8thAnnivVidies https://t.co/nMAGSJr517 Hai Manado, see you soon, happy anniversary #8thAnnivVidies https://t.co/5wfHl1Q7UA Haha happy anniversary ya, thank you #8thAnnivVidies https://t.co/HwLzS0OJfX RT @ummygalihmunaww: @vidialdiano gw jg inget bgt dulu ada Sekolah Vidies di FB &amp; gw jadi salah satu gurunya di grup Pelangi Dimalam Hari😂😂… Nice, salam ya buat semuanya #8thAnnivVidies https://t.co/jBQkLvLC5C Thank you ya #8thAnnivVidies https://t.co/FmQrcJ1cu2 Happy anniversary ya #8thAnnivVidies https://t.co/mo3niME2Mv Happy anniversary Solo! #8thAnnivVidies https://t.co/HPnECq9Loo Haha serius? Siapa? Makin bocor deh nih #8thAnnivVidies https://t.co/MLJlkn38cH Yes, semoga selalu kompak ya guys, love you all! #8thAnnivVidies https://t.co/eCXhlei4Ye Haha super rame! #8thAnnivVidies https://t.co/2MAZ9turpL RT @Chembberkevds_: Salah satu ter-serunya saya selama menjadi Part of vidies. Pertamakali bertemu kalian❤ Sutos, 13 Juli 2013. #8thAnnivVi… Wah serius? Terharu banget perjuanganya, thank you ya #8thAnnivVidies https://t.co/nLeFEV0U06 Haha mbak mbak nya menjiwai kali ya, happy anniversary #8thAnnivVidies https://t.co/UUTZMOfwef Thank you! Proud to have you guys! #8thAnnivVidies https://t.co/kAN1M7uKrW Soon pasti! #8thAnnivVidies https://t.co/RvooVTzYkr Wah baru ketemu dong ya kita. Amin, nantikan karya selanjutnya #8thAnnivVidies https://t.co/2IR91sPXph Keluarga suportif, nice, happy anniversary ya #8thAnnivVidies https://t.co/mj71wzDzSR Terima kasih, see you soon Surabaya! #8thAnnivVidies https://t.co/d94Rgm5nCm Thank you, happy anniversary ya! #8thAnnivVidies https://t.co/62RuKFfO0X Amin bisa ketemu, see you soon ya! #8thAnnivVidies https://t.co/IqAITQnW5Y Ohiya? Kelas Vidies dimana? #8thAnnivVidies https://t.co/5hJsPJMbQx RT @Nadyasabrina8: Pengalaman jadi Vidies itu, udah 4 kali liat kakVid secara lngsung, 2 kali berjabat tangan, 1 kali foto bareng @vidialdi… Thank you for always being here ya #8thAnnivVidies https://t.co/avoy5H5wYm Kapan libur lagi? Haha #8thAnnivVidies https://t.co/PajNOKtjKO RT @FYAR_Fy: Inget bgt pas pertama suka kak @vidialdiano itu di acara musik Klik ANTV (msh jaman2 nuansa bening) 😂😂😂 #8thAnnivVidies Btw, udah trending topic nomer 1 ya? Whoaaa the power of #Vidies, gokil! Keep up! #8thAnnivVidies Thank you Surabaya! Sampe gak keliatan Vidi mana, nice! #8thAnnivVidies https://t.co/raJYxGpshF Itu lambang love kan ya? Haha happy anniversary #8thAnnivVidies https://t.co/K1wZ7P3p4z Super rame! #8thAnnivVidies https://t.co/YGM6oY5Bfv Haha thank you ya #8thAnnivVidies https://t.co/UVZXCpir55 Alhamdulillah, terima kasih ya #8thAnnivVidies https://t.co/M5tSTIvaMB Thank you, happy anniversary ya #8thAnnivVidies https://t.co/iI7ZGseFw7 RT @Rizka_39: Awal suka sama @vidialdiano karena MV Status Palsu, gak nyangka ampe #DefinisiBahagia masih setia #8thAnnivVidies Haha eh jangan lupa belajar ya, selamat UN #8thAnnivVidies https://t.co/HSMyxkcIpF Happy anniversary #Vidies Bandung! #8thAnnivVidies https://t.co/gDWJmOWSsm Siap sudah baca, thank you ya perjuangannya #8thAnnivVidies https://t.co/Nzdik9dffO Di Frankfurt sekarang sekitar jam 2 siang, happy anniversary ya! #8thAnnivVidies https://t.co/ogMFG7cMWW Iyes super seru! #8thAnnivVidies https://t.co/NlZ41DREvZ RT @Septianaahmad: Ini moment ditangcit vid hehe #DefinisiBahagia #8thAnnivVidies selamat party vid!! @vidialdiano https://t.co/H5q5nI9ZGl RT @debiiyyy: Slalu dikawal sama mama setiap mau ngelive kak @vidialdiano . Smpe akhirnya mama aku juga hafal smua lagu\" kakvid :) #8thAnni… Iya gak kerasa udah 8 tahun! Selamat mau wisuda ya #8thAnnivVidies https://t.co/tNAKr7bx7J Nice, silahturahmi ya #8thAnnivVidies https://t.co/BY0rajRsVg Happy anniversary to you too! #8thAnnivVidies https://t.co/mJXUXjLwkF Nice, thank you ya, see you soon! #8thAnnivVidies https://t.co/9npu1KLdLW RT @therealvidies: Merapat merapat! Sudah mulai sejak beberapa menit yang lalu nih party twitter #8thAnnivVidies @vidialdiano RT @mitharizkytas: Pas masih SMA. Dari Solo ke Semarang naik bus sendiri! Dan finally ketemu @vidialdiano for the first time. Ini nekat vid… Ya ampun iya masih inget saat saat ini. Thank you ya udah nekat! #8thAnnivVidies https://t.co/HahxqFGSYb Amin ya Allah, thank you ya for the endless support! #8thAnnivVidies https://t.co/rya351erCc Waah nanya nanya tentang apa? Salam ya buat ayahnya #8thAnnivVidies https://t.co/GlenLxyYAS Ciyeeee, eh yah udah putus deng. Gapapa jadi kenangan #8thAnnivVidies https://t.co/pySymZUsI5 Yes setuju, #vidies adalah keluarga baru Vidi, thank you guys! #8thAnnivVidies https://t.co/pk49tMnvsY Belum ketinggalan, yuk! #8thAnnivVidies https://t.co/LpiDD1gRPs Haha salam buat mamanya dari Vidi ya! #8thAnnivVidies https://t.co/MOmw2LSTpJ RT @umi3_miumi: pertama kali real jadi vidies saat ketemu vidi pertama kali dimalang selama 6 thn ngefans dan bsoknya lgsg UAS @vidialdiano… RT @Papit_v3a: @vidialdiano 8th yg llu it tptnya pas aku msih smp masih olo leho sampe zmannya chili2an,masih ngfans sm yg nmny vidialdiano… RT @EkaMelindaNurSa: Waktu anniv di Santorini, pundak aku pernah dipegang kenceng sm Vidies dibelakangku pas kak @vidialdiano ngasih aku mi… Sudah dibaca, terharu dari Bandung ke Bekasi! Semangat terus yaa, happy anniversary #8thAnnivVidies https://t.co/bmnHQp7Cta Aaaw so sweet, thank you yaaa #8thAnnivVidies https://t.co/27wZU5gThz Amin! Kalian adalah #DefinisiBahagia Vidi, kawan! #8thAnnivVidies https://t.co/yvRAmqmIQb Wah banyak, pedekate sama mas Ali juara sih! Happy anniversary ya!  #8thAnnivVidies https://t.co/lSyAOJkyxW Happy  #8thAnnivVidies Makassar! https://t.co/NkrCXjy5Sd Haha tetap berhati hati ya!  #8thAnnivVidies https://t.co/W5djM8KQBu Happy Anniversary!  #8thAnnivVidies https://t.co/Z1tpitHjmG RT @fitbaaldiano: Kebersamaan . Semoga gw bisa selalu support dan dukung lu dimanapun kapanpun ya ka @vidialdiano 😊😊 #8thAnnivVidies https:… Yes, kebersamaan, #vidies adalah keluarga baru yaa  #8thAnnivVidies https://t.co/IpcsIzAcU3 Nice, salam untuk mamanya ya.  #8thAnnivVidies https://t.co/xv7SIrQ3pn Ya ampun beneran sampe manjat pager? Terharu! Thank you ya, happy anniversary  #8thAnnivVidies https://t.co/WTuQXmsvZj #8thAnnivVidies twitter party dimulai! Kasih tau Vidi pengalaman terseru selama jadi #vidies, atau ucapan juga boleh. Pokoknya twit terseru! Nice!! Thank you!  #8thAnnivVidies https://t.co/CFSTN0M8hB Sbntr lagi 18.30 WIB kita twitter party #8thAnnivVidies. Twit pengalaman seru selama jd #vidies. 2 org terseru akan Vidi kasih oleh2 hehe RT @_VIDIES_: Reminder, Vidies! Can't wait! Wohooo #8thVAnnivVidies https://t.co/IloM12SLYr Happy anniversary yaa! #8thAnnivVidies https://t.co/bmsxQZJOS2 Haha nice! Nanti yaa tahan jam 18.30 twit lagi kita twitter party! #8thAnnivVidies https://t.co/7pSMXX0Sb2 Special! Krn anniversary &amp; so sorry Vidi lagi di Frankfurt, 2 twit dgn alasan terseru akan Vidi beliin oleh2 dr sini, yes! #8thAnnivVidies Happy anniversary to you! #8thAnnivVidies https://t.co/1WnPMTZvHj Nanti jam 18.30 WIB kita twitter party ya #Vidies! Twit apa pengalaman paling seru kamu selama jadi #Vidies pake hashtag #8thAnnivVidies Tepat 8 tahun yang lalu #Vidies lahir, orang - orang yang selalu mengapresiasi karya Vidi.\n•\nGak… https://t.co/PwOCkcbxh0 Alhamdulillah terima kasih yaa #8thAnnivVidies https://t.co/C91Ynkk5T7 Aaaw thank you yaa! #8thAnnivVidies https://t.co/BvJHX4pRgb RT @EkaMelindaNurSa: Selamat 8 tahunan! Klo kata @vidialdiano hari ini harinya kami nge-greet dan di-greet yaa ke sesama temen yg biru2😁💙 #… RT @danangrudii: Dulu pertama kali suka sama lagu @vidialdiano sejak jaman SMP sampe skrng udh lulus kuliah msh tetep nge fans sama lagu2 d… RT @danangrudii: Congrats ya vid! Terakhir ntn konsermu di semarang hampir setahun lalu. Moga nextime konser di semarang lagi ya #8thAnnivV… Wah thank you broh! Lanjut sampe kakek kakek nanti ya! #8thAnnivVidies https://t.co/rfUkCRe0re Thank you Jateng! #8thAnnivVidies https://t.co/bTgPJWlZNk RT @VidiesBandung: Happy Anniversary #Vidies !!! Terus kompak untuk support @vidialdiano terus, Vidies love you Vid !! #8thAnnivVidies RT @mutiaradelima1: Happy anniv vidies semoga makin kompak dan jaya selalu🙌sukses kak @vidialdiano #8thAnnivVidies RT @mutmainnah654: Happy #8thAnnivVidies trus dukung super singer @vidialdiano, stay cute, stay kompak dan positif thinking selalu! :) Waah kapan ini? #8thAnnivVidies https://t.co/aajmKoRHWu RT @dewimaharanii15: Happy anniv ke 8thn yaa #Vidies semoga selalu kompak dan selalu support @vidialdiano yeaaay👋👋 #8thAnnivVidies Whoaa #8thAnnivVidies udah trending topic ajaaa?! The power of #Vidies! #8thAnnivVidies Nanti sore jam 6-7an WIB gitu kali ya! #8thAnnivVidies https://t.co/LqnPGHgGRP RT @therealvidies: Sore nanti, biasanya @vidialdiano akan ngadain twitter party! Tungguin yaah #8thAnnivVidies Waah amin bener banget filisofinya! #8thAnnivVidies https://t.co/gwRDmJmWwg Amin! Thank you ya! #8thAnnivVidies https://t.co/xan7r3fRz1 RT @debiiyyy: Happy Anniv Vidies :* gak brsa 8thn udh brlalu dan msh setia smpe detik ini sama kak @vidialdiano  #8thAnnivVidies https://t.… RT @therealvidies: Happy #8thAnnivVidies untuk seluruh #Vidies yang ada di Indonesia.  Kompak terus dan selalu dukung @vidialdiano ya❤ Sorean nanti kali ya kita twitter party? #8thAnnivVidies https://t.co/7U02YkBC4t RT @andimaryandi_: @vidialdiano Happy Anniversary Vidies makin solid , kompak dan slalu support @vidialdiano #8thAnnivVidies Amin, selalu kompak yaa! #8thAnnivVidies https://t.co/FUgByx3ek8 Selamat Pagi Indonesia! Hr yang special karena supporter terbesar saya merayakan hari jadinya. Happy Anniversary Vidies! #8thAnnivVidies Wait, besok 4 April #vidies anniversary ya? Waaah pake hahstag apa ya kita besok untuk twitter party? #DefinisiBahagia RT @bintangcomID: Ultah, @vidialdiano  Ajak Fans Galang Donasi di @kitabisacom https://t.co/6TVpvMoQkY #BintangBerbagi https://t.co/UjPc9g4… RT @liputan6dotcom: #Liputan6Berbagi @kitabisacom Rayakan Ultah, @vidialdiano Galang Donasi Pendidikan\nhttps://t.co/Zv2tIOKZdr https://t.co… RT @liputan6dotcom: #Liputan6Berbagi\nYuk, ikut berbagi bersama @vidialdiano untuk galang donasi pendidikan melalui @kitabisacom. https://t.… RT @RapplerID: Ingin memberikan kado ulang tahun untuk @vidialdiano? Lakukan ini saja: https://t.co/JxVLGs8paX https://t.co/NjkBL0LpWb Masih belum bisa move on dari video klip #DefinisiBahagia! Salah satu video klip favorit Vidi, setuju? Klik disini: https://t.co/GyrOrgd2wL Sudah kembali lagi ke bandara. Kali ini siap2 ke Frankfurt untuk pameran tahunan V8 Sound di Messe. Wish us luck! Yes masih ada kesempatan untuk berdonasi untuk pendidikan Misbah dlm rangka #UlangTahunVidi minggu lalu, yuk kawan! https://t.co/G5YktblOe1 https://t.co/rtCROoIrNL RT @Iradiojakarta: Penyanyi @vidialdiano berencana untuk menggelar konser tunggal yang akan menjadi perayaan perjalanan kariernya selama 10… RT @bintangcomID: Ultah, @vidialdiano Ajak Fans Galang Donasi di @kitabisacom #BintangBerbagi https://t.co/b0BW5f5HcR https://t.co/ERZFbnkX… Hadiah terbesar di hari #UlangTahunVidi kemarin, adalah waktu kumpul bersama orang-orang… https://t.co/RHgnpGs8k4 Thank you! Yuk bantu adik Misbah teman2! Masi ada waktu 9 hari lagi untuk berdonasi :) https://t.co/Z1fNhjxv49 Terima kasih tak terhingga atas semua ucapan, doa dan support dari kawan semua. Hari ulang tahun… https://t.co/f2hm2CiFUt Thank you Breakout! #UlangTahunVidi https://t.co/9p01afrTKU Thank you guys!! Thank you for the support!! #UlangTahunVidi https://t.co/mJc3125zGX RT @Iradiojakarta: IListeners lbh suka menikmati lagu2 Vidi via digital atau album fisik? Nah, menurut @vidialdiano dari media apapun boleh… Woohoo!!! https://t.co/05FBSfIsCp Siap2 di @Iradiojakarta, karena #UlangTahunVidi akan hadir di I radio yang ulang tahun juga hari ini!! https://t.co/WC7dC4qu8k Thank you Sharon! #UlangTahunVidi https://t.co/qGUL3PjHFp Thank you Vidi KW di video clip #DefinisiBahagia haha #UlangTahunVidi https://t.co/krUfCxO4T4 RT @EkaMelindaNurSa: Ada balon ditimeline nya @vidialdiano , digue ada nggak ya mei nanti? #ulangtahunvidi #27thVidiAldiano https://t.co/nV… RT @tengkushafick: Bro @vidialdiano Happy Birthday! Wish you nothing but the very best!! Partyyy ditunggu 💃 #UlangTahunVidi #DefinisiBahagia Amen to that! Thank you so much bro! Haha ditunggu ya partynya! #UlangTahunVidi https://t.co/oXnJ8mzAUY Terima Kasih Mara FM! #UlangTahunVidi https://t.co/DJMNHb8ncx RT @ShofaNurAisyah: hbd kak @vidialdiano, smg pnjng umur, sht selalu,  semakin syg sm ortu, dan smg smkin sukses #UlangTahunVidi 🎉🎁🎈🎂 Amin ya Allah, terima kasih yaa #UlangTahunVidi https://t.co/5Jq9F2gyGn RT @hz_foundation: Yuk, dukung @vidialdiano berbagi kebahagiaan untuk pendidikan Misbah di #UlangTahunVidi! https://t.co/nKBjcWowar RT @hz_foundation: Yuk kita dukung Kak @vidialdiano berbagai kebahagiaan #UlangTahunVidi untuk Misbah! klik linknya! https://t.co/aQWnYrNw5q RT @realpipit_99: Happy Birthday kak @vidialdiano semoga menjadi insan yg lebih baik, dan sukses selalu untuk karir kaka #UlangTahunVidi And to the icing of my cake today on #UlangTahunVidi, are my musketeers! Akhirnya setelah sekian… https://t.co/YmAxWtJNIv Amin, terima kasih ya sudah support jadi #DefinisiBahagia juga hehe #UlangTahunVidi https://t.co/o1ize3vfcA Niceee! Thank you ya #UlangTahunVidi https://t.co/VXJApaEVf4 Amin, terima kasih bro! #UlangTahunVidi https://t.co/bcZQdhuNF7 Amin ya Allah! #UlangTahunVidi https://t.co/XhAEiSCZ0d Om om banget? Haha terima kasih yaa! #UlangTahunVidi https://t.co/Ol11hFaJTG Terima kasih @kitabisacom, senang bisa berkerjasama, sukses terus! Btw silahkah diklik kawan https://t.co/G5YktblOe1 #UlangTahunVidi https://t.co/zlA0Hb68Oy Bersyukur karena banyak yang support bermusik, karir, dan project, dan yes salah satunya ini hehe Terima kasih Tribune News #UlangTahunVidi https://t.co/YZp2eouheP Amin, terima kasih yaaa #UlangTahunVidi https://t.co/xfxeqiFyCf Hahaha next berarti kita ketemu harus foto bareng ya, terima kasih banyak mas Iwet! See you soon! #UlangTahunVidi https://t.co/or3ufoUgEn Didatengin kado special juga dari Bandung, yang ngumpet dalam kardus, trus muncul pake pita… https://t.co/Z35nn3RC8C Merayakan pergantian umur semalam bersama orang-orang yang menjadi #DefinisiBahagia terbesar… https://t.co/YyL3fY1ObP Wah serius samaan? Happy birthday to you too bro! Thank you! #UlangTahunVidi https://t.co/QCZEIhUb5a Mas Adib! Terima kasih sekali! Selalu support dari awal &amp; memberikan masukan, have a nice day mas! #UlangTahunVidi https://t.co/3OEIFTTPfn RT @stifaniraharjo1: @vidialdiano selamat ulang tahun kak vidi, semoga panjang umur sehat selalu suksessss terus dalam berkarir, amiinn🙏😊 #… Terima kasih mas Didiet! One of my best supporter! Wah mas Didiet yang selalu menjadi inspirasi hehe. Thanks once again mas #UlangTahunVidi https://t.co/Hx9degEIQ8 RT @Adlynezee: Yeay happy bornday Kak @vidialdiano inspirasiku dlm pendidikan! Always berkarya &amp; bermusik. Keep humble ya kak.  GBU #UlangT… RT @vidies_sejati: Selamat pagi! Jangan lupa request #DefinisiBahagia @vidialdiano di radio kesayangan kalian ya! 😁 RT @AdhityaNoor: kak vid @vidialdiano, happy birthday 🎉🎉🎉 semoga yang diinginkan tahun ini tercapai semuaaaa 🎉🎉🎉🎉 #UlangTahunVidi Amin, thank you untuk selalu mendukung ya #Vidies! #UlangTahunVidi https://t.co/sQZ2IlG8ND Apakabar bro? Amin amin aja deh hehe #UlangTahunVidi https://t.co/9em31Dy8LM Haha Amin, thank you ya! #UlangTahunVidi https://t.co/mM4x3ZWFbY Amin, doakan segera konser yaa! #UlangTahunVidi https://t.co/7vwaagghWk RT @VidiesJateng: Yang paling penting makin sukses kariernya, dilancarkan semua semuanya. Amin ya rabb. Happy birthday @vidialdiano 🎉 #Ulan… RT @DewiNurisyanah: Happy birthday ka @vidialdiano semoga panjang umur, sukses buat karir'a, di limpahkan rejeki'a dan lancar segala urusan… RT @fevy_bemyself: @vidialdiano Med MiLad ya Vidi,Sukses slalu utk mu,wish you all the best #ulangtahunvidi Amin, insyAllah akan terus berkarya! #UlangTahunVidi https://t.co/WdgrueFMPb RT @Hanit_najia: Hbd @vidialdiano semoga karirnya makin maju,cepet ketemu jodoh,semua yang diharapin bisa tercapai. Kapan main ke malang ?… RT @shady2brandals: Hoping @vidialdiano birthday is as heavenly as you are! You deserve only the finest today and all year long! h... https… Woohooo! Keep it coming guys! #UlangTahunVidi https://t.co/hLzUkuJl6L RT @AsraIswanto: Hbd kak @vidialdiano pnjng umur,sht slalu &amp; ditunggu trs karyax untk musik INA\n#UlangTahunVidi Haha iya nih 27 banget! Thank you ya! #UlangTahunVidi https://t.co/m7SbkJ7BxB RT @Gede_Prestiwana: Selamat ulgthn kak @vidialdiano smoga karir nya sukses terus, wish you all the best dehh pkoknyaa #UlangTahunVidi Amin ya Allah, terima kasih ya #UlangTahunVidi https://t.co/u5grB4piaU RT @R4putri20: Happy birthday ka @vidialdiano semoga apa yang diinginkan dan diharapkan bisa tercapai dan selalu dlm lindungan Allah. Amin… Waah tahun berapa ya ini? #UlangTahunVidi https://t.co/DeuAjiOx1b Thank you ya selalu support! #UlangTahunVidi https://t.co/aqByzps1Cg RT @funnyvaany: selamat tambah tua kak @vidialdiano \nSemoga apa yg disemogakan segera tercapai dan terkabul 🙏 Tuhan memberkati. \n#UlangTahu… Aminn, Terima Kasih Semarang! #UlangTahunVidi https://t.co/wY43FBzzaa Wah bahasa Korea ya ini? Thank you yaa! #UlangTahunVidi https://t.co/k26WK7YyGx RT @filzaaaaa: Happy born day kak @vidialdiano ,, semoga sukses dan berkah selalu dunia akhirat ,, amin 😇🙏🏻💕 RT @Chembberkevds_: HAPPY BIRTHDAY KAK ❤ Sukses segala yg dicita-cintakan! Proud of you kak! Loveyouuu dr thn 2009 tak berubah ❤❤❤❤ #UlangT… Amin cemerlang. Nantikan ya Surabaya! #UlangTahunVidi https://t.co/OGPTtezA5p Amin ya Allah, doakan ya selalu ya, terima kasih! #UlangTahunVidi https://t.co/zgmhxHc8F9 RT @euisnurfa: Happy birthdayyyy kakk @vidialdiano 😊🎉🎂🎁 Be better than before! Semoga panjang umur, sehat dan bahagia selalu. #UlangTahunVi… Waah thank you ya pake balon segala hehe #UlangTahunVidi 🎈 https://t.co/aJ6Vst0R9c Amin, terima kasih ya. Ya ampun Vid muka Vid haha #UlangTahunVidi https://t.co/i7nRnm2Za2 Thank you Cibubur! #UlangTahunVidi https://t.co/v3MtehFBx9 RT @SandistyaSusan: Biarpun umur sudah bertambah tp jiwanya masi umur 17 tahun ya ka @vidialdiano selalu jd #DefinisiBahagia Vidies ya ka..… Pasti dong! Amin, thank you ya #Vidies  #UlangTahunVidi https://t.co/0FNAoFW1RW Ah seru banget! #UlangTahunVidi https://t.co/tJx2lmIiLW Amin, GBU you too! #UlangTahunVidi https://t.co/t9gaU2h9YG RT @Zahra_Hira: Happy birthday kak @vidialdiano semoga panjang umur, sehat slalu, bahagia slalu dan semakin sukses karirnya! 🎉💖 #UlangTahun… RT @Estrikinasih_3: Selamat Ulang Tahun kakak @vidialdiano , semoga apa yg diinginkan pada tahun sblumnya bisa tercapai ditahun ini. 🎉🎊🎂 #U… Terima kasih dan amin doanya deh nikah haha #UlangTahunVidi https://t.co/6DOYlXDGEg RT @ervitaanggraini: @vidialdiano semoga Vidi bahagia sehat sukset S3 nya bisa segera terlaksana bisnisnya semakin sukses album2nya terus n… Siap! Thank you #vidies selalu supportnya! #UlangTahunVidi https://t.co/QRCt8IiZVa Whoaa seru balon balon! Thank you 🎈 #UlangTahunVidi https://t.co/TuuKOh79rm Terima kasih, nantikan ya Jogja! #UlangTahunVidi https://t.co/UFky10PRfB WOW udah trending topic #UlangTahunVidi, thank you, kawan! Yuk keep tweeting! Btw, visit twitter Vidi deh, ada balon balon gak? Seruu! RT @ervitaanggraini: @vidialdiano Semoga Vidi slalu bahagia sehat slalu sukses dunia akhirat semoga segera diresmikan ya Vid #UlangTahunVidi Amen! Thank you mabro! Ini partner siaranya @adhrrf bukan sih? Haha #UlangTahunVidi https://t.co/pWT8w359Io Amin, terima kasih ya support nya! #UlangTahunVidi https://t.co/LyeNq0Km5q Thank you #Vidies! #UlangTahunVidi https://t.co/LrKC7RQL3U RT @Nurull16_: HBD kak @vidialdiano semoga panjang umur, sehat selalu #UlangTahunVidi Aminnn, thank youu #UlangTahunVidi https://t.co/jwynml6Du3 RT @ifahAN_17: Selamat ulang tahun kak @vidialdiano Semoga panjang umur,sukses selalu,,pokoknya doa terbaik untukmu👌👏 #UlangTahunVidi RT @babyrany: @vidialdiano Selamat Ulang Tahun Vidi! Semoga panjang umur, sehat selalu dan sukses terus karirnya ! 😘 #UlangTahunVidi Amin, terima kasih ucapan dan doanya! #UlangTahunVidi https://t.co/KCUE20RVKl Ya ampun 8 tahun lalu ya gak berasa. Thank you! #UlangTahunVidi https://t.co/IUeuQb8r4B Undangan apa nih? Haha Terima Kasih yaa #UlangTahunVidi https://t.co/HB2lbS3mh4 Wah amin banget ini, doakan yaa #UlangTahunVidi https://t.co/BYBuTdh62o Nice!! Thank you ya #UlangTahunVidi https://t.co/fvl7ctlHjt Amin, terima kasih doanyaa #UlangTahunVidi https://t.co/BXyn13YOrW Terima kasih yaa untuk ucapan dan doanya! #UlangTahunVidi https://t.co/n5LVdIxCLG Amin ya Allah, ya ampun foto kapan ini haha #UlangTahunVidi https://t.co/g2DVEG9zUR Amin, thank youu #UlangTahunVidi https://t.co/JOCl6raXMC Thank you Madam Radio Makassar! Puterin terus ya #DefinisiBahagia hehe  #UlangTahunVidi https://t.co/b5iVNOoiZt Amin ya Allah. Terima kasih ya. #UlangTahunVidi https://t.co/oL1mmHpVdO Thank you yaaa #UlangTahunVidi https://t.co/5sqcEolugM Akan merayakan ulang tahun bareng yang lagi ulang tahun juga, jam 13.00 WIB di @Iradiojakarta, see you around! #UlangTahunVidi https://t.co/YswpzZCB3e Amin, thank you for the support! #UlangTahunVidi https://t.co/DiPrXZlVzS Amin, yuk semua ikutan kasih 'kado' buat Vidi dan dek Misbah, klik: https://t.co/G5YktblOe1 #UlangTahunVidi https://t.co/uSmtMz5Luy Amin, kamu juga ya, bisa jadi #DefinisiBahagia jugaa. #UlangTahunVidi https://t.co/yD5Pabl2aW Thank you Unisi Radio! #UlangTahunVidi https://t.co/v78pqJTpM8 Thank you! #UlangTahunVidi https://t.co/jaosYr2SwL Amin ya Allah, thank you ya! #UlangTahunVidi https://t.co/qj8gm6DDxz RT @jejeradiosby: #Muterin @vidialdiano - Definisi Bahagia #Joggingpagi w/ @keyrinaichi1 https://t.co/p8lE0y7j8M Selamat Pagi 27 tahun! Thank you untuk semua yang sudah mengucapkan dan mendoakan! Keep it coming guys, pake #UlangTahunVidi ya hehe RT @_VIDIES_: Tweet harapan kamu ke @vidialdiano yuk. Siapa tau party twitter lagi 😄 Sehat2 ya Vid, stay humble. #UlangTahunVidi #27thVidiA… Menuju #UlangTahunVidi bersama @dyooy.....\n\n....dengan bermain Ragnarok Online. Hahaha! Wihi thank you guys!! #DefinisiBahagia https://t.co/rdtQbh4J21 Just did another photoshoot for adidasindonesia's newest campaign. Can't wait to reveal the… https://t.co/hH1Xm0RdFn Bantu saya untuk mewujudkan mimpi Dik Misbah dengan cara: \n\n1. https://t.co/Kltgzfm6AN\n2. Klik “Donasi Sekarang”\n3. Trf via 5 bank / CC \"Kado\" yang saya minta, adalah kado untuk salah satu adik di Jogja bernama Misbah yang sangat menginspirasi. Bantu saya yuk utk bantu Misbah Sore Vidies! 2 hari lagi, inshaAllah saya akan menginjak umur baru. Dan dihari special itu, saya ingin mengundang kalian untuk kasih \"kado\". Akan melakukan sesuatu yang spesial dihari yang spesial. 2 hari lagi, saya akan menginjak usia… https://t.co/ALCbkxCFp1 Monday mood be like. ❤️\n•\n📷: @rendharais https://t.co/OX6NvLwp9D RT @Iradiojakarta: Jangan lewatkan kemeriahan #16TahunIRadio yang disponsori oleh @indtravel bersama 14 musisi Indonesia, Rabu 29 Maret 201… RT @kristupa: Pembicara Panel #1000StartupDigital 🇮🇩 bareng @vidialdiano \n@1000startupID https://t.co/Tf9T4k9b9m Selamat pagi! Siang ini akan hadir di Medan untuk bertemu kawan-kawan di Auditorium Farmasi Universitas Sumatera Utara diacara 1000 startup! Dihari Jumat baik ini, #VidiAldianoxRuangguru ingin membagikan 1000 beasiswa video belajar ke… https://t.co/JD00dWyxbt Definisi Bahagia - Behind The Scene: https://t.co/kdtg4l9nPY via @YouTube Pasti ada yang bisa disyukuri dan bikin bahagia kok. Semangat! Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/Z1yJcJViy1 Hhm nantikan ya, akan segera di revealed. #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/lT1T64xB9M Sampaikan happy birthday ya buat adik, yes as simple as that! Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/xzckwbqCTS Ciyeee! Wah senjata ampuh nih ya music video nya? Silahkan ditiru yang lain, share ke gebetan haha #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/bl19UvwF2A Yess! Me too! Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/OdZrkzOEne Jo ah! Kembaran ku! Akhirnya terjawab. Happy International Day of Happiness Jo! Jgn lupa nonton --&gt; #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/LdUEy3UIoD Aah thank you mate. How are you? Hope yo're doing well too! Happy International Day of Happiness, Skylar! #DefinisiBahagia https://t.co/C3m3UqMWZe Hai hehe Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/MSuEkRQ5jf Amin ya Allah. Semoga lulus yaa. Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/Mml9MONOnF Amin. Selalu bersyukur adalah kunci kebahagian. Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/FK163VlvVf Alhamdulillah ya Allah.Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/Quj6WeirVp Semangat yaaa! Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/UfPLcHZSY0 Amin, aaaw so sweet. Keep up the good work ya! Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/Cb8lXS8qhv Yup! Harus tetap semangat, liburan seru, begitupun kuliah! Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/ZOdgRlpXYy Amin ya Allah. Doakan dan selalu support ya. Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/w7VQt5eJXc Nice, pasti ikut turut bahagia banget ya! Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/sgWJwIisQT Kasih tau ke Vidi apa sih #DefinisiBahagia buat kamu di International Day of Happiness.  https://t.co/PqFaBGXwZ2 Amin, terima kasih ya. Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/8tK7xOw4PJ Amin, keep up the good work ya! Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/1yUJA8X0Vt Setuju banget! Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/1Bjb0ao0tb Yes se simple itu namun se bahagia itu. Happy International Day of Happiness #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/aHsOI8CBTe Alhamdulillah amin. Happy International Day of Happiness ya! #DefinisiBahagia https://t.co/9tILjI9rri RT @riesaa27: I liked a @YouTube video from @vidialdiano https://t.co/Fyc7XGKHlZ Vidi Aldiano Definisi Bahagia (Official Video HD) Yes yes! Thank you #DefinisiBahagia https://t.co/cwj64Joh2b Asyedap, di mention dong pacarnyaa! #DefinisiBahagia https://t.co/4q4U0GPIPs RT @Iradiojakarta: Penasaran akan ada kemeriahan apa di ulang tahun IRadio &amp; @vidialdiano di tgl 29 Maret nanti? Makanya jangan lewatkan #1… Happy International Day of Happiness, kawan! Semoga semua bisa menemukan #DefinisiBahagia masing masing. Apa definisi bahagia buat kamu? Selamat senin pagi! Biar weeekdays nya makin bahagia, boleh ditonton karya visual terbaru saya #DefinisiBahagia https://t.co/PqFaBGXwZ2 Thank you Breakout! #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/qSKKKCXKTp Yess one of my fav shoot too! #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/mTYocmYbBp Bahagia adalah saat baca banyak pendapat di kolom komentar di video musik #DefinisiBahagia.… https://t.co/lCoQPkK98m Dingin haha #DefinisiBahagia https://t.co/PqFaBGFW7u https://t.co/IqNwbCAuFO Amin, thanks yaaa! #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/oCajoKTjgA Yup! Thats the spirit! #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/gJE212tG51 Yess bapak traveler pasti tau ya pak?! Thank you bro! #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/XxF6UOGnCq Yeiy! Nantikan shcedule selanjutnya yaa! #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/WC1D0ijfbX Thank youuu @Iradiojakarta!!! Hope you guys like the video! #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/W0ednjG7Kh Malam minggu nya sudah nonton music video #DefinisiBahagia belum? Simply click here: https://t.co/PqFaBGXwZ2 Yaa lumayanlah, tapi demi visual yang memuaskan, hope you enjoy! #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/BwQ030hZgO Thank you, bagian paling favorit yang mana? #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/dzAWOQdnpb Terima Kasih, bagian paling favorit yang mana? #DefinisiBahagia https://t.co/OLrN1QjQh4 Hahah Naruto, thanks yaa #DefinisiBahagia https://t.co/t0WMEHUsnV RT @nicotheofila: \"Jadilah sebuah definisi bahagia yang selalu kunanti\".\n@vidialdiano - Definisi Bahagia\n( Link di… https://t.co/Tee1w6ZeET Haha thank youuu! #DefinisiBahagia https://t.co/UWvAw5kmKC https://t.co/dRbpcJpan1 Haha yes, dalam hidup walau ter'jatuh' tetap harus tersenyum! #DefinisiBahagia https://t.co/UWvAw5kmKC https://t.co/Qz6FT1rZoR Ada dong, nantikan video BTS nya yaa #DefinisiBahagia https://t.co/dGDgudj5IN Thank you, hah di capture nya pas jatoh banget? Hope you enjoy! #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/JwRbBq5oLI RT @dewimaharanii15: Jas kuning &amp; rambut pink menurut gue sih keren banget dan pas vidi membelah diri pun juga sama aaah lucu deh👏 #Definis… RT @oktvnAyu: Saya suka video @YouTube dari @vidialdiano https://t.co/aUMVVc6n8P Vidi Aldiano Definisi Bahagia (Official Video HD) Ada alasan dan cerita dibalik semua itu? Stay tuned untuk penjelasannya konsepnya yaa. But how do you like it the video? #DefinisiBahagia https://t.co/Jbb5DUK3OQ Hhm ada sesuatu implisit dibalik itu, nantikan ya. #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/B321Bqk7lb Hahahaha #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/AnEDe9TPke Nice one! #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/P9TDryJIIL Karena kuning itu... ada yang bisa bantu? Tebak? Hehe #DefinisiBahagia https://t.co/PqFaBGXwZ2 https://t.co/wdteI1N73P Banyak yang bertanya ttg konsep video klip #DefinisiBahagia, sebelum Vidi jelasin, ada yang bisa tebak atau temuin?  https://t.co/PqFaBGXwZ2 RT @nicotheofila: @vidialdiano - Definisi Bahagia Music Video sudah bisa di tonton di Youtube ( Link di Bio )… https://t.co/cFdERwDuH3 Masih selalu nontonin terus video klip terbaru #DefinisiBahagia, siapa yang belum nonton? Silahkan di cek https://t.co/PqFaBGXwZ2 RT @tengkushafick: Everyone, Yuk cek video Definisi Bahagia nya @vidialdiano keren abis! di youtube https://t.co/jYsE4avg95 Congratz Vid! Thank you brother!! #DefinisiBahagia https://t.co/XMb9P2o8UR RT @ervitaanggraini: https://t.co/ZcGV28oXCQ \n#DefinisiBahagia bikin bahagia yg liat sejuk keren @vidialdiano RT @blessedmelon: Yang belom nonton video klipnya @vidialdiano #definisibahagia segera ke kanal youtube… https://t.co/GGbqOyyeei Thank you guys! https://t.co/2gBfkNcBzA Haha planet Mars! #DefinisiBahagia https://t.co/YWSSgM041K Alhamdulillah glad to hear! Thanks ya! #DefinisiBahagia https://t.co/FZNGjBmO0N RT @umi3_miumi: Fix ini keren, favorite banget pas bener buat mood balik setelah capek kerja seharian @vidialdiano #DefinisiBahagia \nhttps:… Amin ya Allah, thanks ya! #DefinisiBahagia https://t.co/o0KDNtXjCO Lumayan, tapi demi visual yang sesuai harapan, thanks yaa! #DefinisiBahagia https://t.co/iRcWxlGQrP Waah terima kasih banyak mas Didiet! Bagaimana tanggapannya? How do you like it? #DefinisiBahagia https://t.co/zepAahF7Kb Haha amoeba mungkin ya, thank you! #DefinisiBahagia https://t.co/hEvXleEC78 Alhamdulillah, bagian favorit yg mana boleh di share dong #DefinisiBahagia https://t.co/No4hykqb8O RT @wahyudialdiano: WATCH NOW! RT @vidialdiano: I added a video to a @YouTube playlist https://t.co/YsrJNWkbLS Vidi Aldiano Definisi Bahagi… RT @SandistyaSusan: Kirain bang Vidi nya ada 5.. Ternyata penari latar nya dimiripin sama Vidi.. Gokil.. Keren bang @vidialdiano #DefinisiB… Thank youuu, banyak ya Vidi nya #DefinisiBahagia https://t.co/FXYsGsn6sz I added a video to a @YouTube playlist https://t.co/Ea2SYfWEI9 Vidi Aldiano Definisi Bahagia (Official Video HD) Video Klip, #DefinisiBahagia sudah rilis, klik link berikut, bagaimanakah pendapatnya? https://t.co/Ea2SYfWEI9 25 MENIT MENUJU VIDEO KLIP #DEFINISIBAHAGIA! https://t.co/JbX6fb4r2H Hahaha. 1.5 jam lagi kok! Semangat! #DefinisiBahagia https://t.co/WIWP4nIYGD Kalo dari teaser di Instagram Vidi, menurut kamu video klip #DefinisiBahagia akan gimana konsepnya? Ada yang bisa tebak? Kurang dari 3 jam! RT @swaragamafm: #YogyakartaTopHits 4 | @vidialdiano - Definisi Bahagia https://t.co/umlwE8QExE RT @1013mfmlive: abis ini bakal ada lagu terbaru dari @vidialdiano yang judulnya Definisi Bahagia, kepo kayak gimana asiknya lagu ini? stay… Thank you Yuhuu! Nantikan video klip nya akan rilis malam ini ya jam 19.00WIB. #DefinisiBahagia https://t.co/EMCAr5Y7Xv 5 JAM LAGI menuju perilisan video klip #DefinisiBahagia di akun youtube official saya https://t.co/CYdOAwmm8v, stay close! https://t.co/uwZkY5hzrP Kan kupetik bintang dilangit ketujuh. Asalkan hati memang setuju. Pada hatimu ku terjatuh.… https://t.co/LYUr0GymjD Sudah siap untuk #DefinisiBahagia? 19.00 WIB hanya di https://t.co/CYdOAwmm8v https://t.co/9uhS53niEu Yes! Standby guys! Gak sabar untuk semua liat hasilanya, doakan yaa #DefinisiBahagia https://t.co/RJR0vlGwIR 12 JAM menuju video klip #DefinisiBahagia! Cek trailernya di Instagram @vidialdiano ya, gak sabar! https://t.co/CYdOAwmm8v / 17 Maret 2017 19.00 WIB /\n\nKurang lebih 24 jam lagi, saya akan merilis video dari single… https://t.co/FUbeJCzae5 #DefinisiBahagia menurut @RaffiAhmadLagi @audimarissa_ @imamdarto @DennyCagur, thanks guys! Kalo kamu? Share ya! https://t.co/hcRl0X0TnS Teaser pertama MV #DefinisiBahagia. \n\n17 Maret 2017, di kanal https://t.co/CYdOAwmm8v https://t.co/1FHbN4TKb0 / #DefinisiBahagia /\n\nTeaser pertama dari video musik lagu terbaru saya yang akan tayang 2 HARI… https://t.co/T72c1mVP0F / Team Bahagia /\n\nMemperkenalkan team music video #DefinisiBahagia!\n\nProducer :… https://t.co/jmAoO9lqPJ Kawan! Hari ini akan shooting video cover lagu di akun youtube Vidi, lagu apa ya? Ada request? Silahkan idenya! https://t.co/ih7AokHVtD / Cover Request /\n\nHari ini gue akan bikin video cover untuk di kanal Youtube gue. Kepikiran… https://t.co/OLJu9O9XhK RT @_VIDIES_: Ini teaser penampakan MV @vidialdiano yang terbaru. Tungguin ya. Follow semua sosmed vidialdiano buat updatenya😊 #DefinisiBah… Yeiy, come visit guys! #DefinsiBahagia https://t.co/YFu0hmoz5H RT @Delta_FM: Mau lagu @vidialdiano ada di playlist Delta FM? Ikutan #JuriLaguEnak dengan klik link ini : https://t.co/ohwYGEKrul https://t… / #DefinisiBahagia /\n\nIni adalah look keseluruhan saya di musik video \"Definisi Bahagia\".… https://t.co/MMWj4JjMbD Ini #DefinisiBahagia versi @raisa6690 @fitrop @FatinSL @sherylsheinafia &amp; @tarrabudiman. Kalo kamu? https://t.co/DnEJoJYAyl / Segera /\n\nMusik video #DefinisiBahagia akan segera hadir di kanal Youtube saya.\n\nDari foto… https://t.co/lTABpO3U9c RT @Prambors: YASS #ReqPrambors jagoan2 dalam negri nih! @KuntoAjiW, @RANforyourlife ft.@KahitnaFull, &amp; @vidialdiano! Mau @pgenuschka puter… Request #DefinisiBahagia nya dong kakak hahaha :D https://t.co/7yXfLpMlhE Go follow my 2nd instagram account for the rest of my stuffs hehe. @vavavood https://t.co/Q9mmXhGFkt Sudah pada liat belum tampilan baru website official Vidi? SIlahkan di cek https://t.co/UbkJnFjzkP, and how do you like it? #DefinisiBahagia Watch my Vlog, named #VAgoVlog on my official youtube account: https://t.co/QWDsKMtL0X RT @RMI_Fm: 1 - Juara bertahan Minggu ini @vidialdiano dg DEFINISI BAHAGIA, Congratulation !! RT @bee_radio: #NowPlaying @Vidialdiano - Definisi Bahagia #VARecords MD @sURya_Elpas #100PersenIndonesiaHits RT @pro2fmdenpasar: #NP #SemangatPagiBali @vidialdiano Definisi Bahagia @karadya_ ( CC MD : @AlanBawana ) RT @KalimayaBaskara: #NA I'm A Lady by @Meghan_Trainor // Heavy by @linkinpark @kiiara // Definisi Bahagia by @vidialdiano on #MorningDrive… RT @be107fm: #11 #nowplaying @vidialdiano - Definisi Bahagia cc @VaRecordsJRatt #BeTopRequest | MD: @Ollaaaa_05 RT @KARDOPAFM: #np ; @vidialdiano - Definisi bahagia #INDO25 Posisi 16 RT @bimantararadio: NP @vidialdiano - Defenisi Bahagia on #SATUKALIDUA #RADIOBUKITTINGGI Woohoo. Thanks guys! #DefinisiBahagia https://t.co/gwWW54h8fP RT @ParamudaRadio: Posisi 5 @vidialdiano - Definisi Bahagia\n\n#INDONESIAPARAMUDATOP20 bareng @NirinaZuli RT @876fmTheRadio: [3] @vidialdiano - Definisi Bahagia #NASIONAL15ME RT @reksfmgarut: #REKSPLAY #POSISI6 @vidialdiano  DEFINISI BAHAGIA #CHARTRTP CC MD @mddjalex ANN @inayinggrawati RT @Mandala964FM: #MandalaPlaying #Chart13 @vidialdiano - Definisi Bahagia  #MandalaTopPOP MD: @dulzmuhammad RT @RadioGrindulufm: #Top20Indonesia @RadioGrindulufm No.14 @vidialdiano - Definisi Bahagia  ~ Label : VA Records || #MD @DewiqAriyani RT @radiovolare: #Indonesia10 12 Maret 2017 |  [Posisi 4] | Vidi Aldiano - Definisi Bahagia | @vidialdiano https://t.co/M2gheAS2kN Yeay thank you!! #DefinisiBahagia https://t.co/5UqbJr7W4V RT @ELFARAFM: #LISTENUP @vidialdiano - DEFINISI BAHAGIA #POSISI1 #HOTINDO25 RT @Cassanova102FM: #13 @vidialdiano - Definisi Bahagia (#POSTER  11st w/ @mahaputri1212 as ur Host &amp;137 @joe_cassanovafm as our  Comp&amp;MD RT @imelda1044fm: #JawaraIndonesia20 #Number18 #NewComer @vidialdiano - DEFINISI BAHAGIA RT @GeronimoFM: #03 on chart #np @vidialdiano - Definisi Bahagia #DTN https://t.co/AR7VxS0yZT RT @pilaradio886fm: #Posisi12 \"Definisi Bahagia\" - @vidialdiano | ini #PILARINDO25 (edisi 11) | host @anggalicious | MD @lutfiPILARadio RT @EBSFM: #LagiMuterin @vidialdiano - Definisi Bahagia #DailyDate w/ Inces Ellysa :* / #IdolJrResultShow /\n\nSesaat lagi, jadilah saksi akan lahirnya idola baru Indonesia. Siapa yang… https://t.co/wX49CTRvU9 #IdolJrResultShow sore ini pukul 15.30!! Akan nyanyi juga nanti. Kira-kira siapa yang akan membawa gelar Idol Jr sore ini? Navis/Sharon? https://t.co/u4LxskxL0l RT @RadioKencana: #MDchoice @vidialdiano - Definisi Bahagia, @sayHIVI - Mata Ke Hati, @official_flo ft 99 Percent - Cake #NonStopRequest RT @mutmainnah654: Paling syukak ajak lah hatiku menari hingga tiada sedih dihati #DefinisiBahagia 🤗😊😂😆😀\nhttps://t.co/4sO6YZSBVU RT @JRadio917FM: #INDO20 Edisi ke10 Posisi 15 --&gt; @vidialdiano ~ Definisi Bahagia | Host: @sayAKHSA | MD: @Egha_Aulia RT @DJFMSURABAYA: #NowPlaying  @vidialdiano - Definisi Bahagia  #DJPuterinDonkWeekend RT @via51_: Ku harap engkau mengerti\nKaulah yang selalu ku nanti \nHadirkan bahagia di hati~ @vidialdiano #DefinisiBahagia RT @dewimaharanii15: Suka sama lirik \"jadilah sebuah definisi bahagia yang selalu ku nanti\" @vidialdiano #DefinisiBahagia RT @diyanurmutiasr: Suka sama lirik bagian \"Ajaklah hatiku menari hingga tiada sedih di hati~~\" itu pas buat doi banget 😄 @vidialdiano #Def… RT @EkaMelindaNurSa: Ini lirik favorit gue. Tapi dia mau ga yah? Kasih lagu ini aja apa. @vidialdiano #DefinisiBahagia https://t.co/g27y6lT… RT @trisnanurhakim: Fav &gt;&gt; \"Kan ku petik bintang dilangit ketujuh asalkan hati memang setuju pada hatimu ku terjatuh~\" *eaaaa* #definisiBah… Siapa hafal lirik #DefinisiBahagia? Lirik favorit kamu yg mana? Kasih tau Vidi, hashtag #DefinisiBahagia, lets go! https://t.co/YAWBV769Hf Dengerin single #DefinisiBahagia dan album #PersonaVA di @JOOX_ID ya, langsung simply click link berikut: https://t.co/srnsAHUbya https://t.co/HsLbuW6Saa RT @filmgalihratna: Ini dia kata @vidialdiano setelah nonton #GalihDanRatna https://t.co/E66wUN2ePU I added a video to a @YouTube playlist https://t.co/CsbxQ63VYp #DefinisiBahagia : Najwa Shihab, Boy William, Syahnaz, Bastian Steel, I added a video to a @YouTube playlist https://t.co/SvuVuQw1TS #DefinisiBahagia : Raffi Ahmad, Audi Marissa, Imam Darto, Denny Cagur &amp; #DefinisiBahagia adalah bisa stream album #PersonaVA dan semua singlenya di @SpotifyID: https://t.co/0yVBDq2yxJ https://t.co/a9L4pOyTYn #DefinisiBahagia : Najwa Shihab, Boy William, Syahnaz, Bastian Steel, Felicya Angelista: https://t.co/CsbxQ63VYp via @YouTube RT @RiafmSolo: #NP @vidialdiano - Definisi Bahagia #SPS RT @Iradiojakarta: selamat pagi.. di #HariMusikNasional kamis ini ada lagu pembuka dari @vidialdiano - Status Palsu barengan @ermiliatania… RT @ozradiobandung: #NOA @vidialdiano - @andienaisyah - Hingga nanti , @kotakband_ - Masih cinta , @ADERA_ega - Catatan kecil #OZJUSTHITS RT @kisfmjakarta: Sekarang kita bakalan ngobrol sama @vidialdiano  di hari musik nasional #BERISIK951 RT @_VIDIES_: Trus berkarya jujur &amp; sepenuh hati. Karena lagu yg diciptakan sendiri lbh memberi kepuasan hati sendiri juga. Ya toh? @vidial… Amin, terima kasih untuk supportnya, Selamat Hari Musik Nasional semua! #DefinisiBahagia https://t.co/IJrs0Fs7SC / #DefinisiBahagia /\n\nIni definisi bahagia bagi @raffiah54713432 @audimarissa_ @imamdarto… https://t.co/CaztLha1n4 Silahkan di klik link berikut untuk mendapatkan single terbaru saya #DefinisiBahagia dari album #PersonaVA: https://t.co/hsASD3DbqL https://t.co/TYCEzQPvXf RT @GlennFredly: Tulisan terbaru saya untuk menyambut hari Musik nasional, thanks @RollingStoneINA 🙏🏽 https://t.co/kyvhMuEiLY / Google /\n\nHad a great time last night at Google #SelaluTauMUSIK party! Honored to be a part of… https://t.co/MLTKn9uMdL #DefinisiBahagia : Raffi Ahmad, Audi Marissa, Imam Darto, Denny Cagur &amp; Anwar Sanjaya: https://t.co/SvuVuQw1TS via @YouTube #VAgoVLOG edisi liburan ke Disney World bareng keluarga, ini Part 1 nya ya, check it out: https://t.co/BBqa3gLMmn RT @autoradio889fm: NP @vidialdiano - Definisi Bahagia #autoradio889fm Woohoo!! Thanks kawan! Request terus #DefinisiBahagia nya yaa https://t.co/ktrUGbSYLr RT @SonoraFM92: Dengarkan lagu milik @vidialdiano yang berjudul 'Definisi Bahagia' di video berikut ini -&gt; https://t.co/Lv3VpRW4dS https://… RT @895jizfm: Pos 30 ada @vidialdiano - Definisi Bahagia #JAGOAN #NewEntry Bahagia adalah lagu #DefinisiBahagia diputer di Trax FM! https://t.co/UjtUKPKDWR Thank you!! https://t.co/zvbrTwGb1e RT @Iradiojakarta: Dan lagu terakhir di #10LaguKeren ada duet manis dari @vidialdiano dan @andienaisyah - Hingga Nanti bareng @ermiliatania… I added a video to a @YouTube playlist https://t.co/wAnfVbdZF4 Google app: Cari Penyanyi #SelaluTauMusik Thank you @lolitagustine @irfanhakim @Graciaz14 @omeshomesh @alifaazaralubis udh share #DefinisiBahagia, kalo kamu? https://t.co/Myl941hD0v Definisi Bahagia itu bisa nikmatin hari Minggu gak sih? Sambil dengerin #DefinisiBahagia di @JOOX_ID: https://t.co/srnsAIbMWK https://t.co/D83YTAZdmc / Navis &amp; Sharon /\n\nBangga banget sama 2 finalis Indonesian Idol Junior Season 2 ini.… https://t.co/1TcAAxvIAj #IdolJrGrandFinal makin panas!!! Show your support to the 2 finalist! Siapa jagoan kamu? @IndonesianIdol @Official_MNCTV Baru buat account Instagram baru khusus untuk foto2 saya yang berhubungan dengan jalan-jalan &amp; makanan (@Vavavood). Boleh difollow :) Dengerin #DefinisiBahagia dan album #PersonaVA di @SpotifyID: https://t.co/TXY8PACZNj https://t.co/taed4M8E8O / #DefinisiBahagia itu... /\n\nKata @najwashihab boywilliam17 @bastiansteel felicyangelista_ &amp;… https://t.co/6OwAh4lTqX RT @pro2fmdenpasar: #NP #20ChartIndoHitz @vidialdiano Definisi Bahagia ( Posisi 8 ) ( @VaRecordsJRatt ) ( CC MD : @AlanBawana ) RT @SonoraFM92: Dengarkan lagu milik @vidialdiano yang berjudul 'Definisi Bahagia' di video berikut ini -&gt; https://t.co/Lv3VpRW4dS https://… RT @bee_radio: #NowPlaying @Vidialdiano - Definisi Bahagia #VARecords MD @sURya_Elpas #100PersenIndonesiaHits RT @SonoraMedan: #SonoraPlaying @vidialdiano - Definisi Bahagia. #SelamatPagiMedan RT @KalimayaBaskara: #NA Falling by @Alesso ft. @MOMOMOYOUTH // Back to Beautiful by @SofiaCarson // Definisi Bahagia by @vidialdiano on #M… RT @pro2fmdenpasar: #NP #SemangatPagiBali @vidialdiano - definisi Bahagia @fnarchdq (CC MD: @AlanBawana) RT @EBSFM: #LagiMuterin @vidialdiano - Definisi Bahagia #BreakfastShow w/ Fira RT @ciradio: #nowairng Definisi Bahagia - @vidialdiano on #IndoFreshHitz RT @FavoritRadio: #Deretan22 @officialdimbo Ft. Irindacil #TakkanTerganti\n#Deretan21 @vidialdiano #DefinisiBahagia \n\n#IndoHIts30 Edsi09 Kom… RT @JRadio917FM: #INDO20 Edisi ke9 Posisi 07 --&gt; @vidialdiano ~ Definisi Bahagia | Host: @sayAKHSA | MD: @Egha_Aulia RT @Kiwarifmradio: #IndoHitsTop15 Posisi 3 @vidialdiano - Definisi Bahagia @ VA Records Sudah shooting music video #DefinisiBahagia, gak sabar banget untuk share hasilnya, check lyric video nya dulu ya: https://t.co/YAWBV7nL5P Masa sih! Hahaha https://t.co/pJUl7wQ2AM #DefinisiBahagia gue dihari Jumat ini, dianterin nyokap ke mesjid. Selamat memulai akhir pekan teman! RT @Prambors: YOOT! Udah jam 11 nih kawula muda ~\n\n@PratamaMario &amp; @pgenuschka bakalan ngobrol bareng @vidialdiano di Prambors #NightShift… RT @Prambors: Malam ini @PratamaMario &amp; @pgenuschka bakalan ngobrol bareng @vidialdiano ngobrolin single nya yang Definisi Bahagia ;) #Nigh… Nanti malam jam 23.00 WIB dengerin @Prambors ya kawan, bakal ber #DefinisiBahagia bareng @PratamaMario @pgenuschka yuk! #NightShift https://t.co/B9tM0Vw3Se Nanti malam jam 23.00 WIB dengerin @Prambors ya kawan, bakal ber #DefinisiBahagia bareng @PratamaMario @pgenuschka yuk! https://t.co/zJGdjw9lLs #VAgoVlog terbaru, liburan ke Disneyworld Part 2, siapa yang udah nonton? Thoughts? https://t.co/QWDsKMtL0X / BCL /\n\nMalam yang sangat indah dan membanggakan, melihat sahabat saya menggelar konser… https://t.co/D1JHScXjEY My latest single #DefinisiBahagia is now available official on iTunes, please kindly click link below: https://t.co/hsASD3lA2b https://t.co/x3yOTPIylO #DefinisiBahagia menurut @lolitagustine @irfanhakim @Graciaz14 @omeshomesh @alifaazaralubis, thank guys! Kalo kamu? https://t.co/Myl941hD0v / #DefinisiBahagia /\n\nIni kalo kata @raisa6690 @FatinSL @tarrabudiman @sherylsheinafia &amp; @fitrop. Kalau kamu apa? https://t.co/iqg2JbxGtZ / #DefinisiBahagia /\n\nIni kalo kata raisa6690 @FatinSL @tarrabudiman @sherylsheinafia &amp; @fitrop.… https://t.co/OdwG6u9DUg Yuk kawan-kawan Surabaya &amp; sekitarnyA! :) https://t.co/Pdszsb2EIp I added a video to a @YouTube playlist https://t.co/hC28ZzAFAt GOES TO DISNEYWORLD (Part. 2) GOES TO DISNEYLAND (Part. 2): https://t.co/hC28ZzAFAt via @YouTube / 3/\n\nBertiga menjuri di Indonesian Idol Junior, babak Top Three! Siapa Junior jagoan kamu? @… https://t.co/ziWk2kEv1W Plis kak @duniamanji nonton @Official_MNCTV sekaraaangggg RT @kampungseleb: Mau nongkrong asik dan dapat hadiah spesial dari @vidialdiano ? Ayo ikutan  @VidiesSurabayaa https://t.co/jmaFiyvs1U Uyeah thank you @GeronimoFM!!! So happy!! #DefinisiBahagia https://t.co/xlGsyltqHe Good morning! Dapet salam dari #DefinisiBahagia versi emo. Have a great day ahead guys!! https://t.co/V584CSnH2L Siapa disini pengguna @JOOX_ID #JOOXID? Yuk dengerin #DefinisiBahagia official di JOOX: https://t.co/srnsAIbMWK https://t.co/DSm51RiiRg Wooohoo!! Thank you so much Ardan dan kawan-kawan Bandung! https://t.co/eH7ShoDkkQ Thank you guys! https://t.co/FrrdP0kU8n Yeaaay thank you Sukabumi! https://t.co/OLmWk54V1h RT @Cassanova102FM: #NP @GAC_music - Galih &amp; Ratna | @vidialdiano - Definisi Bahagia #MAKALAH w/ DJ @ChikaMhyn912 RT @yadikaradio: 6. Don't Wanna Know - @Maroon5\n\n5. Definisi Bahagia - @vidialdiano\n\n#YadikaHits RT @pro2fmdenpasar: #NP #20ChartIndohitz Posisi 15 @vidialdiano - Definisi Bahagia (VA Records) CC MD: @AlanBawana RT @sai100fm: 13. @vidialdiano - Definisi Bahagia. #Sandi21 @sai100fm w/ @nadinne_aulia RT @BossFmSiantar: Naik 1 Pringkat  Top 15 Ada @vidialdiano - Definisi Bahagia Label : VA RECORD #20BOSSINDOTOPREQUEST MD : @18ges Stop pembajakan! Kalo mau dengerin #DefinisiBahagia official langsung aja klik link iTunes berikut ini ya: https://t.co/hsASD3lA2b https://t.co/ELzSZ4kGxX Tangerang selatan rasa winter. Hujan es cuy... VLOG BARU: GOES TO DISNEYWORLD (Part. 1) https://t.co/b7H4XPt6Tu\n\nTunggu part 2 nya ya kawan! #VAgoVLOG / VLOG BARU /\n\nAkhirnya setelah lama vakum, #VAgoVLOG kembali hadir lagi. Kali ini akan meliput… https://t.co/idaSFBom90 #VAgoVLOG is back! Akhirnya upload VLOG baru juga! Yuk cek trip gue kemarin ke US disini! https://t.co/QtamJhxIHw Great news! Siapa yang udh nungguin #VAgoVlog! Sore ini jam 16.30 WIB akan di upload, subscribe dulu: https://t.co/uwWtNKfquu Thank you @SpotifyID for providing my latest single #DefinisiBahagia, get it here guys: https://t.co/TXY8PACZNj https://t.co/GVsrN9ySZh RT @KARDOPAFM: #np ; @vidialdiano - Definisi Bahagia #VariaWanita RT @Cassanova102FM: #NP @GAC_music x @TheOvertunes - Senyuman, Harapan | @vidialdiano - Definisi Bahagia #SESIPRIBOEMI w/ DJ 118 RT @KPFMsamarinda: #NowPlayingOn96koma8 Definisi Bahagia by @vidialdiano #Relasi RT @radiosyiarfm: #OnAir @OneRepublic - Counting stars, @vidialdiano - Definisi Bahagia #Jalanjalansore RT @RakaFMBandung: #RakaPlaying Definisi Bahagia ~ @vidialdiano #FunNFresh w/ @guzman_sige | req sms/wa 0811 149 7787 https://t.co/LVsJH3DE… RT @swararadio: #NowPlaying @vidialdiano - Definisi Bahagia\n\nNext @armandmaulana - Sebelah Mata\n \nw/ @naranovta di #MadeinIndonesia \n#Bikin… RT @autoradio889fm: NP @vidialdiano - Definisi Bahagia #autoradio889fm RT @rapmafmums: #NowPlaying @vidialdiano - Definisi Bahagia #SUNSETSTATION RT @EBSFM: #LagiMuterin #SINGGRESS @vidialdiano - Definisi Bahagia #BrizikTime w/ EllysaRara RT @KalimayaBaskara: #NA Selalu Menjagamu by @nidji // Definisi Bahagia by @vidialdiano on #NgopiKBFM RT @dutafm: #NOP Definisi Bahagia @vidialdiano on #Petasan with @EbbyLessyl &amp; @Nataliahalapiry sgra mrpat req lgu fav km @dutafm RT @EBSFM: #LagiMuterin @vidialdiano - Definisi Bahagia #ZonaSKJ w/ EkaFira RT @Delta_FM: Simak obrolan santai @renopepno bersama @vidialdiano nanti sore di ronde ke-4 #ZonaRelax | Streaming : https://t.co/Wb1vxzC1C… RT @Delta_FM: Simak obrolan santai @renopepno bersama @vidialdiano besok sore di ronde ke-4 #ZonaRelax | Streaming : https://t.co/Wb1vxzkqK… #DefinisiBahagia menurut @gamal1990 @AbigailCantika @TapiheruAudrey @LALAkarmela @angelicaaMP, kalo kamu? https://t.co/IctlKqKh7d RT @SonoraFM92: Dengarkan lagu milik @vidialdiano yang berjudul 'Definisi Bahagia' di video berikut ini -&gt; https://t.co/Lv3VpRW4dS https://… RT @KalimayaBaskara: #NA Jumpshot by @dawin // Definisi Bahagia by @vidialdiano on #THKBFM RT @dutafm: #Playreq Definisi Bahagia @vidialdiano on #Petasan with @EbbyLessyl bruan joint req lgu fav km @dutafm i'll be waiting  \\(^_^)/ RT @unisifmyk: [5 LIST] @katyperry - Chained to the Rhythm &gt;&gt; @vidialdiano - Definisi Bahagia #MorningSunrise https://t.co/wMDjiEj7XQ Thank you guys! https://t.co/tHUVElLfTt RT @autoradio889fm: NP @vidialdiano - Definisi Bahagia #autoradio889fm RT @EBSFM: #LagiMuterin @vidialdiano - Definisi Bahagia #BrizikTime w/ EllysaRara RT @Cassanova102FM: #NP @vidialdiano - Definisi Bahagia | @nsgmusic &amp; CVX - Sempurna #SESIPRIBOEMI w/ DJ 118 RT @DistafmRadio: ►@vidialdiano - Definisi Bahagia || #Sketsa with @dyahfebriyani dan yudho ardy #FebruariMakinBerani RT @radiotelstar: Np : single baru @vidialdiano \"Definisi Bahagia\" bahagiaaa deh jadi opening di #INDOKUINDOMU w/ @wardhaniqa ^_^ RT @yadikaradio: Play:\nRockabey - @cleanbandit ft. @duttypaul &amp; @annemarieim\nDefenisi Bahagia - @vidialdiano \nThe Way - @ArianaGrande \n\n#SA… RT @FBIBALIRADIO: PlayHits♫ @vidialdiano - Definisi Bahagia ||► #SPP w/ @yogikanaye &amp; @riri_valter cc MD : @RadityaRassman RT @unisifmyk: [5 LIST] @ABackBone - Panah Takdir &gt;&gt; @vidialdiano - Definisi Bahagia #MorningSunrise https://t.co/nW7bhZrzQj RT @RadioKencana: #MDchoice @Angelo_Mikha - Soulmate, @vidialdiano - Definisi Bahagia, @BebeRexha - I Got You. #SKJ2017 RT @BVOICERADIO: Tiap hari mesti bahagia ya Blisteners! #NowPlaying Definisi Bahagia by @vidialdiano #MorningVoice Watch #DefinisiBahagia video lyric on my official youtube account here: https://t.co/YAWBV769Hf Hai kawan! Mau ketemu dan Nongkrong asik bareng Vidi di Surabaya? Ikuti caranya di https://t.co/xu2pWSsu0w https://t.co/7X7DqgALeC Yuk Vidies setengah jam lagi! #DefinisiBahagia https://t.co/XtVfy1qUb4 #DefinisiBahagia : Lolita, Irfan Hakim, Omesh, Gracia Indri &amp; Alifa https://t.co/o9AKxcK6cW via @YouTube RT @979FeMaleRadio: @VidiAldiano tadi sempet cover Closer nih! Cakep banget, FeMalicious!\n.\n#HAPPYMORNING with #INDYBEN @indybarends @benka… RT @Cassanova102FM: #NP @vidialdiano - Definisi Bahagia | @kaythebez - Pacar Rahasia #SESIPRIBOEMI w/ DJ   118 RT @FavoritRadio: Memutarkan @vidialdiano _Definisi Bahagia &gt;&gt; @rivansax ft @abdullikecoffee _Gadis Di Ujung Sana \ndi #100PersenIndonesia\nb… RT @therealvidies: Yeay thank you @979FeMaleRadio sudah menghadirkan @vidialdiano di pagi yang mendung ini. Bikin tambah semangat! #Definis… RT @_VIDIES_: Yeiy. Thank you @979FeMaleRadio for having @vidialdiano selamat kembali beraktifitas :) happy Tuesday! RT @979FeMaleRadio: Mau tau Definisi Bahagia menurut @vidialdiano ?\n.\nTonton IG live kita sesaat lagi yaa di #HAPPYMORNING with #INDYBEN ht… Sudah hadir di @979FeMaleRadio berbagi #DefinisiBahagia bersama @indybarends &amp; @benkasyafani! Yuk stay tuned! https://t.co/XideAkuwHP Revisi guys, ini jadwal yang final buat besok ber #DefinisiBahagia di radio radio Jakarta ini ya, see ya! https://t.co/UYgRiX7T4I I added a video to a @YouTube playlist https://t.co/Zx5XTuDOcz #DefinisiBahagia : Lolita, Irfan Hakim, Omesh, Gracia Indri &amp; Alifa Ini #DefinisiBahagia menurut Lolita Agustine, Irfan Hakim, Gracia Indri, Omesh &amp; Alifa. Ada yang sama kah... https://t.co/Zx5XTuDOcz / Selamat Ulang Tahun Mama ❤️ / https://t.co/QhJngVE4zi Stream my new single #DefinisiBahagia on @SpotifyID: https://t.co/TXY8PAUBbT https://t.co/y8eGa9jVmM #IdolJrDuetStar akan hadir sore ini pukul 15.30 WIB di @Official_MNCTV. Udah TOP 4! Siapa jagoan kalian? Share disini yuk! @IndonesianIdol Thank you guys!! :D https://t.co/NWBsMVjJRm RT @GajahmadaFM: #Konsen @sandycanester - Telepon Aku | @vidialdiano - Definisi Bahagia | @esoyuelaidi - Ingin Dicinta | #KotaKita RT @Cassanova102FM: #NP @vidialdiano - Definisi Bahagia #sundaymorning w/ @nadyapuspa307 &amp; @debbyciya308 RT @EBSFM: #LagiMuterin @vidialdiano - Definisi Bahagia #BreakfastShow w/ Eyin RT @RadioGrindulufm: #Top20Indonesia @RadioGrindulufm No.19 @vidialdiano - Definisi Bahagia 🆕 ~ Label : VA Records || #MD @DewiqAriyani RT @radiosifm: Now Playing &gt; Sindikat 15 No.5 : @vidialdiano Definisi Bahagia #varecords RT @radiovolare: #Indonesia10 19 Februari 2017 | [Posisi 2] | Vidi Aldiano - Definisi Bahagia | @vidialdiano https://t.co/OdO9O3jJG9 RT @EBSFM: #LagiMuterin @vidialdiano - Definisi Bahagia #DailyDate w/ Fira RT @yadikaradio: 6. Saat Bersamamu - @sheiladaisha\n\n5. Definisi Bahagia - @vidialdiano \n\n#YadikaHits / Minggu Bahagia /\n\nBerbagi #DefinisiBahagia dihari Minggu bersama kak @lolitagustine… https://t.co/sRPXiVljnw RT @vidialdiano: \"Happiest couples never have the same character. They just have the best understanding of their differences.\" :) / My world /\n\nMengakhiri malam ini dengan makan malam bertiga. Sudah lama ga menghabiskan waktu… https://t.co/n0xYaFOHDj / Menuju Ultah Mama /\n\nJadi ceritanya hari ini kasih kejutan ke Mama yang besok ulang tahun, dan… https://t.co/CZYUVUIOHT RT @Kiwarifmradio: #IndoHitsTop15 Posisi 3 @vidialdiano - Definisi Bahagia @ VA Records RT @EBSFM: #LagiMuterin @vidialdiano - Definisi Bahagia #Dailydate w/ Fira RT @ardanradio: No.2\n@vidialdiano - Definisi Bahagia\n\nNo.3\n@Latinka - Takan Nyata\n\nNo.4\n@edenmusic_ - Rusak\n\nArdan Persada 7 Lagi edisi 316… RT @BossFmSiantar: Naik 2 Pringkat top 16 Ada  @vidialdiano - Definisi Bahagia Label : VA RECORD #20BOSSINDOTOPREQUEST MD : @18ges RT @KalimayaBaskara: #NA Animals by @maroon5 // Definisi Bahagia by @vidialdiano on #SNSKBFM iTunes dan Apple music adalah salah dua official digital platform untuk dapetin #DefinisiBahagia, simply click here: https://t.co/hsASD3lA2b https://t.co/bXPr2pRKrF Bocoran, music video #DefinisiBahagia sedang dalam proses pembuatan, ada ide? Coba cek dulu lyric videnya: https://t.co/YAWBV769Hf RT @MegaswaraFM: #LikaLikuLaguLagu sore hari ini akan bahas @vidialdiano ! Stay Close di 100.8 @MegaswaraFM bareng #TheBidjis !... https://… RT @Yuhu_Live: Lagu terbaik Indonesia no3 @vidialdiano Definisi Bahagia di #yuhuchart99 with @jojosuherman I added a video to a @YouTube playlist https://t.co/0dBmjCuE1O Vidi Aldiano - Definisi Bahagia (Lyric Video) I added a video to a @YouTube playlist https://t.co/DS33NsSMW5 #DefinisiBahagia : GAC, Reza Rahadian, Lala Karmela, Angel Pieters, Ini adalah #DefinisiBahagia menurut GAC, Reza Rahadian, Lala Karmela, Angel Pieters, Nola &amp; Neona. Menurut... https://t.co/DS33NsSMW5 Semoga pada bahagia ya nonton #BreakoutNETVidi nya! Sampe TT pula! Thank you guys! #DefinisiBahagia @netmediatama @BreakoutNET https://t.co/t9iE1X508O RT @_VIDIES_: Closing. New single from @vidialdiano - #DefinisiBahagia now on @BreakoutNET @netmediatama thx @sheiladaisha @boywilliam 🙏 #B… Itu 5 #DefinisiBahagia menurut gue. Kalo lo apa guys? Mention yuk pake hashtag #BreakoutNETVidi https://t.co/hqmJXTR9qL #BreakoutNETVidi https://t.co/Y1QYn5Hbjk Stay tuned #BreakoutNETVidi https://t.co/oQCJE16jiY Tepat pukul 13.00 WIB, saya akan take over @BreakoutNET di @netmediatama, membagikan #DefinisiBahagia. Stay tuned! #BreakoutNETVidi RT @netmediatama: Makan siang kamu kali ini bakal ditemani @taylorswift13 @justinbieber @LittleMix @vidialdiano.\n\nKetemu di @BreakoutNET ja… RT @BreakoutNET: @vidialdiano akan take over Breakout??? no waaay 😳 #BreakoutNETVidi https://t.co/bE2FfACGK2 / work with bae /\n\nTepat pukul 13.00 WIB ini, saya akan mengambil alih Breakout NET, dan akan… https://t.co/8sydzs1KWN Yaaz! Stay put guys! #BreakoutNETVidi https://t.co/3NKnqefBJX RT @bee_radio: #NowPlaying @Vidialdiano - Definisi Bahagia #VARecords MD @sURya_Elpas #100PersenIndonesiaHits RT @pro2fmdenpasar: #NP #SemangatPagiBali @vidialdiano Definisi Bahagia @karadya_ ( CC MD : @AlanBawana ) RT @iwedrd: Sokil sih ini video lirik Definisi Bahagia-nya @vidialdiano. Segala kerupuk, duit 2ribu, juga bakso ada di situ. Baru liat😂 RT @nisaaisti: Baru denger dan nonton MV definisi bahagia, so delicious. Tks for great audiovisual @vidialdiano 😍😍 RT @autoradio889fm: NP @vidialdiano - Definisi Bahagia #autoradio889fm RT @KalimayaBaskara: #NA Definisi Bahagia by @vidialdiano // Ombak Amara by @RANforyourlife // Penantian Berharga by @rizky_febian on #Peca… RT @FavoritRadio: Memutarkan @bclsinclair ft @diphabarus _Aku Wanita &gt;&gt;&gt;\n@vidialdiano _Definisi Bahagia\ndi #CoolingDown \nbareng @rinaacalvin RT @SonoraFM92: Dengarkan lagu milik @vidialdiano yang berjudul 'Definisi Bahagia' di video berikut ini -&gt; https://t.co/Lv3VpRW4dS https://… Yes, #DefinisiBahagia sudah bisa didengarkan di @JOOX_ID #JOOXID yaa, disini: https://t.co/srnsAIbMWK https://t.co/BgAY6mY8sy Hahahahaha. Glad you liked it! https://t.co/d12OEkh4ml Yeay thank you! https://t.co/8zwqC9zcsu Untuk @VidiesSurabayaa dan sekitarnya, yuk ikutan ini! https://t.co/EHsFioXfHf Langsung aja klik link berikut buat dengerin &amp; dapetin #DefinisiBahagia di iTunes ya: https://t.co/hsASD3DbqL https://t.co/t1Wa0cboxX Rakyat TangSel ini sudah bersuara. Kamu? https://t.co/rb40pRr7M2 / Suara Rakyat /\n\nSudah menggunakan hak saya dalam bersuara. Berdoa supaya siapapun yang… https://t.co/h4UaRjcM3P Twitter kembali ramai. Wow negara saya banyak cobaan nya ya...banyak cobaan tandanya negara kita masih disayang Tuhan. #ambilhikmahnya Apa #DefinisiBahagia kamu di hari kasih sayang ini? Hhm Vidi apa ya? Cek di lyric video ini ya: https://t.co/YAWBV769Hf / #DefinisiBahagia /\n\nIni adalah Definisi Bahagia menurut teman-teman dari @gac_music @gamal1990… https://t.co/Ywlbtg2W08 Last but not least, ditutup dengan pulau Bali! Stay tuned di @PHOENIXFMBALI ya, so much fun! #DefinisiBahagia Palangkaraya is up next! Menyebarkan virus #DefinisiBahagia lewat LIVE phone interview ya! Sekarang giliran @iradiomedan, mari ber #DefinisiBahagia, #Vidies Medan! Lanjooot ke Jember, akan LIVE phone interview di @sokaradio Jember, lets! Next stop! @iradioBJM Banjarmasin, yuk yuk #vidies Banjarmasin mana suaranyaaa! #DefinisiBahagia Here we go ke Semarang sekarang, stay tuned di @kis1032fm ya! #DefinisiBahagia #DefinisiBahagia adalah berbagai cerita tentang single dan album baru di @parasfm Samarinda, lets! Selanjutnya Makassar, LIVE phone interview di @radiovenusmks ya #vidies! #DefinisiBahagia Masih semangat! Kita menuju Bali sekarang, ngobrol ngobrol di @989balifm ya! #DefinisiBahagia 'Terbang' suara ke Pekanbaru, stay tuned di @943freshradio yuk! #DefinisiBahagia Selanjutnya giliran Medan! #vidies Medan yuk ganti radionya ke @KARDOPAFM, LIVE phone interview yuk! Malang mana suaranyaa? kita ber #DefinisiBahagia yuk di @Pro2fmMalang  yaa! LIVE phone interview di @FRESH959fm Lombok, jumpa di udara ya, kawan! #DefinisiBahagia RT @marshaliza_: Definisi Bahagia Lyric Video\n\n🌻 Definisi Bahagia bagi Vid adalah : https://t.co/vShLZO4SxV https://t.co/ct4Qd20YIY Ber #DefinisiBahagia di Batam, di @be107fm ya, ngobrol ngobrol yuk Batam! Selanjutnya pulau dewata Bali! @d_ozradiobali stay tuned ya #vidies Bali! #DefinisiBahagia #DefinisiBahagia LIVE phone interview diseluruh Indonesia kita mulai lagi! Yang pertama di @radiodcs, lets go Madiun! My latest single #DefinisiBahagia is now available on @SpotifyID: https://t.co/TXY8PAUBbT https://t.co/Nd0sV7WaUF RT @prosalinaradio: yuuuk ikuti cerita seru dri lagu baru @vidialdiano , Definisi Bahagia bareng @silvia_sonya skarang di #JagoanBaru yah h… RT @895jizfm: sob bntr lg @auliiaaisti bakal ngobrol brg @vidialdiano ttg single barunya yg berjudul DEVINISI BAHAGIA, apa ya devinsi bahag… RT @jejeradiosby: Penasaran sama isi album terbaru @vidialdiano \"Persona\" ? Dengerin obrolan seru @LeauRetha di #JJS brg Vidi Aldiano sekar… RT @jejeradiosby: Ada kejutan di #JJS karena @LeauRetha bakal ngobrol sama @vidialdiano ! gonna be awesome! stay tune ! https://t.co/rjusXr… RT @GeronimoFM: Kita lagi ngobrol sama @vidialdiano tentang single baru dia yang judulnya, Definisi Bahagia!\n\nApa ya definisi bahagia Vidi?… Last but not least, @geronimofm Jogja, yuk ber #DefinisiBahagia, lets go! 'Terbang suara' ke Jogja, akan ber #DefinisiBahagia @895jizfm, yuk kawan stay tuned! LIVE in air phone interview di @jejeradiosby! Arek arek Suroboyo mana suaranyaaa!? #DefinisiBahagia @ptpnradiosolo next! Stand by #vidies Solo, akan ber #DefinisiBahagia Yess! Sekarang! #DefinisiBahagia https://t.co/x95J43Xhky Semarang stand by!! Bentar lagi akan LIVE phone interview di @GajahmadaFM! #DefinisiBahagia Lagi LIVE interview, cerita cerita via telfon di @radioMartapura, so much fun! #DefinisiBahagia Hai arek arek Surabaya, lanjut akan phone interview di @istarafm, NOW! #DefinisiBahagia Ber #DefinisiBahagia LIVE interview di @radiovolare Pontianak, yuk kawan kawan Pontianak! RT @GajahmadaFM: Sore nanti di #Gamafans ada obrolan telepon bareng @vidialdiano. Konsenin kuy #OnCall hari ini. https://t.co/ImCGsFVMDO RT @mitharizkytas: Udah stay tune lho btw di @solo_radio buat phone interview @vidialdiano 😂 mampir beneran dong vid, udah lama juga 😂😂 #De… 'Terbang' ke Solo skrg! @solo_radio is now on! #DefinisiBahagia Lanjut menuju Bali! akan LIVE di @Cassanova102FM! Bali mana suaranyaaa! #DefinisiBahagia Now on air! @warnafmpadang, ayo kampung halaman stay tuned! #DefinisiBahagia Radio Phoners seluruh Indonesia sudah dimulai, skrg lagi LIVE di @TraxFMPLG! Yeay! Request terus yaa lagu #DefinisiBahagia nya! :) https://t.co/wbr1mJNLIu RT @MomeafmPLM: #NP definisi bahagia @vidialdiano #GPL DEFINISI BAHAGIA KELILING INDONESIA. First 3:\n\n11.00 Momea 104.2 FM Palembang\n11.45 Prosalina 101.3 FM Jember\n12.30 Medan 96.3 FM Medan DEFINISI BAHAGIA AKAN KELILING INDONESIA! Yuk cek, ada radio kota kamu kah besok? #DefinisiBahagia https://t.co/M9hPgTDq5K Klik link berikut untuk dengerin #DefinisiBahagia di @JOOX_ID #JooxID: https://t.co/srnsAIbMWK https://t.co/fOOnYUEAV6 #IdolJrTOP5 semakin memanas!!!! Siapa junior yang kamu jagoin Minggu ini? @IndonesianIdol @Official_MNCTV #DefinisiBahagia di Minggu pagi buat kamu apa, kawan? Kasih tau Vidi, sambil nonton lyric video nya yaa: https://t.co/YAWBV7nL5P / kencan ganda di malam Sabtu / @ Plaza Senayan https://t.co/LqbAGufhoE Karena hujan tadi, dan venue nya outdoor,  acaranya dimundurin guys. So gue akan hadir katanya jam 15.00 WIB di margo city depok. Siapa aja yang udah di Margo City Depok??? Akan manggung sebentar lagi nih. Yuk merapat! #DefinisiBahagia RT @okezonenews: Saksikan Rerun Live Streaming Hot Seat bersama @vidialdiano malam ini pkl 20.00 WIB Klik: https://t.co/tFO2WfQS3a #Kongkow… Depok mana suaranya?? Yes yuk ber #DefinisiBahagia di Depok hari ini Sabtu jam 14.00 yaa! #PopUpPlayground #MySienta https://t.co/ozgn1FQlhZ RT @8EHradioITB: #NOWPLAYING @vidialdiano Definisi Bahagia #OnRepeat https://t.co/Fx89V2wvyX Thank you!!! #DefinisiBahagia https://t.co/dhOJN07YB2 RT @okezonenews: Saksikan Rerun Live Streaming Hot Seat bersama @vidialdiano malam ini pkl 20.00 WIB Klik: https://t.co/tFO2Wg8sUI #Kongkow… RT @JRadio917FM: #INDO20 Edisi ke6 Posisi 09 --&gt; @vidialdiano ~ Definisi Bahagia | Host: @sayAKHSA | MD: @Egha_Aulia RT @FavoritRadio: #DaftarTunggu #IndoHits30 Edisi 06 \n1. @MarioClau_21 - Sepanjang Hidupku\n2. @ABackBone - Panah Takdir\n3. @vidialdiano - D… RT @RRIBanten: #sedangdiputar Vidi Aldiano - Definisi Bahagia #BantenSiangAkhirPekan @vidialdiano Morning! Just a friendly reminder that my new single #DefinisiBahagia is now available on @SpotifyID. check it out: https://t.co/0yVBDpKX99 https://t.co/vHEajxItjD / DEPOK BESOK! /\n\nCan’t wait to join All New Sienta #PopUpPlayground – Lifestyle Bazaar… https://t.co/NIlXtjvYNx Yeiy TGIF! Weekend adalah salah satu #DefinisiBahagia banget sih ya? Sambil nonton lyric video #DefinisiBahagia: https://t.co/YAWBV7nL5P / Definisi Bahagia = Kesempurnaan Cinta / @ MNC TV https://t.co/EpluSLIluE Sudah standby, beberapa menit lagi LIVE di https://t.co/HgcOGfGwGl, yuk stay tuned! Selamat pagi! Hari ini, Jumat (10/2) akan on air @hardrockfm &amp; @detikhot pukul 09.00 WIB &amp; di @okezonenews  pukul 15.00 WIB #DefinisiBahagia https://t.co/wUUcrJ2B05 Coba absen siapa yang udah denger #DefinisiBahagia? Yang belum bisa di dapertin di iTunes &amp; @AppleMusic ya: https://t.co/BFxR51OxLd https://t.co/Q9fVOAYJhm Akan ada 2 lagu yang akan saya bawakan malam ini di Seleb On News Award @Official_MNCTV! Stay tuned Vidies! #DefinisiBahagia Get my latest single #DefinisiBahagia, official on @JOOX_ID #JOOXID, click here: https://t.co/srnsAIbMWK https://t.co/JULXxvvQwY Siapa aja disini yang udah denger karya terbaruku dengan judul #DefinisiBahagia? Malam ini akan hadir di Seleb on News Award @Official_MNCTV berbagi #DefinisiBahagia dan akan ada performance special juga! Definisi Bahagia bagi Vidi adalah makan, shopping, keluarga dll, semuanya lengkap di lyric video #DefisniBahagia: https://t.co/YAWBV7nL5P #DefinisiBahagia sudah bisa didengarkan di @SpotifyID lho, simply click here: https://t.co/0yVBDq2yxJ https://t.co/F0DJWl9kYm Jakarta aku padamu. Udah naik ojek masih aja lama jaya dijalan. Woohoo! https://t.co/PIjMW8Y2ZV Selamat pagi Indonesia! Pagi ini akan hadir berbagi #DefinisiBahagia di @SarahSechan_NET 09.00 WIB! Stay tuned di @netmediatama ya! Besok pagi akan Live @SarahSechan_NET nih. Ternyata pindah pagi jam 9 ya sekarang:) #DefinisiBahagia Siapa yang belum liat lyric video #DefinisiBahagia? Klik link berikut ya: https://t.co/YAWBV7nL5P RT @pro2purwokerto: Now: @vidialdiano - Definisi Bahagia &gt;&gt; @geishaindonesia - Aku Lah pelangimu &gt;&gt; @calvinjeremy - Kita #HaltePagi #ICUPro… RT @afriliani_: 🎶 apa mungkin dia definisi bahagia? dengannya ku bersedia habiskan usia.\nkarena pada hatimu ku terjatuh\n🎧 @vidialdiano - de… RT @dutafm: #NOP Definisi Bahagia @vidialdiano @JavafigerAndOrganicStudio on #Indonesiahits with @EbbyLessyl keep stay tune @dutafm RT @pilaradio886fm: #NP Galih &amp; Ratna - @GAC_music | Defisini Bahagia  - @vidialdiano | #JARE_E MD @lutfiPILARadio RT @autoradio889fm: NP @vidialdiano - Definisi Bahagia #autoradio889fm RT @lagujuaracom: ⭐ Greatest gainer of the week, naik 6 peringkat ke posisi 11! Definisi Bahagia - @vidialdiano https://t.co/GED0N72HwU #20… Dapatkan single terbaru saya #DefinisiBahagia official di iTunes @AppleMusic: https://t.co/BFxR5268CL https://t.co/PiesxwyUmC Siap2 untuk #IdolJrDuetBattle @IndonesianIdol di @Official_MNCTV. Yuk stay tuned kawan! / IFW 2017 /\n\nBersyukur sekali kemarin bergabung bersama keluarga besar @wardahbeauty untuk… https://t.co/BfkismY5Mo Keseruan kemarin 'Youniverse @wardahbeauty Celebration Of Colors' Indonesia Fashion Week 2017, so much fun! Thank you for having me! https://t.co/1NowiXhDza Siap2 manggung di acara @kaskus #RunToVote di FX Sudirman! https://t.co/TyXvgrgjx9 / Pagi sehat /\n\nSelamat pagi! Siap-siap untuk menghibur kawan-kawan sehat yang lagi CFD di acara… https://t.co/QM7dRgPxDh RT @dutafm: #Playreq Definisi Bahagia @vidialdiano on #Petasan with @ebbylessyl keep stay tune @dutafm RT @pro2tpi: #Np : @vidialdiano - Definisi Bahagia\n@GAC_music - Galih Dan Ratna\n@TheChainsmokers - All We Know\n\n#SemangatPagi with @EzaBint… RT @JRadio917FM: #INDO20 Edisi ke5 Posisi 12 --&gt; @vidialdiano ~ Definisi Bahagia | Host: @sayAKHSA | MD: @Egha_Aulia RT @Kiwarifmradio: #IndoHitsTop10 Posisi 5 @vidialdiano - Definisi Bahagia cc. VA Records Woohoo. Thanks Ardan! Btw, itu harusnya #DefinisiBahagia yaa haha https://t.co/6dZGjYDkCp / Work work work /\n\nThe hardest lift of all, is lifting your butt off the couch. Let's do… https://t.co/NBevXQU2LK Selesai dari @Urbanbandung, lanjut skrg Live di @RadioB956fm dari Hotel Grand Tjokro Bandung! Yuk stay tuned! #DefinisiBahagia RT @netmediatama: Mau liat gimana keselnya nona @audimarissa_ makan puding? Dan jg keseruan tuan @vidialdiano?\n\nSiap2 sore ini ya di @TheCo… RT @TheComment_NET: Yg mau CD dr @vidialdiano, kirim foto km lg nnton The Comment dan kasih tau knp kalian suka bgt nnton The Comment dgn #… Yuk! #PersonaVA #DefinisiBahagia https://t.co/lx43SpACGU RT @ardanradio: TAJEMZ!\nTantangan Ngejamz bareng @vidialdiano covering Closer\n\nOnly on Ardan Ngejamz #SuperMusicID\n#RadioAnakMudaNo1DiBdg h… RT @ardanradio: Perform nih!\n@vidialdiano bawain Singlenya yang belum release \"Kau\" ~\n\nPaling baru dong! Only on Ardan Ngejamz\n#SuperMusicI… RT @ardanradio: Malam ini di Ardan Ngejamz #SuperMusicID\n\n@rasmusARDAN sama @peterARDAN bakalan ketemu @vidialdiano\nBakal ngapain ya~\n#Radi… Yuk Bandung ramaikan! Jam 22.00 WIB ya! @ardanradio #CumaDiArdan https://t.co/5WOfQekyKP RT @RASEFM: Oh Tuhan tolonglaaah aku cintaa ku cinta diaaaa... @vidialdiano on #RaseRumpiesHour keep stay tune ya.. https://t.co/iApnvrGGMz RT @RASEFM: Apa sih #DefinisiBahagia menurut @vidialdiano ? Yuk @VidiesBandung dan Pendengar Rase kita merapat ke #RaseRumpiesHour bareng @… Selesai radio pertama disamperin @VidiesBandung !! You're the best guys!!!!! Lanjut yuk kita ke radio selanjutnya! https://t.co/bUnjBcaJe4 Sudah mendarat di Bandung! Skrg langsung on air @RASEFM!! Yuk stay tuned teman-teman Bandung! #DefinisiBahagia HALO BANDUNG! Akan berada disini selama 2 hari untuk berbagi #DefinisiBahagia! See you guys, @VidiesBandung! https://t.co/WOTZek0zgi RT @Adriandhy: Judging by costumes, it's a missed opportunity not to name this film \"Train To Busana.\" https://t.co/Nywj3FMgcv RT @_VIDIES_: Hari ini @vidialdiano akan keliling radio Bandung, ini salah satunya @rasefm hope you enjoy Vid! 😊 https://t.co/XHcyRayj2B RT @VidiesBandung: Selamat pagi !!! Hari ini dan besok #DefinisiBahagia @vidialdiano bakal mampir ke Bandung loooh~~ https://t.co/iUlzZvZX12 / Resolusi 2017 /\n\nSalah satu resolusi 2017 gue, lebih sering olahraga! Kalo lo?… https://t.co/8h3AsW8Iy4 / Definisi Bahagia /\n\nAdalah ketika kemarin saya bisa bernyanyi lagu terbaru saya khusus untuk… https://t.co/9l5WQQsUu1 RT @dahSyatMusik: Kita liat dulu yuk \"Definisi Bahagia\" ala @vidialdiano #SelasaBingitz https://t.co/pu6l1pfuAq Selamat pagi! Akan membagikan #DefinisiBahagia pagi ini di @dahSyatMusik! Stay tuned yaa di @OfficialRCTI! RT @Kiwarifmradio: #Np : @edsheeran - Shape Of You [next] @vidialdiano - Definisi Bahagia [next] @reyutami @bangbenua - Selalu Bersama #Kiw… #vidies BANDUNG mana suaranya?! #DefinisiBahagia adalah bisa 2 hari seru seruan di Bandung! Catet lokasi &amp; jamnya ya! Sampai jumpa kawan! https://t.co/8Y1ik45ZFo RT @tutitribdsss: Kira2 good voice ga yah ? Kok gue yg deg2an ya kak. Haha @vidialdiano #ICanSeeYourVoice2Vidi 😀 RT @tikatryie: Iklannya lama amat,,,\ngk tau apa pengen cepet liat kak @vidialdiano di @ICanSeeINA dapet g00d v0ice apa bad v0ice.. #ICanSee… RT @IfaSibarani: yee dah mulai #ICanSeeYourVoice2Vidi siapa yg dipilih kak @vidialdiano  yaaaaa https://t.co/1aQdSPy3df RT @IcanSeeINA: Hayooo.. Kak @vidialdiano tegang bangeet. Good Voice ga nih yaaa? XD #ICanSeeYourVoice2Vidi https://t.co/VEuk48jDOW RT @MOTION975FM: 30 menit lagi #PulangKantorbarengvidi merapat yg mau tau cerita single terbaru #DefinisiBahagia @vidialdiano nanti ditemen… RT @IcanSeeINA: Yeeeyy!!! Hari ini Kak @vidialdiano siap jadi Superstar! Yuk nyanyi bareng \"Hingga Nanti\". #ICanSeeYourVoice2Vidi https://t… Sudah hadir di #ICanSeeYourVoice2Vidi ! Yuk stay tuned semua di @Official_MNCTV!! @IcanSeeINA RT @SonoraFM92: Setelah kebut2an, @vidialdiano akhirnya datang nih di #SonoraJakarta :D yang penasaran #DefinisiBahagia, yuukk merapat!! #V… RT @sonora_semarang: Yuk yg mau tanya2 ke @vidialdiano bisa langsung mention,\nSMS/WA: 0812.112.9200 ditunggu s/d jam 4 ya ! #VIDIDiINDONESI… RT @MNCupdate: Yeay!!! @vidialdiano bakal jadi superstar di #ICanSeeYourVoice2Vidi . Gak sabar kan ngikutin serunya? Pantengin @Official_MN… RT @RiafmSolo: Nanti sore ada @vidialdiano  dengan single terbarunya yg bakal hadir di #Indonesiana 15:00 - 16:00 WIB https://t.co/fEFNSrZu… Selamat ulang tahun girls!!! Have a great one yaa! #DefinisiBahagia https://t.co/4uDAxpwNTI Jadwal Senin 30 Januari 2017. Sampai berjumpa diudara kawan! #DefinisiBahagia https://t.co/jGgASJtqKN Jadwal hari ini : HUT @CosmopolitanFM 10.30 WIB. @sonora969 15.00 WIB. @IcanSeeINA @Official_MNCTV 16.30 WIB. @MOTION975FM 17.00 WIB! RT @IcanSeeINA: Wohhoo!!! @vidialdiano siap jadi superstar di #ICanSeeYourVoice2Vidi!!!! Udah ga sabar kan buat ikutan serunya? Stay tune p… Barusan adalah keputusan tersulit yang harus saya ambil sebagai juri. To be honest, both Naura &amp; Navis don't deserve to be in the bottom 2! Im very confused with today's result .... #IdolJrJudgesSave Yuk stay tuned di @IndonesianIdol @Official_MNCTV #IdolJrJudgesSave sekarang!! https://t.co/HGQvjmdyXt Hari ini akan kembali hadir di Indonesian Idol Jr @Official_MNCTV 15.30 WIB! Lanjut ke Tangerang City utk visit store KFC! Yuk! https://t.co/jwc6Pzp9Gn / Weekend /\n\nSelamat berakhir pekan &amp; selamat Tahun Baru Cina untuk teman-teman yang merayakan… https://t.co/edFAa2q3UA RT @SheratonBDG: #INDOKUSTIK bersama @vidialdiano &amp; Kirana, tgl 1 Februari 2017 mulai jam 4 Sore live dari Toastina. Ditunggu! https://t.co… RT @ardanradio: NEW!\n@vidialdiano - Definisi Bahagia\n\nNEW!\n@Latinka - Takan Nyata\n\nDi Ardan Persada 7 Lagi Edisi 313\n#RadioAnakMudaNo1DiBdg Update schedule beberapa hari kedepan, sampai jumpa #vidies! #DefinisiBahagia https://t.co/1pmZkjCzCs Supporting Indonesia by tweeting this tweet! Go #Indonesia #MissUniverse !!!! I added a video to a @YouTube playlist https://t.co/vYtQhn7w4X Self Goal Vidi Aldiano - Lunasi Cicilan Hingga Soal Cinta I added a video to a @YouTube playlist https://t.co/JC165Sgpdz Definisi Bahagia Ala Vidi Aldiano: Mie Instan! RT @ardanradio: Now Playing!\n@armandmaulana - Sebelah Mata\n\nNext!\n@vidialdiano - Definisi Bahagia\n\nRIAUW\n#RadioAnakMudaNo1DiBdg Jadi, siapa yang menurut kalian unggul di debat cagub DKI Jakarta sekarang? #AnakTangselMenyimak Pengumuman! Sekarang di LINE Official Vidi Aldiano, lagi ada Video cast, performance kemarin di mini showcase! #DefinisiBahagia / Triple Platinum 💿💿💿 /\n\nDan terima kasih untuk semua penikmat musik Indonesia yang masih… https://t.co/a1bg1tAFbl Kmrn bersyukur sekali mendapatkan sertifikasi triple platinum untuk album ketiga saya berjudul PERSONA! Terima kasih kawan utk supportnya RT @dFas_Indramayu: #opening @vidialdiano - devinisi bahagia //  #DREQ W/@Tutyaz_Intaka MD.@yanewidia RT @bahanafmjkt: Penyanyi @vidialdiano merilis lagu terbarunya berjudul 'Definisi Bahagia'. Di Info Terbaru bersama BAHANA @chesteraditya #… RT @KalimayaBaskara: #NA Shape Of You by @edsheeran // Paris by @TheChainsmokers @emilywarrennnn // Definisi Bahagia by @vidialdiano on #Mo… RT @UFM947: Tune in di #CWU947 yaaa!! \n@vidialdiano sudah ada di studio #UFM947 lohh 😀😀 https://t.co/nTq68jN4Vz Lanjut jam 6 WIB sore di  @UFM947 ya, lets! #DefinisiBahagia https://t.co/waKnRGLwVU Jam 5 WIB sore ini akan ber #DefinisiBahagia di @WomanRadio943FM, stay tuned #Vidies! https://t.co/PnEHSMLV3f / !!! /\n\nBersyukur sekali kemarin bisa mendapatkan private vocal coaching bersama Seth &amp;… https://t.co/s9u1l0SrQt Sudah on di #ICUPro2FM_VidiAldiano nih!!! Yuk stay tune di RRI kota kamu sekarang! #DefinisiBahagia Besok pagi kita ber #DefinisiBahagia rame rame yuj di @Pro2Jak Indonesia, cek frekuensi kotamu disini ya. See ya on the air #Vidies! https://t.co/bIV3eLsFHE Baru saja mendarat dari Balikpapan, skrg lanjut menuju @Official_MNCTV untuk @IndonesianIdol  junior! Akan perform #DefinisiBahagia juga ni! / alhamdulillah /\n\nBersyukur punya kerjaan yang bikin gue bahagia, dan semoga bikin bahagia juga… https://t.co/22nIp1jEz3 SAMARINDA ASIK!! Thank you SMPN 1 &amp; Telkomsel LOOP for having me back! Selamat ulang tahun SMPN 1 &amp; Kota Samarinda! https://t.co/NgfCi3nVqA / SAMARINDA /\n\nPanas!! Bisa karaoke masal sama kawan-kawan SMP 1 Samarinda barusan adalah salah… https://t.co/OOGqo8LtPW Malam Samarinda! Lagi siap2 untuk perform di SMP 1 Samarinda malam ini. Kira2 udh pada hafal lagu baru gue blm yaa? See you soon guys! / #DefinisiBahagia /\n\nSalah satu barang yang bikin gue bahagia dari dulu adalah sepatu! Kalo… https://t.co/kuohELqaVk Selamat pagi Indonesia! Menuju bandara untuk siap2 ke Balikpapan, lanjut Samarinda. Ini dia agenda hari ini dan besok! https://t.co/urJtRHvzN1 RT @athasoemarko: The inauguration: kenapa cuma gerimis? A downpour would've been fun. Mendarat dirumah juga akhirnya. Besok akan ke Balikpapan utk visit store KFC, lanjut manggung di Samarinda. See u tomorrow guys! https://t.co/h1h5qmWfZi / #DefinisiBahagia /\n\nVideo lirik nya sudah hadir ni di Youtube channel saya! Siapa yang udah… https://t.co/UZY4V0p0UP RT @ELFARAFM: #LISTENUP \n\n@vidialdiano - Definisi Bahagia \n@andienaisyah - Belahan Jantungku \n\n#HITZTERIA RT @Iradiojakarta: Terima kasih @vidialdiano sudah hadir menghibur IListeners di #SatuJamBersama siang hari ini, sukses terus untuk single… RT @Iradiojakarta: Ini dia penampilan dari @vidialdiano saat membawakan single terbarunya yang berjudul #DefinisiBahagia di #SatuJamBersama… Yuk! #DefinisiBahagia #SatuJamBersama https://t.co/NGr4quL8R7 Sudah hadir di @Iradiojakarta! Coba sebutkan #DefisiniBahagia anda hanya dengan SATU KATA. Nanti kita bacain on air! Ini jadwal weekend ini! Sampai bertemu besok teman-teman Vidies Balikpapan &amp; Samarinda! https://t.co/iHMu2EqBYY Jam 2 siang ini di akan LIVE di #SatuJamBersama @Iradiojakarta. Yuk tweet pertanyaan, nanti Vidi jawab ya, lets go! #DefinisiBahagia https://t.co/rhm3gAa7At Selamat pagi! Hari ini akan taping di Hardrock FM Jakarta, lanjut siangnya akan Live @Iradiojakarta untuk lagu #DefinisiBahagia! Letsgo! Wow gercep sekali langsung ada tayangannya. Go check'em out Vidies! #DefinisiBahagia #TNSdefinisibahagia https://t.co/26EFC6spj2 RT @TonightShow_NET: MEET AND GREET ala TONIGHT SHOW! Spesial buat @vidialdiano !! #TNSdefinisibahagia https://t.co/9R32OGciIV RT @netmediatama: Dan @vidialdiano jg akan membawakan lagu barunya PERTAMA KALI di @TonightShow_NET pkl 23.00 WIB. #TNSdefinisibahagia RT @netmediatama: Waaah!! Lagi Meet &amp; Greet @vidialdiano #TNSdefinisibahagia, terus lihat wartawannya kayak ada yang kenal ya? ;D hihihi @T… RT @TonightShow_NET: VIDI ALDIANO - DEFINISI BAHAGIA #TNSdefinisibahagia https://t.co/rnL1Hbmlin Thank u sudah menonton @TonightShow_NET &amp; buat #TNSdefinisibahagia jadi TT! Cek timeline mereka utk dapetin CD terbaru gue! #DefinisiBahagia RT @TonightShow_NET: Mimin punya 2 CD terbaru @vidialdiano buat 2 orang pemenang !! #TNSdefinisibahagia Sebentar lagi akan Live @TonightShow_NET. Siapa yang masih melek nih guys? #DefinisiBahagia RT @vidies_sejati: 5 menit lagi @vidialdiano di @TonightShow_NET ! #TNSDefinisiBahagia #DefinisiBahagia Terima kasih buat yang udah ikutan twitter party #DefinisiBahagia, masih rame banget! \n\nSorry gak bisa semua ke reply, love you guys!!! RT @vidies_sejati: Yayyyy! Setengah jam lagi nonton @TonightShow_NET ya #Vidies akan ada kak @vidialdiano ! #DefinisiBahagia ❤ RT @netmediatama: Tonight lovers, musisi ganteng @vidialdiano jg pasangan @apriliokevin &amp; Vicy Melanie bakal seseruan bareng di @TonightSho… RT @dewi_psi121: Sepertinya @vidialdiano habis makan, jadi jempolnya masih semangat buat balesin mention yang buanyak dari #vidies RT @Cyntia_Dewi12: #DefinisiBahagia itu bisa piknik bareng Vidies walau gk ada schedule @vidialdiano , disela kesibukan kita masing2☺ https… RT @NesyaaSofiana: Semakin banyak bersyukur semakin banyak #DefinisiBahagia yg bakal dirasakan, ya ga ka Vid @vidialdiano ? Contoh : bersyu… RT @Iradiojakarta: IListeners yang mau tanya-tanya apa aja sama @vidialdiano besok siang bisa pakai hashtag #SatuJamBersama ya, nanti akan… RT @viramahriva: Yes, semenjak album Persona keluar \"Definisi Bahagia\" jadi salah satu yang favorite, nextnya \"Terbenar\" dongg hehe. Congra… You are most welcome! Thank you juga yaa sudah bersama sama nge- #DefinisiBahagia https://t.co/2v8j5Bm96U RT @RaniSicachu: @vidialdiano #DefinisiBahagia itu adalah bs kumpul sama2 teman lama, lupain segala kesibukan dunia, mengukir senyum &amp; tert… RT @trisnanurhakim: Ini dritd bertanya tanya penasaran. Itu duit nya knp dua rebuu semua? Hahaha #DefinisiBahagia @vidialdiano https://t.co… Hahaha bener bener makan itu #DefinisiBahagia yaa https://t.co/SsbZ7BiTQY RT @nysha_rahmayani: Definisi bahagia itu saat mengagumi @vidialdiano dari th 2008 dan akhirnya baru ketemu d th 2016 di acara MTQ di lombo… RT @atikahanum: @vidialdiano #DefinisiBahagia itu ketika bertemu dengan keluarga Ibuku dan berkumpul bareng teman-teman 😄😃 RT @AzizzahAdmaja: #definisibahagia\nBarakallah untuk lgu ini semoga menginspirasi Azizzah mas @vidialdiano https://t.co/9kCmMk5C3k RT @TonightShow_NET: Untuk pertama kali @vidialdiano perform single terbarunya Definisi Bahagia di Tonight Show… https://t.co/2y26a741jl Yes stay tuned guys! #DefinisiBahagia https://t.co/22cuF0YZTa RT @Indryawn: @vidialdiano #Definisibahagia menurut aku sih 100 my dreams come true, salah satunya bisa ketemu kak vidi😂 Wah pernah kepikiran sih, we'll see! #DefinisiBahagia https://t.co/1y94M4jbgp RT @Nyoman_darsane: @967HitzFM Terimakasih bnyk HitzFM 😙 and penyiar @hanskokoh @DEFFROFL Yang kece 😉 sdh dtngkan @vidialdiano #DefinisiBah… Amin! Bener banget! #DefinisiBahagia https://t.co/4SD7yTmoqZ RT @thessanoviani1: @vidialdiano #DefinisiBahagia itu ketika bisa nginjakkan kaki di SEOUL untuk nonton konser SHINee oppa ☺☺♥ Yes yes agree! #DefinisiBahagia https://t.co/TtxAhTTPLx RT @R4putri20: Bahagia itu ketika kamu membahagiakan orang-orang yang berada di sekitar kita @vidialdiano #DefinisiBahagia jangan lupa untu… Haha keren! Boleh ditiru nih caranya #DefinisiBahagia https://t.co/VJ8ksHU8Cd Ya Allah jaman kapan ini haha makasih yaa #DefinisiBahagia https://t.co/btDS6EhGsB Aww thank youuu #DefinisiBahagia https://t.co/DQb7PKxtLn Haha sekarang TTI nomer 3! Wah makasih yaaa #DefinisiBahagia https://t.co/1PBTGbSMDo RT @beatrix_alind: #DefinisiBahagia itu waktu pertama kali ketemu ka @vidialdiano di Semarang pas ulang tahun temen aku ❤ Kapan ka VA ke se… Wah keren jadi asdos! Selamat mengajar ya, semangat! #DefinisiBahagia https://t.co/ukKOgBQ1LX RT @mettamalisha: Jadilah #DefinisiBahagia yang selalu kunanti 💙 hadirkan bahagia dihati 💙 @vidialdiano https://t.co/VBWMuK74qr Waaah super nice! Thank you ya guys for always be the biggest supporter, happy! #DefinisiBahagia https://t.co/tULYwoPkCV RT @SandistyaSusan: Pas bgt di lirik #DefinisiBahagia kan ku petik bintang di langit ke 7.. Malam ini bintang nya lg bnyk ditemenin sama pa… RT @RiznaWahab: #DefinisiBahagia Acc proposal skripsi 😅 Doakan ya kak @vidialdiano Haha ya ampun makasih yaa #DefinisiBahagia https://t.co/HZtExyEcBk RT @VaniNatalia_: #DefinisiBahagia itu kalo tweet aku diretweet kak Vidi haha :) @vidialdiano Yes setuju, tanpa harus berlebihan, yang penting bersyukur dan terus berusaha! #DefinisiBahagia https://t.co/R3PVqEzsYR RT @dewi_psi121: Wow, udah hampir 2 jam nih @vidialdiano senam jempol demi bisa berkomunikasi sama #vidies. Salut!! #DefinisiBahagia RT @NesyaaSofiana: Ku harap engkau mengerti kau lah yang selalu ku nanti hadirkan bahagia di hati wahai #DefinisiBahagia @vidialdiano 💞🎶🎶 Semangat UASnya yaaa #DefinisiBahagia https://t.co/VfdI7r44be Jadi dong! Stay tuned ya Tonight Show NET malam ini! #DefinisiBahagia https://t.co/O80zDl1TE8 Lyric video from my latest single #DefinisiBahagia on youtube, watch here: https://t.co/jMaZKdgJwA Hai Tasik, see you soon ya! #DefinisiBahagia https://t.co/SQeNaVgOnx Kapan yaa, sekarang deh kayaknya haha #DefinisiBahagia https://t.co/WOScQ8giTL Terima kasih sekali lagiii #DefinisiBahagia https://t.co/tpP6XpXKbW RT @fdhilahh_04: Masih twitter party kah kak @vidialdiano ? Aku ketinggalan nih😭😭😭 #DefinisiBahagia Haha seru amat, iya betul gak jaim dan bisa jadi diri sendiri yaaa #DefinisiBahagia https://t.co/4gLNHjY5v2 Mayan sih sesungguhnya haha #DefinisiBahagia https://t.co/L41JzNN0jz Waah inget bgt ini! See you soon ya guys! #DefinisiBahagia https://t.co/2w0OJn6lKK Banget! Aduuh namanya aja bumbu takoyaki haha #DefinisiBahagia https://t.co/Gq2W92gR7B Hhm siapanya kira kira.. haha #DefinisiBahagia https://t.co/P84qbpl1GG Ayaflutu haha makasih yaa #DefinisiBahagia https://t.co/Y05ON6DZdc Siapa yang belum peka? Haha harus selalu bahagia yaa #DefinisiBahagia https://t.co/uzgMan9c7t RT @EkaMelindaNurSa: Uhuuuy #DefinisiBahagia live now on @967HitzFM !! Adem suaranyaa euy. \nPada hatimu ku terjatuh ❤❤🎤🎤 @vidialdiano WA JIB! #DefinisiBahagia https://t.co/xVt6sHoZrK Wah mirip banget, memang mama ya yang paling segalanya, salam untuk mamanya ya! #DefinisiBahagia https://t.co/sOwQRNDEv8 Glad you like it! Makasih ya supportnya! #DefinisiBahagia https://t.co/ixIDO4U75d Ya bener sih haha #DefinisiBahagia https://t.co/wadGyQpdn9 Iya dong harus lebih bahagia! #DefinisiBahagia https://t.co/H6w5KZgd0N Balas! Haiii #DefinisiBahagia https://t.co/op44jRmuKj Thank you ya! #DefinisiBahagia https://t.co/MzfIVEkfqr RT @_VIDIES_: Now on @967HitzFM #DefinisiBahagia by @vidialdiano live accoustic ❤ Stream my latest single #DefinisiBahagia on @SpotifyID : https://t.co/0yVBDpKX99 https://t.co/RVSW82ZJDs Selamat bergabung #DefinisiBahagia https://t.co/34UT3K66tT Aww salam ya buat mama nya #DefinisiBahagia https://t.co/uqFoeIzaHj OMG yummy!! #DefinisiBahagia itu makan banget sih memang haha https://t.co/woqcmneZ44 RT @eshardauna: @vidialdiano Orang yang jadi #DefinisiBahagia saya yaitu kak vidi sendiri, idola sekaligus inspirasi (Sumpah gak boong) haha udah nyaris banget tuh kebaca namanya, ayo ayo siapa yang dikodein ini #DefinisiBahagia https://t.co/qtFP8uX9dW RT @NesyaaSofiana: @967HitzFM duduk manis stay tuned #HitzHoreHara nungguin #DefinisiBahagia sekalian ngobrol bareng @vidialdiano yeayy! Yes, setuju, bikin kita juga jadi tersenyum bahagia #DefinisiBahagia https://t.co/uffeovAwsG Amin, see you soon yaa #DefinisiBahagia https://t.co/epwbgaOYbw Nih sekarang haha #DefinisiBahagia https://t.co/YQXir339jr RT @Chembberkevds_: Ketika lagi garap skripsi terus disemangatin kavidi sih #DefinisiBahagia sebahagyaaaa bahagiaaaanya, syg tenggelam mele… Haiii! #DefinisiBahagia https://t.co/3pfdsUl6D8 RT @Nyoman_darsane: Haiii... waktunya @vidialdiano di @967HitzFM 😄 dgn penyiar kece @hanskokoh @DEFFROFL  Merapat Vidies #DefinisiBahagia #… Amin amin, didoakan, semangat terus ya, pasti dapet! #DefinisiBahagia https://t.co/ig7QyDwyzy Iyes kurang lebih, biar kita semakin sadar tentang #DefinisiBahagia, yang kadang sebenernya simple dan ada diseleliling kita. https://t.co/ATBn9RVFaI RT @mutmainnah654: #DefinisiBahagia ku pertama kalinya ketemu @vidialdiano pas dimakassar, jadi pengen ketemu lagi nih 😀😁 Iya tenggelem, tapi sekarang keliatan nih haha #DefinisiBahagia https://t.co/CpnYyirwQN Masa iya gak dibales? Haha #DefinisiBahagia https://t.co/Vbf8QXu5lU Waaah enjoy the moment ya! #DefinisiBahagia https://t.co/kRIAjHxzq6 RT @SandistyaSusan: @vidialdiano love banget deh sama karya nya bang vidi.. Dan semoga Vidies makin bertambah banyak.. Siapa tau ada vidies… Blo! Haha abis ditransfer tuh iya banget sih! Bentar lagi akhir bulan sabar ya #DefinisiBahagia https://t.co/dVKHbGe6X6 Amin ya Allah, semoga segera tercapai ya #DefinisiBahagia https://t.co/9aJoGNFPoE RT @ainul_inong: Sukses buat ka @vidialdiano dengan lagu #DefinisiBahagia dan buat gue lanjuuuuttt bikin laporan 😂😂 Wah salam buat mamanya ya, selamat ter senyum senyum tante haha #DefinisiBahagia https://t.co/8akXBxSKkf Haha salam ya buat dospem nya! #DefinisiBahagia https://t.co/KjKkPbxK0z Amin, makasih ya #DefinisiBahagia https://t.co/eRslMfiU1s Waah selamat yaa! #DefinisiBahagia https://t.co/txDOBZDNgl RT @mutiara_muvi: Party twitter @vidialdiano sambil denger @967HitzFM . Stay tune #vidies ada vidi lagi promo single terbaru #DefinisiBahag… RT @komala49: @vidialdiano trending topic yah,membuat kita lebih semangat lagi nih.. Happy sweet 17 ya! #DefinisiBahagia https://t.co/FZ8ahUM6Fo Ngumpul bareng temen temen nya, ngerjain tugas bareng nya, kangen! #DefinisiBahagia https://t.co/6xfnnUCSqx Wah Alhamdulillah! Thank you #vidies! #DefinisiBahagia https://t.co/xpA78kC4Ts Yes stay tuned! #DefinisiBahagia https://t.co/klMnspn2ZY Kira kira kalo seseorang bisa jadi #DefinisiBahagia buat kamu, siapa? *coba sekalian kode haha https://t.co/eUjt6Bgqa2 Cep cep jangan nangis dong! #DefinisiBahagia https://t.co/Pdpd3H6VGg Niat dong! Bales apa ya kira kira? Haha #DefinisiBahagia https://t.co/ldLbYKDKBo Aku padamu juga! #DefinisiBahagia https://t.co/CyLKucTVEs Yes yes lanjutkan! #DefinisiBahagia https://t.co/A4eqo9wcXb RT @abidabidbid: #DefinisiBahagia setelah resign dpt lagi kerjaan yang lebih baik lagi dari ini 😊 #semoga mohon do'a y ka @vidialdiano Soon! Tahun ini banyak plan untuk #VAgoVlog, nantikan dan doakan ya! #DefinisiBahagia https://t.co/b7rUO6S4HV RT @Imhaa93: Main game trus dapet HIGH SCORE yihaaaa itu #DefinisiBahagia gue, 😝✌️@vidialdiano Anda beruntung! Haha #DefinisiBahagia https://t.co/Wyx1afYHca Ciyeeee, tag dong doi nya haha #DefinisiBahagia https://t.co/Te8VPkR8Dh Amin ya Allah, doanya juga sama ya untuk seluruh #vidies dimanapun kali berada #DefinisiBahagia https://t.co/UsfLpaEotS Wadoh umur berapa ya, sekitar SD sih yang pasti #DefinisiBahagia https://t.co/Fl5YI7LWKn Amin! Semoga cair ya besok #DefinisiBahagia https://t.co/0EcqKEqVvU Hasemel belum, yuk! #DefinisiBahagia https://t.co/zQmg8dWhui Wah keren! Amin, semoga kepilih ya! #DefinisiBahagia https://t.co/T2MlOR0PTk Amin! Doakan ya, thank you for the endless support #DefinisiBahagia https://t.co/5IiIS5wQA3 Ohyes, haiii! #DefinisiBahagia https://t.co/SXBWJwgr6o Akhirnyaaa, hope you enjoy! #DefinisiBahagia https://t.co/nkFGraNFHi RT @abidabidbid: #DefinisiBahagia itu dpt mention or terwujud ketemu langsung sm ka @vidialdiano huhu🤗 Amin, see you soon ya! #DefinisiBahagia https://t.co/R5WT6J1ze6 Haha semangat ya semua yang sedang ujuan kehidupan #DefinisiBahagia https://t.co/jtiTIXSnW0 RT @ervitaanggraini: @vidialdiano Keluarga satu2nya yg gak akan pergi ninggalin kita walaupun kita pergi mereka tetep nunggu kita balik #De… RT @SandistyaSusan: @vidialdiano Travelling bareng keluarga trus nyobain kuliner sambil dengerin #DefinisiBahagia bahagia jd satu.. Hahahaa… Nice! Perfect combination! #DefinisiBahagia https://t.co/2UOH8BrZz7 Me too! #DefinisiBahagia https://t.co/mGiSz9WkA2 Haha bisa aja, makasih ya #DefinisiBahagia https://t.co/xIMqlSfzOd RT @ervitaanggraini: Keluarga #DefinisiBahagia https://t.co/JkCxHfDDvq RT @tyaseftia: Kaviiid @vidialdiano suka bgt ih video lirik #DefinisiBahagia nya, gemes sm desain dan warna2nya :3 btw jd pgn warnain rambu… Nyamm kerupuk! Haha #DefinisiBahagia https://t.co/mm0MQ7KdqC"}