{"tweets": "Test of Crew Dragon’s upgraded launch escape system ahead of static fire and in-flight abort tests – altogether we are conducting hundreds of tests to verify the system's advanced capabilities to carry astronauts to safety in the unlikely event of an emergency https://t.co/a4FucMh85l RT @NASA: We're opening our doors to 50 social media users to witness the next @SpaceX cargo launch to the @Space_Station! 🚀 \n\nApply NOW to… RT @nasahqphoto: Administrator Bridenstine visited @SpaceX headquarters today to see the progress being made on @Commercial_Crew flights to… RT @NASA: Administrator Bridenstine is visiting @SpaceX headquarters today to see the progress being made on @Commercial_Crew flights to @S… RT @Commercial_Crew: The @SpaceX Falcon 9 rocket and #CrewDragon spacecraft that will be used for the In-Flight Abort test have arrived at… Ultimately, Starship will carry as many as 100 people on long-duration, interplanetary flights https://t.co/mDujtYeLwV Starship will provide affordable delivery of significant quantities of cargo and people, essential for building Moon bases and Mars cities https://t.co/0BImZP1qmM Starship will use in-space propellant transfer to enable the delivery of over 100t of useful mass to the surface of the Moon or Mars https://t.co/pzCUebidZg Starship will be the most powerful rocket in history, capable of carrying humans to the Moon, Mars, and beyond https://t.co/LloN8AQdei Raptor is a full-flow, staged combustion rocket engine powered by cryogenic methane and liquid oxygen https://t.co/7JCvK4Gm6b Starship serves as a large, long-duration spacecraft capable of carrying passengers or cargo to Earth orbit, planetary destinations, and between destinations on Earth https://t.co/NoNoOjBW50 11 years ago today, we launched our first successful mission. To date, we’ve completed 78 launches and have developed the world’s only operational reusable orbital class rockets and spacecraft—capable of launching to space, returning to Earth, and flying again https://t.co/5L0q9PJ90P Starship update live now https://t.co/JSD3Bx9MGY Watching some weather in the area; moving Starship update to no earlier than 8:00 p.m. CDT Starship at our launch facility in Cameron County, Texas. Watch as @elonmusk gives an update on the vehicle today at ~7:00 p.m. CDT → https://t.co/gtC39uBC7z https://t.co/HBxpfy2ITj RT @Commercial_Crew: .@NASA &amp; @SpaceX conducted a test of the company’s emergency escape system at Launch Complex 39A. @NASA_Astronauts par… RT @elonmusk: Starship halves being joined https://t.co/7pdxfh8e81 RT @elonmusk: Three Raptors on a Starship https://t.co/UrRiD62EVk RT @Commercial_Crew: As part of our program, @SpaceX has been testing the #CrewDragon parachute system, which consists of two drogue parach… Fired together at full throttle, Crew Dragon's eight SuperDracos can move the spacecraft 0.5 miles—the length of over 7 American football fields lined up end to end—in 7.5 seconds, reaching a peak velocity of 436 mph Ahead of our in-flight abort test for @Commercial_Crew—which will demonstrate Crew Dragon's ability to safely carry astronauts away from the rocket in the unlikely event of an emergency—our team has completed over 700 tests of the spacecraft's SuperDraco engines https://t.co/nswMPCK3F9 Team in McGregor, Texas completed a static fire test today of the Falcon 9 booster that will launch Crew Dragon with @NASA astronauts @AstroBehnken and @Astro_Doug to the @space_station https://t.co/bYQEeE3Zab Starhopper flight test drone footage https://t.co/ilvALgrpCo First Dragon to complete three missions to and from the @space_station https://t.co/U2ckIeNq1B RT @elonmusk: Congrats SpaceX team!! https://t.co/duckYSK0D4 Starhopper cam now live https://t.co/jo4HMKivk9 RT @elonmusk: Dragon Crew Arm. Astronauts will walk this gantry to enter Dragon &amp; depart for the @Space_Station. https://t.co/rKkUTeHson Good splashdown of Dragon confirmed, completing this spacecraft’s third mission to and from the @space_station! Dragon's main parachutes have been deployed Dragon's drogue chutes deployed nominally Dragon's de-orbit burn is complete and its trunk has been jettisoned; Pacific Ocean splashdown in ~30 minutes Dragon will re-enter Earth's atmosphere in ~5 hours; Pacific Ocean splashdown around 1:20 p.m. PDT The three departure burns to move Dragon away from the @Space_Station are complete Dragon has been released from the @Space_Station! Three departure burns are now underway → https://t.co/WUiXnPDkfb RT @NASA: LIVE NOW: Tune in as robotic flight controllers at mission control in Houston release the #Dragon! After spending one month at th… RT @Space_Station: To accommodate better lighting conditions today, the @SpaceX #Dragon cargo craft is now scheduled to leave the station a… Live views of Starhopper test https://t.co/8ZFFFwErJF Dragon will depart the @Space_Station tomorrow with approximately 3,300 pounds of cargo at about 7:40 a.m. PDT https://t.co/zweVvfmszU https://t.co/CejZQ1WGWB More photos from last night’s Falcon 9 launch → https://t.co/095WHX44BX https://t.co/s0T0ayrcxs Falcon 9 launches AMOS-17 off Pad 40 in Florida, marking this booster’s third flight and SpaceX’s 25th reflight of an orbit class rocket. https://t.co/qcrfZTmxQ3 RT @elonmusk: Rocket fairing falls from space &amp; is caught by Ms Tree boat https://t.co/nJv0Ry1iKk Successful deployment of AMOS-17 confirmed! https://t.co/4VPbhnkF7O Back live for satellite deploy→ https://t.co/gtC39uBC7z Second stage engine restart and cutoff nominal. Webcast will return in ~4 minutes for satellite deploy. Back live for second stage engine restart → https://t.co/gtC39uBC7z Second stage engine cutoff confirmed; now in coast phase. Webcast will return in ~18 minutes for second stage engine restart Fairing has deployed Main engine cutoff and stage separation confirmed. Second stage engine burn underway https://t.co/TNYS7CzWRu Liftoff! https://t.co/garh1LldtF T-60 seconds until launch → https://t.co/gtC39uBC7z https://t.co/NOLYahnp3a Webcast of AMOS-17 mission is now live → https://t.co/gtC39uBC7z https://t.co/uXZUwMbndp T-30 minutes until Falcon 9 launch of AMOS-17 → https://t.co/gtC39uBC7z Team is targeting a new T-0 of 7:23 p.m. EDT, 23:23 UTC for launch of AMOS-17; continuing to monitor weather conditions at the Cape. Vehicle and payload still look good for launch. Falcon 9 and AMOS-17 are vertical on Pad 40 in Florida. Weather is 40% favorable for tonight’s launch window, which opens at 6:53 p.m. EDT, or 22:53 UTC → https://t.co/gtC39uBC7z https://t.co/nT3MPjOPrc SpaceX is expanding its launch services to directly address the needs of small satellite operators through regularly scheduled, dedicated Falcon 9 rideshare missions → https://t.co/jqQxEdt4xp https://t.co/3gzOPxdVkW Static fire test of Falcon 9 complete—team is now working toward August 6 for launch of AMOS-17 from Pad 40 in Florida, pending Range availability Team is setting up an additional static fire test of Falcon 9 after replacing a suspect valve. Will confirm updated target launch date for AMOS-17 once complete. The booster supporting this mission previously flew in support of the Telstar 19 VANTAGE and Es’hail-2 missions https://t.co/RUrphlFi5o Static fire test of Falcon 9 complete and team is assessing data—targeting August 3 for launch of AMOS-17 from Pad 40 in Florida RT @elonmusk: Falcon rocket reentry from space with double sonic booms https://t.co/6DDPjcOgQH Capture confirmed! Dragon now attached to the @Space_Station robotic arm https://t.co/dp7CiC3yN6 Dragon is ~10 meters from @Space_Station → https://t.co/rdhLIxXhnI https://t.co/vsLNm7x4aM RT @Space_Station: The @SpaceX #Dragon is ahead of schedule this morning and about 60 meters away of the station. @NASA TV is live now broa… Falcon 9 lands at SpaceX’s Landing Zone 1, marking the 44th recovery of a Falcon first stage and 24th reflight of an orbit class rocket booster https://t.co/JxuzCVZFRr The first Dragon spacecraft to fly three times is now on its way to the @space_station https://t.co/0yQOWVxa2Y RT @elonmusk: Drone cam https://t.co/gVdMrMgUZq RT @elonmusk: Starhopper flight successful. Water towers *can* fly haha!! Dragon is on its way to the International Space Station; capture by the @Space_Station crew set for Saturday Dragon’s solar arrays have deployed Second stage engine burn complete. Dragon confirmed in good orbit → https://t.co/gtC39uBC7z Falcon 9 booster has landed on Landing Zone 1! https://t.co/GWkUKgceSU First stage entry burn complete; second stage propelling Dragon into its orbit to meet up with the @Space_Station Main engine cutoff and stage separation confirmed https://t.co/potJwSG52c Liftoff! https://t.co/gtC39uBC7z https://t.co/xZbvWEK9CD T-60 seconds until launch → https://t.co/gtC39uBC7z https://t.co/rnCc2pcEfa Webcast of Falcon 9 launch now live → https://t.co/gtC39uBC7z https://t.co/aClA4I7jrD T-30 minutes until Falcon 9 launch of Dragon. Webcast will go live in ~15 minutes → https://t.co/gtC39uBC7z Weather forecast for tonight’s Falcon 9 launch of Dragon at 6:01 p.m. EDT, 22:01 UTC, has improved to 50% favorable; team will monitor conditions throughout the countdown. Starhopper webcast now live → https://t.co/kCtBLPbSg8 Standing down today due to weather; backup launch opportunity is tomorrow at 6:01 p.m. EDT, 22:01 UTC Webcast of Falcon 9 launch now live → https://t.co/gtC39uBC7z https://t.co/Be7oI4MYg0 T-30 minutes until Falcon 9 launch of Dragon; team is monitoring weather conditions. Webcast will go live ~15 minutes before liftoff → https://t.co/gtC39uBC7z RT @NASAKennedy: When @SpaceX’s #Dragon 🐉 launches on the company’s 18th resupply mission to the @Space_Station, it will have the #Apollo50… Falcon 9's first stage supported SpaceX’s 17th cargo resupply mission just over two months ago https://t.co/E79K5slke9 Falcon 9 and Dragon are vertical ahead of tonight’s resupply mission to the @Space_Station. Weather is 30% favorable for the instantaneous launch window at 6:24 p.m. EDT, 22:24 UTC→ https://t.co/gtC39uBC7z https://t.co/S5t9KxvmAG RT @NASA: Get ready for liftoff! Tomorrow, a @SpaceX #Dragon spacecraft will launch to our orbiting laboratory carrying more than 5,000 pou… The Dragon spacecraft supporting this mission previously visited the @space_station in April 2015 and December 2017 https://t.co/X1qHdk4g70 Falcon 9 static fire test complete — targeting July 24 launch from Pad 40 in Florida for Dragon’s eighteenth resupply mission to the @Space_Station Crew Dragon is equipped with the most advanced spacecraft parachute recovery system in the world https://t.co/1xJF7HqVPY RT @NASA: LIVE NOW: Tune in to hear from #Apollo11 astronaut Michael Collins as we count down to the exact moment when three humans lifted… RT @elonmusk: Landing on Ms. Tree https://t.co/4lhPWRpaS9 View from the fairing during the STP-2 mission; when the fairing returns to Earth, friction heats up particles in the atmosphere, which appear bright blue in the video https://t.co/P8dgaIfUbl More photos from last night’s Falcon Heavy launch and landing → https://t.co/095WHX44BX https://t.co/FpzuUliLf0 Falcons landing https://t.co/BjlvhppAw2 Deployment of DSX confirmed! https://t.co/O0nFH1NdFl Second stage engine restart and cutoff nominal Back live for final second stage engine restart and deployment → https://t.co/gtC39uBC7z Second stage engine restart and cutoff nominal. Second stage now in coast phase; webcast will return in ~80 minutes → https://t.co/gtC39uBC7z Back live for final second stage engine restart → https://t.co/gtC39uBC7z RT @elonmusk: Ms. Tree caught the Falcon fairing!! Deployment of the COSMIC-2 constellation confirmed! Second stage in coast phase; webcast will return in ~20 minutes for second stage engine restart → https://t.co/gtC39uBC7z https://t.co/Afix9JGZh5 Deployment of GPIM confirmed Deployment of OTB confirmed Deployment of NPSat confirmed Deployment of Prox-1 confirmed Back live for next set of deployments → https://t.co/gtC39uBC7z Second stage engine restart and cutoff nominal; webcast will return in ~5 minutes Back live for second stage engine restart → https://t.co/gtC39uBC7z Deployment of LEO/Stangsat confirmed. Entering coast phase; webcast will return in ~21 minutes for second stage engine restart → https://t.co/gtC39uBC7z Deployment of E-TBEx-B confirmed Deployment of E-TBEx-A confirmed Deployment of Prometheus confirmed Deployment of PSAT/BRICSat confirmed Deployment of ARMADILLO confirmed Deployment of DOTSI confirmed Deployment of TEPCE confirmed Deployment of Oculus-ASR confirmed! Second stage engine cutoff confirmed Falcon Heavy’s side boosters have landed at SpaceX Landing Zones 1 and 2! First stage entry burn complete. Second stage continuing nominally to geosynchronous transfer orbit Fairing has deployed Center core engine shutdown and stage separation confirmed. Second stage engine burn underway https://t.co/wrn5uMmG0L Side booster engine cutoff and separation from center core confirmed. Center core continuing nominally Liftoff! https://t.co/EZIbdSY5r2 T-60 seconds → https://t.co/gtC39uBC7z Falcon Heavy launch webcast is live→ https://t.co/gtC39uBC7z https://t.co/x6Aqiqg1QS T-1 hour until Falcon Heavy launch of STP-2. Webcast will go live about 20 minutes before liftoff → https://t.co/gtC39uBC7z Targeting T-0 of 2:30 a.m. EDT for Falcon Heavy launch of STP-2; team completed additional ground system checkouts. Vehicle and payload continue to look good RT @NASA: ⏰Deep Space Atomic Clock\n⛽️‘Green’ Propellant Fuel \n☢️Space Environment Testbeds \n\nSome one-of-a kind @NASA_Technology is set to… RT @elonmusk: Falcon Heavy on LC-39A https://t.co/FsfFa7bRRK Falcon Heavy and STP-2 are vertical on Launch Complex 39A. Tonight’s four-hour launch window opens at 11:30 p.m. EDT, or 3:30 UTC on June 25 → https://t.co/gtC39uBC7z https://t.co/NTblKjmFxT This mission marks the first reuse of side boosters that flew on a previous Falcon Heavy mission https://t.co/4Zl7miTQ24 Falcon Heavy preparing for flight in SpaceX’s hangar at LC-39A → https://t.co/QjQ85Pfc1O https://t.co/xhraJSnZRw Static fire of Falcon Heavy complete—targeting June 24 launch of STP-2 from Launch Complex 39A in Florida → https://t.co/QjQ85Pfc1O RT @AF_SMC: The 3700 kg Integrated Payload Stack (IPS) for #STP2 has been completed! Have a look before it blasts off on the first #DoD Fal… RT @NASA: When @SpaceX’s Falcon Heavy rocket launches, it will carry @NASA_Technology, including an atomic clock for space navigation &amp;  sp… Falcon 9 returns to Earth on LZ-4 after launching the RADARSAT Constellation Mission to orbit – SpaceX’s 2nd West Coast land landing https://t.co/LxeFJdLqcA Falcon 9 breaks through the fog https://t.co/yMnwrQ0KdX Final deployment of RADARSAT Constellation Mission confirmed! Successful deployment of RCM-2 confirmed https://t.co/sIhHEabmm1 Successful deployment of RCM-1 confirmed https://t.co/r7nv42pu06 Back live for deployment → https://t.co/gtC39uBC7z Second stage engine restart and cutoff nominal; webcast will return in ~6 minutes Back live → https://t.co/gtC39uBC7z Second stage engine cutoff confirmed, now in coast phase. Webcast will return in ~40 minutes → https://t.co/gtC39uBC7z Falcon 9’s first stage has landed on Landing Zone 4 – SpaceX’s second land landing on the West Coast! https://t.co/kjNAhcUcJj First stage entry burn complete. Second stage continuing nominally. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. https://t.co/hvWfIMx0ri Liftoff! https://t.co/aIY0gJVoVY T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch now live → https://t.co/gtC39uBC7z T-30 minutes until Falcon 9 launch of RADARSAT Constellation Mission. Webcast will go live ~15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and RADARSAT Constellation Mission are vertical on SpaceX’s California launch pad at Vandenberg Air Force Base. After stage separation, SpaceX will attempt to land Falcon 9’s first stage at Landing Zone 4 → https://t.co/gtC39uBC7z https://t.co/BZHkDW3gQT RT @BigelowSpace: Bigelow Space Operations has secured up to 4 dedicated @SpaceX launches to fly up to 16 people to the @Space_Station. @Bi… Falcon 9 and RADARSAT Constellation Mission have rolled out to SLC-4E. Tomorrow’s 13-minute launch window opens at 7:17 a.m. PDT, 14:17 UTC → https://t.co/gtC39uBC7z https://t.co/CqTCQyHrPg The booster supporting this mission launched Crew Dragon to the @space_station in March https://t.co/1TyvF6ek8b Static fire test of Falcon 9 complete—targeting June 12 launch of RADARSAT Constellation Mission from Vandenberg Air Force Base in California Join us: https://t.co/QB1jHO7pCw https://t.co/5a4z5XJpqQ RT @AF_SMC: SpaceX's Falcon Heavy center core, powering SMC's STP-2 mission, arrived near Launch Complex-39A in Florida over the weekend! T… Dragon returns to Earth after its four-week stay at the @space_station, completing SpaceX’s seventeenth flight to and from the ISS and sixth with a flight-proven spacecraft https://t.co/q266ZKeC3N RT @Space_Station: The @SpaceX #Dragon cargo craft on its 17th contracted mission to resupply the station is pictured June 3, 2019, moments… Good splashdown of Dragon confirmed, completing SpaceX’s seventeenth resupply mission to and from the @Space_Station! Dragon's main parachutes have been deployed Dragon's drogue chutes deployed nominally Dragon's de-orbit burn is complete and its trunk has been jettisoned. Pacific Ocean splashdown in ~30 minutes. Dragon will re-enter Earth's atmosphere in ~5 hours. Pacific Ocean splashdown around 2:50 p.m. PDT The three departure burns to move Dragon away from the @Space_Station are complete. Dragon has been released from the @Space_Station! Three departure burns are now underway → https://t.co/WUiXnPlJnD https://t.co/MwV304oabQ RT @NASA: LIVE NOW: There’s a spacecraft on the move! Tune in to watch @SpaceX’s #Dragon cargo spacecraft depart the @Space_Station after n… Last month, Dragon delivered 5,500 pounds of science and supplies to the @space_station. Having since completed its four-week stay, Dragon will depart tomorrow morning at about 9:00 a.m. PDT https://t.co/AlCK9zehYK RT @elonmusk: @SpaceX Krypton thrusters operative, satellites initiating orbit raise every 90 mins More photos from last night’s Starlink launch → https://t.co/095WHX44BX https://t.co/u9rnacEz6O Falcon 9 launches 60 Starlink satellites to orbit – targeting up to 6 Starlink launches this year and will accelerate our cadence next year to put ~720 satellites in orbit for continuous coverage of most populated areas on Earth https://t.co/HF8bCI4JQD RT @elonmusk: @SpaceX All 60 Starlink satellites online, solar array deployment coming up soon Successful deployment of 60 Starlink satellites confirmed! https://t.co/eYrLocCiws Back live for satellite deploy → https://t.co/gtC39uBC7z Second stage engine restart and cutoff nominal. Webcast will return in ~15 minutes for satellite deploy. Back live → https://t.co/gtC39uBC7z Second stage engine cutoff confirmed, now in coast phase. The webcast will return in about 35 minutes for second stage engine restart. Falcon 9's first stage has landed on the Of Course I Still Love You droneship – the third launch and landing of a booster that’s flown for a third time! https://t.co/CzEDao3tFa First stage entry burn complete. Second stage continuing nominally to low Earth orbit. Fairing has deployed https://t.co/wBXqXicqhF Main engine cutoff and stage separation confirmed. Second stage engine burn underway https://t.co/trGBZyJGD1 Liftoff! https://t.co/QNKOX8B0Dc T-60 seconds until launch → https://t.co/gtC39uBC7z https://t.co/RbdquTRCAm Starlink satellites are equipped with one solar array instead of two, minimizing potential points of failure https://t.co/bJirVr67fF Starlink's flat-panel design allows for a dense launch stack to take full advantage of Falcon 9’s launch capabilities https://t.co/ntnJInEfno Starlink will connect the globe with reliable and affordable high-speed broadband services https://t.co/dWVvPwVWU4 Webcast of first Starlink launch now live → https://t.co/gtC39uBC7z T-30 minutes until Starlink launch → https://t.co/gtC39uBC7z Falcon 9 and 60 Starlink satellites are vertical on Pad 40. Launch window opens tonight at 10:30 p.m. EDT → https://t.co/gtC39uBC7z https://t.co/166LTfD68M Now targeting May 23 for launch of Starlink from Pad 40 in Florida Standing down to update satellite software and triple-check everything again. Always want to do everything we can on the ground to maximize mission success, next launch opportunity in about a week. Starlink and Falcon 9 are looking good, and winds are better for tonight’s launch. The 1.5 hour launch window opens at 10:30 p.m. EDT → https://t.co/gtC39uBC7z https://t.co/d3LX9sZLQ4 Standing down today due to excess upper level winds. Teams are working toward tomorrow's backup launch window, which opens at 10:30 p.m. EDT T-30 minutes until Starlink launch → https://t.co/gtC39uBC7z New T-0 of 11:00 p.m. EDT—Falcon 9 and Starlink continue to look good for today's launch RT @elonmusk: Starlink mission will be heaviest @SpaceX payload ever at 18.5 tons. If all goes well, each launch of 60 satellites will gene… All systems and weather are go ahead of tonight’s launch of Starlink; webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z https://t.co/efdD0y6QGL The booster supporting this mission previously flew in support of the Telstar 18 VANTAGE and Iridium-8 missions https://t.co/Uz8uWx6ojw Weather is 80% favorable for tomorrow’s Falcon 9 launch of Starlink. Launch window opens at 10:30 p.m. EDT → https://t.co/gtC39uBC7z https://t.co/RHveMmfOi9 Static fire test of Falcon 9 complete—targeting May 15 for launch of 60 Starlink satellites from Pad 40 in Florida RT @elonmusk: First 60 @SpaceX Starlink satellites loaded into Falcon fairing. Tight fit. https://t.co/gZq8gHg9uK RT @NASASocial: Here's a surprise to brighten your day: a new #NASASocial! 🚀\n \nWe're opening our doors in June for you to see @SpaceX's Fal… RT @elonmusk: Dragon approaching Space Station https://t.co/S2p7o1G8Sx RT @Space_Station: Live now on @NASA TV, watch the installation of the @SpaceX #Dragon to the Harmony module where it will stay for one mon… Capture confirmed! Dragon is now attached to the @Space_Station robotic arm https://t.co/S0hzXYzFgb Dragon is ~10 meters from @Space_Station. Capture sequence starting shortly → https://t.co/rdhLIxXhnI https://t.co/a5DPaUMnt0 RT @Space_Station: Flight control teams for the Space Station and @SpaceX are proceeding toward grapple of the Dragon cargo spacecraft this… Dragon is about 182 meters from the @Space_Station. Watch live → https://t.co/rdhLIxXhnI https://t.co/JBd9fWV68B RT @NASA: LIVE NOW: Watch coverage of @SpaceX's #Dragon spacecraft rendezvousing with the @Space_Station to deliver science, supplies and h… RT @ISS_CASIS: The @SpaceX Dragon cargo spacecraft is expected to arrive at the @Space_Station early tomorrow after Saturday's successful l… More photos from Falcon 9’s 40th successful launch from Pad 40 in Florida and 39th first stage rocket booster landing to date → https://t.co/095WHX44BX https://t.co/b8Tjz20prv Falcon 9 launches Dragon on SpaceX’s 17th resupply mission to the @Space_Station #MayThe4thBeWithYou https://t.co/dIgm7fD93H Dragon is on its way to the International Space Station! Capture by the @Space_Station crew set for early Monday morning https://t.co/oGs4IrBW9h Dragon’s solar arrays have deployed. https://t.co/L3E4mnjQSz Second stage engine burn complete. Dragon confirmed in good orbit → https://t.co/gtC39uBC7z Falcon 9 booster has landed on Of Course I Still Love You! First stage entry burn complete. Second stage propelling Dragon into its orbit to meet up with the @Space_Station. Main engine cutoff and stage separation confirmed. https://t.co/GSpYkaRlSK Liftoff! https://t.co/gtC39uBC7z https://t.co/IaHMvakoX7 T-60 seconds until launch → https://t.co/gtC39uBC7z https://t.co/9etz0MeXGu Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-30 minutes until Falcon 9 launch of Dragon. Launch webcast will go live ~15 minutes before liftoff → https://t.co/gtC39uBC7z All systems are currently go and weather is 70% favorable for launch of Dragon’s seventeenth resupply mission on May 4 at 2:48 a.m. EDT, 6:48 UTC. Standing down today due to an electrical issue on the Of Course I Still Love You droneship. Teams will also address the ground side helium leak before tomorrow's backup launch opportunity at 2:48 a.m. EDT, 6:48 UTC. This Dragon spacecraft previously supported SpaceX’s 12th resupply mission to the @Space_Station https://t.co/Wrsy9GlZyi Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z https://t.co/O74JRFuBJh T-30 minutes until Falcon 9 launch of Dragon for its seventeen mission to the @Space_Station. Launch webcast will go live ~15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and Dragon are vertical ahead of tomorrow’s resupply mission to the @Space_Station. Dragon is loaded with more than 5,500 pounds of cargo; weather is 40% favorable for the instantaneous launch window at 3:11 a.m. EDT, 7:11 UTC → https://t.co/gtC39uTdw9 https://t.co/XabMUnBZoT Red planet, blue sunset https://t.co/qIJw1himUX RT @Space_Station: .@NASA has requested @SpaceX move off from May 1 to no earlier than May 3 for the launch of its #Dragon cargo mission to… RT @NASA: .@SpaceX is now targeting May 1 at 3:59am ET for the next cargo launch to the @Space_Station. Onboard will be more than 5,500 pou… Static fire test of Falcon 9 complete—targeting May 1 launch from Pad 40 in Florida for Dragon’s seventeenth mission to the @Space_Station Falcon Heavy center core booster completed a static fire test at our rocket development facility in McGregor, Texas ahead of its next mission → https://t.co/QjQ85Pfc1O https://t.co/1UK1EUSryT More photos from yesterday’s Falcon Heavy launch and landing → https://t.co/095WHX44BX https://t.co/4kDM3mp8Oi Falcon Heavy’s side boosters land on Landing Zones 1 and 2 https://t.co/nJCCaVHOeo Liftoff of Falcon Heavy https://t.co/3oALJPOMBa Successful deployment of Arabsat-6A to geosynchronous transfer orbit confirmed—completing Falcon Heavy’s first commercial mission! https://t.co/KeKTP99xvv Back live for satellite deployment → https://t.co/gtC39uBC7z Second stage engine cutoff nominal. The webcast will return in about 5 minutes for satellite deployment. Back live → https://t.co/gtC39uBC7z RT @elonmusk: The Falcons have landed https://t.co/BGQRNuYMVH Second stage is now in coast phase. The webcast will return in about 15 minutes for second stage engine restart. Falcon Heavy’s center core has landed on the Of Course I Still Love You droneship! https://t.co/pNqwMWr50d Second stage engine cutoff confirmed. Falcon Heavy side boosters have landed at SpaceX Landing Zones 1 and 2! https://t.co/MbIxCPMpGv First stage entry burns complete. Second stage continuing nominally to geosynchronous transfer orbit. Fairing has deployed. Center core engine shutdown and stage separation confirmed. Second stage engine burn underway. Side booster engine cutoff and separation from center core confirmed. Center core continuing nominally. Liftoff! https://t.co/bwIfABbhIA T-60 seconds → https://t.co/gtC39uBC7z https://t.co/3eVqgEtxyR Falcon Heavy launch webcast is live→ https://t.co/gtC39uBC7z https://t.co/1LzRiYgetv T-1 hour until Falcon Heavy launch of Arabsat-6A. Webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z All systems and weather are currently go ahead of tonight’s Falcon Heavy launch of Arabsat-6A from Pad 39A; launch window opens at 6:35 p.m. EDT, or 22:35 UTC → https://t.co/gtC39uBC7z Standing down from today’s Falcon Heavy launch attempt; next opportunity is tomorrow, April 11. RT @elonmusk: @SpaceX Upper atmospheric wind shear is very high. Will have to postpone launch unless weather improves soon. New T-0 of 8:32 p.m. EDT due to upper-level winds. Vehicle and payload still look good for launch. Falcon Heavy and Arabsat-6A are vertical on Launch Complex 39A. Currently targeting liftoff at 8:00 p.m. EDT; monitoring upper-level winds that could push us to the end of the window (8:32 p.m. EDT) → https://t.co/gtC39uBC7z https://t.co/Vbzbhy6PLz SpaceX will attempt to land Falcon Heavy’s side boosters at Landing Zones 1 and 2 and Falcon Heavy’s center core on the Of Course I Still Love You droneship during the Arabsat-6A mission → https://t.co/gtC39uBC7z https://t.co/0vHnyYt0nN Now targeting Falcon Heavy launch of Arabsat-6A on Wednesday, April 10 – weather forecast improves to 80% favorable Also in the hangar is the Falcon 9 first stage booster that launched Crew Dragon to the @Space_Station last month Falcon Heavy’s 27 Merlin engines generate more than 5 million pounds of thrust at liftoff, making it the world’s most powerful operational rocket by a factor of two https://t.co/0LGaLgdi13 Booster mate inside SpaceX's hangar at LC-39A ahead of Falcon Heavy’s static fire yesterday https://t.co/G7ZPhOBkyj RT @elonmusk: Starhopper just lifted off &amp; hit tether limits! https://t.co/eByJsq2jiw Static fire of Falcon Heavy complete—targeting April 9 launch of Arabsat-6A from Launch Complex 39A in Florida RT @elonmusk: Starhopper completed tethered hop. All systems green. https://t.co/0m5Bm5slD2 Two years ago today Falcon 9 completed the world’s first reflight of an orbital class rocket. Rapid and reliable reusability is key to enabling a multiplanetary future for humanity. https://t.co/Hy9I7pGeRg Crew Dragon is on SpaceX’s recovery vessel—completing the spacecraft’s first test mission! https://t.co/6K0qgnHd4O RT @Commercial_Crew: Successful splashdown of the #CrewDragon right on time at 8:45 a.m. ET. https://t.co/0qHhHzD4Js Good splashdown of Dragon confirmed! https://t.co/WK1nsNnOF5 Dragon’s main parachutes have deployed → https://t.co/gtC39uBC7z https://t.co/aNoRG9nbXi Dragon’s drogue chutes deployed nominally. https://t.co/4p8iq0zPR0 RT @NASA: .@SpaceX's 'Go Searcher' recovery ship is staged in the Atlantic Ocean awaiting #CrewDragon's splashdown at about 8:45am ET. Afte… Dragon's trunk has been jettisoned and its de-orbit burn is complete. Atlantic Ocean splashdown in ~40 minutes → https://t.co/gtC39uBC7z Back live for Crew Dragon’s reentry and Atlantic Ocean splashdown → https://t.co/gtC39uBC7z Webcast will be back in ~4.5 hours for splashdown → https://t.co/gtC39uBC7z https://t.co/710pU1NUUY Four departure burns to move Crew Dragon away from the @space_station are now underway https://t.co/8th0L83JaR Separation confirmed! https://t.co/0paFhppolp RT @NASA: High-definition cameras aboard the @Space_Station provide clear views of @SpaceX's #CrewDragon. After a five-day mission on our o… Dragon is go to undock from the @space_station Watch live as Crew Dragon autonomously undocks from the @space_station → https://t.co/gtC39uBC7z RT @Commercial_Crew: The @SpaceX #CrewDragon hatch closed at 12:39 p.m. EST! Next up is undocking from @Space_Station which will take place… RT @NASA: Coming up: @SpaceX's #CrewDragon spacecraft prepares to return to Earth from @Space_Station.  \n\nWatch on NASA TV (all times ET):… After launching Crew Dragon on its first test flight to the @Space_Station, Falcon 9 lands on the Of Course I Still Love You droneship—completing SpaceX’s 35th recovery of an orbital class rocket booster. https://t.co/24Ip2m8PLN RT @AstroAnnimal: The dawn of a new era in human spaceflight https://t.co/BHsfg1zYLN Hatch is open! Crew Dragon will now spend 5 days at the @space_station https://t.co/HA9iSWOBVE Back live for hatch opening → https://t.co/gtC39uBC7z RT @elonmusk: SpaceX Crew Dragon has docked with International @Space_Station https://t.co/CccsItLLvJ Webcast will return for opening of Crew Dragon’s hatch in ~2 hours → https://t.co/gtC39uBC7z RT @Commercial_Crew: The @SpaceX Crew Dragon is attached to the @Space_Station! It's a first for a commercially built &amp; operated spacecraft… Dragon is 20 meters from the @space_station https://t.co/kijFqCn8hr RT @elonmusk: Proximity docking sequence underway. Dragon shadow visible on on @Space_Station solar arrays. https://t.co/ELsxgLIvf0 Back live → https://t.co/gtC39uBC7z RT @Space_Station: This short overview describes the makeup of the @SpaceX #CrewDragon now approaching the station targeting a 6am ET docki… Webcast will be back in 30 minutes → https://t.co/gtC39uBC7z Dragon has been given a \"go\" to approach Recap of yesterday’s Falcon 9 launch of Crew Dragon → https://t.co/gtC39uBC7z https://t.co/M82oeD3iOi Watch live as Crew Dragon autonomously docks to Harmony module at the @space_station → https://t.co/gtC39uBC7z More photos of Crew Dragon’s first launch to the @Space_Station → https://t.co/095WHX44BX https://t.co/7eQrJW3qMK Falcon 9 launches Crew Dragon on its first test flight to the @space_station https://t.co/2OHyFFyZyr RT @elonmusk: Earth floats gently in zero gravity https://t.co/XUH3KeDPVe Crew Dragon is on its way to the International Space Station! Autonomous docking at the @Space_Station set for early tomorrow morning. Watch live starting at 3:30 a.m. EST, 8:30 a.m. UTC → https://t.co/gtC39uBC7z Falcon 9 booster has landed on the Of Course I Still Love You droneship—SpaceX’s 35th successful landing of a rocket booster https://t.co/cDvKpoOwrq Second stage engine burn complete. Dragon confirmed in good orbit → https://t.co/gtC39uBC7z First stage entry burn complete. Second stage propelling Crew Dragon into its orbit to meet up with the @Space_Station → https://t.co/gtC39uBC7z Main engine cutoff and stage separation confirmed. Second stage engine burn underway https://t.co/TY5CT14g7g Liftoff! https://t.co/RUtN1QBS08 Falcon 9 and Crew Dragon are go for launch. T-60 seconds → https://t.co/gtC39uBC7z https://t.co/06SEns5bUv Crew Dragon will autonomously dock with the @space_station at approximately 6:00 a.m. EST on March 3 https://t.co/znptJuDCY7 Crew Dragon will deliver about 400 pounds of supplies and equipment to the @Space_Station. Also on board is an anthropomorphic test device, which we call Ripley. https://t.co/FuHewNb4UM Webcast is live→ https://t.co/gtC39uBC7z https://t.co/7VgyvPfwu0 Launch webcast of Crew Dragon’s first test flight will go live ~50 minutes before liftoff → https://t.co/gtC39uBC7z RT @elonmusk: Super high tech zero-g indicator added just before launch! https://t.co/CRO26plaXq All systems and weather are go ahead of Crew Dragon's first test flight tomorrow morning at 2:49 a.m. EST, 7:49 UTC → https://t.co/gtC39uTdw9 https://t.co/eSAiI9ZyJ2 RT @elonmusk: Ripley https://t.co/Z9Ztram8Ai Falcon 9 and Crew Dragon are vertical on historic Launch Complex 39A https://t.co/5MarVJTVYK SpaceX and @NASA have completed thousands of hours of tests, analyses, and reviews in preparation for Crew Dragon’s first test flight to the @space_station https://t.co/JvJqeoLKVy Crew Dragon and Falcon 9 rolled out to the launch pad ahead of the spacecraft’s first test flight. Liftoff targeted for 2:49 a.m. EST on March 2 https://t.co/Dud93ZrkgH More photos from last night’s Falcon 9 launch→ https://t.co/095WHX44BX https://t.co/uTz5U7EfQB Falcon 9 launches Nusantara Satu to orbit; SpaceX’s 70th successful mission and 20th reflight of an orbital class rocket booster https://t.co/A8qcYJ2fQH Successful deployment of Nusantara Satu to geosynchronous transfer orbit confirmed—completing SpaceX’s 70th mission! https://t.co/oJwLOGlrBR Back live for satellite deployment → https://t.co/gtC39uBC7z Webcast returns in ~8 minutes for satellite deployment Successful deployment of the SpaceIL lunar lander confirmed, starting the spacecraft’s two-month voyage to the Moon https://t.co/iMlVYJHef3 Back live for lunar lander deployment → https://t.co/gtC39uBC7z Webcast returns in ~5 minutes. Second stage engine cutoff nominal. Back live → https://t.co/gtC39uBC7z Second stage is now in coast phase. The webcast will return in about 16 minutes for second stage engine restart and the first of two deployments. Falcon 9 first stage has landed on the Of Course I Still Love You droneship, completing this booster’s third launch and landing. https://t.co/IP6yvi8SQa Second stage engine cutoff confirmed. First stage entry burn complete. Second stage continuing nominally to geosynchronous transfer orbit. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. https://t.co/bDt2z62HGI Liftoff! https://t.co/Cd8nGQwrhd T-60 seconds until launch → https://t.co/gtC39uBC7z Also inside Falcon 9’s fairing is SpaceIL’s lunar spacecraft https://t.co/uKk9c4cDnH The SSL built Nusantara Satu satellite was encapsulated in Falcon 9’s fairing last week and is go for launch https://t.co/m3YevKkg01 Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z https://t.co/abRTfjWbcu T-30 minutes until Falcon 9 launch of Nusantara Satu. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9’s first stage rocket booster launched twice last year to deliver the Iridium-7 and SAOCOM 1A payloads to orbit https://t.co/z8XypvFPET Falcon 9 and Nusantara Satu are vertical on Pad 40 ahead of today’s launch window, which opens at 8:45 p.m. EST, 1:45 UTC → https://t.co/gtC39uBC7z https://t.co/DGsi95bpmZ Static fire test of Falcon 9 complete—targeting February 21 launch of Nusantara Satu from Pad 40 in Florida. RT @NASA: #NASARemembers 🇺🇸\n\nToday, we pause to reflect on the legacy of the women and men who gave their lives advancing the frontiers of… Targeting March 2 for Crew Dragon's first flight to the @Space_Station https://t.co/oJRtDhV3aL https://t.co/lLw1FJHLvI RT @SpaceXJobs: The names of SpaceX employees are riding along with Starman on his journey through space https://t.co/KQLqEEodkI One year ago today https://t.co/lAjw1HC8d5 RT @elonmusk: First firing of Starship Raptor flight engine! So proud of great work by @SpaceX team!! https://t.co/S6aT7Jih4S RT @elonmusk: Preparing to fire the Starship Raptor engine at @SpaceX Texas https://t.co/8JCOi1BG6z One of Mr. Steven’s final West Coast fairing recovery tests before shipping out for the East Coast. Wait for it… https://t.co/A7q37Gpllu View of Launch Complex 39A and Crew Dragon from the crew access arm https://t.co/PJIV5lIcnh Static fire test complete—targeting February launch from historic Launch Complex 39A for Crew Dragon’s first demonstration flight! https://t.co/sJF24U3UOM Dragon has delivered more than 140,000 lbs of cargo to and from the @space_station since 2012, but it was designed from the beginning to carry humans. These critical resupply missions also provide important flight heritage as we prepare to fly Crew Dragon. https://t.co/xOSKhWr0Kq Dragon returned home last night after its five-week stay at the @Space_Station, completing SpaceX’s sixteenth flight to and from the orbiting laboratory. The ISS badge signifies this Dragon’s previous trip to the station in 2017. https://t.co/afdPtd0iHJ Good splashdown of Dragon confirmed, completing SpaceX’s fourth resupply mission to and from the @Space_Station with a flight-proven spacecraft. Dragon's three main parachutes have been deployed. Dragon's drogue chutes deployed nominally. Dragon's de-orbit burn is complete and its trunk has been jettisoned. Pacific Ocean splashdown in ~30 minutes. Dragon will re-enter Earth's atmosphere in ~5 hours. Splashdown at 9:05 p.m. PST. The three departure burns to move Dragon away from the @Space_Station are complete. Dragon has been released from the @Space_Station! Three departure burns are now underway → https://t.co/WUiXnPDkfb https://t.co/zf8y62Vl65 RT @Space_Station: Live now on @NASA TV (without commentary), watch the release of the @SpaceX #Dragon cargo craft from the space station t… Falcon 9 lands on the Just Read the Instructions droneship after delivering 10 @IridiumComm satellites to low Earth orbit and returns to the Port of Los Angeles ahead of its next flight. https://t.co/2X9GKg77Sg Having delivered over 5,600 pounds of science and supplies, Dragon has completed its five-week stay at the @Space_Station and will depart at ~3:30 p.m. PST on Sunday. The Dragon used to support SpaceX’s 16th resupply mission previously delivered cargo to the ISS in 2017. https://t.co/bVVvuEA6Ei Falcon 9 launches 10 new @IridiumComm NEXT satellites to orbit; this was the eighth set of satellites in a series of 75 total satellites that SpaceX has launched for Iridium’s next generation global satellite constellation, Iridium NEXT. https://t.co/FOiuiLTy2X Successful deployment of 10 @IridiumComm NEXT satellites to low-Earth orbit confirmed. https://t.co/LADsDoHsNm Back live for final burn and deployment of 10 @IridiumComm NEXT satellites → https://t.co/gtC39uBC7z Second stage and satellite now in coast phase. The webcast will return in about 40 minutes for second stage engine restart and satellite deployment. Second stage engine cutoff confirmed. Falcon 9 first stage has landed on the Just Read the Instructions droneship. https://t.co/8l5fdMyJgH First stage entry burn complete. Second stage continuing nominally to low Earth orbit. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. https://t.co/6QlzE4Tb62 Liftoff! https://t.co/gxIXz9YgYm T-60 seconds until launch → https://t.co/gtC39uBC7z https://t.co/NugPZg7mXS Webcast of Falcon 9 launch to complete the @IridiumComm NEXT constellation is now live → https://t.co/gtC39uBC7z https://t.co/lU3TwSeCbz T-30 minutes until Falcon 9 launch of Iridium-8. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z RT @elonmusk: Starship test flight rocket just finished assembly at the @SpaceX Texas launch site. This is an actual picture, not a renderi… Falcon 9 and 10 Iridium NEXT satellites vertical on SpaceX’s California launch pad at Vandenberg Air Force Base. Tomorrow’s instantaneous launch window is at 7:31 a.m. PST, 15:31 UTC → https://t.co/gtC39uBC7z https://t.co/z3fv7j11xH Approved on the range – now targeting January 11 launch of Iridium-8 from Vandenberg Air Force Base. Weather is 60% favorable for the instantaneous launch opportunity at 7:31 a.m. PST, 15:31 UTC. Recent fairing recovery test with Mr. Steven. So close! https://t.co/DFSCfBnM0Y Static fire test of Falcon 9 complete. Working with customer to determine best launch opportunity to complete the Iridium NEXT constellation; will announce targeted launch date once confirmed. Preparing to return human spaceflight capabilities to the United States, Crew Dragon and Falcon 9 went vertical at historic Launch Complex 39A in Florida. https://t.co/igggZdCU9k RT @Space_Station: The @SpaceX #Dragon is in its final week at the station. Meanwhile, robotics experts and the station crew worked a wide… More photos from today’s Falcon 9 launch; SpaceX’s 21st mission of 2018 → https://t.co/095WHX44BX https://t.co/jGyc53PDWO Successful deployment of GPS III SV01 to medium Earth orbit confirmed. https://t.co/4lhJpwdsip Back live for satellite deployment → https://t.co/gtC39uBC7z Final second stage engine cutoff nominal. Webcast returns in ~45 minutes for deployment of GPS III SV01. Back live for final burn → https://t.co/gtC39uBC7z Second stage and GPS III SV01 now in coast phase; webcast will return in ~1 hour for second stage engine restart. Second stage engine cutoff confirmed. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. https://t.co/SxaPhVBnfH Liftoff! https://t.co/pi78HVFs6J T-60 seconds until launch → https://t.co/gtC39uBC7z https://t.co/EqtMTALs4X Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z https://t.co/BOFlGKd0KK All systems and weather are go for today’s Falcon 9 launch of GPS III SV01; 26-minute launch window opens at 8:51 a.m. EST, 13:51 UTC. Webcast will go live ~15 minutes before liftoff → https://t.co/gtC39uBC7z Standing down today due to strong upper level winds. Team is proceeding with the count until T-30 seconds for data collection. Next launch attempt is tomorrow at 8:51 a.m. EST, 13:51 UTC. Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z https://t.co/tO2wdlQJK1 T-30 minutes until Falcon 9 launch of GPS III SV01. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Continue to monitor upper level winds. Pushing T-0 to 9:21 a.m. EST, 14:21 UTC → https://t.co/gtC39uBC7z All systems looking good for Falcon 9’s launch of GPS III SV01. Team is monitoring upper level winds; launch window opens at 8:55 a.m. EST, 13:55 UTC https://t.co/gtC39uBC7z https://t.co/2oo6paztHx Now targeting December 22 launch of GPS III SV01. Weather is 80% favorable for the launch window which opens at 8:55 a.m. EST, 13:55 UTC. Standing down today due to weather. Vehicle and payload remain in good health. Working toward the next best launch opportunity; will announce a new launch date once confirmed on the Range. https://t.co/OZaPqaTOFw All systems go for launch of GPS III SV01; team is monitoring weather conditions. Launch window opens at 9:03 a.m. EST, 14:03 UTC. Webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Team is working toward launch of GPS III SV01 tomorrow, December 20. Weather remains a challenge; currently forecasted at 20% favorable during the 26-minute launch window which opens at 9:03 a.m. EST, 14:03 UTC. Standing down from today’s launch attempt of GPS III SV01 to further evaluate out of family reading on first stage sensors; will confirm a new launch date once complete. RT @VP: Incredible opportunity to see @SpaceX's Dragon 2 Capsule - an important part of the future of American human space exploration as w… SpaceX team called a hold due to an out of family reading on first stage sensors. Vehicle and payload remain healthy; next launch attempt is tomorrow at 9:07 EST, 14:07 UTC. Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z https://t.co/98YTu8Yiyf T-30 minutes until Falcon 9 launch of GPS III SV01. Launch webcast will go live in about 15 minutes → https://t.co/gtC39uBC7z New T-0 of 9:34 EST, 14:34 UTC, to account for upper level winds. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and GPS III SV01 are vertical on Pad 40 in Florida. Vehicle and weather are go for tomorrow’s 26-minute launch window, which opens at 9:11 a.m. EST, 14:11 UTC → https://t.co/gtC39uTdw9 https://t.co/BUAxrKXSkC Static fire test of Falcon 9 complete—targeting December 18 launch of GPS III SV01 from Pad 40 in Florida. Dragon completed its first flight around the world 8 years ago today. Since then, Dragon has visited @Space_Station 16 times. Next year, SpaceX will take another important step with an upgraded Dragon capable of returning human spaceflight to the US for the first time since 2011. https://t.co/N5PxeiWrUQ Capture confirmed! Dragon was captured at 4:21 a.m. PST while flying over Papua New Guinea. Dragon will spend about five weeks at the @Space_Station. https://t.co/jdcXUoU172 Dragon is holding at the capture point ~10 meters from the @Space_Station. Watch live → https://t.co/gtC39uBC7z https://t.co/sQ1J43efGG Dragon has been given a \"go\" to move toward capture position → https://t.co/gtC39uBC7z https://t.co/erQi2n40S1 Dragon is moving back to ~30 meter hold point while the @NASA team works a ground communication issue. Dragon remains on track for capture by the @Space_Station shortly. Dragon is ~10 meters from the @Space_Station. Capture sequence starting shortly → https://t.co/gtC39uBC7z https://t.co/xd0d5MNOsC Dragon has been given a \"go\" to move toward capture position → https://t.co/gtC39uBC7z Dragon is ~30 meters from the @Space_Station → https://t.co/gtC39uBC7z https://t.co/Mz5dhDNLXx This Dragon previously visited the @Space_Station in February 2017. https://t.co/ryKloQNwlz On Wednesday, Falcon 9 launched Dragon to orbit for its 16th mission to the @Space_Station, and it is now making its final approach to the @Space_Station. Watch live → https://t.co/gtC39uBC7z https://t.co/6BPwHh9Rb7 Dragon is set to arrive at the @Space_Station early tomorrow morning; watch live on https://t.co/gtC39uBC7z starting around 1:30 a.m. PST, 9:30 UTC. After launching Spaceflight SSO-A: SmallSat Express to orbit, this Falcon 9 rocket booster completed its third landing this year and SpaceX’s 32nd successful landing to date. https://t.co/bARHEBOF9f Falcon 9 launches Dragon into its targeted orbit, marking SpaceX’s 20th launch this year. Dragon is traveling an average of 17,300 mph on its way to the @Space_Station with 5,600 pounds of critical cargo, supplies, and hardware. Capture is set for early Saturday morning. https://t.co/F36w7F3CaS RT @NASA: More than 5,600 pounds of research, crew supplies and hardware left Earth at 1:16 pm ET to head to humanity's orbiting lab. @Spac… RT @elonmusk: Tracking shot of Falcon water landing https://t.co/6Hv2aZhLjM RT @elonmusk: Engines stabilized rocket spin just in time, enabling an intact landing in water! Ships en route to rescue Falcon. https://t.… RT @elonmusk: Grid fin hydraulic pump stalled, so Falcon landed just out to sea. Appears to be undamaged &amp; is transmitting data. Recovery s… Dragon is on its way to the International Space Station. Capture by @Space_Station crew set for early Saturday morning. Dragon’s solar arrays have deployed. https://t.co/ZbJ77etzW6 Second stage engine burn complete. Dragon confirmed in good orbit. https://t.co/gtC39uBC7z First stage entry burn complete. Second stage propelling Dragon into its orbit to meet up with the @Space_Station. https://t.co/gtC39uBC7z Main engine cutoff and stage separation confirmed. https://t.co/YW4BR7WjCi Liftoff! https://t.co/gtC39uBC7z https://t.co/9Cdjn6yozf T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z https://t.co/IyMge5xUcJ T-30 minutes until Falcon 9 launch of Dragon for its sixteenth mission to the @Space_Station. Launch webcast will go live ~20 minutes before liftoff → https://t.co/gtC39uBC7z RT @Space_Station: See that small space station? It's a badge of honor on the @SpaceX Dragon capsule, launching today! The silhouette denot… Falcon 9 and Dragon went vertical early this morning ahead of today’s resupply mission to the @Space_Station. Dragon is loaded with more than 5,600 pounds of cargo; all systems and weather are for go for launch at 1:16 p.m. EST, 18:16 UTC. https://t.co/gtC39uBC7z https://t.co/DMchykli0U Rapid rocket reusability is key to reducing costs and enabling large groups of people to travel to space and ultimately live on other planets. This Falcon 9 rocket booster completed its third launch and landing in six months. Every flight and reflight allows us to validate the rocket’s performance against predictions and maximize reliability on future flights. https://t.co/Vi2awpQg2L RT @NASA: To allow for time to replace parts of an @ISS_Research experiment, the launch of the @SpaceX cargo resupply mission to the Intern… Falcon 9 launches 64 payloads to orbit for the Spaceflight SSO-A: SmallSat Express mission, marking SpaceX’s 19th launch in 2018. https://t.co/oeX98v1t2N RT @elonmusk: Falcon fairing halves missed the net, but touched down softly in the water. Mr Steven is picking them up. Plan is to dry them… Successful deployment of four microsats and the upper and lower free flyer with additional payloads for Spaceflight SSO-A: SmallSat Express confirmed. Follow @SpaceflightInc for further mission updates. As expected, ground station coverage has ended; will provide a mission update once coverage is restored in ~30 minutes. Second stage engine cutoff confirmed. Falcon 9 first stage has landed on the Just Read the Instructions droneship—completing this rocket booster’s third launch and landing this year. https://t.co/DXqT7KH9sM First stage entry burn complete. Second stage continuing nominally to low Earth orbit. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. https://t.co/2TxLVXKfaB Liftoff! https://t.co/RHH9fWyYoH T-60 seconds until launch → https://t.co/gtC39uBC7z https://t.co/34pu1DLeNS Falcon 9’s first stage booster for this mission previously completed two launches and landings this year. https://t.co/VXkN0IEGVR Mr. Steven is stationed in the Pacific, as SpaceX will attempt to catch and recover the fairing this mission. https://t.co/A7aBSJoFfc Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z https://t.co/qf5CYSYZi7 New T-0 of 10:34 a.m. PST, 18:34 UTC. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and Spaceflight SSO-A: SmallSat Express went vertical last night on SpaceX’s California launch pad at Vandenberg Air Force Base. Vehicle and weather are go ahead of today’s launch window, which opens at 10:32 a.m. PST, 18:32 UTC → https://t.co/gtC39uBC7z https://t.co/JCWvVfNpJD Standing down from tomorrow’s launch attempt of Spaceflight SSO-A: SmallSat Express to conduct additional inspections of the second stage. Working toward a backup launch opportunity on December 3. Falcon 9 rolls out to SpaceX’s West Coast launch pad at Vandenberg Air Force Base ahead of Sunday’s targeted launch of 64 payloads for the Spaceflight SSO-A: SmallSat Express mission. Falcon 9’s first stage for this mission completed two East Coast launches &amp; landings this year. https://t.co/7sgsdDzIbQ Static fire test of Falcon 9 complete—targeting December 4 launch from Pad 40 in Florida for Dragon’s sixteenth mission to the @Space_Station. Earlier this month, Falcon 9 landed on the Of Course I Still Love You droneship after launching the Es’hail-2 satellite to orbit. 🌈 https://t.co/ePAHi9HAWz Now targeting December 2 for launch of Spaceflight SSO-A: SmallSat Express from Vandenberg Air Force Base. Wednesday's launch attempt of Spaceflight SSO-A from Vandenberg Air Force Base is currently no-go due to extreme high-altitude winds that violate Range requirements. Vehicle and payloads are healthy. We will announce a new launch date once confirmed with the Range. Congratulations to @NASA on another successful landing on the Red Planet! https://t.co/45Pc4NdT35 Targeting November 28 for launch of Spaceflight SSO-A: SmallSat Express from Vandenberg Air Force Base in California Operating an orbital laboratory hundreds of miles above Earth’s surface for 20 years is an amazing technological achievement. Happy anniversary, @space_station! #SpaceStation20th https://t.co/HU3dGsUtvX Standing down from Monday’s launch attempt of Spaceflight SSO-A: SmallSat Express to conduct additional pre-flight inspections. Once complete, we will confirm a new launch date. More photos from yesterday’s Falcon 9 launch → https://t.co/095WHX44BX https://t.co/DYVQjBhkae Liftoff of Falcon 9 from historic Launch Complex 39A at Kennedy Space Center in Florida—SpaceX’s 12th launch of a flight-proven rocket booster this year. https://t.co/wWvVyDH668 Falcon 9’s first stage booster for this mission completed two East Coast launches earlier this year. https://t.co/OUDw0Pb6PB Static fire test of Falcon 9 complete—targeting November 19 launch of Spaceflight SSO-A: SmallSat Express from Vandenberg Air Force Base in California. Falcon 9 launches Es’hail-2 to orbit, marking SpaceX’s 18th launch of 2018. https://t.co/wUawpWQGCi Successful deployment of Es’hail-2 to geostationary transfer orbit confirmed. https://t.co/m2YKMJrtYq Back live for satellite deployment → https://t.co/gtC39uBC7z Second stage and satellite now in coast phase. The webcast will return in about 15 minutes for second stage engine restart and satellite deployment. Falcon 9 first stage has landed on the Of Course I Still Love You droneship. https://t.co/vIpmOODJyo Second stage engine cutoff confirmed. First stage entry burn complete. Second stage continuing nominally to geostationary transfer orbit. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/aoVi39TyW7 T-60 seconds until launch → https://t.co/gtC39uBC7z https://t.co/EnuZr5nPzv Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-30 minutes until Falcon 9 launch of Es’hail-2. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and Es’hail-2 are vertical on Pad 39A in Florida. Today’s launch window opens at 3:46 p.m. EST, 20:46 UTC. Falcon 9’s first stage for this mission previously supported the Telstar 19 VANTAGE launch in July 2018. https://t.co/gtC39uBC7z https://t.co/QwICm3BR3X Static fire test of Falcon 9 complete—targeting November 15 launch of Es’hail-2 from Pad 39A in Florida. RT @SpaceXJobs: Thank you to all of the brave women and men who have served and sacrificed—we salute you! https://t.co/ALPx9znOob RT @Commercial_Crew: Commercial crew astronauts Bob Behnken and Doug Hurley are getting familiar with operating inside @SpaceX's Crew Drago… Starman’s current location. Next stop, the restaurant at the end of the universe. https://t.co/Ty5m8IjJpE The team at our rocket development facility in McGregor, Texas completed a static fire test last night of the Falcon 9 booster that will launch SpaceX’s first demonstration mission for @NASA’s Commercial Crew Program – one step closer to flying astronauts to the @Space_Station! https://t.co/iDYNoamCvU Video recap of last night’s launch and landing https://t.co/QRcyZQp612 More photos from last night’s Falcon 9 launch and first stage landing → https://t.co/095WHX44BX https://t.co/xt48uu45am Liftoff and landing https://t.co/IXN0NQIC1L Falcon 9's first West Coast land landing https://t.co/zObJgzLI0C Falcon 9 on Landing Zone 4 after delivering SAOCOM 1A to low Earth orbit, marking the 30th successful landing of a rocket booster. https://t.co/8cgAaWlBEl Successful deployment of SAOCOM 1A to low Earth orbit confirmed. https://t.co/dEoh2ouDs5 Falcon 9 has landed – first West Coast land landing of an orbital class rocket booster. Second stage engine cutoff confirmed. First stage entry burn complete. Second stage continuing nominally to low Earth orbit. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. https://t.co/aFYuCC22ys Liftoff! https://t.co/rzFcHcEvnA T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z https://t.co/PE4qFzqSeh T-60 minutes until Falcon 9 launch of SAOCOM 1A. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and SAOCOM 1A are vertical on SpaceX's launch pad at Vandenberg AFB. Following today’s launch at 7:21 p.m. PDT, SpaceX will attempt to land Falcon 9's first stage on Landing Zone 4. Webcast starts ~15 minutes before liftoff → https://t.co/gtC39uBC7z https://t.co/vkE1lkXrEb SpaceX’s West Coast landing zone https://t.co/OykcwiOg18 RT @elonmusk: Sonic boom warning. This won’t be subtle.\nhttps://t.co/WY7dn6BBY1 Now targeting October 7 for launch of SAOCOM 1A. Rocket and payload are healthy; additional time will be used to complete pre-flight vehicle checkouts. Static fire test of Falcon 9 complete–targeting October 6 launch of SAOCOM 1A from Vandenberg Air Force Base in California. We ❤️ @NASA! You have inspired and shown the world to believe the impossible is possible. SpaceX is proud to partner with @NASA. Happy #NASA60th and ad astra! https://t.co/TYhJkpoZu9 A model of the first privately developed liquid fuel rocket to achieve orbit—right next to the first rocket booster to successfully land on land after an orbital class mission. https://t.co/CPUCeORqAX Ten years ago today, we achieved our first successful launch—time flies when you’re having fun! https://t.co/lwWSggSHWZ RT @elonmusk: Mars Base Alpha https://t.co/O1llQp8rFY RT @elonmusk: https://t.co/Fn0hKJd3uJ BFR is designed to be fully reusable, servicing Earth orbit as well as the Moon and Mars. https://t.co/Cmdka2K63o RT @elonmusk: Hanging out with @yousuck2020 before the @SpaceX moon mission announcement https://t.co/RTOwutzMtG RT @elonmusk: Yusaku will be bringing 8 (brave) artists &amp; cultural figures with him on the journey around the moon! https://t.co/PCU23HYTa9 The first private passenger to fly around the Moon aboard BFR is fashion innovator and globally recognized art curator Yusaku Maezawa. Lasting about a week, the journey will come as close as 125 miles to the Moon’s surface before completing lunar transit and returning back to Earth. https://t.co/1P4HSHxaNU SpaceX’s next generation vehicle—BFR—will be the most powerful rocket in history, capable of carrying humans to the Moon, Mars, and beyond. https://t.co/gtC39uBC7z https://t.co/urQDbdTK94 SpaceX has completed over 60 launches to-date and has the world’s only reusable orbital class rockets and spacecraft—capable of launching to space, returning to Earth, and flying again. https://t.co/0rjinzNHyb Webcast is now live → https://t.co/gtC39uBC7z SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Webcast will go live in ~15 minutes → https://t.co/gtC39uBC7z Meet BFR’s first private passenger tomorrow at 6:00 p.m. PDT → https://t.co/gtC39uBC7z Only 24 humans have been to the Moon in history. No one has visited since the last Apollo mission in 1972. https://t.co/gtC39uBC7z SpaceX has signed the world’s first private passenger to fly around the Moon aboard our BFR launch vehicle—an important step toward enabling access for everyday people who dream of traveling to space. Find out who’s flying and why on Monday, September 17. https://t.co/64z4rygYhk More photos from last night’s Falcon 9 launch → https://t.co/095WHX44BX https://t.co/cZV5ImO4HD Last night’s launch of Telstar 18 VANTAGE marked Falcon 9’s 60th successful mission. https://t.co/iKXsnayASz Successful deployment of Telstar 18 VANTAGE to a geostationary transfer orbit confirmed. https://t.co/nlRgxoILJ9 Back live for satellite deployment → https://t.co/gtC39uBC7z Final second stage engine cutoff nominal. Webcast returns in 3 minutes for satellite deployment. Back live for final burn → https://t.co/gtC39uBC7z Second stage and satellite now in coast phase. The webcast will return in 15 minutes for second stage engine restart and satellite deployment. Falcon 9 first stage has landed on the Of Course I Still Love You droneship. Second stage engine cutoff confirmed. First stage entry burn complete. Second stage continuing nominally to geostationary transfer orbit. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/xdJXpNTKXu T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z Pushing T-0 to 12:45 a.m. EDT, 4:45 UTC for weather. Vehicle and payload remain in good health for launch of Telstar 18 VANTAGE. New T-0 of 12:30 a.m. EDT, 4:30 UTC for weather. Vehicle and payload still look good for launch. All systems go for launch of Telstar 18 VANTAGE; team is monitoring weather conditions. Targeting liftoff at 12:00 a.m. EDT, 4:00 UTC. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and Telstar 18 VANTAGE are vertical on Pad 40 in Florida. Weather is 60% favorable for tonight’s four-hour launch window, which opens at 11:28 p.m. EDT. → https://t.co/gtC39uBC7z https://t.co/BScLG1xJD9 Now targeting September 9 launch of Telstar 18 VANTAGE from Pad 40 in Florida. Rocket and payload are healthy; additional time will be used to complete pre-flight checkouts. Static fire test of Falcon 9 complete—targeting September 8 launch of Telstar 18 VANTAGE from Pad 40 in Florida. Forward hatch view of Dragon departing the @Space_Station earlier this month. https://t.co/L1Kc5XI0G7 Crew access arm installed at Launch Complex 39A in Florida; will serve as a bridge for @NASA astronauts to board Crew Dragon. https://t.co/E9OXAOGWtQ RT @Hyperloop: The 2019 Hyperloop Pod Competition is coming next summer. Registration is open now → https://t.co/CoIedEujWn   https://t.co/… Falcon 9 lands on the “Of Course I Still Love You” droneship and returns to port after delivering the Merah Putih satellite to geosynchronous transfer orbit. This mission marked the first re-flight of a Falcon 9 Block 5 rocket booster. https://t.co/dkeXxPZmlq https://t.co/4l3vmIBLyM RT @SpaceXJobs: SpaceX employees at HQ in Hawthorne had the opportunity yesterday to meet the first four @NASA astronauts who will fly aboa… The first four @NASA astronauts who will fly aboard Crew Dragon visited the factory to meet employees today. https://t.co/MLGrhB1Rnz https://t.co/oTVIx79HaU With the Red Planet in sight, Falcon 9 launched Merah Putih to orbit last night and completed SpaceX’s 15th flight of a previously flown rocket booster. https://t.co/pCfhdNg0e4 https://t.co/jhjFUylA6D Successful deployment of Merah Putih to a geostationary transfer orbit confirmed. Back live for satellite deployment → https://t.co/gtC39uBC7z Final second stage engine cutoff nominal. Webcast returns in ~4 minutes for satellite deployment. Back live for final burn → https://t.co/gtC39uBC7z Second stage and satellite now in coast phase. The webcast will return in ~10 minutes for second stage engine restart and satellite deployment. Falcon 9 first stage has landed on the Of Course I Still Love You droneship. https://t.co/HCRvCYopuM Second stage engine cutoff confirmed. First stage entry burn complete. Second stage continuing nominally to geostationary transfer orbit. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-30 minutes until Falcon 9 launch of Merah Putih. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and Merah Putih are vertical on Pad 40 in Florida. Weather is 80% favorable for the two-hour launch window, which opens Tuesday, August 7 at 1:18 a.m. EST, 5:18 a.m. UTC. https://t.co/gtC39uBC7z https://t.co/xT23Oaz7bu Dragon returned home yesterday after its second month-long stay at the @Space_Station. It’s now headed to port for a cargo handover to @NASA. https://t.co/YJIUqcgCZZ https://t.co/EINH2xExP2 Splashdown of Dragon confirmed. Recovery team en route. Dragon’s three main parachutes have been deployed. Dragon’s drogue chutes deployed nominally. Dragon de-orbit burn is now complete and its trunk has been jettisoned. Pacific Ocean splashdown in ~30 minutes. Dragon will re-enter Earth’s atmosphere in ~5 hours. Splashdown at 3:17 p.m. PDT. The three departure burns to move Dragon away from the @Space_Station are complete. Dragon has been released from the @Space_Station! Three departure burns are now underway. After a month-long stay, Dragon is preparing to depart the @Space_Station and return to Earth today. https://t.co/i2iwCAvuxQ Meet the first four @NASA astronauts who will fly aboard Crew Dragon to the @Space_Station! https://t.co/9JZLWOPSK0 https://t.co/mNYa1PjKwU Watch live as @NASA announces the astronauts assigned to fly aboard Crew Dragon and launch from American soil for the first time since the final Space Shuttle mission in 2011 → https://t.co/rdhLIxFGwa https://t.co/Y640lpu13G RT @Commercial_Crew: We are about 15 minutes away from the announcement of our astronauts who will launch from @NASAKennedy to the @Space_S… Static fire test of Falcon 9 complete—targeting August 7 launch of Merah Putih from Pad 40 in Florida. RT @Space_Station: Station teams from around the world polled “go” for Friday’s release of the @SpaceX #Dragon cargo craft and its splashdo… Dragon and the @Space_Station passed over SpaceX headquarters and across the face of the Moon last weekend. After a month-long stay, Dragon will detach from the orbiting laboratory and return to Earth on August 3. https://t.co/HljgvnfDyM https://t.co/Gvm75nJQDy More photos from Falcon 9’s launch of Iridium-7 → https://t.co/095WHX44BX https://t.co/JG0qyiajb7 Successful deployment of 10 @IridiumComm NEXT satellites to low-Earth orbit confirmed. https://t.co/a9hVkFqiaH Back live for final burn and deployment of 10 @IridiumComm NEXT satellites → https://t.co/gtC39uBC7z Despite challenging weather conditions, Falcon 9 first stage booster landed on Just Read the Instructions. Webcast back in about 40 minutes for second stage engine restart and deployment of 10 @IridiumComm NEXT satellites. Second stage and @IridiumComm NEXT satellites now in coast phase. Second stage engine cutoff confirmed. First stage reentry burn completed. Fairing has deployed. First stage boost back burn underway. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/gtC39uBC7z T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-60 minutes until Falcon 9 launch of Iridium-7. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and Iridium-7 went vertical earlier today on the SpaceX launch pad at Vandenberg Air Force Base in California. Weather is 90% favorable for tomorrow’s launch at 4:39 a.m. PDT, 11:39 UTC. https://t.co/gtC39uBC7z https://t.co/zGw49C1UTP More photos from Falcon 9’s launch of Telstar 19 VANTAGE → https://t.co/095WHX44BX https://t.co/rZZwfQ7Gy6 Successful deployment of Telstar19 VANTAGE to a geostationary transfer orbit confirmed. https://t.co/cXKyyw6VXC Final second stage engine cutoff nominal. Back live for final burn → https://t.co/gtC39uBC7z Webcast returns in ~16 minutes for second stage engine restart. Falcon 9 first stage has landed on the Of Course I Still Love You droneship. Second stage engine cutoff confirmed. Second stage and satellite now in coast phase. First stage entry burn complete. Second stage continuing nominally to geostationary transfer orbit. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-60 minutes until Falcon 9 launch of Telstar19 VANTAGE. Launch webcast will go live ~15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and Telstar 19 VANTAGE went vertical this afternoon on Pad 40 in Florida. Weather is 60% favorable for the four-hour launch window, which opens Sunday, July 22 at 1:50 a.m. EDT, 5:50 UTC. https://t.co/gtC39uBC7z https://t.co/uFRJDBrvH9 Static fire test of Falcon 9 complete— targeting July 25 launch of Iridium-7 from Vandenberg Air Force Base in California. Static fire test of Falcon 9 complete—targeting early morning launch on Sunday, July 22 of Telstar 19 VANTAGE from Pad 40 in Florida. RT @Hyperloop: Student teams are arriving at @SpaceX for the 2018 Hyperloop Pod Competition! Testing is underway ahead of competition day t… Mr. Steven—now with more net. SpaceX’s fairing recovery vessel has been fitted with a 4x larger net ahead of its next recovery attempt targeted for later this month. https://t.co/cjXvzg1H70 https://t.co/AdAwPP30OU Crew Dragon arrived in Florida this week ahead of its first flight after completing thermal vacuum and acoustic testing at @NASA’s Plum Brook Station in Ohio. https://t.co/xXJE8TjcTr https://t.co/lr0P95zzIK Filled with more than 5,900 pounds of @NASA cargo and research materials, Dragon was captured by @Space_Station crew members and attached to the orbiting laboratory earlier this week for its month long stay. https://t.co/3owFVh13Iy https://t.co/El6AFXrdoN RT @NASA: At 9:52am ET, @SpaceX's #Dragon cargo craft was bolted into place and is now attached to the @Space_Station where it will be for… Capture confirmed! Dragon now attached to the @Space_Station robotic arm. Dragon is 10 meters from the @Space_Station. Capture sequence starting in ~20 minutes. Dragon has been given a \"go\" to move towards capture position. https://t.co/8FO22NPdbv RT @NASA: .@SpaceX's #Dragon cargo craft is holding 30 meters away from the @Space_Station as astronauts prepare to grab onto the spacecraf… Dragon is ~30 meters from the @Space_Station. Watch live → https://t.co/rdhLIxXhnI https://t.co/bwlFhcrqoH More photos of today’s Falcon 9 launch of Dragon to the @Space_Station → https://t.co/095WHX44BX https://t.co/7sSyipmfSf Dragon is on its way to the International Space Station. Capture by @Space_Station crew set for Monday morning. Dragon’s solar arrays have deployed. https://t.co/r3ZVkfie4X Dragon confirmed in good orbit. https://t.co/gtC39uBC7z Second stage engine burn complete. Second stage propelling Dragon into its orbit to meet up with the @Space_Station. Main engine cutoff and stage separation confirmed. Liftoff! https://t.co/gtC39uBC7z T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z ~1 hour until Falcon 9 launch of Dragon for its fifteenth mission to the @Space_Station. Vehicle and spacecraft are healthy and tracking no issues https://t.co/4HXWxvJ6aZ Falcon 9 and Dragon went vertical tonight ahead of tomorrow’s resupply mission to the @ISS. Weather is 90% favorable for launch at 5:42 a.m. EDT, 9:42 UTC. Another view of SpaceX’s 16th Crew Dragon parachute test recently completed at Naval Air Facility El Centro in Southern California. https://t.co/M6yppkxXgY https://t.co/zecux3EUEH At Naval Air Facility El Centro in Southern California, SpaceX recently completed its 16th test of Crew Dragon’s parachute system—verifying the system’s ability to slow Crew Dragon and ensure a safe landing in the unlikely event of a low altitude abort. https://t.co/OOQnAtNXJ3 https://t.co/kFX7Qth3AK Rocket and spacecraft for CRS-15 are flight-proven. Falcon 9’s first stage previously launched @NASA_TESS two months ago, and Dragon flew to the @Space_Station in support of our ninth resupply mission in 2016. Static fire test of Falcon 9 complete—targeting June 29 launch from Pad 40 in Florida for Dragon’s fifteenth mission to the @Space_Station. Crew Dragon is at @NASA’s Plum Brook Station testing facility in Ohio, home to the largest thermal vacuum chamber in the world, to demonstrate its capability to withstand the extreme temperatures and vacuum of space. https://t.co/tiVZs2mscm https://t.co/7YlCasDkVU More photos from this morning’s Falcon 9 launch of SES-12, completing Falcon 9’s 55th mission since its first flight from the same pad eight years ago today → https://t.co/095WHWMtKp https://t.co/8NsPiKpDes Successful deployment of SES-12 to a geostationary transfer orbit confirmed. Final second stage engine cutoff nominal, preparing to deploy satellite. Back live for final burn and satellite deployment → https://t.co/gtC39uBC7z Second stage and satellite now in coast phase. Webcast returns in ~15 minutes for second stage engine restart and satellite deployment. Second stage engine has cutoff as planned. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/0o4C8oz9gP T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z All systems go for launch of SES-12. Liftoff set for 12:45 a.m. EDT, 4:45 UTC. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and SES-12 went vertical this morning on Pad 40 in Florida. Weather is 70% favorable for the four-hour launch window which opens on June 4 at 12:29 a.m. EDT, or 4:29 UTC. https://t.co/gtC39uBC7z https://t.co/GziYEyZAxN Falcon 9 fairing halves deployed their parafoils and splashed down in the Pacific Ocean last week after the launch of Iridium-6/GRACE-FO. Closest half was ~50m from SpaceX’s recovery ship, Mr. Steven. https://t.co/JS7d5zTdIg https://t.co/LjiTwnB4wd Standing down from Friday’s launch attempt to run additional tests on Falcon 9’s second stage. Rocket and payload are in good health. Currently working toward a June 4 launch of SES-12 from Pad 40 in Florida. Now targeting June 1 launch of SES-12 from Pad 40; team using additional time to perform pre-launch vehicle checks, also closely watching weather conditions at the Cape. Static fire test of Falcon 9 complete—targeting May 31 launch of SES-12 from Pad 40 in Florida. More photos from today’s Falcon 9 launch → https://t.co/095WHX44BX https://t.co/K2QlUnwKcJ Successful deployment of 5 @IridiumComm NEXT satellites to low-Earth orbit confirmed. https://t.co/fXBUyhMA6V Back live for final burn and deployment of 5 @IridiumComm NEXT satellites → https://t.co/gtC39uBC7z Webcast back in about 40 minutes for second stage engine restart and deployment of 5 @IridiumComm NEXT satellites. Successful deployment of GRACE-FO satellites. Second stage engine cutoff confirmed. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-60 minutes until Falcon 9 launch of Iridium-6/GRACE-FO. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and Iridium-6/GRACE-FO went vertical last night ahead of today’s launch at 12:47 p.m. PDT, 19:47 UTC from Vandenberg Air Force Base in California. https://t.co/wJxwQ9XSKJ https://t.co/jiRT8Cn2wU Static fire test of Falcon 9 complete—targeting May 22 launch of Iridium-6/GRACE-FO from Vandenberg Air Force Base in California. More photos from the first flight of Falcon 9 Block 5 → https://t.co/095WHWMtKp https://t.co/4gZsAc01Bg Successful deployment of Bangabandhu Satellite-1 to geostationary transfer orbit confirmed. https://t.co/aX7kRQtBpZ Final second stage engine cutoff nominal. Second stage engine cutoff confirmed. Second stage and satellite now in coast phase. Falcon 9 Block 5 first stage has landed on the Of Course I Still Love You droneship. https://t.co/YHqdxIrc8b First stage entry burn complete. Second stage continuing nominally to geostationary transfer orbit. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. https://t.co/KAaESktUJU Liftoff! https://t.co/gtC39uTdw9 https://t.co/aYHHm24Hca T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-30 minutes until Falcon 9 Block 5 launch of Bangabandhu Satellite-1. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z All systems looking good for Falcon 9’s launch of Bangabandhu Satellite-1. Weather is 70% favorable for today's launch window, which opens at 4:14 p.m. EDT, 20:14 UTC. https://t.co/gtC39uBC7z https://t.co/ApnrbZrPxP Standing down today due to a standard ground system auto abort at T-1 min. Rocket and payload are in good health—teams are working towards tomorrow’s backup launch opportunity at 4:14 p.m. EDT, or 20:14 UTC. T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-30 minutes until launch of Bangladesh’s first geostationary communications satellite. Launch webcast will go live ~20 minutes before liftoff → https://t.co/gtC39uBC7z New T-0 of 5:47 p.m. EDT—vehicle and payload continue to look good for today's first flight of Falcon 9 Block 5. Falcon 9 Block 5 and Bangabandhu Satellite-1 went vertical on Pad 39A in Florida this morning. Now targeting liftoff at 4:42 p.m. EDT, 20:42 UTC – vehicle and payload look good, completing final check outs at the pad. https://t.co/gtC39uBC7z https://t.co/ML81qpl76g Targeting Falcon 9 Block 5 launch of Bangabandhu Satellite-1 on May 10 from Pad 39A in Florida. Good splashdown of Dragon confirmed, completing SpaceX’s third resupply mission to and from the @Space_Station with a flight-proven spacecraft. Dragon's drogue chutes and three main parachutes deployed nominally. Dragon's de-orbit burn is complete and trunk has been jettisoned. Pacific Ocean splashdown in ~30 minutes. Dragon will re-enter Earth's atmosphere in ~5 hours. Splashdown at 12:00 p.m. PDT. The three departure burns to move Dragon away from the @Space_Station are complete. Dragon has been released from the @Space_Station! Three departure burns are now underway → https://t.co/rdhLIxXhnI Dragon departing the @Space_Station in ~10 minutes. Watch live on @NASA TV → https://t.co/rdhLIxXhnI After a month-long stay at the @Space_Station, Dragon will detach and return to Earth today with more than 4,000 pounds of @NASA cargo and research materials. https://t.co/2J674seACa Falcon 9 Block 5 static fire test complete ahead of next week’s launch of Bangladesh’s first geostationary communications satellite. Vehicle is healthy. Data review will take a few days—will confirm a target launch date once that review is complete. RT @Space_Station: .@SpaceX's #Dragon resupply ship is scheduled to splash down in the Pacific Ocean on Saturday loaded with @NASA cargo an… Happy #EarthDay https://t.co/wrkH8zKAK3 More photos from yesterday's Falcon 9 launch of @NASA_TESS → https://t.co/095WHX44BX https://t.co/7Rb7NDIUgc Successful deployment of @NASA_TESS to a highly elliptical orbit confirmed. https://t.co/y9CS82cj9N Back live for satellite deployment → https://t.co/gtC39uBC7z Webcast returns in ~4 minutes for satellite deployment. Second stage engine cutoff confirmed. Back live for final burn → https://t.co/gtC39uBC7z Webcast returns in ~30 minutes for second stage engine restart. Second stage engine cutoff confirmed. Second stage and satellite now in coast phase. Falcon 9 first stage has landed on the Of Course I Still Love You droneship. https://t.co/gtC39uBC7z First stage entry burn complete. Second stage continuing nominally. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/gtC39uBC7z https://t.co/bIitVNX28p T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-1 hour until Falcon 9 launch of @NASA_TESS. Launch webcast will go live ~15 minutes before liftoff → https://t.co/gtC39uBC7z All systems and weather are go for Falcon 9’s launch of @NASA_TESS today at 6:51 p.m. EDT, or 22:51 UTC. https://t.co/gtC39uBC7z https://t.co/VgME3YRqwR Standing down today to conduct additional GNC analysis, and teams are now working towards a targeted launch of @NASA_TESS on Wednesday, April 18. Falcon 9 and @NASA_TESS are vertical on Space Launch Complex 40 at Cape Canaveral Air Force Station in Florida. Weather is 80% favorable for today’s launch at 6:32 p.m. EDT, 22:32 UTC. https://t.co/eEgVxT24No Static fire test of Falcon 9 complete—targeting April 16 launch of @NASA_TESS from Pad 40 in Florida. RT @NASA: The @SpaceX #Dragon cargo vehicle was successfully installed on the @Space_Station at 9:00am ET, delivering ~5,800 pounds of scie… Capture confirmed! Dragon is now attached to the @Space_Station robotic arm. https://t.co/X9LDd6zewl Dragon is ~10 meters from the @Space_Station. Capture sequence starting shortly → https://t.co/rdhLIxXhnI https://t.co/DUUT48EaBh Dragon has been given a \"go\" to move towards capture position. Dragon is holding ~30 meters away from the @Space_Station. Watch live → https://t.co/rdhLIxXhnI https://t.co/yXQfrO8b6E More photos from today’s Falcon 9 launch → https://t.co/095WHWMtKp https://t.co/gPSLg69ae9 Dragon is on its way to the International Space Station. Capture by @Space_Station crew set for Wednesday morning. RT @NASA: Right on schedule, solar arrays have been deployed on the @SpaceX #Dragon cargo spacecraft as it heads to @Space_Station. Watch:… Second stage engine burn complete. Dragon confirmed in good orbit. https://t.co/gtC39uBC7z Second stage propelling Dragon into its orbit to meet up with the @Space_Station. https://t.co/gtC39uBC7z Main engine cutoff and stage separation confirmed. Liftoff! https://t.co/gtC39uBC7z https://t.co/Q5yYeMPz2W T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-1 hour until Falcon 9 launch of Dragon for its fourteenth mission to the @Space_Station. Falcon 9’s first stage previously launched SpaceX’s twelfth resupply mission for @NASA last year, and Dragon flew to the orbiting laboratory in support of our eighth resupply mission in 2016. Falcon 9 rocket and Dragon spacecraft for today’s resupply mission to the @Space_Station are both flight-proven. https://t.co/54qWeH3oQB More photos from today’s Falcon 9 launch → https://t.co/095WHX44BX https://t.co/dncICkA2Gf Successful deployment of all 10 @IridiumComm NEXT satellites to low-Earth orbit confirmed. Ninth Iridium NEXT satellite deployed. Eighth Iridium NEXT satellite deployed. Seventh Iridium NEXT satellite deployed. Sixth Iridium NEXT satellite deployed. Fifth Iridium NEXT satellite deployed. Fourth Iridium NEXT satellite deployed. Third Iridium NEXT satellite deployed. Second Iridium NEXT satellite deployed. Second stage burn 2 complete. First satellite deployed. Final second stage engine burn underway. Second stage and @IridiumComm NEXT satellites now in coast phase. Second stage engine cutoff confirmed. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/gtC39uBC7z https://t.co/Aa0MnGkprH T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z ~60 minutes until Falcon 9 launch of Iridium-5. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 is vertical on the SpaceX launch pad at Vandenberg Air Force Base in advance of the Iridium-5 mission. All systems and weather are go for tomorrow's launch at 7:13 a.m. PDT, 14:13 UTC. https://t.co/HOIDbP9Xnj Falcon 9 and payload are healthy—the teams at Vandenberg are now targeting Friday, March 30 at 7:13 a.m. PDT for the launch of Iridium-5. Static fire test of Falcon 9 complete—targeting April 2 launch from Pad 40 in Florida for Dragon’s fourteenth mission to the @Space_Station. RT @IridiumBoss: We are having an issue with 1 of the 10 satellites in prep for #Iridium5.  Our supplier and launch team is resetting for N… Static fire test of Falcon 9 complete—targeting March 29 launch of Iridium-5 from Vandenberg Air Force Base in California. RT @NASA: Remembering Stephen Hawking, a renowned physicist and ambassador of science. His theories unlocked a universe of possibilities th… RT @elonmusk: Why Falcon Heavy &amp; Starman?\n\nLife cannot just be about solving one sad problem after another. There need to be things that in… RT @SpaceXJobs: From all the women at SpaceX who are helping to engineer the future of space exploration, happy International Women’s Day!… More photos from last night's Falcon 9 launch → https://t.co/095WHX44BX https://t.co/p8W1SsLEC0 Successful deployment of Hispasat 30W-6 to a geostationary transfer orbit confirmed. https://t.co/PHctrfzwKa Back live for satellite deployment → https://t.co/gtC39uBC7z Final second stage engine cutoff nominal. Webcast returns in ~2 minutes for satellite deployment. Back live for final burn → https://t.co/gtC39uBC7z Webcast returns in ~15 minutes for second stage engine restart. Second stage engine cutoff confirmed. Second stage and satellite now in coast phase. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-60 minutes until Falcon 9 launch of Hispasat 30W-6. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z RT @elonmusk: Falcon 9 flight 50 launches tonight, carrying Hispasat for Spain. At 6 metric tons and almost the size of a city bus, it will… Falcon 9 and Hispasat 30W-6 are vertical on Space Launch Complex 40 at Cape Canaveral Air Force Station in Florida. Weather is 90% favorable for the two-hour launch window, which opens at 12:33 a.m. EST, 5:33 UTC. https://t.co/gtC39uBC7z https://t.co/cF49rWUTRw Standing down from this weekend's launch attempt to conduct additional testing on the fairing’s pressurization system. Once complete, and pending range availability, we will confirm a new targeted launch date. More photos from today’s Falcon 9 launch → https://t.co/095WHX44BX https://t.co/xeuRZ9WxyZ RT @elonmusk: First two Starlink demo satellites, called Tintin A &amp; B, deployed and communicating to Earth stations https://t.co/TfI53wHEtz Successful deployment of PAZ satellite to low-Earth orbit confirmed. https://t.co/xOEuyaFrcZ Second stage engine cutoff confirmed. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/gtC39uBC7z T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-60 minutes until Falcon 9 launch of PAZ. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Standing down today due to strong upper level winds. Now targeting launch of PAZ for February 22 at 6:17 a.m. PST from Vandenberg Air Force Base. T-40 minutes until Falcon 9 launch of PAZ. Pending weather balloon data, launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Static fire test of Falcon 9 complete—targeting February 25 launch of Hispasat 30W-6 from Pad 40 in Florida. Falcon 9 and PAZ are vertical on Space Launch Complex 4E at Vandenberg Air Force Base in California. Weather is 90% favorable for tomorrow's launch at 6:17 a.m. PST, 14:17 UTC. https://t.co/bL1VjHmIhV Team at Vandenberg is taking additional time to perform final checkouts of upgraded fairing. Payload and vehicle remain healthy. Due to mission requirements, now targeting February 21 launch of PAZ. Now targeting February 18 launch of PAZ from SLC-4E to allow for additional time for pre-launch systems checks. Falcon 9 and payload remain healthy. Static fire test of Falcon 9 complete—targeting February 17 launch of PAZ from Vandenberg Air Force Base in California. RT @elonmusk: Third burn successful. Exceeded Mars orbit and kept going to the Asteroid Belt. https://t.co/bKhRN73WHF More photos from Falcon Heavy's first flight → https://t.co/095WHX44BX https://t.co/6vlXJoYif0 Live Views of Starman https://t.co/G335kvVsta RT @elonmusk: Live view of Starman https://t.co/gvSlztlE6l RT @elonmusk: Upper stage restart nominal, apogee raised to 7000 km. Will spend 5 hours getting zapped in Van Allen belts &amp; then attempt fi… Second stage engine cutoff as planned. Falcon Heavy side cores have landed at SpaceX’s Landing Zones 1 and 2. https://t.co/oMBqizqnpI Center core and side cores entry burns complete. Center core engine cutoff and separation from second stage confirmed. Second stage burn underway. Side cores engine cutoff and separation from center core confirmed. Center core continuing as planned. Liftoff! https://t.co/2ypESsi1sF T-60 seconds until launch of Falcon Heavy → https://t.co/gtC39uBC7z Falcon Heavy test flight webcast is now live → https://t.co/gtC39uBC7z T-60 minutes until Falcon Heavy’s first test flight. Launch webcast will go live about 20 minutes before liftoff → https://t.co/gtC39uBC7z Continue to monitor the upper level wind shear. New T-0 is 3:45 p.m. EST, 20:45 UTC. T-0 delayed to 2:20 p.m. EST, 19:20 UTC due to upper level wind shear. Continuing to monitor winds and will update as info becomes available. All systems remain go for today’s test flight of Falcon Heavy. Weather is 90% favorable for today’s two-and-a-half hour launch window, which opens at 1:30 p.m. EST, or 18:30 UTC. https://t.co/oYrZZQzzbo The first test flight of Falcon Heavy is targeted for Tuesday, Feb. 6th at 1:30 PM ET from Launch Complex 39A at Kennedy Space Center in Florida. When Falcon Heavy lifts off, it will be the most powerful operational rocket in the world by a factor of two. https://t.co/jzv975xKB0 https://t.co/yAVGdXJjEs RT @elonmusk: Falcon Heavy sends a car to Mars https://t.co/Y7uBtU6Mt2 Falcon 9's launch of GovSat-1 to a Geostationary Transfer Orbit is SpaceX's sixth mission with a flight-proven rocket. https://t.co/llX17HizMJ https://t.co/FemC90upRb Successful deployment of GovSat-1 to a Geostationary Transfer Orbit confirmed. https://t.co/0D3h7hR7YF Back live for satellite deployment → https://t.co/gtC39uBC7z Webcast returns in ~5 minutes for satellite deployment → https://t.co/gtC39uBC7z Final second stage engine cutoff nominal. Back live for final burn → https://t.co/gtC39uBC7z Webcast returns in ~15 minutes for second stage engine restart. Second stage and satellite now in coast phase. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/ItZOmXBagL T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-60 minutes until Falcon 9 launch of GovSat-1. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z All systems are go for Falcon 9’s launch of GovSat-1. Weather is 90% favorable for today’s launch window which opens at 4:25 p.m. EST, 21:25 UTC. Standing down for today. Team is going to replace a second stage sensor. Next available launch opportunity is tomorrow, January 31. Weather is 40% favorable at the top of today’s approximate two-and-a-half hour launch window, which opens at 4:25 p.m. EST, or 21:25 UTC. Falcon 9 and GovSat-1 are vertical on Space Launch Complex 40 at Cape Canaveral Air Force Station in Florida. https://t.co/oy8Lug4ACK RT @elonmusk: Aiming for first flight of Falcon Heavy on Feb 6 from Apollo launchpad 39A at Cape Kennedy. Easy viewing from the public caus… Static fire test of Falcon 9 complete—targeting January 30 launch of GovSat-1 from Pad 40 in Florida. First static fire test of Falcon Heavy complete—one step closer to first test flight! https://t.co/EZF4JOT8e4 Dragon is headed to port with ~4,100 pounds of scientific research and hardware for a cargo handover to @NASA. https://t.co/7ebJJ188iO Good splashdown of Dragon confirmed, completing the second resupply mission to and from the @Space_Station with a flight-proven commercial spacecraft. Dragon's main parachutes have been deployed. Dragon's drogue chutes have been deployed nominally. Dragon's deorbit burn is complete and trunk has been jettisoned. Pacific Ocean splashdown in ~30 minutes. The three departure burns to move Dragon away from the @Space_Station are complete. https://t.co/3cyYatpqRb Dragon has been released from the @Space_Station. Three departure burns are now underway → https://t.co/rdhLIxXhnI RT @NASA: LIVE NOW: @SpaceX’s #Dragon cargo vehicle departs @Space_Station after almost a month on orbit. Watch: https://t.co/ZuxLDtzW9c ht… After a month-long stay at the @Space_Station, Dragon returns home tomorrow with ~4,100 pounds of @NASA cargo and research materials. https://t.co/O1IaRH6ypU https://t.co/CXRKI0NuTD More photos from yesterday's Falcon 9 launch and first stage landing → https://t.co/095WHX44BX https://t.co/fy1az5xIXx Falcon 9 first stage has landed at Landing Zone 1. https://t.co/679wN4F8kX First stage entry burn underway. Main engine cutoff and stage separation confirmed. Liftoff! T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-60 minutes until launch of Zuma. Launch webcast will go live about 20 minutes before liftoff → https://t.co/gtC39uBC7z Weather is 80% favorable for today’s two-hour launch window which opens at 8 PM EST. https://t.co/qcFz9Q25j6 Team at the Cape completed additional propellant loading tests today. Extreme weather slowed operations but Falcon 9 and the Zuma spacecraft are healthy and go for launch—now targeting January 7 from Pad 40 in Florida. Team at the Cape performed a propellant loading test of Falcon 9 on Pad 40 this morning – additional static fire test of the rocket was not necessary. Targeting January 5 launch of Zuma. More photos of Falcon Heavy on the launch pad → https://t.co/095WHX44BX https://t.co/Z5aE1BUFSt With more than 5 million pounds of thrust at liftoff—equal to approximately eighteen 747 aircraft at full power—Falcon Heavy will be the most powerful operational rocket in the world by a factor of two. https://t.co/NneqPRPr46 https://t.co/oswCUreG6i More photos from last night's Falcon 9 launch → https://t.co/095WHX44BX https://t.co/6ubAeLk20a Iridium has acquired healthy signals from all 10 satellites. Successful deployment of 10 @IridiumComm NEXT satellites to low-Earth orbit confirmed. https://t.co/CTtvPYNgMA Back live for final burn and deployment of 10 @IridiumComm NEXT satellites → https://t.co/gtC39uBC7z RT @alias_amanda: Here’s the video. #spacex #IridiumNEXT https://t.co/mnVKrPjCcB Webcast back in about 40 minutes for second stage engine restart and deployment of 10 @IridiumComm NEXT satellites. Second stage and @IridiumComm NEXT satellites now in coast phase. Second stage engine cutoff confirmed. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/gtC39uBC7z T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z ~60 minutes until Falcon 9 launch of Iridium-4. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z https://t.co/rJ7ddLig3v A Red Car for the Red Planet https://t.co/PakS3rvp5C https://t.co/440bvUHJeO Falcon 9’s first stage booster for this mission previously launched 10 satellites to low-Earth orbit for Iridium in June of this year → https://t.co/gtC39uBC7z Falcon 9 and Iridium-4 went vertical last night on SLC-4E at Vandenberg AFB. Today's launch is at 5:27 p.m. PST. https://t.co/ahwXNprr5Z Two years ago today, Falcon 9 delivered 11 Orbcomm satellites to low-Earth orbit followed by the first successful orbital class rocket booster landing. To date, SpaceX has landed 20 boosters—12 on droneships and 8 on land—and flown 4 missions on flight-proven boosters. https://t.co/CPlkGBf589 The SpaceX team recently completed production on our 400th Merlin 1D engine—the latest iteration of SpaceX’s rocket engine that powers Falcon 9 to space → https://t.co/9BJCSTePq3 https://t.co/eudHFBSrQI RT @elonmusk: Falcon Heavy at the Cape https://t.co/hizfDVsU7X Static fire test of Falcon 9 complete—targeting December 22 launch of Iridium-4 from Vandenberg AFB in California. Dragon now installed at the @Space_Station. Crew will open the hatch later today. https://t.co/WatpK0D8TR Capture confirmed! Dragon is now attached to the @Space_Station robotic arm. Dragon is ~10 meters from @Space_Station. Capture sequence starting shortly → https://t.co/rdhLIxXhnI https://t.co/2wZcVHthoV Dragon given a \"go\" to move towards capture position. Dragon is ~30 meters from the @Space_Station. Watch live → https://t.co/rdhLIxXhnI https://t.co/gyExwTVl4W RT @Space_Station: The @SpaceX #Dragon is closing in on the station as it passes the 150 meter mark. https://t.co/yuOTrZ4Jut https://t.co/I… More photos of Falcon 9's launch of Dragon to the @Space_Station, and first stage landing → https://t.co/095WHWMtKp https://t.co/VJIBcyBgzT Solar arrays deployed and Dragon is on its way to the International Space Station. Capture by @Space_Station crew set for Sunday. Dragon confirmed in good orbit. Falcon 9 first stage has landed at Landing Zone 1 — SpaceX’s 20th recovery of a first stage booster. https://t.co/DHLAf7hq7t Second stage and Dragon continuing nominally. https://t.co/gtC39uBC7z Falcon 9 first stage entry burn underway. Second stage propelling Dragon into its orbit to meet up with the @Space_Station. Main engine cutoff and stage separation confirmed. Liftoff! https://t.co/gtC39uBC7z https://t.co/txorzQata0 T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-1 hour until Falcon 9 launch of Dragon for thirteenth resupply mission to the @Space_Station. Launch webcast will go live about 20 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and Dragon went vertical on SLC-40 early this morning. Weather is 90% favorable for today’s launch at 10:36 a.m. EST, 15:36 UTC. https://t.co/8i5Gxy9zhr Taking additional time for the team to conduct full inspections and cleanings due to detection of particles in 2nd stage fuel system. Now targeting CRS-13 launch from SLC-40 on Dec. 15. Next launch opportunity would be no earlier than late December. Now targeting Dec. 13 for launch of CRS-13 from SLC-40 to allow for additional time for pre-launch ground systems checks. Seven years ago today, Dragon orbited Earth twice before re-entering the atmosphere and splashing down in the Pacific Ocean, becoming the first private vehicle to return from space → https://t.co/M26v6ueW32 https://t.co/UIVhCPNFxR Rocket and spacecraft for CRS-13 are flight-proven. Falcon 9’s first stage previously launched SpaceX’s eleventh resupply mission for @NASA, and Dragon flew to the @Space_Station in support of our sixth cargo resupply mission. https://t.co/RY4F2TrWO2 Static fire test of Falcon 9 complete—targeting launch of CRS-13 on December 12 from Pad 40, followed by launch of Zuma from Pad 40 in early January. Though we’ve preserved the range opportunity for tomorrow, we’ll take the time needed to complete the data review and then confirm a new launch date. Standing down on Zuma mission to take a closer look at data from recent fairing testing for another customer. Falcon 9 and Zuma went vertical last night on Pad 39A. Now targeting November 16 for launch — rocket and payload remain healthy, and the teams will use the extra day to conduct additional mission assurance work. https://t.co/EHHq2rMZ4g Static fire test of Falcon 9 complete—targeting November 15 launch of Zuma from Pad 39A in Florida. Today we honor all who have served, sacrificed and continue to make a difference. Thank you for your service. https://t.co/8qv1JwuTls More photos from Falcon 9's launch of Koreasat-5A to orbit → https://t.co/095WHX44BX https://t.co/Ski0UWeK8d Successful deployment of Koreasat-5A to geostationary transfer orbit confirmed. Back live for satellite deployment → https://t.co/gtC39uBC7z Final second stage engine cutoff nominal. Webcast returns in ~5 minutes for satellite deployment. Back live for final burn → https://t.co/gtC39uBC7z Webcast returns in ~15 minutes for second stage engine restart. Second stage and satellite now in coast phase. Falcon 9 first stage has landed on the Of Course I Still Love You droneship. Second stage engine cutoff confirmed. First stage entry burn complete. Second stage continuing nominally to geostationary transfer orbit. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/gtC39uBC7z https://t.co/SPrwIpeOQ6 T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z ~1 hour until launch of Koreasat-5A. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and Koreasat-5A went vertical last night on Pad 39A. Today’s launch window opens at 3:34 p.m. EDT → https://t.co/gtC39uBC7z https://t.co/d7sKnWtQCy Static fire test of Falcon 9 complete—targeting October 30 launch of Koreasat-5A from Pad 39A in Florida. RT @elonmusk: BFR AMA on r/space in 2 hours More photos from today’s Falcon 9 launch and first stage landing → https://t.co/095WHX44BX https://t.co/ZWzr7kWJsZ Successful deployment of EchoStar 105/SES-11 to geostationary transfer orbit confirmed. https://t.co/gRA7Rb1MM4 Back live for satellite deployment → https://t.co/gtC39uBC7z Final second stage engine cutoff nominal. Webcast returns in ~8 minutes for satellite deployment. Back live for final burn → https://t.co/gtC39uBC7z Webcast returns in ~15 minutes for second stage engine restart. Second stage and satellite now in coast phase. Second stage engine cutoff confirmed. Falcon 9 first stage has landed on Of Course I Still Love You — third successful mission with a flight-proven orbital class rocket. First stage entry burn complete. Second stage continuing nominally to geostationary transfer orbit. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/gtC39uBC7z T-60 seconds until launch  → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch now live → https://t.co/gtC39uBC7z T-60 minutes until Falcon 9 launch of EchoStar 105/SES-11. Launch webcast will go live ~15 minutes before liftoff → https://t.co/gtC39uBC7z Weather is 90% favorable for tonight’s two-hour launch window, which opens at 6:53 p.m. EDT, 22:53 UTC. → https://t.co/gtC39uBC7z Falcon 9 and EchoStar 105/SES-11 went vertical last night on Pad 39A. https://t.co/WWLoIobQb3 Iridium has acquired healthy signals from all 10 satellites. Successful deployment of 10 @IridiumComm NEXT satellites to low-Earth orbit confirmed. https://t.co/w6pzeefmzO Back live for final burn and deployment of 10 @IridiumComm NEXT satellites → https://t.co/gtC39uBC7z Webcast back in about 40 minutes for second stage engine restart and deployment of 10 @IridiumComm NEXT satellites. Second stage and @IridiumComm NEXT satellites now in coast phase. Second stage engine cutoff confirmed. Falcon 9 first stage has landed on Just Read the Instructions. https://t.co/CS40cSiqSP First stage entry burn underway. Fairing has deployed. First stage boost back burn complete. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. https://t.co/Ywd21LokMt Liftoff! https://t.co/gtC39uBC7z T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z T-60 minutes until Falcon 9 launch of Iridium-3. Launch webcast will go live ~15 minutes before liftoff → https://t.co/gtC39uBC7z https://t.co/RegJydXXul Falcon 9 and Iridium-3 are vertical on SLC-4E at Vandenberg AFB. Weather is 90% favorable for tomorrow's launch at 5:37 a.m. PDT, 12:37 UTC. https://t.co/TpKYuAlRZA Now targeting October 11 for the launch of EchoStar 105/SES-11 from Pad 39A in Florida. Static fire test of Falcon 9 complete—targeting October 9 launch of Iridium-3 from Vandenberg AFB in California. Static fire test of Falcon 9 complete—targeting October 7 launch of EchoStar 105/SES-11 from Pad 39A in Florida. https://t.co/4Nwe65JyK5 BFR is also capable of Earth to Earth transportation. Anywhere on Earth in under an hour → https://t.co/XxUeN9KBKp Supporting the creation of a permanent, self-sustaining human presence on Mars. https://t.co/kCtBLPbSg8 https://t.co/ra6hKsrOcG First opportunity to land BFR with cargo on Mars is 2022, followed by BFR crew and cargo missions to Mars in 2024. https://t.co/kCtBLPbSg8 BFR is capable of transporting satellites to orbit, crew and cargo to the @Space_Station and completing missions to the Moon and Mars. https://t.co/p9staho4VZ Falcon 9 has completed 16 successful landings. https://t.co/OzAA6ziSCz SpaceX has completed over 1,200 seconds of firing across 42 main Raptor engine tests. https://t.co/EhxbPjd8Cj Webcast is now live → https://t.co/kCtBLPbSg8 Elon Musk’s presentation at @IAC2017 will start shortly. Watch live → https://t.co/kCtBLPbSg8 RT @elonmusk: Mars City\nOpposite of Earth. Dawn and dusk sky are blue on Mars and day sky is red. https://t.co/XHcZIdgqnb RT @elonmusk: Moon Base Alpha https://t.co/voY8qEW9kl Nine years ago today, Falcon 1 became the first privately developed liquid fuel rocket to orbit Earth. https://t.co/Aa0ITkuJET https://t.co/YFlCmEujmC At @IAC2017, Elon Musk will provide an update on plans for making humanity multi-planetary → https://t.co/kCtBLPbSg8 https://t.co/gb1RHBqKGI Iridium-3 launch slated for 10/9 from Vandenberg, AFB in California—setting up back-to-back launches in early October. Targeting 10/7 launch of EchoStar 105/SES-11 on a flight-proven first stage rocket booster from Pad 39A in Florida. Good splashdown of Dragon confirmed, completing its 12th mission to and from the @Space_Station. Dragon's three main parachutes have been deployed. Dragon's drogue chutes have been deployed nominally. Dragon's de-orbit burn is complete and trunk has been jettisoned. Pacific Ocean splashdown in ~30 minutes. Dragon will re-enter Earth's atmosphere in ~5 hours. Splashdown at 10:15 a.m. EDT, 14:15 UTC. The three departure burns to move Dragon away from the @Space_Station are complete. Dragon has been released from the @Space_Station! Three departure burns are now underway. https://t.co/XwYBRrA6A8 After a month-long stay at the @Space_Station, Dragon returns to Earth on Sunday, September 17 → https://t.co/rMEkkhEzoQ https://t.co/wM3HtvBSmx How Falcon 9, the first reusable, orbit-class rocket, eventually managed to land in one piece and stay that way → https://t.co/aQJuQbHYFF https://t.co/Kbb1cwxJMj RT @elonmusk: Astronaut spacesuit next to Crew Dragon https://t.co/Csmgx8Nn0t More photos from today’s Falcon 9 launch and first stage landing → https://t.co/095WHWMtKp https://t.co/TpFnWS9GI9 Falcon 9 first stage has landed at Landing Zone 1. https://t.co/TBDKNm6hbe Main engine cutoff and stage separation confirmed. Liftoff! https://t.co/qmIjpZyhsP T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z ~30 minutes until Falcon 9 launch of OTV-5. Webcast will go live about 10 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and OTV-5 are vertical on Pad 39A  Weather is 50% favorable for today’s ~5 launch window which opens at 9:50 a.m. EDT, 13:50 UTC. https://t.co/wc9XyWVZ0E Falcon Heavy’s 3 first stage cores have all completed testing at our rocket development facility in McGregor, TX → https://t.co/GJu23QdZRK https://t.co/ivVXPhWu0u Static fire test complete—targeting Falcon 9 launch of OTV-5 from Pad 39A at @NASAKennedy on Thursday, September 7. RT @elonmusk: Falcon 9 boost stage on droneship Just Read the Instructions https://t.co/fZTPmwsnOz More photos from today’s Falcon 9 launch → https://t.co/095WHWMtKp https://t.co/K3A1vmdPGb Successful deployment of FORMOSAT-5 to low-Earth orbit confirmed. https://t.co/PiB7r3Zk4F Falcon 9 first stage has landed on Just Read the Instructions. First stage entry burn complete. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/xIX3k65s4G T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z ~60 minutes until Falcon 9 launch of FORMOSAT-5. Launch webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and FORMOSAT-5 are vertical on SLC-4E at Vandenberg Air Force Base, California. Despite the fog, weather is 90% favorable. https://t.co/NyuuKuMHuB RT @elonmusk: First picture of SpaceX spacesuit. More in days to follow. Worth noting that this actually works… https://t.co/5ZtqkKiTQX Team at the rocket development facility in McGregor, Texas completed 1,000th Merlin engine test on this stand → https://t.co/Q9eXucvCql https://t.co/wT18KBvv4X Static fire test of Falcon 9 complete—targeting launch of FORMOSAT-5 from SLC-4E at Vandenberg AFB on August 24. https://t.co/jCyRzlIkkJ Dragon is now installed at the @Space_Station. Crew will open the hatch later today. https://t.co/LW36pMYWw9 Capture confirmed! Dragon is now attached to the @Space_Station robotic arm. Dragon is ~10 meters from @Space_Station. Capture sequence starting shortly → https://t.co/rdhLIxXhnI https://t.co/giZ0xzKqkE Dragon has been given a \"go\" to move towards capture position. Dragon is ~30 meters from the @Space_Station. Watch live → https://t.co/rdhLIxXhnI https://t.co/81iUavFg5h More photos of today’s Falcon 9 launch of Dragon to the @Space_Station, and first stage landing → https://t.co/095WHX44BX https://t.co/PLGrDyLpfp Quick video recap of Falcon 9 launch of Dragon for its twelfth @Space_Station resupply mission. https://t.co/BNx5mVBA4c https://t.co/m0R5y5V7sV Dragon is on its way to the International Space Station. Capture by @Space_Station crew set for Wednesday. Dragon confirmed in good orbit. https://t.co/gtC39uBC7z Falcon 9 first stage has landed at Land Zone 1. https://t.co/XqDji1sWZ6 Falcon 9 first stage entry burn underway. Second stage propelling Dragon into its orbit to meet up with the @Space_Station. https://t.co/gtC39uBC7z https://t.co/Mn7RjC6syw Main engine cutoff and stage separation confirmed. Liftoff! https://t.co/gtC39uBC7z https://t.co/wJBH2PUpHt T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z ~1 hour until Falcon 9 launch of Dragon for its twelfth resupply mission to the @Space_Station. Static fire test of Falcon 9 complete—targeting August 14 launch from Pad 39A for Dragon’s next resupply mission to the @Space_Station. Successful deployment of @Intelsat 35e to a Geostationary Transfer Orbit confirmed. https://t.co/f4ZzLNnQZF Final second stage engine cutoff nominal, preparing to deploy satellite. Back live for final burn and satellite deployment → https://t.co/gtC39uBC7z Webcast returns in about 15 minutes for second stage engine restart and satellite deployment. Second stage and satellite now in coast phase. Second stage engine has cutoff as planned. Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. https://t.co/YFuFFg5KJA Liftoff! https://t.co/gtC39uBC7z https://t.co/r6PEvk7KBn Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z Targeting launch of @Intelsat 35e today at 7:38 p.m. EDT, 23:38 UTC. Webcast goes live ~10 minutes before liftoff --&gt;https://t.co/tdni53IviI RT @elonmusk: @SpaceX We're going to spend the 4th doing a full review of rocket &amp; pad systems. Launch no earlier than 5th/6th. Only one ch… Standing down today due to a violation of abort criteria, vehicle/payload in good health, next launch opportunity tomorrow, July 4th! T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z ~60 minutes until Falcon 9 launch of @Intelsat 35e. Webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Pushing T-0 to 8:35 p.m. EDT, 00:35 UTC for weather. Vehicle and payload remain in good health in advance of the @INTELSAT 35e launch. New T-0 of 8:07 pm EDT, 00:07 UTC for weather. Vehicle and payload look good--all systems go for launch of @INTELSAT 35e. All systems go for launch of @Intelsat 35e. Targeting liftoff at 7:37 p.m. EDT, 23:37 UTC. Weather is 70% favorable. https://t.co/0fs1YkY4wA Great shot of Dragon departing the @Space_Station taken by @Astro2fish https://t.co/BFiObGPcxM Good splashdown of Dragon confirmed—completing first re-flight of a commercial spacecraft to and from the @Space_Station. Dragon's main parachutes have been deployed. Splashdown in ~2 minutes. Dragon's drogue chutes have been deployed nominally. Dragon's de-orbit burn is complete and trunk has been jettisoned. Pacific Ocean splashdown in ~30 minutes. Dragon will re-enter Earth's atmosphere in ~5 hours. Splashdown at 8:12 a.m. EDT, 12:12 UTC. The three departure burns to move Dragon away from the @Space_Station are complete. Dragon has been released from the @Space_Station! Three departure burns are now underway → https://t.co/rdhLIxXhnI Dragon departing the @Space_Station in ~5 minutes. Watch live → https://t.co/rdhLIxXhnI https://t.co/Y8I1W6MCY1 Next launch opportunity is on Monday, July 3 at 7:37 p.m. EDT, 23:37 UTC. Guidance abort issued just before liftoff; standing down for today. Vehicle and payload are healthy. T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z ~60 minutes until Falcon 9 launch of @Intelsat 35e. Webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and @Intelsat 35e vertical on Pad 39A. Weather is 40% favorable for tonight's launch window which opens at 7:36 p.m. EDT, 23:36 UTC https://t.co/nfVWjUIhAm After a month-long stay at the @Space_Station, Dragon returns to Earth on Monday https://t.co/sZE7NMAeWD Static fire test of Falcon 9 complete—targeting launch of Intelsat 35e from Pad 39A in Florida on Sunday, July 2. https://t.co/MYp5T154Gh More photos from today’s Falcon 9 launch → https://t.co/095WHX44BX https://t.co/Yjm12sEWH9 RT @elonmusk: Sped up version of today's rocket landing on the Droneship Just Read the Instructions (guess it… https://t.co/0wFgXMgeqZ Successful deployment of 10 @IridiumComm NEXT satellites to low-Earth orbit confirmed. Webcast back in a few minutes for deployment of 10 @IridiumComm NEXT satellites → https://t.co/gtC39uBC7z Back live for final second stage burn → https://t.co/gtC39uBC7z Webcast back in ~40 minutes for second stage engine restart and deployment of 10 @IridiumComm NEXT satellites. Second stage and 10 @IridiumComm NEXT satellites are now in coast phase. Second stage engine cutoff confirmed. Falcon 9 first stage has landed on Just Read the Instructions. https://t.co/uVvE3dgOBr Main engine cutoff and stage separation confirmed. Second stage engine burn underway. https://t.co/109XAIURGv Liftoff! https://t.co/gtC39uBC7z T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z RT @elonmusk: Launch at 1:25 delivering 10 satellites for Iridium. Droneship repositioned due to extreme weather. Will be tight. https://t.… ~60 minutes until Falcon 9 launch of Iridium-2. Webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Falcon 9 and 10 @IridiumComm NEXT satellites are vertical on SLC-4E at Vandenberg Air Force Base in California. https://t.co/YiDZrnQMvU More photos from today’s Falcon 9 launch → https://t.co/095WHX44BX https://t.co/9RVofNeug3 Successful deployment of BulgariaSat-1 to a Geostationary Transfer Orbit confirmed. Webcast back in ~5 minutes for satellite deployment. Final second stage engine cutoff nominal, preparing to deploy satellite. Back live for final burn and satellite deployment → https://t.co/gtC39uBC7z RT @elonmusk: Rocket is extra toasty and hit the deck hard (used almost all of the emergency crush core), but otherwise good Second stage and satellite now in coast phase. Webcast returns in ~10 minutes for second stage engine restart and satellite deployment. Falcon 9 first stage has landed on Of Course I Still Love You—second successful launch and landing of a flight-proven booster. Second stage engine has cutoff as planned. First stage entry burn underway. https://t.co/s1pk67cjBL Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/gtC39uBC7z https://t.co/Uxvypocf4H T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z RT @elonmusk: Falcon 9 will experience its highest ever reentry force and heat in today's launch. Good chance rocket booster doesn't make i… ~60 minutes until Falcon 9 launch of BulgariaSat-1. Webcast will go live about 15 minutes before liftoff → https://t.co/gtC39uBC7z Team is running additional ground system checks; Falcon 9 and payload are in good health. New liftoff time set for 3:10 p.m. EDT. Falcon 9 and BulgariaSat-1 vertical on Pad 39A. Today’s two-hour launch window opens at 2:10 p.m. EDT, 18:10 UTC. https://t.co/Dnkp3pgiLQ Static fire test of Falcon 9 at Vandenberg AFB complete—launch of 10 @IridiumComm NEXT satellites slated for Sunday, June 25. Stage 2 returns the favor. https://t.co/JgzphTp6AN Dragon photobombs stage 2 before heading to the @Space_Station earlier this month. https://t.co/1nSHg4rYVR Iridium targeted for 6/25—could be a weekend doubleheader Standing down on BulgariaSat-1 to replace a fairing valve, next launch opportunities are 6/23 and 6/24 Static fire test of Falcon 9 complete—targeting June 19 launch of BulgariaSat-1 from historic Pad 39A https://t.co/sndsLhKtwA Hours after CRS-11 lifted off, this flight-proven booster rolled into the hangar at 39A; targeting June 17 launch of BulgariaSat-1. https://t.co/ZcqRQeJPx6 4K video of Falcon 9 first stage landing after delivering Dragon to orbit for a @Space_Station resupply mission → https://t.co/Qp0SDhDrVG RT @NASA: With #Dragon cargo vehicle in grasp of the robotic arm, crew will maneuver it for installation. For updates, visit: https://t.co/… Capture confirmed! Dragon now attached to the @Space_Station robotic arm. https://t.co/uJj3rJt5Io RT @NASA: We are “go” for capture. Watch as @Space_Station’s robotic arm moves toward @SpaceX’s #Dragon cargo vehicle: https://t.co/mzKW5uD… Spacecraft now ~10m from @Space_Station. Dragon capture sequence starting shortly →  https://t.co/rdhLIxFGwa https://t.co/mJ2jQ5qZlg Dragon has been given a \"go\" to move inside 30m towards the capture point. Watch live → https://t.co/rdhLIxFGwa RT @Space_Station: .@SpaceX #Dragon within 250 meters of station. Cargo craft will hold at 30 meters away from station. https://t.co/qpyi2L… More photos of yesterday’s Falcon 9 launch of Dragon to the @Space_Station, and first stage landing → https://t.co/095WHWMtKp https://t.co/IW0uOPwtrz Dragon is on its way to the International Space Station. Capture by @Space_Station crew set for Monday. Dragon confirmed in good orbit. https://t.co/gtC39uBC7z Falcon 9 first stage has landed at LZ-1. https://t.co/qUANJo402a Second stage and Dragon continuing nominally. https://t.co/gtC39uBC7z Falcon 9 first stage entry burn underway. https://t.co/gtC39uBC7z https://t.co/wiUU1kIazp Second stage propelling Dragon into its orbit to meet up with the @Space_Station. First stage main engine cutoff and stage separation have occurred. https://t.co/gtC39uBC7z Liftoff! https://t.co/gtC39uTdw9 https://t.co/b6J1XXtXux T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z Weather is 60% favorable for today’s Falcon 9 launch of Dragon to the @Space_Station. Liftoff set for 5:07 p.m. EDT, 21:07 UTC. https://t.co/Z5HsHYAtJJ Standing down due to lightning. Backup launch opportunity on Saturday, June 3 at 5:07 p.m. EDT or 21:07 UTC. T-30 until Falcon 9 launch of Dragon for eleventh resupply mission to the @Space_Station; tracking two weather fronts near the spaceport. Falcon 9 and Dragon on Pad 39A at @NASAKennedy. Weather is 70% favorable for today’s 5:55 p.m. EDT, 21:55 UTC launch. https://t.co/lQKQHluPcE After completing a 9-day mission, Dragon became the first commercial spacecraft to return to Earth from the @Space_Station 5 years ago today https://t.co/GSrAd4ixUv RT @NASA: Today on #MemorialDay, we honor the brave men and women who made the ultimate sacrifice in service to our country. https://t.co/5… Static fire test of Falcon 9 complete—targeting June 1 launch from historic Pad 39A for Dragon’s next resupply mission to the @Space_Station https://t.co/LjG6JdVtCo Five years ago today, Dragon became the first commercial spacecraft to visit the @Space_Station. https://t.co/URtAPz48mN Static fire test of a Falcon Heavy side booster completed in McGregor, TX last week. This booster previously launched Thaicom 8. https://t.co/nWrNCXtu13 More photos from today's Falcon 9 launch → https://t.co/095WHWMtKp https://t.co/QlfWZ2mHRB Quick video recap of Falcon 9 launch of Inmarsat-5 Flight 4 https://t.co/W8eVUEsH6r Successful deployment of Inmarsat-5 Flight 4 to a Geostationary Transfer Orbit confirmed. Final second stage engine cutoff nominal, preparing to deploy satellite. Back live for final burn and satellite deployment → https://t.co/gtC39uBC7z Webcast returns in about 15 minutes for second stage engine restart and satellite deployment. Second stage engine has cutoff as planned. Second stage and satellite now in coast phase. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/gtC39uBC7z https://t.co/C5nAH1bnPB T-60 seconds until launch → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch is now live → https://t.co/gtC39uBC7z ~60 minutes until Falcon 9 launch of Inmarsat-5 Flight 4. All systems and weather are go. Watch live → https://t.co/gtC39uBC7z Falcon 9 and Inmarsat-5 Flight 4 vertical on Pad 39A. The 49-minute launch window opens at 7:21 p.m. EDT, or 23:21 UTC. https://t.co/BYylLU7TTE Static fire test of Falcon 9 complete—targeting launch of Inmarsat-5 Flight 4 from Pad 39A on Monday, May 15. https://t.co/D0iEXF42pI First static fire test of a Falcon Heavy center core completed at our McGregor, TX rocket development facility last week. https://t.co/tHUHc1QiKG More photos from today’s Falcon 9 launch and first stage landing → https://t.co/095WHWMtKp https://t.co/OOjAJLhhkg RT @NatReconOfc: Congratulations to the #NROL76 team, including @SpaceX and @45thSpaceWing on a successful launch! https://t.co/4BwyHiegsH RT @elonmusk: Close-up of rocket stage separation, fast flip, boostback burn in a ring of fire and then… https://t.co/RM8kDgazVX Split screen shot of Falcon 9 first stage as it returns to Earth and lands at Landing Zone 1. https://t.co/5hlwTOTGKa Falcon 9 first stage has landed at LZ-1 https://t.co/gtC39uBC7z https://t.co/766RxdZ99X First stage entry burn underway → https://t.co/gtC39uBC7z Main engine cutoff and stage separation confirmed. Liftoff! https://t.co/gtC39uBC7z T-30 seconds until launch → https://t.co/gtC39uBC7z https://t.co/i6Dy8zhwSD RT @elonmusk: Winds aloft are unusually high (still within structural safety bounds). Worrying, but not a showstopper. https://t.co/epHQQva… Webcast of Falcon 9 launch now live → https://t.co/gtC39uBC7z ~15 minutes until Falcon 9 launch of NROL-76. Watch live → https://t.co/gtC39uBC7z All systems go for launch of NROL-76. Currently tracking upper level winds. Targeting liftoff at 7:15 a.m. EDT, 11:15 UTC. https://t.co/GKQUTy5GC3 Standing down today due to a sensor issue; backup launch opportunity tomorrow morning. T-60 seconds until launch  → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch now live → https://t.co/gtC39uBC7z https://t.co/jrU3GTfUjS 1 hour until Falcon 9 launch of NROL-76. Updated launch window opens at 7:15 a.m. EDT, 11:15 UTC. Falcon 9 and NROL-76 vertical on Pad 39-A. Launch window opens tomorrow at 7:00 a.m. EDT, 11:00 UTC. https://t.co/9o3ZMbaev7 Static fire test complete. Targeting Falcon 9 launch of NROL-76 on Sunday, April 30. https://t.co/mk0dQGj17o View from the fairing during SES-10 mission. #EarthDay https://t.co/zPYQRQ3BkR Updated SES-10 launch and landing photos → https://t.co/095WHWMtKp https://t.co/cCD2eaOVvP More photos from today’s Falcon 9 launch and first stage landing → https://t.co/095WHX44BX https://t.co/c3UYhMrDec Successful deployment of SES-10 to geostationary transfer orbit confirmed. https://t.co/FkVoUYSsmq Final second stage engine cutoff nominal, preparing to deploy satellite. Back live for final burn and satellite deployment → https://t.co/gtC39uBC7z Webcast returns in about 10 minutes for second stage engine restart and satellite deployment. https://t.co/uLGxW3gVCW Second stage engine cutoff confirmed. Second stage and satellite now in coast phase. Falcon 9 first stage has landed on Of Course I Still Love You — world’s first reflight of an orbital class rocket. First stage entry burn complete. Second stage continuing nominally to geostationary transfer orbit. https://t.co/RXAzvT0xT0 Fairing has deployed. Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/gtC39uBC7z T-60 seconds until launch  → https://t.co/gtC39uBC7z https://t.co/jv3372rCUf Webcast of Falcon 9 launch now live → https://t.co/gtC39uBC7z ~60 minutes until launch window for SES-10 opens. All systems and weather are go. Watch here → https://t.co/gtC39uBC7z https://t.co/KNUujBCDa7 Falcon 9 and SES-10 vertical on Kennedy Space Center’s historic Pad 39A. Launch window opens at 6:27pm EDT, 10:27pm UTC. https://t.co/0jdC29Uqxa Static fire test complete. Targeting Thursday, March 30 for Falcon 9 launch of SES-10. https://t.co/0tZ7u6gngI Dragon is headed to port for a cargo handover to @NASA. https://t.co/C3Pix9DGAg https://t.co/wPdFTlsNsP Recovery teams en route to Dragon. https://t.co/5aiGcX0vS2 Good splashdown of Dragon confirmed, carrying @NASA science and research cargo back from the @Space_Station. Dragon's three main parachutes have been deployed. Splashdown in ~5 minutes. Dragon's drogue chutes have been deployed nominally. Dragon's deorbit burn is complete and trunk has been jettisoned. Pacific Ocean splashdown with critical @NASA cargo in ~30 minutes. Dragon will re-enter Earth's atmosphere in ~5 hours. Splashdown at 07:52am PDT, 2:52pm UTC. https://t.co/ZeC9gmY2tA The three departure burns to move Dragon away from the @Space_Station are complete. RT @NASA: .@SpaceX's Dragon capsule departs @Space_Station. Watch live: https://t.co/KX5g7zfYQe https://t.co/oltw3XvKh2 Dragon has been released from the @Space_Station! Three departure burns are now underway. Watch live → https://t.co/rdhLIxXhnI https://t.co/ybRhaENH4z RT @Space_Station: LIVE: @SpaceX Dragon departs space station at 5:11 a.m. ET. Watch on @NASA TV: https://t.co/jkArpVoIQq https://t.co/Ta3O… After a month at the @Space_Station, Dragon is scheduled to return tomorrow with over 5,400 pounds of cargo. https://t.co/rdhLIxFGwa https://t.co/M4DynKK4pi More photos from today's Falcon 9 launch → https://t.co/095WHWMtKp https://t.co/O2RkVlZnak Successful deployment of @EchoStar XXIII to a Geosynchronous Transfer Orbit confirmed. https://t.co/LpPWLo8YMN Final second stage engine cutoff nominal, preparing to deploy satellite. Back live for final burn and satellite deployment → https://t.co/gtC39uBC7z https://t.co/8FtMsb9ITp Webcast returns in about 15 minutes for second stage engine restart and satellite deployment. Second stage engine has cutoff as planned. Second stage and satellite now in coast phase. https://t.co/Rzr0XljsFd Main engine cutoff and stage separation confirmed. Second stage engine burn underway. Liftoff! https://t.co/gtC39uBC7z https://t.co/serafPcpy2 T-60 seconds until launch  → https://t.co/gtC39uBC7z Webcast of Falcon 9 launch now live → https://t.co/gtC39uBC7z https://t.co/Di6LjxOVkL All systems go for Falcon 9 launch of @EchoStar XXIII. Liftoff now set for 2:00am EDT, 6:00am UTC. Watch here → https://t.co/gtC39uBC7z https://t.co/lLKF5HEhZB Weather remains 90% go for Falcon 9 launch of @EchoStar XXIII. Launch window opens tomorrow morning at 1:35 am EDT. https://t.co/CxwPg6doP2 Targeting Thursday, March 16 for @EchoStar XXIII launch; window opens at 1:35am EDT and weather is 90% favorable. Standing down due to high winds; working toward next available launch opportunity. ~60 minutes until 1:34am EDT launch window for @EchoStar XXIII opens. Continuing to watch winds. Falcon 9 on Pad 39A. Launch window for @EchoStar XXIII opens early tomorrow morning at 1:34am EDT. https://t.co/IDMyS0IqpQ Static fire of Falcon 9 just completed. Targeting EchoStar XXIII launch from @NASA's Kennedy Space Center on Mar. 14, early morning EDT. https://t.co/g8moLfwfnP RT @elonmusk: Fly me to the moon ... Ok\nhttps://t.co/6QT8m5SHwn RT @elonmusk: SpaceX announcement tomorrow at 1pm PST RT @NASA: Installation confirmed! @SpaceX’s #Dragon cargo vehicle was officially attached to @Space_Station at 8:12am ET. Info https://t.co… Capture confirmed! Dragon now attached to the @Space_Station robotic arm https://t.co/07axPcBm20 Spacecraft moving closer to @Space_Station. Dragon go for capture sequence → https://t.co/XbCVPGwLuR https://t.co/TUxzjAkCqy Dragon has been given a \"go\" to move inside 30m towards the capture point https://t.co/VckbcD2YcY Dragon is ~.7 miles from the @Space_Station. Watch live → https://t.co/XbCVPGwLuR RT @NASA: Set your alarm! @SpaceX’s #Dragon cargo vehicle will rendezvous w/ @Space_Station at 6am ET. Coverage starts at 4am: https://t.co… Dragon is in good health and will make another rendezvous attempt with the @Space_Station Thursday morning. RT @NASA: The @SpaceX #Dragon spacecraft has waved off today’s planned rendezvous and docking with @Space_Station: https://t.co/mzKW5uV4hS… More photos from today’s Falcon 9 launch and first stage landing → https://t.co/095WHWMtKp https://t.co/FC1rtAVFul Falcon 9 first stage landing at LZ-1 as seen from a drone camera → https://t.co/cqy8rQYahQ RT @elonmusk: https://t.co/6Ve3YJoStm Dragon is on its way to the International Space Station. Capture by @Space_Station crew set for early Wednesday morning. RT @NASA: Right on schedule, solar arrays have been deployed on @SpaceX #Dragon cargo spacecraft. Watch: https://t.co/mzKW5uDsTi https://t.… Dragon confirmed in good orbit https://t.co/gtC39uBC7z https://t.co/DMP9HSAagx Falcon 9 first stage has landed at LZ-1 Falcon 9 first stage entry burn underway https://t.co/gtC39uBC7z https://t.co/xAN5zPFfLp Second stage and Dragon continuing nominally https://t.co/gtC39uBC7z First stage main engine cutoff and stage separation have occurred https://t.co/gtC39uBC7z Liftoff! https://t.co/gtC39uBC7z 60 seconds until launch → https://t.co/gtC39uBC7z https://t.co/3WtG7uhM8r 8 minutes and counting → https://t.co/gtC39uBC7z https://t.co/6Bw5F45tWY ~20 minutes from launch. Watch the webcast here → https://t.co/gtC39uBC7z https://t.co/dKOf61mjkN All systems go for today’s 9:39am ET launch of Dragon to @Space_Station. Weather 70% favorable; tracking cumulus cloud cover https://t.co/dvgbdMVHUE RT @elonmusk: Btw, 99% likely to be fine (closed loop TVC wd overcome error), but that 1% chance isn't worth rolling the dice. Better to wa… RT @elonmusk: If this is the only issue, flight would be fine, but need to make sure that it isn't symptomatic of a more significant upstre… Standing down to take a closer look at positioning of the second stage engine nozzle. 9:38am ET tomorrow is next earliest launch opportunity About 18 miuntes from launch. Webcast of Falcon 9 launch now live → https://t.co/gtC39uBC7z https://t.co/zQmNtQaeop 1 hour from launch of Falcon 9 &amp; Dragon to @Space_Station. Rocket &amp; weather are go. Launch at 10:01am ET, 15:01 UTC https://t.co/9U3kiikA2H RT @NASA: Hear from experts at 5pm ET about the status of tomorrow's 10:01am ET @SpaceX cargo launch to @Space_Station: https://t.co/oJKHgK… Falcon 9 and Dragon at historic launch pad 39A. Liftoff slated for Saturday at 10:01am ET. https://t.co/fkAhMbZig5 RT @NASA: .@SpaceX launch Saturday will be 1st from Pad 39A since shuttle &amp; will deliver 5,500 lbs of cargo to @Space_Station: https://t.co… First static fire test of Falcon 9 at historic launch complex 39A completed in advance of Dragon's upcoming mission to the @Space_Station. RT @elonmusk: Falcon 9 rocket now vertical at Cape Canaveral on launch complex 39-A. This is the same launch… https://t.co/wY6dWRcer3 Targeting Feb. 18 for Dragon's next resupply mission to the @Space_Station — our 1st launch from LC-39A at @NASA's Kennedy Space Center. RT @elonmusk: Regarding the meeting at the White House: https://t.co/8b1XH4oW6h Prepping to fly again — recovered CRS-8 first stage completed a static fire test at our McGregor, TX rocket development facility last week. https://t.co/QEtKVJ1Jhc RT @NASA: Today, #NASARemembers all those who gave their lives to further the cause of exploration and discovery: https://t.co/MJDI2HWMzz h… RT @elonmusk: Many people negatively affected by this policy are strong supporters of the US. They've done right,not wrong &amp; don't deserve… RT @elonmusk: The blanket entry ban on citizens from certain primarily Muslim countries is not the best way to address the country’s challe… Competition coverage begins at approx. 1:55pm PT tomorrow, 1/29, at https://t.co/jsVu6Hng4y; schedule is fluid, stay tuned for updates https://t.co/mLer6pgDmI RT @NASA: #NASARemembers the Apollo 1 crew on the tragedy’s 50th anniversary. They gave their lives in pursuit of exploration: https://t.co… Updated launch and landing photos → https://t.co/vn4S8bV3x3 https://t.co/GRpm77LxKw Successful deployment of 10 @IridiumComm NEXT satellites has been confirmed. Brief second stage re-start complete. Deployment of 10 @IridiumComm satellites to begin in a few minutes https://t.co/tdni53IviI Webcast back in about 45 minutes for second stage re-start &amp; deployment of 10 @IridiumComm communication satellites https://t.co/tdni53IviI https://t.co/ihek2Wz8Jn Second stage shutdown confirmed. 10 @IridiumComm NEXT satellites in nominal parking orbit. https://t.co/tdni53IviI First stage has landed on Just Read the Instructions https://t.co/W0EoLaO4YR First stage entry burn completed. Second stage continuing nominally into low-Earth orbit First stage boostback burn underway Second stage continuing nominally Main engine cutoff and stage separation confirmed https://t.co/tdni53IviI Liftoff! https://t.co/tdni53IviI https://t.co/OQP4JVHsqr Launch Director verifies go for launch. T-30 seconds and counting https://t.co/tdni53IviI Webcast of Falcon 9 launch now live → https://t.co/tdni53IviI https://t.co/nAMDRBsSoK Less than 1 hour until Falcon 9 launch of 10 @IridiumComm NEXT satellites. Instant launch window opens at 9:54am PST https://t.co/tdni53IviI https://t.co/dJDQsrTe1H Tracking ground wind for tomorrow's launch attempt of 10 @IridiumComm NEXT satellites. Weather overall 60% favorable https://t.co/tdni53IviI https://t.co/I9Vx26iRKW Launch moving due to high winds and rains at Vandenberg. Other range conflicts this week results in next available launch date being Jan 14. RT @IridiumComm: High winds and rain in forecast at VAFB. First launch of #IridiumNEXT now planned for January 14th at 9:54:34 am PST. #NEX… RT @IridiumComm: Iridium is excited to share we're planned to launch on Monday, Jan 9 at 10:22am PST weather permitting. https://t.co/wiHgv… RT @elonmusk: Hold-down firing of @SpaceX Falcon 9 at Vandenberg Air Force completed. All systems are go for launch next week. Targeting return to flight from Vandenberg with the @IridiumComm NEXT launch on January 8. Update: https://t.co/15yMaiobpX RT @IridiumComm: Milestone Alert: The first ten #IridiumNEXT satellites are stacked and encapsulated in the Falcon 9 fairing. #NEXTevolutio… RT @IridiumComm: Satellites have been fueled, pressurized &amp; dispenser tiers are being stacked as we move closer to first launch #IridiumNEX… One year ago today, the first-ever landing of an orbital-class rocket https://t.co/vDZ5xWtKK5 RT @SpaceXJobs: Our brilliant interns are helping make the @SpaceX mission a reality. Learn more here: https://t.co/XiDvNzrRiG https://t.co… RT @NASA: We are saddened by the loss of Sen. John Glenn, the first American to orbit Earth. A true American hero. Godspeed, John Glenn. Ad… RT @SpaceXJobs: Thanks to our employees, @SpaceX is proud to be a @Glassdoor Best Place to Work in 2017! #BPTW https://t.co/NZyVkOmhZ7 http… Update on our anomaly and return to flight path forward https://t.co/15yMaiFMOx We appreciate @NASA’s support and confidence https://t.co/9VPyICP8YV https://t.co/SP9FuvGIPe Successfully tested the prototype Mars tank last week. Hit both of our pressure targets – next up will be full cryo testing. https://t.co/GGTlgUQCRY Saluting those who have served and continue to serve our country -- thank you for your dedication and sacrifice! https://t.co/0AVbDTVyVX RT @Hyperloop: This week student Hyperloop teams visited @SpaceX for vacuum/track tests. See you at Competition Weekend, Jan 27-29! https:/… Presentation and archived video available at https://t.co/SwNQJ9Z4td https://t.co/KTZ8ryen0E Interplanetary Transport System is not just for Mars https://t.co/X2uV5moBya First test of the Raptor Interplanetary Transport Engine https://t.co/478Z4v86gD First development tank for Mars ship https://t.co/dF5tZkldUb Raptor has 3x thrust of Merlin but same size because of 3x greater pressure https://t.co/NJpORrTLAQ We'll start a cadence of sending Dragons to Mars in two years. Will be like a train leaving the station https://t.co/Jpjwn3hWax Thanks to @NASA for putting their faith in us https://t.co/kCtBLPbSg8 Funding:\nSteal Underpants ✓\nLaunch Satellites ✓\nSend Cargo and Astronauts to ISS ✓\nKickstarter ✓\nProfit ✓\nhttps://t.co/kCtBLPbSg8 Goal is 100 people on each trip, eventually more https://t.co/kCtBLPbSg8 https://t.co/wbXJ6AeWyl Interplanetary Spaceship arriving at Mars https://t.co/kCtBLOUhoA https://t.co/kW74GqE9gT Tanker refueling Mars vehicle in Earth orbit https://t.co/kCtBLPbSg8 https://t.co/nGSPIWYhnK Future Mars mission departing from historic Pad 39A at Kennedy Space Center https://t.co/kCtBLPbSg8 https://t.co/Zvk4BNybee Reusability is key to building a city on Mars. Build a propellant farm on Mars and send the ships back \"We aim to improve the cost per ton to Mars by 5 million percent.\" https://t.co/kCtBLPbSg8 \"You can't create a self-sustaining civilization on Mars if the ticket price is $10 billion per person.\" https://t.co/kCtBLPbSg8 \"That's what we want.\" https://t.co/kCtBLPbSg8 https://t.co/aq7KK0J7O2 Live now https://t.co/sLs2pIUtaG RT @elonmusk: Waiting for everyone to reach their seats and get settled. Starting in 5 to 10. Presentation beginning shortly at https://t.co/SwNQJ9Ht4D https://t.co/nc5pXQ3xq8 Presenting the SpaceX Interplanetary Transport System. Learn more at 1:30pm CT https://t.co/SwNQJ9Ht4D https://t.co/xkGpQIBCMG Tomorrow: Elon Musk will speak at @IAC2016 on making life multiplanetary. Tune in at 1:30 CT on https://t.co/SwNQJ9Ht4D https://t.co/m05qggxkng RT @elonmusk: SpaceX propulsion just achieved first firing of the Raptor interplanetary transport engine https://t.co/vRleyJvBkx RT @Hyperloop: One more week to apply to our second student Hyperloop competition https://t.co/ZQHjHtkuAj https://t.co/iKI7GXut8K If you have audio, photos or videos of our anomaly last week, please send to report@spacex.com. Material may be useful for investigation RT @elonmusk: Support &amp; advice from @NASA, @FAA, @AFPAA &amp; others much appreciated. Please email any recordings of the event to report@space… Latest update on yesterday's anomaly https://t.co/15yMaiobpX Thanks to @45thSpaceWing, @NASAKennedy and others for helping us respond to today's anomaly. Very grateful for your efforts. Update on this morning's anomaly https://t.co/1ogCMPCY44 RT @elonmusk: Loss of Falcon vehicle today during propellant fill operation. Originated around upper stage oxygen tank. Cause still unknown… Statement on this morning's anomaly https://t.co/3Xm2bRMS7T First launch of flight-proven first stage will use CRS-8 booster that delivered Dragon to @Space_Station in April https://t.co/UsqWeNBEK2 RT @elonmusk: Thanks for the longstanding faith in SpaceX. We very much look forward to doing this milestone flight with you. https://t.co/… Recovery teams en route to Dragon, pic taken from about 10 miles out https://t.co/B4ofhGZptD Good splashdown of Dragon confirmed, carrying thousands of pounds of @NASA science and research cargo back from the @Space_Station. Dragon's 3 main parachutes have been deployed. Splashdown in about 5 minutes. Dragon's drogue chutes have been deployed nominally. Dragon's de-orbit burn is complete and trunk has been jettisoned. Pacific Ocean splashdown with critical @NASA science in apprx 35 minutes. RT @Space_Station: The @SpaceX #Dragon was released at 6:11am ET (10:11am GMT) over Australia. https://t.co/X11yhOCTza https://t.co/seNTy8i… The 3 departure burns to move Dragon away from @Space_Station are complete, will enter Earth's atmosphere in ~5 hours. Splashdown 8:47am PDT RT @NASA: .@SpaceX #Dragon released from @Space_Station at 6:11am ET. Capsule is set to splashdown in Pacific at ~11:47am ET. https://t.co/… Dragon has been released from the @Space_Station! Three departure burns are now underway: https://t.co/XbCVPGwLuR https://t.co/hfw5oeazHf RT @NASA: At 5:45am ET: Live coverage of @SpaceX #Dragon release from @Space_Station. Watch: https://t.co/KX5g7yYnYG https://t.co/JvUfAYhRnn After a month stay @Space_Station, Dragon returns tomorrow w/ 3,000 pounds of @NASA science https://t.co/h2C3T0Twlv https://t.co/cIaoJeXZFr Pale Red Dot. The discovery of Proxima b is an exciting moment in the quest to make life multiplanetary https://t.co/utt9xKpzFW Docking port extracted from Dragon's trunk and ready for @NASA astronauts to install to @Space_Station tomorrow https://t.co/nep5Ira6Cc Dragon scheduled to return to Earth on Aug 26. Docking port it brought to @space_station will be installed Friday https://t.co/fmt1Yon3T0 More pics of tonight’s Falcon 9 launch of JCSAT-16 and first-stage landing → https://t.co/vn4S8bV3x3 https://t.co/nUmPMLTMmz JCSAT-16 comms sat deployed into planned Geostationary Transfer Orbit with 36,000 km apogee (high point in orbit) https://t.co/zScDgaOSzY Coast phase complete and final burn underway to place JCSAT-16 into a Geostationary Transfer Orbit.\nWebcast live → https://t.co/tdni53IviI Webcast back in about 15 minutes for final burn to place JCSAT-16 into a Geostationary Transfer Orbit https://t.co/tdni53IviI First stage landing confirmed on the droneship. Second stage &amp; JCSAT-16 continuing to orbit https://t.co/tdni5406Hi https://t.co/h6llIXSVu7 Falcon 9 first stage has landed on Of Course I Still Love You First stage is transonic Falcon 9 first stage entry burn underway. Second stage and JCSAT-16 continuing nominally into orbit https://t.co/fnFAAtuvpm Fairing separation confirmed. Watch live https://t.co/tdni53IviI First stage main engine cutoff and stage separation have occurred. Second stage engine burn underway https://t.co/OpAehX5ox2 Liftoff! https://t.co/tdni53IviI 60 seconds until launch. Watch here → https://t.co/tdni53IviI https://t.co/f0oJXPdEeH Launch in about 15 minutes. Watch here → https://t.co/tdni53IviI https://t.co/7b6BvsENv1 One hour from Falcon 9 launch of JCSAT-16. Weather now 90% go.\nLaunch window opens 1:26am ET https://t.co/tdni53IviI https://t.co/0tWeIvIXac Targeting launch of JCSAT-16 communications sat at 1:26am EDT Sunday. Weather remains 80% go https://t.co/tdni5406Hi https://t.co/0i1rAx4EjK RT @sslmda: We’re looking forward to the launch of JCSAT-16, which is scheduled for tonight! Go JCSAT-16! Go Falcon 9! @SpaceX https://t.co… Weather 90% go for Falcon 9 launch of the JCSAT-16 communications satellite. Launch window opens Sunday, 1:26am EDT https://t.co/CnYVyI2Zm1 High-speed footage of past launches and reentries https://t.co/Z6cOP8QqGq https://t.co/WPkxVaeRFP Dragon at dawn https://t.co/hqRTzQ4ngD RT @NASA: We ordered second @SpaceX mission to send U.S. astronauts to @Space_Station: https://t.co/r758StAcOd #LaunchAmerica https://t.co/… SpaceX rocket development facility in McGregor, Texas. Every engine for every rocket is tested here before flight. https://t.co/h7rV4Y1LQn Falcon 9 first stage from May mission was test fired in McGregor, TX today. 1st full duration test of landed booster https://t.co/Zy4WRqW2kw RT @sslmda: JCSAT-16 is our second satellite for SKY Perfect JSAT that will launch via @SpaceX this year! https://t.co/9dOFJ2jlNx Dragon now installed at @Space_Station. Crew will open hatch this Thursday https://t.co/MQT65SSGJI RT @NASA: .@SpaceX #Dragon now berthed to the @Space_Station as of 10:03am ET. Hatches to be opened on Thursday. https://t.co/qUNmJxTq12 RT @NASA: .@Space_Station controllers ready to latch @SpaceX #Dragon to the station. Watch: https://t.co/KX5g7zfYQe https://t.co/YnUJZcLvBh RT @NASA: .@SpaceX #Dragon moving in for installation on Harmony module of the @Space_Station. Watch: https://t.co/HHWla90Ahq https://t.co/… RT @NASA: .@Space_Station crew captures @SpaceX #Dragon at 6:56am ET using robotic arm. Watch live: https://t.co/KX5g7zfYQe https://t.co/8X… Capture confirmed! https://t.co/YWK7LWxHMd Orbital sunrise approaching. Dragon and @Space_Station passing over New York City https://t.co/XbCVPGwLuR https://t.co/DNEh46OjKp Spacecraft now 10m from @Space_Station. Dragon capture sequence coming up -- https://t.co/XbCVPGwLuR https://t.co/MDVj1jzleL Dragon has been given a \"go\" to move towards capture position https://t.co/FGPe7FIiDq RT @NASA: What’s onboard @SpaceX #Dragon? Nearly 5,000lbs of cargo, including a DNA sequencer &amp; more: https://t.co/rJBUSXkQuP https://t.co/… Dragon holding at 30m mark. Awaiting go/no-go to approach @Space_Station for capture. Watch: https://t.co/XbCVPGwLuR https://t.co/Q8Ur5GWPmM Dragon is about 75m from @Space_Station. Watch live → https://t.co/XbCVPGwLuR https://t.co/nAs9Zrdg6f RT @NASA: LIVE NOW: @Space_Station crew set to capture @SpaceX #Dragon. Watch live coverage: https://t.co/KX5g7zfYQe https://t.co/7T4y5CaI6r RT @NASA: .@Space_Station crew preps for #Dragon capture tomorrow. Coverage starts at 5:30am ET: https://t.co/Qu2b57YyxO https://t.co/9wDbE… Touchdown https://t.co/3lc9DbYmcS More pics of last night's Falcon 9 &amp; Dragon launch to @Space_Station &amp; first-stage landing → https://t.co/vn4S8bV3x3 https://t.co/7lYAgFR9JZ RT @elonmusk: Out on LZ-1. We just completed the post-landing inspection and all systems look good. Ready to fly again. https://t.co/1OfA8h… RT @NASA: LIVE NOW: Get the latest on the @SpaceX #Dragon in a post-launch news conference. Watch: https://t.co/KX5g7zfYQe https://t.co/1mV… RT @NASA: At 2am ET: Get the latest on the @SpaceX #Dragon in a post-launch news conference. Watch: https://t.co/KX5g7yYnYG https://t.co/oX… Dragon on its way to @Space_Station, Falcon on its way home https://t.co/EpfUKBmoWi RT @NASA: .@SpaceX #Dragon has separated from booster, continuing journey to deliver research and supplies to @Space_Station https://t.co/Q… Dragon solar arrays have deployed Dragon confirmed in good orbit https://t.co/tdni53IviI https://t.co/jLCTcgBMtB First stage landing confirmed at LZ-1. Second stage and Dragon continuing to orbit https://t.co/tdni53IviI https://t.co/6u7BCidoth Falcon 9 first stage has landed at LZ-1 Falcon 9 first stage entry burn underway. Second stage and Dragon continuing nominally First stage boostback burn underway First stage main engine cutoff and stage separation have occurred. Second stage engine burn underway Liftoff! https://t.co/tdni53IviI https://t.co/xZunmXW61q 60 seconds until launch → https://t.co/tdni53IviI https://t.co/HnOiikAM5C About 15 minutes from launch. Watch here → https://t.co/tdni53IviI https://t.co/tTg3MekyXq RT @NASA: Launch controllers are GO and have begun loading propellant to the @SpaceX rocket. Watch: https://t.co/KX5g7zfYQe https://t.co/RX… 1 hour from launch of Falcon 9 &amp; Dragon to @Space_Station. Rocket &amp; weather are go. Launch at 12:45am ET, 4:45am UTC https://t.co/kB2QDsWr1q RT @NASA: What @ISS_Research is launching on @SpaceX #Dragon to @Space_Station? See what's on board: https://t.co/pT2pu97iJp https://t.co/y… RT @NASA: At 3pm ET: Hear about 'What's On Board' @SpaceX #Dragon launching tonight. Watch &amp; learn: https://t.co/KX5g7yYnYG https://t.co/ZR… All systems go &amp; weather 90% favorable for launch of Dragon to @Space_Station. Liftoff slated for Monday, 12:45am ET https://t.co/aPQq6qKfhO RT @Astro_Ellen: Thanks @SpaceX for a great tour!  Looking forward to Sunday night's launch  @Space_Station #LaunchAmerica https://t.co/aqJ… Launch of Dragon to @Space_Station w/5000 lbs of cargo, including @Commercial_Crew docking adapter, Monday 1245am ET https://t.co/EuXIUdvngl RT @NASA: LIVE NOW: Find out what experiments are headed to @Space_Station on the next @SpaceX launch: https://t.co/4E487vfn5N https://t.co… Not bad, little off-center ;) https://t.co/45FnLBrQXN Backbone of Crew Dragon, the crew-carrying version of Dragon 2 spacecraft, undergoing structural load testing https://t.co/FRgeWJVJ7z RT @elonmusk: Looks like early liquid oxygen depletion caused engine shutdown just above the deck https://t.co/Sa6uCkpknY Second of two satellites being deployed into proper orbit with today's launch https://t.co/XcHFBPEyfk RT @elonmusk: Looks like thrust was low on 1 of 3 landing engines. High g landings v sensitive to all engines operating at max. RT @elonmusk: Ascent phase &amp; satellites look good, but booster rocket had a RUD on droneship ABS satellite has been deployed into a nominal orbit .@Eutelsat_SA satellite has been deployed into a nominal orbit Second stage burn and dual satellite deployments up next https://t.co/tdni53IviI https://t.co/YakQ76GrTo Second stage and satellites now in nominal coast phase. Webcast back in about 15 minutes for deployment https://t.co/tdni53IviI Second stage engine cutoff confirmed Falcon 9 first stage entry burn has shut down Falcon 9 first stage entry burn has started Stage one and stage two power and telemetry remains nominal Fairing separation confirmed First stage main engine cutoff &amp; stage separation confirmed. Second stage engine burn underway https://t.co/tdni53IviI Liftoff! https://t.co/tdni53IviI https://t.co/mdXkLErJPN Launch in one minute. Watch live → https://t.co/tdni53IviI https://t.co/MbIEwkK8LD 20 minutes from launch. Webcast live → https://t.co/tdni53IviI https://t.co/zbezjASj0D Launch in about one hour.\nWebcast and more info ⟶ https://t.co/tdni53IviI https://t.co/CaD7TxhSyW Targeting launch tomorrow of @Eutelsat_SA &amp; ABS communication satellites. 45-min window opens 10:29am ET, 2:29pm UTC https://t.co/xyzGmSnvKY Next launch targeting June 15 for launch of the @Eutelsat_SA 117 West B and ABS-2A satellites. Launch window opens 10:29 am ET, 2:29 pm UTC Fantastic four https://t.co/jOhwMGHyOl Next launch targeting June 14 from Cape Canaveral – 45 minute launch window opens at 10:32am ET, 2:32pm UTC https://t.co/o8m9bIbfF8 @elakdawalla yep https://t.co/BhL1QpycWU It's a bird, it's a plane... https://t.co/hdpkXTvLm3 Falcon's landing leg crush core absorbs energy from impact on touchdown. Here's what it looked like on Apollo lander https://t.co/PqS7bn86A3 Rocket back at port after careful ocean transit. Leaning back due to crush core being used up in landing legs https://t.co/Pc0hSaUpVy RT @NASA: Today we remember &amp; honor the brave men &amp; women who made the ultimate sacrifice for our country. #MemorialDay2016 https://t.co/UA… RT @DeptofDefense: Today, we honor the heroes who served and gave it all. #HonorThem #GratefulNation #MemorialDay  https://t.co/cyFdN8Wpwq RT @NASA: Recap: @BigelowSpace's #BEAM expansion &amp; pressurization complete on @Space_Station. More: https://t.co/FRrjhIw77o https://t.co/dH… Yesterday, our next rocket moved into the launch site at Cape Canaveral, FL https://t.co/8YyAoYYwhi RT @elonmusk: Fast replay of today's rocket landing on SpaceX droneship OCISLY\nhttps://t.co/I0QQ2D3BtE More launch photos from today → https://t.co/vn4S8bV3x3 https://t.co/6WmCjjHltd THAICOM 8 spacecraft has been deployed into a nominal supersynch transfer orbit https://t.co/u6W7s3MqxB Final second stage cutoff nominal, preparing to deploy THAICOM 8 https://t.co/tdni53IviI Back live for final burn and satellite deploy into supersynchronous transfer orbit https://t.co/tdni53IviI THAICOM 8 satellite in nominal coast phase. Webcast back in about 15 minutes for deployment https://t.co/tdni53IviI https://t.co/Cg0rFH702D Falcon 9 second stage and THAICOM 8 spacecraft in nominal orbit and coast. First stage has landed on the droneship https://t.co/NH52PHhpyE Second stage engine cutoff number one has occurred nominally https://t.co/tdni53IviI Falcon 9 first stage has landed https://t.co/5jbz9OdBsd Falcon 9 first stage landing burn has started Second stage burn continues looking good https://t.co/tdni53IviI https://t.co/jtmkYphzpA First stage entry burn has shut down https://t.co/y25dqqMkDx Falcon 9 first stage entry burn has started Stage one and stage two power and telemetry remains nominal Fairing separation confirmed 1st stage main engine cutoff and stage separation confirmed. 2nd stage engine burn underway https://t.co/tdni53IviI Liftoff! https://t.co/tdni53IviI https://t.co/NcDhOjmv1n 30 seconds from launch. Watch live → https://t.co/tdni53IviI About 20 minutes from launch window opening. \nWebcast now live → https://t.co/tdni53IviI https://t.co/7xnzmOpJOx Rocket now being fueled and Launch Director confirms go for launch. \n35 minutes and counting https://t.co/tdni53IviI https://t.co/G8tH7itfRo Weather trending at 60% favorable for today's launch window.\n2-hour window opens at 5:39pm ET, 9:39pm UTC https://t.co/zKM23yoFgL RT @elonmusk: @SpaceX There was a tiny glitch in the motion of an upper stage engine actuator. Probably not a flight risk, but still worth… Out of an abundance of caution, launch postponed until no earlier than tomorrow for addtl data review - Falcon 9 &amp; spacecraft remain healthy Launch team finalizing review of vehicle data and check outs. Will move T-0 into the 2 hour window https://t.co/Rd1qb2qZmb Weather 90% go for 5:40pm ET launch today. Droneship landing challenging -- very hot and fast first-stage reentry https://t.co/IU66G2SntU Tracking towards tomorrow's launch of communications satellite for Thaicom. Window opens at 5:40pm ET, 9:40pm UTC https://t.co/IVy1ttSgvn Static fire complete in advance of Thursday's launch https://t.co/3h4QqAsZDF Photographer unexpectedly captures Falcon 9 second stage burn and first stage entry https://t.co/IKvmVon7gF @zgreth https://t.co/W12NlSG0yL RT @elonmusk: Most recent rocket took max damage, due to v high entry velocity. Will be our life leader for ground tests to confirm others… RT @elonmusk: Three's company https://t.co/nRfFmTpzZw Moving recently landed rocket to our hangar at Kennedy Space Center https://t.co/x8HijZ5hID RT @StationCDRKelly: Thanks @SpaceX for getting our science safely back to Earth! Very important research.  https://t.co/lwkGkS5TRg Dragon recovery team on site after nominal splashdown in Pacific. https://t.co/824c3YpaYG Good splashdown of Dragon confirmed, carrying thousands of pounds of @NASA science and research cargo back from the @Space_Station. Dragon's 3 main parachutes have been deployed. Splashdown in about 5 minutes. Dragon's drogue chutes have been deployed. Dragon's deorbit burn complete and trunk has been jettisoned. Targeting Pacific splashdown with critical @NASA science in about 35 minutes. Dragon's carrying back to Earth thousands of pounds of science and research cargo for @NASA. https://t.co/XbCVPGwLuR https://t.co/3fjTSYSlOv Dragon has been released from the @Space_Station! Next up is 1 of 3 departure burns. Live: https://t.co/XbCVPGwLuR https://t.co/Mp2wgzAZgA RT @NASA: LIVE NOW: @SpaceX Dragon set to depart from @Space_Station at 9:18am ET. Watch live: https://t.co/KX5g7yYnYG https://t.co/U997yke… RT @Space_Station: Watch @NASA TV at 9am ET/1pm UTC to see @CSA_ASC #Canadarm2 release #Dragon at 9:18am. https://t.co/RSRfoYlpdC https://t… RT @NASA: .@SpaceX Dragon preps to depart from @Space_Station. Coverage starts tomorrow at 9am ET: https://t.co/aVFopAzE8N https://t.co/5F8… Three different angles of last week's landing. Hottest and fastest landing yet https://t.co/0qRyAdLgEN First landed booster from a GTO-class mission (final spacecraft altitude will be about 36,000 km) https://t.co/31BhSZMJwm RT @elonmusk: Launch trajectory of Japanese commercial satellite JCSat-14, enroute to 36,000 km above Earth https://t.co/QHiiMdMMJ3 Launch photos here → https://t.co/vn4S8bV3x3 https://t.co/qPtXMlVNkt RT @elonmusk: Yeah, this was a three engine landing burn, so triple deceleration of last flight. That's important to minimize gravity losse… The Falcon 9 second stage delivered JCSAT-14 to a Geosynchronous Transfer Orbit https://t.co/GA5x9GMlgW Successful satellite deploy confirmed Coming up: 2nd stage engine restart and deployment of JCSAT-14 satellite https://t.co/tdni53IviI https://t.co/e1pGf94osU Second stage and JCSAT-14 now in coast phase. Webcast returns in about 10 minutes for second stage engine restart and satellite deploy Landing confirmed. Second stage continuing to carry JCSAT-14 to a Geosynchronous Transfer Orbit. https://t.co/HfHI5cwoYX The Falcon 9 first stage has landed on the droneship 2nd stage continuing nominally. https://t.co/Gkz0OIGnGZ Stage one entry burn has started 1st stage main engine cutoff and stage separation confirmed. 2nd stage engine burn underway https://t.co/tdni53IviI https://t.co/XzwQtXOjfO Liftoff! https://t.co/tdni53IviI https://t.co/yyyCynieS0 60 seconds until launch. Watch live → https://t.co/tdni53IviI https://t.co/5gh9kddNWW 20 minutes from launch. \nWebcast now live → https://t.co/tdni53IviI https://t.co/QOLQUAplCM Rocket now being fueled after Launch Director confirmed we are go for launch. 35 minutes and counting RT @elonmusk: Rocket reentry is a lot faster and hotter than last time, so odds of making it are maybe even, but we should learn a lot eith… Falcon 9 and JCSAT-14 vertical on pad in advance of tonight’s 1:21am ET launch attempt https://t.co/tdni53IviI https://t.co/D0tIzSyYz2 Due to weather at the Cape, we are now targeting Friday, May 6 at 1:21 a.m. ET for the launch of JCSAT-14 Static fire complete, teams reviewing data. Falcon 9 launch of JCSAT-14 communications satellite targeting May 5 at 1:21am ET RT @elonmusk: @elonmusk Max performance numbers are for expendable launches. Subtract 30% to 40% for reusable booster payload. RT @elonmusk: Just posted latest max payload capabilities of Falcon 9 and Heavy https://t.co/Z45Y5V7G91 Heads up! 360 degree camera view of landing on the droneship https://t.co/0VNR3gvN7X RT @Space_Station: .@Astro_TimPeake studies crew health and rover tech today as #Dragon packed for departure. https://t.co/nkIw6vQJhY https… Recently tested Dragon 2’s SuperDraco propulsive landing system at our McGregor, TX facility. Key for Mars landing https://t.co/dV1nhKDMhr RT @elonmusk: But wouldn't recommend transporting astronauts beyond Earth-moon region. Wouldn't be fun for longer journeys. Internal volume… RT @elonmusk: Dragon 2 is designed to be able to land anywhere in the solar system. Red Dragon Mars mission is the first test flight. Planning to send Dragon to Mars as soon as 2018. Red Dragons will inform overall Mars architecture, details to come https://t.co/u4nbVUNCpA Happy Earth Day from all of us at SpaceX https://t.co/b2ZYyiP4Rr RT @elonmusk: By land and sea https://t.co/C5QWfNy99r RT @Space_Station: #BEAM is successfully attached to the @Space_Station. What is #BEAM? The five W's to know: https://t.co/vNC0fMQwiE https… RT @BigelowSpace: The BEAM has left the Dragon https://t.co/3bhWEjOYSC RT @elonmusk: Great video history of Falcon 9 by Kinematic https://t.co/EeGPVW7kq2 Updated landing photos from droneship remote cameras: https://t.co/vn4S8bV3x3 https://t.co/n5StKgK9i2 Falcon 9 rocket back at port https://t.co/ysO9Q4vBXx https://t.co/1XKazWK3Xp RT @NASA: For 1st time, @SpaceX &amp; @OrbitalATK spacecraft are docked to @Space_Station at the same time https://t.co/TZqcQiUCoU https://t.co… RT @NASA: Success! @SpaceX #Dragon installed to @Space_Station at 9:57am ET with ~7,000 lbs of cargo. https://t.co/ZpU8qIR8Y3 https://t.co/… RT @astro_tim: SpaceX-8 over #Africa coming in for the approach. @SpaceX @Space_Station https://t.co/NMx6bvHlTN Capture confirmed! Dragon now attached to the @Space_Station robotic arm https://t.co/lud5bGxzt9 RT @Space_Station: Capture confirmed 7:23a ET/11:23a UTC. @SpaceX #Dragon in grips of @CSA_ASC #Canadarm2. https://t.co/35O2hEgwoB Go for capture: Dragon now 10 m from @Space_Station, will be captured shortly by @astro_timpeake using robotic arm https://t.co/28dtAsTNRR RT @NASA: What cargo is the #Dragon spacecraft carrying? Expandable habitat, medical research &amp; more https://t.co/43Tt92Wily https://t.co/d… Dragon on final approach to being captured by the @Space_Station crew. https://t.co/XbCVPGwLuR https://t.co/j8onSDe27o RT @Space_Station: Final approach underway. @SpaceX #Dragon moving to capture point where @CSA_ASC #Canadarm2 will grapple spacecraft. http… Dragon about 40 meters from the @Space_Station \nhttps://t.co/XbCVPGwLuR https://t.co/thRrRfUMD2 RT @Space_Station: Preliminary @SpaceX #Dragon capture time 7:30am ET/11:30am UTC with @Astro_TimePeake at @CSA_ASC robotics controls &amp; @As… RT @Space_Station: .@SpaceX #Dragon leaves 250 meter hold point. Next stop 30 meters away from station in about 30 minutes. https://t.co/C7… Live @NASA TV coverage of Dragon's arrival at @Space_Station https://t.co/HmoR7VPWHj https://t.co/wvUm7jEBJR RT @NASA: The @SpaceX cargo craft arrives at @Space_Station this morning! Stream live at 5:30am ET: https://t.co/rUrtFD4xk0 https://t.co/Ar… Coverage of Dragon capture at @Space_Station begins on NASA TV at 2:30am PT, 5:30am ET 4/10 https://t.co/XbCVPGwLuR https://t.co/KgSXTiGRK8 More launch and landing photos here https://t.co/vn4S8bV3x3 https://t.co/PvlU50ZJvh 4K footage from chase plane https://t.co/ZtdZHadUos Onboard view of landing in high winds https://t.co/FedRzjYYyQ RT @elonmusk: @POTUS Thanks on behalf of an amazing team at SpaceX! RT @POTUS: Congrats SpaceX on landing a rocket at sea. It's because of innovators like you &amp; NASA that America continues to lead in space e… Dragon and @BigelowSpace BEAM module on way to @Space_Station for @NASA https://t.co/FjWfCQiglh Landing from the chase plane https://t.co/2Q5qCaPq9P Post-launch and landing press conference about to begin https://t.co/Gu17DuBY4d Falcon 9 first stage on our droneship in the Atlantic after propelling the Dragon spacecraft to the @Space_Station https://t.co/Cnnej7zEnt Dragon is on its way to the International Space Station. Capture by the @Space_Station crew set for early Sunday morning Dragon's solar arrays just deployed https://t.co/tdni53IviI The 1st stage of the Falcon 9 just landed on our Of Course I Still Love You droneship. Dragon in good orbit https://t.co/SYyUCDZE3k 2nd stage and Dragon remain on nominal trajectory 1st stage has landed on Of Course I Still Love You https://t.co/tdni53IviI 1st stage landing burn has begun 1st stage entry burn has begun 2nd stage burn continues nominally https://t.co/tdni53IviI https://t.co/7BsGF6Xxao 1st stage boostback burn has begun. 2nd stage remains nominal 2nd stage propelling Dragon into its orbit to meet up with the International Space_Station Main engine cutoff and stage separation confirmed\nhttps://t.co/tdni53IviI Liftoff! https://t.co/tdni53IviI 60 seconds until launch. Watch here → https://t.co/tdni53IviI https://t.co/uyI4ncGT54 10 minutes and counting → https://t.co/tdni53IviI 20 minutes from launch of Falcon 9 and Dragon to the @Space_Station.\nWebcast live now → https://t.co/tdni53IviI https://t.co/w0bpmIGMnR Propellant load underway for Falcon 9. Launch webcast will go live in about 10 minutes https://t.co/tdni53IviI RT @NASA: Launch of @SpaceX #Dragon cargo ship to @Space_Station set for 4:43pm ET. Weather is 90% GO: https://t.co/EGRrLlohza https://t.co… Weather remains 90% go for today's 4:43pm ET launch of Falcon 9 and Dragon to @Space_Station https://t.co/tdni53IviI https://t.co/muvZUZOBkD Today Dragon was loaded with \"late load\" cargo in advance of tomorrow's 4:43pm ET launch → https://t.co/tdni5406Hi https://t.co/pYrygtXadu RT @NASA: Launch weather is 90% 'go' for Friday’s 4:43pm ET @SpaceX #Dragon launch to @Space_Station: https://t.co/VfOa3LsuHN https://t.co/… RT @NASA: LIVE NOW: Prelaunch briefing for @SpaceX #Dragon 4:43pm ET cargo launch Friday: https://t.co/KX5g7yYnYG. Q? #askNASA https://t.co… RT @NASA: Watch our prelaunch briefing at 3:30pm ET for @SpaceX #Dragon cargo launch: https://t.co/KX5g7yYnYG. Q? #askNASA https://t.co/x1H… RT @NASA: LIVE NOW: Our 'What's on Board' @SpaceX #Dragon cargo ship event. Watch: https://t.co/KX5g7yYnYG Question? #askNASA https://t.co/… Falcon 9 and Dragon targeting launch this Friday afternoon at 4:43pm ET. Updates &amp; webcast → https://t.co/tdni53IviI https://t.co/tAWKYY6qns Static fire complete, teams reviewing data in advance of Dragon mission to @Space_Station https://t.co/RFUmKwBdaI RT @Space_Station: .@SpaceX gets ready for #Dragon launch. @NASA TV covers April 8 starting 3:30p ET/7:30p UTC. https://t.co/r2hKeJMYdG htt… RT @NASA: We’re launching an expandable habitat to @Space_Station on @SpaceX #Dragon Friday. See why: https://t.co/OwFFoEx19w https://t.co/… Expandable @BigelowSpace habitat being lifted into Dragon's trunk for a ride to the space station early next month https://t.co/iBwHrNV2EB 90 yrs ago today, Robert Goddard launched the world's 1st liquid-fueled rocket\nA page from John Clark's \"Ignition\" → https://t.co/59wmgHksFH RT @esaoperations: What happens after @ESA_ExoMars departs Earth today? Here's a detailed run down of the journey's most critical steps htt… Congrats to @esa on the launch of @ESA_ExoMars orbiter and entry, descent and landing demo https://t.co/DCWD9N06OV https://t.co/qTwquq2ZZB SES-9 spacecraft in Geo Transfer Orbit, 40,600 km in altitude. Photos → https://t.co/K47HQ7fHjp @SES_Satellites https://t.co/5BDZxzbLV5 RT @elonmusk: Rocket landed hard on the droneship. Didn't expect this one to work (v hot reentry), but next flight has a good chance. RT @elonmusk: Target altitude of 40,600 km achieved. Thanks @SES_Satellites for riding on Falcon 9! Looking forward to future missions. Spacecraft separation confirmed Second stage re-light complete. Awaiting satellite deploy Second stage re-light has occurred https://t.co/tdni53IviI Second stage and SES-9 spacecraft in nominal coast phase Stage two flight remains nominal Stage one entry burn has shutdown https://t.co/tdni53IviI Fairing separation confirmed. Stage two systems nominal https://t.co/tdni53IviI Main engine cut off and stage separation have occurred https://t.co/tdni53IviI Liftoff! https://t.co/tdni53IviI T-30 seconds until launch. Watch live → https://t.co/tdni53IviI Launch webcast now live. T-10 minutes and counting https://t.co/tdni53IviI Launch webcast starts in about 15 minutes. Liftoff targeting 6:35pm ET\nhttps://t.co/tdni53IviI One hour from 6:35pm ET launch window for SES-9. Continuing to watch upper-level winds https://t.co/tdni53IviI https://t.co/yWnV3XWFpU RT @elonmusk: Pushing launch to Friday due to extreme high altitude wind shear. Hits like a sledgehammer when going up supersonic https://t… RT @elonmusk: @SpaceX Launch aborted on low thrust alarm. Rising oxygen temps due to hold for boat and helium bubble triggered alarm. Launch team has called a scrub for the day; vehicle and spacecraft are healthy. Ignition sequence aborted in final seconds of countdown; update pending from launch team after data review Countdown continuing, liftoff pending ship clearing keep out zone https://t.co/tdni53IviI RT @elonmusk: @SpaceX AF has placed launch on hold due to a boat entering the edge of the keep out zone. Scrambling helo to get them to mov… Currently holding countdown for range safety issue. Webcast now live for our launch attempt tonight. T-10 minutes and counting https://t.co/tdni5406Hi https://t.co/lE26sh16TI Tracking towards a 6:46pm ET launch attempt today; watching upper-level winds closely. https://t.co/8HqAtnyDKt RT @SES_Satellites: SES and SpaceX are now targeting to launch #SES9 on Sunday, 28 February, at 6.46pm ET, with a backup date on Monday, 29… Countdown held for the day. Teams are reviewing the data and next available launch date. Holding countdown. T-5 minutes and counting https://t.co/tdni53IviI Webcast now live in advance of 6:47pm ET launch https://t.co/tdni53IviI https://t.co/IdVkAyaDrW Propellant loading underway. Launch targeting 6:47pm ET.\nhttps://t.co/tdni53IviI https://t.co/nBfgGC35Vi One hour away from our live webcast at 6:25pm ET.\nLaunch targeting 6:47pm ET → https://t.co/tdni53IviI https://t.co/Bqc10Frlx9 Weather for today's launch attempt at 80% go, though upper level winds and ground level winds remain watch items. https://t.co/PM0vnDGuq3 Team opting to hold launch for today. Looking to try again tomorrow; window also opens at 6:46pm ET. Rocket and spacecraft remain healthy. Weather still 60% go for today's launch. Tracking thick clouds &amp; winds. Webcast at 6:30pm ET https://t.co/tdni53IviI https://t.co/X7NrcAdK3g Weather remains 60% go for tomorrow's launch attempt. Window opens at 6:46pm ET. Webcast → https://t.co/tdni53IviI https://t.co/nPgm32vwA9 Full-duration static fire completed. Targeting Wednesday for launch of SES-9 satellite @SES_Satellites https://t.co/lp6nxGvUuH RT @SES_Satellites: #ses9 getting ready to be launched this week on #falcon9. Here's @SpaceX payload fairing after #ses9 encapsulation http… Einstein nails it again: Gravitational waves seen for the first time https://t.co/XeKWYe8gJf #LIGO https://t.co/qyKvOEzkg0 Our 212-foot tall Transporter Erector went vertical on Pad 39A today. Built to support Falcon 9 and Heavy https://t.co/va9Vva2fmF Tune in live now to the student @Hyperloop Pod Competition design weekend #breakapod https://t.co/BG2jSGMEEH RT @Hyperloop: Live stream of Design Weekend awards ceremony about to start https://t.co/f1dUuxdzYB #breakapod Student @Hyperloop Pod Competition opens to public at 1:30pm CT @TAMU's Hall of Champions at Kyle Field #breakapod https://t.co/lud9L9MC78 Live now: @TAMU president and @SecretaryFoxx speaking at @Hyperloop Pod Competition. Tune in → https://t.co/BG2jSGMEEH #BreakAPod In 30 min @SecretaryFoxx will speak at the @Hyperloop Pod Competition. Tune in → https://t.co/BG2jSGMEEH #BreakAPod https://t.co/32hAp1EnHL RT @SecretaryFoxx: At 6pm CT, I'll discuss the future of transportation at @SpaceX’s @Hyperloop pod competition. Tune in → https://t.co/EiB… RT @Hyperloop: Live streaming opening of student Hyperloop Pod Competition at 12:15pm CT #breakapod @TAMU https://t.co/f1dUuxdzYB https://t… RT @TheBattOnline: Friday's page 1 — hyperloop hype takes over Texas A&amp;M #breakapod https://t.co/BCYMnY6qrS RT @NASA: Today, we pause to remember our fallen heroes of the Apollo 1, #Challenger &amp; Columbia crews: https://t.co/HLBpuDT73Q\nhttps://t.co… RT @NASA: Four parachutes unfurled high above the desert as @SpaceX tests @Commercial_Crew landings: https://t.co/kq3GCdFHUM https://t.co/i… RT @Commercial_Crew: Watch 8 SuperDraco engines fire for @SpaceX Crew Dragon descent landing tether test: https://t.co/4MELcVTe0h. More: ht… Hover test of our Dragon 2 spacecraft that can carry cargo and crew https://t.co/H0F7hQbZlB RT @NASA: \"If I cannot do great things, I can do small things in a great way\" Explore how on #MLKDay: https://t.co/BUAxPjWhfe https://t.co/… RT @elonmusk: Falcon lands on droneship, but the lockout collet doesn't latch on one the four legs, causing it… https://t.co/DpXsRQWal9 First stage approaches center of landing droneship in Pacific https://t.co/lI3q6LnwVP RT @NASA: After a successful  launch, #Jason3 spacecraft has separated &amp; is flying free. Watch live: https://t.co/KX5g7zfYQe\n https://t.co/… RT @elonmusk: Well, at least the pieces were bigger this time! Won't be last RUD, but am optimistic about upcoming ship landing. https://t.… After further data review, stage landed softly but leg 3 didn't lockout. Was within 1.3 meters of droneship center RT @elonmusk: However, that was not what prevented it being good. Touchdown speed was ok, but a leg lockout didn't latch, so it tipped over… RT @elonmusk: Definitely harder to land on a ship. Similar to an aircraft carrier vs land: much smaller target area, that's also translatin… Second stage re-ignition successful. Jason-3 satellite has been deployed. First stage on target at droneship but looks like hard landing; broke landing leg. Primary mission remains nominal → https://t.co/tdni53IviI Webcast will return in about 40 minutes after coast phase for spacecraft separation https://t.co/tdni53IviI Standing by for status of stage one. Second stage and Jason-3 now in nominal coast phase. Stage two propulsion remains nominal. Orbit insertion has occurred. Stage one is transonic Stage one entry burn has started Stage two propulsion remains nominal Grid fins have deployed on stage one Stage one boostback burn has started. Stage two continuing nominally Fairing separation confirmed Stage separation confirmed https://t.co/tdni53IviI Liftoff! https://t.co/tdni53IviI Launch Director has verified Falcon 9 and Jason-3 are go for launch.\n\n2 minutes and counting → https://t.co/tdni53IviI 10 minutes to launch → https://t.co/tdni53IviI Liftoff in about 20 minutes. \n\nWebcast now live → https://t.co/tdni53IviI https://t.co/U46vk25LcT One hour from launch of Falcon 9 with the Jason-3 ocean monitoring satellite https://t.co/tdni53IviI https://t.co/Mt36dTT4YA RT @NASAJPL: It's launch day! Watch #Jason3 live on https://t.co/G8VNqPlEqR. Launch set for 10:42am PT (1:42pm ET, 18:42 UTC) https://t.co/… Out at sea for tomorrow's launch and landing attempt https://t.co/9LMsj6qryI Rocket is vertical in advance of tomorrow's 1:42pm ET launch attempt of Jason-3 science satellite @NASA @NOAA @CNES https://t.co/lpzI9YrL1y RT @NOAASatellites: Countdown to Sunday has begun! #Jason3 heads to the @SpaceX pad atop the Falcon 9 rocket. https://t.co/vPPnuUFeXd https… RT @elonmusk: Conducted hold-down firing of returned Falcon rocket. Data looks good overall, but engine 9 showed thrust fluctuations. RT @NASA: Bright future! We selected @OrbitalATK, @SNCspacesystems &amp; @SpaceX to deliver @Space_Station cargo from 2019-2024. https://t.co/x… \"The Falcon has landed.\"  New footage and recap of our recent launch and landing https://t.co/ogtHIbCnZi RT @elonmusk: Aiming to launch this weekend and (hopefully) land on our droneship. Ship landings needed for high velocity missions https://… Full-duration static fire complete at our California pad. Preliminary data looks good in advance of Jason-3 launch. https://t.co/sBi5hdkcef Upgraded Merlin engines, up close and personal https://t.co/EpzhHwFAV1 https://t.co/HFOSrgw0bF RT @elonmusk: Falcon 9 back in the hangar at Cape Canaveral. No damage found, ready to fire again. https://t.co/7w6IfJGtXM RT @NASAKennedy: Watch footage of the first vertical landing of a @SpaceX Falcon 9 first stage:\nhttps://t.co/smzRWQJFfw Sunrise this morning at Cape Canaveral https://t.co/c6i2Wn2JtL Going up and coming down. More pics here -&gt; https://t.co/K47HQ6Y6rR https://t.co/BBHHjPSFD0 Landing from helo https://t.co/dYomRtG0Xs RT @elonmusk: High res video of landing from the helo https://t.co/G0Yq2V5J3m Another view of Falcon 9 first stage approaching Landing Zone 1 https://t.co/i5oNfSYmrc RT @elonmusk: Live video from LZ-1 https://t.co/Ve6gEXfOdh https://t.co/jSZDEkpxaG Background on tonight's launch and landing https://t.co/b4bVC6pYyt https://t.co/jLJWphkm0R RT @elonmusk: There and back again https://t.co/Ll7wg2hL1G Long exposure of launch, re-entry, and landing burns https://t.co/Vw1ZJAtvhy https://t.co/jvFpcgVKY0 All 11 @ORBCOMM_Inc satellites have been deployed in nominal orbits. https://t.co/cHSk1k29vj Spacecraft deploy beginning in orbit @ORBCOMM_Inc The Falcon 9 first stage landing is confirmed. Second stage continuing nominally. https://t.co/RX2QKSl0z7 Stage one has landed Stage one entry startup Stage two burn remains nominal Stage one boostback burn has started Fairing deployed Stage separation confirmed. 2nd stage has ignited https://t.co/tdni53IviI Liftoff! https://t.co/tdni53IviI Launch Director just verified go for launch -&gt; https://t.co/tdni53IviI\n1 minute and counting. RT @elonmusk: Background on the launch https://t.co/1SkttU684X T-5 minutes and counting https://t.co/tdni53IviI Webcast now live in advance of 8:29pm ET Falcon 9 launch and landing attempt: https://t.co/7NEB2qQNj9 https://t.co/kcnZqh8nEk Live webcast starting in about 20 minutes https://t.co/b3Pk2SbjTz RT @ORBCOMM_Inc: T-90 minutes until @SpaceX launch conductor is scheduled to take launch readiness poll https://t.co/azqrDx2u81 #SpaceX #OG2 RT @ORBCOMM_Inc: From @SpaceX: #OG2 Mission 2 launch event chronology before/after #Falcon9 liftoff #SpaceX https://t.co/Ps4PyYMh1k First look at our massive new Landing Zone 1 https://t.co/cABp3IYmcl Falcon 9 on the pad in advance of tonight's mission to launch 11 @ORBCOMM_Inc satellites &amp; attempt 1st stage landing https://t.co/qQDCYYkBDt RT @ORBCOMM_Inc: UPDATE: A 5 minute launch window opens at 8:29pm ET this evening for the #OG2 Mission 2 launch... https://t.co/k0ndVaHh3h … RT @elonmusk: Launch &amp; landing can be seen on the https://t.co/bDd3GxQXMC webcast or in person from Cape Canaveral public causeway at 8:33p… RT @elonmusk: Just reviewed mission params w SpaceX team. Monte Carlo runs show tmrw night has a 10% higher chance of a good landing. Punti… RT @elonmusk: Currently looking good for a Sunday night (~8pm local) attempted orbital launch and rocket landing at Cape Canaveral RT @elonmusk: Static fire test looks good. Pending data review, will aim to launch Sunday. RT @elonmusk: 5 mins from static fire test RT @elonmusk: @PaigeANjax -340 F in this case. Deep cryo increases density and amplifies rocket performance. First time anyone has gone thi… RT @elonmusk: Falcon 9 is vertical on the launch pad at Cape Canaveral. Working towards static fire. Deep cryo liquid oxygen presenting som… Falcon 9 went vertical yesterday and the teams ran through pad operations. Working towards static fire later today. https://t.co/ZGMBKrFzik RT @elonmusk: Aiming for Falcon rocket static fire at Cape Canaveral on the 16th and launch about three days later 5 years ago today: Dragon became the first private spacecraft to reach orbit and successfully return to Earth → https://t.co/2WFwc7T6NE RT @Flickr: Of billions of uploads, these are the Top-25 photos on Flickr in 2015. https://t.co/pENw18iNws #YahooInReview https://t.co/ayAM… RT @NASA: Today we ordered first @SpaceX mission to fly astronauts to @Space_Station: https://t.co/4ZVbCgjogN @Commercial_Crew https://t.co… RT @Commercial_Crew: .@NASA orders @SpaceX crew mission to @Space_Station. Read details at https://t.co/XGSEOSVuYZ https://t.co/N42GidqN68 RT @Commercial_Crew: There are many reasons to #BeAnAstronaut, including flying @SpaceX’s #CrewDragon! https://t.co/i2TIVLWky5 https://t.co… RT @SpaceXJobs: These fall interns are key @SpaceX team members. Check out all our internship opportunities: https://t.co/z3iCQoupD0 https:… Thank you, veterans! https://t.co/8RxtsrJZTL RT @DeptofDefense: On this #VeteransDay, the #DoD would like to honor and thank all the men and women who’ve served our Nation.\nhttps://t.c… RT @Commercial_Crew: See what powers @SpaceX Crew Dragon from zero to 100 mph in 1.2 seconds.https://t.co/k0Ziw0h4ls #LaunchAmerica https:/… Slow-mo footage of our pad abort test in May, a critical test in preparation for our first human missions. https://t.co/vvZTlf5sH1 RT @SecretaryFoxx: Excited for @Hyperloop student design challenge weekend, @TAMU in January; #BreakAPod everyone! http://t.co/jcAjKT1C8U Curious what an internship is like here? Current and former interns share their stories about the @SpaceX life → https://t.co/uUKG9yxhaT Where there’s water, there can be coffee. Happy #nationalcoffeeday https://t.co/aQndAKKY4P RT @NASA: Water! Strong evidence that liquid water flows on present-day Mars. Details: http://t.co/0MW11SANwL #MarsAnnouncement http://t.co… Step outside tonight &amp; catch the super Moon eclipse -- next one happens in 2033!  http://t.co/IP3drS59gq http://t.co/Z2RS8ncIZj This week we static fired the first stage of the upgraded Falcon 9 for a planned 15 seconds https://t.co/fxp7HnUvCu Dragon on Mars. http://t.co/Q0HuYfU6xF RT @elonmusk: Researchers at @NASA propose using @SpaceX Falcon/Dragon for Mars sample return mission http://t.co/U6LNKyF4Jr RT @elonmusk: In expendable mode, Falcon Heavy can send a fully loaded Dragon to Mars or a light Dragon to Jupiter's moons. Europa mission … RT @SpaceXJobs: .@GeorgiaTech students: @SpaceX is headed your way! Come find us today from 9:30AM – 4PM at the Campus Rec Center. http://t… RT @NASA: Today, we take a moment to #Remember911 and those impacted by the tragedy: http://t.co/xfVVTO5vna #NeverForget http://t.co/Y09OyX… Passengers of Crew Dragon can take in views right from their seats. http://t.co/YV0QG89Fnu https://t.co/Yq2PZyCXZ5 http://t.co/DZ26BT5XdX RT @NASA: Our @Commercial_Crew partner @SpaceX unveiled the interior of their Crew Dragon spacecraft: http://t.co/4TRUfXIQUC http://t.co/LW… First look at interior of Crew Dragon, our next-generation spacecraft → http://t.co/YV0QG89Fnu https://t.co/AP7ukgo7NQ RT @SpaceXJobs: The @SpaceX University Recruiting team is hitting the road this Fall! We'll be at @TAMU, @UTAustin, @Cornell and @Penn all … Pad 39A @NASAKennedy will be future home to @Commercial_Crew launches and Falcon Heavy missions http://t.co/ITebIXLzzb In case you missed it: @waitbutwhy’s take on space exploration, Mars colonization and us http://t.co/TIIFLp7Xtz http://t.co/OMvQuLovsv RT @TAMUEngineering: New details released on @SpaceX @Hyperloop pod competition. http://t.co/YhY2xaQycc http://t.co/z1HD9l8gGD Recently took Crew Dragon’s computers for test run at Hawthorne HQ in advance of flight simulation to space station https://t.co/AIzWMo6EOf Unique vantage point of @NOAASatellites DSCOVR provides amazing shot of Moon orbiting Earth http://t.co/LLwMmmYHdM http://t.co/QUx6QI75vu RT @Commercial_Crew: The road to the launch pad is complete @NASAKennedy’s 39A where @SpaceX is building new facilities to #LaunchAmerica. … RT @DavaExplorer: Great to visit Gwynne at @SpaceX. Thanks for the tour! #LaunchAmerica http://t.co/RLyDXHINHc First of eventual daily snapshots of Earth from DSCOVR satellite a million miles away at Earth-Sun gravity null point http://t.co/7ok1cn1KmW Summary of preliminary findings regarding CRS-7 mission, further investigation may reveal more over time → http://t.co/YFFsT2PCwB RT @NASA: Our 3-billion-mile journey to Pluto reaches historic #PlutoFly! Details &amp; the high-res image: http://t.co/qX7KpXIUUQ http://t.co/… RT @NASA: Veteran astronauts selected for first @Commercial_Crew flights with @BoeingDefense &amp; @SpaceX: http://t.co/YxXT9E4WOH http://t.co/… RT @elonmusk: Expect to reach preliminary conclusions regarding last flight by end of week. Will brief key customers &amp; FAA, then post on ou… RT @elonmusk: Cause still unknown after several thousand engineering-hours of review. Now parsing data with a hex editor to recover final m… RT @elonmusk: That's all we can say with confidence right now. Will have more to say following a thorough fault tree analysis. RT @elonmusk: There was an overpressure event in the upper stage liquid oxygen tank. Data suggests counterintuitive cause. RT @NASA: We are planning a @SpaceX launch contingency news conference no earlier than 12:30pm ET. Watch at: http://t.co/KX5g7yYnYG RT @elonmusk: Falcon 9 experienced a problem shortly before first stage shutdown. Will provide more info as soon as we review the data. The vehicle experienced an anomaly on ascent. Team is investigating. Updates to come. Liftoff!! http://t.co/tdni5406Hi T-18 minutes. Launch webcast now live at http://t.co/tdni5406Hi T-1 hour to liftoff of Falcon 9 &amp; Dragon. Live launch webcast: http://t.co/tdni5406Hi http://t.co/n8blVGE4Eo On track for launch tomorrow to @Space_Station. Liftoff targeted for 10:21am ET – watch live http://t.co/tdni5406Hi http://t.co/VVNTVEUiVx RT @elonmusk: Drone hexacopter takes pic of drone ship OCISLY on station in the Atlantic https://t.co/DONcOD8hSD Rocket completed hold down firing today in advance of Sunday cargo mission to @Space_Station http://t.co/tdni53IviI http://t.co/PjiYSIDTOu The why and how of landing rockets http://t.co/9EPrDnfRX7 \nhttps://t.co/NE1POjpZXW RT @Hyperloop: Details on the pod competition can be found in this PDF http://t.co/YBBXEHhGGD http://t.co/WPC3Kjs7NB RT @Hyperloop: Announcing the @SpaceX Hyperloop Pod Competition http://t.co/ZQHjHtkuAj https://t.co/AtCkkRnjHt Our biggest hangar yet in work at Kennedy Space Center — capable of holding up to 5 rockets at once http://t.co/oikVhV4b2B Falling back to Earth. Full vid: https://t.co/o2X7SXPPMW https://t.co/f54WsQuYkv Falling back to Earth https://t.co/GesWzUZeq2 The first Falcon 9 took flight 5 years ago today—now has launched 18 times. What will the next 5 years bring? https://t.co/8TD0sF7HZU RT @SpaceXJobs: This week @SpaceX is headed to @DARPA Robotics Challenge Finals to see 25 teams compete for $3.5 million in prizes: http://… RT @AstroTerry: Our last sunset for 5 days. We are in “high Beta” #SeasonsOfSpace now with the sun constantly off our left “wing\". http://t… We thank the @USAirForce for its confidence in us and look forward to serving it well http://t.co/9mcE6Je9nG @SecAF23 http://t.co/ZhBN1SD2z0 RT @NASA: Apply now for a #NASASocial credential to cover the @SpaceX launch in-person June 26 in FL: http://t.co/LxQOKCEzz3 http://t.co/RG… 3 years ago today: #Dragon launched on 1st visit to @Space_Station\nNow has visited 7 times\nRelive that 1st mission → https://t.co/sQf13YQ2Si Ride along on critical test of our vehicle designed to carry astronauts as it accelerates from 0-100 mph in 1.2 sec \nhttps://t.co/EdwFW9nR31 Cargo is offloaded and spacecraft is powered down. #Dragon back in its nest after about 5 weeks at the @Space_Station http://t.co/4irpMtg9yw Dragon just completed its longest stay yet at the @Space_Station, returning 3,100 lbs of cargo &amp; science for @NASA. http://t.co/yPqu5AwFmG RT @NASA: What's coming down on @SpaceX #Dragon? SpinSat &amp; slithery things await splashdown at 12:42p ET http://t.co/UZYJWP6WmS http://t.co… Splashdown confirmed of Dragon in the Pacific Ocean at 12:42 pm ET, about 155 miles SW of Long Beach, CA. RT @AstroTerry: Releasing SpaceX-6 Dragon today with help from @StationCDRKelly. http://t.co/0qYXk1Znjv Dragon has departed the @Space_Station &amp; completed 3 departure burns to begin its trip home. http://t.co/tdni53IviI http://t.co/B5l4cterzs Dragon has been at the @Space_Station about a month -- ready to release in about 10 min\nLive → http://t.co/tdni53IviI http://t.co/RnlmhPI5sQ Tomorrow: Dragon to release from @Space_Station and bring over 3,000 lbs of research &amp; equipment back to Earth http://t.co/4F4HkGqZjK Tired of the same old travel destinations? Discover the wonder of Mars \nhttp://t.co/KpluQw4cow http://t.co/vD9oLSuY5r Adventure awaits! Explore Mars’ ultimate vacation destinations \nhttp://t.co/KpluQw4cow http://t.co/kptj27x1LD RT @StationCDRKelly: Caught our star peeking through #Dragon's solar arrays today. Good night from @Space_Station! #YearInSpace http://t.co… RT @elonmusk: Max acceleration was 6X gravity, altitude 1187m, lateral distance 1202m and velocity 155 m/s. Main chutes deployed 970m. \"Had humans been on board today, they would have been in great shape.\"\nRelive today's pad abort test in 6 seconds https://t.co/JY0eagJA1V From 0 to 100 mph in 1.2 seconds – more info on Crew Dragon’s successful test today: http://t.co/XYS4AXhD21 http://t.co/n9oxqUn5AL RT @elonmusk: Dragon abort test stats: 0 to 100 mph in 1.2 sec, top speed of 345 mph This morning, a Crew Dragon test article completed a Pad Abort Test, the 1st critical test in prep for human missions http://t.co/ysMdHMaVPb Video of Pad Abort test: https://t.co/FE2kNu3m6L Pad abort test vehicle lifts off from LC-40 at Cape Canaveral http://t.co/SeZVGlJhLz Dragon has splashed down into the Atlantic Ocean Main parachutes deployed Drogue parachutes deployed Abort burn terminated, Dragon on upward trajectory SuperDracos have ignited Pad Abort Test still set for top of window. T-9 min. Live TestCast: http://t.co/tdni5406Hi http://t.co/pMD25DM7fV Tomorrow is 1st major test of Crew Dragon’s launch abort system, window 9am-4pm ET. TestCast: http://t.co/tdni5406Hi http://t.co/YdSczLrLkJ RT @elonmusk: Hold down firing of Dragon 2 spacecraft at Cape Canaveral http://t.co/2626wb8596 5 things to know about our upcoming Pad Abort Test http://t.co/wagj9VTL5u http://t.co/CEL2QQcH1c RT @NASA: Live at 10am ET: Get a preview of the May 6 @SpaceX pad abort test. Watch: http://t.co/7xysuAjnX7 #LaunchAmerica http://t.co/wZYT… RT @NASA: .@SpaceX targets May 6 for pad abort test of new @Commercial_Crew spacecraft: http://t.co/6NDMU1fwEi #LaunchAmerica http://t.co/1… Recap: Falcon 9's 5th launch in 4 months\n\nhttp://t.co/NAvcEDLreq http://t.co/IdVLK3qPUB .@thalesgroup has acquired signal from TurkmenÄlem52E/MonacoSat satellite Falcon 9 lifted off at 7:03pm ET carrying the @thalesgroup TurkmenÄlem52E/MonacoSat satellite to geo transfer orbit. http://t.co/XDcy3GmUaK Liftoff!! http://t.co/tdni5406Hi Liftoff now set for 7:03pm ET, assuming weather holds. http://t.co/tdni5406Hi Countdown clock holding at T-20 min, waiting for weather to improve. Window lasts to 7:44pm ET. http://t.co/tdni5406Hi Weather remains 60% “GO” for tonight’s Falcon 9 launch attempt. Launch window opens 6:14pm ET. http://t.co/tdni5406Hi http://t.co/9lSJeVH3Hj Rocket moving to the pad tonight in advance of tomorrow's launch attempt. 6:14pm ET window opens. Weather 60% go. http://t.co/6k28TJz7Gl Falcon 9 static fire completed yesterday before Monday launch of @thalesgroup comms satellite http://t.co/HYR69dY9rE http://t.co/OdiOsCC5B6 Dragon's solar arrays being deployed after entering Earth orbit last week (2x speed) https://t.co/dmBU3Pwi1K #Dragon on approach to @Space_Station last week, loaded with more than 4,300 lbs of science &amp; supplies. http://t.co/gsmSTqEAcP RT @elonmusk: Cause of hard rocket landing confirmed as due to slower than expected throttle valve response. Next attempt in 2 months. RT @AstroTerry: #Dragon approaching this morning. http://t.co/ulslFWqo4V #Dragon is now fully attached to @Space_Station! Hatch opening to occur over the next day. http://t.co/W8JBYnWOWe At am 6:55am ET, #Dragon is captured by the @Space_Station! http://t.co/62Vs56KYkb #Dragon now at 30m hold point, poised for capture at ~7am ET / 4am PT. http://t.co/tdni5406Hi http://t.co/6Of9Les1QW #Dragon now on final approach to @Space_Station, grapple by robotic arm targeted for 7am ET. http://t.co/tdni5406Hi http://t.co/RwmDS9jBEl RT @NASA: .@SpaceX #Dragon #ISScargo craft is set to arrive at ~7am ET Friday at the @Space_Station: http://t.co/fhX8x2R3bW http://t.co/qS7… High resolution and color corrected Falcon 9 first stage landing video https://t.co/8rt4PfbgQU Falcon 9 first stage landing burn and touchdown on Just Read the Instructions https://t.co/4Te0BfT2Qn RT @elonmusk: Ok, looks like we got some killer footage from the chase plane. Big ocean, small ship. Posting vid shortly http://t.co/2F5FK0… RT @elonmusk: Looks like Falcon landed fine, but excess lateral velocity caused it to tip over post landing http://t.co/eJWzN6KSJa #Falcon9 first stage approaches Just Read the Instructions. http://t.co/XzmnYslNlc #Dragon's solar arrays have deployed, spacecraft now safely on its way to the space station. RT @elonmusk: Ascent successful. Dragon enroute to Space Station. Rocket landed on droneship, but too hard for survival. LIFTOFF of #Falcon9 and #Dragon on the CRS-6 mission to resupply the space station for @NASA. http://t.co/tdni5406Hi http://t.co/K4umPf48X2 Liftoff!! http://t.co/tdni5406Hi Live now: #Falcon9 and #Dragon launching to @Space_Station in T-15 min. http://t.co/tdni5406Hi Weather 60% \"go\" for #Falcon9 launch today @ 4:10pm ET. Lightning/clouds still a concern. http://t.co/tdni5406Hi http://t.co/THhVBEE3Oi RT @elonmusk: Launch window always tight when orbital synch needed. In this case, Space Station. For Earth-Sun gravity null point, moon was… Launch scrubbed today for weather, next opportunity tomorrow 4/14 at 4:10pm EDT. T-15 minutes to #Falcon9 &amp; #Dragon launch to @Space_Station. Watch live: http://t.co/tdni53IviI http://t.co/aWOKEaq2zW #Falcon9 &amp; #Dragon now vertical in advance of today’s CRS-6 launch, targeted for 4:33pm ET. http://t.co/tdni53IviI http://t.co/2eDUh4HIkO Just Read the Instructions on location &amp; ready for tomorrow’s 1st stage landing attempt. http://t.co/tdni53IviI http://t.co/GYeCp0DDc8 Static fire engine test completed today in advance of Monday's launch attempt to the @Space_Station. http://t.co/5L26pJ6wlN Final processing for #Dragon ahead of 4/13 launch attempt to @Space_Station (points if you notice what’s new) http://t.co/vPoYzFHtXZ Check out some Falcon 9 launch footage, now in Ultra HD 4K: https://t.co/nHaPuUk7XW\n \n(Slow connection? Still epic in 1080p HD) How will Falcon 9's 1st stage attempt flyback to Earth after our next launch? https://t.co/NUphZ5ikMW #rocketlanding http://t.co/GywPCuSql1 Continued progress on Pad 39A and its hangar that will house Falcon 9 and Falcon Heavy at @NASAKennedy http://t.co/jqZGlDTRNa @paraszopen @Space_Station @rebel_sal yeah Falcon 9 and Dragon undergoing prep in FL in advance of 4/13 launch to the @Space_Station http://t.co/0KGddcVzV0 http://t.co/7Fwc9W1jWh RT @NASA: Launch Update: Next @SpaceX #ISScargo launch is now targeted for 4:33pm ET on April 13. More: http://t.co/8psz4vwQd6 http://t.co/… RT @Flickr: Flickr is happy to now support public domain and CC0 works. http://t.co/rjuhXzLrdk (Photo: SpaceX) http://t.co/ZZblBMeSaW Godspeed @StationCDRKelly! T-2 weeks until #Dragon visits you with science &amp; supplies, T-2 years to @Commercial_Crew. http://t.co/8U1HGNLIYp Demo of pad abort test profile — 2 SuperDraco engines ignite &amp; throttle as they would during Pad Abort flight test https://t.co/2lrrQoQNq3 Happy Birthday Wernher von Braun, 1 of the fathers of rocket science, Saturn V architect &amp; SpaceX conf room namesake http://t.co/KDVqwtA0c8 RT @NASA: Experience in-person the next @SpaceX launch! Apply for our April 9/10 #NASASocial in FL:  http://t.co/5xXoNdsW9x http://t.co/djM… @NASAGoddardPix @Flickr Thanks! Introducing Landing Complex 1, formerly Launch Complex 13, at Cape Canaveral in Florida. http://t.co/oIr6NssyCo Up, up &amp; away. #Dragon flies in Earth orbit during 3rd official cargo resupply mission to #ISS, nearly 1 year ago http://t.co/LSrbDAYaAy Before the red planet, there may have been the red and blue planet. http://t.co/G0Mi8cCx07 http://t.co/dzQRTQxbm4 Rising from the fog: Beginning of Sunday's #Falcon9 launch of 2 communications satellites https://t.co/kuEkEmgwD4 Happy birthday to Valentina Tereshkova, 1st woman in space. We've got a conference rm for you http://t.co/jWXKQU7LQ5 http://t.co/Y8Sa6teBKR RT @NASA: What's our new cover pic? #OTD 1915, NASA's predecessor, NACA, was founded: http://t.co/jhsJUPEN2K #NACA100 http://t.co/t0nkVHIdS5 Last night, #Falcon9 launched 2 all-electric communications satellites. http://t.co/zBKWL6eTzV Full update: http://t.co/UVzGNPJLrr 2nd of 2 satellites from tonight's launch being deployed into supersynchronous transfer orbit https://t.co/p0W8L3uGMP 2nd of 2 satellites from tonight's #Falcon9 launch being deployed http://t.co/HKgmSEuVum RT @elonmusk: Both satellites deployed on target. Now firing their ion thrusters to reach geo station over Europe &amp; Asia. The EUTELSAT 115 West B satellite is deployed! The ABS 3A satellite is deployed! #Falcon9 second stage burn 2 is complete Liftoff of #Falcon9 carrying ABS 3A &amp; Eutelsat 115 West B, from LC-40 at Cape Canaveral. http://t.co/N3wI2shT9j Stage separation is complete http://t.co/tdni5406Hi LIFTOFF of #Falcon9 carrying ABS 3A and EUTELSAT 115 West B. http://t.co/tdni5406Hi T-10 minutes to #Falcon9 ABS/Eutelsat-1 launch. http://t.co/tdni53IviI RT @elonmusk: Next landing attempt will be 3rd launch from now. Tonight's flight and following one will not have enough propellant. 3 hours from #Falcon9 launch of 2 communications satellites: ABS 3A &amp; @Eutelsat_SA 115 West B→ http://t.co/tdni5406Hi http://t.co/NDPsXz1uuo RT @BoeingDefense: TODAY: Launch window for all-electric satellite launch w/@SpaceX @Eutelsat_SA = 10:50pm ET. #Falcon9 #letslaunch http://… RT @Eutelsat_SA: EUTELSAT 115 West B ready for launch aboard a #Falcon9 rocket #letslaunch cc @SpaceX http://t.co/CLZzNiF6qk Falcon 9 now vertical in advance of tomorrow night's launch attempt. Launch window opens 10:50pm ET https://t.co/g0t4zPPNsc Another #Dragon spacecraft leaves HQ, on its way to Cape Canaveral. http://t.co/YPHANW8wmc The 100th Merlin 1D engine helped launch #DSCOVR to deep space. From CA → TX → FL → space, it’s had quite the ride. https://t.co/7K2VL3bdaQ Sunset launch of #Falcon9 and #DSCOVR last week (3x speed). https://t.co/so4y78M9ib Relive Wednesday’s sunset launch in photos → http://t.co/TTlXYEaKHV http://t.co/JIOwsPcJGm Re-entry burn with deployed grid fin during today’s #DSCOVR launch seen from top of #Falcon9 first stage. http://t.co/fpkuwLILKa Sunset launch ✓\n#DSCOVR on way to L1 in good health ✓\nFirst deep-space mission for #Falcon9 ✓\nhttp://t.co/REhNnuA0WB http://t.co/bhZx3BiDij RT @NOAASatellites: #DSCOVR: Solar arrays deployed; communicating with ground. It's in good health &amp; on its way to beginning its mission. h… Sunset launch of #Falcon9 #DSCOVR http://t.co/K0awzQN9Jh RT @elonmusk: Rocket soft landed in the ocean within 10m of target &amp; nicely vertical! High probability of good droneship landing in non-sto… #DSCOVR separation confirmed! Liftoff of #Falcon9 carrying #DSCOVR on SpaceX's 1st deep space mission http://t.co/tdni5406Hi http://t.co/Eq9Owo3meW Liftoff!! http://t.co/Z27sW6wGTA T-20 minutes to #DSCOVR launch. #Falcon9 on the launch pad from 52 stories up. http://t.co/tdni5406Hi http://t.co/7yKXSt5rbI RT @elonmusk: Mega storm preventing droneship from remaining on station, so rocket will try to land on water. Survival probability &lt;1%. Targeting 6:03pm ET today for #DSCOVR launch, but extreme weather preventing 1st stage recovery; soft landing only: http://t.co/32eIv4FS90 RT @elonmusk: Coming home http://t.co/FmrmYs6R6V Splashdown of #Dragon in the Pacific from earlier today, carrying about 3,700 lbs of cargo from the @Space_Station. http://t.co/21nFdr4ZqR RT @elonmusk: Dragon splashdown off the California coast http://t.co/4Bvfmei8I3 #Dragon splashdown confirmed! Drogue and main parachutes have deployed, #Dragon minutes from splashdown. Meanwhile, #Dragon is prepping for deorbit burn in ~15 min, headed for the Pacific. Splashdown just before 4:45pm PT/7:45pm ET. RT @elonmusk: Launch postponed to tomorrow due to high winds at the Cape, but Dragon still inbound from orbit in 90 mins #DSCOVR launch is scrubbed for high winds. Next attempt tomorrow Feb. 11, 6:03pm EST. #DSCOVR targeting liftoff @ 6:05pm ET. 1st deep space mission for SpaceX &amp; #Falcon9. http://t.co/tdni53IviI http://t.co/nau8chhVwm RT @elonmusk: Extreme wind shear over Cape Canaveral. Feels like a sledgehammer when supersonic in the vertical. Hoping it changes … #Dragon is released from the space station’s robotic arm. Splashdown into Pacific targeting just before 7:45p ET. http://t.co/7LU6Sonl9N RT @NASA: Live now: Watch coverage of the departure of @SpaceX #Dragon from @Space_Station http://t.co/TZKSZMQKkm http://t.co/Kjc8h7jbGh RT @AstroTerry: #Sunrise on release day for #dragon! http://t.co/FfbAJehJnZ Busy Tuesday: #Dragon loaded w/return cargo, set for Earth return &amp; splashdown in Pacific tmrw just before 4:45pm PT. http://t.co/h8mYbs7TfA #DSCOVR launch now targeted for Tues. 2/10 @ 6:05pm ET; backup on Wed. 2/11 @ 6:03pm ET. http://t.co/tdni53IviI http://t.co/uApOiqD2zg RT @elonmusk: Prob good though. Will give us time to replace 1st stage video transmitter (not needed for launch, but nice to have). RT @elonmusk: Air Force tracking radar went down. Launch postponed to same time tomorrow. Tonight @ 6:10pm ET #Falcon9 targeted to launch #DSCOVR for @NOAA, @NASA &amp; @usairforce. WATCH: http://t.co/tdni5406Hi http://t.co/VMLxH07TbB RT @elonmusk: Rocket reentry will be much tougher this time around due to deep space mission. Almost 2X force and 4X heat. Plenty of hydrau… RT @elonmusk: Launching our 1st deep space mission today. Headed to Earth-Sun L1 gravity null point at 1M miles, 4X further than moon. #Falcon9 is vertical in advance of tonight’s #DSCOVR launch, targeting 6:10pm EST. Watch LIVE: http://t.co/tdni5406Hi http://t.co/CDd5isWc5Y RT @NASA: Watch #DSCOVR, @NOAASatellites space weather mission, briefing at 1pm ET: http://t.co/KX5g7zfYQe  Q? Use #askDSCOVR. http://t.co/… Come for a #Dragon, stay for a rocket launch: 1st private spacecraft to visit ISS is @ExploreSpaceKSC this weekend http://t.co/V9VOzTaeBE Congrats to student winners of @K12FutureE contest to design a part to be 3D printed in space! http://t.co/tnFY7VsBXp http://t.co/u5gxFvyXLu America’s next gen crewed spacecraft is almost ready for a test flight. Pad abort vehicle shipping to FL shortly. http://t.co/XECNoq3MYH RT @elonmusk: Painting the name on the droneship ... http://t.co/X8R8O4KjPx RT @NASA: Today #NASARemembers those who gave their lives to push the boundaries of human achievement: http://t.co/NxJcEfQzJ5 http://t.co/j… Major test of Crew Dragon’s abort capabilities coming up—first look at the pad abort vehicle. http://t.co/xmYvUvwjX5 Updated animation of Falcon Heavy flight and booster recovery. Check it out: http://t.co/Y4OvdU8yQ5 http://t.co/LN7yRVAvkT Dragon-spotting: 250 miles above Earth at the @Space_Station http://t.co/QITUHoYJVW RT @NASA: LIVE: @Commercial_Crew update briefing w/ @BoeingDefense &amp; @SpaceX. Watch: http://t.co/KX5g7zxzYi \n\nQ? Use #askNASA http://t.co/k… Work toward launching U.S. astronauts in 2017 is well underway. Live update w/ @NASA: http://t.co/ziqKGYKNEV http://t.co/7j5DOp9KSA Full functionality of Crew Dragon's SuperDraco jetpacks demonstrated with hotfire test in McGregor, TX. https://t.co/KfiyBkfR0V RT @AstroTerry: Captured #Dragon being maneuvered by #Canadarm2 last week prior to docking with the #ISS https://t.co/rzPYKF4lu3 Happy 85th birthday, Dr. Aldrin. Hope you don’t mind we named one of our conference rooms after you, @TheRealBuzz http://t.co/KS4ay3rBbe RT @elonmusk: The universe is really, really big \n\nhttps://t.co/4j3jvIaqpe RT @museumofflight: Dragon is big! Here through Monday. Welcome SpaceX to Seattle! http://t.co/13BBqlRW7g See first #Dragon to visit the @Space_Station now @MuseumOfFlight:\nToday ✓\nTomorrow ✓\nMonday ✓\nhttp://t.co/PutchI5d1W http://t.co/FIQaarFG1M Close, but no cigar. This time. https://t.co/JowUE6a1D7 Catch #Dragon at the Seattle @MuseumOfFlight this weekend, Jan 17 – 19. http://t.co/utJRi0HYfJ http://t.co/v2yqvMXbfA RT @Space_Station: &gt;@SpaceX #Dragon open for business at #ISS. #Exp42 unloads and sets up new research... http://t.co/koPy17SEA3 http://t.c… RT @NASA: \"We kicked off the New Year in a spectacular way\" - Admin Bolden on commercial space: http://t.co/YkxCldcM5N http://t.co/Qco3mjzH… As 1 #Dragon flies, another visits Seattle's @museumofflight. See 1st private spacecraft to visit the #ISS Jan. 15-17 http://t.co/mCuEcwdaHp Dragon is now attached and bolted to ISS, where it will remain for the next four weeks. http://t.co/tT1zeyVjuM At 5:54am ET, Dragon is grappled by the ISS! Next, attachment to station in ~2 hrs. http://t.co/6Db27OEotr http://t.co/ucsMzfAg6S Dragon now on final approach to ISS, prepped for an early grapple in the next few min. Live: http://t.co/6Db27OEotr http://t.co/xDL8zGbVBE RT @AstroSamantha: Good night from #space! #Dragon is getting closer, capture tomorrow. Buona notte! Domani cattura di Dragon. http://t.co/… RT @elonmusk: Yesterday's mission to the Space Station lights up the cloudy night sky of Cape Canaveral http://t.co/DFB742HaQt RT @elonmusk: @alankerlin Hydraulics are usually closed, but that adds mass vs short acting open systems. F9 fins only work for 4 mins. We … RT @elonmusk: Upcoming flight already has 50% more hydraulic fluid, so should have plenty of margin for landing attempt next month. RT @elonmusk: Grid fins worked extremely well from hypersonic velocity to subsonic, but ran out of hydraulic fluid right before landing. SpaceX launches fifth official mission to resupply the International Space Station: http://t.co/tETeK1TW7s http://t.co/5JB8bsoUqy RT @elonmusk: Didn't get good landing/impact video. Pitch dark and foggy. Will piece it together from telemetry and ... actual pieces. RT @elonmusk: Ship itself is fine. Some of the support equipment on the deck will need to be replaced... RT @elonmusk: Rocket made it to drone spaceport ship, but landed hard. Close, but no cigar this time. Bodes well for the future tho. [PHOTO] Liftoff of Falcon 9 &amp; Dragon on SpaceX's fifth official mission to resupply the space station. http://t.co/HPU3LOydDZ RT @elonmusk: Ascent phase good. Dragon deployed to Space Station rendezvous orbit. Dragon's solar arrays have deployed! Liftoff!!! http://t.co/tdni54hHPm RT @NASA: The @SpaceX #ISScargo mission is loaded w/ 5,108 pounds of food, water &amp; clothing for astronauts plus @ISS_Research http://t.co/E… T-30 min to Falcon 9 and Dragon launch. Live launch webcast: http://t.co/tdni54hHPm http://t.co/7qRCYxBJkd RT @elonmusk: At mission control in California. Launch in 60 mins. Looks good so far. F9 &amp; Dragon now vertical on the launch pad. Liftoff @ 4:47am ET. Live launch webcast: http://t.co/6Db27OEotr http://t.co/fSAjzBu7Mc Weather is currently 80% “go” for F9 &amp; Dragon’s launch attempt tomorrow. Liftoff @ 4:47am ET – set your alarms! http://t.co/Z2k5a72F1P RT @NASA: Latest weather update for Saturday's 4:47am ET @SpaceX #ISScargo mission launch is 80% 'go' http://t.co/4pkHhlU4ln RT @NASA: .@SpaceX selects Sat., Jan 10 at 4:47a ET to launch #ISScargo mission to the @Space_Station: http://t.co/wX1aF5huOT http://t.co/W… Ah yes, the “Bird 9”. Meet our rocket: http://t.co/uwkUzq6LBM http://t.co/FiJfRA1I43 RT @elonmusk: Need to investigate the upper stage Z actuator. Was behaving strangely. Next launch attempt on Friday at 5am. Launch is scrubbed for today and we are now targeting launch on Jan. 9th at 5:09am ET. http://t.co/hniEJZVl4k T-60 min to launch. Live stream: http://t.co/tdni54hHPm http://t.co/HL4KhjwQNf RT @NASA: Weather for today’s @SpaceX #ISScargo launch has improved to 90% “go,” with a slight chance of violating the thick cloud rule. F9 &amp; Dragon are vertical in advance of tmrw's 6:20am ET @NASA launch. Live launch webcast: http://t.co/tdni54hHPm http://t.co/BizeveNesz RT @elonmusk: Taking questions now at http://t.co/CpOyWeAk0G RT @elonmusk: Background on our attempt to land Falcon 9 rocket on a station-keeping drone ship in the Atlantic http://t.co/yklReEpZO3 RT @NASA: At 4:00pm ET: Learn about tomorrow's @SpaceX launch to @Space_Station: http://t.co/uG9ElHKmaB\n\nQ's? Use #askNASA http://t.co/xhRS… RT @elonmusk: Drone spaceport ship heads to its hold position in the Atlantic to prepare for a rocket landing http://t.co/kXYHGVKTfE RT @elonmusk: Ask me anything at 9pm Florida time (focused on tomorrow's 6am rocket launch) http://t.co/DvCbw4kTJy 2014 included:\n6 Falcon 9 launches ✓\nCrew Dragon unveiling ✓\nSoft landing 1st stage ✓\nHere's to a revolutionary 2015!\nhttp://t.co/TiyJlhvUrk While most of us spent 2014 on Earth, here's what those living in space saw.\n6 months in 6 minutes → http://t.co/bRKovoFpg8 Details on latest milestone w/ @NASA to take American astronauts to space on board Dragon → http://t.co/XO65CkTVI4 http://t.co/phe8HEmmTv Successful static fire test completed today ahead of CRS-5 launch. More on CRS-5: http://t.co/CBT35ge6Wl http://t.co/QVpUohSKGb Transformation complete – the landing leg at SpaceX HQ got a facelift. http://t.co/rarNgWo1CG Just what we always wanted! Rockets &amp; spacecraft throughout history, measured in horses &amp; dogs http://t.co/q7OvTIcIzm http://t.co/gVyBCLLkOP Mission Improbable: Attempting to land a rocket on an autonomous spaceport drone ship. http://t.co/yRdayA0ZLE http://t.co/Xaz5ih8rf2 Chemistry. Sets. On. Mars. @MarsCuriosity measures spiked levels of organic molecules:  http://t.co/0YO6geVehl http://t.co/aEAVU0RbXx RT @NASA: Crew on @Space_Station preps for @SpaceX Dragon and next year’s US #spacewalks: http://t.co/ejcoA307Ed #ISS http://t.co/xSFIS3mG7T RT @Space_Station: #AstroButch w/@AstroSamantha trained Fri to capture @SpaceX #Dragon when it arrives at #ISS... http://t.co/KwE8VHPjWb ht… Next vacation destination? @MarsCuriosity discovers possible evidence of a large, ancient lake on Mars. http://t.co/xP4d7nhnuq 4 years ago today, #Dragon became 1st private spacecraft in history to be recovered from Earth orbit http://t.co/vsybr8VHbV Imagining a future in space? The short film “Wanderers” visualizes what that might look like. http://t.co/LDwxsAm17w http://t.co/Oeo6eGASiX Shopping for #space fans? Now thru 12/31, free beanie w/ $50 purchase at the SpaceX Store. http://t.co/qAfFwBztoC http://t.co/2JELoznGzW We’re thankful to work with the smartest people around, and on the coolest mission on Earth. Happy Thanksgiving! http://t.co/n81vfSCZrH The 1st ever 3-D printer in space – delivered to station this fall by Dragon – just printed its 1st part. http://t.co/CbDvhvGnVX Last night, 3 new crewmembers arrived @ ISS, making 6 total on board. Enjoy the view, Dragon will see you next month! http://t.co/3kE7JMpd1t [GIF] New timelapse of rocket tank construction at SpaceX HQ http://t.co/bFo1VcyJQG SpaceX Pres &amp; COO Gwynne Shotwell talks creativity in business w/ @franklinleonard &amp; @kairyssdal on @Marketplace: http://t.co/IRFTHF29Uv RT @Commercial_Crew: Subsystem reviews, system tests and first steps in CCtCap: find out what @commercial_crew partners accomplished. http:… SpaceX’s Crew Dragon chosen for @PopSci #BestOfWhatsNew Grand Award. http://t.co/kmYWEdMXev http://t.co/5kku05NBsD Congratulations @esa on @Philae2014’s touchdown on comet 67P! #CometLanding Today, we’re celebrating the nearly 500 veterans we call part of the SpaceX family. Happy Veterans Day. http://t.co/MQtn5JZqrn RT @astro_reid: 10 days ago we sent our #Dragon back home to @SpaceX.  #SpaceVine #sunrise as it moved into position. https://t.co/mfcnB39c… RT @xprize: “Changing the world for the better is one the greatest things you can do.” - @GwynneShotwell from @SpaceX inspiring young minds… With the most recent ISS resupply mission complete, #Dragon has cumulatively spent over 100 days in space. http://t.co/HOuhZLdd20 ICYMI: We produced our 100th Merlin 1D engine in less than 2 years. http://t.co/4voI9VOOI4 http://t.co/HR6KnSSG3A [PHOTO] Splashdown! Dragon lands in the Pacific Ocean, carrying 3,276 lbs of cargo &amp; science samples. http://t.co/AZzCFISeDI Splashdown is confirmed! #Dragon landed in the Pacific at approximately 12:38pm PDT. RT @astro_reid: The @SpaceX #Dragon sails over a cloudy #Sidney as it departs the #ISS http://t.co/ypaMndb5cI #Dragon is released from #ISS! http://t.co/wytY3mnBf1 http://t.co/BLYNYV7IEE #Dragon’s departure from #ISS planned for early tomorrow AM – watch LIVE @ 6:30am PT. http://t.co/wytY3mnBf1 http://t.co/8oOyOx9wPq SpaceX's Gwynne Shotwell spoke to women engineers yesterday at @SWEtalk’s #WE14 conference. Full keynote here: http://t.co/Mwh1YDFwm1 RT @astro_reid: Our little #Dragon watches over a nice #sunrise from #ISS http://t.co/oiAzCd2NHc ICYMI: Thermal images of Falcon 9 during reentry and descent captured by @NASA. WATCH: http://t.co/z3RoYi85pK http://t.co/FHWagksqeI RT @elonmusk: Infrared video of Falcon rocket reentry captured by @NASA tracking cameras http://t.co/GQLCFLlrUC Early stage #Dragon in work @SpaceX. One Dragon at station, 8 more getting ready to go! http://t.co/4fMDDS8Ttr While #Dragon is at ISS, @NASA’s RapidScat is removed from Dragon’s trunk. More on RapidScat: http://t.co/wkHkLjHLq1 http://t.co/OB9c4YThm8 RT @MAKERSwomen: Get ready for blast off! Women in Space airs TONIGHT on @PBS at 9/8c #MAKERSfilms trailer here http://t.co/7MD0c5LIqs http…"}