{"tweets": "You all play a part in helping #KhanAcademy achieve our mission (yes, you!). Thank you for your love and support—today and every day. 💘 #ValentinesDay2020 https://t.co/d2SaLzcE84 RT @TeachWithKhan: The teachers of the year are getting a live blackboard lesson from @salkhanacademy. Sal is taking about why building on… RT @TeachWithKhan: Students are reaching college and realizing that the gaps they have accumulated throughout their schooling means they ne… RT @TeachWithKhan: Sal shares the story of how he went from tutoring cousins to posting videos on YouTube to now reaching 94+ million regis… RT @TeachWithKhan: Sal kicks it off asking how many of the teachers of the year use @khanacademy. 🙋‍♀️🙋‍♀️🙋‍♂️ #ntoy20 https://t.co/N0pP9yk… RT @TeachWithKhan: We're gearing up for @salkhanacademy's talk at the @CCSSO National Teacher of the Year event tomorrow morning. Follow us… 👀 Who's spotted this comment? Reply with the link. 😏 https://t.co/qEWaUynRWm Happy International #WomenInScienceDay! 👩🏼‍🔬\n\nDr. Virginia Man-Yee Lee, 2020 @brkthroughprize in Life Sciences winner, shares her advice for #WomenInScience. ⤵️\n\n #WomenInSTEM https://t.co/sdDIDjYmmw Another Monday. Another week to help anyone, anywhere discover their #love for learning. 🌹📚 For free.\n\n💘 Gift the love for learning this #ValentinesDay 👉🏿 https://t.co/SMOQKrZ9uh https://t.co/GQRD3XJYqn 🎉🎂Happy birthday, @AnthonyMaglio4!🎂🎉\nSo, what are the odds that two people in the room share the same birthday??🤔 https://t.co/QN9OiSo2G1 @GH0ST116 Congratulations, @GH0ST116! We're exciting to see where your learning journey takes you. Onward! If you could have anyone dead or alive be your private tutor, who would it be and what would they teach you? 🤔💭\n\n#ThursdayThoughts #Education @a_caldds omg\nthat is really close\n🤣 @a_caldds WHO IS IT???👀 @CateBNine Hi, there. Whoops! We have a Support Team that can assist you! You can submit a ticket here: https://t.co/hnAo7qvy8C Get yourself an organization that can do it all. 😉\n\nNow hiring 👉 https://t.co/cYLeBd6jTU\n\n#dollypartonchallenge #nonprofitjobs #nowhiring https://t.co/cLeIiToL49 @vegasborndawn Start a ticket here and someone will be in touch quickly to help you! https://t.co/hnAo7qvy8C @ijkijKevin Thanks for reaching out. We always appreciate feedback about our product and suggestions for the future. You can submit feedback here: https://t.co/4vtf3MP6tL 🚨🏈 #GameDay Special! 🏈🚨\n\nIf the red team wins today, we'll give away a FREE education! If the other red team wins, we'll also give away a FREE education!\n\nWe just really love giving away free education. ❤️ Everyday. 😎 @VivekNotalive @bigcartel :hearthands: Hey Sal, can fans affect the outcome of a football game? To kick or not to kick? Why throw a spiral? 🏈 You asked, @salkhanacademy answered.\n\nBrush up on your #football knowledge &amp; statistics before Sunday 👉 https://t.co/6T99hGDR0i @MsDuttonTeaches @SchoolFairhope Love it! @TeachWithKhan @MrsMcLoudRI @OfficialSAT @PCTAProvidence Way to go! Best of luck to you and your students 🤩 @technologylaura @TeachWithKhan So happy to hear that you and your students enjoyed the card! Thanks for the shout out 😍 RT @oofitspurva: I love how I never have to say “Mr. Khan” or “Prof. Khan”. It’s simply Sal, like I’m addressing a friend. Learning gets a… High quality science content with virtual simulations for free?👀🆓\n\n@LabXchange + Khan Academy = #ScienceMadePossible\n\nWe're working with @AmgenFoundation and @Harvard to bring you on a science journey ▶️ https://t.co/3dsIMQ1SpX https://t.co/GC0WjUpneC @MsErikaIde Way to go! 🙌🏿 Keep up the great work! #youcanlearnanything It's @CollegeBoard's SAT® Practice Kickoff Week 🤸‍♀️ and we have a lot to celebrate!\n\n🎊 10 million+ signups for Official SAT Practice on Khan Academy\n🥇 Khan Academy = #1 choice for students preparing for the #SAT\n🆓 100% FREE\nLearn more 👉 https://t.co/SS4xBRwJqS https://t.co/6QSLKZPyJg RT @TeachWithKhan: Check out #MAPAccelerator with @salkhanacademy during a free @NWEA webinar on Jan. 30.\n✔️Need differentiation for studen… @Jagmeetsingh13x 😂\nLesson one 👉 https://t.co/nHPJ80uOaK ✨What do you think schools will be teaching in 2050?✨\n\n#EducationDay #FuturesOfEducation #Education @eaopatnmc Hi, there. We have a Support Team that can assist you! You can submit a request here: https://t.co/hnAo7qvy8C RT @TeachWithKhan: \"If I had to pick between an amazing teacher and amazing technology, I’d pick the #teacher every time.\"\n\nHow does #edtec… @GoziePrince7 We added 11 languages in 2019! 🎉You can download the app of the day for FREE!🎉\n \n📲 iOS (https://t.co/9roTzjLWa6) Android (https://t.co/0wnaVTuUFM) 👀 https://t.co/GHzZNKWHIg Ready for the answer? 🧐It's D! @rishit_coder That's correct! 🎊 From grade school to grad school, pre-K to precalculus... Khan Academy has you covered. 😉 https://t.co/z4NW1dwaOD 📚 Happy #NationalBookWeek from the world's largest monastery library! 😍 Where is it? \n \n📘 #NationalBookMonth 📕 #readmore 📙 #books 📗\n\n📸 credit: Jorge Royan https://t.co/MxoRpfhsaz ICYMI: A good Sunday read.⬇️ https://t.co/xDbwRRjO5C ICYMI: Failing is just another word for growing.\n\n#NationalThesaurusDay #ThesaurusDay In one word, what does #education mean to you?\n\n#ThesaurusDay #NationalThesaurusDay #oneword https://t.co/Tpp5lIKzIg Happy birthday to Benjamin Franklin! 🇺🇸 We know him as a Founding Father of the U.S. and man of many talents, but...\n\n❓ Which of the following was NOT on his resume? ❓\n \nCan't wait for the answer? Find out on Khan Academy! ➡️ https://t.co/CfoxZjPq2q RT @NalediM____: @khanacademy this YouTube channel saves my life time and time again. I just watched Sal Khan’s Ted Talk and I’m so motivat… Do you remember your first Laplace Transform? https://t.co/QyfUwUDlxh Khan Academy guy, Sal, that guy on YouTube, the GOAT...\n\nWhatever you call @salkhanacademy, he and the whole Khan Academy team are happy to help! 😉 https://t.co/Rwm50l5ldY @annaisaperson Thanks for reaching out. We always appreciate feedback about our content and suggestions for future content. You can submit feedback here: https://t.co/w9n8KCMKK5 RT @TeachWithKhan: Have a #NewYearsResolution to use Khan Academy more successfully in your classroom?\n\n5 tips from @khanacademy ambassador… 3 tips for #learning from Khan Academy:\n1️⃣ Remember: your brain is like a muscle. It grows from challenging tasks.\n2️⃣ Build a habit of practice.\n3️⃣ Review the answers to questions you miss.\n\nMore tips ➡️ https://t.co/Q1cDfr08lK\n#MondayMotivation #2020goals @rerinarisasiii Our support team can help! https://t.co/D9xiuCZlbD @_TinaD Weekend plans? https://t.co/5jGNBF9ePN Khan Academy.\nMaking coding fun and easy.\nFor free for anyone, anywhere.😅 https://t.co/clXeJI3v5b @MsSeaman3 Thanks for your inquiry. You can learn more about accessibility settings on Khan Academy here: https://t.co/SCZBCyoHBQ 😫Broken link for Android. Correction: https://t.co/0wnaVTuUFM Have you tried Khan Academy's mobile #app yet? All the free, world-class education you love, on the go! 🏃‍♀️\n\n#ICYMI: We added 11 languages to the app in 2019! 🎊 The latest? Korean 🇰🇷 and Serbian 🇷🇸\n\n📲 iOS (https://t.co/9roTzk3xyG) Android (https://t.co/6uBu3d0Hkl) https://t.co/QRF1MFpQck Happy birthday to the late, great #StephenHawking 💜🌌 What do you think he meant by this #quote?\n\n#wenesdaywisdom #physics #cosmology https://t.co/QnquPxoDod @mcfixelton Thanks for recommending @khanacademykids! ✨THANK YOU✨ for joining our #AllinforEducation campaign and helping us reach our 2019 fundraising goal! 🎉😍\n\nWith your help, Khan Academy can provide more free, world-class education in 2020 and beyond. 💗🆓🌏🎓 Onward! https://t.co/VnjicuVymX @igama Happy to hear it! +@khanacademykids 😍 @MrsKDeLeo Great tip, @MrsKDeLeo 😍 \n\nP.S. To share tips with our community of Khan Academy teachers, consider joining @TeachWithKhan on Twitter and Facebook! #MondayMotivation from singer @johnlegend:\nTalent is not fixed. Success comes through effort. 💪🏿💯 #growthmindset #youcanlearnanything https://t.co/tq1RMKQuTQ @Humit14 Check it out here! https://t.co/0JdxN3mlAd @AlineHB1 We have plenty of courses in both math and physics! @Arkady_Ast Check out our physics content: https://t.co/Iq9FyXuzU4 @Hitler94948194 We have all of that! @StanMovie Check out our free Grammar and Storytelling courses! https://t.co/S15w8nn759 @NWHusain Thermodynamics: https://t.co/9XGQl8dJlI\nOrganic Chemistry: https://t.co/FEwsxkrEH0 RT @TeachWithKhan: #️⃣1️⃣ \"Teachers are the unwavering center of schooling and we should continue to learn from them every day.\"\n\nRead more… @brndnmcbrd It looks like this form is most relevant to you. Our support team responds quickly. https://t.co/3xeCglCR2X @brndnmcbrd Hi, there. We'd be happy to help you with this. We have a Support Team that can assist you! You can submit a request here: https://t.co/hnAo7qvy8C What do you want to learn in 2020? 👀\n\n#2020goals #NewYears #NewYearsResolution #YouCanLearnAnything 🚨LAST CHANCE🚨 to go #AllinforEducation!\n\nPropel us into 2020 during the final hours of Khan Academy's 2019 fundraiser. All gifts will be doubled! ➡️ https://t.co/rdJoSGog9T https://t.co/j4dSfaezsy We know what our #NewYears Resolution will be: 🆓🌏🎓\n\nHelp make education for everyone a reality. Final day to join Khan Academy in going #AllinforEducation 👉 https://t.co/rdJoSGog9T https://t.co/5thLSZtY6m @MantheR_Panth3R Hi, there. We'd be happy to help you with this. We have a Support Team that can assist you! You can submit a request here: https://t.co/hnAo7qvy8C Have you gone #AllinforEducation yet? TWO days left to join @salkhanacademy's 2019 fundraiser for Khan Academy 💝➡️ https://t.co/rdJoSGog9T\n\n🌟All gifts are tax-deductible and will be matched!🌟 https://t.co/rNkVilno8R @Notbuyingthisbs Thank you for joining us in going #AllinforEducation! We really appreciate your support. 📢 Final 3️⃣ days to make a difference in a learner's life!\n\nAll gifts are tax-deductible and will be matched! Go #AllinforEducation and support Khan Academy today 👉 https://t.co/rdJoSGog9T https://t.co/n0r2yDe8a7 \"Access to education should be a basic human right.\" -Sal Khan, founder of Khan Academy\n\nHelp Khan Academy provide a free, world-class education to anyone, anywhere. 🎓 Send your tax-deductible gift today ➡️ https://t.co/5wUZvtzYvX https://t.co/NU4QaRJBwU @SporeEvelyn That's how we handle our contact requests. It's the best option - it will get you re-routed to the appropriate staff person. @SporeEvelyn You can reach out to our support team and they can help you: https://t.co/hnAo7qvy8C @SporeEvelyn Hi Evelyn - you can take a look at our current job openings on our Careers page: https://t.co/7LtyTpjwBg With Khan Academy, he went from zero to college-level math comprehension in a little over one year.🚀🙌 https://t.co/rdxN8qgw0b @ChidinmaKO Thank you for going #AllinforEducation and supporting Khan Academy! @wildestsage Happy to hear that she's loving @khanacademykids! Khan Academy relies on support from people like you. Go #AllinforEducation today to double your impact. ✨Your gift will be matched dollar for dollar!✨\n\n$20 = 60 hours of learning time for your family or someone else in the world. 👉 https://t.co/YUedz53aJ0 https://t.co/TO2BIAXVNV RT @TeachWithKhan: They even have the same shirt! 🤣\n\nSal isn't *just* the #BobRoss for math! He helps with those happy little accidents in… @rohitsm Thank you for your support! @gmartinstrends Thank you for your support! Jason spent 15 years in prison. He's now a student at Stanford. He unlocked his potential using Khan Academy.\n\nStories like Jason's are why we exist. And they're only possible thanks to support from people like you. Go #AllinforEducation and give today 👉 https://t.co/YUedz53aJ0 https://t.co/bZpXr0ilFm @StanMovie Thank you for sending a gift! Please send checks to the following address:\nKhan Academy\nP.O. Box 1630\nMountain View CA 94042\nMore information about mailing checks here: https://t.co/zevPaGOFuL\nThank you for going #AllInForEducation! @DChappellAssoc Thank you for going #AllinforEducation! @drstoyanpavlov Thank you for going #AllinforEducation! @kissgyorgy Thank you for going #AllinforEducation! @arv_r Thank you for supporting Khan Academy! @myroah Thank you for going #AllInForEducation @gregseeds Amazing. 🙌 Thanks for going #AllinforEducation Claudia, a teacher in rural Brazil, knows that Khan Academy works. Find out how her school went from falling behind in math to exceeding state goals 3 years ahead of schedule 👉 https://t.co/YLvakrc6sH\n\nFrom Brazil to India to all around the world, we are #AllInForEducation. How does a pound of apples turn into a kilo of mangoes? 🤔\n\nLearn about #localization vs. #translation and our recent Langauge Advocates Convention at HQ. ➡️ https://t.co/341S1iwmUY 🌎🌏🌍 https://t.co/Kmtim9BPo2 In 10 years, we've grown from one student (Sal's cousin Nadia) to a #nonprofit with 90 million users in 190 countries.🙌\n\nWith support from people like you, imagine what Khan Academy can do in the next 10 years.✨Let's go #AllInForEducation!\n\nGive today: https://t.co/YUedz53aJ0 https://t.co/oExj2QVUps @S_capereality @Wikipedia Thank you for supporting Khan Academy! @vijayrajanna Thank you for going #AllinforEducation! @edappadvice Thanks for highlighting @khanacademykids! ✨When you support Khan Academy, you make billions of minutes of free learning possible.✨\n\nJoin us as we go #AllInForEducation!\n\nGive the gift of a free, world-class education ➡️ https://t.co/yAT7Ww3vRl https://t.co/CCXS1ERKaw So, you want to learn to code for free? #KhanAcademy is here for you. Coding for free was one of the top trending \"learn to\" @Google searches for 2019! #Google #YearInSearch https://t.co/FbWdaVsiBj Doing some holiday shopping this weekend?🙋\nKhan Academy's content team is sharing their favorite fun AND educational gifts for learners of all ages.✨\nAdd these to your list!🎁👇\nhttps://t.co/oixRAKSbJF https://t.co/01Ec7LV2xw @piss42069 It certainly won't come to that! Thank you for sharing your story and for going #AllinforEducation! RT @TeachWithKhan: 😍 Just one of many success stories of aspiring #teachers who passed the Praxis® with Khan Academy. Check out our 100% fr… RT @khanacademykids: https://t.co/eovVFR92hT @jemahla13 So glad to hear it! Thanks for sharing 🤗 @khanacademykids @davidsmosspiggy Thank you for supporting our mission! #AllinforEducation @labjorn Thank you for your contribution! #AllinforEducation @sakthivelKG Thank you for going #AllinforEducation! @MeoWtalisK @Burnedgoat @CaerwynLZ Happy to help! @nvictorme Thank you for your contribution! @ShirleyHung4 @salkhanacademy @MIT @YouTube Thank you! @JaiLakshmanOrg Thank you! @annahyyy_ 🥰🥰🥰 @pjmjhk_ 🙌🙌🙌 @Atmvn Thank you for your support! @greghohman Thank you for your support! @ScanlanSTEM @StoughtonPS @codeorg Awesome!@teachwithkhan @tamtaentotaem Thank you for your support! @SanghaviShruti @MasonMathEd Thank you so much! #AllinforEducation @CoachTheron Thank you so much! @madhu_pandiyan Thank you! As a #nonprofit, we depend on donations. Help keep Khan Academy free for learners and teachers everywhere. Send your gift today ➡️ https://t.co/i9gKFu0JaO\n\n#AllinforEducation #GivingWeek 💝 https://t.co/dWlmq05vl3 @NicoleDrago3 Good luck, Nicole! You got this. Just remember - #YouCanLearnAnything 🚀 @PTA_Daddy hopefully it was just a mistake - did you ask for a correct link? @jgquinton @Wikipedia Thank you so much for going #AllinforEducation again this year! @SilverVanus Thank you! @PTA_Daddy We don't have support staff on our social team. Choose any category and you'll get a swift response. @PTA_Daddy Hi, there. We'd be happy to help you with this. We have a Support Team that can assist you! You can submit a request here: https://t.co/hnAo7qvy8C #HourofCode is here! 👩‍💻 Are you joining the millions worldwide learning #computerscience? #CSforGood\n\n3️⃣ ways to learn on Khan Academy:\n🎨 Hour of Drawing w/ Code #javascript\n🖥️ Hour of Webpages #html #css\n📊 Hour of Databases #sql\n\nhttps://t.co/qFy2aqE7Fw https://t.co/USlkVKQskR \"I have all of humanity's knowledge to explore and unlimited possibilities for enlightenment.\" -Marge Simpson\n\nMaybe Khan Academy will make an appearance on #TheSimpsons again next week 🤣 https://t.co/0iWlDvyaX8 @alkire14 Oh that sounds like a bug! Sorry you're having problems. We have a Support Team that can assist you. You can submit a request here: https://t.co/hnAo7qvy8C RT @khanacademykids: Winter has arrived at Khan Academy Kids! Update the app to find twinkling lights, falling snow, and the Khan Kids crew… @dipsy2580 Thank you for your support! Yes, we accept checks, wire transfers, bitcoin, etc. The options are all listed out here (scroll down to the FAQs section): https://t.co/zevPaGOFuL @alkire14 Please click the x button in the top right of the screen and it will not show again. Thank you, @SusanWojcicki, for highlighting our #AllInForEducation fundraising campaign! Learn more about how you can support our mission of proving a free world-class education to anyone, anywhere ➡️ https://t.co/4I09WBWKEC https://t.co/tQ27DUgHpi @GreenFlyFlowers 😂😂😂 @Erikleo8 It's up to interpretation! To make the equation more clear, additional parentheses could/should be used :) 8 ➗ 2(2 ➕ 2)  = ❔ The viral #math equation that baffled the Internet this year. Who can solve it? Sal Khan can.\n\nSal solved it in this week's livestream as a ✨THANK YOU✨ for helping us reach our #GivingTuesday fundraising goal! Thank you for going #AllinforEducation. 💝 https://t.co/eBf7KPoEcY @granttlucas Thank you for going #AllinforEducation and for sharing your story! RT @TeachWithKhan: Are you new to using @khanacademy in the classroom?🆕\nOr do you know a teacher who is?\nWe are here for all of your newbie… @allankellynet Thank you for your contribution! @melissa_aybar Thank you!! @Dumb48 Hi there, thanks for your message! At the moment, @khanacademykids is only available in English. All of https://t.co/s6M9FgMhT8 is available in German, however! @ashleydavis75 Thank you for going #AllinforEducation! @TMayBain Thank you so much! @HyunseokOh Thank you so much! @NewThinkTank Thank you so much! @jamiezvirzdin Thank you so much! @MicheleWQ Thank you so much! @holmy42 Thank you so much! @GODwantstosaveU Thank you so much! @nana_hackett Thank you! @charles_dujon Thank you!! @Daniel_C_Smith Thank you so much! @mtom827 Thank you so much! @wenders1022 Thank you! @EZaoutis Thank you! @Verons914 Thank you for going #AllinforEducation! Learn some more ✨interesting✨ facts here about how Sanskrit is connected to Latin, English, and other European languages. --&gt; https://t.co/zxSYfA2acR Sal rolls into holiday parties like 👇 https://t.co/klYNeAJmwd @solvandev I checked with our team about this. Once you close the banner (x in the top right) it won’t appear for you anymore. Thank you for donating!!!🙏 Happy Giving Tuesday! Thank you for supporting Khan Academy, Zainab! 🎊\n\n#GivingTuesday #GivingWeek #AllinforEducation https://t.co/OX3ea6AvNk @ShesKraftyy @eHillel Looks great! Congratulations :D @TeachWithKhan @MyPrivateProf @salkhanacademy Thank you for going #AllinforEducation with us! @RKzoy Thank you so much! @hiheal Thank you for supporting us! @jonsagara Sorry to see this issue - thanks for flagging. And thank you for supporting us! @didforsale Thank you for supporting us! @cc56us Thank you for supporting us! @pavel_shvetsov Thank you! @iamjenmcconnell Thank you so much! @Zhaoyu17 Thank you so much! @DFestering Thank you so much! @oofitspurva Haha love this! 😂 You're very welcome! @DiptarshiC Thank you so much for support Khan Academy! We appreciate your contribution 🤩 #GivingTuesday livestream with Sal Khan starts in 1 HOUR! Are you #AllinforEducation? 🎓\n\nJoin us on Khan Academy's Facebook or YouTube channel 👉https://t.co/GPihtW8CbF @KaelynBrown5 🤣🤣🤣 Maybe? @brunettesgf 🤣🤣🤣 📢 Livestream with @salkhanacademy TOMORROW! 👉 https://t.co/GPihtWqdAf\n\nJoin us on Khan Academy's Facebook &amp; help us reach our $5K #GivingTuesday goal! All gifts will be matched dollar for dollar. 💝 Let's keep Khan Academy free for years to come. #AllinforEducation https://t.co/twYqtxC9ja 258 million children worldwide lack access to school. Help Khan Academy fix that with a one-time or monthly donation. 💝➡️ https://t.co/i9gKFu0JaO\n\nTogether, we are #AllinforEducation. ✨ #education #nonprofit https://t.co/MPj5jrCPuh @NWHusain 🙏😍 we're here for YOU! @_Wilz21 Merci! Happy #Thanksgiving, from Sal and all of us at Khan Academy!🦃 \nThank you for supporting our bold mission of providing a free, world-class education for anyone, anywhere.🙏 \nTogether, we are #AllInForEducation.✨ https://t.co/3uNcs7TFfc 😍 Thanksgiving gratitude warming our hearts today 😍\n\nThank you for sharing your story, @kellyfj1 - we're honored to help! #HappyThanksgiving, all! https://t.co/2RULvrVuet @LodiSafiq At the moment, only purchases through https://t.co/Gs9uyDXOiF can contribute to Khan Academy. Thanks for asking! @RobynJaneSM Thanks for your message! You should be able to rewatch videos as many times as you like! If this problem continues for you, our Support Team is here to help you: https://t.co/hnAo7qvy8C @MrsDiscoSB Thank you! Looking for an easy way to give back to Khan Academy? 🎁\n1️⃣ Shop on https://t.co/rIHTgfoAob\n2️⃣ Make Khan Academy your charitable org\n3️⃣ 0.5% of purchases = donated to Khan Academy\n\nStart supporting today👉 https://t.co/4vLgHt1aau\n\n#AllinforEducation https://t.co/G9bIrDx3xx @LimericSSB 🙌🙌🙌 @musaabaqo Thank you very much! Got 20 minutes?\n\nIn the 🆕 @CBSThisMorning podcast, @salkhanacademy discusses:\n🏫 Challenges in US public #education\n🙌 Student motivation\n💰 School funding\n💜 Khan Academy's social impact\n\nhttps://t.co/PUsA9O5gaa @KinderKollegePS Congratulations!! 🎉💯 @TraciPiltz @duckduckmoose Happy to hear you're enjoying @khanacademykids! 🎉 What we're smiling at today: 😍🙌🏽 #FridayFeeling @PittsburgUSD https://t.co/b0VM1iDDRv @s_arjun Thank you! @JHawvermale Thank you, Jim! RT @TeachWithKhan: What are your plans for #HourofCode 2019 (Dec 9-15)?\n3️⃣ ways to get your Ss excited about #computerscience:\n🎨 Hour of D… @StevenLeiva1 Thanks for considering a gift, @StevenLeiva1! You can find all the details of how to make a contribution here: https://t.co/zevPaGOFuL \nThanks again! @MatthewAirey3 Hi there! Our Support Team will be able to help you out with this: https://t.co/hnAo7qvy8C\n\nP.S. Have you joined the @TeachWithKhan community on Twitter and Facebook? @TylerLFenton Good question! We're continually producing new content for our users - we'd suggest adding this idea to the content request thread here: https://t.co/w9n8KCMKK5 @CK_826 Hi there, thanks for your input! We'd suggest adding this to the content request thread here: https://t.co/w9n8KCMKK5 🚨 New podcast alert! 🚨 https://t.co/kGZD4ofo2N @boncbren Thank you! ❤️ @DEFCESCO 👏👏👏 #Youcanlearnanything! @imGvsp @betterschoolng You're very welcome! Happy #WorldChildrensDay ❤️ @WavezLearning 🤣🤣Well, that is Salman Khan! (You know, the *other* Salman Khan) @PraQueBhaskara Thanks for letting us know! @mathconfidence @salkhanacademy 🙌🙌🙌 RT @khanacademykids: Nothing makes us happier than seeing children enjoy learning. To all of the parents and teachers who are sharing these… RT @MamaMayham: My 9 year old is sick and decided to spend his weekend learning higher levels of math and science on @khanacademy.  Right n… @sjfbo Best of luck to you! Let us know how it goes 🤗 @Nabows Thank you! #TuesdayMotivation from Kiran Mazumdar-Shaw, Indian biotech entrepreneur. Happy #EntrepreneursDay!\n\n#tuesdaythoughts #womeninbusiness #STEM #entrepreneur #growthmindset https://t.co/KW9BjDLNbw RT @cultofpedagogy: How Khan Academy is Bringing Mastery Learning to the Masses\nInterview with @khanacademy \nhttps://t.co/5Q1Wt11qHK\n#diffe… @Ember_totoro23 🙌🙌 Enjoy the history courses! #youcanlearnanything #educationforall @CElmhorst89 ✅ Best of luck to you! Let us know how it goes 😁 @JamieLOsborne @GivingTuesday 👏👏👏 Yes! @ShaneHenrik Thank you! 🎉 @AlmakalehWais 🤩🤩🤩 @Ineedhe18050811 Boom! -&gt; https://t.co/Iq9FyXuzU4\nP.S. We also have AP Physics 1 &amp; 2 courses :) @MamaMayham 👏👏👏 Keep going, keep growing! @bluedot113 Thank you! @mckmacpattywack Thanks for your request! Feel free to add it to our Help Center thread for new content requests :) \nhttps://t.co/w9n8KCMKK5 Have you heard the term \"secondary trauma\" before?\n\n9th-grade teacher, Sydney Jensen, shares ways schools can support everyone's #mentalhealth.\n@TEDTalks #TED #edchat  \nhttps://t.co/j1GlxOxKHb RT @TeachWithKhan: Teachers: how did you study for the #Praxis?\n\nAspiring #teachers can now prepare with ⭐️Official Praxis Core Prep⭐️ on K… @JAGSGIRL904 Thank you! Khan Academy is a #nonprofit with a bold mission. What inspires you to support our work?\n\nSubmit your story to the #MyGivingStory contest for a chance to help Khan Academy ✨WIN✨ up to $10,000! ⤵️\nhttps://t.co/EuytVo0pOO\n\n#NationalPhilanthropyDay #GivingTuesday @GivingTuesday https://t.co/ZW9AVtzkXt @goodmanre03 👏You're welcome! Jason spent 15 years in jail. While there, he started learning math from transcripts of Khan Academy videos that his mom printed for him. He now studies computer science at Stanford. #youcanlearnanything https://t.co/ZPokD2BwGn Happy #WorldKindnessDay from Khan Academy and @khanacademykids! ☺️💗 https://t.co/0Q2O9iogV2 @r0salynd 👋 Hi @r0salynd, sorry to hear that you're having trouble with downloading our videos. This function is supported in our mobile app! Here's our Help Center page about downloading videos and other ways to use Khan Academy without internet connection: https://t.co/dluzcD1RRT @esoluisitohtx https://t.co/eZo1RjLNDc &lt;--- BOOM! A full unit on #personalfinance including taxes, insurance, saving, investing, and more! @KateLovesCake45 😂GOOD thing the world will never have to find out! @addy_bickford ❤❤❤ #Parenting WIN! 🙌 https://t.co/k0JzwbHfpr It's #TalkMoneyWeek, so let's see if @salkhanacademy can answer your burning Qs about 💸\n\nHead to our #personalfinance unit for more lessons from Sal and @BankofAmerica. Learn about investments, loans, paying for college, budgeting, and more! 👉 https://t.co/XwUlBq7PUB https://t.co/Dsv0uGf7j5 @mindfulginge Sounds like a great morning to us! @markpine360 Thanks for the suggestion! You can also add your request to this thread from our Help Center:\nhttps://t.co/w9n8KCMKK5 RT @GH0ST116: Thanks for the shout out, @khanacademy. Your platform and views are something that not only helped me, but are also something… Happy #VeteransDay!\n\nJoshua Carroll, a #veteran, taught himself advanced mathematics from @YouTube (Khan Academy videos included, of course 😉) to achieve his dream of becoming a physicist! 🌌 #youcanlearnanything #growthmindset https://t.co/NRrDA0u6mU @Flipgrid @ccorey223 Such a creative use of  #edtech tools! 🙌🏾 \"This man is the reason I actually got a degree and now work as a scientist!\"\n- u/lazyhazy-sunday \"Some men just want to watch the world learn\"\n- u/ocean365 \"Seriously, this man is an angel. Learned so much from him and he deserves every good thing that goes his way. One of the best humans ever in my book, for real dude. 11/10 dude right there\" \n- u/TamagotchiGraveyard That time when Khan Academy love got 101,000 upvotes on #reddit. 😍\n\nP.S. Check out some of our favorite comments in the thread. ⤵️ https://t.co/PzrbtnqEQl @_ngai_ 🤣🤣 priceless @actualsaavor Anything is possible! Let us know when you do 😉 @mattsporidess 💞💞 Happy to help! Onward! @azlaaaan We're sure you wouldn't be, but we're happy to help however we can! #growthmindset #youcanlearnanything 💞 @aquintanilla05 😂😂😂 @Justice146 You're welcome! Happy to help ☺ @JSpell_C3D @Schlusler @salkhanacademy Thank YOU!! We'll never get tired of this. 🏋🏾 https://t.co/kW2roDgRoA @CalebPahl P.S. We also have a teacher community on Facebook! -&gt; https://t.co/IbGJREoPGZ @CalebPahl Hi there! 👋 Happy to hear that you'll be using Khan Academy with your APUSH students! We have a community on Twitter just for teachers - @TeachWithKhan - where you can get tips and suggestions from fellow educators. We all experience stress. Thankfully, #youcanlearnanything - including stress management. 😌🧘‍♀️\n\n#StressAwarenessDay #mentalhealth\n#mentalhealthawareness https://t.co/CvMIV6YX8c \"The subjects that are now in high schools...were determined in 1890. That was before we had the interstate highway system, knew about DNA, or there was a federal reserve.\"\n@salkhanacademy on shaping #education for today's world, on @FoxBusiness ➡️ https://t.co/9hNWxeiMDx What happens when you join \n@NWEA\n assessment data with the personalized learning of Khan Academy? 🎓⤵️\n\n🎉 MAP Accelerator, our newest #education tool! 🎉 Learn more about this amazing #edtech built to serve amazing #teachers, right here 👉 https://t.co/BrFLUBXIcB https://t.co/eWIY8xyC5M We're so happy to share that the @brkthroughprize junior challenge winner is Jeffrey Chen of Burlingame, CA! We'll share an interview with Jeffrey from the red carpet soon! https://t.co/QoQwQmyVJK \"If you love doing science, just got for it!\"\n-Dr. Virginia Man-Yee Lee, a 2020 @brkthroughprize winner in life sciences https://t.co/52GUHHd4N0 Dr. Xie Chen says to trust yourself. If you like science, trust yourself and go for it! @brkthroughprize #youcanlearnanything https://t.co/5AyFQi9U7k ✨We're here at the @brkthroughprize ceremony, honoring scientists who are answering the most important scientific questions today.✨ https://t.co/NWpOZya6be Know someone taking the #SAT tomorrow? Sal shares his advice for reducing stress the night before a test. 🌝💤\n\nWith more time to study, check out 🆓 Official #SATPrep on #KhanAcademy! 👉 https://t.co/Q7fhdpdAMs ✨\n#testprep #studytips #college @collegeboard https://t.co/TxEbiqJ3Il 🙌 Major props to Aric, senior software (and pumpkin) engineer, for this epic Khan-o'-Lantern! 💯 https://t.co/g9L0HiJip9 Happy #Halloween! 👻🕷️🎃💀🧛‍♀️\n#halloweenhumor #mathjokes #math https://t.co/wL4jioQ61D RT @khanacademykids: We build apps for kids, which means sometimes we get carried away and dress up as our favorite character to reenact th… @spartovi Hi, there. We'd be happy to help you with this. We have a Support Team that can assist you! You can submit a request here: https://t.co/hnAo7qvy8C @RinaldasM @salkhanacademy @euronews Hi - we have courses on personal finance here: https://t.co/eZo1RjLNDc Or did you mean economics? Because we have that too!😏😃 \"Education is the ultimate lifeline. Once you have your base necessities - food, shelter, safety - then education is what allows you to escape from whatever circumstance you might be in.\" \n-@salkhanacademy on @euronews 👉 https://t.co/wxbGCHI4dp https://t.co/ejRZRVl2JQ Who's in charge of the #Internet? 🤔🌐\nA) The government\nB) The people who run the Wi-Fi\nC) Bill Gates\nD) Nobody and/or everybody\nE) Elves 🧝\n\nKhan Academy's Internet 101 course is here to save the day! (📽️ via @codeorg) Happy #InternetDay! ➡️ https://t.co/KsVFbpfyTa https://t.co/n6h19InFaq @johnknightly @BlueJeansNet Thank you! @supernicknf https://t.co/gwCwa95131 @carpetfortwo @mgifford we appreciate that you refer people to us, Kemal! Thank you. We are definitely big in our #a11y testing. Here are some resources about screen readers that work best: https://t.co/cWrDFEUMaT\nAnd what we do to make our content more accessible: https://t.co/NvLAjsMSzA Stories like this remind us of the amazing power of free education. 🆓🎓 How has #education made a difference in your life? #MakeADifferenceDay #edchat #educationforall https://t.co/4N5M5SbIXA What work of #art has changed the way you look at the world?\n\nStart with the basics of #arthistory on Khan Academy to get in the spirit this #InternationalArtistsDay! 😉➡️ https://t.co/gbeFj5w5J1 RT @TeachWithKhan: 📣Big news!📣\nKhan Academy #ELA content is now ✨LIVE✨ on the site!\nThis includes practice exercises for grades 2-8.✍️\nTake… @SwitchSherman Hi Steven. Thanks for the heads up. Would you please submit this to our support team here: https://t.co/hnAo7qvy8C\nThey will be able to get this addressed. @TechRav Hi, there. We'd be happy to help you with this. We have a Support Team that can assist you! You can submit a request here: https://t.co/hnAo7qvy8C Sal had a question for the #HelloFuture2019 attendees.\n\"How many of you have used Khan Academy?\"🤔\nSound on to hear their answer.📣\nExciting to see so many girls pumped up about careers in #STEM!🤩 https://t.co/aeWu9O3Gvt @RogueArtificer We can help you with math! Maybe start with precalculus to make sure you have a good foundation? https://t.co/ZY5BsbgD6U @Tim_storyteller At the moment, Khan Academy doesn't include language-learning courses. What we offer is our educational content translated into various languages (43 on the website and now 12 in the mobile app!). @RogueArtificer The only thing you need to know is that you can learn anything! \nWe're glad you're going to give us a try. What are you looking to brush up on? RT @LAPromiseFund: In 2 days, 5,000 girls will hear from Sal Khan (Founder of @khanacademy) where he will speak about his amazing mission o… @Mk_ImRan007 @AppStore @GooglePlay And a full Khan Academy site in Hindi! https://t.co/JB1GVj7SV5 @Mk_ImRan007 @AppStore @GooglePlay We currently have a Lite version of Khan Academy in Urdu: https://t.co/67q488mVGA @escolapias_mira 😍😍😍¡Muchísimas gracias! 🇧🇬 Наскоро добавихме  нови езика в мобилното си приложение!  Вече #МожешДаНаучишВсичко от джоба си на български , португалски  и китайски ! Можеш да свалиш за Андроид (Google Play) или Епъл (App Store). 🇵🇹 Adicionámos 3 novos idiomas à nossa app para dispositivos móveis!  Agora  #PodesAprenderOQueQuiseres, onde quiseres, em búlgaro , em português europeu  e em chinês ! Encontra-a na App Store ou no Google Play. 🇨🇳 我们刚刚在移动应用软件里添加了  种新的语言！ 现在你可以使用 保加利亚语 ，欧洲葡萄牙语 ，和中文  随时随地 #学习任何内容 ！在苹果软件商店（App Store）或谷歌软件商店（Google Play）里找到它. 🎉 We just added 3️⃣ new languages to our mobile app! 🌏 Now #YouCanLearnAnything on-the-go in Bulgarian 🇧🇬, European Portuguese 🇵🇹, and Simplified Chinese 🇨🇳! Find it in the @AppStore or @GooglePlay 📲\n\nWhich languages would you like to see next? 🧐 https://t.co/pi8Xyhq7F9 Learn @salkhanacademy's tips for reducing test stress 🧘‍♂️ Tip 3️⃣: Keep a bigger perspective.\n\nFind more #studytips and 🆓 Official #SATprep on Khan Academy! 👉 https://t.co/Q7fhdpdAMs https://t.co/qWBHyWPzfJ Learn @salkhanacademy's tips for reducing test stress 🧘‍♂️ Tip 2️⃣: Share your feelings.\n\nFind more #studytips and 🆓 Official #SATprep on Khan Academy! 👉 https://t.co/Q7fhdpdAMs https://t.co/7iTph0vper Learn @salkhanacademy's tips for reducing test stress 🧘‍♂️ Tip 1️⃣: Build a habit of practice. \n\nFind more #studytips and 🆓 Official #SATprep on Khan Academy! 👉 https://t.co/Q7fhdpdAMs https://t.co/9xF9XOk13e @IdanTzurdecker https://t.co/8KkSf82MTy Next week @salkhanacademy\nwill be speaking at #HelloFuture, an event to inspire girls and young people of color to choose careers in #STEM! \nhttps://t.co/z29tSkPYjT RT @TeachWithKhan: Congratulations to @salkhanacademy for being awarded the #PrincessAsturiasAwards for International Cooperation.👏👏👏 https… Sal is speaking now! Tune in live. #PrincessAsturiasAwards https://t.co/vPnAmz3zxo RT @SpainInTheUSA: 🎙 Follow the #PrincessAsturiasAwards live! This year’s laureates include 4 #Americans:\n\n🖊 Writer @sirihustvedt\n🥇 Olympic… You can watch the #PrincessAsturiasAwards ceremony live here on Twitter. https://t.co/4zJmhXJ1NF\n@salkhanacademy is being honored for International Cooperation🎉👏 https://t.co/swOcfiuaug Today @salkhanacademy met with teachers and students in Spain. 🇪🇸 Tomorrow he will accept the  \n#PrincessofAsturiasAwards for International Cooperation from the @fpa.🎉\n#premioprincesadeasturias https://t.co/KPCmyrE1ha @luisberenguer_ Hi Luis - please reach out to our support team. They can let you know if this is an option (and if it isn't, you can request that we make it one!). https://t.co/hnAo7qvy8C You asked, we answered: Sal shares his Top 3 #studytips! 🙌 No matter what you're studying for, remember that #youcandothis! ✨\n\n🙋🏽‍♂️ Looking for free, Official #SATprep? We've got you covered! ➡️ https://t.co/Q7fhdpdAMs\n\n#SAT #testprep #college #education https://t.co/Cz0g0WLisg @JillCouri So sorry to hear this! We definitely don't want you to ditch us. We welcome and appreciate feedback about our content and product. Please share your feedback here: https://t.co/w9n8KCMKK5 😂We've ALL been there. \n\nGood thing 🆓#SAT prep on Khan Academy is here to save y'all next year! 😉👉https://t.co/QXi3x3EIJr\n\n#psatmemes #psats #psat #satprep https://t.co/0Yu1QFDuLA @MsKlovesMATH Hi there! Thanks for reaching out. Would you please share this with our support team? https://t.co/hnAo7qvy8C @salkhanacademy ... Also reflecting on how we at #khanacademy just might have the BEST boss ever 😂 #NationalBossDay @salkhanacademy P.S. - @salkhanacademy is accepting the #PrincessofAsturiasAwards this week in Spain!🎉\nFollow the hashtag for photos and videos.#️⃣📸 How big of a @salkhanacademy fan are you?🤩 See how many of these three facts about Sal you already knew!💭💡\nhttps://t.co/RTQsvaMGWQ @MindsetMath A real-life @LearnStorm board? Yes, please! @TeachWithKhan @MindsetMath This is fantastic! Congrats! @TeachWithKhan ❤️ Shout out received. ❤️ https://t.co/x3N9e8AQ9k @merylaebi 🤣🤣 Can we peep this costume?! The PSAT exams, demystified. ⤵️ (Yes! High schoolers can get ready for the #PSAT on Khan Academy with 🆓 Official #SATprep 👉 https://t.co/QXi3x3Wk81!) #education #college\nhttps://t.co/Z7HsGDEKsZ @PerlaRo09752124 🎁🎂🎉 @hvenburg Love it! @khanacademykids RT @TeachWithKhan: \"The problem is not the textbook. The problem is the children are taught something which is much much too far for them t… I'm:\n⚪️ A Teacher\n⚪️ A Student \n🔘 A Doggo\n\nLooking for:\n⚪️ Inspiration \n⚪️ Help with homework\n🔘 A bandanna to show how much I stan Khan Academy https://t.co/JJa8W9Ed0S @ProfessorXavior Yes! Educators can make a Khan Academy for personalized instruction with students. Learn more here: https://t.co/p2UHgBhWar @TheGN_Tweet You're welcome! 🤣#relatable🤣 https://t.co/986EPqs7xa @msbienaime11 @AVIV51192825 Love this! Happy to see your students getting so excited about #LearnStorm! @Jon_Dog Thanks for the feedback. We have a content request/feedback forum where you can post this if you'd like: https://t.co/w9n8KCMKK5 @tarunaggarwal44 These are great suggestions! We have a content request forum that you can submit your idea to: https://t.co/w9n8KCMKK5 🙌 Retweet if you agree 🙌\n\n👨🏻‍🏫👩🏾‍🏫 #Teachers: want to teach your students that #youcanlearnanything? Enroll in #LearnStorm today to foster a #growthmindset in your classroom! 👉 https://t.co/nLlIbcdxNg https://t.co/pgbN9mOoWR What do #WorldofWarcraft, #Bitcoin, #GoogleSearch, #HarryPotter and #KhanAcademy have in common? 🤔 They've all been ranked in the 50 Most #InfluentialProjects of the past 50 years via @PMInstitute. Learn more ➡️ https://t.co/wZhGJAf0fj https://t.co/1NOPYg2KaM @Sw88tRabbit we got this!💪💪💪 https://t.co/6ShprmHtUj @PharmacistSADA Our support team would be happy to help you with that! Please contact them here: https://t.co/hnAo7qvy8C RT @Touyarokii: @khanacademy I love you and I wouldn’t be able to survive college without you Sal gives a peek behind the curtain at crafting the Khan Academy mission statement, building a #nonprofit from scratch, and the origins of our iconic pen sketch videos. 😏 @BankofAmerica ⤵️ #education #edchat https://t.co/AogI1Vs67e T-11 days until the 2019 #PrincessAsturiasAwards Ceremony in Spain!😆@salkhanacademy will be honored with the 🌏International Cooperation🌎 award. 🏆\n#YouCanLearnAnything https://t.co/Fkdas16Qxo Inhale.💨 Exhale.💨 Breathing seems simple enough, but today's #NobelPrize announcement shows there's still lots to discover!✨ \nWant to learn more about this complex and important process? --&gt; https://t.co/GG1iZ8p4vw @keydemand Thank you!! @zenithneens We don't have a full Envi Sci course yet, but so far we have Ecology and Biodiversity lessons under Biology! https://t.co/B1DQWG1hOJ @SueKinMA Best of luck to you! @salkhanacademy ✨THANK YOU✨ to all the amazing #teachers who inspire lifelong learners 👏🏿every 👏🏿single 👏🏿day! #teachersday \"I wanted to #teach the way I wish that I myself had been taught... I hoped to convey the sheer joy of #learning, the thrill of understanding things about the universe.\"\n-Wise words from @salkhanacademy for #WorldTeachersDay! 👨🏽‍🏫 https://t.co/aWwFP7y18M ⌛ P.S. - There's still time 🕓 to enroll your students in #LearnStorm this year! 👉 https://t.co/nLlIbcdxNg That #fridayfeeling when you level up in #LearnStorm 💪🏼🤸🏾🕺🏻\n\n#Teachers: Keep the 🎆celebration🎆 videos coming! 😍 https://t.co/dWqd2gGPsC @CarterDunst Let us know when you do!! 😆🙌🏾 @MadlingerFRSD @RFIShuskies 😍😍🙌🏽🙌🏽 @mattdotam @corvcreative @SamThoyre @getify @FrontendMasters #youcanlearnanything 🙌🏾🙌🏾🙌🏾 @iahdlmndo 😍😍 Thank you! @sheralynDU Thank you! 💖 Happy Teachers’ Day to all the amazing educators out there 👩🏾‍🏫👨🏻‍🏫 @ATEVirginia Thanks for the shout out! 😁 Happy #PraxisCore studying, all! @msbienaime11 @AVIV51192825 Love to see how excited your students are! 😍 Thanks for sharing! @allisonslattery Thank you! 🤩🤩 @MechlerMrs Thank you! 🤩 @nonprofWHIT 🙌🙌🙌 we can't wait to meet you! @bparkerhouse 😍 Hi #GHC19! Looking for something different?👀\nWe are a nonprofit managed by a VP team that is 2/3 female including our VP of engineering!\nPlus we've got a bold mission that energizes us: provide a free, world-class education to anyone, anywhere.\nVisit us at Booth 578. @BrowdeCarrie Good luck with your learning, Carrie! @tailfinner Check us out at https://t.co/ROy63yrytA! Together #WeWill provide a free, world-class education to anyone, anywhere. Join us! Say hi at #GHC19 Booth 578.\nOur VP of engineering Marta Kosarchyn shares how we stay true to our principles while growing our team. --&gt; https://t.co/gTs0r68usQ https://t.co/4BSFD1Mvx3 Hey!👋 #GHC19 attendees! Want to be a part of a female-led engineering team with a mission that will inspire your best work every day?✨ \nVisit us at Booth 578 to learn about @KhanAcademy, where 35% of our engineering team is female. #womenintech https://t.co/hyij3gkvwH Happy #LGBTHistoryMonth! ❤️🧡💛💚💙💜 Anyone recognize this work from #lgbt artist Felix Gonzalez-Torres? Learn about its message &amp; place in #history on Khan Academy. ➡️ https://t.co/irVhbnI6Zi 🏳️‍🌈 #lgbtq #lgbthistory #arthistory https://t.co/jDWv68IAPs We also want to give a ✨HUGE✨ thank you to the\n✍️ 1,200+ translators making Khan Academy available in\n🗣️ 40+ languages for learners in\n🗺️ 190+ countries! \nAmazing work, #translators! 🤩 Happy #InternationalTranslationDay! Did you know that our language advocates do more than #translate? 😮 They 📢 spread the word about #KhanAcademy around the 🌍, which leads to some incredible stories 😍 like this one from Educare Georgia in Tbilisi 🚵‍♂️⤵️ https://t.co/rQFrw7n0dE @marykaybello Hi Mary - please reach out to our support team who can assist you with this. https://t.co/hnAo7qvy8C @42SiliconValley We ❤️ Anna! @c_mnzs @salkhanacademy Hi Carlos. We appreciate your feedback. Would you please contact our support team so they can address this? https://t.co/hnAo7qvy8C We don't know about you, but we're all for binge watching @TEDTalks on a #Sunday... especially ones that will make us smarter. 🤓 (Why not start with #9? 😉) @BillGates @salkhanacademy \nhttps://t.co/YA9Sjr3Ixo RT @fpa: The founder of @KhanAcademy, Salman Khan, has sent us this message from California inviting school pupils in the Principality of A… @ahdhoz 💻 A good place to start might be the algorithms courses: https://t.co/BULSorsYC2 #FridayFeeling = Motivated 🏋️‍♀️🧠💪 #feelgoodfriday #growthmindset #youcanlearnanything #motivation https://t.co/UiqtCbYis8 If I had an energy point for every time @salkhanacademy was called the #GOAT ... #thursdaythoughts 🐐💭 https://t.co/K2WkZoCjdS @LunaJ_A52 😍that's great!😍 @verrerbit well, have you?😝 @ambermosity you can do this, Chloe!🤗 https://t.co/GDE7TyIaCI \"I grade progress. 🚀 LearnStorm is a good way to differentiate as well as motivate.\" -LaToya Grubbs, middle school math teacher 🍎\n🔁 Retweet if YOU believe in progress 📈 over perfection! 💯\n👨‍🏫 Teachers, find out more about #LearnStorm here ➡️ https://t.co/nLlIbcdxNg https://t.co/loU8vRexi1 \"It is my goal to get to the heart of I-hate-math statements and encourage my district to use strategies that change the mindset of students.\"\n#mathchat #stemchat https://t.co/Pulcnkp8fO Save lives. ➡️ https://t.co/UnduiWhUAJ\nHappy #NationalPunctuationDay! ❔🔣❕ https://t.co/Gu7L2xFVAf @MaggHo1 Thank you! @Squeedeal Thank you! @Iamshanu3 Thank you! @scottdmarquez @LILBTHEBASEDGOD Congrats! 🙌🏽That's🙌🏽what🙌🏽we're🙌🏽talking🙌🏽about! Thank you, @Roymouni 🧡 https://t.co/6Y5UWMjPXI @athimuss Such a great idea! Feel free to submit it to our content request thread here: https://t.co/w9n8KCMKK5 @JeremyMcGintyKY @AlvatonElem Wow, great job! 🎊 Congrats! @pmchandliya Thank you! @NinjatakeoverYT Sorry you're having problems with the site. Can you please let our support team know? https://t.co/hnAo7qvy8C In honor of #HobbitDay, reply and let us know who this is:\n🚴 Sean Astin of #StrangerThings\n💚 Sean Astin of #LordoftheRings\n🏴‍☠️ Sean Astin of the Goonies https://t.co/LDgZclPF3D RT @khanacademykids: Reya is celebrating #InternationalRedPandaDay! Curious about red pandas? 🤔Open #KhanAcademyKids to read the Red Panda… @jnlongaza @UofUHealth https://t.co/ofgTAFH2KL @msbienaime11 Fantastic! @TeachWithKhan 🥳 @marilolis @pictoline 😍😍😍 Hermoso! 🎊 Happy #HispanicHeritageMonth! Anyone recognize this famous mural from Mexico City? 🧐 Find the answer here ➡️ https://t.co/AWHLvg0nIG\n#arthistory #latinamerica #latinoheritagemonth #latinxheritagemonth https://t.co/VVO92e21Zg RT @TeachWithKhan: 🎤#Teachers! Have you signed up for #LearnStorm2019 yet? 😏 Join our #khanchat TODAY at 6pm PST/9pm EST to hear from our A… 📈Students in Long Beach Unified who used Khan Academy gained \"twice the district average on the assessment.\"📈\nCheck out @SaraEFriedman's coverage in @THE_Journal about Khan Academy Districts: https://t.co/t2gH8ws1ul RT @AVIV51192825: GET IT! #LearnStorm is the BEST with @ccorey223 in the building https://t.co/0YIDk2LZv9 @MissBurdiCAC I'm checking for you re: response time. It's a separate team. I'll let you know when I hear back. @MissBurdiCAC Hi Kim! We have a Support Team that can assist you! You can submit a request here: https://t.co/hnAo7qvy8C 📞 Calling all teachers! There’s still time to enroll in #LearnStorm2019 and join the #khanchat 💬 tomorrow! 👇🏾See you there 👋🏾 https://t.co/FBLv1KWtNh 📢 Parents: watching your kids' #screentime? These are the sites &amp; apps meeting the 🆕 standards of online safety. (👀 Check out #3) ➡️ https://t.co/3LD2simYJG @khanacademykids #edtech #freeeducation #parenting @allisonslattery Love this video! 😍 Would you mind if we retweeted on our account? @MechlerMrs Love this video 😍 Would you mind if we retweeted it on our account? @GlamNGaming Thank you! 🥳🥳🎊 @TheNightIsBlue Thank you! 🥳🥳🎊 @annav8307 Thank you! 🥳🥳🎊 @ddevisser Thank you! 🥳🥳🎊 @seaofcells Thank you! 🥳🥳🎊 @sergeyche Thank you! 🥳🥳🎊 @HananMountajy Thank you! 🥳🥳🎊 @ahijjawi Thank you!🥳🎊 @avery_clsss Thank you! 🥳🎊 @those_rimshots 💞💞 We're on board with that! 😎 @boantdake Thank you! 🥳🎊 @Cloud_9Raider Yeeesss! 😆🧠🚀 @salkhanacademy @AmyZada Thank you! 🥳🥳🎊🎊 @lakshminp Thank you! 🥳🥳🎊🎊 @DoinItRight @BeingSalmanKhan Hi there - sorry to hear about this. You can submit a request to our Support Team to get this resolved ASAP: https://t.co/hnAo7qvy8C Raise your hand if you ever told your kid to be more independent. 😝🙋🙋🙋\nHappy #WorkingParentsDay! https://t.co/M75lMUUOY2 @limadeltatango Life long learning ftw! 🙇Thank you for all of your generous donations!🙇 https://t.co/rDGqdffQaF @kalinasae 👏👏👏 🎉 #KhanAcademy Districts is HERE! 🏫\n✅ Easy setup &amp; dedicated support\n✅ In-person #teacher training\n✅ Powerful district &amp; #school reports\nLearn more ➡️ https://t.co/WmERxRJFFD\n\n📽️ @LBSchools superintendent shares the impact of a 2-year pilot in his district ⤵️ https://t.co/Mp4azvuign 🎉 #KhanAcademy Districts is HERE! 🏫\n✅ Easy setup &amp; dedicated support\n✅ In-person #teacher training\n✅ Powerful district &amp; #school reports\nLearn more ➡️ https://t.co/2ji9JaFUg3\n\n📽️ @LBSchools superintendent shares the impact of a 2-year pilot in his district ⤵️ https://t.co/FUJsMUg3jA No shame here... no shame. 😎 https://t.co/f6BX6nGUp2 😆We KHAN relate to this common problem.😆 https://t.co/5VEWHzAGtI Anyone else studying for the #Praxis? 👀 Aspiring teachers can now study with 🆓 Official #PraxisPrep 👨‍🏫🍎 on #KhanAcademy (yes, anywhere, anytime) 👉 https://t.co/56UOEST2Y4 https://t.co/9P4b8CvqQk @mjephd So sorry to hear about this issue - Have you reached out to our Support Team via our Help Center? It's time for the #BreakthroughJuniorChallenge Popular Vote! 👩‍🔬 Watch the challengers' videos in #science and #math then like your favorite to get them to the final round! 🏆 ➡️ https://t.co/0YdwraJnlP\n@brkthroughprize https://t.co/AWCvJ87DYe 🎥 Did you catch @salkhanacademy's interview on @CNBC? Get up to date on 🆕 district partnerships and the future of learning on #KhanAcademy, right here ➡️ https://t.co/Sg1m5u6p1K RT @QuanziV: I don't know what I'd do without @khanacademy . Hadn't touched a math class in 15 years, used Khan to re-learn all the math I… 🙄 When you thought @StarTrek was taking a sudden interest in your boss...🖖 Happy #StarTrekDay! 🖖🌌\n#wrathofkhan #startrek #LLAP https://t.co/ovdgnYwvBe https://t.co/KEDfXFZck1 📚 Happy #NationalReadABookDay from one of the world's dreamiest bookstores! 😍📗🧡📙💙📘 Who knows where to find it? 😏 https://t.co/j9S3ODFRkW @zubatsy Happy to help! Best of luck in your history class! 🤞 @tenchichrono @TyrenePamstein @RightWingWatch Yeah we do! 😁👌 @KyleMasek @Wikipedia 😂😂😂 Why wait until becoming a billionaire? Happy to hear you like our resources! @QuanziV Wow, thanks for sharing your story! We're so happy to be of help 😁 Best of luck! 📣Coming up next week! ⬇️ Tune in for the live tweets of Sal's keynote 👌 https://t.co/hmqBub3jsL @salkhanacademy chats ideas for improving U.S. #education and extended school years in last week's interview with @MariaBartiromo. Find the full video here 👉 https://t.co/w66mKDqgRl @Jamal_Kirk @nowthisnews Exactly! Best of luck with mastering Calc and Stats! 😁🙌 @megthor_ Hi there, thanks for reaching out! We have a Support Team that can help with you out 😁👉 https://t.co/hnAo7qvy8C 🎶 72-year-old Arthur Dubois taught himself how to mix beats on the computer. 😍 We're never too old or too young to learn new things (as long as we stick with it!). 🧠💪 #youcanlearnanything #growthmindset\n📹 via @nowthisnews https://t.co/tzx99ea2Et 📢 #Teachers! Have you signed up for #LearnStorm2019 yet? 😏 Join our free, Fall program and get ready for priceless moments like these. 😍🎉🚀 Enroll your #classroom today! 👉 https://t.co/jimKaBz96x #learnstorm #growthmindset #youcanlearnanything #education https://t.co/BtEq95hTAo Tell us your #SundayThoughts: How has #KhanAcademy impacted your learning? 🤔💭 https://t.co/CoImylgbvN @SuperEbza Yes, we do! You can get started for free here: https://t.co/qOVosRdAmV Weekend vibes 😎 https://t.co/tdSo6EVh06 @violashell You're welcome! Thanks for sharing 😄 @kingfisherontap @_saysan_ @ankurs3thi @3blue1brown Khan Academy is for everyone! No age restrictions in learning 😉 @SallyJustMight https://t.co/QZ0z2fKEIb @SallyJustMight Hi there, sorry to hear you’re having problems with her account. Please reach out to our Support Team via our Help Center! @tisJustDane 😍😍 You’re welcome, and thank you! @QFIntl Looking forward to our partnership! 😄 @jastalkslaw 😂😂 Love it! https://t.co/Mx0PBtlvIk @OfficialSAT Fantastic news! Thanks for sharing 😄 @g_s_nath 👏 Yes! A huge round of applause to our fantastic volunteer translation team! 👏 Hope you enjoy the new #Kannada site! 😄 @coling68 🥰 We're so proud to be a part of your learning journey! Thanks for sharing! @manusban An oldie but a goodie! 😉 📢 Did you hear!? 🎊 Khan Academy just reached 🖐️ 5 MILLION subscribers on #YouTube! 🎆 Our most-watched #video? A simple reminder that #YouCanLearnAnything! 0️⃣➡️💯😍 https://t.co/mE4lQ4EIar 🎉 #KhanAcademy sites in #Kannada 🇮🇳 and #Hungarian 🇭🇺 are now here! Thank you to the ✨amazing✨ volunteer translators who made it happen! 🙌 Learn more about the new sites &amp; how you can become a #translator here 👉 https://t.co/8o4AxfaRUw @GreerJorgia 🤩🤩 You’re welcome! Thanks for studying with Khan and best of luck on the Praxis! 🤞🏽 We're so happy to create amazing #biology content for students and teachers.  Thank you to \n@AmgenFoundation for helping to make it possible. https://t.co/QR9UgPlfFF #WednesdayWisdom from #MLK. 💙 56 years ago #onthisday, Martin Luther King Jr. delivered his \"I Have a Dream\" speech at the March on Washington. 🎙️ #civilrightsmovement #history #martinlutherking #ihaveadream https://t.co/iZX8Fx3bEd RT @hootreading: Read our latest #AppSpotlight to learn all about Khan Academy Kids &amp; its CEO &amp; Co-founder - Caroline Hu Flexer! @khanacade… Trends to keep your eye out for this school year. 👀🏫 #5? More personalized learning! 🎯➡️ https://t.co/vLE7kNY9Lh @runlikejordon 😍 Thanks for the shout-out! Best of luck to you this school year, and keep us updated on your progress! #growthmindset #youcanlearnanything @DNAplays4545 You can submit a request to the Support Team via the Help Center! 👉 https://t.co/hnAo7qN9xc @NKPyo 😍😍 #InternationalDogDay * 😉 At Khan Academy, we believe #dogs can learn anything. 🐶🎓 Happy #NationalDogDay from our pups to yours! 🐕🐾🐩 https://t.co/4zAQ5nXaut @AshnaThapa2 🙌 Love the #growthmindset attitude! Keep it up 😄 @wcsIHScounselor Thanks for the shout-out! Hope these resources can be of value to your students 😃😃 🎉🎉 Sending everyone good vibes for back-to-school! 😄 https://t.co/thMm8lvpVt @danmall @superfriendlyco @AWWWARDS Fantastic! Congratulations and thanks for the amazing work on this 😍 Wondering how to scale your #engineering team? 👨‍💻👩‍💻 Khan Academy's VP of Engineering shares an overlooked strategy that is fueling our growth🌱 while building a happy and productive team. ➡️ https://t.co/u3K3qnBOEQ #YoureOfficiallyOldIf you remember studying for *insert class/exam/life goal here* without Khan Academy. 🚫💻😭 Pajaro Valley Unified is 1 of 5 districts piloting our 🆕 MAP Accelerator tool this school year. 🏫 Learn more about this game-changing partnership with @NWEA here 👉 https://t.co/yU6zMJpHVR Some #WednesdayWisdom from the late, great Maya Angelou this #PoetsDay. ✒️🦋 #growthmindset https://t.co/HzeB4cg8uQ RT @MindsetMath: After only one day of #learnstorm2019 5th grade students reached level 2! Who will take the lead today? What @ehgreenescho… RT @alexprocter101: I am totally obsessed with @khanacademy. Been watching all the videos on Information Theory this morning 🤯🤯 all that kn… @tanakaderoy @JennnaFulks Congratulations! @3xthegiggles @Disney Hot Dog Hills Land? Count us in! @drfranklopez You can find all of our Spanish-language content here: https://t.co/eWAy9WjwHF ✨🎉LearnStorm 2019 is here!🎉✨\n📚Gain skills. 🧠Foster growth mindsets. 🤝Build teamwork. Get ready for a collaborative, tech-enabled storm of learning that gets the whole class involved and celebrating! Enroll in #LearnStorm today! 👉 https://t.co/jRXO67i3Ur https://t.co/gae2ad97u3 This #NationalNonprofitDay, we want to thank you for all your support. 💜 Learn more about how #KhanAcademy has been leveling the playing field in our 2018 Annual Report! 👉 https://t.co/fFhgmfXd0Q #nonprofit #education #freeeducation https://t.co/kDQY2WCk0J 📢 NEW course alert! ✨🏰Imagineering in a Box🏰✨ gives learners a behind-the-scenes look into how #Disney Imagineers create theme parks. Animate characters 🧚‍♀️, develop rides 🎢 and design a theme park of your own! Check it out here 👉 https://t.co/Xx97reZpDf https://t.co/OCPfRjouKk We're excited to share 🌟new🌟 features to help you start the school year strong 💪\n🧠 LearnStorm is coming back!\n📊 Improved teacher &amp; student dashboards\n👨‍🏫 Free Official Praxis® Core Prep\n📚 300+ new videos &amp; 2,000+ new practice questions\n...and more! 🚀 #10YearsofKhan https://t.co/YuGMtJEze2 Did you catch Sal's interview on the #Solvable podcast? 🎙️ Hear his thoughts on how we can tackle one of today's biggest global challenges: providing quality #education to everyone ➡️https://t.co/Mfq6gcJfg1\n#educationforall #freeeducation #edtech https://t.co/I8GW5Lz6Oi 💁 Psst...teachers! Don't miss your chance to ✨WIN✨a special 10-year anniversary class kit prize! 🎁 Head to our Facebook to find out how! 👉 https://t.co/DHKM03Mvm6 🎉 #10YearsofKhan @bfordham Glad you like it! 🏰💫 🎉 Even after #10YearsofKhan, we're still creating more world-class content! 🆓🎓 What's new for #backtoschool?\n✅✨NEW✨ AP Computer Science Principles course\n✅Revamped AP US History &amp; AP Biology content\n✅Math 3, 4, 5 &amp; Algebra 1, 2 now better aligned with school standards https://t.co/gDFdnuJaa8 🎂 Happy birthday, #SteveWozniak!\n☑️ Designed the first #Apple computers 💻\n☑️ Taught computer and technology classes to youth 👨‍💻\n☑️ Growth &gt; Grades advocate 💯\nYeah, that's pretty great in our book! 😍\n#stem #stemeducation #growthmindset #edtech https://t.co/osdrL1UqTg 📢Don't miss out on Official #SATPractice Test Day! ⬇️ Check out our 🆓 practice tests made in partnership with @CollegeBoard!  https://t.co/tpHu3SjszG https://t.co/deKlv2of5c We haven't forgotten about you, books! Today is for you, #books, and all of us who still admire you 📚📙💚 Happy #BookLoversDay! #freeeducation #educationforall https://t.co/IIZ7rpk896 As we celebrate #10YearsofKhan, we want to thank YOU for being part of this journey with us. 💕 A lot has changed in education over the past decade, but one mantra has proven true again and again: #YouCanLearnAnything! 🚀💯 https://t.co/ioiS45fHLf RT @MasalaBai: My 6-year-old: I could watch Salman Khan all day and not be tired\nMe: Wait how do you know who Salman Khan is? Where did you… RT @Preeti00669308: @MasalaBai @khanacademy My son is also a huge fan of Sal Khan...he loves to watch his videos.\nHe calls him Khan uncle. @galyacampano Thank you for your support! We're proud to be a part of your lifelong learning 😃 Did you know that 71 million registered users 👩‍💻👨‍💻 from 190 countries🌍 spent 8 billion minutes ⏳ on Khan Academy in 2018?! That’s equal to 15,216 years.📅  We can do even more this year and for years to come with your help. Give today!👉 https://t.co/RbtRNXrl4F https://t.co/287N7EgK6S Curious what a day in the life of a teacher in rural #Brazil 🇧🇷 looks like? @ToddDiemer of our #userresearch team shares his learnings from a recent trip visiting superstar #khanacademy ambassador, Claudia, in Riolândia. 👉https://t.co/KL9UL7cI6Z #educationforall @aProb_lemSolver @salkhanacademy Thank you for your kinds words! 😍 We couldn't have done it without all of you! 🎉It's our anniversary!🎉 We want to thank our incredible community that has made #10YearsofKhan possible:\n👩‍🏫700K+ teachers helped us reach\n👨‍🎓19 million learners each month, and\n💬1,200+ translators spread content to\n🌍190+ countries \nin dozens of subjects! 🔬🔢🎨🏛️ https://t.co/gvNfGCokhu RT @WilliamsMuchiri: Today I want to sincerely appreciate @khanacademy for all the maths resources they consistently make available. I don'… @meghaoberoi1 Aww, thanks! https://t.co/dnLdMnTvbR Did you see Forbes' \"4 Do-Good Companies That Are Worth Investing In\"? 👀 Hint: #2 is all about free, world-class education for anyone, anywhere.😉 https://t.co/Tso9Y80mZp #ThursdayThoughts from a Praxis instructor about our 🆕 Praxis® Core Prep and leveling the playing field for aspiring teachers. 🎓 Learn more about our ✨free✨ Official Praxis® Core Prep here! 👉 https://t.co/oWbFZfFOKP https://t.co/lSrjeJJRpX 💕😍 All the feels 😍💕 Hold up... Is that @MichelleObama in your profile pic?! We'd like to be best friends with you and everyone else as @pfainstitute too! 😆👯 https://t.co/3DwqNeD0FB @shaktisuite Aww, mom. https://t.co/5HiWD0WvkQ RT @love_bug1129: Wishing I was still at #KhanCon with some amazing Educators collaborating, learning, and having fun together all in the n… @Faith23Garner Hey there friend. Would you mind submitting your Q to https://t.co/34R1QQ3D06 #MondayMotivation from a future teacher who studied with our 🆕 Official Praxis® Core Prep: 👩‍🏫✍️\nLearn more about our free 🆓 Praxis® Core Prep here: https://t.co/oWbFZfFOKP https://t.co/FYuuUB4uBw @labkovski @TeachWithKhan This is fantastic! Thanks for sharing and thank you for joining us at #KhanCon this year! 😃 @mrs_englert @salkhanacademy So happy to see that you had a great time at #KhanCon! Best of luck to you and your students in the upcoming school year!🚀😆 Happy #NationalParentsDay from our team of Khan Academy parents! We know that parents and role models make a huge difference in how children learn, grow and thrive. Way to go, parents! https://t.co/gYE6v54c8k That's a wrap on Day 2 of #KhanCon. Thank you ambassadors--and teachers everywhere--for all that you do. Cheers to the upcoming school year. https://t.co/u3QFDGfyU8 RT @akhilgnair_: Take a moment to think about how hard life would be without @khanacademy... unbelievably hard \"It's so awesome to see kids going from “thinking” to “I got it”. We think you're pretty awesome too Dan. Day 2 of #KhanCon is off to a great start. https://t.co/asbaHKV0A6 Not only do we love teachers, we love their feedback and input in making Khan better. This group is sharing deep thoughts! #KhanCon https://t.co/fyDG4ox7FN #KhanCon begins! We could not be more thrilled to spend the next day with some of the kindest, smartest, and bestest Khan Academy ambassadors and teachers we know. https://t.co/yoVvIQMUna @resignedangel You can learn anything. We're rooting for you. @ccorey223 @MrNumero Get ready for the best Summit ever! #KhanCon The clock is ticking for our @khanacademykids Birthday Giveaway. Don’t miss your chance to win an iPad and other prizes! Enter now: https://t.co/uAffKCQZLR https://t.co/aMBTpp5hNa HUGE NEWS for aspiring teachers! 🍎👨🏻‍🏫📢\nToday we're launching Official Praxis® Core Prep with:\n✅ 1000's of practice questions, tests, videos &amp; tips\n✅ Customized practice recommendations\n✅ Custom practice schedule &amp; reminders\n...all for free! 👉 https://t.co/7iqxLkl9bc https://t.co/pe10XoyUxu Love a good puzzle and a good cause? Check out the link below to get the best of both worlds! https://t.co/9cvjpBkNig @riyakatariax Haha done and done 🙃 We love your work with the PFA Institute by the way! So inspiring! 😍😍 RT @CollegeBoard: #Classof2020: This month is your LAST CHANCE to earn a $500 scholarship for building a college list. Make your list by Ju… The face you make when you think your boss is on the World's Most Admired list, but they're really talking about Salman Khan the actor. \nhttps://t.co/9Ou35P9qxS https://t.co/iAw2E2E8t3 Words of wisdom this #MandelaDay! Nelson Mandela called education \"the great engine of personal development.\" 🚀 He admired its power to create equal opportunities and teach us to love one another. 💚💛❤️\n#mandeladay2019 #actionagainstpoverty #freeeducation #educationforall https://t.co/s1Xsqyjd20 @Arkady_Ast 🥰 Thanks for the donation! We appreciate your support! @JoeyColeman Let us know how you do! Best of luck. A lot has changed for Khan Academy in 10 years, but our dedication to students and teachers never will.  Hear from Sal himself during his chat with @stephenoonoo via @edsurge https://t.co/nZFA54MeBd This #WorldYouthSkillsDay, we want to thank all the teachers and parents who empower youth through education. 🧠💪 And a big round of applause for the students working hard to develop their skills for a brighter future. 🤸🎇\n#WYSD #WYSD2019 #educationforall #freeeducation @UN https://t.co/Z9g0ZAmhVd @arooshmir Aw, gosh. Thanks. https://t.co/1uq2248uIj Excited to publish content as part of @YouTube's Learning Playlist beta launch for #YouTubeLearning! \n\n📐Algebra Foundations: https://t.co/lu39eBXNPs\n🦠Cells: https://t.co/Heb1qHt1AP\n💲Intro to Economics: https://t.co/dLplsN3pWC\n\nMore to Learning Playlists to come! @wingsatup Khan for Cats? 🤔 @tanyahyman Rookie mistake 😼 Sal posted his first lessons on YouTube in 2006. He joked that \"YouTube is for cats playing piano. It is not for serious mathematics.\" 😹 Today, the cats on YouTube are still playing piano, AND doing serious mathematics. #nationalkittenday https://t.co/sRPGM5T9Iw RT @TheYidanPrize: Reserve your seat at the #YidanPrizeSummit 2019 on 2 December in HK and hear what Sal Khan of @khanacademy has to say ab… @genuslogicae @Liberty4Masses Love ya back! Happy #SummerLearningWeek!☀️🏖️📚 Khan Academy has you covered with free online learning and our virtual summer camp, #CampKhan. Check out other ideas for beating the \"summer slide\" from National Summer Learning Association ➡️ @summerlearning. 🍧💪😎 #SmarterSummers https://t.co/NRQBq5u0XM @teacher2teacher capable 🙌 Ummm, @TwitterSupport we could still use your help #freeSalKhanAcademy 🙏🙏 @SantoshKMall1 @KVS_HQ @DrRPNishank @HRDMinistry Wow, this is FANTASTIC! 😃😃 Best of luck to you and all your students! RT @khanacademykids: It’s our birthday! 🥳🥳🥳 We're celebrating by giving away awesome prizes - like iPads! In our 1st year, children complet… @khanacademykids throws the bestest birthday parties🎂! Make sure you click the link below for your chance to win some awesome prizes. https://t.co/ttQJHRBM06 @khanacademykids, our app for young learners ages 2-6, is celebrating its first birthday by giving away awesome prizes - like iPads!  Enter our giveaway and help us celebrate a remarkable year of learning. https://t.co/uAffKCQZLR https://t.co/bWYpCdXDuQ Happy #IndependenceDay2019! 🇺🇸🎇 Want to refresh your memory on the Declaration of Independence? Khan Academy has you covered! ➡️ https://t.co/qJxC1XBQ8r 🗽 #4thofjuly2019 #history ⚠️Hey Friends, help us #freeSalKhanAcademy. The folks @Twitter have suspended Sal's @salkhanacademy account, so we made this little video to kindly ask that they unlock his account.  Give it a RT? https://t.co/zSi1QzqMtN RT @CollegeBoard: \"Our democracy is based on people being able to make informed decisions.\" - Sal Khan of @khanacademy \n\n#NCSC19 Thanks for watching Sal's keynote at #NCSC19! 🎊 We're proud to make tools that empower teachers to personalize learning, 🙋 energize classrooms,💫 and motivate students! 💯 https://t.co/TWOIDKlpux @DarrenTBeck @NickKristof Here's the link to the NY Times story: https://t.co/D32luqJsEI (worth the 2nd read) @TheJadedQueen Aw that's amazing, we love when families learn together! A love of learning will help him not just in school but through all phases of life. Keep up the great work! 🚨Can't make #NCSC19 and want to catch Sal's keynote? We have you covered, here's the livestream link: https://t.co/GdSeseyB5C https://t.co/qtaPZNistQ Couldn't have said it any better! See you there. #NCSC19 https://t.co/A2Bd0wvPTe Make sure you catch Sal's Monday keynote at #NCSC19! https://t.co/LwHDO0JOU3 @Patrick62677843 ...so you're not following Khan Academy on instagram too? 👀 @mayli @FedericoArdila Nothing but love for our VP of Design. 💖💖💖\nHere's to the next big adventure, onwards. @KatSchartz Look at that! Proud of you. https://t.co/KEec4pNGAh @eightysix_proof @PatrioticPurple @AviaryCocktails Actually, we're proud to have had Paulette part of our Khan Academy family. You'll definitely want to catch this keynote. Can't wait to connect with everyone at #NCSC19 on Monday! https://t.co/sQqJ3GFXD0 @ccorey223 @khanacademykids Can't wait to see how teachers use this swag throughout the year! #ISTE19 https://t.co/2t4qP0gLUk @kingkrishyyy https://t.co/EU6aCKYfCt RT @khanacademykids: Wow, our Instagram and Facebook pages are heating up 🔥 with a sensational summer giveaway 🏖️. Ready to WIN gift cards… Happy #TakeYourDogToWorkDay from Barcelona and the rest of the #khanofficedogs wolf pack! Now immortalized in these amazing stickers by @khanacademy design princess @lalizlabeth 🐶🐕🐩😍💖 Photo by Barcelona's human: @IronFeep https://t.co/UZXHt3mmBC @SarojaWarner @ETSCorporate @sswarner88 @MACCWestEd @AFTunion Stay tuned for more news soon! @DashBarkHuss Love this! https://t.co/ckv0fVsyjq 👀👀👀\nPracticing for your SATs has never been easier or more rewarding! Make sure you check out our #SATPractice this month. https://t.co/R5G9Y1maG7 @jason_pettus Let us know how it goes! You're never too old to pick up some new learning tools! Happy #Juneteeth! We celebrate June 19, 1865 as the day that news of slavery being outlawed in the U.S. reached Texas. How did it happen? Find out on Khan Academy. 👉 https://t.co/SidAeUirBz #celebratefreedom @MrNumero So glad you love it, and you'll see some Khan folks at #ISTE19! Make sure you stop by to say 'hello'! Did you catch Sal's interview by @thuy on @KQEDNewsroom Friday? Sal talks about our new MAP Accelerator tool for teachers and what he really thinks about Millennials 👀https://t.co/5HRUiPZpYC RT @khanacademykids: Learn on the go with #KhanAcademyKids! Our free summer update includes Kodi’s Suitcase, a special section of the app t… RT @TeachWithKhan: Thrilled to be working with @NWEA to bring MAP Accelerator to teachers across the country. Check out the full story via… RT @salkhanacademy: Story about a school that my mother started in India. Very proud of her https://t.co/LFf1B5EujI We're joining forces with @NWEA to develop an innovative tool at the intersection of personalized learning and assessment! Learn more: https://t.co/Z20l0CbRRh #edchat #education #learning #edtech https://t.co/NcuPze1ryR RT @MarisaNeus: This just made my day! He’s so dedicated to working on @khanacademy. Proud teacher moment! @tgirolmetti @JILCummings @heath… #OnThisDay 75 years ago the #DDay invasion began on the beaches of Normandy. This historic battle lead to the liberation of France, and laid the foundations for Allied victory in Europe. Learn more on @khanacademy: https://t.co/ctKxtEKwco 📢 We just launched our mobile app in Indonesian, Polish, and German! 🎉 Find it on the @AppStore and @GooglePlay. So excited to make 🆓 education more accessible around the world! 🌍📱😄 #YouCanLearnAnything https://t.co/hGlvZhxe6B @Taryn_fangirl Thanks for flagging! You're right, that is an error! We'll add it to our list of fixes. Thanks for letting us know! ❤️ RT @AnimuTiddyLover: @khanacademy I started in October and have since completed two school years worth of math and will continue learning.… @quingtato https://t.co/uALbJvHSTN RT @quingtato: GUESS WHAT @khanacademy I PASSED https://t.co/el9xMIitYV @Sm1ther33ns You're welcome! 🤗 @ozsciencenerd Awesome 🤩 We're so happy to help you in your studies! @theshroffage Haha 🤣 Agreed! @princey1976 @AAMC_MCAT @salkhanacademy Wow, this is so great to hear! Thanks for sharing, and we're proud to help out #homeschooling and #worldschooling families 😁 @Sweetiebunbun1 Happy to hear you're such a big fan of Khan Academy! You can find all the info about #campkhan here: https://t.co/bROSoFx9fJ @MitchyNScratchy @duolingo Love it! Best of luck to you as you master AP Physics! 🙌 @ccorey223 @SmilesBinder82 @TheBinder82 Yes!! 🙌 We love his enthusiasm! Keep up the great work 🤗 @quingtato 🤣🤣🤣 Haha yes!! @Thelizrdkingfan Thank you!! We're happy to hear how much you appreciate #khanacademy: free education for anyone, anytime, anywhere. Always 🤗 @aliciavaz Woohoo! Thank YOU! @PrimTVee Wow, thank you! We really appreciate your support 💓 @latoyajames_ Thank you! It's great to hear that our design efforts are appreciated 😍😍😍 @3beforenoon @duolingo Good luck! These are great goals and we're proud to be a part of your learning 🤗 RT @theshroffage: If you haven’t downloaded the @khanacademy app and started learning things, you’re doing it wrong! RT @leekelleher: My 11yo wanted to know how to make a webpage, (finally!). Rather than me bore her, I wanted to find a basic HTML course.… @KINGSDE4D Keep us posted RT @salkhanacademy: If you believe everyone should have access to a free education, please give to @KhanAcademy today: https://t.co/5WQE9It… RT @fdossantos: I use @KhanAcademy often. It helps me keep my mind active. The range of topics, lessons and activities is incredible Join m… RT @MindsetMath: I'm saving these great #growthmindset posters for next year! Thanks for the inspiration @khanacademy and @youcubed #KeepGr… @mrsumscience Thank you so much Jeffrey! Love your work 🙌 RT @theo_wiles: Hey @jbarenburg look @ what you started. You made a campfire 🔥 @BocaRatonElem with @khanacademy and now so many are making… @theo_wiles @BocaRatonElem @jbarenburg Incredible! 🤩🤩🤩 @theo_wiles Right back at you! We couldn’t have such an impact without rockstar teachers like you ❤️💚💜💙💛🙌 @theo_wiles Thanks so much Theo 🙌 Wishing you all the best for the rest of the school year and any final celebratory breakfasts! RT @ivanbuncic: The most amazing thing on the internet is by far @khanacademy . How on Earth did Sal manage to create so many videos?\n\nThis… RT @AAMC_MCAT: The @khanacademy #MCAT Collection includes 1,100 videos and over 3,000 review questions to help you study for the exam: http… RT @imene_bch: Shoutout to Khan Academy for getting me through yet another degree @JennieKelly04 That was fast! Congrats! RT @rlhussey: I just donated to @KhanAcademy. Join me in supporting a free, world-class education for anyone,  anywhere! https://t.co/wFm4T… RT @philippreddy: 75 students MASTERED their grade level standards through mastery challenges in @khanacademy this year!  So many goals set… @ciprianmierea We do! @Josielovesramen No plans but we're always open to ideas! What were you thinking? @JAHattaway @poloniumman @kenlaws @wsbtv Here you go! https://t.co/xTqwA4TSZh RT @Wizkid_Alex: Also @khanacademy I'm still waiting to see which piece of my diploma you want 👀👀 Tune in NOW to see @salkhanacademy's commencement speech at @USCRossier School of Education!\nWatch here: https://t.co/h6jcHfAO74\nCongratulations to the class of 2019! 🎓🎉 https://t.co/4eOyQQddY4 RT @GoBloqSteve: What an amazing gift to humanity @khanacademy’s Sal Khan now educating 75M curious people in 190 countries ... “Access to… RT @futuredrjas: A day in the life of Ms. Merlette... \n🍎👩🏽‍🏫🔥 #MyClassHasBarsss #TurntUpTuesday #ThisIsOURJam #WeKILTOurStateTest #ThirdGra… Calling all aspiring teachers studying for the Praxis Core! Get early access to our free, official Praxis Core prep product—which has 1000+ questions and full practice exams. Sign up &amp; learn more here: https://t.co/2BrFcPFLy4 @ETSCorporate https://t.co/hQ69SJLO3d RT @_majiyd_: @oluafolabi Dear Nigerians, you don't have to go for any master class or training anything . I'm saying this as a self-taught… RT @fpa: #BreakingNews: Salman Khan and the Khan Academy, 2019 Princess of Asturias Award for International Cooperation. #PrincessAsturiasA… RT @ScrambleFox: .@khanacademy im scared now https://t.co/P3qT4JIgos Muchas gracias a la Fundación Princesa de Asturias @fpa por su reconocimiento!\n\nWe are thrilled to be awarded this honor by the Princess of Asturias Awards Foundation in Spain. Thank you. #PrincessAsturiasAwards.\nhttps://t.co/gJsDGKDi4p RT @TeachWithKhan: Happy #NationalTeacherDay! 🎉 We're in AWE of all that you do, and your impact on the lives around you. We're honored to… RT @aashuaarav20: A huge thanks to @CollegeBoard and @khanacademy to help me achieve my ultimate dream score 😀 https://t.co/0WoowCzHmv @aashuaarav20 @CollegeBoard Amazing!!! RT @girlswhocode_hc: Happy graduation day to our intro @girlswhocode club! These girls are creative, brave, and kind, &amp; they forged a stron… RT @CMUniversity: To attend her son Stephan’s commencement ceremony, Sharonda Wilson was unable to attend her own from Ferris State Univers… ✨ May the mass x acceleration be with you! ✨ #MayThe4thBeWithYou #MayThe4th #StarWarsDay #Physics https://t.co/Kjz9hAAtHm Ever wanted to know more about the folks behind the scenes at Khan Academy and what makes us tic ?⏲️Then this podcast ep is for you: https://t.co/S61YBKVlIA via @BizofGive Are you aged 13-18 and into math or science? Enter the #BreakthroughJuniorChallenge and you can win:\n🎓 $250,000 scholarship\n🔬 $100,000 science lab\n👩🏽‍🏫 $50,000 for your teacher\nLearn more: https://t.co/4XYVpVUVDE @brkthroughprize https://t.co/Gc5jfhrRf7 RT @CollegeBoard: Juniors have the chance to earn #OpportunityScholarships for\n🔹 Building a college list\n🔹 Practicing for the SAT on @khana… Hey Vegas! @salkhanacademy will be speaking at @SALTConference on May 9 about \"Optimizing Education for the Digital Age\". Learn more: https://t.co/anGRTLhwYh #SALT2019 https://t.co/QWHHQXmfZK We just launched our AP Computer Science Principles course! 🎉 \n\nLearn about computers, the internet, programming, algorithms, and data analysis with instructional articles, videos, and 600+ practice questions created by @pamelafox: https://t.co/TC33pwGHCo\n\nVideo via @codeorg https://t.co/PT335IljnI RT @Navbahor: @khanacademy is coming in Uzbek. Met the team yesterday in Tashkent. Perfect fusion of foreign and local knowledge and experi… Seeing your child take control of their own learning and grow to be a leader, both in the classroom and at home? That's the dream. 😊 Shoutout to this #khanacademy superstar Sean ✨ from @TimVanMonopoly's class at @Carmel_Cougars. https://t.co/CLiMpyGVg9 RT @khanacademykids: Happy dance alert!🕺🤩 #KhanAcademyKids is nominated as Best Breakthrough App for the 2019 #GooglePlay Awards! This cate… RT @lyftdesignteam: Designing is easy with friends like these! Thanks for dropping by @khanacademy ! We’re so lucky to learn with you! 💪 ht… RT @NicoleAlineSci: Dear @khanacademy, I don’t know where I would be in my career without your middle and high school level tutorials on ma… Q: What is the single biggest factor in a student's life?\nA: The human teacher, not technology.\n@salkhanacademy speaks to @WalterIsaacson on @AmanpourCoPBS about catering to student needs, the future of education, and wealth inequality. Watch in full: https://t.co/3FrN6du3Rr https://t.co/CrcSkj8GJp @KochCarisa Hi Carisa, could you send us your details to https://t.co/D9xiuCZlbD and we'll look into it? Thanks! RT @khanacademykids: 🎶 Kids are movin’ and groovin’ to @simplesongs inside the new #EarthDay update for #KhanAcademyKids. If you listen clo… @LiamGilston Our focus is on translating our content into other languages 🙂 Can't stop learning\n#My3WordProblem https://t.co/CukL3tjSMp Happy #WorldBookDay! 📕❤️📙💛📗💚📘💙📚💖 https://t.co/roUBDnE7fB RT @khanacademykids: 🌳Welcome to the leafy new house inside the Earth Day update for #khanacademykids. Can you SPOT THE DIFFERENCES? 👀Reply… RT @ccghst: Thankful for @khanacademy and free education. @pjytheking Glad to help! Tell your classmates, spread the word! RT @falamb3: Watching @khanacademy interview on @cnn on my flight...I am totally blown away by Sal Khan....what a visionary...and ai think… RT @tiffany_peltier: Continue to be pleasantly surprised by the completely FREE app, @khanacademykids. Teaching my 3-year-old phoneme blend… @Barbiebish407 Sorry to hear! If you could send your details to our help desk we'll look into it: https://t.co/D9xiuCZlbD RT @INBOUND: Announcing the founder of @khanacademy Sal Khan, @SallieKrawcheck, co-founder and CEO of @Ellevest, and @IntuitBrad, executive… Happy #NationalHighFiveDay!\n#embracefailure #growthmindset https://t.co/YOCvhpPoCR @Manuel_do_rio Sorry about that! Back up now. Thanks for your patience and apologies for the disruption. @PikachuThunderB We're back! RT @SeelaWang: I’m times like these, I think we often lose sight in who the true og youtuber is, @khanacademy @ulissesvf Keep an eye out for future internship opportunities! @NoWeHaventMet BRRRRRIIINNNNGGGG! 🎊 @holliebutler Yesssss go get 'em! 👊 Never too late to learn. @mikrocolor 🙄😆 @anxiousdevboy Welcome! @garrettsite Hi Robert, we're experiencing technical problems this morning but we'll be back soon, stay tuned and apologies for the inconvenience! @kenan_ka243 We'll be back soon! Thanks for your patience! @JayoIts Thanks for flagging, we're working on it! Appreciate your patience and please check back shortly! @FilipSazdov Momentarily! Thanks for your patience and please check back soon! @kenan_ka243 Should be back up shortly! Stay tuned and thanks for your patience! @imcameronreed We're working on it! Thanks for your patience! @ronnierowballs Hi JR, we are working on it and should be back up ASAP! Thanks for your patience and apologies for the inconvenience. We absolutely appreciate that class time and student attention spans are finite resources. Hope we can make it up to you. RT @khanacademykids: 🦋 Are you curious about butterflies? Their beautiful colors come from the scales on their wings, and a butterfly's lif… @ulissesvf thanks for your support! find out more about our internships here: https://t.co/qGl8g8NMhT NOTHING https://t.co/CKyjKBIe8m @katie21970017 https://t.co/exRrTUKCJz 🚨 New podcast alert! 🔊 @salkhanacademy talks to @PreetBharara about teaching, parenting, and cultivating a #growthmindset. Listen now: https://t.co/bzRVe6XL7R via @cafedotcom #StayTunedwithPreet https://t.co/BgdfttJ9qs @mrjonesteaches_ @BocaRatonElem So many superstars! 🤩 @HJW1209 We don't have a notification system by subject but it's something we would love to do in future! In the meantime you can sign up for notifications on our YouTube channel which will alert you to every new video, or set a Google alert for specific keywords. Hope that helps! RT @ImJustYvette: honestly name one thing more dependable than @khanacademy RT @kvickersmom: These kids just celebrated finishing 1st grade Khan academy @khanacademy with🍕! @kvickersmom @BocaRatonElem https://t.co/9… @rohscounselors @BeAMaverick @BeairdRohs Great work Jeffrey!!! 👏 Can we share this photo? @rachellberns Oops. How can we make it up to you? @dainty_aya Sorry to hear! Have you logged a help request with our support center? https://t.co/D9xiuCZlbD RT @OfficialSAT: Saturday is Official #SATPractice Test Day, the day when May SAT takers all over the world will be taking a practice test… #TaxDay Do you know your deductions from your exemptions? Here's a guide to key tax terms #financialliteracy #bettermoneyhabits https://t.co/dp3xF2gjto \"We need a big bet on technology literacy and education to move America forward\" — check out @salkhanacademy's op-ed in @usatoday: https://t.co/RYZWnuYdX8 Tune in NOW to see @salkhanacademy and @common discussing equity and access in education LIVE at @asugsvsummit:\nhttps://t.co/JAV4vCSnXq\n#ASUGSV #ASUGSV19 #ASUGSV2019 https://t.co/bJFKA1zXad RT @MrOScience: Khan Academy coding. Every session we get better! @khanacademy @SkokieSD69 https://t.co/NofkLuUuzF RT @CollegeBoard: Complete 12 hours of #SATPractice on @khanacademy and improve your SAT score by 100+ points to earn a chance at a $2,000… @FruitXIV https://t.co/asoWLyAPQW RT @FruitXIV: @khanacademy George has to chill. 😂😂 https://t.co/4xaj86YOVj @Lujyne https://t.co/hC3h4RGCvV @GEARUP_Senn Congrats Bryan! RT @khanacademykids: ✨WIN✨ We're celebrating #NationalLibraryWeek with a giveaway! Want to win a backpack full of books and swag from #khan… 📢 GIVEAWAY 📢\nWant to see @salkhanacademy &amp; @common discussing education in #SanDiego next week? PLUS @marcbrackett @JamesCarville @KarlRove @SteveCase @JDVance1 @wenjuan_mi &amp; more?\nWe've got 25 *FREE* passes to @asugsvsummit for April 10! \nGet in quick: https://t.co/ueVJi4EUqg https://t.co/l5cioSeBvZ Super proud of this work by our team in India 😊 building a library of maths and science content in Hindi, Gujarati, Bengali, Tamil, Telugu, Kannada and Hinglish – so every student can learn in a language they understand! https://t.co/MIbJsCIkIN RT @YahooFinance: Highlight: “College was originally not designed as this gateway to middle-class employment,” says @khanacademy's Sal Khan… @CindyBlockchain Hi Cindy, thanks for reaching out! We accept BCH donations via this address: Bitcoin Cash (BCH): 1GL5cFzFFAjBzjqdRz5Av3tQLuu2K6N9BL Thanks for your support! https://t.co/fGrZGRT6wQ Check out this new docu-series #MakeItWork about students changing the world! ✨\n\nFeaturing @salkhanacademy @hankgreen @ROMPglobal @Hyperloop and a bunch of young disruptors using STEM to innovate &amp; improve their communities! 🙌\n\nWatch on @PrimeVideo &amp; @Roku, via @Legendary. https://t.co/ROgFL8MuIj @helleneri Thanks for the love! RT @ibelieveinpubed: ⁦@khanacademy⁩ When kids have Khan on their mind! I’ve also heard them say Khan helps me feel “Khanfident!” https://t.… RT @tricia_fusco: These are some pretty “sweet” success stories! We celebrated the students who have reached 80% of their @khanacademy miss… @catlint_ 🤩🤩🤩 @DidItForAPGov Glad to have you. Happy learning! RT @bushidocodes: My 🤓 chic shirt is here! It feels like I’m wearing a @khanacademy lecture. Should be a good conversation starter in the @… @sahil_sk11 @salkhanacademy @Prudential Thanks for your support Sahil ❤️ and all the best with your internship! RT @sahil_sk11: @salkhanacademy @khanacademy I'm starting my internship at @prudential this summer, and this is my verbal promise that my f… RT @rosevenus__: from a 1170 on my PSAT to a 1390 my first time taking the SAT... all i can say is THANK YOU @khanacademy THIS IS ALL BECAU… RT @NYCSchools: Thousands of juniors across the City are taking the SAT for free at their schools this Wednesday during #SATSchoolDay! Trus… RT @TeacherPrize: Congratulations to @PeterTabichi, the 2019 Global Teacher Prize Winner! #TeacherPrize https://t.co/bH7w5yX18Y @nomibe3 Thanks for the feedback! We're considering updates to how we display exercises and answers, and value user input! Some workarounds in the meantime: click \"go to lesson page\" for a bigger window, or use the up/down arrow keys on your keyboard to scroll. RT @higgje: Kindergarten Khan✔️Time to master first grade Khan! @Centennial_SD @CSDDavisES #teamCSD #dolphinpride #khanacademy https://t.co… RT @jasondhovey: So excited about the new tools we're building at @khanacademy to support school districts! Drop me a note if you're intere… We're working to make #khanacademy more #accessible for users who experience blurry vision and/or severe color-blindness. Engineer @dierat shares our latest updates for Windows High Contrast Mode: https://t.co/H7sleWgfLI Thanks to our friends @levelaccessa11y for their guidance! https://t.co/NCmBaVWoSd RT @MrsCrapps_RCE: Excellent example of self directed learning from this Ranger leader today! Not only is he working hard  on @khanacademy,… @sahabalaganesh Thanks for the shoutout! RT @Abigailnnature: @khanacademy &gt;&gt;&gt; Netflix RT @nickrp: Today I've been doing math for 100 days straight on @khanacademy! Math has never been a strength for me, but that's changing. M… @nickrp 🤩👏💯 Congratulations Dr. Uhlenbeck! 👏 #WomenInSTEM https://t.co/e15US3PbjK @niclasklugmann Confirming our science team are working on updates to our chemistry course, so stay tuned! RT @killjoyactual: @Reeaannaahh Back in my day, we walked 10 miles to school in the snow, wrote on slates, and chiseled test answers into g… @MichelleOckers Glad we could help! @niclasklugmann Thanks for flagging, we'll check it out. RT @CollegeBoard: \"When I saw his test score increase by 210 points, I said, 'Oh my goodness, Khan Academy!'\"\n\n Help your teen get ready fo… Happy first day of spring from this little piglet! 🐷🌱☀️🌸😊\n\n📷: “Baby Pigs” by @BellwetherFlock, available in the @khanacademykids app! #khanacademykids https://t.co/jwnj1X7jvI RT @CalvinTuray: @khanacademy Chinese proverb: Learning is a treasure that will follow its owner everywhere. #CalvinQuote Hey #NewYork! 🗽 Come see @salkhanacademy speak at @CityCollegeNY about \"Reimagining Education\". April 1 at 4pm. RSVP here: https://t.co/Cq8YbXoeGq #CCNY https://t.co/cEGU5kDLZG RT @i_b_ur_doug: Been taking @khanacademy AP bio and I think out of all the “mind blown” lessons transcription factors wins. Little biologi… @Reeaannaahh 👏👏👏 RT @Reeaannaahh: My teacher called my name and I got scared cuz I thought he was gonna ask me a question but it’s cuz I made proficiency on… RT @RidingGlitch: I can officially give the stamp of approval from my 3 year old for @khanacademykids. I now get asked for the \"learning ga… @M_McCubbing Not currently. But as we continue rolling out and improving our mastery learning system across courses, this could be something we incorporate in future! @mztnt_spice Hi there! Send your details to our help desk here: https://t.co/D9xiuCZlbD and our support team will help you out! @Lygras Thanks for the love! No adult study tips per se. We do have general study tips here: https://t.co/P08luPUjYJ and believe that you can learn anything! https://t.co/gJSvHdaHHF @seulaious We actually have a college, careers and personal finance course: https://t.co/t0eBUExyiu A history of Irish immigration to the United States—from famine, to anti-foreign discrimination, effective assimilation, and eventually political power: https://t.co/vjifbpcuu0 \n\nHappy #StPatricksDay! https://t.co/RHPvmeXwRd RT @BocaRatonElem: Our very own @theo_wiles made a sub sandwich for every one of his students that completed at least 70% of their grade le… RT @_TacoBellSaga_: watch out, even your closest friends might go on khan academy behind your back. @MIC_DROP_BAM You've got this! https://t.co/Qttk616209 @zapxcero @MrDoddsJ ? RT @Priyanka_Saha27: Sometimes your “outrageous” idea is the spark that makes all the difference. Wise words from @khanacademy ‘s Sal Khan… It's 3:14pm on 3/14 which means it's time to say... Happy #PiDay! Here's a way to visualize #Pi using #Pie... in a gif that's exactly 3.14 seconds long! 🥧😜 Learn more: https://t.co/MYiceRigNk https://t.co/tLuij1dUWL RT @khanacademykids: Happy #PiDay! It's 3/14 so we're celebrating the mathematical constant of π (3.14159265359...) \n\nBut before you can co… RT @OfficialSAT: Official #SATPractice on @khanacademy works if you do. Create your free, personalized practice plan at https://t.co/t4v9o4… @ccorey223 @Willow_Dale_ES 😂👌 Looking for something to do while #facebookdown #instagramdown? Go learn something new on https://t.co/ROy63yJ9l8! https://t.co/htfRPhgrZv @brbcycling Surely not! We ❤️🇦🇺🐨🦘! Could you submit a ticket to our help desk and we’ll look into it? https://t.co/D9xiuCZlbD @awh23 Thanks for reaching out! Check out this thread for a response from our CS content creator @pamelafox: https://t.co/i20O3c0Jq2 @OakRidgeHS_OCPS @OfficialSAT Wow! Congrats! RT @OakRidgeHS_OCPS: Congrats to Cavail Young on your 490 point score increase on SAT thanks to hard work and @OfficialSAT practice @khanac… RT @kirkipedia: Just finished Integral Calculus this morning on @khanacademy! One step closer to Machine Learning! https://t.co/OYRsd2XNNm Happy 30th birthday to the #WorldWideWeb! 🎈🎈🎈 Here's to creating things that serve humanity 🆓📚💻🎓🌎😊 #web30 https://t.co/dx8L15O65T RT @mrjonesteaches_: @BocaRatonElem Her shirt “I believe in myself” says it all! I believe in you too kiddo! ❤️ Congrats to yet another one… RT @thefabulouspot6: Guys, if your little one struggles with learning I totally recommend the @khanacademy kids app! We just started it tod… @gericoats If you're still having trouble please log a ticket with our help desk: https://t.co/D9xiuCZlbD @TriciaJTucker Thanks for the shoutout! @holloshere https://t.co/D9xiuCZlbD :) Tune into our #InternationalWomensDay livestream starting NOW!\nFacebook: https://t.co/7iILs5MRuM\nYouTube: https://t.co/yVXCrNgjAA\n#IWD #IWD2019 #womenintech https://t.co/Qga61aFYCT RT @salkhanacademy: Just wrote a piece about what we could learn from Star Trek to address wealth inequality and automation-driven potentia… RT @GeisGeorgia: I’ve been studying math so much there was a message from calculator on the bottom of my phone. “Good morning Georgia!” Not… @CollegeBoard 😂 RT @CollegeBoard: One key to going into the SAT calm and composed is to have a pre-test plan. @khanacademy has some suggestions for what th… RT @OfficialSAT: Gear up for this weekend's SAT. @khanacademy shares effective strategies for each section. https://t.co/CBFA2qnNGc Join us for a *LIVE* fireside chat this #InternationalWomensDay \nFeaturing these badass women from the @khanacademy team 🤩\nRSVP &amp; tune in at 12:30pm PST: https://t.co/b5JtcIUcwF\nIf you're in the Bay Area, join our live audience! Email social@khanacademy.org #womenintech #IWD2019 https://t.co/YMfBgvO2m9 RT @GoogleForEdu: #EdTech developers are reimagining what's possible with #GoogleClassroom and #GSuiteEdu. Join apps like @getwritable, @go… Happy #NationalGrammarDay!\nhttps://t.co/g9JbA0N2Jr https://t.co/SNE9YKXC1r @cthecheese We love feedback! And really appreciate you taking the time to reach out ❤️ Happy #ReadAcrossAmerica Day from our monster friends!\n\nKnow any little learners starting to read? Try singing along to this fun fruity song that's great for introducing vowel sounds! 🔊🍎🍌🎶 \n\nFind more @SimpleSongs in the @khanacademykids app: https://t.co/rZS4LxmdeD https://t.co/zwTKbA6rYe @Commelinales The Windows app is not currently supported by Khan Academy, and we recommend using a mobile web browser instead: https://t.co/ROy63yJ9l8 Apologies for the inconvenience and hope we can get you back to learning ASAP! @Dknees_Manlegs 😊 @_dercein We have some courses on animation! In our Pixar lessons: https://t.co/dSmJnubzoA and computer programming lessons: https://t.co/UXTcOuBgOr @cthecheese Thank you for the feedback! @wesjd_ Thanks for the feedback! RT @XeveryY: I gave $20 to @khanacademy today. Many people do not have the opportunity to go to college or even high school, so Khan Academ… @Commelinales Thanks for the feedback! Happy #DrSeussDay! ❤️💙 https://t.co/BTa8X2PWiK RT @Uzai_Kun: I used to be really afraid of math to the point that I avoided it entirely my first few years of college. Now thanks to some… RT @DrewskiBrown: Khan Academy has a storytelling course and I want to binge it so bad, but I have a chemistry test later today.\n\nThis must… @JimH18 Is there a small white arrow button in the bottom left? @OOPinellas Yes! Learn more here: https://t.co/6EDEzMKAYR @The_Crypt_Keepr We accept donations by cryptocurrency and Square Cash! ❤️ RT @paulcoxon: Hello my name is Paul, I have a PhD in physics and thanks to a random brain freeze forgot the word for photon so had to call… RT @RiceUNews: Salman Khan of @khanacademy, one of @TIME’s 100 most influential people in the world, stuck around after today’s President’s… @edrizzle3_ Glad we could help! @aandalen Haha hi there! Our content team take requests over here: https://t.co/w9n8KCMKK5 Thanks for the kind words! @itsRicardo3455 @RiceUniversity @ricealumni @gofundme Hi there! Send us your details via https://t.co/D9xiuCZlbD and we'll look into it Thanks for having us @RiceUniversity @ricealumni! Support a free, world-class education for anyone, anywhere by joining #TeamRice on @gofundme: https://t.co/K8nxa5En8B 🙏🙌 or create your own team! 🚨 Tune in NOW 🚨 to see @salkhanacademy LIVE at @RiceUniversity speaking about \"Education Reimagined”\n➡️ https://t.co/CEOiVVkHJz ⬅️ @ricealumni https://t.co/XJamDNY5A0 RT @Official_LSAT: Exciting news: Over the past year, adoption of free LSAT prep from @khanacademy and LSAC has grown at a rapid pace. Read… \"More than 40,000 people each month are using Khan Academy’s new free, online Law School Admission Test prep program.\" 😊\n\nWe’re proud to continue expanding and diversifying the pool of people who aspire to a career in law &amp; advocacy! 👩🏾‍🎓✊🏿 @Official_LSAT \n\nhttps://t.co/AHzzCdgfdo @Angel_YZ125 Glad to help! 😀 RT @kk_deeh: tonight i would like to give a shoutout to the only one that consistently had my back since day one\n\nto the only one who gave… @keiferbambi As a small nonprofit we don’t have the resources to help with individual questions 😔 but if you tell us the topic we can try to find relevant lessons and practice problems. @Mzhuko Thank you so much Maria for your ongoing support! ❤️ RT @Mzhuko: After years of donating to Khan Academy, an amazing non-profit where anyone can learn anything for free online as long as they… RT @OfficialSAT: Tips for using free #SATPractice on @khanacademy:\n1️⃣ Link your @CollegeBoard account\n2️⃣ Practice based on your personali… @ChemicalEyeGuy @BobMankoff @NewYorker Love your caption 💯 Happy #ReadAcrossAmerica Week! 📚🎉 Here's a book for all the #BabyShark fans out there... Baby Horses! 🐴 It's a foal lot of fun to read with kids! 😜\n\nFind more interactive @BellwetherFlock books in our @khanacademykids app: https://t.co/rZS4LxmdeD #khanacademykids https://t.co/0yFzW7xYnw @ChemicalEyeGuy Haha love this! Is this your cartoon? @keiferbambi Hi Keifer! What are the questions you need help with? RT @carsoncenterunl: Check out this great video on storytelling by @khanacademy https://t.co/kx2zWUgBrw\n#UNL #UNLArts #storytelling #TrendT… How to know when @salkhanacademy is recording a new video at #khanacademy HQ? 🎙️🚨🔇 https://t.co/ecb0zIeI37 RT @iamajeya: @Rose_Teach My 7 YO does calculus. This is what worked\n#1 Anticipation - anticipate the need for it\n#2 Trust - where you can… @johnny_barrett Yep! We are powered by community donations, philanthropy and partnerships. Find out how you can get involved here: https://t.co/SgBFIxsaz2 🙂 RT @NNFound: When you finally get ALL OF THE ANSWERS RIGHT on a @khanacademy practice session: https://t.co/QwyhTHBzD0 RT @khanacademykids: 📚Let’s read together for #ReadAcrossAmerica week.\n▶️Encourage your child to choose a book. \n▶️Do they like horses? We… RT @bushidocodes: For anyone out there that has struggled with and/or forgotten #math, I suggest checking out @khanacademy and giving it an… RT @ZachFerris_: Me when I hear someone watching a @khanacademy video in the library https://t.co/Ayrb08wiC8 We’re at #AACTE19 in Louisville, Kentucky, spreading the word about our free Praxis Core prep product for aspiring teachers... coming soon! Stay tuned 😊 @AACTE https://t.co/PqXMKYAcEZ We never get tired of hearing your stories! 🙂 Come say hi @salkhanacademy #mykastory https://t.co/3dt5oXqVet Who is the Speaker of the House 🗣️ and what do they do, exactly? 🤔 @jdickerson from @CBSThisMorning explains!\n\nLearn more about how the US government works in our new civics series: https://t.co/txHarh5iuw #civics #government #uspoli https://t.co/YaX72eSgGv RT @CollegeBoard: One of the best things you can do to prepare for the SAT is take a practice test. Take one tomorrow, on Official #SATPrac… RT @SanziSen: A lot of thanks to @khanacademy  and @salkhanacademy  for helping me understanding the concepts of Linear Algebra, really hel… @pocita_tonita https://t.co/x5sy9oLxVp RT @janetbyronander: @taylormcupit @khanacademy Congratulations! I've said it before and will say it again: Khan Academy is one of the jewe… RT @taylormcupit: I would like to thank @khanacademy for single handedly teaching me everything on the MCAT and doing it for free 😭 #therea… RT @EducationCase: You know, it's all about levelling the playing field. These students now have access to the #math videos from @khanacade… RT @DeeBlekPantha: I'm happy to announce that today I reached over 1,000 commits on @github. It's crazy to think that just two years ago I… @abc_lmnop https://t.co/z30GzHvNMS! @venegalart Thanks for the feedback! RT @kristen_schmitt: Today I re-taught myself how to multiply fractions so I could teach it to my kid. #parenting #commoncore (p.s. thank y… RT @salkhanacademy: One of the most inspiring pieces by a president #PresidentsDay2019 (would adapt it to “person” in the arena since it ap… RT @tkguiffre: @mrnumero Thanks for getting us started on @khanacademy !We’re rocking fractions and Computer Animation! https://t.co/qfDZxe… @smbeaverson @clever Hi Sean, we’d love to help you with this! Could you submit a support ticket to our help center at https://t.co/D9xiuCZlbD? RT @OfficialSAT: How many hours have you spent practicing for the SAT on @khanacademy so far this month? If you get up to 6, you’ll be elig… When you ask your @khanacademy study buddy to Junior Prom... and they say YES! 🤩👏💯 https://t.co/YXgJiLSFKB @cwilder__ @RaritanHigh We LOVE it! RT @smaholland: During tomorrow’s classes, I’ll be rolling out some @khanacademy videos through Google Classroom for the first time. It is… @vivianthedweeb ❤️ Thank you for the sweet words! So glad to be here for you, and any other student who needs a study aid or motivation boost! Happy Valentine’s to you too! 😊 RT @whoisaro: My only Valentine’s Day plans tonite is my date w @khanacademy Happy #Valentines from @khanacademykids! 💞\nOur latest app update features loads of lovable lessons for little learners:\n📚 New books covering love, sharing &amp; more\n✏️ Valentine’s coloring pages\n💌 Valentine’s greeting cards\nRT to share the love! https://t.co/rZS4LxDO6b #khankids https://t.co/ehmfwSrwar @BDourassi We have an Arabic YouTube channel! https://t.co/bzmDHyIg8a More content coming soon... RT @Anthanigga: Soooo I kinda did an awesome thing for no reason... it made my heart happy. THANK YOU MR.Salman Khan @BeingSalmanKhan @khan… @Anthanigga @BeingSalmanKhan ❤️ Congrats again on your retirement “brother David”! @salkhanacademy @parvezahamadsk No sorry! @alainbergern 🙌🙌🙌 Happy #Valentines! Today we're celebrating a different kind of love story... not your usual online romance! 💕 https://t.co/GYZzbbfGKD RT @FabHotTubPotato: Who needs a date when there's someone already waiting for you in May @khanacademy https://t.co/eQSeQlTPes @alainbergern Uh oh! Could you send this to our help desk? https://t.co/D9xiuCZlbD Thanks so much for flagging! Yes! Check out our free course on personal finance: https://t.co/nLIzk4CeVG https://t.co/Ga5o4j4pPB @catladykatiee Hmmm thanks for flagging, could you send this to our help desk at https://t.co/D9xiuCZlbD? ❤️ RT @theo_wiles: May I have your attention please? My man A.V. from @BocaRatonElem just mastered all of his 3rd grade skills in @khanacademy… RT @salkhanacademy: Great piece by @tomfriedman about the importance of AP CS and AP GoPo https://t.co/it8ceWW8JN RT @vl_living: GUYS I MASTERED MY FIRST STATS UNIT ON @khanacademy IM LEARNING AGAIN https://t.co/T3SompJgIM RT @eisparklz: @newhomeishere @khanacademy Same. I nearly failed Algebra twice and now I'm a certified statistician, thanks to Khan. You go… @toddlevy Hmmm thanks for flagging! Would you mind submitting a ticket to our help desk with more info, so they can look into it? https://t.co/D9xiuCZlbD Hope we can get your kid back to learning real soon! RT @newhomeishere: In high school I was told that math wasn’t for me. Now, I am 25 and I started learning Mathematics I section @khanacadem… \"They Khan do it!\" 6th grade teacher @TimVanMonopoly shares how his @Carmel_Cougars students have grown in confidence since using #khanacademy: \"There’s this joy. You can see it!”\n\nRead more in @VVDailyPress via @DP_PaolaBaker: https://t.co/ydmvpWdWgt RT @TanaDJoseph: I'm an astronomer. I work on black holes and neutron stars outside our own Galaxy. And I just slipped an fell on the ice h… Happy #WomenInScienceDay and #BlackHistoryMonth! Today we're celebrating the #WomenInScience who inspire us every day with their achievements, perseverance, and courage. Like @maejemison, the first African American woman to travel in space! 👩🏿‍🚀🚀✨ #WomenInSTEM #BHM #BHM2019 https://t.co/mNHk0CL28U @georgedonnelly Sorry to overwhelm and thanks for the feedback!! Try starting with the blue \"Start\" button, working through the practice questions. If your son gets stuck, use a video on the left to review the concept. For further help, head to our support center: https://t.co/D9xiuCZlbD RT @nathan_lau24: If I ever get rich, khan academy is getting a fat donation @XeveryY Thanks for your support! ❤️ @samwhoo Thanks for the feedback! RT @sarthakgh: One of my favorite origin stories is Khan Academy’s founder recording videos &amp; uploading them to Youtube to help his cousin… @dhobishoe @fariahashmii @BTS_twt @jeonglengi We sure do! https://t.co/UNmVkyC7jo and https://t.co/eZo1RjLNDc @woodford_timber Hi David, could you please send us an email to donate@khanacademy.org and we'll look into it right away! @samwhoo We're open to suggestions! 🙂 @wesjd_ info@khanacademy.org 🙂 @venegalart Best of luck! Everyone is terrible at math until it suddenly clicks. Keep persevering and you will get there! @msbeatrice_81 @jeonglengi @augustkitty_ @BTS_twt https://t.co/1DO6ZEkVhU Would you take a course about @BTS_twt?! @khanacademy has 1000's of free lessons across math, science, history, coding, SAT and more... but this would be a first! If you've got an idea for a #khanacademy course, let us know! #ARMYbehindBTS https://t.co/q0rJxZO6Ud @MrsRThal info@khanacademy.org 🙂 @jeonglengi @augustkitty_ @msbeatrice_81 @BTS_twt https://t.co/HuZpFpPJ6m RT @H_Reynolds62: When the guy makes a joke during a @khanacademy video there is a brief moment of hope. @polyinnovator Hi Dustin, could you send us your details via our help desk? https://t.co/D9xiuCZlbD RT @SkiJill: When you're googling @khanacademy videos to help your 5th grader with math...\n\n#parenting #maybemymathwillgetbettertoo @leodeliyannis @Wendel_Bezerra ✅ @johnston_jodie Hi Jodie! Our support team can give you some advice if you log a request at https://t.co/D9xiuCZlbD RT @OfficialSAT: Susan used #SATPractice on @khanacademy to kick b*tt on the SAT, just like she does in taekwondo. https://t.co/5gz4ug1dd8… RT @Labik_Room202: Thank you @khanacademy for helping us with our math today! https://t.co/BxDF1OZyMZ RT @OneKalAway: So apparently @khanacademy can save you in your math lessons even if you're in college 😀 RT @uloveEMforever: LSAC actually advises that you don’t take classes to prep for a couple reasons.\n1. They’re always WAY overpriced\n2. The… RT if you agree! ✈️ https://t.co/u31Yhw757d RT @salkhanacademy: Beautiful poem by 12 year old Alma Barak about coding with her father on Khan Academy #mykastory https://t.co/nN0uLywyx9 RT @McKonGov: How will education need to change to keep up with the new demands of work? @McKinsey_MGI spoke with Sal Khan (@salkhanacademy… Never too late to learn! https://t.co/TjDWiZv1q0 Today's breakfast in bed is brought to you by... the Muffin Man! 🎶 Find more @SimpleSongs in our new @khanacademykids app: https://t.co/5NrGSVneYB #khankids https://t.co/Qottop4EJ3 RT @CBREditor: Medium-sized kiddo is having a riot learning JS on the amazing @khanacademy. Looks deathly, but she's having a blast. Might… RT @victoryapiehl: @salkhanacademy I had no formal math education after 7th grade. As an adult, I spent a year learning math on KA before t… RT @lynnlangit: @salkhanacademy @khanacademy Thanks to you I learned calculus at 51. When I was 12, I had asked my geometry teacher what ki… RT @salkhanacademy: If you have a story of how Khan Academy impacted your life, I’d love to hear it. #mykastory RT @CollegeBoard: #Juniors: Build a college list and wrap up your #SATPractice on @khanacademy TODAY to be eligible for up to $1,500 in sch… RT @WavoPrincipal: Bored during Snowmagedon 2019?  I have a suggestion... This chart represents the average increase in SAT scores using th… RT @jeresig: I’m looking to hire someone with design system and/or JS build system (webpack) experience at @khanacademy! Apply for the seni… RT @salkhanacademy: ⁦@khanacademy⁩ team together for our onsite day. Super lucky to work with these incredible folks! https://t.co/5jRqzmvo… @Primeonly27 Could you DM us with more info? RT @tricia_fusco: Another 💯 on @khanacademy! A master of 4th grade right here. Now he’s onto working on his 5th grade skills. @VerdePrincip… Happy #HumpDay! Learn all about camels 🐫 in this book from @NatGeoEducation available on the @khanacademykids app! https://t.co/5NrGSVneYB #khankids https://t.co/HGc3Hikdc3 @robinjeree What a lovely gesture. Thank you so much. Here's to your Dad, and learning to love math! RT @madelyn_marie3: For my birthday I want people to donate to the charity that has had the biggest impact on me... @khanacademy @madelyn_marie3 Happy birthday!!! 🥳 Thanks so much for your support ❤️ RT @EdTechAmber: Today was an amazing day! So honored to have had the chance to visually capture live the words of @salkhanacademy and his… RT @Gameboydrew: This just happened! 🤩🔥😊💡\n\nShout-out to one of the biggest disruptors in the edu game, @salkhanacademy! \n\nThank you for the… @thomasmneal https://t.co/bx9Qz6dcJ8 RT @MindRocketMedia: Let's get to a point where we can offer mastery and personalized learning to all students everywhere. 👏👏👏 @salkhanacad… RT @lizforeducation: Sal Khan of @khanacademy is giving an amazing opening keynote at #FETC about using technology to empower every student… RT @MindRocketMedia: Listening to @salkhanacademy at #FETC. How did @khanacademy start? Free tutoring to support gaps in knowledge. It all… RT @TampaBaySTEM: Standing room only for @salkhanacademy of @khanacademy at the @fetc opening keynote! #FETC2019 #FETC #FETC19 https://t.co… RT @MmeBurgess: And the crowd starts streaming in for the #FETC Opening Keynote by @khanacademy ! https://t.co/BvLLskWPhu @MrsSnivelyWW Wow!!! RT @fetc: Are you ready for Sal Khan’s Keynote today??? We are and so is this huge crowd outside the keynote room. Share your thoughts usin… RT @philippreddy: Another @khanacademy master!  Fanuela mastered all of the 5th grade math standards!  On her way to a 5 on the FSA! @pbcsd… It's #AustraliaDay and we're celebrating our furry friends from down under! 🐨 Learn all about baby koalas in this interactive book from @BellwetherFlock available in the Khan Academy Kids app! https://t.co/rZS4LxmdeD #khankids https://t.co/R3YQDG7mLz HUGE NEWS for little learners! 🎊 Our @khanacademykids app is now on @Android! Download #khankids today &amp; inspire a lifetime of learning and discovery:\n➡️ @GooglePlay: https://t.co/gfFwXXWIcn\n➡️ @amazonappstore: https://t.co/cjAVJAMKmy\n➡️ @AppStore: https://t.co/vzyD2WxyVR https://t.co/c1HFc0MSGG RT @MrsPequette: Congrats to Teagan on mastering all her grade level math standards on @khanacademy!! 🐾 ✏️ 🌟 #GlenOaksSchool https://t.co/1… @EnglishOlympiad skhan@khanacademy.org @JennyLHansen @KingJames @BeingSalmanKhan It's @salkhanacademy! @xFreeus Hi Evie! Get in touch with our help desk at https://t.co/D9xiuCZlbD 🙌🏿 #MLKDay https://t.co/GlTtFPYan0 RT @GBLocalBLF: @khanacademy is out here saving me..... You're never too old to learn 🤓 https://t.co/9lxDnwLFKb @rema_yunanto Hi Rema! If you're still having trouble you can contact our help desk at https://t.co/D9xiuCZlbD RT @tobyfox: I didn't try to learn Japanese for a long time because I thought it would be too hard. But now I love learning it and I use it… RT @Mr_jrlawson: If you want to make yourself smarter, just visit @khanacademy website. Watch the videos and you will become an intelligent… RT @salkhanacademy: #10YearChallenge From making math videos in a closet 😆 to building a team of 150+ people, creating 🆓 learning resources… RT @christy_tree: Currently studying for the LSAT and can I just say God bless @khanacademy https://t.co/WWyrH10Yyh @iAkalank Our team at @VetrivelF have advised that we are planning to use spoken Tamil in future Khan Academy Tamil videos! RT @salkhanacademy: Been binge watching the #Mars series over the holidays. Big fan of everything @RealRonHoward is associated with. RT @Ed_Pointsman: Before discovering @khanacademy, I went my whole life thinking the maths I learnt at 16 was a) a bit dull and b) about as… @gwinrr We'd love to learn more about this! Could you DM us an email address? RT @OfficialSAT: 💰 SCHOLARSHIP TIME 💰\n\nJuniors, take one or both of these steps to be eligible for our first round of #OpportunityScholarsh… @djmikeyboii92 Try working through our practice problems as fast as you can! @iAkalank Thanks for the feedback! We will pass onto our Tamil content team. @manasuddin ❤️😊 @PatTaylorRCSD @Mrsbarczyk @jasongribble Let us know how you go! @MarcCS1998 Not exactly, but you can submit content requests here: https://t.co/w9n8KCMKK5 😊 RT @lydiasavitt: I never even use Twitter but everytime I'm on @khanacademy I get such an urge to get on Twitter and tell everyone how amaz… @orderwithchaos One day we hope to have a swag store! RT @DalaiLama: Modern education is premised strongly on materialistic values. It is vital that when educating our children’s brains that we… @PhanArt Perfect thanks! RT @CollegeBoard: It's #SATPractice Kickoff Week!\n\nLink your #PSAT/NMSQT scores to @khanacademy for a free SAT study plan made especially f… @PhanArt Hi there could you submit a help request here: https://t.co/D9xiuCZlbD and our support team will look into it right away? @kifilshah Yes! 😊 RT @CollegeBoard: JUNIORS: Complete these two college planning steps by January 31 to be eligible for our first #OpportunityScholarships dr… @MarcelGranak Thanks so much for your interest! You can still work on video subtitles (more info here: https://t.co/Y7NESm5dW3 or here: https://t.co/g82fksB6AP) Or if you'd like to lead the translation effort for your language, you can learn more here: https://t.co/05xjPeM0K9 Thanks again! RT @fermatslibrary: Here's a useful counterintuitive fact: one 18 inch pizza has more 'pizza' than two 12 inch pizzas https://t.co/hePSpG0p… RT @hayden_dev: Started working through @khanacademy's electrical engineering course because electricity: how does it, even?\n\nSo far it's b… @toyoteriyaki That's totally ok! If you master the material ahead of time you can take a few full length practice tests to review your progress, then go back and brush up on any areas that you need. @VeronCheung1105 Thanks for flagging! Could you send this to our help desk? They can look into the issue and your score: https://t.co/D9xiuCZlbD @DavidSven Hmm thanks for letting us know! Could you send more info to our help desk and we'll look into it? https://t.co/D9xiuCZlbD 🙌 @WilliamSobral15 Hey William, thanks for letting us know, and sorry that it's frustrating! If you can send more info to our help desk we'll look into it: https://t.co/D9xiuCZlbD ❤️ RT @annkwo: What’s up, my 4 followers? I 100% mastered Grammar on Khan Academy. You can call me a scholar.  @khanacademy RT @padminipillai: My niece, Sitara (age 5) drew this awesome picture of the solar system using @khanacademykids on her #iPad. Aunt Pads th… A huge THANK YOU to everyone who supported our 2018 fundraising campaign! We’re so grateful for our incredible community 🙌 and excited to continue our mission in 2019. 🆓📚💻➡️🌎 Onward! https://t.co/T2SMEXfapg @WashNews press@khanacademy.org RT @kazarazat: I support @khanacademy because my little STEMer is homeschooled and loves the autonomy and courses. Even if you’re kids are… RT @KylieWe97877803: @khanacademy is literally saving my bacon on this course #advancednursepractitioner #paediatrics #masters https://t.co… RT @CME_Explorers: Mrs. Stafford's 1st graders are working hard on @khanacademy over break! Congratulations on reaching 50% master as a cla… @GyeongBaek info@khanacademy.org @AmericanSaeedi More info here: https://t.co/F35TezUCAx @LearnEQ @mrdesjardins Thanks for letting us know! 👏 #NewYearsResolution https://t.co/Wiz2i9LryV RT @bpcaverhill: #donations to @khanacademy before Dec.31 are DOUBLED - contribute now, to help @salkhanacademy pursue his mission to bring… RT @jackiejacobs: What a worthy cause! \nI just donated to @KhanAcademy. Join me in supporting a free, world-class education for anyone,  an… RT @MalcolmToon: I just tripled my monthly donation to @khanacademy for 2019 and it was the best feeling!  Access to education should be a… @McPhailAidan Sorry to hear that! Could you contact our help center at https://t.co/D9xiuCHKk5 and we’ll check it out? RT @singhkharsh: I just donated to @KhanAcademy. Join me in supporting a free, world-class education for anyone,  anywhere! https://t.co/tf… @Devin6155 Could you send the details to our help center and we’ll look into it? https://t.co/D9xiuCHKk5 Many thanks! RT @ClaudeL1979: Shout out to @khanacademy, especially its founder, @salkhanacademy.\nThank you for what you do to improve this world.\n\nTo e… RT @keithbrawner: I got the boys a @Dell Laptop for Christmas and they are actually watching 4th-grade programming videos via @khanacademy.… RT @CollegeBoard: Complete these two tasks by January 31 to be eligible for our first #OpportunityScholarships drawings. \n1️⃣ Build a colle… @Srobin1020 🤩 RT @bwinterrose: My first application for @LambdaSchool was rejected because I needed more math education. I studied for 5 months, binged o… Shoutout to these Math 🔢 Ninja 🤺 Masters 💯 from @TimVanMonopoly's class at @Carmel_Cougars for winning a #LearnStorm #KeepGoingKeepGrowing Grand Prize! 🏆 https://t.co/lBCcsWEZuS @kboguski @salkhanacademy What a haul! 😍 Thanks for sharing! Have a great winter break! @saughatkhan ❤️ Send us a pic! From Puerto Rico to @Harvard: With a lot of hard work and a little help from @khanacademy, Jordan achieved his dream of becoming a first-generation college student! 🎓\n\nHelp us unlock the potential of students like Jordan, all over the world. Give today: https://t.co/I60mhZjGYz https://t.co/g7Jpj8hRqv Tune in and chat live with @salkhanacademy TODAY at 3:20pm PT/6:20pm ET!\n\nSal will be answering your questions #AskSalAnything and sharing your @khanacademy success stories!\n\nFacebook: https://t.co/6KCpkRM0hX\nYouTube: https://t.co/RcLlCNElxR https://t.co/qmmNN1XwcR RT @JDez54: The learning starts early. They love it! @khanacademykids @khanacademy #KhanAcademyTwins https://t.co/Oz3q8Bdf7y @Wrt1900A Hi there! We're aware of the issue and working on getting a fix out ASAP (likely tomorrow).  Downloading the new version (5.2.4) when it's available should fix it! Sorry for the inconvenience and thanks for your patience! RT @annahan05516059: after i die a billionaire and my kids are reading my will they're gonna think i left millions of dollars for them but… @SameSalKhan https://t.co/hwcIwQEjQN RT @SameSalKhan: okay @khanacademy retweet if you love being a free to use educational platform https://t.co/yMIQXNwfnn CONGRATULATIONS 🎉 to the 1 million students + 28k teachers who took part in #LearnStorm this year in the US!\n\nShoutout to our grand prize winners 📢 @AnglenseJones @Str8Jonesy @Rahway_Schools @MencyMathMania @NimitzVikings @mskimsmath @MechlerMrs @TimVanMonopoly @Carmel_Cougars https://t.co/Inl303Q21V RT @khanacademykids: Our friends at Khan Academy Kids are all bundled up for winter fun! Open our FREE educational app this season to find… #MyBankAccountIn4Words Ignorance is not bliss! 🙈🚨😬\n\n@salkhanacademy shares basic best practices to stay on top of your finances: https://t.co/2KCVmzj9vm RT @sfchronicle: #VisionSF leaders strive to make the world a better place thru innovative business practices. Learn more about last year's… RT @meaghanpattani: Passionate about providing a #free, 🌎-class #education, to anyone, anywhere? Love working with #Teachers and #Schools?… *NEVER hate on #TaylorSwift on Khan Academy 🐍👑 @taylorswift13 @taylornation13 https://t.co/J4Our1fxqc RT @GreenFlyFlowers: I just donated to @KhanAcademy. Join me in supporting a free, world-class education for anyone,  anywhere! \nTheir cour… RT @emilymallaber: hey y’all if we wanna get these degrees we gonna need this around so let’s go people donate donate donate\n\nhttps://t.co/… RT @khanacademykids: Festive winter learning is ❄️ snow ❄️ much fun! Come and play with Khan Academy Kids, our FREE educational app for you… Keep your kids learning over the holiday season with #KhanKids! ☃️\n\nOur free app has 1000's of learning activities including new winter-themed reading, math &amp; coloring pages!\n\n❄️ iOS: https://t.co/6tpoQ8I1Tc\n❄️ Android: https://t.co/pxRSgDGdZp\n❄️ Amazon: https://t.co/BO0nhXXfsn https://t.co/yZrVmecLeV RT @MindsetMath: Here's another Khan King! @khanacademy #masterylearning 😁👑🎊🎇👏 https://t.co/8R68npie6s RT @jeresig: Had a great time chatting with @christoomey, on the @_bikeshed podcast, all about the changing shape of frontend technology, k… @its2chainzley https://t.co/405appUByx @Qxest_ Wow congrats! 🤩 RT @johnwdconnell: got my LSAT score back and let's just say it was rly good! a difference of 14 whole points from my first practice test!… #MondayMotivation That feeling when you hit 💯😁!\n📷: Miss Murray's @ThirdGradeClass https://t.co/gbJxHn8yxz @ThirdGradeClass https://t.co/at7sc0Fd5S 😁 RT @sllerch: This amazing young lady has run away with every coding opportunity I’ve shared with her! I have no doubt with the help of awes… @ThirdGradeClass Woohoo congrats!!! Can we share this pic? RT @MrsTorresArt: Today we try a different language! Learning Java with @khanacademy and @pamelafox. Happy #CSEdWeek! https://t.co/yoIPTAkB… RT @salkhanacademy: How has education shaped my life? Here's my story for @TheYidanPrize #EducationStorytelling campaign.\n\nThanks for the n… RT @mkuntz63: Hour of Code for 5th Ss today.  Khan Academy coding is awesome!!!! #HourOfCode #oakpark97   #khanacademy @TerriSilva14 https:… RT @Joseph_Matuch: Do you want to build a snowman? Students are on @khanacademy participating in #HourOfCode today by using #javascript to… RT @humble: Khaaaaaan! Support @KhanAcademy and get awesome ebooks with the Humble Book Bundle: Dystopian Worlds by @OpenRoadMedia:\n\nhttps:… RT @OfficialSAT: 2️⃣0️⃣ minutes of practice.\n5️⃣ minute break.\nRepeat.\n\nEryn uses this method when she practices playing the flute, and she… @CamerynnPeknik @salkhanacademy Have you tried testing your knowledge with our practice questions? RT @pamelafox: Happy CS Ed Week! 💻👩🏽‍💻👨🏽‍💻\nCheck out our 3 #HourOfCode tutorials on @KhanAcademy:\nJS, HTML/CSS, and SQL \nhttps://t.co/jr1hL… RT @Based_Yeezus_69: Just so y’all know, @khanacademy has a section on personal finance that teaches you things like paying for college, do… @learnwithsplor @brtobler We are fundraising right now for our end of year campaign: https://t.co/I60mhZBhQ7 If you have other ideas for how we could raise $100m, we are all ears! Thanks for your support ❤️ This Giving Week, every donation to @khanacademy has been matched dollar for dollar 💸💸🙏 but that ends tonight! Double your impact by giving now: https://t.co/I60mhZBhQ7 https://t.co/aZS0Oh2qNh RT @theweav1: I support Khan Academy because it helps both me and my math students! I love it! I just donated to @KhanAcademy. Join me in s… @brtobler That's the dream! https://t.co/zdGUHgW2xz We didn't win this grant, but we still hope to get there at some point! @LordCringeCR Congrats on getting this far! Fingers crossed for you too. RT @sfchronicle: Introducing #VisionSF: As the world faces more social and economic challenges, visionary leaders understand the impact of… RT @emilypolhamus: me too john, me too.\nkhan academy knows everyones real goal. https://t.co/ILORVgurBA @MarkedWithaT Thanks for your support Mark! RT @RafranzDavis: Today my life was made by a 4th grader who told me that he’s been coding for a little over a year and is using @khanacade… RT @inafried: Just got done with a fun chat on stage with @salkhanacademy at #earlyfutures. https://t.co/Br7gBAQNMK RT @salkhanacademy: Today is #GivingTuesday, the global day of giving. Here’s why Khan Academy needs your help. Please give today: https://… RT @rdblynn: #WhyISupportKhanAcademy Because everyone can learn.\nJoin me in supporting a free, world-class education for anyone, anywhere!… #GivingTuesday If you believe everyone should have access to a free #education, please give to Khan Academy today. Together we can unleash the potential of learners everywhere! 👉 https://t.co/I60mhZBhQ7 https://t.co/euRYLs9Ltk RT @NASAInSight: There’s a quiet beauty here. Looking forward to exploring my new home. #MarsLanding https://t.co/mfClzsfJJr RT @Official_LSAT: How about something free for Cyber Monday?  Earlier this year we partnered with @khanacademy to make official LSAT Prep… RT @greg_glendy: 71% of the way there. Algebra 2, you're next. I am thankful that @khanacademy and @salkhanacademy have brought out my true… @KarolPawelski Not sure sorry! RT @mjkingsley: Doing 4th grade geometry on @khanacademy w/ my son, barely noticing the chime each time he gets an answer right. He says “t… RT @AsnaMaqba: I’m a statistical analyst. Most of the statistical concepts and applications I’ve learnt are all thanks to @khanacademy. Wha… RT @EastSmithsElem: Parents of PreK-1st graders, instill a love of reading and learning in your children. The new Khan Academy Kids app is… @YhsMsDavis ❤️ @Icarusfloats RT @CollegeBoard: The December 1 SAT is the last one of the year! Register by tomorrow. https://t.co/1EjIz2pNQw https://t.co/gi7V39PgLz RT @JacobRatcliff7: Shoutout khan academy for getting me through chemistry RT @tricia_fusco: I received this email from a student on the first day of Thanksgiving Break! I can’t wait for the next email letting me k… Big news for aspiring 🇺🇸 teachers! We’re building a free Praxis Core prep product — and we’re looking for people to help test an early prototype! Find out more: https://t.co/EWVeFgj0db https://t.co/yYxidcd7yy RT @BankofAmerica: We’re proud to partner with world-changers like @KhanAcademy, @KenBurns, @ToryBurchFdn and @NatUrbanLeague who have the… RT @riyakatariax: From a 1290 on my first practice test in July to a 1560 on the Nov SAT. Thank you @khanacademy! https://t.co/K3VJdhPbNE RT @vadajanak: I wish someone would text me as much as Khan Academy emailed me to study for the SAT. RT @hereiskarl: Watching a @khanacademy video with Sal drawing a Eukaryotic cell and my cat keeps smacking the screen where his cursor is g… RT @IronFeep: Join @salkhanacademy and @barbaraoakley for a live conversation in the @khanacademy office today! Looking forward to hearing… RT @CommonSense: Congratulations to @SalKhanAcademy, founder of @KhanAcademy, for the Educator of the Year award. Sal is a true visionary i… RT @mscreations82: I LOVE that my kids are excited about learning math on @khanacademy. Now if only they would get excited to clean up toys… RT @OfficialSAT: SAT tips from @khanacademy:\n💡 Circle keywords in the passage or question.\n💡 Cross out extra words to simplify complex sent… RT @MrsSnivelyWW: So excited that @khanacademy has an app for little ones ages 2-5 🙌🏻 this is my two year old trying it out 💕  perfect for… @alexseo_ Sorry we don’t have any practice problems specifically for AP Psychology! But we do have tips for answering free response questions on AP exams: https://t.co/WYfoUi4dIt #WorldDiabetesDay What is diabetes mellitus? Learn about this common disease on Khan Academy: https://t.co/syIWk4P2kv https://t.co/oTXe031w1r RT @CME_Explorers: Congratulations to Mrs. Zarrillo's math class for being our first math class to reach 50% Mastery on @khanacademy \nHere… @nishantNTD We do! RT @AvivaBB: how many lives have been saved by @khanacademy ? RT @tricia_fusco: We brought technology to small group this morning! Quick mini lesson to review rounding concepts and then students proved… @midstar01 Thanks for letting us know! We are only sending out one kit per class but we are glad to hear you enjoyed it! Have you submitted an application for the grand prize? RT @CommonSense: Congratulations are in order! @SalKhanAcademy, founder and CEO of @KhanAcademy, is this year's Educator of the Year! He'll… @melaniebell73 😍🤩😁🥳 RT @kandarpdesai: My 5 yo started using @khanacademy for kids ipad app. He has not asked to watch any other videos since then and now movin… @mrshoehing3 Hi Julie, thanks for sharing! We'd love to send you a free #LearnStorm class kit! Could you please follow us so we can DM you with info on how to claim? Thanks! @MsBurns317 Hi Marie, thanks for sharing this #LearnStorm video! We'd love to send you a free class kit. Could you follow us so we can DM you with info on how to claim? Thanks! @StephanieRoeme3 Hi Stephanie, thanks for sharing your classes' #LearnStorm progress back in September! We'd love to send you a free class kit. Could you follow us so we can DM you with info on how to claim? Thanks! @choudhuryj12 Hi Janine, thanks for sharing! We'd love to send you and your students a free #LearnStorm class kit – could you follow us so we can DM you with info on how to claim? Thanks! @MrsFaulkner8 @HCMSTigers157c Hi Cyndi, thanks for sharing this video! We'd love to send you and your students a free #LearnStorm class kit, could you follow us so we can DM you with more info? Thanks! @midstar01 Hi Jessica, thanks for sharing! We'd love to send you a free #LearnStorm class kit! Could you follow us so we can DM you with more info? Thanks! @unshakeable_5 @learnstorm Hi Pam, thanks for sharing these photos! We'd love to send you a free #LearnStorm class kit! Could you follow us so we can DM you with info on how to claim? @NorgeElementary Thanks for participating in #LearnStorm! You've won a free class kit! To claim, please follow us so we can DM you with more info. @TreWoDrummer Hi Donald, thanks for sharing your students' #LearnStorm progress! You've won a free class kit! To claim it be follow/DM us so we can send you more info. @jlmclellan Hi there, thanks for sharing this #LearnStorm progress video! We'd love to send you a free class kit. Could you please follow/DM us so we can send you info on how to claim? RT @TheYidanPrize: Hear about @JuliaGillard’s  journey to become prime minister and a philanthropist dedicated to education. She would like… RT @MrBryantMath: As a math teacher, I've used Khan academy for helping students... But as a parent, I am blown away by how great their Pre… RT @dimvar: Today, I had the pleasure of visiting @khanacademy's offices in Mountain View. I've been a user of KA and a supporter for many… Olá from our office in São Paulo, Brazil! 👋🇧🇷💛💚 https://t.co/wOoXtdj8k0 RT @gothicbeans: so people think failure is making them stupid but @khanacademy said failure is OKay!!!!! so does @mskimsmath https://t.co/… RT @cogitoergosum_2: 6 year old niece is so familiar with Sal Khan’s voice and when I showed her his picture, she said it’s a stranger...to… RT @SoCarto: @khanacademy was instrumental in the transformation of my struggling 5th grader to an \"A\" student over last summer. Incredible… @mell_o_drama Hi there! Could you contact our help center at https://t.co/D9xiuCZlbD and our support team will look into it? @ericghill Nope! But by creating an account we can give you a better experience – by tracking your progress and suggesting relevant content. RT @allyb99: @khanacademy I am inordinately excited that the math word problem I just did had a character’s name spelled the way mine is. T… Happy 151st birthday to #MarieCurie: a pioneering Polish-French scientist who won the #NobelPrize twice! 👩🏻‍🔬🔬☢️ Learn more: https://t.co/VPh9f5n1cM #science #onthisday #womeninSTEM https://t.co/8B6HLnJop3 RT @mrshadeed: Are there examples of founders who leveraged their High Income Skills to build an empire? \n\nA powerful example: \nKhan Academ… RT @MrFeliceGr8s: Students are using Khan Academy to learn and practice the Pythagorean Theorem.  They love hearing that chime!@McGivneyDPC… RT @MindsetMath: Look who reached Level 11 first......5th grade FLEX! Way to go! @khanacademy #learnstorm #growthmindset https://t.co/jcH2H… RT @abbygov: Khan Academy was one of the earliest examples of mainstream Indian representation like I may not have any indian characters to… RT @GRADE45AMC: Students are recreating their own ⁦@khanacademy⁩ videos to show others how to subtract with regrouping! ⁦@Jenngeorge6⁩ http… @JoelleLaginess No plans to offer language learning as part of our content, other than grammar! #Midterms2018 Why does your vote matter? From current and future policy, to state ballot questions – here's @JDickerson with the lowdown on why your vote matters in every election, including today: https://t.co/XPtzB6M8EC RT @abbygov: The only people I trust\n- my mom\n- my best friend \n- Salman Khan of Khan Academy @IFrostyl 👍😊 @nettonthenet Hmmm the best place to start is probably still our help desk at https://t.co/D9xiuCZlbD and our support team can direct your query to the right person. @1999_Shahad_ Sorry we are only involved with #SATPractice, not test administration! This link might help: https://t.co/D7tDvnZ6kt How does voter turnout in #midterms compare to presidential elections? @jdickerson discusses the differences in turnout trends.\n\nLearn more in our new civics series: https://t.co/txHarh5iuw and vote tomorrow if you're eligible! #Midterms2018 #MidtermElections https://t.co/ditpuulTIA RT @smendozateacher: The SWAG is here!! thank you @khanacademy #LearnStorm #growmindset  #keepgoingkeepgrowing @YWPAMONARCHS https://t.co/U… RT @jasondhovey: Great day working with teachers and administrators from @GriffinSpalding County Public Schools in Georgia, one of our grea… @marshalmallllow How'd you go? RT @openculture: Take a Free Online Course on Making Animations from Pixar &amp; Khan Academy https://t.co/exgeAOjv3M https://t.co/Zxj4agppKq @xgameshit That would be @salkhanacademy! RT @ANI: Hyderabad: Mohammed Hassan Ali, a class 7 student teaches designing &amp; drafting to 30 civil, mechanical &amp; electrical engineering st… WILD ANIMAL ALERT: coded on @khanacademy by @Xina_sempai 💜 https://t.co/4SrZMbT8oP #learntocode https://t.co/KOuj4oZPcN @Xina_sempai 😍 @1999_Shahad_ Hi there, where are you located (in the US?) and what kind of counselor (e.g. career or for personal reasons?) @SheriEastman Hi Sheri! If you post a photo or video of your students' #LearnStorm progress we will send you a class kit! @IFrostyl How did you go? RT @ElementaryNc: More growth mindset learning through @khanacademy . https://t.co/7Y66vW8UK1 RT @YouTube: Tune in to meet the stars of science at the @brkthroughprize ceremony → https://t.co/yOyPyffPRJ. https://t.co/D9ZkHhLaJj We’re at @NASAAmes for the @brkthroughprize ceremony! Honoring the world’s top scientists for paradigm-shifting research and discovery in the fields of life sciences, fundamental physics and mathematics. Stay tuned! #BreakthroughPrize https://t.co/oWWHp8R5xB RT @OfficialSAT: Fuel your brain before the SAT with a healthy dinner, plenty of sleep, and a good breakfast. https://t.co/rfp08RGRY9 Why do #MidtermElections matter? @jdickerson from @CBSThisMorning explains.\n\nLearn more in our new civics series: https://t.co/txHarh5iuw\n\n#Midterms2018 #Midterms https://t.co/W78ZbDo2wQ Not going to lie we are PRETTY EXCITED ABOUT THE NEW SCIENCE AND MATH EMOJIS! 🥳\nIntroducing...\nMicrobe: 🦠\nTest tube: 🧪\nPetri dish: 🧫\nDNA: 🧬\nMagnet: 🧲\nLab coat: 🥼\nGoggles: 🥽\nAbacus: 🧮\nInfinity: ♾\n🥰🥰🥰🥰🥰 RT @JoannLublin: Khan Academy’s founder counts philanthropic heavyweights and former bosses among his personal board members. It is my late… @MissPark0516 Wow!!! Great work team! 🤩 RT @MissPark0516: 3rd Grade Fast Track &lt;3's LearnStorm! We made it to Level 41 and we're still learning and growing! Thanks @khanacademy! #… @mrgump7 @salkhanacademy is a ghost! 👻 And the winner of our office #Halloween costume contest is... this epic #Banksy compilation! 🖼✂️💐🍌🔫☔️🎈❤️💯 #HappyHalloween https://t.co/lAObm1lIR9 Happy #Halloween from the Khan Academy team! 👻 https://t.co/qhDq8Gx8pQ RT @DiSoraDave: My 7th Graders Doing Some Amazing Coding in JS.  @khanacademy #strayerstrong #javascript https://t.co/Eu5f72ShiY @churays What's it about? @goldenagenerd No plans but we have a lot of content that can be used to study for GRE! RT @salkhanacademy: Meet our international advocates! These incredible people are responsible for translating our content into different la… @philippreddy @EdTechDir @pbcsd Amazing! Go Charlie! 🤩 RT @philippreddy: Congratulations to Charlie Miller for being the first student at Golden Grove, this school year, to master all grade leve… RT @memecrashes: A meme dedicated to @khanacademy . Thank you for being there every time I need it ❤️ https://t.co/Yu5A57Voes RT @jamilfaraj: #bitcoin : What is it ?\n@KhanAcademy \nhttps://t.co/ufomXvIfYQ @abhijitgore Sorry to hear. Send us the details at https://t.co/D9xiuCZlbD and our team will look into it! Absolutely! 🤗🤗🤗 We only ask our community to give what they can, when they can. 🙏 You can always pay it forward at a later date! 🙌 https://t.co/5awB6OdGxx RT @ErwinCounseling: Students, remember you can do FREE test prep for @OfficialSAT on @khanacademy! You can even link @khanacademy to your… @ymasullo Hi Yvette, thanks for sharing! We'd love to send you a free #LearnStorm class kit, could you follow us so we can DM you with info on how to claim it? Thanks! @TonyaMilton @wnlearns @WALearns @BethMarien @DeeKoscik Hi Tonya, thanks for sharing this #LearnStorm pic! We'd like to send you a free class kit! Could you follow us so we can DM you with info on how to claim? Thanks! @TECHbotHohertz Hi Stacey, thanks for sharing your class's #LearnStorm progress! We'd like to send you a free class kit! Could you follow us so we can DM you with more info? Thanks! @RMiller314159 Hi Rhonda, thanks for sharing a #LearnStorm video from your classroom! We'd like to send you a free class kit! Could you follow us so we can DM you with more info? Thanks! @mamarozee Hi there! Thanks for sharing some #LearnStorm videos from your classroom! You've won a free class kit! Please follow us so we can DM you with info on how to claim. 😊 RT @SMSChardon: Completed 8 full levels @khanacademy #learnstrorm  Way to go SMS students! https://t.co/SfuKL1E75n Ready, set, GO! ⚡️ Our #LearnStorm flash challenge is ON! \n\nThe first 3️⃣0️⃣0️⃣ new teachers to finish 5️⃣ tasks by Friday will win a $2️⃣5️⃣ Amazon gift card! 💸 \n\nGet started: https://t.co/LEmOUC2sZM https://t.co/Ecesd21O9W So excited to host our incredible international advocates at Khan HQ this week! 😁 https://t.co/lMv3Daq2x2 RT @austin_probasco: .@khanacademy might be one of the greatest tools for education in the 21st century. I’m always blown away by how compr… RT @MrsPequette: Four weeks into our challenge, and Jaiden and Juan already mastered ALL the math standards for their grades on @khanacadem… @MrsPequette Love these pics, can we share them? RT @theo_wiles: Hear ye hear ye, my man B.B.@BocaRatonElem has mastered all grade level skills in @khanacademy. A third grader at the momen… @jennymac1212 @TeacherJanka @GreatCitySchls @ChiPubSchools @janicejackson @cps_leaders @MClarkEagles @Melissa_Resh @mikeinick1 We'd love to see your Khan Academy playbook! RT @GabyDisneyArt: @khanacademy is so useful! I’m having so much fun learning how stories are brought to life with #PixarInABox One day I w… Today our app is featured on the @AppStore! 🎉\n\nOur #chemistry content is in the spotlight 🔬🔦 just in time for #NationalChemistryWeek!\n\nDownload it here: https://t.co/db3OIDkfZZ and learn all about atoms, ions, compounds, and more! https://t.co/xiNtAZTNRu RT @fabuLASHfudale: I introduced @khanacademy Kids to Mrs. Loeffler’s room this morning. Love the early literacy skills &amp; all the books! @F… @tteacherttyler Let us know if you need any help getting started! @JustinHubert @KristinRaworth https://t.co/shglRDnbLj RT @adibchyy: \"How did you improve so much in one year?\"\n@khanacademy thanks fam, hope you guys will help me get even higher this year http… RT @MarinaGoude: I was on a date and I mentioned Khan Academy helping me study, and he didn't know who that was... I was like \"yeah, this i… “When your brain is having trouble,\nthen your brain is getting bigger.\nSo if you think you’re not smart... but you are.\nSo try really hard and you will get it.\nAnd do the best you can.”\nPREACH 🙌 https://t.co/fqP1azqozP RT @tricia_fusco: My 4th graders buddied up today to help Mrs. Gibson’s 5th graders get started on @khanacademy. #VikingVoyage19 #Teamwork… @chrstphrbmlr No plans as yet, apologies! Is the polarization of US politics the greatest threat to American democracy?! 🇺🇸🏛🚨\n\nWatch @salkhanacademy and @jdickerson from @CBSThisMorning discuss in our #Civics series – launched today!\n\nLearn more: https://t.co/txHarhmTT6 https://t.co/L7s4uute7Y RT @CBSThisMorning: We're launching a new series with the @khanacademy, an online education platform. @JDickerson will be featured in educa… It’s 6:02am x 10/23 = Happy #MoleDay! 🎉\n\nBut what exactly is a mole?! Watch and learn... \n\nThen dig a little deeper here: https://t.co/6V4F0gV3C5  #NationalChemistryWeek https://t.co/eBkGR36tE8 RT @EClare_WMASD: Thanks @khanacademy ... my son was able to teach himself about adding &amp; subtracting integers :) Then he got feedback righ… @evanworth Hi Evan our website is experiencing some technical issues but should be up again shortly, if not already! RT @RamyaSriram100: Students of Meridian School, Kukatpally booming with KHANfidence checking their progress in #learnstorm after a two-wee… Ever felt like you weren't smart enough, or didn't belong? 😣\n\nOur academic content manager Brian shares how he pushed through insecurity as a first generation college student &amp; went on to become a Rhodes Scholar!\n\nMore #GrowthMindset content: https://t.co/BpVhaVfKIn #LearnStorm https://t.co/h9fsxUSW09 RT @Renerenzy: @khanacademy my 7 year old son is videotaping himself, pretending he were Sal. Well, he has not got a writing pad with him,… @vickielynnr @BlyHigh 💪👏🤩 @MrsRThal Hi Mrs Thai, thanks for tweeting a photo of your class's #LearnStorm progress! You've won a free class kit! To claim it, could you please follow us so we can DM you with info on how to claim? Thanks! @STEM_MAC Hi John, thanks for sharing some photos of your students using the #LearnStorm #growthmindset activities! You've won a free LearnStorm class kit! Could you follow us so we can DM you with more info? @HydenRobin Great to see! 🤩 RT @Mrs_JCash: My @OES_Explorers rocking it on his #JavaScript training on @khanacademy He asked me to put this on Twitter too!  Thank you… @S_Cawley_18 Yay! @barrett506 Thanks for the valuable feedback Geoff! 🙌 @perpetuadiscip1 No bonus points but you DO get our eternal gratitude! Would you mind reporting via the Question field &gt; Report a mistake: https://t.co/91bUviGLhV Thanks so much! @AskJonasJsk Just saw this sorry do you still need help? RT @0Rawr: I just donated to @KhanAcademy. Have been a long time learner of Maths. Was about time I gave a little too. Keep on keeping on K… Ready to get into the #Halloween spirit?! 👻🎃🎭\n\nCheck out our spooktacular #KhanAcademyKids update 👀 featuring Halloween reading and math activities, coloring pages, and more!\n\nDownload the app for your iPhone or iPad here: https://t.co/IUrE9KZG7V #khankids #earlylearning https://t.co/IZsOHXLVKZ RT @mrs_englert: Omg! Check out the sweet swag I got from @khanacademy! I cannot wait to give my students prizes for their #learnstorm part… RT @mrs_englert: My growth mindset board is ready! The word \"yet\" can be so powerful! #growthmindset #khanacademy #learnstorm #ProudtobeLBU… @zack_bartkowski https://t.co/o35wmDg5m9 RT @zack_bartkowski: When Khan Academy tries to make a joke https://t.co/GRAjAS7DKP @Mama__B Hi there! We'd love to help you use our site! Here are some resources to help teachers get started: https://t.co/vipq7oGur5 if you're still having trouble please contact our help center at https://t.co/D9xiuCZlbD and our team will walk you through it! RT @MsJonesistheJam: My students were introduced to @khanacademy today &amp; I think they are hooked! @BonitaCharter https://t.co/dGL2trFM5F 💚 Every dollar helps support our free content: https://t.co/00vbe9h43C 💚 https://t.co/coXQvaQ2Bo RT @Kev_Wang_: Does Sal from Khan Academy have a Nobel Peace Prize yet RT @cliffclewis: @gggaabbyy_ Khan Academy the real MVP https://t.co/xAkEvVyLFk RT @enmalik: I keep coming back to @khanacademy, almost a decade after first finding out about it back in university. Thanks, @salkhanacade… @CeLT_Edu partnerships@khanacademy.org @Renerenzy Love this! 👏👏👏❤️❤️❤️ @RKlismith Hi Rachel, thanks for reaching out! We'd love to help you get started with using Khan Academy in your classroom. Have you seen our teacher resources here? https://t.co/vipq7oGur5 \"That first day I was still super nervous... but those are always the best times for you to grow.\" 💪 \n\nPaul Clifton shares how he pushed through fear 🙈 to tackle his first week as a teacher! \n\nMore #GrowthMindset resources here: https://t.co/BpVhaVfKIn  #LearnStorm https://t.co/SZrBZnl191 Got that #FridayFeeling!\n\nHappy weekend from Sandy and the rest of the #KhanKids crew! https://t.co/rZS4LxDO6b https://t.co/QkIC0Lpqnn RT @MrsCostello50: 6th gr Superior Cog is kickin' it with growth mindset lessons! @mesteaching @khanacademy #Learnstorm https://t.co/dd3Axo… RT @Mrs_JCash: When your 5th grade Ss learn to draw a snowman with #java thanks to @khanacademy!! So cool to have my @OES_Explorers #coding… @Rami_Alloush Hi Rami, head to our help center: https://t.co/D9xiuCZlbD and our support team will be in touch! RT @teacher_muniz: Today = @khanacademy day! Let's get our laptops ready! https://t.co/tVOmf2tuDj RT @noahsomphone: most millennial thing i’ve heard all day\n\nwatching a @khanacademy video about landlines and cell phones in statistics \n\nm… @karennashleyy Hi Karen! Head to our help center over here: https://t.co/D9xiuCZlbD @Seaford3rdGrade Hi Kim! You can still access our teacher training resources here: https://t.co/xroxNJqHwU 😊 RT @SGathonii: On this #InternationalDayOfTheGirl my co-mentor @unity3d organized for an educational session with products leaders @khanaca… It's International #DayOfTheGirl and we're recognizing the fundamental human right to access #education! ✏️📚🔢💻🎓\n\nWe're proud to help students like @Malala learn—regardless of who they are, or where they come from. #IDG2018 #letgirlslearn https://t.co/nkfoOeyKvF 📢 Teachers! 📢 Don’t miss out on #LearnStorm: our fun learning challenge for students to build important skills, growth mindsets, and celebrate progress together! 😄🎉🎊\n\nOnly 4 weeks left to participate and win prizes! Sign up now to enroll your class: https://t.co/ICsYsKpu2I https://t.co/Pinv85v5e1 RT @poojabhasin007: Wohoo!! Happiness in the classrooms after receiving their #Learnstorm class room kits. We are here to win! @khanacademy… @kjobio96 Hi Kaitlyn, thanks for your interest! Find out more about #LearnStorm here: https://t.co/f6puZUF4G0 😀 @trmsafp Hi Ann, thanks for sharing these #LearnStorm celebration videos! You've won a free class kit! To claim it, please follow us so we can send you more info via DM. Thanks! @StinnettStinger Hi Celine, thanks for sharing photos of your class celebrating their #LearnStorm progress! You've won a free class kit! To claim it, please follow us so we can DM you with more info. Thanks! @STEM_MAC @MacdSchool Hi John, thanks for sharing a photo of your student's learning about growth mindset with #LearnStorm! You've won a free class kit! 🎉 To claim it, please follow us so we can DM you with more info. Thanks! @SegnaPennie Hi Pennie! Thanks for sharing a #LearnStorm progress celebration video! You've won a free class kit. 🎉 Could you follow us so we can DM you with info on how to claim? Thanks! @TeachManuel Hi Mr. Manuel! Congrats to 6th grade on their amazing #LearnStorm progress! If you'd like to post a photo or video of your students' celebrating their progress, you can win a free class kit! Just tag @khanacademy and #LearnStorm. @shubb76 Great to hear! Share a photo or video of your class's progress to win a free class kit! @Rebekah36918237 Great work! Thanks for sharing! @MrsHarrisREL Hi Cortney! Thanks for sharing a photo of your class's #LearnStorm progress! You've won a free class kit. 🎉 Could you follow us so we can DM you with info on how to claim? Thanks! @JesseMPrescott Thank you for your kind words! ❤️❤️❤️ This is exactly why we do what we do. Inspo for everyone taking the #PSAT/NMSQT today!\n\n\"I received a scholarship that covers all my tuition for 4 years at a selective university. Thanks to Khan Academy, I can go to college without going into debt. I couldn't be more excited!\"\n\nBEST OF LUCK TO ALL TEST TAKERS! 💖 https://t.co/l130EcRoVB @MissChamberlin4 @UVprincipal Hi Robin! Thanks for sharing a video of your class celebrating their #LearnStorm progress! You've won a free class kit! 🎉 Could you follow us so we can DM you with info on how to claim? Thanks! RT @MechlerMrs: We are growing is so many amazing ways with @khanacademy #learnstorm https://t.co/KJeDsh3d4o @Ionia_IMS @MathKicksIt Hi there! Thanks for sharing your #LearnStorm progress video! You've won a free class kit! 🎉 Could you please follow us so we can DM you with info on how to claim? Thanks! @HalleyUrbanak @cypresscreekvcs Hi Halley, thanks for sharing these #LearnStorm snapshots from your classroom! We'd love to send you a free #LearnStorm class kit – could you follow us so we can DM you with more info? Thanks! @FrankieShill Hi Frankie, thanks for sharing a #LearnStorm photo from your class! We'd love to send you a free class kit – could you follow us so we can DM you with more info? @CroninCottage Hi Katie, thanks for sharing photos of your students' growth mindset drawings! We'd love to send you a free class kit. Could you follow us so we can DM you with more info? @allmanfiles Hi Emily! Thanks for sharing your #LearnStorm celebration photos! We'd love to send you a class kit – could you follow us so we can DM you with more info? @MrGowen Hi Travis, thanks for flagging! We are aware of this issue, and fixed it last night! But let us know if you're still seeing a discrepancy? What’s the secret to getting an SAT score of 1530?\n“Khan Academy honestly”\n💯🆓🙌 https://t.co/w1CqSbzxdR @visionoflust What do you need help with? RT @christophy24: @ThePindoDrammeh Use @khanacademy dude, they are the reason I passed my two math classes Ever felt like you had a handle on a topic… until you hit a wall? 💥\n\nYou're not the only one! Our math content creator @MrDoddsJ shares what it's like to hit a learning wall, and how to climb over it. 💪\n\nMore #GrowthMindset resources here: https://t.co/BpVhaVxm6X #LearnStorm https://t.co/s6WoAVdiHc RT @BankaiBuddha: Feeling confident about how my Bio exam went. Thanks @khanacademy RT @LSACForums: ICYMI: Earlier this year we partnered with Khan Academy to make our official LSAT Prep course available for all, for free.… RT @theo_wiles: Breakfast is served. Give it up for my man S.I. Mastered all grade level skills in math on @khanacademy. Keeping to my pled… @nafishy Hi Nafisa! Send us a help request at https://t.co/D9xiuCZlbD and our support team can help you out. For everyone taking the SAT today! You've got this. 💪💯 https://t.co/F1Twn46Jcx RT @madeforhes: If it wasn't for @khanacademy I wouldn't have graduated high school. https://t.co/JVzhG74qUK A heartfelt message for teachers everywhere, from @salkhanacademy and @khanacademy! 💙 #WorldTeachersDay https://t.co/Q3DSiGULm0 \"I try to get to know every one of my students on a personal level – so they know I recognize them as a person, not just as my student.\" 💛\n\nWe're humbled to empower teachers like Brooke Hogan with personalized practice, so every student can succeed! #WorldTeachersDay https://t.co/mUz120hTXx Happy #WorldTeachersDay to the classroom heroes who inspire us every day! 🙌\n\nWe’re honored to empower teachers to unlock the potential of every student. 🔓😊💯 Join @GoogleForEdu in supporting our free content, practice, and teaching tools here: https://t.co/t2l3X9X57c https://t.co/H9jQUUYXQQ RT @angiemeeker: When you're seriously considering going through sixth grade @khanacademy so you can help your kid with their homework... h… @nawalabusultan @salkhanacademy Check out our careers page: https://t.co/6WLlUWFfuv or volunteer opportunities! https://t.co/IK3o2aenk9 💙 @salmanchohan3 @salkhanacademy Show early at a small scale that you can solve an important need, but do it in a way that can really scale. @KinderKollegePS Go Gwyneth!!! Got a question for Sal? Ask away! #AskSalAnything https://t.co/rmgFbRuEZR RT @5E19170918: Look at what our amazing 5th graders are creating as they build their storms! What a great visual to share during parent cu… @5E19170918 So do we! 🤩 Thanks for sharing! RT @MrDillMath: Anyone notice this little Easter egg? #LearnStorm @khanacademy @salkhanacademy https://t.co/B2RNnDPIoO RT @TeachManuel: 6th Grade has made it to Level 13 in the @khanacademy #learnstorm challenge!  We've completed 1,550 assignments so far thi… @yGKeKe0 Yes! RT @rachrach360: @khanacademy is weird bc it helps kids pass 1st grade but also helps adults get into med school. Versatile kween &lt;3 RT @bekacastille: thanks so much @khanacademy for helping me to finally understand the kidneys! https://t.co/WqRd00wKiZ @EdithSu52498536 😁😁😁👏👏👏🎉🎉🎉 RT @EdithSu52498536: @khanacademy #learnstorm We like to celebrate when we level up! https://t.co/UXmudUhSEh RT @jennyphenry: 4th Graders celebrating their #LearnStorm success @khanacademy https://t.co/U0aYAqw1VA RT @NobelPrize: BREAKING NEWS\nThe Royal Swedish Academy of Sciences has decided to award the #NobelPrize in Physics 2018 “for groundbreakin… RT @ccorey223: Watch out Sal @khanacademy this kid is coming for your job🎉🚀as he begins making his own explanation videos to explain key Po… Calling all aspiring filmmakers and storytellers! 🎬 Check out our latest free lesson from @DisneyPixar @pixarinabox where you’ll learn how to use ✨lighting✨ to evoke specific moods and convey emotions: https://t.co/IunjXYUjUZ https://t.co/PwwrSGLqac @manny6542 Link your @CollegeBoard account to your @KhanAcademy account to see past PSAT scores and create a personalized practice plan. @lifebysam_ Hi Samantha! Should be the same. If you're still having trouble drop us a help request at https://t.co/D9xiuCZlbD and our team will look into it! RT @kevin98ssb: Now that I finally have a little of my own 💸...I just donated to @KhanAcademy! Free, world-class education for anyone, anyw… RT @JackieSquid: Just my regularly scheduled shoutout to @khanacademy for coming to the rescue at the 11th hour. Happy #InternationalTranslationDay! A huge THANK YOU, Gracias, Obrigada, Shukria, Dank Je Wel, Tusen Takk, Xièxiè, Salamat Po, ขอบคุณครับ, Nandri, Grazie, תודה, Дякую (+ more) to the 1000's of translators around the world who translated our content into 39 languages this year! 🌏 https://t.co/M8M89ImdvC From engineering student to chef: Zia Sheikh shares how he overcame the burden of family expectations to chase his own dreams. #GrowthMindset https://t.co/ipZYcQmvqS #FlashbackFriday to this time last year... when we appeared on Who Wants To Be A Millionaire in India! 🤩🤑😊 #khanacademy https://t.co/dlPUU5iqq6 How to make the most of your salary and financially prepare for your future? Check out these financial hacks from @BankOfAmerica's #50Under50K honorees! https://t.co/VKgoMpUWMG\n\nLearn more about personal finance and #BetterMoneyHabits on Khan Academy: https://t.co/suhntz2m6D https://t.co/QiH2l0faN1 RT @scully2014: Thanks @khanacademy for the box of supplies help us learn &amp; grow our brains!!! @PhillipsAveElem  #phwaves https://t.co/Z9pj… RT @STEM_MAC: 5th grade STEM is creating pictures of their neurons learning @macdschool. Thanks #Learnstorm and @khanacademy! https://t.co/… Can you find the area of square 3? 🤔\n\nWe’re excited to launch our new @IllustrateMath aligned practice for grades 6-8! 🎉 Learn more here: https://t.co/oBUEiJ3FwM #LearnWithIM #iteachmath #mtbos https://t.co/F2lUMaQFWM RT @gladoshype: Thank you, @khanacademy, for making me lol as my snowman danced until I got the right line parameters. ⛄️ https://t.co/u3UN… @sportsgirl4real Glad you could get it fixed! 🙌 @Mjhernandez29 We've DM'd you so you can reply to that! 😊 RT @mrs_englert: Woo hoo! I just won some Khan Academy Swag! I cannot wait to be able to give prizes to my students for their work with con… RT @EMorichesMS: Congratulations to all of our students (120+!) that completed the 2018 Summer Math Challenge on @khanacademy We are extrem… @sportsgirl4real Hi Miss Griffith, could you ask the parent to submit a support request at https://t.co/D9xiuCZlbD and our support team will look into it ASAP? Thank you! @amyvenable11 Hi Amy! Thanks for retweeting us a few weeks ago! You've been selected as a potential winner of a free class kit! 🎉🎁 Could you please follow and DM us? Thanks! @Mjhernandez29 Hi Maria! Thanks for retweeting our tweet a few weeks ago! You've been selected as a potential winner of a free class kit! 🎉🎁 Could you please follow and DM us? Thanks! @EduTechAndy Hey Andy! Thanks for retweeting our tweet a few weeks ago! You've been selected as a potential winner of a free class kit! 🎉🎁 Could you please follow and DM us? Thanks! @FriscoHHSCoyote Hi Heritage High School! Thanks for retweeting our tweet a few weeks ago! You've been selected as a potential winner of a free class kit! 🎉🎁 Could you please DM us? @SuptSteinhauser Hi Chris! Thanks for retweeting our tweet a few weeks ago! You've been selected as a potential winner of a free class kit! 🎉🎁 Could you please DM us? Thanks! @mtancredi3 Hi there! Thanks for retweeting our tweet a few weeks ago! You've been selected as a potential winner of a free class kit! 🎉🎁 Could you please confirm that you are a US resident, over the age of 18, and DM us your email address? Thanks! Congrats to the winner of our August #coding competition 🥳 to create a webpage about someone inspiring! AquA217 started coding a year ago, and made a project about #NikolaTesla. Check out the other winners here: https://t.co/QWalvvt5pl and learn to code: https://t.co/0H0ipxbYar https://t.co/i5LyttGATk RT @CroninCottage: @khanacademy #LearnStorm https://t.co/rLOd2p6261 RT @salkhanacademy: Looking for some passionate folks in the Bay Area to teach math alongside me and KLS Team: https://t.co/cOKh8xq3nj RT @RealDinarKhalid: SMASHED! 500 days of everyday maths with @khanacademy ! Thank you! you know I can't stop now. الحمد لله\n#consistency_i… \"These faults and mistakes are what I am—making up the brightest stars in the constellation of my life.\"\n\nInspirational words from #KPop band @bts_bighit at the @UN on overcoming failure, learning from mistakes &amp; self acceptance. #embracefailure #growthmindset #Youth2030 #BTSARMY https://t.co/AK330CAOCN RT @JohnCarmack: LSAT prep at @khanacademy is my absolute favorite. I do 30 minutes of practice to start every workday, and it has become a… RT @mrserinjewell: Look at that #Learnstorm goodness happening in my room right now @khanacademy We just finished a unit looking at Growth… RT @KinderKollegePS: Wow!! Mia has accomplished something incredible on @khanacademy! Two years learning and working on Khan Academy, 2,515… Shoutout to everyone who struggled, persevered, and learned something new this week! 🧠💪💡 #growthmindset #LearnStorm https://t.co/QyZjUUYOS0 RT @TechieKato: Thank you @khanacademy #learnstorm @3M for this amazing package I received today. https://t.co/wcNmGspBNW RT @KinderKollegePS: KinderKollege is proud to be celebrating our 2 year anniversary with @khanacademy! And how do the KinderKollege Kids c… @JustDandoy Hi Hannah, that's great to hear! Are you using our back to school program #LearnStorm? We have 2,000 swag boxes to give away to teachers participating in this program. @MuhammedTlb Thanks for flagging! RT @ChurchillClub: Congratulations to @khanacademy for receiving this year’s Magical Team award for empowering growth and learning worldwid… RT @authorsehanson: Taking my last ever math class and still using @khanacademy. Thanks, Sal. 🌿 @MrRobinsonMath @Robinsonsheroes Check out the four graphics at the bottom of this link! https://t.co/gJSvHdaHHF @MoMoLovinJesus Hi Monique! Have you set up a practice schedule on https://t.co/FLyYPznXz3? We’ll identify your strengths and weaknesses and create a customized practice plan that works with your schedule. On implementing #growthmindset in the classroom: \"It's uncomfortable at first. It's a big power shift. But it's such a positive power shift.\" – @Robinsonsheroes #LearnStorm https://t.co/f4CeFuYxy1 \"Success and achievements look different for every person... We need to redefine how we measure success – it's not always about getting an A+\" – @MsAnnieBrock #growthmindset #LearnStorm https://t.co/6DWlZ1gIRy “Some teachers make a point of making mistakes in front of their students, to teach them that it’s ok to make mistakes, and show them how to learn from it” - Dave Paunesku from @Stanford @pertslab #growthmindset #LearnStorm https://t.co/iiwbHGyQsk \"Fostering #growthmindset is all about normalizing mistakes... positioning mistakes as an opportunity to learn.\" – author @MsAnnieBrock #LearnStorm https://t.co/uwDUDRwDt1 \"The great thing about #growthmindset is that it gives every student hope\" – 4th grade teacher Samala Robinson @Robinsonsheroes #LearnStorm https://t.co/bS2NLwOjRC We're live NOW talking #growthmindset with Dave Paunesku from @Stanford @pertslab, author @MsAnnieBrock and 4th grade teacher @Robinsonsheroes!\n\nTune in now (or watch later) right here: https://t.co/ks4uoi6Rog https://t.co/ZWUgzfO36Z How many screens does it take to pull off a #growthmindset livestream? 🖥️🖥️🖥️🖥️📹🤔⁉️ Just ask our video guru @IronFeep. Kicking off in 20 minutes! #LearnStorm https://t.co/QiW3rl4Xa3 Setting up for our #growthmindset livestream... kicking off in an hour! Stay tuned 😁 #LearnStorm https://t.co/Ny5PrRT08z Learn how to build student confidence at our free #growthmindset livestream TODAY at 6pm EDT/3pm PDT! 🧠💪🎬\n\nRSVP here: ➡️➡️➡️ https://t.co/TBJtfBq1Hs\n\nFeaturing @Stanford @pertslab's Dave Paunesku, author @MsAnnieBrock and 4th grade teacher @Robinsonsheroes! #LearnStorm https://t.co/LTrLu0MiJG RT @IllustrateMath: Exciting news! We’ve partnered with @khanacademy to offer more practice questions for students working with IM 6–8 Math… RT @emilycnestor: Love that @tbethshearer is assigning her students tasks on @khanacademy to review! Not only are students receiving remedi… @Fill_Atoms Your coach dashboard can be found here: https://t.co/xJTP80bnXg (but if that's not what you're looking for let us know) Join our free livestream tomorrow for expert tips on fostering #GrowthMindset in the classroom from @Stanford @pertslab Dave Paunesku, author @MsAnnieBrock and 4th grade teacher @Robinsonsheroes!\n\nRSVP now and submit your questions:\nhttps://t.co/TBJtfB8qPU #LearnStorm #edchat https://t.co/KEDObH7WFb RT @TAGMsRackston: @khanacademy just received my #Learnstorm kit and I 😍😍 it! @ApsTAGRobotics will put it to great use at @apsTAGAcademy ht… “The judicial Power of the United States, shall be vested in one supreme Court\" 🏛️👩🏽‍⚖️💪\n\nFor #ConstitutionDay we take a closer look at Article III, which establishes the judicial branch including the #SupremeCourt: https://t.co/SgfJMxjRXQ @ConstitutionCtr https://t.co/0l5iSJE9dZ RT @laurenkostley: Who says you’re too young to start #coding? 😜💻 @khanacademy #code #javascript @scratch #MondayMotivation https://t.co/g2… #OnThisDay in 1787, the US Constitution was signed! 📝\n\nFor #ConstitutionDay we take a deep dive into Article I, which describes the roles and powers of Congress: https://t.co/aexc5QE5zL\n\nProduced in partnership with @ConstitutionCtr 🙂 https://t.co/FZiWZs5UD8 @AbsaxenKU Thanks for flagging! Could you submit this to our help desk at https://t.co/D9xiuCZlbD? TEACHERS: Retweet for a chance to win a class kit! 📢🎁✏️✨\n\nHelp us spread the word about our free #backtoschool program #LearnStorm: https://t.co/qWWKTMTsQv\n\n(RT by 11:59pm PDT September 17. Open to 18+ 🇺🇸 residents. Winner selected at random. Prize value $30). https://t.co/sE6dZYGprE RT @MsBoli: How did I JUST find out that @khanacademy has videos in Spanish!?! Woooo! I am SO excited for this! @Nikhil_A_R Great to start practicing early! Start by creating a personalized practice plan on https://t.co/33qG0Bdvpd by either linking his PSAT scores or taking a diagnostic test. Thanks for having us on @Selina_y_wang! For those that missed the interview, you can watch it ➡️https://t.co/0aPL4UZyqE RT @labkovski: A little message I left for my son at back to school night.  #YouCanLearnAnything is not just something I tell my students -… What has @salkhanacademy smiling so hard? You'll have to tune into @technology 2pm PT/ 5pm ET to find out! https://t.co/KmkuloxKBX RT @Mdownt: LearnStorm has taken over my classroom...  By storm. Thanks to @khanacademy for the awesome way to show progress made in class!… @KHSKnights Hello Kaneland school! We'd like to reach teacher 10378 who completed #khanteachertraining this summer. This person is the potential winner of our grand prize free trip! Please contact us ASAP at teachertraining@khanacademy.org @Kaneland302 Hello Kaneland school! We'd like to reach teacher 10378 who completed #khanteachertraining this summer. This person is the potential winner of our grand prize free trip! Please contact us ASAP at teachertraining@khanacademy.org #ThrowbackThursday What was the founder of #khanacademy like as a high school student?! 🎒📚🤔 We caught up with @salkhanacademy’s teacher to find out! #tbt #throwback https://t.co/AjNwPIXjU8 RT @OfficialSAT: Now that you're settled into your school ~groove~, figure out how to work #SATPractice into your schedule. Just a little p… RT @CNBC: \"In a mainstream classroom, we find that all kids are more engaged in a framework where they're allowed to work on what's appropr… @JimH18 Hi Jim! Our support team can guide you through that – get in touch via https://t.co/D9xiuCHKk5 @Real_Ekvitarius No plans but you can submit content requests here! https://t.co/w9n8KD4m8F @NateTalksToYou @MetalX4473 Khan Academy is 100% free! RT @Mrs_Costantino: We are starting @khanacademy #LearnStorm activities today in 8th grade! Working to motivate students and build confiden… Join our #LearnStorm livestream next Thursday to find out how you can foster #growthmindset in your classroom this school year! 🧠💪\n\nRSVP and submit questions here: https://t.co/TBJtfB8qPU https://t.co/2ABK1lzJ9E RT @iteach4success: Congratulations 7th Period! You are leading my @RTMSThundercats classes in @khanacademy #Learnstorm by reaching 55% of… RT @thisismrhopper: One on my favorite ways to use @khanacademy is to integrate exercises into the lesson. Teach a little....do a Khan.....… @manny6542 Not at this point sorry! But you can submit content requests here: https://t.co/w9n8KD4m8F RT @DingDongDaddyyy: So I’m attempting to teach myself how to wright code thanks to @khanacademy this is my first creation #pizzacode #prog… RT @Floriloribus: @khanacademy when your son says \"ooohhhh I'd never thought about it like that; that's easy!\"\nThanks Sal\n#algebra @D_D_O_S_S We're doing okay! That cell on the other hand... 😬 Calling all 🇺🇸 teachers: *FREE* class kits up for grabs! 🎁✏️🤗\n\nSign up for our #backtoschool program #LearnStorm for a chance to win pencils, stickers, posters, and more: https://t.co/zP3gvAU24V\n\nThanks to @amylack1 and @taleof2teachers on Instagram for these pics! 😍 https://t.co/IxG9dkVD4p RT @StPatricksBNS: Congratulations to these boys from third class who have mastered 50 skills in @khanacademy. Well done boys. @PDSTPrimSTE… RT @W1F1: Truth is I'm quite proud of myself in what I have accomplished mathematically speaking with @khanacademy. I had very low expectat… RT @PrincipalRVRHS: Students at work using @khanacademy in @RVROTC class with Chief Aupperle #RVOneToWorld 🌎 #PersonalizedLearning https://… RT @StephanieRoeme3: Nothing is better than a little bit of friendly competition between classes in khan academy 💻 #learnstorm https://t.co… @marconiusiii @teamtreehouse This is an area we're continuing to work on and refine, so please stay tuned for more site updates! Thanks again for raising this and advocating for accessibility. (3/3) @marconiusiii @teamtreehouse This year we’ve undertaken several improvement projects specifically to make our website &amp; content more accessible - including adjusting our navigation, revamping our content discussion boards, and increasing accessibility &amp; ease of use with screen readers. (2/3) @marconiusiii @teamtreehouse Hi Marco, thanks for reaching out. We care deeply about ALL learners being able to access our content, but also acknowledge that working seamlessly with screen readers is still a work in progress for us. (1/3) @MrsSmith_Teach Hi Cortnie! Please submit a help request at https://t.co/D9xiuCHKk5 and our support team will look into it! RT @BocaRatonElem: Congrats to this amazing student! He won an iPad for his summer minutes on @khanacademy (purchased by our principal from… @ariareneeruocco That means you're learning! 💪 RT @netkrash: @khanacademy tried it today with my 11yo (highly functional in the AS spectrum).. not only he was engaged inmediatly, but als… RT @salkhanacademy: I’m in #NewYorkCity 🗽🍎 launching @khanacademy's new #masterylearning features! 🎓 Keep watching to find out how you can… RT @JHoffman4279: Dear @khanacademy LearnStorm,\n\nAll I have to say is, \"Thank you!\"\nSincerely,\nA teacher trying to get his students excited… @Karina525 Hi Karina! Thanks for reaching out. Could you submit a support request to our help center at https://t.co/D9xiuCHKk5 – our support team will get back to you ASAP! @petersonfourth Hi Brian, sorry to hear you're having issues logging in! We're aware of this issue and have a fix for it – could you please submit a help request here: https://t.co/D9xiuCHKk5 and our support team will respond ASAP! Have a question for Sal 🤔? Hop over to our IG @khanacademy and ask Sal your questions starting at 9am ET! #backtoschool #masterylearning https://t.co/p7bZEOdjnL Catch @salkhanacademy on @SquawkCNBC right now 📺! https://t.co/e94zEb44Sf @WiredEducator Hi there! A lot of our content can be used to study for the ACT 😊 but our free #SATPractice was produced in collaboration with College Board. @netkrash 😊 Thanks for sharing! ❤️❤️❤️ @Zepp1978 @salkhanacademy Thanks for the shoutout! 😊 @JimH18 Hi Jim! Here's the link to contact our help center https://t.co/D9xiuCHKk5 they can help you figure out how to view your progress! 😊 RT @LookingSkyward: I struggled through school. It has always been a barrier for me and I’m thrilled to learned of this concept! Imagine if… Have you ever tried to learn something… and you just couldn’t? 😣 We've all been there. You're NOT alone.\n\nBut what if there was a different way to learn... that empowers you to really understand any subject?! 📚💯💪\n\nIntroducing: #masterylearning 🎓 https://t.co/MWdcOV01gd RT @Robinsonsheroes: We completed level 1 of @khanacademy #LearnStorm...On the FIRST DAY! -Class Editors Brynlee and Daisy 🦁❤💻 #isdstrong #… RT @CBSThisMorning: WATCH: @salkhanacademy gives an example of mastery learning in the classroom: https://t.co/3get0N7439 @TheJTizzle Hi JT, sorry to hear that! Please submit a help request at https://t.co/D9xiuCZlbD and our team will look into it for you today. Watch online here: https://t.co/vDVBO0k8kz #backtoschool! 😀 https://t.co/5MThVGAOQc RT @nowthisnews: ‘Reading every day has made me smarter.’ — This 4-year-old is the advocate for reading we need right now https://t.co/JCY7… RT @quaneceya: I am so thankful for @khanacademy’s FREE LSAT PREP COURSE! I have witnessed my diagnostic of only 137 be increased to 145 in… Hey teachers! Join our #KhanAcademyChat *TOMORROW* at 5PM Pacific / 8pm Eastern to discuss #digitalcitizenship with @khanacademy ambassador @Jyoung1219! 🗣️🗨️💬🗯️😁 https://t.co/IzIFzTJEF0 @rads @alouiseme #LearnStorm is our free back-to-school program that motivates classrooms and builds student confidence! Learn more here: https://t.co/zP3gvBbCWt Or if you're just interested in our #growthmindset resources for your 9th grader, you can access those here: https://t.co/BpVhaVfKIn @alouiseme So great to hear! 😊😊😊 Keep us posted on how your class progresses!\n\nAnd thanks for helping us spread the word about #LearnStorm! For any other teachers who see this – you can learn more and sign up here: https://t.co/zP3gvBbCWt 🚀 @msbienaime11 Yay! @KarlieMurphy Update: We've removed and replaced this question! Thanks again for alerting us, please let us know if you spot any other errors! 🙌 RT @OfficialSAT: ☑️ Official\n☑️ Personalized\n☑️ Interactive\n☑️ Instant\n☑️ FREE\n\nSign up for #SATPractice that checks all your boxes at http… @KarlieMurphy Hi Karlie, thanks for flagging! This looks like old \"partner\" content, i.e. not written by Khan Academy, and certainly not by our science content experts! You're right though, we certainly need to fix it, so thanks for bringing to our attention! Will update ASAP. Thanks again. RT @robertkaplinsky: Check out this multiplication chart drawn to scale from @the_chalkface! This seems so intuitive. More info here: https… RT @epg_london: @vipulredey from @khanacademy spoke on how his academy’s free training platform is changing lives of young children. From S… @c_mnzs Hi Carlos, thanks for flagging, and sorry that you're experiencing issues with our site! Would you mind submitting a support request here: https://t.co/D9xiuCZlbD and our help team will look into it? RT @norcruz: Practicando matemáticas con mi hija de forma divertida utilizando las herramientas de .@khanacademy #onlinelearning #OpenFutur… The #LearnStorm rocket launches tomorrow! 🚀 Find out more about our free #backtoschool program that motivates classrooms and builds students' confidence: https://t.co/zP3gvBbCWt #edtech #growthmindset https://t.co/4LMqgpZ1ae RT @nerdgasming: @khanacademy I have a few questions about this... 😂 https://t.co/nNFPvSYm5n @JesseMPrescott Hey Jesse! Get in touch with our help desk: https://t.co/D9xiuCZlbD 😊 RT @SecSeaa: Shoutout @khanacademy the real MVPs been my teacher since year 10 and I’m in 3rd year engineering still watching their videos… @JohnCarmack Glad we could help you find a love of math! @Nickvert03 Get in touch with our help center! https://t.co/D9xiuCZlbD 😊 Teachers! Help us spread the word about our free #backtoschool program #LearnStorm: https://t.co/qWWKTMBRYX\n\n📢🎁✨ Retweet for a chance to win a class kit! ✨🎁📢\n\n(RT by 11:59pm PT August 31. Open to 18+ 🇺🇸 residents. Winner selected at random. Prize valued at $30). https://t.co/C6CeNFihTB RT @codeic: In my effort to practice #math everyday and collect at least 500 point at @khanacademy, I feel good this morning acquiring the… RT @ruthstp: Gotta say @khanacademy is pretty amazing. And makes me want to study all the things. RT @Wooster_TRT: Very successful day 1 of Khan Academy for 3rd graders at Melrose today. @WoosterCSD https://t.co/hhgnnZ7xzy RT @helenajar: Today was my first day @khanacademy, as a designer on the Early Product Development team! \n\nFeeling super excited and gratef… Watsonville, California: Famous for growing apples, strawberries... and now growth mindsets too! 🍏🍓🧠💪 Thanks for having us @Ceiba_Spartans!\n\nSign up for #LearnStorm here: https://t.co/ICsYsKpu2I #backtoschool #growthmindset #edtech https://t.co/r5xrPRi5HP @ChristianOverk You can submit content requests here! https://t.co/w9n8KCMKK5 😊 @ItsJustCty Thanks for your patience! Really sorry for disrupting your study schedule &amp; realize it's especially stressful w/ the LSAT just around the corner. Your score &amp; all future tests should now be fixed, &amp; practice plan fixed by EOD tomorrow. If not please shout out via our help center! K is for #Kindergarten! Get ready for Kindergarten and beyond with Khan Academy Kids. See our tips for helping little learners start school strong! 💪✏️🎒🏫 https://t.co/6JtGtprGph #firstdayofschool #khankids https://t.co/uOeb2HyafU RT @NCRMuseum: #OnThisDay in 1963, Dr. King stood atop the steps of the Lincoln Memorial and delivered his famed “I Have a Dream” speech. h… @jeremydarko Thanks for reaching out! We're a nonprofit so that model wouldn't work for us. All the best on your venture! @mroetken @ccorey223 @JoshBGerloff might have some tips? RT @mroetken: Has anyone had experience using @khanacademy #LearnStorm last year? It is new to me and want to see if it’s worth trying for… RT @perpetuadiscip1: Today’s #mbalunch will be a dive into balance sheets and income statements via @khanacademy. The sheer amount of free… RT @NASA: “You are as good as anyone in this town, but you are no better than any of them,” says retired @NASA_Langley mathematician Kather… RT @maartbox: Another #javascript #animation I made on @khanacademy a while back - this time a self-promo. I really enjoyed figuring out ho… @ItsJustCty Hi Courtney, please send us a help request https://t.co/D9xiuCZlbD Best of luck with the LSAT! @A_Cheshire https://t.co/D9xiuCZlbD! RT @hobworId: the khan academy man has such a fatherly prescence like hey after u finish explaining logarithms to me can we go play catch o… #MondayMotivation: Nobody is born smart. #YouCanLearnAnything! 🧠💪🏆\n\nTeachers: Help your students build a #growthmindset with #LearnStorm! Sign up by September 4: https://t.co/ICsYsKpu2I for a chance to win pencils, stickers, and motivational posters like this! 👇💜 https://t.co/AoA1fsAREE RT @MGoviaEDU: @JBuchananEDU @jlrobinson84 @Adriana8529 @AllyssaKnight @ljbossa @Mfuksa4 @HennesseyEleme2 @HPSEagleUpdate A little peer tut… @raagagrawal Hi there! Sorry for the slow reply. Our support team can help you with that request – get in touch via https://t.co/D9xiuCZlbD 🙂 RT @MsGlenn415: Khan Academy Ambassadors up in the house! Loved getting to share amazing resources with colleagues all over the district th… @CushingAlexis Submit content requests here! https://t.co/w9n8KCMKK5 @tortu048373 https://t.co/AAQBP8RPd9 @EDUcre8ive @teacherawyman @mathkaveli @fawnpnguyen @johnberray @burgessdave @AncrumSara @alicekeeler @jmattmiller @YouTube @MrVaudrey @Jstevens009 @classroomchef @MathDenisNJ @mathdiana @mr_stadel 🤩👏🙌 @therealjoshf Hi! Submit a ticket to our help desk and they'll look into it: https://t.co/D9xiuCZlbD @Alexi_Jusdatip Thanks for the feedback! RT @OfficialSAT: Shawn Mendes has a special message for everyone (taking the SAT tomorrow). https://t.co/W404MmFsL1 @shigeplaysdrums Could you share a link to one of the videos you're looking at? @FlipFloop_ @pamelafox? RT @andy_matuschak: 📝🎨💥 Let's go beyond multiple-choice questions and right-vs-wrong feedback! How might we make great open-ended writing/d… RT @CoachAdrienneS: LearnStorm is open to all classrooms across the US! Sign-up opens on August 13 and it's free! Motivate and build growth… RT @mrswalsh103: This has been a go-to video in my practice for several years. Students were motivated by it today and we chanted, \"You! Ca… We take donations! Help us keep Khan Academy free - for anyone, anywhere, forever! https://t.co/00vbe9h43C 😊🙌 https://t.co/12FrLhObZy RT @FlipFloop_: I wish to thank @khanacademy for all they have done for me (so far). Teaching me about economics, feeding my dream to code,… @shigeplaysdrums Hi there! Which video? RT @tricia_fusco: Busy classifying triangles by sides and angles. Ss helped label our math wall and then used it as a reference to help wit… @ccorey223 @Willow_Dale_ES @YouTube @JoshBGerloff @OERKhanAcademy That footage never gets old 😆🤩❤️ @_nicolettem_ https://t.co/VjkA5ELa32 @saturn544 https://t.co/YLhuKU5jyP @jiksjunior ❤️ We'd love to see it! RT @LittleBrainz: 8-year-old twins ace the UK GCSE (year 11) Maths (foundation) exams with the help of @KhanAcademy and @WolframResearch Ma… @LittleBrainz @WolframResearch Wow! Congrats Fraser and Spencer! 🤩👏 @JPKilcrease @IGN Thanks for flagging! The article has been updated 🙂 RT @AmyH0531: This science teacher would like to give a shoutout to @khanacademy for providing a great ‘tissue type’ resource on this beaut… @Siddsys ❤️ @WlNKDEEPTV https://t.co/FNexag8IrK @msSparklesxo 😊❤️ RT @del_tac0_: Current lyft driver is blasting khan academy audio on aux. 5 stars to you my good sir. RT @rosbet75: Ok, this is epic. @khanacademy https://t.co/pP5BeoKi4o RT @AmyLack1: I won a LearnStorm class kit from @khanacademy #learnstorm #evenbetter https://t.co/VOyqYNrUb2 Hey teachers! Join our very first #KhanAcademyChat *TONIGHT* at 5PM PDT / 7PM CDT / 8pm EDT. Our ambassadors @Jyoung1219 and @ebarnes73 will be leading a discussion on #backtoschool plans! 🗣️ https://t.co/4TzofIaJ2o RT @GurneelBatra: Got two sun badges in one day- Millionaire and Da Vinci !!!!!! @khanacademy https://t.co/w1xFPV3IaG @agavegirl Hi there! If you can submit a ticket to our help desk they'll look into it! https://t.co/D9xiuCZlbD \"It's amazing. It's amazing. And it's FREE!\" 😁\n\nHelp your students start the school year strong with #LearnStorm! 🚀 Sign up now for a chance to win a class kit: https://t.co/ICsYsKpu2I\n\nThanks to Ms. Grubbs for sharing her classroom and thoughts! 💙 #backtoschool #growthmindset https://t.co/vcj0zYwdsJ @SupImFrank We sure do! https://t.co/cxJPYkMkUA ☺️ @surbatovich Hi Amy, send us an email to privacy@khanacademy.org RT @JamesDerouselle: Why didn't anyone tell me how awesome @khanacademy is for #LSAT #prep? This is so great and it's #FREE. @pictoline Por situaciones así inventamos #Khanpeonato https://t.co/kAHj2wKn6D RT @TichaelMan: hello khan academy my old friend @oopscoffee https://t.co/Bz4JhiAAXl RT @aspenideas: .@khanacademy's Sal Khan explains the evolution of his organization that's now educating millions of people worldwide. http… @theStrobilus @gatesfoundation https://t.co/jhbI8YeaU7 Making under $50K and crushing your career?! @BuzzFeed and @BankofAmerica are hosting a #50under50k summer camp for people just like you! Apply here: https://t.co/CKs8OzF5UK (🇺🇸 only)\n\nLearn more about personal finance on Khan Academy: https://t.co/suhntz2m6D #BetterMoneyHabits https://t.co/B0f38wfIIZ Q: What's the world's deadliest animal? 🦈🐍🦏⁉️ \nA: THE MOSQUITO 😱\nLearn more about malaria on Khan Academy: https://t.co/ffZikE0AXt #WorldMosquitoDay 📷: @gatesfoundation https://t.co/QNmkhONIOh RT @Sehar_Ejaz: The best things in life are free: (https://t.co/t4v77pzD4G) #lovetolearn \n\n@khanacademy @MrBodde Right back at you! Teachers are OUR heroes! Yep that's right - the course challenge will no longer be required to achieve 100% course mastery, but can be used as an acceleration tool for students confident in their knowledge. @MarisaNeus @ReadPlayLearn Yay! \"The lessons are well-paced, filled with whimsy, intelligence, and a clear understanding of how children learn.\" Thanks @ReadPlayLearn for awarding #KhanKids the Gold Parents’ Choice Award! 🥇🏆✨😁 https://t.co/MRHHfCfP4X #earlylearning #edtech https://t.co/rCML3RRkQL #MondayMotivation https://t.co/yqs9tcnDAO @MrBodde Hope that helps! Let us know if any further questions. 😊 @MrBodde Re: Q2 “Can students reach 100% mastery without using the missions page” Yes! If a student doesn’t use Missions, but instead only uses the “explore” section, they can achieve 100% mastery. @MrBodde Re: Q1 cont'd: Getting 100% on all units would get you 80% of the way to mastering the course, and getting 100% on the course challenge gets you the remaining 20%. *BUT* we are now changing this so that the course challenge is optional. @MrBodde Re: Q1 “Can a student still reach 100% mastery by completing just the missions section?” Our new system was designed to require that a student gets 100% on all the units AND 100% on the course challenge (which didn’t exist in missions) to achieve 100% mastery for a course. (1/2) @MrBodde Hi Richard, apologies for the slow reply, we’ve been making a few changes in response to feedback from teachers like yourself! RT @MacgrayJennifer: I just aced my entrance exam to place into Calculus and Physics - which allows me to take higher level chemistry, biol… @alexkmarion Congrats!!! Keep going, keep growing! @MacgrayJennifer Congrats!!! https://t.co/YdJ5G3jb4W @abiduzz420 Thanks for flagging! We'll look into it. RT @SwaMusic_: Also, if you believe, like myself, that A) humans should be lifelong learners and B) education should be a collaborative eff… @OldMeme10 No timeline for that sorry! But it's designed to work well in a mobile browser! @MeganJoy5 Not yet unfortunately 😟 however one hack we've heard about is teachers asking their students to update their own name, so the burden isn't all on you! RT @BuchananLandyn: Home from school &amp; I’m continuing my educational learning through @khanacademy !!! https://t.co/AZv5iJdwB8 @HighkeyMiich Thanks for the shoutout! ❤️ #ParentingIn5WordsOrLess \n\"You can learn anything\"\n#YouCanLearnAnything https://t.co/zBLyPH7Rbt @KA_Pashto @RashidKhanFund Sending love and strength, and hope everyone is ok! ❤️❤️❤️ RT @alyssa_kelley17: I’m in grad school and I still use @khanacademy to remember what I learned six years ago in first year chem RT @AddictiveMess: Connor mastered every skill on @khanacademy for 6th-grade math today. It's been a hard year, but I was humbled at the lo… @soscrub_ https://t.co/K3y3fmiif3 RT @mainlinewife: Somehow I made it through high school and college without taking chemistry. Now that my oldest is taking chemistry this y… @dgburris Hi Darren! Once you enroll in #LearnStorm, any existing classes you have (and any new classes you create) will be automatically enrolled. More info here: https://t.co/aJQr44eZn9 Hope that helps. Please shout out if any further questions! @mxlaysiaaa 😟 How? @bradjdale ☺️ Thank you for helping us spread the word! ❤️ @_shaikabdullah_ Not yet sorry! RT @adam_culyer: Cooking dinner whilst revising with @khanacademy https://t.co/FcfayUEVQJ @timelordfromG @KhanAcademyTR info@khanacademy.org @Shelbugharris08 Keep watching and practicing until it clicks! @shelleyjohnjohn https://t.co/AAFRbegwxF @ForeverEversley He's making a comeback soon! Stay tuned... RT @bradjdale: If I had a dollar 💵 everytime someone asked for a recommendation of an app for children 5 and under I'd be a rich man💰👨. Now… RT @genehayward: Going to go give https://t.co/AekeCQVj8y  a try at @WestWilkesHS  this year. I DO believe the hype! :)  #LearnStorm Hey teachers! ✨💥🚀 #LearnStorm is BACK! 🚀💥✨ Jump-start the school year with our free back-to-school program. Sign up this week for a chance to win one of 500 class kits! 🎁✏️🌟 https://t.co/ICsYsKpu2I https://t.co/duKdYMYPoi RT @alyzzp: So today I finally learned how to notate mixed numbers on @khanacademy anyways what did you do RT @tierneyrowe: Putting myself in student mode as I brush up on my US and Iowa History before implementing the new social studies standard… ☺️💖➡️ https://t.co/rILBmlcQLz ⬅️💖☺️ https://t.co/3qdoQzcfYP @Leetooon ☺️😁❤️ @dreavean https://t.co/0Ig2qmOu6A RT @TweetSoCrazy: I discovered a number of years ago that I am good at math. All through elementary school and high school I struggled with… @_FamilyCulture Try info@khanacademy.org 🙂 @Gus3Original ❤️ Do you like it as much as the first time you read it? @a_gabreu You're right! Hope you can still enjoy them in your web browser. @Sreekar0213 We're starting with Kerala! https://t.co/DT01oY0Ha3 @TravelsChinese Keep an eye on our careers page https://t.co/7LtyTpjwBg or volunteer translation opportunities here: https://t.co/SgBFIxsaz2 😊 RT @jessicalm9: Trailblazers getting started in Khan Academy. @ais_west @khanacademy https://t.co/XKN2oTxHsT Happy #NationalBookLoversDay! 📕❤️📙💛📗💚📘💙📚💖 https://t.co/6EbuYnVvkZ @KressinsLessons 🤩🤩🤩 RT @pelzel__k: Learning how AWESOME @khanacademy is for the classroom. 👏🏻🙌🏻 #allenmath https://t.co/b85Jdi7cyg RT @OscarCStaton: If you haven't opened up the new @khanacademy Kids App yet, you're missing out. Check out what my kiddo is doing and he t… @soleilvictorero Which course? RT @SeaHwkSeattle: I just donated to @KhanAcademy. Join me in supporting a free, world-class education for anyone,  anywhere! https://t.co/… @BongusBoyo https://t.co/lVsvt68W7f @AAbuelhaija  https://t.co/ezFfLthkSb @Yung_mal99 😜 @gauravbhatnagar indiasupport@khanacademy.org 😊 RT @zundelowitz: It has always been a great tool in the classroom, and now it's even better, thanks @khanacademy https://t.co/fde2YR8f7s @livingmy_life15 @CaraLadd @AmitKhatkhate It was online! But it’s finished now. @Yung_mal99  https://t.co/qPK6OfkV76 @kaciewts  https://t.co/qFRa92qhWa @BongusBoyo  https://t.co/7NRtENkNAb @niggggas1  https://t.co/tqNhX78gtH @_steve3_ @McCoyCHS @MrsEverettHHS @MrDentonOKC 🙄🙄🙄🤭🤭🤭😝😝😝😁😁😁 RT @franzmath: This is how we celebrate 🎉 mastering our 2nd grade @khanacademy math for the summer! We are ready for a great year in 2nd gr… 💥🚨📚👩🏾‍🏫 T E A C H E R S 👨🏻‍🏫📚🚨💥\nLast chance to complete our free, 60min #KhanTeacherTraining! Finishes at 11:59pm PT tonight. Earn your certificate 👇🤩 and the chance to win a trip to San Francisco worth ~$5k! 📜✈️🎁\n➡️ https://t.co/PsVc4yDmj9 ⬅️ #TeachWithKhan https://t.co/A5zX2IVOLj @MitchellHolman7 We go waaaay back with @KingJames @teamlebron https://t.co/agA9mnSScp and have a lot of respect for @LJFamFoundation's mission and educational initiatives! 🙌🏾 @Doc_J00  https://t.co/p76XSW6jjk @hyphy_aidan  https://t.co/iZyH8N8RdY @Stainllesss Don't give up! Here are some tips: https://t.co/atv2bBrT8g Where are you up to in your SAT practice, and when are you taking it? @gauravbhatnagar For sure! Have you seen our Hindi website: https://t.co/JB1GVj7SV5 and YouTube channel? https://t.co/m5zOYvLotQ @speedioweedio Will this help? https://t.co/DOg8uF5MXa @JohnRPerales Hi John! Unfortunately we don't have parent tools in our app, but we'd love to add them some day! @brugger Hi Brian! We agree that can be frustrating. Try tapping and holding on the link within the browser – it should give you an option to \"Open in Safari\" or \"Open in \"Khan Academy\"? 🎉 Exciting news for #backtoschool! 🎉\nIntroducing #KhanAcademy Classrooms:\n💯 A new #mastery based learning system\n👩🏽‍💻 Personalized, student-paced practice\n📊 Dashboards w/ real-time student progress\n➕ New content: AP, Biology &amp; more!\nhttps://t.co/1zXMundlVD #teachwithkhan https://t.co/IQT58FWnNx @LeticiaVee Hi Leticia! The songs and videos in the Library section of #KhanKids are from @SimpleSongs. However the background music throughout the app is from custom recordings! Email us khankids@khanacademy.org for more info 🙂 @SCameron220 We somehow missed this last year! 😍😍😍😍😍😍😍😍😍 RT @SoHoBasketball: High school students please push pause on Fortnite for a few minutes each day and go to @khanacademy to prepare for you… @speedioweedio What is it? @AmeikaLaura Great work! 😍 RT @MsGlenn415: A day well spent at the TRC! Training the trainers and prepping for Khan + Summit! @khanacademy #ProudToBeLBUSD #YouCanLear… RT @CollegeBoard: Official #SATPractice on @khanacademy is empowering students in California to increase their SAT scores and chase their #… \"This collection of early-learning videos, songs, and activities covers a lot of ground in a creative, highly accessible format.\" Thanks for the ⭐️⭐️⭐️⭐️⭐️ review of #khankids @CommonSense! 😊 https://t.co/aZ4qWzg2WR https://t.co/YIwXRqDPeD @Samanth62824171 😁 @EddieKi55451288 👏👏👏 RT @DuganMedina: When it's Saturday night and your baby is asleep and husband is on night shift...you do your own #professionaldevelopment.… RT @ccarr_room12: Great professional development for the start of the school year! @khanacademy #kip109 #engage109 https://t.co/rCBnoY2qp4 RT @SandersSci: I completed my @khanacademy 101 teacher training PD. I have been using Khan for support to Ss in my content area. Possibly… @baylinotbayley @TaylersTwiiter ❤️ @baylinotbayley 😂😂😂 @NRahulpatel @InnovateNYCedu @jasondhovey 🙌 @nellie_tate @mamarozee @MagnoliaSchools 👏👏👏👏👏👏👏👏👏👏👏👏 RT @alexkmarion: My baby joining me for some quality education @khanacademy #ItsHerSpotNow https://t.co/GOzm8NCHAU @NRahulpatel @InnovateNYCedu You're on a roll! 👏👏👏 @GustavoTCBoy2 One of life's enduring mysteries @akillyeez22 Sorry to hear! Drop our support team a line at https://t.co/D9xiuCZlbD and we can look into it! RT @genehayward: #KhanTeacherTraining I completed the @khanacademy 101 training. I am going to use the Khan Classroom this year for math an… @TanchiatcoAllan @wendylou_duong Great work! 🤩👏🙌 Keep us posted on how you use Khan Academy in your class this year! @genehayward @taylor_teaching @JeffLong10 Spot on ✅ thanks for helping us spread the word! @genehayward @taylor_teaching @JeffLong10 Great to hear! @genehayward @JeffLong10 🤩👏🙌 RT @MristerRational: Starting today, I'm trying to get back into the habit of doing some lessons on @khanacademy and @duolingo every day. L… RT @alexandrasmva: I feel like pursuing a career in business journalism is really just signing up for a lifelong MBA program. \n\nCurrently @… RT @DoItLikeWebb: @khanacademy has literally saved my butt in this integral calculus class. Thank you so much RT @bqrubberchicken: This is what I love about @khanacademy — when a kid starts asking questions about a topic of interest, he can learn at… @GenreScene Wish we could have been there for you! It's never too late to learn though, you life can still turn out differently! ❤️ @onherway29 ❤️ RT @CollegeBoard: Darnell practiced running the 800m so many times that now it comes naturally. He used free #SATPractice on @khanacademy t… @AllyLambeth Sounds cool! Our content is creative commons under a CC BY NC SA 3.0 license (non-commercial). More info here: https://t.co/aEtOIsVF5o RT @MrsKnoxFMHS: Just completed my @khanacademy training 101 for teachers! I have been using Khan Academy for content support by showing vi… #HappyBirthdayHarryPotter and #HappyBirthdayJKRowling! Love from your loyal Hufflepuff friend and #khanofficedogs golden child, Pippy 🎂⚡️💛 #harrypotter #hogwarts #sortinghat #hufflepuff #goldenretriever https://t.co/h1tFiNWOnk Our new app #KhanKids is featured today on @ProductHunt! 🎉 https://t.co/kgzJ3Y3QMK Thanks to product hunter @randomor for spreading the word! 🙌 #edtech #earlylearning Farewell to April, our effervescent Physics whiz! ✨ When she's not creating physics lessons galore 🤓 you can find her getting physical outdoors ☀️🌲🏃‍♀️🚴 hanging out with family 🤗 and maybe even driving a coffee truck! ☕🚚 All the best in NYC April! 🗽 We’ll miss you 💖 https://t.co/enQJeoWndB RT @gxwalsh: My 6yo while doing .@khanacademy : \"You think you can trick me with numbers?! I'm a kindergardener and won't fall for it!\" @Think105 ❤️❤️❤️ RT @yungparabola: Day 73 without teaching a math class: I made a video of me as Sal Khan explaining how to make instant mac n cheese. Here’… @ArzanaeS  https://t.co/AAnRiiPZcd @Lissayourstruly Congrats! 🎉🎊👏 RT @Graykay__11: my best friend during school is definitely Sal from Khan Academy bro always has my back 😩👌🏻💯😤 @ArzanaeS #neverstoplearning 😉 RT @MrsHarper2: Getting ready for first grade with some @khanacademy https://t.co/jpHgdoD4vv @alexkmarion Hi Alexandra! We don't have a video exactly about that... this is as close as we get: https://t.co/PwI81ehFsL (but we use numbers instead of unknown coefficients). We have some exercises with unknown coefficients, but the equations are a bit simpler: https://t.co/2wCepPo703 @IronCreators 🤔 @annazburn @kimberly_kutz 😍 RT @MechlerMrs: Free mini 1hr PD on Khan academy to hopefully win a free vacay... sign me up! #khanteachertraining Let’s go to SanFran @Nen… RT @teacher2teacher: #WhyITeach: to foster a love of learning.\n#MondayMotivation, via T @MrMinguela3 https://t.co/dDrlrEEBri RT @TauntonEd: Super cool illustrations by budding scientist Dougie (9) inspired by independent learning on Khan Academy. https://t.co/dm1Q… RT @ampereir: Been spending the morning with my 2.5 yr old daughter as she plays with @khanacademy's #KhanKids app. Excellent job building… @AthavaleRushi Sorry to hear that! Submit a support request to our help center here: https://t.co/D9xiuCZlbD @IndominusBaz Sorry to hear that, can we help at all? @itsmechedm We kept the leaf! But gave it a refresh. Hope you come to like our new look. @Techboy2021 ✔️ Hey 🇺🇸 teachers! 👋 Finish our free, 60min mini-PD by July 31 to enter our next prize draw to win a trip to San Francisco! ✈️🎁 https://t.co/msvkfabKCh Tweet your certificate with the hashtag #khanteachertraining + tag another teacher for an extra entry! Ever dream of becoming an astronaut? 👨🏽‍🚀🚀 8th grader Christian isn’t just dreaming about it... he’s planting the seeds of his future by growing the same plants as @NASA's @Space_Station! 🛰🌱🌟 #SpacetoGround @astro_ricky @Astro_Suni @NASA_Astronauts @kdog_news @SuptSchauer https://t.co/Gn4iO3TDT1 “Why design at Khan Academy?” 🎨🖌️🤩 We'll let our Design VP @mayli explain: https://t.co/Rt9ReUdSJU RT @iamgiamaxwell: I'll be volunteering as a mentor/tutor this Fall and I'm brushing up on my Math skills in @khanacademy like... https://t… RT @ratrickmyers: I seriously have to give a big shoutout to @khanacademy! Learning to code through Khan Academy has been so much easier th… @breadfrom Better to stay inside and study, Elaine! 😆 https://t.co/VPWVRNutjN @eashistrash ❤️❤️❤️ @particularlay 🤣 @MarcoDahms @duolingo Thanks for the love and the feedback! RT @ImSamanthaSix: Made a profile with @khanacademy because when I think back to my undergrad degree, I remember countless hours on #youtub… @TheVigilantYT Thank you! 😊 @alexkmarion Thank you! ❤️ @CoachHolleyT Hey Terrence! Check out our world history course: https://t.co/EHCh07wIbm Might be a tad advanced in places, but the videos in particular are great for student engagement! Also launching #LearnStorm soon – a great way to engage your students at the start of the year. Stay tuned! @gslahane Sorry it should be working now! Thanks for your patience @Jonazz01 Ok great! Happy learning! @John_Chron Amazing! 👏👏👏 RT @cinicell: We're piloting the use of @khanacademy in select schools of Jharkhand for improving learning levels of tribal students, who a… @estilofamiliar Hi Estilo! Try submitting a support request to our help center: https://t.co/IqOXoT0m0T @Jonazz01 Sorry to hear that! Could you submit a support request to our help center and our team will be in touch? https://t.co/IqOXoT0m0T RT @GGMattt_: FINALLY! It's taken me far longer than I'd like to admit but I've finally 100% Square Root Simplifications 😁 I'm so happy! I'… RT @g_a_b_y__m_b: thanks to @khanacademy , I knew absolutely  nothing about torque and angular momentum 2 hours before my test and got 100 😎 RT @MrNumero: Pretty cool watching my girls work on @khanacademy together! #TeachWithKhan #SummerMath https://t.co/fxs8RMvQYl @OERKhanAcademy 😆 @snouraini 🙌🙌🙌 @natatouille Oh dear! Seems to be an issue with our shortened domain. Try this one: https://t.co/MSGIqxELZH @MasudFr82  https://t.co/UplS2SQF1N @MatsGBergstrom Some reasoning here! https://t.co/p5z072lQCg Say hello to our new logo! A fresh look to support our growth towards a free, world-class education for anyone, anywhere. You’ll see it rolling out across our website and apps from today! 👀 Find out more about it here: https://t.co/p5z072lQCg https://t.co/l5y1SprSLZ When your students start their own after-school math club… you know you’re doing something right! 😄 Here’s how @AHSD25South teacher @MsFalknor inspired a love of learning in her middle school class. 💙 @ahsd25 #southlearns #edtech #youcanlearnanything https://t.co/9e1tibUPCH RT @educationweek: .@khanacademy launches education app for the pre-K and kindergarten crowd. https://t.co/m8Lfj2719y https://t.co/8R8ICIcU… @levi Hi Levi, thanks for reaching out, and sorry for the slow reply! Are you still having trouble seeing your mastery points? @Masterxtp1 Hi Zak! Which position? RT @EducationCase: @khanacademy make it easy to download their  videos. This is why the students on Takawiri Island now have math videos ev… @AlexDevero No current plan but you can make content requests here! https://t.co/w9n8KCMKK5 😀 @renbex No current plan but you can make content requests here! 😀 https://t.co/w9n8KCMKK5 @fairoozzahin Hi! Thanks for reaching out. We partner with @CollegeBoard on #SATPractice. For technical issues relating to SAT Practice on Khan Academy's website or apps, please visit our help center: https://t.co/D9xiuCZlbD For any other problems, College Board is your best point of contact! RT @KaoliverOliver: Using my lunchtime wisely this week and loving the @khanacademy course on the history of Islamic art. Would definitely… @soul_on_fire_4 @Official_LSAT Law School Admission Test! Good luck to everyone taking the #LSAT today! You've got this, future lawyers! 👊 If you're taking it later this year, check out our #FreeLSATPrep pronto! https://t.co/yzcvoodF9k 💯🆓✅ @Official_LSAT https://t.co/2wXGZ3QlCm Happy #SharkWeek from #BabyShark! 🦈💙 (sound ON 🔊 for maximum catchiness) \n\nFind more @SimpleSongs in our new #KhanKids app: https://t.co/OQ8tSh9Xp1 https://t.co/8yVZhaNirN RT @majiksourcer: Really proud of Owen (10 y/o son) and his Javascript programming. Thx @khanacademy big ups 🔥🙀🔥 @julianne_meiu 👏🙌💛 RT @WILDestdreams_3: Before and after using @khanacademy to study: https://t.co/EmFcbLvRtA Water balloon fights, harlem shakes and dance parties?! Just your average Friday afternoon in class @withmrbauer! 🎉 #ClassroomGoals #FeelGoodFriday #TeachWithKhan https://t.co/1vkugfl494 RT if you'd like to hear #DarthVader narrate a Khan Academy video 🖤 https://t.co/qc9uDOqXGP RT @ManagerSakoori: When you reach 1 million 👌👌👌👌@khanacademy https://t.co/pRblAn4cs8 RT @duckduckmoose: Happy to see Khan Academy Kids featured in the @AppStore in “New Apps We Love” and “Kids Apps We Love” 😄😍❤️ So much love… @ManagerSakoori 🤩🤩🤩 @esanzi Great to hear! Thanks for sharing ❤️ Congrats to Beth Boas 🎉 our first Teacher Training winner!\n\nYou could win a trip to San Francisco worth ~$5k by finishing our free mini-PD: https://t.co/msvkfabKCh Next drawing is July 31.\n\nTweet your certificate w/ #khanteachertraining + tag another teacher for an extra entry! https://t.co/JRWMBDVy7i @MoMoLovinJesus Never too early in our opinion! @ShitcoinSherpa Thank you! And yes we do! It’s a bit complicated though. We’re working on making it easier! @Juli_Ree 💖 @kaylinxabreu Sorry to hear that Kayli! If you could submit a help request at https://t.co/D9xiuCZlbD our support team will look into it! RT @ellie_mor: I’ve gotten to the point where the guy’s voice from @khanacademy videos actually soothes me #NelsonMandelaDay 📚🌍✊🏾✊🏼✊🏿✊🏽✊🏻 https://t.co/6cKp5lus68 @ImNotUrMommy Thanks for your support Paula, and for helping us spread the word! 💖 @eeswellnesslmt Happy Birthday Sebastian! 🎈🎈 RT @eeswellnesslmt: Feeling very grateful for the Khan Academy once again! Just in time for Sebastian's second birthday, here comes a great… @SamofScience Thanks for your support Sam! 😊 @ccorey223 😂😍 @shishirjain097 Great to hear! @sandeepmaini108 Thanks for your support Sandeep and for helping us spread the word! @MwongeraMwaran1 Hi there! This is part of our AP Physics content. Find more here: https://t.co/P4aNay7qBI More coming soon! RT @TamirOmara: One of the most useful websites on the internet for kids and adults alike: @khanacademy &lt;3 @AubreyDesigner Thanks for giving back Aubrey! 😍 @JoshuaQuinn4 Keep practicing and it will click eventually! @jamshed_bijly Thanks for your support! RT @blehhblehblehh: Found out that I’m an #APScholar with distinction and again I just want to say thank you @khanacademy 😢 @YoungCarti6 Hmmm iIt could be related. If you submit a help ticket our support team will look into your case! https://t.co/D9xiuCZlbD @hienqnguyen Thank you Hien! 🙏 @TracyClark08 @duckduckmoose Great to hear! 😁👍👍 @IamRKVeluvali 🙌🙌🙌 RT @TheNCMC: Is there anything that @khanacademy doesn’t teach. Y’all are fr saving lives out here 👏🏻👏🏻👏🏻💯 RT @activelymoving: @Salkhanacademy doesn't know this, but he helped me learn Calculus through his awesome YouTube tutorials many years ago… @ghazanfer77 Hi Ghazanfer! Thank you so much for your donation! Sorry about the typo. Our email system would have pulled that directly from our donation form, or your Khan Academy username. We’d love to fix it so it doesn’t happen again! Could you send us an email donate@khanacademy.org? 🙌 @massimo_mauro Thanks Massimo! 😀 @NatGeoEducation Thanks for the shout out @NatGeoEducation! @ahmedhaniie 😂 Let us know if you have any suggestions on how we can spread the word @clearwater82 Thank you Suv! 🤩 @GrbyDmrtrk 🙌🙌🙌 Thanks Gürbey! @mrs_queen_b Thanks Karen we really appreciate your support! @mrsumscience Thanks Jeffrey! Love your work. RT @mrs_queen_b: My students love the lessons, videos and badges they earn. Therefore, I just donated to @KhanAcademy. Join me in supportin… RT @mrsumscience: I would not be where I am today if it were not for Sal, so I just donated to @KhanAcademy. Join me in supporting a free,… @DarrenTBeck Thanks for your ongoing support Darren 🙌 and for helping us spread the word! RT @DarrenTBeck: Challenging folks 2 donate one-time or monthly 2 @khanacademy so they continue 2 offer what they do 4 free. Know it has he… @timtrice Thanks for your support Tim! 💚 @BNwufoh ❤️❤️❤️ @Blake_Sager Thanks Blake! 🙌 @FrancescaShiekh Thank you Frencesca! 💙 @thdanieljackson Thanks Daniel! 😊 @JSpell_C3D @salkhanacademy 🙌🙌🙌 @MagicMamaHC Thanks for your support! 💖 @thanhtienle ❤️❤️❤️ @Becky858 @salkhanacademy Thank you so much Rebecca for helping us spread the word! @heathnewburn Thanks Heath! 💚 @MrsWeiseNMS Thank you Tracey! 🤩 @dale_cuilla We experienced an issue with a Google Cloud outage today but should be all good now, sorry for the interruption! @realphilandes Thanks Phil! 😊 @kimschles 🙌🙌🙌 @MrsCupps3 Thanks so much Kim! 💖 @johnsonldc Thanks so much for your support! 🙌 @okaganakkilic We have transcripts for most English videos, and are working on these for other languages! RT @kajobrien: My 16-year-old just walked in the room and proclaimed, “I really like the Khan Academy SAT practice!” @khanacademy https://t… @nicolechart Thanks Nicole! @DopePavelow Thanks for your support! ❤️ RT @Morris_edu: Just signed up for free with @khanacademy to learn #chemistry in preparation for next semesters class. Thank you for making… Happy #WorldEmojiDay! 🎉 \nHere's the #PeriodicTable in emojis. 😍 \nCan you figure them all out?! 🤔\nLearn more: https://t.co/mGkSVNUsJ6 🤓 \nOriginal credit: @nicgaston 👏 https://t.co/XUCI1jR4h6 🚨 LAST CHANCE 🚨 to help us raise $1 million to change 100,000 lives with the power of #FreeEducation! ✊ Every donation today will be matched. 💸💸 Double your impact by giving today: https://t.co/UP2TdpKs3R #nonprofit #changealife #changetheworld RT @teacher2teacher: What summer rituals help you recharge for the new school year? #MondayMotivation via T @lesahaney https://t.co/A8dyRrg… RT @kailkull: If you or your loved ones have used Khan Academy, you owe them your gratitude. I just donated to @KhanAcademy. Join me in sup… @BurkettYYC Thanks so much Justin! @AbhayBhardwaj99 🌠😍 @nampholsaen Thank you Yochit! @MathwithJoshG @Centennial_SD 😂 @zhowez Thanks for your ongoing support Zach! 🙌😊❤️ @sameerdesai95 Hi Sameer, thanks so much for supporting Khan Academy! Sorry to hear we weren't able to process your transaction. Please email our team via donate@khanacademy.org and we can provide you with some alternative methods! 🙌 @amerikanchris Thanks Chris! We really appreciate your support. 🙌 @obealyves Thanks for your support Yves! @greneggsnham Thanks for your support Jacqueline! 💚 @onenonblndph Thanks for your support Pamela! 💖 @F_ili_n Thanks for your support Andrey! 💚 @MelindaHamby Thanks for your support Melinda! ❤️ @alexanderrusso Still here! Going strong! 😀 https://t.co/YFMDaGEEiA @JosephB30102901 @CollegeBoard Hi Joseph, we partner with College Board on Official SAT Practice. While we're not involved in test administration or scoring, we empathize with students who received a score below their expectations. 😔 Please contact College Board for any questions related to scoring. @ericajustis @CollegeBoard Hi Erica, we partner with College Board on Official SAT Practice. While we're not involved in test administration or scoring, we empathize with students who received a score below their expectations. 😔 Please contact College Board for any questions related to scoring. @eldergeek Thanks for your support Don! @seanwallawalla2 ❤️ @Jordywardy233 Hi Jordan, thanks for reaching out! We have no plans to extend our college-level curriculum, as we're focused on expanding our Pre K–12 content and localizing around the world. But you can submit a particular content request to our team here: https://t.co/w9n8KCMKK5 @sunnysm101 Thanks for your support Susan! 💖 @ashtonjpeck Thanks for your support Ashton! 💚 @tmooz Thanks for your support Tony! 🙌 @ricky_Halim Thanks for your support Ricky! @kapforce Thanks for your support John! 🙌 @kailkull Thanks for your support Kailash, and for spreading the word! 🙌 @vijaygovindan17 Thanks for your support Vijay! @PamStrandberg58 Thanks for your support Pam! ❤️ @Cagliostro_NL Hi there, sorry to hear you can't access our site! Submit a ticket to our help center: https://t.co/D9xiuCZlbD and our support team will look into it. @PlantinCity Thanks so much for your support! @med44 Thanks for your support Carlos! 🙌 @grizzelda Thanks for your support Lynn! 💚 @SHuggins67 Thanks for your support Sharon! ❤️ @efeprat @duckduckmom @duckduckmoose @SimpleSongs @BellwetherFlock @NatGeoEducation Yes! You can find our Android app here: https://t.co/sgOFHrqCuF (in beta) @MGLDash 🙌 @MGLDash Thanks for your support! 😊 @B3aT Thanks so much for your support! @Sofianbb Thanks for your support Sofian! 🙌 @ChoyHonYoong Thanks so much for your donation! 🙌 @ArcilaJoseph Thanks for your support Joseph! 💚 RT @THE_Journal: Nonprofit Khan Academy (@khanacademy) has launched Khan Academy Kids, an educational app designed for early learners (ages… @levi Hi Levi, thanks for flagging, and sorry you're having trouble loading our site! Would you mind sending more info via our help center? https://t.co/D9xiuCZlbD 🙌 Far too many people around the world don't have access to the education they need to achieve their dreams. Let’s create a better future together! Give today and help us reach our $1 million fundraising goal: https://t.co/UX6qdYh2AJ 💚 #dreambig #changealife #changetheworld https://t.co/MZTVW8WAf8 When you’re trying to announce your new learning app for kids… but your own kid keeps interrupting! 🤣😜\n\nHere’s the *blooper reel* from our #KhanKids launch earlier this week. As Azad would say, “download today!” https://t.co/OQ8tSh9Xp1 #earlylearning #edtech #education #free https://t.co/JK10r3Waux \"Parents learn to pick their battles. When it comes to screen time? #TheStruggleIsReal. Luckily, this new educational app might be a strong replacement.\" https://t.co/fHHujNRgCu\n\nThanks for the write-up @USATODAY! Download it here: https://t.co/rZS4LxDO6b #khankids #earlylearning RT @JackieJacobi: FREE for kids ages 2 to 5 from @khanacademy  Check it out!! https://t.co/GPwf3Ifeof Friday night plans sorted ✅ #khanacademyandchill https://t.co/XP90JTdM0Y @righthand239 @CollegeBoard Hi! We partner with College Board on Official SAT Practice. While we're not involved in test administration or scoring, we empathize with students who received a score below their expectations. 😔 College Board is your best point of contact for any questions related to scoring. @Ady Thanks for the feedback! Please send any other comments and suggestions our way: khankids@khanacademy.org 🙌 Here are just a few of the faces and lives changed by #khanacademy. Help us change 100,000 more by pitching in to our $1 million fundraising goal! https://t.co/UX6qdYh2AJ\n\nTogether we can create a ripple effect of free, world-class education for all. #changealife #changetheworld https://t.co/vTq5vivznm RT @ImNotUrMommy: It's that time again. You can provide anyone, anywhere a free, world-class education. Access to #education is life-changi… RT @EdMarketBrief: The new @khanacademy for young children will use #gamification and animated characters to guide students' learning. @duc… Say g'day to #SandyTheDingo! 🦊🇦🇺💛 A free spirit from Australia who teaches shapes and patterns in our new #KhanKids app! 😍 Download it here:\n🔶 iOS: https://t.co/AwmRXUad4j\n🔶 Android: https://t.co/sgOFHrIdTf\n🔶 Amazon: https://t.co/xIwZnIzsM7\n#edtech #earlylearning #free https://t.co/vkaejZ21X3 @MrBodde Great to hear 😊❤️ Stay tuned for more on our back to school updates in August! 3 ways #KhanKids can have a deep impact on child learning &amp; school readiness:\n1️⃣ Personalized &amp; active learning\n2️⃣ Comprehensive curriculum &amp; holistic approach\n3️⃣ Free for all, increasing accessibility for low-income\nhttps://t.co/juchR90A5L via @Volcoucou @omidyarnetwork @MrBodde Hi Richard! Thanks for reaching out. It's true, we have a few changes coming that we're pretty excited about! Should be able to reveal more in the first week of August. Does that suit your timeline? RT @rtdonnel: Khan Academy Kids for young learners from 2-5! I know what Nora and I will do together after work today! https://t.co/8ztmLX4… RT @DinkyNerds: The new Khan Academy Kids app is a parental godsend. Plus it’s free! https://t.co/Pi8uYKaRrf | @coolmomtech https://t.co/bI… Introducing #KodiTheBear 🐻💚🤗 from our brand new app #KhanKids! Our trusty guide throughout the learning experience, she’s enthusiastic, optimistic, fair, and will encourage kids to keep trying. 👍 Download here: https://t.co/OQ8tSh9Xp1 🆓 for #iOS #android and #amazon! #edtech https://t.co/Zlp9nmtxj6 RT @ShantanuKSinha: It's a good day for parents everywhere.  https://t.co/AblC7bjoMk @BillGates Thanks for your support @BillGates! 🙌 And hi to everyone else! We're trying to raise $1 million this week to help another 100,000 students like Anjali. Can you help? Pitch in here: https://t.co/UX6qdYyDsh 💚 RT @BillGates: “I want to change the world, and education is the best way to do it.” I support @khanacademy because of students like Anjali… Our new app #KhanKids features 100+ videos from the beloved @simplesongs! Including one of our favorites: #babyshark. 🦈🎶😍💙 Download today: \n➡️ #iOS: https://t.co/AwmRXUad4j\n➡️ #Android: https://t.co/sgOFHrIdTf\n➡️ #Amazon: https://t.co/xIwZnIzsM7\n#earlylearning #edtech https://t.co/qRJ36NA1st RT @kidscreen: #KhanAcademy enters preschool app space with @SkyshipEnt https://t.co/IcY5uNBM7t https://t.co/J4ZstVnUaL RT @NatlHeadStart: Exciting news: after our sneak peek at #NHSA18, today @khanacademy is launching Khan Academy Kids! A fun, free education… RT @coolmompicks: New from @khanacademy + @duckduckmoose = a fabulous, free educational app for kids! https://t.co/L42A5Ta1Sl @TheFatLebowski Yes! https://t.co/xIwZnIhRnx RT @SpAraMustafa: @khanacademy Brilliant! I don't have any kids but my future kids WILL use #KhanKids. I'm 22, finished a university degree… RT @BlckWomenCrypto: Congrats to the @khanacademy team on today’s launch of #KhanKids! Can’t wait to play this with my 3yo! Instilling a lo… RT @mrkennedy_pccsd: This. Is. AMAZING! https://t.co/kMkgNkXQFu @SaraOhlin222 Thanks for your support Sara! 🙌 @Silverbait Thanks for your support! 🙌 @ariannahuff Thanks for your support Arianna! 💚 Big news for little learners! 🎊 Today we're launching #KhanKids: a free, fun educational program for young children. Download today &amp; inspire a lifetime of learning! 😀\n➡️ iOS: https://t.co/AwmRXUad4j\n➡️ Android: https://t.co/sgOFHrIdTf\n➡️ Amazon: https://t.co/xIwZnIzsM7 https://t.co/27KfQjIbgw RT @adesgeorges: I love @KhanAcademy and spend hours on it learning about everything. Join me in supporting a free, world-class education f… ✨ Access to #education is life-changing. ✨ This week we’re raising $1 million to change 100,000 lives. It's a HUGE goal, and we need your help! Pitch in here: https://t.co/UX6qdYh2AJ and help us spread the word. 📢 #nonprofit #changealife #changetheworld https://t.co/bPbwOKgGhJ @Aly_Jwd @PamStrandberg58 Hi Aly, this week we are raising $1 million to change 100,000 lives with free education. You can pitch in here: https://t.co/UX6qdYyDsh Thanks for your support! 🙌 @jhinksj Thanks Aira! 💙🤩 @AntoniosHadji Thanks Antonios! 😊❤️🙌 @kathydenious Thanks Kathy! @acyuta1008 Thank you!! 😊 @liorsolomon Thanks for your support! ☺️ @MoiGrunwald Thank you! 💙🙌 @fastenerprosorg Thanks so much for supporting our fundraising campaign! @PamStrandberg58 Thank you Pam for your support! ❤️ @Dalal770 Thanks Dalal! 🤩 @sfmike Thanks Mike and family! 💚 @GillesPoupardin Thanks Gilles! 🙌 @wainstead Thank you Steve! We appreciate your support 😊 @HVerstreate You're the best Heather 💚 We're lucky to have you as an ambassador, fundraiser and video star! @dgburris @crewsertech Shoutout to @pamelafox! @JMurphy_007 Thanks so much for your support! 💙 @AugustineFacts Thank you Augustine! 🙌 @nervgh Thanks Alex! 💙 @EngrSMukhtar @LearnEQ Can you help out with this query? 😊 @Cyberdelicious Thanks for your support Leonid! ❤️ @MichaelMcCue9 Thanks for your support Michael! 🙌 @abhaypandit94 Thank you Abhay! 😊 @ZacharyT123 Thanks Zachary! 🙌 @iva_erceg Thank you so much Iva! ❤️ @RobScott3 Thanks so much for your support, Rob! @smsrkr Yay! How old is your sister? @PamStrandberg58 Thanks for your support Pam! 🙌 https://t.co/UX6qdYyDsh 🙌 https://t.co/Aut3H4a5Nn @FAmirshoev Yep! Our math content is aligned to the common core. Start at whatever level you feel comfortable and work your way up! @HimujjalU Thank you so much for your support! 🤩🙌 @ClintRhea Thanks so much for your support! 🙌 RT @ClintRhea: I support @khanacademy with a monthly donation, because open and free education benefits all of us. I also personally use it… RT @TeachinginStyle: I just took my first khan academy official LSAT practice test. I increased from my diagnostic test 8 points!I am truly… With your support, Khan Academy is changing the lives of children like Anjali all over the world. #Education is the key to unlocking their potential. This week we're raising $1 million to change 100,000 lives. Can you help? https://t.co/UX6qdYh2AJ 💚 #changealife #changetheworld https://t.co/kvjzfjWaec RT @dannhiday: *Joining Sal Khan appreciation band wagon*. I also want to thank him for the physics and math videos. Really help me up in m… RT @ata_stat19: The proud mum to three of the 60 million users is #grateful 🙏🏻 #khanacademy rocks! #sharingknowledge for free is #sharingec… @H_Ghammas No plans sorry 😞 but some of our content might help you prepare anyway! @nguyenbaoidol Glad to hear it! 😁 RT @lilzephyros: On the real, Khan Academy is teaching me everything I didn’t learn in my math class. #Blessed RT @SandeepBapna: Thanks @MohnishPabrai and @DakshanaIndia team for stopping by today at @khanacademy India. Looking forward to doing many… How to kick butt at both #taekwondo and the #SAT?! “Your brain is like a muscle and just like with sports, if you want to get better, you have to practice.” 🥋💪📈💯 Get started here: https://t.co/Ka97hEHJKj @collegeboard #SATPractice https://t.co/PRXBVKOBE4 RT @Ms_Bucciero: Got to take a selfie with Sal Khan the founder of @khanacademy at #NAESP18 thanks for sending me @dcpublicschools https://… RT @awsp_ron: @khanacademy reminds us that Khan was never meant to replace the human interaction. It is meant to supercharge learning and d… @LisaDFlee @AspenInstitute https://t.co/Z4iEH55kLx @MiloJo89 @xNicoleWasHere Thanks for helping us spread the word! RT @christinalaoshi: The only thing cooler than hearing @salkahn speak is getting to take a selfie with him @NAESP #NAESP2018 #booksigning… @SuptSchauer @KathyLucchesi @NASA @NASA_Astronauts @GJUESD @EarlyImplement I spy @IronFeep! 👀 @Johneichlerahhh 😂 @OERKhanAcademy @jasondhovey @meaghanpattani @MathwithJoshG @ccorey223 😍 What a bunch of rockstars RT @BlossJulie: Thank you @NAESP for providing me with the opportunity to hear Sal Khan @khanacademy speak.  He has been such a positive in… RT @Cardwell16: Sal Khan, a hero to educators and students across the world,  presents  @NAESP #naesp18.  You are an educational rockstar!… RT @willdjones1: Learning to reimagine education with Sal Khan @khanacademy #NAESP18 https://t.co/MLcr2mQLwG @manitejaalapati Not exactly but this might be of interest? https://t.co/BULSorsYC2 RT @WorleyNate: My AP World History test score came in today and if it weren’t for @khanacademy I couldn’t have ever made a four. @Johneichlerahhh 😆 What's the question? @schwinn3 Hi Steven, is there a button in the bottom right of the video that will take you to a full video player? That should open up a new window with a YouTube embed. @deformeddog420 🤣 RT @GGMattt_: I've stumbled at a bump in my Physics studying. My lack of Algebra &amp; Calculus is really making it harder for me to learn.\n\nI'… RT @jscottpearson: Thanks to @mayli from @khanacademy for stopping by to chat with the @figmadesign team during our Maker Week. Some words… @tonyzhao_ Congrats!!! 🤩🤩🤩🤩🤩 @DerBorutzki ❤️ RT @RBLworkerFE: Going back to basics on multiplication with @khanacademy while waiting for prospective students to try tiling. I never tho… RT @GGMattt_: Having a wild Friday night 😄@khanacademy https://t.co/xLmCLQ9TWq @leanatax7 Phew that was close! How would you like to be reminded? RT @suzahooke: shoutout to @khanacademy for helping me get a 4 on my AP World exam! @barkitscass @CollegeBoard https://t.co/PEj7qeuyCr 🤩 @barkitscass @CollegeBoard Would you mind if we posted this pic on our Instagram? 🤩 @Nicoliolioki @chemminions @tyleradewitt Great work!!! Congrats 👏👏👏👏👏 @johnds61 Nailed it! 🤩 Congrats! 👏🙌 @gracehaak 👏👏👏👏 Congrats!!!! @barkitscass @CollegeBoard Woohoo congrats!!! 👏👏👏👏👏🌟🌟🌟🌟🌟 RT @barkitscass: just a pic of me and my bf after we found out I got a 5 on AP Art History!!! thank u @khanacademy !!!! https://t.co/G1mPzu… RT @AndreAlessi: Shoutout to @khanacademy for transforming me from an innumerate goofball to someone who unironically refers to solving sys… \"We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.\" #DeclarationOfIndependence #IndependenceDay https://t.co/qXvTX7RFF1 @peachyicedtae @hppypjm 😁 @peachyicedtae @hppypjm YOU CHILL OUT @hppypjm SORRY ABOUT IT 🙄 TAG US NEXT TIME OK 🚨🚨🚨 RT @IronFeep: *End of year review*\n\nManager: What did you do to go above an beyond your normal job responsibilities?\n\nMe: Uhhhh, I turned t… @mcatstudent21 Thanks @mcatbros! 📢🇺🇸 TEACHERS! 🇺🇸📢\n🚨 Are you the winner of our June giveaway?! 🚨\n📧 Check your email (work &amp; personal) to find out! 📧\nWe're giving away another trip to San Francisco in July. Finish our free, 60min #khanteachertraining course to enter! https://t.co/msvkfatltP #miniPD https://t.co/Nzg6ZYpGmJ @hppypjm WHAT ARE WE TAKING RT @openculture: Pixar &amp; Khan Academy Offer a Free Online Course on Storytelling https://t.co/DUycUMwiMk https://t.co/DJQcLSZ1KK @_0zman_ He does! @salkhanacademy @chetrisunil11 Hi Sunil! Our @khanacademy India office are huge fans! We'd love to explore ways to work together. Let us know the best way to get in touch, or follow us so we can send you a DM. 😊 @Damian79417833 💯 https://t.co/GFyeTTDpqW @xoiiku 😂 Hey Saffron. What have you got against pawsitive reinforcement? https://t.co/Htqgz83Aon @CarbonBat 👏🙌🤩 RT @CarbonBat: This may mean nothing to most; but to me this is the world. The result after a year of studies on @khanacademy and there's s… @WoodbridgeHS Hi! We're trying to get in touch with Elizabeth Boas, a math teacher at Woodbridge High School, who has been selected as a potential Grand Prize winner in our Teacher Training Sweepstakes: https://t.co/PcgFb26fF9 Can you help us contact her ASAP? Many thanks! RT @LBiPD: How powerful to see Lori Andrews' Ss in her Moderate/Severe Summer School class using Khan to learn, build skills, &amp; check und'n… @PWCSNews Hi! We're trying to get in touch with Elizabeth Boas, a math teacher at Woodbridge High School, who has been selected as a potential Grand Prize winner in our Teacher Training Sweepstakes: https://t.co/PcgFb26fF9 Can you help us contact her today? Many thanks! https://t.co/1OM1lsktqH RT @ReddigWrites: I just found an awesome resource on @khanacademy for my unit on storytelling - https://t.co/FJnJN7Tp50 RT @ragingfire413: I just mastered Precalculus (and Trigonometry) before starting 9th grade! Thanks so much for the head start @khanacademy… @TendancesScenic It's free! If internet connectivity is an issue we have an offline version called @ka_lite which our partners at @LearnEQ can tell you more about 🙂 @janetazizeh 💘 RT @janetazizeh: Shouts out Khan Academy for being free and getting me through my first college class @khanacademy love you bitch 💓💞💝💝💖💗 10 years on and still going strong! 💪 Thanks for being part of our movement towards a free, world-class education for anyone, anywhere. We wouldn't be here without community support! 🙌 Learn more in our annual report: https://t.co/dw5l8u20wS https://t.co/N7lqTPJnnq RT @CollegeBoard: Challenge yourself! Set a goal for how many hours you want to spend practicing for the SAT this summer, then start workin… RT @Stephaniekparks: Thank You @khanacademy for the introductory videos on coding! My 9 year old daughter loves it! #stem We can help with that! ✅ https://t.co/wPA8HBPiti @csbaloch22 Sorry to hear! You should be able to submit a help request without logging in? @xFreeus How did it go?! @Maria12461456 No acting course sorry! @SPC0de https://t.co/D9xiuCZlbD thank you! 🙌 @_Railed_ No plan for that! But you can submit content requests here: https://t.co/w9n8KCMKK5 @csbaloch22 Oh dear! Is it working yet? If not, submit a support request to our help center: https://t.co/D9xiuCZlbD Ever dreamed of becoming a film director? 🎥🎬🌟 Find out how to get there (and what it's actually like) in our new #careers series: https://t.co/IkTcW37ngb https://t.co/h5HWsgAPOE Calling all 🇺🇸 teachers! Complete our free, 60min #khanteachertraining course by midnight tonight (PT) for a chance to win a trip to San Francisco! https://t.co/msvkfabKCh #edtech #teacherPD #teachwithkhan \"If we had said 20 or 30 years ago, “Let’s personalize education for everyone,” the notion would have felt utopian. But the types of tools Khan Academy is trying to create, makes it doable.\" – Sal Khan https://t.co/de1a9Jj478 via @aspeninstitute @aspenideas #AspenIdeas RT @OfficialSAT: #SATPractice on @khanacademy helped Jose boost his SAT score and get a full ride to Yale. 🙌 https://t.co/QYO1QUG8J4 https:… @zhowez Hey Zach! Hope you're well. This article might help explain the difference: https://t.co/BDjZLdPrm8 basically we've released an updated version of our calculus content 🙂 @PttPrgrmmr 😞 Sorry to hear you're not enjoying our UX! We welcome feedback here: https://t.co/D9xiuCZlbD RT @Phaugens: Layne continues to spend 5 or 10 minutes each day completing his ⁦@khanacademy⁩ summer challenge. He just started a ⁦@CommonL… @prar_s 💚💚💚💚 RT @prar_s: Khan Academy's growth doesn't surprise me at all.\n\n✅Solid product\n✅BEAUTIFUL (and my favorite 😍) mission: providing a free, wor… We've come a long way, baby! \n6️⃣0️⃣ million registered users 👩🏾‍💻👨🏻‍💻\n3️⃣0️⃣ languages 🌍\n1️⃣0️⃣ BILLION practice problems completed ✅\nThanks for your support! 🙌 \nLearn more in our annual report: https://t.co/dw5l8tKp8i\n#nonprofit #education #khanacademy 💯🆓 https://t.co/g8QhniNHmT RT @illluminari_: Mom: “you need to like.... talk to friends”\nMe: I have Khan Academy https://t.co/wuuZK5bpcI RT @a_teachers_hat: How many of you have used @khanacademy in a classroom. Does it prove to be an aid in deciding teaching methods or helpi… RT @NicoleIppoliti: .@khanacademy talks about #Sultana, a young woman from Afghanistan who was barred from school from the Taliban, used @k… RT @AtlanticLIVE: In our usual lecture-homework-test model, we identify gaps in understanding — questions students got wrong on the test —… RT @AtlanticLIVE: .@khanacademy now has 62 million registered users across 190 countries, says Sal Khan at the Education Reimagined session… RT @AspenInstitute: The idea of personalizing education for everyone can feel utopian — but @khanacademy founder Sal Khan is trying to crea… Today we're streaming live from @aspenideas! Tune in at 10:30am PT/11:30am MT/1:30pm ET to see @salkhanacademy and @MAKtweeter discuss the transformative impact of technology in the classroom: https://t.co/PumBpT6Kqz #AspenIdeas #edtech https://t.co/xcK2B4HbWT RT @ernieshutup: My night consists of studying on Khan Academy, music, and chilling afterwards. @nmasc_ Hi Natasha, thanks for reaching out! @IronFeep from our comms team will be in touch. RT @EleaTiri: Me: I want to do a Khan Academy maths mission\nKA: Do some probability and statistical analysis\nMe: https://t.co/RDTyxQmbih @BlackElleWoods1 Here are some pros! It's free, features 1000's of official practice questions from real tests plus step-by-step lessons and explanations, and is personalized to your strengths, weaknesses and schedule. https://t.co/ttsjR4dGU9 @Teach21AWB Love this, thanks for sharing! ❤️ @Urbangirl744 Why tho https://t.co/ALNcVlkAhp @EleaTiri  https://t.co/q9OTbI1a5Y RT @JoshWComeau: At Khan Academy, we tend to call the people who use our product by what they do: learners and teachers. Helps remind us th… @Maria_Morr_ 💚 RT @Maria_Morr_: TFW your former 6th grade student texts you for math help for their first COLLEGE class!! 😊😊😊 @khanacademy #mathteacher ht… RT @jpgard: Very interesting @ldnfestlearning presentation by @zpardos on a scalable representation method for clustering student misconcep… Dream big! https://t.co/rWLBZfNNhu @ninggs2 😂🙌 Super excited to launch Khan Academy in two new languages: #Czech and #Tamil! 👏 Huge thanks (děkuji!) (நன்றி) to our partners and HUNDREDS of volunteers who translated THOUSANDS of videos and exercises! 🙌 More to come: https://t.co/hwI2eCEl5N @KhanovaSkola @VetrivelF https://t.co/gFCwTmwf1N RT @BeingWellness: Did you know you could learn for free?  Search out the Khan Academy or  Coursera for more information on free online cou… RT @DeaverDean: Completed my Khan Academy For Teachers! Have you? @khanacademy #khanacademy #summergoals #math #mathisfun https://t.co/ejIo… “We have kids who are way up here ⬆️ and kids who are way down there ⬇️ and I’m trying to teach here in the middle.”\n\nLearn how to use @khanacademy for #differentiation in our free teacher training course: https://t.co/PsVc4ylLrB #ISTE #ISTE18 #khanteachertraining #edtech https://t.co/BPDiW9xSjA RT @OfficialSAT: Nope, that’s not a typo. 🧐 Jazmín’s score took a huge jump after she used free #SATPractice on @khanacademy. https://t.co/… RT @garvinthomas: If a young woman studying for her LSAT while getting #dialysis isn't a picture of #hope and determination, I don't know w… RT @adhaamehab: I just found World history course on @khanacademy and I'm the happiest person right now!! Check out this interview with our very own product designer @lalizlabeth on @interfacelovers! 💖 https://t.co/1i1jE871Qz @ehelm3 It’s true, sorry to disappoint! It’s designed to be fully functional in a mobile browser though! RT @haque356: Preparing for upcoming @OfficialSAT and SAT Subject tests by using @khanacademy \nKhan Academy is the best resources to practi… Can you see the soccer player? ⚽👀🤔 Learn more about Umberto Boccioni's painting in our lesson with @MuseumModernArt: https://t.co/iWnfSrMQ8m #worldcup #fifaworldcup https://t.co/2ofdnrzmD2 @iboruta 👏👏👏 @SMarshall_edu More info coming soon! Stay up to date by joining our #LearnStorm2018 mailing list: https://t.co/9TKvzoYE1T @morri85 You can practice stats and linear algebra on our regular website, outside of the test prep! Try https://t.co/sxgsDqO7SL and https://t.co/aUwXLhYHAG If you get stuck on any of the practice questions you can review the topic via related video or lesson. RT @janicetanying: How have I not discovered the wonder that is Khan Academy? Amazing stuff. #whenyoucantMath RT @KilroyTedBusto: Letting Aden code on @khanacademy and my little scriptkiddie drew a scriptkitty. I think I'm raising him right. I think… @mcatbros Hmm thanks for flagging, what’s the website? RT @CreevyKieran: Finally understand Acceleration and Velocity! :D @khanacademy https://t.co/vQpIg1MeBr @jboschaiguade For sure, we take user feedback very willingly and seriously! We are a small team so we can't always act on the information right away, but it will definitely be added to our to-do list! @lidselarv Sorry we can't be of more help 😔 but we believe in you! Keep trying and seek out other supplementary resources. It will click eventually! RT @blackgirlmed: Nothing has ever been dependable in my education as @khanacademy. Sal’s videos are always so helpful. https://t.co/cHrBhq… RT @FarisaKhalid: Happy Birthday to #HenryOssawaTanner, born #OnThisDay in 1859. A few years ago I wrote some essays about two of his paint… RT @OfficialSAT: Just 15 minutes of practice a day will help you get ready for the SAT. It's really easy to create your practice schedule o… Happy #NationalSelfieDay from the team at @khanacademy! https://t.co/A1Xr40TlAX RT @bigtechcoach: .@khanacademy is offering free self paced teacher training now until August. Complete it before June 30th for chance to w… @lidselarv What subject? @BenTearzz Hi Ben! Get in touch with our support team via https://t.co/D9xiuCZlbD 😊 @jboschaiguade Thanks for reaching out! If you could send bug reports here that would be greatly appreciated: https://t.co/D9xiuCZlbD 🙌 @shun Hi Shun, our support team can help with that query! They are contactable via https://t.co/D9xiuCZlbD 🙂 RT @KinderKollegePS: Look @khanacademy at what Jovan  coded this morning! What delicious code! Thank you for giving young coders like Jovan… RT @Aditya85281166: Started Calculus about a week ago. Already loving it! Huge props to Sal @khanacademy for eradicating my absolute hatred… @MeshaLittle 😬 Thanks for flagging! Could you submit this as a content error to our help desk? https://t.co/D9xiuCZlbD Thank you! 🙌 RT @BitOfMischief: Day 3 of #100DaysOfCode - I continued to work through the Javascript program on @khanacademy! Functions are the theme of… RT @HarryChemay: @madisoonn_ @khanacademy Math has all sorts of wonderful applications.  But seriously, @khanacademy rocks!!! https://t.co/… #Juneteenth June 19th 1865 marks the day that emancipation started being enforced in Texas, and is celebrated as the end of slavery in the US. Learn more about the #EmancipationProclamation on Khan Academy: https://t.co/2Va2AcjoVd RT @mathgeeksrock: A big ‘thank you’ to @khanacademy for your #APstats lessons. I’ve completed 132 lessons, with about 240 left to go befor… We have a special tool for that! https://t.co/1bPlKlCVHp https://t.co/LEoG3RjGPx RT @NatlHeadStart: #TuesdayThoughts from @khanacademy creator Sal Khan. #Edu #ECE https://t.co/3nT93TU29i RT @luluevelina: Chemistry has always been scary &amp; intimidating to me &amp; I have to take it for my application to midwifery school I CANT TEL… @IsaacHdezF Hi Isaac, we are working to change education in Mexico, and would be very glad if you could join us! Please follow us so we can send you a DM with more details. 😊 @belindapop Hi Belinda, we are working to change education in Mexico, and would be very glad if you could join us! Please follow us so we can send you a DM with more details. 😊 @LuisGerardoM Hi Luis, we are working to change education in Mexico, and would be very glad if you could join us! Please follow us so we can send you a DM with more details. 😊 @YourMathTut0r @dougfordham @MrM_Crosspointe Thanks for your interest! The course is only open to teachers in the US and India at the moment, but may be expanded in future! RT @ColleenAtUMSI: People sometimes ask about getting early exposure to programming for their kids. My 9yr old has started @khanacademy pro… RT @Bosnyan: @khanacademy I'm going to name my first-born child after Salman Khan. Regardless of gender. @Zanovitch17 😁 RT @Seal153: Just finished my third unit of Algebra 2 on @khanacademy I’m a little scared of how easy it is. I’m watching you Sal Khan 👀👀👀… RT @cainmarkomusic: Bruh @khanacademy is a life saver. All the math ive forgotten is here free and taught very well. From algebra to calcul… Want to win a college scholarship to @MIT, just like @yhaaaars?! If you're aged 13-18, enter this year's #BreakthroughJuniorChallenge! Submit a short video explaining a key concept in math, physics or life sciences by July 1. Learn more: https://t.co/2rKYuRglfq @brkthroughprize https://t.co/bxibzFr0tS Valerie knows what’s up 😎 https://t.co/U6izF5Wshw RT @kiroin: I just discovered that @khanacademy has a ton of free lessons on finance that relates closely to personal finance! I'll be watc… RT @anotherschwab: Kid2 has traded in her Kumon workbooks for @khanacademy this summer. https://t.co/CpNcnBVR46 @bskellie Hi Brian! If you submit a ticket to our help center then our support team can help you out: https://t.co/D9xiuCHKk5 RT @A_Walker359: I just donated to @KhanAcademy. Join me in supporting a free, world-class education for anyone,  anywhere! https://t.co/e2… “How is the guy from Khan Academy so knowledgeable?” 🤔 Here’s Sal with his secret formula for retaining information: it’s not about memorizing the *WHAT* … it’s about understanding the *WHY*! Thanks to @afamilyofslugs for this week’s #AskSalAnything. Tweet us your questions! https://t.co/xsukRoPhFF Hey 🇺🇸 teachers! This fall we’re bringing back #LearnStorm: our free, fun back-to-school challenge! Sign up now for updates, and get a head start on the school year: https://t.co/BHTr4fJ6hb #LearnStorm2018 RT @aspenideas: “To educate students for this changing environment, personalization is key.” – Sal Khan of @KhanAcademy.\nhttps://t.co/rdp9b… RT @labkovski: Congrats to my son Charlie for mastering the 4th grade mission.   July 1 he starts on the 5th grade mission!  #YouCanLearnAn… @glowkeyshia  https://t.co/GZfpwB26kQ RT @vioblet: @khanacademy i owe you my life, my grades, and my goat farm’s profits.    🐐📝💗 Snakes are cool though... right @taylorswift13? 🐍🐍🐍 @taylornation13 https://t.co/QxSKuTZiNK @alanis_emilie  https://t.co/5vuu8sFXHF ✨✨✨WIN✨✨✨\nWe're giving away two @Herschelsupply backpacks on Instagram! 🎒🎒🤗🎁\nEnter here: https://t.co/1xIt1SLfzf\n(🇺🇸 only, ends Sunday!) https://t.co/MmKP7qZyKl RT @who_cayres: My wife is learning to program. Teaching people to program is a hard problem space. She's starting with @khanacademy *Intro… RT @aced_it_tutor: Thank you @khanacademy for the #TeachingWithKhan Teacher Training Course! I'm excited to use your strategies as well as… RT @CollegeBoard: With thousands of practice questions, video lessons, eight full-length practice tests, and more, there’s no better place… \"On a good night I'd get an email from my best friend Sal Khan… Sal's always been there for me!\"\nCheers to @ScarboroughHS valedictorian Sebastian for the shout-out in his graduation speech last night! 😌🎓🎉 His advice? Balance studying with a social life for maximum happiness! https://t.co/jslFUIvkmU RT @Willow_Dale_ES: Another Kindergartener from @Mrs_Mahaffey_WD earns a @khanacademy shirt for mastering first grade.  This is getting to… RT @jerryporo: It looks like my son Vincent is sharing his math progress from @khanacademy. Keep up the hard work buddy, now let's find a t… @zvilchez7 Hola Zoila! Tenemos un mail de contacto en Perú: contactoperu@khanacademy.org Escríbenos para poder seguir conversando por ese medio. Muchas gracias! @rlhamp_13 @Official_LSAT Hi Rachel, we have no immediate plans to make LSAT Prep available on our mobile app, but it is designed for full mobile browser functionality! All the best with your studies. Anyone else think @TheRock sounds a whole lot like @salkhanacademy in the first few seconds of this clip from @DisneyMoana?! 👂🤔😆 https://t.co/fPJ2sx3jOJ RT @labkovski: 31 of my students celebrated mastering the entire 7th grade mission today!  Thank you Attilio’s of Tinton Falls for donating… RT @louiseallain: Despite daughter back in formal education, I have a sudden urge to watch Sal do some algebra, just for the fun of it @kha… @shelly_sachdev Here are the results: https://t.co/kNkNUBC9EV Sorry if we didn't communicate this better! We really appreciate all the entries we received and had so many great videos to choose from! @Teekam_Suthar As long as you are aged 18 on October 1 2018 you are eligible to participate in this year's challenge! Only 20 days left to enter: https://t.co/KzUElPIY9f @SoggothDaGoat ❤️ RT @HayleeMCarroll: Last day of school = First day to work on my to-do list!  \nKhan Academy for Teachers Certificate - check!\nNever stop le… @najd8171 Check out our Arabic site here: https://t.co/0jJC9vu5AU more translated content coming soon! @qharrington Our support team is available via https://t.co/D9xiuCHKk5 🙂 Hey 🇺🇸 teachers! Wondering how to use Khan Academy in the classroom? Here's a pro tip from @HVerstreate at @MasonSchools. For more tips (and the chance to win a trip to San Francisco!) check out our free teacher training course: https://t.co/PsVc4ylLrB #edtech #teacherPD https://t.co/drhCnTHuZW RT @rocker_jdb: #OverbearingDad: Summer Edition\nExploring the excellent @khanacademy US History class with my 9-yr-old boy...and stumbled u… @extremeweb35 Hi there! It's only available to teachers in the US and India at the moment. Where are you located? RT @endlysfighter: @khanacademy the introduction to chemistry video blew my mind! I took chemistry as a sophomore in high school not quite… RT @SinghArunabh: Who's going to teach the teacher?🤔\nWell the @khanacademy has been doing some fabulous work with students &amp; now teachers t… @NRahulpatel Love it! Did you use our new teacher training course? RT @AdakiMc: @khanacademy nothing better than learning something new everyday. Thank you for these videos RT @Chynaaaa___: 🗣🗣🗣Khan Academy has FREE LSAT prep!!! With questions straight from the LSAC... RT to help a prelaw student! @withmrbauer Hahaha this is amazing!!! @withmrbauer Oh no we missed our chance to interview you and the class! Any chance we could still interview you (over Skype) for a video about your class's incredible progress? RT @chatta_girl: Ok tweeps I have to brag on @khanacademy. I have had a fear and had convinced myself I couldn’t learn math. Funny I had 2… RT @stacyleeds: This is a game changer. @Official_LSAT partners with @khanacademy for test prep. https://t.co/tAR3WJysDz RT @BennySLV: Thanks to @khanacademy , I've now become more interested in #maths and #algebra. Never thought I would say that!! 😜🤓 #lifeski… @A1kazmi More details here! https://t.co/GwLAUyWipz 😊 @vcaylor77 Thanks so much for your support! (emotional and financial!) ❤️ RT @ana_queen6: Summer Professional Development @khanacademy ! I cant wait to try out a couple of the new stragies, I just learned. https:/… RT @ChatterBachs: Isaac's tweet for our 9th grade computer class: Thanks to Khan Academy for the many things I learned over this school yea… @withmrbauer WOOHOO CONGRATULATIONS!!! 🎉🎉🎉😁😁😁👏👏👏 Are you still in class this week? RT @HarrisonCClark: Honestly the best part of any day is when @khanacademy gives me the little confetti animation for clicking on a right a… @afamilyofslugs A wizard? Sal? Not sure where you got that idea... https://t.co/aQGstNYvaF RT @afamilyofslugs: How is the guy from Khan Academy so knowledgeable? Can he predict my death? Can he read my thoughts? Why does he remind… RT @MrsSchonberg: Casey confidently completes 100% @khanacademy skills in High School Geometry in 8th grade @SLHeights this morning! 😀 http… RT @SCintheMiddle: I kicked off my summer professional development with @khanacademy! \nThank you for the videos and resources on #TeachingW… RT @lilmsg14: Thank you @khanacademy &amp; @Official_LSAT for promoting educational equity. Not everyone can afford private tutors or private p… RT @OfficialSAT: Do you plan to take the SAT on August 25th? Set up your @khanacademy account now! You'll get a personalized practice plan… ICYMI: Last week we launched #FreeLSATPrep on Khan Academy, in collaboration with @Official_LSAT! It’s the only official online #LSAT course, and it’s 100% free. 💯🆓👏 https://t.co/tyg3mXjMp0 Best of luck to everyone taking the #SAT today! Remember to relax, stay positive &amp; do your best! Don't forget:\n1️⃣ Admission ticket 🎟 \n2️⃣ Photo ID 🆔 \n3️⃣ Pencils &amp; eraser ✏️✏️💨 \n4️⃣ Calculator ➗✖️ \nMore tips: https://t.co/sT1aott8Ce @CollegeBoard @OfficialSAT https://t.co/mu60OoYNBJ RT @FrancineHerlehy: Standing ovation from 600 law school admissions professionals from US and Canada for Sal Khan of @khanacademy on the l… @ExcelinEd Thanks for sharing! @joemack621 Hey Joseph, sorry to hear that! Could you tell us what browser and device you're using? Or submit a ticket to our help center: https://t.co/D9xiuCZlbD. Thanks for flagging this! RT @NJBtweets: Also I heard about this amazing program with @khanacademy @Official_LSAT - imagine the access this could enable. No more exp… @Jey_Suresh It's live! 💥 HUGE NEWS 💥 for aspiring law students: #FreeLSATPrep is now live on @khanacademy! 💯🆓😁🎉 https://t.co/tyg3mXBnNA\n📢📢📢 Help us spread the word! 📢📢📢 @Official_LSAT https://t.co/6kH9rWqF4S RT @Airborn3_jermZ: watched almost 4 hours of @khanacademy tutorials for today’s study sesh 👌🏾.. the online vids have def been a factor in… RT @nevitdilmen: Pippy, Head of Food Safety and Master Ball Chaser at @khanacademy https://t.co/8f6ppeYgB7 RT @jxgrnt: Shoutout to @khanacademy and their incredible learning content. Seriously helping with my exam prep, every time I use this site… @alexavgerinos  https://t.co/yYhFPTdAgO @jxgrnt Thanks for your support! ❤️ @CMoyers_7 @UNAM_MX Best of luck! 🌟 Congrats to our first #studyplaylist winner: Aniya from Delaware! 🎉 \"Beyoncé persuades me that despite the adversity I face, I can and WILL come out on top! If 👑🐝 believes I can understand calculus or ace biology or write worthwhile essays, then, surely, I believe it too!” 💪 https://t.co/sQZTMv7XgG RT @heystryker: Just finished teacher training for @khanacademy You can too! Amazing Free Math &amp; More! https://t.co/z8BZNHFcw8 #eaching #ma… RT @pcalch: @khanacademy I went back to college at age 47 to get my accounting degree. I had to take college algebra, statistics, calculus… RT @McNairSTEMLab: These STEMtastic students just mastered an entire grade level on @khanacademy! #mcnairstemlab #fcpssteam https://t.co/9a… Calling all 🇺🇸 teachers! Looking for inspo as the year wraps up? In our free, 60min #khanteachertraining course you'll get:\n1️⃣ Tips for using Khan Academy in the classroom ✅\n2️⃣ Certificate 📜\n3️⃣ Chance to win a trip to San Francisco! ✈️\n👉 https://t.co/msvkfatltP 👈"}