{"tweets": "@rodri_gues_953 obrigada meu amor Meus fãs são os MELHORES desse mundoooo... Queria mandar uma mensagem pra cada um de vocês do fundo do meu coração, me sinto a pessoa mais especial do mundo. \nObrigada pelo carinho sempre obrigada meus fãs por se dedicarem tanto na votação... amo vcs RT @papelpop: .@Anitta aproveitou esta segunda-feira (28) pra divulgar “Brasileirinha”, seu novo projeto musical totalmente em português! h… @badgalevan @multishow Já puxei, mas tá rolando lá no @QGdaAnitta também As votações do Prêmio @Multishow encerram hoje meus amores! Vamos votar MUITOOO 💕\nhttps://t.co/NwwatSrpO6 https://t.co/ypyOb4h7Tn RT @MomentsBrasil: ⚡️Vem novidade por aí!\n\n@Anitta vai lançar o projeto #Brasileirinha durante o #PremioMultishow na terça!\n\nhttps://t.co/Q… Vem aí \"Brasileirinha\" meu novo projeto musical totalmente em português. Começa nessa terça feira com o lançamento de \"Some que ele vem atrás\" ao vivo no Prêmio Multishow, e a gente não vai parar até Dezembro. Aos poucos vou contando muito mais sobre o projeto. Ansiosos? https://t.co/AuIqol80Ft @detailsanittx eu amo Portugal, amo vcs @world_anitt4 vocês pediram 🤭 40 mil votos\nhttps://t.co/gFiuvrs9zJ @crazyporanitta Hmmm vou olhar como libera meta aqui @finesseanitta Então vai fazer @anittazsx @newarthuei Muito, fico ansiosa pra ver a reação de vocês @newarthuei promete? @hideinert qual App? Alô meus fãs, estou sabendo que vocês estão em um mega mutirão para o Prêmio Multishow @anittxglow @brazilofanitta domingo tenho show, você vai? @brazilofanitta sou muito grata por vocês votarem tanto, vamos esperar... tomara que a gente arrase, mas se não arrasar, muito obrigada do mesmo jeito, eu amo vocês independente de prêmio ou não prêmio @weyanittx iiiiih gente @Amandah_Caroll @iamanitta vocês me dão forças @diferentex @anittasnape What? @iamanitta sim @anittaplay obrigada @anitteixz você é linda @anittasnape Já, me mandaram hahaha @vaimalandro_ @machikx é muita mensagem, me perco @machikx Siiim https://t.co/fIMhE3D7lk @AnittaVerdades ✌ https://t.co/6sdZOEExME @DavidDidmoral estava stalkeando aqui...\nvocês são ninja votando que isso @blackxplicit 💜 @k1and20 sim @moodanitta Será nosso? @greysnitta quero esses 5 mil Já cheguei Brasil...\nAmores, está acabando a votação do Prêmio Multishow!\nBora votar muito, temos poucos dias\nhttps://t.co/gFiuvrs9zJ Faça o pre-save e descubra como fazer ele voltar 👉 https://t.co/lOlZk0OlM6 #AnittaTrazSeuAmorDeVolta https://t.co/vkNmQ46uVx Tive que ligar pra @MariliaMReal pra me ajudar nesses conselhos amorosos. Mais especialista que ela não tem! \nSerá que sai um modão daí? #AnittaTrazSeuAmorDeVolta https://t.co/0u1yacdhhY @newMaldittx Irmaonitto??? hahahahah @SmashAnitta 💕 @FonteAnittaBR Obrigada meus queridos Meus amores, quem aí já votou no Prêmio Multishow hoje?! 💕  https://t.co/NwwatSrpO6 #PrêmioMultishow https://t.co/HEi8VmO3Ir RT @foquinha: Já fiz minha consulta com a Mãe @Anitta 😂❤️ Manda pro @ que tá precisando trazer o amor de volta https://t.co/x8uXXWrI4N RT @QGdaAnitta: Já pensou trazer o amor de volta? \nAlô chefinha @anitta ajuda todo mundo aqui https://t.co/IRDMScykfE RT @HugoGloss: Ruas do Brasil amanheceram assim hoje (22)... com esses cartazes da poderosa @Anitta prometendo trazer o nosso amor de volta… 💕🎤 https://t.co/XMFYkNnH2I @NattiNatasha 💜💜💜💜 RT @MiamiBeachPages: Today’s schedule: read @Anitta cover story @OceanDriveMag the bible of South Beach --&gt; https://t.co/21hrDU0rhA\n\n📷 mass… Amanhã tem Show das Poderosinhas no Rio de Janeiro, fãs queridos. Dia 27/10 é em São Paulo 💕\nhttps://t.co/hUIcxDZgkG https://t.co/excWVFAR8q Atención meninas... façam esse gesto de amor próprio com vocês sempre, cuidem-se 💕🌷 #OutubroRosa https://t.co/XEvzJwTd9P Obrigada aos meus fãs queridos e ao @QGdaAnitta pelas votações 💕 https://t.co/a3Euo77sW6 RT @NickelodeonBR: Manda mais @Anitta que o fandom vota! 🎉✨😍\nAgora nossa DIVA é dona do melhor show 20 anos do #MPN20Anos. https://t.co/XU4… @planet_anitta Amore, a Anittinha vai estar no RJ e em SP @Rogerio_Anitter Vai ter a personagem da Anittinha sim Show das Poderosinhas de Curitiba 🎤 E tem mais, fãs queridos… Dia 19/10 no Rio de Janeiro e 27/10 em São Paulo! Espero vocês 💕\n https://t.co/hUIcxDZgkG https://t.co/K45WjuIVgL Já assistiram \"Complicado\" hoje? @vitao https://t.co/YS7zvDZvyr https://t.co/mvEx5ZB9aH RT @CharliesAngels: Sworn to secrecy, bound by sisterhood. 💥 Watch the new #CharliesAngels trailer and get your 🎟🎟’s today to be the first… Ya viste \"Fuego\" hoy? 🔥\nhttps://t.co/5c0aQFwaXk https://t.co/oc8KTJC5qp I’m so excited to share that I have a song on the @charliesangels Official Motion Picture Soundtrack! Pre-order now https://t.co/TPcrKZ0VNk https://t.co/cTIQOSkmUv Fuego Music Video OUT NOW 🔥🔥 @djsnake @duttypaul @tainy\nhttps://t.co/5c0aQFwaXk #FuegoMusicVideo https://t.co/81G3ZrLG9c RT @MikeAdamOnAir: .@DJSnake, @Anitta and @DuttyPaul will drop the music video for “Fuego” tomorrow at 9am PST!!! https://t.co/haPsuGjzJz RT @Tainy: F U E G O 🔥\n@Anitta @duttypaul @djsnake Amanhã / Tomorrow / Mañana 🔥 https://t.co/lgxubnT7AL RT @HugoGloss: AAAAH, EU TÔ MUITO FOGOSO, SIM!!! Recebam esse teaser exclusivo do videoclipe de #Fuego, hino do @djsnake em parceria com a… RT @multishow: VAI, MALANDRA ✨😛 Foram vocês que pediram sim: 00h15 vai rolar reprise do show da poderosa @anitta no #RockInRioNoMultishow 🤩… RT @g1: Só se fala dela... @anitta https://t.co/CqpGTgRgLs #G1 Sua panqueca  🥞\n\nMinha panqueca https://t.co/IOmbE3V3Ma Poderosinhas vem aí 💕 https://t.co/Nk80UkXEty https://t.co/Adf0DaQ23R RT @nostrendsbrasil: Skol Beats - Twitteiros comentam a nova @skolbeats. https://t.co/RNStuKwfg8 RT @UpdateChart: Dando tudo que as gays alcoólatras querem, Anitta apresentou o novo lançamento da Skol Beats que estará disponível ainda e… RT @AnittaVerdades: Thread: Anitta e as latas de Skol Beats https://t.co/JJPZsDymol RT @newrodrigovdd: a nova skol beats tem teor alcoólico de 13,9% meu pai amado o estrago que isso vai causar nas pessoas https://t.co/TVxU2… RT @NittaB_: A nova skol beats tem teor alcoólico de 13,9% pqp Anitta tá querendo matar a gente kkkkkk\n https://t.co/bhFpAaMDiy RT @AcessoAnittaR: Recentemente, Anitta tornou-se a diretora criativa do selo BEATS. A cantora anunciou o lançamento do 'BEATS 150 BPM', qu… RT @latishitz: um shotão desses e eu já tô subindo nas cadeiras alheias \nobg anitta pela skol beats 150bpm https://t.co/SmvAR1WblF RT @AnittaDailyC: De acordo com dados da Oi, fornecedora de infraestrutura do #RockInRio, @Anitta lidera a lista dos momentos de maior aces… RT @HugoGloss: MC Andinho abrindo o show de @Anitta com hits ICÔNICOS que marcaram a história do funk! Estou ARREPIADO! #RockInRio #AnittaN… I love u https://t.co/7e2lhNwGs5 RT @multishow: Dona e proprietária do Brasil que chama, né? O palco é uma viagem no tempo e na história do funk!  Bateu uma saudade da Fura… RT @d3passagem: MUITO irado a @Anitta dar espaço para o MC Andinho.. o cara tem uma história de dedicação para o funk que poucos têm no Bra… Nossa musa lendária entra daqui a pouco no Palco Mundo do @rockinrio pra uma participação especial com o @bep. Será que vai rolar #eXplosion ao vivo? 🙊  #AnittanoMultishow #AnittanoRockInRio #RockInRio https://t.co/CyxMPVCOek Lights 💕 #AnittanoRockInRio #RockInRio https://t.co/2tTFce9pd5 @QGdaAnitta Amados, está rolando na minha página do Facebook também 💕 Don't miss out on watching the concert from #AnittaNoRockInRio. Set is streaming NOW on @LiveXLive! Tune in at https://t.co/WVwvf4nIjn \n\nOut Brazil and Portugal, okay? #AnittaNoLiveXLive #RockinRio2019 RAINHA FAZ ASSIM, NASCE PRONTA! O que vocês acharam do show?  #AnittanoMultishow #AnittanoRockInRio #RockInRio\" https://t.co/RiFEuSwWb0 \"Não custa nada sonhar alto pra caramba.\" 2013, Anitta. \n\n2019, Anitta:\n #AnittanoMultishow #AnittanoRockInRio #RockInRio\" https://t.co/4XgKnO2M6F Vai começar, Brasil! Vai ter funk no @RockInRIo SIM!\n\nLiga no @Multishow e bora rebolar a rabaaaa #AnittanoMultishow #AnittanoRockInRio #RockInRio\" Lendária, rainha, diva, fada, proprietária do mundo! Estão preparados pra esse ícone no @rockinrio? #AnittanoMultishow #AnittanoRockInRio #RockInRio https://t.co/zKYS6f5VHn O palco inspirado na furacão 2000 tá acontecendo!!! Esse momento é nosso!! #AnittanoMultishow #AnittanoRockInRio #RockInRio\" https://t.co/s0g8ANR82g @vitorfiguered1 @HugoGloss https://t.co/xkLMGqu77H @rodri_gues_953 @HugoGloss Vai ser transmitido no Multishow Play e no site do @rockinrio, bb Bastidores com @HugoGloss 🙊 #AnittanoMultishow #AnittanoRockInRio #RockInRio https://t.co/kPmaW3ibEt A nossa rainha acaba de pisar na Cidade do Rock! Ansiedade e emoção não tá faltando por aqui. É hoje que a @Anitta levar o funk a outro nível no Palco Mundo, queridos. Que música não pode faltar no setlist de hoje?? #AnittanoMultishow #AnittanoRockInRio #RockInRio\" Fãs queridos, é amanhã o grande dia! Vocês vão poder acompanhar tudo o que acontece comigo na Cidade do Rock pelo meu twitter. Minha equipe vai assumir o comando durante a minha passagem pelo @rockinrio e vai contar os detalhes desse dia muito especial. Ansiosos?? #RockinRio2019 Por que perder mais tempo? @vitao https://t.co/YS7zvDZvyr #Complicado https://t.co/c0AMO2uo3D @vitao Por que perder mais tempo? @vitao 💋 @OceanDriveMag https://t.co/z73CijHX18 RT @skolbeats: Como a @Anitta se tornou a Dona da P*** Toda de BEATS. Segue o fio. @vitao A vida é curta demais pra ficar pensando... @vitao No I am no beginner 🎤💥 https://t.co/kaoQiCRc2n https://t.co/FihNfsn4sD 🥰 https://t.co/Zi7wCw9nY0 Hey, Miami. Check this cover @OceanDriveMag https://t.co/I2LDgHrkkz @vitao ... tem tudo a ver @vitao 🎤🎶  https://t.co/Nk80Ulffl6 https://t.co/kfHwqTXg72 RT @skolbeats: Beats agora está sob nova direção e a primeira decisão da @Anitta não podia deixar vocês de fora. Escolhe aí a próxima novid… @vitao Eu odeio planejar... @vitao @bep 💥 #eXplosion music video with @bep and @iamwill is out now 💥  https://t.co/kaoQiCRc2n https://t.co/HQ9UkdQPB5 😳 @vitao 🙊🙈🙉 04/10 https://t.co/l4RkczDpno E deixem quanto aos pesados, deixem pra la tb. Eles existem? Sim! Mas pra que gastar nossa energia com estes? Vamos so focar em coisa legal. Amo muito vocês😘 Deixem a Ludmilla comemorar as alegrias profissionais dela. Ta tudo certo 💕 Amo quando me defendem das coisas. Mas não ataquem ninguém pq isso me deixa uma sensação muito ruim. Amo voces sempre por tanta lealdade. Ultimamente aprendi que quando gastamos nossa energia liberando a raiva dessa maneira só fazemos mal pra nós mesmos. Aprendi que nao importa o que façam comigo ou o quanto me machuque. O melhor a fazer é passar por cima e focar em tudo que é positivo. Agora deixando de lado esse assunto que nao se inclui no que vou dizer agora... falando num geral. Podem acreditar ou não... fazem tanta coisa ruim comigo. Tanta ingratidão, injustiça, passam a perna... e por mais que muita gente pense que eu dou o troco Nao tem essa de imitar. Cada uma é unica. E mesmo se imitasse seria uma coisa positiva pq significaria que gosta do meu trabalho. Lembra quando Ludmilla começou a cantar que alguns fãs iam xingá-la dizendo que estava me imitando? Pedi a todos voces que nao fizessem isso e fiquei muito feliz de respeitarem meu pedido. Quanto mais pessoas temos fazendo um trabalho bacana, mais longe podemos ir. O motivo pelo qual eu apareço la como parte criadora da música foi por ter feito parte da produção e estruturamento. Busquei os feats (papatinho e snoop dogg) ajudei o papato a produzir. Eu também sou compositora. Escrevi Bang, show das poderosas, zen, vai malandra. Algumas sozinha outras com amigos. Mas Onda Diferente foi uma musica inteiramente feita pela Ludmilla. muito melhor. Mas hoje venho por um caso específico. Nao ataquem a Ludmilla por ter se sentido feliz e emocionada com a composição dela ter chegado aos lugares que ela sempre sonhou. Quando eu sou atacada por outros fã clubes me sinto tao triste. Queria que o nosso fosse um exemplo de nao fazer isso. Nao importa o que a pessoa tenha feito comigo. A gente nunca precisa devolver na mesma moeda o que fazem com a gente. Focar em deixar nosso trabalho positivo é A todos os meus fãs que amo muito queria mandar uma mensagem do fundo do coração pra vocês. Eu entendo o quanto voces me amam e gostam de me defender. Eu me sinto a pessoa mais especial do mundo com isso. Mas me incomoda ver voces atacando outros artistas por minha causa. RT @QGdaAnitta: Hoje nosso agradecimento mais que especial vai pra essa galera incrível, vocês arrasaram num nível... teve gente que veio d… Aos meus fãs amados que foram hoje no estúdio gravar a base acústica da minha nova música, muito obrigada 💕 Vocês foram impecáveis! Agora temos um segredo 🤫 Galera, olha só essas histórias que o @itau está contando, de pessoas que, através da música, viram nas diferenças uma forma de se encontrarem. Dá play aí no vídeo da Tabatha Aquino, Compulsão Sonora e Banda Itaú.\n👉 https://t.co/n8VjIMdSVZ #BusqueAsDiferenças 🐒💕 https://t.co/ICENPBAviE @LexaOficial 💕 Muy muy feliz estar nominada a la 20a Entrega Anual del #LatinGRAMMY en la categoría de Mejor Álbum de Música Urbana, con my álbum \"Kisses\"! Gracias @LatinGRAMMYs, gracias a todos los amigos que aceptaron estar conmigo en este proyecto que tanto amo 💕 https://t.co/jXgIRlepSO @QGdaAnitta 💕 RT @POPline: O \"Kisses\" vai levar @Anitta de volta ao Grammy Latino! \nCantora brasileira concorre pela primeira vez em categoria de álbum n… RT @AcessoAnittaR: \"Obrigado Mexico por ontem! Foi um sonho, mais com @Anitta do meu lado.\" — Sofia Reyes junto com Anitta via Instagram. 💕… Fuego 🔥 @djsnake https://t.co/YaFJoLzX52 https://t.co/8qGHCM4Ni7 Queridos, não esqueçam desse combate babado que vamos fazer em São Paulo 🌈 Teremos minha amiga querida @LexaOficial e muito mais convidados 🤫 https://t.co/WsFVhBjEvG @anittaentronoG @finesseanitta HAHAHAH @finesseanitta Eu estou um pouco off, mas nunca esqueci de vocês 💕 @cloudanitta @soIoanitta Muito fogo hahahah @angelsanitta @soIoanitta Em breve meu amor! Minha equipe sempre posta as novidades nas redes da @Anittinha @soIoanitta Muitoooo @AnittaVegana Também quero saber 😂 @djsnake 😈 💜 https://t.co/hGWEkrBPw7 Último dia do meu programa! Quero MUITO agradecer a todos do @multishow que sempre me dão a maior moral do mundo. Obrigada à todos os meus amigos. E gratidão eterna ao público! Eu sou feliz de verdade nesse programa porque ele tem tudo que eu amo: família, amigos e música 💕 https://t.co/jYjC54Pua5 Hahahhahahah NUNCA É DEMAIS MEUS QUERIDOS https://t.co/5bkfHcn13n No #AnittaEntrounoGrupo de hoje eu convido meus queridos amigos @LeoSantana e @LexaOficial para um duelo bem sapequinha 😂 Começa as 20h30 no @Multishow amores. No Youtube começa 20h20 com David Brazil, @GretchenCantora, @NicoleBahls, @MateusCarrilho e @GloriaGroove. 💕 https://t.co/jh1xyVxUFT Squad 👯‍♀🖤🎤 https://t.co/q2El5agWMO Muy emocionada por estas dos nominaciones a Los 40 Music Awards! @Los40 https://t.co/kxmhEfumkY A Skol sempre está junto comigo! E hoje eu e a @cervejariaambev te convidamos a consumir de forma inteligente. Dá para beber e dançar à vontade, mas sem exagerar, né? Confere a página deles e compartilha esse movimento! #DiaDeResponsa2019 #GBRD2019 https://t.co/0OsFaai1f1 Fuego 🤫 https://t.co/YaFJoLzX52 https://t.co/2FEmeyrzci Can you see through? @Nylon_Spain https://t.co/EAm31jkf90 RT @multishow: Alow, às 20h20 tem David Brazil no comando do inbox do #AnittaEntrouNoGrupo no Música Multishow, no Youtube! O ícone @samira… Amores, hoje tem #AnittaEntrouNoGrupo no canal @multishow. A batalha de hoje é entre @Dilsinho e @elbaramalho! Começa às 20h30. Não percam. 💕 https://t.co/qZhebalmCT 💕🎤 https://t.co/Den7e2i3SB Já ligou para o #Contatinho hoje? 📞 https://t.co/DjoZVTzEqV Te liguei, deve tá ocupadin. Tudo bem, tô com outro contatin. 🎤 @leosantana\nhttps://t.co/m7G8QJlEHi https://t.co/ocgPH18pZG 💕🎤 https://t.co/Nk80UkXEty https://t.co/mxcZCBDAbK RT @s10ent: #LatinAMAs @Anitta @LatinAMAs https://t.co/AR7ERX2y84 R.I.P. @SoSofiaReyes @RitaOra #VideoFavorito #LatinAMAs 💕 https://t.co/HYRdgqr2di Aos melhores fãs do mundo, obrigada por todo carinho de vocês. Esse amor não tem preço. 💕 RT @Del40al1_es: 30 (+1) @Anitta y Alesso suben una posición con Get to know me #Del40al1CocaCola https://t.co/NzBpQtZ3Se https://t.co/BM9z… Eu também amo vocês 💕 @djsnake I thought I heard diabla @tyAnittxr Eu não aguento com vocês 😂 Contigo me atrevo https://t.co/gaVcs1DdDi https://t.co/iptwMOvHDe Se tem um negócio que eu me orgulho é de ter criado esse programa. Que delícia poder trabalhar e se divertir ao mesmo tempo. Obrigada aos amigos que toparam o desafio. @kevinho e @FerrugemOficial arrasaram! Semana que vem @Ludmilla e @elbaramalho... essa eu quero ver! @multishow https://t.co/EfUu08Wvg5 Ansiosa pelo pagofunk de hoje 😂 #AnittaEntrouNoGrupo https://t.co/xvc0RD5nya My night with him. 😍 Olivier Rousteing. Hosting the @balmain party in Brazil... cuz party is something I know how to do 😎 https://t.co/aOhyxmCHZi Amores, votem muito no Prêmio Multishow 2019. Fui indicada a duas categorias: \"Cantora do Ano\" e \"Música Chiclete\". 💕 Meu QG @qgdaanitta está ajudando nas votações! https://t.co/U9BYgGakjv #PrêmioMultishow https://t.co/dM37GZ3GCp @mateustavaresc @LaryAnitta18 @QGdaAnitta Infelizmente já tentei dar este tempo e não me fazer presente por não ser estudada mas fui criticada e pressionada por isso. Então agora que já sei que esperam isso de mim estou buscando especialistas pra ajudarem. @mateustavaresc @LaryAnitta18 @QGdaAnitta Pra que convencer alguém que ama feijão de como feijão é bom? Estaremos só andando em círculos. Se eu incluo alguém que não curte feijão aí podemos mudar algo. @mateustavaresc @LaryAnitta18 @QGdaAnitta entenderão que estou levantando um lado político X. Se não coloco o outro lado seguirei mandando mensagem pra quem já pensa como eu e não tentando uma conversa com quem não pensa @mateustavaresc @LaryAnitta18 @QGdaAnitta Por algumas razões. 1. Não quero que ninguém pense igual a mim e sim que tenham sua própria opinião. 2. Nem todas as pessoas vão dar ouvidos à alguém que rebola a bunda de calcinha. Principalmente o lado preconceituoso. 3. Se eu não coloco a opinião de alguém oposto este lado @httpanittx @LaryAnitta18 @QGdaAnitta Não acho. Se posto duas pessoas que pensam totalmente diferente mas não se atacam entre si já pode ser uma evolução. Já consegui fazer uma escutar com calma a opinião da outra pra poder responder. Saca? Tô tentando isso. Vai que uma muda a opinião da outra em alguns tópicos. @selenaknew @LaryAnitta18 @QGdaAnitta É isso. Vamos tentar de outra maneira e ver se funciona. Vamos tentando. @anittaxcaro Eita nem sabia que isso existia aqui no Twitter @heenriqux @LaryAnitta18 @QGdaAnitta Deixa os haters. Não tem problema. Sou muito feliz conquistei coisas maravilhosas na música. Todos os meus sonhos. Vocês que me ajudaram. Acho válido sacrificar algo se for pra tentar algo importante pra todo mundo. @AnittersBlessed @LaryAnitta18 @QGdaAnitta Muito obrigada pelo carinho meu amor. Ninguém consegue evolução sem se sacrificar um pouco. Conversei antes com minha assessoria e expliquei que queria muito fazer essa tentativa. Disseram que se sinto isso no coração estarão ao meu lado. De pouco a pouco vamos aprendendo @LaryAnitta18 @QGdaAnitta Mas ja conquistei tudo que sonhava. Acho que vale colocar o meu na reta um pouco em busca de algo. Se não funcionar eu começo do zero tudo de novo e é isso aí. Já fiz isso muitas vezes. @LaryAnitta18 @QGdaAnitta Pensei que pode ser legal essas milhões verem a possibilidade de uma busca de soluções respeitosa. Eu tenho muito medo de isso virar uma guerra entra as populações de cada lado. Uma guerra mesmo na rua tipo filme. Resolvi tentar. Sei que estarei me prejudicando artisticamente @LaryAnitta18 @QGdaAnitta É que eu realmente acredito que dá pra achar um meio termo. Vou tentar. Conversando com os dois lados com respeito. Questionando com respeito. Se funcionar será lindo. Se não paciência. Pelo menos tentei. Meu insta tem mais de 2 milhões de pessoas assistindo por dia @LaryAnitta18 @QGdaAnitta Se eu tivesse calada também me pediriam uma posição incessantemente. Feliz e infelizmente pela visibilidade que tomei as pessoas esperam isso de mim. @LaryAnitta18 @QGdaAnitta Posso perder dinheiro, seguidores etc com isso? Posso. Mas acho que vale a tentativa por ser algo importante na minha opinião. Me dói o coração real ver todo mundo se xingando e sendo tão extremista @LaryAnitta18 @QGdaAnitta estudo que eu. Mas se eu fizer isso só com um lado aí não estarei sendo imparcial. Na minha casa tem uma metade bolsolover e uma metade bolsohater....ambos nível máximo. Aos poucos estão convivendo sem se odiar e entendendo que nenhum está 100% certo @LaryAnitta18 @QGdaAnitta Eu estou acostumada com hater, não tem problema isso. Vendo toda a guerra entre pessoas o que tô tentando fazer é colocar as pessoas pra se respeitarem e debaterem de maneira saudável pra chegar numa solução. Como não tenho muito conhecimento eu resposto pessoas que têm mais RT @anittaplay: Thread : Anitta dando visibilidade pra causa da Amazônia e da natureza em geral.\n\nEnquanto a Anitta estava dando visibilida… Oh no don't be selfish. It's getting late look at the time. Been thinking about it all day what we gonna do about it tonight? #PrayforAmazonas 🌴 https://t.co/Jtu3F38M3H Yes, I have my own TV show in my country. Ontem foi dia de estreia da nova temporada do meu programa #AnittaEntrouNoGrupo no @multishow e foi uma delícia. Muita música, muita risada e muita audiência, queridoooos. Obrigada a todos que assistiram e aos nossos convidados! 💕 https://t.co/IRuQsDA6Zy RT @multishow: meu pai na balada:\neu na balada:\n#AnittaEntrouNoGrupo @anitta https://t.co/kqGjsahMTy RT @multishow: Encerrando o baile de hoje, todo mundo cantando \"Xibom Bombom\". Valeu @MelimOficial, @eotchanoficial, @davidbrazil24, @gessi… RT @multishow: https://t.co/6mylQ830lS RT @multishow: Musicão novo do @eotchanoficial? Tem também!\n\n#AnittaEntrouNoGrupo https://t.co/C4msrau4yB RT @multishow: Olha eles aí atacando de @eotchanoficial! 'Dança do Põe Põe' com direito a mãe Melim no palco! &lt;3\n\n#AnittaEntrouNoGrupo http… RT @multishow: Eu tô amando real o @eotchanoficial cantando @MelimOficial. Gente, um feat logo, pelo amor. Nunca te pedi nada!\n\n#AnittaEntr… RT @multishow: quem é você no trabalho em grupo? a @anitta: \n#AnittaEntrouNoGrupo https://t.co/6ojpO0ni1b RT @multishow: Ela não se aguenta! E nem essa galera do 'Inbox', bb. Lá foi @gessicakayane e @NicoleBahls pra dar aquela zoada com nossa mu… RT @multishow: Achou a live no Youtube e o programa na tv pouca coisa? Calma, ainda vai rolar uma live aqui no Twitter e no Facebook do @mu… RT @multishow: Solo um \"Poquito\" de @anitta na voz de @MelimOficial. Maravidjosso!\n\n#AnittaEntrouNoGrupo https://t.co/X9geAsjtbX RT @multishow: a @anitta representa meu espírito animal 🔥🔥#AnittaEntrouNoGrupo https://t.co/a4Ajtpkwsj RT @multishow: HAHAHA eu amo esses dois! @eotchanoficial tirando aquela onda cantando @melimoficial. Se liga!\n\n#AnittaEntrouNoGrupo https:/… RT @multishow: eu amo uma familia 💕 Quem tá curtindo #AnittaEntrouNoGrupo? @Anitta https://t.co/6JAoP3DtRL RT @multishow: E lá no 'Inbox' tem @anitta revelando como é o seu \"gemidão do zap\". Contou também como funciona o \"entra e sai\" do seu grup… RT @multishow: Música nova do @MelimOficial pra vocês! 'Gelo' pra deixar o clima gostosinho por aqui. Tem nada de gelado, é só calor e é só… RT @multishow: Ouvi dizer... que quando ela chega já era! @anitta atacando com 'Ouvi Dizer' do @MelinOficial pra derreter nossos corações.… RT @multishow: Pááára tudo! @eotchanoficial cantando 'Vai, Malandra'! Eu amo esses dois. Eu amo um programa. #AnittaEntrouNoGrupo começando… RT @multishow: E os lindos do @MelimOficial encaram o desafio e atacaram de 'Dança do Ventre', clássico eterno do @eotchanoficial. Galera a… RT @multishow: Começou! @anitta tá de volta e o baile começa quente. \"Fuego\" abrindo os trabalhos e a galera se derretendo com a nossa musa… RT @multishow: Corre pro Música Multishow, no Youtube, que já tá rolando a live do #AnittaEntrouNoGrupo, direto do nosso Inbox. O babado fi… RT @multishow: O #AnittaEntrouNoGrupo começa daqui a pouquinho, mas toda terça a gente tem um live rolando coladinha com o programa e ela c… É hoje, amores! 💕 #AnittaEntrouNoGrupo https://t.co/dB1W1y3FyB @CentralAnittaPY @KauemouraMa @multishow @MelimOficial @EoTchanOficial Si, en el canal de YouTube de @multishow a las 20:30 pm (horario de Brasil) @henriaad @tyAnittxr @multishow @MelimOficial @EoTchanOficial Terão inscrições para todos os programas lá no meu fã clube @QGdaAnitta Amores, amanhã às 20h30, estreia a segunda temporada do meu programa #AnittaEntrounoGrupo no @multishow. Vamos estrear com os convidados @MelimOficial e @EoTchanOficial. Não percam. 💕 https://t.co/SwODpJLx5R Balneário, Campinas e Pirapora. Obrigada pelo carinho de todos vocês 💕🎤 https://t.co/3DvVTRyrQ2 RT @multishow: No dia 20, estreia a nova temporada de #AnittaEntrouNoGrupo e teremos esse ano a nossa cabine digital, o INBOX, onde o marav… How do u think I could do 828273378 things at the same time without missing a shit??? Only email?? 🤮 https://t.co/48D2k6Mpqx RT @POPline: Mais um exemplo do funk ultrapassando fronteiras \"Little Square\" é uma referência ao nosso famoso \"quadradinho\", uma parceria… \"Little Square UBitchU\" IT'S OUT! @SnoopDogg https://t.co/AYKhpHSZm2 https://t.co/pylzRT98mt Deixa ele chorar, deixa ele sofrer 🎤 #tbt https://t.co/qBwOH1xNrk https://t.co/PYGN0jpMSU @QGdaAnitta Obrigada por tudo meu fãs queridos. Amo vocês. 💕 Vejo vocês 💕\nhttps://t.co/Nk80UkXEty https://t.co/7vIVbytGhc RT @QGdaAnitta: Hoje @Anitta alcançou 4 BILHÕES de visualizações no YouTube, não temos como deixar de agradecer a cada um de vocês que acom… Yess Ela já tá sabendo. Tô convencendo pro showzão pra gente agora kkkkk https://t.co/xnDSZQAVUK @torisonsa @iamcardib Sim sim. Já estamos em cima disso. Tinha opções dele tb. Perguntei se eu podia tentar adicionar mais umas pessoas de confiança pra ver se ela gosta e ela disse que super ok. Vamos ver se rola. Não é tudo tão fácil assim como parece de fora kkkk mas tô acostumada. Tomara que role Hahahhha love this https://t.co/BVYy2eWMmF @iamcardib Hahaha I always knew we were fuckin twinsss hahaha... loved you moreeeee. Brazil can't waiiiiiit 💕💕💕 RT @iamcardib: I met @Anitta last night ! Wow ! She is lit 🔥.I love her .I was so shy .☺️ Bateu @SnoopDogg @Ludmilla https://t.co/jYq46DSPN2 https://t.co/IRQhbwA1rA RT @billboard: .@Anitta and @iamCardiB continue to get fans hyped after making it known that they want to record a song together. https://t… RT @papelpop: .@Anitta e @SnoopDogg vão lançar nova parceria na sexta-feira!\nhttps://t.co/3sA8jQPM9C https://t.co/SMfxF9XXNi Yep... I think I just found my soul mate 🤷🏽‍♀️ ... Oi, Brasil, o bonde das funkeiras vai crescer, bom dia. @iamcardib https://t.co/bknypV1U7J 🎤💕 https://t.co/z7xZclgMiJ RT @POPline: Neste fim de semana, @Anitta deu mais um importante passo em sua carreira internacional e gravou música com o @bep. https://t.… RT @CentralAnittaFm: @Anitta @QGdaAnitta lança essa versão pelo amor de Deusssssss... Kk https://t.co/PUTD7k6r87 @blinknitterr ãh? @jonanitterxx Sim @portanitterroni Não faça isso @VoceMentiu Também estou, logo estarei com vocês @AnittersSempre_ Obrigada meu amor @stavofxster De sono, acabei o show tem pouco tempo @eaipedrx Muito @wheanitta Fico, mas logo preciso dormir ...\nMas volto Amo vocês meus fãs amados...\nNão se esqueçam https://t.co/U3Y5ztV5Ku RT @AnittaAcesso: Em recente entrevista, a rapper @iamcardib disse que está ouvindo muito o funk brasileiro, em foco, artistas como @Anitta… Gracias @VogueMexico 💕 https://t.co/vWMqC3eAz5 Sem palavras pra agradecer tanto carinho comigo, Portugal. AMEI o show! Encerramos a Tour Europa com chave de ouro sendo o dia mais cheio da edição. Gratidão eterna! Obrigada @blayak por arrasar com a gente. Agora rumo à Los Angeles que tem show em Long Beach dia 10! https://t.co/9dFWQiMmNb RT @HugoGloss: Empolgadas! @Anitta canta 'Faz Gostoso' com @blayak, a dona da versão original em show em Portugal; vem ver! https://t.co/Tt… @bangttx @anittagranger É isso. E eu sigo fazendo o que me dá na telha e a gente segue se amando. Você ama tudo no seu irmão? Não. Mas vc ama ele certo? Sim. Isso que importa @Iovesanitta Eu AMO um deboche.  Quem é meu fã sabe rs https://t.co/xEc7fiLBK4 @anittafada @CentralAniraBR @anittagranger Por estar fazendo tudo o que me dá vontade. E esse é o propósito da vida. Saber que nunca vamos agradar 100% e aceitarmos isso. @anittafada @CentralAniraBR @anittagranger Os gostos mudam também. Cada hora entro numa fase. De roupa, música, jeito de falar. Todo mundo é assim. Quando a gente se priva de ser como a gente tá com vontade é que a gente começa a não se sentir bem com a gente mesmo. E tudo desanda.Estou no momento mais feliz da minha vida @anittafada @CentralAniraBR @anittagranger Eu SEMPRE sou debochada é sarcástica. É meu jeito de ser e levar as coisas no bom humor. Acreditem, não é fácil. Principalmente quando se sabe tudo que passa por trás. Consegui fazer show de salto um tempo atrás e fiquei super feliz. Depois as dores voltaram e é isso @anittagranger Vou te dar um exemplo. Um dia desses fiz um cabelo que todo mundo amou. Mas machucou tanto minha cabeça que fiquei dias com dor. Aí depois apareci com o cabelo simples e falaram mal. Imagina se eu for explicar o pq de cada coisinha. Não vou viver mais entende? @anittagranger Tem várias outras coisas no meu trabalho que metade vão amar e metade odiar. É só focar nas coisas positivas. Se eu não levar as coisas dessa maneira vou entrar num buraco sem fundo. Já estive nesse lugar. É muito ruim @anittagranger Se eu como ser humano for tentar agradar 100% de tudo não vou ser feliz. É nessa tentativa que entramos em depressão. Vestindo o que não gostamos pra agradar aos outros. Fazendo o que não gostamos por medo de críticas. @anittagranger Vc não acha que me sinto triste de vocês reclamarem de cada detalhe sendo que tanto ser o mais bacana possível. Nunca vou agradar a todos em 100% das coisas. Teve gente que amou os looks. Teve gente que não. E é isso @anittagranger Amor. Em 2013 eu tinha outra coluna ... outro joelho, outra disposição física. E o principal... outros gostos. Hoje eu gosto assim. Talvez um dia mude o gosto de novo e tudo certo. A gente tem que focar nas coisas que gosta e não nas que não London was AMAZING! Thank u gringosss... gracias Latinossss... obrigada Brasil! 💛 https://t.co/aqfMmGurrt Ya escuchaste Fuego hoy? 🔥 @djsnake @duttypaul Tainy\nhttps://t.co/dRs15LyojZ https://t.co/wvRUgTaHsG London, see you tomorrow at Southbank Center! ❤ https://t.co/m4pygLb5fb https://t.co/S2wJ0R6n0R I'm happy cuz I'm grateful. God, I'm so grateful. Everything is always so hard in my life. But I'm grateful for every single thing that I happens to me. When I look at where I've got... wow. Everything makes sense. Thank u Italy for making my first time here so special. 💕 https://t.co/yxP2qi2r0B Preciso dormir, amo vocês...\nobrigada por tudo ❤ @mozonaanitta fiquei com vergonha e muito feliz #MPN #Anitta #Anitters #AnittaShow #MarinaRuyBarbosa amei que vocês estão votando na minha amiga @mariruybarbosa #MPN #Anitta #Anitters #AnittaShow #MarinaRuyBarbosa Antes de dormir, rs...\nserá que vocês podem votar dez mil vezes em mim?\nÉ só encher essa minha foto com comentários usando essas tags #MPN #Anitta #Anitters #AnittaShow #MarinaRuyBarbosa https://t.co/Glm5HjB9Cr RT @QGdaAnitta: Somos 200 milhões de visualizações em apenas seis meses 💥 @kevinho @Anitta https://t.co/UTgePq3sng 💛🧡 https://t.co/BBBdyadj… Arenal Sound fue increíble. Gracias gracias gracias por el cariño, España. ❤ https://t.co/HsqpR0GDPA Meus amores, estou concorrendo em três categorias nos Meus Prêmios Nick 2019: \"Melhor Show\", \"Fandom do Ano\" e \"Artista Musical Favorita\". Corre lá no meu QG @qgdaanitta e saiba como votar. É super fácil! #MPN #Anitta #Anitters #AnittaShow https://t.co/REIPeh56zG 🎤💜 https://t.co/BJO1YkfekG RT @billboard: .@Anitta signs with Brandon Silverstein's @S10ent https://t.co/GNzSKlFcjo 😍 https://t.co/YXfUStxreX @trulyanitta Já @SmashAnitta ❤ @finesseanitta 😂😂 Sejam 4.096 mil ou 9 milhões, sempre foi por vocês! Obrigadaaa ❤ https://t.co/ZoXJNm3OHV Ibiza vibes https://t.co/z5zyK9223R Don't make me crazy 🔥 https://t.co/dRs15LgMVp https://t.co/ForGC2FXRI Thank u @tomorrowland 💚 https://t.co/cMmNtkzZuA RT @caldeiraodohuck: Fãs vão às lágrimas na web com @Anitta no #VisitandoOPassado ➡ https://t.co/kFZven7A7Z #Caldeirão https://t.co/aLP6CEj… RT @MomentsBrasil: ⚡️ A @Anitta colocou todo mundo pra dançar o funk brasileiro no #Tomorrowland! \nhttps://t.co/ABPKEerjUZ RT @caldeiraodohuck: .@Anitta fala sobre emoção de participar do 'Visitando o Passado': 'Sensação incrível' ➡ https://t.co/eFnyaWyIW9 https… RT @CanalTreceCO: ¿Por qué @Anitta quiere 'hablar paisa'?\n\nEsto le dice a @themusicpimp en el próximo episodio de #ElPodcast por @CanalTrec… Até que enfim o 'Visitando o Passado' veio @LucianoHuck 😂❤ Thank uuu @caldeiraodohuck https://t.co/9r7sqqrGBD Inacreditável / Unbelievable / Increible https://t.co/cp4T0KmEdD Hello, Belgium!! Ready for you, @tomorrowland. My show is today! You are already? / Para todos os Brasileiros que estão na Bélgica, hoje eu faço um show completo no @tomorrowland. / A todos los latinos que están en Bélgica, hoy yo cantaré en Tomorrowland. No se lo pierdan. ❤ https://t.co/s9X5QFl9X5 RT @HugoGloss: QUE CALOR! Vem ver @Anitta toda caliente na capa da revista colombiana Don Juan. Muito musa, né? Em ótimo momento, hoje estr… Já escutaram \"Fuego\" hoje? 🔥 Novo single do @djsnake comigo, o ícone @duttypaul e meu ídolo Tainy. \nhttps://t.co/dRs15LyojZ https://t.co/hNVYlBKtc3 Já aprenderam a coreografia de Fuego? 🔥 https://t.co/nvLqx2DzJE RT @POPline: Gostou de \"Fuego\"? A música da @Anitta com #DJSnake saiu hoje e ela faz a primeira performance no fim de semana. Já tem vídeo… Fuego 🔥 Ouça agora / Listen now @djsnake @duttypaul @tainy \nhttps://t.co/HLAp00ABdf https://t.co/gABIR3f4g4 RT @HugoGloss: Saiu! @Anitta brilha em música com @DJSnake, dono de hinos de Justin Bieber e Selena Gomez; Vem ouvir a ótima 'Fuego' e conf… London, see you soon ❤ https://t.co/JSiHQa9c2S Sabes que me encanta seducir 🔥 @Ozuna_Pr https://t.co/kqtS8YEgiY https://t.co/okX4KPyRvD Europe, see you soon! ❤ https://t.co/QdmWv4azJd https://t.co/UJcFq8BkiE 4 dias / 4 days / 4 días ⌛ 🎤❤ https://t.co/UghRgHx7ui @skol @dogbeer @PetzOficial Não creiooooooooooo. Será que meus 5 filhos vão gostar?? RT @skol: Os doguinhos latiram e a Skol atendeu. Chegou Skol Dogz, a Skol que faltava para você brindar com o seu melhor amigo. Partiu bote… A única pessoa que consegue ferrar mais o grupo que a polícia é a Tóquio 🤦🏽‍♀️ @maritegon Idem Ahhhhh que ódio desta Tóquiooooooo Se a minha favorita morrer eu juro que nem sei o que faço #LaCasaDePapel Extremamente frustrada com esse final #LaCasaDePapel @macedomartins7 Nairobi é a melhor @anittwgaga 3 @anittabrasilcom Eu não amo não. Mas acho lindíssima. Mas manoooooo fico torcendo pra ela sumir do mapa pra parar de atrasar a vida da galera hahah E segue invicto desde a primeira temporada o ranço das merdas que a Tóquio faz o povo se meter mano 🤦🏽‍♀️ @qfoibruno @btsxanitta raiz né amore @prideanittx @btsxanitta liberei @cyrsnitta stalkeando vocês @finesseanitta sempre @Jaoisnow obrigada @btsxanitta liberei @anittabadgirl kkkkk Essa mina é louca #tbt \n\nhttps://t.co/IbPLA4jH0u @hugovasconcelus Ahhhhh ta RT @Tigo_GT: #SigueLaMúsica y escucha lo NUEV💿 de:\n\n@edsheeran #Antisocial \n@Ozuna_Pr &amp; @Anitta #MuitoCalor \n@iambeckyg #DOLLAR \ny @davidgu… RT @billboardlatin: We're celebrating the first birthday of our series, #GrowingUpLatino, all week long! \n\nWatch 15 of our favorite episode… RT @GloboNews: No sábado, Nelson Motta vai contar como conheceu @Anitta e tudo o que acha do sucesso da cantora, que vem chutando as portas… @Crian_Esperanca Hahahahahahha Aqui nos EUA segue rolando like... por que será isso só no Brasil? 🤔 Rosa 🌹 https://t.co/EmJGSA4SwY https://t.co/tH9or29H2J RT @HugoGloss: Eu quero close de garota! Olha que maravilhosa a @Anitta toda bronzeada na capa desse trimestre da Slimi. Serenidade de quem… Amo vocês... juro ❤ @eaipedrx @iambeckyg @QGdaAnitta Vocês são muito criativos 😂 @Philip7_ Hahahah bem isso Fico aqui stalkeando meus fãs escondida.... gente... vocês são muito inteligentes. Surreal RT @AnittaExterior: O Instituto Luísa Mell precisa de dinheiro, ela tem uma quantia que vai deixar o instituto funcionando só até o final d… @iamcardib Hahaha easyyyyy... I taught Madonna too for our funk together lol Você Mentiu x @caetanoveloso: https://t.co/py69BiQ9ZA\n\n#KISSES https://t.co/NZBCgnCen9 @iamcardib u tell how I send u and we make history for my country that also loves u like me @POPline @iamcardib Sério???? Okay @iamcardib After I passed out listening u saying u would love to record with I gotta say that I have the PERFECT track for us. I’ve seen you listening to Brazilian funk. The track is the best funk ever. Come onnnn RT @europa_fm: ▶ #VÍDEO Esencia brasileña para 'Muito Calor', la colaboración de @Anitta\n y @Ozuna_Pr https://t.co/Odpu8V19lo \"Muito Calor\" também está disponível na Apple Music. 👉 https://t.co/OaIyttZui4\n@Ozuna_Pr https://t.co/Z7LKARD5q8 RT @Los40: Anitta (@Anitta) nos habla sobre el videoclip de 'Muito Calor', su nuevo tema con Ozuna (@Ozuna_Pr) 🔥🎶 ¿Ya lo has dado todo al r… RT @exatv: .@Anitta y @MRiccaOficial este domingo es @AxesoTv con @jessiecervantes a las 9:00PM en el #156Dish y #737Totalplay  😎📺 https://… RT @CaracolRadio: Damos la bienvenida a nuestra invitada de hoy, la talentosa @Anitta quien nos cuenta sobre su nuevo álbum #Kisses. No se… Tá Muito Calor aí? ☀☀☀ @Ozuna_Pr\nAssista: https://t.co/8Q5u7rVhQe https://t.co/JloOMcI16J Mas eu vou te dar um conselho: não vai se apaixonar tão cedo... @Ozuna_Pr\nMUITO CALOR: https://t.co/8Q5u7scTeO 🔥 https://t.co/R0CRzzhOAX Banana x @iambeckyg: https://t.co/nlNnrlfnqA \n\n#KISSES💋 https://t.co/ov0C9AqWw7 Já ouviu MUITO CALOR hoje? ☀🔥 / Has escuchado MUITO CALOR hoy? @Ozuna_Pr\nhttps://t.co/qePgyCulsI https://t.co/FgvkeHxLu2 RT @SpotifyLatino: @AnittaExterior @iambeckyg @myketowerspr @rauwalejandro @Ozuna_Pr @Anitta @BANDARECODITOSS @Calidandee @Greeicy_rendon @… RT @catalinamaya: #HoyTengoGanasDe escuchar y bailar la música de @AlexSensation ...¿ya escucharon su canción Pa' lante? La hace con @LuisF… Vem ouvir MUITO CALOR pra esquentar o friozinho 🔥\n👉 https://t.co/qePgyCulsI https://t.co/cVwqnrLv0U Los días son mejor contigo 🎶 MUITO CALOR 🔥☀ @Ozuna_Pr\nVem ouvir: https://t.co/qePgyCulsI https://t.co/mSzofakG7W RT @leosantana: Seis letras, um nome e muita história. Vocês acharam que ela ficaria de fora? Vem com tudo, @Anitta 🙏🏿♥️ https://t.co/3Rsbs… RT @leosantana: Atención, família! Esquentamos ainda mais com as dicas e minha convidada bola rebola provocando uma onda diferente! 👊🏾☄ Ago… https://t.co/L1UOHaAjdg MUITO CALOR segue em #1 nos vídeos em alta do @YouTubeBrasil! 😍😍😍 @Ozuna_Pr\n\nhttps://t.co/8Q5u7scTeO @signanitta Hahahahah RT @AppleMusicES: Sube la temperatura 🌡.\n#MuitoCalor\n\n@Anitta x @Ozuna_Pr\n\nhttps://t.co/OXlqN97teY RT @billboard: .@Ozuna_Pr &amp; @Anitta bring the heat in the music video for #MuitoCalor https://t.co/1m7QVmHiE2 https://t.co/uXp71PbtHz Viciada em seduzir 🤷🏽‍♀ / Para empezar el día @Ozuna_Pr \n\nMuito Calor: https://t.co/qePgyCcK48 https://t.co/pJAEnp3NUe RT @RollingStone: See Ozuna and Anitta party Rio-style in the new video for \"Muito Calor\" https://t.co/b0LWsiLD2S https://t.co/mPCunmmF3o \"Muito Calor\" na Times Square @Ozuna_Pr https://t.co/ZmEBdqJB7i https://t.co/stDdK3iRTV RT @pandoramusic: San Juan-bred reggaeton favorite @Ozunapr and Brazilian pop star @Anitta have joined forces for the steamy new track “Mui… 1 MILHÃO de views 🔥🔥🔥 @Ozuna_Pr\nMUITO CALOR 👉 https://t.co/8Q5u7scTeO https://t.co/k5kO0mf1wV \"Muito Calor\" también está disponible en todas las plataformas digitales. Escucha ahora 👉 https://t.co/qePgyCcK48 https://t.co/NjsRkYXYfg @iamcardib I love you hahahah RT @etnow: .@Ozuna_Pr and @Anitta join forces in their new music video for, 'Muito Calor.'\n\nhttps://t.co/zSK0ByrBSj RT @CusicaVzla: .@Anitta y Ozuna se juntan en un nuevo tema que sin duda va para nuestro playlist del verano https://t.co/W1PNAl6pnd MUITO CALOR em #1 nos vídeos em alta do YouTube!!! 😍 Vem assistir! ☀🔥 https://t.co/L1UOHaAjdg\n\n@Ozuna_Pr https://t.co/Pa3UnwYYfb RT @gshow: .@Anitta faz participação em clipe de @Ozuna_Pr e entrega: 'Meu irmão e meu namorado amam' ➡️ https://t.co/s2YsrqIscU #GshowFamo… RT @HugoGloss: Saiu!!! Vem ver o clipe bapho de “Muito Calor”, parceria de Anitta com o hitmaker Ozuna! (Foto: Divulgação) ==&gt; https://t.co… RT @billboardlatin: Exclusive: @Ozuna_Pr &amp; @Anitta raise the temperature in #MuitoCalor video https://t.co/DoD3S4pziF https://t.co/n4xvZoyG… RT @papelpop: .@Anitta e @Ozuna_Pr curtem festa em dia ensolarado no clipe de “Muito Calor”\nhttps://t.co/lHnaJPSGVL https://t.co/pVRlsALXIp Salió \"Muito Calor\" / Saiu \"Muito Calor\"!!!☀🔥 @Ozuna_Pr\n\nVe el videoclip: https://t.co/L1UOHaAjdg \"Muito Calor\" está llegando 😍 @Ozuna_Pr https://t.co/HIEP9IeVZR Tu Y Yo:  https://t.co/lxdrkTdbyy\n\n#KISSES💋 https://t.co/kvCxtzS21s Bogotá 🌫 https://t.co/MEErMQUX2R Tickets: https://t.co/QywjD1NJ5a https://t.co/WVyc3fvJKu RT @billboard: Watch @pedrocapo and @Anitta perform #Calma at #CopaAmerica final match https://t.co/Wak5j3aAfk https://t.co/70S1Bqs2To RT @billboardlatin: Watch @pedrocapo and @Anitta perform #Calma at #CopaAmerica final match https://t.co/ra94PmvJ2T https://t.co/n1d5kGOTwQ Final Copa América @CopaAmerica https://t.co/NoCmr7HJza @Del40al1_es @Alesso 😍😍😍😍 RT @Del40al1_es: ¡Lo consiguieron! @Anitta y @Alesso entraron en la LISTA con 'Get To Know Me'. Entran directamente al #38. #Del40al1CocaCo… RT @MTVBrasil: I-M-P-O-S-S-Í-V-E-L ficar parad@ com a realeza do funk @anitta e @ludmilla no palco do #MTVMIAW2019! É tanto hit que a gente… ❤❤❤ https://t.co/1k4hophbN3 Muito orgulhosa de ter uma mulher incrível como você do meu lado cantando nosso funk que tanto amamos. Arrasamos ontem minha amiga querida e de coração puro @Ludmilla 💕 https://t.co/IowalkqTwB Dale Pa’Lante! 😍 #10M @alexsensation @luisfonsi\n\nVe el videoclip: https://t.co/k09dUJyRzU https://t.co/oH5zCc6A3v Agenda de Julho (atualizada) 🎤❤ https://t.co/eVl2BKGSGA @Del40al1_es @Alesso ❤😍 RT @Del40al1_es: .@Anitta   y @Alesso   aspiran a entrar en la lista con ‘Get To Know Me’ 😎👸 https://t.co/yaXqx58UwP https://t.co/yJWagIP3Oa Sin Miedo x @DJLuian &amp; Mambo Kingz: https://t.co/gaVcs1UOuQ #KISSES💋 https://t.co/kOgxO41CtN Fomos os mais indicados e mais premiados da noite. Obrigada demais a todos os meus fãs que são tudo no meu trabalho. Amo vocês demais e sou muito grata. Obrigada a todos da MTV pelo carinho. https://t.co/jlpEqCjgeN Atención: https://t.co/S5fxKZPDKl \n\n#KISSES💋 https://t.co/rwFkQKhKdV MAKE IT HOT 🌶🔥 @MAJORLAZER @BACARDI\n\nAssista agora / watch now / ver ahora: https://t.co/D9mSbgjA1X \n\n#DoWhatMovesYou https://t.co/I9xmM138N3 RT @ForbesBR: 10 dicas de empreendedorismo de Anitta: https://t.co/F3cYEWVEGE https://t.co/NpEbMZLGY2 RT @TNTLA: Estamos encantados con su música, pero ¡especialmente con ella! 😍 Mira la entrevista que hicimos con @Anitta 👉https://t.co/c4kVO… ❤🎤 https://t.co/CHJ5uxyujf MUCHOOOOOOO.... Y en mi tarima también mañana si quieres. Todo tuyo. Te amo https://t.co/fxkixYZgrC Ajude a @cervejariaambev a doar R$100 mil reais para a Casa 1 e Casinha twitando o que significa #OrgulhoDaMinhaHistória pra você . Cada tweet vale 1 real 🌈🏳️‍🌈 Onda Diferente x @Ludmilla x @SnoopDogg ft. @Papatinho: https://t.co/jYq46DSPN2\n\n#KISSES💋 https://t.co/bxscJqLVEO RT @z101digital: “Pa’lante”, de Alex Sensation, @LuisFonsi y @Anitta, ya tiene seis millones de reproducciones en @YouTube \n\nTodos los deta… Siempre hot, siempre picante 🌶🌶 #MakeItHot @MAJORLAZER @BACARDI\n\nAssista agora / watch now / ver ahora: https://t.co/D9mSbg1YDn\n\n#DoWhatMovesYou https://t.co/Vy7zCuh1TG 💚💋 https://t.co/kcoripptbp 🌶🔥 https://t.co/CQuFaJ9k83 RT @billboarddance: .@MajorLazer and @Anitta unveil the spicy new video for #MakeItHot https://t.co/PircBKIMwB https://t.co/YL4Qx1E53t #MakeItHotVIDEO é #1 Brasil 🇧🇷! ❤❤❤ Quem não assistiu ainda, vem ver: https://t.co/D9mSbgjA1X  \n\n@MAJORLAZER @BACARDI 🌶🔥 https://t.co/4KsQ9C9Ais RT @papelpop: .@Anitta dança muito nas ruas da Costa Rica no clipe de “Make It Hot” com @MAJORLAZER\nhttps://t.co/YjiOAhH9or https://t.co/rh… @Globo_Rural Hahahaha @DillonFrancis @MAJORLAZER 🌶🔥 RT @HugoGloss: Saiu! @Anitta rebola muito e incendeia no clipe da ótima 'Make it Hot', parceria com @MajorLazer; vem assistir! https://t.co… Assista agora ao clipe de MAKE IT HOT: https://t.co/D9mSbgjA1X \n\n@MAJORLAZER @BACARDI 🌶\n#MakeItHot #DoWhatMovesYou #MakeItHotVIDEO https://t.co/6XugFBe3dS #MakeItHotVIDEO @MAJORLAZER @BACARDI https://t.co/fZL2P377z3 RT @MAJORLAZER: MAKE IT HOT VIDEO OUT NOW @ANITTA @BACARDI 🌶\n\nhttps://t.co/FCM6Un0M5m \n\n#makeithot #dowhatmovesyou #partner https://t.co/tD… MAKE IT HOT VIDEO OUT NOW @MAJORLAZER @BACARDI🌶#MakeItHot #DoWhatMovesYou\n\nhttps://t.co/D9mSbgjA1X Ce acredita? @kevinho ❤ https://t.co/czkephQqq2 SHINE https://t.co/3ZEFzAQ7eX RT @YouTubeMexico: #YouTubeMusic presenta: @Anitta en una entrevista muy divertida dónde nos enseño a hablar en portugués y algo más. Chéca… O clipe sai às 11h no BR amores 😉 https://t.co/zz01NKmTRA NEW VIDEO TMRW WITH @MAJORLAZER. 🌶 @BACARDI\n\nhttps://t.co/D9mSbgjA1X https://t.co/T9olyjFL9W 😍 https://t.co/IzcktN0y0G Poquito x @goswaelee: https://t.co/qIIaR9xKgS \n#KISSES💋 https://t.co/mGQEaFNchZ I can’t wait to see my boy @frankiedelgado on #thehillsnewbeginnings Rosa x @PrinceRoyce: https://t.co/EmJGSA4SwY \n\n#KISSES💋 https://t.co/9jkvAQsz2B 3 DAYS @MAJORLAZER @BACARDI 🌶🌶🌶 https://t.co/D9mSbgjA1X https://t.co/5NEVcPfomJ @40GlobalShow @TonyAguilarOfi @Alesso 😍 RT @40GlobalShow: Arrancamos un nuevo programa de #40globalshow196 con @TonyAguilarOfi y todo el mejor sonido que te puedas imaginar. Comen… #PaLante, canción con mis amigos @alexsensation y @luisfonsi, esta disponible en todas las plataformas. // Vai lá dar um check na letra (que trás uma mensagem que eu amo) e ainda aproveita pra treinar o espanhol. https://t.co/k09dUJhgbk https://t.co/hHJ0VXP6Mz @leobentoce Hahahha obrigada @leobentoce Eu ameiiiii @PortalTracklist E tem alguém falando mal dessa situação onde eu tirei foto com dezenas de fãs que me esperavam no aeroporto às 6 da manhã depois de um show sem ter dormido ainda nem uma hora sequer? Se tiver ai eu realmente desisto de entender o povo RT @Madonna: Message to @Anitta .............Madame ❌ never met a girl like you before................ 💅🏻💄 #madamex #waitingforanitta #agir… 🏝 https://t.co/Vxx62CaxQM RT @Spotify: It's finally the weekend 🙏\nTime to pop bottles with @Anitta... or at least try to 😂🍾 https://t.co/VCfBTyW1Ta https://t.co/mHr7… RT @AcessoAnittaR: Gostosa pra caralh*! Anitta rebolando ao som de \"Make It Hot\", seu single com Major Lazer.\nhttps://t.co/dntd119p0p Vem ouvir #MakeItHot! 🌶 @MajorLazer \nhttps://t.co/3DRostXgbc https://t.co/bqi0g0ZIdI RT @VEVO_ESP: #Palante es el pegadizo nuevo tema que nos traen @AlexSensation, @anitta y @luisfonsi ¡Mira aquí el videoclip! 🔥\n▶︎https://t.… RT @Spotify: Never look back and keep moving Pa' Lante ➡️ Stream the new collab from @AlexSensation, @Anitta, and @LuisFonsi now https://t.… CINCO DIAS!! @majorlazer @bacardi 🌶 https://t.co/SOWfcp03HL RT @QGdaAnitta: Quem acordou assim hoje ouvindo “Pa’Lante” BOM DIAAAAAA! \n\nhttps://t.co/KuTvSQfkEv https://t.co/FBmbjPyXjh RT @POPline: Parcerias em \"Faz Gostoso\", \"Make It Hot\" e \"Pa'lante\" colocam @Anitta no Top 10 do iTunes em outros países nesta sexta-feira.… Thank youuuuu ❤❤❤ https://t.co/g6IKLaSFjX @AlexSensation @LuisFonsi @danielduran4 @biggyjeon @djsteveandreas @jhonpaulrecords ❤ De todas las canciones que he grabado últimamente, #PaLante es una de mis favoritas a causa de la letra. ¡Tiene todo que ver conmigo y la forma en que pienso! https://t.co/k09dUJyRzU RT @POPline: Festa à beira de piscina ao melhor jeito latino e muita sensualidade: assim é o videoclipe de \"Pa'lante\", parceria de @AlexSen… #PaLante es mi nueva colaboración junto a @AlexSensation y @LuisFonsi. Escucha ahora y ve el videoclip. Está increíble ❤ https://t.co/VkizTvLe34 RT @Madonna: Madame ❌ is waiting for @Anitta .................... 🔥🔥🔥🔥 #madamex #waitingforanitta https://t.co/7gBtw8GqVu O @MTVMiawBrasil tá chegando galeraaa! Eu e @Ludmilla estaremos no palco! 💞 Continuem votando em https://t.co/eU0KloXnE9 #PremiosMTVMIAW https://t.co/T06GIQkXW8 Inhaí miglos vocês curtiram \"Make it hot\" ? RT @Beats1: 🌍🌶\n@MAJORLAZER x @Anitta\n#MakeItHot is the #WorldRecord!\n➡️ https://t.co/vsizENbs2S https://t.co/DOToguoiUI @Spotify 💚💚💚 Had so much fun yesterday at this amazing experience of KISSES that @Spotify did for me and my fans and friends. Thank you so much for everyone who was part of this night #FestaKisses https://t.co/oW5G4Qmtpk RT @AmonBorges: .@Anitta grava música em espanhol com @MAJORLAZER para ação do rum Bacardí. “Make It Hot” foi feita sob encomenda para a aç… RT @MAJORLAZER: MAKE IT HOT OUT NOW @ANITTA 🌶 https://t.co/JORpiH9E9S https://t.co/bYHeku5SMr MAKE IT HOT OUT NOW @MAJORLAZER 🌶 https://t.co/dC7qwu3q9I The summer’s hottest beat is here 🔥@MAJORLAZER @BACARDI \n#DoWhatMovesYou #MakeItHot #BACARDÍ #Rum \n\nDrink Responsibly/Beba com moderação #sponsored https://t.co/Rh5rhDEXDd Did u?\n\nDrink responsibly/beba com moderação #sponsored https://t.co/CdmfjPA1MB Make it hot \n\ndrink responsibly/beba com moderação #Sponsored https://t.co/44otXr8bix RT @MAJORLAZER: .@anitta, the trilingual goddess of brazil and a fighter for justice on earth. https://t.co/tNSKEKcjSY Ve ahora mi performance acustico de \"Rosa\" en la playlist #VivaLatino: https://t.co/hRtFL7O6cu 🌹💋 @Spotify @SpotifyLatino https://t.co/35ENx46I6x 😍😍😍\nhttps://t.co/R14UdJ4IPi Olha que coisa maiiis fofa esses chinelos da @Anittinha que chegaram, gente! 😍 Já disponíveis no Brasil todo: https://t.co/N5tgL0wOjc #GrendeneKids #SandáliasIpanema #Gloobinho https://t.co/aVZLwtS75a 🌷💋 https://t.co/FxDUzokiKJ RT @Spotify: What's next for Brazil's reigning queen @Anitta? Watch her get candid about her Goals on #VivaLatino now 🇧🇷 https://t.co/jArUQ… RT @TvsEspectaculos: @Anitta hace nueva colaboración con la reina del pop @Madonna de nombre \"Faz Gostoso\". 👏 👍 👇 👇 https://t.co/mq7IDndSog Pasé una noche en Las Vegas con @Spotify y mi equipo maravilloso. ¿Quieres ver cómo fue? Asiste ahora en la playlist #VivaLatino: https://t.co/hRtFL7O6cu 💚 @SpotifyLatino https://t.co/U0GySB05LM RT @TIME: New music from @Madonna and @Anitta, @gloriagaynor, @finneas and more to add to your weekend playlist https://t.co/yVHmncARvU RT @Madonna: https://t.co/FbNwEILR3Y Aquele funk de respeito https://t.co/7deGrtMqQY @Spotify @Madonna 💚 Desde mi carrera musical hasta los aliens, respondí estas preguntas del Internet para el @BuzzFeedMexico. 😂 Gracias por el cariño! https://t.co/652HFJnzZ9 RT @divinity_es: .@Anitta ha venido para alegrarnos el fin de semana: escúchala en nuestra playlist de @SpotifySpain &gt; https://t.co/VLYgti6… RT @BillboardArg: 🔥 @Madonna estrenó su álbum N°14 #MadameX, disco en el que celebra la música y cultura latina junto a @maluma, @Anitta y… RT @POPline: \"Faz Gostoso\" da @Madonna com @Anitta desponta como líder de streams em todas as plataformas no dia do lançamento do \"Madame X… RT @FlaviaAleReal: E esse refrão de #FazGostoso que gruda na cabeça e ainda tem @anitta pra ajudar no grude ❤❤❤ @FlaviaAleReal ❤ THANK YOU, @Madonna. Having your legendary person singing the urban Brazilian Funk Music give forces to a whole community who thought we would never be respected for singing it in our own place. Such an honor to be part of your AMAZING story somehow. https://t.co/3MQedxg7f4 RT @idolator: Two Queens. @Madonna joins forces with @Anitta on 'Madame X' highlight \"Faz Gostoso\": https://t.co/VKh5n6NhC0 https://t.co/1k… RT @Madonna: Madame ❌ is everywhere...............My new album is out now - listen here https://t.co/cwDiAKmsiv https://t.co/N9u4mVTZ7Q 😂😂😂😂 https://t.co/CuZszcI3L6 RT @AnittaUK: 🎤 | @Anitta is confirmed at the @tomorrowland festival line-up, The event will take place on 27 July. 🇧🇪 https://t.co/CnEHJwR… Hahahhahahaah https://t.co/M6gmu9iSiu RT @Poclip: Anitta vai ter um show completo no Tomorrowland Bélgica, eu amo um ícone RT @UOLEntrete: Anitta vai tocar no Tomorrowland da Bélgica, em julho https://t.co/d9AJIPaOdp Simmmm https://t.co/erRsKA2JHb RT @quemacontece: O mundo é seu, @anitta! https://t.co/qrIuJA9pBP RT @aesquinca: Ya está en cabina una hermosa y talentosa mujer: @Anitta. \nNo se despeguen de @alfa913fm #DondeTodoNace! https://t.co/Mbu7Bc… RT @ExaFM: ¡Tenemos invitada de lujo en #JessieEnExa! 🙌🔥@Anitta ya está con nosotros para hacernos suspirar. 🎶💕 https://t.co/49ixQedX6k @pedrotuitou Amo cantar no nordeste @anittaxcaro 💛 @anitteronly 🤔 @Anitta_Bunny_ Pq gente @mozonaanitta Já desde as 5 da manhã @rhenancamilo_ Kkkkkkk\nHoje estou aqui @finesseanitta ❤ Amei https://t.co/AeN3iifrXr TOWEL SERIES 150 by @mariotestino #TowelSeries https://t.co/ywiDvjL3mi RT @ClaromusicaMX: Mañana tendremos la belleza brasileña de @Anitta 🇧🇷 en el set de Claro música. Coméntanos qué fue lo que siempre quisist… RT @programa_hoy: Mañana nos acompañará una de las cantantes contemporáneas más exitosas del momento. ¡Sé parte del carisma y talento de @A… https://t.co/m2RfIEMexB RT @voguemagazine: Rio de Janeiro–born pop star @Anitta is pulling back the curtain on her glamorous makeup routine. Watch it here. https:/… ❤ https://t.co/1GaSUAC5PK Banana is available on @smule! Sing along with me 🍌 https://t.co/M7EEvJzeb3 https://t.co/ype2jubTai Weekend done ✅ https://t.co/PrHkmfMYuD Yessssssss 🎤❤ https://t.co/OkU2xcQDpX É só mais uma das suas amor https://t.co/tSImkiYA2o \n#KISSES https://t.co/hxs1y5Lg36 RT @billboardlatin: Vote for your favorite Latin music TV series or documentary: @Anitta, @Maluma, @NickyJamPR &amp; more https://t.co/RiFPAcNj… RT @voguemagazine: Rio de Janeiro–born pop star @Anitta is pulling back the curtain on her glamorous makeup routine. Watch it here. https:/… RT @PeopleChica: We are living for @anitta's vacay looks \n\nhttps://t.co/wjlukf5Iyc https://t.co/STteNtulI5 Como si fuera un juego https://t.co/tSImkjgbqY \n#KISSES https://t.co/DS1711b93V Dice que no pare\nCuando me riega la rosa 🌹\nhttps://t.co/tSImkiYA2o\n\n#KISSES https://t.co/yXpLMwwLVE @SpotifyBR @iambeckyg @multishow Just poquito! 💋 Good morning! So happy to say that my makeup tutorial on Vogue is out! Check it out cause it's amazing. It was a pleasure for me to have you guys in Brazil! 💋 https://t.co/oOBvOLFVqI @iamwill @maluma @iambeckyg @piso21 Love u I know you wanna get to know me https://t.co/tSImkjgbqY\n#KISSES https://t.co/BObA8rB2jg Tu y yo https://t.co/tSImkjgbqY\n#KISSES https://t.co/mzYQbUal6s Just enough to make you miss https://t.co/tSImkiYA2o\n#KISSES https://t.co/FPYkxkMQnh Sin Miedo en Baliiii 😮 https://t.co/84Mvlhnf0b ¿Que vas hacer si me pego? https://t.co/tSImkjgbqY\n#KISSES https://t.co/RbatIjipzZ Banana ft @iambeckyg ficou em #1 no #TOPTVZ do @multishow essa semana! Vem escutar a playlist com as mais bombadas no @spotifyBR \nhttps://t.co/TjCOLxFc1T Hoje eu vou dar trabalho numa onda diferente 🌊 https://t.co/tSImkjgbqY\n#KISSES https://t.co/XfgeqL17pX Junho chegando!!! ❤ https://t.co/ZA03LCmHEt https://t.co/ItqYdPeeS7 Hoje minha amiga @Ludmilla tá lançando o DVD #hellomundo, que tem \"Favela Chegou\" e outros hits. Tá LINDO! 😍 https://t.co/4ZEMChYUz3 https://t.co/PUwrtTav4r I got a sweet tooth for love\nBaby gimmie some 🍌\nhttps://t.co/tSImkjgbqY\n\n#KISSES https://t.co/rJAriJeckd RT @PulseRecording: NEWS: @Anitta's \"Indecente\" (co-written and co-produced by @its_dvlp)  has been certified #LatinGold by the @RIAA  http… Somos las más duras de la carretera \nhttps://t.co/S5fxKZPDKl #KISSES https://t.co/rODfAvApIO @newarthuei 8 dias 😬 RT @CNNEPrensa: .@Anitta: Bailarina, empresaria y la artista más popular de Brasil conversa este domingo con @longobardim desde nuestros es… Hahahahahahha https://t.co/49dKLmXYmZ 100 milhões no clipe de Bola Rebola. Obrigada obrigada obrigada https://t.co/o6UsYMfYXn\n@tropkillaz @JBALVIN @mczaac https://t.co/tJjlLCyU4S Omg \"Rosa\" (ft. @PrinceRoyce) is on the list! 😍😍 Listen now: https://t.co/EmJGSA4SwY https://t.co/DYX5nu5E4w ¡Yo ya se! Jaja. No pierdas la entrevista ❤ https://t.co/rF6HM2jrlm RT @radiofmodia: Tão esperada e ela está aqui &gt;&gt;&gt;&gt; @anitta na #semanamalucafmodia\nVem porque é Acústico #fmodia. #MaluconaFMODia https://t.… RT @kevsho9: video nuevo con ni más ni menos que @Anitta 🔥🇧🇷 jugamos a adivinar el cantante, si quieren ver como nos fue corran a verlo adk… É daqui a pouco, gente! Fiquem ligados na @radiofmodia. Ouça também no https://t.co/iaORGnqu0r https://t.co/YZ2JLgUT06 Amanhã na @radiofmodia https://t.co/HulROQizke Atención \nFormación \nLa capitana llegó.\nhttps://t.co/S5fxKZPDKl  #Kisses💋 https://t.co/PMjUtHO25y RT @QGdaAnitta: Oieeee.... \nEla tá mandando 💋 https://t.co/AOUvSwOM1t Que show! Obrigada São Paulo. Mais um show inesquecível https://t.co/AOr7mSldl5 Que delícia de show Friburgo. Muito obrigada. Agora tem show na Virada Cultural de SP no Vale do Anhangabaú. Vamossssss https://t.co/wH0DJydIWs Just poquito https://t.co/H9WKgYhVzH @anittxprincess Depende de vocês @pcortazio Pq estaria gente? @BalvinittaBR Uma mini @amanda_famorim Não adianta forçar, dê uma pausa e quando estiver bem volte @arianofalso @prometeanitta @ClaroBrasil Puxa assunto com coisas que a pessoa gosta @soloanitta @rafaellnittaRS Sim, mas já estão tentando resolver @vaixanitta Muitooo @iguinitta Vá  estudar @vtrnvs Siiim @rafaellnittaRS Me diz uma coisa, como anda a votação? @davilucash 🤣 @froncksonza Agora @anittaoffense Rola, feliz aniversário @cyrsnitta Que lindo, vocês são demais. Quero todo mundo la @crazyporanitta Ir me ver @bielanitters Já, que pergunta louca kkk @EuHebertSantos Hoje tem friburgo, vamos? @prometeanitta @ClaroBrasil Estou amor @anittxglow @DaviMComents @Tidal_Brasil @Ludmilla @SnoopDogg @papatinho Sim @iIovekisses @anittaxst @DaviMComents @Tidal_Brasil @Ludmilla @SnoopDogg @papatinho Eu prometi, vocês lembram? @MeigoAndAbusado @anittaxst @DaviMComents @Tidal_Brasil @Ludmilla @SnoopDogg @papatinho Oie caio, não deveria ser uma foto minha aí? 🤔 @anittaxst @DaviMComents @Tidal_Brasil @Ludmilla @SnoopDogg @papatinho Segredo, vocês vão amar @ArielleMacedo Amei 😍 @DaviMComents @Tidal_Brasil @Ludmilla @SnoopDogg @papatinho Tudo, tô atrasada respondendo só agora? @euzeestevam @Ludmilla @SnoopDogg @papatinho @multishow @SpotifyBR Oi @ClaroBrasil ❤ @mathanitterr ❤ @danylimass_ Obaaa 😍 Onda Diferente ft @Ludmilla, @SnoopDogg e @papatinho ficou em #1 no #TOPTVZ! Se você não assistiu agora, às 19h tem reprise no @multishow. Enquanto isso, vai escutando a playlist com as mais bombadas no @spotifyBR https://t.co/oy9guUTV18 Alô, São Paulo! É domingooooo! 🎤💋 #viradacultural2019 https://t.co/yunOh2XSyE Escute na playlist “Fervo Brasileiro” do @Tidal_Brasil “Onda Diferente” ft. @Ludmilla, @SnoopDogg e @papatinho. 💋 https://t.co/23qiS2vVDt Passando na sua timeline pra avisar que o novo comercial de PreZÃO já saiu! Quem aí já tem PreZÃO no celular? 🙋‍♀  https://t.co/Stc3o2Qg5U #Paradinha x 100.000.000 @spotify 😱😱 Muito obrigada / Muchas gracias!! \nhttps://t.co/FYxWuDTVGx https://t.co/QWBDABuSCe RT @Los40ar: #Anitta @Anitta pasó por la Tarde de LOS 40 ❗\nSi te la perdiste, ACÁ te compartimos la nota completa en https://t.co/iT5Rwetok… Bola rebola rebola bola rebola\nhttps://t.co/Eiww4TNjMQ https://t.co/Z94FdVjPPU Onda Diferente tá concorrendo a FEAT DO ANO no @MTVMiawBrasil! Além dessa, eu to concorrendo em outras 7 categorias 😍 Acompanhem os mutirões no @QGdaAnitta e votem bastante!! @Ludmilla @SnoopDogg https://t.co/edtFMDOeEg @mrschrst 😂❤ @marceloyousseff Hahhahah odeio lavar a louça @RomyViano Amo Tango... tomava classes cuando niña RT @smcsp: Recadinho da @Anitta que toca no domingo (19), ao meio-dia, no palco Anhangabaú-Plural na #viradacultural2019\n\nVeja a programaçã… RT @billboard: From \"Menina Má\" to \"Poquito\"\n\n@Anitta https://t.co/rbo8rgMaVt Yesss! So happy to announce that I'm joining @diplo next July 30th in Ibiza. / Tan feliz de anunciar que me uniré a @diplo el próximo 30 de julio en Ibiza. Tickets: https://t.co/vH65rR3qWp https://t.co/yV4qYPule3 Todo mi amor para Argentina. https://t.co/aqrTsQKuKz RT @LatinBillboards: @Anitta nos muestra su hermosa sonrisa durante su show en Argentina🇦🇷 #anitta https://t.co/1p3VGGFRFL RT @BillboardArg: Al poco tiempo de editar su álbum #Kisses, @Anitta se presentó por primera en el país el pasado 12 de mayo ante un Teatro… Hi London, I’m coming! I’m so glad to announce that I’ll be at this year Meltdown Festvival, curated by Nile Rodgers! \nTickets available at: https://t.co/dC3WSe8Qas https://t.co/ilvClshYbJ Mood 🌹 -&gt; https://t.co/EmJGSA4SwY\n@PrinceRoyce #Rosa #KISSES https://t.co/iLiUh8MJcN Ouça Kisses no @Spotify https://t.co/FAuSUEn5d1 #kisses💋 https://t.co/FOknZDFE09 Que emoción, Argentina. Muchas gracias por tanto amor y cariño en el concierto de ayer. Completamente sold out, todos cantando, y tanto cariño conmigo. Gracias a todo el equipo de Argentina que confiarán en nosotros. LOS AMO https://t.co/VsiNKkydi8 Nuestro día de las madres. Celebrando juntos mi primer concierto en Argentina, sold out. Nada me deja mas feliz que estar con mi familia, hoy mezclando mi trabajo, estoy todavía más. Los amo mi hermano y mi súper mamá https://t.co/GYR4kKl1Aq Hoje teeeeeeeeeeeem com @maisa e @marcelotas no @programadamaisa às 14h15 no @sbtonline!\nFotos: Gabriel Cardoso/SBT https://t.co/Cd5HnagRkA I do love you, idiota ❤ @maluma https://t.co/2dWZZH2Cdg Hahahaha https://t.co/dsiijiXotV Miss u mooooore https://t.co/6oN1WUUcJe ¡Mi felicidad al descubrir que las entradas ya se han agotado! 😍❤ Llego ya Buenos Airesss https://t.co/Vox1z1EKyn Assista e ouça / Watch and listen / Ve y escucha #OndaDiferente🌊 x @Ludmilla x @SnoopDogg ft. @Papatinho: https://t.co/jYq46DSPN2  \n#KISSES https://t.co/9NL6sjaOFl RT @programadamaisa: PREPARA! Sábado tem ninguém menos que @Anitta e @MarceloTas ao lado da nossa fada @maisa ! Seguuuuuuuuuuuuuura! #progr… No @mtvmiaw latino foram 3 categorias: Instastories, Artista Viral e Music-ship del año: https://t.co/LlpRQdnV4G Ou aqui pelo Twitter\n#PremiosMTVMIAW \n#MTVBRMUSICALANITTA\n#MTVBRCLIPEBANANA\n#MTVBRHINOBOLAREBOLA\n#MTVBRFEATONDADIFERENTE\n#MTVBRLIVESANITTA\n#MTVBRFANDOMANITTERS\n#MTVBRPETPLINIO\n#MTVBRKARAOKEROMANCE\n#MTVLASTORIESANITTA\n#MTVLAVIRALANITTA\n#MTVLASHIPRIP Gente, fui indicada a 8 categorias pro @MTVMiawBrasil, incluindo Clipe do Ano. Votem muuuuito lá no site: https://t.co/eU0KloXnE9 #PremiosMTVMIAW https://t.co/vk0OXyq377 Só para os íntimos https://t.co/2gvIQXvm8w . @diplo https://t.co/pjY1fAn2Pa Assista e ouça / Watch and listen / Ve y escucha #Poquito x @goswaelee: https://t.co/qIIaR9PlFs  #KISSES https://t.co/dNiQr6klGn 💋 #KISSES https://t.co/XydioxbuGY RT @QGdaAnitta: Amoreeeees\nA Anitta é finalista do MTV MIAW BR e MTV MIAW LATINA nas seguintes categorias: https://t.co/T6ebiWAFuX A bênção de viajar a trabalho pra lugares incríveis. O job da vez nos trouxe para Costa Rica e eu to encantada. Conhecendo um pouquinho hoje porque amanhã o dia é cheio. https://t.co/K1jc7CUmIo After Africa, guess what's the next stop? https://t.co/h8XtTE87vK 🏍 https://t.co/rGJBPTSEkq RT @latinxnow: #Anitta serving looks at her first concert in Africa / La reina de Brasil triunfó en su primer concierto en Angola 🔥🙌🏼 (📸: @… Minha primeira vez em Luanda - Angola - África https://t.co/OpfcaUoMNk Muito obrigada, Deus, por me permitir viver essa experiência. O show foi incrível, nunca pensei que tantas milhares de pessoas conheciam cada letrinha do meu trabalho e tinham tanto carinho por mim, mas, independente disso, a energia desse lugar e das pessoas aqui é algo sem explicação. Sem palavras para agradecer e descrever tudo de maravilhoso que presenciei na minha primeira vez na África - Angola - Luanda. Que povo, que energia, quero voltar mil vezes. https://t.co/6InYNlOQa3 RT @MTVLAargentina: YAAAY! @Anitta llega a Buenos Aires con un show INCREÍBLE ¡Y vos no te lo podés perder! Entrá acá y enterate de todo ht… RT @LatinBillboards: The ladies performed their hearts out at #Billboards2019😍 @Anitta @iambeckyg @rosaliavt https://t.co/A3OCmyorY0 Vocês são demaaais mesmo!!! ❤ \nObrigada / Gracias / Thank you\n\nhttps://t.co/kvbURqH4Oe https://t.co/n1dPsN7W0Y @AcessoAnittaR @iambeckyg 💋🍌 ❤🎤 Brasil - agora vamos para Angola que tem show em Luanda neste dia 4 https://t.co/5DRUs5grMK RT @Los40: .@Anitta  nos cuenta la historia que hay detrás de su canción con @SnoopDogg  😱 @40GlobalShow   @TonyAguilarOfi   https://t.co/2… RT @latinxnow: 🍌 @Anitta Plays 'Never Have I Ever' \"Banana\" Edition https://t.co/SDMDerAAJr RT @billboardlatin: Watch @Anitta talk beauty &amp; pain on the #Billboards2019 red carpet https://t.co/2RpwWTEgS9 https://t.co/RNzzoxBtn2 RT @BillboardArg: Luego de cantar en vivo en la ceremonia de los Billboard Latin Music Awards 2019, @Anitta desembarca en Argentina para da… Capa de aniversário da revista @VogueBRoficial . Obrigada pelo carinho. Amei https://t.co/nXGCIwQRJm RT @fierceanitta: SIM, a música de uma BRASILEIRA tocou no estádio do barcelona para milhares de pessoas ouvirem, anitta você é lendária ht… RT @HugoGloss: Anitta, Luan Santana, Eliana e Chay Suede se destacam no “Troféu Imprensa 2019”; confira a lista completa de vencedores! htt… RT @TonyAguilarOfi: VIDEO 🔴 Impresionante mi querida garota @Anitta ayer en #40globalshow188 para España y Latinoamérica 🔥 @40GlobalShow \nh… RT @iambeckyg: Hermanas 👸🏽👸🏽👸🏽👸🏽👸🏽💕 @Anitta @KarolGmusic @lalioficial @NattiNatasha https://t.co/4wJ2364U1b RT @40GlobalShow: Ha llegado el momento de escuchar la entrevista de @TonyAguilarOfi a nuestra invitada STAR40 de la semana @Anitta que vie… RT @Revistacorazon: Hablamos con la cantante @Anitta , que está triunfando en España. https://t.co/3K6H5rahX4 ❤🎤 https://t.co/8XXIqiClOL @kellenb_ Eu @lastamelie Parabéns  👏🏻 @JewelAnitta Eu prometi @cryanitta https://t.co/7hs5k4ECGH @anittxz @carolinatruly Não @arthuremidio_ ❤ @carolinatruly E precisa aceitar algo gente? @anittaxcaro Obrigada meu amor 👀 https://t.co/DfoxB1HiRZ RT @LaRedCaracol: El show de @Anitta y @iambeckyg en los Billboard fue de los más comentados. Pues el derroche de sensualidad de este par d… @ThePerezHilton 😘 Guuuuuuurls ❤ https://t.co/aLmorw89Rb Watch the “Poquito” choreography created by Youjin Kim! 💋\nhttps://t.co/e0pmqgaDeq Hoje eu vou dar trabalho numa 🌊\nOnda diferente ft @ludmilla, @papatinho &amp; @SnoopDogg\nhttps://t.co/jYq46DSPN2\n#Kisses 💋 https://t.co/VLIkRTMqpk RT @40GlobalShow: El domingo viene cargado de 😘💕 \"Kisses\" @tonyaguilarofi entrevistará a la Brasileña @Anitta ¡No te lo pierdas!#40GlobalSh… Lo pasamos rico ayer en los @latinbillboards con mi nueva hermana @iambeckyg ... te quiero, amiga. https://t.co/zEaPYxtXtt RT @HugoGloss: .@Anitta arrasa em performance maravilhosa de “Banana” com @iambeckyg no “Billboard Latin Music Awards 2019”; vem assistir h… RT @billboardlatin: Watch @Anitta discuss her next collaboration, being her own manager &amp; more at the #Billboards2019 https://t.co/gB2zWNiI… Last night 💋 @billboardlatin @latinbillboards @billboard #AnittaEnBLMAs #Billboards2019 https://t.co/rsYezCwANW #Billboards2019 https://t.co/Pdp1pWZUzt @WarnerMusicBR @uglydolls ❤ RT @billboardlatin: Watch @Anitta perform at the #LatinMusicWeek En Vivo concert 🔥🎉 https://t.co/s2HP3uM1rb RT @billboardlatin: Watch @Anitta discuss the Brazilian music market and how she changed the model at #LatinMusicWeek https://t.co/JjeoarY6… \"It only takes a little bit just (...)\"\nPoquito (ft @goSwaeLee ): https://t.co/qIIaR9PlFs \n#KISSES Assista agora \"Poquito\" ft @goSwaeLee no @youtubemusic #KISSES  https://t.co/DWddhrQhXB https://t.co/zq9GnsDsa8 So excited to perform at @BillboardLatin’s En Vivo concert this Wednesday! Hope to see you all there at @DraisLV  for #LatinMusicWeek 💋 https://t.co/0lrQkSx6aU Dice que no pare\nCuando me riega la rosa 🌹\n\nRosa (ft @PrinceRoyce): https://t.co/EmJGSA4SwY\n\n#KISSES https://t.co/CyC7s8HHrj Feliz Páscoa meus fãs amados You got that chocolate\nThat yum yum \ncome gimmie some (...) \nBanana ft @iambeckyg 🍌 https://t.co/nlNnrlwYPa\n#KISSES https://t.co/0FK5rxpit3 Fotos das fotos para a @billboardlatin @billboard https://t.co/kxYxWHtCqV Vertical video of #Poquito with @goSwaeLee is out on @spotify. Click here to watch: https://t.co/C0mN4siaLF Hoje o funk perde mais um grande representante. Luto @SapaoOriginal .... todos os funkeiros agradecem ao tanto de coisa boa que deixou no movimento. ❤ https://t.co/Wod8MuU4qJ RT @LilianPacce: Esses são os melhores looks dos novos clipes da @Anitta? Confira e conta pra gente! https://t.co/ytMFjb8hE0 #anitta #kisse… RT @NBCLatino: Reggaeton fuels Latin music boom, seeks recognition\n\nby @Nicolemarie_A \nwith @leilacobo @LatinBillboards @sanbenito @JBALVIN… RT @SiriusXMHits1: @SoSofiaReyes @RitaOra @Anitta Congrats! #RIP is trending on the #YouTube15 today! Hear it at 6p ET!  🔥🔥 Thanksss @billboard 😍💋 https://t.co/NK0I2dTWoR Onde a gente se encontra nos próximos dias 💋 #Kisses https://t.co/El8b4v4mJK Quinta-feira já da pra entrar na onda diferente, hein https://t.co/6HwYlIzE8F RT @Madonna: Madame ❌ June 14, 2019 ❌ listen to #Medellin ft. @maluma now ❌ https://t.co/HQBAWiXdSW Eu aproveitando que tô no Rio pra aparecer no escritório de surpresa e ver se tá tudo em ordem. 😎 #Boss #Jefa https://t.co/lNAxsFNrha Fatinhaa amei o @EncontroFatima. Pra quem quiser assistir ao vídeo álbum #Kisses completo: https://t.co/ZsMWspUlhc\n#AnittaNoEncontro #Encontro Amanhããã! @EncontroFatima https://t.co/C3zs3gwfho Kisses está disponível na Apple Music - https://t.co/vwGglRcl51 💋 https://t.co/tkTpDNJRuF Tô de folga hoje! E a dúvida é qual escolher entre as mil maneiras de não fazer nada... 💋 https://t.co/ein7PvBFPx nessa vibe na segunda-feira... 💋 https://t.co/cpPITh8KHE @DeezerBR 😏💋 Deu onda no @SpotifyBR Funk Hits! 🌊\n Ouça Onda Diferente ft @Ludmilla, @SnoopDogg &amp; @papatinho em  https://t.co/nuRQA06RN0 #KissesAnitta https://t.co/rL8iTere8V RT @wearebigbeat: ⭐️Poquito⭐️ @Anitta @goSwaeLee - https://t.co/IvUuT2jEdw https://t.co/Wu5wFapENV RT @40GlobalShow: Nos vamos con vuestra elección de las redes sociales. Esta semana @TonyAguilarOfi pincha el sonido de @Anitta ft @iambeck… Yeeeeessssss https://t.co/1uN8v5V7oq @anittalandra Ameiii, foi mara @prometeanitta Jogo baixo @Anittaindecente @Aninosangue Parabens atrasado\nFeliz aniversario @anittenados @Aninosangue Vocês são a minha força @Aninosangue Nãooo @paulohxnrique Vai melhorar @CentralAniraBR ❤ @GetToBanana @gugupfvr @lilithasfuck Prometo @BalvinittaBR Hoje é dia do beijo né? Beijoooo @AnittaSincerona Muita @gugupfvr @lilithasfuck Pq ainda não foi me ver? @cleberley2 Qual sua preferida? @we3ndel Obrigada meu amor 💋 https://t.co/woDc9Xu9qB @bbb @hariany rs fofinha @sizzyrocket Hahaha seriously? 😍 RT @Vertele: Vídeo | La superestrella @Anitta a @davidbroncano en 'La Resistencia': \"Me han dicho que aquí solo se habla de mierdas\"\nhttps:… RT @MTVLAargentina: Cada canción de @anitta se hizo para bailar y que no importe nada ¡A DISFRUTAR, AMIGOOOS! #AltoViernesEnMTVHits https:/… RT @EFE_estilo: Todo lo que necesitas saber sobre el nuevo disco de @Anitta, Kisses, está aquí. #cantante #brasil #sandalias #kisses #Feliz… RT @europa_fm: ▶ #VÍDEO @PabloAlboran versiona 'Poquito' de @Anitta y sus fans enloquecen https://t.co/0BiHTPBvq2 Ouça agora! Listen now! #KissesAnitta\nhttps://t.co/r8cgtt2HuZ More than 100MM streamings on KISSES album after 1 week . So happy! Thank you ❤\n\nMais de 100MM streamings do álbum KISSES em uma semana! Estou tão feliz! Obrigada ❤ https://t.co/zYRufJNA4n \"Poquito\" e várias outras músicas tão bombando na playlist #Hitou da @DeezerBR: https://t.co/dAm4IJEWIJ https://t.co/WsBOaOmPa5 Tô tão animada pra mostrar pra vocês minha nova música \"Ugly\", da trilha sonora do filme @UglyDolls! Vocês já podem fazer o pré-save da trilha e ouvirem \"Ugly\" agora!\n https://t.co/p0jv3pImVI\n#UglyDollsMovie https://t.co/iWys7ossSc I’m so excited to share my new song “Ugly” from the @uglydolls soundtrack with you! Pre-order or pre-save the soundtrack and listen to “Ugly” now! \n https://t.co/IsmP2a2epr\n#UglyDollsMovie https://t.co/WaCIbbCZ3b Onda diferente ft @Ludmilla, @SnoopDogg &amp; @Papatinho está nos Hits do Momento da @Tidal_Brasil! 💋\nOuça em: https://t.co/GNguj9uJ3k\n#KissesAnitta https://t.co/41W8EVukNR RT @WarnerCanada: 🌟 STAR of the week goes to @Anitta 🌟\n\nListen to her new track #Poquito off of her latest album “Kisses” 😘💋\nhttps://t.co/S… RT @PrinceRoyce: Dice que no pareeee...🌹🧯 #ROSA @Anitta —&gt; https://t.co/8dwY1ew9od https://t.co/hz797Lxa53 RT @LaResistencia: Hoy @Anitta se sentará en el sofá del programa, le preguntaremos unas cosas, responderá otras, pasaremos un buen rato y… RT @Ludmilla: MAIS DE 10 MILHÕES DE VISUALIZAÇÕES EM #OndaDiferente!! Vocês são f*da!! 💣💥🔥🔥🔥 https://t.co/sdpvgkKc08 https://t.co/A9Q6Jotqzf RT @Ludmilla: Eu ouvi 10 milhões em ONDA DIFERENTE? 🔥 https://t.co/sdpvgkKc08 \n@Anitta @SnoopDogg @Papatinho #AnittaKISSES #OndaDiferente h… Hoje eu vou dar trabalho numa onda diferente 🌊💋 @Ludmilla @SnoopDogg https://t.co/N1oeYgoIeQ I'm so proud to be part of this panel with these amazing women to talk about female leadership 💋 https://t.co/Lbct2quB99 So glad to perform at the @billboardlatin this year! https://t.co/nvN1mi5sji RT @CHANCE_es: Anitta (@Anitta): \"Los españoles tienen muy buen gusto, por eso tenía que venir aquí\" https://t.co/c8uqWB9w7n https://t.co/W… RT @idolator: We're so lucky to be alive at the same time as @Anitta! We review the Brazilian pop star's excellent 'Kisses' album: https://… RT @DJcity: Now on our @Spotify playlist: @Anitta &amp; @goSwaeLee's #Poquito. The Brazilian superstar recruits Swae for a chilled-out club cut… RT @napster: Today's Napster #SOTD is @anitta's #Poquito. #ListenNow on Napster! https://t.co/ENadqZUi0M\n\n#SongOfTheDay #napster #newmusic… Veja e ouça Você Mentiu ft  @caetanoveloso\n#Kisses💋 #KissesAnitta \nhttps://t.co/2jSx3dTHar https://t.co/4QkcNxTr0g RT @billboardlatin: Vote for your new favorite Latin album: @Anitta's 'Kisses,' @AlejandroSanz's '#ElDisco' or @RomeoSantosPage's 'Utopia'… RT @divinity_es: WOW!! 😱 Este miércoles, a partir de las 18:00 hrs, estaremos en directo en nuestro perfil oficial de #Instagram con la art… RT @NattiNatasha: 30 millones y contando #TeLoDije con @Anitta 👸🏻👸🏻! https://t.co/Odi3UKLJie. Aprovecho para felicitarte por el éxito de tu… RT @aureliomanzano: La cantante @anitta llega a Madrid para ser imagen de @ipanemaoficial y congrega a más de un centenar de medios de comu… RT @NME: Brazilian superstar @Anitta has one eye on the English-language market with fourth album 'Kisses', but it's her Latin-pop beats th… Veja e ouça Rosa ft @princeroyce\n#Kisses💋 #KissesAnitta \nhttps://t.co/2jSx3dTHar https://t.co/U5erJSDGYa Veja e ouça Tu y Yo ft Chris Marshh!\n#Kisses💋 #KissesAnitta \nhttps://t.co/2jSx3dTHar https://t.co/3nbdubcecd Veja e ouça Sin Miedo ft @DJLuian &amp; Mambo Kings\n #Kisses💋 #KissesAnitta \nhttps://t.co/2jSx3dTHar https://t.co/qwSaHPhi7k Veja e ouça Onda diferente ft @ludmilla, @papatinho &amp; @SnoopDogg! #Kisses💋 #KissesAnitta \nhttps://t.co/2jSx3dTHar https://t.co/AnXEcuHbhE 💋 https://t.co/jZXi6ngvwi RT @elchiringuitotv: 🌟¡QUÉ ESPECTÁCULO!🌟 @Anitta, MEGAESTRELLA musical brasileña, está EN DIRECTO en #ChiringuitoAnitta. ¡LUJAZO TENERTE CO… Veja e ouça Poquito ft @goSwaeLee!\n #Kisses💋 #KissesAnitta \nhttps://t.co/2jSx3dTHar https://t.co/DUgBAWFcWr Veja e ouça Juego! \n#Kisses💋 #KissesAnitta\nhttps://t.co/2jSx3dTHar https://t.co/jiqn7BLeZ1 Veja e ouça Get to know me ft @Alesso!\n #Kisses💋 #KissesAnitta\nhttps://t.co/2jSx3dTHar https://t.co/Pytnir5SKK RT @FAMAabailarCero: ¡Hoy hemos tenido la suerte de contar con la visita de la gran @Anitta! 🤩 Mientras ella sigue en la Escuela hablando c… Y yo los quiero mucho! 💋 #Poquito #KissesAnitta https://t.co/wKZHBEptPW En unos minutos estaremos en directo cantando “Poquito” mi nuevo single en @famaabailarcero :) #FamaABailar8A No faltes!!! Veja e ouça Banana ft @iambeckyg! \n#Kisses💋 #KissesAnitta https://t.co/2jSx3dTHar https://t.co/EWXP8ORA8D Veja e ouça Atención!   #Kisses💋 #KissesAnitta\nhttps://t.co/2jSx3dTHar https://t.co/CJaQTqi4PX Obrigadaaa!!\nThank you!!\nGracias!!\n#KissesAnitta @spotify\nhttps://t.co/GXcAMmawAx https://t.co/4FovNzYCOe RT @reformagente: 📹 . @Anitta te invita a escuchar su nuevo material discográfico, #Kisses, en un mensaje exclusivo: https://t.co/7jVbk4Hyk… RT @gentemural: 📹 El nuevo material de @Anitta contiene varias colaboraciones con artistas como @iambeckyg, @djkhaled y más: https://t.co/4… RT @elnorte_gente: 📹 . @Anitta le mandó un montón de 'Besos' a sus fans con su nuevo disco, el cual te invita a escuchar en un mensaje excl… Have you checked out my new visual álbum \"KISSES\"? Just go! #KissesAnitta https://t.co/4pBzS0XVXI RT @iambeckyg: 🍌🍌🍌🛒 #BANANA WITH @Anitta OUT EVERYWHERE!! 🍌🍌🍌 https://t.co/NU2wSuIkKl https://t.co/n0iNKcNsds RT @exatv: 💎 #ExaNews RT si te gustó #Banana de @Anitta Ft. @iambeckyg 🔥🍌 https://t.co/gZkgkBocCL RT @Central_mx: #Actualidad | ¡Fuego! 🔥 ¡@Anitta is in the house! ¿Estás listo para su nuevo álbum; #KISSES? ¡Prepárate! Deja todo lo que e… RT @PublimetroMX: 🇧🇷 @Anitta estrena disco #Kisses 💋😘 que incluye duetos con \n@PrinceRoyce @iambeckyg @SnoopDogg y @caetanoveloso\n ¿Ya lo e… RT @Alesso: Congrats Queen @anitta! Thanks for letting me being apart of it! 🇧🇷 🇸🇪 Check out “Get To Know Me” on Anitta’s new album. https:… Hahahhaha https://t.co/uwEkqiH4Zh @SpotifyMexico @SpotifyChile @SpotifyLatino los quiero mucho! Gracias 💚 Argentina, Chile y México! @Spotify takeover latin america ❤ #KissesAnitta https://t.co/MxQwWVC4Oy RT @WarnerMusicArg: ¡Qué día para los fans de @Anitta! \n💪💪💪 https://t.co/vRXB4Qc2uy RT @billboardlatin: Stream &amp; listen to @Anitta's limitless new album #Kisses https://t.co/p03mKmZXNz https://t.co/bEphi2gCQl RT @SpotifyLatino: Let @Anitta show you how to kiss in three different languages in her new album “Kisses” 💋💋💋: https://t.co/AkNRyENus2 htt… Confiram a resposta! https://t.co/HRNvCRGSBF Porque lançar um álbum e não mais singles? #Ipanema_Anitta #ANITTAKISSES https://t.co/YetKgl2ebG RT @billboard: Stream &amp; listen to @Anitta's limitless new album #Kisses https://t.co/KIFhecXuTD https://t.co/QI7hyjheq6 Resultado: vocês pediram para conhecer o 1º andar da casa #Ipanema_Anitta . Olhem que lindo ficou! #ANITTAKISSES https://t.co/jr3nwcrG0A Escucha mis nuevos singles Poquito y Banana en Novedades Viernes de @spotifymx #AnittaKISSES\nhttps://t.co/yPG1Eb0KL3 Qual andar da Casa #Ipanema_Anitta vocês querem conhecer primeiro? #AnittaKisses RT @Ludmilla: Então sai, sai, sai da nossa frente, hoje vamos dar trabalho numa onda diferente... Vem curtir “Onda Diferente” com a gente!… RT @PrinceRoyce: Video oficial de #ROSA con @Anitta disponible ya! Check it out https://t.co/8dwY1ew9od Sobre o que você quer saber de #Kisses?\n\na) Depois de vários singles, o que te levou a lançar um álbum? #SobreOAlbum\n\nb) Qual clipe foi mais difícil de fazer? #SobreOsClipes\n\n#AnittaKisses RT @SpotifyBR: Um beijo vale mais do que mil palavras.\nSalvador, Brasil.\nCOUNTDOWN #KISSES 💋 https://t.co/Ssy7tFIN07 RT @SpotifyBR: Vocês acharam que a @anitta não ia beijar muito hoje?\nMeia-noite.\nCOUNTDOWN #ANITTAKISSES 💋 https://t.co/jtA53Ffi0X RT @SpotifyBR: Medianoche. Midnight. Meia-noite.\nBogotá, Colômbia.\nCOUNTDOWN #ANITTAKISSES 💋 https://t.co/QMDFRtYiVe RT @SpotifyBR: Quase lá, hein, @anitta?\nMeia-noite.\nCOUNTDOWN #ANITTAKISSES 💋 https://t.co/GAAZ5qoFmg RT @RobertaMiranda1: @Anitta muy hermosa poquito Obrigada! Também amo https://t.co/R6zrcTtVmM RT @BreakTudo: Cara de Hit! Ouça \"Poquito\" música de Anitta em parceria com Swae Lee e Josh Gudwin https://t.co/mu27tRHh10 #Anitta #AnittaK… RT @PortalTracklist: Qual a favorita de vocês do #AnittaKISSES até agora? Amamos \"Poquito\", \"Tu Y Yo\" e \"Get To Know Me\"! @anitta RT @multishow: Quem aí já escutou #AnittaKisses hoje? AAA MEU AMOR, por aqui é só replay infinito da minha musa @anitta RT @iambeckyg: #Banana!! Ya disponible en todas las plataformas 🍌🍫🍭 Video with @Anitta mañana! How many bananas do you think are in here?..… Thanks amiga https://t.co/LCXFdmntve Hahahah te amo https://t.co/f4jjIY10OL RT @SpotifyBR: Besos. Beijos. Kisses. 💋\nChegou KISSES, o novo álbum da @anitta. Ouça agora no Spotify: https://t.co/3AYisQZ4sO\n#ANITTAKISSE… Contagem regressiva pro lançamento de KISSES no @SpotifyBR! #AnittaKISSES 💚💋 ANSIEDAD, @SpotifyBR?\n#ANITTAKISSES 💋 https://t.co/56AjF7Kwsj #AnittaKISSES 💋 https://t.co/HBBFLZk04T RT @elchiringuitotv: 🌟La MEGA ESTRELLA @Anitta🌟estará ESTE LUNES en #ElChiringuitoDeMega presentando su álbum -KISSES- ¡QUÉ GANAS! https://… RT @stilo_es: Mañana ya llega #KISSES lo nuevo de @Anitta\nhttps://t.co/5PobjRoWqG @Valeskarissima @MomentsBrasil Nao tem ninguém reclamando rs. Só avisando que o robô cai com as redes públicas que sobem o áudio. Pra tomar tomar cuidado. Apenas. Os fãs já ouviram por whats link interno mas rede aberta pode atrapalhar. Mas esse bloqueio é só até sair no país onde vc está @erlan_bastos Depois pesquise a relação que infelizmente alguns países ainda tem muito mais pesado que no Brasil com a comunidade LGBTQ e vai entender o pq desta parte de mim também estar no álbum além de outras 9 que nada tem a ver com essa @erlan_bastos A única planta que existe nessa pauta é que ele recebeu o vídeo mais de 10 dias atrás e eu perguntei se ele poderia segurar até o fim da explicação do conceito do álbum pra que menos pessoas falassem baboseiras desse tipo rs @MomentsBrasil Mas fiz da minha maneira de ser em tom de brincadeira. O povo viaja 🤦🏽‍♀️ @MomentsBrasil música antes de ela estar disponível em seu território. É um reconhecimento de áudio igual usam no aplicativo shazam. Então o que fiz foi alertar aos fãs para que suas páginas não sejam derrubadas por violação @MomentsBrasil Amores.  Não foi um vazamento. O álbum está pela primeira vez senti lançado através da cia global. Isso é feito mecanicamente e faz com que cada país libere 00h nas plataformas. Como eles detêm os direitos das músicas eles ativam um robô que caem com as contas que sobem a RT @LatinBillboards: Mañana sale el nuevo álbum de @Anitta y @PrinceRoyce aparece en una de las canciones 🌹 #anitta #KISSES https://t.co/qk… RT @cmtvargentina: Se viene el álbum de @Anitta // #Anitta lanzará su nuevo álbum, que contará con la participación de @PrinceRoyce en una… 10 Anittas.\n10 Músicas/Songs/Canciones \n10 Videoclipes/ Music Vídeos/ Videos Musicales \n10 Playlists  @Spotify \nhttps://t.co/O3Tr2O9dIT\n#KISSES💋 https://t.co/zFrVBiLs0S RT @elisaosegueda: Look who stopped by @etnow. @Anitta 💛💋 #KISSES #ETMÁS https://t.co/05Mz8IIiBV RT @DLasAmericas: #Música La brasileña @Anitta anuncia colaboración con @Caetanoveloso y Snoop Dog   https://t.co/2CeF1tX3A8 😚😚😂 https://t.co/0fpMwmvYya Para terminar \"VOCÊ MENTIU\" ft Caetano Veloso, a faixa sentimental. Ela mostra uma Anitta muito adulta, madura, que acredita que a beleza das pessoas está em seu caráter. Ela é generosa, serena e simples por dentro e por fora. #KISSES Faixa 9 é \"JUEGO\", a definição da palavra \"Boss\". Ela comanda, ela faz acontecer, ela lidera. Todos a respeitam! Assista um trecho do que vem por aí no IG da Ipanema Colombia - https://t.co/TMx8rK7svW #KISSES #ad https://t.co/IyZChW6jKQ Faixa 8 é \"ROSA\" ft @PrinceRoyce com sensualidade à flor da pele. Uma Anitta que te hipnotiza pelo olhar! Seja hipnotizado e confira um pouquinho no IG da Ipanema DE - https://t.co/bmOONAoeaV #KISSES #AD https://t.co/t91HgyqXxd Na 7 você vai conhecer a Anitta de “GET TO KNOW ME” ft @alesso, que ainda está em processo de amadurecimento. Ela é uma adolescente por dentro, ainda imatura e descobrindo a vida, suas relações e atitudes! A @ipanemaoficial mostra em: https://t.co/RYVv6WXohW) #KISSES #ad https://t.co/EOIHYIjxK9 Na 6, \"TU Y YO\" ft  Chris Mashall conta sobre a Anitta que não desce do salto. É sofisticada e não se entrega totalmente nem na hora da sedução. Essa é outra faixa que a @clarobrasil esteve comigo e você pode ver aqui: https://t.co/t3eaFWFZbQ #KISSES #ad https://t.co/5JFRA2YoTM Faixa 5 é \"POQUITO\" ft @goSwaeLee, mostra uma versão sexy porém romântica e sonhadora. Guarda sua extrema sensualidade apenas para seu alvo amado. Conseguem imaginar como vai ser? #KISSES Faixa 4 é \"SIN MIEDO\" ft @djluian, é a personificação da palavra \"impulsividade\", desconhece a palavra \"consequência\"!  #KISSES Faixa 3 é \"ONDA DIFERENTE\" ft @Ludmilla &amp; @SnoopDogg mostra uma Anitta camaleoa, que se adapta! Dança conforme o ritmo. Ela sempre encontra um jeito de se encaixar no ambiente onde é colocada. #KISSES Faixa 2 é \"BANANA\" ft @iambeckyg  mostra uma Anitta que ama deboche, sarcasmo e bom humor! Esse é um dos quatro vídeos que tem a @ipanemaoficial, vejo making of em https://t.co/C6NbtRNxfK #KISSES #ad https://t.co/uChe94l6Sx Faixa 1 é “ATENCÍON” que mostra uma Anitta cheia de atitude, super independente, que gosta de exaltar as outras mulheres! A @clarobrasil mostrou um pouco do making of do clipe https://t.co/FE5v6exusj ;) #KISSES #ad https://t.co/DTigZwkTqV [THREAD] #KISSES vem aí! \n(pre save em:  https://t.co/Uprc0e21dT) RT @QGdaAnitta: https://t.co/Ekc95IAgXB https://t.co/ZMvD4LMMV3 RT @caetanoveloso: Meus parabéns, @anitta! Muitas felicidades e vida longa! 👉🏼❤ Feliz em cantar com você a canção “Você Mentiu”, do seu nov… RT @MariliaMReal: parabéns pra nossa artista do Brasil  @Anitta ♥️🇧🇷 Estou vivendo um sonho há meses e dia 5 de abril vocês vão ver tudo! ❤ #KISSES https://t.co/LEo9j2UxZ8 RT @XandAviao: Minha patroa Larissa, que Deus te abençoe sempre com muita paz e saúde. Meus parabéns, @Anitta. https://t.co/YymFpvl8Sv RT @Spotify: Happy b-day Rainha @Anitta 👑🎂\nhttps://t.co/P2LCPnCBTK https://t.co/QmvETsrlbK RT @NattiNatasha: Celebremos con @Anitta su cumpleaños escuchando #TeLoDije a través de @Spotify. happy bday baby girl, love u so much. Dis… RT @Los40: PRIMICIA: @Anitta  y @iambeckyg   se unen en ‘Banana’ 🍌🍌https://t.co/xUm38imdU2 https://t.co/4OI6Lo3GEH RT @WORLDMUSICAWARD: Happy 26th Birthday to the beautiful super talented #Anitta! @Anitta \n❤️🇧🇷🎤🎂🎉🎁🎈💐🎇🌟\nhttps://t.co/kTL4gPa5lW https://t.c… ❤ https://t.co/X1o7n2cBfK @hariany Kkkkkkk RT @MomentsBrasil: ⚡ A @Anitta completou 26 anos! Vem ver as homenagens do fandom:\n\nhttps://t.co/uBKNzlFa3N RT @ClaroBrasil: Chegando aqui cedinho porque hoje é aniversário dela! Parabéns, @Anitta! Seus amigos aqui da Claro te desejam um novo ano… Obrigada, meus fãs por tantas mensagens lindas de aniversário I'm so proud of being part of \"UglyDolls\" soundtrack singing in english, spanish and portuguese! Don't miss it - May 3rd on theatres!\nSoundtrack pre order: https://t.co/1kUv1c5UNb \n#UglyDollsMovie #UglyDolls #ad https://t.co/I5kCSHt1w9 Estou muito orgulhosa por fazer parte da trilha sonora do filme @uglydolls cantando em português, inglês e espanhol. Não perca, dia 16 de maio nos cinemas! Pre save da trilha sonora em: https://t.co/1kUv1c5UNb \n#UglyDollsMovie #UglyDolls #ad https://t.co/0D8IsuxCmC Contracapa #KISSES https://t.co/v4pP66ecJX RT @idolator: April 5 *cannot* come soon enough! Brazilian pop goddess @Anitta left us gasping for air with her glorious 'Kisses' album cov… RT @UnNuevoDia: También se suman a la lista de confirmados @Anitta @ReikMx @RomeoSantosPage para cantar en esta edición de @LatinBillboards… RT @TonyAguilarOfi: PRIMICIA 🔴 Esta será la caratula de KISSES, el disco de mi querida garota @Anitta. No os parece un portadón? https://t.… Te extraño amigo https://t.co/no8Cw0qlDr RT @Los40: 🔥Guau!! Nos acaban de pasar la portada del nuevo trabajo de @Anitta y hemos flipado. Se trata del cover de #Kisses y promete ser… 😍 https://t.co/nawM9egUBo RT @billboard: Here is everything you need to know about @Anitta's new album #Kisses https://t.co/ph18pEuWcg https://t.co/QzxRQt3TvF Yesssss https://t.co/UKqlNxjvqB RT @MikeAdamOnAir: .@Anitta drops #Kisses on April 5th, and as we count down the days, she breaks down a track off the project with each IG… RT @POPline: Ela não está para brincadeira! Em ritmo frenético, @Anitta vai lançar álbum visual no RJ, Los Angeles e Madri na mesma semana.… Track 10: VOCÊ MENTIU #KISSES https://t.co/3MV34knn5A Track 9: JUEGO #KISSES https://t.co/mhZzyosVYf 20 MILHÕES DE OUVINTES MENSAIS? Obrigada! ❤ https://t.co/9X6K1DvsPA RT @LatinBillboards: Shine bright like @Anitta ✨ #anitta https://t.co/UPU8vXlao4 Track 8: ROSA #KISSES https://t.co/F9HjVBeQ48 Track 7: GET TO KNOW ME #KISSES https://t.co/pIVHgQ7qIR Track 6: TU Y YO #KISSES https://t.co/SuMOdaYOkV Track 5: POQUITO #KISSES https://t.co/kdIIHfsxbH RT @SoSofiaReyes: Guys! I’m SO excited, just got the news that @1027KIISFM is playing #RIPtotheBS TONIGHT at 10pm PST @DJtripleXL !! Let th… RT @ClaroNicaragua: ¡Hacé que suene!  🔊🎶 Y ponete a bailar al ritmo imparable de “Terremoto” el éxito de @Anitta y @kevinho disponible en @… RT @Z100NewYork: @AnittaDailyR @RitaOra @Anitta @SoSofiaReyes Love it! It's on my \"Coming In Hot\" List of my fave new songs 🔥 ox Erica RT @los40colombia: #Los40UrbanMusic ¡Nueva música!  “R.I.P.” la nueva canción de  @SoSofiaReyes junto a @RitaOra y @Anitta. \n\n¡Escuchas LOS… Track 4: SIN MIEDO #Kisses https://t.co/7aevtwxfhA Track 3: ONDA DIFERENTE #KISSES https://t.co/hM4HAm2f6P RT @HugoGloss: Preparados para conhecer 10 @Anitta's em uma só?! O álbum visual #Kisses está chegando e a gente já tem essa primeira foto e… Track 1: ATENCIÓN #KISSES https://t.co/Am8Q2IpFir Track 2: BANANA #KISSES https://t.co/AwRT2U6m8e Soy una de las nominadas en la categoría ARTISTA EXTRANJERO FEMENINO @premiostumusic1 y tu podrás ver EN VIVO a través de youtube! https://t.co/t2gs830CRu #premiostumusicaurbano #TuMúsicaUrbana2019 https://t.co/Z35TTNO9s6 RT @POPline: Em parceria com a marca Ipanema, @Anitta vai lançar projeto em três cidades: Rio de Janeiro, Los Angeles e Madri. Simultaneame… RT @idolator: .@SoSofiaReyes, @RitaOra &amp; @Anitta join forces for the instantly catchy \"RIP\": https://t.co/ewWolyUugN https://t.co/GeDr5JhE5y Dia 5 de Abril eu lanço meu primeiro álbum áudio visual trilingue. Inglês, espanhol, português. 10 músicas, 10 clipes, 10 Anitta's. Tudo ao mesmo tempo. Aguardem. KISSES. https://t.co/XNDjPiP3zf 😘 https://t.co/xmKtp1nfaD RT @Spotify: .@SoSofiaReyes, @RitaOra and @Anitta are saying adios to the stereotypes ✌️ Hear their new collab on the #VivaLatino playlist… vocês são demais, obrigada por todo amor sempre!!! #DiaDoFã 💗 https://t.co/r5UEOFpSz2 🤔 https://t.co/9iPpkt3cJ6 ⚠️ https://t.co/M7hbnfJHrv Bora assistir \"Vai Anitta\" hoje na @Netflix? https://t.co/LEZjtqG5FN RT @duttypaul: LOOK QUICK!!! LUV HOW @ANITTA TUN UP 2 #CONTRALAPARED!!! 🔥🔥🔥@JBALVIN https://t.co/AtY3ni1jgb Mi boca hoy va de rosa 👄\nhttps://t.co/Qp5O5Wswvr\n#RIPtotheBS https://t.co/NCGUIMr1KV 😍 https://t.co/vfIcspE6ym RIP is on Pop Up @Spotify\nhttps://t.co/sV1mO3V3tj https://t.co/fkuy3B64cf Don’t waste your time on what they’re saying 👄 https://t.co/Qp5O5Wswvr\n@SoSofiaReyes &amp; @RitaOra #RIPtotheBS https://t.co/FFf2g0UHQr É hoje! R.I.P. to the bullshit with @sofiareyes @ritaora\nhttps://t.co/sBirIN6pnZ\n#RIPtotheBS https://t.co/Usw71ZTdcf I only wanna feel good vibes 👄 @SoSofiaReyes @RitaOra \nR.I.P is out now: https://t.co/sBirIN6pnZ\n#RIPtotheBS https://t.co/uFt3cWXBHn RT @RitaOra: Love you too @SoSofiaReyes @Anitta!! Dramas dead to me, byeeee 💁🏼‍♀️❤️ #RIPTOTHEBS https://t.co/OMQzJpNkNq Só pra lembrar que tá chegando a sexta-feira.\nhttps://t.co/hReQPF1tXM  🧡 https://t.co/TU1vXwICZG RT @SoSofiaReyes: 3 DAYS ⚰️ 3 DÍAS 💀 3 DIAS 🌻\n[MARCH 15TH] \n#RIPTOTHEBS x @RitaOra x @Anitta https://t.co/NRuNhlfHm7 RT @warnermusiclat: R.I.P. IN 3 DAYS ☠️🥀👄 #RIPTOTHEBS @SoSofiaReyes x @RitaOra x @Anitta. Who’s ready? https://t.co/z62okToCSX 😘 https://t.co/7tzjSM7jg5 @djsnake @Moraisf5 Fuego RT @SoSofiaReyes: PRE-SAVE R.I.P. 🥀⚰️💀🌻 https://t.co/tXolubhN3A \n\n#RIPTOTHEBS x @RitaOra x @Anitta https://t.co/pDgwcrO4Ls RT @WarnerMusicBR: Faltam só 4 dias para chegar o hino das divas @SoSofiaReyes, @RitaOra e @Anitta 💖✨ E já tem até challenge rolando pra vo… RT @warnermusicmex: Nos morimos por escuchar la nueva colaboración entre @SoSofiaReyes,  @Anitta &amp; @RitaOra, pre guarden #RIP en @SpotifyMe… @thxrmn Você sabe ler? Eu não passei a característica de ninguém, não apontei, apenas disse que havia uma pessoa roubando. Coube à polícia atuar e apurar. Galera que pergunta sobre sábado. As pessoas no chão estavam pedindo pra eu avisar a polícia que tinha um ladrão no meio do público. E foi isso que eu fiz. A visão de cima, por mais que seja ampla não é suficiente para eu ver com detalhes o que se passa em meio a multidão. RT @sitevagalume: A cantora @Anitta e @luisamell resgatam cachorros abandonados em estrada. Veja o vídeo! https://t.co/pfqEl1fIe5 https://t… RT @MarlonWayans: So much fun at @anitta party. Love this woman. Don’t get drunk and speak Portuguese. Weird shit happens. #brazil saudades… RT @folha: .@Anitta leva surdos a Bloco das Poderosas em ação de inclusão e encerra Carnaval; leia mais no blog Inteligência de Mercado ---… Está nascendo um novo líder\nNo morro do Pau da Bandeira\nhttps://t.co/GJ61kbZH23 https://t.co/9qT1m8F7yE Quando eu desço, é igual terremoto!\nhttps://t.co/HAhzy9Hrv4 https://t.co/pXVBB5yZZo Baile da Colômbia virou minha casa agora 😁😍\nhttps://t.co/NKCF3Xbbya ❤️❤️ @Alesso https://t.co/q93Uve4VmS Vem rebolar, vem! 🍑\nhttps://t.co/fdUvZ8bgSj https://t.co/DwahqcbQcJ #RIPtotheBS \n March 15th \n@RitaOra @SoSofiaReyes https://t.co/6vTqXdzMHR RT @106th: .@Anitta killed this tribute to @Xtina + \"Can't Hold Us Down\" with her #Carnival2019 #Carnaval2019 look 😍\n\n...let's chat about 𝓧… Enquanto isso \"Favela chegou\" é mais um hit bombando nesse Carnaval... isso é funnnnnk 😍\nhttps://t.co/GSnFAND04t https://t.co/Bnr6NwAjmJ Todo mundo rebolando e tocando o terror?\nhttps://t.co/HAhzy9Hrv4 https://t.co/ZDbljR4tV0 @KayaneFernanda4 Fundo do mar Acabei de ver que o parabéns que dei pro nosso fandom foi pro QG.... eita nóiiiissss... parabéns meus amoressssss @AnitterJean @POPline @pabllovittar Olha. Pra mim é bastante dinheiro sim pq eu sei o quanto trabalho pra conquistar. Eu estava bem na minha em relação a tudo. Se não queria que o público soubesse era só não divulgar meu áudio por aí pra todo mundo ouvir e me achar uma louca. @detalhesani Eu não. Dei parabéns aqui e tudo. @memoriesanitta Afonso hahhahahaha. Tá bem. Mas na base de remedios @POPline @pabllovittar Eu nunca disse q ninguém me deve nada. No áudio divulgado (vazado na minha concepção é quando acontece sem querer) eu apenas digo q não faz sentido me chamar de pão dura depois de eu ter feito um investimento grande sozinha, só pq não quis gastar mais pra levar todo mundo de jato @Emais_Estadao @neymarjr Inclusive, se contar, meu cachorro Plínio já tem o Medina no currículo  HAHAHHAHAHAHHAHA @Emais_Estadao @neymarjr Alto lá que eu e minhas amigas ainda estamos nessa enquete pra saber se beijo vibes micareta conta como pegar ou não... pra saber se a nossa conta fica nesse zero ou se vai pros decimais.  Hahaha @aguinaldaosilva Ainda bem que mru chip é claro. Que se eu tiver que me declarar cada vez que dou um beijo na boca vou precisar de muita internet. Haha Onde eu estiver vai virar sua casa agora\nhttps://t.co/NKCF3WTAGC Bola rebola rebola bola rebola\nhttps://t.co/fdUvZ8bgSj https://t.co/oIuNy50V6Q RT @steveaoki: The queen 👸🏻 🇧🇷 @Anitta https://t.co/oqLuw4E4Fw 😍 https://t.co/NNmag760pH RT @WarnerMusicBR: Tem playlist perfeita pro Carnaval passando pela avenida! 🔥💖🙌 Vem ouvir os hits da seleção O Melhor do Verão, incluindo… RT @HugoGloss: Uh tiazinha, mexe essa bundinha e vem!!! OMGGG! Tô no chão com a homenagem de hoje de @Anitta de mais um “Vale a Pena Ver de… ÔÔ a favela chegou!\nhttps://t.co/GSnFAND04t https://t.co/SqSGygCjSn RT @JogosOlimpicos: 🎊 Isso aqui, ôô! 🎉 @Anitta, @caetanoveloso, @gilbertogil e baterias das escolas de samba do Rio de Janeiro para o seu #… Vem rebolar e tocar o terror!\nhttps://t.co/HAhzy9pQ6u https://t.co/gVuTMMMeJO \"Favela Chegou\" está na playlist Funk Hits do @Spotify!\nVem ouvir: https://t.co/dJG0mqgoCR https://t.co/QZu5nQSyIL Baile da Colômbia virou minha casa agora ❤️\nhttps://t.co/u2wQpUBthO O bonde já chegou na @deezerbr! Ouçam agora #FavelaChegou na playlist #HITOU, vem: https://t.co/352bzRpCov 💃🎉 https://t.co/M51sOeTwKn Bola Rebola Rebola Bola Rebola https://t.co/Eiww4TNjMQ https://t.co/MnCLR9wE2j RT @Ludmilla: Empina e raaaaasga @Anitta! 👀 O clipe de #FavelaChegou tá no ar: https://t.co/dYwQat78KM https://t.co/B49E76Vpby \"Favela Chegou\" já está disponível no Youtube! ❤️\nVem assistir: https://t.co/ZP4106bpoV https://t.co/Ls5xVnzwSQ FAVELA CHEGOU\nhttps://t.co/GSnFANloFT https://t.co/4Wez36wAyy RT @SpotifyLatino: Who else felt the Brazilian heat after listening to \"Bola Rebola\"? 🇧🇷💃🏻🍑 Start sweating with @tropkillaz, @JBALVIN, @Ani… RT @POPline: A Billboard costuma abrir um espaço que faz uma retrospectiva de toda a carreira de grandes artistas por meio dos clipes. A @A… RT @Ludmilla: TÁ CHEGANDO LUDMILLERS E ANITTERS! “Favela Chegou” será lançada meia noite e amanhã, meio dia, sai o vídeo no meu canal! Vamo… RT @LudmillaCentral: Favela • @Ludmilla e @Anitta • 27.02.2019 • 12:00 • https://t.co/OeI05DFoaO #VemFavela RT @billboard: From \"Menina Má\" to \"Venenos\" ❤️\n\n@Anitta https://t.co/tqwBXKTsMk Love u @lelepons ❤️ https://t.co/6gOMpQUbRf ❄️☃️💛 https://t.co/Nwz5c2Mfcm RT @Alesso: Congrats to my friends @JBALVIN @Anitta on your new song https://t.co/foWosp5nT1 HAHAHAHHAHAHAHAH https://t.co/JJ6AP5a4qm Favela - 27/02 ❤ https://t.co/yCosak5zgV RT @POPline: PARA TUDO! Elas ouviram o público e vai ter música da @Ludmilla com @Anitta antes do carnaval sim! Estamos a 48h pro lançament… RT @WarnerMusicBR: Prepara pra rebolar a raba nesse carnaval, bb 👯‍🔥🔥\n @Ludmilla e @Anitta mandaram avisar que lançamento de “Favela Chegou… RT @HugoGloss: OMG! Vocês pensaram que elas não iam rebolar o bumbum hoje, né?! Recebam com exclusividade, o primeiro trecho de “Favela”, a… RT @NattiNatasha: ¿Ya viste el vídeo #TeLoDije con @Anitta? Actívense! https://t.co/Odi3UL3kGO https://t.co/AAagL1ZFti RT @JBALVIN: Bola Rebola 💯🔥🇧🇷 siempre caliente nunca frío, como carnavales de Rio. Link en el bio @anitta mczaac @tropkillaz https://t.co/V… RT @NattiNatasha: Por culpa de la copa amaneciste en mi cama sin ropa #TeLoDije con la baby ⁦@Anitta⁩ 👸🏻👸🏻🔝  https://t.co/ntNcrqp2He RT @mundotkmcom: Estuvimos con @Lalioficial @Diegotorres @Abrahammateo y @Anitta, entre otros, en la red carpet de Premio Lo Nuestro. https… Latino gang rompiendo con \"Bola Rebola\" https://t.co/RiIi5mzFK1 Snow astronauts ❄️☃️🌬 https://t.co/CXDLGIF3Oo Rebolar e tocar o terror ✅\n👉 https://t.co/hReQPF1tXM https://t.co/MnuMXRb4fy Já ouviu \"Bola Rebola\" hoje? https://t.co/Eiww4TvIog https://t.co/eWLBgGOSag Vem assistir o clipe de \"Bola Rebola\" https://t.co/dTQ4VFqrBB https://t.co/YPTEmcBIfX RT @QGdaAnitta: A premiere do clipe “Bola Rebola” já tá disponivel! @anitta https://t.co/BWiFK16SqY RT @premiolonuestro: ¡La salsa vive! Y ahora @Anitta toma el escenario de #PremioLoNuestro 🔥🔥🔥💛💛. https://t.co/eJli8z4lma 😍 @premiolonuestro https://t.co/iVNExcTD5j RT @HugoGloss: DIVA! @Anitta apresenta versão salsa de “Veneno” em performance no Premio Lo Nuestro 2019; assista https://t.co/EUmDi4IEts (… RT @shots: .@Anitta tonight at @premiolonuestro 🖤🔥 https://t.co/CjXzt0Ptlc https://t.co/fYjFAUEErX RT @WarnerMusicBR: .@Anitta no palco do @premiolonuestro 🔥🔥 A cantora fez parte da homenagem ao estilo salsa performando uma versão de \"Ven… @premiolonuestro https://t.co/gmrzBj3uZK @premiolonuestro https://t.co/Z0phvN3cYo @premiolonuestro https://t.co/dJ9RdhlW9Q “Bola Rebola” já está disponível em todos aplicativos de música! Vem ouvir: https://t.co/dTQ4VFI2t9 https://t.co/C1Ahxhs4Ow Bola Rebola chegando. Hoje 00h (horário do Brasil/Brasília) áudio disponível nas plataformas. Amanhã 2 pm clipe disponível https://t.co/goaVtE8CyC Today in Miami! @LIVmiami https://t.co/vQTsnggt33 RT @NattiNatasha: ¿Ya viste el vídeo de #TeLoDije con @Anitta? Chequéalo y déjame saber que te pareció https://t.co/Odi3UL3kGO RT @NattiNatasha: Ya salimos! #TeLoDije @Anitta https://t.co/Odi3UL3kGO RT @NattiNatasha: Te lo dije una vez que cuando te pillara ibas a volver 😈👸🏻👸🏻💃🎶 dime @anitta ya salimos a romper! ¿Que les pareció el víde… PreZÃO nele pan pan 🎶 é o novo hit da @ClaroBrasil! Olha só👇🏻\nhttps://t.co/R8Y3UuD5OI E lá vou eu... https://t.co/65rFKBtt9T 22/02 Bola Rebola + @JBALVIN @tropkillaz @ofcmczaac https://t.co/Uig1VIXe9F Alô melhor época do ano! 💛 https://t.co/YUK2TPRWAw This week, new song - Bola Rebola https://t.co/RbrZ9HkV9A RT @DeezerBR: Terça também é dia de curtir uma baladinha, meu povo! Vem curtir essa dançante versão de “Zé do Caroço” na voz da @Anitta em… RT @showdavida: Antes de cirurgia, @MaestroJoaoCarl se despede do piano com apresentação com participação de @Anitta no palco do Fantástico… Vamos assistir \"Vai Anitta\" hoje na @Netflix? https://t.co/UKEy9WRCAk @NattiNatasha Siiiiiiiiiiii Vem rebolar e tocar o terror! https://t.co/hReQPEJSzc 💛 https://t.co/4tJdWjJ6sY RT @JBALVIN: Nos fuimos pa Brasil mi gente, hagan el pre-save de Bola Rebola junto a @Anitta @tropkillaz y #MCZaac y vean el detrás de cáma… @Jhonatamacedo12 Eu vejo @anittaxcaro 💛 Amores vocês sabem que estou concorrendo na categoria Melhor Cantora 2018! \nVotem votem votem https://t.co/G0Sb20VFAx Muy feliz de hacer parte de tu álbum amiga amada @NattiNatasha ❤️\nhttps://t.co/JIJGZBZ0wv https://t.co/f5zJu7VGfG RT @DeezerBR: A nossa playlist Anos 2000 tá recheada de grandes clássicos escolhidos a dedo pela @anitta. Então chama a atenção dos amigos… ❤️ @NattiNatasha https://t.co/rwOOtOSFKK Pre Save Português: https://t.co/OKUBDVUCYw\nPre Save Inglês: https://t.co/UYnQkGgOqB https://t.co/kQcWo7UPgO Saiu gente! Vem ver e ouvir \"Zé do Caroço\" no Youtube!\nAssista: https://t.co/lBzmiicAAn https://t.co/Hxm0Qk1Ael \"Zé do Caroço\" já está disponível em todas as plataformas de música!\nVem ouvir: https://t.co/GJ61kbI5Dt https://t.co/kLcINfAuyf RT @HugoGloss: OMG!!! Preparados para esse HINO?! Recebam em primeiríssima mão a capa de “Bola Rebola”, nova música de trabalho do @tropkil… Terremoto 👉 https://t.co/hReQPF1tXM https://t.co/MVkwEvUAs6 RT @billboardlatin: Just added: @Anitta, @JBALVIN, @manaoficial and more to perform at #PremioLoNuestro https://t.co/4XP6BhvvQC https://t.c… RT @premiolonuestro: .@Anitta llega al “Downtown” 🏙de Miami con 4 nominaciones a #PremioLoNuestro y es parte de una colaboración musical de… 😍 https://t.co/CqC6VHmbPo Happy to hear that I'm finalist for the #Billboards2019! Don't miss the @LatinBillboards on April 25 at 7pm/6c on @Telemundo. Vote: https://t.co/yZ4KqFSoF0 https://t.co/gPyWJ2OsRT 🌞❤️ https://t.co/tI1NT9ngWc RT @billboardlatin: It's between @Anitta, @Anuel_2blea, @SanBenito &amp; @lalioficial! Vote for who you think should win Social Artist of the Y… RT @LatinBillboards: Esta Brasileña ha robado nuestros corazones♥️ ¡Felicidades, @anitta! #Billboards2019 https://t.co/7ucOcfAVa9 RT @POPline: Mais um passo importante na carreira de @Anitta: ela conseguiu uma indicação ao Billboard Latin Music Awards, a versão latina… #WeLoveCardiB @iamcardib Noooo @iamcardib don't leave the Instagram... just active comments only for who you follow like I did and u gonna be fine. That's the new life 😍. If u leave Instagram we loose all fun Genteee, olhem só essa playlist que eu fiz pra @deezerbr cheinha de músicas dos anos 2000! Tem Mariah Carey, Kelly Key e muito mais, ouçam aqui: https://t.co/cP3XigU15F https://t.co/SbXGC9wtjS RT @LIVmiami: Get up close &amp; personal with the queen @anitta Thurs. Feb. 21st! Tickets at https://t.co/2gI0nFs4oC. https://t.co/m2tdlvruj1 \"Terremoto\" está disponible también en el Apple Music 🙌💕 Escuchalo ahora! 🙌💕 https://t.co/Od5YAqvQ5j https://t.co/dM0T6OptFj Paz https://t.co/B1zxoj3TOz Quem vai rebolar e tocar o terror hoje? 👉 https://t.co/hReQPEJSzc https://t.co/Y1dEQL9kFq Sonho https://t.co/owgUDMNlCs Terremoto está em 1º na playlist “Today’s Hits” da @AppleMusic! 💛\nEscute aqui: https://t.co/QK6fVeG8ps https://t.co/j0TuYcymt0 Chegamos nos 30 milhões de views!\nMuito obrigado! Vocês são demais 💛\nhttps://t.co/dqdJvdne76 @kevinho Eu amo você hahhaha é sério RT @kevinho: Desafio o mundo inteiro fazer o #TerremotoChallenge melhor que eu! Dançarino profissional atuando na área 💁🏽‍♀️🤣 @anitta https… @MikeAdamOnAir 😘 RT @Los40: VÍDEO. 'I'm still in love with you' , el videoclip de la canción de Sean Paul que @anitta ha recreado 👯https://t.co/nLE6jV7tJg h… RT @billboardlatin: The first time @Anitta, @Ozuna_Pr, Bad Bunny (@sanbenito) &amp; more stars hit No. 1 on Latin Airplay chart https://t.co/FS… #TerremotoChallenge 😂 https://t.co/QK3pVtN4nw Para concorrer é obrigatório preencher o formulário! Não esqueçam 🧡 https://t.co/xcxID0eX5W Se você é desses com mestrado em Boquinha da Garrafa e doutorado em Quadradinho de Oito, essa é a sua hora! Vem participar do concurso “Terremoto Challenge\" by @HugoGloss! Acesse: https://t.co/KGnvHaKr1S https://t.co/LAhFGPMWfJ Nature love https://t.co/t5clKH6s0J RT @HugoGloss: Quer dar close no trio do Bloco das Poderosas, de @Anitta, dia 9 de março, no Rio de Janeiro, com acompanhante e tudo pago?!… \"Terremoto\" está em Lançamentos da Semana na @Deezer!\nOuça aqui: https://t.co/ohqTvX7xSW https://t.co/i8iZE1gsY8 Se você é desses com mestrado em Boquinha da Garrafa e doutorado em Quadradinho de Oito, essa é a sua hora! Está no ar, o concurso “Terremoto Challenge by Hugo Gloss”! Vem participar: https://t.co/KGnvHaKr1S https://t.co/XTtoUDqfMJ ☀️ https://t.co/MfzWMqqV9a Terremoto is on Viral Latino @Spotify\n👉 https://t.co/JN0ap8CkKf https://t.co/hGSCquQdxD RT @lospremiosheat: Arriba las manos 🙋🏽‍♀️ @Anitta está nominada a #MejorArtistaFemenina 🤩 #PremiosHeat 4ª edición 🎙\nhttps://t.co/eNuTTchvu… 🧡 #TerremotoChallenge https://t.co/OLfvvdomrf Chegamos nos 20 milhões de views e 1 milhão de curtidas no clipe! MUITO OBRIGADO 💛💛💛\nhttps://t.co/dqdJvdne76 Tudo começou quando me procuraram pra aprender a tal \"dancinha\" que eu fiz no clipe. Fui ensinar e agora tá todo mundo tentando! Hahaha amei. Faz o seu e me marca que eu quero ver #TerremotoChallenge https://t.co/ty1Dn1T96J Watch my awesome “In Conversation” interview with @jesustalkz from @TIDAL now: https://t.co/RmwldAGlt1 https://t.co/p8MiLr17t9 Quando eu desço é igual terremoto\nRebolo e não paro, eu toco o terror\n👉 https://t.co/hReQPEJSzc 💛 RT @ClaromusicaMX: \"Terremoto\" es lo que está causando @Anitta con su sencillo. Escúchala aquí:\nhttps://t.co/itBolvqCpE https://t.co/iKNaGI… 😍 https://t.co/Znp6f9ABhw RT @MikeAdamOnAir: #Terremoto by @Kevinho and @Anitta already has over 12 MILLION views on YouTube!! Peep the video here https://t.co/osjXU… RT @MikeAdamOnAir: When it comes to the most pre-saves in Spotify history, @Anitta and @Kevinho now hold that title (previously held by \"Ta… RT @cleanbandit: A great pleasure to work with the ultimate Brazilian queen . We have been trying to meet up for a while and it is so perfe… Quando eu desço é igual \nTerremotoAnitta&amp;Kevinho @kevinho Ce acredita TerremotoAnitta&amp;Kevinho @er_kaufmann @QGdaAnitta Sim Estou sabendo que @QGdaAnitta vai subir uma tag @kevinho Já quero você fazendo o #TerremotoChallenge Amooooores, ainda está rolando a votação de Melhor Cantora - Prêmio Contigo.\n\nVotem muito, vamos ganhar!\n\nhttps://t.co/G0Sb20VFAx RT @planetatlantida: A @anitta fez o Planeta tremer com a estreia de Terremoto. Rainha faz assim, né? 💁‍♀ foi lindo demais! #SóQuemVaiSente… RT @multishow: Pra tremer com tudo vem o \"Terremoto\". Música nova com o hitmaker, Kevinho, o single, lançado HOJE, já tá aí na pista. E a g… Já assistiu? Então vem rebolar e tocar o terror! 💛 https://t.co/Uq3URFrDQm RT @elheraldoco: .@Anitta y @kevinho rinden homenaje a Sean Paul en ‘Terremoto’ https://t.co/p3ChBfDglz https://t.co/DMICifHfjq RT @malandrnitta: Gente o pessoal daqui de casa não aguenta mais #Terremoto https://t.co/WiUIbJrB67 Deu super certo! https://t.co/n8s5O092Yg RT @malandrnitta: Obrigado pelos mimos @anitta @QGdaAnitta @kevinho 🌪🔥✨ #TerremotoChallenge https://t.co/l9Q37xrRxQ RT @UaiSooh: depois de muito tempo hehehe #TerremotoChallenge https://t.co/nGdhGZm2qp Vem feverê! 💛 https://t.co/Xgg4uNjaz9 Terremoto está disponível no @AppleMusic! Acessa lá: \nhttps://t.co/ZKE2OPRdAS https://t.co/m6AvNTwyp5 Daqui a pouco tem TVZ no @Multishow! Já vai sintonizando aí 😘 https://t.co/kSz4cvLUcx Vamosss... precisamos de 300k plays até 19h https://t.co/aAWGOh2cIb cada usuário conta apenas 10 plays diários RT @POPline: Sexta é dia do que? Dia de baixar os mp3 para atualizar o iPod! Olha essas dicas da @anitta e do @kevinho com faixas para anim… RT @skol: ArRaSoU nO cLiPe MaS NaUm AcEiTa o DePô, @Anitta. #ClipeTerremoto https://t.co/CnPysrWxgz Hahaha amei as letras maiúsculas e minúsculas https://t.co/ou9MIWcWsq RT @TIDAL: Dropped: #Terremoto. @Anitta x @kevinho. https://t.co/qgXYSqGcK2 https://t.co/ICh0igOkDf RT @DeezerBR: Ninguém vai ter estrutura para não tremer tudo no #Terremoto da @anitta e @kevinho. Ouça essa parceria na Deezer: https://t.c… RT @warnermusiclat: Happy FRIDAY! Listen to Terremoto by @Anitta x @kevinho if you want to start shaking things up for the weekend 😉 https:… RT @showdavida: Hoje, @Anitta e @kevinho lançaram #Terremoto! E, ao #Fantástico, a cantora falou um pouco de como o clipe da música foi con… 😂 https://t.co/ou9MIWcWsq Saiuuu #Terremoto! Corre lá no meu canal do YouTube e assista: https://t.co/hReQPF1tXM 🧡 https://t.co/Nv6E4lZjT9 Eu ameiii https://t.co/fT6yJHwrB8 #Terremoto já está disponível em todos os apps de música!\nOuça agora: https://t.co/HAhzy9Hrv4 https://t.co/o19lgpTidh RT @TIDAL: International superstar @Anitta discusses her humble beginnings in Rio de Janeiro, the potential of Brazilian funk going global,… RT @kevinho: se ta sabendo que vai ter TERREMOTO AMANHÃ né? RT @HugoGloss: Tchutchuca treme treme! Recebam em primeira mão, a capa do single “Terremoto” de @anitta e @kevinho! A música será lançada m… Watch my awesome “In Conversation” interview with @jesustalkz from @TIDAL now: https://t.co/RmwldAGlt1 https://t.co/9bKRKo4KM3 Hoje meia noite sai a música. Amanhã meio dia sai o clipe. Vamos de \"Terremoto\" com @kevinho que eu não vou deixar faltar música pra gente dançar esse carnaval https://t.co/RDQuO5Kh4v Estou na capa da Pop Brasil! Valeu @Spotify! ❤️\nOuça: https://t.co/iLMLgy1OfR https://t.co/j5GBA2GBSj 2 dias pra eu voltar no tempo com @kevinho no nosso \"Terremoto\" https://t.co/W9SCV8t2FB RT @WarnerMusicBR: Preparados pro #Terremoto?? 🔥💥 Faça o pre-save do hino de @Anitta &amp; @kevinho, que sai na sexta &gt;&gt; https://t.co/QRRZA1vJk… RT @jequiti: A Colônia Clube da Anittinha tem fragrância Frutal Vibrante, vem em uma embalagem linda e é super fácil de levar para todos os… Vem gente! Pre Save de Terremoto 👉 https://t.co/A0hqDw4TGz 💛 https://t.co/6WooafZbk4 Alô Feverê 💜 https://t.co/tmTPuHopbV RT @POPline: .@Anitta e @Kevinho resgatam sucessos de 2002 em teaser de \"Terremoto\". Confira: https://t.co/lpSL3Iw9B7 https://t.co/QflUPZwT… RT @SpotifyLatino: Inject some #Veneno into your playlists with help from @Anitta 😈\nhttps://t.co/AnWMrEepu7 https://t.co/LWcw2yqSxK RT @kevinho: Dia 01/02 tem lançamento do hit #Terremoto com minha irmã @Anitta e o pré save já esta disponível amores, corram e participem!… Cê acredita, @kevinho?! Sexta feira tem clipe e música pra vocês! Pre save disponível. Link: https://t.co/A0hqDw4TGz https://t.co/6c0qKwdDbu RT @HugoGloss: Tremeeeeee! @Anitta acaba de confirmar a data de lançamento de “Terremoto”, sua parceria com @kevinho! A música e o clipe es… 01.02 Terremoto @kevinho https://t.co/A0hqDw4TGz https://t.co/TxTm5gV8ge RT @QGdaAnitta: ESTAMOS COM NOVA VOTAÇÃO\n\nMelhor Cantora\n\nPrêmio Contigo! 2018 - Melhor cantora\n\n https://t.co/sOZowAHZea 😊 @kevinho https://t.co/FWMIx4PfbP Tô assistindo \"Vai Anitta\" na Netflix, vem pra cá! 😉 https://t.co/Fu2kfOzLsL 🎤💜 https://t.co/weUuBreo0N Eu ouvi playlist maravilhosa pra inspirar a sua tarde? 🤔\nEntão tá aqui: https://t.co/mMhorUNJr6 💜 😘💜 https://t.co/d576E8GPpH RT @SpotifyLatino: Be brave, sing “thank u, next” and heal that 💚 with @Anitta: https://t.co/AnWMrEepu7 https://t.co/oZB5ats09A RT @billboard: .@Anitta drops fierce cover of Ariana Grande's \"Thank U, Next\" https://t.co/wkdy4Wqnrb https://t.co/vF4nHFzsCi RT @MEOpt: Vai, @Anitta! Dia 7 de agosto, o palco MEO do @MEOSudoeste é teu. ✨ https://t.co/us86DFZHWQ RT @UMPG: 🎧 @Anitta is the first Brazilian artist to release Spotify Singles. She dropped two songs today including a fierce cover of Arian… ☺️💛 #SpotifySingles https://t.co/Dxa4IZQ38e Thank u, @Spotify ❤️ #SpotifySingles https://t.co/YlT5Sjzrel Já conferiu nossa surpresinha no @spotify? Eu sou a primeira Brasileira a participar desse projeto delicioso. Tô amando. https://t.co/pIJMDmMdTV\n#AnittaSpotifySingles https://t.co/vHFtDXCXck Bom dia #AnittaSpotifySingles Feliz que vocês gostaram. Vou dormir que acordo super cedo. Estava só esperando sair pra perguntar o que acharam. Beijos #AnittaSpotifySingles @memoriesanitta Depende de qual #AnittaSpotifySingles Simmmmmm #AnittaSpotifySingles https://t.co/k8sWpeEfKj RT @Mari_Candelato: @Anitta Aaaaaaaaaaaaah!!! Ficou lindo, lindo, lindo! Amando mto 😍💜 https://t.co/VSKC5Y7KBG @xamafioo Anavitoria #AnittaSpotifySingles @MumuzinhoC Te amo #AnittaSpotifySingles Thannnnnksss https://t.co/TcDp20DXc4 @CatitiBerto Me perguntaram se eu queria trocar os nomes dos bofes.... mas já temos polêmica suficiente né ... ficou ótimo assim 😬 @AcessoAnittaR 😘 #AnittaSpotifySingles RT @centralanittabr: Ouça agora o Spotify Singles com Anitta. #AnittaSpotifySingles \nhttps://t.co/GW8U1pGIUJ @MarceloF_DM Obrigada #AnittaSpotifySingles @eriiqui Isso foi gravado ano passado rs Hahahahha to amando https://t.co/2fcbBUdOma Curtiram? @AnittaMozao Não. É o jean meu amigo Tá no ar  https://t.co/svJjjtOJmS 00h tem surpresinha RT @WarnerMusicBR: Se liga nesse ba-ba-do sobre a amiguinha @Anitta... 💁‍💁‍ Ela é a primeira brasileira convidada pelo @Spotify para partic… É amanhã @Spotify 😍 Fiquem ligados! https://t.co/MSpHKaVd4a Voltando no tempo hoje com a gravação do meu novo clipe com @kevinho \"Terremoto\" ... recriando o clipe de \"I'm still in love\". https://t.co/YkXEta9bp9 RT @kevinho: É terremoto 😧😉 @Anitta https://t.co/T8giZyGfH3 RT @ShockCo: .@Anitta se le midió a probar frutas exóticas durante su paso por Bogotá, la llevamos a probar toda clase de productos en la P… Vamos de \"Vai Anitta\" hoje na @netflix? https://t.co/hK4fkpIxDL @BlogAnittei Claro, não sei como vocês descobrem @anittenados Sim @AnittaSincerona Vai ter surpresa @falsocamilizer Sim, primeira vez em SP @manumacedopl Amei @finesseanitta ❤️ @bgkjuniorz Hoje vai ser babado @anittawonder Indo pra casa @taynarasilverio Perdeu @shawnnira Não É amanhã, Rio!! \n\nOferecimento: @ClaroBrasil e @skol https://t.co/7bap0Mf1ET RT @billboardlatin: .@Anitta, @CNCOmusic, @JBALVIN, @JLo &amp; @maluma are all up for social artist of the year at #PremioLoNuestro! Vote for w… ❤🎤 https://t.co/5RFQFz7g0Z Bati um papo com a @Anittinha que me disse que já tem material escolar disponível do Clube da Anittinha no Brasil inteiro! https://t.co/bPa9QyW5Nj @darlinganitta 17/02 @contigocaro Eu amo vocês, são tudo pra mim ❤️ @goalsanitta Eu também @Sorriso_Anitta Muito vou me acabar @sensacionanitta Falo @kellenb_ Sonhou o que? @world_anitt4 @sapatonta @bangttx Eu vejo @prometeanitta ❤️ @MilyTaormina_ To firme e forte @badanielc Trabalhando RT @QGdaAnitta: AMORES!\nReta final para o “Premio Lo Nuestro 2019”\n\nVamos votar!!!\n\nArtista Social Del Año\nArtista Revelación \nArtista Feme… Obrigada @exame ❤️\nLink para matéria: https://t.co/O5a3Orff7a https://t.co/aww2BkGGjo 💪❤️ https://t.co/m9JbpTMMSc RT @skol: @Anitta A gente continua daqui, então 😂💦 https://t.co/1zmvlVcc98 RT @abigailbklein: Hey @anitta! Just came rebolando back from #brasil and discovered my #nyc grocery store is the #paradinha store! #vaiani… @brendafreitasss Hahahahaha RT @billboard: From \"Menina Má\" to \"Venenos\" ❤️\n\n@Anitta https://t.co/iZhJPeromR Piscininha, amor! https://t.co/xezFVlMU7i Que energia linda! Mesmo embaixo de chuva a galera não parou um segundo. Amei https://t.co/bVMdGNNTSe Domingou! Bora ver \"Vai Anitta\" na @Netflix? https://t.co/969L9k9C7z 🤔❤️ https://t.co/DqXNCOA3Br Amores, estou concorrendo ao Prêmio \"Troféu Internet\" 2018 em duas categorias! Votem votem votem: https://t.co/rki6HyR93k ❤️ https://t.co/kdRryKNpis Janeirou 💜 https://t.co/IIsDklGHlf 🎤💜 https://t.co/Z79SWQalf8 🐍💜 https://t.co/MK2rrQDbrf Que felicidad saber que estoy nominada 4 veces al @premiolonuestro. Me da ganas de seguir trabajando en este gran desafío que es seguir haciendo mi trabajo en mi país que amo y además llevar mi música a tantos otros lugares y idiomas. Gracias por el reconocimiento. Y vamos votar! https://t.co/OZpaQgDQdv 2019 e @john nao sabe quem é minha cantora favorita no mundo. Vocês podem contar pra ele por favor? por que depois dessa eu cortei relações. ❤️💙💚 https://t.co/gnf3bjrJqB @memoriesanitta O de do atitude serve pro de do \"De novo\" @heyy_anitta @HAPPYFMRADIO 17 de fevereiro RT @NewHopeAust: Vai Anitta - Is That For Me by @Anitta Yes. Summertime #RepublicEarth #Brazil 🇧🇷 @prygomees Calma menina. Ainda não Amei hahahahha https://t.co/hwQtyOU98p Lol https://t.co/Lzf7DG5rtl Los amo https://t.co/nLCaUS39By @NattiNatasha Creo que ya mi amiga linda RT @HAPPYFMRADIO: ¿Quién es @Anitta? ¿Por qué todo el mundo habla de ella? Os lo contamos: https://t.co/mMHQoVY6fz https://t.co/WGQZSEnjXc 🎡 https://t.co/lLQJScmLL8 💝 https://t.co/c2HerZuvfa Já assistiu minha série na @Netflix? Busque por \"Vai Anitta\" e have fun https://t.co/YxTXZxM1h9 😍 para @revistadepunta https://t.co/SDE8jLM6q2 2️⃣0️⃣1️⃣9️⃣ https://t.co/2IRQFpF45u Não sei vocês, mas são tantos planos para 2019 que eu vou precisar daquele gás. Dá uma olhada! #VaiNoGás @CocaCola_Br #ad https://t.co/fFd0jhYFRg Feliz Ano Novo! 🎆 https://t.co/faWHcXhpmT Retrospectiva 2018 https://t.co/29dHtmazFc Deixa comigo @Spotify que nesse final de ano eu que vou tomar conta dessa playlist aqui: https://t.co/gAs0mVAv7F https://t.co/WlWSMGPYkT 👋😘 https://t.co/MA4GGVHPdR 😜💜 https://t.co/Ui9owHaml6 Veneno 🐍 https://t.co/kvbURqH4Oe https://t.co/Eq1JKz59RP Não Perco Meu Tempo 💋 https://t.co/TU9dxIfxJG https://t.co/Wc7g3eUPFd Goals ✨ https://t.co/Zgu5P6VVGa https://t.co/Fm8D4VsVKI De churrasco e doce e Skol https://t.co/9KVxy12nRd RT @DEZAgradavel: Tá chegando aquela hora tradicional do Natal: os stories do churrascão na casa da @Anitta Feliz Natal meus amores 🤶 https://t.co/JvjnsnFztW RT @kyarellano7: Or I’ll probably just learn Portuguese from @Anitta IG story 🤷🏼‍♀️ lol Me too https://t.co/PLiJ9m2NGQ Eu ouvi um jingle bell? 🎅 https://t.co/tJY6aOxozA RT @SIRIUSXM: .@CalienteSXM has your front-row seat to @Anitta's intimate performance and interview live at SiriusXM Studios. Click here to… E aí, bora maratonar \"Vai Anitta\" na @Netflix? https://t.co/IF4unxwkG4 Amanhã tem Volta Redonda!\nIngressos: https://t.co/8qEQeX9IlU https://t.co/7HtLD1PwxQ 🐍 https://t.co/kvbURqptpE https://t.co/YwrSQcoNFF A playlist perfeita pra sextar hoje! Vem comigo: https://t.co/dyiPJS8LVC ❤️ https://t.co/RmskZQr8RC Vem Janeiro! 😍 https://t.co/99PKtUWgME Mala Mia Remix @maluma @iambeckyg https://t.co/np76PucQJP 😇 https://t.co/xYqp7pnIdX RT @QGdaAnitta: Reta final galerinha!\nVota vota vota \nhttps://t.co/QzqRkO5ncG https://t.co/7LZuZtuNLs Onde eu sou feliz. 💜 https://t.co/OBvVLL2204 Listaaaaaa https://t.co/dK1wdYOP3u 😍 https://t.co/ruZ8uJrGJD 🤷🏻‍♀️ https://t.co/PS032crnK6 Hoje faz um ano que lançamos o clipe de \"Vai Malandra\". Eu não posso dizer aqui tudo que esse clipe movimentou pelo mundo por que vai todo mundo dizer que eu tô me achando, querendo aparecer etc. Mas vocês podem, então digam aí nos comentários que eu vou amar ler em comemoração. https://t.co/bdS9ry2V2k Alô Volta Redonda! Logo mais estarei aí no evento Maiss Verão!\nIngressos: https://t.co/8qEQeWS7um https://t.co/wRTlLWjymn Los amo, ustedes han marcado mi vida para siempre ❤💚 @LaVozMexico https://t.co/cus4RWIX8r Cheguei! Quase me atrasei mas peguei um barquinho pra chegar a tempo de maratonar \"Vai Anitta\" hoje na Netflix​. Vamos? 🛶😅 https://t.co/4oTrIf8X6K La Rumba en @AmazonMusicMX https://t.co/AK8GS6l9Z6 https://t.co/806cVk0qmu 😏 https://t.co/nJwqvYhqHj 😘 https://t.co/vi87YnTXmU 🐆 https://t.co/w2nfJ5Ehby 🐍 https://t.co/kvbURqH4Oe @YouTube https://t.co/1rVcMHwjiu RT @MTVLA: ¿Ya sientes la emoción? ¡No podemos esperar a que ya sea mañana! 😱😱😱#MTVEnVivo @anitta 8PM MX/CO/AR solo por MTV📺 https://t.co/A… RT @somosla92: Mañana @Anitta se tomará La 92 como nuestra Dj de radio invitada. Presentará sus canciones favoritas para prender la fiesta… RT @CARASmexico: @anitta, una de las coaches de @lavozmexico, envía saludos a los lectores de @carasmexico desde la #PosadaCARASLaVoz2018 🎉… Mañana en @MTVLA #MTVEnVivo 💜 https://t.co/3wakKqZUbJ Did you know I have my own series on @Netflix? Search for “Vai Anitta” on Netflix. https://t.co/YAwGbiVzNc RT @matheusdiasof: Cara, eu acho essa música boa crlh https://t.co/lkKtefcGKx RT @IsraelNovaes: Bom te ver voando cada vez mais alto! 🙌🏼 @Anitta https://t.co/i1xfMUDFJb RT @MTVLAargentina: Todo el talento brasilero de @Anitta llega a nuestras pantallas, con un show exclusivo para toda Latinoamérica. No te p… RT @programa_hoy: En exclusiva llega @Anitta este miércoles a @programa_hoy ¡Te esperamos en punto de las 9:00 am en compañía de la coach d… RT @MTVLA: . @Anitta  es de las artistas latinas más exitosas de este año y morimos por que veas su presentación en vivo🔥🔥🔥🔥 ¡La amarás aún… @boninho Minha mãe é especialista vou perguntar a ela @boninho Dona Naná hhaahaha @boninho Boninhoooo poe um casal que não esteja mais junto hahahaha ... Manu e Tirso amo @boninho Sol, pink, cida bbb2, o coveiro que esqueci o nome.... pera que vou lembrar mais 🐍 https://t.co/xlpCDWat74 RT @SuporteAnittaBR: // Anitta já está no México 🇲🇽 \n\n- Anitta via stories 💜 https://t.co/BjbfJxcbpf Hmmmm https://t.co/tCnfQ9FdgX Obrigada, obrigada e obrigada! Sem vocês nada disso seria possível ❤️ https://t.co/KolxmlvAqn RT @MomentsBrasil: ⚡️ Vai @Anitta! A cantora levou a melhor neste domingo e recebeu o #TroféuDomingão 🏆\n\nhttps://t.co/QeR6nwyJhS RT @gshow: Vai, malandra! @anitta vibra com prêmio de Cantora do Ano e lembra pós-operatório no #TroféuDomingão #MelhoresDoAno https://t.co… RT @RedeGlobo: .@Anitta é a vencedora!!!!! ❤️❤️❤️ #TroféuDomingão #MelhoresDoAno https://t.co/E9sPw9Kmf5 RT @40GlobalShow: Viajamos hasta @Los40Chile con nuestro querido compañero @Chororois que han entrevistado a la artista Brasileña @Anitta ¡… Muy feliz que estoy entre los 100 artistas más tocados en @AppleMusic en México 😍 https://t.co/pUH4GoQOaJ https://t.co/hWCpqctHiO 🐍💜 https://t.co/kvbURqptpE https://t.co/jF3o2hbgAO RT @raullsantiago: Aeroporto de Bogotá - Colômbia! \n@Anitta 🙌🏽✨ https://t.co/YTgDXD5Ibl @allanslss @netflix Truqueira pq? @To_perita 😘 Omg https://t.co/XSzzqJbazK This is huge! 🙌 My song Vai Malandra was selected for @applemusic's Best of 2018 playlist. Listen now: https://t.co/xlzeNES8Z1 #BestofMusic2018 https://t.co/18xoH6H9X9 Meu pai quase esqueceu que combinamos de maratonar \"Vai Anitta\" na @Netflix​ hoje. Mas não tem problema, ele que vai fazer a pipoca 😅🍿 https://t.co/gFduZCHsYn RT @Madonna: Always fun to run into talented and beautiful friends in the studio! 💛#anitta 💛💛💛! 🇧🇷#magic https://t.co/mun4jA2Xwz Estar ao seu lado é um aprendizado para a vida inteira. Gratidão sem fim. / Being by your side is a lifelong learning. Endless gratitude. https://t.co/mk8LnRDcpr Thanks for an amazing year of listening on @Spotify #2018ArtistWrapped https://t.co/Gbe1y71AdP Today I woke up and all I wanna say is thank you. I have so many things to say about everything that have been happening in my life... it wouldn't fit in this post. So, for now, I just wanna say thanks. My heart is full of the most beautiful feeling in the world. https://t.co/H7yKNY39zs Veneno 🐍 https://t.co/uotiJDx4RE https://t.co/9yesZpHdlY Em 2018 fiz o clipe mais legal da minha carreira até o momento! https://t.co/kvbURqH4Oe #aconteceu Gente, não percam mais o tempo de vocês e escutem \"Veneno\" na playlist #HITOU da @deezerbr, é só clicar aqui: https://t.co/352bzRpCov 🐍 https://t.co/5lGwv6nvaD 🧡😘 https://t.co/py9MoZ7clb RT @billboard: .@anitta is performing for #BillboardLive! https://t.co/2ROa0HCkc2 @daniricarijo obrigada 😘 #BillboardLive 💜 https://t.co/PzNzEYQNua @TropaAnitta_ Oi @kellenb_ Só fingir costume @MeigoAndAbusado Tenha fé Deus abençoe vocês @apegocleonitta @tmrwmag Oi @fanittadiva Pq chato? @anittais Claro @greysnitta Amei @pcortazio Sim @AnittaSincerona Parabéns 😍 @tmrwmag https://t.co/4bmXMELs6K RT @CaracolRadio: En la #17 del #TopCaracol @Greeicy_rendon y @Anitta #Jacuzzi #TopCaracol\n\n&gt;&gt;&gt; https://t.co/qCSQ3G9HIu RT @TonyAguilarOfi: Hoy en #40GlobalShow167 lo último de @AlejandroSanz @pabloalboran @Anitta @KEVINROLDAN @dvicioficial @rochi_ig @Abraham… RT @ClaroMusicaCO: ¿Estás conectado a nuestra transmisión de #Megaland2018 ➡️ https://t.co/jW06QNr5aS en el canal #152MeGusta? No te despeg… RT @RadioDisneyLA: ¡Gracias @Anitta! La estrella brasileña pasó por el estudio para sumarse al festejo de un nuevo aniversario de tu radio… Já escutou Solo hoje? 💜\nhttps://t.co/9EA4boBu54 https://t.co/igDxWpLvHq Alô? Tô te ligando pra avisar que aquela maratona de \"Vai Anitta\" na @Netflix​ vai rolar! Vem que a gente vai assistir tudinho hoje 😅😍 https://t.co/4uVZHLLFYj 😍❤️ https://t.co/25wkys2zSg\n@Camila_Cabello E maratonar \"Vai Anitta\" na @NetflixBrasil 💜 https://t.co/bLw2HYnQA1 Hoje vocês estão mais perigosos ou venenosos? 👉 https://t.co/KNJyGZO8Gp RT @los40colombia: ¿Quieres ver a @Anitta respondiendo preguntas en LOS40 Colombia?\n\nAquí tenemos el video completo: https://t.co/aBgj4Y3Wf… RT @DiaaDiaCaracol: #AlAire: @anitta habla de su nueva canción #Veneno https://t.co/vVCErTSAPd RT @iHeartRadio: 👑 All hail queen @Anitta 👑 https://t.co/wuxKJ1Xzx9 Quer saber um pouco mais como foram as gravações de Medicina e Veneno? Vem ver: https://t.co/4qiCT4SJNP https://t.co/HuNgHRGNH2 ❤️ @tmrwmag https://t.co/IrpH5UWCZZ 😍 https://t.co/NUbVT3FbLE @tmrwmag ❤️ https://t.co/ktZmVZDWuv @doidocak @QGdaAnitta Eu tive essa ideia do nada. Escolhi ela pro projeto pq achei que tinha a vibe das outras. @amiga_rebeca @QGdaAnitta Eu penso no quanto eu sonhava com tudo isso antes. E dou mais importância às pessoas que me apoiam. @JuniorDaAnitta @QGdaAnitta Gosto mais de clipe. Acho monótono assistir a 10 músicas direto sem mudar a concepção @anittaii @QGdaAnitta Passa um filme na cabeça. É lindo saber que essas pessoas acreditam em mim desde o comecinho. @recitoanitta @QGdaAnitta Sim. Mas é um trabalho diário de se cuidar e lembrar de si mesmo. Para ajudar acho que a compreensão é o mais importante Dezembro maravilhoso! E sem Dorflex hahahah 😍😂 https://t.co/R29rO2iVUU @lostknowles @99kavinsky @thalinitta Não estou nem um pouco nesse momento @cwmilagreys Foi ano passado @99kavinsky @thalinitta Sim @Anittalinda15 @anittawonder @POPline Não @encantanitta Feijoada @thalinitta Dormir um pouco no avião @memoriesanitta Infelizmente não @odaatypical Nop @deborawernke 😏 @memoriesanitta Adivinha @anittawonder @POPline Muito RT @POPline: . @Anitta cantando em um festival internacional em Nova York? Está tendo, sim, e a gente te conta os detalhes! Confira: https:… RT @MTVLAargentina: ¡ATENCIÓN! Pronto se viene un MTV EN VIVO: @ANITTA, directo por la pantalla de MTV ♥♥ #SwiftiesEnMTVHits https://t.co/o… Ahora en vivo 💜 https://t.co/1rB2I8bGOr @laterceracom Hahahahha isso por que não colocamos os compromissos internacionais. Tá babado, padre, mas graças a Deus https://t.co/JoNp272DLn Billboard Latin put together a list of facts about #VaiAnitta.\nCheck them out: https://t.co/0nrK4kC1y5 😍 https://t.co/A0VUUUsJk4 MTV en Vivo - Argentina https://t.co/Rr4CjNDTFH Ahora en vivo en @40ChileOficial @Jovittu @greysnitta Não @world_anitt4 @QGdaAnitta @camilocabelo Eu estou morta @greysnitta Pizza RT @billboard: 31 surprising things we learned about @Anitta from Netflix's 'Vai Anitta' https://t.co/pU4Qh2Kn4A https://t.co/9ZAkCxBjoA Veneno 😍 https://t.co/5BzQsrtRZT Que empieze la semifinal. @lavozmexico #TeamAnitta https://t.co/KFvPE3bZkA Já tem programação pra esse domingo? Pois eu tenho, maratona de \"Vai Anitta\" na @Netflix​ 💖 https://t.co/8USJeomCiI Não Perco Meu Tempo 💋 https://t.co/3Oo1xlWVLc https://t.co/DN58z27YlQ Goals ✨ https://t.co/wHmddRU2Mq https://t.co/DcT2h6Mwri Veneno 🐍 https://t.co/uotiJDx4RE https://t.co/aPNED443Ku Massagem e entrevista, entrevista e massagem, tudo ao mesmo tempo. Não entendeu? Vem ver o que a Netflix preparou pra mim! https://t.co/Ip8IR1q1mU 💕 https://t.co/aouPVordbe 💕 https://t.co/7Y8HFElMos Love your new song @lelepons ❤️ https://t.co/VtVVtBHzOT Anitta Vs Ludmilla - Obrigada a todos que marcaram presença ontem na nossa @festacombatchy. Em especial à @Ludmilla que se jogou no nosso duelo da paz, da alegria e da diversão. Foi LINDO. AMEI! https://t.co/xsKd4y4geG Solo 🐍✨💋 https://t.co/9EA4boT5tE https://t.co/1YooLwrHnZ @TonyAguilarOfi 💕 RT @TonyAguilarOfi: Éste domingo en #40globalshow166 presentaremos en España y Latinoamérica GOALS uno de los nuevos temas de mi amiga @Ani… Vamos fazer maratona de \"Vai Anitta\" hoje no Netflix? https://t.co/ujAhWsVw3Q Amores estou concorrendo ao Melhores do Ano na categoria Cantora! Votem votem votem 💞 https://t.co/o9VbW2MysY https://t.co/kggOLSiLwr @festacombatchy hoje no espaço das Américas em SP. Vamos? https://t.co/Z7Ln7xzxlN Veneno 🐍 https://t.co/fjrAhn1nGd https://t.co/Fz5YMjHx6O RT @40GlobalShow: Semana, cómo no, de estrenos. Hoy @TonyAguilarOfi hace sonar el nuevo single de @Anitta \"Veneno\" 🐍 además de preciosa y s… Solo 🐍✨💋 https://t.co/9EA4boT5tE https://t.co/7urNGOuLpX 💋 https://t.co/fjrAhn1nGd https://t.co/R9dIvXoo5l RT @lelepons: Everyone should watch Vai Anitta on Netflix!!!! Todo mundo ansioso aí? Dia 19 de novembro tem Festa Combatchy! Ingressos aqui: https://t.co/g3YI0Dx2tO https://t.co/XJAmsBuDva Shine, the rest of the stars are watching\nhttps://t.co/fjrAhniZ4N https://t.co/6t7Yi7BCG2 @MeigoAndAbusado Hahaha vigésima entrevista eu tava ruimzinha da cabeça já cheia de fome hahahaha @camilocabelo @Eduardo_Jr_ Chegou bem quando eu já não precisava mais hahahha @Eduardo_Jr_ Poxa infelizmente começamos a gravar depois. Mas seria incrível mesmo. @renaan_1994 É um laser doido aí que minha médica diz que dá energia. @Emais_Estadao Gastariamos um episódio inteiro só nessa bad vibe. Então só preferi citar que fui descoberta pela empresa...achei mais leve. Mas já que tocaram no assunto... explicado. Beijos @Emais_Estadao me cobrou pela produção de \"Fica só olhando\" que demorou pra sair porque eu estava juntando dinheiro pra pagar. Então, foi só por isso mesmo que não deu tempo de se aprofundar na história. Imagina explicar tudo isso com detalhes na série? @Emais_Estadao projeto fora da Furacão. Eu amaria ter chamado mas não tinha dinheiro para pagá-lo. E não ele não faria de graça apostando no projeto como meu atual produtor fez porque quando eu fui colocada na geladeira por ficar do lado dele ele, dentro do seu direito de profissional, @Emais_Estadao E logo depois podem encontrar outras notícias de quando eu saí da Furacão e ele se juntou de volta à empresa alegando que me processaria por cantar as músicas feitas anteriormente por ele junto com a empresa. Tudo isso por que ele não foi chamado para fazer parte do @Emais_Estadao precisaríamos de muito tempo pra explicar tanta coisa. Mas vocês podem encontrar no Google em alguns sites do mundo funk notícias da época onde ele saiu da Furacão e eu fui \"colocada na geladeira\" por ficar ao lado dele em nome da gratidão @Emais_Estadao A Furacão 2000, empresa para a qual o mesmo trabalhava na função de descobrir novos talentos, foi citada e mostrada várias vezes na série. Infelizmente, numa única temporada não dá pra se aprofundar demais em muitas histórias. Se fosse para se aprofundar especificamente nele RT @raullsantiago: Hoje assisti #VaiAnitta na @NetflixBrasil. Está incrível demais esse trabalho sobre a vida da @Anitta. Amooooooo https://t.co/ThguCnV5IE RT @New1027: Billboard breaks down @Anitta's #Veneno song and music video: \"The \"Veneno\" video has powerful scenes, with #Anitta among snak… @VinyGimenez HAHAHAHHAHAHAHHAHAHHAHAHAAHAHHAHAH RT @shots: Our first @netflix show #VaiAnitta is here! 💜 https://t.co/BP4d62wcdz https://t.co/EncQOFjJeZ RT @NetflixBrasil: ATENÇÃO! ATENCIÓN! ATTENTION! #VaiAnitta já está disponível na Netflix e eu tô aqui só no quadradinho. https://t.co/ucM7… It's out. My doc series on @Netflix - Vai Anitta https://t.co/2iYW4T9RZR Minha série no Netflix está no ar. Corre pra assistir. Thanks ❤ @youtubemusic https://t.co/sWFsmdQeWS Me sigam lá no @youtubemusic https://t.co/P0lkxusNyT https://t.co/N7gp9TCkhQ Hello Vegas 🙋🏻‍♀️ @youtubemusic https://t.co/bPbPRANBNT Veneno's lyric at @Genius ❤🐍\nhttps://t.co/OvU3Cp4GSW Shine, the rest of the stars are watching https://t.co/qJcfJFXwOM ❤️ @youtubemusic #youtubemusic https://t.co/x6tDiZ5nP5 Genteee, \"Solo\" já tá disponível na @deezerbr e vocês podem ouvir \"Veneno\" e várias novidades na playlist \"Lançamentos da Semana\". Vem comigo: https://t.co/xPs4zuBQKP 🐍 https://t.co/5oAPy3olPl Muito feliz que estou na capa da playlist Top Brasil do @Spotify​!\nAcessem: https://t.co/h2LNlSZD89 https://t.co/u0ZHpECt3k Tá chegando! Vem bater cabelo comigo na @festacombatchy! 😘\nIngressos: https://t.co/g3YI0DODSo https://t.co/CmMR64nQre RT @LaVozMexico: . @Anitta y @PrinceRoyce pusieron a bailar a los asistentes de #LaVozMéxico y en entrevista nos revelaron que quieren hace… RT @billboardlatin: .@Anitta's Epic Tri-Lingual EP 'Solo' Represents Her Career Evolution: Watch https://t.co/JgRaguJo3X https://t.co/WdNO3… RT @Spotify: We 💚 a trilingual recording artist. Stream @Anitta's latest EP, Solo, on Spotify now 🇧🇷\nhttps://t.co/IkAMXrlv2f https://t.co/1… RT @40GlobalShow: ¡Que dos grandes artistas! si por separado nos han conquistado... juntas es un no parar. Ahora en #40GlobalShow164 con @T… Solo 💜 https://t.co/t4Zn7GQt05 https://t.co/JYX4w9qDkI 💜 @AppleMusicES https://t.co/OBOuoybUNx #DalePlay https://t.co/K8am3tQvwd RT @billboardlatin: .@Anitta's Epic Tri-Lingual EP 'Solo' Represents Her Career Evolution: Watch https://t.co/lBVzSOVE0k https://t.co/Fqw0O… RT @billboard: .@Anitta's epic tri-lingual EP 'Solo' represents her career evolution https://t.co/t5kXhSZ6Jy https://t.co/R0Us0de88a 😍 https://t.co/xThNrvvecs RT @idolator: Trilingual legends only. @Anitta sings in Portuguese, Spanish and English on her sizzling 'Solo' EP: https://t.co/aHi0USBEWC… RT @zionylennoxpr: Isto é um registro de sucesso 🔥🔥🔥🔥🔥🔥🔥 @anitta 💪🏾 https://t.co/5J1t93JypM RT @CuentameloYaOf: La coach de #LaVozMéxico @Anitta, estrena su nuevo sencillo titulado 'Veneno'. https://t.co/YrQtC7TqTj RT @TvsEspectaculos: La cantante brasileña @Anitta, estrena nuevo video para su sencillo titulado 'Veneno', contándonos el reto que fue gra… RT @jesseavenue: Yes sista! 🔥❤️\n#Repost @anitta with get_repost\n・・・\nAssista agora no meu canal do YouTube - Não Perco Meu Tempo https://t.c… 💜 https://t.co/xThNrvvecs RT @shots: #AnittaSolo is out now 💜 https://t.co/e2OB1zuwih https://t.co/wL2Wk6KDXh Thank you @spotify for the Times Square billboard and for supporting “Solo”. Check out the link in my bio to listen to Solo on Spotify. https://t.co/iqr8vuyM9f RT @POPline: Qual tiro da @anitta mais te impactou?\nhttps://t.co/MEZbz8nEIM RT @TonyAguilarOfi: Hoy @Anitta 😍 es la protagonista de mi blog con su nuevo trabajo.\nhttps://t.co/52wgXaAcjm @TonyAguilarOfi 😍 gracias amorrrr Assista agora no meu canal do YouTube - Não Perco Meu Tempo\nhttps://t.co/TU9dxHXWS8 https://t.co/gQVWHDwc8c Assista agora no meu canal do YouTube - Goals\nhttps://t.co/Zgu5P6EkOC https://t.co/ltrdyICgqi Assista agora no meu canal do YouTube - Veneno\nhttps://t.co/kvbURqH4Oe https://t.co/2F1tTYPp7n RT @programa_hoy: Descubre el secreto que reveló @maluma de @Anitta ¡Te sorprenderá! Recuerda que este domingo tenemos una cita en #LaVozMé… RT @lastfm: .@Anitta releases #AnittaSolo and goes straight to No.1 on our LIVE global chart. ✌️🙌 https://t.co/fleW6nHzUH #AnittaSolo  \n💜 ouça agora | oiga ahora | listen now\nhttps://t.co/9EA4boT5tE https://t.co/anSeUStcPf 💜 #AnittaSolo https://t.co/kuZEkO1Aek @TonyAguilarOfi @Greeicy_rendon 😍 RT @TonyAguilarOfi: Éste domingo en #40GlobalShow164 estrenaremos en 12 países JACUZZI el nuevo single de la maravillosa @Greeicy_rendon y… Ainda dá tempo! A cada 200 reais em compras em produtos athletics e training da @adidasbrasil, você pode concorrer a um treino comigo. Corre lá no https://t.co/WF4maFchzR e participe! @adidas https://t.co/vrr0evq98i Veneno - Um realização da @cea_brasil. Corre lá no insta deles pra assistir aos vídeos de making of. https://t.co/SXAYuSAZPF Veneno - amanhã ! Corre nas redes da @cea_brasil pra assistir bastidores. https://t.co/qfR5ftrXBM É amanhã! Pra assistir o making of de Veneno corre no perfil da @cea_brasil que tem 3 vídeos de bastidores pra vocês. https://t.co/67b8TGE2Kj E na hora que eu cansar, não perco meu tempo pra te escutar. https://t.co/aG5scvil4t RT @elnorte_gente: Descubre qué miedos enfrentó la cantante brasileña @Anitta para la creación de su nueva canción #Veneno https://t.co/BfX… RT @billboardlatin: VOTE! Who Should Win the #LatinGrammy for Best Urban Song? @Anitta @JBalvin @Daddy_Yankee @KarolGMusic @PrinceRoyce @Ni… RT @warnermusiclat: 3 songs. 3 languages. 3 music videos. @Anitta are you ready? https://t.co/ZlipbHmwkq It's temporary, that's just how it goes. What I hated, now I love the most https://t.co/yQtZXfRhfV O clipe e a letra se entrelaçam nesse universo único e cheio de sensibilidade que a música traz. Se deixem seduzir por \"Goals\" Me apaixonei desde o primeiro acorde e aí começou toda a ideia do EP. Por acreditar que tem uma linguagem sensual e sofisticada, logo pude ver \"Veneno\" e \"Goals\", uma ao lado da outra, em seus devidos idiomas, mostrando uma nova face minha. Vamos falar de \"Solo\"? Sexta-feira tem lançamento de 3 novas músicas com clipes. E começo hoje a contar um pouco de cada uma delas pra vocês. Bem-vindo ao universo de \"Goals\". Essa música foi uma jóia rara me presenteada por @pharrell quando nos conhecemos em Las Vegas. https://t.co/Au5F6nQjXp Shine the rest of the stars are watching https://t.co/fzwmh7f642 What's next? My EP will be available on November 9th. 3 different songs and videos in 3 different languages. Are you ready for \"Solo\"? https://t.co/NQ7XEe0Xmu Português, inglês, espanhol. Solo https://t.co/AGOQVaqmeW Nesta sexta feira dia 9 de Novembro um novo EP disponível. 3 músicas, 3 idiomas, 3 clipes, 3 Anittas em \"Solo\" https://t.co/w6x03SQdmp Solo - 9 de novembro| 9 de Noviembre| November 9th 💜 https://t.co/eU3RI6b9NY RT @MTV: .@LittleMix, @Anitta, @JasonDerulo, and more of your faves share what the hardest part of getting ready for the 2018 #MTVEMA was ✨… @anittawonder Ainda bem que não só plásticas @allforjao Apresentar uma categoria RT @Pressparty: .@Anitta set to co-present today’s #MTVEMAs https://t.co/yozGsCuyip https://t.co/C2F0wL3RyP Alias estou fingindo normalidade e costume com o fato de Lindsay Lohan estar fazendo o cabelo do meu lado e eu cresci vendo a querida na TV sem nunca imaginar que habitaria o mesmo ambiente Tocando bum bum Tan tan no backstage do premio e eu to como Solo - November 9th https://t.co/bMZ2jUQU2k Solo - 9 de Noviembre https://t.co/ib3mxiIoqA Solo - 9 de Novembro https://t.co/kvdiMDTW8R Acordei na Espanha. Outro fuso. Já tô completamente perdida. LA, México, Miami, Espanha.... RT @ivamcabral: A única música brasileira q eu ouvi aqui em Tokyo foi Medicina, da @Anitta, no Arty Farty, em Shinjuku. RT @HugoGloss: Se uma já causa, imagine 3! @Anitta surgiu assim em dose tripla para lembrar que na próxima sexta, ela estreia o EP “Solo”!… Tô me divertindo tanto vendo vocês tentando desvendar o projeto \"Solo\" Shine, the rest of the stars are watching... https://t.co/dIubGCVLsn Controlando tu cuerpo tu me das lo que quiero, soy tu veneno. https://t.co/oaI0lxhNkr E na hora que eu cansar... https://t.co/jh7Mmi2iC8 @anittaxcaro Parabéns atrasado Boa sorte e muita calma a todos os meus fãs que farão o ENEM amanha. \nAmo vocês Solo - November 9th https://t.co/8frSH4mwx6 Solo - 9 de Noviembre https://t.co/dfGUCHAW1p Solo - 9 de Novembro https://t.co/rOqY7qFcXm RT @warnermusiclat: Who's ready? 🐍 https://t.co/TC2153SQwJ RT @ParaguayTVHD: Vai Anitta, la serie de @Anitta ya tiene fecha de estreno!\n#TDS  @Nadia_Servian https://t.co/upY2y3gO2R Solo - November 9th https://t.co/3SXo2O5LIR Solo - 9 de Noviembre https://t.co/pKhy4uH5Pt Solo - 9 de Novembro https://t.co/WYs9QRr6MP Quero dizer ao meu Brasil, que não há um degrau que eu suba aqui fora que não tenha a participação de vocês. Eu trabalho muito, mas sem vocês nada disso seria possível. Dividam comigo o mérito dessas conquistas. Solo - November 9th https://t.co/IvRWnBPtpX Solo - 9 de Noviembre https://t.co/faQX54JOUP Solo - 9 de Novembro https://t.co/c77Z6y1WWR E essa ansiedade gente? Prepara o coração que no dia 16 de novembro, vocês vão conhecer um pouco mais do meu dia a dia 😍 #VaiAnitta https://t.co/k3AaDKCnnM RT @warnermusicmex: El talento y carisma de @Anitta la hicieron acreedora a un premio @GQMexico, en la categoría #CantanteInternacional ¡Mu… Pessoal! Faltam só 10 dias pra acabar a minha campanha com a @DadivarOficial! São muitas crianças do Solar precisando da nossa ajuda! Não esqueçam que quem participar tem a chance de estar na gravação do meu novo clipe! Quem vem comigo? https://t.co/EAtT4VVDWF #dadivou https://t.co/mfnzoaYmc1 RT @NattiNatasha: Así nos sentimos en el Studio #GoodVibes @Anitta 💃💃 https://t.co/r3i4tzNgOf RT @NattiNatasha: #MujeresAlPoder @Anitta 👸🏻👸🏻🎼 https://t.co/KnFqCRjUaD RT @kienyke: #VIDEO | @Greeicy_rendon se anota un nuevo éxito junto a @Anitta https://t.co/u4zETONOoE https://t.co/E9DnUO2LRG RT @djkhaled: Second meeting for today wit @anitta and team 🇧🇷 Brazil 🇧🇷 we up to something!!!! #WeTheBest https://t.co/sVGqNVUgiq RT @idolator: .@Anitta &amp; @Greeicy_rendon joined forces on their slinky \"Jacuzzi,\" and they heat things up in the steamy video: https://t.co… RT @billboardlatin: We caught up with @Anitta at the #LatinAMAs about her performance of \"Medicina,\" performing with @Camila_Cabello in Bra… RT @iambeckyg: My girl!!! @Anitta 💜💜💜 https://t.co/BO4bve7dt3 RT @HOLATV: ¿Quieres saber qué nos revelaron @TiniStoessel, @iambeckyg y @Anitta en los #LatinAMAs? ¡No te lo pierdas en #LaHoraHOLA, y rep… RT @radiojovempan: .@Anitta, Jacuzzi, prêmio e Alesso. #Sextou! | @pcarvalhojp\n\nhttps://t.co/C1BJA7lFQV https://t.co/H4E7JWFt9I RT @BuenaMusicaWeb: No te pierdas el #vídeo #estreno \"Jacuzzi\" de @Greeicy_rendon  Ft. @Anitta 🔥🎧  https://t.co/VhmGoS0bnN RT @LaVozMexico: ¿#TeamAnitta¿Qué es lo que más les gusta de nuestra bella coach? Participa con nosotros utilizando el HT #CuandoConectoCon… RT @CentralAnittaBR: Confira a performance de Anitta com \"Medicina\" no #LatinAMAs. https://t.co/GO8bVDMJsJ Tudo graças ao voto e dedicação de vocês. Muito obrigada Vem bater cabelo comigo na @festacombatchy! 😘\nIngressos: https://t.co/g3YI0DODSo https://t.co/ts3xizBy5Z ❤️ https://t.co/u5KWJVyc88 https://t.co/Jm9XGzLAC6 ❤️ https://t.co/ABML2s3piE Quien está acompañando La Voz México? 😍 Votem votem votem\nhttps://t.co/QQHl4AWVH4 ❤️❤️ https://t.co/EQ6izhVs9S Happy to be a part of this! Thank you  @MAJORLAZER https://t.co/tZWOxzalvt https://t.co/S1HTngmJ3u Olha que linda nossa campanha com a @dadivaroficial 😍 Além de fazer o bem, você ainda concorre a participar de um clipe meu 💛 https://t.co/EAtT4VVDWF https://t.co/4vVaPx8dWe Hahahahah I'm sorry I'm gonna do couple more in English https://t.co/9cFPFKjAZf Amores, como vocês sabem, eu estou concorrendo ao MTV EMA​ como Melhor Artista BR! As votações já estão abertas e o link é esse aqui: https://t.co/QQHl4AWVH4 ❤️❤️ https://t.co/IYglJZ5hOB RT @billboardlatin: Friendship Goals! Watch @Camila_Cabello and @Anitta in Brazil 👯 🇧🇷 https://t.co/jTzVz7NESh https://t.co/EPsGJ6kYZc RT @opovoonline: @Anitta fará show em Fortaleza neste sábado: https://t.co/RQDkpxEPN5 https://t.co/BcyI5blRP5 RT @billboardlatin: .@Anitta, @LelePons &amp; More to Perform at 2018 Latin American Music Awards #LatinAMAs https://t.co/tUz6Z0gPSD https://t.… RT @eltlacuache40: #AhoraSuena MEDICINA de @Anitta en @eltlacuache40 por @los40mx 😎 https://t.co/xWU8Ga5Mnv RT @LaVozMexico: ¿Qué coach le suplicó mejor a #AdrianaYCristian? @Anitta dio vueltas, @nataliajimenez y @MALUMA se fueron de rodillas...… Dia 05 de outubro tem @pink, @bep e eu no Palco Mundo do @rockinrio ❤️ Vai ser incrível!! https://t.co/NXHeqfBaOr RT @billboardlatin: Keep voting!!! Who's Your Latin Urban Queen: @IAmBeckyG, @NattiNatasha, @Anitta or @KarolGmusic? https://t.co/Nf4OOllxl… @kellenb_ Sim @thevinenoso Eita, bom dia @_G__U__I_ Sim e você? @imfentyceiro Oi, faltou um t aí É só clicar no meu nome, vamos votar\nhttps://t.co/lvpOB8k5aT RT @billboard: Watch @Camila_Cabello bring out @Anitta during her concert in Brazil https://t.co/MNsm1amt9U https://t.co/Uy1j2nlayB RT @papelpop: Mais fotos da @Camila_Cabello com a @Anitta no Z Festival! https://t.co/IfAFhu4HJr RT @federicodevito: ACONTECEU!\n\n@Camila_Cabello e @Anitta no palco do #ZFestival pra loucura dos fãs!!! 💃🏻 https://t.co/S3irC43eNm RT @LaVozMexico: La mejor medicina para @Anitta es que la veas este domingo en #LaVozMexico, 8:30 p¡m por Las Estrellas ¿Dónde está el #Tea… RT @billboardlatin: VOTE for your Latin Urban Queen: @IAmBeckyG, @NattiNatasha, @Anitta or @KarolGMusic https://t.co/cHjhUxyDzk ❤️ @billboard https://t.co/uz6hRZKrR7 Ahhhh 😍 https://t.co/lpqpYp1Xbz Galera, olha que demais! \nO Clube da Anittinha também chegou na @jequiti 💗\nSão três produtos deliciosos e divertidos! Tem colônia, shampoo e condicionador para você curtir muito! Fale com uma Consultora Jequiti ou Compre pela Loja OnLine: https://t.co/oQaJCRQYnS https://t.co/8GbktNWnLD Muito feliz em me apresentar no @latinamas, dia 25 de outubro com transmissão @telemundo ❤ https://t.co/4n7TR1XXdX RT @LatinAMAs: ¡La espera ha terminado! @anitta está confirmada para presentarse en #LatinAMAs  este próximo Jueves 25 de Octubre 7/6C por… RT @billboard: .@Anitta, @lelepons &amp; more to perform at 2018 #LatinAMAs https://t.co/u4Ba6mtKVX https://t.co/h7oJ004uQz Vocês não sabem o que eu acabei de fazer! Pela primeira vez na história um de vocês terá a chance de participar do meu novo clipe! Quer saber como? Uma dica #dadivou https://t.co/hGBUvYysU0 RT @RedeGlobo: Fica tudo bem quando o nosso #Encontro começa com a @Anitta ❤️😍 https://t.co/iKVoG4tHKm RT @EncontroFatima: Vem pro #Encontro com @Anitta ❤️🎶 https://t.co/0jgXV3C9y3 Já liga a TV aí que eu tô no @EncontroFatima 📺❤️ https://t.co/HR7CHkky3T @Lo_orenaD @AnittaSincerona Sim @AnittinhaRep @CentralAnittaFm Jurou, levei bronca aqui hahah @CentralAnittaFm Pode os dois @CentralAnittaFm Sim 😍 https://t.co/7se1RRbELH @AnittaSincerona Tô gravando @smilesdanitta_ Amor 2 artistas ainda não mandaram voz. Tem 2 músicas pendentes @Kelly_h18 Jurou . Quem dera @Bael_kun Onde gente @_gabrielnobre Simm @greenkissing Com sono hahahaha Vou responder quem estiver usando a tag do Voto por Anitta en #VideoFavorito en los #LatinAMAs 2018 Outubro ❤️ https://t.co/NCM11uzDB0 Passando pra agradecer todo mundo que está votando em mim no @LatinAMAs \nAmo vocês ❤️\nVoto por Anitta en #VideoFavorito en los #LatinAMAs 2018 https://t.co/zy5SDByAfV RT @GlamourMex: ¡Gracias @Anitta! La cantante y actriz brasileña se suma a la celebración de nuestro 20 aniversario ❤ #Glamour20 https://t.… Votem em Medicina para o @LatinAmas! É super simples, basta tweetar \"Voto por Anitta en #VideoFavorito en los #LatinAMAs 2018\". 😘😘 https://t.co/x8Aa2A1YbT Também estou concorrendo ao @mtvema como Melhor Artista Brasileiro! As votações já estão abertas e o link é esse aqui: https://t.co/QQHl4AWVH4 ❤️❤️ https://t.co/HHJQRZdHiS 😍 https://t.co/GB7Ooc8bKf Tem episódio novo do Clube da @Anittinha no ar 😍😍 https://t.co/9K0nSgYkEW Venham se divertir comigo bbs 😘 Ingressos: https://t.co/g3YI0DODSo https://t.co/dGBoIOY87M Amoreeees, estou concorrendo ao @LatinAMAs com Best Video de Medicina! Para votar basta apenas tweetar \"Voto por Anitta en #VideoFavorito en los #LatinAMAs 2018\". Por isso votem votem votem ❤️ https://t.co/zTfkU44YnH Outubro maravilhoso 😍 https://t.co/6HQwzVpJYc RT @Anittinha: Hoje nós vamos falar sobre profissões. https://t.co/vfb5tdb6ss RT @Anittinha: Nosso Clube tá muito fofo 😊 você pode assistir quantas vezes quiser lá no nosso canal no YouTube https://t.co/e8Lkic73kJ htt… Amando La Voz Méxicoooooo. Te amo Méxicooooo @Weinbach Que? Hahahha RT @tvtelehit: Este sábado tienes una cita para disfrutar de la música de  @Anitta en #EspecialesTelehit. https://t.co/0ofl8jMx4q RT @tvtelehit: Disfruta de la música de @Anitta y la entrevista con @Ceci_Flores en #EspecialesTelehit https://t.co/fRreLDjZcj RT @LaVozMexico: . @Anitta entiende muy bien a #MorgannaLove y quiere ayudarla. Por eso ella la ha elegido como su coach en #LaVozMexico #T… RT @LaVozMexico: #NorahMontero ha tomado una decisión con el corazón y eligió a @Anitta como su coach en #LaVozMexico https://t.co/opwhZ2aG… RT @_CarlosRivera: Amo a estos tres. Pura risa todo el tiempo. @nataliajimenezoficial @anitta @maluma #LaVozMéxico #TeamCarlos https://t.co… Todooooossss https://t.co/2H7BT0EIZF #TeamAnitta RT @LaVozMexico: Vamos apoyar al #TeamAnitta en #LaVozMexico , digan presente los fans de esta bella cantante 🙋🏽‍♀️🙋🏻‍♀️🙋🏻‍♂️🙋🏽‍♂️@Anitta h… Outubro, seu lindo ❤️ https://t.co/f53Ak4fnR8 @pcortazio Vai me ver @vaimalandroo Gracias! @Lucia18124103 😍 @anittxz Sim Gratidão ❤️ https://t.co/pLVIxFW2O7 RT @multishow: Já é tradição por aqui: um medley DAQUEEEELES da @anitta! São quase oito minutos de vários ritmos diferentes, com direito a… Obrigada meus fãs por me darem esse prêmio música chiclete com vai malandra, amo vocês #MelhorClipeTVZVaiMalandra https://t.co/e3IvZ4OHns Vocês conseguiraaaaam!\nQue história, exército pesado demais\n#MelhorClipeTVZVaiMalandra Estamos quase batendo a meta pessoal, vamooooos #MelhorClipeTVZVaiMalandra Pronta! #MelhorClipeTVZVaiMalandra https://t.co/g4QYUjWFrL @Malandraanitta1 São mesmo #MelhorClipeTVZVaiMalandra Daqui a pouco vai começar #MelhorClipeTVZVaiMalandra VINTE E CINCO MIL... \nNOSSO EXÉRCITO É PESADO\nVamooooos! \n#MelhorClipeTVZVaiMalandra⁠ ⁠ https://t.co/pm7AVqcRsX Vamos fazer história neste Twitter?\nQuem topa uma meta de vinte e cinto mil? #MelhorClipeTVZVaiMalandra⁠ ⁠ Uhuuuuulll, vocês são os melhores!\n#MelhorClipeTVZVaiMalandra DEZ MIL .... É com vocês \n#MelhorClipeTVZVaiMalandra https://t.co/DwWcaloiF1 Então vamos! #MelhorClipeTVZVaiMalandra Vocês querem uma meta aqui? \n#MelhorClipeTVZVaiMalandra @berinho_Anitter E cadê a tag? #MelhorClipeTVZVaiMalandra Vocês já se prepararam pra ver ela apresentar o programa inteirooo? \n#MelhorClipeTVZVaiMalandra @anittabrasilcom Então vai realizar agora #MelhorClipeTVZVaiMalandra Como está o coração de vocês? \n#MelhorClipeTVZVaiMalandra Qual será ou quais serão meus looks? #MelhorClipeTVZVaiMalandra https://t.co/80uBIiwKUK Chegamoooos aqui galera #MelhorClipeTVZVaiMalandra Meus amores participem das metas do @QGdaAnitta #MelhorClipeTVZVaiMalandra RT @WarnerMusicBR: Taca taca taca taaaaca tweet com a hashtag #MelhorClipeTVZVaiMalandra e vem torcer pela @Anitta 💖🔥🎬 https://t.co/qXIxHkR… @jessicatayane18 Obrigada meu amor #MelhorClipeTVZVaiMalandra @vtrr_am Também amo #MelhorClipeTVZVaiMalandra Me arrumando e de olho em vocês usando a tag #MelhorClipeTVZVaiMalandra https://t.co/qf8Bf5Vcgy @amandafreitasbj @Tatawerneck Daqui a pouco #MelhorClipeTVZVaiMalandra #MelhorClipeTVZVaiMalandra RT @multishow: Quem você quer que leve o prêmio de melhor clipe TVZ? Pra votar, use a hashtag do seu clipe favorito! o/ #PrêmioMultishow… RT @GeorgeIsraell: Essa terça estarei no prêmio multishow fazendo uma participação na apresentação da @Anitta ! felizão com o convite dela.… RT @Pressparty: .@Anitta receives a 2018 Latin Grammy Award nomination - here’s all you need to know: https://t.co/8qnjigZBGm https://t.co/… Fui desafiada pela @danielamercury a apoiar a #EleNao . Eu sou a favor da democracia e também não apoio a corrupção e o oportunismo. Agora desafio @ivetesangalo @ClaudiaLeitte e @PretaGil https://t.co/ypwwm7pdnY ¡México Lindo! “Medicina” ya está en #ÉxitosMéxico de @SpotifyMexico, entren ahora y denle play https://t.co/ut3Me7XY9k @AnittaExterior Sim, lindo né @AnittaRealFC @euanittaaa_ Muitooo @anittadelicated @demsnitta Oi @euanittaaa_ Feliz aniversário @demsnitta Isso vocês já sabem @euguedess @AlwayAnitta Boa noite Amo vocês ❤️ https://t.co/LnwsmqaUze @anittasensual ❤️ @AlwayAnitta Obrigada 😍 Da-da-dámelo otra vez… É “Medicina” em destaque na playlist ¿Hablas Portuñol? da @DeezerBR. Dá o play e baila muito: https://t.co/PZbwyufIYY https://t.co/Cj0J03RNjc Obrigada meus amores, amo vcs ❤️ #AnittaGrammyLatino https://t.co/xnQKP6X9P0 @bchartsnet Nao recebi um centavo por isso nesta época. Hoje, gerindo minha própria carreira e sabendo da minha responsabilidade social, sempre escolho não apoiar nenhum candidato, e não foi por falta de propostas. Eu não consigo acreditar. Nem tô conseguindo pensar numa legenda tamanha é a minha emoção. Pela primeira vez na minha carreira fui indicada ao Grammy. Eu cheguei onde sempre sonhei, meu Deus. https://t.co/C5GduSXXIe @trulymoonlight @carsperi Não? Precisa uma lista das pessoas que eu já me relacionei e relatos das mesmas pra saber que tipo de gente constam nela? O que eu acho que eu possa fazer para apoiar as comunidades que eu defendo e/ou faço parte, que realmente acredite tenha capacidade de mudar em algo eu faço É totalmente incoerente dizer que eu apoio a morte à comunidade LGBTQ+ quando eu faço parte dela. Estaria apoiando minha própria morte. Não quero ser obrigada a odiar ninguém por isso. Não quero ser obrigada a fazer campanha política quando não foi esse o trabalho que escolhi. Eu não segui um perfil em apoio à nenhum candidato. Segui um perfil de uma amiga de 8 anos que finalmente consegui reencontrar e se ela escolheu expor seu voto é um problema dela. É um direito meu não querer opinar sobre política e eu só estou exercendo esse direito. O que mais amo fazer ❤️ https://t.co/a7sz95xRY1 💛 @Spotify https://t.co/ZriE9FpYXg RT @iHeartRadio: How can I join this roller squad, @Anitta? ✨💖💥 https://t.co/1JLmA6IStz Tem vídeo exclusivo no @Spotify pra vocês 💛 https://t.co/hRtFL7O6cu https://t.co/kQ4CuswdNs @maisasilva 😘 RT @womenshealthmx: Esto es lo que nos dijo @Anitta sobre su estilo de vida y trayectoria, en nuestra revista de agosto\nhttps://t.co/g4puIM… RT @WarnerMusicBR: .@Anitta tá na capa da playlist ¡Viva Latino! 💖🙌🔥\n\nE tem um mini-documentário exclusivo da diva com seus amigos de Honór… @Spotify 💛 https://t.co/hRtFL7O6cu https://t.co/Z2YAqdQvEe @DecodeRobsten Hahahah sim.... A intenção é reviver a época em que comecei a cantar... na furacão 2000. Tudo tem clima de flashback dessa minha fase inclusive a música E aí... gostaram de \"Perdendo a mão\" ? 😍😍 https://t.co/OKhnrCsVD9 Vem patinar comigo! 👉 https://t.co/tVQsamtI1O https://t.co/DQuJMpclcF Genteee, a @DeezerBR acabou de liberar a primeira dica de onde tá o Orelhão. Corre pra lá!!! Amores, o Orellhão da @DeezerBR vai tá lá nesse local misterioso das 17h às 20h. Não percam tempo, hein?! Corram pro twitter da @DeezerBR porque eles vão soltar algumas dicas de onde está o Orelhão. Quero todo mundo escutando “Perdendo A Mão”, hein? Gente! A @DeezerBR colocou um Orelhão na cidade de SP e quem encontrá-lo vai poder escutar “Perdendo A Mão” HOJE!! Bora procurar, minha gente?! @igordutr @metanfetalola beijos a todos @metanfetalola Oi @Nathalia_NathR Feliz aniversário Amo vocês... juro ❤️ Watch my message on the TGIF playlist on @Spotify 😘😘😘 https://t.co/534LaLzTG7 my friends @Alesso and @lelepons are on there too ❤️ Onde nos encontraremos essa semana? https://t.co/BDWTGoc8QH I loveeeeeee you and this song sooooo much @Alesso!! 😘😘😘 https://t.co/VUHBaaSy47 https://t.co/RpKbkkIeOq RT @MuuMuse: This has been a long time coming, and I’m so excited to finally share this story: I spoke to @Anitta for @papermagazine.  \n\nht… Thank you @papermagazine 😍 https://t.co/YgAWkc28E3 RT @shots: The Business of Being @Anitta https://t.co/OmcUqdb5mI via @papermagazine RT @papermagazine: \"I don't really care about the way people do things. I just want to do it my way.\" @Anitta https://t.co/CtXqzLdPof Amores, votações abertas para Meus Prêmios Nick 2018 do @NickelodeonBR. Votem ❤️  \nhttps://t.co/wt3wy13WTQ https://t.co/Hxw4lwepPX Thank you @RollingStone ❤️ https://t.co/ARuI0ZRm3l RT @AnittaSincerona: Boa noite gente, vamos focar na votação do prêmio multishow que é a premiação mais importante neste momento @Anitta @Q… Gracias @PublimetroMX 💛 https://t.co/09mRCR2bEQ RT @HugoGloss: EU TÔ NO CHÃO! A poderosa @anitta acaba de anunciar que a próxima edição da Festa Combatchy acontece no dia 19 de novembro,… RT @caldeiraodohuck: Se prepara, presta atenção! Tem @Anitta no #Caldeirão! https://t.co/N5MQPeCfWF Amores, minha central de fãs  @QGdaAnitta está fazendo mutirões todos os dias para o Prêmio Multishow, votem com eles 😘💗 Obrigada @publimetromx pelo convite, adorei ter participado como editora convidada. Foram mais de 1 MILHÃO e MEIO de exemplares circulando hoje por EUA, Chile, Brasil e vários outros. 😘 https://t.co/tuB92ci4EO RT @PublimetroMX: Música osada y con sello brasileño 🇧🇷🇧🇷 @Anitta #EditoraInvitada\nhttps://t.co/BsES8jjGGJ https://t.co/tGOIkSEgSH RT @PublimetroMX: Editores invitados, una tradición en Publimetro y ahora tocó el turno a la reina del pop brasileño @Anitta ✨✨¡No te pierd… RT @PublimetroMX: @Anitta deja la música por un día para convertirse en editora de @PublimetroMX atentos https://t.co/x6SOitC8Bj Muito amor 💛💛💛 https://t.co/FkSX4mP9Ek https://t.co/b7en7vJl97 RT @POPline: \"Medicina\" da @Anitta cresce 35% no Spotify e entra nas paradas de streams em mais sete países. Confira os dados: https://t.co… Aquí lo que importa es que tú te sepas mover 💛 https://t.co/r0C4l90B2L https://t.co/aRVpDnYtUu Pra vocês 😍 https://t.co/7BO1XmX5UL RT @faznet: .@Anitta ist Brasiliens größter Popstar. Mit @KlaubertD hat sie über ihre Anfänge in den Favelas von Rio de Janeiro, ihre zwei… RT @GangueAnitta: Na noite de Abertura do principal rodeio da América Latina “Festa do Peão de Barretos”, Anitta como atração principal da… RT @encantanitta: eu: ai gente, eu nem surto mais no show da anitta, já tô até acostumada com o repertório\n\nanitta: a\n\neu: https://t.co/ukT… RT @RenaultBrasil: Ontem foi dia do Twizy, nosso compacto 100% elétrico, chegar na casa da @Anitta. Atualmente, ele é comercializado em par… RT @billboardlatin: Young @Anitta at the Beach, @NickyJamPR Taking it Back to 2001 and More #TBT Photos You Need to See Today https://t.co/… 😍 https://t.co/lTrM1en8aC @anittaftsophia @debochedaanitta @Ludmilla Independente do que ela possa ter feito ou não. Eu não concordo com esse tipo de coisa. Seja com quem for @Hudsoncr4Hudson @RenaultBrasil Já estamos trabalhando nisso. Aguarde RT @Ludmilla: @debochedaanitta Quantas mulheres negras você já viu no #1 Spotify no BRASIL?? Você não sabe da minha luta mina, me respeita. @motdraw1 Heyyy please letsssss @debochedaanitta @Ludmilla Agradeço que seja meu fã mas para isso não precisa desmerecer o trabalho de ninguém. Cada um tem sua história, suas dificuldades e suas conquistas pessoais. Não vamos comparar os artistas assim com maldade. @debochedaanitta @Ludmilla Ser primeiro lugar no nosso país é MUITO importante. Ela realmente está de parabéns por de manter muito bem durante 7 anos. Coisa muito difícil de se fazer em qualquer país @debochedaanitta @Ludmilla Não achei legal. Se você é fã meu deve saber que eu não estímulo que ninguém ataque ninguém na internet 👑👩‍💻\nhttps://t.co/NsPNiFtXHZ E essa playlist do @Spotify que tanto amo? 👉 https://t.co/j1HDipXm2f Vielen Dank #FAZmagazin 💖 https://t.co/dmx2oWgqLm @MarcosOfcl Feliz aniversário @suelidoamo Oi @_G__U__I_ Parabéns amor Quem lembra do PFU?\nAtivar https://t.co/woQRT6JPd6 https://t.co/yB5ifFddaZ Tá rolando votação do prêmio Multishow. Vamos votarrrrr RT @RenaultBrasil: @weberfeh90 @Anitta A gente manda! Você só precisa participar da promoção #GirouLigouGanhou e, se o Kwid ligar, ele é to… RT @RenaultBrasil: @thithi522 @Anitta Quer maior propaganda do que estar na lista dos cem maiores sortudos do Brasil? Corre lá e participa.… @ryantecontaa @AnittaDailyR @QGdaAnitta Como vocês querem??. @gravityfalls 💙 que bom que está bem agora Não acredite em tudo que lê RT @rodpocket: E A @ANITTA QUE TÁ CONCORRENDO NO #TeenChoiceWarner??????\n\ncarreira internacional sim\nquem não concorda coma duas salamandra… Gente, é a combinação do @McDonalds_BR com a Promoção Girou, Ligou, Ganhou da @RenaultBrasil. Uma Big Promoção que dá 100 #RenaultKwid. Vejam em primeira mão! #GirouLigouGanhou https://t.co/A9Q0fCI9Dy @diogorod_ A teoria e a prática são bem diferentes. Teoricamente não se pode ser boçal nem preconceituoso mas tem bastante gente que é e nada acontece 😉🤷🏽‍♀️ @diogorod_ Isso é uma dúvida sua? Por que acho que ela se encaixa melhor pra um candidato à vaga de personal Stylist, não? @anittadax @guttodecarvalho Sabe quando um advogado começa a falar aquele monte de palavras formais e você fica perdido? Pois é assim que muitos brasileiros se sentem assistindo. Nem todos tem o mesmo nível de conhecimento. É muito necessário um debate simplificado. Mas as pessoas não acham isso importante @guttodecarvalho Eu faria perguntas simples sobre coisas cotidianas e de fácil compreensão da grande maioria da população. E pediria respostas com linguagem o mais simples possível. Assim todo tipo de classe entenderia https://t.co/YOKscEaaT7 Independente se este voto é igual ao meu ou não. O que importa pra mim é que cada um tome sua decisão baseado em sua própria pesquisa e conclusão. E não através de memes, fofocas, fake News ou seja lá o que for que faça alguém decidir seu voto sem pesquisar Queridos, não vim aqui dar minha posição política nem defender meus pensamentos. Só vim pedir aos jovens que me seguem que assistam ao debate e com ele pesquisem bastante sobre nossas eleições, sobre os candidatos pra que façam um voto consciente Galera... está tendo debate dos candidatos à presidência do Brasil na Band. Vamos assistir para tirar nossas dúvidas? Gente, tem novidade da @RenaultBrasil! A Promoção Girou, Ligou, Ganhou vai dar 100 #RenaultKwid 0km! Você não vai perder essa, né? Sai espalhando e participe. 📢📢 #GirouLigouGanhou https://t.co/dOgtcxcWRb 💗 https://t.co/0rdBC9zCK6 @brunogagliasso @mariruybarbosa Já tô sabendo. Essa promoção da @RenaultBrasil, que começa dia 10/08, tá imperdível. São 100 carros 😮😮. E pra espalhar, chamei dois especialistas! #GirouLigouGanhou https://t.co/dBinS3TboW 🙌 https://t.co/2C30zvZOPY RT @billboardlatin: Anitta, Becky G or Thalía: Who Is Your Instagram Queen? Vote! https://t.co/vTuPIcS4pf https://t.co/nSEAaBtkMV Vou dormir 💗 beijos a todos @eugiovani_ Nao @QGdaAnitta Sim Mas só quando tiver conteúdo muito bom pra nutrir. Algumas coisas não dá pra colocar pq já são materiais muito presentes no Netflix por exemplo @pcortazio Se tudo der certo sim. Os episódios já estão prontos @doug_ant Não. Tem mais história @thxlles Sim já estamos marcando @aquelejhon 22h @anittasexual Esperar @dieguinhx Antes do que vc imagina @eaipedrx Estou trabalhando para que seja um pouco depois @girlstaile @anacarolinaaav Eu também @doug_ant @AnittaVerdades Agosto @kaiosantt0s Já já vocês verão imagens @QGdaAnitta Depende de quem está cuidando da estratégia do single. Algumas vezes não sou eu. Mas basicamente se monta um plano meses antes para a música escolhida e se executa de acordo com a forma de trabalho da equipe em questão. @jtothabya Só 4 dias. As vezes a gente precisa parar um pouco. Se não a cabeça não aguenta. O trabalho enobrece a pessoa, mas o descanso é necessário e mantém nossa cabeça no lugar @vezenquando Vai. Tem uma que vocês vão AMAR @heyy_anitta Vocês reviverem minha época de Furacão 2000 @_G__U__I_  https://t.co/RdEusFFnT8 @risesanitta Não. @anacarolinaaav Thiago @AnittaVerdades Dessa vez eu sou apresentadora do prêmio também. A performance tem a ver com o tema do prêmio @AnittersdeSP Vai @anittameinewelt Veneno é em espanhol. Em português são outras @crazyporanitta  https://t.co/xgXFtuLUIQ @AnitterAline Terminando de editar o clipe @aliciakeysw @vaimalandroo Esse jamais @AnittaMozao @AnittaSincerona Infelizmente nao. Precisa de todas pra fechar o EP. @nkhiconic Sim @AnittaSincerona Faltam 2 pessoas que ainda não mandaram as vozes @selenajudas Tem vai malandra tb @Anderso06530821 Dessa vez ainda não meu amor... eu precisava muito descansar um pouco. Mas já estamos marcando @anittasexual No forninho @corinthianalhp Obrigada @vaimalandroo Isso não vai acontecer. Menor possibilidade. Meu clipe favorito até hoje @simboranittar Aguarde @AnittersSempre7 Até agora não temos resposta. Tem imagens inéditas queria muito que vissem. @vaimalandroo Hahahhahahah RT @razeofficial: Feelin' sad? Ten una dosis de medicina con @Anitta 💊🎶 Dale play 👉🏼 https://t.co/wZN93cws95 https://t.co/1wTUzeoIM9 E principalmente ver essa música tocando em vários países sendo em português Hoje fez um ano do lançamento de Sua Cara. Trabalhamos nessa música por mais de um ano. Foi muito legal ver as reviravoltas que deram... tudo que aconteceu RT @RadioDisneyBRA: Para o outro Domingo, 5 de Agosto, a sua programação já está garantida! É #RádioDisneyVivo, certo? Se ainda não garanti… 😍💛 https://t.co/16fR5eTDQy https://t.co/ebDG0XYwaw RT @vegaradio: ¡Ustedes con sus votos lograron que @Anitta ingrese en el PUESTO #8 con el nuevo single #Medicina! 🙌 Escuchalo ahora en el p… @NattiNatasha Rainhaaaaa RT @john: Medicina is now on the Baila Reggaeton playlist. Congrats @anitta and thank you @spotify. https://t.co/ze14jBAFrj RT @kienyketv: #VIDEO | \n\n#DeFrenteCon 🎙 |Ella, con 25 años de edad ya está traspasando fronteras. Conozca a @Anitta, la artista brasileña… Agosto, seu lindo 💛 https://t.co/J7yKaHI6Ax RT @idolator: 26 million views and counting. @Anitta's vibrant \"Medicina\" video is a hit: https://t.co/txM7hcj4xk https://t.co/QBdEmRqfUw @ilipex É que eu também tenho essa vibe ahahhaha 🙌💛 https://t.co/FkSX4mP9Ek https://t.co/bA2QIxWypf Genteee, “Medicina” já tá bombando na @deezerbr! Venham ouvir a minha música e os lançamentos da semana aqui: https://t.co/iKcNzKuMvh 💃 Beijos! // Kisses // ¡Besos! https://t.co/CaMwNToWFx RT @Los40: .@Anitta recorre el mundo para presentarnos su nuevo single, Medicina 🌎 https://t.co/FpJNHT3tQf https://t.co/xYV85bwltv RT @CuentameloYaOf: .@Anitta estrena #Medicina ¡Tenemos todos los detalles aquí! #CuéntameloYa!. https://t.co/gKj3WfUUSj Ehhhhh thank u https://t.co/liZs0ayrb2 RT @HITRADIOMA: Découvre notre Hit du jour 100% sayf sur HIT RADIO 🎶📻\n@Anitta - \"Medicina\" 🌞🎉🎉\n#HappyMonday https://t.co/5AeaFJ9yVi Corretor automático é uó pra quem tem toc de digitar rápido h* RT @playboy_col: #EntrevistaPB| @Anitta es una mujer que está lista para tomarse al mundo de la mano de grandes artistas como @MAJORLAZER,… @AmyHoneyOk @ortegopolis @cr4zyanitta @MeigoAndAbusado Gracias mi reina @g1 Sinto informar que não temos expectativa de alcançar um fenômeno como \"Downtown\" tão cedo assim por que fenômenos são acontecimentos mais raros e não tão frequentes assim. @g1 Depois de bang ouve mais uma pequena queda e estabilidade até chegar Vai Malandra anos depois. Não há como comparar a rapidez de resultados de um mercado trabalhado por 7 anos incessantes com a de um mercado que começou a ser explorado há apenas 1 ano. Obrigada. @g1 feito alguns vários anos depois. Isso tudo para explicar que... assim funciona um projeto de carreira. Sem pressa e desespero de meter os pés pelas mãos de frustrando com coisas naturais como curso normal de um gráfico de crescimento temporal @g1 Depois de mais de um ano a música que conseguiu chegar próximo deste patamar foi \"zen\", mesmo assim nada comparado à rapidez meteórica dos resultados o primeiro grande hit. Depois mais uma pequena queda nos singles seguintes após o pico de zen e seguimos estáveis até BANG @g1 nas suas adjacências. Com \"show das poderosas\" houve um pico bem parecido com o de \"Downtown\", citado na matéria. E logo depois uma pequena queda para o singles seguintes muito comum depois de picos grande como esse (favor analisar qualquer gráfico de crescimento) @g1 Explicando um pouco sobre carreira e gráficos de crescimento com exemplos práticos. Antes do meu país me conhecer com \"show das poderosas\" eu tive 5 singles trabalhados. Nestes meu alcance era regional carioca em sua maioria (por ser meu local de origem)  respingando um pouco RT @CaracolRadio: #Tendencias | @Anitta estrena video musical y en honor a esto, @Twitter le dedica un emoji\n\nLa cantante brasilera está de… RT @elheraldoco: .@Anitta lanza ‘Medicina’ con sello colombiano https://t.co/oojj4olLb3 https://t.co/YUIxIXVavN RT @torreon: La cantante @Anitta lanzó en radio y plataformas digitales su sencillo #Medicina https://t.co/jVtqPvdneP RT @tvtelehit: . @Anitta, quien será coach de la séptima edición de @LaVozMexico, estrenó el video de su sencillo: Medicina. 🎶🎥 https://t.c… RT @TuMePones: ▶ @Anitta conquista el mundo con su 'Medicina' https://t.co/aRLaZGyYGZ RT @Ventaneandouno: Estrenó la cantante @Anitta su nuevo sencillo #Medicina #Ventaneando https://t.co/vg35WWko8t RT @gamba1063: 💥#EstrenosDeLaSemana💥\n🎉#Gamba️Fun➡ \"Medicina\" @Anitta\n❤️#GambaLove ➡ \"Un poquito\" @diegotorres ft @carlosvives\n🎧Escuchalas e… RT @POPline: A Billboard definiu \"Medicina\" da @Anitta como \"contagiante e cativante\". Veja o que outros veículos internacionais falam sobr… RT @europa_fm: ▶ @Anitta conquista el mundo con su 'Medicina' https://t.co/mv22Gketzz RT @idolator: .@Anitta highlights the healing and unifying powers of music in her colorful and global \"Medicina\" video: https://t.co/txM7hc… Pop Latino 💛😍 https://t.co/h9ly1MjAMn #anittamedicina https://t.co/JAIjCnfltT RT @warnermusicmex: Viernes de mucho ritmo con el nuevo video de @Anitta, todos a gozar la #Medicina en @youtubemusic 🌎💃🏽🔥\n▶️ https://t.co/… RT @warnermusicde: Südamerikas Superstar @Anitta ist zurück – und sie hat die richtige \"Medicina\" für euch mitgebracht: feurige Reggaeton-B… Tá no ar 😍💛 https://t.co/16fR5eTDQy #AnittaMedicina https://t.co/p4POl3nGk3 #anittamedicina \n\nhttps://t.co/q2HNG85Ekf Amanhã tem Live na minha pagina 💛https://t.co/UppiZAsrtb https://t.co/TbRm5IVve3 @strangercruel Obrigada meu amor @anittaxcaro Não @euvittorr Poxa meu amor... esses amigos me tratam assim desde que eu não tinha nada a oferecer a eles. Por isso me sinto tão bem com eles @idolsfantrick Sim @massejr Obrigada pela compreensão meus amores. Vocês mais do que ninguém sabem o quanto eu dou o meu máximo. Mas sou humana como vocês e tb preciso ter meus momentos @Oops_anitta Eu amei tb @IDUAGAF Sim @danilimapl Simmmmm @heyxdrew Sim graças a Deus.  Amanhã também é um dia muito especial... mas de trabalho Eu amo trabalhar.... mas ter uma folga com amigos de infância e família é mais do que necessário. Recarrega a minha alma. Hoje tive um dia muito gostoso. Minha nova música será Medicina! // ¡Mi nuevo sencillo será Medicina! // My New single is going to be Medicina! https://t.co/vz121aQTCw Já assistiram??? O resultado está aqui: https://t.co/X2SeI6JWLo @breatheanitta Hoje não @euanittoreal Sai hoje @LourencoCaio Dia 19 vocês vão saber o meu voto e o clipe vencedor @Malicenc Eu já conheço amor tá louca Passando pra dizer que o clipe de medicina acaba de ficar pronto Sexta feira tem música novaaaaa! Quem tá ansioso?? #medicinaoveneno 😍 https://t.co/AWlBs8qoPq @MireiaCarrillo @LaVozMexico Graciasssss RT @tvtelehit: ¡Buena noticia para comenzar el martes! 👉🏼 @Anitta será coach de @LaVozMexico 🎤✌🏻 https://t.co/DqHCe8jY2r RT @elheraldo_mx: .@Anitta es la primera coach confirmada para “La Voz… México”. https://t.co/zjtspOhYLO https://t.co/lLilsX3oJ1 RT @Jorge_Ugalde: Ella es @anitta la primer coach confirmada para la edición 2018 de @lavozmexico #anitta #lavozmexico #lavoz https://t.co/… RT @TvsEspectaculos: ¡Desde Brasil para @LaVozMexico, llega la coach @Anitta ! \n https://t.co/DhT23hqxkn RT @CuentameloYaOf: ¡Bienvenida @Anitta, ya formas parte de @LaVozMexico! https://t.co/n9aFPyrigp RT @torreon: La cantante @Anitta es la primera coach confirmada de @LaVozMexico https://t.co/HGiWDyoogR RT @soldezacatecas: #Entérate #espectáculos Larissa de Macedo Machado, mejor conocida como @Anitta , elogiada como la reina del pop brasile… RT @LaVozMexico: Tienes que conocer a la estrella internacional que llega como coach de #LaVozMéxico. ¡Te encantará!  😍🎙🎶\n¡Muita sorte @Ani… ¿Cuál es tu preferida?\n#MedicinaOVeneno Qual é o seu palpite?\n#MedicinaOuVeneno Amoresss, novo episódio no ar! 👉 https://t.co/PHYmyhA7CE ❤️ RT @TelevisaDotCom: La guapa cantante @Anitta llega de coah a La Voz México ¡Conócela! #LaVozMéxico https://t.co/KDy4KrWD11 RT @torreon: .@Anitta, la primera coach confirmada de @LaVozMexico https://t.co/YVTzSbn3rL https://t.co/ZHxN05wfL7 RT @programa_hoy: ¡Impactante! Llega como coach a @LaVozMexico la súper estrella internacional @Anitta 👏\n\n#MiEmojiFavorito 🎤 https://t.co/B… RT @shots: .@Anitta will be joining @lavozmexico this year as a coach! 💜 Congratulations @anitta! #TeamAnitta https://t.co/OHYBeeXIGq RT @john: The Queen (@anitta) is now a judge on The Voice Mexico (@LaVozMexico). https://t.co/WXw61B9buB RT @Canal_Estrellas: ¡Bienvenida a #LaVozMéxico! ❤️ https://t.co/IgmGaCGF9Y RT @LaVozMexico: Te presentamos a @Anitta, la nueva estrella internacional y reconocida en Latinoamérica y Europa por su increíble talento… Con muchísima alegría les confirmo que seré coach de @LaVozMexico 2018!!! https://t.co/VTBuwlV6Lc RT @Jorge_Ugalde: @Anitta es el primer coach confirmado para la nueva edicion de @LaVozMexico los detalles ahora con @OdalysRP en #AlAireCo… RT @shots: Our first show on @netflix, Vai Anitta, is coming soon! 💜 @anitta #AnittaNaNetflix https://t.co/1cLAe9VPIU Gracias @Reforma 😘😍 https://t.co/VNLsm1lRy1 RT @NickelodeonBR: OMG! A @Anitta vai ganhar uma série documental na Netflix! #TrendyByNick https://t.co/Fi3tJ14TQY https://t.co/KpGtNcAUKG RT @Reforma: 📹 #Engéntate @Anitta estará más cerca de sus fans gracias a esta serie documental de #Netflix. Mira el avance https://t.co/V63… @ThePerezHilton 😍😍😍😍😍 RT @shots: We’re excited to announce our first @netflix show 💜 Vai Anitta coming soon! #AnittaNaNetflix @Anitta https://t.co/Cmq55y64VI RT @NetflixBrasil: Anitta em breve na Netflix, Anitta coming soon to Netflix, Anitta llega a Netflix. #AnittaNaNetflix https://t.co/M5miTYL… Em breve disponível na Netflix para o mundo todo. #AnittaNaNetflix https://t.co/qCkRLq8vAY Alista Netflix serie sobre Anitta - Vía @reforma https://t.co/7H3gVuPG7o RT @john: Vai Anitta is our first show coming to Netflix. \n\nThank you @anitta for taking the risk and giving us a chance to produce Vai Ani… Vai Anitta | Teaser [HD] | Netflix https://t.co/Ef1rhXuNMx via @netflix RT @tubefilter: .@Shots Studios Inks First Deal With Netflix For Docuseries About @Anitta https://t.co/BeE0iGWrtD Amoresss, tenho uma novidade incrível pra vocês! Adivinha onde mais vai ter surra de Anira? #AnittanaNetflix ❤️ https://t.co/RSbRmnr0ID RT @Variety: .@Netflix Orders Docu-Series on @Anitta, Brazilian Music and Social Star, From @shots Studios (EXCLUSIVE) https://t.co/EtvkyRy… 😍 https://t.co/k8YUg0YaCL Nao https://t.co/z1abOzFsVS Que hoje meu amigo @MumuzinhoC dê seu nome no Faustão e ganheeeeee Eu tô é mortaaaa, hahaha! @thiaguinhocomth disse que acordou ousado hoje, hahaha. Eu já acordei bem malandra e no ritmo de Mostra tua força, Brasiiil por motivos de: Vai, Seleçãoooo! #mostratuaforça RT @multishow: Vem aí: a maior premiação da música brasileira, o #PrêmioMultishow! As votações já estão abertas no meu site! Olha quem tá c… RT @ThisIsMax: Brazil gave us great footy and now @Anitta bagal reppin her culture!! Let me know what you think of the tunes on my blog...… 😍 https://t.co/eDqMhNt1I8 RT @MomentsES: ⚡️ ¡Ya llegaron los chismes que estabas buscando! 🔥👀🔥\n\n💃🏼 @shakira \n💍 David Bisbal\n👌 @Anitta \n🇺🇸 @JaredLeto \nhttps://t.co/Hd… RT @EFETV: ConMedicina o Veneno, la artista Anitta vuelve a cantar en español @Anitta #Música https://t.co/GlZ0RoQSxs RT @Mileniohey: ❤ @Anitta regresará con música nueva, pero la cantante tiene un problema 🤔\n\nAquí te decimos de qué se trata 😱👉 https://t.co… 👌🏽 https://t.co/yAsuIfQfjO RT @CentralAnittaBR: Anitta ao lado do diretor de arte Lucas Spot, durante as gravações do clipe de #Medicina, na Colômbia. https://t.co/9k… 🌺 https://t.co/l1VqaspS7Y RT @showdavida: Portugal, França, Inglaterra... @Anitta está em turnê e vai mostrar seu poder na Europa. É fã da cantora? Veja tudo no #Fan… ✌️ https://t.co/P59hl4QApX RT @GMB: Pop superstar @Anitta is backing her beloved Brazil to win the #WorldCup Boa sorte for an #Eng v #Bra final!! https://t.co/TzYmvIf… ☺️❤️ https://t.co/mk5Di7uL7M Nossa mini tour na Europa se encerrou da melhor maneira possível! Como sempre nosso povo brasileiro me ajudando a expandir minha carreira pra todos os lados. Muito obrigada a Londres e a TODOS os envolvidos. Que felicidade! https://t.co/8DxHG44BvT Julho ta lindoooo ❤️ https://t.co/aAOkxWnhg2 Daqui a pouco &lt;3 https://t.co/yUPVxaDh12 RT @QGdaAnitta: Hoje é o último dia da votação My #TeenChoice for #ChoiceMusicWebstar is @Anitta https://t.co/W3Wiv4iIg4 London tonight ❤️ \n\nhttps://t.co/Hx7wQ50Fq8 https://t.co/RgRon8Svwp I’m on @ITV Good Morning Britain @GMB tune in now #anittainlondon É amanhãããã ☺️❤️ https://t.co/q43qahcxnF RT @QGdaAnitta: Amores a segunda fase das votações para o prêmio multishow começou. \nVamos votar muito pelo site \nhttps://t.co/6nwZEpXAFG h… RT @dolcegabbana: Check out Anitta’s performance in a Dolce&amp;Gabbana look. \n#DGCelebs #DGWomen #DGEyewear @Anitta https://t.co/SdZyqjGU2L RT @iHeartRadio: Queen of hearts (and limes), @Anitta 💓 https://t.co/T9YNWDyOWO RT @KISSFresh: Don't miss your chance to see @Anitta LIVE at The Royal Albert Hall!! 🙌\n\nhttps://t.co/7Uo5UQlT7A RT @gabesimas: I just voted for @Anitta on #TeenChoice 2018 winners! Vote for your faves &amp; more at https://t.co/jPvkvlIQ5Q! RT @MorfiTelefe: ¡Bailá y cantá con @Anitta! #MorfiTelefe https://t.co/dxtQTw6e6E Olha que legal! Vocês podem conferir no Instagram @france24_en a Live que fizemos há pouco aqui em Paris ☺️ Amoress, estou concorrendo ao Teen Choice desse ano! As votações se encerram essa semana (28/06) então VOTEM VOTEM ❤️❤️\nLink aqui: https://t.co/4e2Xxu5PiE RT @instagram: Head to @rockinrio in Portugal with Brazilian singer @Anitta — all on today’s story 🎶 https://t.co/WkfgKkXXcZ https://t.co/c… RT @santitorres: Acá la entrevista completa con @Anitta para @BillboardArg ✨🎶🇧🇷 https://t.co/dWXPxc3Ww4 Próxima parada: Paris/Londres 👨‍🎨💂‍♀️ Nada que eu diga vai poder descrever o que senti ontem. Obrigada Portugal por me tratar com tanto amor. Obrigada minha equipe incrível, forte e competente. Obrigada minha família e meus amigos que vieram até aqui pra vibrar comigo, e quem vibrou de casa também. https://t.co/XVld2jGIzr Amo vc rainha do funk https://t.co/fsjaPzjKbV 💜💜💜 todo mundo crazy c crazy c crazy https://t.co/CzUnuLn3Q2 RT @rockinriolisboa: O #ShowDasPoderosas já fez o seu ensaio geral antes da noite mágica de hoje. 🤩🎶🎉🎸\nApostamos que a @Anitta vai dar tudo… Hoje as 19:45h no @rockinriolisboa ! E para o Brasil, transmitiremos ao vivo pelo @multishow e no App Multishow Play às 15:45h horário de Brasília. https://t.co/LOY4H0vDKi RT @rockinriolisboa: Pelo o que vimos aqui na #CidadedoRock durante o ensaio de @Anitta é melhor todos virem PRE-PA-RA-DOS #RockinLisboa #R… @anjoanitta__ Amei ❤️ My #TeenChoice for #ChoiceMusicWebstar is @Anitta Meus amores, vocês viram que estou concorrendo em mais uma premiação internacional. Fui indicada na categoria 'Music Web Star' no prêmio Teen Choice Awards 2018, vamos votar? https://t.co/4e2Xxu5PiE Está acabando a votação do Prêmio Multishow! Bora votar muito meus amores, hoje é o último dia. \nhttps://t.co/PguRSiHNXy https://t.co/DtGb4Ao2sg RT @rockinriolisboa: Fomos desafiados pela @Anitta a fazer parte da campanha da UN Environment e para falar do que estamos a fazer para red… Arrasaram! 👏🏽👏🏽👏🏽👏🏽 https://t.co/C8IDrdKltQ RT @BillboardArg: 💪 @Anitta en Argentina: \"Los latinos nos estamos empoderando. Somos un único pueblo\" 💪\nPresenta @CocaColaForMeAr https://… Arriba Méxicoooooooooooo Yesss https://t.co/R3yejLCkbf Pois é https://t.co/R9GS5aHCuk RT @QGdaAnitta: A primeira fase do prêmio multishow está quase acabando, vamos votar bastante indicando a @Anitta nas categorias abaixo. ht… Uhulllll https://t.co/yo1GD70f4w Já ouviram a música nova da Clau ??? Tô viciada \nhttps://t.co/i4v76FZ1vg RT @iHeartRadio: 💜💜💜 @Anitta 💜💜💜 https://t.co/c5IC6RhLuI Gracias mi amor https://t.co/yabcmUiuac “Fica tudo bem” ❤️ https://t.co/3zTeDexDth RT @QGdaAnitta: Muchos besos desde Argentina!\nLos amo mis fãs amados ❤️ https://t.co/mudhHjNLQX Mala de verdad -&gt; https://t.co/1WV5lbBYgm Hola Argentina! A ver cuanto saben de mi? Contesten en MTV Gurú Master hoy lunes a las 5pm @MTVLAargentina 😘😘 RT @PortalTracklist: Lauren encontrou uma Coca-Cola com a @Anitta estampada em sua embalagem! Que hino. https://t.co/H0irUwqI06 ☺️ https://t.co/uLtfDipyci RT @DJcity: We added @JBALVIN, @G_Eazy, &amp; @sferaebbasta's \"Machika Remix\" ft. @Anitta, @fiotimc, @DukiSSJ, &amp; @JeonArvani to our @Spotify pl… RT @exatv: Suspiros en 3,2,1 porque ya está la entrevista con @Anitta 😍 en @rogerlateshow 🔥 https://t.co/17ycP2Vj5H RT @rogerlateshow: ¡Nuestra guapa @Anitta ya está con @rogergzz! ¿Quién dijo que el mejor crossover no existía? https://t.co/0h2YRdE8b6 RT @LiveNationUK: We loved reading @Anitta's interview with @i_D! Check it out 👉 https://t.co/J5138IG2w9 https://t.co/auE2KRcC9U Vou dormir pra melhorar logo ❤️ @anittavrz Muy pronto... @adamjj1997 @AnittaNewsfc Not yet, my love @rabbitsdanitta Eu nem falar to conseguindo direito hoje @AnittaNewsfc Óvibiooo @withlovenitta No Hhahahahah https://t.co/BEb5LQyZzB Hoje eu fui só esse hit ... Quem lembra ? https://t.co/DWCC9TaA44 Hahahaha https://t.co/j50DGhmPdA @kaiosantt0s Hahaahha @IAmMatheusF To esperando 2 atrasildos mandarem a voz kkkkkkkkkkkk @kimba_sa Sim @bgkjunior Absolutamente nada ... só repouso @selectionado Não @crfjuniu Sim já não estava bem A gripe me pegou brabo e como já dizia eu mesma... hoje fui completamente inútil ao meu país 🤦🏽‍♀️ RT @LiveNationUK: Hey London! @LiamPayne and @Anitta have a little message for you... https://t.co/2pOBfOlOAI https://t.co/Qz11tbwZkH RT @POPline: Parcerias via direct 📬\nUma mão lava a outra. Depois de @Anitta divulgar vinda de @LiamPayne ao Brasil, cantor promove show da… RT @SpotifyMexico: Todo el año la cantamos y la bailamos, por eso hoy “Downtown” de @Anitta y @JBALVIN es el #HitDelAño. #MTVMiaw2018 Vuelv… RT @MomentsES: ⚡️@Anitta y @JBALVIN subieron al escenario de los #MTVMiaw2018 y lo dejaron en llamas 🔥🔥🔥\nhttps://t.co/5IsO5awqTC Meu país é minha força... E todos os países que me recebem tão bem hoje são bênçãos em minha vida. MUITO OBRIGADA / MUCHAS GRACIAS / THANK U SO MUCH RT @warnermusicmex: .@Anitta y @JBALVIN subieron la temperatura del escenario en los @mtvmiaw con su éxito #Downtown, con el que ganaron #H… Yesssss https://t.co/T1jQ8vOm4I RT @AnittaArgOK: “Con ustedes, la reina de Brasil @anitta” — iHeart Latino, via Instagram. 👸🏻🇧🇷 https://t.co/qSU25PNkIj @whindersson 💜💜💜💜 Meus amores, eu e o QG preparamos uma surpresa para vocês. Então corre pro @QGdaAnitta que tá rolando um mutirão. @bangttx @anittologia Esta misturado em paradinha só um pouco @idkcake Let's search for more... or... bring more with u lol @shakelikeshak Why? @anittologia Para downtown preto para combinar com o clipe. Para o carpert D&amp;G e para paradinha Adidas @thiexplicit Se assume uai. Te ajudo se quiser (sem ironia) @wereunstable Amanhã na parada LGBT @Pedronitta Quando da eu venho poxa @xmaysilva Simmmmm @dsignergustavo @papelpop @listentoSILVA @oserginho Seria delicia I am https://t.co/Kg6qjZborz @lovelydee0586 @JBALVIN Me encantaria mi amor pero estoy haciendo conciertos en Brasil @sattaminicarol @skol Sim Mas eu canto na parte da tarde tá galera? Não é às 10h da manhã rs Vou estar com um look C&amp;A beeeeeeeeeem temático Meus amores vou realizar o sonho de ter meu próprio trio na parada Gay. Graças a @skol ... tô muito feliz RT @papelpop: Parceria entre @listentoSILVA e @Anitta estreia entre os virais do Spotify Mundial https://t.co/mIpoYgbBcF https://t.co/tAZka… RT @LiveNationUK: Say hello to Brazilian superstar @Anitta and get excited for her London show later this month: https://t.co/gsb3xxFt6A (@… @thatgrapejuice ❤️ https://t.co/COKzqZNRwe 😍 @tmrwmag https://t.co/B1UJYUwbUO RT @i_D: anitta grew up in a favela and became brazil’s biggest pop superstar https://t.co/QVDQCVhcKC https://t.co/If2qf9q9PG @feribeiropp Obrigada, meu amor! RT @rogerlateshow: Prepara las palomitas y desempolva la pijama porque mañana tendremos a nada más ni nada menos que a @mariobautista_ 🇲🇽… RT @TicketmasterUK: INTERVIEW: We catch up with Brazilian sensation @Anitta as she prepares for her huge London show. &gt;&gt; https://t.co/dOcgL… RT @itau: @Anitta_anira @Anitta Falou Anitta? Fica ligada que vem mais novidades por aí, @Anitta_anira! https://t.co/0kQyuoEi1D Yesssss https://t.co/OID10D2DVl RT @rogergzz: Confirmo en el próximo @rogerlateshow a mi talentoso hermano @mariobautista_ 🇲🇽 también estará @Anitta 🇧🇷 y mi querida @lalie… Hahahah te amo @Karolconka https://t.co/hHFhTYGRF4 RT @sessaoextra: VAI, MALANDRINHA!\n@Anitta vai virar desenho animado ao lado de amigos, mãe e cães no ‘Clube da Anittinha’ https://t.co/YfM… RT @exatv: Suspiros en 3,2,1 @Anitta en @AxesoTv con @jessiecervantes ¡Presentando su nueva rola! ¡No te despegues! 🔥 https://t.co/A4Co6F7X… 😍 https://t.co/JNlzzE8ZOH Maravilhosooooo ❤️ https://t.co/zHQE58Cbyl RT @JornalOGlobo: Pupilo de @Anitta, Micael lança novo trabalho: 'Sem ela não dá'. https://t.co/639V20cyj4 via #MarinaCaruso https://t.co/w… RT @MTVLAargentina: El rojo del vestido de @anitta es más brillante que mi futuro\n#BambiEnMTVHits https://t.co/3hfymZwe0e RT @GaboRamos: Neta!! Me encantó este vídeo!!! https://t.co/IAg4JAc4V2 @Anitta 👏🏻👏🏻😱😱😱 RT @LiveNationUK: Latin superstar @Anitta is headlining London's @RoyalAlbertHall NEXT month! Grab tickets: https://t.co/jXzw36xPSX 💜 https… RT @TonyAguilarOfi: Hoy la maravillosa @anitta será nuestra… https://t.co/BiZ7glQCX1 @cyrsnitta ❤ RT @gabisalmeidag: Muito linda essa música da @Anitta  com o @matheusekauan 😍 @vaspfotos @walacegomes_ Feliz aniversário @vaspfotos @walacegomes_ Parabéns Meus fãs amados, as votações para o MIAW MTV 2018 já está chegando ao fim. Vamos votar no site ou através das hashtags abaixo + #PremiosMTVMIAW \n Ah! Vale RT também 😍 https://t.co/9YNuz0kYN5 RT @DonFTeInvita: J Balvin, el reggaetonero urbano más sonado del momento regresa MAÑANA 20 de mayo a #DonFTeInvita para cantar su éxito #D… RT @ExaFM: Revivimos la GRAN entrevista con @Anitta en #JessieEnExa\n¡No te despegues!\n📻 https://t.co/JbkKE4tEM9 https://t.co/l0WkzTIZ4H RT @Los40: ¿Preparadxs? El domimgo tenemos otro programón de #40GlobalShow139 @40GlobalShow con @tonyaguilarofi que contará con la visita d… RT @ExaFM: .@Anitta demostró al aire su amor por la radio 💜📻 en #JessieEnExa ¡Revive el momento en el Podcast! \n📻https://t.co/phvudnSQyb ht… RT @giseleofficial: Querem aprovar a PL do Veneno 6299/2002. A proposta libera o uso amplo de agrotóxicos resultando em mais veneno na noss… RT @Oye897: @Anitta en entrevista exclusiva con el @QPachow en @Oye897 🔥🔥 \n\nSigue nuestro Face Live aquí 👇🏼👇🏼 \n\nhttps://t.co/oL6QbHOBpw htt… Meus fãs amados... amo vocês!\n#PremiosMTVMiaw\n#MTVLAHITDOWNTOWN\n#MTVLAVIDEOMACHIKA https://t.co/Uzr6ANgATz RT @TvsEspectaculos: .@Anitta la artista brasileña más importante de su país, quien ha trabajado con @JBALVIN y @maluma está en Mexico para… 😍 https://t.co/fKd12Q23Qo 😍 https://t.co/tkO17SoEuU RT @los40Panama: El próximo Domingo 20 de Mayo @Anitta estará junto a  @TonyAguilarOfi en @40GlobalShow ¡No te lo pierdas! Sintoniza 105.7F… RT @YordiRosado: Mi querida @Anitta muchas gracias por tu mensaje e invitación.\n¡Por supuesto que veremos tu video en colaboración con @JBA… RT @UCanalOficial: ¡Desde Brasil! Hoy en #UNews con @MauricioGarza_ y @reginarojas recibimos el talento y sensualidad de @Anitta, ¡ahora mi… RT @HoraPopTV: ÍCONE!!\n\nCom quase 30 Anos de História uma das Revistas mais importantes do México \"Eres\" anuncia os indicados ao Prêmio Ere… RT @BruninhoeDavi: cara... ja escutaram a nova do @matheusekauan com a @Anitta?? tá massa demais! Ao Vivo e a Cores RT @MaisVoce_Globo: Bom dia com @Anitta é bom demais! #MaisVocê começando! https://t.co/bJcTk3GzJe #Mãe merece estar acima de tudo! Entre no movimento #MãeEmPrimeiroLugar da @RenaultBrasil Poste uma homenagem com a hashtag #Mãe e vamos colocar essa palavra linda no topo! Te amo muito, #Mãe ❤ https://t.co/IwZBzLgx4v #PremiosMTVMiaw  \n#MTVLAHITDOWNTOWN\n#MTVLAVIDEOMACHIKA https://t.co/p1LcIUvG5a @Anittaindecente @anittajbalvin @anittaplay @jnflesch Nossa @AnittandoTT @anittajbalvin @anittaplay @jnflesch ? Quando foi que fiz isso gente hahahah @AnittandoTT @anittajbalvin @anittaplay @jnflesch Sendo finalizadas @anittajbalvin @anittaplay @jnflesch Pq gente? Eu amo a Shakira assim como vcs... Só estão me perguntando se eu vou abrir sua turnê e eu disse que estou procurando saber com minha equipe pq ñ sabia dessa informação. só isso @anittaplay @jnflesch Fiquei sabendo por este tweet rss. . Eu estou procurando entender aqui RT @POPline: Contagem regressiva! Em poucas horas, vamos conhecer \"Ao Vivo e A Cores\", parceria dos fenômenos @matheusekauan e @Anitta! Voc… @jnflesch 🤔 RT @MTVLA: Nas ganas de terminar este finde en una fiesta como la de @anitta en #Indecente *termina escuchando música en la cama hasta la m… Vem comigo #PremiosMTVMiaw #MTVLAHITDOWNTOWN RT @tentaciones: Esta es @Anitta y la conoces incluso si crees que no. La has escuchado en Spotify, en algún pub o en algún coche que lleve… @MaduPig @ArthurBarcelox @Drykynha_lima Ahhhh se tem uma continuação aí muda de figura @BerquoLucas É isso dei mole aí apaguei rapidão quando vi os replies rs... eu AMO saber o fim antes de assistir aí falei aff 🤦🏽‍♀️ perdão @anittaxcaro Quarta feira Amo tudo, amo todos ..... e paz na terra da liberdade Apagando meu tweet sobre não ter gostado do filme por motivos de: não pode não gostar 😂 Hahaahahaahhahahahahaha https://t.co/8JwD0TUTcH @ArthurBarcelox @Drykynha_lima Meu marido fez eu assistir TODOS com ele ... e adorei... mas li antes de assistir esse último que as mortes são reais e não tem continuação @MTVLA En vivo... en mi casa... en mi fiesta de cumpleaños RT @MTVLA: .@ANITTA filmó #Indecente en una sola toma....¿Saben la cantidad de papelones que hubiese hecho yo? AH NOOO\n#LunesPiolaEnMTVHits… @_Gisa___ Papagaio, primeiro você vê, depois você critica 😉 @anittasecret Dublagem de falas e retoques finais RT @LiveNationUK: Not familiar with Brazilian superstar @Anitta? Let us fill you in... https://t.co/SMyba2Xfbb https://t.co/a80XJCgYpC 😍😍😍😍 https://t.co/N79T6KY7II So proud of youuuu @lelepons on your first single 😘😘😘 https://t.co/VRj6CQS3p4 https://t.co/g1VyoxzuzW Foi premonição, amigo. Por que meu desenho animado ta quase ficando pronto 😍 https://t.co/G99TI8uD9D Hora de rezar e dormir.... que Deus abençoe a todos. (Este eu escrevi certo .....certeza 😂) Me voy a rezar y dormir. Que Dios los bendiga a todos 🖤 (no se si escribí correcto 😂🤷🏽‍♀️) @MMunikNunes Meu amor vou verificar... enquanto isso pode ver no Instagram também 🖤 @jornalextra @SebastianYatra @ivetesangalo Yatra é meu amigo há um ano..  querido, profissional e gente boníssima... ele e sua equipe... merece tudo de bom 😘 @POPline amigos eu não desconversei.... rs .... realmente não acontecerá comigo 😘 RT @Los40: @Anitta is in da houuuuseeee! ✌💞 #LOS40PrimaveraPop https://t.co/BrBa5jSNKq RT @los40colombia: Este viernes 4 de mayo no te pierdas #LOS40PrimaveraPop desde Madrid.\n\n@Anitta es una ARTISTA INVITADA \nConéctate con ht… @TonyAguilarOfi Gracias amigo RT @TonyAguilarOfi: Bienvenida a España de nuevo @Anitta https://t.co/wMq8JLFwhO @PaulaVazquezTV @cero @MovistarPlus @ZeppelinTV @FAMAabailarCero Gracias mi amor RT @PaulaVazquezTV: Encantados con la visita y la fantástica la actuación de @Anitta 🤩🤩. Artista de exito internacional con temas como ‘Mac… RT @FAMAabailarCero: SI, SI, SI @Anitta está en #FamaABailarM3 😍😍😍 ¡A TUS PIES! https://t.co/leIAo1n42S RT @cero: Es momento de conocer \"Downtown\" 🎶\n@Anitta al escenario de #FamaABailarM3 acompañada de los alumnos de @FAMAabailarCero 👏👏👏 https… RT @caldeiraodohuck: Você tem o sonho de participar do #LarDoceLar? @Anitta guardava esse desejo. A cantora assistia ao #Caldeirão e espera… Suba la tag #FamaABailarM3 Cantando hoy en #FamaAbailarM3 Ao vivo e a Cores ❤️ 11.05 @matheusekauan https://t.co/DvwoM7XCD1 \"Soy mala, mala de verdad mirame a la cara... si no eres real mejor que te vayas\" 👉 https://t.co/s1sT9T4ewm 👈 https://t.co/rGIU0yf7do RT @Del40al1_es: #11 (-7) @Anitta feat @JBALVIN DOWNTOWN\n#Del40al1CocaCola https://t.co/eS0pOnT8qo https://t.co/XL05MzcB84 Oi gente, quem aqui ¿Hablas Portuñol? Se você ainda não aprendeu, curte aí essa playlist da @deezerbr que você vai aprender a falar espanhol, inglês e português com o melhor do pop latino. https://t.co/etNh4R0fgS 💃 https://t.co/mLngnvS5bS RT @MTVLA: Sensualidad, baile, canciones RE MIL RE PEGAJOSAS y mucho más en @Anitta. ¿Puedo volver a nacer y SER ELLA?\n\n#PowerLunesEnMTVHit… RT @AXS_UK: Have you heard of the Brazilian pop sensation @Anitta? She's performing a London show with special guests at the iconic @RoyalA… RT @AXS_UK: On sale now! Brazillian superstar @Anitta + special guests are playing at the iconic @RoyalAlbertHall on 28 June! Find out more… RT @breatheheavycom: 🔥  @BritneySpears is showing love for @JBalvin, Jeon &amp; @Anitta's fiery banger, \"Machika\": https://t.co/WSNXfz71xU RT @agenciadpzt: Chegou aquela época que só acontece de 4 em 4 anos... Não, a Copa não. Os #SanduíchesCampeões do @McDonalds_BR!\n\nConfira t… 💓 https://t.co/H0ABkXAjRV Tirei Professor! ... porém a minha preferida é Nairóbi 🤷🏽‍♀️ https://t.co/eJkBIFt5o2 RT @RedeGlobo: Isso é que eu chamo de mistura boa no #Caldeirão! @Anitta @WesleySafadao https://t.co/zFx11cxGDW RT @SPFW: A @AguadeCoco_BR e sua convidada @Anitta fizeram a abertura do #SPFWN45 ! #SPFW https://t.co/h5s8u4eSnT RT @GloboNews: No #ContaCorrente, @Anitta falou sobre ser empresária de si mesma; reveja o programa agora na #GloboNews ou no #GloboNewsPla… Sábado tem @caldeiraodohuck com meu amigo @WesleySafadao https://t.co/675t7XH17T Hoje 21h no @GloboNews ;) https://t.co/QUf1tGk6TW @araujoclay Acho que os três merecem super Não não estou puxando saco de ninguém Hoje tá parecendo a final de \"Avenida Brasil\".... geral em casa vendo tv Parabéns @boninho .. fazer televisão na era da internet não é fácil... você conseguiu Até meu cachorro tá assistindo #BBB18 @MTVLA 😍 https://t.co/uDjKwDnd6j RT @billboardlatin: Watch @Anitta talk about representing women at MiamiBash 2018 https://t.co/qKZE5duOee https://t.co/cD7Z73xxYc Hahahaha vocês são ridículos https://t.co/w6a2cbdelJ RT @QGdaAnitta: Já amamos essa parceria da @Anitta @CantorBelo @harmoniadosamba #AnittaEntrouNoGrupo #PremiosMTVMIAW Acabo de votar por #MTVLAHITDOWNTOWN en HIT DEL AÑO. Votá vos también en https://t.co/rtLQVv8rA3 #PremiosMTVMIAW Acabo de votar por #MTVLAVIDEOMACHIKA en VIDEO DEL AÑO. Votá vos también en https://t.co/EWFcP1dkb7 MACHIKA ❤️❤️ https://t.co/gYC9mlLoRU RT @LoMas_40: Nos despedimos con #Dowtown de @Anitta y @JBALVIN, el ganador de la batalla de hoy!! #YoEscuchoLoMas40 https://t.co/YOxpO1gXTo RT @multishow: #AnittaEntrouNoGrupo hoje é pra acabar com as minhas estruturas de fã, apenas. @anitta chamou @CantorBelo e @Harmoniadosamba… RT @multishow: Se liga na SURRA DE HINOS no #AnittaEntrouNoGrupo de amanhã! @anitta juntou @CantorBelo e @harmoniadosamba pra parar a sua n… Amoreees, a central de fãs é dedicada especialmente à vocês 💕 Lá você fica por dentro de tudo o que acontece! @QGdaAnitta 😍 https://t.co/pKPdpriX57 RT @HOLATV: ¡La cantante brasileña @Anitta nos acompaña HOY en #LaHoraHOLA! No te lo pierdas, y descubre cómo @jbalvin la ayudó a triunfar… Está disponível no Youtube e em todas as plataformas digitais a nossa nova música “Romance com Safadeza”. Está demais, não é @WesleySafadao? https://t.co/WXNpoEYgYj RT @iHeartRadio: Just here to bless your timeline with a lil @Anitta 💛☀️ https://t.co/Pvf6ML8BMb RT @quemacontece: Saiu! @WesleySafadao e @Anitta lançam o clipe de #RomancecomSafadeza! Assista: https://t.co/v3pkMIS9bz https://t.co/SYKtc… RT @DeezerBR: Se juntos já causam...@anitta e @wesleysafadao acabam de soltar mais uma parceria pra quebrar tudo e deixar a gente babando.…"}