{"tweets": "RT @SigaPlayPlus: Agora é cada um por si! Chegou ao fim a fase de grupos no reality. @marcosmion anunciou a vitória da Equipe Lua e, por ca… Eu amo um casal! https://t.co/t2JTzeckVS Gospel de acordo com Kanye West. Obrigado Kanye. O povo precisa de Jesus Cristo e vc está levando a palavra para MILHARES de pessoas. https://t.co/Isf9jzdFrW RT @santander_br: O musical Zorro fica em cartaz só até 17/11 no Teatro Santander. Com um elenco que transborda talento: Bruno Fagundes, @m… @mauriciostycer Eu acredito que foi a mobilização em torno dos grupos. Eu fui marcado em vários posts marcando mutirão pra votar pelo grupo. Tanto Sol, quando Lua. Juntou torcida de todos participantes em uma só votação. RT @izadoragazon: A melhor parte da eliminação é o discurso do @marcosmion ♥️\n#EliminacaoAFazenda RT @Diego14Augusto: @marcosmion mandando uma frase do esqueceram de mim 👏🏻👏🏻 #EliminacaoAFazenda @EdnaBsillva Gostou? Kkkk Mas eu to! Hahahhaha https://t.co/G3dlX3jV4J RT @SigaPlayPlus: Jorge se emocionando com Laura 😍❤ #CabineDeDescompressão https://t.co/kWCzzYBZL0 RT @SigaPlayPlus: Jorge protegeu muito Andréa durante o reality #CabineDeDescompressão https://t.co/Q4u1vFGZBU Aooo. Vem ver o papo com o Jorginho Kamikaze logo depois da eliminação. A íntegra já tá lá no @SigaPlayPlus ! https://t.co/7MKNBnty7b Aoooo. Quem vai estar na #CabineDeDescompressão de hoje?! Mandem suas perguntas! https://t.co/1vrZDOltRr RT @pridernocka: Eu adoro como o @marcosmion também ama ver a cara do povo quando o fazendeiro entra na casa!! #ProvaDoFazendeiro Quer um spoiler da #ProvaDoFazendeiro de hoje?! Segue anexo: https://t.co/J2d1WLSW9P Eu não tenho maturidade para comentar sobre o que o McGui fez. \n\nJá viram o vídeo da Jojo Todynho apavorando ele? Então, ia parecer um vídeo do Gloob perto do que eu to com vontade de falar pra ele.\n\nGalera,ñ sigam, ñ admirem e ñ defendam alguém como ele pq vc acaba no msm nível. RT @Escanor_Sol: #RoçaAFazenda\nFire in the feno kkk. @marcosmion melhor apresentador do Brasil. RT @PaulaMagnoO: Gente, sério! Como não amar a FAMÍLIA do @marcosmion\n Olha só os nomes que eles deram  para os membros da família. 😅 \nPipo… Boas épocas.... https://t.co/VeARAKAhvr RT @seriesemcena: Temos o registro do momento exato que o @MarcosMion ficou slimado😂#MPN20Anos https://t.co/cBzyXo5KaN RT @NickelodeonBR: Esses foram os nossos banhos de slime do Meus Prêmios Nick 2019! 💚💚💚 👉 Qual foi o seu favorito? #MPN20anos @LoiraNoob @m… Meu Deus... Malévola é triste demais!! Eu to é acabado... Hahahaah! Eles ficam tão tensos que só me olham com tensão e pânico no olhar! Kkkk https://t.co/COS0A0zY3J São 16 participantes! Teremos 16 discursos citando grandes ícones como esses!! Claro que o da final é o Rocky Balboa!! https://t.co/HmV7MtS8my Já sextaram? https://t.co/Pg3u2NeiIF Como do nada?? Hahaha! Toda semana só citando grandes nomes da cultura mundial!! https://t.co/ryTUWO8hfE RT @Vinilimaas: O Mion citando Buzz Lightyear #EliminacaoAFazenda https://t.co/jf2n31eykh RT @recordtvoficial: #AFazenda consolida segundo lugar absoluto em São Paulo https://t.co/o6drL82r8A RT @afazendarecord: Diego permanece na competição #EliminaçãoAFazenda https://t.co/qgWNpiYlvu @chicobarney Hahahaahahhahahaaha RT @afazendarecord: Tati é a quarta eliminada. Quem era fã da peoa? #EliminaçãoAFazenda https://t.co/gst6qTeo4g RT @seriesemcena: .@LariManoela, @MarcosMion, @FeCastanhari e @NowUnitedMusic foram algumas das celebridades que passaram pelo tapete laran… Quando uma parte enorme da sua infância ganha vida!! 😳🙏🏼😍 https://t.co/Jx8f9wsDRI RT @recordtvoficial: #AFazenda bate recorde de audiência com 'Prova do Fazendeiro' https://t.co/V9AJ0Ua8Gv E aí?? Quem FICA na Fazenda? #SPOILER - Vocês conhecem o Pimball Rural? @afazendarecord https://t.co/8v45wPdhhY QUEM VAI PRA ROÇA HOJE?! https://t.co/TDUU2o8Xl0 @Pitty Hahahaha! Melhor Tweet! ❤️ @chicobarney Hahahaha! Mano! Adoro o quão longe vc vai!! @rhcmalta Kkkkkk! RT @BACKSTAGETV2: Silvio Santos versão Marcos Mion de Tênis.👟👟 https://t.co/4SLaOCsOl7 Vamos lá! Passo qual shiploads pra eles na segunda feira? RT @ofuxico_oficial: Marcos Mion inovou mais uma vez no discurso de eliminação https://t.co/2mGDVnCNyS - #elminacaoafazenda @marcosmion Eu não posso dar pra eles informações daqui de fora que eles já não saibam, mas preparei todo o caminho pra eles assumirem e ... eles não assumiram! Então por enquanto não posso shippar oficialmente, só aqui no Twitter! Kkkk https://t.co/C8EK1GrhMN Realmente um momento muito bonito! Não lembro a última vez que toda a sede aplaudiu e homenageou um eliminado! Parabéns @tuliomaravilha https://t.co/oMbxci8IUt A lista tá ficando boa!! https://t.co/lLuNeBx3Oa Servimos bem para servir sempre! https://t.co/Q3mNR4Y1GH RT @IlzaMa: O @marcosmion citando a história do pé de pano se tornando cavalo do picapau❤ RT @danizocaka: O @marcosmion Tem que fazer todos os discurso da vida .. porraa perfeito ele consegue mete um desenho no meio de um momento… Hahahah! https://t.co/wZnXNT7B9O Daqui a pouco tem a #CabineDeDescompressão ! Mandem perguntas pra Thayse ou pro Tulio. O que vocês querem saber?! Quem quem quem?! ❤️ https://t.co/OLyRzThkMq Campanha pra nova coleção da LaMafia. 💥💥💥 https://t.co/Ub7PuamHnH RT @babi: Hoje é tão hoje que é a mesma data de frente pra tras e de tras pra frente\n\n9.10.2019 Como fiz meu filho me abraçar de novo... https://t.co/ODem4qBCEZ É Spoiler da #ProvaDoFazendeiro que vocês querem??? https://t.co/ZmS59EoDUW A origem dos memes da Fazenda... https://t.co/EHEGvJ2fNt Temos novo casal pelo que parece!! Esse vamos shippar como? Hahahahaha https://t.co/9o0XYYHqxx Hahahaha! O Jorginho é muito no 220w!! “O sol é o time do amooooor”! 😂😂😂😂 Justo quando a Tati e Bifão viraram amigas, começa esse triângulo estranho e mal definido com o Gui...isso vai dar ruim. Sim ou com certeza?! #AFazenda11 Como que shippa o Pavanello com a Sabrina? E ontem Aricia saiu do nosso amado hospício rural! O que acharam? https://t.co/RgVCeyghTs Sobre a #CabineDeDescompressão com #Aricia. Perdeu? Vem ver tudo no @sigaplayplus 🔥 https://t.co/5egMjvKyjo Seu Madruga merece!! https://t.co/dE3tBf2K70 Um clássico é sempre um clássico! Kkkkk! https://t.co/vhG14fUh82 E vamos continuar citando grandes mestres! 🙌🏼😂 https://t.co/tyIKapfIqz @Martinhaguedes E é natural! Pq tem gente que acha que eu pinto só o queixo! Kkkk Aoooo. Quem sai hoje? #Arícia ou #Sabrina? Mandem suas perguntas com a hashtag #CabineDeDescompressão! #RoçaAFazenda https://t.co/SQMf4r5sw5 RT @recordtvminas: NO AR: Sintoniza na @recordtvminas e acompanhe agora conosco o reality #AFazenda11 com @marcosmion! 🤠 https://t.co/hm6uo… ❤️❤️ https://t.co/vfxMWgOHmw RT @HugoGloss: Marcos Mion deu uma pausa do #FogoNoFeno pra conferir o filho brilhar! No Insta, o apresentador compartilhou um vídeo do Tef… Quem é o mais gato da Fazenda 11? E aí? Quem fica??? #AFazenda11 @Martinhaguedes Que amoooor!! Tá explicado? Kkkkkk https://t.co/vGV6So5m6d https://t.co/vycw1IUC6V Negocio tá neRRRVoso!!! https://t.co/v01rdtKSk7 SpoOoiler da #ProvaDoFazendeiro de hoje!\n\nQuem você acha que se salva da roça e ainda leva o chapéu pra casa?\n#Arícia #Lucas #Sabrina ? @afazendarecord https://t.co/6HUYeGn8Yi @OakBrunoMello @afazendarecord Hahahahha! Vcs não perdoam!! @heltonverao Acertou! Hahahahhaha! Imagina? Hahahhahahha!! https://t.co/aF5RQvAiDL @GalisteuOficial @afazendarecord Dri, já dei q dica! É um cowboy! Não é uma cowgirl! Kkkk Tão sentindo o cheiro de peão novo? Quem será? https://t.co/L1X2HtOsZi Curtiram a novidade? Quem será o novo peão!? @afazendarecord - Marcos Mion, como você se prepara antes de entrar ao vivo na Fazenda?\n- Mion: \n#EvoluiuChallenge https://t.co/cAj4Qv1JrB No programa de hoje vou anunciar uma surpresinha ... #AFazenda11 Vocês querem que eu comece a postar minha coleção de tenis aqui no Twitter tb? To triste de não ter ido no show do @BonJovi agora...fuen. 🙌🏼🙌🏼 Vindo de vc tem peso 2! 👊🏼💥 https://t.co/R6pPTdX7LF @realitei Curti de novo! 😘 (e comentei!) RT @brunovinsck: O Mion conduz o Reality como ninguém. Sou fã desse cara @marcosmion  #AFazenda11 RT @olucassalles: Parabéns pela conduta e pelo posicionamento, @marcosmion ! Como sempre, foi incrível. Parabéns mesmo! Teve uma buxona em… @erlan_bastos @SigaPlayPlus Não Erlan! Como falei, será mostrado no programa de amanhã. Desculpa se não ficou claro! Abs 2’ parte. https://t.co/2ph5t4P6iv Sobre tudo que aconteceu da madrugada de sábado até agora. \n1’ parte....(continua). https://t.co/nsUXQXAiwm O mundo está cheio de grandes pais, homens que enfrentam preconceitos e padrões estabelecidos por gerações anteriores em nome do amor que sentem por suas filhas! Parabéns Joilson, vc tem minha admiração!! Parabéns insta @sonoticiaboa por divulgar! https://t.co/euMdlzUnYz @r4chtuita Um Tweet educado e respeitoso eu respondo com prazer! Eu já expliquei que não teve conexão nenhuma com o assédio aquele Tweet. Eu repudio com força qq situação de assédio e sim, vendo por esse lado foi infeliz. mesmo não sendo minha intenção, eu apaguei p não dar margem. Ahhhh! Que demais que esse momento realmente aconteceu! 👏🏼👏🏼👏🏼 Seria a performance de Juninho Groovador o momento mais icônico do Rock in Rio? 🤣  https://t.co/uujwn40xPl @WanessaCamargo Inacreditável a pessoa se dedicar a fazer um Tweet desses... Mas meu amigo, quem tá falando isso é você! Olha a hora que eu tuitei, o programa tava começando! Estava falando sobre o programa como um todo. É muita escrotidão mentir e numa livre interpretação péssima dizer que mandei pegar pipoca pra ver assédio! Pelo amor de Deus Twitter!! https://t.co/nqey8Vk1IJ Para todas pessoas que me acusam de ser conivente com assédio “pq não entrei lá e expulsei ele” (como se eu pudesse!!) ou que desejam que aconteça com minha filha...eu não sei nem o que falar pra vcs, apenas que vcs me deixam muito, muito triste. Com a humanidade. Óbvio que Twitter é terra de ninguém e as pessoas se mostram assustadoramente intolerantes e agressivas. Apaguei o Tweet para não dar essa interpretação imaginária de quem tá com raiva da emissora, da situação ocorrida e vem descontar em mim. Fui ler alguns comentários e fiquei consternado ao ver pessoas dizendo que eu mandei “pegar pipoca pra assistir ao assédio”...quem assiste ao pgm sabe que eu falo isso todo dia! É pegar pipoca pra assistir AO PROGRAMA. Ridículo é eu ter que explicar isso! Logo eu...!?!? Não adianta me cobrar uma atitude ou decisão do que deveria ou vai acontecer NO PROGRAMA. Como falei no áudio que a direção me pediu para gravar: a decisão da EMISSORA, dona do programa, será anunciada, por mim, no programa de amanhã. E eu ainda não sei qual é. A todos fãs da Fazenda um lembrete: \nEu não faço a edição do programa, não escolho as imagens e não sou diretor, sou apenas o apresentador. A MINHA OPINIÃO PESSOAL sobre o ocorrido é MUITO ÓBVIA para qualquer um que me segue, mas ela não cabe e não interessa ao programa. Eu acredito que se a Tati e a Bifão ficarem tempo o suficiente na casa elas viram BFFs! Elas têm personalidade forte e parecida. Tudo a ver uma com a outra. Eu acredito muito nessa possibilidade! @soudobiieber Hoje ele trabalhou, cê viu?? Kkk RT @afazendarecord: #AFazenda está no ar na tela da @recordtvoficial! https://t.co/rNZWojCq5V Casal #Aricetto - como eu falei essa semana no programa: a gente já sabia o final dessa história! 😂😂 #FestaAFazenda So pra avisar que @afazendarecord já tá no ar! #FestaAFazenda #IncendioNoFeno Esse tipo de coisa não é puxação de saco, é a melhor gasolina que eu posso receber, mano! Mesmo@sem o @ eu vi! Kkk! Na próxima me marca fazfavô!! Kkk https://t.co/az1dTCDKwD RT @NBABrasil: O #LakeShow vem com tudo pra temporada 2019-20! De olho nessa equipe dos @Lakers. 🌴 #NBAMediaDay https://t.co/4dWQHrptNP RT @Fiaspo: E o @marcosmion que mandou uma referencia de NARUTO ao vivo na FAZENDA HEUAHEUHAUEHAUEHAUEHUA https://t.co/5zquyWbJwC Obrigado pelo reconhecimento! É um momento bem delicado mesmo! https://t.co/sejhqsn6zo RT @recordtvoficial: É dia de festa! Nesta sexta-feira (27), a #RecordTV completa 66 anos 🎉 Na mesma data, a @RecordNews celebra 12 anos de… Hahahaha https://t.co/Nbtyxo3Y9R RT @findmarian_a: @marcosmion citando Naruto em plena eliminação da Fazenda pra mim foi o auge Por aqui continuamos servindo bem para servir sempre! Quero ver o @TiagoLeifert superar minhas citações dessa temporada! 😂😂 https://t.co/hdDwgkvWTW Hoje tem a primeira #CabineDeDescompressão ! Mandem las perguntitas https://t.co/wVAW0knuGR Que programa LINDO é o Canta Comigo! À sua altura Guguzola! @guguliberato #EstreiaCantaComigo Eu AMO essa intimidade que, em uma semana, uma tá limpando o ouvido da outra com cotonete! 😂😂😂 #AFazenda11 Esse elenco é muito desligado!! Ontem tive que dar bronca de pai neles! 😂😂 “Leiam o manual de sobrevivência!” O povo está no jogo de suas vidas e não leram as regras?!? Como assim Biridin?? #AFazenda11 Normalmente os que ficam quietinhos, só ajudando, evitando conflito não vão pra primeira roça. E mesmo assim, lá está o Gui do metrô! Não existem regras na @afazendarecord !! Por isso é viciante! #AFazenda11 Se prepara, faz mala, se despede da família, dos amigos, deixa vídeo pro instagram pra 3 meses ... e volta na 1’ semana! 🤦🏻‍♂️ Que tristeza! Quem vc vai votar pra evitar esse mico? RT @afazendarecord: A Fazenda não só cria vários memes, como também atuliza alguns, não é mesmo, @marcosmion? 😂 #AFazenda https://t.co/Li2w… Hahahaha! Olha aí @HFilippo https://t.co/icKdRhBfnu Senhoras e senhores, tá no ar a Fazenda 11!! #FireInThePhenow!!! @feltrinoficial Leite condensado. Granulado. Leite condensado. Granulado. Segue até o topo do copo de requeijão e come com colher! Hahaha! Desculpa gente, eu to sem dormir desde as 6:00 de ontem fazendo o parto da minha catchorínea. Meu cérebro faiõ!\nQuem fica na Fazenda? Me rexxpeita que agora eu sou avô!!❤️❤️ https://t.co/QThhojK8HU Hauahauha! Meus filhos acham até hj que foi inspirado em mim! https://t.co/zWf59tEgn4 Querem saber como vai ser a #ProvaDoFazendeiro de hj? Eu te conto! https://t.co/C9iYQCECrN RT @pridernocka: HuHuHaahuHu @marcosmion fazendo a voz sóbria pra deixar o povo com o brioco na mão Kkkkkkk ta certinho RT @PaulaMagnoO: Acaba tudo e da o prêmio pro @marcosmion melhor apresentador do Brasil. \n #AFazenda11\n#RoçaAFazenda Hahahaha! Verdade. https://t.co/5554h6LLqT Hahaha! É um sticker da linha do Biridin, vc nunca viu?! Hahaha! Tem que ver! https://t.co/t2tUY0n9OD Hahahhaa! Ele fala o tempo todo! 😂 Pelo menos mostra que “pegou”! Kkkk https://t.co/ODCpaT8ZdO RT @guidfernandes: @olucassalles @marcosmion O @marcosmion é certamente a melhor coisa da fazenda. Ele é totalmente nós em casa com essa vo… Quem vai pra roça hj? #RocaAFazenda https://t.co/jtHYdGp9qH Quem teria coragem desse rolê?? https://t.co/A4IUrixtPV @SeriesBrasil Olhos que condenam. TEM que ganhar! @lucasfresno @DolarBipolar 😉 Quem é o mais galã da Fazenda 11? Qual o meu nome? Quem cozinha melhor? Quem tava com a razão na 1’ treta da temporada? Você acha que a Drika é RT @Francischini_: Parabéns @marcosmion que orgulho em ver ações desse tipo 👏🏻👏🏻 https://t.co/PA5vJW8BQd Seja melhor na vida real do que nas redes sociais. Caramba @iFood ... justo comigo? Que gosto tanto de vc?\nFiz meu pedido 22:30. Até agora me informavam que tava atrasado, mas ia chegar. De repente atualiza e informa q o pedido está cancelado. Sem mais nem menos. E agora já tá fechado o restaurante...não é bonito isso, hein? RT @RitaGilRamos: @marcosmion chamando o intervalo agora, foi a melhor chamada de break que já assistí!!#AFAZENDA11 #RecordTV RT @mauriciostycer: Quem sabe faz ao vivo 😂 https://t.co/3QFhozgN1a RT @KitKatTargaryen: “A Porto Real do nosso Game of Thrones caipira\" O @marcosmion tem as melhores frases. #AFazenda #provadefogo RT @JuhSaint: Eu adoro como o @marcosmion usa referências de Game Of Thrones em #AFazenda 😂😂😂 RT @OrgulhoDaCL: O @marcosmion é o melhor apresentador de reality, sem dúvidas. E pra melhorar mais ainda cita Freud/Psicanálise... Como nã… RT @re_massRS: @Pupa_Dias @marcosmion Melhor apresentador de realitie... NINGUÉM é melhor que ele no ao vivo!!!! \n@marcosmion ....toda minh… RT @valkydespb: Admiro a entrega do @marcosmion em #Afazenda dando uma força aos ninjas. Por isso que o programa manda bem #ProvaDoFogo RT @sueli11amorim: Mion melhor apresentador concerteza #provadefogo https://t.co/HarpuDOP6H Eu amo mesmo! 😄 https://t.co/g8sPxMpsFQ Hahaha https://t.co/IluamuzNSO RT @revistatrip: “O 'Piores clipes do mundo' foi um YouTube antes do YouTube”, diz Marcos Mion (@marcosmion). No #TripTV, o apresentador re… O que vcs acharam da primeira Prova do Fazendeiro da temporada? RT @DanielKastro: A Fazenda consagra Marcos Mion como o melhor apresentador de reality da TV https://t.co/u6ihBZWiFn #EstreiaAFazenda @marc… RT @PaulaMagnoO: Não imagino a fazenda sem o @marcosmion ele é a cereja do bolo, o fogo do feno, a ferradura do cavalo, o cuspe da lhamas,… RT @ericcmacedo: @marcosmion meu nobre ! Você merece tudo por ter salvo nossa fazenda ! Que incrível sua habilidade em apresentar o game ♥️… Obrigado meu povo de Minas Gerais! 🙌🏼 https://t.co/E3uhN2gkOD Estamos no ar! #AFazenda11 QUEM??? https://t.co/XN6Q7UJdHs Quando vcs vão decorar meu nome?? T-I-A-G-O-L-E-I-F-E-R-T!! https://t.co/TjbGodwAKk RT @afazendarecord: Esse Mion é maravilhoso! Essa temporada promete ser mais doida que o Mundo Invertido. Se ele falou tá falado #EstreiaAF… RT @recordtvoficial: .@marcosmion dá detalhes de sua nova rotina com a estreia de #AFazenda 🤠🎉 https://t.co/enKyj413RV @JaqueGrohalski 🙏🏼🙏🏼 Obrigado!! Hahahha!  Fato. https://t.co/gAxH8PqjCV RT @ValescaOficial: O @marcosmion nasceu pra apresentar Reality né ? #estreiaafazenda @ttmionzinho 😂😂😂😂 RT @otaviano: Sou fã do @marcosmion! Merece tudo de bom e melhor! Parabéns mano! Parabéns pela estréia @afazendarecord! Tá na mão do cara c… RT @HugoGloss: Chegando para #EstreiaFazenda! Sedendo pelos novos peões, memes, baphos ahhhh RT @brogui: Vai começar #AFazenda! FUIIIIII kkkkk 🎉🎉🎉🎉 Vai! https://t.co/wEaiOpbVbL RT @ttmionzinho: AAAAAAAAAAH COMEÇOU! #AFazenda11 RT @TVaVer: Cabou o jornal. VEM FAZENDAAAAA Estamos no ar!  #EstreiaAFazenda Vai começar! #estreiaAFazenda https://t.co/KRXu3d63zc RT @maiconlcc: É hoje o melhor Reality show do Brasil. @marcosmion  vai ser incrível essa temporada.  👊 💥🔥  #vemaiafazenda11 #AFazenda11 🔥 RT @crescer: Uma família de Belo Horizonte encontrou uma maneira criativa para ajudar a conscientizar amigos e parentes. 'Autismo' virou o… RT @recordtvoficial: E o primeiro homem confirmado na #AFazenda é.... Guilherme Leão 😮😍 https://t.co/p9EjHAxgzi RT @recordtvoficial: Andréa Nóbrega é o primeiro nome de #AFazenda!! 😍 #BalançoGeral https://t.co/5oRynwsdSh Video mais legal de maquiagem que ja vi! @HFilippo me mostrou ontem! Já viram??\n\nhttps://t.co/B2NLAlyPNh Quem tá louco pra ver esse sede cheia hoje à noite? Quem vai tá lá dentro? Chegou o dia! É hoje! 22:30 #EstreiaAFazenda https://t.co/V7tpaToWtz Olha essa estrutura... https://t.co/4jXbQ3Leja RT @recordtv_rio: É AMANHÃ PEÃOZADA! 🔥🤠📺\nA estreia da nova temporada de #AFazenda. Anote na agenda! Ás 22h30, @Marcosmion te espera. Quem t… Peões devidamente confinados! Amanhã sigo pra Itapecerica pra conduzir a divisão de equipes e algumas outras coisinhas a mais que vcs vão adorar! \nE terça vcs assistirão a tudo! @afazendarecord RT @recordtvoficial: Veja as fotos da nova sede de @AFazendaRecord! 🤠 Com apresentação de @MarcosMion, 11ª temporada estreia nesta terça-fe… RT @afazendarecord: #AFazenda 11 começa na terça-feira (17) na #RecordTV e, neste ano, o reality está cheio de novidades! Durante a coletiv… RT @recordtvoficial: .@MarcosMion vai comandar @afazendarecord e, antes mesmo da estreia, ele lançou uma enquete durante o #HojeEmDia. Part… Tá chegando! Quem tá ansioso como eu? @afazendarecord https://t.co/rlP5e4wu18 RT @Emais_Estadao: #AFazenda11: @marcosmion fala sobre escolha dos participantes https://t.co/ohHxv4ZPsM https://t.co/uvMF1RN4j1 RT @afazendarecord: @marcosmion @SigaPlayPlus \"Me sinto muito privilegiado por ter essa experiência\", diz @marcosmion sobre a apresentação… Hoje é dia de entrar ao vivo no Balanço Geral de todo Brasil! Pra divulgar a estreia da Fazenda 11 na próxima terça feira!!\nJa apareci em Goiás, na Bahia, Rio Grande do Sul, Minas, Brasília e a lista continua! #TamoChegando RT @recordtvoficial: Está chegando a hora de ver fogo no feno! 🔥 @afazendarecord estreia na próxima terça-feira (17) com @marcosmion e muit… Não é por nada, mas a final do @dancingbrasil tá ANIMAL!! Uma dança mais impressionantenque a outra! E o @victorsarro vazando o tempo todo no fundo tentando fazer cara de galã! https://t.co/HQjFUEjzn7 O que vcs mais querem na Fazenda 11? Sabe esses produtos da @UnileverBrasil que você tem aí na sua casa? Então... A gente te ajuda a ter ótimas ideias pra reutiliza-los de maneira criativa. . #DIY \nSe liga no vídeo pra se inspirar! =) https://t.co/23ssXU4tZy #CadaUFazOBem #ad @chicobarney @Danielzukerman Nunca que ele vai! Hahaha! Ele entraria na mesma que o Justus! @chicobarney Única e óbvia escolha. @Danielzukerman @__Rhanna Terça, dia 17! @brwninh4 Tem animais que já causaram muito voltando esse ano!! E não me refiro a participantes humanos! 😂😂 @MattyBala 🤫 @eai_day Kkk! A blusa é pq o Léo é meu amigo mesmo! Kkk @LeoRoberto21 Eu sou fã da chegada no carro, close no pé pisando na grama, o drama todo! Hahaha! Mas o programa não é meu, como era o Legendarios, então não cabe a mim a decisão! Mas tb não posso dizer que não achei engraçada a reação de quando tiraram as vendas! Teve momentos ótimos! O elenco da Fazenda 11 vai surpreender. Muito!! Se era #FogoNoFeno que vcs queriam, é isso que vão ter!! 😄😄 Cabelo de apresentador de Fazenda? Check. https://t.co/RaCFthBQiF Esquentando a fogueira! Falta UMA SEMANA. #VemAíAFazenda https://t.co/RPFsYTVnE0 https://t.co/nVl9fZcwsT De volta a Itapecity. #VemAíAFazenda https://t.co/uBSWxkeubg Alerta Spoiler! Comeeeeçam as gravações em Itapecerica! #VemAíAFazenda https://t.co/lmZRMC4SvO @afazendarecord Hahahha! Me poupa dessa que daqui a pouco eu vou ter que encarar o chumbo grosso! 😂😂 #VemAíAFazenda https://t.co/5MZXdVq21z https://t.co/alD66LSSEj Uééé. Mas já? Haha. São os venenosos de todo Brasil na sede da Fazenda! https://t.co/5MZXdVq21z #VemAíAFazenda @truelovemion 🙏🏼🙏🏼 Shooting nova coleção LaMafia https://t.co/kQA419c9nl 👏🏼👏🏼👏🏼 https://t.co/mNTpXlV00r RT @annakarolline: Às vezes eu só queria voltar no tempo, não ter com o que me preocupar e assistir piores clipes do mundo com @marcosmion 😭 RT @brogui: Estou terminando o livro do @marcosmion, mesmo tendo um filho homem, como ele mesmo disse, o livro funciona perfeitamente.  Jur… RT @dpaola: https://t.co/Mo2YMI0RZA - aula do @marcosmion e @felipesolari !!! como nao conhecia esse podcast e PRINCIPALMENTE esse ep!!!! @brogui Que bom ter esse feedback!! E como eu disse, caráter, ética, amor, dignidade, respeito e auto estima independem de sexo! 👏🏼👏🏼 Feliz em fazer parte desse momento da sua vida! RT @recordtvoficial: Diário das Celebridades: @marcosmion se transforma em \"porta-voz\" das famílias com crianças autistas ♥ #HojeEmDia http… RT @crescer: \"Diga o quanto sua menina é amada e como é linda. Garanta que ela tenha certeza de suas capacidades. Ela vai te ouvir como nun… ❤️❤️ https://t.co/7vfbtHm0io Vc tá sempre nos meus planos, mano! ❤️ https://t.co/rBesMEnmMo To louco pra ver o live action da Dora Aventureira!! Quem tem filhos da idade dos meus com certeza já teve seu momento Dora, the explorer!! @gustastockler Melhor GIF, isso sim! 😂😂 @gilisl Hahaha! Eu quero!! Acho que vc guardou todo esse tempo pra poder dar pra mim!! Vc me dá? 🙏🏼 @brogui Me conta depois o que achou!! ❤️ Se vc estiver de bobeira, da RT nesse Tweet que vai computar como voto nos Meus Prêmios Nick pra eu ganhar na categoria Inspiração!\n\n#MarcosMionInspiração Pode ler o Pai de Menina, irmão! A base pra se constuir uma pessoa com caráter, dignidade, humildade, honra à família e à Deus e um elo inquebrável com seus pais independe de sexo! \nÉ só pular as páginas exclusivas para serem lidas entre pai e filha, mas o resto....tá tudo lá! https://t.co/h0sY7HrGzp A madrugada é pra quem gosta de exclusividade. #MPN #MarcosMion \n\nSe der um RT já vai estar votando pra eu ganhar o prêmio Inspiração do ano dos Meus Prêmios Nick! Fortalece Noixx!! Semana que vem começamos efetivamente. Mas, por exemplo, já foram confeccionados os adesivos com logo do autismo para as placas de prioridade! 👏🏼👏🏼 https://t.co/58ueLf3WlE Retrato de família!! Esse encontro de Abravaneis vai ao ar hoje no Programa do Sílvio!! https://t.co/VJJUA2dhBg RT @newdigao: Genial o livro #PaiDeMenina do @marcosmion! Um livro que todo Pai de menina deveria ler! 👏👏👏 https://t.co/pUcILTu6Qm AMAZON FIRES: what's REALLY going on in Brazil? https://t.co/0Zzf1KILaP via @YouTube - um apelo ao @YouTubeBrasil , esqueçam métrica, algoritmo, lucro...simplesmente invistam e levem TODOS usuários da plataforma para o Canal Nostalgia do @FeCastanhari . Sem mais. Bom dia. RT @afazendarecord: Sob o comando de @marcosmion, #AFazenda 11 vai testar a resistência e persistência dos peões na disputa pelo prêmio mil… @nickcarter Finally!! I’ll be in touch!! E a foto que me mandaram do MasterChef que o Fogaça tá a minha cara e o Jacquin tá igual ao Hassum?? Vcs viram?? https://t.co/QOSxB23kdq @victorsarro Estará ajudando a mim, a Sabrina, ao Faro, a Xuxa tb! Ao Gugu!! 🙂 Sobre meu novo programa! 😂😂😂@LeandroHassum https://t.co/z81WJwnOM5 Vc já fez tatuagem junto com amigo? https://t.co/KB82a23dUE RT @recordtvoficial: Que fo-fu-ra! 👀❤\nO apresentador @marcosmion se divertiu com os filhos imitando um desafio da internet #HojeEmDia https… Que notícia triste e chocante...morte tão precoce da hiper talentosa Fernanda Young. Fomos próximos décadas atrás quando ela adaptou p teatro, à meu pedido, p eu atuar, seu livro Vergonha dos Pés, que é um dos livros mais legais que já li. Deus conforte a família e a guie c amor. RT @revistatrip: “O 'Piores clipes do mundo' foi um YouTube antes do YouTube”, diz Marcos Mion (@marcosmion), conhecido por apresentar algu… E esse cast reunion?? 20 anos depois!! ❤️❤️❤️ Seriado Sandy &amp; Junior - elenco 1!! https://t.co/jBWnwpke8P Juro..:esse vídeo com essa legenda! HAHAHAHA! Não tem como não rir!! https://t.co/oIRjBTl8p2 E.T... PHONE FARM!\n.\nQuem aí também já tá contando os dias pra abrir a porta do hospício rural?! #VemAíAFazenda 👽🔥🌾 https://t.co/jdxz8COwC5 Hoje teve Fazenda Talks, primeiro evento de lançamento oficial da nova temporada! Pro mercado publicitário! Já to no clima!!!! E vcs?? https://t.co/leCs302TDz The champion! #AFazendaVemAí https://t.co/zpLf82JNdh Produza aqui seu meme! @GretchenCantora #AFazendaVemAí https://t.co/hoMCKZOolg #AFazendaVemAÍ https://t.co/iFbHZCDYR7 Não consigo ouvir Ex-Factor da @MsLaurynHill sem chorar. Há já mais de 15 anos. Toda vez. Meu livro #PaiDeMenina voltou pro topo da lista dos mais vendidos devido ao dia dos pais! Que orgulho dessa obra tão bonita, verdadeira, que tá ajudando tanta gente! https://t.co/DR3Lg9foee 💙 https://t.co/i78yjLVrIt Agora não tem mais volta!! https://t.co/bVxvqPg1T4 Espero vocês no Teatro Santander, no Shopping JK, em São Paulo, no meu primeiro musical: Zorro, nasce uma lenda!\n\nSexta, sábado e domingo! Uma experiência totalmente diferente, como vc pode ver no vídeo! E pode vir criança, viu? Os meus assistem a quase todas sessões!! https://t.co/coN3WXMvac Bom dia comunidade Tweestica! To concorrendo ao #MPN na categoria #MarcosMionInspiração - se vc der RT nesse Tweet, já vai estar votando em mim! Isso não é spam, nem corrente! É como a Nickelodeon mandou votar! Kkkk @victorsarro Uma vêz canjica....Hahahah! Parabéns mano!! https://t.co/51GTuMtiOA Qual foi o último livro que vcs leram? Alguém ainda deixa recado na caixa postal do celular?!? \n\nÚltima vez que peguei recado na caixa postal do meu celular deve ter sido em 2003... Uma das maiores emoções na minha infância foi receber a notícia que Magic era HIV positivo. Não sabíamos ao certo como lidar e nem o que era na época. Todos achavam que ele ia morrer. Graças ao avanço da medicina, diferente de tantos que não puderam usufruir, Magic faz 60 anos! https://t.co/0AKDxhT1MJ #MPN #MarcosMion \n\nSe der um RT já vai estar votando pra eu ganhar o prêmio Inspiração do ano dos Meus Prêmios Nick! Fortalece Noixx!! Obrigado @oi_oficial ❤️ https://t.co/dz6CD1qiNC Chá de revelação. O que é isso?! É um evento todo pro pai saber o sexo do bebê? Pq a mãe já sabe...ou agora é moda fazer o ultrassom vendada e avisar pro médico não falar o sexo pq tem que fazer o chá revelação? Ou os dois já sabem o sexo e fazem o chá só pra postar?! Que passa?? Sobre o dia dos pais! https://t.co/YJetmEIiYJ @cleonic02326096 Muito feliz em ver esta foto!! RT @thiago_p: Musical Zorro com a maravilhosa @leticiaspiller, @marcosmion e figurino dos meus amigos incríveis @TheoCochrane e @caiotsobra… Mano... https://t.co/Oh8YWxs3Qz Hahahaha! O Macaulay Culkin soube que a Disney quer fazer uma versão atualizada de Esqueceram de Mim e ele mostrou como é a versão atualizada na real! 😂😂😂 https://t.co/W5hvYHnZFY Galera tá rolando votação para Meus Prêmios Nick! Eu to concorrendo na categoria inspiração e toda # tuitada vale como voto! \nEntão, POR FAVOR, quem puder tuitar #MPN com #MarcosMionInspiração a família agradece demais!! Peçam para seus seguidores tb!! RT @crescer: O apresentador e colunista da CRESCER @marcosmion fala sobre paternidade e diz que participar da vida dos filhos é a maior exp… Muito feliz em poder dividir essa novidade com vocês! https://t.co/SAA7WXFkca https://t.co/jZL7JsAE8K Seguimos aqui! #PaiDeMenina #50Mil https://t.co/6ArPLJL02H Começou! #PaiDeMenina https://t.co/1gv99a56GH O dia que troquei de boca com a @SabrinaSato 😂👄👅 https://t.co/sZ5IVDAJDf Eu, com 5 anos, me virando p/ fazer uma fantasia q misturava meus ídolos da época: Indiana Jones e Rambo! 😂 Essa é minha foto p/ contribuir e agradecer o movimento #PurezaQueInspiraOBem q tive orgulho de ser embaixador junto da @johnsonsbabybr. Explico melhor na foto ao lado #ad https://t.co/HU9rASrlw7 Dia de gravar chamadas pq #VemAíAFazenda! Daqui a pouco os vídeos começam a rolar no ar. Quem tá ansioso tanto quanto eu aí? https://t.co/p9ioLuj2Lk #MionNoMorning https://t.co/5oTRZC58rA https://t.co/Lx4SIBEMkC #MionNoMorning  https://t.co/SjUGXIAB4n To ao vivo no @jpmorningshow agora. Dá pra ver aqui: https://t.co/5oTRZC58rA “Years and years” na @HBO_Brasil - quem mais tá mergulhado? @GameTime_BR @NBA @NBATV Hahahahaha! Que palhaçada é essa?!? Kobe aposentado, voltando hoje, no susto, entraria no first team. Hoje passei a tarde gravando as chamadas para #AFazenda11 - todas com referência de um grande clássico do cinema! Espero que vcs gostem! Estão demais!! Dia dos Pais tá chegando... https://t.co/Na2W4hM7rT RT @XandZeraaa: Era só isso que eu estava precisando ouvir neses últimos dias muito obrigado @marcosmion https://t.co/AkveOfmbmQ @GameTime_BR Estranho mesmo... @yuditamashiro @juninhoCandido Po irmao, que alegria te ver dançando de novo! E tudo isso com a pança cheia de xbrugui! 😂E a camiseta certa pra esse momento, hein? RT @revistatrip: O apresentador @marcosmion relembra como foi sua trajetória apresentando alguns dos programas mais malucos da história da… https://t.co/DfshfO6E1e Esperamos vcs no teatro Santander (Shopping JK) em São Paulo! Com o musical Zorro, nasce uma lenda! https://t.co/AnEckYgUYA Época boa, né? Passávamos a tarde toda juntos!! https://t.co/WPWKz6KNXQ Agora que acabou o Power Couple eu comecei a sentir um cheiro forte de fogo no feno....vcs não?? A partir de sexta feira no Teatro Santander, em SP, no Shopping JK! Estreia o musical Zorro! Venham ver eu, Letícia Spiller e Bruno Fagundes! https://t.co/R1LLI69PCc Meu primeiro musical! Muito empolgado por me propor esse desafio! Por sair da minha zona de conforto e buscar mais como artista!\n.\nEstreia sexta feira agora, dia 2 de Agosto!\n.\nNo teatrosantander em SP! No Shopping… https://t.co/N7MwDahu4b Essa semana o @dancingbrasil vai ser ao vivo na terça feira!! Fiquem espertos!! https://t.co/MdhyusxR4O Tamo ao vivo! Cola aí: https://t.co/WdpI2ra8ol #CadaUFazoBem https://t.co/ccVTBMwWrh Vou fazer uma live AGORA no https://t.co/WdpI2ra8ol! Vem compartilhar ideias comigo nesse movimento incrível do #CadaUFazOBem :) @UnileverBrasil Lendo agora alguns tweets de vcs para o #CadaUFazOBem aqui no @hojeemdia :) https://t.co/H9mQlwMKgw Bom diiia. Daqui a pouco entro ao vivo no Hoje em Dia pra mostrar os comentários que vcs mandaram para o #CadaUFazOBem. Tem muita coisa legal e inspiradora. Será que seu tweet aparece por lá? Fica ligado. :)\n@unileverbrasil @thehypebr @rolealeatorio Notícias assim me causam pânico...😞 https://t.co/aZU4nLEtLH @Lucia_GFonseca @UnileverBrasil Boooa. Depois mostra o resultado aqui pra gente Lucia! #CadaUFazOBem @UnileverBrasil @izaura_franco @UnileverBrasil Ótimas atitudes Izaura! Obrigado por compartilhar com a gente. :) Que sirva de inspiração #CadaUFazOBem @UnileverBrasil RT @revistatrip: Além de dedicar boa parte de seu tempo para promover causas pessoais, Marcos Mion (@marcosmion) ocupa sua agenda com a mus… @karenjonz Demais compartilhar suas atitudes Karen! Que sirva de inspiração pra mta gente aqui :) #CadaUFazOBem @UnileverBrasil Dia 2 de Agosto nasce Ramon, “Él Gobernador” do Reinado de Porciúncula da Califórnia.\n.\nEle roubou o trono de seu pai e teme a volta de seu irmão, Don Diego De LaVega, aka Zorro (bruno.fagundes ), o verdadeiro… https://t.co/YYeILNIKA4 Aooo... Passando na sua timeline pra dar uma dica de @OMOBrasil pro final das férias! #NovoOmo #ad https://t.co/KGHx5Ntlk7 @mairamedeiros @UnileverBrasil Boa Maíra! Se jogou no GIF, hein? Ficou demais, haha! Muito legal te ver fazendo parte desse movimento TÃO importante. #CadaUFazOBem @unileverbrasil @robertamdavid Ahhhh que lindas! Adorei a dica com a embalagem de OMO. Espero que o cofre fique cheio rapidinho, haha.  =D #CadaUFazOBem @UnileverBrasil @UolCozer @UnileverBrasil Ótimas dicas :) Valeu por compartilhar e fazer parte do #CadaUFazOBem Esse dado do #CadaUFazOBem da @UnileverBrasil é demais @gustastockler !\nMuito bom ter você junto nesse movimento 👊🏻👊🏻👊🏻 https://t.co/eiS9EY41u0 Trubisco é uma ótima palavra... 😂 Demais ter vc junto dessa ação @juzao ! Pra quem quer saber mais sobre a Cegueira da Geladeira dá um check no feed da Juzão ;) #CadaUFazOBem @UnileverBrasil https://t.co/sapxKuODQ5 @thiagones Não só isso, mas hj não existe vale a pena sem Thiago Nunes!! 🙌🏼 @JuLops 😉 @lucasfgorges AOOOOOOOOOO!! RT @aragaoluizas: Lá vem o @marcosmion com vale a pena ver direito! EU AMO!!!! ❤️ ele fez comigo na Casa tb. 😂😂👍🏻 #FinalPowerCouple RT @JoseAPMoraes1: O @marcosmion é imbatível, é a zueira em pessoa, não tem preço! #FinalPowerCouple #PowerCoupleBrasil RT @JessiiiFagundes: Cara eu amo o @marcosmion ele é espetacular com o vale a pena ver direito 😂😂 #valeapenaverdireito #FinalPowerCouple RT @LohanMenezes: Não tem como, onde tem @marcosmion eu tô, o cara é foda demais #FinalPowerCouple RT @bruxinhaofc: #FinalPowerCouple rindo litros com o vale a pena ver direito. @marcosmion sempre icônico. @APMinerato Saudades! 😘 RT @APMinerato: Gente o #ValeAPenaVerDireito é sensacional @marcosmion é muito engraçado, esse quadro devia voltar fixo na tela da record é… Eu que sou o Zika do Pântano, mano! https://t.co/LMzJA4TD5z @chicobarney Tinha! Como fazíamos no Legendários! RT @powercouple: Fã número 1 do Power Couple, @marcosmion aproveitou pra zoar os melhores momentos da temporada 😂 #FinalPowerCouple https:/… Hauahauha! Ganhei o último produto que o Gugu lançou, vcs viram? Ganhei uma “ameaça do Guguuuu”! 😂😂 Eu ia AMAR ver vc fazendo um Vale a Pena, Gugusola! ❤️ Vou ficar com saudade de ouvir o Gugu falando “PAUERR CÂUPOW”!! #FinalPowerCouple E o Tchaka logo no começo quer fazer discurso! Hahaha! Consigo ver a direção D E S E S P E R A D A mandando o Gugu interromper e seguir com o programa! 😂😂 nos primeiros 5 minutos não é hora de discurso Tchaka!! Olha lá! Hahaha! “Precisamos seguir mais rápido” disse o Gugu! Eu to vendo o Gugu e só imagino ele falando, ao ver o figurino de hoje, “terno de veluuuudu”! 😂😂 #FinalPowerCouple Ah lá o Gugu mostrando que adora o Vale a Pena! Desde que fizemos o Vale a Pena ele não para de falar “Zica do Pântano”! Hahaha! A gente AMA isso! A gente é eu e a equipe toda do Vale a Pena Ver Direito! @thiagones @ttmionzinho @Trouva @Eugeka Quem ganha o Power Couple? E tem Vale a Pena Ver Direito especial @powercouple na final de hoje!! Fica esperto que selecionamos uns momentos hilários pros finalistas assistirem!! #FinalPowerCouple @chicobarney Eu tive ânsia real já no primeiro episódio. Uma angústia...belo trabalho da direção, da edição...e claro, dos atores! Começou, hein?!? #FinalPowerCouple - uma das melhores temporadas de todos tempos! https://t.co/jAGLuLvlfb Me arrependo muito de ter parado de tocar piano. Fui sentar pra tirar Tiny Dancer e simplesmente catei milho como se nunca tivesse tocado antes...tristeza. Saindo agora do Hoje em Dia onde fui convidado pra falar do #CadaUFazOBem. O movimento incrível da @UnileverBrasil por um mundo melhor. Aproveitei pra lançar um desafio aqui pra vcs. Dá o play no vídeo pra entender tudo :) https://t.co/m9b8c12cFw Desperdício de comida é um assunto sério.\nPela minha parceria com a Unilever no #CadaUfazOBem conheci uma ação de Hellmann’s muito legal chamada Restaurante Sem Comida. É incrível o que eles fazem... Logo logo vou contar os detalhes aqui pra vocês. E aí: qual casal leva o @powercouple, hein? #PowerCloupleBrasil Vc já viu a fábrica de Kibon por dentro? Eu te mostro relembrando minha visita lá: https://t.co/E8BVi9WdXW\nSabia que a Kibon dá curso de empreendedorismo para os sorveteiros de carrinho? Essa é mais uma ideia da Unilever para o #CadaUFazOBem. Demais, né?! Compartilhando aqui + uma info q descobri com o #CadaUFazOBem da Unilever: Dove já educou + de 29 milhões de meninas sobre autoestima feminina. 29M! Isso me deixa tão feliz de ouvir. É um assunto tão importante! Que sirva de inspiração para mais projetos dessa causa :) Big Little Lies é a única série que eu gosto de assistir à abertura! É muito finesse. Que música. Muito conceito. Relembrando minha visita à fábrica de OMO: https://t.co/CEHhFMeQ3I\nLegal demais conhecer todo processo de produção. É tudo MTO rápido. E legal também é descobrir que Omo já diminuiu até 500 toneladas de plástico na produção! #CadaUFazOBem Já estão à venda os ingressos pro meu musical , Zorro! Estreia dia 2 de Agosto, em São Paulo! Teatro Santander! \nhttps://t.co/YuciSCMZhH Lembram q ano passado fui embaixador do #CadaUFazOBem? Fui conhecer as atitudes q a Unilever toma por um planeta + sustentável!\nE eu to MTO FELIZ em anunciar q a segunda fase do projeto vem aí cheia de novidades. Fiquem ligados q vou contar tudo aqui.\nhttps://t.co/urewnMzRke @chicobarney Vc e sua obsessão pelas bailarinas do Fausto! 😂😂😂 Vale ver a desconstrução que fiz desses seres de luz no Vale a Pena Power Couple com a Ju Valcezia! Hahahaha! Demais anunciarem a versão feminina do Thor!! Natalie Portman vai arrebentar! Como pai de Menina fico muito feliz pela inspiração que vai ser para todas meninas! Aliás, eles contrataram a Millie Bobby Brown pra ser herói Marvel tb, ou não? RT @planalto: Dados sobre autismo farão parte do Censo. Lei foi sancionada pelo presidente @jairbolsonaro. O apresentador @marcosmion acomp… RT @fabiowoficial: Dia histórico hoje em Brasília. Nosso Presidente ⁦@jairbolsonaro⁩ sancionou Lei que inclui autistas no próximo censo pop… WHAAAAT 2: https://t.co/UCuAtlAQlb https://t.co/QmzJ0CzUPF WHAAAT  https://t.co/8lxKwRXIiZ https://t.co/hulEUMqQm8 RT @meioemensagem: Os garotos-propaganda da @oi_oficial estão preocupados; @whindersson e @marcosmion e outros famosos agora têm a concorrê… Fui chamado para uma audiência em Brasília com o Ministro da Saúde e a primeira dama para discutirmos a situação do autismo no Brasil. Em pauta a inclusão de dados sobre autismo no censo, mas não apenas isso. Eu quero muito mais pela minha comunidade! Deus me abençoe p conseguir. Hoje foi dia de gravar mais Vale a Pena Especial Power Couple! Recebemos cenas proibidas que não foram ao ar!! Devidamente analisadas e zuadas! Em breve vcs verão na @recordtvoficial Esse vídeo vc pode compartilhar pelo wazzap! #MenorNão https://t.co/iLbXxvp1tS A cena do Dustin com a Nancy no episódio final da 2’ temporada de @Stranger_Things é das mais fofas de todos os tempos! Me deixou assistindo com sorriso no rosto! @NetflixBrasil - e agora sim, pronto pra Season 3! Tá rolando a segunda temporada da série #1TenisPorDia no stories do meu insta! Sim, abro um tenis por dia durante um mês! É loucura? Sim. Mas cada louco com a sua! Kkkk! https://t.co/Tyvl7RZPQj @HFilippo @DoggoDating Hahahahahah Quem vc gostaria? https://t.co/FNzT2UUv00 O ar que se respira quando o dia está nascendo é diferente de qualquer outro momento do dia! Bonitinho esse comentário! ❤️ https://t.co/qPCdbA5TEM @gustastockler 2! Hahaha Pode ser empolgante toda essa movimentação entre jogadores e times da @NBABrasil , mas tem uma parte gigante de mim que fica triste por não ver mais legados sendo construídos com jogadores e times juntos. Fica tudo sem história! Sem saga. \nJordan? Bulls. \nMagic? Lakers.\nEra bom. MÁGICA COM BARALHO NUNCA VISTA ANTES - FT. MARCOS MION https://t.co/SuWKbuZGLn \n\nO dia que o @PyongLeeTV chapou minha cabeça!! RT @recordtvminas: ATENÇÃO, turma do Twitter! O @marcosmion mandou avisar que a nova temporada da #AFazenda11 está chegando. 👏🏻👏🏻 \n\nNós que… É hoje!! 22:45!! Na @recordtvoficial https://t.co/faYgKWnRqh RT @quemacontece: Um paizão desse! (Cc: @marcosmion) https://t.co/L0i60xTse0 RT @DeezerBR: Hey! Já parou pra pensar como seria se todo mundo se colocasse no lugar do outro só um pouquinho? @marcosmion @jaimeribeirojr… #VemAíAFazenda!!! Quem vc quer ver lá dentro da sede? Dá o play no vídeo que eu explico tudo. Já to sentindo o cheiro do fogo pegando no feno... 🔥 🌾 https://t.co/KeKMnDn7gQ @petroniodasilva 🧡 Na @WaltDisneyWorld ... https://t.co/UxbRE2dAoy @GameTime_BR Mas seria bem irado ver os dois juntos! Seria um início de showtime de novo, mas em Boston! @GameTime_BR Não pode ser...🤦🏻‍♂️ Ontem à noite...sempre mágico. Sempre como se fosse a primeira vez! @DisneyParks @Disney #DisneyParques https://t.co/HVy3qRJ7Uh Importante!! https://t.co/AnkGOBFDm8 Mano. N colocamos nenhum objeto a mais nessa casa. Eu JURO! 😂😂😂 @PyongLeeTV https://t.co/zG9j8IqhiQ O Vale a Pena do @powercouple é sempre um caso a parte! 😂😂 https://t.co/yQhOwnmuGb Imagina....recusar uma proposta de TRINTA E UM MILHÕES E MEIO DE DÓLARES ainda tendo um tendão de aquiles rompido???!? Isso é uma aula de confiança. De independência. Ou de loucura!! https://t.co/uwqQV8VpFJ @fernandesgs5 Amém! @TazinhaM Parabéns!! Força e fé sempre! @Babi36674496 Isso muda tudo! @pink_ousada Isso é verdade! @otaudotiago Faz diferença! Sempre! Perdão é pros fortes! @AtencaoPlena 👏🏼👏🏼👏🏼 Conte pra mim o que aconteceu pra grande mudança da sua vida. Maaano: https://t.co/wgP9bN7YUX Hoje na @recordtvoficial 👏🏼👏🏼👏🏼 https://t.co/04azzr0vPK - “É jogo da seleção? Feminina ou masculina?”, me perguntaram.\n- “Feminina! Se fosse masculina eu nem tava assistindo”, respondi sem pensar.\n\nÉ, os tempos mudaram.\n#CopaDoMundoFeminina #ForçaGuerreiras 🙏🏼🙏🏼 https://t.co/YkPxk2y4LL RT @GamerPatife: Meu irmão @fecastanhari me levou ontem no anivesario da meu maior idolo e inspiração @marcosmion e eu não consigo descreve… RT @quemacontece: Eeeeee! @marcosmion completa 40 anos hoje e a gente não pode deixar de relembrar esse ensaio liiindo que o apresentador p… RT @SigaPlayPlus: Você sabia que @marcosmion sonhava em ser pai antes dos 20 anos? Em uma conversa com @piangers, o apresentador falou sobr… @HFilippo @anistonjennifer Se conseguir avisa ela do Twitter! Pq o seu último post foi no Natal de 2013! Hahahah 40 anos de idade.\n20 anos de carreira como apresentador.\n1 festa pra celebrar tudo isso.\n1 agradecimento acima de todos outros: Deus. https://t.co/gnQyWgwEuR O @PyongLeeTV BUGOU minha jaca!! INACREDITÁVEL esse maluco!! Vem ver!!\n\nhttps://t.co/SuWKbuZGLn Eita https://t.co/oLC7YPcttZ To sentindo um cheiro de 40 anos chegando por aqui... RT @NovelaTopissima: Agora o Cantinho da Laje vai virar o restaurante mais famoso do Rio de Janeiro depois de receber a visita do @marcosmi… RT @NovelaTopissima: Fica a vontade que a casa é sua, @marcosmion! 😊 #Topíssima20 https://t.co/9kbOq7DcUd RT @Nieve_00: Que mensagem importante!!!\n\nVídeo completo no Instagram dele @marcosmion https://t.co/RrxyuLOfEI RT @NicoleBahls: .@marcosmion analisa reações de Nicole Bahls durante prova de choques no Power C... https://t.co/8XeXyz73Ev #PowerCoupleBr… RT @Emais_Estadao: &gt;@marcosmion completa 20 anos de carreira com o musical ‘Zorro - Nasce uma Lenda’ https://t.co/fon3kX61p6 https://t.co/6… RT @rictvrecordsc: O @marcosmion está chegando hoje na novela Topíssima! O que será que ele irá aprontar? Mais alguém está curioso? 😍 Te es… Vamos falar sobre choque na cuíca? https://t.co/1fRIIMvvSD @FeCastanhari @gewbank Mas na verdade vc é o jovem eu! Não se iluda. É cada uma que me aparece.... @HFilippo Foto!! HOJE TEM!! https://t.co/9X3onmnrGH Mesma capa, mesma coreógrafa de quando fomos campeões do @dancingbrasil ! Mas dessa vez para o teatro musical! Em Agosto vem Zorro! https://t.co/oDjYPyU4xg RT @recordtvoficial: Ah, o @powercouple! 🤣 Eliéser cai em brincadeira, e @marcosmion faz você rachar de rir com todos os detalhes desta tro… Tá SURREAL esse final!! O no cronômetro e nos estamos esperando O QUE pra comemorar e gritar?!??? #NBAnaESPN Eu quero ver o Drake!! MOSTRA A CARA DO DRAAAAKE!! Hahahah! Se eu to assim,imagina ele!!! @NBABrasil NAAAAAAAAAO!!! Raptors!!! COMO???? Era só segurar a bola!!! Pelamor!!! Que BURROOOOO! MEU DEUS!! O Raptors vai ser campeão da NBA!!! Inacreditável!! ❤️❤️ https://t.co/NJwqbjGsGM Sem Kd, sem Klay...to começando a acreditar que o @Raptors pode DE FATO ser campeão hoje!! Minha nossa!!! 😳😳 @NBABrasil #NBAnaESPN @Carolinasesmt Hahahaha! Tava incrível mesmo. @dgcdaniela @TopChefBrasil Tava! Inesquecível. @OrgulhoMion PARABENS Gabi!! Que Deus abençoe sua vida, seus caminhos! Muito obrigado pelo carinho sempre! RT @revistatrip: Mais maduro do que nunca e corajoso ao expor suas verdades, o apresentador @marcosmion falou com a Trip sobre paternidade… RT @TopChefBrasil: Aquele susto do @marcosmion e do @felipebronze 😂 Thiago mandou bem na entrada! #TopChef https://t.co/wkuBagMJJh RT @TopChefBrasil: Nem fala, @marcosmion... 😰 #TopChef https://t.co/zWCHblF1a3 O único problema do jantar que participei como convidado do @TopChefBrasil é que acabou. \n\nQue experiência INCRÍVEL saborear as invenções dessa galera! #TopChef 🌬 https://t.co/ylhk5fXQs6 Yeahhh https://t.co/nrUCLqRkAF Vai ter mais Vale A Pena Ver Direito SIM! https://t.co/ZQRszqUw2y Hoje to no #TopChefBrasil cheio de fome! Se liga! @felipebronze https://t.co/gkV9oMc6l3 @kustoo @Nike Wow! You deserve this man!! 👏🏼👏🏼👏🏼 Kawhi is the new Lebron!! #CAAAAALABOKA que o cara tá crescendo o jogo nos últimos 5 minutos!! É disso que pensas são feitas! @NBABrasil Juro que se o @Raptors for campeão a pessoa que eu mãos quero ver a reação é o Drake! ESPN deixa uma câmera só no Drake!!! #NBAnaESPN Ces imaginam o quanto a @newbalance tá feliz?? Decidiram voltar a investir no basquete, escolheram o Kawhi, fecharam contrato e o cara leva o time pra final e pode ser campeão! Hahaha! Falando sobre estar no lugar certo, na hora certa!! 3’ quarto é onde o @warriors dispara e garante suas vitórias na maioria das vezes. Se o @Raptors segurarem eles, temos chance de ver história hoje!! @NBABrasil #NBAnaESPN E o troféu tá no meu escritório até hoje! 🙌🏼🙌🏼👏🏼👏🏼👏🏼 https://t.co/akEYv90JsG @Marckezini1 @Trouva @powercouple Fala mano!! Eu sei que vc acompanhou bem a época Mion Kauffman (hahaha!) @Trouva vê o que é? Fiquei curioso!! Eu to aqui fingindo normalidade, mas torcendo muito pra que o @Raptors vença em casa e a gente presencie um momento inesquecível! #NBAnaESPN @NBABrasil 😳😳😳 https://t.co/Oanlt2kLuU A íntegra tá no meu canal!! https://t.co/HDDYxvPOaG RT @okeylacosta: @marcosmion @powercouple isso era tudo do que eu precisava A melhor treta do @powercouple !\nPra quem perdeu sábado: https://t.co/lSvtDAmcHM RT @revistatrip: Um dos principais apresentadores do Brasil e a mente por trás de alguns dos programas mais malucos da história da televisã… RT @HJohn_Santos: O #ValeAPenaVerDireito é programa ideal p noites de sábado da @recordtvoficial: \n\n- Tem @marcosmion  ultrapassado os limi… Estreiou ontem! E obrigado por colocarem no topo dos TTS!! Deram risada?? https://t.co/XtLGbNDdtL RT @beatrizlady07: @marcosmion e @ttmionzinho maravilhosos!! ❤\n   Quero #ValeAPenaVerDireito fixo todos os sábados!! https://t.co/5ijr2QYcpz COMPLEMENTO AO MEU ÚLTIMO TWEET: estava me referindo a esse ano. Kawhi e Lebron, os dois em times novos, sem expectativa, etc...Lebron não conseguiu chegar à final c time novo. Não me referia a ter ganhado do GSW. Eu estava em um dos jogos da virada aquele ano!🙄 @babi Estava falando deste ano...os dois em times novos, sem perspectiva, etc...mas tudo bem eu que escrevi mal. 🤷🏻‍♂️ Kawhi is the new Lebron. \n.\n@NBABrasil #NBAnaESPN SIM!!! Amanhã às 22:15 na Record!! https://t.co/FJbeNMnJK3 E o Raptors vai fazer história! Kawhi vai fazer o que Lebron não conseguiu. É muito empolgante ver o nascimento de um grande time!! Go Raptors! \n\n- claro que adoro o Warriors, Curry, KD e cia, mas tá na hora de mudança! Pro bem da liga! RT @rolealeatorio: brasileiro não sabe bater falta \neles disseram https://t.co/KvuEw5pr9K @rolealeatorio Hahahahahahahha Sempre falo, o 3’ quarto é fundamental em qq jogo do @warriors - é onde eles disparam. Se o @Raptors conseguir segurar, teremos um jogo disputado até o final!! Amanhã vai ter!! Vale a pena ver direito do @powercouple na Record!! https://t.co/Leua6gAReb Qual bordão da tv vc mais repete na vida? @babi Mad Men é um das top 5 Of all time! E com final digno, diferente do GOt! Nunca mais vc vai cantar essa música igual! Hahaha\n\nhttps://t.co/UcwBOfLxDe @HFilippo 2 Que J O G OOOOOOOO!! Eu amo jogo assim! Com os caras mergulhando no chão, dando o sangue! E @Raptors vai roubar um jogo na casa do @warriors  - pra quem quer série com emoção, como eu, isso é ótimo!! #NBAnaESPN #NBAFINALS @NBABrasil Shootador quando tá no flow, quando pega a bola e, rápido, sem pensar arremessa, é cesta certa! Só ver o Danny Green do Raptors ou o Klay Thompson do warriors. \n\nNote: Curry é outro tipo de shootador. Tem esse reflexo tb, mas tem muito mais. #NBAFINALS #NBAnaESPN @NBABrasil No Teatro Santander Rooftop, em SP, em Agosto! https://t.co/cXTofuOIGB O 3’ quarto é onde o @warriors dispara. Se o @Raptors consegue segurar a liderança no 3’ quarto eles têm chance real de ganhar esse jogo! #NBAnaESPN #NBAFinals @NBABrasil Tá acontecendo... https://t.co/edvpYfOSVi Mas ... nos somos aqui da vida real!! Kkk! https://t.co/ql3P8F4hLK Saudade do sono que ainda não vivi... #insonia @babi É um pedido isso? 🧐 Iguodala é “ice in my veins”! Que sangue frio pra respirar e enfiar essa bola de 3! #NBAFinals A bola não bateu no Gasol!! Pelamor!! É Raptors Ball!! #NBAFINALS Quem mais quer que o @Raptors vença o jogo só pra dar aquela emoção extra e a série ir até o jogo 7?! #NBAFinals2019 @NBABrasil #NBAnaESPN Enquanto isso... https://t.co/cMRK4qXz3m @chicobarney Vc tem que falar com o @PyongLeeTV @mauriciostycer Tem especialista em tudo! @felipeter1910 @Lima_Lucas Tinha que ter. Cruel essa lista. Como não ter JayZ e Biggie tb?! @NKOTBBRASIL @Lima_Lucas @NKOTB @jordanknight @DonnieWahlberg @dannywood @joeymcintyre @JonathanRKnight Claro! Muito! Step by step tinha que estar nesta lista tb! @leolima_85 @Lima_Lucas Verdade!! Tinha que ter Suck My Kiss Existem pessoas que causam felicidade onde vão.\nOutras quando vão.\n- Oscar Wilde. @Lima_Lucas Faltou um do Michael Jackson, do Prince, do Marvin Gaye...e do Tupac, do Puff e do Biggie. Essa lista é cruel! Respondendo ao Tweet do @Lima_Lucas : os 5 álbuns que mais ouvi na vida (eu acho que são! Muito difícil isso...)\n1. Guns - Appetite For Destruction\n2. Bon Jovi - New Jersey\n3. Bob Marley - Uprising\n4. Ramones - Greatest Hits\n5. Backstreet Boys - Millenium @Lima_Lucas 1. Guns - Appetite For Destruction\n2. Bon Jovi - New Jersey\n3. Bob Marley - Uprising\n4. Ramones - Greatest Hits\n5. Backstreet Boys - Millenium RT @thehypebr: #TBT de hoje! THBRTV com grande @marcosmion | papo completo https://t.co/DzaMUORqEn https://t.co/xQBmAnBPvy ❤️❤️ https://t.co/epuej1s2G5 RT @revistatrip: Na conversa com o #TripFM, o apresentador @marcosmion, o pai de Romeo, Stefano e Donatella, falou sobre paternidade, autis… Saudades dos “bom dias” do @HugoGloss aqui no Twitter... Cafungada sempre!! https://t.co/SZXWc0OBWL Quando uma musica é tudo que a gente quer falar... \n\nhttps://t.co/ycxvJKtmsm @felipesolari Fui hj!! RT @NBABrasil: 🏆 @marcosmion e o cobiçado Larry O'Brien na #NBAHouse! Quem não quer uma foto com esse troféu? https://t.co/mlo2BtKa6K @DaniiMeyer @TwitterBrasil Sinto-me MUITO! =) É maravilhoso que há aproximadamente uns 3 ou 4 anos o meu número de seguidores é o mesmo aqui no Twitter! 😂😂 Todo mundo continuou ganhando seguidores e eu não. @TwitterBrasil quer me dizer que o país se uniu e disse:ninguém mais segue o Mion!😂😂 https://t.co/NRfdTukcoE Fiquei sabendo que estão passando fotos do acidente do Gabriel Diniz...faço um apelo a todos: não abra, não compartilhe. E digo mais:, mande um recado pra quem te passou que tenha respeito e não faça mais isso. Não deludidos a sua curiosidade mórbida pq vc incentiva algo horrível Ficou acordada por um bom motivo! =) https://t.co/SlK1NgdZ5i Bom dia comunidade!!! Se o dia tá difícil pra vc hj, tenta lembrar de um momento muito feliz na sua vida! Lembra como foi aquela sensação é através da memória tenta trazer de volta.\nEu faço isso sempre que preciso e me da um impulso enorme pra ir atrás de mais um grande dia!! 🙏🏼🙏🏼🙏🏼 https://t.co/PAN1iGnXNG @ikantunes @shescalledloss Que época boa!! ❤️ Não ter um filho com deficiência e agradecer por isso, não faz aquela criança desparecer. Consciência urgente.\n\nhttps://t.co/zofgbAQ33t @babi Hahahahaha! Ainda @babi ??? Todo mundo tem que assistir a esse vídeo. Não é fácil. Mas é necessário:\n\nhttps://t.co/bYeH6vtIyQ Quem foi a primeira pessoa que vc começou a seguir no Twitter? RT @TVaVer: E eu que estou totalmente apegado e envolvido com #Topissima? Record acertando novamente com as novelas contemporâneas ❤️❤️ faz… Hoje eu vou dormir cedo.\n\nEu às 1:25 am: https://t.co/MGgt866Nmi RT @__lucasn: Nessas horas eu queria ser o @marcosmion ou pelo menos ter ido junto com ele  https://t.co/vkD6xmR7B0 Olha tudo que tem meu no @SigaPlayPlus 👏🏼👏🏼👏🏼 https://t.co/MH6nDH6Ov9 Quem ainda não conhece o grupo, fica dentro da minha página do Facebook! Já somos quase 50 mil pessoas! Todas falando só sobre autismo! Que vitória!! Quem quiser conhecer: https://t.co/WaGVvXd1rs e vai em grupos! https://t.co/ul7qkkctac @Jack_Vasconc @PaulaFernandes7 @luansantana Kkk! O verdadeiro Mionzinho! @Marcio_Kieling Hahaha! Noixx mano! Ae @PaulaFernandes7 e @luansantana na próxima me chama que eu dou um jeito na tradução!! 😂\n\nhttps://t.co/MP4JDvsYEm É hoje!! E promete! Na @recordtvoficial https://t.co/alxNJzlNNP Que seja uma semana abençoada a todos nós. Fé sempre. E sejam bonzinhos uns com os outros. Mesmo aqui no Twitter. 🤗 @babi Por favor me faz gostar deste final pq to total juntoseshallownow com ele. 😒😒 @Jack_Vasconc Nao desista dos cds! Eu ainda mantenho todos os meus! @babi Nao @babi ... quando baixar a adrenalina vc vai reconhecer que, dentro de todas possibilidades que poderiam ter rolado, foi um final totalmente esquecível. Tirando o momento Jon x Dany. \nA expectativa tava muito alta...difícil superar o q cada um imaginava. @naosalvo Teria sido bem melhor! @gerawareness Pra mim foi pura decepção. Bom, só me resta ir pro perfil da @babi , ver a opinião dela e tentar tirar algo a mais sobre este último episódio de #GOTFinale pq à primeira vista deu uma decepcionada. Vcs gostaram? QUE?????????? #GOTFinale Quer arrumar ingresso pro show de @SandyLeah &amp; @Junior_Lima ??\n\nEu te dou as dicas de como não pedir! 😂😂 Se liga:\n\nhttps://t.co/aBcY7Xx5s4 Hoje me deu MUITA vontade de entrar numa loja de cds e passar a tarde inteira descobrindo álbuns e bandas...#SaudadeAnos90 To comendo frango com brócolis e shallow now. @andreawerner_ @edusarsur Sua ajuda é muito bem vinda! Assim como a de todos envolvidos com o universo autista. Estamos muito esperançosos e felizes por proporcionar um grupo que pode ajudar centenas de milhares de pessoas! Juntos somos mais fortes! Conto com sua contribuicao no grupo! @andreawerner_ @edusarsur Falar sobre qq tipo de remédio ou “cura” é proibido. Te convido a entrar novamente e ler as regras e diretrizes que colocamos. Peço cuidado tb, pois qq tipo de post dando a entender que o grupo incentiva uso de MMS ou ñ se importa é de muita irresponsabilidade. @andreawerner_ @edusarsur Ola Andrea! O grupo finalmente está organizado com um time incrível de moderadores. Quando estava sozinho era impossível controlar, pois como vc mesma sabe, já são mais de 30 mil membros e mais de 1000 postagens/dia, então algumas pessoas de má fé conseguiram espaço. Acabei de subir no meu IGTV um CLÁSSICO DOS CLÁSSICOS! O Piores Do Mama África!! Quem viveu a Mtv dos anos 2000 sabe do que to falando e quem não viveu, vem ver da onde nasceu o react!!!\n\nhttps://t.co/EAP2HBNXPr RT @recordtvminas: #AFazenda? Sim, teremos! 👏👏 Mas enquanto isso, o @marcosmion vai ficar confinado no sofá da sala... Não é mesmo, Mion?!… E quando a gente sabe que tem que ir, mas fica sentado imóvel esperando sei lá o que acontecer...aí nada acontece, a gente levanta e vai. @chicobarney Nossa. Mas eu quase derrubei o copo no chão quando vi a foto!! Kd o love action de Caverna do Dragão?? “Juntos e Shallow now”??? https://t.co/TENWAQGL5U Já to naquele desespero tão grande que vim procurar meu sono aqui... Por que existem pessoas que saem da vaga de ré como se não tivesse ninguém mais no planeta?!?\nMaluco tirou uma fiiiiiina de mim agora que acho que não passava nem uma folha de papel entre os dois carros!\nP quem é vida loka na ré: existe aí uma parada chamada espelhinho! FikaDika! Final da @NBABrasil vai ser Bucks X Warriors! Já já matamos essa saudade!! https://t.co/dIGAJHPacG Só tenho uma palavra:\n\nDRAmotherfockingCARYS. 😳 @gustastockler Eu não como coxinha. Só frango e batata doce! @chicobarney 😂😂😂😂😂 Só vim aqui dizer que não vou vim aqui pq não assisti ao episódio de ontem de GOT e o único jeito pra fugir dos spoilers é o isolamento de redes sociais. Obrigado. De nada. Até amanhã ou hoje mais tarde caso eu consiga assistir. @evaristocosta É isso mesmo meu aposentado favorito! @OMOBrasil mandou muito bem mais uma vez nessa nova fórmula de OMO Lavagem Perfeita Líquido, a galera que eu visitei amou e a galera aqui de casa também! 🙂 @evaristocosta Saudades de você por aqui sim meu amigo! Já tamo aqui ligado pra ver o que é, mas vou arriscar que @OMOBrasil tá envolvido nessa parada aí! @paulo_az @powercouple E aí @Trouva ?? RT @universopcd: A revista Universo da Inclusão participou do lançamento da maior ação social da Johnson's no Brasil. Marcos Mion é o embai… RT @crescer: Existem adultos que acham divertido ensinar um vocabulário totalmente inadequado para crianças, mas, acredite: com o tempo, el… Sobre os filhos caçulas...\n\nhttps://t.co/HPhtU26Mls @MarianaBelem Foi lindo, né? O Lucas tá tipo quando ia questionar alguma autoridade sobre os buracos na rua no CQC! Braço cruzado pra trás pronto pra tomar uma piaba! 😂😂#EliminaçãoPowerCouple HAHAHAHA! O episódio de hoje do @powercouple merecia um Vale a Pena! Foi a melhor pegadinha da história do programa!! 😂😂 #EliminaçãoPowerCouple HAHAHHAHAHA! Eu to rindo da prank do Lucas Sales e Debby no Elieser! 😂😂😂 Os caras falando no abajur!!! E ele acreditou! 😂😂 #EliminaçãoPowerCouple Eu vejo o @guguliberato e fico indignado...só eu que envelheço?!? Que sacanagem! 😂😂 O Gugu tá igual a 1993!! #EliminaçãoPowerCouple Toda vez que vejo o Elieser eu automaticamente lembro dele travando no supino no BBB e gritando por ajuda! 😂😂Que cena pra passar na tv! Kkkk! #EliminaçãoPowerCouple Uma coisa tem que ser reconhecida: a @recordtvoficial consegue transformar a casa de forma impressionante do @powercouple pra @afazendarecord 👏🏼👏🏼👏🏼 Não parece a mesma casa de forma alguma! #EliminaçãoPowerCouple @MarianaBelem @apaedesaopaulo @makeawishbrasil ❤️❤️ https://t.co/7KGVC1MWJf https://t.co/zZzHboFHCD To amando a função do GIFs! Kkkk! https://t.co/FZG4wPD7Jm https://t.co/7FZ68iBKua Adorei! Obrigado pelas palavras! 🧡 https://t.co/Yh71hJa1TO https://t.co/t5aABKwmQv @rolealeatorio https://t.co/vxwOI3pAeg @Jack_Vasconc https://t.co/UT7mYauAX3 @OliveiraSarah https://t.co/Hg3IYPRiSl https://t.co/8U5Vs9oNsp https://t.co/M6jHhaOGuW To gravando no estúdio e preciso da sua opinião! https://t.co/Fw1xEoSENM @chicobarney Top 5 partes do corpo pra depilar 🙏🏼🙏🏼 https://t.co/QuAiTkcpHb O domingo à noite no Twitter morreu pra mim quando não consigo assistir o episódio de #GOT . Olha aí eu desviando dos spoilers! 😂 https://t.co/45EwO8QDrA Thank you!! 🙂 https://t.co/Z6Q7LhKGIt @duductsp07 Eduardo! Entra no meu facebook pq criei um grupo dentro da minha página chamado Comunidade Autista! Entra no grupo e divide com todo mundo! Já tem 12 mil pessoas lá!! To num branco gigante em relação ao nome daquela banda de rock nova que parece Led Zeppelin? Uns moleques..::alguém me ajuda? Puts...o que foi essa tentativa de enterrada do Curry? 🤦🏻‍♂️ #NBAnaESPN @NBABrasil Tá de brincadeira! @warriors X @HoustonRockets entrou pro 1’ overtime! Ontem foram 4! Não comecem hoje pq preciso dormir! #NBAnaESPN @NBABrasil @felipesolari Overtime!! Eu tentando chegar ao fim de Nuggets x Blazers no playoffs da NBA! #NBAnaESPN https://t.co/BibfbJD43E 4’ Overtime Eu não aguento! Tenho que ir dormir!! Pelamor!! #NBAnaESPN Sera nada!! 3’ overtime!! Melhor jogo ate agora na segunda fase! https://t.co/Vh4oDy9q5n Meu Deus!! Vai pro segundo overtime!! #NBAnaESPN Alguém assistindo q Nuggets x Blazers?? Jogaço!! Tá no overtime!! @kasales8613 Hahahhaha! Um dia tiramos!! Adoro ver meus vídeos no perfil de vcs! @QuebrandoOTabu https://t.co/9PZ1x37b4Y RT @NBABrasil: Tá esperando o que pra garantir seu ingresso para a NBA House? RT @Emais_Estadao: &gt; @marcosmion e o filho Romeo dançam Michael Jackson: 'Somos felizes' https://t.co/0m2GoGOsWb https://t.co/zSQpq6D7W3 Quando a própria @recordtvoficial assume a saudade que tá da minha Fazendola!! 😂😂😂 AMEI!! Kkkk! https://t.co/6GkLl0bS4f @allannobrega Kkkkkk! Eu só queria ter uma produçãozinha dessas! 😂 Se liga nos meus stories pra ver a segunda visita com @OMOBrasil. Essa tá demais. Eu fui lá na casa da Carmem em Brasília bater um papo, conhecer os truques dela e contar as novidades de #novoOMO. #ad A segunda visita com @OMOBrasil é em Brasília! É, tô incansável e não passei a missão pra ninguém... 😂 Tô fazendo dobradinha mesmo com o #novoOMO. Fica esperto que daqui a pouco posso estar ai na sua porta. #ad @HFilippo No meu mundo já é! Acabei de ler uma teoria sobre o João das Neves no Twitter da @babi que salvou minha noite. Estava estarrecido com o que eu achava ter sido a postura do Jon Snow na batalha! (Não dei spoilers! Tá tudo genérico aqui!)Se vc já assistiu e tb estranhou, vai até o @babi @babi explica aí pra mim qual a relação do Bran com Night King com Corvo e quem é o que pq eu cheguei até aqui meio confuso com tudo isso... @Marckezini1 @ppacheco1 @Trouva organiza please? Agora que acabou PC vamos pro ep3 do GOT! (Pra eu poder ter vida social na internet!) Queria ver outro apresentador ter que decorar o nome de 100 anônimos como eu tive que fazer na Casa!! #VidaDeApresentadorDeReality O Bimbi é um cara muito engraçado, gente boa! A Nicole todo mundo conhece! Muita gente dizia que quando casaram era armação ou qq coisa do tipo, por isso mesmo fico feliz em ver eles juntos até hj aí! #PowerCoupleBrasil RT @felipesolari: A mesma coisa por aqui. Foi um pouco \"over\". Também é a maior Hater que já vi na internet na minha vida mano.... tanto qu… @felipesolari Hahahahaha! “O vida” encerra o assunto. Sintetiza tudo! 😂😂 @mauriciostycer Hahahaha! Vc quer fogo no feno, né? Só em Setembro! Kkkkk Exatamente! Sempre faça o bem e se vc não tem essa opção, não faça nada. https://t.co/7MCg8vHfH0 Eu amo o jeito que o Gugu fala “pauerrcôpeu”! ❤️❤️#PowerCoupleBrasil Vc lembra dela @felipesolari ??? Os caras do CQC mandavam ela passar a vida dela no Twitter me xingando, odiando, querendo humilhar...e ela ficava! Mas era tanto, mas tanto que lembro o nome dela até hj! 😂😂🤦🏻‍♂️🤦🏻‍♂️ https://t.co/TcVXzSsVVv @Marckezini1 @ppacheco1 Meu amigo, por favor suba os vídeos! Ou me passa pra eu poder subir. É desesperador ver minha história fora do YouTube! RT @ppacheco1: @marcosmion Éramos felizes com:\n\nMion\nTuck (@ChuckHipolitho)\nCidão atarracado\nPé de Pano (e Fante) @gustastockler Hahahaha! Mano, vc não é desse mundo! Quem assiste a 5 temporadas de GOT e não fica preso?!? Bom, vc é o cara que tem aquele corredor sinistro de papai Noel a Flash...tudo é possível! 😂 Mano!! É o cara do TchakaBum!! Hahaha! A Record faz os melhores castings! #PowerCoupleBrasil Hahaha! Calma que logo menos tem AOOOO PEAOZADA!! https://t.co/ASWvRyBtUq HAHAHAHAHHA! Não acredito!! Essa menina do #PowerCoupleBrasil era a maior hater da história no início do Legendarios! Camila Colombo! 🤦🏻‍♂️Que vergonha que deve dar depois que o tempo passa, fica velha e lembra que já foi hater! Hater de verdade! De passar o dia xingando no Twitter! Esse começo do #PowerCoupleBrasil  é hilário! Todos cheio de querer amizade, casais pacientes uns com os outros...Hahahha! É bom pra poder comparar depois no vale a pena!! Que demais essa experiência, hein, @OMOBrasil? Gostei muito de conhecer a Fran e seus truques de lavanderia. A visita completa tá toda nos meus stories. Cola lá. #novoOMO #ad Tô na área, Curitiba! Hoje faço minha primeira visita com @OMOBrasil. Será que é na sua casa que eu vou aparecer? Qual seria sua primeira reação? Me conta aí e fica esperto na campainha. #novoOMO #ad Hoje tem, hein? https://t.co/C8tU3P42f0 Quem quer ver como era o Youtube antes do YouTube existir...e como eu apresentava programas de tv com 21 anos! Kkkkk https://t.co/tTTx1Dgen7 @ppacheco1 @Marckezini1 Hahaha! AMEI assistir a isso! Esse foi o 1’ programa do segundo ano! Quando ganhei está abertura clássica e nuvens de fundo! Kkkkk! @gustastockler Ah mano! Para que vc nunca viu?? Da que nem o estagiário do Corden e assiste tudo sem parar! Da uns 2 ou 3 dias! Kkk! Vê isso no YouTube! É muito bom! Hoje eu to só no Matrix desviando dos spoilers do #GOT de ontem. Que os Starks me ajudem! Já faz 3 anos que não muda meu número de seguidores aqui. Em que momento exatamente o Brasil se uniu e combinou “ae! Ninguém mais segue o Mion, fechou?” 🙄🙄 Caramba @MomentsBrasil @TwitterBrasil vcs nunca me falaram o que rolou, apenas que “aconteceu alguma coisa...”😒 RT @Karina97971834: Eu me achando pq fui na pré  estreia de #AvengersEndgame kkk agora to aqui de bocaaberta @marcosmion com o.proprio elen… Olha que entrevista legal que dei pra Mônica Salgado!\n\nhttps://t.co/krwyFfhUwU Assisti a Vingadores hj de novo! Levei o Tefo. Chorei tudo de novo. #HomensChoram Hahahha! Pronto! https://t.co/uLQLDFLFmQ Hahaha! Nem eu acreditei https://t.co/qbxn7lDtgS E vc? Ainda não conhece o melhor podcast do Brasil? O do @felipesolari  ?? Vai ouvir no Spotify! Ou ver no YouTube! https://t.co/aSdUxRA25T Po! Eu to muito de parabéns! Não dei um único spoiler do #AvengersEndGame e to só aqui vendo maluco dar spoiler pra todo canto!! TOUR DE UM MINUTO pela première de #AvengersEndGame. 💜🤯\n.\nO vídeo completo desse dia insano tá no meu canal: https://t.co/U13wq9fPRH. Aproveita e já se inscreve lá! 👊🏻\n.\n#VingadoresUltimato https://t.co/G07ARQ7Wxd Haha. Então já faz o esquenta até lá vendo o vídeo https://t.co/riTZs3F4LM https://t.co/9dx8pC1u0W RT @lucas9313: @marcosmion Personagens aleatórios que derrotariam Thanos: https://t.co/bG9v9N4I5a RT @danielbraandao: Que homem, meus amigos! Esse cara é um Vingador da vida real https://t.co/qFVRi0Cjm7 NO AR: acabei de subir o vídeo com TUDO da première mundial de #AvengersEndGame https://t.co/riTZs3F4LM. QUE DIA! Me contem o que vcs acharam. 👊🏻 #VingadoresSemSpoilers Sem spoilers!! Mas preciso dizer que ainda estou em choque com o filme @Avengers #AvengersEndGame . Já compraram? To sabendo que as 1’ semanas já estão esgotadas! Hahaha https://t.co/CTYrZ3K8Pd RT @crescer: \"A maior missão de um pai é educar seu filho, mas isso não é nada fácil e já adianto aqui: você não terá alguém que concorde s… Estreia HOJE, 20:45, Jezabel na @recordtvoficial 👏🏼👏🏼👏🏼 https://t.co/NF0USsuqG5 Caramba...esse dia foi LOKO! PRÉ ESTREIA MUNDIAL do avengers 💥💥\n.\nCorre pra ver tudo no meu stories enquanto ainda tá lá! Depois vou deixar nos destaques.\n.\nPASSA O DEDO PRO LADO pra… https://t.co/DXWOYMPrNZ RT @RDJBrazil: 📹 Representando o Brasil! @MarcosMion conta como foi sua experiência (sem spoilers) ao assistir #AvengersEndgame na première… So vou falar uma coisa...corre pros stories do meu Instagram!! Tive que agir naturalmente com tudo aquilo acontecendo!! #AvengersEndGame #AvengersUltimato Já a caminho da pre estreia do Vingadores Ultimato! Saquei o terno lá do fundo do armário! #AvengersEndgame https://t.co/KnrOAUMFmV Ja em Los Angeles pra pré estreia mundial do Avengers End Game! E o frio na barriga de ver os cara tudo junto?!? #AvengersEndgame #AvengersUltimato Quero ver logo mano! @felipesolari https://t.co/C2z4Sg0Liz Responde aí!!! Se vc tivesse no meu lugar, quem ia querer tirar foto?? https://t.co/NBgtnIIPzL Fazer o dia de hoje valer, a Páscoa, é só identificar algo que vc possa melhorar, principalmente no que diz respeito a ajudar ao próximo, a algo que possa ter um impacto positivo ao seu redor e MELHORAR!!\n\nIsso é renascer! \n\nClaro q pode ser feito qualquer dia; mas hj é especial! Quando a humanidade vai perceber que filme em 3D é um erro? Ame Jesus. Siga Jesus. Pratique seus ensinamentos pq fazem sentido pra vc. \n\nNão apenas diga que ama, que segue e que pratique só pra ganhar likes. @chicobarney Depois as pessoas têm dúvida do poder da Mtv! Eu fiz o Rodney Di se apresentar no programa da Xuxa que era o toppers da época!Só tocava os maiores hits...e o hit que eu fiz no Piores! Hahaha! Passa 20 anos e ainda é citado por gente influente! Orgulho de ter educado uma geração! @Qckel @LionelRichie @AmericanIdol Clássico!! 😂 P O R Q U E a gente fica enrolando TANTO pra dormir?!!? Queria ser daquelas pessoas que começa a desligar os motores as 20:00! Hoje as 20:00 eu tava chegando na academia!! Hahaha! O ritmo é loko! RT @byancakarolyne: Terminei de ler #PaiDeMenina do @marcosmion que ganhei de presente no meu niver. \nQUE LIVRO SENSACIONAL\nem muitos trech… @sitenatelinha Ah! E só pelo registro: a alta cúpula amou o projeto. Que não tem nada a ver com Mucho Macho, nem com nada que eu já tenha feito. E se foi vetado, estou sabendo por vcs! Kkkkk! @sitenatelinha Não gente! Mucho Macho??! 😂😂 Não precisa ir além do cenário pra saber que qq coisa inspirado no Mucho Macho não cabe na tv aberta! Nada a ver. 😄😄 RT @sernaiotto: hoje eu fico confusa com siglas de séries como HTGAWM e HIMYM mas há uns bons anos adorava o TSBSAVPTDC do @marcosmion na M… Quem puder votar em mim, fortalecendo geral, noixx agradece! 2018 foi o ano da Fazenda, diz aí! Vale o voto! \n\nhttps://t.co/MpXVW4IqDI Ahhhhhhh mano!!! Já??? Já???? Nunca uma hora passou tão rápido. E Bramzera de cara com JamieWilson - eu sempre fico imaginando, será que os caras já pensaram tudo isso antes de começar ou conforme vão indo, vão decidindo as coisas... #GameOfThrones #GOT O #GameOfThrones bagunça nossa cabeça. Eu to aqui pensando: “impossível alguém voar num dragão assim. Ia cair certeza”! \nIsso significa que...a pura existencia de dragões já está aceita como ok. #GOT Da primeira temporada pra cá parece que o tempo passou muito mais pro Bram do que pros outros! Trabalhar com criança em série é dureza, os bicho cresce!! Vide Strangers Things! #GOT Quem mais??? #GOT https://t.co/5RqMILA8k4 @FabioPorchat Hahahahhaha! Aqui é moral de muitos anos de GOT!! @NEToficial @FePaesLeme @HBO_Brasil @babi @chicobarney Só pra Fe Daenerys Paes Leme?? Pourran...😞 E hoje, 11/4/19, completam 20 anos da estreia do seriado Sandy&amp;Junior👏🏼 Isso quer dizer que há exatos 20 anos começava minha carreira na tv! Que vida abençoada. Obrigado Jesus Cristo por tantos sonhos realizados!\n\nE obrigado @FePaesLeme por ser um arquivo humano de foto!❤️ https://t.co/JCfO4aj4Y8 Nossa... exatamente hoje!! Completo 20 anos de carreira na tv! Que honra. Que sonho. Obrigado Jesus Cristo por me abençoar com a realização de sonhos!🙏🏼 https://t.co/gJi34OSKhl E aí a @HBO_Brasil manda uma caixa lá pra casa...chora @babi @FePaesLeme @chicobarney e #gameofthroners #GOT #GOTWATCH https://t.co/wOLYoB9GmF Basta alguém ser expulso do #BBB que minhas menções começam a bombar! Hahahaha!! Vcs querem é que as tretas não parem, né? Começa lá e continua aqui! Hoje é o último jogo de um dos grandes! @DwyaneWade deixou seu nome na história! #OneLastDance https://t.co/4TsfJIYJzx E essa piscininha, amor? Quem tem coragem?? https://t.co/R3Xjgw26YR Nossa burrice e ganância impediram que vivêssemos em paz e harmonia com a natureza. Todas essas tragedias climaticas, ditas “sem interferência do homem”, inclusive a que está acontecendo no RJ agora são a prova. A culpa é nossa. Burrice e ganância. @feltrinoficial @TwitterBrasil Eu conheci o @Trouva - já é uma relação de quase 10 anos! E quando vc gasta mais tempo entre ir pro aeroporto, viajar e estrada pra chegar até onde vai do que ficando de fato no destino da viagem?! Isso é minha vida. Vir pra Bahia e só ver a praia pela varanda do quarto e janela do carro é muita sacanagem. RT @whomath: iza cantando bad romance era tudo que eu precisava e eu não sabia https://t.co/UzxzaxqqSz RT @felipesolari: Olha que bacana, @marcosmion :) https://t.co/uTRZFAceW1 @felipesolari Fiquei sabendo, mas não tinha visto a imagem! Cada ano que passa o barulho está maior! Orgulho!! @thatssoanderson Tem o doc do MJ na HBOGO??? Eita! Vou tomar coragem e assistir! Dicas Netflix?? Alguém? Querido @LennyKravitz eu te amo desde minha adolescência, tenho frase sua tatuada, mas por motivos de chuva e velhice pra ficar ensopado e enlameado no show, não pude ir te ver no #LollapaloozaBrasil \n\n#LennyKravitzNoMultishow Sobre o último show do @KISSOnline  no Madison Square Garden!! https://t.co/Aq1AnIVNq0 A @unicefbrasil esta pedindo doações para mandar mais vacinas para Moçambique que foi atingida por um ciclone. Já conseguiram 900mil, mas ainda tem muito mais vidas pra salvar! \nClica nesse link pra doar qq valor:\nhttps://t.co/LZf0B75a9u RT @felipesolari: Meu \"Pai\" na Televisão, o cara que me deu meu primeiro emprego...de Operador de TP, lá em 2001, na Band! Eu fazia o TP do… Hahaha! Que honra pra mim! https://t.co/JauImne4Yz @feltrinoficial @chicobarney @babi Hahahahahhaha Então vamos falar sobre o autismo...💙🧩\n\nhttps://t.co/juVZAZACTe RT @recordtv_rio: No Dia Mundial de Conscientização do Autismo, assista conosco ao relato completo de @marcosmion em #PaisDaNovaEra, série… RT @elsa_ospina: RT total! @marcosmion \nBailar, Vivir y Amar, educar un hijo a través del afecto, es el camino.\n#kindness https://t.co/kOOD… Link pra comprar o livro “Escova de Dentes Azul” com preço especial hoje!! \n\nhttps://t.co/QfCna2WjTt https://t.co/Z0wrQIlgPX @LilianPaixo2 @recordtvminas Isso estava escrito na matéria?? Fico feliz! Sou o movimento de pais mais presentes e ativos nas vidas dos filhos! Sempre! https://t.co/SHxBGu4EdE RT @Kika27319685: @recordtvminas @marcosmion Acho lindo como vc cria seu filho!!!! Me lembro de vc te mulecao na MTV e hj um gde pai e mari… Deveria existir a possibilidade de quando vc comprar uma viagem fazer um seguro caso chova! Po, nenhuma cidade fica legal com chuva. Já tem! Com análises de varios clipes!! https://t.co/kHJm7AemJQ - SE INSCREVAM! https://t.co/5T7PnzPXYw Odeio descer do avião e eu ouvido continuar entupido por uma cara...que raiva. 😂😂😂😂 https://t.co/aQDos6nhHt @babi Hahahhaahaa @feltrinoficial HAHAHHAHAHAHHA! Ri alto! Essa denúncia a idade! @chicobarney Tá se rendendo a manchetes apelativas/clicativas Mr Barney?! 😂😂😂😂 Estou lendo a biografia do @PaulStanleyLive pra poder contar as histórias e deixar o Tefo mais envolvido com o rock. Cara, que história! Ele é surdo de um ouvido e não tem a orelha! Olha onde o cara chegou fazendo música! Histórias assim me inspiram. #KissArmy #Kiss @_guedesbia Kkkkkk 🧡🧡Subi um vídeo no insta sobre o presente de aniversário (bem adiantado!) dela! Quem não me segue no insta é @marcosmion tb! https://t.co/7NI63rS62U @babi Que lista! 👏🏼👏🏼👏🏼 RT @recordtvminas: 'Não seria metade do que sou sem Romeo', diz @marcosmion sobre filho ❤️\n\nhttps://t.co/rjogkG9Y0u Acabei de ver no @jimmyfallon que 6 anos atrás o @TheNotoriousMMA (Connor McGregor) trabalhava como assistente de encanador!!! S E I S anos atrás!!! EUA é de fato a terra das oportunidades... ❤️❤️ https://t.co/6HSz3hvmuY RT @revistatrip: Marcos Mion (@marcosmion) é um dos principais apresentadores do Brasil. Na conversa com o #TripFM, ele fala sobre paternid… @barbaraquidute PARABÉNS BA!! Tudo de melhor sempre!! Que Deus te abençoe!! Sobre ontem! Presente de bday pro Tefo!! ❤️❤️ https://t.co/QF7twdiKRr Vídeo novo ♥️ https://t.co/YRIYec3TRu @evelynrianne Hahahhahahahaha RT @NunesHayanne: “Quando os homens entenderem que a felicidade individual não é mais importante do que a instituição da família, do que os… @MarianaBelem Mari, eu não assisto a nada que seja sofrimento ou desaparecimento de crianças, mas ouvi que esse valeria a pena o sofrimento. Vale? Será que os moleques de 16 anos que escutam Racionais hj em dia tomam o mesmo choque na carcaça que minha geração tomava? As mesmas musicas tipo Pânico na Zona Sul, Hey Boy até Domingo no Parque...será? Detalhe da decoração do meu escritório! @StephenCurry30 💪🏼 https://t.co/N9M3pdsbU5 Atenção galera que mora na Itália!! https://t.co/FGhGuzFuIS @chicobarney 😂😂😂 Esse thread eu vou guardar!! 🧡 https://t.co/y1opbHlKJS Olha só o que o @rafailhaoficial tá armando pra comemorar a nova fase!! Boa sorte Rafa!! Deus abençoe!! https://t.co/LNDvilUYiT @ellydriver Faltou! O Léo arrebenta na escolha do repertório!! O Cazuza que ele mandou hj foi pra arrepiar a alma! #TheFourBrasil A qualidade do @TheFourBrasil é impressionante! Fora que é lindo de assistir. Tenho orgulho de ter participado um pouquinho desse palco! Ontem gravei participação no novo reality da @recordtvoficial - o @TopChefBrasil com o parceiro e renomado chef @felipebronze - foi das experiências mais loucas. Minha boca não entendia nada do que tava rolando...cada mistura improvável de comida...mas mano, tudo DELICIOSO! https://t.co/acGgAtan8w Um dia únicos canais de Youtube que assisto a tudo e recomendo de olhos fechados! Nostalgia do @FeCastanhari 👏🏼👏🏼👏🏼 Escrito na lousa de uma classe de aula! Isso sim é fazer um trabalho relevante no YouTube! https://t.co/lesmvSuhpG @FeCastanhari É por essas que te falo o quão revelante está sendo a história que vc tá construindo! 👏🏼👏🏼👏🏼👏🏼 Como meu cabelo era liso?!? https://t.co/16k7DUlkSy HAHAHAHHAHAHA!! Poxa, eu poderia ter puxado o parabéns se soubesse!! Parabéns @majubarbarini https://t.co/MbSeApNULQ Bom dia!! Tá rolando a premiação do @jornalextra e eu to concorrendo como melhor apresentador 🙌🏼\n\nSe vc curtiu a Fazenda10 e tá ansioso pela 11, vota lá?🙏🏼\n\nhttps://t.co/Q3IOUsTqUd God gave rock n roll to you 🤘🏼 Put it in the soul of everyone - kissonline \n.\n(Deus deu o rock n roll pra vc🤘🏼E colocou na alma de todo mundo) https://t.co/E7A64W4dPM É amanhã!! https://t.co/fxLoFlcaal Vas... Quero dar parabéns pra @maisa 👏🏼👏🏼👏🏼 Ser uma child star e crescer sem sair dos holofotes e sem ficar muito louca é uma em milhões! Soube que a estreia do talk show foi um sucesso! Que Deus continue te abençoando Maísa! Cabeça no lugar pq nossas crianças precisam de exemplos! 🙌🏼 RT @aliceassad: Eu sabia de algumas coisas da vida dele, morria de rir com os Piores Clipes do Mundo..Nessa entrevista para @tripfm, @marco… Caramba! Eu postei esse vídeo, apaguei pq queria desenvolver mais a ideia, mas acabou que alguém pegou e tá rolando geral pelo wazzap, por aqui...que bom que mesmo incompleto ajuda a reflexão! E está cortado, não tá indo até o fim! Mas vale!! https://t.co/KG3oe4qdSx RT @notfakeDaniel: #tbt Primeiro programa de jogos de improviso da tá brasileira.\nHá exatos 10 anos estreava o programa que mais rasga figu… RT @DrkGustavo: Eu acho o @marcosmion um baita profissional, desde a época da finada MTV. O que vc der na mão dele, o cara faz muito bem fe… RT @dinhapace_: @marcosmion the real show man da tv brasileira, estrondou demais ontem no #TheFourBrasil ... O melhor apresentador da TV br… Adorei essa! https://t.co/Hj5zGRqNWl RT @Silvana_Lino: Só acho que @marcosmion é o melhor apresentador que temos atualmente! 👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽#TheFourBrasil Kkkk! Ouvi que nasci fazendo o Legendarios, a Fazenda e agora o TheFour! Kkk! Nasci fazendo muita coisa! 😄 https://t.co/CaQXeXgdzb Ow!!! 😳😳 Sou jovão, ow!! https://t.co/K67OP3rvHO RT @_EstherKimmy: Bela Surpresa!!!\nMion é Blaster Versátil!!!\nArrasa, @marcosmion \n#TheFourBrasil Tirando o Brasil Urgente eu faria qq um dos citados! Kkkk! Imprimindo meu estilo claro🤘🏼 https://t.co/8RVX07rDPu 🙂🙂 https://t.co/bTEEWScZ9Y Obrigado Derek! 🙌🏼 Confesso que no palco é onde me sinto melhor! https://t.co/ldnUxqsZ39 E começou o @TheFourBrasil 🤘🏼 https://t.co/7YEv1u3zBY Twitter é que nem casa da avó! Pode estar ruim em todos outros lugares mas aqui tá sempre funcionando e somos sempre bem vindos! HAHAHAHAHAA! Adorei o complemento! https://t.co/8183j1c8cn Tava com saudade do palco! Da plateia! Da música ao vivo!! Nao percam! Hoje as 22:30 na @recordtvoficial  - @TheFourBrasil https://t.co/trxZl0Svha AMO quando me acham parecido com o Stallone! Só tem que avisar ele...kkkk https://t.co/rhi2Eabrdw Amém! https://t.co/CMJ4okf1tq Hoje eu assumo o comando do @TheFourBrasil à pedido da minha amiga @xuxameneghel - espero ter substituído a altura🙏🏼 Na @recordtvoficial as 22:30! https://t.co/N0Q0rIkQj9 @chicobarney Então vc tá ouvindo a fase errada! Kkkkk! Excelente o @programapanico de hoje!! Parabéns @Danielzukerman e Emilio!! RT @babi: Brasil 2019 em uma imagem: https://t.co/3OiF8qGfDM @babi 😄😄😄 @GameTime_BR Não quebrou tornozelo, NAAAO!! Fez um bom crossover, mas nem de perto quebrou as juntas do GOAT! Em 10 temporadas que o Jordan jogou é o único registro de um bom drible em cima do mito! Tem overhype nesse drible! E eu tb sinto falta desses chutes de meia distância...🙌🏼 RT @TheFourBrasil: Atração será apresentada, excepcionalmente, por @marcosmion na próxima quarta-feira (13) e promete muitas emoções entre… Sempre um prazer Paulo Lima! @revistatrip @revistatpm https://t.co/DMx3vtxBnr Rapaz...hoje de “Santa” a mão passou longe!! 🤦🏻‍♂️ Tamarrado o bagúio! \nAe @NBABrasil preciso de uma motivação! Me leva pro celebrity game do all star do ano que vem? https://t.co/387422EO3x Um recado para todas adolescentes que sofrem abuso, tanto sexual quanto psicológico: a culpa não é de vcs! Não tenham medo, nem vergonha...DENUNCIEM! Tem muitas outras sofrendo a mesma coisa, vc não está sozinha! Vá até a delegacia. Procurem ajuda. Quando eu juntava com meu jaco de aquecimento do Dream Team e o Jordan 6 no pé eu era um boymaster pronto pra ser assaltado na Rua Augusta! (Sim, aconteceu comigo. Puxaram minha bombeta do Bulls da minha jaca! Puxei de volta e sai correndo gastando o Jordan 6 no asfalto! Kkkk) https://t.co/zh0Ry6hF4q Charlotte Hornets! IRADO!! https://t.co/B8PcnK2yRM Eu sou da época que a coisa mais legal que vc poderia ter era um boné original do Chicago Bulls! #CriadoNos90 @NBABrasil Pesquisa rápida: O que é empoderamento pra vcs? @OCriador Hahahahah!! E nem expia a culpa por ser hater em perfis de celebridades! 😂😂 - é regra: falou besteira nos comentários, tem algum “escolhido de Deus”, “abençoado”, “...é meu pastor”, etc...na bio!! @rafailhaoficial @aline_kezh @SoniaAbrao Faz os 3 mano! ❤️ Continuo acreditando que deveria ser adotada a lei que permite todo ser humano a dar um soco na cara de alguém por mês. Estou em choque. Que notícia completamente absurda acabei de ler...meu coração se desespera com o sentimento de um pai imaginando sua filha numa situação criminosa e completamente sem sentido como essa. Que esses dois vermes recebam muito mais que só a justiça. Que sofram. https://t.co/3yplkgmDS8 RT @SportsCenter: “You guys have no idea what MJ did for me and my friends growing up. ... I thank MJ more than he would ever know.\" \n\n—@Ki… @babi ? Era vc?? Kkkkk https://t.co/0jwl6yYX4r ❤️❤️ https://t.co/cfhT5L7Go2 6 anos sem Chorão...\n\nQue ele seja lembrado pra sempre e que sua música possa chegar para todas próximas gerações! https://t.co/YpbEQKOsCT @juzao Ahhh, a Flight Club.... Oba!!! https://t.co/4EzSDTzxql Fui flagrado por paparazzis beijando muito nesse carnaval! De língua!! https://t.co/j5fmQ8BDUD É sério que tá rolando carnaval?? \n\nA quantidade de informação com que tive contato, até agora, em relação a essa festividade esse ano é ZERO. #ToNoMato #Relax Sobre ser um bom pai nas redes sociais: https://t.co/L7L69rz1Wn Eu?? Hahahah! Quem que mantém um corredor perturbante em casa? 😂😂 assistam a esse vídeo! 😂😂 https://t.co/DJ7HWEVQsP Tem um minutinho? Vem conhecer a casa do @gustastockler ! Sim, é em 1 MINUTO!! \n\nClica aqui:\n\nhttps://t.co/Si1iGA4Yqx https://t.co/ajGWa3DBvX Dizem que o pior emprego do mundo é a pesca de caranguejo, não dizem? Quem decidiu isso nunca entrou no octógono contra o Jon Jones. Que pesadelo esse cara! #JonJonesNoCombate @UFCBrasil Jon Jones entrando no @UFCBrasil ao som de Queen é M O R A L! #JonJonesNoCombate Poucas coisas são tão engraçadas na vida quanto ver uma pessoa se acordar com um pum próprio que escapou! 😂😂 RT @crescer: Já leu a nova coluna do @marcosmion? https://t.co/MIGsw9iESd https://t.co/iIogMizOT1 @Rueifis @Trouva conseguimos?? RT @Trouva: Respeito pessoas que tem máquinas de fumaça na sala de estar. https://t.co/saoN49mqon \n@gustastockler @marcosmion Vcs pediram novos vídeos pro YouTube. EnTãÃão: TOUR EM 1 MINUTO NA CASA DO @gustastockler https://t.co/Si1iGA4Yqx\n\nUma das casas mais bizarramentes legais que conheci! 😂  \n. \nMe contem aí se gostaram e quais os próximos lugares que devo visitar. Lindo meu irmão japoronga! Meu irmão em Cristo! Deus é bom o tempo todo! ❤️ https://t.co/yDz7Xzmc1j Por causa do TBT que postei, hj juntou muita gente que escutava na Jovem Pan o “Torpedo” e o “Filé Mion”! Adorei relembrar! https://t.co/3xdhVSfzcX Da aquilo pra fora! Clássico. https://t.co/XwwrgoyAUg Quem ouvia o Torpedo ou o Filé Mion, meus programas na Jovem Pan?? https://t.co/1Yhtn4C9Js É...Green Book é um P**A filme. Não tava animado pra assistir e, se não tivesse ganhado o Oscar, eu não iria. Mas ainda bem que ganhou pq dai eu fui! RT @crescer: Já parou para pensar em quanto cada palavra e cada frase que você, pai, fala ao seu filho impacta a vida dele e determina o ad… A @ladygaga conseguiu fazer uma adaptação excelente do discurso do Rocky Balboa pra agradecer ao Oscar! #BalboaRules Hahahahaha! E estamos falando de uns 10 anos atrás!! https://t.co/GmT1G4NFcZ Faz sentido. https://t.co/wn1X5ykhBl RT @SigaPlayPlus: Fica a dica do @marcosmion hein! Se brigar, não use sunga 😂 \n\nMas comigo, no #PlayPlus, você pode assistir #ValeAPenaVerD… Mais um prêmio que A Fazenda tá concorrendo! Desta vez é o Prêmio Contigo. \nVota lá pra ajudar a reconhecer o tanto de feno que queimamos ano passado! 😄🔥🔥\n\nhttps://t.co/i7gltpyYz4 - “Papai, quando morre, a gente voa?”, perguntou o Tefo.\n- “Acredito que sim!”\n- “E ganha poderes? Tipo raio nos olhos?”, ele continuou.\n- “Poderes? Rsrs, não filho...”\n- “Mas então como que a gente vai esquentar a pizza lá no céu?”.\n\nBoa pergunta filho, boa pergunta!🙂 RT @naomassafera: Fui entrar no perfil do @marcosmion  no Facebook e estou transbordando de amor. Eu tô simplesmente apaixonada pela famíli… O momento que vc participa de um linchamento popular e virtual da vida alheia é o exato momento em que vc acusa o golpe que, ao invés de olhar, assumir e trabalhar seus próprios problemas, vc prefere apontar os dos outros. Isso é fraqueza. Cuide da sua alma, da sua evolução. RT @SigaPlayPlus: O papo de @marcosmion com @Junior_Lima sobre filhos é muito ❤. Se ainda não assistiu, vem comigo, no #PlayPlus, que eu to… Guardem essa Live pra assistir na hora do número 2 ou na hora do aeróbio pq vale a pena! https://t.co/QS8DBtkRyx @YgorFremo @babi @chevroletbrasil Hahahaha Tão feliz em ver o resultado do meu livro em tantas famílias!! Obrigado por dividir Osmar! \n\nE pra quem quiser comprar, o link é esse: https://t.co/bZhYjEVAZS https://t.co/TRliNfjCgZ 👏🏼👏🏼👏🏼👏🏼 https://t.co/zjNL7Vqnac Hahahah! Que lembrança excelente!! https://t.co/Xdzz8sWf7L RT @recordtvoficial: Fala aí, @marcosmion! A @fazendarecord concorre ao @shortyawards, o Oscar das redes sociais, e precisamos do seu voto!… Aaaoooo. A gente tá concorrendo ao #ShortyAwards, um Oscar da internet, com o projeto multiplataforma de “A Fazenda”. Bóra votar pra gente chegar com tudo nesse ano: https://t.co/mXTYLq1ejN https://t.co/FHL01cBxbs @HFilippo ❤️❤️ RT @bfiorelloni: Me tornei o q eu mais temia:\nA pessoa que passa o dia vendo os vídeos do @marcosmion cm os filhos dele!\nMds que família!!!… Quando vc tem os melhores seguidores... HAHAHAHHAHA! https://t.co/tb501bIKqM @FanaTeaser HAHAHHAHAHAHHAH! Xanananananananana joelhos, joelhos! #EntendedoresEntenderão O que fazer domingo de manhã? @Canal_do_Fale @SHAQ Me segurei na cadeira!! @EmiratesSupport sent an DM! 🙂 @NBABrasil @ESPNagora @SporTV Eu vou de LeaguePass! 👏🏼👏🏼 Nossa! Fiquei impressionado com o tanto de gente que entrou aqui recentemente! Eu entrei em 2009!! Só tinha mato aqui! E vc, entrou quando? @NBABrasil que horas começa o show hoje? E se amanhã a gente acordasse e não tivesse mais Twitter...o que vcs fariam? Quem acha que seria bom? Quem ficaria desesperado? Água de proteína! Novo produto da Midway!! Vc acha nos supermercados, lojas de conveniência, farmácias e lojas de suplementos! https://t.co/3YHKwNle9i TAAAALOKO! https://t.co/XGwakna8Q9 Insta?? https://t.co/VtSXqceZQp @RodrigoNeto07 Hahaha Postei pras pessoas que conhecem ele darem um toque do quão vacilão o cara é. Ainda acredito que algumas pessoas podem mudar. https://t.co/wr4KE2wx0W Filmaço! Tomara que seja representado no Oscar! https://t.co/BbfpMgZ2xH Nossa! Parece irado! https://t.co/iF87cpDBQ7 Essa série acabou comigo. Parei no fim da 1’ pq me identifiquei demais com o Jack e começou a mexer demais com meu psicológico... https://t.co/xUsGTE9OAq @og_phil21 Tb!! A gente convida, mas tem muita gente que não quer ir pq acha que não guenta o tranco. https://t.co/aSlpn7IimM 🤦🏻‍♂️🤦🏻‍♂️ Essas horas e o indivíduo destilando ódio e frustração pessoal pros outros...quanto vai demorar pra seleção natural eliminar essas pessoas babacas, intolerantes e do mal da vida da galera de bem?! #saco https://t.co/XRVEKg7PSa @OutlookFran Taloko!! Da pra assistir em algum lugar?? @ZivaPatriota Boa!! 👏🏼👏🏼👏🏼 @carlinhos1920 Abraço!!! Ela lançou CD novo?? Ou vc tá mandando um sk8er boy??? https://t.co/uoKU6BOe77 Affe...não tenho estofo pra ler um conto assim. E faz mesmo acabar bem pq de tristeza a vida real já tá cheia, combinado? 🙏🏼🙏🏼 por favor!! https://t.co/ZvavZWOcW0 https://t.co/rj8TRvd5SW Somos 2!! E o halftime agora tá bombando! https://t.co/pt6Y4P0GfF Recuperando?? Show monótono...não deu nem pra cansar! https://t.co/YMN2tJzxMH Adoro esse pgm! Kkkk! https://t.co/H5WfJSNt1R Weeeeepa!! Esse é teamtreta!! Esteira essas hora?!? Respeito! https://t.co/ziL1Nz1hzU VAAAI!! Termina que vc consegue!! Conto sobre o que?\nÀs vezes quando eu deixo pra escrever à noite o sono domina e eu começo a escrever coisas malucas! https://t.co/qmBk69aAWW Hahahha! Ainda tem um tempo!! Mas a gente vem com tudo! https://t.co/guDWQ0Br4c Tem alguém aí? Tão fazendo o que? Seu celular faz pipoca? Juro que o @gustastockler me ensinou que da pra fazer!\n\nClica aqui pra ver: https://t.co/CJHtADDW9T https://t.co/5zl75TNOVw Que casal se identifica com esse tipo de diferença??\n  \nhttps://t.co/UAx9Z8Q3Ff Se todas pessoas que se esforçam para gravar vídeos do Fabio Assunção alterado, se esforçassem para tentar ajudá-lo naquela situação, pode apostar que ele estaria bem melhor. É óbvio que o dia seguinte, vendo esses vídeos viralizarem é pior que qq bad trip pq é na realidade. Luiz Caldas é sempre bom!! Aí nesse Tweet tem link pro Piores Clipes que analisei Tieta com a mosca pousando nele, hahahaha, e o clipe novo!! https://t.co/y9K2q9lFn9 E mais uma vez, em um período tão curto de tempo, meu coração aperta o peito até espremer lágrimas em um espiral de medo e ansiedade que me fazem não conseguir pensar, ver imagens e nem lidar com o assunto. Uma voz muito necessária nos dias de hoje se foi. Pura tristeza. #Boechat @Cleidinha150490 @evaci_meneses E eu adorei!! Maaaano!! Isso é o que o Freddie Mercury queria dizer com “Show must go on”!! Paul Stanley é o cabra mais duro que já vi!! 😱😱 https://t.co/q6rDvIiMyQ RT @amaurigf: Reafirmando meus conceitos de pai e pondo-os em prática. Amo ser pai e principalmente #paidemenina .\nObrigado @marcosmion por… Hahahha! MUITO ALEGRE! Chorei, ri...fiquei sentado sozinho quando acabou até subirem os créditos! Imagina o berro que eu dei quando começou a tocar a música do Balboa pro Adonis??!! Arte pura, mano! https://t.co/e0dShoLVcg Meu Deus como eu fico nervoso quando o @SpiderAnderson tá lutando!  Mão gelada! Peito esmagado! Pelamor...seja qual for o resultado, Anderson já venceu por estar fazendo o que está fazendo! História sendo feita!! Caramba! Desde o Mike Tyson, só o @SpiderAnderson pra me fazer ficar acordado até essa hora pra assistir a uma luta!! VAAAAI ANDERSON!! Sobre a vida... https://t.co/KWd6UsJxrt Espero que tudo esteja bem! Fe em Deus sempre! Feliz por poder ajudar de alguma forma distraindo sua cabeça! 🙂🙏🏼 https://t.co/vjK236qZzH Tá acordada essa hora? Então deve estar de bobeira que nem eu vagando pela casa! \n\nHora boa pra clicar aqui: \n\nhttps://t.co/9iHKWbztd4 Cara...eu fico com o choro engasgado com tudo desse vídeo! Que herói! Que vitória!! E a comemoração no final...😭😭😭 https://t.co/yJ1xpFAlk8 🙏🏼🙏🏼🙏🏼 https://t.co/1pC5shu821 Hahahahha! https://t.co/vij9aQ0Jgn Que tragedia aconteceu no Flamengo...eu não consigo ver foto, não consigo saber sobre os adolescentes pq meu coração começa a entrar num parafuso de pânico...è muita dor ver uma vida ceifada dessa forma. Tão jovens, que o poder de Jesus se faça entender na vida dessas famílias. Hahaha! https://t.co/CoE4SCxdgm RT @s_zamar: Por mais @marcosmion no mundo, por mto mais dele neste insano mundo, por favor. @Trouva @HFilippo Hahahahaha! Sério...vc não passa no psicotécnico mano!! @Trouva Hahahah! È na sua casa?? RT @crescer: Já parou para pensar em quanto cada palavra e cada frase que você, pai, fala ao seu filho impacta a vida dele e determina o ad… Revelei a identidade do Tio Sérgio: https://t.co/9iHKWbztd4 😂 https://t.co/AzNljjnIdR RT @68segs: Está passando a entrevista do @marcosmion novamente, e a admiração que tenho por ele é enorme! A meta é ser um terço do pai de… @chicobarney Tenho boas ideias! 😉 Hahahhaha! Zero de dúvida que a Rully é quem vai ficar! Música certa! Tom perfeito! Jeito de cantar tipo é isso p*rra!!! #TheFourBrasil - Parabéns Rully!! Ok! Pode tirar os four, transformar em The One e dar o programa pra essa menina que cantou Shallow! Ruly o nome dela? Não sei como escreve, mas já pode dar o programa pra ela! #TheFourBrasil @chicobarney Hahaha! Eu posso continuar na Fazendola quando vc assumir? O que são os cantores do #TheFourBrasil ???? To passado com os talentos que acharam!! Essa temporada vai ser choque na carcaça!! O #TheFourBrasil COMEÇOU ARREBENTANDO!! Medley de Queen com cantores incríveis que começam sentados nas cadeiras disputadas! @xuxameneghel está DESLUMBRANTE e mandando muito bem! Em frente a um cenário como ela merece! @pgmxuxameneghel É HOJE!! To muito empolgado pra assistir pq o que ouço de quem foi na gravação é que tá IRADO!!\n\nParabéns @xuxameneghel @recordtvoficial por mais um grande investimento na grade!! https://t.co/u8RV2eKlBO Subi no meu canal a versão na íntegra da primeira vez que meus filhos me viram sem barba! \n\nQuem gostou da versão Instagram, vai amar essa!\n\nhttps://t.co/9iHKWbztd4 Quem puder ajudar o link da Vakinha tá no Tweet! https://t.co/ZJD3EvWtoq RT @kiinhow89: Mano, oficialmente o @marcosmion é o melhor artista do mundo. Que cara sensacional. Admiração gigante por vc! RT @anagrasss: @marcosmion Que terna a reação das crianças! ❤️ Seus filhos são seres mesmo muito preciosos! ❤️\nSó queria deixar registrado… RT @HugoGloss: Amei! @MarcosMion tira a barba e surpreende filhos com resultado: 'É outra pessoa!' https://t.co/6cTKEKWFIt (Foto: Reproduçã… ❤️❤️❤️ https://t.co/ciBKobeS3Y Pra quem não viu:\nhttps://t.co/vqA8dMI3cy https://t.co/zB4wFU2UuA @EmiratesSupport Hello! I just sent a DM. Would love to hear back! Thank you! Aí vc simplesmente tira a barba, mas sua família reage assim! 😂😂\n\nOk...foi a PRIMEIRA vez na vida que eles me viram sem barba! 😂😳\n\nHoje eu posto o vídeo mais tarde! E vcs me contam a reação de vcs!! https://t.co/e5T66GbXoz Antes de vc ficar usando o hashtag #SuperBowl hj, assista ao vídeo de um minuto do @andrevasco explicando o que é esse evento! Vídeo importante pra vc que acha que hj é só “o dia de ver o marido da Gisele”! 😂😂 \n\nhttps://t.co/cjs8faLrju @poetaoperario_ Obrigado pelas palavras! 🙏🏼 Link pra comprar meu livro: \n\nhttps://t.co/bZhYjEVAZS\n\nChega na porta da sua casa!! https://t.co/dtwDqiawhe Mano...hoje meu sonho foi L.O.K.O!!\nSonhei que eu e o @TiagoLeifert fizemos um pacto: eu entraria no BBB e ele na Fazenda!!\n\nEu fui! Passei uns dias lá, não lembro o que aconteceu que eu sai e quando era pra ele entrar na Fazenda eu acordei. Sacanagem.😒 RT @aragaoluizas: Se tem uma pessoa que eu admiro é o @marcosmion! Tudo que ele fala, as ações, a família, os trabalhos... Sério... não sei… @NBABrasil @Giannis_An34 Nem com taco de baseball! Tem que fazer montinho!! Quanto mais vc acredita na vida que quer passar pelas redes sociais, mais vazio vc fica. Única coisa boa é que um dia o tombo vem e a pessoa aprende. Única coisa ruim é que pode vir de forma violenta. Eu só faço o que todo pai deveria fazer! 🙏🏼 https://t.co/DyApxo01i3 RT @cassimiro_22: Chorei vendo o post do @marcosmion fazendo a barba do Romeo..\nComo já nao bastasse, entrei no perfil e vi os destaques..… Mitos!! 👏🏼👏🏼👏🏼❤️❤️❤️ https://t.co/kzlLjplVCl Eu ia AMAR!!! https://t.co/tfutGYWTdN RT @Keilaj: TV aberta bate recorde no Twitter: 31 bilhões de visualizações https://t.co/uxp4VjmDL3 via @portalR7 #AFazenda @marcosmion @rec… E que assim seja! Amor sem fim! Amor pra todos! Amor, sempre amor! https://t.co/PCNgAXazsT @RickMonacoRet Hahaha! Essa é pra quem viveu mesmo!! RT @SigaPlayPlus: De qual paizão será que o @MarcosMion está falando? 🤔 Vem descobrir no #PaisDaNovaEra, aqui no meu catálogo! #PlayPlus\n\nh… Vince Carter foi uma das coisas mais animais que já vi jogar ao vivo!! https://t.co/t9JIoTArz9 @ELIZABETHRUIVO Sim! Por isso mesmo sempre separo tenis pra doação. Quanto mais eu comprar melhor, pois mais vai ter pra doar depois. Pense nisso! Bj É inacreditável como a vida humana passa a valer nada quando é comparada com a ganância de algumas autoridades. Como que não consertaram essa barragem??!? Impressionante como no Brasil as autoridades só sabem remediar quando precisam aprender a prever. Que tristeza enorme sinto.. https://t.co/7OlXHdWXhG Tá com pouco tenis pra abrir aqui em casa...🤦🏻‍♂️😄 https://t.co/hkHlLMNrTc Tem que ralar! Kkk https://t.co/XQCZsmIoFb @lucasfresno @manugavassi @majutrindade Noixx! Desde a época que vc quebrava correntes! To relutando pra chegar a sexta, mas parece que ela vai chegar de qq jeito! RT @lf_ponde: Os jovens de hoje são \"poupados\" de qualquer responsabilidade moral. Uma catástrofe em nome da vulnerabilidade. Uma geração i… Aqui, ali...4:52am é zumbizeira por todos cantos! https://t.co/NRnPdBBLqZ Hahaha! Vai ficar direto até a 11? https://t.co/qMUYHKx7dV @sheneider_drew O que é Orange? Me lembrou os grandes discursos da Dilma! 😂😂 https://t.co/hvKKHCo8TZ @nickcarter @backstreetboys Loved it bro! Waiting to listen to the whole thing, but the songs that are already out are FIRE!!! Quem aí ainda tá em ontem?? Ahhhh, num mexe com papai, molecada! Num mexe que papai leva pra escola e ensina como é que faz! 😂😂\n.\n#TBT de um programa que eu e a @DezMandamentos amávamos fazer e sei que a grande… https://t.co/JiI5X2y45Y Hauahauha! Esse vídeo vai ficando cada vez melhor! https://t.co/aausLG8j1j Hahaha! Pai é quem calça o pé do filho! 😂😂 https://t.co/fuOfT17aHq @victor6mendes @porquesimwill Enjoa não! Kkkk RT @SigaPlayPlus: É papai ou vai ser? A mãe do @MarcosMion deu um conselho pra ele, que passou pra mim e agora é de vocês ❤ Lembrando que t… Kkkk! Foi bom ver que não sou o único com saudades do Feno queimando! 😂😂 https://t.co/PH3sJq8d4u Como parar o coração de um pai desavisado! 🔥🔥😂😮 https://t.co/R6UONRKJSH Temporada de ski! Eu e minha gata! Alpes franceses! (Minha orelha caiu depois dessa foto). https://t.co/vi0YbpJuO6 Minhas filhas tem perfil no insta! É @pankekaepipokamion - segue lá!! https://t.co/RLQ0VeVzFD Hahahha! Adorei fazer o Fred! https://t.co/IjY87wZojx @santoEvandro Buzuzi! 😂😂😂 RT @PretaPereira5: @marcosmion \nDesde sempre sensato!!!\nSou muito sua fã!!! https://t.co/qBKN4DbS4T RT @DaniloMessias18: Todo pai de menina deveria ler esse livro, parabéns @marcosmion bom demais 👏🙏 https://t.co/kPunxr32da Obrigado queridos @areavip pelo prêmio! Fiquei MUITO feliz! E obrigado meu querido Evandro Santo pelas palavras! ❤️ https://t.co/fArVeRRIaS RT @SigaPlayPlus: Bora ver esse papo emocionante do @marcosmion com o @Junior_Lima e conhecer o lado paizão do músico? Só vem comigo, no #P… Filme é Pânico na neve!! Kkkk https://t.co/AnYck8bijy Alpes franceses! \nPq meu nariz é tão longe do corpo...por que?!? Só falta pendurar uma estalactite dele! 😂😂 https://t.co/hTZTwXEL3f Obrigado por esse post! https://t.co/PFLSEzTDP8 @brogui Hahahahaah @S_boaventtura @marcostovazi Sim! @chicobarney Kkkkkk RT @_therafa: Eu lembro do dia que a Rihanna estreou na @MTVBrasil com o clipe de SOS. Foi num programa à noite. \n\nO @marcosmion em 06 diss… @Martinhaguedes 👏🏼👏🏼👏🏼 RT @vanessaarnez: Nunca fui fa ou acompanhei a carreira do @marcosmion mas essa semana me deparei com um texto dele sobre Deus e chorei! E… @brogui 😄😄😄Calma que logo menos tem Fazendola! E o Tiago é demais tb!! RT @sarubo: 43. Quem assistia o @marcosmion na MTV entende perfeitamente a audiência de \"A Fazenda\". O \"Piores Clipes\" era um programa absu… Tefo viu dois vendedores tocando o piano do filme BIG, eterno clássico da minha infância com o tomhanks , na seção de brinquedos da @Selfridges e pediu pra ensinarem ele.\n.\nJURO! Sem… https://t.co/tJc2H2i7F8 O making of dessa foto que postei no meu stories foi hilário! Minha gata, Dona Suzana, saiu correndo fazendo o George tomar o lugar do John com medo de um carro que não queria esperar… https://t.co/lJFYVwSPqi E então, depois de quase 14 anos de casamento, me ajoelhei na frente dela e pedi: “Faz a pose de quebrada comigo?” 😂\n.\nDona Suzana esperava joias da coroa, drinks e rooftops, realeza e… https://t.co/BKO3UviD71 Ouch! 😖\n.\nTour completo pelos estúdios originais do harrypotterfilm  aqui em Londres, onde os atores moraram por 10 anos filmando toda a série no meu stories!! Cenários, sets, tudo… https://t.co/KpYdAGIHO1 RT @Tatadoleko09: Vocês tem que seguir o @marcosmion.\n\nMeus entendimentos sobre autismo e filhos mudou muito. \n\nEssa cara é demais! Nem eu lembrava disso! Kkk https://t.co/P2mRyVSaM7 RT @munhoz_mariano: Tar do Tebetê do programa do @marcosmion cantando #Palpite 🎶 Quem gosta dessa? #TBT https://t.co/WTeBURzn5X @kasales8613 Uma semana de antecedência é uma boa data!! PARABÉNS!! 👏🏼👏🏼👏🏼 Que Deus abençoe e que seus sonhos se realizem!! Muito merecido! E vem Oscar!! https://t.co/PcoOol53T0 To gostando demais do raciocínio e sacadas que o @nealbrennan separou pro seu especial de stand up da @NetflixBrasil ! Vcs já viram? Ele trabalhou com o Dave Chapelle entre outros materiais de muito respeito! Ele separa o material em 3 microfones... RT @JoniGalvao: Rir assim é pra poucos. 2019 começa com uma novidade: Aprenda com o mito Oscar Schmidt como conduzir o seu “JOGO DA VIDA” -… Concordo! @pandabooks https://t.co/9QAr09HTlg Sou eu! Hahaha! Uso no meu avatar há anos! https://t.co/623djhNXOk Muito! Meus filhos ficaram em choque que nao foi baseado em mim! Eles achavam que tinha sido! Hahaha https://t.co/GdX1jaXkXB @HFilippo @Trouva Hahahahaha! Depois de um mês!! Que noia! @chicobarney #referencia E ai?? Como começaram o ano? Alguém já pagou mico? Me contem! Quero saber! Hahahaha O que vcs fazem hoje?! Sempre fico na dúvida se vc faz do dia 1/1 um dia normal ou libera tudo...o que vcs acham? Meu irmão japoronga!! Te amo mano!! Conta comigo sempre!! Que Jesus nos abençoe! https://t.co/rR5dz9bMWX A melhor coisa de 2018 foi... (complete a frase!) RT @gabizinhaduar_: Estou escutando aqui na rádio  a reprise sobre o tema pai de menina e @marcosmion é um pai muito incrível  um pai excel… ❤️❤️ https://t.co/skRrz51EI4 Pra ouvir a entrevista enquanto estiver no banheiro! Faça da próxima ida, uma util!! https://t.co/eZl62pIKwS Quantas mais séries sobre assassinos seriais e políciais e agentes resolvendo um assassinato ou conspiração ainda podem fazer?! Uma parte dos meus agradecimentos diários resumidos em uma foto! https://t.co/vytZ0MXyBq RT @gusperossi: uma descoberta excelente do fim de 2018 é que os stories do @marcosmion são muito bons E essas pessoas que saem pra passear com os cachorros e levam eles no colo? Quem não ouviu na primeira vez, atenção pra reprise!! Um prazer @petriachaves 😘 https://t.co/jy9bpHkywI Como estão as preparações pra entrar em 2019?? Já refletiram sobre o ano que passou, traçaram metas e planos pro futuro ou por enquanto só querem salgar o bacon no mar e encher a jaca de pinga?! 😂😂 Um profissional de comunicação precisa conseguir unir as duas características principais para fixar um público a longo prazo, que vai crescer com ele: SIMPATIA e EMPATIA. Isso demora a vida!\nEm inglês fica fácil de entender:\n“I like him” é simpatia. “I am like him” é empatia! Hoje é bday da minha querida amiga @WanessaCamargo 👏🏼👏🏼 E pra comemorar vou lembrar quando revelei o OUTRO LADO dela no palco do Legendarios! De longe um dos momentos mais legais da nossa história!!\n\nhttps://t.co/MOBQBfO1tS via @YouTube Derren Brown é o cara mais legal da @NetflixBrasil !! Deem um busca! @HFilippo Canta pra ele: “AAALOOOOOOOO” se ele sorrir e completar a canção, pode casar! @HFilippo E farofa? E os dois juntos?? Affe. @TWDBrasil Essa deu pra voltar a curtir. A passada me perdeu. Acho que eles entenderam que não da pra ser uma série que “embarriga”. Pq foram perdendo público no momento que foram enchendo linguiça. Eu era viciado e parei. Mas ainda bem q retomei pq essa season tá muito boa! RT @Emais_Estadao: 'Criem memórias que vão enfeitar a vida adulta das crianças', diz @marcosmion sobre festa de Natal https://t.co/wp08cRPL… RT @Adoro_Barracos: Meu filho e minha netinha Manoella curtindo muito o presente de NATAL q dei. Obrigada @marcosmion amamos 💞💞 e recomenda… E quem quiser assistir aos vale a pena da Fazenda 10 assina o @SigaPlayPlus !! Fiz até da cena da expulsão da Nadja!! https://t.co/BEeKzCB0af Graças ao YouTube! https://t.co/BEeKzCB0af Golden State de amarelo e Lakers de roxo?? Bugou a cabeça! 😂😂 #NBAChristmasDay #NBAnaESPN https://t.co/k7EUVuXkMB Família ❤️.\n.\nToda noite antes de dormir faço a mesma pergunta pros 3:\n“O que é família?”\n.\n- “A coisa mais importante da vida”, eles respondem. T O D A S as noites. \n.\nEles vão ter isso… https://t.co/TNZyh8ugmR Uma reflexão de Natal para pais, mães e todos envolvidos em melhorar a próxima geração...\n.\nVejo muita gente buscando Jesus Cristo como uma forma de se regenerar, de ter o perdão, de se… https://t.co/WZDKn5rA6o RT @Emais_Estadao: @marcosmion se emociona com apresentação de dança do filho https://t.co/a5K447Ge7R https://t.co/5xX9s6xxue A 9 TEMP acaba no episódio 8?? Não, né? Me atualiza, please? https://t.co/4YsEIXAu6L RT @carasbrasil: Marcos Mion se emociona com apresentação de dança do filho, Romeo: \"Quanto orgulho de você\"\n\nhttps://t.co/s8NJFu1r1i Que honra pra mim ter seu reconhecimento Gilberto! 🙌🏼 @GDimenstein https://t.co/CcbTIbcyFg Trocando aquela ideia com meu mano Noel sobre esse ano loko, de baixos e altos, sonhos realizados, alegrias e tristezas ... como tem que ser!\n.\nO que importa é que estamos vivos e… https://t.co/UAnB8dOi62 2:00 am e eu aqui maratonando a temp 9 de @TWDBrasil The Walking Dead. Acabei de assistir “àquele episódio”...mano...taloko. RT @SigaPlayPlus: Arlindo Abdalla, o paizão do João e da Ana, contou para @MarcosMion como foi descobrir que a filha tem Síndrome de Down e… @Edmusicvibe Velha guarda sempre tem meu respeito!! Noixxx! RT @thiagohanney: O @marcosmion cumpre uma função social incrível ao falar sobre paternidade nas redes sociais. Obrigado Denise!! Te desejo tudo em dobro! Obrigado pelo carinho e pela parceria nos 3 meses de Fazendola! https://t.co/m952aFvCCJ ❤️❤️❤️Lembro muito desse! Abs Honório!! https://t.co/j085sF7aUZ Primeira experiência de colocar um programa do @SigaPlayPlus na tela da @recordtvoficial 👏🏼👏🏼 Prestigiem pra dar moral pra minha criança japonesa preferida, o @YudiTamashiiro 🤘🏼 Boa sorte YudiSan! BANZAAAAAI! https://t.co/Djg77Aq4rq @FeCastanhari ❤️❤️❤️ RT @FeCastanhari: Inclusive, muito obrigado por ter tirando um tempo pra validar nosso texto, uma honra enorme pra mim, sou seu eterno fã M… Aeeeee!! Boa @Martinhaguedes !! Rexxxpeitem as pedras dos amigos secretos da Record! 😂😂 https://t.co/KetlDRszMp RT @nanda_ferraciol: @marcosmion @renataalvestv Você merece todos os elogios... tenho orgulho de ser sua fã desde a época dos Piores Clipes… Né?? Dei uns porta copo de pedra loka envolto em ouro!! Mais o bagulho de colocar livro! Não é que nem as pedra Lua de Cristal que Xuxa ganhou! Kkkk https://t.co/rX8tDO6zKj Adriana, vc é parente do Supla? Do Molejao ou do Chico César? Pq tinha raiva de mim na época do Piores?? Kkkkk! ❤️ https://t.co/vwOX0Eon8g Publicamente não, mas o @FeCastanhari pediu minha ajuda pra validar o texto desse vídeo, o que eu fiz com muito prazer! https://t.co/TYLYComwIA Hahahaha! Todo mundo quer gongar os presentes do amigo secreto da Record! Ano que vem eu vou dar meias!! E tomara que eu ganhe uma viagem com tudo pago! Só pra manter o espírito do mico acesso!😂😂 https://t.co/oyVpAQiQ7p Que ano!! 🙌🏼🙌🏼\n.\nMais uma honra para mim, mais um prêmio de melhor apresentador! Desta vez do @sitenatelinha 💪🏼\n.\nMuito obrigado a todos que tiraram um tempo de suas vidas para me… https://t.co/y0Guf6tp3x @_brunasousa96 Eu amei seu Tweet!! Obrigado! E não poderia ter entrado em hora melhor! Bjo! Fica com Deus!! Por isso choro de emoção quando alguém diz que to parecendo o Stallone! ❤️❤️ https://t.co/99rDv1gJ3b Eu P I R E I!! https://t.co/fNoJVCL60d ❤️❤️❤️ https://t.co/88RDC5o67u RT @izadoragazon: @marcosmion é um ser humano incrível, coisa rara de se ver hoje em dia. Sou fã até morrer #FamiliaRecord #AmigoSecretoRec… RT @SigaPlayPlus: EXCLUSIVO 😂 @MarcosMion conta que Roberta Piza bateu no seu carro no estacionamento da firma! Vê se pode 😂 Continue ligad… Hahahaha! Não me gonga! Um jogo completo de porta copos de uma pedra que vale meu rim e mais um porta livros que vale o resto dos meus órgãos! 😂😂😂 https://t.co/rIxfm8lr5L Era um dos meus jogos preferidos no Legendários!! https://t.co/JyLjWmSIst Obrigado querida @renataalvestv pela descrição! Vc realmente sintetizou o eu tenho de mais rico; que se tornou minha maior característica! E eu A M E I os presentes!! ❤️ https://t.co/kXThSWbnm1 RT @JoseluizModel: Ansioso demais pela segunda parte do @FamiliaRecord de hoje. Pra mim o programa é muito divertido principalmente pela pr… Que ano abençoado! Mais um prêmio!! Agradeço a cada um de vcs pelo carinho e reconhecimento! E m especial a todos que votaram! 🙏🏼 Obrigado @sitenatelinha https://t.co/ceqqKbgTGv RT @MarianaCoelho_: Ai genti nao acredito que nunca tinha ouvido essa musica, fui olhar a cifra agr e não resisti.... completin aqui entao… Vai!! Polêmica do Família Record! Quem aqui sabia que o César Filho chama Luís Gonzaga na verdade?!? Quero ver! Quem olhava pra ele e pensava: “Gooonza”!!! 😂😂 Por favor votem em mim em mais esse prêmio! Em nome da Fazenda, dos maluco e de Itapecerocks!! É rapidinho! Concorro em 2 categorias!! Melhores do Ano NaTelinha 2018  https://t.co/VyCWxxfu73 @HinniWolf @RodrigoFaro Hahahaha Ae @RodrigoFaro eu apoio essa ideia!! Hahaha https://t.co/bIOXLyQ4a6 Kkkk! Faz parte! Na real foi muito bom ficar sentadinho e assistir de camarote meu amigo @RodrigoFaro dar um show de carisma, timing e agilidade! 👏🏼👏🏼 https://t.co/8fCfVJVwSu Hahahahahahhahahaha https://t.co/ttPxBtB1Um RT @seriesemcena: .@marcosmion foi um dos ganhadores do #DigitalAwards2018! https://t.co/TOpiSHObQv Hahahahhaha! M E L H O R momento da 1’ parte do #FamiliaRecord 😂😂 https://t.co/je8B9SfMmh Um dos meus micovers preferidos!! https://t.co/4NKmCnSRiD RT @Rafaela44331904: @marcosmion Ontem assisti pais da nova era ,Naum tenho filhos mas chorei mto em TDS os episódios kkkkkk parabéns @marc… 😄😄😄 “AOOOOOO”!! https://t.co/xvmgeINgQc RT @MikeFoxx4: Temos o melhor apresentador do ano!?\n\n#CantaComigoEspecial | @marcosmion https://t.co/DldRzjLBFY 🙏🏼❤️ https://t.co/0JJu5OEhSJ Hahahha! @FabioPorchat De Lara! 😂 https://t.co/3LW2ZLzms9 Primeiro dia de “férias” (apesar de ainda trabalhar até esse fds, só o que o fim da Fazenda tira das minhas costas, já é quase férias!😄), primeiro dia de pensar no futuro!\n.\nPra fechar… https://t.co/r4Gw53sGuf Fala Felipe! Obrigado pelo carinho! Mas olha, vale vc ler o livro! Falo muito sobre educação, criar filhos com caráter e confiança. Construir um elo eterno e isso independe do sexo! Só vc pular as partes exclusivas para meninas! Tem muito material pra pais de meninos! Abs!! https://t.co/JXZFuH1Zcd Criando uma geração! Amém @professorigor - muito feliz com esse post! 🙂 https://t.co/sZBMeO9ZtL Esse vídeo é pra agradecer a todos que tiraram um tempo pra votar em mim, me concedendo este prêmio pelo SEGUNDO ANO CONSECUTIVO! 🙏🏼 \n.\nAgradeço tb aos críticos que, como disse o Stycer,… https://t.co/nzo4eEBAGS Obrigado querida Cris Padiglione! @sitef5 https://t.co/BMppFcMZnB Ju!! Parabéns linda!! Que Deus te abençoe e todos seus sonhos se realizem!! Obrigado por todo carinho de sempre! ❤️ https://t.co/Af5thVewCp Melhor imagem do dia!! Parabéns a esses caras!! 👏🏼👏🏼 https://t.co/FI5gzMsMiB Odeio pessoas que ofendem disfarçando que estão elogiando. São as piores. É muito amor pra mim! 😊😊😊🙏🏼🙏🏼🙏🏼 https://t.co/8mzTWeVtor Hahahah! Vivi pra ver a melhor comparação da história! ❤️❤️❤️ https://t.co/bJIYm1gg4v RT @SigaPlayPlus: No Pais da Nova Era, @Junior_Lima conversou com @MarcosMion sobre o uso de tecnologia na vida do filho, o pequeno Otto. E… Se vc tiver 5 minutos agora, clica no link que tá aqui embaixo no Tweet do @FeCastanhari - e ASSISTA! Temos que apoiar conteúdo inteligente e bem feito no YouTube! Esse moleque é a melhor coisa do YouTube!! https://t.co/I4OvIOfiiy Parabéns pelo livro, pelos posicionamentos e pelo lindo e profundo relato resumindo seus 38 anos de vida intensa @gisele !! Adorei! Que inspire muita gente, assim como me inspirou! https://t.co/3f6de97ZlK https://t.co/q7F5AC5ARo Minha opinião sobre o resultado final da Fazenda! https://t.co/DNHorUojFi Obrigado Leo!! Fiz com muito carinho essa série! 🙌🏼 https://t.co/GrKG2chp7r Quem quer assistir ao vale a pena ver direito que fiz sobre a cena que resultou na expulsão da Nadja? Colocaram exclusivo pros assinantes do @SigaPlayPlus https://t.co/yMlPSq0ma1 Lohan, tá falado! E ganhei o dia, viu? 🤜🏼💥🤛🏼 https://t.co/9mx4M6SyET @Martinhaguedes Kkkkk!!! S2 RT @RecordTV_press: Na noite de ontem, 13/12, a final de A Fazenda 10, que teve Rafael Ilha como vencedor, alcançou o melhor resultado desd… Eu tb! Kkk https://t.co/1jaEQZL3Kw @gabieraposo ❤️❤️ Obrigado @brogui ❤️❤️ https://t.co/xTu6yes0u4 Hahaha! Que Tweet incrível!! ❤️ https://t.co/4UFzNPaHLH RT @pcarvalhojp: O @marcosmion deu show tão show que a nossa tag de hoje é #GuedesChamaoMion https://t.co/Z1sM7dR7yN RT @cacacomenta: Mion todo emocionado agradecendo a Record pelo presente que foi apresentar a Fazenda. Sério, eu acho que nunca vi um apres… Hahaha! Eu só quero dormir! (Tuíta ele as 4:30am...) https://t.co/a1DujPSvoO RT @HerminiaRohen: @marcosmion Na boa? TODOS os apresentadores da @fazendarecord foram MUITO BONS! O \"diferencial\" foi que o @marcosmion fo… https://t.co/L8CbF3pt1j RT @nasseroficial: A vitória dessa Fazenda com CERTEZA é o Marcos Mion!\n\nReinventou o programa, trouxe um novo gás e animou o reality do je… RT @fazendarecord: Que cena, meus amigos! @marcosmion e @ttmionzinho, os melhores! 🤠\nAcompanhe a #FinalAFazenda também no https://t.co/sJRe… RT @nasseroficial: OBRIGADO RECORD!\n\n“Vale a Pena ver Direito” é o que faltava pro @marcosmion terminar o programa com chave de ouro e ser… RT @mauriciostycer: \"Como disse Rocky Balboa...\" hahaha Mion é uma comédia #AFazenda MUITO, MUITO obrigado a cada um de vcs que acompanharam, deram risada, sofreram, choraram e estiveram comigo nessa temporada da Fazenda! Foi o puro fogo no feno! 😂 Não tenho palavras para tanto carinho e reconhecimento. Estou MUITO feliz! Que Deus abençoes todos vcs! ❤️ RT @MomentsBrasil: ⚡A 10ª edição da 'Fazenda' teve barracos e até agressões. Mas tem muita gente dizendo: o que mais chamou a atenção no re… RT @tvfoco: Marcos Mion encerra A Fazenda 10 com moral na Record https://t.co/4XAxGMKJw1 https://t.co/8E2Dt0axFT RT @nasseroficial: Mion conseguiu levar Itapecerica da Serra pro mundo, através da Fazenda!\n\nOs moradores de lá devem estar muito felizes!… RT @ttmionzinho: 13 Roças, 2 expulsões, tretas no ao vivo, ao vivo sem comunicação com o switcher, ao vivo com a lombar travada... Parabéns… RT @LexaOficial: Mion tirou muita onda apresentando a Fazenda #FinalAFazenda RT @FabioPorchat: O vencedor da Fazenda é o @marcosmion #FinalAFazenda Tão curtindo o Vale a Pena Ver Direito?! #FinalAFazenda https://t.co/F39LgrZF6j #FinalAFazenda no ar! https://t.co/lgVBtAydDl Falta pouco ♥️🔥🌾!!! #FinalAFazenda https://t.co/hQhmdc82Pb @Gabriel04856938 Kkkkk! Notei, sim!! 🙌🏼🙌🏼 https://t.co/HmhwBAQSyq SURPRESA! Hj à noite tem Vale a Pena ver Direito, SIM!! https://t.co/oDXCwQ1beT Muito feliz com o prêmio @UOL de melhor apresentador! Tanto pelo público, quanto pela crítica!! Obrigado a todos vcs! 🤩🙂 https://t.co/QLAAtdUBRS RT @Veronica41br: concordo \nele D + \nquero vê-lo um programa + família, mais sério q fale dos valores familiares q mostre mais quem realmen… @byTerraNews Hahahahah! Eu já vi gente mal caráter distorcendo a verdade pra ganhar click, mas vcs superaram todos!! Parabéns ao contrário pra vcs! Péssimos. Obrigado a todos meus malucos preferidos! Incluindo Nadja, Cátia, Caique, João e Rafael por uma temporada inesquecível. Vcs fizeram a “minha Fazenda” ser um sucesso!! 🙏🏼 https://t.co/NM3EdgjFNU 👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼 https://t.co/n22HOdc3dZ @DrigoMB Hahaha! Boa!! Eu tb... https://t.co/3M2cWs0PMb @vaidesmaiar Hahahahahhaha Galochas? https://t.co/HOXn7OHCK1 @reinanaprado Eu não sou responsável pela edição. Não sei te dizer! @CarmemO49160054 @DorotiBorges To aqui!! Bjs!!! RT @danieleoli: Esse elenco foi escolhido a dedo! Hahaha \nParabéns, @marcosmion  ! Sua estreia foi uma verdadeira uma prova de fogo! Kkkk… E o que tem de Danone vazio na frente do Chula?? Hahaha! #FestaFinalAFazenda RT @jeanmhurtyng: @marcosmion Voce merece @marcosmion ! Vc é um dos melhores apresentadores do mundo!👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼 To adorando o Sandro de defensor da Nadja! 😂 Cravando o nome dele no jogo aos 47 do segundo tempo! 😂 Tem que fazer valer a ida até Itapecerica!! #FestaFinalAFazenda @DorotiBorges Vi! Kkkk! Bjs Não foi por falta de aviso. Eles passam por uma preparação antes de entrar e contamos com a coerência e hombridade deles. Pena que alguns faltaram com o compromisso. Isso atrapalha o jogo, sim. https://t.co/HYo82PD5qo Quem mais queria estar nesta festa?! Como convidado?! #FestaFinalAFazenda @simone_imprensa Muito obrigado!! Fiquei emocionado! RT @simone_imprensa: O merecedor absoluto de todos os elogios nesta edição de #AFazenda se chama @marcosmion.Inteligente,,rápido ,carismáti… 👏🏼👏🏼👏🏼👏🏼NEM ACREDITO AINDA! 2’ ano seguido escolhido pelo publico que votou e esse ano ainda ganhei o prêmio dos críticos! Os dois!! MUITO OBRIGADO A TODOS VOCÊS!!! https://t.co/sdsdM9pGDq Kkkk! Gente...vcs viajam muito! 😂100 câmeras, microfone, uma equipe monitorando todos movimentos e todas falas e vcs ainda imaginam que uma carteira de cigarro é um celular...🤔 https://t.co/7pL0NLL8XK Daqui a pouco começa a festa e foi FOGO NO FENO TOTAL!! #FestaFinalAFazenda No intervalo comercial vou, como sempre, fazer uma live pelo meu insta! Fiquem ligados!! O melhor é que da pra assistir a momentos icônicos como esse pelo @SigaPlayPlus a qq momento! 👏🏼👏🏼👏🏼 https://t.co/EZv5xzrLlr RT @recordtvoficial: Não perca o especial #OFinoDaBossa nesta terça (11) na tela da #RecordTV 😉📺 Luciana Mello e Pedro Mariano viajam no te… Kkkk! Eu evitei responder, mas o @mauriciostycer insistiu tanto que eu cedi. Mas já aviso antes que criem um terremoto disso q eu apenas comentei as declarações do Justus q Stycer contou, pois nem ler eu tinha lido! @RobertoLJustus tem o direito de dar sua opinião e tudo na boa! https://t.co/XZTDOfbqrf Jaaaaaaaack! https://t.co/muz4sy7MF4 Muito, muito bom! Mas eu arrisco dizer que minha citação de Goku ainda tá em 1’ lugar na lista! Hahahha! Que venha o BBB com citações inesperadas no discurso de eliminação! @TiagoLeifert https://t.co/ytNoaGbpsA Sentirei saudades de Itapecerica! Obrigado Deus por ter montado o cenário de tv mais incrível que já trabalhei! https://t.co/29mvt7MHpw Kkkkkk https://t.co/HJEeCN4cEa RT @vaidesmaiar: Olha ele @marcosmion no O Globo de domingo https://t.co/X4Yn8qltXo Hahahaha! Eu só pensava que quando toca Madonna ele para de mancar, não é? 😂😂 https://t.co/k4jht6tvnF Isso!! Até quinta eu queria a plaquinha!! Poxa, seria justo! Aooow prefeitura de Itapecerica!!! Kd?? https://t.co/UpCNwKp9SF RT @fazendarecord: \"Cancela a prestação do carro que o papai não ganhou\" 😂😂😂 só você mesmo, @marcosmion\nAcompanhe a #EliminaçãoAFazenda tam… Atenção @TiagoLeifert !! Vc tem que preparar seu repertório, irmão! 😂😂 hoje encaixei, além do Tony Stark, o Rafiki do Rei Leão!! 😂 https://t.co/NXUqtavPzl Quem ? https://t.co/FrYOO7ETL8 #EliminaçãoAFazenda https://t.co/xDFL9peoCX RT @camilets08: Já to aqui vendo #EliminaçãoAFazenda Última eliminação!!! Quem sai hj da roça tripla???! #Elimimacao https://t.co/eMLxXKBu9a RT @Trouva: Aooo. Hj tem eliminação e consequentemente cabine de descompressão... Mandem perguntas pro Evandro, João ou Rafael aqui! #AFaze… Os peões que estão na roça já foram informados que a votação foi encerrada. Agora é observar qual será a reação deles no confinamento após saberem disto. Algo inédito na Fazenda! \nA promessa foi fazer uma edição diferente e uma última semana cheia de surpresas! Lessgo!!👏🏼👏🏼👏🏼 Quem ganha A Fazenda 10? https://t.co/ydwVq3ATZL Eu faço o máximo para não dormir. Mas na manhã seguinte tudo que eu queria era dormir mais...vai entender o ser humano. Votação encerrada! Votou?? Quem não votou o quanto queria fica esperto pq até a final na quinta vai ser uma surpresa atrás da outra!! Essa Fazenda 10 é realmente pra ser inesquecível!! Fiquem ligados TODOS OS DIAS!! Impossível assistir ao episódio de hoje da Fazenda e não chorar, impossível... #AFazendaSurpresas “Quando você começa a se ver como vítima, abdica do próprio poder e talvez seja difícil recupera-lo” - frase muito cheia de sabedoria que acabei de ler no livro da @giseleofficial 👏🏼👏🏼\n\nSEMPRE vale ler uma pessoa que é a melhor no que faz. No mundo! Na boa...esse vídeo é uma aula em tantos temas que tem que apenas ser compartilhado infinita vezes. Fez meu dia! https://t.co/yFswIs0zmE RT @mauriciostycer: E aqui uma entrevista com o dono da livraria e editora Martins Fontes https://t.co/D2n7xOog2n RT @KarinaSL: @marcosmion Minha alegria ao saber que vai ter #valeapenaverdireito A Fazenda. https://t.co/LpexNoyWvh Tentando recuperar o máximo que posso pra poder entregar pra vcs uma semana final épica e memorável da Fazenda na semana que vem! Deus me ajude e ilumine! ❤️🙏🏼 Uma micro rachadura no disco entre a L4 e a L5 na região lombar estão me dando uma mega dor de cabeça. Dores sem fim, limitações, encheu meu organismo de drogas pesadas (remédios)...e é só uma micro rachadura! A gente só da valor pro corpo quando ele quebra. Tem que mudar isso. O corpo humano é uma máquina perfeita. Nós não damos o valor que deveríamos para esta obra sem explicação que Deus criou!\nRespeitem seu corpo, seus limites, pq se quebrar não da pra comprar outro na Amazon! RT @recordtvminas: Quem você quer que fique em #AFazenda10? Vote agora: https://t.co/krvXIh4Ceh https://t.co/zgESfMBsgU Tá completona!!! https://t.co/a5VR73gXez RT @SigaPlayPlus: Não fique só na saudade, @marcosmion! Bora assistir a estes momentos no #PlayPlus 😎\n\nhttps://t.co/EXPnCu17uq \nhttps://t.c… Quem vai direto pra final hj?! #ProvaAFazenda https://t.co/P5NUOZO8AL Abecedário da #Xuxa Legendarios Edition no #tbt de hoje!\n.\nQuem aí lembra desses grandes e belos momentos?! 😂 https://t.co/933J9SdNvM Foi demais entrevistar o Cris Columbus, diretor dos primeiros Harry Potter, além de Esqueceram de mim, Goonies, etc...ele disse q sentiu sim uma pressão enorme dos fãs para não estragar o filme! Disse q teria q se refugiar se errasse! Eu acho que ele mandou muito bem! E vc? https://t.co/oeAKyvjchp Habana! Amo esse gif! Amo@essa cena! https://t.co/4h0e7BKBXA https://t.co/JJYrJSJ9RE Aeeeee! Finalmente!! Amanhã corro pras bancas!! https://t.co/fOuaD9LPRm O Alan tem uma vitalidade, uma intensidade de quem nasceu pro palco! É bonito de ver! #FinalDancingBrasil O Amaral é alegria pura! Excelente escolha colocar ele no programa!! #FinalDancingBrasil @isabelagmartin Sim, tava lá! Tá demais! Assista ao vídeo na íntegra, não leia apenas chamadas que buscam click e polêmica. Tirar uma frase de contexto e passar adiante como se a interpretação maldosa fosse verdade,não é justo. Disse q pela torcida da Nadja na web ele não ganha e ainda disse q tudo pode mudar.Imparcial. https://t.co/Eyw18MMu2r Eita! A @perolafaria chegou com intensidade, precisão e coreografia de vencedora! #FinalDancingBrasil D E M A I S a abertura da grande final do @dancingbrasil - Record arrebentando!! #FinalDancingBrasil RT @wbpictures_br: O @marcosmion acabou de visitar o nosso estande e participou do desafio de #Creed2. Vem pra #WarnerNaCCXP! https://t.co/… 🙏🏼🙏🏼 https://t.co/npSUVaC3i5 Obrigado pela parte que me toca! https://t.co/BK2Aug2H7g Cheguei! #CCXP https://t.co/76RWbncSzA Daqui a pouco to na @CCXPoficial mediando um papo ANIMAL... se liga! https://t.co/EkRaeevkBl 😄😄😄 https://t.co/9vTOWS0PUP RT @Ildemberg: O @marcosmion citando frase do Goku no discurso de eliminação, véi! É muito reizinho ♥️😁 #EliminaçãoAFazenda #AFazenda10 A final é uma roça. Duas pessoas encaram a votação popular. Isso que quis dizer. Impossível ganhar sem passar por uma votação popular. O DH foi campeão depois que enfrentou a “roça final”. Entendeu? https://t.co/CBV4JpRtZs RT @clau_mdasilva: Cara, eu só assisti essa temporada da #AFazenda10 pq soube que o apresentador seria o @marcosmion que sozinho já garante… Hahaaa! Vcs não prestam! 😂😂😂 Eu tenho que dar essa notícia de forma imparcial e tentando não chocar totalmente quem sai! https://t.co/oCUAFdyz7N Obrigado!! To melhorando...!! 💪🏼💪🏼 https://t.co/SwuxqPSwqu Nao é impressão, não! Eu falei isso na cabine até: eles estavam confinados sem saber de nada, tudo é um choque! Tem que ser gradativo. São ordens da psicóloga! Não da pra chegar e mandar tudo na lata q a pessoa entra em choque! https://t.co/SYn0ViR7V8 RT @SigaPlayPlus: Tá a maior choradeira aqui na #CabineDeDescompressão e até o @marcosmion está segurando as lágrimas 👀 Veeem, gente! Corre… Segura essa meu irmão @TiagoLeifert - citar o Goku num discurso de eliminação não é pra qq um! Quero ver vc superar essa no BBB! 😂😂 https://t.co/UibB3MItMM @chicobarney @ferques Hahaha! Só grandes citações na minha apresentação! De Gandolf a Goku, passando por Savamu e Yoda e vou acabar a final com Rocky Balboa!! Bastidores agora... https://t.co/ym0Nic4l2Y Hahaha. Já já... eles tão descendo aqui pro set de eliminação agora! https://t.co/EraP5gyNMf RT @SigaPlayPlus: Lembrando que depois da #EliminaçãoAFazenda tem #CabineDeDescompressão só aqui comigo, no #PlayPlus! Com quem será que @M… Boooa https://t.co/2BXqDd4FHr RT @HugoGloss: E ai, quem sai na #EliminaçãoAFazenda hoje?! Aoooo!!! https://t.co/QUzU5fPFS3 RT @BeatrizBloomm: Ansiedade a Milhão para #EliminaçãoAFazenda,  o melhor programa da tv brasileira , com o melhor apresentador @marcosmion RT @lucasloami: O @marcosmion apresentando a fazenda deu muito certo Vai! https://t.co/cQ1MOm5VQs Tamo no ar!!! Quem fica? Quem sai? Mogli Zoli? Sertanejola?! #EliminaçãoAFazenda https://t.co/OcF6y9KEfU RT @Trouva: Hoje tem  Cabine De Descompressão no @SigaPlayPlus com o eliminado logo após @fazendarecord. Que perguntas vcs querem fazer par… 🙌🏼💪🏼 https://t.co/c5FoIrELAI HAHAHHAHAHA! Evandro me inspirou!! https://t.co/YPh6PBlGRs Uma coisa sobre a Fazenda: eu nunca, NUNCA, tinha visto tantas teorias de conspiração diferentes referentes ao mesmo assunto! 😂 Lendo os tweets de vcs me sinto no CSI Itapecerica! Li hj sobre uma mulher que trabalha na Record e decide quem ganha o jogo...😂😂😂 Essa foi nova!! Quem sai hoje, hein? Faz tempo!! A Fazenda só potencializou!! Vou tocar o sino! 😂😂😂 https://t.co/USr7AJdKcv @van_cz28 😂😂😂😂 Mano...eu to variando já! Hahaha! O que foi aquilo?!? https://t.co/AjBpmmEgGF Hahahhahahahahahhahahahajahahahahahhahahahahhahahahjahahhaja!! https://t.co/RyTPjhtnDp To respondendo e agradecendo seu comentário!!! S2 https://t.co/PS0GAyF3W7 Sim! Poderiam ter pensado nisso! Deixar 3 banquinhos e eu pedia, depois do Sertanejo ser indicado pra encostarem o outro pq a roça é dupla! Seria um suspense bom que a produção não pensou! https://t.co/c5CDvvrmkn Sera?? O que vcs acham que vai acontecer agora?? https://t.co/77m46HgNtn Acaba mesmo semana que vem! Quinta feira!! Mas agora já é velocidade 6 do creu de Itapecerica!! https://t.co/yGx3PmtCAx Hoje o programa vai ser diferente... #RoçaAFazenda Senhoras e senhores o Ace Ventura de Itapecerica está passando na sua timeline pra dizer que a #RoçaAFazenda já vai começar. Quem vai pro banquinho? https://t.co/A7mAfZsBd4 No final do dia, mano, vc vai ganhar o que você trabalhou pra ganhar. Então é melhor dar todo o sangue e garra pra ganhar tudo que vc tem direito! Galera! Estamos concorrendo ao prêmio do @sitenatelinha - quem concorda que dono de hospício merece prêmio clica no link e vota em mim? 🙏🏼🙏🏼 https://t.co/OSpWGKXGsF Hahahahaha! Leave Nadja HADDAD alone!! 😄😂 https://t.co/9fisovAIcv Quem acha que eu mereço esse prêmio da @uoloficial depois de aguentar 3 meses de hospício rural, por favor vota em mim para melhor apresentador de 2018! A família agradece! E Itapecerica da Serra tb! 😂  https://t.co/SrNvo76vw1 https://t.co/ZhIGQeUPNp Quem puder votar em mim, fortalecer, a família agradece! E a cidade de Itapecerica tb! 😂\n\nSó clicar no link e votar!! 🙏🏼🙏🏼\n\nhttps://t.co/SrNvo76vw1 Alguém sabe um app pra estar por dentro de todos espetáculos musicais de SP? Pra ver o que está em cartaz, comprar ingresso? Se vc pudesse piscar e ter um rango na sua frente, qual seria? A ordem inicial, do formato, era pra manter distância e não trocar uma palavra. Mas eu sou apresentador de palco, recebo meus convidados com bj, carinho e brincadeiras. Não sei fazer de outra forma! https://t.co/z7JLKaaP0Z 🙏🏼 https://t.co/t96sFk0V8H RT @fazendarecord: \"Minha terra tem mais tretas onde o feno quer queimar\"... Mas é um poeta esse @marcosmion, né, gente? 😂😂😂😂 Acompanhe tam… Ia ter sido legal mesmo!! https://t.co/91jgUNIpVs Queridos, tá rolando uma votação do @sitenatelinha - quem puder votar em mim e na Fazenda, agradeço❤️\nConcorro em duas categorias: “Melhor Apresentador” e “2018 foi o ano de...” , essa ultima o Bacci já contratou os chineses pra votar nele, mas da p virar!\nhttps://t.co/Dsh4k1lbT9 RT @gustlage: @marcosmion Vc é fera , Irmão.\nExcelente trabalho à frente da @AFazenda . Baita jogo de cintura p comunicar, tanto com o públ… Obrigado pela preocupação! S2 https://t.co/KiLzTajkTl Hahahah! Elevando o nível da arte de chamar o comercial! https://t.co/TVuGPxP07e Provações. Nada além de obstáculos que o destino coloca em nossas vidas pra termos a oportunidade de crescer e fortalecer.\n.\nPra quem se assustou em me ver na tv de bengala, explico que no… https://t.co/QVI1hQWT0U Hahaha! Isso é fato. https://t.co/IPCSODbjSN RT @SigaPlayPlus: Marcos, da dupla com Belutti, conversou com @marcosmion sobre a missão de ser pai jovem. Vem ver tudo o que ele contou no… RT @EduMarq18852337: @marcosmion Você é a integridade em pessoa.. PARABÉNS!!! \n Tá valendo assistir por você! Os participantes tem que esco… RT @ElianeG12436844: @marcosmion Verdade, não vejo essa diferença com o Rafael. Vc trata todos tão bem que não percebo nenhuma distinção.… RT @MirellaGVFM: Quando eu via o Vale A Pena Ver Direito, ficava pensando em como seria o @marcosmion apresentador da Fazenda, hoje sinto u… Ebaaaa! Fiquei feliz!! https://t.co/9Fmq4a4a4v 🙌🏼🙂 https://t.co/OQr8uhTMzO Tava muito! To estirado agora pra compensar! https://t.co/1ZXxDAACbS Hahahah! Minha lombar tava gritando comigo já!! https://t.co/Pj2wMezOqS Kkkk! Eu comemoro igual pra todos! Só olhar todas as provas no PlayPlus.  Eu sei que tem uma galera que gosta de achar que eu torço pra um ou pra outro, mas não tem isso, gente. Eu torço por todos! Sofro e sorrio com todos! https://t.co/Dv9sb8CX8E @verafreimam @RealityAoVivo Vi. Foi uma pena. Tavam os dois pelo último saquinho! 🤦🏻‍♂️kkkk https://t.co/7RIEOOJOaN Hahahha! Deixa minha bengala aí mano!! https://t.co/9snhGgHKUo Deu pra perceber?! Kkkk! Umas horas eu ri mesmo! Com o Kibe Voador enrolado na piscina eu ri! Kkkk https://t.co/8u6kqtdXdx A prova foi muito apertada. Se o Evandro tivesss levado mais a sério, digo com mais garra e foco e não ter perdido tempo com bobagem, ele tinha ganhado. https://t.co/khsKRlqB6q Olha a galera do Fogo no Feno! Obrigado a todos vcs! ❤️ https://t.co/sb3B6oQG9n A cabine de descompressão hj foi cancelada. Foi a informação que eu recebi, queridos. Mas amanhã a Cátia estará no Hoje em Dia! https://t.co/vdrwuKZLw2 🙂🙌🏼 https://t.co/DhU3dTAvnD Hahahahah! Hj foi mesmo!! https://t.co/qTJQ9qzYH9 Obrigado Ana!! Que mensagem boa de ler! ❤️ https://t.co/zXjGZLL2Sn Tava pirigando isso rolar!! Hahaha https://t.co/P1L4YEjl3C 🙏🏼 https://t.co/5MuggxP0aT RT @SigaPlayPlus: .@MarcosMion comenta saída de Catia de #AFazenda10 após agressão contra Evandro. Veja tudo o que aconteceu aqui pelo #Pla… O que vcs acharam? #AFazenda10 https://t.co/CF9cgBJpii Tamo no nar! Não percam o programa de hoje... #AFazenda10 Tá quase... https://t.co/mBNmHZ90FZ À convite da @DezMandamentos e da samba_tech fui fazer uma palestra sobre a como produzo todos meus programas e conteúdos, ao longo de 19 anos de carreira, baseados na… https://t.co/PqelrUoH4t AOOOOOOOO!!!! https://t.co/MJ2LDPdHDK RT @crescer: Você já viu a coluna do @marcosmion deste mês? Vem ler!\nhttps://t.co/EgiegTdwQr Aquela hora em que o despertador toca, mas vc ja ta sentado esperando por ele. 😒 As grandes decisões da Fazenda não são tomadas por mim. Tem uma comissão muito experiente em reality show p opinar e decidir.\nEles avaliam tudo que rola no programa e quando decidirem sobre a situação da Cátia, vcs saberão. Por hora continuem a votar no https://t.co/4b2BmnMtJm RT @SglShirlei: @marcosmion @marcosmion  parabéns , mesmo cheio de dor, ficou ali e não desistiu, sempre fazendo o melhor pelo público e pa… Vcs, viu?! Falei bastante sobre a situação do Caique na live que fiz pelo insta ao longo do programa! Está lá salvo nos stories! É @marcosmion lá no insta tb! https://t.co/Zvp0gFjZE0 ❤️ https://t.co/92Ol5E9MFr 😄😄😄😄 https://t.co/1VdsMrxhA5 Hahahaha! Total... https://t.co/tanmzuVbOU 👴🏻 https://t.co/MBPCRpq1Zp @camilets08 Tks querida! Hj tá assim... PÕE CADEIRA -&gt; TIRA CADEIRA -&gt; PÕE CADEIRA -&gt; TIRA CADEIRA... https://t.co/qNkwJG8UHp Enquanto rola o vt... 👵🏻 https://t.co/EUxBD5vq5Y Tamo no ar! E hj com bengala nova... regulável! A da sogra não aguentou. 😂😂😂. To impossivi! #ProvaDoFazendeiro https://t.co/CFPeSsQ0wA 3 minutos pro ar! #ProvaDoFazendeiro Quem ganha a prova do Fazendeiro hoje? @flavioricco @UOLTelevisao @UOL 👏🏼👏🏼👏🏼👏🏼 RT @EdnaMachadoFa: @marcosmion Não dismerecendo os outros apresentadores,mais vc Fala a linguagem do Povo,e é isso que diferem dos outros.S… Taí! Eu A D O R A R I A!!! Produção? Kkkk https://t.co/jhd8VuTfn8 Kkkk! Magina...todo o público que está nos dando essa audiência surreal tá carregando comigo! 😄 https://t.co/UGz53eYsyK Hahaha! Se isso desse aumento me arrastava mês sim, mês não! 😄😄 https://t.co/D9fh9amW2G 🙂 https://t.co/FG5spCSzCj RT @lesilva85742260: Parabéns ao grande profissional que é,mesmo com dor não deixa cair a peteca e a alegria ,contagiando o publico .EXISTE… Valeu Rose! Quando liga a câmera eu faço das tripas, coração! Meu trabalho é levar entretenimento pra vcs. Não importa como estou me sentindo. Feliz por, mais uma vez, ter conseguido! 🙂 https://t.co/T7VxxWrWTQ Nao foi nada fácil. Quem já travou a coluna de não conseguir mexer nenhuma das pernas, de doer pra respirar sabe o perrengue que passei na estrada de terra, esburacada, que chega na Fazenda...obrigado pelo reconhecimento! =) https://t.co/PMDoTYKKhN Muito obrigado por todas mensagens de carinho, todas mensagens positivas...vcs fazem toda diferença! Única coisa que me fez ter força pra me arrastar até o carro e pegar uma hora de estrada é o quanto vcs curtem e vibram com minha apresentação da Fazenda! ❤️ Um obrigado especial a minha sogra pela bengala cedida. #RoçaAFazenda https://t.co/6H6yavec9Q Aooo...Chegou a hora do FOGO NO FENO!!! 🔥🌾\n.\nE aí... quem vai pra roça hj?! #RoçaAFazenda https://t.co/24ZjFkY2rf #RoçaAFazenda https://t.co/RRCYLYddRk @mauriciostycer Sempre! 💪🏼 Obrigado! =) Vida de apresentador tem dificuldades que ninguém imagina. Estava contando aqui, ao longo da minha vida já fiquei 10 anos entrando ao vivo todo dia! Quem passa 10 anos sem piriri, febre, vômito...mas eu sempre fui lá e fiz sem ninguém perceber. Hj, como é coluna,ñ da p esconder. Eu travei a lombar de ontem pra hj. Não conseguia me mexer, muito menos levantar. Tomei injeção e todos remédios mais pesados que vcs podem imaginar e com o milagre da medicina, consegui forças pra me arrastar até o carro, deitar e vir até Itapecerica. Vai ter FAZENDA hj SIM! https://t.co/oe7pQiuvEn Cheguei em Itapecerica! https://t.co/uxQBPYEhHv @mauriciostycer Não foi treinando...dessa vez! Kkk! Veio vindo, vindo e me derrubou. Mas tomei todos remédios humanamente possíveis e me arrastei até Itapecerica! Mas hj vou de bengala! Senão não fico em pé! Ja to aqui em Itapecerica! De cinta, bengala e com todos remédios do planeta dentro do sistema pra conseguir me@arrastar depois de travar a lombar! https://t.co/Cgy5FTRIo3 Vai ter programa sim!!!  #RoçaAFazenda https://t.co/fEVfYVpJIU @LATAM_BRA DM =) RT @CINTIAC59787819: @marcosmion @marcosmion quero te agradecer do fundo do meu coração. Vi sua entrevista ao @DaniloGentili e me tocou pro… RT @claudionisio36: @marcosmion @amazonBR Parabéns pelo livro@marcosmion,  comprei seu livro hoje e estou gostando muito. Só estou me organ… Sim! Amo minhas participações no DPA! https://t.co/I3HgnWHStI Corretor do meu iPhone mudou a palavra “pessoa” para a palavra “lesão”.\nAcho que recebi uma mensagem subliminar do Steve Jobs. Tem na @amazonBR  - o site é: https://t.co/KTi1u3Lxpf - daí é só clicar meu nome no “buscar”! Lá tem meus dois livros!! E tavam em promoção de Black Friday!! https://t.co/OrJr09048V Eu tava é desesperado por eles não verem que tinha que jogar tudo uma fileira pro lado! Tava muito óbvio! Kkk https://t.co/IGPEUfI2yV RT @AdrianeMarrua: @marcosmion AooooMion,tu está arrasando,parabéns, melhor edição da fazenda, continua ateando fogo no feno! https://t.co/… Aooooo.... \nSexta é dia de #ProvaDeFogo! \nSe liga nessa estrutura GameOfThronesFeelings. \nQuem leva?!?! https://t.co/RMXMqaxYh4 RT @SigaPlayPlus: E como sabemos, @marcosmion 😂 Acontece quando tem treta no grupo da família também... #EliminaçãoAFazenda #PlayPlus\n\nhttp… Hahahaha! “Zuuuuuuuu” https://t.co/2LQtjyTCVi Bastidores...#EliminaçãoAFazenda https://t.co/gztGjNYyyd Tamo no ar! Quem fica? Leo Monstro Albino? Rafa Veneno do Rato? #EliminaçãoAFazenda RT @Trouva: Perguntas pro Leo e Rafael hj pra #CabineDeDescompressão... quem tem?! #LeoAFazenda #RafaAFazenda RT @RecordTV_Belem: Obrigado a todos os paraenses pela liderança de audiência de @fazendarecord #AFazenda10 https://t.co/OwyJ88ktJ7 Invadi a casa da árvore. Tem mais lá no meu stories. https://t.co/G0VtUL5yuj Olha a galera do FogoNoFeno!!!! Kkk https://t.co/BOmJrHzkut Hahahah! Já me perguntei isso tb!! https://t.co/Nn6AC3EISH RT @alemicroni: @ThiagoRochaBR @marcosmion é  o melhor.\nSinceramente  cheguei por vezes  tentar assistir as outras edições  e não conseguia… RT @Carlinh73141990: #MarcosMion Obrigado por fazer parte da minha vida, apresentando os programas de TV e na música como VJ da MTV . Sou t… Obrigado Brasil pela audiência INCRÍVEL!!! 🙏🏼🙏🏼 https://t.co/0TlEYWjinG A regra era bater o carrinho no final. Apenas isso. É o máximo quando eles entendem a prova e evoluem a performance sem quebrar as regras! https://t.co/UlCFg0IDsp Reagiria igual pro Léo e pro Rafael. Fico feliz e triste com todos! De forma igual. https://t.co/MfNMUq9GD4 Hahaha! Eu só lembrava da final de A Casa tb!! 😂 https://t.co/BekaMqch7I Hahahaha https://t.co/9yiPG2eWm3 RT @camilets08: @fernosampaio @marcosmion @xuxameneghel Vai ter #FogoNaSapatilha amanhã certeza. Entre um vt e outro... https://t.co/fTUg449h7W RT @HugoGloss: Quem vocês querem como novo fazendeiro, João, Leo ou Rafael? #ProvaDoFazendeiro Tamo no ar! #ProvaDoFazendeiro https://t.co/kS8WUrsjzW Sobre a #ProvaDoFazendeiro de daqui a pouco.  Quem leva?! #PuroSangue #VenenoDoRato #Monstro ?! https://t.co/zGr2wqPBje @Trouva Mas não è vc??? @LucasPenido Nao ia dar pra continuar, o Cavs tá naquele momento de formar a base forte com novatos promissores e deixar eles amadurecerem pra daqui uns 5 anos estarem no topo do jogo de jogo. E ah! O que não faz um Lebronzinho no time, hein mano? Kkkk A prova do Fazendeiro de hoje promete! Ontem os 3 já começaram a falar pra vcs ligarem na Record pq seria com emoção! E eu tenho certeza que vai! A prova não é de sorte! Ou seja o fogo vai pro feno! Quem vc quer ver voltando como Fazendeiro? Essa prova promete... Não tiveram. Foi 3 x 2! https://t.co/ql2twPjwYc Tamo aqui pra isso, ué! 😂 https://t.co/lR9faWKNtN E durante o intervalo... #RoçaAFazenda https://t.co/rDSZXEZlDy Mudou minha vida! https://t.co/M7FNwnBOUh @OrgulhoMion Fique feliz! =) As referências do Rafael são sempre MTO anos 80! 😂😂😂 #RoçaAFazenda RT @Nubervania4: Tô ansiosa pra ver logo essa votação kkkk 😂 que comece as tretas #RoçaAFazenda RT @OrgulhoMion: Tempo bom pra assistir a fazenda @marcosmion chuvinha e aqui assistindo  #RoçaAFazenda #RoçaAFazenda - Quem vai?! https://t.co/pbNelVPH4J Pensando aqui enquanto espero o programa começar hoje ao vivo...quem vcs acham que vai ganhar a Fazenda?! Leitura obrigatória pra todas famílias autistas! https://t.co/s7XvUK5XmM RT @aamoreira_: @marcosmion mudando meu modo de enxergar a vida, o mundo. ❤️\n#OlhaDeusAli #AMORAVIDA https://t.co/yYCtyjCVPs Hahahahahaha! “nachos”!! https://t.co/M99MiLmatp @RickSouza Hahahaha! Ri alto! Eeeeeita! É ... tem gente que já passou uma vida comigo! 🙏🏼 https://t.co/l57DHc8hm1 RT @TEDTalks: Here's how @AlexHonnold became the first climber to scale Yosemite’s El Capitan without a rope. #FreeSolo\n\nWatch the full TED… 🙌🏼 https://t.co/naprzT1yER 🙂 https://t.co/txGp71Ia1t Quem se identifica?! @fazendarecord https://t.co/5xDJSWXPSz RT @pridernocka: CORDILHEIRA ITAPECERICANA KKKKKKKK morriiiii @marcosmion  seu maravilhoso kkkkkkkkkkk Quem quem?! https://t.co/6UBXSPamAR RT @OliveiraSarah: Pra quem tá ouvindo Queen todo dia no repeat, desde que assistiu ao filme... finalmente subimos no Youtube! \n#MinhaCançã… Catia X Luane. Quem fica ? Quem sai? #EliminacaoAFazenda https://t.co/f3ZK4Bpxy4 RT @Trouva: Aoooba. Logo depois da eliminação tem #CabineDeDescompressão com a eliminada de hj... mandem perguntas ae com a hashtag #CatiaA… Tem imagens do potrinho no meu stories! No Instagram!! #AFazenda10 RT @UnileverBrasil: @oieusouosamu @luscas @marcosmion Ícone que faz U BEM, não é mesmo, Oie? Ah! E não para por aí, não! No nosso movimento… Muito classe ver o @titasoficial no programa do @DaniloGentili 👏🏼👏🏼 Entrevista tá demais, os vídeos antigos são nostalgia das melhores! Parabéns Danilo e Titãs!! Programa maravilhoso pra quem viveu os 80/90 assistir!! @HugoGloss Bodas de báia! Tem spoiler do potrinho no meu stories do Instagram!! https://t.co/oGEmGyQm3c DE PRIIIIMA! 🔥🔥🔥\n.\nSenhoras e senhores... #AFazenda está no ar!!!\n.\nE eu aproveitei pra dar uma testada na #ProvaDoFazendeiro antes de começar o programa...\n.\nE aí... quem volta com o chapéu na cabeça??? https://t.co/HEIINS54Ce Daqui a pouco tem #ProvaDoFazendeiro! Quem volta com o chapéu na cabeça??? https://t.co/VS33CYfKXw Opa!! Isso é currículo!! https://t.co/soTyWj1yoG Terça feira ainda...e parece que já tamo há um mês nessa semana...😞 Hahahahaha! https://t.co/neEa12aI5g HAHAHHAA! Essa é da época!! https://t.co/79MD5w3sog RT @SandraTamoios: @marcosmion Caracas, tu é  demais! Vc consegue dar uma leveza e alegria  na hora que o clima está tão  tenso e feio. Pq… RT @Marcell18406846: @fazendarecord Parabéns @marcosmion  Direcionando a roça e deixando os peões falar a vontade mas sempre com coerência… É só eu parar pra respirar... https://t.co/OYeuPswUWz RT @fazendarecord: Qual era a chance dessa brincadeira dar ruim? 🤔\nAcompanhe a #RoçaAFazenda também pelo https://t.co/sJRe2qQaI8 https://t.… RT @fazendarecord: Quando eu vejo uma briga rolando...\nAcompanhe a #RoçaAFazenda também pelo https://t.co/sJRe2qQaI8 https://t.co/EzPo6LkA0E #EvandroKibe 😂😂😂 https://t.co/g9OUx0tVyV Quem, hein?! #RoçaAFazenda https://t.co/KdaQlUYDeX O de hoje é bem simples! Vcs escolheram! Se o Fazendeiro indicar direto pra roça o dono do poder, ele ganha 20 mil reais!! \n\nPro Sertanejo vai ser colocar um alvo direto em alguém que ele queira mandar pra roça, isso é, se ele ficar com o poder pra ele! https://t.co/FfhPgviCV5 Parabéns @Junior_Lima @pipocandobrasil 👏🏼👏🏼👏🏼👏🏼\n\nFREDDIE MERCURY e os MISTÉRIOS por trás da LENDA - Desenterrando 🎙👻 https://t.co/ch7rSIr7VI E aí... QUEM GANHA A FAZENDA 10❓\n.\nChegamos na metade do jogo... 8 saíram, 8 ficaram. Qual é o seu palpite? Eu quero saber!\n.\n#Caique ?\n#Catia ?\n#Evandro ?\n#Felipe ?\n#João ?\n#Leo ?\n#Luane?\n#Rafael? https://t.co/Qr093elPDt Tao feliz quando postam sobre meu livro e me marcam! Quem quiser comprar só dar um busca na https://t.co/ZiQ7ZqfOcl @amazonBR https://t.co/AL3bsJqkKA RT @UnileverBrasil: @stumpfxl @luscas @marcosmion Não só chique, Stumpfxl, haha! Como fazendo U BEM, né? São tantas inciativas INCRÍVEIS qu… RT @SportsCenter: THE SURPRISE K.O. AT THE BUZZER 😱😱😱 https://t.co/YQWeRckTwP RT @Andrea38408655: @marcosmion Desejo a você cada dia mais sucesso, a fazenda está um arraso principalmente por sua causa, você nasceu p a… RT @igrejjjas: @marcosmion @marcosmion, eu te admiro como pessoa/pai/marido/profissional. Tu és um ser humano lindo e com um coração mais l… 🙂 https://t.co/74Z361tFHp @mathf4g @backstreetboys Opa! Claro que vou! Obrigado, mas não é possível que alguém fizesse diferente! Ela precisa de apoio, acabou de sair do confinamento, tadinha... https://t.co/HllCq90pdW ❤️ https://t.co/9VkRfy2Wg7 Hoje foi dia da Fernanda deixar o jogo.\nÉ mto importante lembrar q, no final, isso é só um jogo. \nTem pessoas ilhadas, sem informação, sem retorno d suas atitudes e ações tentando sempre fazer o melhor como pessoa, se defendendo e sobrevivendo no jogo.\nO q vc achou da saída dela? https://t.co/AFJ7esd2K9 To lendo tudo aqui! #EliminaçãoAFazenda https://t.co/pWvZaExm8x HAHAHAHAHAHA, mano... https://t.co/Tdi983TZwi Só faltou a pipoquínea... #EliminaçãoAFazenda https://t.co/l2hRCAp9At Aoooo, Senhoras e Senhores... #CHEGAMOS\n.\n*Poucos sabem mas enquanto os peões estão confinados dentro da sede aproveito para colocar o treino em dia! \nSim, sempre de calça jeans. #CuriosidadesDaFazenda #EliminaçaoAFazenda. https://t.co/hm3Rr9e8lq E aí... quem fica e quem vaza hj Twitterland?! #EliminacaoAFazenda https://t.co/xc7yuwB2fW RT @Trouva: Hj tem #CabineDeDescompressão com o eliminado/a no @SigaPlayPlus logo após a @fazendarecord . A gente vai ler perguntas aqui do… @jbanguela Hahahahhaa Vídeo irado de bastidores da @MarianaCoelho_ colocando voz na música “Tranquila” \n\nCKICA AQUI!!\n\nhttps://t.co/e26aOjVY3N Um pouco da entrevista com a Nadja logo após a expulsão. https://t.co/3qhw6gWXvq Quem sabe a gente não consegue encaixar um Vale a Pena na final?  Kkkkk https://t.co/epfQOYeKbq Que recado maravilhoso! Obrigado Pati. A única coisa que te falo é que eu to mergulhado de cabeça. Sou o 17’ peão, mas como um paizão, torço pra todos e sofro com todos! https://t.co/7YxfLgP3ED Foi uma quebra de regra. E triste mesmo. Leia meu post. Mas regras não podem ser quebradas. O Caique errou muito, mas o que ele fez, tá valendo. O que ele fez até a Nadja já fez muito. Mas ele foi pra outro patamar. https://t.co/CTHSIVmEcU HAHAHHAHAHAHAHHA! https://t.co/K0A135D6Kr ❤️❤️❤️ https://t.co/vQS0fGvJQh Sobre a saída da Nadja... https://t.co/dG4iuJfX4T Agora o momento exato em que a Nadja e a casa ficam sabendo da expulsão. #ProvaDoFazendeiro https://t.co/RN8sQzEYnR O que acharam do Rafael fazendeiro?! #RoçaAFazenda RT @SigaPlayPlus: Logo após @fazendarecord, Nadja participa ao vivo da #CabineDeDescompressão! Ainda não baixou o #PlayPlus? Corre que aind… RT @Trouva: A cena que gerou a expulsão... #ProvaDoFazendeiro https://t.co/PApXhnytBT O que vcs acharam depois de ver a cena completa? #ProvaDoFazendeiro #AFazenda10 https://t.co/IIpPj6C3AS 👀 https://t.co/0wOmwu7iB2 Agora, entenda como tudo aconteceu.... #ProvaDoFazendeiro Vamos mostrar agora, no próximo vt! https://t.co/Mp7zxmPPbu RT @HugoGloss: Começou o bapho! Vem, gente! #AFazenda RT @chicobarney: Cena inédita da agressão! #CenaInéditaDaAgressão #AFazenda10 #ProvaDoFazendeiro Chegamos! #ProvaDoFazendeiro https://t.co/RDmhqiH4vb Senhoras e senhores... que dia! \n.\nQue momento difícil. Uma decisão deste tamanho divide o público, gera muita discussão, mas segundo a direção do programa, uma regra foi quebrada e isso não pode passar impune. Pra ninguém.\n.\nDaqui a pouco, ao vivo, vou mostrar tudo pra vcs. https://t.co/GlqZiB8o8G RT @SigaPlayPlus: Tem perguntas para a ex-peoa Nadja? Mande para a gente usando #NadjaAFazenda. O apresentador @marcosmion vai conversar co… Que dia, amigos! Daqui a pouco vcs vão entender TUDO o que aconteceu. E logo após o programa entro ao vivo com a Nadja no PlayPlus. Mandem suas perguntas com a hashtag #NadjaAFazenda https://t.co/JUp3iZk0w1 Vai ser a primeira conversa dela após a expulsão. Quem não assina @SigaPlayPlus , corre pra assinar! https://t.co/TmCLqdkI6D https://t.co/GK1RKQmM0A 👍🏼👍🏼Eu e o Brasil!! Kkkkk https://t.co/T7a7KeE6le Hahahhahahah! Fato! https://t.co/m8IER5tYPf @nasseroficial Hahahahhaha! FIRE IN THE FENOWS!! Mas eu finjo que to tentando cortar só pro fogo não encobrir o deck de votação! 😂😂😂Se eu corto treta é por causa do tempo do pgm, pode ter certeza! https://t.co/Ctbj2Ia7c1 RT @luciannocruz: Eu amo o @marcosmion, ele nos representa total #RoçaAFazenda Hahahhahaaahhahahahaa!! Queria muito o Marquito entrando ali!! https://t.co/ImxSwShYlp To sobrevivendo na selva! https://t.co/qv7hm3rqpQ Eles realmente esquecem que tem 50 câmeras e microfone embaixo da boca o tempo todo! https://t.co/aSrwikEuuG Hahaha! Boa pergunta!! A Fazenda com 1/10 das pessoas é MUITO mais loka do que A Casa!! https://t.co/fGYhA89T5S Hahahahha!! Mas a gente tá aqui pra isso, ué!! 😂 https://t.co/Hi8cDtN5VC Eu to sempre rindo muito ou fazendo cara de “uuuuuia!!” ou “viiiiiiixi!” 😂😂😂 https://t.co/trEl5xDbah E aí??? Tão vivos??? Hahahahha! Mano loko, que votação foi essa?!? \nF O G O N O F E N O!!! RT @GrazeaneSouza: @marcosmion Tá fazendo cosplay do negan mano só faltou a lucile kk MaAanooooOo... #RoçaAFazenda https://t.co/voURfBpE8o Quem vai pra roça hj? #RoçaAFazenda https://t.co/88pzvpB8DL @Li27717662 Hahahaha! O capim que vai comer a vaca! Acho que vou usar no pgm de hoje!! @PauloVieiraReal E eu?!? A Nadja ainda tá de Viking! Hahahaha!! Foi a única que agiu como um Viking de verdade nessa festa! Foi pras cabeça! 😂😂 Uma das coisas boas da Fazenda é valorizar e incentivar o uso do roupão. Essa galera usa mais roupão nesse mês do que na vida toda até agora! Mano...que pesadelo!!! https://t.co/H9JPhynBwF @Igor_Maol Coca Cola!! Imagina que louco seria entrar na baia e a @APMinerato estar lá gritando EU NA VIDA com as pernas pra cima e ficasse até o fim do jogo?! Ou, como disse outro dia, só entrasse nas festas pra mostrar como se faz? Hahaha! #PensamentosAleatorios https://t.co/2llIPRL5sD Eu tenho olhos nas casas de vocês!! https://t.co/Os0cqrOdX5 Olha lá o bolinho de cenoura da vovó! Sucesso! https://t.co/15OK6ryEde A sensação de família é tão forte que acabei de ver um comercial de ursos de desenho e só pq eles estão se portando como uma família, eu já choro. \n\nMas são ursos polares de desenho...sim, eu sei. Imagina se o Caique assumisse com o Evandro o casal #Caindro? E a mendigata passasse o dia fazendo marcenaria como o Dr Hater?! #PensamentosAleatorios #AFazenda10 Imagina se meu mano @YudiTamashiiro estivesse nessa edição. Namorando a Cátia Paganote? #PensamentosAleatorios #AFazenda10 Hahahaahahhaha https://t.co/PzkSEP7iop Ela falou pra ele antes de sair da sede que já esperar ele aqui fora! S2 https://t.co/LF75QGM5qf @OrgulhoMion Na tv!! Imagina se a Vida Vlatt não tivesse saído e hoje tivesse no jogo namorando com o Léo Stronda? #PensamentosAleatorios #AFazenda10 A Festa Viking tá total festa GOT! Tem até o Jon Snow of Itapecerica!! #AFazenda10 FINALMENTE rasparam o comb over do Rafael Ilha!! Que nervoso que da ver ele penteando horas aqueles 15 fios! 😂😂 #AFazenda10 Quem tem filhos passando por isso, espero que este capítulo do meu livro ajude! https://t.co/aQWygCCxbK Hahahhaha! Olha lá Nelson Rubens!! Não coloca isso na minha conta pq não sou eu quem decide. Sou o apresentador, não mando em nada! Foi modo de falar!! 😂😂😂 https://t.co/hJywi6IE5J O Rafael Ilha corta a unha dia sim, dia não. Como que cresce tanta unha nesse mano?! #ProvaDeFogo @Martinhaguedes ❤️❤️ Nunca poderia imaginar que dividir os grupos aleatoriamente, tirando a chance deles se escolherem por afinidade, poderia funcionar tanto! 👏🏼👏🏼👏🏼👏🏼 Que seja assim na próxima temporada! #ProvaDeFogo Já estamos naquela fase do jogo onde não da mais pras pessoas falarem que estão “jogando com o coração”. #ProvaDeFogo RT @OliveiraSarah: dá pra ouvir o pgm ao vivo por aqui: https://t.co/qRbMz4edAm (participação especial do meu amado @marcosmion) • reprisa… RT @SiteCTV: Com eliminação de Gabi, \"A Fazenda\" crava novo recorde e bate Globo por 64 minutos nesta quinta (1º) - CTV Audiência https://t… Ahhh... é isso!! https://t.co/bi2U5Xai8p RT @SigaPlayPlus: Na Cabine de Descompressão, Gabi Prado fala sobre a relação com João dentro do reality e diz que vai esperar por ele: \"El… HAHAHAHAHAA! Épico!! @YudiTamashiiro - um dos melhores Vale a Pena que já fiz!! https://t.co/0JnZrVOa3Z RT @Martinhaguedes: 01h59 e #EliminaçãoAFazenda continua em 1º lugar nos TT's Brasil \ne em 1º lugar nos TT's mundial. @marcosmion RT @TelemaniacosTV: Prévia (01/11) - #EliminaçãoAFazenda bateu recorde e marcou 12.9 de média, teve 14.2 de pico e ficou 1h04 na liderança.… Aeee! Nao percam o #MinhaCançao da minha querida @OliveiraSarah amanhã às 17:00! https://t.co/tSKo3kusK6 E foi a vez do furacão Gabi Prado deixar o jogo. Foto tirada logo após a eliminação, olha a carinha que ela tá...😔\n.\nO que vcs acham da saída dela? Comentem!\n.\n#afazenda10 https://t.co/8X5AupiqOa RT @Trouva: Daqui a pouco tem cabine de descompressão com quem for eliminado... Mandem perguntas aqui pro Evandro ou pra Gabi! #EliminaçãoA… #ElimiaçãoAFazenda https://t.co/RPCK481PNi E aeee... Quem fica?! Evandro ou Gabi ?! #RoçaAFazenda https://t.co/d8PeQvJNSg #TBT esse dia foi Loko!\n.\nÉ muita informação pra um vídeo só... 😂\n.\nQuem aí viveu a fase do #MuchoMacho ?! \n.\nBem dormido, bem dormido... @ttmionzinho @lucasfresno #FabioPuentes 🌀 https://t.co/g9PEuTmZoR Quem fica hoje?? “Eu posso te responder depois?” Hahahhaha! Tadinho do Jon Snow de Itapecerica... #AFazenda10 Eu A M O como eles realmente acreditam que vão conseguir fazer algo escondido das câmeras! 😂 Tem 300 cameras! Todos microfonados! #AFazenda10 To assistindo pelo @SigaPlayPlus hoje! E aqui no meu Twitter falando com vcs!! #AFazenda10 HAHAHAHA! Grande Caetano sentado de sunga e perna aberta na Baía de Guanabaaaaaaara! https://t.co/rk356dbjKv RT @lili200784: @marcosmion Gosto muito da forma que Mion apresenta o programa,10 anos de fazenda é a primeira vez que acompanho todo dia,s… Gostosuras ou Travessuras Pet Edition 😂🍿🎃🥞👻💀!\nEu vivi pra ver a Pipoka fantasiada de abóbora e a Pankeka pronta pro #Halloween\nSempre falo da #FosterPremium pq são os produtos que elas mais amam e, além do sucesso, a qualidade é indiscutível! https://t.co/H99tlFhUbI RT @_LeeoDiniz: @marcosmion Sou fã desde o DescargaMTV! \nSe tornou um ser incrível! Seu sucesso é só repercussão de seu coração! Abraço! ❤️❤️ https://t.co/oLYpcdyf8s 🙏🏼🙏🏼 https://t.co/aPDFI3jA08 #ProvaDoFazendeiro. Qm volta mandando em tudo ??? https://t.co/zUF8oUIYS2 Que todos tenham um excelente dia! Que Deus possa abençoar e realizar os maiores desejos de casa um de vcs! Amém. Eita! O que tá tomando pra dormir?! Kkkkk https://t.co/eRZSm375sq Ae!! Alguém reparou!! 👏🏼👏🏼👏🏼 https://t.co/NipCDFKjdD RT @lcs_np: #RoçaAFazenda @marcosmion mitando na apresentação da #AFazenda10 parabéns 👏👏 RT @PriiiihRocha: O melhor deboche dessa fazenda é o @marcosmion eu não aguento os comentários dele 😂😂😂😂 #RocaAFazenda O poder azul é colocado junto com o vermelho na hora que acaba a votação e eu fecho o Lampião. Então eu lacro e entrego pra quem ganha a prova de fogo! O Lampião fica lá na sede o tempo todo! O poder é decidido MUITO tempo antes da roça ser formada. Não tem como beneficiar um. #RoçaAFazenda! Quem vai sentar no banquinho ??? https://t.co/10tFhvZ4oA Hoje em dia não da pra saber o que é verdade e o que não é, mas essa se for é a maior aula que esses velhos políticos já tomaram! https://t.co/nYRrZShIbf Quem vc acha que o Don Rafão vai mandar direto pra roça? PELAMOR DE DEUS!! PAREM COM OS FOGOS DE ARTIFÍCIOS!! A cada um minhas cachorras congelam em pânico! Tremendo! Assim como TODOS CACHORROS!! Se vc tem coração comemore de outra forma! \nPASSEM ADIANTE! Falem com seus familiares e amigos! Por favor. @andreafabyanna Semana que vem!! Vcs escolhem sempre pra outra semana! Obrigado manos do JetLag por aceitarem meu convite pra tocar pros meus maluco preferidos! FOI IRADO!! #AFazenda10 Quem tá ansioso pra ver a festa de hoje com JetLag, abraço do Sertanejo com Nadja e Cátia dando um tretéx com Mendigata e tomando punições variadas da um like! 😂 Já avisei ao vivo semana passada! Em alto e bom tom pra todos entenderem! 😉 https://t.co/czIRJ7uzqS Hahaha! Com esse elenco, antes de um ferra peão tem que tirar os machados de cortar lenha da oficina! 😂😂 https://t.co/VIedl2JNG7 Qual o casal mais shippado e amado da Fazenda 10? Mais??? Eita... https://t.co/p2vNcnteBD Hahaha! Só vcs... https://t.co/R2JSOgBuN5 Vcs escolheram o poder da chama vermelha que foi: o dono do poder tem que votar duas vezes, em peões diferentes, um de cada time! \n\nPra quem vcs acham que o Jon Snow de Itapecerica, vulgo Bigode, vai dar? Quero agradecer meus manos do Jetlag por terem topado meu convite pra tocar pros nossos peoezinhos queridos na festa de ontem!! O que vcs acharam da estratégia do Léo? De levar pra baia a Nadja e a Cátia? #AFazenda10 RT @AndrepXavier: Depois de um dia cansativo de trabalho, nada melhor que terminar o dia com esse livro do @marcosmion \n\nRecomendo a leitur… RT @bruno_cena: @bebellasiqueira @marcosmion @marcosmion é um exemplo diante de uma geração de homens egoístas, mimimizentos e propagadores… Kkkk! Internet não perdoa! 😂 https://t.co/C90U416TYG Mano... @murilocouto me faz rir REAL! Esse tem que assistir até domingo! \n\nMURILO COUTO - LULA X BOLSONARO NO SEGUNDO TURNO. A BATALHA FINAL https://t.co/ojDcBtplPo via @YouTube @gustastockler Concordo. 🙌🏼 https://t.co/rrk8r9hjvH RT @Li27717662: @marcosmion Eu te adoro.. Arrasando como sempre.. O melhor apresentador da atualidade.. Melhor ser humano. 💪 🤦🏻‍♂️😂 https://t.co/ghF94SxjjF Eee Chulapola!! Que cara gente boa!! Sorrisão fácil! Mas deixou o jogo... e #MetraNadja volta mais uma vez! Quem aí concorda?\n.\n#Danone #Chula @chulapa_aloisio https://t.co/N6OikZ2se6 ChegamoS! #EliminaçãoAFazenda https://t.co/qIzTBrJkVx Confesso que deu uma marejada aqui postando esse #TBT... Escrevi mais no meu insta. https://t.co/PfDcMAstcJ Tentei abreviar YouTube pra Utube e meu corretor corrigiu 5 vezes para Urubu. Sabia que toda vez que vc compra OMO vc está colaborando para um planeta mais sustentável? Clica aqui pra entender:\n\nhttps://t.co/bLb1Zkncaz Quem volta com o chapéu na cachola hj?! #ProvaDoFazendeiro https://t.co/TktXOgSKwV Sobre a prova do Fazendeiro de hoje!! Em primeira mão! https://t.co/iOXbGJPJbg Chegamos! E com pose de mãe na decoração do shopping. #RoçaAFazenda https://t.co/iST64Q2QXW Sobre hoje... https://t.co/ObcAcj3jqV Quem tá certa nessa treta?? RT @UnileverBrasil: Atitudes simples podem melhorar o mundo. Além da gente, o @MarcosMion, o @Luscas, a @Babi, a @Juzao, o @Taviao e o @Nao… To fazendo uma lista de termos e gírias do campo, caipiras pra escrever os textos da Fazenda da semana que vem! \n\nME AJUDA??\n\nEscreve com a tag #giriasfazenda pra eu conseguir achar depois! 🙏🏼 Olha só a camiseta nova do TeamTreta em parceira com a LaMafia que será lançada amanhã na feira!! Quem for vai poder comprar!! Stand da LaBellaMafia! Sábado e Domingo! https://t.co/tJ9J2QOVJx Estarei no stand da LaBellaMafia X LAMAFIA este fds tb! Na mesma feira! No Expo Center Norte! Sábado e domingo! https://t.co/MaA50IMx9G Tai o endereço! Vai ser no Expo Center Norte! Estarei no stand da Midway a partir das 17:00!! https://t.co/P85FcohhKM Stand da Midway na feira BRTF que vai rolar esse fds! Quem vai lá pra trocar uma ideia e tirar foto comigo? https://t.co/lTfytiG04w RT @SigaPlayPlus: Após ser eliminada de #AFazenda10, Perlla bate um papo com @marcosmion na #CabineDeDescompressão e comenta a conturbada r… E aí? O que vcs acharam da saída da @perllareal ? .\nComo interpretaram a atitude dela entregando o chapéu pra Luane? .\n#AFazenda10 https://t.co/qhP87HCluY #EliminaçãoAFazenda https://t.co/Ybc8g3tvuU Tamo no ar! Quem sai?! Quem fica?! Perlla ou Rafa?!? #EliminacaoAFazenda Muita gente fala tb sobre repescagem. Como falei na minha live, até onde eu sei não vai ter repescagem, mas essa decisão final não é minha. O jogo é vivo! Mas até agora não existe conversa sobre repescagem! Muita gente perguntando se vale o voto no app da Record pra escolher quem fica na Fazenda. A resposta é SIM! Vale!! #AFazenda10 Ah, os bastidores....😂😂 https://t.co/ZJuphB8rzB @FabioPorchat Hahahahaha! Eu to mais maluco que todos eles juntos!! Se alguém ver minha sanidade agarra e me devolve!! RT @fazendarecord: Não existe melhor descrição que a do @MarcosMion sobre essas tretas todas! 😂 #ProvaDoFazendeiro \nAcompanhe também pelo h… Aoooo que vai começar... #ProvaDoFazendeiro https://t.co/tzfTl8lEjT #ProvaDoFazendeiro https://t.co/UrL5KulPye Quem volta com o chapelão na cabeça hj?! #ProvaDoFazendeiro RT @YudiTamashiiro: .@marcosmion mostra o seu camarim e como acontece a gravação dos offs. Para ver todos os vídeos, assine o PlayPlus.\n\nht… Recebi no meu camarim da @fazendarecord a equipe do #DeuRec , programa exclusivo do @sigaplayplus apresentado pelo #FrigobarDaLiberdade meu irmão japoronga @yuditamashiro 💪🏼😄\n.\n\nParabéns pelo #DeuRec YudiSan e Muka! 👏🏼 https://t.co/CNNRR21Dz6 RT @santosallainofc: A melhor coisa que aconteceu na história da humanidade foi o Mion ser o apresentador da fazenda!\nEu nunca gostei desse… Valeu mano! Só não me vem com essa de@dente torto pq meus dentes são os mesmos! Sou talvez um dos últimos, senão o último apresentador, que não colocou dente de teclado!! Nem vem! 😂😂 https://t.co/tbDLEHv6AL Hahaha! Por isso não tem Vale a Pena Ver Direito! Pq minha opinião pessoal não cabe mais agora que sou apresentador! https://t.co/lRFiSsnctD Vamos ver até quando, né? 😂 https://t.co/xzWCYrnlyD RT @YudiTamashiiro: \"Ter uma criança com autismo é se emocionar todos os dias.\" Você é Incrível irmão @marcosmion 🙌🏽 orgulho de ser seu ami… Hahahaha! Minhas filhas peludas viraram notícia!! ❤️ https://t.co/uQZ8No02QP RT @Fran_Comenta: Nunca vi um apresentador de Reality Show fazendo o programa tão feliz e apostando tanto no projeto como o Marcos Mion...… Hahahaha https://t.co/3XdjuNe7AE Que demais!! Parabéns e que Deus abençoe sua família! Eu to feliz demais em saber que tem um livro meu aí na China! 🙌🏻 https://t.co/Pe4vQZ9h39 Valeu meu irmão japoronga! Tamo junto, ce tá ligado! ❤️ https://t.co/xHRZiAPHC9 Parece até que eu tava prevendo!! Hahaha https://t.co/s6s44fP78M E não são poucas vezes não! Hoje com o bife à milanesa e o ele mandou eu dar meia hora d sim órgão meu eu quase ri alto no microfone!!! https://t.co/gX28hlk9aJ Hahahahha! Depois de eu encomendar pra internet o #RespeitaOGugu ganhei um #MarcosMionMereceRespeito eu amo vcs! 😄😄😄 https://t.co/052G0hNMNC @mauriciostycer Hahaha! Cada um com seu (es)calão! Eu só faço questão de pontuar pro pessoal de casa coisas de “omossoboca” pra cima! Kkkkk! De resto cada um fala como quiser!! E eu lá de perto? Hahaha! Mano...to amando esse programa! https://t.co/mxIG1QDrVe A gente dividiu o bife à milanesa ontem cara... #RoçaAFazenda https://t.co/ojtch0XEVf #RoçaAFazenda. Quem senta no banquinho hj?! (Ler na voz do Raul Gil) https://t.co/Tvga3GxxQt 👏🏼👏🏼👏🏼 https://t.co/qGSQi0gdVW Hahaha! Hoje é um programa mais curto, seria jogar a treta fora! Mas pode ter certeza que amanhã vai com todo destaque que merece! \n🔥no🌾 https://t.co/FudVw89SAz Não sei nada sobre repescagem! Foi anunciado oficialmente no R7 ou algum veículo da Record? Só acredite se for assim. https://t.co/yyUD4LZjUk Pros fãs da Fazenda: todos os blocks que dei desde que a Fazenda começou não tem a ver com qual participante o bloqueado é fã, mas sim com EDUCAÇÃO. Quando chega aqui botando banca, cobrando coisa e sendo um ser humano sórdido, é block na hora. Já com educação é sempre bem vindo! Feliz com esse Tweet! Faço o melhor que posso! 🙂 https://t.co/HXrlAVXeaN Jon Snow de Itapecerica Drummond de Andrade! 💙 #AFazenda @HFilippo @naosejatrouxa @loreismachado E a pancinha??😍 HAHAHAHAHHA! Bolichulapa!!😂😂😂 #AFazenda10 Esse elenco não encara festa como festa! Eles continuam fazendo tudo que fazem o dia todo, mas vestidos com roupa temática! Insisto na regra de soltar a @APMinerato em@todas festas pra de fato ser uma FEXXTA! #AFazenda10 Dias sem fogo no feno: 1\n\nVamos ver até quando eles conseguem manter! Já é um recorde! \n\n#AFazenda10 @brittojr @Leonard12774866 @chicobarney @fazendarecord Valeu @brittojr ! Muito legal ter seu reconhecimento, cara! 🙌🏼 ganhei o dia!! @Trouva @rolealeatorio Hahahha hahahahaha! @Trouva gosta mais dessa foto do que a do Cafu levantando a taça!! @chicobarney ❤️ https://t.co/S2jGGotHU0 RT @Trouva: A maior votação da história da Fazenda... #elimimacaoAFazenda A Fazenda deixa as pessoas tão do avesso que ao invés de comemorar que saiu alguém e assim está mais perto do prêmio, a pessoa chora como se quem saiu tivesse morrido! #ProvaDeFogo Hoje eu to assistindo à #ProvaDeFogo com Dona Suzana, esperando o fuego en él feno!! https://t.co/RrHxsFa0bO #EliminaçãoAFazenda https://t.co/9bpHNFUF1E Tamo no ar! Que Dia!!! #EliminaçãoAFazenda https://t.co/fXtitguBiD Falta poouco amigos! Quem fica? 🔥🌾 #EliminaçãoAFazenda https://t.co/WS0yzYrzAn E aí, preparados? Lembrando que hj logo após o programa eu converso com a eliminada ao vivo no PlayPlus... Já mandem perguntas na hashtag: #MeRespondeAnaPaula ou #MeRespondeNadja Eita que chegou o dia! E aí.. #TeamAnaPaula ou #TeamNadja ?! 🔥🌾🔥🌾🔥🌾 https://t.co/hk9oJoxU2v Mano!! Hahahha! Muito rápido!! Amanhã tenho que cortar antes do ao vivo!! https://t.co/i5zD9sHbDt RT @rvrb_br: Sabe aquele grupo que emplacou um único sucesso e depois disso sumiu? 😯 'One Hit Wonder' em one minutinho pra você 😂 #HUMinuti… Rolou a cena que iniciou a treta NaPaula x Nadja na íntegra e agora é com vcs! Decidam votando no https://t.co/4b2BmnMtJm !! RT @SigaPlayPlus: Impossível não se emocionar! @marcosmion reuniu depoimentos comoventes dos Pais Da Nova Era. Tá esperando o que para assi… Vâmulá...quem fica? @naosalvo Nossa mano!! Isso sim é referência!! 🙌🏼🙌🏼 https://t.co/xNyUg3bjgK Hahahaha! Estilo Khabib x McGregor!! https://t.co/91aROAtZDV Tá loko essa Fazenda, hein?!? #ProvaDoFazendeiro https://t.co/2bLnJOYm4M Vai começar senhoras e senhores. Nunca vi uma expectativa tão grande pra #ProvaDoFazendeiro quanto hj! Pra quem tá curioso: Acabei de postar um pedacinho da prova nos meus stories.  👊🏻 Eae... Quem volta Fazendeiro hj?! Ainda tem tempo... mas chutando agora... quem leva #AFazenda10 ?! https://t.co/x7imjZU6vi 🔥🌾=😶 https://t.co/MOt3B0anJq É...como telespectador eu queria essa roça na final! Mas o jogo acontece entre eles. https://t.co/gokmOqgSo9 Pelamor!! Kkkkk! https://t.co/Erwf1BWdGu A tão esperada abertura! #RoçaAFazenda To lendo tudo aqui na hashtag #RoçaAFazenda RT @chicobarney: Chega de política, vamos nos atualizar sobre os barracos de Ana Paula Renault na Fazenda! #RoçaAFazenda Vai começar! #RoçaAFazenda https://t.co/iIJHlsK5Df Quero dormir ... mas minha cabeça só fica pensando como será a votação amanhã!! #AFazenda10 @RickSouza Dava uma Fazenda boa!! Quem acha que a Gabi Prado escolheu bem quem levar pra baia com ela? RT @Sethrogen: This is important. https://t.co/hXX4kFByFR Segundo eliminado da temporada 2018: Sandro, the magician! 🎩🐰\n.\nE aí, concordaram com a eliminação? \n.\nComo a volta da Nadja Trá Trá Trá vai mexer no jogo?!\n.\n#AFazenda10 https://t.co/nk7vuEeK6K cc @HFilippo ❤️ https://t.co/kQlfhtCeNE Na minha cabeça eu tb, mas me pediram pra não falar na Fazenda pq é muito cara do Legendarios! Kkkk https://t.co/pjU9nJqwJS RT @gabieva88: Hahahahahahahahahahha!!!! Mion debochado tirando um sarro dos discursos de eliminação! @marcosmion ❤️❤️❤️❤️ #afazenda10 RT @hillx45: @marcosmion \nMITOU MUITO\n\nEsperava algo profundo e veio um TRA TRA TRA é um pedido para os compositores fazerem mais música co… Que bom que deu certo! Trazer uma leveza nesse momento! https://t.co/AqE6Gb52re 😂😂😂 https://t.co/Fbu2ok704k Hahahaha! Valeu mano! https://t.co/IJ6YGDVlbe 👏🏼👏🏼👏🏼 https://t.co/rTBSkufa1b Hahahahha https://t.co/3Q62HosXaq Hahahahah! Eu adoro falar “auditado pela BDO”! 😂😂😂 https://t.co/cH3B5j1E6L RT @SigaPlayPlus: Depois da eliminação... tem CABINE DE DESCOMPRESSÃO! @marcosmion conversou ao vivo com Sandro Pedroso, eliminado da seman… E agora?!?! #EliminaçaoAFazenda https://t.co/Knsi5SuqOK E aí... Quem sai hoje? #EliminaçãoAFazenda https://t.co/0gpZ5odCjt Quem fica na Fazenda hoje?? Chegamos! E com MTO fogo no feno.  #AFazenda10 https://t.co/sqZ11BEuQ6 Eu to amando fazer a Fazenda!! https://t.co/70hjth5tie RT @fazendarecord: Comenta aí a #ProvaDoFazendeiro 🤠 O @MarcosMion está de olho em tudo!\nAcompanhe pelo https://t.co/sJRe2qQaI8 https://t.c… Quem tá curioso pra saber como é a prova do Fazendeiro de hoje corre no stories do meu insta! Mostrei tudo lá! É @marcosmion E aí #Twitterland, quem vcs querem ver voltando com o chapéu na cabeça hj?  #ProvaDoFazendeiro RT @valtertavares: @marcosmion Vc merece o prêmio “melhores do ano”, se fosse outro apresentador, não aguentaria a pressão! Sou produtor de… RT @kempao: @marcosmion Muito obrigado pelo livro #PaiDeMenina.\nEu e muitos pais precisamos sempre agradecê-lo e reverenciá-lo.\nMais sucess… Hahahahhahahah! Pode crer!! https://t.co/UK6AwGT4Rh @chicobarney Nao posso mexer tanto no jogo assim Lendário do Twitter! 😂 Até pq eles tem o direito de “ao vivo” quererem esconder a estratégia. Quem vê e decide o que fazer com isso é o público. Vontade da!! Mas aí eu interfiro diretamente no comportamento deles e isso não pode! Noixx! E coloca aí uns bons aninhos de experiência! Na hora que eu vi que não ia dar e ninguém sabia o que fazer, mandei um deixa as regras pra lá e deixa eu ir pro deck! Toco de lá! E assim foi! 🙌🏻 Deu tudo certo! https://t.co/Svg4aIEN6i ❤️❤️ https://t.co/NlG5kp8ZNR @_jutobias ❤️ Sem palavras, sem comunicação com a direção, com a produção, sem ouvir os peões e sem ser ouvido! Hj me senti de volta na Mtv do início dos 2000! 🤘🏼👏🏼 https://t.co/qu5FHJAN1e Concentrei demais! Até pq elas gritavam olhando pra mim!! Olha os stories do meu Instagram! Kkk https://t.co/VL3wekBSLu @nasseroficial Hahahahahaha! RT @FlavinhaViana: Caraca muleke!!!!!! Passada!  #RoçaAFazenda RT @MarianaBelem: Hahahahah treta dazamigue @marcosmion #AFazenda10 Aoooo senhoras e senhores... #Chegamos. Quem vc quer ver na roça hj?! https://t.co/mEdwfIf4ce Eita que hoje tem #RoçaAFazenda https://t.co/o0tpLuboqE @feltrinoficial Rocky Balboa João Zoli, Jon Snow de Itapecerica, é daqueles que vai passar um mês depois que sair da Fazenda acordando no meio da noite pq “ouviu o mu da vaca”! Hahaha! #AFazenda10 @gustastockler É isso irmão! Nenhuma métrica ou algoritmo vale mais do que conteúdo real. Que faça diferença na vida de quem te segue! Fuck numbers! RT @HFilippo: 2• semana 🖤 #afazenda10 @ Itapecerica, Sao Paulo https://t.co/nY3LjO9dai Acho que deveria ter uma regra de soltar a @APMinerato em todas as festas da Fazenda! Ela entra na festa, vira a Eu Na Vida, causa Minerato estaile e depois tiram ela. De maca. Hahaha! #AFazenda10 #EuNaVida4Ever Na festa Hollywood o Rafael Ilha é o Men In Black versão brazuca! 😂 #AFazenda10 Passar esses diazinhos na Fazenda não é pros fracos de coração! #AFazenda10 Jon Snow de Itapecerica virou o Rodrigo Santoro depois de uma chapinha! #AFazenda10 RT @UnileverBrasil: @RaonyPhillips @marcosmion DEMAIS, né, Rao? Bora se unir e fazer o BEM? Você, a gente e, claro, não podia faltar o noss… Pode ser quem for, rolou um beijo todo mundo virou 5’ Serie B! Hahahaha! #ProvaDeFogo ROLOU!!! Gabi Prado e Jon Snow de Itapecerica são um casal! #ProvaDeFogo Quem assina o @SigaPlayPlus vê a primeira reação real dos peões após a eliminação! Antes de pegarem celular, antes de conversarem com a família! È animal!! https://t.co/6uNG2b1p2z RT @PgmDoPorchat: O @MarcosMion ainda afirmou que é essencial que os pais se aproximem das filhas #ProgramaDoPorchat https://t.co/T9uMvZKnQ9 Obrigado Martinha! ❤️ https://t.co/hAE4XqpPae Ganhei a madrugada!! 🙌🏻 https://t.co/GdDBS60jy5 Ainda bem que vc tem percebido, Sr Lendário do Twitter, pois é sua voz que ecoa na minha cabeça dizendo que é tudo complicado de entender! 😂😂 https://t.co/p7ZOnCPv28 Nao! Pode chamar qq peão. Cada um faz sua estratégia ... ou não faz nenhuma! https://t.co/EAfOAA4YqL @_jutobias @HFilippo Primeira eliminada da temporada 2018! @vidavlatt .\nE aí, concordaram com a eliminação? .\nComo vcs acham que o jogo vai mudar agora?\n.\n#AFazenda10 https://t.co/Jb303YfT7T @ValescaOficial Hahahahaha! RT @SigaPlayPlus: Pessoal, estamos posicionando câmeras e tudo mais. Daqui a pouquinho, tem Cabine de Descompressão com a eliminada da sema… RT @fazendarecord: Você não é nem doido de perder este momento! #EliminaçãoAFazenda\nAcompanhe o reality também pelo https://t.co/sJRe2qQaI8… #EliminaçãoAFazenda https://t.co/UMZpDOIygm RT @rocarelli: Hoje, 22:45, a primeira eliminação da temporada da Fazenda! #EliminaçãoAFazenda Como campeão do @dancingbrasil (sim mano! Especial de Natal! Caí e ganhei!!) desejo boa sorte pra todos participantes!! Que seja uma temporada LINDA! #DancingBrasil O monstro tá saindo da jaula!! E não é o Léo Stronda! #RafaelIlha #AFazenda10 #AFazenda10 no ar! Fiquei muito feliz com seu vídeo @mauriciostycer - um reconhecimento confortante pra quem esta prestes a completar 20 anos de carreira! Muito obrigado pelas palavras, pela visão e pela generosidade de expor sua opinião! 👏🏼🙌🏻 https://t.co/MtcGu69eLy IMPERDÍVEL!! https://t.co/IfV5gPYyzk Se vc é pai ou mãe... https://t.co/1F6Vbccm3a RT @recordtv_rio: Vote agora no https://t.co/LHJUpBOsZJ na peoa que você quer que continue em @FazendaRecord.  🤠 Você é do time @VidaVlatt… É alegria mesmo! 😄😄 https://t.co/NohcCpIyvv Hahaha! The Farm Arena!! https://t.co/G5pv8vJfE9 E o que Esquenta a nuca essa desgraça?? Mais que um mullet! https://t.co/EhSmnGLKs0 🙌🏻🙌🏻São anos de Legendarios pra pegar a mãnha! Kkk! Valeu Gilson!! https://t.co/9LOTTJ24LU Hahahha! Quem viu, viu!! Abs mano! https://t.co/2FrSMfdIfu @chicobarney @CaioBorba Terminaria com “NACHOS”. #ProvaDoFazendeiro https://t.co/TfgQj5SfdM #TamoChegando! Comentem o programa aqui comigo! #ProvaDoFazendeiro https://t.co/3NkjOpVA0x AooooOooo! Hj é dia de #ProvaDoFazendeiro ao vivo! Quem vai subir com o chapéu na cabeça?! https://t.co/rPfxeeloDp RT @PatriciaKogut: Nota 10 para Marcos Mion no comando de “A fazenda”. Mais em https://t.co/rYdPkin8m6 https://t.co/jTEUtPwfym 🙂🙏🏼 Sim, ainda existimos!! Os comunicadores que são artistas de formação! A mistura, na minha opinião, é a ideal! 🙌🏻 https://t.co/7m94opnUsg RT @FagneerVileela: Deixa eu comentar rapidinho: O @marcosmion está se entregando de uma maneira que nunca tínhamos visto antes. É um apres… Né? Mas falei isso pra eles tb e pro resultado, eles acataram! Kkk! Que intensidade para uma primeira roça, não?!! https://t.co/q0GPpnDZWT Obrigado pelo reconhecimento, parceiro! https://t.co/htWpF420Sk Aeeee!! Obrigado querida @ValescaOficial - @SoniaAbrao vota em mim!! Nunca ganhei, poxa! https://t.co/Nm9AbsGuyU E aí twitterland?? Quem volta fazendeiro amanhã?? RT @HugoGloss: Jon Snow de Itapecerica hahahahaha #AFazenda10 https://t.co/nGQUNkvsst Votação começa já já! https://t.co/zKB5k7I470 RT @fazendarecord: Boa noite, senhoras e senhores! Está no ar a primeira #RoçaAFazenda 🤠 Façam suas apostas e acompanhem também pelo https:… AOOO! Senhoras e senhores... #CHEGAMOS!\n.\nE hj tem a primeira formação de roça da temporada! Quem vcs acham que vai ser indicado!?\n.\nComentem o programa aqui comigo! #RoçaAFazenda https://t.co/KwcZuXItJR #RoçaAFazenda https://t.co/4WfPHsGO9Z @TVaVer https://t.co/I4H3xLul1Y Hahaha! Uma das ideias que eu tinha dado era soltar o @ttmionzinho nas madrugadas pela Fazenda!! Pra fazer o que quisesse! https://t.co/Hnb1SR0hXw Fazia tempo que não ganhava um 10zinho!! Valeu @PatriciaKogut 👏🏼👏🏼 https://t.co/1ZYJ9Qvpmg RT @UnileverBrasil: @juzao @babi @naosalvo Pessoal, se tiverem dúvidas, podem perguntar ao @marcosmion, ele está de prontidão para ajudar.… Kkk! ❤️❤️❤️ https://t.co/7YbUcSn73G Por mim deixava constante!! Um reality sem fim! So ia somando gente!! https://t.co/wGcDAqvANq Qual é essa relação estranha entre ex-jogadores de futebol e o xixi nos móveis quando estão em reality shows?!? #AFazenda10 HAHAHAHAA! Esse grupo promete demais!! Não deu nem uma semana lá dentro! HAHAAHHA! #AFazenda10 To sabendo que a festa foi “movimentada”...eu tive que dormir! Já tava há 48 horas com a persiana aberta! Não aguentei! #AFazenda10 @HFilippo @chloecopley_05 @YgorFremo Ownn RT @UnileverBrasil: @PatiMariano @marcosmion Oi Pati! Desde 2014, os resíduos sólidos das nossas fábricas são destinados para reciclagem, r… HAHAHAHHAHAHA! Como alguém lembra disso?? Que Perola!! https://t.co/rNmiXPENHb RT @velhopaull: o @marcosmion botou TODOS os apresentadores de reality no bolso e tirou onda. Num cenário de trocentos realitys, ele conseg… 🙌🏻🙌🏻 https://t.co/FoujNDluDT RT @mebokz: @marcosmion Não é a toa o tanto de elogios que você tá recebendo! Fazendo história em #AFazenda10 👏🏼😍 Hahahah! Eu pesquei uns 10 lambari esperando acabar! https://t.co/2cxNnZWAoa RT @juba_valentim: @marcosmion Você se entrega em tudo que faz ❤\nTa incrível na fazenda. O melhor até agora Nas primeiras eu ainda tava na Mtv! Kkkk https://t.co/YEBM8V9UrT RT @muitoprafrente: @marcosmion Vc está sendo o melhor apresentador de todas temporadas..\nParabéns 👏\nVc é super participativo \nNota 10 Me arrastando! https://t.co/RqognIqyyb Prova acabou em torno das 3:00 ou 3:30am! Muito difícil realizar essa prova ate o fim! https://t.co/mHAYZbWEYn Quem aí tiver gírias boas de interior, de Fazenda, de mundo sertanejo, me manda aqui!! RT @RoneyLR: Revelação do século @marcosmion  em #AFazenda10  Nasceu pra isso, só pode. Soube hoje que fui o primeiro apresentador a ficar até o final da prova!! Cheguei em casa 4:30am! 💪🏼💪🏼 me acabei lá com eles! Vai dar pra ver na minha cara quando eu anunciar o time vencedor! 😂😴 Que momento a Cátia esfregando os calo do pé no chuveiro!! #ValeAPenaVerDireitoFeelings Hahahaha! É verdade isso? https://t.co/fpKhPy0oP0 O nível de discussão da primeira roça desse elenco é de meio da temporada! \n\nComo eu sempre falo: as coisas escalonam muito rápido com esse elenco!! #AFazenda10 RT @recordtvminas: Vem com a gente! #AFazenda10 com @marcosmion está no ar 🤠 https://t.co/iyjtAKW72w Gosto tanto da #AFazenda10 que mesmo sendo o apresentador quando to em casa fico assistindo! E curtindo! Até esqueço que sou o apresentador! Hahaha! RT @fazendarecord: E com muito gingado, @MarcosMion passa para lembrar que na próxima quarta (26) tem estreia de @DancingBrasil, às 23h 💃🕺… ❤️❤️ https://t.co/4AU5CPyuRq Kd? To aceitando sugestões!! https://t.co/YTGkFYMtEX @naosalvo @juzao @babi @taviao @luscas Hahaha! O desafio desta vez é consciente e não inconsciente como na Fazenda! Se liga! Lancei um desafio aqui pros meus amigos do Twitter.  Dá um play no vídeo pra entender e vem participar! @naosalvo @juzao @babi @taviao @luscas...\nVou ficar de olho nos tweets de vocês, hein? #CadaUFazOBem #ad https://t.co/UxtEZuTfzY Estamos a postos! Esse time especial e eu estamos prontos para te mostrar que quando você escolhe um produto Unilever você está fazendo o bem para o mundo. Bora nesse movimento? Mandem suas perguntas! #CadaUFazOBem #ad https://t.co/p1UZSVUWA8 Se liga no que eu achei aqui na minha visita na Unilever! Sabe essa geladeira que tem em TODO lugar vendendo sorvetes Kibon? Pois é, ela emite muito menos CO2! Até nisso os caras se preocupam.  #CadaUFazOBem https://t.co/H6WsTWCrq7 Se você pudesse fazer o bem pelo mundo diariamente, o que você faria?#CadaUFazOBem Senhoras e senhores, cheguei! Liga o som e vem comigo nesse dia aqui na @UnileverBrasil. #CadaUFazOBem https://t.co/7WQkW8aaFl RT @FabioPorchat: O @marcosmion nasceu pra apresentar A Fazenda. Estreou faz três dias e parece que apresenta faz três anos. #AFazendaAoVivo RT @ttmionzinho: Claro que o @marcosmion manda bem na Fazenda, o que ele mais fez na tv foi liderar um monte de loucos! É só mais um dia no… #AFazendaAoVivo https://t.co/VxqjWgkBkS RT @FlavinhaViana: Começouuuuu #AFazendaAoVivo RT @fazendarecord: E aí, em qual desses grupos você se encaixa? 😂 #AFazendaAoVivo\nAcompanhe também pelo https://t.co/sJRe2qQaI8 https://t.c… Senhoras e senhores... #CHEGAMOS! \n.\nE hj com a estreia da #ProvaDeFogo 🔥 \n.\nComentem o programa aqui comigo! #AFazendaAoVivo https://t.co/dIGZRxYTvD Querida!! ❤️❤️ https://t.co/EhOsQgNjWI Eu Tb!! 😩😩 Kd o magro??!? https://t.co/hI99UYaIwc Eu acho excelente ideia!! Mas não sei qual a viabilidade disso. Mas tenham certeza que, pelo menos pra mim, o TT é MUITO importante!! https://t.co/lNr4hGd5im Hahaha! S2 https://t.co/FChzEDqWzq @ELIANEC50336536 @fazendarecord Mas não é isso que o Brasil quer? Kkkk @carmottina Calma!! Kkkk! Eu Tb!! Tão sentindo o cheiro?? É #FogoNoFeno - to sentindo que em breve começa a TRE-TA! #AFazenda10 Senhoras e senhores... #CHEGAMOS!\n. \nComentem o programa aqui comigo! #AFazenda10 https://t.co/9ePBkv9HEs 👏🏼👏🏼👏🏼👏🏼 https://t.co/l4nvosaSE2 Kkkk! Eu tb to esperando!! Tava no texto da chamada que eu gravei mesmo, mas até agora nada! Vai ver eles estão guardando algo pra mais pra frente...eu não sei! https://t.co/nUXhAkexCw Poxa...nem me lembra que da vontade de chorar de novo... https://t.co/jVNMZ2rYjd RT @odhannyd: nossa a coisa que mais agradeço nessa fazenda não é nem o elenco, pq todo ano o elenco é promissor, mas sim o apresentador. @… Hahaha Ju! Vc me conhece... https://t.co/heRS9U0toj RT @fasbricio: sem dúvidas a melhor coisa dessa edição de #AFazenda10 tirando os participantes ícones, é a apresentação do @marcosmion pare… ❤️❤️❤️ https://t.co/4dXPq93eue RT @matheuslaneri: Porra que diferença com o @marcosmion apresentando. Olha a empolgação, olha a alegria. Empolga muito mais em ver o progr… RT @muriloribeiro: Renasce um clássico! #AFazenda10 tem tudo pra emplacar! E @marcosmion já chegou dando um banho de carisma! Esse Tweet vai pra moldura! Guguzola!! Te amo!! Obrigado querido! https://t.co/F1uMoyMNqf Valeu meu mano!! @nasseroficial https://t.co/MBZ2DTJKi1 @PauloVieiraReal Obrigado irmão!! Obrigado meu amigo @FabioPorchat e @mauriciostycer pela crítica que escreveu! To muito feliz!! https://t.co/yNu2JImMhv RT @DanielKastro: Marcos Mion é a cara de A Fazenda e faz esquecer os engessados Justus e Britto Jr. &gt; https://t.co/2HPXIsvRPd | #AFazenda1… RT @mauriciostycer: Novo apresentador, Mion parece comandar #AFazenda desde que nasceu  --&gt; https://t.co/KSsI941sjZ https://t.co/v8kvK31rP3 RT @camilets08: Agora estou ligada 24h na Fazenda. #PlayPlus https://t.co/Seg0kFFVej RT @chicobarney: Atenção! Hoje no último bloco de #AFazenda vou revelar o nome do campeão desta temporada. E vocês sabem muito bem que eu n… Hahaha https://t.co/Pvrpqa9sqp E aí... to aqui no intervalo do vt e to lendo tudo enquanto isso. Tão curtindo?! #AFazenda10 #AFazenda RT @HugoGloss: Já consigo dividir esse elenco entre aqueles que nos farão rir, aqueles que farão muito barraco e aqueles que farão os dois!… RT @gustastockler: Já tenho meu favorito! E vcs? #AFazenda10 Senhoras e senhores... #CHEGAMOS #AFazenda10 https://t.co/Xx0c7MwJX6 RT @HugoGloss: Passado com esse elenco! #AFazenda10 Começou! #AFazenda10 https://t.co/KJ4Ffsi44X RT @rocarelli: É hoje! #AFAZENDA10 estreia às 22:45! Imperdível! Hahahah. As 22:45 eu posto. Combinado?! https://t.co/3xghUlPMJJ É... chegou o dia! https://t.co/YO4XElltwF RT @Trouva: Meu whats hj... #AFazenda https://t.co/70P1IA87oe Atenção Fazenda Lovers!! Tem diquinha sobre hj à noite no meu último post no INSTAGRAM! E a gafe da Fe, zootecnista, entregando um participante no meu stories!\n\nÉ igual aqui: @marcosmion RT @marcosmion: Se liga no #HojeEmDia. Vou contar umas novidades pra @TiciPinheiro 🙃 https://t.co/cy0FFnRPkm Se liga no #HojeEmDia. Vou contar umas novidades pra @TiciPinheiro 🙃 https://t.co/cy0FFnRPkm Bom dia!! Hoje a lenha vai pra fogueira. A estreia poderia já ser hj!? Poderia... Mas como ainda faltam 24 horas se liga no último episódio do #EsquentaaAFAZENDA que acabei de subir. Só clássicos: https://t.co/ccI2c4UJmE Isso é verdade! Certeza que as vezes vou ter que lembrar de falar pq vou me pegar apenas assistindo como telespectador!! https://t.co/WTWyhmgqRU Empolgação que se estende pelos bastidores! Estive presente e atuante em todas fases do projeto! Sim, estou A M A N D O! Só espero não enlouquecer no meio do caminho! Kkkk https://t.co/AljEnLjats Ai meu coração... Quem são os 16 que vão morar aí?!? @fazendarecord https://t.co/xpvBHayfr5 Amanhã às 22:45, ao vivo, na @recordtvoficial !! #TamoChegando https://t.co/p6y457g6Wb Quem vcs acham que é esse que eu to falando?? https://t.co/qtXnJvzUMN A peãozada já entrou na @fazendarecord 👏🏼👏🏼👏🏼👏🏼 https://t.co/u530MUcoQr Saiu ontem... https://t.co/oBZ8pGyu8B RT @HugoGloss: ‘A Fazenda 10’: @marcosmion brinca com os filhos no ‘confinamento’ e mostra ambiente; assista! https://t.co/gVv2C1lrna 😍📸 #A… RT @DomEspetacular: Alô, alô, peões! O #DomingoEspetacular mostra alguns detalhes de #AFazenda 10, que estreia nesta terça (18), às 22h45,… RT @fazendarecord: Será que os peões estão com o currículo atualizado? @MarcosMion avalia candidatos para a #AFazenda 10, que estreia nesta… RT @pdrohaa: Muito bacana a entrevista do @marcosmion no The Noite. O cara tem uma história incrível com os filhos. Se garante demais! @The… A entrada vai ser nova! Muito, muito legal! Com a pegada do que estamos anunciando e prometendo para a 10’ edição! https://t.co/2MHJbIRgJy Eu adoraria! Uma das minhas ideias era que um fosse escolhido pelo Twitter! Com limite de um voto por pessoa! https://t.co/SWai3ODyrL Prometo que na terça, às 22:45, eu falo todos os 16! De uma vez! https://t.co/J5l0lig5A3 @oops_Flopei Vai ter no @SigaPlayPlus !! A entrevista pro @DaniloGentili foi o máximo! Amei! https://t.co/JG072AFjOX RT @Realinaticos: @marcosmion Mion, eu te amo, vc ta ressuscitando minha fazenda, Jesus ta fazendo.milagre até fora da novela &lt;3 Pretendo ficar aqui o tempo todo! Batalhei desde o começo do processo para vcs participarem de verdade de decisões importantes no jogo! Essa edição vai ser histórica! https://t.co/BlVVoGEGKJ Quando vc ver o elenco vai querer ver por eles Tb! Garanto! Kkkk https://t.co/oCJdycJccx 🙌🏻 to muito empolgado! Os pilotos estão ficando maravilhosos! Não vejo a hora de começar!! https://t.co/e6nNIjh3YP @MafiaKamikaze Valeu mano!! RT @jornalodia: Reality começa na próxima terça e será apresentado por @marcosmion @fazendarecord https://t.co/7QajjQCn8C RT @jornaldarecord: Contagem regressiva para a estreia da @fazendarecord, com @marcosmion! https://t.co/5f7QRDWlBB #JornalDaRecord Deve ter entrado no ar hoje. Gravamos! https://t.co/gpIIs6z75n Vou participar. Apresentando. https://t.co/k4D5HnT2E0 RT @eicamiis: \"Sabe um novo dia, da nova era, que já raiou? Fica no chinelo perto disso daqui\" hahahahahahaha 😂😂 @marcosmion que ícone de a… RT @Jeny_chaves: Mds, @marcosmion que homem, assisti a entrevista do Danilo gentili com ele e cara que exemplo de pai de homem e de ser hum… É verdade. https://t.co/6PwVWtr1lE Estou vendo essa minha frase em varias lugares! Orgulho pq é o tipo de pensamento que tenho que ajuda muita gente! ❤️ https://t.co/L6JwB5a113 Nem eu! To focado pra não bater o sino e voltar pra minha casa na primeira semana! Hahaha https://t.co/E677G0Pk8g Eu Tb acho! Muito orgulho dessa série! https://t.co/PibaCgokg1 Que prazer enorme ler esse Tweet! Muito gratificante ver o retorno deste movimento que estou me dedicando para termos pais mais presentes e mais amorosos!! https://t.co/Uc0DC1YdvV Hahaha! https://t.co/58DTYbTPKG Hahahahaha! https://t.co/bc8OKBaRvs @HFilippo Olha a pose dele, olha!! Pais da Nova Era é a série doc que eu fiz pro @SigaPlayPlus - assina pra assistir!! https://t.co/uktm4KVt04 Mesa redonda do #EsquentaAFazenda no ar!  -&gt;  https://t.co/G2OLV2lWhS https://t.co/26J1FsvoMO Iti malia... ganhei um novo Mionzinho?! 🤔 É hj no #TheNoite. @danilogentili @murilocouto https://t.co/0G9P6QQnNU Hoje estarei no The Noite!! Foi muito bom poder falar tanto sobre autismo, sobre meu livro Pai de Menina e, claro, sobre o tanto de maluquice que já fiz na tv! Valeu @DaniloGentili https://t.co/zswFO1BMgA RT @recordtv_rio: 🤠 @MarcosMion \"invadiu\" @FazendaRecord 10 usando óculos de realidade aumentada. 😎 Quem serão os 16 novos peões e qual ser… HAHAHHAHAHHA https://t.co/ivcwr4dW2J RT @fazendarecord: .@MarcosMion relembra os romances que marcaram #AFazenda e até os que só começaram depois do confinamento. Assista compl… Aaaahhh o amor no campo... https://t.co/5ONQewDqSW https://t.co/BUJ7tHDteX Nada melhor do que deitar com minha filha, meu amor e ouvir sobre seu dia...#PaiDeMenina #EsquentaAFazenda de hj no ar! Link pra íntegra https://t.co/XiracIX9Lr https://t.co/q4UVrwz7r2 Olha lá se não sou o adestrador de catchorríneos!!😂😂\n.\nHahaha! Único jeito de parar e acalmar essa creche de pelos é com #FosterPremium 💙🐶 https://t.co/JirTygm9wT https://t.co/6Nza0Lbhe3 peeeede pra sair! Vídeo novo da série “esquenta Fazenda” já no \nhttps://t.co/kHJm7AemJQ\nOlha o teaser pra ver a temática! 🤣 https://t.co/jWyDxKWIpF Quem vcs querem ver lá?!?!!?!?!?!?!?! https://t.co/Ra9miDo0h5 https://t.co/ZwhsvnWNcm RT @fazendarecord: Os ex-peões @YudiTamashiiro e @APMinerato revelam como sobreviveram ao confinamento e, com o colunista @chicobarney, rel… RT @chicobarney: Marcos Mion avalia, junto com o colunista Chico Barney, as estratégias e as participações dos ex-peões Ana Paula Minerato… Mais um vídeo da série “esquenta Fazenda” sobe hoje no meu canal do YouTube! O que vc acha desses candidatos? Quem vc sonharia em ver na @fazendarecord ??\n\nVai no meu canal do utube que o vídeo na íntegra tá Loko!! https://t.co/etZHlIZjI5 Olha o vídeo eu dançando com meu filho ainda bombando na Itália!! Amor não conhece fronteiras!! https://t.co/WwpppL5Gmg RT @fazendarecord: Contando os dias pra estreia de #AFazenda? @MarcosMion relembra os memes mais divertidos que fizeram história nas redes… 🙌🏻🙌🏻 https://t.co/FZiHSV7bJB @chicobarney Afinal vc é o LENDÁRIO DO TWITTER, po!!!! MARIAAAAAAAAAAAAAAAAAA https://t.co/rq3akFDMQK Quem ainda não comprou meu livro, aproveite a promoção na @amazonBR - só até hoje, Domingo! Segue o link:\n\nhttps://t.co/2xM9z0N6GY https://t.co/gNH7yhe2mJ HAHAHAHA! A Fazenda tá acabando comigo! Escrevo maior Tweet sobre o disco novo do Eminem e olha o primeiro comentário qual é...🤦🏻‍♂️😂😂 https://t.co/NA3ZyfVsco Se vc quer começar a mandar rap ouça a parte do Eminem na música Lucky You do disco novo “Kamikaze” pra aprender sobre bar and flow. Pelamor...a capacidade desse cara é insana. Mano...a internet estraga muita coisa boa. Como tem tanto hating em cima do “Kamikaze”, disco novo do @Eminem ?Como ele mesmo fala em uma das letras: pra falar alguma coisa faça melhor ou pelo menos igual a mim.\nEssa deveria ser a regra do TT: se criticar e ñ for melhor, banido. RT @RedattoreSocial: Il ballo scatenato di un padre con il figlio (autistico) sulle note di Elvis. Il video, postato da @marcosmion, presen… O que realmente importa é o quanto nos dedicamos a sermos seres humanos dignos. \nPq somos artistas, publicitários, médicos, engenheiros, advogados, etc...por um período curto da nossa vida. \nO que importa é o que está por trás do que dizemos que somos. Isso é a vida. RT @OrgulhoMion: pra quem perdeu o @marcosmion na rádio globo link aqui https://t.co/l4E780Bdlu Entrando ao vivo agora na Rádio Globo no programa do meu mano @otacosta !! Liga aí!!! RT @HugoGloss: Eita que o bicho vai pegar! A Record anunciou hoje que a décima temporada de #AFazenda estreia dia 18 de setembro com o coma… RT @recordtvminas: Quem você quer ver na nova temporada? 🤔 #AFazenda sob o comando de @marcosmion estreia no próximo dia 18, aqui na @recor… Anotado? https://t.co/UoVm0tU0dJ É revigorante e inspirador para qualquer artista acompanhar o Nos Vozes Eles - novo projeto da minha amiga querida @SandyLeah com meu mano @Lima_Lucas 👏🏼👏🏼👏🏼\n\nLembrando que o @Lima_Lucas roubou a @SandyLeah de mim fantasiado de anjo 😄 #NeverForget Isso é resultado de criar gerações! Que honra pra mim!! https://t.co/csYocUj04H Depois de anos fazendo com o @ttmionzinho , fiz com os Mionzinhos de sangue! 🤘🏼😂 https://t.co/5d5E1m2RSN @ttmionzinho Hahhahaha @eduardocosta @Legendarios Adorei relembrar irmão!! RT @eduardocosta: #TBT ao lado do meu amigo @marcosmion no programa @Legendarios contando um pouco sobre minha vida! \nObrigado pelo carinho… @chicobarney Hahahaha! Eu Tb! Será?? RT @SabrinaNaRecord: Ainda não baixou o https://t.co/e4P7p18krb? Está esperando o que? @marcosmion e @SabrinaSato já deram o recado! Não pe… Gostaria de ver algum deles de volta na Fazenda?! https://t.co/5IUUgqaXXW #EsquentaAFazenda mode on! https://t.co/R3ZNW6IOTs E agora @YudiTamashiiro ??? https://t.co/Y2Pa33yAXB Já ouviu essa voz? \n\nhttps://t.co/2H5ryAPTen Aquele salgado é de que?! https://t.co/14v9yVBGox @pefabiodemelo Hahahahaha! Que fase... Quem aí sente que nos somos o mano e os problemas a árvore?! Kkk https://t.co/O7Nur2zGSE Vou fazer uma live ensinando a fazer slime com a Doninha e umas amigas agora no Instagram!! RT @fabifortti: Top demais!!! A voz dela é perfeita... @MarianaCoelho_ @marcosmion @rickbonadio parabéns e sucessooooo... \nMariana Coelho -… Muito amor neste #TBT ❤️❤️❤️ https://t.co/D3SrokGams Sobre o figurino da @fazendarecord que eu e @HFilippo bolamos! Minha Fazenda tem que ser estaile, mano! Nem vem! Kkkk https://t.co/WZIGoWIOYN Gravando as chamadas oficias da @fazendarecord - #TamoChegando https://t.co/OuYSJv8RvQ RT @chicobarney: O único debate que importa: discussão sobre #AFazenda com @marcosmion @FlavinhaViana @carlinhoshumor. Estreia em breve...… RT @HugoGloss: Que voz linda!!! @MarcosMion investe em ex-The Voice, que lança música e clipe: 'Ouvi e fiquei maluco!' https://t.co/a7lqcLI… Meu tenis que viralizou pelo mundo!!\n\nhttps://t.co/ubn4u3b2oT Vídeo novo no canal: https://t.co/ubn4u3b2oT e esse vcs pediram mto! https://t.co/hxICA0Z72l Muito feliz com esse retorno!! 💙 https://t.co/ZyxlBV4uvS E meu livro #PaiDeMenina continua em primeiro lugar na lista dos livros não ficção mais vendidos do Brasil! 🙌🏻Que coisa maluca! Obrigado a todos que compraram o livro e estão construindo relações para a vida inteira com suas filhas! ❤️ https://t.co/4ZXwnnzOtn #EsquentaFazenda. Quem tá ansioso?! https://t.co/rVopcASxCv Já tá disponível no @SigaPlayPlus minha série documental sobre PATERNIDADE chamada “Pais da Nova Era”! Um trabalho lindo e inspirador pra todos os pais! Com @piangers @Junior_Lima entre outros! Obrigado! Esse vídeo tá dando o que falar...rsrs https://t.co/2gPGsXgBjo RT @QuebrandoOTabu: \"Xingaram\" o filho do @marcosmion de gay na escola. E ele mandou bem demais em como tratar a situação  \nEm entrevista p… @HFilippo @AFazenda HAHAHHAHAHHAA Eu tb Mari! E to muito orgulhoso do nosso trabalho!! @MarianaCoelho_  @rickbonadio 💪🏼 https://t.co/XySfoFyQZD RT @gutembergbraga: Ganhei o livro do @marcosmion e já entrando na irmandade #PaideMenina. Fique tranquilo, Marcos, guardaremos os segredos… Que ideia LINDA que o @Drake teve pra fazer o clipe de God’s Plan! Eu só assisti hoje de manhã e é muito emocionante!\n\nhttps://t.co/rRTPSte0CP Silvio Santos é um dos maiores dons da comunicação que o planeta já viu. Atenção pais!! @dovemenbr me convidou para lançar uma campanha sobre a licença paternidade, lutando para que nos, homens, tenhamos o direito de poder passar mais tempo com nossos filhos! Entra no meu Instagram pra ver o vídeo onde explico!  É @marcosmion 👏🏼👏🏼👏🏼 Taqui o programa da @CBNoficial da querida @petriachaves que foi ao ar ontem:\n\nhttps://t.co/x06vnSGtoV @petriachaves Amei! Vc é demais! RT @maispsicologos: @marcosmion falando sobre a importância de lutarmos pelo feminismo de diferentes formas\n\nMais do que apoiado essa causa… Pra quem não conseguiu ouvir na @CBNoficial ... https://t.co/Jy6Lxtkz7Z Hoje acordei ouvindo Legião Urbana... Entrevista legal sobre o atual momento de autor mais vendido no país!! (Caramba...eu não consigo falar isso sem rir! 😂😂 Que loucura...)\n\nhttps://t.co/KTyaFvdHko @HFilippo @graficosdePS1 Hahahahhahaha https://t.co/KTyaFvdHko Quem quer garantir presente pro dia dos pais? Link pra comprar meu livro é esse:\nhttps://t.co/ACNG1mZRxM Que demais! Ainda não caiu a ficha que é o livro mais vendido do país na categoria não ficção!  Na frente de Sapiens...?? Oi?!? https://t.co/5roJD0uwZY https://t.co/Yic1bbeQww Acordei com a notícia que meu livro é O MAIS VENDIDO DO PAÍS!! Que sensação loka...mesmo já tendo conquistado tanto, é uma sensação diferente de tudo! Que ORGULHO! QUE??!? Não da. Essa apresentação da Thaís foi MARAVILHOSA!! Não levantaram nem 90??? Desce lá e canta melhor todos que ficaram sentados. Mano...que raiva. #CantaComigo - esse programa tá acabando comigo, gente!! Tem um Elvis na plateia dos jurados! Hahaha! Eu quero ouvir a opinião dele! Ele é tipo aquele SuperHomem da plateia do Faustão! Levanta e dança pra tudo! A pessoa mais feliz do estúdio! Hahaha! #CantaComigo É o que to falando!! A Gretchen sou eu aqui em casa!! https://t.co/rg9di4tHdk RT @carasbrasil: .@marcosmion reúne a família em lançamento de livro sobre paternidade --&gt; https://t.co/91C44nA5Do https://t.co/N2mPc89slv PARA!! 94??? Da o microfone pra quem não levantou e pede pra cantar melhor!! To P mano!! Esse programa me deixa nervoso demais! 😂😂 Se essa mina do Let’s Dance não levantar os 100 ninguém mais levanta!! #CantaComigo Po...me dá nervoso ver uns jurados que não levantam pra poder aparecer no final da musica!! Mano, para!! Tem candidato ali que não tem como não levantar! A Thaís cantando Queen não foi 100?!? Come on!! 😒 #CantaComigo @chicobarney Muito bom!!! Quem ainda não comprou presente pro dia dos pais? \n\nhttps://t.co/ACNG1mZRxM Eu quero muito! Estamos tentando bater agenda pelo menos pras grandes capitais. Mas com A Fazenda tá meio difícil... https://t.co/vnHoWkgVHn 🙏🏼🙏🏼 https://t.co/eAWtBC4yVq E a corrente de amor do meu vídeo com Romeozão, continua tomando o mundo...💙💙💙 https://t.co/G20PmzY02V RT @LuisMorais: @marcosmion Um livro com muito amor!!! #paidemenina https://t.co/Ld5eCO1Njh Estarei autografando meu novo livro hoje, as 18:00, na Livraria da Vila, na Al Lorena! ESPERO TODOS VOCÊS!! https://t.co/Rm7WyVUXHy Amanha na Livraria da Vila da Al. Lorena tem o lançamento do meu livro #PaiDeMenina - ESPERO TODOS VOCÊS!! Aproveitem que o dia dos pais tá chegando! https://t.co/5aCV7QiPa8 @feltrinoficial Bon Jovi - New Jersey Lista dos livros mais vendidos da @folha 🙏🏼🙏🏼🙏🏼Obrigado a cada um de vcs que compraram meu livro novo! https://t.co/c2IBcWRies Que dia incrível! Hoje recebi a notícia que meu livro “Pai de Menina” estreiou em 4’ lugar no ranking dos livros não ficção mais vendidos DO PAÍS! E ainda nem foi o lançamento… https://t.co/LPFln2gLs0 PARABÉNS pro meu irmão oriental @YudiTamashiiro 👏🏼👏🏼👏🏼 Minha criança japonesa tatuada, que Deus abençoe teu caminho, tuas escolhas e tua arte! Conta sempre comigo mano!! ❤️❤️ Pra quem ainda não viu o vídeo que gravei com meu filho que viralizou pelo mundo: \n\nhttps://t.co/bAIXeC5kHK\n\nEle é a prova que o amor viraliza sem fronteiras e nem barreiras de linguagem ou interpretação! ❤️ Missão cumprida com meu livro #PaiDeMenina 🙏🏼🙏🏼 https://t.co/hPpcsvp592 Que mega elogio!! Adorei! https://t.co/op3E3Eb3tj RT @WesleyoGomes: Mano, eu dormi e acordei pensando na entrevista do @marcosmion, eu ainda não quero ser pais, lógico.\nMas ouvir ele da aqu… 😊🙏🏼 https://t.co/93z5YPqr3S Só vc escolher direito! Não aceite nada aquém do que vc sabe que merece! ;) https://t.co/YOVE1nJ3w7 Sim...é isso! https://t.co/L6IGvW6kvx RT @murilobj: Hoje teve @marcosmion no @programapanico e foi uma das melhores entrevistas que eu vi até hoje! Se um dia eu for Pai, quero s… Nossa!! Eu não sabia que este meu vídeo tinha viralizado pelo mundo!! QUE IRADO!! Matéria no jornal El Pais sobre a vitalização! 🙏🏼🙏🏼 https://t.co/qFJ4KJseNE Que mensagem linda de receber... https://t.co/YCDqCrjFvj RT @santoEvandro: @marcosmion responde!!! Danado! https://t.co/HRZLurejiZ 🙌🏻😊 https://t.co/EQfeuGQWgp Obrigado a todos que ouviram! Foi demais! https://t.co/uT6OfEjH1x https://t.co/k502GB9IVv to lá Entrando ao vivo no @programapanico  na @radiojovempan AGORA!! Liga aí pra ouvir e participar!! Segura essa @Lima_Lucas 😘 https://t.co/NRSU1g8R3q Love you back bro! @nickcarter When will you arrive here? We got to do a Don’t Go Breaking My Heart rendition!! Car pool karaoke style!! What do you say? https://t.co/NRSU1g8R3q Mano do céu!!! Acabei de ver que o Nick tuitou minha interpretação de BSB no carro de hoje!!! MURRI!! E não marquei ele que é pra ele achar que to na moral, tá ligado? Agindo naturalmente! Mas to tipo: AAAAAAAAAAHHHHHH! No próximo eu respondo pra ele tipo brother! Kkk https://t.co/NRSU1g8R3q RT @radiojovempan: Nesta quinta (2) tem @marcosmion no #Panico! 😎 Acompanhe ao vivo a partir de 12h pelo rádio ou YouTube, em https://t.co/… Sonhei que eu tinha entrado na @fazendarecord ... mano, que noite loka. Entrado como participante!!!😳 E ficava gritando que não era pra eu estar lá, mas eles me olhavam com aquela cara de médico de hospício de quando o louco diz “eu não sou louco”!! E me empurravam pra dentro! @allexjr Facil!! @MarianaBelem Nao vejo a hora de estar lá vivendo a insanidade! Kkkk De volta ao Brasil! Obrigado @AviancaBrasil pela equipe HIPER atenciosa fazendo nossa volta para casa ser perfeita! \nE agora, 100% efetivo, vamos à Fazenda! Que a loucura dos peões me leve a mares nunca d’antes navegador na minha carreira!! RT @LucasJandrey_: A coisa mais legal de Julho foi ver o @marcosmion abrir 1 tênis por dia, e, acabou ☹️ 🙏🏼🙏🏼🙏🏼 https://t.co/Cv0ED8cyVE Aí eu fico feliz!! https://t.co/GlDdpPHQOm @chicobarney @Tatawerneck Se pensar da onde ela saiu, não. Porém, Com o sucesso que ela tá fazendo na emissora, sim.\nLoco mesmo seria ver um meu! 😂😂 RT @Gui_emmerich: @marcosmion mostra, mesmo que só o lado bom, que existe limites e que cada filho tem um lado a ser explorado. Além de inc… RT @Gui_emmerich: Muitos ainda dizem \"po, ai é  facil ser filho do cara que tem grana pra caramba\" mas acompanhar o @marcosmion e a diferen… RT @Gui_emmerich: Sou tio e padrinho, família grand  e cheia da nova geração. Meus irmãos já são pai mas, na moral e com todo respeito, que… @Gui_emmerich Valeu Gui! Obrigado pelas suas palavras e parabéns por sua consciência e sabedoria! Grana não tem nada a ver, só ver a enorme porcentagem de crianças infelizes, sem atenção, sem amor e sem dedicação com pais milionários! Obrigado! 👏🏼👏🏼👏🏼 Meu melhor projeto até hoje! https://t.co/EUV6CHRtbu Verdade! Próxima temporada quero patrocínio, senão vai ser impossível! Kkkk! Tendeu @adidasbrasil @nikebrasil https://t.co/Lmu8wYPkyn Que honra Brunno!! Muito feliz em ler seu tweet. Bom demais saber que coloquei um tijolinho na construção da relação linda que vc vai ter com suas filhas pra vida toda! Deus abençoe!! https://t.co/3e0Zu0sErC @HFilippo @mtesperon Ownnnn que bebezíneo! No colíneo! ❤️ Hahaha! Quem não lembra desse clássico?!? Adorei rever! https://t.co/8XnCmGDLUl @chicobarney O rumo que a humanidade está tomando me assusta. @mauriciostycer Hahahaha! Pronto. A vida responde. Poxa...muito triste pela @ddlovato - quando fico sabendo dessas situações minha cabeça fica imaginando o que a pessoa passou pra chegar a esse ponto e isso derruba o astral. Muita compaixão e tristeza. Li agora que ela está estável e com a família. Graças a Deus! 🙌🏻 Hoje. 20:45. @recordtvoficial https://t.co/LGXcOhVjJI RT @NBABrasil: Pra animar a sua segunda-feira, se liga nessa CRAVADA de uma jovem versão de @KobeBryant! Quem tem boas lembranças do #Black… @pjcmota Excelente observação! Hahaha! Cena de filme de comédia!! 😄😄😄 https://t.co/uryPDtq54r @diegofelp @thejuniorcosta Certíssimo! Não sei pq ainda tem a Casa Branca e o Pentágono! Pra que a ONU?? Que os líderes mundiais resolvam tudo pelo Twitter! É isso aí! Cada um fica na sua casa, desfilando poder em palavras pros seguidores vibrarem, ganhando like e quando encher o saco manda as tropas!👏🏼 Mas sinto um dó da galera do mundo pq se o mais poderoso do planeta decreta o Twitter o lugar para se posicionar sobre questões de política interna que podem gerar a morte de milhares numa guerra sem precedentes,como que o Zé Mané que tá em casa não vai espalhar ódio por aqui tb? @izaquebastos Sim, e é no Twitter que se resolve esse tipo de coisa! Vc e ele estão certos. Parabéns! 👍🏼 @7d434cf40e0d462 Meu amigo, o problema é que nem vc, nem a maioria está considerando o real problema: ele está tratando esses assuntos via Twitter!! O que ele acha que o Iran vai responder via Twitter e eles vão ver quem ganha mais like? Tá errado, irmão!! Guerra!! Política interna! @maumelgaco Só pode!! Eu ia escrever isso! Hahaha @LoiraBurra11 Finalmente UMA PESSOA que entendeu o propósito do tweet! Obrigado! Os especialistas em geopolítica que estão comentando não conseguem entender que o cara está fazendo isso VIA TWITTER!!?! Pelamor... @thejuniorcosta Sim, e o Twitter é o lugar correto pra cuidar desse assunto! 👍🏼 Twitter .... que lugar que tinha tudo pra ser bom e um monte de brasileiro estraga com a maldade que tem dentro de si. É HILÁRIO que todos comentários descabiveis que respondem a uma opinião com ofensas pessoais vem de pessoas que enchem de #Deus suas bios. Que triste. @chicobarney Hahahaha! @GameTime_BR Hahahahahahaha Mano...esse cara tá comprando guerra com o Iran via Twitter?!? Como sempre eu pergunto: CADÊ OS ASSESSORES DESTE IMBECIL?!? Po, nas séries os presidentes tem 10 assessores pra qq coisa! Tudo é revisado. Quem deixa esse maluco tuitar sozinho?! https://t.co/n0qs2aVSk7 @eurenesilva Hahaha! Nada mais humilhante. A gente se sente ignorado, o que é a pior coisa! @ItsMariG Já comecei, mas abandonei. Devo insistir? @brunomotta Sim! Demais! @felipesolari Já assisti Orla! Achei demais!! Alguém indica uma série da Netflix que não tenha advogados, assassinatos e nem florestas, cavernas e chuvas mágicas? E nem nada relacionado a morte. Alguma? @manuticiap @HFilippo @HFilippo Hahahhaha! Te marquei e só depois vi que foi vc mesma que postou!! Isso que é um post certeiro sobre vc! 😂😂Love you!! @manuticiap @HFilippo @HFilippo Começando uma live no meu insta pra Doninha ensinar as mães e meninas como ela faz slime AGORA! Avisa a molecada!! Uma coisa que eu queria que fosse verdade: aqueles 2 segundos depois que vc da uma topada com o dedinho na quina da mesa que parece que não vai doer, que não vai ser nada, sabe? Imagina que delicia se fosse “hey! Não é que não doeu mesmo?”. Mas sempre vem a dor alucinante no 3’ Poucas raivas são tão RAIVAS nessa vida do que quando o Candy Crush não deixa vc passar de fase por meses!! AHHHHHHH!! 🤬🤬 Sempre foi “a @JessicaBiel é muito sortuda de ter casado com o @jtimberlake “ . Aí vc assiste a The Sinner e vira “mano! O Justin é muito sortudo de ter casado com a Jessica Biel!!” Que mulher! Que atriz! Que série IRADA!! @zucatelli ❤️Zuca!! 🙏🏼 https://t.co/BcPrEBqegy Só quero dar um abraço forte em cada um de vcs que dividem tanto amor comigo e com minha família pelos comentários. É muito carinho e admiração! Enche meu dia de boas vibes!! ❤️ 😊🙌🏻 https://t.co/Gae9lKeAId 🙏🏼 https://t.co/h2WOxXdGXC @sneakersbr Pra mim nenhum bate o 4. Tamo agilizando!! Acho que esse ano vai ser mais difícil pra vc acertar o vencedor... só acho! 😂😂😂 https://t.co/pGQMk8sqm1 @GameTime_BR O shoot é mais bonito que o do Lonzo! Hahaha Hahaha! Vai valer a espera!! 🙌🏻 https://t.co/pGQMk8sqm1 RT @Trouva: https://t.co/OQEtiwHyda :) @marcosmion https://t.co/262PLYZIVa Quem quiser assistir e saber pq dinheiro nenhum compra esse meu tenis, clica aqui: \n\nhttps://t.co/kHJm7AemJQ https://t.co/0iv1zwk92J Marcamos época de fato!! O programa era o Descarga Mtv! https://t.co/sGT5HuFDgs @j_rs Nossa! Marcou minha infância essa cena!! Isso é verdade! Ficamos eu e ele muito emocionados no @Legendarios - que foi o primeiro programa de tv que ele foi! @mckekel_ https://t.co/339tX6M6rz Um dos meus preferidos! Paro o que for e assisto!! https://t.co/gwKviSARrB @gilisl Demais!! Fico muito feliz!! 😊 Hoje meu livro novo entrou em pre venda na AMAZON! Foi tanto sucesso ontem que por esse link vc paga um preço especial e com o CÓDIGO: PAI10 vc ganha mais 10% de desconto. ENTÃO APROVEITA!! Segue o link: https://t.co/RRygmEPChO Tá rolando no meu insta!! Só este mês! https://t.co/RNdt3EywaV 🙌🏻🙌🏻 https://t.co/jsQk74GDgo https://t.co/rmj4mh6rws Queridos!! Com muito orgulho conto pra vcs que meu novo livro entrou na pre venda! #PaiDeMenina \nO link para ser o primeiro a garantir o livro COM DESCONTO de lançamento é esse: https://t.co/ACNG1mZRxM Parabéns @ClaudiaLeitte ❤️❤️❤️ https://t.co/sc6SSO1ZIz Uma grande bobagem é maquiar a tristeza comendo, fazendo compras ou qq coisa do tipo. Quanto mais rápido e mais profundo vc encarar a tristeza de frente, mais rápido ela desaparece. @PathyDejesus Ele vai explodir ainda mais! Terra das estrelas e ele vai brilhar ainda mais. Único problema se chama Warriors...um timezinho aí! Kkkk Olhando de fora a vida de qq um parece fácil, mas só quem sente na pele sabe o peso que tem nas costas. Lembrando que a árvore só da fruto uma vez por ano. E pra todo mundo. Se fosse pra uma se tornar verdade, qual vc preferiria? Isso, para mim, é quando o artista entende, de fato, seu poder. @GalGadot é demais! 👏🏼👏🏼 https://t.co/4FrDWUPQto @PathyDejesus  https://t.co/6nfY5I3yip Eu sou o que vc vê, mano! E fico feliz com seu Tweet. Obrigado por estar junto! https://t.co/0hbGtkVBEs O bom de postar agora apoiando a seleção é que todos gremlins haters aparecem correndo e fica fácil demais dar block e afastar as pessoas de espírito ruim e destrutivo e sem educação nenhuma! Recomendo pra todos formadores de opinião que querem dar uma limpa em suas contas!😂 @GameTime_BR Verdade isso? Que estranho ver ele com outra Jersey... Sensação ruim d+. Futebol é nossa instituição,nossa cultura.Seleção jogou muito bem,mereciam q a bola tivesse entrado e foi pênalti no Gabriel Jesus.Olhando no VAR.Bobagem fritar um ou outro. A real é q o Brasil ñ pode + ser favorito. Temos q baixar a bola e retomar nossa moral. @PathyDejesus Pelamor!! Tem que ser isso! Única coisa que me dá conforto é que nosso técnico é o Tite. E o discurso dele agora deve estar colocando o Al Pacino no chinelo!! #VaiBrasil #EuAcredito @felipesolari E ainda tinha que falar: esse foi pela final do ano passado! @Floragil2222 Kkkkk! Kd????? Logo menos com @fazendarecord https://t.co/xyq1ieaBhu Hahaha! Olha aí @Trouva @Eugeka https://t.co/LIvj3I5tMA 👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼 https://t.co/ZSHzzs1D4h Próxima temporada da @NBABrasil \nP R O M E T E!!\nGSW se deu MUITO bem na mudança do mula do McGee e chegada do Cousins, talvez o melhor pivo da liga! Pivozao clássico! Única coisa que o time não tinha. Os caras querem colocar nuvem em cima da parade do Lebra em LA! Mais alguém aí tá começando a ficar com medo do Japão?!?? Hahahaa TIRA O @neymarjr !! Pelamor!! Agora os caras vão quebrar ele... Impressão minha ou o VAR não funciona quando é pro benefício do Brasil?!? Como assim?? Se pisar DE PROPÓSITO, com intenção de machucar e lesionar não é motivo pra cartão vermelho então não sei mais o que é!! Eu fico maluco com comentarista dizendo “não foi pisão pra tudo isso”🙄sendo que se fosse ele que tomasse um pisão de prego de alumínio ia pro hospital, fazer exame, passar remédio ... tinha que ter tomado cartão! Kd o Fair Play? Kd o exemplo?? PORRAAA!! William chegou na Rússia!!! Agora sim!!! RT @PrayInFaith: Trust Him https://t.co/UTn2RqbGEv (Cont) vai virar o comércio, hotéis, tickets. O famoso “efeito Jordan” vai ser repetido em LA por causa do King. Não é que o cara melhora o time, ele muda a CIDADE!! Nos EUA quem representa a Dinastia do Lakers ganha respeito diferente. Ele está no caminho para ser ainda maior! (Cont...) ele vai ter no Lakers mais sucesso do que já teve até hoje. A ponto de daqui anos ser lembrado como o Lebron do Lakers! Assim como Shaq fez história no Magic, mas é muito mais lembrado como um Laker! Lebron vai trazer vida e orgulho pra uma cidade que precisava..(cont) (Cont...) ainda viveu Kobe e Shaq! Não tem um jogador da geração dele que não vestiria com orgulho a camisa do Lakers. Com esse move ele coloca o nome dele na história de uma forma diferente: na mesma linhagem que citei antes. E digo mais (cont...) Cont... Qq cara da idade do Lebron cresceu sonhando em jogar com a roxa e dourada! Rivalidade era Lakers x Celtics!! Molecada acha time maneiro o GSW ou o Cavs pq não viveu e não estudou o que a Dinastia Lakers representa! De Chamberlain, West, Kareem, Magic e ele (cont...) Quem me segue durante a Season da @NBABrasil sabe que eu já tinha cantado a bola que o @KingJames ia pro @Lakers . Quem conhece o mínimo da história da liga e de como pensa um cara como o Lebra já tinha sacado isso. \nA molecada d hj não sabe o que é uma Dinastia. Cont... Pênalti é muito emocionante!  Pelamor! Não sei nem pq tem o jogo antes! Poderia fazer uma copa só de pênalti!! Hahahahha Da pra saber quem vai perder o pênalti pela forma que chega pra bater. A falta de confiança e medo fica evidente no rosto do jogador. @onlycarlaa Verdade!!! Não@tinha me ligado Cara, #MazeRunner é um mega sucesso, os moleques são bons atores então pq ele não fizeram outros filmes? O Thomas e o Gally até fazem, mas e Minho, Newt, os outros? Ou eles fazem e eu que não vi?!? Sucesso é a capacidade de passar de derrota em derrota sem perder o entusiasmo. \nW. Churchill De hoje. https://t.co/eH5JERc6Cy HAHAHHAHAHA! https://t.co/fmXwu7x0NL Certeza que se eu não fosse pai trocaria a noite pelo dia. Gosto muito da madrugada. Silêncio, criatividade flui... Entenda: https://t.co/F2EDrTYkOQ #publi https://t.co/TJWqSLdoK7 É, acho que por hoje chega de trabalhar. 3:53am. Mamba Out. Enquanto muita gente fala que formato qualquer um apresenta, @guguliberato mostra que um comunicador de verdade faz TODA diferença em qq situação! Parabéns Guguzola!! ARREBENTOU!! Representou nossa raça! #FinalPowerCouple Votação Rápida! Quem leva a #FinalPowerCouple Quem vai ganhar a #FinalPowerCouple ?? Era pra ser um challenge, virou outra coisa! Bem mais legal na minha opinião! https://t.co/Z1yFfUGsAV Lembrando de quando entrevistei o Joe Jackson. Os highlights repercutiram no mundo todo. https://t.co/zTFKPcmfj1 @HFilippo @giphz Hahahahahhahaha! Ow meu Deus!! Galvao é muito hater do @neymarjr - ou fala mal ou nao fala nada. \nLogo na entrada em campo já começou a fritar o moleque pq foi o último a entrar na fila...para mano!! Para que vai começar capítulo inédito de Armação Ilimitada! Kkkkkk @rickbonadio Mano!! Onde tava a cabeça dele?! Hahaha Sei que quem não tem ou não gosta de cachorro não tá nem aí, mas compaixão é um sentimento universal então, peço por favor, que não soltem fogos na hora do gol! É um pesadelo, um susto sem fim pros cachorros. Tem cachorro que chega a ter convulsão, coitados. Mano, sem contar a porrada em si, o chute, pisão, empurrão, sem contar nada disso, só do rola que o @neymarjr da depois de uma porrada, eu já não conseguiria levantar. Só do rola."}