{"tweets": "I opened my soul to Zach Galifianakis on this podcast and he took a dump on it. https://t.co/pfOk236hQr https://t.co/OBDDt5iInd I’ve aged just like a fine wine: most of you forgot I'm in your basement. I just binge watched the first five episodes of Unscrupulent last night and it's easily the best show I've ever made up in my mind. Hey kids, it’s very simple: don’t trick or treat at my house if you don’t like quinoa clusters. Serious question: when did the Dark Web and the normal one switch places? I had the privilege of meeting #DeathStranding creator @Kojima_Hideo at his top-secret production offices in Tokyo. https://t.co/f3TQLvo5RK House Republicans stormed my show and demanded to be part of the proceedings. https://t.co/hJWX1Id83u In California, a book club has been meeting for 65 years. They finally finished “Infinite Jest.” Paul Rudd stopped by the show with a clip from his new Netflix series, \"Living With Yourself.\" https://t.co/mCN6uj3uV3 Today I had an “Improbable Impossible Burger,” which tastes just like an Impossible Burger, but it’s 100% beef. According to my new friend @iamjohnoliver, food should be wasted for comedic purposes, doctors are not necessary, and most British comedy is very bad. https://t.co/pfOk236hQr https://t.co/W0RQgFXYeW If only my parents had given me a memorable first name. https://t.co/LX7FWRk9nr https://t.co/t2LDseg0N6 Jenga but with Toblerone bars. When Tom Steyer drops out of the race, it’ll mean we still won't have a billionaire president. I just heard a box of adult diapers whisper “See you real soon.” It's smart of Trudeau to hold the election before Halloween, I mean why even tempt yourself? “Start again. Still not getting it.” - Time traveling Thomas Jefferson, after I tried to explain Twitter to him. If you do a Google image search for “owls with eating disorders” this is the first result: https://t.co/QMbxcGBGdE If you look up the definition of \"definition,\" you do not get my abs. I want to thank the incomparable Tina Fey for doing my podcast, and for calling me \"the Judi Dench of TV.\" https://t.co/pfOk236hQr https://t.co/4zQT88omQg Movie pitch: Millenials buy a house that turns out to be haunted, but they're just grateful they were able to afford something in a good school district. The only 3-way I was ever a part of was getting the middle seat on a Southwest Airlines flight.  Miss you, Ed, Tyrell. I don’t mean to be a conspiracy theorist but the Nobel Prize for chemistry always seems to go to a scientist. Support #NEXTForAutism by entering to get drawn into a future episode of @RickandMorty! You and your friend could meet creators @JustinRoiland and Dan Harmon, tour the production offices in LA, and win a merch bundle (Pickle Rick included!). https://t.co/hnDqYSPWmE True love is going through all 30 pages of my wedding album and using a Sharpie to blacken my orange Crocs. Whether you call them \"hotcakes,\" \"pancakes,\" or \"flapjacks,\" you're calling shoes the wrong thing. Ironically a great way to fall asleep and have dreams is to have someone tell you about theirs. RT @TeamCoco: A message from Conan and his dog Clickbait. https://t.co/RoHnQLaKpc https://t.co/nqOj2E7rqa David Letterman is the reason I get to do whatever the hell it is I do for a living. Hear our conversation @ https://t.co/pfOk236hQr https://t.co/OARpxJMBl0 I have a very specific kind of OCD where I like to buy a dozen donuts and a dozen donut holes and then reunite them. Do you think Putin is mad at Trump for cheating on him with another country? One upside to all the squabbling over the Impeachment hearings: this Thanksgiving is a great time to tell your family you’re gay. If the whistle blower testifies to Congress, I hope he wears a referee’s uniform. I auditioned to be the Old Spice guy and one thing led to another, anyway I'm now the new face of Old Bay seasoning. Pro tip: you don't actually have to do the diet to talk about it incessantly. Siri how do I give myself muscles in Photoshop wait don't post to Twitter stop undo undo Thanks for the cocaine, @NicholasBraun. https://t.co/Iea36Y5vEk #SuccessionHBO “Snap! Crackle! Pop!” – me getting out of a beach chair. Did “Angry Birds 2” come out already, and did I see it, and did I like it? Wal-Mart has stopped selling guns and e-cigarettes in its quest to make sure everyone dies of diabetes. A lot of celebrities are talking about threesomes and when I mentioned this to my wife, she suggested I introduce her to a celebrity. I wanted to spend even less time with my family so I agreed to play @mariabamfoo's elderly, phlegm-ridden father on @TeamCoco's new scripted podcast series \"Frontier Tween.\" Listen exclusively on @hearluminary. https://t.co/IzOeTkacpb Any single frame of Giuliani speaking on camera looks like it was taken from a doctor’s office poster titled, “Signs You Are Having a Stroke.” https://t.co/Yt1dbkpl4h I’m the Michael Jordan of lazy sports analogies. When I put the left AirPod in my left ear on the first try, I know it's gonna be a great day. People say I’m an “out of touch” celebrity but my butler puts on my pants one leg at a time just like everyone else. Only two thousand six hundred and fifteen days until AVATAR 5! Just to show you how hard it is to break into the movie business, Obama had to first become president. If this tweet gets 10 likes I’ll release my audition tape for Hustlers. Butter in the fridge!\n \nSherbet in the freezer!\n \nScrooge's first name \n \nWas Eb-en-eezer! \n \nWhat's that? Leave the jumprope contest? If you run out of bedtime stories to tell your kids, don't improvise and read them the \"It: Chapter 2\" synopsis off IMDb Luckily I never started vaping because there were many conclusive studies stating I would never look cool doing it. Someone texted me by accident, and now I'm headed to Costco to pick up Kristin. Ben Folds is my favorite singer/songwriter/complete sentence. Actor Matthew McConaughey is now a professor at the University of Texas. That means, sometime this semester, someone's gonna get flunked by Matthew McConaughey. #TeamCocoHouse is exactly like \"Ocean's 11,\" only instead of robbing multiple casinos we are making people laugh in multiple comedy clubs. So it's really nothing like \"Ocean's 11.\" https://t.co/FVscb9zgCn Looking for a way to help those affected by Hurricane Dorian? Text REDCROSS to 90999 to make an automatic $10 donation to the @RedCross. California Fun Fact: 50% of our land is under yoga mats. “Bitterly clung to power for over 3 decades.\"  I can't believe Mugabe stole my obituary. ‘Why isn’t Visine called ‘Eyeball-Chapstick,’ and why am I allowed to tweet? Is there nothing more stupendous in the language of English than a sentence of healthy construct? A new study found the safest city to travel to is Tokyo, Japan. Unless, of course, you're a dolphin. \"My Greenland show airs tonight at 10 PM,\" is a phrase 12-year-old me never dreamed I'd be saying. I just ordered a Popeye’s chicken sandwich on eBay. Turns out that I love \"reheated coffee\" more than I love \"brewing a fresh pot of coffee.\" Now Sony and Marvel are fighting over which one has to take Howard the Duck. Now when the White House hires a press secretary they have to ask, “Can you dance?” Five words I never expected to hear as an American: “We really pissed off Denmark.” #ConanGreenland One thing I wouldn't have predicted about Greenland:  Very small population but 37 Blockbuster Videos. #ConanGreenland Mission accomplished. Details to come. #ConanGreenland https://t.co/CfZI1Ibxde I’m going to make you proud, papa! #ConanGreenland https://t.co/Pn0UzcnNcw Good news, President Trump —Greenland has a golf course. Bad news, no golf carts, so enjoy your one hole. #ConanGreenland https://t.co/uptMpGMOhI .@realDonaldTrump, I came up with a whole new MAGA hat just for Greenland. #ConanGreenland https://t.co/HK0EHQiPME I lost a small black rock. Has anyone seen it? #ConanGreenland https://t.co/r5Y1rCAzJi Update: Found a local realtor and Greenland is on the market! #ConanGreenland https://t.co/nseOkbLwBj In Greenland, I’ve become the beautiful woman I always knew I could be. #ConanGreenland https://t.co/kzwRDXzua9 Update on the Greenland purchase. #ConanGreenland https://t.co/2Zy2V8gOeC .@realDonaldTrump, I’m in Greenland and just found this statue. No wonder you’re obsessed with this country. #ConanGreenland https://t.co/qRJzyWxkRj Just landed in Greenland. Negotiations have begun! #ConanGreenland https://t.co/YDAKV03ob4 I started reading that Norwegian Air is ending all flights to Ireland but the headline was becoming so white I had to stop reading from the glare. If you hated the first term of the Trump presidency, wait ’til the third! .@realDonaldTrump wants to buy Greenland and I'm heading there to help negotiate the deal. https://t.co/ayZ6cNVCcO #ConanGreenland Not much action today on my Reddit Ask Me Nothing. This “deep fake” technology is getting eerie. Today I spent fifteen minutes watching an Aerosmith concert, only to discover it was just a video of someone’s scarf collection. A Baptist college is kicking out a student who is transitioning. They’re becoming a Methodist. The realism of the stunts in Hobbs &amp; Shaw was vetted by respected physics professors Cornellius Fast and Deborah Ginsburg-Furious. I may have to go to Greenland now and kick the tires on this deal. #ConanGreenland Preseason football: the best time to see if that guy who works at your local Petco can return a punt. RT @TeamCoco: #TBT: In 1999, Conan and Andy pitched their show idea to Aaron Spelling. https://t.co/QWWoS1eHB8 #Conan25 https://t.co/vdQq9F… People who support the Endangered Species Act haven’t tasted my Bald Eagle Soufflé. If I were an extraterrestrial living on Earth, I’d hide in Area 52. Sure fire way to get out of jury duty: answer all questions with Austin Powers’ “Oh behave!” RT @TeamCoco: Celebrate the 31st anniversary of \"Mac and Me\" by watching the first time Paul Rudd pulled his signature prank on Conan. http… Just saw Hobbes &amp; Shaw. Had no idea their full names were Eleanor Hobbes and Mort Shaw. Hard to pick just one, but of all the seafood-based beverages available at gas stations, my favorite has to be Clamato. Cool Lifehack: It's possible to imagine Idris Elba as James Bond WHENEVER YOU WANT, WHEREVER YOU ARE. No fair —I invented the “But first, coffee” slogan, only mine was “But first, consider all options very carefully.” Ok, I’ve watched both seasons of #BigLittleLies and I still don’t get why my wife calls me “a Renata.” RT @TeamCoco: #TBT: Watch Conan go birdwatching in Central Park in 2005. https://t.co/BK51JrVGS7 #Conan25 https://t.co/xZ5cWI8omM SPOILER ALERT at the end of Hobbs and Shaw, they spend a solid 10 minutes of screen time drinking protein shakes. Just got the Facebook invite to storm Area 51 - is anyone else bringing potato salad. RT @TeamCoco: On this day in 1998, Conan and @AndyRichter attempted to rough it in the great outdoors. https://t.co/i8DLaGQN0v #Conan25 htt… My new 6-part podcast mini-series was just an excuse to spend more time with one of my favorite comedians and friends, @danacarvey. https://t.co/pfOk236hQr https://t.co/JMYMTYk4d0 President Trump intervened to get A$AP Rocky freed from Swedish prison. Finally, a win for Trump involving $. You know you had a crazy night when you wake up in a lifeguard stand inside an Old Navy. RT @TeamCoco: #TBT: In 1997, Conan and @AndyRichter took an extremely random road trip to the town of South Centerville. https://t.co/BByD3… Netflix should change its description of Avengers: Infinity War to: “Jewelry-obsessed man stops at nothing to decorate his glove.” My Italian ad for Aperol has been rejected. Fools. https://t.co/7B1P9qRhh3 I got off the plane a week ago and no one told me I’m still wearing my neck pillow. How does Mitch McConnell  sleep at night?  I’m not being political here, I just don’t think he has eyelids. https://t.co/3MVCTPHZ1O I would 100% watch a YouTube channel of people just taking naps. Me to Siri: “I’d like to vacation in a place that’s not pink.” https://t.co/jJgCpcSrjh You've been in LA too long when you find yourself saying, “Robert Mueller probably should have taken an improv class.” I thought my back yard was full of fireflies, but it was just me standing up too fast. If you include From Reality, Trump has been divorced 3 times. RT @TeamCoco: #TBT: In 1994, Conan recorded a rockabilly song at @sunstudio in Memphis. https://t.co/S20jUMHb09 #Conan25 https://t.co/oFsyZ… My beach body is my winter body plus flip flops. Kind of surprised Mueller showed up to his public testimony wearing a sleeveless Pantera t-shirt. Ah, summer. A beautiful time of year to explore everything https://t.co/29kHa5EYa7 has to offer. https://t.co/JujyOo7aDU I couldn’t think of a better person to end the first season of my podcast with than the brilliant @OfficialJLD. https://t.co/pfOk236hQr https://t.co/n3E3CUbI3N That's the 3rd time this week I've opened my spice cupboard and saw Ed Sheeran quickly scurrying away. Every great superhero needs a worthy nemesis. Mine is @kristenschaaled. https://t.co/wF05NNrMlf #ConanCon I’m protesting The Lion King because Pumbaa promotes an unrealistic body standard. #ConanCon Thank you for helping me complete my training, Mark @HamillHimself. https://t.co/WrFDoiYm9S #ConanCon I maintain my innocence, @JakeTapper. https://t.co/x6nxiMmqyK #ConanCon Downtown San Diego is \"Gotham With Boardshorts.\" #ConanCon Thanks to @ChinatownMarket for creating this cool Team Coco merch collection and capturing the sadness in my eyes. https://t.co/aQLyEuWrgL #ConanCon Kicked off my week at Comic-Con with some help from @state_design. https://t.co/3PvCkmOJdE #ConanCon #SDCC For this year's Comic-Con, I'm going dressed as Gary Wick, John Wick's older brother who had a successful career in advertising before buying a B&amp;B in wine country. #ConanCon Once a week, my Dad calls me and asks when I’m having my gender reveal party and then laughs and hangs up. Dear middle-aged white men running for president: you've heard of sports cars, right? My friend @kumailn stopped by the podcast to set the record straight about his last-minute cancellation on my tv show. https://t.co/pfOk236hQr https://t.co/76W7KgiM2p Somewhere the earthquake publicist is like \"I'm sorry, they're into hurricanes now.\" Ever since Eric Swalwell dropped out of the presidential race, my life has had no meaning. We had to scramble when @kumailn couldn't make it last night, but I think we turned a tricky situation into something really fun. https://t.co/rYg4qLBs5e Sometimes I still can't believe it took me 6 months to realize my first girlfriend was made of Lego. The letter O is just the number 0 after a cruise buffet I'm guessing there will soon be entire generations that assume apples the fruit were named after Apples the computers. My friend @AndyRichter stopped by to plug his new podcast and tell a filthy story about Carol Channing. https://t.co/pfOk236hQr https://t.co/gMpUEW4VDt When Meryl Streep wins an Emmy for “Big Little Lies”, do think she’ll toss it out her car window on the way home? They are re-releasing Avengers: Endgame with extra footage of Disney executives swimming in money. The real American holiday is July 5th when you can buy a flag at Walmart for 50% off. Just found out that every Fourth of July, the British celebrate, \"We Dodged a Bullet Day.\" It’s easy to think that Treasury Secretary Steve Mnuchin is a coward for delaying the release of the Harriet Tubman $20 bill.\nSee how easy it is? Is Marianne Williamson a meditation app? Mila Kunis is a very special person who did some very funny and illegal stuff when she was a teenager. https://t.co/pfOk236hQr https://t.co/hjyZwn7ngx Not far off: Joe Biden in a Kangol hat. Remember: you can be anything you set your mind to being. For instance, I always dreamed of being a guy who fired off empty cliches. My spank bank recently closed and is now an Orange Julius. Just assembled an Ikea bed frame without even once looking at the directions! https://t.co/mkToke8JZc Whoever smelt it extracted a purer form of metal from its ore through a process involving heating and melting. Whether or not they dealt it depends on the market. I’m headed out now to the record store to buy #TheRaconteurs’ new album. Then I’m going to the pharmacy for a chocolate malt. I live in a small town in 1948. Thank you to @thesamrichardson and his family for their incredible hospitality. I can’t remember the last time I laughed so hard or ate so much. #ConanGhana https://t.co/XFTEjUIuw7 Worked the string dance into a music video with Ghanaian superstar @kuamieugene. My life is complete. #ConanGhana https://t.co/DApunMDfkC .@billyeichner plans to use his \"Lion King money\" to destroy everyone who ever got in his way, and I respect that. https://t.co/pfOk236hQr https://t.co/vHoAyHQf1y Met Ghana’s young sensation @djswitchghana. She said this outfit was cool so I’m having ten more made. #conanghana https://t.co/tkvWM1CnIu I commissioned a local artist, Jasper, to paint a poster for my show. I think he nailed it. #ConanGhana https://t.co/D12MV0QnrR Hanging with my new friends in Ghana. #ConanGhana https://t.co/FSWLlJ1MQO Hanging with the coolest man in Ghana. This guy really makes me laugh. #ConanGhana https://t.co/Co9fc2Bgvy If you can find me in this photo, you win nothing. #ConanGhana https://t.co/QMuhvyALMe You haven’t heard The Beatles’ “Let It Be” until you’ve heard me play it on an African drum. #ConanGhana https://t.co/1UcB9h6I5O #ConanGhana https://t.co/NZ9yQfLbKY RT @ConanOBrien: @rickygervais Damn. You win this round, Gervais. @rickygervais Damn. You win this round, Gervais. Learning some moves on the beach in Africa. #ConanGhana https://t.co/TtxGLDgRyc .@thesamrichardson took us to Osu Castle where we learned about its important role in the #yearofreturn. #conanghana https://t.co/rP3a7Fxrfu It was a great honor for Sam and I to meet the Asantehemaa - the Queen Mother of the Ashanti people. #ConanGhana https://t.co/Dk7p4wjhdt Here’s a life hack on how to make people happy in Ghana. #ConanGhana https://t.co/tWNlS0w38T Ran into this very impressive group of Americans who are in Ghana to observe the Year of Return. #ConanGhana https://t.co/qy9TNGITc9 Hoping to be the new face of tourism in Ghana. No calls yet. #ConanGhana https://t.co/POzEYPyOBr .@SamRichardson and I were each presented with our own traditional Kente cloth. I’m never taking mine off. #conanghana https://t.co/mcsyEeEHHU Very sorry to hear that one of my greatest teachers has passed.  Professor Alan Brinkley helped fuel my passion for history and he was a kind and really sweet man.  My thoughts today are with his family and all of his grateful students. https://t.co/oBjeK5ZYz0 Went music shopping today and found myself faced with the hardest decision I’ve had to make in Ghana. #ConanGhana https://t.co/nSiT1rUyTy Taken when I still had all my fingers. #ConanGhana https://t.co/7cjDQzzxly I had the great luck of meeting a new Ghanian friend. His name is William and he's a gastroenterologist. My appointment is tomorrow at 8am. #ConanGhana https://t.co/WGKhYKBnrs Osee ye Ghana! #ConanGhana https://t.co/fD8y495Lw0 When you’re in Ghana, make Papaye’s your first stop. #notapaidendorsement. #ConanGhana https://t.co/SfIezBvprO Just learned the language etiquette and dance of Ghana from my new friend @kalybos_1. As usual, it went very badly. #ConanGhana https://t.co/IECVQ1K054 It's hard to tell from this photo, but the dance we are doing is spectacular. #ConanGhana https://t.co/w4WAoICjd3 Picked up a few things at Makola Market. I'm bringing home a little piece of Ghana for my 13-year-old son. #ConanGhana https://t.co/5JLM3Y9Djj .@SamRichardson &amp; I went on @Emprezzmcbrown’s cooking show #McBrownsKitchen and made traditional Ghanaian joloff rice. We brought the heat, she added the spice. #ConanGhana https://t.co/GsRQ8Kg8zj #ConanGhana. Day 1. https://t.co/KXdszILCP1 In London, on our way to Ghana and hanging out in the British Airways children’s lounge. We were quickly asked to leave. #ConanGhana https://t.co/OMEpsEq9tz I happily flew to New York City to experience @Lin_Manuel's remarkable brain. https://t.co/pfOk236hQr https://t.co/1YBogaBpp2 Happy Fathers Day to anyone wearing shorts with a belt. Breaking: This year’s Nobel Peace Prize will go to the leader who killed the least people. For the record--if the Russian government ever contacts me about anything, or if I see a spider, I call the FBI. I’m going to Ghana to shoot our next “Conan Without Borders” special and I’m bringing @SamRichardson with me. https://t.co/de58XT8ZFd #ConanGhana I DVR’d the US Women’s soccer game against Thailand. No spoilers! I heard the Grim Reaper is now on anti-depressants. .@billyeichner joined me for a high-stakes game of \"Crash Team Racing Nitro-Fueled.\" https://t.co/0wlWHM8El2 #CluelessGamer I’ve been having a hard time convincing my wife that I’m not a robocall. I'm very excited today to welcome on my podcast one of the twelve funniest Canadians alive. https://t.co/pfOk236hQr https://t.co/A0czvpWd4H Good news, I just got my Fast Pass for Mount Everest. Look, there are enough NBA free agency rumors swirling already, but let me just say this - Clippers? I'm available. https://t.co/qfQIyx98nH If opinions are like assholes, I need to start bleaching my opinions. I #WearOrange for National Gun Violence Awareness Day. https://t.co/l1Mqum4c3a People will get used to the new Apple Mac Pro which looks like a cheese grater. I'm sending this from a Dell that looks like a garlic press. Should I get the new Macbook Pro, Macbook Air, iPad Pro, or just see how my kids are doing? Last night's Jeopardy was the most watched episode in 14 years. I have to say, it was very cathartic to finally watch a white man lose to an overqualified woman. Win or lose at least the Toronto Raptors know they have healthcare. The brilliant @Hannahgadsby stopped by my podcast to talk about her groundbreaking special \"Nanette,\" the pitfalls of self-deprecation, and what's next for her. https://t.co/MhtsEaJS9S https://t.co/CmHOciKhTB Shark Tank idea: a microwave that will self-destruct if someone tries to use it to cook fish. If you’re a candidate trying to beat Trump in 2020, take away his greatest weapon by changing your name to “Lil Lyin Crookednuts.” Just programmed my Alexa to order a pizza if I shout incoherently for more than 10 seconds When God closes a Gryffindor, He opens a Grindylow. #HarryPotter #SorryNotSorry Tough week, just found out my wife and I pronounce \"gif\" differently. We just lost Edmund Morris, a great historian of Theodore Roosevelt and Ronald Reagan. I was lucky enough to interview him a few years ago and he will be missed. https://t.co/0DSCGgZImP Throwback Monday to the best crowd ever, the troops stationed at Al Udeid AFB in Qatar. #MemorialDay https://t.co/n6MZhGCG4Q I grew up listening to @BobNewhart records and was honored to have him on my podcast. It's one of the funniest episodes we've done. https://t.co/pfOk236hQr https://t.co/9XSlwGNrVY I can’t be the only one writing Lester Holt fan fiction. I’ll bet the minute John Wick enters a building, no one is more upset than its cleaning staff. This person is starting a band and they need, well, EVERYTHING. https://t.co/LWqdQAT0Tm Texas Chainsaw Massacre = Movie\nFlorida Chainsaw Massacre = Headline Psst…cars are just bigger shopping carts. Sad Craigslist ad: “Seeking a second and third for a 3-way.” I'm wearing my USO T-shirt, the Official Uniform of the Military Supporter, to say thank you to our Armed Forces. You can get your shirt by donating to @the_USO today: https://t.co/y4t1mMfu0g #USOSupporter https://t.co/EoNGeDIgXk I’m starting to think I missed my window on having a rat tail. They’ve announced the names for this year’s hurricanes. Once again, no Kanye, Apple or Conan. It was a thrill to talk with @HowardStern about his new book and the evolution of his long career. https://t.co/pfOk236hQr https://t.co/DOKxZZ4vPv I had no idea you could just tell Congress “no.” Good luck getting me to pay that parking ticket, City of Santa Monica. A big part of me is hoping the upcoming “Bill &amp; Ted” sequel is just the two of them watching “John Wick 3” and constantly saying, “Whoa.” Always a joy to run into a legend. @alanalda https://t.co/mMLBwin3Z8 Cutting back on my meat intake because what if God turns out to be a gigantic condescending vegan? Just ran into one of my big tv crushes. @jameelajamil https://t.co/lAnjaX0C87 When I was a kid watching \"The Carol Burnett Show,\" no one made me laugh harder than Tim Conway. What a sweet and effortlessly funny man. When we die, all the concert footage we’ve shot on our phones flashes before our eyes. I know I’m late to the party but I just flew to NY and finally had a chance to binge-watch Tim Robinson’s sketch show.  DAMNIT— what a delightfully hilarious, insane show.  How do I get a job there? #TimRobinson #IThinkYouShouldLeave How to get a Netflix special the hard way: do stand up for a decade\nThe easy way: be a serial killer Bill Hader is a giggling fool and a hilarious multi-talented gentleman. He'll never be on the podcast again. https://t.co/pfOk236hQr https://t.co/0wKiSfqK0U If I look hungover it’s because this year, Mother’s Day and Cinco de Mayo were only 7 days apart. I just had to tell my wife I’ve never heard of something called a “Mother’s Day Hall Pass.” I just heard that Netflix has given a full-series order to my neighbor's Ring Doorbell Camera. Anyone else keep forgetting they like lentils? RT @alfranken: Since I left, I’ve had so many folks ask me to re-enter the fray.  Well, check out The Al Franken Podcast by going to iTunes… I don’t need alcohol to have an angry unpredictable time. New tweet, who dis? It was a joy to talk with @jimmykimmel about his career, competition in late night, and his love of feeding people. https://t.co/pfOk23nSHZ https://t.co/U9eDbM8DtB TV is all dragons and hearings nowadays. The horse favored to win the Kentucky Derby had to pull out of the race. Apparently, someone dug up some of his homophobic tweets. I hate to get political on here, but if they're the Super Mario Bros, then isn't Mario their last name? So it's Mario Mario and Luigi Mario? Anyway, end farm subsidies. My new credit card gives me 2% cash back on 102% of my purchases. I told my therapist, \"I just want to be as happy as a Trader Joe's cashier.\" Over 450 supporters of Beto O'Rourke have also donated to Pete Buttigieg. They're making their checks out to \"Any Young White Guy.\" New Yorker cartoon idea: an all-dog business meeting, and one of them says \"Smell me out.\" It was a rare honor to finally interview the great Robert Caro. https://t.co/pfOk236hQr https://t.co/gzrGnxXpgg Bernie Sanders and Joe Biden should run together. I’d love to see America with mandatory 4PM naps. Over the weekend, my parents admitted they wouldn’t have taken me in the first round. I don’t think Russia will try to hack our election again, or hack anything for that matter, Russia very nice good democracy have for to support America! I can't believe this Avengers movie will be the last one before the next one comes out. Just listened to \"Cuz I Love You\" by Lizzo and I've decided to pretend she's crying about me. My least-favorite comeback of all time: measles. RT @BetterMakeRoom: #CollegeSigningDay is coming, and we’re pumped! Get ready to celebrate all of the hard work that got you to this point—… Is one presidential candidate per voter really such a bad idea? Now that he’s shaved his beard, I’m still not mistaken for Jason Momoa. .@TigNotaro was obsessed with drawing Civil War portraits when she was a little girl. That fact alone makes me want to be her friend. https://t.co/MhtsEaJS9S https://t.co/3EyRUKt6fJ I hope I'm not the only person at Easter Mass dressed as Arya Stark. A detail lost in the story of Jesus: how frequently, and early in the day he began turning water into wine. I’m surprised no one mentioned the Special Counsel Report’s margins are full of Mueller’s attempts to draw the Van Halen logo. For anyone still having trouble saying my name, here's a helpful tip: It's pronounced \"Cone-Edge-Edge\" I worry that the release of The Mueller Report is going to overshadow the fact that it’s Melissa Joan Hart’s birthday. #HappyBirthdayMelissaJoanHart Why can’t Beyonce drop the Mueller report? Watch the first nine minutes of #ConanAustralia and tune in to @TBSNetwork tonight @ 10/9c to watch my latest travel special. https://t.co/uEXYStejfZ Cheers to my Australian and American crews. #ConanAustralia would not have been possible without these fine mates. Episode airs TONIGHT at 10pm on @TBSNetwork https://t.co/YCL5nGxRHA Am I the only one still doing Elizabeth Holmes' voice in the shower? I'm just chillin', waiting to be asked to play Prince Harry in Season 16 of The Crown. .@pattonoswalt stopped by to talk about comedy, cereal, and badly written porn spam. https://t.co/MhtsEaJS9S https://t.co/IOH0sOCp42 Just to see the bumper stickers, I’m rooting for the ticket of Buttigieg/Hickenlooper in 2020. Am I the only one who thinks we should respect the Black Hole’s privacy? I think I saw The Rise of Skywalker two years ago on Pornhub? Oh well. Checks and balances had a good run. Free and Available Tinder Bio: “Got Shingles and Ready to Mingles” Million dollar idea: print the Democratic primary ballot on CVS receipts. .@nicolebyer is the opposite of me in every way and I love her for it. https://t.co/MhtsEaJS9S https://t.co/IBoXyZ03Lm Apologies to my college girlfriend. At the time, I really thought a reverse mortgage was a sex position. Webster's defines \"cliche\" as \"starting a speech with 'Webster's defines'\" ==DON'T BE THE FIRST TO ARRIVE AT THE ORGY OR THE LAST TO LEAVE. EITHER WAY, YOU LOOK DESPERATE.==  \nThirty years later, still the weirdest fortune cookie I ever got. Not to brag, but I think I'd be a model prisoner. As anyone who looks at Zillow knows, the time to buy was in 1890. I know they live in different comic book universes, but I'd love to see a fight between Batman and my neighbor with the loud stereo. Our historic experiment in Democracy is in great peril.  April Fools!!! (Pause) Hello?  Anyone? Talked with the delightful Ben Stiller (@RedHourBen) about growing up in show business, playing Michael Cohen on SNL, and Jeff Goldblum’s sexual energy. https://t.co/MhtsEaJS9S https://t.co/6R19lFwKN0 A growing fear about Beto O'Rourke is that he is actually just a very tall, wheat IPA. Just realized I’ve been binge-watching my children’s lives since they were born. Weird. I’ve been hitting this wasp’s nest with a wiffle ball bat for about five minutes and noth- ok I gotta go Great Britain is like a dad who asks for a divorce, then refuses to move out of the house and kind of hopes you’ll forget he’s living in the basement. Look, I’m not perfect but at least my obituary won’t say, “and in 2019, he defunded the Special Olympics.” Cardi B wants to trademark her catchphrase “Okurr” and I think she should.  Last year I made a fortune with my phrase “What’s the haps, Paps?” I’ll bet Kellyanne and George Conway have pretty disturbing makeup sex. Fans are always asking me how they can watch the \"old stuff,\" now I finally have an answer that is legal. https://t.co/9QGlddfoZ7 #Conan25 Ray Romano is a hilarious comedian, a kind soul, and a rare neurotic Italian. https://t.co/pfOk236hQr https://t.co/NIC69aLZDj Mueller's report may be finished, but mine is out next week. It's on 'Johnny Tremain' and it was due in 1974. On an island vacation with my family. If I get attacked by a shark, don't blame him - the chum Speedo was my idea. In the new millennial-inspired Bible, the Last Supper is now a vegan brunch. If you’re an Instagram Influencer who doesn’t have a picture of yourself in a sea of wildflowers, can I even trust your dry shampoo recommendations? SMH. Hey! Over 350 of my remote pieces from Late Night and CONAN will be available March 25th @ https://t.co/9QGlddfoZ7 #Conan25 https://t.co/Iq3jXvJ12r Keep the change you wish to see in the world. This morning my kitten was riding around the house on my dog’s back like he was on a horse. I’d post a video of it but I made it up. Got some wires crossed and now I have Temple vs. Pete Buttigieg in my NCAA bracket. I had the great privilege of speaking to @MichelleObama about her amazing journey and new book, “Becoming.” https://t.co/MhtsEaJS9S #IAmBecoming https://t.co/kPrZuJX9ep Every St. Patrick’s Day, I demand a recount from 23 and Me. Thrilled and honored to be a part of @MichelleObama’s #IAmBecoming event tonight in Milwaukee. https://t.co/RWBY29LEpJ Most pictures of Trump look like they were taken during a 3AM trip to the bathroom. https://t.co/UhYG6YprFS I told my therapist about my constant need to be liked and he said we can discuss it on the jet ski I bought him. Talked with some extremely talented young whippersnappers named Thomas Middleditch and Ben Schwartz. https://t.co/MhtsEaJS9S https://t.co/6cpxqVVDYc If “words can’t describe” what you saw, you could, like, shut up. Bowshanks, Stumblestone, Pinchbottom, Feverfew, Pebblenut...Minor Shakespeare characters or craft beers? WHY IS THIS MEDITATION APP NOT LOADING My wife thinks Idris Elba should play me. She didn't say anything about a movie. My therapist won’t validate my parking but he will validate my feelings about it. Excited to announce that I'll be sitting down with @MichelleObama during her #IAmBecoming tour stop in Milwaukee on 3/14. Have a question you want me to ask her? Reply below. https://t.co/XodVpDY1Jd Every time a Kardashian trends, I wish my mom had spelled my name \"Konan.\" Fun fact: my hair is one of the founding members of BTS. https://t.co/sz8tcF1N0u My friend @LisaKudrow stopped by to talk about how we met, Friends reunion rumors, The Comeback, and much more. https://t.co/9Po0LyTBd1 https://t.co/e7mNFUtMC8 Can someone direct me to an Apple Airpod Right Ear Only store? I'm sorry that Victoria's Secret is closing many of its stores, but excited that I can go to a mall again with my kids. Just realized that \"Pen15\" is slang for 15 pens. Is nothing sacred? “Inside Conan” is our new weekly behind the scenes podcast hosted by writers @jessiestwats and Mike Sweeney. I’m excited to finally find out what’s going on behind the scenes at CONAN. https://t.co/OhrbJ8zTAZ https://t.co/dwNSmUjcBY Speaking of national emergencies, this glass of Merlot tastes off! I'm really hoping that at some point, one Congress-person will look around and say, \"Oh no, wait a minute - THIS is The Bad Place!\" Hmm. Kind of a vague accent. Does anyone know where Michael Cohen is from? Support @4MattMSMF in their mission to raise awareness and combat the unspeakable tragedy of teen suicide. Learn more and donate @ https://t.co/yTbqealm3y Everything is a sensual experience to Jeff Goldblum. Even doing my podcast. https://t.co/9Po0LyTBd1 https://t.co/AfyC5vd9PT The biggest hit at my Oscar party is always the meatloaf shaped like an accountant from Price Waterhouse. I've just been told that Chris Hemsworth is no longer available to play me in a biopic. Weird how someone once drew a face on a sheet and it became Mike Pence. When I heard the Padres were paying someone 300 million, I assumed it had something to do with the Church scandal. Just stepping onto Australian soil has boosted my testosterone by 40%. #ConanAustralia https://t.co/X94MMN2j2F If you ask me, 97 of the 171 Democrats running for President have no shot. Coming this fall to TBS our Perfect Strangers reboot: Briggs and Coco. #ConanAustralia https://t.co/nrFntnyc0H Thank you to The National Centre of Indigenous Excellence and Uncle Graham for the wonderful Welcome to Country ceremony. #conanaustralia https://t.co/g1k1SiVGpi Thank you to my Australian friends for a great show in Sydney. #ConanandFriends #ConanAustralia https://t.co/5tNTeazLc9 Our attention spans these days are I’m ready to hit the Australian Outback, or a Manhattan nightclub in 1984. #ConanAustralia https://t.co/6U3q0xAIXE Theory: Paul Manafort is the result of scientists trying to make a human Fred Flintstone. https://t.co/LJJehL4Pzl Why won’t this koala make eye contact with me? #ConanAustralia https://t.co/ijcS3o2uNx If beans are the musical fruit, then cauliflower is the quiet kid with no obvious ambitions and a strange odor. My pal Timothy Olyphant stopped by to chew carrots loudly and talk about our unlikely friendship. https://t.co/9Po0LyTBd1 https://t.co/wcoUIb6Ucj Thank you to the @sydneyswans for teaching me Australian rules football. Sorry about all the crying. #ConanAustralia https://t.co/aiwIIJ812F The sun is so strong in Australia this is what I have to wear indoors. #ConanAustralia https://t.co/kZicLFjgAc Is it me, or is Bryan Adams really emphasizing the “B” nowadays? Just because I tweeted about El Pollo Loco, they sent us a huge spread of free food. They are truly the Cadillac CT6 Platinum Trim (Black Exterior/Auburn Interior) of restaurant chains. Just landed in Sydney and was welcomed with a traditional Australian mylar balloon. #ConanAustralia https://t.co/jSUuZYQwOY Exciting news: according to President Trump's doctor, I am Jason Momoa. Kenny G is in my living room right now, and he won’t leave until I answer his three riddles. Happy Valentine’s Day to the woman who-- by marrying me—kept me from making an ass of myself on Tindr, Match, Bumble and Farmers Only. I can't divulge where I was able to get a reservation for Valentine's Day but let's just say my wife is going to go as LOCO as EL POLLO when she finds out. Yogurt is the healthiest food ever packaged in a container that will last 100 years RT @TeamCoco: Vote for the best drawing of a lumberjack and log cabin. The artists will be revealed at a later date. RT @TeamCoco: .@ConanOBrien and @sonamov had another doodle off on the latest episode of \"Conan O’Brien Needs A Friend.\" https://t.co/QHjj5… I always cry at those YouTube videos of babies getting hearing aids and hearing their mother's criticism for the first time. I flew to New York City for an intense and meaningful mind meld with my long lost comedy brother @StephenAtHome. https://t.co/9Po0LyTBd1 https://t.co/pWzgBQcBej Can't believe there's a 3rd \"How To Train Your Dragon\" movie - this better be the one that actually shows me how to train my f*cking dragon. So grateful I grew up in the 70s when dick pics had to be developed at the drug store by a guy named Jim. *of Patrick Stewart I've been paying The National Enquirer $10 a week to not publish this photo Patrick Stewart saying hello to me. https://t.co/fcbZrCt6oD I once caught NASA’s Curiosity rover flipping through my diary. The sun is out. So much for global nighting. How ‘bout this? We let everybody who is running for president be president for a day. I’m on the fence about this new LEGO Ted Bundy movie. David Sedaris is one of the funniest writers on the planet. I didn't think we'd spend so much time talking about our colonoscopies. https://t.co/9Po0LyTBd1 https://t.co/tW9RADsbXD Someday I hope to be a big enough star that I can disappoint people by appearing in a Superbowl ad. So far, the Puppy Bowl has managed to avoid controversy, mostly because puppies can’t kneel. Nothing more embarrassing than having to ask the person in the stall next to you if they have a phone charger. Just had a bit of a Freudian slip in this Starbucks as I heard myself order a Venti Good-God-Please-Don't-Let-Schultz-Run-For-President. OK, which of you pranksters took part of Roger Stone's head? https://t.co/wqBRE2osUz Do you think the guy who invented French bread was overcompensating? Someday I hope to have the confidence of guys with weird skull bumps who shave their heads anyway. One of the funniest people alive, @danacarvey, stopped by to talk about comedy, The Beatles, and his very specific Jimmy Stewart impression. https://t.co/9Po0LyTBd1 https://t.co/cYHxIHIshr I just found out about non-alcoholic coffee. I just got an email from the Democratic Party saying they're looking for volunteers to NOT run for president. Everyone commenting on Roger Stone's Richard Nixon back tattoo has made me reluctant to reveal my Lyndon Johnson tramp stamp. I recently went on Shark Tank and did terribly because I thought it was Dancing With the Stars. There are eight million stories in the Naked City, and most of them involve chaffing. I put Starbursts in your dressing room as you requested, @tomhanks. #CONAN returns tonight @ 11/10c on @TBSNetwork. https://t.co/u2tWsxIJWm The CONAN shutdown ends tonight, at 11 PM on TBS. So glad our constitution was built in a system of checks, balances, and epic clapbacks. The hilarious @RonFunches stopped by the podcast to talk about positivity, @TheRock, and jazz cigarettes. https://t.co/9Po0LyTBd1 https://t.co/bY8pzZZJGr Hey, who put that Bird Box scene in my wedding video? The Pelosi/Trump standoff reminds me of two spoiled children and Nancy Pelosi. We’re back with all new shows next week on @TBSNetwork. https://t.co/7SiWvi65Z1 As cool as it is to learn your Uber driver is also a Coast Guard Rear Admiral, we REALLY need to end this government shutdown. Last year I went to Haiti and met these amazing kids. Excited for people to meet them on @netflix. Stream #ConanHaiti and more of my travel specials @ https://t.co/B6MIBfJTFj https://t.co/OCYVW2O2Ve To this day, no band has outdone The Beach Boys in singing about a car's technical specs. Just relax, and remember: you can always go into the woods in Red Dead Redemption and eat berries. My trip to Italy with Jordan Schlansky is now available to stream on @netflix. Traveling with Jordan is a lot of fun. https://t.co/B6MIBfJTFj https://t.co/3LZj1kLXKt Decluttered my closet this weekend- not a single pair of my pants \"sparked joy\" and now I'm being charged with indecent exposure. Without federal food inspectors, I'm only eating chicken nuggets. .@AdamSandler and I reminisced about our early years together at SNL, our friend Chris Farley, and much more @ https://t.co/9Po0LyTBd1 https://t.co/LiXAVhCwwz Looks like a lot of America has already built a wall…around their hearts.  (Conan drops mic, ascends to heaven) RT @marymcnamara: We watched @ConanOBrien on Netflix and look what happened! https://t.co/DdneKPTBSr Just learned that the money I donated to help “save” the elephants goes to baptizing them. #ConanMexico is now on @netflix. Find out how the people of Mexico feel about paying for Trump's border wall @ https://t.co/B6MIBfJTFj https://t.co/VX1X2ZTQnh .@marcmaron insisted on bringing me back to a painful time but we ended up having fun. Hear the rest @ https://t.co/9Po0LyBZOr https://t.co/yPkgZE8mx3 \"Salt Fat Acid Heat\" is a cooking show on Netflix AND my 4 step process to get this hair. https://t.co/QFrllfZZvO In their rebuttal, Pelosi and Schumer accused Trump of “manufacturing a crisis.” In fairness, Trump did promise to bring back manufacturing. The only time I regret having 3 cats is fairly often. I just booked our summer vacation to Japan. My kids can’t wait to go whaling. When Larry Flynt dies, will his family discover a stash of New Yorker magazines in the back of his closet? Two legendary podcasters meet again. https://t.co/9Po0LyTBd1 https://t.co/pX472SkWW6 Do you think Trump would agree to an emotional wall? I just got a robocall asking me to host the Oscars. I just snuck 3.2 ounces of fluid past the TSA- this government shutdown needs to end now. The first post of \"New Year, New Me.\" https://t.co/eYcw1Wnrtu Is it possible the stock market keeps fluctuating so much because there’s a cat sitting on its keyboard? If you enjoyed Birdbox or Bandersnatch and are thirsty for more horror on Netflix, watch me attempt salsa dancing in Cuba. https://t.co/B6MIBfsiNL It's 2019 but Michael Cohen is still writing \"For Hush Money\" on all his checks. Looking forward to another rocking New Year’s Eve with Ryan Seacrest, which is what I named my full body pillow. Auld Lang Syne: because why not start 2019 with a sad dirge written by a Scotsman in 1788? I forced @peteholmes to tell jokes lawyers made him cut from his HBO special. Now he’s suing me. Listen @ https://t.co/9Po0LyTBd1 https://t.co/BVa2maAPl6 Well, we can all agree on one thing: 2018 was the year that is the most recent. My Worst of the Year list, 2018:\n               1. Everything\n               2. All of it\n               3. \"Grain bowls\" Trump was right about running the government like one of his businesses - the employees don’t get paid. 30 years ago if you told me New York was going to legalize marijuana, I would have said, “that’s funky fresh!” because that’s what people said back then. Build! That! Mall!  (Long Island, New York chant) An adaptation of \"A Christmas Carol\" where a depressed Scrooge shocks the Ghost of Christmas Future by rejoicing at the sight of his headstone, then leaping into his grave. The last door of a really good Advent calendar holds insulin. Steve Mnuchin just called my son and told him the markets have plenty of liquidity. Now my son is crying. Christmas Eve Poll\nDo wives like getting 7-11 gift cards for Christmas? You know who's hilarious and on my podcast? @iamwandasykes. Plus, we got to bond over murder shows and barge cruises in France. https://t.co/9Po0LyTBd1 https://t.co/8NqAeQ4dDd Pretty soon, the only people left in Trump's original cabinet will be Ivanka, Jared, and the tic-tac-toe playing chicken that helped shape his foreign policy. “He sees you when you’re sleeping, he knows when you’re awake.” Santa is your cellmate. Pitch: HBO's \"Ballers,\" but for competitive cup stackers. To me, nothing says Christmas like a person saying the word \"Christmas\". I didn't realize the Amazon delivery guy can drop the package off inside your house, make a delicious risotto, kiss your wife and ask your kids to call him \"Uncle Steve.\" Two of my favorite people stopped by to talk about fornicating in nature and revenge fantasies. https://t.co/9Po0LyBZOr https://t.co/NHzrKZ2Bcd I'm all for creative ways to market a film, but I still have issues with the \"Guaranteed Aquaman-Free\" sticker on this can of tuna. My favorite part of true crime podcasts is the incredible suspense I feel when I’m waiting for the MeUndies promo code. I can't truly get in the Christmas spirit until my latte makes my breath smell like I orally pleasured a candy cane. Thank you to @DelanieFischer for this great personalized mug by @dicksbydelanie. I’m both honored and offended. https://t.co/SU0KvSildH Gift cards: the best way to say \"I remembered you while I was at CVS.\" I was truly honored to sign this tattoo of my first mugshot. #conanandfriends https://t.co/MttPjiFpKq At this point, wouldn’t it be more efficient if the White House just hired a warden? No one has ever told me I drink too much, and that’s the main reason I drink alone. I just realized in Seattle, that I am mortal. https://t.co/xMrJNxRx3F I’m selling this limited edition poster by @kiiarens on the #ConanAndFriends tour. https://t.co/I1hPc1twRm When Trump's kids are bad, they get coal subsidies in their stockings. Starting a tutoring company that only teaches entertainment reporters how to pronounce \"Saoirse.\" .@daxshepard and I get to the bottom of our failed double date @ https://t.co/9Po0LyTBd1 https://t.co/0qr1npLTG5 I bet Hillary no longer finds it funny when she walks into a bagel place and people chant, \"Lox her up!\" Aaa yes, that time of year again when we all break out the word ‘Tis. As part of her holiday give-away Ellen just gave everyone in her audience their own Netflix show. Time to do the same thing I do every year at this time: hire the FBI to figure out who my Secret Santa was in 1995. I will find you, candle-giver. I like my pizza like I like my pizza: pizza. If you Google “How do I stop receiving Pottery Barn catalogs?” the top result is a page with instructions for faking your own death. If I could only listen to one album for the rest of my life, I would probably wonder what kind of fascist regime I was living under. .@billburr and I talk about conspiracy theories, Burt Reynolds, and growing up with red hair @ https://t.co/9Po0LyTBd1 https://t.co/i3s8f5W3oJ I wonder if Crackle and Pop ever say, “Oh, Snap.” Ah yes, time for the annual debate between people who insist “Die Hard” is a Christmas movie and people who don’t give a shit. Spent a day with President George H.W. Bush at Dartmouth College in 2010. He could not have been kinder and he was absolutely lovely to my parents. It was an honor I’ll always remember. I’m starting a new meme. #dotheteddy #getcelebstodotheteddy #noonewilldotheteddy #conanandfriends https://t.co/X0q0XIsaII Should have just said, “Who wants a cocktail?” instead of “Who will join me in briefly drowning out the shriek of The Abyss?” We can’t sleep, and now you can’t either. #ConanAndFriends https://t.co/OISq6VUqcY @jdmcphersonjr @FirstAvenue @TeamCoco I would love to sit in with you tonight but my show doesn’t end until 10:30pm. How late are you guys going to be there? And do you have a tuba? I’ll be sending this out as my holiday card this year. Apologies to my family. #ConanAndFriends https://t.co/Z0USWJLW6x Simple way to get my kids to brush their teeth and do their homework: if they don't, they have to be a guest on my podcast. I rented a new family while I was in Japan. Yes, you can do that there. Check it out and then tune in to #ConanJapan tonight @ 10pm on @TBSNetwork. https://t.co/80USl3Umnx It evens out, because most climate scientists can't believe Trump is president. More like Paul Manafucked, am I right? (CONAN EXTENDS HIGH 5 HAND, WALKS THE EARTH IN SEARCH OF CONTACT, RECEIVES NO HIGH 5's, THEN QUIETLY EXPIRES.) Someone visiting Ireland sent me this photo of an ancient bog person.  It looks just like me when I forget to moisturize. https://t.co/jPvQH0VLYl RT @ConanOBrien: .@IMKristenBell gave me some great advice about friendship and face lift tape. https://t.co/9Po0LyTBd1 .@IMKristenBell gave me some great advice about friendship and face lift tape. https://t.co/9Po0LyTBd1 Product idea: honey, packaged inside a little human, but with a bear chasing it. Every time I see a giant pink bouncy castle going up in my neighbor’s back yard, I’m reminded that he still has my giant pink bouncy castle. I don’t need to buy anything on Black Friday, I just want to get in a fistfight at Bed Bath and Beyond to feel alive. RT @ConanOBrien: Will Ferrell sat down for the premiere episode of my new podcast. If you like Will Ferrell and Conan O’Brien but hate our… Having an authentic Thanksgiving celebration this year. I’m giving my family smallpox. Do you think Abe Lincoln would have declared Thanksgiving a national holiday if he knew it would mean the Lions play every year? Fun fact: the guy who had the idea for turducken was watching porn at the time. I bet a part of Mueller is also hoping this thing wraps up soon so he doesn't miss the next season of Game of Thrones. Please, show some respect and use its full name: \"Fantastic Beasts: The Crimes of Grindelwald: The Plight of Scamander: The Ritings of Rowling: The Windfall of Redmayne: The Disregard of Depp-cusations: The Disbelief You Read This Far: MagicTimes FunWithWands ZipZap.” In my experience, an apple a day keeps Hugh Jackman away, but, no, I can't confirm that they're connected. Will Ferrell sat down for the premiere episode of my new podcast. If you like Will Ferrell and Conan O’Brien but hate our faces, check it out! https://t.co/9Po0LyTBd1 https://t.co/HokO42e1Cs This is my favorite time of year: every Sunday, the boys come over, we order hot wings and watch \"Love Actually.\" I was just adopted by this bachelorette party in Austin. #girlsweekend https://t.co/EvSxGc54D5 In Texas, this is a light breakfast. #ConanAndFriends https://t.co/ThjsHBZh8H This is the 47th wedding I’ve ruined. When I hit 50 I can retire. #ConanAndFriends https://t.co/RroiPVFp1m Studies show young people are having less sex than previous generations. I knew I was ahead of my time. On my tour, I’m selling these limited edition posters by @kiiarens. Ah, I was such a sweet young girl. #ConanAndFriends https://t.co/hC9acnqlk7 When Lou Dobbs said illegals were coming into our country to vote, maybe he was thinking of this comedy bit we shot: https://t.co/FNJnY7YqDV Either the barista got my name *really* wrong, or I just drank Erica’s mochaccino. RT @BillSimmons: New BS Podcast: a long, overdue hang w/ @ConanOBrien on SNL, The Simpsons, funniest people, Ted Williams, Greg Daniels, th… Just had my first non-Tootsie Roll breakfast since Halloween. Terrible office scheduling here. Somehow, Bring Your Dog to Work Day is on the same day as Wear Steak Pants to Work Day. Visit https://t.co/nsCTOuZpDq to bid on four VIP tickets to my show in Burbank. All proceeds go to @HomesForOurTrps, who are building homes for our most severely wounded post-9/11 veterans. Unfortunately, this morning I said, “Kids, let’s gather ‘round my iPhone and see why Jill Scott is trending!” Like Trump, I also try to avoid the rain due to my hair, but only because mine grows 5 times its normal size and begins to attract lightning. Back in 1995, I had the pleasure of talking to Stan Lee about his 50 years in comic books. Rest in peace, Stan. https://t.co/zPbwAhZJVg \"Conan O'Brien Needs A Friend\" combines my two passions: making friends and selling mattresses. Listen to a preview with guests Will Ferrell, @iamwandasykes, @billburr, @IMKristenBell, and more at https://t.co/9Po0LyBZOr https://t.co/9XjzHtIVU0 Nope. That wasn’t me at CVS loudly humming along to that “Smooth” Santana/Rob Thomas song. New drinking game: drink every time you feel anxious and sad. Visit https://t.co/QeFv9XuPOE to bid on a meet and greet with my friend @jaketapper. All proceeds go to @HomesForOurTrps, who are building homes for our most severely wounded post-9/11 veterans. My apologies to LA Zoo officials. I thought giraffes could handle Chipotle. If you’re near a losing candidate’s headquarters this evening, stop by for a good deal on balloons and room temperature hors d’oeuvres. At the end of the day, this election comes down to one question: do you like stickers? #vote #stickers Just walked into an Arby’s and asked, “What’s fresh today?” The cashier pointed to her cold sore. This is an unbelievable statistic: 18% of all statistics are falsely inflated 106% of the time. Call me old fashioned, but I find beautiful women incredibly attractive. Just read my old pal Mike Reiss' book on writing for The Simpsons and it's great. Put down that classic Russian novel and read this instead. https://t.co/fiw99s8VDJ https://t.co/24Dm73YJPu Thank you D.C. for an incredible first show. See you soon Atlantic City. #ConanAndFriends https://t.co/GOechbuRbM My personal style can best be described as “Trader Joe’s cashier.” Jared Kushner could sell ice to a polar bear (in 2040, when there is no ice left). The barista said she liked my Dia de los Muertos skeleton costume. I'm not wearing a costume. Dear trick-or-treaters: Would it kill you to say “thank you” when I hand you a freshly made egg salad sandwich? Hey Boston, a few more tickets have just been released for my 10pm show at @The_Wilbur on 11/6. Get them while you can @ https://t.co/ikq4lZK5OJ https://t.co/9dZ3LVo7Ny Red Dead Redemption 2 is incredibly realistic, except for the turn signals on the horses. “I’ve never owned a van,” is fast becoming one of my best qualities. I stayed in tonight and watched the Fall Classic. (“Autumn in New York” with Richard Gere and Winona Ryder) The National Weather Service is letting me name the next hurricane. Watch out for Tropical Storm Dr. Sanjay Gupta. Is it weird that my ballot was in Russian? I didn’t win the lottery, but I’m still planning on dying alone. I was up all night, worried about this caravan of people who are willing to do the jobs that most Americans won’t. Last year, my family started a tradition of putting up a “Christmas skeleton” because it works so well with our other tradition, “not putting away the Halloween decorations.” Heads up! Greek Yogurt is just regular yogurt with an irresistible cologne. HEY SHARK TANK! Pumpkin Spice Lotto. You're welcome. The original Big Bird has retired from Sesame Street. I’m told he was delicious. Trump's reaction to the story about Khashoggi in the Saudi consulate reminds me of when we agreed to let Dahmer investigate whether or not Dahmer did it. Now that Canada has legalized marijuana, maybe Canadians will finally mellow out. For Halloween, I’m going as a newspaper. I was just the victim of identity theft, but when the thief realized who it was, said, “Actually I’m good.” Hard to believe it’s been almost three days without the announcement of a new Star Wars movie. Social media use among the young is getting worse. Latest research: 1 out of 3 teenagers today IS a phone. It’s a bad sign that in order to vote in Georgia you have to prove you subscribe to The Golf Channel. Kanye is in my office and he won’t leave. We apparently have just over 10 years to reverse the catastrophic effects of climate change. But first - we dance! When I eat raisins, I feel like I'm chomping up some grape's grandmother. .@TeamCoco is producing the very funny @veitchtweets' stand-up special next week in LA. Sign up for free tickets @ https://t.co/zDvkvX4aTH May start a talent agency. First client - that dog in \"A Star is Born.\" It’s weird that both the Earth and I have about 30 years left. FUN FACT: no facts are actually fun! I want to open a Buddhist bakery that specializes in nothing bagels. I read that shaving your legs helps you swim faster, so now, I just have to go back in time and convince the guys who hazed me in high school that I was a swimmer. 67 million Americans don’t speak English at home. This includes my family because we don’t say a word to each other. a triple thread. I’m known as In the business, Get ready for the podcast NPR called, \"not for us.\" Check out the teaser for \"Conan O'Brien Needs a Friend.\" Premieres next month, but subscribe now — I'm really having fun making these. https://t.co/9Po0LyBZOr https://t.co/5OwLXkBWmy This is the THIRD time I've found Jeff Goldblum in a box of Kellogg's Raisin Bran. Neil Da Grass Try Some is my favorite weed strain that makes you good at astrophysics. Evergreen tweet: I love a blue spruce. My wife hasn’t touched me since the election. She took Gore’s loss pretty hard. We're getting to a place where the Supreme Court seems less respectable than the Taco Bell Crunchwrap Supreme. I’m going to delay my Kavanaugh tweet for a week. Tickets for my 18-city stand-up tour are on sale now @ https://t.co/JERw0JAX9l #ConanAndFriends https://t.co/5BJGGQYGem My doctor says I should eat more red meat and drink more alcohol. BTW, I consider all waiters doctors. I hit a deer with my car. Pretty impressive considering the deer was in the zoo. I'm hitting the road for an 18-city tour and bringing my funniest friends with me. Tickets go on sale Friday @ 10am. For more info visit https://t.co/JERw0JAX9l #ConanAndFriends https://t.co/PLUxlchUnR You gotta hand it to ticket takers. I’m sorry. It’s time to register to vote for the 2018 midterms. Text “VOTER” to 40649 or visit @HeadCountOrg @  https://t.co/DvyBg0U9OX. #TheFutureIsVoting #NationalVoterRegistrationDay https://t.co/zpL3MSpvfS This country has become so divided, it might as well be an amoeba. Netflix, where's my comedy special? Since the new \"Captain Marvel\" trailer came out, at least 7 people have hit me in the face then said, \"Now THAT'S how you punch an old lady.\" Historical fact: The city of Buffalo, New York was founded by Dutch trader Anton van Wild Wings. One huge perk about being famous is, you can walk into any Olive Garden restaurant and get free unlimited breadsticks. I’ve left instructions that after I die, I’m to be cremated and sold as a detergent additive. Hey, Los Angeles, I'll be stopping by tonight's @upandup with @MosesStorm. Get tickets here https://t.co/whhzVdkOCb It’s officially 22 shopping days until Mario Lopez’s birthday. Spent the weekend binge-watching every Verizon commercial. The new iPhone Xs will let you have two different phone #s on one phone. Congratulations, adulterers! Thanks to Paul McCartney, now when people ask about my 25 year relationship with Andy Richter, I can say, “we’re friends but we’re not ‘masturbate-together’ friends.” Whenever I see a newborn baby, I realize they have absolutely no clue how many binge-worthy shows they now have to catch up on. 25 years ago today, \"Late Night with Conan O'Brien\" premiered. Here's the first episode, on loan from the Smithsonian. https://t.co/cbBAyFfqX5 Do I believe in climate change? Well, I just saw a mosquito steal a bike. I got one of those robotic dogs. Calm down, it’s a rescue. .@Daniel_Sloss just released two hilarious stand-up specials. You have my permission to watch them at work. https://t.co/2Pz3TTqfna “Plum” is, by far, the dirtiest sounding fruit. That’s a wrap on #ConanJapan. Sayonara. 🇯🇵 https://t.co/HaoWuAAcuD A year ago this couple, Michael and Kayo invited me to their wedding. I couldn’t make it so instead I flew to Japan and took this selfie. #ConanJapan https://t.co/JmYmufaRr2 Last night I brought karaoke to Japan. (At least I’m assuming it’s not a big thing here). #ConanJapan https://t.co/Ftj5TQvJ0U Shot something super secret with #HideoKojima. Coming soon. #ConanJapan https://t.co/J44hzEGQEn After 5 days, I now read and speak fluent Japanese. #ConanJapan https://t.co/4rnnCT5qsA RIP Burt Reynolds. He was like no other. https://t.co/hLQgctLVzp #ConanJapan https://t.co/5dXoIhwxlx I was asked to join a totally impromptu parasol dance in my honor by the Governor. I think im losing my mind. #ConanJapan https://t.co/v1yyJDLDvH I finally made it to Conan Town.\nThe mayor gave me an honorary sash, and I gave him one. #ConanJapan https://t.co/iWzncNvyad People of Conan Town, we landed at the wrong airport. My apologies. We’re on our way. See you soon. https://t.co/mIMCpRNByz On my way to Conan Town. It’s time to settle this. #ConanJapan #ConanTown https://t.co/kQhtHwzrBW In Japan, you can rent a family. I rented one for the day and I’ve never been happier. #ConanJapan https://t.co/ss8fVb9Taq For all our disagreements Jordan does know his food. #Tonkatsu #ConanJapan https://t.co/1QQv7ZQZZh Looking forward to a great and/or horrible meal. #ConanJapan https://t.co/l7xWSSK51B Japanese lunch for two. #ConanJapan https://t.co/7rsFXD5V4F Hoping everyone in Japan stays safe during Typhoon Jebi. #ConanJapan https://t.co/FKY1HqivUZ Just before I left, my daughter said “Dad, don’t embarrass me in Japan.”\n#ConanJapan https://t.co/YhZhy5jgV5 Our album drops never. #conanjapan https://t.co/vmJEBtUPCB Konnichiwa! I’ve arrived in #Japan to film a new episode of #ConanWithoutBorders. Already making new friends. #ConanJapan https://t.co/1y3CGQDyFm SPOILER ALERT: In the final episode of The Big Bang Theory, we learn “Bazinga” was the name of young Sheldon’s sled. I just tried out a new flight simulator that’s so realistic, I spent the whole 2 hours grounded at JFK. I ordered the Olive Garden “Bottomless Salad Bowl,” and it led me to Narnia. Ever since I scooped my eyes out with a melon baller, the news hasn't bothered me so much. Ugh, my dog's giving me those \"Jeff Sessions checking to see if Trump is still mad at him\" eyes again. President Trump is sounding more and more like a mob boss. At a press pool this morning, he referred to America as “this thing of ours.” Today everyone is rightly praising the courage and wisdom of John McCain. To truly honor the man, let's all try and follow his lead. https://t.co/6ET1EOfSlc I hope when I die, Madonna says nice things about herself. This is the 3rd time I've tried hitchhiking to work and it's the 3rd time I've been picked up by @JoeManganiello who was again \"just in the neighborhood.\" The following random syllables are hereby offered as names for your new app: Buzu, Spotchi Jimsin, Plantic, Tanco and Spoob. On my recent trip to wherever, I couldn't believe how great that thing was. Besides biting into it, what’s the best way to find out if a loose battery is good? My writers are performing at Flappers tonight. I thought I'd stop by and say hi. See you there. https://t.co/BgTnBJxG1g Just got asked to autograph a breast. My wife was nearby, so I told him “no.” Just learned that when *I’m* one of the options, instead of “Marry, F*ck, Kill” people play, “Pretend You’re On a Call, Play Dead, Actually Die.” Someone is suing Canada Dry Ginger Ale because it contains no ginger, so I’d like to formally announce my lawsuit against Panda Express. My son’s back-to-school backpack has a “burner phone your parents don’t know about” pocket. People need to stop making fun of Trump’s Space Force. I am all for this administration buying ideas from my 10 year old nephew Brandon. I'm glad the media is using her full name, \"Omarosa Manigault-Newman,\" so I don't get her confused with other Omarosas. I bet even George Clooney wishes he was George Clooney. Attention Investors: Tiny, waist-high fireworks that pop softly and don't scare dogs. You can’t have fun anymore. https://t.co/wgBXwZn9b3 Without the moon, there would be no tides, and no name for what my brothers did to me. My wife caught me looking at Pinterest. I tried to cover it with a porn site, but she’s fast. My kids don’t believe it when I tell them how in my day, you could get an avocado toast for just $7. One thing you don't often hear: \"Hey, Dolph! No, not you, the other Dolph!\" I'm going on tour and bringing some friends with me. Pre-sale tickets for my @nycomedyfest show on 11/8 at the @BeaconTheatre are available now with code: TNYCF https://t.co/xEDTBsVAMr https://t.co/qnYQ00TbVn I’m taking Intro to Fortnite at the local community college. (That’s how Ninja did it, right?) I’m starting a podcast about comity, it’s called What The Heck. Okay, yep, that's on me, he got me good! (I just found out the recycling bin I've been using for 3 years was really @SachaBaronCohen all along.) There's going to be a movie about this whole MoviePass - nevermind it just lost funding. For the record, I don’t want Rudy Giuliani doing my eulogy. I’m taking comfort from the fact that those plans for making 3-D plastic guns were written by IKEA. I just got instructions for how to print a 3-D \"Pandora's Box.\" I don't know. Are we sure that was the LAST Airbender? Just got a pool floatie shaped like friends that want to come over and hang out with me. My son just came home from robotics camp. At least, I think that's him. Around the third sangria, the women catch on that nobody invited me, but by then I’m off to the next book club. When I was a kid at sleep away camp, I still remember how exciting it was to get a letter from my Mom and Dad's attorney. When I grill burgers, I take a tip from the restaurant guys and, at the last minute, sprinkle in just a hint of e.coli. I thought the Shazam movie was about a superhero with the power to guess the name of any pop song. I truly hope there are people in France who believe that, in America, LeBron is known as TheBron. Just noticed the poster for Mamma Mia 2 features as many people of color as a poster of me. These are the best Spanx I've ever worn. #ConanCon https://t.co/Ar7QgoFkYR I love it here at Comic-Con. I’ve got the entire Gotti panel to myself. #ConanCon I have X-ray vision, but it only works on objects wrapped in very thin tissue paper. #ConanCon At any given point during Comic-Con, San Diego is the #1 place on the planet for tights drying in hotel bathrooms. #ConanCon I got my hands on the Batgirl audition tapes. @Nick_Offerman has this one in the bag. #ConanCon https://t.co/b8ZSqBDS8q Comic-Con's the best - I've already seen a Batman, a Superman, AND a Spider-Man, all trip over a Bird scooter on the sidewalk. #ConanCon I'm a better Batman than Christian Bale and Michael Keaton combined. https://t.co/Ft8tX7YC62 I love Comic Con. Just saw Thanos arguing with hotel front desk about not getting an ocean-view room. #ConanCon I just saw two Rocket Raccoon cosplayers fighting over a Princess Leia wig! Oh wait those are real raccoons fighting over a Cinnabon. #ConanCon Is it me or is Putin riding Trump like an e-Scooter? Sure, everyone loves Chewbacca - unless you’re the guy who has to keep coming over to snake out his shower drain. #ConanCon As a kid, I knew I was in trouble when my Mom would say “Conan Christopher O’Brien” through the megaphone she borrowed from the SWAT team. Song Titles (Are Cooler When Part of the Title Is In Parentheses) Every father wants to hear those precious words: \"Daddy, I won the lottery.\" Decades ago, James Brown tried to warn of our jobs being taken by sex machines, but would we listen? Elon Musk didn’t save the Thai soccer team, but he will put them on a Tesla waitlist. It’s so hot out I keep dunking my head into my relationship with my father. If someone ever body shames me I'm going to clap back. God, I'm lost. Musicologists now believe Beethoven wasn’t really deaf, he just pretended to be to avoid hearing Schubert’s boring stories about his fraternity pranks. One of these Sundays, I’d like Pope Francis to say “God” the way the FIFA announcer says, “GOOOOOOOOOOOOOOOOOOOAL!” With the kids off at camp, my wife and I finally have some precious time to check Facebook in separate rooms. After four margaritas, I call it Cuatro De Julio. In the new James Bond movie, Bond apologizes to women for his behavior and is never seen again. About to peel an orange. AMA Does it help the environment if I drink vodka out of a reusable water bottle? I’d like it to be on the record that I was making “Paul Rudd’s penis is ant-sized” jokes LONG before he ever played Ant-Man. Step on this little raised platform and I will guess your weight with astonishing accuracy. Stove Top Stuffing is my favorite side-dish that sounds like a Midwestern porn video. Don’t mean to brag, but my latest colonoscopy is getting 97% on Rotten Tomatoes. One sensuous glance and I knew: she was waiting for my coffee order. I will pay for a remake of the remake of The Last Jedi, starring only corgis. Meek Mill would also be a good name for a factory that grinds up gentle folks. Is it bad that Hereditary made me feel a lot better about my childhood? No matter how bad things might seem right now, at least we still have Nick Offerman’s insane giggle: https://t.co/FPy37tBjAm A little fact about me: “I can hold my pee all night” was my least successful pickup line. Either I was a terrible NBA coach, or my players just weren't good enough to run my patented heptadecagon offense. I just saw 3 of North Korea’s nuclear weapons on eBay. All I want for Father's Day is for my kids to stop calling me \"Not-Dwayne-Johnson.\" I’m still confident Tiffany Haddish will not reveal what I did at a party to Steve Martin. One big perk of being part of the new AT&amp;T/Time Warner family is I now have access to the exclusive FIFTH bar. There's no one I'd rather go Super Saiyan with than @RonFunches. https://t.co/w9pzicAGwp #CluelessGamer #DBLegends My goal is to be featured in a piece about celebrities called \"You'll definitely believe what they look like today\" Thank you to @ProdevHaiti and my young friends at Ecole Nouvelle Zoranje for sending me this beautiful mural. https://t.co/4LmbnRYNqL After I retire, I want to move to Vermont and confuse visitors by opening a “Bed OR Breakfast.” Hard to believe that it used to take days, even weeks, to call someone you disagreed with “Hitler.” Hats off to the team of puppeteers who control Rudy Giuliani’s facial expressions. President Trump and Kim Jong Un reportedly have different ideas of the word “denuclearize.” It’s just like “Laurel vs. Yanni” except with the whole planet at risk. Great news, my mom just called to say Scott Pruitt bought a broken ottoman from her garage sale for $275,000. RT @ConanOBrien: @nickkroll @NickKroll That's weird, look what I just found in my potato. https://t.co/4PATZi2xCl @nickkroll @NickKroll That's weird, look what I just found in my potato. https://t.co/4PATZi2xCl To make my grandfather proud, every June 6th I storm the beach at Malibu. In a show of solidarity today, I baked a cake for my friends who are a gay couple. It was terrible and they threw it in the garbage. Ever go to Starbucks in the late afternoon and see that one slice of lemon poppy seed loaf alone in the display case? That’s what my twenties were like. One of Jesus's greatest miracles?  He was a carpenter, but He didn't bring it up every time you met Him. America Ferrara had a baby. I’d like to see Trump ​​claim that kid wasn’t born in “America.” I can’t tell you how much I’ve enjoyed hikin​g the Appalachian Trail these past 22 days with Melania Trump. I did not know that \"prison reform\" was something I could talk about with Kim Kardashian. Trump! Right? Wow. &lt;--- just RT this when applicable. There's nothing worse than people online who feel they can just command others to discuss a topic they bring up. Discuss. So there's going to be a Boba Fett movie, but still nothing for that show-stealing temptress, the Thala-Siren?!? https://t.co/ujBBPcwQ08 I can't find anyone to see Solo with me this weekend, so I guess I'll be flying…alone. I can finally rest easy knowing that https://t.co/eTwLq6ckgg has updated their privacy policy. My wife’s new nickname for me is “Prince Harry if I squint.” I never get more than halfway through my sci-fi movie pitch before my therapist says, \"our time is up.\" I played #TheShow18 with fellow great athlete Aaron Judge (@TheJudge44). #CluelessGamer https://t.co/1dq02U7Egi It is a time of turmoil. It is a time of confusion. It is a time of great tidings but also of grave misgivings. It is a time of upheaval but also a time of downheaval. It is a time of tweeting while drunk on Pinot. The only thing keeping me from starting my own doomsday sex cult is that I look terrible in sunglasses. Can we make ie and ei interchangeable so that no matter what, I never misspell recieve? Doesn’t every single picture of Michael Cohen look like he’s saying, “Oh, we’re not allowed to do that?” I'm confused - if Obama won a Nobel Peace Prize, shouldn't Trump be trying to dismantle the entire Peace Prize industry? Please no spoilers for 1)  #TheAmericansFX and 2) #TheAmericansUS, if you know what's going to happen to us. Did you know if you follow Rudy Giuliani on Twitter, it will suggest you also follow several twitter accounts promoting rabies awareness? If Trump wins a Nobel Peace Prize, I bet he’ll try to trade it in for an Emmy. My Mom always says “homemade gifts are the best.” Hope she enjoys the meth. This Mother's Day, give the gift that says \"yesterday was Mother's Day\". “Wabbit AGAIN?! I’m weaving you.” -Elmer Fudd’s wife My son asked me why I was wearing sunglasses in the house and I told him \"to block the son.” Now I have to pay for therapy. When we give each other a thumbs up, it's our way of mocking every other animal on earth. Twitter has been abuzz over Selena Gomez’s spray tan at the Met Gala. In other news, we may be having a nuclear war with Iran. I just heard that the emails telling Tesla customers their cars will be delayed by 2 years have been delayed by 5 years. This #July4th, show service members we have their backs. Get your #USO tee today: https://t.co/10PbjVzsEy. #BeTheForce https://t.co/KcuUi9RmcW The Boy Scouts are dropping the word 'Boy' from their name and within seconds my dad called me to say, \"Looks like they're finally ready for ya.\" I'm just sitting here by my computer, waiting for Kanye to weigh in on the Irish. I told my neighbor Greg to check out \"Avengers: Infinity War\" and now I see it's breaking box office records so YOU'RE WELCOME, MARVEL. Nothing to worry about, Trump’s doctor just inspected Kanye and says he’s “perfectly normal.” Watch Bill Hader and I fight Tron elks and bass players in #GodofWar. #CluelessGamer https://t.co/fxQryNm3T4 Farewell to Trump lawyer Ty Cobb. May you enjoy the rest of your days perfecting trick shots in Reno, Nevada billiard halls. https://t.co/XIBbrq2I5W I need to get an optometrist who doesn’t ask, “Better view of a meaningless world racked by cruelty and madness like this, or like this?” I wish the billboard of me with the giant penis on my forehead was graffiti. I bet we can get Trump to resign with an offer of an Apprentice reboot. In preparation for Infinity War I'm watching every Chris Hemsworth movie, even the one where he plays a computer hacker, just to be buff torso. I mean safe. Ford has announced they will discontinue making the Taurus. @Smithsonian call me if you’re interested in my now priceless 1992 Taurus SHO. https://t.co/w2mxTHFQE6 Steven Yeun and I in the same DMZ building where today’s Korean summit took place. You’re right, Historians, we made this day happen. https://t.co/n2NlTaDCB9 Don’t forget to leave your clocks alone this Sunday. As my father used to say, a frown is just a smile that's been rotated 180 degrees on its x axis, assuming the origin is located at the longitudinal midpoint of said frown. I save money on cheese by only trapping mice in a prison of their tortured memories. Alexa, stop watching me shower. I’m looking for a pill that gives me 4 hours of drymouth, but with no risk of erections. I really, really, really want to see Donald Trump spell “Rudy Giuliani.” Congratulations to @jaketapper on his new book @TheHellfireClub. It’s a great read, and has way less sex than @wolfblitzer’s novel. https://t.co/SVr24tRcq2 Do you think Spain knew what they were doing when they let us have Florida? No one on Earth has ever said, \"Hooray! Salmon burgers!\" An executive just emailed asking if I’m available for a modern-day reboot of the “Conan” show. New on 23 and Me: a feature that tells you if you were fathered by Donald Trump. I also paid my doorman to lie once - he told the delivery guy my order was for two people 25 years ago today, I put on a terrible jacket and auditioned for Late Night on NBC. I haven't aged a day. https://t.co/Cx2PybIS3k Hey, I found your missing straw! https://t.co/JOs6p7NOEU Catch up on today's live #ConanItaly Q&amp;A and get closer to @jordanschlansky than you ever wanted to. https://t.co/hNa9bsIyBU It’s come out that EPA head Scott Pruitt has four separate e-mail addresses. And get this: all of them run on coal. Watch every clip from #ConanItaly and tons of behind the scenes extras @ https://t.co/lLHvSZa0sy Watch @jordanschlansky and I drive around Italy in a toy car and much more tonight at 10/9c on @TBSNetwork. #ConanItaly https://t.co/3Zmcu3Oi9h Proud to showcase the 2018 model of @JordanSchlansky, tonight at 10pm on TBS. Bad news: Trump’s border wall has already experienced a serious breach: https://t.co/oqcwEmjbre In Hell, the radio is only the Kars for Kids commercials. Want some juicy Hollywood gossip? After three drinks, I sometimes mispronounce “Charlize Theron.” I just saw a cloud that looked exactly like my father withholding his approval. Last night, the portraits of Washington and Jefferson quietly snuck out of the White House. When I was a kid I thought by now we’d be living on the moon and zipping around in flying cars and sleeping in the same room as your wife. After seeing how Ivanka is treated in the press, I’m so grateful I decided against hiring my daughter then asking her to constantly lie for me. Trump just made his own shadow sign an NDA. My son asked if I’d take him to see Sherlock Gnomes and I told him, “Gnome thanks.” I’ve been waiting for a high-five for three days now. My son pranked me early this morning with the old “sledgehammer to the back of the head.” At this year’s White House Easter Egg Roll, the winning child gets to fire the Trump Cabinet member of their choice. The new TIME cover just reminded me that all his movies are now available ON BLU-RAY! https://t.co/ZFFMsJYY5M President Trump didn't just call Roseanne to congratulate her on her sitcom. He wanted to know if she'd be next up for Secretary of State. Coming soon to theaters nowhere: \"Due Buffoni\" starring @jordanschlansky and Conan O'Brien. #ConanItaly premieres April 11th @ 10/9c on @TBSNetwork. https://t.co/AFda32H92F The only thing I don’t love about those “Medieval Times” restaurants is how you die at age 30. I miss the rites of spring from my childhood, the snow melting, the birds chirping, me being cut from the baseball team. I’m pretty sure the audience appreciated my standing up repeatedly and saying, “Actually, it’s PANTHER OF COLOR.” I took fake Italian and real CONAN employee @jordanschlansky to Italy. Watch #ConanItaly April 11th @ 10/9c on @TBSNetwork. https://t.co/1BLYO0NZDt .@JuddApatow did a beautiful job making #TheZenDiariesOfGarryShandling. It’s about so much more than a great comedy mind. Watch it starting tonight @ 8pm on @HBO. I hope President Trump knows what he’s doing with these tariffs. Just had two eggrolls at Panda Express and it cost me $611.00. Saying John Bolton looks like a walrus isn't fair. He looks like a muppet walrus judge. 75-year-old Joe Biden wants to fight 71-year-old Donald Trump. The winner takes on Bob Newhart. Radiohead just beat out The Cure in my March Sadness bracket. Ben Affleck’s back tattoo has given me the courage to share mine: https://t.co/hFL5G8HpQY Donald Trump, Jr. has brought shame to his family name by only having one divorce. Wow, the new President of Russia looks so much like the old President! Trump has become such a divisive figure, I’m afraid he’s ruined that hairstyle for other men. Putin is going to win re-election in a landslide. Because his opponent is going to die mysteriously in a landslide. Read the tweet above this. Now read the tweet below this. COINCIDENCE??? Sometimes I feel bad for Melania, but then I remember she once killed another model with her teeth. The chances of picking a perfect March Madness bracket are 1 in 9.2 quintillion. Which sounds impossible, but 5 years ago those were the odds Donald Trump would be president. My new workout regimen: sumo wrestling with @KevinHart4Real. Watch us on @WhatTheFit — only on the @LOLNetwork channel on @YouTube. https://t.co/gH8blSCUIJ #WhatTheFit https://t.co/ExHR6Ag3Oa .@TheRock was born to be an action hero. I was born to be his stunt double. #RampageMovie https://t.co/5hMsVlyg0z Most people don't realize @AndyRichter has been a hologram for the last five years. President Trump has been consulting with Bill Clinton’s impeachment lawyer. The lawyer is a partner at the firm of “Notta, Good, &amp; Sign.” DID YOU KNOW: Hot Dog on a Stick was originally established as a warning to hot dogs who betray the King. My show is not on TV tonight, but you can still laugh and cry while watching the March Madness Selection Show @ 6pm ET on @TBSNetwork. How much wood would a woodchuck chuck if he had a CHUCK-CO Wood-a-Pult 4000? “McMaster” sounds like what happens when a German guy makes up an Irish name. Years ago my siblings bought me a commemorative brick outside Ford’s Theatre in DC.  Suck it, all other celebrities! https://t.co/2iOtSBIvJU Happy #InternationalWomensDay. Thank you to all the women who work on my show. https://t.co/sAFSv7YECA Netflix announced it will release over 700 original TV series and movies this year. That explains their new slogan, “Quantity.” There’s too much news now. I just found out about the new aluminum tariff from my Snapple cap. March came in like a lion and was shot by some rich a-hole. My favorite wine is a 1965 Timothee Chalamet. I told my kids that at their age I had to watch VHS tapes on school safety, and they said “what’s school safety?” If bumblebees truly do communicate through dance, what are the white ones supposed to do? President Trump will be attending Evangelist Billy Graham’s funeral. So apparently, Graham’s being buried at a golf course. When our kids were babies, my wife and I played them Salieri instead of Mozart, and now they’ve grown into jealous, brooding schemers. It’s your last chance to enter to be my co-host for a night. Enter now to help me host #CONAN and support @NEXTforAUTISM @ https://t.co/x7KrfnUufj https://t.co/ZtiKcSSJ6x I was in Black Panther. Not the movie, the live sex club in Atlanta. I was asked to leave. Watch the premiere of #FinalSpace tonight @ 10:30/9:30c on @TBSNetwork followed by my interview with creator @OlanRogers. I’m available to represent Hungary in the 2022 Winter Games. Just tell me the sport and I’ll start taking lessons. Trump’s plan to save the environment is to arm the trees with pollution. If I could play any musical instrument in the world, it would be a violin that has twenty million dollars hidden inside it. I just went to this crazy 80s retro party where we ended up invading Grenada. They should make brownies that look like joints but contain no marijuana. I can't stand wheelchairs. Damn, I messed up the punctuation on that one. It should be: \"I can't stand! Wheelchairs?\" Mike Pence just won a gold medal in his winter Olympics event, “the frozen stare.” I'd say the worst example of a retailer piggybacking on a cool movie's hype is the new Macy's campaign: \"BLACK PANT(s for) HER\" Our Italian adventure is over. Ciao for now and stay tuned. #ConanItaly https://t.co/e24oi8juyR I'm not saying everyone in LA is stoned, but a cop just pulled me over to give me a high 5. Is anyone else listening to that podcast in their car, the one with the sobbing woman who says I'm not a podcast, damn it, I'm your wife, what's wrong with you? #HappyValentinesDay https://t.co/VCgad9zWlh The highlight of Carnevale in Viareggio was meeting Sardinian Captain and Mrs. Crunch. #ConanItaly https://t.co/ZLA6GZ36Ae Took @jordanschlansky to Carnevale in Viareggio. One of us had a great time. #ConanItaly https://t.co/zFGVAmQZkN Arrivederci, Florence. Time to hit the road. Andiamo! #ConanItaly https://t.co/c7KLD42Pel #NSFW #ConanItaly https://t.co/wi17tCXgYP Ciao! I just arrived in #Italy to film a new episode of #ConanWithoutBorders, and brought along a friend. It’s going to be a long week. #ConanItaly https://t.co/qyznU6Ltd9 I hope the newly announced “Indiana Jones 5” retells the entire saga from the point of view of the snakes. I don’t know how this happened but apparently I was just traded to the Cavaliers??? Still trying to figure out how Nancy Pelosi’s 8-hour speech fits into the Cloverfield Universe. So you’re telling me, I’m the *only* person at this party who thought the “B” in “BYOB” stands for “Botulism?” Scientists have recreated the face of a teenage girl from 9,000 years ago. Careful analysis shows she died of embarrassment over something her mom did. I just found out my spirit animal is a therapy poodle. Boy, I sure hope Trump doesn't resign or anything. #ReversePsychology #WorthAShot What novelist do pirates love? Gearrrge Arrr Arrr Marrrtin. (For your personal apology, contact my office) I bet $1500 on the Eagles. The band. Do you think Janet Jackson’s other breast feels like it didn’t get its turn? In a fight between Devin Nunes and the FBI, who do I bet on? The group who took down John Gotti, or the guy who got his genitals caught in the zipper of his parachute pants? https://t.co/ohEPySRDry Amazon is starting its own healthcare company. Good for them, but I think I’ll continue to get my healthcare from https://t.co/WRovOqgSJb. Late night thought: My body is a reverse Brita filter. Show your support for the people of Haiti with a \"Haiti Is Great Already\" t-shirt. Each shirt sold benefits @jphro and @artistsforpeace. https://t.co/UYjO3fKmFi #ConanHaiti This meal is delicious! (NOTE TO SELF: save this one to drafts and use it if I have a delicious meal) Hi guys. Going to be away from Twitter for a while. Just dealing with all of these Toys R Us closures in my own private way. FYI, it’s *3* minutes to midnight on my Doomsday Apple Watch. Watch the first nine minutes of #ConanHaiti and tune in tonight @ 10/9c on @TBSNetwork. https://t.co/R56YYdnWY9 I just heard CBS is bringing back \"Murphy Brown\" which means I'll now have to sit my kids down and give them the “Murphy Brown talk.\" Man, I’d do anything to trade jobs with Riley: https://t.co/kUi2llFsXV I’m excited to announce that I’ve found my successor. https://t.co/k0u4BqFH4k It doesn't matter if I’m \"solving a problem that doesn’t exist\" - my point is that these tiny avocado pit cannons are just $49.99 apiece. We know Trump watches Fox News commercials because he just put a reverse mortgage on the White House. That’s a wrap on #ConanHaiti! Thank you to the people of #Haiti for their warmth, hospitality and humor - and a special thank you to our excellent Haitian crew for making it all possible. Make sure to watch #ConanHaiti this Saturday night at 10/9c on @TBSNetwork. https://t.co/EeVKxZ1mIi #Haiti is truly a beautiful country. #ConanHaiti https://t.co/CfxDFvNz2i Getting the people of #Haiti to model my updated @RealDonaldTrump #Maga hat. #HaitiIsGreatAlready #ConanHaiti https://t.co/Y0RLHWyY0B Had an amazing dinner at Brasserie Quartier Latin and danced so hard to the @BoukmanEKS featuring @mikaben &amp; @paulbeaubrun that my pants fell down. I love this country. #ConanHaiti https://t.co/qsDqE8rh6j Here I am disrupting the educational process once again. #ConanHaiti #PRODEVHaiti https://t.co/gDEaI4a892 Hey @WCKitchen! Thanks for letting me help out with Haitian cuisine prep. I didn't know it was possible to flunk out of school in ten minutes. #ConanHaiti https://t.co/QLA7PihE2h Just landed in #Haiti and already made some new friends! Follow me all this weekend in real time as I explore this beautiful country. #ConanHaiti https://t.co/GGmv8mtmO9 Before I travel to Haiti, I want to introduce myself to the Haitian people. https://t.co/hCaKaQDjUC #ConanHaiti Instead of checking IDs, bars now make sure that people can’t name 3 YouTube Stars. If I die suddenly, in order to avoid embarrassment to my family, I’ve designated a friend to destroy my enormous hidden stash of hand-painted pewter wizards. Here's why I'm heading to Haiti later this week. https://t.co/G3BqTCVy4a #ConanHaiti If you are in Washington, D.C., an exciting time to visit the White House is 1-3PM, when they feed live lizards to Stephen Miller. Still reeling from @realDonaldTrump’s very negative Yelp review of Haiti, which means I’ll love it. Headed to Haiti later this week to explore and make some new friends. Stay tuned for my report. #ConanWithoutBorders In his new movie, Liam Neeson is “taken” in an elderly insurance scam. I know an awesome recipe for opening soup. A) I’ve never been to Richmond, VA and B)  I showed you my tattoo in confidence. https://t.co/BYLgaJtSIQ President Oprah would sit down with Kim Jong-un for at least three segments. I finally finished a Chapstick without losing it or putting it through the wash. Time to die. Funyuns: not all that fun. Discuss. In LA, I have trouble guessing how old people my age are. If you haven’t yet seen the movie, “The Shape of Water,” SPOILER ALERT: Whatever shape container you put it in. The Mega Millions drawing is going to make someone an instant Republican. It's starting to look like the Russia investigation will finally bring Trump down. And by bring down, I mean get him reelected. One thing we can expect from this fight between Donald Trump and Steve Bannon: A lot of heavy, labored breathing. Personally I'm secure about the size of my nuclear button. Still waiting for Donald Trump to be downgraded to a tropical shit storm. How many people have been wrongly charged with murder because they’d just finished eating a pomegranate? 2018: what could go right? Sad! This is the spread at the Mar-a-Lago New Year's party! https://t.co/fAbMMkjQtB I can’t wait until 2017 is over.  And 2018, 19, and 20. After what happened to 2017, 2018 is refusing to come out of its room. A hilarious thing to do when you're waiting too long for something is roll your eyes and say \"What IS this, the Mueller probe?\" Let me put an end to the rumors: the creature in \"The Shape of Water\" is not me in hi-def. My egg nog koi pond looks beautiful, especially with all the fish resting on the surface oh my God what have I done? Happy Holidays to those of you who celebrate holidays. #Bases #Covered I love my family's Christmas Eve tradition of gathering around the piano and telling Uncle Sean to put his pants back on. I met Santa at the Macy’s in Seattle. He’s now suing me for breaking his femur. #MerryChristmasEve https://t.co/IEQDP6PELg The most commonly spoken phrase this week in all homes - \"Do you have the Scotch tape?” Not a good sign: the first thing on Trump's Christmas list is one of those jackets like Mussolini wore. In Seattle for Christmas and there’s only one way to travel: Monorail!!! #Simpsons #HoJu https://t.co/B8xBLehBuQ Stuck on a gift for Senator Mitch McConnell? You can't go wrong with body glitter. Rich people are really going to take a bath with this new tax plan. In money. They will bathe in money. Reading about the White House while watching #TheCrown. Could they, would they, consider taking us back? Want to co-host my show for a day and get your own podium next to @AndyRichter? Visit https://t.co/lRasL5jGl9 to enter and learn more about @NEXTforAUTISM. Pro-tip: do not go Christmas caroling in a Stand Your Ground state. Here comes Santa Claus, here come Santa Claus, right down the 405 until he hits the 101 which is backed up all the way to Glendale thanks to a jack-knifed trailer. All I want for Christmas is my two front teeth dipped in gold and turned into drone remotes. If the Christmas carolers at my door are really good, I turn my red swivel chair dramatically toward them. Just received Betsy DeVos’s “Marry Chrissmiss” card. \"Stuck a feather in his cap and called it macaroni\" was for many years the textbook definition of insanity. I’m not sure I agree with Roy Moore’s position that “life begins at masturbation.” Just got picked up in a self-driving Lyft. And the driver still talked my ear off. Tonight I hung out with Chris Hemsworth, Ryan Reynolds and Channing Tatum at this cool bar called Never Gonna Happen’s. Trump has been uncharacteristically quiet on Twitter. I bet his staff tricked him with one of these https://t.co/dCNTnOGtrd Just saw @mulaney at the Orpheum in Los Angeles and I have not laughed that hard in memory. I want to grow up to be that funny someday. https://t.co/NmemTUnqoN Trump just made even more people angry -- he plans to recognize Lannisport as the capital of Westeros. I prefer that other Chinese curse, “May you live in boring times, near a Dunkin’ Donuts.” Please don’t @ me, I’m on a news cleanse. I just spent 3 hours trying to solve this Rubik's Cube before my son told me it's an apple. I may need a nap. Flynn pleads guilty and flips.  Finally, the 282nd sure thing to bring down the Trump Administration. A great thing about the new tax plan - if you own a race horse, you can write off its genitals as a small business. The GOP tax plan can only be read while wearing a monocle and shouting “Jeeves! Wipe me!” Five hundred years ago, it would take months for word of a sitcom’s cancellation to reach Europe. May you live in interesting times, like when your vice-president starts picking his vice-president. I returned a book to the library today and learned they really prefer it to be a book that was previously checked out of a library. The trailer for Marvel’s new Avengers movie came out today, and it’s starring every woman in America. Lifehack: Get a tattoo of your face on the top of your head so there's never a need to look up from your phone. A Mormon came to my door, and after a long, emotional, and persuasive pitch, I got him to start wearing longer sleeves. Latest entry in my Gratitude Journal: \"The Altoids people didn't go into the suppository business.\" Sometimes when things go bad, I only have other people to blame. I love that. I just heard the Dead Sea Scrolls at the new Bible Museum might be fake &amp; I'm now questioning the authenticity of this \"photograph\" they sold me. https://t.co/DU2b7vKJDu Trump is already tweeting that Black Friday is the most ungrateful of all the Fridays. This year, I'm breaking with tradition a little and stuffing my turkey with delusions of grandeur. Great news: scientists have bred a turkey that tastes exactly like tofurkey. President Trump didn’t pardon the whole turkey, just the white meat. This week, 90% of all calls and texts are men contacting women in their past to say, \"Are we cool?\" A few months ago while in Israel, I met a man named Ofer Aloni. He shared a moving story about the loss of his daughter and a song he co-wrote about her with @thekin. It's called \"The Power to Choose Life.\" Please take a listen. https://t.co/GWiiVDCFBF Starting to think I shouldn't have ordered a hot sauce called \"Satan's Butthole.\" I gave blood today. It's more fun when it's on purpose. I like to think of myself as “The Blind Woman’s Ryan Gosling.” Took what I thought was a private hike with my friend @kevin_nealon. Now I see this. Sad. https://t.co/paUFp3aarg #Lineage2Revolution cinema quality graphics will make your flat screen so irrelevant, you won’t even mind when I destroy it. Download @ https://t.co/nKRv6gQSyG to play on your phone. https://t.co/LHEpNVYosw #ad Fall in LA, when the trees get work done to look like they’ve changed color. I’m starting to think this bobblehead on my desk is nothing but a “yes-man.” “I’m sure those two drunk guys with knives at the end of the bar will work this out peacefully.” – (Kim Jong Un/Trump Metaphor Tweet) Me, after my Uber driver asked, “What’s Andy really like?” https://t.co/KgokzRkagE I believe that when we die, we all become podcasts. I'm ready for the all-female reboot of America. Dumbest move of my life: taking a Lyft from NY back to LA. Toyota Yaris. Thanks to Will Ferrell and @mark_wahlberg for coming all the way to #ConanNYC to talk about Boston. https://t.co/dIAgFc9py7 I saw the most beautiful thing in Manhattan today: a Chase Bank giving birth to a litter of baby Chase Banks. #ConanNYC Honored to have President @BillClinton join me at The @ApolloTheater. #ConanNYC https://t.co/dQvrpFyQ6c Gorgeous New York City! How I have missed your empty apartments owned by Russians laundering money. #ConanNYC Thanks to Jon Stewart for helping me launch my @Omaze campaign to benefit @nextforautism. Enter to be my co-host for a night @ https://t.co/lRasL5BhcH https://t.co/IbvWKD0PfV Tonight on #ConanNYC, Jon Stewart and I ask each other some bullshit questions. https://t.co/nZ7cHwAgMr Our heroes in uniform stood up for us. It's now our turn to #Stand4Heroes with the Bob Woodruff Foundation. https://t.co/PaVF2o4z9e https://t.co/OpHebaCFum I came back to NYC to tape my show at The Apollo and retrieve this bag of Cheez-Its I left on the L train last year. #ConanNYC https://t.co/YZWwN5WFnj Thanks to Harlem style icon @DapperDanHarlem for swagging me up and down. https://t.co/jUOrT89Bda #ConanNYC First day back in New York and I've already received dirty looks from 7 different police horses. #ConanNYC So glad my younger self did not know that my older self would be drinking canned water from France. A real man should know how to order whiskey: on the rocks, in a stemmed glass, and replaced with white wine. RT @jaketapper: A cool way to help wounded veterans: watch this video about our celebrity auction! https://t.co/5ejEHEWxKM https://t.co/eNJ… “The Terminator,” but he goes back in time to sleep with John Connor’s mom, so he can later just keep reminding John about it. This Halloween, I served tricks over treats. I will remember the beatings for the rest of my days. The next kid who knocks on my door gets a VHS copy of \"RoboCop 3.\" Pretty excited about my Halloween costume: French Maid With Intimacy Issues Due To Her Recent Breakup With Steve. Just had a nightmare that I was Justin Turners' shower drain. https://t.co/gJ02mJrYaz This year for Halloween I’m giving out Canadian passports. \"Clayton Kershaw\" is the sound you make when you cough and sneeze at the same time. Watch @AaronRodgers12 and I discuss his injury and fight off feral hippos. #CluelessGamer #AssassinsCreedOrigins https://t.co/8jn6jROBUM The only way Trump will pardon the White House Thanksgiving turkey is if it promises to do the same for him in a few months. Just saw the updated Charlie Brown special where they grind up the Great Pumpkin to flavor someone’s latte. It’s only the fifth inning but both the Astros and the Dodgers just left early to beat the traffic. I get off on pouring good milk down the sink. https://t.co/innOdmSjOj Just got 49 flu shots for $1.99 at Costco. It’s exciting that the LA Dodgers will be playing in the World Series, unless of course their pilots get picked up. We all done with artichokes?  Yeah?  Everyone?  Full consensus?  Good. I love autumn in L.A., when the leaves change on my screensaver photos. Rest easy America, I just heroically solved the Dave the Horse crisis. https://t.co/ZiG1XMy5Br This is a terrible day to be on Twitter, please log off. #evergreen Look, Steve Bannon has a good twin https://t.co/Ee3RRlTMv5 The latest trailer for The Last Jedi blew me away, but why were the first 30 seconds about car insurance? I liked Blade Runner 2049 but its view of the future was too positive. Just read another Harvey Weinstein article and now my brain wants an Altoid. Tonight on @colbertlateshow, two sex symbols talk shop. https://t.co/h8y13GgVol Backstage for my appearance on @ColbertLateShow tonight. They told me to take a photo, so I did. https://t.co/7K4mUkaiEj The White Stripes sang \"We're Going To Be Friends\" on my last \"Late Night\" show. It's one of my favorite memories. https://t.co/EKCofdNe9h The name Red Lobster is helpful if you totally forgot what color lobsters are. Trying to binge-watch all of the Geico commercials. I’m up to season 117. Got styled by #Harlem #fashion icon @DapperDanHarlem. This is the before picture. #ConanNYC https://t.co/Av6pt3ectO At @SylviasSoulFood in #Harlem today, I learned that no hairnet can tame me. #ConanNYC https://t.co/6G2dvzKncr Just found out all of my childhood bullies were Russian bots. Will box office numbers adjust for all the men who buy Blade Runner 2049 tickets then “accidentally” walk into My Little Pony: The Movie? It’s time Dress Barn updated their name to something cool. Like, Gown Silo. I’m so glad they’re going to make a new Blade Runner movie every 35 years. Performed last night with the hilarious @WildHorsesShow. That face I'm making is the first sign of a massive stroke. https://t.co/5ewiX2C6BE I explored a land of moist wood, no railings, and British Orcs with @kumailn. #CluelessGamer #ShadowOfWar https://t.co/GdErFRHpO1 The most disturbing detail about Trump's new tax plan is the requirement that The Rich audibly click their heels with every million saved. I was forced to do this by those pricks in Finland. Finland if you're still reading this, I love you. https://t.co/GJtYzA0JJD Just got my flu shot. Took three nurses and a guy from the gym. I used to clear my head of the news by lying back &amp; staring at the clouds but now Trump officials keep flying through them in private jets. Now I finally get why our national anthem was written by a lawyer. Best wishes to my Jewish friends who are fasting for Yom Kippur or because they’re trying to make it in Hollywood I am trying to fire my mime. It’s not going well. The cops raided the nail salon in my neighborhood and discovered a better nail salon operating in the back. Hey @nickkroll and @StephenAtHome, this photo was taken the day I replaced\nDavid Letterman. #PuberMe #PuertoRicoRelief https://t.co/J1013j4rbr Reminder: If your knees are scraped and bleeding, you are playing the oboe incorrectly. I'm taking the stage at Stand Up for Heroes on Nov 7, but you can help #Give2Veterans now. @Stand4Heroes gets a dollar for every retweet. There is nothing more or less worse than when you're not unable to determinate a tweet's meaning or not. Watch me take @TomCruise for a drive and blow his mind. https://t.co/1nWMttDRaB Tonight on @TBSNetwork, I unveil a revolutionary idea with @TomCruise. Yes, revolutionary. Since the word \"brink\" gets a raw deal, I'm going to use it in a positive way: I am on the brink of eating a nice fruit salad. Help my friend @diegoluna_ get funds to those who need it most in Mexico. https://t.co/zw8PZd6JUf I’m starting to regret naming my son “Donald Trump, Jr.” It seemed okay 11 years ago. Graham Cassidy: terrible healthcare bill, great name for a folk singer. Melania Trump may sue over this Croatian billboard. Yesterday she said, “little bit of English? I happen to know a lottle bit of English.” https://t.co/TtzDnUiii2 Happy Rosh Hashanah to @carlreiner and @MelBrooks, if they’re Jewish. For my friends in Israel and worldwide, you can watch every clip from #ConanIsrael @ https://t.co/KvcDYmryHd I'm live on YouTube taking your questions and fawning compliments about #ConanIsrael. https://t.co/xiEMIygeTc Thinking of the great people of Mexico today and of ways to help. https://t.co/9PwDmWnHjy #ConanIsrael premieres tonight @ 10/9c on @TBSNetwork. Thanks to the people of Israel for tolerating this creepy goy. It’s sad to realize that those dancing gangs in “West Side Story” could have just settled their differences through fighting. Thoughts and prayers go out to Lay’s Potato Chips, who are clearly having a nervous breakdown: https://t.co/vt5WXXx9UW At home alone, no one here but me and Amazon Alexa. Says she doesn't want to talk. There is nothing wrong with exploring one's sexuality--and that is my message to the California Highway Patrol. You can tell the summer is officially over when my dermatologist gives the order to “Retract Shields.” I am now seriously regretting that time I told Equifax how old I actually was when I finally lost my virginity. Hey, wait, I thought I was America’s favorite scary clown. Autumn in California, where the leaves change color if you use the right Instagram filter. https://t.co/x9vkI5DUhl Knowing me, when the nuclear bombs fall, I’ll be at CVS, reading the back of a bottle of exfoliating soap. Ahora mismo estoy pensando en todos mis buenos amigos en Mexico. For a guy with a billion dollars and a cool car, Elon Musk is kind of a downer. I think I found a way to get President Trump to read Obama’s powerful statement about #DACA: https://t.co/lEPIeV67O3 I won’t kill you with kindness, but I will mace you with charm. “First of all, Your Honor, I prefer the term ‘penis portraits’....” Remember how enthralling and distracting it could be to play with a bubble machine on a lazy summer’s day?  Can we get Trump one of those? Toda/Shukran/Thank You to my Israeli, Palestinian &amp; American crews. This show is only possible because of all you fine people. #ConanIsrael https://t.co/oMShKrE0wQ Enjoyed a beautiful day in #TelAvivJaffa picnicking  with an Israeli Arab family. #ConanIsrael #Israel https://t.co/Bg3Rio0Fgo Besides being beautiful and talented, @GalGadot is easily the nicest superhero I've ever met. #ConanIsrael #Israel #WonderWoman https://t.co/akb7hqgQc6 When in Tel-Aviv... #ConanIsrael https://t.co/A4wlOVZUto Talking to Israeli talk show host @alfiguri neck deep in the #SeaofGalilee. I'm the woman on the left. #ConanIsrael #HayomBalayla https://t.co/t280Fby8fZ This is my 7th day in #Israel, my body is 62% hummus. #ConanIsrael https://t.co/kQRdknjgTa Filming on the Syrian border where you can hear gunfire between rebels and regime forces. https://t.co/s32IlYZwkS Meeting Syrian victims of the civil war being treated at an Israeli hospital near the border. Faces blurred for their safety. https://t.co/MvghboAl80 Today I had my butt kicked by the women of the #IDF Karkl Battalion. That's me in the middle. #SquadGoals #ConanIsrael #Israel https://t.co/ddCm9nZA8D Floating in the #DeadSea and enjoying Garfield in Hebrew. #ConanIsrael #Israel https://t.co/qW1c32sBRl Had a great time shooting a scene in one of my favorite shows #Fauda. #ConanIsrael https://t.co/JxVrHxEPkP Learned to dance the #Palestinian way. #Salam #Palestine #Bethlehem https://t.co/r24j1JfNg2 Hanging with some Palestinian children in the West Bank Aida Refugee Camp. They are not impressed with my showbiz stories. #Palestine https://t.co/QKTkVp9KD5 Smoking #hookah and making friends in the West Bank. #Bethlehem #Palestine https://t.co/rSbUoOSpPU Visited an Arab Market and became an expert at haggling. If \"haggling\" means \"paying full retail and then crying.\" #ConanIsrael #Jerusalem https://t.co/5X7av7pHPh I met this man David on the streets of the Old City. He invited me and my camera crew up for a coffee. So we went. #ConanIsrael https://t.co/YYsWxUf4NY I got an exclusive preview of tonight's extra long #GameofThrones finale. https://t.co/RaMC1LHTra Help those affected by Hurricane Harvey by visiting https://t.co/4Wn9MKv6pU or texting HARVEY to 90999 to make a $10 donation. I asked for the craziest drink in #TelAviv and I got it. #ConanIsrael https://t.co/6yb5vz70wT Good luck tonight, @TheNotoriousMMA. Can't wait to see you in those shorts. #MayweatherMcGregor https://t.co/1LmsRD4s7D Shalom #Israel. #ConanIsrael https://t.co/JWxyvIAJJ2 Brushing up on my Hebrew on my El-Al flight to Israel. #ConanIsrael #Israel #Shalom שלום# https://t.co/sI09fuXOHD Just searched “Trump psychological profile” and crashed WebMD. Even if Big Ben does go silent, I bet it won’t shut up about its new juice cleanse. Just think, 100 years from now, our grandchildren will be taking down Senator Kid Rock statues. When the eclipse comes I’m going to borrow the special glasses my wife uses when I’m shirtless. Once asked SNL legend Herb Sargent what's the funniest thing you ever saw? He instantly said, \"Martin and Lewis, 1940's, in a club.\" Can’t we just go back to being on the brink of nuclear war? A big hello to new White House communications director Hope Hic--what, fired? I heard the iPhone 15 won't have any ports or jacks or a screen and it will just be a smooth steel ball and finally we'll all be happy. I'm leaving America during this divisive time for the relative peace and quiet of the Middle East. https://t.co/RnVTythuzI #ConanIsrael .@TheNotoriousMMA joined us to explain how he's going to \"dismantle\" @FloydMayweather. https://t.co/BHD0aP14Ld #MayweatherMcGregor On August 21st, there will be a total eclipse - which will look amazing after you miss it and see pics of it online the next day. Had that nightmare where my chute doesn’t open and I hit the ground, and the last thing I hear is a cannibal shouting “5-second rule!” Breaking: Conan O’Brien sends Conan O’Brien to Israel to help Jared Kushner. Stay tuned. #ConanIsrael #ConanWithoutBorders https://t.co/7ystp6aMqR Remember when all we had to worry about was Ebola?  Good times. RT @congenitalhi: One of the most revered television hosts &amp; comedians of all time @ConanOBrien will host #SugarSoiree2017! Tickets: https:… Just think, we’ll be able to tell our grandchildren, “I remember the day President Trump tweeted the nuclear launch codes.” Never been so nostalgic for Kim Jong-il. The only tan I’m getting this summer is a caftan!* \n*Excerpted from my Golden Girls spec script. I think it’s wrong to just steal honey from the bees, so I always make sure to leave behind a few “Late Night with Conan O’Brien” DVDs. You call it day drinking, I call it something unintelligible because I’m day drinking. There are three ways to cook a hot dog: Boil, grill, and, I just discovered by accident, dry clean. Does this man bun make my unicycle look big? I still remember summer as a child, when my parents shipped me off to camp for 12 years. It’s not fair, people are getting fired so fast at the White House that I don’t get a chance to make fun of them #theMooch Sooner or later, Trump is going to realize that’s just a sack of potatoes in Melania’s bed. People are complaining that Beyoncé’s wax likeness doesn’t look like her, but it’s a much closer match than mine: https://t.co/G13ARbcYOr Pokémon announced that Legendary Pokémon will appear in gyms in the form of Legendary Eggs.  And guess what…nobody gives a legendary crap. I had the craziest dream last night. I dreamt the Republicans managed to pass a piece of legislation. Just heard Chris Christie got booed while performing CPR on a choking victim. “OJ Simpson Paroled” is by far the worst reboot of the summer. Trump hired Anthony Scaramucci because he thought his tan qualified him as a \"person of color.\" I miss Comic-Con so much today I went to the DMV just to wait in line. So long Comic-Con! After seeing Marvel and DC people coexist in peace, I have hope for the Democrats and Republicans. #SDCC #ConanCon #Hope No, that’s not a White Walker interviewing the cast of @GameOfThrones tonight. #ConanCon In honor of tonight's #GameOfThrones cast show, @nottjmiller welded himself inside an Iron Throne. https://t.co/FPLui7M0pN #ConanCon I hereby pardon myself for tweeting this tweet about Trump wanting to pardon himself. They're fools if they don't cast Aubrey Plaza as Teen Dumbledore. #ConanCon #Pollock https://t.co/96aBLUwEDj Tonight, I ask the cast of #LEGONINJAGOMovie where the hell \"The LEGO Conan Movie\" is. #ConanCon A female Doctor Who? What's next? (And DON'T say \"a male Conan\") Careful out there: If a cosplay Marvel character has sex with a cosplay DC character, the universe explodes. #SDCC Last year I unveiled my superhero suit, but a superhero needs his ride… https://t.co/nfF3iiO2P3 #ConanCon We have the entire cast of #Kingsman: The Golden Circle on tonight's show, including Storm, Mr. Darcy, The Dude and Magic Mike. #ConanCon .@AndyRichter kicked me out of his truck, so I was forced to find alternate transportation to #ConanCon. https://t.co/pqI5SPpdRz I can’t believe I get to sit down with Will Smith tonight. We haven’t done that since we co-wrote “Summertime” with Jazzy Jeff. #ConanCon I just saw a Dumbledore, a Gandalf, and a Doctor Strange make a bag of Cool Ranch Doritos disappear! #Magic #SDCC #SDCC's Hall H holds 6,500 people, almost enough room for a meeting with Donald Trump Jr. Finally, the one week a year when I can walk around dressed like Harley Quinn and not be judged. #SDCC I'm headed to #SDCC to host 4 shows, and promote my new movie, \"Atomic Ginger.” #ConanCon Has anyone ever bothered to suggest to Amazon what it might like? If machines become truly self-aware, that means humanity could still defeat them through “shaming.”    #HeyFatBot The former president of Brazil was just sent to prison.  He was brought down by leaked emails from his son, Former President of Brazil Jr. .@FullFrontalSamB is so close to raising $1 million for @PPact. Help put them over the top. https://t.co/BNW8bNWmCz The bad news: 22 million people will lose health coverage under the Senate’s plan. The good news: Karen Pence’s 20,000 bees are covered. I bet 12-year-old Bruce Wayne gave that movie theater a terrible Yelp review. Even though we’re in the same time zone, my wife is always one hour ahead of me. Trump just fulfilled a campaign promise by quietly draining a small swamp outside Tallahassee. I just completed 100 push-ups. (I started last November.) Astronomers have discovered 10 new Earth-like planets, 8 of them recently taken over by talking apes. Say what you will about the new Ken dolls, I think they’re summer’s most insertable toy! I keep trying to think of a funny tweet about North Korea having nuclear missiles.  It’s not coming. Today, we Americans celebrate our independence from Britain while planning our escape to Canada. Our country was founded by people who were mad at King George because he refused to show us his taxation statements. Fireworks safety tip: blow your fingers off this year, before the AHCA passes. I think the Russians' ability to hack the internet is vastly overrat-Конан О'Брайен - такой мудак You helped us pass 5 million subscribers on YouTube! And to think it all started in this empty office: \nhttps://t.co/KSKphUOcMX Been checking Twitter every five minutes, but thank God, so far @realdonaldtrump hasn't mentioned my facelift. I’m trying to convince my Seattle in-laws the new travel ban means we can’t visit them this summer. My Uber driver has a man-bun Ken doll hanging from his rear view mirror. Mitch McConnell constantly looks like a kid who just stole all the gum. How long until we can pay for groceries by simply waving a hand over the register? It's already been an hour but they're asking me to leave. Good luck tonight @Lesdoggg. #BETAwards https://t.co/TAyIAt3ypa Grilling tip: order in. ARE YOU SHITTING ME WITH THIS????!!!??? #EvergreenTweet .@ArnettWill and I traded sick burns and bad puns in the latest #CluelessGamer. #ARMS https://t.co/Cqj3eIsek9 My kids think Edvard Munch is the guy who did a painting of the scream emoji. Some say Steve Bannon is the real president, others say he's a Galapagos marine iguana. Secret Service Fun Fact: 3 out of 4 people caught scaling the White House fence are process servers. Amazon bought Whole Foods, so soon I’ll be up late at night drunk-ordering spelt. My body is a temple in that people lower their heads and cross themselves when they see it. From now on, rather than a gendered pronoun, I would like to be referred to as the elusive fifth flavor “umami.” Dear Mr. Bezos: There are less expensive ways to check out women in yoga pants. From photos of Trump’s personal attorney and personal doctor, I’m starting to think he hires people solely based on hair density: https://t.co/ZFHwSj8AGC Wait a minute. Taylor Swift dropped her entire catalogue on Spotify last week and I'm supposed to think of funny tweets right now? No. Just in time for Father's Day, the perfect gift from Jeff Sessions. https://t.co/NtbJK5tZqD Just when I thought he couldn’t get any cooler, @JustinTrudeau just showed up in my home and offered to make me crab cakes. Before the invention of popcorn, people would just eat dried kernels of corn, then stick their face in a fire until their teeth exploded. God Bless Adam West https://t.co/9OK7kHNZHS I’m organizing a “creeps-only” screening of Wonder Woman in my rented storage container. Trump wakes up every morning and says, \"Today I'll act like a president.\" But then his thumbs say, \"Oh, no, you won't.\" Tomorrow, me and 12 friends are going to an ESPN Zone to watch the former head of the FBI testify before Congress. Trump said he plans to privatize air traffic control so I look forward to overhearing my drive-thru cashier landing a plane between orders. Soon, playing Spiderman will be like getting called to serve on jury duty. Very honored and humbled to be headlining at Red Lobster’s “ShrimpFest!” There used to be a time when we didn’t have access to all the world’s knowledge while sitting on the toilet. My new thing is to take photos of my meal AFTER I've eaten it.  This was\nan apple with almond butter. https://t.co/bptoZ1leFa I watch pro wrestling not for entertainment, but to evaluate our next crop of presidential candidates. Happy 10th Anniversary to PornHub, a website I just now heard about. Seriously. Just now. Today would have been JFK's 100th birthday. Honor his legacy by learning more about him. https://t.co/7ba38JaXZx Trump is very relieved to be back in America, where he understands what the protestors are saying. Enjoy bonus footage of @GalGadot kicking my ass @ https://t.co/4hKhM434xd #WonderWoman https://t.co/xA6fxB1tNM I no longer think Trump conspired with Russia to win the election, because he would have bragged about it to a barista by now. I asked @GalGadot to meet me in a warehouse and teach me how to fight. For some reason, she agreed. #WonderWoman https://t.co/GvzmymIpHa “The snake has said all he’s going to say about the matter.” - Sean Spicer at the Garden of Eden Trump is to US Presidents as Godzilla is to US Presidents. Someday we'll all look back on this and scream. I would try soy hot dogs, but I’m afraid they’re full of soy lips and snouts. The biggest surprise in the upcoming “Han Solo” prequel is that he was born Henry Solowitz in Parsippany, NJ. Mike Pence is dreamily writing \"President Mike Pence\" on his spiral notebook. “Can you believe the latest Trump thing?”  has become the new “’sup.” Hey @mutualofomaha, u up? I wanted to spend more time with my family, but they insisted I do this instead: https://t.co/trx4e2gBVx Please respect my privacy at this time, but I am leaving my family for the sexy robot in “Ex Machina.” Whenever I want a little peace and quiet, I just fill a studio with 200 people and go out and do a monologue. For Mother's Day, I gave my Mom a ticket to visit her favorite son. He lives in Florida. Best street food in Ancient Rome\nHandsomest guy in the Aztec Empire\nLongest continuous pee \n#StatsOnlyGodKnows Dredge: Whether you’re coating something delicious in flour, or looking for a body in a lake, dredge is your word. #Dredge A life-size statue of Ronald McDonald was stolen from a McDonald's in New Jersey. Police are on the lookout for someone very sad. Maybe it’s me, but Mike Pence has that look you get when you realize the gnat is too far down your throat to spit out. Overheard in 2026: “I know of this one man, he’s so rich, he went to a DOCTOR.” Barack Obama's biography is out tmrw. Just getting the word out so I'm not the only one outside Barnes &amp; Noble at midnight dressed as Obama. I blame the Wright brothers for inventing a machine that practically begs you to kick a family off it then later settle out of court. At Starbucks this morning, everyone is on their laptops drafting a healthcare bill. Turns out you can just *buy* a Rodeo Champion belt buckle. Do you think Henry the VIII and Anne Boleyn liked their celebrity couple name, “Anery the VIIIeyn”? If I were in prison, I wouldn’t ruin my spoon trying to tunnel out, because going without morning yogurt is its own prison. Do these jeans make my ass look existent? We could end all crime if we just sentenced convicts to lick the bottom of a Chuck-E-Cheese ball pit. Took my family to the Renaissance Fair on Saturday; today we are all laid up with melancholy humours. The year is 2052, President Cooterpie has declared war on That Island of Plastic Garbage in the Pacific, and the Stones are still touring. Tomorrow on TBS, @realDonaldTrump faces his greatest nightmare: a funny female immigrant with a brain. @iamsambee hosts #NotTheWHCD @ 10/9c. Actively ignoring the guy in the stall next to mine who keeps asking if I want to “see Baby Groot.” For my latest #CluelessGamer, I strapped on a Oculus Rift headset and saw my dim future in VR. https://t.co/CaDujx48A9 Crazy idea, but what if Donald, Vlad, Kim Jong and Xi just like, I don’t know, got a weekend beach house &amp; talked it out. Dennis Rodman too. Serious question: Is there a Melania Jong Un? Let's settle this the old-fashioned way: Kim Jong Un and Donald Trump at dawn in New Jersey. Trump’s biggest accomplishment in his first 100 days has been making it seem like much longer. It’s springtime in LA, which means I’m still wearing my Ugg boots, but with short shorts. For the record, yes, I found this photo to be deeply insulting: https://t.co/xzbRAp3WbH What if the man in Edvard Munch’s “The Scream” is actually just singing “Day-O” from “The Banana Boat Song?” I still don't know what nougat is. Pro tip: if you’re caught peeing in public, write the word “Hi” – now you’re expressing a First Amendment right. I demand a 5-hour energy drink where I choose when and how much energy to dole out, over the course of a century. This summer, camp counselors all over the country will shine flashlights under their chins and read the headlines. My two favorite things about Easter morning are (1) hiding the eggs and (2) the looks on my kids' faces when the snakes start to hatch. Pretty chill night. Hung out with these guys. https://t.co/1A65Da5cAS I wish President Trump would stop calling “Good Friday” “Tremendous Friday, the Greatest Friday you’ve ever seen.” The most exciting part of Easter egg hunts at my house is when suddenly the hunted become the hunters. MOVIE IDEA: Equels. It's the movie you're watching. Does it make me seem more badass if I drink this Sleepytime Herbal Tea out of a human skull? “Tinder is the Night” #UpdateAFitzgeraldNovel #HashtagsWithOnlyOneResponse Sometimes I think the bulk packages at Costco are too large. Who needs 12 condoms?! In Indiana, a 94-year-old woman has worked at McDonald’s for the past 44 years. And she’s almost finished paying off her student loans. Just think, pretty soon we'll have self-driving cars to masturbate in. I was thrilled to interview/be insulted non-stop by the legendary Don Rickles. I will sorely miss this incredibly funny and lovable man. I may not be the strongest person at the gym, but I defy you to find someone in this Curves with a better attitude. What has more failed launches? Trump businesses, or North Korea? I’m not worried about the stock market, because all my wealth is in individually wrapped bologna slices. Okay let me put an internet rumor to bed. NO, this isn't me. https://t.co/4LIbzDV4XY Whenever I think milk might have gone bad, I ask Sean Spicer to smell it. If he says it smells fine, I know to throw it out. We live in a representative democracy where elected officials are accountable to the people. APRIL FOOLS! I’m not positive, but I’m pretty sure one of this year’s Final Four-- N. Carolina, S. Carolina, Oregon, or Gonzaga --isn’t a state. It would not surprise me at all if someone had footage of Devin Nunes with his head stuck inside a beehive. This is the ideal time in the season to either plant tomatoes or enter into a land war with Russia, I forget which. Congress voted to allow your internet provider to sell your browser history. Long story short, goodbye sweet internet. I was also once thrown off a United Airlines flight for wearing these https://t.co/qgyCovqEHI One of Uber’s self-driving cars crashed in Arizona. Evidently, the car couldn’t stand to hear one more passenger say, “But it’s a dry heat.” Most of the water cooler talk at my office is millennials standing around the water cooler, saying what is this thing? If you say the word “lozenge” 50 times out loud, it starts sounding really weird. Also, your family leaves the dining table. If I could only pick one desert island record, I’d choose whichever album is most canoe-shaped. Giraffes are gentle creatures who do not kill, except when asked one too many times, \"How's the weather up there?\" The key to looking young is getting the \"right work\" done. Just a subtle tweak now and then. Do you like my new hawk wings? Me: Siri, did The Beatles ever use female backup singers in their songs?\nSiri: You have a lot of free time for a, quote, busy guy. Bracket already busted. I had “Woody Harrelson From White Men Can’t Jump” going all the way. I can’t believe peace talks fell through between the communist leaders of North Korea and the former head of Exxon. I’m excited for today’s L.A. Marathon, where people try to drive 26.2 miles in under four hours. Weird moment during German Chancellor Merkel’s WH visit when Steve Bannon sat at her feet and begged for stories about “the good old days.” On this St. Patrick’s Day, I can’t help but reflect on all the leprechauns detained at the airport. Sean Spicer reminds me of the kid who would stuff a whole pack of Bubble Yum into his mouth just so he wouldn’t have to share it. Beware the Ides of March.  Also the Promises of Maddow. Every Ides of March, I order a Caesar Salad and stab it repeatedly with a knife. The new head of the EPA just changed the name of “polar bears” to “bears.” I should have predicted this would happen - my kids saw \"Kong: Skull Island\" and now they want their own pet Hiddleston. When is International Men-Frequently-Mistaken-For-Women Day? Movie idea: The Shining but the hotel is on a tropical island and there is free wifi and drink deals if you have a wrist band. If there was a gym in my house. I would definitely pay $80 a month to not go to it. I just got a ticket for driving while wearing VR goggles yet the cop couldn't suggest any other way for me to feel like I'm riding a dragon. Beautiful day—just saw Trump’s policy advisor Stephen Miller sunning himself on a rock, eating a cricket. The Syrian bread I ordered was detained at the airport. Thanks to @AquilesChavez, I can finally say that I've tenderized an octopus with a hammer. https://t.co/guQo3t03YN #ConanMexico .@sofffiaaa's stand-up set for #ConanMexico really made me laugh. Be sure to check it out. https://t.co/QuzU1ThorG Historical fact: When Galileo said the Earth revolves around the Sun, Pope Paul V said, “Fake news.  Sad.” The good people at #MiAdorableMaldición gave me the role of a lifetime. https://t.co/CJ8nADK5jc #Mennonite #cheesemerchant #ConanMexico My #ConanMexico crew &amp; I are taking your questions &amp; debuting web extras live on @YouTube. Plus, me without makeup. https://t.co/2yHjmAOjLQ Thanks to @CassandroLucha for making me a luchador and not being afraid to hit a baby. https://t.co/VyZHPSKqs7 #ConanMexico Thank you to the good people of Mexico for making #ConanMexico my favorite travel special yet. Watch tonight @ 10/9c on @TBSNetwork. I’m doing a @Reddit AMA about #ConanMexico at 11am PT. Ask me anything. https://t.co/iUaN7D5hgF https://t.co/ywr9teL1hT Here's a sneak peek at tonight's #ConanMexico cold open. Tune in @ 10/9c on @TBSNetwork. https://t.co/cXQ5gSFA2K .@realDonaldTrump if you are thinking of mentioning Mexico in your speech tonight, maybe you should check this out first. #ConanMexico https://t.co/7WrrNd2ZSx I recently spoke with @JorgeRamosnews about #ConanMexico and the proper way to eat a taco. https://t.co/lC8hxXjBvl I just noticed Amazon has reclassified George Orwell’s “1984” under the category of Lighthearted Romps. Muchas gracias to my Mexican &amp; American crew. #ConanMexico was possible because of you fine people. Airing worldwide 3/1 ¡Viva México! https://t.co/D01Gmov9gc I tried my best to get Mexicans to pay for @realDonaldTrump's wall — not as easy as I thought it would be. https://t.co/I8NIHc8TX0 Waiting in customs at the airport in Mexico. Getting a lot of compliments on my pin. #ConanMexico https://t.co/yWwxrrBsGC .@realDonaldTrump, I’m in Mexico City shooting a show. Do you have a message for the Mexican people? They’re eager to hear from you. Had a dental emergency but I was saved by Dr. Boris Schwartzman, the best #dentist in #MexicoCity. Gracias, Boris! #ConanMexico https://t.co/A8EewasZfj I ran into super fan Cecilia, who made this amazing Chip Whitley shirt! Cc:@voguemagazine. #ConanMexico #Fashion https://t.co/ykRNKuJ4p9 Today I played #fútbol with superstar @OficialGio. Here's my signature move: \"Running with Limp Hands.\" #ConanMexico https://t.co/TWICSS8Dxg ¡Feliz Cumpleaños Marisol! It was an honor to be your Godfather tonight. You were the most elegant Quinceañera! #ConanMexico https://t.co/K7dNlFJHZ6 Follow @teamcoco on #Snapchat to get an inside look at my #Televisa studio. #ConanMexico https://t.co/mYranGIe2Y Amazing first day in #México. I made a lot of friends. #ConanMexico https://t.co/wGUPfgoscl Here at one of the world's largest squares aka el zócalo. #ConanMexico https://t.co/ZrZQp212mi That's right, this guy is wearing a #Trump hat in the customs line at the Mexico City airport. That takes \"huevos.\" #ConanMexico https://t.co/lyM7I4YTbJ Hola, Mexico! https://t.co/godfy6R4Vz ¿Qué debo preguntar a mis invitados @diegoluna_ y @VicenteFoxQue? #ConanMexico https://t.co/FDUyvnauWI ¿Que debo comer en la ciudad de México? #ConanMexico https://t.co/olzyvj6u3T ¿A donde debo ir en la Ciudad de México? #ConanMexico https://t.co/bYMe3a5coj My accountant just called to inform me I’m morally bankrupt. Saw this photo from yesterday's protest in Mexico. I hope this isn't an effigy of me. https://t.co/4TrspAkM4E #ConanMexico https://t.co/tY8ZmOIPb6 I have the most creative fans in the world. And I want them to be a part of #ConanMexico. Learn more @ https://t.co/aCzbWkm1n4 https://t.co/P34xJVydWx In honor of Black History Month, Trump tried to have dinner with Jack Black. Remember when the President of the United States was smarter and more even-tempered than you? I can't imagine Donald Trump laughing.  Except maybe at a forest fire. Just saw @LEGOBatmanMovie.  If you can guess which villain I voice, you win nothing. https://t.co/KGAFIvwTjL Steve Bannon is \"college educated Jabba the Hutt.” Every time Trump signs something, I think of how that pen he's using once dreamed of a better life: writing poetry, scratching butts, etc. America’s new daily routine: check news, change pants. .@diegoluna_ Great! I am also interested in meeting some very cool bad mujeres!! .@VicenteFoxQue @diegoluna_ ¡Estoy anticipando nuestra conversacion en México! Espero que después me permitan volver a los Estados Unidos. .@VicenteFoxQue @diegoluna_ Excited to talk with you in Mexico. Hope afterwards I’ll be allowed back into the United States. Excited to announce that @DiegoLuna_ and @VicenteFoxQue will be my guests for #ConanMexico. https://t.co/mgLbM9dv6r The news is currently that spinning image of a newspaper, but it never stops spinning. Anybody else have “war with Australia” in the office pool? I was never worried. Winner of the #SuperBowl #CluelessGamer has gone on to win the big game THREE years in a row. https://t.co/9cjcK3CZBo https://t.co/MokG1leh82 PRO TIP: The bottom layer of my Super Bowl Party 7-layer dip is “mild ennui.” Tom Brady joined me for this year's #SuperBowl #CluelessGamer and I only shit my pants a little bit. https://t.co/9cjcK3CZBo #ForHonor By the time I tweet this, the thing I was outraged about will be the thing I’m second-most outraged about. Sometimes I hear voices.  Usually when I hide in your front closet and wait a while. A video game is the one place where I can physically overpower Tom Brady. https://t.co/9cjcK3CZBo #SuperBowl #CluelessGamer #ForHonor Before they battle in Sunday's #SuperBowl, Tom Brady and @DwightFreeney battle #ForHonor in #CluelessGamer. https://t.co/9cjcK3CZBo Tonight! #ForHonor #CluelessGamer with a mere 5 #NFL superstars. #SuperBowl https://t.co/arD23Z5MA4 A famous building in San Francisco used for making porn is closing.  Man, if those walls could moan. Here's a sneak preview of tonight’s #CluelessGamer featuring #Superbowl rivals Tom Brady and @DwightFreeney. Watch @ 11/10c on @TBSNetwork. https://t.co/UNvKwoYNPX Excited to have @ErinAndrews join us for #CluelessGamer. Here I am clarifying which one of us is Erin Andrews. #SuperBowl #ForHonor https://t.co/grH9b8FPwe The most underappreciated job in the White House is the assistant who reminds Mike Pence to blink. RT @DangeRussWilson: Had a blast stopping by @ConanOBrien today. Hooked him up with the first ever Social Autograph on a @Surface #Microsof… New #ForHonor #CluelessGamer this Thursday with Tom Brady, @RobGronkowski, @DwightFreeney, @LG_Blount, @MoneyLynch &amp; @ErinAndrews. https://t.co/4NBYf7S7Cu An estimated 10,000 people protested Trump's Muslim ban at LAX. It’s LA, so it was a mix of Muslims &amp; people who can “play” Muslim Just shot an intense #CluelessGamer w/Tom Brady, @DwightFreeney &amp; a slew of NFL stars. The #biggame has been decided. Watch it Thursday. https://t.co/ASkr0F3yU6 One upside to a Trump presidency is we’re going to be in great shape from all this marching. What’s Spanish for “Don’t worry, amigo, he’s full of shit?” Kim Jong Un wants to meet with President Trump. I smell a buddy movie! If any of you see XXX: Return of Xander Cage this weekend, could you let me know if it’s as good as the novel? I’m heading to Mexico City to repair US-Mexican relations. https://t.co/bYIsoDaGAj #ConanMexico If Trump builds the wall, isn’t that going to trap the 3 million people who voted illegally inside the US? When I die, I want to be buried with my boots on. Specifically, my black Prada Saffiano Leather Plain-Toes. I sent @TriumphICDHQ to President Trump's Inauguration to give the event the dignity it deserved. https://t.co/6RC9mffq3u A lot of job loss is attributed to automation. In fact, today I fired my writers because for the next 4 years, jokes will write themselves. You can really sense the unease in America. No wait I’m just on a moving walkway in an airport. When you march the streets shouting with people it’s civil disobedience, but do it drunk by yourself &amp; it’s an involuntary 72-hour hold I dreamed I was driving 100 mph on the freeway and when I woke up I was driving 100 mph on the freeway. Donald Trump’s inauguration is expected to be the most costly in US history.  And that’s not even factoring in the money. The only thing we have to fear is Gerald Fear, of Sheboygan, Wisconsin. He is a serial killer. “I don’t believe in limits” is a less inspiring creed when shouted shirtless to a highway patrolman who’s just pulled you over. If we all pitch in, we can fund the removal of that little Eddie Munster-ish v-shaped hair thing on Paul Ryan’s forehead. If an asteroid hit the earth right now, I think a lot of us would just shrug. Reminder to my massage therapists: the less you giggle the more I tip. Bachelorette party planners: make sure to buy chocolate penises with at least 65% cocoa if you want the antioxidant benefits. Except for my tendency to screech at flying sparks, I would have made an excellent blacksmith. The only time I regret having 3 cats is fairly often. Doctor says my testosterone levels are normal. So why did I just spend 3 hours on Pinterest looking at kilims? If only there was another way to be a philanthropist. An old friend sent me this photo. If I remember correctly, we stole those plastic hats from tiny strippers. https://t.co/gyt9qNbGgb I know you’re not supposed to yell “Fire” in a theater, but since when am I not supposed to yell “Pooty Tang?” I prefer farm-to-sink, because that’s where I’m standing when I eat most of my meals. Inspired by La La Land, I just sang and danced my way into a divorce. If Twitter goes down, American foreign policy will have to rely on skywriting. I’ve just been booked for Chinese New Year’s Rockin’ Eve! This time of year reminds me of that sweet day in my childhood when my uncles took me skiing. https://t.co/06T8bIe2sT How much lingerie should I buy my therapist to prove to her that I don’t have boundary issues? I don’t make New Year’s Resolutions, I make New Year’s Vague Declarations Of Semi-Intent. Feels right to ring in the New Year with a 12-foot high gingerbread AT-AT #happynewyear https://t.co/DEB1MSiUBE The bowl names are getting more corporate and obscure, I thought to myself, while watching the Aveeno Therapeutic Shave Gel Bowl. Let’s build a time machine and Make 2016 Great Again. This Friday, my friend @RondaRousey is back in #UFC207. A mere appetizer\nbefore her fiercest challenge: https://t.co/rWKW53r1rA Carrie Fisher was funny and fearless and unabashedly human.  It's an old saying, but she was a real trouper. https://t.co/fTlfBSfaQg Prediction: Before he takes the oath of office, Trump will ask us all to sign a prenup. What a holiday treat — they’re offering free egg nog samples in this Chevron station men’s room. How do I handle this? I got a coupon for a back rub from my gardener. Santa knows if I’ve been bad or good, so he and my browser history have a lot in common. ‘twas the night before Christmas, and all through the house, not a creature was stirring. Thank you, Terminix! Found this photo in my childhood home.  Ten minutes later, I adopted the hairstyle that would rocket me to international mid-level fame. https://t.co/UXH6ZqJBe9 Neil deGrasse Tyson: The effects of altering the Space-time continuum are unknowable.\n\nMe: I hate watching “It’s A Wonderful Life” with you. I love crossing names off my Christmas shopping list because they’re no longer speaking to me. I’m such a Secret Santa that you won’t even know if I got you anything. Just ran into the two gentlemen who arrested me in '09 for stealing a police horse. #HappyHolidays to #Boston's Finest. https://t.co/6LZzoLiKlU .@StephenAtHome That's sweet, but those signs were hand painted by George W. Bush and NOT to be taken. Return immediately. #willprosecute At my parents' home in Brookline, MA and they have this ornament on the tree from '93. #HappyHolidays https://t.co/y8fyg3DfxR Life hack: If you run out of breadcrumbs for a recipe, turn your computer keyboard over and shake it. The greatest trick the Devil ever pulled was convincing the world he didn't exist. The worst trick he pulled was that “Got your nose” thing. Ear buds were almost called lobe chums. I’m going to say we’re 10 months away from a “Real White House Wives of DC” show. 'Tis the season for weird guys to go into Brookstone, use all the massagers, then leave without buying anything. I was so hoping that Natalie Portman’s biopic “Jackie” was about Jackie Chan. How many licks does it take to get to the center of an outdated TV commercial reference? I don’t bring it up a lot, but if you just count the electoral votes, I won “The Voice” last season. According to the 25th Amendment, if the President is incapacitated, the Vice President becomes the executive producer of “The Apprentice.” When it comes to kids' hats, Norway wins. https://t.co/1TIuncH89Z My dressing room in #Oslo. This is both a lamp and a form of birth control. https://t.co/97JJKzfUVZ A video game is the only place where @TerryCrews and I are equally effective in war. https://t.co/dseW9Urwyy #CluelessGamer #Battlefield 1 Thanks to Donald Trump, coal is coming back to our stockings. A highlight from #ConanBerlin was @Flula teaching me a drinking song that translates to \"1 More Will Fit Inside You\" https://t.co/Pi1vcnaPfn I visited a professional dominatrix in #ConanBerlin. My nipples still haven't forgiven me. https://t.co/7ILUNmar98 #ConanBerlin airs tonight at 10/9c on @TBSNetwork. It’s the international incident we've all been dreading. I’m live on @YouTube with @Flula Borg answering all #ConanBerlin questions in a precise and orderly fashion. https://t.co/eVoPnrXIoX Every year I ask for “World Peace” and I never get it, so fuck it, I want wireless headphones! This holiday season, give the gift that says “Here is your gift.” Give a candle. I walked 5K today for no reason or cause and now I feel like a selfish prick. Call me old-fashioned, but I still prefer the original mannequin challenge: 24 hours in the window of a Sears without alerting security. Update on my neighbor: The pilgrim hat on the decaying Jack O’Lantern has been replaced with a Santa hat Wow, the Cleveland Browns are 0-12. On the bright side, they're still leading in the popular vote. It could be worse: Trump could be Instagramming his lunch at 3am. Just 26 more shopping days until Jimmy Buffett's birthday. I’m just like you. I get up and put on my pants two legs inside the same leg, collapse to the ground, and scream for my manservant Mr. Moto. Can anyone recommend a good video game that requires zero skill and is just a yo-yo? Hey America: u up? This Black Friday, I’m choosing small local businesses for my frenzied, materialistic rampage. Just said “Can you please pass the gravy?” My uncle responded “Socialist!” Is it me or does the white meat seem particularly angry this Thanksgiving? Tried to pardon my turkey and he sued me for wrongful imprisonment and defamation. I'd like to go a whole day without hearing the terms \"Orwellian\" or \"Kafka-esque.\" I'd be flattered, if the category hadn't been \"Famous and Damaged\" https://t.co/IQG4oeYVYB Just looked at the holiday edition of Oprah's Favorite Things. #26 is the rare earth element promethium. I'm at Trump Tower, about to meet about a cabinet position. Sitting between Dustin Diamond and a guy that can swallow 50 eggs. If it’s any consolation to Mike Pence, I was once bitterly harangued by the cast of “Annie.\" This is exactly what VR technology was not made for. Thanks @YouTube. https://t.co/1bmUcVWOya This is the first President in American history that might egg my house. I've known @AdamSandler for years and can proudly say this might be his stupidest song yet. https://t.co/RahgRzcLD4 #HereComesTheFunnyTour The McDonald’s McRib is back, and there’s now an app that helps you find one. It’s called Fattr. I judge a good pair of yoga pants by the number of hip and ankle flask pockets. Love means never having to say “I’m sorry I left the money in Bogota. I had no idea Jaime was going to get decapitated at the dead drop.” Watch @ElijahWood and I play #FFXV while waiting for death in real time. #CluelessGamer https://t.co/AGe91ZScy9 This Thanksgiving for the first time ever, your drunk uncle will seem quite “presidential.” Tonight's supermoon will be the largest in 86 years. So don’t forget to glance up &amp; nod vaguely before moving on with your life. #supermoon Started my day the same way I have every day since the election: By looking out my window to make sure America’s not on fire. Viral cat videos - America has never needed you more. Haven't seen this much warmth since Lord Voldemort shook hands with Bill Belichick. https://t.co/vaiP4ZsBsT Tonight I started my show with a few words about the election https://t.co/Gw22eK7VcW Congratulations to the winner of the 2016 presidential election.  You’ll be receiving the cleaning bill for America’s pants. I had six stiff drinks and then voted. #RockTheVote https://t.co/0EOcZPSCsC Not telling you who to vote for but ask yourself: which candidate will give a more entertaining concession speech? Tomorrow, we Americans will make history by electing our 48th white male Vice President in a row. (The previous record was 47). I’m waiting for them to invent a pleasure robot that’s so lifelike, it won’t have sex with me. Be wary of a guy or girl who wants to be “Friends with Dental Benefits.” NYT says elevator “door close” buttons don’t work &amp; are there to give a false sense of control. In a related story, my life has been a lie. Yes, @vancityreynolds did tell my mouth a secret, and that secret was \"You are so much hotter than @RealHughJackman\" https://t.co/h01w3UO5A7 It was an honor to sign the backstage wall at the @ApolloTheater. I wrote my name over President Obama's. #ConanNYC https://t.co/S8HoSgPZn5 I’m so happy to be back on stage with my friend @RealTracyMorgan. #ConanNYC https://t.co/3pP3IcJtEm I’d expected some things in New York to have changed, but this bike lane running through my hotel room feels a tad unnecessary. Just did the @ohhelloshow with @mulaney and @nickkroll. Seen the show twice and it's so funny it angers me. https://t.co/Efd6vkaZwp I kissed Ryan Reynolds deeply in \"The Notebook 2\" #ConanNYC #semiwood https://t.co/IsMEhn7jLa Now that Uber is so popular in NYC, the only remaining taxi cabs are being driven by stray dogs. @HillaryClinton She's right, Louis. I make my staff call me the same thing. Alvin Ailey American Dance Theater allowed me to sit in on a class. It went as well as you might think. #ConanNYC https://t.co/k5T3LmzrJj I thought I'd heard every take on the election, until Louis C.K. said this https://t.co/QuHNwopMCJ The always brilliant Louis C.K. is on my show tonight. No one makes me laugh like him. #ConanNYC https://t.co/uoYKczAJQn Thanks to @FallonTonight for buying us all lunch from @ShakeShack today. I'm assuming this is both vegan &amp; lactose free. #ConanNYC https://t.co/cusq1O3Sed I love visiting NYC because it’s the only time I can enjoy the smell of hot pretzels without worrying that it’s an aneurysm. I'm calling Harlem home for the next week. Here’s what happened when I introduced myself to the neighbors. #ConanNYC https://t.co/JyFtodGIkb Tonight @nottjmiller and I get weird at The @ApolloTheater. #ConanNYC https://t.co/2vtsQdlEBc My friend Greg Daniels and I produced #PeopleofEarth for TBS. Check out the 2 episode premiere tonight @ 9/8c before #ConanNYC. Just trick or treated at Trump headquarters. Raisins! You believe that? My week of shows from Harlem's world famous Apollo Theater begins tonight. Score free tickets on Snapchat. #ConanNYC https://t.co/4hKhM434xd View from my desk at the Apollo. My guitar is not impressed. https://t.co/HY37iNi73K On 112th St in NYC: Best Halloween Costume Ever. https://t.co/Z3unHManVW This year I’m giving out a Halloween treat every child loves: some stern advice. If you'd like to meet me, for the next 72 hours I'll be standing next to the last working… https://t.co/FdBwsmiqvO Just arrived in #NYC for my shows at #TheApollo. Wishing I hadn't packed three typewriters. https://t.co/Uj1LcCUGCR Every morning, I do 100 pushups and 300 crunches, then follow it up with 2 huge lies about my morning routine. Hey Andy, it's me, your ol' pal Conan, wishing you a happy birthday! I'm that fidgety guy that sits to your left. https://t.co/afgR0jrNES It’s weird that my therapy dog has no interest in hearing about my childhood. People who are excited to have our first female president haven’t noticed how fake Rutherford B. Hayes’ beard was. A woman is suing KFC for $20 mill after getting a bucket of chicken she said was half empty.  KFC is countersuing her for being a pessimist Beat the traffic and #GoVote now! Find out more about early voting from @HeadCountOrg here: https://t.co/ll6RxGA1zm https://t.co/uXsVw1OuXv I can’t wait ‘til November 9th when we can go back to focusing on Kim and Kanye. Just got an offer from Wells Fargo to open a checking account for this bowl of minestrone. Just got my testosterone results back from my physical.  The results are clearly rigged. I want the Cubs to break the curse, but I want it to be the Curse of Tutankhamun. My good friend &amp; comedy genius Robert Smigel just lost his father. My show &amp; I mourn the loss of this special man. https://t.co/TIL6aUjY4f I will only have sex with the lights out, the music on, and nobody else in the room. One time I wore my brother's t-shirt, and my dad asked if I was dressing up as his favorite child for Halloween. My best chance of catching up on all the great TV shows is a non-fatal skiing accident. The Peanuts Halloween special is adorable, right up until the point when the Great Pumpkin orders Linus to kill. I'm glad Bob Dylan got the Nobel Prize in Literature, but apparently the committee didn't see my searing tweet last month about Craisins. Moneysaver: Any swing is a sex swing if you have sex in it. I don’t want to toot my own horn, so I pay a visiting foreign student named Raf to do it for me. My only worry about a President Trump is that he’ll use his bad for evil. Once again, the Department of the Interior has turned down my petition to get “Sexy Ginger Dad” put on the Endangered Species List. Visit https://t.co/dijqtd60YL to help honor my friend Robin Williams' passion for cycling and giving. https://t.co/aL65jrHx9Z We all make fun of it, but how creepy would it be if we suddenly STOPPED getting e-mails from LinkedIn? Welcome to my favorite #restaurant in New York. #ConanNYC #NYC https://t.co/9ZZaBSdXuI Took a class at the Alvin Ailey American Dance Theater today. Check out my new dance, \"The Iron… https://t.co/r3pqnECgpb This election has me like INSERT GIF. Got a new hairstyle today thanks to 30 West African women. #ConanNYC @ New York City, Harlem https://t.co/1nTfL5OYyj My wife reported a creepy clown sighting in our bedroom but I was in there and I didn’t see anything. This latest Trump scandal reminds me of the time I thought my mic was off and said “I kinda like pears.” Thank you @janson_chris and fenderbilly for this incredible custom #Fender Paramount acoustic… https://t.co/E06CPzsMmp Fairy Tale Trivia: The wolf in 3 Little Pigs and the wolf in Red Riding Hood were roommates at UC Santa Cruz. Will this be the year I look up the rules for lacrosse? I'll never forget the memories @WizKhalifa and I shared playing #GearsofWar. Or maybe I will. #CluelessGamer https://t.co/vLy7b104Au Personally, I can’t wait for the presidential election of 2020 between Laura Bush and The Situation. I really enjoyed playing #GearsofWar4 with @WizKhalifa, and not just because of the delicious potato salad we shared https://t.co/vLy7b104Au When people ask if the carpet matches the drapes, I say it’s all hardwood, baby. Or maybe laminate? I’ll put you in touch with my designer. The pain of childbirth is nothing compared to the pain of not getting recognized at Target. Hey, @DavidOrtiz, love my new shirt benefitting @DavidOrtizFund. Get your shirt today: https://t.co/8SX3o34VtO #MakePapiProud https://t.co/BJTT9QGicY Are you allowed to drive in the carpool lane if you’re riding with the voice of your disapproving father? If the Founding Fathers were alive today, they'd probably win Dancing with the Stars.  Those gentlemen were quite agile. “Stranger Things” captures the 80s so well, there’s even a scene of me not getting laid in college. Trump’s “Make America Great Again” hats are truly terrible, but they aren’t worse than Woodrow Wilson’s “Our Nation Could Be Nifty” scarves. .@KevinHart4Real thinks I have the body of Dutch woman. Watch as I prove him wrong. https://t.co/IyIefgTXuk I think it’s disgusting that my writers charge me more for Epipen jokes. I went toe-toe-toe with @KevinHart4Real at the gym. He might have the\nmuscle but I've got the reach. #WhatNow https://t.co/IyIefgCmCM I’m with Trump--I blame every bad show on my microphone. Great, yet another drive-in movie ruined by the neighbors saying I can't park on their lawn and watch movies through the living room window. I’m at the age where all my tweets start with the phrase “I’m at the age where.” Need to register to vote? Text “COUNT” to 384-387 or register to vote here: https://t.co/DvyBg0U9OX with @HeadCountOrg #VoterRegistrationDay https://t.co/Jv6v8S1nL0 Stop scrolling through Twitter for a minute and 34 seconds and register to vote. https://t.co/x2MBTnPHQz #voteIRL At a restaurant, sitting one table away from VP candidate Mike Pence. Wait, no, sorry that’s just a white napkin. Don’t mean to brag, but today Fitbit said I took 10,000 steps to avoid hearing about other people’s dreams. I would get scrotox for my scrotum, but I’m afraid of scrotulism. Obviously. #ThreeFictionalCharacters https://t.co/Na1opiXcD9 The name \"Brangelina\" is now freed up for Oscar Brange and Lina Abramowitz. Conangelina. Donald Trump has pledged to create 25 million new jobs. All of them in the profession of fact-checking. Finally saw Silence of the Lambs.  Not that funny. When I'm on the freeway I can't help but honk at the a-holes who don't like my violent, unpredictable driving. I'm a compromise conspiracy theorist.  I believe Neil Armstrong walked on the moon and Buzz Aldrin didn't. There are literally no words for how vibrantly prismatic I find the technicolor hues of a rainbow. Right before I die, if my life flashes before my eyes, I hope there aren't 30 second ads before each section. There’s no freude like Schadenfreude. Please come to dinner with Timothy Olyphant and me. Don’t leave me alone with that man. https://t.co/Y6YjniZequ I’m hate-living. The Presidential Debate moderators have been announced.  Congratulations to Lester Holt, Anderson Cooper, and Cee-Lo. One day my grandchildren are going to ask me, \"Grampa... what did you do during the Labor Day Mattress Sale Wars of '16?\" I love autumn in California… watching the leaves change color because they’re on fire. Just landed in LA. I made so many friends in Berlin that I mastered the language. #ConanBerlin @… https://t.co/AbU58xe5DX I’m at the Costco here in Germany buying my Kaiser rolls in bulk. About to perform with the band @Sado_Opera. No, this is not a Renaissance painting. #ConanBerlin… https://t.co/fulqBUyiFN Just made friends with refugees at Tempelhof Airport in Berlin. Gentlemen, we have our album… https://t.co/nVrDx318l8 If you scream in fake German for 30 seconds, at least one of those made up words will be the name of a German pastry  #Käsekuchen .andyrichter agrees that this East German Trabant, which runs on walnut shells, puts my '92 Ford… https://t.co/lBXXCoOBVO .@Flula &amp; I visited a nude beach just outside Berlin. I am unhappy. #ConanBerlin @ Berlin, Germany https://t.co/qMD72bDQeP I'm in Berlin to see the sights and catch some Pokemann. Hanging at the remnants of the Berlin Wall. #ConanBerlin #Germany @ The Wall Of Berlin https://t.co/NQd6dWfulN Flula showed me #Berlin on a bicycle built for two. I am happy. @Flula is ecstatic. #ConanBerlin… https://t.co/6FjNz3NsuX .andyrichter &amp; I learned the traditional Schuhplattler dance. There were no survivors.… https://t.co/zXbEN60uQ5 About to drive extremely fast on the Autobahn just as soon as I figure out how to close the… https://t.co/sPjR9SFaDm Today I make my german soap opera debut on #GZSZ. Or maybe this is a restaurant. #ConanBerlin @… https://t.co/MjoXQMVro2 Follow my trip to Berlin on Team Coco's Snapchat: https://t.co/4hKhM4kFoL. I definitely know what Snapchat is. #ConanBerlin Grabbing lunch with @Flula in #Berlin. He is very enthusiastic. #ConanBerlin @ Hofbräuhaus… https://t.co/n2TWfePvQ8 Just made authentic #bratwurst with a mad genius. #ConanBerlin @ Blutwurstmanufaktur https://t.co/iHPdrmIPdn No one, except my dermatologist, can prove this is me. #ConanBerlin https://t.co/Xt3NCBS7iI Five minutes at a #Berlin flea market and I fit right in. #ConanBerlin @ Flohmarkt am Mauerpark https://t.co/gOx5ewwsYb Just arrived in #Berlin. Standing in front of my #Airbnb. #ConanBerlin https://t.co/tPcnw2GHzn I always keep a giant-brimmed ladies’ hat ready, in case I ever need to sit in back of an auction house &amp; mysteriously place a winning bid I'm going to #Berlin and I'm taking my #Instagram account with me. #ConanBerlin #Germany https://t.co/OTmHPUXKW2 Last night I was visited by a ghost who claimed he had \"unfinished business.\" Turns out he just needed something notarized. Reunited with my old pal #SamueltheOctopus. #bestfriends #korea https://t.co/lCDNauy2OY Now HERE’S a face you want to sit down and do business with! https://t.co/9T44o4D8gS It was a true honor to talk to Gene Wilder. He was an unusually brilliant and sweet comic artist. https://t.co/YGcqUt8vUL I suppose a burktini is completely out of the question. Am I too late for a Matthew McConaughey “alt-right, alt-right, alt-right” tweet? Now that the Olympics are over, I can get back to comparing my body to the athletes on World Series of Poker. The days are getting shorter, but do they have to compensate by acting like assholes? I’m down to 1%, but that should be just enough to finish this twe Kids today learn about sex and Alexander Hamilton much sooner than I did. My wig, prosthetics, &amp; makeup artist cost $2,000, but with them I can roam the Pasadena Flea Market undisturbed, looking for porcelain hands I don’t take my career for granted, which is why every April I renew my commercial crab fisherman’s license. Upon death, instead of having my whole life flash before my eyes, I just want to watch Season 3 of The Sopranos again I love waking up to the sound of birds arguing with their spouses. Only three people on the entire planet have ever said: “Hold my Olympic medal while I trash this Brazilian gas station.” Lochte, Lochte, Pants on Fochte! Turns out the proper response to “How’s it hanging?” is NOT “via a complex network of pulleys and trusses.” My stream of consciousness puts James Joyce to needlenose pliers. Would it be obnoxious if I held a press conference just to say “I’m havin’ a bitchin’ summer”? If you wear a visor for longer than 3 minutes, you’re legally required to change your name to Trey. Never tell a newly divorced masseuse to “take your anger out on my shoulders.” Summer vacation is my only chance to get away from it all and just tweet. Fiji and I used to have the same number of Olympic gold medals. Touché, Fiji. This summer I’m going to work on my memoirs: “The Fire Crotch Chronicles.” If the object of tennis is to hit the ball into the net and swear a lot, I’m very, very good. Did it hurt when you fell from heaven? Anyway, I think you fractured my clavicle and I am going to sue. Ah, the dog days of summer. These are truly my salad days. Sunday, Monday, Happy Days. Happy Dog Salad. Ok I’m drunk. I know it's wrong to generalize, but I just don't like murderers. This is right around the time of year I start calling my shorts “The Chafing Dish.” Given current weather trends, a Sharknado is a distinct possibility. I always bring my baseball glove to the ballpark, just in case a falcon wants to land on my hand. I am devastated by the passing of Suzanne Wright. She and her husband Bob tirelessly nurtured my career and family. This is a terrible loss. My accountant informs me that I’ve never been retweeted by @Cher Had a dream where evil space creatures intent on destroying humankind land, watch us for a few days, shrug, then take off. A long time ago in a galaxy far, far away, dudes wore vests. My parents won't say which of their six kids they love the best, but they have told me I finished just out of the top five. I’ve got good news and bad news. The good news is that I’ve got great news. The bad news is that I don’t know what adjectives are. Thank you,  #SDCC. Much like The Death of Superman, this will be my final appearance ever and I'll be back again next year!  #ConanCon Without my makeup &amp; the Lord of Light, I just don't look my best. #ConanCon #GameOfThrones https://t.co/99v3gWUMDh Missing @GameOfThrones on Sunday night? I've got the cast and plenty of blood on a special #ConanCon episode tonight at 11 on @TBSNetwork Just saw Aquaman eating a fish filet sandwich while sitting on a fire hydrant. #SDCC #ConanCon A true #American hero. #SDCC #ConanCon https://t.co/QA8s7o7ZCv I'm producing a new show, #PeopleOfEarth. The cast has the warm smiles of\npeople being forced to pose with the boss. https://t.co/GvGYsGBWx6 I’m at #SDCC, and I’ve been waiting 14 hours in a line for a panel on “Life is Short, Don’t Throw It Away.” #ConanCon I got an incredible superhero costume from the man who put nipples on Batman. #ConanCon https://t.co/rLhY8l1pHx For me, cosplay is a spray-tan. #SDCC #ConanCon It's the fight of the century: me battling @AndyRichter to kick off #ConanCon https://t.co/js19ZUvQ4d #SDCC2016 Tough call: between RenFaire and #SDCC, which has more codpieces? #ConanCon Hey #SDCC be sure to follow @teamcoco on #snapchat for a chance to win tickets to my shows all week from #ComicCon. https://t.co/7gos6ZYosu Pokemon Go + Comic-Con = The Nerd Universe Collapsing In On Itself. #SDCC #ConanCon I know Stan Lee loves making unexpected cameos, but I was pretty surprised to find him in my shower this morning #SDCC At drive-thrus, I order in a British accent but pay in a French accent. Someday they’ll ask “Where's the British guy?” but so far not yet. They say the Verizon guy switched to Sprint but if you watch the commercial he mouths the words: “Verizon, I’m sorry, they have my family.” Due to Zika concerns, I’m reluctantly draining my moat. I can’t wait to see the pictures that Jupiter doesn’t want released. Getting asked to be Trump’s running mate is the new jury duty. This tweet is just a humblebrag that I can spell “cantaloupe.” Mansplaining to this officer why I shouldn’t get a parking ticket. She’s copsplaining that I’m getting one anyway. Fears of the Zika virus will probably keep me from watching the Olympic men’s tennis doubles. Everyone loves the “poop emoji,” but I’m telling you, beneath that smile there are worlds of pain. 2016 Trump/Newt sounds like a car that’s about to be recalled. I’m starting to regret having Bill Clinton and Loretta Lynch over for lunch. Hey Conan here, with some 4th of July grilling tips. Only hire a caterer you trust. Ok enjoy the holiday! At Costco, standing in the 10 Grills or Less line. To my fellow hikers: that noise I made when the butterfly came toward my face was a terrified shriek of delight. Scotty Moore changed the world with 6 strings that cost less than $1. He combined true genius with real humility. https://t.co/UUh8AXhUvz Can someone please pass the ketchup? (one of my 21 million followers HAS to be in this diner) I had a parrot named Brexit who died last year. His last words were, “My passing will cause a worldwide sell-off.” #spooky #weird Still not sure why, at the end of my appointment, the proctologist gave me a new toothbrush. I just got body-shamed by my jeans. Really looking forward to the new Disneyland they’re building on that island of plastic bottles in the Pacific. Scientists have discovered that people who forgive tend to be healthier than people who don’t. This changes nothing for us, @SteveMartinToGo Twitter announced they will let advertisers target users based on the emojis they tweet. Bring it on, poop companies. If Calvin Harris can’t make it work with Taylor Swift, what hope do any of us chiseled, 6’6” DJs have? Until Mexico has White Walkers, I don’t think we need a wall. People in Cleveland haven’t been this happy since…wait, this is the first time they’re happy. To the Dads out there: today and all days, may your Dockers be wrinkle-free. “Only one more game. Thank God.” – Steph Curry’s mouthguard I don't know that much about professional basketball, but I know this: it's going to be the Cavs in 8. Waiting at the vet’s office for my dog to get his shots. Might let the guy in the beard of wasps go ahead of me. Donald Trump is the living embodiment of an erection that lasts more than four hours. Let’s get one thing clear: I never joined HYDRA. They held a “free” buffet at my hotel and they made us watch a video but I never signed up. Success is 50% inspiration, 50% perspiration, and 50% THE SECRET PERCENTAGE INCREASER MACHINE. I can’t wait to see Hamilton when it comes to Los Angeles, with Young MC. Hey, sometimes your stream just bifurcates  #MalePeeTalk I wish I had a 3D print of my regrets. This woman patiently explained that I cannot #vote for #Trump in a Democratic Primary. https://t.co/i7aPnckEYa I think my Fitbit is just trying to make me feel good. Buying a decorative gourd is like saying, “Here, let me throw that out for you in four months.” The Taliban’s new leader is said to be “low-key.” Which explains the Taliban’s new video, “Death to Whatevs!” It’s tough this year.  I’m worried Hillary’s a liar, and I’m worried Trump’s not. I watch RuPaul’s Drag Race to learn how to unhook a bra. Hey NYC, the profound documentary @thewitnessfilm is opening at @ifccenter tomorrow. Do not miss it! Link to tickets https://t.co/RgHBRnjTJn Is it weird that my wife will only have sex if I Face Swap with her personal trainer? Have been trying an all-juice diet, and check this out – me, one hour ago! https://t.co/BfV7EOqSHK So if I don't get caught it's a \"free sample\" and if I do get caught it's \"stolen property, please come with me, sir\"? Real double standard. I've noticed that men who tell women to \"smile more\" rarely comply when politely asked to \"exist less.\" The best assemble-yourself furniture comes with a few spare screws, spare bolts, and a pint of O-positive blood. We should probably operate as if God stepped out for a bit and left us in charge – but he’ll be back in August. My neighbor is blasting his meditation music, but every time I go over to say something I’m filled with a deep sense of peace. Right now someone at DC Comics is saying, “Crap, we’re really going to have to go through with this Aqua-Man movie, aren’t we?” I hate it when adults try to relate to youth using slang. Guess that’s what makes me a woke bae. I play @GameOfThrones' Peter Dinklage &amp; @IAmLenaHeadey in #Overwatch on #CluelessGamer. I fight for House Masshole! https://t.co/aG2sHpaNvi Confession: At Starbucks this morning, I stole a latte that belonged to some guy named “Conin.” Open Tweet  to Justin Bieber: You’re starting to make us teen heartthrobs look bad. I just learned my intervention is going to be “Town Hall format.” To avoid all this bathroom controversy, I’ve just been going in the woods. I'm a Mohave fringe-toed lizard in the streets but a Colorado Desert fringe-toed lizard in the sheets. Desiigner is both my favorite rapper and my favorite typo. The only bathroom law I’m interested in is one that bans loud sighing. Okay fine, I admit it: I’m the “Becky” in the new Radiohead album. I'm doing a week of shows at the legendary @apollotheater October 31st. Finally some soul in… https://t.co/KSPXaJtLU0 Now that Castle is off the air the best flirty dialogue on TV is between @AndyRichter and me. Is there a website where we can auction off George Zimmerman to a passing comet? My Donald Trump tax jokes are none of your business. I consider a hostile work environment any office that has a Karaoke Night. My Friday ritual: getting a wisdom tooth extracted and drinking an #InNOut shake. https://t.co/BnxVEjldfH Does day-drinking count as civil disobedience? This X-ray of my wisdom tooth pushing into my infected jaw is the latest\nexample of how my art… https://t.co/Qr617U4MCU This morning I thought I was filled with a childlike sense of wonder, but it was just a norovirus. Time to fulfill my dream of marketing my own line of artisanal antifreeze. I'm half asleep, totally naked, and waiting for the light at this intersection to change. Don’t keep your spice rack too close to the oven because it will dry out the herbs. Sorry, that was for my other account: @SpiceRaxHax Never a Conan. Never. https://t.co/9Vm3aSgQKQ A sadist enjoys hurting other people, a masochist goes camping. Just found a great recipe on Buzzfeed for “Easy One-Ingredient Banana Slices.” You never learn that someone is a vegan from a third party. #MayThe4thBeWithYou and may it not be with @JordanSchlansky. https://t.co/lsbDS0UNpK It’s like jury duty, one day you find a letter in your mailbox asking you to be in the next “Expendables” movie. I’m told I speak Swedish with an Ikea accent. Congratulations @CynthiaDSweeney on your great novel, #TheNest!  I inhaled it in one sitting, and now I’m high on prose. The sole purpose to this tweet is to see if @AndyRichter has put me on mute. Playing that drinking game where you open a bottle of wine. May the pelicans discover your koi pond (Malibu curse) This #CluelessGamer features @SethRogen, @ZacEfron, and more crudely drawn penises than you can count. https://t.co/6SrZ6so7qo This online security question wants to know the name of my first pet, but I was too busy running the farm to name the ants. Yes I own a pair of leather pants, but they’re khaki-colored. But, which candidate will make the hashtag symbol available on personalized license plates? #politics #issues #hashtags #COCO4U Is that a banana in your pants, or is it a different penis-shaped fruit? Hey @starburst – you can stop making the yellow ones. I'm not a gambling man, but I'd wager $100 at 5 to 1 odds that I will be one day. I always thought DWTS stood for Dancing With T.S. Eliot. Ted Cruz is just a normal guy with hand sanitizer running through his veins just like everyone else. KFC is undergoing a $185 million upgrade of its restaurants. Or, they could just pay a kid $25 to paint over the “white plantation owner.” It’s only gotten more and more awkward in recent weeks that “Bernie” and “Hillary” are what I’ve named my testicles. Just heard Charlize Theron will play the villain in \"Fast &amp; Furious 8.\" This is the fifth role I've lost to her since \"Monster.\" Wow, time flies. It’s hard to believe that there are only 15343474788 more baseball games to go in the regular season! Every generation just wants their kids to have a better “Spiderman” reboot than they did. This morning, someone recognized me on the street and said, “I’m a huge fan of your effort.” #ConanKorea airs again NOW on TBS. I’ve never been so proud of a show that could technically be classified as an international incident. I appeared in a Korean soap with the lovely @narajjang318. Pretty sure that Korean Emmy is in the bag. #ConanKorea https://t.co/vNezHVqgWm My live @YouTube Q&amp;A about #ConanKorea starts now. Tell your boss it's educational. https://t.co/UcoiOCKjOJ https://t.co/eFwOjz1BZt I'm not sure what's going on in @FollowJYP's music video, but I'm glad that @SteveYeun &amp; I could help. #ConanKorea https://t.co/6oAVoP60ov Watch #ConanKorea, where I mastered the language, hung out with @SteveYeun, &amp; became BFF with an octopus @ https://t.co/zQNbQ07zOD This is either going ruin my career or make it. Thanks a lot, @followJYP. #ConanKorea https://t.co/6oAVoP60ov .@SteveYeun &amp; I did my show from North Korea at the DMZ. Your move, Nobel Peace Prize committee. #ConanKorea https://t.co/T730bLP0g8 I've never felt as loved as I did in South Korea. Sorry, Mom. Watch #ConanKorea tomorrow @ 11/10c on @TBSNetwork https://t.co/ZEYKQD8yjQ Getting these. I work hard, and how I spend my money is MY business. https://t.co/j3a5NufjXZ There is a new exercise called “Rage Yoga” that encourages people to swear in between poses. Or as I call that, “yoga.” I'm now getting mail from an entire country. #thankyou #taiwan #nice #fans https://t.co/hVHt4kX7p5 I like my coffee the way I like my jokes about the way I like my coffee.  I don’t drink coffee. Not only have I already purchased a gravesite, I visit it often and whisper, \"Soon, soon shall I sleep.\" Wow  – Mickey Rourke is almost unrecognizable in this photo: https://t.co/lL6u4nr984 \"Haiku Haiku Hai / Ku Haiku Haiku Haiku / Haiku Haiku Hai.” Tried to take a selfie with @BillClinton but accidentally showed him my fantasy baseball lineup #CGIU https://t.co/2GpZwVPqak Today I’m joining President @BillClinton, @ChelseaClinton &amp; 1,200+ students at #CGIU 2016. Typical Saturday. Watch @ https://t.co/uSdmLKyqJ2 I just tried out Uber's new feature where you can check your \"passenger rating\" and it turns out I'm \"doable.\" At #YouTube HQ--or as I call it, the house that #ChocolateRain built @ Youtube https://t.co/t2hq5FlFPL Every time I see a newborn, I'm reminded of how rare and beautiful it is to look into the face of someone who's never heard of Trump. Tonight I sit down with the cast of #BatmanvSuperman. Spoiler alert: they walk out when I ask… https://t.co/nc4a2aP4Rf What does it mean when your urine is pitch black and smells like midnight? Taking the new #batmobile out for a spin. Link in bio to watch my #batmanvsuperman Cold Open.… https://t.co/XjlEKbKIFi Is it possible for a grown man to be body shamed by his own mirror? This morning, I “broke the internet” (accidentally unplugged my router). When it comes right down to it, aren’t we all fighting Superman? A terrible movie would be Batman vs Superdelegate. Am I the only one who refers to licking an envelope as envilingus? I'm proud to support our servicemen &amp; women taking part in the #InvictusGames. Buy your tickets here: https://t.co/YA5xN0oRyC This is my #clinically #insane #robot Associate Producer jordanschlansky. https://t.co/MrT5c6eOU7 Hats off to my makeup person, @DeborahPaulmann. This is me before a light touch-up! https://t.co/Y3YS25MPFh I celebrate @POTUS' arrival in #Cuba in my customary “dance like a fool\" suit. https://t.co/wPwIcsOpGs My agent is working hard to get me a 5-GIF deal with @buzzfeed If you’re a classic rock fan, and an insufferable snob, your favorite band is The Whom. This is my favorite time of year! (I don’t know when my staff will post this tweet, I just wanted to sound relatable.) I just saw the clip of Helen Mirren kissing @StephenAtHome and now my light shoulder massage from Dame Edna doesn't seem so impressive. Saw my old #friend and bandleader #MaxWeinberg drum his ass off for 3\nand a half hours with… https://t.co/LfWTWOnGur Here’s another #TBT for #StPatricksDay. Fun fact: I’m not wearing any pants. #lucky https://t.co/s2V3Zd5QW9 I'm speaking at UCSB @ArtsandLectures on April 16th. It's going to be the Woodstock of pleasant conversations. https://t.co/u8V7K6T5We Happy #StPatricksDay. #TBT to me with the sexiest #leprechaun I know. #luckoftheirish #WillFerrell https://t.co/KPH0NAWcKw A lot of people want Ted Cruz to win, but are we ready for a President that’s a melting candle? I’m having a hard time convincing my kids that Trump and Cosby used to be funny. INTERN: I’m on YikYak. \nME: Is that a social media app or a rave drug?\nINTERN: You are old, sir. My new pet peeve? I don't think this bearded guy in the #Eliquis ads is really playing the guitar. #StopTheLie https://t.co/7tH5kkBghX I rarely get asked to autograph a breast, so thank you Dave Chelton of Omaha Nebraska. Sorry, that last Tweet was supposed to be a private text to @wolfblitzer You up? In some parts of the world, filet mignon is considered a delicacy. In this #CluelessGamer, @TheNotoriousMMA kicks my ass in #EASportsUFC2. I'm so tired of Irish-on-Irish violence. https://t.co/xa0pWJ76FD I only recently found out that lightning is God trying to kill spiders. When not taping my show, I am playing with this #fan sculpture for hours on end. https://t.co/umDNza8J0l Periscope like no one is watching. Me and a baby #bear.  He loves the sound of my reedy voice. https://t.co/3LRxtUPkXn My kids visited the office and pranked me with this \"Conan doll.\"  I am\nboth #humiliated and… https://t.co/feVGfuLBkK I possess an ennui that can be traced back to the day I pronounced it “ennu-ey” in front of a girl I was trying to impress. I hate to be an Irish literary nerd but the only adult film I’ve ever seen is “Dubliners, Double-Teamed,” starring the amazing Joyce James. A great night in #Vegas with two of my #comedy heroes. https://t.co/dkIJ0fMlgb I amuse jordanschlansky with hilarious showbiz stories backstage in #LasVegas. https://t.co/Lgcd1tAcI8 Preparing to join two of my comedy heroes #SteveMartin and #MartinShort in #Vegas tonight. https://t.co/LGkeIyjItD Going over my setlist for a cameo tonight in #Vegas. https://t.co/lc4JzIWqSd I know God doesn’t make mistakes, but I think even He would agree grapefruit was a misfire. Million dollar idea: maternity clothes, but for beer bellies. Good luck to #ConorMcGregor in tonight’s #UFC fight. #twospecimens https://t.co/pbfhgNi8az You can’t judge a book by its cover, unless the title of the book is \"THIS BOOK IS GUILTY OF MURDER!\" Wanna see @TheNotoriousMMA kick my fat face in? Tune in to #CONAN tonight. #GladThisHospitalHasWifi https://t.co/T0RwjXhVYq Um, congrats? https://t.co/6jPJ3aSQpD A computer scientist calculated that buying one of everything on Amazon would cost $12.86 Billion #wastedhislife It’s a small comfort, but with only 8 justices on the Supreme Court, no one has to rotate out in beach volley ball. Sorry you didn’t win Best Picture, “Mad Max: Fury Road,” but if Trump wins the election, you can re-submit for “Best Documentary.” Between Oscar Fever and March Madness, my imaginary doctor bills are soaring. I will vote for whichever president outlaws visors. I was very flattered to hear Chris Rock is preparing for his Oscar gig by studying photo negatives from the night I hosted the BET Awards. If I owned a sneaker store I would totally have a March Madness Arch Sadness Sale. Hanging with my first cousin, #UFC Featherweight champ @TheNotoriousMMA. Two more pints and we… https://t.co/YQkwkQcjFV Just searched \"blasé otters\" on Giphy so I could show you how my kids react every night when I come home from work. I play #FarCryPrimal with @PewDiePie in the new #CluelessGamer &amp; face my greatest nemesis: a large wall. https://t.co/fR4KJIUBwq A wise man once told me, “I am not a wise man just because my name’s Glenn Wiseman”. Interviewing the beautiful #GinaRodriguez tonight made it MUCH easier to be back in the U.S.… https://t.co/ZYFlsDew7k I respect Apple's stance against the FBI, both for protecting our right to privacy, and for not telling them my phone's pass code is 7394. Thanks to my #ConanKorea crew &amp; all who helped on our trip (bonus points if you can spot our 2… https://t.co/UDIk7OvFQO .@SteveYeun and I got to sing on a brand new track by #Kpop king followjyp. Get ready, #Korea!… https://t.co/dPYWjKdQnh Donated Samuel to the aquarium in #Seoul. He is alive and well - and still delicious, raw or… https://t.co/thCkMmyWOU Sad to leave #Korea. Thanks to all the incredible fans we met. I can't wait to go back! #ConanKorea https://t.co/xQRuOqosyj My fans gave me a nice send off at the Incheon airport in #Korea. I shot this with my iPhone.… https://t.co/WRTSAa5yv0 Stuck behind @SteveYeun at the ticket counter. He insists his luggage be wrapped in silk.… https://t.co/CsiBTQatm8 Did my best to try to understand and improve relations from just inside North Korea with @SteveYeun. #ConanKorea https://t.co/SFuFbQD1Fw .@SteveYeun &amp; I won a stuffed animal out of a vending machine and gave it to this little girl.… https://t.co/rsUeEdGjB1 I've spent so much time here in #Korea with @SteveYeun that we're starting to look alike.… https://t.co/JeZax7WE1q Watch a Taekwondo master kick the head off Jordan Schlansky. #ConanKorea https://t.co/XGHz4sTh4o RT @TeamCoco: LIVE on #Periscope: Talk to #Conan &amp; @SteveYeun live from the set of their K-Pop music video in #Korea! #ConanKorea… https://… I have mastered the art of Taekwondo. And by \"mastered\", I mean \"did it badly for 20 minutes.\"… https://t.co/FIVD1jxaGw Stopped by a #PCBang to play some video games. Turns out I'm even more clueless in #Korea.… https://t.co/URjPZnRVO3 Had the honor of appearing on a Korean soap opera with the beautiful Na-ra Jang. She was great.… https://t.co/qQgHTNI9FY .@SteveYeun &amp; I visited the border with North Korea today. Very surreal. Grateful to these… https://t.co/dbIvVzMz5m 내 친구 #스티븐연 도착했다! 서울에서 같이 놀자~ #conankorea #iloveSeoul #walkingdead #꿀잼@steveyeun https://t.co/W2cssod2Ld I’ll spend this Presidents' Day like I spent the last one, bitterly imagining my profile on a coin. Went to the fish market today and bought a pet octopus. I named him Samuel. #ConanKorea @… https://t.co/xjsGllIZUJ #Korea! Follow me on #KakaoStory. My ID is the difficult to remember \"conanobrien”. #ConanKorea https://t.co/uhRuXVHI6k If you can say Happy Valentine's Day in Klingon you're probably not celebrating it. I've landed in South Korea. I will never leave. #ConanKorea https://t.co/RkLo8gQHez Attention #Korea! Come greet me today at the Incheon airport. I’ll be the tall talk show host.… https://t.co/08bvJSrHVr I'm taking over the @TeamCoco Instagram for #ConanKorea. Take a break, unpaid intern, I got this. https://t.co/zJ5bEvjtDU When Ben Carson finally wakes up, I wonder who gets to tell him he tried to run for President. When you think about it--every castle is a bouncy castle, some are just way less bouncy. Who’s going to walk away first: Peyton Manning or Jeb Bush? Bill Cosby’s lawyer: “As a witness for the defense, I call… the guy who wrote Gold Digger.” Yesterday was the first day in quite a while that Bill Cosby was able to retweet somebody. Congrats to @iamsambee on her first show last night. Hilarious! #FullFrontal Watch #SamanthaBee's new show @FullFrontalSamB tonight at 10:30 on @TBSNetwork. Finally, a host with more estrogen than me. Congrats to Von. Defense wins championships. Hanging with me wins Super Bowls: https://t.co/tLpEfuYdjO Remember, no matter who wins Super Bowl 50, they’re BOTH winners in my book-- The Book of Not How Sports Work. Tune in when I host the #NFLHonors tonight at 9 on @CBS. I'll be the guy with the normal sized neck. Rehearsing my #NFLHonors monologue for one guy. Thanks, Sven. https://t.co/LgmobFIZAY After coming in 5th in Iowa, Rand Paul is dropping out of the presidential race. Paul’s supporters are being described as “consolable.” My BFFs @J_No24, @Millerlite40, @MoneyLynch &amp; I got a sneak peek at the new @DOOM. #SuperBowl50 #CluelessGamer https://t.co/jJ3CkunNBB If you're not watching the hilarious show @ManSeekingWoman Wed nights on @FXXNetwork, I have no respect for you. That was harsh. Sorry. I thought I had a horrible nightmare last night, turns out I was sleep-reading a Kanye West tweet. Paleontology Joke of the Day: I’m hung like a horse, if the horse is Eohippus. Hey, Hollywood! Wanna buy my show about two musicians named Lucas Rock and Evan Roll, called “Lucas ‘n Evan”? I’m starting to think I’m white enough to play Michael Jackson. I’m refusing to watch Fox’s live version of “Grease” Sunday ever since I was passed over for the role of “Bad Sandy.” Just told my barber I want my hair to be “Megyn Kelly in the front, Donald Trump in the back.” It’s almost February and I’m still writing “Tilda Swinton” on my checks. I just Google Imaged “Get My Corncob on the Down-Low” and got this: https://t.co/HdR3aUxBC1 Okay, who wants my VHS copy of \"Can't Stop the Music\" for $15,000? Watch the full episode of #MissionConan now to see exactly how much I stick out on a military base. https://t.co/3eHzo9nCOo I couldn't film my flight to Qatar with @FLOTUS, so this 100%-accurate animation will have to do. #MissionConan https://t.co/fH5b9gHPY1 Tonight's #MissionConan is dedicated to the brave men and women of Al Udeid Air Base who put up with my nonsense. https://t.co/3W08PUKFcH I like to consider myself the Stephen King of people who've never written a novel. 😉😘🌵🚽👍🏽. Am I doing this right? Trying to say, “Running late.” I did a DNA test and it turns out I'm 98% Irish, 2% pool noodle. If the internet ever does become self-aware it’s going to be the smartest perv in the world. I hate shopping at the Depression Store because they never have my sighs. Watch my visit to Al Udeid Air Base with @FLOTUS on Monday 1/25 on @TBSNetwork. #MissionConan #JoiningForces https://t.co/7N9JycjowW I lived a real-life version of “The Revenant,” except instead of getting mauled by a bear, it was a Girl Scout whom I gave inexact change to I guess it's safe to say Trump is a fan of \"Dance Moms\"? https://t.co/OLmn6Xb4kQ There’s nothing like your wife not winning the Powerball and watching her unpack her suitcase. Feeling very snubbed to be the only white person not nominated for an Academy Award. Westerly kids have to stick together. Stay strong, Dorian, we are all thinking of you! #DStrong https://t.co/Es0s2x4DAs Wonder why our office spends over $3 mill a year on paper? https://t.co/9n8iqZbTar Just got offered a job as a permanent “before photo” model! Only the best for my oozing sores: https://t.co/MAxjH7WiqJ I think Rey is the daughter of Harry Potter and Wonder Woman. Tonight on my show, I look back at some fun and special moments with the great David Bowie. https://t.co/DTAWSQ8mTq I am terribly sad about the loss of David Bowie.  He was surrealistically talented, funny, and kind. Ok, little concerned about the Patriots. Bill Belichick just called and asked if I’ve ever played wide receiver. It’s January 9th. Only two more weeks until the Christmas presents I bought on Etsy arrive! My New Year'z rezolution iz to have more fun with Z's. I think we’ve found the one group of guys from Oregon who don’t smoke pot. Did I just hear that President Obama is coming for my biceps? I wanted to teach my staffer Diana how to drive, so obviously I asked @IceCube &amp; @KevinHart4Real to help. https://t.co/1A9SJjpI6y My plan to defeat ISIS? Get them to eat at Chipotle. My favorite jai alai player?  Iñaki Goikoetxea of the Basque Country, of course. I like to think of myself as the kind of boss who brings donuts in the morning. Thinking about it is enough, right? Maybe now that it’s 2016, we can finally start talking about the presidential election. What champagne is best paired with alone in the dark? Not only do I hate the phrase, \"YOU DO YOU, BRO,\" but I wrote it in such large letters that I now can't even see myself in this mirror. *****************No two snowflakes are alike, huh?******************* Does anyone know if I can return a $450,000 hovercraft without a receipt? Idea: fracking, but for eggnog. ‘twas the night after Christmas, and all through the house, man I’m freakin’ drunk. I'm not sure which religion it is, but my neighbors celebrate Christmas by placing all of the husband's belongings on the front lawn. Can we all agree that the person who first thought of dangling long, fuzzy socks over a fireplace was an arsonist? Help me settle an argument- was there a reindeer named Saul? To people who write Xmas: Jesus X, what’s wrong with you? My thoughts on mistletoe? \"Be a man and kiss under a loose beam during an earthquake.\" What do you get for the person who has everything? Socks. I feel really silly dressed up as a Stormtrooper in line to see “Brooklyn.” It’s true the new “Star Wars” makes you feel like a 10-year-old kid again. I had to rush out of a screening to go home and wet the bed. Before I interview the cast of #TheForceAwakens, watch my #ConanStarWars cold open. I play a real galactic dick. https://t.co/KyB43qhhbq Harrison Ford breaking Jordan Schlansky's heart is the best Christmas gift I could ask for. https://t.co/hP598azgbb #ConanStarWars In line to visit Santa Claus, and the kid ahead of us just told Santa he only wants one thing for Christmas: \"the goddamn truth.\" ‘Tis the season to Google Image random stuff. https://t.co/b1eOQtMdUC Remember how Mitt Romney strapped a dog to the roof of his car? That seems quaint now. Fun party hosting tip: Put dozens of extra coats on the bed. When guests ask where everyone else is, laugh maniacally &amp; change the subject. Not a good day. Just learned that not only did I not get a Golden Globe nomination for my role in \"Trumbo,\" apparently I'm not even in it. ‘Tis the season to contemplate how much time you’re saving by saying ‘tis. I just learned that \"Machu Picchu\" is Incan for \"Overpriced Key Chains.\" Twitter is still my number one source of Barry Bostwick news. #BarryBostwick Why is this time of year magical? We all receive meat catalogs. Let’s stop for a second and realize: the other reindeer were dicks. If you like a tweet with a surprise ending cannibalism. After months of practice, I can finally touch my toes. (By telling them that they are beautiful.) I remember the good old days when a movie poster could just be a movie poster without having to sell out and advertise an upcoming movie. When my wife and I argue, she's the one who sleeps on the couch - Greg Couch, our next door neighbor. I’m excited to be part of CGI U 2016, hosted by President &amp; Chelsea Clinton. The deadline to apply is Friday! Go to https://t.co/wsIgBYBZtf When I die, I want to be cremated and my ashes formed into the shape of a tiny skeleton. I figured out how to make the ñ in jalapeño, ñow does añyoñe kñow how to turñ it off? I used to be a nervous flyer, but I stumbled upon a trick that always keeps me calm - continuous screaming. My Amazon Wish List is mostly lozenges and Klingon knives. I got pushed, elbowed and kicked on Black Friday.  And I did all my shopping on my home computer. Finally, a Thanksgiving without a drunken uncle.  Just me, my nieces and nephews and my bottle of Jack Daniels. What am I thankful for? My family, friends, a fulfilling career...soup...the 140-character limit that keeps me from having to continue. Turkey contains Tryptophan which makes people very Ben Carsony. MSNBC created a virtual reality app that lets you experience life in prison. Doesn’t anyone want to be surprised anymore? I'm great in the sack, not so great in the bed. The KKK has gone to the Supreme Court to adopt a highway. Well, technically, just the white stripe in the middle. Carly Simon finally reveals who the song “You’re so vain” is about:  Lester Holt. Oddly, \"Feed Conan cheese and crackers\" was on JLaw's rider. https://t.co/OrZkVwIYuP Astronomers have found the farthest object in our solar system. It’s the airport your friend needs a lift to. Most people know @JohnCleese as a brilliant writer, actor &amp; comedy icon but I know him for his baby-soft hands. https://t.co/6Yhw3O7QJM There’s a new alarm clock that wakes you up by slapping you in the face. No word yet on which German company came up with it. Thanks to @SonaMov and everyone who made #ConanArmenia happen. https://t.co/AZ6xzR3bXX Two beautiful Armenian women enjoying their lunch. #ConanArmenia https://t.co/27PZoi53tH I'm not positive, but I think I could be the first late night host ever to herd sheep in Armenia. #ConanArmenia https://t.co/dCvqJxqHiR This is an Armenian dance called “Where did I park again?” #ConanArmenia https://t.co/8mCKDcfF02 Me and my posse of thugs from my cameo in an Armenian soap opera. I’m the 2nd one from the left. #ConanArmenia https://t.co/PFT0rhJmZM As requested I bought @SonaMov’s father a nice painting. No word on what her mother thinks. #ConanArmenia https://t.co/e7ZvYGmxbm If you want a behind-the-scenes peek of Hollywood glamour, this is me &amp; @AzizAnsari with a cheese plate: https://t.co/Okyuvy9Nnz #CONAN Tomorrow night, a very special episode of #CONAN: My assistant &amp; I visit her homeland of Armenia. https://t.co/0KgR2o92WW #ConanArmenia Reminding #VictorFrankenstein star Daniel Radcliffe the difference between \"Frankenstein\" &amp; \"Frankenstein's Monster\" https://t.co/pYpIxy2eVg I brought my assistant @SonaMov to Armenia. I also brought a camera crew. Watch #ConanArmenia on 11/17. https://t.co/o8oMMAXpyu The car horn is great training for the Facebook dislike button. Caught in a polite-loop with Jesse Eisenberg. https://t.co/ovIzmrmbF3 You know how adults sound in the Peanuts specials? That’s what everybody sounds like when they’re not talking about me. .@LovetheGIVE will donate $1 to @Stand4Heroes every time #GIVE2VETERANS is used. RT &amp; support the brave men &amp; women who've served. I look so good in a #Fallout4 Vault suit, you won't mind the killer robots &amp; ghouls of the apocalypse #CluelessGamer https://t.co/6TdvKhoil9 You think Ben Carson’s comments are nutty, my doctor thinks the pyramids are fallen Tetris pieces. It’s crazy how one controversial tweet can ruin an entire career. Thank Satan that hasn’t happened to me! If eating fish is so good for your brain, how come sharks always score so poorly on the SAT? Had an amazing time in Qatar entertaining the troops with @FLOTUS, @GracePotter &amp; @Mulaney. #MissionConan: Complete! https://t.co/3ldZD5PDGA That's a wrap on my @FLOTUS Instagram takeover! #MissionConan #JoiningForces https://t.co/N49I9DEI2O I got 3 big thrills tonight: appearing with @FLOTUS, meeting the troops, &amp; finally getting to dress like a gardener. https://t.co/y5CCNYPvD1 When you're on a base and @FLOTUS asks you to drop and give her fifty, you give her fifty of your @TeamCoco best https://t.co/Ku7MM1UKKI RT @FLOTUS: So grateful to our troops. That's why I brought @ConanOBrien to Qatar and he brought @JimmyVMusic, @GracePotter, &amp; @Mulaney. Gr… RT @TeamCoco: LIVE on #Periscope: #Conan and @GracePotter perform for the troops at Al Udeid Air Base in Qatar. #MissionConan @gr… https://… RT @TeamCoco: LIVE on #Periscope: .@FLOTUS Addresses Troops at Al-Udeid Air Base #JoiningForces #MissionConan https://t.co/9RpU6DtnIo Just finished practicing with @GracePotter and the AFCENT Band. I hope the military likes jazz fusion. #MissionConan https://t.co/ywYrDaBkQQ Rehearsing with @GracePotter for tonight's show with #JoiningForces at the American Al-Udeid Air Base in Qatar. https://t.co/M1Bw8PZbrG I'm at the American Al Udeid Air Base in Qatar and I'm taking over @FLOTUS' Instagram account. Await further orders. https://t.co/Jehl07oWj1 I finally got my tickets to the new Star Wars movie.  June 11 is a pretty good date, right? Sacha Baron Cohen asked me to tweet the link to the trailer for his new action-comedy #Grimsby,  and I said “no.”  https://t.co/ez3FkChxj5 I’m headed to Qatar with @FLOTUS to entertain the troops.  I hope they enjoy my vocal rendition of Kanye's entire Yeezus album. This comes up every year, but want to confirm: the person behind “Fun Sized” candy bars has been tried for war crimes, right? I’ve won Fantasy Football by never ever playing it. According to a new study, 10% of vegetarian “hot dogs” contain meat. So if you’ve ever enjoyed a vegetarian hot dog, now you know why. The city of Los Angeles voted to allow residents to house up to five cats at a time. Now I have to figure out which 7 to get rid of. The IRS is now giving full married-couple tax status to same-sex couples. Which explains the new app, “Grindr-Just-For-Tax-Purposes.” Just now envisioning how weird it would have been for the original patriots to square off against real, actual jets. I’m wondering if now that he dropped out I can still wear my “Sexy Lincoln Chafee” costume for Halloween. Sorry, Jeb Bush, talking about your favorite Marvel superheroes does not count as making yourself a “DC outsider.” It will be a major, herculean challenge, but I think I can bring back the weave belt. Robots are taking over so many jobs, it’s only a matter of time before I go to Starbucks and get my name misspelled in binary. Russian phone and calendar I bought in Armenia. Now my desk looks like Stalin's travel agency. https://t.co/MxBREMw6YL #ConanArmenia Is there anything more satisfying than gnawing on a small piece of sandpaper? Yes. Life hack: drink 13 Pumpkin Spice Lattes in a row, and your bathroom will smell just like fall! Got caught smoking a hookah. Damn Armenian paparazzi! #ConanArmenia http://t.co/ochCoX700D Celebrating my assistant Sona's birthday in her homeland of Armenia. http://t.co/ofwfFWdQC5 #ConanArmenia Brought my assistant Sona home to Armenia. It was this or give her a raise. #ConanArmenia airs 11/10. http://t.co/m4beg84uHV Here’s something you never hear. “Guess we just gotta trust Russia.” A new book suggests that people are losing the ability to have conversations. Fav if you agree. I am officially suggesting @AndyRichter become the new Speaker of the House. He already has a podium and he LOVES telling people to shut up. Come clean, Sunny D. What are you? I have a love/hate relationship with strong contradictory emotions. A 13-year-old girl has become the world’s youngest psychologist. Each session is an hour and she takes cash, checks or Instagram likes. Wow talk about hard living. Just found out Bernie Sanders is 41. New York is imposing new rules for toplessness in Times Square. Guys, how many times do I have to say I was drunk and I’m sorry? Now that the Red Sox season is over, I can turn my attention to my vintage doll collection. The worst thing about this new iPhone 6S is that it's the exact size &amp; weight of a brick. Wait, crap, this IS a brick. Damn you, Craigslist. I can’t believe Matt Damon is alone on Mars without Ben Affleck. TV will get to the point where “Dating Clothed” will be a breakthrough show. I can’t believe stores are already selling decorations for Christmas 2016. With Trump offending Hispanics and Ben Carson offending Muslims, which GOP candidate is going to step up and take on the Amish? Well I think we finally know what Fahrvergnügen means. It means go F yourself. Hey Pope- want to get booed? Go to any sporting event in Philly. The Pope has left New York and there are six towels missing from the Four Seasons. One day after meeting the Pope, House Speaker John Boehner announced he is retiring. How do we get the Pope to meet Donald Trump? If the Boy Scouts were smart, they’d buy cookies from the Girl Scouts then sell them for more money during the off season. Tonight, I play #THPS5 with @TonyHawk &amp; Lil Wayne aka @LilTunechi and one of us gets a tattoo http://t.co/v4vjMqnbk7 How much wood would a woodchuck chuck with the new Woodmax Superchucker 5000? 400% more! (paid advertisement) The new LEGO Star Wars sets give too much away! Now I know all the characters have round yellow heads. I chopped some garlic when I was 28 and my hands still smell. Clear something up for me— was the first Democratic debate already held over email? I’m a little worried all the hype for “Black Mass” will affect the box office for my biopic “White Ass.” Nicki Minaj spelled backwards sounds like the name of a cool, Swedish actor: Janim Ikcin. Was that worth it? I think so. In times of crisis or danger I will always be right behind you, sofa. I know exactly how Tom Cruise feels in “Mission: Impossible” whenever I’m searching for my ringing phone in a pair of cargo pants. “Please write more ‘Said No One, Ever’ Jokes” – said no one, ever. When’s the last time you used an automatic pencil sharpener? Give it a shot, I think you’ll be pleasantly surprised. You can put the word “blood” in front of “oranges” and people will still eat them. Don’t even try it, bananas. The lines are long for Six Flags’ new ride, “The Market Lately.” The view out my childhood bedroom window in the attic. I used to look out and dream of becoming a great woman. http://t.co/XUetrY3xcV Just saw \"Hamilton\" and got to meet Lin-Manuel Miranda. Easily the best show I have ever seen.  Seriously. http://t.co/eDi22oMADT “Oh bother! I’m all out of hunny,” said Winnie the Pooh. “But bears are omnivores,” he added, leveling his gaze at Piglet. In my entire life, I’ve never heard a single person say, “OK, who ate all the Goddamn Saltines?” Made my wife shout \"Yes!\" in bed last night. (Asked her who her favorite 70's rock band was.) The hand model in commercials who squeezes lemon juice on breaded shrimp? That’s a sweet gig. Future archaeologists will wonder if our sports teams were named after animals or our animals were named after sports teams. The most popular boy and girl names are “Noah” and “Emma.”  The least popular: “Conan” and “Syphillina.” If they replace Alexander Hamilton with a woman, I’ll never put a ten in my front pocket without muttering “please close your eyes.” Dave Grohl has done more with a broken leg than most Americans do in their lifetime. The word “awesomesauce” is now in the dictionary.  Call me old fashioned but I’m going to stick with “sperm.” Stephen Hawking says he’s solved a big black hole mystery. That’s great, Steve –get back to me when you’ve figured out who stole my yogurt. Spending a quiet evening at home, just me and my Nicki Minaj wax figure. When you have my skin, every day is #BurningMan Sec. of Agriculture Tom Vilsack endorsed Hillary Clinton. Hillary called to say “thanks” as soon as she was done googling, “Tom Vilsack.” I hope Guardians of the Galaxy 2 is a prequel, so Vin Diesel can spend 2 hours saying, “I will be Groot.” .@KChenoweth Yes, you nailed it, the severe bruises over each eye are a perfect match http://t.co/P1nk8JtPnF Those Ashley Madison users who are suing the company for breach of contract have really taken the moral flat ground. I don’t believe in air-conditioning and neither do the people who pretend to love to work for me. I'm tired of waking up to find paparazzi going through my garbage cans, dressed as garbage men, with a big loud garbage truck. Don’t hate the playa, hate the game – specifically, Boggle. Did you know that El Chapo has his own show on MSNBC? Starbucks is starting to serve beer and wine. It’s part of their mission, “Always finding new ways to make you pee.” Before we completely write him off as a joke, why don’t we at least find out more about the foreign policy experience of Deez Nuts? Gangs are now facing off online. You can hear more about it in Dr. Dre’s new album, “Straight Outta Etsy.” If you can’t wait for Saturday to see @TigNotaro's special Boyish Girl Interrupted on @HBO, watch her amazing appearance on my show tonight! Has TV advertising gone too far? I’ll be discussing it on tonight’s CONAN with my guests, the Geico lizard and http://t.co/swRDx9DwrO. Kanye and Kim might name their next child “Easton West.” I hope his first words are “Get it?” I really hope “Straight Outta Compton” kept the scene where you can see me playing backup accordion at the first NWA concert. In the office football pool, I didn’t have the Jets QB being punched out by a teammate until Week 2. Can @realDonaldTrump refrain from campaigning on weekends, when I don’t tape a show? Before Jeb Bush tries to reboot the Iraq War, he should talk to the folks who made “Fantastic Four.” The Tom Brady sketch artist drew me: http://t.co/g2E3em2xsg I just hit 3 million @YouTube subscribers, and only 1 million are close family members. http://t.co/RssyJBaaaR Guess which one of these three is not in the movie #StraightOuttaCompton?@IceCube @CaliforniaHeir http://t.co/2EASNKXXKp Marshmallow maker Peeps will have fall flavors including candy corn and pumpkin spice. To save time, I’m gonna throw up now. Astronomers are trying to understand Jupiter’s big red spot. And why it, typically, just had to show up the night before Jupiter’s prom. It’s not that I don’t care about the Drake/Meek Mill feud - it’s that I care TOO MUCH. Nobody spoil the presidential race for me – I’m planning to just binge-watch it in 2017. Am I the only one who saw a similarity between the Republican debates and a Kraftwerk concert? http://t.co/LXKsL3cGfM Medical marijuana is finally legal in Nevada. Just in case people needed one more way to help them make a bad decision in Nevada. Congratulations to Jon Stewart on an incredible achievement in comedy. Sadly, now it's back to getting all my news from Geraldo #DailyShow I’m so curious as to who will be the 45th president and the 46th Republican Presidential Candidate. I think a supercut of Tom Cruise running at top speed could be the cure for male infertility. Showing @VancityReynolds' #Deadpool trailer earned my show a TV-MA rating tonight. Thanks a fucking lot, Ryan. http://t.co/Qcc6OO8j7D #CONAN Tonight on #CONAN I learn that not only is #Deadpool a great mercenary, he's also a gentle lover. http://t.co/HPLuMRg7Y7 @VancityReynolds I’m starting to rethink my polar bear hunting trip with my proctologist. Siri, where my bitches at? I tried to take a picture with my phone, and people looked at me like I was an idiot.  Maybe because it was 1973. I’m on the Proterozoic Diet – I only eat pre-chordates and metazoans. Hotel front desk workers--when a male calls to complain about the Wi-Fi minutes after checking in, yes he’s doing what you think he’s doing. Shout out to randomly mentioning people, places and things! If Pizza Hut really served their pizza in a hut, you couldn’t get me out of there. I’m on vacation. Please keep Trump popular while I’m gone, I need him in the debates. Your lap doesn’t really disappear when you stand up, it just goes into storage. I don’t think I spend too much time on my smartphone at home, and neither do my kids, Candy and Crush. People talking about their standing desks are the new people talking about their rescue pets. Root beer with eggs was a big mistake. Good to be back on the east coast. I missed mosquitoes the size of hawks. Come on, tell me this doesn’t just scream “US President” http://t.co/oCoJDbYacD Pluto’s letting the publicity get to his head – he just signed on for the next “Entourage” movie. Presidential candidate Lincoln Chafee is polling at 0%. I guess the country isn’t ready for a President named “Lincoln.” Can someone give me the contact info for El Chapo’s contractor? Thx. I now regret naming my son “Atticus” and my daughter “Bill Cosby.” I was shocked that Trump was leading in the polls until I saw footage from a monster truck rally. If you're learning Spanish, be careful not to confuse abogado and avocado. I accidentally ate the wrong one. “Wind Beneath My Wings” is a great song, but what about the wind ABOVE her wings? It’s technically just as important for lift. #Physics My favorite new song is either that one from the Samsung commercial, or the one from the Budweiser commercial. I yelled out another woman's name during sex but cleverly covered by saying that's my safe word Tonight the cast of #XMenApocalypse marvels at my mutant hair: http://t.co/WWUA8rgZFe #SDCC #ConanCon Today my ultimate fantasy came true: An awkward prom photo with the cast of @GameOfThrones: http://t.co/Drzd7VJdPu #SDCC #ConanCon Tonight on #CONAN, I welcome both the cast of @GameOfThrones AND @WalkingDead_AMC. No one gets out alive. TBS 11/10c. #SDCC #ConanCon The frosting on these #CONAN donuts is as delicious as the frosting that makes up my real \"hair\": http://t.co/759iAXMqmP #SDCC #ConanCon Tonight on #CONAN, #JenniferLawrence released her inner @Cher: http://t.co/y1qtrJ6hSl #SDCC #ConanCon Tried to get a pic with my favorite @TheHungerGames #MockingjayPart2 actors, but #JLaw ruined it. #ConanCon #SDCC http://t.co/FHA2GFtP3y Hey, @WoodElijah, looks like we have our winner: https://t.co/JORX6uMdBn"}