{"tweets": "No words for how sad this is. None. As i pray and send love to the families of those that were lost. I know a dad and daughter have each other up there. And they will be playing together until they see their love ones again. Rest in Paradise ❤️🙏🏼😇 https://t.co/GZJjeMOe1M Sculpture of magic. https://t.co/tOVdGurIh3 Gonna watch this unicorn sang tonight. Then we gonna get it in! Horns out! https://t.co/jNZC1iKMDX Ok frozen the musical = seriously magical.  The entire cast is so talented it’s kind of unreal. I have no words. 🙏🏼🙌🏼🙌🏼❤️💯🦄 https://t.co/ktaYcIRkRG It’s happening... we’re comin’ for you Australia. 🇦🇺 Melbourne, see you in May 2020! @magicmikeliveau #magicmikeliveau \n\nTickets: https://t.co/BkQFdL0zDU https://t.co/YjUYuvicv4 Movin’ on up to the strip, y’all. Hard Rock’s been a great home, but in 2020 - catch #MagicMikeLive at @SaharaLasVegas. 😈 Tickets coming soon. https://t.co/ucqxcJ64M1 Love when my mom come to town and leaves little presents for me to find once she leaves. Be lovin you mama! Always! Leaving that swinging promise! https://t.co/Ii8uUghz7m Well I’ve always wondered what it would feel like to be hit by lighting. 🤦🏻‍♂️🤦🏻‍♂️🙏🏼🙈 although there are no Storm clouds in this Miami sky today!! Bring it good lighting bring it. ⚡️⚡️🌈 https://t.co/dvaIw49lI9 https://t.co/5t8rK23Xmk The winner of the best back flop................ this guy. Just hold it till your underwater. Hahahaha https://t.co/19W5bMGIG2 Saw this beautiful group of unicorns do their mother f-ing thing last night.  It’s like they are extraordinary talented assassins that go and murder the venue each night like clock work! Love you guys. https://t.co/dWVNY3YnbS I have been given the secrets from @thepattern hahaha Come on y’all!  The app is not listening to our phones 😂😂😂.  But the government thou 🤫🤫🤫 hahaha #crashthepattern https://t.co/eR9QCkYgjl Yo anybody know of this shit and can explain it to me! Cause WTF! https://t.co/4Qhp6gj7IU Good happy magical Saturday morning to all. Get outside if ya can today. I’m going 🐌 snail hunting with the little and dirt biking. What’s everyone else doing? https://t.co/MXxWQmAlOq What’s everyone else doing on hump day? My creative partner / life partner is on his honeymoon. And i'm literally pacing in the office and don’t know what to do with myself. Reid!! Come home!! Now!! Like right now!! Thanks bye!! https://t.co/JWR5D31vM9 Me and you little tail feather, running through fairytales forever. let’s go. https://t.co/6RTIs6QDVB Plottin and planning. Thinking i should start to create again. https://t.co/5vDsocZlsZ #MagicMikeLive takin’ over the world! So pumped to announce #MagicMikeLiveBerlin on #GNTM, coming November 26th to Club Theater at Potsdamer Platz. https://t.co/7g0jLLHkFT https://t.co/wwZ9hHWbel I’m making these swinging chairs for my dirt track. They are so simple it’s a forehead smack that i haven’t thought of something like this. 🤦🏻‍♂️ thank you to the genius that created these. You my good sir are a treasure. Now can you come fix our political system? Thanks bye. https://t.co/ZfQ2vEpnO1 I lost a game of Jenga to Jessica Cornish. \n\nThe loser (me) had to post a picture the other person (Jessica Cornish) picked... Smh and fml... I’m never playing Jenga with her ever again... 🚿 + 🐰 📸 : @jessiej https://t.co/4KObBjlMkH I love you, Reid Carolin, happy bachelor wknd! Waaaaay too much fun made possible by Southern Utah Adventure Center.  Dan, you are our hero!  also ps. Still can’t believe Arin didn’t come. Bad friend. https://t.co/vzePPi4vyQ I’m happy for this kid!!! Aaaaaaayyee!!!  @joshherrin you killed that race. You deserve it. Love bro! https://t.co/ZkWRkdKiv9 THE DOCTOR!!!! https://t.co/iU74NhiJNZ Moto GP!! 1st podium!!! https://t.co/SE935M8tRM I’m listening... universe, world, people, friends, self... i am listening. What do i need to hear? God? https://t.co/EJo8IKszgm I miss you everyday. https://t.co/yvufXEZuUU Man this last week was magic. https://t.co/1dp45PI70z Wishing you the happiest day filled with all the love and all the light. You came into this world on this day and lit it on fire. You have blessed our eyes, our ears, our hearts and our lives. So thank you for just being you. You are so very special. Happy birthday Baby. https://t.co/zuOUPtv5Lf https://t.co/AGx8ZXKpAE Little something i started at a little day sculpting workshop i took. Stay on that learning grind people. 🐰mask. Hehe 🙃 https://t.co/yYWdBbAqmU RT @DEADLINE: Broadway-Bound ‘Magic Mike’ Musical Sets Boston Premiere Date; Channing Tatum Among Producers https://t.co/UDQQaE8DQw https:/… This. Is. Happening. Get ready for Magic Mike… THE BROADWAY MUSICAL. World premiere at the Emerson Colonial Theatre in Boston this November. Tickets on sale TODAY. #MagicMikeBway @EmColonial https://t.co/30QrRR0ucl https://t.co/bEcDKhKQzG Proud of this kid!! He worked his ass off. Now let’s go @joshherrin!!! It’s on now! https://t.co/jLEaI6cOzY So serious when try’in to get back to that 2003 P Diddy Sean John runway show look. Hahaha 😂🤣 #bluesteele #calmdown #timetohitthegym https://t.co/LzCcFUlJUE The #MagicMikeLDN launch was a dream come true! Thank you to our new @HippodromeLDN family, our team, and everyone who helped make this happen! https://t.co/ctB4jFh2r2\n\nWhere do you think we should bring #MagicMikeLive next? https://t.co/Pn1g2iF4Fy Good morning! Breakfast in London windows wide open. Feeling the love. So sending love back to all. https://t.co/iC1cfwrzrd This was my costume for a @JimmyKimmelLive bit. And I met snoop dog... never feeling less cool in my life. I don’t know what i would have wanted to be wearing ( i know i sound like a fan girl but 🤷🏻‍♂️) but this isn’t it. Hahahaha https://t.co/JJbg64tPDE This woman just poured her heart out on stage at the Royal Albert Hall. Whoever was there got to witness something special. Wow. https://t.co/9aK3bNebrn RIP Stan. Thank you for all your joy and light. You created worlds and universes for us all to play in. Hope you’re laughing wherever you are. https://t.co/1aXYxAeHC6 https://t.co/Sv1TP9ZqJT Coming into Monday like!!!!! https://t.co/6YUMcMSTCc My buddy @alberthammondjr has a great song out called #FarAwayTruths. Check it out: https://t.co/kS449ai5cx RT @MagicMikeLDN: Get up close and personal with @channingtatum as he takes our Magic Mike Live London lads to finishing school to learn ho… Mood... https://t.co/voePbriwam #FBF to hanging with the #SMALLFOOT gang at last weekend's junket and premiere. @SMALLFOOTMovie is NOW PLAYING. Take the kids. Take a friend. Take yourself. You won’t regret it. https://t.co/cm2CHwm7JZ Shout out to Leah and Livvy Walsh. Hope you have fun at #MagicMikeLDN. Thanks to everyone who's been entering the #MagicMonday giveaways. Keep it up. More prizes are on the way from @MagicMikeLive and @MagicMikeLDN. https://t.co/UgWmC0A0z6 My daughter giving the lone 🤟sing at her school assembly today just confirmed what i already knew. She cool AF! I’ll never come close to how cool she is. Proud &amp; feeling pangs of dad dork growing. Just look at this pic if you ever need help. It’s done a lot for me. Ok good night https://t.co/MgMPvYCHti There is a lot everyday that we can feel trapped by. Get out there and find what makes you feel free. It’s up to you and no one else. Love https://t.co/170XqyCSVu .@edwardistheman #SMALLFOOTQA https://t.co/Fjnoy3JXYe .@SebSandford #SMALLFOOTQA https://t.co/fP9JiGBtin .@NiallOfficiaIRL #SMALLFOOTQA https://t.co/Vc8PmqpdJo .@ErikaVaToCa04 #SMALLFOOTQA https://t.co/jokJBZ4g1p .@edwardistheman #SMALLFOOTQA https://t.co/yH8PvIJdn6 RT @SMALLFOOTMovie: Join us for a Live Q&amp;A with @channingtatum and @common TOMORROW at 2:45PM PT and send your questions with #SMALLFOOTQA!… Always a good time. Thanks, Ellen. #SMALLFOOT https://t.co/BJwlpe4o26 RT @EW: See @ChanningTatum,@HereIsGina, @Zendaya and more pose with their @SMALLFOOTMovie characters in new portraits https://t.co/MkMWcL0C… This was my attempt at creating a sculpture of Picasso’s Guitarist. It’s was starting out ok. Then i had to get different clay for the hands. Then my daughter destroyed it. Hahahaha oh well. Start a new. https://t.co/9hUQPKD1Qb RT @maddoxgrayson_: Produced my @maddoxgrayson_ and @therealmikedean https://t.co/ab0LwPebOi Rip Corey I’ll never forget your crazy ass. I love you with all my heart. All my prayers to your beautiful family. https://t.co/DJtJMDXjzp It’s Migo’s world and we’re all just living in it. #SMALLFOOT #September28 https://t.co/1aFsFOIqHv I needed this guy in my life today. Thank you dance workout man. You’re a legend. I will forever try and live my life as dope as you workout. https://t.co/6VX5TlY3s3 Getting ready for #SMALLFOOT with this guy. #Migo #Gwangi \n\n📷: @brianbowensmith https://t.co/9Hy3Yu3622 We’re still casting for @MagicMikeLDN! Shout out to Alison Faulk, @Espinosa22 and @LukeBroadlick for the assist. https://t.co/MBQHZRPV5T #MagicMikeLDN https://t.co/VyXgPbOQCh Stopped by @TheGNShow to make a special #MagicMikeLDN announcement. Catch it tonight at 10:35pm on @BBCOne! #TheGNShow https://t.co/clAwM1nZ8b RT @MagicMikeLDN: Make sure you check out The @grahnort Show on @BBCOne tomorrow night, where @channingtatum will be chatting about #MagicM… Things bout to get real in London! https://t.co/fnrMz7aP9E Nothing like breaking through to a new understanding of something that seemed impossible just days before. https://t.co/pmgHcJe46n RT @MagicMikeLDN: Our boys bringing the heat to Piccadilly Circus ... 🔥🔥\n#MagicMikeLDN https://t.co/aM2vQXTTFY 😎 https://t.co/ASp47DnNFm These guys killed it on @BGT to help us announce that #MagicMikeLive will land in LONDON in November. Get your 🎟 to the 1st #MagicMikeLDN shows and make sure you’re following us on the newly launched @MagicMikeLDN. You never know what might happen! https://t.co/6tTTOqrhYb https://t.co/eCVRA7cD20 Daddy doing a little work last week end. I should be wheeling that bump. Next time! Hahaha https://t.co/WBOzbydZOQ You know just drinking my morning affirmations. 👸 https://t.co/4Yk43b5YRf Well, It looks like I lost my daughter in the jundland wastes. This is the last pic i have of her. #tatooinebaby. https://t.co/Vp73fArJ94 Unicorns do exist. https://t.co/LP2RTxun7M I love drawing on airplane napkins. Haha i tried to draw a woman with antlers. 😬🤔... hmmmm Better luck next time. https://t.co/xnl0HoB8s0 Sanctuary https://t.co/rjUr0mYZWl This is a big day for Migo. Get yeti – and check out @smallfootmovie’s new trailer! #SMALLFOOT https://t.co/sFsUFVZbAb Crazy fast couple laps in the rain!! Thanks @ariejr! And what an incredibly beautiful track Mr. Barber. Can’t wait to come back here and rip some hot laps. https://t.co/RcWdlQDec1 Was an honor to meet Mayor Randall Woodfin of Birmingham Alabama today at the Indy car race at Barber speedway. What an inspiring individual in the state I call home. Thank you for the time. https://t.co/BJytgSJx0B https://t.co/y6BBoFMOBz RT @Nickelodeon: Yeti or not, the stars of @SMALLFOOTMovie surprised the crowd! #AD #KCA https://t.co/pIzwCWIFHA #ReposThis is what it looks like when a little tyrant fairy artist holds you down and makes your face look “better”. https://t.co/LfyfrGJ5Tc Proud of our @freeassocla team and this beautiful film we co-produced called #6Balloons. @AbbiJacobson, Dave Franco kill it. Written and directed by Marja-Lewis Ryan, we just premiered at #SXSW, but you all can watch it on @Netflix April 6th. https://t.co/ft0wWqBIo7 I got my new girl!!! And she is sooo bananas!! So much love went into making it. Deep gratitude and thanks 🙏🏼 to @yamahamotorusa @ArinBabaian #sdcstunts #yz450f https://t.co/yVsULzvz2d If you haven’t seen #LoganLucky yet (or just want to watch it 500 more times) - check it out now on Amazon @PrimeVideo. https://t.co/BIE89A6Xx4 So me and Thursday were hanging out doing Thursday stuff when #jolenvanvugt decided to help/make me take things to different level. Learn from the ones that rip!!! And Jesus do her and her brother billy rip. Thanks 🙏🏼 for the help. Legend status. #yamaharacing https://t.co/xTSN80jFBF Aaaa... this dream catcher is straight up what actual dreams are made of. #madebyatinyfairy https://t.co/lhofUh18dJ Attention all hard workers and shit stirrers: @bornandbred is assembling a group of talented and outgoing ambassadors for 2018. Candidates should be 21+, social with a wide array of interests... https://t.co/7hGi8zzshO https://t.co/hGQrBuqf2i Alabamians - please get out and vote this Tuesday Dec 12th in the special Senate election for #DougJones. Watch &amp; share this video w/ local Alabamians &amp; legendary civil rights leader @RepJohnLewis: https://t.co/t3zhv8r7zr #RightSideOfHistory This creature is 1 more year beautiful. The transformation she invoked this year has been something they only write about in books of fairytale &amp; magic. Your strength &amp; grace ever evolving. You make everything around you grow. So grateful for your lessons. Happy life day my love. https://t.co/yXsdAgXieR RT @SMALLFOOTMovie: Yeti or not, here they come. Watch the #SMALLFOOT Teaser Trailer NOW. In theaters September 28, 2018. https://t.co/I6gG… RT @Pink: The video for #BeautifulTrauma featuring the lovely @ChanningTatum is here! Watch it now https://t.co/ptcCynxSxh Yeti or not, here we come. Can’t wait for you to meet Migo in #SMALLFOOT! In theaters September 28, 2018. https://t.co/fD1WCCSIWa War Dog: A Soldier’s Best Friend is out today on @HBO. So grateful to share these veteran's incredible story with y'all. Thanks to all the brave soldiers who serve our country, both human and K-9. #WarDogDoc https://t.co/Zg3gRGrdy6 Had the pleasure of debuting War Dog: A Soldier’s Best Friend last night in LA. Honored to help tell this story. #WarDogDoc - Monday on @HBO https://t.co/oWpI2viK8J Trying something new can be scary. Thanks to everyone who made hosting @JimmyKimmelLive possible. #ICYMI https://t.co/cnuRmhgWRG 😁 Should be illegal to have this much fun. https://t.co/gRxgGHro2x Filling in for @jimmykimmel tonight! My guests are @TheEllenShow &amp; @Pink. (SPOILER: Dancing may be involved.) Wish me luck! #Kimmel https://t.co/rKi9ppDp2b \"There is a profound link between handler and dog.” Proud to be a part of #WarDogDoc from @HBODocs - debuting Nov 13th on @HBO. https://t.co/J2e3RKXnhu Congrats to @ZackMcDermott on the release of #GorillaandtheBird! We fell in love with his memoir. https://t.co/dQtXmxLPKS https://t.co/IPvudJCeOz The brave women who had the courage to stand up &amp; speak their truth about Harvey Weinstein are true heroes to us... https://t.co/pdOa4KNhvL Cooking up something with this dangerously beautiful and brilliant woman. It’s an honor to learn and create with you. The world needs it. https://t.co/eLiXBmfucp Am I doing it right? @bornandbred making bad golfers worse since 2016 https://t.co/JiHwFUGpoG RT @magicmikelive: Shocked and horrified by what’s happened. Victims and their families are in our thoughts and prayers. Love you, Vegas. B… Many have lost everything. Join me &amp; @DiegoLuna_ in raising awareness for those impacted by Mexico's earthquakes: https://t.co/322MZI5qSl https://t.co/CN4mSnRZnl In case you missed last night’s @LateLateShow: https://t.co/dJoVRRI9xQ. Catch our #MagicMikeLive crew on the show TONIGHT-12:37am/11:37pm CT https://t.co/dRFDFjDE2e I accept your #OrangeJacketChallenge, @halleberry. I’m supporting @helpforheroes and nominate my fellow Statesman @thejeffbridges. #Kingsman https://t.co/USIASt27W3 From the bottom of my Statesman heart, thanks for the love, London. 🇬🇧 #Kingsman #20SeptUK https://t.co/B1WjDShFde RT @TheEllenShow: .@ChanningTatum is here today, and he brought me a special gift — a brand new sneak peek at #Kingsman The Golden Circle!… RT @magicmikelive: #MagicMikeLive's the best:\nA. Bachelorette Party\nB. Male Revue\nC. A➕B➕Ryan = ♥️\n\nVote @ReviewJournal's #BestOfVegas! htt… What a week! Missing the amazing ppl we met on the road...won't miss van sleeps though. Hope y'all enjoy @loganluckymovie! 🙏🏽#JimmyLogansRun https://t.co/D9nF6bkRFy Driving @macktrucks is easy. Being interviewed by 10yr old Ella and keeping up with Beatrice? Not so much. #JimmyLogansRun @loganluckymovie https://t.co/hWWwVVCPuE Had a moving visit w/ people in Harlan County. Couldn't wait to share Episode 2 of #JimmyLogansRun w/ you. Enjoy. @loganluckymovie @prestone https://t.co/l9AKqOqir5 Harleys and Chainsaws... that's how you do a press tour for @loganluckymovie. Hope y'all enjoy episode 1 of #JimmyLogansRun. https://t.co/NfYRSZhgQ1 RT @hitRECordJoe: I wrote something about Comrade Detective: https://t.co/Ya74ztCMbl #jimmylogansrun Day 3&amp;4. Most fun I've ever had promoting a film. Thx to every1. Can't wait for you to see all of it. 🙏🏽 @loganluckymovie https://t.co/2h0K1oS7do RT @NASCAR: #LoganLucky features a few of the sport's best \"acting\" talent. 😉\n\nInside the film: https://t.co/TECI44upSn https://t.co/K7Z4J4… #JimmyLogansRun Day 2: met some incredible people today in Harlan County. Thx for making us feel at home. 🙏🏽 #loganlucky @loganluckymovie https://t.co/3OJqvEPpG7 #JimmyLogansRun Day 1. Success. Also Tall Paul and Mike heal their wounds and rekindle a relationship.  @loganluckymovie #loganlucky https://t.co/7Tyoavmauq Always a good time with this guy! Hope you have as much fun watching Comrade Detective as we did making it. @comradeamazon #comradedetective https://t.co/T4Q8h0Or8Z A huge thank you to @MagicMikeLive fans for making us the hottest new show in #Vegas! Tix are now on sale for 2018: https://t.co/vO0Hc1YY8v https://t.co/5m5Ppa2cUz This is gonna be bananas I've wanted to do a junket like this for SO long. Can’t wait to hit the road for #JimmyLogansRun! @loganluckymovie https://t.co/YR1ZNuJvnO LA come get weird tomorrow with @cinefamily and @comradeamazon. #comradedetective https://t.co/U7Qefe8ZXU Hahaha hope y’all are ready for @ComradeAmazon!! August 4th on @AmazonVideo. #comradedetective https://t.co/Pi37vxR6ep Check out the trailer for my boy @marlonwayans hilarious romantic comedy NAKED. On @netflix AUGUST 11. https://t.co/YtXUE8tl8o Thanks to all who let us into your homes. We'll do it in a different city soon, so get a bottle of @BornandBred &amp; keep your eyes peeled! https://t.co/7HhU3e48fL Got to have fun freaking people out this wknd. W/the help of @SauceyApp we spent the day delivering @BornandBred to the good people of LA. https://t.co/aBqYy2iBL1 Maybe you’ve heard of us. @KingsmanMovie #FYeah https://t.co/1sEQdfDNtP Worked with John Bernecker on 22 Jump Street. I want to send my deepest condolences to his family. Such a good guy. What an incredible loss. Eyes off the flask. #SDCC2017 #Kingsman https://t.co/7c2mTBilSo BORN AND BRED CREW IN THIS BEEEOTCH!!! 1st edition MX jersey thx @fasthouse_ @bornandbred @ArinBabaian @Dave_Castillo https://t.co/8ryUZAT0ci I'd like everyone to take a moment today if you can. Try and see the statute of liberty in your mind. https://t.co/yjadkmgw1m https://t.co/M3gbp0UoFL Y'all aren't ready for what I've been working on with @freeassocla &amp; @a24. Comrade Detective. August 4th on @amazonvideo. #comradedetective https://t.co/DVrVliOSFk RT @loganluckymovie: The Logan brothers are down on their luck. But they’ve got a plan to change all that. #LoganLucky https://t.co/ddMheoD… There's nothing like buggin out just me and the pup. Sending love to all. https://t.co/i4y5iJcyIc This is one Jackalope of a day!! @Uncrate app has anointed @BornandBred into its ranks. Thanks y'all!! Check it out: https://t.co/QVRaerOJ44 https://t.co/Lxh5rzmtxe Some of you might know about a project we've been working on called @bornandbred. It's been a labor of love...\nhttps://t.co/ByjxzHbuCH https://t.co/KE0rgelPqP Quick trip to Charlotte yesterday to kick off the #CocaCola600 and debut the trailer for @loganluckymovie. #LoganLucky #memorialday https://t.co/kcDzSIsi1p RT @loganluckymovie: Channing Tatum. Adam Driver. Daniel Craig.\nAnd the biggest heist to ever hit #NASCAR.\n#LoganLucky #CocaCola600 https:/… So... today was the day!!! Arin I love you. You got me into this crazy insane sport and now I'm addicted... https://t.co/pjDJMSaK93 https://t.co/WIA4RQWhV6 Proud to be the grand marshal for @NASCAR #CocaCola600 @CLTmotorspdwy May 28th! #salutethetroops #memorialday #loganlucky https://t.co/J6NTBKlmld This hit everything we dreamed for @MagicMikeLive. @LindseyKelk thnx for being so open for the ride. Appreciate the love. Unicorn for life! https://t.co/W3eNJWUAJL Ready to meet The Statesman? @KingsmanMovie https://t.co/IgvZ1WM20f Sending love to this family. No amount of thank you's can cover the gratitude... https://t.co/lBhfbxNwxr #MagicMikeLive #MenOfMML #LELOmagic https://t.co/WWVB0122wQ It's. About. To. Go. Down. Tonight. @magicmikelive #wearpants https://t.co/Vme6yxY9xf Super thankful to learn from these men and never stop scaring the shit out of myself. Crazy fun day. Gonna be a fun summer. Thanks boys. https://t.co/4aIvg1PNgC Oh shit... @MagicMikeLive on the grind... oh shit! https://t.co/nLxRt923k6 RT @magicmikelive: TONIGHT ALL MY DREAMS COME TRUE. 😍😘🙏🏽 #MenOfMML #vegasbaby #magicmikelive https://t.co/Pfi9ub234M RT @loganluckymovie: We’re off to the races! Steven Soderbergh’s #LoganLucky hits theaters 8.18.17. https://t.co/5F8Dx0UZpB #GetLucky #NASC… Hahaha! Keeping my New Year's resolution to \"learn new things\". But teaching myself piano is brutal. Got to get some legit lessons soon. https://t.co/pDNH5iGbZB &lt;24 hrs left: support @RED, get weird in Vegas w/ me &amp; @MagicMikeLive. Enter MAGIC for 100 bonus entries: https://t.co/N48qOxsylY #endAIDS https://t.co/Bq0V1wzBtb Almost time for Vegas! Join me in supporting @RED to help #endAIDS and maybe I'll see you at @MagicMikeLive?? https://t.co/tMjTVaMuOz https://t.co/FPVZ4ZoVVz Nap time = The Best Time 😇🙌🙌 https://t.co/2NyDeqhmDI I want to go to Vegas &amp; see @MagicMikeLive with YOU. It’s all to help @RED #endAIDS. Go: https://t.co/NQDJv2FstP https://t.co/zOI6xpmjXa I don't always read magazines, but when I do, it's the @Cosmopolitan with my incredibly beautiful wife on it. Proud of you @jennaldewan https://t.co/bdQ1xj4NM6 Check out this free movie of my climbing buddy @leohoulding going big somewhere really wild https://t.co/hXQQ9RO5P2. Beautiful and epic! https://t.co/muIwGQHtGt .@jennaldewan I'm not sure if this woman is my Rainbow or my pot of gold but I'm lucky either way happy birthday cake baby! https://t.co/Mp6ynSWCdR For #WorldAIDSDay, I’ve teamed up with @RED &amp; @Omaze to #endAIDS by giving you a chance to join me in Vegas! Go: https://t.co/pVQx01FTsf https://t.co/KTdAH2b15G Family day!! And Love to the fam that is not here. https://t.co/xVqnMy3Eyv We're showing a whole lotta love for @RED tonight on @JimmyKimmelLive. Don't miss it! https://t.co/v9HVEcapjT RT @RED: TONIGHT on @JimmyKimmelLive: Bono @ChanningTatum Julia Roberts @IMKristenBell @DJKhaled @Halsey @actuallyNPH @HerbieHancock &amp; @The… You. Me. Vegas. @MagicMikeLive. AND It’s all for @RED. Get ready. WIN: https://t.co/Bn1yGDc0Cb https://t.co/gNxr3kZgiB #neverforget https://t.co/Mtn79E7vag 👍 https://t.co/NOYpJA7OOy Did the math. There's at least 72 abs in this vid. You can get your @MagicMikeLive tix now! https://t.co/4J2OXS1G7t https://t.co/bSU64QOxtj RT @NASCARonNBC: It's a bird. It's a plane. It's @KyleBusch and Carl Edwards in @ChanningTatum's new movie #LuckyLogan! (h/t @NASCAR) https… RT @TheEllenShow: If you loved seeing @ChanningTatum’s dancers on my show today, you can get tickets to see them live right here! https://t… Not sure who’s more hyped, my #MagicMikeLive guys b/c they’re on @theellenshow today or me meeting @simonebiles. https://t.co/Y6g0mBhgdQ Thanks @TheEllenShow for making the uneaten carbs &amp; rehearsals worth it. Sharing @magicmikelive w/ you all in 7days! https://t.co/3DDdvmCZHf RT @TheEllenShow: Season 14 starts next week! Premiere Week is gonna be ca-razy. https://t.co/7sKqYKJZhV https://t.co/Q4YewkHzIk RT @jennaldewan: We had to. #stepup10years https://t.co/nVdn9zg4ox Happened upon @leslieodomjr concert last night, so crazy talented. Loved it. https://t.co/RWoPvEWcpW 2 Burr's in 2 nights. Finally saw Hamilton after a year of hype. Totally exceeded expectations. @austinsmithsolo &amp; rest of cast amazing. This woman, 11 yrs together, 7 married. Happy anniversary Cake. Thank you baby I love you. Plus you look daaaaanmm!😵 https://t.co/FK8YAzflLw RT @jennaldewan: 7 years ❤️ https://t.co/DCMjGzuLRa Happy 4th! Hope you're having a good one with fam and friends. 🇺🇸 Can't wait to go down this rabbit hole with @A24... https://t.co/9gmgiDez8L https://t.co/pczWbjs2TP The best stories are the ones created with friends.\nhttps://t.co/FzfsJfW7Rj RT @TwitterAds: LIVE on #Periscope: Q&amp;A with 🌟 @ChanningTatum &amp; @BornandBred #GoLive #CannesLions https://t.co/UPF9GnWKHH Thanks @anitaelberse @hbsexeced @HarvardHBS! https://t.co/b8dkoNEeG0 Oh, the places you'll go... https://t.co/WNVHdvkp2k Lauren from Seattle, Jennifer from Glendale…we got crazy @MagicMikeLive feedback. Keep telling us what you want: https://t.co/O7q6PJ02mT Ok everyone, yes que the slams &amp; jokes I went on a quote tear today. And there are a lot... https://t.co/vs9tCeSvMT https://t.co/e1ZzptFNys Took this just days after jenna &amp; I (mostly jenna) brought our little girl into the world... https://t.co/VBNNqKm5yf https://t.co/jpRpTmTp6x In his downtime @ryanPires831 enjoys lounging by the pool &amp; handing me puppies. Thanks bud. #MenOfMML #MagicMikeLive https://t.co/iKOidBJWje Introducing the #MenOfMML and their abs. #MagicMikeLive https://t.co/jqlWg9NjRz RT @TwitterMoments: Will @magicmikelive tickets be as hard to get as @HamiltonMusical ones? Probably. https://t.co/jyPE8eqO6H #ICYMI: @MagicMikeLive's headed to @HardRockHotelLV. #puppies #shirtlessdudes @cosmopolitan https://t.co/4OyGGz8HJ0\nhttps://t.co/msBNfoyBb9 Dancing in the woods https://t.co/mphDIxw7y5 Yup https://t.co/xWQI15Xldi I mean queen like. https://t.co/XACcSb9LVC Best birthday gift ever from my wifey https://t.co/cUd01nLEKa Braveheart paint by Evie, new rescue horse named Cajun on a sunset ride. Thanks for all the birthday wishes https://t.co/NcVpdzoFxH I'm about to get all up in that Golden Circle. #Kingsman https://t.co/LqCPJ6monO RT @jennaldewan: SO EXCITED TO SHARE!! Dance is one of my biggest passions and can't wait to bring this to you guys! https://t.co/DmzMXpnhsy RT @DrinkRuna: We support #fairtrade wages &amp; Amazon rainforest preservation. Watch @ABC @nightline &amp; learn how @channingtatum helps https:/… RT @hitRECordJoe: Me and that boi Chang gonna go get it. Finally..\n@channingtatum @michaelbacall  https://t.co/xEFDBrNpkH Catch me on @Idiotsitter tonight. Ship's too good to miss. 10:30 ET/9:30 CT @ComedyCentral. https://t.co/wn3FgfoHtP https://t.co/GdK36qsdEb RT @JimmyKimmelLive: An early #ValentinesDay surprise with @ChanningTatum TONIGHT on #Kimmel https://t.co/NgrjMvoQbR Rollin up in a 1949 Cadillac was epic last night at the #HailCaesar premier. Bucket list. https://t.co/DXxwhNwbou Wifey's nonchalant commitment to not wrinkle that dress. Hahaha https://t.co/HtgKxkagP1 Learning to tap was a trip, but I'd do anything to work with the Coens. https://t.co/zr2137TmoS #HailCaesar https://t.co/NHFKTzjKXt RT @TheEllenShow: .@ChanningTatum told me about meeting @Beyonce. https://t.co/ApI2pv4Jj0 RT @jennaldewan: What does Lucy Lane do on her lunch breaks? Visit @channingtatum and @TheEllenShow of course! https://t.co/tyWHbWVeXe RIP Heather. You had a damn good long run sweets. https://t.co/qLzqSVPN6V If it wasn't for her I would have never even found the path much less stayed on it. To my light. I love you. #leicaQ https://t.co/uSFHqWgSnl It's not hard to take a beautiful picture of this magical creature. But I thought this one was special. #leicaQ https://t.co/zSYGei4PdL Technically my wife completely slayed me last night in every way. My only angel saving grace was Mrs. Carter. Thank u B! #lipsyncbattle Mic drooooppppped #LipSyncBattle #TatumTakeover #TeamJenna #LipSyncBattle  https://t.co/j5QqL0Rl53 No pressure 😬 https://t.co/90CeTerder Appreciate the support! Grateful for all you do for our troops. https://t.co/Xm9VtERKmx #TatumTakeover TONIGHT #LipSyncBattle https://t.co/bYyYso2NGR RT @SpikeLSB: This January on #LipSyncBattle: @ChanningTatum &amp; @JennalDewan launch a #TatumTakeover! https://t.co/5de7tS5w0A Happening https://t.co/HV0PF0utlQ Best book time ever!!! https://t.co/75jSJVbl5J RT @jimmyfallon: Tonight: Egg Russian Roulette w/@channingtatum, @JohnBoyega is here, and music from Young People's Chorus of NYC (@ypcofny… It's on like donkey kong. https://t.co/obppX6LiO5 RT @jennaldewan: prom photo https://t.co/MZJgD6bybo So we did better than the first time we were in Ecuador playing volley ball. But we still got our ass kicked. Haha. https://t.co/1ywaccp5Fm Rain and Peruvian humming birds. This place is cray beautiful. https://t.co/vTUbkJjv89 Down in Peru loving life. Just sending love out there to everybody. https://t.co/mxoKAdpWtJ RT @MarlonWayans: It's here! Watch the trailer for my new movie #FiftyShadesOfBlack NOW &amp; see it in theaters January 29! https://t.co/716hz… #TatumTakeover #LipSyncBattle  https://t.co/M4zafqbYJ3 Reunited with the Real Rowdy Sparks. The legendary Dave Castillo. Team Nami for life! Thanks for the lesson today. https://t.co/t91q6HmWAY Got my McKenna Adult Day Care TShirt=Dope! W/ everything going on, want to thank the ones that protect us. #grateful https://t.co/1wjGxBnCcC FEAR MAKES STRANGERS OUT OF PEOPLE WHO WOULD BE FRIENDS. #prayforparis https://t.co/JHtbGNWiHm RT @jennaldewan: Soooooo this is pretty cool @MelissaBenoist :)\nEveryone remember to watch @supergirlcbs tonight! https://t.co/RMmkNKwcUB Onesies pimp walk https://t.co/lr7aqiDSqx Jenna's tiny hat. Makes me laugh every time. https://t.co/96T5aEv749 Tonight @supergirlcbs. I've always known my wife was a superhero. https://t.co/6IVYKN4VqA Jake we will miss you. Everly will miss her very 1st make up artist. Big love brother!! We will see each other again https://t.co/DArIcaDpcD I may have terrified all the children at our daughter's Halloween carnival. Btw- I'm pooh bear in case u can't tell. http://t.co/wQGCoxWEg1 Tina Fey you can do no wrong I love you!!!!!!!! Can you narrate my life please? My little girl… https://t.co/zZnHtllo9D Took this picture in Senegal on the way to Gambia. These three really moved me. My prayers are with them. http://t.co/6HsJdWBSlt I know I've got a blockhead...I never knew I'd have an actual blockhead for a child lol. http://t.co/8RyuZZUX1h RT @JoeManganiello: #MagicMikeXXL is out TODAY on Blu-ray/DVD! http://t.co/Y4wJveG8JP Oh man... Storytime is gonna be epic tonight. http://t.co/p8zHxsDr6C A badass dog w/ a badass ride. #RidefortheFallen2015 for #AndrewMcKenna &amp; #RyanSavard. DONATE: http://t.co/6ToLuWoCRt http://t.co/Gu49uyrest Got a lot to learn. But so much fun. And completely terrifying in a good way. https://t.co/KvMrPssUFr These guys. Comin' at ya on @iTunesMovies today. #MagicMikeXXL http://t.co/d1tlIdLkGR 1st jump ever today! Thanks to very patient friends. I'm addicted. Thanks Arin and Steve. http://t.co/ynaEsoWAKa And then there was this-- not sure? Guess it was a dancy stretchy thing. Either way hilarious to walk in on. #sytycd http://t.co/mbYzZ81IKz So proud of my girl! Had the best time watching! #SYTYCD RT @jennaldewan: Blurry pic but the passion is IN FOCUS. Yepppp I'm that corny. Watch #SYTYCD's finale tonight at 8/7c on @FOXTV! http://t.… A friend said she needed art at the office. So I chucked her really nice gold scissors at the wall. Bomb. Art sauce! http://t.co/uzhuCiX83b This car is a work of art. I love the paint just how it is. If only it would run like new. Ha dreaming. http://t.co/CCx0TGHu1l Just finished a riding course today. I've rode dirt bikes for a while. Now I can just do it legally. http://t.co/qZNvyRt8Tl HUGE thanks to the good people at @DrJaniceE for sending food to our favorite Telluride dogs @ Wintermoon Sled Dog Adventures (@Tealeybird)! Let's just not even go into what this about? http://t.co/UvcNuVM9kS Morning ride. My lulu is so rad she lets me win. https://t.co/qCBVa5HOM1 Just doing back flips in the desert. That's all. Can't remember who took the shot. Great shot though. http://t.co/sLqp9L4Yla Meet \"Smoke\" my rescue horse. He loves beer! We're meant to be. (to be clear he just loves the smell) http://t.co/nBHM3Y3uO7 Buster Keaton http://t.co/Fkh69qKpS8 Thanks everybody!! https://t.co/y111HSerFn My deepest condolences to the family of 1st Sgt. Peter Andrew McKenna, who we were honored to meet in Afghanistan... https://t.co/CgdJwD1nXW RT @jennaldewan: So excited to share with you guys and join this awesome show! https://t.co/GBILu2a8CY RT @jennaldewan: Check out @lordcolinoneal’s cool time-lapse video of the Charlie Chaplin piece he painted for us! http://t.co/b1mSSkGXaB Let's show the world the power of the Amazon, while preserving it &amp; helping their communities. http://t.co/HzHfj7A9Ba http://t.co/1mhcUmXo1f RT @jennaldewan: Yep it's true! Dancing shoes being put back on! With the amazing @TravisWall! Get ur tickets now and see u there:)  https:… RT @jennaldewan: Thanks to @JoAnnaLGarcia @NickSwisher for hosting a night to help @curebatten! Please help!!  http://t.co/D9Mgy2ELuV http:… #auniverseunited http://t.co/cFqkJw92Zb RT @VancityReynolds: It wasn't until I got home, I realized my keys, wallet and kidney was missing. #Gambit. #deadpool http://t.co/gFsYHBGc… Dropped in and sang happy birthday! Surprised the #ArcLightHollywood w/ @MattBomer &amp; @JoeManganiello! #MagicMikeXXL\nhttps://t.co/IBiMnq6gky It's goin down for real! Ready for the show @ArcLightCinemas?!? #MMXXL #MagicMikeXXL http://t.co/M6yse9b9TU RT @SuperSportSkibo: @magicmikemovie #Magic9 #MagicMoment http://t.co/sHCnKSkknq RT @MeleahL: @magicmikemovie #MagicMoment Best girls night. We decided to catch the very next showing. Twice in one night    ;) RT @_LLRocha: We heard Mike is a cookie guy, so we came prepared @magicmikemovie #MagicMikeXXL #Oreos #DollarBills 🍪🍪💵💵 http://t.co/kbJV0IW… Superhero selfies and @TheRealStanLee... All sorts of dreams came true in #HallH today. #SDCC #Gambit http://t.co/gRQ14XNPka Hell yeah! Women are killin' it at the box office this year. http://t.co/CdCXNqjSIs Watch out Hollywood...got a few surprises up my sleeves for one of the #MagicMikeXXL theaters this weekend!!\nhttps://t.co/wjnLDhGx6U Definition of triple threat! #NowPlaying @MattBomer's Heaven &amp; How Does It Feel http://t.co/ToTHwMoyv8 #MagicMikeXXL http://t.co/pHMmY9zY0x Surreal! 5K #MMXXL fans in one room. Largest premiere in the Southern Hemisphere! #mmxxltour https://t.co/f8J28TvlJR LIVE on #Periscope: Live from the #MMXXL Australian Premiere fan Q&amp;A! #mmxxltour https://t.co/wyBJ9MXfwa LIVE on #Periscope: Sydney, are you ready for some Magic? #MMXXL #mmxxltour https://t.co/tWb3VyUloQ Sightseeing before #MagicMikeXXL's Australian premiere. Watch the red carpet live tonight...\nhttp://t.co/Rb4ZOrdKn3 http://t.co/kNMameSINP Happy #4thofJuly everyone! RT @VanityFair: Check out #MagicMikeXXL's pole-dancing star @ChanningTatum on our new cover  http://t.co/VRWMfP297p http://t.co/IcHlwwQZsj Doei Amsterdam!!! \n#MagicMikeXXL #MMXXLTour #magicmikeNL\nhttps://t.co/dKYjwohzI2 LIVE on #Periscope: What's up Amsterdam! #MagicMikeXXL #mmxxltour https://t.co/f5uTkHssuV Let's do this! #MagicMikeXXL http://t.co/JiyQO6YZrN Wheels up...headed your way Amsterdam. #MagicMikeXXL  #MMXXLTour http://t.co/C7IlOTnqoR We did it big tonight. Thank you London! #MagicMikeXXL #MMXXLTour http://t.co/18hzEkyCRv LIVE on #Periscope: #Magicmikexxl premiere London!! https://t.co/BbkWzvqhBo LIVE on #Periscope: #MagicMikeXXL London Premiere https://t.co/AjHYIXFuBe LONDON! I'm about to hit the #MagicMikeXXL premiere. Watch me on the red carpet here: http://t.co/MlH2A9Lam9 Never know where we'll show up! Two more surprise theater dropin's before #MagicMikeXXL's London premiere tomorrow. http://t.co/eIOeofQK7M LA was off the hook! Love this crew &amp; can't wait to see even more #MagicMikeXXL fans at the UK premiere. #MMXXLTour\nhttps://t.co/nTYM6apDzu Gotta hand it to you guys. Loved your #MagicMikeXXL Pony videos. The nurses though... so good. #GMA\nhttps://t.co/SmEDmv7OUM LIVE on #Periscope: Live from the #MagicMikeXXL PREMIERE https://t.co/PDWNy8rSKs RT @jennaldewan: Pre game #magicmikexxl http://t.co/O3Oeo3jTAK Gonna be a crazy night, but I'll try to answer a few of your #MagicMikeXXL questions on #Periscope tonight. Tweet me some of your Q's. Almost time to hit the stage. Broadcasting live via #Periscope from the #MagicMikeXXL premiere tonight! #MMXXLTour\nhttps://t.co/iqEEQuAkKB You gave us keys to the city, so we had to drop in and give you some #MagicMikeXXL love. Thank you Miami! #mmxxltour http://t.co/K2Ur3tGMDT It's official. #MagicMikeXXL just took over Miami. Huge thanks to the #MiamiWalkofFame! #MagicMikeDay #mmxxltour http://t.co/DLEQLngVor RT @JoeManganiello: SAE bro... SAE...\n\nStrippin Ain't Easy\n♡ #BDR https://t.co/pRMPbDO5eo Me, @jimmyfallon and #MagicMikeXXL reenactments on @FallonTonight... http://t.co/UgcTMx9uj3  #mmxxltour http://t.co/ZVkGIcckgk Thanks for all the #MagicMikeXXL love at @GMA this morning! See you at the premiere Rico... http://t.co/oEo2vOKDgO http://t.co/r35po5e5Qe RT @sternshow: Now on #Howard 100: @ChanningTatum! #MagicMikeXXL @magicmikemovie RT @RobinRoberts: .@channingtatum &amp; @MattBomer are @GMA to help us crown the winner of our @GMA Magic Mike contest. Don't worry it's mornin… THIS https://t.co/W1P9ztWi7J Best. Interview. Ever. #magicmikexxl #mikeandmalik #mmxxltour http://t.co/y5BWejYOhw Knocking out about 10 million or so #MagicMikeXXL interviews with this guy. #mmxxltour http://t.co/ra3GBitIaD It's your last chance! http://t.co/NrTkK4vV91\nhttps://t.co/jwQQ4hq9tW This is dope... http://t.co/yeKpv52wJI RT @magicmikemovie: Want to play \"Truth or Dare\" w/ @channingtatum? Send your ? w/ #TruthorDareXXL to see his answers tomorrow @ 6pm PT. ht… RT @reddit_AMA: Join @channingtatum for his AMA live now: http://t.co/uBVsQrgDkK Kicking off my 1st #redditAMA in 30 minutes! Got questions? See you guys at 2pm PT. Be gentle. http://t.co/lz7e6mEXEw http://t.co/kTShP6fSjw Hey Twitterverse! Join me for a #redditAMA tomorrow at 2pm PT to ask me (almost) anything about #MagicMikeXXL &amp; more! http://t.co/KKz9ha62B0 There's a #MagicMikeXXL ticket with your name on it. Grab yours at @Fandango NOW! http://t.co/4PgyPsHdiC\nhttps://t.co/rYNWhIqktv I'M ON A FLOAT! Celebrated #LAPRIDE45 today with the #MagicMikeXXL crew. http://t.co/ac6zVWprpb They told me I'd be dunking. Didn't know they meant this... https://t.co/rGplxR8ttu Me and the wifey went and got our Jurassic on tonight. So much fun! We need more teeth!!! ...and more mosquito snatching!!! Here’s how I celebrate your @RunaFoundation donations. Keep’em coming! http://t.co/TY7l3jqgBK #MagicMikeXXL\nhttps://t.co/MYYtijQf3C RT @ReggieMillerTNT: The Magic Mikes vs The Magic Johnsons, who won?? Watch @jimmykimmellive on Sun.. #NBAonTNT… https://t.co/DggOYDMecU London, Amsterdam &amp; Sydney... hope you're ready for #MagicMikeXXL premieres. AUS, get tickets: http://t.co/jFFnWAM9NW http://t.co/rrKoIOE93g I support @curebatten b/c it saves young lives. Help us help these babies by donating here: http://t.co/rBSJ2XfVhI\nhttps://t.co/kDK9cC4xFf Want to ride to the premiere of #MagicMikeXXL with me? ➤Enter and support @runafoundation: http://t.co/8RXrAiMXfF http://t.co/QXXyisnSeT RT @GMA: We want to see your best dance moves! Enter our @magicmikemovie Epic Dance contest: http://t.co/bLWulFDKgn http://t.co/wKDrgXfgeL Want to watch me dance AND win a trip to meet me at the #MagicMikeXXL premiere? GO HERE: http://t.co/NrTkK4vV91\nhttps://t.co/DETULBJPLA Celebrate their lives. Honor their sacrifice. Thank you to the troops, past &amp; present. #MemorialDay #freedomisnotfree http://t.co/lDcHU1ZL3U RT @jennaldewan: It’s one of my favorite accessories! Here’s how a #RedNose can help fight childhood poverty: https://t.co/ZwsOTaUOfP http:… Burning down the house for one last show... Tito. Ken. Mike. BDR. Tarzan. #MagicMikeXXL #July1 http://t.co/arfAJEi3ht #currentmood http://t.co/ChGEHOo2wS This one’s for all of our #MagicMikeXXL Moms out there… Happy #MothersDay from your boys.\nhttps://t.co/DVgEJyoLMn Think there's still Magic in this Mike? Check out the new trailer and let me know. #MagicMikeXXL #ComeAgain\nhttps://t.co/5DoRuRt9Sq Wednesday. Jump on it. #MagicMikeXXL\nhttps://t.co/WzRRe2YF7I RT @jennaldewan: Direct Relief is mobilizing it's emergency response team in Nepal. Go to http://t.co/sY79UwuL8s and click #donate to help!… Thanks, guys! Grateful for another year with the people I love doing what I love. Got to spend the day with these guys at #CinemaCon. Let the #MagicMikeXXL madness begin! You ready? #ComeAgain #July1 http://t.co/ViUg15q5vo To everyone who tried to help and to the good New York Samaritan who found my bag and asked for nothing in return, thank you. Thank you all! Seriously, left my black backpack in a cab near NYC's 42nd street. If you find it, email me at findmybag@channingtatumunwrapped.com. Thanks! Dropped off at 42nd street in New York City and left my bag in the cab! All day. All night. #MagicMikeXXL http://t.co/84VKfhgoNW RT @magicmikemovie: There’s nothing like a little tease to start your week. Follow @MagicMikeMovie on @Snapchat this morning for more.. htt… Have a lot of good memories from working on #DearJohn with my friend Marty Bowen. His newest movie @TheLongestRide is out now. Check it out! HA! RT @philiplord: Read to the end PRICELESS @chrizmillr @jonahhill -- police pose as students to bust drug ring |  http://t.co/p8ZSTojIFd RT @rainbownan: @channingtatum @magicmikemovie #MagicMikeXXL looked what I just got!!!!  #bae #represent #july1 http://t.co/f4LGVKq2SL I came home to find my wifey and my little monkey in their first MMXXL T-Shirt!! Get yours: http://t.co/XMgxBf3tmz http://t.co/K9sTu1E5fU Was a privilege! Congrats! RT @rolandemmerich:Last night @channingtatum presented me w/ the Stephen F. Kolzak award. https://t.co/k9EUH7X29l RT @jennaldewan: #glaadawards #GotYourBack http://t.co/LSAhPnwIhr #truth RT @etnow: .@ChanningTatum gushes over @JoeManganiello in #MagicMikeXXL: \"He's gonna blow people's minds\" http://t.co/gC6yAihqFE RT @brianbowensmith: Love this shot we did of @wendiandnicole and @channingtatum for thr_f #thehollywoodrerorter… https://t.co/dvLEricC1G RT @foxcarolinanews: The Buncombe Co. Sheriff's Office is trying to locate Cristie Codd and Joseph \"JT\" Codd. \nhttp://t.co/ilVa8F6XPF http:… Had fun with this one. RT @interviewmag: .@channingtatum interviews  @NICKZANO. Their safe word is \"pink gummy berry\" http://t.co/B7n9X4SR7n RT @autumnn_tatee: Magic Mike is on E! RT to save a life 😛🔥 These fans not only helped us make #MagicMikeXXL, they came bearing cool gifts. I think Mike would approve. #tbt http://t.co/9QszdsqB6R RT @gingerjonathan: @channingtatum @MarkRuffalo @SteveCarell so excited to finally watch #Foxcatcher! #TeamFoxcatcher http://t.co/WzzWbe6geC RT @dmech06: Bought the movie #Foxcatcher and I can see why there was so much buzz about it. 140 characters doesn't do it justice Nice! RT @NickVrvilo: Who did it better? RT for @tongwinston and I, FAV for @JonahHill and @channingtatum http://t.co/62pWNJOzHc RT @WarnerBrosUK: “Wind it, grind it, drop it down low! #MagicMikeXXL #MagicMondays @channingtatum @MattBomer @JoeManganiello http://t.co/H… #EverythingIsAwesome when you're playing possum. http://t.co/hET8k6XlTu Yesterday's rehearsals. Can't wait to join this talented crew on the #Oscars stage tonight! #TeamOscar #TheAcademy http://t.co/UUX8hZmIad RT @glaad: .@channingtatum to present @rolandemmerich with Stephen F. Kolzak Award at #glaadawards\nhttp://t.co/A7tNpxWE2s http://t.co/maEYw… RT @jennaldewan: Snow, love and lots of happy dogs for us this ❤️day! Love u all! Check them out what a great family … http://t.co/1BZ9H5ah… .@the_USO #USOMoments #Afghanistan\nhttps://t.co/xUqfW9bgEo .@the_USO An incredible journey! Thanks for everything you do. We wish you a safe return home. Till then, keep holding it down. #USOMoments RT @the_USO: .@channingtatum @NICKZANO &amp; @_Adam_Rodriguez created #USOmoments w/ #troops in Afghanistan! http://t.co/4fVUvEpdMR http://t.co… RT @VanityFair: For an inside look at the Hollywood Issue, download Vanity Fair’s March Digital Edition http://t.co/IW9GNTvSTL http://t.co/… Alan Turing &amp; 49K other men were prosecuted for their sexuality. Join me in signing the petition to pardon them all - http://t.co/PNapNWCr7O I could read your reactions all day. Thanks for the #MagicMikeXXL love! WORLDWIDE #MagicMikeXXL http://t.co/taJqH0taL0 Get your twenties ready... #MagicMikeXXL\nhttps://t.co/UJJ2WNBRXp RT @JennGalindo1: “@channingtatum: Look, but you can't touch... #MagicMikeXXL http://t.co/SoLZx5Bn4L”\n\nSiri, Clear my July 1st schedule. Look, but you can't touch...until tomorrow. Tune in to @theellenshow! #MagicMikeXXL http://t.co/yNtA0ixJYD Congrats to #TeamOscar winners Chris, Justin C., Kelly, Justin F., Rhianna and Patrick! ICYMI last night's #Kimmel: http://t.co/LLiJZpd3XB Stopping by @JimmyKimmelLive tonight. Don't miss it! RT @craigzadan: FOR #TEAMOSCAR ANNOUNCEMENTS\nFOLLOW:\n@channingtatum @TheAcademy \n@craigzadan @neilmeron http://t.co/jwvAwNvrtu #Morality #Love #MLK http://t.co/3nf0jBbSdD RT @ProductHunt: Complete: A community-based to-do app. Help each other GTD. http://t.co/ybx8ELFTMo via @rrhoover on @producthunt http://t.… My buddy @Xanderschultz just launched @complete_app! An awesome &amp; positive social network: http://t.co/grpbfkiLsN Upvote it on @ProductHunt. Congrats to @MarkRuffalo, @SteveCarell, Bennett Miller &amp; the entire talented crew on #Oscar Noms. Honor to be on Team Foxcatcher. #grateful Final day! RT @neilmeron: Last chance to enter the #TeamOscar contest to be an #Oscars trophy presenter http://t.co/pEVWYTZSFx @TheAcademy RT @FoxcatcherUK: What does it take to become the best in the world? See #FOXCATCHER in UK cinemas today. http://t.co/77wlAQtG2w https://t.… RT @goldenglobes: Presenter blitz! @channingtatum, @prattprattpratt, Amy Adams, Catherine Zeta-Jones... http://t.co/ov91TSDxWf How do you say October 7, 2016 in Cajun? Filmmakers 18-30, don't miss a chance to appear on @TheAcademy Awards by entering our #TeamOscar contest by Jan 12th! http://t.co/pEVWYTZSFx 2014 was a trip! Thanks for everything. Happy New Year! RT @jennaldewan: Happy holidays from the Tatums! http://t.co/ztcdMfTUE5 Proud to live in the land of the free and proud of my friends at @SonyPictures. http://t.co/hBa3adJlUy Merry Xmas eve all! @neilmeron Thanks Neil! Happy to be back! RT @craigzadan: #TeamOscar We are so happy to welcome Chan back as our spokesman a second year. Excited to launch the #TeamOscar contest today! Want to join me on the #Oscars stage? http://t.co/BdfEHLUecG http://t.co/K2R418iDNi RT @FoxCatcherUK: .@SteveCarell, @MarkRuffalo &amp; @ChanningTatum star in the incredible #FOXCATCHER. In UK cinemas Jan 9, 2015. http://t.co/b… Thanks so much to @CriticsChoice for the nomination! It's exciting to see #22JumpStreet, @TheLEGOMovie &amp; @BookofLifeMovie also recognized! This is one of the saddest things I've ever read... http://t.co/diKX7kFX43 http://t.co/9j735Ctahk Sending a huge congrats to @SteveCarell, @MarkRuffalo, #Foxcatcher, @BookofLifeMovie and @TheLEGOMovie on today's @GoldenGlobes nominations! Wishing Indonesia the best as the nation breaks 50 yrs of silence &amp; watches @lookofsilence on #HumanRightsDay 10/12! Selamat #nontonSenyap RT @THR: #BenedictCumberbatch, @ChanningTatum and Actor A-List on Hollywood Fame, Fear and Stage Poop http://t.co/FbiPXH8JQI http://t.co/fM… 😳 RT @jennaldewan: It's my birthday and hubby does what I want him to  http://t.co/ki86Sgph0X HAPPY BIRTHDAY to the best mommy and wifey in the whole world!!! http://t.co/q0WMtF3t6n RT @jennaldewan: Check out what my friend @PanteraSarah has been up to! Please support and join the charity revolution http://t.co/nFPyCPGo… Unconditional puppy love... #FOXCauseforPaws #petselfie http://t.co/roOht9Zvs4 Eating my weight in turkey and dressing today... #HappyThanksgiving to all! Wanted to take them all home. Join me, @jennaldewan and my new friends on #FoxCauseforPaws tomorrow night! http://t.co/tLreKSS2ih RT @UnwrappedPhotos: Check out these adorable pics of @channingtatum and @jennaldewan on @CauseforPawsFOX, airing Thanksgiving at 8/7c! htt… RT @BarksOfLove: We think @channingtatum and @jennaldewan are in love with our rescue pup Einstein! @CauseforPawsFOX @FOXTV http://t.co/Oqr… RT @Esquiremag: Oh, yes, that is Channing Tatum on our latest cover: http://t.co/suBkAKJN0j http://t.co/riRVv3PNRS RT @JumpStMovies: PLAY ON PLAYA! #22JumpStreet is out today on Blu-ray! http://t.co/HF4BpafkZ5 http://t.co/huhpIocGem One of the dearest people in the world to me just handled heart surgery like a boss. Time is precious in this life. … http://t.co/2aKKeyGJ5j RT @jennaldewan: Woo hoooo foxcatcher winning best ensemble award at @hollywoodawards !! So. Deserved. Amazing you guys RT @jimmyfallon: Box of Lies with @ChanningTatum http://t.co/KaWPgVKENQ #FallonTonight Stopped by @KellyandMichael to talk #Foxcatcher and had a little #MagicMikeXXL reunion w/ my friend @michaelstrahan! http://t.co/b0CVodoCuj RT @GMA: Now on @GMA... @channingtatum! He talks with @GStephanopoulos about #Foxcatcher. http://t.co/uHWxjX1pN3 RT @KellyandMichael: FUN show today with @channingtatum, and a performance from @EstelleDarlings!! #KellyandMichael Want to know what's in my box? Tune in to @FallonTonight to find out! http://t.co/F6rNeLjARG http://t.co/oXQqe4AB0I RT @jimmyfallon: Tonight on the show: @channingtatum and Eddie Redmayne are here! Plus @Logic301 performs with @TheRoots. #FallonTonight Happy Veterans Day! Don't forget to honor to the true heroes. Not just today, but every day. I love this show. I signed it. http://t.co/dkLvhB4bob #renewwitchesofeastend RT @UnwrappedPhotos: .@ChanningTatum talks career, family, and the future in his brand new cover story for @THR! http://t.co/pBaGXAuXSs htt… RT @RealKevinNash: @channingtatum words can't express my love for you my friend. A call away no questions asked. http://t.co/48nSOKD0KO That's a wrap! RT @_adam_rodriguez: Sadly, this is the last day of the last ride.  Gonna miss my road dogs and this… http://t.co/J75n7U9bmd Here’s an exclusive look behind the scenes at my new movie #Foxcatcher – opens November 14! http://t.co/yfX1kGveBx #TeamFoxcatcher RT @UnwrappedPhotos: Think they're wondering where their copy of #22JumpStreet is? Get yours on iTunes/VOD! http://t.co/UW2UXQKhjv http://t… Big thanks to all the #MagicMikeXXL contest winners! Hope you had a great time as extras in the movie. http://t.co/spwpqtAgQe Love this guy! #BookOfLife http://t.co/QPkgQ5HdOh #22JumpStreet is back in theaters FRIDAY! See Jenko &amp; Schmidt again before it’s too late. http://t.co/5iFlb0D2YK RT @official_tWitch: It's going down @channingtatum Magic Mike XXL!! #MikeAndMalik @beatsbydre http://t.co/rWdf3OAGi4 Check out my buddy @NicolasWright's new show #ManhattanLoveStory tonight at 8:30/7:30c on ABC! http://t.co/7yucuDGsM6 RT @GMA: OKAY @michaelstrahan! Look at this behind the scenes photo of him (and @channingtatum) from the \"Magic Mike XXL\" set. http://t.co/… RT @RottenTomatoes: #Foxcatcher  is Certified Fresh at 91%: http://t.co/XmNVoOjCMD @sonyclassics @SteveCarell @MarkRuffalo @channingtatum h… RT @TheEllenShow: \"The Book of Life\" opens today! @ChanningTatum, @ZoeSaldana and @DiegoLuna_ are all here. It’s a perfect Friday. http://t… JOAQUIN, his epic mustache, and I can't wait for you to see #BookofLife! RT if you'll be there for opening day today. http://t.co/Wn0gXsDWid RT @JoeManganiello: A warm #MagicMikeXXL welcome to @michaelstrahan @donaldglover @official_tWitch &amp; @jadapsmith Welcome to the circus! @ma… RT @peoplemag: No, you're not dreaming -- #MagicMikeXXL is looking for 300 women to watch male strip shows http://t.co/c9GCA3h1DJ http://t.… Dolla dolla bills ya'll #MagicMikeXXL http://t.co/Z5wGG5XgUW RT @BookofLifeMovie: CHURROS FOR EVERYONE / RT @mexopolis: Get Jorge a big opening weekend so he can eat more churros! #MariachiMyTweet\nhtt… RT @BookofLifeMovie: It's ALWAYS Joaquin Time! #BookOfLife / RT @channingtatum: I’ve got a request: “IT’S JOAQUIN TIME!” #MariachiMyTweet\nh… I’ve got a request for the @BookOfLifeMovie mariachi band: “IT’S JOAQUIN TIME!” #MariachiMyTweet We got a mariachi band! Tweet now using #MariachiMyTweet and it could be turned into a #BookOfLife mariachi song! http://t.co/sTjHqL7OGx RT @RealKevinNash: @fluffyguy @JoeManganiello @_Adam_Rodriguez and @MattBomer and myself grinding out Magic Mike XXL http://t.co/OqaoR8hlEv RT @craigzadan: Follow our Tweets of our prep!\n@neilmeron @craigzadan \nBehindTheScenes\nof 87th #OSCARS \nthru live telecast on 2/22! http://… RT @20thcenturyfox: The #BookOfLife cast is LIVE from the red carpet premiere in LA! Follow @BookofLifeMovie for all the action! http://t.c… RT @jennaldewan: It's a #mmxxl #witchesofeastend viewing party!! http://t.co/49h3GzSscq MEEEE!! RT @jennaldewan: WHOS WATCHING WITH ME???!! #WitchesofEastEnd Getting ready for my baby's #WitchesofEastEnd viewing party. Watch the finale with me and the whole fam tonight at 9pm on @lifetimetv! I mean, that’s a lot of medals, right? #TeamJoaquin #BookOfLife http://t.co/2KECaNN5xp #Nowplaying my friend @CalebLane_'s new EP Ashes to Earth on repeat. Check it out... http://t.co/wIzhDabdcf Haha first day of principal photography #MMXXL! http://t.co/yfnyRNbf4d To all my peeps in the LA area... Have you seen Bobby London? http://t.co/bgpzFOEVN4 Want a chance to be an extra in #MagicMikeXXL? Check out our #MagicMikeContest... http://t.co/0WrfOhU3OP\nhttps://t.co/l5rd4nxALK He's made of all that’s icky, but knows how to help a brother out! Check out @perlmutations as Xibalba in #BookOfLife http://t.co/pZAw4xjout RT @BookofLifeMovie: Only one month until @channingtatum steals our corazón in the #BookOfLife. Are you ready, señoritas? http://t.co/CAsGc… Want to spend some quality time w/ Jenko &amp; Schmidt? Pre-order #22JumpStreet on @iTunesMovies: http://t.co/cjV68dkdfs http://t.co/wF2torF8H2 In Vegas...plotting the revolution. Heehee Who wants in? #magicmikelive http://t.co/JhM50G8IKB RT @MarianneFromTO: #TIFF14 Selfie with @channingtatum for #Foxcatcher!!!!!  Thank you Channing!!! :) http://t.co/1EbTVpodXa RT @icecube: Pre-Order 22 JUMP STREET on Blu-ray w/ exclusive bonus disc only at @BestBuy http://t.co/WWeS59sV47 \n#22JumpStreet #DropGirl You don’t know the #DickGraze? It’s time to get educated... http://t.co/wiWK4LPqbX Thanks! RT @RWitherspoon: Blown away by movie Foxcatcher w/ @channingtatum #greatmovie #greatperformance #greatguy http://t.co/BRy4f74jgJ Check out this cool new comedy pilot #RedOaks from my #MagicMike buds Steven Soderbergh &amp; Greg Jacobs! http://t.co/F0ou15cUDB .@CungLe185 weigh in. Ready for battle! #TeamCungLe #TheStormsComing http://t.co/q8VtDiYkkM In Macao to support my boy @CungLe185!! http://t.co/DL4JNZPtn6 #TeamCungLe #TheStormsComing #UFCFightNight48 #ALSIceBucketChallenge accepted by me and @jennaldewan! (Donating too!)\nhttps://t.co/RcTBUSBWER RT @jennaldewan: Chan just said and I quote: \"please someone kill that avatar leaf wearing mothaf**ka now, I'm officially over it\" haha #Wi… .@TheRock It's on my brother. Just gonna have to find a bigger bucket than the little guy you used. Ha RT @NBCBearGrylls: It's safe to say @ChanningTatum earned his Commando Badge on last night's #RunningWild. \n\nWatch the episode here: http:/… A comedic genius who will inspire entertainers for many generations to come. You will be missed. #RIPRobinWilliams RT @NBCBearGrylls: Who's hungry for rattlesnake!? #RunningWild http://t.co/KIpi4sFmxM Always good to see the NOLA fam. RT @sandsnola: The boss is back in town! Thanks for coming by @channingtatum! http://t.co/SkT3t9rAHo When you're #RunningWild with @BearGrylls, it's all about the #posingeagle... http://t.co/EmV1QOFBz3 RT @NBCBearGrylls: 10-feet tall and bullet proof. @ChanningTatum is a little star struck by @BearGrylls. http://t.co/gRUe53ZDp0  #RunningWi… IT'S JOAQUIN TIME! RT http://t.co/ZnAqYxzYdt and you could win a signed #BookOfLife photo. #sweepstakes http://t.co/wJnhfixMEo RT @20thcenturyfox: RT http://t.co/vGsAYnwzys &amp; you could win a signed Joaquin photo from @channingtatum! #BookOfLife #sweepstakes http://t… #RunningWild with @BearGrylls was unforgettable! Check out a preview for Monday's show: http://t.co/eue8aOjOvY http://t.co/UD4Vmd47tF Can't wait! RT @CungLe185: 3 weeks out from @ufc #UFCFIGHTNIGHT48 at  @VenetianMacao Don't miss it! #TheStormsComing http://t.co/vzk95P21Md RT @MTV: Are you as excited as I am to see @BookofLifeMovie with @ChanningTatum? http://t.co/YlhEfuwcPF Catch the #FandomAwards tonight on @MTV. @diegoluna_ and I share a sneak peek at @BookofLifeMovie! http://t.co/tzxKVX2cR7 Check out the show 8/11! Thanks for an incredible adventure Bear! RT @BearGrylls: best team ever... @NBCBearGrylls http://t.co/Fc0ABwob5Z RT @20thcenturyfox: So @channingtatum and the cast of #BookOfLife were at #SDCC yesterday. And then @BizMarkie stopped by...\nhttps://t.co/R… .@BizMarkie brought down the house at @20thCenturyFox's #BookofLifeSDCC panel! Yooooooouuuuu got what I neeeeeeeed…\nhttps://t.co/cWxXVEAsfo Oh baby yooooouuuu... RT @bizmarkie: Just left #ComicCon w/ my boy @channingtatum we tore it down! @bookoflifemovie… http://t.co/1Y6l0F5Zhz RT @20thcenturyfox: Live backstage with #FoxMovies...right now @channingtatum is getting ready to take the stage in Hall H! http://t.co/9rc… RT @joshuahorowitz: Tomorrow's guests on the MTV Comic-Con livestream: Daniel Radcliffe, @channingtatum, @ThatKevinSmith @leepace &amp; TEEN WO… Taking my inner Joaquin to #SDCC tomorrow for #BookofLifeSDCC!Here's an exclusive 1st look at the movie's new poster. http://t.co/KwKmjsmxhO Ooooooh Freya be lying!!!!!! What were you thinking Killian!?!? RT @jennaldewan: My wife??!!!! Nooooooooooooooo 😥😥😥😥😥😥  #witchesofeastend @danielditomasso Grateful to the Kichwa &amp; Sapara people for sharing your beautiful traditions w/our #runatribe. http://t.co/hXxOikHjCN http://t.co/DYEPNF1N63 RT @jennaldewan: It's that day y'all!! witches Sunday!! This episode is soooo good can't wait for you to see!! #witchesofeastend Proud of you @JoeyKingActress! Congrats on @WIWHFilm! Watch @MarlonWayans @funniestwins tonight on @tbsveryfunny and don't miss their EPIC ROAST OF @rayj. RT @sonyclassics: ICYMI (but we hope you didn't): brand new teaser from FOXCATCHER, opening November 14 http://t.co/qheIGle2Ay Ready West Coast #WitchEEs?!? Getting my weekly witch fix. #WitchesofEastEnd Another year of love and light..couldn't ask for anything more. Thanks everyone for the anniversary wishes! http://t.co/NisICMQAGd RT @rachelboston: Don't look @channingtatum !  @jennaldewan is kissing @danielditomasso ;) http://t.co/7uo2rf22cl RT @rachelboston: Love from our Season 2 Premiere Party!!!! #WitchesOfEastEnd http://t.co/lrvbXJxazY Been a long wait, can't wait to watch the hottest witch I know on #WitchesofEastEnd tonight at 9pm. Land of the free. Home of the brave. Happy birthday America! RT @BearGrylls: @NBCBearGrylls season complete- @channingtatum you were amazing! Here's to living great adventures... http://t.co/rYW9KFqKcG RT @sonyclassics: .@PeopleMag has the first official poster from FOXCATCHER, featuring @channingtatum! http://t.co/NBoGnUhzuj \"@ChanningTatum and @JennalDewan Tatum Caught in Three-way with Sasquatch in 7-11 Bathroom!\" would be a more accur… http://t.co/pSMuQAtchQ @RealKevinNash Thanks Nash! RT @chrizmillr: Fitting that #22JumpStreet has an 85% fresh on Rotten Tomatoes-- the exact same score #21JumpStreet has.  EXACTLY THE SAME. RT @NBCBearGrylls: Grab your gear because we're #RunningWild with @BearGrylls Monday, July 28 at 8/7c. :-) RT @SandSNOLA: Happy #FathersDay to Chan's dad, Glenn, and to all the other fathers too from #SaintsandSinners! http://t.co/6FlpIHpSyU RT @NHL: .@BaileyLAKings and @ChanningTatum starting a new rally trend? #BecauseItsTheCup http://t.co/nOtBsFNryf @SonyPicturesID Thanks for the support, Indonesia! #22JumpStreet is #1 in your cinemas, go see it today! RT @KellisKupcakes: Go see #22JumpStreet tonight!! You'll never laugh harder! @JumpStMovies @channingtatum @JonahHill #iceluge http://t.co/… Go see #22JumpStreet because Captain Dickson says so! http://t.co/JatK2APUgm RT @BrynnHallPhoto: So excited pre purchased our tickets for #22JumpStreet cannot wait to see @channingtatum and @JonahHill. Watched 21jump… These guys killed it while @JonahHill and I were in the makeup trailer. Takes hours to look like me. #22JumpStreet\nhttps://t.co/DrnsmbZouW RT @RGIII: Enjoyed #22JumpStreet with my teammates today.(Comes out tomorrow) Always appreciate a good laugh @channingtatum @JonahHill 👍 RT @EW: The ultra-bromantic duo of @JonahHill and @ChanningTatum cuddle up for this week's cover: http://t.co/y9t5hYkifE http://t.co/ynLFnb… RT @GQMagazine: We're about to give our Twitter account to @ChanningTatum. You ready? RT @JumpStMovies: On the red carpet for the #22JumpStreet premiere with @channingtatum http://t.co/AqESkYBwy7 This premiere is crazy!!! #TurnDownForWhat #22JumpStreet http://t.co/RUZ9pf2M3a Before tonight's #22JumpStreet premiere, got the crew back together on @ComedyCentral's @midnight! http://t.co/7I9oF2Bwov Cases of this and crazy @JonahHill -- the only things getting me through these long #22JumpStreet press days. http://t.co/9OVcLZdC90 RT @TeamCoco: Backstage @ #CONAN: @JonahHill &amp; @ChanningTatum. MORE photos @ http://t.co/85JPJEzZdq http://t.co/3tvr2IUItk Jenko and Schmidt joined @TeamCoco. Tune in tonight! #22JumpStreet http://t.co/guf3Uu38zm Congrats on the win! RT @DaleJr: Enjoyed meeting these two today @poconoraceway. Thanks for comin out. #22JumpStreet http://t.co/4scvrkxe5Z .@NASCAR won't know what hit them. @JonahHill and I are heading to @poconoraceway for today’s big race. #22JumpStreet http://t.co/3OJwMtT0As Got to beat box with @theroots on @FallonTonight. One of the coolest days of my life! Thanks @jimmyfallon! http://t.co/h0iayyuh0Z I've been doing bicep curls all week. #ready RT @jimmyfallon: I'm arm-wrestling with @ChanningTatum on the show tonight! UK make sure you check out #22JumpStreet, at cinemas NOW! RT if you're going! Dreams do come true. @NASCAR race, fan Q&amp;A, and @JonahHill and I get to yell \"Drivers, start your engines\" at @poconoraceway this Sunday! Hanging out with two of my favorite people this morning. Found this in my dressing room. #tbt #22JumpStreet http://t.co/4uwcxL2n7m RT @GMA: So this happened in #SocialSquare....@RobinRoberts, @RajonRondo and @channingtatum we can't even begin to deal http://t.co/a3KrEl3… See you soon @RobinRoberts! #22JumpStreet http://t.co/5OIQnSYRcN RT @GMA: It's 8 am and we've got so much more for you: Tune in for @channingtatum, @RajonRondo, more with Spencer Christian, and @JLo! RT @KellyandMichael: Fun show today! Tune in for #22JumpStreet's @channingtatum, and a performance by @Chris_Daughtry!! #KellyandMichael And so it begins... http://t.co/IngMdaD2V1 #22JumpStreet RT @MarcusButler: Just finished a private screening of #22JumpStreet. Funniest film of the year by far. RT @eeisenberg: Very happy to report that 22 Jump Street is absolutely hilarious &amp; ridiculously smart. I once again must bow to the alter o… Happy birthday my angel! http://t.co/9PhvDmLqyP RT @drewbrees: Got a sneak preview of #22JumpStreet w the team. Filmed in Nola. Opens 6/13. @ChanningTatum &amp; @JonahHill ...hilarious http:/… Hey girl, let me introduce you to my friend Joaquin... http://t.co/tju4oZoh1f #BookOfLife http://t.co/JoJy28HpN1 We're baaaaack...June 13th! In the meantime, check out our new #NSFW #22JumpStreet red band spot: http://t.co/GcssquAD1c RT @jennaldewan: \"Love recognizes no barriers. It jumps hurdles, leaps fences, penetrates walls to arrive at its destination full of hope.\"… “The cost of freedom is always high, but Americans have always paid it.\" - John F. Kennedy #MemorialDay @tpolamalu Thanks Troy! RT @tpolamalu: Great show last night. @JonahHill and @ChanningTatum nailed it with this one again. Good time with friends and family http:/… Yeessss! Congrats Bennett! RT @FdC_officiel: PRIX DE MISE EN SCENE//AWARD FOR BEST DIRECTOR #Cannes2014 – #BennettMiller with FOXCATCHER RT @meganeellison: We caught the fox RT @bbccouk: Joining @grahnort on @TheGNShow tonight: @JonahHill @channingtatum and the one and only Dame Julie Andrews http://t.co/pa38AZd… In London with @jonahhill for today’s live #22jumpstreet Twitter Q&amp;A. Kicks off at 2:30pm BST, so keep the #AskJumpStreet questions coming! Taking over @SonyPicturesUK's Twitter tomorrow with @JonahHill. Have a question for Jenko or Schmidt? Tweet them with #AskJumpStreet. An unforgettable night. #Foxcatcher #Cannes2014 http://t.co/WaGOwIRYSY Honored to be a part of Team Foxcatcher. RT @sonyclassics: Not in Cannes for premiere? We've got 1st official teaser! http://t.co/kkXPzExY4l @chrizmillr Clearly! RT @MarkRuffalo: Photo: @cannesfilmfestival , @channingtatum @stevecarell Bennett Miller, Megan Ellison. http://t.co/wPtT8yBJA8 RT @EW: As you wait in anticipation for 'Foxcatcher,' watch this new clip: http://t.co/gHRmBAV9TJ Support @jklivinFNDN &amp; @DrewBrees FDN by bidding now to meet up @ the #22JumpStreet premiere and attend afterparty! http://t.co/Sh2cN1L8N7 Proud of the two wonderful moms in my life -- my own and my beautiful wife @jennaldewan! Happy Mother's Day! RT @JumpStMovies: Run into Schmidt &amp; Jenko at the theater? Snap a selfie &amp; post using #22JumpStreet for a chance to be Fan of the Week! htt… Getting my mental game in check. #Nowreading my friend's book 'The Art of Mental Training’. http://t.co/IiGj7mI6DN Help my friend @EricTWang raise #awareness for #myotonicdystrophy. RETWEET &amp; LIKE his video. Only 1 day left to vote: http://t.co/eKJ7pXtNnZ Thanks for all the birthday love! RT @jennaldewan: Got caught in LA traffic, but we made it! #mtv #MovieAwards http://t.co/3VZmE0M4N5 RT @MTVNews: We learn how truly terrible @channingtatum is at Mexican accents in this #22JumpStreet clip! Watch: http://t.co/v8VrkiUOTu #Mo… RT @joshuahorowitz: Tomorrow our MOVIE AWARDS TAKEOVER continues on MTV all day long w/22 JUMP STREET! I'll be w/@channingtatum @JonahHill … New #22JumpStreet poster for you &amp; watch @JonahHill and I debut a new red band trailer on @JimmyKimmelLive April 9th! http://t.co/gW0iecVyVp RT @preyes1992: \"You some Justin Bieber-Miley Cyrus looking mother f**kers!!\" @icecube @channingtatum @JonahHill \n😂😆 #21jumpstreet ready fo… Quick stop in Vegas today with Mila for #JupiterAscending's #CinemaCon presentation... http://t.co/ykTB7KX5VM RT @wbpictures: This July, the battle for our world begins with her. New trailer for #JupiterAscending: http://t.co/G5XZpvWfuZ @ChanningTat… RT @wbpictures: New banner featuring @ChanningTatum in #JupiterAscending. Stay tuned for the new trailer today at 4:30pm PT! http://t.co/Mx… RT @JumpStMovies: Don't get pinched this St. Patrick's Day. Wear green. Happy St. Patrick's Day! http://t.co/oKw10fo1ng \"Be kind whenever possible. It is always possible.\" - @DalaiLama RT @jennaldewan: I am so honored to work with @humanesociety to help end needless animal testing. Please help me make this change!!!  http:… RT @fifiblue4: I just watched the trailers for 22 jump street and it's killing me I can wait until it comes out on June 13, 2014 @channingt… RT @corinnefoxx: Thanks @TheEllenShow haha we were actually starving!!! #pizza #oscars http://t.co/yXxfmNseNk RT @TheEllenShow: If only Bradley's arm was longer. Best photo ever. #oscars http://t.co/C9U5NOtGap RT @TheEllenShow: If only Bradley's arm was longer. Best photo ever. #oscars http://t.co/C9U5NOtGap RT @jennaldewan: It's the #oscars!!!!! http://t.co/nEMfiq6c6l RT @TheAcademy: Backstage at the #Oscars in the #ArchDigestGreenRoom with @ChanningTatum and @JennaLDewan http://t.co/hKVqIMCHzl RT @TheAcademy: Backstage at the #Oscars in the #ArchDigestGreenRoom with @channingtatum http://t.co/ZG8kXJLmuq RT @jennaldewan: Us Weekly's Paparazzi Policy: A Letter From the Editor http://t.co/mwNPv07oUn RT @theacademy: Magic Mike's @channingtatum with Team Oscar during #Oscars rehearsals this morning. @ Dolby Theatre http://t.co/G3TFrGgQ0S RT @jennaldewan: Thank you @JaredEng!!!!! ❤️❤️ RT @JustJared: Just Jared Joins Fight Against Paparazzi Photos of Kids http://t.co/wTaoeaBmR… RT @jennaldewan: Dear @peoplemag you are absolutely amazing, @channingtatum and I thank you so much for this!! http://t.co/YTMABqCzP3 See you soon! RT @TheAcademy: Welcome to Hollywood, Team Oscar winners! http://t.co/ijGqD2KplZ RT @TheAcademy: Thrilled that @KevinSpacey @channingtatum @jasonsudeikis &amp; @mcgregor_ewan will be presenting at the #Oscars on Sunday http:… RT @jennaldewan: RT @TheEllenShow: Thanks @DaxShepard1 and @IMKristenBell. It's time for things to change. Be kind to one another. http://t… RT @ETonlineAlert: Will you join the fight? See how @IMKristenBell &amp; @daxshepard1 stand up against the \"pedorazzi\": http://t.co/ifHaZBAheC RT @JumpStMovies: Schmidt and Jenko return in the #22JS green band trailer with an alternate ending!  #22JumpStreet http://t.co/14lRoHnsnJ @jimmyfallon Congrats Jimmy! Slow clap for #twitterless Matt Damon's cheeky @BenAffleck &amp; @jimmykimmel fax! http://t.co/pQwTk91cxp @EasternCongo @Water #FaxingMattDamon What better way to start writing #MagicMike2 than with my old friend Dallas? #runatribe http://t.co/RalS3nQfro @FashionistaB3 Hi Alicia! @kurtzhurts and I wanted to wish you Happy Birthday! RT @TheLEGOMovie: We are so pumped UP! #TheLEGOMovie is #nowplaying! http://t.co/4T5RILqCgk http://t.co/srEUNRJr6K RT @variety: Channing Tatum and the Academy unveil \"Team Oscar\" | http://t.co/PZP8LoQVKK The creative world has a bright future. Honored to announce 6 new members of #TeamOscar on @TheEllenShow tomorrow. http://t.co/dRgcyEQOS9 RT @davekarger: Didn't think I'd be saying this but I absolutely LOVED @TheLEGOMovie. Perhaps the funniest animated film I've ever seen. Do… RT @JumpStMovies: We paid a lot of money for this --&gt; 22-0 #MostExpensiveBigGameAdEver #22JS #SB48 http://t.co/PMKOvTgP8R I was reading this article on the @HuffingtonPost, and I thought you might be interested in reading it too... http://t.co/6QnDOtzrYT Unbelievable talent. The creative community has lost a true acting genius. RIP Philip Seymour Hoffman RT @TheLEGOMovie: #TheLEGOMovie soars into theaters in one week! #Superman @ChanningTatum http://t.co/PdaqKNiChC RT @UnwrappedPhotos: Watch as @ChanningTatum's \"Superman\" gets into a sticky situation in a hilarious new TV spot for @TheLEGOMovie! http:/… .@JumpStMovies is coming back for round two in June! Check out Jenko and Schmidt in the new #22JS poster... http://t.co/udkeddaDo6 Congrats Maddie! Good luck to you and everyone headed to Sochi. #GoTeamUSA RT @maddiebowman: X Games gold!! http://t.co/xKetZUkr46 RT @hmvtweets: #WhiteHouseDown hits DVD shelves today, here's our preview and interview with @channingtatum and Jamie Foxx: http://t.co/9Gb… \"Darkness cannot drive out darkness; only light can do that. Hate cannot drive out hate; only love can do that.\" - Martin Luther King, Jr. Love kids and animals as much as @jennaldewan and I do? Here's how you can support the programs at @GentleBarn... http://t.co/JH9awwoUya Want to say congrats to @JonahHill and @McConaughey on their well-deserved Oscars nominations! RT @goldenglobes: .@channingtatum backstge http://t.co/H6FHfuitaZ RT @JumpStMovies: See @JonahHill and @ChanningTatum tonight at the @GoldenGlobes as presenters at 8pm ET/ 5pm PT! RT @goldenglobes: Post your #AskGlobes @Instagram VIDEO questions and your favorite stars will respond on the #GoldenGlobes Red Carpet! htt… RT @goldenglobes: The HFPA announces Channing Tatum (@channingtatum) as a presenter at the 71st Annual @GoldenGlobes! (via @TheInsider) htt… .@hitrecordjoe proves the power of one with #HITRECORDonTV. Check out the first episode... http://t.co/gv5uLenA4E Congrats Joe! RT @TheLEGOMovie: Go out and be super, like this guy. #Superman #TheLEGOMovie @ChanningTatum http://t.co/Jc46spLWER I'm headed to Springfield! Catch my guest-voice appearance on @TheSimpsons this SUN at 8/7c on @FOXTV! #TheSimpsons http://t.co/pGJnFHO6N9 RT @UnwrappedPhotos: College filmmakers, don't miss out on #TeamOscar! Here's your opportunity to appear on @TheAcademy Awards... http://t.… Happy New Year! Carpe diem -- make 2014 your year. Merry Christmas! I hope your day is filled with love...a gift that costs nothing, but means everything. Happy birthday to my road dog @JonahHill! RT @jennaldewan: My friend @OdetteAnnable 's aunt needs a kidney, check out this link to read how 2 help her &amp; others please! RT!!! http://… Just wrapped with the #22JumpStreet crew, but we've already got a red band trailer for ya! Check it out... http://t.co/6XCmTkG5JP RT @wbpictures: Expand your universe. Exclusive trailer for #JupiterAscending starring @ChanningTatum and Mila Kunis @iTunesTrailers: http:… RT @IamLaurenMiller: Ever wanted your own director's chair signed by @JonahHill and @channingtatum from #22JumpStreet? http://t.co/VTY1cCGh… “To be free is not merely to cast off one’s chains, but to live in a way that respects and enhances the freedom of others.” - Nelson Mandela RT @SandSNOLA: Our new #NOLA reality project got a shout out along with @kurtzhurts in a recent @ChanningTatum interview w/@ExtraTV! http:/… This kid... I swear I've never seen anything like it! #GoTitus http://t.co/65cbdupjLl My buddy @Kurtzhurts &amp; I are looking for the hottest dancers for a new dance troupe at @SandSNOLA. Are u interested? http://t.co/fThCJfMyVk RT @jennaldewan: Dec 1 is #WorldAIDSDay. DANCE @RED SAVE LIVES. Buy the album. Watch the livestream. #danceRED  http://t.co/LyRMjhSd1c Happy Thanksgiving! Thankful for so much in my life, most of all, my family and my friends. What are you giving thanks for today? Me &amp; @JonahHill will do a shot of Jack for every million views this video gets by the last day of production. DEC 15. http://t.co/FoxhZl3Pmt This stunt was preformed by unprofessionals... http://t.co/PyTPuBKa8W Well, this just arrived... http://t.co/Ojg7aIEZUO Think I might have peed a little out excitement. RT @TLC: Tonight, we're honoring the 50th anniversary of President Kennedy's death in #LettersToJackie @ 9/8c. http://t.co/DDsWACBN19 Youth w/ a passion for filmmaking inspire me &amp; we want to shine a spotlight on you. Excited to announce #TeamOscar... http://t.co/NM4kuOoYv3 Typhoon #Haiyan devastated the Philippines. Millions need food &amp; shelter. Text REDCROSS to 90999 to donate $10. GIVE: http://t.co/ruTCiuoKmn One bad man. Ready to bring the pain! http://t.co/5KWaExRqCw #22jumpstreet Today and everyday, we honor all who serve and thank you for your sacrifice. Happy Veterans Day! - #TeamTatum http://t.co/e8UlW45XZV RT @21jumpstmovie: Friend JumpStreetMovie on @Snapchat for exclusive snaps from the set of #22JumpStreet! http://t.co/t8e2lrAeV5 Watch this hot witch with me tonight on @LifetimeTV at 9pm CT. http://t.co/IAPAA5pJRf Thanks to all the fans who entered our @WHD giveaway! Here's all twenty of the winners: http://t.co/rPnjLpCuKo - #TeamTatum I love these minimal houses... http://t.co/mAoV2Yh7B8 Found these little facts interesting... http://t.co/qAihWoomdM RETWEET for a chance to win a signed @WHD poster, copy of the new Blu-ray/DVD, or #ChanningAllOverYourTatum shirt! http://t.co/eY55oS74mY RT @WHD: Ready to relive the action-packed and intensely adventurous ride #WHD? Get it NOW on Blu-ray Combo Pack &amp; DVD! #WHD http://t.co/mZ… So proud of my wifey and her witches!! http://t.co/xEud1IF5xU #witchesofeastend TV date with @jennaldewan and the sexy witches on #WitchesofEastEnd tonight. @Lifetime 9pm CT. #witchinghourisalmosthere #watchwithus We hit another huge milestone on @Facebook today. Thanks to all 8 million of you for showing the social love! http://t.co/S2SQWjYRUx RT @jennaldewan: Is that you @channingtatum??  http://t.co/EjgZJZrc7K Happy Halloween! Huge fan of “Where the Wild Things Are”, so I made this a few years ago. http://t.co/SbXXiW9TQQ #TBT RT @NICKZANO: Ted, Andrew &amp; I bringing #NICKY to life http://t.co/HykNkdQyz9 RT @TheLEGOMovie: The one and only! #Batman http://t.co/lVBipfKSNN @arnettwill #TheLEGOMovie RT @SandSNOLA: We're getting a reality show, produced by @ChanningTatum! Ready to check out the behind the scenes of S&amp;S on @AETV? http://t… RT @BrandonMcKay6: Just had to land on #21jumpstreet when blindly picking a movie!! Haha! Love this! Can't wait for #22JumpStreet @JonahHil… RT @jennaldewan: Just did! He luvs it RT @Janetmar11:Does @channingtatum watch #WitchesOfEastEnd with you?And if he does what does he think… I belieeeeve I can fly... http://t.co/MaX3ludP4h #22JumpStreet RT @WHD: Action-packed &amp; explosive. White House Down w/ @channingtatum &amp; @iamjamiefoxx is available NOW on @itunesmovies! http://t.co/IhzN5… http://t.co/VjTtyT7qkN #22JumpStreet RT @variety: Channing Tatum, Nick Zano Team for CBS Comedy http://t.co/RpYNlyvLst cc: @channingtatum RT @rolandemmerich: We raised 2.9 Million for @LAGayCenter! @UncleRUSH @janemarielynch @channingtatum http://t.co/Zn5OCHO1KV #saveLGBTyouth… Sorry I couldn't be there, but thanks to everyone who supported the @LAGayCenter last night! http://t.co/FitrY0RIEL #saveLGBTyouth Had some of the best fried chicken I've had in a long while here. And that's saying something... http://t.co/rsD2TgEoNs Help provide hope and awareness for thousands of homeless and abandoned LGBT youth. Please watch, support &amp; forward: http://t.co/qofRiSWQ7w RT @luvalottatatum: Hanging with @channingtatum at @SandSNOLA  #Best.Night.Ever http://t.co/9sWgJKzace RT @thr: EXCLUSIVE: Channing Tatum, Zoe Saldana to Voicestar in Animated 'Book of Life' http://t.co/jmCXfyF3oW RT @rolandemmerich: Come spend the evening with me and my friends, @channingtatum @janemarielynch @LAGayCenter http://t.co/Vbz4Yo1ZAA RT ht… RT @jennaldewan: Excited to share my @SELFmagazine cover with you guys! Out next week! http://t.co/ut4aDXOXhr RT @jennaldewan: Let's celebrate #SpellbindingSunday w/ another #WitchesofEastEnd live tweet tonight! Tune in &amp; tweet w/ me at 10pm ET! #Wi… One strapin', two strapin', I'm strapin' up after 14 years. F#*% I'm getting old. http://t.co/uHnWHYenUh #22jumpstreet Thanks for all the love! RT @mtv: Our #WeHeartChanning marathon starts NOW! RT if you heart @channingtatum too! Jenko &amp; Schmidt at the #21Jumpstreet premiere, aka the only press event we didn't wear our bicycle cop uniforms. http://t.co/cUbvEf2Ttv #tbt This is incredible! http://t.co/g1sG0DwwTR I wish I knew the tech side of this. I would live to do a version. Read this y'all. Think about it. http://t.co/nDnKAMShm2 \nMy family heirloom, I think, is my family's stories. What's yours? This blew my mind. Made me ask myself...What am I doing for my country at my age? Not nearly enough. http://t.co/KlexcbKVaX Back down on Jump Street chillin with my boy Korean Jesus!! http://t.co/Vs8XycXxHj #22jumpstreet Tonight's the night! http://t.co/1m2JXouSgm #WitchingHourIsComing #WitchesofEastEnd Always a good day when Lulu hangs out on #set. http://t.co/83i0W4GbVp #22jumpstreet Party at Franco’s house! This Is The End is out now on Blu-ray and DVD. RT @rolandemmerich: The only time the White House should be Down is fictitiously. #USGovtShutDown @WHD RT @jennaldewan: Seester love! RT @ETonlineAlert: .@WitchesEastEnd Exclusive Clip: Watch @rachelboston @jennaldewan work their magic! http:… And so it begins... http://t.co/spsOe8Qyck #22JumpStreet #Day1 RT @ElleZilla: Just found out about #22JumpStreet so I'll be spending most of my time prepping for multiple eye/ear/laugh-gasms @JonahHill … Had fun hanging out with the #22JumpStreet crew at @sandsnola last night! http://t.co/lBrdBbmvwz #latergram Catch me &amp; #AnneHathaway's cameos in this exclusive clip from #DonJon, written &amp; directed by my friend @HitRECordJoe! http://t.co/u7ToeiYLgc Had a lot of fun in this uniform. http://t.co/hHPk4lLM5L Almost time for me and @JonahHill to suit up again. #fbf #22jumpstreet RT @CamKhan: Just watched #WhiteHouseDown!! @channingtatum and @iamjamiefoxx  killed it! Intense from start to finish! One of the best movi… @SonyPictures_es Don’t miss #AsaltoAlPoder, in cinemas this weekend! http://t.co/hiqjgZ5B0r @SonyPicturesUK Hey UK! Ready for #WhiteHouseDown? Don’t miss out and watch our new movie, coming to cinemas this Friday, September 13th! \"You can be sure that the American spirit will prevail over this tragedy.\" - Colin Powell #NeverForget Join in the fight... http://t.co/jXN8sHQeHW #CharityTuesday Thanks Twitterverse for the follows! 5 Million strong and grateful for all of you. RT @Sethrogen: This Is The End is coming back to theaters this weekend!!! If you missed it, or were too baked to remember it, see it this w… RT @HollywoodLife: Exclusive first look: @EricWinter1 &amp; @JennaLDewan heat up Lifetime's new series @WitchesEastEnd! http://t.co/QoNcxtZ9ch … Shout out to @ChattyMan's @AlanCarr! Great way to end the #WHDTour w/ @Iamjamiefoxx. UK tune in 9/6 on C4 at 10pm! http://t.co/jeWopjTDkA @SonyPicturesMx Hola Mexico! Don’t miss all the action in #LaCaídaDeLaCasaBlanca, starting tomorrow in your cinemas! He may only be 2, but this kid's got game! Had fun playing a little b-ball w/ Titus on @El_Hormiguero today. http://t.co/UaEd8RevYn #whdtour @SonyPicturesAUS AUSTRALIA! #WhiteHouseDown’s in your cinemas TODAY! Watch the AFL this Sat night on @Channel7 for a chance to win 20K cash! RT @sonyclassics: FIRST LOOK at @channingtatum and Mark Ruffalo in Bennett Miller's FOXCATCHER! @Mruff221 http://t.co/NW7CZFpoPL @SPE_LatinAM Hello friends in Latin America! Ready for the action you’ll see in #WhiteHouseDown? Don’t miss it in theaters soon. RT @iamjamiefoxx: #WHD Berlin premiere. Jamie Foxx, @channingtatum &amp; Michael Douglas. Can anyone say next big blockbuster? #whdtour  http:/… Great crowd at @WHD's Berlin premiere tonight! Thanks to everyone who hung out with us on the red carpet... http://t.co/lNlT7Y6krh #whdtour Wrapped up in France &amp; headed to the Berlin premiere w/ the @WHD crew. Hope you guys have a great Labor Day! http://t.co/gvBiTOCo7G #whdtour RT @CraveOnline: EXCLUSIVE: @WhiteHouseDown Blu-ray announced for 11/5. High-def cover art and special features only at @CraveOnline. http:… Throwing it back to #MagicMike's @todayshow flash mob with @joemanganiello. Watch how it all went down… http://t.co/I0YSFcFNiT #tbt Who wants to see a Magic Mike Vegas show? http://t.co/y2Q0xbkk6O RT @PaolaVidalr: @channingtatum JENKOO IS BACK! :-) RT @s_nicole017: The fact that @channingtatum just posted a picture on ig of the script for 22 Jump Street makes my heart happy. You ready for round 2?  http://t.co/VFOdcZKguB #22JumpStreet RT @UnwrappedPhotos: Need a laugh? Read these... http://t.co/Xl33mBtr5u What are your favorite #21JumpStreet lines? #FUScience http://t.co/… \"Whatever you can do, or dream you can, begin it.  Boldness has genius, power and magic in it.\" – Johann Wolfgang von Goethe RT @rolandemmerich: The @WHD European press tour is right around the corner. It'll be great to see these guys again. #FBF… http://t.co/R78o… RT @colliderfrosty: Breaking: @sonyclassics just announced they will distribute Bennett Miller’s #FOXCATCHER in North America. Happy Birthday Mila! Working, so I couldn't attend #TeenChoice this year, but wanted to thank all who voted and helped me win Choice Summer Movie Star for @WHD! Thanks to Sophie K. and all the fans who are posting your #fanart! http://t.co/UR47lLFWGr From DC to Miami, New York and LA...Celebrating #tbt with a few #WHDtour memories. http://t.co/EXlMVNFGTN cc: @iamjamiefoxx @JoeyKingActress Met @BigOldWalk. Cool guys doing great things. Wish I could do what they're doing. Follow their incredible journey... http://t.co/sEfsBhBisD This makes me smile. RT @qfromctu: The most beautiful social media trend I've seen...EVER! http://t.co/dGV341aU0t “Walk away from anything or anyone who takes away from your joy. Life is too short to put up with fools.” – Unknown http://t.co/fLyFt3muPw Help my friends at @BoysGirlsClubBB because #greatfuturesstarthere! Donate $1 today to help kids be ready for school: http://t.co/d3OXZDRfuf RT @LAFund: #ArtsMatter: A Twitter #trend &amp; crusade backed by @ChanningTatum, @ToryBurch &amp; other creatives http://t.co/ghtQEJFLaS http://t.… #ArtsMatter to me because they gave me a creative outlet.Inspire others to join the @LAFund in bringing #ArtsEd back: http://t.co/oH7aPDAUW7 #MagicMikeTheMusical is headed to Broadway... http://t.co/QR5XOKFXjS RT @wbpictures: New @TheLEGOMovie casting news from #SDCC! @ChanningTatum to voice #LEGO #Superman, @JonahHill #GreenLantern &amp; @CobieSmulde… You can share this one... RT @futuremrs_cern: Wish i could retweet an IG @channingtatum  #bostonstrong http://t.co/QQLNXbmzWb RT @johnkrasinski: “@channingtatum: #BostonStrong http://t.co/iWJG6yRmyY”-- #Howitshouldhavebeen #BostonStrong http://t.co/iWJG6yRmyY RT @WHD: #WhiteHouseDown snagged FOUR #TeenChoiceAwards noms! For more info and to cast your votes: http://t.co/2B9eueWXKz http://t.co/w2F9… @SonyPicturesRU What’s up Russia! Check out the action in #WhiteHouseDown in cinemas July 18th. RT @JoeyKingActress: Got to work with one of the most \"playful\" action heroes around!! @channingtatum on the set of @WHD #fbf http://t.co/q… RT @JoeyKingActress: Behind the scenes of @WHD with my awesome movie dad @channingtatum http://t.co/IqiOZwm7lB Ditto ;-) RT @jennaldewan: Aww thanks guys for all the anniversary love! Think I'll keep him;) #itsrainingmen http://t.co/EYlodZyGBT RT @hitRECordJoe: EXCITING NEWS!  Tix just went on-sale for our biggest @hitRECord show of the season!  Aug 10 at LA's ORPHEUM:  http://t.c… RT @Fichardtj: Holy crap White House Down was good!!!!one of the best movies ive seen in a long time!big up @channingtatum and jamie fox #photooftheday #instagood #fanencounter http://t.co/ruEZeZKefK \"You're right by the way...these things actually work.\" - #ShesTheMan Shout out to everybody who's watching @MTV and tweeting right now! @elizabethlam333 @iNCREDiPiNOY @Unicorn29April Congrats on winning! Please DM your full name, mailing address &amp; phone number to @qfromctu. Congrats to @elizabethlam333 @iNCREDiPiNOY and @Unicorn29April on winning signed @WHD posters! Thanks to all 17K of you who entered! RT @hitRECordJoe: RT @CharlesDiAngelo: \"White House Down looks pretty cool!”\n\nChan + Foxx + Roland Emmerich = good times Thanks! RT @unbrokenmari: Good morning @channingtatum I'm voting for you every day on the TCA xD http://t.co/0sV6DRbGwW I recall TRex making multiple strikes. RT @joeykingactress: TRex is bad at bowling #shortarms RT @channingtatum: A fun night on the lanes... Announcing signed #WHD poster winners tomorrow, so make sure you get your entry in by retweeting this post ===&gt;&gt;&gt; http://t.co/sGqAwWkFIE A fun night on the lanes with @JoeyKingActress #UnicornVsTRex #whdtour #fbf http://t.co/yGmcFNv5OC Happy 4th of July everybody, hope you have a safe and fun day with family and friends. RT @iRyanAmoudi: People. You MUST WATCH #WhiteHouseDown It's So damn EPIC!! @channingtatum @iamjamiefoxx Did a Really Good Job on It!! RT @sabrinasuffi: You showed me yours now I'm showing you mine @channingtatum!! #WhiteHouseDown ♥♥ http://t.co/tTZoKOSSqm RT @WHD: Active Military and Veterans Invited to Celebrate July 4 with Free Admission to #WhiteHouseDown: http://t.co/k652XZiN2n Announcing winners soon! http://t.co/sGqAwWkFIE RT @sandralouise87: @channingtatum @WHD When do we find out who won a poster?? #Excited #WHD @ColumbiaPicPH Mabuhay, Philippines! Go and see White House Down in cinemas July 3! #WHD RT @KaseyLaughsAlot: To anyone who hasn't seen #WhiteHouseDown go see it Now. Like now. Idc what you are doing , go watch it now. @channing… Signed a few @WHD posters for you guys. All you have to do is RETWEET for a chance to win! http://t.co/2IVAMc0FS4 RT @queen_liz121: @channingtatum show me yours ill show you mine! Such a good movie! #WHD http://t.co/kaBj4Oz8OP I got some Channing for your Tatum! Thanks to the fan who created this... http://t.co/bvtr17kv3J @SonyPicturesKR KOREA!!  #WhiteHouseDown is in theaters now! Don't miss it! Love you all! RT @106andpark: DID U MISS @janellemonae, @mindlessbhavior, @channingtatum, @iamjamiefoxx, @jasonderulo on #106atBETExperience? {vid} http:… RT @drewporrett: Funny, suspenseful, thrilling, awesome, tearful, exciting, amazing, and adventurous #WhiteHouseDown RT @DanaBean12: You showed me yours now I'm showing you mine #WhiteHouseDown  @channingtatum http://t.co/WvNdAyAt3u RT @CherylForsyth: @channingtatum @iamjamiefoxx LOVED #WHD! Already bought tickets to see it again tmw. #BestSummerMovie http://t.co/2tIOZF… Menaces to society on @106andpark...http://t.co/LEsY439bA9 #WHD #whdtour #thatsawrap Got to love a good hug... RT @katelyn_topping: @channingtatum doesn't look like she's letting go anytime soon.. http://t.co/r2Zcg1yepO RT @angelicam2009: Saw #WHD today @channingtatum \n@iamjamiefoxx. Fantastic movie! http://t.co/Zh7w1hleED RT @YahooMovies: #WhiteHouseDown Insider Access: @channingtatum &amp; @iamjamiefoxx talk secret handshakes &amp; tank top envy: http://t.co/3Pb5Apt… RT @jennaldewan: Tonight's the night! If u like to have fun while watching all around great movies,then go see White House Down!!I loved it… RT @106andpark: #106atBETExperience, live in LA: @JasonDerulo, @MarlonWayans, @MaliMusic, @JamieFoxx, @ChanningTatum and...@MindlessBhavior… RT @realness015: @channingtatum LOVED this movie!!! Great action with some comedy! #WHD http://t.co/rKOHsUTFUg Happy birthday! ;-) RT @kerrieg84: Thinks it's very nice of @channingtatum to release #Whitehousedown on my birthday. What a nice fellow ;) RT @natmasoud: @channingtatum @WHD here's mine! Such a great movie! http://t.co/LZjHg0twoO RT @annahartcollins: Still in awe of that movie! By far the best action movie I have EVER seen! #welldone #WhiteHouseDown RT @pmahesa: #WhiteHouseDown just soared to be the best pure action flick this summer. A tie with #FastFurious6. Explosively awesome! RT @_kelsey_cole: That was seriously the best movie EVER! I highly recommend!! #merica #WhiteHouseDown \n🇺🇸 RT @crayolabrown92: White House Down was so bomb! #bestmoviethisyear #action #greatplotline Love @channingtatum http://t.co/nFFmMWvHxa RT @rosy_medy80: @channingtatum hi channing! I'll show u mine http://t.co/0X4gi1L7id Show me yours and I'll show you mine. Check out @WHD in theaters tonight! #WHDtour #WhiteHouseDown http://t.co/Md9MEhVpFi RT @WHD: Find out what happens when @channingtatum and @iamjamiefoxx enter the @MTV safe house w/ @MTVronnie &amp; @themarklong! http://t.co/CJ… Ready for @chelsealately. You like? http://t.co/Kbncdtn8Pl Thanks! RT @willswilley: @channingtatum just bought my ticket for tonight's release of White House Down. Very excited for it. See you at @106andPark! RT @marlonlwayans: Photo: Me and @channingtatum buddy cops? View more Marlon Wayans on WhoSay http://t.co/okilS1xZfM ;-) RT @mgyllenhaal: Oooops...my husband just Sarsgaarded all over my Gyllenhaal @channingtatum @iamjamiefoxx http://t.co/tCHFcIZBzD #WHD There's a little #ChanningAllOverYourTatum on @JimmyKimmelLive tonight! #WHD #whdtour http://t.co/uwbotc4g4f RT @THR: THR COVER: Channing Tatum, Jamie Foxx and 'White House Down's' Superhero-Free Summer Gamble http://t.co/wwWl8bA5ln RT @TheJetOnTNT: My man @iamjamiefoxx and @channingtatum did there thing! Thanks for lettin @kaylabriannax and @MrsGwennieSmith have the pr… Congrats to beyoustaytrue on winning tickets to tonight's #premiere and thanks for waiting outside… http://t.co/Jqdyhe2sMZ Headed to the Zeigfield. #WHD #WHDtour #premiere http://t.co/NAlADkZSCq Check out the #LateShow tonight! http://t.co/DZKUOY8gqU RT @iamjamiefoxx: This is correct my friend. #WHD RT @PerezHilton @iamjamiefoxx Channing Tatum + Jamie Foxx Are Answering UR Questions! htt… RT @LateShow: TONIGHT: Dave welcomes @ChanningTatum, Tim @DeChristopher (@bidder70film), and musical guest @FitzAndTantrums. I'm giving away 2 tickets to tonight’s @WHD premiere in NYC, so I’m throwing a #WHDinstameet at the Ziegfeld Theatre! http://t.co/naSOmfHfWc Thanks to @kathielgifford &amp; @hodakotb for the Hoda All Over Your Kotb serenade! #whd #whdtour http://t.co/M589FqjVXR Just wrapped with @MichaelStrahan and @carrieanninaba! #KellyandMichael http://t.co/FMEjWX4wbE RT @KellyandMichael: HUGE show today with @carrieanninaba, @channingtatum &amp; @EricMcCormack!! #KellyandMichael RT @GMA: On @GMA: @itsgabrielleu confesses she was a real-life mean girl; more w/ @channingtatum; and @indiaarie sings a song from #SongVer… Just got to @GMA! Tune in around 8am! #WHD #whdtour http://t.co/a5PRjw9Vxx Just surprised a #WHD screening at Miami's Regal South Beach theater. Wonder where I'll show up next? http://t.co/OJboW52rky #whd #whdtour Stole this footage from the studio last night.  Go Jamie Foxx yourself. We did! http://t.co/XqpPOsEplB It got a little crazy on @UnNuevoDia this morning! http://t.co/1dOHMuH1PS #whd #whdtour Who doesn't love a little salsa? Thanks to the @DespiertaAmeric crew for spicing up our morning! http://t.co/FrHcbuf8eO #whd #WHDtour @SonyPicturesID Hi Indonesia, are you ready for #WhiteHouseDown? Be one of the first to see it in cinemas starting June 26! RT @DespiertaAmeric: #Espectcular! @channingtatum y @iamjamiefoxx bailando salsa en #DespiertaAmerica https://t.co/haF4djNXg3 RT @DespiertaAmeric: Los + grandes d #Hollywood llegan siempre primero a #DA! No te pierdas a @channingtatum y @iamjamiefoxx en minutos htt… Visited the monuments in DC for the first time last night. They're awe-inspiring... http://t.co/hQ1cE4F1cr Are you going to be in NY on Tues 6/25? Stay tuned for details on our Instameet contest and your chance to win tickets to the #WHD premiere! First look at #Channshake Part 2 with @JoeyKingActress! #WHD #WHDtour http://t.co/nXcZecjeMd Causing a little havoc with this guy today... http://t.co/wAaeziupYi #WHD #WHDtour RT @tpolamalu: Saw both @channingtatum and @iamjamiefoxx last night in White House Down.  Great work, guys. #WHD RT @JoeyKingActress: Dad!!!! ;) love my movie dad @channingtatum @WHD #whitehousedown #washingtondc http://t.co/n82UaBjbmw Janet Napolitano, Secretary of the Department of Homeland Security, was in the house tonight!… http://t.co/oJIkzWqbCo Huge thanks to all the fans who came out to our DC screening tonight! #WHD #WHDtour http://t.co/KRtTrNwfWY RT @rolandemmerich: We take our jobs very seriously. @ChanningTatum and the crew rehearsing a @WHD scene. #WHD #bts #fbf http://t.co/dgQbvg… What's up DC! Doing a few late night show pre-interviews before tonight's @WHD screening. http://t.co/3LiMF8ZqKa #WHD #WHDtour RT @BensonHenderson: #WhiteHouseDown was a classically gr8 action flick, tons of good action, some 1-liners that ur not gonna forget, #WHD RT @jenndarden: #whitehousedown best action movie I've seen in forever!!!!!!! See it!!! You will thank me!! #comesoutnextfri Kicking off the #WHDtour with @iamjamiefoxx at the AMC Loews Georgetown tonight. In DC? Come on down and check out the red carpet! RT @MrCelebrity91: Just went to the advance screening of #whitehousedown best movie of the summer so epic with @channingtatum and @iamjamie… No real pianos were harmed in the filming of this scene. OK. Maybe just one. #WHD #bts #tbt http://t.co/9kLi9PPSiJ RT @ChristinaMilian: Went 2 screening of #WhiteHouseDown w @ChanningTatum &amp; @iamjamieFoXx  it is AWESOME! Action thru the WHOLE movie and s… @matt_barnes22 Thanks for hosting last night's #WHD screening! RT @Matt_Barnes22: Thnks 2 all of those that came out tonight 4 our private screening of #WhiteHouseDown! @CP3 @Ohmeomy @BigPercyRMM @ArtMo… RT @chantyschae: @channingtatum @iamjamiefoxx make a great team #WHD was an unreal movie! It made me want to Channing all over my tatum #WHD hits theaters June 28th RT @selenium_17: @channingtatum when does it come out? #WhiteHouseDown RT @simodelsimone: I just seen the movie WHITE HOUSE DOWN and that was BOMB!! LITERALLY A MUST SEE!!! #WhiteHouseDown RT @Ohmeomy: Just attended private Screening of White House Down hosted by Matt and Gloria Barnes. Epic action thriller. #whitehousedown RT @machinegunkelly: Just went to see #whitehousedown with a bunch of our fans, that s*** was sick as f***!! EST is the best family ever @machinegunkelly Glad you liked it! Thanks for watching #WHD with your fans. Thanks for getting crushed by a vending machine for me @mileycyrus \nand congrats on your new album! @gametimestar10 It's called @WHD. :-) RT @hellomariegrace: Probably the best thing i have seen on the internet to date. #ChanningAllOverYourTatum http://t.co/gN0FzwTU4J Throwing Channing on the Tatum makes the babies be born...\n#ChanningAllOverYourTatum WATCH: http://t.co/gN0FzwTU4J RT @MileyCyrus: Channing ALL OVER my Tatum http://t.co/vrttTC2dTh I'm in one of the strangest music videos of all time with @iamJamieFoxx @MileyCyrus @JimmyKimmel &amp; more. Premieres tonight on #JKLGameNight! RT @AMLightningGem: @channingtatum just saw @WHD so amazing laughs and action so much to keep you entertained! Well done! #WHD will see aga… RT @VanityFair: See behind-the-scenes photos from our @channingtatum cover shoot with Bruce Weber. And some puppies http://t.co/n80tnGkEHn .@ReidCarolin @NickZano and I are proud to announce our next big project... http://t.co/Gy5Mf9XJZo First Father's Day with my girls… http://t.co/hMlKkfg2u8 RT @michaelsucsy: Caught an advance screening of #whitehousedown last night w @channingtatum exec produced by @reidcarolin. Amazing!  So Fu… RT @drewbrees: The secret service was out in full force to watch the sneak preview of White House Down last night! #WHD http://t.co/2FhIG5f… RT @CarolynGagnon: #WHD screening...check it in theaters June 28th! #diehardinthewhitehouse #awesome Cc: @channingtatum @reidcarolin @rolan… @price22taylor You promise? @tpolamalu Thanks for hosting a #WHD screening Troy! “Happiness doesn't come as a result of getting something we don't have,but rather of recognizing &amp; appreciating what we do have.” -F. Koeing @drewbrees Thanks Drew! Hope you guys have fun! RT @Majorattititude: WHITE HOUSE DOWN - A rockin' good old-fashioned summer movie with ACTION, HUMOR and DRAMA. A real ride! RT @chicken_niggle: White House Down is the first movie I've seen where the audience actually clapped during the movie. RT @TweetAmyMac: @channingtatum just saw #whitehousedown...thought your chemistry w/ @JonahHill would go unmatched...well, until that @iamj… RT @DatariTurner: White House Down was off the chain tonight at Soho House! Thank you \n@NicolaParish @iamjamiefoxx @channingtatum What a Bl… RT @Graylee: @channingtatum #WhiteHouseDown  @iamjamiefoxx edge of your seat, laughing, cheering, gasping...exciting movie. Thanks for the … RT @naturinaughton: Wow!So fun! Y'all gotta check out @whd coming out June 28th! It's good! @iamjamiefoxx&amp; @channingtatum Killed it! #White… RT @Stephanto7: #WhiteHouseDown was a great movie! Will go watch it again when it comes out. #thankfulforscreenings @channingtatum @iamjami… RT @alondra_2015: #WhiteHouseDown premier was awesome! Loved it best movie of the year so far :D RT @KenTanudjaja: Just finished watching a preview of #WhiteHouseDown. Definitely an A+. Hilarious and yet thrilling. See it on the opening… RT @jzjewelz: My little girl and I are literally counting the days for @WHD..check marks on the calendar daily..we're just a tad excited!! RT @kellydawn30: @channingtatum #WHD movie display and 1 happy teen (carley)! She can't wait to see the movie  :-) http://t.co/MhxUFny35L RT @pj_campbell: I can now say that ‘White House Down’ is some of the most fun I’ve had at the theater this year. @channingtatum &amp; @iamjami… RT @colliderfrosty: WHITE HOUSE DOWN works due to the pairing of @channingtatum &amp; @iamjamiefoxx. Both are having fun  and Tatum shows he's … @colliderfrosty Thanks Steve! @naturinaughton Wish I could be there! Definitely appreciate the support. @qtpielissy29 Thanks! Let me know how it goes. :-) @juniior0522 Let me know what you think about it! #WHD RT @r0ckitbaby: @channingtatum \"I was concerned he was getting a little too warm in there.\" Awesome response!!! Hilarious!! RT @SonyPicturesCan: Good news! If you loved @jonahhill &amp; @channingtatum in 21 Jump Street, you'll love em in the sequel which hits theatre… @JakesTakes Always great to talk to you Jake! See you at the junket. @sock91307579 Alabama will always be home. RT @yosrodriguez01: @channingtatum its almost here @WHD in 15 more days so excited omg omg its gonna be epic. RT @MTVNews: Channing Tatum gets crazy with a pair of scissors in this exclusive @WHD clip! Watch: http://t.co/kdBZdcxlBB #WHD @LizSmth @VanityFair Thanks Liz! RT @msshaunrobinson: Just went to see advanced screening of #WhiteHouseDown w/ @iamjamiefoxx and @channingtatum! Sooo good! @laur613 Happy birthday! Here's global release dates: http://t.co/yPeBaZm2vT RT @mariahCBX when is WHITE HOUSE DOWN Out in Australia ? I'm so psyched to watch it RT @Mr_famos Just finshed seeing white house down!!!! #badassf---enmovie #toosick #loveearlyscreenings 👍😁✈🚓🚔🚁🏤 http://t.co/WzxJJbDCew RT @alex_jackalyn: Just pre-ordered tickets for June 28 midnight showing @WHD #WhiteHouseDown  @channingtatum @iamjamiefoxx Can't wait!! :-) RT @maryforOneD: dad and i planned for a father-daughter bonding and decided to watch WhiteHouseDown together ;)) eeip ! so excited! Say hello to my little friend. http://t.co/2AeV6RKo0y RT @twittermovies: Welcome to Twitter, Maggie Gyllenhaal (@mgyllenhaal)! RT @traceysterling: Just saw the preview again for #WHD  EEKKKSS  So EXCITED for this!!!! Can't wait to see it on the big screen!! @channin… @ashleytaylorfix Thanks Ashley! :-) RT @Canadagirl8: @channingtatum \"Can you not hit me in the head with a rocket when I am driving\"!!! Awesome trailer - only 17 days to go :)) @CungLe185 Thanks Cung! RT @jenndesi: Yes! \"Shoot now!...don't shoot...ok shoot!\" RT @channingtatum: Thanks...Do U have a favorite part or line in the @WHD trailer? RT @LiciRenee1983: Can't wait to see #whd starring @channingtatum! The preview tonight during @NBCTheVoice sealed the deal for me! #wishico… :-D RT @fablouis1d: My grandma (known for falling asleep during all movies) told me she would stay awake &amp; see #WHD w/ me!! #June28 #excited RT @isaboo06: @channingtatum really excited to finally see #whitehousedown! \"This is gonna be Legen... wait for it... Dary\" - @ActuallyNPH RT @steph_silveira: June 28th. I know we're I'm gonna be! #WHD @channingtatum @iamjamiefoxx #soexcited RT @tomsaunders1991: @channingtatum just saw the extended @WHD trailer. Looks unreal. Can't wait to see the full film! You can watch it here: http://t.co/fYw8o2gVrj RT @hayesiebabyy: Sad I missed the extended preview for White House Down and the fan tweets RT @AthaliaMG: “@channingtatum: Thanks for all the tweets! Do you have a favorite part or line in the @WHD trailer?” HOW DO YOU LOSE A ROCK… RT @jordan_radtke: @channingtatum midnight premier of White House Down June 28th, just like magic mike✨ #lovelovelove #WHD @countryfan1324 How about today? Thanks! RT @saverina_s: Gahh so psyched for #whitehousedown the trailer was unreal!! @channingtatum RT @aja_hobbs: @WHD \"Special agent Todd keeps making those sounds, I'm gonna have to look at him\" ...lol, classic #iwannapunchagentTodd @chelseabrown38 Shouldn't you be paying attention? :-) RT @skdirty10: \"And why did you do that?\" \"I thought it might be a little too hot in there\" @channingtatum @WHD Cant wait to see White Hous… Nice! RT @cenafan900: Look at what my friends and I saw at the movies today  #whd #SOEXCITED @izzy1dancer http://t.co/Qfo3gisGrd Thanks for all the tweets! Do you have a favorite part or line in the @WHD trailer? @ranaemistarz I'm going to hold you to that promise. Beautiful city! RT @ssmgarcia31: @channingtatum ahhhh #whd looks amazing!!! Can't believe it was filmed in Montreal!!! :) x Anything for an Emily. :) RT @iamemilysanz: your daughter in the movie has the same name as me. Retweet if you care ... C'mon Chan.. @gigmac25 #WHD has a little bit of everything. @k0dies Deal RT @amkyj: \"Could you NOT hit me in the head with a rocket while I'm trying to drive!\" Awesome! @channingtatum @WHD @NBCTheVoice :-) RT @adrienzgirl: @iamjamiefoxx and @channingtatum in #WHD will be EPIC!  Preview on #thevoice was amazeballs!!! RT @corimarino: OMG! Just saw the EXTD preview of @WHD with @channingtatum and @iamjamiefoxx! Can't wait!! Looks amazing! #handsoffmyjordan… @binkydude Go see @WHD! ;-) RT @Hiptopgirls: @channingtatum @NBCTheVoice @WHD Just saw the Trailer for WHD!!  Looks amazing!   Lots of action!!  Can't wait to see it! Check out #ThisIsTheEnd in theaters this Wednesday! Tell @JonahHill I sent you. yes! RT @jamiewade: @channingtatum will you retweet what people will say about it? Sara &amp; Susie foreves RT @latenightjimmy: Feeling EW about it being Monday?This should fix it. EW. (cc @channingtatum) http://t.co/1OU9QIJE7Q Check out @NBCTheVoice tonight to see the new extended @WHD trailer! I want to hear from you guys, so tweet me what you think about it. Thanks to @JoeyKingActress for my #Channshake t-shirt! On @WHD set she was T-Rex, I was Unicorn, &amp; we masterminded... http://t.co/EEsFTlGB2f RT @JoeyKingActress: Swagger!! RT @kingsterjoey: \"Chan Shake\" @JoeyKingActress &amp; @channingtatum http://t.co/XlLewGrdXd Really great to hear you guys are loving @WHD! Keep the tweets coming. Thanks for the love! RT @petschauerlaura: @iamjamiefoxx @channingtatum #whitehousedown is amazing. I loved it so patriotic. RT @endoweddesires: just pre-screened White House Down! Excellent movie yall! Watch it wen it comes out! RT @jennaldewan: Thank you everyone for all the loving messages! Chan, myself and Everly are happy as can be and appreciate them all :) Power nap... http://t.co/6FlbeEU6Mn #WHD #set #tbt We're going to be hanging out with @WHD fans in DC later this month. Here's how you can join me and @iamjamiefoxx... http://t.co/WStHE3yt5w Thanks Adam! RT @adammshankman: I saw #whitehousedown last night, &amp; I'm so proud of you! It was a literal #blast !!! Total action star! RT @nickzano: Caught a screening of #whitehousedown last night &amp; it's pretty damn epic, it's in theaters June 28 go see it! RT @hitRECordJoe: Saw #ThisIsTheEnd!  @Sethrogen and @gravytrainevan, you boys did it!!  Movie's exactly what I hoped it'd be--original and… RT @vanityfair: Introducing our July cover star (and proud new father!) @channingtatum http://t.co/GXiXRtyuvX http://t.co/RXgQsm1e6v It was great to work with my old friend Bruce Weber on this @VanityFair shoot. Hadn't seen him since I shot one of m… http://t.co/6cYuUrYwQa And baby makes three... http://t.co/dbcG96Pf4A RT @WHD: .@ChanningTatum &amp; @iamjamiefoxx are ready for battle in this action-packed behind-the-scenes #WHD featurette! WATCH: http://t.co/C… @khyle_awesome Stay strong and I hope your surgery went well. Behind-the-scenes on one of my favorite scenes in @WHD. @JoeyKingActress did an incredible job! #tbt http://t.co/nrASDgb3RS Thanks to @Facebook for verifying my official page... http://t.co/4ytuqpubK5 RT @WHD: Let #WHD's Emily Cale (@JoeyKingActress) and her Dad (@channingtatum) test your skills w/ her weekly trivia game: http://t.co/QEzZ… Happy Memorial Day and thank you to all the veterans that selflessly fight for freedom! \n\n[Artwork by … http://t.co/ilB42N1pU6 RT @alex_jackalyn: Watching #10Years Definitely a must see.  Great ensemble.  @channingtatum @jennaldewan RT @UnwrappedPhotos: .@channingtatum &amp; the men of #MagicMike hit the Xquisite stage again TONIGHT when the movie debuts on @HBO at 7pm CT! … RT @SandSNOLA: Want a #SaintsandSinners cap signed by @channingtatum? FOLLOW us and RETWEET for your chance to win! Winner announced tomorr… RT @hitRECordJoe: Hey everybody, the first trailer is now up for my new movie #DonJon!  http://t.co/RmWMPlNhzV I'm so curious to hear what … RT @jennaldewan: Just saw Mud! Loved every second. Go see it! What incredible acting by the two young actors and Mcconaughey.. RT @RedCross: You can support #Moore response &amp; other disasters by txting REDCROSS to 90999 to give $10, or online at http://t.co/vPTDHzGzOI Our thoughts and prayers are with all the people dealing with the devastating tornadoes in Oklahoma. Nice work! RT @unwrappedphotos: Check out these incredible drawings of @channingtatum from @deviantART's TomsGG! http://t.co/AlBox1rpHs .@jennaldewan always has my back! Get Diplo-Matic with #WHD… http://t.co/BjqtlN2Y0u http://t.co/tHRKMkCc35 “Go where you are celebrated – not tolerated. If they can’t see the real value of you, it’s time for a new start.” – Unknown RT @whd: #FF #WHD's cast and crew: @iamjamiefoxx @channingtatum @rolandemmerich @BreakheartFilms @JoeyKingActress and @GarcelleB RT @kcsosweet24: Just saw @channingtatum &amp; @iamjamiefoxx on my tv screen...can't...breathe... #WhiteHouseDown going to see it!! To my mama, my soon-to-be mama and all the beautiful moms...Happy Mother's Day! :-) http://t.co/taeSpqXzlB RT @melo_cote: #countdown #whitehousedown 48 days ! :D @WHD @channingtatum @iamjamiefoxx RT @WHD: LA #WHD Fans! Before @channingtatum &amp; @iamjamiefoxx hit theaters June 28th,come to @LALIVE this FRI/SAT to join the #WhiteHouseDow… “Success is not the key to happiness.Happiness is the key to success.If you love what you are doing,you will be successful.” - A. Schweitzer Let me know what you think about the new #WhiteHouseDown trailer http://t.co/srO7hbxNLF and check out this #tbt behi… http://t.co/DuByv3F9F8 RT @WHD: Started like any other day. By the end,they’ll make history. #WhiteHouseDown trailer premiere TODAY at 4pm PT! http://t.co/9nVMRES… RT @jennaldewan: Alright London tweeters: I need to know the best Mexican restaurant immediately. Pregnant cravings are calling. Mark your calendars... RT @goldenglobes: Sony set a June 6, 2014 release date for '21 Jump Street 2,' starring @JonahHill &amp; @ChanningTatum. RT @WHD: RETWEET if you can't wait to see the new #WhiteHouseDown trailer next week! RT @iamjamiefoxx: Done!Here's the #WhiteHouseDown shot of @ChanningTatum &amp; I.Look 4 the new trailer next week.  http://t.co/CrK0DJuVl6 RT @rolandemmerich: Great job on the #WhiteHouseDown tweets! Your prize? A new shot of @ChanningTatum on set &amp; scoop on the new trailer… RT @rolandemmerich: Want to celebrate @ChanningTatum's birthday w/ @WHD? Help #WhiteHouseDown get 5000 mentions so I can share a behind-the… What can I say? I love cake! #noshame Thanks for the birthday love and all the #TatumPhotoADay gifts this month. Lov… http://t.co/OR06xFSzSJ RT @theplaylist: Phil Lord &amp; Chris Miller Returning To Direct '21 Jump Street' Sequel, Producer Teases Plot http://t.co/QYdZofYHqk RT @UnwrappedPhotos: The @WHD brotherhood was in full effect last week! @ChanningTatum &amp; @iamJamieFoxx show us how \"in sync\" they are..… RT @rolandemmerich: #WhiteHouseDown planted a tree for every shooting day, 95 total. Happy Earth Day! - Team RE Spending a little quality time with President Sawyer today. #WhiteHouseDown #summerofsony http://t.co/1HXu6exxiA Cancun, can you handle this? #WhiteHouseDown #WhiteParty #SummerofSony http://t.co/fPWkWiYiEn RT @jonahhill: Hopefully we can work out Korean Jesus' deal for Jump Street 2. His agents are a nightmare. Hanging out with Terry on my #morningcommute to set. Thanks @audiuk! http://t.co/yLsMCD2DPt RT @jennaldewan: Be as loving as possible today...to everyone you see or meet. Literally make it your priority to be love.That's what ou ... RT @Alyssa_Milano: ❗Here's where to donate blood in MA: http://t.co/cs80WEeqpK  /via  @improvasylum #BostonMarathon @heykim #prayforboston Happy Jackie Robinson Day. He was a game changer on so many levels. #Jackie42 LMAO! #craycray RT @etonlinealert: Watch @RebelWilson's #MagicMike cameo from tonight's @MTV #MovieAwards -EXCLUSIVE: http://t.co/9BHwbjYH2i Wow this is so insane! Thanks to all 4 million of you tweeters for following. Love you guys! RT @WHD: .@colliderfrosty says fans are going to be in for a fun ride on JUNE 28! http://t.co/UpQtq5b4HG RT if you can't wait to see #Wh ... RT @colliderfrosty: .@channingtatum Talks Working with Emmerich, Doing His Own Stunts, MAGIC MIKE 2, More on the Set of WHITE HOUSE DOWN ... Blast from the past... RT @unwrappedphotos: Can't get enough of #ShesTheMan? Watch it NOW on @MTV! http://t.co/NHLWMJu8UD \"A day without laughter is a day wasted.\" - Charlie Chaplin RT @UnwrappedPhotos: Want to help us celebrate @ChanningTatum's APR 26th b-day? Join our #TatumPhotoADay Challenge! http://t.co/IedI3n2y ... RT @rolandemmerich: I'll never forget this. Here's how @channingtatum and I celebrated his last day of filming on the #WhiteHouseDown se ... RT @kaleena_allstar: @channingtatum @JonahHill \"You look like a young Jay Leno.....\" Haha nice! Looks familiar... RT @jonahhill: My mom just have me this as a gift for my trailer. http://t.co/k6UbTj0pVc Happy Easter! What's for dinner? :-) @msplendor One of my favorite moments! Thanks for the #movieawards vote. Congrats Joe! RT @hitrecordjoe: We're makin a @hitRECord TV show! WATCH this vid I made: http://t.co/yO77kHAkia  Come work w/us &lt;3 RT @moviefone: Only one man can save the President: @ChanningTatum!  Watch the explosive trailer for #WhiteHouseDown --&gt;  http://t.co ... RT @WHD: Check out @ChanningTatum in the new #WhiteHouseDown teaser poster! RETWEET &amp; stay tuned for today’s trailer release! http:/ ... RT @MTV: It's a tough job but starring in the #MovieAwards means @RebelWilson gets felt up by @ChanningTatum: http://t.co/GMhGQ3zRk5 Tun ... Be sure to follow @WHD so you don't miss tomorrow's poster and trailer debut! http://t.co/zN6nFaX2Um Be the first to check out exclusive #WhiteHouseDown footage with me at our live Q&amp;A! Go to http://t.co/0J7umFAe9w. T… http://t.co/MkElWnHSt5 Official sites... http://t.co/J6mrPtKimT Facebook: http://t.co/4ytuqpubK5 Twitter: http://t.co/fKusI1og1u Instagram: http://t.co/kiBQEsZMal RT @UnwrappedPhotos: Channing Tatum has a new handle on @Instagram! Fans can now follow Chan at @channingtatum on both Instagram and Twi ... Want to join me in London with @IamJamieFoxx and @RolandEmmerich in NYC for a LIVE #WhiteHouseDown event next week? … http://t.co/Zo4mYfImKj RT @mranstead: Please help the @BoysGirlsClubBB win 10K! Register, search \"investing\" and VOTE 4 Stuart (Wolcott,FL)! http://t.co/5D7kJQKfXG RT @reidcarolin: It will start like any other day.  #whitehousedown RT @rolandemmerich: T-minus one week until the #WhiteHouseDown trailer is released!! Hope you got your pot of gold and a few green beverages today. Happy St. Paddy's Day! \"Never love anyone who treats you like you are ordinary.\" - Oscar Wilde A beautiful soul who helped many in her short life. In memory of @Alice_Pyne... http://t.co/GnDRwoaJTh RT @rolandemmerich: An exclusive #WhiteHouseDown set photo w/ legendary #JamesWoods, who plays Secret Service Agent Walker! #WHDWednesda ... RT @jennaldewan: Please!!! RT @ChoMatic: Join @jennaldewan &amp; urge DA to file charges NOW for the 18,000+ animals... http://t.co/EIcxjyKa49 ;-) RT @rebelwilson: Oh Channing...you are too good (at everything) xx http://t.co/X9WPrXoQZf RT @MTV: .@RebelWilson, @ChanningTatum, a rocket launcher, and a cramped car, GO: http://t.co/q0FihvGaAq #MovieAwards blast off 4/14 @ 9/8c. Happy birthday Zano! RT @nickzano: Thank you everyone for the kind birthday wishes, it goes appreciated. RT @UnwrappedPhotos: Check out @channingtatum &amp; @jennaldewan's adorable @VanityFair #Oscars party photo booth pics! http://t.co/p35g ... My friend Maddox and I playing around with Garage Band on the way to the #WhiteHouseDown set... http://t.co/FRuBp6jloU #throwbackthursday Thanks for the support! RT @inasp: @channingtatum's nominated for 3 MTV Movie Awards!So proud of you! I'll vote til my fingers start hurting RT @SandSNOLA: Want a #SaintsandSinners cap signed by @ChanningTatum? FOLLOW and RETWEET for your chance to win! http://t.co/KJ9yYHH3ZG RT @hitRECordJoe: Guess how these #FF are connected :oD  @ChanningTatum @ACLU @SethRogen @NelsCline @MarieIv @Schmoyoho @Zucherman @CatS ... RT @SandSNOLA: Thanks to everyone for the support! Only a few followers away from 10,000! When we hit it, maybe we should have a giveawa ... Congrats Jimmy! RT @jimmyfallon: I want to say thank you to all of the people who make Late Night great. #HappyFOURTH anniversary!!! Yaaay!! They called me Chan Man. #throwbackthursday #tbt http://t.co/eEydWRtVLr RT @rebelwilson: CHEBEL FORCE x http://t.co/TSRP2wpFSc RT @mtv: MTV #MovieAwards shoot! RT @RebelWilson I got action onset with @channingtatum today. http://t.co/DrF7D7lxCY ;-) RT @JoeyKingActress: Driving to go work with one of my favorite people @channingtatum Should be a fun day!! RT @jennaldewan: 4 hours of sleep and still buzzing from #Oscars magic. Check out some behind the scenes pics from last night :) http:// ... What an unforgettable night! #Oscars http://t.co/DY3UzS999j RT @jimmykimmel: \"I Wanna Channing all over Your Tatum\" http://t.co/ygJqiIYQ0E @channingtatum &amp; @iamjamiefoxx RT @rolandemmerich: Couldn't stop laughing last night. @channingtatum @iamjamiefoxx Why didnt you guys teach me those dance moves on set ... #ChanningAllOverYourTatum on @jimmykimmel RT @iamjamiefoxx: Channing all over Tatums w these 2: http://t.co/CWpuMELyAs RT @laurlaff1: I think @iamjamiefoxx has a hit on his hands! lol @channingtatum @JimmyKimmelLive #ChanningAllOverYourTatum #PhotoBomb. Check! Next stop...@JimmyKimmelLive RT @iamjamiefoxx Ha! RT @TheAcademy Backstage at the #oscars http://t.co/RGC0RmA6Dv /:-) RT @theacademy: Backstage at the #oscars in the #ArchDigestGreenRoom with @channingtatum http://t.co/9zsNdHKGqj Hope you like what we've been working on. Getting ready to hit the #Oscars stage! Wish me luck! #Oscars RT @michaelstrahan: Magic Mikes on the red carpet @channingtatum @jennaldewan @KellyandMichael http://t.co/4FGQYq0kD5 Red carpet, final tech rehearsals...BIG night ahead! #Oscars RT @UnwrappedPhotos: .@ChanningTatum &amp; @jennaldewan hit the #redcarpet TONIGHT! Watch @TheAcademy Awards &amp; @JimmyKimmel's #Oscar ... #WhiteHouseDown ;-) RT @rolandemmerich: Many exclusives in the vault...which movie would you like to see photos, etc from? #DontFrackNY @NYGovCuomo Be a hero. Do the right thing. #Banfracking. Please RT! @aafracking RT @JimmyKimmelLive: \"JKL: After the Oscars\" is this sunday w/ @IamJamieFoxx &amp; @ChanningTatum. Till then, try to figure out these no ... RT @UnwrappedPhotos: TUNE IN ALERT: @channingtatum will be presenting at the 2013\n@filmindependent\n #SpiritAwards on IFC February 23rd!  ... Sending love out to all of you in the Twitterspere! Hope you had a Happy Valentine's Day! RT @hemylover: @kaytatum @channingtatum @jennaldewan Please RT this for your NOLA &amp; GC area followers to see. TY! #PayItForward http ... RT @SandSNOLA: LAST DAY of Mardi Gras! Cupid Shuffle your way to #SaintsandSinners where @djflexnola has 'em dancin' in the streets! htt ... RT @rottentomatoes: @SideEffects climbs to 85% with 99 reviews: http://t.co/qsuBweya Thanks! RT @RebelWilson: @channingtatum Really liked Side Effects, saw it last night, great story x RT @rolandemmerich: Working full time on editing #WhiteHouseDown. Can't wait for you to see @ChanningTatum and @iamJamieFoxx in action.. ... RT @SandSNOLA: .@channingtatum sported his #SaintsandSinners gear at the #Superbowl! http://t.co/kSQwcTsN  Get his hoodie, hat &amp; mor ... RT @JustJared: Rooney Mara &amp; Channing Tatum: 'Side Effects' Featurette! (Exclusive Video) @SideEffects looks great! cc: @channingtat ... In theaters today! Check it out... RT @sideeffects: #SideEffects is NOW PLAYING! Get tix now: http://t.co/0ATgKRvt http://t.co/dei5ymba RT @MARLONLWAYANS: Y'all go see @sideeffects w/ with my boy @ChanningTatum\nIt opens this Friday! One of the smartest, most creative and original people I know. Check out Soderbergh's twists and turns in @SideEffects: http://t.co/V9laLziD RT @UnwrappedPhotos: Check out @ChanningTatum &amp; his place @SandSnola on The Late Late Show with @CraigyFerg after the #Superbowl TON ... RT @CraigyFerg: If you hang out with Channing Tatum &amp; have beads you can see wonderful things in New Orleans\n#alsoscareythings http: ... The @Saints and @TBBuccaneers aren't in the big game, so I'm pulling for Ray Lewis to finish strong. Are you … http://t.co/D8hpy88H Presented Offensive Player of the Year to @AdrianPeterson at the NFL Honor Awards tonight w/ the legend that is Hall o… http://t.co/P7uep60V RT @SandSNOLA: .@ChanningTatum doing interviews at #SaintsandSinners B4 hosting #TouchdownOnBourbonSt TONIGHT! http://t.co/NyGj9xGR http ... RT @helloross: What did Channing Tatum give me that made me react like this? Watch E! News (@eonline) Monday to find out. http://t.co/w5 ... Thanks to the @GMA crew for hanging out with us at @SandSnola this morning! http://t.co/NHRFQygq RT @LateNightJimmy: Jimmy and @ChanningTatum dodged some seriously sticky balls: http://t.co/pnjNv32O RT @jimmyfallon: Big show tonight! Fun times with @ChanningTatum, @MeganHilty + cooking with 4 Hour Chef author @tferriss. Plus, Night N ... \"Believe in yourself! Without a humble but reasonable confidence in your own powers you cannot be successful or happy.\" - Norman Peale @katieskywalters Congrats on winning! Check your DM's for details on how to get your tickets to Thursday's @SideEffects premiere. Thanks to everyone for all the retweets! The winner of a pair of tickets to Thursday's @SideEffects NYC premiere is @katieskywalters! .@SideEffects' New York City premiere is January 31st &amp; I have a pair of tickets to giveaway to one lucky fan! RETWEET for a chance to win. RT @SandSNOLA: Hosted by @Channingtatum, Kick off Superbowl weekend at #SaintsandSinners' #TouchdownOnBourbonSt on Saturday! TICKETS: ht ... RT @UnwrappedPhotos: .@ChanningTatum &amp; @reidcarolin presented at the PGA's last night! Check out pics &amp; find out where Chan's he ... Watch the #AskSideEffects LIVE Q&amp;A now: http://t.co/RLjeqrh0 http://t.co/2J4iaZv4 Hanging out with the @SideEffects crew today! Watch our LIVE Google fan Q&amp;A at 1pm Pacific here: http://t.co/g4PT7at6 http://t.co/13wUSCIP RT @SideEffects: The Perfect Couple. The Perfect Medication. The Perfect Murder. Get a brand new look at #SideEffects on @Hulu: http://t ... Thanks to @Gocmom and the Black Diamond Level 5 CoEd Team for celebrating your world bid at @SandSNOLA! RT @SideEffects: Big news! The cast of #SideEffects wants to hear from YOU! Tweet us your best questions NOW then see them answered LIVE ... Thanks to @JoeyKingActress for helping me hone my fight skills in between takes on @rolandemmerich's #WhiteHouseDown... http://t.co/YGj7p5iD RT @ew: @ChanningTatum makes out with Rooney Mara in 'Side Effects' -- EXCLUSIVE PHOTOS http://t.co/bvIb8Dy3 #RollTide!!! RT @mqchristopher: @channingtatum Can I get a Roll Tide!!!! It's official. I'm Mama Jezabel Fontaine. @SandSNOLA's new game is hilarious! What's your madam name? http://t.co/6DKkrHzc RT @SideEffects: Are you feeling the buzz from Soderbergh's latest? Check out the new #SideEffects trailer on @ItunesTrailers today! htt ... RT @smFISHMAN: Just saw a 2012 hidden gem of a film called 10 Years with @channingtatum @justinlong @rosariodawson  @prattprattpratt and ... RT @deadlinecom: Hot Tune: Oscar Isaac Sings ‘Never Had’ In #10Years http://t.co/jzMkg78q What a year! Thanks for the 1 MILLION follows on @Instagram! Happy New Year everyone! http://t.co/nQAfxuRV RT @unwrappedphotos: From @icecube's #KoreanJesus to \"F*** YOU SCIENCE\", which @21JumpStMovie quote is your favorite? http://t.co/cz5CEtIM RT @jennaldewan: Watch tonight:) RT @TVGuideMagazine: American Horror Story's @jennaldewan previews her movie, She Made Them Do It http: ... Ehhhh sexy lady! RT @latenightjimmy: EW! @channingtatum, you totally made our Best \"Late Night\" Moments of 2012 list. http://t.co/uF7Kl87G RT @UnwrappedPhotos: There's a ton of fake @ChanningTatum profiles and pages on Facebook, but only these two are real... http://t.co/KwD ... Merry Christmas!! http://t.co/9HBxpJiQ Congrats Cung! RT @cungle185: Honored to have gotten \"Knockout of the Year: Cung Le vs Rich Franklin UFC Macau\" Thanks http://t.co/tUOhxj2s RT @rolandemmerich: Wait. We're still here? Guess I should finish this... http://t.co/lTh6rVlx Happy birthday to my partner in crime @JonahHill! RT @SideEffects: WARNING: Viewing this new #SideEffects poster on @Fandango may cause heart palpitations &amp; anticipation for February ... @chrizmillr Thanks Chris! #10Years Writer &amp; Director ===&gt;&gt; RT @jlinden3: I'm doing a Reddit AMA at 5 pm EST today-- come on by &amp; Ask Me Anything! http://t.co/MQboJfyD RT @valjones09: Just watched 10 years &amp; I LOVED IT!! great! Its one of those movies everyone can relate to somehow! Beautiful :) @je ... A song from one of my favorite scenes in #10Years, here's my footage of Oscar Isaac performing 'Never Had' live... http://t.co/KkVje1vp Thanks for the shout out @MichaelStrahan! You and @KellyRipa will always have a table at @SandSNOLA! http://t.co/eVbSnPt2 ;-) RT @theellenshow: .@channingtatum is gonna be a dad! Congratulations, Channing, @jennaldewan, and the future star of Step Up 26. RT @Anchor_Bay: The day is finally here! #10Years is now available on DVD and Blu-Ray! Be sure to grab a copy in stores or here: http:// ... Appreciate everyone's good wishes and love! Thanks guys! :) #PrayForNewtown :) RT @niharikakb: Just voted for @channingtatum as Favorite Movie Actor for the PCAs 2013! Also voted 4 #MagicMike #TheVow &amp; #21JumpStreet! Thanks to everybody following! RT @tatum_lovers: Congratulations @channingtatum on hitting 3M followers!! http://t.co/cOLx4MZb #MagicMike @TheVowMovie &amp; @21JumpStMovie were 3 of the most talked about movies on FB's 2012 Trends. Thanks #TeamTatum! http://t.co/xy2Ms2b9 RT @vevo: STARTING NOW #121212Concert for Sandy relief http://t.co/RpRe0Tqh. Do some good w/ @kanyewest @TheWho @BonJovi &amp; some surprises! RT @jennaldewan: \"There are only 2 ways to live your life. One is as though nothing is a miracle. The other is as if everything is.\" -Ei ... RT @UnwrappedPhotos: .@channingtatum riled up @steelers fans today with the iconic #TerribleTowel twirl! Video and Chan's Exclusive Phot ... Big thanks to the kids in Ms. Ochoa's 5th grade class at Poway's Valley Elementary! Great job on your project!  http://t.co/MwYyfztB Thanks to the @Steelers for letting me kick off the #terribletowel twirl with the #SteelerNation today! You think … http://t.co/TCkNjlkU RT @Anchor_Bay: Can’t get enough of @channingtatum? Download #10Years on @iTunesMovies now and check it off your holiday wish list. http ... RT @SandSNOLA: The end of the world BEGINS at #SaintsandSinners on DEC 20 &amp; 21! Celebrate the Apocalypse &amp; our owner Kurtz’s bir ... RT @angela_654: 65 days, 9 hours, 25 minutes, 7 seconds. #SideEffects #Countdown  @channingtatum @UnwrappedPhotos Didn't get to see #10Years? The DVD hits stores in two weeks, but you can download it today on @iTunesMovies... http://t.co/S8rO3ezQ Happy birthday to you! Happy birthday dear @jennaldewan! Happy birthday to you! http://t.co/m6SGJz0U #HappyBirthdayJenna #TatumPhotoADay Congrats @McConaughey! RT @filmlinc: #NYFCC | Best Supporting Actor: Matthew McConaughey for \"Bernie\" and #MagicMike http://t.co/cayVFnrI RT @jayshelle416: Congratulations to @channingtatum for reaching 3million likes on facebook. @UnwrappedPhotos @qfromctu @jennaldewan htt ... RT @Alice_Pyne: PLEASE help me save lives by tweeting #OneLifeLiveIt with a link to my bucket list &amp; blog http://t.co/xQpigCJS RT @honest: Give thanks by giving back. Join us &amp; celebrate #GivingTuesday. For each retweet,we will donate a pack of diapers to @baby2baby! Stay strong @vanessariddle! She's a 12 year old fighting Stage 4 Cancer &amp; wants 100K followers by end of year.Send her some follow love! THX RT @UnwrappedPhotos: Calling all UK fans! Pick up your very own copy of @ChanningTatum's movie #MagicMike TODAY: http://t.co/Yes0IbzU #Thankful for each and every one of you. Happy Thanksgiving! RT @jayleno: .@hitRECordJoe reveals @channingtatum's reaction to his #MagicMike skit on @nbcsnl. http://t.co/XM6PM0HE #TonightShow 42 years and counting! Happy anniversary Mom and Dad! http://t.co/hD9TzuLV Love it! RT @unwrappedphotos: These 4 year old @channingtatum and @StepUpMovie fans are KILLING it! WATCH: http://t.co/kk2EcmoC #FF #sweetestgirlalive RT @joeykingactress: #FF @channingtatum my awesome hilarious movie dad &amp; #sexiestmanalive congrats Unicorn love you! Thanks for all the votes! RT @luvalottatatum: Voted for @channingtatum #movieactor #PeoplesChoice.  http://t.co/9vlWczAh via @peopleschoice RT @NICKZANO: Congratulations to the genetics of @kaytatum &amp; Glen for creating the 'Sexiest Man Alive' @channingtatum. RT @GQMagazine: It's time to give @ChanningTatum his due. Meet our 2012 Movie Star of the Year: http://t.co/NcyL1BZV #GQMOTY RT @fluffyguy: Congrats 2 @ChanningTatum 4 being voted @peoplemag \"Sexiest man of 2012\" That makes @FluffyGuy sexy by association. LONG  ... RT @jennaldewan: Well obviously I agree! Good job @peoplemag! Congrats to my humble,loving,talented and yes- SEXY- love @channingtatum!! ... Thanks! :) RT @peoplemag: Congrats to Channing Tatum, this year's #SexiestManAlive! Send ur congrats to @channingtatum! http://t.co/OoySbKEE RT @jennaldewan: At @GQMagazine's Men of the Year party and look who I found! http://t.co/ZFkNaKSs #GQMOTY RT @gqmagazine: Say hello to our 2012 #GQMOTY Cover Stars: Ben Affleck, @channingtatum and @rihanna: http://t.co/A8ImZKsl RT @theBeatFreaks: Check out our new video \"THE CLIQUE IS BACK\" http://t.co/6lvAnUxW @channingtatum @jonmchu @jennaldewan It's http://t.co/41we0aF6 RT @MzMargaritaG: What's the official Instagram account for @channingtatum RT @jennaldewan: YESSS @CungLe185!!!!!!!!! We are screaming at a sports bar at 11am for you!! This is HUGE! http://t.co/9TH2RtNg Round 1 KO at #UFCMacao! Sending a HUGE CONGRATS to @CungLe185! RT @joshdcarey: And there's ur Knockout of the Year,a huge right hand from @CungLe185 flattens Franklin.Movie star &amp; legit badass. #UFCMacao RT @UnwrappedPhotos: Thanks for following!! http://t.co/Z2bcWp9D RT @autumnchimes: @channingtatum Hi! Australia is having a @Telethon7 in aid of children's health. Every #telethon7 tweet raises $1. RT? :D Hits theaters June 28, 2013 RT @elenacoeur: @channingtatum When will #WhiteHouseDown be released, do you already know? Congrats to my bro @CungLe185 on headlining #UFCMacao this Saturday! Check out the real man w/ the iron fists... http://t.co/UUkWKakI RT @colliderfrosty: 7 High Res Images from @rolandemmerich's WHITE HOUSE DOWN Starring @channingtatum, @iamjamiefoxx and Maggie Gyllenha ... RT @jennaldewan: Guys please please please vote tomorrow! Every vote counts. It really does. Thanks to everyone who came out to @SandSNOLA's grand opening this weekend! Congrats to @meggdemos and your squad for winning the regional cheerleading championships today! Good luck at State next week. RT @UnwrappedPhotos: FIRST LOOK: Pick up the November 9/16, 2012 issue of @EW to see pics of @channingtatum as #WhiteHouseDown's John Ca ... @michaelstrahan Thanks Michael! There's always a table for you! RT @UnwrappedPhotos: The grand opening for @ChanningTatum and @jennaldewan's new creole/cajun restaurant and bar @SandSNOLA kicks off TO ... RT @YahooMovies: Jude Law, @ChanningTatum, Rooney Mara &amp; Catherine Zeta-Jones are addictive in our 'Side Effects' trailer premiere:  ... RT @SandSNOLA: We're kicking off our grand opening weekend TODAY! Check out @annecutler's inside peek into @SandSNOLA on @wgnotwist... h ... It's been brung. RT @jonmchu: Bring it. http://t.co/hWO4oGnJ RT @412ink: @channingtatum @UnwrappedPhotos Rocking my Jenko costume today! \"Potassium Nitrate. Don't Hate.\" http://t.co/GOWwhzMm Text REDCROSS to 90999 to donate $10 to @RedCross' disaster relief fund &amp; help those affected by #HurricaneSandy. http://t.co/VUTXNzNs RT @RedCross: &gt; 9,000 people spent Tuesday night in 171 #RedCross shelters in 13 states. You can help: http://t.co/TXWykPSy Make sure you go see @CungLe185 in Quentin Tarantino's @ironfists in theaters this Friday! http://t.co/ddUeF5UX #TheManWithTheIronFists RT @SandSNOLA: Check out our new gallery of pics! @ChanningTatum @Jennaldewan and their family and friends celebrating @SandSNola... htt ... #FF #MagicMike @McConaughey @_Adam_Rodriguez @RealKevinNash @espinosa22 @joemanganiello @oliviamunn @fluffyguy @reidcarolin @drkeough RT @lucyhale: Side note ...why am I just now seeing magic mike?! Wow. Kids w/ enough heart &amp; passion to fill a football stadium. Bring this documentary to life &amp; help their story get told...http://t.co/8qBkqqTu RT @WB_Home_Ent: \"Welcome to the stage...#MagicMike.\" RT now for your chance to win a copy of #MagicMike &amp; a signed insert from @Cha ... RT @morgannva: Magic Mike.. Best investment I've ever made @channingtatum I'm gonna need a bigger tv! @stefaniedoo @TanyaJaneMUA @cassieecorliss @MissingLynxx @AshleyAllf Congrats on winning! Follow @qfromctu and DM her your mailing address. RT @wb_home_ent: Ha! \" #MagicMike is available today? I'll be in my room...until Thursday.\" http://t.co/xYY64mRv RT @hemylover: #BuyMagicMike BEST. MOVIE. EVER. @channingtatum @McConaughey @joemanganiello #swoonfest #everywomansdreamcometrue RT @WB_Home_Ent: \"Can I get an amen?!\" #MagicMike is available today with HOT Extended Dance Sequences! Get your copy here: http://t.co/ ... RT @ChandraHeather: @channingtatum @jennaldewan I got a blu-ray player specifically so I can see the extended dance scenes of #MagicMike ... RT @jennaldewan: Does hot naked men, extra dancing and never before scenes seem fun to you?? Then trust me, go buy the Magic Mike DVD ou ... RT @joemanganiello: Now forget about the debate and go buy #MagicMike on DVD! #BDRforPresident WOW over 38,000 entries! The lucky winner of the last signed #MagicMike Blu-ray is @AshleyAllf and the DVD &amp; Blu-ray hit stores tomorrow. The next two signed #MagicMike Blu-rays go to @cassieecorliss and @missinglynxx! Just one more left... The next signed #MagicMike Blu-ray goes to @TanyaJaneMUA! Giving away three more tonight to fans who retweet this ===&gt;&gt; http://t.co/jJ9mvTan .@stefaniedoo has won the 1st signed #MagicMike Blu-ray! Retweet this tweet if you want a chance to win the other 4 ==&gt; http://t.co/jJ9mvTan Giving away a signed #MagicMike Blu-ray to 5 lucky fans! Picking winners tomorrow and all you have to do is RETWEET for a chance to win one. RT @sasharayford: Going to buy 2 copies of #MagicMike in case I wear out the first one! ;) dvd player will be raining men! RT @SandSNOLA: Relive the magic of the legendary Storyville red light district of New Orleans during our grand opening! GET DETAILS: htt ... I have five signed copies of the #MagicMike Blu-ray to giveaway to you all. Stay tuned and I'll announce how you can try to win them soon. In theaters 1/11/13 check out this hilarious new trailer for my boy @MARLONLWAYANS new comedy #AHauntedHouse... http://t.co/oWVKJ6cS Definitely! RT @tololon: Since we made an event out of #MagicMike's premiere (midnight showing!), we should def have a DVD release party! I'm doing another #MagicMike fan Q&amp;A soon! Want to participate? Post your questions in the comments on this photo ==&gt; http://t.co/mzW1au9r :) RT @savanalilly: Tuesday #MagicMike is out on dvd! So going to buy it for coffee night with the ladies! Love @channingtatum! RT @jennaldewan: Tonight's the night to be scared! Premiere of @AHSFX! Tweet me your thoughts and questions 😱🙈 RT @alex_jackalyn: Late summer evenings w the girls watching #MagicMike &amp; on 10/23 exactly one week @channingtatum is Coming Home w/ Us!! RT @SandSNOLA: Check out this adorable pic of @ChanningTatum and @jennaldewan hanging out at @Sandsnola last Sunday... http://t.co/VNI0I4Xq \"Only those who dare to fail greatly can ever achieve greatly.\" - RFK RT @WB_Home_Ent: Want a private dance from the #MagicMike men? You can only pick one! Take our Quiz to find your match! https://t.co/HBE ... Opening our doors soon! Thanks to everyone who came out for @SandSNOLA's sneak peek on Sunday... http://t.co/mSgqruEQ http://t.co/wc05SjyI RT @alex_jackalyn: #10years was so nice, we had to see it twice.  Loved it!! So many of our own HS memories @channingtatum @jennaldewan  ... Follow ===&gt; RT @rolandemmerich: Followed @channingtatum's lead &amp; decided to join Twitter while shooting #WhiteHouseDown http://t.co/m8K0nM30 RT @JoeyKingActress: BIG thank u 2 @channingtatum &amp; his cool crew 4 helping me with my @unicefusa @UNICEFLive video! LOVE YOU GUYS!! ... @robrown718 ;-) @robrown718 Thanks Rob! :) RT @jennaldewan: Love my life!! I'll never get used to this  http://t.co/mtvci7Ja RT @WB_Home_Ent: The star of the show, Mr. #MagicMike http://t.co/yLnGAr7I RT @SandSNOLA: As you can see from these photos we took today, we are still under construction and will not be open this weekend... http ... RT @SandSNOLA: We just launched our official site!! Take a look behind the curtain and stay tuned for news on our grand opening... http: ... Want to know where #10Years is playing this weekend? Here's a list of cities, states and theaters across the country... http://t.co/zk7A4G64 RT @UnwrappedPhotos: #TatumPhotoADay - Day 27: \"Oh, you don't wanna know what I have to do for twenties.\" - @ChanningTatum #MagicMoments ... If you missed it on @ETonlineAlert, here's their 1st look at the #WhiteHouseDown set http://t.co/HEbiHcj4 cc: @RolandEmmerich @iamjamiefoxx Filming @RolandEmmerich's #WhiteHouseDown w/ @iamjamiefoxx. Tune into @NancyODell on @ETonlineAlert tonight for a first look at the movie! RT @UnwrappedPhotos: Get #MagicMike on DVD &amp; Blu-ray on OCT 23! Until then, here's a little eye candy to hold you over. You're welco ... The winner of a script signed by the #10Years cast is @zstephanie! Thanks to everyone who's seen the film and tweeted your #10YearsTickets. Break a leg Jimmy! RT @jimmyfallon: Emmys tonight. Send good viiiiiibes. \n\n(that my tux fits.) Nice! @hitrecordjoe killed it! RT @perezhilton: Joseph Gordon-Levitt Does Magic Mike Striptease On SNL! WATCH HERE!!! http://t.co/K2rCFL87 RT @jennaldewan: So excited to be on @TheEllenShow today!!! Here's a sneak peek at my interview... http://t.co/eggxmXjo and #BTS pics... ... RT @elephantproject: Please let ur followers know about our auction to help fight Alzheimer's featuring @channingtatum http://t.co/E6Bln4Zh RT @UnwrappedPhotos: .@jennaldewan is making her first appearance on @TheEllenShow TOMORROW! Tune in to get the scoop on her new project ... RT @dcfilmgirl: Saw 10 YEARS tonight, so awesome to see @channingtatum &amp; @jennaldewan together on-screen again! #Cutecouple #lovedthemovie RT @daydreams831: @channingtatum @jennaldewan Just saw the Ten Year screening in Altamonte Springs, FL. It was awesome!  Real and very f ... RT @jennaldewan: F*#% yeah! RT @AlxEast: Just came back from #10years screening in Boston..F*#%ing LOVED IT. @channingtatum @jennaldewan ... #10Years is opening in more theaters in AZ, CA, CT, FL, NY, IL, MA, MN, NJ, NY, TX and DC on Friday! Get your tickets … http://t.co/o5JtsSeA RT @mamazina: @cameron_tiff &amp; the people of Toronto knew #10Years was a GEM before the world did #TIFF11 @channingtatum #justsaying RT @okmagazine: EXCLUSIVE! @channingtatum and @jennaldewan talk about being married co-stars in #10Years! http://t.co/LkurWILu RT @hollywoodcrush: Channing Tatum talks 'Magic Mike 2' director possibilities: http://t.co/zC868VJX But does he look good in a thong? RT @ZooeyDeschanel: So cute! Video Chat Karaoke Special: Oscar Isaac + @_KateMara from #10Years On @hellogiggles http://t.co/CQZjIEEw That's a wrap! Love these guys... @jennaldewan @reidcarolin @jlinden3 Brian Geraghty @hatemyface @scottporter #10years http://t.co/twb9fyZw RT @ETonlineAlert: Thanks to @ChanningTatum &amp; the cast of #10Years for chatting w/ @JarettSays today! Go see their movie NOW!  http: ... Press brunch this morning with @jennaldewan and the #10Years crew... http://t.co/3Hgnq90u Thanks for coming out to the #10YEARS screening last night! Doing another Q&amp;A today at 12:45pm at Landmark Sunshine. http://t.co/rF2Fzz7K RT @denissedibiase: #10years an amazing yet totally funny movie!! &amp; Channing and Jenna looked amazing in the movie both sexy people! ;) RT @_KateMara: #10Years cast needs some parental guidance... @max_minghella @AGraynor @scottporter http://t.co/KyH6j6AQ RT @TheodoraG13: Best part about #10years (aside from the whole movie itself)? The cast dropped by the theater for a surprise visit! htt ... RT @christinagan: Go see #10Years -delightful movie! Laughed, cried &amp; was thoroughly entertained! Great job @channingtatum @jennalde ... RT @AGraynor: So me, @channingtatum @jennaldewan @max_minghella @_KateMara @ScottPorter @JLinden3 and more cast dropping by NY screening ... Got tickets? Going to meet up with the #10Years cast today and surprise a few screenings in NYC! Drop by and come to say Hi to all of us. RT @ZooeyDeschanel: #FF The great cast from #TENYEARS: @jennaldewan @channingtatum @max_minghella @_katemara @agraynor @prattprattpratt  ... RT @palakspatel: If you live in NYC or LA, please go see @channingtatum and @jennaldewan new film Ten Years!! You will love it! Giving away a #10Years script signed by the cast to 1 lucky fan! Tweet a pic of ur #10YearsTickets for a chance to win. http://t.co/0NlueQNG RT @jennaldewan: Thank you @nytimes for great review!! Out today guys, go chk it out!\nHigh School Is Over, but the Angst Is Not http://t ... RT @ETonlineAlert: How well does @channingtatum know his lovely wife @jennaldewan? We put the #MagicMike star to the test! http://t.co/o ... RT @joblocom: REVIEW: The year of @channingtatum continues! We dig his new high school reunion movie #10Years: http://t.co/EU1EvHGH RT @AMCMovieNews: Win An Outgoing Voicemail Message Recorded By Channing Tatum from 10 YEARS! http://t.co/mlDMIqaS ...via @AMCMovieNews RT @rottentomatoes: 10 Years is currently #fresh. 80% @ 10 reviews. http://t.co/YfNOU6yv The #10Years cast is going to be dropping in on random screenings this weekend! Have you gotten your ticket? http://t.co/QJzpXvtP RT @SandSNOLA: .@Jennaldewan talks about Saints &amp; Sinners w/ @BravoAndy in her #WatchWhatHappensLive #WWHL interview on @Bravotv...  ... RT @likethem0use: I really really liked #10years. Definitely see this movie all you 20-something's. Always #Remember911 RT @Bravotv: #RHONY's @iamHeatherT and Mrs. Channing Tatum herself @jennaldewan are LIVE in the clubhouse for #WWHL! Tune in now! Opening the doors on Saints and Sinners soon! Make sure you're following @SandSNOLA on Twitter and http://t.co/FlIejc6e on FB for updates. RT @jennaldewan: I'll be on Watch what happens live tonight on Bravo w/ my favorite @BravoAndy..tune in! #WWHL On set in Montreal. Alive and well. :-) RT @BrettGursky: Loved #10Years! Feels like real friends @ their real reunion. Perfect mix of comedy &amp; drama. Great music. Well writ ... Last month we hit 1 Million \"likes\" on Facebook and today we just passed the 2 Million mark! Thanks for the follow! http://t.co/TeMJPXST It's a #ThrowbackThursday look at the teenage years of the #10Years cast... http://t.co/rVgjyvkx via @vulture http://t.co/q9in8ttv Best. #MagicMike. Review. EVER... http://t.co/ahLCUB3d Thanks @3GoldenSisters! RT @NancyODell: Hanging out with two very cute, charismatic fellas, @ChanningTatum and Reid Carolin! http://t.co/c3txjs6Z RT @jennaldewan: Wow thanks @EW for the great review! 10 Years film review http://t.co/DmiMQGd3 RT @UnwrappedPhotos: .@ChanningTatum &amp; @Jennaldewan‘s film #10Years hits theaters next week! Check out the latest stills/clips/relea ... RT @DentinoDana: Can't believe I won tickets to screening of #10Years! Thanks to @channingtatum and @jennaldewan! RT @unwrappedphotos: #TatumPhotoADay Challenge - Day 3: #LaborDayOnTheSet @channingtatum #behindthescenes #MagicMike http://t.co/deUuu50Z Happy Labor Day everybody! Beach, BBQ, sleep, work? How are you guys celebrating today? “20yrs from now you'll be more disappointed by the things you didn’t do than by the ones you did do. Explore. Dream. Discover.” - Mark Twain Giving away tickets to early screenings of #10Years in NY, LA, Chicago,Dallas &amp; more. Enter now for a chance to win: http://t.co/ERXiucZ5 RT @popsugar: Watch our exclusive clip from #10years with @ChanningTatum and @JennaLDewan! http://t.co/ieN8wHqZ RT @joeykingactress: OFFICIALLY changed my twitter from @JoeyLittleKing to @JoeyKingActress  Spread the word if you can!! October 23rd! RT @22_felicia: @channingtatum when is #MagicMike coming out on dvd?? RT @jennaldewan: New 10years clip!.....@channingtatum Charms @jennaldewan (And Us) In Exclusive '10 Years' Clip http://t.co/JxU38ajT (vi ... RT @jennaldewan: Check out @crushabledotcom's exclusive pic of me and @channingtatum in our new movie #10Years... http://t.co/3xBHHfX3 :-)  RT @meiserash: My signed copy of EW by cast of magic mike! Thanks @channingtatum http://t.co/CbZs64uj RT @theinsider: Watch an EXCLUSIVE CLIP from #10Years starring @channingtatum &amp; @jennaldewan http://t.co/ulPZQbbU #FF #10Years @jennaldewan @rosariodawson @max_minghella @prattprattpratt @evilhag @agraynor @ScottPorter @lynncollins7 @NICKZANO @JLinden3 RT @UnwrappedPhotos: \"One shot, one kill...Let me be the faceless enemy.\" - @ChanningTatum as Steve Shriver in #StopLoss http://t.co/jlA ... RT @gurusgrace: Earth Made of Glass is airing 8/22, 23 &amp; 24 on HBO's HB2wHD... Thank You @channingtatum @jennaldewan &amp; Reid for  ... Training for #Foxcatcher... RT @cungle185: \"Wrestling Drills with @channingtatum going great! \" check it out on @Viddy http://t.co/aWpfxvPf RT @HannahManning9: I just watched the #10Years trailer!  Looks good!  Excited to see @jennaldewan &amp; @channingtatum together again o ... RT @jennaldewan: Thnx! RT @ENews: Channing Tatum's 10 Years Trailer: Five Things We Learned http://t.co/rjU3NGbC RT @YahooMovies: .@channingtatum, @rosariodawson, @jennaldewan, Justin Long &amp; more reunite in our exclusive #10Years trailer premier ... RT @danispecialk: Just saw #10Years with Anthony Mackie, Channing Tatum and Rosario Dawson. Sooo good! RT @jennaldewan: The trailer for #10Years is premiering tonight on @ENews! Tune in at 7:00pm PT/ET. http://t.co/K42w4RHY Check out @eonline tonight to get a first look at the #10Years trailer! http://t.co/9k9ukr1C Thanks! RT @luvalottatatum: I voted @channingtatum for Movie Star: Male #DSAwards http://t.co/YF71wuqt RT @EW: @channingtatum, @rosariodawson star in high school reunion film '10 Years' -- EXCLUSIVE POSTER http://t.co/lWGOo4tZ Everyone needs to check out #NitroCircus3D in theaters tomorrow. Watch the trailer, I just might make an appearance... http://t.co/FcdrPVxF Thanks to everyone in our Facebook community for helping us reach a Million \"LIKES\"! http://t.co/4J5SKa5J RT @adammshankman: #stepup. Is on abc family. Watch @channingtatum &amp; @jennaldewan fall in love for realz. This was so fun 2 make. @nicolewerking I heard you were in London before I got there. Sorry I missed you. RT @AZCardinals: Thanks to Kerry Rhodes, @ThE_rEal_P2 &amp; actor @channingtatum for kicking off the @AZCardinals #BigRedRage with a ban ... Happy birthday @CarolinaD00D from me, @JacksonMorgan and @KurtzHurtz! RT @AZCardinals: Actor @channingtatum is at @AZCardinals practice.  Scheduled 2 join Kerry Rhodes &amp; @ThE_rEaL_P2 on #BigRedRage 2nit ... RT @cardschatter: A celebrity sighting here at practice: @channingtatum checks out #CardsCamp (h/t @CardsMarkD ) http://t.co/ohyM7RHP RT @UnwrappedPhotos: Here's @ChanningTatum as @InStyle's February 2010 Man of Style... http://t.co/kh7YZKee Tweet your favorite and tag  ... 500,000! Thanks for the @instagram follows! http://t.co/lGQWddsm Get the latest news, pics, and more... OFFICIAL SITE: http://t.co/1mGsOCnG FACEBOOK: http://t.co/z0dKGQU0 INSTAGRAM: http://t.co/V1wLWHUa Retweet if you're a @StepUpMovie fan and make sure you check out #StepUpRevolution this weekend! :) RT @ew: 'American Horror Story' scoop: @jennaldewan set to get freaky w/ Adam Levine in season two -- EXCLUSIVE http://t.co/xJvNTC5u @ahs RT @UnwrappedPhotos: It's #TatumTuesday again! Here's @channingtatum's August 2009 @GQMagazine shoot. Show us what you got!  http://t.co ... RT @jennaldewan: Love this!! RT @joemanganiello: Help my friend Kristen @BauervanStraten save elephants in Africa by buying my \"sock...\" ... Big thanks for the Choice Movie Comedy &amp; Actor Comedy surfboards at last night's #TeenChoice! Appreciate your votes &amp; the 2 million follows! RT @angela_654: 60 days, 4 hours, 35 mintues, 30 seconds\n#10Years #Countdown @channingtatum @UnwrappedPhotos @jennaldewan RT @kellsiefrosty: @channingtatum 3 days and #magicmike opens in Australia. So excited!! RT @jonahhill: Help those affected by the tragic aurora theater shooting - http://t.co/nxaGah2Y.  Pls retweet too. .@StepUpMovie is playing on @ABCFamily right now and Step Up 2: The Streets plays next. RT if you're watching! RT @THRmovies: How Channing Tatum Conquered Hollywood http://t.co/8WUUotPF RT @jennaldewan: RT @KatieRhames: Watch our interview with the beautiful and stylish @Jennaldewan TONIGHT on @ENews! RT @crtnycummings: @channingtatum i will never listen to \"pony\" the same way again... Thank you   :-) #magicmike RT @UnwrappedPhotos: Thanks to @laurendaymakeup for starting #TatumTuesday! Here's @ChanningTatum's APR 2009 Vanity Fair shoot.  http:// ... RT @carissatrygstad: FINALLY! A magician I like! #MagicMike  was AMAZING! Thanks @channingtatum for your tricks and treats! #mustsee RT @jennaldewan: Ciao Bella!!  http://t.co/DzVbpLI6 RT @adammitcheson: Dear Korean Jesus please let there be a sequel to 21 Jump Street #f*ckingawesome @channingtatum @JonahHill Amen Nice! RT @nataliedtv: @channingtatum My husband bought me tix for me &amp; my girlfriends to see #MagicMike! It was AMAZING! Must see it again. RT @octaviaspencer: Am i the only one thinking: Lord, why wasn't i cast in #MagicMikeMovie?  #GoGetEm @channingtatum :) RT @michaelsucsy: @channingtatum @glickmania  #thevow #jeopardy http://t.co/9ooA8nOJ Thanks everybody! RT @unwrappedphotos: Happy 3rd anniversary to @channingtatum and @jennaldewan!!! http://t.co/emASnaXU RT @_Adam_Rodriguez: Every day you live, everything you do, #MAKEITTHEBEST !!!!  To all my friends in the UK who finally get to see #mag ... RT @bethmaund: Every female in the world needs to see #magicmike @channingtatum RT @T4witter: Estrogen levels are off the charts at T4 today, must be the @channingtatum &amp; Matthew Mcconaughey effect. #MagicMike ho ... RT @glamourmaguk: Miss #AskChanning today? See what he said about #MagicMike &amp; #50shadesofgrey here: http://t.co/NGHU02QO RT @jennaldewan: In London for the #MagicMike premiere! :) http://t.co/kMUlgRyP RT @perezhilton: The real thing! @channingtatum. #MagicMike #London http://t.co/trPFzohC ;-) RT @perezhilton: Getting my #MagicMike on in #London tonight!!! I can't wait! @channingtatum!!! Join in on my live #MagicMike Twitter Q&amp;A w/ @GlamourMagUK tomorrow at 10:45am GMT. Tweet ur questions to #AskChanning! http://t.co/yS9outnb RT @kathygriffin: On my way to a midnight showing of Magic Mike w a group of 20 something girls n gays!! http://t.co/e2bos0CN RT @BeRealHaveHeart: @channingtatum @jennaldewan Can I get a RT for my daughter Emily!  Her fave movie is #StepUp and she LOVES to #danc ... RT @UnwrappedPhotos: .@ChanningTatum &amp; @JennalDewan cheered  @CungLe185 through his UFC 148 victory last night! Congrats Cung! http: ... RT @cungle185: Here's the rest of the crew for Team Cung Le! http://t.co/Y2zWXRJY RT @jennaldewan: VEGAS BABY!! Here for @CungLe185 UFC fight! GO CUNG!!!!!!!!!!! RT @mtvnews: According to @channingtatum, the #MagicMike DVD extras are gonna \"blow your mind\" MORE-&gt;  http://t.co/y35rDKK0 RT @TheEllenShow: It's almost as good as in person. http://t.co/Hkdf2ulN RT @channingtatum I'm sending you a personalized #ChanAGram! ht ... RT @CungLe185: #UFC 148 #FF @scottsheeley @akajav  @GaryOwens_AKA @MrsSuzanneLe @VictorConte @RZA @therealrussellp @channingtatum @AKA_C ... @MeiserAsh @KateYang Congrats on winning the signed magazines! Please follow @qfromctu and DM her your full name &amp; physical mailing address. Congrats to @MEISERASH (http://t.co/Zvd6YogM) &amp; @KateYang (http://t.co/5yrhyKGC) on winning @EW's signed by the #MagicMike cast! #ChanAGram .@THEELLENSHOW I'm sending you a personalized #MagicMike #ChanAGram! http://t.co/Y8j67RJB #MagicMike hits UK theaters July 11th! Did you know the UK redband trailer comes with a warning label. Here's why: http://t.co/r7WqkyJS I'm announcing winners of the #MagicMike @EW's signed by me and the cast tomorrow. Tweet this for a chance to win ==&gt;&gt;&gt; http://t.co/sqPkfE8D Agree. @JonahHill and I are working on it. RT @anaisamendoza: I Think They Should Make A Second 21 Jump Street. @channingtatum Do You Agree? RT @thekatyberry: Spending the 4th the best way I know how! Seeing @channingtatum in #magicmike Have a happy and safe 4th of July! RT @wbpictures: Make this #4thofJuly the hottest one yet. http://t.co/PSq4OdQG #MagicMike #WeLoveHotDogs RT @wbpictures: Need #4thofJuly plans? We've got your fireworks right here. http://t.co/NhEDYKWL #MagicMike @ChanningTatum @McConaughey RT @_Adam_Rodriguez: Incredible weekend!!! Huge thanks 2 everyone who went 2 see #magicmike !!! We hoped you would LOVE IT and from the  ... It's a lot of twenties too. RT @joemanganiello: $39.2 million is a lot of ones... #Mag$cM$ke @channingtatum @McConaughey #MagicMike #BDR RT @jennaldewan: Yep! Sept 21 RT @ann_IS_my_NAME: @channingtatum @jennaldewan is the movie u did together \"10 Year\" still being released ... Giving away #MagicMike @EW's signed by me, the cast &amp; Soderbergh. RT for a chance to win! Thanks again for all the sup… http://t.co/9bSAeyaW You can follow channingtatumunwrapped on @Instagram. RT @phillyboy1988: @channingtatum Do you have instagram? RT @finallymrsl:Movie ticket: $7. Drink: $5. Leaving theater perplexed as to how @channingtatum moves his hips so fast: priceless #magicmike RT @joyfullyreviewd: #MagicMike is parts: funny/endearing/effing sexy &amp; hot as hell. I bow 2 @channingtatum 4 bringing this movie to us :) RT @_Adam_Rodriguez: About to surprise a #magicmike audience with the real thing!!!  Ladies get ready!!!! Even HE couldn't resist... RT @wbpictures: Hilarious. http://t.co/c0A5YdxE #MagicMike RT @jennaldewan: Loving all your messages about #MagicMike! So glad you're loving it! Go go go buy your tickets now!! I PROMISE u will t ... I have to wrap now, but I absolutely love you guys! Thanks so much for all the questions and support!  http://t.co/RzFXLMbZ Why do you think she puts up with me? :-) RT @lovelybrinalina: @channingtatum do you use these moves on your wife? #askmagicmike I love stories and characters. RT @zarzalik: @channingtatum why did you want to become an actor? #askmagicmike A bromance is being conservative. I love these guys! #askmagicmike RT @lg0830: @channingtatum Did you guys form a \"bromance\" during filming? #askmagicmike Directing RT @lilimc1421: @channingtatum What is the one thing you want to accomplish that you haven't yet? #askmagicmike Best part of being an actor...I get to play make believe all day. #askmagicmike RT @MissCarleyGirl7: @channingtatum #askmagicmike What is the best part about being an actor for you? Matt Bomer is one of the most talented and beautiful human beings I've met in this life. #askmagicmike RT @HeyEileen_: @channingtatum how was it working with Matt Bomer #askmagicmike F*** YEAH! RT @christy_na: Was waxing your legs worse than dancing in a thong? #askmagicmike That answer is too long for 140 characters. :-) RT @Danielle_T93: What did your momma think about your crazy career choice? :) #askmagicmike Favorite part of filming…The cast and crew. Favorite costume… @joemanganiello's Gold Man (see film) #askmagicmike RT @sami_mast: Favorite part of filming? Favorite stripper costume? #askmagicmike I loved watching people dance and eventually I had to do it. #askmagicmike RT @ambern1984: #askmagicmike when did you first start dancing and what got you into it? .@jennaldewan LOVED IT! A bunch of naked men dancing…right up her alley! RT @lupitayelder20: @channingtatum #askmagicmike what does your wife say about the movie?? shout out for me plz! Strip-tastic! RT @idog00: If you had to put this movie in one word, what would it be?#askmagicmike Completely! We all had so much fun with this movie, I would give anything to do a sequel. RT @RNBlanco32: #askmagicmike If it was possible that they could make a sequel to the movie #magicmike, would you do it? Too many foods to list, but right now, I can't wait to get something with grease in my belly. RT @karolove22: @channingtatum what is your favorite food? #askmagicmike Follow your dreams early in life, and don't be afraid to fail. RT @@MissLyss32: @channingtatum What advice would u give an aspiring actor or just someone who's tryin to make it in life? #askmagicmike BEST: Stripping = Crazy life and job. WORST: The dangerous things you're exposed to. RT @ ‏@JLWithus: @channingtatum #askmagicmike What was the best and worst things about being a stripper? I think all thongs are \"interestingly\" uncomfortable and hilarious. #askmagicmike RT @@tntcf44: @channingtatum so was the thong uncomfortable #askmagicmike It's depends on what I'm dancing to. It's a hard question, because I don't have specific moves. I just freestyle. #askmagicmike RT @FSHeartsNCarter: @channingtatum #askmagicmike  Hii Channing, what is your favorite dance move &amp; why? I would love to to do another film with @McConaughey &amp; @joemanganiello as soon as possible. Both are incredible actors &amp; great human beings. RT @CenaGirl2013: #askmagicmike how was it working with @joemanganiello @McConaughey would you do another movie with one of them or both? Every single single actor on stage got embarrassed or shy at some point. #askmagicmike RT @LannaTexasGal: @channingtatum Did any of the actors on MagicMike get embarrassed or shy while filming certain scenes? #askmagicmike Looking over and watching @McConaughey and Soderbergh the director try to have a serious conversation in a thong. RT @PhillyGal_Jen: @channingtatum what was the funniest thing that happened on set while filming #magicmike #askmagicmike It's going to be hard to answer some of the questions in 140 characters, but I'll try. Here we go... It's Q&amp;A time! Keep sending in your questions with #askmagicmike hashtag. RT @inthebasketcass: It's Friday. It's Payday. It's Magic Mike opening day. What's wrong with today? Nothing. @channingtatum RT @latenightjimmy: 'Ew' with Jimmy and @channingtatum! http://t.co/fmK0TB1y #EW Don't miss my 1st live #MagicMike Twitterview TODAY around 12:45pm ET! Make sure you submit your questions with the hashtag #AskMagicMike RT @EmmaMacKenzie4: 4theaters,each showing #magicmike on 5screens (each holding 150+ people),completely sold out til Mon. Glad I went la ... RT @LiveKelly: Tune in now for @McConaughey! #MagicMike #livewithkelly RT @happilyhannah: @channingtatum #magicmike was AMAZING! Went at midnight, going again tonight! Love you back! :D RT @smalls1985: #MagicMike is totally sold out for opening day and tomorrow here in Wichita KS! We love us some Channing! Nice! RT @leealvarado101: Had shirts made yesterday!! gonna go see it again!! So good!! http://t.co/lLS7bRrg http://t.co/v49g8w8L #MagicMike RT @YahooSearchData: And the ladies swoon….searches on @yahoo! are spiking for pictures of the Magic Mike cast @channingtatum @McConaughey RT @kelSd424: @channingtatum #MagicMike was amazing. holy hotness. will definitely be seeing it again. and again. and again. and again.  ... Thanks to everyone who's watching #MagicMike at midnight screenings and all weekend long! Love you guys! RT @papermagazine: At a Magic Mike midnight screening. Looks like we gotta lot of lawwwbreakers in here. RT @nikkifinke: Steven Soderbergh &amp; Channing Tatum Making ‘Magic Mike’ The Musical http://t.co/Tq351ghl Check out @latenightjimmy tonight! RT @jimmyfallon: Tonight: Ew! With @channingtatum http://t.co/Gb7UUC3E @LiveKelly @michaelstrahan You murdered it today my friend and God save your thighs! RT @LateNightJimmy: Awesome show tonight: Tune in for @channingtatum, @TheOliverStone, and @adamlevine with @maroon5! RT @LiveKelly: For those of you on the West coast...here's today's best moment! @channingtatum #MagicMike @michaelstrahan  VIDEO: http:/ ... RT @TodaysMoms: Produced the adorable  @channingtatum  Moms take a girlfriend +  go see #magicmike http://t.co/EkK1UzC8 Tune into @LiveKelly now! http://t.co/Tn3vhtBc RT @livekelly: Fun show! @michaelstrahan cohosts, @channingtatum visits to chat about #MagicMike &amp; @carlyraejepsen performs \"Call Me Maybe!\" RT @hodakotb: hey kids! how did you sleep last night???  we have a big show @channingtatum is going to shake his business for us today # ... RT @todayshow: A great pic of @channingtatum &amp; @joemanganiello surprising @anncurry &amp; @alroker http://t.co/ObZ1Wrdu Did you see @joemanganiello show @anncurry his body roll on the @todayshow this morning? #magicmike  http://t.co/YlGrnLCF RT @wbpictures: \"You don't need to talk. Just look pretty.\" http://t.co/rwKAthIz #MagicMike #MagicAbs #June29th RT @righlach: @channingtatum I saw #MagicMike Monday @ a pre-screening here in Toronto. I'm a straight dude, &amp; I have to say-you mad ... RT @todayshow: .@ChanningTatum shows off his #MagicMike moves on the plaza. Video: http://t.co/CN4Hb3KZ On the plaza! Tune into the @TodayShow! http://t.co/Y4ahJWt5 I'll be on around 8:00am. RT @todayshow: #MagicMike's @channingtatum is stopping by @todayshow this morning. Tune in! #MagicMike is a window into a world that most people never get to see. RT if you're going to see it in theaters FRIDAY! http://t.co/GpsDPQ0S I'm going to answer some of your questions in a live Twitterview on JUNE 29 at 12:45pm ET. Submit questions with the hashtag #askmagicmike! Huge thanks to all the fans who joined in on tonight's live chat! #magicmikelive http://t.co/Askgg81F RT @PrincessAmber86: @channingtatum The commercial for MM literally made my entire body shut down..I wonder what the movie will do? #Hur ... RT @darlenealvarez: @channingtatum @qfromctu #MagicMike trending worldwide again.. 2nd day in a row! RT @denabrannen: @channingtatum Went to premier of #MagicMike in #Tampa!  Packed house! Everyone thought it was fabulous! http://t.co/Op ... Are you ready to chat live online on @constellationtv tonight? RT if you're attending! http://t.co/DDhRt52s #magicmikelive Have you registered for my LIVE online screening &amp; chat on @ConstellationTV? RSVP HERE: http://t.co/kfZEdXZw See you tonight! #magicmikelive RT @jennphoenix1: @JonahHill @channingtatum My Tuesday just became a whole lot brighter and funnier. #21JumpStreet http://t.co/tnzfoxPR RT @philiplord: Watch unrated uncut @channingtatum frolicking in high school scenarios on #21JumpStreet DVD &amp; BR out today. See ever ... B4 u see me come out of uniform, see me w/ @JonahHill in @21JumpStMovie - out NOW! http://t.co/CZl2ZViX #21JumpStreet http://t.co/zOYn5yZm Didn't win this time? Don't worry, because I have more signed posters and @EW #MagicMike mags signed by the cast. More giveaways this week! @JBoy1193 @MizzTwist009 @MissMarley04 Congrats on winning the signed #MagicMike posters! Follow &amp; DM @qfromctu your name &amp; mailing address. RT @MizzTwist009: @channingtatum Ursula embrace the things that make you unique. Remember a little \"magic\" can go a long way -Channing T ... The next three RT's are the winners of the #IWantMagicMike poster giveway. Thanks to everyone who entered! RT @rottentomatoes: #MagicMike debuts to a #fresh rating. 100% @ 5 reviews. http://t.co/1ZEk3Xe2 http://t.co/33qBnklA RT @THRmovies: Magic Mike: Film Review http://t.co/9ivbrBAJ RT @wbpictures: #MagicMike has one good-looking cast. #LAFilmFest #ClosingNightGala http://t.co/mbQGJPNK What an incredible night! #MagicMike http://t.co/2HHaJ5n8 RT @jennaldewan: On way to Magic Mike premiere! So proud of you @channingtatum! Male nakedness. Bring. It. On. RT @joemanganiello: #MagicMike in the LA Times... http://t.co/yeHeynxa @channingtatum @McConaughey @joemanganiello If you could go undercover with one of your friends, who would it be? #21JumpStreet http://t.co/SXLjdSCV There's a few #MagicMike free passes left for fans in CO, CT, NV, UT, WA, NY, &amp; OR. RSVP for the early screenings here: http://t.co/MBkItyjn RT @wbpictures: Join us in this prayer. http://t.co/RMcM9I0P #MagicMike I'm giving away FREE passes to #MagicMike early screenings in 17 different cities! Grab your pass before they're gone: http://t.co/MBkItyjn #MagicMike closes out the #LAFilmFestival tonight... http://t.co/B3FI2tSh See you at the premiere! RT @Candy73: I'm putting together a girl's night for next Friday....first we'll see  @channingtatum in #MagicMike then drinks and lotsa  ... I made it clap. They made it rain. #MagicMike http://t.co/3gsFVBlQ RT @angela_654: 6 days, 1 hour, 30 minutes. Magic Mike #June29 @channingtatum RT @jennaldewan: I better get a chan-a-gram! RT @wbpictures: Send your friends a sexy dance video from #MagicMike star @ChanningTatum! h ... RT @WendiandNicole: It's raining men at the junket today. Can't wait to see @channingtatum in #magicmike on June 29th! http://t.co/zxNgx1l8 RT @NikkiFinke: Amusing: RT @channingtatum: The #MagicMike memes that are floating around are hilarious! http://t.co/stwUWdgV #truth Happy Birthday, Teresa! RT @colione: Happy Birthday @espinosa22!!! Your heart is as bright as your hair. RT @twentiesgirlatl: Got to see a screening for #MagicMike last night...all I can say is #yum @channingtatum Spending a little quality time with @McConaughey today. #MagicMike http://t.co/XmHIzikm Nice! Not your typical press junket. #MagicMike http://t.co/ZDaosKSV Giving away 3 signed #MagicMike posters w/ a personal message of your choice! Tweet me the message you want w/ the #IWantMagicMike hashtag. The #MagicMike memes that are floating around are hilarious! http://t.co/7ej1qmpt Want to join me in a live online chat on @constellationtv on June 26th? #MagicMikeLive Retweet &amp; RSVP HERE: http://t.co/kfZEdXZw I'm such a tease... http://t.co/ot46NXAx #MagicMike It's a week before @21JumpStMovie's Blu-ray/DVD release, but fans can download the movie on @iTunes TODAY! http://t.co/jdyW4O72 RT @juanlix: A good friend is someone who sends lots of this to me http://t.co/1Q07qOeL @channingtatum RT @wbpictures: Send your friends a sexy dance video from #MagicMike star @ChanningTatum! Personalize your Chan-A-Gram now: http://t.co/ ... RT @annadavlantes: @channingtatum enjoy #Chicago Great meeting you! #GoodDayChicago http://t.co/Nb55lKpz RT @ashispink: Just met @channingtatumunwrapped. Like are you f-ing kidding me? @channingtatum @MandieisBlue  http://t.co/ZTuNTQ9x RT @billzwecker: @ChanningTatum will be our guest at 9:45 this morning on @foxchicago @gooddaychicago talking about his new male strippe ... Happy Father's Day to all the dads out there! http://t.co/YdGyUmU8 RT @jennaldewan: Please guys help!! It means so much to me and SO much to these amazing elephants!!! BAN BULLHOOKS! http://t.co/HYQOj7Ik ... RT @katelynjo_31: If a boy takes you to see a movie where @channingtatum is a stripper.. #HesAKeeper RT @wbpictures: Talk about #MiamiHeat. @joemanganiello and @channingtatum visit the #MagicCity. #MagicMike http://t.co/Xtd3UXhK RT @presleyleti: @channingtatum @ChesleighG @heylibbeh @haylindsey \"book club meeting\" Friday 6/29 #MAGICMIKE let the countdown begin la ... RT @FabSugar: Friday SF shenanigans: watching the NSFW #MagicMike trailer...at work. @channingtatum @McConaughey @joemanganiello http:// ... RT @roxynbcmiami: Fun interview with @channingtatum about his latest film #MagicMike http://t.co/Hj4JPyed #FF #MagicMike @McConaughey @joemanganiello @RealKevinNash @reidcarolin @drkeough @_Adam_Rodriguez @oliviamunn @fluffyguy @espinosa22 Thanks! RT @visored7: Just nominated @channingtatum for the 2012 #DSAwards Male Movie Star on @VH1 http://t.co/3WhNExdk RT @oliaanjy: @joemanganiello &amp; @channingtatum promoting #MagicMike in Toronto!Here at the Thompson Hotel June 14,2012! http://t.co/gmAC8rpC RT @ETCanada: On tonight's show #MagicMike star @ChanningTatum dishes deets about the movie that’s sure to heat up the big screen! http: ... RT @bttoronto: Missed @channingtatum on BT this morning? Watch the BT Exclusive interview here: http://t.co/cZSSoluL RT @PerezHilton: I wish #MagicMike was coming out in 3-D!!! US is June 29th &amp; UK is July 11. RT @cniednb: this clip is awesome. I thought it was out on June 29, this clip says July 11. #MagicMike RT @digitalspy: EXCLUSIVE: @channingtatum steams things up in our new #MagicMike red band video clips - http://t.co/cTh6Tti9 RT @jennaldewan: So sweet! Best fans ever RT @F_JennaDewan:Just nominated @channingtatum @jennaldewan for  2012 #DSAwards Couple on @VH1 ... RT @BTtoronto: Tomorrow morning calling for hot, hot, HOT when @ChanningTatum (and his 6-pack) stop by BT to promote his new movie #Magi ... RT @therealglamgyrl Magic Mike - http://t.co/u1H2GBHQ be sure to see this movie when it hits the theaters...it's great...I loved it RT @breauni_ariel: 17 more days until #magicmike comes out! @joemanganiello @channingtatum &amp; @McConaughey ;) RT @jeremyrawle: Interview #2 with @channingtatum ended in the two of us jumping of his roof into shallow pool. http://t.co/7oNgpNe8 RT @princssash: @channingtatum @McConaughey  CAN'T WAIT TO SEE \"MAGIC MIKE\" w my girls June 29! Week long girls night! Every night! #gor ... September 21st RT @evie_perry: @jennaldewan @channingtatum when is \"Ten Year\" coming out?xo Check out the #GuysChoice Awards on @SpikeTV tonight at 9PM ET/PT. Had fun presenting the Guycon award to @McConaughey! http://t.co/eknkNZJg RT @tttaylor_nicole: *Commercial for Magic Mike* Me: Ooohhhh that's Channing Tatum! Mom: Oh my goodness! There's a God and he loves us!  ... Over 200,000 followers!! Thanks to everyone who's following channingtatumunwrapped on @instagram! http://t.co/szze86PM RT @maroon5: #MovesLikeJagger is in the new trailer for #MagicMike with @channingtatum @McConaughey &amp; @joemanganiello. Watch it now! ... RT @mtv: BRB, just gazing at this 'Magic Mike' photo gallery: http://t.co/iwNi47pc @channingtatum's abs for days... RT @MizzEllen: Totally seeing the midnight priemere of #MagicMike with @channingtatum and @McConaughey #GirlsNightOut RT @morgankrupp_gac: I'm definitely going to the movies on June 29th! #MagicMike @channingtatum @McConaughey Have you seen the red band trailer for @thatsmyboymovie? Check out @AdamSandler and Andy Samberg's new comedy... http://t.co/thUQqeB2 RT @calarbear103: Anyone else die when #magicmike trailer comes on? #June29 #comesooner @channingtatum RT @malloryyy_xo: Yay 23 days until Magic Mike comes out! @channingtatum 😉😍😘 http://t.co/5COTghhr RT @SparksNicholas: Want to meet me and the cast on the #SafeHaven set? Donate $10 or more to my fundraiser for a chance to win a trip!  ... She sang the #21JumpStreet theme song w/ @RyeRye and now @theRealEsthero's new single hits today. Check it out... http://t.co/nfTWnzcJ RT @jeyrey12: Just put \"Magic Mike Movie!\" on my work calendar #workrelated #june29\n@channingtatum @SabraAnn @christina4syth @megkelly89 Definitely! Stay tuned! RT @darlenealvarez: @channingtatum hope that #magicmike poster will be up 4 grabs as a contest again! @qfromctu ? :) #MagicMike on June 29th :-) RT @kellz_823: What's he name of the movie coming out at the end of the month with @channingtatum RT @wbpictures: It's #sexytime. New banner with @ChanningTatum, @JoeManganiello &amp; the rest of the #MagicMike boys: http://t.co/S2pCO ... Hope you liked the LIVE #MagicMike sneak peek at the @MTV #MovieAwards! Missed it? Wanna see it again? WATCH HERE: http://t.co/o2Pq3d1O RT @fireworkspencer: Magic Mike is trending worldwide! @channingtatum Channing Tatum Is Bringing 'The Real Show' To MTV Movie Awards http://t.co/V3yKZlrT via @MTV RT @jennaldewan: Tweet #VoteJenko to help @channingtatum win BEST HERO at tonight's @MTV #MovieAwards! RT @joemanganiello: Everyone tune into the #MTVMovieAwards tonight!!! @channingtatum @McConaughey #BDR #MagicMike RT @jennaldewan: Heading to MTV awards! Let's hope @channingtatum comes home with a few! 👋👋👋🎶🎶 RT @abiiyerbes: #VoteJenko of  \"21 Jump Street\" who is @channingtatum  \"For the Best Hero\" for the MTV Movie Awards 2012 RT @elankul: #votejenko @channingtatum #votejenko  retweet Headed to the @MTV #MovieAwards with @JENNALDEWAN tonight. Tune in at 9/8c and check out the live stream here: http://t.co/1RYlDqVy RT @UnwrappedPhotos: Watch @ChanningTatum on @SpikeTV on June 9th at 9:00 PM ET/PT when he presents a #GuysChoice award to @McConaughey! ... RT @kymaford: I'm curious to see what @channingtatum really does for 20s. #MagicMike ;) RT @pam_luvswv: Plz vote 4 @channingtatum 4 Best Kiss,Best Male,Best Fight,Best Cast &amp; Best Hero at http://t.co/TVeES6pm Last Day 2 VOTE June 29th! RT @laogoodies: The real question is when does #magicmike come out? @channingtatum http://t.co/c5phK1Qb RT @bellenikita: What would be awesome is if I could actually find a link which lets me watch this trailer but alas... #FF #MagicMike @McConaughey @joemanganiello @reidcarolin @drkeough @_Adam_Rodriguez @oliviamunn @fluffyguy @espinosa22 RT @alexissumwalt14: Its gonna be raining men in 28 days!!! &lt;3 with @channingtatum wish I could fast forward to June 29!!! #magicmike RT @UnwrappedPhotos: Check out @channingtatum, Alex Pettyfer, Matt Bomer, @joemanganiello and @McConaughey in the new #MagicMike poster! ... RT @msplendor:OMG,where's my bib? #MagicMike ExclusiveClip It's Raining @channingtatum @joemanganiello @McConaughey http://t.co/KXLeysnS RT @itsgabrielleu Ummmm just saw the trailer for \"Magic Mike\"...well HELLO WORLD!! Markin that one on the calendar... Thanks @joshuahorowitz! I #votejenko for the 2012 MTV #MovieAwards Best Hero! See who's in the lead &amp; tweet your vote: http://t.co/XeGG7JDZ RT @MTVNews: 30 mins til #MTVSneak of Magic Mike + @JoshuaHorowitz's LIVE Q&amp;A w/ @ChanningTatum &amp; Matthew McConaughey! WATCH: ht ... Headed to @CityWalkLA w/ @McConaughey for #MTVSneak tonight! Watch our live Q&amp;A for #MagicMike on http://t.co/8Vk1aqxo at 8pm PT / 11pm ET. RT @MTVNews: THIS JUST IN! Matthew McConaughey will be joining @ChanningTatum for the #MagicMike sneak peek tonight! Tweet us your #MTVS ... RT @MTVNews: 5 reasons (@ChanningTatum stripping + 4 more) to tune in to #MTVSneak: #MagicMike 2nite! http://t.co/lNtJkTVP Keep sendin u ... RT @JettNetti8: #MagicMike is the perfect movie4 girls nite!!! Bridesmaids nite!! HELL YEAH!! My BFF is getting married Perfect movie!!  ... RT @MTVNews: TONIGHT! Don't miss an exclusive clip from #MagicMike + a Q&amp;A w/ @ChanningTatum! http://t.co/81m1gUrE Send us your #MTV ... RT @STiKSGAMING: Every day, 1K babies are born with HIV. By 2015, that number could be 0. Help us save lives w/ @joinred http://t.co/wH7 ... RT @MTVNews: Tomorrow Sneak Peek Weeks continues w/ an EXCLUSIVE scene from #MagicMike + a Q&amp;A w/ @channingtatum! Tweet questions 4  ... Just another day at the office. #MagicMike http://t.co/kiiMOp65 RT @wbpictures: Behind the scenes of @channingtatum's #MagicMike shoot! http://t.co/hJChwxYq Stay tuned to see what he's been up to today! RT @Kris_Tarin: @channingtatum-Ive already declared my office closed that day! All the ladies will be seeing #MagicMike as a 'proff. dev ... RT @octaviaspencer: @channingtatum congrats on all the success... love that i can say I knew him when....&amp; he's still the same! #mag ... RT @jessicalleger: @McConaughey @channingtatum  #countdowntojune29 :D Can't wait for Magic Mike! http://t.co/WA014z0m Nice! RT @fireworkspencer: @channingtatum a group of 30 of us are going to the #MagicMike midnight premiere! #dedication #soexcited RT @jorrtm: 32 days untill Magic Mike #inlove #cantwait RT @alberto7mendoza: I voted for @channingtatum Best Male Performance #movieawards This guy is awesome in \"21 Jump Street\" and \"The Vow\" ... Happy Memorial Day!!   \"A hero is someone who has given his or her life to something bigger than oneself.\" - Joseph Campbell http://t.co/z2XErnqY and http://t.co/fFK3w81U are officially on @pinterest! Follow our boards here... http://t.co/E651XJNA -Q Thanks! RT @fatmaalhabtoor: I voted for Best Cast #movieawards 21 jump street @channingtatum Awesome crew!! http://t.co/S0PTF6WP Want an early sneak peek at #MagicMike? Get that and more courtesy of me, @joshuahorowitz and #MTVSneak.... http://t.co/VzB6Wq1B RT @saramcclung: Not gonna lie. I fully enjoy every Magic Mike trailer that comes across my TV. RT @msplendor: @joemanganiello @channingtatum @McConaughey It's Raining Men: #MagicMike Soundtrack List Is Here! http://t.co/48g8HmSk :-D RT @ddubscountrygrl: Channing Tatum &amp; Magic Mike are both trending! This makes me smile :) @channingtatum ---&gt; http://t.co/EAsRYrTA RT @EarthofGlass: So proud to accept the Peabody Award yesterday for Earth Made of Glass in NYC at the 81st Peabody Awards, we hope... h ... Watch our documentary @earthofglass on @HBO tomorrow and on @HBOGO through May 31st. http://t.co/uLSx2t3i RT @jennaldewan: Just won a Peabody award for Earth Made of Glass!! Such an honor.  http://t.co/2ySIErMf @earthofglass RT @UnwrappedPhotos: Congrats to @channingtatum @TheVowMovie and @21JumpStMovie on their Teen Choice Awards nominations! VOTE DAILY HERE ... RT @cassalova um, thank you Magic Mike trailer for just putting me in the best mood.....ever! Freaking fantastic! cannot wait #MagicMike hits the US on June 29th and the UK on July 13th! Let me know what you think about this new UK trailer... http://t.co/g4PXEKCg Behind-the-scenes on my @outmagazine photo shoot for #MagicMike... http://t.co/YIyo4FrE RT @outmagazine: From Stripper to Superstar: Smart, funny, versatile -- why you should be crushing on @ChanningTatum... http://t.co/OXnxpO54 RT @ew: Watch exclusive video of @channingtatum @McConaughey @joemanganiello &amp; Matt Bomer get wet 'n' wild http://t.co/rnf6yhwU #MagicMike RT @lecilysee Every time I see the trailer for #MagicMike, I smile.  It's nice of @channingtatum to do this type of humanitarian work. RT @ConstellationTV: @Channingtatum Live Videos are now up at http://t.co/sNuF8kQ4. Thanks to all who attended for making it a great eve ... RT @MTV: Past Best Kiss winners showdown!Vote Ryan Gosling &amp; Emma Stone or Rachel McAdams &amp; Channing Tatum http://t.co/DPgQZhrn #MovieAwards RT @McConaughey: Today’s the last day to bid to meet @guyfieri, own a signed @lancearmstrong jersey &amp; other great auction items to h ... RT @21JumpStMovie: RT .@mattcipolla926: #21JumpStreet: 9/10. Still painfully funny for the fourth time. @21JumpStMovie September 21st! RT @jayshelle416: @channingtatum when is 10 year coming out? Can't wait to see u and @jennaldewan in a movie 2gether again. June 29th! Check out the trailer here... http://t.co/c5pmhBR5 RT @stormbieber24: @channingtatum when is Magic Mike coming out?? RT @sabrinafiallos: Midnight show for magic mike, yes I will deff be there ;) RT @tansthrnblonde: Whoever came up with this Magic Mike movie, THANK YOU!!! #seriously 🙏 @NickValas Congrats! You won a signed @TheVowMovie DVD. Please follow and DM your full name and mailing address to @qfromctu. Thanks! -Q Congrats to @kelseyjschwartz @gmg015 @arleenbee21 @nickvalas and @mayajayT on winning signed copies of @TheVowMovie! http://t.co/fobqm7Gl My @ConstellationTV live chat starts in about 30 minutes! Join us all here =&gt; http://t.co/2sVAyixm Happy Mother's Day! http://t.co/LowkOkQ6 Want a signed @TheVowMovie DVD? Follow me on @ConstellationTV here =&gt; http://t.co/VsewkEba &amp; RETWEET this tweet for a chance to win a copy. Help my friends @McConaughey &amp; @DrewBrees by bidding in their auction to support @jklivinfndn &amp; the Brees Dream Fndn! http://t.co/z1o9CKbd The winner of a signed @TheVowMovie poster is @AngelicaBeee, who tweeted this pic of her new DVD: http://t.co/sDMe1PhM More giveaways soon! RT @TheVowMovie: Would u like @ChanningTatum 2 read ur mom a special note this #MothersDay? Find out how on #TheVow's FB! ♥ http://t.co/ ... About an hour left on our charity @Ebay auctions! Help @afarl by bidding on clothing donated by me and @jennaldewan... http://t.co/fHmaaIkA RT @afarl: Last day! @channingtatum @jennaldewan eBay auction for our animals! 100% donated! 1 item still not bid on yet! http://t.co/3d ... Hey Guys: My live @constellationtv chat scheduled for tonight has been rescheduled for 6 PM ET/3 PT this Sunday. Thank… http://t.co/4NlcHFyt RT @eBay: Love @jennaldewan @channingtatum's support for Angels 4 Animals on @eBay! http://t.co/rInb3QxE http://t.co/wty5aFdZ @afarl @eB ... #MagicMike #CountdowntoJune29 RT @kikikeekes: This is happening @LadyKristina17 @JennaRose4630 @channingtatum http://t.co/0SQ3r3B1 RT @Kompolt4Good: Bid on a Skype call w/ @jennaldewan as well as clothing from her &amp; @ChanningTatum ! Benefits @afarl! Bidding ends  ... RT @TheVowMovie: May 11th join #TheVow's @ChanningTatum for a live chat on @Constellationtv. RSVP now, here: http://t.co/5CM0V1e4 #chann ... RT @jennaldewan: Everybody go chk out please! RT @afarl: Check out @jennaldewan and @channingtatum auction for our animals! http://t.co/ ... RT @jennaldewan: I believe when we are the most connected to spirit/God/Universe, we are in a non judgmental place, accepting love in al ... Keep tweeting your photos with your @TheVowMovie DVD's and Blu-ray's and the #ilovethevow hashtag. Signed poster winner announced on Friday! RT @mtvact: .@channingtatum @britneyspears &amp; @adamlambert are helping #ryankennedy trend. Will you? http://t.co/XGEm2uyP Tweet a pic of your new @TheVowMovie DVD or Bluray with the hashtag #ilovethevow for a chance to win a signed poster! RT @thaumazo Congrats on winning a signed copy of @TheVowMovie! Please follow @qfromctu and DM her your full name and mailing address. .@TheVowMovie is out TODAY on Blu-ray and DVD! Thanks to all who entered yesterday's contest. The winner of a signed copy is @thaumazo! RT @bonaca_2: @channingtatum haven't been this happy in so long! The Vow on dvd tomorrow!!! So excited!!!!! Can't wait  &lt;3 #loveit .@TheVowMovie is out on DVD/Blu-ray tomorrow. Sign up for Friday's LIVE chat http://t.co/2sVAyixm and RT for a chance to win a signed copy! RT @jennaldewan: Yay! RT @ebaygiving: The amazing @jennaldewan is back w more charity auctions &amp;amp; a skype call: http://t.co/1x5Le ... RT @missjoymonger: 9y.o. #RyanKennedy is battling brain cancer.His wish is to be a trending topic &amp; gain support for research. #makeithappen #MagicMike is the closing film at @LAFilmFest! Want to join me &amp; @McConaughey at a meet and greet? Details here: http://t.co/B3FMA41r RT @jennaldewan: My @Ebay auction for the animal charity @afarl is LIVE! Bid on a Skype call w/ me &amp; clothes from me and @channingta ... :-) #CountdownToJune29 RT @kikipassion: 57 days until #MagicMike opens! Thanks to everyone who's voting! RT @jgirl22: I voted for Best Male Performance  @channingtatum #movieawards http://t.co/NMqjHxdF RT @TheVowMovie: #TheVow has just received 2 noms at this year’s #MTVMovieAwards, including Best Male Performance (@ChanningTatum)! http ... RT @21JumpStMovie: #21JumpStreet just received 6 #MTVMovieAwards noms, including Best Cast! Help the movie win – get voting, here! http: ... RT @TheVowMovie: RSVP for a live @ChanningTatum chat on @ConstellationTV Friday, May 11th! RSVP &amp; pre-order your copy of #TheVow her ... .@HaywireFilm @TheVowMovie and @StepUpMovie release on DVD and/or Blu-Ray soon. Check out CTU to find out when... http://t.co/HnKhUhi2 RT @joseramonmarmtz: #SNL w/ host @channingtatum &amp; musical guest @boniver tonight  11:30/10:30c on @nbc... @nbcsnl @SNLUpdate @BroadwayVideo Best. Birthday. Gift. EVER... http://t.co/sdFLGv1s Love taking cool pics with your phone? Enter @TheVowMovie’s “Share Something Sweet” @Instagram Challenge! http://t.co/kmNEU4CZ RT @UnwrappedPhotos: Over 100,000 followers in less than 2 months! Thanks for following channingtatumunwrapped on @Instagram! http://t.c ... Thanks everyone! RT @thevowmovie: Hey @channingtatum,check out all ur happy birthday messages on #TheVow's FB page! http://t.co/fVE2HXCE Today is @ChanningTatum's birthday! Check out Chan Man at age 4 & leave him a Happy Birthday message on CTU! http://t.co/sXY5CD8n -Q Check out my new #GIJoe Retaliation poster... http://t.co/FfCx6Zz1 RT @andreaduke15: I will be completely unproductive today, now that I have found the trailer for \"Magic Mike.\" #onrepeat @channingtatum RT @wbpictures: Women, money & a good time. In a story inspired by his real life, @ChanningTatum is #MagicMike. Watch the trailer now: h ... Want to help Veterans and Animals? Donate $25 by 5/1 to @NSparksFDN and u could win a @DearJohnMovie DVD signed by me! http://t.co/N2fvn8NF Check out a teaser for the 1st #MAGICMIKE trailer on @ETonlineAlert tonight & tomorrow! Trailer debuts on Wednesday! http://t.co/ZoYSC69f Help #TEAMLUKEY at @autismspeaksla's walk at @RoseBowlStadium this Saturday! Donate and/or join their team here: http://t.co/Zaz2Mfwy RT @jonahhill: Bad Boys hit Cancun, @channingtatum: http://t.co/AWU5bynw RT @JonahHill: Forget 21 Jump Street. In Mexico it's all about Comando Especial: http://t.co/od0CjDzX Hey LA dance fans! Help support a great cause. Pasadena Dance Festival on April 21st. Great event for all. Info + tix: http://t.co/fUS8Y2fo .@ChanningTatum and @JennalDewan help @OfficialSting raise millions for the rainforests... http://t.co/ka2eKwV3 -Q :-) RT @jennaldewan: Happy Easter!!  http://t.co/MQMYrOen RT @jennaldewan: Nerves right before we went on!  http://t.co/QTXX5daA RT @earthofglass: Incredible news for Earth Made of Glass this morning. We won a Peabody! http://t.co/fxDZxjBz Signed tons of @DearJohnMovie posters for @SparksNicholas' charity family weekend. Learn more about his event at http://t.co/t0RK2zDk RT @jennaldewan: Someone please pinch me  http://t.co/JrSlt3NM RT @jennaldewan: In rehearsals!! hope to see some of y'all in NYC! #dancelovin' http://t.co/Z2zy1kb0 RT @jennaldewan: Want to see @Jennaldewan & @ChanningTatum dance together again? Get your tickets for their April 3rd charity event! htt ... 13M kids will be bullied this year. 3M students will be absent b/c they feel unsafe. Join me. Take a stand. http://t.co/cKq1Xtvw #BullyMovie CHARITY CONCERT: Performing w/ Meryl Streep @eltonjohndotcom @OfficialSting @BrunoMars & more APR 3rd at @carnegiehall! http://t.co/Nd38SgAr RT @jonahhill: RT @chrisrock: 21 jumpstreet is really funny I'm jealous @OfficialMel Congrats on winning the #21JumpStreet poster! Follow @qfromctu and DM her your full name and mailing address. WOW over 11,000 RT's for one poster! The winner of the #21JumpStreet poster signed by me and @JonahHill is... @OfficialMel RT @justinscupcakee: Everyone should get @channingtatum 's @PostTheLove app. Spread love to anyone and everyone. http://t.co/8b1KdD77 RT @ThisIsLafferty: 2-Strappin' it today. #21JumpStreet RT @mothermaddie: Someone made some #21JumpStreet artwork in class  http://t.co/fwl2Fdco #FYouScience #21JumpStreet RT @yesimjustintime: 44444444444444444444444444444444444444444444444444444444444444444444444444444444444444444444 #FYouScience #21JumpStreet September 21st RT @darlenealvarez: @channingtatum @jennaldewan Any release date? :) A Short Vignette from \"TEN YEAR\": http://t.co/IeU3Teq4 Yes! Contest is open to everyone. RT @janelarmypll: @channingtatum @JonahHill can you win it even if you live in Australia? One more giveaway...Want this #21JumpStreet poster signed by me and my boy @JonahHill? Retweet for a chance to win it! http://t.co/6t1oj8Qv RT @iharryshum: \"21 Jump Street\" was a funny movie! Loved the #glee reference! Hah! Good work @channingtatum &amp; @JonahHill What's your favorite @21JumpStMovie quote? RT @erindevlin89: \"Everyone on campus is two strapping it!\" #21JumpStreet @JonahHill hahah :-) @andreaUetz @ValleyGirl1976 @joatemyheart @Beliebin_Ariana @Devoted2TV Congrats! Follow @qfromctu &amp; DM her ur full name and mailing address. Over 4K retweets! The winners of the signed #21JumpStreet posters are @andreaUetz @ValleyGirl1976 @joatemyheart @Beliebin_Ariana @Devoted2TV Here u go: http://t.co/3gculleW RT @jamiekeesee: @channingtatum @postthelove How do I get the PTL app? I want to join the movement! RT @hannahmanning9: Just downloaded @postthelove app by @jennaldewan and @channingtatum. It's great! Everyone should get it &amp; post the love! The 11th reason is the fans! Thanks for the support! RT @ThePlaylist:10 Reasons Why #21JumpStreet Exceeded Expectations http://t.co/rUZbw7xD RT @21jumpstmovie: #1 Movie in America. Truer words have never been said: \"I f***ing cherish you.\" http://t.co/GQNi0EpS RT @smashlieenicole: @Live_Laff_Lov3 officially following @channingtatum because of thats AP Chemistry b*tchhhhhhhhh :) #21jumpstreet RT @ricky_martin: By the way \"21 Jump Street\" Hillarious! RT @JonahHill: I wanna thank Korean Jesus and all of you amazing people for going to see #21JumpStreet this weekend! Means so much friends. RT @RickMalambri: .@channingtatum you need to do more comedy bro, Brilliant! LdMAO, Mad Props! EVERYONE GO SEE #21JumpStreet RT @ebertchicago: \"21 Jump Street\" is winning the weekend, and no wonder. It's actually pretty good. http://t.co/BpXNAVA6 RT @21JumpStMovie: To everyone who saw, supported, shared, and laughed at #21JumpStreet this weekend, THANK YOU! @CiaraMay4 @Maree269 @ashuhmazing @AmberLee104 @meg_reneem Follow @qfromctu and DM her your full name and mailing address for the poster. Congrats to midnight screeners @CiaraMay4 @Maree269 @ashuhmazing @AmberLee104 and @meg_reneem on winning signed #21JumpStreet posters! RT @jonahhill: Alright friends I'm going to go see #21JumpStreet right now at some theater in America. Who is gonna come find me? RT @mikeschulznow: You'll probably be laughing at #21JumpStreet so hard that you may not even notice how freakin' smart it is. RT @SassySashSashes: My 60 year old mom just text me \"21 jump street movie. So So so funny! You must see it!. Lol @channingtatum @jonahh ... In case you missed it, check out my @jimmykimmel interview on CTU... http://t.co/Cr8yVvl0 RT @kaytatum: @channingtatum C mon CHANMAN!!!\nHehe;))! RT @postthelove: Live for chillin what my boy on opening day! So much fun! http://t.co/Lmt1WDwr #21JumpStreet Happy St. Paddy's Day and thanks for all the #21JumpStreet love!!! :-) RT @ltitsnw25: Watching 21 jump street with my man at 10am! That's how we roll! #parentstyle @channingtatum @JonahHill RT @rocheaoife: @channingtatum 21 JUMPSTREET INSTEAD OF THE GYM PEOPLE. FULL ON CONVINCED I HAVE A 6 PACK FROM LAUGHING SO HARD! RT @ricky_is_sexy: 21 Jumpstreet = best movie of my life. It's freaking hilarious. @channingtatum RT @_LAWLESS_: @JonahHill  @channingtatum , my wife and I are at the movies watching #21JumpStreet and she's pregnant having contraction ... RT @philiplord: #FF #21JumpStreet thanks &amp; &lt;3 @JonahHill @channingtatum @chrizmillr @RobRiggle @DeRayDavis @FrancosMom @RyeRye @i ... Thanks man! RT @nickzano: One of the best people I know has a movie out today called 21 Jump Street go see ASAP. http://t.co/1DvbnTJP RT @lenaagulian: We are really excited about 21 Jump Street. #HOLLA @channingtatum @JonahHill http://t.co/le6WkQOE RT @clairelnwilson: Just got to the cinema and 21 Jump Street is sold out!Absolutely gutted!! @JonahHill @channingtatum http://t.co/2AVf2Zfx RT @chelseahandler: Jonah hill and channing tatum will homo it out on mondays show to promote 21 jumpstreet which comes out today. ... h ... RT @gerradhall: No doubt abt it, @21JumpStMovie is THE movie to see this wkend. See it twice - it's a riot! @channingtatum &amp; @JonahH ... RT @SalvatoreJNL: Just got back from seeing @channingtatum in #21JumpStreet! It was F*ING hysterical! Definitely going to see it a bunch ... Thanks! RT @barcbg: At 2nd showing of @21JumpStMovie  in 12 hours!  doing my part!! @channingtatum @JonahHill RT @simps: 7 hours later and I can't stop thinking about how great 21 JUMP STREET was. @channingtatum is the best, and now I'm a believer! RT @clark_kent11: 21 Jump Street kicked MOTHERF-ING ass!!! New favorite movie @JonahHill @channingtatum Watch #21JumpStreet hilarity ensue when me and @JonahHill stake out the #JerseyShore @djpaulyd -style... http://t.co/7R6qzK6x #21JumpStreet RT @dazcaines: @channingtatum that's what a film review score looks like! #greatfilm http://t.co/bu9h2PDa NICE! RT @logsy88: @channingtatum @JonahHill Clearly too excited to see #21JumpStreet tonight!!! Can't wait!! xx http://t.co/4qeHZi8M RT @jennaldewan: This is an awesome tweet RT @theLostBoyy: #21JumpStreet NONSTOP F-ING HILARITY. THAT SH*T KRAY. @channingtatum @JonahHill RT @calivampire8140: @channingtatum saw 21 jumpstreet tonight and OMG IT WAS HELLA FUNNY....you and jonah hill make an AWESOME team!!!!! RT @tec6062: @channingtatum @JonahHill Me in my Waldo hat at a crowded midnight screening of #21JumpStreet #midnight http://t.co/e3nKX9Dc Giving away signed #21JumpStreet posters to 5 fans who tweet pics of their midnight screening tickets and 5 fans who RETWEET THIS! RT @jessieecoxx: Never laughed so much from a movie. 21 jump street was fantastic! Would definitely see it at least 20 more times You're welcome! RT @akozak83: @channingtatum @JonahHill @ConstellationTV THANK YOU for the live chat about #21JumpStreet !! LOVE YOU GUYS!! RT @jonahhill: Been working on #21JumpStreet for 5 years &amp; we're 88% Fresh on @RottenTomatoes! And it's out in theaters tonight at midnight! RT @jimmykimmel: Tonight on #JKL @channingtatum #21JumpStreet, @genirodriguez #CasaDeMiPadre &amp; music from @joyformidable Love Rachel McAdams and @JonahHill! I just have a funny way of showing it. Shared a few practical jokes on @JayLeno... http://t.co/bwiiHPHL Are you ready for tonight @jonahhill? 8:00 PM ET/5 PM PT  LIVE craziness on @constellationtv Join now: http://t.co/LDzoVEit #21jumpstlive RT @jayleno: Preview: #21JumpStreet's @channingtatum on giving @JonahHill a massage. http://t.co/JDSjtvu1 RT @drewbrees: Pic of me hanging out with Channing Tatum at Leno. Cool cat, loves New Orleans http://t.co/W7R4BDl0 RT @filmfest: @channingtatum @JonahHill knocked it out of the park w/ #21JumpStreet! One of the most entertaining studio films ever made ... RT @rottentomatoes: 21 Jump Street hits #certifiedfresh! 90% @ 40 reviews. http://t.co/KMXuSuzz  @JonahHill @channingtatum Headed to @JayLeno and @jimmykimmel this week for #21JumpStreet! http://t.co/UuX8kY3a RT @funnyordie: Learn about the dangers of fake drugs from @JonahHill, @channingtatum &amp; @RobRiggle: http://t.co/ix84qQeM Lepatitis A is no joke. Check out this #21JumpStreet Public Service Announcement and wash your hands people! http://t.co/szaPEOZX #NSFW RT @hollyrpeete: @JonahHill and @channingtatum have crrrrraaazzy comedy chemisty #21Jumpstreetmovie http://t.co/TnAGIN8c RT @dtuck318: 21 Jump Street, starring @JonahHill and @channingtatum is getting some of the best reviews of the year. Go see it this wee ... I'll be shirtless live on @ConstellationTV if @jonahhill @icecube &amp; 500 other people RT this. Join here: http://t.co/LDzoVEit #21jumpstlive Thanks to all of the fans that came out to support us at the #21JumpStreet premiere tonight! http://t.co/cIKj12CB Check out a few red carpet pics from tonight's #21JumpStreet premiere! http://t.co/Hcezhy9B RT @TheEllenShow: Ellie Kemper had a love connection with @ChanningTatum while filming '21 Jump Street.' At least she did in her head. h ... RT @hollywoodhelper: @channingtatum &amp; @JonahHill should be arriving at 6:30pm for #21JumpStreet premiere n Hollywood!  http://t.co/8HCWsrlU You have the right to remain adorable... http://t.co/KA2xelvT #21JumpStreet #SXSW cc: @jennaldewan RT @lizzcorrea: #21JumpStreet #MoviePremiere #JonahHill #Hollywood 🎥�http://t.co/G5XxQTfMfM RT @NKDsoooCoolyaya: #21jumpstreet was the perfect way to finish up finals week!!! Laughed so hard I was cryinggg @channingtatum  #sofunny RT @giteshpandya: #21JumpStreet: Laughed my ass off. Jonah/Channing great chemistry & perfect for these roles. Big $ & new franchise here. RT @AngieRaphael: #21JumpStreet was totally ridiculous and totally awesome. It was more of an homage to the show than I expected. Great  ... RT @SusanMayWriter: #21JumpStreet a certain hit. The most fun I've had watching craziness in ages. Laugh out very loud comedy. &amp; I'v ... #21JumpStreet #SXSW http://t.co/tCn3TtPS RT @CatEdison: #21JUMPSTREET EFFING AWESOME!  Great job Phil Lord and Chris Miller and crew!!!! #SXSW RT @bangeleno: #21jumpstreet just killed it!! Brought down the Paramount #SXSW Are you at #SXSW? #21JumpStreet premiere TONIGHT at the Paramount Theatre 7:30pm! I'll take do a shot of tequila everytime @jonahhill makes me laugh. 3/15, 8 pm EST. RT & RSVP to join in. http://t.co/EBVG0uZ1 #21jumpstlive :-D RT @JennaDewanArmy: congrats on hitting the one million followers mark! You deserve it Channing! #TeamTatum's proud of you! #GOChanning! RT @ckheard: Just downloaded the @postthelove app by @channingtatum & @jennaldewan ! So impressed. True love conquers ALL&lt;3 RT @MTV_2: #21JumpStreet cast @icecube @JonahHill @channingtatum will be on @SuckerFreeMTV2 this Sun, grab a sneak peek here: http://t.c ... RT @djpaulyd: Peep The Homie @channingtatum All Pauly D'ed Out !!!! #21Jumpstreet http://t.co/nIyWqECt #JERZathon RT @bnessa_saurus: \"A girl called snoopy was chasing me and kept screaming its cuca time\" @channingtatum lmaooo seriously the funniest t ... Not a vow quote.... I literally love Red Velvet cake!!! http://t.co/4lcDymO3 via @postthelove Check out @JonahHill on @nbcsnl tonight & join both of us for a live chat on @ConstellationTV next week! http://t.co/hTqBfrub #21jumpstlive RT if you're going to a midnight screening! RT @SonyPictures: @ChanningTatum and @JonahHill star in #21JumpStreet. In theaters next Friday! RT @ashleysmith_06: @channingtatum I just downloaded the @postthelove app!! #totallystoked #itslegit 😍 RT @helloitsmewill: Wow #21jumpstreet is 19-0 on @RottenTomatoes. That's pretty #baller. It must be really dope. http://t.co/zXIkum4y RT @TomFelton: Just watched 21 jump street courtesy of my man @iamBenLyons \nSoooo funny! @JonahHill legend. \nGo watch it peeps,Funniest  ... RT @nytimesmovies: Arts & Leisure: Channing Tatum Works to Be the Next Big Star http://t.co/t1yNc8Kt http://t.co/vIIeWG6L RT @Xtine2010_LBE: Totally recommend u see #21JumpStreet it's supah hilarious @channingtatum @jonahhill @icecube u all are frkn awesum l ... Definitely! RT @lilyllama11: Can we expect to see @JonahHill & @channingtatum at #SXSW for their movie premiere? I SURE HOPE SO. #DreamTeam RT @21JumpStMovie: Hear the new #21JumpStreet theme song ft. @RyeRye & @theRealEsthero http://t.co/NxhqmvjV @JonahHill @chrizmillr @phil ... RT @bigjgoods: #21JumpStreet is the funniest movie of all time!!! #RespectThaPolice RT @k_radolovic: @channingtatum 21 Jump Street, hands down funniest movie I have seen in a long time #laughedtillicried RT @mandamageee1: Just saw a private screening of 21 Jump Street! @channingtatum and @JonahHill make one HELL of a team!! Loved the movi ... RT @AmyE_1993: writting about POST THE LOVE.no negativity,simply people expressing the things that make them happiest#Inspirational @cha ... RT @shayla_2: @channingtatum. I love jenko and schmidt! I wish they were real people #21jumpstreet #bestmoviever RT @ConstellationTV: Get ready for #21jumpstreet & RSVP to @channingtatum & @jonahhill's live chat on 3/15! RT & RSVP http://t.co/7IrF6d ... Let's fill up @NICKZANO's mentions and wish him a HAPPY BIRTHDAY!!! RT @LindseyNeyland: I'm posting my love about post the love! ❤ :-) everyone get the app! @channingtatum RT @BriannaPaige13: Just installed the new @postthelove app and I love it! Such a great idea. Thanks @channingtatum &lt;3 Just saw this on @postthelove, you should check it out: http://t.co/qAmd0Y8J Just saw this on @postthelove, you should check it out: http://t.co/Bh7qW2Nf It's my hand. :-) RT @vivavya: @channingtatum anyway, whose hand is it on the pict of @postthelove? *extremelytrulyimportanttweet haha :D RT @postthelove: Yep! The new app works on both! http://t.co/3gculleW RT @kern523: this is awesome.is there an app for the ipad too? Download the new free @postthelove iPhone/iPad app at http://t.co/3gculleW and start spreading the L http://t.co/OQND9RMd RT @BonnieHamilton: @channingtatum @JonahHill already saw #21jumpstreet twice. i think its already a classic! love it! want to see out t ... Yo everybody!!! So we just launched our POST THE LOVE app. On the app store today!! Go check it out and help us work out the kinks!!! RT @V_Banks: Just watched the screening of 21 jump with @DomCFIT.. #AMAZING @channingtatum and @JonahHill are HILARIOUS!! Great movie! RT @RedSoxRedShoes: Yes. I just RT'd @ChanningTatum. Every person I trust who has seen 21 Jump St says he's the boss in it. I'm willing  ... Check out #21JumpStreet in theaters MARCH 16th & don't miss 5 minutes of NSFW Red Band craziness n this new sneak peek: http://t.co/0vcG9XyZ In case you missed it, check out my interview with @JonahHill on @CBSThisMorning... http://t.co/l0JBZiu1 #21JumpStreet RT @stephiielee: @channingtatum LOVED #21jumpstreet , for sure goin & seein it a 2nd time - ya'll were awesome! RT @106andpark: You saw @IceCube yesterday, but #On106Today are @JonahHill @channingtatum to rep for @21JumpStMovie http://t.co/a6783gXo RT @CBSThisMorning: And at 8AM: We talk to Karen Santorum, @Jack Dorsey, @JonahHill, @channingtatum, and celebrate 100 years of the @Ore ... RT @21jumpstmovie: WATCH: The Insider has an exclusive first look at #21JumpStreet. http://t.co/tCmyF4Bl RT @CBSThisMorning: RT @Ginnynyc: They're back! @jonahhill & @channingtatum\njoin Charlie and Gayle tomorrow on @cbsthismorning. If you l ... RT @kaytatum: Join the @21JumpStMovie event with @channingtatum and @JonahHill on @ConstellationTV. http://t.co/gR0vnVHu. #21jumpstlive RT @RottenTomatoes: 21 Jump Street debuts to a #fresh Tomatometer rating. 100% @ 6 reviews. http://t.co/WWxPVuM6 #21JumpStreet 100% FRESH on @RottenTomatoes!! http://t.co/ybH4AjpE Just posted a photo http://t.co/Guc9weT4 Thanks Hollywood Reporter!!! RT @THRmovies: 21 Jump Street: Film Review http://t.co/2613tuVO @channingtatum @jonahhill @tkeyahaleyah Congrats on winning the #21JumpStreet poster signed by me and @JonahHill! Follow @qfromctu & DM your name and address to her. Thanks to everyone who entered! After over 10,000 RT's, the winner of the signed #21JumpStreet poster is @tkeyahaleyah. More giveaways soon! Picking a fan to win this #21jumpstreet poster signed by me and @JonahHill soon. RT for a chance to win it! http://t.co/8bF18NxC Hi. I'm Channing Tatum and I'm in uniform. ;-) http://t.co/zVZ4pJ2N Kicking off the morning with a little @icecube @jonahhill @chrizmillr @philiplord & @robriggle #21jumpstreet http://t.co/Ln9FDyLz RT @21JumpStMovie: Chat with @JonahHill & @channingtatum online + see exclusive #21JumpStreet clips! RSVP for the March 15 event here: h ... RT @TrendsmapCanada: Channing Tatum, @channingtatum is now trending in Canada http://t.co/lVOQYOjo Giving away this #21jumpstreet junket set poster signed by me and @JonahHill. RT for a chance to win it! http://t.co/8bF18NxC Totes ;-) RT @jennaldewan:You just said cray..im officially rubbing off on you lol RT @channingtatum: That sh*t CRAY... http://t.co/3PGRp0TI That sh*t CRAY... http://t.co/3PGRp0TI RT @106andpark: If you will be in the NYC area and you want to be in the livest audience the cast of 21 Jump Street email Audience106@be ... The calm before the #21JumpStreet junket storm... http://t.co/YiipsrCg http://t.co/qCT75crI RT @micasaycaza: I dont think I've ever laughed so hard in a movie. @JonahHill @channingtatum AMAZING! #hilarious &lt;3 MARCH 16TH RT @lindseeeywitus: @channingtatum when does 21 jump street come out in theaters in the US? Only have this Twitter account. @instagram = channingtatumunwrapped RT @cacaistheshit: RU on instagram & do u have more than 1 twitter acct? RT @hiiiether: @JonahHill @channingtatum @21JumpStMovie SUCH A FUNNY MOVIE!!! Action, drama, and non-stop comedy!!! AWESOME! RT @prophecygirl14: Just saw @21JumpStMovie & then @channingtatum & @JonahHill showed up!!!!!! The movie was awesome and so were they! :D RT @deraydavis: Me & @channingtatum in #21JumpStreet http://t.co/pZTuIMrB RT if you’re seeing it March 16! RT @JonahHill: Sad face. Goodbye DC on our way to Miami. #21jumpstreet tour. http://t.co/EPC2qkK7 RT @TalkingPictures: My interview with #ChanningTatum & #JonahHill for #21JumpStreet: http://t.co/HQZq79Xh via @youtube @jonahhill @chan ... RT @jennaldewan: Thnx! Sept 21 RT @alzito25: when does 10 Year come out? Saw a screening tonight, LOVED IT! You and Channing were so ado ... RT @ThePlaylist: RT @mjsamps: Also \"21 Jump Street\" may have the greatest end credits sequence, I don't know, ever? RT @KiraMBates: Love when actors come out right after the credits! / @SilverStrategy @jonahhill @channingtatum  @icecube #21jumpstreet h ... RT @TreyAmsler: @channingtatum & @JonahHill, Thank you for @21JumpStMovie!! It was HILARIOUS!! The audience loved it! Can't wait for Par ... Thx for tweeting along! Next 10 people to tweet #21JumpStreetMiami to @21JumpStMovie get passes to tomorrow night&#39;s screening in Miami! RT @mtvnews: Congrats to all the @NewNowNext nominees! http://t.co/3ivFrRsu Uh oh, @channingtatum vs. @NayaRivera in the Cause You're Ho ... Happy Leap Day! I'm happily taken, but all of the proposal tweets are sweet! The #21jumpstreet crew at tonight's screening and Q&A in Chicago via @AlexBohs http://t.co/cHGAvOLp RT @christa_elise: @AdriBoo1104 and I just left private screening for \"21Jump Street\" .. it is a MUST see! @jonahhill @channingtatum are ... RT @UnwrappedPhotos: RT @YahooMovies: Exclusive clip @JonahHill & @channingtatum busting bad guys & bringing funny #NOLA-film #21JumpStr ... Thx for tweeting along! Next 10 people to tweet #21JumpStreetDC to @21JumpStMovie get passes to tomorrow night&#39;s screening in DC! Thx for tweeting along! Next 10 people to tweet #21JumpStreetChicago to @21JumpStMovie get passes to tonight&#39;s screening in Chicago! RT @toddbeck: Pre-Register to the @21JumpStMovie LIVE event with @JonahHill and @channingtatum! http://t.co/skMJNYSU #21JumpsStLive RT @rubymaldonado21: I'm still laughing about #21jumpstreet @channingtatum and @JonahHill were the perfect match! best/funniest movie  t ... RT @CMShowstopper: @channingtatum and @jonahhill killed it in #21JumpStreet. Got advanced screening of it & cant wait to see it again #F ... RT @jonahhill: #21JumpStreet press tour day 1! Myself, @channingtatum , @icecube and @RobRiggle are in Denver tonight! http://t.co/9F6UvWXd THANKS! RT @msplendor: Vote for @joemanganiello and @channingtatum for #MagicMike in #NNNAwards! Next Must-See Movie http://t.co/5mQ9xfV4 @andila23 Thanks! :-) RT @unwrappedphotos: Fans are tweeting that She's the Man is on TV in the UK! What's your favorite line from the movie? http://t.co/NEEaZRls RT @sheripickenstur: @channingtatum @jennaldewan  Watching Coach Carter on AMC! Love it! RT @beccahessmusic: \"when did I get stabbed?!  AWESOME!!\" haha cannot wait for #21jumpstreet two of my favorite boys and absolute ridcul ... If you’re in LA tomorrow go down to the #21JumpStreet Jump Shots Challenge in Venice! http://t.co/AgiUVgvz RT @jonahhill: March 16th! http://t.co/q5uM3qaj Want VIP access to a special LIVE @21JumpStMovie online event with me and @JonahHill? REGISTER NOW: http://t.co/YbTeDmSb #21JumpStreet RT @iambenlyons: @JonahHill @channingtatum funny stuff. #KoreanJesus would be proud... RT @thatssoraevenn: #21JumpStreet is seriously the funniest movie I've ever seen. RT @itsmeAJreyes: almost had a heart attack while watching #21jumpstreet.. My tummy's aching while laughing.. good job @JonahHill & @cha ... RT @MikiTufto: Loved 21 Jump Street! I knew @channingtatum was cute but who knew he was so funny! Can't wait to see it again! #comicgeni ... RT @hoges1985: @channingtatum Watched The Vow last night with Girlfriend. Only guy in the cinema along with 100+ woman. Loved it dude! G ... 10000 followers in 2 days!! Thanks to everyone who's following channingtatumunwrapped on @instagram!  http://t.co/dJdKDQNA RT @21jumpstmovie: They aced the academy, but failed the test... Jump Street is their last shot. http://t.co/HK03BW05 #21JumpStreet June 29th RT @alexallbaugh: @channingtatum When does #MagicMike come out? I saw a picture of you and alex pettyfer & I already wanna see it. RT @DarleneAlvarez: @channingtatum Step Up is trending on twitter !! Yes, You & @jennaldewan Were the perfect choice who played Tyler &  ... RT @UnwrappedPhotos: Watch @channingtatum and @jennaldewan in #STEPUP & #STEPUP2 on @ABCFamily at 5:30pm and 8pm Central TONIGHT! http:/ ... RT @schrievera: @channingtatum Driving 2 1/2 hours to see #TheVow this weekend with @alyssa_lozier, so excited!!!! RT @ditomontiel: THE SON OF NO ONE AVAILABLE ON DVD and BLU RAY TODAY! http://t.co/tE9wEQ77 http://t.co/7m9FaNyP Lucky! RT @mcdurbinators: @channingtatum You're gonna get 1 million followers soon!! How does that make you feel?? @kathryn_eurms Just started the account yesterday, so don't feel bad. RT @elizabeth_rocks: @channingtatum So excited for #MagicMike might actually pass out! 2012 is your year :) #TheVow #21JumpStreet #MagicMike It's called #MagicMike. Here's details: http://t.co/UwZ7RqiP RT @braveheart133: so tell me about this movie you and Matt Bomer are in My official & only @instagram is channingtatumunwrapped. All others are fake. RT @rubi_doom: @channingtatum which is ur official instagram? RT @b105lsa: @channingtatum and @JonahHill take over the show from 8am this morning! #21jumpstreet RT @skippy94: having flashbacks to last night..such a good movie & so sweet of @JonahHill & @channingtatum to stop by! Everyone NEEDS to ... Are you guys on @instagram? I just setup an account, so make sure you're following at channingtatumunwrapped. #21JumpStreet RT @fifi_box:Oh yeah @ChanningTatum & @JonahHill, never been so happy to be manhandled by men in uniform: http://t.co/xFWXdFB7 Love and appreciate all 900000+ of you!!! Thanks for the support! RT @unwrappedphotos: BLOG |  @JENNALDEWAN and @ChanningTatum at Mercedes-Benz Fashion Week (@nyfw) http://t.co/JcSCSSLK RT @becklouise94: The only thing that could cheer me up would be a RT from @channingtatum RT @nicolevitale_xo: @channingtatum thank you for this! you actually might have made me the happiest girl in the world http://t.co/S6mwAetN RT @thewallau: \"My sister met @channingtatum !! Said he was the nicest person ! http://t.co/VuavwFBL\" @BrittanyCordina Come hang out with me and @JonahHill at a live Q&A before Monday's pre-screening of @21JumpStMovie at @unswoweek… http://t.co/pi6kcSPY RT @summerlilybee: @channingtatum really like #TheVow - life constantly change&so do people, once we vow 2stick together,gotta keep the  ... RT @AJRAGQC_love: Just saw The Vow again! It was even better the second time (: @channingtatum RT @connorday: Just saw #21jumpstreet and the bar has been set for funniest movie for the year #nochallengersinsight RT @jonahhill: Leaving for Sydney Austrailia with @channingtatum . What should we do in Sydney? RT @bigpicandy: God I needed that. 21 Jump Street is the best comedy in ages. And the best high school comedy since Napoleon Dynamite. RT @21jumpstmovie: #FF #21JumpStreet @JonahHill @channingtatum @icecube @RobRiggle @BrieLarson @philiplord @chrizmillr @DeRayDavis RT @laindia2468: Really hoping @JonahHill and @channingtatum make a sequel to 21 JumpStreet! Great movie!  #21JumpStreet @21JumpStMovie RT @brides: We hear the adorable Rachel McAdams and @channingtatum have been killing it at the box office with #TheVow Have you seen it? RT @TheVowMovie: \"I vow to fiercely love you, in all your forms, now and forever.\" - @channingtatum in #TheVow http://t.co/JzdxkRyk http ... For everyone asking...@21JumpStMovie hits theaters March 16th! Get more info on the movie here: http://t.co/SYldZgCE RT @RallisP: Wow! 21 Jump Street is the best comedy since Superbad! Just an all around great time at the movies. 10/10 RT @boo_kay: Just saw #21JumpStreet at advance screening. I will pay to see it again! So funny!  @channingtatum @jonahhill make a great  ... RT @Chyna_Do11: 21 Jump Street was HILARIOUS! @channingtatum & @JonahHill were fools. It was 21 Jump St meets Hangover. @DeRayDavis went ... RT @lucianavee: 21 JUMP STREET = best comedy since THE HANGOVER. And I'm not exaggerating. RT @unestylishfille: But the movie I'm MOST looking forward to seeing this year is? @joemanganiello @channingtatum #MagicMike Can't wait!! RT @LATimesEnt: Would you help 'The Vow's' @ChanningTatum pick his next film? http://t.co/S62AJmYR RT @Kimmy_J28: @channingtatum- Have bribed the BF with 4hrs of uninterrupted Assassins Creed to be here to watch #TheVow, starts in 10mi ... RT @JonahHill: nope called him Tatum Tot RT @kewlfocus: Did you ever call Channing Tatum C-Tates? #21JumpStreet RT @JonahHill he is the greatest. He is going to shock you with how funny he is RT @T_Bizzy60: What was Channing Tatum like to work with? #TeamTatum ROCKS! Love you all! RT @thr: Box Office Report: 'The Vow' Earns a Record $11.6 Mil on Valentine's Day http://t.co/sPJnic66 RT @claire_redpath: Just seen trailer for new 21 jump street film with @JonahHill and @channingtatum. Looks so funny! RT @lindsdayanne: I would do anything for love, \nBut I wont do that, I wont do that.. &lt;3\n@channingtatum #TheVow Happy Valentine's Day Chenna (aka @channingtatum & @jennaldewan) fans! Check out our favorite pics of the lovebirds... http://t.co/Bg2JBfBk RT @hannahpazda: This is going to be a @channingtatum valentines day, The Vow, Step up, then maybe Dear John :) #goodeveningahead RT @TheVowMovie: What are your plans this Valentine's Day evening?? @channingtatum has a suggestion: http://t.co/Q4nVUAIJ ♥ http://t.co/ ... RT @SparksNicholas: The Vow tops record breaking weekend with 41.7 mil. Congratulations to @channingtatum & Rachel McAdams RT @yamimufdi: just met @channingtatum with @tedwardoted !! NICEST GUY EVER! Thanks again for the pic! :)  http://t.co/Ly0EMk6u RT @jennaldewan: And congrats to my love @channingtatum on a RECORD BREAKING box office weekend!! Amazing!!! RT @kourtneybell92: @channingtatum I saw #TheVow 2 times Friday, 2 times Saturday & twice today. it's THAT amazing. #soareyou #dedication &lt;3 RT @haileypelham: Still thinking about how much I loved #TheVow and loved Leo and how much he lovedddd Paige. :') gosh. @channingtatum RT @HeatherKindred: To be loved SO unconditionally & fiercely like Leo loved Paige in #TheVow is “my wish”..#TheVow is such a wonderful  ... RT @beccawaldron: @channingtatum Leo: \"I vow to fiercely love you in all your forms, now and forever.\"  #TheVow &lt;3 RT @alexandriathorn: @channingtatum \"are you trying to give me diabetes, or just get me fat?\" #TheVow #lovedit #oneofmyfavoritequotes RT @fhovae: \"I chose to stay with him for all the things that he did right and not leave him for one thing that he did wrong\" #thevow RT @theashleymullen: @channingtatum \"You totally love me!\" YES! I REALLY DO! #theVow #nojoke #bestmovieever RT @gracefirmeza: @channingtatum \"I hope one day I can love the way that you love me.\" - #THEVOW Jeeezz.. Seen the movie 3times already! RT @caaaaitxo: \"What? It's not like you've never seen it before\" Lmao #TheVow #favoriteline @channingtatum :-) !! RT @jennmarsh27: \"Did you just fart...\" \"no...okay maybe alittle\" (window gets done up) \"that's a little weird but romantic!!\" #thevow RT @gypsyfeverno1: \"oh nothing I'm just a little scandalized,its the 1st date & u're already inviting urself to stay the night\" lol #TheVow RT @sydneyrubinn: @channingtatum \"Leo was right\" #TheVow best line! RT @marissaautrey: 'How do you look at the girl you love and tell yourself it's time to walk away?' BEST line in a movie, ever. &lt;3 #TheVow What's your favorite quote from #TheVow? RT @nadiabrantonyo: \"Now can we have an awkward hug?\" @channingtatum .. YES PLEASE #TheVow Thanks #TeamTatum!! :-D RT @eonline: Sorry, Star Wars, the Force Is With Channing Tatum and The Vow http://t.co/7Vxhcgk5 RT @photognickzano: Channing, Hollywood - Channing Tatum, Hollywood, CA http://t.co/Z9Q6zgA7 HAPPY BIRTHDAY to my beautiful and amazing sister Paige!! http://t.co/9AlHJYDp Thanks for showing #TheVow love! RT @unwrappedphotos: BLOG |  Channing Tatum Fans #WatchingTheVow All Around the World http://t.co/K6UyYlHh RT @celenamruiz: It’s official. #WatchingTheVow made me cry harder than any other movie I’ve seen. You NEED to see #TheVow #NoExcuses Happy birthday! RT @hannahhgray: #WatchingTheVow #watchingthevow @channingtatum IT'S MY BIRTHDAY! REPLYYYY!! http://t.co/koBsp7tb RT @jodidetweiler: If you haven't seen the vow yet, make plans to. @channingtatum and Rachel mcadams are amazing. #bestmovieoftheyear :-) RT @jennaldewan: Ok everyone!! It goes without saying, but go see The Vow this weekend! It really is such an awesome gem of a movie 😊😊 RT @neverjaime: #watchingthevow In a couple of minutes! @channingtatum @TheVowMovie #TheVow #TheVow #TheVow holy crap! http://t.co/9K5qc7pE RT @crosbylovebug: Saw #TheVow and was blown away! Incredible story told by incredible actors! @channingtatum Youre breathtaking! Best o ... Let's get #TheVow to trend WORLDWIDE!  RETWEET if you're going to see #TheVow this weekend! http://t.co/pZL9AiWS http://t.co/tljZPdHG RT @friedrichmegan: Yay yay finally getting to see #TheVow !! Can't contain my excitement!! Full theater at 1:30 on a Friday.. Impressive! RT @lindseykaehne: On our way to see #TheVow. @channingtatum look what we are driving through to get to that movie! http://t.co/5ivCqZuu RT @LBettelyoun: #TheVow last night! @channingtatum! Love him!!! & loved the movie too! I cried of course & definitely recommend!! Looki ... @tampacatholic You're welcome! #gocrusaders RT @TheVowMovie: It's OPENING WEEKEND for THE VOW!! Let's celebrate by getting #TheVow trending!! http://t.co/8Bamn2eJ RT @MissEp3: Omfg #THEVOW was amazing !!! I cried 5 times literally ! @channingtatum & Rachel Mcadams were amazing! Ugh I want that type ... @BeeKay918 @Sonic_Dork10 @Sass_n_Cass @Tiffinii You won a signed poster from #TheVow! Follow @qfromctu and DM her your full name & address. The last 4 signed posters from #TheVow go to @BeeKay918 @Sonic_Dork10 @Sass_n_Cass and @tiffinii! Thanks to everyone who tweeted! RT @lindsaymiller29: 7 Minutes!!! Wooooo RETWEET RETWEET @channingtatum @TheVowMovie #thevow :) :)  http://t.co/LfYAENzA RT @chelsdellavalle: Tampa Catholic Highschool girls #watchingthevow #gocrusaders @brittanyanne234 @Livifernandez92 http://t.co/6VHEzh0A RT @deejaye00: @channingtatum #WatchingTheVow midnight screening! Sooo excited!! #welovechanning http://t.co/ZcU5gcsD RT @ashleyelkiwan: @channingtatum #thevow midnight premier!! #WatchingTheVow http://t.co/zZWUcReb RT @catayaratliff: leaving to see the vow! #watchingthevow #myotherhalf #happybirthdayme #thevow #perfection #love http://t.co/ApXM4Y5L RT @jaimielouisee: Our well thought out #watchingthevow pic!!!! Midnight #thevow showing with @whiterussian08 http://t.co/FvgCJNZ8 RT @christapiaa: #TheVow IS FINALLY TRENDING WORLDWIDE!!!!!!!!!!!!!!! Yaaaaaaaayyyyy!!!!!!!!!!!!! @channingtatum @TheVowMovie RT @shanimal_x0: Ready to watch #THEVOW at midnight!! Only half hour left! #pumped #excited #watchingthevow !!! :)  http://t.co/pff3T9ID RT @kaywick03: @channingtatum at the midnight premiere!! #WatchingTheVow soooo excited. #dedication #TrueFans #TheVow http://t.co/Tf32U0qO So many great photos from tons of midnight screenings! Make sure you follow #TheVow fans at the #WatchingTheVow hashtag and keep'em coming! RT @francelikeparis: @channingtatum #TheVow #MidnightPremire #Love #SoExcited #WatchingTheVow http://t.co/LREZ3SVl RT @carolineaking: @channingtatum @TheVowMovie #WatchingTheVow #midnightpremiere #TheVow http://t.co/81dTuLxo RT @mauranealon12: @channingtatum #TheVow midnight premiere!! http://t.co/aCH9d4lF  #WatchingTheVow &lt;3 RT @lexfish13: @channingtatum midnight premiere #dedication #welovechanning #bestmovieoftheyear http://t.co/kKL6rd8t #WatchingTheVow :) RT @megzmihalo8: @channingtatum #WatchingTheVow SO EXCITED! VOWED to get here 3 hours early and I did. #dedication http://t.co/RpktwdVV RT @daniellecalhoun: Ahhh just bought our tickets!!! Can't wait!! @channingtatum #watchingthevow http://t.co/cwDExeCE RT @theellenshow:My audience needs to learn how to behave themselves.Channing Tatum left here with $43 in singles tucked into his underwear. Can't thank you enough for chatting with me at #AnEveningofVows on @ConstellationTV! You guys were amazing! Let's hang out again soon! Love it! Thanks! RT @vanessamasker: #TheVow #watchingthevow @austinbuhman94 @aaaalexxxxxxxx http://t.co/YURH8RLf AND we're back! Love you guys for sticking around! Join me at #AnEveningofVows... http://t.co/8DOlWthG RT @ConstellationTV: Hi Chan fans!   So many of you showed up to support him that we couldn't hold you! Come back at 6 PM PST/ 9 PM EST  ... Hey everybody! Thanks for joining in on #AnEveningofVows. We're restarting at 6:00pm Pacific! @xo_lisamariie We're working on it. RT @TheVowMovie: T-Minus 5 minutes 'til @channingtatum hosts #AnEveningOfVows!! Join NOW! http://t.co/RhK4LPwm #TheVow RT @TheVowMovie: The Vow is currently trending in 11 cities - think we can get it trending worldwide?! #TheVow http://t.co/8Bamn2eJ RT @christapiaa: Lets Get #TheVow TRENDING WORLDWIDEEEEE!!!!!!!! @TheVowMovie @channingtatum RT @constellationtv: @ChanningTatum - live on Constellation tonight at 8:00 PM EST. Get your free ticket now! http://t.co/gcxaMPIu #TheVow RT @jessicalleger: 6 MORE HOURS! I've never ever ever been so excited to see a movie! :) @TheVowMovie @channingtatum #WatchingTheVow RT @iJoanneGonzales: I sooo love @channingtatum , done #WatchingTheVow. made me laugh, cry & most of all believe in LOVE again. &lt;3 &l ... Who's going to a midnight screening of @TheVowMovie tonight? Tweet pics of you and your friends at the theater #WatchingTheVow so I can RT! @BarriosAbii @Filomena_0313 @KimHStanley @nleckliter You're the lucky poster winners! Follow @qfromctu and DM her your full name & address. Giving away 4 more signed posters!! Tweet this for a chance to win ===&gt;&gt; Can't wait to see #TheVow TOMORROW! http://t.co/OW6nwT0c Ready for more signed poster winners? Congrats to @BarriosAbii @Filomena_0313 @KimHStanley and @nleckliter! #TheVow RT @chad_hodge: I'm writing a play 4 @hwoodrush get ur tickets now! Even better: @jennaldewan @laurabenanti @DaveKrumholtz performing! h ... RT @tvfilmtalk: Ladies, I feel I should warn you, @channingtatum shows his naked butt in #TheVow. I'm a straight man, but even I admired it. RT @rosienaugle: It's #JerseyShore day! Tune in tonight while @channingtatum and Rachel McAdams host the show!:) RT @Himynameaustin: Opening day for The Vow is like the Call of Duty release date for guys. @danielaedge @iKhoiBui Congrats on winning the signed posters! Follow @qfromctu and DM her your full name and mailing address. Thanks! RT @TheVowMovie: #TheVow is trending in Houston! Let's keep it going!! http://t.co/2eesqlsP Let's try! RT @thevowmovie: @channingtatum Shall we get #TheVow trending??? ♥♥ The 1st 2 winners of signed posters from #THEVOW are @danielaedge & @iKhoiBui! I'll announce the other 8 winners tomorrow. Thanks everyone! RT @RealitybyRach: @channingtatum went to an early screening of #TheVow ! and it was sold out! Happy people are stoked for the film, bum ... RT @miss_bebabaybee: Just got home from watching a screening of @TheVowMovie loved it cried @channingtatum if i loose memory i hope you  ... #21JumpStreet RT @theplaylist: Damn, Phil Lord and Chris Miller need to direct every action comedy. Giving away 10 signed posters! Keep tweeting this for a chance to win one ==&gt; Can't wait to see #TheVow FEB 10th! http://t.co/OW6nwT0c Want to win a signed poster from @TheVowMovie? Tweet this ==&gt; Can't wait to see #TheVow FEB 10th! http://t.co/OW6nwT0c #countdowntothevow RT @rainnwilson: The 1st time I watch \"The Vow\" it'll be for Channing Tatum. The 2nd time it'll be for Tatum Channing. RT @maddywait: @channingtatum is on @TheEllenShow tomorrow!! I can't find the words to describe how excited I am!! &lt;3 RT @drewgrath: @channingtatum In anticipation of #TheVow this is mine & @HartLa  background so it's the 1st thing we see  in the AM http ... I'm hosting \"An Evening of Vows\" on @ConstellationTV tomorrow night! Get ur FREE ticket to join the live chat: http://t.co/zDzHO6f4 #TheVow RT @jessicaanair: #countdowntoTheVow @channingtatum  only 1day left in Australia till #THEVOW comes out!! Can'ttttt waiiiiiit! RT @youngdoll_430: @channingtatum is trending here in the Philippines! Wohooo! The Vow movie will surely be a hit! Hurray for Chan & The Vow Check out @ChanningTatum and @JennalDewan's personal pics from last night's world premiere of @TheVowMovie... http://t.co/in2Ntz5a \"@TheVowMovie makes for a wonderful - if a bit teary - romance that is brilliantly acted.\" via @empiremagazine #countdowntoTheVow RT @labellabucca_: 3 dayyyyyysss til I'm sitting in the theater.. laughing, crying, loving. So excited! :) #thevowcountdown @TheVowMovie ... RT @pushinsky: Great article about @channingtatum http://t.co/6x3uDYzC  #thevow RT @UnwrappedPhotos: Could @channingtatum and @jennaldewan be any more adorable at tonight's premiere for @TheVowMovie? Such a cute coup ... RT @thevowmovie: Noticed a lot of you using the #hopelessromantic hashtag for #TheVow...think we can get it trending?! #countdowntoTheVow RT @sobrepenaa__: when @channingtatum says \"I need to make my wife fall in love with me again\" *fangirlscream 4 more days , #thevow &lt;3. RT @UnwrappedPhotos: Video & exclusive pics of @ChanningTatum & @JENNALDEWAN at @HaywireFilm premiere: http://t.co/5h7uBbgO Pics from #T ... RT @ChineseTheatres: The Vow premieres #Tonight @ 7:30P! Celebs arrive @ 6P. Come see Rachel McAdams, @ChanningTatum & Sam Neill! Live:  ... RT @21JumpStMovie: Brand new #21JumpStreet web site: can you handle it? http://t.co/fRBxjYqm RT @ajragqc_love: @channingtatum 4more days till #TheVow ! Technically 3 cuz I'm goin at midnight&lt;3 so excited! *4 days&lt;3* #Countdown #FEB10 RT @ccoronado215: 4Days until #TheVow comes out with @channingtatum I am ready 2laugh 2cry but most importantly 2Love :) #Countdown #FEB10 RT @UnwrappedPhotos: BLOG |  Channing Tatum Takes Saturday Night Live by Storm http://t.co/5zslN3mE RT @ivylorenzo: After SNL last night and with #TheVow in 5 days, I now declare February 2012 @channingtatum month. #Countdown #FEB10 RT @jennaldewan: Kiss after the show...second best pic of night  http://t.co/7s0hsCkC SATURDAY NIGHT LIVE: Download a photo recap, watch @ChanningTatum’s hilarious skits & check out more exclusive pics... http://t.co/OLg4OjR4 Thanks to everyone for all of the sweet tweets about @nbcsnl! Glad you enjoyed the show! Backstage at @nbcsnl with the Fam!  http://t.co/AYaknI6F RT @porcelain_babe: @channingtatum dancing to LMFAO. Okay, THAT was good. #goodtimes #dirtydancingatabarmitzvah RT @snl2016: Best opener for SNL ever. @channingtatum uh enough said. RT @nbcsnl: Live from New York it's @channingtatum and @boniver!  #SNL RT @hitrecordjoe: Photo: My boy’s gonna kill it, watch!! #SNL http://t.co/VJDxgMrn RT if you agree! RT @sororityproblem: At this point I just want to go to sleep and not wake up until #TheVow comes out. #Countdown #FEB10 ;-) RT @jennaldewan:Everyone please tune into @nbc SNL tonight as my amazing hubby shows the world how hilarious he is:) it's gonna be good! Happy Birthday Mama @KayTatum &lt;3!!! http://t.co/C2Mhdzhy RT @chrizmillr: Check out @channingtatum tonight on #SNL. Everyone from #21JumpStreet already knows how funny he is. Now you will too. RT @azihr77: Only 6 days in the Philippines!!! #THEVOW @channingtatum #occupyChanning http://t.co/yITV3sxO #countdown Thanks everybody! RT @pretty_synful: This is all for you @channingtatum #occupyChanning http://t.co/L4d90waQ RT @mags2626: #dedication #MissionSNL @channingtatum http://t.co/qQCNepuJ RT @mtvnews: You'd think stripping would eliminate nerves but #TheVow hottie @channingtatum is 'nervous' to be hosting @NBCSNL! http://t ... RT @semorrison83: @channingtatum My wife & I's 5th wedding anniversary is the 10th! Guess what we're going to see? #CantWait for #THEVOW!! RT @nbcsnl: There's so many people in these @channingtatum / @boniver promos! SO many people! http://t.co/Dx1YPAQm #SNL #GetExcited #Feb4SNL RT @jennm224: @channingtatum A week from today I will be watching @TheVowMovie :) 7 days 7 days 7 days 7 days 7 days Can't wait!! #countdown RT @whitneyrbarth: Pic stolen from Brea! Prescreening of The Vow tonight! #soawesome #incrediblemovie http://t.co/sllEwTXW FEB 10th :) RT @amihewittking:Oh my,just seen an advery for the vow HELLO @channingtatum any1 know when its n cinemas n england? CANNOT WAIT #Dedicated! RT @rachelinthecity: 1st in line 4 @nbcsnl standby tkts to C @channingtatum. Brrr it's cold don't know if I'll survive 2 nights. **COUGH COUGH** Just in case he didn't get the hint. RT @sammanthaa_a: Definitely Gonna Go Watch #TheVow! Cough Cough...@EdwardRamos6 Keep tweeting your countdowns to the FEB 10th release of @TheVowMovie so I can RT one from a fan every day. #TheVow #Countdown #TheVow #Countdown RT @sandisummit: @channingtatum @TheVowMovie SOO EXCITED!! 8 more days! http://t.co/Px9KiCGa @marcee12 @julsve @britttbrittt25 @AshleyAnnP26 @Karlien83 @whittibj Congrats on winning! Follow & DM ur name & mailing address 2 @qfromctu. Thanks for submitting your vows! Here's the winners of CTU's contest... @marcee12 @julsve @britttbrittt25 @AshleyAnnP26 @Karlien83 @whittibj RT @thrmovies: SXSW 2012: Jonah Hill's '21 Jump Street' Added to Film Festival Lineup http://t.co/Vn4fTgmH #TheVow #countdown RT @natatacktack12: Happy February everyone! 9 days till The Vow can't wait!!! Mmmm @channingtatum Hosting @nbcsnl this Saturday! Check out new promos and my dirty dance with Fred Armisen... http://t.co/3Ly2e5bB #GetExcited #Feb4SNL RT @unwrappedphotos: Did you catch @channingtatum on @CBSThisMorning? Here's a few pics... http://t.co/rOuB0PdT RT @mynameiscoral: someone get me some depends b/c i'm peeing myself in excitement for #TheVow!! should be the #BestChickFlick of 2012! :) RT @CBSThisMorning: Plus @ChanningTatum stops by in the 8am and we’ll celebrate @Late_Show David Letterman’s 30 year milestone. http://t ... RT @jonmchu: One more thing... You can get a sneak peek at the brand new #GIJoeRetaliation SUPER BOWL commercial TODAY!!! on Entertainme ... Last day to submit your vows & enter CTU's contest! Join me at “An Evening of Your Vows” on @ConstellationTV FEB 9th... http://t.co/aYp4yEPF RT @meganann05: If I woke up from a coma and @channingtatum was my husband, I wouldn't question it #justsayin #TheVow Here's the address: http://t.co/ujxYvXTU RT @lildevilsk: @channingtatum Can you write me your fanclub address? RT @nbcsnl: We're back LIVE this week with host @channingtatum and musical guest @boniver!!  #GetExcited #Feb4SNL RT @Babyvikes21: The Funny Thing About @KellyRipa's Pic Of @channingtatum On #livewithkelly This Morning.Its The Same Picture On My Desk ... RT @Kompolt4Good: Just received a box full of @jennaldewan clothing going up for auction soon to benefit @afarl!  Stay tuned... /cc @qfr ... .@ChanningTatum and @JennalDewan’s JAN 2012 Press http://t.co/wUHZoy2J via @UnwrappedPhotos @CosmoOnline @cineplexmovies @EW and more!  -Q RT @unwrappedphotos: @21JumpStMovie just released 2 new posters! Take a look at all 3. Tell is which one's ur favorite! http://t.co/39YTC4HK RT @livekelly: Here's a picture for @danielabrams girlfriend! @channingtatum #livewithkelly http://t.co/gOTOAULj Make sure you tune in to watch  @channingtatum on LIVE! with Kelly (@LiveKelly) TOMORROW!! http://t.co/ZK0an69k RT @RACHELFOX5: Great interview today w/ Rachel McAdams & @channingtatum 4 #TheVow. Like my movie poster w/Chan? ;-D http://t.co/LIBuMsFQ Awww RT @im_hungery: My mom asked if I want to see the Vow w/ her when it comes out, I said only if we can hold hands & share popcorn #date :-DRT @nbcsnl: Here's hoping you all woke up & smiled this morning cuz SNL returns live next week w/ @channingtatum & @boniver!! #SNL Nice... RT @ThePlaylist: 'The Vow' Soundtrack Features The National, Lykke Li, OK Go, The Cure & More http://t.co/2JBL9tKf RT @thevowmovie: Are you attending “An Evening of Vows” w/ @channingtatum? RSVP here http://t.co/reztlFkJ #TheVow http://t.co/DKoubxbu RT @jonahhill: 21 Jump Street. March 16th! Its beginning: http://t.co/1yba8IDT @ctatumgermany Thanks for the support! RT @HaywireFilm: Like our star, @channingtatum and check out his facebook page for more news! https://t.co/PT63be5I “@philiplord: Thanks a lot @JonahHill now we have to change all the posters #21JumpStreet #Oscars #ExploitJonah” Leo tries to spark his wife Paige’s memory with a late night skinny dip in this exclusive new clip from @TheVowMovie: http://t.co/15PNewDu RT @YahooMovies: Mmmmm! Watch @channingtatum help Rachel McAdams remember her favorite sweets in our exclusive clip from @TheVowMovie. h ... RT @rachellturner_: 2 weeks/17 days/413 hours until The Vow comes out!! It's not like I have a countdown app or anything ;) @channingtatum 500,000 \"likes\" is not too shabby! Join the community and see what all the fuss is about on our official Facebook page: http://t.co/FKw4EQKa NYC FANS! Ur invited to a FREE Girls Night Out screening of @TheVowMovie on 1/25! Pre-party w/ makeovers & gift bags! http://t.co/008te1HF RT @UnwrappedPhotos: BLOG |  Behind-The-Scenes with Channing Tatum at the ‘Haywire’ Press Junket http://t.co/k6CZeTWc Watch the network television premiere of #GIJoeRiseofCobra on @USA_Network February 4th!! http://t.co/Ogr7RpvA http://t.co/vSQ9V5Rq @inairweretowers @Ryan_Sousa @SmLittleSecrets @greekcheeze @AYLY301 Congrats on winning #Haywire t-shirts! Follow @qfromctu & DM ur address. RT @AYLY301: #GOHAYWIRE #IWentHAYWIRE @channingtatum http://t.co/VtQIQwTt RT @greekcheeze: #IWentHAYWIRE and now I've got a deer through my winshield http://t.co/sAU5U2iJ RT @SmLittleSecrets: #IWentHAYWIRE at midnight yay it was a kickin butt movie go see @ginacarano @channingtatum kick some ass. http://t. ... RT @Ryan_Sousa: #IWentHAYWIRE When That Tumbleweed Crossed The Whole Frame http://t.co/SgUvRj2b RT @inairweretowers: @channingtatum #IWentHAYWIRE and it was incredible! You and Gina were perfect! http://t.co/E6up93tW Thanks to everyone who saw @HaywireFilm and entered CTU's #IWentHAYWIRE contest! Check out the next 5 retweets to see the lucky winners... Here's info on my FEB 9th live fan chat for #TheVow: http://t.co/R8Edrebt RT @atorinaaa328:@channingtatum what is this live chat I see? :-) RT @xsaffx: Woop! got my ticket for the @channingtatum live chat for The Vow! It'll be 1 AM here when it starts! That's dedication :p xx @prattprattpratt Thanks Pratt! RT @prattprattpratt: About to go watch #Haywire with the Mrs.! Looking forward to seeing my buddy @channingtatum and that bad ass MMA ch ... Get details on @TheVowMovie's red carpet premiere & find out how to join me in my live fan chat on @ConstellationTV: http://t.co/l5s8YZ8j 750,000! Thanks is probably not enough, but THANK YOU for each and every one of the follows, RT's, mentions and all the support! &lt;3 you all! The contest is open to everyone! RT @simontree: @channingtatum UK able to enter? Or just a US thing bro? #GOHAYWIRE today and tweet a pic of your ticket stub with the hashtag #IWentHAYWIRE for a chance to win a t-shirt! RT http://t.co/1hNSZBWh RT @LarendaWray: @channingtatum @qfromctu my #GOHAYWIRE pillow is here & I saw the movie last night...AMAZING! @ginacarano is a BADASS!  ... RT @UnwrappedPhotos: .@channingtatum and Rachel McAdams at today's photo call for @TheVowMovie in Munich, Germany: http://t.co/b0hiHNfp  ... RT @CungLe185: Watch @HaywireFilm with @ChanningTatum & @ginacarano Directed by Oscar winner Steven Soderbergh! Just shows how far #MMA  ... Want some @HaywireFilm swag? #GOHAYWIRE opening night (JAN 20th) and save your ticket stub. It may just come in handy … http://t.co/ocEEtQ4E @kerrichavez That's cool! Thanks! RT @babyellysmommy: @channingtatum everyone is excited to see #TheVow :) http://t.co/C5qOOG7K #trendingtopic #GOHAYWIRE in UK theaters TODAY! RT @jimmytotheo: A fun @HaywireFilm interview with @channingtatum! http://t.co/RJSGRB96 #MAGICMIKE #GIJOE UK FANS! Did you miss @channingtatum and Rachel McAdams' interview about #TheVow on @itvthismorning today? WATCH HERE: http://t.co/Tzozvvo4 Excited to be in the UK and Germany this week to kick off the international press tour for @TheVowMovie! It hits theaters FEBRUARY 10th! RT @raemurillo: Oh. My. God. My abs hurt from 21 JUMP STREET. Yes, it is that good. RT @devincf: JUMP STREET is very much a post-HOT FUZZ action comedy. Smart, self-aware, packed with jokes and fun action. RT @slashfilm: 21 Jump Street is surprisingly hilarious. Maybe the funniest High School comedy since Super Bad. RT @colliderfrosty: laughed my ass off watching 21 JUMP STREET. And so did the theater. Sony has a big hit. .@ginacarano has this incredible skillset. That's what Mallory is in #Haywire. She's smart, she's tough & she's lethal. http://t.co/JciLN4Qt RT @ryanrfc123: @channingtatum any chance of a RT for a uk fan :-)  haywire tickets are booked me n 5 mates are going :) RT @missgvip: @channingtatum Please RT , My FB page all a-buzz over #thevow ! All my friends love them some CHAN .. & love stories! http ... Happy B-Day! RT @stephdonoghue: Can I get a birthday tweet? I'm 22today!! Booked #Haywire for tomorrow as part of my celebration #Gohaywire Thanks! RT @jonasfan4life93: @channingtatum I can't wait to see The Vow!!! I got 10 people to see it with mee :) I hope you see this &lt;3 @nnattaliie Noticed :-) RT @pinkylovejoy: Meeting @channingtatum twice in one week? Best week ever! Doesn't hurt that he's the nicest guy ever - SO fan friendly ... RT @haywirefilm: FOUR days till Haywire. RT if you're amped for it to hit theaters this weekend! #gohaywire .@GOLDENGLOBES RECAP: Check out @ChanningTatum & @JENNALDEWAN in new pics and red carpet interviews... http://t.co/wIJZcPpo #GoldenGlobes -Q Backstage at the @goldenglobes with @jessicaalba!!! http://t.co/qw1OoRzZ"}