{"tweets": "Did I say Monday for the video I think I meant Wednesday 😩\nAhh fuck honestly guys we want to make sure we’re 100% happy with it before we share it with you. We’re getting really excited to show you all but it needs a few more final touches ♥️ Okay we’re gonna call it Monday. NEW VIDEO MONDAY (unless anything comes up and we have to change it Hahahah) AAAGGGHHHHHH Our fragrances are back! \n\nhttps://t.co/zrniNVbVgD SIGNATURE SCENT RESTOCK TOMORROW BABY I just talked to E and my grandpa for 5 hours straight and I don’t think we all stopped laughing the whole time hahaha. Also I just got home and it’s 3 AM.. lol that was a fun night with the boys! 😂 Ethan just came running out of the grocery store as I was circling the parking lot waiting for him and he jumped on my hood acting like I hit him with my car. He was screaming at me causing a scene now everyone is staring 😪 I feel most grounded and present when barefoot. There’s something about feeling the earth beneath me with every step I take that is so comforting. It really shows you that our planet supports you. Also it helps me stay in the moment bc if I don’t, I might step on something poky https://t.co/P6pOdH4iJg @dominantdolans @EthanDolan You are so sweet 😭😭 thank you so much for all of your support ♥️ &amp; thank you especially 4 all of the support in the past 2 weeks. Me &amp; E needed it a lot and you guys really had our backs 😭\nI feel like I’ve grown more in this short time than I have in years. I will take the lessons you’ve helped me learn w me with me for the rest of my life♥️ Not to sound cheesy but I really don’t think the words exist to explain how grateful I feel to have all of you in my life. You have all been the most accepting and unconditionally loving and supportive friends that I could ask for. I FUCKING MISSED YOU GUYS 😭 lemme get up to date on my timeline brb ♥️ Hi ♥️ https://t.co/PZXrNoqACQ Thank you guys so much. We love you all ♥️\n\nhttps://t.co/TWyBoD81Xq 9 MINUTESSSSSS RT @EthanDolan: The video is complete 😭🥵 Tomorrow is going to be a really important day in me and E’s lives. I’m kinda nervous but I’m also very excited. Thank you all so much for the extra love this past week 😭 I love you guys the most ♥️ @ohhdolan @EthanDolan Thank you for sharing this ♥️ Love you Haley @AverageShan @EthanDolan @PAINKILLERGRAY @Smiling_Ethanx @EliDukart @nocturnaIgray @joculardolan @girlcrushdolan @MimiMaibe @garlic_dolan I love you guys 😭♥️ I love traveling so much I need to do it more. This is actually me saying I AM going to do it more. God even gave me this annoying ass travel buddy idk why I haven’t put him to good use yet. Well I’m going to. The world is such a wonderful place 😊 https://t.co/pf05Sil0D2 @shanedawson ♥️ RT @EthanDolan: Filmed something very personal and important to us. A message we’ve been wanting to share with you for a while now. Thank y… Hey... There won’t be a new video up tomorrow. Ethan and I want to take our time with this one. It’s a really important video for us. We also want to thank @shanedawson so much for helping us and having this conversation with us that we will share with you next week ♥️ I just yawned while I was watching a video of a sea turtle and then THE TURTLE YAWNED AFTER I DID. I didn’t know yawning was THAT contagious Ethan keeps walking in my room with his fucking shirt over his face. He won’t come near me or stay in my room for more than 3 seconds. Why am I being quarantined doesn’t he know that HE got me sick?? I hate being sick FUCK AUGHHHB AWW WAAAAAHhh 😭 @joculardolan @EthanDolan This is so cool 😩😭 it def put me in the Halloween spirit thank you so much for this ♥️🎃 @EthanDolan I wasn’t yelling THIS WEEK’S VIDEO IS UP\n\nhttps://t.co/qBfNSyylta\n\n😩😩 Ethan is a tough big little brother to have 33 miinnnsssssss :   ) I think I remeber Ethan coming in my room at like 5 AM last night and just talking like we were already mid conversation. I was dead asleep. And he was just like “ayo breakfast was great today let’s do that again tomorrow!” ... like what Me and Ethan ordered the iPhone 11 at the same exact time and he got his and I didn’t.. is this because he was born first? It’s not my fault I got stuck 😔 WE GOT NEW SPOOKY MERCH\n\n🎃💀👻\n\nThey’re my new personal favorite obvi :)\n\nhttps://t.co/PFpb5KYE0k SHAWTY BADDD 🥵 https://t.co/B6tjF2TwOa My older bro Jeff is trending worldwide on Twitter rn 😂 THIS WEEK’S VIDEO IS UP!!\n\nFt. @JeffreeStar \n\nI was really nervous before filming but I can honestly say it was one of the most INSANE experiences that I’ve ever had and I’m really glad we did this :) \n\nhttps://t.co/G7td96i4hh 33 MINUTES AGGHHHHHHH Happy Monday. This week is whatever you want it to be because it is your bitch so make it good 😎 When you and all of your twin brothers are in a goofy mood 🤪 https://t.co/A6w15lOoe6 Don’t let bad people make you a bad person. ITS HARD, but you just gotta worry about you. Keep up the positivity and spread that shit. You’ll get what you deserve.♥️ I just texted my massage therapist \n“Great, see you turnbuckle” ... HOW TF DID “then” AUTO CORRECT TO TURNBUCKLE? I didn’t even know turnbuckle was a word. 😑 @TOXlCBAILEY That’s what I’m saying I woke up to this cute ass text from my Grandpa this morning 😭 as if I wasn’t already excited enough to be a Dad one day https://t.co/HyxseAmSCl @MIDNIGHT_GRANT I wish 😔 THIS WEEK’S VIDEO IS UP\n\nDef the best special guests ever \n\nhttps://t.co/Tf0l8wkfPT \n\nCheck it out if you wanna 🙂 39 MINUTES I CANT WAIT FOR YOU TO SEE THIS TUESDAY’S VIDEO NEVER QUIT ON YOURSELF. If there’s something you want it’s probably not going to come easily or happen overnight. There will be a lot of ups and downs along the way but if you believe in yourself and don’t quit there’s NO WAY you won’t succeed. You got this. @elinlovesdolan @dolanzzrose @EthanDolan Wow this just made me so happy. I never thought people would watch our videos on a date. That’s like the cutest/coolest thing ever. Wow. Thanks guys Going shopping with Jeffree right now... \none like = one prayer for my bank account 🙃 Doing something I never thought I’d do like ever today. I was nervous af but not gonna lie I’m feeling pretty empowered already... Today was fucking craazzyyyy. Tomorrow is about to be INSANE https://t.co/ztaE3TkLLR @Iuxegrant Yeah I learned how to do handstands @naivethan I can do handstands too @urbanwrecks 1 year When you think you got a text from your friend but it’s just your mom reminding you to call your grandpa for his 78th birthday next Thursday https://t.co/Do842AjCnk The best part about being a twin is that I always have someone who knows exactly what i’m thinking. For example today Ethan and I went for a run and he knew I didn’t want him there so he left. @EthanDolan @PURGINGANGEL @EthansPig THAT THE FLUCK. I JUST SPAT MY COFFEE We did curse words because we’re edgy teens ☺️ THIS WEEK’S VIDEO IS UP! FINALLY!! \n\nHappy Wednesday 😩\n\nhttps://t.co/Wj26rc47a7 52 mins 😊 For those of you that just started school just know, you got this This sucks I HATE this feeling :/ I’m so sorry about the video. It WILL be up tomorrow. Sometimes there’s just nothing we can do We’re having some technical issues the video maaaay be up late today 😩 @beachydolz @EthanDolan This is so cute! 😭 thank you guys!! Happy maufuckinntuuuuuesdsayyyyyyy 🤪👾 @LARRAYXO I heard this happen from the bathroom and my immediate dad instincts kicked in... I knew someone needed saving, but I needed wiping. This was stressful for me @EthanDolan Yeah that’s what I’m saying Just took a photo with a sweet little fan and when I went to introduce myself she stopped me at “hi I’m gr-“ and goes “I know who you are, you’re Ethan and Dolan” I’m the only other person in the car with you right now.. now I know ur in ur feels u little bitch. Plus we’ve only listened to replay by Iyaz https://t.co/QdQMKn0Y3w @LARRAYXO Peppa An aesthetic, peaceful beach day ☺️💕🍃🌸 https://t.co/rtNMEkkiCI Earlier Ethan asked me if I wanted a water, so I said yea. He came back with his own water but not one for me. I asked where mine was and he said oh I just wanted to monitor your hydration but I’m not your servant.. @khaIidgray Don’t shmoke never shmoked never will @MIDNIGHT_GRANT @EthanDolan :)))))) NEW MERCH!! PROBABLY MY FAV SO FAR ☺️😩\n\nhttps://t.co/PFpb5KYE0k @AbbyMil34772837 @EthanDolan ♥️♥️♥️♥️♥️ Fucking piss ass fuck ass 😎😎 https://t.co/upG1PMug3G RT @LARRAYXO: so \n\nwe tried to teach the twins how to play roblox.. \nhttps://t.co/tLU8WfoR6L https://t.co/yd2S7OUqdU THIS WEEK’S VIDEO IS UP! \n\nI had separation anxiety from twin \n\nhttps://t.co/6xR0bPUBrX NEW VIDEO IN 8 MINS @Tishdolan16 @EthanDolan 😭😭 thank you I love you guys Good morning and HAPPY TUESDAY 😩 OMFG FAN BOYING RN 😭 https://t.co/SKZWYRDhJ4 @tangledoIan I miss that little mans. I hope he’s doin well All I need is my twin tbh @dolansftgrande_ @EthanDolan Childish gambino it’s a banger @twaimz Can he say my name please 😭 @AbbyMil34772837 @EthanDolan Love you Abby ♥️ 67 days until Halloween... but who’s counting? Probably only me 😔 I’m on the phone with my mom and she told me I’m not allowed to put out Halloween decorations until September 1st... she also said I’ve been like this my entire life hahah HAPPY SATURDAY When you get home from the beach and finally shower and a pound of sand falls out of your ass crack 🤩 My. Eyes. Watered.\nI really appreciate you sharing this with us Rosemarie♥️ I’ve been there before and I know what that’s like feeling stuck :/ i’m so happy we were able to help you out with that.. https://t.co/TTNEHhuzBV @suhgrays @EthanDolan Thank you Emily 😢♥️ love you @dairyfree_dolan @EthanDolan Just you tweeting me is enough 😭😭 thank you so much for this♥️ MY SISTER GETS TO TOWN TODAY 🤩🤩 I’m happy af THIS WEEK’S VIDEO IS UP!! \n\nI embarrassed the shit out of myself hahaha\n\nhttps://t.co/jC9ybbvXts Hey guuuuuuuyysss 29 MINUTES AHHH Wow my heart... ♥️ this really means a lot to us thank you lily https://t.co/HPwCP2uk1v I just woke up this is not good 😩 We took our grandparents to see the Hollywood sign today Hahahah it was mad cute THIS WEEK’S VIDEO IS UP...\n\nFuck. \n\nhttps://t.co/zmB8IJkjn9\n\n😭😭 29 minutes 😬😬 E and I flew our grandparents out to LA today. On the drive home I asked my grandpa if he’s ever seen a palm tree in real life before and he said only a plastic fake one hahaha I’m glad I could show him something new  😂 BRO. I’m fucking scared https://t.co/JxElQd0caa Yo @EthanDolan do you think we’ll be able to sing after this shit? Like when our noses are fully healed? Hey guys, I’ve really had to rest the past few days. Recovery is recovery but I’m so excited to be healed soon and breathe out my nose for the first time 😩 This week’s video is up 😌\n\nhttps://t.co/NbgxjblIlY\n\nWe needed to work on our sharing skills... very badly Happy Tuesday everyone! Going in for surgery soon. E just went in hahah oh boy. Hopefully I don’t tweet some crazy shit when I’m out 😅 Me and Ethan both have sinus surgery tomorrow. The doctor says we’ll be loopier than we were after our wisdom teeth removal... Took a well needed trip out of the city never felt better I’ll be followin for the rest of the day ♥️ 8MIL WTF!?!? Thank you guys so much!! Who wants a follow? RT to lemme know :) Reunited with Ethan today after 48 hours. There’s something about not being with your twin that singletons will never understand. I MISSED THIS MANS!! THIS WEEK’S VIDEO IS UP\n\nhttps://t.co/z7fjDIr5yn\n\nAight he got me :/ I miss my famo :/ @RosannaPansino @EthanDolan Thank you Rosanna!! WAIT WHAT?!? We’re more than halfway sold out already??? You guys are the best 🥺 If you weren’t able to get one of our signature scents before they sold out DONT WORRY BECAUSE NOW YOU CAN haha\n\nLimited quantity avaible!! Sooo get yours while you can :) \n\nhttps://t.co/zrniNUUjS3 RESTOCK OF OUR SIGNATURE SCENTS IS LIVE IN 5 MINUTES!!! AHHHHHHH Ethan made me check the label to see if it was dairy free https://t.co/pfaewpw6BA You’re good exactly how you are. Please do not change yourself THIS WEEK’S VIDEO IS UP \n\nhttps://t.co/E50rP7IatB\n\nI got @EthanDolan SO FKING GOOD OMFGGGGG FFFFFUUUHHKKKKK 17 MINITEYATSSSSSSS 😩🤪 H A P P Y T U E S D A Y I got Ethan GOOD in tomorrow’s video I don’t care what he says don’t listen to him Please respect our privacy https://t.co/HtP1WxOn9V I love this!! Hahah ♥️♥️ https://t.co/j6qotgpnHd Me and E we’re just talking and it hit us really hard. Like we’ve always loved you guys (obviously) but like we love you guys A LOT A LOT. Want you to know that :) We will always have each other 💯 literally got all of your backs no matter what. I fucking love you guys ♥️ Ohhhh shit thank you big bro!! https://t.co/M5rapzvHPP @EthanDolan Really really......... Old THIS WEEK’S VIDEO IS UP\n\nhttps://t.co/DG43gIbTRJ\n\nWe built a house in a day like we actually did then we lived in it :/ 😫 31 MINUTES AHHHHHHHHHHFFFFFFFFUUUUU Having a very pleasant day rn I hope you are too ♥️ @loopydolanns Just made some coffee and cucumber water wby @grayspcakes Omg heyyy ☺️ Hey Appreciate your life. Enjoy the struggles and hard times because one day you’ll be looking back on them feeling so proud of yourself for overcoming all that you have. Guys I really am at a loss for words... Our fragrances sold out 😩😭🤯🤯\n\nWe are working on a restock. We will keep you updated on when that will be\n\nThank you ♥️ You can get our signature scents on https://t.co/zrniNUUjS3 now\n\nI hope you love them I can’t believe I’m actually able to say this... \nFragrance drop in 10 minutes \n♥️ @rraachael Im doin well just filmin a vid rn @needygrays Love you 2 bro WHAT UP GUYS RT @wwd: Wakeheart's first influencer collaboration is with @GraysonDolan and @EthanDolan. https://t.co/5yWRdAQQfP RT @EthanDolan: bottle reveal on wakeheart Instagram and website in 1 hour!!!!!!!!!! RT @EthanDolan: Over the past year gray and I have been working on creating fragrances to share with you all.. and they’re finally here!😭 w… @WAYWARDOLS It’s kinda my favorite smell in the whole world tbh but idk I might be biased RT @devilsgrantx: this is so cute omg 🥺 @EthanDolan @GraysonDolan https://t.co/UCObohqO1Q @kindaslutie @EthanDolan It’s def insta cop worthy 👀👀 @airpodolan @EthanDolan SAME HOLY FUUUUUUUUUUUH RT @tubefilter: .@EthanDolan and @GraysonDolan Are Launching 2 Signature Scents Alongside Nascent Fragrance Brand 'Wakeheart' https://t.co/… AHHHH thank you!! I’m so excited I hope you love it ♥️♥️ https://t.co/6qkThRjtUD I MADE A SIGNATURE FRAGRANCE FOR ALL OF YOU! ETHAN DID TOO! We’ve been working on these for a year now with an amazing company called Wakeheart and can’t wait to share them with you ♥️ ANNOUNCEMENT IN 2 HOURS!! I can’t believe it’s finally here 😳 RT @EthanDolan: One of our most special announcements yet coming for you guys tomorrow😊 E and I have been up to a lottttt of stuff for your guys lately. We’re so excited about everything :) ♥️ THIS WEEK’S VIDEO IS UP! \n\nSorry mom.. we’re goin back in!! \n\nhttps://t.co/uu2Qq1M1I7 Hope everyone is having a good Tuesday so far 34 MINUTES RT @EthanDolan: We made it out gray 😭🙌🏻 https://t.co/9hxUzz1hdN Me and Ethan spent the entire day building a house together... now time to live in it 😩 Good morning everyone ♥️☀️ So saddened to hear about the passing of such a young talented individual. I didn’t know him personally but he seemed like a great person. RIP Cameron Boyce. Some things don’t seem fair.. this pains me 😔♥️ Hey E so when I can tell everyone about that special lil thang we have coming soon ? 🤪 @EthanDolan Earthquake proof constructor nbd 😎 https://t.co/EwjLe1piCv RT @EthanDolan: Bro if we walk into a smashed tv on the floor right when I’m about to watch stranger things https://t.co/rrxuIZhVTB There was another earthquake just now I hope the TV stand is still up because I’m not home AHHHH My hand built furniture is apparently EARTHQUAKE PROOF!? 😎 and also apparently holy fuck https://t.co/uIpM4lxBlV EARTH QUAKE HERE AT MY HOUSE WTF!?!? My TV stand held up tho! 😎 Happy 4th of July! 🇺🇸💙♥️ have a great and safe day today :) @2AMGRANTT Idk maybe something like 9 days close 😎 Yo guys so like lowkey we have something really cool coming for you all that we’ve been working on for like a year and it’s REALLY CLOSE TO BEING HERE THIS WEEK’S VIDEO IS UP \n\nWe get.... weird after 2 AM \n\nhttps://t.co/dDzkQFG2JA Video going up any minute now 😧😧 15 MINS!!!! Unless technical difficulties which will probably happen but maybe not! Hahaha It’s a new week so start it off right! Do something nice for someone and get this positivity goin around also I love you Seeing someone I love stripped from ability to use their own two legs has inspired and motivated me to run and appreciate my physical blessings everyday. I hope to inspire others to enjoy and be thankful for what god has given them and treat themselves the way they deserve to be. RT @voguemagazine: Each season the front rows of Paris’ menswear collections introduce the fashion world to a new and exciting set of talen… @EthanDolan Glad you shared this bro!! My friend is hanging with my other friend today and I wanna cry.. I love creating friendships 😭😭 @RyanAbe happy birthday my ma’am! Hop to see you sun on minlin! Live you like a brotha brotha If you’re feeling down right now don’t give up and don’t lose hope. Something great is going to happen for you soon ♥️ THIS WEEK’S VIDEO IS UP\n\nI can’t believe we got to do this 🤩\n\nhttps://t.co/z2Oml1i9Ha\n\n👕🥼👖👟👞🧣\n\nGive it a like maybe if you wanna I don’t know only if you want tho 38 minutes :) Happy Tuesday.. I fucking love you! Really grateful for how happy I’ve been lately @emmachamberlain I had no idea this was relatable to anyone else besides me 😭 not the juicy part just the glasses part Goodnight ♥️ I love you all so much 😭😭 THIS TIME CHANGE GOT ME FUUUCKKKEDDD UP😭 I woke up at 10:30 PM to 550 unread messages... 411 of those being from my group chat with Ethan and my mom somehow Louis Vuitton men’s fashion show today let’s goooo @EthanDolan I need to learn how to make this for us I really fell in love France last night 😭😍 THIS WEEK’S VIDEO IS UP! \n\nhttps://t.co/P98cHLrBF8\n\nWe did a real, legit, actual, Hollywood audition. It was... very nervous for me Premiering today’s video so come say what’s up around 12:30 PST - 3:30 EST if you wanna :) Give your Dad a big hug today ♥️ Whenever I see the name “mom” come up on someone’s phone I always think “why is my mom texting them?” for a quick second THIS WEEK’S VIDEO IS UP! \n\nhttps://t.co/A6RzBR1JwI\n\nWe step outside of our comfort zones and learn how to act from star actor @noah_schnapp 27 MINUTES FINALLY TUESDAY AGAIN WOW HAVE A HAPPY ONE Being yourself is the best thing you can do for yourself All of your Tuesday selfies make me so happy also you guys are killin it This is a crazy feeling. I can’t tell if I’ve processed it yet or not. I’m like waiting for it to hit me but it also hit me really hard 10 times already. I am so thankful to have all of you in my life♥️ RT @emmachamberlain: 😳 @EthanDolan @GraysonDolan \n\nhttps://t.co/7WAJZOC8d8 THIS WEEK’S VIDEO IS IP \n\nhttps://t.co/nCQMdWpaod\n\nWe becomed emmo chambie \n\n@EthanDolan @emmachamberlain Slight delay SEVEN MINUTES Who is ready for da vid Back in jersey and it feels goooood 😩😍 Special guest in tomorrow’s videoooo🤪🤪 @EthanDolan I built the fucking dresser. Truly an amazing experience directing this video almost a year ago :)\n\nhttps://t.co/uClxiMfD8u\n\nHAPPY PRIDE MONTH 🌈♥️ @BryantEslava @EthanDolan Bro I live for this shit. You’re the man I’m so proud of you Why do I have the lazy song by Bruno mars stuck in my head rn Wow this is so unique I love it ♥️♥️ thank you https://t.co/Gq3VODHm3S Emma’s rap name is soul psycho Ethan just asked me if I “know how to make bacon?”... ITS A PAN AND BACON!?!!?!? He’s so lost idk how he’s made it this far in life THIS WEEK’S VIDEO IS UP\n\nhttps://t.co/uWEDK7ccSm\n\nI shouldn’t have signed up for this... \nI will never forgive Ethan \nI am quitting Dolan Twins \n\nJk 47 MINUTES YYYAEEEEAAHHHH IM ACTUALLY SO HAPPY ITS TUEADAY Tuesday yerr Very grateful for the courageous men and women who have sacrificed their lives to serve for this country. Thank you for everything that we have today ♥️🇺🇸 I can’t wait for the official start of summer br… hahaha just kidding but for real this summer is going to be wild I hope you guys are ready 👀 It’s okay to have a bad day every once in while. Don’t put too much pressure on yourself tomorrow will be great ♥️ Emma!! Happy Birthday! The big 18! Have a kind, happy, and respectful year!! XD @emmachamberlain THIS WEEK’S VIDEO IS UP \n\nAnd 2015 Ethan and Grayson are back 😅😬\n\nhttps://t.co/QhVhjol9Dg U too young man https://t.co/s1kCQkRfSO It really feels like summer now 🤤 Ohhhh shit @tryguys hahaha I’m nervous to watch this \n\nhttps://t.co/FfV9v2nsfj Ethan just told me that I need to grow out my hair because he’s tired of me styling it like jimmy neutron and that people are going to start roasting me.. like damn maybe I’ll listen to him 😪 Feels good to be in Jers rn :) missed my mama If you’re dealing with stress from finals and all that just remember that you’re gonna get through it and life is great so don’t stress :) Yeah whatever 😪\n\nThis week’s video is up\n\nhttps://t.co/HW35qUD0D1 Actually the vid is probably gonna be up a little lAtEr ThaN ThAt 🤪😭 My hair will be gray soon from the stress of YouTube technical difficulties every Tuesday but the video is going up in 41 mins :) RT @GraysonDolan: HAPPY TUESDAY! I HOPE EVERYONE IS FEELING THE POSITIVE ENERGY THAT IM PUTTING OUT TODAY Guys. Wtf I seriously tweeted happy Tuesday this Monday morning.... WELL THATS HOW MY MONDAY IS GOING WBY Wait. It’s fucking Monday Grayson... HAPPY TUESDAY! I HOPE EVERYONE IS FEELING THE POSITIVE ENERGY THAT IM PUTTING OUT TODAY Happy Mother’s Day to all the moms out there ♥️♥️ Sometimes it’s hard to believe that things get better but they ALWAYS do. It’s a fact ♡ What’s up baby https://t.co/xiNMG4EuCN Ethan is putting on pants that look similar to jeans but they’re pants and NOT jeans and he’s asked me “yo you don’t think people will think I’m wearing jeans right?” At least 490 times. 🙃 THIS WEEK’S VIDEO IS UP! \n\nhttps://t.co/xGlEkFVSTF\n\nDo we have telepathy? 👀 OKAY READY Heck yeah I hope it’s comfy for you :) https://t.co/1xY6Y5RV6H RT @Graysonbaby9: Happy early tuesday🌹 \n@EthanDolan @GraysonDolan #tuesdayselfie https://t.co/BjFdP2zfBh Happy Tuesday love ya more https://t.co/D9ZpkIpwQj HAPPY TUESDAY LOVE YOU TOO https://t.co/aH7j7A02iY While we’re waiting now let’s all talk :) I’ve been loving your guys Tuesday selfies lately :)♥️ https://t.co/kMo1JlfxIl Hey guys sorry idk wtf just happened but the video is gonna be up shortly. Technical difficulties what else is new 🙃 Gooooodmorning guys! We just dropped our limited edition purple hoodies!! They will be available for just ONE WEEK so make sure ya get one fast if you want one :) \n\nhttps://t.co/PFpb5KYE0k Okay I won nvm. VIDEO AND LIMITED EDITION MERCH TOMORROW LETS GOOOO I’ve been fighting this nap all day it’s bouta win tho 😩 HI I was just so hangry that I got pissed at my own food. A tomato fell of my avocado toast while I was trying to eat it and I almost punched it but I didn’t wanna cause a scene RT @GraysonDolan: When we hit 10 Mil, Ethan and I would like to invite fellow YouTubers to join us in a 10M sub Dolan Twins Roast. Who do y… We have something special coming for you guys on Tuesday 😮🤔 When we hit 10 Mil, Ethan and I would like to invite fellow YouTubers to join us in a 10M sub Dolan Twins Roast. Who do you want to see roast us? We’re coming up on 10 Million subs on YouTube... 4 1/2 years ago I didn’t even think we’d reach 10 subs lol this is the craziest feeling in the world. I love you all so much Sitting here late at night feeling really grateful for everything god has blessed me with 😊 YOU DID THIS SO FAST WTF I LOVE IT https://t.co/zb8Qt2jE3N THIS WEEK’S VIDEO IS UP! \n\nhttps://t.co/LFxQ8iFlSw\n\nI really enjoyed it idk about @EthanDolan tho that boujee fuc... LOVE YOU HAPPY TUES https://t.co/J5qjv8UoZa 34 MINUTES YYEERRRRRRR HAPPY TUESDAY I HOPE YOU HAVE A GOOD ONE ♥️ https://t.co/fnXF0WBQhb Yeah Ethan just got me good :/ but now I’m DETERMINED to make him actual shit himself with my next prank Loyalty is my greatest value The other night https://t.co/s3oZNINp2T I miss the east THIS WEEK’S VIDEO IS ACTUALLY UP HAHA\n\nhttps://t.co/BeT87J1TJg\n\nWe look for a new pet that I’m not allergic to :) Had to delete the video because notifications weren’t going out. We want to make sure everyone gets a chance to watch it. Re-uploading soon ♥️ Our subscribers didn’t receive a notification for our video today. It also never hit anyone’s sub box. It didn’t go through on my personal YouTube account either just checked.  @YouTube @YTCreators I don’t think the video hit anyone’s sub box for some reason... did you guys get the notif/can you see it in your sub box? 35 MINS TIL NEW VID HAPY TUES YEERRRRRR https://t.co/VrJLyKt8lw RT @flaminhotdolans: happy tuesday! 💜\n\n#tuesdayseflie #dolantwins #dolantwinstuesday \n\n@EthanDolan \n@GraysonDolan https://t.co/35b14nDmNK Happy Tuesday ♥️♥️ https://t.co/tISBTGLnes HAPPY EASTER 💜💛 Being sick sucks. I’ve been taking time to heal physically lately but also trying to use that time to do some mental healing that I’ve been putting off. Sorry I’ve been a little MIA ♥️ Im extremely sick this is not chill Me and e are both so sick rn so it’s kinda like every man for himself and shit is falling apart. there is soup all over the floor THIS WEEK’S VIDEO IS UP!!\n\nDo you ever just wish you were 2 again lol \n\nhttps://t.co/gI7hrhbXmh\n\nFt. Elle 43 MINUTES Confident people compliment people I wanna thank my mom, my dad, and New Jersey for making me a real human being I’m seeing cudi and tame today... guys hopefully I don’t cry... too hard 😭 Alright it’s up on my Instagram Day 1 outfit pic coming soon Ethan’s finished Coachella shopping and guess what I still need.. ONE MORE OUTFIT. Guess why? HIS WAS UNWEARABLE THIS WEEK’S VIDEO IS UP\n\nTHUMBS UP FOR MY STRESS LEVELS BEING UP 😩😅😅\n\nhttps://t.co/PfgEgU9hbs\n\nI cant believe I trusted ETHAN to do this 39 minutes UNTIL VIDEO 2008 had the best music Little family reunion break from LA was just what I needed @NikitaDragun I thought 👀 Snakes everywhere where am I safe THIS WEEK’S VIDEO IS UP! \n\nhttps://t.co/YQ33w8Mpeo\n\nWe gave each other room make overs out of things we built ourselves 😮 You have to suffer to grow Annndd just realized I haven’t even thought of anything I could wear to Coachella this year yet.. the stress begins :/ Ready to make memories to this new tame impala  \n\nI can’t wait for the rest of the album Guys Tuesday’s video is pretty lit ngl Me and e are closer than we’ve ever been rn and life feels amazing Yo I fkn love you guys I need a new prof pic I’m wearing a beanie in mine and it’s about to be summer I feel trapped I need to go somewhere soon Humans made phone so ppl could talk why does no one answer their phone Hell yeah! Love you! ♥️♥️ https://t.co/EqQY0JbKm2 THIS WEEK’S VIDEO IS UP! \nFT. OUR MOM\n\nhttps://t.co/aVWobT49Ba\n\nLike for mom PREMIER STARTING IN ABOUT 15 MINS COME SAY WHATS UP Doing a premier for tomorrow’s video! Our mom is in it so what not lol What’s up THREE DAYS GRAYSON WHERE YAT WTF My sister just told me I have her permission to keep my mustache I think I’m allowed to now My circle = . Never take your health for granted ♥️ THIS WEEKS VIDEO IS UP!\n\nWe switched IDs and fkd each other over hahaha yay watch if you wanna\n\nhttps://t.co/3q1hepVvyV 41 MINS If you’re a good person people will take advantage of you. Don’t feel stupid tho, you’re a good person Happy Saint Patrick’s day everyone 💚 @BelindaLahu I just got bags tho I just skinny dipped in the ocean and lost both of my earrings. Yay :) TAKE GOOD CARE OF YOURSELF GOTCHA BIIIITCH @EthanDolan \n\nhttps://t.co/1UrUz5Dpzo\n\nProbably one of the best pranks on our channel maybe I’m just biased tho 37 MINUTES!! I wanna travel so bad rn Constantly thanking to God and my Dad for how good life has been going for me and E lately. I wanted to thank you guys too. You’re all such a huge important part of our lives ♥️♥️ Bruh this video was a bad idea https://t.co/txOHWS0X4F MY MOMS IN TOWN!! Lol I missed her Ethan and I had separated errands to run today and I haven’t been with him for like 4 hours and I’m starting to go crazy But there’s only one thing to do and that’s enjoy life and live it to its fullest Damn my heart is broken today Wow I love you https://t.co/RUVvPU9PAe Hi Hey everyone:) happy Tuesday. I’m bored ... call me!! Let’s talk 424-273-3384 THIS WEEK’S VIDEO IS UP!!\n\nhttps://t.co/bTZQtaIWsD\n\nWe talked about things we’ve never told anyone but our mom soooo \n\nFt. @PSYCHICTWINS 42 MINUTES!! No you’re not https://t.co/cxpxlJVNB9 OH ITS TUESDAY I finished building my table. I’m gonna do a tour on Snapchat tomorrow if you wanna see it add me :) \nUser: GraysonDolan BITCHED https://t.co/Q3MpN0gLB0 My sister just sent me a picture of her Ethan and me at the Hannah Montana/Jonas brothers tour when I was 7. It was my first ever concert and one of the best days of my life My baby cousin FaceTimed me because he thought I ripped my real nose off when I took the prosthetics off in my video. He had to check and make sure I was okay hahaha he’s the cutest This week’s video is up! \n\nWe hit Hollywood Blvd in disguise to see what people REALLY think about us \n\nhttps://t.co/VBPQk5nJCL\n\nWe got some tea ☕️ 20 MINS AHHHHHHH hahaha what’s up Ellen https://t.co/9HLcaWaMg8 I hope everyone’s Tuesday is going FANTASTIC I’m excited for you guys to see today’s vid 👀 Never let a bad day affect anyone else’s day I miss my dad Having a twin is fun because every time we eat a sandwich we order something different, split it in half, and swap them to switch it up I just walked SO HARD into a waist level pole in public. Very painful and humiliating, so awesome! 🤪👌 It’s snowing in LA rn wtf!?!!? I woke up feeling amazing today all thanks to you guys for showing so much love on our come back ♥️ seriously can’t thank you guys enough for your support. You all mean the most to me! WE’RE BACK GUYS FINALLY YES IT FEELS AMAZING \n\nhttps://t.co/1opZEzreaB\n\nFt. @JeffreeStar @lipsticknick 😦👀 WE’RE IN THE PREMIER! Come talk to us please 😭 \n\nhttps://t.co/1opZEzreaB Okay we’re just gonna go live an hour later than normal. The premier will be at 1:30 PST see you then 😎😊 If we can’t premier today we will do it next week ♥️ Guys I’m freakin out rn idk wtf is going on. There was an error with our video so we had to reupload it and now I don’t think we can do the premier Running into some technical difficulties OF COURSE. The video may be up a little later than normal but I’ll keep you guys updated Wow being back has never felt better. I seriously wanted to thank every single 1 of u for giving us the time that we needed until we knew we were 100% ready to come back strong. We’re so blessed to have all of you in our lives and so excited to continue our journey with you all♥️ RT @JeffreeStar: NEW VIDEO TOMORROW feat. The Dolan Twins 🔥 Any guesses what we filmed?? DOIN A LIL VIDEO PREMIER TOMORROW. Come early and let’s talk before it goes live 😎♥️ That’s like me and Ethan after that one time he got back from a play date without me when we were younger. https://t.co/y8h46kjHzt Staying happy is hard but worth it Happy Valentine’s Day ♥️ RT @JeffreeStar: Oh hey there 💅🏻 @GraysonDolan @EthanDolan https://t.co/8fCZMjIrH9 Just filmed our first video in over a month and I’ve never felt better! Little special guest action too can you guess who!?🤪 Wow I fuckin miss you guys so much ♥️ Once we’re back we’re going HARD tho hahah. I want to make you guys, myself, and my Dad proud ♥️ Not really feeling 100% ready to come back yet, but I’ve been thinking about you guys a lot and I miss you all very much. 💫 https://t.co/UXyuoii9H0 Thank you guys so much for 9 million on YouTube wow it feels so good to have you all here 😭♥️ I miss you guys Your kind posts about my Dad have been heartwarming. Thank you all. Again, please do not show up to his wake, funeral, or any of his services. We want this ceremony to be an opportunity for the people who had a close connection with my Dad to say goodbye and pay their respects. We appreciate all of our fans so so much. Please respect My father Sean, Ethan, my family, and me send your love through social media only! RT @EthanDolan: If you are a fan of Grayson and I we love you and appreciate you so much. The best way you could support us during this tou… I can’t believe that today actually real. It doesn’t make sense. Ethan and I are going to be taking some time off and spending it with our family. I love you guys so much thank you so much for everything. I’ll be back soon♥️ 100 million views on our YouTube channel this month. That doesn’t even make half sense to me like wtf thank you guys so much 😭 Me and E are starting shoutouts for you guys at the end of every video now. All you have to do is subscribe and click that little bell then tweet us a screenshot once you’re done :) I thought this would be fun He got me. BUT YOOOOOO I AM GETTING HIM BACK HARD \n\nhttps://t.co/Pqt0x6p6l8\n\n😈 18 minutes!!!!! Happy Tuesday everyone Love you guys ♥️ Going through a lot rn I still ate it doe 😛 I was eating cashews and I had some chilling in my hand. I picked one up and went to put it in my mouth and it LATCHED ONTO MY FINGER. I LOOKED DOWN AND IT WAS A FUCKING STINK BUG... HA FUCK NOOOO THIS WEEK’S VIDEO IS UP \n\nMe and e tried to fix our arguing problem but...\n\nhttps://t.co/86M1XnNTtI VIDEO UP IN 44 MINUTES I’m so blessed and happy to have all of you amazing people around me all the time. 😭♥️ you guys do so much for me and e and we truly appreciate you all so much. I woke up with so much energy today my bad Out with the negativity and in with the POSITIVITY!!!!! YEEAAAHBHHH! AAGGGHHHHHHHHH! New prof pic 🤪 Talking with the channels members is so fun it feels like a little family hahaha love you guys thank you to everyone who has joined so far ♥️ To sign up to become a member you must either be on a computer or android @EllePotts5 @EthanDolan You can sign up on a computer or an android! Sign up is releasing for iPhone on the future. You can still watch it on your iPhone but you must sign up on a computer :) RT @BryantEslava: go become a channel member for @ethandolan &amp; @graysondolan on youtube\n\nthey’ll be posting the funny/outtake pictures from… @RyanAbe @EthanDolan No but I’m uploading even more of my face 😀 Love you more ♥️ https://t.co/vQIGxHpyJv @jaydee22377 @EthanDolan If you click the link I tweeted then log into your google account (the one that is linked with your YouTube account), you should have the option to sign up and join :) Awww thank you! And HELL YEAH IT IS 🤘✌️ https://t.co/Jk1salciC1 THANKS FOR SIGNING UP! 😊♥️ You won’t regret it... I hope 😭hahaha https://t.co/eoNSNUCA40 Become a Channel Member and get: \n\nExclusive Blooper Videos for EVERY Tuesday Video\n\nCustom emojis to use in superchat (video premiers)\n\nBTS photos\n\nDaily updates \n\nDT merch discount codes \n\nmember badges \n\nAND MORE.. \n\nhttps://t.co/2P1aKrIM8q Little technical difficulties on setting up the channel members thing... of course. BUT WHAT ARE THE DOLAN TWINS WITHOUT TECHNICAL DIFFICULTIES?! 15 MINUTES UNTIL THE LAUNCH OF CHANNEL MEMBERS (and the first channel members video ever) I searched all over for a tall plant for my room yesterday and couldn’t find one. I literally went to 5 different stores around LA :/ Channel members is going live tomorrow at 1 PM PST - 4 PM EST 😊😊 Goodnight guys :) Can we please get Cudi Zone at Coachella? 😭🙌  @KidCudi TAME AND CUDI IN THE SAME DAY WTF IM OVERWHELMED https://t.co/s6wXvT7EQP The option to become a channel member will be available to all this Friday! THANK YOU GUYS SO MUCH FOR AN AMAZING 2018 😢😭\n\nTO AN EVEN MORE AMAZING 2019\n\nhttps://t.co/09g3AB4xWV Me and E are dropping hints at what the announcement could be in the premier right now :0 come hang 😎 \nhttps://t.co/09g3AB4xWV Ethan and I are going to be doing a premier on today’s video so come to our page a few minutes early and let’s talk before it goes live! And after too :) THERE IS AN ANNOUNCEMENT IN THIS VIDEO ❗️ THERE IS AN ANNOUNCEMENT IN THIS VIDEO ❗️ HAPPY NEW YEAR! 2019 IS YOUR YEAR 2018 was def on of the best years of my life so far. I really worked hard on changing my mindset and thinking more positively this year and I’m kinda proud of myself for that My fucking nose is chapped 😪 Watching the blooper reel for 2018. Wow it’s been a wild journey and I’m so happy to be able to share these great memories with such amazing people. Hi The highest percentage that my phone has been at for the past 3 days was 35% ... I need to get my shit together 😅 Idk how I’m gonna get my sleep schedule back to normal holiday break has really ruined it 😊 Goodmorning 😊 @jamescharles Easy dub. I’ll bet my nutcracker, survival equipment, and Gucci bracelet on it RT @GraysonDolan: WE BOUGHT EACH OTHER OUR DREAM GIFTS! Also we may cry at the end lol @jamescharles @EthanDolan @emmachamberlain \n\nhttps:/… WE BOUGHT EACH OTHER OUR DREAM GIFTS! Also we may cry at the end lol @jamescharles @EthanDolan @emmachamberlain \n\nhttps://t.co/NSzS11xIFp\n\nMerry Christmas everyone! Everyone go watch Elmo’s video https://t.co/s8JRgV9kqr RT @jamescharles: RT to be the next video's sister shoutout!!\n\nSISTER SQUAD BUILDS A GINGERBREAD DREAM HOUSE!! MERRY CHRISTMAS EVERYONE! ❤️… RT @EthanDolan: Ok James’ vid comes out at 12PST Emma’s at 12:30PST and ours at 1PST. ITS A CHRISTMAS SPECIAL Today’s video is our longest video yet at 45 mins 😯 MERRY CHRISTMAS 🎄🎁 ♥️♥️ RT @EthanDolan: We have a FULL ASS CHRISTMAS SPECIAL COMING TOMORROW ON OUR YOUTUBE CHANNEL I got my little cousin James’ palette for Christmas. She’s having trouble breathing rn Lolol. She’s so excited. Thanks for signing it @jamescharles ♥️ @grinchmovie Huh Merry Christmas Eve! 😊 I don’t really wanna ever see edits of me or my brother dying. It gives me bad vibes This week’s BONUS video is up \n\nGrab a snack and come hang with us while we muk Hahahah\n\nhttps://t.co/0fgurBL0yO BONUS VIDEO IN 38 minutes Oh btw I’m doing this follow spree for 24 hours so everyone has a chance 😊 Retweet for follow :) Hi Follow spree tonight and bonus video tomorrow 😎 🐬🦋❄️💧💙 https://t.co/cMUfWBO3ry ☺️ https://t.co/EOe9TDuqvs Just surprised my best friends with their dreams gifts for Christmas 😢😭 @EthanDolan @emmachamberlain @jamescharles \n\nThe video will be out Christmas Day 🎁🎄 THIS WEEK’S VIDEO IS UP!!\n\nWe surprised fans at their houses \n\nhttps://t.co/K3L7K80gSi\n\nDef one of my favorite videos we’ve ever filmed :) \n\nHAPPY HOLIDAYS ♥️🎁 26 minutes Wait what 7 MILLION THANK YOU!!\n\nI guess I’m gonna have to do a follow spree this Friday 😎 I love getting Christmas gifts for my friends and fam I’m going a little extra hard this year lol Wtf why do I kinda like being 19 😢 love you all https://t.co/hm5g4FyHNn Thank you for all of the birthday wishes and love 😭♥️ Last year as a teenager W T F 😅 :/ thanks https://t.co/zVXgGgyrxi Happy birthday @EthanDolan have a good one bro!! 😀😀💯💯 One day you will look back on when you were depressed, struggling with anxiety, or times just weren’t so great and you will thank yourself for not giving up because of how fucking amazing your life is now. ♥️ - Strong enough to do it. Dig deep, stay strong, and do it for yourself! You should always recognize how important you are to YOU. Change bad habits, be a good person, find something positive to focus on and don’t lose hope. You will make it out with a genuine smile on your face Mental health is a very serious issue.  When you feel like you’re at your lowest it may seem like there’s no point of life, or that you don’t matter, none of which is actually true. It may take a lot of time to escape those awful feelings and thoughts but you are strong enough - Breaks my heart to see Pete Davidson feeling like this :( Hold on and stay tough man, the reason may not seem clear right now but life will come around for you. You got this bro This week’s BONUS VIDEO?!?!?! Is up!? \n\nGive it a fat like if you think I totally GOT ETHAN 😂😂💯💯😏\n\nhttps://t.co/jq2Mmb6GrQ\n\n🎁 Sorry for the delay guys video is going up now!!!!! I’m gonna start telling you guys the stupid things Ethan does more often hahaha like this wasn’t even that bad tbh https://t.co/AlrrXK6YCI NEW VIDEO COMING TODAY AT 4 PM EST - 1 PM PST Me and E just got shots at the doctors and the nurse told us we may be a little dizzy after the shot. When Ethan stood up he fell foraward and face planted on the table and everyone started freaking out but he was joking... Why does he do these things?! Just spent the last 4 hours trying to find/recover footage from the prank I pulled on Ethan and BOY I THOUGHT IT WAS GONE BUT WE FOUND IT😭 that was so fucking scary HOLY MOLY!\n\nBut the good news is BONUS VIDEO COMING THIS WEEK (I pranked tf out of Ethan) THIS WEEK’S VIDEO IS UP!! \n\nWho do you think the babysitter is? \n\nhttps://t.co/dGd6se77Yt\n\nFeat. ACE Family Mins *** 32 Moms We have a BIG SPECIAL GUEST in today’s video but she’s very little 😭😍 HAPPY TUESDAY. MY SLEEP SCHEDULE IS FFFFKKKKKKTTTT UP🤪 Sorry E and I have been traveling like crazy these past few days 🤔 BUT IM BACK NOW WHATS UP GUYS Wow I had an amazing day. Life is great god is great ♥️ I wanna have a kid obviously I’m not but if I could tomorrow I would THIS WEEK’S VIDEO IS UP! \n\nWe went undercover and might have even talked to you!?!?  Idk find out here 😦\n\nhttps://t.co/QxnrSOCJdP 27 MINUTES Happy Tuesday :) I already prank tf out of Ethan today hope your day is going well so far too @AustinMcbroom Bro you stole my grandmas Christmas present. That was gonna be her first gucci item ever :/ Me and Ethan are doing a holiday mukbang... what should we talk about? @shanedawson Hahahahahha holy fuck @Grethanlover6 YES I have nothing relatable to tweet but can you like this tweet anyway so it makes me feel good? 😩 @MimiMaibe @EthanDolan This makes me sad😭 I’m listening to Christmas music while working out rn btw Today is my last day with my beard... I will always love him tho 😞 My twitter keeps crashing but I’m DMin the best I can ily guys @dolanIoves Ok Wan Dm? I like ya shirt. Ya look good in it https://t.co/fHQ2u1EvcM It’s only 5 I thought it was 9:30 pm :/ THIS WEEK’S VIDEO IS UP \n\nWe got a REAL JOB for the first time 😅\n\nhttps://t.co/dG3SPKmiXM\n\nLike if you want us to make u a cuppa cawfee 50 MINS Happy Tuesday guys! Looking good, OBVIOUSLY,  in all your Tuesday selfies. I hope you guys are having a great Tuesday so far My heart and love goes out to anyone who is or has been effected by cancer or any illness of that matter, mental or physical. Sending love and positive energy I hope you can feel it, really. ♥️ Fuck cancer Just sent all of the signed posters back to our merch company HQs so they can ship them out to you guys :) An awesome police officer helped us out last night and told me that his wife watches our videos. I had an extra DT crewneck on me so I gave it him to give to her. I hope his wife finds it comfortable and stylish he was a very nice man. 👮 ♥️ @jamescharles Offended Hey thanks for 6.9... heh... pffffftttt. Ahah... uhhh 😦😳☺️🤣💯 Sorry for the inactivity. I’m home for the holidays and spending time with my family with my phone down. I only get this opportunity once a year so I’m making the most of it. Hope everyone is enjoying time with their families as well ♥️ This makes me so happy and excited 😭 https://t.co/HwXkbdIW63 Yayyyy I love u :) https://t.co/WGdyHa650W I’m literally signing them right now. I could even be signing yours as I am typing this idk 😊 https://t.co/H6e89HslkN NEW MERCH AVAIL ON \nhttps://t.co/PFpb5LgfoU\n\nNew NEON SIGN, POSTERS, AND SIGNED POSTERS. Signed by me and e :) AAAAAANNNNNNNNNDDDDDDDD Too much turkey 💤 me, the cuz, and Elmo are tired https://t.co/Q65x6DqApL Happy thanksgiving everyone! Thankful for all of you and love all of you too haha ♥️ NEW MERCH FRIDAY Hey guys THIS WEEK’S VIDEO IS UP \n\nhttps://t.co/ErVAs4ZYCb\n\nThis one was a very interesting one to make😯\n\nFt. @MollyBOfficial 30 MINUTES Ayyeeee club goin up tomorrow!! 🤢 @emmachamberlain I’m just sayin I love you guys so much thank you for all of your positivity♥️ Do you guys think I should keep my mustache after no shave November? RT @EthanDolan: Why is this actually us @emmachamberlain @jamescharles @GraysonDolan https://t.co/nwDSYYJrqm Yeah my Christmas decorations are up already SO WHAT CONGRATS ON 10 MILLION JIMMY DICK! @jamescharles This sucked for me\n\nSo give it a like please? \n\nhttps://t.co/lbEgdl4cUU 15 MINUTES Fuck yeah I did @jamescharles https://t.co/i3tWMOOLO4 @BryantEslava @EthanDolan Good times man 😭 HAPPY TUESDAY GUYS Drama is so fucking cheap get it away from me thanks Supposedly the wildfire smoke can get you sick and I just woke up throwing up soooo bad Fuck you REALLY know you made a mistake when even Logan Paul can tell.. https://t.co/TcNUzLIUxN @livingitdolannn No it ain’t @lildxlxns None @PaleGrayson None WHATS UP GUYS! IM DOLAN BROTHER 😀 Also 1 billions views on our YouTube channel wtf😭 thank you to everyone who watches you guys really changed my life 😭♥️ I know I’m a little late idk how I just saw that now but THANK YOU Every time I’ve said “I couldn’t sleep last night” it’s HONESTLY because I was watching YouTube tbh honestly I hope everyone is staying safe from the fires in California. Sending love to everyone who has been affected so far 😓♥️ this is awful Me and Ethan come up with the weirdest words for our secret language. The newest addition to our dictionary is “blarp bup wrap” but you have no idea what it means and will probably never know THIS WEEK’S VIDEO IS UPPPPP!\n\nWe settled our argument once and for all \n\nhttps://t.co/q2Z8YZ1LTd\n\n😎😎 32 minutes 😊 Sorry if those tweets came off aggressive you know I love all of you guys and really appreciate your support but I don’t consider invasion of privacy as “supporting us”. I would actually say it’s the exact opposite. That goes for me and Ethan’s house AND my parents house And if you have our address please do not share it with anyone else. Thank you If you know where we live PLEASE do not come to our house. We will not take a picture with you on or anywhere near our property. This is where we live and EVERYONE deserves privacy. We’re nice ppl, if u see us in public I’d be glad to take a picture with you, but not at my house So many things coming for you guys that I can’t tell you yet but I’m gonna be annoying and tweet this anyway 😊 Like working out for instance FUCKIN SUUUUUUCCCKKSSS but for some reason it’s good for you? Huh Nothing good ever comes easily like REALLY That moment when you and ur best friend @jamescharles drop colorful things on the same day 🤪 SO PROUD OF YOU SIS! ALSO SO PROUD TO BE INCLUDED IN A SPECIAL LITTLE WAY ON THIS AMAZING PROJECT OF YOURS! Im no MUA but James has used his pallet on my face and the quality and colors are amazing. And also as well tbh you sister snapped on this vid https://t.co/DCo6xUtv6g @BryantEslava @EthanDolan Ay thanks bean NEW MERCH IS FINALLY HERE! \n\nCrew necks, new hoodies, cropped hoodies AND joggers! \n\nI hope you guys like these :) \n\nTbh all the stuff is really comfy and you can feel how good the quality is when it’s on 😊😎\n\nhttps://t.co/9rXY6xZEqF ONE HOUR @allie45369315 6 AM in Syd and like 1 AM in Perth I think? :) @xSister_Dolanx 12PM PST - 3PM EST :) @urbanwrecks Bc I just woke up I can’t wait for you guys to see the new merch. It’s different than the stuff we’ve released in the past.. but in a good way I think :) higher quality all around 😯😊 No shave November day 1 :) I ate so much candy today but all I can taste is new merch? \n\nComing Friday HAPPY HALLOWEEN 🎃 Have a fun safe night everyone 🖤 this is my favorite day omfg Hi sisters https://t.co/mWbnWV22W4 RT @emmachamberlain: its up and its 20 minutes late 😘 happy halloweener 🎃 @EthanDolan @GraysonDolan @jamescharles \n\nhttps://t.co/uFaRzkOuqu RT @jamescharles: RT TO BE THE NEXT VIDEO'S SISTER SHOUTOUT!\n\nDOING MY BEST FRIEND'S HALLOWEEN MAKEUP!!! ft. @emmachamberlain @EthanDolan @… THIS WEEK’S VIDEO IS UP! \n\nhttps://t.co/ceiSFH2Z5U\n\nFeat. @jamescharles and @emmachamberlain \n\nHAPPY HALLOWEEN 🎃 🖤 44 mins til vids HAPPY TUESDAY ! Collabs with @jamescharles and @emmachamberlain go up today 🤪 they get spooky 🎃💀👻🤡⛄️ Tall* wow I ruined that tweet Do you guys think I’m too talk to trick or treat? Like if I wear a mask do you think people will be able to tell that I’m old and think it’s weird or do you think they’ll think I’m a big little kid and give me treats? Just out of curiosity YOU DIDN’T EVEN MAKE ME SOUP YOU ORDERED IT ON POSTMATES YOU FAKE FUC https://t.co/MqYLQJSwmZ Ethan and James are arguing over the STUPIDEST SHIT in the group chat right now and I have 148 text notifications because they both want the last word 😩🤦‍♂️ PART 2 is up!! OUR DANCE PERFORMANCE! 😨😰\n\nhttps://t.co/KKe5QbJTEw\n\nLet us know how you think we did?! 😩😩\n\nFt. @maddieziegler @kenzieziegler @d_TRIX @BethanyMota I just beat Ethan in a wrestling match (no contest it was so easy) and then I recorded a snapchat saying I won and he chased me around the house like a vicious turtle, confiscated my phone, and deleted the snap. ☹️ I swear I get sick once a week this sucks Thank you guys so much! AGHHHH I ACTUALLY CANT BELIVE THIS😭 you guys are the best WOOOOWWW♥️ I WANMA PARTY WITH ALL OF YOU RN Trust your gut feeling and listen to signs. Tonight was bad vibes 😳😩 YouTube crashed idk why TODAY’S VIDEO IS UP! \n\nFirst episode of our new channel series. It gets INTENSE\n\nhttps://t.co/aSzkIb0MmU\n\nFeat. @maddieziegler &amp; @kenzieziegler There are also special guests in today’s video 😮🤔 IM SO EXCITED FOR TODAY’S VIDEO/THIS SERIES😭\n\nI wanna upload it now tbh I just asked my mom what day Black Friday was on this year.. HOLYSHIT 🤦‍♂️😩 I’m breaking out so bad😅 I hope this is just a time of the year type thing Mental health is something I’ve struggled with in the past. When you’re down you may feel like you’re in a hole that you can’t crawl out of. Know that you’re stronger than you think and capable of accomplishing anything you set your mind to. You’re in control #MentalHealthDay ♥️ My friends @jamescharles @emmachamberlain and @EthanDolan make me really proud and I love them. Do I really have to sign the prenup? 😞 https://t.co/e7Tvmlok4p This week’s video is up. \n\nNothing will be the same after this one. \n\nhttps://t.co/ohXcizK56P\n\nMaybe that’s a little over dramatic but yeah this one is just FILLED with tea I’m nervous to upload this one today 😬😩 @RyanAbe Bro she was S C R E A M I N G ~ L O U D I love making people laugh. I said something that was like half funny and this older lady started scream laughing in this restaurant hahah that was fun RT @EthanDolan: Today is a big day for gray and I... I’m pretty nervous 😅 you’ll know soon... Ethan just said “People be hating on raisins but love grapes... respect your elders” \n\nCouldn’t agree more It’s a big day, @EthanDolan we need to get to it 😅 Prior to tweeting, I was unaware of the words that were said. I am sorry if anyone was upset. ♥️ I’m here to spread love and positivity. It seems as if people want to twist my words to make me seem like a bad person nowadays. I know who I am and that is the accepting person that I was raised to be. It’s unfair that people try to twist situations and take that away from me.- Just did something new 🤔🕺 Wow I really thought today was Saturday I was walking around universal tonight and I saw a girl wearing me and E’s merch but she didn’t see me yet. I yelled “I like ur sweatshirt” and she was like “huh” but then she looked up and we instantly started running at each other and hugged and it was cute I almost teared up. Imagine seeing the cutest piglet in the world and then imagine being allergic to it and then imagine being me 😭😩 THIS WEEKS VIDEO IS UP \n\nAll of my family members were very nervous for this so please comment nice things hahaha \n\nhttps://t.co/ozxvkVIiRD Video in less than an hour 😯 Get off ya phone and look at the world Screenshotting some more questions! Ask anything you want pretty much 😩 If you want tea tweet me some questions and you will get THE TEA. Ethan and I are hooking ourselves up to a professional lie detector and answering all of your questions 😅 I’m literally only working out rn so I can eat cinnamon sticks tonight and not feel bad about it RT @EthanDolan: Ok so we filmed with pretty much our entire family. All of our Grandparents + our parents 😳😭😂\nfirst time ever having them i… This week’s video is up. \n\nSee how permanently awful it is for Ethan. \n\nhttps://t.co/DY2y11fqHk\n\nTbh I don’t think it’s that bad he’s just a drama queen TWENTY MINJOBS Had a rough past couple of days. I learned that changing your perspective is REALLY important. Always try to look on the bright side😌♥️ Actually nothing stronger/better than fall vibes 🍂 @jamescharles Goodmorning neighbor @BryantEslava It’s probably at my house tbh Flew back to jersey and forgot to pack pajamas so went to bed in dress pants last night... Good morning! I’m doing something very stupid rn @EthanDolan That’s sounds fun bro @jamescharles Glad for you @emmachamberlain Uncle Rico is the mans THIS WEEK’S VIDEO IS UP\n\nhttps://t.co/KnkvqTiEZR\n\nOur first time doing ... Ethan takes SO LONG to get ready I’m not even kidding it’s actually the most annoying thing in the entire world. I swear he just stares at the floor for like 17 mins b4 he puts each article of clothing on. How does it take some1 this long to put red shorts and a black t shirt on? How tf have I not tweeted in 4 days... I swear that last tweet was yesterday 😭 NOOOOOOO😭 Sometimes the little things can be the most meaningful @emmachamberlain U def get turnt 🤪 Wow I am so fucking happy right now 🌈 ♥️\n\nhttps://t.co/uClxiMfD8u 44 minutes!!!! RT @EthanDolan: .... music video today😧 Guys I’m like nervous 😟 GUYS THE MUSIC VIDEO DROPS TODAY WTF IM SO EXCITED. I wrote this story with E five to six months ago and now it’s real and it comes out TODAY!? My neck is really sore and I need a massage so bad. Before me and Ethan were wrestling and he was choking me but I just let him do it because the pressure was reducing my neck pain. I passed out tho where am I? I saw this on ifunny in 2014 https://t.co/KoBjgmYyIF MUSIC VIDEO \n\nTHIS TUESDAY\n\nOUR CHANNEL WOW I LOVE YOU GUYS A sad day 😓 Rest In Peace to Mac 🙏♥️ @jamescharles You reply to my tweet but don’t respond in the squad group chat? Soooo many comments on the new vid saying that Ethan was being mean to me and what not. Every time I said sorry in the video it was a joke.. GUYS HE IS MY BROTHER. HE WAS MAKING A JOKE. I WAS GOING ALONG WITH. If he was actually being mean to me I would’ve kicked his scrawny ass Since I didn’t remember SHIZ! while being hypnotized we decided to sit down and see what really happened while we were under the hypnosis shit. Honestly this was very embarrassing for us Hahahah \n\nhttps://t.co/JEx5NeakEp\n\nFeaturing @jamescharles and @emmachamberlain Anyway... HAPPY TUESDAY I just made Ethan a lovely breakfast and he ordered his own breakfast on postmates while I was fucking sweating in the kitchen. What we saw next... was unforgettable https://t.co/SYDmsmcat9 I was scared last night and I couldn’t sleep. I asked Ethan if he could come sleep in my bed but he said he was just too cool nowadays for something like that. As a result of his actions, I am now very tired. I CANT THINK OF A FUCKIN TWEET ITS BEEN 8 DAYS I STILL CANT THINK OF ONE Wtf I fking love you this is so cool ♥️ https://t.co/HGWiMvl8U3 Last day of shooting this music video! I can’t even explain how excited I am to show you all. Directing is definitely a new found passion of mine and I am not going to stop here because it makes me so happy :) I miss my family :/ RT @emmachamberlain: vEgAs BaBy\n\nhttps://t.co/YMPbAGE6c8 RT @jamescharles: RT to be the next video's sister shoutout!!\n\nBEST FRIENDS BUY EACH OTHER'S OUTFITS ft. @EthanDolan @GraysonDolan @emmacha… Watch us get hypnotized and act like just total goofs just goofballs really just goofing off \n\n@EthanDolan @jamescharles @emmachamberlain \n\nhttps://t.co/WPjcbID95P New video in 30 😊 ANOTHER FOUR WAY COLLAB COMING TOMORROW. Me &amp; Ethan, James, and Emma’s channel all at 12PM PST 😎 2 AM on set https://t.co/wNhj7t7cys Goodnight I love you Had a good and productive day working on the music video! ABOUT TO START SHOOTING SOON WTF IM SO EXCITED AFSHSJDFKLGLHAAHHHHHHH GOING LIVE AT 5 PM PST. See ya there hopefully 😊🤪 SURVIVAL CHALLENGE PART 2 IS UP! \n\nhttps://t.co/a45Ayrc9QA\n\nEthan needed help from his younger but bigger and cooler and more mature brother in order to get through the rest of the challenge NEVER FUCKIN MIND I GUESS THE VIDEO WANTS TO TAKE 2 HOURS TO UPLAOD. looking like we’re on track for a normal time uplaod at 12 PM tho SURVIVAL CHALLENGE DAY 2 (Facing the Storm) going up at 11 AM PST - 2 PM EST Should we upload an hour early today? We can FINALLY tell you guys a little somethin somethin on Wednesday! Catch us on IG live for the BIG ANNOUNCEMENT 😎 Guys I love every single one of you so much I’m serious Like if your phone has recently vibrated for no reason RT @OMWGRANT: MY MERCH CAME AW OMG YAY I LOVE IT 💜 @EthanDolan @GraysonDolan https://t.co/3mzwqmOKG7 I was just sleeping, a thing that most humans do. I don’t see the issue 😃 https://t.co/JPNHqTiVF3 @SXNNYDOLS No We were just sitting in dead silence and James screams “ALRIGHT SISTERS today’s brand new video is finally UP” \n\nAghh we almost drove off the road wtf I am just now finding out that every lyric to ‘Break Your Heart’ by Taio Cruz feat. Ludacris has been stored in my head since 2009 Sorry to go cheesy motivational speaker on you guys I just love you all and want you to be happy Reminder that you can do anything that you want with your life. It’s never too late or too early to start. If you want something for yourself, and do everything you NEED to do to get it, there is no way that you won’t achieve that thing! I believe in you ♥️ THIS WEEK’S VIDEO IS UP! \n\nhttps://t.co/6EowUT6WOg\n\nWatch me be a complete surviving thriving boss pft😎 SURVIVAL CHALLENGE PT. 1 IN 15 MINUTES!!!!! Thank you guys for all the votes this year! Love you guys so much. We couldn’t make it to the awards tonight because we are working on some special things for you all ♥️😮🤔😏 You guys are all so talented I appreciate you so much ♥️ Good morning! I woke up this morning with 701 unread messages all from my groupchat with Ethan Emma and James... wtf Surviving in the woods for two days was SOOOOOO intense that we’re gonna have to make the survival challenge a two part series 😎 Back in LA and getting REALLY busy with a lot of things for you guys Thank fuck it’s Friday! 🤪 You tweeted this out of jealously because your mustache grows at a much slower rate than my stache does. Can’t make fun of what you don’t have! https://t.co/rNzsZDCmI0 I made it out alive if anyone cares I’m heading back into the woods now I’ll talk to you guys tomorrow... if I make it 😩 I enjoyed pissing Ethan off in this video hopefully you guys will too :)\n\nhttps://t.co/rPSUrkotyu I’ve emerged from the woods to tell you that THIS WEEK’S VIDEO WILL BE UP IN 20 MINUTES Entered the wilderness.. ttyl 🤪 He’s fine he just scared tf out of his brother... me, im his brother that was scared. On the real god was with us today. Don’t know what I would’ve done if something serious happened 😓. Love you E https://t.co/9bDrEn9Kxo Filming the survival challenge in 2 days... Ethan isn’t ready I love my dad What do I name him https://t.co/4VXkhKpkkd GUYS WE GOT A HOUSE MAKEOVER! MAKE SURE YOU CHECK OUT THE VID! Thank you so much @mrkatedotcom 😭😭♥️♥️ https://t.co/upN2RfGZS2 Got me good gal 🤪\n\nhttps://t.co/GMThLoOHQO I know I’m a day late but I don’t really stare at my subscriber count because that’s not what YouTube is about for me. I just like to have fun with it and hope I can make people laugh/smile with our vids 6 MIL on YouTube... wtf😭\n\nThank you guys so much for everything you do for me and E. We’ve been having so much fun with YouTube lately and I REALLY can’t thank you guys enough. THANK YOU THANK YOU! I’m a little bitch I teared up ♥️ So many ideas and concepts to put into action. I’m excited for us guys 😊 NEW DT T-SHIRT MERCH\n\nhttps://t.co/PFpb5KYE0k\n\n✌️🤘💜💜 LESS THAN AN HOUR GUYS! I REALLY HOPE YOU LOVE THESE ♥️ T-SHIRT ALRET! \nHAHAHAH IM SUCH A CHEESE ASS \n\nEthan and I finally made a tee for you guys and we think you’re gonna like it! I hope 😊\n\nTOMORROW AT 12 PM EST - 9 AM PST !! Ethan is the worst freestyle rapper to ever exists 🙏🙌 Ethan and I have been working on a lottttt of stuff for you guys ♥️\n\nFIRST THING ON THIS LIST IS COMING FRIDAY You can’t judge someone from the outside looking in because YOU DON’T know what they’re going through or how they actually feel. Addiction doesn’t mean that someone is weak or a bad person. Demi is a strong individual and I know she will get through this 🙏♥️ THIS WEEK’S VIDEO IS UP! \n\n @ElJuanpaZurita teaches us how to speak Spanish. But he’s a MEAN teacher 🤪\n\nhttps://t.co/j6GvCCnuHZ\n\n#DOLANPA ! JUANPA’S VIDEO IS GOING TO BE UP SHORTLY HAPPY TUESDAY 😊 https://t.co/52WsLgK1bx hay un invitado especial en el vídeo de hoy 🤔 To whoever is impersonating my grandma on instagram, please stop that’s so weird and she’s upset Flew home to surprise my mom for her birthday today. She didn’t expect it at all and she cried 😭♥️  good kinda cry tho. I love surprises so much. Love you mom last week I know I said I’d be able to tell you guys about something special this week but I’m not allowed to yet I’m sorry I spoke to soon I was really excited. I love you guys and can’t wait to share the news with you. Sorry for being a dumbfuck 😩don’t kill me please I want to break my computer I literally hate it I have the worst luck with technical difficulties. Ethan and I have always been kinda grouped as the same person our whole lives because of how similar we seem being identical twins. But this video show just how different we really are. I didn’t even know that we were this different lol\n\nhttps://t.co/CFLVZVdItl Today’s video is going to be the longest video on our channel 😎 RT @ROSEFULDOLAN: • hi happy tuesday • \n\n#tuesdayselfie @GraysonDolan @EthanDolan &lt;3 https://t.co/EjkoNh4MMS RT @amusingdolan_: Happy Tuesday! ✨💛🌻\n\n-\n\n#TuesdaySelfie #DolantwinsTuesday \n\n@GraysonDolan @EthanDolan :) https://t.co/5jnFTVJ4gK BIG moves today WHOAAA👏♥️ https://t.co/145Oaa4jRY EXCITING ASS WEEK AHEAD Don’t let someone’s negative action become a chain reaction. Instead do something good and redirect that energy into something positive. Ethan just complimented my cooking btw HOLY SHIT JUST GOT OFF THE BEST PHONE CALL EVER. IM SO EXCITED. ITS HAPPENING! \n\nYou guys will know next week 😊 Go like ethan’s last photo on IG Made banana pancakes this morning ☺️ Hey! Good morning 😊 AGGHH NOO 😭😭😭😭😭😭 https://t.co/ZFmB5ySmoA THIS WEEK’S VIDEO IS UP! 😃!\n\nhttps://t.co/roqRh5n25A\n\nPlease don’t judge me I was such an idiot 😭 Goodnight 😅♥️ Ethan is a fucking idiot. I’ve been cooking dinner for him for an hour and he starts cutting his steak with the knife I cut the RAW CHICKEN with AFTER I TOLD HIM THAT I JUST CUT THE CHIKEN WITH IT. NOW HES TELLING ME THAT HE DOESNT WANT TO EAT IT BECAUSE HE DOESNT WANT SALMONELLA I hate when people read the text on your shirt out loud. LIKE I DIDNT FKN KNOW WHAT IT SAID BEFORE I PUT IT ON THANKS ASS CLOWN Woooooooowwww this is amazing https://t.co/iswNmFMtVe I’m definitely not going to wake up early tomorrow so I can fix my backwards ass sleep schedule but I want to.. so that counts I guess? I think I’m too shyyyyy to tweet ☺️ Where tf have I been I’ve been so anxious this past week and idk why 😑 Not to sound like a cheese ball but don’t take freedom for granted :) 🇺🇸 💥🇺🇸 https://t.co/6DsSxivfDx HAPPY 4TH OF JULY!!!! THIS WEEK’S VIDEO IS UP! \n\nhttps://t.co/WEbHRcxsLm\n\nGrab a snack because it might make you hungry 😩😊 RT @dolanvinyl: happy tuesday my loves ! &lt;3\n\n#TuesdaySelfie #DolanTwinsTuesday https://t.co/mvpvQQkkLn RT @grayontheloose: Happy Tuesday everyone! 😊\n\nIf the universe didn’t need you, you wouldn’t be here right now, so keep going 💜\n\n@GraysonDo… HAPPY BIRTHDAY 🎈 ♥️ https://t.co/KBQolH5v1Y I LIKE YA HOODIE 🤘✌️♥️♥️ https://t.co/2294WXZyqk That’s my fav song ♥️ H A P P Y T U E S D A Y https://t.co/ogvAWgrov8 IM SMILING 😊♥️ https://t.co/UN5AiowVl5 RT @CreateandGrind: happy tuesday betchesss🧡 #tuesdayselfie @GraysonDolan @EthanDolan https://t.co/2QxJX9KCB9 Happy Tuesday 😊💜 Ahhhhh I’m such an asshole for that 😭 HAHAHAHAH Ethan and I are doing something that I REALLY wanna tell you guys but I can’t so sorry ☺️ Good morning? 🌵 🔥 💫 🌙 https://t.co/jmptVIJsOY Photo shoot tomorrow 😎 I love you guys so much. I’m so happy to have you all in my life. I know that I will always be able to trust you guys and be inspired by your positivity♥️ Great news today 😭😊🤔🤔 Make someone smile today THIS WEEK’S VIDEO IS UP \n\nhttps://t.co/1Kw7ZVNac8\n\nI have nothing else to say so..... \n\n🤪 Going out in public by yourself is so hard as a twin. Really not used to this I’m so awkward Ethan is supposed to be editing but I just walked in on him browsing piglet auctioning websites 🤔 :/ got a new phone and lost all of my everything Just filmed the stupidest video idea ever but it was Ethan’s idea so it’s not my fault. It was actually fun tho not gonna lie 😶 @RyanAbe Love you! I believe in myself again ♥️ The goal doesn’t involve any material item, or status level. To me, it is more important than anything you can touch or have. I set a goal for myself that is very special to me a few years ago. From then until now I kinda lost the focus &amp; motivation to accomplishing it because I was too busy trying to find myself. But now I am awakened. I am finally back on the track that I started on. I’m gonna do this I’m so excited https://t.co/kzHlKUqbzj @JoeyGraceffa @TeenChoiceFOX @EthanDolan 😊♥️ FINALLY! hahah the bonus video is up everyone! \n\nhttps://t.co/e1LNb0J5qf\n\nIf it gets a lot of likes we’ll probably do more bonus videos 😊 lolol At this SLOW ASS rate the video will be up at 2 PST 😭 im so pressed Yo sorry guys our video got all messed up idk why. I’m gonna fix it re-upload asap 🤦‍♂️ VIDEO GOING UP AT 12 PM PST - 3 PM EST Yo I love you guys more than you will ever know. Thank you for letting me be myself and supporting what I do. Thank you thank you thank you I can’t say it enough ♥️♥️ Been filming everyday and it feels so good Saw your first video back in 8 years today @dylanobrien  we should make a vid together haha I SMELL A BONUS VIDEO IDK WHERE IT IS BUT I SMELL IT I had a dream about pancakes so I guess I have to eat them right now? Goodnight guys 😊♥️ Pizza jokes are cheesy THIS WEEK’S VIDEO IS UP ft. @jamescharles @emmachambie \n\nWe mucked a lot of food \n\nhttps://t.co/VPz7h94M3u\n\n🥤🍔🥞🥓 Sorry guys have to push to one due to technical issues on the other end... (James and Emma aren’t ready) BUT THTS OKAY BECAUSE ITS GOING UP AT 1 PM AND I MEAN THAT I WILL NOT WAIT FOR NO ONE VIDEO COMING SOON 12 PM PST - 3 PM EST \n\nGET REEEEAAAAADDYYYY 🤪 OF COURSE I WAKE UP AND THE UPLOAD CRASHES RT @EthanDolan: You are what you attract. As long as you are not evil, you will not attract it. Make sure you’re a good person, good things… Guys WE are the generation that is going to change this world! No more waiting no more talking MORE DOING! Start by being kind and supporting one another. Everyone’s timeline should be filled with positivity! There is ALWAYS a positive way of thinking AND saying! I was a big fan of X’s music since 2015 when I first him. Although I do not side with the decisions he made in the past, he was an amazing &amp; influential artist and touched many people that I know. He inspired many 2 live more positively and did a lot of good for this world RIP🖤 😓🙏 I wanna travel My twitter mentions get interesting on Father’s Day Just walked down a red carpet less than a minute after I woke up from a nap lol. If I look like a blow fish in the pics that’s why 🤪 My dad gets here tomorrow woooo! Hahaha what a lame ass tweet not really my dads cool but like still Going live on IG today with some friends I hope Ethan does something stupid today so I have a tweet that will actually get likes :/ I never know what to tweet @BryantEslava @EthanDolan Love you beanman You ain’t Nolan https://t.co/WxynADL8ox What do you guys want me Ethan James and Emma to talk about? RT @jamescharles: what should me gray e &amp; emma do for my channel?? Yes it will be 😎 @EthanDolan @jamescharles @emmachambie https://t.co/Bi9bGoEgyr I can’t wait for the official start of summer break so we hang and talk on twitter together. I feel like a lot of you guys have been missing for a while bc of finals and exams :( #AskEthanAndGrayson 4 is up!!!!\n\nhttps://t.co/6C0vzJpd5Z\n\nThe largest of all of the annual Ask Ethan and Graysons \n\nThank you for all of your questions! Hopefully yours was answered :) As soon as I know exactly when the video is gonna be up I’ll let you guys know 😊 Might be a little later than usually with the upload today because of how long this video is hahaha AskEthanAndGrayson FOUR at 2PM PST - 5PM EST!!!!!\nHopefully your question was answered I mean we and answered A LOT of questions! It’s gonna be a rather lengthy video so get ready to grab a snack and relax or whatever Poor Ethan has had pink eye for 6 days now and it keeps getting worse... now I’m starting to feel kinda bad about farting on his pillow :/ Yo I love you guys goodnight ♥️ Keep moving forward Washing dishes and doing laundry while Ethan is playing fortnite... how’s your weekend going I just went to punch James in the face and he told me to stop... what a fake bitch Ethan can’t figure anything out on his own 😒 I have to daddy him up and help him with everything 😑 I knew this was gonna be the coolest shit ever https://t.co/PN4FTRB1zT THIS WEEK’S VIDEO IS UP! \n\nhttps://t.co/LCs8nf4ThG\n\n😳😳\n\nI can’t believe Ethan did that to himself in the shower... 17 minutes 😝 Haptues ppyday I meant Grayson not Gayson btw Going to be looking through the #AskEthanAndGayson hashtag for the rest of the weekend btw 😊 #ASKETHANANDGRAYSON 4 is coming but it’s up to YOU GUYS to make us answer questions hahaha. Tweet us any question you want with #AskEthanandGrayson and we’ll@try to answer it in our annual video 🤘😝\n\nThe weirder the better I guess YAY 😭 I’m so glad that you guys are liking the new merch ♥️ Me and Ethan designed this whole collection so I was really nervous for this drop. But instead of nervous I am now happus I’ll leave it up so you can watch if even if it’s not live ♥️ https://t.co/4D0208F6kp I’m gonna go live on instagram tomorrow afternoon. I wanna talk to you guys 😊 Don’t be afraid to open up and let people know how you feel. Everyone is going through something and if they’re able to relate to someone else it could make them feel a lot better :) How come every time my mom tells me to call her she never answers 😑 WEEK’S UP... VIDEO IS THIS\n\nhttps://t.co/REkB8uc9BZ\n\nThis is why Ethan has been sleeping in my bed for the past 3 weeks 👻 Hope you guys all have a great Tuesday :) Always just be yourself no matter what’s happening. Don’t lose sight of who you truly are. Wigman https://t.co/1AjfE8aDQX Omg ****** is so blank Good vibes rn 🤤😍 HEY HAPPY BIRTHDAY BROTHER!!!!! @jamescharles I’m not even in school and I can’t wait until finals are over YOOOOO GUYS a couple moms just asked us for a pic and they were calling Ethan Nolan 💀💀😭😭\n\nThey were like “thanks Grayson and Nolan!” HAHAHAHAHAHAHAHHAHAHAH OMF THIS WEEK’S VIDEO IS UP \n\n😩😅😩😅\n\nhttps://t.co/Fk5C0LJavx\n\nNo girls even like Ethan anyway 21 minutes 😊 FINALLY TUESDAY AGAIN \n\nWhy does it feel like last Tuesday was way more than a week ago Back home in jersey for a little. It feels amazing 😍 It seems like violence has become a trend. A change needs to be made. We need to keep not only this country but the KIDS of this country safe. Sending all of my thoughts, prayers, &amp; love to those who have been affected by the horrible events that have occurred in the past 24hrs. Been filming almost everyday this week. I can’t wait for you guys to see these videos I’m not a fuccboy for that last tweet I’m just in my feels 😑😧 In my head your smile appears clear wish it wasn’t my imagination running away with a dream 🎵 😭 Sorry I’ve been so boring on here guys I’ve been sick af and can barely move 😩😑 Yanny Why do I get sick so often 😩 THIS WEEK’S UP IS VIDEO \n\nA house tour of our new house that went exactly as planned \n\nhttps://t.co/o6XpYnpr2x\n\n🏠 😩 1 hour and 1 minute Working on your fitness is also working on your happiness Happy Mother’s Day moms I love you guys Sitting here realizing how sad it is that I’m allergic to dogs 😔 👙🌖 https://t.co/UVBGJzQc2k New Merch available on https://t.co/IEBKleRbTD ! GET IT or don’t but if you want it GET IT but if you don’t want it don’t get it 🤘 Hope you guys like it 😊 NEW MERCH IN LESS THAN 10 MINUTES We might drop new Merch tomorrow but I don’t know. Actually yeah I do we are dropping new Merch tomorrow Rt for Nolan THIS WEEK’S VIDEO IS UPP!\n\nThe truth had to be told... \n\nhttps://t.co/5timMFtHBE\n\n👦🏻👦🏻👦🏻 AHHH SORRY I JUST HAD TO TEACH MYSELF HOW TO PHOTOSHOP FOR THE THUMBNAIL VIDEO GOING UP SHORTLY Hey guys 42 mins until the videos up 🤘 It’s so good to be back 😊 thank you guys for making every Tuesday so fun♥️ We still have another video filmed that we’re gonna have up on Tuesday but this reeeeaaallllyyy sucks that we may never be able to post this one 😔\n\nAGGHHHHH we’ll figure somethin out 🙃 We were almost finished editing Tuesdays video and realized that all of the footage for the end of the video is gone. No idea what to do. Of course this shit would happen this is actually awful IM SO DEAD WHO TF MADE THIS HAHAHAHAHAHAH😭💀 https://t.co/Ze7HFW1iEv I’ve had such bad twitter block lately like I really don’t know what to tweet So jet lagged I don’t even what days it time. I’m confuse I miss jersey summers Why am I so old... I just took inspo pictures of a bathroom in this restaurant because I liked the aesthetic. I feel like I’m 43 I missed saying this so much... \n\nTHIS WEEK’S VIDEO IS UP \n\nhttps://t.co/M7jtzlzCTt\n\nThank you guys for sticking with us♥️ \n\nE and I feel more inspired than ever and can’t wait to show you what we’ve been making 😊 Video will be up at 5:00 PM EST - 2:00 PM PST Just landed in NYC. SPRINTING to my hotel to get on WiFi and get this VIDEO UPPPPPP YYYEAAAAHHHYSGHADCFHKLDFHL Tuesmorrow\n\nHahahahaha that was so cheese Ethan’s and I most definitely have our own rooms and beds but for some reason when I woke up today he was laying next to me... 🤔 Ethan just sent me a Snapchat of my computer and with his drink spilled all over my fkn key board and locked himself in his room @EthanDolan ARE YOU SERIOUS GTFOH NOW! IM SO EXCITED TO COME BACK GUYS YOU HAVE NO IDEA I need to be more active on twitter :/\nWHATS UP I just pulled a muscle in my neck by DRYING MY HAIR AFTER I SHOWERED WTF. I look like a stiff ass scarecrow now what a freak I lost Ethan to Fortnite... That’s all he does all day. He doesn’t spend any time with his brother anymore 😔 I haven’t been this proud of myself for anything in a long ass time. I’m so excited to show you guys what we have coming for you ♥️ I can’t wait Getting clooossseerrrrr I’m in my feels I guess it’s better to overthink than underthink... right? Sometimes I feel like I care about people more than they care about themselves Money is going to ruin this planet OMFF https://t.co/MLd4y815qs Damn, you guys are the best. You inspire me so much in so many different ways. I just saw the actual most disgusting edit of me and Ethan like I’m actually so uncomfortable You’re strong enough to overcome anything, so believe in yourself Idk why I look so serious I swear I was happy af in this https://t.co/zEAN7swkYo Coachella 2018 complete and done right with the right people. I feel such good energy surrounding me and I’m ready for life 😊 I love when the sun goes down at Coachella so no one can see me when I dance because I def look like a fkn dumbass Ethan asked me to go in the gas station and get him snacks but I refused because of his vicious attitude and he went in and only got snacks for himself. What a mans!!!! Do people really think I won’t hear what they say behind my back? I forgot how stressful putting together Coachella outfits was I actually take the derpiest selfies fking ever Happy national siblings day to my sister Cameron ♥️ love ya I just realized how weird it is that there is someone else that looks exactly like me just walking around and stuff I opened Twitter 27 times today to tweet and I couldn’t think of anything good to say... uhhh fettuccine alfredo... It’s weird how you can learn endless things about yourself. Like I’m me... how do I not know everything about me? Crazy how much life changes when you have the right people around you in the right setting 😊 Meaning that I have only swam while nude thus far I have yet to NOT skinny dip in our new pool Ethan and I just got our first house together. Life doesn’t feel real right now... but Grethan does That was Ethan’s idea https://t.co/Rit2y5EqWv NEW MERCH IN 2 MINUTES Just experienced my first earthquake ever and of course I’m on the 5th floor on an old ass sketchy building right next to a window hahaha Yes Ethan we’ve had this planned for some time now 🙂 https://t.co/EecnhTar8C Stressing tf out today 😃 LOVE THIS THIS IS JUST SO AMAZING Sorry for inactivity. I got so much done today tho :) we got some stuff coming for you. Lotta stuff Me and Ethan just got put in handcuffs all for the cop to tell us that we needed a front license plate... I’m sooooo confused Happy Easter 🐣🐰💜🧡 Life is full of lessons but what are we learning for? You’re perfect the way you are. Everyone reading this, you are perfect. F**k societies ideal look, height, weight, color, etc. You don’t have to be anything for anybody. If you need help with something, ask! \nIf someone asks for help, help! To everyone pulling April fools pranks today so it’s not too obvious... it’s still obvious Being organized is the hardest thing for me Me and Ethan are bestfriends again. Not that we ever weren’t we just are again. I feel so motivated and inspired! I encourage everyone to start new things, meet new people, and just keep an open positive mind. Look for signs. Life will treat you well if you have a positive outlook! New beginnings. I’m so excited. Thank you all for understanding ♥️ Love you guys \n\nhttps://t.co/eySqBIYtsx\n\nWe won’t be gone for long but we definitely need this The video should be up in 10 minutes Ugh I just got so fkn sick 😩 It sucks how you have to be careful when choosing friends. Some people REALLY don’t care about you and only care about what you can give them. I’ll never understand that.. Back in Jersey for a little 😊 I missed my family and friends so much Life has been so confusing lately. Idk if I’m ever gonna figure it out lol THANK YOU FOR 6M ♥️ My head is still swollen and I still look like a freak lol I REALLY need to change my layout lol. I need to change like allll of my prof pics tbh Happy Spring I usually don’t tweet about doing stuff like that because I don’t do it to tweet about it but that really just made my day 😊 I just gave goldfish to a homeless man and he started smiling and dancing. That made me so happy 😊 BE GRATEFUL FOR EVERYTHING YOU HAVE THIS WEEK’S VIDEO IS UP \n\nI hope you see your box 📦 😊\n\nhttps://t.co/OIfQrsk6mq\n\nThanks again to everyone who sent a package love you guys Loving your #tuesdayselfies ♥️ I HOPE YOUR PACKAGE IS IN TODAY’S VIDEO Yo I love AND respect you guys so much. Thank you for everything you do for me and E. Your support doesn’t go unnoticed. You guys are the best ♥️ I just ate why am I starving I found leprechauns 🍀 https://t.co/8fBFs13qsx Happy St. Patrick’s Day 😊💚 Fk you turtle https://t.co/mQJK6Mr7I9 Summer please come really fast and go really slow I’d rather someone say “don’t text me I hate you” than leave me on read Said something important on Snapchat @ GraysonDolan Yesterday we had a garbage service come to remove all of the empty boxes after we filmed the PO Box video and they SOMEHOW mistook full bags of my CLOTHES for BOXES and threw ALL of my clothes out 😩 We’re supposed to be there for each other not bring each other down Don’t hate on the artists whose tats we picked. Guys these tats are for everyone in this fandom. We are a family. Let’s act like it. You guys are permanently in m.... uhhh I mean like in my skin not like i...\n\nhttps://t.co/AwQYMt8bKq\n\nThank you to everyone who participated in this video I appreciate you very much. \n\nThis is for ALL of you ♥️ 20 mins 😊 Good morning! Poor Ethan is really sick and because of that poor me is really bored. 😑 Social media confuses me Be proud of being different To whoever put beef in the box.... the warehouse now smells like ass NEW MERCH IS AVAIL \n\nhttps://t.co/Vqk9Y9zSWt\n\nGet it if you want idk hahah Special thanks to everyone who sent anything to the PO Box. You guys are amazing. Like wtf I can’t believe this. Hahaha it’s gonna take a full day to open all of this stuff but I’m hype it feels like Christmas 😊 I guess it’s just hard being a teenager. After doing the same thing every week for 3 years you start to question yourself a lot. By no means do we want to stop making videos every week we just need some change in our lives. We’re feeling really reinspired now and the vibe in the air is so much better. It’s funny how well you guys know us. I’ve seen a lot of comments on our recent video saying that our videos seem too forced and that we’re uninterested in the stuff we do now. Me and e were feeling kind of stuck creatively for a while but a lot has changed in the past week. LIMITED EDISH MERCH DROPPING FRIDAY LIFE IS WEIRD My car is broken down and I’m stuck af right now love this THIS WEEK’S VIDEO IS UP!! \n\nhttps://t.co/MczeECDOcF\n\n🤘🇦🇺🤚🤢✈️🐦🐔\n\nThose emojis will make sense after you watch it hahaha Happy Tuesday 😊 Me and Ethan just picked up thousands of packages at the post office. We unfortunately have to close it down soon because the post office can’t handle it hahahahahah. If you wanna send any packages it’d probably be best to do it now. This video is gonna be so fun♥️ thanks guys Life feels too good right now. I have so much excitement inside my brain hahah. \n\nIly guys Screenshotting so many tats😊 I’m gonna make final decisions tomorrow I think #DTtattoos In A group chat UGH I HATE WHEN I RUIN DECENT TWEETS WITH PELLING ERRORS My grandma just put me and Ethan in and group chat and said “Hi Grethan!” 😩 Hey guys! E and I really want to get tattoos for you guys because you mean a lot to us. Send us your ideas or drawings or whatever you want with the hashtag #DTtattoos ♥️ White sands https://t.co/2Yy87FME9y Back and refreshed I don’t wanna go home I’m having too much fun Hahahahahaha omf https://t.co/lGkpc1vgPA YO GUYS I hate shopping so much... when I was little I threw a rock at my sister and as my punishment my mom took me shopping with her all day 😭 I’m so burnt ☀️😩 Gonna make a video getting tattoos you guys design. :) we’ll get anything\n\nYou guys are really creative and your art inspires us ♥️ 😊 The world is filled with good vibes and that is what i seek 🎶 YO’S THIS WEEK’S VIDEO IS UP \n\nhttps://t.co/ef3LX6vjeV\n\nDIFFERENT TYPES OF FANS 45 MINS TIL VID Trying to talk to Ethan while he’s on his phone is like trying to talk to a brick wall while it’s on it’s phone Be nice to people If you have faith things truly do workout So much love here in aus. You guys are the best ♥️ I enjoy deep conversations about meaningful shit. I need to have more If you guys know where the house that we’re at is please refrain from coming cuz we could get kicked out. And then we’d have no place to stay :/ Good morning 😊 Fell asleep in the sun... I’m burnt now https://t.co/ib3sQaMZ14 THIS WEEK’S VIDEO IS UP! \n\nhttps://t.co/47nM4rmZFC\n\nWe remade our first video 😭 \n\nAnd I gtg cuz I need a tish NEW VIDEO UP IN 20 I mean yeah it can be \n\nhttps://t.co/hfC6k5xOWD https://t.co/dplckNRe7s RT @GraysonDolan: Can it just be summer like next week What do you mean you can’t quote a tweet with a picture YO guys. E &amp; I are gonna post tomorrow’s vid on America’s Tuesday but then we’re gonna start uploading on Australia’s Tuesday for the rest of the time we’re here because we never upload on their Tuesday 😊\nUnless of course... we have technicals difficulties and need the extra day Yeah I’ll probably live in aus one day AUSTRALIA WE’RE BACK AND WE’RE NOT LEAVING 🇦🇺 \n\n... for a little bit at least yyyeyeyeeioooooooooow I’m excited I’m so excited holy spitmin I went to set an alarm on my HomePod and Siri told me to “stop f***ing talking” WTF IM SO CREEPED OUT Sorry for lack of posts and stuff I’ve been feeling kinda uninspired lately. This trip is going to be really refreshing. I can’t wait to share with you guys 😊 I think I cracked my rib from laughing so hard with Ethan yesterday Caught Trump tweeting while driving https://t.co/MdOfsV7Lag Just deleveloped a pimple in between my eyes on my flight. I LOVE THAT IM SOO HAPPY THAT HAPPENED SO FAST! Happy Valentines Day ♥️ THIS WEEK’S VIDEO IS UP\n\nMaybe some of you are maybe in it idk \n\nhttps://t.co/gGxPTel1at\n\n😊🖌🖍😊 In the meantime I will be sitter here trying not to panic because of these technical difficulties and looking at your #TuesdaySelfie ‘s  ♥️ Sorry the video isn’t up yet guys. It’s hard being a YouTuber and living in a house with no WiFi 😩 51 minutes I just pretended to repeatedly smash Ethan’s head against the side of our car and everyone in the parking lot got SOOOOOOO AWKWARD Hahahah We filmed for two and a half hour last night and the mic was unplugged 🤦‍♂️ Can it just be summer like next week I’ve had the Snapchat update for a few days now and still haven’t figured out the equation. I’m so confused. Do any of you guys have the answer key? Happy weekend 😊 Just got out of a really exciting merch meeting. Working on a lot of stuff we think is cool for you guys The new snap update is more confusing than strawberries on pizza My biggest pet peeve is when people tell me “that place has bad pizza” or something like that like wtf I have never had “bad pizza” it’s cheese bread and sauce and it’s always good stfu FANDOM NAME?! \n\nhttps://t.co/4TTVaXM66R\n\nIf you watch it I’ll follow you if you wanna watch it and want me to follow you New video in 38 minutes 😊 I just ate so much that I feel like gravity is x2 and I’m being pulled down to the center of earth much harder Fandom names 🤔 accepting weird ones ♥️♥️ Staying active and being healthy can be hard when you’re not feeling the best mentally. But if you can push yourself to get out and be active it makes a big difference to your mental in a great way You will meet very few people in life who have your best interest at heart. If you find them KEEP THEM CLOSE Ethan just woke up and asked me if it was noon... it’s midnight... 🤔 I love seeing you guys in real life Ethan is becoming funny again. After a long winter grump hibernation he’s coming out of his den... THIS WEEK’S VIDEO IS UP!\n\nhttps://t.co/9sz1Ey4eLg\n\nThat’s the video of this week that came out this week so if you wanna watch it you can but you don’t have to but it did come out this week Hahahahahah OMF https://t.co/8yjefaJyQN 45 mins 🧐 Love you guys I feel so good today No time to second guess. Do what YOU want I’m fine tho guys. Really I love being active on her and talking to you all it makes me feel better. You guys know me well and I’ve seen that some of you have sensed that something was up so I just wanted to fill you guys in♥️ \n\nI would consider you all my friends. Thank you for always being here for me and stuff. It means more to me than you will ever know. Hey guys I’ve been going through a lot mentally lately. I haven’t been able to be myself in a long time and I’ve been working hard on getting back to who I really am. I have a weird mental block holding me back from enjoying life. Id love to be more active but this is fkn with me I was driving and had to stop to take a picture of the moon behind this house and accidentally captured a shooting star (top left). Everyone make a wish 💫 https://t.co/N1ZBvn8fLb The winter makes my mood so eh Hi guys THIS WEEK’S VIDEO IS UP! \n\nOur most requested video yet. You guys finally got what you’ve been asking for!! \n\nhttps://t.co/yLwhVDUftv\n\n ⛸ 😉 I hate you https://t.co/xFuhLB6mUD Phorty five minids I have to get used to my new hair Good Tuesday Should I keep the blonde or go back to brown idk When your chair makes a fart noise and you try to get it to do it again to show people that you didn’t fart, but it doesn’t make the noise again &gt;&gt;&gt; I miss vine a little bit Jersey is so beautiful. I just drove down a long road with deer running along side my car the whole time, while the sunset was going off. I love home 😊 I was told by Ethan that I need to up Twitter game Thank you for 5 million \n\nFu 👑 love you all \n\nhttps://t.co/ypenmy2weD 15 minutes until the video is up 😊 We did a merch give away in today’s video so some of you guys are getting some merch some I’m not going to be active for some time. Love you guys. If any of you need me I’ll still be here Sending love to my best friends who I consider to be my brothers♥️ I love you guys so much. We’re family. THANK YOU GUYS 5 MIL ON YOUTUBE WTF. I remember being in 3rd grade just learning what Youtube was. I quickly became obsessed with it and always wanted to be a YouTuber. 😭 🍨🍒 https://t.co/7kjFFMh8pq Having a CRAZY day! Filming something with people that I’ve always looked up to This weeks video is up!!\n\nhttps://t.co/HuJ7nAhZDv \n\nI can’t believe we actually got to make this one 😊 TODAYS VIDEO AHGHHHHH\n\nI actually can’t believe we made this video. It’s been a goal of ours for since we were planning on getting a warehouse and it FINALLY happened 😊😊 RT @EthanDolan: If you believe people are less than you do to their skin color, ethnic background, OR HOW THEY WERE BORN, please unfollow m… Love you guys I need to travel Sorry I’ve been inactive today. Not having the best one Hi Ethan hasn’t done anything funny that I can tweet about lately... I GET MY CAR BACK 100% TOMORROW. Doing a shoot with @BryantEslava in it 🤘🤘 THE WAREHOUSE WINNER IS COMING TODAY Every time I laugh I cry First day back to LA and the warehouse flooded with sewage water 😊 THIS WEEKS VIDEO IS UP\n\nBLOOPERS 2017 \n\nhttps://t.co/yla8SwR3Sw\n\nThank you guys for another great year ♥️ VIDEO IS GOING TO BE UP SHORTLY Hey guys due to flying to LA and stuff today our video is probably gonna be up pretty late RT @tamar_t03: Happy First Tuesday of 2018!♥️🎉🎊\n\nHope everyone is having an amazing day♥️\n\nI was kinda liking the curly hair yesterday😂💕\n\n#… ♥️♥️♥️♥️ https://t.co/1HQVb0RZba ITS TUESDAYYYYEE\n\nHahahahah that was so cringe ^ You’re 22 there’s no excuse Suicide is serious. People have lost loved ones, idols, hero’s, fans to suicide. Filming a video and mocking a victim is not raising suicide awareness. Laughing at the body of a poor depressed soul. I can’t believe the disrespect of the victim, their family, and your YOUNG fans. I’m not gonna stay silent I’m gonna stand up for what’s right right now My # 1 goal for 2018 is to start having more fun on social media again. I haven’t really been or felt like myself for a while but I’m going to work hard change that. ♥️ Happy New Year 🎉 https://t.co/9fUOr1Si6U Last day of 2017 Wtf that was the fastest year ever Really tho I ate like 30 p cakes and I’m still hungry I haven’t been full in months. My stomach is a bottomless pit. Ditched Ethan to go snowboarding today https://t.co/JjYxKJ5uLL New Years resolution: Tweet more I was just driving and panicked for a sec because I thought I left my car keys at home WT AC F is wrong with me (EMOTIONAL) WARNING! \n\nhttps://t.co/juI4l3Wqzz\n\nI surprised Ethan with something that he’s always wanted\nand he CRIED all over the place The videos going to be up a few minutes late today sorry guys 15 minutes! @EthanDolan you better be putting the thumbnail up right now MERRY CHRISTMAS 🎁🎄🎅❄️ Just surprised Ethan with the Christmas gift of a lifetime hahahahaha. YES I FILMED IT 😊 I had to take my nose ring out my nose is far too wide for it Cant* Life is so boring when Ethan and talk and has to sit in bed all day 🙎🏼‍♂️ https://t.co/Ezi5uZJyRE Nothing will ever be the same again \n\nhttps://t.co/dUbQETxwrT\n\n(BIG NEWS) (EMOTIONAL) Might be a LIIIIIITTLE late on the upload today but also might not be everyone calling us extra is in for a cute little surprise Some say we took it too far in tomorrow’s video. Others say Ethan and Grayson you guys are just little bitches First day of being an adult felt weird. I’m never gonna let myself be a boring old person tho Thank you guys for all of the birthday wishes ♥️ Gonna be following people all night 🤘🤘 RT FOR A FOLLOW Follow spree coming right up Thank you all for 5 Mil! Gonna do a follow/DM spree later today Happy 18th @EthanDolan Last day not being an adult wtf The loser of Tuesday’s video is going to take the biggest L in Dolan Twins history Follow spree for 5M btw 😊 WE CANT WAIT TO MEET YOU ♥️ Yesterday I tweeted the directions on how you could possibly be picked  😊😊 But now we are MORE THAN HAPPY to announce that we ARE 1000% having one of you guys flown out to hang with us and make a video! We didn’t know how long something like that would take and we didn’t take any of the possible legal issues that we could’ve experienced into consideration When we first had the idea we were so excited and wanted to fly one of you guys out as soon as we could I just wanted to apologize for the huge delay on the warehouse winner contest thing that me and Ethan told you about a long time ago Hey guys It’s on my eye lid 😑 I have a face rash and it’s so itchy UUGGHHHHHFFFFFF Ethan got me good 😑\n\nhttps://t.co/wiyk78LWF8\n\nI’m getting him back tho don’t worry 😊 Not gonna lie Ethan got me pretty good in today’s video... I need to start thinking of ways to get him back 🤔 IM REAL EXCITED GUYS! A new game with me and Ethan just dropped https://t.co/NaMHM9t5ZT. Take a screenshot playing and tweet it to win a chance to come to the warehouse and make a video with us 😊😊 The app Episode will be flying one of you out to meet us AAHHHHHHH Happus Tuesday Ethan invented meat sweats Hahahahaha 🤢😭 Meat sweats - \n\nWhen you wake up and there’s an imprint of yourself in sweat on your bed Ugh I woke up with the meat sweats 🙄 Finally snowed ❄️ https://t.co/gNm5JmFxVz Today is a big day for me. I think we’ve come really far... I’m finally changing my layout Wtf I’m gonna be 18 soon. Idk how I feel about this Ethan spills something at EVERY restaurant we go to 😪 we called him spilly when he was little I just thought of a really good tweet and forgot it 😑 THIS WEEKS VIDEO IS UP\n\nOUR OLDER SISTER DARES US \n\nhttps://t.co/CwyIslNkTE\n\n😩😩😩😩😩😭😭 39 minutes!! Shooting with @BryantEslava every day this week. A LOT of photos coming soon Goodnight 🌙😊 Who else received their Merch?? I wanna see you in it!! 😊😊 I hope you like it and are comfortable ♥️ https://t.co/KQLFbwPefg Baking cookies rn. I️ accidentally made enough dough for 80 cookies but then I ate probably half of of the dough so you’re only getting 40 @EthanDolan Ethan and I just filmed a video. We really set ourselves up 😑😩 No shave November before and after https://t.co/OFjU8N4A2N I’ve been walking around with a green beard and a red mustache for the past 3 days... I can’t wait to shave my face tbh 😭 I’m in Ethan’s lane too tbh https://t.co/9yT7AYIor8 I don’t know 😭 https://t.co/zvfKSFrDkJ We dye our hair... \n\nhttps://t.co/wTMgcdnsGR\n\n😭😭😭😭😭 43 MINUTES!! If you don’t answer your phone right now the Dolan Twins are splitting up @EthanDolan Just finished filming a video.... idk how Ethan gets me to do these things Make every holiday season as special for your fam as possible. Show everyone how much you love them this year. Sorry to be all cheesy but it’s really important I wish it was cold enough for snow and winter activities. I hate when it’s pointlessly cold and there’s nothing to do I’m still full 🤭 WTF 😭 My keyboard is messed I️ ‘ M ******\n\nHahaha I️m so tired of that glitch I️m not even kidding I️m so excited to see all of you guys in our merch.  It makes me so happy thinking about It NEW HOLIDAY MERCH IS OUT \n\nhttps://t.co/PFpb5LgfoU\n\n☃️❄️🎄🎅🏻🕯\n\nHope you guys like It 😬♥️ I️m staying up I️m really excited hahaha MIDNIGHT MERCH DROP So thankful for all of you guys 😊 Holliday Merch? THIS WEEK’S VIDEO IS UP\n\nhttps://t.co/mLeKodueZf\n\n🐶 🍪 \n\nIf you watch It I’ll follow you. Please watch It please PLEASEEE PLEASE! Just watch It 50 minutes Not even kidding I just laughed so hard at Ethan in today’s video that I almost yaked on my comp I️m eating dessert but my allergies are so bad and my nose is so stuffy that I can’t even taste It. I really want to cry. Yez https://t.co/5kC0gfMNFi I’m ** Sorry I haven’t tweeted in a while I️’m gonna follow some people now Hi And then I said “I like your bike too!” And he said “no my bike is ugly... well bye” and peddled away 😭 A really cute little kid riding his bike just rolled up to my car window, signaled me to roll it down, and told me my car was “very good” hahahahahaha omfg If you ever sense that someone is down please be there for them. You never know what someone else is going through. Even if you’re not close to them, do what you can to help. I feel genuinely happy 😊 THIS WEEK’S VIDEO IS UP!!\n\nWe spill some tea about each other 🐸 ☕️ \n\nhttps://t.co/pjnqv5CgGp\n\nRead the bottom of the description for the truth.. 29 minutes!!!!! Back home 😊 Ethan and I are really sorry. We can’t go to Hyde park but we’re trying to figure something out. We want to see you guys but we don’t want to be disrespectful and most of all we want everyone to be safe. I don’t think the meet up is going to work today guys Guys I had no idea there was a memorial in Hyde park today for remembrance day. It’s more important to pay respect than anything right now. I feel horrible. If you are going to the meet up today PLEASE stay calm. I want this to work so we can all have a good time! If Ethan and I can’t take a picture with every person individually we at least want to see you all. But stay calm! No pushing others please. Spread the word ♥️ LONDON! MEET UP AT HYDE PARK TOMORROW AT 12:30 PM! I wanna see you there!! RT @GraysonDolan: MERCH IS NOW AVAILABLE!! \n\nhttps://t.co/hX5ROeGha7\n\nHope you guys like it ✌️😊🤘😊 It’s making me happy that you guys are liking it 😊 can’t wait to see you in it! Ffffyyyyeeeaaahhhh MERCH IS NOW AVAILABLE!! \n\nhttps://t.co/hX5ROeGha7\n\nHope you guys like it ✌️😊🤘😊 Merch drops in less than 3 hours guys!!!!! We’re doing it Sunday I’ve decided. I’ve missed you London people 😮♥️ I wanna have a meet up in London 🤔 London tomorrow 😊 I lost my tampon earring I just signed up too btw Sign up please! So far both of my grandmas have \n\nhttps://t.co/PFpb5LgfoU This week’s video is up! \n\nWe get glam makeovers 😩\n\nhttps://t.co/mDqcCSBDp4\n\nIf you watch it I’ll follow you hahahah Might be a few mins late on the upload today. When e and I are in Jersey we have to drive really far to find WiFi because we live in the woods hahaha OTS TUESDAY Ethan was coughing in that pic btw *cough cough* New Merch Soon *cough cough* https://t.co/v1Ri4TAakx Dot com of dolan twins 🧐 RT https://t.co/98ixsdyHRk Ethan and I have a big 🍑announcement in our next video!! Make sure you watch the whole thing  😶 Wait wtf I tweeted somethin and it never posted Put down my phone and spent time with my family and friends today. Love you guys♥️ This video explains my last tweet 😑\n\nhttps://t.co/gN5b4RzmZF\n\nWe just hacked the iPhone X @Apple I just tried to pick up my dresser and sharted in my pants Bonus video coming soon Just got the iPhone X. Now Ethan’s face can unlock my phone... great Missing someone is an intense feeling I wanna do no shave November but I'm also a little bich so idk Halloween costume on IG 🐺 THIS TUESDAY'S / THIS HALLOWEEN'S VIDEO IS UP! \n\nhttps://t.co/G3j1JCj8F1\n\nI scared the S out of Ethan hahaha. \n\n#DolanTwinsNewVideo for a follow!! 30 minutes 😊🎃 HAPPY HALLOWEEN 🎃👻💀😈 GOT A LOT OF STUFF COMING FOR YOU GUYS REEEEAAAALLLL SOON 😊 It's gonna be twice as crazy 😮 https://t.co/8RAYRfePdS I know what I'm being for Halloween Scared tf out of ethan What should I be for Halloween?? Sorry I'm boring I'm so jet lagged Hahaha this is gonna be good @EthanDolan 😈 Going for a run in Central Park and just hit myself in the face with a door so hard in front of everyone 👍👍 Slide show mike 😪 https://t.co/Wxf2lsAghs ITS UP!! \n\nhttps://t.co/zxWiWhK22b\n\nThis one is... scandalous? Or something \n\n🌴🌴🌴🌴🌴\n\n#DolanTwinsNewVideo for a folllloooowwwwwww 8 minutes 😊 You got nice toes boy 👅😈 https://t.co/zzFU1YphOS Loser gets naked on a public beach 😊 Just went surfing. I had fun. Ethan just complained about his nipples chafing off the entire time 😪 Don't take anything for granted. You're here, ENJOY IT. life is good 😊 Hair can you grow faster I don't like your current haircut please I already turned back into sour cream Grayson I love being home 😊 Thanks ♥️♥️ https://t.co/V84SvZDa2I NO MY THIGH COLOR IS NICE AF RIGHT NOW THO https://t.co/Q0XCRYh5UO THIS WEEK'S VIDEO IS UP\n\nhttps://t.co/lPjiOUOeKy\n\nI didn't trust Ethan to give me a good spray tan but I still let him. Why did I do this. I don't know. \n\n#DolanTwinsNewVideo for a follow 🤘 15 mins 😊😊😊😊😊 It's happy and I'm Tuesday One time someone went to just wave to him and he went in for a hug 💀😩 Hahahah Ethan IS awkward. Whenever we meet someone he always makes me go first to see what kind of handshake we do because he's deathly afraid of awkward daps. I'm gonna replace Ethan's toothpaste with cream cheese HEY Very busy working on a lot of things I think you guys will like 😊 Spitious isn't a real word Have no idea what \"Spitious\" means. Ethan told me it was a good adjective tho Back in jersey and the fall vibes are spitious 🍂 RT @grayismybabe: bob and rob..with a little twist 🔥😂 https://t.co/TUYkOZ44Ut #DolansTwinsNewVideo @GraysonDolan @EthanDolan x5 THIS WEEK'S VIDEO IS UP!\n\nBob and Rob are back 😭\n\nhttps://t.co/qhQqeZs7E7\n\n#DolanTwinsNewVideo for a follow 😊 52 MINUTES We didn't even wanna make tomorrow's video. Bob and Rob made us I mean we always do but this was bad hahahahah Just did something REALLY stupid for a video I've been on twitter for the past 45 hours I just didn't tweet bc idk wtf to say lol I belong in jers As you guys know @EthanDolan and I are workin with @MTV . WE'RE GONNA BE ON TV ON @TRL TODAY AT 3:30 SO PLEASE WATCH. ITS GONNA BE CRAZY 🤘♥️ Ethan broke the discs with a sledgehammer everyone roast him Doing a Bob and Rob Season 3 giveaway... \nwho wants one? https://t.co/GMeKOTEBtk He told me his nipples are next but idk if I believe him https://t.co/PxbMJrnX7l Loser gets their 👅 pierced \n\nhttps://t.co/G9ePcBFpFW\n\n😰😰😰😰\n\nYou can tweet #DolanTwinsNewVideo for a follow &amp; DM 30 MINS TUUUUEEEESSSSSDDDAAAAYYY RT @TRL: 😵💀☠️  this picture is not a big deal like it's fine calm down 😵💀☠️ https://t.co/hgArGwvyTa Things like this happen way too frequently. Don't lose hope of making this planet peaceful. Keep spreading ♥️ My prayers are with those who were affected by what happened in Las Vegas ♥️ Halloween vibes are the best 🍂 What's up Me and E's first day on TV is this Thursday 😦 You are the one and only reason I'm living the life I've dreamt of and doing what I love. I promise that I will never forget that. Dang. You guys are the best. Like actually the best. I love you all so much. Yeah I mean if you want https://t.co/cWBORVQdcu Thank you 😊 followed you 😊 https://t.co/LdsLi48rmp NEW VIDEO UP\n\nSpecialty fact. I wanted to slap Ethan this entire road trip. \n\nhttps://t.co/f1eaM6nhzy\n\n#DolanTwinsNewVideo I GOT IN Currently locked out of our YouTube account 😑 idk what's going on right now but we will figure this out Might be an hour later than usual on today's upload. Just landed in NYC. Looking for wifi HYPE TO SHOW YOU TOMORROW'S VIDEO\n\n#DolanTwinsTuesday 🤘😝🤘 Sorry for my inactivity. Needed to go on an adventure today &amp; be with nature. been overthinking stuff lately. A day like today really helps😊 Life is amazing. Just give it some time https://t.co/TssIDskVFk\n\n♥️ 10 minutes New video today. Just wanted to fill you guys in on some stuff we think you should know ♥️ Me and E are gonna be on TV... LIFE IS REAL CRAZY ETHAN AND I ARE GONNA BE ON TV! @MTV is bringing back @TRL and me and E are gonna be working with them! IM SO FREAKING EXCITED GUYS The announcement has come TODAY IS THE DAY Open for a surprise https://t.co/cfROJMSjBa Ethan just dropped his phone from maybe 4 inches above the ground and it completely broke and won't turn on 😭😂 Still following people all through tomorrow  😊 RT FOR A FOLLOW. \n\nTHANK YOU FOR 4 MIL. REALLY HAPPY TO HAVE ALL OF YOU GUYS HERE Wow Ethan didn't even wait to do the follow spree with me 😔 \n\nFollow spree at 4M 😊 Proud mother of Edwin Dolan https://t.co/BFSnAWeLPm Usually go by daddy but this week I'm mommy I guess \n\nhttps://t.co/s0MRcyADAG\n\n#DolanTwinsNewVideo Today's video is for the moms I can't wait to tell you guys ♥️ BIG announcement coming for you guys SOON The world is so much bigger than where you are right now. Your problems are so much smaller than you think they are right now. Not to be ur mom but good manners go a long way It was really windy on top of this mountain https://t.co/qWYBS40xC7 Hey guys srry 4 not being on so much Im ona road trip in the middle of nowhere &amp; don't have service. But we are making another adventure vid Taking tattoo ideas from you guys. I kinda want one soon? 😮 I still can't show the scandalous one \n\nhttps://t.co/pBq5dx7xKx\n\n#DolanTwinsNewVideo 15 minbutos Guess what today's video is \"Where does this baseball bat even keeping coming from?\" \n\n-Rob Oh my gosh I just realizes it's whose instead of who's I accidentally titled it \"NAME THAT BODY PART\" instead of \"GUESS WHO'S BODY PART\" HAHAHAHA WTF IS WRONG WITH ME 😭😭 My ass saved my ass.... just watch \n\nhttps://t.co/f78Ka0kjb7 7 mins 😮 HAHAHAHAHHA GOT YOU ALL!!1!1!! BONUS VIDEO TOMORROW AND TUESDAY VIDEO THE DAY AFTER THAT. TWO INA ROW 🤘😝🤘 Guys I'm sorry but there will be no bonus video this week :/ Life is crazy. A good crazy Stay safe from the hurricanes everyone ♥️ love y'all Tomorrow. Happy early birthday @GraysonDolan ! Continue to grow, learn, &amp; strive for excellence! Hope this year treats you well! The big 46! https://t.co/zSm55a8f77 The back of Ethan's head makes me laugh I landed with my skateboard vertically in between my legs and my feet didn't touch the ground. I yelped so loud lol NEW VIDEO UP. \n\nI can't believe we're actually showing you guys these videos lol\n\nhttps://t.co/l5sha7gObu\n\n#DolanTwinsNewVideo 4 a follow😊 15 MINUTES E and I r gonna start uploading our vids @ 1 PST - 4 EST from now on. Hopefully most of u guys are out of school by then and won't miss it😊 Wtf how do I get auto corrected when I copy paste 😟 TUESDAY\nTUESDAY\nTUESDAY\nTUBEMINDAY\nTUESDAY\nTUESDAY I'm just tryna keep it real RT @Caspar_Lee: The Dolan Twins interview is out now! WATCH HERE: https://t.co/Y3spHgdP2e @EthanDolan @GraysonDolan https://t.co/9JU4Oqwqiv Sorry for being inactive. Ethan and I have been trying to come up with video ideas all day. I feel like eh I need to get out of the city Woke up from a nap 15 mis ago &amp; Ethan is nowhere to be found. I texted him &amp; called him. No answer. Then I see that he tweeted 10 mins ago🤔😩 It hurts...\n\nhttps://t.co/ARr89JZhXB Ok 5 minutes Wtfing technical difficulties. We might be a little late but just a little sorry 29 minutes OH YEAH. New Video Tomorrow Such good vibes right now ahhh But also really funny https://t.co/4IUDuZW7Dl ITS UP \n\nTHIS. WAS. SO. BAD. \n\nhttps://t.co/IAO7q6mOt3\n\n#DolanTwinsNewVideo 4 daaaa follow The video should be up in like 15 mins 😮 What's up guys I miss you. Like the real life you. I wanna see all of you again 😔 We're gonna post this vid an hour later than normal. Technical difficulties 😑 Tuepsday Love you Houston. Great memories from that night. You guys were amazing. Stay safe ♥️ https://t.co/jDfeMSpTQc I need a haircut and a tan. I look like a ghost that needs a haircut RT @EthanDolan: Drama is cheap Social media is way too negative lately. Something needs to change. IM MORE THAN JUST A MINION 😭 Can I get my account back @EthanDolan My @ 😭😭😭😭 TODAY'S VID IS HERE\n\nhttps://t.co/tInxaVlYrs\n\nSay goodbye to @GraysonDolan 52 MINS 😊 More of you guys are in tomorrow's videoooooooo Gonna be a long night 😫 Me rn 🙄😑😫😭 Today is going to be very... interesting :  ) Ew smiley faces like this :) are creepy asf now Good morning :) Just trick shotted toilet paper from the bottom of the warehouse thru the door to the top bathroom and it landed on E's lap... ur welcome 😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊😊 https://t.co/Uz8M06VY3X RT @1_800_DOLANS_4U: I don't even know what to say about this video 😂😂 in a good way. WATCH IT AND LIKE IT @GraysonDolan @EthanDolan https:… THIS TUESDAY'S VIDEO IS UP!! \n\nTypes Of YOUTUBERS\n\nhttps://t.co/jXKH2lnVae\n\n#DolanTwinsNewVideo for a follow 😊 4 minutes and I REALLY want you guys to see this one lol 😭😂 THE VIDEO WILL STILL BE UP AT NORMAL TIME H YEAH I told myself I was gonna take a little nap because I didn't get a lot of sleep last night and I just woke up now!!?? wtf I have to upload 😫 I miss Ethan's long hair. I used to love slapping him in the back of the head and watching it flop 😍 I really wanna go to the moon one day Respond to this so possibly be shouted out in a videeeoooooo I'm toast guys. Ethan's gonna kill me. I just made him drive me 45 mins to a store and it's closed 😭 I should've looked before we left lol What's upppp Not this week's I mean today's hahah THIS WEEK'S VIDEO IS UP \n\n😭😭😭😭😭\n\nhttps://t.co/4OXrwkpKcd 57 mins FFFFFUYEYEYWHQHAGAGGG Hahaha I was getting sick but then I realized that I didn't sleep for 5 days in a row... jk but kinda not jk tbh Finally got the sleep I needed Why do I have to be allergic to dogs I love them so much 😫😭 https://t.co/9lJQo9jlwD I'm just gonna carry the cereal to you instead https://t.co/IDWP26znwR I love my older brother 💓 https://t.co/31rNfQesjP Health is the # 1 priority. Care for yourself Ethan is so extra... \n\nhttps://t.co/6gy2DboJTz\n\n#DolanTwinsNewVideo for a folllooowwwww 22 mins hahahahah yyyuussss Tuesday finally decided to show up You guys are actually the best fandom ever. The support you give not only to us but to each other is heart warming. You are my inspiration ✌️💛 https://t.co/c9NrhfESSw Thank you guys 😊♥️ You're never too old for hide and seek tbh hahahahha or are you \n\nhttps://t.co/zq1zgdY8Ml NEW VIDEO UP IN AN HOUR!! Crazy day today My mind won't let me fall asleep I can't stop overthinking everything Can't sleep... ever lol 😝😝😝😝😝 FOLLOWING PEOPLE ALL WEEKEND WHO DO https://t.co/vZnWtPdnSV I feel like I may have tweeted that before but it's true you guys literally deserve the world. You mean so much to me ♥️ I wanna do more for you guys We might have to upload tomorrow 😭 SORRY ETHAN TOLD ME TO TWEET THAT YESTERDAY ITS NOT MY FAULT NEEEEWWW VIDEEEOOOOO TOMORROOWWWWW 😝 me rn Life made me smile a lot today 😊 🐢 https://t.co/kQ8gIeq31O WE GOT A BUSY AF WEEK. IM EXCITED Goodmorning I love you guys so fffffffiijnngggg much I get so anxious so easily I hate it Thank you 😭😫 https://t.co/R3TCe3Lm4X Armpit mustard 😍 https://t.co/X845q1IHwV Hahaha we talked to some of you guys undercover \n\nhttps://t.co/xOsBA7bReq\n\n#DolanTwinsNewVideo 😝 \n\nYou might be in this vid so watch it? 15 MINS. ALSO YOU COULD POSSIBLY BE IN THIS WEEK'S VIDEO IDK THOO RT @midnightdolans: My #TeenChoice for #ChoiceMaleWebstar is @EthanDolan and @GraysonDolan https://t.co/yICr7T88gR Boy do I miss being on tour 😭 TUESDAY FINALLY THIS WEEK'S VIDEO IS UP\n\nWe did something a lil different hope you guys like it 😊\n\nhttps://t.co/P86C0UZ0PY 50 minutes 😝 Wrong emoji 😑 Pizza time 🍤 Everybody has their purpose here. NO ONE IS MORE IMPORTANT THAN ANYONE ELSE I just quacked at Ethan while he was sleeping. Problem solved Hi sorry for being inactive I've been doing yard work all day while Ethan was standing behind me watching Get outside and adventure! Go have fun and free your mind 😝 WHATS UP Gonna follow some people who vote for me and E for the TCA's 😊 life just changed for the better really fast 😊 Home https://t.co/wyJINQJEZR Try to forget about your problems and start fresh today. I really don't know why these things keep happening and why we're being tested so much We were just filming another video and Ethan got hurt again. We have to go to the hospital now. Nothing serious really i just feel bad 😫 IM WITH YOU. WAY TOO CRINGE 😭 https://t.co/W00nbiWOZg .... this is how Ethan and I got started making videos 😫 \n\nhttps://t.co/yHLTmfXyVK\n\n#DolanTwinsNewVideo 4 that follooowwww Watching today's video. Ethan and I are sweating. I've never cringe so hard in my life Bob and Rob tomorrow Why do these things ALWAYS have to happen I shouldn't have let him fly it Ethan just broke or $1000 drone... we've had it for 1 day We still don't have wifi at our house 🙄 THIS IS SO ANNOYING 😭 Really miss seeing you guys in real life 😔 GOOD MORNING! Oh shit @EthanDolan https://t.co/nJ8MiGh4eb Woke up feeling great today The vibes are on First photo cominggg.......... now Not just some pics we got a loottttttt of pics to show you guys. Dropping them tonight 🤘 I've been freeing my mind adventuring Jersey w @EthanDolan &amp; @BryantEslava for the past few days. We also got some sick pics I wanna show u😮 Wanted to let you know that I'm feeling a lot better now. Thank you all for understanding. Love you guys Needed to say this. \n\nhttps://t.co/vo6fBo4Cwh\n\n♥️ Hey guys. The video will be up in one hour Explanation tomorrow. Miss you guys ♥️ Hey guys. We're not going to be able to get a second video up this week. Very sorry. We will explain soon. Everything is okay Have faith. Everything happens for a reason But really guys thank you so much I love you I love you I love you CLICKING**** hahaha 4 MILLION ON YOUTUBE OMFG. THANK YOU ALL SO MUCH FOR LICKING SUBSCRIBE I wanted to be a YouTuber since the Bob and Rob days guys. Thank you all so much. I can't believe life is real sometimes. We're about to hit 4 mil on YouTube. Getting a little emotional No, thank you! Also thanks for not judging our really bad drawings/hand writing hahahahha https://t.co/F7HNRxrZpe This Tuesday's video is up. \n\nThank you guys for everything 😊 \n\nhttps://t.co/Cn5nS4Jkgm\n\n#DolanTwinsNewVideo for a follow 50 minutes I love getting recognized by moms Up early on this Tuesday morning. Still don't have wifi 😑 gonna go find it and get this video uploaded 🤘 Ethan \"bro our fans are so dope\" \n\nMe \"YEAH NO SH!T HUNNY\" RT @TeenChoiceFOX: Who loves these bros? RETWEET to vote @EthanDolan &amp; @GraysonDolan for #ChoiceYouTuber. #TeenChoice https://t.co/7MlCR22m… Tomorrow's video gets a lil deep Twitter gets the artsier one https://t.co/XqWdq6L9QP ITS UP\n\nhttps://t.co/HWsRFQmurx\n\nWrote some kinky fan fic about E hope you like it hahahahha 45 minutes😨 We got air conditioning so today's video is a little less sweaty than the last. Just as painfully awkward tho hahahahahah Jk I didn't almost forget I'm hype asf almost forgot. NEW VIDEO TOMORROW Your snap game is weak @EthanDolan Just when I get wifi twitter breaks 😭 Glad Twitter is broken 😑 We still don't have wifi😭 I think I just slept for 20 hours. I'm so confused I wasn't even tired last night RT @affaircliff0rd: My #TeenChoice for \n#ChoiceYouTuber is the Dolan Twins @GraysonDolan and @EthanDolan 15 😬😬♥️♥️ https://t.co/R8Vf9l1AcD Thanks so much for all of the votes I'm seeing so far 😊 following some of you 🤘 Nominated for 4 TCA's this year wtff😳 thank you guys so much 😭😭😭😭😭 nooooooo. That was a painful two days https://t.co/IZMjmTy8Zu This should explain a lot...\n\nhttps://t.co/BjMsE4GREG\n\n#DolanTwinsNewVideo for a follow/DM 🤘😝 Who's ready 45 mins 🤢😨 TUESSSDDAAAAYYYYY You need to watch tomorrow's video.. even if you hate us still watch it ETHAN AND I OFFICIALLY GRADUATED HIGH SCHOOL TODAY Ethan burped mid sentence while we were ordering at a drive thru and our order came out completely wrong Finally got my hair cut. Now the bald spot Ethan gave me is gone 😫 If I could sing, I would sing our favorite song to you baby... right in your ear That def wasn't his trick but it was a good cover up E told me 2 watch his \"new trick\" on the quad. He then went flying off landed on his back w his hand behind his head &amp; said \"thats my trick\" NEW VIDEO UP\n\nI should've cleared my search history \n\nhttps://t.co/3mQfJUIHbr\n\n#DolanTwinsNewVideo fo a follow! I screamed that 20 MINUTES E and I have been helping our fam move into our new house and we don't have wifi yet 😭 time to go on an adventure to upload this video LIKE JUST ASK AND ILL TAKE A PIC WITH YOU!! I had to tweet that hahahah that was so awkward 😫 This lady just tried to sneak take a photo of me but I don't think she realized how close her phone was to my face and how obvious it was 😭😂 6 MIL ON IG 😮😮 Now Ethan is going to grab me by the back of my hair and make me call him Mr. Ethan for my mistake 😔 I messed up I mean tomorrows video sorry sorry sorry sorry I open up and tell you guys something really personal in today's video I need to get on twitter more sorry. I haven't had my phone on me all day what a weird thing of me to do wtf Hi! Family time is very important Hey guys. E and I were able to get the 4ou merch up for the next 4 days. After this it'll be gone forever 😢 \nhttps://t.co/wzgrv3XFdx I mean... Just filmed a new video. Naked had to get one of us 😦 That burrito wasn't even my best. I've cooked better. https://t.co/9dUUaHoDko THIS WEEK'S VIDEO IS UP! \n\nE and I get closer than we've ever been\n\nhttps://t.co/fcwNhbXZmT\n\n#DolanTwinsNewVideo Happy 4th of July and Tuesday I got a new tattoo and I'm posting it on my IG in a sec sooooooo yeah... it's my fav tat btw Hey sorry for my inactive ass I've been in the middle of the ocean with e all day hahaha I wasn't crying I was laughing btw https://t.co/7KafFRlTWL This explains why I have a bald spot on the back of my head 🙄\n\nhttps://t.co/FhsPJhJSqQ Hour and a half aasfsgdjdkflhll Video in 11 hours and 35 minutes! Lol my sleep schedule is messed I love you guys more than you will ever know Everything is going to be okay. \nI promise Been feeling pretty lost lately Me -\n\"Ethan what should I tweet?\" \n\nEthan - \n\"Just don't tweet anything\" \n\nMe - *tweets* I LOVE YOU AND GOODNIGHT If I didn't follow you this time I'm sorry and there will be more follow sprees to come 😊soooo yeah I'm up! Following a few more I just don't know who Stayed up as late as I could. My eyes are shutting on me.. I will probably follow some more people when I wake up tho 😝 ARE MY INTERNATIONAL HOMIES AWAKE YET? 😊😊 Going to stay up as late as I possibly can tonight to follow some international peeps who may have been sleeping during the follow spree 😊 RETWEET FOR A FOLLOW/DM I'm readddddyyyyyy One hour FOLLOW SPREE STARTING IN 2 HOURS Yes he does https://t.co/2KlU9N8ccY THIS TUESDAYS VIDEO IS UP!\n\nIt may explain why Ethan loves being called daddy so much \n\nhttps://t.co/VFbNuJlAJ6\n\n#DolanTwinsNewVideo 24 minutes til video If I'm already following you imma DM you wether you like it or not NEW VIDEO AND FOLLOW SPREE TODAY Looks like there might be a video AND a follow spree tomorrow https://t.co/c8D44Wj76C I just did a bunch of sqauts and my ass fell off... like it's on the floor and I'm just looking at it.. I actually can't wait for this follow spree Why doesn't it feel like summer yet It was 85 degrees today so we went to the beach and now it's cloudy and 68 here... still gonna surf lol Getting close to 3 mil 😮 @EthanDolan we should both do a follow spree when we get there u down er what I just realized how weird it is that I have a best friend human being guy that looks exactly like me Ethan and I just did a freez frame high-five in real life I love when my siblings lie to me \n\nhttps://t.co/8xoJyYfUMV I wonder who the special guest is 🤔 2 HOURS SORRY IM SCREAMING IM REALLY HYPE FOR THIS ONE I still can't believe tonight actually happened Best performance ever @KidCudi .\nI'm not just saying that because I love you Seeing my idol in concert tonight I'm so excited rn uuuffffff lil special guest action in tomorrow's video tho Hahahaha hahahahha You guys asked for it! The video is coming tomorrow! Should we post the video today or tomorrow? GOOOOOOOODNIGHT😊 Time will heal everything. Sometimes even faster than you think. Ew wtf I just thought Ethan was me in this picture for a sec You're capable of a lot more than you think you are. ♥️ If you can't do what you imagine then what is imagination to you ? The truth about twins! \n...Well just me and Ethan at least \n\nhttps://t.co/t35ihmtuoA\n\n#DolanTwinsNewVideo \n😝😝 32 mins I actually can't wait to show you guys this video Today is something I forget what it is tho First nomination 😮 love you guys The only real change comes from inside I never wanna leave jersey Stop calling me dad I'm about to kill you @EthanDolan Thanks for the Father's Day wishes. Very funny. Not making me feel uncomfortable at all. HERE IT IS AND IM GETTING ETHAN BACK DONT WORRY \n\nhttps://t.co/1Im6AMZ9fy Sorry I was driving I just pulled over on the side of the road the video so going up now!!!!!! One hour Nope 😑 Can you edit twets with spelling errors with this new update? 🙄🙄 https://t.co/GiZR98yQOF HUGE FOLLOW SPREE AT 3Mil! BUT 2.9 WTF THANK YOU THANK YOU Btw that whole follower battle between me and E was a joke we're really grateful for everyone that we have supporting us honestly When you get roasted and don't have anything to comeback with  @EthanDolan https://t.co/xtef2PZ4BX I\nN\nS\nT\nA\nG\nR\nA\nM\n\n😊 https://t.co/4HBfkt8jRB I'll never understand why bad things happen to great people. Any topics we should talk about or challenges or somethin Ethan and I really wanna film something right now but we just don't know what... 🤔 IM BACK THO WHAT UP Sorry for being inactive. E and I flew home yesterday to surprise our family so we were spending time with everyone. Happy in jersey Didn't tweet and run I just can't think of anything to tweet Hihihihihi Hahahahahahah https://t.co/nNwzHe3nhI THIS TUESDAY'S VIDEO IS UP\n\nSome of YOU may be in it 😊😊\n\nhttps://t.co/ZK0Sbm7qDO\n\n#DolanTwinsNewVideo 45 minuttessss And Ethan won't massage it for me whatta douche I hurt my neck making a video 2 months ago and it still hasn't gotten better :/ I'm dependent on Ethan for entertainment. Whenever he's not around/sleeping I get soooo bored 😑 Hahahah you guys are funny. All of the tweets in seeing in my mentions are making me cry rn. In a good way lolol Lol what if we made a full song Catfish pizza peanut butter jelly. #UrGirlsFavFood @JackDail @EthanDolan on the track https://t.co/lJCOY1ZlOX WHAAAAT UPPPP I don't believe in miracles. I do believe in fate, I do believe in destiny Guys me Ethan and Jack made a rap song Someone told me Grethancarpendail was back in town\n\nhttps://t.co/To2UAGbC1U Today's video is pretty much one of my fav videos that we've ever made Just cuz I'm not tweeting doesn't mean I'm not stalkin profs hahaha. I do a good amount of that tbh I never run. I seeeeee everrryyttthhinngggggg I always get accused is tweeting and running. Meanwhile I'm back here looking at all of your tweets yelling at me for tweeting and running Not gonna lie I was down for a little while but I tried my best to stay positive and now I'm finally realizing just how important that is IM LOVING LIFE SO MUCH RN GOOD VIBES AF Isn't it weird to think that TOMORROW, AT THIS TIME, a new video will be dropping? No I did not get a tattoo on my butt cheek hahahahahaha FILMING SOOOOO MAMY VIDEOOEOWESSSSSS So much to do in so little time Mood = :))))))))))) TUESDAY'S VID IS HERE. \n\nhttps://t.co/yqasVZmprt\n\nIdk why Ethan is so pale sorry but please watch it still? Afsgsjdkrlfncntwentyhaishdvdhdminutesgahsbndifadsgsjdkfk. \n\nHidden message ^^ Yoooooooooooooo's what's up Tomorrow's video is on Just realized today was the first time we ever uploaded on a Tuesday in Australia 🇦🇺 AYYEEEEUHHHHH TODAY'S VIDEO IS UPPPPPPP \n\nhttps://t.co/EZcotD7DMD\n\nI DIYd @EthanDolan Today's video! 12 PM PST - 3 PM EST Homesick I'm in a goofass mood today Peep my snap I said something on there but only if you want \n\nSnap- GraysonDolan Health is very important. Don't take it for granted Who did we get to see and who did we not get to see? I miss you guys so much It still feels unreal to me Today is the one year anniversary of the 4OU tour. I'm emo af Wish I was somewhere hanging out with all of you right now that'd be fun Hi guys. There goes my sleep schedule 😑 Happiness is THE most important thing in life. \n\nYour happiness AND the happiness of others. \n\nSpread luv and positivity ♥️ Try your hardest to appreciate the little things in life. It can makes a big difference in your happiness. For some reason this video is really complicated to make 😩😂 hahahahah How many people are on summer break? I'm done complaining sorry We were just about to start setting up for a video 😭 The warehouse just got flooded because a pipe broke. I'm pist af Good vibes for everyone today 🤘 God makes no mistakes. Everything really does happen for a reason. Why do I ALWAYS overthink EVERYTHING at night Apple I see you messing up my phone just so I have to buy the 8 when it comes out. I'm not stoopit Omg I hate you ur gross @EthanDolan Do not f ing tweet that @EthanDolan I actually CANNOT wait to hang and make a vid with one of you guys What do you guys think about the announcement? TUESDAY'S VIDEO IS UP! \n\n#AskEthanAndGrayson 3 \n\nHUGE announcement at the end! \n\nhttps://t.co/wu55kTIFIn\n\n#DolanTwinsNewVideo Hype for tomorrow's video AND announcement I need some Jersey in my life YO WTF SUMMER IS ALMOST HERE Ahahaha JUST finished filming. Things got crazy Been filming all day. Still got a lot more questions so answer but this is fun af hahahah Always share happiness I was tying to eat healthy and then Ethan got ice cream and... so then I ate it all What upp Got all of your questions. Thank you to everyone that asked! This is gonna be an interesting #AskEthanAndGrayson Final questions!??!? Stilllllll screenshotting 😝 Looking for questions until tomorrow afternoon btw!! Already screenshotted sooooo many question hahaha. Keep them coming😬 weirder weirder! Yes! Looking through the hashtag #AskEthanAndGrayson for questions to answer in our next video! Get weird/crazy with it 😝 Here's how If you were able to catch today's video you may have noticed that we said you have a chance to be in Tuesday's video... I feel like some people are gonna love me and some people are gonna hate me \n\nhttps://t.co/lFkUK8RF8K\n\n#DolanTwinsNewVideo for a folloooooow The video will be up in about one hour New video comin at u today. It has something to do with me cutting all of Ethan's hair off. Jk that's all it has to do with 😂 Ethan isn't being a drama queen. His hair is really gone guys I can't believe we're actually about to film this WOOOOOO MY MOMS HERE Also, I can't sleep Anticlimactic. Ethan rubbed butter in his hair and successfully removed all of the sticky gum-like substance. Ethan is actually crying because he thinks he's gonna have to cut his hair. Actual tears guys hahaha Well that video is probably going into the 2017 bloopers Trying my best to make some people smile Tuesday's video is up 😊\n\nhttps://t.co/gIbUDXVGB6 AND NEW ONES I SEE YOU TOO. Love YOU GUYS so much Seeing a lot of day one fan accounts coming back to twitter. Such an uplifting feeling. I love you guys so much My heart hurts. Love to Manchester ♥️. Praying for everyone who was affected. Nervous and excited for tomorrow's video hahahaha Questioning everything lately 😔 I need to listen to my own words more Can you please tweet me the WORST AND UGLIEST photos that you can find of Ethan 😂 Needa free my mind Okay maybe I liked it a little bit I just woke up from the worst dream ever. So relieved that it isn't real tho hahahahahah I miss tour so much RT @EthanDolan: Sry 4 promo but THE 4OU WEBSITE IS CLOSING so it is your last chance to get merch😧clothes that remind me of the greatest ti… The sky might be falling but remember you can fly high Yeah life sucks at times but we're all in this shxt together! We all go through the same shxt. Let's be there for each other! Life shouldn't be taken seriously. Everyone reading this have a great day. If something doesn't go your way don't stress out. Life is long. Nothing is as bad as it seems now You guys honestly come first to me in every situation. That the truth. Sometimes I get lost I'm so good at procrastinating. I can literally find anything to keep me from doing the stuff I need to do hahaha I can never tell what looks good and what doesn't But I hate shopping I always feel like I need more clothes Follow ur dreams. Don't let anyone or anything get in the way. Also, you live once. Moondy 🌙\nhahahahaha that was a bad caption it was supposed to be like moody but the moon was in the background so I was trying to combine th https://t.co/AHMsOxyc9B Ethan can barely do anything with his rib issue. We don't know what to film... IM TIRED OF BEING ROASTED FOR WEARING A TIGHT SHIRT IN THE VIDEO😭 ETHAN GOT IT FOR ME. HE SAID THEY DIDNT HAVE MY SIZE I just popped it back in. We gotta make two vids a week now we can't waste time. We were about to film a crazy vid and I was really hype to film but now we can't because Ethan's rib popped out 😭 THIS WEEKS VIDEO IS UP\n\nhttps://t.co/h3Wbz8kh4Z\n\nWHO DO YOU THINK WON? \n\n#DolanTwinsNewVideo for dat follow READY I don't wanna wait I just wanna upload hahaha Love waking up on a Tuesday morning and seeing all of your guys beautiful selfies on my timeline 😊 Tuesday snuck up on me whoa. AYE THO TOMORROW BOUTA BE LIT Good morning ☀️ When I say I love you guys I really do mean it. Damn. This really put a smile on my face. I love you https://t.co/cZBNpcy9pE Can everyone tell their moms that I say happy Mother's Day Happy Mother's Day to all the moms. You guys are the shxt! Probably gonna be making YouTube videos when I'm 80 lol I still can't believe this \n😊😭\n\nhttps://t.co/nNPhOx5dlM\n\n@EthanDolan you are the best bro ever \n\n#DolanTwinsNewVideo Ethan did the craziest nicest thing for me the other day you guys don't understand how happy I am I just shook Ethan awake and he was slapping himself in the face that was the funniest thing I've seen in a while I fing love you guys I can't think of a caption Posting another photo from the shoot in 30 on IG 😮 I'm still forgetting to change it wtf Wait I forgot to change my profile picture Changed it! Changing my layout Something happened yesterday. I still can't believe this is real life 😮😊 You're put through tests. Bad things will happen. If you prove that you're worthy you will be rewarded. Always. Everything will get better eventually. It's takes time but it does get better. \nIt does. Don't take things too seriously or let things bring you down. There's no point. Trust me it's easier said than done. I've been pretty low b4 Who knows what the meaning of life is. Do what makes u feel good. 4 me, it's making other people laugh. Or at least trying 2 make them laugh I woke up stressed and down today and it turned out to be an amazing day. Stay positive and life will continue to get better. I can't believe this OMFG ETHAN IS THE BEST F 👑 BROTHER IN THE WORLD. I LOVE HIM SO MUCH The layout changes Friday When you're so stressed that real life bs follows you to your dreams and stresses you out while you're asleep 😌 LIVE, LEARN, FORGIVE, AND GO WITH THE FLOW His face is f'd Ethan just ate shxt on the trampoline That was an adventurous Tuesday On my way to a sick af place for a  photoshoot. Huh?!??!!?! https://t.co/STVZGEgolJ TUESDAY'S VIDEO IS UP\n\nhttps://t.co/66M0Oz369L\n\n😧😳\n\nIF YOU WANNA TWEET #DolanTwinsNewVideo ILL FOLLOW YOU CAN MAKE ETHAN FOLLOW YOU TOO 15 MINUTES I FREAKIN LOVE POSTING TWICE A WEEK OMG ITS TUESDAY BABY How come Ethan gets so many more favorites than me 😰 My sleep schedule isn't messed, my life schedule is messed. I've had the same two pairs of jeans for the past year and a half and they both ripped inbetween my legs today 😑 Just made a synchronized dance routine with ethan for fun lol. WHY DO WE DO THIS I love pancakes too much to eat healthy WHAT UP EVERYONE NEW VIDEO UP AHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH! \n\nhttps://t.co/12UWTcgV4u Today's that day You just ruined it... that was supposed to be a secret https://t.co/Mi3LFpa1s2 Glad that you all have our YouTube post notifications on now. There's a random video coming SOON! Now you'll know as soon as it comes out 😊 You're not late! I'm following and dm'ing ALL DAY! Love you too https://t.co/H7Tco8zxjd Check DM's 😎 https://t.co/8R8LMcSv4p OF COURSE I FOLLOWED AND DM'D YOU https://t.co/aVZefOPAkw :))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))) https://t.co/4nlPxAiYQy FOLLWING AND DM'ING EVERYONE WHO TWEETS US SCREENSHOTS SHOWING THAT THEY HAVE OUR YOUTUBE POST NOTIFICATIONS ON! DOING THIS ALLLLLL DAY 😝 Who's ready Well since we are posting a random mystery video once a week now... https://t.co/w31Np0D39f I'm excited because we're about to follow/DM a bunch of you 😮 Excited for tomorrow 😝 Self confidence is beauty Finally https://t.co/3L9D6m2I8m wonder when the random video is going up Met so many amazing people these past few days. Feeling very inspired Idk bout u but I feel super close to u guys. Lets keep it that way please? Youve all done so much for me. I got u if you ever need anything On the other hand hope everyone is having a good day and smiling and what not 😊 hahahah If you talk shxt on my bro don't think I'm gonna be cool with you haha? Why am I like this I still get shy when I get recognized in public I cried we just didn't film it https://t.co/nvIioXWArz IMAGINE HOW RUINED JELLY BEANS ARE FOR ME 😫😭 https://t.co/6jwMowFL9H RT @bitchingdolans: 🚨⚠📣\n#DolanTwinsNewVideo\n\nExtreme Zip Line Challenge!\nhttps://t.co/x1E7EJac2M\n\nLIKE &amp; SUBS👍\n\n@GraysonDolan @EthanDolan\nf… THIS WEEK'S VIDEO IS UP! \n\nStill don't forgive Ethan for the last part \n\nhttps://t.co/O5jLYDVAbs\n\n#DolanTwinsNewVideo 4 DAT FOLLOW WHAT THE ACTUAL F. ANOTHER 20 MINS WAS JUST ADDED 😫 THE VID JUST JUMPED DOWN TO LIKE 15 MINS LEFT WOOOOOO More like technical difficulties Tuesday The video keeps adding minutes to the upload time. Not sure why it's doing this. Never mind I guess I forgot how slow Youtube uploads 😑 it should be up on normal time The video might be going up a little earlier than usual today I almost forgot tomorrow was Tuesday wtf?! In my defense that's probably because we're posting 2 TIMES a week now 😝 Such good vibes today. I wish I could trap these vibes in a jar and keep them forever I love people from jersey. Everyone treats everyone like a HUMAN BEING here. I was sitting here editing a video and I look out the window and see THIS!? How do you even fall asleep like that @EthanDolan https://t.co/vXzpQcDLxy Every time I put on an outfit I check my Instagram to make sure that I haven't worn the same one recently so I don't get yelled at. Nah jk bouta make today fun af and u should too The only reason I woke up today was for breakfast I hate the concept of money I'm so sore from the video that we filmed yesterday 😅 I can't wait to edit this hahahha By the way the 2 videos a week starts after next Tuesday and then for the entire month of May. Just wanted to make sure no one was confused I don't think my sleep schedule has ever been this messed. I haven't had pizza in like a WHIILLE... I'ma fake fan 🙄 Gonna need pizza at some point today. Goodnight for now I'll talk to you guys tomorrow. Love each and every one of you believe me when I say that Yes there is a fine line between personal life and social media but you guys are literally my best friends, and sometimes my only friends I'm gonna start being 100% open with you guys from here on out. Not that I'm not real with u I'm just shy sometimes keep things to myself I like writing Actual thank god it's Friday Ethan the entire time I was building in the warehouse https://t.co/SV3Tp5RdSf You guys inspire me. Thank you for being so cool. I just hibernated Just finished filming. I have no words Ethan Dolan really grinds my gears sometimes About to film a crazy vid. Wish me luck 😫😭😂😂 Soooo muuuuuch toooooo doooooo my head is diizzyyyyyyy ahhhh I'm a happy boy. So happy to see everyone excited for this. I DONT THINK ANYONE IS EXCITED AS I AM THO A warehouse and two videos a week for the next month 😊 BUT THATS NOT ALL https://t.co/JWOIcg3bfe ITS HERE WE'VE BEEN WORKING ON THIS FOR SO LONG AND ITS HERE \n\nhttps://t.co/F1dHHul72V\n\nFirst of many surprises 😎#DolanTwinsNewVideo Things are about to change 😎 I'm hype af Just finished editing 😊. Time to take a nap. GOTTA BE READY FOR TOMORROW Spread the word please! If you receive a direct message saying that it is Ethan or myself and it isn't coming from either of our accounts block and report them 👍 Hey everyone so some piece of sht child predator is DMing people that are tweeting using the # #TuesdaySelfie and pretending to be me and E Nothing ever runs smoothly for me I swear I'm so pist Experiencing the worst technical difficulties in the world rn brb f this I hate being inactive BUT THATS CHANGING SOON... like tomorrow 🤔 We've been holding off on saying anything because we weren't 100% that we would be able to tell you all tomorrow... BUT NOW WE CAN SOOOOOO Goodnight everyone. Hope you had a good day. If you didn't, don't worry tomorrow is a new day and you're in control. SO MAKE IT A GREAT ONE I'm not even kidding. It wasn't on purpose either Ethan just walked up to the trash can and started peeing in it. He needs more sleep That was the best thing that I could've possibly spent that money on His eyes lit up and he got so happy cutest thing I've seen in a while I'm so happy rn hahah This little kid was giving out free lemonade so I gave him money and told him to keep the lemonade to give to other people and... Yo Earth can you spin a little slower I needa go to sleep at a decent hour I need pancakes before I break something I'm hangry ahhhhhhh Days aren't long enough Why is being cringe so trendy rn Stressed tf So now I have to go get it for the 4th day in a row bc I'm starving. My stomach is screaming at me. How come E always gets what he wants? 🤔 E &amp; I take turns getting/making breakfast everyday and today it's his turn to go get it and he's just sitting there saying \"I'm not hungry\" Okay. Goodmornight ANYWAYYYY... we're getting close 😈 Idek if that last tweet made sense lol I think I've trained myself to survive without sleeping. Yeah they used to be so cool https://t.co/7QoDeXoYz4 YOU WERE SLEEPING HOW WOULD YOU EVEN KNOW?! A German Shepard literally tongue punched my nostrils https://t.co/FAMirTgJnG I was just sitting here on twitter, lookin at my phone, and a big dog walked up to me and surprise licked my face. Is that good luck? Been working allllllll day. SOONER THAN CAN BE 😎 Why have I not been active on anything today sorry SOOOOO MUCH TOOOOOO DOOOOOO. Gotta catch up on sleep tho so I can at least move. Goodnight erryone 🤘♥️ I ate one too many chicken nuggets today I just woke up hi RT @knightdoIan: .@GraysonDolan @EthanDolan 🚨YOUR ATTENTION PLEASE🚨\n\n💥THIS WEEKS VIDEO IS UP💥\n\n🔥WATCH IT!🔥\n🙌😂\n#DOLANTWINSNEWVIDEO \n@Grayson… Ethan's a lair https://t.co/GPQm7QeWsw I'll keep u my dirty little secret @EthanDolan \n\nAlso this week's vid is up \n\nhttps://t.co/4bmdVbQZKK\n\n#DolanTwinsNewVideo fo dat follow 🤘 Thank you for your patience guys sorry this is taking so long It's saying 5 minutes 😮 We're gonna be posting a little later than usual with this vid cuz all these FREAKING TECHNICAL DIFFICULTIES  UGHAHSJDLFLHL Goodtuesday I feel like I'm always preaching positivity but that's something I need to work on myself. My tech genius sister just decoded our computer and recovered the footage. Thank god for her ugh I didn't know what to do that was bad I'm literally having the worst day ever f this Idk what to do Our computer just crashed and this week's video deleted Be a leader and stand for what's right My peels eludehcs is so backwards HI Goodnight? Hahahah wtf brb Sorry for the wait on the photo :/ No service at Coachella. Probably posting this photo a little later today. Of course by @BryantEslava 😎 Fav outfit today by far HAPPY EASTER CHELLLLLAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA 💁 https://t.co/4Qysu7g9pQ Anyone got flash tats? Ahahahah Had such a great worry free day with my bro and sis today + amazing music and vibes. Can't beat dat You probably won't be able to tell that I'm dancing tho it looks really weird Bouta dance my ass off Sorry I haven't been posting a lot lately. I'm bouta flood tf out of my pages this weekend tho lol I'm walking and my legs are moving but I can't feel them moving bc I'm so tired I actually can't tell if I'm awake or not Just finished filming 😬 \ngoodnight 🤘🌙 😊 I love birds Sorry if you guys feel like E and I have been teasing. HONESTLY IM JUST TEASING TF OUT OF MYSELF Hi sorry I've been inactive. Working on this stuff and stuff Yusssss. I glad it did that for you 😊 https://t.co/sdbKO0w7WG I can't believe I cried in this week's video 😢\n\nhttps://t.co/2W6W2zkst3\n\nTWEET #DolanTwinsNewVideo BC I WANNA FOLLOW YOU I'm so excited to show you guys this one hahahahahah ONE HOUR Like for Tuesday Tomorrow's video is def one of my favorites that we've ever made. Could actually be my fav tbh Come back I'm bored @EthanDolan \nI've been stuck at home all day And I know it sounds a lot easier than it is. Trust me I know. But if you put out positive energy, you're going to receive positive energy. Or make life the best life ever YOU decide whether or not you're gonna have a good day. Why not make today the best day ever? Idk what to tweet I'm so impatient. Soon guys sooooooon I miss jersey so much Helllllllloooioi I just wanna sit in a b tub full of strawberry p cakes all day I feel like eh today Btw sometimes I just tweet Cudi lyrics hahaha I love fan art There's someone high up in the sky lookin out for all of us Gotta visit asap I never realized how much I loved Jersey until I left Every morning I tell myself \"go to bed early tonight you don't want to suffer from this tiredness ever again\" but I never listen 😭 I need to see you guys irl more I'm gonna dye Ethan's skunk looking hair while he's sleeping. It's been too long. What color? Catching Jersey vibes in LA today.  Feels so good No time for sleep Everything is coming together nicely 😊 Anyone got a band-aid 😂 Not to be graphic af but I just saw the bone in my middle finger 😷 Ethan let me go on his shoulders like he did in my last IG pic and his weak a$$ dropped me and I cut my finger open. I needa new layout Stay true to yourself, have faith, and remember that everything happens for a reason. God is the man It's all happening Pranks are only gonna get crazier 😝 https://t.co/3Z0VK1p7jY RT @ethanismydolann: 📽New video📽\n\nGo watch it and give it a 👍🏻 and Subscribe 🔥\n\nhttps://t.co/7O8KZknoEO\n\n#DolanTwinsNewVideo @graysondolan… Of course twitter crashes right now 😑 if you see this let your friends know the video is up!! Remember when we tricked Ethan into thinking his nudes leaked? 😂 \n\nhttps://t.co/XPHEkVgBfs\n\nU can tweet #DolanTwinsNewVideo 4 a follow ofc Video goin up in an hour 🤘 I love the #TuesdaySelfie hashtag that you guys started. makes me smile seeing you guys smile How's everyone doin I don't think you realize what you've done for us. You mean the world to us. ...to get started with everything. It just makes me upset when I know that I could be doing more for all of you. E and I are really proud of what we have coming for you it's just been such a long process. We're putting our hearts into it and are excited I hate making you guys wait and I feel that's what we've been doing lately I feel so trapped So much going on in my mind at once The good kind of busy tho Holy busy Done with the pranks @EthanDolan Ugh I really miss seeing you guys Am I allowed to go to my own over party? Who tweeted/commented for the prank? I wanna follow you April fools! Jk I filmed it ☺️ WE GOT HIM😂 actually no, YOU got him! I love you guys so much I'm so happy that worked. I just wish I filmed it 😑 GUYS OKAY IM GOMNA GO WAKE HIM UP I can't even explain how f 👑 funny you guys are 😂♥️ Everyone tweet #EthanDolanLeaked I'm gonna wake him up as soon as it trends. He's gonna shi himself not even kidding 😂😭 Should we trend a hashtag about it? 💀💀😂😂 Omfggggg. I can't wait to see his face when he reads these 😭 I'll keep you guys updated. YES. YOU GUYS ARE THE BEST Is everyone commenting? He's still asleep 😂😫 If you love soft, then you've already lost. If you love hard, you should let down your guard and follow your heart. Just got a haircut Good morning 😊 🌞 Someone tell me to stop being lazy and go get a new phone My back camera still doesn't work on my phone. It works on snapchat tho for some reason? But how would I learn and grow if everything was perfect? Right? Nothing ever goes smoothly in my life I lost it 😫😭 https://t.co/W0arJ3geiV WHATS GOOD I shaved earlier today and just realized that I forgot to shave my mustache... I've been walking around with just a mustache all day Wait what? https://t.co/Mr7RPqTNh2 THIS WEEK'S VID IS UP\n\nI'm sweating just thinking about it\n\nhttps://t.co/RJvBIDbvTh\n\nstopped sweating. Ready to follow #DolanTwinsNewVideo VID GOING UP IN 34 MINUTES HAHAHAH Someone stole my mini bike out of my storage cage in the parking garage 🤔 It's Tuesday. Finally 😊 BUT, it's all happening soon so I guess all that I can do at the moment is be excited I want to do more for you You own your thoughts. Don't let them own you. My tweets have been hecka lame lately. Needa make a comeback Couldn't finish my breakfast burrito so I'm walking around asking if anyone wants it. No takers yet We have a few days to move but this is stoooooppiitttt Ethan and I just got kicked out of our place... we actually didn't do anything 😑 people are so lame Good morning I love dogs so much why do I have to be allergic to them Now I'm about to have a allergy attack 😫😂 Ethan and I were having a good old football catch and a little dog came up and took our ball. When I got it back it had slobber all over it Just always stay true to yourself People change I've been staring at my phone for the past 10 mins trying to think of something interesting to tweet. I didn't think of anything obviously Someone who is determined to be the best person they can be is super attractive Trying to eat healthy so I got a fruit smoothie but I think the guy put ice cream in it because this is too good hahahaha oh well Forever 💉 💘 https://t.co/u8Q44bDpeP Hahahahaha Ethan's face wtf https://t.co/Sgv8fvj81o Ethan is permanently with me forever now... \n\nhttps://t.co/JKafa0kR5p\n\nif ya want you can tweet #DolanTwinsNewVideo for a follow 30 minutes COMING TOMORROW Crazy video lol I hate mainstream stuff I feel like I've been so inactive today 😑 F 👑 love you all so much On the real if you still have a problem with someone being them self you should probably go back to the 1500's. Let people be happy Hahahah omfg. I can't tell you what we said but we ROASTED TF OUT OF THEM😂 https://t.co/k77yR61A7d What's up everyone I HATE WAITING. BUT I NEED TO BE PATIENT CUZ SOMETHIN IS COMING Happy St. Patrick's Day 🍀😊 The joke wasn't worth it I'm freaking stupid I just hit my head on Ethan's car as a joke and I have a huge bump Forgot to say. I woke up and my earring was poking into my face. So yeah.... found that E and I were rolling around like some tiger cubs earlier today and I just now realized that my DANGLY EARRING IS MISSING 😫 Hahaha I can't believe we survived... or did we? https://t.co/BTkN9E4hHw This was the weirdest thing I've ever done in my life \n\nhttps://t.co/X0gvSS1e05\n\nYou can tweet #DolanTwinsNewVideo 4 dat follow if u wanna Hype to upload this 🤘😝\n\nThis is also one of our longest vids ever I never sleep In the best mood ever right now 😊 https://t.co/E9FtOBTr4r EXTRA HOUR OF DAYLIGHT STARTS NOW Jet lag af Oh yeah we just went on a little pancake date... and by we I mean grethan RT @EthanDolan: We need this @GraysonDolan https://t.co/wOIfXd5Ddu Just tried making pancakes and my stove is broken? WTF ARE YOU KIDDING ME Jungle &gt; city Also posting a new IG pic and liking some comments 😬 Miss you too E Does anyone else with an iPhone 7 have a really glitchy camera? I never even dropped my phone the back camera just doesn't work😑 My sunburn turned into a tan. Yeah yuh I'm no longer a pasty boy The beach does this to my hair https://t.co/AUj37mX6sp Honestly the best pizza I've ever had not even kidding Just had Hawaiian pizza in Hawaii. 🍕 🍍 Wtf I haven't listened to music for the past two days because I've just been adventuring. I'm starting go to insane tho I'm really falling in love with Hawaii. Luv ya ♥️♥️ https://t.co/O26COJLvjL THIS WEEK'S VIDEO IS UP!! \n\nGet ready to cringe 😫😂\n\nhttps://t.co/QP1nUriANJ\n\nTweet #DolanTwinsNewVideo for a follow!! Mornings in Hawaii 🌞 🌸 https://t.co/ivL3ILlROu WHATEVER. VIDEO GOING UP IN 30 MINS IM HYPE I'm annoyed 😑 Idk why the photos weren't showing up for some people. I was just trying to be artsy 😓 It's still not Tuesday where I'm at... 😮 Hawaii is freaking beautiful I was trying to open a coconut by hitting it with a stick and a lizard jumped off of the sick and landed on my hand. Scared tf out of me😭😂 Needed to escape 🌋🌴 I've been laughing so hard all day today hahahahahha I hate when I wake up before Ethan. Life is so boring without him. I've had pancakes for breakfast for like a week straight Gooood morning I can't help it, she's too perfect Really miss seeing you guys right about now 😌 This has been one stressful day 😑 So much going on at once Heelloooooo OMFGG HAHAHA WIKIPEDIA CHANGED OUT RELATIONSHIP STATUS TO MARRIED TO EACHOTHET HAHAHGAGAHAH @EthanDolan https://t.co/c8C1IUnaac I think I need reading glasses I just looked at the food emojis and got hungry... Press like to fast forward to summer"}