{"tweets": "Happy Thanksgiving!! Grateful people are highly attractive! Some folks do all the work, then quit....just before they win. You got this...don't quit. The gift of a PLAN is just $10 away. - https://t.co/0OrGDiYmIq https://t.co/HoAq8RKruQ Tune in to @GMA in today's 8AM hour to catch Ramsey Personality, @AnthonyONeal sharing how to avoid student loans and go to college DEBT-FREE. There is tremendous satisfaction in working your tail off to hit a goal, then winning. It is worth the work. RT @AnthonyONeal: Excited to be dropping truth about student loans on @GMA tomorrow morning! Catch me around 8 AM.\n\nGod is BETTER than good… We've got some HUGE #BlackFridayDeals this week on everything in our online store. Check 'em out: https://t.co/8PNrL9DGOo https://t.co/vsIjrlx3ug Think about Who you want to be, What you want to be doing ten years from now. Then go make that happen. You are in charge of YOU You do NOT have to go into debt to get a college education. Thanks to the @washingtonpost for featuring @AnthonyONeal's solid #DebtFreeDegree advice.\n\nhttps://t.co/PLaFtK6Qoq Don't miss your chance to get Financial Peace University for only $99 plus a FREE book. This deal only lasts until TOMORROW! - https://t.co/FMaxxgKKyM https://t.co/CQwPyO3bkK Don't miss your chance to get in on our HUGE $10 Book Sale - going on now! - https://t.co/qTpgEoeuaX https://t.co/eesl9W2X9f RIGHT NOW, you can get Financial Peace University for only $99! PLUS, you'll get a FREE book of your choice. Don't miss this!! 👉 https://t.co/jjMyzzfQpv https://t.co/1pbncBw4KJ EVERYONE needs a will. \nFind out more about why. 👇 https://t.co/y342mKKg5i Don’t be a spectator of your life. Go all in. Boom https://t.co/kIyff5Unec We are on our way Charleston! Sold OUT with almost 3000 folks. Gonna be a great night https://t.co/JicwAJfG8a Honored to have you Ambassador. Amazing guest. https://t.co/cE0jQbIWfN Honored to have Ambassador @NikkiHaley join me on @RamseyShow today. https://t.co/vIFEwcHAJQ Tune in! https://t.co/BykZDjTL8T We've got some AWESOME new products in the online store this year. They'll help you reach your goals, find a career you love, go to college debt-free, and even find contentment. \n\nCheck ‘em out! - https://t.co/CbJYVQLn5k https://t.co/IUIR1qcfhv Generosity is the cornerstone of those who build wealth and are healthy. ALWAYS be a giver to win at life and money. WOW. #Sacramento – Great day at Smart Conference. Thanks for coming out! #SmartConf https://t.co/dT8XIdnOqN \"Your dream school is the school you can AFFORD.\" - @anthonyoneal #DebtFreeDegree #SmartConf Teen and Millennial expert @anthonyoneal is taking the stage from our #SmartConf. #DebtFreeDegree\n\nCatch it LIVE here: https://t.co/XykEGexIw3 \"The best way to keep kids out of trouble is to be connected with their parents.\" - @megmeekerMD #SmartConf \"The most powerful words in our life arsenal are YES and NO.\" - @PatsyClairmont #SmartConf SOLD OUT Smart Conference today in #Sacramento – Check out this lineup. So fun. #SmartConf https://t.co/BLLiGuKMGg Thanks for coming! #SmartConf https://t.co/Gf2MS7LFtz \"Talk is cheap. What is actually required is action - faithful, bold, loving action.\" - @JOLearyinspires #SmartConf Thanks for coming! #SmartConf https://t.co/xv6Frce3l9 \"The right people + the right places = opportunity\" - @kencoleman #ProximityPrinciple #SmartConf Career expert @kencoleman is taking the stage from #SmartConf. #ProximityPrinciple\n\nCatch it LIVE here: https://t.co/RtFGCICitR \"The American Dream is ALIVE and WELL.\" - @chrishogan360 #SmartConf #EverydayMillionaires \"Every conflict we have is a result of one of these two perceptions: Perceived threat and perceived neglect.\" - Dr. @LesParrott #SmartConf RT @DaveRamseyLIVE: #SmartConf host @georgekamel is ready to kick things off here in #Sacramento 🎉 https://t.co/n2MyNWZb3L RT @DaveRamseyLIVE: We ❤️ our #smartconf volunteers! Ready to start the day in #Sacramento 🎉 https://t.co/aFtkC2YBtF Good morning, #Sacramento - Looking forward to an AWESOME day at Smart Conference. #SmartConf Gearing up for our Smart Conference in #Sacramento tomorrow.\n\nSO pumped about this event. It’s SOLD OUT with over 10,000 people joining us tomorrow. Let’s do this! #SmartConf https://t.co/raT1LEHfjS \"You can't go back and make a new start, but you can start right now and make a brand-new beginning.\" — James Sherman We’re blessed to be a blessing, to bring light to a dark world.  https://t.co/zYMGxxtUOv Don't pay for insurance you don't need! Take my team's FREE 5-Minute Coverage Checkup to find out where you could save. - https://t.co/bBW1KWXTX8 https://t.co/8KR1M2EdTY Buying or selling a home is not a DIY project. Get a PRO on your side that you can trust to get you the best deal possible. https://t.co/ajKg6aSCpP You don’t win because of the government. You win because of YOU. It's easier to see the light at the end of the tunnel when you've got a PLAN. \n\nCheck out the Baby Steps Bundle. It's got everything you need to stay on track and stay motivated to reach your money goals. - https://t.co/YPW5ZYwfyn https://t.co/mSiGaPbki8 Thanks to all who have served. We have freedom because of you. Happy Veterans Day For the first time EVER, @ChrisHogan360's #EverydayMillionaires book is in our $10 Sale! \n\nDon't miss your chance to get this life-changing content for just 10 bucks. - https://t.co/w0Rp0uJpdC https://t.co/6JXgRK2ljC Well last week is over and your life isn't fixed and your life isn't ruined. Turns out it is up to you to win! Back to work, hustle &amp; grind The Bible does NOT say \"Money is the root of all evil\" It says \"The LOVE of money is...\" We are called to manage money for God, not worship it. Give the gift of a PLAN this year. \nThe Total Money Makeover is only $10 right now in our online store! - https://t.co/j2bH0oS75h https://t.co/KL5itRcGfP 79% of millionaires inherited $0. Giving is the most fun you can have with money. This year, we're having a LOT of fun. \nCheck out the Ramsey Christmas Giveaway! https://t.co/EnytIcl5dI MYTH: You need to buy life insurance for your kids. \nTRUTH: Kids don't need life insurance. \n\nA simple rider on YOUR term life policy will take care of what you need. Get more life insurance info for parents here: https://t.co/X12QtoHlg9 Right now, you can grab some of our most popular books for just 10 BUCKS. \nCheck out the sale: https://t.co/ZTspFL0iEc https://t.co/osUpN70N4z Don't miss your chance to enter the Ramsey Christmas Giveaway! \nWe're giving away $500 each week in December + a $5,000 grand prize! https://t.co/upW7Phg9WG It's important to understand the TRUTH about the student loan industry. The latest episode of the #BorrowedFuture podcast is out today. Don't miss it! \n\nApple: https://t.co/MrTJLLGeSr\nSpotify: https://t.co/H0BzNp3e78\nGoogle: https://t.co/xSxMvVxo1H \n\n#DebtFreeDegree https://t.co/ljzaLVEqhJ Work is doing it. Discipline is doing it every day. Diligence is doing it well every day. We're giving like no one else this year! Enter the Ramsey Christmas Giveaway for your chance to win some CA$H this Christmas. https://t.co/NDQz4ys8sn @lizzienicoleeee Love it. Send a message to my team - socialmedia@daveramsey.com and they’ll be in touch. Ha! Now that’s a scary costume. https://t.co/tHj7XCRzKK Halloween: Ramsey Solutions Style @ Ramsey Solutions https://t.co/0LLb8BW1Sj Tuition prices keep rising and student loan debt is at an all-time high. Give YOUR kids the gift of a PLAN. \n\nGrab a copy of @AnthonyONeal's Number 1 Best Seller, #DebtFreeDegree - https://t.co/dvKDgXVhBU https://t.co/ZsVPLgJqpW RT @EntreLeadership: On the latest episode of the #EntreLeadership podcast, @RamseySolutions CFO Mark Floyd explains the most important num… @lizzienicoleeee Ha! YOU GOT IT. Added @AnthonyONeal's #DebtFreeDegree book to our timeline wall this morning. It’s officially a Number 1 Bestseller!\n\nSO proud of him and the entire team that worked on this project. Spreading HOPE. https://t.co/LVfk6N7Ycv The #BorrowedFuture podcast is taking on the predatory student loan industry and shining HOPE on some tough situations. If you haven't listened yet, start now. \n\nA new episode drops TODAY: https://t.co/aeyOBGiRuc https://t.co/QY6cHdqlRc Rise and Grind. You are the variable that has the most impact on your future and you are in control of THAT variable. RT @ChristyBWright: Both faith and fear require you to believe in something that hasn’t happened yet. Why not choose FAITH? \n\n#BusinessBout… Some insurance can be a rip off. Find out exactly what YOU need and what you can leave behind and save money on. \n\nTake our FREE Coverage Checkup: https://t.co/XC1tD08cG6 Love it. Going to be a fun weekend. https://t.co/sDMytTt7Rd Your goals have to be your own, not your parents'/spouse's plan. If they aren't, you won't stick to them when things get tough. Good to see you cuz. Proud of you as well sir. https://t.co/0N4ilnO7FJ This week is National Save For Retirement Week. If you're debt-free with an emergency fund of 3-6 months of expenses, it's time to invest for your FUTURE. \n\nGet in touch with a trusted SmartVestor Pro: https://t.co/noVzxRKkA0 \"Overnight success\" is a myth. My favorite book on building a winning business: The Tortoise and the Hare. The tortoise wins every time. There's just a few days left to enter the #DebtFreeDegree Scholarship Giveaway! \n\nDon't miss the chance to share this with a high school student in your life: https://t.co/Ni7yTa9U5D https://t.co/JjagCqkfbJ A 20-year, $500K term life insurance policy on a healthy, 34-year old man costs about $21 per month. The same $500K coverage from a whole life policy costs over $180 per month. This is simple... get TERM life insurance. https://t.co/a8k8z5hAkB Whether you're buying or selling a home, you deserve an agent that treats you like their MOST important client. Get in touch with one of my team’s trusted Pros today. https://t.co/Kdg14aJpBQ The only variable you can control is YOU. What are YOU doing to change your life? Go for it! The federal student loan program is a HUGE failure. Listen to the #BorrowedFuture podcast to learn the truth about what's going on and how to quit the cycle in your life. \n\nA new episode releases TODAY: https://t.co/7SRwnQ7QJH \n\n#DebtFreeDegree https://t.co/O6cKXWLus6 Papa Dave is proud! https://t.co/DC1FkpSLgC If you're in the #Houston, TX area, don't miss @AnthonyONeal's #DebtFreeDegree book signing TONIGHT at 6PM at @booksamillion in Katy! Someone will win $500 CASH. Don't miss it! If you want uncommon results, you have to engage in uncommon habits, beliefs, and actions. YEP. https://t.co/I4cNQZWuZ1 RT @AnthonyONeal: The caliber of your future will be determined by the choices you make today. AWESOME. 👏 https://t.co/kILTMx9i82 Don't let a car wreck your budget. Check out the all-new Ramsey Car Guide. It's FREE, and will help you navigate everything from renting, buying, and even repairing a car: https://t.co/BycTyJOQmI https://t.co/XlUjwidJle Honor to have you with us! https://t.co/cxJQVLau1q #ColoradoSprings - @AnthonyONeal will be signing copies of #DebtFreeDegree TONIGHT at the Barnes &amp; Noble on Citadel Drive. \n\nSomeone will win $500 CASH. The fun starts at 6PM! Personal finance is 80% behavior and 20% head knowledge. \nTurns out my financial problems were a heart problem, not a math problem. RT @AnthonyONeal: I’m excited to be on @HomeandFamilyTV with @iamdebbiehines and @CameronMathison to talk about #DebtFreeDegree 🙌🏾\n\nThe sho… Don't believe the LIE that a college degree requires a student loan. \n\nGrab a copy of @AnthonyONeal's new book to get a plan for a #DebtFreeDegree: https://t.co/Rcx1Glr8Y2 https://t.co/vGEkwu4Aaf There's enough to worry about, so let’s take insurance off the list. \nMy team created a quick checkup to tell you exactly what coverage you need for YOUR situation: https://t.co/ku6fmPD3QX https://t.co/ji6gsXgifn We've got $10,000 worth of scholarships up for grabs! \nCheck out the #DebtFreeDegree Scholarship Giveaway: https://t.co/t29fIiL3CU https://t.co/XTS2OAp04a Very cool. https://t.co/os7clyhQnC Success doesn't require a college degree. There are plenty of great careers that don't depend on a diploma. \n\nCheck out this week's episode of the #BorrowedFuture podcast to learn more. \n\nhttps://t.co/MrTJLLGeSr\nhttps://t.co/H0BzNp3e78\nhttps://t.co/xSxMvVxo1H\n\n#DebtFreeDegree https://t.co/vCA8Y78As2 Even if you are on the right track, you will get run over if you just sit there. - Will Rogers RT @AnthonyONeal: Week 2 of the #DebtFreeDegree book tour starts TOMORROW 🔥🔥🔥\n\nI’ll be on the Tom Joyner Morning Show @TJMShow in the morni… The average college graduate walks away with $35,000 worth of student loan debt. This has got to END. \n\nTo find out how to change that statistic for the next generation, order your copy of @AnthonyONeal's #DebtFreeDegree. \n\nAvailable NOW: https://t.co/6TTDINaM9H https://t.co/cbqPjXIiko LOVE IT. 👏 https://t.co/3PN17iZ3Od RT @AnthonyONeal: Starting my day off in #Phoenix at @azfamily! I'll be sharing more about how you CAN get a #DebtFreeDegree. If you're in… You know what a new car is after you've had it for a year? \nA used car. RT @twinmama85: Please listen to this podcast from @DaveRamsey and @AnthonyONeal  called Borrowed Future if you have kids or about to atten… Awesome https://t.co/hMdmjg7ls7 RT @AnthonyONeal: Even in the middle of the #studentloancrisis, there is HOPE.\n\nListen and subscribe to the #BorrowedFuture podcast to hear… Live on less than you make and don't owe people money. #SweetTalk https://t.co/SlgrpjexkL @Cinnabon My wife, Sharon - she's the Coupon Queen. #SweetTalk @Cinnabon Definitely some @Cinnabon \n\n#SweetTalk @Cinnabon A lawnmower so I could start making some money. 💪 #SweetTalk @Cinnabon Hello from Nashville! A college degree without debt IS possible. @anthonyoneal wrote an entire book on how to do it. #DebtFreeDegree \n\nOrder your copy: https://t.co/OEfkK7OrzX https://t.co/9oLubkvvXd If rich people knew the lottery worked, they'd HIRE people to stand in line and buy their tickets. You're more likely to get struck by lightning 3 times on your way to the store than to win. #Chicago - @anthonyoneal will be signing copies of #DebtFreeDegree TONIGHT at Barnes &amp; Noble, Old Orchard at 6PM. Be there and get a chance to win $500 CASH! RT @AnthonyONeal: #DebtFreeDegree https://t.co/wDEtd9SNSt RT @AnthonyONeal: 70% of college graduates have student loan debt.\n\nThis is not okay! \n\nLet's change that statistic by teaching our kids th… This is the book EVERY parent needs. @anthonyoneal doesn't just tell you what to do. He tells you why, how, and when. #DebtFreeDegree \n\nGet the plan: https://t.co/zDhwF3eXWo https://t.co/RhaXOr47QY I'll be catching up with @AnthonyONeal LIVE from the #DebtFreeDegree book tour on @RamseyShow around 3:15PM ET. Stream today's show: https://t.co/dmU447hkuR Pumped to see @AnthonyONeal on @YahooFinance YiFi PM this afternoon talking about #DebtFreeDegree! Watch LIVE around 1:45PM ET https://t.co/5iRksshaNc RT @AnthonyONeal: Is your college degree worth the #debt???\n\n@ThisIsSethsBlog, @RachelCruze, @DaveRamsey, @KenColeman, @megmeekermd, and I… Parents: Don't encourage your kids to take out student loans. Help them make plans to go to a school where CASH can be paid for college. WOW. After 1 week, the #BorrowedFuture podcast is HUGE! The truth about the predatory student loan industry is OUT. \n\nEpisode 2 drops today. \n\nApple: https://t.co/MrTJLLGeSr\nSpotify: https://t.co/H0BzNp3e78\nGoogle Play: https://t.co/xSxMvVxo1H\n\n#DebtFreeDegree https://t.co/TPHRLjgYjq Today's the BIG day! So proud of @anthonyoneal and this message of HOPE and a PLAN. #DebtFreeDegree \n\nGrab your copy TODAY: https://t.co/tRriC7DHys https://t.co/4i2YN2E7tS Catch @AnthonyONeal on @foxandfriends this morning around 6:20AM ET. He's launching his brand-new book, #DebtFreeDegree TODAY. This is a game changer. Don't miss it! BIG day tomorrow. @AnthonyONeal is kicking off his #DebtFreeDegree book tour with a stop by @foxandfriends around 6:20AM ET - TUNE IN! WooHoo! Tomorrow's the big day. #DebtFreeDegree! https://t.co/av9xJDtiKx The total student loan debt in America is over 1.6 TRILLION dollars. This impacts over 44 MILLION people. It's time to STOP the madness. @AnthonyONeal's NEW book, #DebtFreeDegree has the answers. \n\nPreorder ends tomorrow: https://t.co/GMXrutM9EM https://t.co/O6lra7SsYH Work hard, play hard! Some more photos from our EPIC 10th Annual Ramsey Battle of the Bands last night. So fun. Congrats to the Reams Fleming Ramblers for taking home the win this year. Great job bands, great job… https://t.co/ZiyCLS9Ygo SO fun. https://t.co/WQJdsLAEnq Work hard, play hard. 2019 @RamseySolutions Battle of the Bands - fun night with 1,000 team members + friends and family! #ramseybotb https://t.co/nWSRqDw2IY This is AWESOME. Check it out! 👇 https://t.co/Hi2Q4nxeuk RT @ChrisHogan360: Keeping up with the Joneses is a competition you’ll never win. Don’t give in. ACT YOUR WAGE. RT @AnthonyONeal: The number in your bank account matters more than the number on your credit report 🔥🔥🔥 Smart people don't just win with money, they protect it too. Make sure you're covered where you need to be. \n\nTake our FREE 5-Minute Coverage Checkup: https://t.co/7XPrzV3jFw https://t.co/1qnxWz5NwY We’re giving away $10,000 in college scholarships! \n\nCheck out the #DebtFreeDegree Scholarship Giveaway, and let a high school student in your life know about it: https://t.co/WvMylc7hlN https://t.co/ZOQJgMcbjO It's time for you to understand the TRUTH about the student loan industry. \nCheck out the Ramsey Team's newest podcast, #BorrowedFuture. \n\nApple: https://t.co/MrTJLLGeSr \nSpotify: https://t.co/H0BzNp3e78 \nGoogle: https://t.co/xSxMvVxo1H \n\n#DebtFreeDegree https://t.co/676HTM0QWP Love it. A #DebtFreeDegree IS possible. https://t.co/o7LXYSF2kL Money problems are never the problem. They're always the symptom of something else that's going on. RT @EntreLeadership: Psychologist and leadership expert @DrHenryCloud explains what he calls the five buckets of leadership—and why each is… We’re giving away $10,000 in college scholarships! Check out the #DebtFreeDegree Scholarship Giveaway, and let a high school student in your life know about it.  https://t.co/VYHXeXphAE This is the book America NEEDS. #DebtFreeDegree \nPreorder your copy today and get over $40 worth of FREE bonus items: https://t.co/vePp1Gwn5N WHERE you go to school does NOT cause you to be successful. When was the last time you asked your doctor where they went to college? It’s the knowledge they have that matters, not the price they paid to get the degree.\n\n#debtfreedegree https://t.co/kffeSLCq6g STUDENTS &amp; PARENTS: Check this out.👇 https://t.co/p9qxz9zoNQ AWESOME.\n\nStart Listening: https://t.co/STdmqeWhdb \n\n#DebtFreeDegree #BorrowedFuture https://t.co/0NZV1nuIgj Don't believe the lie that a college education requires debt. It DOESN'T. Tune in to @foxandfriends this morning around 7:20AM ET - @AnthonyONeal and I will be sharing the truth about student loans. Catch @AnthonyONeal and I early tomorrow morning on @foxandfriends around 7:20AM ET! We’ll be talking student loans and the solutions we have to keep them OUT of your life. RT @AnthonyONeal: Studies show, if you're working 10-19 hours per week, you actually come out of school with a better GPA than those who do… RT @AnthonyONeal: Your child spends six hours a day on social media. They can spend a few hours looking up scholarships. #DebtFreeDegree RT @AnthonyONeal: \"We all have dreams, and sometimes what you don't get ends up being the biggest blessing in your entire life.\" - John Del… A college education without debt IS possible. LIVE from Ramsey Solutions Headquarters, The Debt-Free Degree Town Hall starts NOW! https://t.co/leApjoQEYV We're just a few minutes away from the start of the #DebtFreeDegree Town Hall Livestream! Starts at 7:30 ET / 6:30 CT - Don't miss it! \n\nhttps://t.co/leApjoQEYV RT @AnthonyONeal: We're just 3 HOURS AWAY from the #DebtFreeDegree Town Hall! @daveramsey and I are hosting this event to break down the my… Our Nation's future matters TOO MUCH to stay in the dark any longer. This  #StudentLoanCrisis has got to END. \n\nSTART LISTENING: https://t.co/XMkoec2Wod  \n\n#InternationalPodcastDay #BorrowedFuture #DebtFreeDegree https://t.co/0RPml9zFcJ It's time to fix the student loan MESS, and we've got the solution. \n\nWe're just a few hours away from the #DebtFreeDegree Town Hall with myself and @AnthonyONeal. \n\nTune in LIVE starting at 7:30 ET / 6:30 CT https://t.co/leApjoQEYV THIS is a game changer. \n\nCheck it out to hear the TRUTH about the #studentloancrisis. New episodes coming every week. \n\n#InternationalPodcastDay https://t.co/2InMrd3U5a RT @AnthonyONeal: The #DebtFreeDegree Town Hall is TONIGHT! Tune in on my YouTube page at 6:30 PM CT to be a part of the event! 👇🏾👇🏾👇🏾\nhttp… TONIGHT - Join @AnthonyONeal and I for the #DebtFreeDegree TOWN HALL livestream event!\n\nWe're tackling the student loan crisis head on. Don't miss it! \n\n7:30 ET / 6:30 CT https://t.co/leApjoQEYV Thanks so much for coming. https://t.co/WQ2JmucU40 Thanks so much for coming. Orlando you were a great audience yesterday. On Fire. We had a blast serving you. https://t.co/cUJDTVw3mp The student loan crisis has got to STOP. @AnthonyONeal and I are doing a LIVE #DebtFreeDegree Town Hall this coming Monday night. DON'T MISS IT: https://t.co/leApjoQEYV https://t.co/KLthtP5PmT Over the last 25 years, MILLIONS of people have changed their futures with the help of Financial Peace University. Now it's your turn. \n\nGet started today: https://t.co/XKfu5OtHLB Don’t miss this! https://t.co/UJns3f1BOh RT @AnthonyONeal: Who's ready to change the way we think about paying for college?? \n\nIf you're near one of these cities, come hang out! Al… If you stay out of debt and invest what would have been a car payment, you will be a multi-millionaire. Debt is DUMB. My team is on the hunt for AWESOME tax pros to be a part of our Endorsed Local Provider program. If you're the best of the best with the heart of a teacher to help people WIN with money, find out how to get involved: https://t.co/ee7biubZx3 RT @AnthonyONeal: .@DaveRamsey and I are taking YOUR questions at the #DebtFreeDegree Town Hall on September 30.\n\nWhat do you want to ask u… The student loan crisis is OUT OF CONTROL. It's time to make a change. Mark your calendars for this coming Monday night at 7:30PM ET / 6:30PM CT for a #DebtFreeDegree Town Hall with myself and @AnthonyONeal. https://t.co/p22xbw4sI8 Lack of direction, not lack of time, is the problem. We all have twenty-four hour days. — Zig Ziglar When it comes to mortgages, I recommend a 15-year, fixed-rate with a payment that's no more than 25% of your monthly take-home pay. \n\nTake the guesswork out of things with our FREE mortgage calculator: https://t.co/FXpBkWXaLo https://t.co/KFa5A1FAdi Maybe before we forgive student loan debt, we should STOP allowing student loan debt... ONE WEEK from today, I'll be teaming up with @AnthonyONeal for a special livestream event. We'll be tackling the student loan crisis head on. Don't miss it! #DebtFreeDegree \nhttps://t.co/p22xbw4sI8 Maroon Bells. Aspen. Sunday sunrise. God reminding me of His majesty. 3 mile hike to Crater lake. Wow. Church. https://t.co/xBQEBxEbQg WOW. Great visual from @AnthonyONeal. A great education does NOT have to cost you your financial future. https://t.co/msTAuBj4LI A college degree does NOT ensure wealth. Don't go into debt for one. #DebtFreeDegree Don't let just anyone sell you a house. I'm sure they're nice, but you deserve an experienced professional to help when making such a large purchase. Get in touch with the best of the best: https://t.co/069nhGmnBE RT @AnthonyONeal: 99% of student loan forgiveness requests are DENIED.\n\nDon't rely on the government to get you out of debt. Couples who dream together WIN together. \n\nExcited to announce a special in-person and livestream Money &amp; Marriage event this coming Valentine's Day with @RachelCruze &amp; Dr. @LesParrott. \n\nReserve your spot or livestream ticket today: https://t.co/cDnJs6RGXZ https://t.co/G1Oy01tL18 RT @KenColeman: Excited to be on @KTLA Morning News tomorrow at 10:35 a.m. PT! If you're in the #LosAngeles area, tune in to hear my #caree… The federally insured student loan program is stupid, and it needs to STOP NOW. We the people need to quit letting Congress insure loans in our name that put young people so deeply into debt that they can't breathe. I'm not against education, I'm against stupidity. RT @AnthonyONeal: 1. Save $1,000\n2. Pay off ALL debt\n3. Save 3-6 months of expenses for a fully-funded emergency fund\n4. INVEST 15% OF YOUR… RT @EntreLeadership: Tune in as @KatColeATL,  @FOCUSBRANDS COO and President, North America, breaks down the four qualities every leader mu… Good morning #Texas! If you're in the #Austin area, I'll be at @txcelebration for services today.  Come out. Church is FREE. On my way to #Austin, Texas this weekend to see my friend @joechampion and speak at @txcelebration. If you're in the area, come join us. Church is free! You will either manage money or the lack of it will always manage you. Get on a plan that WORKS with Financial Peace University: https://t.co/VNui1jyXda This is the day that the Lord has made. I will be glad and rejoice in it. Everyday is a blank white board waiting on our best. https://t.co/60FNcymO0Q Few things make people broke as quickly as trying to appear rich...when they aren't. Act Your Wage. Are YOU an investing Pro with the heart of a teacher to help people win with money? We're looking to add to our national team of SmartVestor Pros. Get in touch: https://t.co/5HdJsOmJke The bad news is your success is up to you. The GREAT news is your success is up to you. So go WIN. SO pumped to be in #KansasCity at Westside Family Church today. Join us! Church is free. #MarginKC @WFCnews Headed to #KansasCity to speak at Westside Family Church this Sunday! If you're in the area, come visit. Church is FREE. @WFCnews #MarginKC THIS is why we work. Got to meet Amelia &amp; Todd from Kentucky today. It’s their 10th anniversary. They have 4 kids, including one with special needs, &amp; they just became DEBT-FREE! They didn’t plan their visit this way, but it was only right to do an official debt-free scream. https://t.co/P1Myvtmes7 2 ribbons cut today, and it’s official! So proud of the entire team and everyone who’s been a part of this project. This place exists for the people who aren’t here. To give hope to people who need it. These are GOOD times. https://t.co/5E6Xm5dCus Second Grand Opening Celebration of the day! Our whole team, their families, and some more honored guests. So fun. https://t.co/T6oItNGSU5 Awesome day. Honored to have you join us. https://t.co/rTvtWVZyT3 RT @CommishTNECD: Great to see @DaveRamsey's company celebrate the grand opening of its new headquarters in Franklin. \n\n@RamseySolutions pl… BIG DAY at @RamseySolutions. It’s the grand opening celebration + ribbon cutting of our brand-new #RamseyHQ. Huge thanks to @GovBillLee for joining us. This building is a living, breathing testimony that God restores lives. Excited to continue spreading hope. Let’s go! https://t.co/ExOpyBjQKh Thanks for joining us! https://t.co/0EX1hhfAXE My Grandmother used to say, \"There is a great place to go if you are broke, TO WORK!!” RT @RamseySolutions: What a beautiful day for a ribbon cutting at #RamseyHQ! https://t.co/n5d8m9tgqU Gearing up with the whole team for our #RamseyHQ Grand Opening Celebration and ribbon cutting today! https://t.co/dFEVxDsxVJ The average college graduate walks away with $35K in student loan debt. That's ridiculous. \n\nPreorder your copy of @AnthonyONeal's latest book to show you how to send your kid to college without making debt a part of the plan. https://t.co/z7t3L0fRL0 Success is not one big splash. You win with excellence in the ordinary. Do the right thing, the right way, every day. Real Estate Tip: SLOW DOWN. \n\nMake sure the home you buy will be a blessing, not a curse. \n\nGet in touch with a real estate agent that I trust to show you how to buy a home the right way. https://t.co/AQL9MgXBDc You can go from \"I've had it!\" to \"I've got this!\" with a PLAN. Financial Peace University has helped millions of people take control of their money and it can help you too. https://t.co/NXig3LFdr1 WOW. Over 100,000 people joined the #1000payoff Challenge this month. GREAT JOB. 💪Just because August is almost finished doesn't mean the momentum has to stop. Keep up the great work! Parents: Don't encourage your kids to take out student loans. Help them make plans to go to a school where cash can be paid for college. \n\n@AnthonyONeal wrote an entire book on how to do that. \nIt's available for preorder NOW: https://t.co/bAHasuzfat Credit cards are the most aggressively-marketed product in the history of humankind. \"5 years from today, you will be the same person that you are today, except for the books you read and the people you meet.\" — Charlie Tremendous Jones \n\nCheck out some of the life-changing books we've got on sale this month: https://t.co/RsYeLewGzx RT @EntreLeadership: A whopping 54% of the United States gross domestic product and 66% of all job growth in this country can be attributed… If broke people are making fun of your financial decisions, that's a good sign. Pumped to see Ramsey Personality, @AnthonyONeal on @RachaelRayShow today! He'll be discussing how to kick debt to the curb and build your future. Check your local listings for air-times. RT @ChrisHogan360: Is the Next Recession Around The Corner!? https://t.co/Zw6EYn2M5g MYTH: If I do a will, I might die. TRUTH: You are going to die, so do it with a will. \nMake one TODAY: https://t.co/t1GMMqAyQu You don’t need a credit score to WIN with money. It’s not the end of the world. \nWhat matters is what happens at YOUR house, NOT the White House. https://t.co/07J7djdPzQ Keep up the great work! The #1000payoff is still going strong. \n\nJoin the movement: https://t.co/PtqQWFeZlC https://t.co/xD52wCovLX A broke financial advisor is like a shop teacher with missing fingers. \nBe careful who you believe. \n\nGet in touch with one of our trusted investing Pros: https://t.co/YYGgPoJP8E Every challenge is a chance to grow. \n\nCheck out this week's awesome @EntreLeadership podcast with Olympian and American half-marathon record holder, @ryanhall3 \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko https://t.co/aHrIQ6zVBj You can win with money AND make sure your kids get through college without student loans. Grab our newest bundle today - https://t.co/Od91rgdF0W https://t.co/01HZ0WqiSQ We're challenging you to pay $1,000 toward your smallest debt this month. \n4 lucky winners will get $2,500 to help continue their debt snowball. \n\nJoin the fun: https://t.co/hppJlZblt2 https://t.co/tx90NglVTa Your teenager does NOT need a credit card to learn how to be responsible with money. You've got what it takes to win with money. You just need a plan. \n\nThe Total Money Makeover is the book that's shown millions of people how to take control of their financial future, and it's on sale NOW - https://t.co/9F56yD2Qzr https://t.co/NWmb5WA0pS RT @EntreLeadership: On the latest #EntreLeadership podcast, bestselling author and Enneagram expert @ianmorgancron explains why getting to… Wait at least a year after you're married to buy a house. \nIt takes that long to decide how close you want to live to your in-laws!\n\nWhen you're ready to buy, get in touch with one of our Endorsed Local Providers: https://t.co/ddhTtOQdSt I never met a millionaire who said. \"I made all my money with airline miles.\" \nRich people don’t fall for stupid credit card tricks. Contentment is one of the most powerful financial principles. Once you have that, you can give more, avoid debt, and live a better life. \n\nCheck out @RachelCruze's #ContentmentJournal to show you the way: https://t.co/nQ6i8NHD6B https://t.co/DWsexYxoth RT @RamseyShow: Don't miss Dave's @EntreLeadership Family Business Theme hour today from 4-5PM ET. \n\nCatch the full livestream starting at… Have you joined the Baby Step 2, $1,000 Payoff Challenge?! \n\nThere's still time to get started and set a goal to pay $1,000 toward your smallest debt this month. \n\n4 people will get $2,500 to help continue their debt snowball: https://t.co/SvtCZgHjmX https://t.co/xSsx49t75t If you're in the #KansasCity area, something BIG is happening this fall! \n\nStarting in September, there's a CITYWIDE launch of Financial Peace University. #MarginKC \n\nGet involved, and change your future: https://t.co/GyGR5Y6XFx Whole life insurance is the payday lender of the middle class. DON'T buy it. \n\nUse the 7 Baby Steps. Get a 15-20 year TERM policy worth 10-12 times your annual income. \n\nContact the only company I recommend to get you the coverage you need: https://t.co/0SmgB8nJsa The credit card is the cigarette of money. Everyone knows it's bad and will kill you, yet people still use it. RT @AnthonyONeal: It's time to 🛑relying on student loans to pay for college and start teaching our kids that there is another way. \n\nMy new… Our culture has become stupid about being educated. \n\nParents: @AnthonyONeal's NEW BOOK holds the key to making sure getting a college education is a blessing, not a curse. \n\nIt's available for preorder starting TODAY: https://t.co/DpNQHQz8fL https://t.co/VmVzn8azzw Saving for a down payment on a home is a BIG step in your financial journey. \n\nMy team put together a FREE guide to walk you through it: https://t.co/OT54zWXaTl https://t.co/cLEmNYPhOn Plastic does NOT make you wealthy. A PLAN does. What's in your wallet? Oh wait, everyone already knows.\n\nhttps://t.co/tBoPMmSFmP This is going to be FUN. I'm pumped to announce our $1,000 Payoff Challenge! #1000payoff\n\nIf you're on Baby Step 2, we challenge you to pay $1,000 toward your smallest debt this month. 4 lucky winners will get $2,500 to help continue their debt snowball: https://t.co/2WEln0lyvn https://t.co/dkgICbhxOd Awesome @EntreLeadership podcast this week ft. @CrossFitGames Champs @JasonKhalipa and @richfroning. Don't miss it. \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko https://t.co/OdlTgfzbpU It's now easier than EVER to get the money advice you need. \nCheck out the fun Ramsey skills available on your favorite smart speaker: https://t.co/YGFp1VcWEs https://t.co/2nSzZQJgxk A steady diet of generosity leads to Financial Fitness. This was FUN. https://t.co/jXcOGmZTLX Sell your home with CONFIDENCE by using one of my team's trusted Endorsed Local Providers. \n\nThey're in the top 10% of their market, they follow my advice, and they'll walk with you through every step of the process. https://t.co/ljLOKAyMZC College degrees do not ensure wealth. First show today from the new Ramsey Headquarters. So fun. https://t.co/G8XkFeLjAD The power of focus WORKS. Trying to do everything at once will bring very little progress. Touring the new office. https://t.co/r1EPcotEQN Our Black Friday in July Sale ends soon! \nRight now, you'll get FREE shipping on our top 30 bestsellers: https://t.co/QR9GE4OoaZ https://t.co/ZJPmBoYNd0 Be careful where you spend, invest, and give your money, because your heart will follow. EXCELLENT @EntreLeadership podcast this week with the legendary Art Williams. If you're looking for some motivation, this is for you. \n\niOS: https://t.co/glvePq0UiE  \nAndroid: https://t.co/foi1IfB9ko https://t.co/bzDtgw9oMi This week, we're having a HUGE sale on our top products to help you win with money. Don't miss it! - https://t.co/WMvc0g88hk https://t.co/sWnqgzRjlE Awesome. https://t.co/o6sXlWa6Mg If you celebrate FRIDAY too much, it might be a sign you need to change what you’re doing Monday through Thursday. The mortgage rate you signed up for doesn't have to be the one you keep. \n\nGet in touch with the only company I trust to find out how much you could save: https://t.co/1nYhdkkapz When buying a home, you deserve a trustworthy, TOP agent to help you find the perfect home for you and your budget. \n\nGet in touch with one of my team's endorsed agents in your area: https://t.co/sxPJPRIoni Are you ready to take on the person in your mirror? If you are, that means you’re ready to win. RT @RachelCruze: Heading up to NYC tonight to visit my friends at @GMA tomorrow morning! Got a VERY interesting topic to discuss... 👰😊 The most powerful muscle? The tongue. Speak life, catch someone doing something right today and SAY IT. RT @RamseySolutions: We're moving! July 8th will be the last day to visit Dave &amp; our team at our current building. The new location will be… RT @EntreLeadership: Former Hewlett-Packard CEO @CarlyFiorina explains how to create a culture of collaboration in your organization—and wh… If anyone depends on your income, you NEED life insurance. \n\nTerm insurance is the easiest and SMARTEST way to give your family peace of mind. \n\nGet covered today: https://t.co/NDF3Re1pdA People are made poor every day by their need to appear rich. Act your Wage. The influences you allow into your life MATTER. Choose them wisely. If you care about your team, it's important to take a moment to celebrate them. Great interview with @ChrisHogan360 on the latest @EntreLeadership podcast.\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko You DON'T need a credit card to rent a car. https://t.co/l47S1zufK9 When money is in your possession, what you do with it screams loudly who you are. Summer's in full swing, but that doesn't mean your budget should take a vacation. Get on track with @EveryDollar - it's FREE. https://t.co/O6GRT9T56R Fun morning with these guys https://t.co/2ny569hhx6 There are a LOT of details when it comes to selling a home. Grab my team's FREE Home Sellers Guide to help you every step of the way. https://t.co/vBba5LsOer Having a mortgage is like having a backache. You get used to it and forget it’s there, but when it’s gone, you will notice. Exciting times! https://t.co/oJSJ58Rwzg Your future matters too much to waste another day carrying debt around like a pet. Get on a plan that will help you never worry about money EVER again. https://t.co/zosb46VFUB You shouldn’t own anything with a motor in it that’s worth over 50% of your annual income. Whole life insurance is the payday lender of the middle class. DON'T fall for it. \n\nUse the 7 Baby Steps and get a 15-20 year TERM policy worth 10-12 times your annual income. \n\nContact the only company I trust to get you the coverage you need: https://t.co/lbuptXIkMI If you're looking to buy a home this summer, check out my team's FREE Home Buyers Guide to help you from start to finish: https://t.co/lZWk9QJ96P Just because you can make the monthly payment doesn’t mean you can afford it. Conflict is GOOD for your business. Find out why that's the truth, and how to do it right on the latest @EntreLeadership podcast featuring @patricklencioni. \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko https://t.co/WqBdZeALoM Tax Season lasts all year if you own a business. Get a pro you can trust on your side to help. https://t.co/HLQCCO0Grs The best vacation is one that doesn’t follow you home. Pay CASH. If you don't have a plan for your money, you won't have it long. Grow up and make a budget. Start a FREE one with @EveryDollar! https://t.co/PPeaGA7Rx7 There is always a \"reason\" to not win. They are called excuses. MYTH: If I do a will, I might die. \nTRUTH: You are going to die, so do it with a will. \n\nGet my team's new Will Preparation Checklist to guide you through each decision you need to make. It's FREE: https://t.co/2ygmNTVGHC Selling a home doesn't have to be stressful and confusing. Download my FREE guide to walk you through it: https://t.co/gsW1eIb6am RT @EntreLeadership: BELAY (@belay_solutions) Co-CEOs Bryan and Shannon Miles explain how delegating results, not tasks, will dramatically… When your money makes more than you do, you are officially wealthy. You can save more and worry a lot less with the right insurance coverage. \n\nGet in touch with an independent agent that will shop around for the best rates for YOU: https://t.co/Q973JJB4QP First-Gen Millionaires are some of the most generous people you will ever meet, and you will never know this side of Heaven who they are or how much they give. Because recognition is not what they seek. \n\nhttps://t.co/yuTCtkq0ut Last chance to enter our Fuel Your Summer Giveaway! Don't miss out on your chance at a $5,000 ultimate summer road trip or a $250 gas card! -  https://t.co/P2I8s8Vdfh https://t.co/QhrjbMBMGg \"Winners never quit\"...Yes they do. They quit doing stupid stuff. RT @EntreLeadership: New podcast episode! @DutchBros Coffee CEO and Founder Travis Boersma explains why he credits his passionate team for… Contentment is KEY to winning with money. Check out @RachelCruze's #ContentmentJournal. \n\nIt's a 90-day guide toward living a life you love: https://t.co/WENa3N83NF https://t.co/6jocm9Tgxr WOW. Our Facebook community is growing fast. \n\nIf you're looking for some encouragement and motivation on your Baby Steps journey, join the fun: https://t.co/zjkABRaRg2 It's not too late to find a career you LOVE. You're not alone. @KenColeman has a GREAT plan: https://t.co/YDXHPlxdUC Every morning when you get up you have option to add things to this world or tear things down. Choose well. Remember on Memorial Day. Men and Women have paid an incredible price for our freedom. Freedom isn’t free. Your gas bill just might be on us this summer. 💵\n\nEnter our Fuel Your Summer Giveaway for your chance to WIN: https://t.co/p9RZC13Z9l https://t.co/cDpMUlORjU RT @KenColeman: If you missed yesterday's segment on @RachaelRayShow, I had the chance to help Sophia discover her dream and how to pursue… The only real leadership is servant leadership, everything else is just a \"boss.\" RT @ChrisHogan360: I'll be on Fox News' @DailyBriefing with @DanaPerino today around 2:40 PM EST! Another awesome @EntreLeadership podcast this week ft. @milesadcox and @clayscroggins. Learn the importance of emotional intelligence in the workplace and how to create clarity in the midst of distraction. \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko Insurance is important, but it shouldn't overwhelm your budget. \n\nGet in touch with someone on your side to find you the right coverage at the best price for you: https://t.co/boEprZCqY2 To win with money, learn to live on less than you make. It’s a concept Congress can’t grasp. .@KenColeman's #ProximityPrinciple book is the PROVEN strategy that will lead to the career you love. Don't waste another year wishing you'd done something different. \n\nRead this book and start to make a change: https://t.co/qoUIaHhF0i https://t.co/ACvG4I0T3X RT @KenColeman: The next stop on book tour is Mesa, AZ! #ProximityPrinciple #Arizona https://t.co/P3zlZHKBaW How much could you save if you had no payments? How much could you GIVE if you had no payments? Proverbs 22:7 is REAL. Never underestimate the power of a book to completely change your life. \n\nCheck out the $10 sale on some of our most popular books: https://t.co/U7gttM864s https://t.co/uVCO9e1cPw Good Morning, #KansasCity! Pumped to be at @WFCnews Westisde Family Church in Lenexa today. Church is free, and you’re invited. On my way to Kansas City today. I’ll be speaking at all services this weekend at Westside Family Church – Main Campus in Lenexa @WFCnews – Join us. Church is FREE. Catch Ramsey Personality, @KenColeman on The @benshapiro Show today around 4:20PM ET! Excited to listen in https://t.co/rODWTIzDoB .@KenColeman is talking about the secret to finding a career you'll love on @YahooFinance. Don't miss it! #ProximityPrinciple https://t.co/mRZDrNCbYG Don't spend one more day wasting money on the wrong insurance. \n\nTalk to an INDEPENDENT agent that will find the right coverage for your home and car at the RIGHT price for you: https://t.co/AuqClPuOZ6 LET'S GO. \nSee you there, #Nashville! \n\n#ProximityPrinciple https://t.co/ukDaibcQEa RT @KenColeman: I'll be on @ramseyshow at 2:15 PM CT before the #ProximityPrinciple book signing in Nashville tonight! \n\nWatch it live here… What if you were as productive every day as you are the two days before vacation? Carpe Diem. There's still time to join the fun with our Fuel Your Summer Giveaway! \nEnter now: https://t.co/ttoTy3WQPx https://t.co/8E0v01t2cp “I got your six.” I think we should all learn to do that for the people and the organizations we care about. We should have the character quality of loyalty. \n\nhttps://t.co/ydQWsYLEGd \"Don't be so focused on the next that you don't focus on the NOW.\" — @KenColeman #ProximityPrinciple \n\nGet your copy of Ken's NEW book and start making changes NOW that will get you where you want to be LATER. — https://t.co/QVNwwxGRV8 https://t.co/6JU5zlULon RT @KenColeman: I'll be on the @ramseyshow at 3:30 PM CT with a #ProximityPrinciple tour update! Watch here: https://t.co/6RUUqBguf5 Having the right person on your side through the home buying or selling process makes ALL the difference. If you're making moves this spring, get in touch with one of my team's Endorsed Local Providers in your area: https://t.co/OGuCCjrON1 RT @KenColeman: I'm calling into the @ramseyshow from Chicago today at 2:15 PM CT! #ProximityPrinciple\n\nWatch live here: https://t.co/bUTS3… There’s no substitute for hard work. \n\nYou have to get up, leave the cave, kill something, drag it home, and eat it. It's important to check your financial coverage often. A few minutes today could save you time and money in the long run. Take my team's 5-Minute Coverage Checkup: https://t.co/M007kG1AOe TRUTH from @KenColeman's #ProximityPrinciple book: \"You have to step out before you can step up.\" \n\nYou owe it to yourself to become who you were created to be. \nGet started today: https://t.co/MjSS3q1nvC https://t.co/ggdkUgzsIe Pumped to talk with @KenColeman on @RamseyShow for the launch of The #ProximityPrinciple book today. Catch the full LIVE show here and listen in for Ken around 2:15PM ET \n\nhttps://t.co/JRZtNsil6r EXCELLENT @EntreLeadership podcast today featuring @KenColeman. \nQuit hating your job and find out how to break into the career you actually want. \n\nDon't miss this! \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko https://t.co/P4jZP9hbNn \"You have to learn from the best to become one of the best.\" \n\n@KenColeman's #ProximityPrinciple book is AVAILABLE TODAY! \n\nGrab your copy and get on a path toward your dream career: https://t.co/uEW5POtnPC https://t.co/CBfBPsucur Catch Ramsey Personality and Career Expert, @KenColeman on @foxandfriends tomorrow morning around 6:50AM ET! He'll be discussing his brand-new book, The #ProximityPrinciple. It's out tomorrow and it's AWESOME. Your time is too valuable to waste your life in a career you hate. \n\nThere's just 2 days left to preorder @KenColeman's #ProximityPrinciple book before it releases on Monday. You'll get $20 worth of bonus items. \n\nDON'T MISS THIS: https://t.co/73lhcl9csj https://t.co/UvXu1ngF34 RT @ChrisHogan360: Excited to be on @dailybriefing with @DanaPerino today at 2:40 PM ET! RT @KenColeman: 4 DAYS. \n\nWill I see you there? \n\nFind all the details here: https://t.co/we1qI73C7t \n\n#ProximityPrinciple https://t.co/hXh… Enter the Fuel Your Summer Giveaway for a chance save BIG on the gas budget this year! - https://t.co/UOCZHpFyX2 https://t.co/jX6bJRkFpm You can do anything if you will just take the next step, then the next step and never give up! “You will be the same person in five years as you are today, except for the people you meet and the books you read.” ― Charlie Tremendous Jones \n\n Check out our HUGE sale on some of our most popular books: https://t.co/PrfyrOuM4k https://t.co/9kqRIpYpQn RT @RachelCruze: My mom, Sharon, is the keeper of ALL the Ramsey family stories. I can’t wait for you to hear her interview in this special… Have some fun on US this summer. Enter the Fuel Your Summer Giveaway for your chance to win $250 gas cards and MORE! - https://t.co/zi3J8lidWP https://t.co/QIifEzgg1H The #ProximityPrinciple by @KenColeman is out NEXT WEEK! This book is a game-changer for graduates and anyone who wants to find the job that's right for them. \n\nPreorder your copy NOW: https://t.co/tposOvpgWR https://t.co/Ugm7ohtjnv Goals convert vision into energy. When you write your goals down, you immediately start feeling the earth move under your feet. Don't waste money on the wrong insurance. Get in touch with a trusted INDEPENDENT agent to find the best rates for your individual needs. https://t.co/DzMks3sztZ The Total Money Makeover is on sale now for only $10. \n\nStart turning things around TODAY with a plan: https://t.co/gucns1j0L6 https://t.co/Rc1vA77m7S Don't let your brother's friend's cousin sell you a house. I'm sure they're nice, but you deserve an experienced professional when making a large purchase. \n\nGet in touch with the best of the best: https://t.co/6WUWR1qDJ8 Today is National Life Insurance Day. I'd say there's no better time than right now to get covered. Do it for your family and their future: https://t.co/i0h4qcMUOk Your kids are watching you. If you don't know how to handle money, they won't either. Content people WIN with money. \n\nTake the time to find the right perspective with @RachelCruze's #ContentmentJournal: https://t.co/fSLcWqgvYL https://t.co/JHpylaSwvg Summer's almost here, and we're celebrating BIG. \n\nEnter our GIVEAWAY for a chance to win $250 gas cards and SO much more: https://t.co/yZkUAJi4Bq https://t.co/Tvk1hHUtF0 .@KenColeman's #ProximityPrinciple book releases just 2 weeks from today! \n\nDon't miss your chance to preorder and get $20 worth of FREE bonus items along with the book that has a PLAN to find a career you'll actually enjoy: https://t.co/Ell8K7SzJ6 https://t.co/LusgtWu8AC No one should ever shame someone for being poor, but all of us should be open to having our bad habits called out so we can live better lives. https://t.co/7WoRpDVtOa The person in my mirror is my problem. They’re also my solution. “The single most important thing you develop in your lifetime is a positive attitude.” \n\nAWESOME to have the legendary Art Williams at our @entreleadership Summit today. #EntreSummit https://t.co/oQuWOe2dv2 So pumped about this week. We're at our HUGE @EntreLeadership Summit in San Diego showing leaders how to grow themselves AND their teams. \n\nCheck out the highlights each day on the #EntreLeadership podcast. \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko https://t.co/ml2xqXwRGi \"Comparison is the thief of joy... and your money.\" — @RachelCruze \n\nPick up your copy of her #ContentmentJournal and be on your way to loving your life, not theirs. - https://t.co/NdIckZV2SR https://t.co/JNfYkxJgLl RT @EntreLeadership: According to @scottbelsky, Initiative &gt; Experience when it comes to hiring! https://t.co/BCn3Gv6I8K Good News: YOU can change your life by deciding to. Don’t wait on someone else to do it for you. EVERYONE needs a will. Take the time to make one. This matters. \n\nGet my team's FREE Will Preparation Checklist to help walk you through the process of deciding what you need to cover: https://t.co/icUNJGSefJ Their lack of character should not dictate you having a lack of Character. I HATE income taxes, but  I pay every penny owed, that is MY integrity. https://t.co/j7IBoMlg5F Discover the plan you need to find a job you love with @KenColeman's latest book, \"The Proximity Principle\". \n\nIt's available for preorder NOW: https://t.co/dl7jlrE8ub \n\n#ProximityPrinciple https://t.co/1sDuaFy80r Setting a goal doesn't guarantee success; it just gives you a target. Teachers: Don't miss your chance to enter our Teacher Appreciation Giveaway: https://t.co/MxG0jm1omM https://t.co/NbT7JI0gmp Save time and money when buying or selling a home by using a trusted expert with a proven track record of success. Get in touch with one of our Real Estate ELPs in your area: https://t.co/pgllLjbj0y Had a great time joining @RachaelRayShow to talk tax refunds and investing. Check your local listings for air times tomorrow! People spend more time picking out what they're going to binge on TV than what their budget will be. \nGrow up and make a plan: https://t.co/EwybgE0m4I You have to pay a price to win. Live like no one else so later you can live and GIVE like no one else. If you're always worried about what everyone else has, you'll never be happy with what you have. Content people WIN with money and so much more. \n\nGet your copy of @RachelCruze's #ContentmentJournal:  https://t.co/oujFssDpqq https://t.co/ftWgzdSIEG If you don't understand it, DON'T invest it in. \n\nGet a Pro on your side with the heart of a teacher to guide you. https://t.co/vkMpnuyeUl Teachers: Your odds just got even better. We've added a second vacation to our Teacher Appreciation Giveaway! \n\nYou don't want to miss this: https://t.co/HpCNmfeEKL https://t.co/MpqXhcZeEu I never met a millionaire who said. \"I made all my money with airline miles.\" Rich people don’t fall for stupid credit card tricks. Tax Day is here. If you were surprised this year, get in touch with an advisor to see what you need to change to prepare for next time around. https://t.co/Cl6DBnH0ri There are 3 things EVERY team member needs in order to love their job. Find out what they are from @patricklencioni on the latest @EntreLeadership podcast. \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko https://t.co/itu0dWlKlK RT @KenColeman: Tune in to @foxandfriends tomorrow morning at 8:50 a.m. EST. I’ll be on Fox &amp; Friends Weekend! When buying or selling a home, you deserve an agent who negotiates the best deal and treats you as their MOST important client. Our Endorsed Local Providers do just THAT. https://t.co/S2pxTqjPqr Come as my guest. I pay. You pay for someone else someday. #PayItForward. @RamseyCare will be in touch. https://t.co/KxGV7xqTgv Success is not one big splash. You win with excellence in the ordinary. Do the right thing, the right way, every day. Quit the comparisons and start living the life YOU want. @RachelCruze's #ContentmentJournal will help you learn to live a more grateful life in just 90 days: https://t.co/4X6BuxxL5z https://t.co/6onelC1Vcx See this Instagram photo by @kencolemanshow https://t.co/wbx8nE9Imx Wow...thanks so much!!! https://t.co/8BViL3pBp0 RT @KenColeman: Pumped to be in #NYC tomorrow on @foxandfriends! Tune in around 6:50 a.m. EST to watch. You're not alone. You can find some common ground and community to help you win with money in our FREE Facebook group. https://t.co/zjkABRaRg2 We're saying thanks to #teachers in a BIG way. \nEnter our Teacher Appreciation giveaway: https://t.co/FbqJzNmB0W https://t.co/Wf5hAIvsOv RT @RachelCruze: Excited to be on @GMA tomorrow morning! Tune in between 7-9 AM CT and join us 😊 A 20-year, $500K term life insurance policy on a healthy, 34-year old man costs about $21 per month. The same $500K coverage from a whole life policy costs over $180 per month. \n\nThis is simple. Follow the Baby Steps and get TERM life insurance: https://t.co/2lWIfXBbg6 lol. Yep and I am an expert on \"My Opinion.\" https://t.co/ztHooFqsok Funny guy.....been called a lot worse than an old grouch. https://t.co/0BxQXa598g Normal is broke. Normal is a victim mentality. Normal sucks. BE WEIRD. You've got to learn to control your schedule instead of letting your schedule control YOU. Get expert advice on how to make more of the time you have on the latest @EntreLeadership podcast with @MichaelHyatt.  \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko https://t.co/2cQYvgdxLq Well written Cuz. Made my eyes leak thinking about Uncle Dave behind my boat at 78. Great old picture with Grandpa too. https://t.co/4O8vbFnlQW LOL....probably. Do they even still make these. https://t.co/hAb5j4BzEO Enjoyed talking about faith and money with @paulafaris for the #JourneysOfFaith podcast.\n \nCheck it out.\n \nApple: https://t.co/12P5Gh5pnR\nAndroid: https://t.co/sm4i2bZYdd\nSpotify: https://t.co/ftA1XyeRP2 https://t.co/VEeSKx4AOt Too many people are living for the weekend. NOW is the time for you to become who you were created to be.\n\n Preorder @KenColeman's #ProximityPrinciple book to find out how to get closer to a job you'll love: https://t.co/uPheqIs6zv https://t.co/igW0NxNuii They make you do things and learn things you never thought you could. They believe in you, especially when you don’t believe in yourself. https://t.co/FtZzE160U7 There's enough to worry about. Cut through the clutter and take my team's 5-Minute Coverage Checkup to find out what insurance, documents, and other coverage you need in order to protect yourself and your family's future. https://t.co/APadA9JBnB There have been some big changes for this tax season. Get a Pro on your side to walk you through how they might impact your bottom line. https://t.co/dXs6VTldCE A crook is still a crook, even if you have a contract with him. Be careful who you do business with! \"In a world full of comparison, choose contentment.\" - @RachelCruze \n\nProud of Rachel and the team on her new #ContentmentJournal. \n\nIt's available NOW! Get yours here: https://t.co/dRvmVEPVnh https://t.co/r206VWnm8n Love it! https://t.co/QnAWmZJXnf Sometimes getting started can seem like the hardest part, but it doesn't have to be. \n\nWe'll show you how: https://t.co/tOQdwep8kX https://t.co/ZAukZCsdyp My morning smiles. NEVER QUIT. Get encouragement from people who love you! https://t.co/7fKbLYb0UQ The Teacher Appreciation Giveaway is here! \nYou don't want to miss this: https://t.co/I0ZAVNR0vE https://t.co/jMktWXyGYf If you work your butt off your whole life, people will call you an overnight success. Check out this week's @EntreLeadership Podcast with @msrachelhollis. Great advice on vision in business. \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko https://t.co/xYHtLigDcm Buy or sell your home with CONFIDENCE by using one of my team's trusted Endorsed Local Providers. They're in the top 10% of their market, they follow my advice, and they'll walk with you through every step of the process. https://t.co/AuRcTzJByv It turns out the gleaming mountain of success is just a pile of failure that you are standing on instead of laying under. https://t.co/hl5nPZzbS4 An emergency fund turns a crisis into an inconvenience. Once I got an Emergency Fund, I quit having emergencies. Headed over to @SIRIUSXM's SEC Network around 9AM ET – Tune in. GO VOLS! #VFL #MarchMadness Good Morning, #NYC! On the way to @foxandfriends with the whole Ramsey crew. Tune in around 6:30AM ET. Pumped to be on @foxandfriends tomorrow morning along with ALL of our Ramsey Personalities - @ChrisHogan360, @ChristyBWright, @KenColeman\n@AnthonyONeal, and @RachelCruze. \n\nWe'll be answering your questions around 6:30AM ET. Tune in! No https://t.co/5lHPGGwJRG Skip the stress and get your taxes done right this year. Contact one of my team's trusted Pros to help. https://t.co/xixy3N1Umy White paper will be out in about a month....keep listening. https://t.co/oMwhR8TuJI You really CAN find a career you love. It just takes a few steps to get there. \n\nPreorder @KenColeman's book, \"The Proximity Principle\", and start on your path toward your dream job. https://t.co/mxbboZsegy \n\n#ProximityPrinciple 8 in 10 people know someone who's been a victim of identity theft. Stop taking chances and get protected. https://t.co/NHiF42Zno3 Love being in San Diego! Sold Out Smart Money event tonight with almost 4,000 folks. Wow...thanks guys! https://t.co/sSyb14Xz1a Credit cards are NOT a safety net. Word of mouth is one of the most powerful marketing tools a business has. Learn how to make it work for YOU on the latest @EntreLeadership podcast. \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko https://t.co/FyKtI0fMmk Whew...that was close...gave me a heart attack. https://t.co/iYxLSOYmxt A budget isn’t a “no”, it’s a PLAN. Start with the best budgeting tool on the planet: @Everydollar. https://t.co/k3iTCRdtRP Well played! https://t.co/H72vVqapg7 Classic. Dad's matter! @megmeekermd https://t.co/RsrTzoaopv If you have made mistakes with money, you know what that makes you? Over 12. We all mess up, get up and do it right. Americans overpaid on taxes by $312 BILLION last year. \n\nIf you got a refund, you overpaid. \n\nGet in touch with a tax pro to find out how to keep more of your hard-earned money throughout the year. https://t.co/UbY63gtit2 If you want things to change, then YOU have to change. Leaders: this week's @EntreLeadership podcast is full of expert answers to your questions about everything from where to find the best people, to resolving conflict. Don’t miss it. \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko https://t.co/5WeMRNDhmp Cheese makes everything better. You should be very proud. LOL https://t.co/iwcWVVk0rX A.L. Williams almost 40 years ago for 3 months when I was 22. Hardly an endorsement. We do not endorse Primerica, their cost of insurance is HIGH. https://t.co/cjdJ6mFC3r Interesting nuance. I just learned something...thanks. https://t.co/1nVUfL82jI Synonymous. We can add \"EVIL\"....still very sad for victims, community, and New Zealand. https://t.co/mYwrhc8xSD Wow. Just. Wow https://t.co/ZhXFT7Sndk Amen Pastor https://t.co/h6XxT3Pg9N Pray for New Zealand. Crazy knows no religious or geographic boundaries. So Sad. The only good debt is debt that is PAID OFF. Not this trip. Got spend time with him in NC a couple of times last year. Great man https://t.co/FDGoBwevNZ Just pulled in Atlanta....SOLD OUT Crowd tonight get here early for great seats!!! @AnthonyONeal and I are PUMPED https://t.co/atCPfkttpM Glad you liked it. We will announce the availability soon. It is in final edit and design. Want to make sure it has lots of charts and graphs for us nerds. LOL It will be sold only in our online store. https://t.co/qba28Njxwm Really nice summation.  Thanks https://t.co/gpdCoOPzXj Thank-you. You are amazing. https://t.co/ENhz26Wq9K Buying a home is the biggest purchase most people ever make, so it's important to do it right. \n\nIf you’re ready to buy, get in touch with the only company I trust to walk alongside you through the mortgage process: https://t.co/jnq7xGvtiR #Sacramento - We're bringing the Smart Conference to YOU. \n\nIn one day, you'll learn from America's leading experts in marriage, parenting, money, career, leadership, and personal development. \n\nBE THERE: https://t.co/cbLcu6YcQC https://t.co/YGRYPdcwes You don’t have to hate your job. Whether you’ve been in the workforce for 20 years or 20 minutes, @KenColeman wrote \"The Proximity Principle\" for YOU. \n\nIt's available for preorder NOW: https://t.co/E8ao8V0MAb https://t.co/bcFHXOFSoZ What legacy are you building and passing? How are you using your numbered days to help others and carry Generosity forward? https://t.co/hEc7qjeBFM Of the few things you still control....Your Choices and Your Attitude, both determine your future. Choose carefully. None of us a promised tomorrow. Protect your family and your wishes with a plan. To do that, you need a WRITTEN will. https://t.co/eKOf1DtgfN RT @ChrisHogan360: Excited to be on @MorningsMaria tomorrow morning around 7:50am EST! Your tax refund is NOT a bonus. \n\nGet in touch with a trusted Tax Pro and make adjustments with your employer to keep more of your hard-earned money next time around. https://t.co/Davl3nhXRP Loving this week's episode of the @EntreLeadership Podcast on building a culture of excellence. It takes kicking fear to the curb and finding some focus. \n\nCheck it out. \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko https://t.co/6p3hqq7qIA Way to go HEROES!!!! Congrats!!! Proud of you! https://t.co/cLWx1x43p2 Margaret Thatcher once said that \"The trouble with Socialism is that eventually you run out of other people's money.\" Contentment! https://t.co/xfY4bU7GJV Amen https://t.co/RcdwQoWwM9 Finding the right home takes more than a google search. \nGet in touch with an agent you can TRUST to find the home that’s right for you. https://t.co/bYBKLoMuXL I had to click to make sure the Trans Am was not on the list. If it were we would have had an intervention. :) https://t.co/8ldK6KAkDF If you do rich people stuff, eventually you will be rich. If you do poor people stuff, you will eventually be poor. If you haven't finished your taxes this year, there's still time to do them RIGHT. \n\nBe prepared and check out the FREE checklist my team put together: https://t.co/azppzqz8sT Term life insurance is the only way to go. It protects your family and gives you peace of mind. \n\nDon't go another day without it. https://t.co/n7n2T7JOhv There is tremendous satisfaction in working your tail off to hit a goal, then winning. It is worth the work. 70% of people are unhappy with their job. Let's fix that. \n\n@KenColeman's NEW book, “The Proximity Principle”, is available for preorder now, and it will show you how to find a career you LOVE. \n\nReserve your copy: https://t.co/oHnJGxeFfS \n\n#ProximityPrinciple https://t.co/Ud3kcnCWqw Had a great time speaking to over 1,000 small business owners at our @EntreLeadership 1-Day Event a few weeks ago. Check out the latest #EntreLeadership podcast to hear some of the best clips from the day. \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko https://t.co/NBWaMF0G9M Get your taxes done RIGHT this year. Get in touch with one of my team's trusted Pros. https://t.co/unwAGv1O9L RT @RachelCruze: Excited to be on @foxandfriends tomorrow morning! Tune in around 7:50 AM CT and join us 😊 “Well done is better than well said.” – Benjamin Franklin Spending in CASH hurts. Studies show you spend less because it activates the pain centers of the brain. Try it. Solid communication changes EVERYTHING. Leaders: Don't miss this week's @EntreLeadership podcast. Great conversation with Pastor @craiggroeschel \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko No need to spend that extra money. The videos are 100% available with the Financial Peace on line membership that is included for one year. https://t.co/W5D5NbZt0y Whole life insurance is the payday lender of the middle class. Quit throwing your money away. \n\nIf you’re following the Baby Steps, a term policy is all you need https://t.co/9BXEDqW0wb Wealth-building is a crockpot, not a microwave. Thanks for coming. 4000 folks...SOLD OUT again. We love you Grand Rapids! https://t.co/alZY0sw9od Tax Season is here. Things are a LOT different this year, so be prepared by making sure you understand how the changes impact YOU. https://t.co/s6mb7FlgFl One night can change EVERYTHING. \n\nHeaded to #GrandRapids tomorrow night for a huge Smart Money event with @AnthonyONeal, and you can stream it LIVE it from ANYWHERE. \n\nReserve your spot: https://t.co/oibsljEmhg https://t.co/FqqrVzYEmH Wow!!! Congrats!!! Proud of you! On the way to Everyday Millionaire https://t.co/ZVpHZUuQ8n Thanks, proud of you! https://t.co/KnSYm4O9oW Proud of you! https://t.co/8PJCjYWMuJ Failure is going to happen. It's what you learn from it that counts. \n\nDon't miss the latest @EntreLeadership podcast ft. awesome advice from, Filmmaker Jon Erwin. \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko So sorry you are disappointed. We are happy to issue a refund. My team will be in touch. With adding Every Dollar Plus and Legacy Journey and Smart Money Smart Kids classes and $1000 of features that we used to charge for the workbook is not the value. ALL the information is. https://t.co/cU1CHMj533 When it comes to building wealth, steady investing is the KEY. Once you're out of debt, except for your home, put 15% of your income into retirement. Get in touch with a trusted Pro to walk with you: https://t.co/5B0QMXQ3z7 If you're just getting started with the 7 Baby Steps, this bundle is for YOU. Get it today and you’ll receive access to our Smart Money Livestream Event on February 20th! - https://t.co/Zd0mpqef18 https://t.co/v0arVNlUQm Proud of @AnthonyONeal &amp; @megmeekermd's EXCELLENT Smart Parent event. Kids don't come with an instruction manual, but this event gets pretty close. \n\n#Minneapolis: https://t.co/HX4jgeE9xI \n#Sacramento: https://t.co/tTqHAiKnNq https://t.co/AIYHS2JWvG You CAN quit worrying about money and start making progress for your future. Financial Peace University will walk with you every step of the way. \n\nStart today: https://t.co/HUfxbgPZcD https://t.co/hGXEtSOsf8 Adults devise a plan and follow it. Children do what feels good. Lack of emotional maturity will make you broke. Fun. Thanks for having me on this week. https://t.co/CkghFp4MjK Wondering whether you should self-file or get some help with your taxes this year? My team created a quick quiz to help you decide: https://t.co/srvPxDTKVx https://t.co/32DIGjkJ0p Try @DollarCars ...they now accept Debit Cards! https://t.co/DaCF9xyW9x NO. You don’t have to play credit card games just to rent a car. https://t.co/OWZkSDQjW5 Some of us are a hot mess, and He loves us beyond breathing anyway. You are His child, and He sits by the phone and looks out the front door waiting for you to call or visit so He can hear the sound of your voice.  https://t.co/DbxWt4gXlA Wait at least a year after you're married to buy a house. \n\nIt takes that long to decide how close you want to live to your in-laws...\n\nWhen you're ready to buy, get in touch with one of our Endorsed Local Providers: https://t.co/Up1gUhErkf “Deliver yourself like a gazelle from the hand of the hunter, And like a bird from the hand of the fowler.” - Proverbs 6:5 If anyone depends on your income, you NEED life insurance. \nTerm insurance is the easiest and SMARTEST way to give your family peace of mind. Get covered today: https://t.co/h36O0U8CgU \"Growth on the inside fuels growth on the outside, not the other way around.\" \n\nTRUTH from @JohnCMaxwell in his new #leadershiftbook. It's out today. \n\nLeaders, I highly recommend it. https://t.co/QQRWlxnDUg This tax season looks different than last year. Get a trusted Pro on your side to help you understand how the changes impact your bottom line: https://t.co/ZY0iWf5HzA Your most powerful wealth-building tool is your income. Don’t give it to someone else in debt payments. Fun hanging out with the legendary @benshapiro . Took us about 1 minute to become friends. https://t.co/53k2Bx5rK4 RT @realDailyWire: This week on The @BenShapiro Show: Sunday Special it's @DaveRamsey! \n\nWATCH HERE: https://t.co/y58bCw9zjl https://t.co/Z… Start telling your money where to go instead of wondering where it went. @EveryDollar is the best budgeting app on the planet, and it's FREE: https://t.co/9fBlmIdNWA YEP. Love this from @JohnCMaxwell's latest book, \"Leadershift\". \n\nYou can preorder it now: https://t.co/QQRWlxnDUg #leadershiftbook https://t.co/n4xGYlKWRq I like that. Well said. Agreed. This. https://t.co/ZzFI8mqRBh Today's the deadline for all employers to send out W2s for 2018. \nFind one of our Endorsed Local Providers in your area to get your taxes done RIGHT this year: https://t.co/Nf3zOWKlH2 RT @ChrisHogan360: It's always a great time when I get to talk to @JFM &amp; @RyanNicodemus from @TheMinimalists. Check out their latest episod… The Bible does NOT say \"Money is the root of all evil\" It says \"The LOVE of money is...\" We are called to manage money for God, not worship it. Want to win with money? Get real advice from people who have been in your shoes and made the decisions that took them to millionaire status. \n\nPick up a copy of @ChrisHogan360's #1 book, #EverydayMillionaires: https://t.co/fLLzEzh79x AWESOME @EntreLeadership podcast ft. @MansfieldWrites on how gossip can kill your organization from the inside out, and how to stop it. Leaders, this is a must-listen. \n\niOS: https://t.co/glvePqivac \nAndroid: https://t.co/fPLHGNHght https://t.co/abNccz5uQ5 A broke financial advisor is like a shop teacher with missing fingers. Be careful who you believe. Get a trusted Pro on your side: https://t.co/Wya1LISPpE RT @ChrisHogan360: The definition of greatness is your legacy. #EverydayMillionaires live intentionally so that they can leave a lasting le… People change their life when they finally say, \"I have had it!!! Enough!! I am sick and tired of being sick and tired.\" Do the math and make a SMART decision when buying a home. \n\nIf you’re ready to buy or need to refinance, get in touch with the only company I trust to walk alongside you through the process: https://t.co/lgJfJRSh0L https://t.co/l0MdcDHkD6 Want more money? Make a budget. \n\nWhen you know where each dollar is going, you'll feel like you got a raise. \n\nDownload our FREE budgeting app, @EveryDollar: https://t.co/HAhtOP9TvA I know it’s scary, and someone you care about might not be impressed, but so what? Do it anyway. https://t.co/HVQuVNQtu2 Quit wasting your time on Facebook and start using it to make some PROGRESS with your money. \nJoin our FREE group: https://t.co/zjkABRaRg2 No matter where you're at with money, you need 10-12 times your annual income in TERM life insurance. \nThis is the best way to secure your family's future in case the worst happens. \nDon't go another day without it: https://t.co/5ALrY0mrgS Millionaires don't strike it rich overnight. They're normal people with a PLAN. \n\nGrab your copy of @ChrisHogan360's #EverydayMillionaires today: https://t.co/aRm0TuJ4Ca Boom. Be ready. Be real. https://t.co/WFn7yGeyeF Thanks so much for coming. Great night https://t.co/8JLuADgBpn RT @ChrisHogan360: I'm excited to share the truth about what it takes to be an everyday millionaire on @HomeandFamilyTV tomorrow. Tune in a… RT @prageru: \"79% of millionaires received zero inheritance...\n\nDiscipline and hard work were the key factors.\"\n\n@ChrisHogan360\nhttps://t.c… RT @ChrisHogan360: Listen to the latest episode of the @Mill_Unveiled podcast to learn how #EverydayMillionaires save money: https://t.co/u… RT @ChrisHogan360: I shared the #1 way to become a millionaire on the latest episode of the Marriage, Money, and Kids podcast with @AndyHil… RT @ChrisHogan360: What mindset do #EverydayMillionaires have? Find out on the most recent #CodeofCharacter podcast: https://t.co/WAniQgqkHi If you're in the market for a home, or will be in the near future, my team created an awesome guide to walk you through everything from searching to closing. \n\nCheck it out: https://t.co/CComQlMNG0 https://t.co/5wlo0KwAR0 Habits can be toxic, or they can be awesome. Find out how to break the bad ones and make the good ones stick with advice on the latest @EntreLeadership podcast. \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko https://t.co/d5u4OfdcfE RT @ChrisHogan360: If you're in #LosAngeles, I'll be sharing the truth about #EverydayMillionaires on @KTLAMorningNews today at 10:35 AM! RT @ChrisHogan360: I believe just about anyone who’s willing to work hard and be disciplined about spending and saving can become a million… Everyone has an opinion about debt... @RachelCruze discusses some of the lies people have believed about how to get out of it on her ALL-NEW podcast. \nCheck it out! \n\nApple: https://t.co/nmYw3ioTvj \nAndroid: https://t.co/B7Qj9AefPZ https://t.co/h9uiGQu8H4 Darkness cannot drive out darkness: only light can do that. Hate cannot drive out hate: only love can do that. - MLK. Celebrate the man AND what he stood for. What if you NEVER had another payment again? It's possible. Really. \nStart making progress TODAY: https://t.co/yIQK9IW4RI RT @ChrisHogan360: I'm ready for California! Join me in LA today for an #EverydayMillionaires book signing! https://t.co/jGNZe9baOg RT @ChrisHogan360: #EverydayMillionaires stay away from debt for a reason. I'll be on Cavuto: Coast to Coast with @teamcavuto on @FoxBusine… #Atlanta - @anthonyoneal and I are headed your way on March 14th, for the Smart Money tour! \n\nIt’s one night of key information and motivation to help you get on a plan and WIN with money. \n\nGrab your tickets today: https://t.co/ViTsJXLvVd https://t.co/Ays0wR7VKV Millionaires don't all drive sports cars and live on yachts every summer. They're normal people who were SMART with their money. \n\nGet @ChrisHogan360's #EverydayMillionaires book to learn just how normal they are: https://t.co/r8mt2kckkJ https://t.co/cPzpkKEKcY RT @ChrisHogan360: Ready to start my day in #Phoenix by sharing the truth about what it takes to build wealth on Good Morning Arizona @azfa… RT @ChrisHogan360: Ready to bust the myths about building wealth on @KRDONC13 at noon in #ColoradoSprings! #EverydayMillionaires RT @ChrisHogan360: We CAN control our effort.\nWe CAN control our focus.\nWe CAN control our action!\n#EverydayMillionaires Some insurance can be a rip off. Find out exactly what YOU need and what you can leave behind and save money on. Take our free Coverage Checkup: https://t.co/W9GSfPy5NE https://t.co/A49O4dJsv7 Like many other people in college, I did an amazing amount of really stupid things . . . and survived. https://t.co/KD4pIOEvw7 RT @ChrisHogan360: #SanAntonio I'll be on Fox 29 Daytime at Nine with @KABBFOX29 in the 9am hour to share how you can make it to millionair… Start 2019 on the path toward Financial Peace. You have what it takes to WIN. We've got your plan: https://t.co/JnRl4JPxSl RT @ChrisHogan360: #Philadelphia - It is time to learn the truth about building wealth in America. Tune into @WWDB_AM_860 at 5pm to learn h… RT @ChrisHogan360: Becoming a millionaire has nothing to do with your job. It has everything to do with your mindset. Listen to The Fox New… RT @ChrisHogan360: Always a great time on the @EntreLeadership podcast. #EverydayMillionaires https://t.co/qyr6z5CaVe RT @ChrisHogan360: I had the chance to share the secret of how #EverydayMillionaires reach millionaire status on the latest episode of the… RT @ChrisHogan360: Ready to start the day in #Austin on @fox7austin at 9:15 AM! #EverydayMillionaires Believe you can do it and you CAN. 97% of millionaires believe they control their own destinies. Get @ChrisHogan360's #EverydayMillionaires book is available now: https://t.co/fmZLxEgj0f https://t.co/A1FP0gcCfd Never invest in something you don't fully understand. Get a trustworthy investing Pro on your side to teach you what's best for your individual situation: https://t.co/4tSQtGFAib #Houston - Go meet @ChrisHogan360 and grab your copy of #EverdayMillionaires TODAY! https://t.co/xNwlD3dKz5 RT @ChristyBWright: My friend @ChrisHogan360 stopped by the #BusinessBoutique podcast to teach you how your business can make a million dol… RT @ChrisHogan360: #Wichita - Listen to @HooserReason this morning at 8am CT to learn the truth about what it takes to become an everyday m… RT @ChrisHogan360: #Houston - I'm breaking down the myths about what it takes to be an everyday millionaire on @Fox26Houston this morning a… RT @ChrisHogan360: Excited to be on @GreatDayHouston in the 9am CT hour! #EverydayMillionaires I love Mondays....Like a clean white board....Now we can do ANYTHING. Check out this #SmartCon lineup!\n\nGreat day in #Dallas https://t.co/HccouZJlyd RT @AnthonyONeal: \"EVERYBODY needs a mentor.\" Couldn't agree more @KenColeman #SmartCon RT @RachelCruze: \"There's freedom on the other side of your fear.\" @ChristyBWright 🙌#SmartCon AMEN. https://t.co/eMac1Kdb2S RT @ChrisHogan360: \"We all have conflict, it doesn't matter how loving we are.\" @LesParrott #SmartCon RT @ChrisHogan360: LIVE from #SmartCon in #Dallas - you CAN become an Everyday Millionaire! #EverydayMillionaires https://t.co/xmaBfvRSvM #DALLAS - It's a great day for a Smart Conference. Let's do this! #SmartCon Gearing up for our #Dallas Smart Conference tomorrow! Who's joining us? #SmartCon https://t.co/r1MPvL5Aqg Don't tell me it's not possible to become a millionaire in America today. It IS and it's up to YOU: https://t.co/WSjIFuuHdX https://t.co/llWNDrAeXv You only believe the deck must be shuffled if you believe the deck is stacked against you. It isn’t. There is no Boogie Man. You can win. RT @ChrisHogan360: The #EverydayMillionaires Town Hall is LIVE NOW! https://t.co/WmOpE9PK4w Don't miss our #EverydayMillionaires Town Hall TONIGHT, live from Ramsey Solutions Headquarters. Excited to do this event with @ChrisHogan360. \n\nStream starts at 7PM ET / 6PM CT \n\nhttps://t.co/4ThHMPShy4 .@ChrisHogan360 joins me LIVE coming up on @RamseyShow for an Everyday Millionaire Theme Hour and to discuss his all-new, ground-breaking book, #EverydayMillionaires. Tune in!  https://t.co/yPtGtVUpL8 RT @ChrisHogan360: I'm sharing some common traits and characteristics of #EverydayMillionaires with @runnymedecap in the latest episode of… RT @ChrisHogan360: Can't wait to be on @NC5_talktown during the 11am hour in #Nashville! RT @ChrisHogan360: #Houston - I'll be on @mix965Houston this morning at 9am CT! RT @ChrisHogan360: It is always great when I get the opportunity to stop by @FOXNashville. Thank you for having me this morning. Tune in at… The average millionaire drives a four-year-old car with 41,000 miles on it. – @ChrisHogan360 \n\n#EverydayMillionaires is OUT NOW: https://t.co/QUTrXDHznI https://t.co/aC5IfQR72Y Squeeze every drop. Every sunrise, every sunset. And dream of winning again... \n\nhttps://t.co/OnmUMFUgVz RT @RachaelRayShow: Are you ready to follow in the footsteps of real-life millionaires? (@ChrisHogan360)\nhttps://t.co/95fQ87hxfJ RT @ChrisHogan360: I got to share how #EverydayMillionaires can impact entrepreneurs on the latest episode of Entrepreneurs Talk Story. Lis… Want to become a #EverydayMillionaire? \n\nFinancial Peace University is the plan to get you there: https://t.co/rkFHQKyXaS https://t.co/TyXztE2pwS #Chicago - Go meet @ChrisHogan360 tonight and get a signed copy of #EverydayMillionaires! https://t.co/4HKaqTnyKI RT @ChrisHogan360: I'll be on @WindyCityLIVE in #Chicago today at 1 PM CT before my #EverydayMillionaires booksigning! Don't miss @ChrisHogan360 on @RamseyShow calling in LIVE from the Chicago stop of his #EverydayMillionaires book tour during hour 1 of today's show: https://t.co/bUXhTj2TyQ \"73% of millionaires have never carried a credit card balance in their lives.\" — @ChrisHogan360 \n\nGet your copy of #EverydayMillionaires: https://t.co/vbB5cqaEjg https://t.co/1FUQxDBMNo Wow. Awesome @EntreLeadership podcast this week featuring Navy SEAL and endurance athlete, @davidgoggins. If you're looking for some motivation this week, this is it. \n\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko https://t.co/TqvALntHgR RT @ChrisHogan360: .@Hisandhermoney and I talked about the research behind #EverydayMillionaiers on the latest episode of The His and Her M… RT @ChrisHogan360: This is what it takes to make a million dollars in your business. Excited that I got to share this message on the #Busin… RT @ChrisHogan360: Great time talking with Ryan about how the average person can reach millionaire status on the @orderofman podcast. Thank… Tune in! https://t.co/ksWRvBHSJI Yea, that company is crooked from the top down. https://t.co/fmCJf1i3Bn We're hosting an #EverydayMillionaires Town Hall event with @ChrisHogan360 this Thursday night. You can live stream it for FREE from anywhere. 7PM Eastern / 6PM Central  \n\nhttps://t.co/4ThHMPShy4 RT @ChrisHogan360: I'm on live with @YahooFinance! https://t.co/KTMjSjNrQE #EverydayMillionaires Tune in to @TeamCavuto's \"Your World\" at 4PM ET on @FoxNews to hear @ChrisHogan360's advice on becoming a millionaire in today's economy. #EverydayMillionaires RT @ChrisHogan360: I'm live right now with @womansday on Facebook! https://t.co/hNfJ2reTpl #EverydayMillionaires RT @ChrisHogan360: If you're in the #Chicago area, I'll be on @WBGLradio's The Morning Show with Jonathan &amp; Lindsey at 10:30 AM CT to talk… My Grandmother used to say, \"There is a great place to go if you are broke, TO WORK!!” SO proud of @ChrisHogan360 and our team for this AWESOME book and research. #EverydayMillionaires is a game-changer. \n\nIt's time for people to know the truth about wealth and how to achieve it. This book is helping to set it free: https://t.co/SycyJXq4K6 https://t.co/5NPTMwy8w5 RT @ChrisHogan360: Thanks @tbpod for having me on the podcast to talk share the five attributes and habits of #EverydayMillionaires! https:… RT @ChrisHogan360: I had a great time sitting down with Paula for the @AffordAnything podcast! #EverydayMillionaires\nhttps://t.co/LdEDOZUCjM RT @ChrisHogan360: That's right! Anybody can be an everyday millionaire! Thanks for having me on @FinanceLacey! https://t.co/LdJnKrbeWj \"80% of millionaires did NOT attend prestigious, private schools. 9% never graduated at all.\" — @ChrisHogan360 \n\nThere's more truth where that came from. #EverydayMillionaires is available TODAY: https://t.co/gL3dlN1WvX https://t.co/W3VKyoIq5k Great having you guys. Always great to meet a celebrity...even with four legs. https://t.co/nOyLfUNp4y RT @ChrisHogan360: 1/3 of #EverydayMillionaires NEVER made six figures in any single working year of their career. https://t.co/weZak3Ov41 Coming up on today's @RamseyShow, @ChrisHogan360 will be checking in LIVE from Day 1 of his #EverydayMillionaires book tour. \n\nWatch it here: https://t.co/67KthSH90x The largest study of millionaires EVER is available TODAY. \n@ChrisHogan360's #EverydayMillionaires details the ins and outs of our team's ground-breaking research on the anatomy of a millionaire and how to become one yourself. \n\nGET IT NOW: https://t.co/xqmjG803Q7 https://t.co/bHyUOc0IY8 #NYC don’t miss this! https://t.co/uFvlK79Sgv RT @ChrisHogan360: We're about to start a movement. Get ready. #EverydayMillionaires https://t.co/CvfR4IHPgk RT @ChrisHogan360: West Texas! Tune into The New Morning Drive on Newstalk 550 KCRS at 8:11 AM CT for my talk with @kristine_100! RT @ChrisHogan360: For everyone in #Georgia - I'll be on The Morning Show with Bill &amp; Joel on @access_wdun at 8:42 AM ET! #EverydayMilliona… Catch @ChrisHogan360 on @foxandfriends this morning around 7:50AM ET sharing about his ALL-NEW BOOK, #EverydayMillionaires - It's available TODAY! #EverydayMillionaires is HERE! \nThis book reveals the TRUTH about millionaires, and everyone needs to hear it. \nGreat job, @Chrishogan360. \n\nGrab a copy: https://t.co/Hyl1kBLbMs https://t.co/8FI1zNFgZW RT @ChrisHogan360: Can't wait to be on @foxandfriends tomorrow at 7:50 am ET to celebrate the #EverydayMillionaires launch! RT @ChrisHogan360: I'll be in #NYC tomorrow! Join me at @bntribeca at 6 PM for a book signing and chance to win $1000! #EverydayMillionaires RT @ChrisHogan360: You won't want to miss tonight's episode of @HuckabeeOnTBN at 8/7c! I had a great time talking with @GovMikeHuckabee abo… Headed to Pennsylvania to speak at @LCBCchurch tonight and tomorrow morning. If you're in the area, come visit. Church is FREE. MONDAY - @ChrisHogan360's #EverydayMillionaires is available! \nLast chance to preorder and get $50 of FREE Bonus items: https://t.co/sgT2kArnZd https://t.co/QkEpy8OAcn Flying to Lancaster PA this morning to speak TONIGHT and TOMORROW @LCBCchurch ! Join us ... #ChurchIsFree....then over to NYC to start #EverydayMillionaires tour with @ChrisHogan360 You can save time and money when buying or selling a home when you use a trusted expert with a proven track record of success. \n\nGet in touch with one of our Real Estate ELPs in your area: https://t.co/Q6SBf07EB2 Yep. You asked for it. He delivered. \n@ChrisHogan360 recorded the audiobook for #EverydayMillionaires, and you can hear the first 2 chapters NOW: https://t.co/8zf0N7fkFX https://t.co/Nug5Hk74qp RT @LCBCchurch: We're SO excited to have @DaveRamsey join us on January 5/6/7 as we kick off our Set For Life series at LCBC and learn how… Winning with money requires discipline and a plan. \nGet the information, the motivation, and the community you need with Financial Peace University. \nGroups are starting up all over the country! \n\nGet involved: https://t.co/ORqW1t7W1X Don't miss today's special edition of The @RamseyShow podcast. \nExcited to share some of the all-new Financial Peace University with you for FREE: https://t.co/48sXJxIGNV https://t.co/AyZvFKb0Ay Just 5 days until #EverydayMillionaires by @ChrisHogan360 is out! \nIt's full of the TRUTH about wealth in America and what it takes to achieve it. \n\nPreorder NOW: https://t.co/5DNcgGHUmU https://t.co/kd42d3a0Js It's not too late to grab a #BusinessBoutique Goal Planner and kick off 2019 with motivation and a plan. \n\nGrab one for yourself or someone you believe in: https://t.co/pmAJiU0IJ0 https://t.co/b8DIPDyNCx Crud. So sorry...working on it. Trying to get the guy to stop hitting the enter button. :) https://t.co/fXYAbIwU8x DAY ONE. 2019. Have you made your January budget? \nDownload our FREE @EveryDollar app and do it now: https://t.co/NRtNTn6Fqu I love a New Year! Clean slate: Winning is a choice. Choose to do the tough things that cause you to win!! And we are excited to have YOU at this event! https://t.co/DewvEhgS35 whooo hooo...game on! https://t.co/45RzVHoQAe It's New Year's Eve. 2019 is right around the corner. \nWhat do you want to be reflecting on this time next year? \nDon't look back at this coming year with regret. \nTake your first step toward Financial Peace today: https://t.co/adMc1eQUEq It's been an AWESOME year of the @EntreLeadership podcast. \n\nThis week's episode is full of the best moments from 2018. \n\nDon't miss it: iOS: https://t.co/glvePq0UiE Android: https://t.co/foi1IfB9ko https://t.co/TQkE3offjq Grab some great deals on older editions of our best-selling kids' products. \nDon't miss our clearance sale: https://t.co/1MtLQGCPv1 https://t.co/vbuBNdRtZE This https://t.co/PJ7DtkIptc Amen....this is great news. Your brain is activated when reading. It is not activated when gaming or watching TV. https://t.co/1MTAO0MFMA Tell your money where to go instead of wondering where it went. \n@EveryDollar is our FREE budgeting app, and it's the best one out there. \n\nDownload it and get started now: https://t.co/Vqms4YHwpD https://t.co/TVQg5V7ym2 Your future matters too much to go another year without a plan. \nStart Financial Peace University today: https://t.co/iUO525wwBw https://t.co/ijkMVMXKiu I never met a millionaire who said, \"I made all my money with airline miles.\" \nRich people don’t fall for stupid credit card tricks. Really proud of @ChristyBWright and the #BusinessBoutique team. \nThis Goal Planner is AWESOME. Grab yours before 2019 starts: https://t.co/JsZgmLLyYB https://t.co/KoPuJ3t9N3 Start the new year with the life insurance you need. \nNot the whole life rip-off a salesman told you about. \nIf you're following the Baby Steps, all you need is affordable term insurance. \nDon't go another day without it: https://t.co/jZCGBpRg4r We're SO close to the release date of @ChrisHogan360's new book, #EverydayMillionaires. \n\nDon't miss your chance to preorder it and get over $50 worth of FREE bonus items!\n\nYep, that includes the audio book read by the man himself. 💪https://t.co/4mgytmRcup https://t.co/WwxTbgkaKu We're making room for new books &amp; products in 2019, and that means big deals for you. \n\nCheck out our clearance sale: https://t.co/7gTyJ1vMiw https://t.co/3magRZyvBa The only variable you can control is YOU. What are YOU doing to change your life? Go for it! You have what it takes to achieve more next year, but you'll need to set some goals and work toward them. @ChristyBWright's #BusinessBoutique Goal Planner can help you get RESULTS: https://t.co/JhHutYSw1c https://t.co/VDKoyVz19n 2019 is just around the corner. Start it RIGHT with a plan for your money. \n@EveryDollar is the best budgeting tool on the planet. \nGet the app and start your FREE budget today: https://t.co/Z5kVOWm8qf Our ebooks and audio books make the perfect last-minute gift. \nCheck em out! - https://t.co/o1GSQRJ79t https://t.co/gjpje5VS5X Awesome @EntreLeadership podcast this week. It's a Q&amp;A on personal development to round out 2018. Check it out: iOS: https://t.co/glvePq0UiE Android: https://t.co/foi1IfB9ko “But the angel said to them, \"Do not be afraid. I bring you good news of great joy that will be for all the people.” — Luke 2:10 Just because you haven't finished Christmas shopping yet doesn't mean you can't get a good gift. \nSkip the mall &amp; the overnight shipping and grab some of our best digital gifts: https://t.co/7H8JROpBNm https://t.co/cXSx7ZTgSj Generosity is the cornerstone of those who build wealth and are healthy. ALWAYS be a giver to win at life and money. Financial Peace University is the plan that has given hope to MILLIONS. \nHop on board and see what all the WINNING is about: https://t.co/0bFpKzQXN0 https://t.co/GhO4pdmHsZ Save on wrapping paper this year and give some of our awesome digital gifts! Check em out: https://t.co/ALY3I7pQ9J https://t.co/zAFFTsAh8T Just a few days left until Christmas! \nThere's still time to pick up some of our best deals for everyone on your list: https://t.co/8ud5K4hnts https://t.co/FY17MaMkW4 YOU are the boss of you. Not anyone else. \nLoved the latest @EntreLeadership podcast featuring my friend, @ThisIsSethsBlog. Don't miss it. \n\niOS: https://t.co/glvePq0UiE Android: https://t.co/foi1IfB9ko https://t.co/7LZqr03WNM The American Dream is not dead. YOU can become a millionaire, and Chris Hogan's new book, #EverydayMillionaires, will show you how: https://t.co/961tF4N2JF https://t.co/y7uGNykDeG I LOVE Christmas! It makes me sappy, sloppy emotional. The least little thing makes my eyes leak almost every day this time of year. https://t.co/ZVLjYkzMqx RT @RamseyShow: Now you can listen to The @DaveRamsey Show and other Ramsey podcasts on the @PandoraMusic app! Check it out: https://t.co/j… Wealthy people don't just win with money, they protect it too. \nMake sure you're covered where you need to be no matter what your net worth is. \nTake our FREE coverage checkup: https://t.co/ip68XY4WrL The Total Money Makeover is my playbook for ANYONE to learn how to kick debt to the curb and win with money. \n\nRight now it's just 10 BUCKS: https://t.co/vK0d9f8gvy https://t.co/4f9HaDPAQG Shared goals are POWERFUL things. Find out how having one helped 2 leaders become millionaires on the latest @EntreLeadership podcast iOS: https://t.co/glvePq0UiE Android: https://t.co/foi1IfB9ko https://t.co/iReWyanb4p Leave the gift cards at the store. Gift like no one else this year: https://t.co/u0X8olzVpn https://t.co/eMLcWeufht We're just a few weeks away from the release of @ChrisHogan360's awesome #EverydayMillionaires book! \n\nHe'll be touring the country to meet YOU. \n\nCome out to a signing event in your area: https://t.co/Sp2KyIj1sK https://t.co/fUhpesN56J We surveyed over 10,000 millionaires to find out how they got there. The results might surprise you... Preorder @ChrisHogan360's #EverydayMillionaires to find out: https://t.co/Pz7PFnx4v7 https://t.co/CSe01sIS1m December 15th is the deadline for open enrollment in health insurance plans for 2019. \n\nIf you haven't squared things away yet, get in touch with an agent you can trust to get you the best deal on the coverage you need: https://t.co/z78nuSbeAR The worst car accidents happen on the showroom floor. A new car loses 60% of its value in 4 years. 28k becomes 11k. GREEN MONDAY ALERT: There's only a few hours left of this made-up holiday. \n\nGet some REAL deals on gifts that will make a difference in someone's life: https://t.co/7UZLtAE1v8 \n\n#GreenMonday https://t.co/JPoWAiuMgG love it! https://t.co/fwS7kXy0mk RT @bryanmeeker: I’m floored. Dave treated EVERY SINGLE TEAM MEMBER to a $1,000 shopping spree! Unbelievable! #RSCP18 #RamseyChristmas http… Merry Christmas!! https://t.co/bapm6aUtAB RT @krishammons: No one loves on his team like @DaveRamsey does. NO ONE. So thankful to be a part of this team. #rscp18 https://t.co/LuZf6t… RT @NickDafni: Still can’t believe I get to work at a place that changes lives everyday.  @DaveRamsey gave everyone in the company $1000 ca… Thanks for all your hard work! Merry Christmas! https://t.co/TefLkpaXrD Awesome. MERRY CHRISTMAS! https://t.co/P7Czday3bU Yep. THAT just happened. Merry Christmas! https://t.co/4HLleD7Kfy RT @kellyshrout: #ramseychristmas oh, just another work day at Ramsey Solutions... $1,000 Christmas shopping spree for entire company #work… You all deserve it. Merry Christmas! https://t.co/w2FJli5NVJ RT @curtharding: I never knew a workplace could be so generous and caring to its team. Ramsey Solutions is truly the greatest place to work… You’re welcome! 🎄 https://t.co/aB6Qj9jfqH RT @jasonhjarrett: Normal day of work suddenly shifted to getting on a chartered bus heading to the mall for a cash shopping spree! Thanks… YEP 🎄 https://t.co/b80USDSE6R MERRY CHRISTMAS! https://t.co/BCi0o4za3G RT @kellyshrout: #ramseychristmas so ... this morning in staff meeting Dave suprised the entire company with a $1,000 shopping spree. He ha… RT @KAlexStrickland: Currently on a charter bus on the way to Green Hills Mall in Nashville! Dave just surprised us with a $1,000 shopping… RT @DevWithPurpose: This morning we were told to cancel all meetings! @DaveRamsey and the Board are giving all 800 team members a $1000 sho… RT @DevWithPurpose: Let the fun begin! #RamseyChristmas #RSCP18 https://t.co/Zd4CQQMfnH It’s Christmas time at Ramsey Solutions! Giving each of our 800 team members $1,000 CA$H and bused them to the mall. SO FUN #rscp18 #ramseychristmas https://t.co/E2DRuopxBE It's Green Monday. Whatever that means... For us, it's a good excuse to give you more deals on our best products to help you WIN with money. \n\nGrab some #GreenMonday deals: https://t.co/2Ua6oyHwU4 https://t.co/HLKcUyf6oC Got a goal? Write it down. Need some help? Here it is. \nGrab a copy of @ChristyBWright's #BusinessBoutique 2019 Goal Planner for yourself or as the perfect gift this year: https://t.co/KVgmUwXTZ9 https://t.co/YrmTir827u Timeshares are horrendous. If you have one and you’re tired of being stuck in it, get in touch with the only company I trust to help you exit for good: https://t.co/UUb3WHwsL1 “Do not be conformed to this world, but be transformed by the renewing of your mind.” — Romans 12:2 So many times in life, Fear raises its ugly head, and we have the choice to quit or the choice to embrace The Glorious Dread and live life big. https://t.co/vmHfPwxq1d I LOVE millennials. I've hired a lot of them. If you're struggling to understand how to lead this younger generation, look no further than the latest @EntreLeadership podcast. iOS: https://t.co/glvePq0UiE Android: https://t.co/foi1IfB9ko 78% of households live paycheck to paycheck. Quit living like that. \nFinancial Peace University will show you how to save, pay off debt, and finally stop worrying about money: https://t.co/IkaAC58RY8 Real results defeat the haters. Keep pushing forward. You got this. Way to go teach! Way to go Jackson. Young lives are learning Financial Peace!! We can change a generation together!! https://t.co/mdKRfJHExp You can do this Nikki. Proud of you! It is very hard, but very worth it. https://t.co/cWQmGx2qZY Over 93% of millionaires in the US are first-generation rich. \nThey started with nothing and won. \nYOU can do it too. \n\nLearn how from @ChrisHogan360's new book, #EverydayMillionaires. Available to preorder now: https://t.co/eSAKgdmvIS https://t.co/QDpwyGwdDG “The price of greatness is responsibility.” - Winston Churchill My talented Cuz wins big with cartoon from the heart that touches all of ours. Proud of my Cuz. https://t.co/AxSbiaqlZH Time is running out to take advantage of our Cyber Monday Week Sale! Check out the EPIC deals on our best books and tools for everyone on your list. https://t.co/6CivGaoPfQ https://t.co/63J0nw6gEZ @USATODAY @MarshallRamsey Cuz at it again. Well played RIP President Bush. A kind servant of great character. Another huge data breach announced today. These are becoming way too common. Protect yourself and your information before it's too late. https://t.co/CJx0fYSqbJ Give a gift that will spread HOPE this Christmas. \nWhen a family takes Financial Peace University, there’s an average financial turnaround of $8,000 in the first 9 weeks. \nThat kind of momentum changes everything: https://t.co/PBKtepi5bC https://t.co/xMKNkrSSQH You don’t win because of the government.  You win because of YOU. What if you NEVER had another debt payment again? It's possible. NO really, it is. \nStart your journey to debt-freedom TODAY: https://t.co/aAmyz1NscQ https://t.co/SijLPHzURd Debt is DUMB and Cash is KING. Especially at Christmastime. \nEnter our Ramsey Christmas Giveaway and make your season a little merrier https://t.co/FwF7tHEQHS https://t.co/E2r6n14V6e Goals are dreams with work boots on. Budget-friendly gifts don't have to suck. \nCheck out our awesome Cyber Monday Week deals: https://t.co/OBphiVIuwh https://t.co/qRenKNaIxm RT @RamseyShow: Dave’s LIVE on air now with @TimTebow!\n Watch live: https://t.co/J5FuZpswtL https://t.co/0Bri3LeWhS RT @RamseyShow: We're excited to have @TimTebow  join @DaveRamsey LIVE in-studio today in the 2PM CT hour of the show. \n\nCatch it live on o… You've got enough to worry about. Protecting yourself &amp; your family shouldn't be on the list. \n\nMy team created an easy coverage checkup to tell you exactly what you need for your situation: https://t.co/ITxaPVsoqh https://t.co/ay9AgRMMgc Leaders: If you're looking for some motivation, THIS is it. The latest @EntreLeadership podcast is full of the best moments from our EntreLeadership Summit event over the past several years. Good stuff.\n\niOS: https://t.co/glvePq0UiE Android: https://t.co/foi1IfB9ko https://t.co/SZWvM6Covh If you want to do something, it's smart to take hints from people who've already done it. \n\n@ChrisHogan360's NEW book, \"Everyday Millionaires\" is based on the largest study of millionaires EVER. \n\nPreorder it today and be on your way to becoming one too: https://t.co/ZB3LY3ofXC https://t.co/jqqnhDD71f Happy Cyber Monday! Click on some gifts that won't collect dust. Shop our sale for the best tools and products to help the people on your list beat debt and WIN with money https://t.co/VmeUQ61Keu https://t.co/sVflfQ8YZp There's still time to get the biggest deals of the year on gifts that actually make a difference in someone's life. \n\nCheck out our extended Black Friday deals: https://t.co/1GCMKaruz4 https://t.co/fIGPpWRtj6 Aunt Nancy doesn't need another gift card this year, she needs to get out of debt. Get her the gift of a plan this #BlackFriday: https://t.co/HBpW8WkxU8 Our best books and tools are at their lowest prices of the entire year. #BlackFriday - DON'T MISS THIS: https://t.co/xcOsuBlHE3 https://t.co/eDH0zgaUDM Avoid the lines and the wasted money today. \n\nStay home and stock up on gifts that inspire. Check out our HUGE Black Friday deals https://t.co/WT0xHXUoL5 https://t.co/necMMeN57H Give a gift that MATTERS this year. We've got Black Friday deals in our online store all week long. Check em out https://t.co/Rt0cprtH5s https://t.co/XdvAhbeihd Every Family has CRAZY in it. And if you think yours doesn't then it might be YOU. :) Check out Karen Moore's new book ...What a Great Word...you will love it. https://t.co/GTvBkMTjqw We're giving away CA$H this Christmas season! Don't miss your chance to enter the Ramsey Christmas Giveaway https://t.co/hsXcE6ovG3 https://t.co/WCyRye2YBZ If you think leadership has anything to do with your title, you're wrong. Find out the truth from @ChrisHogan360 on the latest @EntreLeadership podcast iOS: https://t.co/glvePq0UiE Android: https://t.co/foi1IfB9ko Wow...congrats to our friend @mrBobbyBones winning DWTS!!! What an amazing couple of years you have had. So proud of you sir. Hope is when the light at the end of the tunnel is not an oncoming train. https://t.co/olKzgaWFRR Good habits start early, so make learning about money FUN with our awesome gifts for kids of all ages https://t.co/RM9NFo0cIU https://t.co/y9dIQDbads The famous $10 sale is BACK. There's nothing better than a gift that will encourage and inspire someone to change their life. https://t.co/jDUii7FU9c https://t.co/mzAcjIkhYp People who win with money don’t overpay on their mortgage. If you're paying too much, refinance with the only people I trust to help you do it right: https://t.co/zvy22UqoIA LIVE NOW from our Smart Money Event in San Antonio, the money advice that all of America needs to hear. https://t.co/LGeq4FhVpP Last call to join the fun at Smart Money tonight w/ me and @ChrisHogan360. Get your tickets to watch the full event: https://t.co/e3rPugUU5P https://t.co/ginrjbybIp What you can conceive and believe, you can ACHIEVE. Finding the right home takes more than a google search. Get in touch with an agent you can TRUST to find what's right for you. https://t.co/lCaCqOhiVO Cash is KING! Take control of your money with great deals on our envelope systems. https://t.co/QtRNg42Tbr GREAT discussion on the importance of avoiding burnout in this week's @EntreLeadership podcast with @the100mileman. \niOS: https://t.co/glvePq0UiE  Android: https://t.co/foi1IfB9ko. $500 a week and a $5,000 grand prize. WOW. Enter here: https://t.co/EFag7mAp0C https://t.co/KIfKnZaFz4 Salute to my uncle Dave and my namesake. https://t.co/c90ze7wMtI Man that @scottharrison had me laughing and crying. World class talk. https://t.co/yecFVHHIo4 You guys have your best team in years. Good luck with the rest of the season. https://t.co/V1Rd3040U0 Get your shopping done early this year and give a gift that will make an impact. There's something for EVERYONE on your list in our online store: https://t.co/7DuU0ZHXhm https://t.co/es4F8s0EPp No matter where you're at with money, you need 10-12 times your annual income in TERM life insurance. \nThis is the best way to secure your family's future in case the worst happens. \nDon't go another day without it: https://t.co/LKtjn8aFvl People tell me all the time they wish someone had taught them how to handle money sooner. Let's change that for the next generation. We’ve got great gifts for kids to make learning about money FUN: https://t.co/p0Pzq7z2NX https://t.co/epYEkRZCST Want a little extra room in your Christmas budget this year? \nEnter our Ramsey Christmas Giveaway: https://t.co/qCWietsfpg https://t.co/ilbsV6f5sC “Those who have never made a mistake usually work for those who have.” – Henry Ford The $10 Sale is back! Pick up some of our best-selling books and products for just 10 bucks. Don't miss this: https://t.co/M4CTTddBTu https://t.co/Vg6cB6XJLF Yep, it's Monday. It comes around every week and if you hate it, it's probably time to find a job you LOVE. \n\nGet expert career advice from The @KenColeman Show.\n\n iOS: https://t.co/AkOyy2dSjZ Android: https://t.co/3ZaqPoUnYb https://t.co/SSrnwNMp0m We’ve got some AWESOME new products just in time for Christmas. Great gifts - check em out! https://t.co/kB37kc56zV https://t.co/crLGRa2LI5 Gratitude is highly attractive. Choose to be thankful. Is the glass Half-Full or is it Half-Empty? \n\nYou get to decide. \n\nhttps://t.co/AgVMV7K9Aq LOL. that is a mock up cover wrapped on another book for display purposes. Promise to ship first week of JAN. https://t.co/lEQIWQ4iug We're giving away CA$H this Christmas!🎄\nEnter daily for your chance to win: https://t.co/lIb8FUtyX4 https://t.co/2KTGCDd1XO Ordinary people CAN and DO build extraordinary wealth. @ChrisHogan360's new book will show you how. Preorder #EverydayMillionaires NOW: https://t.co/qhqXMNh0V1 https://t.co/j8UIVSjpQs RT @ChrisHogan360: I'll be on @MorningsMaria tomorrow morning at 7:50 AM ET to talk about money statistics that should scare you more than… Loved speaking with business leaders at our recent @EntreLeadership Master Series event in Nashville. Check out the latest #EntreLeadership podcast recorded live from the event iOS: https://t.co/glvePq0UiE Android: https://t.co/foi1IfB9ko Smart folks don't just win with money, they protect it too. Make sure you're covered where you need to be. Take our FREE coverage checkup: https://t.co/ip68XY4WrL Honored to be in Minnesota to speak at @eaglebrookmn this weekend. Come visit, church is FREE. Hey Minneapolis! Speaking @eaglebrookmn Eaglebrook Church both services this morning! Join us! #ChurchIsFree Headed to the Twin Cities in Minnesota to speak at @eaglebrookmn's services this weekend. I'll be at the Lino Lakes Campus. Join us! Church is FREE. LOVE what @scottharrison and @charitywater are doing to change the world. Catch his story on the latest @EntreLeadership podcast. Excellent info on connecting with your customer in a unique way. \n\niOS: https://t.co/glvePq0UiE Android: https://t.co/foi1IfB9ko https://t.co/K3ZgctKX51 RT @RachelCruze: We may be among the wealthiest countries in the world, but our latest study reveals the role that debt plays in our lives.… Christmas is right around the corner, but there's still time to save for a holiday that doesn't follow you into the new year. \n\nSign up for our Christmas Jumpstart: https://t.co/3iiYiyWRkX NEVER invest in something you don't understand. Get a professional on your side to show you what's right for YOUR situation, not their bottom line.\n\nGet started by contacting one of our trusted SmartVestor Pros: https://t.co/IHXFTAfeV7 Small business owners: Don't go it alone when it comes to taxes. Make sure you've got a pro in your corner to help you do things right. \n\nOur Endorsed Local Providers can help: https://t.co/QFuDx9bKEu It's National Save for Retirement Week. \n\nWe're celebrating with an all-new bundle. Preorder @ChrisHogan360's #EverydayMillionaires book and get his #RetireInspired audiobook for just $30 - https://t.co/QoP8xqE4TU \"Interest you pay is a penalty. Interest you earn is a reward.\" - @ChrisHogan360 Learn how to harness the power of compound interest on the latest episode of The Chris Hogan Show podcast. \n\niOS: https://t.co/m18IcEztFK Android: https://t.co/GbPNK6PTSZ. Don’t be a spectator of your life. Go all in. RT @ChrisHogan360: Don't let where you live destroy your dream retirement.\nhttps://t.co/peAvfvd8Jh Thanks Cuz. Love ya man. https://t.co/E91bD9HlB7 You can't get where you want to go without a VISION for what that looks like. Don’t miss this week’s @EntreLeadership podcast with @DrHenryCloud. \n\niOS: https://t.co/glvePqivac Android: https://t.co/foi1IfSKbW You guys rocked it Chris!!! Love working with you. https://t.co/oz7RkJDxNo WOW. #KansasCity Awesome day at Smart Conference. Thanks for having us! #smartconf https://t.co/aZR75gYoVd RT @DaveRamseyLIVE: \"Relate to your kid where THEY are, not where YOU are.” - @anthonyoneal #SmartConf https://t.co/e82AoZW5C4 RT @AnthonyONeal: \"The best way to keep kids out of trouble is for them to be connected with their parents.\" \n👏🏾 great words from @megmeeke… Awesome Smart Conference today in #KansasCity! If you’ve never been to one, join us in Dallas this coming January. \n\nGrab your tickets today: https://t.co/S9MbldhNCT  \n\n#smartconf https://t.co/lMIeMLLU72 RT @DaveRamseyLIVE: \"Your past does NOT have to dictate your future.\" - @rachelcruze \n\n#SmartConf #Motivation https://t.co/xPx8gcYspY RT @DaveRamseyLIVE: “The antidote to fear is ACTION.” - @ChristyBWright #SmartConf https://t.co/vpsP0aqRzU RT @DaveRamseyLIVE: \"Every human being needs to answer this question: Why am I here?\" -@KenColeman with the mic drop. #SmartConf https://t.… RT @ChristyBWright: \"Someday isn't on the calendar.\" - @ChrisHogan360 #SmartConf RT @DaveRamseyLIVE: We're so excited to kick off #SmartConf in #KansasCity!! \n\nIf you're here with us today, follow along and check in thro… Good morning, #KansasCity  Ready for a great day at the Smart Conference. Let's do this! #SmartConf RT @DaveRamseyLIVE: Gearing up for Smart Conference in #KansasCity tomorrow! \n\n#SmartConf https://t.co/vvoItInyAi There are enough things to worry about. Protecting yourself and your family shouldn't be one of them. \n\nMy team created an easy coverage checkup to tell you exactly what you need for your individual situation: https://t.co/fGx49wwqPZ https://t.co/c7lGlTuaAM RT @ChrisHogan360: Don't miss my talk this Saturday at Smart Conference! I'm streaming live to remind everyone that YOU can be an Everyday… Most millionaires have NEVER made 6 figures in a year. Seriously. Find out more truth in @ChrisHogan360's book, #EverydayMillionaires. \n\nPreorder today: https://t.co/65ad3EuwqS Limited resources don't have to equal limited RESULTS. Great @EntreLeadership podcast this week ft. @bobbygwald \n\niOS: https://t.co/glvePqivac Android: https://t.co/foi1IfSKbW Learn how to make your business stand out from the competition with solid advice from @ChristyBWright on the #BusinessBoutique Podcast \n\niOS: https://t.co/SRcrZejxmV \n\nAndroid: https://t.co/PIhfp4iyzH It's way too early to decorate for Christmas, but it's NOT too early to plan for it. \n\nUse our FREE Christmas Jumpstart to get your savings on track this year: https://t.co/zcGTYGDfJN Life's too short to have a job you hate. Find out how to make your dream job a reality with advice from The @KenColeman Show \n\niOS: https://t.co/AkOyy2dSjZ \n\nAndroid: https://t.co/3ZaqPoUnYb Success does not happen overnight. You win with excellence in the ordinary. RT @RachelCruze: Can't wait to be on @hallmarkchannel's @homeandfamilytv in the morning! I'm talking about the best way to handle money in… WOW. There's now over 5 MILLION people making a plan for their money with @everydollar! \n\nIf you're not one of them, get started for FREE today https://t.co/bB7gMkWJfa Sometimes innovation looks like common sense... \n\nGREAT @EntreLeadership podcast ft. @cduhigg. Don't miss it.\n\niOS: https://t.co/glvePqivac Android: https://t.co/foi1IfSKbW The mortgage rate you signed up for doesn't have to be the one you keep. Get in touch with the people I trust to find out how much you could save. https://t.co/H76lZAm4KP Your future is up to YOU. \n\nGet advice on how to plan for it from @ChrisHogan360 on the latest episode of The Chris Hogan Show\n\niOS: https://t.co/m18IcEztFK Android: https://t.co/GbPNK6PTSZ You can now listen and watch @RamseyShow anytime and anywhere.\n\nDownload the app today: https://t.co/atI0lsGffq https://t.co/6GevMW9sea Well, there's a holiday for everything now. Happy #InternationalPodcastDay, everyone. \n\nOur Ramsey podcasts are some of the BEST. I'm a little biased, but I'm also right. \n\nGet them all in one place: https://t.co/J8x22GcCQg Thanks for coming https://t.co/yKfnwqsCQT Thanks so much https://t.co/Pcwh6zulWa Thanks so much https://t.co/eWOMIxHxa1 It is interesting to me that the most fun and reward I have ever had was when I embraced the fear, held it close, and tried something I was not sure would work. https://t.co/LBo2FiNbPt New FM in Nashville! https://t.co/S14qsNlW5A We're bringing the Smart Conference to #KansasCity on October 13th! Just a couple weeks left to grab your ticket. Don't miss this! #SmartConf https://t.co/0j7wfUsyAJ Had a great time joining @ChristyBWright on her podcast. Listen in to learn how to be intentional in your life and your work.\n\n iOS: https://t.co/SRcrZejxmV Android: https://t.co/PIhfp4iyzH RT @RamseyShow: Hey #Nashville - Learn how to win with money on your drive home! Catch The @DaveRamsey Show on TalkRadio 98.3 FM weekdays 5… It's hard to find someone who hasn't had their information compromised. Protect yourself and your family from identity theft: https://t.co/3S1WyoFhSH If you're #debtfree with a 3-6 month emergency fund in place, it's time to make your money work for YOU. Get a trustworthy Pro on your side to help you invest in what's right for you: https://t.co/jJXPUJxbwY Christmas isn't a financial emergency. It's in December again this year—be an adult and plan for it! \n\nMy team has put together a FREE guide to help you start saving cash NOW: https://t.co/hMnoDtpcFN Growth equals change. \n\nGreat advice on how to adapt a growing business on this week's @EntreLeadership podcast  \n\niOS: https://t.co/glvePqivac Android: https://t.co/foi1IfSKbW Its football time in Tennessee!!!! https://t.co/A1pifFf2qV Amen Pastor Chris...love it https://t.co/DW7cvmuQBI 30 years ago tomorrow marks the day I went bankrupt... https://t.co/rAIrzooJyr RT @ChrisHogan360: Pumped to join @TeamCavuto today to discuss how the current financial climate will impact YOUR retirement plans. \n\nTune… If your job was to manage money for YOU, Inc. And you managed money for YOU, Inc, like you manage money for you. Would you fire you? Love my city. Nashville https://t.co/wzkUJrB4Y8 Most of the time it is Gross, before taxes. https://t.co/BknSn9qWe3 Tax season lasts all year if you own a business. Trust an expert to help you do things right so you can spend more time working ON your business instead of IN your business: https://t.co/cj3gGZu32r Term only. I do not own nor recommend any kind of Cash Value Life Insurance ever. https://t.co/iqN85k8GQS You become who you hang around with. That can be a good thing or a bad thing. \n\nIf you want to win with money, join our official Facebook community and start making progress in your debt-free journey! https://t.co/zjkABRaRg2 SO fun. Excited to have @mikeroweworks on @RamseyShow today https://t.co/EId63fW3CI Millions of Americans say they would borrow from their home's equity to pay bills. @ChrisHogan360 would say, \"THAT'S NOT OKAY.\" Get his advice on @MorningsMaria around 7:30AM ET Wow! It's been 15 YEARS since we first released The Total Money Makeover. To celebrate, we're offering it at a huge discount + giving you FREE access to our Smart Money event livestream in November: https://t.co/JqmsyLCjbT https://t.co/Zz5ETIPAkF Thanks for coming. It was a stellar weekend https://t.co/t66Q1b1xIP Wow!! Congrats.  So proud of you https://t.co/0UmCip4oNf The ability to communicate well both inside &amp; outside of your business is what will set you apart from the pack in a way that nothing else can. Find out more on the latest @EntreLeadership podcast. iOS: https://t.co/glvePqivac Android: https://t.co/foi1IfSKbW Hey Orlando. Got Church Plans this morning? I am here speaking both services at First Baptist Orlando @FirstOrlando this morning. Join us! Church is Free LOL...actually I did buy lunch, but John bought the expensive dinner the night before. Three characters fighting over checks. https://t.co/LSPUWmFUIV Yea, that's me with two American Leadership Icons. Wow. Can you see me pinching myself. https://t.co/DISVAvhR51 You don't have to make six figures to become a millionaire. Really, you DON'T. Find out more from @ChrisHogan360 on latest episode of The Chris Hogan Show. \n\niOS: https://t.co/m18IcEztFK Android: https://t.co/GbPNK6PTSZ Our team put together the largest study of millionaires EVER. Find out what they discovered in @ChrisHogan360's new book, #EverydayMillionaires. It's available to preorder NOW: https://t.co/4sO1Hk2r8j Save time &amp; money in your business by hiring the RIGHT people the FIRST time. Find out how with awesome advice on the latest @EntreLeadership podcast. iOS: https://t.co/glvePq0UiE Android: https://t.co/foi1IfB9ko Yep https://t.co/SogP9Q5JLe Wow....I had forgotten The Great Emu movement. Classic https://t.co/jWYZMIqLoq NEVER invest in something you don't understand. Get a trusted Pro on your side with the heart of a teacher to help guide you: https://t.co/3LGsm6re9k If you dread going to work today, The @KenColeman Show is for YOU. Get the advice and inspiration you need to help you find a career you actually enjoy.\n\niOS: https://t.co/AkOyy2dSjZ Android: https://t.co/3ZaqPoUnYb Hey Orlando, I will be speaking at First Baptist Orlando @FirstOrlando  Saturday night and both services Sunday. Join us! Church is Free You don't have to take this debt-free journey alone. Get connected to our OFFICIAL Facebook group for free advice, community, and motivation! https://t.co/zjkABRaRg2 Buying or selling a home isn't easy. It's important to have someone in your corner to help you get the best deal possible: https://t.co/NAh8uJXpJX I am one of the generations that knows what the face of evil looks like. 9-11. Never Forget. God Bless America Its football time in Tennessee https://t.co/XVpIl2YEZv Insurance is necessary, but overpaying for it isn't. Get in touch with one of our recommended Endorsed Local Providers in your area to get the best coverage at the best price for YOU: https://t.co/TUqdZURGUi Smokey and the Bandit are both gone. RIP Burt Reynolds. Nobody cares about identity theft until it happens to them—and then it's too late! Get the coverage I personally have and recommend: https://t.co/ssMzFgG277 Honored to have you sir. You did great as always. A world class communicator. https://t.co/4bqNbTkw9z Creating your first budget will make you feel like you got a raise. Quit wondering where your money went and make a PLAN: https://t.co/RoBIKwM5Ul Great news....I am miraculously recovered. The Bee is funny stuff. Well done guys. https://t.co/zBmVa2Mj6o Mental toughness is key to winning in your life and business. AWESOME @EntreLeadership podcast this week featuring advice from Navy SEAL, @MarkDivine.\niOS: https://t.co/glvePq0UiE \nAndroid: https://t.co/foi1IfB9ko Yep https://t.co/w72x1NKVvk Yea, we did a barefoot ski run on it yesterday. Smooth water makes my feet tingle. https://t.co/MBM6fNUAD4 Rufus says this is the proper way to start Labor Day. https://t.co/tWjRfxPwlc @Kat1258i831 Thanks Kat, and thanks for the card https://t.co/trthsAxfin Save time and money when buying or selling your home by using a trusted expert with a proven track record of success: https://t.co/iBzmSWutXF With great power comes great responsibility. . . https://t.co/pzQMGxaQTW You work too hard to be broke! Financial Peace University is the hope and plan you need. Join today and take the course with a group OR online on your own schedule: https://t.co/Xtne4WT3XH Yep, see ya soon my friend. https://t.co/ZZF4JPaRDD People with a shared goal can accomplish ANYTHING. Join our Ramsey Baby Steps Facebook group for the community and motivation you need to help make your goals a reality: https://t.co/7aqDI6RiWN If you own a business, taxes don't just come around once a year. Stay on top of things with a PRO on your side: https://t.co/kMH44StA1v Truth https://t.co/sUtQ6Tcrbu No Charles it is your humility we love my friend. LOL https://t.co/D8LehQUMl5 Last chance to enter our Millionaire Kickstarter Giveaway! https://t.co/9rsE8G3dp7 https://t.co/RPK3P33XFU 8 in 10 people know someone who's been a victim of identity theft. Stop taking chances. Save yourself the headache and get protected https://t.co/MtIAYtE33A Perfect. That is how it is supposed to work. Glad you are winning. https://t.co/af6MvB3GsA oh crud....messed that one up....coming back with correction....thanks for help. https://t.co/Hp1Lm2n2xm Wow. https://t.co/ys2kZI7c8b Easy to understand. Not easy to do. https://t.co/bbLcRFutH6 Love it https://t.co/N79Qf2XwUE FINANCIAL PLAN: Live on less than you make and don't owe people money. 😲 It's time to get out of debt and quit worrying about money. Your future matters too much to wait another day: https://t.co/M79joF9qco https://t.co/z9nyaIej6f Starting a business is easy, but running one is another story. Don't miss this week's @EntreLeadership podcast ft. @ChrisHogan360 \n\niOS: https://t.co/glvePqivac\nAndroid: https://t.co/foi1IfSKbW Love it!!! Way to go DAD!!!! https://t.co/L5NgFhRZ9x You could be on your way to millionaire status quicker than you ever thought possible with Financial Peace University + Chris Hogan's book, #EverydayMillionaires https://t.co/6TmgYUBznt https://t.co/QIUTKmsl5R Life's too short to hate your job. Listen to The @KenColeman Show for all the career motivation you need to find a job you LOVE. \n\niOS: https://t.co/AkOyy2dSjZ\nAndroid: https://t.co/3ZaqPoUnYb Yea, Too many people with no class and digital courage. https://t.co/fBKu9rWmlJ Wow!! Congrats! That is the way to celebrate! https://t.co/xU9RqBLtz5 RIP John McCain. A National Treasure. Courageous, Resilient, and Loved his country. Men like him are too rare. Everyone needs a will. Leave a legacy for your family, not a burden. Learn more from @ChrisHogan360 on @WeekendExp tomorrow around 7:15AM ET LOL...all seven year olds should have a jam https://t.co/c8v3a6NXJz We're giving away $5,500 to 2 winners this month to celebrate @ChrisHogan360's #EverydayMillionaires book! Kickstart your chances to win: https://t.co/hF3sGb4jWM If you're not making a plan for your money each month, you probably won't have much left at the end. Grow up and start budgeting with @EveryDollar: https://t.co/xibX9YQC1J yep https://t.co/vVSUsafViU The majority of millionaires have NEVER made 6 figures in one year. Seriously. Find out more truth in @ChrisHogan360's new book, #EverydayMillionaires. Available to preorder now: https://t.co/rTN8wvKkvf Glad we could help https://t.co/4kY7nKDp2z Ok, now THAT is funny https://t.co/TqI50Q4GEo And he is a GREAT web dev. https://t.co/bjKV8hsKRg RT @EntreLeadership: Your why matters more than all the good ideas in the world. Great interview with @KenColeman and @DerekLidow on this w… If you listen to me why are you OPENING Credit card accounts. You are supposed to be closing them. https://t.co/x9qVGGzkMN Living healthy on a budget isn't as hard as people make it seem. @RachelCruze will show you how on the latest episode of The Rachel Cruze Show: https://t.co/aBMMoml6N6 Wow!!!! Very impressive!! Very proud of you man!!!! https://t.co/XkZO8IZ3ft Pumped to see @ChrisHogan360 share expert retirement advice this morning on the panel for @MorningsMaria on @FoxBusiness from 6-9AM ET. Don't miss it. Life doesn’t have a remote. Get up and CHANGE the channel… \n\nhttps://t.co/GT6Dd4tofD Catch @ChrisHogan360 on @TeamCavuto around 1:30PM ET. He's got advice on how to avoid the financial mistakes of the past and WIN in the future. If you want a big net worth, you've got to define your goals and how you're going to get there. @ChrisHogan360 has the plan you need on the latest episode of The Chris Hogan Show. \niOS: https://t.co/m18IcEztFK Android: https://t.co/GbPNK6PTSZ No matter what hurt you’re facing, there’s HOPE. \n\nMy friend, @craiggroeschel's newest book, Hope in the Dark, releases TODAY! It’s going to encourage so many. \n\nGet your copy here:  https://t.co/aZcmU6D6nr Happy Anniversary my Friends! https://t.co/iJZKZzL8vF Think millennials can't reach millionaire status? THINK AGAIN. Catch @ChrisHogan360 on @foxandfriends around 6:45AM ET to find out how. The kids shouldn't be the only ones learning this fall. It's time to find out how to WIN with money. Financial Peace University will show you how: https://t.co/BtKx00klmn Yep https://t.co/9RFhZctBKh We're celebrating @ChrisHogan360's new book, Everyday Millionaires, with a HUGE giveaway. Don't miss your chance to enter: https://t.co/gv8DxiucCM https://t.co/ZWW9NJAZdd The best companies are the ones that solve problems for their customers. Learn how to be a solution in the marketplace with advice from the latest @EntreLeadership podcast. \n\niOS: https://t.co/glvePq0UiE\nAndroid: https://t.co/foi1IfB9ko RT @RachelCruze: Being healthy doesn’t have to break the bank!\n\nhttps://t.co/n1H0AIxnMa The bad news: you're the problem. The good news: you're the solution. Take control of your money with Financial Peace University &amp; make today the last day you spend wondering what's next: https://t.co/QQq6FlKN9Q RT @RamseyShow: Listeners on @SIRIUSXM: You can now listen to The Dave Ramsey Show weekdays on Channel 121 at 3PM ET and on Channel 111 at… 2 out of every 3 millennials have nothing saved for retirement. If that's you, take charge and make a change with advice from @ChrisHogan360 on @FoxBusiness @MorningsMaria around 7:20AM ET The American Dream is not dead. YOU can become a millionaire, and @ChrisHogan360's new book, Everyday Millionaires, will show you how. Preorder it today: https://t.co/5BtjxkDiXr https://t.co/iFs7feY6dZ Matt &amp; Jodie have been living like no one else to pay off debt, and @RachelCruze got to surprise them last night. Now, they can live and give like no one else even sooner than they thought. SO FUN https://t.co/pdLUErGzm3 Identity theft protection doesn't prevent your personal information from getting stolen, but it DOES clean up the mess if it happens. Don't go another day without it: https://t.co/1KDw4yys0C In honor of @ChrisHogan360's new book, Everyday Millionaires, we want to help kickstart YOUR track to millionaire status. \n\nEnter for your chance to win: https://t.co/Vi3MhRLWA3 https://t.co/ytrRJfP18A If you think investing and retirement sound boring, you've never heard @ChrisHogan360 talk about them. Start listening to The Chris Hogan Show today.\n\niOS: https://t.co/m18IcEztFK  \nAndroid: https://t.co/GbPNK6PTSZ Discovering the place where your talent and passion meet is the KEY to a fulfilling career. Get expert advice on how to find it on The @KenColeman Show.\n\niOS: https://t.co/AkOyy2dSjZ \nAndroid: https://t.co/3ZaqPoUnYb Your dreams are on the other side of your decisions. Learn to start making the right ones with Financial Peace University, AND you'll get @ChrisHogan360's NEW book, Everyday Millionaires. \n\nDon't miss this EPIC deal: https://t.co/ZeCxwgcLpa https://t.co/fiyKsLnxYL Giving is the MOST fun you can have with money, and we’re having FUN this month. \n\nDon't miss this: https://t.co/55MsqQcAuk https://t.co/1MOoUQd9Yv Some folks think it should be easy to win. That’s a dumb idea… \nhttps://t.co/npeS9RDdxi Congrats my friends! Zig Ziglar said, \" I dont respect a man who didn't marry UP, and I deeply respect you!\" https://t.co/AbqBFi44ts Amen Cuz. The only good news is someday they bring back GrandBabies! https://t.co/aTKzYl2QVP Yep, @RachelCruze is my daughter. #ProudDad https://t.co/75SiQXKz6H Fear has stopped too many people from going after their goals. Learn how to kick fear to the curb on the latest @EntreLeadership podcast. \n\niOS: https://t.co/glvePqivac \nAndroid: https://t.co/foi1IfSKbW Tune in to ABC's @GMA this morning to get expert advice from @RachelCruze on getting rid of debt and saving more money. Thanks Andrew. You will have to teach me to play golf. LOL https://t.co/Spf9GcOtHA Thanks @Nightline for the story https://t.co/aCGImqI5b9 Most people buy things they don't need with money they don't have to impress people they don't like. Let's quit that. Thanks Kyle https://t.co/TJdv7ibSq1 Congrats to our friend @BillLeeTN on GOP nominee for TN Gov. Bill is a great man, Godly man, and runs his business well. He will make a great Gov. You CAN get out of debt and live a life you love. Catch me &amp; @RachelCruze on ABC's @Nightline tonight around 12:35AM ET. \"If you don’t know what your customers want, you can’t give it to them.\" Get plugged in to the importance of market research on the latest #BusinessBoutique podcast from @ChristyBWright https://t.co/SRcrZejxmV Nope. Rufus is the man. LOL https://t.co/EKRK9Kisvk Wow....that is impressive. LOL https://t.co/S0Q4J9mrec RT @RachelCruze: You work hard for the money you make! Don’t let it go to waste because of a scam.\n\nhttps://t.co/iHIKCi8xgK Business Owners: Don't miss this week's @EntreLeadership podcast on innovation. Great advice on how to push forward and succeed in today's competitive market https://t.co/glvePq0UiE If your investment advisor makes you feel dumb for asking a question, it's time to get a new one. Get in touch with one that has a heart of a teacher and the skills to help you reach your goals https://t.co/3n9QACcJk7 Whole life insurance is the payday lender of the middle class. Quit throwing your money away. If you’re following the Baby Steps, a term policy is all you need https://t.co/Z7tqMhTuIk Oh what a night! Great party! Great Fun. Great job Ramsey Team https://t.co/1eJC2HJNWO Sign up for our weekly newsletter to get advice and motivation for your debt-free journey: https://t.co/WsPgmfqjY6 Don't let your brother's friend's cousin sell you a house. I'm sure they're nice, but you deserve an experienced professional when making a large purchase. Get in touch with the best of the best: https://t.co/ig90cuuZSm Good word my friend. https://t.co/pSayy3Q6nv Congrats! So proud of you guys! and thanks for your service. https://t.co/xC6IFEtWFu Way to Go!! Proud of you!!! https://t.co/FcElq7vmWV If you're looking for some inspiration &amp; community while working the Baby Steps, look no further. Join our FREE Facebook group https://t.co/zjkABQTfRs Insurance is necessary, but overpaying for it isn't. Get in touch with one of our independent Endorsed Local Providers in your area to help you get the best coverage at the best price for YOU. https://t.co/gmGzCrSjA4 Ouch. Our team will resend tomorrow. They will be in touch then. https://t.co/TT4ig5e1ig WOW! 30,000 people are helping others change their lives. THANK YOU!! \n\nIf you’re following the Baby Steps &amp; have a heart to help others WIN with money, consider becoming an FPU coordinator too: https://t.co/EZFdg4OyHP https://t.co/FYuaCrUI7H Do not speak in the hearing of a fool, For he will despise the wisdom of your words. Proverbs 23:9 The father of the righteous will greatly rejoice, And he who begets a wise child will delight in him. Proverbs 23:24 Leaders: Distractions can cost you money &amp; progress in your business. Don't miss this week's @EntreLeadership podcast with @curtsteinhorst on how to boost focus, productivity, &amp; your bottom line: https://t.co/glvePq0UiE You CAN beat debt and take control of your future. All you need is a plan. \n\nGet the tools to help make it happen in our Black Friday in July Sale - ends soon! https://t.co/CDKzGXVbZY https://t.co/yE53JsmWnO A leader without self-awareness is dangerous, but one with it can move mountains. Find out how you can develop yours on this week's @EntreLeadership podcast https://t.co/glvePq0UiE Well done Gov. !! Proud of you. Proud of Tennessee! https://t.co/2uRQuuUFoA If you're buying a home soon, don't fall into the 30-year mortgage trap. A smaller monthly payment could cost you tens of thousands in the long run. \n\nI ONLY recommend a 15-year fixed-rate mortgage: https://t.co/fkjuSvGS3c There's still time to get in on our Black Friday in July Sale! \n\nSave BIG on the products you need to equip yourself to WIN with money https://t.co/4iKUUYNmKG https://t.co/eaAnBQopOd Your most powerful wealth-building tool is your income. Get out of debt, THEN start investing and building wealth. https://t.co/DS4ARChT8V The freedom to own a business also comes with the responsibility to manage it well. Find a tax pro you can trust to help get the job done right https://t.co/DVSMMTcZfv Social media can be a powerful tool for building your business, but gaining a following starts with TRUST. Learn how to make a personal impact on the latest #BusinessBoutique podcast with @ChristyBWright https://t.co/SRcrZejxmV HUGE deals this week on all of our top products to help you crush debt and build wealth. Don't miss this!! https://t.co/DXFOEFMtUY https://t.co/mEzSJuc131 A car salesman needs your money more than you need their car. \n\nGet our car-buying checklist so you'll be the one with the upper hand. https://t.co/tk2RURGKmW 8 in 10 people that we surveyed say they know someone who's been a victim of identity theft. Quit taking chances. Save yourself the headache and get protected today https://t.co/YihHrAwpXc NO. He lied. https://t.co/Sj6dZiKwES A team that's learning is a team that's WINNING. \n\nGreat @EntreLeadership podcast this week with advice on building an \"A-Team\" from @johnsonwhitney https://t.co/glvePqivac Look UP... and select your hat carefully. https://t.co/2Pnthjxj9F Great work! Proud of you! https://t.co/NHnIMh0iM1 Building a career that you can be proud of is about more than just getting a J-O-B. Don't miss @KenColeman's advice on @cheddar this morning live now from the @NYSE https://t.co/Sfrxh6g7iv The #RetireInspired Podcast is now The Chris Hogan Show! Very proud of @ChrisHogan360 and the team. He's taking your calls to help you reach your retirement goals: https://t.co/m18IcEztFK https://t.co/huVrvpYSqf You will be great at it. Our team will reach out and help you. https://t.co/gk0v0IBBt2 Push FORWARD toward your financial goals this summer. @ChrisHogan360 has advice to help get rid of student loans and wisdom for your vacation budget on @FoxBusiness @MorningsMaria this morning around 7:20AM ET Honor to have you my friend. Congrats on another #1 book. https://t.co/4OwcC2AIOL Adam is at it again. Funny stuff guys! https://t.co/QaNFEI8KME You can find all of your favorite Ramsey podcasts in one place. \n\nFREE advice from @EntreLeadership @ChrisHogan360 @ChristyBWright @KenColeman and @RamseyShow \n\nPush play &amp; change your LIFE https://t.co/dwkxVTIgii Celebrating with @YouVersion and my friend @bobbygwald today on The Bible App's 10 year anniversary! AWESOME. \n\nThankful for the impact it’s had on the lives of SO many around the world. #bibleapp10 https://t.co/UZkpQYvXJp Thanks so much. Glad we could help. https://t.co/eAklvHf3p2 Whether you're looking for a job, need some career inspiration, or just want an AWESOME podcast to listen to, The @KenColeman Show is for you. Check it out  https://t.co/AkOyy2dSjZ Summer's in full swing, but that doesn't mean your budget should take a vacation. \n\nGet on track with @EveryDollar. \n\nIt's the best budgeting tool on the PLANET https://t.co/fEGIVgMYIo You deserve to live more than a paycheck to paycheck life. \n\nReach your goals with the 7 Baby Steps https://t.co/x97yy7p8or #DALLAS: One day can change everything. We're bringing the Smart Conference to YOU in January! Reserve your spot now https://t.co/N21MNP8083 There you go! Thanks Pastor. https://t.co/E8GZFtjPoq @fribster64 Amazing Story. Proud of you! Holler at Jeremy Breland at our place. https://t.co/yTzSvApHQR Wow! So proud of you! You are SO WEIRD! https://t.co/LWvFMDYIQJ Boom. Look at you hero! https://t.co/gZdVbqBFnP Pleasure to meet you Dan https://t.co/PiYIVEEGZ0 Enjoyed joining the @EntreLeadership podcast this week with @RachelCruze to talk family, business, and how to do BOTH. https://t.co/glvePq0UiE I will be reading @BradThor new one, Spymaster, this weekend at the lake. Congrats my friend on ANOTHER Best Seller They were not asking a question. They were questioning my integrity, A troll. https://t.co/CYsbcI2LuT Leave a legacy for your FAMILY, not the insurance company. If you're working the Baby Steps, an affordable TERM life insurance policy is all you need https://t.co/soAZOfHwZf Thanks Kyle. Good to meet you. We celebrated with 200 plus workers on our new building today. Thanks for all the hard work guys! https://t.co/fuUbSNe3Is Have you listened to Ken Coleman's VERY popular podcast, The Ken Coleman Show? You should...it is amazing. https://t.co/ccFB4zASsH Great reminder Pastor Chris https://t.co/U2UlkZcMjO Wow...blast from the past!!! https://t.co/DJax3f2GdG Great job! https://t.co/akLOA2Gb9X You got this! https://t.co/N6zdapIW0A Live like no one else now, so later you can live and give like no one else. LOVING this week's @EntreLeadership podcast on how to create great workplace culture ft. @SouthwestAir's @GingerHardage. Leaders, don't miss this one. https://t.co/glvePqivac Make learning about money FUN with our kids' Adventure Pack. Great books and a fun savings bank too! https://t.co/flUjA2VlE7 https://t.co/5b96C1OiQ1 Finding the right home takes more than a google search. Get in touch with an agent you can TRUST to find what's right for you https://t.co/OdVVCzgZa1 This fall it will be with a tear in our eye that we all say, \"Its Football Time In Tennessee!\" @UTKnoxville  and @Vol_Football lost  The Voice of The Vols, John Ward. A true gentleman. RIP #VFL .@KenColeman can help you get more out of your career than you're getting now. The Ken Coleman Show will inspire and inform you on how to take control of your future. https://t.co/AkOyy2dSjZ In business, you don't win alone. You win as a TEAM. Awesome @EntreLeadership podcast this week with @shawnachor https://t.co/glvePq0UiE Very cool. Proud of  you https://t.co/Gev4XnD8vE Wow...what a kid!!! https://t.co/Om9szjZalV Financial Peace is about more than getting out of debt. The ultimate goal is to leave a positive LEGACY behind. When you start a Financial Peace University membership, you'll now also get our Legacy Journey course for FREE. Don't miss this https://t.co/vJvsxVuQw6 https://t.co/2NIjwC9kkQ We are proud you were too Gabe. https://t.co/WUWQcgmEZG There's a lot of talk on how to prepare for retirement, but not enough about what to do when you HAVE retired. @ChrisHogan360 goes there on his latest #RetireInspired podcast. Don't miss it https://t.co/m18IcER54k Honored to meet you Grant. Wonderful family! https://t.co/qjsxoyuOPd Thanks so much....great pic https://t.co/TBgUm44kM3 Thank-you. We were honored to be on the venue. https://t.co/upHNfyjCRb Thanks Kevin, we had a blast https://t.co/mEiRv1yuSp Thanks so much https://t.co/LHizpLqLpZ Stop living paycheck to paycheck! Join a live chat with @RachelCruze to hear advice on how to save $1,000 FAST. She'll show you the way and answer your questions. Register here: https://t.co/IgZ07pmM2W https://t.co/OGLt4u7cDS Thanks sir. Great time. https://t.co/23Zw6ulnNh Thanks so much for having me. https://t.co/3wNWgImk0w Great to meet you https://t.co/gmfsa2vhnM Thanks for being there today https://t.co/YIzjvikaSV It's time to update YOUR privacy policy. Get the coverage that I personally have and recommend https://t.co/tB0iCv3cGU This week can be whatever you make it -- Make it a good one. Kick it off with the latest @EntreLeadership podcast ft. @DanCable1's advice on how to come alive in your work! https://t.co/glvePqivac @briankoppelman @Showtime Oops. Sorry. Wag more, bark less. \nHere’s to Maggie and the dogs that have chosen us all. https://t.co/Jb76HfQldX Everyone wants their life's work to mean something, and anyone can make that happen. Find out how from @AdamMGrant on the @EntreLeadership podcast https://t.co/glvePq0UiE Don't stay stuck in a job you hate. Dust yourself off and listen to The @KenColeman Show https://t.co/AkOyy1WgVp Great tool!! try this for free https://t.co/4k9kmq8uXP Well put my friend. https://t.co/HNtj3FIWYl EPIC @EntreLeadership Summit last week. If you couldn't be there, catch some of it on the Live from Summit Podcasts https://t.co/glvePq0UiE We're giving away 4 cars this month! Seriously. \n\nThere's only a few days left to enter and drive debt-free on us https://t.co/ybyYkoY9BI If you are in the Nashville area join me and the iconic Cal Turner Jr. ...the book is fabulous. https://t.co/gW5I0Yvwc3 People with a shared goal can accomplish ANYTHING. Join our Ramsey Baby Steps Facebook group for the community and motivation you need to help make your goals a reality: https://t.co/7aqDI6zHyd We want YOU to WIN this summer. Enter everyday for your chance! https://t.co/TgQHKE0bPq https://t.co/3v9FX1lZep Small changes in your spending today could make a HUGE difference in your financial tomorrow. Don't miss @ChrisHogan360 on @TheDoctors today! Check here for local air times: https://t.co/C1V4WrsIue There's no such thing as a shortcut to the top. It takes good old-fashioned HARD WORK. \n\nLoving this week's @EntreLeadership podcast featuring @ABCSharkTank's @TheSharkDaymond https://t.co/glvePqivac Almost half of Americans say they won’t have enough saved for retirement. That doesn't have to be you. Get advice on building your nest egg from @ChrisHogan360 on @FoxBusiness @MorningsMaria around 8:30AM ET For a short time, a TON of our books and tools are on sale for only $10! https://t.co/Gdc6AilWV4 https://t.co/wVJdSgDYmL POWERFUL Life, Money and Hope podcast on the significance of motherhood from @ChrisBrownOnAir this week. Don't miss it https://t.co/x76roR0RzJ Make sure your money plan makes room for life's twists and turns. Don't miss this week's #RetireInspired podcast from @ChrisHogan360 https://t.co/m18IcER54k Yea...I did too. https://t.co/up4OwO4j0K WHEN we work is just as important as HOW we do it. Learn what structure is best for you on this week's @EntreLeadership podcast https://t.co/glvePqivac Never underestimate the power of a book to completely change your life. For a short time, we've got over 50 books, audiobooks and tools for just $10! https://t.co/ixi45Gom1R https://t.co/CImCmQsfdP You've got to be on the same page with your spouse about money. Get the how-to from @ChrisHogan360 on @FoxBusiness @MorningsMaria around 8:50AM ET An all-new episode of The @RachelCruze Show is out NOW. Moms, this one's for you! https://t.co/zcbqGJinAa Ditch the car payment or the clunker and drive stress-free ON US. \n\nEnter now! https://t.co/jJQnA7JFDC https://t.co/k0ByQE9FB3 Yea, well Beth we love you and we love fried chicken. Well said Sister https://t.co/3sg1YuyQb4 Don't miss @RachelCruze making money fun on @PicklerandBen today! \nCheck here for air times in your area: https://t.co/5Ho7swTae5 https://t.co/4aWx9T9xca You can get more done in the next 12 weeks than you've accomplished in the last year. This week's @EntreLeadership podcast is a game-changer https://t.co/glvePqivac When you’re ready to buy, make sure your home is a blessing, not a financial curse. Check out the company I recommend to walk with you through the life of your mortgage: https://t.co/S1zeBXsjyW Watch @AnthonyONeal LIVE from The New York Stock Exchange on @cheddar this morning around 9:10AM ET. He'll be sharing about our all-new Teen Entrepreneur Toolbox! Don't miss @RachaelRayShow today. @AnthonyONeal will be on to share about 3 mistakes he made in college and how you can teach your kids to avoid them! https://t.co/3mdrMrAAgI A summer job doesn't have to be boring. Parents: Equip your kids to think BIG this year. Find out how from @AnthonyONeal on @foxandfriends this morning around 6:45AM ET Lol....I think it is none of her business until SHE start writing checks. https://t.co/BRM57XrhgB We're making this summer a BIG one by giving away FOUR CARS. Seriously! \n\nEnter now: https://t.co/FvZOP6tMOT https://t.co/GbYrZ6ZiSR \"The pain of progress is far better than the pain of regret.\" EXCELLENT @KenColeman Show podcast today https://t.co/AkOyy1WgVp Had a great time talking with @GerriWillisFBN about retirement planning vs. saving for your kids' college. Listen to our chat on her latest podcast https://t.co/yILMZhIAVL Like my old Pastor used to say. My my my my my  my.  Love David Crowder! https://t.co/6wxtD7TOFK Great morning run with 350 plus of our team running with me and 200 more cheering....Weather was perfect and a fun run. Thanks for being All In. https://t.co/JDstxRwauL Everyone's busy, so small moments matter more than ever. Make them count with advice on this week's @EntreLeadership podcast https://t.co/glvePq0UiE That is ridiculous. Imagine if we just randomly raised your taxes 25%. https://t.co/0ETy1tylMV Leaders aren't born, they're built. We're streaming our entire @EntreLeadership 1-Day event TOMORROW. It's worth the time to learn this stuff. Get your stream pass now https://t.co/MDG9roD4t6 TONIGHT- Watch our Smart Money event from Louisville, KY! @ChrisHogan360 and I are going to teach you how to beat debt and build wealth. Stream LIVE from anywhere https://t.co/JVT0RuU1eI Retirement planning isn't a someday thing, it's a right now thing. Start being intentional with your future and listen to the #RetireInspired podcast with @ChrisHogan360 https://t.co/m18IcER54k I LOVE Seth Godin. @ThisIsSethsBlog https://t.co/9OFKjBSUKF It's time to make retirement saving a priority. Get advice from @ChrisHogan360 on what you and your employer can do to build your nest egg tomorrow on @FoxBusiness @MorningsMaria around 8:50AM ET Need a job? Start with people you already know. Deep dive on relationships and career on today's @KenColeman Show podcast https://t.co/AkOyy2dSjZ hmm https://t.co/HBVnlHyu4D Probably about then...contact Kelly now to begin coordination. https://t.co/81Wo7bgIjX Launching TODAY: The Teen Entrepreneur Toolbox! Give your teen everything they need to start making money and WINNING in the real world. It's awesome https://t.co/6MPOQT5K0d Get your ticket now for this Wednesday night's Smart Money LIVE stream! It's time to quit living paycheck to paycheck and learn how to win with your money https://t.co/5e4MH7GSxI Go Preds https://t.co/CALgEQMvfZ Wow...thanks Ben...honored https://t.co/h06BlRBHag My honor to spend time there with President Joe and Chancellor Carver https://t.co/C7nRU34CF1 The housing marketing can be tough. Get a mortgage company that will work for YOU: https://t.co/L7K5ix1emx @MarshallRamsey Look at you cuz. Well played. Proud of you When I first started in Radio I looked up to Ken and Daria Dolan who did a money show on 145 stations. I got to tell Ken that a few months ago. He passed today at 75. RIP my friend. We're saying thanks to #teachers in a BIG way: https://t.co/Sn96q4KxyT https://t.co/XEWfvk8MbG Barbara Bush, 92, HW's wife for 72  years and America's Mom. RIP Conflict isn't an end, it's an opportunity. Learn how to make the most of it on this week's @EntreLeadership podcast https://t.co/glvePq0UiE There are more retirement accounts over $1 million now than there have EVER been. That's awesome. Find out from @ChrisHogan360 how you can take yours up a notch on @FoxBusiness @MorningsMaria around 7:50AM ET Wonderful. Thanks for asking. https://t.co/VXIWiiwHEw Fun memory. Thanks https://t.co/2mLC082t1e Take your debt-free journey to the next level with some community and accountability in our OFFICIAL Facebook group:  https://t.co/7aqDI6RiWN Lotta smart in that room. Thanks for leading them well. https://t.co/kGjsKGCMBJ Be careful with that girlish figure. https://t.co/zq9pLOi2mE Well done tech team! https://t.co/eyyDoMwtLh As your company grows, it's important to remember what got you there. Awesome @EntreLeadership podcast this week ft. @cousinsmainelob https://t.co/glvePq0UiE In just one day, you can learn leadership skills to take your business to the next level. We're streaming our ENTIRE @EntreLeadership 1-Day event LIVE from Houston on April 27! https://t.co/maeLUJCtsD LOL.....you should not run your life by polling broke people about money. LOL https://t.co/TnzSf5gW02 Chicago: Learn @ChrisHogan360's 5 ways to get a raise WITHOUT talking to your boss on @WindyCityLIVE today in the 1pm hour. Well THAT is fun! https://t.co/Rnd2wBGnF6 Protect yourself AND your family from identity theft. It's not too late to get covered and have expert help on your side if something happens https://t.co/rKrw2qImog Millennials are spending plenty of money, but it might not be on the right things. Get the full view from @ChrisHogan360 this morning on @FoxBusiness @MorningsMaria around 8:50AM ET Continuing to Pray for my friend @PsRobertMorris Pastor Robert Morris. Please join me. https://t.co/j1oY0fdAnp LOL....thanks....they are....just not in the spot light. Thanks https://t.co/eitJ8PcEna Don't miss the season premiere of The Rachel Cruze Show TODAY at 12PM ET: https://t.co/76CSDEjKuh Catch new episodes every other week on Facebook and YouTube! Still do. LOL https://t.co/6l27MSdflK Praying for my good friend Pastor Robert.... https://t.co/wESWs49bSD Thanks for coming https://t.co/xuoaj0W21j Thanks for coming https://t.co/wgDxLXby5p Thanks for coming https://t.co/zyjXEig3gT You guys are stars https://t.co/eqzoH4ecmR Thanks my friend https://t.co/Dczu7h1oAT Thanks for coming https://t.co/xEKULIricl Thanks for coming https://t.co/1ECNDBjaUK Check out this rockstar lineup. Love it. If you've never been to a Smart Conference, we'll be in #KansasCity this fall - join us! https://t.co/rXaO0loYkR #smartconf https://t.co/lHgEHv300Y Ready for a great day at the Smart Conference in #Boston. Let's do this! #SmartConf Sound check Boston Smart Conference. Game on! Wow! If you are coming get here early! Complete Sellout 6000 people https://t.co/WmU1lv1STl Parents, is your teen up for the challenge? Test their money knowledge and they could win BIG https://t.co/TjOpESpGnH https://t.co/oEE10kesDS Looking forward to our visit! https://t.co/eska3xxzuT Learn how to deal with fluctuations in your 401K with advice you can trust from @ChrisHogan360 on @FoxBusiness @TeamCavuto around 12PM ET today LOL...my great grandfather. We are  proud Hillbillies...that is how we do the naming thing. https://t.co/ba9RExV3t1 Amen and Amen Cousin. David Ramsey II, my uncle behind my boat. https://t.co/4DYRvEPRGM If you have questions about Roth IRAs, the latest @ChrisHogan360 #RetireInspired podcast is for YOU https://t.co/m18IcEztFK 76% of parents want kids to learn entrepreneurial skills, but aren’t confident in teaching. Problem SOLVED. Check out our NEW Teen Entrepreneur Toolbox: https://t.co/kbsWrT5iIP https://t.co/5PzCFpYIPn You've got big goals. Let's accomplish them TOGETHER. Join our new Facebook community: https://t.co/7aqDI6zHyd LOL....I hope that means \"get a great buy\". If so I am deeply honored. https://t.co/kzsQrenk2b It is all about leadership. While not aimed at nonprofits.....Leadership is always applicable. https://t.co/Xfdsb6s4fD This young man is one of the best story tellers I have read in years. Brilliant. Makes my eyes leak regularly. https://t.co/49sUevxxMA To be unclear is to be unkind. Get solid advice on how to have tough conversations the RIGHT way on the latest @EntreLeadership podcast https://t.co/glvePq0UiE Our Teacher Appreciation Giveaway is HERE! https://t.co/NjL1bjnSkg https://t.co/q9oR3wWcrf @oldsoul1977 Team will be in touch to identify and remove both He is not Here, He is Risen. Happy Easter Wow. Very cool Chris. Happy Easter https://t.co/w4KXGKaiGE You didn't come this far to only come THIS far. Move forward with awesome advice from The @KenColeman Show podcast https://t.co/AkOyy2dSjZ RT @DevWithPurpose: Food, fun, and fellowship with @DaveRamsey #MarchMadness #waterflipcup https://t.co/OjuiP2uBB5 Today’s Ramsey lunch… a flip cup challenge!! https://t.co/umivPiKm6E Our friend @RickySkaggs was just announced for the Country Music Hall of Fame!!! Boom! Congrats sir...well deserved! Godly man, World Class musician. Hear honest advice on the intersection between faith and finance every week on @ChrisBrownOnAir's Life, Money and Hope Podcast https://t.co/x76roR0RzJ Creating a strong culture in the workplace is endlessly valuable. Leaders, don't miss this week's @EntreLeadership podcast ft. @wvanderbloemen  https://t.co/glvePqivac LOL...I thought that after the first week 25 years ago. But always new souls to teach. https://t.co/qHFJUmmrYZ Term life insurance is the only way to go. It protects your family and gives you peace of mind. Don't go another day without it https://t.co/q7vm2GDGdC Loved having you as always. You are amazing. https://t.co/7mGIf9opYU Love it https://t.co/nLJlZggp4P There's still time to get tax help from someone you can TRUST. Find one of our trusted tax pros in your area now https://t.co/15sjBlpy8L You don't need a huge income to win with money. Dale made around $48K per year and now's he's a multimillionaire. Check out his story https://t.co/P3poc9GrM3 Don't just own your business, LEAD it. Get weekly advice and inspiration from top minds on the @EntreLeadership podcast https://t.co/glvePqivac I am ashamed to say, YES https://t.co/Y5ACTF362V One day can change EVERYTHING. We're bringing the Smart Conference to #Boston next month and just announced, #KansasCity this fall! \n\nBoston: https://t.co/gXZcY9xTc1 Kansas City: https://t.co/ejs39AuvQr New release! Grab your copy of “Culture Wins: The Roadmap to an Irresistible Workplace” by my friend @wvanderbloemen https://t.co/aeBkyLJ0ab #CultureWins Money mistakes usually start early. Don’t miss the advice that everyone in their 20s needs to hear from @ChrisHogan360 on @FoxBusiness @MorningsMaria around 8:20AM ET Way to go guys!!! Congrats!! Proud of you! https://t.co/CprYUIJbIe If you dread heading to work today, The @KenColeman podcast is for YOU. Get the advice and inspiration to find a career you love https://t.co/AkOyy1WgVp So honored to be here https://t.co/3naxQUGeYz Looking forward to being with my friend @craigoliversr in Atlanta for services tonight and tomorrow! Join us. Church is FREE https://t.co/fqS0RHW3OV Yep https://t.co/3GkSfekTZ0 That completely is true. Wow...20 plus years ago and 15 million books ago....and a LOT of hair ago. https://t.co/F33GYIyom2 Tune in to @AmericasNewsroom this morning around 10:20 AM ET I’ll be on to share advice on how you can start making smart money decisions to help change your family tree. If you're debt-free, retirement planning shouldn't be a future thing, it should be a NOW thing. Get the advice you need from @ChrisHogan360 on @FoxBusiness @MorningsMaria from around 6-9AM ET There he is again. @ChrisHogan360 is everywhere https://t.co/jwJ4MWz4Eg Catch @ChrisHogan360 on @LiveKellyRyan today - he'll be testing their money knowledge. Check local listings: https://t.co/FaCiFyK5HO Don't trust your taxes with just anyone. Get things done RIGHT this year: https://t.co/LBYe1vE5ER Marketing without social media isn't an option in today’s world. Solid advice on ways to use social media in your business from @msrachelhollis on the latest @EntreLeadership podcast https://t.co/glvePq0UiE Good job team https://t.co/VHPs4jCysb Excited to join the folks from @foxandfriends this morning along with some of the Ramsey personalities. We'll be answering your money questions - TUNE IN! Our own David Wilkinson launched his own pod cast. Dads, do you struggle with confidence &amp; connection? DAD MATTERS will help you to make the relationships with your children relevant, long-lasting &amp; even fun!\nhttps://t.co/IJzGkyVb0Z Great Job! Proud of you! https://t.co/xVj53fwRtF Great Job!!! https://t.co/YBPyYgQoiV I am excited to come...thanks sir. https://t.co/50oW2KP0D7 Your tax refund is NOT free money. It was yours to begin with. Check out @AnthonyONeal's tax advice for millennials this morning on @cheddar in the 9AM ET hour #cheddarlive Money mistakes are common. Learn how to avoid them with advice from @RachelCruze today on @LiveKellyRyan. Find your local air time: https://t.co/FaCiFyK5HO Don't count on the government to take care of you. @ChrisHogan360  has the retirement advice you NEED: https://t.co/m18IcER54k Honored to meet you sir. Thanks for hanging out with us today! https://t.co/jWGiGrvm2V Well look at you @RachelCruze https://t.co/RNO9RC0e97 Yep,  Buddy Cruze Sr. loved his Jesus and his family with reckless abandon. One of my favorites. https://t.co/TvXAT2Dg3v Love Pastor @craigoliversr and looking forward to speaking @EbcInYourCity this weekend. https://t.co/vQbqeESdIv Speaking in Atlanta this weekend for my friend Dr. Craig Oliver. Join us Church is free. https://t.co/qrMP49RxYC Count on it. https://t.co/AQgJcG46xd @MLovedDesigns @RachelCruze So sorry. That is awful. Team will be in touch tomorrow and make it double right. Yep https://t.co/JDMJqsGigL Oh Yea! Boom! https://t.co/WzGx84d7qj Yea....we kinda expect people to work at work. If they cant then we let them find a better place. https://t.co/gfqY2PUIwa Cut your marketing costs and raise profits this year with advice on this week's @EntreLeadership Podcast: https://t.co/glvePqivac Wow.....what a great event!!! Proud of you guys! https://t.co/2qcmGWl1dg It's not too late to get identity theft protection. Get covered and give yourself some peace of mind: https://t.co/LUo39eJ69b Yep. Love @DanielLapin https://t.co/WGWdVXa2eW Millions of people have downloaded @EveryDollar because it's the BEST. Start your free budget today https://t.co/yrJ1A9W4Dy Me too Andrew....see ya in a few minutes. https://t.co/a4RMBEmqsp Told ya that is a great read and makes me understand and brag on my Hillbilly Heritage. #Proud. https://t.co/pctJ9WjqAB #LosAngeles - @ChrisHogan360 has the advice you need to make your retirement dreams a reality. Don’t miss him this morning on @KTLAMorningNews around 8:35am PT Digital marketing can be easier than you think. If you've got a small business, you can't afford to miss the latest #BusinessBoutique podcast from @ChristyBWright https://t.co/SRcrZe1VYl Get the help you need and the money you deserve. Find one of our Endorsed Local Providers in your area to get your taxes done RIGHT this year https://t.co/QuVs8L8lyO Don't allow fear to be a part of your financial plan. Charge forward with advice from @ChrisHogan360's #RetireInspired Podcast https://t.co/m18IcER54k Great time last week at the @EntreLeadership Master Series. Catch some highlights on the latest podcast https://t.co/glvePq0UiE Quit obsessing about what's next if you're not ready for what's NOW. Awesome episode of The @KenColeman Show today https://t.co/AkOyy2dSjZ Very nice!! Well done!! https://t.co/QcaNvkLuhm wow....I wish. Love jazz https://t.co/sZxV9heyUt You got this. Push through! https://t.co/AHXaKPzKjP Happiness is all chance, but joy is a CHOICE. Awesome podcast today, @ChrisBrownOnAir https://t.co/x76roRisrh One of my favorite Billy G. quotes. https://t.co/D5FByQIcf6 Well done Cuz https://t.co/LIW2dl1mKl Wow....life well lived https://t.co/OU3tCCxIBa Old fashioned and respectful obit https://t.co/rJqgNxMCwo The world is darker today as Billy Graham goes home. Thousands of souls applauding in Heaven as he walks in and hears: \"Well done good and faithful servant.\" Possibly the greatest man of the last 100 years. RIP World Changer Time flies when you're doing work you love. Discover the keys to a motivated career on The @KenColeman Show every weekday https://t.co/AkOyy2dSjZ Agreed. Great man. He set the table for a bunch of us. https://t.co/Af4MchJ6Mx Here's your chance to change your life on your OWN time. Every Financial Peace University kit includes anytime access to our online classes https://t.co/iGE0JBTSWL https://t.co/Wq9Kuj4x5D Worry shouldn't be a part of your retirement plan. Get the advice you need to take action from @ChrisHogan360 this morning on @FoxBusiness @MorningsMaria around 8:20AM ET Just because most businesses don't do something doesn't mean that thing is impossible. Insightful @EntreLeadership podcast on building a virtual culture https://t.co/glvePqivac I am a very proud Dad. Thanks https://t.co/n3m5bW3Gnn @adam_lowe Thanks...working on it....I sent your tweet as encouragement. A tiger doesn't lose sleep over the opinion of sheep. -Zag Goals worth reaching will always require sacrifice. Awesome @KenColeman Show today on what it takes to get the career you want https://t.co/AkOyy1WgVp Thanks Jamin https://t.co/ZLArB0iREk Love that smile too. I grew up with one of those....named Mugsy. Great dogs. https://t.co/qOB2OYC4oU Thanks for listening. https://t.co/ofVQajdIKg My Golden Retriever Agrees. https://t.co/n22BHGedXZ Gotta nice smile. https://t.co/TntuwnnhTK Love Seth. @ThisIsSethsBlog https://t.co/WJ5qTth1Ab There is HOPE for couples who want to work on better communication around money. Great study out now https://t.co/5EFCLGZwQx Don't miss @ChrisHogan360's expert retirement and investing advice on @FoxBusiness @MorningsMaria around 8:20AM ET Look at you!!!  Way to go!! Congrats!! https://t.co/HCcPIYTtJP #Houston - Don't miss @RachelCruze this morning on @Fox26Houston around 9:30AM CT. She's got advice on how couples can reach their financial goals TOGETHER. \"Talking about money is often more valuable than the money itself.\" -\n @RachelCruze \n\n#Atlanta - Catch Rachel’s advice this morning around 8:40AM ET on @GoodDayAtlanta You have to be intentional about your future if you want it to be good. Get great advice from @ChrisHogan360 on the #RetireInspired podcast https://t.co/m18IcER54k Heard at church this weekend: \nDo you give BECAUSE God loves you or do you give SO God loves you? Then don’t do it https://t.co/fbtz6Wa57a Successful people have more in common than you might think. Great #BusinessBoutique podcast from @ChristyBWright https://t.co/SRcrZejxmV Adults devise a plan and follow it. Children do what feels good. Be an adult and make a budget https://t.co/ltWJV74zLy Strong companies have strong culture. Leaders, don't miss this @EntreLeadership podcast ft. @pattymccord1 on building a culture of freedom and responsibility https://t.co/glvePq0UiE ohhhh that is so GOOD https://t.co/PPTiQfUPBb Yea.....don't be technologically and social media savvy and then be so STUPID as to believe everything you read. https://t.co/tBpl9OMheE Get after it. Love it. https://t.co/Ujpm8EMfH5 Your future is too important to waste another day worrying about money. Get things on the right track with Financial Peace University https://t.co/DTcknJcyxZ Fabulously. Thanks. Up 20% last year and a buying opportunity this week https://t.co/3gKd9yYtnU And then he retweets you......wow now it is getting REALLY creepy....LOLOLOL https://t.co/kLVGmfHOHV @ansonTheATC I will have my team get in touch with you. I will give them the first 10 kits to get them started. Thank-you. Pretty sure that is why God put me on the planet. https://t.co/SAar7nkMLo @mavwreck75 LOL...not tape...a design element to the Roush Raptor The sky isn’t falling if the stock market fluctuates. Take a deep breath and watch @ChrisHogan360's advice on @FoxBusiness @MorningsMaria around 8:30AM ET You can't learn everything in school. Discover the power that experience holds on the latest @KenColeman show podcast https://t.co/AkOyy2dSjZ Don't go it alone this tax season. Get help from a pro that you can trust https://t.co/34rKlGApaC Lol...eye of the beholder....actually some of the engraved ones are beautiful. https://t.co/5e5mrCGjJQ Good times https://t.co/5wyrMj8A5y @MarshallRamsey That 4am wake up call got you fired up. :) A dream job combines your passions and talents. Get great advice from @KenColeman on how to find yours on the @EntreLeadership podcast https://t.co/glvePqivac Stay the course with investments. The only people who get hurt on a roller coaster are ones who jump off. More from @ChrisHogan360 on @TeamCavuto around 1:50PM ET Our 2nd grandson was born 1-hour after the Super Bowl last night. His dad is a football coach. This could be a sign. Welcome Samuel David Whittemore! Good https://t.co/E3Dg5P0Zwe Yep https://t.co/agTSUinAlx Wow https://t.co/37BsXqNEu4 Wow. What do I have to say to convince folks. Whole life SUCKS. Dave nor any version of Dave owns one dime of Whole Life. People who can do math run from this garbage. https://t.co/ShgpNitegk Nah, they just lie https://t.co/tlD4dC7hj1 Yea, like that law of gravity thing. https://t.co/rf61cHUmgu Ton of lies in one single tweet. You just set a record. AND NO I DO NOT have Whole Life Policies. That is a LIE. https://t.co/LtrhkmtT2s Quit throwing your money away on whole life insurance. Term insurance is the smartest option for you and your family. Find out how much you'll save https://t.co/nSYcoZz88s Your goals are worth it. Get up and try again. Don't miss this week's Life, Money and Hope podcast from @ChrisBrownOnAir https://t.co/x76roR0RzJ Thanks for stopping by Chancellor, an honor to have you. https://t.co/h92oH8HIyi Love this guy!!!! https://t.co/0QoKvyp4BT Over 100 dev and tech folks at Ramsey doing a hackathon!! I walked around in there and in ten minutes my IQ went up https://t.co/Q83dIVWwdz Bitcoin: If you can't understand it, don't invest in it. @ChrisHogan360 takes on the craze on his #RetireInspired podcast https://t.co/RhGya9ygyL \"You don't have to be the best to help people.\" Excellent #BusinessBoutique podcast from @ChristyBWright https://t.co/SRcrZe1VYl If you want to know how tax changes will impact YOU, don't miss @RachelCruze on @RachaelRayShow today. \nCheck listings for local air times: https://t.co/QpxOpLVEmm https://t.co/v0mHRtpVAU The Total Money Makeover is my playbook for everyone to kick debt to the curb and WIN. Get it on sale now https://t.co/uzAJJYfdjX Wow.....amazing ....Yodeling?#$% https://t.co/wvtKykRmh0 Boom!! Look at you!! https://t.co/mRFDcWQPqG Always good to be in a regular rotation with the Bee....big fan. https://t.co/OC8eqoiQG5 Fun https://t.co/2K6tOOJL8c One of the most fun dinner stories I have ever heard. So loved spending time with you guys this weekend. https://t.co/cLwsas8F46 People trade me thier old ones for a free book....so I have props. https://t.co/4LhgtWF2pr It's your money. Take control of it. @EveryDollar is the FREE budgeting app you need https://t.co/Iu56P3LHv0 Complacency is NEVER an option. Awesome @EntreLeadership podcast featuring Charles Koch https://t.co/glvePq0UiE You guys are an incredible couple. Great to see you again. https://t.co/5v4PUgSKa8 Coral Springs/Miami area this morning. Come out....Church is FREE and this a GREAT chruch https://t.co/1tSbPAikvR You too Joel...thanks for coming! https://t.co/TENTsSdvkM Awesome herd of gazelles! https://t.co/1veZSrcw3a Thanks.....GREAT church https://t.co/5FnuTyHFTg Thanks...thanks for coming. https://t.co/V015k4YKRi Good run Cuz! Congrats! Come run Country Music with me an my team this year. https://t.co/5q7m6gzWPT Heading to Miami/Boca to speak for my friend Pastor David Hughes at Church by The Glades @cbglades Tonight and in morning. Join us. Church is FREE Good people doing good work. Toxic secrets are often family curses broken by the blood of Christ. Get em! https://t.co/cTzo1jrJ2H You are correct on both points....I looked it up after the show to be sure. https://t.co/TeeTK90Xr0 Whooo Hoooo.....Congrats!!! https://t.co/NR7VkKdyQ2 Doing your taxes on autopilot this year could be costing you almost $800. Our quiz can help you decide whether or not it's worth it to hire someone to help https://t.co/KK2kdIvi9Q AMEN https://t.co/72IUVGnhoD LOL....with friends like you.... https://t.co/cjkOmsAUh8 Wow!!! Thanks for Continuing to change lives! https://t.co/OmFPLgoSNg You work too hard to be broke. Financial Peace University has the plan to help you make that hard work pay off. Take the class with a group OR online, on your schedule https://t.co/HH4aL1spNG Millennials are saving more than you think. Hear more from @ChrisHogan360 on @foxandfriends this morning around 6:50AM ET Whooo HOoo....look at The Ken Coleman Show.....Business Boutique....AND EntreLeadership!!!\n\nWay to go TEAM! https://t.co/MBf19Bn58p So excited to be in the Miami Boca area speaking for Church By The Glades @cbglades this weekend. Come out...Church is FREE https://t.co/r0RSK3pqYA Fabulous!!! You got this!!! https://t.co/mLKSQwSBhU Get em. https://t.co/q3GfaTIpRL You don't need a finance degree to make a budget. @EveryDollar makes things simple. Start your FREE budget now https://t.co/iXIPaW5xjK Love it!!! Congrats!!! https://t.co/XHwqSzr3A2 Wow https://t.co/r12mXWDrYP If you're in leadership, you NEED to listen to the @EntreLeadership podcast. Expert advice and accountability to help guide you and your company to success. https://t.co/glvePqivac Want to come to one of our awesome live events? You can skip the road trip and make plans to be a part of our Smart Money LIVE stream on April 25! You'll learn to get rid of debt and WIN with money https://t.co/iGwwH9uZCq Amen. Well done Derwin. @DerwinLGray https://t.co/VCslQxHAuS You've got what it takes to reach your goals. Get on a path to becoming debt-free with our new Baby Steps Bundle: https://t.co/SRPrUECFw5 https://t.co/KYiF9EBhwW Want to see what your future looks like? Take a look around. Choose friendships wisely. Excellent Life, Money and Hope podcast from @ChrisBrownOnAir https://t.co/x76roR0RzJ Are you prepared for retirement? Find out if you’re on the right track from @ChrisHogan360 today on @FoxBusiness @MorningsMaria around 7:20AM ET Boom! Look at you! You got  this! https://t.co/YWtgiqzP6Q You deserve investing advice you can trust. @ChrisHogan360 covers the 7 myths people still believe about investing on his #RetireInspired podcast https://t.co/m18IcEztFK Thank you kind sir. https://t.co/043uIU3688 Business Leaders: you NEED more time. Discover a secret to getting more of it on the latest @EntreLeadership podcast https://t.co/glvePq0UiE Get back on track this year. Shift your money goals into high gear with our Baby Steps Boot Camp: https://t.co/XBPVeEOcJp Watch @foxandfriends right now to see @RachelCruze LOL....cute https://t.co/MpbWub9DIj Yep https://t.co/ZutaOuVq3o Amen....I can almost hear the cadence in his voice.... https://t.co/WFrmnpiFIb You CAN take your business to the next level. We'll show you how. Attend our @Entreleadership 1-Day event in Houston or Livestream from ANYWHERE: https://t.co/5sAL1k2xCh https://t.co/UadXM5fmKo Meekness is not weakness, it is power under control. - Warren Wiersbe Wow!! Thanks to YOU for making @RamseyShow the 4th most downloaded of all @ApplePodcasts in 2017. So fun. \n\nhttps://t.co/KW6djsDJAY https://t.co/JJwaMdZqr4 Faith is taking the first step even when you can't see the whole staircase.-Martin Luther King Jr. @dblcapcrimpin Sorry about that. Our team will help you tomorrow. Turn your paycheck into a plan and your goals into RESULTS with an @EveryDollar budget https://t.co/A8EA0QABLG Big picture goals are important, but it's meeting your daily goals that will get you to that desired future. Excellent #BusinessBoutique podcast with @ChristyBWright ft. @ChrisHogan360 https://t.co/SRcrZejxmV Credit card debt is at an all-time high. It's time to QUIT living this way and get on a plan. @ChrisHogan360 has the advice America needs to hear on @FoxBusiness @MorningsMaria around 7:50AM ET We’re LIVE now from Ramsey Solutions Headquarters with The Financial Freedom Town Hall to get you ready to make 2018 your BEST year yet. Don't miss this https://t.co/tw4l826ebr Lot of great plays in that game last night. Wow.....this is the best of the night. \nhttps://t.co/SEKXVrZ58P TONIGHT: Don't miss our special FREE Town Hall event LIVE at 7PM Eastern / 6PM Central - Make 2018 the year you WIN with money. https://t.co/tw4l81OCMR How long will it take you to pay off debt? Find the light at the end of the tunnel NOW with our debt calculator: https://t.co/wT2OkRnWmX Everyone makes mistakes. Pick yourself up and move forward. Learn 4 habits to make you more effective and successful on this week's @EntreLeadership podcast https://t.co/glvePq0UiE Thanks for coming! Honor to meet you as well https://t.co/5YPayxHPzo Thanks..Wonderful morning, wonderful church. https://t.co/I5iabN6Ox9 Nashville- Catch @AnthonyONeal on @FOXNashville this morning around 7:45AM CT. He's got the advice teens need to WIN this year. @matthew_kerle Sure...team will be in touch. Thanks for the business. Team will be in touch...we will get you the info. Thanks  for your interest. https://t.co/RuBwlJAnMY Nashville: Get a strong start to 2018 with @RachelCruze's money tips for the new year this morning on @TODAYINNASH around 11AM CT YES https://t.co/XXq5rqsIDM Thanks so much! Proud of our listeners and our team's production of this. https://t.co/RKQQezokcJ 80% of New Year's Resolutions fail by the second week of February. Set GOALS and beat the statistics with solid advice from @ChrisHogan360 https://t.co/m18IcEztFK lol.....SSI from 1984...couple of hundred dives since then. Love it. https://t.co/Qkuf8BdC9e Take control of your finances. Join the 5 million people who have used Financial Peace University to reach their goals: https://t.co/E2N4IeaoKa LOL....where did you find that? 40 years later. https://t.co/ZMiblnGxBs Make this the year you WIN with money. It all starts with the budget.\nDownload @EveryDollar today https://t.co/szqQHcHfUK Know how to win with money, but need a refresh for 2018? Our team put together a Baby Steps Bootcamp. Check it out: https://t.co/Vc7GbcP5RX Amen https://t.co/R2wYDj3svJ This answer represents one of the many reasons this man is a good friend. He is a scholar, a teacher, ...truly a Rabbi. https://t.co/5GSv42sMna Start 2018 with a PLAN for your money. We built @EveryDollar, the best budgeting tool on the planet, and it's FREE https://t.co/2390c7tazR Great work Rachel. #ProudDad https://t.co/W9chhkXG54 Wow....you guys are AMAZING! ...thanks for helping so many people.Happy New Year https://t.co/4GIY3w3A35 Make struggling with money a thing of the past. \n\nJoin the millions of families who have found hope and results with Financial Peace University: https://t.co/yI77aCrLlj Hear from leadership rockstars in this awesome recap episode of 2017's @EntreLeadership podcasts: https://t.co/glvePqivac If you feel lost financially, there's hope. Get on the right track and jumpstart your 2018 goals: https://t.co/5eEhXEVFDk Millennials vs. Baby Boomers: When it comes to saving money, who wins out in the end? Find out from @ChrisHogan360 on @FoxBusiness @MorningsMaria around 7:20AM ET Gift cards are a Christmas cop-out. Before you buy one, check out our last-minute digital gifts: https://t.co/OmawPIkunT You CAN reach your goals. Focus and don't give up. Awesome Life, Money and Hope podcast with @ChrisBrownOnAir https://t.co/x76roRisrh Love it!!! Thanks for leading the class!!! Merry Christmas https://t.co/6VWygppDE6 LOL...no they aren't. We FINALLY got our money back, but we begged you guys to fix the mess you made and you were unreasonable and unresponsive. I begged your guys to do the right thing. https://t.co/OM47JzLFlp Beware of @LuxuryRetreats . Horrible company. Canceled our family ski house 5 days before Christmas. It has taken days to even get our money back. Quit dreading Mondays and living for Fridays. Practical advice on career and finding your unique passion on The Ken Coleman Show https://t.co/AkOyy1WgVp And a very Merry Christmas to you as well. https://t.co/iJYiMGeVyE Tune in to @cheddar to hear @ChrisHogan360 LIVE from @NYSE around 9AM ET There's 8 things you must do to have a great 2018. @ChrisHogan360 shares what they are on his latest #RetireInspired podcast. Listen now: https://t.co/m18IcEztFK Don't be the person running to the convenience store on Christmas Eve. Grab some of our awesome last-minute digital gifts https://t.co/Hb3Q6nDUic .@ChrisHogan360 is headed to @FoxBusiness @MorningsMaria - make plans to watch around 7:20AM ET Your retirement plans MATTER. Get the advice you need from @ChrisHogan360 on @foxandfriends tomorrow around 6:35AM ET Thanks Steve https://t.co/m0Fr4D0t9d Catch Retirement Expert, @ChrisHogan360 on today's @TeamCavuto around 12:50PM ET Join us in spreading the message of handling money God's way. Become a Financial Peace University class coordinator https://t.co/2Pn8Lj8MwJ Taking control of your money begins with the budget. Get started with @EveryDollar and create your FREE account today https://t.co/sb9IPI0mHU No one trusts people who pretend they're perfect. Awesome advice on leadership from @KristenHadeed on the @EntreLeadership podcast https://t.co/glvePq0UiE Just checked the calendar and YEP, Christmas is on its way. Wrap up your shopping today - all of our Christmas deals are BACK: https://t.co/46bPRbjQQh https://t.co/iLCNPXhJE2 Wow ...giant in the faith passes. Impacted millions of people for God. RIP R.C. Sproul WOW WOW https://t.co/bEbH6X1W0P Congrats! You got this! Merry Christmas https://t.co/R3LltzAYPe Here's everything you need for a solid financial future all in one place. Financial Peace University PLUS, The Total Money Makeover and Retire Inspired Audiobooks for FREE: https://t.co/7oxagH0UGc https://t.co/qvutN2FZoH Amen https://t.co/Z7GXk2Jxnj Helping your adult children with money can easily get out of hand. Great advice on where to draw the line from @RachelCruze on @foxandfriends tomorrow morning around 6:50AM ET Don’t miss this! https://t.co/ijkorC23tE https://t.co/vOLx12SVxQ You are the greatest obstacle to your success. Beat the mental game with high-performance psychologist, @MichaelGervais on the @EntreLeadership podcast https://t.co/glvePqivac If your retirement plan isn't where you want it to be, @ChrisHogan360 has the advice you NEED on @FoxBusiness @MorningsMaria around 8:20AM ET Bwahaaahaaa   cue the evil laugh https://t.co/K4OmS6oYR0 Cool video. The leaders all line up and tell the team they are valued by clapping all 600 of them in. https://t.co/76vDVJb2Qb Great pic Cam https://t.co/sdrCJXrB12 1300 folks....Ramsey team members and spouses on a private $1k Costco shopping spree this morning, AND we gave away 3 Cars! Love our Team! Merry Christmas!! These HUGE Christmas deals won't be around long. Check them off your list before it's too late https://t.co/rrL0vQCNmt https://t.co/5nuSmY0UAc Right now, when you purchase Financial Peace University, you'll get The Legacy Journey Home Study for FREE https://t.co/1nnZ7pOo1X https://t.co/l9J6v0caQY Welcome Coach Pruitt to Rocky Top! As a Southern Boy....he sounds like a football coach. Players of character, They go to class, He respects his Dad. Great start.  Go Vols.... #VFL What is that? LOL...just kidding.\nAfter going broke I figured out very few things kill you, so try something new! https://t.co/MjrkUvBl4W Fear shouldn't get a vote in how you live your life. Great advice from @ChrisBrownOnAir's Life, Money and Hope podcast https://t.co/x76roRisrh This is fabulous! https://t.co/6gLzhFeAXv Get trusted answers to important investing questions from one of our SmartVestor Pros on @ChrisHogan360's #RetireInspired podcast https://t.co/m18IcEztFK Some BIG money mistakes can happen around the holidays. @ChrisHogan360 answers your spending questions tomorrow morning around 6:35AM ET on @foxandfriends. Tune in. Don't let overspending for Christmas follow you into the New Year. Get on a budget and stick to it with @EveryDollar https://t.co/zyS1abkv8x Catch @ChrisHogan360 on @FoxBusiness @MorningsMaria this morning around 8:20AM ET! Cash is KING! Take control of your money with great deals on our envelope systems and wallets https://t.co/Zg4wFXnS5W https://t.co/jwDFJyxULL CRUSH your competition by positioning your brand the right way. Excellent @EntreLeadership podcast with @andycunningham4 https://t.co/glvePq0UiE Sure...on the air until 4pm today...Central. https://t.co/R5wgcCFqQF @maximumSyntax Will do, thanks I might look better in an eye patch than a mullet/skullet.  #VFL Only UT has more fans who didn't actually attend the school nor play a down of football. #EvilBooster 5 steps to creating a STRONG leadership culture in your organization from @ChickfilA's Mark Miller (@LeadersServe) on the @EntreLeadership podcast https://t.co/glvePqivac Final hours of our Cyber Week sale. This is your LAST CHANCE to get Financial Peace University DVD Home Study kit https://t.co/R8dI7QLrYe https://t.co/Dbk62tlqZ0 Never argue with stupid people. They will drag you down to their level and beat you with experience. - Mark Twain Thanks for coming sir....great devo https://t.co/d51DqT9Ja4 If UT were to hire Gundy I might grow a mullet. Oh wait....that might not work. #VFL Don't just survive the holidays. Make the MOST of them. Great advice from @ChrisBrownOnAir on the Life, Money and Hope Podcast https://t.co/x76roRisrh Could the new tax bill affect your retirement savings? @ChrisHogan360 has your answers on @FoxBusiness @MorningsMaria around 7:30AM ET. Yep....see ya then. https://t.co/OdLlbwlCG1 You might be surprised. Come by the office when you are in Nashville and have some coffee and homemade cookies on us. https://t.co/EePb8xEWCr Cyber Monday is here. Take advantage of our BIGGEST discounts of the season TODAY! https://t.co/awcTAET1QE https://t.co/wVseedVcuQ Our pleasure. They don't let financial nerds pick football coaches. It is illegal in several states. https://t.co/581lnCTedy @KurtTheTooth Sorry. My team will be in touch. Get our top-selling books and products for some of the lowest prices EVER https://t.co/9a6UTJigJx https://t.co/JPunIIhRjL Love Pastor Craig....look forward to seeing you guys next year!! https://t.co/UyoUIYdqUW Awesome insight on career and life from The @KenColeman Show. Check out @simonsinek on today's episode https://t.co/AkOyy1WgVp Skip the mall and get the best deals HERE: https://t.co/Ko6cdNS4TE https://t.co/vHobxybm1P Happy Thanksgiving!! Grateful people are highly attractive! Plan ahead and check off everyone on your Christmas list BEFORE Black Friday https://t.co/jksjXad8ty https://t.co/RRaZEszR4F Leaders: Do not miss this. @JohnCMaxwell shares wisdom from his lifetime of leadership. https://t.co/tRVXpwJVt9 Making excuses will steal your time and your profits. Kick them to the curb. Powerful #BusinessBoutique podcast from @ChristyBWright https://t.co/SRcrZe1VYl Discover the power behind asking the RIGHT questions on the latest @EntreLeadership podcast https://t.co/glvePqivac Wow thanks for leading a FPU group....front row seat to life change. https://t.co/dMg6ywuO3m Wow thanks for leading a FPU group....front row seat to life change. https://t.co/uL7mhgShZ3 whooo hoooo...CONGRATS!!!! https://t.co/u9lFTWgVBZ LOL.....but still less than a Gazillion https://t.co/CCdmGt8BOj Love our team giving in the community!!! Well done!!! https://t.co/8L3vI2iO3P Very cool....congrats!!! https://t.co/ZiHdgWdPKF Lol.....zero https://t.co/CyfAtiPIHf Give your kids a gift that will leave a lasting impact. https://t.co/fEZ4konyme https://t.co/2a25wNEMoY Two of my favorites. https://t.co/6W8hTOjpu9 Nashville: Tune in to @WSMV’s @TODAYINNASH in the 11AM CT hour to get tips from @AnthonyONeal on how to manage your holiday spending. Our famous $10 sale is back! Get our number one best sellers for $10 each and check off everyone on your Christmas list. https://t.co/175Qt4367l https://t.co/GIMrjM1dJH If you're looking for some career direction, don't miss @KenColeman's advice on how to find your passion and your purpose on @foxandfriends tomorrow around 6:45AM ET Need a raise? Don’t miss @ChrisHogan360 on @FoxBusiness @MorningsMaria around 7:30AM ET. He’s got solid advice on how to discuss it with your boss. Very proud. Glad you enjoyed! https://t.co/dkBU4gSVrY Enjoyed spending time with @RachaelRayShow discussing how to budget for the holidays. Check your local listings for today's air times: https://t.co/3SZSqQxEMc https://t.co/mgTqew9lxe Just Announced: @EveryDollar budgeters can stream tonight's Money &amp; Marriage event live for FREE! \n\nDon't miss @RachelCruze and @LesParrot sharing how to get on the same page with your spouse when it comes to your money AND your marriage. Your small business CAN grow. \n\nLearn to scale up on the latest @EntreLeadership podcast https://t.co/glvePqivac Wow....very true. Lots of memories in that home. https://t.co/d5s9TdoZML Thanks to all who have served. We have freedom because of you. Happy Veterans Day Thanks for tweeting this link. Excellent article. https://t.co/aYryM0MGFY Thanks for serving the community team! Proud of you! https://t.co/XmxFnQwKRL Wow...look at you representing!! https://t.co/SS7Ezn74Hv Great Hit! Proud of you! https://t.co/e3rv6reFbJ Very cool! Thanks for using the world's best budgeting app. @EveryDollar https://t.co/V1ryVttjET We don't mind being tired...exhausted....if you can measure success for your efforts. Visible Traction Matters to Motivation. Tune in to @FoxBusiness @MorningsMaria around 7:20AM ET to catch @ChrisHogan360's expert financial advice. Fun hanging @foxandfriends this morning. https://t.co/x7Ab6qudMV Thanks for watching https://t.co/nU3T2Sl5Fq Thanks so much https://t.co/ysCvBVVYrC Glad to be in studio at @foxandfriends this morning with @ChrisHogan360, @AnthonyONeal, and @ChrisBrownOnAir to answer YOUR money questions live. Tune in around 8:30AM ET. Here's your chance for an UNFORGETTABLE trip, one-on-one coaching with brilliant leaders and SO much more. Enter now https://t.co/MlQsFqNmem https://t.co/mMA8KM08CA LIVE NOW from our Smart Money event: My most-requested talk and the money advice that all of America needs to hear: https://t.co/mPudOhzEK0 Proud of our team in the community. https://t.co/KhoFJmMRLm #Phoenix - Don't miss @ChrisHogan360 on @azfamily this morning with expert advice on saving money this Christmas season. Quit worrying about your competition &amp; move into your own unique playing field. Insightful @EntreLeadership podcast https://t.co/glvePqivac Get a proven plan for dumping debt &amp; winning with money TONIGHT on our Smart Money LIVE stream. Register now https://t.co/0nVHq7S9Cy https://t.co/bDT6Kqrqrj This is going to be great. https://t.co/zk01yTVIEl Praying for the folks of Sutherland Springs.  So sad. Such evil. Incredible 3 days. Proud of you and our team. https://t.co/CDlASdkXAu Yep https://t.co/TqLdaglfwf #Nashville don't miss @RachelCruze today on  @NC5_talktown discussing ways to set clear financial goals with your spouse. The All-New Ramsey Book Club includes books that have changed MY life. Join now: https://t.co/Z5avsTLKRu https://t.co/54F82Ncm3K Cause I was. Lol https://t.co/JSAY8BRlN2 You werent anyway. I can live with that. https://t.co/DYTDiUxRO3 Your money matters, and so does your marriage. #Nashville don't miss @RachelCruze &amp; @LesParrott's event on Nov. 13 https://t.co/MUfhthNX6x Nashville: Catch @RachelCruze LIVE on @FOXNashville in the 8AM CT hour sharing how couples can work together to win with money. Don't miss your chance for an incredible Boston experience and a personal coaching session! https://t.co/hfwN9uGmYR https://t.co/NUjTXPfD7L Heading to Chicago to host National Radio Hall of Fame tonight. Inducting my friends @bobbybonesshow and @seanhannity among others. CONGRATS Thanks for leading a class https://t.co/OWaC9VlYwo You don't have to be a money expert to help change lives. Spread the message of Financial Peace to your community https://t.co/2Pn8Ljqnoh Leaders: You're not alone. Get inspiration &amp; motivation from business owners who attended @EntreLeadership 1-Day https://t.co/glvePq0UiE The kids are here for candy https://t.co/wslX3jaBYO Nope. Sorry, I dont think that exists. I guess too many of us carnivores out here. https://t.co/IAwxjO45S5 Get a clear vision for your money and the plan to make it happen. Watch our Phoenix Smart Money event LIVE Nov. 7th https://t.co/PUsPidvVfS Millennials are cutting their spending to save for their future. Hear more from @ChrisHogan360 on @MorningsMaria around 7:20AM ET Seize the Day! https://t.co/Y2aKwgc2kN A ship in port is safe, but that is not what ships are built for. - Grace Hopper Yes, AMAZING...the sound track of my teens. Guys can still play and Vince Gill is a super star. https://t.co/AV6ISjeowd Thanks for coming! Great church! https://t.co/U8URJB2hvT Thanks so much! You guys are great! https://t.co/RxFRlu93c4 Honored to be here brother https://t.co/MRlspLgRYE Thanks so much for joining us! https://t.co/vlBDUsHKgY Thanks for joining us! Great day!! https://t.co/bSII4DShWL Thanks for tuning in! Great Day https://t.co/bJKm0kl90p Thanks so much....great day!! https://t.co/Tm7R7h2NGi Yep. I get paid for endorsing a lot of things I believe in. HMMM. Do you get paid at your job? https://t.co/itiudPGhi8 Very Cool, Congrats!! https://t.co/0WSvRzfCBQ It is, check out @andreselmachete https://t.co/cmCgJ1WYxg Ramsey team Spelling Bee. Cut throat https://t.co/4I1JM8X38M Hey Atlanta join us Sunday! Church is Free! https://t.co/UcM9V1QHcW What your future looks like is up to YOU. Take charge of your retirement plan and listen to @ChrisHogan360's podcast https://t.co/m18IcER54k Last chance to register for tomorrow's @EntreLeadership 1-Day LIVE stream. It will grow your business &amp; your profits https://t.co/kgQqEp9Z20 There it is!! Boom https://t.co/KXFdMB5XUI How big an ole boy are you? Big fan https://t.co/t3hy9q1Xvg Modern day muscle car. Beast. https://t.co/pd5Bk9Y7wO Don't miss your opportunity to experience one of our life-changing live events this year. Check out the lineup https://t.co/ioLaDLBmxm I read it last weekend. Loved it. https://t.co/Vd5a58P5e1 You deserve to win in business. Join us THIS FRIDAY from anywhere for the @EntreLeadership 1-Day live stream https://t.co/rTf1ZtVv45 Excited to be in Atlanta Sunday. Join us, Church is Free https://t.co/RF64wngAxd Your company's values shouldn't be collecting dust. You need to ACT on them. Awesome @EntreLeadership podcast https://t.co/glvePq0UiE Finished the book yesterday. Great read Brian! Proud of you.. https://t.co/MwHYWKv8J1 Run your business. Don't let your business run you. @EntreLeadership 1-Day Live stream will be a game changer https://t.co/IhectaIPmX https://t.co/TfHyAr4OUs Anyone can win with money. It starts with getting the right information. Catch our Smart Money LIVE stream on Nov. 7 https://t.co/DozcfUSrls https://t.co/RyrQ0qSktq Tune in to @foxandfriends tomorrow morning around 7:40AM ET, I'll be on live to answer your viewer questions. So glad to have you Pastor. https://t.co/WhvjagGTwx RT @RamseyShow: On today's show, @elshowdeandres joins @DaveRamsey to talk about his new book, Transforma tus Finanzas en 30 Días. https://… With 40 of top Pastors in US last 2 days. Our event closed w rooftop concert @AmyGrant @michaelwsmith  @StevenCurtis #iconic Wow https://t.co/Cm0NyVcOkI Proud of @elshowdeandres and his book! Spreading the message of financial peace to the Spanish-speaking community https://t.co/0HXx2uS4y5 https://t.co/vS3DlKDpsz Clarify your message and people WILL listen. Strong @EntreLeadership podcast with marketing expert @donaldmiller https://t.co/glvePqivac Nashville- Your marriage is worth it. @RachelCruze &amp; @LesParrott knock this one out of the park. DON'T miss it.  https://t.co/PNzqVQxfjF Business is about PEOPLE. Take your team to the next level with our @EntreLeadership 1-Day LIVE stream https://t.co/xmCXLCcuUN A new kind of leadership book from @scottsauls. Stay grounded in your character and great things can happen. \nhttps://t.co/Ajv6ecNP6j No matter what your past looks like, you CAN have a great future. Solid podcast from @ChrisHogan360 #RetireInspired https://t.co/m18IcEztFK https://t.co/HueBCZWJOI Thur Oct 12 7PM w The Shack author @wmpaulyoung Free tickets for leaders of faith-based orgs https://t.co/uNFqnA9i8f LOL...must be a whole life salesman. No I don't own Zander Insurance, Jeff Zander does. They buy ads from me because I believe in them. https://t.co/aXzxErOI6t Now is the time to make a change. Financial Peace University is the plan that works. https://t.co/37074QhBb3 Unrelenting Action is what turns starry-eyed daydreams into steely-eyed objectives. - Roy Williams This is a big book day. StoryBrand by @donaldmiller is out today! MUST READ!! \nhttps://t.co/WFqORDxMY2 Honored to be part of this https://t.co/QV783ggupQ Helping your kids pay for college is great, but put your retirement savings first. Get @ChrisHogan360's advice on @MorningsMaria 8:20AM ET Excited for my friends @christomlin &amp; @darrenwhitehead as they release their book #holyroar today. Check it out: https://t.co/wX0lDewUmD A hobby costs you money. A business MAKES you money. Don't miss @ChristyBWright's Nashville #BusinessBoutique event https://t.co/U7fLWKhqhd The solution to most of your problems is YOU. Start by understanding the advantage of discipline https://t.co/glvePqivac @PaysForMissions Lol....not a chance. My team will be in touch. Get out of your rut. @KenColeman has advice on 3 things you need to do to advance your career on today's podcast https://t.co/AkOyy2dSjZ Watch @RachelCruze on today's @RamseyShow with a special anniversary offer on best-seller Love Your Life, Not Theirs https://t.co/HHZApWBbTJ Thanks Bro. As always fabulous message. https://t.co/oKxtjqlov4 There's no excuse not to handle your money well. Get a plan and stick to it with a free @EveryDollar budget https://t.co/sb9IPI0mHU STOP chasing someone else's dream &amp; learn to love YOUR life with @RachelCruze's best-seller at an anniversary price https://t.co/3CFLAa0BvS The biggest way you can help those affected by the tragedy in Vegas is to donate blood. Find your nearest Red Cross: https://t.co/HWjZjHjnCE Praying for the hurt and hurting in Vegas. Lord Jesus heal our land. The Dawgs were beastly....well played GA https://t.co/W4JgR6lPUF It’s football time in Tennessee. #VFL #CheckerNeyland https://t.co/kqF9BAWFtn @317MarkWalker Lol...My team will be in touch. Sounds like a SV Pro shouldnt be. Leaders: you can't afford to miss our @EntreLeadership 1-Day event. Watch LIVE w/ your team https://t.co/XCuz9tLl0A https://t.co/9WRFrLzGSV You can't go back and make a new start, but you can start right now and make a brand new beginning. \n- James Sherman Join my friend @MansfieldWrites in restoring noble manhood with the @GreatManTV movement! #ManlyMen https://t.co/MQlPC1tuMR You CAN recover from money mistakes. Learn how from @ChrisHogan360 on this week's #RetireInspired podcast https://t.co/m18IcER54k The great thing about initiative is that it is free and available to everyone. - Maria Bartiromo Catch @ChrisHogan360 on @foxandfriends this morning around 7:50AM ET answering your viewer questions on money and retirement. Boom...Look at The Ken Coleman Show....#8....great work guys!! https://t.co/sQyEccSPi3 Feel like there's never enough time? @ChristyBWright will equip you to use yours for what matters most. https://t.co/gTR3Sj5rFj https://t.co/jP9MnUayHm Equifax CEO \"Retires\" three weeks after worst data breach in history. In Tennessee we call that getting fired. We didn’t tackle well, made up for it by not blocking. John McKay Should you have debt or a mortgage in retirement? @ChrisHogan360 has the answer tomorrow on @FoxBusiness @MorningsMaria around 8:20AM ET Congrats to our friends John Rich and Big Kenny....#1 is about as good as it gets cuz. https://t.co/sG1V8UyCnu Some of history's greatest leaders found courage in times of solitude. Great insight on the @EntreLeadership podcast https://t.co/glvePq0UiE Praying for the families affected by the shooting at Burnette Chapel in my hometown today. Sad mess. @drewcollins Actually that is a church I attended about 12 years ago. Dan Scott is a wonderful friend and pastor. When making a financial decision, there are 20 things you should NEVER do. Good advice from @ChrisBrownOnAir https://t.co/x76roR0RzJ FPU classes have been the answer for millions of people to take control of their money. It's probably yours too https://t.co/f1uUaI0mMO Learn the proven plan to get out of debt and get the inspiration of a live event without even leaving your house https://t.co/BE02srkodJ https://t.co/F7snrJwpgu Indianapolis: @ChrisHogan360 has advice on how to get your financial house in order tomorrow morning on @FOX59 around 9:15AM ET Thanks....the views are exploding. https://t.co/NhvHQMCBg4 Call me and I will let you know when I care https://t.co/Wxi488ZAs8 Caller just mentioned eyes leaking like mine did watching our documentary. You will be big time motivated...watch.. https://t.co/BKZHJu31pf @americangun If you are not a college student from an affluent home then I dont think Sowell is talking about you. Sowell is an interesting read. Wow https://t.co/2QzVnxnV3h Amen https://t.co/tG0ZEFY3db Personal finance is 80% behavior and 20% head knowledge. Turns out my financial problems were a heart problem, not a math problem Thanks for having me...wonderful evening...wonderful people https://t.co/zh2vXu4Blj Success is a little like wrestling a gorilla. You don't quit when you are tired- You quit when the gorilla is tired. - Robert Stauss Every leader needs to know @patricklencioni's 3 non-negotiables for hiring. A must-listen @EntreLeadership podcast: https://t.co/glvePq0UiE Amen https://t.co/bhpYyge7uI Heading to Benton Harbor Michigan today to speak to the Economic Club of Southwest Michigan tonight. Great group. A man must be big enough to admit his mistakes, smart enough to profit from them, and strong enough to correct them. - John Maxwell ohhhh....love this https://t.co/oBhF1v79k6 This isn’t about me. It’s about you. Every listener. Every caller. YOU built The Dave Ramsey Show. https://t.co/ulERJZOlzn Life is too short to dread going to work on Mondays. Take charge of your future and listen to The @KenColeman Show https://t.co/AkOyy2dSjZ Get on the same page with your spouse. Don't miss @RachelCruze and @LesParrott's Money &amp; Marriage event in Nashville https://t.co/2jn8G2WlAj Even if you are on the right track you will get run over if you just sit there. - Will Rogers Headed your way....this will be fun. https://t.co/EANPpc72Ju The real glory is being knocked to your knees and then coming back. - Vince Lombardi I am speaking Saturday night and both services Sunday at Calvary Chapel Melbourne Fl. @CalvaryCCM  Join us....Church is Free! Nope, Speaking at Calvary Chapel in Melbourne, FL this weekend. Come join us....Church is Free https://t.co/XCA5HnEkLq I love Tennessee https://t.co/jqKsQMIJ37 Everyone has to get good at one of two things; Planting in the Spring or Begging in the Fall. - Jim Rohn Transform your life &amp; your finances with Financial Peace University. Fall classes are starting all over the country https://t.co/5CSv725AUk We're bringing The Smart Conference to #BOSTON for the first time ever. Reserve your spot! https://t.co/2GEdMT5iVW https://t.co/wgIQERnHZa We recommenced Zander Insurance. https://t.co/Vb6SyPNQLV Grace https://t.co/iXvk6Zgkff Personal decision I guess. But sounds like a bad idea relationally to me. https://t.co/2FFSWjNect Country royalty in the House!!! https://t.co/jEhvOeeW7p Looking forward to it my friends. https://t.co/mk2fCzZy7x LIVE now from the NYSE, @ChristyBWright has the business advice you need to hear on @cheddar #CheddarLIVE \nhttps://t.co/gxexnsN3MU Great conversation between Heisman Trophy Winner, @EddieGeorge2727 and @ChrisHogan360 on leaving a legacy: https://t.co/m18IcER54k Yep https://t.co/ptCpTh9WBR The most unprofitable item ever manufactured is an excuse. - John Mason Watch @ChristyBWright live tomorrow morning around 9AM ET on @cheddar #CheddarLIVE She's got solid advice on starting &amp; growing a business. Take your business to the next level with @ChristyBWright's #BusinessBoutique event this fall. Register now: https://t.co/wvx9rduBgq Excited to be on @FoxBusiness @MorningsMaria with @ChrisHogan360 this morning around 8:10AM ET - tune in! The Ramsey team coming up on @foxandfriends https://t.co/tzcqMEt4uM Good morning NYC - I'll be on @foxandfriends around 7:30AM ET with @ChrisHogan360 @ChristyBWright @KenColeman. We've got a cool announcement Catch @ChrisHogan360 and I tomorrow on @FoxBusiness @MorningsMaria around 8:10AM ET sharing advice and some fun news. Tune in. Sharing exciting news on @foxandfriends tomorrow around 7:30AM ET with @ChrisHogan360, @ChristyBWright and @KenColeman. Don't miss it! Had fun on the @EntreLeadership podcast this week with @ablakethompson talking about the history of @RamseyShow https://t.co/glvePq0UiE Prayers for TX and FL this morning. Good strong people who will bounce back with God's help. The most difficult thing is the decision to act; the rest is merely tenacity. - Amelia Earhart yep https://t.co/AwOhWU4SE3 It’s football time in Tennessee!!! https://t.co/rzANiJe7h3 They lied https://t.co/0OyOFGZcWW Well played. https://t.co/CDSz6Acg1P So sad to hear about friend Troy Gentry passing in a helicopter crash in NJ. RIP Great guy. Country Duo Montgomery Gentry. Sure, we will talk about it on the air today. https://t.co/RPum2ss7sU Confidence is what happens when you have done the hard work that entitles you to succeed. - Pat Summitt Pun. https://t.co/FX5LZrGTZx Cool. @ChrisHogan360 and @AnthonyONeal rock! https://t.co/CpEVJoeugv Thanks ....glad you like it. Team worked really hard on this, I am proud of them. https://t.co/ZDLMReP38u You should not take the class. You are to smart. https://t.co/izKsWkJaIu .@ChristyBWright's #BusinessBoutique event is world-class. If you're a woman in business, you NEED to be there.  https://t.co/bJIoL2HBTw Ramsey Family Crest https://t.co/WmkwK1hh4N Pappa Dave is proud of these girls. https://t.co/8E2qPX7WeJ Wisdom https://t.co/HxTSCgB01A This is a re-run. Still funny. But a re-run funny. https://t.co/A4i5IMgluO A few tough decisions could be between you and the life you want. Make them! Solid advice from @ChrisBrownOnAir https://t.co/x76roRisrh Make your financial future better than your past. Sign up for a Financial Peace University class in your area today https://t.co/5hNsom4Zlt Too little confidence, you are unable to act; Too much confidence you are unable to hear. - John Maeda Praying for my friends in TX and in FL. this morning. Wow. Just. Wow. Good suggestions from my friend James.....Hurricane preparedness https://t.co/QZi1BDOpRw Great job this morning. Very proud of you sir. https://t.co/9y7QiYZlzy Great advice from @AnthonyONeal on saving, staying out of debt and paying off student loans this morning on @cheddar around 9AM ET. New @RamseyShow app lets you download episodes + watch offline. Available on Android and iOS. Download now: https://t.co/L1Pl07dOlk The way to get started is to stop talking and start doing. - Walt Disney Catch @AnthonyONeal on @foxandfriends tomorrow around 7:50AM ET. He'll be sharing money lessons that EVERY student needs to know. correct ...never said that https://t.co/qhJJPaYpLe RT @AustinSpomer: My work is enrolling all of us into #SmartDollar, I couldn't be more proud that my work cares about their employees finan… Learn to dump debt &amp; build wealth without even leaving the house. Join us for our #SmartMoney event LIVE stream https://t.co/4UKpd7gfjy I will be on the air....but my voice may be scratchy! Wow what a game! #GBO #VFL https://t.co/x8Jf53e1rW .@ChrisHogan360 will be on @FoxBusiness @morningsmaria around 7:50AM ET. Tune in! Wow.  Nice stadium @MBstadium. #GBO #VFL Heading to the new Mercedes Benz Stadium to see our Vols! #GBO #VFL Change your perspective and you'll change your outcome. Great @EntreLeadership podcast with sales guru, @iannarino https://t.co/glvePq0UiE Thanks Guys! Go Vols! https://t.co/c2TGcS9NzY Thanks Kat and thanks to all of you who posted Birthday wishes. https://t.co/DxEDCDUf3Q Glad you like it! You got this! https://t.co/4WtfwFufvN If you don't like something, change it; if you can't change it, change the way you think about it. - Mary Engelbreit You become what you think about. - Earl Nightingale Very cool! Congrats https://t.co/0bX8jXWgRz Happy to replace them, just call Customer Care, we should have your name on file...least we can do to help. https://t.co/VUv0sNihaA Awesome! Keep at it. You got this! https://t.co/IsUTVNRL74 Boom!!! Look at YOU!!! Proud of you!. Congrats! https://t.co/cVdCiQrwZZ When you walk with Purpose, you collide with Destiny. - Bertice Berry There you go pastor! https://t.co/lC2YE0tg6c You CAN get out of debt. You CAN find financial peace. Fall FPU classes start soon- make this your season of CHANGE: https://t.co/06qG884sCA LOL...or just trying to get their own money back. https://t.co/VRe9EN0TqQ Good point https://t.co/l42ZAKuhl9 Thank-you my friend. You guys are doing great work!!! Proud to walk with you. https://t.co/0aag4b1p7w Life is like a roll of toilet paper. The closer to the end you get the faster it moves. When I was a kid a year was a long time. Lol...wasn't easy but I pulled it off. Too long a story for 140 Characters. https://t.co/EeS9rosYkE Nice job Ed. @edstetzer https://t.co/4yDBIoRORc The chief cause of failure and unhappiness is trading what you want most for what you want right now. -m Zig Ziglar LOL...\"Everything you read on the internet is true.\" -Abraham Lincoln. Joel is a good man and that is a good church. https://t.co/QLJ884RNU9 If you are affected by Hurricane Harvey or want to help, here's what you need to know: https://t.co/0XuIKepfVo Our team stands with Texas. Here's another way to help https://t.co/inTtqF9G8b https://t.co/pvfItOVk9q We stand with #Houston. We're praying for you. Join us in supporting organizations doing great work on the ground: https://t.co/9n9qOX1YAv https://t.co/RKCcVnx18a Great info on personality, relationships and finance from @ChrisHogan360's conversation with Dr. @LesParrott: https://t.co/m18IcEztFK Working hard for something we don't care about is called stress. Working hard for something we love is called Passion.-Simon Sinek SmartVestor Pros are who we vet and endorse. Here is the link:\nhttps://t.co/yYCgBpiKxs https://t.co/gJDyrYKcYV We're bringing our Smart Money event to YOU! November 7, you can watch LIVE from anywhere. Don't miss this: https://t.co/oRy5Odv6Nb https://t.co/U2jZgWPOMs Finally, a way to actually be SMARTER while using your smartphone. Get the new @RamseyShow app for iOS or Android: https://t.co/H8D6XnKsKb https://t.co/G6wio12qRu @RamseyShow Very Cool new toys Try this https://t.co/LbzZ200JoQ https://t.co/JgYGqwPLf3 Negative people don't change the world. Positivity always wins. Awesome @EntreLeadership podcast ft. @JonGordon11 https://t.co/glvePqivac That is Federal Law 😀 https://t.co/8qEn3VqEkT The people of Texas are strong and will bounce back. Right now they need our prayers. Opportunity is missed by most people because it is dressed in overalls and looks like work. - Thomas Edison Wow...Praying for SE Texas...such floods. The Bee is such fun. These guys are a blast https://t.co/lEbE4uLRho Congrats!! Proud of you! You got this! https://t.co/Yy1IwtyedB Great Article ...I will use this Monday https://t.co/CJfciNwHSI Praying for Houston. This Harvey is not a six foot rabbit. Your story doesn't have to be perfect to make a difference. Great Life, Money and Hope podcast from @ChrisBrownOnAir https://t.co/x76roRisrh Thanks for listening https://t.co/QBt3WF42Ke You got this! https://t.co/wm8mt1Su9T It might be a sign how old I am...but I LOVE this https://t.co/X8SbkZVW4O Get the motivation you need to WIN at one of our life-changing live events this fall: https://t.co/8SInaiq7QF The LAW already said that. And the DOL reg actually harms consumers because the advisors are not free to do the right thing. https://t.co/BUH6XMRGqB Boom https://t.co/ue0WHo5DnV You CAN do this. You can WIN with money.\n\nDon't miss this chance: https://t.co/1sCaBLJKox https://t.co/zNkfF8VMOM We're celebrating 25 years of the Dave Ramsey Show and we want YOU to join the fun. Enter for your chance to win: https://t.co/uHNNyVkwD9 https://t.co/U85wo7H3Vw @Ken_Mott @BlindscomCEO Sorry, My team will be in touch Wow....gonna be a week full of overused \"totality\" comments. Tell your money where to go instead of wondering where it went with an @EveryDollar budget: https://t.co/tWqmVIXpOl As long as you believe it is impossible, you will never find out if it is possible or not. - John Seymour Love it!!! Congrats Guys!!! https://t.co/PFZhf26XF4 Celebrating 25 years of The Dave Ramsey Show tonight with a @SIRIUSXM Town Hall. Watch live on Facebook: https://t.co/mPudOhRg8A https://t.co/mbicKDyygZ Yes, you can roll that. https://t.co/GtKfsqv1oX Honored that our Smart Dollar program was put in place by your leadership team! https://t.co/phHDbuH4CC Don't be intimidated by your competitors. LEARN from them. Awesome advice on the #BusinessBoutique podcast: https://t.co/SRcrZe1VYl Yep https://t.co/7uhFaUMKtI Turn common financial fears into triumphs with great advice from @ChrisHogan360 on @FoxBusiness @MorningsMaria tomorrow around 7:20AM ET Some of our team watching eclipse including Kellie, Kay, Dorothy https://t.co/RkThxjeWwx LOL....noticed that myself https://t.co/e9WjGpKHRH Even as a TN fan I LOVE Saban press conferences....he is a trip. https://t.co/967JPJXjlf Life is like a 10-speed bike, most of us have gears we never use. - Charles Schulz Excellent @EntreLeadership podcast ft. @MansfieldWrites on avoiding leadership pitfalls and embracing confrontation: https://t.co/glvePq0UiE The bad news is...You are the problem. The GREAT news is YOU are the solution! You got this. Congrats!!!! You are a hero! https://t.co/KwiXVj7ApV Happy Birthday Shady! https://t.co/EpDTABew7i You work too hard to have nothing to show for it! Join the millions who said ENOUGH &amp; found peace in their finances: https://t.co/nZeGJ9MLA3 Yes...by the Ramsey Personalities. https://t.co/7ZngIHKPbt Smart Money event tickets are going FAST. Get yours while you can and learn how to STOP living paycheck to paycheck: https://t.co/lzkZhaJodj To win w/ money, get on the same page with your spouse. #RetireInspired podcast ft. relationship expert, @LesParrott https://t.co/m18IcER54k https://t.co/skJNvMd99y RT @EntreLeadership: We are LIVE now on Facebook with @DaveRamsey and @KenColeman talking about compensation plans that work! Join us! http… Hey @jeannettewall13 I read &amp; loved Glass Castle when came out. Masterful storytelling, just saw @GlassCastleFilm movie, made my eyes leak Good stuff Simon https://t.co/ZxDpD2XnJv Get a behind-the-scenes look at @RamseyShow and the lives changed here. Enter for your chance to win: https://t.co/itS2I19AKv https://t.co/qTUAmeSOh8 From millennial money habits to retirement, get a dose of financial wisdom from @ChrisHogan360 tomorrow on @MorningsMaria around 7:50AM ET. LOL...another lie...these people have no ethics whatsoever. https://t.co/6PXYq4xWzG LOL...yea...but who is the dummy? https://t.co/O5DMuKo6Qs Wow....amazing!!!! Congrats! https://t.co/erpl5NT6zQ One of our coaches can help you...one of our team will be in touch. https://t.co/UM5hzHAdPV Sounds like it is time to go. But you already knew that. https://t.co/O0eCMD1M0p Meg is awesome! https://t.co/TmVjb6hwAH We proudly endorse Time Share Exit Team. @TimeshareExitTM for getting out of Time Shares. https://t.co/YAG11OGSA7 Yea, Time Shares SUCK and most of companies selling them are scum. You can tell they are lying if their mouth is moving. https://t.co/JFMMWlYeoD If you're tired of hearing no, get a yes more often w/ advice from @RobertCialdini on the @EntreLeadership podcast: https://t.co/glvePqivac Don't try to go it alone. You need people. Excellent insight on cultivating community from @ChrisBrownOnAir: https://t.co/x76roR0RzJ Spouse attends free https://t.co/n2zQvRXRvU Awesome!!! You Got This! https://t.co/grewVUGlD2 Yea....first time I saw those......well .... https://t.co/Xxm9VRwaUX Graduate Survival Guide for HS Students by @AnthonyONeal and @RachelCruze ...its a National Best Seller https://t.co/Le7pNdfsc6 My dog did the same exact thing. Go figure. https://t.co/yJSQeMeSQn Debt is DUMB, cash is king. \n\nHuge sale on our envelope systems and wallets: https://t.co/z1bQjs0vwa https://t.co/03SCKh9vNW Students: money stress can be avoided. If you're in the Kansas City, MO area, catch @AnthonyONeal on @fox4kc around 8:45AM CT to learn how. Indianapolis, IN: Don't miss @AnthonyONeal this morning on @Fox59 around 9:15AM ET - He's got advice on creative ways to save in college. Church leaders: The latest #LeadershipMomentum podcast is a must-listen. Everything from multisite to worship: https://t.co/tRVXpx1wkH It's your money. You should know where it's going. \nDownload @EveryDollar: https://t.co/rTAr7y9Tmd What you read MATTERS. \n\nGet a plan to win with our best-selling books. Today ONLY get 1 for $12.99 or 2 for $22: https://t.co/sjVYBeyLTj https://t.co/NaQghMyAAf If you run a business, you're a writer. Tips on @ChristyBWright podcast ft. @WomansDay Editor-in-Chief Susan Spencer https://t.co/SRcrZejxmV You will retire, but your kids may not go to college. Hear how to save from @ChrisHogan360 on @MorningsMaria tomorrow around 7:20AM ET Have you seen the WAPO article that Christians Blame Poverty on Lack of Effort? Truth about poverty on Today's Show https://t.co/yiAWZb4mZ1 Want a chance to come hang out with me and my team in Nashville? We might even have beans &amp; rice for lunch. \n\nEnter: https://t.co/Ypzd68IF8Z https://t.co/0MYtTDg4b1 Excuses produce failure. Don't give up! Great @EntreLeadership podcast ft. @jontaffer on how to rescue your business https://t.co/glvePq0UiE If you own a small business, @ChristyBWright has the practical, real-life advice you need to increase profits: https://t.co/odcYsoSVtX It takes strength to be gentle. Lord, Help me to be stronger. Forgiveness isn't a weak thing, it's a powerful thing. Awesome Life, Money and Hope podcast from @ChrisBrownOnAir: https://t.co/x76roR0RzJ @mikewillingham @EntreLeadership Sorry, Team will be in touch Legend alert. The Darryl Strawberry just stopped by to say Hi https://t.co/VucSZVpYlt @ChrchCurmudgeon @ImJimR87 Yea, so I just bought your book. Looking forward the smiles. OK...now. THAT. is. FUNNY https://t.co/fx35hz9xK0 Mike Fisher @mikefisher1212 Retires from hockey after 17 years. Wonderful career my friend. Proud of you. Strong Man of God. Don't buy this to teach FPU...our team will be in touch to help you. https://t.co/MnA0sOS4O3 Kids are EXPENSIVE. Catch the money saving tips every mom needs to know on today's episode of The @RachelCruze Show: https://t.co/ILZxFco1IW There's never a better time than now to begin to change your life. Today ONLY: Save 74% on our starter special: https://t.co/sJIZlE3wxl https://t.co/JMklPAP8Fb Your retirement dream won't be reality unless you believe you can do it. Motivation on the #RetireInspired podcast: https://t.co/m18IcER54k LOVE IT!!! Well done Cuz. Comments after the article are why some species eat their young. https://t.co/wHFiqOClTZ Amen https://t.co/mxAdf6KrxQ I want to meet YOU! Enter our 25th Anniversary Getaway for a chance to spend the day w/ me in Nashville! Enter here: https://t.co/FCL5gsTQIx https://t.co/oVsnzSsspR There are 7 expenses rising faster than inflation rates. Hear what they are from @ChrisHogan360 on @MorningsMaria tomorrow around 7:50AM ET You would be right and you would be wrong. There is statistical evidence that generous people do better with money https://t.co/efH7KzFqeN I think you missed the point. When someone is generous like you that is a direct indicator of future wealth. Not the only one, but a good 1. https://t.co/pfWPrEpsvA Pappa Dave is REALLY proud!!! https://t.co/kEVnfk1d8V Nashville students, don't let money stress rule your life in college. Hear great advice from @AnthonyONeal around 11AM CT on @NC5_talktown. Millennials are growing up. It's time to meet Generation Z. Great insight on the @EntreLeadership podcast: https://t.co/glvePq0UiE Praying for Nashville @MayorMeganBarry and family this morning in midst of terrible loss. Financial coaches bring HOPE. Register for our free webinar and be entered to win a spot at our next coach training: https://t.co/mp22qfYq9k Nashville - Get this school year off to a strong start with great advice from @AnthonyONeal this morning on @FOXNashville around 8:45AM CT Join the millions of people that use @EveryDollar to make budgeting easier than ever before: https://t.co/PnjeN3T3Cc @rickyleepotts team will be in touch We are honored to be on this property. The Berry Family heritage is real in this area. https://t.co/moFqqZiRwL We were honored to have you with us today sir. We are proud Tennesseans. https://t.co/34663XeOPE Thanks to God, our team, City of Franklin, and Gov. Haslam @BillHaslam for attending today's Ground Breaking for our new Headquarters. https://t.co/1xG4dlFo6i The honor was ours Dee....You are an incredible young man. https://t.co/i7cwkatARx Thanks for coming to speak over us and pray over us for our ground breaking Pastor! https://t.co/5mj3klPQL6 600 team members in the heat to celebrate our ground breaking with us. All so we can help more people https://t.co/RbiWzIAwg8 Wow...what a day! https://t.co/BGQnMiaoWH Save time and money when buying or selling a home by using one of our trusted experts with a proven track record: https://t.co/5rptE5z6p5 God and grandma's ways of handling money are tried and true. Spread the wisdom by coordinating an FPU class: https://t.co/E2zSU8z0j9 No one will care about your idea if you can't communicate it well. Get solid tips on the #BusinessBoutique podcast: https://t.co/SRcrZe1VYl Attending one of our live events gives you the information and motivation to transform your life. Don't miss out: https://t.co/EzhBqhA3rU Tune in to @MorningsMaria around 7:20AM ET tomorrow to get solid advice on your money and your retirement from @ChrisHogan360. EXCELLENT episode of The @RachelCruze Show. Home hacks to save you money this summer. See it here: https://t.co/tFUIuhq4nx Great info on @EntreLeadership podcast from @LeaderChat's Ken Blanchard on the power of cross-generational mentoring https://t.co/glvePqivac I got 99 problems....and they all leave in 32 days when college football starts back. Lack of direction, not lack of time, is the problem. We all have twenty-four hour days.- Zig Ziglar Through wisdom a house is built, And by understanding it is established; Proverbs 24:3 You'll feel like you've given yourself a raise when you give every dollar a name. Start a free @EveryDollar budget: https://t.co/YW2gfCGToq Going FAST https://t.co/uatfDQnGX5 Boom!!!! No Income Tax!!! Great Gov. https://t.co/STVXh267P4 We eat at a bunch of them....LOL https://t.co/zfHEpoSZKG Yea, I know....bummer https://t.co/XpNKXJznIy He has better hair. https://t.co/EH3OLVMF9f When buying or selling a home, make sure you've got an agent with the heart of teacher. Our trusted pros can help: https://t.co/E84rEDhJVN Sorry dude, Never said that. Ding Ding. https://t.co/ZU2queNzQm Catch @ChrisHogan360 LIVE with info you need to prepare for the future on @cheddar #CheddarLIVE around 9AM ET: https://t.co/pr39b0Vu0Y Helping others win with money is easier than you think. Check out how you can be a part: https://t.co/MGItTmXtVp Your retirement is up to YOU. Get ready with advice from @ChrisHogan360 on the latest #RetireInspired podcast: https://t.co/m18IcER54k In life, there is going to be conflict. Being dramatic about it is YOUR choice. Great podcast from @ChrisBrownOnAir  https://t.co/x76roR0RzJ It's hard to win the game if you don't go to the pep rally. \nOur fall live events lineup is AWESOME. Check it out: https://t.co/1WfkDcVCg8 Get expert retirement advice from @ChrisHogan360 tomorrow morning around 7:50AM ET on @FoxBusiness @MorningsMaria If you've got home improvements or real estate on the mind, the latest episode of The @RachelCruze Show is for YOU: https://t.co/J2NhINCeno What makes economies thrive? Wisdom from world-renowned economist, Dr. Arthur Laffer on the @EntreLeadership podcast https://t.co/glvePqivac Point your money at your goals. Get on track with a FREE @EveryDollar budget: https://t.co/P9rT0DnzLs Glad to help https://t.co/ekRafWa983 Nashville: Catch @ChrisHogan360 on @TODAYINNASH today in the 11AM hour. He's got expert tips for saving money this summer. Make home ownership a blessing, not a curse. Great advice on episode 3 of The @RachelCruze Show today at 12PM ET https://t.co/66eq8ClfgX Love that song https://t.co/PXRpxaxjQw Oh..there you go https://t.co/rGiIVqWuAL I LOVE this.... https://t.co/EXkWxbK5B7 If you want uncommon results you have to engage in uncommon habits, beliefs, and actions. Yep....sounds like \"Leading\" https://t.co/lbcRtMoI13 We've extended the sale! You've still got a chance today to get HUGE savings on some of our life-changing products! https://t.co/KnSkVETysG https://t.co/vSanc8yXS3 Jump ahead of the competition and avoid business money mistakes with great advice on the #BusinessBoutique podcast: https://t.co/SRcrZe1VYl 2 days ONLY: We're having a sale on our top 20 products to help you take control of your money. PLUS free shipping: https://t.co/z3vmrizEip https://t.co/a9BaVgALeD If our ineffective paralyzed Congress worked for a real company they would all be fired in 24 hours. LOVE IT https://t.co/mRSStlU6YI Stay on top of your retirement goals with expert advice from @ChrisHogan360 tomorrow morning around 7:20AM ET on @MorningsMaria Together again. Missed ya. https://t.co/YkyxbuXpzS Gone are the days of traditional marketing. Increase your digital impact with advice on the @EntreLeadership podcast https://t.co/glvePqivac I NEVER run into that anymore. Who? https://t.co/zLStcnnqYm Down time, Sabbath, is needed to heal and reset your mind, body, and spirit to get back after it. Recreate...RE- Create. Give instruction to a wise man, and he will be still wiser; Teach a just man, and he will increase in learning. Proverbs 9:9 People with terminal illness.  Everyone else has time to fix a mess. https://t.co/8se6rIuD5x Thanks for listening. I promise to remain a pain to stupidity https://t.co/UoqYKrNTei You got this https://t.co/KsGd5k0v1n Thanks for listening https://t.co/OZhSYeOfxy Glad you like it https://t.co/1kR8Y6KvIu Go Vols! https://t.co/3z1F3O7Flk Thanks so much https://t.co/ZNDtHPgAgG Thanks so much https://t.co/JabkCALpSg I am a HUGE Bruce Williams Fan https://t.co/w61AQPxZVQ It is precious that \"cupcake\" thinks I have an attitude. LOLOLOL https://t.co/9DWyw2hWNb Winning with money isn't about luck. It's about being intentional. Start budgeting and start winning: https://t.co/Gar3Mn3myd Move up quickly in your career by simply working while at work, smile, and treat the place like you own it....CARE. Yep Yep https://t.co/T730pyFh6M Wanna win in Business? Delight the customer. How? Be Delightful, they are a person, not a transaction. Therefore, there is now no condemnation for those who are in Christ Jesus, Romans 8:1 Celebrating 25 years of doing our radio show. This in the lobby this morning. https://t.co/y6akPoG6ik Don't let today's spending turn into tomorrow's debt. Save money with tips on the latest The @RachelCruze Show: https://t.co/5up4riADDn Of all the words in the English language the most powerful one might be \"Choice\". You choose to do the things to win or lose. - Lou Holtz I am the servant of all great men.\nAnd, alas, of all failures as well.\nThose who are great, I have made great. - who am I  - I am HABIT A little sleep, a little slumber, A little folding of the hands to sleep-- So shall your poverty come on you like a prowler Proverbs 6:10-11 YEP https://t.co/zGusE6jIal Today!!! I have missed it. The rhythm of my life is messed up. LOL https://t.co/44ZOliHO6H Your retirement dream can become a reality. @ChrisHogan360's #RetireInspired podcast has the information you need: https://t.co/m18IcER54k Go Big John https://t.co/IU6DYma4Mz Ok, the 4th is behind us....back at it.....hustle and grind....nothing moves unless it is shoved. I love Summer. Be careful that your mature handling of money does not go on vacation when you do. and the peace of God, which surpasses all understanding, will guard your hearts and minds through Christ Jesus. Philippians 4:7 Happy Birthday America!!!! You big beautiful freedom beast!!! Best country in the world! Rejection isn't the end. It can be a HUGE opportunity. Don't miss this week's @EntreLeadership podcast: https://t.co/glvePq0UiE Find creative tips on saving money on your everyday expenses in the latest episode of The @RachelCruze Show: https://t.co/g9zpkqQfSI Having a plan turns your goals into RESULTS. Make a plan for your money with a free @EveryDollar budget: https://t.co/2fVRtvVnI6 Thanks to you folks and our wonderful team, Total Money Makeover just appeared on WSJ Best Seller list for the 500th time!!!! THANKS!! Change your mind and you'll change your life. Don't miss this @EntreLeadership podcast featuring @ThisIsSethsBlog: https://t.co/glvePq0UiE Celebrating 35 years with Sharon Today. As Shrek says, “That’ll do Donkay” https://t.co/N7xm9eL3XF @Avis @jimedgeton I could let millions know to use you if you could figure out a way to to simply accept debit cards. Insightful Leadership Momentum podcast featuring Pastor @ronniefloyd on navigating the many seasons of ministry: https://t.co/tRVXpwJVt9 The world needs what you have to offer. Great #BusinessBoutique podcast from @ChristyBWright featuring @JeanChatzky: https://t.co/SRcrZejxmV Retirement Expert @ChrisHogan360 has the money advice you need on @FoxBusiness Network's @MorningsMaria. Tune in around 8:50AM ET An emergency fund is critical to financial success and security. Learn more from @RachelCruze tomorrow on @foxandfriends around 6:20AM ET Congratulations @ChrisHogan360 on 1 YEAR and over 2.5 MILLION downloads of the #RetireInspired podcast! https://t.co/m18IcER54k On Episode 2 of The @RachelCruze Show, you'll learn practical ways to save money on everyday things. Don't miss it! https://t.co/uoqo0S7idO Your business CAN thrive in today's digital and creative marketplace. Learn how on the @EntreLeadership podcast: https://t.co/glvePqivac We were in Pamplona, Spain today where The Running of the Bulls happens in two weeks. Antique Bull chased my wife. https://t.co/RMmFSQlsBf We've got a jam-packed lineup of live events this fall! Don't miss your chance to be at one of them: https://t.co/2jFhWGz0RT Adding debt today will steal tomorrow's joy. Learn more on episode 2 of The Rachel Cruze Show - out today 12PM ET! https://t.co/JiVZ4yXGeT My good friend @VFTCoach just launched a new book about living a life of significance. It's a MUST read. https://t.co/3ITyfkG1Q8 https://t.co/o7KTkVTwLZ Praying for my friend, @LysaTerKeurst . Sharon and I are heartbroken with you. France or TN? https://t.co/dSAF1hyxxC Behind every successful man is a powerful woman....and a surprised Mother-In-Law Been married to Sharon 35 years on June 26. Just told her if she leaves....I am going with her. \nWhere should I take her to celebrate? It's never too late to invest in their future. Get the perfect gift for a recent high school graduate in your life: https://t.co/UsRSsS2hdo Catch @ChrisHogan360 on @MorningsMaria around 8:20AM ET. He's got great info about how your employer can improve your financial health. Learn to close the gap between the present and a successful future on the @EntreLeadership podcast ft. @melrobbins https://t.co/glvePqivac Pretty much answers the question which state has the coolest Gov &amp; First Lady https://t.co/BYrFEhy2AA Lol....nope same answer. https://t.co/jaQRshVopM In marriage, winning with money is a team sport. Great tips and insight on the 1st episode of The @RachelCruze Show: https://t.co/GmmQlUtZE7 @SarahNourse No, but we should. Thanks so much. I will have someone reach out and find a way to say \"thanks\" Our honor to have you and learn what kind of mom raises sons that are hero's. https://t.co/7go1piCq18 Don't miss Chris Brown @ChrisBrownOnAir https://t.co/fxTSqVueYO Great job!!! thanks for coming. https://t.co/MrC5KTFry4 The latest #RetireInspired podcast has @ChrisHogan360's best wealth-building tips. Don't miss it! https://t.co/m18IcEztFK That is a serious theological question. LOL https://t.co/CCS7X6PASE Ouch...gettin real ....Pastor... https://t.co/Enkn4PeuMd Went to the very first game 20 years ago....hardly band wagon. https://t.co/DrzHcSvg4v Man the Db's in that arena were off the charts. Most spectacular sporting event I have ever attended!!! Go Preds!!! @PredsNHL @PredsPR https://t.co/e55O9n8LLd For real....lots of our listeners rooting for that guy to get to go to the game. https://t.co/mmhmG52EpU It's your money. Give it a plan.\n\nStart your @EveryDollar budget today: https://t.co/ea2xnVSF6J Tune into @foxandfriends this morning around 7:50AM ET as @ChrisHogan360 answers viewers' financial questions. Go Preds!!! @PredsNHL https://t.co/O3PgimJDxB Catch @ChrisHogan360 tomorrow on @MorningsMaria around 7:20AM ET as they discuss how financial stress is impacting the workplace. Hey Scott, You just called a Hockey Player \"Kind\" during the playoffs. He is, but dont tell the other side. LOL https://t.co/69n8j9JIPt Happy Birthday Mike!! We will be there to cheer you on tonight. Winning game 4 would be a great birthday present. https://t.co/69n8j9JIPt Good one. https://t.co/o9edJPggsx Played Hockey growing up, coached my son's teams...attending my first ever Stanley Cup tonight in my own hometown Nashivlle. Go @PredsNHL !! Maximize your natural talents in leadership with the power of proximity. Awesome @EntreLeadership podcast this week: https://t.co/glvePq0UiE Go Preds Go!!! @PredsNHL Wow...that was a wild night!!! https://t.co/qRNxOFDUTf Never a bad way to start the day. https://t.co/FIjYj6Ir5g He stores up sound wisdom for the upright; He is a shield to those who walk uprightly; Proverbs 2:7 Take your business idea from dream to reality. @ChristyBWright has the plan you need. Get #BusinessBoutique today: https://t.co/lilrmw3AH3 Great Leadership Momentum Podcast from @ChrisBrownOnAir with @MarkBatterson on giving. Church leaders, don't miss it https://t.co/tRVXpx1wkH Very cool change. Proud of you!!! https://t.co/5EQ7f8S8Ly Good reminder https://t.co/ke9B24U1wG Check out our powerhouse lineup of live events this fall! We might be coming YOUR way: https://t.co/a4bb7SxYPF So Choose. https://t.co/uE5FjuGEGH Thanks Pastor...Good Start to the Day https://t.co/TqPk8jXUrZ Yep https://t.co/vlXwQaUYo1 God has His paint brush out. My deck tonight. https://t.co/LHDR9joOMz Catch @ChrisHogan360 on @MorningsMaria tomorrow around 7:20AM ET for advice on how to dodge bad money decisions that can lead to regret. See where your business is going &amp; how to get there w/ great advice on @ChristyBWright's #BusinessBoutique podcast: https://t.co/SRcrZejxmV The @EntreLeadership Summit was EXCELLENT. If you couldn't make it, hear my conversation with @patricklencioni here: https://t.co/glvePq0UiE Last chance to get an awesome deal on some of our most popular products from the $10 Sale! Ends tomorrow: https://t.co/39BKPe1vVx Hey @KarenVaughn_GSM ...@BradThor &amp; @AndyAndrews are friends, When Amazon gets fixed come on my Show, we will tell 13M ppl your sons a Hero! Big shoes to fill. Miss him. https://t.co/gKuHOnS26o Ramseys learn the fine art of boat driving early. “Pappa Dave” is my favorite title. https://t.co/7ic3KAbN6f Amen https://t.co/PBHgfI7lRV Wow https://t.co/ORlXEWspv5 Amen https://t.co/ebGqTrJ6nv Amen https://t.co/xvaCXb5F2i Amen https://t.co/tV782EOxc1 Amen https://t.co/G5ChENNxJL Amen https://t.co/jaIJQB5rW9 Today we honor, pray for, &amp; REMEMBER those paid for our freedom with their lives. #ProudAmerican FANTASTIC first episode of the @RachelCruze Show! If you missed it, catch up here: https://t.co/GmmQlUtZE7 Your plans impact your family too. Catch @ChrisHogan360 on @MorningsMaria around 7:30AM ET for advice on how to discuss inheritance. Love The BEE!!!!! Funny stuff....the photo shop is priceless!! https://t.co/V6vKhAiOP5 Only a few days left to get some of our team's life-changing books and tools for just $10. https://t.co/G11Oqv4agH Atlanta: Catch @AnthonyONeal on @GoodDayAtlanta around 8:40AM ET - He's got excellent info for high school grads headed to college! Amazing #EntreSummit To every EntreLeader who showed up, thank you for wanting to KNOW better and BE better. https://t.co/GKo3Hgaes2 RT @EntreLeadership: .@ESPNDrLou and @johnrich join @KenColeman to talk about their surprisingly simple rules for success! #EntreSummit htt… Get a crash course on how to make progress in ANY area of your life on the latest #RetireInspired podcast: https://t.co/m18IcER54k Reflection causes Experience to become Insight. @JohnCMaxwell is amazing @EntreLeadership Summit https://t.co/t8EVm7pkFn Thanks for coming my friend!! https://t.co/dBu3m3vsdl Don't miss the opportunity to win your share of $20K in our Summer Cash Kickoff! https://t.co/I2Ia6rsdF6 Simon thanks for coming to @EntreLeadership Summit!!! You were awesome my friend!!! See ya soon. https://t.co/7w6ki8r1Y7 Great guys. Lots of fun https://t.co/EwZwC2H5r5 The Lou Holtz holding court. Owning the room @EntreLeadership Summitt https://t.co/jSKOYj405s RT @EntreLeadership: .@DaveRamsey shares what every business owner needs to do to have the business they WANT! #EntreSummit https://t.co/jL… Give the graduate in your life the gift of wisdom that you wish you had before your college years. https://t.co/LddgRN5wBn Thanks for joining us @EntreLeadership Summit today Cuz! https://t.co/2WwJQB6oU3 Wow our @PredsNHL Nashville Predators are going to the Stanley Cup!!!! Congrats guys!!! Great interview https://t.co/B26p10QyYl RT @EntreLeadership: Here we go! @DaveRamsey's opening keynote from #EntreSummit on what it takes to WIN! https://t.co/7wA14uwnIT Love it https://t.co/sbtvpGiEYV RT @EntreLeadership: Wish you were here at #EntreSummit? You can be! We're going to live stream @DaveRamsey opening keynote at 9AM EST tomo… Love @IouiegigIio !!! https://t.co/cWw3ryBoDS 1500 Business Leaders w us @EntreLeadership Summitt in Orlando starts tomorrow. Set up underway. https://t.co/hcAT1TiOgl Wow look at our @PredsNHL Nashville Predators!!! Finish it at home guys!!! Thanks Jimmy. Honor to meet you sir.Wonderful World Class meal and service. https://t.co/ISHkPOOEA5 The Smart Money Tour is coming to a city near YOU this fall. Reserve your spot at the best price now: https://t.co/lxxjTlNG9a The debut of The @RachelCruze Show is almost here! Watch LIVE at 12PM ET / 11AM CT It's going to be good! https://t.co/GmmQlUtZE7 .@ChristyBWright's #BusinessBoutique is a #1 Bestseller! Grab your copy TODAY: https://t.co/wVqRexZSSu Great conversation on how to overcome giants in your life on @ChrisBrownOnAir's True Stewardship ft. @louiegiglio: https://t.co/JCoDEQYWV7 This is @megmeekermd  best book. I predict it will be a #1. EVERY father and mother should read it. https://t.co/dfUIxuerq1 Thanks for SELL OUT Orlando!!! Almost 5,000 folks coming. Get there early for a good seat! https://t.co/09o6qG2cUE \"Winners never quit.\" Yes they do, they quit doing stupid stuff that doesn't work. A man's gift makes room for him, And brings him before great men.  Proverbs 18:16 The @RachelCruze Show launches TOMORROW! Get the latest updates and info here: https://t.co/wTEtOTwoIy There's no better time to start than NOW. Get life-changing books + tools in our popular $10 sale: https://t.co/RTTZ7z1GeY You are either part of the problem or part of the solution. But YOU get to decide. Some folks walk around looking like they were weened on a pickle. If you are happy notify your face. SMILE A merry heart does good, like medicine, But a broken spirit dries the bones. Proverbs 17:22 Fabulous and fairly accurate. LOL https://t.co/V1RUo0EW92 If you aim at nothing you will hit it every time. - Zig Ziglar Some people get paralysis of the analysis. They say, \"Ready Aim Aim Aim Aim Aim.....\" You have to ACT on your plan, pull the trigger! A man's heart plans his way, But the Lord directs his steps. Proverbs 16:9 What would you do if you won? Don't miss your chance to make it a reality. Enter our Summer Cash Kickoff: https://t.co/USGZfFdcmu https://t.co/IWmIvI66tp Pensions can be a tough subject these days. Get advice from retirement expert, @ChrisHogan360 on @MorningsMaria tomorrow around 7:30AM ET This is Peter. HS Senior made 40k this year cutting grass. Paying cash for college. https://t.co/HO133DjWQp Obstacles will come your way, but it's YOUR decision to persevere. Excellent @EntreLeadership podcast this week: https://t.co/glvePqivac Proud of @RachelCruze and the team! This is going to be a game-changer. Sign up for more info on https://t.co/BBJ6McVPYD https://t.co/zjgrcRUV7R We live in a cause/effect and sowing/reaping world. When I plant Stupid in my life I get a full crop of Broke and Desperate. Doing the same thing over and over again and expecting different results is the definition of insanity. - 12 Step. Without counsel, plans go awry, But in the multitude of counselors they are established. Proverbs 15:22 Wow....just wonderful. We are proud of them too. https://t.co/t6knKMkQw3 Love it!!!! Annie get your gun!!! https://t.co/0cixXBVape Love Seth https://t.co/F0zbvnwDKW If you're in business, you're in the content business. Great marketing advice on this #BusinessBoutique podcast: https://t.co/SRcrZejxmV Thanks for having us my Friend! We are all Pastor Tim fans! https://t.co/wATg9gnJV0 No one wins the Super Bowl accidentally. Be intentional, Be Passionate, Don't mail it in! You got this! The lazy man does not roast what he took in hunting, But diligence is man's precious possession. Proverbs 12:27 Over 1600 Business Leaders for @EntreLeadership One Day today in Chicago w @ChrisHogan360 @ChristyBWright @KenColeman Thanks so much https://t.co/Z48Hac2R93 Thanks so much for having me today! https://t.co/kSKuAEqkuu Change starts with YOU. Save big on some of our best-selling books &amp; tools in our famous $10 sale: https://t.co/oAI7DTUTdV Thanks for coming to @EntreLeadership One Day in Dallas. Tomorrow in Chicago! https://t.co/48ZZU7olFR Wow....made my eyes leak. https://t.co/HCpsP1vXIs Heading that way. We will be with you guys today!!! Excited. https://t.co/IfR6QCkvrD Adults devise a plan and follow it. Children do what feels good. Whoever guarantees to pay somebody else's loan will suffer. It is safer to avoid such promises. Proverbs 11:15 Check out my friend Katie's new project. Amazing lady, amazing story!! https://t.co/G3SUTWrS2g Lol. Now THAT is funny cuz!!!  Love ya man. https://t.co/J6HNRsN4Zj Save for retirement or kids college fund? @ChrisHogan360 settles the score on the latest #RetireInspired podcast. https://t.co/m18IcEztFK Celebrate graduation season by giving guidance in the right direction. The perfect gift for high school seniors: https://t.co/GNhpxRocIC So I am 45 followers from having 800k on Twitter. I have serious mixed emotions as to that measure of winning. LOL The bad news is your Success is up to you. The great news is your Success is up to YOU. You got this. Get er done! Over 1500 Business leaders with us in Dallas today for @EntreLeadership One Day Event with me, @ChristyBWright @ChrisHogan360 #Pumped! My grandmother used to say, \"There is a great place to go when you are broke....To Work!\" He who has a slack hand becomes poor, But the hand of the diligent makes rich. Proverbs 10:4 Congrats!!!! GREAT https://t.co/SzWuHpkPSc 25 years later, debt is STILL dumb, cash is STILL king and there's STILL HOPE. So proud to celebrate @RamseyShow https://t.co/THkiFhGcPb Wow. @AnthonyONeal just killed it on @foxandfriends    Great job! It's time for a Summer Cash Kickoff. Chip away at your next baby step with a share of our $20,000 giveaway: https://t.co/Zh1GUKrBZv This https://t.co/J2GjRgfaU2 Opportunity is missed by most people because it is dressed in overalls and looks like work. - Thomas A. Edison The fear of the Lord is the beginning of wisdom, And the knowledge of the Holy One is understanding. Proverbs 9:10 Watch @foxandfriends around 7:45AM ET for solid advice from @AnthonyONeal that every high school senior needs to hear. God had his paint brush out tonight. View from my porch. Love TN. Courtesy of my pastor @DrEasley https://t.co/P2S2ErfnJ0 Coming up next! https://t.co/Qpl35IBNFR And the hits just keep on coming! https://t.co/a9ncjQQrcV Wow...would you look at that? Hmmm. https://t.co/VhSJCfEOTj Insightful @EntreLeadership podcast w/ @AdamBraun on the future of higher education. Leaders, you need to hear this. https://t.co/glvePqivac Meekness is not weakness, it is power under control. - Warren Weirsbe Success comes, not from a single event, but from persistence born of grit and character. You Got This Riches and honor are with me, Enduring riches and righteousness. (says Wisdom) Proverbs 8:18 Awesomeness!! https://t.co/yBRudWARbv Wow look at our Nashville Predators!!! @PredsNHL way to go guys!!! We are proud of you!! Just finished Born Fighting by Jim Webb @JimWebbUSA. Fabulous read. Great writer. @JDVance1 have you read this? Right beside Hillbilly Elegy So proud of @AnthonyONeal and @RachelCruze https://t.co/C9E3dvG7ax WOW!!!! 3rd Book for @RachelCruze and @AnthonyONeal and @ChristyBWright have their 1rst National Best Seller!!! WOW...Thanks to all of you! https://t.co/eFll4I0Me0 Find the education &amp; encouragement you need to start a business you LOVE with @ChristyBWright's #BusinessBoutique https://t.co/t3b0nMGoxI Boom https://t.co/wAi5FcSINq Ever done something stupid and lost money? Me too. I call it paying Stupid Tax and I have paid too much of it. When you work so hard...paddle so fast ..to catch the wave....enjoy the ride. and the peace of God, which surpasses all understanding, will guard your hearts and minds through Christ Jesus. Philippians 4:7 Wow. You and me on the porch with the big dogs. @louiegiglio https://t.co/VpKosUj2Iw Wow! @RamseyShow is turning 25 and we're kicking off the celebration on today's show. Don't miss it!  #TDRS25 https://t.co/8DTOmHVgPG Congratulations to @ChrisBrownOnAir on over 500 episodes of your radio show! Lots of amazing calls and lives changed https://t.co/0VpWkv9iba The highest predictor of success is self-awareness. Learn more on this week's @EntreLeadership podcast ft. @iancron https://t.co/glvePq0UiE East Coast: Catch @ChristyBWright on @HisRadio this morning around 8:30AM ET - She'll be sharing about #BusinessBoutique &amp; more. Best-selling author + retirement expert, @ChrisHogan360 will be joining @MorningsMaria on @FoxBusiness around 7:50AM ET. Tune in! Make plans to catch @RachelCruze tomorrow on @foxandfriends around 6:30AM ET. She'll be answering your money questions. Wow https://t.co/cOmfrppk4N Catch @ChristyBWright on @RamseyShow today in the 3PM CT hour. She'll share stories from her #BusinessBoutique book tour. Don't miss it! Wow...just so much sad going on at once here. https://t.co/XDfBwwhOiP Love it!! Way to Go Folks!! You got this https://t.co/3xVtxMxC9i THAT is funny. Love it and I agree. https://t.co/w9vZmFvBV1 The famous $10 Sale is back! Choose from 40 books and tools to help you take control of your money. https://t.co/B7MOl1WxkY Begin your summer by entering our Summer Cash Kickoff! We're giving away $20,000 in May! https://t.co/ro32OJqbld Canceled @ChristyBWright book signing in LA today. Not sending my team into the middle of crazy protesters. Money leaves people who don't manage it and flows to those who do. First of month. Do your Budget. @EveryDollar The fear of the Lord is the beginning of knowledge, But fools despise wisdom and instruction.  Proverbs 1:7 Thanks so much for coming!!! https://t.co/fd3XzQD8vR Never wage war with a drive by shooting....move in next door and lay siege! Never Quit! You got this! Hey #Phoenix: @ChristyBWright is chatting with Bruce &amp; Pamela on @KTAR923 about #BusinessBoutique around 11:30AM PT Tune in! Anything written by @megmeekermd ....new one called Hero..May 15. \nBoys Should be Boys https://t.co/gnLnQ4BY0L Success is the best revenge. Been  mistreated, lied about, beat down? Rise up. You got this! Be so good they can't ignore you -Steve Martin. A faithful man will abound with blessings, But he who hastens to be rich will not go unpunished. Proverbs 28:20 Teachers: Don't miss out! Only 2 days left. https://t.co/h9Vf9ka9pR https://t.co/16n7h6RM9T #Phoenix: Tune in to @AZFamily's Good Morning AZ around 8:15AM PT for @ChristyBWright's tips on turning your passion into a profit. .@louiegiglio joins @ChrisBrownOnAir on the Leadership Momentum Podcast. It's a must-listen for any church leader. https://t.co/tRVXpx1wkH #Phoenix You're up! Head to B&amp;N tomorrow at 6PM for @ChristyBWright's #BusinessBoutique signing &amp; $1000 giveaway! https://t.co/AaNmv1Du9p https://t.co/ywAc8Vlq76 YOU can be part of the #BusinessBoutique movement. Don't miss @ChristyBWright calling in on @RamseyShow today around 2:15PM CT The #BusinessBoutique movement has made it's way to #ColoradoSprings. Catch @ChristyBWright on @krdonc13 in the 12PM MT hour!"}