{"tweets": "@Eekachu Incredible. Iconic. Inspirational. Insightful. Illustrious. Infallible. RT @Eekachu: I carved a punkin. 🎃 OCTOBER 30th!!! #AHWM #AHeistWithMarkiplier #markiplier #YouTube #YouTubeOriginals https://t.co/EkiTaNDTjj @Jack_Septic_Eye Thanks mah dude 🙏 @CrankGameplays Thanks ya freak @Girbeagly Maybe private screening just for you when we get back. But don’t tell nobody. @Girbeagly @CrankGameplays SOMEONE 🚨 CALL 🚨 THE POLICE 👮 👮‍♀️ THIS MAN IS A MONSTER 🛑 @Girbeagly @CrankGameplays AW NOW THAT IS RUDE you better whitelist me! I should have known that a STINKY like you would make a low STINKY move like that to me! This will NEVER be forgiven! @Girbeagly @CrankGameplays woah hey now it was just a joke man cool it jee whiskers please don’t be mad I promise I’ll be good 🙏 @Girbeagly @CrankGameplays I fear chaotic stinky that bad lol gottem We did the dang premiere thing last night! People just ended up shouting which way they wanted to go which is the optimal way to watch imo https://t.co/MgeDddnC7P @CrankGameplays @Girbeagly This is exactly the reason why I conveniently fly out of town every time he comes to LA... @LordMinion777 Good. Great. As you should. I’ll report her to the police immediately and use you as a witness to this heinous crime. Thank you for your help in condemning this rampant criminal. @LordMinion777 Dude I don’t know... Austin’s COFFEE CULTURE is world renowned. To disrespected the COFFEE CULTURE here is unpassable I think. An insult here is an insult to CULTURE around the world. @LordMinion777 hey... I hate to break this to you but Amy hasn’t been appreciating Austin’s COFFEE CULTURE. I thought you’d want to know that the COFFEE CULTURE here is being dissed. @MarcusGrayDoor @iceddarkroast D’aww thanks so much! Look... you know I’m gonna gush excessively about this once Heist comes out but I NEED to say how damn grateful I am to be able to make this for you. A labor of love with WAY too many people to thank over the past YEAR but I gotta thank you guys first. \n\nSo thank you! Headed a small cast and crew premiere for A Heist With Markiplier tonight and I’m so frickin excited! I can’t wait to show everyone the fruits of their labors but also I’m getting my own little premiere tonight and that’s insane to me, we rented out a theater like that’s amazing~ RT @cloakbrand: Why not look good AND feel good? When you shop our new, limited edition Binary Cropped T-shirt, 10% of proceeds will direct… RT @cloakbrand: On #NationalUnityDay, we're proud to present Beyond the Binary. We prize inclusiveness and creating a safe space for everyo… @YouTube thanks bby Oh also it's gonna be completely FREE @o_orvis Nope. Free. Let's rob a museum... you get to choose how in #AHeistWithMarkiplier. Watch the full trailer right here --&gt; https://t.co/wzvhTi3kvb #AHWM https://t.co/DleFVjaaMV @LordMinion777 We appreciate your feedback.\nYour account has been charged and your final bill is due by October 30th.\nThank you.\nGoodbye! @LordMinion777 We’re calling you back to give you a one question survey regarding your recent customer service experience.\nPlease listen carefully.\nOn a scale of 1 to 10, how likely are you to recommend Markiplier to a friend? @LordMinion777 Dialing customer support-\nGreat!\nSwitching to touchto-\nGreat!\nSwitching to voice only.\nMain menu.\nIf you’d like to reach customer support say, “Customer Support.” @LordMinion777 Hmm... I didn’t quite get that. If you’d like to switch to touchtone only, press *69. \nMain Menu.\nPlease listen carefully as our menu options have changed.\nIf you’d like to reach customer support say, “Customer Support.” @LordMinion777 We’re sorry. Mark can’t come to Twitter right now. Please leave a message and we will reply to your tweet at our earliest convenience. THANK YOU! We launched CLOAK exactly one year ago today! Thanks for an amazing first year and to celebrate we’ve got tons of new stuff available right now https://t.co/j3wdCBlQ7H https://t.co/mcMYHwIGDY Chica’s 2nd favorite tv show is WINDOW https://t.co/hMCt0oBuUe It’s not about me. It’s about you. https://t.co/UEXgUBioN4 @cheekabeeeka @Apocalypto_12 @PamelaHorton13 @RicepirateMick @RexxRobert @iceddarkroast @verytiredkat @CrankGameplays @musiciscode Thanks! Hard to believe it’s been 2 years already! Chica’s favorite tv show is WALL https://t.co/5TPdSx4Bd0 This dog is cooler than I’ll ever be https://t.co/A0ho7uiWGx As a wise man once said... GOOSE!! https://t.co/jHOhysVyin @Ohlittlefox @iceddarkroast Perfectly balanced... as all things should be @Ohlittlefox @iceddarkroast wait where’s the boob...? @Ohlittlefox @iceddarkroast wow... time well spent! @thaRadBrad That is in fact hilarious! \n\n...oh wait no. @JamesMarriottYT fuck yeah they are @timthetatman what's the issue? I'll buy a boob for you don't worry @Cranbersher You buy one, I buy one, and then the next time we meet.......... @lunartaes 200 iQ RIGHT HERE @AshleyGossett13 OF COURSE! AGH I'M AN IDIOT! In hindsight I might have been a bit hasty in assuming the shirts said, \"EAT PUSSY.\" It could have been anything: Boy these family friendly YouTube ads sure got me pegged. Not sure what I like more: the boob, the shirt that says eat pussy, or that sweet drone sale! https://t.co/cnPSXvlcTx Hey more try not to laugh. That’s pretty cool. https://t.co/7b32SaPdFp I was giving Chica some lub and Henry found the perfect opportunity for a SNEAK ATTACK!! https://t.co/Hwo6e6ckng It’s ok guys! I left the front door open so she could potty cuz I know doors trouble her so Can’t wait to see Chica soon! I’m so proud that she’s enough of a big girl to take care of herself at home for the whole month I’ve been away! ☺️ 0 MORE SLEEPIES! HOME! @CrankGameplays Oh... oh ok. Great! I love...\n\n...stew Heading home today! A little peek at North Korea (this is about as close as you can get without getting shot) https://t.co/JG94gHqjBP @Girbeagly Oh! Mrs. Bagel!\nIt wasn’t me! I swear! He started it! Please, my mom doesn’t make tendies like you do! Can I still come over after school? @Girbeagly Well you took it too far FIRST by HURTING MY FEELING. I challenge you to WRESTLING SHOWDOWN. But I bet you won’t accept you BIG STINKY. @Girbeagly Hah unlikely. I bet the ghost wouldn’t even go NEAR you because you are too SMELLY @Girbeagly I will not. I hope the ghosts and demons GET YOU in your SLEEP! @Girbeagly He’s 10 times the streamer you’ll EVER BE!! He’s soaked with water AND subs! @Girbeagly Pfft im so over u. u didn’t show me LUV when I showed you LUV. I HATE you. I am CURSING you with this PICTURE of an EVEN BRIGHTER STREAMER. https://t.co/5de9O3S2hh @Girbeagly I found a shirt for you (psst it’s because your streams light up my life) UwU 😘 https://t.co/jaah4JNKta 🐝 https://t.co/LwMN5DV2mE Jumpin with mah best friend https://t.co/s7pwNxq77x I think this makes me a disney princess now. https://t.co/jxnWwi40k8 Hey @France can you verify the authenticity of this delicacy? https://t.co/AYiNYJxLS6 Beware of the ELEPHANT... \n—&gt; https://t.co/CtMlc2iIkc #theedgeofsleep https://t.co/G4YrpRiYJi Hey @LordMinion777 I was reminded of this fact that I somehow completely forgot about... The timelines match up to your roof leaking. https://t.co/8lIvxSemmi Making this shit mah banner https://t.co/qklgRNiu3K It's time... https://t.co/iaraQsxLvO Oh also Wade is doing a charity livestream today! Help him raise some money for Extra Life! https://t.co/fdGVQbQYDo I don’t know why but this screenshot out of context is just really funny to me https://t.co/9TFhyHkSZw RT @cheekabeeeka: The Drowned Man continues 3pm PST! https://t.co/eXGvxSWHyx Join @markiplier and @LordMinion777 as they document a series… You ready for the story to get EVEN STRANGER?! Chapter 2 starting in 60 minutes! https://t.co/QFtvKRB9X2 @muyskerm Hello friend bob. I am no scam. Who say such thing? Am no crazy. Here? New video for you I made to see I love you: https://t.co/zGVR6V5VFX Chapter 2 Premieres TOMORROW!! Get the limited edition t-shirt to help pay for Wade's Exorcisms HERE! https://t.co/7VeiFZoqCb https://t.co/kgPRDDagnh hey @CrankGameplays i know you literally have no life so watch this video i made https://t.co/Xav5ZZYmDx Hey friend @muyskerm how are you? Hope you are well! Anyway, I made a video recently! Maybe you'd like to give it a watch? Really appreciate it! https://t.co/Xav5ZZYmDx Hey @LordMinion777 I made a cool video. Maybe you'd be interested in giving it a watch? I bet you'd like it! https://t.co/Xav5ZZYmDx @CrankGameplays I WILL REPORT EVERY ONE OF YOUR VIDEOS FOR COYPING ME FBECAUSE ITS CLESDLY S YES ON THDY ASUIMPETION!! @CrankGameplays you dare... you dare talk to ME about RESPECT? The man who DEFINED THE WORD?? @CrankGameplays THAT'S LIKE ONE OF MY VIDEOS IN REAL YOUTUBER TALK @CrankGameplays You don't even REPLY like a normal human? You QUOTE TWEET me like a BISH? Fite me. Right now. Fly to Korea. You won't. Really @CrankGameplays ? You're gonna CLOG UP ALL OF YOUTUBE on this day... THIS DAY? I hope you're as dissapointed in yourself as I am... Are you IGNORING THIS? The most important premiere of my ENTIRE CHANNEL and you're just gonna skate right by? the IMPUDENCE! the AUDACITY!! the UNMITIGATED GALL!!! https://t.co/58PAg3TFHC @sapphicmika Get yer lazy tuchas in this premiere right now or NO CELL PHONE FOR A MONTH!! If you don't get your sorry butt in here SO HELP ME I'M GONNA LOSE IT!! https://t.co/58PAg3TFHC @LordMinion777 @muyskerm https://t.co/q0TnVZQovO @muyskerm @LordMinion777 Aw HELL yea! Alright I’ll bring the bucket, you bring the towels! You’re really gonna get it this time Wade haha lol! @LordMinion777 Hey @muyskerm you up for a DROWNIN’ tomorrow? @LordMinion777 Alright, sick man. Yeah I’ve been looking forward to this for YEARS! Hey @LordMinion777 you cool if I drown you tomorrow? Tomorrow... https://t.co/jeH83QTWHo Dammit... I just lost The Game. Really excited about this story coming out! It’s come together so incredibly well with a great team behind it and I can’t wait for you to hear it! Don’t fall asleep. Whatever you do... don’t fall asleep. Subscribe now to #theedgeofsleep and listen to the trailer HERE: https://t.co/IYgRvyUbVl https://t.co/7c9qklovnP Doing a bit of a podcast with tha boys --&gt; https://t.co/fdGVQbQYDo I almost ABSOLUTELY DESTROYED my kid cousin at arm wrestling. https://t.co/hXRqHCDaLu SCP caught on security cam at local karaoke. No survivors. https://t.co/YrALJDLyEW And the front https://t.co/rlnjetjbj8 I feel violated https://t.co/Sg2sGauEbi I’ve heard the words “VERY” “HAIR” and “YES” followed by a lot of laughing so I think I’m in good hands. I’m risking it all.\n\nI’m taking a leap of faith.\n\nI’m putting it all on the line.\n\n...I’m getting my hair cut by someone who doesn’t speak the same language...\n\n...pictures to follow. @ttmik Wanna make a video? @ttmik 안녕하세요! Just discovered your books AFTER traveling to Korea. Wish I had known about them sooner, they’re wonderful! I know how to say, “I’M FULL” in Korean.\n\nI know how to say, “I’M FULL” in English.\n\nBut for some strange reason my entire family goes mysteriously deaf whenever I say either...\n\n...and then they pile more food on my plate. @gianna_jolie_ Maybe it’s because my good looks are too intimidating? Probably both tbh @airwryn It’s because they can’t handle how much fun I’m having learn to read 🙄 People take one look at me and run away screaming. It’s probably because they can’t handle how much fun I’m having. I run after them screaming, “IT’S OK THAT I’M BETTER THAN YOU!” but they just run faster smh @fangirl_of_TS https://t.co/wbLgEPN2NZ I am having the best time in Korea. Literally no one has ever had more fun than I am right now. If this were the fun olympics I would be kicking everyone’s ass. I’m the greatest fun haver in the world. @citrinequartz16 https://t.co/aKkgIH0U14 @ehkyara ...yeah? At my grandma’s house, you’re not allowed to not be hungry. This is a small snack... https://t.co/4zB01dLMF9 @KemptKevin You're closer than you think You literally can't guess what new Sour Patch Kids thing they made this time... https://t.co/A5kCRaf9GH I made it to Korea. \nI have been fed. \nI am tired. \nG’night. @CrankGameplays YOU THINK I WASN’T BORN THIS CLUMSY? MY WHOLE EXISTENCE IS ME TRYING TO OUTSMART MY OWN STUPIDITY!! @CrankGameplays YOU’RE ONE TO TALK PEANUT BOY @xspxcemxrk It was outside the plane... They found it... I’m a human travesty. I lost my passport boarding the damn plane... I’ll let you guys know when I land! Can’t wait to see my family in Korea smile I have to leave the country. To anyone I’ve disappointed I’m so sorry. To those that I love, I will miss you dearly. Please remember me for who I was and not what I’ve become. My workout routine https://t.co/3reT4POFWw @cheekabeeeka @muyskerm @LordMinion777 Thanks I hate it Oh my god, I never knew I needed this until right now. This is all I want. I can’t wait. SEND ME TO SPACE. https://t.co/GFcriZPUNW RT @KerbalSpaceP: The Kerbal universe is expanding and entering the next generation of space exploration in 2020 with Kerbal Space Program… @LordMinion777 But not porn. More artistic than that. @LordMinion777 Well I wanted to make sure everything was cleaned up. We made quite a mess. I couldn’t just leave you like that. Were my emojis unclear? Not porn lol no way haha. You hear that @LordMinion777 they think we filmed a porn lol heh anyway here’s a better hint... 🏚🎥💦😩💸 Filmed a very special documentary with Wade. Coming soon. Here’s a hint... 💦💦😱 @TeamYouTube Hey, that’s pretty good! RT @TeamYouTube: 🥁New today\n\nA policy preventing Copyright owners from making $ on manual claims for:\n\n🎵Short song clips (ex: 5 sec of a so… @airwryn you fucking failure Hey guys :) Just wanted to let you know how proud I am of you. You’re really killing it out there and don’t let anyone tell you different (: https://t.co/SDSfYmYoaO A smile to brighten your day https://t.co/xDUsuw32Or Another day another shooting... \n\nI wish that was hyperbole but this morning it’s tragically not. El Paso and now Dayton both within 24 hours of eachother. \n\nI’ve run out of thoughtful words to say. I’m tired of thoughts and prayers. I want to DO SOMETHING ABOUT THIS. Felt cute. Might delete you 😘 https://t.co/BzrO2f4KZc @ChexMix What the hell is this? RT @iceddarkroast: If anyone wondered where Chica’s nickname Beeps came from... 💤 https://t.co/RGFSdWSusR We sleepy https://t.co/xeHyn4A0wb @Ninja Check out @DrLucyJones for more info, I am not a seismologist and she is. And I think I've already made an error in my last tweet because I just saw that it's the time between aftershocks and NOT the magnitude that's the determining factor. But again, I might be wrong and dumb. @Ninja It's mostly down to statistical probability. While it's nearly impossible to predict earthquakes there's a general correlation (after a large quake) that the chance of a larger quake occurring diminishes as the strength of the aftershocks decline over a certain period of time. RT @kevsanji: POV: you just walked into a GNC and a sales associate notices you https://t.co/WKFRp9iXM9 @kron4news Nice OOF 7.1 FELT THAT ONE https://t.co/RY3I0cJbHd @iceddarkroast How dare you be this accurate and hurt me thusly RT @saltydkdan: Markiplier Lets Play but there's a baby audibly crying in a nearby room and Mark just ignores it https://t.co/XVrYVbPooG My mom got me CANDLES for my birthday! This is not a joke. She literally threw candles at me and said, “Happy Birthday!” No cake. Just candles. You have to retweet this... it’s my birthday... https://t.co/nFXv6zOLJe It's my BIRTHDAY!! So here is my very special birthday video from me to you! ...you have to watch it. It's my birthday. https://t.co/Ao3n4lk3Cx RT @cheekabeeeka: most YouTubers: ring that bell! \n@markiplier: https://t.co/eE1E0zN0Kp Lol this is you guys right now 😭WAH WAH WAH😭 lmao https://t.co/iSNP4Xpf5X I’ve got so many cool pics from working on the next BIG in Austin but I’m not gonna share a single one with you. You don’t deserve them. I’M ALIVE! And heading home! New Pride Month @cloakbrand gear available NOW! Half of all profits go towards @TrevorProject get them HERE —&gt; https://t.co/j3wdCBDrwh https://t.co/zsIDyfzJN3 buh bye https://t.co/Htfap9nCPN It's time for Five Nights at Freddy's to get ALL UP in your face in VR! https://t.co/ta6ew1RGlc @LordMinion777 @Girbeagly Lmoa ya right BITCH go to bed! @LordMinion777 @Girbeagly ...alright I ate a pretzel @LordMinion777 @Girbeagly RTFB can u BELEEF me? RU-TMS? Rule43 &lt;(——____—— )&gt; Rule70 @LordMinion777 @Girbeagly WTFIGO ur voice S!MT!!OE!!! a/s/l? @LordMinion777 @Girbeagly UwU betch u won’t x.X THAT’S ILLEGAL O.o ttyl loleroni sweet “dreams” ya fugly troll &lt;.&lt; @LordMinion777 @chaoticpma @Girbeagly I coated them in chocolate just for you! I made the chocolate myself! All by myself! Just me! Me! @LordMinion777 @Girbeagly Ok PAL. lol yeah you can sleep on the “BED” pfft rofl w/e I’ll take the “COUCH” kek lmao sure @LordMinion777 @Girbeagly lol “BUDDY”? Do I even know you? Get out of my house! @LordMinion777 @Girbeagly Dude I’ve never even SEEN a pretzel let alone could I even conjure up the image of what a “pretzel” could possibly look like. You’re clearly out of your gourd. Alright... I’ll tell you why I’m here. But don’t blame me if your brain melts out your ass. I’m gonna be at King’s Island tomorrow for @Go2Pivip, there’ll be a meet and greet and other fun surprises! @DinelloMadison Uh... I’m in Cincinnati. Don’t ask why. Your feeble mind couldn’t handle the truth. Hey guys. Love you bigly. Been crazy busy working on a big project. Getting more excited every day about this next project BUT really want to get back into regular videos ASAP! Soon™️ Happy Mother's Day to my wonderful mothers! https://t.co/2tzSH2GTRR And another huge thanks to @PamelaHorton13 for transforming The Seer into CELINE! What a badass! Biggest thank you in the world to @akuparagames for bringing it to life with their wonderful art team! Send them some LOVE! THANK YOU ALL SO MUCH for joining me for the premiere of Damien! A true labor of love and I couldn’t be happier with how it turned out! Get ready... the show starts in in less than 2 hours! We can all watch together HERE &gt;&gt; https://t.co/R5ZoedaZDX Tomorrow... https://t.co/R5ZoedaZDX https://t.co/NfcSi42446 Chica was a BAD and chased a squirrel into the street... So I punished her by removing her ability to walk. She loves walking so this was definitely a punishment. Definitely. \nShe hated it. \nLook at her face. \nPure sadness. https://t.co/ei2d0iL4jK Made it to Austin! https://t.co/jbde7BfTC4 @CrankGameplays You’re not actually Ethan. Suddenly the REAL CrankGamePlays mysteriously “dyed his hair back” and “lost his acne” when he “grew up” YEAH RIGHT. WHERE’s ThE BoDy, GREG? @CrankGameplays You’re probably not actually allergic to peanuts. You just wanted something to make you ‘quirky’ so you carry around epi-pens full of bees to butt-chug in case people aren’t paying attention to you. Chica got a haircut! https://t.co/oofiBtVTzv The antibiotics they gave me are FUCKING TERRIFYING https://t.co/LdyWL63rLX Guess who’s face SWOLE back up again? Apparently I’ve got an infection where one of my wisdom teef was took... https://t.co/J7WHMf7ocs Rub a dub https://t.co/fEEuEq1Zzl Feelin’ finger lickin’ good... #NewProfilePic https://t.co/caCyPix1Gz RT @CrankGameplays: we have 1 hour left in the stream and we are SO CLOSE to the goal.\nhttps://t.co/athg3n2HLy\n\nTwitter, do your thing http… RT @CrankGameplays: A little over 3 hours left in the stream and we're super close to the goal! \n\nPlaying some Jackbox for a bit with viewe… Did you guys see that space hole? Pretty sick rite? Hey guess who’s getting off his lazy ass and finishing up THE PROJECT™️? RT @Twitch: There's no escaping the long arm of the law. https://t.co/3rJqOzNzPR I would like to announce today I will continue making videos! Not retiring today! You can expect videos to continue as normal for the foreseeable future! Lol these turned out amazing #dangerous https://t.co/H1450Tl2zX Streaming Stan the Water Man GTA RP right now! https://t.co/KSAd0smzqD Oh btw, shoutout to @NopixelRP (The Server) and @MiltonTPike1 (Kiki) and @mfshrimp_ (who plays Jimmy) for opening my eyes to the wonderful world of GTA RP! Been doing some GTA rp on Twitch lately... things get weird over there with Stan the Water Man. https://t.co/ynfVQZrE4e Looks like I need to buy Chica about 60 new toys... lol that was fast, well done https://t.co/dYksnqq08z @LordMinion777 I think the word you’re looking for is “FRIENDSHIP”\n\nDon’t worry, I feel it too! @LordMinion777 Oh wow man! You JUST missed me! I just hopped off the plane back in sunny California! Oh well I guess we’ll just catch up some other time. I had a GREAT vacation btw! @Girbeagly https://t.co/A6ZLg6Qqz3 @Girbeagly @CrankGameplays https://t.co/moslGGUgLz @Girbeagly @CrankGameplays https://t.co/6qqsxDuHvI @Girbeagly @CrankGameplays https://t.co/nWcQ0qMyxl @CrankGameplays https://t.co/7XeIvnMBi4 @Jack_Septic_Eye https://t.co/HAaULdBW47 @Jack_Septic_Eye https://t.co/lzvNzZgSTx @Jack_Septic_Eye https://t.co/xQcDUuB9V2 @LordMinion777 Alright... better hurry though. Thinking of moving back to LA already. If you can get here in the next few hours that’d be great. No one to hang out with here... @LordMinion777 Alright, good luck. Meet you at Putters! They re-opened! It’s so nice, and no more live bands! @LordMinion777 Woah who said Siberia? That’s crazy, I said I was in Cincinnati. I can see the confusion. I’m at your favorite wing place! Hurry on back! I’ve also moved here! I’m home buddy! @LordMinion777 Yeah that part’s pretty rough, but I’ll have a nice cup of hot cocoa waiting for you when you arrive! See you soon, pal! @CrankGameplays https://t.co/BzA9TWDPUU @muyskerm @AnimalRoyale Nooo... NOOOOOOO!!! @LordMinion777 Yeah, that can happen. GPS is real spotty up here, will say I’m in totally different warmer places, so weird. But you can trust me! @LordMinion777 Alright cool man. Yeah. Totally. Will DM you the deets. Btw I’m in Siberia! You’ll wanna fly in through Moscow and hitch-hike your way up. It’s gonna be awesome. Can’t wait bud! @LordMinion777 ... @LordMinion777 It’s over when I TELL you it’s over! @LordMinion777 No it started 10 minutes ago! @LordMinion777 No it’s NOT over! It just started! @LordMinion777 It started 5 minutes ago! @LordMinion777 NO not now! @LordMinion777 Starting THEN. On vacation. Don’t talk to me. That means YOU Wade. Omg lol this edit of my wisdom tooth video https://t.co/Q2puWs6Nv3 @CrankGameplays Your generosity is WORHTLESS!! You don’t even have enough clout to get VERIFIED!! @CrankGameplays YOU WERE TOO LATE, HEAPASS! I don’t need your clout anymore! @LordMinion777 DON’T FUCK WITH ME WADE.\nI’LL CUT YOU. https://t.co/wt3oBRbL7T I WENT FENCING. \nI LOST. \nGOT STAB’d. @timthetatman lol this “pro streamer” isn’t running a 3 computer stream setup in 2019 smh 🤦‍♀️ @gregorybrothers Oh please make it so! @Kitboga @NopixelRP Dude... Amy and I couldn't tear our eyes away from the perilous journey of Edna and her lost cat. Haha it's like you've been training for this moment for years. Great stuff, can't wait for day 2. The wonderful @schmoyoho made an AMAZING new remix! Check it out right here! https://t.co/DXiauShLsv @timthetatman Oh trust me, as soon as my cheeks deflate it’s a comin! @timthetatman Literally couldn’t stop laughing at the stream today. Hurt like hell but I laughed. FULL WISDOM TOOTH REMOVAL VLOG —&gt; https://t.co/1ekmB6nWCQ @pewdiepie You had nothing to do with this. Full stop.\n\nThe shooter, who should be forgotten to the ass-end of history, is only trying to create division. Anyone that believes or spreads the message that you were associated with this in any way is doing exactly what the shooter wants. Just heard about the terrorist attack in New Zealand. I have no idea what to even say anymore in the face of such senseless violence. I can’t imagine what the families or the community in Christchurch are going through. If there’s a way I can help, I will find it. So... apparently BARELY CONSCIOUS ME had the motherfucking YOUTUBER INSTINCT to pull out my phone and snap off some vlog footage that I ABSOLUTELY DON’T REMEMBER. Here’s a sample, more tomorrow: https://t.co/1jRjqrHAMN RT @cheekabeeeka: Hey did you hear about the new dbd character @CrankGameplays @Apocalypto_12 @markiplier?Supposed to be the scariest yet!… Happy PI day! Watch Ethan, Tyler, and I make some PIES!! https://t.co/982Ep0mBjw teeth be yeet https://t.co/pkzom4Rr8x Teeth getting yoink’d in about 30 minutes, vloggin it. Also special pi(e) day vid coming after I get back home. @AngelicAlestial @HamillHimself @Jack_Septic_Eye aw hell no! I’m not gonna stand here and be outdone by another Mark! HAPPY BIRTHDAY!!🎂🎉🎈🎊🎁 https://t.co/Z8iGCVxovU I get yank’d tomorrow A special message from Chica in your time of crisis https://t.co/gqlfQ3R1Z3 100k retweets and I dye my dog pink @JeffKyler14 I am HORRIBLY upset by this WE LIVE!  https://t.co/KSAd0smzqD 🏠🔥 https://t.co/S1LhLL8WYC @Sike1216 Probably! And WARM too! Well... I had to sacrifice a lot of things to a lot of demons but HEY I’m finally healthy again! @gokath123 @muyskerm @Jack_Septic_Eye @thecypherden I miss that chair! @muyskerm @Jack_Septic_Eye @thecypherden Man, I’m the opposite. Maybe my ass is fundamentally different but I’m good on the shittiest chair imaginable. Remember when I recorded on a kitchen chair for a year lol? I literally pulled the armrests off my current chair because it got in the way @elijahwebber9 @spnfreak0203 THAT’S THE LIE WE TELL OURSELVES TO KEEP US FROM ACHIEVING OUR DREAMS @spnfreak0203 OH IM SORRY HOW MANY HABANEROS HAVE YOU EATEN hmmMmMMMMMMM?! NONE OF YOU HAVE ANY IDEA WHAT MY BODY CAN HANDLE @CrowRider1 @elijahwebber9 @seokahssi YOU DON’T KNOW WHAT MY BODY CAN HANDLE!! @elijahwebber9 @seokahssi lol muscle stim surgery challenge I love it! @seokahssi @elijahwebber9 as the person who created the goddamn tweet mark YES @elijahwebber9 @seokahssi mark YES @seokahssi So what you’re saying is... I should chain a bunch of painful events back to back? Guess who gets to have their wisdom teeth pulled this week?! @Laura3ennett You are a saint. Apparently I had to hit “publish changes” after they’ve been approved. No clue why. I wish I could explode all the sickness out of me in a single DEVASTATINGLY disgusting sneeze My mom heard I was sick so she immediately went out and bought me a shit-ton of Korean food to MAIL TO ME lol love u mom https://t.co/pevhHmaGrI @Girbeagly Me when I see you https://t.co/JGQEAyNYGH @Girbeagly You’re such a good dude, I’m gonna fly to your house to hang out someday. I love my friends. So much. If you’re my friend know that I think about you like all the time. Wearing my Chica shirt to ward off the sickness. I feel better already! https://t.co/myJEe8XxFo Maybe I shouldn’t have drank that leaky roof water Oh sick, very sick. @dragonfier4 DRIP WAS OVER KEYBOARD FROM THE START R.i.P. https://t.co/lVy9TK1jLf FIXED FOREVER https://t.co/Ut8hZ2t3lU RIGHT OVER MY COMPUTER MY ROOF IS LEAKING @cheekabeeeka https://t.co/y2X1rfkDRR @cheekabeeeka https://t.co/lLbP1AWYcF @LordMinion777 Hey man, things got heated with that cop... Apparently he never heard of me lol yeahright... anyway when you land can you please come to the Los Angeles county jail with $10,000 for bail? Thanks man, owe you big. @LordMinion777 Awesome, thanks. You’re such a good and honest friend. Can’t wait to see you. \n...Alright this cop is getting uppity... I don’t think he knows who I am, brb gonna tell him. @LordMinion777 Cool, I’ve already gotten a few tickets from airport cops telling me I can’t park here. Tell the pilot to hurry! @LordMinion777 yoooo I’m waiting at the airport when does your flight land? I rode a horse: https://t.co/iK8L0rEi7W @LordMinion777 Cool. See you here tomorrow. @LordMinion777 LA’s where the money’s at. Come here first. @LordMinion777 Gotta spend money to make money @LordMinion777 Come to LA nerd THE MARATHON CHARITY STREAM IS OVER!! Thank you everyone who stopped by, we ended up raising $500,000 in 24 hours! HUGE thanks to everyone who contributed and was a part of my slow descent into madness! CHARITY STREAM going ALL WEEKEND LONG #youRIGHT --&gt; https://t.co/xyKokskw55 You ever just @MAXHellsKitchen my LOOK https://t.co/gqnBChuOoN @tobiigaming DON’T TELL ME HOW TO LIVE MY LIFE, TOBII @DaScareLit Oh I was better a while ago. Just forgot. Update: all better now Update: still sick I am sick. 10 years of gromp #2009vs2019challenge https://t.co/hE4nWbIkrO HAPPY NEW YEAR!! @gokath123 @LordMinion777 @Foxtrot44 THAT IS NOT CHICA, FOOL @LordMinion777 @Foxtrot44 FAIR TRADE HAS BEEN ESTABLISHED. THE PACT HAS BEEN SEALED. MUTUAL BENEFICIAL FEELINGS SHALL CARRY ON FOR 365 STANDARD DAYS. https://t.co/A1bXJqFya1 A cursed end to a cursed year! Goodbye 2018! https://t.co/nPj8RpioFx @LordMinion777 @Foxtrot44 I AM THANKFUL TO HAVE YOU AS A FRIEND. YOU ARE GOOD GUY WHO DESERVES LOVE AND HAPPINESS. 2018 was quite a year! Let's review what happened shall we --&gt; https://t.co/Il0sv7vrxD My #spidersona https://t.co/IpaBCqkzI5 Into The Spiderverse is the BEST movie I've seen in years. If you haven't seen it yet, GO SEE IT. This is absolutely not sponsored but movies like this need to get all the support in the world. THIS IS TOO DAMN NICE! I'm far too evil to deserve a gift THIS NICE! https://t.co/JRpEEXckU3 Merry Christmas and lots of love from my family to yours! https://t.co/46ZSPsL33b I think this #GalaxyNote9 that @SamsungMobileUS sent me is making me a better Fortnite player 😐 Check it out for yourself --&gt; https://t.co/iUT9hFuXE9 #ad https://t.co/oX7fUchN0G RT @jacksfilms: I don't really get TikTok, do you? https://t.co/oWpjUrXU52 DR LUPO bas raised over $500,000 for St. Jude! Less than 30 minutes left in his 24 hour stream!! GO HELP HIM RIGHT NOW --&gt; https://t.co/oTsKoVbHwT Samsung gave me a giftbox! A BIG gift box! Let's see what's inside! #ad #GalaxyNote9 @SamsungMobileUS https://t.co/iUT9hFuXE9 https://t.co/zQUAjAwb9F DON’T LOOK AT THIS GIF!! SHE’LL STEAL YOUR SOUL!! https://t.co/EDDYSiUjNh @Laura3ennett @cheekabeeeka Pretty cold. Climate change. @septicjpeg @Tesla No, just honest praise for some damn good service. @cheekabeeeka oh no I’m still dead for sure. Tweeting from hell atm Just want to say, Cincinnati @Tesla killed it with service today. Suspension issue was fixed same day, no hassle dropping off or picking up, and they exceeded my expectations across the board. Cincinnati has once again proven itself superior to everyone else in every way. Mark has died of dysentery. Cincinnatus is within sight! I can hardly believe it but it looks like all of our hard work and perseverance has finally paid off! The nightmares are behind us! Our goal is right on the horizon! WE’RE GONNA MAKE IT!! Our electric wagon ran out of power.. we hooked up Henry to a large hamster wheel which is charging the battery a bit while Chica pushes from behind. If things get desperate enough Amy will have to pull it... these are truly trying times. Tis dawn on last day... we’ve run out of food, run out of water, out of time... if we don’t make it to Cincinnatus by sundown tonight, we will surely meet our untimely demise... https://t.co/VqSwynlBC0 I would to take a moment to really give an honest shoutout to the greatest series on YouTube EVER!! SETTLERS OF CATAN!! Made by the infallible and infinitely lovable @LordMinion777 I will be loyal to the #MignonArmy for the rest of my LIFE!! https://t.co/iJaHnJslgy #NewProfilePic https://t.co/xEIokL84Oa RT @LordMinion777: TUESDAY PODCAST TIME! Come join the fun with @markiplier @muyskerm and me! https://t.co/HRcGLyvAz2 RT @muyskerm: About to be live with @LordMinion777 and @markiplier for some peen stuff.\n\nhttps://t.co/IvZJqboI6V We’ve somehow survived the dreadful winter of the Rocky Mountain pass. I managed to repair our wagon wheels by replacing the spokes with some spare squirrels and tree sap. Life uh finds a way. The journey continues but I fear that morale is at an all time low... I’m desperate... https://t.co/qjsHAs9Pel ...that wasn’t chocolate... Incredible news! I can hardly believe it but I found CHOCOLATE right here in the woods, just lying on the ground! Fate is finally smiling upon me! I woke up. Surprised. Hands cold. Can barely write. Using Chica’s shed fur as underwear lining. Itchy... so... itchy... @cheekabeeeka This is everything I could have ever hoped for. RT @cheekabeeeka: @markiplier using those skills he’s been practicing on the wagon trail https://t.co/eCRcL5uXiw ...I fear that this may be my last communication for quite some time. Quite some time indeed... Should we wake on the morrow, which I sorely doubt, I shall write again.\n\n...Henry looks to me when he suspects me unaware, licking his meaty chops... My dearest Y/N,\n\nWe’ve made camp for the night. I know not where for a raven stole away our map and left us lost, wandering in the dark. I hear the bawl of the wolves in the night. The cold cuts through our makeshift shelter with contemptuous ease. Chica is eyeing me for food... We’ve reached a river. Do we...? The suspension on our wagon just failed... The nights blur into days. My sundial says that it’s the morn of the second day but it feels as though have been burdened by this endeavor for nigh on a fortnight. Supplies are running low and morale even lower. We haven’t even crossed that half-way point... pray for us 3rd vomit... 2100 miles to go... this journey is truly cursed... Our exodus to the East to the mythical town of Cincinnatus has begun. I fear for our safety on the long hard journey ahead of us. Amy and Chica are holding strong yet Henry has already vomited twice within the first 30 minutes... We are truly forsaken already... https://t.co/8av3Oj9zJO @Ninja Looks good, wear it well! also RIP all of your towels lol @Ninja red hair you say... @ARCTIICLEE @schmoyoho https://t.co/HxjQi5rY09 @ARCTIICLEE @schmoyoho https://t.co/0PgYIoKn2O STOP WHAT YOU'RE DOING!! You have to see this amazing bETTER version of YouTube Rewind that @schmoyoho made --&gt; https://t.co/wfMcWSIKYM I try the MASSIVE BEHEMOTH of a game that is @PlayWarframe for the first time!\nWatch the video HERE --&gt; https://t.co/1FEG93RIWw\nAnd we all #LiftTogether #ad This is peak comedy https://t.co/CY6EPSDpre @CrankGameplays Interesting offering! Venmo-ing you $45 dollars right now! Thanks, bud! 🙏 Who needs a roadster when you’ve got THE BARREL!! https://t.co/5UgOFOwwrz Bob, Wade, and I are chatting and playing games right now --&gt; https://t.co/KSAd0s4Yz5 FINALLY here's the full compilation of ALL sketches from the charity stream! https://t.co/Y4l0XGlKnB I really gotta stop mocking crying babies in public I boop’d her snoot https://t.co/4YmwzL9v8l I’m not gonna upload a video today because I’m CLEANING MY DISGUSTING ASS HOUSE like a responsible adult. Pulled some strings to get Make-A-Wish involved with #youtuberewind2018 this year. Say hi to Krysia and her family! We were playing some sweet markiplier videos hence why everyone is laughing and having such a good time. Check it out here —&gt; https://t.co/noBL2hlHJh https://t.co/oAApkXuQGr Future historians will look back and marvel at the event that finally united all of humanity in peace and prosperity... Subscribe to PewDiePie I love my dog.\n\nThat is all. Alright so i just realized that this looks SUPER virus-y but TREUST ME i'm SUPER TREUSTWORTHY!! It's time... https://t.co/BEG5QMY96C WE CAN DO MOVE MOUNTAINS!! https://t.co/XQC9Ej9J0M Also the biggest thanks in the world to all my friends who joined me on this livestream and helped make it one to remember! THANK YOU ALL SO MUCH!! That was easily the best charity livestream we’ve ever had! With over $250,000 raised for Stand Up To Cancer (and counting) you all should be INCREDIBLY proud! The Christmas Charity DOG SHOW is about to begin! Join us for some fun and a great cause! #ChristmasChungaLungas https://t.co/VdF6Lwa7zr The Christmas Charity Livestream is almost here!! GOING LIVE IN ABOUT 5 MINUTES!! https://t.co/uwZTCechE8 @sparklyjackaboy Hellllllllll yea Charity Livestream tomorrow! Live challenges! Punishments! Special guests! MORE SURPRISES?!\n\nBeen working crazy hard on this one! Be there 10am PST for the festivities! 3 PEENS IN A PODCAST is starting soon! https://t.co/pJ7FwBQLTG RT @MoonKipz: Join @Markiplier on Dec. 1, 2018 at 10 AM PST for a special #livestream on #youtube.\nHe is raising funds for #standup2cancer… RT @iiStubbletii: @markiplier #markiplier #markiplierballs join the stream on december 1st, 10 AM PST\nhope you like this! https://t.co/e0Vn… new do https://t.co/6TsWfktgPt OR I could buzz my head live on the charity stream if we hit a certain amount. Thoughts? Cutting my hair off. Send me style ideas. RT @KuroKirisu: Get your own @markiplier balls. True authentic Markiplier balls. December 1st. 10 am PST. Get em while they're hot. #markip… RT @cheekabeeeka: GET READY! Charity Livestream for Stand Up To Cancer coming Dec 1st! Join @markiplier for a day of fun for a very good ca… Here's that wholesome content you ordered! https://t.co/jS57UjGTHn just try to explain this picture. i fuckin dare you. https://t.co/cdm9t5X21z You matter. THE BONERCAST RIDES AGAIN!! Join us for a day of BONER and GAMES!  https://t.co/pJ7FwBQLTG Happy 3 years with this beautiful, amazing, incredible, goofy, life-changing little lady! https://t.co/eapxAjJRG4 BEHOLD!! MY GLORIOUS ABS!! https://t.co/U0Ev19HodR This is BIG ROO. We reached an understanding... https://t.co/ejUZDOZ3I1 Today's the day! TODAY'S THE DAY!! @cloakbrand has OFFICIALLY launched! The store has been restocked and new items are available right now! No more pre-orders, go to https://t.co/K8mzM9ziXy to see it all! https://t.co/gpGiFmkubf Mark has been home for 24 hours. Mark has been home and awake for 6.25 hours. How many hours did Mark sleep? Real talk: This tour has been incredible. Not just for the ability to see you guys in person but for the memories I made with my friends along the way. I’m so damn grateful to all of you for giving me this opportunity. The Your Welcome Tour has ended but the memories remain! I’m a fucking model.\nDon’t @ me.\nDon’t talk to me.\nDon’t even look at me. https://t.co/vqzKrZeE0A @CrysansderSohma That is horrible. I’m so sorry, DM me and we’ll coordinate a gift package. The person who did that is a disappointment to everyone around them. fed a ROO! https://t.co/qhYc4tdl2E @KobyKing16 @CrankGameplays @LordMinion777 @muyskerm @Apocalypto_12 lol your hat was great, kept double taking to look at it during the show Thanks for coming dude! Good talking with you! https://t.co/jJ36k6zf6e Follow @CAL_FIRE and retweet their updates on fire conditions and evacuation info. Even if you’re not in the immediate area someone may follow you that needs to know. RT @iceddarkroast: @markiplier I’ve been using @CAL_FIRE as my main resource for updates! The Woolsey Fire just outside LA is brutal right now. I’m nowhere near but if you’re in the area and can help, even just forwarding evacuation info,  please do. Stay safe! Sydney show is SOLD OUT!! Can’t wait see you guys! 😋 \nTickets still available for Adelaide and Perth! https://t.co/No6XRrtxKK https://t.co/mH6KEd8DsS Hey, u vote? AMAZING new animation from @Haricz! Check it out and support them and @ToonCeeAnimated for making this wonderful creation! https://t.co/X5irhnAedE HAPPY HALLOWEEN!! Ready for the scariest haunted house of all time? Well Markiplier Manor is open for the next 6 hours! https://t.co/OtotWN8qjO We almost died from ice cream overdose courtesy of Giapo. If you’re in Auckland, New Zealand go to Giapo’s right now for the best ice cream you’ll ever have! https://t.co/uIhzKVb26X It’s beautiful here in Auckland! One last run around the world with the gang! https://t.co/2OgthldDNz I’M LEAVING. \nI’M GONE. \nI’M OUT. \nTONIGHT. \nTOUR.\nNEW ZEALAND. \nTOUR. \nAUSTRALIA. \nhttps://t.co/rtcuB3Xypw\nFIND ME.\nIF YOU CAN.\nBYE 👋 3 Simple Truths:\n\n1) I’m untall\n2) I’m talln’t\n3) You can’t define trans people out of existence @Shoocharu @Jack_Septic_Eye You made my poor, sweet, innocent eyes look at THIS\n\n... I love it Hey... I know it’s late. Just wanted to say, you guys killed all of the t-shirts too. There’s literally about 30 left. Last chance to pre-order before the real launch next month —&gt; https://t.co/ZAIQ5974no\nYou guys are nuts, thank you so much. Alright head back to sleep 🙃 @WhateverIWantC lol they don’t pay me for this shit @septicdevotee FUNNY YOU SHOULD ASK SOCIAL FRIEND IT’S MY GREAT NEW BRAND CALLED CLOAK YOU CAN PRE-ORDER NOW AT https://t.co/4FKDemtyJ0 Weight limits are for CHUMPS\n\n*COUGH* https://t.co/miW47dZrDM *COUGH* https://t.co/ZnfIZSlIqW @crypticvic @iceddarkroast @elonmusk Didn’t stop me @elonmusk Chica loves her new Tesla https://t.co/ydB79mghv6 Chica’s Makes a DEAL https://t.co/huQDqziPKp RT @cheekabeeeka: a trilogy five years in the making https://t.co/mH79yTRiWt @cheekabeeeka Holy shit you even got the reflections right... It's time to LEARN HOW TO POLE DANCE PART 3 --&gt; https://t.co/KidMchig6y My dog’s name is Chica:\n\nWe call her:\nBeeka \nSqueeka\nBo-Beeka\nTonka \nChunka \nChunko \nBeefus \nWeefus\nFeefus\nSneefus\nBeeps\nBeepo \nCheekus\nDa-Chica-Da-Squeeka\nWRONG\nMissy\nPoopy\nGood girl\nPlumpus \nDumpus\nBoofus \nPoofus \nMrs. Beeka\nBub \nBica-Da-Boop-O https://t.co/FmRwLarCpF Thanks for such an incredible first day! Honestly, truly, thank you all so much for supporting our dream! https://t.co/ZSQAGnSyS0 RT @cloakbrand: Introducing CLOAK #cloakforgood https://t.co/F35LY9fQGX This is Cloak. This is what Sean and I have been working on for over a year now. Check it out @cloakbrand —&gt; https://t.co/K8mzM9ziXy https://t.co/kqZ7I3nqzc @OfficialJlipper 🤔🤔🤔 Got something very special to announce tomorrow... Hey I played this game and it was AMAZING!! Two enthusiastic thumbs up for the launch of their Kickstarter! https://t.co/DVqVjkVHj1 RT @cheekabeeeka: snuggly pup ❤️ @markiplier @iceddarkroast https://t.co/sUsf5lVvyF YouTube's down... Can it really be true? Am I finally... free? I try some Korean beauty products... it goes about as well as you’d expect —&gt; https://t.co/xIsQQ143W4 My priorities in life:\n1) Food\n2) Water\n...\n...\n999) My Appearance Nothing warms my heart more than seeing Chica excited about a new toy https://t.co/ipluo20c24 IT'S ABOUT TO GO DOWN!! HOLD ON TO YOUR BUTT AND JOIN THE PARTY!! https://t.co/I9kKv82Cmq HAPPY 22 MILLION!! Also it’s just 2 hours until the premiere of the tour movie! I’ll be in chat goofing it up the whole time with you guys! IT'S OFFICIAL!! The Full Tour Documentary is premiering at 11:00am PST on SATURDAY October 13!! Set a reminder right here --&gt; https://t.co/I9kKv82Cmq @kjellbergslaugh do it. no balls. you won’t. no balls. HEY! DO THAT THING YOU SAID YOU WERE GONNA DO!! @Rynneer_ Yes. It’s dire. Here, I made this template. Just fill it out for me please. https://t.co/YV3HMunKq4 Guys, this is serious. YouTube’s getting real rough these days. Need to get a second job. @MattStasz Now you’re talking! @preciouseokjiin But I don’t wanna... @spookybaku Good advice in general I suppose Need your help. I need to update my resume. Any tips? \n\nIt’s been a while... I feel it’s prudent to remind everyone who is able to vote to make their voice heard. If you haven’t registered yet, or want to find out if you are, you can go here —&gt; https://t.co/URoKJPTAI0 @oldyelIer @modestlymark https://t.co/fNns0WsDKz @modestlymark @tofirebreathe SNDPOFIFKRJDNA I CAN FLY https://t.co/lpwd9QHMGc Bring your favorite Marvel heroes with you in Marvel Strike Force! Download this awesome game for FREE right here: https://t.co/hOLTSYRYo8 and check out my video of it right here: https://t.co/YU1Pdjm6zc #ad #marvelstrikeforce @MarvelStrikeF Rub-a-Dub-Dub https://t.co/9ZoSQ4pBYe @Bella_dfwm Finally some good fuckin soup. @really_kinda A bowl of water would have been closer. @The_Fuzzy_Sheep This is upsetting and very not soup. @gaminggoofballs Where is the soup. @kjellbergslaugh You goof’d my soup. @ender_wing This is not soup. I am getting sick. Send me pictures of chicken noodle soup. My secondary objective is to destroy mankind with wholesome heartwarming content. My only objective this month is to make you cry SHE MONCH WHILE SHE SLEEP!! \nI missed Chica so much! https://t.co/rYeUsjbDgY We gave the money ($6500) to the lady 고영슨 who rescues all those dogs. She was grateful beyond words, constantly saying that it would have taken her 10 years to save up that much money. Thank you guys so much for your generosity! https://t.co/JEsf3MgODY MaRKipLiEr BRuTaLlY aTtAcKEd by smOL CHiLd https://t.co/UnB6xJ9xTa Heading back to LA today! I’ve had such an amazing time with my family out here in South Korea and was the first time I’ve really been able to appreciate a side of me that I’ve often neglected. Lots of new stories to share with you guys soon! Just a nice picture. No secrets. No subtleties. No hidden meanings. Just a lovely picture. https://t.co/6I0rUKe0jB I found this really cool sculpture while exploring Korea! I don’t know why but I was really drawn to this one in particular. https://t.co/1bFqxx0Hzk Can you believe this is my first time? https://t.co/IrtvrGY4nd You guys ever have a pretzel? https://t.co/lmor3Yo5HX @ShimoFrostpine https://t.co/yS8IlY8mHk Having a great time exploring Korea! https://t.co/TD5Dv2Mcoc First thing I did when I got to korea... good ol sink shower. https://t.co/kz7LnuFpGY I miss her already... https://t.co/NQPpAHZZoU Hey guess where I am I KNEW IT!! YOU’RE ALL OUT TO GET ME!!\n\nbut also this is super sweet holy crap thanks!\n\nBUT ALSO YOU THINK THAT’LL MAKE ME DROP BY GUARD?! NOO https://t.co/1fjPstzYVd @BlueMicrophones NO! GO AWAY!! Chica has a 2-inch snoot https://t.co/bvZU49wQf5 I’m 64 foot 2 from my knee to my snoot. https://t.co/vr4m1179KZ Am I dead again? I gotta stop doing that... bad for my health. ❗️ https://t.co/SgSnYJcarX https://t.co/W29YhHmvGL YOU EVER HAVE ONE OF THOSE DAYS WHERE YOU’D RATHER JUST BURN YOUR WHOLE DAMN HOUSE DOWN THAN DEAL WITH THE BULLSHIT IT CONTAINS? @CinemamindDavid You’re too kind! I’ve updated the description with a link directly to your tumblr. I have to get back to the charity event I’m at so I’ll check back here when I get home if you change your mind. @CinemamindDavid Understood, which would you prefer? Because I can credit whatever you’d like on mobile right now but I’m totally fine with replacing too. Thanks for being understanding. @CinemamindDavid For clarity, I made the thumbnail so this is entirely my fault. Will address as soon as I’m able. @CinemamindDavid Just saw this! Super sorry about this, I’ll replace them as soon as I get home. At an event right now, should be back in about 2 hours. It’s #Up2Us to stand up to cancer! I’m teaming up with @Twitch and @SU2C today during tonight’s #standuptocancer telecast to raise awareness and support research. We’ll be playing @FortniteGame and talking to special guests on https://t.co/c60wvejcuS starting VERY SOON! @VRDork Love this! https://t.co/0JwIZl1tYC RT @TheVTran: Today's the day #PAXWest2018!\n\n💖 Head to the Hippogriff Theatre at 6:30PM to listen to me, @verytiredkat, @cypheroftyr and @G… PEAK PERFORMANCE https://t.co/7y7nCrx9ur Hey! I’ve got a panel at PAX that you can watch on the main PAX Twitch page or I’m hosting it at https://t.co/qfXile0wKT @SmokeGaymer I haven’t opened my twitter mentions in months... this is the first thing I saw... My heart breaks for the families torn apart today in Jacksonville. \n\nIt was even more heartbreaking to realize that I’ve grown numb to reading yet another headline about yet another shooting. I just don’t have any outrage left. We can’t let this be our legacy. @markyiplier Uh @Iovingmark Wait hang on... I’m sensing a theme here... @brightswm Oh... Not my cat. Not my hand. But I took the pic so I’m gonna greedily slurp up all the sweet delicious internet points. https://t.co/102n0Gvz5N RT @cheekabeeeka: You heard @markiplier! CONGA #KickCult https://t.co/ONbS9YUK0x go back to sleep... https://t.co/OiALfzYGTd love this! https://t.co/2KrDgNdofV Warfstache BLOOPERS available right now for Sponsors! Check it out along with other cool Member-Only Content by joining the channel right here: https://t.co/vX3fri59E4 https://t.co/qm1jcyt1Yl Another HUGE thank you to all the wonderfully talented crew and production staff over at FBE for helping me bring my idea to life! And thanks to all the beautiful extras for classing up the place with their incredible dancing and outfits! Can’t wait to make more! @RicepirateMick  https://t.co/aA16SKXxoj I’d like to take a moment to thank @RicepirateMick for bringing The Detective to life in a way I never could have imagined. An incredible actor, a handsome devil, and an all around great guy 👍 Wilford Warfstache has finally come out of hiding... but The Detective hasn't forgotten what he's done. The Detective hasn't forgiven... https://t.co/m4LATy7PpW Happy FRIENDSHIP DAY everyone! Let's raise our glasses to old friends and celebrate in style! Special video coming out at 12pm PST! https://t.co/OgZRnhNbXH @ArchWarhammer Yep! Read all the Ciaphas Cain novels as far as I know. Entertaining plow, would love to be on the spotlight Uh oh... https://t.co/CzPIxqkkDq Here’s a selfie to prove I’m not dead. \n\nBeen working on some pretty cool shit but have absolutely nothing to show for it yet, hence the silence.\n\nsoon™️ https://t.co/dm89Oe1zUo Google Feud is BACK!! Let's get some stupid out of the 'ol brain! https://t.co/cHxWbxASsb Guys I have a confession to make... I wear pants pretty much every day now. It started so innocently with pajamas and pjorts but I’ve really changed I’m so sorry @easeIy Always with the layout changes and what have you. Anyway to reiterate I am not a baby let alone yours @easeIy Twitter gets confusing sometimes with the newfangled UI changes. @easeIy Did you tweet the right person? @easeIy I’m not even a baby @easeIy I am 29 years old @easeIy I am not your baby I’m back in the good ol u s of a. Gonna shove some pizza in me gob and pet the doggos when I get home! @EmilyAnnEvans2 I love this so much for so many reasons. Hey, I’m in Amsterdam! Why? We’ve got a show this Saturday! https://t.co/No6XRrbWTc @CrankGameplays Yes... yes it is. https://t.co/j6bSrbfZvM Who wants some more BROAUGHTHER in A Way Out? Happening RIGHT NOW!! https://t.co/KSAd0smzqD Still sick. I’m like this emoji 🤒 except I crave the sweet embrace of death WE JUST HIT 21 MILLION SUBSCRIBERS!! \n\n...I have absolutely nothing prepared and nothing to offer in return because I am very sick... \n\nBUT HURRAY AND THANK YOU!! tomorrow... https://t.co/Ukle5fObVY @iceddarkroast FOUND IT!! You’re way too good to me! Thank you for always being there for me This is so cool! Thank you! https://t.co/Hn5XUbZKbf @goldensynishade This is AWESOME!! Thank you so much! @MzMarpeck @ao__hoshi THANK YOU THANK YOU ALL @Foxtrot44 THANK YOU I LOVE EMOJIS ☑️➿🔛〰️🆒🆙🈁🏧 @Kayroos_ Thank you so much! Hugging Chica has been a good source of smiles :) @Jack_Septic_Eye Thank you man! It’s already been a great one, lots of heartwarming stuff this morning. I know that there’s very little joy to be had in a situation like this BUT... this honestly made me laugh really really hard. https://t.co/i5OhZnbBpA @attackonhowelll It’s hard. It’s always hard. It will always be hard. But it’s worth it.\n\nAnd that distinction makes all the difference in the world. Going against your nature is a sheer act of willpower but realizing that you can make that choice is freeing. I am an introvert. And to my fellow shut-ins please hear me when I say this... Don’t let your desire to be alone hinder your growth as a person. Social situations are a constant struggle for me but I wouldn’t be where I am today if I didn’t push out of my comfort zone. It’s Vidcon time. Get ready for a whole lotta me Hey gang! Gonna be streaming A Way Out with Amy, stop by for way too many goofs and maybe a sneak peak of Henry! https://t.co/KSAd0smzqD @septic_booper @gianna_jolie_ Honestly, I probably would have been perfectly happy. I would have thought it to be the smart decision, pat myself on the back, and moved on never knowing what could have been. The future is uncertain and risks don’t always pay off. But sometimes... that risk is worth everything. @gianna_jolie_ Engineering school was me going through the motions. I could have been a decent engineer and everyone thought me a fool for quitting. But I listened to my heart and took a risky step towards who I really wanted to be, and here I am now :) Don’t just go through the motions in life. Make moves toward who you want to be. RT @ao__hoshi: I will always pick to save chica even if it's the wrong!\n.\n.\n\nAlso thanks for finally making me a mod lmao @markiplier https… Spread #buttlove all around the world Always believe in your butt @Zombiemold Haha a classic. Can you believe I used to think Buh Bye was a stupid outdo I’m not sad that I lost. I expected to lose. I’m absolutely devastated that they didn’t cut to me building my “ SUB 2 MARKIPLIER”  sign in the second round. A tragedy. Time to rip ass and take names https://t.co/eP86zovXM8 Please help me... @Girbeagly twitter is only sending me notifications from you. You are NOT bell’d but it won’t stop pls I am dying. https://t.co/K95dM9nniy Don’t worry guys, when I get home tonight I’m gonna yeet up some steamin’ fresh videos just for you @ivyleaguepunk ALL OF THEM @ANoahssful Did you not hear my words, “DRUG-FUELED BENDER” my blood is RAVAGED with CRACK Just tore through Vegas in a drug-fueled bender the likes of which you’ve NEVER seen. Stole spongebob’s square pants right off his ass. Sold my kidneys to pay for video poker. 3 new tattoos where the sun don’t shine, don’t fuck with me. @hctmummies Oh gosh. Oh jeez. Oh no. Don’t watch my videos. They’re garbage. I love you guys. Ever wanted to know how well my mom knows me? Well it's time to find out! https://t.co/krhArBTx1f 😘 https://t.co/j8W7EiYmRC Picking up Beeps today! In case you forgot what she looks like, here’s a picture for reference. https://t.co/kgwAbH29hf @Girbeagly I fixed your little typo hahaha don’t be afraid to @ me next time rofl 🤣 https://t.co/AeAzB2NbHA https://t.co/9PzhgS4HAM The Zoosters https://t.co/SACjaDF4UI RT @Jack_Septic_Eye: Prom Night! https://t.co/NHhntZqthV RT @Foxtrot44: We’re married!!! ❤️ https://t.co/RRryfACVfX @muyskerm @Lunna1987 @LordMinion777 I can explain. Wade and Molly got MARRIED TODAY! CONGRATULATIONS!! \n\nI don’t have a picture of the wedding yet so here’s a re-enactment with Maggie. https://t.co/ktHbmV0v18 Hey guys, I know it’s late but could you send some love towards this streamer? He made a video detailing some hard truths about trying and failing to achieve a dream but he’s streaming right now and could use some support. Send some love his way from me: https://t.co/i0xDA1Eata I STAN A QUEEN https://t.co/DnZR3IT37p @JahovasWitniss @FortniteGame Dude I’m cryin already @HollyConrad EVEN BETTER!! Happy birthday!! @HollyConrad \n\nDoes Strix have the same birthday? Double happy birthday? Happy birthday to the beautiful and talented Amy! Every moment I get to spend with you is a treat and I’m so grateful that you’re able to tolerate the travesty that is me in kind. Can’t wait to see what you make next! Love you, Amy! https://t.co/7aR8Xu71UO A cute picture of me and Amy! https://t.co/ORx7QokmW7 Secret ego content you’ve all been waiting for!!! https://t.co/x1zbxpR7aA @caitlintalbert @iceddarkroast Sorry about that! Send an email to hello@markiplier.com and tell them what happened and they’ll get you a signed one. My guess is that a box of unsigned made its way to fulfillment before I got to it so anyone else getting an unsigned please contact them as well! I’m done Good news! I’m officially HALF WAY DONE signing the calendars! I was able to wish my mom’s a happy Mother’s Day in person today! Now back to the hell of my own making in LA... RT @DxArmyYT: #MarkiplierIsExiled It is I... The REAL @markiplier back with the Try Not to Laugh Challenge! \n\nDon't mind my cardboard-ish l… Hey guys. Just wanted you to know that I am definitely NOT exiled and am still posting videos. Because I care. https://t.co/6CRDgif3sT RT @ninjasexparty: TODAY’S THE DAY!!! Tour de Force 2018 tickets go on sale at 10 AM local time! Go to https://t.co/DBmyXbcXsJ for ticket l… @DaveDelirious This is so perfect 👌 RT @DaveDelirious: #MarkiplierIsExiled @markiplier https://t.co/BpIWkbvoik RT @markimood: @markiplier I made you a meme #MarkiplierIsExiled https://t.co/tAUPgZcgO2 RT @freyjinn: I'm not sure you will survive this huge amount of asses @markiplier #MarkiplierIsExiled https://t.co/pscpysX4CW RT @BoyNamedKota: @markiplier I've got exactly what you need, I can take your place for the week without anyone noticing! #MarkiplierIsExil… RT @Lunarainbow152: #MarkiplierIsExiled https://t.co/w8MswoaP1x @crowsnoses This makes me UNCUMF @crowsnoses What the shit is THAT?! Quality content. Top contender to take over my channel. https://t.co/fslxDgfg7V Alright guys... it’s official... #MarkiplierIsExiled has officially begun! Officially. It’s gonna be a loooong week. @Kerenzard This is somehow worse... but I’ll take it... @Kerenzard WAIT A MINUTE YOU RIPPED ME OFF THIS SQUARE SHIT AINT WORK ON TWITTER WHAT YOU TRYING TA PULL? https://t.co/nF2TkoYPEC @Kerenzard For real. https://t.co/0684YFnQGJ @Kerenzard Love it. DM me an address to send the hair. Someone make me a sweet new “Markiplier is Exiled” banner and icon. I will give you a tuft of Chica’s hair in exchange. lol nvm decided to fucking finish this shit. No videos for another week, I’m exiled I don’t regret committing to this at all and I’m still gonna sign every single one of the 35,000 calendars but realistically speaking some people are gonna have to wait a couple months before I can get to them all. Have only been able to get about 2.5k a day up until this point. Main problem is the sheer size of the order. The calendars weigh a total 8820 pounds in boxes of 40 across 14 pallets. I lug each box, open it, dump it, sign it, and repack it. Today was the first day I had a buddy. Got another 6-7 thousand signed today. Tomorrow’s the last full day I have to sign, then I’ll have to trickle them down a little bit each day for the rest of forever. Hands have fallen off so that’s a problem. @MatthewSantoro @2Trentan You did? I haven’t seen it! I never thought I’d get tired of seeing myself naked but I am so incredibly done with my own ass I’m not even half-way through the calendars. I’m gonna die before I sign them all. My right arm hasn’t been this tired since puberty RT @iceddarkroast: https://t.co/FxkR2JxUFZ Just donated my match for the 3500 Drunk Minecraft Steins sold AND bit donations from the stream! In total we raised about $79,237 to End Epilepsy! THANK YOU GUYS SO MUCH!! https://t.co/bg0fk5T7Ht @MerrellTwins @YouTube @nataliesoutlet @CollinsKey @TTLYTEALA @BrentRivera @jenerationdiy @thekingofrandom @gregorybrothers @dearra @RollPlanes__ I see Markiplier in there. He’s pretty cool I’ve heard. Everyone should subscribe to him. Hey there's a cool stream happening for charity. You should check it out: https://t.co/YGEnWEuXLV @thekingofrandom @_doobly_ @MatthewSantoro @YouTube He lies.\nI died my hair back to red.\nTell the world. RT @AngryJoeShow: Hey Guys! It's the Last 48 Hours for our awesome game Prepainted Street Fighter: The Miniatures Game! We've unlocked so m… @AlivoirWasTaken I don’t... feel so good... I have a bandana https://t.co/KBG0JZ232Z RT @MatthewSantoro: Just a few pin heads.\n\n@thekingofrandom @markiplier \n@YouTube\n\n#CreatorSummit https://t.co/JBfyTYvxnP RT @Jack_Septic_Eye: We are LIVE with the April Charity Livestream raising money for Gamechanger! We have a whole day to do some good!  Hel… STILL STREAMING!! If you haven't checked out this stream yet, WHAT ARE YOU DOING WITH YOUR LIFE!! Join the #IntegrityBaby crew right now!! https://t.co/KSAd0smzqD RT @Ryodan51214: @LordMinion777 #LockYourPepe #integritybaby https://t.co/RYWHMvawIS RT @brooke_5703: #integritybaby STRANGER DICK https://t.co/KVhL0ldA1u RT @MarkxSepticxPie: #IntegrityBaby I AM UNSTOPPABLE \n@markiplier FIGHT ME 😤😩😤 https://t.co/dd5kZSk58r RT @WillowNightfury: Someone had to make it\n@markiplier #integritybaby https://t.co/shw8KbzpKj you need to stop... https://t.co/YRuA6BhoXF RT @verto1412: #integritybaby @markiplier @LordMinion777 Just watched  the best movie ever! https://t.co/BIGTfcw8Aa i don't think you can... https://t.co/GpMDOQlz59 RT @PethBridge: A call that needs answering @markiplier @LordMinion777 #IntegrityBaby #LordMarquad https://t.co/LWvrwmJJSp RT @thedreamtrove: Wanted to make up for the last drawing :P Here's an old inked art I never uploaded of @markiplier Should I colour it? #i… RT @xmoonyxbunnyx: It's not an integrity baby but about the same height! #IntegrityBaby https://t.co/La9x6fXNWb RT @celesse: Minecraft charity stream for the Epilepsy Foundation! @markiplier is streaming all day on Twitch https://t.co/LuM3aucfqc #Lord… Psssst... we've changed the hashtag... it's now #IntegrityBaby and no you don't need to ask any questions about that... https://t.co/KSAd0smzqD RT @Wolfvesfang: There was an attempt\n@markiplier\n#LordMarquad \n#IntegrityBaby https://t.co/PAMiajKfFK RT @cheekabeeeka: You did ask... @markiplier #integritybaby #LordMarquad https://t.co/gyUOxPxcBk what the hell is THAT!! https://t.co/ru9mOowcbW RT @cheekabeeeka: #LordMarquad @markiplier wonders if it wasn’t the best idea to make this the hashtag... https://t.co/qxUVyu860O Join the CHARITY STREAM right now! Retweet to become a part of the #LordMarquad Squad! https://t.co/KSAd0smzqD I MADE MEMES FOR YOU!! Join the charity stream: https://t.co/KSAd0smzqD https://t.co/ZicrASUEfs Charity stream tomorrow at 10am PST for the Epilepsy Foundation on Twitch! SPREAD THE WORD!! Just saw Infinity War. \nCan’t recommend it any more. \nAvoid spoilers like the plague.\n#ThanosDemandsYourSilence These amazing shirts were gifted to me by @Nutrish along with some snacks and educational treat toys to make Chica smarter! Also my daughter loves me https://t.co/9FdskCVGLU Hey AMSTERDAM!! Told you we’d be coming back! Here’s all the info: https://t.co/ikjdKrpcmx https://t.co/yM30s7nbEE I love my child https://t.co/lmYIpTNsjQ @cheekabeeeka @ao__hoshi @iceddarkroast It’s hard to see the forest for the trees @ao__hoshi @iceddarkroast A lesson learned is a penny earned Hey guys, I made my first song. I'm really nervous but I'd love some feedback.  Thanks gang 💖 https://t.co/vK8WxXSjo3 I don’t know how to feel about this... https://t.co/x7PQLC1J4c @iceddarkroast @Jack_Septic_Eye OH GOD NO https://t.co/0cqTdnNIQe I thinking about another dog... nom https://t.co/PKfUbZZhsr @yaboyconnorhowe @WoollyOneYT @YTCreators Agreed @Jack_Septic_Eye Oh shit! I didn’t know it came out, have to play it myself. RT @ganjaplier: mark when someone tell him he looks tired https://t.co/iZLKI0NRsK She’s a model https://t.co/9QNCKCmbLG GUYS!! I did it! I’m finally TALL!! https://t.co/8T2lZobG79 Oh hang on... I found the context...\n\n#ItsGooTime bitches\n\nGet ready to #FeelTheGoo\n\nI’m so ready to #JustGooIt\n\nYou gotta #ThinkOutsideTheGoo https://t.co/rxJE16ijeY Look... I don’t know what goo goo clusters are and I have no stake in this...\n\nBut this is the funniest out of context tweet I’ve ever seen in my life. Yes I will #TasteTheGoo please put that sweet GOO™️ inside me. https://t.co/hEkIkElmHj I am not good at Fortnite https://t.co/e2e6jxLAVt @Girbeagly @CrankGameplays Don’t @ me ever again @LordMinion777 @Jack_Septic_Eye I haven’t heard of it! What is the Een and how do you get to it? @JesseCox dream big my man I’m at pax https://t.co/e5UxIz2OqC @verytiredkat Many fun times were had and I’m sure that many more fun times are waiting for you in the future! Thanks for making my videos better. You were a miracle worker considering the low quality of the source material. DON'T WORRY! Your dreams have finally come true in the form of a ROCK!! https://t.co/VKPGG73ukh So the sale of the Tasteful Nudes calendar has concluded and we've raised about $382,000 for the Cancer Research Institute! THAT'S INCREDIBLE!! And what's even more incredible is the number might actually be higher than that! Will know for sure next week! THANK YOU SO MUCH!! RT @deepspacedylan: You’re welcome https://t.co/1e7IaqQtuC @HaleysComettArt gonna take me about a month to sign them all lol Almost $300,000 raised through the Tasteful Nudes Calendar!! Keep it up guys! Just about 24 hours left to pre-order this and contribute to a great cause! https://t.co/W2jL3uv0F2 You've already raised around $168,000 dollars for charity through the Tasteful Nudes Calendar! I'm so proud of you! @CrankGameplays Thanks duder! We’re all just hardworking naked fools chasing a crazy dream. @Apocalypto_12 Thanks man! It’s been a trip! @LordMinion777 Wasn't so long ago but man it feels like it was! @thetomska I shall offer you a pittance @Jack_Septic_Eye Thanks! THE TASTEFUL NUDES CALENDAR HAS ARRIVED!!\nProceeds go to the Cancer Research Institute!\nEvery calendar will be SIGNED!\nAvailable for 48 Hours!\nNo actual dick!\nhttps://t.co/W2jL3uv0F2 @iceddarkroast NOOOooOoOOoooooo!!\n\nWouldnt be here without you so thanks for all the laughs and love along the way! Oh and uh... coming soon... https://t.co/N2K9xuHiUr Just woke up to 20 MILLION SUBSCRIBERS!! Can’t thank you all enough so let’s START THE PARTY!! RT @Kayroos_: I'm late as in life but HAPPY BIRTHDAY CHCA!! I hope that pup got lots of love and belly rubs :DD https://t.co/oSbHZDRKPR RT @darkmagic_swh: Happy Birthday Chica!!!! @markiplier @iceddarkroast #chica #birthdaychica #markiplier #peebles https://t.co/I6uYdVC3eD RT @goldensynishade: borfday girl!! https://t.co/jP0Hd1oIEb RT @TurquoiseMagpie: A quick birthday sketch of Chica, @markiplier's adorable pupper! :)\n#magpiesketches https://t.co/lwmXAlz8Yy RT @ao__hoshi: AWWW HAPPY BIRTHDAY CHICA YOU SWEET PUP!!\nI drew this for Hearts and Heroes for the separate release of the minigames that w… RT @donutevenknowJM: HAPPY BIRTHDAY CHICA!! I wanted to see if i could try to do somethin for the good doggo! She’s such a very good doggo!… RT @pastelstarstuff: DROP EVERYTHING\nIT IS: CHICA'S BIRTHDAY https://t.co/XNL0viDRxJ RT @RustyBean_: @markiplier give her the good ol’ pats for me! :D 🎉❤️ https://t.co/CyBQMCJqkE HAPPY BIRTHDAY CHICA!! 🎂 🎉 https://t.co/ChCyR8YQAe I worked out today. https://t.co/UWgENXekV3 Now I don’t want to alarm you but Chica’s birthday is tomorrow. Extremely proud of all the students leading the charge in the #MarchForOurLives Don't let anyone tell you that you can't change the world because you're proving them wrong today. It's time to Try Not To Laugh once again! https://t.co/QsKyMcwHgL Fortnite is nothing but pain... and I think I've managed to capture every single way to lose in one video https://t.co/QipKjppvBR Help these awesome people reach their charity goal! https://t.co/sHvQMd7zna This is how my hometown celebrates #StPatricksDay Oh Cincinnati... never change... https://t.co/GVcf4gHSUk @SuperBuffie ...oh... ...OH... ...OOOOH... \n\n...I completely forgot about that lol HONEST OPINION TIME!!\n\nI’ve been having a blast getting back into the video groove and I would like to know what kind of content you’d like to see more of!\n\nAlso feel free to reply with more detail if you want ALL of this but in a certain priority. Thanks! 2012-2018 it took me 6 years to grow a fucking pube beard https://t.co/leeenNIIWD Australian Tour tickets are now on sale!! GET THEM HERE - https://t.co/No6XRrtxKK If you are a fan of my channel, I highly encourage you to play Hearts and Heroes! Here's my 4.5 HOUR VIDEO of the entire game! https://t.co/VlT9UV3VON Just finished Hearts and Heroes. An absolutely wonderful fan-made game that moved me in a profound way. Thank you so much to everyone that had a hand in making such a beautiful game. Do CATTLE PRODS hurt? https://t.co/Zae4Y6UU5J So I started doing my laundry regularly for the first time in forever and like... it’s so nice not having to smell check all my underwear. Why didn’t anyone tell me about this? I ate a ghost pepper and talked about some important stuff! It's the Ghost Pepper of Commitment!! https://t.co/9XRNL0W3Wx I’ve seen a ghost... https://t.co/HOSOyPupWz @anthonypadilla @TrashyTrashBOI @CrazyGeniusUrie Haha not me, people get confused with that one a lot. This was my teen phase. https://t.co/UaYdKwIv2E Well... today’s about to get interesting https://t.co/NshkQCF3zJ My hair is starting to curl???\n\nI’ve never had curly hair in my entire life, regardless of humidity it’s always been fairly straight. Any ideas why? https://t.co/eB4RtyfjHY @vanillanestor I don’t want to use that one... I cleaned my house today. Are you proud of me? @deafheat Never stop believing that things can get worse https://t.co/SC3rp01hoz @MarkxSepticxPie Oof that’s awful Whatdya think? #NewProfilePic https://t.co/C1jhnZ8c2M @LeighFVK Ah yes... that is a thing... @LeighFVK I... wasn’t aware I said that. Can anyone hit me with a “girthy cock” counter over the past few vids? I swear this isn't some BDSM thing... https://t.co/z1KmMYytar tomorrow https://t.co/JEY7Yu6RwJ If you have any deep probing questions that you want me to answer in a video please ask me now! @ScribbleNetty The best work RT @ScribbleNetty: Note to self: Never draw while watching @markiplier's videos... X,DD \n(In case you missed it: https://t.co/Ymc4cmIv4R)\n#… MOO https://t.co/AONL2gdppE @RobertIDK Keywords don’t matter for me. I’m Markiplier. Just 1 FNAF fan game? PSH! How about 5? https://t.co/YOU25hrMv2 @SkyWilliams I did https://t.co/79TFGgEvdR Videos starting back up today. Starting small but things are gonna get wild this week. Chica’s back. Made soup. Life’s good. SHE’S BACK https://t.co/PqDIGYgsdW This is what accomplishing your dreams looks like. https://t.co/5vFOR7joS9 I PICK CHICA UP TOMORROW YA IM SAD TOO AM HOME. REJOICE. All the love in the world to these wonderful people! Best tour group EVER!! https://t.co/IaKxBJlFsA Has anyone made a musical remix of me crying? THAT’S ALL FOLKS!! Biggest biggest BIGGEST thanks in the whole world to every single one of you that came out to see us for this tour! And another huge thank you to all of my amazing friends for joining me and making this adventure possible! Tonight is the LAST SHOW of the European tour! Let’s make it a good one! RT @CosmossUp: Newest &amp; Clearest photo of Pluto https://t.co/bhlpeMYTHc @muyskerm @CamrenH95 @iceddarkroast @Apocalypto_12 @CrankGameplays @LordMinion777 @verytiredkat @musiciscode SOMEONE IS LYING 🤥 https://t.co/0Z8it4aZki Hello Oslo! Just a reminder but it’s COLD out there! No need to line up early for the show tonight but if you do please remember to bring lots of layers and blankets! Stay warm! RT @demonicdavina: Cool https://t.co/I3bxQ23Ys2 RT @cheekabeeeka: when @markiplier ASKS ppl to make something that would be hilarious to photoshop but when you do you realise maybe you sh… RT @ao__hoshi: I apologize to @muyskerm @Apocalypto_12 @LordMinion777 and @CrankGameplays, don't blame me blame @markiplier it's all his fa… garbage human being https://t.co/u8eXlC5Dv0 Found my favorite youtuber @LinusTech https://t.co/EOV5Sh4CsQ @iceddarkroast ooOoOoOOooo https://t.co/xeZtj4bEel Hey guys, I don’t usually talk about these kind of things but I felt compelled to. The students demonstrating deserve to have their voices heard and they have my full support. https://t.co/bE2Cr6kXyO Extremely proud of all the students back home standing strong against gun violence. You all are the change this country needs so keep on inspiring. Let me know how I can help! @IndiDigsGaming @Jack_Septic_Eye @ConnieMcFalcon @RustyBean_ @SwoopyPoolin @demonicdavina @realhartman @Razzbowski @GameGrumps @CaptainSparklez @Apocalypto_12 @CrankGameplays @ZalzarYoutube Glad we could help! Happy birthday! Sup nerds https://t.co/s3WSdLGy8D We bought Wade a present... https://t.co/RBQ5gp5klf Nothing makes me happier than seeing my friends reach their potential. My only goal in life is to inspire people towards good and you guys are shining beacons that keep me moving forward every single day. I love you guys. Ethan, you have a such a bright future ahead of you. Getting to know you and seeing your endless enthusiasm has been nothing short of inspirational. You haven’t even begun to scratch the surface of what you’re capable of and I can’t wait to see you reach it. Tyler, I can’t state in words how proud I am of you. To see you go from One-Word-Tyler to standing right alongside us as we tour our show across Europe is a feeling that I can’t capture in a tweet but I hope you know it in your heart. #SmileAlways Wade, you have grown from a distant classmate to one of my closest friends and I hope you know how proud I am of how far you’ve come. From the first computer we built together to me cracking up at every joke you make has been such a great privilege. Bob, you are intimidatingly funny. I knew from the first time we watched Brian Regan together that you and I were gonna be fast friends and I can say with full honesty I wouldn’t be where I am if you didn’t believe in the crazy ideas that spilled out of my mouth. My friends made me cry on stage tonight so this is payback. This might take a while so buckle up. I’m so unbelievably grateful to have you guys as my friends on this wonderful journey across Europe @muyskerm @LordMinion777 @Apocalypto_12 @CrankGameplays @authentikaitlyn I hope you have a wonderful day This is for all the teachers who told me not to lean back in my chair in school 🖕 https://t.co/lPnLaDAlhU RT @iceddarkroast: If it fits I sits https://t.co/pHOw7mxosv @dantdm Thanks so much for coming! Glad you enjoyed it! @iceddarkroast This is the first pic of me and her ever taken https://t.co/I8wb391IXg @iceddarkroast  https://t.co/xHfcr8peaD @iceddarkroast  https://t.co/a3DU2RdsoR Here’s some pics of Chica from OVER 2 YEARS AGO https://t.co/WmYPtRqlEc I miss Chica Early-bird #JimSquad here for the London show! https://t.co/0GgphAuId7 @KristalxClear Yes, but you can also get a full refund if you prefer. Whatever is more convenient for you, more details about when we’ll be coming back soon. Hey guys, I’m really sorry to say this but we had to cancel the Amsterdam shows. Please read for more info: https://t.co/XUKr4T3XEv NEW SWEET AWESOME VLOG https://t.co/6cBq5u8Ppi I miss the old markiplier... https://t.co/zpizpswEai Started a sweet new terrible series. You should check it out. https://t.co/gKkytdD09X Just woke up here in Europe. My heart breaks to hear about another school shooting back home. There’s nothing I can say or do to make this better for the victims of the Florida school shooting, but my thoughts are with you nonetheless. Something has to change. It's time to Fall in Love with Markiplier all over again... Happy Valentine's Day everybody!\n\nhttps://t.co/jU75B7AT3X Saving this bad boy for 20 mil https://t.co/46F2tRHf4v We’ve made it to Amsterdam! \n\nTHE EUROPEAN TOUR BEGINS...\n\n...tomorrow after I get some sleep Pickle Update: No sign of retinal tear or detachment. I’ve got a blind-spot in my periphery that should hopefully go away in a few days. RT @ninjasexparty: fyi ninja brian threw the FUCK out of a pickle today, not sure where it landed What do you guys think of my @Jack_Septic_Eye cosplay? https://t.co/0MokL2VCzQ Here’s a police sketch of the perpetrator https://t.co/TcvOGWDb6f The real question we all should be asking... https://t.co/X3zFsEdMpW It was not a self-inflicted pickling https://t.co/zMimVlATH9 In the ER again. Long story short, I got hit in the eye with a pickle. This isn’t a joke but it is undoubtably hilarious. This is for izofella06! Everyone else please ignore, thank you! https://t.co/f7c2QCEztn Umm... hey @discordapp my server went down again and I'm 100% sure it's not my fault uh oh https://t.co/CQsWP6dEIo Discord server open for another few hours. I recommend joining The Screaming Room:  https://t.co/4c5jAXogY8 RT @ao__hoshi: Omg this took so long just woah\nBut anyway I loved the little video of @iceddarkroast making chica do the monkey so I gotta… Get yer cameras out! It's time to go GHOST HUNTING!! https://t.co/bGKblPir6V RT @SmokeGaymer: Amazon echo: Markiplier edition \n\nFull thing here -&gt; https://t.co/RZlWNgvfTK https://t.co/6gcN2xCHVT @markyiplier Wow... you managed to insult me in both of these tweets... Appropriate nicknames for dogs:\n\nBorfers \nSqueakers\nSnoot Bois\nSnoofinators\nBubs\n\nFeel free to expand this list RT @jacksfilms: @markiplier No, Mark.\nNOW she's your little bub. https://t.co/BBAt7zYAma She’s my little bub https://t.co/JqGNIk05Po It's time for the World's Quietest Let's Play with Getting Over It... how will these things mix? https://t.co/jqiOSzqLWY New World’s Quietest Let’s Play coming soon The Johnny Bravo https://t.co/u8yYB4VEUG 24 hour marathon Just Dance stream... Good idea? welp... https://t.co/ytdOOFIJB4 Limited time Discord server invite. It's only valid for the next 1 hour. Abandon hope all ye who enter here https://t.co/dBqM79zYyh Things got a little heated at the stream today https://t.co/h4ENyTVGxQ Casual reminder to take care of yourself today! Alright NOW you may have a happy birthday @Jack_Septic_Eye I don’t care what your bizzaro UK British calendar says @Jack_Septic_Eye! I’m not wishing you a happy birthday until it’s the 7th HERE IN AMERICA where It COUNTA lol you guys broke my discord server @discordapp fix it fix it fix it fix it fix it I probably mucked something up in the settings but I made a Discord Server. Try to blow it up please: https://t.co/aO8kP5T0Eo @Jack_Septic_Eye Sorry, I tapped out after 6 watches. I guess I’m not cut out for dancing after all... (COMPLETELY SERIOUS) If I wanted to learn how to dance, how should I start? Classes? YouTube Tutorials? Personal Coach? @gianna_jolie_ @troubledpml I don’t know how this works but I feel like I’m helping RT @gianna_jolie_: Y’ALL I NEED 5,719 RETWEETS PLEASE RETWEET I REALLY REALLY REALLY WANT @markiplier’s GIGGLY BITCH TEE IT WOULD MEAN THE… I DON’T LIE https://t.co/AsXTGD7sZw I’m gonna eat this entire jar of pickles and wash it down with a lovely Cherry Coke Zero. \nThis is not a sponsored post. \nBut it should be.\n\nLooking at you @CokeZero and @ClaussenPickles https://t.co/xEUjFElLIa But I think we can all agree that Tide and @DavidKHarbour really won the #SuperBowl YAAAAAAAAAASSSSS!!!! #SuperBowl https://t.co/r2W9Wd1vL0 My heart RIGHT NOW #SuperBowl\n\nThis tweet took THREE ATTEMPTS https://t.co/MDfXgFflRp GO EAGLES GO @iceddarkroast WHY NOT MORE IM FRUSTROOD @iceddarkroast I blame Chica New glasses. I’m finally trying to look my age. https://t.co/Hhes6vl1wN p.s. tomorrow I plan to be the laziest sack of shit try and stop me I’VE BEEN UP SINCE 4AM. I’VE ALREADY RECORDED AND EDITED ALL MY VIDEOS. I’VE ALREADY WORKED OUT TODAY. GET FUCKED PROCRASTICUNTS. I FEEL GOOD AND PRODUCTIVE TODAY.\n\nFIGHT ME HEATHENS.\n\nI’LL FINISH YOU LIKE I FINISH MY GOALS. Hey gang! Check out the newest episode of @rhettandlink ‘s Good Mythical Morning! I’m on it and I have to do gross things YAY!! :D https://t.co/a2eJJq0PDD RT @rhettandlink: Introducing the Try To KEEP Laughing Challenge with @markiplier . https://t.co/pEq2SNQ5pd https://t.co/FayiWYzZZ8 Filming more Chica’s World today! @Girbeagly You deserve it dood! Guys please stop subbing. I need more time to prepare my body before tasteful nudes. Please. Decided to take the channel in a sweet awesome new direction. Check out the brand new me and be sure to give that like button a delicate tender kiss for more great amazing incredible videos like this one. https://t.co/TUqNYdNoYJ Eyyy I join @StevenSuptic for a little therapy session! https://t.co/z76cz4Cjck It's gonna be a good year! Also a very strange year... https://t.co/YU3bVHNLZv @90sfischbach  https://t.co/BOgQH1FRtI Sometimes all you need to feel better in life is a nice SCREAMING AT THE TOP OF YOUR LUNGS RT @RustyBean_: Im super happy to announce that these stickers are finally up! All proceeds made will go to the American Foundation of Suic… How tall am I? @ILLUSIVESEAN Not really, I just wanted to walk and get some air and some exercise. Detach for a bit. It was nice! Videos are gonna be late again today! Not working on anything special, it was just a beautiful morning and I wanted to see the sunrise 😊 @crazions This is perfect This year I’ve committed to being stylish as all hell. Example: https://t.co/yGmfvdgn3s @LonerFourLife This is great, everyone will know how tall I am wherever I go! @AwesomeRaccoon I like it! Where from? @markiblab Where is this from and do they have bottoms? Can you guys give me a suggestion for a good track suit? Am in the market and looking to buy. Hello. Yes. I am back. And am Markiplier. Beep boop. I’m gonna disappear for 8 hours. Nobody panic. Will be back soon. Subnautica is BACK!! And things go very VERY wrong from the very very beginning... https://t.co/0UyvNzhBoF Subnautica is coming today! Will be later this evening but it’s coming! @justZazie @Caddicarus @ProJared @PeanutButterGmr @Jeff_like_Feff @Lythero @Krooked_Glasses @zoestanleyarts @_shunao @kinucakes @ninjasexparty @RubberNinja DAMN u made me look GOOD RT @ao__hoshi: Maybe you should just put it back on haha \n..\n.\nthis took way longer than it should @markiplier https://t.co/aa60SdEMG4 MERRY CHRISTMAS?! Oopsie poopsie, I forgot to post this special edition of the Try Not To Smile Challenge while I was away! :P https://t.co/4saTt9rXuW I’M HOOOOOME!!! IN VEGAS!! Almost back to LA!! I’m so close! Hopefully my sanity holds out just a LITTLE LONGER!! 1000 Miles left to go! Sanity is 💯👌 RT @AdCouncil: .@lizakoshy, @harto, @tyleroakley, @markiplier, @MeredithFoster, @tylergposey, @missremiashten, @orionnichole, and @nowthisi… Chica completely broke my phone’s microphone...\n\n...worth it... https://t.co/5YnyJKRIaK I’ve started the long drive to Los Angeles! Expect lots of random livestreams as I slowly lose my mind across the 2100 Miles... Reunited and it feels SO GOOD 😊 https://t.co/Vcg2PzvOFf I GET TO SEE CHICA TODAY. I AM FULL OF HAPPY. @ashtonandnarry @sashaysion BECAUSE I WANT A HUG FROM MY IDOL GOSH THE TOUR HAS ENDED!! I will be taking the long road home but this run was so much fun! Thank you to everyone who came out! RT @httpariona: a compilation of @markiplier punching @CrankGameplays from the 3pm seattle show https://t.co/D23hfQOVLh The Man with a Shadow https://t.co/5h69cezv6G @dog_rates Fair is fair... @dog_rates THANK YOU RT @dog_rates: Seriously guys? We only rate dogs. Please don’t send in angels. No matter how heavenly. Thank you... 14/10 would be an honor… I leave you with this final offering. I’ll be waiting for your response. https://t.co/KQTluNQI76 @CrankGameplays Got em. https://t.co/r5ArEFumNE Words can’t describe her. Numbers aren’t enough. CREATE A NEW RANKING FOR HER. https://t.co/nDQMlVSfCz Even under the INTENSE pressure of the vet she is cool, calm, and collected. A true QUEEN. https://t.co/x4M9yjDuii We will march on your headquarters if you don’t acknowledge her beauty. https://t.co/KWC95Q78AL @dog_rates I’m not letting you get away with this. Just look at this perfect dog. https://t.co/xMAI4qdgBi @septicemily @dog_rates I think it’s absolutely true @TheFlamingPear @dog_rates I am currently doing that thing Hey WeRateDogs @dog_rates someone made this and I’m sad that you didn’t make it first. What, is Chica not good enough for you? https://t.co/yep4K3K6jS I’ve gotten pretty good at summoning demons lately. Helps when the theater’s already haunted but hey 🤷‍♀️ PROGRESS 🙌 https://t.co/PlHvYlQKx6 How different would the world be if we made lying punishable by death? @itsWolfieKD @SeerMeDaddy @muyskerm @LordMinion777 Bob is a dangerous noodle, don’t trust https://t.co/FX9Zb30V8y I’m gonna let my hair grow all year long Dude... it’s time to stop ✋ Except maybe retweeting your own tweet https://t.co/zJ63gP4fXg Nothing is more satisfying than liking your own tweet I can’t afford shirts anymore... I keep flexing and tearing them all to shreds 😢 You ever just stare at a baby picture of yourself and collapse into a disgusting heap of heaving sobs because you grew up so beautiful and strong? You ever just see a random person on the street and you start sobbing inconsolably because they’ll never be as cool as you? You ever just look at yourself in the mirror and start weeping at how beautiful you are? SUPER SEXY SHOW PREP https://t.co/iaFJCadjms @EmilyJillette Thanks so much! When master’s away... https://t.co/17vdPQ04J9 still on the road https://t.co/oB6BfA8gFZ I love this picture! \n\nPhoto Credit: Rhaign Jiron\n\nSOURCE: https://t.co/rp2LiEWG2P https://t.co/rs7LuvAu4r RT @flipperone2012: If you were wondering, they’re always like this @markiplier @CrankGameplays https://t.co/CJ8mJmtxLt RT @pixlpit: In case you feel like reading, dear @YouTube https://t.co/mbvlC7YDM0 caption this https://t.co/gN1cR9Ij8H @cheekabeeeka Dis some black magic shit Tag yourself. I’m tyler dead on the ground. https://t.co/hemlop1uHT Someone please explain what the hell is happening in this picture... https://t.co/kGorhLnufm @amandatheg Good! That would have been REAL bad! Thanks for coming! Almost showtime! \n\nhttps://t.co/No6XRrbWTc https://t.co/MSDYWcdZsI @NetNobody @GarrettHilbert @SabrinaToth @Codes87 @twhiddleston @Marvel @selenagomez @nbcsvu @shanedawson @TylerNToney @CobyCotton @LittleMix @CoryCotton @Zak_Bagans @jordantroyr @DudePerfect @taylorswift13 @Ryland_Adams @shelbygraces @_Aphmau_ @GhostAdventures @perrieeddwardsx Why is my name the only one that your phone thinks is misspelled? Either way, hello! WE’RE OFFICIALLY ON TOUR!! Almost all cities are sold out, can’t wait to see you guys!! https://t.co/No6XRrbWTc https://t.co/r8KtsB720z RT @TOSAKARlN: @markiplier Hi Mark, I think this is a lovely gesture, however the area that Logan went to was in Japan and the social stigm… My New Year’s resolution was to talk less and do more. I want to be angry right now but instead I made a donation to the American Foundation for Suicide Prevention. If you make a contribution please reply with a picture, I’ll like as many as I can.\n\nhttps://t.co/Ap9W011NAX https://t.co/HcMuoJ5acl 🎊HAPPY NEW YEAR🎊 Last chance to SEE US ON TOUR!! Lots of cities are sold out but there’s still some tickets left! Check them out HERE — https://t.co/No6XRrbWTc https://t.co/ToM2MAmDNj Love those you can.\n\nForgive those you can’t.\n\nAnd give more than you get. And I know he’d be proud of me. \n\nI couldn’t have asked for a better dad. He was as kind and loving as all the good dads out there but he instilled in me the value of true and honest compassion. These aren’t my words, they’re my dad’s. I stood at his grave today and all I could think about was what he’d think of me if he could see me now. Relationships can’t be built on sarcasm. Tell your friends and loved ones how much you care about them and MEAN IT. Above all else, be kind and spread love. Videos will be late today! Spending some quality time with family and visiting my dad’s grave and such. Thanks guys! This HORRIBLE...\n\n...I love it... https://t.co/Cjx3U9NqX0 You asked for this... https://t.co/krzhNicb7W RT @RustyBean_: The King https://t.co/Tw25rT9tEx 16 year old me on my way to steal yo girl. Please note the Tool wristband, my +4 Charisma hat, and how little a chance you have to resist my charm. https://t.co/GcFi2Lmagh Have I ever shown you this picture? https://t.co/iO7ElYM9mK Here's the FULL VIDEO of Chica's first time in the snow! Also I do a little cover song in it! https://t.co/fBflgyBBvM @EastyBug It’s lovely! Merry Christmas Everybody!\n\nEven if you’re not around family and friends or if you don’t celebrate Christmas, I’m sending you love.\n\nAnd if you feel lost and alone this holiday season, I’m sending you all the love in the world. We’re all family, at least for today! Chica has officially seen snow. And there was much rejoicing. https://t.co/kSMtLqCvRz I love space so damn much Lixian has DONE IT AGAIN with another amazing FNAF animation! Send him all the love in the world! https://t.co/0hoWLChiu2 SNOW https://t.co/eeaANZdA5C Yes, I am Half-Korean. You’re doing great! Keep it up! Don’t let the mainstream media fool you... THIS is what peak performance looks like https://t.co/JXPjktYJIo Changed by the Kaboom https://t.co/8EppruGYBu @DobreLucas @DobreMarcus @dariusdobre @CyrusDobre \n\nHey 👋 My nieces are HUUUUGE fans of you guys! 💯💯💯 We love hittin 🙌 that 🙌 dab 🙌 #YeahWeLit https://t.co/T9rG22CPX5 Before and After Lucy punches me in the mouth https://t.co/aTgC9GwpTt 10 MILLION FOLLOWERS?! Do you think Twitter will give me a Diamond Shitpost? Thanks so much for putting up with me! https://t.co/pKQ4fcS90U 19 MILLION!! https://t.co/t9l5WxryYY @iceddarkroast It’s crazy beautiful out there! Monuments of time right in our backyards and that’s just what we could see from the road! National Park vacation next? RT @iceddarkroast: Almost home for the holidays! The last 4 days road-tripping across the country have been a blast, even with the cabin fe… Player 2 has joined the Kaboom https://t.co/WTfY41voxU Gettin’ goopy in the Kaboom https://t.co/zcrEFKGncj Problems with the Kaboom https://t.co/KX1vtepxLo Preppin’ the Kaboom https://t.co/QzKlGvMKrB I can only hope this works the way I think it will... https://t.co/3qmIMq4x9M Day 23 of the drive... had to feed Chica my legs... losing hope My #fitspo https://t.co/rcAC1ygHg4 Feels like 2012 https://t.co/y1kbTpQzKA RT @cheekabeeeka: SPAAAAAaaaaAAAAaaaAAAAaaCE https://t.co/d0O3Jyzsgk RT @httpariona: never forget this iconic moment https://t.co/o3wAz41ji1 In the desert 🌵 https://t.co/nAWQknHwsb Someday you guys will take me seriously... \n\nsomeday...\n\n https://t.co/q8BmeNf6Rr @Stealthless I’m ok with this @crazions Take it back. @SuminomAmonimus Try again. @StaticAndChaos Stop. @owliplier No. @iVexusHD I suppose technically you are correct but I’m still upset. @httpariona I neither know the chemical coomposition of mountains nor rocks but I feel that you are mistaken. @Thesherbertime Physically it does not. @bluebeanethan This is rude. Please remove this from my post. @_fucklstr I see some issues @vanillanestor I feel like you could have put more effort in. @authentikaitlyn I don’t have a cookie. @veIvetboy No. @nicolepeckk I think you know that it’s not. @cheekabeeeka No, I am holding up a mountain. @ao__hoshi I hate to disagree. @Cranbersher I mind. @CaptainSparklez That’s not what I meant. Hey guys, could someone please photoshop this so it looks like I’m holding up the mountain? Thanks so much, you’re the best! https://t.co/h5r0wFOo36 Chica had her FIRST POOP of the road trip! #ProudPapa HEADED HOME FOR CHRISTMAS!! It’s gonna be a long drive so expect some pics and silly videos along the way! RT @SuperMegaShow: SURPRISE. NEW MUSIC VIDEO OUT NOW.\nhttps://t.co/dvEy3dAx2X https://t.co/mNiQlm0cKo Is... is my insurance company threatening me? Just imagine a mobster saying this to you... https://t.co/mcvfeDajLd Look... I’m sad and pissed off at the same time. Bad combo. I’m gonna channel my anguish into something productive and continue to fight for #NetNeutrality \n\nThis isn’t over. Not by a long shot.\n\nhttps://t.co/exgVpX1P0h Buddi, my childhood friend and the best dog anyone could ever hope to meet, passed away this morning. She was the definition of a good dog through and through and I miss her so much. https://t.co/SUIHLx0xJz POLL TIME Since it seems pretty split, I’ve also got option RED https://t.co/JzZeJwfAin I need help! Pink or Blue? https://t.co/WGxnmtSfmD 😁☹️ https://t.co/Ld38zAWICt @septopic Yep. Daisy Ridley was nearby I think. Weee!!\n\nBut honestly, you should go see The Last Jedi. No spoilers but I’m gonna see it again and again as soon as I’m able. https://t.co/E1rUqgAGEX I legitimately don’t belong at #TheLastJedi premiere but here I am. I heard they had free popcorn. https://t.co/m22mgB6ebe I DID A BAD BAD THING!! https://t.co/Rm31rZjYfz FYI I recorded for another 2 hours AFTER I threw the chair in Getting Over It. That was me at my calmest... tomorrow... https://t.co/7psB9m3MSd @1D_Niamzouarry I think the opposite @directingdoom That’s pretty good @death_pie__ Somehow it’s even worse @sarahleyba No and also why @sesweawrites that is a shoe. a shoe is not my best friend. @JuneTreeDraws I don’t know what you read @maplemelon06 I don’t need to be held that way @pastelcee you did something @expiredketchup feels like not that @InternetUnwind @AjitPaiFCC no please, let’s bro it down @bimtrimmer this is offensive @sarcastic_sanha very far @Jacks_Hips no @prettypoet11 I wonder why... @Mankey_Spankey We are in a room @death_pie__ The opposite of bigger please @Porygon2_000 It is not @trapd00rdun This is not ok @Marissakcx Closer than anyone so far @Jim_City_News You believe in lies @Classiplier I do not agree @KatrinaMosquera yuck @death_pie__ You didn’t work hard enough @WRXAbby Mine as well @Classiplier No @goldensynishade this is not @WRXAbby Ow my feelings @lrstanfield Oh Zac... I don’t think I could lift all that muscle... @googlepIier no that is not my best friend @cheekabeeeka wow Hey guys, can you please photoshop my BEST friend into my arm like this? tyvm! https://t.co/Gfase55ice I have thrown furniture, screamed my lungs out, and now have a full-blown migraine at the rage I have felt towards this demon in the form of a game. I urge every single person to stay as far away from it humanly possibly. Wish it only upon your worst of enemies and even then you will be a cruel person for punishing them so intensely. I hate Getting Over It with every fiber of my being. No game has left with more hatred in my heart. I have no love left anywhere in my soul as a result of this terrible terrible game. @LordMinion777 Should I... should I try it? Could this really be the end of Five Nights at Freddy's? https://t.co/bnj93NAJCU Chica the FIREFIGHTER👩‍🚒 Was gonna make Chica’s First Hike for Chica’s World but considering that the hills are on fire I’m gonna postpone that one a little bit. gotta slip into my sneakin’ socks https://t.co/NF0C8CXyC7 San Fernando valley just doesn’t seem to exist at the moment... Side-by-side for comparison. Stay safe out there! https://t.co/9mWMgNdvSC So LA is on fire right now... literally. Driving through a WALL of smoke that’s thick as fog! Freddy Fazbear's Pizzeria Simulator is open for business!! This DEFINITELY ISN'T Five Nights at Freddy's 6... https://t.co/eZ2WYD1aXT It’s alright though, it’s all just stuff. Yeah it sucks that it’s gone but no one’s hurt and everything can be replaced so all-in-all it’s not the worst thing in the world. Think we did all we could for now. Police can’t start an investigation until tomorrow so it’s just a waiting game. Most likely that shit is gone so it’s 🤷‍♂️ @smolpotartist @iceddarkroast According to Kim and Kanye, it’s GOOF-o’-CLOCK https://t.co/8ngYdC0Dlp @smolpotartist @iceddarkroast Well that’s my car so I think I get to decide when it’s time to goof @iceddarkroast  https://t.co/rjRIAUsNex Cards cancelled, banks called, police report already filed before I started tweeting. Social media was not first priority believe or not heh Sadly no security cameras where we were BUT we know what store they tried to use our cards at so at least we can point the police in the right direction and get some faces from their cameras. Crazy shit too because we were near the cars the whole time. Turned our backs for maybe 10 minutes but that’s enough for someone to smash the windows... didn’t hear a damnthing. Everyone is fine, Chica is fine. Laptop, backpacks, wallets, keys, paperwork stolen. Well... just had our cars broken into. MANY things stolen. Guys did you see? https://t.co/MdQbH2SfJg #NewProfilePic https://t.co/Y9T66sgLHx Guys I need a new icon to finiplete (that’s my sweet new word combining finish and complete you ARE welcome) my sweet new Christmas profile. Please attach your hard work that I will NOT pay for with cover letter and resumé below. Happy Holimas (you see where this genius is going) You ever sleep for so long that you’re 100% sure you’re in an alternate dimension? When she’s happy, I’m happy. https://t.co/lgtMSpooGz A story in 3 parts...\n\nPart 1: she doesn’t notice\n\nPart 2: she notice\n\nPart 3: she NOTICE https://t.co/EJTzkqOlAW WARGBRLGLFLRBL https://t.co/0U4FT4U5g0 WARGBRLGLFLRBL https://t.co/K5BUhhdDDE GET COMF\n\nhttps://t.co/ROa59pUaXT https://t.co/5gDR1My2wF @kateiplier_  https://t.co/4GR2vM4wKu @HaileyAFreeman Am I kicked out? :( Sneakin’ off to da basement... #KickClub https://t.co/N6gjLNBn1a THIS IS SO COOL!! This awesome fanart from Terranova-arts MOVES! Thank you so much! SOURCE (send love here) ► https://t.co/kxnIUYJ2Gk https://t.co/RX1PNDX1RM @MysteryGuitarM I went whole hog for the RC-300 in an attempt to dive into the deep end of the pool and ended up drowning lol holy shit I love my dog Pants Update: ON @internetsmom I don’t know... I just... don’t know anymore I can’t believe I just said the words, “I should put on some pants” @gianna_jolie_ I’ve literally always done that so this train ain’t stopping. In fact! Now I’ll post even EARLIER!! So HAH!! It’s time for a brand new series! Unforgiving: A Northern Hymn is finally out so it’s to hunt some trolls. And by hunt some trolls, I mean run away screaming... https://t.co/iSF9k0NoEH @zaralrssn Real proud! Great moves, keep it up! https://t.co/FaQF0BKFyD P.S sorry for the late night tweet! Just been workin on stuff since 5am and finally got tired :P So it turns out... loop pedals are even harder to use than I thought they’d be 😅 @bluebeanethan NOOO!! Psst... hey, wanna know a secret?\n\n...you’re pretty cool...\n\nKeep that just between us ok? RT @cheekabeeeka: DOES IT LOOK LIKE I’M A PLAIN JANE? #Babcock https://t.co/e3mNwuANN9 Videos will be a bit sporadic this week while I hammer away at it but should start flowing in tonight/tomorrow! OOF! Still sore from that amazing stream this weekend! Working on something a little different this week that’ll HOPEFULLY be super cool but also might fail completely :P $416,713 RAISED FOR CHARITY! You guys SMASHED the goal beyond everything we could have hope for! BE PROUD because you’re changing the world!! https://t.co/nMNecheggU It's time for CARDS AGAINST HUMANITY!! We've got tons of punishments left so let's end the stream and smash our goal of $200,000! SO CLOSE NOW!! #BABCOCK https://t.co/H5gBsaj3TG Let's take it down a couple notches with something nice and relaxing... LIKE AN ICE BATH!! #BABCOCK https://t.co/h44FloymVt It's JENGA with MUSCLE STIMULATORS!! How can steady can we be with electricity controlling our every move! Please SHARE this to let people know about the stream! #BABCOCK https://t.co/pvMsalxqVP RT @celesse: The hi-jinks are strong this month! Donate &amp; spread the word! #babcock https://t.co/bqJ5LDeqkK https://t.co/zo1fAeStEL How can we DODGE ARROWS if we don't have any LIMBS?! Well only one way to find out! FOR CHARITY!! #BABCOCK https://t.co/NqF8LVvmHp WE ARE LIVE!! And it's time to put a SHOCK COLLAR on and go on an Easter Egg hunt because THAT'S HOW MARKIPLIER DO!! #BABCOCK https://t.co/rRaaQbJ5HU RT @iceddarkroast: I love cutthroat kitchen https://t.co/UOQtXizgMa We’ll be back online in about 20 minutes! In the meantime please SHARE the DONATION LINK and give whatever you can! EVERYTHING is doubled this time: https://t.co/u09W1Mp1EY We are doing a charity livestream TOMORROW!! It’s gonna be bigger than anything we’ve ever done before, more details soon! Happy Thanksgiving everybody! Let’s make mashed potatoes in a BATH TUB!! https://t.co/IVxLWBeHLk Workin in a sweeeeeeeeet thanksgivings Video today! Cooking at the same time so taking a bit longer, will be ready in about 2 hours or so! Thank you? https://t.co/Sbtt00BYr7 But in all seriousness, I’ve been neck-neutralized. Might have to see a doctor about this one. Pain is BIGLY. I wang-doodled something in my neck real good! Owie-wowie it hurts KaZOWIE!! I don't usually speak out about things in the political world but this is so incredibly important that it has to be discussed: https://t.co/xaSKTvZQAU Hey! Ho! Watcha gonna know! It's ya boiiiiiiiiiii Tyler and he just got PARTNERED and we're celebrating with som GAMES!! (Tyler made me tweet this...) https://t.co/WY3uwJF9KX I’m a meanie but she’s a cutie https://t.co/bR01ipafeR BIG MOOD https://t.co/hQY1kAZfUG 2 years ago today I introduced you to my newest bestest friend. Chica’s grown alongside me and I can’t imagine life without her! https://t.co/3NHv2emWFu Woke up to an avalanche of love this morning! Seriously, thank you so much for all the heartfelt messages, I’ve been reading them since I woke up and I’ve had a smile on my face ever since Hey guys, I know it's late and I'm sorry if I woke you up. But sometimes emotions hit hard at the latest of hours: https://t.co/NsyaSN9erP Don't you hate it how Ice Cream Trucks never show up at night when you want dessert the MOST?! Well now I've solved ALL YOUR PROBLEMS!! https://t.co/0YFrxmKYrk Do you think there’s an alternate-reality version of me that’s actually cool? Or am I goof across the multiverse? Psst... https://t.co/nAkysJQLg7 From all of your explanations, I've scientifically deduced that this is what \"BIG MOOD\" really means... https://t.co/HUvO7c7OIg Please send me a video of yourself explaining what \"BIG MOOD\" means or is or does in 5 seconds or less. What does 'big mood' mean? @attackonhowelll If I put some floaties on it, it should work. I wanna go to South Korea Get out yer squonkers, it's balloon time ONCE AGAIN!! https://t.co/w7cohqhNMY Did Australia do a good for #MarriageEquality? 🏳️‍🌈 The Sun may be a giant flaming ball of death... but it's also fairly useful sometimes maybe... https://t.co/FYqZIwYcE5 Oh hey, I made it into #30Under30! Thank you all so much for making that happen! Had to make some final edits on the video today but I just finished and I’m exporting right now! Will be up in about an hour! :D Look... I don’t collect a lot of stuff but I love this little piece of shit and I don’t care who knows https://t.co/4iv3EthuSe It's time for the our annual celebration of the 7 Second Challenge!! https://t.co/Gvm630D00Q RT @crazions: @markiplier FRIENDLY FRIENDLY FRIENDLY PLEASE DISREGARD THE BLOOD FRIENDLY FRIENDLY FRIENDLY https://t.co/AekpIknEQm We are SOLD OUT again! Thank you everyone who partook in the Ice Cream! Heading out now! https://t.co/C7EfS7SB7S Markiplier’s FRIENDLY Ice Cream Truck is open for business! Parked up in the Costco parking lot! Come get yer iced creams!! https://t.co/88PlkdeSQM THANK YOU EVERYONE WHO STOPPED BY!! We are out of here!! https://t.co/QzOhc07Eqq OPEN FOR BUSINESS!! https://t.co/F7B9enL4rL If someone tells you that you’re not good enough, prove them wrong. Is it the truth? Is it a lie? Either way we’re gonna get dunked in ice! https://t.co/6Vig8z0V5n What’s your least favorite animal? Something about my restaurant survey just doesn’t seem right... https://t.co/u5d7em7DZg @OliWhiteTV bby ❤️ Which one of the Buttercream Gang is good enough to be my boyfriend? https://t.co/nDZKRF2TLu mlem https://t.co/LVtZ9qFOzv Future video ideas: @michaeIplier @Markilypto @drkfchbch @ghostlymark @heyfischbach @GoPro I haven’t even started yet! @Markilypto @drkfchbch @ghostlymark @heyfischbach @GoPro Good thinking. You’re one of those smartos aintcha? @drkfchbch @ghostlymark @heyfischbach @GoPro You’re right. I’ll shove a GoPro up both ends o’ me to get better coverage. hey @GoPro guys! Unless you say this is a bad idea I’m gonna going for it! @ghostlymark @heyfischbach @GoPro Is it safe swallow a GoPro? Would it be better to start from the other end? @MzMarpeck I choose death @heyfischbach It’s currently in my stomach so hard to get a pic. @sadderdazzed death or pirate... worth it! Incidentally, I’m not 100% sure how scurvy works. It might just turn you into a pirate... I binge eat fruit about once a month. Not because I want to be healthy, but because I’ll suddenly remember that scurvy is a thing and I don’t want to die. Why does my pinky toe always want to get in a fight with all my furniture? ow... Buckle up! It's time to Try to Not Laugh AGAIN!! https://t.co/Xiy0tKrdvb ZOOM in on that FACE https://t.co/UhJYZiV2d0 You ever look in the mirror and give yourself a standing ovation at just how goddamn gorgeous you are? I sang a cover of Say You Won't Let Go on the tour. It was TERRIFYING but you gave me courage every step of the way https://t.co/xfca8mPpil The Evil Within 2 Part 2 is LIVE RIGHT NOW!! https://t.co/uLUqv2y6UU Always pay attention when toasting mallows!! Brand new holographic shirts available at https://t.co/ROa59pUaXT https://t.co/MI0r8gEJqa The Evil Within 2 begins NOW!! https://t.co/EVIZ03tM93 BIG PAPPA PUMP https://t.co/aRdBTltuZG This is cool cool cool https://t.co/DclOXVGNWw I’m thinking of investing in a SmartBoard™️ for the office, thoughts? 🙃 https://t.co/Bs1YclKJkC relaxin’ https://t.co/Kft8z9GjA8 Can Chica tell when I'm ded just for goofs? https://t.co/3aGi3bUva5 This is so beautiful!! https://t.co/PN6NIw4i1L @cheekabeeeka I only have those 2 speeds. No in-between. Everybody hold on to your butts... I’m feeling creative First trick or treat with my bay-bee girl! #ProudDad https://t.co/W3iZLl8i3L @gregorybrothers @schmoyoho Been rocking the wings since 2010 my dude https://t.co/sQduIkqt08 AMAZING new songify remix by  the wonderful @schmoyoho Words can’t explain how cool it is! CHECK IT OUT RIGHT NOW!! https://t.co/jCwnghNiYF I LOOK FUCKING AMAZING https://t.co/W5t3d9mJmJ I’m thinking I could rock a pretty sweet stache. Not gonna do anything about, just thinking. You’re beautiful and your personality shines through in everything you do! RT @markiplier8394: @markiplier Lemme know what you think of this mark 😁 hope you like it! ❤ https://t.co/4CRCUJ7iNe She’s my favorite ever forever https://t.co/rlwsdwCSlk @HaleysComettArt @cheekabeeeka  https://t.co/hatfbr3KmU @cheekabeeeka  https://t.co/kEZDL9kOOP thinking about how much I love Chica https://t.co/ZMvdXcI70k @joe_keery @CrackerBarrel I am so so sorry... the Cracker Barrel I know is better than that... Thank you all SO MUCH for helping us raise over $107,000 for the National MPS Society! YOU’RE ALL AMAZING!! https://t.co/fWTWTxGgqA RT @fishbachmarkroo: I definitely made this BEFORE this stream... definitely #yoink https://t.co/HizaC0c0bX HOLY CRAP THAT’S SO WEIRD https://t.co/QYIQLUEwi6 RT @pastelstarstuff: LISTEN WE ALL NEED ANSWERS SO VISIT THE STREAM AND DONATE IF YOU CAN #YOINK  https://t.co/z1V7peaNQz https://t.co/pUTu… RT @cheekabeeeka: Don’t forget we’re raising money for National MPS Society and every $ helps! DONATE https://t.co/9nRtjxvlGA #yoink https:… Please consider making a donation to the National MPS Society or SHARE this to spread the word! #YOINK https://t.co/lTaHkzXN7C https://t.co/Q9x8N4AJFG Streaming ALL DAY for the MPS Society! Join us for fun as well as some EXCLUSIVE giveaways! https://t.co/hDmvk3C5lj SLIGHT DELAY ON STREAM STARTING (lol that never happens) will be starting in 30 minutes! The stream will have skype calls and giveaways! @markjackfordays How about a Stranger Things watching stream? @HABOOSKl I’m terribly sorry to disappoint you but that’s a good idea for the future @bomb_ie Probably! Ah finally back home, took a road trip in The Barrel! Charity stream tomorrow at 10am PST! Welcome to the World’s First (maybe) Pop-Up Haunted House (van) https://t.co/Fwry0iG4xk WATCH OUT!! The sun is coming to GET YOU!! https://t.co/L9HKhrVIxP @internetsmom We had a haunted house in the van We just left the park! Thank you to everyone that stopped by and got SPOOK’D!! Gonna be here for another 20 minutes or so! https://t.co/R5j7gHCEnV EVERYTHING’s FINE https://t.co/SHGaIHlmD3 Does anyone in the la area have a mini fridge for sale? Will come to you! Send pics! new house? https://t.co/G6EOys5Eck This van is TOASTY!! We gotta fix it for Chica! WE GOTTA DO IT FOR HER!! https://t.co/kLm22JuCZg Hey guys, check out my SWEET NEW RIDE!! https://t.co/igVO28A2oK Is anyone in the LA area selling a van? Send pics! RT @httpariona: MY TV GLITCHED AND THE AUDIO GOT SUPER DEEP THIS IS THE FUNNIEST THING I’VE EVER HEARD @iceddarkroast @Girbeagly @CrankGame… I didn’t think it was possible but Chica’s even cuter than I remember! https://t.co/xNKufnDexe Just wrapped the last show of the October leg of the tour! I’m so lucky to be able perform with my closest friends for you guys! THANK YOU!! RT @emmagilliam47: gimme that good ole pelvic thrust @CrankGameplays @markiplier https://t.co/ZYPrHQr9gP https://t.co/oTWNvfPPDo Thanks for this cool pic! https://t.co/Bs3ftceF1t A fan DESPERATELY wanted this to get to me. We usually can’t take gifts but an exception was made... https://t.co/uOkaNYregs RT @RustyBean_: Made some bonus polaroids for funsies! Man, what an ending :D #WHOKILLEDMARKIPLIER https://t.co/7oenGoaaZT @CrankGameplays @verytiredkat @iceddarkroast And finally Dan Ring (MusicIsCode) who is on tour with us right now, he helped make the music something truly special! SO MANY THANKS!! @CrankGameplays @verytiredkat @iceddarkroast Also Evan for being an all-around awesome and positive dude! So much work went on behind the scenes that HAS to be acknowledged! @CrankGameplays @verytiredkat And of course Amy @iceddarkroast for doing the MOST AMAZING SPECIAL EFFECTS WORK I’VE EVER SEEN. Most of the really cool stuff was all her! Ethan @CrankGameplays for his AMAZING camera and stunt work as well as editing!\n\nKathryn @verytiredkat for audio and editing expertise! Alright, I’m not done... there’s even more people that made this project possible and they can’t be forgotten so BUCKLE UP!! Alright! That’s it! I’m done thanking people, I won’t blast your phone anymore! But I’m gonna thank you guys one more time... THANKS!! And last but not least George Hampton for making the groundskeeper just as memorable and twice as posh as any of the other characters. And of course the wonderful @PamelaHorton13 who went above and beyond as the Seer to make sure this project was the very best it could be! Next, shoutout to the incredible @RicepirateMick for bringing us a Detective who was equal parts disturbing and hilarious! First, to Robert Rexx for being the most quotable and relatable Chef ever.\n\nSecond, to @Apocalypto_12 for staying so true to the Butler. I know I’ve been thanking people all day but I have to give one more shoutout to a couple people for bringing the WKM characters to life Jim - Jim Spelling of WKM characters:\n\nBenjamin - Butler\nAbe - Detective\nDamien - Mayor\nCeline - Seer\nGeorge - GroundMan\nWilliam - Colonel\nChef - Chef Here’s a playlist of all the JIM NEWS on-the-scene exclusives! \n\nhttps://t.co/LZUcbDTDpU Also! Limited edition Who Killed Markiplier shirt featuring the art of @RustyBean_ available for THIS WEEKEND ONLY! https://t.co/kjpUmY9113 https://t.co/E2hyFjvfSb The biggest THANK YOU in the world to everyone who made ‘Who Killed Markiplier’ possible! And an equally big THANKS to all of you watching! RT @RustyBean_: @Apocalypto_12 @RicepirateMick @markiplier @PamelaHorton13 (Twitter only allows 4 photos whoops!) here's the man himself! h… RT @iceddarkroast: Here's a cute pic of us crowding around to watch a fresh take. Time stamp on my phone says 1:24 am. Won't trade these we… Hey guys! What’d I miss? Who Killed Markiplier? - The Final Chapter\n\nhttps://t.co/3POb18esYu Who Killed Markiplier? - Chapter 3\n\nhttps://t.co/LwC7WNm4bb Who Killed Markiplier? - Chapter 2 https://t.co/TNiwMR6iyE Who Killed Markiplier? https://t.co/9Wc5so2sFD You’re Invited! https://t.co/aXcsh3pdXn 1 https://t.co/WglYgJ8Goz 2 https://t.co/pytjhZzbSQ 3 https://t.co/3YIMIAoX3B I look like a mad scientist cackling over my latest diabolical creation https://t.co/skdb5GTriG It’s a ramen kind of night @Idubbbz calamitous RT @Idubbbz: https://t.co/rbtjAHgIPE I donated at the UCLA Blood and Platelet Center in Westwood Village! They’re giving out free movie tickets too! @LaffeySarah We’re all happy to help! Thank you for staying strong! @ryessa_love Aren’t those the same thing? Even if you’re not near Las Vegas donating blood is always a good answer! https://t.co/4LHlCzjiw8 I know this sounds awful but please be cautious when donating money to Las Vegas victims. Too often it never reaches those who need it most. @cheekabeeeka @MissRavenMonroe Read more on it, seems on the up-and-up but they’re not ready to handle donations for this yet. Will keep searching. @cheekabeeeka @MissRavenMonroe They’re a small organization with very little footprint but I’ve tracked some endorsements and backings. Just want to confirm. @cheekabeeeka @MissRavenMonroe Does anyone have any experience with the National Compassion Fund? It seems to be the one meant specifically to getting money to victims. @cheekabeeeka @MissRavenMonroe Agreed. Sad to say, opportunists are dangerously prolific during tragedies.  I’ll dig for a good one. @imfood_ That’s sad of him. You may very well have saved a life. And I’ll take, “might have saved one” over “what difference does it make” any day. If you’re looking for a way to help, please consider giving blood. There’s always a need for a it, especially with so many people injured. What happened in Las Vegas is beyond what a tweet can express. My heart goes out to everyone hurt in this tragedy. I’ll help however I can. RT @pastelstarstuff: pumpkin carving was a bad idea\nfeat. my fav of the @markiplier egos https://t.co/QQtSzUW1JK Thank you everyone for a WONDERFUL stream! It was so much fun and we vastly exceeded our goal! You're AWESOME!! We're still rollling, moving on to PUBG Zombies! Join us for some good 'ol fashion fun! #ConcreteDonkeughy https://t.co/eo4sNUvDKF RT @SkidSpace: I managed to catch rare footage of @markiplier in his natural habitat. (made this last night and figured I'd post it now) #m… Charity Livestream TOMORROW!! Tons of exclusive merch benefiting Direct Relief! 10am PST on YouTube! https://t.co/qU9GtpDCwj Have you ever seen a dog so cute that you spontaneously combust and die right on the spot? @Flammen_Angel This only took you a few minutes?! Scooby Doo? Is That You? I never knew you guys were so talented at photoshop! https://t.co/F8jBuPtj1o @HaleysComettArt this is beautiful @jacksfilms you did in fact do something @Cranbersher much better @legendofdonger i’m worried @DolanDark i’ve never looked better @Cranbersher I have some concerns @Lovelyvssl no less than I already was @heyitsjoeyg now it is @itspjdontask ok @LlKEABOSS im sorry but no @sofialouised u did not @LlKEABOSS so close @chasity_mayhaus that’s not my girl @PeepaBunny give it back @cranksgameplays no I do not @hiatusiplier hey wait a minute... @mochiplier no that is not @gamer__grace no this is not ok Can someone photoshop Chica into my arm like this? Thanks. https://t.co/cU2vGZPkA8 @Apocalypto_12 genotype @cheekabeeeka That is... my new worst nightmare. Kill it before someone names it and it becomes an ego lol We both heard a spooky noise... https://t.co/Ai0qZq1LXF @beaveresque I believe you’ll be able to go in an hour or more before scheduled door open time. @lum1natrix They’re gonna change based on what I have ready at the time. I’ve got a few surprises in store :P We're going on tour in LESS THAN 2 WEEKS! If you don't have a ticket yet go here to see if we're in a city near you: https://t.co/gRr0tTqODO Video Idea: Phone on Chica’s noggin. Permanent livestream from Chica’s perspective. @glitchyjse OH YEAH?! says YOU! I’ll go to the courthouse and change my name TODAY! Dare me! DARE ME TO DO IT!! @mrkfscbh no @mrkfscbh ok https://t.co/nfygan155m At some point in the show I’ll take on my grandma’s maiden name of Doom and then things’ll get CRAZY @ganjaplier Technically her last name Frank. So we could have a cool Fischbach/Frank rival clan thing going on. New series idea: Keeping Up With the Fischbach’s \n\nMe, my brother, my dog, and his cat all being our zany selfs.\nThoughts? You’re doing great! Keep it up! This is amazing https://t.co/3f9JsVlDey Gonna be streaming the pineapple pizza eating experience on instagram... @esnyxhes YOU THINK I DONT KNOW THAT Just ordered pineapple pizza @CrankGameplays https://t.co/HDk1youByW Phenomenal camera work by the one and only @iceddarkroast my magnum opus https://t.co/jDozI3uNCh @SkyWilliams I approve of this @haancho42 @Weirdlaugh107 @CatsyUnicorn12 @zen_neary @smolbeanhoeseph @RikNRolla @whisperchalchal @_AhJustMe_ @JadaPearl1 @therealjuh @drownmeharry I twelfth this @_fucklstr They gots a tail hole so they are now Hey guys, I worked hard on this new format. I’d really appreciate some honest feedback. Thanks, means the world! https://t.co/1LrG1DMEEs @blushyethan  https://t.co/LsvsehosEE @ganjaplier The best YouTube Red series? Red Rover with the Stars? Also, the NFL players locking arms in protest (which I’m totally for) makes me think we’re about to see the greatest game of Red Rover ever. Red Rover is the ultimate ice-breaker. Think of all the situations in which you could bring someone over. @RubberNinja You’re a god damn genius. Perfect collab opportunities? RT @cheekabeeeka: ‘YouTuber on Hiatus Turns Back on Technology and Becomes Wild Man’ https://t.co/YDftkoWJEs @SchiiFlight perfect... Thoughts on me becoming a makeup channel? everyone’s mood rn https://t.co/iqrYzEpDVd @KittyGamer20 @LizzieBethHD sweet twitter vid 2mrw promis beb Hey gang! Time for an after midnight vlog! Got something important to talk about... as usual... https://t.co/tbQtZcsGJV It's time for more PUBG zombies with @muyskerm @LordMinion777 @Jack_Septic_Eye and most importantly YOU GUYS!! https://t.co/hJOvC0aef8 A little bit of rage to start the day off right! https://t.co/OKCHLN0186 my smash single https://t.co/oUMi6NH0QT my debut album https://t.co/hr2N4IP6JP what should my future instrument forever (FiF) be? @priincessmikey Depends on how soon I can get my hands on a recorder All of my future covers will be done with a recorder. It’s my true passion. #doot #doot I Found Her Among The Aliens! Great song! Greatest song! https://t.co/HoCWINyh9D OIL? OIL! OIIIIILLLLLLLLLL!! https://t.co/vu7dNWB74R @Jennaaaaaa__ POINTS https://t.co/aR5d1gGIPU bonus points if you watch this video from the toilet https://t.co/Fa3HYiQB1i you didn't see anything... https://t.co/s56MOLlzkF @Jack_Septic_Eye But more than anyone the biggest thanks to @iceddarkroast for believing that I could! Also I wanted to mention that driven to do this after seeing @Jack_Septic_Eye's awesome cover of Chop Suey. Gave me courage! Scariest part for me was KNOWING I wasn't gonna be able to show you something I thought was good. But I knew I had to take that first step. I've been dootin' up a storm for a while now but when I committed to making this thing a reality... oof... I could write a book on all the emotions that came out over the past few days as I practiced this song. Terrifying sums it up pretty well. Here it is! My very first cover... Ed Sheeran's Thinking Out Loud https://t.co/I4jOSvmUkp @beccalikesmemes @bIushymark @disneycolby @determinedjack Here you go! https://t.co/uVjG9G3ecO @bIushymark @disneycolby @beccalikesmemes @determinedjack I can give you the Korean translation \"곧\"\n\nDoes that help? @disneycolby @beccalikesmemes @determinedjack no no no it's pronounced exactly as it's spelled @beccalikesmemes @determinedjack I'd like to think it's pronounced SOONE @determinedjack no no no I said \"SOONE\" not soon It's DONE! I'm ALIVE! Video SOONE! RT @RicepirateMick: 2 months for 2 minutes animation lol. I hope some of you enjoy it &lt;3 \nhttps://t.co/PRGHUgo8P5 I know the schedule is super wonky right now but I'm putting 100% effort into something that absolutely terrifies me. I want it to be good. HOLY SHIT, congrats! Go get them BEANS~!! https://t.co/8UyaJsCjbA @emmablackery Yeaaaaaaah! Oh you know what time it is... time not NOT LAUGH!! https://t.co/jexZKGkVC5 Watch this video before it gets me BANNED FOREVER!! https://t.co/eKOiWE1noh Tickets are ON SALE NOW: https://t.co/gRr0tTqODO You're Welcome... https://t.co/HcJ2hx8LP2 @bekwek948 scroll down on the website oops... https://t.co/gRr0tTqODO https://t.co/ciRTIcHHRS RT @sadgamers: such beauty and grace #luckyflannel https://t.co/eymYj4NDu8 I love you... #luckyflannel https://t.co/BEtRGF02be No one tell Shawn Mendes that I'm listening to his music. I'm cheating on Ed with too many people as it is. @KittyGamer20 Ah yes, the most badass people in the world. Rambo... John Wick... KittyGamer20... @fnaffan692 MATT NO @raelyndlr_music  https://t.co/4gWvJmOLHy @beccalholden Show us the way to the bottom of the barrel... @pIantboys liar https://t.co/ws8BLjfvhZ @SpanishHaunting you could have doing something productive other than retweeting. Like making your profile actually spooky. RT this to get absolutely nothing. In fact, I will make fun of you for it. https://t.co/Vop7juWP8E RT @httpariona: HE GOT HIS FLANNEL BACK @markiplier https://t.co/MvyTyCyEdx @mikeivision Not true. Not gonna be there. Not even at the con right now. Sorry you got kicked out of line but don't start drama. RT @matthwatson: New music video I made with @elirymagee and @OneyNG is finally here, y'all. My Two Lovely Uncles.\n\nhttps://t.co/Ys8SsuMwvk She meant Hot Doggie guys... https://t.co/HB9igJLtl3 ... https://t.co/k0vxDqu6P8 What if she's been kidnapped?! Oh no... this text holds so much potential... this could be life-changing! Hot Damn? But that would be suspiciously out of character for my mother... has someone commandeered her phone? NO WAIT! If you all caps it won't autocorrect right? It could mean literally anything... hot diggity? Hot demon? What could have autocorrected to that? I'm so scared to open this text from my mom... https://t.co/L2sNtWjS5X A group of elderly Asian ladies walking around a city is pretty high up on my list of favorite things. If they're carrying tiny dogs too... You ever just wake up, the sun is shining bright, the birds are chirping, and you say to yourself, \"Haha I am human trash\" @antisgIitch @iceddarkroast CORRECT ANSWER @lum1natrix Direct Hit on head and splatter everywhere Just got shat on by a bird, did I: Oh shit... I completely forgot to schedule my videos for today... they'll be up later tonight! I'm at the con right now Also, anyone that says, \"You look tired, you ok?\" is next up on the chopping block. No good comes from that horrible statement. @TreasurexTrove @Girbeagly name a more iconic couple... I'll wait say you won't let go or whatever... https://t.co/7JBnWZmF4b went out for a little doot https://t.co/dZne5zmuPK umm... EXCUUuuUuUuuuuSE YoU? https://t.co/iLxrjTqi5m When are we gonna move forward as a society and make unsolicited advice punishable by death? Try Not To Laugh? Well... why not! https://t.co/3fqOvHeZby I still haven't taken out my wisdom teeth. If I ignore them and bury them down for long enough they'll go away just like my emotions, right? I'M BACK!! Here's a silly little vlog giving you all the sweet deets of the happity haps of the past week: https://t.co/7Dij2XMPOO she blonk'd #nationaldogday https://t.co/MFxFXAaQTy MISSED THIS GIRL SO MUCH!! https://t.co/AVF85Gj3y0 @RicepirateMick Same goes for you, you really brought the whole thing together 💪 Just wrapped an incredible week of filming with these amazing people, along w/ @PamelaHorton13, Chris, &amp; Evan. So grateful for all of them! https://t.co/NTV8wI94x6 I may be back and forth on a lot of things but god damn it feels good to just fuck off and work on what makes me happy It's been good though, taking the time to be 100% pure creative without obligations and bullshit getting in the way. Hey! Internet is fucked out here in the boonies so videos are gonna be all over the place. But hey, working on a crazy cool project! it's gonna be a good day https://t.co/66Jcp86Luv 1 million rt's and I'll stare at the eclipse and gO FUCKING BLIND don't stare at it, you will fuck up your peepers. RT @Kayroos_: Tarot Cards Project #1\nDarkiplier - The Emperor https://t.co/la9gt2I85w Destiny is calling me.\nOpen up my eagle eyes. she snooz https://t.co/QsJxNiENwx Chica lays on the floor a lot. Thought that was a little silly until I laid down on the floor next to her. Life is pretty good down here. @MARZlABISOGNIN k https://t.co/IBDPsoY4qK snooooooot https://t.co/orEMwNie19 So what'd I miss? #NewProfilePic #markcaneggomyeggo credit to @Cockgameplays https://t.co/ObwvjMckbL I don't know what's happening but it's great https://t.co/wbCtWNjxR5 RT @heyfischbach: #markcaneggomyeggo\neven Dark likes his waffles 😩😫👅💦 https://t.co/IoNVJRpEMp @Jack_Septic_Eye @muyskerm @LordMinion777 New round is up! GO AGAIN!! We're still doing PUBG with you guys and @Jack_Septic_Eye @muyskerm @LordMinion777! Server Name: 'Join Us' Password: 'Bepis' Still space! Join us! https://t.co/dk2aRRzuhG RT @muyskerm: Join @markiplier, @Jack_Septic_Eye, @LordMinion777 and me for some custom @PUBATTLEGROUNDS! Server \"Join Us\" Password \"Bepis\" Brand new Markiplier Makes animated by the wonderfully talented @Kayroos_ !! Let me know what you think! https://t.co/FrLJ5gxXIT @cheekabeeeka we all have trouble finding ourselves every once in a while... Is it too late for me to become a blacksmith? peepis this beepis https://t.co/6NpUqLrCzg Charity Shirts are still on sale for a very limited time! Check em out and support a great cause! #TheBellyBetween\n\nhttps://t.co/01iOiopXjo Dream Daddy is LIVE and so begins the 2nd half of the charity livestream! #TheBellyBetween https://t.co/pkdIT7SgSb 2nd half of the stream will start tomorrow at 10am PST! Will have 100% fewer crashes and 100% more daddy #TheBellyBetween @CaptainSparklez Congrats!! The Charity Livestream is underway! Join us for a day full of fun on YouTube and in #TheBellyBetween https://t.co/EEwGAAIN1k Also a BIG happy birthday to my brother Thomas!! @TwoKinds OH BTW CHARITY LIVESTREAM TOMORROW pure evil...\n\nhttps://t.co/3fyBNzOrwZ also the face of pure evil https://t.co/XL1hNg6hQ7 Also the face of pure evil https://t.co/263XjXL7xU The face of pure evil... https://t.co/DP98lM7EPh If someone wants to risk their life serving their country, what kind of response is it to repay that bravery with, \"You're too expensive\" I know it's been said before, and you know that I'm loath to discuss politics, but how hard is it to understand that people are people? Wow. I'm not sure how I only saw this now but the idea of banning trans people from anything, let alone serving in our military, is asinine We're working on something really special for 18 Million but it's taking a long time to get perfect. You'll love it though! Maybe. Probably. Woaaah 18 Million Subscribers... our sweet baby of a channel channel is all grown up now and old enough to vote!! Thank you all so much! bell got sum socks https://t.co/Z6E41DhRPg 6 YEARS IN A ROW! Thank you so much Arleen (@Lengirl21) for being here for me after all this time. It means so much to me to see you again! https://t.co/RsbHpcbZHY @iceddarkroast @22CVR22 Amy it's ok, life is giving you lemons... go make lemonade 🍋 ⠀ ⠀  🤠\n   🍋🍋🍋\n🍋🍋🍋🍋\n👇 🍋🍋  👇\n      🍋🍋\n      🍋 🍋\n　   👢   👢 \nhowdy. im the lemon man sheriff. \n\ntwitter will hear about your transgressions. It's time to chase your dreams in Dream Daddy!\n\nhttps://t.co/SZ7AdLylto My wrist hurts... is it from: The Joy of Creation: Story Mode is finally fully released! And my goodness it's FANTASTIC!! https://t.co/Nh283ijRBc ran 3 miles again. took pictures this time. https://t.co/Ku4hAVIVLV @Crecelius731 Thanks Hey someone send me that meme with all the misspelled fast food restaurants god I've been listening to Sign of the Times on loop for the past hour. No one tell Ed that I'm cheating on him with Harry She on a snoofin' spree! That was a down-snoof for the record https://t.co/KG6KXVqPAG I think dogs leave messages when they pee like in dark souls and other dogs vote them up or down with sniffs and snoofs did it. it was awful. gonna try to run 3 miles today, never ran that far before. Everybody ready for a NEW REACTION COMPILATION!? https://t.co/zSMXRzQqbE @trellyeye Tyler hurt his leg we had to postpone that one Oof it's late. Or early depending on your earth perspective. I don't know, man. Either way, cool video tomorrow now imma go body slam my bed Hey guys, I wanted to share this story with you about my dad and how he forged my love of space https://t.co/LgwlCLT5wt My mom is getting CRAZY good at nails! Check out her slightly creepy setup! https://t.co/bvG4Y5HlDW Buying a ukulele *doot* *doot* @Cassidida_ This ain't GTA I can't just plop and afro on I need a change, toss me some new hairstyle ideas. Haha my door pulled this hilarious prank on my finger! We were both laughing. https://t.co/eO1MlRILHR Time once again to learn about the 4th of July! https://t.co/L4X5N8TCOy ARE YOU FEELING 'MURICA TODAY? Oh wow I could not stop laughing at this hilariously stupid game: https://t.co/ovgJm7yBBK It's time for another episode of Markiplier Makes! This time we get to the nitty gritty of what art is all about! https://t.co/weDjVQ0FeC How do I become a K-pop star? My Mom sent me this Bell Update: https://t.co/RvxeYJZ3pa @thetomska You've gone too far. I'm out. fuck you mayn. @thetomska Diss track incoming @LordMinion777 THE EASY LIFE!! FINALLY!! @LordMinion777 D'aww ya big sweety @muyskerm Thanks man! Capping off an awesome birthday with a dinner with friends! Thank you all so much for everything today! https://t.co/6E3XKLM3wi @verytiredkat D'aww thank you so much! WHAT DO YOU HAVE TO SAY FOR YOURSELF?! 😠 https://t.co/8HlqWXtJIt @Foxtrot44 THANK YOU SO MUCH!! @Wiishu Thank you so much!! @Jack_Septic_Eye THANK YOU!! I think it's gonna be a pretty dece day @iceddarkroast 💝 For my birthday let's explore some secret videos on my banned channel! https://t.co/W1h3Wt2nP2 HAPPY BIRTHDAY EVERYBODY!! https://t.co/j7Qm8yYRqW Hey gang! After 5 long years I thought it was about time to start using my subreddit again! Come join the community! https://t.co/pGAXJKZ57M Hey! Your new profile picture arrived! https://t.co/Jowa5l7xvz Saw a birb today. Best day ever. https://t.co/Otqz6Zn0nQ On a lighter note, here's a video of me putting on and taking off a buncha shirts! https://t.co/h0AOtFnf3h Something very important has been on my mind and I needed to get it out in the open https://t.co/jeTaZWiPDR WE DID IT!! $100,000 raised for @AbleGamers!! You should all be IMMENSELY proud of what you've accomplished tonight! RT @trellyeye: #BorfBoard only the best stripper. make it rain for him over at https://t.co/15sDb0vGyb @iceddarkroast @verytiredkat @markip… RT @NessakaV: #borfboard Fanart for this wonderful Stream! Please everybody Donate if u can! https://t.co/kdQlUd3gNQ\n@markiplier @iceddarkr… Here is the donation link! Please help the cause and share this around! #BorfBoard  https://t.co/cRZgKBuYUF It's official! Welcome to #BorfBoard for the AbleGamers Charity Livestream! SPREAD THE WORD!! https://t.co/HLs4qNts7W RT @LizzieBethHD: @iceddarkroast @markiplier @muyskerm @verytiredkat I made an Aesthetic™ Schedule for you guys! https://t.co/NxdmUOWdT2 We are LIVE!! Join us for a day full of fun for charity! https://t.co/KSAd0smzqD CHARITY LIVESTREAM TODAY!! RT @ScribbleNetty: NEW Short Fanimation w/ @markiplier , @Jack_Septic_Eye , @muyskerm &amp; @LordMinion777 \n-&gt; https://t.co/aGKF4mquba &lt;-\nHope… #NewProfilePic https://t.co/eqwQ34swxt Hey literally everyone is in this vlog https://t.co/E8glbA4Okq Just met this cool dude! @dantdm https://t.co/SrXSsh2a4z #NewProfilePic https://t.co/5wFjR1tpzC Get yer doots on with this awesome remix by @DaveDelirious https://t.co/TQmZMDxGWA Time for VidCon! Oh! One more thing; Charity Livestream next Sunday! Bob's flying in for this one! So from one 'influencer' to a million more... Thank you so much for changing my life I make stupid videos because it's what I love and I'm so lucky to have ANY success let alone the support that you show me every single day Look, I'm honored. I really am. But I think you all know how much I abhor the term 'influencer' and the accolades that accompany it. Well this is pretty crazy... according to @Forbes I'm the most influential person in gaming... https://t.co/rsdT685otm I join @shodleech who I met almost exactly 2 years ago through Make-A-Wish in another epic game of coordination!! https://t.co/ON4s4bYFUn You wrote words and I read them! You know what you're signing up for... https://t.co/j3WSscuGWN Hey, you're doing great! I got this for you, you've earned it! https://t.co/H9aZ8QGTe4 As a fellow Ohio boy, I can confirm that we do chew people up like gum. Prepare for the sweet embrace of the CRINGE!! https://t.co/z49iB0GPzZ Chook and Sosig is so damn charming I can't help but love it! https://t.co/Ce2DfZYh6T Anybody want to try to not laugh? ANYBODY WANT TO BET ON IT?! https://t.co/2XCGj4hDjp Pants Update: OFF snoot https://t.co/BYTiCpmQ8x Anybody got any ideas for livestream challenges/punishments? Something without eating, drinking, or going outside HAPPY BIRTHDAY!! https://t.co/Sg9bIxnSdz Here's that video of Bell you all asked for https://t.co/s7FNk3xhmc RT @Kayroos_: Chica best puppo 💕 https://t.co/DP9FdzEq9H As you can probably tell, Chica missed me! https://t.co/Z5sSjdBaB4 Also my mom got a new pup! Everyone say hi to Bell! https://t.co/mRjnzAPVN6 SHE BACK!! https://t.co/gVMEl793hy Woah... so this is canon? Not fanart? Foxy looks... different https://t.co/MQubzixLr5 I came to the realization that I was 'not cool' as I was typing out this cursed tweet... https://t.co/DXcgUNa9YT If there's one thing that I've learned in my time on YouTube... it's that I'm not cool Picking up Chica soon! I'M SO EXCITED TO SEE HER BEAUTIFUL FACE!!! @michaeIplier I pick her up tomorrow sadly :((((((((( @falscttos They smell like lies Ahh... the sweet smell of fake boobs and smog Finally back in LA @zaralrssn I'm dancing 24/7 @marveIsean meet me in the alley, it's on @djhsrose never I'm so sore from dancin' 🕺 I'm going home! https://t.co/vcyVQM2F61 Can a Genie help make me taller? OR MAYBE I'M TALL ENOUGH JUST THE WAY I AM!! https://t.co/WIsWH5TLKO RT @crankypml: IM NOT CRYING https://t.co/BueA5y6ibX It was the BEST show to end on. The opening was beautiful, the dance battle was intense, and the improv was hilarious. Thank you so much Tonight was the last show of the tour and so many emotions came pouring out at the end. I'm so grateful to have friends who believe in me. I cried Tonight's show was really special, my family was in the audience! Thank you so much to my Mom and Step-Mom for driving out to see it! Almost accurate, not enough sweat! https://t.co/lCjmAy6cEp Excellent https://t.co/h8dqJbMajR Things get a little OFFENSIVE in another episode of Cards Against Humanity! https://t.co/pChlPDYjYl Thank you Houston SO MUCH for such a wonderful night and I'm so pumped for the rest of the tour! Another show... and it was just as breathtaking as the first. I don't think I'll ever get used to the rush I feel when I step on that stage. Could I Am Bread finally be over? Is the demon gone once and for all? https://t.co/dTkS7FMoCB Houston... we're coming for you... https://t.co/60eTdPrpty Just finished the first live show and I'm so proud of what we brought to that stage. I'm even prouder of my friends who never ever quit. I'm breathless. I have more emotions than I could put into words. I can and will never be able to thank you enough for changing my life. TODAY You ever just start talking about goo and suddenly you can't stop talking about it? Yeah... me too... https://t.co/JeHrtGs18s ARE YOU READY TO BUILD A SAND CASTLE?! https://t.co/ZkZjmDzndO Last day of show prep before the OPENING NIGHT HOLY SHIT IT'S SO SOON!!!!! ❤️❤️❤️ https://t.co/CbNnHswbeT RT @Kayroos_: @markiplier As fast as I could https://t.co/nbU47kfDc0 RT @Kayroos_: Since I'm not going to be there I hope everyone have a great time at the tour! EVERYONE! :D https://t.co/qGXyumQOsS Draw me like one of your French girls https://t.co/dmAYUDaMIK @Jack_Septic_Eye Sorry, let me try again for you.\n\nGood morning, Gross! @bubbysean well get ready because it's about to go down Ready to take over the world? @markjackfordays I forgive you Good morning, beautiful! test post please ignore https://t.co/80TwxqlxME Travelling with wade is my favorite thing! https://t.co/N93ES8ajae ROAD TRIP TO DALLAS!! https://t.co/IfzYVkzIyx Just finished our first full dress rehearsal for the show! Drowning in sweat but it's so much fun and I can't wait for you all to see! The gang takes to the skies to blast some pirates! If only wade could captain correctly!\n\nhttps://t.co/csXfVtnpRZ RT @matthwatson: 100,000 RTs and I'll get a minecraft tattoo me rn https://t.co/tmP9s09ofp Did somebody order a pizza? https://t.co/NXmYhfsMPA The tour is officially underway! WE RIDE UPON IRON WINGS TO GLORY!! MAY THE WINDS CARRY US SWIFTLY UNTO YOU!!! Cards Against Humanity is back at it again! https://t.co/nzDv5Hsgum YOU ARE AMAZING! Final tally for the last charity stream was $198,328 raised for @GameChangerOrg THANK YOU ALL SO MUCH!! @muyskerm Oh shiiiiiiiit I can't believe that we're going on tour in less than a week! Can't wait to show you what we've been working so hard on! OH BOY IT'S TIME FOR READING YOUR COMMENTS!! https://t.co/Jp2HtY1lnX Send me a video of you guys pronouncing Drakensberg, KwaZulu-Natal #TextsWithMyMom\n\nI didn't understand... https://t.co/vhySQ9T6OG #TextsFromMyMom https://t.co/whb9NOkfw7 Why is it that the longer I sleep, the more tired I feel? I've finally picked I Am Bread back up and I intend to finish this damn game NO MATTER THE COST! https://t.co/BYpsOCCsIn Videos will be coming later tonight! I'm having a wonderfully creative morning today! @OdeToSigne dead... https://t.co/M9abWnKRbn She's beautiful! https://t.co/PdseXm7075 Bought a peach. It was lovely. I'm on the h3h3 podcast RIGHT NOW!! Come join us for some chit chat https://t.co/lfCCP9Y6Rm My channel is 5 years old today! HAPPY BIRTHDAY EVERYBODY 🎉🎉🎉 Thank you all SO MUCH for an amazing pair of livestreams! Extra thanks to special guests @PamelaHorton13 and @SmoshIan, we had so much fun! We've sold OVER 9000 Pajama pants and #PJORTS during this charity stream! Get'm while you can and thank you so much! https://t.co/ncZfxYI9wJ Day 2 of the Charity Livestream has BEGUN!! Join us for a day full of fun and #PJORTS https://t.co/o4bUoNKd8i THIS IS SO COOL!! https://t.co/3cKlGKVEx2 RT @markjackfordays: IF YOU WANNA RT I NEED 1000 RTS BY THE END OF BOTH STREAMS TO GET THE M PANTS PLS HELP MY SOUL!! THANK YOU @authentika… RT @darkmagic_sugar: What is Mark so afraid of??? @iceddarkroast @markiplier #PJORTS #markiplier https://t.co/piiEypXvVf RT @LexZLalas: I think Luna is Chica's number 1 fan! Also Suki is here too #PJORTS https://t.co/EK5ry4TEyC Thanks for joining the first half of the livestream! We'll be back again tomorrow at noon for another 6 hours of fun! We are LIVE!! The May Charity Livestream for @GameChangerOrg is underway so join us for a day full of fun! #PJORTS https://t.co/mqmBxO4AeL Reading Your Comments is BACK!! Let the fun times roll! https://t.co/zBnR5wYlxI Second video will be slightly delayed today! But it'll be worth the wait, people have been asking for this to come back for a while! My heart goes out to Manchester and everyone affected by the attack. I can't imagine the loss you're feeling. I Am Bread is back... but this time things get a little... quiet https://t.co/qGRjG38JO1 @daddy_exe now it's forever https://t.co/xNj6ILp562 @easeIy you tried 👀 im fuckin lost https://t.co/pRnnA1eepN Happy birthday to my favorite person, Amy! @iceddarkroast ima pull a sick trick https://t.co/JDBI6iCg5p @Ittilemix @brightswm @zaralrssn  https://t.co/3MwBnZM7Io @brightswm @zaralrssn HATICE UMKFUGJDA! @zaralrssn Ethan and Kathryn did the bulk of the framework. I did the special effects, audio, and polishing. About 2 days on and off I'd say! So happy you guys liked the video! My editing hands hurt lol and of course huge shout out to @Matthiasiam for the origin of Googleplier! Software Update Available NOW!!\n\nhttps://t.co/BqYp0PjGX7 Software update coming soon! Available May 20th @ 12pm PST! Would you like to download? https://t.co/jasc3wbzjc Subnautica is back with another episode of subterfuge and screaming! Also VAST quantities of fish whumping! https://t.co/EnAqmp04lm There's something bigger than anything we've ever seen before in Prey! Also back to 8am and 12pm PST video releases! https://t.co/thxeV9T5fs What's the best app to learn Korean? Anybody want to start a study group? Get ready to see what a true Wild Man can do in Ultimate Epic Battle Simulator!  https://t.co/aDZxZg5Cox I'm streaming with BOB right now! Come hang out! https://t.co/s15JmJ1Ojq Thinking about getting Chica a friend... OH! We raised grand total $123,086 for the Environmental Defense Fund in last month's charity livestream! AWESOME JOB EVERYONE!! :D Happy Mother's Day to my Mom and my Step-Mom who always have and always will be there for me!! BEWARE THE FIDGET SPINNER!! https://t.co/k32SWAibcz https://t.co/yK6V8mSBwt https://t.co/InwhMnBJcv Memories like that aren't a sad thing either. I cherish every moment of my childhood, even the dark times. They're all part of who I am @LordMinion777 Sitting in any car from the 90s takes me right back too. Something about that old cloth interior. It's weird... cigarette smoke always reminds me of my dad. I don't smoke nor do I encourage it but it always takes me back to my childhood life has its downs https://t.co/N97oQ4NFrg life has its ups https://t.co/TtAM5Ag7Nw Hey gang, wanted to chat with you about some recent health things. Nothing to worry about! Just got me thinking: https://t.co/cIgQruDPf5 Cool stuff! https://t.co/UJfvSMoYW9 @sunsetiplier Sending you this righteous thumbs up to give you cheer https://t.co/UsDTkkgXwI @jekspedicey I have like no hair @hisokaplier I hope your day gets better! Have a nice day! @iceddarkroast everything is about you This just in: phase 10 is bullshit and my family are all jerks who cheat at cards games that are unfair towards people named mark @snazzysepticeye Not everything is about you Family friendly fun times! https://t.co/x8Yz8te3eE Having a lovely afternoon playing Phase 10 with the family! @SofiaWite888 @Lauraboss89 @SkarletteSmith @djhsrose @Thesherbertime sorry I sneezed https://t.co/VuAqyC1p1p Rootin' Tootin' https://t.co/t4Ts57WvCn RT @iceddarkroast: https://t.co/NPUSeZFYop RT @iceddarkroast: I made a couple modified gifs for your goofin' pleasure https://t.co/SIhrrtm3C2 @awethans @DEPRlVATlON I dottin e-bleeve it it has tog be a dremma @Mariaabak As a child I once mistook my mom for another Korean lady. My 8 year old brain couldn't comprehend that this stranger wasn't my mom. @TargetPredictor What are they gonna do, clean me to death? @awethans The winds of destiny carry me to lands unknown and somehow that poetic bullshit means I leave my clothes on my floor @ItsJustLientje Naw just me @getoutaparadise 👈😐🤙 @LlKEABOSS VANESSA @LlKEABOSS You are killing it this morning In other news, I'm generally a slob. I'm always afraid that airport security is somehow gonna detect that I've worn the same shirt 3 days in a row @Jack_Septic_Eye Thanks man! I'm really happy with how it turned out, thanks again for the voice line! The bloopers for Markiplier TV are gonna be longer than the actual video lol Welcome everyone to Markiplier TV! https://t.co/O9fFpv32yY And for my next trick... https://t.co/RcfgLuIX8g WARNING! Every single ocean creature wants to FITE YOU!! https://t.co/xwtWyzaa15 If the world was ending do you think people on the internet would be frantically trying to type \"LAST!!!\" Taking a bit of a break this morning! It's been a rough week but I should be back to 100% form with videos for you later this evening. Who am I? Who are you? Who am you to me? Who are this video? https://t.co/bbeZfFlGEU @roryasawa K https://t.co/9Famoa1OJ3 @illumiplier Then you's a smol dork @istanrickgrimes I am perfection in a dorky wrapper and I love it @determinedjack I think the words you're looking for are \"FUCKING PERFECTION\" Never be afraid to look like a giant dork GET READY FOR EVEN MORE LIVESTREAMING FUN!! JOIN US! JOIN US! JOIN US! #ArubianCumpf https://t.co/kX2sEyWOA3 This is the actual quote that occurred during this moment https://t.co/L6CuFuKFTy WE ARE LIIIIIIVE for the charity livestream of epic proprotions! Join us! JOIN US! joiiiiiin us at #ARUBIANCUMPF https://t.co/kX2sEyWOA3 RT @iceddarkroast: is this funny https://t.co/a71bBcLr8N DABBING IS NEVER DEAD https://t.co/PCquUJ9eRL So is dabbing officially dead yet? RT @cheekabeeeka: It's time for a livestream again!  On Sat, come spend the day with @markiplier and the gang and help raise money for a go… also lol charity livestream this saturday im tired fml Shave my beard for the livestream? WE'RE GOING ON TOUR!! Check out all the show times and locations right here: https://t.co/SluvFeiYO5 Ah what a lovely morning to get destroyed by balls https://t.co/cG1fUunLaY\n\nP.S. Tickets are on sale @markiiboo you'll see in 10 minutes It's 8am and I already have whiplash A day without pants is a day without stress @Nawtson I'd just have to get large blackout shades... It's astonishing that I fully realize how good the sun is for me and yet I still choose to waste away in a dark room on the internet. Is it possible to overdose on memes? Feeling like myself today https://t.co/ODO2fMd3nA RT @vickorano: Stream is LIVE. Making a poster for @markiplier's upcoming tour.\nhttps://t.co/EtW2b1nrI7 | https://t.co/zdKHxVCGD9 | https:/… I was born in the memes. Molded by them. https://t.co/jXi6buIEcL Hey guys, you remember that little tour thing we mentioned a while back? It's happening: https://t.co/m0ESOez7GD Outlast 2 has BEGUN!! Get ready for an insane adventure of scares and screams! https://t.co/cforIKW4A7 @michaeIplier Fuck ye I am https://t.co/DZIsd5JfvW Trying to be cool is overrated Outlast 2 begins at noon! And then she shat on the floor of my soul 💩 She chewed through the walls of my heart ❤️ Sometimes I just stare at Chica and wonder if she knows how perfect she actually is. Get ready for some sweet new updates in the latest episode of Subnautica! https://t.co/OexT8jbGQU Spread some joy today! Go out there and make it great! @JonboyGames @sIIowtowns this was a wholesome exchange!!! https://t.co/eAb8RgfB2m @starryseptics You don't always need to mask your emotions! Sometimes help is just a call away! https://t.co/MybYv3Cgqn @HaleysComettArt Glad to hear it! I hope they keep rolling strong for you! https://t.co/aWoSQNE6JT @michaeIplier Sad times may overstay their welcome but it makes the happy times that much sweeter! https://t.co/Gyy683wJzh @markibach You'll get em next time by continuing to practice and improve yourself! https://t.co/1Skjg0U9vX @baytins I hope this smile helps you through your troubles! https://t.co/wvbley3D7Y are you having a GOOD DAY?? HELL YEAH JOIN US!! https://t.co/QB11QMAvhM This song has been my motivation juice since I started my YouTube channel. Best way to wake up! If anyone would like to get FUCKING HYPE today just listen to this song: https://t.co/FzE1B1CAu7 @LordMinion777 @muyskerm KILL IT BEFORE IT BREEDS @muyskerm This seems normal... https://t.co/dJGahLhLzl SUH DUDE https://t.co/ugCiC4Nbgv Every single one of you matter @starrysepticeye thank you @Ittilemix no Here I make a fool of myself and accidentally hit the emergency call button... https://t.co/eK849M1ANn @cinnamontoastk @pewdiepie Yer welcome! @cIoneswars @iceddarkroast I'm sitting in traffic... no amy in sight https://t.co/YCQy07impM @iceddarkroast oh... oh no... @cmonjackaboy Big DUMPLIN party at your house? I'm gonna make me some chicken and DUMPLINS Videos will be coming today but a series of unfortunate events is currently unraveling inside my computer. Late night uploads HURRAY!! Try Not To Laugh is back at it again and I do surprisingly well this time around! (I am 100% lying) \n\nhttps://t.co/M9aI0gpPcu @sunsetiplier missed opportunity @JakeJDasilva this does! @determinedjack NO PLEASE @emmagilliam47 NO! MY BEAUTIFUL VOICE!! @PickleMeTimber HOW COULD U If this tweet gets over 1 Million likes you guys will CURE MY LARYNGITIS!! Retweets have the opposite effect... @tinybIue Ok 👌 Hey guess what? I have laryngitis! Can laryngitis be cured through internet likes? @FLOOFTHEHAIR Did I? Don't Play His Game https://t.co/whDWrKsRSp @darlingmarkimoo @septicjpeg @baytins Harsh! I love it! @septicjpeg @baytins Finally! @baytins was I dead? @polarizedrae and...? Anyone else not wearing pants out there? @Airforceproud95 @Robert_12_21 Naw man! Your videos are hilarious, I'm a fan @NickieNoxious the boy #TextsFromMyMom \n\nHow even... https://t.co/hUbw1Y54Tf STOP WHAT YOU'RE DOING AND LOOK AT THIS DOG!! thank you. have a nice day. https://t.co/Jfx8fhWk3j @iceddarkroast you're welcome @iceddarkroast fall Just said goodbye to Bob, Wade, and Molly! Always sad to see them go but I'm so excited for the show! This picture is so cool! Thanks @Foxtrot44 for taking it https://t.co/FbaIzvvi41 @StamperTV Art died with me I didn't survive this... https://t.co/jQogsgJiMG Time for an adventure! https://t.co/I1WfYijY8n Can I get a Moon Shoes brand deal? https://t.co/u2TAGY575j WHERE'S MARKIPLIER?! https://t.co/8J2l2jSeWK @mrkfscbh Haha naw no crying video, just woke up in a good mood! So thanks for being who you are! I've been spending a long week with some of my closest friends and I'm just so grateful to be where I am! You make me laugh and inspire me to be better! You also keep me in check and roast me when I'm being a goof! Hey gang, just wanted to say thanks for being here with me. You make my days special and I feel better every time I get to talk to you. Look at these cuties! https://t.co/4LxWGtQwOj Is everyone OK with me referring to myself as Boss Baby from now on? Hey @Cranbersher... little markimoo had an accident... https://t.co/dduIq3Dhat RT @ALLCAPSMARKIMOO: https://t.co/sKqfeDfV0T Ascending to mega-hipster levels https://t.co/kA8SEy36fg @PamelaHorton13 Come at me @WSJ I'm ready! Thank you all so much for 17 MILLION SUBSCRIBERS!! And happy birthday to Wade who is one of the best people I know! https://t.co/CfxIIrZbib @EmiXv croppin out the fans amirite https://t.co/gVUOyV04rL 17 Million celebration video is coming today! Bob, Wade, and Molly came into town and also its Wade's birthday so a little busy 🎉🎉🎉 RT @ALLCAPSMARKIMOO: https://t.co/adWU29qxjR In the car with my frands going FUCKING HYPERSPEED https://t.co/ggUuDZlAB5 RT @muyskerm: Best friends just hanging out. Having a chill time. https://t.co/0tCgmSsKmY #TextsFromMyMom https://t.co/50nhOyt9EG #TextsFromMyMom\n\nWear glasses again. It look as if you are try to look not as handsome as to fit in with normal people. Trust me mom know. I love my mom @muyskerm Can confirm. Look at this fun. https://t.co/NTi01b2VdU Apparently it's walk time for Lucy and Bubble! https://t.co/rK0UCqbgoZ My mom sends me daily updates on how Lucy and Bubble are doing. Lucy just got groomed! https://t.co/0bbe4P0rxn 17 MILLION SUBS!! What a thing to wake up to! Thank you all so much! markiplierbouncesonatrampoline.jpg https://t.co/rP4ts8zK0V It's Minecraft in 360! What could be better? https://t.co/DgpBweLzcs @HaleysComettArt Wouldn't have been possible without your amazing art! And sorry for the delay reporting the total! There were so many charity shirts sold that it took a while to confirm the numbers. That is WAY more than I could have possibly imagined! Smashed all previous records, thank you all SO much for supporting the cause! GRAND TOTAL FOR CHARITY: WATER - $254,621.25 @fawnsivan to keep me safe at night This is Fred, my bed cactus. He keeps me safe at night. https://t.co/XP5WjRiBDF @PamelaHorton13 You won't like me when I'm Slangry... https://t.co/Ni5xQBF12C Slungry?? I've just learned the true horror of being sleep deprived and desperately hungry at the same time... Hey! Ho! Let's NOT LAUGH!! https://t.co/qNG80zVWlR @muyskerm you're DOING IT! He's DOING IT!! Why does my little toe keep trying to fight all my furniture? @Jack_Septic_Eye CONGRATS!! Thank you all so much for an incredible stream! We destroyed our goal but we'll know the final count either tomorrow or Monday! THANK YOU!! Darkiplier charity shirts will only be available for another 12 hours! After that they're gone FOREVER! https://t.co/xwjgEs4cJs We are LIVE!! Come join us for a day full of fun for Charity:Water! #NOTCLICKBAIT https://t.co/yZ1l3e88vO Getting a little dark in here... https://t.co/3bxIy9zQJ1 I think we've had enough seriousness for one day... It's time to learn how to date pretty much ANYTHING!! https://t.co/i62ibCG72B RT @cheekabeeeka: It's official!  Come hang out w/ @markiplier @Apocalypto_12 @CrankGameplays @iceddarkroast @verytiredkat &amp; Chica! Let's r… Hey guys, just wanted to put out a proper thank you for all the support you shown and wrap up some thoughts: https://t.co/iu3BvqrEVZ At the end of the day, I'm just honored to be a part of this adventure that is YouTube. And I wouldn't be here if it weren't for all of you. But what was most surprising was to hear that other YouTubers that I look up to sometimes feel the exact same way! Hey gang, I just wanted to say thank you for sending me all the love in the world after my late night video. I've been reading all morning! Hey guys, sorry for the late night tweet. Just had some things that I needed to get off my chest: https://t.co/UzeQvOx8JF Happy #NationalPuppyDay https://t.co/1zyqJql0i5 Still sick and now Amy has the flu as well, gonna be taking care of her today. Videos delayed! Winter is Coming... https://t.co/SauuTjL5hX @Ittilemix @Jack_Septic_Eye that video should be ready sometime today. @Jack_Septic_Eye next you're gonna tell me that getting naked and burying myself in the snow Shining-style wasn't a good idea... Oh it's good to be home, unfortunately looks like I brought back the PAX plague but I think I'll be able to crank out some sick vids today! Oops back to cute https://t.co/Sysw03Y3CC VICIOUS BEAST!! https://t.co/cMVtQuuZn2 @markiplayer tyler was delicious 😋 @starrysepticeye we've been holed up trying not to starve to death lol Should be back home tomorrow! New videos will start rolling out by Friday, thanks for the patience guys! Stuck... https://t.co/CCa6KSGJdD If I get stranded in Boston, I'm gonna punch each and every snowflake in the face. Here's the FULL panel from PAX! https://t.co/MiOV8EOVby Come at me, blizzard! My body is ready! RT @GrittySugar: He keeps whispering to himself... https://t.co/NxqAWwWFnA RT @iceddarkroast: worm boy https://t.co/LGAiD1ZT5k When we're gone... you're next... Will be LIVE soon! Ask us questions at #bigboisblasting https://t.co/s0IobQZOlO Proud of this guy! https://t.co/kebsTMT5Dr PAX East | Part 1 | ALL AROUND ME ARE FAMILIAR FACES AT THE PROMISED LAND!! https://t.co/hcN0zDRqrE Goofin' with some goofs https://t.co/Wuz93WNjQN save me https://t.co/FqAS3K4Zh1 Sometimes you just gotta tell the TRUTH... no matter the cost...  https://t.co/qjloVeeRZJ For anyone who missed a livestream I've organised them into a single playlist! Watch Chica be cute and us be dumb! https://t.co/QsQ98KfoxR You make me happy when skies are grey https://t.co/aJBpAuPCU0 I will love you until the end of my days https://t.co/cdqqVI1ExG me with my nemesis https://t.co/paYvQ5pHnf I need to make more videos with Chica It's for a video, I swear. This is a serious tweet. @LaffeySarah Aww! That's super adorable, a whole farm of em? Does anybody have a cow I can milk? Just made it home guys. That traffic was hell. @markjackfordays IF I COULD I WOULD Currently debating turning my car around and driving straight into the ocean. If you're happy and you know it you're definitely not me right now. I've been trapped for so long I've forgotten what Chica's face looks like... someone save me... @CastheWriter so do I friend... so do I... Currently in the midst of the worst traffic of my life. 1 hour 30 minutes to go 15 miles... save me with your memes. You guys know Tyler right? Well watch along as he desperately tries to edit one of my videos! https://t.co/NcWLrQuanp LAUNCH ME. Strap me to a rocket. I'll explore all 7 planets. Give me a magnify glass and a spork. I'm your guy. Guys. Listen. Please... pls. @h3h3productions fine thanks https://t.co/qO9vbNdv7u No one man should have all that power... https://t.co/LEUL6vdIfw \"That was easy\" https://t.co/BtR51f8l0e Chica is a ROCKSTAR!! https://t.co/kGqWtlPjXV @ganjaplier Chica FUTURE PRESIDENT'S DAY https://t.co/tlvOArSma5 Hey... take a look at this and jiggle your phone a little. Does the picture move for you?\n\nSOURCE: https://t.co/CTvLYAw3ff https://t.co/jA8MOETA1g RT @NukaEle: Oops, I spilled my rice...\n#IStandWithMarksThiccNeck\n@markiplier @CrankGameplays @Apocalypto_12 https://t.co/SWT0QhGman $110,000 raised for St Jude! I'm so impressed by each and every one of you. Never stop being a force for good in the world. RT @McHowlterIDK: I HAVE!!!! FITE ME MARK!!!!!! LOOK AT DIS!!!!!! FITE ME!!!!! #IStandWithMarksThiccNeck THIS IS MOST ACCURATE!!!!!! IVE WA… Would you like directors commentary on the BTS video right now? RT @ktandtommy: @markiplier Poem speak soul. Words make cry. Need hug now. Inspiration me take for generations. Love idiot Mark. #IStandWit… RT @emmagilliam47: i spilled my goldfish... #IStandWithMarksThiccNeck @Apocalypto_12 @CrankGameplays @markiplier https://t.co/U8dzn3yuct WE ARE LIVE!! Spread the word and join us for a day full of fun for a great cause! #IStandWithMarksThiccNeck https://t.co/qkIKHP4ZF1 Stream is going to be delayed! Computer just asploded! Need to fix or switch out @maxmoefoe we're crushed https://t.co/WCo6kURdtn @maxmoefoe I'm a changed neck, bby https://t.co/sG0HgVh0xI @maxmoefoe I'm using this hashtag for my charity stream tomorrow @maxmoefoe @YouTube Yo YouTube, I heard you had an open slot in your Red Series lineup... @maxmoefoe dude... sweet neck bruh @slowbeef Feel free to make whatever you'd like! It wasn't a sarcastic like either, I honestly thought it was hilarious. I needed to get this off my chest: https://t.co/y0c9NyhZCz Videos are on the way! Had a bunch of recording done this morning but then had to run to a meeting. Will edit and upload when I get back! @pewdiepie You've always been true to who you are and that's what I respect most about you. So today I'm gonna unwind and spend some quality time with Amy, but tomorrow it's right back to making awesome videos for you guys! https://t.co/mschkTFBYg This is the kind of content I want to do more of as a Youtuber. Not necessarily choose-your-own-adventures but big, fun, creative projects! Thank you all so much for the amazing response to the video! It's so heartwarming to see people loving it so intensely! Happy Valentine's Day! Get ready for a VERY SPECIAL date with yours truly! https://t.co/oJRAMVXKX0 @iceddarkroast @PamelaHorton13 @Apocalypto_12 @CrankGameplays @verytiredkat https://t.co/y4b0GWhg0w @PamelaHorton13 @Apocalypto_12 @iceddarkroast @CrankGameplays UM EXCUSE ME WHERE IS KATHRYN?! @verytiredkat Hi ho. Hi ho. It's off to work I go. https://t.co/kWdSY3DJEu Today is our last big day of filming and I love being able to make cool videos with my friends! Miss you buddy! https://t.co/9o9OzZLu3l You ever just think about how great dogs are and start tearing up for no reason? That's me right now You ever get so hype you just start tearing up for no reason? That's me right now It's been a crazy week of filming! We've got a few more scenes to shoot but I'm so happy with how it's turning out! https://t.co/d7oidMmLZj @CaptainSparklez my climbing skills have gone to shit, but I'm getting back in shape again! Even though I hurt my back the other day... @CaptainSparklez Hey that's my line... happy birthday! Long day at work https://t.co/BjVyV62E5P @Jack_Septic_Eye Happy birfday big boi! Get your bugles blasting for birthday bashes! Two Big Bois Blasting Bigly on their TooTer ShooTers https://t.co/go0MHkvJYq @pewdiepie so my dream last night DID come true! RT @Apocalypto_12: *sigh*\nHere you go @CrankGameplays \n#TomBrady #Patriots #SuperBowlChamps https://t.co/NUwBURLMHx I'm not even a sports guy but this super bowl is INSANE! IM SORRY https://t.co/UHdEHtEm64 I haven't dab'd in over a week... I feel so free... I think I can quit for good this time! What do you call it? BE HONEST!! Good morning everybody! Who wants a hot fresh pancake? https://t.co/QQxb5hsv9h ghost dog https://t.co/X0EGMq9uE0 Hello. Yes. I am alive. @Cobra_Acid goopy Axel had something that he wanted to say to you guys https://t.co/iQzTUzDKhj And that was the last we ever saw of Mark... https://t.co/SKg7reKTLp RT @iceddarkroast: green screen possibilities are truly endless... https://t.co/a0sYDvvLkq Me and @Apocalypto_12 Break each other's spines in some friend yoga! https://t.co/pw1Mr1HBm6 Surprise! I'm in Denver visiting Axel for Make-A-Wish! Everyone please show him all the love in the world! https://t.co/EP6b5afPcx I'm a big brave boy and I'm ready to face the family in Resident Evil! Can you say the same...? https://t.co/SADd8BhTsi I'm gonna be playing the crap out of the new Resident Evil! Expect the series to start tomorrow RT @Floating_Megane: @Apocalypto_12 what a chill stream~ i love it! :D https://t.co/rbIHr60NW4 Welcome to The Life of Me: A Markiplier Story. A One Man Show written and directed by the handsome Tyler and Ethan https://t.co/OfDnmTZuj9 Punishment Video will be released in 30 minutes... here's the trailer to get you prepared for the cringe! https://t.co/7vCSmzebzY Thank you all so much for such an fun stream! We ended up raising about $128,000 for the Human Rights Campaign, you are AMAZING! HERE YE! HERE YE! I now decree that my favorite color is RED. This is not okay... https://t.co/IHI4kAWlVk RT @musiccasualty: @markiplier we went out in the snow!!! #markisatool https://t.co/u4uvIKP0od Da curl #MarkIsATool https://t.co/l7dkaZjU8p RT @astrohowlter: #markisatool I made one and now I can't stop :') https://t.co/hz8As9aklD Here is the donation page! We are DESTROYING our goal! Almost $30k in less than an hour! That's AMAZING #MarkIsATool https://t.co/3KUES2O2BZ SURPRISE!! It's time for the charity livestream for the Human Rights Campaign! #MarkIsATool https://t.co/2psq3DntwX But we have to remember that a single day of solidarity isn't enough to change the world. Work hard every single day to make it better. The sheer number of people here is staggering. Unity on such a massive scale is simply inspiring. About to be swept up in the flow of people! https://t.co/rBpdG83SLh Downtown! Lots of people, lots of signs, lots of emotions! https://t.co/cTihnP5dKN Headed downtown to join the #WomensMarch and give you guys some insight to the scope of this. Never stop fighting for what you believe in NOOOOOOOO!!! https://t.co/bwgzv7CKvz They call me MISTER Butterworth https://t.co/jNQswZQ1Po Anyway, just thought I'd share this experience with you. If there's any takeaway to this just tell the people you love that you love them. And then I woke up. Feeling like a changed man with nothing changed at all. The pain was so intensely real that I wished for anything to end it and yet the dream marched on in the most ordinary fashion. I remember every moment of it vividly too. I remember collapsing down and crying at every single thing that reminded me of him. I had a dream that my brother died. It was the most intensely sad dream I've ever experienced. You ever have one of those dreams that change your entire existence? I've got frowns for days, baby They're taking away my phone and being locked in the green room but I was instructed to retweet this. https://t.co/4DrNPeqGJL https://t.co/OPFo9ZluLY Snugglin' is just about the most SAVAGE badass thing a man can do. Some people have a baseball bat by their bed for self-defense. I have a cactus. If someone breaks in they're gonna get cactus'd Tweet me suggestions for cards against humanity cards! Tweet me pictures of 2 people doing yoga... Boutta drop the sickest mixtape of 2017 https://t.co/3c3bgc3vCT @yebuuma 😗👆 Coming soon to Disneyland: The Markiplier 4D Roller Coaster Experience. THE FANART I MADE FINALLY MAKES SENSE!! I love fanart so much and I'm super happy with how this video turned out! https://t.co/rAKc4wEemY @LUCKYMCLOUGHLIN You're welcome! Congratulation on the pups! https://t.co/Mk77HIgb6T @Nick_Astalos You're welcome! https://t.co/qnN749nkWr @muaphil enjoy your new twitter layout. It's the perfect size! @muaphil You chose... poorly... https://t.co/ns6G3JiOL2 Tell me something that you really really LOVE!! Choose wisely... I'm going to be making something out of it... @seansinfinity I love his @manyipliers perfect representation of my channel Hey @h3h3productions I know you get a lot of fanart but I just wanted to send this your way because I love you guys! https://t.co/tsFLQulMit Hey @Explosm! Been such a long-time fan of your work. Always makes me laugh and I look forward to everything! Made this for you! https://t.co/Pn5MRCKZdw Hey @Kurz_Gesagt! I really love your videos so I made my own little birb! Hope you like it and keep making awesome videos :D https://t.co/d85osUHSSQ Ouchies! Pup keeps me company when I'm practicing guitar https://t.co/JereItDbap Some of you who pronounced \"Worcestershire\" made it into the latest video! Be ready for more in the future! https://t.co/KgJMJw9EMY Send me a video of you saying the word \"worcestershire\" Tyler to Ethan when he's doing a push-up: \"Why are you turning your hands in? That's causing more drag and thus slower clap speed.\" Wilford Borfstache https://t.co/Mq4IbSm96J RT @CrankGameplays: #IStandWithEthan https://t.co/km6hscEvLm @RyanRaniytea thanks! @JackieSepticeye I make some 👌gifs @KaelaSepticEye I have a mental age of 7... https://t.co/fYvxv8B1OX @Jack_Septic_Eye Congrats! You're DOING IT!! @muyskerm @LordMinion777 I second this @cheekabeeeka that's cute! 16 Million Subscribers! Thank you all so much, that's incredible! What a way to start the year! @CrankGameplays it's crazy boys or bust @the3omgs IM ON A PLANE LEAVING SRY @septicviktuuri YES @bubblyjeon WALK FUCKO @smallvocalist BE HAPPY DAMMIT Day 3: When everyone else has already given up YOU WILL MARCH ON!! My mom attempts to play Five Nights at Freddy's! The results are hilarious :P https://t.co/N7XYVcMtAd @Pinkieruth YOU'VE RUINED 2017 Day 2: KEEP IT UP OR 2017 IS ALREADY RUINED I miss Chica... Practice Guitar ✅ @shortcakekotori tired 1 Hour of Exercise: DONE DAY 1: This is it! Time to commit to something big. Don't let a second go to waste! Happy New Year! It's time to commit to something new and not let yourself be bogged down by empty promises. This was the first picture I took in 2016 https://t.co/QMYYvcaP3g Disappearing for 2017 https://t.co/BYP1Goi1A0 New Years Resolution: Mores Memes? Lucy: \"WHO THE FUCK ARE YOU?!\" https://t.co/Styhyq8qrd This is the only warning you guys get https://t.co/9Kw7PwRXeq @FoolishKia @CrankGameplays best tweet of 2016 @markiplier The answer to this question was yes. I'm not sure why you all had so much trouble with it. Think about it: have you ever seen me and Chica in the same place at the same time? @Flibity_Bibity @YouTube Alas not... I still live in the basement cage. But I've grown accustomed to the cold and the dark. Also if you haven't seen the new Nerdy Nummies WATCH IT! It's hilarious. I promise. Would I lie to you? Don't answer https://t.co/Fsa9WnnMso I join @RosannaPansino in a HEAD-TO-HEAD CHALLENGE TO THE DEATH involving Play-Doh https://t.co/jlva0iWnhY @Jack_Septic_Eye I've got the BIGGEST head! I've got the BEST head! If I lay down on the Mexican border trump doesn't NEED a wall. @CrankGameplays @Jack_Septic_Eye I don't know what you guys are talking about. I'm great and perfect and everyone agrees with me #winning Hello. Yes. I am hooman. \nPlease and thank.\nBorf.\nExcuse me. https://t.co/X467bo1iKx Look at these sweet baby boys @muyskerm https://t.co/ATTyFwjMDh Today I celebrate Christmas with my step-mom and my countless nieces and nephews. I plan to make a video later tonight but for now I relax! @midnightiplier that is one hell of a shirt! And most of all, Merry Christmas to each and every one of you for making my life something incredible. Merry Christmas to my mom who has a knack for nails! https://t.co/0QIk1rpM7c Merry Christmas to the wonderful people who inspire me daily! https://t.co/ijgt9gQw8X RT @ALLCAPSMARKIMOO: https://t.co/Bvs23gE9wH @CrankGameplays that's... quite a video URL you got there... https://t.co/yQhe4IHFam @Jack_Septic_Eye @cinnamontoastk I'm 0% Irish and PROUD Christmas kisses from the girl 😘 https://t.co/kDIX3TIVdQ I'm dreaming of a flannel Christmas https://t.co/O9E5EBUkJG @spnfreak0203 NEVER FORGET @OfficialJlipper the BEST memories I almost just cried... logged into my old computer and fired up Minecraft for the first time in ages and was flooded with so many memories. It's time to relax and spend time with friends and family. I hope you all have the most wonderful weekend possible! @flipperone2012 Happy Birthday! WHAT A DAY!! Thank you all so much for making it an incredibly successful event and a special thanks to all my friends who made it so fun! Alright, this was totally useless the past 2 times because you never got to help them. MARK IS BACK!! https://t.co/8yX4PQ2hP9 RT @leftovernickel: #crazyboys https://t.co/ZAQ5YF0raC Tyler is going to give it a shot #crazyboys https://t.co/8yX4PQ2hP9 Bob is going to try again. Please help him. #crazyboys https://t.co/8yX4PQ2hP9 Now it's BOB'S turn to die horribly! #CrazyBoys https://t.co/8yX4PQ2hP9 If you want to vote for things in Killing Room... vote here: https://t.co/8yX4PQ2hP9 RT @cheekabeeeka: It's the 10th day of Christmas!  @LordMinion777's got a lot of leaping to do! #CrazyBoys https://t.co/dew83OJzsP RT @suke1234kay: The only thing I can remember #crazyboys https://t.co/dn4HjUQv5H RT @darkmagic_sugar: #crazyboys @markiplier @iceddarkroast \nI've never drawn Amy, but I'm glad I did!!! :D Go out and buy your own holiday… RT @cheekabeeeka: Come join these #crazyboys https://t.co/lwpvaubB0w https://t.co/WMzBikjUEz RT @Kayroos_: Yay now in color 🐻🌟 #CrazyBoys the livestream is going amazing as always! https://t.co/qqIymvtHcw RT @911child: #CrazyBoys https://t.co/vnSG6piRTP @markiplier  @Apocalypto_12 @muyskerm @LordMinion777 Enjoy https://t.co/NsDYRaml3b RT @Lin_Rinku: #CrazyBoys\nptoo.png\nDonate if you can! [ https://t.co/X4MktYyDUx ] https://t.co/kyfAVOcPrV WE ARE STILL GOING STRONG! Please share this stream of #CrazyBoys for a day full of fun for a great cause! https://t.co/iLFY0peHAx What game should we play next? #CrazyBoys https://t.co/ZB96K8VhGW RT @baby_jai_03: #crazyboys Markimoo and Chica Bika https://t.co/rXyA71WjRb Special limited edition Tiny Box Tim plushies are available for pre-order RIGHT NOW! #CrazyBoys https://t.co/vIAJISh7hi We are LIVE!! Come one, come all to the Christmas charity livestream! https://t.co/iLFY0peHAx It's so good to be home! @OfficialJlipper probably tomorrow @BixLePro my throne is a pile of trash @flobethany naw loads of people have beaten it already. I'm late to the game @howellcanyounot FNAF 2 had 10 characters that were MUCH more chaotic IMO but then again it's been a while so time makes things hazy @EpiclyBorn yep! @Chlobob03 I pulled it out of the dumpster. It's got some moldy ramen on it but it's aight @flobethany umm... I don't really know. Probably around 100 attempts? @17blackee This one was really monotonous so not the most fun but then again I don't think I can call any of these challenges \"fun\" lol @look_up_here yeah but that's no excuse @SmolMatthewx Oh WAY easier. But not to say it's EASY. A lot of multitasking and focus required which is hard to do while sick :P Beat it! Total time about 7.5 hours. I'd rank it about 3rd most difficult 20/20/20/20 mode behind FNAF 1 and 2 @DyvyneNephilim I was too tired to rage lol. Just a lot of silence and coughing, I recorded that though for whatever it's worth :P Put ~6 hours into Golden Freddy mode, got pretty close (about 10 seconds away) but started feeling sick and sluggish. Will finish tomorrow! Wow the spammers aren't even trying anymore lol https://t.co/FjLFiIO1fq It's Christmas time at the office! I'm so grateful to be able to work with such amazing and talented friends! https://t.co/IjQDKy1rzy Ask me any Christmas related questions! I'll answer them in an ice bath of eggnog! I can be your angle.... or yuor devil https://t.co/cMxqtIHlVJ EVERYBODY HIDE! SANTA'S COMING!! https://t.co/GTVa27FgsA Hey, just a little reminder that it's going to be okay. You got this! RT @ALLCAPSMARKIMOO: https://t.co/MY3NSoRjM8 RT @ALLCAPSMARKIMOO: https://t.co/bsRCWoGkt8 It's time for a sickening cringefest https://t.co/mZyEuCzjOw Still feeling garbo but ive got a special try not cringe that I think you'll enjoy. More to come, just been a rough go of things. It's time for Markiplier's 12 Days of Christmas! https://t.co/OOUE1l9QIM Here's a little sneak peak of things to come! https://t.co/elxY5vFS98 Sick 😷 RT @Kayroos_: @markiplier My hand slip 🐻🌟 https://t.co/tIuH6Ma1Eu She's my favorite https://t.co/S06VIhKeHt Get ready for a very special Monday livestream! We'll be talking about my trip to the UK and finishing Undertale! https://t.co/hMwBSD3qE2 Having a lovely time making breakfast with the gang! We got in about 4:30am last night so needed some sleep and a reboot then videos soon! Looks like someone caught me slippin' 😜 https://t.co/CJDqXbr5I0 Charlie Brown Christmas https://t.co/9W8tzsgy7r He's gone guys... delete the channel. https://t.co/DCIsuutM78 He just fucking VANISHED?! https://t.co/8K8m4QZgqL Where the fuck did Mark go? https://t.co/cYtpOID6C4 da- https://t.co/ePEErC9GNG @shimmyshammy22 MURICA is a melting pot of countless cultures. I'm both and that's what makes it great. @JanetLaCava I'm Korean @fefa14100 my mouth is huge thanks Apparently I'm \"embarrassing to be around\" and \"need to stop\" and \"why are you making me take a picture of this\" psh #art https://t.co/B3wYY6c5vR HOO BOY FLIGHT DELAYED GET READY FOR RANDO AIRPORT PHOTOS @markibach Next year is going to be the year of ROAD TRIPS @SeptiplierAKFM5 probably, I want to backpack across Europe someday"}