{"tweets": "RT @earwolf: This week, @jennafischer &amp; @AngelaKinsey get 'In Bed with @Nick_Offerman and @MeganMullally' to talk about late-night talk sho… RT @JPosnanski: The PosCast Holiday Draft is coming! And I think it's fair to say it's the dumbest one we've ever done. @KenTremendous @lin… RT @aparnapkin: the most unrealistic part of Murder She Wrote is when Jessica Fletcher is happily &amp; contentedly typing her next book in the… RT @Doug_Exeter: dumped my true love after the fourth day of receiving an overwhelming number of birds, not recognizing the surfeit of gold… @spencertweedy 😎 San Diego - Saturday Night’s all right \n\n...for fighting...boredom. Come and marvel at my #beefy trunk in jeans!\n#Mirth guaranteed ❤️🇺🇸 https://t.co/2DYwjoSbKx RT @MatttDavies: He knows. https://t.co/dVoM9aLh0b https://t.co/JImq0zkdZk Dear Mr. @Goodyk -oontz,\n\nThank you for this gentle treatment. I look forward to earning the laughter of @Dbacks fans with a belly full of the pizza stylings of Mr. Bianco.\n\nUntil then I remain,\n\nSincerely yours,\n\nNick https://t.co/03eyML7UiU RT @herdyshepherd1: https://t.co/C3ZedxC1OU https://t.co/SZ0yEmiYqr RT @NBCMakingIt: Get to know Amy and @nick_offerman a little better while you wait for the 2 hour #MakingIt finale starting TONIGHT 9/8c on… Tonight is the Season 2 Finale of ⁦@NBCMakingIt⁩ - you ain’t seen a shed hacked til you see these sheds hacked! Heck! https://t.co/t6yqgI7uF1 RT @offerman_shop: The OWS Holiday Card is here! Chubby cherubs on a slice of cherry bring joy and mirth! https://t.co/G0xQwKWFnb https://t… RT @drvox: 6. It is good &amp; noble to help the vulnerable; it is bad &amp; selfish to allow the interests of concentrated wealth &amp; power to perma… RT @neal_katyal: This is must see. @RepSwalwell darn you are one good lawyer. https://t.co/K1WaxFsnIP RT @gabedelahaye: Good price on LARGE CHUBS today. https://t.co/jQJqHzgb8o Shitballs, boss, you’re on fire! 🔥 🤣 https://t.co/LVwJfP65SE RETTA GETS IN BED WITH US ❤️\n#midriff @robdelaney \n\n@unfoRETTAble @MeganMullally https://t.co/Pk7lUDBqWe RT @yokoono: Reading books is such an important, interesting, exciting and fun thing to do. Keep on reading anything you can get your hands… RT @WendyMolyneux: I know it might be unkind but here is my list of the worst shows of 2019. I’m sure you’ll agree:\n\n7. Here We Go Back To… What a beautiful song and video, somewhat sullied by this donkey https://t.co/QAITCi6aQb @herdyshepherd1 I have enjoyed my time in the book club but not sure I can keep it up if this bickering persists - ¡Adios! RT @kibblesmith: Last Christmas\nI gave him my heart\nThe very next day\nCthulhu awakes Fort Myers I am bringing some mirth to your Barbara B. Mann Jazz Barn this evening. \nJoin me if you like, or don’t. It is a free country for the moment. 🇺🇸 \n https://t.co/j8ObQjmfi5 via @thenewspress @gabedelahaye Word RT @sarahkendzior: That Kamala, Beto, and Inslee dropped out early while Bloomberg paid his way into an indefinite stay is disgusting. What… RT @herdyshepherd1: Soil\nSoil\nSoil\nSoil\nSoil\nSoil\nSoil\nSoil\nSoil\n\nWatch “Soil Solutions to Climate Problems - Narrated by Michael Pollan” o… Folks, I guess @NBCMakingIt was so good last night they’re showing another one tonight. #FeltThat https://t.co/1SzLcRo0hv RT @offerman_shop: This Giving Tuesday support the good work @WouldWorks1 https://t.co/lpswOtTV8r https://t.co/n5IqlCaelg @herdyshepherd1 Steady on. @herdyshepherd1 Welcome. RT @earwolf: It’s time for the FIRST episode of our newest podcast, In Bed with Nick and Megan!! @Nick_Offerman and @MeganMullally welcome… RT @rebeccapropes: Look at this logo art I made for \n@KellyClarksonTV \nTune in tomorrow to see @Nick_Offerman on her show talking about @NB… RT @KellyClarksonTV: Going \"under covers\" with @NBCMakingIt's @Nick_Offerman today on the #KellyClarksonShow 🤣 https://t.co/VzdyH03k3n RT @brainpicker: “What I regret most in my life are failures of kindness.”\n\nOn George Saunders's birthday, his wonderful commencement addre… RIP Shelley ❤️ https://t.co/zfVncW9Fib RT @SarahKSilverman: THREAD⬇️ https://t.co/lMF6JLG3ft Knitting #mirth Monday with a handsome new friend https://t.co/r7okV0m9vP https://t.co/ahFfW3Ixok @khelgen @JPosnanski Lazy Carpenter works the hardest. RT @blainecapatch: doctor: i've got good news and bad news\nme: lay it on me\ndoctor: well, taint cancer\nme: oh thank god! what's the bad new… @phonia337 Oof! Sorry to hear of your knee woes, and I hope you are sashaying jars of lemonade to your loved ones again right quick. ❤️ Initiates, please join us...IN BED https://t.co/ca2dYWAjbp @wildflowerhan 👍🏼 @wildflowerhan 🧐 RT @SarahKSilverman: Mr. Rogers was the bravest. This man, he isn’t able to see. He lives his life and makes his choices based on his fear.… @JPosnanski Hot blueberries or hot cherries? @theshepherdswi1 A masterpiece 😍 “People must be allowed to like what they like” - @hodgman https://t.co/tuVQwKnC0A Thank you for this intelligent rendering ✊🏼 https://t.co/rRZkz2vb8l RT @AndyRichter: What a thread! https://t.co/wwkSOBaVbO @latimes Guess again @The_CuddleCult thank you for these unnerving golems @aimdogg respect RT @herdyshepherd1: https://t.co/Ss7aG8j2si RT @NBCMakingIt: It’s time for the epic craft battle of the century.  \n\n#MakingIt begins Dec 2 on @nbc. https://t.co/PJ8aKTWAmK I think this guy is good and cool https://t.co/NVCFnSLObo @StephenAtHome Oh 😍 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/N51KNjdod4 I concur with Tim’s seconding of Sarah’s approbation of Sacha.\nThis speech is fantastic. ❤️ https://t.co/j3RLLMdbNF @RobotMakerGirl Hello there. Check this out:\nhttps://t.co/E1QDMoMzQE RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/FChVzKcBBV @sempercuriosuss 🙏🏼thank you ❤️ @krob1086 Thank you kindly. Us dipshits gotta stick together. ✊🏼🌽 We continue to think we can “technology” our way out of the trouble we’re in with Mom Nature and we continue to fail https://t.co/dE75yccE2l PIZZAZZ!!! https://t.co/1TqXNDpbtl RT @DenverFilm: Best of #DFF42: FRANCES FERGUSON, narrated by the one and only @Nick_Offerman, is out now on demand! \n\nCheck it out: https:… DETROIT ROCK CITY\nJoin me tomorrow night at @FillmoreDetroit where I am guaranteed to spray you gently with PIZZAZZ ☔️ \n7:30pm Thursday don’t be late 🍳 https://t.co/N1InS61jmP RT @Rschooley: Walter Reed standing by for phase two of the physical. @JPosnanski @offerman_shop gets it. @JPosnanski @KenTremendous https://t.co/gilSd5Dy7D Folks have a look at this gorgeous work by @twobirdsfilm - listen to Wendell Berry talk the right way https://t.co/gr69rylDrk COLUMBUS OHIO LET US INDULGE IN MIRTH at the PALACE \nFriday night: https://t.co/tISZjysxnV for tickets ✊🏼 https://t.co/QZMCk2MtQ4 Kalamazoo I am loading up on eggs and California sunshine to bring to your @kazoostate theatre tomorrow night 🍳 \nTickets remain for the 9:30 show, which will feature extra ribaldry 🕺🏻\n\nTix: https://t.co/tISZjysxnV https://t.co/yWUvXTU9eB @lisarocksSEM @calm My pleasure! Well this is the best piece about now and truth - thank you @drvox \nhttps://t.co/KPfhcShw3l Just donated but if I win can we just sit quietly and enjoy a creme egg https://t.co/RtofVi3gC6 RT @NBCMakingIt: We love a good acronym! \n\n#MakingIt is back Dec 2 on @NBC. https://t.co/tO4jJWSxJ1 RT @ColleenDoran: Pushing 30,000 followers here: when I get there, I'll pick 1 follower (can be ANYONE) to win a signed graphic novel and o… RT @herdyshepherd1: Just watched #TheBiggestLittleFarm on a preview thingy \n\nReally good thought-provoking film that made us all cry and ha… RT @JimmyDiResta: Just tinker. Always the spark of good ideas and sessions. https://t.co/q1pp6T984N RT @vulture: Women are taking over Fox’s Sunday night cartoons. Here's a roundtable discussion with the women behind the network's new anim… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/tbCIcSkox8 Here is a tasty chew 🍏 https://t.co/z4mJHOBpfb @Edd8bits https://t.co/L5t37Wie9J RT @travishelwig: As much as I think this is going well for Democrats, I have to remind myself the man who sobbed and screamed “I LIKE BEER… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/zBkk12ZuuF Now, listen. @MeganMullally &amp; are way out in front of the slavering pack with a new talking-delivery system called a podcast on @earwolf\nFirst ep: Dec. 2nd! \nSubscribe to In Bed with Nick and Megan to hear the trailer now if you fancy\nhttps://t.co/oQXKSqQVHN https://t.co/bLWhj3dQqe RT @NaturelsLit: She didn’t moved, because she was the Mother ❤️ https://t.co/7E86E8j6lU @MeganMullally HAPPY BIRTHDAY TO THE LOVE OF MY LIFE, OL’ SUGAR-BUSH ❤️❤️❤️❤️❤️❤️❤️❤️ https://t.co/1B9NrO9xHS @herdyshepherd1 Damn gurl @herdyshepherd1 Absolute UNIT @MarkAgee Is this Jr’s audio book Folks I will be bringing my japes to @fallsviewcasino on Feb. 29 - a day that I only seem to recall about a quarter of the time 🤔\nhttps://t.co/IusFDNqxko https://t.co/X4cRf7AMaA RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/fdi9FWXkwl @dgoold @valeriehahn @JPosnanski https://t.co/9RnRogKOdr What Ho! Please bring Gold Glove 2nd baseman Kolten Wong to the ⁦@StifelTheatre⁩ tonight at 7:30 for an Offerman-style game of Pepper!!\n(Eating ⁦@PappySmokehouse⁩ ribs wearing batting gloves) https://t.co/Bt8fv3CSs2 WTF Tony take this down my mom is on this site https://t.co/w1X5fSzMZd St. Louis tonight let us giggle and jape as I sing to you of beer and cologne 🕺🏻🍁🇺🇸 https://t.co/Rjxu3GhQkB Thank you for your gentle treatment.\nSEE YOU TOMORROW NIGHT, LOUISVILLE 🕺🏻 https://t.co/7TntGpiFG8 @herdyshepherd1 Hello hardy gals! RT @aparnapkin: just once i want to see someone open their fridge in the middle of the night and in it is someone opening *their* fridge on… @jigandreelpub That is an impressive array of delicious OH HELL YEAH NICE https://t.co/NQbU5Wwdrh RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/FdRoAtiz3O RT @neal_katyal: Thread https://t.co/W35oipwhoI @herdyshepherd1 same St. Louis come check me out as we all attempt to fix our wagons with chortles and truth ✊🏼🇺🇸 https://t.co/Rjxu3GhQkB @sourdoughbrad @themetphilly i’m sure it’s nothing bad i lernt it from my bro the honorbl Brent Kavanaugh @herdyshepherd1 @UllswaterCic @EdenRiversTrust @EnvAgency hello, ladies 🥰 PHILLY joined me at @themetphilly for a chuckle feast - I am full of Cheesesteak and ready to BOOF 🇺🇸 https://t.co/GuX2YJydgh Folks, I have now looked at too many twitters. I am deeply grateful to all of the stalwart portrayals of Ron Swanson that have appeared on this my rectangle. I’m sure I missed many, but know that your efforts have also added to the poultice upon this hirsute artist’s heart ❤️ Brian you do me great honor. https://t.co/pdlKB3jl0Q RT @SarrChristie: Noticed @Nick_Offerman was retweeting Ron Swanson costumes. So I'm just going to leave this here and tell myself in my he… RT @c_marie_soard: @Nick_Offerman you’re my hero. Please enjoy this picture of me as Ron U. Swanson and his true loves, bacon &amp; eggs. https… RT @A_Matt23: I’ve never felt more like myself @Nick_Offerman #breakfastfood #givemealltheeggsandbacon https://t.co/1h8rRsL1Jp RT @m_hayes11: “I live the way I live. I eat the things I eat. And I’ll die the way I’ll die”\n\nRon Swanson loves Halloween...but not banana… RT @Hungry_Haley: Successful Halloween I'd say. \"Lagavulin neat, please and thank you\" @Nick_Offerman https://t.co/pWEqHAdLo1 RT @877cashn0w: Hey @Nick_Offerman I never knew how good I could look in a mustache until I dressed like Ron. Thanks https://t.co/rDb7rAVl81 RT @PatrickHayes376: ⁦@Nick_Offerman⁩ I saw this trending this morning and had to share one more of my son this year. https://t.co/4z4yi868… RT @WhosEmmaStone: tbt to my favorite group costume of all time. \n\n(plot twist we dress Floyd as a pirate every year because that’s his Hal… RT @KyleDaters: My daughters a week old. She’s quite familiar with the sound of Power Tools. @Nick_Offerman @parksandrecnbc #RonSwanson htt… RT @Black_Rock_Dave: @Nick_Offerman I'm Ron Swanson now https://t.co/GlQz4kXDkG RT @anthonydias: @Nick_Offerman my friend and her husband dressed up as Rob and Tammi 😂 https://t.co/COtJBaQwWo RT @paxtonjordan: Celebrating Halloween and @Nick_Offerman the proper way. https://t.co/ToXWz8bL7C @creamofwool @MJMcKean @audible_com jeez, thank you kindly! what a privilege to get to assay, or at least a-say, that material ❤️ RT @darkblue909: Special thanks to Edward at our local @Lowes for graciously obliging the weirdest customer request of the night! 📷 We defi… RT @abbybischoff: Last year he was Ron Swanson. This year he was Dwight Schrute. @KenTremendous has had a big impact on my nephew’s Hallowe… RT @TheChiropractor: Noticed something very interesting while watching @parksandrecnbc. It appears Ron Swanson has a women’s golf statue/tr… RT @ashbo_27: @Nick_Offerman please rate my husband’s costume https://t.co/iHowSgNCJL RT @EPJordhamo: @Nick_Offerman That how Ron holds his hernia in. RT @__fionaanne: @Nick_Offerman made this in honor of you a while ago! https://t.co/HrGAuxxAVY RT @JustinTigner: @Nick_Offerman why not dress like the greatest character of all time!?!?! https://t.co/V4KSzfB3pP RT @Timmy_2_times: @Nick_Offerman my wife (@StacyMiller4 ) and I tried our best this year. Should've sealed the deal with a lb of bacon and… RT @GrimbyBECK: I know it’s not a costume, but @Nick_Offerman is checking out #ronswanson costumes and I hope he sees this. In the middle o… RT @JustinTGann: Tried to pay homage to my favorite stick-it-to-the-man man, breakfast food loving, black coffee drinking Pawneean. ...espe… RT @MeganALC: Living that Ron-Swan life @Nick_Offerman https://t.co/gJhFFEtAQv love that everybody sticks hand in waistband ✊🏼 https://t.co/sgJNQGqqi0 i know this guy! i am flattered!\n(button up that button) https://t.co/qtRMBsAcA5 RT @HolliGolddd: “I’m a simple man. I like pretty dark-haired women and breakfast food.” -Ron Swanson \n\nWhat about breakfast food with dark… RT @MacMacAnally: Ron in his own personal hell, a government-funded LIBRARY! @Nick_Offerman https://t.co/aduqXmGDyP RT @moth_bby: this is just a ron swanson costume what is the issue ! https://t.co/y9scU1bmEa RT @HazMatt1260: We’ve been telling my bro-in-law he needed to be @Nick_Offerman’s Ron Swanson from @parksandrecnbc for years. Finally they… RT @TavaresChantal: “So you talked to Tammy. What’s it like to stare into the eye of Satan’s buttonhole?” @Nick_Offerman @MeganMullally htt… RT @parksandrep: transported to pawnee for the night \n#FirstInFriendship :) @parksandrecnbc #parksandrec https://t.co/EPQdqU7C5v great mug, needs a t-shirt https://t.co/pqd8QQz66X RT @Pure_Singletary: I'm a simple man. I like pretty, dark-haired women and breakfast food. @dezisingletary @Nick_Offerman https://t.co/ddl… RT @lizzie_darden: Don’t mind meeee just posting this again bc I saw @Nick_Offerman was retweeting costumes lol. 👋🏻 Ron Swan-Son of Satan a… RT @clairetats: @Nick_Offerman ron &amp; april! ron even brought a steak ... https://t.co/1j7Lex9STa RT @nick_merritt: I got to be Ron Swanson in our group Halloween costume.  Even our remote members got added. \n@Nick_Offerman https://t.co/… RT @TL_Strickland: Hey, @Nick_Offerman , how did I do? Always be prepared. https://t.co/YcULzgQeUj RT @Chefgeorgiebean: Ron Swanson and Burt Macklin FBI @Nick_Offerman  (his idea) https://t.co/HWKM1iJqG7 RT @anarkE7: I would post a photo of my Ron Swanson costume, @Nick_Offerman, but I've already said too much. RT @Scottscups: One of my prouder moments @Nick_Offerman https://t.co/q6IFT2Rfgx RT @CocoCorynne: Tbt to that time when I was Ron Swanson for Halloween. Now I’m married to those bacon and eggs ❤️🥓🍳\n\n@Nick_Offerman https:… RT @meganamram: yeah, sure, i like sorkin. sorkin my own dick RT @john_kuells: @Nick_Offerman thoughts on your doppelgänger? https://t.co/KVmD29cWdY RT @mattyagyagan: “Never half-ass two things. Whole-ass one thing.” -@Nick_Offerman https://t.co/tprMyOIjWY RT @ImpactWoodwork: I’m Ron Swanson for Halloween! More pictures to come 🥃 @Nick_Offerman @parksandrecnbc https://t.co/wudsoh5Qnd RT @unavowed27: I can’t grow a mustache @Nick_Offerman https://t.co/QckXf0aR4q RT @The1stRG3: @Nick_Offerman Several years ago but still one of my favorites. https://t.co/AjVeQVrMkt Excellent and well-reasoned 🔥 from @Dahlialithwick on the shameful state of the @Scotus \n\nhttps://t.co/y9icjJ0VHn RT @NiceBoyToto: @Nick_Offerman I regret nothing. The end. https://t.co/lMFZvlxTWb RT @sophmenzies: @Nick_Offerman his tash is real https://t.co/6hbItuEHkd RT @jonesyandrew: @Nick_Offerman \"Never half-ass two things. Whole-ass one thing.\" https://t.co/0rgGLFj1xI RT @JLightner18: @Nick_Offerman The candy and puppies my fiance brought were quite the hit at the Halloween Party... My beans, singular box… i appreciate the support, but Ron Swanson would stay the hell away from New York City - instead,\nCOME SEE ME AT THE BEACON \nSunday night. It will be adequate. https://t.co/cXmZER0FZY RT @MalloryPark: All these pictures of people dressing up as @Nick_Offerman for Halloween  are ~fine~, but Jared was the best Ron out there… RT @Itsunclemark: @Nick_Offerman I was Ron a couple years back...still believe I have the lagavulin in the cabinet. https://t.co/mNH0qqSb47 RT @shanecass79: @Nick_Offerman Jesse says hi. You can’t tell but that’s a smile https://t.co/eWRDOhAEeq RT @misskerriann: “I’m a simple man. I like pretty, dark-haired women and breakfast food.”\n#tbt to when I was Ron Swanson (@Nick_Offerman)… Philadelphia!\nI will take @themetphilly stage saturday night and proceed to wiggle and jape until you are satisfied with chucklings ✊🏼🕺🏻🇺🇸\n\nA *FEW* tickets remain - I will speak of LIBERTY, which i believe to be a local favorite? \n\nticket info: https://t.co/tISZjysxnV DC Washingtonians congrats on sports!\nTomorrow night at the KENNEDY CENTER I’ll soothe your raging hangovers with my warbling, including my paean to B Kavanaugh, “I Like Beer” 🍺 🍺 🍺 \n*a few* tickets remain for 7pm &amp; 9:30 ❤️🇺🇸🕺🏻\n@kencen ticket info:\nhttps://t.co/tISZjysxnV RT @TyGilliam: @Nick_Offerman Happy Halloween from Ron and Li’l Sebastian https://t.co/s0iAyN7Pb7 RT @Nicoli_Gamer: @Nick_Offerman I hope I have honoured you well sir! https://t.co/PBkebp17p7 RT @mrsnightskyre: My husband wants to be #RonSwanson when he grows up. How'd he do, @parksandrecnbc? (@Nick_Offerman, he's a big fan!) #ha… RT @sjwatson19: @Nick_Offerman excuse the store bought moustache but here’s my effort from last year! https://t.co/pReA1qhPeo RT @Scotcho10: This is how you do Halloween @Nick_Offerman https://t.co/ZNdP36TWEQ @creamofwool @MJMcKean thank you for this beautiful notion ❤️ RT @andrewmriley: Delete all pictures of Ron! @Nick_Offerman https://t.co/ReKo9QZsQW RT @WhatTheCJ: @Nick_Offerman my coworker today. Couldn’t be more identical 😂😂 https://t.co/SUS25ZJjjO RT @Tru_Mick: @Nick_Offerman my friend Bob doesn’t have twitter but he did a really tremendous disapproving Ron Swanson https://t.co/ibeTL2… RT @kshuker24: I was Ron Swanson in 2016, then Duke Silver in 2017. I haven't dressed up for Halloween since because I'll never top this. @… @AndyCommandy gain some weight NSFW https://t.co/Ji4pC6aVpb RT @iAmBrooksie: Best thing on my Facebook feed this Halloween. @parksandrecnbc @Nick_Offerman https://t.co/IxYvdJ0Vxp RT @NEGATIV_SPC: In my stream last night, I said I would be disappointed if my coworker who looks like @Nick_Offerman didn't dress up like… RT @TheIntenseEagle: Facial Hair: Full, thick, and square. If you have to sculpt it, that probably means you can’t grow it. @Nick_Offerman… RT @SwiftieLOdown: @rejectedjokes &amp; @Nick_Offerman did they do it justice for our office costume?? ❤️❤️❤️ @parksandrecnbc https://t.co/IyFK… RT @hdurant: Your house is not haunted, you’re just lonely. Happy Halloween from Ron Swanson @Nick_Offerman @parksandrecnbc https://t.co/qF… deep work and true https://t.co/dVStcoyQSh RT @BaileyFink: This is my 12 month old son Sebastian, this Halloween he is dressed as his namesake, lil Sebastian from @parksandrecnbc tho… RT @pants: https://t.co/R1voR02tfe RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/Ud5bWI2Cff New York I assume you’re all running the ‘thon Sunday - I have asked the race tribunal to move the finish line to Central Park and set up some hot sausage carts and park benches so you can finish your jog, have a snack, then head to @BeaconTheatre for a nice chuckle buffet 🏃🏻‍♀️ 👍🏼 https://t.co/ahRDnwXZvf EXTREMELY flattered to be chosen as one of the #HotOnes on this exploitative program - not sure how they roll but *am willing to disrobe*\n🔥🕺🏻🔥 https://t.co/cPTEIEb3hZ RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/pCT9SJVRBX James, your editor treated me most generously. For that, as well as your ready companionship, I thank you kindly. 🍻 🥃 https://t.co/e7Hh1bI33o RT @rejectedjokes: YOUR SON IS AN ABSOLUTE LEGEND. https://t.co/SVM2EMVfG5 See @Teri_Kanefield calmly destroy @GOPLeader ‘s disingenuous histrionics using Jedi techniques like “reading the material” and “knowing and referencing the law” 🇺🇸 https://t.co/L4kXXJWv4V This is a rare evening!\n❤️ https://t.co/iouWfr2M8K RT @twobirdsfilm: Long-time no see! :-) We have a few big updates.  First: With our Netflix term over, people asking how to see LOOK &amp; SEE:… RT @tcolerachel: 💥I spoke with the very funny and very kind @Nick_Offerman for @thecreativeindp. We talked about exploring whatever opportu… OH THESE BEAUTIES https://t.co/c6aDg4shJ1 RT @samiwert: my nephew’s halloween costume this year is ron swanson when he went to the diner in indianapolis and it’s very important to m… RT @theshepherdswi1: https://t.co/kxadOPLWzQ @Propupthemythos i am grateful, and i will do my best @KolleenCarney acknowledged @KansasBand Let there be peace when we are done ✌🏼 @KansasBand YOU DO ME GREAT HONOR, @KANSAS 🙏🏼 RT @robdelaney: maybe use a mirror or have a friend take it? just as long as your armpit hair &amp; soles of your feet are visible. then I’ll v… #ad I can only take so much credit for my new @LagavulinWhisky Offerman Edition Aged 11 Years. And by “so much”, I mean all of the credit. #Audacity #Mirth\n\nhttps://t.co/pQYhfGXWfA #ad If patience is a virtue, my own @LagavulinWhisky Offerman Edition Aged 11 Years might be the most virtuous whisky around. Just sayin. #oak \n\nhttps://t.co/AxVhzs6QZN #ad Some might say I’m overprotective of @LagavulinWhisky’s peat, but my Lagavulin Offerman Edition Aged 11 Years couldn’t exist without it… https://t.co/flWSy12ccT @leighbrewer @parksandrecnbc Stentorian! Let’s get our shit together folks https://t.co/kRuSimDu5H BOSTON i look forward to making you chortle in the next 2 nights.\n\nTicket info: https://t.co/tISZjysxnV https://t.co/qSbvWJwcwr #ad I feel this new creation has been in the making with @LagavulinWhisky for billions of years…perhaps since the dawn of time. The next iteration of My Tales Of Whisky is here, along with a most edifying nectar - Lagavulin Offerman Edition Aged 11 Years\n\nhttps://t.co/LKuc9oGHXT i remain severely chagrined that this Network is not legitimately concerned with beef and dairy farmers 😡 https://t.co/IslyBazKL7 LOS ANGELES - BOOK JAM - TONIGHT - TOTAL WORD PARTY https://t.co/cOgA3ZS1uB @jormataccone dankeschön Albany - ticket alert! https://t.co/t5d1YlbLbd @herdyshepherd1 5.! @herdyshepherd1 😍 @MJMcKean @TheStevenWeber 😋*snickers* RT @JPosnanski: I will be with the incomparable @Nick_Offerman Monday evening at the Last Bookstore in LA to talk about “The Life and After… @hodgman some folks hang the toilet paper backwards on the spool.\ni yearn to smite their ignorant souls but i heed the golden rule Tom Pearcy is living right https://t.co/AsIyBmuya9 There are a few seats remaining tonight @LargoLosAngeles 8pm/7pm doors, where you will be treated to 7 new songs and 2 old ones.\nPLUS TALKING.\nPeople really seem to be “bopping” along with my paean to Brett Kavanaugh:  🎶 I LIKE BEER 🎶 \nCome on down!\n\nhttps://t.co/xXRM6igvl0 RT @chelseaperetti: people are small minded! but luckily u dont have to be!!!!!!!! have a fantastic day babe RT @daemonic3: [guy who's about to invent croutons]\n\n*eating salad* i wish this hurt Just thought of a new aspiration:\nTime is not money. Here is a tome with LITTLE TO NO photographs, despite the deceptively intoxicating, candy-like cover art. Gaslighting much?\nAh, me, I suppose I must be satisfied with the pithy, hilarious visions that @hodgman always supplies, &amp; yes, the occasional squeezins on m’tear-bags. 😢❤️ https://t.co/XinePeIj09 Folks here is a delightful read from @JPosnanski that has a scattering of some really cool photographs as well. Joe and I will chat about this and I’ll show him how to make an audience’s desire DISAPPEAR at the @lastbookstorela Monday 10/21\n\nTHIS BOOK IS AVAILABLE TO YOU https://t.co/QBfr7bJKIX RT @JPosnanski: And then, Oct. 21, comes the official launch in Los Angeles at The Last Bookstore, where I will be joined by, oh, I don't k… RT @LargoLosAngeles: #NickOfferman is Live at Largo this Thursday with #AllRise and a few seats remain for the 8pm show! @Nick_Offerman\nhtt… Folks of Los Angeles\nAs you can glean from this pictograph, things are going pretty swell over here at table 14.\nPlease join me Thursday night 10/17 8pm at @LargoLosAngeles for my comedy program #AllRise so that I might share this affection with you.\n❤️\n\nhttps://t.co/oxR5tsnzWl https://t.co/N0yvvnFAuc @mickmillsap There is no getting around it, as I own a mirror. Breaking: Lucky Bastard continues with unfathomable streak of good fortune https://t.co/FO9fISJW55 I love to play the Beacon on 11/3.\nExceedingly. 🕺🏻 https://t.co/oT9tB52wF8 @jormataccone Jorm if you just stop and think about it, there’s *no way* I could be playing “my music” in Berlin, let alone supporting a second, secret family there. That would be crazy and LOL time guy! Fantastic. 🌳 https://t.co/jZSDKOq3gV RT @herdyshepherd1: So the rancher in the film shared yesterday is on Twitter and I suggest we follow her and surprise her with all the new… @TheRarmy_ are u a giant Ticket info at https://t.co/TgikLc3UPX\n@offerman_shop THANE OF GROANS\nI will bring the #AllRise royal treatment to:\nPaso Robles (Saturday) tonight!\nAnaheim (Sunday) tomorrow night!\n@LargoLosAngeles 10/17 thursday!\nJoin me for mirth and transparency 🇺🇸\n📸: @JPosnanski @nlbmprez https://t.co/Dur7eeqXc6 Hear, hear! https://t.co/vIYFJfcePb RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/osPqSfDR83 Same https://t.co/Q0TsOnEr3z Here are 6 things i like https://t.co/GTj1cVkGmh Thank you for this generous rendering #AllRise https://t.co/vgfK5rVNmT #AllRise fans - many of you, well, several of you, ok, four of you have asked where to claim the poster for my tour, drawn by the rightfully lauded @MatttDavies\n\nTHE ANSWER IS https://t.co/TgikLc3UPX , they are signed by him &amp; me and all profits go to @ACLU 🇺🇸\n@offerman_shop https://t.co/jIxZoFhvyT The Peacock be all about the Crafte, nay matter what the medium be. 🌳 #NBCcomedystartshere https://t.co/Q26LWum6b9 RT @JPosnanski: LA Folks: Can you believe it, me and @Nick_Offerman together talking Houdini and how he's not really Ron Swanson and whatev… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/txSeRTlcaV RT @amywestervelt: Celebrities, decide: you either do or don't want people to take your public behavior and opinions seriously. The idea th… @herdyshepherd1 🏋🏽 RT @kathyzyskowski: #InternationalLesbianDay #RiseUpOct8 @JohnFugelsang https://t.co/rJoQ9kIGXR The #PowerfulWomen of @ftlonesome made me this 🐿 blouse to package my #Gaiety for all of you to savour.\n\n10/10 @ Masonic, SanFran\n10/11 @ Mountain Winery, Saratoga \n10/12 @ Vina Robles Amphitheatre, Paso Robles\n10/13 @ City National Grove, Anaheim\nTickets https://t.co/tISZjysxnV https://t.co/s6qoDxLrAS RT @sleezsisters: Rob Delaney’s series of “accidental diarrhea DM tweets” is my favorite sub genre of Tweet ever on this site https://t.co/… California, this weekend I aim to ramble down your length like a beefy pinball. JOIN ME #AllRise\n\n10/10 The Masonic SanFrandles\n10/11 The Mountain Winery, Saratoga \n10/12 Vina Robles Amphitheatre Paso Robles\n10/13 City National Grove Anaheim \n\nticket intel https://t.co/b97PsSGFvH @JasonIsbell Super good tweet, Jason. ST. LOUIS LET US DANCE &amp; GIGGLE 11/7 🕺🏻 https://t.co/7kW5daL09W @angelcitylumber https://t.co/YUEobjseW9 Folks, the astonishing squirrel blouse that I wear in my #AllRise show was custom made by the powerful women of @ftlonesome - they are prevalent on Insta ✊🏼 🐿 \n\nhttps://t.co/qQVFPf96xE https://t.co/kiBJ3Hm1Fi RT @BeaconTheatre: .@Nick_Offerman takes the Beacon stage in ☝️ month! Tickets available at: https://t.co/Q2Ehx54j85 (📸: Rick Kern/Getty Im… Just looked up flaccid in the dic: https://t.co/CX3tN0jfo2 https://t.co/EYAhcj0C3H @MrJCLynch Let’s keep it clean on this flaming hell-site, please and thank you. DETROIT. 12 minutes might be a bit much, so let me encapsulate this for you: I recommend sex, single malt Scotch, and sheep. BUT DON’T TAKE MY WORD FOR IT 🐑 https://t.co/KoASsVZpgt @JooBilly @drvox That’s the one I was looking for, thank you. This is bananas. RT @herdyshepherd1: Brilliant thread about animal manure and why it matters... everywhere https://t.co/u0YbQXJnyy RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/mMMX0vzYV2 Folks I am astonished that @gaslitnation is not the most popular news site on the www \n@sarahkendzior &amp; @AndreaChalupa have called this shitshow play by nefarious play from the get - they talk straight and not without passion\n🇺🇸 https://t.co/dzRc3FSmtZ RT @AldoLeopoldNC: Fan of @Nick_Offerman and Aldo Leopold? We are too!\n\nBid on this treasure from our favorite comedian in our Pipers in th… @neilhimself I suppose The Horror at Gaimansmouth might scan a little better even 😕 @neilhimself The Horror at Neilsmouth? RT @Dempster46: Thank you Joe!  For being as real as they get!  You will be loved here forever and deserve every last bit of that love!  Th… No matter what night you launder your undershorts, @kenanthompson , Tide is an adequate laundry soap for just that purpose #ad https://t.co/6WORBOC0lx Wise advice below, and I would add \n5) shut off your phone and leave it on the sidewalk ✊🏼🤸🏽‍♀️ https://t.co/EnjtG3MtiP @herdyshepherd1 @billplumtree Same RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/5QRLNvRElM MY PLEASURE, LADS.\nI got the Devil’s Biscuits tip from none other than legendary American woodworker Roy Underhill #TheWoodwrightsShop 🇺🇸 https://t.co/Ido6sJURbB Folks the Negro Leagues Baseball Museum in Kansas City is deeply magnificent and masterfully displayed. I will need to return at least twice to take in all of the artifacts and stories. Amazing! 👍🏼👍🏽⚾️👍🏾👍🏿 https://t.co/vVIOeyaHHn @UllswaterCic 😍 @drvox Their cover-up is indeed substantial. Are you familiar with what they’re trying to balance though? \nhttps://t.co/2xSbcLXuLj @NickLaparra @TheAlanNoble I co-produced, and built a 3-legged stool for, an excellent documentary by @twobirdsfilm called Look &amp; See, available on @netflix , a channel. 🌳 @herdyshepherd1 😑 @herdyshepherd1 Don’t forget you also have *very* attractive friends. It’s important to know one’s place in the pecking order. 🌈 \n#NBCComedyStartsHere https://t.co/Tbs1OhPd7d RT @ScottVargo: @Nick_Offerman Uggg I’m so mad I can’t go anymore. My wife got the tickets for me for my birthday. Why couldn’t my brother-… KANSAS CITY\nJoin me Friday night as I lurch about the stage, over-filled with ribs &amp; brisket. 🐷 🐮 🕺🏻 https://t.co/5RyYUBRIFa @spencertweedy This makes us Nickel friends! Goddamn this is sadly so good @MatttDavies https://t.co/NVRorjDyIm https://t.co/MzmgWfnk9r Folks of the Wendell Berry @Berry_Center mindset (you care about what you eat and the people that provide it and the soil that grows it), I have seen this farm and heard this mad Shepherd’s fecund idea, and I intend to heed this opportunity.\nJoin us: https://t.co/aaEl5a1qNr Hats off, Steph, and healthy sailing!\n⛵️ 🌈🙏🏼\n\nhttps://t.co/Drig22BXtb via @houstonchron @herdyshepherd1 Hello. RT @murderwizard: Got into a fistfight today https://t.co/VvcCNou31z Oklahoma City. We will chuckle and spit and mourn the passing of The Charcoal Oven 🍔 https://t.co/h41iLAZDfi RT @MatttDavies: Um. https://t.co/dVoM9aLh0b https://t.co/1XVyRrmZnM @12frames Wow. @herdyshepherd1 I’ve seen worse workplaces RT @BurstynEllen: Excited that @ShoutFactory has picked up ‘House of Tomorrow’ for an April 2018 release! @Nick_Offerman @asabutter @natand… @lazermoose And you, sir. Any chat redolent of Corn Bread is one that has my full affection. 🌽 🍞 @Dempster46 @OffTheMound @RedSox @ParamountCenter @45PedroMartinez @TheMikeOMalley I would attend this jamboree if I could, and not just to look at your forearms. ⚾️ 💣 @trumpetcake And it works. 🤸🏽‍♀️ I aim to attend this and talk with this smart and charming writer. #BookStuff https://t.co/qMlwtbXd3q @JessieABarbour @dvonkampen @JPosnanski @KenTremendous Forfend! @dvonkampen @JPosnanski @KenTremendous 🙏🏼 🎶⚾️😍 I suspect a great many fans could sing these delightful ditties from memory, and most of them with nicer voices, but as the fan in the room, I was glad to serve. https://t.co/dUa5R5i9qI @meltraver That’s mighty easy on my eyeballs. I am ignorant to sites except of course @Etsy Dear God this unit can only be described as *ABSOLUTE* https://t.co/H1xI9pkXNY RT @KenTremendous: Side note: “New Sexual Assault Uncovered While Investigating Supreme Court Justice Already Accused of Sexual Assault” mi… RT @JPosnanski: The first of two exceedingly long and nonsensical PosCasts with @KenTremendous and @Nick_Offerman LIVE* from Wrigley Field… IOWANS, I approach. #AllRise\n@offerman_shop https://t.co/fXw2Q4Cvnw #Wisconsin\n⁦@AldoLeopoldNC⁩ \n😍🍃🐝 🌸 https://t.co/2eWAwZ6pZE Chicago let’s all get together Sunday night where I will dance and caper about for thine pleasuring. 🕺🏻🍳 https://t.co/Y4ZIwGP4Jc Chicago let us share a Sunday giggle in the comfort of @ChicagoTheatre https://t.co/pLLl822Q1n @yashar @IvankaTrump Not a compass. When it only points straight down, that’s called a plumb bob. RT @herdyshepherd1: How about @Cambridge_Uni does a full carbon audit of all its activities - its campus, travel, land holdings, port, and… Stalwarts! @KellySteward from Rockford, Illinois, came to see #AllRise in Milwaukee, and we recreated the greatest photo ever snapped by human camera snapping. #Bacon #Eggs \nThe internet did a good today ✊🏼🍳 https://t.co/rQa1avhxWi Watch this channel for some breaking news about this legendary @parksandrecnbc icon 🍳 https://t.co/l9WkNfT6qg @kkeen0 @peaceandwaves Gorgeous! Will look even better with some knife scars - there is nobility in good work ✊🏼 @FeministInTexas Well, it’s been a while since I had to shop for a hammer, as thankfully it’s one modern item that has not become disposable. I love my Estwing, made in 🇺🇸, and I’m tickled to see these professional nailers agree:\n\nhttps://t.co/dccyyJ9O1Z @peaceandwaves He is apparently a keeper ✊🏼 Folks often say to me, “Nick, I appreciate the ideas you clumsily espouse in your writing. Can you point us to someone who is good at it?” \nI can, plenty. Start with The Unsettling of America by Wendell Berry and this new print journal from fecund Michigan soil: https://t.co/aEDkwS7QCa @jenweigel 30 years later, we’re still obsessed with Robin McFarquhar 😍🤸🏽‍♀️ RT @aparnapkin: When you only have a few pages left of a book and you realize the author isn’t going to give you all the answers you want &amp;… Tomorrow it begins in Appleton, Milwaukee and Madison. Then Chicago ❤️\n#AllRise coming to 37 cities, and more in 2020 so need to gripe.\nTicket info @offerman_shop https://t.co/thPxw9DC0G RT @michaelpollan: Check out this terrific, nuanced Jed Purdy essay on Wendell Berry's thought, and his Lifelong Dissent: https://t.co/OHbR… @herdyshepherd1 This is a level of audience engagement I can only dream of @herdyshepherd1 🙋🏻‍♂️ RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/liiA5FaFgJ RT @JimmyKimmelLive: A man so profoundly masculine that each hair in his mustache has its own tiny mustache! @Nick_Offerman #AllRise https:… RT @StrazCenter: TUNE IN: @Nick_Offerman will be a special guest on @JimmyKimmelLive tonight at 11:35pm on ABC! https://t.co/1Hfvrndisf Folks I am so proud of my student @JonBoogz and this, his final project for my #FreeStyle class - Jon you are really feeling it and I think you will do beautiful things with my tutelage! 🕺🏻\n(GOL-DANG)\nhttps://t.co/9qIVxD7ylR RT @NederlanderLive: Us counting down to @Nick_Offerman's shows this Oct at @groveofanaheim &amp; @VinaRoblesAmp like...⌚️\n\nMeanwhile, Nick's a… American Stalwarts and Lovers of Mirth: One more week until the commencement of my all new live show ALL RISE. 7 Brand New Songs!GO to https://t.co/DSTBKcbuoa to find your tickets if you are so inclined. More cities coming in 2020🕺🏻#AllRise https://t.co/tD4M8qFscs @herdyshepherd1 Agreed! @trafficsheepdog @LagavulinWhisky Absolutely. @herdyshepherd1 😍 @robdelaney I would attend this if I were remotely able! An hirsute and delightful yuk-doctor is Reb! @MJMcKean The tie knot took a few tries but then I was in. @neilhimself @drmuig @michaelsheen @MJMcKean Hats off, you clever lot! 🏆 🐉 @Iilithsternin Taking a knee to that night. Always a pleasure to speak words on this channel. 🎯 https://t.co/d82GcYRGxP Hey this is right nice!\nThank you kindly, BIFF!\n@BobByington https://t.co/MqeInX1ZRt Cheerio, @KTHopkins ! Please come to my show at The Royal Festival hall this eve - I mention you in a song! I describe you colorfully! LMK - I’ll put you on the list #AllRise #TwatsWelcome LONDON TOWNE this night I will warm your @southbankcentre with 90-odd minutes of gambols and japes! Some tickets remain, so we would love to get you sorted. #Mirth #AllRise #ThereCanBeOnlyOne https://t.co/YMiWvAUDVh DUBLIN I am deeply grateful for this generous Fáilte (welcome) from #angrymanwoodsigns here at Vicar Street - a few tickets left for 8pm!\n#Mirth https://t.co/O1uGXlBYsj Don’t forget to bring your bathing costumes to #VapeIsland 🏄🏻@robdelaney @MeganMullally @CatholicLeague_ https://t.co/h7S2u0hEsg @NickRK80 @jackjohnson Lydia, you are in the right place for good love &amp; medicine. We gotta get you back to sanding! Sending you giggles &amp; mirth to Memphis ✊🏼🕺🏻❤️@StJude @KayleighLaff But thank you 4 the opportunity to remind folks that it’s very rude to film live performances - the performer is distracted but also you affect the view of those around &amp; behind you. I suggest to all fans to attempt life without a phone in your hand.\nIt’s still pretty excellent. @KayleighLaff Hello! I’m uncertain at your confusion - the girl filming in the front row dropped her camera when I reprimanded her, so if that wasn’t you, then I wasn’t addressing you. I’m not sure how you made the leap that I was, but I am sorry for your displeasure in any case. @barryhutchison Good Lord, friend, I am relieved that you and your lad are ok. Get home safe, please and thank you. Leeds! \nTOMORROW EVE LET US REVEL IN OUR MORTALITY 🧜🏼‍♂️ https://t.co/7d2Igcf2Is Let us dance like the faerie creatures we be!!! I am shit-faced on cough syrup!!! 🕺🏻 https://t.co/Agg5V4dwtV RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/1GS644ZYY8 @wee_sj 90 minutes Glasgow times tomorrow night:\n\n5:30 doors\n6:30 show 1\n\n8:30 doors\n9:30 show 2\n\nSome seats left for show 2, a late evening pageant which promises to be remarkably meaty. 🥩 #AllRise https://t.co/NvhGy65vxH #Minnesota ⁦@MattOfferman⁩ https://t.co/fSYniyNvSC RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/qt8wOKsFcA St. Louis there will be #Mirth https://t.co/2srLXEgZ3P @herdyshepherd1 Thrilling! New opening credits @NBCMakingIt ? \nYOUR HOSTS HAVE THOSE MOVES https://t.co/tPD4T8RG0C Los Angeles we have a few seats left for the 9:45 show of All Rise tonight, come on down and drink from my cup of broth as it overfloweth af\n@LargoLosAngeles #Mirth RT @KenTremendous: George Saunders appears to be getting better, somehow, every year, and on behalf of all other writers I'd like to state… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/mD1iYYaY0p This most venerated of tool pageants has been on since Norm was limber enough to put his chop saw on the ground and squat to it.\nHats off to @ThisOldHouse and many thanks for 40 years of laughs and plumbing. ❤️ https://t.co/zaoLEPrqJU Los Angeles come see me this Saturday at 9:45pm @LargoLosAngeles or don’t.\nI PROMISE MIRTH. 🇺🇸 https://t.co/hyoTBrzJJ5 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/srBmitg4oM Here’s a good and easy way to send a few bucks to Appalachian coal miners who could sure use it, as they are getting deeply screwed by their Trumpy coal barons. \n@thetrillbillies have the 411 ✌🏼\n\nhttps://t.co/vsnyadHfug RT @SarahEMyhre: MFers it's called trees, algae, soil, kelp, and food webs.  \n\nIT'S NOT TECH. IT'S THE MORAL COURAGE TO PRESERVE WILD PLACE… RT @trumpetcake: Can't remember if I retweeted this already, but it doesn't matter because it's worth a second read. Great real talk about… RT @MatttDavies: From the archive https://t.co/dVoM9aLh0b https://t.co/WnWiMFGfFg @herdyshepherd1 Jasper Jove Jupiter Juno Jax Jumper  \nJunior Jude (D)jango Jazz Jake Jade Jack Jackson Janus Jameson Jefferson Jed Jedi(taken) Dear Dr. Fakenstein, thank you for my career peak. @drfakenstein https://t.co/3BEGafcF8M RT @keithboykin: \"If you can only be tall because somebody is on their knees, then you have a serious problem. And my feeling is white peop… RT @JuddLegum: This tweet is nearly indistinguishable from the manifesto of the El Paso shooter. https://t.co/EN8bhJ0Pc0 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/RKDit4bI66 Happy 85th Birthday to Wendell Berry the Kentucky farmer with the best words. 🦋\n(Thank you @offerman_shop ) https://t.co/nKsLVNIJP1 People of good weirdness please join me for an evening of all-new MIRTH at @LargoLosAngeles August 17 we have added a late show, good gravy thank you for this affirmation ✊🏼\nhttps://t.co/sdPwRx5Geq RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/T47nZ1anf6 RT @WichitaOrpheum: You're welcome.\n\nDo you have your tickets yet to see @Nick_Offerman perform LIVE at @WichitaOrpheum on Saturday, Septem… @TheJoshieG Silence. @herdyshepherd1 Absolute fecking unit This is a damn fantastic respite @herdyshepherd1 https://t.co/UDPI7xfg0C RT @MatttDavies: They're not even hiding it anymore. https://t.co/dVoM9aLh0b https://t.co/VklL8Dsj57 RT @trumpetcake: @MissyXMartinez Embrace change. Live! RT @spencertweedy: WARMER is finally available to buy and stream today. Some of my favorite songs by my dad (and songs period 😳) are on thi… RT @JeffTweedy: New York - Jeff is playing a free show this Friday at @LincolnCenter as part of their Out of Doors concert series. Seating… RT @MeganMullally: this is my fave interview ever. very grateful to @tcolerachel @thecreativeindp for encouraging something meaningful to h… RT @trumpetcake: This is the best thing I’ve ever seen. \n\nhttps://t.co/kgMXHjDIJi\n\n@nancyandbeth RT @jazz_inmypants: CAMEL 1: hey can u hold this for me?\n\nCAMEL 2: uh i kinda have my hands full\n\nCAMEL 1: don’t be like that it’s one straw If you are not receiving the regular installments of love &amp; wisdom from @nickcave please remedy that - #52 is beautiful:\n\nhttps://t.co/gPDG54fzCL .@realDonaldTrump @DonaldJTrumpJr @GOP https://t.co/sxwlX7XMzO This, folks. 🌳🌲🌳🌲🙂 https://t.co/PKIY4c2JRg @herdyshepherd1 You are very talented. @JoshCervenka Keep this between us but I’m actually supposed to meet Bill Murray there 🥂 Thank you for the excellent tips, now I am less angered and more fattened.\nIf you are flying out of Fargo, leave early because the airshow has made an absolute goat-rope of the surrounding roadways. 🐐 ✈️ Check out m’soundcloud\nhttps://t.co/eAgc7chQqf @WhitfordBradley May the Lord open 🙌🏼 win meat https://t.co/RYM8bbnbpm Dear #FargoStreetFair your crafts are resplendent and winsome but does no one purvey a bratwurst or sone damn curds? https://t.co/uNkD3RCAsp RT @Nick_Offerman: Here is very good medicine for all of us creatures from #WendellBerry - thank you very kindly for this, @amandapetrusich… @michaelsheen 😍 Let’s do this 🐈🕺🏻 https://t.co/W9uS1MKt3d RT @MJMcKean: Nobody does horseshit quite like Texas. https://t.co/V8FXb5rPtz RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/JtjYuIy79f BALLET INSTRUCTOR https://t.co/AkSGvKqexO RT @TheMarkTwain: Don't tell fish stories where the people know you; but particularly, don't tell them where they know the fish. @bader_diedrich Jeez what a nice goose from a man I admire for his funny japings! \n🙏🏼🍳🥓 Here is very good medicine for all of us creatures from #WendellBerry - thank you very kindly for this, @amandapetrusich \n\n@herdyshepherd1 @Berry_Center @offerman_shop @angelcitylumber \n\nhttps://t.co/yoRlDEeEVS @AlisonRosen @paulrust Please ask him if he is prepared to properly sharpen an axe? RT @MatttDavies: Chilling. https://t.co/dVoM9aLh0b https://t.co/B5MFSYEA7D @herdyshepherd1 😍 RT @mattmorain: I don't know who else needs to read this right now, but here's Wendell Berry's poem, \"The Peace of Wild Things,\" long ago r… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/f0HYKme8Vb St. Louis, let us laugh and gambol about the place this deep autumn.\nJoin me for mirth 🍁 https://t.co/pX3JbTthP7 RT @brainpicker: “The truth is, most of us discover where we are headed when we arrive.”\n\nWisdom on life and creative integrity from Calvin… I’ll come and plant some more if you’re not careful. 🌳 https://t.co/hAtp14hGeQ RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/BV3bf6wcsl RT @WendellDaily: The great enemy of freedom is the alignment of political power with wealth. RT @trumpetcake: A BROADWAY SHOW ABOUT A PIZZERIA AND THEY MAKE ACTUAL PIZZAS ONSTAGE AND SERVE THEM TO THE AUDIENCE AND THE PIZZA IS SO DE… RT @MatttDavies: https://t.co/AbvotV7qZk https://t.co/8AakZTboGb @tjamesrealtor Tracy, despite the constipative rictus on my melon, I was extremely pleased to meet you and your charismatic family, particularly your heroic daughters. Thank you for putting up with me in an oatmeal hallway. 🍁 @jaybhnk @ESPNCleveland People may like what they like, and I certainly couldn’t give an objective opinion 🍁 RT @mradamscott: Dear Mitch McConnell &amp; all those representing him,\n\nPlease refrain from using my image in support of anything but your own… Thank you @GaryPressy you dear man! Let’s fly that W! 🥰 ⚾️ https://t.co/EkN0eCDB1n @trumpetcake Why, thank you kindly, compatriot! LEGENDS https://t.co/rgDXvMNDwn I would you had told me that. https://t.co/pYGTPXTQXm RT @LiveNationOzNz: Christchurch!!\nYou're the lucky last city to have the opportunity to see the man himself, the guy behind Ron Swanson -… I’m besotted with these London Plane trees in Auckland’s Victoria Park. The mottled bark, the charismatic, graphic leaves, the majestic spread...they belong to genus Platanus with our American Sycamore 🍁 @offermanwoodshop @angelcitylumber #tree #girth #NewZealand https://t.co/S5Jy4GxbHx RT @trumpetcake: I'VE BEEN A PART OF EVERY SINGLE HIGH-PROFILE CELEBRITY ENTOURAGE SINCE 1976. HERE ARE SOME OF MY NICKNAMES:\n\nGatsby\nSlurn… @herdyshepherd1 She has a very good sniffer. Oh well if it isn’t brilliant shepherd and author @herdyshepherd1 , on his way to raising dominant Galloway Belties 🤸🏽‍♀️and filling his Twitter with beefcake shots.\nIf you haven’t read The Shepherd’s Life then you are in for a rare treat ❤️ https://t.co/dPyuh9xlEd RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/WIYZKQSxv0 @herdyshepherd1 Hats off, James, you’ll be brandishing some silver punch bowls in no time! 😍 @FlyAirNZ @WetaWorkshop By Durin’s Beard, I shall answer your horn. @WetaWorkshop I am deeply honoured by your invite and chagrined to have to miss you this time over, but will you please give me a rain check or send a very large eagle 🦅 🙏🏼 @philiplord Our time is now This thread is very good. https://t.co/XQKCf1ljQf RT @TicketmasterUK: Glasgow! @Nick_Offerman is bringing his All Rise tour to your fair town in August and last tickets are available now fo… @MollyJongFast @nick_ramsey 🇺🇸 💨 @annachang Thank you I will immediately incorporate this good intel ✊🏼 PRAYERS NOT ANSWERED https://t.co/vIcd1adZ3R Get a load of this sweetheart who deserves a seat and a dram more than any fellow I have met 😍#DadAd https://t.co/8yooOqEdz6 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/xhja7GE1FV Thank you for accusing me of being ‘woke’ @GeorgiaLaraine I have a hat on my head and I’m ready to shovel\n#AllRise https://t.co/R8sOkOi8Aj @cristianbo96 Thank you, friend. Thank you kindly, @srpeatling \nI am very grateful for the gassy jams we shared tonight in the @canberratheatre - after sampling some local bacon tomorrow, things will be even more delightfully pungent 🐷 #AllRise https://t.co/dTLhhHXtGr @SamLeightonDore Hey this looks great! Thank you for thinking of me, I will pile on to this effort. 🙏🏼🍄🌈🐿 @benlantern77 Beautiful wabi sabi!\n\nAround @offerman_shop we say a piece like that has a lot of Georgia O’Keefe going on 🙊 I love the herringbone bottom detail, and your excellent handle, Helena Handbasket https://t.co/KL9Me2XHQ8 @jacksontom I did not know, thanks for the heads up. Please ask them to contact me through United Talent Agency in Los Angeles. She’s a rare beaut, @CareInChiro https://t.co/0xdYOfBISh 🦅✊🏼 https://t.co/cfozHorxmW RT @WendellDaily: A good solution should not enrich one person by the distress or impoverishment of another. RT @RobGMacfarlane: \"My mind is never empty or idle at the joining of streams. Here is the work of the world going on...The stream is no de… Good Lord. Wait for it. https://t.co/DVXCCSUODe @KenTremendous It’s all happening. RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/kUAf9zmKMP @KristerR I am grateful to be thought of amongst such inspiring and dependable individuals. You and I are a couple of fleeting bunnies next to that quartet. @SlimJim @pretzeljones Although I have been trimming down, Skinny James, I still take that as a compliment.\n@SlimJim @spencertweedy I ADMIRED YOU ALREADY but damn that poncho 😍😜 @claireimogen @TicketmasterCS @TicketmasterUK 🤸🏽‍♀️ Dear @TicketmasterCS I wonder if there is a more streamlined way to answer your customer’s needs than by me communicating their Twitter complaints this way? Please and thank you. https://t.co/aUdUkUViVf @claireimogen @TicketmasterCS @TicketmasterUK Keep us posted please. @claireimogen @TicketmasterCS @TicketmasterUK Any luck yet? Dear @TicketmasterCS @TicketmasterUK do please see to this dilemma and thank you. #Mirth https://t.co/P6gwYqiF47 Thank you @AOC for setting a staunch and even-keeled example for our representatives. \n@DNC @GOP please take notes. 🇺🇸 https://t.co/0gZoWUV4GQ @MCNOJA Charming af - hats off! Hugs are imperative to healthy living - here are some hand-crafted hugs for Dad in Cherry and Ash 🤗\n@offerman_shop \nhttps://t.co/TgikLbMjYp https://t.co/7tHDLmUHnz @martinaucnikova @ftlonesome RT @AMGPressOffice: Ahead of the UK leg of his #AllRise tour, which calls at @O2AcademyGgow on Wednesday 28 August, check out comedian @Nic… RT @MeganMullally: thank you @asarahlarson and @NewYorker for this wonderfully-written piece and good old-fashioned caper, and to #joaofaze… RT @TheDweck: When you hear there’s a poor person getting beaten up outside https://t.co/btKNRPrNTy Baron this is a handsome example of how the “rough around the edges” evidence of your handwork is actually very charismatic. I’m gratified that my book inspired you.\nOne tip: maybe find a frontispiece without the face of Sméagol so as not to scare off the birds? #Precious https://t.co/rQ8ZQgG1Op RT @KenTremendous: Good gravy, I’m so sorry everyone in the world, I’ll always be sorry, it’s so embarrassing https://t.co/XDFiI3XAKA Well done.\nNOW YOU CAN EAT https://t.co/Rj2iUKOVgf Meet me in #Australia for a beef ⁦@MeganMullally⁩ ⁦@robdelaney⁩ \n#AllRise https://t.co/xBpXsJYAO1 RT @DaveBautista: My moms a lesbian. I think I turned out ok. And the activities she chooses is to help the homeless and people suffering f… @robdelaney I love you peter RT @robdelaney: Just had to poop REALLY bad &amp; ran to the toilet &amp; very painfully produced a small, perfect turquoise “Mentos” &amp; looked out… Folks of Australia, let us commence the chuckles tomorrow eve in Adelaide 🦉🕺🏻🤸🏽‍♀️ https://t.co/juHNmK4NVf @ashleymliving @BobsBurgersFOX I also love it Australia has it all #NickCave https://t.co/ZylzWcgxUT RT @MatttDavies: Toot toot https://t.co/AbvotV7qZk https://t.co/ia0NG0kIc6 No matter if you have a father or brother or other person like a lady or karate Sensei they all like Father’s Day loot from @offerman_shop https://t.co/BsZgEtIBYs Here is something for Dad in case he needs a gift in the future ❤️\nhttps://t.co/TgikLc3UPX\n@offerman_shop https://t.co/YabpUpCXUe BRISBANE we will caper about and giggle I would bet https://t.co/lpyHR5DtNm @johntilford My pleasure, John Tilford.\nHis burgeoning interest was my aim. RT @KenTremendous: I loved Bill Buckner for so many reasons. @HeathRacela 😍 Deadliest Catch https://t.co/dfJXu23cZ4 This Old House 😕 https://t.co/YaMNBFSNjC @GaryPressy @Cubs Those are Gandalf numbers!\n#WizardOfMirth \nHATS OFF, Gary!!! RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/wCRhKxZAww If you’re having a tough day or just need a moment to smell a proverbial rose, why not have a look at this guy\n#Roadhouse #DoubleDeuce #Dalton https://t.co/eqwHc2YGt3 @MollyJongFast @TheRickWilson @thedailybeast #DonJrBookTitles \n“I’m a Big Shooter” @MollyJongFast @TheRickWilson @thedailybeast I’m A Big Shooter RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/q1FOokEDMo RT @zoeinthecities: women get hotter &amp; better with age &amp; anyone who tells you otherwise is trying to sell you something. This quote may be over-egging the pudding, but I certainly hope to see you on my #AllRise tour this summer and fall what for the exchange of #mirth https://t.co/aaDADynFsI RT @strandbookstore: May 22, @neilhimself will be @TownHallNYC! This exclusive event gives you an inside look into the book #GoodOmens, the… RT @neilhimself: There is. Nick Offerman is interviewing me in the Town Hall on Wednesday. Tickets still available. https://t.co/1xPWqKLoO1… RT @ColinHanks: Statement by a Christian minister. https://t.co/0wxsonrUtw https://t.co/6ShVeBR7SL @neilhimself Nod’s as good as a wink to a blind bat, eh what? @KenTremendous When we will get this year’s Pham/Scooter G player? @JPosnanski Here blows a nifty online art show where you can lay hands on some pieces from artists whose shit is tight #MakerFaire #art #Pencil\n\nhttps://t.co/kM4t71csli RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/4oyhYUmr31 RT @MatttDavies: What have we here. https://t.co/dVoM9aLh0b https://t.co/mhN4nODXFO @MatttDavies You were right. RT @jtabrys: Had a conversation with @Nick_Offerman for @UPROXX [Dot Com] about his new @audible_com series, phraseology, and why the so ca… RT @meganamram: The beautiful dedication in @GloriaSteinem's new book \"My Life On the Road.\" Thank you, Gloria. https://t.co/HikfvErCDJ RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/O9zX1wSVjr RT @neilhimself: The tickets are now onsale for next week's TOWN HALL conversation. Wednesday, May 22, 2019 • 7:00pm. I'll be talking to @N… @BellyBroXD You are welcome, it is sincerely my pleasure. RT @AustinFrerick: Since 1987, Iowa has lost 84% of its 🐖 farmers. At the same time, the number of 🐖s in Iowa has increased by 37 million.… @bluemangroup @TimWadephul Way too handsome. Highly recommended\nNo pun, etc. https://t.co/VK8OODXghY Word. https://t.co/MwdRn6kWbW https://t.co/GPFAVZOgQ7 RT @MeganMullally: thank you @EVincentelli @nytimes for this THRILLING article about @nancyandbeth 🎩🎩 💛💛 and #joecarrotta (@joe_carrotta on… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/hF3Ebhzs0V Hey, if you are interested about continuing to have good food to eat going forward please watch me sit and look pretty while these 2 very smart ladies talk - w/Debbie Barker &amp; Mary Berry! Tomorrow, May 14th @ 7pm  @abchome @Berry_Center 🎟https://t.co/471MwTgUWr  @michaelpollan https://t.co/GY9hjj7dU3 RT @BobByington: Seattle -- It feels as if Austin type movies play well there? Climate? @Nick_Offerman narrates... @SIFFnews https://t.co/t… RT @JLester34: What a gorgeous night for baseball! Thanks to all the fans (especially the moms!) who braved the elements and stuck it out w… Oh what is this delight https://t.co/Vn7X4jUdPW Oh well looky at this damn nice piece about glory and good art 😍\n@nancyandbeth \nhttps://t.co/Ant93PHzWc RT @nieshatrout: How do we make handwritten letters, cards, &amp; notes a thing again\n\nThe new world is not romantic @robdelaney Love that guy @BarefootBugGuy @EmKristine445 Daughter Power! 💪🏼 @Shinfo_Ryan Gorgeous! THIS IS A PLEASING TREAT COMING DOWN MY CHIMNEY 🎅🏼 \nthis is not a euphemism #HotGlue https://t.co/eArnKwxpXz BOSTON\nNow that you have finished a cold, wet spanking of the Mariners at your local diamond it is warm and HOPPIN at @CityWineryBOS for the 9pm show of @nancyandbeth \nTICKETS REMAIN AVAILABLE FOR YOU ❤️💃🏼💃🏼🧨🇺🇸 RT @AdviceToWriters: If people cannot write well, they cannot think well, and if they cannot think well, others will do their thinking for… @MattTheE Look at us now. George Michael was my first concert in ‘84 or so, because I could only go to what my sister would drive to. \nHE WAS ASTONISHING. THE LIE IS PEARL JAM\nI completely missed that whole grunge period... Prentry much none of the show is political - #AllRise is intended to serve as a respite from all the rancor in our society. I make fun of all of us dumb humans equally 🕺🏻 https://t.co/nbcG2oA0Gt 1. Ray Charles\n2. George Michael\n3. Parliament\n4. Randy Newman\n5. Def Leppard\n6. Pearl Jam https://t.co/F48HEf7syF Friends, I invite you to join me for an evening of love and yuks, in which I will rhyme “yurt” with “squirt”\n#terrific #AllRise\nTalkin to you Australia, Scotland, Ireland, England &amp; Americaland\nTICKETS:\nhttps://t.co/hD4U7EqUIS RT @JimmyDiResta: Oak has more soul https://t.co/qeLQb7HQqV RT @neilhimself: Has anyone not seen this yet? It is a fan made video of GOOD OMENS in 35,000 dominoes and it is what human history has bee… RT @spencertweedy: WARM and WARMER are streaming this weekend 🌌🕴🏻🖤 https://t.co/BYBISEdRix RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/3T2cK8YBi3 I do love to sashay across the Beacon boards! https://t.co/bzV9QzvwbK This is a hot show, folks, rife with top-drawer musicians, angelic/heart-wrenching vocals, death-defying choreography, toe-tapping and prurient maneuvers committed upon folding chairs. Also, as the roadie, I offer some light comedy. #VaudevillePunk #DaDaTwinkies https://t.co/YRxIe155v1 @JasonMCousins Give it a Goog Hot Damn This Is Pleasing ❤️ https://t.co/BTvbv9TmB2 RT @MeganMullally: #boston!! don’t let your mother miss her recommended dose of punk-vaudeville this #sunday #mothersday ⁦@CityWineryBOS⁩… @ed_solomon @EmilyRNunn Hats off, sir. RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/fXcO6Bvz3B RT @robdelaney: I love my wife RT @PJ_Mooney: Kris Bryant after hitting a walk-off, three-run homer to beat the Marlins at Wrigley Field: “Who wants to come sit through a… Aw hell yeah https://t.co/5x3DSIueto RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/3qz0WB2GNt RT @Robillard: A very telling thing about American democracy is that the maximum legal campaign donation is indexed to inflation, but the m… @chrislhayes @scottbix Reminds me of Andy Dwyer “Catch your dream! Shackle it to your heart!” WICHITA\nDespoil your MOM in a beefy fog of my “humor” and BBQ emanations #BurntEnds #Kansas #Pork #Cloud #Pungency https://t.co/hS9reTySwB MADISON\n2nd added show means I’ll be fully refueled with curds &amp; brats good goddamn and some beer and other cheeses? Get it. https://t.co/AFnOkGn9tI BOSTON, MASS.\nThis legendary artist named @MeganMullally will be sashaying her #Jazz and her sassy #Panache with her band @nancyandbeth for you fine Yankees May 12\n(pro tip: get the late show!)\nhttps://t.co/uezpAkYo71 https://t.co/lBsowM78rq RT @robdelaney: RT to bless the timeline https://t.co/uSQVHZsaI7 Friends, hear me take the helm on the high seas of cynicism again w/new Audible Original “More Bedtime Stories for Cynics.”\nPut the kiddos to bed &amp; settle in https://t.co/LwIhruUlWH\nNow available on ⁦@audible_com⁩\nMembers, you can get it FREE this month.\n📚 https://t.co/igDC37rc4v RT @LiveNationOzNz: Second &amp; Final Canberra &amp; Melbourne shows for @Nick_Offerman's 'All Rise' tour on sale now! First shows sold out! \n\nGet… RT @Ticketek_NZ: While having earned massive recognition for his work on-screen, @Nick_Offerman also thrives on stage in front of a live au… RT @Ticketmaster_AU: 🙌Make sure you have #noregrets when @Nick_Offerman heads to Australia next month. The star of @parksandrecnbc and Farg… RT @neilhimself: Hate for Sale https://t.co/3mwnAsTddG. It has won several fancy awards. I’m proud of it and wish it was less relevant.  @a… @JPosnanski In these select categories, sure. @TheSanchmo I salute you, Kevin. Much can be learned once a pipe is burst ✊🏼 @astro_ricky @NASA You do me great honor. 🇺🇸 Hats off, chum, and richly deserved! @MatttDavies https://t.co/HAQVVhFZ5G Friends, hear me take the helm on the high seas of cynicism again w/new Audible Original “More Bedtime Stories for Cynics.”\nPut the kiddos to bed &amp; settle in https://t.co/LwIhruUlWH\nNow available on @Audible_com\nMembers, you can get it FREE this month.\n📚  https://t.co/21fN4Gm9RV RT @SICKOFWOLVES: BEING HUMAN IS COOL BECAUSE YOU GET TO ACT LIKE YOU ARE IN COMPLETE CONTROL OF THE UNIVERSE ITSELF EVEN THOUGH YOU ARE BA… RT @MazMHussain: https://t.co/8iL8CtU47V @HuntHuntah @prattprattpratt Because he is a magnificent beast, Pratt in a heartbeat unless I can get him giggling. Manchester, I relish our reunion. https://t.co/4IkMr8w5QV RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/3HOxZ2iCPl @JoeyLightbulb Thank you Mikey! BOOMER SOONER https://t.co/K6JuAPkNwl RT @BMcCarthy32: he's just so fun to watch play https://t.co/XlxF6lPR6T Canberra &amp; Melbourné - \n2 ADDED SHOWS FOR THIS HOT BOUT OF SLOW TALKING ❤️ https://t.co/Ouo8Vkl4aO @violentkillzey @Stenefjall Strong agree @AtTheRiv @Stenefjall @netflix I also produced the doc you’re watching and those are my hands in it making a stool 💫 RT @neilhimself: @Nick_Offerman @Stenefjall I started with the Selected Poems They are like someone taking you out into a beautiful meadow… RT @Nick_Offerman: @Stenefjall Start anywhere, it’s all golden and it’s all connected \nEssays: The Unsettling of America\nNovel: Hannah Coul… RT @MarkyWhipwreck: To all my followers and anyone else. @JaimsVanDerBeek made this photo. It has become viral, even noticed by @Nick_Offer… RT @nancyandbeth: san francisco!!!! we're coming back this weekend!!!!!!!\n\nhttps://t.co/mI67vqUOnY https://t.co/mI67vqUOnY @Stenefjall Start anywhere, it’s all golden and it’s all connected \nEssays: The Unsettling of America\nNovel: Hannah Coulter or The Memory of Old Jack\nStories: Fidelity\nPoems: A Timbered Choir RT @OnlyAnExpert: \"I really want to make things that break your heart,\" Laurie tells @Dazed of her new VR piece with Hsin-Chien Huang, To t… RT @AyeshaASiddiqi: most people are capable of a lot more kindness than they feel safe expressing My #MeatRetreat in preparation for @MoontowerComedy took me to @FranklinBbq where I managed to enlarge my #pieHole by a factor of 3 pies. 🐷🙏🏼 🥧 🇺🇸 #Swole https://t.co/sLdAifkt53 Unsurprisingly, all the dissenting replies are either dudes or faceless anonymous trolls (based on &lt;30 followers), including a Freddie Mercury, a picture of calf muscles, a motorcycle, and an actual Jesus on the cross 😕 @HunterRoss3 In a pretty swell coincidence, it happened to be my favorite as well as that of Mike Schur, our creator and show runner. Serendipity for the win. 🥃🥃 Narrator: It is. https://t.co/WsY9CPVUiK @bbaran181 Sweet chapeau but can he blow? RT @robdelaney: Don’t often post pics of the fam but my son J’oleander just kicked butt at his swim meat! https://t.co/frSWDjGyxP RT @neilhimself: If you are in the UK run to get to tickets to see @ArmisteadMaupin doing An Evening With. He's hilarious, moving and brill… I must have looked particularly smart getting off the plane, because a couple guys approached me for a handshake and one said @KeithOlbermann ?\nI said no, but thank you kindly!\n#APlusAirportAnecdotes 🚨 Sweet Book Alert May 7🚨 \n\nMakers both active and aspiring, here is a splendid tome to tickle your downtime. I am gratefully inspired by @donttrythis and you can be as well.\nhttps://t.co/FqawYvul2r https://t.co/R3isI0s6ll Biden on The View shimmying around his non-apology to Anita Hill. @KrangTNelson @KenTremendous He literally lives out over his skis RT @KrangTNelson: only phone users will get this https://t.co/cerfT4zbVL Pro tip: either apologize, or say “I will not apologize”.\nThis equivocation is shameful and representative of the politics we want to leave behind us. You might as well be @GOP https://t.co/IP1nL7iqs7 RT @tmbg: https://t.co/NRbbtaVNi2 RT @historylvrsclub: Lumberjacks working among the redwoods in California, 1915. Photograph by A.W. Ericson. https://t.co/Ef95EeIwe7 .@KenTremendous @JPosnanski https://t.co/yFMZl54tXi She’s running. https://t.co/Vib88mU830 This is a generous approbation, Chelsea, thank you. https://t.co/KtS5l6Ewta Thank you for this gift. https://t.co/GX2KWPQ5bv Lookit the size a this bailiff 😍\n@hodgman @JesseThorn https://t.co/rZIZfW1P0g Austin, if you are unencumbered by appointments this evening, do join me at the @ParamountAustin where I will slowly talk and fumble.\nhttps://t.co/Bxc5NgWpzD RT @thetrillbillies: The lamest people in the world are the ones who are into politics in the same way somebody might be into a tv show or… Here’s a sweet thing for Mom:\nFree customization of any @WouldWorks1 cutting board.  Tell her in your own words. ❤️\nhttps://t.co/QckcO2sCBD The only motive that’s worth anything is love. If you don’t do the work that you love, and if you don’t do it for love, your artistry is not informed by love. It can’t be any good. So there’s the argument, as far as I’m concerned, against robots. 🌱 https://t.co/qcB1IpbhG9 RT @WendyMolyneux: I hear that Joe Biden will announce that he is running for President on Thursday by sneaking up behind each woman in Ame… RT @enhight89: Honestly, everyone should watch this film. It's heartbreaking and stunning in equal measure. It's an honest look at what far… RT @SitDownPee: This is a kid who knows what he’s about. @UPPilotBaseball @Nick_Offerman https://t.co/P9yCpHeCkP RT @JaimsVanDerBeek: @Nick_Offerman @TheRock Nick. I made this. Any chance you will RT mine? @JLester34 @Cubs Bully.\nI believe you know what you’re about, Jon. I am game @TheRock https://t.co/38ATAFEUkR Mother’s Day is upon us.\nHere are some cute af choices from the elves at https://t.co/TgikLc3UPX\nthat will make your Mom feel nice.\n@offerman_shop https://t.co/MEY7ZK3aDu RT @KenTremendous: Sorry...*Roberts*...is concerned...about the Voting Rights Act?\n\nJohn Roberts?\n\nChief Justice John Roberts? Who used the… AUSTIN I will see you tomorrow night for #Japes and #Ribaldry with songs and slow-talking. 🐌🌽⚾️🌱🚜\nTICKETS AVAILABLE FOR 9:30 y’all https://t.co/HGUo4zic7o RT @AdamforAlabama: \"Impeach Donald Trump\" is trending, so I'll help it along #ImpeachDonaldTrump \n\nhttps://t.co/1aDPo6OmwN This is a very good tweet.\nThank you kindly for making my dreams come true (again!) ❤️⚾️\n@Cubs https://t.co/bdrgJTtgxJ I have included 3 tips in this photo for you @JLester34 see if you can discern them. First one’s free:\n\n1) never look at your target\n2)\n3)\n\n@cubs https://t.co/FtVW8jW4yy And then some! https://t.co/XIElUFFBn9 RT @abbijacobson: Thank you @ACLU for putting out content like this to help us better understand the ramifications this would have if the c… Oh tight here is your tunic for #420 - see this and more delights at https://t.co/LOyagxKbWv from my #sasquatch brother Pat Riot 🍄 https://t.co/Pox2ReOBbk Folks, at my last reckoning we have a few seats left - the proceeds tonight are going to The Wendell Berry Farming Program in Kentucky, so if you like a wholesome cause that may well result in some fresh bacon down the road, hustle to an evening of medium comedy.\n @Berry_Center https://t.co/TT6UryPqpG Dear @VoodooDoughnut &amp; @ilaniresort thank you for these handsome and enormous pastries. When I face-plant in the middle of my show, I hope you will laugh long and hard, you sick and twisted animals 🙏🏼 #MomIAteTooMuchDonuts https://t.co/Hbh8dzo0UN RT @neilhimself: Fabulous animated film by @mollycrabapple, @KimBoekbinder and Jim Batt, narrated and cowritten by @AOC https://t.co/XeOOJt… Oh yes to the hell (is that right)\nTUNE IN to @KPCC this day at 3:30 PST for @nancyandbeth on The Frame - if you are into enjoyment\n@MeganMullally @steph_o_nee @Thepressdog @LargoLosAngeles https://t.co/iHPWI464TG At long last, I am bringing my shovel to @edfringe 🧙🏼‍♂️ https://t.co/O0QFyuIlI3 This is very good. https://t.co/DrH0XvOzg4 RT @PalaceAndOpera: There's still some availability for @Nick_Offerman's show here this August, but you'll have to be quick! https://t.co/v… @heyitsally83 @itssnicks Load blown. @itssnicks A handsome devil. RT @girlatthegame: what winners wear https://t.co/HzBrNFugcq @KenTremendous I’ll get on that train RT @ed_solomon: I was trying to figure out what Donald Trump’s name would be if he were a Charles Dickens character - you know: “Lord Chort… @AnnaWeaver8 @prattprattpratt Ah well, back to the woods for me RT @MoontowerComedy: 🚨All of our 12 Days of Comedy Giveaways are live! Win tix to see #Moontower2019 headliners @Nick_Offerman, @DavidSpade… @AnnaWeaver8 @prattprattpratt From the second of dialogue I can hear, I’m guessing it’s the shoeshine? RT @nancyandbeth: here’s a cute article about our new single, I Don’t Hurt Anymore on Jazziz. give it a gander. \n\nhttps://t.co/fShvhhSzYa h… AUSTIN you are my favorite city in which I can canoe downtown to @FranklinBbq \n\n@MoontowerComedy #WeirdmenArise #WeirdWomenToo https://t.co/DJ61WG8Uxb Austin Town, please join me at my old fave #Paramount Theatre for 2 shows April 24, thanks to the @MoontowerComedy fest ✊🏼\n#MirthWillEnsue #BBQinMyFuture\nhttps://t.co/UIAuLiFErp RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/JRtDCfKtYc @chughes15 Huh, this seems very lame. Let me inquire into it. @chughes15 When we add a show we don’t change the original showtime, we add an earlier or later show. I have Glasgow at 7:30pm, so I believe the new show will be at 10pm. If you had tickets for the 7:30, those should remain? @chughes15 Doctor, your showtime has not changed, please rest your weary heart! FINALLY I AM PROPERLY SEEN https://t.co/5DdO4zjL71 @Belsnickel222 I am unfamiliar with the breed of pusillanimous performers with which you must be accustomed, dear K, but I’d calm your fretting by informing you that any 2nd show of mine is easily more fun than the first, perhaps due to my donkey-like stamina - I have never half-assed anything. Ladies and Gentlemen of Scotland, Ireland, and England, I am giggling over here at your enthusiasm for my slow-talking - so we have added a 2nd Glasgow show and we have changed the Manchester show to a bigger barn 🌽 https://t.co/tlfL26cjeZ Well howdy, here is a tantalizing minute from @nancyandbeth - a sample of their sizzling new record due out in 2020 - to see them on their impending tour visit https://t.co/MZplesTwAE .\nI am proud to serve as their roadie ✊🏼 https://t.co/009IHu9vnZ RT @nowhere2pacific: \"The care of the Earth is our most ancient and most worthy, and after all, our most pleasing responsibility.\" - Wendel… RT @MeganMullally: thanks ⁦@RollingStone⁩! 👄👄@nancyandbeth tour #2019 begins soooon! get your tix on now #eargifts👂💐 #nancyandbeth https://… AUSTIN I ADORE YOU.\nPlease join us for #Mirth https://t.co/UeeD5FEZDc @JPosnanski He’s the comedia/tragedia masks RT @MeganMullally: whee!! we’re so excited! we had fun writing this book &amp; extra super duper fun recording it 💕🗣🗣💕 thanks, #audieawards @pr… Well, Chris @prattprattpratt , we will likely never again have the privilege of being tweeted by @ESPN\nI salute you, as always, you beefy edifice. #MacklinForTheWin #IThoughtYouWereDead #SoDidThePresidentsEnemies #MacklinYouSonOfABitch https://t.co/1gT3vRQq2l RT @parksandrecnbc: Ten years ago today, a little show called #ParksAndRec came into our lives. 💕\n\nAmy Poehler &amp; @Nick_Offerman have a spec… Thank you very kindly to all of the well-wishers on this 10th anniversary occasion for which I am impossibly grateful ❤️\n@KenTremendous &amp; Greg Daniels, you sure mixed up a perfectly plum batch of medicine &amp; giggles 😍\n#BobbyKnight !!! https://t.co/wunSNOHyd3 Folks I just gave some cash to this excellent cause and I encourage you to do the same - these swell farmers and scientists are leading a charge towards the small farm sustainability that our planet will need for things like eating and living and such ❤️ https://t.co/hg1XXCS6Qs 💃🏻👯‍♀️💃🏻\n@MeganMullally @steph_o_nee @nancyandbeth @reba @RealHughJackman @russellcrowe https://t.co/exIW2Y96ka Some very good news for humans who prefer pleasure:\nNANCY AND BETH are going on tour to bring the lightning and the boom-boom to a bunch of American and Australian playhouses ✊🏼🌈❤️🙋🏻‍♂️ https://t.co/x2ZAvEl5I9 @AllCLE365 The recommendation stands. If you haven’t seen Alex Garland’s Annihilation, I highly recommend it. https://t.co/q6lJkDIZFy @Travon Thank you for the heads up 🏃🏻 I took a knee and bowed my head under the fulsome weight of this compliment. https://t.co/9RfqHvt5rs Lovely thread. https://t.co/i2ooFWerxU RT @MatttDavies: I drew Teresa May! https://t.co/AbvotV7qZk https://t.co/8HqQwjeLgj If there be a more pleasurable program in which to elocute, show it to me 😍 https://t.co/j9QgOPN0TO @MeganMullally @TheEllenShow I goddamn will @realDonaldTrump We the people think you’re shit. RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/777JZLo1tz RT @sternbergh: ladies and gentlemen, may I present to you: twitter https://t.co/0CZ96tQIQX RT @ezraklein: “The President is going to say authoritarian things but he’s lazy and easily distracted so we’re going to mostly ignore him”… RT @MatttDavies: Are You Experienced https://t.co/dVoM9aLh0b https://t.co/qde5lRgAaX @MellytheHun Here is a very good book of projects that vary in difficulty, from easy to arduous, by me and the elves of @offerman_shop \n\nhttps://t.co/Q2EKlzSQ0h @steveagee @MoontowerComedy I dig bats RT @_cingraham: Hell of a cartoon in The New Yorker https://t.co/nSZhxOglSJ RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/teLyzKehly RT @BillieJeanKing: This atrocity begins today in #Brunei. Please join me and spread the word about the boycott of hotels owned by the Sult… @jack29872645 It’s tough to beat @neilhimself for exciting the heart strings.\nHere are some examples:\nhttps://t.co/FGPXzbT8CE Australia 🤸🏽‍♂️🥾🍄 https://t.co/80vyeqqRsg RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/2oCdEL0IXR @Tork8 To the best of my knowledge, yes. They do add character, but I get it. You can bleach the slab but the mold will still be a discoloration. You might also think about dyeing the piece to match the mould... @JPosnanski @KenTremendous @ApplePodcasts @Stitcher @Spotify WE NEED THIS MEANINGLESS THING Um @seanhannity is this achievement screwed to an upended pallet https://t.co/wBnm154Ryh RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/AWTXktG7bT RT @AoDespair: Render unto Caesar.  In the hands of the politically minded, Christianity — and perhaps all organized religion — becomes a g… @MonkeyPunchBaby @neilhimself @amandapalmer @MeganMullally Always @neilhimself RT @robdelaney: I miss him so much. No one compares. Really fucks me up. Standup world without Brody is just a smaller, less interesting pl… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/dAukqd7jXF Can’t wait to watch this vital rap with @AOC &amp; @chrislhayes and I also highly recommend @amywestervelt on this topic and her brief but incisive #Drilled https://t.co/6tUjSiqSp6 @OTEROSTUDIOS Look again https://t.co/3cviZbMfGX - a late show has been added ❤️✊🏼🕺🏻 Ladies and Gentlemen here is a very healthy and delightful read from inspirational ginger @donttrythis \n#MakersForTheWin https://t.co/YPwMWINxqf RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/EnjESJY94T Hello. \n@NBCMakingIt season 2 will include some flaming rock and roll from my #maker hero and shop wizard @JimmyDiResta - plus an apparent fleet of cordless goodness in the Woodshop 🤟🏼🤟🏼 https://t.co/5LofnkvOs1 @GeekCharge You’ll get the richest color and longest service by oiling it annually. Your local outdoor/lumber store should have good options.\n\nIt can also be pleasant to let a deck weather naturally but most softwoods will degrade and sustain water damage more quickly than you would prefer. Hello America.\nHere is a new, full schedule of my fall tour #AllRise with added shows because 9 of you laudable cities already sold out, a happenstance for which I wholeheartedly thank you. #Mirth guaranteed 🍄\n\nTickets:\nhttps://t.co/3cviZbMfGX https://t.co/MGdryJDKMI You will not believe what is going down in the barn for Season 2 of MAKING IT #vessels #tape #barn https://t.co/b5UYKQwpL1 Good Morning Ireland, Scotland and England, currently of Europe.\nI am thickly &amp; limberly JACKED to offer these autumnal performances for your pleasure. #Mirth is on the menu, including my ode to football support songs. ⚽️ 🍺✌🏼\nTickets via \nhttps://t.co/3cviZbMfGX\n@offerman_shop @junkbuj Go, @Cubs, Go RT @ryanlcooper: in countries where they have the rule of law, this is called \"bank fraud\" https://t.co/pjW2k5jIlm RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/X1OtM3t6Ay HAPPY OPENING DAY \nBASEBALL TIME\nLET’S PLAY 2\n😭🤸🏽‍♂️ ⚾️ \nCheck out these sweet Cubs Legends @cubs \n https://t.co/h92jqMKVvv via @YouTube Many thanks to @ColleenDoran for this exquisite artwork that has finished off my Templar chamber perfectly.\nThank you @neilhimself for the reference ✊🏼❤️ https://t.co/xFliGociBm Friends, when a tour is booked there are many complicated scheduling hurdles to overcome, and sometimes my favorite places sadly don’t have a theater available to me, hence no Minnesota, Pacific NW, Texas, Rivendell, Pittsburgh, Canada, etc.\nI am not pleased but them’s the breaks https://t.co/vUwhKwgyvb @wesgherman I will not but thank you for your patronage. @Mike333West It’s already up, Mike. BONUS MIRTH.\nMy fellow mammals, we have added more extra bonus shows in 9 cities, a happening for which I am tickled pink. Get #ALLRISE tickets at https://t.co/3cviZbuEPp \nbefore the general public beginning on Thursday at 10am local time with the password: ALLRISE https://t.co/MZewNpoG8F RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/2DK55YVshe @iamRYANNN There is a fringe rumor Rob, receiving you loud and clear.\n\nFolks, season 4 of #Catastrophe is deeply moving while gut-bustingly funny. It’s poignant and timely and double woke. Maybe triple? @SharonHorgan &amp; @robdelaney have made us 6 new episodes of #JOLLIFICATION ❤️ https://t.co/Rw2Bk7I8gd Here’s a great thread about staying the course 🇺🇸 https://t.co/nzZL3UuM00 @trevoryoungPHX 1) Brush off dirt to taste.\n2) Place ass in chair.\n3) Read Wendell Berry. RT @michaelpollan: As usual, Wendell Berry has it right. https://t.co/kSauwsrRoV @sepinwall @JPosnanski Tell it to the Yankee Minute 😉 @JPosnanski @sepinwall Poor guy. I’ll rosin up my bow. I second this generous rec from the legendary woman who tolerates me https://t.co/2SSw9TsBUf My #AllRise tour will now encompass Australia, New Zealand, Scotland, Ireland, England and the United States of America.\nPlease join me for a fulsome exchange of #Mirth &amp; #LightDancing\n 🇦🇺 🇳🇿 🏴󠁧󠁢󠁳󠁣󠁴󠁿 🇮🇪 🇬🇧 🇺🇸 \n\nFor tickets and info, see https://t.co/3cviZbMfGX https://t.co/Uz8qynPeZF Tickets at https://t.co/3cviZbMfGX Folks I’m adding my first ever UK dates to my All Rise tour, which is why I am writing so enthusiastically.\nGet your tickets before the general public beginning at 10am local time on Tuesday 3/26 with the password: ALLRISE https://t.co/fZs6gQneqm Vernation 😍 https://t.co/czx1mgZ4qp @phaldiaa A) Thank you.\nB) No, like any author, I do not expect to ever tire of hearing that my work achieved some desired effect. RT @AOC: This is the REAL conversation we need to have as a country.\n\nAs horrific as this president is, he is a symptom of much deeper prob… RT @tomtomorrow: https://t.co/UXIbr5qKlo RT @RBReich: There can be no effective control of corporations while their political activity remains. ... It is necessary that laws should… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/ne9YdSBAQy RT @depressionnote: Suicide hotline numbers 📞 \n\nUnited Kingdom 🇬🇧 116 123\nUnited States 🇺🇸 1-800-273-8255\nCanada 🇨🇦 1 800 456 4566\nIreland… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/JaFyw6tsKZ RT @offerman_shop: The new OWS Cutting Board, ash with walnut and cherry racing stripe. Boom. https://t.co/VPJS4zSrKO https://t.co/J7IuEXHl… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/3G7lpl3ctt @robdelaney Thank you Rob ❤️ @DavidDolak @mrusso880 @yashar I only lend to my siblings, and they have to leave a driver’s license 🤨 @mrusso880 @yashar Cordless Framing Nailer 🚨SWEET CHUCKLE MEDICINE 🚨 \n\nMy 2019 American tour, entitled \n\n             🌳 ALL RISE 🌳 \n\nIf you are so inclined, you may pounce on tickets BEFORE the uninitiated general public beginning at 10 of the AM clock!\n\nHIT https://t.co/3cviZbMfGX with password: ALLRISE https://t.co/4Ql23258fl The magnificent @MatttDavies drew me up this comely poster: https://t.co/VnQIbSrmib RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/VKJ4yUgbJm @LisaJonesJourno Indeed, dates coming soon. Here is new exposition:\n\nMy 2019 American tour, entitled \n\n             🌳 ALL RISE 🌳 \n\nIf you are so inclined, you may pounce on tickets BEFORE the uninitiated general public beginning at:\n\n•10am local time on Tuesday 3/19• \nHIT https://t.co/Dvud3loRQx with password: ALLRISE https://t.co/vgRnAE7sMz This man has it going on. Please read this gently suggested way forward.\nTa-Nehisi Coates Is an Optimist Now https://t.co/mmYbc6r65e RT @jfreewright: Is just me or are the #2A gun-rights folks not talking about arming the mosques?🧐 @PSKtruck After a little research, it actually seems like that 1/4” collet slips right into the existing 1/2” tube? Does that seem right? It’s a new one on me.\n@JimmyDiResta you up? @PSKtruck The 1/2” collet should pop out of the threaded collar, and the 1/4” should slide in and replace it. I’m not familiar with that flange collar, though. Can we see the other end of the 1/4” unit? @PSKtruck David, congrats, the router is a very powerful and versatile addition to a shop. Please be careful, though, it’s bite can be extremely dangerous. RT @Madison_Madman: We all know Ron would stand against a bully. Therefore, reason stands that he’d support taking away the type of tool th… “Nick I’m a big fan but you know nothing of Liberty, so I have no respect for you but yet I still follow you.” Dumdums get mad when they are faced with the truth that Ron was no dumdum. I believe that Ron Swanson, were he impossibly reading my rectangle screen, would nod stoically at this righteous smackdown. 🇺🇸 https://t.co/sooh8HYulC RT @sarahkendzior: Thread https://t.co/iZ16xTPBqj RT @KenTremendous: Give him 3 bucks, or more if you can, and help him reach the debate stage. \n\nhttps://t.co/GSjKi0Q11K https://t.co/7dFUtD… RT @brtom: Handcrafting books: Labors of love https://t.co/TjZKxO0XaG Larkspur Press has published quite a few volumes &amp; broadsides by Wend… Dear @PeteButtigieg thank you for this very good letter that made me cry. Let’s us keep trying our best at America. 🇺🇸 https://t.co/M3E0EenPMm RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/9EzN8oWJkC RT @deray: Hate speech encourages acts of hate. We need to be vigilant not to let islamophobia fester — not in homes, classrooms, public sp… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/aNE10tAnmO This should answer your question @robdelaney https://t.co/8gO64RBWzu @AOC Table saw Oh hello look at this cute af St. Patrick’s Day jazz \n@offerman_shop @GuinnessIreland \nhttps://t.co/k63yuvNJ8G @lindaholmes @KenTremendous My read on this: “Right on, more cake for Nick” 🤧 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/z64jsCti3d RT @GCLibS: Enjoy @sxsw by way of @Kanopy! @Nick_Offerman and @KierseyClemons star in director Brett Haley’s charming family dramedy about… Folks here is the latest offering from @BobByington in which I levy some narration - if you like fresh chuckles, make haste: https://t.co/HOIxygHmlO Here is a Cincinnati treasure to admire ✊🏼 https://t.co/enDqurPAbT @KenTremendous @lindaholmes We can settle this with opposing t-shirts Rohb y’ere a magnificent Clydesdale\n#BudweiserRewards https://t.co/Osg8u7Km69 RT @JesseFFerguson: https://t.co/6TbLWqdHRk A brief, powerful, important piece about addiction. ❤️ https://t.co/ojVrB8Gacm RT @MrGeorgeWallace: Shout out to @AOC. Errytime I turn around she's shakin' shit up and whatnot. @CharlesPPierce @tomecurran Frenzy - Screamin Jay @JPosnanski @tommytomlinson Oh, crap, this is like a whole thing? I never received the rules. However, I have 6 more books so see you tomorrow. #BookJam #JavyBaez #IsAGreatCub @rochelleshipman Pointless\n\nor Flashman or Cyril or Jeff I am uncertain of the proper comportment surrounding #bookchallenge but I will tag you my challenging friend @JPosnanski and I will subsequently challenge another admired pal @sarahkendzior \nIt’s #BookChallenge y’all! 📚🤓\n#GetBook #ReadThatShit #SmartUp https://t.co/3wPS1sln59 What I wouldn’t give to join this canoe trek in support of our Veterans’ health and well-being. Check out this charismatic adventure (paddling the Mississippi!) and toss in a few bucks if you can, please and thank you. 🇺🇸🛶❤️\nhttps://t.co/pYuoz7NVFx @neilhimself I am sorry to miss you there in general, but especially to miss a chance to collaborate on a whisker issue 😢 RT @realbrianhill: @JohnFugelsang @realDonaldTrump @LibertyU @SouthernBaptist @700club https://t.co/ymgn6Kc9jZ RT @GMPaiella: I went on a boat ride with @robdelaney, and wrote this profile. Hope you'll give it a read. https://t.co/zMebuLNomI RT @TheDweck: I’m no expert but it’s prob bad that every week the most batshit video you’ll see is of the President of the United States ju… @neilhimself Neil. Please don’t make me cry in front of @MJMcKean . My pleasure, and we can both offer thanks to @Canoecraft ❤️ 🛶 https://t.co/gFyGmrMMhU @tmbg Pace thyself. \nps My favorite thing about OZ was meeting the terrific mammal Echidna @GoodOmensPrime @neilhimself HOT DAMN @neilhimself I am extremely chuffed about this sublime casting @tmbg That is the straight dope, friend.\nHAVE YOU EXPERIENCED THE TIM TAM SLAM RT @elliottmmarsh: Please consider donating to help the victims families and those affected by the horrible shooting in Aurora, IL.\nhttps:/… @ilooklikethis Minooka RT @mbalazo: The 7 Basic Plots\n\n- man defeats uncle\n- balloon hoax\n- girls’ night out\n- Aerosmith \n- winning the lottery\n- food fight\n- unc… @AOC The Breakfast Club RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/oDAd8nNeIb Folks if you can spare a few bucks, here is a legit link to help out the families of the victims in Aurora, IL, just up the road from my hometown ❤️ 100% of funds go to victims/survivors\n\nhttps://t.co/mZoRtWTEFW https://t.co/ZY7StwnHgW @robdelaney I am a patient man. \nBut god damn you had better not fuck with my toilet tissue. Should you require a respite from reality, please delight in the medicine of two warbling deadpan champions\n@FloandJoan \n(thank you @robdelaney )\n\n Flo &amp; Joan: Lady In The Woods https://t.co/RiPX4Yxj1e via @YouTube @robdelaney That tears it.\nThis cannot stand.\nAddress please, I will burn it down. RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/XaFs5oXI2M @Toby_BVB Solid service, Toby. Cheers. Please @MeganMullally can we do a shot for shot remake 🤠 https://t.co/gTLLupqjVC I know, Bill, I wish our whole country could just be creepy grandpas. That’s class. ☹️ https://t.co/WVJs6zAtbd @Venomoussnake45 @kingsthings My pleasure\nI feel strongly about it\nLet’s kill the outdated sensibility that crying isn’t manly\nThe guts &amp; vulnerability to display one’s emotions honestly strikes me as a much more accurate definition of “manly”\nSuppressing one’s emotions, fearing castigation, seems cowardly RT @KenTremendous: \"It's flattering,\" said the grown man and longtime U.S. Senator about getting phone calls from the man whose power he is… @Venomoussnake45 All people should feel free to openly cry whenever they feel like it, and also maybe don’t take emotional life advice from a comedy character.\n#My2Cents @kingsthings RT @MatttDavies: Not just #OscarsSoWhite https://t.co/dVoM9aLh0b https://t.co/Fi4Rzp0M6T Goddamn this is a sweet-ass burn https://t.co/FZmIaJnVO1 @MatttDavies Tik Tok sits astride his ottoman, eyeing the cardboard on the floor with a hope he dare not name, whilst Jam On It wikki-wiki-wiki-wikis away @neilhimself @amandapalmer Persuader RT @birbigs: This video really captures Brody’s magic. I’m writing that knowing that he would make fun of me for writing it. So be it. He w… RT @PFTompkins: This is important!  Don’t just put it on people suffering to reach out. It’s not always that easy. We gotta take care of ea… @Catboy92 Thank you kindly, I am so grateful they put me in it. I am drooling already at the prospect of some barbecue when I come to play my new songs at @MoontowerComedy fest 🐮🐷 \nHit the link for schedule and the lineup and whatnot 🇺🇸 \n\nhttps://t.co/Slbcle662Y RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/scUa8uDERH RT @robdelaney: this is where I start when I make love to you https://t.co/YVZ55H2wPp RT @feministabulous: Funny how one rich white guy in the white house lies every single day and no one ever says it means we’ll stop believi… RT @hodgman: Uh, the line up for @SolidSoundFest just came out and, uh, wow. Wilco and Clipping and Ohmme and so many others. Even though I… RT @Ticketek_NZ: Award-winning US actor, writer and comedian @Nick_Offerman returns to New Zealand for the first time since 2016, with his… JF has here penned a brief but flavor-packed four course repast as yet another gift for us 🕺🏻 🎶❤️ https://t.co/tAlsfFL82b RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/lJkbSyRpEe RT @rhettmiller: One of the first poems I wrote for this collection, “My Pomes” features an entirely unlikeable narrator, so is clearly NOT… Here is an extremely charming video featuring the bodaciously talented @JordanGavaris from #OrphanBlack and the crew of @WouldWorks1 \n@offerman_shop \n\nhttps://t.co/lwmBUSKbFM Goddamn @twittels you would be having a field day with these dipshits\nWe miss you sweet Harris Wood Sagacity ⁦@lostartpress⁩  https://t.co/lsJ473VZAq Please let me back in the house? https://t.co/RoUQTKs0dD @Catherin3Kovach Indeed @JPosnanski IS IT ME? @KenTremendous 😂 Nick Cave is a true wizard. https://t.co/UB3TC9jyNc RT @ACNewman: We’ve been hearing a lot about Ryan Adams, but did you know that Rhett Miller did a private concert for a fan that was dying… RT @jameelajamil: Tired of all the lies told to women to make them feel inferior. ☹️ Women *made* all the fuckers who grow up to prey upon… RT @TheLEGOMoviesUK: The Man, The Myth, The Beard! @Nick_Offerman is MetalBeard in #TheLEGOMovie2 https://t.co/T4qeRCn0tO RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/Kd4GgmgDoK RT @neilhimself: Best headline ever. https://t.co/Pdle61WtsN @chrislhayes Chris just please be careful, there is apparently an emergency somewhere down there RT @PatrickRothfuss: It is traditional to give flowers, but there are no flowers in winter.\n\nInstead, I, your Winter Boyfriend, bring wood… @ConanOBrien I believe the Farmers Only app is called “Attractor” Manchester is calling you to my side @MeganMullally please come and see me at a #PrivateShop so I can show you my new trick! ❤️😍🥰\nWILL YOU BE MY VALENTINE? https://t.co/JoKwbRPcPU RT @nadias1977: What do I wear in the makeup bus?? Only a @Nick_Offerman wood shop apron! @offerman_shop https://t.co/vRZ1GH3hxs RT @robdelaney: Lot of fucked up shit happening in the US govt but it’s pretty amazing to be ferociously inspired by @PramilaJayapal one da… RT @CriticalPopcorn: Excited and delighted to confirm that the highly anticipated Prime Original series #GoodOmens will premiere on 31st Ma… RT @LiveNationOzNz: You may know him as Ron Swanson, the man that captured our hearts in Parks and Recreation.😍 Comedian and actor, @Nick_O… @lindaholmes @KenTremendous @JPosnanski @Cubs Thank you kindly. @JesseThorn @KenTremendous @JPosnanski @Cubs My thanks! @AndyRichter Word. RT @StephenAtHome: It's the biggest public display of original Tolkien material for several generations! Get a sneak peak inside \"Tolkien:… This is a great privilege for me, and I am only allowed it thanks to my friends @KenTremendous and @JPosnanski ⚾️ @Cubs https://t.co/lieqmabxY0 RT @MatttDavies: Story in @Newsday this weekend detailing the life decisions young people are forced to make when already burdened by massi… @nadias1977 @cbmacademy Is this good Niall or our Niall RT @RobGMacfarlane: “Heartwood”: a tree’s heartwood is its innermost core. I wrote this poem (song, charm-against-harm) for any tree anywhe… RT @scullymike: I appreciate when singers point up when they’re singing high notes so I know what’s happening I’m with you. https://t.co/jMIhnV4nSS RT @pitchfork: Laurie Anderson (@OnlyAnExpert) just won her first Grammy #Grammys https://t.co/zmpvLLVIMs RT @NonesuchRecords: Congratulations Laurie Anderson (@OnlyAnExpert) &amp; @KronosQuartet, #GRAMMYs winner for Best Chamber Music / Small Ensem… @SundayBrunchC4 @robdelaney @Channel4 @MeganMullally 🤝 @robdelaney @SundayBrunchC4 @Channel4 Um can I be on that show 🥩 @theravenk1ng My vague knowledge of British trees would offer up oak, ash, maple, plane, beech, birch, alder, cherry, hornbeam...I’m sure there are many more with which I’m unfamiliar. Flattered af https://t.co/VVHb0Zgy79 Oh glam dang this is the hot ticket folks. @BobByington shoots and scores as is his wont. ✊🏼 🌽 \n@sxsw https://t.co/FzIEGrILF5 @JPosnanski Poodle. I admire the ever-lovin heck out of @Trevornoah 🙏🏼 https://t.co/OUWlq4wtHm RT @MatttDavies: The Historian https://t.co/dVoM9aLh0b https://t.co/XmhuQkL3lm RT @robdelaney: It should be safe, legal (&amp; local) for women to get abortions &amp; my taxes should pay for it.🐏🦚🏌🏼‍♂️ Haha!! What a pleasure `twas to be pummeled by America’s sweetheart. My tummy still hurts every time I see a casino 😬#SandyBullock @ReginaKing @AbrahamBenrubi @WilliamShatner 🕺🏻👊🏼💃🏻 https://t.co/HnkgeqszEz “This time around, it is more different, than it has ever been before.” - The Stinch https://t.co/Q75n341Yr0 Dibs on @stinchfield1776 if I get to do @nbcsnl this year. Priceless. His straight face is 🔥 https://t.co/SMwnlhwEKI RT @nadias1977: Whatever people say I am, that is what I am not. Goodnight Albert ❤️ https://t.co/kJj6nEBrIp RT @SXMInsight: ICYMI: @JohnFugelsang asked Nancy And Beth performer @MeganMullally about the band's name &amp; wondered aloud w/ renowned cons… EVERYONE’S FAVOURITE \n(everyone who prefers slow talking and genteel dancing) https://t.co/bfGh9M9l7e Here is a great post of warning from finishing guru Bob Flexner - if you use any wipe-on oil finish, spread the rags out to air dry to prevent spontaneous combustion ⁦@offerman_shop⁩  https://t.co/Gkp5w8mnyv Same https://t.co/m7KrRghtye RT @DrunkestLibrary: Today a 90 year old man was telling me how everyone he has ever known has died, and now he wants to die too, and that… Signed copies are sold out (for now)!\n\nPlease patronize your local independent bookstore in the meanwhile, as they could use that filthy cabbage. 📚 #Copulation https://t.co/nZB4uV4ofe If you happen to be casting about for a romantic gift this February time, you could do worse than THE GREATEST LOVE STORY EVER TOLD, a volume of love and giggles by my famously excellent wife and me, a capering donkey.\n\nSigned copies here, while they last: https://t.co/1HImU37wm8 https://t.co/FU01WsF6J0 @gohogsgirl ✊🏼 Damn straight, Thorn King. https://t.co/YrTbHgZHIc RT @MeganMullally: hey! our book The Greatest Love Story Ever Told is nominated for an Audie Award for Best Audio Book in the Humor Categor… @g_michaud17 Good Clean Fun, by this humble correspondent, is a goddamn ripping good woodworking book.\nAlso if you can find a local slab sawyer/handler, the table style of George Nakashima might be a good place to start. Good luck! @JPosnanski 😍 @Hungrypunjabi Yes. RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/v0f8gS6tJN RT @MarkHarrisNYC: You bet your ass Sam Elliott knows where the camera is. https://t.co/sBUWbkQP64 @KenTremendous 😐 RT @LiveNationOzNz: 🙌 ALL RISE! @Nick_Offerman is coming back to Australia and New Zealand!\n \nAustralia 🎟 Optus Perks 48-hour exclusive pre… .@MattOfferman https://t.co/ph7aF8kjtH RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/eXPjcjBIBo Good gravy. Here is the full length vocal slam dunk from @MeganMullally on last night’s @WillAndGrace - it will be on YouTube for only 7 days, so hop to it 🐰 \nhttps://t.co/RyYVaFeLMw RT @prattprattpratt: A 92% on rotten tomatoes is very hard to get!! This is a big deal for me and the hundreds, if not thousands, of other… RT @RichNeville: Found something new to say when I leave a room. https://t.co/FzkCVjuQBn Dear Australia and New Zealand,\nI aim to see you in June with my new tour entitled ALL RISE. I am given to understand it will be rousing.\n(sweet-ass poster by @MatttDavies ) https://t.co/hBRR5OobSa Oh snap (your fingers substantially to this slow jam of pleasure) https://t.co/ex1HrsQjbP @JPosnanski Once I discovered Nipsey, I then came across Bill, Keri, JaMarcus, Jane, Kurt, and of course, Cam. I follow all Russells, it’s an obsession. @JPosnanski That was my guess. Here is a couple to admire. https://t.co/iAW9G19t6p RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/EGhuVQW7Ce @RogerDColby @MrJLSimpson I am sincerely flattered. You may thank my Dad for the scarcity of prurient words as compared to my delightfully filthy first book. RT @leahmcelrath: Deeply moving — and funny.\n\nThese remarks by UK MP @jessphillips are worth 1 minute and 48 seconds of your time: https://… Friends here is lovely work of sculpture from my pal #danielwheeler for any impending love dates\n\nhttps://t.co/yIdfoB0GM8 https://t.co/Cvtw9Yh4ds @MrJLSimpson My pleasure, friend. Thanks for reading 📚 @jonahray @kumailn @meltdown_show @FIDLAR @MartinStarr ✊🏼🕺🏻 @kumailn @meltdown_show @FIDLAR @jonahray @MartinStarr Damn that is delicious and my boys Elvis and Max look so 🔥🔥🔥 Hey get ready to have your clock (ears) cleaned (pleasured) by the champion of showbiz https://t.co/QlaKaXs3vy Oh shit if that’s how you cast, I share a birthday with Peter Lorre and Col. Tom Parker! I am Union. @GhostPanther https://t.co/Ee4VDUUdzJ @EdButWithAT @HeyItssCorey It’s in there, just trim 5/8” off mine This is excellent.\n\nAlso, @KenTremendous I now really wish we had done that Jeremy Jamm tracheotomy episode ☹️ https://t.co/imntjhJnth RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/LhSBjjQ8rp @neilhimself @amandapalmer Let’s all just take a deep breath here 🧦❤️🧦 You must be doing something right, @AOC ✊🏼 https://t.co/NeRELTiZj1 @nadias1977 On board 💯 RT @sarahkendzior: Very good that they chose Abrams.\nVery good that the focus is on voting rights.\nGood choices here, Dems. Carry on. https… Love to engender romance and illuminate your love nest?\nTHEN YOUR LUCK IS SOLID\n\nWoo your mate this Valentines Day and lend a hand to folks who have not been so lucky \n@WouldWorks1 \n\nhttps://t.co/mNH3OQBwCU RT @ClueHeywood: Love putting my Peloton bike in the most striking area of my ultra-modern $3 million house I deeply enjoyed a visit to @TheJohnRylands library in Manchester, England - rife with astonishing stone and woodwork, plus a few books and such 🤓\n#HistoricWhizzPalace https://t.co/APkOHHRadF RT @prattprattpratt: CRITICS ARE LOVING LEGO MOVIE 2!!\n\nI had a feeling they would!!! Impossible to imagine but it’s even better than the f… Here is life wisdom from @nrhillerdesign https://t.co/LfkdowkTCg RT @MeganMullally: in 2019, let’s focus on justice. join me in becoming a founding member of @shaunking’s new all-access pass to the storie… We are always grateful when our medicine is efficacious \n👩🏿‍⚕️👨🏾‍⚕️👩🏼‍⚕️👨🏻‍⚕️👩🏻‍⚕️👨🏼‍⚕️👩🏽‍⚕️ https://t.co/XZpAnUIwzN @RobGMacfarlane @LindaJCracknell The Hop Gorgeous https://t.co/PVz2sb9dEs RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/h7QVqRfqwu RT @EricLabRat: I can't believe we live in a world where a teenager— any teenager, good kid, bad kid, debate team, burnout, rebel, dork— wo… RT @JohnWing5: Not nominating The Favourite for makeup and hair would suggest that the Academy members didn’t see it.\n#oscarnoms I asked my mate @herdyshepherd1 to mask his jawline so as not to completely unman me 😍🐑 🏆\n#Cheers #Mate 📚 https://t.co/IsqXTvpNHP Been a long time since I enjoyed the startled eye-darts from my fellow commuters on account of my boots lovingly slathered in #SheepShit\n@herdyshepherd1 @VirginTrains #VirginTrains @BlundstoneUS #SomeMudAlso https://t.co/IfvuiMxG3O RT @RudeMechanic: Different Linseed Oils Tested - Surprising Results! https://t.co/NGckz9APFu #woodworking #feedly RT @clarkvalentine: One of the things I appreciate about @MythBusters and @donttrythis is treating traditionally coded feminine skills of f… I would absolutely go see these 2 bow tie jockeys if I could. #comedyandcomportment https://t.co/1OFBgU1bZo RT @robdelaney: Sinead has always been my hero &amp; I knew Kris K was amazing but I didn’t know just how amazing👇🏽👇🏽 https://t.co/kInPaWAoGV RT @yokoono: WOMAN POWER!\nlove, yoko\n\n#WomensMarch2019 #WomensMarchNYC @WomensMarch https://t.co/nJxSzv9Z54 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/9VW9UJQVna RT @AndyRichter: You’re the Vice President.  She’s the second lady.  You work for the American people.  All the American people.  Even the… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/Ax9YDEjFHg https://t.co/Y1UPz2tMOU This podcast is vital, and also a great opportunity to check out how Patreon works. https://t.co/h9k3HNzHxY RT @rmennies: “Doesn’t everything die at last, and too soon?”\n\nMary Oliver: https://t.co/KumCX5vfL6 RT @donttrythis: Do not throw your batteries in the trash! Hell yes, @bkheel1 make mine the P Funk! (please and thank you) https://t.co/lC9C7MkvPZ @KevinPerot Precisely the point, Kevin, that the 70% marginal tax rate will affect a tiny number of Americans, not including you and me, which is what makes @ScottWalker a disingenuous worm Damn fine thread\n“Our caring, our empathy, our kindness, our creativity, and our connectedness are what will ensure we get through this with our humanity intact.” https://t.co/AdtAVlSyAx You scurrilous, misinforming dipshit. Lemme fix this for you:\n“Imagine if you did chores for your grandma, and she gave you $10 to add to the $10 million you have already earned. When you got home, your parents took $7 from you.”\nThe students said “I earn over $10 mil? Sweet!” https://t.co/DyIcrSsmms RT @JohnFugelsang: If you're a man who's outraged over a Gillette ad that encourages men to not be horrible selfish pricks PLEASE let the r… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/RrB7MYo1w1 Count me in for this positive creativity. @donttrythis 🔧 https://t.co/5lWKFi40PN RT @neilhimself: It's astonishing how right he was. This is from 1999. https://t.co/lXhIKbTd1V TERRIFIC QUESTION https://t.co/xmN3rA6S8O RT @robdelaney: Just worked out harder than most of you will in your lifetime (not a big deal for me) and easily farted 1800 kilotons of mi… RT @BeanPhilosopher: Dear @LidlUS \n\nMy name is Bean. I eat peanut butter and jelly English muffins for three meals a day. \n\nBack in Februar… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/MCdNqdcL08 My quest has brought me beneath Thomas Graham Jackson’s Bridge of Sighs - commonly thought to resemble Oxford’s own Rialto Bridge but actually modeled after the mysterious Perineum of Arcadia #Scholarship #Freemasonry https://t.co/oBzmN0LJ0i This night #FitnessDads please meet me in Oxford ⁦@robdelaney⁩ https://t.co/0CieUv6Yny Kevin your histrionics are deeply embarrassing, only slightly less so than the Oompa-Loompa nodding along to your bleats.\n“These dems had better begin to take the emperor’s beautiful new clothes seriously, or so help me, Gladys!” \n@GOPLeader @mike_pence https://t.co/2txkO8aBYr Everything remains awesome in this regard anyway @TheLEGOMovie https://t.co/dkgA7o750K @MrJoeSterne Google it RT @onlxn: they got the boom mic in a posed photograph. fucking idiot legends https://t.co/5vba4BbMTN RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/6qp9SAPxpE @jbo_murray @dj_kc_darkside Keeper ✊🏼 Why do you make me giggle so https://t.co/AtA5RHWxSL RT @AOC: He’s almost got it!\n\nJust a few corrections:\n* Single-payer healthcare\n* Ending unjust wars\n* 70% *marginal* tax rate on multimill… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/etKerBnxe9 @sfinley32 @parksandrecnbc Building a project sounds better. RT @saintlukas: I see why @Nick_Offerman likes Wendell Berry so much. https://t.co/4PKQiEpGdS This is a great thing to do, here is good medicine delivered with vigor 😤 https://t.co/2LOf6xtJfC RT @AOC: “She doesn’t know what she’s talking about,”\nsay Republicans, who argued that healthcare costs the same as as unlimited calls &amp; te… @steveagee Fried Pork Skins be thine palliative, friend. RT @TheRainford: Please check out my latest article: \"Foundations: The Lasting Influence of Tage Frid\" in the February 2019 issue of #Popul… RT @yashar: I’m so proud of you for this @donlemon.  https://t.co/MYxtbsZndk RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/OYLnltj3Bj The majority would argue that it’s the motherfucker who has done the dishonoring 🇺🇸 https://t.co/fX0elssBbT RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/XMwyApIS0l RT @MeganMullally: thanks @bustle for including our book in your top 8! 🦚 https://t.co/dp8Su3ftj1 #thegreatestlovestoryevertold link in bio RT @MeganMullally: .@Hypable! i think we’ve got a crush on you. thanks for selecting our book as one of the 18 Best Books of 2018 and calli… RT @jackremmington: Ok I just experienced the nicest exchange with a stranger and think it’ll help to share: I was playing on the Mariah Ca… @Lin_Manuel @KenTremendous @evilhag @unfoRETTAble Magnificent Happy New Year, folks. https://t.co/z7EWeQ1naX I encourage you to read this brief and rousing treatise. 🇺🇸 https://t.co/sR0t5nWl2b is this a euphemism https://t.co/UywjUfq43a I wish you all a 2019 filled with good work that enlarges you, and keeps you from too much time in the pub, and of course, I wish you plenty of good love.\nFurthermore, you can’t beat the list of Neil’s wishes in the blog below 🕺🏻 https://t.co/NhQdCkjjzg 😍 https://t.co/taNeMxtoOQ RT @WendyMolyneux: New Year’s Resolutions\n1. Lose one thousand pounds\n2. Figure out this Elon Musk Guy!\n3. Shrek it out\n4. Break up Meghan… Lookit this charismatic pooch!\n#AdoptDontShop https://t.co/i4HK7m4oOD @RudeMechanic I will be sore as hell to miss this jam. Hats off, friends. @thejasonmasters This is a magnificent compliment. Please send her my thanks. @J_Glass_ it is. RT @robdelaney: Harry Connick Jr’s “When My Heart Finds Christmas” is the best Christmas album of all time. His *original* Christmas songs… RT @PlagueOfGripes: An apparition appears in your room, alongside a more successful looking doppelganger of yourself.\n\nApparition: \" - and… RT @philipoconnor: A CHRISTMAS CAROL \nThis night 19 years ago was the lowest point in my adult life. After six months in Sweden I had no jo… I very much enjoyed this Oregonian recording and not just because I am an ardent fan of @hodgman https://t.co/RmAz3bEHtP Earth Humans - check out my sweet makeover in #3Below on the Netflix station - my name is Varvatos Vex and I am doing my best to sound half as magnificent as @RealGDT ✊🏼 https://t.co/ModGWJGvch Paul seems salty he was made to come down from his tree stand https://t.co/GeWGlJs2Tm RT @NewsdayOpinion: Check out the best cartoons of the year from @NewsdayOpinion @MatttDavies \n\nhttps://t.co/7lhIN0CRyd RT @nytimes: In Opinion\n\nSarah Vowell writes: \"The consequences of impeachment are almost as unpredictable as the crap shoot that is electi… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/nFJWz4V0Gh Earth Planet, here is glad tidings:\nDreamworks #3Below has touched down on Netflix! That’s spaceship talk. I play a pugilistic character which means I like to deliver knuckle sandwiches. https://t.co/RHt5CR093v RT @UnionWorking: Hey .@BBHblacksheep , #Hollywood wants to have a word with you. You sure you can be competitive without any union actors?… RT @LagavulinWhisky: It’s the most wonderful time of the year… #YuleLog @Nick_Offerman https://t.co/YA4sbi1iwN https://t.co/podM7EIpFl RT @NonesuchRecords: \"This was an album I grew up listening to because my mum played it a lot. It's one of the most kind of trippy, viscera… I smile back at you. https://t.co/6E1FYueh2W Get your orders in by end of day Tuesday to guarantee these charismatic handmade objects in time for your stocking - handsome up your house and lend a hand to those less fortunate ✊🏼\n@offerman_shop @WouldWorks1 \nhttps://t.co/gzvhM2BKVG RT @ConanOBrien: Two of my favorite people stopped by to talk about fornicating in nature and revenge fantasies. https://t.co/9Po0LyBZOr ht… RT @offerman_shop: If you want your goodies in time for Christmas, place your orders by midnight tonight! \n#christmascutoff #saintnick #woo… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/ihn9VzfKd7 Hohoho this is genius 🥩 🌪 @prattprattpratt @KenTremendous @NBCMakingIt https://t.co/H4SQUzWR1n @MeganMullally Then may I please come back in the house? RT @MeganMullally: batten down the hatches 😊 @nancyandbeth https://t.co/XbhA7uGBxB RT @MeganMullally: excited to come to adelaide!! 😊😘@nancyandbeth https://t.co/eTmo8fGTtQ RT @neilhimself: It has come to my attention that there are people who have not yet seen this: https://t.co/dMEQCfjNH1\nIt's the official Go… @tmbg Well, that’s fair. Hilariously pleasing.\nWe mean to see you mutually gratified for the holidays.\n@MeganMullally https://t.co/3ZTBP0hmdB RT @MattOswaltVA: For the record, there were MANY girls who wanted to be my prom date, my mom will do a GREAT job! https://t.co/IcCETy5MWU Seems like great subject matter for a @tmbg jam? https://t.co/gA2TNyXvt6 @robdelaney @MeganMullally This should bless your beautiful hide!\nhttps://t.co/TBRuoBU3aH @Newportfolkfest Let me make a few calls. RT @iTunes: You gotta be brave before you can be good. \n@Nick_Offerman and @KierseyClemons will melt your heart. ❤️\nRent #HeartsBeatLoud fo… RT @robdelaney: Do my tweets OFFEND you? Is my “deal” too much for certain snowflakes on this site? Last I checked… I don’t give a crap! #M… RT @MatttDavies: Bob The Builder https://t.co/dVoM9aLh0b https://t.co/AWNG31qSmM @JeanGreasy @hodgman Well deserved! RT @sagaftraFOUND: Did you hear? @MeganMullally is going to be the host of the 2019 @SAGawards?!! We're SO EXCITED! \n\nBid to own a piece of… This episode of @nprfreshair is exceptional, with a savoury serving of @RichardEGrant whom I have admired and emulated since Withnail &amp; I 🙏🏼 👏🏼 👑 https://t.co/2ZcbXh9eJa RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/FN6N6AMViy RT @JPosnanski: And now, the final poll for who had the best holiday character draft on the PosCast. Who wins? A quality program. https://t.co/AxjZD0ikAK @BrianStack153 @TaruneToon Together we have stretched for the heavens 🙏🏼 @lindaholmes @KenTremendous @BMcCarthy32 @mikedicenzo @sepinwall @JPosnanski Thank you for my generous casting. RT @MeganMullally: Very excited to be hosting the 25th Screen Actors Guild Awards! 😍😍😍January 27 @tntdrama @TBSNetwork 😍😍😍 (now: will liter… Dear friends, you have until the witching hour on Sunday 12/16 to order your sawdusty gifties like a copy of \nThe Greatest Love Story Ever Told signed by @MeganMullally &amp; her donkey!\n(My other 3 books also signed &amp; available) @offerman_shop \nhttps://t.co/1HImU2PUXy I don’t believe we share a border with France, Dullard J. Trump https://t.co/nejxu4nC5S @BroBible I’m afraid you have bad information, Bro Bible. I was made to dress this way for high school “slave day” and you would never catch me near a frat house as they are not my bag. Folks please vote your hearts after hearing the holiday #Poscast -\n@sepinwall brought anarchy\n@lindaholmes offered violence\nI merely suggested #Jazz https://t.co/zNZJxsFYR0 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/W2ghCAJ0HW ‘Tis a privilege to contribute to meaninglessness #Yule https://t.co/5q9x2HCmXR @karleyyyjean Check out this savoury interview about an artisan near you. In Michigan you have an embarrassment of great kitchen woods - find your local sawyer and get to work. \n\nhttps://t.co/FsjdpYolJ7 RT @misterdominick: Just wanted to thank @Nick_Offerman and @donttrythis for inspiring me to make this myself. Nick's advice in Paddle Your… RT @JPosnanski: A great thing about Lee Smith getting elected to the @baseballhall -- he becomes the third player signed by Buck O'Neil (al… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/ifv9fnjsxg RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/iTcbWf1KyE RT @MatttDavies: Been chewing on this one since Saturday. https://t.co/dVoM9aLh0b https://t.co/79ERnxYvHD RT @AndreaChalupa: That feeling when you run for president because everyone at the White House correspondents dinner laughed at Obama's jok… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/IZsmeCueNE Look at this guy.\nI know, it’s not fair that the brain and heart behind @parksandrecnbc and @TheGoodPlaceNBC should also be this cute, but hey, kid, that’s life https://t.co/3fTjGFI3vz RT @Lin_Manuel: FORKING PERFECT. CARRY ON, @KenTremendous. https://t.co/yAEkol5QMu @wizgal Tickets remain available at the door, do join us please and thank you. RT @robdelaney: Apologies to anyone on the conference call who heard me unload my ham cannon @UIPD @uofibookstore 😬 7:30 this night\nFOELLINGER AUDITORIUM\nI shall reveal the secrets of the #SteamTunnels https://t.co/BK6GEfkah3 RT @FAAatIllinois: Don't miss Nick Offerman at the Virginia Theatre tonight and at Foellinger tomorrow! These performances benefit Japan Ho… Bitchin \n@JimmyDiResta @donttrythis https://t.co/v9QKFa2Ws8 @MatttDavies @simeonadams @RudyGiuliani 🚨 🚨 🚨 My fellow Illini - if you have not yet indulged in the deep pleasure that is Foellinger Auditorium on the quad, please let me be your donkey-like guide tomorrow, tuesday eve, with some very special extra tunes from Kris Kristofferson &amp; Laurie Anderson\nhttps://t.co/51GzFJOVLX #TikTok performing award-winning Loosey In The Sky With Diamonds\n@Beyonce https://t.co/r7WL9Jc0pZ #TikTok is my breakdancing name you will hear from my MFing attorneys @RudyGiuliani https://t.co/YaW3Ds3wpd #MAGAtorade https://t.co/vyF7ozHTi1 RT @JPosnanski: A lot going on, but don't want to let this slip through the cracks: Today is the last day to buy a PosCast Great Fruit Deba… RT @MeganMullally: 69 https://t.co/khEMWpEOah @KenTremendous I hate to see you mad. HOCKEY TALK: It’s almost time to drop the puck, Chicago! If you can’t make it to @NHLBlackhawks, meet me https://t.co/O2WZcS1zln at 445pm CST / 545pm EST #ad #lagavulin @robdelaney @robdelaney https://t.co/wRKDp3HH4K RT @Cubs: In honor of No. 9's birthday, we're counting down the top nine @javy23baez GIFs from 2018!\n\nWhat's your favorite? https://t.co/07… Chris Becksvoort is the greatest woodworker who ever appeared on the quality program @parksandrecnbc https://t.co/qBZ21RYppP @beingjuliavance I generally use no product but when I am sprucing up for a barn raising or cotillion then I favor #FolkPotions of Austin, Texas \nhttps://t.co/97a4i4UPUS Thank you @MattTheE for this inspiring and savory and moving read by @JPosnanski - if you like baseball or jazz or red dresses or ice cream, get this book ⚾️ 🍦🇺🇸💃🏻⚾️ https://t.co/E0KopIsZFd Good Gracious, sane and decent citizens, and also those few, sad pilgrims who eschew fruit pies, hie ye to https://t.co/wtk9LLSkyQ with alacrity - only 3 days remain to decide this weighty moral issue!\n#HotFruitPieForThisFellow https://t.co/Z4o0A1VqZk RT @Appalshop: Congratulations to Wendell Berry, named a 2018 Southerner of the Year. We’re not saying being a Kentuckian who supports Appa… Now casting Making It Season 2!\nBust out the pinking shears! https://t.co/R3QvPGrAX2 Friends, I am taking to the ice this weekend with my compatriots @LagavulinWhisky and @NHLBlackhawks. If you’re in Chicago come by Sunday 4:30pm for a dose of #mirth #ad @KenTremendous You had me reconsidering my deep love of hot pie (dibs on that band name) until you used the word “beef” in this section, and now I It all seems even more delicious than before #HotPie RT @KenTremendous: Thousands of people* have** asked for a more comprehensive understanding of my Hot Fruit is Disgusting stance. I shall p… RT @Cubs: Wishing the best of luck to Tommy La Stella! https://t.co/jOQA6VqSre I am given to understand that SIGNED copy of our mirthful love book #TheGreatestLoveStoryEverTold can be affordably had at Barnes &amp; Noble, a monger of books. @MeganMullally \nhttps://t.co/kodY0q6KUH @JeffLieber @PropMan_ Let’s please keep the instant potato incident between us. RT @nataliesurely: hear me out: maybe white evangelicalism is more of a cultural identity than a moral framework https://t.co/zZa1fmYOr9 @BIFA_film @nadias1977 @the_favourite You want my notes on here or in person \n\n(Haha someone just did a little pop-off! CONGRATS ON THIS KICKASS ACHIEVEMENT) @BillAdashH @jettila @altonbrown @testcook Find a local woodworker and commission a cutting board or cheese board from local timber\n@offerman_shop RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/h9Cv1NQT0P @IAmRandiJ @MeganMullally We were awfully sorry to miss you - hope your small nugget is feeling better post haste! RT @petersagal: If you go, Senator, you'll find that Hitler was installed in power by conservative politicians who thought they could use h… and I am schooled yet again by your generosity 🙏🏼 @WouldWorks1 @offerman_shop https://t.co/JO0sNe3cd7 RT @JeffTweedy: New song, new music video, new tour: https://t.co/gS0VWpyM9h (and a new album out Friday). - HQ https://t.co/QKGaTWDIFU RT @MichelleObama: For #GivingTuesday, the Global @GirlsAlliance asked young women what they're thankful for this holiday season—and how th… Here is some tit for your tat on #GivingTuesday @offerman_shop https://t.co/Eiz374jGdw @KenTremendous https://t.co/NP2cYMc8bC RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/w5D8a0cvt1 @lowellrsmiller @OnlyAnExpert @JapanHouseUofI I am always a fan of your good work. Thank you 🙏🏼 \nSongs by @keegandewitt and the soundtrack is available for purchase 🐷 https://t.co/IxauxhChc6 RT @offerman_shop: Today’s the last chance to take advantage of our “Get Stuffed” sale and treat yourself (or someone else) to some wooden… .@offerman_shop @katemicucci you are the best elf ever 👑 https://t.co/CDh62yo17R Central Illinois.\nI am playing 2 shows on Monday and Tuesday (12/3&amp;4) at the Virginia Theater and Foellinger Auditorium (a dream since seeing @OnlyAnExpert there in 1989) - all proceeds support @JapanHouseUofI - come and take some mirth on board 🤹🏻‍♂️🇺🇸 https://t.co/326BRzs62I @BottleneckNYC @LAFDFoundation @nerdist @markenglert This is pleasing! Well done you redoubtable citizens. ✊🏼 RT @neilhimself: Did I ever see the official video for David Bowie's Heroes? I don't know. And if I did, I haven't seen it for 40 years. So… RT @deray: Transphobia and homophobia kill people. Neither is funny or should be tolerated. RT @wkamaubell: Until men fully accept who we are attracted to, until we encourage other men to do the same (w/o judging them) &amp; until we l… RT @BottleneckNYC: Still have to Sunday night to pickup @markenglert’s Pawnee National Park Charity print! 100% of all profits will be dona… RT @donttrythis: All any child learned watching this is that love can take an infinite variety of forms. All of them beautiful. The most im… .⁦@Lin_Manuel⁩ is this that show u were telling me about https://t.co/6OgISR4YD6 Oh here is a cool sale in case there is any shopping going on - these products support American craftspersons and sustainable wood harvesting, not to brag 🇺🇸\n@offerman_shop  \nhttps://t.co/a0xCuTfJ3N https://t.co/70gINw901x RT @robdelaney: Flushing buckets of protein powder &amp; gristle down my toilet to get it warmed up for the main event. I cannot wait to don this one last meaningless shirt! https://t.co/qZYK2MCbRv I’m with FRUIT PIE IS DELICIOUS https://t.co/gwU2bftouj @Kyle_J_Morgan Truly the best Get ready for @TheLEGOMovie sequel!\n#MetalBeard returns! He is a wacky robot pirate that I play in this cartoon film! He is on the poster as well, albeit very tiny! https://t.co/s91DFSYSSO RT @nowhere2pacific: Still watching Look &amp; See: Wendell Berry's Kentucky from @IndependentLens + @PBS. It is absolutely incredible, beautif… Lookit this gorgeous way to support #LAFD https://t.co/L2RvwZcfu8 RT @RandyLudlow: https://t.co/G5OYQc7mp0 @MEH957 @JeffTweedy Me too 😭 “Farts, innit?” - Keith Talent https://t.co/fapE5B3HSi .@robdelaney can we please make this movie - it has everything 🎯 💨 https://t.co/JGNj8EH9Nk And thus my adulation perseveres. https://t.co/UzQ41CLseX RT @MeganMullally: .@Nick_Offerman and i got to do Press Play @kcrw with Madeleine Brand 🎀 it was a blast to do. here it is now! https://t.… You magnificent chanticleer. https://t.co/iOQ4j4FJYY @chelseaperetti plz keep it going 💇 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/u4yU1CKE2t RT @MeganMullally: best tweet! 🌿🌿🌿 i’m with you @yokoono you’re my idol 💛 1 2 3 #AntiBullyingWeek https://t.co/WyNty5o14R @EdBond07 I wrote the book, so I guess all of it Here is more medicine from the sweetest of wizards   🦊8\n\nGeorge Saunders: ‘A lot of my extended family are Trump supporters' | Books | The Guardian https://t.co/97ATDnL8JO RT @MeganMullally: i LOVE how uber-sitcom this photo is 😂 this is what we do for a living! 🎭🎭🎭🎭 please watch @seanhayes be extremely funny… Better play it by ear, we might have some rain ☔️ https://t.co/gibfUQDL3E This book is beautiful and now you can purchase it for yourself ❤️ 🎸 https://t.co/eRTjiWQbtU RT @PamKeithFL: ALL! This is NOT a drill!! Please tell EVERYONE YOU KNOW in Florida to check online to see that their Mail in Ballot was “T… @Sammytweedy Message received. Please read The Historical Illuminatus Chronicles and report back to me. I concur. https://t.co/mtZfUHlugm @KenTremendous Mike how many 3-point kicks is that RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/A85noDiIHa @lithub @ChetGresham All due respect, maybe just hang but let’s keep that zone Twitter free @EricSwedlund Yeah. 📚 What a guy https://t.co/g1Nw3EPLhC RT @ThePlumLineGS: 1) The explicit, openly-stated position of the President of the United States is now that a full vote count in the Flori… Agreed! I am grateful to have been invited. 🇺🇸🐢 https://t.co/jgmtrSEG2c RT @MeganMullally: .@Nick_Offerman https://t.co/vY0VlpzBUQ RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/Dfz2PrYHWU RT @MeganMullally: just fyi, i did #Grease in 1994, #HowToSucceed w #matthewbroderick in 1995, #YoungFrankenstein in 2008, and, in 2014, #G… RT @joshtpm: It's very important to remember. What's being fought over right now in Florida isn't a recount. It's the count. Immanentizing the eschaton \n@MeganMullally https://t.co/64oevTa90w RT @RBReich: Two weeks ago DeSantis told Trump on stage that if elected he would save his business \"a lot of money\" by negotiating with Eri… RT @kschwarb12: Thank you to all who have served our country. Your courage and sacrifice will never go unnoticed. We thank you all! #Vetera… RT @robdelaney: @MeganMullally @Nick_Offerman Happy birthday Megan! xx🏄🏾‍♀️🦋🤽🏽‍♀️ https://t.co/c1r7SpKJ6X RT @BarackObama: Michelle and I are heartbroken for everybody who’s lost so much in California, and grateful for the heroism of the firefig… RT @justine3202: @Nick_Offerman @MeganMullally Happiest of birthdays to a memorable, beautiful, and talented woman!! You're a gem and your… RT @PotatoForeman: Happy Birthday @MeganMullally !!\n(Full caption here https://t.co/AHL8LIzcaf) https://t.co/fqZzRyl0Ip Happiest of birthdays to my dance captain, my band leader, my entertainment director and the Queen of the Pixies! ❤️🧚🏻‍♀️\nLove of my life ⁦@MeganMullally⁩ \n#IfYoureBlue\n#AndYouDontKnow\n#WhereToGoTo\n#WhyDontYouGo\n#WhereFashionSits https://t.co/P2JlF2Hsom @josephsdsu @hodgman Shaky H the Boneyard Concierge Ugh so like the libs to try and inject negativity into your front row seats at a ritual race killing. Obv just a fun joke! https://t.co/GA37bjkeDs RT @MarqRobinson: I am at a Maxwell concert and do not have the time to shit on this but just know that I will. https://t.co/7SA57iqIXU RT @RBReich: President Obama delivers remarks at the Abraham Lincoln National Cemetery, Memorial Day, 2010. https://t.co/c9ym3ZRDWg RT @chrislhayes: The chief law enforcement officer of the US was a paid advisor of a company that scammed people out of tens of millions of… RT @MatttDavies: Go girl. https://t.co/dVoM9aLh0b https://t.co/dKzPSLWIAe RT @judymblundell: @MonicaHesse is, once again, saying exactly what should be said. https://t.co/MU97nIU7gp RT @LAFDFoundation: EMERGENCY UPDATE: @LAFDFoundation needs your help. We’re requesting donations at https://t.co/1G3X567piv to provide hyd… RT @Sifill_LDF: Listen I hope I can say this calmly and clearly. Trump’s insult of journalist @abbydphillip goes too far.  And I will not a… RT @nytimesbooks: “The Greatest Love Story Ever Told,” a collection of marriage lessons by comedic actors @Nick_Offerman and @MeganMullally… RT @AudraEqualityMc: Awesome https://t.co/srgiyUdjEh RT @sarahkendzior: Thread https://t.co/yLO6rfkEln RT @RobGMacfarlane: Word of the day: \"Ginkgo\" - from the Japanese \"gin\" (silver) &amp; \"kyo\" (fruit); one of the most distinctive of trees, the… .@KenTremendous https://t.co/Kgja2pvQDL RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/6FbEkPqiw2 Oh shit, it’s a #TapSnap https://t.co/IIG2aaWuR8 I wish I could see it 25 more because of the magnificence and whatnot https://t.co/4BeuQuUtBV RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/6ixNkcGSSU I love this book. https://t.co/3Jh017ebAI RT @robdelaney: Acting attorney general Manthew Winnaker thinking about number’s https://t.co/FDDlo27O0j RT @TheOnion: Inconsolable Jeff Sessions Tries To Commit Suicide By Smoking Joint https://t.co/j95gIVJRbz https://t.co/GONnRWRVMN RT @MatttDavies: Defenestration administration https://t.co/dVoM9aLh0b https://t.co/1L0aFKiqC3 Please pass it around https://t.co/GlghYAkwZn RT @donttrythis: It’s called empathy. It’s pretty cool. https://t.co/kPoaG6i20I 🇺🇸 https://t.co/D4bauc2mDM RT @KamalaHarris: RT if you’ve voted and want your followers to do the same. RT @offerman_shop: “The future of this republic is in the hands of the American voter.” - DDE\nDwight knew what was up.  There’s no excuse f… RT @JohnFugelsang: Those who expect to reap the blessings of freedom must undergo the fatigue of supporting it. Thomas Paine 1776 #Election… RT @kaltoons: It's that time of year. A still relevant 1999 cartoon from @baltimoresun #VoteToday #VoteTuesday #GoVote #ElectionDay https:/… RT @cjcmichel: \"By all means stay home if you want, but don’t bullshit yourself that you’re not voting. In reality, there is no such thing… @adamjohnfoss @JColeNC “Get Behind The Mule” - Tom Waits If you were thinking of not voting, what if you instead surprise yourself? Flex a substantial muscle you weren’t aware you have. Go now, vote for decency. 🇺🇸 https://t.co/JelOEcnfiO RT @YNB: Hey Los Angeles... tomorrow all buses and trains are free. So that everyone can make it to the polls. So PLEASE make it to the pol… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/4ZdXU7NzXu RT @BetsyforIL: .@Nick_Offerman IS WITH US! He wants you to vote tomorrow, #IL13. \n\nAnd students at @IllinoisStateU, @Illinois_Alma, and ac… RT @robdelaney: #California! Students &amp; teachers want @TonyThurmond for Superintendent of Public Instruction. Make sure to vote Tony tomorr… RT @axlrose: We have an individual in the WH that will say n’ do anything w/no regard for truth, ethics, morals or empathy of any kind, who… RT @sarahkendzior: You are not only voting for your own future. Your vote determines the future of others.\n\nIt will decide if your neighbor… @lushspiderarts Safest choice is @SawStop - finely and affordable, esp. taking into account the price of one’s fingers RT @JensenClan88: I have bad news for you regarding the President. https://t.co/w4wub3n9F1 @neilhimself The Ocean At The End Of The Lane = rapturous RT @ItsUnderstood: Good long piece from @sarahkendzior \n\"We will never be the same America; none of us are the same people we were before N… For the straight skinny on a regular basis, look to @RBReich https://t.co/pGedI0HWIZ RT @latimes: Nick Offerman is trying to highlight the value in slowing things down: “If you find the right hand craft it becomes a form of… RT @MeganMullally: our episode of @CarpoolKaraoke is now available for free on the Apple TV app! it will bring you a feeling of mirth  🚔🎤 @… RT @jeff_bilbro: This was on my front porch last night. Thanks to @KentuckyPress for the excellent work on making this book—which I’ve been… A solid message from 2 clear communicators, for the owners of Popeye’s chains and others:\nChris Rock &amp; Keegan-Michael Key's message to voters https://t.co/3cHQ3rPaXp via @YouTube Here be some poignant-ass cartoonings 🇺🇸 https://t.co/cXqhgFEL3e Here comes a nifty book/talk series which concerns a flavorful book called Twain’s Feast by Andy Beahrs\n🇺🇸 🦃 🐢 🍗 🐟 🍷😋 https://t.co/1yIsHtzZYK RT @MatttDavies: Channeling a little Chas Addams https://t.co/AbvotV7qZk https://t.co/egLfIogV2S RT @Ozzymoto27: George Clooney's response to @realDonaldTrump after he called him a hollywood elite is a great read. https://t.co/dif0dqdOmb RT @MeganMullally: hey! our book cover made @PasteMagazine’s best book cover list 🐞 i designed it, so... feeling pretty good about myself 😏… Some comforting news can be found in wholesome books like this one, which I have signed for you @offerman_shop :\nhttps://t.co/PLS1lmkeD0 RT @AndrewGillum: I heard @realDonaldTrump ran home to @FoxNews to lie about me. But as my grandmother told me — never wrestle with a pig.… RT @MatttDavies: The Enemy https://t.co/dVoM9aLh0b https://t.co/x2HldLSQJV RT @sarahkendzior: 1. The Central American asylum seekers don't deserve to be intimidated with force\n2. The troops don't deserve to be trea… Looking forward to this read. 🔨 https://t.co/nvUXhKZ0cm RT @Cubs: Congratulations to the 2018 World Series Champion @RedSox! https://t.co/LyKLNFRmW0 Time to #Vote gang. It is an absolute privilege. It is a responsibility. And in my house it gets you #kissed. 🇺🇸🌊 https://t.co/MSILmY36K6 RT @robdelaney: #California voters • Extremely recommend you read/share this piece on Superintendent of Public Instruction candidates &amp; the… RT @MatttDavies: https://t.co/AbvotV7qZk https://t.co/hCHGfi04WS RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/GK02UYugqT @sarahkendzior Thank you, friend. I would only kindly ask @AndreaChalupa to slow down and enunciate her name more clearly at the top of the episode, as well as her impending movie’s title. We need that intel. ✊🏼🇺🇸 Damn.\nWomen Rising https://t.co/QlPemLw6Bq via @YouTube RT @MeganMullally: New #WillandGrace tonight replete with ghostly visitations! 👻👻👻 @WillAndGrace 9/8c @nbc @Nick_Offerman is still recoveri… This podcast is excellent. https://t.co/ZI5PHzQKC1 RT @sarahkendzior: Thread https://t.co/Rso8fScRDo RT @JeffTweedy: Have you preordered Jeff’s memoir yet? Get a signed copied via @BNBuzz while supplies last: https://t.co/v726ok5HzT -HQ htt… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/UmtDA66XbT plus interest https://t.co/bzIhvQJ7e6 RT @MatttDavies: @Nick_Offerman @offerman_shop @santaclaus OWS pencil holder performs better than advertised. https://t.co/AF3flTzGoF RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/KaihVMFduN Folks, I invite you to delight in our brand-spankin-new website where you will find some chuckle-inducing fare and also some affordable gift items handmade by some awfully charismatic Americans 🇺🇸@offerman_shop @santaclaus https://t.co/gbcrLRfsQQ RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/d8DIhl3yvW RT @RobGMacfarlane: Copses, spinneys &amp; other small woods have Tardis-like qualities; their interior seems so much greater in extent than th… This is sure to be healing, LA tomorrow night. @WendellDaily @NotWendellBerry @twobirdsfilm https://t.co/0Igp8eBXjt RT @robdelaney: #California: I strongly recommend you get to know @TonyThurmond &amp; vote for him as Superintendant of Public Instruction. Tea… RT @glazerboohoohoo: Tombstone of two of the best breakdancers http://t.co/i1riSYFsOo very good https://t.co/JpAXJinAco RT @MeganMullally: #LOSANGELES!! get yourself together and get out to see this super dope event with smart, funny, courageous people who ar… Ed, that’s mighty sweet of you to say. We are shooting a season 2 in the spring, and you calling it a game show makes me feel a bit like Richard Dawson which I take as a compliment 🙏🏼 https://t.co/zUczfK4xI5 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/67OqCzcSLv .@robdelaney https://t.co/0iy1t9lpjm RT @DarrenAronofsky: as the 2018 midterms approach, more first-time voters than ever will have the opportunity to cast their votes and make… RT @KICKSEAT: The Kicking the Seat Podcast talks INFINITY BABY and beyond with @BobByington! https://t.co/widHGcsqkL Bonus points for Moustache-rubbed-off-from-friction ✊🏼 https://t.co/4NpRGgyCCN RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/r74EwsNHtz RT @SolidSoundFest: Hey Early Birds! your first (and cheapest) shot at tickets + camping for Solid Sound 2019 (June 28-30) will be Thursday… A++ https://t.co/5O8kJDHSu8 I have been simply enlarged by this ripping good story which also contains some crosscutting. Hats off, @clintonharp 🔨 https://t.co/vHCCQIlu6T Load. Blown. ⛳️ https://t.co/A5WhfVyGJa RT @MeganMullally: Karen must express herself https://t.co/XQjmCrwQAh Sick burn from simpering tit @piersmorgan https://t.co/Jy3aYdoSWU RT @Fred_Delicious: \"sir, can i ask why you're smoking TWO huge blunts?\"\n\"officer, I'm...\"\n*turns to camera*\n\"double jointed\"\n*cop starts b… RT @kathygriffin: Donald Trump Junior https://t.co/QOgfPlBy36 RT @eneevs: @kristenrudd Oh my goodness!!! I was just told there's a documentary on Wendell on Netflix! How did I not know this?\nCheck out… RT @RudeMechanic: New in Store: ‘Shaker Inspiration’ by Christian Becksvoort https://t.co/yVyrF51lOB https://t.co/VYkuxrUIaN RT @JeffTweedy: One month until the release of Let's Go (So We Can Get Back). Get it delivered to your doorstep on Nov. 13, preorder now: h… Damn fine. https://t.co/8IUmXxmuL3 RT @librofm: Listen to NYT-bestselling The Greatest Love Story Ever Told by the hilarious @MeganMullally and @Nick_Offerman! Buy the audiob… @tommyvv17 @parksandrecnbc @prattprattpratt @evilhag I’m so sorry for your loss, and grateful if we provided any comfort. ❤️ @WestEndBlueJays ✊🏼 RT @StephenAtHome: \"I can't wait for my stepsons to murder you.” https://t.co/tQ56Uvw2Ub My pleasure!  Typo fixed:\n“Families and communities are forms of art just as are poems, paintings &amp; symphonies. None of these things would exist if we didn’t make them. We can make them either well or poorly; this choice is another thing we make.” - the wisdom of Wendell Berry ❤️ https://t.co/ssyN18t4j6 RT @MeganMullally: guess who's back in town........... TONIGHT! 9/8c @nbc\n#WillAndGrace\n@nbcwillandgrace https://t.co/jiLmDoeqpw Well ⁦@MeganMullally⁩ &amp; I made a nice book for you (she did all the good parts) and now it is on a good list in the ⁦@nytimes⁩ ✊🏼#NYTimesBestSeller #YouWillGiggleAndSquirt 📚 \n#TheGreatestLoveStoryEverTold https://t.co/AkaOTTqEAW RT @DuttonBooks: Read an excerpt from @Nick_Offerman and @MeganMullally’s new book, THE GREATEST LOVE STORY EVER TOLD, about being in showb… RT @TheRaDR: What are things that you wish male non-survivor allies would keep in mind or do when they’re speaking about #metoo? Concrete,… @MatttDavies @unitedtalent 😡 @WensdaiAddamns @unitedtalent just joshin around buddy way to be on top of it https://t.co/qgr0yeQHO8 .@unitedtalent wtf https://t.co/prpyn5BrIX RT @annalappe: A new national fellowship just launched for those leading the way to a more racially just, healthy, flourishing food system.… Thank you kindly!\nYes we are a puzzle.\nAvailable at manybof the Barnes &amp; most of the Nobles @BNBuzz \n#PuzzleFever #CatchIt https://t.co/Zupk0FrrN2 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/bOJgF1OyDg RT @billmckibben: Probably just ran out of space, but you forgot \"break the political power of the fossil fuel industry.\" https://t.co/qImA… Here is a love letter that I wrote to my friend and maker hero @JimmyDiResta in ARC magazine. 🇺🇸🤸🏽‍♀️\n@lincolnelectric @LE_arcmedia #weldred @NBCMakingIt \n\nhttps://t.co/7Fcz4iyRGU .@robdelaney https://t.co/aOWrmPy6gF @chubbyewok https://t.co/PzmJfJv07U Me 3! #ThatIsAll https://t.co/QYqQqOsHne RT @MeganMullally: thank you, thank you x 1000 to books editor @JocelynMcClurg and @USATODAY for this lovely interview and show of support… RT @robdelaney: ❗️@WebMD https://t.co/cjpvFEp8ci RT @meganamram: https://t.co/n0ZnpP0Zux This dope art by https://t.co/8fMDDj7uzo of Austin, Texas Inner and outer #mood today 🇺🇸@offerman_shop https://t.co/7v39aTjyll For you Fox News adherents that remain on this channel:\nvia @sarahkendzior https://t.co/28qmSEkePs RT @sarahkendzior: \"Adults must fight this future for the sake of the youngest Americans, who have already lost more than they ever got the… RT @jenstatsky: conservative media loves to be faux offended &amp; rile their audience up when it’s a female comedy writer’s joke because they… @cparish7News @liamjmulvey @Jason08053858 @amazon @MeganMullally @BNBuzz For shame. I’m on it, thank you. .@DuttonBooks https://t.co/JX9DbYxiNh Um @amazon fix this bullshit and list @MeganMullally first where she belongs please and thank you. https://t.co/wE81mkvapr RT @wkamaubell: https://t.co/NQmhnENjIR RT @KatCalvinLA: Sending so much love and respect to the women screaming for our lives in the Senate right now. Another robust, free ad for @BetoORourke 🇺🇸 https://t.co/z24WTu4MjR RT @AsteadWesley: Kavanaugh will be the 114th Supreme Court justice in US History.\n\n108 have been white men. \n\nFour have been women.\n\nThree… RT @aparnapkin: women &amp; all survivors have been playing the long game since the dawn of time. it’s not over. https://t.co/NahA1hNSqD RT @WendyMolyneux: GOP: women should sit down and shut up.\n\nWOMEN: No. @johnrbrubaker Me too. 🇺🇸 @johnrbrubaker I agree it’s bleak but I am encouraged by the forward movement I have seen in my lifetime towards decency. Gay marriage, legal weed, etc.\n“Start a revolution” sounds cool but so does Libertarianism, and I believe both to be equally ineffectual as practicable policy. Peace, friend I believe we all have to cop to degrees of ignorance and bias, being human, but I will do my best to listen &amp; learn &amp; try.\nI will not take your advice to “give up because we cannot win”, as that is the attitude of a coward, my friend.\nYour rights are among the ones I care about. https://t.co/ExDBblI4BU Our government has today reaffirmed their stance that they don’t give a shit about women. We men need to remain vocal af about the fact that we do indeed care about and recognize and respect you women and that we will continue to fight for decency for all Americans. #BelieveWomen RT @onlxn: in addition to all the other evils we’re witnessing one of the most stupefying acts of entitlement of all time. Kavanaughwithdra… RT @nowthisnews: 'We all look at Kavanaugh and we see some similarities to things that happened in our lives.' — This man perfectly describ… RT @MeganMullally: just when you thought it couldn’t get any better! thank you @washingtonpost #rachelrosenblit for this wonderful review 😍… The straight dope: https://t.co/aqLOyJap86 @Super70sSports @RobLowe Thought this was @YasielPuig at first glance 😍 Ouch. https://t.co/FvMau0VFr8 RT @KenDilanianNBC: It may not happen in our lifetimes, but the idea that North Dakota and New York get the same representation in the Sena… Here is a great read about an hilarious &amp; medicinal program from an incredible team of good gals &amp; guys led by my pal/hero @KenTremendous (Mike Schur) of #Poscast fame.\n\n@JPosnanski @jenstatsky @TedDanson @IMKristenBell @meganamram @JoeMande @DarcyCarden @Yoplait https://t.co/XPOT0gOkVa @s_ittysmitty @MeganMullally I’ll tell him. Thank you (and her) kindly! https://t.co/zHAhbuWbpo @AjayMal29 @mckennawalters Goddamn that feels good. RT @MeganMullally: .@USATODAY we love you! thanks for recommending our love book 😍 we like it, too! 😌😘 (now available wherever books are so… RT @MeganMullally: thank you @Hypable and @britlovely237 for this fantastic  review! so glad you liked the book! ❤️ https://t.co/dVNaGAoLh5… STRANGE IS OUR BRAND\n#ILoveYou https://t.co/jBTvtkUQgb If that job came to me I’d bust out a random orbit sander, unless your slices are too small. A competence with a sharp block plane or jack plane would also satisfy. RT @talesofarcadia: .@Nick_Offerman joins the #3Below cast: Vex! #NYCC SEXY https://t.co/Emalp4lt52 RT @SarahKSilverman: So @SenatorCollins either thinks that THREE women LIED to their husbands and therapists and children about sexual assa… RT @neilhimself: In with all the Comic Con madnesses, I wanted to make a special point of linking to this. It's a powerful, moving and unbe… RT @amandapalmer: “MR WEINSTEIN WILL SEE YOU NOW” is a crowdfunded artistic battlecry made by over 60 women. today marks 1 year since the N… RT @mckennawalters: the auto shop told me to replace my cars bluetooth module the part and labor would cost $512 before tax... but ron swan… RT @MatttDavies: I deleted a previous version of this one due to a dopey typo 🙂 https://t.co/dVoM9aLh0b https://t.co/Udr919RW8Z RT @robdelaney: From 2014. It may make you throw up.  https://t.co/dJRzJV9sRB RT @robdelaney: I recommend reading this whole thing. She makes some very important points. https://t.co/hTlknA3LqW RT @onlxn: if annoying accusations by your political opponents cause you to abandon your moral compass, SPOILER: you don’t actually have a… RT @hodgman: A social media reminder that as terrible as the world is, jahnglayzer still is here for us. JON GLASER LOVES GEAR panel is tod… RT @davidhogg111: Please do yourself a huge favor and make sure you're still registered to vote and haven't been unregistered at. \n\nhttps:/… RT @chelseaperetti: THE FBI FINDS NO EVIDENCE, ALSO: WEREN’T LOOKING FOR EVIDENCE @biipolarbear_ @MeganMullally Oh no, we’re so sorry to hear that. No hard feelings whatsoever, and we hope you are feeling better. 📚❤️ https://t.co/i8YyA6vpe0 https://t.co/q0pX8Q1Jbv @TheBlakeRodgers Well thrown RT @aparnapkin: PRESIDENTIAL ALERT: he's still a sexual predator. byeeee. RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/ukX4bGwLhF The Cruelty Is the Point - The Atlantic\nIf you have professed to “enjoy the tears of liberals” please look into this well-written mirror to face the source of your pleasure. https://t.co/tMU9o4Fjd9 We salute you, Jon the Sequoia, and thank you for a great season. ✊🏼 https://t.co/JtnpUEq7au RT @MeganMullally: thanks @VanityFair you guys are classy, cute, and very tender lovers to boot xx ps this photo is EVERYTHING https://t.co… Folks, I found the app - it’s called get off your caboose and Vote them out in November. (or in common parlance, simply “Flush”)\n#VoteThemOut https://t.co/aEkesFDl6S @ericsilasking @BullshitMike90 @SportsSpecialEd @auntiebernice @joerogan Eastern Kentucky is rife with charisma and promise, despite the shitty hand they have been dealt @jack_belew Oh, but “blind hatred” is a great example of leaping to hyperbole - which I get, that’s what your government is teaching you. But it is not healthy. @jack_belew But Jack if it comes from Big Don how are we to know it’s not utter bullshit, you see.\nIt’s not really funny to have a joke in the White House but here we are trying to cope. Or tolerate. If you will. @ericsilasking @BullshitMike90 @SportsSpecialEd @auntiebernice @joerogan Friend, we are in agreement. I reiterate my applause for your gumption, and now your mom as well, and since I added a hat-tip to tool-users of all sexes, I have incited a storm of “hot” but simple takes. I meant you no trouble. @lowellrsmiller @_MATTress Me too, brother. @offermanwoodshop is currently 3 fellows, 4 women, and one gender-nonconforming, and everyone of them is a badass because you don’t need a gender category to #workhard @maayanvoss @MeganMullally @lenadunham @ArataniTheatre Totally real photo by @EmilyShur - we call this the FULL MULLALLY not a good color on you, fellas\n@gop https://t.co/HIiVozyGsH RT @lenadunham: I’m doing THIS tonight...WYD? https://t.co/dV4tCqxmOP Be not amazed. ‘Tis a magnificent tome. #Yggdrasil https://t.co/kw4Nwlf6wP Is there an app for when the president is the crisis https://t.co/gRbvZl3rFw This is a fine compliment, thank you. And actually, being decent is not really hard at all, but you do have to stick with it. https://t.co/3y0asALioc RT @Cubs: Congratulations to the @Rockies on their Wild Card win. \n\nWishing them the best of luck in the NLDS and beyond. https://t.co/ingf… Glad to see you doing good work but I’d be prouder if you understood that what you are doing is equally #womanshit https://t.co/sRPePZ5uML @pattonoswalt @TheFoxTucson Oh shit please cancel me like that next! I also think Lindsay Graham is a demon’s piss-nub!!! RT @pattonoswalt: dear Starmy pleas dont tell the newspapers people that my Dad put his skin bus in yourr night-pudding OK THANKS Eric Trum… @AndyRichter @chrislhayes Megan and I are doing a book event at the @ChicagoTheatre - I will be reporting the score from stage - last time this happened we won the pennant in ‘16 RT @AndyRichter: But seriously, go cubs RT @Sjonorama: Talked with the ever so inspiring Laurie Anderson on the phone, preparing for next Wednesday @LIVEfromtheNYPL at 7pm. Among… RT @MeganMullally: https://t.co/bDKqH8Vs6H RT @JohnFugelsang: Eric Trump is learning what we've all had to learn -  that paying off dad's porn star mistress isn't as easy as paying a… Check out m’bride whom I am privileged to partner 🐰🐷 https://t.co/EFDAuq3x86 @Wattyz @FallonTonight @MeganMullally Yes 🔊 @NickBlackhall You need some dope-ass featherboards my friend. Purchasable or easily makable -\nhttps://t.co/EY1haThPhd\n\n@offerman_shop RT @gracyolmstead: One of my favorite quotes from the Wendell Berry Q&amp;A—and also, I think, a great definition of what it means to be a \"con… You heard right. @MeganMullally  and I consider our marriage status to be: OPEN (always open to #Sling ). Many hands make light work 😉. @sling #ad https://t.co/oE9Wq0v8gL @robdelaney You are sincerely terrific. If my shoulders look even remotely extra this morning on @GMA it’s because they gave me this sexy-ass hanger.\nBless your generosity @michaelstrahan ✊🏼 RT @SethAbramson: (THREAD) The GOP claim that there's no corroboration of Dr. Ford's allegation that Kavanaugh sexually assaulted her is a… RT @marcmaron: satire sharp as a knife. perfect. good job @CH_Cartoon! https://t.co/wkAYTIKV8D @LindseyGrahamSC @jaketapper You might want to take a peek at the news, buddy. RT @scullymike: .@LindseyGrahamSC Only way out of this: \"You didn't let me finish. He should be President of the Universe!\"  You spineless… MVP @Cubs https://t.co/vq7bJET0Tm RT @AndyRichter: I know there’s a lot going on but please allow me a moment to say go cubs Los Angeles, California\nJoin us this Wednesday for an evening of ribald book talk and giggling. 📚🕺🏻💃🏻🧚🏻‍♀️🧜🏻‍♀️🧜🏼‍♂️ https://t.co/jjrK5VKXYO @MartinWhitman1 This is a common misconception that is explained well if you read the piece - guilt/innocence is not the issue (it’s not a trial), but rather the quality of BK’s integrity to sit on the court, a quality which is undeniably absent. @Potbelly @WouldWorks1 @brhoten ✊🏼 Here is a very comprehensive summation of why a lying sack of 💩 belongs nowhere near our judiciary. #BelieveSurvivors  https://t.co/v4fWwU51jP RT @AdamSerwer: A remarkable piece from @rtraister on women’s anger. https://t.co/YKwx0SIzoG https://t.co/OKnmBadc0a @Potbelly @WouldWorks1 On it, thank you! I am a fan of your provender. 🥪 🍖🇺🇸 Me 3! https://t.co/m7WOGbtjI8 Get on board with @WouldWorks1 to lend a hand to your neighbors who just want to work! ❤️ https://t.co/S1nTmHEtqJ RT @shaunking: Conservative white men currently control the House, Senate, Presidency, Supreme Court, and the majority of American governor… RT @WendyMolyneux: This pic makes me look like I’m in pain but I’m NOT in pain because I’m excited to do this pilot with @LizzieMolyneux @m… RT @MeganMullally: #TGIF https://t.co/YSa0gkNOK0 https://t.co/fumofKdOXd RT @MARIADAHVANA: Gonna talk for a moment here. Watching these hearings today, flashing back to watching the Clarence Thomas hearings, to w… RT @MeganMullally: we wore our own clothes for this one https://t.co/k7jdRznvis https://t.co/NxeVrqp9yM RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/2qxjlE2gIi RT @AaronFullerton: One of these is from today’s hearing. The other is a still from The Handmaid’s Tale. https://t.co/SXJ3d8XqAH RT @neilhimself: On a day like today it’s worth saying, I believe survivors. Men must not close our eyes and minds to what happens to women… RT @robdelaney: We’ve hit $100K in well under 24 hrs. That’s not enough. Have you given yet? This senate is the enemy of women, LGBTQ, the… RT @TheOnion: Orrin Hatch: ‘As A Father Of Daughters, I Don’t Give A Flying Fuck What Happens To Them’ https://t.co/vCxTUt2TlL https://t.co… I just gave. Ready the goddamn cannon. https://t.co/ABFpuLKyq8 RT @feministabulous: Never forget that Republicans made a survivor of sexual violence risk her life to tell every detail of the most trauma… RT @hatethedrake: “How DARE a woman deny a man ANYTHING!” -the GOP A mewling, perjuring, soft, white boy should be handed only his own ass, and no other seat.\n#BelieveChristine #BelieveWomen #BelieveSurvivors https://t.co/JN6esR9zEu This thread, thank you.\nBrett cried and tantrumed and Graham brayed at the inexorable, impending topple of the gop. We all see them and recognize the shame it casts on the American conscience.\nI am listening to and believing women and looking forward to my vote. #BelieveSurvivors https://t.co/ffeMuxhsTU RT @AnandWrites: The best metaphor of this hour. Multiple women telling their truths, and one man with power refusing to see their reality.… RT @MeganMullally: come see us talk about love and other things😍 https://t.co/PM7ziWHoyi @JimmyDiResta ❤️ RT @brianschatz: At the risk of being obvious it is extremely important that we vote these people out in six weeks. @chckmeowt Yes ma’am I made it for @JimmyDiResta 🛶 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/PxLvykIRyb @heartsbeatloud @HamiltonNYLib @amazon @jervislibrary Thank you fam! RT @KrangTNelson: a genuine question for republicans: this is your guy? lol That blows! Amazon, please remedy this error in the delivery of affection.\n@amazon https://t.co/dDA5oeh5hh RT @MeganMullally: hi! we’ve got these 5 book launch events coming up for your entertainment pleasure! see you there! #LA: moderated by @le… RT @StephenAtHome: Oh right...THAT'S why Trump never has press conferences. Folks our amazing @GaryPressy has played the rousing ditties that keep us roused at Wrigley Field for TWO THOUSAND SIX HUNDRED consecutive games!!!! 🏆🏆🏆🏆\n\nTHANK YOU GARY FOR YOUR ENTHUSIASTIC CHORDINGS!!!\n@Cubs https://t.co/8tFmMAxlJX RT @_juliannemoore: We call on Judge Brett Kavanaugh to withdraw his nomination immediately. We the people, regardless of political party,… Cutting tenons is a cakewalk in my sweet #SemiDress skips from @WhitesBoots in Spokane #ad\n\nI wore these out so hard over the last 15 years they rebuilt em for me 🇺🇸 https://t.co/hgqkXhb7Wd @MeganMullally @WillAndGrace Well, hello. RT @kristenschaaled: Retweet if you’re registered to vote! Ok, hear me out: this is like a trailer for a movie, but instead it’s a nice “magazine piece” for our “written book”, and instead of moving images with sound, it’s “words and pictures”.  They failed to point out my sweet @Whitesboots so I will remedy that today @MeganMullally https://t.co/EnzIlZlAGP RT @lannadelgrey: I finally finished covering the Cosby sentencing. On the train home, exhausted, I see this.                         \n\nAnd… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/EqKUsWvXgZ What @MrGeorgeWallace said. https://t.co/VjuylkWzeO RT @robdelaney: The Japanese word for fart translates literally to “beef whisper.” RT @RobGMacfarlane: Word of the day: \"glean\" - originally, to gather ears of corn left behind by the reapers after harvest; now, figurative… Here is a gift for us tonight. ❤️ https://t.co/L7flVQNacL @A_Johnson_Golf Don’t be ridiculous. I have heard this record and it is beautiful and new 🎸 #Warm https://t.co/RiFecgo63O Squee!!! https://t.co/RiFecgo63O RT @billyeichner: LISTEN UP! Watch what happens when MANDY MOORE, KUMAIL NANJIANI, DARREN CRISS and RANDALL PARK attend my therapy session… If every community had the generous creativity of an @Appalshop we’d have a lot less assholes in charge.\n@WendellDaily @Berry_Center @VP https://t.co/eBNgXx8Fou RT @DuttonBooks: From tales of tomfoolery to sizzling anecdotes, @Nick_Offerman and @MeganMullally’s new book THE GREATEST LOVE STORY EVER… RT @Wilco: Jeff's new album, WARM, is out Nov. 30. Watch the video for \"Some Birds\" now via @NewYorker here: https://t.co/ilEqlVlstg https:… RT @jonfavs: This is embarrassing. Don’t let it happen this year. Go to https://t.co/1Qp69nW5fw, make sure you’re registered, and make sure… RT @jilevin: \"One of the penalties for refusing to participate in politics is that you end up being governed by your inferiors.\" \n\n— Plato… RT @bergopolis: https://t.co/ZreQ2Hndyk RT @MatttDavies: Boys Will Be Boys. https://t.co/dVoM9aLh0b  #WhyWomenDontReport #WhyIDidntReport https://t.co/Yv4dIqEWhN Happy Anniversary to my beautiful bride and hero ⁦@MeganMullally⁩ - 15 years married after she gave me a 3-year trial period! \n#YouMaySayImADreamer\n#ButImNotTheOnlyOne https://t.co/0bk0VcqWC2 RT @iTunes: We love love! ❤️\n#HeartsBeatLoud is our Editors' Choice, get it today!\nhttps://t.co/srFTEyOXjk https://t.co/83gYunEEfM Thank you for this dose of affection on this day, of all days. Thursday. ✊🏼 https://t.co/lLm8WOEFJa RT @DaveKingThing: if pawnee had been in texas https://t.co/B5YuvXJA21 RT @brydoncoverdale: Roger Angell turns 98 today. If you haven't read his essay on what it's like to be in your nineties, you're missing ou… @WEarlBrown @pattonoswalt You made me feel welcome but the company seemed reluctant to shake my hand after that performance 🤔 @pattonoswalt Hahaa we look like we’re in Jr. High! Thank you sincerely for being so nice to me that week and allowing me to chant to Nyarlathotep with you 🙏🏼 RT @DaveKingThing: LET THE PUPPETS FUCK RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/zCytEhz45u @Cubs Hell to the yes. RT @AndyRichter: You really do need to read this beautiful sad piece\n“Henry” by Rob Delaney https://t.co/BC8DhgcK46 RT @iTunes: There’s music, drama, and comedy. It’s a \"comdramedy.\"\nRent #HeartsBeatLoud starring @Nick_Offerman and @KierseyClemons on iTun… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/5THxqc4DgN RT @robdelaney: Register here: https://t.co/4sqGC2eLQs RT! https://t.co/b0AhXTJCL3 Happy Birthday to the original #Superstar ❤️🙏🏼🏆 https://t.co/HhQomzYuwc RT @robdelaney: .@SenateGOP Male GOP Senators, huge opportunity here to pretend you give a shit about women &amp; be the first to say you’ll vo… Here’s a nice thing https://t.co/rPlnpew9ck @pattymo @alexqarbuckle me three @cookingwithmrc @GCPelementary @NBCMakingIt @smrtgrls @MrMillersClass2 @damasklove These are mighty impressive RT @robdelaney: Obv twitter isn’t the place for this thought but: I want to piss on &amp; smash racism/misogyny/bigotry/ableism/austerity. This… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/mxcIqMZJih DON’T WORRY ABOUT IT https://t.co/iRP52GxI74 RT @OldNatlCentre: PRESALE 😆🙌 Laughing Matters – An @IndyCSC Event ft. @Nick_Offerman on Saturday, 4/20! Enter the code BESTNIGHT to acquir… @friends_palm @MeganMullally Um. I think you mean actors from Will and Grace and Community? @chipgaines I thank you kindly and salute your pun ✊🏼 🔨 Oh, look, here is some good medicine in the form of love: HEARTS BEAT LOUD is now available on @itunes Get it now ➡https://t.co/oNyqX8oPDR https://t.co/1blL2IaN1Q Damn here is where you can vote for an extremely goddess-like comedy champion:\nhttps://t.co/yuzG7UNbKy RT @nancyandbeth: you guys! jazz times interviewed steph, petra and me when we were playing at the carlyle in new york this past may. check… RT @offerman_shop: “Even the smallest act of service, the simplest act of kindness, is a way to honor those we lost, a way to reclaim the s… .@joannagaines @chipgaines I admire your gumption, your elbow grease, and your marital tenacity, not to mention your commitment to ship-lap. Please give our pal your consideration, and good Lord you should taste her stuffing. Not a euphemism. https://t.co/qTkj4Q2TLm RT @MatttDavies: https://t.co/dVoM9b2RRJ https://t.co/AXFgUfK66g RT @robdelaney: My wife just asked me if I wanted to make love. \n\nNice try babe, not on 9/11. RT @JerryDunleavy: This cartoon from @MatttDavies says it all.\n#NeverForget https://t.co/mVm04ntNPE RT @donttrythis: This thread is incredible. https://t.co/MDApySHreM RT @MeganMullally: photo for Chapter 1 of our book The Greatest Love Story Ever Told 🌼 available for preorder, link in bio @Nick_Offerman @… Beautiful work from which one can feel the love caressing the room #WalnutLove https://t.co/T3WDRLZKtQ RT @heartsbeatloud: WHAT. ARE. YOU. WAITING. FOR?! You can buy #HeartsBeatLoud on all your favorite on demand services NOW! Get your very o… RT @yokoono: Imagine all the people living life in peace\nlove, John &amp; Yoko \n\n#September11th \n#NeverForget \n#911Memorial \n#ImaginePeace http… Not this time, friend, but I have delivered similar snack trays #Savoury #Filberts https://t.co/bV1ej6HNfZ @JPosnanski @ScottMichaux @KenTremendous I do have more thoughts on Field of Dreams RT @MatttDavies: (May apply elsewhere) https://t.co/dVoM9aLh0b https://t.co/qmkAbSysmd #BigBangBros ⁦@robdelaney⁩ ⁦@neiltyson⁩ https://t.co/G7ozGx6hGM RT @CancerSupportHQ: It looks like Ron Swanson (@Nick_Offerman) will be returning to Indiana to fund raise for @IndyCSC! \nhttps://t.co/Cnqs… RT @cbertramHL: Beautiful weather and draft horses--not a bad way for college students to spend the day. @lbblackford  writes about how @Be… @Sammytweedy word RT @MeganMullally: All-New Season of Will &amp; Grace Premieres October 4 @nbc @WillAndGrace don’t tell anyone, but i think it’s our best seaso… RT @MeganMullally: Front and Back cover photos for our book The Greatest Love Story Ever Told • link to preorder in bio 🌸 @Nick_Offerman 🌸… Hello, “this movie film will make you feel better” is my wager and not just because of TWO @JeffTweedy cameos ❤️🎸❤️ https://t.co/jFfhlVrVmH RT @ronnie_cummins: A handful of companies control American agriculture. Cory Booker wants to change that https://t.co/6zUYhBzJdQ RT @MeganMullally: here’s the cover of our book! it comes out October 2 and is available for preorder now, link in bio. audio book also ava… The magic continues 😍 🔨 https://t.co/3I74ACJXjD Gerry, the modern tool referred to as a jigsaw is indeed a handheld motor that powers a reciprocating blade via an electric cord or a battery. In the old days they called our modern scrollsaw a jigsaw, and those beauties were sometimes powered by treadle. https://t.co/zkoXJHz2cE RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/dno8FYyWS2 RT @hodgman: Seriously everyone. Let’s vote. Let’s all really do it and get our friends and fam to do it. It will be really great. https://… RT @jaboukie: fruit flies when i leave bananas out on the counter\n\n https://t.co/nLgiD4WqCW MAKING THE SKEG https://t.co/cRBtkuk1kh This evening will be more than worth the price of admission for the fulsome thickness of our #LoveMusk\n@MeganMullally @FranklinBBQ https://t.co/4ToGe4AoQA Here is a handsome growth in the right direction - a new crop on the acreage of Wendell Berry 🐴 🇺🇸 https://t.co/WlfcjOF1Ek RT @elakdawalla: In happy news, I learned today that https://t.co/4LOX16jmhy has made the entire archive of New Yankee Workshop available f… RT @peopleschoice: Vote for Will &amp; Grace by retweeting this post: #WillAndGrace #TheRevivalShow #PCAs https://t.co/DGZgrGBuXJ RT @peopleschoice: Vote for Will &amp; Grace by retweeting this post: #WillandGrace #TheComedyShow #PCAs https://t.co/j3ZAvIzWvB RT @peopleschoice: Vote for Will &amp; Grace by retweeting this post: #WillandGrace #TheShow #PCAs https://t.co/cEwyRpFPQv RT @peopleschoice: Vote for Megan Mullally from Will &amp; Grace by retweeting this post: #MeganMullally #TheComedyTVStar #PCAs https://t.co/Ad… RT @robdelaney: https://t.co/w5FyP4jDKS RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/8B19UNFKlt How about “always” heartthrob https://t.co/jHhgjMhVzd RT @robdelaney: Ripping the Nike “swoosch” off my favorite nursing bra before going to my custody hearing . RT @robdelaney: After a spirited night of lovemaking (both positions!) our bedchAmber smells strikingly of nectarine &amp; shallot chutney Thank you, Bob, for passing along this story of American #gumption https://t.co/w34diH7jg4 RT @TheDweck: Please, we must maintain decorum and proper order to ram through the Supreme Court pick of the rapist game show host before h… RT @jessunscripted: “The world becomes literally more wonderful (and wonderfully more literal) as soon as we are reminded of these relation… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/n9UAqrzsD1 Tune in tonight for the @NBCMakingIt finale 10/9c on the television channel NBC 🍄 https://t.co/8uZNiltzLa What I was hoping for when I joined Twitter https://t.co/iWGBTNfVR7 RT @NBCMakingIt: .@JimmyDiResta hammers out the perfect tips to help you woodwork it in the shop. 🛠💯 #MakingIt https://t.co/2TGDztAk3E RT @offerman_shop: Labor Day is a day to feast and party and a day to celebrate the blue-collar, the laborers and craftspeople who made thi… RT @_uraniax: evolution goes hard https://t.co/dvXilvBM5g RT @IronStache: Paul Ryan’s handpicked replacement, Bryan Steil, just released three minutes of silent B roll footage in hopes a right wing… RT @tmbg: Science is real. https://t.co/kaBzHeSX0D RT @pipersfarm: Never a wiser word @michaelpollan https://t.co/NWO1ZGLS5A Splendid. There is no greater treasure than a parental influence passing along creativity and elbow grease. It’s what makes @JimmyDiResta and me 2 Twinkies in a pack 🕺🏻🕺🏻 https://t.co/6QknH5i6z4 Never forget. https://t.co/lLD0DlaD2J This American publisher makes beautiful books that will fuel your creativity like a grapefruit moon https://t.co/zThVQw025g RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/AV9kqfqx27 RT @skylightbooks: Oct. 3 - our favorite couple, @Nick_Offerman &amp; @MeganMullally, will be at the Aratani Theatre for the release of their b… RT @sarahricc: I texted my boyfriend this question with absolutely no context @Nick_Offerman https://t.co/07rbqYzQOk RT @anjaaaa07: Listened to @Nick_Offerman’s Bedtime Stories for Cynics on the way to work this morning. Texted my boyfriend when I got ther… RT @Rschooley: Everything else aside, the fact that a President can’t show his face at the funeral of a prominent senator from his own part… RT @michaelpollan: Kudos to Senator Booker for taking on this critical antitrust issue. \"A handful of companies control American agricultur… The #BeefRevolution begins https://t.co/ecbKEw58EC RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/jJcQIVgpee RT @M_PF: Best. Welcome. Ever. \nThank you #BritishLibrary 😭 https://t.co/rsLWKIBqjD If I stumble not, it is only thanks to the trail you have blazed. https://t.co/SWAiHifndC RT @JeffTweedy: Jeff’s memoir, Let’s Go (So We Can Get Back), hits shelves on 11/13 but you can preorder it now. US residents can get it he… @DarkAndTwistyy_ https://t.co/vggq8jcLgx RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/p0vqRF6Iat Young Sandpaper https://t.co/VfirYEpxgx It was a sincere treat to appear on this, my favorite podcast. #Baseball #BBQ #Heaven/Iowa https://t.co/o4UzHRbysq This is gorgeous, thank you for thinking of me. #Kyoto #Wabi #Sabi https://t.co/PkEyIBHU1g This is an incredibly useful tool of persuasion known as the C-clamp, here cleverly disguised as the letter G. \n@NBCMakingIt https://t.co/FzqASvL1yL Thank you for this sustenance @LeeValleyTools #Norm https://t.co/ANfsrhzEsk RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/Is3zpFvs0O RT @KrangTNelson: SOME RANDOM ROBIN: tweet tweet. tweedley-dee\n\n1950’s SONGWRITER: holy shit RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/uztdjLpzku @MatttDavies 🙌🏼 I hope that is not a euphemism, you dandy sprite https://t.co/LT5k4KNNBq RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/hKzhQTcMw2 Ok now. https://t.co/Ve1R9O8eAz RT @deathsexmoney: On tomorrow's new episode, @Nick_Offerman tells me how he learned to talk about sex, his early days on @Nickelodeon, and… This night of Tuesday holds great portent if you like #Crafting \n10/9c on NBC, it’s called @NBCMakingIt #Savoury https://t.co/ZMG4uiBeKj @lindaholmes @JPosnanski Bull-puckey, Linda, you made me the guest I am today. 🏆 RT @NBCMakingIt: Screw, glue! 🔩 @JimmyDiResta has a hack that will keep your shop knit and tidy. 👏 #MakingIt https://t.co/V2LpadV9aV Here’s an idea https://t.co/Ofm6McrpxF @samplumber12 Aye RT @MatttDavies: Oh. https://t.co/dVoM9aLh0b https://t.co/XkKanoIDMv @steinotto If one can drive a stick we are all family I believe that would be an example of a Knock-Offerman https://t.co/WSpBaylC5k Folks I know you don’t shop at this store for truth but looky here - a good batch of it snuck through: https://t.co/7HecwWfyph RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/bSd2d5k8sI RT @MeganMullally: first all-nude book tour! historic! https://t.co/YFbYwDYr1W Dear Everyone, @MeganMullally my pixie queen &amp; I will undertaking a book tour to YOUR TOWN (if u live in one of these 5 cities) ❤️❤️❤️❤️❤️ https://t.co/yhCuKrdZME thank you for the nice plug ✊🏼 https://t.co/MFgwAsentq Ok gang here is a super cool item from @WouldWorks1 to delight your household AND do a good deed for some less fortunate citizens ✊🏼🇺🇸\nhttps://t.co/4byKuAzwX7 https://t.co/5xt6hrUVnk RT @NBSSboston: Why are you a maker? In case you need a reminder, @Nick_Offerman (actor, comedian, woodworker extraordinaire, and NBSS Boar… @DaveKingThing Duh. @DaveKingThing @andyserkis RT @MatttDavies: https://t.co/dVoM9aLh0b #FreePress. #FreeSpeech  @AAEC_Cartoonist https://t.co/OJEoqBvpy0 Welcome home. We missed you! https://t.co/mEsRUAIf0c #Burbank https://t.co/fwBzV3vui0 Don’t shave. ✊🏼 https://t.co/cj3fOLLn9e Refuel yourself in the disco-flavoured gyrations of @simondoonan #DaynaIsomJohnson of @Etsy @smrtgrls and myself on a nice show called @NBCMakingIt this night at 10/9c \n#ShakeItBaby #YouWontBreakIt https://t.co/XIPqwXt4VJ 😍 https://t.co/TExFJ7yhaW THIS DELICIOUS SET OF PAGES IS FULL OF SINCERITY THAT IS INCREDIBLY WELL  EDITED 😍 https://t.co/kpINeBucOO RT @MeganMullally: the faces of the crowd after grand slam to win the game by 1... last pitch, ninth inning... @Cubs https://t.co/1YqoK7xUBd Good Morning, here is your friendly @NBCMakingIt #TravelTip -\n@SouthwestAir WILL allow a random orbital sander in a carry-on, but\n@AmericanAir will NOT allow a 5” sander to board the aircraft 🇺🇸\n@offerman_shop \n#TheMoreYouKnow #ThatsOneToGrowOn💫 https://t.co/qpXt2TM1df RT @MeganMullally: #westcoast cuties! i’m on @JimmyKimmelLive tonight. #eastcoast: my deepest apologies. thank you to everyone at #kimmel a… More high-stakes glue sticks coming your way this eve with this gaggle of champions. 10/9c on NBC @NBCMakingIt #MakingIt https://t.co/I8rBuV0Z5O RT @latimes: On Wednesday, A24 will host free screenings of \"Eighth Grade\" in all 50 states and available on a first-come, first-serve basi… RT @HamillHimself: How about replacing it with someone who really earned it? Like @carrieffisher    https://t.co/f1XMXanpWP I applaud you.\nYou might also tie that healthy head of hair into a ponytail for added safekeeping from spinning machine parts 🤓 https://t.co/PB5ro7HvwV RT @NBCMakingIt: .@JimmyDiResta is teaching you how to make a tape rack that will keep you out of a sticky situation. 😏⚒ #MakingIt https://… RT @donttrythis: A beautiful thread. Thank you. https://t.co/KIgzpHn6tW I feel as though it’s all been leading up to this. Now if only @neilhimself would write us a tale of this bepetaled fellow 🌺🤞🏼🌸 https://t.co/ehU5qtJppk RT @boburnham: EIGHTH GRADE is now playing NATIONWIDE. We are a small independent movie that lives and dies off of people talking about it… @VinceGatton1 @sandymaxx I can get behind that, old friend. @untamed_skittle Fire This quality program premieres this night at 10/9c on the @NBC (National Butt Connoisseurs) https://t.co/2etzeqwZ4S RT @WendellDaily: There is much good work to be done by every one of us and we must begin to do it. Sam, I am told the later time slot is intended to offset the “unspeakably wholesome” nature of the fare ✌🏼 https://t.co/loMBgpC6YT A sincere privilege 🇺🇸 https://t.co/xR5jLJBb6i Here is a sober taste of the brand of tutelage you might glean from our new program @NBCMakingIt which premieres this night at 10/9c on NBC, an straight-up old-school television channel https://t.co/rd0OFZkZMH RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/sqb2s1Dltd RT @NBCMakingIt: .@JimmyDiResta is the leader of the hack. 🛠 #MakingIt https://t.co/B98ngjVs0g RT @NBCMakingIt: #MakingIt will *felt* hearts everywhere. 🤗💖 https://t.co/2U2eFhH1a5 #RoyUnderhill is a national treasure!\nAlmost done with his ripping good novel: \nCalvin Cobb: Radio Woodworker!\nBound in a gorgeous hardback from #LostArtsPress  @1snugthejoiner @RudeMechanic https://t.co/iqAFRMCZoy Thank you, Ryan. 2 tweaks:\n- I would spell it “Whisky” since I prefer Scotch (a forgivable misstep on the part of the writer)\n- my grammar off the cuff was not splendid &amp; I’d change “bespeaks the more care” to “bespeaks the extra care” or if near the Bay “bespeaks the hella care” https://t.co/6eVAM4wPdW Here is some stuff about good dads like mine and also a pic of me topless (trigger warning @DonaldJTrumpJr ) https://t.co/yZNEdoJElB RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/cVjtvVV3Xr Presenting: 8 champions https://t.co/XmT5tkpaH1 RT @latelateshow: It's your lucky night because we're giving you a 5 minute warning before the #LateLateShow with @DebraMessing and @Nick_O… I look like this tonight on @latelateshow with @JKCorden and @DebraMessing https://t.co/rLSBkdVVjQ #SpanxLyfe ⁦@robdelaney⁩ https://t.co/2uUiRhmJkI This is a fun sports team @Cubs https://t.co/TnN6pxs2hE .@BillOReilly https://t.co/NRW4stnF72 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/peXuiwOx9V @smartereveryday ✌🏼 @smartereveryday Dear Destin,\n\nThank you for your nice message. If you think that I would solicit any person’s favor through a means besides my honest labor, then it is you who have misjudged me. I believe a publicist for the film sent it without my knowledge. Enjoy.\n\nSincerely,\n\nNick Offerman This show looks fun and elucidating with my hero @JimmyDiResta - it premieres 7/31 on @NBC a television channel https://t.co/8vgWPstYGn Straight from the horse’s mouth https://t.co/Ds6b1Wq39c RT @hatethedrake: This is 🔥 🔥 🔥 https://t.co/DDs8elZgsG @seanrsears And then some Nice, nice work, but quick heads up - one of your goats appears to be a young human? https://t.co/N7u6l7hFoT Great to be near you again Sean https://t.co/gYufveYVUz RT @WendellDaily: The mind that is not baffled is not employed. \nThe impeded stream is the one that sings. RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/lpVizluj3k My cousin Brody is a hero. https://t.co/325FhrXAg8 @hodgman This is a noble knot. If you can add the #Bowline to your repertoire then please call me for a mischievous project. RT @rex_rexchapman: The guy who stood on a world stage and kissed Putin’s ass while trashing America has returned to lecture our black foot… RT @pixelatedboat: My favourite genre of article https://t.co/3MMPvYMPD6 RT @JohnFugelsang: https://t.co/m8L6FgeTTf RT @spencertweedy: Just one day left to bid on this private Loft tour for summer camp scholarships https://t.co/o6RLHmxHq5 @Wark27 ✊🏼 #MikeRoyko still got it, friend.\nGood truth from 1992:\n@JohnFugelsang @neilhimself @JeffTweedy @MeganMullally @MatttDavies @MattOfferman @VP @robdelaney https://t.co/1IQuAinGtO RT @KenTremendous: Everything in the world is terrible except this twitter thread, which is amazing. https://t.co/TjDXlEvS0G RT @robdelaney: Millennials! Let’s get this up at least to 69%. https://t.co/4sqGC2eLQs https://t.co/nubf7yO4KI This is awfully nice, shining a light on the temple of erudition that is @JapanHouseUofI , but mine were only 2 of the many generous hands that built the #Azumaya - including the members of @CUWoodshop 🍵 https://t.co/G9pWNvsnBO @robdelaney And I am thinking of you from the wilds Of #Manitoba with my husky brother’ s Boombox and Uruk-hai https://t.co/SwgnreHTad RT @JohnCleese: Apology\n\nWhen I mis-typed 'dong', I meant 'not doing' RT @JohnCleese: An apology.\n\nWhen I implied that President Trump is  vulgar, inflated, vain, boastful, ignorant, sleazy, and common as muck… RT @MatttDavies: Ever vigilant. https://t.co/dVoM9aLh0b https://t.co/Xi4GpDT3k7 RT @flyingbadger: @neilhimself Hey chap, any chance of a signal boost for the awesome Jon Schnepp (you may know from Metalocalypse or the r… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/iPFMq6stUT You guys like cute goddesses? CHECK OUT THESE APPLES. https://t.co/Mzv5uIG6a0 RT @MeganMullally: i guess we’re pretty awesome https://t.co/BkIctHKcbq RT @MeganMullally: this is the best record i’ve heard in a long time @MilkCartonKids #allthethingsthatidid https://t.co/HPafmRWWfB RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/iDVAqmY6Mx RT @Tony_Robinson: A small tribute to the Pink Floyd. #TrumpBabyBlimp #TrumpVisitUK #TrumpProtests https://t.co/EhXrDIxQhT RT @pattymo: Great shot of President Trump meeting Queen Elizabeth. An historic moment https://t.co/qX6EHxCLiV RT @evilhag: londonnnnnnnnnn!!!! #TrumpBaby https://t.co/5P8rPQ10uf RT @JohnCleese: My American friends are asking me about President Trumps’s observation that the British ‘like him’.\n\nI regret this is quite… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/11lexOF3Qx RT @KrangTNelson: everyone in the trump family is Very Bad At Standing but donald jr is easily the worst https://t.co/bJFhQKH8Id This beautiful film from @boburnham  made me cry love tears https://t.co/91S4UH7yyX RT @MatttDavies: Inspired by something my friend @janesports said. https://t.co/dVoM9aLh0b https://t.co/qztLXUGpoY RT @joeyryan: Excited to do this again tonight at @LargoLosAngeles. Madi and I gonna sing a couple songs at @Nick_Offerman &amp; Friends. Also… RT @HighlandWW: Brand New Episode: Highland Woodworking's 40th Anniversary Special featuring @Nick_Offerman , Roy Underhill, and Thomas Lie… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/cZ5vy8zZPG RT @davidhogg111: Also, why is it culturally acceptable for any elected official to take money from special interests? In America we call i… RT @MeganMullally: in case you missed it 🏔🎶 check out the encore broadcast of our @nancyandbeth set on @mountainstage this week!  \nFind you… My wish for all of us today is that we comprehend the value of a firm, sincere handshake to be vastly greater than that of a selfie 🤝 https://t.co/sp9V7BEQsR Thank you for this gentle treatment, @SridharPappu https://t.co/rJiabOWBV8 RT @brainpicker: Thrilled to hear that \"The Mushroom Hunters,\" composed by @neilhimself for the inaugural #UniverseInVerse and splendidly d… RT @TheAVClub: .@Nick_Offerman talks White Fang and his love for Jack London https://t.co/vr3fLu12B7 Fellow supporters of the @Cubs sports baseball team - today is the last day to vote for our redoubtable fellows on the All Star ballot - let’s send em to DC, where I’m told they have built a major league park!\nhttps://t.co/sHOX5PNbRb watch this slide https://t.co/WTnTbJSzFw RT @longform: \"The Incredible Buddha Boy\" https://t.co/JfGoKluUb3 (George Saunders, @gqmagazine '06) https://t.co/pZVgJ7R3Fl RT @davedisasterman: My friend Santiago is on the final day of his two week walk to Santiago Compostela, following the old Camino Primitivo… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/hYzP1OPWPE RT @WendellDaily: It is not from ourselves that we learn to be better than we are. RT @UniofReading: We've had feedback over the last week that some people are unhappy with our plan to offer up to 14 scholarships to refuge… It is time https://t.co/boAY0pxI8D RT @thenib: @Nick_Offerman Rob Rogers is back. https://t.co/rkq6Rqg7ir RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/9zkZNm22kS A great way to avoid locking children in cages is to engage in the nutritious fabrication of a Windsor chair SIGN UP https://t.co/miAXOxJvOV RT @Cubs: Why should @javy23baez go to DC? Because he's just been named NL Player of the Week!\n\n#VoteEverybodyIn ➡️ https://t.co/k5PitY0blM… Dibs on this new band name https://t.co/yfwkoyhX2h RT @MeganMullally: this record is a masterpiece. All the Things I Did and All the Things I Didn’t Do @MilkCartonKids #milkcartonkids #allth… RT @MatttDavies: https://t.co/dVoM9b2RRJ https://t.co/mjVLqwYobE Wow this is a moving and true video from a handsome, charming and large man @robdelaney @DemSocialists https://t.co/OR5ZvhtWig RT @CindyOtis_: Today seems like the right time to do a thread I've been thinking about for a while on how to handle the seemingly never-en… No one deserves your vote more than @javy23baez #ElMago https://t.co/6u7jTa8sJS Of all the pieces, of all the puzzles we have done, this is the best piece #GOAT ⁦@libertypuzzles⁩ ⁦@MeganMullally⁩ https://t.co/jXMgeM0cMv RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/NIVSrFByEL RT @KarenKilgariff: once at a party I was stuck in a boring group conversation then I remembered I had a banana in my purse so I pulled it… Damn Damn (double damn)\n@HeartsBeatLoud spreads to many more screen-places \nThis weekend give yourself the medicine of love &amp; chuckles \n#LoveAndChuckles https://t.co/GRN4xEKmLC LOS ANGELES\nMonday July 9 please join me &amp; my confederates (including @nancyandbeth ) for a double-stuffed evening of #MIRTH @LargoLosAngeles \n@MattTheE @rainarose \n\nhttps://t.co/OyJYSD6Enx RT @WendellDaily: To be interested in food but not in food production is clearly absurd. Happy Happy birthday to ⁦@cornmo⁩ from the Melbourne troubadour society #Echidna3\n❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ https://t.co/dGoWsuSg4N LOVE DOSE SPREADING TO MORE CITIES https://t.co/DlyDPbdhTq RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/9V3IK74SVn RT @heartsbeatloud: Happy Birthday @Nick_Offerman! Well, happy birthday to Nick from Nick! Get your tickets to Hearts Beat Loud at https://… All my birthday dreams coming true @robdelaney @MeganMullally https://t.co/dFKQ3TvIte RT @MatttDavies: https://t.co/AbvotV7qZk https://t.co/u1TTsn5Rt6 @meganamram  https://t.co/g3t1gBRuXT RT @KenTremendous: Please read this. https://t.co/0agHaqJAau RT @heartsbeatloud: Happy #SFPRIDE and #NYPRIDE! We're happy to celebrate love as love should be. Be safe at the parades and festivals toda… That’s called “raising the grain”, friend - we usually wipe down our items with water to achieve that affect, to sand off those pesky nubbins before commencing finishing - sand lightly again and you should be good https://t.co/SJQSKbOI8O Go to https://t.co/3uyfZQhgoL to find a theater near you.\nThis is not loud spectacle nor escapism, but it is laughter and loving medicine, and also meat and cheese are mentioned.\n@heartsbeatloud @brettghaley @KierseyClemons @SashaBianca23 @TedDanson @keegandewitt https://t.co/0WnEacSdrH Here is some big news in the field of medicine and heart. New cities for @heartsbeatloud https://t.co/AezMkPQ1yq RT @spencertweedy: There is another private tour of the Loft and mini-performance by my dad up for auction. This one benefits a scholarship… RT @Schofizzy: Last night as the credits rolled on HEARTS BEAT LOUD my 16-year-old son Mason leaned over and put his head on my shoulder th… RT @neilhimself: I wrote this about Refugees, for today, World Refugee Day. It's about common sense and common decency. https://t.co/NRkMAX… RT @heartsbeatloud: Hey, it's #MakeMusicDay2018 and we wanted to share our Lyric Video to celebrate! Make music with your family today - ma… 😍 https://t.co/919MiHY0ul You shall pay for this insolence, tall man 🤨 https://t.co/uJyXoRdBAD RT @drmuig: Eit:  Gaelic word that refers to 'the practice of placing quartz stones in moorland streams so that they would sparkle in moonl… RT @cricketcrocker: Briefly breaking hiatus because I've been noticing a really dangerous reframing of the world. It's been coming at me fr… RT @JeffTweedy: I’d love it if everyone would read this.\nhttps://t.co/ldDUXZHHIs This weekend you might take in a dose of parental love that we could all use right about now\n@heartsbeatloud\nhttps://t.co/VgPPrEM80o via @vulture RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/uWBjqzHWYz RT @TheNormanLear: #KeepFamiliesTogether It is the American way https://t.co/ABlnK1udl4 I assume they want her to give some coaching to our elected representatives? https://t.co/38XchyKMmc RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/3llB21DEgn RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/XOZ1sWQI5e RT @FPAction: \"We pay too much to the wrong people to grow the wrong food in the wrong places.\" - @repblumenauer on why nobody should suppo… “Great idea, asswipe.” - Edward Abbey https://t.co/onRlfCL37F ✊🏼 https://t.co/fZVr5H2UMB @herdyshepherd1 @michaelpollan Word up, Mr. Shepherd \nAll of his books are excellent, and his latest (How To Change Your Mind) is another trailblazer 🍄 RT @spencertweedy: Grateful for my dad and for every parent who gives a crunk 🦁 https://t.co/vY7ROj0K2Q @TheDweck The #WorkEthic of this administration https://t.co/v60ysAQfG7 I will redouble this shout to @Kyle_MacLachlan from whom we have received guidance in good manners, gentle policing, and an appreciation for, pardon me, damn fine cups of coffee ☕️ https://t.co/93p0rVREvb I’ve always loved reading to my #Dad - here he is going apeshit for #FoucaultsPendulum\n(#CharlottesWeb)\n\n#HappyFathersDay\n@MattOfferman https://t.co/m8zC0Wh1Nm RT @heartsbeatloud: Happy #FathersDay - for this celebration of our fathers, our good friend @Nick_Offerman has a message for you https://t… Thank you my tall boys https://t.co/Xbg0wc3ls8 @MullallyMinx @nancyandbeth @opry It’s astonishing, thank you, and I salute you. RT @nancyandbeth: we play the @opry tonight!!! the show starts now. we play at 8:35p central. tune in here! https://t.co/Qqx21tyCzZ RT @Tennessean: In case you missed the Friday show, @MeganMullally and @steph_o_nee are playing the @opry tonight. https://t.co/sntH7LIHoM I admire you all for your varied abilities to dunk, each in his own way https://t.co/lLm8WOWh7K RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/oDdw8uq81P RT @danagould: No amount of snark or finger-pointing justifies looking away from terrified children being needlessly separated from their p… @MatttDavies @heartsbeatloud @Oprah @ConanOBrien @StephenAtHome @VP Would do him a world of good Many more cities next week - go to https://t.co/3uyfZQyRNl to find it near you, and we’ll be in the UK in August 🇬🇧🍳 Dads I suggest you compel your progeny to take you to this sweet cinema film this weekend opening in these redoubtable cities:\n⁦@heartsbeatloud⁩ ⁦@Oprah⁩ ⁦@ConanOBrien⁩ ⁦@StephenAtHome⁩ ⁦@VP⁩ https://t.co/EGEsaUd94R #KindnessFever 💫 Catch It ! https://t.co/yduPYasTtP Can’t wait to try this new water slide at #WrigleyField @Cubs #savory @whiskchicago https://t.co/ehT3It5V0X @MrDrewScott I will bring my ears and a pencil RT @tedstgodard: This got the cartoonist fired. Share it. https://t.co/6ik1HjgVAW RT @Rob_Rogers: Things with my paper are still unresolved but I decided to draw this one for syndication only. Enjoy. Summit cartoon: https… Damn the luck. I would relish a discussion of wainscoting ✊🏼 https://t.co/hR4gCaeAse RT @mountainkeeper: The mighty hemlock tree is a foundation species for the #Catskills. Today we released a video about how a little bug co… Chicagoland area - this Friday you can go to this amazing auction to benefit my cuz Brody &amp; amazing @StJude of Memphis - purchase this @offerman_shop table from my book #GoodCleanFun and many more superb goodies ✊🏼\nhttps://t.co/4ftistS7mz https://t.co/wY6FK7PjY0 RT @CounterpointLLC: Did you know that as of Spring 2019 every word the esteemed Wendell Berry has ever published will be back in print and… @herdyshepherd1 I am merely a fan of your writing, and eager to hear more of the corncrake. Nashville I will be talking some really terrific wordings with @nancyandbeth this Friday - \nCOME LET US TICKLE YOU\nhttps://t.co/iEXePYYqXV Dang, Sass, please join me and my COMEDY JAPES as I support @nancyandbeth Weds at @LargoLosAngeles \nhttps://t.co/JnKljPteGk Happy Father’s Day to my best teacher. We get along pretty well considering we couldn’t be more different, as witnessed in this brief documentary from the fine folks @LagavulinWhisky. #ad \nhttps://t.co/MncBR3p18l RT @robdelaney: If I stop asking ppl to register to vote will you watch my show again? I’m sorry I did politics on here. https://t.co/jSkGj… This Wednesday, folks, you can get your horn tooted and your clock fixed by those astonishing ladies of @nancyandbeth @MeganMullally @steph_o_nee \nas you luxuriate in in the lush seats of @LargoLosAngeles https://t.co/UwsRLVrHf7 RT @heartsbeatloud: \"Triumphant\" - @latimes \nThe critics know what's going on - #HeartsBeatLoud makes you feel warm and fuzzy. We're in mor… Get it on your rectangle https://t.co/UuF05PAX4A @ikebarinholtz @mradamscott DEEP TRUTH RT @robdelaney: I put a black &amp; white filter on this pic of my son’s Bryvan &amp; Loam messing around at the pool today. Jesus Christ they’re s… @rudys_tweets Those are clinch nails, used in a classic canoe construction whereby copper nails attach the outer planks to the inner ribs and are pounded into an iron so the tips curl over to “clinch” the parts together. Here’s an Old Town canoe interior to illustrate the architecture: https://t.co/cZCgh0w1Pb Hello friends\nGo to https://t.co/3uyfZQhgoL to find the theater near you where can sample this medicine @heartsbeatloud \nYOUR HEART WILL MELT WHEN YOU HEAR @KierseyClemons warble #💕🥁 RT @ghweldon: In high school I knew I was gay so I became a library aide so I could research the issue in the stacks on my own and come awa… RT @leeinthelakes: Thanks to a recommendation from @herdyshepherd1 I've finally got around to reading Wendell Berry. Powerful, relevant, be… Here is a sagacious message from one of the creators of Duke Silver and scribe of the first Ron and Tammy script 🦉🧙🏼‍♂️🙏🏼❤️ https://t.co/STsugR56Ny RT @hodgman: Another movie you can see is heartsbeatloud… https://t.co/uXgJmkG3Qf You are right as usual, @cameronesposito https://t.co/VuoZZ4jBLJ RT @TrevellAnderson: Three black, queer femmes (@KierseyClemons, @SashaBianca23 and I) spent 40 minutes talking @heartsbeatloud, representa… Get this https://t.co/NSoYeHHOg7 RT @MeganMullally: hi! if you wanna get an idea of what the Nancy And Beth traveling tent show is all about, you can check out our episode… Why not join me in the war against lameness this Wednesday 6/13 by shaking our fannies at the @nancyandbeth show @LargoLosAngeles @MeganMullally \nI WILL BE THERE WITH MY WEAPON (compassion) https://t.co/BoKM6DyOPw get better locks fool https://t.co/2Ur4G3bifJ Your weirdness is is strong ✊🏼 https://t.co/75TNilGSW9 thank you my weird son https://t.co/sVkCMMyitt “We have all lost an ambassador today” https://t.co/ImzWkkgC5t RT @nsilverberg: I understand the impulse to say “if you’re struggling, ask for help” but that can feel impossible &amp; put even more pressure… RT @RVAwonk: Anthony Bourdain was so hungry for life and lived it so passionately. And that makes his suicide so damn hard to accept. https… RT @SamGrittner: This is a list of resources for anyone who is suffering a mental health crisis. I will be updating it in the coming weeks… RT @jaketapper: Anthony was devoted not only to @AsiaArgento but to the justice she and other Weinstein survivors were denied for so long.… RT @halebale31: I’m not afraid I won’t get a cake for my wedding.\nI’m worried a tow truck driver won’t haul my stranded ass with this hairc… @jguthriemedia @heartsbeatloud @octagontees ✊🏼 RT @ava: Here are the 25 women directors who helmed #QUEENSUGAR over our three seasons. For 21 of them, it was their first episode of telev… @jguthriemedia @heartsbeatloud You are welcome, and I am confident that your embrace shall win the day. Please show the shirt tag tongive the maker some love if you don’t mind, and thank you. It is ok. https://t.co/9QNIHqFrHd Our medicinal film @heartsbeatloud opens wider and wider the next 2 weekends - go to https://t.co/3uyfZQyRNl to find the nearest screen to you, please and thank you https://t.co/i814SkM25X Methinks that is a lucky son https://t.co/eAGyn7jaGW Um. @mattTheE and I may not be the cutest puppies in the litter, but this seems a tad harsh https://t.co/n8oM9fKCTn RT @wfyi: Today at noon on @nprfreshair, actor @Nick_Offerman discusses the new film #HeartsBeatLoud. https://t.co/ZwqbxbiwhE RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/u8yJzNWouj why are you so nice https://t.co/IEgHYHHtY2 Good Morning America. @GMA\n\n(is the name of a television program I will appear on this morning) @heartsbeatloud https://t.co/rKnAYbMhKc RT @reneefrench: It's @Nick_Offerman With An Awl - acrylic on board 4\"x 4\" https://t.co/7y1f8AS12l This made my day. It’s a valuable and apt figure of speech for us Homo sapiens, no matter what age 🕺🏻 https://t.co/r2SElvn9kf RT @BryanCaforio: If you're one of the voters in #CA25 who was told you weren't on the list and had to vote provisionally, you can reach ou… I feel good https://t.co/TcDzXtPsXZ RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/EcJIC8RZx3 🙏🏼🎻 https://t.co/hpXD5hXQFP RT @kronosquartet: Happy birthday to @OnlyAnExpert!\n\nIt was such an honor to release Landfall w/ Laurie on @NonesuchRecords this year. The… New York City check out these bomb-ass moderators and come see us talk words @heartsbeatloud \nTickets https://t.co/3uyfZQyRNl https://t.co/8AvRm7c6Al RT @chelseaperetti: 🙄did the police come arrest you and your writers? did twitter shut down your account? kay. then u had freedom of speech… RT @hodgman: My friends in California and the USA: I trust you are aware of the importance of voting for the Democratics in the primaries t… RT @AnaSwanson: Farmers for Free Trade responds\n\n“We have a surplus in agriculture trade. So by the President’s own metric, U.S. agricultur… RT @onlxn: my votes for CA statewide offices\nSEN: Kevin de León\nGOV: John Chiang\nLG: Gayle McLaughlin\nSoS: Alex Padilla\nCONT: Betty Yee\nTRE… California, tomorrow we put our ballots where our mouth is - @KathyGriffin has done some sweet threaded homework in case you need any help focusing on human rights 🇺🇸 #Vote https://t.co/2xRmUUB5F6 An incredibly charming place for food &amp; drink in #OklahomaCity is @MetroWineBar - where you will be treated like family 😍\nafter some🍗and some🍷my plate looks like 🍽 I just figured this out because of my #ACUMEN ON THE NETS - if you go to https://t.co/3uyfZQyRNl it will tell you when the movie opens near you ❤️🥁🔊 https://t.co/nblxhoYA7j New Yorkies, I will be bringing some very special guests to these Q&amp;A’s so please have a good meal beforehand https://t.co/kJ7Ri0M79m Get em back in the woods, the greatest classroom @twobirdsfilm https://t.co/XT5ufSSezN RT @WillAndGrace: Being yourself is a pretty fabulous thing.\n\nHappy Pride Month, from #WillAndGrace. https://t.co/K1CFhyFOHt RT @KamalaHarris: California Democrats, are you ready to vote in Tuesday’s primary? It's critical you turn out and vote to make sure Democr… RT @MeganMullally: happy pride, everybody! 🌈🌈🌈 #PrideMonth2018 #WillAndGrace https://t.co/GBPfGN6rhc .@JLester34 @Cubs https://t.co/ostfE4LtP9 Happy Birthday to our most benevolent Judge John @hodgman \nThis book of his, now in papperbok, is magnificent https://t.co/LsDhHTDi96 I’ll give it to you straight - there are places in Oklahoma City that provide extreme comfort #ThunderCloset @okcthunder #Rumble @DrPhil https://t.co/aAYiSDmnID RT @BenJealous: Mom called &amp; said:\n\n“I grew up in segregation in Maryland\n\nGot picketed at my high school\n\nHad to leave... It was illegal f… A favorite euphemism https://t.co/jvEqRpRnvA Talkin bout his new book #HowToChangeYourMind https://t.co/zm1sWD2Wnv Goddammit @michaelpollan is that coolest breed of teacher, the one who can elucidate the Greek in a way that makes you tell your friend to “shut up, Kelly, I want to hear this”\n🍄 \nhttps://t.co/TrsUiGcxQV This string of assertions right here. https://t.co/ay389LKBu7 ✊🏼🔨❤️ https://t.co/gvcukzNMbP For your elucidation: a free taste of chasing a degree from the University of @MeganMullally https://t.co/nrKnpMV336 RT @LargoLosAngeles: Hey! While @ticketfly works on bringing our website back up you can view our events calendar here... https://t.co/FGGr… Our ❤️movie screens where none but #Wizards dare to tread #Hogwarts #EdFilmFest #MugglesWelcome #EvenSlytherinsAlthoughOtherwiseYouCanPissOff https://t.co/FWRb0k7XxL 🍎 New York City 🍏 &amp; friends \n(🍊🍒🍌🍋🍳🥨🍼🥜🍺)\n@HeartsBeatLoud opens this Thursday &amp; Friday and I will be there with you to answer life’s many questions. Purchase: https://t.co/P8JUHvR5gi RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/KxP2CCOxF0 Oh looky here, there are few better spots to purchase a nice piece of #wood to express your #love for Dad\n- of course our first rec is that you make something with your hands, but here is our second: @offerman_shop https://t.co/T4ZAoRXfJh @KarenKilgariff ✌🏼 Thanks to @MatttDavies I am able to #WearOrange today @Everytown https://t.co/MzGG4UU9UD The tomato is a fruit! https://t.co/H1htHT7VXn Apologies, I did not mean to perturb. You are a genius of comedy writing and murder podcasting, but the broom is my 🎻 https://t.co/ebwS642Ivs Holy Rail-Splitter, congrats to sweet #GeorgeSaunders and all 166 voice performers on this sweet art trophy. #LincolnInTheBardo will thrill you in your heart and soul, do please listen to/eyeball it today!❤️\nThis effort by @gildeak is nothing short of #Homeric 🇺🇸👻🎩 https://t.co/pZiDQTr8QU https://t.co/gx52EVqAyh #ToniCollette is crazy great in this film, we were so lucky to have her #charisma onboard ✊🏼 https://t.co/cy9BFxdQMc Hats off @kathygriffin ✊🏼 https://t.co/LEGmLjrZuf Imperative and cogent read. Thank goodness for Lindy West. https://t.co/dpqsusiVEr @colinmeloy Hello, winsome songster!\nThat actually doesn’t look like my John Hancock! What’s the play, Sony Center? We’re all in this together, friend. https://t.co/QNcSqRmmx0 RT @heartsbeatloud: Every question you ever wanted answered by @Nick_Offerman, @KierseyClemons and @brettghaley. Go to Nick Offerman's face… Hello 🌏 @KierseyClemons and I are doing a thing that is live and also on FacePlace - sorry, Bookface. We are at Facebook NY in New York at Facebook - it’s a building. 2:35 go.\n#TightSocialMediaGame Truly one of your best ever https://t.co/wv5q4enxqZ Oh here is the cover of a book that @MeganMullally and her mule have created for your pleasuring. October 2, you shall be satisfied. #LoveBook #AnalSexIsMentioned #SoIsJesus @andersoncooper https://t.co/NmyfIGDhau RT @leahmcelrath: Perfect editorial cartoon by @AnnTelnaes https://t.co/wuSKjOfTaS @sam_watson3 https://t.co/vggq8jumF7 Check out an opportunity to win some smarts for #FathersDay\nThis very handsome volume has a rare foreword by me that is NOT TOO LONG #ad\n@dkbooks \n@dkpublishing  \n#ToolBook\nhttps://t.co/T0QTfZCzQ6 RT @David_Feldman_: Roseanne just got hundreds of people fired. She really is a Trump supporter. Hey I am down with the bobby soxers, nbd 🕺🏻\n\n@heartsbeatloud \n@brettghaley \n@RyanSeacrest https://t.co/It2xiYrQFd #MetGala2019\n@KierseyClemons @heartsbeatloud @brettghaley @Beyonce @dolcegabbana https://t.co/VToOsAqNIU RT @danbucatinsky: This is happening RIGHT NOW west coast!  @wdytya @TLC — it’s @MeganMullally for all you @WillAndGrace fans!! #wdytya htt… RT @MarcEvanJackson: HOLLYWOOD.\nMy friends &amp; I started @DCP_improv to offer FREE ARTS PROGRAMS in #DETROIT schools.\nWe're having a $15/$25… RT @robdelaney: .@starwars Is it true that George Lucas came up with the idea for the light saber when he saw a dog with a boner get electr… RT @robdelaney: It’s Right to call my Twitter feed a “feed” since I nourish so many, with wisdom &amp; humour. But most other people’s tweets s… RT @MeganMullally: hi guys! please check out my episode of Who Do You Think You Are? this Monday night! it’s 🔥😳🧐😢🌪💥⚡️ https://t.co/7LRNsULn… Here is my list of songs to play whilst using hand tools, or “Play List”. It is at the location of Spotify, a music song service. @HeartsBeatLoud coming to your town in June, and thank you.\n@Beyonce \nhttps://t.co/5GhzcHTSM9 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/bZLV09QYEX good christ 🌊🐲🦊🙋🏻‍♂️ https://t.co/qmWYlL4qrx Check out our 🔥 single from @heartsbeatloud coming very soon to a bonafide moving image theatre house. @KierseyClemons is amazing.\nhttps://t.co/SzCHjMlTpy RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/3C2A7xvIzh RT @EpixHD: .@Nick_Offerman speaks to @MACED_Ky spokesperson about helping the region reach its full potential. Watch @America_Divided, now… My old chum Daniel Wheeler makes the most gorgeous art works - check out one of these for your special person #handtools #KeepUpTheWoodWork\n\n https://t.co/rBoC7EK5jH https://t.co/FWa9yec2Py RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/mmqIpAT6sJ I will jump on this pile of agreement https://t.co/KZtAppYwHC @neilhimself @SuzanneSmithCDG 😈 Oh my sweet lordy watch this kid shred 🤩 https://t.co/YG2apXnVTY RT @CecileRichards: Marching is great. Knitting a pink pussy hat is great. Calling members of Congress is also great. But voting is the who… This Father’s Day be sure to let Dad know that you love him by making him something with your hands. If you’re not up to it, you can always get him one of these @offerman_shop :\n\nhttps://t.co/onRr1zulH8 https://t.co/QazcoMOe1P Heart warmed. https://t.co/Acx81xAFm7 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/fqyAmbsUX1 AGREED https://t.co/RlNflPj93h RT @iAmFlyRock: Tonight on America Divided, @Nick_Offerman visits East Kentucky to look at the legacy of coal and what’s around the corner.… @brettghaley @heartsbeatloud @keegandewitt @KierseyClemons I knew you know, thank you kindly. @brettghaley @heartsbeatloud @keegandewitt @KierseyClemons Why is the back of the poster printed in mirror image, please and thank you? Folks here is a vital program produced by @TheNormanLear that explores behind the facade our nationally bedazzled media stories by talking to the actual folks involved. I had quite an education in eastern Kentucky/Appalachia. 🇺🇸 https://t.co/B9iNBE6GhF RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/eAwK2Ua9HN Here’s a wee snack I penned in adoration of my favorite writer Wendell Berry in honor of his volume of fiction newly offered by #LibraryOfAmerica @Berry_Center \n\nhttps://t.co/JT94UAMp4T I feel you https://t.co/kLOHAwKJ0L who said failing https://t.co/8ddBIt4Kzf RT @OnlyAnExpert: \"I'm an extremely optimistic person, and so I choose not to ignore these problems. But also not to be overwhelmed by them… RT @nancyandbeth: NASHVILLE!!!! we are headed your way! we are so excited to play our first proper show at the City Winery Nashville on fri… RT @neilhimself: It's time to cast Sam Black Crow in  American Gods. They are looking for First Nation / Native American actresses\nage 18 –… RT @KenTremendous: Brooklyn Nine-Nine. Season 6. NBC. https://t.co/ezW4ejgxGL RT @offerman_shop: Please note this delightful interview with our very own Matty Micucci.\nhttps://t.co/rgnVmCcbkV https://t.co/nM0RkegTfq This is the best show\n@fwmagazine #PeterGalbert @offerman_shop \nhttps://t.co/vysqpnzne1 Well now here is a show with plenty of astonishing creativity from real life crafting champions. https://t.co/grROKsYevZ @GeeksandCigars Definitely do some tests on scrap. You may need to go with a lighter panel in the text area, depending on the stain darkness RT @MeganMullally: come see us get weird, #nashville 👩🏼‍🚀👩🏼‍🚀 @CityWineryNSH @Nick_Offerman #roadie 👨🏻‍🌾 https://t.co/aK5TKVXoXC @herdyshepherd1 ‘Tis very much my pleasure. RT @MeganMullally: This beautiful short video starring The Moon will bring a tear to your eye... in the good way 🌔🌎😢😌 https://t.co/jgWATbtd… Word https://t.co/xIWynkHbXD Wow this hilarious and strange film from @BobByington has an insane cast including @MeganMullally @MartinStarr @MarthaKelly3 @KevinFCorrigan @TriesteKDunn you name it goddamn this is funny\nhttps://t.co/foS9fs7nlg RT @wkamaubell: Donald Glover is 3 of the top 4 trending topics without assaulting anybody or claiming slavery was a choice. Just from maki… @DramaMama29 @offerman_shop It’s a British publication and they spell some things differently. For example in the UK, “trump” means fart. It’d be easier to list what Ash is *not* good for. Read The Man Who Made Things Out Of Trees by Rob Penn https://t.co/i7tY1F1kV6 #ToolBook @offerman_shop  https://t.co/NvnZOJcAEm RT @MeganMullally: I GREW UP IN OKLAHOMA. PLEASE HELP TO STOP OK GOVERNOR’S DISCRIMINATION &amp; HATE: I stand with @HRC against Oklahoma’s dan… @patrickwilson73 Count me in, despite the relative foolhardiness of wrassling with Ocean Master Orm. My education proceeds apace. RT @TheNormanLear: Join @GretchenCarlson as she uncovers a culture of harassment on the Hill. Sign up for an @EPIXHD free trial and watch t… RT @RobGMacfarlane: “There is a meaning of trees, a meaning to the hugely interconnected living world that cares little for human meaning.… RIP Tony Kinman, a magnificent and prolific artist.\nToday our Cowboy’s Lament is for you, brother.\n@ChipKinman https://t.co/AIKOGgWNga RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/9fKIhaZB9r RT @whyy: Wendell Berry's Kentucky, co-produced by \n@Nick_Offerman, is a portrait of the changing landscapes and shifting values of rural A… RT @RobGMacfarlane: \"How long does it take to make the woods?\nAs long as it takes to make the world.\nIt is always finished, it is always be… RT @NFUDC: The price consumers pay at the grocery store may be increasing, but that extra money isn't going to the farmers and ranchers who… RT @KET: \"Look &amp; See: Wendell Berry's Kentucky\" is available online for a limited time. https://t.co/UAAj81Dv6n What species? \nIf you lay some paper on it and make a crayon/charcoal rubbing that might look sweet.\nThen burn it. #SoItGoes https://t.co/5Hau5Ut53I Mornin Treat https://t.co/LJHpIx6YB9 I am indeed an ardent fan. https://t.co/zFNJVgfVjx Good eye. Powder actuated nailer. https://t.co/5U8Zhquw6T RT @MeganMullally: in other words, my @instagram account is meganomullally. and that’s where i spend a lot of my social media time, if you’… This is an important show for American humans from @TheNormanLear 🇺🇸 https://t.co/eOJbJt0sXs We are going to Japan @MeganMullally \n\n(arigato @AFlickerInTime ) https://t.co/yHPaMycidA @MatttDavies @DennisDMZ Hey want to get all us @DennisDMZ nuts together for a watching party? Do you think he’ll do early Wednesday or go hilariously late into th Hey D do know what time Wednesday so I can set an alarm?\n#AnticipatingAComedyLoad\n@DennisDMZ https://t.co/QB2h0k8tIg Oh, heck - @MeganMullally pls come to the @TheMiracleDC - we’re ready for sound check?\n8pm come see this band of mystics dance and jape!!!! WASHINGTON DC https://t.co/zwqhmPhFgQ Drummer for @nancyandbeth #JoeBerardi sent me this new truck outside #MarALagoNorth - does anyone know menu or prices?\nTICKETS REMAIN @TheMiracleDC for 8pm - I will be there, hungry or not 🇺🇸🦄🥊👯‍♀️@VP @JeffFlake https://t.co/MG090PMZVh @johnmoe The other day I yelled upstairs “Honey I’m comin up do you need anything?” and then I stood there for a second or two of silence and then @MeganMullally yelled back “can you bring me a water please” RT @Cubs: Garry/Jerry/Larry/Terry threw today’s first pitch! https://t.co/f2YnCEKT1Q RT @NewYorkerRadio: Always remember the fundamental rights granted to you in the Constitution: life, liberty, and the private ownership of… RT @NewYorkerRadio: In @tnyshouts: If nuclear missiles are outlawed, only outlaws will have nuclear missiles. @Nick_Offerman performs \"I’m… “Treat your mother right.” - Mr. T\nA sweet new Cherry card for Mother’s Day:\nhttps://t.co/rBqT41b9RF\n@offerman_shop https://t.co/pPUVA0OrQ2 We revere the tree @offerman_shop \n\nhttps://t.co/mDZIrvXztU Breaking: @NRA handed own ass by principled and sexy jongleur https://t.co/QVTYaklvBC YOU LIKE ME https://t.co/9zFWBPkAso RT @heartsbeatloud: When #HeartsBeatLoud comes out, make sure to watch for the amazing @SashaBianca23 because she SHINES in the movie. http… Dear Georgia, I will be at @highlandwood in Atlanta tomorrow from 10-4 marveling at the hijinks of #RoyUnderhill and @lienielsen and also signing books - do please come see these marvels of #woodworking Happy #ArborDay\nhttps://t.co/TyLCsfKGhs RT @scullymike: My wife said the magic was gone from our relationship, so I sawed her in half.  (Would love to say I wrote this joke 40 yea… RT @meganamram: PLEASE WATCH MY WEB SERIES \"AN EMMY FOR MEGAN\" RIGHT NOW: https://t.co/iqzwPEPpu7 I lost my maidenhead to this unreleased chili peppers disc https://t.co/Im9TwGuBcU RT @MeganMullally: I stand with women in El Salvador fighting to lift the government’s total abortion ban.  The Salvadoran Congress must en… RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/oTuygwCD5o @wintaru Cap doffed. @petrahaden @neilhimself @DanaSchwartzzz It’s actually roady, but don’t worry about it! 🙌🏽✌🏼 @neilhimself @petrahaden @DanaSchwartzzz I apologize wholeheartedly @petrahaden . You are the best of eggs. 🥚 I think @djgoor wrote that line, but thank you kindly. https://t.co/MQMR42f6rX RT @LTSantaCruzCA: .@Nick_Offerman and @KierseyClemons star in the uplifting new movie @heartsbeatloud which opens at the #DelMarTheatre on… This is nice but I am uncertain that Thanos would agree. https://t.co/FEQczhhwQw RT @1snugthejoiner: An old trick, but a good one: After your finish is completely dry, rub it with kraft paper (brown paper bag) to remove… RT @watersendprod: Tomorrow THE HOUSE OF TOMORROW is out in NY, LA, Detroit, Miami, Phoenix. We're so proud of @peter_livolsi's film &amp; can'… @neilhimself @DanaSchwartzzz Yes. Me. RT @twobirdsfilm: Amen! Wesley’s contributions as significant as any one working on the film. A joy to work with, utterly intuitive.  For t… @neilhimself @DanaSchwartzzz Petra Hayden sings The Who Sell Out\n\nTrust me BREAKING: (yawn) White House shits bed again... https://t.co/q72WdPZbgk RT @robdelaney: Any (straight) Christian men or dad’s who’d be willing to take a look at my first attempt at a  “dick pic” before I send it… tell your brother from me, \nvery -REDACTED-\nplease and thank you https://t.co/3Uiu9vlXIW On my fifth time through, better every time.\n#ThatShitSeepsIn A sincere thank you to @JeanGreasy &amp; spouse @QuelleChris for your astonishing, salient, hilarious and timely record album of songs #EverythingsFine \nhttps://t.co/8L6cn1S1n8 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/oA1jJPWF9G Lookit how cute my damn daughter is https://t.co/BgyXoy92Bi RT @MeganMullally: Why Amy Schumer's 'I Feel Pretty' Is Quietly Revolutionary https://t.co/H1yQeDVbWC via @RollingStone Dear @NetflixUK , you seem to have some customers interested in seeing the very lovely &amp; healthy documentary Look &amp; See (about Wendell Berry) and I have happily watched a shitload of @Charlie_Dimmock planting larches &amp; whatnot so do we have a deal?\nContact @twobirdsfilm guv 🌽 @brettghaley  https://t.co/YKojwp4BeD You can also order our Wendell Berry documentary Look &amp; See at @OffermanWoodshop and it is also on Netflix in the US - does the UK have it on Netflix?\n\nhttps://t.co/JNDmW6J8uA https://t.co/BaSPPw6RVD SPRING HAS ARRIVED!\nSo, I am pleased to announce, has our gorgeous @twobirdsfilm entitled LOOK &amp; SEE: Wendell Berry’s Kentucky airing tonight on @IndependentLens on PBS.\nI helped produce this beauty and I am proud to see it served to you at 10/9central 🌸💐🌱🍄🌝 https://t.co/8K7fGSMpBs @KenTremendous Oh hey this would be a great type of thing to talk about on the Poscast!\nWHERE IS MY POSCAST.\n@JPosnanski In celebration of National Record Store Day please enjoy this dramatic “still” of me in the hot new summer blockbuster @heartsbeatloud #RedHookRecords @brettghaley #RSD2018 @KierseyClemons #highfidelity @johncusack @wilco @tmbg @nancyandbeth https://t.co/O9uOr2j8gH THIS IS YOUR LUCKY DAY 🔥👯‍♀️🔥\nKansas City\nColorado\nLos Angeles\n@nancyandbeth https://t.co/HRpWIQKuV2 RT @twobirdsfilm: Indefatigable Wendell Berry advocate @Nick_Offerman speaks on his involvement with LOOK &amp; SEE (and notes the mutually bel… of course this will be the man to save us #Deadpool2Peter 🤓✊🏼😍 https://t.co/pMGS2flhw1 @JohnWigleyThera Gracias Good heart medicine here https://t.co/GTq2LC21B6 I would have switched our positions tbh #420 @MeganMullally made me\n\n@chrisablesart made this https://t.co/soj6uGl1yl RT @heartsbeatloud: Make sure to check out today's @EW for @Nick_Offerman's and @KierseyClemons's summer playlist! https://t.co/wlwUv2piwC “Ughhhh. Cannot WAIT for Nick’s movie @heartsbeatloud to open June 8....and, Baseball.” https://t.co/92VjBIlUeE @HDalmut 👍🏼 RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/yFSp8lBfx2 #Chuck420 https://t.co/m0LZiuNRlQ RT @jakesonaplane: Presented without caption https://t.co/fXpqvPk4pu RT @FarmOnDharma: What's the best way to follow up a viewing of the achingly beautiful  film LOOK &amp; SEE: A PORTRAIT OF WENDELL BERRY? A pod… RT @robdelaney: HELL YEAH BABY I ❤️ TEACHERS https://t.co/qpvDKMAFmB RT @RudeMechanic: New Video: ‘Spindle Turning for Furniture with Peter Galbert’ https://t.co/pwuRAbp72s https://t.co/aY5pRIBd39 Dibs on Muleteer #3 https://t.co/orCoNhNZjk RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/IAZOzpQSpL RT @TheDweck: Wow, lot of Rudy Giuliani news this afternoon https://t.co/GrMibFwMV9 RT @robdelaney: Friends, if today wasn’t already great enough, I just got the top of the bus to myself &amp; I can sit up front &amp; pretend I’m d… RT @davidhogg111: Thanks, Obama.  https://t.co/ydeXa3TFhg I remain deeply chuffed to serve @MeganMullally as roadie on tour with @nancyandbeth \nA few tickets remain for tonight in Minnesota LAND OF 10,000 LAKES\nI might appear with a 🥁 \nhttps://t.co/G9FxzB4pyN Lost? Hardly. I was merely apprehending some happy beeves grazing upon the hills of Petaluma, and me with a paddler’s appetite https://t.co/VIFG7dKBhK I am not surprised that such charismatic employ can be had in a place as lovely as Snohomish, Washington https://t.co/mHwZmoLLTp Good morning from an hilariously snowy St. Paul, MN\nFrom the co-author/creator of @AxeCop here is a new tank of chuckle-gas by which you might refuel your giggle trip #Bears @StephenAtHome @BearGrylls @JimMcMahon https://t.co/GrbLzBNzCw RT @JohnWThurston: @Nick_Offerman This applies to twitter AND carpentry. https://t.co/S5jwCecWvO Oh hell yeah this is just.\n\n@MeganMullally = the bomb https://t.co/LAfQgaXmOT RT @twobirdsfilm: The significance of Wendell Berry to people in small communities is so clear from the sheer number of grass-roots LOOK &amp;… @atjareds ✌🏼 @neilhimself @offerman_shop @MikePenceVP I’ll look forward to a negotiation. @atjareds Hey keep your pants on, friend. The sentiment I, a furniture maker, disagrees with is “a robot making a chair beats doing it yourself”. If you are a robot programmer then I don’t guess that includes you. To each her/his own. Goddammit. Proceeds *APACE* RT @MatttDavies: There's a typo, fixed in this one. Can you play spot the difference? 😬 https://t.co/OTTpQ2uFQd Ukulele lab proceeds space. These lil buggers are fun, as is playing with different species to see which tree toots the sweetest tunes 🤹🏻‍♂️ @offerman_shop @MikePenceVP https://t.co/CravBREs1T That is a nifty gadget but your statement is patently incorrect https://t.co/bMtiXEKFKf That is my great grandmother Henrietta - a winsome lady, whose pork loin would make your hat fly off https://t.co/33bhruNl1D RT @TheDweck: Found the town where Mike Huckabee’s jokes are written https://t.co/UzmalKGOOl I’m not crying, so shut up. https://t.co/0NbwmpaSse Oh I guess I’m on a 2019 Pulitzer track  with my new job @NewYorker 🧐\nHow to Write a New Yorker Cartoon Caption: Nick Offerman Edition https://t.co/hZHyTx3EQZ via @SCENE My friend @JaydaRasberry is making this charismatic show with an imperative voice which I would like 2 amplify ❤️ @PowerDignity\nGrassroots with Jayda: Ep 1 Patrisse Cullors https://t.co/YUMB98TsQM via @YouTube RT @fittedsweats: Hannity's logo looks like it hangs above a special PC Richard &amp; Son aisle dedicated to maximum strength ointments. https:… quick check-in, I just shat myself\n#Flowchella https://t.co/wxhgsvDvau RT @LargoLosAngeles: #NancyAndBeth just released a handful of tix for Tonight 830pm show.\nCome on down for the good tunes and a laugh as we… Check out my confederate #PatRiot - huge pointillism baseball portraits done using only chewed #BubbleGum\nhttps://t.co/c7nj2FgAeN RT @donttrythis: Inspiring. Adam Foss writes on criminal justice reform like nobody else can. https://t.co/yJI1BkiJQT now I am angered https://t.co/e2LfBUyFXv RT @MattOswaltVA: let's all take 2:42 out of our lives and appreciate the best of what the human race has to offer \nhttps://t.co/ZdPfCRuvQM RT @twobirdsfilm: It's not Amazon Prime yet but it's a start! https://t.co/rCaZiin7rJ https://t.co/YEx2xK5eAO THAT GAME WAS 🍌🍌🍌🍌🍌\n#FlyTheW #ElMago the magnificent!\n#EverybodyIn\n#EverybodyIn \n#EverybodyIn Thank you @MatttDavies for your staunch, ever clever #patriotism https://t.co/vgOZUywJky RT @davidhogg111: Remember to get people registered to vote at your walk out! Sign up here! https://t.co/KGDJoXYNrh I am besotted with this coffee table crafted by the redoubtable crew at @offerman_shop #TonyBuild #RedwoodBurl #LoadBlown\nhttps://t.co/tsLnmgu1Ke sweet jiminy christmas\n\nthey didn’t have any big ones? https://t.co/GX7yZpDEmm 🐽 https://t.co/VYF32MGHhn @PineappleCarr Find a way to do it for credit and let the school pay for the epoxy, clamps and cedar? It’s a couple grand at least out of pocket. You are most welcome. \nIf you like delicious reading, order this handsomeish volume from @LibraryAmerica 📚🇺🇸 https://t.co/8BIvIXlONJ 🙏🏼 https://t.co/1hHBX79ydQ You magnificent son of a bitch. 😍 https://t.co/vS9dp14sPc RT @RobGMacfarlane: “A small grove massacred to the last ash,\nAn oak with heart-rot, give away the show:\nThis great society is going to sma… RT @PBSSoCal: Join #PBSSoCalLIVE and @TheLAKitchen for a screening of @IndependentLens' “Look &amp; See: Wendell Berry’s Kentucky,” a panel dis… ✊🏼 https://t.co/vaAus0KXMo Hell yes https://t.co/fXGO2DskIh Salute! https://t.co/MW41oD6f2g Gorgeous. This is the idea. 🇺🇸 https://t.co/Iahw5mT8Ca @Rdheadstranger1 Ah yes, I see the crack now. Mending plate on the back side, or yes, corbels would be dope. @Rdheadstranger1 Wow, that’s a bummer when your harvested tree proves hollow, but that is right pretty - I would cut off slices and clean them up to make heart-like wall hangings. .@javy23baez Good job \n\n#EverybodyIn #ElMago af RT @TheDweck: Man Farts Up Entire Elevator Then Gets Off at Next Stop https://t.co/DIMTNyquzu Here be a trailer for @heartsbeatloud  which is an awfully nice film from @brettghaley starring @KierseyClemons @TedDanson @SashaBianca23 #ToniCollette #BlytheDanner and delicious musicks from @keegandewitt https://t.co/F2TIZIEJ8L RT @ProBirdRights: oh so u do not want me to taken your baggel and make poo on your table??? sorey you cant handle my differening opionion.… The only thing more embarrassing is @seanhannity in his Panda suit nodding with sweaty gravitas while attempting to rub one out #thegoodguys https://t.co/c6USjjBFOm Come witness me witness @patrickwilson73 and his thighs #objectifictaion https://t.co/2UGbzztrgn RT @GaryPressy: Today reminds me of the home opener in 1975 between the Cubs and Pirates - beautiful day for baseball! Home opener is alway… @KenTremendous there’s my guy RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/dzr7mFDJ1R Holy shit please can I audition for this pilot?! https://t.co/bvrDB8WCUg RT @BBC6Music: Thinking of having a spring clean this weekend?\n\n\"Our minds are the most powerful things we have\" says Laurie Anderson (@Onl… RT @nancyandbeth: @MeganMullally @steph_o_nee check it out!!! https://t.co/NbnyJtXD4e RT @susanlmarquis: Watched #Look&amp;See Nice work @twobirdsfilm Wendell Berry has been reminding us for 50 yrs: farming feeds body &amp; soul. We… Clown Alert 🚨 https://t.co/7u7WPpUowp RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/PDvDUMbnPQ Hey hey hey hey 🎶 what a sweet movie poster featuring @KierseyClemons teaching her dad about “fresh jams”. @heartsbeatloud comes to theaters in June!\n#HeartsBeatLoud https://t.co/9hSIwDUNQK A good day https://t.co/ZdFuIh4s0I RT @MatttDavies: https://t.co/dVoM9aLh0b https://t.co/8fwoUFwRg8 Hey there is some pretty rational stuff in here https://t.co/g3X8ttqLJV @KenTremendous I’m with you, Ken RT @WendellDaily: We sat in the yard, the house dark\nAs we talked we knew by the dark distances of Heavens lights \nour smallness and the gr… On this ancient celebration of Ishtar and fertility, what could be more roborative than Laurie Anderson @OnlyAnExpert hinting at the toothsome eggs of her creativity 🙏🏼 https://t.co/fjJTqCgXGO @chrisablesart @ArcherByron You are a patient soldier 🇺🇸 If you are not already ferrule-deep in it’s beautiful pages, @MortiseTenonMag is a delight for woodworkers and students of good work of all sorts. @offerman_shop \n\nhttps://t.co/cw6rRkeYzw This is a savory compliment https://t.co/512BGWiiuQ Thank you Delores Taylor for a lifetime of beauty, humanitarian labor, activism &amp; #BillyJack\n\n🌸🍃🌻🌼❤️RIP❤️🌼🌻🍃🌸 https://t.co/lgKLeyfqnM A delightful rapport with this nimble twosome of Johns, including some great lessons in creativity and outlier mindset 🐳🦑 https://t.co/3zJZQOfWey RT @Emma4Change: If all you’re a reporter and all you want is to report on the MFOL Parkland kids-you’re a fool. BRANCH OUT ! There are so… RT @kurteichenwald: Hopefully the Laura Ingraham blow-up will teach conservatives: You are not \"debating\" gun control when you insult survi… @KenTremendous Come on, buddy. he is risible https://t.co/WndcZdk5Xv"}