{"tweets": "RT @drinkwaterho: scroll down \n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n• \n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\nkeep scrolling \n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•… Loved that @ChaseRiceMusic was on the Bachelor. Loved that the song he sang mentions the Bachelor. Now I would like a private Chase Rice concert 😊 Best part of this weeks Bachelor episode was Chase Rice. Especially the fact that the song he sang mentions the Bachelor 😂 https://t.co/pE06zcE5qP RT @justinbean12: “You asked for my hustle, I gave you my heart” - Kobe Bryant 🏀❤️ #MambaMentality #gameday https://t.co/sjMwzbAOA0 RT @raf_tyler: Every team has to retire 24 RT @drinkwaterho: drink water and study hard RT @drinkwaterho: drink 💕 water 💕 u 💕 hoe 💕 @adamdoestw I got you bro! @Sadie___Morrow ✋🏼me every month without a doubt. Even when I’m very sure I’m not, I still freak out worrying I am 🙈 RT @drinkwaterho: ┏━━┓┏━━┓┏━━┓┏━━┓\n┗━┓┃┃┏┓┃┗━┓┃┃┏┓┃\n┏━┛┃┃┃┃┃┏━┛┃┃┃┃┃\n      💧S T A Y  H Y D R A T E D 💧\n┃┏━┛┃┃┃┃┃┏━┛┃┃┃┃\n┃┗━┓┃┗┛┃┃┗━┓┃┗┛┃\n┗━… @adamdoestw When mom told me about this i was like, “so is one hour church going to become a thing?” 😜 RT @drinkwaterho: hey bitch. stay hydrated. love u @adamdoestw I LOVE grandpas emails that he sends us! Especially when it’s about USU sports 😂 @adamdoestw I’ll play with you this weekend to see how unknowledgable i am 😂 @adamdoestw I just love that this is what kept you up that night 😂 especially because that was so many years ago and I’m sure it wasn’t you 😜 RT @daijja: hi twitter, so i convinced my mom to make a gofundme for my brother so he can get a new helmet (and other devices) related to h… @adamdoestw Thank you for agreeing that While You Were Sleeping is the best AND a Christmas movie! 😜 @timtamburg 😂😂😂👌🏼👌🏼👌🏼😂😂😂 this is gold @adamdoestw “FEEEEEEEENYYYYYYYY!” 😂 @kaitnielsen Wearing all black is 100% okay. Legit wear it all the time 🤷🏼‍♀️ @timtamburg I sent Adam and JJ yesterday because I didn’t want to get knocked over and break myself lol RT @JimHalpert__: Me on Thanksgiving, as told by scenes from The Office https://t.co/DzZxa6RE4i @adamdoestw Sex is cool, but have you ever had a problem RT @addatude_: 12 Days of Hallmark Christmas Movies:\n\n12 guys named Jason\n11 family secrets \n10 baking contests\n9 high school sweethearts\n8… RT @AlCarraway: taco cat spelled backwards is taco cat\nspread the word @timtamburg @adamdoestw Normally it goes away. If it doesn’t go away after a few days I would go to the doctor. They might have to prescribe you an inhaler if it is asthma. Or they might have to do some other things if it’s not that 😊👍🏼 @adamdoestw I also am terrified that this has happened and I just didn’t realize it because it was just light enough I end up thinking it was just me breaking weird. And because I am cranking those bops RT @TobyHater: 👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿\n👉🏿👇🏾👇🏾👇🏾👇🏾👇🏾👇🏾👇🏾👇🏾👇🏾👈🏿\n👉🏿👉🏾👇🏽👇🏽👇🏽👇🏽👇🏽👇🏽👇🏽👈🏾👈🏿\n👉🏿👉🏾👉🏽👇🏼👇🏼👇🏼👇🏼👇🏼👈🏽👈🏾👈🏿\n👉🏿👉🏾👉🏽👉🏼👇🏻👇🏻👇🏻👈🏼👈🏽👈🏾👈🏿\n👉🏿👉🏾 ryan… RT @drinkwaterho: 👊🏿👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿👇🏿👊🏿\n👉🏿👍🏾👇🏾👇🏾👇🏾👇🏾👇🏾👇🏾👇🏾👍🏾👈🏿\n👉🏿👉🏾👍🏽👇🏽👇🏽👇🏽👇🏽👇🏽👍🏽👈🏾👈🏿\n👉🏿👉🏾👉🏽👍🏼👇🏼👇🏼👇🏼👍🏼👈🏽👈🏾👈🏿\n👉🏿👉🏾👉🏽👉🏼👍🏻👇🏻👍🏻👈🏼👈🏽👈🏾👈🏿\n👉🏿👉🏾👉🏽… @adamdoestw @timtamburg Can we appreciate that both us Hellewell’s commented because we sadly know the asthma life too well 😂🙈 @timtamburg It sounds like it might be exercise induced or just because it’s cold and we have crappy air in the valley. But I would definitely watch it and make sure it doesn’t get worse. Or if it doesn’t go away, go to the docs. 💗 your MA friend @adamdoestw Nope. That 100% was a real ad. Now I kind of want one now that you mention it 😂 @timtamburg Most the time when I have an asthma attack there is a small panic attack that happens, because I start panicking that I can’t breathe. Getting those abs slowly but surely since I can never breathe lol @adamdoestw I just heard all my bones in my arm break while looking at his arm like that... I always wonder how I still have hair on my head with how much hair I love to my brush and in the shower. But I am grateful there aren’t any bald spots 🙌🏼 @adamdoestw 🙏🏼🙏🏼🙏🏼 @adamdoestw Amen! You can be LDS and gay and i hate that people don’t realize that it’s possible! Good job being a good example of that to the others! @adamdoestw Oh yeah! I forgot about that one! Let’s go for no more accidents 😉 @adamdoestw 2?????? I only know of the most recent one!! @adamdoestw Nooooo! I LOVE your tweets! @adamdoestw Boys are dumb. Sorry about the heartbreak! Stop getting in car accidents 😉 @kaitnielsen Forgot to wear a bra to school one day and wasn’t even mad 🤷🏼‍♀️ My costume for the first part of the day is a medical student stressed and tired and breaking out. After that, I’m the student who takes 5 hour naps ✌🏼 If you need me. I’ll be sitting at home cuddled up thinking about how I am ready to move to Texas where it is warm and I can afford to buy a house Who said it was okay for Robert Patterson to be Batman??? Because whoever it was needs to be smacked RT @andrewbfeldman: https://t.co/zwQKQVPhpx @timtamburg I hate Duo Push with a fiery passion. One reason I’m glad I don’t actually really ever have to log into my USU account anymore RT @drinkwaterho: Water. That’s it. That’s the tweet. I don’t know why, but I love writing in cursive. It’s just so fun and relaxing @adamdoestw Love you little bro! You and all your anxieties 💕 I feel a lot of the same anxieties with not being good enough or not succeeding while I watch other people succeed. Or failing over and over again. But then I remember, my time will come. And I remember I have help I can get 💕 RT @JimHalpert__: Jim and Pam’s 10 year anniversary would be today ❤️ https://t.co/DucWutYtDa @ttoll_15 I didn’t serve the mission I was called on and I feel like a good person. I know many really awesome people that didn’t serve a mission. Serving a mission can bring you blessings and awesome experiences, but it 100% does not automatically qualify you as a good person. @timtamburg Legit can’t tell you how happy I was when I opened Instagram today and saw that it’s now dark mode too!! Slowly but surely they shall all become dark mode. That day I will be an even more happy iPhone user! @smithee2123 My life is once again complete now that it’s back!! RT @WhereIsEmma: this girl in my ward bore her testimony and she shared a story about this kid in primary said “do you think jesus has a pi… Yes. I did decide the minute my first alarm went off this morning that I was going to school an hour late because I wanted to sleep until my last alarm went off @adamdoestw Oh my gosh yes. You go bro. You know how the real world works! @timtamburg I’m just going to put this out there, but I love it when the general authorities get emotional as they are speaking in conference or wherever, and that doesn’t make them weak 🤷🏼‍♀️ @rachillax I always want to smack them in the back of their heads and tell them to grow up and get over it because it isn’t effecting their life directly. One of these days it’s going to end up happening haha @timtamburg I’ve already decided that once I NEED a new phone, I’ll get the xs, but I honestly don’t care to have the latest and greatest! Plus that phone will be cheaper by then 😂 Thing I’m most excited about with this new iOS update is that I can finally swipe text! Pretty sure there is an arsonist setting the mountains in Davis County on fire 🔥 RT @ryleeemlock: okay my cousin, just barely 15, just got asked on a date by a guy who’s almost 19 and we’re arguing about it so\n\nlike if y… Today is going to be a good day, and here’s why: \nMy body actually let me sleep in until my alarm went off instead of waking up hours before it goes off like normal! 🙌🏼 When your teachers keep the room at the perfect temperature to sleep in, and they get mad when we’re all falling asleep at our desks... 🤷🏼‍♀️ @adamdoestw All the time! And i want to do them all! But it overwhelms me! @GENTRImusic Can you please tell jokes at your concert in December up at USU? 😂 If cache valley could stop being so smoky that would be great. My allergies and asthma would very much so appreciate it. K thanks. Bye. Took a 2 hour nap in the late afternoon... so I regret it? Not one bit! Naps are life! RT @drinkwaterho: W H Y \n\n    B E\n\n      M A D\n\n      W H E N \n\n         Y O U\n\n          C A N\n\n            B E\n\n           H Y D R A T E… When your dad stays up late with you so you can get you log in screen on your new lap top to actually change to the picture you want, so you don’t have to look at a desert that makes you sad and want to quit school every time you open it up there! Thank you papa! @timtamburg 🙌🏼 forever grateful for you amazing by friends I had for reasons like this! RT @drinkwaterho: retweet if you drank water today like the #H2Hoe you are. I can’t count on my fingers and toes anymore how many times I say that I’m dropping out of school🙈 @timtamburg I’m so glad I’m not the only one that has this happen when they eat pizza 😂🙈 @drinkwaterho @DallingaJj Out of all the things I could suck at in life, it had to be breathing 😑🙄 @timtamburg I sent all of you guys off with a “k bye! Have fun! I’m going to go to school now!” And then checked in on you guys every now and then to make sure you guys were still alive 😉 Can officially say I’ve binge watched season 3 of Stranger Things. And yes, that’s part of how we celebrated our anniversary 😉 RT @drinkwaterho: your mom didn’t carry you for 9months for you to be a dehydrated bitch. \n\nGO DRINK SOME WATER RIGHT NOW. @timtamburg Legit want to find these people and smack them for being so dumb. An I honestly wasn’t surprised when i heard it was a couple that caused the fire. People are dumb RT @emmycoletti: I don’t know who needs to hear this but stop cutting your own bangs RT @molly_moo_who: If the red team and the blue team just work together they'd score way more points...... @adamdoestw Now that you’ve said that you’re going to get hacked 😉 @Papa_Ostler Love RJ! Was one of my husbands roommates and he’s just so great! 😊💕 RT @MathesonJess: The only thing more dangerous than driving through the Lehi construction is sneezing while driving through the Lehi const… Absolutely love the fact that my husband listened to @BenSPLATT ‘s single before I even did. Makes me SO happy he loves his music just as much as I do 😊🙌🏼 RT @drinkwaterho: D O N T\n\n   F O R G E T\n\n      T O\n\n          D R I N K\n\n             W A T E R Normally don't have anxiety, but sitting in class, waiting for a final to be graded, to determine my future in this class, just spiked my anxiety up 100 notches! Everyone that deals with anxiety on a daily: you’re amazing and I love you! RT @williams_madd: Someone's broken leg doesn't make your stubbed toe hurt any less. \n\nConversely, \n\nYour broken leg doesn't make someone e… The one thing I won't miss about going to Utah State anymore is that I won't have to walk up the horrible stairs in Old Main! No more letting everyone know how out of shape I am! I'm going to just keep on sitting in my chair in my one classroom 😉 RT @drinkwaterho: stop being a whore and start drinking water RT @joshfanos: I hope that instead of pulling handcarts for trek, our posterity will just have to drive on a recreated version of I-15 in L… RT @natmypresident: i know vaping is a hot topic right now but just please don’t vape\n\nnicotine aside it absolutely destroys your lungs\n\npo… @adamdoestw @cthellewell27 Legit didn’t know dad had a Twitter 😂🤷🏼‍♀️ @adamdoestw I’m so glad you decided to grace Twitter with your high wisdom teeth drunkenness 😂 @adamdoestw Gooooooood! 👍🏼 @adamdoestw Aw. Welcome to being an adult! It sucks 😉 @adamdoestw Hopefully she’s actually getting rid of them now 😂😂🙈 Need it to be fall already. I’m ready to wear sweaters and jeans again. And to just sit on my couch, cuddled up in a blanket watching “Friends” @adamdoestw @landonlee907 Okay yeah. That was AMAZING! And that’s my favorite hymn too! RT @mozarellaastick: The only thing I have to live for is the Wendy's 4 for 4 RT @sam_brumwell: The only lullaby my kids will know is the Scotsman @adamdoestw Also listen to Crime Junkie! That’s my new favorite one! RT @drinkwaterho: I know you’re bored right now and need something to do.\n\nGO DRINK SOME WATER BITCH. \nSTOP PUTTING IT OFF. @adamdoestw I want that LEGO set! Proud of myself for actually getting out of bed on time and getting fully ready and leaving for school on time! 🙌🏼 @timtamburg For reals though! I’ll always regret it, but I’ll keep doing it because DP = life! RT @drinkwaterho: S T O P \nB E I N G\nL A Z Y \n\nA N D \nG O \nD R I N K \nW A T E R. @adamdoestw Serial, Casefile and Cold I miss the days when I could just swipe through the Instagram stories and didn’t have to sit there and click through them all Yes. I spent the first hour of class today looking at different degrees at USU because I miss getting to walk from class to class RT @ColourPopCo: 💜A Family Affair #GIVEAWAY 💜\n \nHave you heard of our new sister brand @SolBodyCo?  We are giving away a $250 ColourPop sho… What’s gotten me through the last few days of school is crime podcasts 😂 learning all about medicine and enjoying myself some crime ✌🏼 RT @drinkwaterho: T I M E \nT O\nD R I N K\nW A T E R\nB I T C H. Dear Sarah Dallinga,\nToday’s going to be a good day, and here’s why. Because you only have 3 HOURS of school today. 🙌🏼 RT @ColourPopCo: TRUE 🗣️ https://t.co/hgoI7niPbe @timtamburg That’s a good question! Because even though I was born and raised in Utah, I look at the Utah Mormon culture and sit there and think, “somehow I am not a part of this culture...”. But I’m actually okay with it RT @Papa_Ostler: Planning your suicide?\n\nPlease stay.   I promise it gets better.  People would be heartbroken.   This world is a better pl… RT @hankrsmith: Everyone you meet is fighting a battle you know nothing about.\n\nBe kind.\n\nAlways. RT @ColourPopCo: #GIVEAWAY\n \nIn honor of our new collection VIVA with @iambeckyg, we are giving away all of Becky G X ColourPop collections… RT @hankrsmith: The Lord says, “If ye love me, keep my commandments.”\n\nBut He doesn’t say, “I only love you if you keep my commandments.”… RT @CaucasianJames: how am i supposed to explain to my children that i can’t help them with their math homework. how am i supposed to look… RT @StaceyHarkey: I don’t do road rage. Instead I slowly drive past people and shake my head like a disappointed loved one. I want them to… I feel like a sleep deprived mother  without any kids... my body needs to calm down and just sleep at night so I can function during the day @adamdoestw I had no idea he believed that... but he is a crazy man... RT @LDProphetQuotes: What we choose to do here will determine the kind of life we have throughout all eternity. We are never living just fo… @mozarellaastick Oh my gosh yes! And it bugs the crap out of me 😂 RT @LDSquotable: You sisters have been divinely endowed with a unique kind of discernment &amp; strength... These differences are intentional &amp;… In love with @BenSPLATT latest album! 💕💕 Sometimes I wonder why I chose the degree I chose because it can be so much stressful than my previous major... then I remember I’ll be done and have a big kid job before I would have had my bachelors 🤷🏼‍♀️🙌🏼 @adamdoestw I give you permission to slap me if I go back to the Lyric next summer instead of an MA job 😂🙈 @adamdoestw I freaking love Bishop Dunn! He’s the perfect bishop to have during this time! Love that man! RT @jkpete777: If your Instagram story has more than 5 dashes, I'm skipping the whole damn thing @adamdoestw I laughed way harder at this than I should have! 😂 You have my vote! Sitting at work and thinking how I’ve said at the end of every summer that that was my last summer working the summer season... I promise this IS my last summer here 😂 @adamdoestw @ShmannersCast Did you get sick of us while in New York? 😉 Legit just got so excited about my husband making me Mac &amp; Cheese for dinner! Best birthday dinner right there 😉 @adamdoestw Thanks little bro! 😊 I never thought I’d have to go school on my birthday. But here I am, sitting in class, working hard. Just preparing myself for the real world when I get to work on my birthday 😜 One of these days I’ll actually get called by name and not my sisters. The problem of working at the same place and have gone to the same schools our whole lives 🤷🏼‍♀️ RT @BenSPLATT: happy 4th from me &amp; @mollyjgordon https://t.co/Uum9E3Ze11 @adamdoestw What do you mean by this? What happened? 😜 @smithee2123 Any day girl. I feel like I shouldn’t be dealing with it anymore! Gotta love that adult acne 😂 I figured I would cry while seeing @DearEvanHansen on Broadway. But the emotion that @andrewbfeldman had during the show made me cry even more than expected! So worth it! @timtamburg My mom showed that to me this morning and I actually almost cried. I think I know what I want for my birthday now haha @timtamburg I love it when I get a haircut because the person always asks me if my waves are natural and if my hair is always as poofy as it is. Yes, yes it is. Why thank you for noticing my crazy poofy hair 💁🏼‍♀️ RT @j_n_foster: Zac Efron did the Ted Bundy biopic to escape being pigeonholed as the dude whose movies attract adoring girls, only to disc… Always saying I’m going to drop out of school. But here I am still working my butt off to get good grades and finish on time 🤷🏼‍♀️ RT @TobyHater: My mind is going a mile an hour. @timtamburg I strongly believe that! If you aren’t picky, many different things can happen. And even though it may take you slightly longer to find your person, you’ll for sure find the right one! @kaitnielsen So glad I’m not the only one 🙈😂 @timtamburg @DuleHill Um. Yes! I would like that list too! RT @cydbeer: When traffic is held up because of a semi truck it’s pretty easy to be patient and understanding when you can see the massive… RT @Jazzbug20: I don’t care what team you cheer for, the minute you cheer for someone getting injured you lose all points in my book. @adamdoestw Yes. Because then when I’m watching it I can be like, “you see that m&amp;m? That’s my brother!” 😂 Thankful I don’t have school today so I can just jam to @jonasbrothers new album all! 💕😍 @timtamburg @ErinMackay15 My advice then is find a new place. I did it and things got better. It isn’t good for you or him to be in that situation. The minute I got out, that’s when I finally met my boy. Maybe that’s what you need 😉 @timtamburg @ErinMackay15 I vote you talk to this roommate Tim and see how you can help with the cough and not complain about him. Complaining gets you no where. Talk to him about it, not twitter. @ErinMackay15 @timtamburg Thank you Erin! Amen! 🙌🏼 @timtamburg @ErinMackay15 I bet to differ. Most twitter accounts are for more things than that. You must be following all the wrong kinds of people @timtamburg @ErinMackay15 Get over yourself works great to me! You just have to humble yourself. Oh, and when you do that, great things happen in your life. Just saying 🤷🏼‍♀️ it might lead to something good for you @timtamburg @ErinMackay15 Even if your twitter account is for sarcastic things, how about it not be things that cross the line on sarcastic and rude? This guy is someone just trying to deal with a stupid cough. And sometimes there is nothing you can do about a cough @timtamburg Thankfully no. Just lovely asthma and allergies 👍🏼 @timtamburg I’m not sick. I don’t have food stuck in my throat. Yet here I am with this dumb cough. Huh. Wonder what it could be 🤷🏼‍♀️ RT @nerdjpg: Memes are so fast now Charlie bit my finger was like a 2 year long endeavor RT @USUBasketball: .@nemi1599 Set To Return For 2019-20 Season.\n\n➡️ https://t.co/1lU33Idqyb\n\n#AggiesAllTheWay https://t.co/kWSYG9TPog RT @aubrey031018: always feeling threatened that my bitmoji is better than me in every way @adamdoestw I thought it was about time I follow my own brother 😉😂 Queta’s back! My happiness about this is right up there with the day I got married! Never have I been more excited for basketball season. Now it just needs to be here! https://t.co/eAKLcJdMdk RT @excesstential: PSA\n\nWhen a girl cries, she’s not crying over what just happened. She’s crying because the endocrine system is triggered… There’s a reason I never took 8:30 classes at USU... apparently I didn’t actually learn my lesson cause now I have school every day at 8:30 RT @tsavv_: Watching Netflix without academic pressure just isn’t the same RT @myranda_forever: Utah Drivers: “It’s hard to see the lines in the rain! Reflective lines might help?”\n \nUDOT:\n\nDrivers: “REFLECTIVE LIN… I chose a career where I have to remember that the mitochondria is the powerhouse of the cell. I think I’ll be good. Because I am NEVER forgetting that. I’m ready to get my sleep schedule back to normal... but yet being in school isn’t helping me. I’ll sleep again one day @hankrsmith Happy Birthday!! 🎁🎊🎂🎈🎉 My 7 year old brother in law has been trying to sell me his parents old van because I’m going to need it when I become a mom. And apparently that’s going to be soon 😂👌🏼 RT @SGAMormon: Love yourself, not despite supposed negatives, but including them. \n\nLove yourself including your scars, quirks, oddities, w… RT @LDSquotable: On Easter Sunday—we celebrate life!\nBecause of Jesus Christ, we will rise from the despair of death &amp; embrace those we lov… RT @hankrsmith: Headed into finals? Repeat after me:\n\nI will do my best, but...\n\nMy grades do not = my worth or my happiness.\n\nThere is no… @smithee2123 Legit glad I am not the only one 😂🙈 @timtamburg Maybe... 🤷🏼‍♀️ at least it’s legal 😉 @SGAMormon So your gay? Great! I still love you and I’ll support you! I’ll be your family! I’m proud of you for staying in the church even though that may be rough some days. I’ll always support your decision to stay in the church 💕 @timtamburg Sometimes you end up marrying your fourth cousin 🤷🏼‍♀️ RT @LDSquotable: The Lord knows how hard you are trying.\n- Sister Eubank RT @NikkiYaste: Depression is real. \n\nAnxiety is real. \n\nThe healing touch of Jesus Christ is real. \n\nWe must never minimize or pacify all… RT @LDSquotable: Five guilt free things to particpate in the Saviors great commission to help gather Israel:  \n1. Draw close to God\n2. Feel… @timtamburg That was me with gluten for a minute there. I didn’t want to spend most of my life on the toilet, so I avoided it 😉😂 @timtamburg Wait! You can’t eat eggs now??? RT @Devinrios23: How did I lose my bedroom chapstick, my car chapstick, and my backpack chapstick? RT @trvpism: due to personal reasons i’ll be going back to sleep RT @hankrsmith: Love and miss this smile. https://t.co/AXETa6jpoc RT @kaitnielsen: My ultimate dream: no people dirtying clothing by wearing them, no people dirtying dishes by using them.\n\nDead. We would a… RT @justinbean12: When you don’t know what face to make at the camera so you just smile 🤷‍♂️ https://t.co/3pQVPxmHME RT @sarahhh_22: one exam away from majoring in being a stay at home mom RT @LDSquotable: “We must ever be aware of the power that the small and simple things can have in building spirituality. At the same time,… RT @kaitnielsen: I think all of Utah is ready for fall now Having all the mixed feelings of school starting next week. Can’t wait cause I need stuff to do and it means 1 week till I get married. But then it also means homework... @kenzma_12 Yes. Yes you are. @timtamburg Let’s talk about how this is actually a super genius idea! RT @22AlFox: Knowing that God is real and the gospel is true is another way of saying your life will never be the same. Always better, thou… When you go to babysit your adorable nephew to get your baby fix, but it only makes you more baby hungry... Henry just has to be so flipping cute! RT @Landry_Thomas: All I want is cream cheese wontons. My summer has actually finally begun, and I'm spending it making sure daycare children behave and don't drown for my internship 👍🏻 @smithee2123 I think it’s till the end of the year 🎉 RT @22AlFox: Are we active in the gospel, or are we merely busy in the Church? \n\nThe key is to follow the example of the Savior in all thin… RT @kennedybreann_: Biggest debate I have with anyone.. help a sister out 😅\n\nRT for Spotify Premium\nLike for Apple Music I’m to the point in the summer where all I’ve done is work. So I’m ready for school to start so I’m not just working and sleeping. RT @LDSquotable: “Every one of our paths is different, yet we walk them together. Our path is not about what we have done or where we have… RT @kaitnielsen: Excuse my vent tweet but I hate the fact that when I exercise my body starts falling apart and I cant be fit without killi… Best feeling is when you’ve won the dating game and you get marry your best friend and the love of your life! #eternity #september1st #futuredallinga https://t.co/rIxdQID5mG @timtamburg Yay!! Good luck broskee!!! 🎉🎉😊 I always feel bad emailing my missionary...all I have is health problems...but his prayers do help ❤️ #missionarylove RT @AggieLifeUsu: ITS GAMEDAY AGGIES. 🏈 RT @jeremykjars: People who talk and laugh really loudly in the library are generally the worst type of people in the world. #CollegeProble… RT @LDSquotable: \"We don't have to be perfect to experience the blessings and gifts of our Heavenly Father.\" - Dieter F Uchtdorf @teenerific I'll break in with you!!! Having to drive to Viewmont every morning makes me super grateful I don't have to stay parked in that awful parking lot I'd avoid me for the next week, unless you have ice cream to feed me (: Dear Viewmont,\nBe friends with John from Sweden! But be nice to him! Cause I'll come get you if you don't!\nLove,\nHis friend in college Not ready for my sister to move to college. I feel like she just got back from Russia... Get put on crutches and then I throw up at work...it's a good week for Sarah... Finished the high school career on crutches, starting the college one on crutches! Thank you summer for letting me be crutches free Right when I was becoming useful after knee surgery, I fall down the stairs and become useless again 😂😂 #storyofmylife I'll admit. This is the first time I had to go to the doctors without my mommy... 😭😭 RT @chelleb111: Prayers to the freshmen who don't know about the cop in Mantua yet. When one job is super nice when you call in super sick and the other tries to convince you that you aren't sick... RT @Sadie___Morrow: MAD respect for missionaries that love the gospel so much they'd leave their lives for 2 years to teach it. Some how I am capable of going to work the day after an ER visit #iquit Missing my Led Zeppelin loving boy ❤️ http://t.co/uaC8Lgd8JB Friends that come visit you after being in the ER &gt;&gt;&gt;&gt; I just need to start collecting all the hospital bands I've had to wear 😂👌🏼 When I didn't get my weekly doctor visit in last week, I had to make this weeks an ER visit! http://t.co/doiCf4b9OT @BradyAvery23 I do!! (: RT @LDSquotable: \"Pondering is, in my feeling, a form of prayer.\" - Marion G. Romney That DTR was great! I think I'm even more in love 😍 RT @LDSquotable: \"It is now more important than ever that we stand together and follow Heavenly Father’s plan to bring his children home\" -… I wish everyone knew how much the Lord loves them and hates to see them suffer People ask me why I'm happy even with my trials and I always say, \"God gave me this trial to bless me in the future\" RT @EthanCramer: Music can take me back to the happiest and darkest times of my life, the times I'm dying to re-live and the times I forgot. That moment when I didn't know...and now he's leaving... RT @AbbieHodg: My favorite part about going to the temple is the fact that no one there can pronounce my last name What is a trip with friends without an all nighter ✌🏼️ RT @EllieAckley: FAFSA is dumb because it doesn't account for the college students who are paying their own way through college. 😒😒😒😒😒 Today I am grateful that I'm graduated so that I'm not at band camp right now ✌🏼️ RT @LDSquotable: \"You cannot convert people beyond your own conversion.\" - James E. Faust RT @LDSquotable: \"The family is the most important unit in time and in eternity and is ordained of God.\" - Quentin L. Cook RT @drakepcook1: Utah girls&gt;&gt;&gt;&gt;Cali girls In a super grateful mood ❤️ RT @teenerific: @sarahlynn465 🐪💨❤️💛💚💙💜💖 Dear @teenerific,\nI heart 🐫💨❤️ you. \nThe end. Sunday is definitely the day I cry the most. Yay for farewells! 👌🏼 Cause my sister could be getting engaged soon, so I just asked her to be my maid of honor 👌🏼 RT @missionaryprez: \"Clearly anyone who thinks Jesus taught no-fault theology did not read the fine print in the contract!\" #ElderHolland #… RT @LDSquotable: \"True love can alter human lives and change human nature.\" - Thomas S. Monson RT @Ethan_Hansen1: The smell of rain ❤️. RT @LDSquotable: \"If you desire to make a difference in the world, you must be different from the world.\" - Elaine S. Dalton RT @GordonBHinckley: All women are Daughters of God. You cannot offend them without also offending Him. RT @BookMormon2day: http://t.co/cn3eMGYCDh RT @AubrieRobbins64: Gotta say... Having to say goodbye to someone you love for 2 years is such a bittersweet thing RT @LDSquotable: \"Because of the Atonement of Jesus Christ, we can learn from our experience without being condemned by our experience.\" - … My desire to get out of bed is a zero. But now I need to pee... RT @LDSquotable: \"I can do all things through Christ which strengtheneth me.\" - Phillipians 4:13 RT @nhansonhp7: Her: I love you\nMe: I haven't felt an emotion since Harry Potter ended. I like clipboards cause they make me feel official This rain is really inconvenient for this cripple... RT @teenerific: Refreshing your email every 2 minutes. #missionarymonday I am so glad there are adults on the road in the early morning hours to suffer with me. #livinganadultlife RT @AtaliNielsen: All these rising seniors posting senior pics already... Guess what? School hasn't started yet! I got mine two weeks befor… RT @LDSquotable: \"Be of good cheer, and do not fear, for I the Lord am with you, and will stand by you.\" -  D&amp;C 68:6 RT @kaitnielsen: Stop getting married I don't even have a boyfriend. 😂😭 RT @TimDBurgoyne: When you hate someone and you have every right to, but you know hating isn't right. Go on a double blind date with the sister: ✅ This gospel brings pure happiness into my life and I ❤️ it! RT @teenerific: 🎶I need thee, oh I need thee. Every hour I need thee! Oh bless me now my Savior, I come to thee🎶 @rileyplott4 @KristenAlley2 aaaaaaaaaaahhhhhh!!!! ❤️❤️ When you have a best friend that is best friends with your boyfriends little sister, and she starts to text you things his sis is saying... RT @teenerific: Confession: I can't pass a lemonade stand and not buy some. It just. THE KIDS ARE SO CUTE. 🍋❤️🍋❤️🍋 RT @LDSchurch: Don't give up. #Faith http://t.co/DkDirFQH63 My week out of surgery will be consisting of me watching friends and romantic comedies 👌🏼 Drugs from surgery make you do weird things... 😂😂😂 RT @ShillBraden: If you ever want a good laugh: Read your journal from elementary school and count the spelling errors. My socks are better looking than your socks 👍🏼 http://t.co/W8YEh1Y14C @TimDBurgoyne is obviously the greatest friend! He brings me Dr. Pepper and this hilarious shirt after surgery! ❤️😂 http://t.co/loqgf5K8Rc RT @teenerific: I just really like fruit snacks. That's all. RT @aimee_bowen: I love lacrosse. #dbab RT @Sadie___Morrow: I was team Shawn since day one juss sayin 🌹❤️ RT @teenerific: When I actively live the gospel I am HAPPY. My trials don't go away, but I can more easily and cheerfully bear them. I love… @TimDBurgoyne aw Tim!!! I love you!! Thanks man! ❤️😘 RT @TimDBurgoyne: I'm still amazed with all the surgeries, doctor visits, and many other health stuff, @sarahlynn465 still smiles brightly.… Things I've missed: the sound of my sister playing the oboe and my sister playing the piano and singing ❤️ Apparently I like to have 2 surgeries within 4 months 👌🏼 RT @KristenAlley2: I swear nothing makes me angrier than when someone is rude to my family. I literally become the Hulk. RT @teenerific: Oh how lucky I am to have friends who love the Savior, and actively try to be like Him. I'll always be the friend that's there for you. I care too much about you to see you hurt. RT @Sadie___Morrow: http://t.co/UvHKtTacYL RT @EthanCramer: Do you remember when it was actually worth getting up early on a Saturday to watch cartoons?  \"favorite\" if so. RT @nhansonhp7: There are 4 seasons in Utah:\n\nFall, Winter, Spring, and Construction RT @rachpitt23: Happy birthday Joey!!!! 😍😍😍😍 how you doin? ;) http://t.co/5lkKNPXZ1Z The neglect here is real 👌🏼 In-n-out employee problems: morning work meetings. When you can't eat gluten and you go to a different ward and you have to awkwardly tell the deacon that you can't eat the bread...😳 It feels great to be able to text my sister again! ❤️👌🏼👍🏼 RT @TimDBurgoyne: Listening to the radio in the car, and \"Carry On My Wayward Son\" came on. I may have freaked out a little bit. 😍😆 #CarryO… RT @missionaryprez: The most important part of prayer is what we do afterward. #lds #twitterstake RT @BallardMRussell: Become acquainted with the Lord. Give the Lord the opportunity to share His love with you. I have a really bad fear of scissors now...so I'll never use them... #stitches RT @GordonBHinckley: God will always make a way when there is no way. #lds RT @ObedientMormon: And the Lord stood with me and gave me strength. It's only 6...I feel like it's 11 o'clock at night... Well. The he's been sent off to the MTC. I'm so proud of my boy! ❤️ http://t.co/HAdxuM6IAg RT @mydUkeS: The work is demanding, the impact everlasting. This is no time for 'summer soldiers' in the army of the Lord. —Thomas Monson #… RT @ThomasSMonson: We truly need Him every hour, whether they be hours of sunshine or of rain. @HannahMbarge you could feel the awkwardness in the room... @HannahMbarge when he came down the escalator I yelled at him, but I don't think he recognized me 😂😂 She's home!! 😭😭❤️❤️😍😍😘😘 http://t.co/jn8iIKFBna When you see Mr. Wright at the airport while waiting for your Sister 😁😂 http://t.co/BxqILbnJlD RT @alliball19: Henry is hoping this vid goes viral by the time he gets back 😝💗 see you in 2 @King_hen96 ‼️ http://t.co/KUZYM23xd0 @ChristianWhi like all of Christian's Instagram photos: ✅👌🏼 @ChristianWhi I followed you back 😁 I'm gonna like all your pics now 😉 Doctors last week. Stitches today. Surgery next week. http://t.co/S6RDv7etXC Today I'm grateful for the friend I lost in high school who finally turned around and realized what went wrong ❤️☺️ RT @vhscompliments2: #GrowingUpInUtah \"mounain\" \"layon\" and just not being able to say 'T' in general. RT @LDSquotable: \"When through fiery trials thy pathway shall lie, My grace, all sufficient, shall be thy supply.\" It's my mummy's burfday!!!! ❤️❤️ http://t.co/MRGCWTw9z3 Today at work I witnessed a couple seeing each other for the first time since he left on his mission. I admit that I cried RT @JRHollandQuotes: First and forever, fan the flame of your faith. @TimDBurgoyne adulting isn't that hard 😉 I've been doing it all summer long 😜 Definitely not ready to say goodbye to my best friend ❤️ http://t.co/Vbk7sYxnAa I hate the dentist. But I love it when they clean my teeth. But i hate the dentist. RT @LDSquotable: \"Be steadfast and immovable, always abounding in good works, they Christ, the Lord Omnipotent, may deal you his.\"  - King … RT @LDSquotable: \"God is my salvation; I will trust, and not be afraid; for the Lord Jehova is my strength and my song.\" - Isaiah RT @kaitnielsen: There's three types of people I like in this world.\n1. Gamer nerds\n2. HP, LOTR, Star wars nerds\n3. Twenty-one pilot fans Sometimes when my boyfriend isn't home I stay there anyways and play with his younger siblings. #bestworkoutever RT @brittanysears19: I just wanna look good for you Normal people schedule surgeries at least a month in advance. I schedule mine two weeks in advance. #kneesurgery @ChristianWhi heck yes. I'll be eating a lot of ice cream within those two years 👍🏼🍦🍦🍦 @ChristianWhi Baldwin 😄 When your boyfriends ex girlfriend hates you and she's good friends with your best friend 😂😂 #thethingsigettold I feel like I lost all my privacy since I can't go to the bathroom or shower with the door locked anymore... #seizureproblems Go away train. Who do you think you are honking your horn by my neighborhood when I am almost asleep??? RT @Sadie___Morrow: But to be quite honest I hate thunder RT @ThomasSMonson: God our Father has ears with which to hear our prayers. He has eyes with which to see our actions. He has a mouth with w… RT @missionaryprez: You don't need to be the most popular missionary or have a particular leadership position.  Just be humble, just be you… @alliball19 bring on all the missionary photos! I like them 😄👍🏼 I thought I had convinced myself that saying goodbye was gonna be easy, but really, it isn't. RT @BTJ_44: After getting a major surgery a month ago and being completely normal I can honestly say that 9/10 times wisdom teeth videos ar… When you wake up from a nap super sick, but it's too late to call into work... RT @LDSquotable: \"True love can alter human lives and change human nature.\" - Thomas S. Monson RT @OnlyMormons: If you're Mormon, your favorite comedies are Napoleon Dynamite, Nacho Libre, or Hot Rod.\nNo exceptions. RT @LDSquotable: \"In his own time and in his own way, the Lord will bring about his miracles.\" - Neil L. Andersen RT @elleejo3: I hate how much I like you RT @brittanysears19: 20 minutes till I'm an adult 😱😱😱😱 RT @lizbeal_: Really really really really really really really really really into you I cried while watching this! It made me so happy! ❤️ https://t.co/NWmlmTFH2X RT @LDSquotable: The Bountiful Temple http://t.co/YfdYzhmZWr People wish me happy birthday tomorrow and I sit there confused and then I remember that my birthday is tomorrow I'm actually enjoying this new snapchat update (: I want to be at Utah State right now. No where else. #futureaggie RT @MadiGarlock: Rule 1: don't let a girl go to bed sad. Never let the fear of striking out keep you from playing the game I really kind of sort of love this kid! ❤️ http://t.co/wm2ArfCeYE I like that I can just tap to see people's snapchats 😄 Reasons my boss is the best: he told me he gave me a morning shift on the 4th cause he wants me to be able to party tonight. @teenerific this is why I love you! RT @LDSquotable: \"The command to feel The Savior's love is also a promise.\" - Henry B. Eyring Happiest of the Birthdays to my absolute favorite thumb! @rachillax ❤️😘 RT @Sadie___Morrow: How can we not talk about family when family's all that we got RT @LDSquotable: \"The Lord's truth is not altered by fads, trends or public opinion.\"  - David A. Bednar RT @ReeseCampbell: My birthday is one week from tomorrow and it's doesn't feel like it RT @LDSquotable: We were not placed on this earth to walk alone. - Thomas S Monson I could have slept all night. But my parents love me so they woke me up to eat dinner ❤️ RT @kaityokaykayy: love won over 2000 years ago when Christ died for those who would never love him back. RT @lizbeal_: LISTEN TO THIS💕 https://t.co/P9D8GPkivo Despite all the negative challenges we have in life, we must take time to actively exercise our faith RT @brittanysears19: I turn 18 in 10 days 👅 @LizaE14 did that then begged my dad for a calling 😂😂 RT @OnlyMormons: The Church's official statement. http://t.co/QwzfQJpWEK RT @TimDBurgoyne: Say what you want. I'm not scared. I fear God more than man. Nothing you can say or do can change that. #DaretoStandAlone… RT @EthanSumsion: Today is such a historic day\n \nThe day Joseph and Hyrum were martyred 170 years ago RT @EllieAckley: Kind people are my favorite kind of people. The thing I look forward to the most in my days are the naps after work 👍🏼👌🏼 RT @brittanysears19: Boys that give random compliments to girls are winning 👍🏼💯 RT @LDSquotable: \"Great purpose comes into your life when you make it your quest to follow the will of the Lord.\" - Randall L Ridd Worked one job this morning. Quit another this afternoon. Heading to the next for tonight. I kind of sort of only work 😜 RT @missionaryprez: \"Will we be able to say that we rolled up our sleeves and labored with all our heart, might, mind, and strength?\" #Pres… RT @missionaryprez: \"We were sent to earth at this time that we might participate in hastening this great work.\" #PresMonson #lds @ChristianWhi I'm a bad girlfriend and don't know how long him and I have been together... #dontcare #missionbound @ChristianWhi @TimDBurgoyne Tim always plays the ladies 😉 RT @TimDBurgoyne: It's not about the girls you kissed and never saw again. It's about the girl you kissed and kept kissing. People like to tell me I'm not going to make it on a mission cause I'm gonna get married. But all I talk about these days is a mission 😂 RT @lefevre_annie: I wish I could sing My best friend ❤️ http://t.co/3GY5Mx6tdw RT @tristyn_13: if my future husband is even half as great as my dad, I'm gonna be lucky RT @LDSquotable: \"My father gave me the greatest gift anyone could give another person, he believed in me.\" - Jim Valvano RT @TimDBurgoyne: You know a recurring customer is such a pain in the butt when guy on headset calls out, \"Larry's here!\" And everyone groa… Every girl needs a guy best friend who's shoulder she can cry on and text at 1 a.m. venting to him ❤️ RT @BTJ_44: Lol at making the mistake of caring. If anything...I'm done being led on... The 3 year wait for Utah State will definitely be worth it. #missionbound #AggiePride RT @LDSquotable: \"Though we may feel we are a broken vessel, we must remember that broken vessel is in the hands of our maker.\"  - Jeffery … Sometimes I text people at midnight when I get off of work and I remember that they actually get time to sleep...So they won't be responding One of my co-workers bought me a slurpee after he got off work❤️ I'm so blessed with amazing co-workers ❤️👍🏼 RT @LDSquotable: \"You cannot convert people beyond your own conversion.\" - James E. Faust When you're your friends parent's favorite&gt;&gt;&gt;&gt; 😁😊👍🏼❤️👏 My boss didn't think it was funny like I did that I was having an allergic reaction 😂 Now that it's summer, I'm actually good at the game Words With Friends! 😂😂 @ChristianWhi @TimDBurgoyne boys boys! The first person to bring me food is my soul mate 😉 My one wish in life is that I wish I wasn't allergic to all the yummy foods The only good thing about late night shifts is that we all end up singing Disney songs Tiare together ❤️ @TimDBurgoyne @ChristianWhi oh man! Things are getting intense over here @ChristianWhi @TimDBurgoyne ooooooh! This is exciting! ❤️😁 @TimDBurgoyne @ChristianWhi well apparently I'm everyone's soul mate 😉 @ChristianWhi oh my gosh! So much yes! When you're at a work training and everyone is eating and you can't cause you have severe food allergies... #mylifeisjustthebest The customers that Cole into work 10 minutes before we close, there is a special place in Hades for them. IPhones need to have swipe text. RT @TimDBurgoyne: I've had SoupstuF songs stuck in my head for the past few days. Not even complaining.😆 #soupstuf #tragicmagic #vaporize Dr. Pepper shots every time that they say awesome in the Lego Movie 😂 When you're best friend is on trek and you have nothing to do...so you decide to just work all week @TimDBurgoyne what's better? If I'm there with you 😁 RT @Sadie___Morrow: It's through the hardest times when you find out who your true friends are. I have THE best of friends 💕 The struggle is so real! No matter what they ask you some go ask if they want onions on that (:  https://t.co/524GVHUjqo I just want my mission call right now. Dear people that are going on vacations,\nPlease post tons of pictures for me to see! ❤️\nLove, the girl who will be at In-N-Out all summer😁 RT @haylee_rian: can't wait for this day to happen. http://t.co/H50tGo5g0S RT @GordonBHinckley: Be prayerful. You can’t do it alone. You know that. You can’t make it alone and do your best. You need the help of the… This is the saddest thing of my life! Everyone should be able to walk at graduation!  https://t.co/bc2iBYM17g RT @dylanfsmith18: a lil jack johnson medley for your sunday evening http://t.co/MTQgRbES55 RT @LDSquotable: \"The infinite Atonement is for both the sinner and for the saint in each of us.\" - David A. Bednar Right when him and I start to work out, my best friend has to go and try to ruin it. Graduation with the best friends!!! ❤️❤️❤️ http://t.co/JDn1ll2h0k Everyone is saying they couldn't sleep cause of excitement for graduation and I fell asleep the moment my head hit the pillow RT @EllieAckley: WOW WE GRADUATE TOMORROW RT @TimDBurgoyne: People are surprised that they graduated from Seminary, and I'm like, \"I missed only about 2 days per year...\" 💁👍😇 #semin… RT @yeezusal: after high school over http://t.co/lXVbevF37P I just randomly decided I want a Utah State pillow case... 👍🏼 RT @TimDBurgoyne: God doesn't make mistakes. You were born how you are for a reason. Any mental of physical difficulties you have are given… @TimDBurgoyne yeah...we already knew I had problems 😉 Hey everyone, in remembrance and love of our beloved apostle L. Tom Perry dress up nicely for school on Monday! (: #honorelderperry @TimDBurgoyne I get bloody noses in both nostrils a lot... RT @rileyplott4: Once upon a time there was a boy who loved a girl, &amp; her laughter was a question he wanted to spend his whole life answeri… RT @GordonBHinckley: Without hard work, nothing grows but weeds. #Lds RT @LDSquotable: \"All your losses will be made up to you in the resurrection.... By the vision of the Almighty I have seen it.\" - Joseph Sm… @TimDBurgoyne I guys this is what happens when I let you have my phone 🙈 Don't you love when someone takes your phone and tweets for you? Man... Best thing ever ;) #totes I'd rather eat tons of gluten tonight instead of sing a 30 minute Mozart song When there is no more OJ and that's literally all you drink... After all these early morning choir rehearsals this year, I'm surprised I'm still alive RT @14avarley: Kauri Tye is my hero! RT @EllieAckley: This weather is making me miss seattle☔️ The living prophet tells us what we need to know, not necessarily what we want to hear. RT @Landry_Thomas: It's interesting to see how much the LDS church can do with 10% of money than our US government can do with 50% #churchi… I'm ready for summer, but my body isn't. I kind of sort of just really love food a little too much. ❤️ It's a good day. No more crutches and no surgery needed on the knee! ❤️❤️😭😭&lt;----(tears of joy) All of the nurses at my knee doctor know my name...they always say, \"hey Sarah! Welcome back!\" Every time they see me coming... 😂😂😂 @MrMorris6 I will come put it on for you. I don't need to lose another friend cause they weren't wearing there seatbelt. It feels great to finally be able to talk like friends again @ChristianWhi I did something similar to that! 👊🏼 I looked at my countdown to when I can turn my mission papers in 5 times today expecting it to be closer everytime RT @LDSquotable: \"As I read, the spirit of the Lord was upon me &amp; I knew.. that the book was true as plainly.. as a man... knows that he ex… RT @NicoleHodges7: #RelationshipGoals for real 😍😍😍 http://t.co/xcijl8S85o RT @LDSquotable: \"Love is the very essence of the gospel.\" - Thomas S. Monson You know you're best friends when you take naps together when you are hanging out The fact that I just sit on my phone for most of my classes obviously means that I have no desire to actually be here Proud momma moment! My brother played the snare on the Harry Potter Medley in his concert! #thesnareishard RT @Sadie___Morrow: WHY DO BAD THINGS KEEP HAPPENING TO ME RT @LDSquotable: \"Life is to be enjoyed, not endured.\" - Gordon B Hinkley RT @MadiGarlock: In 3 weeks we all go our our separate ways... I don't know how I feel about that. I feel like my heart has been ripped out and was shredding to tiny pieces. RT @LDSquotable: \"I can do all things through Christ which strengtheneth me.\" - Phillipians 4:13 Rain. Choir festival. Crutches. Not a good combo. Late night car rides with the him and singing at the top of our lungs. Now that's love. ❤️ RT @LDSquotable: To be a Christian is to admire Jesus so sincerely...that the whole life goes out to him in an aspiration to be like him. -… Poker brings out the mean and sassy side of me RT @TayyJohnss: Mother &amp; Father Green are relationship goals @ChristianWhi that makes me feel better about not wanting to do them Thanks wheat test for telling me I'm allergic to gluten. I kind of already knew that 😜 Don't let satan ruin your family. You need your family and they need you. Love each other. I just realized I still need to make my graduation announcements...but my desire to do anything is a big fat 0 RT @LDSquotable: \"Are you a Mormon? Well you should, its a great religion? \" - L. Tom Perry The JAZZ BAND has stolen my heart ❤️ RT @Mac_Swenz: HOW IS IT ONLY WEDNESDAY RT @LDSchurch: Sister Bednar suggests using \"For the Strength of Youth\" as a missionary tool. You can find it here: http://t.co/1j8KKH7AKU … RT @LDSchurch: \"Our actions reflect our beauty more than physical appearance.\" #SisterBednar #LDSface2face RT @EthanCramer: Sometimes, we need to be hurt in order to grow. We must lose in order to gain. Sometimes, some lessons are learned best th… RT @22emilynicole: \"You do not fall in love, you create love.\" #LDSface2face You might never know the answer to a question. The lord only reveals things in his own dew time Keep pressing forward and you'll get through the doubts you have b You know enough for the things that the lord is going to put you through. Doubt your doubts before you doubt your faith! You don't have to walk the path alone. I can do all things through Christ that strengthens me. The worst mistake you can make is to not turn to the lord to help you through your mistakes. RT @LizaE14: Sometimes it's just touching how well someone knows you. Like when Pinterest suggest the perfect board for your pin.💕#Flawless… Heaven is in charge. Let it happen and you'll be blessed. RT @LDSquotable: \"If it invites and entices to do good, it comes from Christ. And we ought to do it.\" — David A. Bednar The lord is by our side loving us and guiding us in our decisions. The answer may not come all at once, but keep pressing forward and seek the rest of the answer. Sorry, not sorry, for the spiritual tweets overload. If it invites and indices to do good, then it is from Christ. The mission field is the best place to learn. Both spiritual and secular. Seek learning by faith We can get heavenly help in learning the gospel. When you have the light of Christ in your eyes, you are beautiful. Ask the lord to help you get rid of those bad thoughts. He's the best at helping. I hate being crippled. I honestly just want to go to the temple. It's only a sin if you don't cast out that bad image or thought. So cast it out. Have faith to open your mouth and declare the good news Sometimes your example is the only scriptures a person ever reads. How do I tell my friend, I was going to room with, with my change of colleges and not making her angry? #LDSFace2Face Sometimes I don't tell my carpool girls about me and a boy until 2 months later 👍🏼👌🏼 When your band piece makes the percussion section shine&gt;&gt;&gt;&gt;&gt; @TimDBurgoyne 😂😂😂😂 He just fell to the ground laughing cause he touched my butt!! 😂😂😂😂 Duh I meant it when I said it. If I didn't, I wouldn't have said anything. RT @kayley_sweet: never ok to lose friends over a boy, especially your best friend T-30 minutes and I will be speaking to the \"Russian\" sister! RT @iamkidpresident: MOM upside down is WOW. http://t.co/LFB7fF3cBH http://t.co/PR6oeJhAkT Being on crutches can't stop the fun I get to have with some of the greatest friends ever! #SeniorBanquet RT @jayturne: http://t.co/LDpD6wGgtj RT @AbbieHodg: Tonight I was proud to call myself a member of the class of 2015 RT @adisill: i don't know what i would do without you. RT @jayturne: I think book clubs are just relief society without the relief. RT @dylanfsmith18: Viewmont's parking lot is scary enough without all these parents smh I absolutely love talking to the old people at physical therapy! They are my favorite! 😍 The smile on my face is huge! He finally texted me first! 😍 RT @lizbeal_: Wait it's senior ditch MONTH right?? RT @vhscompliments2: @sarahlynn465 talented. 💖 Sometimes you just have to cry RT @Sadie___Morrow: http://t.co/fT761cmR03 Fairy Tale Logic 💍 (W/ LEO THE GIANT) (Vine by @foster_dawg) https://t.co/OITuOgtOcL I should probably get out of bed for this thing called school...but my desire to go to school is a big fat 0 #unconventionalinstruments Part 2 Chains vs. Black Widow - Nick Jonas Rita Ora Iggy ... (Vine by @kenzienimmo) https://t.co/Mjkko82EcA All my friends be taking AP tests this week and I'm just sitting here like, \"do I have tests in my 5 music classes?\" RT @EllieAckley: This year has been freakin weird but I wouldn't change it for anything RT @TimDBurgoyne: #SeniorYearIn5Words \nWait, that was due today? Your example could be the only scriptures someone ever reads The prayers of the righteous bring great things When your selfie game is on q http://t.co/iH7Llmj2if Sometimes I forget I'm crippled, and I go to sit crisscross until I feel a lovely year in the knee...😭 RT @Whit_Eversole: Plz everyone pray to the math gods and the AP gods and any other god you please because Calc test tomorrow 🙏🙏🙏 I just got a random craving for sushi... RT @itsindysev: Please look after your friends. Make sure they are well &amp; okay. Sometimes they are going through things that are really hea… RT @DFiefia: Viewmont Girls ❤️ RT @kendylfaye: why do the best things go by the fastest? RT @BiIIMurray: I’m just going to put an “Out of Order” sticker on my forehead and call it a day. RT @BiIIMurray: I love sleeping, it's like death without the commitment. RT @TessWoodward1: Did you find my blood on the dance floor? #goinghard RT @TimDBurgoyne: I have a hard time believing that tomorrow is Prom. My last high school dance... So glad I'm going with my friends! #seni… RT @lizbeal_: Guys.... Senior prom 😱 RT @bayray_gunther: LOL. I hate everyone. Can I just graduate already? RT @stephbabe1414: hey hey hey. it's the first day of May, outdoor kissing starts today! 😘 I totally forgot tomorrow is prom...stupid state band has been on my mind... We get water bottles when we \"graduate\" physical therapy! That will keep me coming! RT @EllieAckley: Prom weekend😊😊😊 When your really thirsty at night and water tastes like heaven! @karakillinit I hope you watch me get picked up for prom secretly in your car 😁 RT @MrMorris6: I mean, let's be real here; Viewmont is freaking talented. RT @LDSquotable: \"Heavenly Father knows that you will make mistakes, this saddens him, but he loves you. He desires that you rise up.\" - Di… @rileyplott4 I'll pray for you!! 🙏🏼🙏🏼 I was secretly hoping that my crappy car would live forever. But it kind of just had to die. RT @ThomasSMonson: In the temple we can find peace. @lizbeal_ @deidra_thomas96 my mom wouldn't let me go to prom if I didn't do mine...that was my motivation... I'm to the point in my life that I would rather be at physical therapy instead of school RT @ChaneyMooney: Everyone RT this please. 60,000 RTs for nap time for a week😴 http://t.co/9QDiQ6eQX9 😂😂😂😂😂😂 https://t.co/H0QjXRyl9l It's funny cause I am😂😂😂 https://t.co/7wMRMaOBbB Just got hit on by awkward junior high kids while proctoring the percussion test... My worst fear is happening! Being in my car when it's about to die... yes. i did just have to do an inventory on my sisters closet. yay for missionaries returning :D Tears of happiness have been shed. I can finally walk on both feet with my crutches. That awkward moment would be my whole life! https://t.co/ha3B0DjJol RT @jrauch13: I've learned to just screenshot people's instagrams before showing my mom so she can zoom all she wants Don't ever leave your phone unattended in percussion ensemble without a passcode... Things happen... RT @alliball19: If you're not passionate about it, why do you do it? Just finding random walkie talkies in jazz band... Greatest thing the doctors told me yet: \"taking a bath with hot water will help your knee muscles\" 😁😂 Sometimes I wish I was athletic. Then I remember how I broke my arm falling up the stairs. All these juniors freaking out about choir auditions and I'm sitting here like, what?? College auditions are worst. The end #ialmostthrewup I'm still waiting patiently for the day that I don't have to be on crutches anymore RT @caity_cat9297: I hate that feeling when you see something &amp; your heart literally breaks, but you have to sit there &amp; pretend you don’t … RT @AbbieHodg: Never underestimate the impact of a sunday afternoon nap RT @rileyplott4: I have the utmost respect for young men that worthily hold the priesthood.❤️ RT @codydover27: Allergies are the worst! 😣 RT @Whit_Eversole: Woods Cross WOW. That prom was AMAZING 😍😍😍😍 VHS could learn a lesson or two from you The things that people getting upset about...it sometimes makes me want to hit you with my car 😂 @TessWoodward1 so glad I'm not the only one My bed is so comfortable...but I really need to pee...but I'm so comfortable... She's married now. I don't know how I feel. http://t.co/pYQHlwNSvg RT @LDSquotable: I can do all things through Christ which strengtheneth me. - Phillipians 4:13 \"You're a brave soul if you can put a bag of ice straight on your skin without a towel\" -Physical Therapist Assistant- The fact that I have to hyperextend my knee makes me want to cry... I'm gonna have some dang good looking calfs after all these exercises after physical therapy! Just saw a lady get out of her car to help an elderly man cross the street. I admit. I cried. It's risky. But it's bold! I love when I get the job to sit in the hall and tell people to shut up when they are being loud by the band room 😁😂 Some girl just walked passed the auditorium and heard the band playing a fabulous song and smiled! That's right! We are that great! 😁 RT @ObedientMormon: God loves you, even when you make mistakes.  #DontForgetThat #TwitterStake I get to talk to my sister in 17 days!! 😍😍😍 It's definitely not my dream to have to be at Davis High for 5 hours listening to choirs sing... @smithee2123 same here girl. Which is why I would love to not be here... RT @rachel_forbes1: You know what's cool? \n\nBlinkers. Don't you all wish that you could have a lovely conversations with the elders at physical therapy 😉 RT @EllieAckley: High school becomes fun when you have a positive attitude about it. @TimDBurgoyne at least you aren't gone for 2 months 😜 Watching him play the piano melts my heart! ❤️❤️🎹🎹 @ChristianWhi snapchat story with all of our lip syncs! 😂😂👍👍😂😂 Just hanging out with my new best friends at physical therapy #oldpeople #imtheyoungesthere If you see me come to school with red eyes, it means I just got back from crying at physical therapy 😭 RT @LDSquotable: We were not placed on this earth to walk alone - Thomas S. Monson Because I walk slow cause I'm crippled my family said prayers without me... Rude. RT @LaurBooth3: I need a snowcone and a cute boy in my life RT @EthanCramer: Will you be my girlfriend sounds so much better than will you go out with me.  Do you agree? \"favorite\" RT @TimDBurgoyne: If someone is brought to tears when talking about the gospel, you know they truly believe. And you know it is the truth. … RT @LDSquotable: Peace comes from knowing that the Savior knows who we are &amp; knows that we have faith in Him.. even amid lifes devastating … My life will move on, but my music will last forever ❤️ I just over heard someone say, \"why do drummers have to be so cute?\" That's right! Drummers are definitely super attractive! RT @mikelle_ulrichh: If the longest ride doesn't make you want to have a lover then I honestly don't know what will. RT @Sadie___Morrow: We all too often forget how blessed we really are RT @jayturne: Plot twist: everybody else makes everything awkward. A girl just walked into a practice room freaking out to me that I was playing \"Life of the Party\" by @ShawnMendes 😁 #lifemade I'm pretty sure most of the food I pin on Pinterest is NOT gluten free Right now I am so grateful for my knowledge of this gospel. I wouldn't be where I am today without it. RT @brittanysears19: The people I talked to last year at this time are so different than the people I talk to now When almost every single Meghan Trainor song describes your love life... My mom doesn't need to worry about planning my wedding. Just planned it all out. Thank you Pinterest. @AbbieHodg if you write it I'll buy you in-n-out 👍🏻 RT @QuotesHotrod: \"You know what car is super overrated? Corvette.\"\n\"You mean like the one Jonathan was driving?\"\n\"Oh, is that what he was … RT @nhansonhp7: Me: For Christmas I want a dragon!!\n\nSanta: Be realistic.\n\nMe: Ok I want my life together.\n\nSanta: What color do you want y… RT @King_hen96: Dear Elder Blackburn\nYou are assigned to labor in the Texas Houston East Mission.\nIt is anticipated you will serve for a pe… RT @46taybrown: If you saw the size of the blessing coming, you would understand the magnitude of the battle you’re fighting. RT @Thesupercole: You'll never be satisfied as a Christian if you're still holding on to some of your past sins and life. Let it all go. Co… RT @dylanfsmith18: settlers of catan is my shiz Who's idea was it to put Seattle Life on Snapchat right when I got back... #iwannagoback Being the only girl in the percussion section can be interesting at times 😂 RT @LDSquotable: \"Love is the most powerful force in the world.\" - Dallin H. Oaks RT @Katy_kattt: Pretty much http://t.co/po11P6IoQA RT @brittanysears19: It's easy to pick out your own flaws When you're crippled you make your younger brother and his friend run to the door to answer to prom 😊😘 At the knee doctors and there is a guy wearing shorts, flip flops, and a sweater... RT @TessWoodward1: I think the whole senior class has collectively decided that graduation is no longer a necessity Coming back from SEATTLE was a bad idea... ❄️❄️ Crutches + Snow = 💥💥 He asked if he could call my smile sexy!! 😍😍 RT @EllieAckley: I miss the humidity and the markets and all the shenanigans of Seattle I can't look at SEATTLE pictures anymore. It makes me realize I'm almost done with being in choir with awesome people. And then I cry. Today I was hoping I would wake up in Seattle How they make sure everyone is on the bus in SEATTLE: cripple are you here? Me: yes 🙈 I was sleepless and crippled in SEATTLE! RT @rachillax: @sarahlynn465 ah thank you thank you❤️❤️❤️☺️ RT @EllieAckley: Rip to THE best trip of my entire life. Thanks Seattle for being so so so so rad. RT @AbbieHodg: Wishing I was still in Seattle with my choir babes 😢 @rachillax and her rap skills 👌 RT @davidhjkim7: oh.... my.... you probably don't even know that you're a hypocrite 😂😂😂 like what??? I've been lied to before in my life, b… RT @EllieAckley: Have fun at school while all of the choir trip sleeps in at a 1940s horror film hotel I don't think this SEATTLE trip could have just gotten any more awkward for me... RT @lizbeal_: The problem with traveling out of state is no fry sauce RT @Whit_Eversole: The spirit of God is contagious I sound like a man more than I normally do... Giving blame doesn't fix anything. On my bus whenever we drive anywhere, they point out all the hospitals and dr offices to me... 😑😂 RT @brittanysears19: I'm thankful for the people that take the time to ask if everything is okay. Those are the people you need in ur life. Just feeling like a hobo sleeping on the ferry floor 😂😂 Put a bunch of band kids and choir kids on a ferry and you'll stink up the flipping place... I want to be with the rest of the choir. But being crippled makes it not a thing. If I had a dollar for every weird look I get cause I am in a wheelchair, I would be a billionaire! 😂 When you are stuck at the bottom level of the boat, while the rest of the choir is on the 3rd... RT @EllieAckley: I am IN LOVE with Seattle 😍 RT @Mordecai2715: Brb gunna sleep the rest of my life My left leg is numb...crippled problems... Play date with Orem choir! 😂😂 My gratefulness for the Johnson's is so huge right now!! I was sleepless in Seattle yesterday 😉 RT @EllieAckley: Seattle is cool 😎 @HannahMbarge thanks babe! 😘 Sometimes I forget that school is happening this week #ChoirTrip2015 RT @SydDelacruz: I love when guys call me \"my girl\"..... Like \"how's my girl?\" I'm freaking good. I'm freaking way good. Call me that again. @ColeUtefan is my hero! Saving my butt uphills! RT @EllieAckley: Live tweet from who knows what state You know you didn't get enough sleep on the bus when you hear Jaden says he's going to be a movie star... 😂😂 RT @mattnewey96: Beautiful things don't ask for attention. When you aren't on the same bus so you text each other Finding Nemo quotes! 👍👍 RT @TimDBurgoyne: That awkward hour when you pack really fast cuz you're super excited. But now you're just sitting there, waiting for it t… Why does packing have to do stressful?? RT @MadiGarlock: Hey weather wtf are you doing. RT @TimDBurgoyne: 20 mins until the end of school, then it hit me. SEATTLE!!!! 😆😆😆 #Seattle2015 #superlongbusride #soready #concertchoir It's a good thing that my phone can be unlocked with my finger print. I forget my passcode way to much. @HannahMbarge and this is why I love you!! 😂 My excitement for SEATTLE is seriously so how right now I could dance around! If I could dance around 😝 RT @Whit_Eversole: Beyoncé over the intercom, this is gonna be a good day 💃 @smithee2123 girl! That be my song too!! 😁😁 By the time I'm off these crutches  I will be able to beat anyone in an arm wrestling tournament. I'm kind of sort of really excited to go to prom with this stud! 😊😊 http://t.co/ZqcevZNxL0 Some guitarists in jazz band just asked me to serenade them by playing the piano and singing 😂😂 Now that I have a vine. I will never get enough sleep... My goal in life was to not have another surgery after brain surgery...the gallbladder is gone and knee surgery soon..I'm doing really bad... RT @thewaynehoskins: Love looks not with the eyes, but with the mind. -Bill Shakey Dang. I need to just skip over all his families posts about his call. I don't think I have anymore tears left. RT @MrMorris6: Guys, let's be real here. Babies dressed up like little old men are the real MVPs. RT @EllieAckley: I love the Mormon Tabernacle Choir and I love music and I know that the church is true. Happy Easter. RT @missionaryprez: Elders/Sisters: Get out your notebooks. The Spirit will teach you something that you can share this week with someone i… My Twitter feed is my favorite during general conference! RT @MonsonQuotes: We laugh, we cry, we work, we play, we love, we live. And then we die. And dead we would remain but for one Man, even Jes… RT @CaleBybee: Lol only Utah would have protestors protesting protesters protesting Mormons. RT @MrMorris6: Gain a testimony by choice, not by circumstance. Also. Feel free to bring me ice cream 🙈 Got the text of where he was going. I cried. Like a baby. Gonna miss my man and best friend. RT @AbbieHodg: Virginia is getting another fine missionary. Congrats to one of the best friends I have ever had 😊 I LOVE YOU JAKE!! http://… RT @LDSchurch: \"It is vitally important that our children know they are loved and safe at home.\" #ElderCook #LDSconf RT @LDSchurch: “The service that counts most is usually recognized by God alone.” #ElderRingwood #LDSconf http://t.co/EUdPKvCvOb RT @LDSquotable: All I really want in life is to please my Fathers, both earthly and heavenly #ElderRingwood #ldsconf RT @chmsant: Ask yourself, \"Who can I help today?\"  That's what #ElderRingwood is saying here #LDSConf RT @1lovin_life: Don't be a latter-day quitter, sinner or Hypocrite! #truedat! #ldsconf #byui RT @LDSquotable: My invitation to all of us is to evaluate our lives and keep on trying #ElderRenlund #ldsconf Just keep on trying! #ldsconf My excitement to get to be on crutches in Seattle is so much right now... RT @LDSquotable: We will not accidentally come to believe in the Savior ... any more than we will accidentally pray or pay tithing. #ElderC… RT @LDSquotable: \"Your courages decision to believe in him will bless you.\" - #ElderClayton RT @LDSquotable: \"Jesus Christ is the source of truth and light for all of us. I pray that we all may chose to believe in Him.\" - #ElderCla… RT @LDSquotable: Come unto Jesus from every nation, from every land, and isle of the sea. http://t.co/qOiZ0Tz0Ue RT @LDSquotable: \"We were and still are members of God's family.\" - #ElderPerry RT @LDSchurch: \"Family ties can continue beyond the grave.\" #LDSconf #ElderPerry http://t.co/nGWdk2J5ye RT @LDSquotable: Our marriage ceremonies eliminate the words ‘til death do us part’ and instead say ‘for time and for all eternity.’ #Elder… Speaker talking about marriage. My mom turns around in the car and says, \"in 3 years you can get married.\" I cried. Choose to believe! #ldsconf RT @jenjenjarvi: The phrase 'I love you' scares me and people be throwing it around like fairy dust!!¡!!¡¡ Thank you Meghan Trainor pandora station for getting me through the torturous wait at the airport @TimDBurgoyne I can do that (: @TimDBurgoyne dang. Hehe. What can I bring you? 😁🙈 @TimDBurgoyne I'll bring you Popsicles! 😁 I feel like I'm on the bachelorette and I am at the last episode where I have to choose which guy to say yes to... @TimDBurgoyne I'll be there 😁 as soon as I get back to Utah 😁 @TimDBurgoyne I'll send you snapchats so it feels like you're here with me 🙈 Disneyland + the best friend = best spring a girl could ever get http://t.co/1xZOpKxtjl The life of a crippled...wheeled around Disneyland! #hurtknee http://t.co/aR4XGonORZ My parents let me drive to the airport with my excitement out the door! They must really trust me! #California #disneyland I need to finish packing... But my bed won't let me get up... @TimDBurgoyne 👍👍👌👌😍😍 I just got called a Molly Mormon. That's what happens when your dad is in the bishopric... RT @TimDBurgoyne: Apparently rage-quitting orders is common. Too bad you're too angry to eat. Take a stroll to clear your head. And don't c… RT @98Kings: Pink lemonade from in n out is heaven Wow. I'm not part of the drumline anymore, but I'm still exhausted from the competition. I need to get out of bed...but I'm too sore from last night...I partied a little to hard... #soupstuf @thewaynehoskins is officially my new hero &amp; role model in music! #thewaynehoskinsband http://t.co/ExMwtNMaIw @soupstuf are the only people I will lose my voice for! If you aren't planning on coming to @soupstuf 's release party tonight. We can no longer be friends. #soupstuf “@soupstuf: Tonight's gonna be a big night.... Don't miss it!!! #excusemeflo #soupstuf #mojos http://t.co/0Owc9UzjIW” BE THERE OR BE SQUARE! RT @brittanysears19: You can't get girls because you're disrespectful that's why. @IssaKatelin we can cry together and eat ice cream since I'm not going either I'm already planning all these great things to do the night of from because I have a gut feeling I won't be going 😂 Dear body. It's the end of the term. Spring break is next week. Please be nice to me for once. Thank you. Sincerely, the accident prone one RT @LandonCrowther: End of term is the worst. RT @MrMorris6: Dear students of Viewmont High School,\n\nIs it really necessary to trash the restrooms? We all gotta use 'em. Why not keep th… Apparently today is pick on the altos day in concert choir... @smithee2123 I'll come see you Saturday 😊😊 @smithee2123 I have to write a talk still and choose a musical number... 🙈 That's right. I'm at BYU waiting to see Vocal Point 😊😊 @ChristianWhi don't worry I'm not 😁 It's cool. Me and my best friend are going to Disneyland at the same time. 😊😊 I'm just feeling that festival season needs to be over Having to pick up from junior high makes me remember how much I hated junior high According to doctors orders, I should be asleep right now... My neighbor broke her arm on her tramp and my mom told me this is why she never bought me a tramp... #accidentprone Morp was definitely out of this world!! 😊😊 http://t.co/XBYLVlI8iw RT @EthanCramer: Sometimes it's not the song that makes you emotional.  It's the people and things that come to your mind when you hear it. @EllieAckley I just did a little happy dance for you! And sang a little happy song 😜 haha Solo ensemble is going to be the death of me @MrMorris6 and I'm really liking this idea! My coworker just hugged me for 5 minutes because I was crying after a very horrible day at work. #feelingblessed RT @EthanCramer: The best relationship is when you can act like lovers and best friends at the same time. @MrMorris6 I just want you to know that I think you are fabulous! And so freaking talented! Things that bug me: when people say I'm not going to make it on a mission because I'm going to get married. Yes. That pretty, amazing, freakishly awesomely talented sound coming from the band room is the symphonic band. We are just that good. That moment when you and someone accidentally act like you guys are dating... #awkward I just need a day that I can get LOTS of sleep RT @OnlyMormons: Girl why don't you take off those skimpy clothes of yours ;)\n\nAnd put on some more modest ones c'mon your body is a temple. @ChristianWhi yup! 😁 Who knew not having a gallbladder could be such a problem! 😜🙈 Someone just came up to me and asked me if me and my seminary co-president would date...I don't know how I feel... #heisacutiethough RT @MrMorris6: It's March 17th. I am wearing gray jeans with a white shirt and a black and blue sweater. If you pinch me, I will break your… Yes. We do keep track of how many phones we can get on the altar in seminary! @ChristianWhi In-N-Out!! 😁 I just need to stop falling for the wrong guy... I just sneezed and it echoed through my whole house... @anniekate1322 you just made my life!! It's definitely a Monday... @smithee2123 yes he does! 😜 @smithee2123 yes yes yes!!!!! @smithee2123 sounds like a plan! @smithee2123 I'm so glad we are feeling the same way right now about people... I thought the drumline could be dramatic....but the choir is worse... So there's a band concert tonight at 7 and it's going to be so freaking amazing! So I vote you all go! 😁 RT @missionaryprez: Elders &amp; Sisters: You're the hope of Israel.  #lds #calledtoserve Everytime someone mentions prom I just want to hit them with my car. Thanks for reminding me that I'm probably not going with my man When it's pi day and you're severally allergic to pie... @TimDBurgoyne @ChristianWhi then there are some of us girls who got there hopes crushed cause that one kid ain't asking her I need to write my talk for tomorrow... But my eyes won't stay open RT @MadisonFlynn8: ok can boys stop having skinnier legs than me @ChristianWhi I wonder that too! It's kind of annoying. Cause that's a girl thing 😜 One word. SoupStuF. Yup. My church cleaning buddy was the cutest. RT @Mac_Swenz: lacrosse tournaments are the best because you get really nice sunburns, cool socks, and get to look at guys with nice hair a… Reasons chaston wants to kick me out of Jazz band: a get all giggly whenever they practice uptown funk and Tanner is singing Everybody getting their mission calls makes me so stoked to get mine! @smithee2123 that was pretty dang great! \"Amy you should put your phone on the alter too!\" Just had a discussion in gov why cars with bench seats are the best place to make out... 🙈 RT @alliball19: ✨ http://t.co/5ihngk63ko My coworker just informed me that the perfume I wear is the same perfume that his ex girlfriend wears...well...can't wear that anymore... Don't judge me. But I'm crying about my brother being gone for the weekend. I mean, there went my weekend plans RT @brittanysears19: Forehead kisses are one of the better things in the world RT @EthanCramer: Music, when it hits you, you feel no pain. A cute college percussionist winked at me today. I think I'm in love. You know you're related to your band teacher when he doesn't let him leave his office until you are not dizzy and can walk without falling My man is learning about my fashion so he can compliment me and know what I'm wearing 🙈 RT @HaileyDevine3: Good morning, darkness! 🌜Can I go back to bed? RT @ThomasSMonson: If we will but realize that we have been created in the image of God, we will not find Him difficult to approach. Someone asked me if I missed my gallbladder. I said, \"heck no! It would have been the reason I would die young!\" RT @kaitnielsen: Happily single. A Phone call from my boys mom about roommates for choir trip just happened 😜 RT @mikelle_ulrichh: I love Sunday's on Twitter because everyone posts spiritual things, so here's mine 😊 http://t.co/PJxE1G83r7 Keep freaking my mom out by telling her that a year from today I can turn my mission papers in I need to stop looking at my missionary farewell countdowns...I'm going to cry... @TimDBurgoyne I guess that works too 😜 @TimDBurgoyne I guess I can't buy you in-n-out on international men's day...you'll be on a mission... RT @sydfullmer: By David A Bednar http://t.co/5K18z403Vb @TimDBurgoyne wait?? You're in Ephriam without me??!! @TimDBurgoyne on international men's day I'll buy you in-n-out 😊 RT @missionaryprez: \"You can know you have been a successful missionary when you go about doing good and serving people at every opportunit… RT @davidhjkim7: I seriously want to get ice cream rn  😍  😍  😍 @Whit_Eversole I just randomly say tacos whenever I hear people talking about dating now I'd rather eat a taco than have a boyfriend. RT @TimDBurgoyne: Missing breakfast on a Saturday is not my favorite. But missing it to help set up for baptisms is totally worth it. #chur… RT @LDSquotable: \"In His plan there are no true endings, only everlasting beginnings.”\n- Dieter F. Uchtdorf RT @aarontaman: Marry someone who will make you grilled cheese RT @Whit_Eversole: You can't afford to put your heart in the hands of a boy who would rather be holding a taco Can you play the chord at measure 73? Of course he can! He's Tanner! RT @BaylorTangerter: It's a good day. I don't know why, but it's a good day 🎉 My phone just autocorrected \"bad girl\" to \"band girl\"! #bandgeek @rileyplott4 I'll find you a tanner! 😊 I kind of just want my Twitter feed to be full of all the boys mission calls. But I don't want them to go... #sendinganelder RT @allisonallreddd: prom dresses are just so much freaking fun. @EllieAckley me too! I want to get asked in a cute way, and then go find the greatest dress ever! 😊 When you don't feel good at work, but you have to keep reminding yourself that this is how you're paying for college... Today at work a little boy came up to me and asked me to be his girlfriend! Let's just say I have the cutest \"boyfriend\" ever! 😁 Mg: Sarah! If you're in band, you need to switch to choir so you'll stop hurting yourself.\nMe: I'm in both band and choir\nMg: you would be When everyone is talking about finding a prom date and you are praying you don't get canceled on again this year! RT @autocorrects: When I tweet something funny and get no retweets or favorites http://t.co/TiXItxcHPr Mr. Chaston was in an A Capella group in college...greatest thing I've ever heard the cousin admit! 😁 Well this is exciting. I can't open my right eye. That's cool. I don't need to see. (I really don't want to fall down the stairs...again). After the morning this side a got a confirmation that serving a mission is the right thing for me! #LDS #futuremissionary RT @BaylorTangerter: I feel that often, as a Mormon community, we aren't as accepting and loving as we need to be. Let's all make a better … Putting contacts in at 5 in the morning is the worst thing I've ever done to my eyes... RT @BaylorTangerter: Morningside tomorrow at 6:15! Be there!! The women tell all is my favorite episode of the bachelor! If you need me I'll I'll be dancing around my house to Meghan Trainor 😁 I'd like to thank the juniors for letting me sleep in today! You guys are such sweethearts! 🙈😁 @ChristianWhi your snapchat story is my favorite! I hate telling people my problems. But sometimes it's nice to get them off your chest. I'm pretty sure Christmas was 3 months ago... RT @lizbeal_: Freak no to the snow @alliball19 I feel you. And my sister happens to be in Russia. My heart and brain are fighting. I'm not liking this. That's right! My dance instructor was in high school 2 and my drumline instructor was in high school musical! 😊 #iknowfamouspeople Sometimes I wish my life was like High School Musical! 🎤🎶🎹 Things that drive me crazy: when a guy doesn't respect my dating standards. #whyihavemyman When you're excited to go to church. But you wake up super sick... If I see or hear one more thing about the dress, someone is going to get him with my car\n#addedtomyhitlist When all of your sisters friends are getting engaged...I'm not ready to let someone else have my sister... I just really watching chick flicks when my boy can't hang out. 🙈 @EllieAckley time to get a Utah state one! 😉 I've already taken two naps today... @TimDBurgoyne and I'm sitting here like I'm going to Snow... RT @Whit_Eversole: Sometimes I can't get over how much I love the piano 🎹 I opened a new tissue box just for when I see posts about mission calls! #sendinganelder #waitingforthesister #emotionalwreck @smithee2123 oh my gosh. I was holding in so many snotty remarks... @EllieAckley I'll see you there! 😜 Dear ladies. Tanner is mine. Yup. That Danny Boy is mine! RT @BaylorTangerter: If I see one more picture of this dress... No phone use to hashtag...\n#choirsubs RT @NayKidLegs: Too bad they don't have fiiz in Disney world. I'm dying. Pinterest stopped working on my phone. Time to go home and curl up in a ball and cry. RT @SNOWMINE: I hope this dress isn't the last string to break and cause the collapse of civilized humanity as we know it Blue and black. What the heck does it mean?? Being there when your band director fan girls over meeting a famous composer=greatest thing all night When you get out of band solo and ensemble&gt;&gt;&gt;&gt;&gt; I don't know what it was...but I got out of bed actually on time today... RT @rachpitt23: Proud to be a vike!!! Amazing game boys!!! RT @VHS2015ANP: We need more followers please retweet and see if you can help boost the numbers. Seniors, get your friends on!!! Food. That's all I can think about when I am taking tests... @EllieAckley @BaylorTangerter it really kind of does. You can have him 😊 I have @TJtanman 😜🙈 “@vhscompliments2: Let's be honest. Our real relationship goals are @MrMorris6 and Kristine. 😍”\nIt really is though! 😊 @deidra_thomas96 I made a paper chain countdown today cause of that... Well. Senior pictures. It's real. Only 101 more days and I'll be done. http://t.co/lL8ifol6DD It's so cold and windy that I am probably going to wear sweats to school tomorrow! @smithee2123 if it wasn't bad, I would have totally shared my gallbladder surgery pain medication with you 😜 RT @LDSquotable: “No pain that we suffer, no trial that we experience is wasted.”\n- Orson F. Whitney @smithee2123 I came to school with my chipmunk cheeks and a big fat bruise on my cheek when I got mine out... When your drumline is in the news for being awesome&gt;&gt;&gt;&gt; Having recent scars on stomach makes hard for me to itch it when itchy... Dear Trivia Crack: \nWhy must you make me feel so stupid? @EllieAckley I 💜 you! Just turned my alarm on for the first time in a week...can I please still use surgery as an excuse to not go tomorrow... @ChristianWhi 👍👍👍👍 @ChristianWhi meeeeee!!! 😊 Yup. I'm his biggest fan. 😍 http://t.co/eL1tsmBHSx Yes. I am so out of it I did just put my pajama pants on over my other pants... “@innoutburger_: Would you like onions with that?”\nI ask everyone one that...even when I'm not at work... If you see me running around. Slap me. Remind me I had surgery. And send me home. And feed me chocolate. @EllieAckley well after you have a child I'll make sure I bring you a butt load of sushi! 😊 Reasons I watch the bachelor: drama. Drama drama drama. If you need me, I'll be on my couch drinking chocolate milk and eating ice cream 😊 RT @ThomasSMonson: You can achieve what you believe you can. Trust and believe and have faith. How am I up passed 12...I haven't been able to do it all weekend... Hey thanks for taking all our snow this winter Boston! You're a real pal! I'm sorry for all my pins on Pinterest. It's all I'm physically capable of doing after getting my gallbladder out. Dear boy that just wants a girlfriend:\nGo find a girl that just wants a boyfriend.\nSincerely the girl who wants someone to actually love. @EllieAckley its what happens when the kid you wanna ask is so dreaming popular and there are crazier girls then you! 😊 I believe that I win for having the best Valentine's Day ever! Watching movies and sitting on the couch! #surgeryswag RT @MirandaSings: Happy valentimes day to myself. Who needs a valentine when you have friends and family that 💜 you so much! (: http://t.co/GN5fPiNVM3 “@innoutburger_: Who needs a Valentine when you can have In-N-Out?”\nI will admit it. I did have in n out today... #innoutisbae @karakillinit anything yummy (; haha and gluten and dairy free 😜 haha!! RT @davidhjkim7: Valentines day w/ Netflix 😍😍😍 @Whit_Eversole I'll feel like a totally loser for you while I sit on my couch cause surgery 😜 haha Happy Valentine's Day from me and my holy self!!!! 😊 “@Phillips: Every scar has a story” like gallbladder and brain surgery 😜 @karakillinit it went super well (: \nI would love you forever if you did! 😊 @karakillinit its a good day to have surgery! 😜 How to be attractive 101 http://t.co/VyIzc3Xnwu @Landry_Thomas I'm so glad I'm not the only one that feels the need of this to stop! Dear Trivia Crack:\nRemember that I am the least sporty person. \nLove, the girl who always gets sports and knows nothing about sports @MrMorris6 this is why you are the best! 😄👍💜 I'm prepared to not have a social life this weekend and next week. Thank you gallbladder surgery. My phones is a good girl. It knows how long it will take me to drive to school (; If you're a true friend to me. I'll be a true friend to you and stay up as late as I need to to listen to you vent when you need to. Dear people. I'm preparing to be translated. I've gone to the temple 2 days in a row. RT @Sadie___Morrow: Do re mi fa so shoot me now #choirprobs RT @BaylorTangerter: Come to the seminary lunch activity today! Speed dating, card making, and cookies. Drop by! @TimDBurgoyne haha! Thanks for catching up with the times! 😜 @TimDBurgoyne how did you not know it was Jennifer Lawrence??? “@innoutburger_: I want In-N-Out. The real question is, when don't I want In-N-Out?” I always want in n out...even when I work there... You know you hate school when you are excited to miss it due to surgery Welcome to my neighborhood where new houses are popping up constantly and I never meet the new neighbors. Everyone had there valentines dance yesterday and I'm all like, \"well Viewmont's is actually on V-Day! Take that. Dear really bad headaches of mine,\nYou can take yourself and move to Russia. I'm done with you. \nLove teenage girl who loves sleep @TimDBurgoyne No Brett! I took a class! It's oceanography! Yes. I am taking Oceanography as my science class in college! The only thing that got me out of bed this morning: I was going to pee my pants if I didn't. @ChristianWhi Nate Hodges and my neighbor both got theirs today (: and most kids are starting to turn theirs in Let it begin. All the mission calls are arriving! The shower: the place I pretend I am an amazing Broadway singer. Twinning is winning. http://t.co/KyU4hE5Kxa So if I could just stop having to go to the doctors that would be great! 👍 The doctors office has become my best friend... Fiiiiiizzzzz! Best stop after the temple! (: @FiizDrinks http://t.co/Jg1s0OdnhB Percussionist problems: you can't bring home your instruments to practice like the rest of the band When a customer tries to get your number at work at your coworker comes up and says, \"she's too good for you!\" 😄🙈😂 RT @EllieAckley: High school is hard, guys. Be nice to each other. RT @KJP: Justin Bieber nails his best performance ever during tonights halftime and the fans love him more than ever http://t.co/GK4iEfPk3I I will admit it. The only reason I am watching the super bowl is cause Idina Menzel sang the national anthem! I just realized that @innoutburger_ is the only burger place that's burgers look like they do in commercials in real life! @EllieAckley you got this girl! You are so fracking talented!! Good luck!! Well he's off to show those Utah State professors what's up!! http://t.co/pVqwbnWkfC When your little brother cries harder than you during a sad movie&gt;&gt;&gt; I'm pretty sure that Adam Levine can sing high than me... So far in disappointed that we don't have hover boards yet. RT @vhscompliments2: @sarahlynn465 such an amazing musician. I love you. The regret of updating snapchat is so much right now. So I vote that graduation be here and done with already. Yes. I am wearing footie pajamas tomorrow. @EllieAckley do you need my sisters?? Shes gone! She won't notice! (; “@YikYakApp: \"I think more people would rather go to Hogwarts than go to Harvard.\" — University of Virginia”\nI know for sure that I do! @EllieAckley I'm so glad I'm not the only one that spends every hour after school watching white collar! 😄 RT @LDSquotable: \"I truly believe that one virtuous young women, led by the Spirit, can change the world.\"\n- Elaine S. Dalton The best day of the week: Thursday. Aggie Thursday. You could say I am in love with the Jazz band! 🎺🎷🎸🎶 Most people's after school snack is cookies or peanut butter sandwiches. But mine is stuffing! When your choir teacher confesses of being Mr. Snow College! 👌 The cold side of the pillow&gt;&gt;&gt;&gt;&gt;&gt; RT @sydfullmer: I'll always be a firm believer that a good girls night can fix just about anything💁🎉 @smithee2123 amen! I see it all the time...I don't even cry that much... @TimDBurgoyne that sexy!! @EllieAckley slowly but surely getting use to facial hair... 😜 Chris Pine is single. Ladies. He's mine. My Pinterest knows when I need to go to bed. It stops loading the pins. @innoutburger_ #bestjobever #dontmindmychristmaspin http://t.co/Y3BdEZxlMs I'm in love with Matt Bomer...but he's so famous...and gay... @EllieAckley I don't know l can't stand it! I mean there are lots of people that look good with it...but I just can't stand it (; haha He shaved. We can be friends again. #ihatefacialhair The way to my heart = in-n-out! “@innoutburger_: In-N-Out is like my home away from home.” \n#yes #myjob #mylife “@BestTextMsgs: Hug her from behind. We love that.”\nExcept for me. I will elbow you in the stomach you'll have intestinal track problems. “@innoutburger_: Would you like onions with that?”\nIn-n-out associate problems...ask everyone that when they say they want something... RT @HaileyDevine3: Why does music feel so good? To all football fans.\nThe reason that Ohio State won tonight is because they just have a wicked awesome marching band! The end. RT @LDSquotable: For ye are all the children of God by faith in Christ Jesus - Galatians 3:26 You could say that gallbladders just ruin social life... #gallbladderattackfordays When people ask me if I am sensitive to loud noises: no way Jose! I am a flipping percussionist! 😜 Becoming Spider-Man and then Captain America in one day?? That's how I roll!! Becoming Captain America after having radioactive stuff injected in me?? Heck yes!! (: http://t.co/A70SozsWnO I've radioactive stuff going into my veins! I'm becoming Spider-Man!! http://t.co/8Tm40ke50L I just sat there out of pure boredom re favoriting the same tweet over and over again because I was entertained by the exploding star... 😷&lt;&lt;----- ԵհíՏ ҽʍօյí հɑՏ օƒƒíϲíɑӀӀվ ҍҽҽղ ղɑʍҽժ ɑՏ ʍվ ҽʍօյí\n#accidentwaitingtohappen A doctor visit a day keeps Sarah safe... #thedavidmerkleylife @Robyn_Boyd3 yeah... We're going to Disneyland while sam's in Russia. But she told us Russia is better 😉 @Whit_Eversole I think I'll be coming to you for advice when my man leaves on his mission! You are honestly doing so great! (: #thedavidmerkleylife http://t.co/Ljdx7BbnnM RT @GordonBHinckley: I invite every one of you, wherever you may be as members of this church, to stand on your feet and with a song in you… Kevin: apparently turtles can breathe through their butts!\nMe: no...\nKevin: it's true! I learned about it on trivia crack! ᴼᴴ ᵞᴼᵁ'ᴿᴱ ᴰᴱᴬᵀᴴᴸᵞ ᴬᴸᴸᴱᴿᴳᴵᶜ ᵀᴼ ᴳᴸᵁᵀᴱᴺ? ᴼᴷᴬᵞ! ᴸᴱᵀˢ ᴮᴿᴵᴺᴳ ᵞᴼᵁ ᴸᴼᵀˢ ᴼᶠ ᴳᴸᵁᵀᴱᴺ ᶠᴵᴸᴸᴱᴰ ᵀᴿᴱᴬᵀˢ ᵀᴼ ˢᴴᴼᵂ ᴼᵁᴿ ᴸᴼᵛᴱ ᶠᴼᴿ ᵞᴼᵁ...#my life #glutenisakiller @hutcherzonn ᴵ ᵂᴼᴿᴷ ᵀᴴᴱᴿᴱ! ᴵᵀ ᴵˢ ᴮᵞ ᶠᴬᴿ ᵀᴴᴱ ᴮᴱˢᵀ ᴶᴼᴮ ᴱᵛᴱᴿ! ᵀᴴᴱ ᴼᵁᵀᶠᴵᵀˢ ᴬᴿᴱ ᴮᵞ ᶠᴬᴿ ᵀᴴᴱ ᴮᴱˢᵀ ᴬˢ ᵂᴱᴸᴸ! ᴮᴱˢᵀ ᵟᵁᴼᵀᴱ ᶠᴿᴼᴹ ᵀᴴᴱ ᴮᴬᶜᴴᴱᴸᴼᴿ: \"ᴵ ᵂᴵˢᴴ ᴵ ᵂᴬˢ ᴬ ᴾᴼᴸᵞᴳᴬᴹᴵˢᵀ!\" \nᴹᴱ ᵀᴼᴼ ᶜᴴᴿᴵˢ. ᴹᴱ ᵀᴼᴼ. ᴿᴱᴬˢᴼᴺˢ ᴵ ᴸᴼᵛᴱ ᵂᴬᵀᶜᴴᴵᴺᴳ ᵀᴴᴱ ᴮᴬᶜᴴᴱᴸᴼᴿ: ˢᴼ ᴹᵁᶜᴴ ᴰᴿᴬᴹᴬ ᵀᴼ ᴱᴺᵀᴱᴿᵀᴬᴵᴺ ᴹᴱ! ᴮᴱˢᵀ ᶠᴿᴵᴱᴺᴰˢ! ᵀᴴᴬᵀ'ˢ ᵂᴴᴬᵀ ᵂᴱ ᴬᴿᴱ! 😊 http://t.co/MqzLITi0Qe I officially can't look at Facebook anymore...nothing is going to happen to your account... Staring at the clock will not make it change faster. It's true. But it will change after staring at it for a couple seconds then lookin away Take, O Take Those Lips Away... I feel like my choir teacher is trying to make sure that that kids doesn't happen... http://t.co/yXb6G4BpyN RT @YikYakApp: \"It's 2015 yet Chipotle still doesn't deliver?\" — Palm Beach Atlantic @LandonCrowther thats the only reason I have a Facebook now... 😜 RT @LandonCrowther: Social media arguments literally could replace the funnys in the newspaper (and bring back newspaper popularity for tha… @rileyplott4 that was me last year every day last year... 😜 RT @rileyplott4: Y'all complaining about school tomorrow. I have early morning seminary.😅 Long breaks from school full of nothing but work, make me want to go back to school...to socialize Happy birthdays to the one and only @ajmackmcintosh 😄 Signs you have the best job in the world: you are okay with working lots of hours! #InNOut When you realize that Christmas break is over and you actually have to go back to school and socialize with people... @EllieAckley amen!!! @EllieAckley it's why I watched it when I was drugged! 😜 RT @YikYakApp: \"I've been single for so long I forgot how to spell relasingleship.\" — Notre Dame Well new year! Let's make it not so dramatic... RT @EllieAckley: This year I become an adult, graduate, go to college, see my best friends leave on missions...2015 is the year of change RT @Tslot69: honestly my goal for this year is to be happy. genuinely. intensely. consistently. happy. 💗😘 http://t.co/O2rjnzFWEp RT @LDSquotable: \"Behold they did watch steadfastly for that day and that night and that day which should be as one day as if there were no… Music music music music. Music music music music. Music music music music. MUSIC. http://t.co/AgVXBrj3aw RT @LDSchurch: He lives. Pass it on this holiday season. #ShareTheGift http://t.co/fUntaJWj6r RT @Mac_Swenz: Too scared to drive to work I will be blown away I may have wanted to tag along to Russia with Sam. But I didn't think that Russia would be brought to me since I couldn't go with... Me. I tend to always be the only girl at hang outs! #meandmyhomeboys hacked by my brother. Never leave Twitter logged on. New Years Kiss?? No. I want to be hugged and handed a thousand of Hershey kisses! #chocolateadict RT @Phillips: Follow the dream, follow the flare. For sale: an obnoxious 13 year old boy... Christmas break: stay up late, sleep all day, eat, take a nap, eat, stay up late, sleep. #sleep #food #christmasbreakprobz You know you are old and have to grow up when this is your Christmas present... http://t.co/tvfz46zGrl"}