{"tweets": "DOWN DOWN BAD video my boyyy  \n\nwith real deal superstars @JIDsv @Bas @EarthGang @PDE_YOUNGNUDY   https://t.co/0Hv4ywv23Z 😂😂😂 log in to tweet this Down bad video and this what I see. https://t.co/Lqb9avKnGz Wow... that’s crazyyy. Go get @wale album out now. Congrats my boyyy https://t.co/D1fJsugIPi @JIDsv @Bas @EarthGang What the fuckkkkkkkkkkkkk. 🤯🤯🤯🤯🤯🤯🤯 Family and Loyalty Video 💎💎💎 \n\n@gangstarr @REALDJPREMIER   \nDirected by @Fab5Freddy \n  https://t.co/2mMVC3xNBO This a honor to be on this song. NEW Gang Starr  🤯🤯🤯🤯 💎💎💎💎 \n\nThis is the last feature you’ll hear from me. Thank you to everybody I got to work with during this run. 🙏🏿\n\n@REALDJPREMIER  This song a classic, thank you. RIP GURU\n\nhttps://t.co/MMBI5Z2Fcq RT @REALDJPREMIER: DROPPIN' AT MIDNIGHT...\n@gangstarr https://t.co/N6G5zGM9Y4 Under the Sun video 🐕 \n\nhttps://t.co/vWcw36A5kA    Carolina shittttt This film moved me. https://t.co/xp1AqFK7o9 EARTHGANG 🌍  MIRRORLAND    \n\nOUT NOW \n\n🤯🤯🤯🤯\n\nPress play change your life. \n\nhttps://t.co/tKoKg8mayB   \n\n@Dreamville @EarthGang EARTHGANG SO MUCH FUN   @youngthug  out now 🐍 https://t.co/5ojGmTdbJZ We shot the Sacrifices video. \n\nhttps://t.co/ruYapFcPVd Thank you @Kaepernick7  we ain’t forgot. \n\n@nfl let the man work. https://t.co/l9Ce9DQ1xD RT @KingOfQueenz: @Bas Deluxe?? Sacrifices RT @EarthGang: LETS GOOOOOOO #MIRRORLAND OTW!! https://t.co/rblyqVcerI JADEN ALBUM OUT. 💪🏿💪🏿💪🏿 https://t.co/nxJZy5jXyh https://t.co/BNHTA0Cv8n https://t.co/86ifRVaVvO Damn bro. The range of these verses is crazy. Bas pen 🤦🏾‍♂️   Potent https://t.co/JrftWxJBHl This the moment I realize @Buddy is a real life legend. Thank you Elite for the heads up, otherwise I woulda missed this song being made   @Elite https://t.co/q9CECqQxNb https://t.co/x5wenmUPIm RT @Bas: Got my first gold plaque with my bros last week. Would love nothing more than my first number 1 album, again with my bros, this we… Damn ib you was right. @KingOfQueenz https://t.co/knoxwxRSTe ROTD3 The Album Out now.    DREAMVILLE.  https://t.co/50OuwU1PI9 RT @Dreamville: Tracklist #ROTD3 #Dreamville https://t.co/x18pjvs3wW Thank you to Every artist on Dreamville for allowing me to be a part of your journey and in turn inspiring me and making me proud constantly. I’m proud of y’all for this album. Same goes for the producers that go unheard and make beats all day every day hoping to cut through. To the producers and artists that came through but didn’t make the album, you are there in spirit. Thank you for your presence, the energy of those sessions was the most magical. Revenge album dropping 2nite. Know that this album represents community and the unheard unsung artist that fight and bleed daily to be felt. There will be someone you never heard of on this album. Look them up and support them if they resonate with you. A follow goes a long way. That basketball is 100percent lying to the people dawg https://t.co/a5xdeionMm This how you sposed to use your Twitter ib https://t.co/sCEXO6Tx7R Nahhhhh run that shit back. TOO CRAZY. Take me back !!! \n\nhttps://t.co/YsTItr0TwC\n\nAlbum FRIDAY. Love to everybody that blessed the sessions !!! Watch the documentary on the making of the album Live now. ❤️❤️ https://t.co/YsTItr0TwC 2 offa Revenge album to hold you over. I’ll never forget walking into the room and hearing these 🤦🏾‍♂️ \n\nhttps://t.co/cir2Tu9wMk @ANG3X6_ Oh my God. You win bro. 😂😂😂😂😂😂😂😂😂😂😂😂 REVENGE tho Revenge of the Dreamers dropping this Friday. \n\nhttps://t.co/3JxZT4RMqT REVENGE: A Dreamville Film.  \n\nDropping Next week 7/2. Every time I watch it I wanna time travel back to the sessions.  ❤️\n\nhttps://t.co/IXjI9Dj2v8 Time always tell the truth 10 years ago The Warm Up dropped. Thanks 2 all that have listened 2 the foundation of my whole journey. \n\nMy catalogue on streaming services don’t even look right until this &amp; FNL are up. workin on it. \n\nDecade later and I’m still dreamin and tryna get better. God Bless First music from Revenge of the Dreamers 3. \n\n“Down Bad” featuring Nudy, JID, Bas, Me and Earthgang \n\n“Got Me” featuring Ari Lennox, Ty $, Omen, Dreezy\n\nOut now. \n\n🎯🎯🎯🎯   \n\nWhole Album on the way \n \nhttps://t.co/PJ7eMmtmhX Have a good summer. \n\nThug Cole Travis produced by T-minus. Out now. \n\nhttps://t.co/92kEKlS24a Cole Thug Travis dropping in 24 minutes Here go the New @tydollasign with me on it.  😈😈😈😈    Crucial  https://t.co/pl4WPxe3xT 🤦🏾‍♂️  This one beautiful. And forever. https://t.co/7IgI3w3NoY Get Ari Lennox album   \nDREAMVILLE https://t.co/wblhv8lmYi Ari Lennox the future. Album outttttttttttttttttttttttttttt    This shit crazy crazyyy RT @AriLennox: My album out y’all ❤️❤️❤️❤️❤️ need the album https://t.co/9CRCqsafNB RT @AriLennox: My DEBUT Album #SheaButterBaby drops May 7th 😱. Check out my new single “Up Late” and be sure to pre-save &amp; preorder now! ♥️… TIDAL STREAMING WHOLE FESTIVAL LIVE RIGHT NOW. https://t.co/oqlDMrWl4X Dreamville Festival. Today. 40,000 sold out. 🤯🤯 have fun Enjoy the show Nipsey you a legend. I respect and admire your career path and what you did for the neighborhood. My heart broke today when I saw the news. I’m praying for your loved ones. This was sposed to be the year we got one in. God had bigger plans for you 🙏🏿 It hurt when you see peers go RIP NIPSEY HUSSLE Interview to match.  \n\nLove to @XXL   \n\nhttps://t.co/tOfwWtxkB4 Whole squad made the cover. PRADA U.  DREAMVILLE. https://t.co/kLwzrRWFA2 @blissfulVILLAIN @KingOfQueenz Thinkin’ bout offering discount to anybody that show up in sandals and socks 🧦 Somehow GQ felt like it was a good idea to put me on the cover.  Thank you Allison for the cover story. Slime said I gotta start dressin’ like this all the time. We gon see \n\nhttps://t.co/8nHA5DGBgB We backkkkkkkkk.   \n\nDREAMVILLE FEST 2019 \nAPRIL 6TH 🌻 RALEIGH, NC\n\nTICKETS ON SALE AT https://t.co/1N6zZeTmpw\n\n@dreamvillefest @dreamvillE https://t.co/jDP7Iew5Ce Video directed by @Mez  straight out south side Raleigh. 🔥🔥🔥🔥 rapper and now incredible director. Thank you bro MIDDLE CHILD video out now https://t.co/Jroap7BGtz Middle Child video tomorrow @ 12pm eastern. I’ll be in the chat @ 11am. 👌🏿  https://t.co/0WcuEZ7Lkx https://t.co/L4XCzz2FTQ Middle Child video monday Offset album out right now. “Father of 4”.  I snuck one in at the buzzer. Congrats bro. 💪🏿💪🏿💪🏿  @OffsetYRN Ari let me be in the video. ❤️ this our song together. @AriLennox  Im a big fan. Her album is on the way (🤯) https://t.co/NanOCo7u67 So Far Gone super classic forever. Seeing Thug get a Grammy incredible. Future too. been deserved. March madness was bigger than the Grammy’s. And congrats Ella mai 👑.  6lack really deserved too, but don’t sweat it my brother. No award show could ever get it all the way right. Especially one that ain’t run by us https://t.co/CqzHNipGWa I went through a lot of heart break the first half of my career, maybe even longer, cuz deep down I needed that validation that I thought the awards could bring. But it’s a quote I’m about to google that’s the realist shit and sums up how I feel today. 4 anybody that need 2 hear i don’t never wanna be propped up by tearing somebody else down. Seeing Cardi b win a Grammy make me feel like I won. Same with jay rock and Anderson. I feel for Travis cuz he really deserved that acknowledgement as well, but his moment is way bigger than the awards could say Coward and a terrorist. https://t.co/fqdrUmUgBC Bet then 🙏🏿  @KingOfQueenz  they ready for it. https://t.co/AWxtPKhfAu This my shittt. PRADA U. New @EarthGang and @youngthug. Earthgang album #mirrorland on the way 🤦🏾‍♂️🤦🏾‍♂️🤦🏾‍♂️   Rotationnnn\n\nhttps://t.co/Np8rUXJfZZ Praying for 21 savage let that man be with and provide for his kids. Me and 21 video dropped today. A LOT   \n\nhttps://t.co/xJnSS6S2cB 👀👀👀 https://t.co/PyDL1LtLhM Knick fan again !!! Let’s gooooo   STAY SOLID @KingJames Thank you bro. Means a lot. Can’t wait to see you back on court. Thank you for all the love. Next month will be 10 years since I first signed to jay, I been so blessed in my life and career even when I wasn’t recognizing it. I appreciate all your birthday wishes. Time to switch gears ⬆️ RT @fatbellybella: Write it down on real paper with a real pencil with real intent and watch it get real . Spelling is a Spell. - eb Better link my bad y’all crashed the site earlier. https://t.co/QliSzO9Py1 Birthday outfit. (2nd time a charm y’all know I’m getting way better @ this)\n\nhttps://t.co/XePCl4DN8f https://t.co/xkYy2yb22O 💪🏿💪🏿💪🏿  let em know my boy https://t.co/lGvffH16vx ❤️ this made my whole week to keep it a buck https://t.co/vtNg3zMdaO @KingJames 🐐👑 Facto.  👀  @Dreamville https://t.co/Sp1G9riLJG This gon be a tough year for haters ❤️ MIDDLE CHILD 👶🏾 https://t.co/KMbCTZa0x7 Wow. Malcolm damn sure was.  🐐 MIDDLE https://t.co/PWWn2h8miZ Just got this from a real 🐐 MIDDLE.   Young man in swoosh ball cap is @Thundercat https://t.co/Shn1yOitcz My boy the youngest 🐐   MIDDLE @Giannis_An34 https://t.co/8iUltoVmLs 🤯 RT @JIDsv: “Ima give em something they can feeeeeeeeel”\n@JColeNC 🔥🔥 @Dreamville 2nd time a charm my link was fucked up My new song. MIDDLE CHILD.  Available everywhere now. This how I’m coming all year. This how \n@dreamville\n coming all 2019.  https://t.co/KMbCTZa0x7 Bout to post link but one streaming service ain’t up Yet MIDDLE 👑 https://t.co/nAU45wTECb He ain’t got no twitter but this A Rod of @dreamville   Super 🐐 MIDDLE https://t.co/m1kEa8rCte MIDDLE https://t.co/nSI5gn7oVT Nahhhhh 🐐🐐🐐 MIDDLE @KingOfQueenz    I need a picture of proofy https://t.co/SLUFHawRcc https://t.co/q7ENcaas75 🐐 MIDDLE https://t.co/8GNUDbQJZE https://t.co/XbhOXWElCj https://t.co/WYXmHTGLqB https://t.co/fmDiHYC2ff MIDDLE CHILD in 30 https://t.co/zzjbRK2qbK 9 o’clock hurry up 🕘 RT @JColeNC: New single coming 1/23 @ 9pm. Cole x T-minus https://t.co/fVbCsVJ2K9 New single coming 1/23 @ 9pm. Cole x T-minus https://t.co/fVbCsVJ2K9 The Revengers sessions are done thank you to every artist and producer that came through. I love y’all, that shit was beautiful. Next step, finish the songs and let the 🌎 feel em. Shed tears tonight writin a verse shit was beautiful. Revenge sessions going down in history ❤️ Bet. On the way. https://t.co/gbqDdVbTp0 Stay solid https://t.co/2SI1w9gy7a Praying for the people of Sudan. 🙏🏿 #sudanprotests 21 savage album out right now.  🔥🔥🔥🔥🔥  🙏🏿 We got one on there. Congrats bro @21savage Last night Ari Lennox sang on stage at staples center with Stevie Wonder ❤️❤️ 🎥 🍿   @JIDsv x Mr. Thisyourcharger?   Video out now    https://t.co/RbUV7pD0Kq I love it bro     @MeekMill   🔥🔥🔥🔥🔥   Album out right now. Congrats my boy 🤯🤯🤯🤯🤯  🤮🤮🤮🤮🤮🤮   Dicaprio2 is finally here. New album by @JIDsv Do your life a favor  🚑 🚑🚑🚑 don’t disrespect your existence  @Dreamville  https://t.co/uFOJPovgao Here go the link.  🧚🏿‍♂️🧚🏿‍♂️🧚🏿‍♂️  @AriLennox   https://t.co/syLrblYJfi Shea Butter Baby. @AriLennox and me gotta song that just dropped. This my shittttttt. It’s on Creed2 soundtrack but it’s from her album,  🎶 magic so far 🤦🏾‍♂️ @KingOfQueenz when you droppin it? We neeeeeed it. \n\nShea Butter Baby 👸🏾👸🏾👸🏾👸🏾👸🏾👸🏾 Go listen immediate. Anderson Paak album out now. Go get immediate. We got a classic on there. Trippyyyyyyyyyy @AndersonPaak congrats bro @PTcreates_GFX ✍🏿 @JIDsv Ma boyyy.  ✅  Say the word and I’m at airport like https://t.co/Y6tCO936w0 ✍🏾📓🤦🏾‍♂️🤮      👨🏾‍🎨👨🏾‍🎨👨🏾‍🎨\n\nOffdeez outnow soty? dicaprio2 sooncome shootvideo? youtellme https://t.co/3JNoaSoxFg RT @JColeNC: 🤯🤯🤯🤯  jid x cole. Out now https://t.co/pRllVqMLe3   Dicaprio2 @JIDsv  smhhhhhh 🤦🏾‍♂️ 🤯🤯🤯🤯  jid x cole. Out now https://t.co/pRllVqMLe3   Dicaprio2 @JIDsv  smhhhhhh 🤦🏾‍♂️ Me and @MoneyBaggYo got one on his album. Just dropped right now, go get it. Congrats bro. #RESET  memphisconnect Big bro album out right now. POISON ☠️ @THEREALSWIZZZ everybody snapped. https://t.co/u9ZkCvAZZy @6LACK 😂 nah but for real we need the video. And the joint you got with future is stuuuuupid. Congrats on the album my boy 🌊 🌊🌊💦💦💦 me and six lack got one on here too  😂 Super wave. https://t.co/yIBX5d86FL Me and wale got one on here. My boyyyyy.  Free lunch https://t.co/Y2u7L3PcvL 👀 on @EarthGang page mfers road to mirrorland otw Wassup Mufuckas. Cole left his laptop open so before we leak this new Cole X Kendrick album check this link.     Spill to the coffin https://t.co/fKwQHplXKs Mannn. Due to this Hurricane heading to NC, we have to cancel Dreamville Festival. We’re working to get another date, but right now safety is most important. I appreciate everybody that was headed to rock with us. 30,000 + were expected. 🤯🤯\n\nAll tickets will be refunded. Bsafe This is a message for anybody in this game that’s going through something. If you don’t feel right, if you feel you have a substance problem, if you need a ear to vent to. If you uncomfortable talking to people around you. Please reach out to me. Rest In Peace to the great soul Mac Miller Fuckkkkkk 1st ever.  Dreamville Festival. 9/15 see you in 2 weeks. https://t.co/MHzmh5BFjm https://t.co/EmOkAInUhm Just heard about the Prison Strike that’s happenin across the country. 💪🏿💪🏿 This is crucial. the US prison system is severely fucked up on so many levels. Please go read up on the topic from the people who devote their lives to the cause. #prisonstrike https://t.co/uLAwlxIpGK Every album he level up. Smh. It’s so impressive.  Thank you for the  🌊 🌊 🌊🌊🌊     🥛🥛🥛🥛🥛🥛 Milky Way   @bas  https://t.co/NjxLtT7kxp Let’s gooooooooooooo. Milky Way  -  @Bas  your time my boy.  🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛 🐄 🐄🐄    https://t.co/NjxLtT7kxp 🐐    ❤️ https://t.co/MJKC7VP6KY 🔥🔥🔥🔥🔥🔥🔥🔥🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿     🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛🥛 https://t.co/QUHIFOiB06 New @Bas x Cole https://t.co/dD1ozHE41I      🔥🔥🔥😤😤🤯🤯🤯       I THINK I MADE IT KOD Tour. Night one. Miami 🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿 Next up to bat 🥛 🥛 🥛 https://t.co/iKYu4ULAqL @KingOfQueenz Proof reading very important Album of the Year  freestyle       https://t.co/OI0ralvt6y Feed me   https://t.co/w29ClUwHpU @JIDsv Send the track. Fee is waived cuz you nice Feed me beats. Everything gettin murdered. “This what black people need to be on”     💯    respect https://t.co/glPDW1iwdo 🙏🏿🙏🏿🙏🏿    KOD Tour starts Next week. Welcome @officialjaden @EarthGang @killhisways   https://t.co/6jGyZiatng https://t.co/FsISdY9fzl KOD Tour. See you in 3 weeks. \n\nhttps://t.co/cQ1GvU7xXF 😭      a thread lmaooo   a roller coaster https://t.co/GiqVWV3YKR RT @KingOfQueenz: Lyrical Exercise by @JColeNC. 🐐 shit. Thank you Europe been a fun run, Next stop KOD tour. https://t.co/pmffFPuqjP This got me fucked up. RIP X. Enormous talent and limitless potential and a strong desire to be a better person. God bless his family, friends and fans. Red Table Talk   🔥🔥🔥🔥🔥🔥🔥🔥🔥 thank you @jadapsmith and your family. Day 1 fan of your show. 🐐 https://t.co/uNNfYtDPbY Lil Pump interview     https://t.co/qCV4qkS9aB    KOD Facto https://t.co/V67nzTw2YV Angie Interview   https://t.co/aFp72rgxjV Angie interview coming tomorrow. We couldn't get it up in time for today. I take all the blame. Me and Angie did a interview. Trying to get it up today KOD Tour. 💜💜💜 Tickets on sale now. (10am local time)   Choose wiiiiiiiselyyyy    https://t.co/cQ1GvU7xXF RT @Bas: Once you love yourself, you love everyone. Even the hater. KOD Tour.   @youngthug      Presale tomorrow. Tix On sale Saturday. Choose Wisely. 💜 https://t.co/IoIK5aoX1B @phontigallo  https://t.co/T100Ko1mGJ Performing in Texas this weekend https://t.co/IJivTc2ncx And the strongest drug of them all... RT @Dreamvillefest: Tickets on sale now at https://t.co/rV4zQL6onI \n\n#DreamvilleFest https://t.co/F7kr5p49VN Thank you Nigeria.  💜💜💜 Lagos 🔥🔥🔥🔥   I put the video on ig I ain't learned how to link them yet. 😭    💜 https://t.co/hgwuYyG8w9 Dreamville Festival. @Dreamvillefest. September 15th. Raleigh, NC. Get pre sale access at https://t.co/znuqkbk0hp https://t.co/0m9XIgRPqD Flipmode is the greatest.  Thank you for the inspiration big bro. https://t.co/LmOrdtndRk Aight I'm burnt out. Thank y'all for the love. KOD Challenge myself to grow as a producer and learn from the great young beat makers of our era, while still bringing me to the sound. Chopped Samples and lyrics from the 💜.  Just so happen to hit a wave after that. https://t.co/Cu6TpJPPrM Poker face my boy. Yo @KingOfQueenz look who it it's bro from the Laker games.  And thank you https://t.co/3rDUCqVvZC Sometimes it take time. I appreciate that love and I'm grateful it resonated. https://t.co/U0zZabCadI 😈 since 07' my boy. Good ear https://t.co/V0FDX7n1Fp Therapeutic. Never got to write that memory and put it away til then. https://t.co/0BtJOVIFci Yea. Started writing the song last year tho. It's long https://t.co/OfosW8TYsr Pac no question.  &amp;  Dre 3000 https://t.co/s8gl63ET0y Bruh is the 🐐 https://t.co/CFhRsiKBi5 Observation and putting myself in those shoes.  We live in a strange time but this is our time. https://t.co/sB588Igdes Ask me same question next year https://t.co/sIVqfpAXPe Thank you. Those are timeless covers. Not shocked cuz I had a vision for it. Kamau brought the vision to life and took it even further with the kids 🔥🔥 https://t.co/gpNPs4GwZa No not yet. had to let my bank account replenish cuz the first 2 was mad expensive. https://t.co/hVOQukwiYm Y'all let me know when I'm doin too much. This social media shit is a drug for real, and this is a binge for me. You had a traumatic week already I don't wanna fuck your timeline up no worse than it is. 💪🏿💪🏿 God bless and I will send a prayer up right now for you. Respect https://t.co/HNHlHr98Y3 Yes and yes. Still got holes I need to fill. Trying my best to choose wisely. https://t.co/DG8Vwl9k7Q Thank you. And I'm just following the spirit. Shit tiring tho I ain't gon lie 😳 https://t.co/fjtg83hNd1 Was working on the fall off. And helping kiLL edward with his album. @killhisways but he don't tweet a lot. https://t.co/L4hI1Bqwdp Workin on it. https://t.co/uLBD8evCpe the full version was too long, it slowed the album down too much. Interlude version still said what I needed to say. And thank you much love https://t.co/OJHnKMuBhH powerful and relevant. And coming from a 9 year old boy who seen too much pain already. https://t.co/NoBwU8PfAU While in Zanzibar workin' on one of the songs, maybe window pain, I asked myself what is the name of this album that I just fucked around and made. KOD came immediately. \"What the fuck do that mean?\" I asked. the 3 meanings followed in seconds. In tune. https://t.co/fChUwQ7vFT KOD deluxe will be album in its original 2 week form. Plus couple extra scenes that didn't make final cut. https://t.co/ruT2p28ovl @sixmau a young black genius. Follow him and buy his art. Heavy shit https://t.co/aKGhYKeG3P Everything except Kevin's Heart. @TMinus_Music blessed me with that at the perfect time. Thank you my boy https://t.co/eiBgzeMeLB A few. Half the samples I used @whosampled would never figure out. Don't worry I'll put out credits tho https://t.co/rIfruXplDu Aside from the fact that they 🔥🔥🔥.  Hook the most addictive part of music.  KOD. If a chorus by nature is a drug, the right repetitive hook is like crack. Cheap, but get you high as fuck https://t.co/hU5DtpGtRy Damn   Too hard.      \"One thing about the men that's controllin' the pen that write history... They always seem to white out they sins.\" https://t.co/zcKficrdd5 First version of album was done in 2 weeks.  Final version of KOD that got released took 6 months total https://t.co/WxF7qvJCcH 1985 and ATM (addicted to money 💰)  Just to get the drums perfect was skressful https://t.co/xjDDjXAjyn 💜💜 https://t.co/9BqG1KCRz8 Zanzibar. Did The cut off, Kevin's heart, FRIENDS and window pain back to back to back. Plus Royce feature. Super zone.   \"With my son in Tanzanian sun rays thinking bout them days.\" I got blessed. https://t.co/umgS5M8hFv Window Pain.  Then Brackets and The Cut Off. Check back with me it will change https://t.co/x7CUQ4KFVI RT @Dreamville: Only 5 hours left to cop Autographed @JColeNC KOD CDs and Vinyl packages only at https://t.co/euuivGuoT3 👀 #KOD #Dreamville… Kill Our Demons   https://t.co/XHTS0SnCNl But you know just how it go in our community \"These are our heroes\" - @nas Kevin's Heart video. 💜  https://t.co/87t1LnVKyw I know Heaven is a mind state, I been a couple times Time will tell who is on my side @whoknowsnostra Yes KOD Autographed Vinyl and physicals available   https://t.co/Q0V9L3DlHh How I can't find a physical copy to my own shit I appreciate the convo taking place. It's eye opening KOD Physicals   https://t.co/5iMfqSniWC Choose Wisely ATM video.   KOD   https://t.co/VgVLu5GcSU @ThatKiddTez God bless. Grateful you staying up with me 💜💜 KOD Physicals in stores tomorrow. 4/20 KOD the album.   https://t.co/XHTS0SnCNl KOD. 3 meanings. \n\nKids on Drugs\nKing Overdosed\nKill Our Demons\n\nThe rest of the album I leave to your interpretation. KOD   4/20   Cover and back https://t.co/2iUaKrI42F London. Meet me here today. First come first serve. https://t.co/tPqnY6AE2x New album.   KOD   4/20 NYC. Come through. Couple hours from now. First come first serve. https://t.co/Z71I9iRnnu @donaldglover 🔥🔥🔥 Boblo Boat video. @Royceda59 let me direct this one. Thank you, I found my 2nd calling in the process 📽  https://t.co/EpsH8ZVllt Royce 5'9 featuring J. Cole. https://t.co/oHsTemB2IE   @Royceda59  Classic 🙏🏿 Effected. @cody_macc available now. Cozz the truth.  https://t.co/pl3sNTkVkq    Hi @Zendaya Blessed and grateful. Thank you. 🎂 @KingJames 🙏🏿  Love bro It’s snow season @jeezy #Pressure out now 💎 #TrustYaProcess https://t.co/IjfCAXkJjp https://t.co/bpjHT0caan \"War x Leisure\" out now. Congrats to my bro the young legend @Miguel https://t.co/ZLAmByqMZK?amp=1   Thank you Gucc @iammarkpitts  the best to do it @RzstProgramming @Eminem Damn wait til the internet find this Whoa. Rap God. @Eminem  thank you. Potentttt Protect @jemelehill @CedBreeze Preciate the info my dawg. I was wondering who kept takin my shit. How could we not.    https://t.co/78iYgX27Zw Lute - West 1996 pt. 2 https://t.co/uU99kLBb2l  \n\nLong time coming @lute_west9  \n\nNC shit, thank you. We hear you and we feel you. Ima stop it there. Peace and love to all, let's give energy to the solutions not the problem. Even if you don't rock with mine. Thank you Colin for your sacrifice. This may be the biggest opportunity we have ever been presented to come together and show the world and ourselves our true economic power. So when I think about it like that it's very easy on Sunday to say, \"Nope, I'm straight.\" Some of us got grandparents that walked miles to work instead of riding bus, just to show the bus companies that they won't tolerate racism It was hard during preseason and the first week. But then I was like, wait, is it actually hard? I respect whatever you decide to do. Watch or don't watch, whatever's in your heart. But I'm not watching til it feel right. Thats when the magic happens. And sadly, in this capitalistic world we live in, that's when your voice is heard. When you hurt the pockets. Repeat this with another company, and another. \"You know what, I don't think I can spend my money with you no more until you fix this.\" \"If not, why are you spending all this money with a League that clearly condones that? ... \" Pick one of the biggest ones and say, \"do you agree with black balling players when they speak out against oppression?\" So, next you turn your attention to these sponsors. Black people spend a lot of money with NFL corporate sponsors. White people who don't fuck with white supremacy spend a lot of money too. if a boycott doesn't force them to action, don't even trip. This is where the real flex happens. Well, you have a choice on how you respond to that. You can choose to not watch. Every day they stay quiet on this they're saying that they condone what's happening to Kap and the message it sends. Bare with me I'm just a rapper.. now look And compensate the man for his losses if they determine he was. Hire 3rd party investigator approved by NFLPA to determine if kap was denied a job unfairly as punishment for his stance.  (I know, I know) How do they make it right? I know there are people \nsmarter than me with better answers. But here's one. You and me have the power to deny them our attention ($$ to them) until they make a wrong situation right. Same ones who speak out against Trump today, are the same ones that denied a qualified man a job because he took a stand against injustice. Your eyes translate to advertising money for the League and it's owners. God bless every player that finds courage to kneel today. But the real power comes from you deciding to not watch. Got mad shit I shoulda tweeted over the months (or years?) but didn't. I'll do better. Now Ima need a thread 4 this next part. Bare w me Also Cardi b I seen your breakfast club interview, loved it. Don't put all that pressure on your album. You already won. Just drop &amp; repeat Thanks. Been gone too long twitter i missed too much shit. Never said thank you for the best tour. Thank you. Europe we at your neck soon How you make a thread The future bright.  https://t.co/LdnlxCB9nM     Welcome @EarthGang to Dreamville. https://t.co/MACRBFDRt1 Tour had Canadian border issues. Vancouver show tonight postponed until tomorrow. Sorry 4 any inconvenience hope you can still make it. One week away. Mad excited. Welcome @AndersonPaak and @bas. 🙏🏿  my boyyyyy  https://t.co/tgsKjSAb8m https://t.co/2cz2WiI9V4 https://t.co/yEBQkjjf16  up for everybody. Tonight. 10 pm. HBO https://t.co/d2exX1XfFv JID. The Never Story. https://t.co/P9yebz4ktc @JIDsv Tickets available now. https://t.co/uSjyv2SENG 4 Your Eyez Only Tour. On sale Friday. See you in a few. https://t.co/uSjyv2SENG https://t.co/bKfDXQLPgn https://t.co/aKyaWYN6Kb   @JIDsv. Welcome my dawg to @Dreamville 4 Your Eyez Only     https://t.co/kDavo02ARh On repeat as we speak.  @arilennox    https://t.co/JvM5RUvjNn if you know, you know.. @fiendbassy   https://t.co/GU5LtXgTMt  \"Too High To Riot\" means wave after wave https://t.co/IuyvMlsfdZ TOO HIGH TO RIOT Thank y'all for the love. History turned into an album. Forest Hills Drive Live available now https://t.co/E3pQGn14rv  What a year. Hip hop deserves a live album The Ville on HBO???  It just hit me for real Young and Hungry.   \"Nothin Personal\" -  Cozz @cody_macc  https://t.co/8asKUjjjmX \"If they don't know your dreams, then they can't shoot em down\"    Episode 3.  https://t.co/QpevU8U0M2 Forest Hills Drive Episode 2- \"Aint Nothin Like That\" https://t.co/N974ngRctZ   @hbo  @dreamville   Gems Read this. Then watch this. New episode every Wednesday leading up to concert film on @HBO. https://t.co/YxFWfsUlJr https://t.co/n9iu3OYi4t Saying thank you today for all the love and support. FHD Dreamville - Revenge of The Dreamers II available now https://t.co/ba2056F10H https://t.co/APLx0g9UZy RT @Demoore44: Word to @JColeNC for giving me the juice!! Revenge Of The Dreamers 2 🔥🔥🔥 https://t.co/BiqQjRjaeW @bigl_650  check email. @Demoore44 you got mail @JadeMcKnight_ check email Need somebody email right quick 1-888-88-DREAM So much I want to say about Bas new album. But I'll wait til it drop. Have this for now. https://t.co/1m4Wph5Ojk   NIGHT JOB RT @kendricklamar: Black Friday. gift from @JColeNC https://t.co/Vte415SuWP Black Friday. gift from @kendricklamar  https://t.co/fE5wgBosWO i bought a @JanetJackson album and i was on it. surreal. congrats to you, jam and terry on another #1 album. Much love and thanks. - Cole History was made in the Ville FHD Tour. Classic. For the books. Words can't even do it justice. Thank you. Apologies. See you on 9/4/15. Montreal, tonight's show has been postponed. Sound, lights and stage got held up at the border. I'm disappointed and I know u are 2. Apologies to OVO Fest crowd 2night. Venue cut the show due to weather. Much love to everybody who rocked in the rain. Will b back to Toronto My homie Trae Tha Truth album out right now! get that @TRAEABN http://t.co/JUqtgUZpYW   congrats bruh RT @JanetJackson: I hope u enjoy watching this as much as we enjoyed making it. #NoSL333P @JColeNC https://t.co/1sGGQxlhIs A high honor when you fell through my show at Staples Center @JanetJackson.  Thank you. And.... No Sleeep. Classic! http://t.co/FLTCvrRImR Finally. Elephant Eyes available now! Get that. Congrats @omen https://t.co/oeu9ZGmguq  Dreamville. RT @JanetJackson: Girls night out @JColeNC concert! #ColeWorld http://t.co/IAWqZredAU Act 3 has started. This one will go down in the books. Forest Hills Drive Tour. Welcome @BigSean @YG @Jeremih   LOVE MAYBE! https://t.co/qQNRyOGJv9 Elephant Eyes. Pray for my nigga @omen dawg your album is a riiiiiiide @Miguel. Go support the man! tell em Gucc @iammarkpitts     \"waves\" is the one right now. congrats 3rd Annual Dollar and a Dream Tour is a wrap. Thank y'all for another classic run. @dreamville @puma http://t.co/v2NUoE0YXC LA show is at capacity. Sold out. Wiltern Theatre. 3790 WILSHIRE BLVD. LOS ANGELES. $1. Line shutting down once all wristbands are given out. Be safe and be careful. LA. Dollar and a Dream. Today. Friday Night Lights only. Dollar and a Dream. ATL. @ Tabernacle: 152 Luckie St NW. Shutting down the line once all wristbands are gone. Be careful Be safe Peace Atlanta. Today is the day. Friday Night Lights. Not allowed to do a second show. There will only be one show. All wristbands are gone. All wristbands gone. Sorry to those that didn't get one. See you at the Garden. Dollar and a Dream. New York City. Irving Plaza. 17 Irving pl. $1. Once all wristbands are given out they shutting the line down. Be SAFE NYC it's on you today. Friday Night Lights only. All wristbands sold out for Dallas tonight. To those that didn't get in, see you later this summer. Peace Dollar and A Dream Dallas. House of Blues. 2200 N Lamar St. $1. Be safe Happy Father's Day. Dallas we announce Dollar and a Dream venue today at 4pm. Bring $1 to get in. Friday Night Lights only. https://t.co/iQthZfbUdQ  harddd. thank you to @puma and @dreamville for making this year possible. see you in a minute Last year was special. 3rd times a charm. Dollar and a Dream Tour III: Friday Night Lights.  https://t.co/iQthZfbUdQ http://t.co/ptPRs8cH4f Special day. June 15th. 6 years strong. Thank you all, with Extra love to Day 1's. We lifted O2 arena tonight. Thank you London.  And thank you Europe. Act 2 is over. Wet Dreamz Video. http://t.co/gbmqN9zrke http://t.co/FMN6xg4dUl FHD Tour: Act 1 finished. Thank you, that was unreal.  Act 2 next. See you in Europe. http://t.co/JXpu5YLEkO Faith Evans. We feel you. Beautiful. Go cop The Album About Nothing by my friend @wale in stores right now! Congrats. \"Go shine your liiiight on meeee\" One of the greatest shows tonight in Tallahassee. Thank you Some of the hardest verses rap has ever heard. Cozz and Cole. Knock the Hustle video. http://t.co/FTCopABFYf http://t.co/Joh2el9BGk. @AlexisClaiborne thank you FHD on vinyl please. G.O.M.D. video.    http://t.co/K9dKaPgsDb http://t.co/rm6X2N31ij FHD Tour. Starts now Madison Square Garden sold out. Staples Center sold out. 1st Day. Blessed! Much love to everybody coming to FHD Tour. Forest Hills Drive Tour tickets are now available everywhere. http://t.co/FyvfvY91Ev  See you in the Summer Go cop my homie @bigsean album, out right now! Congrats, u deserve all the shine. http://t.co/RSM7gAMxLP It's lit this summer on tour Forest Hills Drive Tour. Homecoming. Fayetteville, Crown Coliseum. Cole World and friends. 2-6!! http://t.co/7KrdvO9GbF Forest Hills Drive Tour. Act 3: Hollywood. Featuring Big Sean. YG. Jeremih. http://t.co/J4fT33Z8dT Forest Hills Drive Tour. Act 2: The Journey. Featuring Jhene. Pusha. http://t.co/u2diPYEAg4 More dates next week @Dreamville This first run is for all the cities that never get no love.. I feel you. Forest Hills Drive Tour. See you in a few. http://t.co/VuUE22YE19 The real is back http://t.co/cABlV6OJCA I ain't make it until I saw this. A high honor! Thank you  http://t.co/I79Jw0mD2C Thank you for all the love today. RT @CombatJackShow: The @CombatJackShow - The J. Cole (@JColeNC) Episode: https://t.co/Wo0GNj3Fvv - 📷 @BryonSummers - http://t.co/1PDn47oPn3 How ill is this. @DaleJr  http://t.co/G7M7Scb6ME http://t.co/4jZSN0mK6K Everything just shifted @artofandres @mobrowne God bless. Spread love. @OP_GGM my nigga 2014 Forest Hills Drive  http://t.co/msK0s3KpZa The #'s are humbling. It's a win for all artists and fans and a clear message to the industry. No singles no features. Stop serving trash Tour is done. It was so ill wish we could do it for longer. We'll bring it back. Everyone say thank you 2 @RikkiMaa for holdin it down The real is back Baton Rouge I'm at LSU playing football and basketball for a minute. Pull up @sleepybrownatl thank you brother. LOVE @missjmickey coming to you after. what you want to eat @asialashe_ on the way @asialashe_ @KingOfQueenz @RikkiMaa wowwww i didn't even know they dropped physicals. How his album didn't leak and mine did?! You WIN. What up Atlanta. I'm trying to get lunch with somebody right now. If you at work I'll bring you lunch. YOU GOTTA HAVE D'ANGELO ALBUM THOUGH. Just copped D'angelo. Shit sounding crazy. GRATEFUL. And Chris Rock congrats on your movie. Loved it. @TherealMarvP was supposed to hit Richmond but got there too late. Next time Movie starts at 4:15. Carolina Cinemas\n9630 Monroe Road. Charlotte! I wanna see Chris Rock movie today. We rented out a theatre. First 50 ppl that bring the album get to watch it with me. @bigdaddeebilly still there? Few minutes away. 2 important things for you to watch and listen to today. Angie interview http://t.co/wgnvEJ3lZB  NPR interview  http://t.co/6iHu6z9lRW @NezytaSantos @Inkquisitive i saw it and i love it. incredible. Honored On this bus. We just started the \"Fuck Money Spread Love tour.\" No routing, just riding out. NYC thank you. we outtt @bigdaddeebilly yes. DM me your address. @SLIMSUPERIOR if you there now come outside. I'm here @dontsleeponkev fam I gotta keep it moving. Bronx too far! If you make it in the city before I leave let me know. @dontsleeponkev you said you was there! how long bruh? This bus too big to be maneuvering. @xLastQUEENx hahaaaaa. Don't get in trouble. Be there in 30. Coming from uptown @dontsleeponkev omw. 5 mins @xLastQUEENx what street. Omw If you work in manhattan and have the album on you, send picture I'll come sign it. This is my canvas RT @JackeeHarry: @JColeNC Perhaps I want to be saved? @Micah_KenCraw Love! Here is last nights performance of \"Be Free\" on David Letterman. http://t.co/b6zoJBVmkJ RT @DaleJr: @JColeNC is funny. #ShitChangedMyLifeBro Album in stores now. 2014 Forest Hills Drive. No thank you on projections. Just did Letterman, I'll never forget it. Thank you God. @OldWorldNewGirl @Target @TargetStyle posted at 910. if that ain't a sign that you made the right choice. thank you I dont believe in their projections. And I dont believe in their reviews. Good or bad. I believe in God, in myself, in the music and in you. @HappilyMARYED grateful for that. thank you @gabeaguero7 i'm honored. thank you @Bryant_BSM02 thank you @LionOnMyChest respect @butterfly_lizz damn that shit look timeless @kuhweenbee Love! enjoy. @adolfo_barajas thank you \"Apparently\" music video. http://t.co/4qe7FloYFe    album available now. http://t.co/gjLq6iB4qo 50 years ago today Coltrane released \"A Love Supreme.\"  Perfect Heading to Best Buy in Union Square to cop this album.  Ayeeeeee. FHD @Royceda59 just copped your new joint. congrats bruh i already know what i'm in for. no bars off Response unreal. GRATEFUL We LIVE http://t.co/msK0s3KpZa  2014 Forest Hills Drive. Available on itunes now. Enjoy.  Physicals tomorrow! TOMORROW. 2014 Forest Hills Drive in stores! Available on iTunes at 12 tonight. GRATEFUL 2014 Forest Hills Drive. http://t.co/WphKkFFpae  In stores Tuesday. preorder now  http://t.co/gjLq6iB4qo Fuck money, spread Love. Thank you to everybody that came to the crib to hear the album. I won't ever forget this past weekend. That was LOVE. 1 week. @SmokeSmMota don't do it to yourself! don't ruin your first listen bruh! Tracklist.  Pre-order the album 2014 Forest Hills Drive. http://t.co/msK0s3KpZa  available 12/9 http://t.co/yowcblSWJz HOME It's a process http://t.co/XBaGfLL0t7 Time to stop seeking equality in a society that is morally inferior. Complex Cover story. http://t.co/drRx0KpqDK   Thank you @thisisdscott. New Album 2 weeks away. (still feels too long) ATL Send me DM with your address I'll come play u the album. @DaliaDk “@JColeNC: Dallas we hereeeeee” we gotta see you tonight 😭😭😭 Dallas we hereeeeee Chi town what up Enter for your chance to come to the crib and hear the album early. http://t.co/Kn36zIhsAT Follow @RikkiMaa reporting live from @dreamville for the next three weeks until the album drops. she littttttttt My new album. 2014 Forest Hills Drive. 12/9 http://t.co/gjLq6iB4qo  http://t.co/nhyCgP9LE9 Friday Night Lights.    4 RT @JessieWare: .@JColeNC x @MiguelUnlimited x @OfficialBenzel x ME! Kind of...Sometimes...maybe REEEEMIIIIIXXXX https://t.co/KvSERadRJe x If the shit aint real I don't want it Knock Tha Hustle (Remix)- Cozz ft. J. Cole. http://t.co/Pe4pT4Uk3V The young God @cody_macc just dropped that Cozz &amp; Effect. Available now  http://t.co/OrzJKrh9tP Dreamville, straight classics Nothin but a Western Slaaaaave \"It's always the least expected who ends up gettin it..\" Cozz know. @cody_macc Back to School Supply Giveaway right now at Fayetteville State. Capel Arena. Bring your school supply list. How we feel. https://t.co/MlyX6v2Z02 STOP FUCKIN KILLIN US Legendary shit Adding a second show LA The Warm Up. $1. LOCATION: The Belasco Theater. 1050 S HILL ST.  Los Angeles CA 90015. 6 oclock doors. LA, last but not least. RT @FiendBassy: Shoutout to @RollingStone for this piece on $ &amp; a Dream, NYC. I spot a fiend! http://t.co/NYteJjftjk adding a 2nd show. because of Chicago curfew, there's an age restriction on the 2nd show. 18 and up. The Warm Up. $1. Location: Concord Music Hall. 2047 N MILWAUKEE AVE  Chicago, IL 60647. Good Luck Be Safe. Chicago Chi-town NC THAT WAS LOVE adding a 2nd show tonight. The Warm Up.  LINCOLN THEATER 126 E Carrabus Street Raleigh NC. $1 Just landed in Raleigh. They showed pictures and video of the line already. Damn. Who told yall?! Carolina. Tomorrow. See yall in Raleigh. $1 police won't let us do a 2nd show tonight The Warm up. Location.   GRAND CENTRAL. 697 N Miami Ave. Miami FL 33136  $1. Be safe, good luck. Miami Miami. Tomorrow. The Warm Up. $1 both shows sold out. congrats to those that got a wristband. i'm sorry to those that didn't, I wish you could rock with me 2. NYC look like some Hurricane Fran shit. Both shows are still on. giving out wrist bands now. saw pictures of the line. wow Highline Ballroom. 431 W 16th St, New York, NY 10011   Good luck. Be safe. Small venue today so 2 shows is a definite. NYC. Dollar and A Dream. The Warm Up. $1 NYC. See you tomorrow Go  \"@RocNation: Enter to win a #RocNationDreamExperience plus a stop on @JColeNC's D&amp;AD Tour from @amfam. http://t.co/t5MaDQdvnX…\" Adding a 2nd show tonight. Stay in line for your wristbands. Venue.  Shepherds Bush Empire. Shepherds Bush Green  London, GB W12 8TT     Doors open at 5pm. See you in a few. With that said. Tonight is for the day 1's. Tonight is about The Warm Up. Shit is special to me. Some of these songs I never performed. Some it's been 5 years since. But If you supported any one of my projects, thank you. I got love for you. Born Sinner, Sideline, FNL. Listen. London. This your first time so let me me clarify. This is The Dollar and a Dream Tour. Bring one POUND with you to get in. Ya'll ready I'm sorry to hear about your homie that passed away. RIP Joe. I'm sure he's somewhere smiling knowing he got friends like you. Love Will give location tomorrow @ 12pm UK time. Then it's first come first serve. Good luck. Be safe. Respect each other don't get crazy London Town. It's on you first. Dollar and a Dream. Tomorrow. Warm Up. Welcome to Dreamville @cody_macc  May all of your DREAMS come true. https://t.co/hUnIexxbpu work hard stay hungry make classics Congratulations are in order. Now. Go to MTV Jamz and watch the anniversary special, on right now. LOVE! You got a few weeks to freshen up on the words. http://t.co/pz114qKIOX The Warm Up. $1. See you soon. http://t.co/JwPQJf438z yall still crashing my shit. here it go http://t.co/HWrdEhHkEP Today is 5 years since The Warm Up dropped. I had too much to say. I put some of it in a letter. http://t.co/n8FJEMA2hd Warm Up \"My Nigga Just Made Bail\" video. https://t.co/hhUcHANUHL Dreamville 30 for 30. An Album From A Nigga Who Ain't Got Alotta Fans Yet https://t.co/ggW2KRhDXX  Last Winter RT @RapUp: New Music: Bas f/ J. Cole - 'My Ni**a Just Made Bail' http://t.co/4SfmqSYMYL Dreamville's first official commercial release. \"Last Winter\" available now http://t.co/jhU3gwOz1o   LOVE! Last Winter RT @KingOfQueenz: I just brought @Fiendbassy #LastWinter on iTunes... you should too http://t.co/50VTQHugqv oh shit Much respect to Lisa Leslie. Where's the pride and self respect??!! The Warm Up. Dollar and a Dream. See you in the summer. http://t.co/C0EPKCBc7O and Last Winter in 1 week. @FiendBassy 4/29   iTunes and all that. I don't give too many niggas verses. Bas get the monsters. Dreamville 2 things I come thru the hood suicidal doors. I used to come thru the hood on the handle bars.   Last Winter Harder than a nigga tryna impress God @MySecondEmpire loved your esquire piece about your 1st stand-up. inspiring shit. thank you. RT @Dreamville: Bas - Ceelo With The G's | Official Video (prod. by @CedBreeze) https://t.co/yXHMPUE3eI\n#FIENDS Back til \"Last Winter\" drop. Happy Birthday @KingOfQueenz. 5 years ago we got a deal. Now we give em out. http://t.co/h8fdzfpcjI  LAST WINTER @FiendBassy @princess_simba very much. keep going \"She Knows\" video. http://t.co/Sfv0jKKqfC  YES I'm in New Zealand. It's Saturday here. The world is huge. @lotfynathan documentary was amazing shit. it deserves to be huge. hope it gets bigger. great work @PromiseFilm enjoyed your film. Mark Pitts &amp; Bystorm present; the TALENTED @Treasure_Davis featuring cole produced by cole. http://t.co/OdVmEAPOQN Gucc what upp! Unreal 1-888-88-DREAM http://t.co/nCQZZdwrK1 Dreamville- Revenge of the Dreamers  http://t.co/1ND1GjGZED  enjoy A gift for you from Dreamville. Celebration. Thank you for the Birthday love. Much Love to Interscope Worthy. @Dreamville http://t.co/LtSiMYdP5W Mandela. What a life. What a Man. RIP LONDON TOWN. 3 nights in a row. Too real.  @Dreamville Friday Night Lights New Tour Dates for North America. Canada, NYC and DC included. groovy http://t.co/RB5yeDvyo3 Dreamville back in Europe. It's been too long. Copenhagen tonight it's on you. Oslo and Stockholm next. LA. I been waitin on this one. First episode of the new MTV LifeAndRhymes debuted today. http://t.co/HBgcYSa4cf   MuchLove to @MTV, Aristotle, and Muhammad crib CrazySexyCool. The TLC Story.  Tonight on vh1. @officialTLC   Life is crazy. Had the first album on Tape. Fast Fwd 20 years... thank you 3rd London show added. Tix on sale tomorrow. http://t.co/CJEHKoOVo6 2nd London show added. Love http://t.co/TV4uwRU1ZN   WDMC Tour. UK tickets. London and Birmingham record speed sell out. Thank you WDMC UK tickets. Tomorrow Miami had it. Orlando &amp; whole Florida was crazy. Charlotte = Lit. Chi-town was Silly. But. Boston took that crown tonight. BestOneYet Nothing Was The Same in stores now. \"You know what to doooo-ooo-ooo\" -andre3k   @Drake congrats my dawggg Crooked Smile video. http://t.co/2NVEW0yTIU Crooked Smile video tomorrow What Dreams May Come World Tour. EUROPE DATES. Tix on sale Friday 9/20 and 9/27. Dreamville. http://t.co/s79iCRIfbW WDMC Tour. LA on sale now. http://t.co/07v0PlycQ9 Amazing show First show. Miami it's on you tonight Couldn't announce til I did Rock The Bells(murdered). WDMC Tour. LA show Is Oct. 24. Nokia Theatre. Tix on sale this Friday the 13th. 1 week away. http://t.co/yXr2vH83Jn And while im on here. What Dreams May Come Tour in 10 days. Get your tickets. Trust Just watched the homie @JayPharoah tear down Charlotte. Legend in the making Congrats to my man @bigsean Go cop his new album \"Hall of Fame\" now    http://t.co/TwbA6Kiq0S people will believe anything RT @DrewWhosUrDaddy: Damn @JColeNC caught a fade by Diddy tho?? #liteSkinNiggas lose again Meet me there at 8. I'll be there for an hour. Love Bout to go shop for Back to School Giveaway tomorrow. Meet me at Walmart on Ramsey. Pics/Autographs for anyone who donates $5 of supplies. Back in the Ville. Who here? smh. Read the interview don't fall for the headlines. Think for yourself There are some US cities that we can't announce yet contractually. We're following the US run with a World Tour, Canada too. http://t.co/HoXPUZ9GMk Tickets on sale now. What Dreams May Come. Tickets on sale in the morning. RT @TheRoot247: Florida Cops Shoot Unarmed Black Man in His Driveway http://t.co/IsMB15D0lD Do not miss this show. WDMC Dates. More to be announced. http://t.co/thhd40Gvcq What Dreams May Come Tour http://t.co/n5Z0ANX8k3 http://t.co/Re9lMW8h9Q http://t.co/G0tTAn7HAY http://t.co/K2kV8yExzD What Dreams May Come RT @shawn_daniel14: I voted for @JColeNC and @MiguelUnlimited to win Best Hip-Hop Video at the 2013 MTV Video Music Awards #vma http://t.co… 5hunna plus. Thank you to all yall that copped Born Sinner. Short road to Gold, long road to Platinum Doing \"The View\". Momma just told me she \"got the whole hood watching.\" hahahaaaaa I said something in a rap that was offensive to those with Autism. Feel terrible. A tweeted apology wouldn't do. http://t.co/cyMbXubz3T @autismspeaks heard you loud and clear. Follow your Heart. You won't fail. 3 weeks later. #1 Album in the country. Born Sinner. Thank You Born Sinner in stores. http://t.co/7C5BwXYQSX Oh shit Vendetta out @CBellLife yes \"Sometimes our dreams come true, but sometimes our fears do too\" #vendetta been waiting on this to drop @SirElijahBlake  Tomorrow \"Promise if I have a seed, I'ma guide him right\" @djdrama nice sweater. @LifeOfBrett @ChefBoyJP love Rich Niggaz RT @PeterKash: We got @JColeNC calling in to talk about the confusion surrounding tonight's show in Toronto! Listen NOW!!! Will be back in a few months for the tour. Love Was going to do a second show tonight. Police won't allow it. Yall were all over the news tonight, Toronto it's LOVE. Toronto Dollar and a Dream tonight. 99 Sudbury. 6:30 doors. $1. Keep going. Born Sinner in stores now. RT @CortezBryant: This @JColeNC album is fckn incredible!! People sleep on the fact that he also produce the beats! Happy for my homie! He'… @CortezBryant salute http://t.co/FFhMpzMEtM Dreamville store is on fire Grateful for the everyone that bought the album. Thank you. 3hunna RT @FiendBassy: “KEEP IT #300 LIKE THE ROMANS” Congrats to my brother @Wale. Go get \"The Gifted\" in stores now. Proud! Detroit Dollar and a Dream tonight. The Shelter at St. Andrews. 7 o'clock doors. $1. LOVE H-townnnn legendary shit Houston Dollar and a Dream tonight. House of Blues. Doors at 7pm. $1 @MachineBeach thank you. RT @DatsJusTre: @JColeNC really learned how them niggas in Chi go tonight...tickets sold out quick on a nigga RT @richkleiman: We got it from here Cole Damn......@wale #TheGifted in stores this tuesday everywhere RT @Usher: We all are \"Born Sinners\" my brother J. Cole killin it!! Get it now   https://t.co/t7rZcx8LaF RT @rihanna: Well phuckin done bro!!! http://t.co/nuq9sDzP8z @JColeNC So proud!! Y'all heard dis yet?? #BornSinner #itsdaROCinthismuhphucka @_MisColeWorld love Chi-Town Dollar and a Dream tonight. House of Blues. doors @ 6:30 Keep going. Born Sinner in stores now. Beeetch Born Sinner in stores. RT @FiendBassy: Dreamville is the move http://t.co/DmRnlZ1OAz AMA Reddit AMA link coming now. Sorry having technical difficulties @Nas thank you MOMENT RT @Nas: #MadeNasProud #MadeNasProud #MadeNasProud #MadeNasProud #MadeNasProud #MadeNasProud #MadeNasProud #MadeNasProud #MadeNasProud RT @Nas: #MadeNasProud @JColeNC - http://t.co/jquKWReGlV Today is special. Full circle moment. @nas it's on you RT @Nas: Long live the idols, may they never be your rivals. REWIND @Nas Purple Blaze a 50 \"I Gave You Power\" raps was on my wall. \"You Won't See Me Tonight\" with Aaliyah from the same album. that was my shit Used to play @Nas \"Undying Love\" every day. Wasn't a song it was a novel. Dollar and a Dream shows making me fall for this shit harder. Thank you Hip Hop is an amazing thing. RT @Jordan_23_1991: @JColeNC going to cop this J. Cole in this shitty ass weather witcha boiii. @clydeleach @Ralphie_LaFlare thank you @drake the motion. CRAZYYYYY Don't believe the projections. Only a few days left. Go Hard. Born Sinner in stores now. http://t.co/7C5BwXYQSX RT @Drake: @JColeNC MY BROTHER THANK YOU FOR THE BARS. I will participate in @Reddit AMA tomorrow at 4pm EST: http://t.co/zkF8NQCvRw  Philly Dollar and a Dream tonight. TLA Theatre. 7 oclock doors. $1 @side_line_story thank you Born Sinner in stores now. Keep Going http://t.co/7C5BwXYQSX RT @Hark504: I'm late but I just copped the double disc deluxe @JColeNC Born Sinner http://t.co/bmQp4TAkQ7 @royceda59 salute fam. Just heard @itsravaughn \"Best Friend\" on the radio in DC. Smash. Keep going. Born Sinner in stores now. DC Dollar and a Dream tonight. DMV. FIllmore Theatre. Silver Spring MD. Doors at 630. Born Sinner. In stores now. the people decide Nothings impossible. Cop Born Sinner Heard its Madness at the venue. I will add a second show tonight. Please be EASY. NYC RT @BroBurch: @jcolenc is too fucking dope ima buy 2 cd's man NYC Dollar and a Dream. Tonight. Irving Plaza. 7 o'clock doors. Be safe @Jessy_CW you are the shit. thank you very much Keep going. http://t.co/7C5BwXYQSX Born Sinner @katiiadenise thank you Thank you. Long live hip hop beetch Tweeting from mobile web. Nothing gangsta bout that. so much to say not enough characters Fayettenam #notsupposedtobehere I'm not done. I was just celebrating my 2nd album. @wale june 25th. And more important than them niggas. The PEOPLE are saving hip hop. You niggas are Critics. Not fans. Fuck critics. The people decide Drake saving hip hop  Hov Saving hip hop. Chance the rapper saving hip hop. k. Dot saving hip hop. Ab-soul saving hip hop. To keep it real, your whole publication is fuckin up hip hop. Your 1 listen reviews are fucking up hip hop. First week tally's fuckin up hip hop Projections fucking up hip hop 5 hours signing albums. Thanks to everybody that showed up. Dreamville Yall are the shit. Dollar and a Dream show. NYC tomorrow. LOVE RT @iFollow_Wilson: @JColeNC Copped the Digital Deluxe...Copped the Non-Deluxe Digital...Copped two hard copies... and yeah thats how my da… Accidentally walked into kelly rowland album signing to cop Born Sinner. Support her album! @phontigallo thank you man Feeling blessed. Born Sinner @DressMeChris that's love RT @Kaepernick7: Make sure you go cop the homie @jcolenc new album #bornsinner you know he one if the coldest in the game! http://t.co/4Wmf… @ShatayaMonique_ thank you Listen. Hit the store, Cop the physicals. Standard and Deluxe. Deluxe comes with Truly Yours as a separate CD. RT @NightmareJunior: Man, @JColeNC's the first one in a long time to put the lyrics in the album booklet. That '90s shit. @davidpowell91 much loveee @Terrence_23 love @ThenextD_wade salute @832tiny thank you @angelicaXO1 thank you RT @OneShaq: @JColeNC got the digital, about to go cop the deluxe hard copy #bornsinner @BreezyxOVO @OVOSally LOVE Wildest shit I ever seen on twitter @Santillian much love @_TzC_ wildest shit i ever seen on twitter bruh RT @Tatts_Cargos: I'm coppin the Deluxe Edition too goin hard for the homie @JColeNC Born Sinner in stores today. http://t.co/TEHMwXUd8U RT @Drake: Just got my pre ordered @JColeNC Born Sinner downloads. Go get that!! RT @FaizanQurashi: @JColeNC been with you since day 1. All started with a dollar and a dream and now you here. First thing I'mma do tmwr is… Tomorrow though. You need those physicals. RT @vanavannn: Finally gonna be able to listen to @JColeNC #BornSinner, avoiding that leak was too tough RT @StatikSelekt: Extended Play is out!!!! Get that!!!   https://t.co/SpZwNpg5Fa @RossyD10 respect RT @GGDINHO: @JColeNC Had to get the leak but that didn't stop me from spending $13.99 just now #BornSinner #ColeWorld @ThisisnotMateo thank you RT @W1L5ON_: The long wait is over! #bornsinner is hear @JColeNC we are proud of you no matter what you sell, the music is legendary. New l… http://t.co/7C5BwXYQSX  Damn. Born Sinner is out. Let's go My album leaked 12 days in advance. It's been hard to keep quiet, but i appreciate all the love. We an hour away. Blessed @apollonia_17 love Me and @fiendbassy and some Dreamville niggas shot a video for \"Lit\". GOOD TIMES http://t.co/hvmDVs3Lrp New York City. Cole at Flex. Now Born Sinner. 12am tonight on itunes. Tomorrow in stores. UK and rest of Europe. Go pick up Born Sinner now. You get it first June 1-6 7-1. the dayyyy, momma pushed me out her womb told me nigga get paiiid RT @drose: In the gym working out listening to Born Sinner. @JColeNC you made me a believer. I appreciate yo music. I'll be supporting June… 4 years since I gave you my number. June 15th- The Warm Up. Hip Hop is a beautiful fuckin thing June 18th. 4 days Boston Dollar and a Dream. Tonight. Paradise Rock Club. 967 Commonwealth Ave. 8 o'clock doors. One dollar. Baltimore Dollar and a Dream. Tonight. Baltimore Soundstage 124 Market Pl. 6 o'clock doors. RT @ThatNiggaCris: I only have 99 cents my nigga let me in @JColeNC Atlanta tonight. 1 dollar. The Loft (at Center Stage Atlanta)\n1374 West Peachtree St NW, Atlanta, GA\n8PM Doors. 1st come 1st serve \"This a Haitian flag?? I fucks with Haiti!\". Don't twist my words. All my NYC Haitians been put me on. Sak Pase! Legendary shit Amazing moment. Sorry to those that could not get in. These shows will be hectic every night. It's 1 dollar. Be respectful. Drove by that Miami line. Shitttt Damnnnnnn Dollar and a Dream Tour. Miami. Tomorrow. The Stage 170 NE 38th Street http://t.co/qITaBaaJ9E Doors Open at 8 Pm  1st come 1st serve Pre-Order Born Sinner http://t.co/7C5BwXYQSX (deluxe) http://t.co/qPjqweKSoL  Album streaming now. In stores June 18th. Thank you for the love. Rather than acting like the leak didn't happen, here's the official album stream for those who haven't heard it. All love. Outta my hands. June 18th 15 minutes. Black People shit Less than an hour. Rain or shine Miguel - Born Sinner Episode. http://t.co/qPjqweKSoL London. Here are the coordinates for tonight's Born Sinner Listening 51.51139 -0.12840  1am GMT This is for those that can't be at the NYC listening tomorrow night.    June 18th Please bring 1. iphone fully charged, 2. with LSNR app downloaded and enabled, and 3. favorite pair of headphones. Born Sinner will stream 1 time tomorrow at these exact coordinates. http://t.co/NveV5sKKV7 8pm EST/ 7pm CT/ 5pm PST Born Sinner http://t.co/XzNjHPOiSk Deluxe album includes Truly Yours 3 tracklist is real Get \"Crooked Smile\" on itunes http://t.co/tdE0cFYXHo 2 weeks. Born Sinner. Shock the world Thank you T-Boz and Chilli. RIP LEFT EYE \"Crooked Smile\" feat. TLC  http://t.co/kNuAQSlHsP   Born Sinner June 18th. A Dollar http://t.co/X51JXJVpBo Niggaz Know http://t.co/PPrtTDbXlE    June 18th Pre-Order Born Sinner http://t.co/7C5BwXYQSX  (deluxe) Pre-Order Born Sinner http://t.co/fiiLdBLUfa  (standard) RT @FiendBassy: Vegas. Haze. Born Sinner Weekend. It's Lit. http://t.co/HnIB3LEXND Born Sinner Sin City. Pre-Order Born Sinner http://t.co/7C5BwXYQSX (deluxe) Pre-Order Born Sinner http://t.co/fiiLdBLUfa (standard) http://t.co/t6lAnCatNo  New @FiendBassy x Cole World. Plus that Quarter Water Raised Me volume 2. Lit Born Sinner in Sin City this weekend. http://t.co/Hlqct6i9DL  ... http://t.co/7XFunt8g3O June 18th http://t.co/VA4WGU05LQ June 18th http://t.co/OrpZIz6AsM Born Sinner June 18th Which is exactly why I'm moving my release date up. 4th quarter, 10 seconds to go. that's where i'm at http://t.co/qPjqweKSoL Kendrick Lamar. http://t.co/qPjqweKSoL   Dreamville. Ideas come to life. RT @ElliottWilson: YN. J.Cole. Tues May 28. Highline Ballroom. NYC. Cop tix here! http://t.co/WYeS6fGG1T #CRWN Noooo @tiamowry   Don't do itttttttt My nigga Bas @FiendBassy. You got it Fiend. Crassssshhhhhhh. Enjoy man, just a few gifts. Truly yours 2 Shout out Jeezy. Shout 2 Chainz. Truly Yours 2. http://t.co/Mf2htz2Nry Uploading Don't think I forgot. Truly Yours 2. Just landed, putting it together. Fuck it. Truly Yours 2 tomorrow. You Deserve it. \"This right here is not a preview\" http://t.co/H2VLgORWF1 Cole Summer http://t.co/h5Ue3C0Gfu That wasn't like a fake deep tweet. I'm sayin, it's really one of Those nights. Gimme a hour. One of those nights. Fat Jew Interview. Amazing http://t.co/JkwHa92fU2 Power trip comin for that assss https://t.co/0mX4TWCHv8 June 25th by the way lemme switch it now, back to hell's kitchen now RT @Dreamville: @Dreamville: Breakdown - J. cole explains \"Power Trip\" Production (Video) http://t.co/NIpSdgbDGs \n#bornsinner @TonezMusic101 thank you. @BerdjOdabachian easy fam. stay positive... much love @ZakHussle year and a half. rough version shit @ImBRIT_TakEaNEY thank you. love @BarGathi yes. i remember everything about making that. @TrevorKatende13 Young Simba forever bruh. Tell Big Sean I'm coming for my Lion shit! his shit is fresh tho! @NickVanderbeck much love fammm @Riiaaaaaaa deserves one for sure. i have an old one i shot same time as lost ones. wasn't all that. i was BROKE @riseABOVEone long summer not a song. gina neither, gina is the name of a beat me and kdot on. dont even know how anyone knows that title @Abidnani17 be there for promo next week i think. then back for tour in a few months. miss London BAD @jamBBYG scotland too @Ianni_YMCMB soon @FatumaAli_ thank you. long way to go @CodyFolkes wow i'm honored. the only one. love @callmechigi sick idea @WilliamHeinz_ already made. either i save it and one day make it better, or give it to the world how it is. @J_R_Alcantar11 thank you. Can't wait either. @fouseyTUBE real shitttt @COLEzus I feel you, trust me. in due time. keep reppin' @SmokeeRobinson \"David After Dentist\" Is this weel life? @asharreddy damnnn i just heard the news. RT @Dreamville: New Music from @FiendBassy \"Stronger\" off Quarter Water Raised Me Vol. II http://t.co/Uyt3FK1dvq @MiguelUnlimited thank you bro. you killed it. or no, wait.. No R&amp;B singers were harmed during the filming of this video. That link is supposed to be worldwide. Sorry to those in Canada, UK, Europe, Africa having problems. They're working on it. Power Trip Video.  http://t.co/srJWGv1uVI Born Sinner June 25th. - Cole said i would never announce on twitter, but damn, since i fucked up that first one (but what a moment!) ...... Born Sinner... Power Trip video for you tomorrow Dreamville is the move Few things Cookin up. Vine is fresh. https://t.co/sD8hP7yBVc Can't wait to show you this videooo this not platinum yet? http://t.co/QY0HnDaFAQ RT @officialchilli: me n @JColeNC n the studio..yea he looks up 2 me 2 LOL http://t.co/SPEMJminHP RT @KingOfQueenz: Dope ass interview, much love to Vice RT @NoiseyMusic: We spoke to @JColeNC about pretty much everything: http://t.co/ ... @gstephanopoulos @dennisrodman i take that back. Respect.   BornSinner Don't judge No love for George Stephanopoulos. Much Love for Dennis Rodman. Lemme stop being cool, THAT SHIT WAS AMAZING. Thanks Harvard, that was ill. http://t.co/UjoWE99o  Power Trip    #bornsinner Just posted a photo http://t.co/Evtmn2Si http://t.co/0g7dw39l  Happy Valentines Day don't call it a mixtape. it's not. it's not a preview of the album either. woke up today and wanted to share these. http://t.co/u172zSTA   new shit. You deserve it Ya'll Deserve it. Truly Yours Harvard Bound. http://t.co/xp3XxoMK  @InterviewMag  Whoa Hahaa. Lights Please was the better joke! #youwin #wittiestfans.  #goniners #ibelieve #miracleshappen.  #beyoncewasgreat  #toomanyhashtags? Me and @kingofqueenz at the superbowl. just started the \"No Music!\" *clap clap clap clap*  (new yorkers only). @M_Mumen incredible Dreamville hoodies and paraphernalia here http://t.co/8o0zJJjt  Official Headed to dinner with friends and some fans from the Mailing List. Then back to Studio. Finishing singles, and clearing samples. SeeYouSoon Too much love all day. Thank you for the wishes. http://t.co/u172zSTA   jam this shit when the world ends. Shout to the spanish percussionist. All Love for RESPECT mag. Round 2. The OG YN be knowing mann. http://t.co/mTiZV0BE Today, Friday Night Lights is 2. Tonight, welcome the new. Miss America @ Midnight. Miss America. http://t.co/u172zSTA  #bornsinner http://t.co/u172zSTA  Born Sinner. Much love to everybody who shared that moment tonight. Born Sinner Right now. Meet me here. http://t.co/Rhecre0D 11 o'clock tonight. http://t.co/YyE9Whvp http://t.co/Rhecre0D   tonight. Listen. Go buy Kendrick Lamar album right now. Twice. The words were too relevant to keep this in the stash. http://t.co/8Itjya9q Much love to @majorlazer and my man @diplo. Let this be a thank you to all of you who bought a copy of my 1st album 1 year ago today. 9/27 RT @diplo: this is kind of a big deal ------- @JColeNC x @majorlazer  FREE TO DL http://t.co/sIFRCuLk RT @majorlazer: FROM OUR HOMEY @JColeNC GET FREE COLEWORLD http://t.co/pwUfpDFZ #COLEWORLD #LAZER4LIFE Time Flies RT @SultanofSwatt: @JColeNC - Im A Fool http://t.co/Dh9DX37l, you got it here first lol @kease2kool you gotta ask ol buddy @SultanofSwatt @SultanofSwatt sent. it's on you now. enjoy @SultanofSwatt just realized that was you at Kendrick show in Charlotte! Life is funny. Sending in a minute @SultanofSwatt gimme a minute. @JColeNC @SultanofSwatt What's your email @SultanofSwatt Naw. You want it? @Corey_lamond me too bruh @fouseyTUBE fuego. @NiseIV that Makaveli cd on your tumblr is real. brings back memories @Mmm_marisabel i'm a fool Never bite the hand that feed you, always watch the hand that's cookin.. D4 Hot cheetos &amp; Takis, Hot cheetos &amp; Takis Motherfuck the wagon, come join the band Welcome, we spent many late nights like this, with a lot more to come. New music @ http://t.co/u172zSTA Just realized.. since the last time I tweeted we got a million new followers who don't know what all this vague shit means. crashhhhh Cole World. The Cure. http://t.co/XxiZ0fQL You know the drilll. Bouncing down. Heard Dreamvillain can handle everybody tonight. But shit, knowing yall The Cure. New Season. http://t.co/vX8JtKFN The Cure Damn, yall just made Life & Times crash. Makes me feel better about Dreamvillain. Sideline Story. Video. http://t.co/9kZ9rQQr Back on tour today. This time with the boy Krizzle. @BIGKRIT  Legendary..  Rhode Island it's on you tonight Boondocks Moment RT @foundationnews: J. Cole's Dreamville Foundation announces inaugural Mother's Day writing contest - Fayetteville Obser... http://t.co ... Now I aint gon tell you again let's get ghost in the Phantom Pacino life, G a roll, casino dice, At the Mirage.. Vegas strip, neon lights Got a Drummer and shit. Upgrade Shawty that verse was from a freestyle, hear it the right way.. http://t.co/u1777t2K Love Nobody's Perfect BIG flow like water I kick flows for ya, kick down doors for ya Fayettenammm. \"@Rain910: RAIN - THE MAGIC HOUR 3 http://t.co/SVbDGOV1 THANK YOU ALL. RT\" Salute to the King @Tip   We all salute Much love to my brother @MiguelUnlimited for showin love Incredible moment. What a night. Dreamville Weekend. RT @RapRadar3: RAPRADAR: New Music: J.Cole “Visionz Of Home” http://t.co/RTE2hLp3 #ColeDay. Thanks to the city, Love yall. Speakeasy tonight just to celebrate \"It's Yourz\" ColeDay \"J. Cole Day\" in Fayetteville today. Dawg, I can't even sleep it's too real. Dreamville Weekend \"Dollar and a Dream Show\". Charlotte, we see you Saturday. Dreamville, QC. http://t.co/6DglQNAU Dreamville Weekend. Carolina let's get one. Happy Birthday to my brother @KingOfQueenz. Young and Legendary.  Dreamville Shout to @KevinHart4real for the Alley, perfect! I'm comin for that MVP next year I promise. Cole Worldddd Celebrity game tonight with my favorite player ever @Iam1Cent  Gotta do it for the Ville one time DoubleDoubleCrossed Missed this feelin. I know you did too. ENJOY Grew Up Fast. Direct link http://t.co/OSg55vuA Some shit never change. CRASHHH http://t.co/u1777t2K Grew Up Fast.  For yallll. Much Love Comin' right up. Dreamvillains http://t.co/2cocMCEl Oh shit. And we 2 milli, what's really Yall sleep On West Coast time. you should prolly stay up with a nigga tonight Men lie, Women lie... Brought momma to the grammy's. Incredible moment. Congrats to all winners and noms. See you next year fammm Louis XIII http://t.co/IDmGTz9N Jigga. Salute  http://t.co/djBos3z8 No way @MissyElliott you the Queen! You blessed me tonight! Thank you Yall only get half a bar.. Oh shit http://t.co/IIbZpMl0 Pour confetti on the winners http://t.co/M2pkGShq Unreal. Missin them commercials tho http://t.co/eQGjaN7B Just posted a photo http://t.co/scyjNC0B RT @MiguelUnlimited: My Mf Niggas RT @Wale: 4am still sippin .. MMG/BOA x Dreamville http://t.co/7sDDtxhc On my way in the NFLPA party. Much Love Follow him @360ismusic Shout my nigga 60! Queens thang mayne. RT @KarenCivil J.Cole & 360 In The Studio - http://t.co/Hlg2Qo1J Cole World and The Legendary Roots Crew. Jimmy FALLON now! Slickkk right? Oh my damnnn blake RT @KingOfQueenz: This picture is a good description of the type of weekend this has been... Classic Dreamville shit http://t.co/O7QfL33t @MissJasGill slim! @nickjnagy105 Thank you! @TiffdaGriff Love! Shout to everybody who showed love. Happy Bday to @rickyrozay and RAKIM God MC's January 28th God MC's DC was incredible. We flying to Vegas now, Dreamville birthday shit. Just watched the video with all the happy birthdays from fans. I got so much love for yall, thank you for makin this shit worth it. Tomorrow night, DC what up. The Park. Nyc tonight It's goin downnnnnnnnnnn @vanjessmusic mannn, yall killed that. Incredible @PerezHilton incredible! Vernon Davis salute! Cole World!  T.O. flashbacks. It's been a long time for a 49er fan! AHHHHHHHHHHHHHHHH One of my favorite cities in the world, that N.O... But for the record, I'm a 9ers boy!! We got a fight now Work Out is Platinum. Always follow your heart. Much Love http://t.co/CnNj7QuR See World.. #RichForever  Salute @rickyrozay SJU. MSG  alumni love http://t.co/6fXZiMjA Farewell http://t.co/hJzJGoKG Blessed. Love yall. Happy New Year. Thats that nigga right there @KDTrey5 @BNolan45 well damnnn Cheese eggs and potatoes http://t.co/aWsecc9i Sanka, You dead? .... Ya man.. @1MattSmith that one was slept on @Ur_Alcohol_Hero you already know.. @jameelaomar don't judge me on my twitter game! Much Love! Still at it RT @Maurice_Garland: Five Things To Riot Over Other Than Air Jordan 'Concords' -- http://t.co/aECGovUk You can let em in, late night Letterman... http://t.co/2eCX7kmS Bring back the Live Studio Audience. Laugh track killed the Black Sitcom. #anybodylistening? Cole World: World Tour. Done. Europe, Thank you for being a part of that. Until next time, FAREWELL. Got my niggas in Paris. For real I need a pencil.. I need a pencil my dawgg Sent a lot of flowers, but how could I cry.. Play the game. Change the game. Don't forget. Thank you to @yrbmagazine. Much Love! 9 weeks later. Thank you is an understatement. GOLD World http://t.co/TxQ3geD6 I come from Fayetteville, NC. Shit is unreal. Thank you for the love. See you at the Grammy's. Wowwwwwwwwwwwwwwwwwwww Happy Thanksgiving! Thankful for too much to tweet, but my life, family, friends, and fans sum it up well. Much Love Reeee-spect http://t.co/iRodwIAn  Much Love to the OG,YN. Take Care @ColeMatic thanks for the reminder Had no internet this weekend, been moving. FRIDAY NIGHT LIGHTS is a Year Old. THANK YOU. 11/12/10 Out in Europe like we back in January. Cheers to my brother @Drake and that OVO. Take Care on Pre-Order. Underground Kings. @ChaseNCashe beat so stupid. congrats my dawgg We out in, Abu Dhabi. For real!  #nowandlaterraps Up goes Frazier.. RIP @wale you won. God is good. Lot more winning to do. Even way out in London Townnnnn @Chris_Zurcher hahaaaa! It's @Wale Day. #Ambition in stores NOW!! Love from the UK! Go get that #Ambition album!! Roc Nation MMG Just laid the verse for my brother @Omen  Can't wait til you hear this song, and his project! Afraid of Heights. Next Week Ankle on swole... still #basketballneverstops http://t.co/bu60f5Hn  much love to #nike Momma I'ma be on NPR \"Lost Ones\" video right now @ www.jcolemusic.com    Cole World Next up. The World. Europe here I come Tonight was the last show on this American Leg of the Cole World: World Tour! Wow. NYC my second home, its all love forever!! Won't see me disappear like the old Aunt Viv God and Ice Cube. Thank you Still at it 11-1-11 #ambition @wale Cole World: The Sideline Story. In stores now. Go pick up my brother DJ Drama album in stores right now!!!! #ambition a milli a milli a milli a milli Performing live on @jimmykimmel show tonight 12am eastern. #1 @MissyElliott you the truth! Always have been and will be! The game needs ya, thanks for blessing me! Thanks to every fan that held me down, every friend, every blog, magazine, tv, radio station, dj's and pd's, I feel like we ALL won Thanks to yall, we shook the game up. No chart topping single, just 2 years of hard work, great music and real ass fans. #1 album So many people to stunt on, fighting the urge to be spiteful. This moment is too important for that. Just want to say THANK YOU Wow. Cole World ATL. Cole World \"@KevinHart4real: Major shout out 2 my man @JcoleNC .......congrats on the Album \"Cole World\" pimp.....I salute you.... #SupportingTweet\" www.bit.ly/coleworlditunes Cole World; The Sideline Story available now. LOVE @wale on fire Let the record show... MARK PITTS believed and got that vision! Fayettenam. Its our night. So I know its real http://t.co/P4Nyjhox Cole World. Best fans in the Whole world. How that feel??!! Had a crazy day, so I missed a lot of yall love I'm just now hearin about. Overwhelming. Thank you! #coleworld Yall sold out so many stores today. Itunes it for now, stores will re-up tomorrow. We on pace. Much Love! What a day Cole World : The Sideline Story available now on ITunes www.bit.ly/coleworlditunes #coleworld Mannnn finally arrived! Live on @angiemartinez show.. Moment! Cole World Cole Worldddd www.facebook.com/jcolemusic live video chat now. Cole World Happy Cole World Day Woke up with my new @9thwondermusic and @phontigallo albums purchased. Carolina we looking STRONG. Support my brothers this week. Goodnight Cole World, I'll see you in the morning @NateDizzzzle love! Still at it... Villematic @BASIKARMA there she go @drake my dawg. Much Love. Cole World Take Care @Nervreck big bro. thank you. @TreyMadeMeYUUUP Love :) @Pardonmeduke we in here @REjus_M partying tomorrow, get ready to call out. @mackmaine my nigga. Ready!! And Happy Birthday @liltunechi ! www.bit.ly/coleworlditunes Album available @itunesmusic #coleworld Mannn. This OUR week. Cole World To all of yall, it's 9/27. My first album is officially available in stores everywhere as of today. Thank you for your patience and LOVE. http://t.co/Nz3Svktq this is the link to that article, I didn't realize how long and unbelievable this journey has been. Just read an incredibly personal story written about me by my great friend @thisisdscott  Just as my album is officially going on sale. Wow I'm right here, excited like you. Cole World @YouFollowGMONEY thank you. @iAmAD08 wow much love 1 hour You know its real when yall feel like I feel. Cole World \"Twas the Night Before Cole World\" We READY One Day..  Remember all the times that I used to say \"One Day...\"    Cole World Nyc. Dollar and a Dream tonight Roseland Ballroom. Tix are $1. Cole World Daddy's Little Girl video http://t.co/8Ugyy87T 2 days. Unbelievable She thinks she's ready for the world Watching it all unfold Damnnn. That was fast. Let's go. 3 days away. Pre-order http://t.co/mO2zrgDa LOVE Lemme know your favorite song with #ColeWorldSept27 and your profile pic will get added to my site. Go here 4 info http://t.co/FaR8Mk49 All your love is incredible man. Album drops in 5 days, a dream is a powerful thing. Cole World Hypocritical society Pre-order Cole World: The Sideline Story on itunes http://t.co/tNuvSB53  6 days Very Happy Good News. The album is availavle for pre-order on itunes and I got the best fans in the World. http://t.co/tNuvSB53 Damn, Cole World Shit just got Real. 9/27 Cole World http://t.co/BhOeiI5S Much Love RT @UHasnain: finally pre-ordered @JColeNC debut album Cole World: The Sideline Story.  #september27th Nobody's Perfect I never cheat nigga my heart is with the Ville Much Love to the good people of Barbados.. Thank you! 11 days away. Wow A dream is a powerful thing Can't Get Enough ft. @TreySongz video premier tonight 10pm est. MTV2. Mr. Nice Watch ft. Jay-Z http://t.co/wOjrJ9DK  dirty. 9/27 Cole World. LOVE Cole Worldddd Adjust ya Roley on these mufuckin hoes http://t.co/BU518fgY Mr. Nice Watch And for my next trick Only time'll teach ya Mr. Nice Watch. Tomorrow. Cole World Headed to H-town. Texas we still rockin. Cole World: World Tour. Alllreadyy 2 weeks away. 9/27. Thanks to everybody who was apart of the listening last night. COLE WORLD RIP TO THE GREATEST \"I win, WE win.\"- @idriselba  Damn, real shit.  Let's win. Cole World 9/27. No #AGS tonight. Cole World 9/27   Love 16 days Time flies Ft. Lauderdale. Our new date is October 1st. Same venue. The Sideline Story. Damn. @chantijade save that outfit. see you in 3 weeks Orlando. Our new date is on September 30, same venue. Never had to do this before, I'm sorry for the inconvenience Orlando and Ft. Lauderdale. We have to reschedule today and tomorrow's shows. I apologize, will have details in a few minutes. Ankle on swole. This is a minor setback, yo, still in all we livin... Friday night in the ER. Damn.. Cole World Gotta see it to believe it.. 9/27 Cole World, No Sextape Canada its been too REAL. Cole World, World Tour with no album. On to the States. 9/27 LOVE @ANegroWitADgree can't even describe it my dawg. a lot of emotions. i came a long way. \"They told me if you love something let it go.... Whoever said that was dumb as hell..\" - @Omen 22 days God's Gift Damn, I gotta wait to get on my own site. Yall crazy http://t.co/AwhyJ4a #anygivensunday Cole Worldddd #anygivensunday Ok, soon come WOW Torontoooooooo... Cole Worldddd (you like how quick i fixed that!) J. Cole Ft. @treysongz - \"Can't Get Enough\" on itunes NOW. http://t.co/lTT30mr  COLE WORLD Cole World ft. Trey Songz http://t.co/rlI9z1Z 25 to go Kentya, found your note after all. It was great to see yall! thanks for all the love that you show me. Saskatoon! Ahhhh don't gas me already! We a few weeks out still! RT @EliteThatsMe: @JColeNC http://t.co/VOH1HOY Just feeling blessed man.. we been through a lot.. @Neslihanboz @Marley_E @AllieMolinar @colecainaddict what's the fuss about! hahaa we got a album coming out!! YEAA Oh shit. We Ready. Pre-Order Cole World: The Sideline Story  http://t.co/Qk8Ooqz now    ...  Cole Worldddd, 28 days @lc_12 that's that classic hustle! haaa We one step closer wow LOVE RT @karanchouhan7: @JColeNC I Will Definitely Buy The Album, Already Pre-ordered 5, one for myself, 4 to educate. #ColeWorld @JB0NDURANT 9/27 my dawg @BreShay_ !!!  Much Love! Saskatoon. Cole World, tomorrow night. See you in a few! Blessed! September 27th. Goodnight Cole World Bonus- Nothing Lasts Forever, Work Out, Daddy's Little Girl Cheer Up Breakdown God's Gift Rise and Shine Never Told (prod. by No I.D.) Nobody's Perfect ft. Missy Elliot Lost Ones In The Morning ft. Drake Cole World Mr. Nice Watch ft. Jay-z Sideline Story Interlude Lights Please Can't Get Enough ft. Trey Songz Dollar and a Dream III Intro Ahem #anygivensunday Cole World: The Sideline Story. September 27th Yeaaaaaaaaaa. I wish I could give you this feelinn One month til lift off. 9/27 Cole World Show #2. Aint shit in my pockets tonight. Lesson learned. Edmonton, Cole Worldddd Gossip Gossip, nigga just stop it The power of twitter is UNREAL! Cole World, No Thievery. That's @imdjdummy excuse me. You're a G, but thank God for Cole Summer camera crew. And please don't call Jay-z, he on vacation Ima let you save the embarrassment and world star fame, by hittin @kingofqueenz or @iamdjdummy so I can gt that back asap. U got a few hrs To the girl in the front row with the white shirt and pink bra. Before I put this footage online of you stealin my phone out my pocket lol People always ask my craziest experience on the road. Tonight the wildest shit happened. So Incredible. Vancouver we did that shit. Wowwww. Taking off for Vancouver to start this thang off right. World Tour, no album out. Thanks to you The Sideline Story.. Aw Yeaaaa www.dreamvillain.net #anygivensunday 9/27 shit feels unreal. Cole Worldddd #anygivensunday on colored people time Cole World: World Tour  dates are up at www.dreamvillain.net can't wait to see yall. 9/27 Illuminati make the best mac and cheese? CHUHHHHRCHHHHHHH http://t.co/w8lbKCX   ColeStreammm http://t.co/2VTejry  20 mins It's a special night.. So we gonna do the ustream ColeStream a lil later.  Cole World aw mannnn @rihanna see, what had happened was... #anygivensunday     ColeStream Ok ok Buzzer beater... That boy GOOD Great minds think a lot #anygivensunday http://t.co/tf6KDgH   direct www.dreamvillain.net  #anygivensunday  Cole Worldddddddd Realized Ye and Jay bout to drop! What a monumental moment. In no way could I try to compete with THAT.. Still gonna drop this off for you What a fuckin shoot... Been shooting this video all day with @TreySongz, excuse the wait. Its on the way. #anygivensunday http://t.co/av8MYyx #anygivensunday Barbados RT @ralphmarston: The more magnificent the desire, the more it will demand of you. Even so, it is within your reach. For you I always had an admiration.. We lost touch, but you never left my imagination Some new things for you... http://t.co/YQqeBVA Any Given Sunday... Cole Worlddd 9/27/11 Any Given Sunday @TreySongz smashhhhhhhhhhhh Cole World, No Bedtime @juicemosesmusic i can imagine. I know the feeling! Will be worth it for those that choose to wait! if not, its all good. still classic Your new song is the shit. Much Love to my sis  @theycallmeBK Any Given Sunday You might wanna rap, but she'll make ya sing @Semtex Talkin bout my gennnnerationn Cole Summer  http://t.co/UxLvQcq  direct Cole Summer  http://t.co/YQqeBVA Oh shit. 2 months. 9/27 RT @JAMN945: .@jcolenc is stopping by the JAM'N lounge for a LIVE chat, now! Watch the chat here -&gt; http://ow.ly/5Mwh7 Wanna thank the early ones in advance. Cole World Midnight in Paris Great Expectations Gboro, NC that was incredible. Way to make a brother feel special. Home \"Work Out\" on itunes. The album is Cole World: The Sideline Story. 9/27/11. Can't wait for you to hear it.  Cole Worldddd Back in Carolina. We home Produced by J. Cole by the way. #badgirlsclub Lift off. RT @Wale: https://bitly.com/WaleBadGirlsClub here u go My brother Wale and Cole World RT @Wale: #badgirlsclub in 2 minutes! Hold it down @fatbellybella hola RT @theBeatTampa: Don't miss our live chat with @JColeNC now!!! http://bit.ly/qXKrX7 9/27/11 We all living a lie. Which one did you choose RT @WildAtlanta: Live chat with @JColeNC now! @WildAtlanta http://fb.me/zRid5lkl @KD_SoAmazing thank you! \"Cole World no napkins\" LOL Cole Summer: Krispy Kreme   direct  http://t.co/g9qPuQm Cole Summer: Krispy Kreme www.dreamvillain.net Krispy Kreme RT @JColeUKFans: @JColeNC 'Work Out' now available on UK itunes! Link  http://t.co/MOp1xaj  yall are the shit, thank you. \"Work Out\" is available on itunes. Let's get ittt Taking off from London back to the States. Feeling blessed cuz I got yall. Thank you. 9/27 @BNolan45 hahahahahahahhaha London. The August 5th show was Fake, false promotion. It's confusing, but I will be at the O2 party 2night, no performance. London, we meet again. Cole Summer  http://t.co/Hrre0Jp Cole Summer: Episode 1  http://t.co/YQqeBVA   Much Love! Cole World Vancouver one of the most beautiful cities. Who's playin ball today and where at? I'm ready. Haven't done this since Howard 9/27 Cole World: The Sideline Story @hooperfsu thanks man. Pac the greatest direct  http://t.co/rEA11jh www.dreamvillain.net http://www.dreamvillain.net Wow. Warm Up anniversary today. First time a lot of yall ever heard me. Not a coincidence the sample just cleared. Let's go. Cole Worlddd The Warm Up I think a lot of people know how much that one hurt. Much love to those who didn't support that. If you did, guess it's how the game goes Just got service. Wowwwwwwwww. Bonnaroo,  Incredible. Thank you. No words for these feelings.   Cole World @Melanie0801 lolllll. That's more creative than the Detox jokes they hit me with @Wale we out the hood haaaa Torontoooo @JColeUKFans love that one! Left side, left side, hey But love yall. Hate leaks. Laptop died. That was love yall. http://www.ustream.tv/jcole Colestream tomorrow. Cole World Praying to the sample clearance Gods \"Self Made\" in Stores Now http://bit.ly/SelfMadeiTunes #MMG   Congrats. @Wale @rickyrozay Meek and my nigga Pill   salute. Cole World When it come from the heart don't it feelll mo' iller you know the drill.... love yall... direct link http://hulkshare.com/7e9731xh4nbx Return of Simba... http://www.dreamvillain.net Cole World Ready Beyonce..  G.O.A.T.   woww New shit tonight.. that's how I'm feeling Young Simba Jokes on you, we still alive My life is like a movie and I do my own stunts @BigSean I do itttttt. @leetreble tip my hat Mother's Day Massacre Damn this shit #disgusting Nooooooooooooooooooooooooo hahahahahaahaahhahaahahahahhahahahahahahahahahaha. Death of a Dynasty.  This is hard to watch Happy Mother's Day! You are appreciated. Yall fuckin crazy. Crashhhhh #disgusting Already know yall gonna crash it. #disgusting http://www.usershare.net/i5692l3co4jl/J.%20Cole-%20Disgusting%20(prod.%20by%20J.%20Cole).mp3 The Summer's Mine.. #disgusting     www.dreamvillain.net This shit disrespectful This shit rude nigga.. Single done. Mixing and Mastering. But this one's for the fans. Ride out.. B-side single for the summer. Nigga this shit rude Disrespectful This shit rude Oh yeaa Ok. I'm Chris Paul time. Speedin to some internet Congrats D. Rose. Boy is the truth. I'm on ittttt!! Just got off stage. Don't think I forgot niggaaa! @youwish This shit downright disrespectful... hahahaaaa #coleworld Let's start it off right. 10:30 tonight The Summer's Mine. Cole Worldddd All singles done. Album ridiculous. Title Perfect. Music incredible. Thank you for your patience. Let's change the game. Hov say we got the 1, 2 punch ready. I say it's a even bigger combo than that. !! Yall are truly the shit. You deserve everything that's coming to you. Oh yeaaaa... We Readyyy Today got that special feeling @MostDopexMiKe Very sorry to hear about your friend. Thanks for the words RT @Wale: Official video for #4am @blackcobain @wale http://www.youtube.com/watch?v=baqpYAUCXfQ Obama spit that Ether. Trump, \"you're finished fam\" #funkflexvoice @KristenRose147 q Tell em' all. The Summer's mine. Cole Worldddd Thank yall. Let's change the game. 500 #LOUDtour that is.. Much Love @rihanna   Cole World \"What's up Momma.. Yes, I'm goin out with Rihanna\" Just an American Weddinggggg Used to hit South Beach, stay at the Parisian. No fun nigga, low funds was the reason. http://plixi.com/p/86190259 To the couple that asked me my set time, I told you 9:50 but they pushed up. 9:15. Hope you make it to the venue in time. Cole World Southbeach. Cameo tonight. Alreadyy. @mcuban Absolutely. You're too real brother. Respect! Mobbin with Mark Cuban. Awesome, Texas. Who woulda thought your baby boy woulda grew up to be a killer Thurgood... Laurence Fishburne, wow Damn. Somebody leaky. Not a reference track. Just a classic from the vaults. Much Love. Alex Haldi sorry bro. We still Dreamville Shittt @Wale verse is meannn. Tell this nigga let me on the track. Mizzouuuu. Cole World @Semtex @Semtex At the DMV feelin like Martin.. if you don't read the newspaper, you are uninformed; if you do read the newspaper, you are misinformed - mark twain As promised. www.dreamvillain.net  \"Nothing Like It\" http://www.ustream.tv/jcole  we onnnn Just made it. LA traffic stupid. Headed to studio. Colestream on Ustream in about 2 hours. Til then everybody say happy birthday to @kingofqueenz   Dreamvillllle Bout to hit 400,000 followers. Colestream tomorrow mannnn. Dreamville Guess who's bizzack @eatinghalalfood glad i got that shit out before the trade. Wasn't so lucky on that \"Caron Butler\" line. @_freakysqueeky beleee dat (weezy voice) As usual yall flooded. Love it. Youtube link http://www.youtube.com/watch?v=vsdLE_bgM3I   High Quality Vimeo link http://vimeo.com/19960164. Yall are craaaazy. Traffic www.dreamvillain.net  Cole World and Drizzy. \"In The Morning\" video. Aw shitttttt. #inthemorning \"In the Morning\" coming @ 12:01 am. Happy Valentine's Day \"They tried to take me out the game, but I's aliiive\" Jokes on you, we still alive Henny on the helicopter. This gotta be a first Ahhhhhhhhhhhhhhhhh!!!!! Holy shitt. Helicopter ride. Ahhhhhhhhhhhhhhh This aint no time where the usual is suitable Studio break. Carolina vs Duke. You already knowww Everything groovy Bout to be Colestreaming on #rapfixlive with my man @realsway at 4pm on MTV.com Tweet all your questions to @mtvrapfix. Finally got a chance to check out www.jcolefans.com  Can't say enough thank you's. Yall mean a lot to me man. Cole World No Snuggie! haaa ;) All the love is incredible. Best Fans in the World. Cole World. Thank you. We wasn't sposed to make it past 25. Jokes on you we still aliiiiiive Wow. Yall are the shit. Thanks for all the love, hasn't even been an hour yet. Just saw a lot of places I never thought I'd see. Blessed and grateful. Flying back to the States just in time. Much Love! Europe its been too real We light skinnded, you could say the future look bright.  Much love 2 my brother @drakkardnoir U \"I got weed, drank, and a handicammm.. All of which is legal in Amsterdammm\"- @kanyewest That's the way lovvvvveee goes... Germany yall goin in @jaiQ13 happy belated from the uk! ;) Thought my Jordans was the 7's. They're the 6's. Sneaker heads forgive me, deadly sin. London tonight was incredible. Maybe the best. What more can I say Globe Trotter, Cole hotter, even way out in London Townnnn.   See yall @ KoKo @msmollay just saw the msg you sent! That meant a lot! Thank you :) see you sunday! Not gonna lie, my jeans a lil too tight today! LOL Taking off for Europe. Much Love You never thought that hip hop would take it this far Hell of a Year. Thank God we still here. Thank you for the Teena Marie videos on VH1 Soul. RIP Watched home videos that I forgot existed last night. Christmas 1995. I got madden 96, 3 xmen, a timex. Life is the shit. Merry Christmas! You are now following @JColesPocket. This is genius! Hahahaa To whom it may concern: Keep Going! Doing what I love every night until the sun come up. Blessed. I guess my pocket had some shit to get off its chest... YyyyyyyyyyyYYyyy!!??? #PocketTweetKing (shout @RealTalibKweli) YYYyY YY Y O Internet Headline Sensationalism. So you just gon impersonate MJ on his own song P @ChaseNCashe. Damn Gina What a way to end an incredible tour. NYC Thank you. Goodnight Toronto Wow Toronto I feel like we've been waiting on this for a long time On the bus watching Boondocks and makin beats. Bang Bang. Can I hit it in the Its time we support an incredible artist. My brother Miguel @migmoney album available now! Congrats! \"Sure thing\" is my shhh Ima get on this TV momma! Dreamville out in Vegas. Awwwww mannnnnnnnnn @g roovechambers. @groovechambers. @groovechambers Happy Thanksgiving, we're all blessed.   Thank You Cole Worlddd @justTovi FINALLY got to play ball on this tour. Didn't lose a step! Boulder, Colorado. Wow. That was incredible The real is back Carolina is my heart forever.    But St. John's let's have a great season!! #stjbb @JayElectronica Welcome brother! You shining bright! @timaaaF :) I see you God bless the child that can hold his own @JanelleMonae ;) you're incredible @amazinglife ;) @MissyElliott I'm amazed by your talent! Much Love. @fatbellybella that means a whole lot. Thank you. I'm bowing in your twitter presence. Wow. Thank you. Yo! We broke the internet! Holy shhhh... Alternate Link cuz yall gonna shut mediafire down. http://www.megaupload.com/?d=562JS3SU hope that works. Got me on my computer geek shit! http://www.mediafire.com/?y7cebmgebnymnmh #fridaynightlights Lot of music, lot of verses. Take your time, digest it. My gift to yall as a thank you. Enjoy. Friday Night Lights And with that said Unbelievable. so one time for www.dreamvillain.net Incredible. Just gonna blast it from Twitter then My site been flooded all day, been trying to get it to work but they saying it's too packed in there. The # they told me is fkn ridiculous But we finally here If yall only knew.. We close. #fridaynightlights Yall get some sleep. tomorrow gonna be a beautiful day. #fridaynightlights I know yall gonna shut my site down on that shit, so here's the direct http://usershare.net/ui7m7pwkp5ha  J. Cole and @drakkardnoir  epic Cole World and Drizzy Drake. www.dreamvillain.net  #fridaynightlights Aw shittttttt Ready? #fridaynightlights tomorrow Damn my poor blog, yall killed it! here's the direct link to the music. http://usershare.net/743rgmo3ftfp Damnn Yall shuttin down my site lol ahhhhhhhhhh. Cole Worlddd. let's not all go at once! loll www.dreamvillain.net hahaaaa #fridaynightlights what up @wale ! I wanted to wait on this one, ib saying just drop the shit. Cole World... Real Cole Worlddd Almost there. www.dreamvillain.net  Full version of \"Before I'm Gone\"  #fridaynightlights  Holla at ya tomorrow. 2 Days! @KCkeepitREAL read! Will put out trailer tomorrow, and another leak. Dropping full version of \"Before I'm Gone\" @ midnight tonight. #fridaynightlights ColeWorld Wow BBGun killed this trailer for FNL. I love it @illaDeuce salute for noticing brotha. Thank you @Jan_Badda hahaaaa beautiful ;) go get it Maine, that was crazy. Much Love, jerMaine. 3 days. You ready? #fridaynightlights This might be my fav kanye song ever.. Damn. And that's saying a lot. Blame Game Can we get much higherrrrrrrrrrr 4 days. RT @Wale: #fridaynightlights 5 days. #fridaynightlights Lookin for trouble. Hahaaa. Honored! #fridaynightlights Lookin for trouble. Hahaaa. Honored! http://www.ustream.tv/jcole #fridaynightlights Just got off stage. Here I come. U-STREAM COLESTREAM ColeStream after the show in Milwaukee tonight. Let's say 11:30 EST. See you in a few. #fridaynightlights There was no need for the curse word in that last tweet. hahaaa I'm tryna get better Think we gonna fuck around and U-stream tonight. ColeStream #fridaynightlights #fridaynightlights RT @drakkardnoir: Me and @JColeNC on tour in Europe in January. That shit shall be magic moments. Friday Night Lights. 7 days 8 days Columbus, Ohiooo. Just touched down. ColeWorld Greatness in the air Oh shit, yall shut my site down! !! haaaa this is great!  Cole Worlddd Friday Night Lights. November 12, 2010.  www.dreamvillain.net  aw shitttt Until it became clear that I don't know how to half-ass. So sorry for the wait, but let this music make it up to you! When I first decided to do a tape I figured I would just put together all the freestyles and songs that leaked, with 1 or 2 unreleased songs Excited as hell Not from Florida but.. What up FAM Fam that's incredible RT @Kingrashee713: \"If u missed it, ill repeat it.. im the light skinned jesus!\" -@JColeNC http://plixi.com/p/53970406 @BASIKARMA aw shitttt. Happy Birthday :) !!! Be safe, but go in! www.dreamvillain.net  brand new. Updating often. Just gettin started so grow with me! Cole Worlllld Sometimes I just get on twitter to read and say \"thank you\" in my head to all the incredible shit yall say to me.  Thank You RT @amschnitz: This tweet is brought to to you by Cole World!!!!!!!! and these black and red 11's!!!! Hahaaa chicagoooo twitter jackin!! P \"Chi Town what's goin on\" VA Headed to the studio in Boston. Working hard to finish this tape. Can't wait for you to hear it Damn. So many Dreamvillains in New Hampshire. Much Love! Thanks for coming out. Cole World Shout out to the girl tonight front row that rapped every single word with so much swag. Shittt Inspired as usual. Kanye West. Ahhh. @KingOfQueenz gonna dm you. Merry Christmas! RT @T_Villa: Ughh.. I can't go see @JColeNC when he reaches #Toronto.. No friggin money. @myCHEEZEisGOOD @KASHKASTRO Fayetteville State tomorrow! I'm coming home! @BassyBadAss Thanks for the love. But I'm not engaged. Greatness is in the air. @EMaynor3 up NC A&T, that shit was legendary. I heard Petey Pab was trending! Haaa! Let's gooo This shit embarrassing lolllll Yoooooooo who ordered the stretch Navigator!!! Lolll. @angelayee This is the shit we used to dream about Weo We Q ¶ P shout out to www.jcolefans.com  love yall! D0 @FILTHEritch LOLLLL RT @RealWizKhalifa: yo taylors, download tha \"look in tha mirror\" (rmx) http://bit.ly/b2LMeR wit @yogottikom @wale @jcolenc and my high ass @REjus_M damn, I gotta go through twitter to say Happy Birthday?! Happy Birthday! YN told me to twitter (tweet?) tonight. almost forgot. Much Love to all. On this journey these the moments we won't forget! Think this is the 1st time! But thank you. what's up!! RT @deziisdopex3: I wonder if @JColeNC ever sees my ... http://tmi.me/1OdSB R Yall the shit. Hfgaskiheksaihajshihakdiuha thank you Why aint nobody tell me my pocket was tweetin more than me. Pawhwiahalahdiljbguw QQPP¶poop¶ poop¶ QQ0Qpu P Riverside thanks for the love I know the city gettin ready for meee DPGf ZZpOipwqPP0PpPpPPP Ap That was fun. Shout out to everybody that came out. I barely get to play anymore, so I got a much needed run. Yall boys was hoopin for real! Are they gonna let me in the gym? Yall saying Burr gym. if not we take it to that outside court Ok gettin kicks now. Who coming to hoop, its looking like we goin to Howard Ok. I need to go pick up some shorts and get some kicks to play in. And we can get it in. And I gotta get some Ooh's and Ahh's. My favorite All the OG followers gonna remember this. DC Where we hoopin @ today? Howard again? DC ! Ahhh this song I'm doing got me reminiscing @IncredibleLAGO those are gonna be monster records. ! Pac all day. Damn, the L is for Lingerie. Lol.   A lil more sexist, but a lil more sexy too Wow. Ladies Football League. This could be the best everrrrrrr Single Black Female, addicted to retail We u-streaming live w/ @djhyphen and @jmooreseattle on www.kube93.com Villematic That beat is incredible, shout to Yeezy. Much Love. Shout to Bink. I could write a million verses to that. Happy Labor Day. We Workin http://dreamvillain.blogspot.com   Villematic Got em on the edge of they tweets Before yall leave for the club tonight, hold up.. I'm in a zone. Fuck it. I'ma do a mixtape. Sometimes you gotta just say fuck ittt Sitting on classics. Tired of being stingy Damn, this some timeless shit. RT @X1023FM: HERE IS LIVE WEBCAM LINK FOR THE @X1023FM LOUNGE STARRING @JColeNC J COLE http://thenewx1023.radio.com/mccrazy-web-cam/ Shit nigga VHS. I'll come through.  RT @AWonderRhymer: @JColeNC cole boy we broke. Nigga ain't got no TiVo. We n the hood man Hope somebody in Miami tivoing. I'm all in your fridge tho be ready. Have some juice I'm a juice fiend LOOK! Since I can't catch it. TIVO Rising Icons tonight @ 12 on BET. I'll pick someone and come watch it @ YOUR crib. No bullshittt haa Damn, I can't catch Rising Icons tonight @ 12. Light skinned so my house niggas feel me 808s so my South niggas feel me Mystikal is still a got damn Star. Fuck what ya heard. I'm watchin this nigga perform, wowwwwwwwwwww. #1 victim of pocket dialing from my phone. @joejoe3h A-town tune into @v103atlanta with @lilbankheadv103 and @younginfamous tonight. \"Talllk to me\". Then watch Rising Icons. Best story teller, thug narrator, my styles greater. @reirei0 45. 50 cent incredible on twitter Just met the Pastor. Pastor Troy. Wow. We workin RIP Babygirl Early morning raps. Oh shit she's a gold digger.. Just thought you should know nigga! Feel like I'm back in Queens!! 07'! Mark Pitts is the truth. He got the gift man SJU, NC A&T, WSSU, Howard, Hampton, Clark, Spellman, Fayetteville State, UNC, NC State... good times Freshmen Predator's yall know who you are! Shout to the upperclassmen. I know you feel like you run the yard now. Shout to all incoming freshmen this year. Good luck. The food gonna be great for the first month. Then... College was the shit. Nyc this Sunday @ Governor's Island. Power 105. Much Love Right now! http://www.ustream.tv/channel/j-cole0 ColeStream Setting up now. 11 oclock Colestream ColeStream Salute @kingjames. We are all witnesses! Hillside Deli!!!! http://www.ustream.tv/channel/j-cole0 i'm back up and running. let's try again Sorry yall. Renternet connection in Phoenix airport. I'm gonna try one more time. http://www.ustream.tv/channel/j-cole0  baby ustream. right now! Almost there! We'll do a baby Ustream in a few right before I board this flight. Then a grown up ColeStream from the studio Tuesday night. Bored her like Me-hi-co In El Paso, TX making beats in the hotel room. Feeling blessed. @YimisiaL Happy (belated) Birthday! Many More (just thought about Mandy Moore as I typed that)!! Haha!! RT @newyorka: #famouslastwords lol RT @JColeNC: This shit make me feel like I can do anything!! Don't be singing this in the airport tho This shit make me feel like I can do anything!! I been playin Country Grammar in my head all day. In St. Louis just kicked it with @nelly_mo. This nigga had all them hits b4 the deal. Wow Girl ya special like I met ya in the slow class Be youtiful Be you This for The Underdogs !!!! ha!! let's be great RT @KarenCivil: KarenCivil.com Exclusive: J. Cole - ‘Blow Up’ http://bit.ly/br0caj That's not how it was supposed to roll out. But it's still a great day! RIP GARY COLEMAN. LIFE IS SHORT! Today's gonna be great. Just watch! Yall gotta admit I'm steppin my shit up Teach me how to twitter teach me teach me how to twitter I know I said no features on the album, but that was before I heard 50 Tyson!! Shout out to Nahright for acknowledging my production. thanks a lot. You know I hate to brag, but I love when people brag on me! Man let's be great. Getting a tour of EA Sports facility in Vancouver. Feeling like a little kid!   In my new york voice, I'm MADDD excited son! Thank you for all of your support and love. Ustreaming at 100k followers.  Cole World \"Bitch, you bout as Indian as A Tribe Called Quest\" LOLLLL Chicago.... That was incredible. Thank you.  I needed that. Damn I fucked up the line. 5 hours later... I'll be there in 5 minutes!! 5 minutes later....... I'll be there in 5 minutes I'll be there in 5 minutes I heard its crazy in that bitch right now. Chi-town I'm on the way! Shout to Power 92. Chi town. 2nd time here yall showing me love. Much Love 2 the Polo Store in Chicago for opening the doors for me after hrs. \"But we shoppin in that mothafucka and they just closedddd!!\" @Prince611 thanks a lot. Can't wait for you to hear it @KDthunderup I was there last week bro, don't think you were in town. I make sure I hit the club in all of em. Club Platinum in Birmingham remind me of the ville. This is dope. I'm seeing so many cities in I never really thought I'd be in. Birmingham, nashville, chatanooga, OKC, montgomery, wichita A-townnnnnnnnnnnnnnn Where trouble is just a bubble in a champagne glass... Copped my first pair of Louis kicks. We stuntin in baby steps. @cnnbrk all you got for us is bad news Fayettenam!! Its a beautiful day in Dreamville! Let's gooo! @Oneandonlycp3 hit me brotha Fayettenammm. 2 days away. New shit from my brotha @Rain910 Rain - American Dreamin' 3 - http://bit.ly/cytXoc Download and RT. The boy is a beast @Wale easy now Anythings possible! All we got is dreams!  RT @ItsMane: @JColeNC cmon Cole u really think penny gotta chance in da league right now Where my skates RT @wowitsjashon: @JColeNC #iftheheatsignpenny you gotta go back to work at round-a-bout skatin rink down the street from me #iftheheatsignpenny Penny Hardaway!! Let's make a miracle happen baby! Dreamville! Haha!! Dreamville basketball. Thank God I still got at least a LIL game! Heartbroken. Damn London, wow. Thank you @Maurice_Garland I swear they just threw that on in the club right now. 2:16 am in London. Damn #twitterlurking from london town. Nobody's safe @Maurice_Garland niggaaa. Man.. Shit remind me of nc a&t homecoming, 2004 if my memory is servIn me right. Shit was so fire bo. Good times Headed to London for the first time. !! http://tweetphoto.com/29858494 @jaiQ13 :) don't feel bad I never know what to tweet period @BASIKARMA you alreaddy knoww @callherKila yup sooner than you think ;) Lol. Well, shit. You right RT @deelo_: Lmao. @JColeNC said he greedy for the followers, yet his ass only tweet once in a lifetime. Lol. @YungTEX21 double entendre! Yall goin in today :) @TEAMCOLE Damn, Chicago yall showed too much love! Thank you. Damn, yall so happy for me. Thank you. One of those moments. New Orleans got it We're gonna do something to make up for it. Just us, no label no press.  Thanks, Much Love Sorry to those who waited in line last night and couldn't get in. It was out of my control. Please hold on to those wristbands That's why. RIP to the greatest. And my mission is to be more than just a rap musician. The elevation of todays generation if I can make em listen. If you see God first, tell em shit got worse. JUNE 1-6, 7-1. THE DAY momma pushed me out her womb, told me \"nigga get paid.\" RIP to the greatest before I go to sleep. \"Aint nobody tryna start the party with all them instruments\"- @KingOfQueenz http://dreamvillain.blogspot.com token of my appreciation @moenimoe happy birthday! you got a great friend, keep her around! A million thanks to @RealTalibKweli and @hitekzilla. Got a lil preview of that Summer Jam stage. @AkiyahB Happy Birthday! Live it up Fayettenam. Made history @msbritwilliams happy birthday to ya :) Soak up this moment. Give thanks cuz your Blessed. Jokes on you, we still alive ;) RT @pinkmatryoshka: I just read @JColeNC timeline & just got what he was talking about. Hilarious! Yall know I'm kinda slow Oh, umm wow. You're back so fast. Crying??? Umm, haha, Naww, i had got some cologne in my eye or whatever. You know me, so clumsy! I was stubborn. And now look.   0 I didn't think this day would really come. I know I treated you wrong, I know this now! Something told me, \"you should tweet more.\" Although we've come.. To the ennnd of the roooad.. Still I cannn't lettt gooo.. Its unnnaturalll.. You belong to meee.. I belong to yoou Damn. You never know what you got til it's gone. I told her, I'ma.. bout to get my Run On so hold the comma.. Shout out to @hot106 for all that early love. #whodat #whodat Huey mixed with Riley. Boondocks. Series on tivoooo. This aint no time where the usual is suitable Blogs change that artwork please. \"This the real one baby\" http://i883.photobucket.com/albums/ac32/dreamvillerecords/JCOLE_whodat_.jpg Got-damn she's fine, but she parties all the time. Ill be damned momma, they know who I am momma. I'm still ya litte boy, but to them I'm the man momma. My momma saya,\"tuck ya chain son, they'll take it...\" I hit her with one of them stale faces :/ Sometimes life goes full circle. Peace St. John's Montclair, Jerz. shout to D. Scott. Hello twitter.  DC/Howard what up.     RIP Guru May weather Sound like some wack ass prom line, but... Ill never forget this night. NYC SOB's. Peeace @DarkMelodie106 LOL 14 songs aint enough. Hell naw @MsBritWilliams hey hey Respect to Norm Roberts! Salute Winston soundin Live! @STJ_Basketball those boys showed so much heart today. Great wins and tough losses all season, but I'm PROUD I'm like 98 LIVE you like DOUBLE DRIBBLE  Haaaaaaaaa! god bless dmx. damn who remember when he dropped @EssenceofBianca tell him I said thank you please @definitely_nah its a got damn rap geek party. FANTASTIC 4- KILLA CAM PUN NORE CANIBUS \"They say raps changed, they wanna know how I feel about it\" I shatter dreams like jordan, assault and batter ya team, ya squadron'll be barred from rap like adam and even from the garden RIPPP Jay and big L. The black cat with 9 lives Big L anything Canibus- \"97 clue freestyle\". Mannnn. Ok Bad Meets Evil- \"Scary Movie\".  Em murrdered Royce da 5'9- King of Kings.  \"Birthed with the urge to walk water\". Keri Hilson on Ustream. Studio session stops. @misskeribaby Phone was dead today. Can't leave without sayin... BIGGIE @ChaseNCashe hell yea, he gon be something Disgracing the jersey. No heart. This is gonna be hard to watch Definitely back in the ville bo.  #schooldaze http://tweetphoto.com/12982348 @TorixCheyenne dRrde @commenturry thanks homey @commenturry you sure bout that Preciate that Kobe Atlanta-Twitter APB. If you got Dreamville's camera from last night hit me up. And I got some bread for you. Thanks That was classic Atlanta. A-Town bound. See yall tonight @natthedem @AdamSerwer Song was made in 2007. So the criticism was for @georgewbush. But art is all interpretation so take it how you will play the game, change the game Something for you. Knock on wood yallll http://usershare.net/tgpdfvovbnzi Jalen!!! Ha!! Sometimes rhymin I blow my own mind like nirvana     RIP Pun @JillyJill aw shittt! Happy Birthday :) http://tweetphoto.com/10558853 Grateful for a lotta shit right now. Friends, family, lockout studio sessions I (cont) http://tl.gd/7b5vh Blessed because I got the best fans. www.jcolefans.com THANK YOU Technical difficulties. You know I'm comin back! RIGHT NOW, http://www.ustream.tv/channel/j-cole0   ONLY COME IN THE ROOM IF YOU GOT HENNY! ok settin up. H TOWNNNN Yall up? Let's gooo @TREofUCB hahaaaa!! Mann we gon do a damn bday ustream! right after this studio break.. H-TOWN!! Man thank all yall! @E_Dub_a_licious loved em! Thank you very much :) still some in my hotel room right now Rock, paper, scissors for the name? RT @JCole: to all my fans -- unfortunately j.cole the rapper is @jcolenc..but thanks for the shout outs The song is fake. Shout to ol boy though he had to work hard on that one. @mrjeffdess. ▵ @mrjeffdess What a night. Preciate it. @JColeNC Come on. Hurry up haa! RT @AshleyBee25: @JColeNC didn't know you were in town tonight! Now I gotta figure out where Warehouse is! Lol I aint gon lie. I love H-Town RT @SaschaStone: J Cole TX tour heads to Houston with @JColeNC tonight at Warehouse Live. Tomorrow night in Austin at Aces Lounge. San Antonio Man I'ma take twitter off this blackberry. Tired of these accidental pocket tweets @CedBreeze hahahaa! 10 beans kid! @sweatshirt  http://tweetphoto.com/8998813 @sweatshirt How bout them Cowboys!! Ha Miami That mixtape that dropped aint from me. Shouts to whoever put it out though. Its all for the cause Haaha! I said you right. RT @ChaseNCashe: @JColeNC Would you put him on Losing My Balance? lolol. Nigga be talking about O's on the scale Ha! Well maybe not every song. Chase know. RT @ChaseNCashe: @JColeNC Do not believe that Jeezy shit you just said lol. If my lil puppy died. You can play this shit and I'ma be alright One thing yall should know. When I'm in the club the one song that get me rockin no matter what @808sandcupcakes you got the fire twittername When you making an album you realize Jeezy can basically fit on every song @AkiyahB that's how you feel huh! @YEBies @JNSQ_Kompa d @JNSQ_Kompa Let's go yall! RT @KarenCivil: Earthquake relief for Haiti please text YELE to 501501 to donate $5 or go to www.yele.org My prayers are with the people of Haiti and anyone with family there today. How can she slap??!! Sade is killin everybody VICK!!!!! We worked so hard this week. We deserve to kick back. Celebrate. @TheRealTahiry @mrjeffdess I see you yes sir You know I'm up right with you. Who's workin? Keep pushing You still up? Let's get it. Who's up writin with me  http://tweetphoto.com/8049504 Let Elite Breathe! Unreleased Cole shit on this. Go! RT @elitethatsme: Elite - The Groundwork Mixtape ! http://tinyurl.com/yjccxc2 @GetEmSlump what up bo! You was twisted in DC hahahaaa @EMaynor3 what up boy! I'm good dawg. I see ya, how you liking the new squad? @kevindurant35 we got a ville representa ridin witcha! Guess who's bizzack Happy New Years all. It'll be one for the books. Pardon my french, get off Tiger Woods dick Oh yea, I'm back in the ville. \"Lights Please\" is officially on itunes. Let's go @misskingjo slap them @bigcas910 I had to rewind that shit like 3 times. Too funny craig sager has crossed the line tonight Anything's possible. Happy Thanksgiving yall @REjus_M have fun be safe! album of the year - Lee Fields \"My World\"    itunes it Hahahhaha RT @Naqiy: @JColeNC #freshprince \"Im stuck in a basement sittin on a tricycle, girl gettin on my nerves...\" \"Hillaryyyy. Willlll yoouuu marrryyyy m...\" ......   #freshprince #freshprince it was one of the best episodes, but yall know you was like \"nigga, please\" when Carlton had that gun. LOL Lolll GOT THE DRAWS! RT @Omen: @JColeNC funniest episode is when #martin goes to court...Tommy what does GTD stand for?? GTD..GOT THE DRAWS Oh god. #martin ha-shee-ta-shee! RT @Furious_Styles: @JColeNC HOSHITOSHI!! HOSHITOSHI!!! Will Smith was doing his thing on the acting though. Don't front. #freshprince \"Why don't he want me uncle phil?\" LOL RT @jenjen143: how about when #martin bought the Jordans without telling Ginna so she returned them & got him AIR WACKS instead? &lt;3 Dontcha no noo goooood #martin LOL No disrespect to #jamiefoxx show. It was funny as hell. But let's be for real. #martin vs #freshprince #martin went through some real life everyday shit. Remember the DMV LOL For the record, I'm all time #1 at Carlton Dance. \"Its not unuuuusuall!\" #freshprince Damn, all day?! What about all the #martin characters RT @Resagarrett: @JColeNC #freshprince ALL DAY! Its hard I know! But I think it says a lot about a person. #Martin vs #FreshPrince Twistory #Martin vs #FreshPrince. We can make twitter history. Wait, you said HOW much? http://pic.gd/ef3bd1 Leaving Columbia. The people at this label are the best man. So much energy and excitement, I'm truly grateful. @ChaseNCashe you know you gonna lose dawg. It's all mental, and I'm over the hump. www.jcolefans.com  that's how my momma keeps up with my moves not mystikal but bitch it's mr. cole @Pardonmeduke that's the best shit I seen in a minute lol @goofygoofer thanks for the support! DC Chillin Watchin Jay set one last time on this tour. So much energy in this building. Bittersweet moment My nigga CP3 need some help out there man And you know I'm pickin this up too. Congrats :) RT @melaniefiona: MY ALBUM IS IN STORES TODAY!!! Congrats to my nigga Wale. #attentiondeficit I'm about to go cop, as you should. Shout out to all black people ashamed they don't know how to play spades Ridin wit no tint so them muthafuckas know its me @aristotlebam !! Classic Respect! (In my jamaican voice) RT @zeinagrace: what I do in class, doodle @jcolenc song titles :) http://pic.gd/5d3bd8 I stole somebodys flag on accident at Much Music in Toronto. If you know this dude let me know, I'm tryna give it back lol @lemelpblog thanks a lot Speakin of cartoons, shout out to everybody that was old ass hell still watchin Rugrats. @melaniefiona yes ma'am. Long overdue! What up Canada http://dreamvillain.blogspot.com/      boom Oh shit melo Great interview RT @djbooth: [Listen Now]  J. Cole Exclusive Interview with DJBooth.net: http://bit.ly/6OscE   (Shouts 2 @JColeNC) Just met with the guys from jam'n 94.5 thanks for the support. @djpupdawg945 Bomm Sheltuh! Fayettenam! @KimbleWright make sure you let me know somehow Redman knew his shit was regular, that's what made it funny. How you gon show off a regular ass house on mtv cribs @REjus_M @ShottaDru tour is ill. a whole lotta sleepin on the bus man. shows be packed, put black music fest to shame http://dreamvillain.blogspot.com and say what's up to www.jcolefans.com better leave a Malone @CedBreeze my phone died Ann Arbor @BASIKARMA easy now! Fuck what they teach in class, ima reach the mass You ever hear a song and realize you been fuckin up the words for years? @ShotGood11 lol alreadyyy Do you fools watch interviews or do you just skim through it! @bdottm dawg never did the words \"better\" come out my mouth lol @definitely_nah imagine if he first dropped in this day and age. Really, just picture dawg @jonesfranklin lol so I heard Gotta know the nas verse. I added an extra word that fucked up the flow.  RT @jonesfranklin: @JColeNC dude I see no grammar problems? Fucked up the grammar on that last one.. I guess yall should know I'm gonnne. LA LA \"I schemed since I was 14, what the fuck what was your dream?\" One for the books On my first tour bus. @alexisbelon mom is white A-Town Xc Crucial RT @IamNovel “Sometimes you put walls up not to keep people out, but to see who cares enough to break them down.”-@Payfresh South Beach its been a minute. @Lyriks damnnn, sorry to hear that dawg. Don't sweat it tho, will be more @BobbyCreekwater what's up creek. see you in the A this weekend right. Death of #playonplaya Panthers let's get this W @CedBreeze yeaa, you comin RT @iamreek: What am I here for I'm a man so I can not let them tears fall but understand I'm trying to get my head clear yall @kevindurant35 back home in NC for the weekend dawg. What's good your way Yall on it today Mmm RT @amazinglife: just found \"Losing My Balance\".  gold. how many women have been a little of verses 1 and 3? looking for balance again. Mmmm RT @AkiyahB: \"A women's life is love while a man's love is life\" Flying to Carolina. Yea I got that student discount by the way. But 3g's for another macbookpro and some accessories I still feel like I lost. Steve Jobs won. Took damn near 2 hours to come up off that $  http://mypict.me/LcwS I didn't mention I'm at the apple store right now. Ima go to the food court and eat first though. Gotta talk myself into paying full price. Who got that Apple hook up. Gettin a new Macbook and my morals won't let me pay full price. RT @Power106LA: RT @LALeakers We got @JColeNC on The Takeover tonight! Every Wednesday night at midnight on @Power106LA! @djsmallz respect Barack is in town. Shut this whole city down. @JiLLLyT that's a come up!! Let's get paid! @RitaOra go to sleep! @DCtoBC 92,000??? mannnn, you killin @DryHumor thanks a lot. I'm glad you like it that much. @CedBreeze hit me up Loll  RT @lilduval: Yo Lupe Fiasco I mean @jcolenc u killed that verse on \"star is born\". Ayo @lilduval, I'm happy for you, and ima let you finish. But @kevinhart is the best comedian under 5 feet of all time!!! That boy good @1phenomwoman thank you :) Either I'm in the wrong spot, or yall niggas don't hoop http://mypict.me/Hlds I must be at the wrong banneker. What's the address RT @RasheedVP: RT @JColeNC: Anybody hoopin in DC today (Banneker court across from HU) Anybody hoopin in DC today DC what up Hangin with BBGUN the illest directors on Earth. As my phone dies peacefully. Who else thinks time has been flyin lately Oh shit! In there RT @RealMlawrence: 2010 TOUR Coming !!!!!! MARTIN LIVE! Love when interviewers ask intelligent questions. Had a very nice intvw with Soul Culture a lil while ago. Not only do they brick, they put a buildin up as well.. Shout out to everybody that tries to give the WNBA a chance, but can't make it past a full quarter. I will NOT be at Soiree tonight NYC. Just incase you saw a flyer or got a msg. Gotta pay Pac my respect before the day is done. Greatest @ThaBizness what's good! vma's? Thanks to everybody who came through NYU. Mann. Yall were incredible Tickets for non-NYU students will be available tomorrow @ the Kimmel Center box office 12pm. W 4th and Laguardia. The show is tomorrow night @CedBreeze hit me when you walk out Finished shakin hands and kissin babies. Goodnight. @CedBreeze yo call me Rehearsal. Show at NYU this Saturday night. Mannn RT @Agentspits: Ya I think about heaven sometimes, can't wait to go/ If it's real, will I even get in? I ain't fa sho - @JColeNC http://dreamvillain.blogspot.com oh shit Who the fuck does \"Carl Jr's\" think they fooling out here? This shit is Hardees! I love LA. Los Angeles Clap For Em' @Maurice_Garland hahahahah dawg I was losin it. Aint no grind worth rockin some dirty ass trappin drawls Nigga said he got his Trappin Drawls on @AkiyahB new site looks so nice! Thank you :) @Diznee http://dreamvillain.blogspot.com/ you might find something new Aaliyah LOL RT @lilduval: You ever be fucking and tryn to hold Yo nut back then u say \"hold up this my ol lady she know me.\" @herfection thought you were in winston @herfection yea you here I guess we'll see RT @GardenCity706: @JColeNC Please say you got a verse and not just the hook on BP3 Bull city what up @KingOfQueenz stop puttin your life on twitter nigga. Don't be that guy! When you ask niggas in jail why they in, they always start with \"They tryna say I..\" To leak or not to leak. That is the question. To all Chi-Town folks, contrary to what the flyers and ads say I'm not scheduled to perform at Sneakerpimps this Friday. @nr_os_Dre thanks dawg. couple months before @KingOfQueenz that was 2 years ago. Crazy @dopeboySHAKE thanks dawg. I know right, its crazy how life can work out. But still a long way to go. How is shit your way Shout to the Ville, we finally made it on a Jay album. Damn, yall know how hard it was to hold onto that news for so long Touch what I never touched before.. Seen what I never seen before.. Woke up and seen the sun Preach RT @ChaseNCashe: @JColeNC Holla Holla is a classic fuck what anyone say Damn, 50 had us hatin on Ja. When we all know this nigga had HITS. Shout to everybody that know ja rule lyrics. Every thug needs a ladyyyy @cooperlvr welcome! RT @lilduval: and i see why people die from AIDS after they find out how much the pills cost u just be like fuck it! its cheaper 2 die Congrats Mike Vick @JiLLLyT that was fun! Thank you After that I grab yo ass! Yall know what this isssssss!!! Its a celebration bitches @ms_mathews lol what a difference 6 years can make. RT @KingOfQueenz: We all tryna celebrate tonight where everybody at NY ?? We already leanin over here Yo let's hit this goodie mob show in atlanta next month. Mike Tyson is a poet. Can I get a encore.. Forgot to say Thanks Philly UU When I see a girl with a \"I Love My Boyfriend\" shirt, I know she cheatin. @ms_mathews ok. Comin right up lol How you gon do spoken word in autotune @murda_mia thank you Fuck it, its motivation. Some niggas gotta walk thru life, some niggas roller skatin.. But I'm used to not havin a lot I don't wanna get rich, leave you in the hood.. Oh shit. Enuff is playin skew it on the bar-b. My lord, one at Clark one at Spelman RT @MrRooney85: Listen out  for \"Grown Simba\" by @JColeNC today @ 5 wit Dj Enuff on the 5 o Clock free ride on Hot 97. @iamladyP hahaa! Good God what a daaay... Thank you Get back to rap you niggas twitter too much @whyhelloclarice very glad to hear that. Thank You! @r_eazy thanks a lot. \"Hold It Down\" also one of my personal favorites. I will try my hardest! @SUBCONSK2EZ thanks homey. glad you feeling them @angelayee i'm startin to realize it's an unspellable sound.. This reminded me of how fun your show was RT @angelayee: check out J. Cole interview on www.teamyee.tv @jcolenc http://teamyee.tv/?p=760 http://bit.ly/Lt58V\n great interview and photos from HONEY MAGAZINE. thanks yall. @AHOD thank you for that @Semtex great interview with Hov. Thanks for showing me love out there. Somebody tell @dizniz32 to pull over. I aint tryna die tonight. Peace Boston. Boston, See yall at the house of blues tonight. Yall tell me what's happenin after, or we GOTTA  get out this city. Too many crazy looks @EverydayLaVan fire. Love the shirt On the way to Boston. What uppp @herfection lol ok cool. Too much footage if you ask me.. after you, no more! Let me know though RT @Rain910: Watch @Rain910 & @JColeNC in the studio. Best of Both Offices.  http://bit.ly/VMzwk some new Pac shit, thank you, God is good. and some ORIGINAL shit not with xyz on the beat Shout to everybody that used to mumble all the words to \"Crossroads\" @CedBreeze LOL damn that's fucked up now that I think about it. Hit me up bo And this is how it looks inside the paper. Good lookin Filthe! Yall save me a copy http://mypict.me/d6qw Ahhhhh RT @Nervreck: http://twitpic.com/bc0d9 - @JColeNC gets hometown Fayetteville Observer newspaper cover!! RT @FayettevilleNC: @jcolenc does me proud in this article, even if he is using the other name! http://ow.ly/hYTc @Northwestfinest thank you very much @CaliLiVe you can make it through, change gon come! @REjus_M lol. probably in september. Heard meme gets mimi saturday but I'll be out of town tho, wack! Anyways, enjoy your day. Goodnight @REjus_M lolll that sucks Just left studio. What a day! I deserve this sleep @uhreecuh yea gettin late, still in studio tho @uhreecuh yeaaa it was a wrap without that @uhreecuh I know I had to slow the chat down.. It was crazy. @uhreecuh you were in there Ustream was fun as hell. http://www.ustream.tv/channel/j-cole0 not going live yet, but that's the link settin it up right now. !! Ustream.com is like live video streaming for those that don't know. we in the studio right now. let me set it up! yo if i can get at least 10 people in a room i'll try out the USTREAM! lol spread the word for the late nighters lets make it happen. USTREAM TONIGHT? @dctobc I still got that acapella! You're welcome on the shout, but rethank you for the early love. My nigga! RT @Pardonmeduke: In case you missed the interview. Here's J. Cole's Alistradio Interview with DJ Enuff http://tinyurl.com/np7s8u It was sick. Thanks @djenuff RT @nydblockny: @jcolenc this is one of the best radio interviews I've heard in a very long time. RT @AlLindstrom: @jcolenc on alistradio.net @ 10pm w/ @djenuff #inhighschool I missed out on a lotta @*!!# \"almost erased that line but in the end I chose to keep it.. Cuz if I said it..\" @brent_harris :) Let's work!!! @AriFBaby didn't get it. Email? Phone? You know I wouldn't do ya like that RT lmaoo @CedBreeze: #howdareyou call in sick at work on the day you get paid, but show up to get your check...lol... @ShotGood11 LOL ether! That shit was hilarious @brent_harris hello! Lol. You can still hit me every day tho! Thanks for the love @SirPeezY lol, I got a long way to go @jkeyser989 you're welcome! thank you for listening @DJIKEGDA it was pretty good dawg, how was summer jam Real glad I followed @rosaacosta sometimes you can hear her accent in her tweets. And I never even heard her talk. @ThaBizness should be. We'll definitely link if so. Keep killin em @BASIKARMA hands down, I think you got it right now @ThaBizness just workin! Yall are the shit, great work out there dawg. @RaeSanni wow. Thank you! For those that were out friday night smh RT @JColeNC: This nigga said FUCK IT! LOL http://mypict.me/bhuD @angelayee @bdottm wait til the hood finds out about this one! And since we only on the first verse... Girl take off that purse.. Aight DC. Thanks for the love. @Mizz_Undastood3 thanks for showing me love! Sippin just a tad in the hotel before we head down the street to the show. DC let's gooo @John0239 thanks a lot homey. Next year! @AkiyahFj you already know lol This nigga said FUCK IT! LOL http://mypict.me/bhuD Its hard to describe that feeling you have after you been harrassed by some cops. Other than blood boiling. Pulled over for driving while black in Maryland. Let's see how this goes. You just callll out my naaaammmeee.. And you knoooow wherever I ammm.. Ill come runninnn.. To see you againnnn.. Mann forgot how much I love DC. And I'm headed for DC... Rain is straight out the VILLE. And he ill! RT @Rain910: Download American Dreamin pt 2 (Money Over Fame) http://sharebee.com/3dcfd72b @nataliadian ! Appreciate that @GQatHU thank you very much @JacquesMorels my fault that was some pocket button pressin shit. What's good tho @JacquesMorels @StadiumDan thanks brotha! @ROC4LIFE !!! Catch me on Hot 97 tonight with Kay Slay, during the Drama Hour @TameraRoss fayetteville! Charlotte is that shit @Trosepmd I'm still tryna get my sleep back Wish yall could hear the beat on that kay slay freestyle. It was soundin good in my headphones! @AlLindstrom thanks again man I know its still early, but that was hands down the most fun I had on the air. Thanks to @angelayee All my Sirius listeners, tune in a few minutes to catch me on Angela Yee Tune into Kay Slay on Sirius Satelite radio tonight. 8 o'clock. I'll be on Exhausted. Good night Good mornin world. I'm still in the studio. @KOforPrez studio right now. If you in the city stop by @KOforPrez kev what's up brotha! Heard you back up top soon @i_want_the_sky ahh, it was fun for like a summer stretch @mrjeffdess lol what happened? #remember Mars 2112. Damn those were some good days. @Meddafore will do! @Morality_Bites promise you I'm not performing. I will try to attend to show love to rosenberg, but I'm not performing @PrinceBenard thanks a lot Tonight will be an incredible night in the studio @omen hoopin But then a young Chuck Norris showed up. And all hope was lost. http://mypict.me/9VIK @MrMoto2nyce yooo what's good Even the kids know what's up. WARM UP http://mypict.me/9VDH LOL. Naw dawg RT @BongBongCrew: @JColeNC was you a sports management major lol @yaboytez19 thanks a lot Yes I did. 3.82 RT @lolitzdo: @JColeNC aye quick question to ya.. did you really graduate magna cum laude haha? @cartierbenjamin thanks dawg, I got ya new tape late last night, ima put it in today and ride out. Still at studio. This is about the time I look at my watch and realize I won't beat the sun home. Thanks homey @rosenbergradio much appreciated Ok, shout to all yall. Thanks for the love. Thanks to all my SJU family and my Queens niggas. Biggest shout to the Ville we made it to HOT97 Ay tell me is stalkin if I follow like all the way home without her knowin? Whoa.. Grown Simba on Hot97 @uhreecuh but I can try! Hahha Tune in now to Hot 97, let's get ready Rich Boy got a new mixtape. Oh shit. If you aint know, I'm a fan. Somebody tell em I said what up @ReshoniaPorter naww the rapper not the producer @uhreecuh lol you know tryin to step it up Everybody follow and say what's up to @omen We in the studio! Maybe we try the live video stream Oh yea.. Hot97 tonight around 1an. Real Late with Rosenberg, tune in to catch my interview @omen my shit broke, I can't even open up bbm. Studio tonight @elitethatsme Shout out to all my people with college degrees and part time jobs! Trust me I know! #recessiongotem Somethin don't feel right about having no Vibe Magazine  #recessiongotem Babyphat RIP. Damn, how I'm sposed to sing \"In Those Jeans\" the same way.. #recessiongotem \"I had dreams of the league, one day I'd play kobe.. Or walk up to puff and he'll really know me\" Hahahaha RT @cyclone777: @JColeNC Lmao. That's what's up. I got a book i startd in the 5th grade and never finished. Im gona get my son  ... @CedBreeze I never know which number my nig Shout out to all my people that start books but never finish. Shout out to all my 59th street bridge people.. Yall know what I'm talkin bout, the toll dodgers You know you been to a club too many times when you feel like you got your own spot in that bitch @elitaste didn't know that. Damnn. @Morality_Bites naw will not be performing that night @DCtoBC hahaaa hoodrat things. throwback. Whatever happened to my nigga Latarian @melaniefiona ! What's goood @misskingjo aw shiiit @elitethatsme yo I met diddy last night homey I wanna gamble! Lol @sdotmcclung no, thank you for listening :) @gibs0ngotapoint wow, that's big! Thank you very much 8 am. Just got home. Sleep for a few hours then its time to work. @Diarm same to you brotha First night ever gambling. Blew some money early but fought my way back! @alexisbelon not used to 90 pages of friend requests. Tried to do as many as I could. At Hov show.. Not embarrassed to pull my camera out"}