{"tweets": "RT @gilly381: Hey India, heading over with our Premier of Western Australia @MarkMcGowanMP next week. His first trip to your fascinating la… RT @cricbuzz: India vs Bangladesh rivalry has grown with every on-field encounter. When the Asian neighbours face-off, there is never a dul… RT @BloodDonorsIn: #Kurnool\nNeed #Blood Type :  A-negative\nAt : Gowri gopal hospital\nNumber of Units : 3\nPrimary Number : 9703952011\nPatien… RT @BloodDonorsIn: #Jaipur\nNeed #Blood Type :  O-positive\nAt : SMS Hospital. \nNumber of Units : 3\nPrimary Number : 9610124576\nSecondary Num… RT @BloodDonorsIn: #Jaipur\nNeed #Blood Type :  AB-positive\nAt : SMS Hospital. \nNumber of Units : 3\nPrimary Number : 7733955657\nVia: @Pedal_… RT @BloodDonorsIn: #Faridabad\nNeed #Blood Type :  B-positive\nAt : Asian Institute of Medical \nNumber of Units : 3\nPrimary Number : 98110896… RT @chinmaybhogle: Lol https://t.co/Y814Qixvah RT @vikramsathaye: Diwali with my 98 year old Grandfather who cracks a joke a minute and constantly reminds us that you don’t need anything… Congratulations Papua New Guinea. So happy for you. May you continue to bring your flavour and sense of fun to our game. #T20WorldCup RT @BloodDonorsIn: #Kurnool\nNeed #Blood Type :  O-negative\nAt : Vishwabharti hospital\nNumber of Units : 3\nPrimary Number : 9440291091\nPatie… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  AB-positive\nAt : Andhra Hospital,Gollapudi\nNumber of Units : 2\nPrimary Number : 95817744… RT @BloodDonorsIn: #Dehradun\nNeed #Blood Type :  O-positive\nAt : Max Hospital \nNumber of Units : 2\nPrimary Number : 8171019293\nVia: @ankit_… RT @BloodDonorsIn: #Gorakhpur\nNeed #Blood Type :  Any group\nAt : Gorakhnath Hospital. \nNumber of Units : 1\nPrimary Number : 7905577304\nPati… RT @BloodDonorsIn: #Coimbatore\nNeed #Blood Type :  B-positive\nAt : Abinand Hospital Sundarapuram\nNumber of Units : 2\nPrimary Number : 96591… RT @BloodDonorsIn: #Ahmedabad\nNeed #Blood Type :  Any group\nAt : CIMS Hospital\nNumber of Units : 10\nPrimary Number : 9909944054\nPatient : K… RT @BloodDonorsIn: #Patna\nNeed #Blood Type :  A-positive\nAt : Sanjeevani hospital\nBlood Component : Platelets \nNumber of Units : 2\nPrimary… RT @bizpunditz: Wishing all our speakers, viewers &amp; clients a very happy &amp; prosperous Diwali!\nFor corporate access to the #Bizpunditz video… RT @AkbaruddinIndia: For those asking for more...\n\nHere’s another glimpse of r vibrant #Diwali celebrations that so many young friends @UN… RT @BloodDonorsIn: #Visakhapatnam\nNeed #Blood Type :  Bombay blood\nAt : KG Hospital. \nNumber of Units : 2\nPrimary Number : 8341089294\nPatie… RT @BloodDonorsIn: #Ghaziabad\nNeed #Blood Type :  B-positive\nAt : Max Hospital, Vaishali\nBlood Component : Platelets \nNumber of Units : 2\nP… Clearly Brexit has had no effect on how England play sport!! England are dominating though https://t.co/MVaEz5nqyR England and New Zealand face off again in a World Cup match. And England have just been denied a try by a replay!! #AllBlacks. #RugbyWorldCup19 RT @chhuti_is: Jalebi or Jilapi is derived from the Arabic word zulabiya or the Persian zoulbiya. It was brought to Medieval India by Persi… Quietly, another batting star has arrived from the wonderful batting factory in Karnataka. Looking forward to seeing more of Devdutt Padikkal. RT @BloodDonorsIn: #Mathura\nNeed #Blood Type :  B-positive\nAt : Nayati Hospital\nNumber of Units : 3\nPrimary Number : 9759457727\nPatient : A… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  A-positive\nAt : Rainbow Hospital. \nNumber of Units : 2\nPrimary Number : 8639895313\nVia:… RT @BloodDonorsIn: #Bhopal\nNeed #Blood Type :  B-positive\nAt : Red Cross Bhopal \nPrimary Number : 7987527122\nVia: @IAmSaurabhSoni\n#BloodMat… RT @BloodDonorsIn: #Durgapur \nNeed #Blood Type :  A-positive\nAt : Vivekanand Hospital\nNumber of Units : 2\nPrimary Number : 7004223648\nPatie… RT @BloodDonorsIn: #Bhubaneswar\nNeed #Blood Type :  AB-negative\nAt : Apollo Hospital Bhubaneswar\nNumber of Units : 3\nPrimary Number : 93489… RT @BloodDonorsIn: #Ranchi\nNeed #Blood Type :  Any group\nAt : Gurunanak Hospital and Research center, Station Road, Ranchi, #Jharkhand\nBloo… RT @vijayshekhar: Wow! What a story!\nThis is what I call, sincere &amp; hard working. https://t.co/3GIgdLnDJA Beautiful. You are right. This is twitter too. https://t.co/n7nDRHSZqw Shubh Deepawali. May this festival of lights cast a warm glow over our lives. May it be full of festivity and happiness. RT @narendramodi: Lovely video.\n\nWhen my good friend and the PM of Australia @ScottMorrisonMP personally invites, I am sure many more touri… RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  B-negative\nAt : SGPGI Hos[ital. \nBlood Component : Platelets \nNumber of Units : 5\nPrimary N… RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  B-positive\nAt : SGPGI Hospital. \nBlood Component : Platelets \nNumber of Units : 1\nPrimary N… RT @vijaylokapally: This was an absolute delight and must thank Mr. Gavaskar for sparing precious time 👇\nSunil Gavaskar: I would’ve been a… How cool that the Prime Minister @ScottMorrisonMP comes out with the drinks at the Prime Minister's XI game in Canberra https://t.co/tZzobUqivr RT @BloodDonorsIn: #Moradabad\nNeed #Blood Type :  O-positive\nAt : Cosmos Hospital\nNumber of Units : 1\nPrimary Number : 9756823991\nVia: @aka… RT @BloodDonorsIn: #Rudrapur\nNeed #Blood Type :  AB-positive\nAt : Agrasen Hospital\nNumber of Units : 8\nPrimary Number : 9720683456\nSecondar… RT @KEC_Intl: Thank you @BhogleHarsha and @BhogleAnita for an engaging session on teamwork and leadership at the #RPGAnnualConference2019.… RT @BhogleAnita: Thank you, #RPG. We enjoyed bringing @TheWinningWay_ to you. https://t.co/wBzONZ8yWH Hard on Shahbaz Nadeem but he was brought in as a replacement. He has done what good players do; has shown his value and will be easier to pick the next time. Happy to see @IamSanjuSamson rewarded for his recent run of scores. Two of Samson, Rahul, Shreyas and Manish Pandey will probably play and it is good that they all have runs behind them. Looking forward to reading this. One of my prime areas of interest. Backed by a lot of research. A revolution that India has been at the centre of. @timwig @fwildecricket. Hope it does well. https://t.co/Gbmt3k22vD When the world was younger. And people were a bit chubbier. We had invited virat.kohli as the \"young executive\" towards whom our book The Winning Way was aimed. He released the book along with Gautam Gambhir who was… https://t.co/ZNeXy84jP1 RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  Any group\nAt : Nagarjuna Hospital. \nNumber of Units : 3\nPrimary Number : 9959676048\nSeco… RT @BloodDonorsIn: #Virudhunagar\nNeed #Blood Type :  AB-negative\nAt : Virudhunagar Government Hospital        \nBlood Component : Blood\nNumb… RT @BloodDonorsIn: #Patna \nNeed #Blood Type :  Any group\nAt : Patna Medical College\nNumber of Units : 3\nPrimary Number : 9334107593\nVia: @V… RT @SGanguly99: It’s a great honour https://t.co/jCpmem80GT RT @BloodDonorsIn: #Madurai\nNeed #Blood Type :  O-positive\nAt : Meenakshi Mission Hospital\nNumber of Units : 10\nPrimary Number : 9786477755… @DigitallyBones @NokiamobileIN That is true. I have a later version but this works absolutely fine @DigitallyBones @NokiamobileIN Err, thanks, but it is a Nokia 8! RT @BloodDonorsIn: #Jodhpur\nNeed #Blood Type :  B-positive\nAt : Paras blood bank\nNumber of Units : 2\nPrimary Number : 6375460048\nSecondary… Thanks to some of you for pointing it out. And @mayankcricket too. Nice https://t.co/maBlRJtpF2 So @ashwinravi99 makes the dash back from Ranchi to Bengaluru to play the Vijay Hazare semi-final for Tamil Nadu. Nice. RT @bizpunditz: One of India's most successful #Entrepreneurs &amp; \n@makemytrip founder, Deep Kalra\non why #hiring the right candidate is extr… RT @cricbuzz: With #TeamIndia completing a 3-0 whitewash over South Africa at #Ranchi, #Kohli's men extended their Test dominance. Watch as… RT @cricbuzz: With #TeamIndia sweeping the series 3-0 at #Ranchi, @bhogleharsha talks about the resurgence of India's pace battery and reck… RT @cricbuzz: Is #ViratKohli's team India the most complete cricketing side in the world? @7polly7 thinks so as he discusses India's histor… @colinbryden1 @hemantbuch @anandvasu Hi Colin, good to hear from you. Yes, the toss would have helped but I hadn't expected such margins of victory @ETPanache @IndraNooyi Quick one guys. The player mentioned in the article should be Deepti Sharma. RT @cricbuzz: Here's @bhogleharsha with highlights of the most memorable moments from India's record-breaking series win against South Afri… There is no doubt that this is a fantastic team and yes, it covers all bases. But comparing across eras is impossible because performances are also a function of the opposition and this is easily the poorest that test cricket is since I started covering it. https://t.co/uB8B7cHU3Q RT @bizpunditz: How has making notes helped \n@ajinkyarahane88\n perform better on the field? Watch him on Bizpunditz! For corporate access t… RT @BloodDonorsIn: #Varanasi\nNeed #Blood Type :  Any group\nAt : Divedi Hospital. \nNumber of Units : 1\nPrimary Number : 9450617401\nVia: @nee… RT @BloodDonorsIn: #Rudrapur\nNeed #Blood Type :  O-positive\nAt : Narayana Hospital\nNumber of Units : 3\nPrimary Number : 9675112555\nSecondar… RT @BloodDonorsIn: #Jodhpur\nNeed #Blood Type :  AB-positive\nAt : Raj Dadi Hospital\nNumber of Units : 3\nPrimary Number : 9252422887\nSecondar… @iam_juhi Yes Juhi, our Diwali is also a festival of lights, not sound. The most encouraging thing for India is that the wickets have been shared between the quicks and the spinners. It means there is always a wicket-taking bowler that the captain to turn to There is a lot of talk around the world about pitches in India. It is time to bury that because the last few wins have all come on normal pitches. Here in Ranchi, Saha collected a ball over his head on the 4th morning! A great catch and a bizarre dismissal this morning. But it took only 9 mins and 2 overs to produce India's biggest win over South Africa India's win today will make it 26 wins out of 32 matches played at home. Of these 26 wins, the closest has been 6 wickets or 75 runs. Now that is a story of home domination. @mohanstatsman RT @cricbuzz: Virat Kohli &amp; Co. are on the verge of taking India to their first Test series whitewash against South Africa. Watch @bhogleha… RT @timwig: The value of mystery spin; the democratising impact of the shorter formats; local knowledge; sporting aims winning out over com… Everyone in the advertising world, including a marginal presence like me, is in mourning at the passing of the much loved Conrad Saldanha of Rediffusion. He was a friend, mentor and father-figure to so many, was universally liked and was, just simply, a good kind man. RT @BloodDonorsIn: #Agra\nNeed #Blood Type :  AB-positive\nAt : Pushpanjali Hospital. \nBlood Component : Platelets \nNumber of Units : 2\nPrima… RT @BloodDonorsIn: #Jaipur\nNeed #Blood Type :  O-negative\nAt : Rukmani Birla Hospital CK Birla\nBlood Component : Platelets\nNumber of Units… RT @BloodDonorsIn: #Coimbatore\nNeed #Blood Type :  O-positive\nAt : Kuppusamy Naidu Hospital.\nPrimary Number : 9486836969\nIllness : Open hea… RT @BloodDonorsIn: #Vizag\nNeed #Blood Type :  A-negative\nAt : Apollo Hospital, Arilova\nNumber of Units : 2\nPrimary Number : 9515781235\nSeco… And well done @chqbook. Look forward to more https://t.co/3fW5j7yjg1 Difference in pronunciation! https://t.co/rLrjUGJE0V Who would have thought when the teams were announced on Saturday that de Bruyn would be batting and Pant would be behind the stumps! De Bruyn confirmed as a concussion sub https://t.co/kjp5Cid81x Dane Piedt in now. There is a protocol to be followed for the naming of a concussion substitute. Once that is done de Bruyn will probably bat. Gets worse for South Africa. Elgar can't resume his innings so it is Klassen and Linde already. Maybe it is effectively 26-5 but more important, hope Elgar recovers soon. For someone who has admired South African cricket greatly, this is inexplicable. I know there are many issues but none that can explain this capitulation South Africa's best batting phase. The 9th wicket is the most productive partnership and the ball, after 45 overs, is softer There is no perceptible change in Jadeja's release between the one that turns and the other that goes straight through. That is why he is such a threat on a turning track. The Hamza and Klaasen dismissals were vintage spin bowling. So much opportunity around. A debutant bowling to two others! RT @cricbuzz: After a record-breaking double ton from #RohitSharma, South Africa face yet another colossal Indian score. Can Faf and Co. pr… RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  A-negative\nAt : SGPGI Hospital. \nBlood Component : Platelets \nNumber of Units : 3\nPrimary N… RT @cricbuzz: Rohit Sharma's 200 leaves @bhogleharsha and @7polly7 mighty impressed as they heap praises on the Indian opener and revise Da… Incredible how these things happen in sport. How can a team playing at this pace against the champions of Europe be so far down the table!! #MUNLIV RT @BloodDonorsIn: #Ahmedabad\nNeed #Blood Type :  O-positive\nAt : UN Mehta Hospital. \nNumber of Units : 4\nPrimary Number : 7999332794\nVia:… Better day at rugby then @7polly7 @mmbangwa @GraemeSmith49 Raining hard now. Formally called off for the day. The stumps had been taken off earlier to put the covers on And now, with the last ball before the quicks are taken off for light, another snorter from Yadav. India's quicks have wasted no time in getting into top gear https://t.co/AFQlcM28i5 Shami has absolutely steamed in amidst the gloomy weather in Ranchi RT @cricbuzz: Here's wishing the inimitable @virendersehwag a very happy birthday. Good time to revisit @bhogleharsha's thoughts on what ma… Been so much fun watching this career defining double century from Rohit Sharma. Hopefully more on the way 133 in the session. 39-3 seems so so far away for South Africa. India have grabbed this match in this session. Brilliant batting @girishkuber Thank you. I enjoyed being there Thanks but I do hope your other mornings are more productive! https://t.co/w9IMy9YXja Love the way Rohit Sharma is changing gears while batting. A birthday special for @virendersehwag! Happy Birthday to the man who speaks like he batted! And therefore continues to entertain. @virendersehwag Very fluent century from @ajinkyarahane88. Made batting look easy. Good to see. The innings of an assured player RT @cricbuzz: India are on the verge of posting yet another colossal first innings score, will Faf and Co. put the brakes on Rohit’s run-sc… RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  O-positive\nAt : Apollo Hospital. \nNumber of Units : 03\nPrimary Number : 9936063777\nPatient… RT @cricbuzz: \"Spinners' inability to step up in India has hurt South Africa badly\" reckons @7polly7 on #CricbuzzChatter with @bhogleharsha… @PurneshGupta And how is that? @twinsighter @Venkrek Haha, long time since I heard addi maar guddi dabba RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  Any group\nAt : Ford Hospital, Gomti Nagar\nNumber of Units : 3\nPrimary Number : 98893 40251… I won't be surprised if it rains in January too......The weather this year has been insane It is raining now and very dark. Will be surprised if we get more play today. Eased https://t.co/XVeA9e3HN6 South Africa's optimism has been severely dented by this extremely classy display of batsmanship from Rohit and Rahane. Been wonderful to watch. You hardly use the word \"grafted\" for Rohit Sharma but that is exactly what he has done here. A hard working man's fifty RT @BloodDonorsIn: #Shillong, #Meghalaya\nNeed #Blood Type :  B-positive\nAt : Woodland Hospital, Dhankheti, Malki\nNumber of Units : 5\nPrimar… RT @Murtuza1812: Please help find this boy.\n\nContact:\n\nVibha:9820229841\n\nBehroze : 9930837793\n\n@bhogleharsha https://t.co/sN9LHI9B8W RT @BloodDonorsIn: #Patna\nNeed #Blood Type :  O-negative\nAt : Ruban Hospital. \nBlood Component : Platelets \nNumber of Units : 2\nPrimary Num… Terrific opening spell from Kagiso Rabada. One of the best in the world and he showed us why. And so it doesn't matter who calls! A different person doesn't stand a better chance of winning the toss. https://t.co/26CXYzGOsW Wow, five changes for South Africa. What does it tell you about the state of mind in the team! Yes, two of those were forced but there are three other changes! It tells you a thing or two that a captain feels the need to take someone over to call. But irrespective of who calls, the chance of winning it is 1 in 2!! The perception is that we might have our first turner of the series. And so a debut for Shahbaz Nadeem. Reward for consistent performances for India A Onwards to Ranchi. Hopefully a good game awaits us. Nice. Can avid cricket followers find more reasons for the spike and drop in run-rates in test cricket?\n\nhttps://t.co/6aJd3FdsOv Maybe captaincy wasn't his cup of tea but I always rated Sarfaraz as a cricketer. Huge pressure now on Babar Azam, already the best batsman, now captain too in limited overs cricket. RT @upGrad_edu: \"... you cannot complain today that there are no opportunities, you have no idea, what not having an opportunity is.\" says… RT @chqbook: Backups are crucial. Not just in cricket but also in life. Not having the right kind of backup for a rainy day might prove cos… RT @BloodDonorsIn: #Visakhapatnam\nNeed #Blood Type :  A-positive\nAt : Pinnacle Hospital\nNumber of Units : 3\nPrimary Number : 7799622274\nVia… Really enjoying being part of this @TourismAus campaign with @shibanidandekar. There are two World T20 tournaments there next year; a very good time to enjoy the sights and the food. @Australia https://t.co/pvhUtoTVKf A very happy birthday to @anilkumble1074, a player I have enjoyed watching, a giant of a person and a great Indian. Great player, top man. @vishy64theking. I'm going to be reading this. https://t.co/U1WLRHhwlZ RT @BloodDonorsIn: #Karimnagar\nNeed #Blood Type :  A-negative\nAt : Chelmeda Ananda Rao Hospital\nNumber of Units : 3\nPrimary Number : 798977… RT @BloodDonorsIn: #Visakhapatnam\nNeed #Blood Type :  B-positive\nAt : Venkateswara Nursing Home Narsipatnam\nNumber of Units : 2\nPrimary Num… RT @BloodDonorsIn: #Patna\nNeed #Blood Type :  AB-positive\nAt : National blood bank &amp; Research center,Kankarbagh \nNumber of Units : 2\nPrimar… RT @cricbuzz: 'Wriddhiman Saha gives a sense of assurance to Ashwin-Jadeja,' reckons @bhogleharsha as he profiles Saha's journey through th… RT @BloodDonorsIn: #Dehradun\nNeed #Blood Type :  Any group\nAt : Jolly Grant Hospital. \nNumber of Units : 6\nPrimary Number : 9911172979\nPati… RT @BloodDonorsIn: #Jalandhar\nNeed #Blood Type :  A-positive\nAt : Civil Hospital. \nNumber of Units : 3\nPrimary Number : 09872663489\nVia: @m… RT @BloodDonorsIn: #Coimbatore\nNeed #Blood Type :  O-positive\nAt : Ramakrishna hospital\nNumber of Units : 3\nPrimary Number : 8637427749\nSec… RT @cricbuzz: Here's wishing one of India's greatest champions, @anilkumble1074, a very happy birthday! \n\nWatch @bhogleharsha profile this… @prempanicker @NorthStandGang @joybhattacharj @sachin_rt @rameshsrivats @VVSLaxman281 @gauravkapur @gauravkalra75 @TNCACricket @wvraman No, no guys. It has to Prem Sir. Respect for elders, after all! RT @cricbuzz: With former India captain #SouravGanguly all set to take charge of the #BCCI, Voice of Cricket @bhogleharsha explains why he… It is quite a story! You must read it https://t.co/jLSTZECym8 Very disturbed by what is happening in the banking system. A bank stands for trust and safety. We cannot allow unscrupulous businessmen to take away money and let simple depositors lose theirs. Surely we must return their money because it has been stolen, not lost. A very happy birthday to @PrannoyRoyNDTV. A pioneer, dignified and stylish on air. RT @BloodDonorsIn: #Jalandhar, #Punjab\nNeed #Blood Type :  A-positive\nAt : Capitol Hospital, Jalandhar - Pathankot Road Near Reru chowk\nNum… RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  A-positive\nAt : Midland Hospital. \nNumber of Units : 03\nPrimary Number : 8953334118\nVia: @P… Will always remain a great fan of Tiger Pataudi. Great man. https://t.co/CtJaW7KKTw Was a great surface to bat on but that was still a stupendous effort https://t.co/uJso4nx1hK Had obviously heard of Yashasvi Jaiswal. But will be following his progress now. A List 'A' double century is a serious effort! Fun doing this campaign for @australia tourismaus. Looking forward to the #T20WorldCup for women in Feb/March https://t.co/DdEwyi7ra4 RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  O-positive\nAt : Apex Hospital\nBlood Component : Platelets \nNumber of Units : 3\nPrimary Numb… RT @BloodDonorsIn: #Vizag\nNeed #Blood Type :  B-positive\nAt : Apollo Hospital, Arilova\nNumber of Units : 2\nPrimary Number : 9493944020\nSeco… RT @BloodDonorsIn: #Mohali\nNeed #Blood Type :  Any group\nAt : Fortis Hospital. \nNumber of Units : 03\nPrimary Number : 9810214836\nVia: @Pras… RT @BloodDonorsIn: #Kakinada\nNeed #Blood Type :  B-negative\nAt : Surya Global Hospital\nNumber of Units : 3\nPrimary Number : 83318 62728\nVia… RT @StanChartIN: Harsha Bhogle in the house! As a part of the Learning week at #StandardChartered, @bhogleharsha engaged our employees in a… RT @BloodDonorsIn: #Chandigarh\nNeed #Blood Type :  A-positive\nAt : PGI Chandigarh\nNumber of Units : 3\nPrimary Number : 9459782257\nSecondary… RT @BloodDonorsIn: #Kanpur, #UttarPradesh\nNeed #Blood Type :  A-positive\nAt : Regency Hospital, Govind Nagar\nBlood Component : Platelets \nN… RT @joybhattacharj: HSBC Bank may have many famous CEOs and managers, but their most famous alumnus was a man who created characters like P… I would prefer that in a subsequent super over, the players involved in the previous one aren't available. So the boundary count rule is scrapped in favour of multiple super overs. There will be much celebration. I think the right decision has been made though the probability of what happened at the World Cup must have been almost impossibly low. @iamvidzy Lovely. Thanks The stadiums are much better looking, pitches and outfields are much better too, now to make viewing at the ground much easier within the requirements of security. Aside from cricket, it is very important that our stadiums respect fans &amp; make their visit to the stadium as pleasant as possible. Otherwise,they will just stop coming. The Indian cricket fan is the life of our sport,without him/her,we are nothing. RT @cricbuzz: ICYMI: \"History may record India's winning streak as wow-worthy,\" said @bhogleharsha after India completed their 11th success… I genuinely believe, and have often said so, that @SGanguly99 is the right man to take Indian cricket forward. I wish he had longer than ten months though. RT @BloodDonorsIn: #Jaunpur \nNeed #Blood Type :  B-positive\nAt : Civil Hospital\nNumber of Units : 3\nPrimary Number : 6387855176\nVia: @blood… RT @BloodDonorsIn: #Bhubaneswar, #Odisha\nNeed #Blood Type :  AB-positive\nAt : Apollo Hospital, Gajapati Nagar\nNumber of Units : 3\nPrimary N… RT @BloodDonorsIn: #Guwahati, #Assam\nNeed #Blood Type :  B-positive\nAt : GMC Cancer Hospital, Birubari\nNumber of Units : 2\nPrimary Number :… RT @BloodDonorsIn: #Ludhiana\nNeed #Blood Type :  A-positive\nAt : Dayanand Medical College (DMC) Hospital, Tagore Nagar, Ludhiana, #Punjab\nB… A very happy birthday to @GautamGambhir. Look forward to your innings in politics being as hardworking and effective as your first one Have seen you take many from a distance, never from so close! https://t.co/SUuqsttCp4 Hard to see something nicer than this today https://t.co/Tde2IG5KCj @PradeepHardikar They were there for the stars and I happened to be walking by! We will meet another day. RT @AkbaruddinIndia: It's that time of the year, when...\nFall Foliage starts to stun... 🙏🏽 https://t.co/G0sMbACDWM RT @cricbuzz: India created history in Pune as #Kohli and Co defeated South Africa to surpass Australia for the most consecutive Test serie… RT @BloodDonorsIn: #Visakhapatnam\nNeed #Blood Type :  B-negative\nAt : Simhadri Hospital\nBlood Component : Platelets \nNumber of Units : 2\nPr… RT @BloodDonorsIn: #Buxar\nNeed #Blood Type :  AB-negative\nAt : Arvind Seva Sadan.\nNumber of Units : 2\nPrimary Number : 9386078070\nPatient :… RT @BloodDonorsIn: #Kakinada\nNeed #Blood Type :  B-positive\nAt : Siddartha hospital \nNumber of Units : 2\nPrimary Number : 9908806660\nPatien… RT @Birmo: Major campaign launched today ahead of the @ICCT20WC_Live next year to get more Indian tourists to our shores exploring our regi… @KP24 Still remember Mumbai 2012! RT @cricbuzz: India record their 11th consecutive series win at home after a thumping victory against South Africa at Pune. @bhogleharsha a… @FullFaceOfBat Yes indeed Thank you very much #LoksattaGappa for having me. Kharokhar ranglya gappa! Met so many interesting people. Excellent idea. @girishkuber https://t.co/7wE5xwT4rf Wah, Punekar, masta match zhali, paus suddha match samplya nantar aala! Khoop maja aali. Parat bhetuya. A world record 11 successive series wins at home for India. Shows you why playing away in India is one of the toughest assignments going. Meanwhile some pretty threatening clouds have gathered over the stadium........ By the manner in which Agarwal and Pujara batted, and then Kohli and Rahane, India were able to justify their decision of going in with five bowlers and playing a batsman short.. Each of those five pitched in. And then, Saha was magnificent. This is a quality Indian team. India's biggest win over South Africa. Been better at all aspects. And the series has been won, not on minefields, but on perfectly good tracks. This one in Pune was excellent. @hershybru Haha! You scored too many against India so was good to bring that up! Over the years, I have had enormous admiration for South Africa as a cricketing nation. And as India's toughest opponent, whether home or way. These performances will take some time to come to terms with. India's bowlers have been very well supported behind the stumps. Two beauties from Saha and now a wonderful slip catch from Rahane. No, Sagar, we were pointing out how difficult it is for the non-striker and how hard it is on him. https://t.co/UzMGCnGOOq Absolutely brilliant new ball bowling from India this morning. And @Wriddhipops, you are a rock star. India have taken the more positive approach this morning by enforcing the follow-on. The bowlers are rested and the quicks haven't bowled all that much. RT @cricbuzz: #Maharaj and Philander have given hope to #Proteas but are still miles behind India in this game. Will Kohli &amp; Co. finish thi… @aparanjape @neeran @vikramsathaye @Girbane @BhogleAnita @paritoshZero @narayan140 People speak such beautiful Marathi. I wish I could too. But I have had a peculiar upbringing. Studied and spoke Telugu and Hindi at school (and friends at college), Marathi at home (but never studied it) and Hyderabadi at other times. I am still trying to get better Lead 326. I think India will bat a session and a bit and leave South Africa with about 450 to get India have done remarkably well to take a lot of wickets before this ball goes soft. At the 45 over point, India have taken 4, 8 and 7 wickets. Expect this new ball to have an impact. Congratulations @IamSanjuSamson. A double century in a List A game is a special achievement. Look forward to more @mandarchakradeo @FullFaceOfBat Yes! Will have one soon! @SGovitrikar Thank you Sahil. Cheers @Venky15581459 Hi Venky. No I hadn't. Thank you very much for this. Much appreciated. @shahaayush_33 Thanks Aayush. Cheers. There is always a story to be told in a day's play RT @cricbuzz: 'I saw keenness in Virat Kohli’s eyes to get a big one,' feels @7polly7 as he discusses an eventful day's play between India… RT @cricbuzz: 'Plug Virat Kohli in and you'll never have power shortage in India,' reckons @bhogleharsha as he showers praises on #KingKohl… Misery compounded for South Africa. Quality quick bowling from Yadav and Shami but also tired minds and bodies dragging a bat out Pity about Jadeja's century but this is the right time to declare. More than enough runs on the board and 16 overs to bowl at an exhausted South African team. The landmarks flow for Virat Kohli. Like a champion batsman he breaks a 10 innings century drought with a double. And, something that is becoming noteworthy for him, without a single six! Most doubles by an Indian now and the small matter of 7000 test runs. From time to time, I get blood donation requests directly. Please do send them to @BloodDonorsIn since they are better equipped to act on them and therefore provide speedier support Been a joy as always to see Kohli's straight drives. RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  Any group\nAt : KJMU Hospital. \nNumber of Units : 01\nPrimary Number : 7408889009\nVia: @vik0a… RT @BloodDonorsIn: #East Godhavari \nNeed #Blood Type :  A-positive\nAt : Apparao gari Hospital\nNumber of Units : 2\nPrimary Number : 94914411… RT @BloodDonorsIn: #Bhubaneswar, #Odisha\nNeed #Blood Type :  O-negative\nAt : Care Hospital. \nNumber of Units : 2\nPrimary Number : 953892448… RT @chqbook: Big tournaments are won with solid planning and the right players. Similarly, in life you need to plan for your #goals and mak… @gawalivinit @mohanrajselva What!!!! @shreyasbecker @JohnIsner Now how would you know that! Another industry leader and businessman (former?) arrested for fraud and economic offences. Time to start celebrating those that are building businesses legitimately and creating an environment where the honest and the hardworking can thrive. Loved playing scrabble as a kid. Maybe I need to revisit it too! https://t.co/o0wl3tczLh Over 250 word whizzes from 30 countries at #WESPAC #Goa, the championship of championships for Scrabble players.15-20 Oct,Peddem Indoor Sports Stadium,Mapusa. If you enjoy Scrabble,are in Goa,go over, watch the pros &amp; play a game alongside the world's best. #scrabble #wespacgoa https://t.co/hFHl5qysYN @ajaydhilip_g Do listen carefully. Vizag on the coast, Pune is about 150 kms in. Not from Vizag, from the sea!! RT @Polaris_Books: OUT NOW!!\n\nCRICKET 2.0 by the brilliant @timwig &amp; @fwildecricket is the extraordinary story of Twenty20, featuring inter… RT @cricbuzz: India's batsmen had yet another stellar day with #MayankAgarwal scoring a century and #CheteshwarPujara and #ViratKohli scori… @DerChaitanya @BCCI The important part in that was what Mayank said! A huge thumbs up to @M_Raj03 for a magnificent, inspiring career. 20 years in odi cricket and going strong. @cricketcouch @BillSimmons @ajarrodkimber @norcrosscricket Thanks Subash. It is part love and part survival. Keep going. Good to chat with a bright, hard working young man. #MayankAgarwal. https://t.co/GZPm11T8ou RT @BloodDonorsIn: #Kakinada\nNeed #Blood Type :  A-positive\nAt : Government General Hospital\nNumber of Units : 2\nPrimary Number : 944175458… Learning can come from anywhere. https://t.co/7wMk6V86qC Proper test match batting from Mayank Agarwal. The transformation from white ball slasher to red ball accumulator continues. On a morning where the ball was doing a fair bit, it was still India's session. And South Africa will be disappointed by what the scoreboard is saying. @shishhattangadi @sardesairajdeep @PrannoyRoyNDTV @Raghav_Bahl @aroonpurie Like this morning on a Pune pitch that sported a different look! Four drives from Mayank Agarwal against Nortje. Worth driving all the way from Mumbai just to see those. Excellent bowling from South Africa on a track they would be overjoyed to see. Nice challenge for Rohit Sharma and Mayank Agarwal Faf loses another toss (his 9th in a row in Asia) but India will need to watch for the first hour or so with the grass on the surface. Very hard on Hanuma Vihari but no 6 is always a tricky position in Indian conditions. Feel for him. This is a second astonishing away result for Sri Lanka in 2019. That series win in South Africa and now this T20 series win in Pakistan with such a depleted side. RT @BloodDonorsIn: #Raipur\nNeed #Blood Type :  A-positive\nAt :  Bilasa Blood Bank\nBlood Component : Blood\nNumber of Units : 2\nPrimary Numbe… RT @BloodDonorsIn: #Vizag\nNeed #Blood Type :  Any group\nAt : KG Hospital\nNumber of Units : 02\nPrimary Number : 9676074143\nSecondary Number… RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  AB-positive\nAt : PGI Hospital\nBlood Component : Platelets \nNumber of Units : 1\nPrimary Numb… RT @BloodDonorsIn: #Jaipur\nNeed #Blood Type :  Any group\nAt : Bhagwan Mahaveer Cancer Hospital\nNumber of Units : 2\nPrimary Number : 9928061… And we are going to hear a lot more of Wanindu Hasaranga. https://t.co/EsC2oQ3Vx2 Really enjoyed watching Oshada Fernando bat today. @IAmNixz @LaxmanSivarama1 @kartikmurali Thanks @sidster_95 @poojayach0312 I hope you grew more ambitious! RT @cricbuzz: #MayankAgarwal scored his maiden Test hundred in Vizag to continue the dream start to his Test career. Watch @bhogleharsha ta… RT @aparanjape: #Pune's famous 'Huzurpaga Girls High School' completes 135 years today. It was established on Oct 2, 1884 by  Vaman Modak,… Now @amlahash is set to become a Kolpak player. Wish him well and hopefully we can see a bit more of the mighty player and fine person. RT @LaureusSport: Sport has the power to change the world.\n\nThe power to inspire. To create hope where once there was only despair. \n\nIt is… @jainayush01 Hence, you would have noticed, the use of the word \"largely\" @chumandas @cricbuzz Thanks Chuman, hope you are well. On one of my WhatsApp groups there is a raging, and therefore ill-tempered, debate on religious beliefs and majoritarianism. I retreat into sport where the contest is, largely, about one player's skill against another, and so is independent of the ethnicity of the performers RT @BloodDonorsIn: #Khammam, Telangana\nNeed #Blood Type :  AB-positive\nAt : Pulse Hospital\nNumber of Units : 2\nPrimary Number : 6301854136… RT @BloodDonorsIn: #Kakinada\nNeed #Blood Type :  A-negative\nAt : Apollo hospital\nNumber of Units : 10\nPrimary Number : 9848922131\nPatient :… RT @BloodDonorsIn: #Patna\nNeed #Blood Type :  B-negative\nAt : PMC Hospital\nNumber of Units : 03\nPrimary Number : 6200917942\nVia: @apurvgour… Looking back at Visakhapatnam, looking ahead to Pune. https://t.co/L3iPuy5yJ6 @Ram_Guha Congratulations Ram. And wish  you much more. RT @BloodDonorsIn: #Kanpur, Uttar Pradesh\nNeed #Blood Type :  O-positive\nAt : Chandni Nursing Home, Arya Nagar Road, Khalasi Line\nNumber of… RT @BloodDonorsIn: #Vijayawada, Andhra Pradesh\nNeed #Blood Type :  B-negative\nAt : Aayush Hospital\nNumber of Units : 3\nPrimary Number : 630… RT @BloodDonorsIn: #Bhimavaram, Andhra Pradesh\nNeed #Blood Type :  B-positive\nAt : Gayathri Hospital\nNumber of Units : 2\nPrimary Number : 8… @joybhattacharj Not quite cricketers but how about Nixon Alexei (after Kosygin) McNamara McLean? And apparently, his sister is called Golda Meir Vijayadashmi chya sarvanna shubhechha. RT @BloodDonorsIn: #Visakhapatnam\nNeed #Blood Type :  B-positive\nAt : KG Hospital.\nNumber of Units : 2\nPrimary Number : 9949361903\nVia: @sh… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  AB-positive\nAt : Andhra hospital\nNumber of Units : 3\nPrimary Number : 9398071864\nSeconda… RT @BloodDonorsIn: #Khammam\nNeed #Blood Type :  Any group\nAt : C Star Hospital\nNumber of Units : 2\nPrimary Number : 9705528786\nVia: @Alibha… RT @BloodDonorsIn: #Kottayam\nNeed #Blood Type :  A-negative\nAt : Carithas hospital \nNumber of Units : 3\nPrimary Number : 9947225222\nVia: @O… Wishing everyone a very happy and festive Vijayadashmi. Now that is a sport! https://t.co/b6vNkXhAZI RT @BloodDonorsIn: #Guntur\nNeed #Blood Type :  O-negative\nAt : NRI Hospital ,Managalagiri\nNumber of Units : 3\nPrimary Number : 8639125448\nV… RT @BloodDonorsIn: #Warangal\nNeed #Blood Type :  A-positive\nAt : St Ann's Hospital, Kazipet\nBlood Component : Platelets \nNumber of Units :… RT @BloodDonorsIn: #Prayagraj, Uttar Pradesh\nNeed #Blood Type :  B-positive\nAt : Kamla Nehru Memorial Hospital, Tagore Town\nNumber of Units… RT @ImIshant: At the very start of my career, Zak pa told me something that has been with me till date. He said, ‘Fast bowling is 70 per ce… Absolutely! https://t.co/w1EP5c7ETO Always enjoyed watching @DJBravo47 play. Here's wishing him a big year, more laughter, more dance moves and some stirring performances. A very happy birthday to @ImZaheer. Champion bowler, fine mind, seriously cool. RT @BloodDonorsIn: #Mysore\nNeed #Blood Type :  O-negative\nAt : Brindavan Hospital \nNumber of Units : 3\nPrimary Number : 9880631514 \nSeconda… RT @BloodDonorsIn: #Srikakulam\nNeed #Blood Type :  Any group\nAt : Gems Hospital. \nNumber of Units : 3\nPrimary Number : 8885557880\nVia: @joy… RT @BloodDonorsIn: #Nagercoil\nNeed #Blood Type :  B-negative\nAt : Jeyasekaran Hospital\nNumber of Units : 3\nPrimary Number : 9487065411\nPati… @ClaytonMurzello @BishanBedi @wmakarand Ha! Now that you say so! Yes. @ClaytonMurzello @BishanBedi @wmakarand Khalid Ansari? SK Sham? Sundar Rajan? Correct? Others? RT @BloodDonorsIn: #Dehradun\nNeed #Blood Type :  O-negative\nAt : Max Super Speciality Hospital, Dehradun, Uttarakhand\nBlood Component : Blo… I notice that the response from cricketers to the Indian Cricketers Association has been rather lukewarm. Getting ready for another day. Yes, rhere have been many but each is important.... https://t.co/LGDLuyq9sV RT @BloodDonorsIn: #Saharanpur\nNeed #Blood Type :  A-positive\nAt : Mega City Hospital\nNumber of Units : 2\nPrimary Number : 9871051704\nPatie… @sidvee @the_kk And yet, for all that you know, if Bumrah was available, Shami would have missed out. @RusselArnold69 @alanwilkins22 @bazidkhan81 @RoshanCricket I would love to meet him one day too. @gunanath04 I may not use quite the same word but get what you are saying! Sorry to predict bad tidings! RT @cricbuzz: 'Rohit and Ashwin showed why they are giants of the game', said @bhogleharsha as the two champions stamped their authority in… RT @cricbuzz: As India clinched the opening Test riding on performances of Mohammed Shami and Ravindra Jadeja on Day 5. @bhogleharsha along… Visakhapatnam, dhanyavadaalu. Chaala nachindi. Kalluddam malli. Is that Yaman, he asked. He thought I was the Raga Man. \"Means?\" I said to him in Hindi? https://t.co/NTGrv8szN4 Many pluses for India. The key players had a good test and I don't see the need to make a change for Pune. South Africa have much to contemplate, especially with respect to the composition of their bowling. The resistance was resolute but the peak was too high to scale for South Africa. Second innings Shami was magnificent again.1-0 Muthisamy and Piedt have now scored more runs and played more balls in this partnership than all those that preceded them! This is a fine effort How good has Shami been today. Has hit the stumps three times. India has so many bowlers to turn to now. Won't be surprised if even Ishant has a role to play Just the start India wanted. The manner in which de Bruyn and Bavuma got out would make the dressing room uncomfortable. Interesting day in prospect. 5th day wicket but it doesn't look like a normal worn out Indian 5th day pitch. Only 22 wickets have fallen so far. But if South Africa play like they are under siege, India will win. RT @cricbuzz: With his record-breaking ton #RohitSharma powered India to a virtually unassailable lead, but can the Proteas pull off a mira… RT @BloodDonorsIn: #Varanasi, Uttar Pradesh \nNeed #Blood Type :  A-negative\nAt : Homi Bhabha Cancer Hospital, TATA Memorial\nNumber of Units… RT @BloodDonorsIn: #Guntur\nNeed #Blood Type :  A-positive\nAt : NRI Mangalagiri\nBlood Component : Platelets \nNumber of Units : 3\nPrimary Num… The artificial light starting to take over. The umpires have said that fast bowlers cannot bowl. Still no declaration. Lead 379. Enough. Light deteriorating.... @prasadtakalkar Understatement A special test match for Rohit Sharma. Class and elegance and two centuries. Not a bad way to begin a new chapter in a career! If Jadeja has come ahead of Kohli, he has to go after every ball because Kohli could have scored at a reasonable rate too. I get the feeling Kohli wants a few overs at SA this evening. RT @BloodDonorsIn: #Khammam\nNeed #Blood Type :  B-positive\nAt : Dr. Siva Rama Krishna Kannekanti\nNumber of Units : 2\nPrimary Number : 94917… @sricharannch @cricrohit @joybhattacharj Many Pujara's last 46 runs have come from 45 balls. Players have their rhythms. Wishing @hardikpandya7 speedy and successful recovery from his back surgery RT @BloodDonorsIn: #Kurnool\nNeed #Blood Type :  O-positive\nAt : Gowri Gopal Hospital\nBlood Component : Blood\nNumber of Units : 2\nPrimary Nu… RT @BloodDonorsIn: #Puducherry\nNeed #Blood Type :  A-negative\nAt : Indira Gandhi Government General Hospital\nNumber of Units : 6\nPrimary Nu… RT @BloodDonorsIn: #Jammu\nNeed #Blood Type :  O-positive\nAt : Medical college Jammu\nNumber of Units : 02\nPrimary Number : 7889549440\nPatien… RT @BloodDonorsIn: #Darbhanga, #Bihar\nNeed #Blood Type :  O-positive\nAt : RB Memorial Hospital\nNumber of Units : 3\nPrimary Number : 8802929… RT @BloodDonorsIn: #Nizamabad\nNeed #Blood Type :  O-positive\nAt : Ramadevi Manorama Hospital \nNumber of Units : 2\nPrimary Number : 75695629… @NeilMoorhouse @cricbuzz @7polly7 No. Just the passage of time and consumer preference India have twin objectives. Ensure against losing too many wickets and getting a move on to give the bowlers enough time on a slow surface. Slowly that objective will veer towards setting a target. Expect the run-rate to pick up now. Crucial runs, also crucial time used, by South Africa. Bit baffled by the bowling changes this morning RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  O-positive\nAt :  Ramesh Hospital\nBlood Component : Blood\nNumber of Units : 2\nPrimary Num… RT @cricbuzz: 'Still don't see South Africa winning this game,' feels @7polly7 as he chats with @bhogleharsha on #CricbuzzChatter at the en… To get to 200 test wickets in 44 tests, faster than any other left hand bowler, is an outstanding achievement for @imjadeja. So many great names in that list. I still think he has a big role to play in this test match. The track was slow but not quite possessed of the venom that was feared. Ashwin was the standout bowler. Again. In spite of a fine South African revival, India still ahead in this game South Africa will be very satisfied with their performance today. Two high quality centuries showing a good approach against spin. The kind of day that makes you feel good as a touring team The game is drifting now, South Africa tugging at it. This pitch is like a friend you have a misconception about; actually quite nice RT @BloodDonorsIn: #Jaipur, Rajasthan\nNeed #Blood Type :  Any group\nAt : Sawai Man Singh Hospital\nNumber of Units : 4\nPrimary Number : 8058… RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  AB-positive\nAt : Chinhat Hospital\nNumber of Units : 2\nPrimary Number : 9795400616\nPatient :… RT @BloodDonorsIn: #Karimnagar\nNeed #Blood Type :  AB-negative\nAt : Matha Sri Hospital\nBlood Component : Platelets \nNumber of Units : 2\nPri… The second new ball goes to India's most successful new ball bowler in Indian conditions. Ashwin. Reader responses suggest it might not actually be so. Would have been a good story though! https://t.co/AYBvmcmkkw RT @chqbook: Today, a cricketer cannot just be a good bowler or a good batsman. He has to field well. A bad fielder is a liability. How doe… RT @BloodDonorsIn: #Vellore\nNeed #Blood Type :  Any group\nAt : CMC Vellore\nNumber of Units : 4\nPrimary Number : 9471714117\nSecondary Number… RT @BloodDonorsIn: #Visakhapatnam, Andhra Pradesh \nNeed #Blood Type :  B-positive\nAt : Venkatarama Hospital, Dondaparthy\nNumber of Units :… Still no demons in the pitch. The ones in the mind are always more dangerous. Day of reckoning for South Africa. Not just ability and technique but resolve will be tested too. Expect this to be the decisive day. RT @cricbuzz: On #CricbuzzChatter, @bhogleharsha and @7polly7 discuss Day 2 of the first Test between India and South Africa, as Pollock re… Perfect day for India. Enough runs on the board, opposition in disarray, bewildered batsmen. South Africa need to follow the lead of Elgar who has batted really well but will have to display great skill against quality spin. Normal service resumed for @ashwinravi99. Champion bowler. Familiar scenes already. Spinners on, fielders around the bat. Thought the spinners bowled too quick early on. Ashwin pulled back his pace but Jadeja was still pinging them in. Might be different tomorrow 34 overs left. Probably play another 15, get 500-520. Put SA in for about 15 overs It has been so satisfying to see @mayankcricket take such giant strides with an immaculate double century. Composed, organised and hungry. RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  Any group\nAt : KGMC Hospital. \nNumber of Units : 3\nPrimary Number : 9198010610\nVia: @piyush… Haha, typical one-liner from you Rujuta! https://t.co/jMCefztK8B @Ankurocious @BloodDonorsIn Sorry, hadn't checked my phone. Was on air. Have done RT @BloodDonorsIn: #Surat, Gujarat\nNeed #Blood Type :  O-positive\nAt : Radhika Hospital, Athwalines\nBlood Component : Platelets \nNumber of… Delighted for @mayankcricket. He has done it the hard way, produced a mountain of runs and now has a test hundred. The great merit of hanging in there and breaking the door down. So that is two balls that have kept low this morning from Philander. Created a buzz. Currently cloudy but dry in Visakhapatnam. The sun, like South Africa's bowlers, is desperately looking to break through! RT @cricbuzz: Can South Africa change things around on Day 2 of the first Test against India? Watch @bhogleharsha and @7polly7 lay down the… Like the idea of #CricbuzzChatter and to kick off here is @7polly7 with me after play today. Tell us what you think. @cricbuzz https://t.co/j1nmsyxeRT RT @BloodDonorsIn: #Ludhiana\nNeed #Blood Type :  AB-positive\nAt : Gurunanak Blood Bank, Model Town\nNumber of Units : 3\nPrimary Number : 870… RT @BloodDonorsIn: #Meerut, Uttar Pradesh\nNeed #Blood Type :  B-positive\nAt : Navjeevan Hospital, Mangal Pandey Nagar, Ramgarhi\nNumber of U… RT @BloodDonorsIn: #Kakinada\nNeed #Blood Type :  Any group\nAt : Sridhar Hospital. \nBlood Component : Blood\nNumber of Units : 2\nPrimary Numb… RT @BloodDonorsIn: #Amalapuram\nNeed #Blood Type :  O-positive\nAt : Rohini Hospital\nBlood Component : Blood\nNumber of Units : 2\nPrimary Numb… RT @BloodDonorsIn: #Jaipur, #Rajasthan\nNeed #Blood Type :  AB-positive\nAt : Mahatma Gandhi Hospital, Sitapura\nNumber of Units : 3\nPrimary N… Watching #PakvsSL. What an eye-catching player Abid Ali is. The name of course is special to me because our Abid chicha was a childhood hero. With all the attention on Rohit Sharma today, inevitable given his history in test cricket and giant stature in limited overs cricket, Mayank Agarwal quietly dished out a mature, controlled innings..his six over cover to get to 50, was very classy. South Africa have many questions to answer on the potency of their bowling in these conditions. They will need a much better day tomorrow All the talk before the game was about Rohit Sharma, the opener. All the talk now is about Rohit Sharma, the opener. A century on his first opportunity is a nice way to say \"I'm here\" Just about perfect session for India. Win toss bat first. Negotiate the brief period while the new ball is threatening. Go hard at the spinners. Build a solid platform. So often, the first session of a test has a bearing on the series. With his heart briefly in his mouth, Rohit Sharma produces a half century that will surely mean a lot to him. @Kale_Sid @ImRo45 Thanks @parikhdeep12 @BCCI @ImRo45 Thanks @strawbazzer Yes, but I just thought I would point it out.... @prasannakovalam No @VAMOSVK That is exactly the point I was making.... Top class new ball bowling from Philander and Rabada. But the humid conditions means the spells have to be short. RT @castrolcricket: Let's celebrate the vision for a clean, green India by providing #ContinuousProtection to our streets. Participate in t… @GeniusInDenial Er......no, it isn't! Correction: Clive Woodward, the World Cup winning rugby coach https://t.co/xnBMlialz3 So good to see young talent. Delighted that young Shafali Varma, age 15 (so should I say little Shafali!) and Jemimah Rodrigues, age 19, have taken @BCCIWomen to a win over South Africa. Just to get an idea of how close our cricket world really is. An article in the Telegraph by @NHoultCricket says that Andrew Strauss and Clive Woodward, cricket and rugby captains for England are part of a team picking the coach for @rajasthanroyals! Might be Andy Flower it seems Watched yesterday. Very impressive https://t.co/7pHtvMXSAn Lovely evening in Visakhapatnam with a dear classmate from school. We must preserve these relationships because they go back to who we were and are independent of who we became. RT @cricbuzz: With #ViratKohli announcing #WriddhimanSaha as India's first-choice keeper for the South Africa Test series, @bhogleharsha ta… RT @BloodDonorsIn: Your Blood can save someone's life. Gift a life to someone by donating blood. \nBe a hero. #BloodMatters because #LifeMat… RT @BloodDonorsIn: #Shivamogga, #Karnataka \nNeed #Blood Type :  A-positive\nAt : Sahyadri Narayana Multispeciality Hospital\nNumber of Units… RT @BloodDonorsIn: #Belagavi\nNeed #Blood Type :  A-positive\nAt : KLE Hospital. \nNumber of Units : 02\nPrimary Number : 9353593715\nVia: @svra… I worry though that there are conflicting signals going out to young Pant who has seen so much so early in life. Was he a test player &amp; therefore not picked originally for the World Cup? Is he now an odi player &amp; so not in the test XI? Or is this a call on his confidence level? With Hanuma Vihari as the specialist batsman at 6 and with Ashwin and Jadeja perfectly capable batsmen, India could look at pure keeping skills for the home series. And while Pant is hugely promising, he too will be aware that Saha is currently the better keeper on turning tracks The decision to have Saha keep wickets in the home tests is a clear signal on the kind of wickets that we can expect and therefore, the kind of skills needed. There was never any doubt that Saha is the best keeper in the country, the call was always about Pant and the future RT @aparanjape: Today is the 100th birth anniversary of Gajānan Digambar Mādguḷkar. He is popularly known by just his initials as Ga Di Mā… RT @BloodDonorsIn: #SOS\n#Dehradun\nNeed #Blood Type :  B-negative\nAt : Guru Teg Bahadur Hospital \nBlood Component : Platelets \nNumber of Uni… Wonderful news. So good to see a young institute taking such large strides. https://t.co/MjD6F7BhcQ Thanks @Sadafsayeed. Wish you and @MuthootMicrofin all the best going ahead. https://t.co/OBOaYnnhGz Such a rich, motivating session with #MuthootMicroFinance.  #TheWinningWay. Eager audience, learnt a few things today about microfinance. Always good when the learning is mutual. @BhogleAnita @TheWinningWay_ RT @cricbuzz: India's prodigious spin duo of #RAshwin and #RavindraJadeja are closing in on major records and @bhogleharsha believes they w… RT @BloodDonorsIn: #Gulbarga\nNeed #Blood Type :  B-positive\nAt :  Satya Hospital, Revansiddeshwar Colony\nNumber of Units : 2\nPrimary Number… RT @BloodDonorsIn: #Shivamogga\nNeed #Blood Type :  A-negative\nAt : Sahyadri Narayanan Hospital\nNumber of Units : 2\nPrimary Number : 6360193… RT @BloodDonorsIn: #Dehradun #Uttarakhand\nNeed #Blood Type :  AB-positive\nAt : Synergy Hospital\nBlood Component : Platelets\nNumber of Units… RT @BloodDonorsIn: #Gulbarga\nNeed #Blood Type :  A-positive\nAt : Nalini Namoshi \nNumber of Units : 1\nPrimary Number : 8904882286\nSecondary… RT @BloodDonorsIn: #Bhubaneswar #Odisha\nNeed #Blood Type :  B-positive\nAt : AIIMS Hospital\nNumber of Units : 3\nPrimary Number : 8763769299… And what a good tradition it is. May it long be that way https://t.co/kD93hC4gx8 RT @bsayyed74: @BloodDonorsIn Life and humanity wins, thanks all for the great support, Baby is doing well by the grace of Almighty.🙏🙏 @my_nameismy_aim Please tag @BloodDonorsIn. They will help you reach a large number of kind donors RT @joybhattacharj: How would you judge a 57 year old failed author who lost the use of an arm in battle and was jailed  for fraud? \nYet th… RT @cricbuzz: Ishant Sharma's second coming in Test cricket has seen him deliver match-winning contributions successfully. Is #ViratKohli t… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  AB-negative\nAt : Ramesh Hospital.\nNumber of Units : 3\nPrimary Number : 9949713496\nSecond… RT @BloodDonorsIn: #Coimbatore\nNeed #Blood Type :  B-positive\nAt : GKNM Hospital\nNumber of Units : 2\nPrimary Number : 9715314750\nPatient :… RT @shaggyudal: What an absolute legend in all senses of the word, heard about my Parkinson’s disease and sent this for my fund raising eve… @AghaKha19235390 @upGrad_edu Interesting that we were talking education and progress and that part escaped you. Guess it is the choices we make. RT @BloodDonorsIn: #Visakhapatnam\nNeed #Blood Type :  A-positive\nAt : NRI Hospital\nBlood Component : Platelets \nNumber of Units : 2\nPrimary… RT @BloodDonorsIn: #Karimnagar\nNeed #Blood Type :  O-positive\nAt : City Hospital.\nNumber of Units : 2\nPrimary Number : 9963378745\nVia: @TOL… Thanks Ronnie, enjoyed my time with you and @upGrad_edu https://t.co/9WctbGrrPs RT @BloodDonorsIn: #Varanasi #UttarPradesh\nNeed #Blood Type :  A-positive\nAt : Heritage Hospitals, Lanka\nNumber of Units : 2\nPrimary Number… Join me at 19.09 hrs. It should be a nice conversation. https://t.co/UlM0xQOSC9 RT @cricbuzz: With 10 consecutive series wins at home, India are on the brink of achieving a new world record. Watch the Voice of Cricket @… RT @BloodDonorsIn: #Pune\nNeed #Blood Type :  O-negative\nAt : Aditya Birla Memorial Hospital, Chinchwad\nNumber of Units : 2\nPrimary Number :… RT @BloodDonorsIn: #Indore, #MadhyaPradesh\nNeed #Blood Type :  O-negative\nAt : Apollo Hospital, Vijay Nagar\nNumber of Units : 3\nPrimary Num… RT @BloodDonorsIn: #Bhayandar, Maharashtra\nNeed #Blood Type :  A-positive\nAt : Wockhardt Hospitals, The Umrao IMSR, Mira Road\nNumber of Uni… RT @BloodDonorsIn: #Jabalpur\nNeed #Blood Type :  B-positive\nAt : Jabalpur Hospital\nNumber of Units : 3\nPrimary Number : 7987154912\nVia: @Sh… Happy that Rahul Dravid has called out age-fraud as \"seriously detrimental\" to Indian cricket. With the exaggerated importance to U19 cricket, there is a temptation to stay under 19 longer. Unfair to an 18 year old to be left out because he suffers in comparison to someone older RT @BloodDonorsIn: #Jabalpur\nNeed #Blood Type :  B-positive\nAt : Jabalpur Hospital &amp; Research Centre, Jabalpur, #MadhyaPradesh\nBlood Compon… Looking forward to being with people from the shipping industry with #TheWinningWay in a little while. #HapagLloyd. @BhogleAnita. Always good to interact with people from different industries. @TheWinningWay_ RT @Abhinav_Bindra: The women’s air rifle world record is higher than the men’s !  Always said that women have better nerves ! RT @1PeterHutton: ICC announces ground-breaking partnership with Facebook https://t.co/N29sgHphii RT @BloodDonorsIn: #Khammam\nNeed #Blood Type :  A-negative\nAt : Tejaswi Hospital, Khammam\nBlood Component : Platelets \nNumber of Units : 2… RT @RonnieScrewvala: @bhogleharsha will be with us at @upGrad_edu this Saturday (28th Sept) at 7 PM for a session on \"MBA - Clean Bowled?\".… RT @bizpunditz: Bhaskar Bhat, MD @titanwatches\ntells us the story about the rise of #Titan, India's most iconic watch brand! For corporate… RT @BloodDonorsIn: #Guwahati, #Assam \nNeed #Blood Type :  AB-negative\nAt : Guwahati Medical College Hospital, Bhangagarh\nNumber of Units :… RT @BloodDonorsIn: #Kalaburagi, Karnataka\nNeed #Blood Type :  A-positive\nAt : Basaveshwara Hospital\nNumber of Units : 2\nPrimary Number : 98… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  O-negative\nAt : Sunrise Hospital\nNumber of Units : 2\nPrimary Number : 9963845946\nVia: @P… RT @BloodDonorsIn: #Lucknow, Uttar Pradesh\nNeed #Blood Type :  Any group\nAt : T.S. Mishra Hospital\nNumber of Units : 3\nPrimary Number : 983… RT @BloodDonorsIn: #Dehradun #Uttarakhand\nNeed #Blood Type :  O-positive\nAt : Synergy Hospital\nNumber of Units : 2\nPrimary Number : 9878107… RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  AB-positive\nAt : Apollo Medics Hospital, LDA Colony, Lucknow, Uttar Pradesh\nBlood Component… RT @BloodDonorsIn: #Ranchi\nNeed #Blood Type :  Any group\nAt : Medanta Hospital. \nNumber of Units : 2\nPrimary Number : 8825339593\nVia: @bles… RT @cricbuzz: 'Rohit Sharma's success as an opener will solve a lot of problems for India' feels @bhogleharsha as he traces Rohit's journey… A very happy birthday to the always interesting Ian Chappell. Learnt so much from him. RT @bizpunditz: MD- Omidyar Network India &amp; Former Crisil CEO, Roopa Kudva tells us why you don’t always have to be the best performer to b… If you are a good person and people respond with angry tweets, the problem is with those people and not with you. https://t.co/gCYKFSqN23 RT @BloodDonorsIn: #Shimla\nNeed #Blood Type :  O-positive\nAt : Indira Gandhi Medical College Hospital\nNumber of Units : 2\nPrimary Number :… A very happy birthday to Dr Manmohan Singh, a person I have admired enormously over the years and still do. RT @BloodDonorsIn: #Thoothukudi\nNeed #Blood Type :  B-negative\nAt : Theiva nursing home\nNumber of Units : 2\nPrimary Number : +919498122419… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  B-positive\nAt : Anu Hospital\nNumber of Units : 2\nPrimary Number : 9640891613\nSecondary N… There is only one question to be answered in my view. Does the ethics officer ask for a picture with Rahul Dravid before or after the hearing! https://t.co/GBVH2SY0LI RT @cricbuzz: Spotlight on India's spin duo in Bumrah's absence reckons 'Voice of Cricket' @bhogleharsha, as he previews the #INDvSA Test s… RT @Jaspritbumrah93: Injuries are part &amp; parcel of the sport. Thank you for all your recovery wishes. My head is held high &amp; I am aiming fo… Wishing @BishanBedi the best of health and spirit in the year ahead. A philosopher of our game who just happened to bowl left arm spin of the very highest class! @sameet80 Thanks Sameet. Cheers @gouthamsri Pls tag @BloodDonorsIn. They have a wide reach It is 9 in the morning and as dark as dusk in Mumbai. Big rain day? 12 years since one of the biggest events in the history of cricket. Not just because India won the first ICC World T20 but because of what it led to with the IPL. We, who were there, knew it was the start of something big but, in all honesty, had no clue how big T20 would be @sthalekar93 @modsteroz @RaviShastriOfc @alanwilkins22 @bowlologist @TomMoodyCricket @Sdoull @scottbstyris @KP24 @meljones_33 @SteelyDan66 @MikeHaysman Oh, oh! Airport! Hang on to that credit card, Lisa! The Bumrah injury is a big jolt for India. I wonder if it will have an impact on the kind of surfaces offered for the test matches. RT @NorthStandGang: This wonderful video by @bhogleharsha on Mohinder Amarnath and his ever grateful contribution to Indian Cricket is a mu… RT @BloodDonorsIn: #Bhubaneswar\nNeed #Blood Type :  AB-negative\nAt : SUM Hospital\nNumber of Units : 2\nPrimary Number : 9176271094\nVia: @ims… RT @BloodDonorsIn: #Madurai\nNeed #Blood Type :  O-negative\nAt : Velammal Hospital \nNumber of Units : 02\nPrimary Number : 8825896703\nVia: @v… RT @BloodDonorsIn: #Indore, #MadhyaPradesh\nNeed #Blood Type :  B-positive\nAt : Choithram Hospital\nNumber of Units : 3\nPrimary Number : 9691… And to think neither is with us today... Very sad https://t.co/wway4hL6jq RT @BloodDonorsIn: #Warangal\nNeed #Blood Type :  O-positive\nAt : Max Care Hospital\nNumber of Units : 2\nPrimary Number : 8074163592\nVia: @Ro… RT @BloodDonorsIn: #Jodhpur\nNeed #Blood Type :  A-negative\nAt : Mediplus Hospital\nNumber of Units : 3\nPrimary Number : 7676725510\nSecondary… RT @BloodDonorsIn: #Kurnool\nNeed #Blood Type :  A-negative\nAt : Amiliya hospital \nNumber of Units : 2\nPrimary Number : 97031 31339\nPatient… RT @BloodDonorsIn: #Cuttack\nNeed #Blood Type :  AB-positive\nAt : Acharya Harihar Regional Cancer Centre\nBlood Component : Blood\nNumber of U… RT @bizpunditz: NR Narayana Murthy of @Infosys\ngives some tips to today's young leaders on what it takes to succeed!  For corporate access… RT @BloodDonorsIn: #Vellore\nNeed #Blood Type :  Any group\nAt : CMC Hospital. \nNumber of Units : 3\nPrimary Number : 9931774484\nVia: @mobileh… RT @BloodDonorsIn: #Aligarh\nNeed #Blood Type :  AB-negative\nAt : KK Hospital, Ramghat Road\nNumber of Units : 2\nPrimary Number : 9837457132… RT @BloodDonorsIn: #Vellore\nNeed #Blood Type :  Any group\nAt : CMC Vellore\nBlood Component : Platelets \nNumber of Units : 2\nPrimary Number… RT @BloodDonorsIn: #Patna #Bihar\nNeed #Blood Type :  B-positive\nAt :  Jagdish Memorial Hospital, Near Patrkar Nagar Thana, Kankarbagh\nNumbe… RT @BloodDonorsIn: #Varanasi\nNeed #Blood Type :  Any group\nAt : Homi Bhabha Cancer Hospital\nNumber of Units : 2\nPrimary Number : 9044161301… RT @BloodDonorsIn: #Karimnagar\nNeed #Blood Type :  A-positive\nAt : Chalmeda Anand Rao Institute of Medical Sciences\nNumber of Units : 3\nPri… For those who love these old reports.... https://t.co/PTrYqKM168 RT @wmakarand: Madhav Apte played Kanga league for 55 years.  He quit cricket at 71 ! RT @vikramsathaye: Salute to Bronze medalist Rahul Aware for winning at the Wrestling World Championship. Comes from small village in Marat… RT @Fancricket12: Gomez, Worrell and King reduced IND to 10/3, trailing by 26. A young man hung in there with Umrigar and then Hazare. He w… I am in mourning at the passing of Shri Madhav Apte. Deep, genuine cricket lover, quality batsman himself (7 tests at an avg of 49.3), and a classy, dignified human being. From an era where love for the game was unconditional. Wonderful host, great story-teller. RT @NorthStandGang: Rest in peace, Apte Sir. His exploits as a young batsman on the '53 tour of WI, his burning passion for domestic cricke… RT @shishhattangadi: Madhav Apte had a bag of stories. From Vinoo Mankad to his buddy Subhya Fergie Gupte. To listen to him was rewinding c… These are pretty dramatic scenes from Houston! Holding raised hands and walking together is a powerful statement. Now, hopefully it will lead to greater economic collaboration because that is what matters. #TrumpModi RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  Any group\nAt : Command Hospital. \nNumber of Units : 3\nPrimary Number : 8872417523\nVia: @abh… India have bowled way too short. And have been punished for it South Africa coasting. India hasn't really turned up today. 45-5 in the last 9 overs..... @JasonBo04445354 @SonyPictures @StarSportsIndia No India need a big finish to justify batting first. Not enough at this stage Big surprise already in Bengaluru. India win the toss and bat. Good chasing ground, possibility of dew. But Kohli says he wants to put some pressure on his own team and be ready for a day when they have to bat first in these conditions @pallavisharda @gauravkapur I remember that day well! Hope it is going well with you. RT @diarun_002: @gauravkapur @bhogleharsha @pallavisharda Gem! https://t.co/KCcpeNDHPO RT @NorthStandGang: @bhogleharsha pays a heartfelt tribute to Crowe.\nhttps://t.co/oYznmPFcXr RT @BloodDonorsIn: #Faridabad, #Haryana\nNeed #Blood Type :  B-positive\nAt : Asian Institute of Medical Sciences, Sector 21\nBlood Component… RT @BloodDonorsIn: #Karimnagar\nNeed #Blood Type :  B-negative\nAt : Madhavi Nursing Home \nNumber of Units : 2\nPrimary Number : 9849778346\nSe… Just read this thread. https://t.co/CD3EVoaXTE @GraemeSmith49 I thought they were turning the match around in the second half @7polly7 @GraemeSmith49 @mmbangwa Almost there! Hey @GraemeSmith49 @7polly7 @mmbangwa are you watching what I am watching? #RWC2019 Mohali to Bengaluru with three sessions of #TheWinningWay in Jaipur with @BhogleAnita. Now switching back to T20 cricket. Hopefully good game tomorrow. @insomniac25 I think the idea was to admire the leap.... RT @irbishi: Can't see a better one this @CPL 2019??? What do you guys think?? https://t.co/U3Y4wrZ4zA RT @BloodDonorsIn: #Bhopal #MadhyaPradesh\nNeed #Blood Type :  AB-negative\nAt : Chirayu hospital Bairagarh\nNumber of Units : 3\nPrimary Numbe… RT @BloodDonorsIn: #Kurnool\nNeed #Blood Type :  O-negative\nAt : Gauri Gopal Hospital\nNumber of Units : 3\nPrimary Number : 9959231856\nSecond… RT @BloodDonorsIn: #Kakinada\nNeed #Blood Type :  A-negative\nAt : Gouthami Hospital\nBlood Component : Platelets\nNumber of Units : 2\nPrimary… RT @BloodDonorsIn: #Cuttack\nNeed #Blood Type :  A-positive\nAt : SCB Hospital.\nNumber of Units : 2\nPrimary Number : 7655078129\nPatient : Sun… It is amazing how all of us see things differently. https://t.co/8canHpiU3N Sorry there was a spelling error. Well played #HamiltonMasakadza https://t.co/WZVu9FZwSP Well played #HamiltonMazakadza. You didn't have it easy but you kept at it and played a part in our game. RT @L0vingnature: Wow! What a jump!🐾🐾🐾 https://t.co/PcDRbrcmHm Lovely to spend some time with the folks at #Citibank and some of their customers. Very interesting conversations. Enjoyed sharing #TheWinningWay with them. @BhogleAnita Oh, the mighty AB! Well done. https://t.co/KKVXqJ3m4n RT @joybhattacharj: I was there in 2014 when the KFA showed us where the new football stadium was to be built &amp; ready for FIFA 2017. 5 year… RT @BloodDonorsIn: #Ernakulam\nNeed #Blood Type :  A-negative\nAt : Specialist Hospital \nNumber of Units : 3\nPrimary Number : 9847513173\nPati… RT @BloodDonorsIn: #Behror, Rajasthan\nNeed #Blood Type :  A-positive\nAt : Kailash hospital\nNumber of Units : 2\nPrimary Number : 8740095043… @ProfessorOnCL @cricketaakash Khilvaad? Kyon bhai? Bahut safal commentator hain... Safe batsman, peppy commentator! Have a lovely year @cricketaakash. Saalgirah kal thi lekin jab poora saal aapka ho to ek din yahan-wahan hone se kya farak padta hai! RT @BloodDonorsIn: #Bhopal #MadhyaPradesh\nNeed #Blood Type :  O-positive\nAt : Noble Hospital\nNumber of Units : 2\nPrimary Number : 907431835… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  AB-positive\nAt : Sentini Hospital.\nNumber of Units : 1\nPrimary Number : 7780527437\nSecon… RT @thoughtspot: Excited to announce we're officially open for business in Australia and New Zealand! https://t.co/9zivtpLQv6 https://t.co/… Bit slow on the football results....but isn't it incredible that #PSG without Neymar, Mbappe or Cavani can shred Real 3-0! A good track from Mr Daljit Singh to say goodbye. Been a wonderful contributor to Indian cricket, not just as a player but as a curator at this ground since it first came up. South Africa were always about 20 runs short and that meant India were never under any pressure. Coasted home. And now I have seen a second from David Miller. https://t.co/uztnTbWf8d Love how Kohli doesn't compromise the purity of his shot-making even in T20 cricket RT @cricbuzz: South Africa have an inexperienced squad but our panel on #CricbuzzLIVE believes each youngster will be motivated to make an… I've already seen one of the catches of the season. Brilliant from Virat. Good surface to bat on. But only one batsman is in rhythm so far @JontyRhodes8 For cricket Jonty. Especially after Dharamshala! Don't want to tempt fate but it is looking like a good day in Chandigarh today. RT @BloodDonorsIn: #SOS\n#Cuttack #Odisha\nNeed #Blood Type :  A-negative\nAt : SCB Medical College Hospital.\nBlood Component : Plasma\nNumber… Now that is a photograph! https://t.co/qxn71sg8G9 RT @BloodDonorsIn: #Kishanganj\nNeed #Blood Type :  A-positive\nAt : MGM Hospital. \nNumber of Units : 2\nPrimary Number : 9801992273\nSecondary… RT @BloodDonorsIn: #Bhopal #MadhyaPradesh\nNeed #Blood Type :  O-positive\nAt : Hamidia Hospital\nNumber of Units : 2\nPrimary Number : 9171738… We need a law against fixing urgently and then, hopefully, the sight of people going to jail will act as a stronger deterrent. Very concerned at the news of possible match-fixing in the #TNPL. Shows that the crooks can infiltrate even a traditional cricket loving city like Chennai. But the silver lining is that more players are reporting approaches. RT @BloodDonorsIn: #Rohtak\nNeed #Blood Type :  AB-negative\nAt : PGIMS Hospital. \nNumber of Units : 4\nPrimary Number : 7042224300\nIllness :… Wishing @ashwinravi99 a very happy birthday. Look forward to seeing those bagfuls of wickets again. Well, I come down from McLeodganj in North India to see that a MacLeod has scored runs in Dublin! #CallumMacleod RT @BloodDonorsIn: #Chandigarh\nNeed #Blood Type :  A-positive\nAt : PGI Hospital. \nBlood Component : Platelets \nNumber of Units : 2\nPrimary… @gurichamp I hope so too. And hopefully it won't rain! Avvalli! Lekapote progress ela autundi! Kaani naaku inka 4-5 years ivvandi....,😊 https://t.co/jymAiuqHWU Excited about a new season for Indian cricket. And good to see an Indian name on the Indian jersey. #ByjusxTeamIndia. RT @BloodDonorsIn: #Jaipur\nNeed #Blood Type :  AB-positive\nAt : JNU Hospital, Jagatpura \nNumber of Units : 2\nPrimary Number : 8290247967\nVi… RT @BloodDonorsIn: #Prayagraj\nNeed #Blood Type :  Any group\nAt : Mohak hospital, Stanley Road \nNumber of Units : 3\nPrimary Number : 9340660… RT @BloodDonorsIn: #Kakinada\nNeed #Blood Type :  O-positive\nAt : Apollo Hospital \nBlood Component : Platelets \nNumber of Units : 2\nPrimary… RT @AWSStats: In The Oval Test, England became the first team in Test cricket to bowl the opposition out in both innings with none of the b… RT @BloodDonorsIn: #Amritsar #Punjab\nNeed #Blood Type :  A-positive\nAt : Sri Guru Ramdas Hospital.\nNumber of Units : 3\nPrimary Number : 981… RT @narayan140: @aparanjape @iitbombay You’re too young to know the origin story of MI so let me tell you. After a similar incident in whic… RT @India_AllSports: News Flash: Pankaj Advani wins World Billiards (150-Up) Championships; defeated Nay Thway Oo of Myanmar 6-2 in Final.… RT @gauravkalra75: will be quite odd for england's players to watch the other team celebrate with the trophy although the contest ended on… Like the little things that happen in commentary boxes too. As David Gower and Ian Botham come to the end of their Sky contracts, they are called in to do a last stint as England win an Ashes test. RT @ClaytonMurzello: In today’s @mid_day. A few passengers may recognise her while she gives them their bus tickets. https://t.co/hGy2EldPpC RT @BloodDonorsIn: #Jammu\nNeed #Blood Type :  AB-positive\nAt : Narayana Hrudayalaya\nNumber of Units : 2\nPrimary Number : 9419991414\nSeconda… RT @BloodDonorsIn: #Bhopal, #MadhyaPradesh\nNeed #Blood Type :  A-negative\nAt : Bansal Hospital. \nNumber of Units : 2\nPrimary Number : 99459… RT @MichaelVaughan: This series has been a great advert for the game .. 2 very closely matched teams .. 5 fantastic pitches &amp; the Duke ball… RT @ZaltzCricket: England won the World Cup without winning the final; and lost the Ashes without losing the series. Thanks be to Cricket.… The ground is a lake. That aged well!! Bucketing down now. https://t.co/srtUiGRG7n Only a slight drizzle now, which looks like it could end soon, but there is a lot of water on the covers and on the ground. Cut off is 21.46 so lots of time Absolutely bucketing down in Dharamshala......You've just got to hope it will stop! A very happy birthday to @ayushmannk. Bright, very talented, a young man who has fought his way up and is doing the kind of films he wants to. Wish you lots of happiness. Damn, how do I prepare for a cricket match when the mist is creeping in, the insects are chirping, I can hear the birds, spot a butterfly......And time is so delightfully still. It is, apparently, #EngineersDay today. So all the best to all of you mighty engineers. From someone who passed exams (is formally https://t.co/k7JVHf7l8P!) but never really became one. You're a riot @BumbleCricket and may you always be that way! https://t.co/KAGgbbgnYx So #Ashes2019  are going to end 2-2 @here_2_be_aware People are kind.... Dharamshala is gorgeous. View from my room. But, alas, it is pouring...... https://t.co/SVmRql59UK Start of a new season..... https://t.co/b55HauOSzu On switching seamlessly to my childhood dialect when I am in Hyderabad.....\n\nhttps://t.co/tG14bY2DsE @jamwalvikram It depends on how you see yourself. Yes, you have to be careful but you can't be obsessed about being a \"public figure\". That is relative anyway. @aritrac1984 Never. Assigning own experiences on others, maybe? 🤔 Had inadvertently hit the like button on a tweet or two. Hazards of late night scrolling, maybe! Corrected @danredford70 Completely agree, Dan, about @pakwakankar and @jimmaxcricket. Radio is a beautiful medium for cricket While the batting, and its inconsistency, must hurt former greats in Australia, I suspect it is the catching that will hurt more. @pakwakankar @sunandanlele Good idea! There was a time when the job of the openers was to see off the new ball. Now, almost everywhere in test cricket, the new ball is seeing off the openers. Never tire of watching @ShaneWarne bowl. I haven't seen anyone else with that drift and turn. https://t.co/cFTosRiT5k RT @BloodDonorsIn: #Chandigarh\nNeed #Blood Type :  B-positive\nAt : PGI Hospital. \nBlood Component : Platelets \nNumber of Units : 3\nPrimary… RT @BloodDonorsIn: #Patna\nNeed #Blood Type :  A-positive\nAt : IGIMS Hospital. \nNumber of Units : 2\nPrimary Number : 805160558\nVia: @Raktdan… RT @BloodDonorsIn: #Guwahati, #Assam \nNeed #Blood Type :  Any group\nAt : Apollo Hospital, GS Rd, Christian Basti\nNumber of Units : 5\nPrimar… RT @cricbuzz: The Spin Wizard turns 50! Good time to revisit the genius of @ShaneWarne in the words of @bhogleharsha. Happy Birthday, legen… @JMBeer434 Thanks Jonathan Wishing @anshyrath all the best as he moves to India from HongKong. Still remember that fine innings in that opening partnership in the Asia Cup that gave India a real scare. Look forward to seeing you in the Ranji Trophy next year. RT @joybhattacharj: I get invited to a lot of seminars where we all sit around and discuss Indian sport and how we can get better as a nati… RT @BloodDonorsIn: #Trichy\nNeed #Blood Type :  A1-negative\nAt : Kauvery Heart City Hospital\nNumber of Units : 2\nPrimary Number : 8754237510… Sometimes the situation allows you to to discard the constraints that the format can impose on you. Jos Buttler is playing with the freedom he probably is denied most days in test cricket. Great thing about test cricket is that you have to keep up intensity over long periods. England go from130-2 to 207-7 as Australia benefit from the freshness of Mitch Marsh. Good to see India allowing game time to red ball players. @ashwinravi99 takes 9 wickets and scores 55 for Nottinghamshire. Have to find match time for @cheteshwar1 too. RT @cricbuzz: 'Won't see the best of Dhawan if he believes every game is his last', reckons @bhogleharsha while discussing the flamboyant l… @banindya Easier said .. KL Rahul has to go back to domestic cricket and that may not be so bad for him. And I think the selectors have been prudent with Hardik Pandya given recent fitness issues. The arrival of Vihari &amp; the fact that the next five tests are in India probably made it tough anyway Either way it is hard on the two players who have scored runs everytime they have been given an opportunity. Abhimanyu Easwaran and Priyank Panchal must keep trying like Mayank Agarwal did. So either Rohit Sharma or Shubman Gill to open the batting. I suspect the team management is looking at Rohit and Gill gets to feel his way around the team. This cannot be a short-term call, India has to be ready to have Rohit opening in the away tours starting 2020. Been clearing. Books, once fresh, looking forlornly back at me through dusty covers, pleading to be kept. I look away from them. Everybody's time eventually comes. RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  Any group\nAt : Ajanta Hospital, Alambaag\nNumber of Units : 2\nPrimary Number : 9792934143\nSe… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  AB-negative\nAt : Nagarjuna Hospital.\nNumber of Units : 5\nPrimary Number : 9494426272\nVia… RT @BloodDonorsIn: #Patna\nNeed #Blood Type :  AB-positive\nAt : Savera Hospital, Kankerbag\nNumber of Units : 2\nPrimary Number : 9065422191\nV… RT @BloodDonorsIn: #Varanasi\nNeed #Blood Type :  B-positive\nAt : BHU Hospital\nNumber of Units : 2\nPrimary Number : 8802024955\nVia: @Mcharly… RT @BloodDonorsIn: #Ludhiana, Punjab\nNeed #Blood Type :  AB-positive\nAt : Dayanand Medical College Hospital, Civil Lines, Tagore Nagar.\nNum… RT @BloodDonorsIn: #Jammu\nNeed #Blood Type :  AB-positive\nAt : GMC Hospital\nNumber of Units : 2\nPrimary Number : 9419220687\nSecondary Numbe… RT @bizpunditz: Thought leadership served on the move!\nNow learn from some of India's best business practitioners on the go! Bizpunditz fre… RT @DevJhajharia: Happy to share that I have achieved the qualification mark to qualify for the Tokyo 2020 Paralympics.\n\nThank you @Media_S… Anant Chaturdashi. The day we saw thank you and goodbye to Ganpati. Also, traditionally, the day we say good bye and thank you to the rains. I don't think the second of those is likely. RT @joybhattacharj: Ganesh Chaturthi and Muharram processions crossing in Silvassa. What a lovely lovely picture! This is my country! https… @pragyanojha It is a beautiful phase and puts everything else into perspective. Congratulations. RT @BloodDonorsIn: #Vadodara, #Gujarat\nNeed #Blood Type :  B-negative\nAt : Tricolour Hospital, Genda Cir, Vadiwadi\nNumber of Units : 3\nPrim… RT @cricbuzz: 'The inability of openers to score big is demeaning Test cricket' reckons @bhogleharsha as he tries to make sense of plummeti… RT @BloodDonorsIn: #Kakinada\nNeed #Blood Type :  B-positive\nAt : Sitarama Nursing Home\nNumber of Units : 2\nPrimary Number : 9492236093\nPati… RT @BloodDonorsIn: #Bhopal, #MadhyaPradesh\nNeed #Blood Type :  AB-negative\nAt : Chirayu Medical College &amp; Hospital, Bhopal-Indore Highway B… Wishing all our friends from Kerala a wonderful, festive Onam. Thanks Rishabh. Delighted. @BhogleAnita https://t.co/fxagnafyE0 RT @AkbaruddinIndia: Rare cricketing feat symbolic of the many gains made by people of Afghanistan - @IndiaUNNewYork  \n\nC statement https:/… RT @RSingh6969a: @NorthStandGang @BCCIdomestic @VenkatapathyRa5 @VVSLaxman281 @azharflicks @BishanBedi @lpsahi @RayuduAmbati @bhogleharsha… @izzywestbury Thank you Isabelle. You might have been overly kind though RT @BloodDonorsIn: #Vijayawada, Andhra Pradesh\nNeed #Blood Type :  O-positive\nAt : Aayush Hospital, Sri Ramachandra Nagar.\nNumber of Units… RT @cricbuzz: As an inexperienced South Africa tour India for a 3-match T20I series, Voice of Cricket, @bhogleharsha previews their strengt… Just three tests but you don't measure @MohammadNabi007's contribution to Afghanistan cricket by numbers. He is one of their torchbearers and showed that they can play cricket. Look forward to seeing more of him in white ball cricket This is a thread that forces you to think https://t.co/hNwhNVZhEg RT @cricbuzz: \"For India the South Africa T20Is is about discovering players in the right roles\" reckons @bhogleharsha as he previews the I… Happy Birthday to one of my first cricket heroes, Syed Abid Ali. As a kid, used to go early to watch State Bank of Hyd play at the Osmania ground just to gawk at him, then imitated his bowling action in cork ball cricket. Wish him good health RT @cricbuzz: '#SteveSmith has shown that technique is important but not everything' feels @bhogleharsha as he reviews Australia's successf… There have been many great events in our game. Since the World Cup of 1975, the big ones for me have been Packer's World Series Cricket, the rebel tours and the return of South Africa, T20 cricket and IPL and the dramatic progress of Afghanistan from Div 5 upwards Just brilliant from Afghanistan. Had 18.3 overs to get 4 wickets with 2 batsmen and did it with overs to spare. Magnificent game for @rashidkhan_19 but how good was everyone else. Their great story continues. RT @BloodDonorsIn: #Coimbatore\nNeed #Blood Type :  Any group\nAt : Ganga Hospital\nNumber of Units : 7\nPrimary Number : 9841616643\nPatient :… @plalor You've given the beer company so much publicity, they should send you a year's supply RT @BloodDonorsIn: #Varanasi, Uttar Pradesh\nNeed #Blood Type :  O-negative\nAt : Homi Bhabha Cancer Hospital, Old Loco Colony, Shivpurwa\nNum… @Waynekatesh That will be fantastic And isn't this lovely! I particularly liked the fact that all of India came together to see the positives behind #Chandrayaan2 and looked beyond the fact that it failed at the last stage. https://t.co/mqmYWIuNwQ I notice there is an effort to fast track Shubman Gill into captaincy. I wonder why. He is at a stage in life where he needs to focus on understanding his game better, on becoming a more complete batsman. Maybe he should just be left alone to score runs for now I hope the rain goes away in Chattogram. Afghanistan deserve to win this test match. They have been fantastic and have offered further proof of how quickly they adapt. RT @bhogle: England's Uncertainty Principle: They cannot, at the same time, be good at both test cricket and ODI cricket. Steve Smith has been magnificent, super-human almost, but don't forget the bowlers that take the wickets. Pat Cummins has been excellent throughout and Josh Hazlewood is always good. Well, the Ashes are staying Down Under. Australia were just too relentless and England were too far back. Headingley was a miracle, it should have been 3-0 https://t.co/6BLkrMvNiw Hanging on.....Test cricket is giving us some good last days https://t.co/6BLkrMvNiw It should have happened earlier but, unless England can conjure up some rain in this divine summer of cricket they have had so far, the #Ashes are staying Down Under. @MohanVSS Haha, have experienced that! Thanks Yash. I get my share of angry replies but I don't normally have issues with that. And I haven't needed to block anyone for a long time https://t.co/HPm7fYrrhi England surviving, but just about. Could be a wicket anytime. RT @BloodDonorsIn: #Palampur, #HimachalPradesh\nNeed #Blood Type :  AB-negative\nAt : Civil Hospital, Berachah\nNumber of Units : 3\nPrimary Nu… RT @BloodDonorsIn: #Vellore\nNeed #Blood Type :  AB-positive\nAt : CMC Hospital. \nNumber of Units : 1\nPrimary Number : 8918459664\nVia: @Raktd… RT @BloodDonorsIn: #Thane\nNeed #Blood Type :  A-positive\nAt : Jupiter Hospital\nNumber of Units : 1\nPrimary Number : 9867154377\nVia: @ananth… It was relevant when the Ranji Trophy was played within a zone and some teams only got 3-4 games a season. And there was no India 'A'. You must play for a team that produces a sense of belonging, otherwise you begin to play for yourself. https://t.co/wiPGYqwfKZ An assortment of players, with no affiliation or loyalty, playing for India Red  beat an assortment of players, with no affiliation or loyalty, playing for India Green to win the Duleep Trophy, a tournament that was once relevant. Now, it serves no purpose. RT @VRFerose: The Shoe Box - A short film | Official selection at BISFF and LVIFF https://t.co/Ff3UdwvJoH via @YouTube A profound message o… RT @SupermarketWala: Lifetime Achievement Award from the advertising fraternity for dear  @kamathmadhukar yesterday. What a proud moment an… RT @NASA: Space is hard. We commend @ISRO’s attempt to land their #Chandrayaan2 mission on the Moon’s South Pole. You have inspired us with… RT @IIM_Udaipur: Today, the IIM Udaipur community had an interactive session with the Board of Governors. Mr. Harsha Bhogle spoke about his… Steve Smith was just playing out a dream and letting us be part of it.... RT @anandmahindra: The communication isn’t lost. Every single person in India can feel the heartbeat of #chandrayaan2 We can hear it whispe… Very proud of our @isro. You were almost there. I join the world in applauding you. RT @JeffBezos: Rooting for team India. Good luck, India! #Chandrayaan2 https://t.co/iWWSqPs4nz He was bowling to England in the nets. He was over 40 and just turning his arm over. I said \"Aap aise hi bowling karrain?\" He said (along the lines of) \"Agar sahi karoonga to unka confidence kharaab ho jaayega\"! I wish I had that interview somewhere! https://t.co/1HuLV7igWz Shocked to hear that the maestro Abdul Qadir is no more. Such a personality. Had the opportunity of making friends with him when he was playing in Melbourne in the late 90s. Loved the stories he told. One of the greats. RT @mohanstatsman: First bowler to reach 100 wickets in..\nTests: 1 Feb 1895 - Johnny Briggs for Eng v Aus at Sydney (victim: Affie Jarvis)… The great #LasithMalinga. Still has it. 4 in 4 again! May he just keep playing..... RT @timwig: Never has it taken less time for batsmen’s weaknesses to be distilled into cold numbers. \n\nThe evolution of data analysis in Te… Young managers, executives, do watch. And learning heads, give these young managers such insights. https://t.co/cZnpr7p0YV RT @SachinKalbag: I know we will soon forget this, but don't. Mumbai was under this much water on Sept 4. We should keep this photograph by… RT @joybhattacharj: Happy birthday Freddie Mercury of Queen. Or Farokh Balsara of St. Peter's School, Panchgani. You were one of the greats… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  B-positive\nAt : Nagarjuna hospital.\nNumber of Units : 1\nPrimary Number : 9848333554\nVia:… RT @BloodDonorsIn: #Kanpur #UttarPradesh\nNeed #Blood Type :  O-positive\nAt : Mahavir Hospital, Panki.\nNumber of Units : 2\nPrimary Number :… Excellent! My feel good story of the morning @wwos @CricketAus https://t.co/Z72EylxptS RT @Edged_and_taken: Historic! #T20WorldCup https://t.co/82jA5oStSd RT @BloodDonorsIn: #Kakinada\nNeed #Blood Type :  AB-positive\nAt : Trust Hospital\nBlood Component : Platelets \nNumber of Units : 5\nPrimary N… RT @MitchellGlenn: Steve Smith had not played a Test in 16 months coming into this Ashes series ... he was forced to retire hurt at Lord’s… Enjoy good ads having started my career there. Love the  creativity. And so good to see people raising the bar in Indian advertising with this one. #Fevicol https://t.co/i96OlsROdA RT @sachin_rt: COMPLICATED TECHNIQUE but an ORGANIZED MINDSET is what sets @stevesmith49 apart. Incredible comeback!\n\n#ENGvsAUS https://t.c… He's quirky but which genius isn't. And he is possessed of a very strong temperament. What a player, @stevesmith49 is. Absolute champion. @ssr99 Ha! I didn't know that! I was born into in a family of teachers, grew up on a university campus and was influenced by some excellent teachers in my early years. I have the utmost respect for them. A good teacher is a noble person. #TeachersDay Bangladesh have gone into a test match without a single recognised pace bowler. An all-spin attack. Trying to remember when that last happened RT @BloodDonorsIn: #Patna\nNeed #Blood Type :  AB-positive\nAt : Uma Hospital, Kankarbagh\nBlood Component : Blood\nNumber of Units : 2\nPrimary… Looks like #Yahoo has an issue on its hands RT @bizpunditz: This #TeachersDay don't miss the chance to learn from some of India's best #entrepreneurs &amp; business leaders. For corporate… RT @BloodDonorsIn: #Jaipur, #Rajasthan\nNeed #Blood Type :  O-negative\nAt : Eternal Multispecialty Hospital, Near Jawahar Circle, Sector 8.… The pitch is unpredictable, the ball is seaming around a lot, the batsman seems incapable, his technique inadequate. #Brexit RT @BloodDonorsIn: #Karimnagar\nNeed #Blood Type :  AB-negative\nAt : Chalmeda Hospital\nNumber of Units : 2\nPrimary Number : 9652141424\nVia:… RT @BloodDonorsIn: #Jaipur, #Rajasthan\nNeed #Blood Type :  B-positive\nAt : Rukmani Birla Hospital CK Birla, Shanthi Nagar.\nBlood Component… RT @BloodDonorsIn: #Lucknow,  #UttarPradesh\nNeed #Blood Type :  Any group\nAt : SGPGI Hospital.\nNumber of Units : 3\nPrimary Number : 8400720… RT @BloodDonorsIn: #Ghaziabad, #UttarPradesh\nNeed #Blood Type :  B-positive\nAt : Family Health Care Hospital, Vasundhara\nNumber of Units :… Addresses of shelters at @mybmc for those affected by this terrible rain. Must Mumbai endure this every year? Wishing @chintskap a very happy birthday. Look forward to seeing you back in Mumbai. RT @BloodDonorsIn: #Bokaro, #Jharkhand\nNeed #Blood Type :  B-negative\nAt : Jain Hospital, Bokaro Steel City.\nNumber of Units : 2\nPrimary Nu… RT @BloodDonorsIn: #Ludhiana, #Punjab\nNeed #Blood Type :  B-positive\nAt : Guru Teg Bahadur Sahib Charitable Hospital, Model Town\nNumber of… RT @BloodDonorsIn: #Karimnagar\nNeed #Blood Type :  A-positive\nAt : Apollo hospital \nNumber of Units : 3\nPrimary Number : 9490222443\nPatient… RT @BloodDonorsIn: #Nagercoil\nNeed #Blood Type :  A1-positive\nAt : Hollycross Hospital \nBlood Component : Blood\nNumber of Units : 2\nPrimary… RT @SachinKalbag: Please consider 👇🏽 https://t.co/2thLbJxSnt Top corporate leader about a great brand, @bizpunditz https://t.co/2RauDdZVOZ RT @BloodDonorsIn: #Varanasi, Uttar Pradesh\nNeed #Blood Type :  A-negative\nAt : BHU Hospital.\nNumber of Units : 2\nPrimary Number : 09210472… It is dark and gloomy. The skies are full and they have begun emptying themselves over Mumbai...... RT @BloodDonorsIn: #Shivamogga\nNeed #Blood Type :  B-negative\nAt : Subbayya Hospital.\nBlood Component : Blood &amp; Platelets\nNumber of Units :… Never been a fan of one person being coach and selector. Players come to a coach with a problem. If they know that that knowledge could result in them being dropped, they may not be honest with coaches. #Misbah Well played to the great @M_Raj03 as she retires from T20 internationals. One of the pioneers. Looking forward to one final charge at the World Cup in 2021. @captainshanky Yes, hence the suggestion that they try to get stints for them. Like Zaheer Khan, Ishant Sharma has benefited enormously from a period away from the public gaze in county cricket in England. Post the IPL next year, India should look to find county assignments for Umesh Yadav, Navdeep Saini and Mohd Siraj India would have liked more from the top order. The form of KL Rahul is now a worry and he could struggle to hold his place against South Africa. 2-0 as expected. India's bowlers were too powerful, too relentless. And Bumrah was outstanding. Big plus the performances of Rahane and Vihari. And Ishant who is playing his best cricket for the last 18-24 months. RT @rekha_bhardwaj: I am not able to understand why there is so much drama in Music reality shows ??? RT @BloodDonorsIn: #Kishanganj\nNeed #Blood Type :  A-positive\nAt : Sadar Hospital.\nNumber of Units : 2\nPrimary Number : 9155082331\nSecondar… RT @BloodDonorsIn: #Salem\nNeed #Blood Type :  O-positive\nAt : London Ortho Hospital\nNumber of Units : 2\nPrimary Number : 9159367080\nSeconda… RT @BloodDonorsIn: #Dibrugarh, #Assam \nNeed #Blood Type :  Any group\nAt : Assam Medical College Hospital, Barbari.\nNumber of Units : 1\nPrim… RT @BhogleAnita: Thanks, @anish_sapre. Tell us what makes you go back to it again and again. I'd love to know. @bhogleharsha https://t.co/a… Ganesh Chaturthi chya saglyanna hardik shubhechha. Aaj modakancha hishob thevoo nakaa! Couldn't agree more! https://t.co/S9Eyr1Pq5B Good to see Deepti Sharma playing a big part at the end as the Western Storm win the Women's Super League in England. With Jemimah Rodrigues playing a couple of top innings too, it augurs well for India at the #ICCWomensT20 this Feb/March. India probably have enough already but the batting is being given a stern test. Kemar Roach doesn't get talked about as much as Archer, Bumrah, Rabada, Cummins etc but he loses hardly anything by comparison. RT @Sportingabhi: A replug &amp; some self promotion here but no better time to watch the phenomenal story of last night's Hattrick hero from w… @arsalan92 @BloodDonorsIn @The_NehaJoshi Thank you. That is for a different forum. And the fifth with the ball moving away from the right-hander... https://t.co/DZHWM6kdFX In his spell of 5-7 in the last test, he was swinging it in to the left handers and knocking over the stumps. Today he has moved it the other way and got 4-6!! Now a hat-trick! Bumrah is bowling at another level. Taking wickets for fun. @arsalan92 @BloodDonorsIn @The_NehaJoshi That is a horrible thing to say. Please delete this tweet. RT @BloodDonorsIn: #Patna\nNeed #Blood Type :  B-positive\nAt : Nalanda medical college hospital \nNumber of Units : 4\nPrimary Number : 993165… RT @BloodDonorsIn: #Jaipur, Rajasthan\nNeed #Blood Type :  A-positive\nAt : Metro Mas Hospital, Mansarovar.\nBlood Component : Platelets \nNumb… RT @BloodDonorsIn: #Bachupally, Telangana\nNeed #Blood Type :  A-negative\nAt : Sri Swastik Hospital, Nizampet road Near bachupalli chowrasth… RT @BloodDonorsIn: #Dehradun\nNeed #Blood Type :  AB-positive\nAt : C.M.I Hospital, Dehradun, #Uttarakhand\nBlood Component : Blood\nNumber of… RT @irbishi: One great strength of Hanuma Vihari is his patience. He seems to understand his game and his limitations very well &amp; forces bo… And a big thumbs-up for the hugely admirable Jason Holder as he gets his 100th wicket. Much joy for Ishant Sharma. Just as much joy for those watching. Some players are like that! A first test hundred. So so special. Played for the side's needs in the previous test and see, life does reward you sometimes for your selflessness. Well played @Hanumavihari RT @bhogleharsha: Vijayalakshmi gaaru, mi abbayi chala baaga aadtunnadu. #HanumaVihari Ishant looking good. Continues to flower in all respects. @captainshanky @gaurav_sundar But the question is: how does he find a spot in the top 5. For that, we will have to wait and see! @captainshanky @gaurav_sundar Very tempting to ask him to move up in India. Our history is full of middle order batsmen converted into openers. For every Sehwag who succeeded there were many who were lost . In an ideal development, Vihari plays in the top 5, Pant becomes good enough for 6 and Pandya goes to 7 @gaurav_sundar You can't play both Vihari and Pandya at the positions they are batting in now given there is also a keeper to accomodate because it will mean going in with three pure bowlers only There are so many ebbs and flows within a test innings. Hanuma Vihari has batted wonderfully to get into his 80s and suddenly it looks like there is no wind in his sails. But if he fights this phase, the flow will return. Hanuma Vihari is doing what good players do. Once they get a chance, they make it very difficult to drop them. Probably means that India play 2 spin + 2 pace in the home series When the opposition puts you in, has to bowl a spinner for 27 overs, you get 264-5 and have a bit of batting left, you've had a pretty good day Critical partnership between Vihari and Pant. This is the kind of resilience the lower middle order must show. And it is coming from two players making their future. It augurs well. @CricViz @cricvizanalyst Great...... Bit early? RT @BloodDonorsIn: #Varanasi, #UttarPradesh\nNeed #Blood Type :  Any group\nAt : Radix Hospital, Kakarmatta.\nNumber of Units : 2\nPrimary Numb… Would like to see Kohli dominate post-lunch Do you also have airports that you associate with late flights and long waits? You always play your key 7-8 players because they win you matches. They shouldn't be worried about selection unless they have an extended poor run or conditions are very slanted one way.. I see that structure returning in the 5 home tests. To continue, good sides have 3-4 other key players. For India, those are Rahane, Ishant, Shami and, if 2 spinners are used, Jadeja. That leaves 2 openers, a keeper and a no 6 (if only one spinner) all of whom are work in progress at varying levels of promise. https://t.co/BnNcaX5YvK India's test team is built on four pillars. Kohli, Bumrah, Pujara and Ashwin. India had to rediscover the strength of one of those in Australia. I hope we keep our pillars strong. Was very enjoyable taking #TheWinningWay to the unassuming achievers from after-sales at #TVSMotors. Wish them more success. @BhogleAnita RT @BloodDonorsIn: #Dehradun, #Uttarakhand\nNeed #Blood Type :  AB-negative\nAt : Shri Mahant Indiresh Hospital\nNumber of Units : 2\nPrimary N… RT @BloodDonorsIn: #Tirupati\nNeed #Blood Type :  AB-positive\nAt : Ramadevi Hospital\nNumber of Units : 1\nPrimary Number : 9494830599\nSeconda… RT @BloodDonorsIn: #Shivamogga\nNeed #Blood Type :  A-positive\nAt : Megan Hospital\nNumber of Units : 2\nPrimary Number : 9611435866\nVia: @svr… RT @BloodDonorsIn: #Patna\nNeed #Blood Type :  A-negative\nAt : Mahaveer Cancer Sansthan, Patna\nNumber of Units : 2\nPrimary Number : 99340438… RT @BloodDonorsIn: #Jammu \nNeed #Blood Type :  AB-positive\nAt : GMC Hospital. \nNumber of Units : 2\nPrimary Number : 7006949895\nPatient : So… Choice of safety gear like chest guard, arm guard, helmet gives a player the confidence to face that very hard ball at 150 Kmph. Protection is paramount. Not just in cricket but in life too. Join me on this new episode of #FinanciallyFitterFridays. Download the @chqbook app today https://t.co/nhbqzhBQ9m RT @gaGunNarang: #NationalSportsDay gets sweeter. @elavalarivan wins her first senior World Cup🥇on the day GNSPF’s efforts are recognised t… Tirafik vaisich,hornan vaisich\nAatooan vaisich,ghusna vaisich\nZubaan woich,lateefe vaisich\nChai woich,chand biskut vaisich\n\nLekin gaadiyan alag,andaaz alag\nTheateran alag,pikcharaan alag\nLogon ke khwaaban alag\n\nGaadi mein baithke sochraun main\nHyderabad vaisich ya Hyderabad alag Sun liya bade bhai. Gaane me \"haulfit\" lafz aa sakta, kabhi nai socha tha. Ab Hyderabadi shaayari shuru karinge https://t.co/19pLVdvGlR RT @BloodDonorsIn: #Shivamogga\nNeed #Blood Type :  B-positive\nAt : Government Hospital.\nNumber of Units : 3\nPrimary Number : 9611435866\nVia… RT @BloodDonorsIn: #Siliguri West Bengal\nNeed #Blood Type :  Any group\nAt : Railway Hospital, NJP\nNumber of Units : 2\nPrimary Number : 6294… RT @BloodDonorsIn: #Bhopal #MadhyaPradesh\nNeed #Blood Type :  AB-positive\nAt : Red Cross Hospital\nNumber of Units : 2\nPrimary Number : 9893… @chinmaybhogle @shyam__bala Need to check whether his role at the NCA is the reason. But focussing on player development at U19 level has to be the primary objective. If players develop, results follow RT @BloodDonorsIn: #Koppal\nNeed #Blood Type :  A-negative\nAt : District Hospital.\nNumber of Units : 2\nPrimary Number : 9535900922\nVia: @svr… RT @BloodDonorsIn: #SriGanganagar #Rajasthan\nNeed #Blood Type :  O-negative\nAt : Govt hospital \nNumber of Units : 2\nPrimary Number : 637888… Remember it very well.  And very fondly. Never worked harder! https://t.co/pjXVsTdfsa @ShankarRamanat2 @mediagag Sample size? @SundarUvaacha No Sundar, both can co-exist. Numbers don't have to be at the expense of stories unless the stories have been subject to much exaggeration (which happens very often). And memories are subject to bias. Finally, instinct. Analytics sharpens it, doesn't dilute it. @mediagag It is my hypothesis, and your numbers could cast light on it, that the way a country plays its cricket, especially test cricket, is a reflection of the state of the country. Intuition says there should be a lag between the two. Is there a correlation in Pakistan cricket? Excellent Hassan. And Mazher. Highlights something I just posted on twitter: the difference between serious number-crunching and hypothesis-on-the-go. Look forward to more https://t.co/uxsFNFlVLn @shivam04040404 @KP24 @ICC If time is an issue and 120 balls delivered through 15 overs instead of 20 can make a difference, then maybe. Otherwise, why change? In cricket, analytics is taking us beyond the world of mere hypothesis, often the outcome of insufficient  viewing. We have all been guilty of this &amp; have been pulled up by insights that analytics is producing. I can only imagine the influence it can have in more critical spheres I must admit I know folks at @thoughtspot &amp; that is because I am fascinated by where the world of analytics is headed &amp; its role in generating new insights &amp; in decision making. Seeing it already in my area but is far more critical in other walks of life\n\nhttps://t.co/nuwqizJk8l RT @BloodDonorsIn: #Chennai\nNeed #Blood Type :  B-negative\nAt : Rela Institute and medical science \nNumber of Units : 10\nPrimary Number : 9… @mahoul_banao I normally retweet what @BloodDonorsIn do since they have a nice format and good following. Good that you have tagged them. RT @BloodDonorsIn: #Ranchi\nNeed #Blood Type :  O-negative\nAt : Medanta Hospital.\nNumber of Units : 1\nPrimary Number : 7290099707\nPatient :… @ranitd94 No, it is just a little club in the UK. Same as a club in Morocco or Peru. I have no attachment to it. I can understand people do given it was 134 years old but, to be honest, I don't have any. RT @BloodDonorsIn: #Belagavi\nNeed #Blood Type :  A-negative\nAt : KLES Hospital.\nBlood Component : Blood\nNumber of Units : 3\nPrimary Number… RT @BloodDonorsIn: #Agra\nNeed #Blood Type :  O-negative\nAt : Pushpanjali Hospital\nNumber of Units : 2\nPrimary Number : 7983452026\nVia: @Hem… There would be no reason for me to mourn the demise of a League One club in the UK. But for the fact that @bhaichung15 played there and gave us cause to remember it! @buryfcofficial https://t.co/lzBvuXBoBz I didn't! https://t.co/e9LhsEUO6y RT @BloodDonorsIn: #Kakinada\nNeed #Blood Type :  B-positive\nAt : Raghava Nursing Home \nNumber of Units : 3\nPrimary Number : 9963093009\nSeco… RT @BloodDonorsIn: #Ongole\nNeed #Blood Type :  AB-negative\nAt : Saiveena Hospital\nNumber of Units : 3\nPrimary Number : 8555953731\nPatient :… @sidvee Very nice Sid. It is a bit disconcerting to realise I've have been around this long when you consider that mine was probably one of the voices Elz heard in 91-92. And that when I was typing on manual typewriters, people were planting the seeds of something so much more valuable. RT @joshimanasi11: Tournament update: Wonderful few days at the BWF Para-badminton World Championships. Stoked to have won the Gold with ex… @ClaytonMurzello @Parthajosh @kushansarkar @sachin_rt @cricketwallah @mid_day Yes indeed, it is a different skill. But I find writing short copy a lot easier than longer articles. Maybe it is because in my early years I did a lot of 50-60 sec radio reports. The true reporter though, handles both (like batting on day 1 and day 4 of a test match!) RT @BloodDonorsIn: #Vizianagaram\nNeed #Blood Type :  O-positive\nAt : Tirumala Hospital.\nNumber of Units : 2\nPrimary Number : 9348480649\nVia… RT @Abhinav_Bindra: Over the last couple of years a lot of our Tokyo bound athletes have enabled us to remain aware of what the future can… Hang on. Hang on. He's broken back. Wow! https://t.co/zqL7Ro6jhx The dream might be fading for Sumit Nagal but enjoying his spirit. Proud of you @nagalsumit @Parthajosh Depends on whether you want to see the pluses..... @adityakanungo1 Rather than sat it, you must try and read, no? And across the page, Shivani Naik with a lovely deconstruction of PV Sindhu's shot making. Been a good morning, the coffee was good too! https://t.co/xPqsPRI6as If you want to know what a top reporter does when the time difference is against him read Sandip G in the Indian Express. In an era of 300 word articles, he has filled a page in a broadsheet with no advertising. And made it very readable. No pathetic click-bait, just journalism RT @BloodDonorsIn: # Dibrugarh #Assam\nNeed #Blood Type :  B-positive\nAt : JJ Memorial Hospital\nNumber of Units : 2\nPrimary Number : 9957264… RT @BloodDonorsIn: #Kakinada\nNeed #Blood Type :  B-positive\nAt : Sitarama Nursing Home.\nNumber of Units : 2\nPrimary Number : 8639083008\nIll… Since the PM was in France, a story from long ago, when a foreign minister found time to speak to a student in Paris and our family connection to him and to the French language. @bhogle \n\nhttps://t.co/xcKKJvDUQo RT @bizpunditz: Marico founder @hcmariwala shares his experience on innovation in staff functions like HR &amp; Finance. For corporate access t… RT @beastieboy07: So unfair that Joel Wilson is being castigated as a villain after he’d had a great Test &amp; finished 7-1 against DRS. Crick… RT @AWSStats: 10th wicket partnership in the 2nd innings that is higher than team's 1st innings total in a Test:\n120 R Duff/W Armstrong Aus… RT @BloodDonorsIn: #Puducherry\nNeed #Blood Type :  O-negative\nAt : Kathirkamam Hospital, Kathirkamam\nNumber of Units : 3\nPrimary Number : 9… RT @BloodDonorsIn: #Shivamogga\nNeed #Blood Type :  A-positive\nAt : Max Hospital\nNumber of Units : 2\nPrimary Number : 9845869606\nVia: @svrag… @othergandhi @benstokes38 @ShaneWarne I did! The structure of the points system means India should be looking to pocket 120 points from this series. The way India played this test suggests that will be the case Bumrah's performance is an indicator of how quickly he adapts. He realised he was rusty in the first innings, worked it out and produced a dramatic result in the second. #Champion @iamvaseem Yes, correct I didn't tweet on this game because I was unhappy at the time and I didn't want that to influence anything I might say. https://t.co/G3HqQ9ICam England showed yesterday, and New Zealand are showing today, that a game is always open. Would be happy to read informed views on these because I am just an observer and not an expert. In recent times, two brands I was proud of, and was an active customer of, have either failed or seem headed there. #CafeCoffeeDay and #JetAirways.  Hopefully, other entrepreneurs will learn and create great Indian brands that my great grand-children will be able to use. Having said that it bothers me that not enough big Indian entrepreneur driven brands have sufficient longevity. It worries me that growth, and continued success, seems linked to proximity to political power. Also the trend to take money out of the enterprise for a personal nest Very happy to see @EconomicTimes giving so much importance to the start-up space. My view is that the extent of entrepreneurship is an indicator of confidence in society. May it long be that way RT @BloodDonorsIn: #Karimnagar\nNeed #Blood Type :  A-positive\nAt : Prathima hospital\nNumber of Units : 2\nPrimary Number : 9963802505\nVia: @… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  O-positive\nAt : Andhra Hospital\nPrimary Number : 9299993134\nPatient : 1 month baby\nVia:… RT @BloodDonorsIn: #Raipur Chhattisgarh\nNeed #Blood Type :  AB-positive\nAt : Shri Balaji Super Speciality Hospital., Mowa\nNumber of Units :… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  A-negative\nAt : Vijaya Super Speciality Hospital, Suryarao Pet. \nNumber of Units : 2\nPri… RT @Edged_and_taken: The praises will be (rightfully) sung for Ben Stokes. But let Jack Leach’s contribution not be forgotten. Sometimes it… @yogi__r7 @NChenamarla Auna? Inkemi telusu meeku? Nenu Telugu nerusukonnanu kaani maajhi matrubhasha Marathi aahe. Class eventually rises to the top. #Rahane @MitchellGlenn But now that he has said he is okay, I guess it is irreversible @MitchellGlenn He shouldn't have had to if people had taken the trouble! You would have, Glenn. Afrikaans. Pronounced Laboo-skakh-nee https://t.co/NoAz1m4Fjj RT @chinmaybhogle: This innings from Stokes could change the way teams approach a similar situation - where a big-hitting batsman is playin… You always have a second innings in life. Even if you have made 67 all out. That is what test cricket has always told us. You never never give up. RT @mohanstatsman: What a year for Test cricket!\nKusal Perera (153* at Durban in Feb) and now Ben Stokes (135* at Leeds in Aug). \n#epic\n#As… One of the great innings you will ever see. England won it as much as Australia lost it. There is no greater sport than test cricket. May it long survive. Headingley. Botham. Stokes. Sits comfortably. #Ashes Is there any greater spectacle than live sport..... Dropped a catch, missed an easy run-out, took a terrible review and wasted it. #Australia RT @chinmaybhogle: That fumble + the terrible and unnecessary review taken earlier. Australia isn't a team known for crumbling under pressu… Doesn't make up for bad umpiring https://t.co/H5ssRQlxOZ Always, always, keep your review. I never thought I would say that an Australian side would choke in the field No 10! https://t.co/M8g43A2jHq RT @BloodDonorsIn: #Jhansi\nNeed #Blood Type :  AB-positive\nAt : Sudha Nursing Home\nNumber of Units : 2\nPrimary Number : 8075639532\nVia: @sh… This is already one of the great innings of our times. @benstokes38. And he has with him someone who should strictly be batting at no 1, ahead of Broad. #Ashes still open. RT @virenrasquinha: TTY in QF, Chen Yufei in SF and Okuhara in final - 3 absolutely top wins against top 5 players. What an absolutely dese… @tunkuv @cricketaakash Every country had them. It is just that some complaints commanded a wider reach! And take a bow Pullela Gopichand. What a coach. Master. When you start playing a sport, these are the moments you dream of. #BWFWorldChampionships2019 @Pvsindhu1 This has to be the most commanding performance by an Indian athlete, certainly in living memory. 21-7, 21-7. What a star @Pvsindhu1. Great moment for Indian sport. What a day. Proud. World Champion on the way. @Pvsindhu1 Yes, first game! https://t.co/35zmHmhbyA On fire @Pvsindhu1. 21-7 first set in the semi-final. 21-7 first set in the final There you go. This might be the fourth innings but is only a fourth morning track. If England hold their nerve, should win it. https://t.co/VByGj5r42O RT @BloodDonorsIn: #Moradabad\nNeed #Blood Type :  O-negative\nAt : Teerthankar (TMU) Delhi road \nNumber of Units : 2\nPrimary Number : 639836… @SkyCricket @nassercricket Very nice. Like the way the informal digital style is walking alongside the more formal broadcasting avatar without encroaching on each other. RT @BloodDonorsIn: #Vellore\nNeed #Blood Type :  B-positive\nAt : CMC Vellore \nNumber of Units : 2\nPrimary Number : 9561437801\nSecondary Numb… RT @BloodDonorsIn: #Mysore, #Karnataka \nNeed #Blood Type :  O-positive\nAt : Chandrakala Hospital, Jayalakshmipuram, #Mysuru\nNumber of Units… Enjoying this. If you have missed watching it @MichaelVaughan and @collinsadam tell you the story of the day wonderfully https://t.co/kpafBN3fQ2 RT @BloodDonorsIn: #Vizag\nNeed #Blood Type :  O-positive\nAt : Star Pinnacle Heart Centre\nNumber of Units : 2\nPrimary Number : 8328416301\nPa… RT @BloodDonorsIn: #Karimnagar, #Telangana\nNeed #Blood Type :  AB-positive\nAt : Chalmeda Anand Rao Institute of Medical Sciences\nNumber of… @irbishi @timwig Ah, a former fast bowler sparing a thought for batsmen! @atulkasbekar Watched briefly. There was only one team playing. Then cricket drew me back So looks like a restart for #RCB @RCBTweets. Worked for @DelhiCapitals last year. Hopefully Bengaluru can have something to look forward to this year. @coolestbab2006 @LordVolddemort You people seem to have a lot of time to let your mind wander! I have known the young man who wrote it for many years and I thought it was very good. Too many people drawing conclusions from virtually no data An article on a lawyer who was a politician. By a fine young lawyer. https://t.co/OuvJuE6Om1 That is very kind of him. Thank you. https://t.co/QGkowBPSMU @KrishnaMyGod @staranirudh @drewhou85574203 @marwyn_vinay @spectatorindex Thanks @staranirudh @KrishnaMyGod @drewhou85574203 @marwyn_vinay @spectatorindex Leave me out of this. It is a bit rude to tag people into your arguments. RT @ProfDeano: Generally, Today’s players go hard at the ball.. in the past we would let the ball come to us. But the old adage.. watch the… Beautiful track to bat on at Leeds. I wonder though if England are thinking positive enough. Two substantial partnerships and this game is open. But they need to believe in it. #Ashes I wonder if the frequency of batsmen getting hit on the head will lead to a return of the old technique against pace which allowed you to sway out. Or is the white ball approach so entrenched that it will become difficult to adapt? @nassercricket @GraemeSmith49 @ProfDeano And here is another that I got on my school WhatsApp group. Black and white, my favourite, on a monsoon day @HpsBegumpet https://t.co/nIPg8fXzQg https://t.co/m7qyz5Yv40 Beautiful. Looking gorgeous. https://t.co/tQ1l4L6Muw Now that is how you dominate a big game. 21-7, 21-14. Sign of a top player. @Pvsindhu1. Go for gold now! Really powerful display from @Pvsindhu1 so far. Not far from a final now...... RT @Maheshbhupathi: First time in over two decades we have 2 boys in the men’s SINGLES event at a Grand Slam @PrajneshGP @nagalsumit @usope… Very saddened to hear that Shri Arun Jaitley has passed away. Apart from the many hats he wore, he was a cricket lover. Too soon. Only 66. RT @ClaytonMurzello: August 24, 1971 - a red letter day in Indian cricket history - first Test win in England. A priceless Sportsweek issue… No. Watching it. Following it closely. https://t.co/5uaKuY6V3K @RaunakRK @sambitbal Now, now young man. Remember you always stay on the right side of the boss!! @Edged_and_taken To be honest, I hadn't noticed the \"these days\"! If you want to add left handers, Bevan, Katich.... @Edged_and_taken Ian Chappell, Bob Simpson, Keith Stackpole... @ElwynGwilym And the South African Aussie He may not be a Smith yet but Labuschagne is doing a decent impersonation #Ashes2019 @BBCWSSport @dizzy259 @jimmaxcricket @bbctms @AlisonMitchell @abcgrandstand 9/10 for you Jim! @Sychlops @aks_chhaya Cool Actually you are right. My father, who was a teacher, would have been disappointed! There should have been a comma. https://t.co/X4xvqH1rLN Looking at current batting displays, it seems a great time to be a spinner. If picked. From time to time people send me this tweet hoping to offend me. Instead I am amused because I never said it. The person who did scored many hundreds and if Brian knew who it was, he might have said \"thank you\". So often we react to who said something rather than what was said! https://t.co/KoCYe1TX75 RT @deeputalks: @bhogleharsha Going by bowling strike rates, 2019 currently stands the best year since 1922 when only a solitary Test was p… One generation builds on another. Sindhu will agree that that @NSaina was the torchbearer https://t.co/qGMkyBsDWf Question for stats guys: is there any other period when batting has looked a more difficult profession? RT @NSaina: still can’t believe 2 match points which  the umpire overruled in the second game . And the umpire tells me in the mid of secon… Well done @Pvsindhu1. Look forward to more in the semis. Proud of you. Joe Root will be no 4 in the next test. Unless Jason Roy beats him to it! #Ashes @Dramaibaaz Dangerous to draw conclusions from inadequate facts Didn't feel like it. Won't feel like it today either. https://t.co/PnriTIbCqh @downthegroundtw Maybe one day! @robelinda2 You have to be slightly mad (even if delightfully so!) to do all this!! People tell me I am nuts about cricket, I probably don't even qualify in your league! RT @BloodDonorsIn: #Kozhikode #Kerala\nNeed #Blood Type :  AB-positive\nAt : Beach hospital\nNumber of Units : 2\nPrimary Number : 9846829458\nS… RT @vikramsathaye: He has completed it !!! What a hero @timesofindia @IndianExpress @htTweets @mid_day . He is a lesson in what human being… Looks like a pretty solid comeback from New Zealand. It has been a low scoring but interesting series. But, like everywhere else that cricket is being played, pity about the rain! The best batsmen always know how to pace their innings. They know when to take quick singles, which bowlers to work around. Just like this, you need to pace your investments over the long term. Find out more on this episode of #FinanciallyFitterFridays. Download @Chqbook today! https://t.co/so2QHVKYxy Greetings on the auspicious occasion of #Janmashtami. May it be a happy day. May it lead to more happy days. RT @BloodDonorsIn: #Bhopal #MadhyaPradesh\nNeed #Blood Type :  B-positive\nAt : AIIMS Hospital.\nNumber of Units : 2\nPrimary Number : 98268100… @cricketwallah @tunkuv I guess that is true of every tournament that has a league phase and a play-off. @robelinda2 How long does it take you to find and edit something like this? RT @BloodDonorsIn: #Faridabad #Haryana\nNeed #Blood Type :  B-negative\nAt : Asian Institute of Medical Sciences, Faridabad\nNumber of Units :… Six for Archer. Root's captaincy has just been made very simple. 'Throw the ball to Archer'. \n\nBy the time the Ashes are over, I hope they aren't singing Ashes to Ashes, Bowlers to Dust. If Jofra don't get there, Archer must! Good you brought it up @irbishi. https://t.co/dBNipvrjcY RT @BloodDonorsIn: #Patna, #Bihar\nNeed #Blood Type :  O-positive\nAt : Siddhi Multispeciality Hospital, Kankarbagh, P.C. Colony, Hanuman Nag… RT @BloodDonorsIn: #Meerut, #UttarPradesh\nNeed #Blood Type :  O-negative\nAt : Silver Cross Hospital. \nNumber of Units : 2\nPrimary Number :… @guha_sunee @trinityG1990 Think you should apologise to him for what you said 136-2 to 145-5. That is what the best do. They turn games https://t.co/XBBzud9cxQ Can see Archer bowl all day. Brilliant. Now hoping to see Bumrah in flight. The third test match of the day starts shortly. If it is a normal test wicket, expect India to play five bowlers. Four only if it is a spicy track, like some recent ones have been. Expect this: Agarwal, Rahul, Pujara, Kohli, Rahane, Pant, Ashwin, Jadeja, Shami, Ishant, Bumrah RT @BloodDonorsIn: #Trichy, Tamil Nadu\nNeed #Blood Type :  B-negative\nAt : Kauvery Hospital, Tennur, #Tiruchirappalli.\nNumber of Units : 3… Could watch this for as long as they chatted. Good to see that look of awe on @imVkohli. And @BCCI put out the whole thing. Don't edit this one. Have had a few chats with @ivivianrichards myself and found it an arresting experience. https://t.co/BkG9zzp1Oz A very happy birthday to my dearest friend and pronunciation guru. @alanwilkins22. Lost track of the no of games we've done together. Wish you many more Shri Wilkinson! @bharathsaphr47 @ashwinkkrish @imda67032074 Can you pls leave me out of this? It prevents me from reading what others have to say. Thanks RT @BloodDonorsIn: #Suryapet\nNeed #Blood Type :  AB-negative\nAt : Area Hospital\nNumber of Units : 1\nPrimary Number : 8885126123\nVia: @joyde… RT @Independent: Brazil’s Amazon rainforest is on fire https://t.co/UzmN19KRKB RT @BloodDonorsIn: #Dharwad\nNeed #Blood Type :  Any group\nAt : SDM Medical College Hubli Dharwad\nNumber of Units : 4\nPrimary Number : 95357… RT @BloodDonorsIn: #Madurai, Tamil Nadu\nNeed #Blood Type :  A-positive\nAt : Apollo Speciality Hospital, KK Nagar.\nNumber of Units : 2\nPrima… RT @BloodDonorsIn: #Rishikesh\nNeed #Blood Type :  O-positive\nAt : AIIMS Hospital. \nNumber of Units : 2\nPrimary Number : 9927767456\nPatient… RT @BloodDonorsIn: #Thiruvarur, Tamil Nadu\nNeed #Blood Type :  A-positive\nAt : Govt. Thiruvarur Medical College Hospital, \nNumber of Units… RT @paritoshZero: Urgently need someone who can be a blind student's writer for an exam in Marathi on August 26. Venue: Ruia College, Matun… RT @CoachHesson: Just to clarify as plenty of speculation about ........ I have not applied for the Pakistan Head Coach Role with @TheRealP… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  O-positive\nAt : Pinnamaneni Hospital, Gannavram\nNumber of Units : 1\nPrimary Number : 891… RT @BloodDonorsIn: #Bikaner #Rajasthan\nNeed #Blood Type :  O-positive\nAt : PBM Hospital. \nPrimary Number : 9982594793\nSecondary Number : 97… RT @AkbaruddinIndia: My Alma Mater-ever grateful 2 thee 🙏🏽 https://t.co/CYfp4ODh3F @ashwinravi99 You will also see the result of early Indian travellers in the Caribbean, in Mauritius, throughout eastern Africa and in the Cape regions of South Africa too. But yes, the Cholas were sea-farers and I heard a fair bit of Tamil in a day and a bit in Kuala Lumpur. There I actually have some sympathy. We are such a vast country and suddenly a name comes up when you are live and you go with your instinct. But not when you have had time to check. https://t.co/OR8evDANux Watched a travel show on the flight. There was the word \"Sullton\" again. Surely not too difficult to say \"Sooltaan\"! I find it a bit irritating that in the English speaking world they get French and Italian words right but couldn't be bothered trying with African or Indian words. Short but pleasant visit to Kuala Lumpur taking #TheWinningWay to #Airtel Achievers. Good to see their enthusiasm and success in these challenging times. @BhogleAnita What an interesting conversation this led to! https://t.co/vFE6jdsCHW The word for toilet is Tandas which is of course just one letter removed from the equivalent in Marathi. But gate is Pintu and I am wondering about the origin of that. https://t.co/vFE6jdsCHW I am fascinated by the Malay language and the origin of words within it. Putra and Jaya clearly have a Sanskrit base but Daftar exists too. And sometimes the words come from the phonetics. Like Ekspres and Limosin and Kastam. On the lookout for more RT @BloodDonorsIn: #Prayagraj\nNeed #Blood Type :  O-negative\nAt : Ayushi Hospital. \nNumber of Units : 2\nPrimary Number : 9839717946\nPatient… RT @bizpunditz: Team Bizpunditz wishes one of India's best business leaders, Infosys co-founder &amp; our esteemed speaker, Mr NR Narayana Murt… RT @BloodDonorsIn: #Varanasi, Uttar Pradesh\nNeed #Blood Type :  A-negative\nAt : Ram Krishna Mission Hospital, Ramapura Luxa.\nNumber of Unit… simti hui yeh ghadiyan...parbaton ke pedon par....kahin ek masoom nazuk si ladki... aap yun faaslon se...sham-e-gham ki kasam.... jaane kya dhoondhti rehti hain yeh aankhen....woh subah kabhi to aayegi....filmen aayin gayin, geet reh gaye. Aur phir Umrao Jaan aur Bazaar. #Khayyam Khudahafiz Khayyam sahab. Kai lambe safar guzare aap ke geet sunkar. Kuch khaas baat thi unme, aapki dastakhat thi har gaane par. Hamaare liye ek khazana chhod gaye hain aap. Parbaton ke pedon par.....aap ka bhi baseraa hoga. RT @cricbuzz: #RavichandranAshwin and #AjinkyaRahane have a point to prove come the West Indies Test series. Watch as @bhogleharsha takes s… RT @BloodDonorsIn: #Bhopal #MadhyaPradesh\nNeed #Blood Type :  AB-positive\nAt : Bansal Hospital \nNumber of Units : 3\nPrimary Number : 724740… RT @BloodDonorsIn: #Jajpur #Odisha\nNeed #Blood Type :  A-negative\nAt : Bhoomika Hospital, Jarka\nNumber of Units : 3\nPrimary Number : 797815… RT @BloodDonorsIn: #Rajahmundry\nNeed #Blood Type :  A-negative\nAt : Apex Hospital.\nNumber of Units : 1\nPrimary Number : 9490639359\nPatient… RT @BloodDonorsIn: #Lucknow, Uttar Pradesh \nNeed #Blood Type :  B-positive\nAt : Dr. Ram Manohar Lohia Combined Hospital\nNumber of Units : 2… RT @BloodDonorsIn: #Patna #Bihar\nNeed #Blood Type :  Any group\nAt : Paras HMRI Hospital. \nNumber of Units : 1\nPrimary Number : 8340300958\nS… RT @cricbuzz: 'Quality pace attack gives India an unprecedented edge' feels @bhogleharsha as he takes stock of India's pace battery as they… RT @T20WorldCup: The two #T20WorldCup trophies that teams will be vying for down under are in @bhogleharsha sights. We look forward to welc… You never know when opportunity comes. Sometimes we spend too much time complaining it doesn't (and don't recognise it when it does!). Heard a great definition of luck: being ready when opportunity strikes. Marnus Labuschagne is illustrating that so well. Is he lucky?Is he ready? It is 243 from 50 if the declaration came now. Not far away..... https://t.co/HADR7cydTB 80 in the next 15 overs. Set Australia 245 in 50 overs on the last evening. Could be a game there. #ENGvsAUS #Ashes RT @BloodDonorsIn: #Khammam\nNeed #Blood Type :  O-positive\nAt : Ushodaya hospital, Wyra Road\nNumber of Units : 2\nPrimary Number : 961105474… RT @BloodDonorsIn: #Vizag\nNeed #Blood Type :  A-positive\nAt : Apollo Hospital. \nBlood Component : Platelets \nNumber of Units : 2\nPrimary Nu… RT @BloodDonorsIn: #Jaipur, Rajasthan\nNeed #Blood Type :  O-positive\nAt : Eternal Multispecialty Hospital, Jawahar Circle.\nNumber of Units… RT @BloodDonorsIn: #Jhansi, Uttar Pradesh\nNeed #Blood Type :  O-positive\nAt : Jhansi Medical College Hospital.\nNumber of Units : 2\nPrimary… RT @BloodDonorsIn: #Lucknow, Uttar Pradesh\nNeed #Blood Type :  Any group\nAt : Charak Hospital, Dubagga.\nNumber of Units : 3\nPrimary Number… RT @BloodDonorsIn: #Ballari, Karnataka \nNeed #Blood Type :  A-positive\nAt : VIMS Hospital.\nNumber of Units : 2\nPrimary Number : 6305658626… A fourth innings hundred is special. And it has come from a very fine player. #DimuthKarunaratne. RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  O-positive\nAt : Ayush hospital\nNumber of Units : 4\nPrimary Number : 9948161718\nSecondary… RT @isro: Hello! This is Chandrayaan 2 with a special update. I wanted to let everyone back home know that it has been an amazing journey f… RT @BloodDonorsIn: #Patna\nNeed #Blood Type :  B-positive\nAt : Mehar Hospital Arya Kumar Rd And Nala Road, Machhua Toli\nNumber of Units : 2… RT @BloodDonorsIn: #Shivamogga\nNeed #Blood Type :  B-positive\nAt : Narayana Hrudayaalaya Hospital, Shivamogga\nNumber of Units : 4\nPrimary N… @KadambariM @MohammadKaif @wylywade And Kadambari, Kyra is such a pretty girl. RT @cricvizanalyst: In Tests this year, a wicket falls every 52.6 balls. That's the lowest figure since 1910. #Ashes @Cric_Writer @madversity Among those playing today, it is tough to find another with a more deceptive bouncer. Can't think of one. \"Deceptive\" the key. @madversity Among those playing today. From that era, maybe Andy Roberts. I used the present tense! Cheers. https://t.co/w1hQ2eZi7p @DavidW2035 Idiots RT @BloodDonorsIn: #Kolar, #Karnataka\nNeed #Blood Type :  O-negative\nAt : R L Jalappa Hospital, Tamaka.\nNumber of Units : 4\nPrimary Number… Haha, clever! https://t.co/VXM08xlfZZ Archer was bowling unpinned grenades at one end and Leach handpicked bouquets at the other! Archer ambles in, never too far from a smile, and he has now deceived two greats in Amla and Smith, with pace off the track. That spell is one you will never forget. And it tells you why test cricket is the greatest examination in sport. If there is anyone who bowls a meaner, crueller, better disguised bouncer than Jofra Archer, he hasn't been seen yet. Navroz Mubarak to all our Parsi friends. May there be more of you! RT @BloodDonorsIn: #Dharwad\nNeed #Blood Type :  Any group\nAt : SDM Medical College Hospital, Hubli Dharwad\nNumber of Units : 3\nPrimary Numb… RT @BloodDonorsIn: #Raipur, #Chhattisgarh\nNeed #Blood Type :  O-positive\nAt : Shri Balaji Super Speciality Hospital, Mowa.\nNumber of Units… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  O-positive\nAt : Sunrise Hospital, Seetharampuram, Vijayawada, Andhra Pradesh.\nBlood Comp… RT @BloodDonorsIn: #Jorhat #Assam\nNeed #Blood Type :  O-positive\nAt : A.G. Hospital\nNumber of Units : 2\nPrimary Number : 8638542706\nVia: @… RT @BloodDonorsIn: #Gadag, Karnataka\nNeed #Blood Type :  B-positive\nAt :  Gadag Hospital\nNumber of Units : 2\nPrimary Number : 8861897048\nVi… RT @cricbuzz: Managing important players well and winning ICC tournaments will define #RaviShastri's success in his second innings as coach… RT @cricbuzz: EVERGREEN MITHALI: On this day, 17 years ago, Mithali Raj's 10-hour vigil in Taunton saw her finish with the then record for… Finally got down to seeing #PlanetEarth2. The most thrilling, edge-of-the-seat stuff I have seen. Took me to places I couldn't have dreamt of going to. Even Bengaluru Blasters vs Mysuru Warriors is affected by rain! #KarnatakaPremierLeague In this two year period, India don't only play two T20 World Cups, they also play 4 tests in Australia, 10 against England (5 home and 5 away) and a World Test Championship final if they make it there. https://t.co/BuDWQxEYqp In a world that is so unpredictable, there was but one certainty. No surprise that Ravi Shastri continues as coach of the Indian team. RT @BloodDonorsIn: #Kishanganj, Bihar\nNeed #Blood Type :  A-positive\nAt : MGM Hospital. \nNumber of Units : 2\nPrimary Number : 8757609361\nPa… I enjoy meeting people from different walks of life. Spoke today (#TheWinningWay) to some fantastic achievers from #HDFCLIFE. Wonderful how we can draw parallels from our respective fields. @BhogleAnita @MrRehaanKhan @hk_oza Had mentioned it before the World Cup..... I am not surprised that Dickwella and Akila Dananjaya are doing well for Sri Lanka. I was surprised that they weren't in the World Cup team. @RohitPungalia @chqbook Your expectations from life need to be higher! 🙂 @RohitPungalia @chqbook Cool. @RohitPungalia @chqbook Have you stopped watching TV too, Rohit? Every great team in cricket has an equally good support staff; like coaches, physios, dieticians. Similarly in life, a financial advisor helps you make better decisions with your money. Join me on the latest episode of #FinanciallyFitterFridays. Download the @Chqbook App Today https://t.co/OHsWU1VO3N David Warner isn't looking too much like the batsman we have seen..... Shocked to hear of the passing of \nVB Chandrashekhar. Way too soon. Wish his wife and two daughters the strength to cope. Excellent comeback by England. Benefits of batting deep abundantly displayed. RT @cricbuzz: Cricket unites this nation and on Independence day @bhogleharsha, @ImZaheer &amp; @cricketaakash share some of their favourite mo… And it reads just as well, Derek. Just as beautiful. And is a testament to the many strong women of independent India who shaped our values and made us secular, liberal and proudly Indian. https://t.co/B88VnpVUhe Hope you enjoyed #CricBuzzLive @My11Circle. Was worth being up till late to bring it to you. @cricketaakash is picking up the milk on the way home. And @ImZaheer just turning in as usual!! No 43. Counter ticks over. It's the Kohli production line. It's smooth and it's efficient. And it's delightfully predictable. This is a half century of great class and composure from Shreyas Iyer. Loved the big shots but just as much, the easily taken singles. Has taken a lot of pressure off Kohli. This is a shot that Rishabh Pant will want to forget but shouldn't. It should remind him of how much ability he is wasting. He is a batsman-keeper, not the other way around, so his batting must speak for him even more. RT @chintskap: Remembering Shammi Kapoor. Left us 14th August 2011. Never a star like him! https://t.co/PMKV0fe3i8 A very happy Independence Day to all. May this be a year of togetherness and peace. #IndependenceDay2019 RT @timwig: Big shame this, but not a huge surprise: most T20 teams - and leagues - are losing money, even though the most successful are s… 255 is gettable on this surface but needed a good start. The fielding has already produced a wicket. Fabian Allen is among the best going. RT @BloodDonorsIn: #Hyderabad, Telangana\nNeed #Blood Type :  AB-positive\nAt : Save Hospital, Uppal Boduppal.\nNumber of Units : 2\nPrimary Nu… So it seems this is it for the #UniverseBoss and a great entertainer. @henrygayle. And he played this innings just the way we will remember him. #ChrisGayle Last 33 balls have produced 100 runs! This looks like a flat deck! Both batsmen hitting easily through the line. Since it is also Independence Day tomorrow, apart from looking ahead to the ODI, @cricketaakash, @ImZaheer and I will also look back at favourite matches from the past. Do join us. #CricBuzzLive Rain stops play in Galle. Rain delays start at Lord's. Rain forecast in Port of Spain! RT @BloodDonorsIn: #Trivandrum\nNeed #Blood Type :  AB-positive\nAt : Ananthapuri Hospital\nBlood Component : Blood\nNumber of Units : 4\nPrimar… RT @BCCI: India defeat England by 36 runs in the final to clinch Physical Disability World Cricket Series 2019 👏🙌 https://t.co/IaaNv6Jyvv @jats72 @joybhattacharj @mohanstatsman Must do some from Indian teams of the past RT @BloodDonorsIn: #Indore #MadhyaPradesh\nNeed #Blood Type :  B-negative\nAt : Choithram Hospital \nNumber of Units : 1\nPrimary Number : 9970… @NeilManthorp Lots of newcomers in the squad. Would love to know more about them RT @ajinkyarahane88: आपल्याला माहित असेलच, महाराष्ट्रात सध्या पूरामुळे प्रचंड वाईट परिस्थिती निर्माण झाली आहे. कोल्हापूर-सांगली येथे विशेष… Vikram Sarabhai. Great man. Left behind institutions for us. Nation-builder. RT @fwildecricket: I've written a book with @timwig about T20 cricket. \n\nThe book charts the rise of the 20-over format from a gimmick to t… @alanwilkins22 I remember that well. The test match in Antigua must have been particularly difficult. It was painful at the ground! Duniya bhar ke sabhi Mussalman bhaiyon or behenon ko Eid Mubarak. RT @KannanSharma: @BloodDonorsIn Amitabho Bandyopadhyay in Kolkata is AB negative needs 5 units of blood for surgery,please call (+91-72091… RT @BloodDonorsIn: #Kothagudem\nNeed #Blood Type :  O-negative\nAt : Govt Hospital.\nNumber of Units : 2\nPrimary Number : 7286827165\nPatient :… The latest I have been at a cricket match or a studio. Heading back at 04.20! Some days it is easy, some days it is long. Part of the job..... https://t.co/E7PpSq7ic4 RT @cricbuzz: India ride on a disciplined bowling performance to take a 1-0 lead in the ODIs. @bhogleharsha, @ImZaheer &amp; @cricketaakash ana… Anyone up? Join us on @My11Circle presents #CricBuzzLive shortly. With @ImZaheer and @cricketaakash So there is a feeling that a left arm spinner can't bowl to left handed batsmen? No Jadeja till over no 27 out of 46. Still waiting So, you see, there is no jinx or curse! https://t.co/P8AxU2Fmud RT @cricbuzz: #ShreyasIyer scored a fine 71 on return to India colours and on #CricbuzzLIVE @bhogleharsha, @ImZaheer &amp; @cricketaakash feel… RT @BloodDonorsIn: #Palakkad\nNeed #Blood Type :  O-negative\nAt : Ahalia Hospital \nNumber of Units : 2\nPrimary Number : 8508991903\nSecondary… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  O-positive\nAt : Ayush hospital \nNumber of Units : 3\nPrimary Number : 9347028605\nPatient… Masterclass in innings building from Virat Kohli. Live lesson for Rishabh Pant and Shreyas Iyer on how to do it. Hundred no 42 Opportunity for Shreyas Iyer to show he should be batting at No 4. I still believe that, where he stands now, Pant is best served being no 5 or even no 6. Will take the responsibility of building an innings away from him. It is an area that he seems to be work-in-progress in Virat is playing some really crisp shots today. Couple through the leg side have been fantastic RT @NPCI_BHIM: Stand with #Maharashtra in this difficult time and show your support by donating through #BHIMUPI #UPIForACause https://t.co… RT @RanaDaggubati: Get wordy, get nerdy. The Scrabble whizzes are coming down to India for WESPAC GOA - the most important Scrabble tournam… @sajathk Oops, saw it on Twitter and was amazed! @atulkasbekar Feel free. As long as you don't do cricket. RT @BloodDonorsIn: #Bhopal #MadhyaPradesh\nNeed #Blood Type :  O-positive\nAt : AIIMS Hospital.\nNumber of Units : 2\nPrimary Number : 70493616… RT @BloodDonorsIn: #Kakinada\nNeed #Blood Type :  Any group\nAt : Government General Hospital\nNumber of Units : 1\nPrimary Number : 9700707699… RT @BloodDonorsIn: #WestGodavari\nNeed #Blood Type :  AB-positive\nAt : Sathya hospital \nNumber of Units : 2\nPrimary Number : 9398333273\nVia:… @narayan140 @SanjoyGupta Not just my classmate in school but we started our careers together at Rediffusion. And we now discover we have a common love for coffee. RT @BloodDonorsIn: #Belagavi\nNeed #Blood Type :  A-positive\nAt : KLE hospital, Belagavi\nNumber of Units : 3\nPrimary Number : 8892913432\nPat… RT @BloodDonorsIn: #Pune\nNeed #Blood Type :  O-negative\nAt : Dr. D.Y. Patil Hospital.\nNumber of Units : 3\nPrimary Number : 8291339811\nIllne… RT @BloodDonorsIn: #Nalgonda\nNeed #Blood Type :  O-negative\nAt : Nalgonda Government Hospital\nNumber of Units : 2\nPrimary Number : 90326079… @joybhattacharj Haha! It is an acquired taste! @mayuragarwal55 Can you tell me more because I know nothing about this. RT @SanjoyGupta: @bhogleharsha Hey word nerds, scrabble fiends, Words with Friends friends - this is a pretty cool Scrabble Festival in a v… @mayuragarwal55 What is that? Been a Scrabble enthusiast since I was a kid. Some friends are putting this together. Should be fun. https://t.co/tZpWsF8a7U I know you love cricket. But do you play Scrabble? If you do, there's an exciting Scrabble festival in Goa this October. And you can be part of it. https://t.co/77P5ecsUWU\n\nhttps://t.co/f8LXBJ9koE Yes, hopefully we can see a bit more..... https://t.co/764edJQEvP RT @BloodDonorsIn: #Bokaro #Jharkhand \nNeed #Blood Type :  A-positive\nAt : General Hospital\nNumber of Units : 2\nPrimary Number : 9066024980… RT @BloodDonorsIn: #Eluru\nNeed #Blood Type :  B-negative\nAt :  Ramesh Hospital\nNumber of Units : 2\nPrimary Number : 7569587337\nVia: @Karuma… RT @joybhattacharj: Great things are happening in Indian Volleyball.  India downed Australia 3-1 in the Asian U23 Men's Volleyball Champion… RT @BloodDonorsIn: #Guntur\nNeed #Blood Type :  O-negative\nAt : Mangalagiri NRI Hospital \nNumber of Units : 3\nPrimary Number : 75693 21544… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  A-positive\nAt : Nagarjuna Hospital, NTR Marg\nNumber of Units : 2\nPrimary Number :  70136… RT @BloodDonorsIn: #Jaipur\nNeed #Blood Type :  A-positive\nAt : Mahila hospital \nNumber of Units : 2\nPrimary Number : 8058113738\nSecondary N… RT @vikramraghavan: Gopal Sankaranarayanan writes passionately, vividly, and poignantly about @shamnad Basheer. This is a rich account of a… RT @BloodDonorsIn: #Ahmedabad #Gujarat\nNeed #Blood Type :  B-negative\nAt : Civil Hospital\nNumber of Units : 2\nPrimary Number : 76654 53777… RT @BloodDonorsIn: #Kakinada\nNeed #Blood Type :  B-positive\nAt : Siddhartha Hospital\nNumber of Units : 2\nPrimary Number : 8639172231\nVia: @… RT @BloodDonorsIn: #Guwahati, #Assam \nNeed #Blood Type :  AB-negative\nAt : Guwahati Medical College Hospital\nNumber of Units : 5\nPrimary Nu… RT @BloodDonorsIn: #Guwahati, Assam \nNeed #Blood Type :  O-negative\nAt : Guwahati Medical College Hospital\nNumber of Units : 3\nPrimary Numb… RT @RicFinlay: With M Morkel, JPDuminy, ABdeV, DSteyn and HAmla moving on in recent times, #RSA have lost the experience of 49,706 runs and… Big tournaments are not won overnight. They need solid planning and the right players. Similarly, in life you need to plan for your goals and make the right investments to achieve them. Join me on this new episode of #FinanciallyFitterFridays. Download the @Chqbook App today! https://t.co/7gFhjIbyxW Very disappointing day in Guyana. Now to Trinidad. Hopefully good weather and a good surface. RT @cricbuzz: Proteas say goodbye to another legend! The great #HashimAmla has surprised the world with his announcement to retire from all… This is poor. Bright sunshine and no play. So clear message that Shreyas Iyer is no 4 going ahead and KL Rahul will be the 3rd opener. RT @prakashiyer: Going through old files, discovered a copy of the  in-house magazine of HLL Madras branch. Circa 1986. In it is news of a… The Mighty Hash retires. Brought class and dignity to cricket. And one of the best we could hope to see. The world speaks so well of you and looks up to you. Go well, champion @amlahash RT @BCCI: It's all clear here in Guyana.\n\nToss at 11 AM local, 8.30 PM IST. Play to start at 11.30 AM local. It will be a 43 overs a side g… RT @LiveLawIndia: Legal Scholar And IDIA Founder Professor Shamnad Basheer Passes Away \nRead more: https://t.co/zgIb8zGR3z\n#ShamnadBasheer… Such a sad day. The brilliant, humane Prof Shamnad Basheer is no more. He gave so selflessly, worked tirelessly to get disadvantaged people access to quality legal education. Why are good people going early?? So many people will remember him fondly and with gratitude Raining in Guyana so opportunity to talk about issues in Indian cricket. Join us https://t.co/7dedwOsmjW @Inspector_raj @akashbanerjee Do read my tweet carefully @quiz_boi Hope she finds someone to help RT @quiz_boi: There's a visually impaired friend of mine  in Mumbai who needs a scribe to write for her in the SBI Asst. Exam on this Satur… Less than a month ago, India were playing the semi-final of the World Cup. For viewers, context is important but for the players this is still the pinnacle of the game. Sometimes this is where you get amazing performances. On #CricbuzzLive 1830 with @ImZaheer and @cricketaakash @vchkrao @TheDravid_Fan Exactly. Glad you brought it up RT @BhogleAnita: The dragon fruit looks so complicated from the outside but is so easy and clean to cut. One of nature's many marvels! So h… @TheDravid_Fan Never ever said it Biraj. @aniruddha_rp Won't waste any time, hence the suggestion @SauSatya10 Can you leave me out of this Saurabh? Thanks @RSetlem He doesn't anyway. There isn't enough time. In white ball cricket, he will get a free hit. @manivannanr Yes that is a good observation but the overall benefit will be greater than the problems with the current method @deArunized Not enough time Delighted that the ICC is trialling this. It will be good for cricket, it will simplify things and make a simple judgement more accurate without stopping play. It will mean that the 3rd umpire will rule on every ball but it will only take him a few seconds. It will ensure that no-balls aren't by-passed and the umpire is free to focus in front of him rather than having to check the no-ball and quickly look up for the lbw or edge. Have long stated that the front foot no-ball call should be taken away from umpires. Technology allows you to judge quickly enough and every ball will be fair till called (you have time till the next ball to call it since the batsman doesn't benefit from the umpire's call anyway) @jamwalvikram I always thought Jammu was better off. Correct me if I am wrong. @ambade_akash @JiViral Nothing against you Akash. I don't understand politics and law well enough but I do know that development and opportunity is the way ahead for young India. Controversy is created by divisive people. Cheers RT @cricbuzz: ऋषभ पंत और दीपक चाहर की शानदार प्रदर्शन के बदौलत भारत ने जीता तीसरा टी-20 और 3-0 से जीती शृंखला।@bhogleharsha और @ImZaheer से… RT @bizpunditz: One of India's most successful #Entrepreneurs &amp; \n@makemytrip founder, Deep Kalra\non why #hiring the right candidate is extr… Where is the controversy in seeking good for our people? https://t.co/6aZSMD6r4i It is a wonderful time to be young in India. I see so much energy and ambition. It should be a wonderful time to be young in Kashmir and Ladakh too. I look forward to the opportunities that we can offer to our brothers &amp; sisters in Kashmir &amp; Ladakh. They too, like this fabulous young generation in India, must dream of careers, of prosperity, of success, not just in their state but all across India. It is our responsibility RT @AkbaruddinIndia: Leaving behind indelible memories.\n\nWe @IndiaUNNewYork will always cherish memories of her @UN \n\nFarewell Madam @Sushm… RT @BhogleAnita: Saddened by the demise of #SushmaSwaraj .A very fine orator and a rare politician who was tough, dignified and compassiona… @vivakshsingh You should have come and said hello. Fine when people are polite! RT @cricbuzz: Pant-Kohli make the chase a walk in the park with individual fifties. @bhogleharsha, @ImZaheer &amp; @joybhattacharj review the g… @Ajith_tweets @cricbuzz @joybhattacharj @cpankaj The food looks appetising. The guy on screen.....now that's a different story! Oh dear! Too young to go. Loved her feisty attitude. She did well for India. #SushmaSwaraj RT @BloodDonorsIn: #Coimbatore\nNeed #Blood Type :  AB-negative\nAt : ESI hospital \nNumber of Units : 2\nPrimary Number : 8925547302\nVia: @Bab… Absolutely. Do go ahead and apply. It is a wonderful project. https://t.co/bgpSuiDznh Play was late so we chatted about the World T20, about Dale Steyn, Russell,  about the World Test Championship..... https://t.co/vkNiZYLwqm The ball swings. The batsmen don't like it. Story of our game everywhere RT @BloodDonorsIn: #Patna\nNeed #Blood Type :  A-positive\nAt : Paras Hospital\nNumber of Units : 3\nPrimary Number : 9431216770\nSecondary Numb… @1PeterHutton If you are a Derby supporter, I guess you must have a second club to feel good about! RT @cricbuzz: West Indies aim to salvage some pride while India may look to experiment with the playing XI. \nBut, no need to experiment wit… RT @India_AllSports: Its official folks: Our boys Satwiksairaj Rankireddy &amp; Chirag Shetty move up by 7 spots to be World No. 9 in Men's Dou… RT @BloodDonorsIn: #Belgaum\nNeed #Blood Type :  O-positive\nAt : Venugram Hospital\nNumber of Units : 02\nPrimary Number : 9113271397\nVia: @Be… RT @anandmahindra: With all the other news that has us preoccupied, let’s not forget to keep track of #chandrayaan2 One step at a time, (on… RT @BloodDonorsIn: #Moradabad #UttarPradesh\nNeed #Blood Type :  O-positive\nAt :  Dr CP Singh gandhi nagar\nNumber of Units : 2\nPrimary Numbe… RT @BloodDonorsIn: #Patna #Bihar\nNeed #Blood Type :  A-positive\nAt : Manav Hospital, Bhootnath Road.\nNumber of Units : 1\nPrimary Number : 7… RT @BloodDonorsIn: #Faridabad #Haryana\nNeed #Blood Type :  AB-negative\nAt : Park Hospital, Sector 10, Faridabad\nNumber of Units : 3\nPrimary… RT @BloodDonorsIn: #Warangal\nNeed #Blood Type :  AB-negative\nAt : Prashanti Hospital.\nNumber of Units : 3\nPrimary Number : 9542790601\nSecon… RT @VVSLaxman281: Congratulations @DaleSteyn62 on a fantastic Test career. Test Cricket will  miss you , but I cherish the times we played… RT @sachin_rt: Wishing you all the very best for the future @DaleSteyn62. You always challenged batsmen to bring their A-game to the ground… And time to say goodbye to @Bazmccullum on the playing field. Great career and such a large influence on the world game. Now, another generation will benefit from your approach and your principles. See you soon. @haroon_omar44 Maybe you have been too busy to read One of the greatest of all time @DaleSteyn62 says goodbye to test cricket, a form of the game he adorned and enriched. He was one of the great sights of our game, gliding in, swinging the ball at speed. He has a place in history. There are experts, people far more knowledgeable, it is best to listen to them. https://t.co/0twPO7Xi5w @Imvenkii91 @iamchibi876 There you guys go comparing again! @GabbbarSingh The smarter guy always gets it first! Absolutely brilliant from #NathanLyon. Support bowler in the first innings, rises to be matchwinner in the second. Plays both roles so well. Astonishing turnaround to this test match. As in life, test cricket always allows you a second chance and Australia have grabbed it. #Ashes RT @Gampa_cricket: This prediction just after Tea on Day 1 is proving to be true. Lyon's spin and bounce too hard to handle for the English… A wicket can't change so dramatically. Australia just bowling better and England suffering from day 5 nerves at this stage. @MikeHaysman @robelinda2 Wonderful! RT @jon_selvaraj: This is a 'chef's kiss' story: Basketball player uses his girlfriend's urine to cheat on drug test but gets caught when r… More shootings in the US. Maybe India should offer to mediate between Trump and these trigger happy people there. I know we discussed that yesterday on @cricbuzz but it is true as well that his successes are getting disproportionate attention too. He just needs some time away from the spotlight to develop like other players https://t.co/8kW5YqiKxf Fabulous test match in prospect today #ENGvAUS. Australia have done enough to ensure only two results are possible. England will be disappointed if their batsmen can't bat out the day on a surface where Australia made 487-8 in 112 overs. A defeat will be shattering for them RT @BloodDonorsIn: #Trichy\nNeed #Blood Type :  O-positive\nAt : auvery Heart Hospital, Cantonment \nNumber of Units : 7\nPrimary Number : 9840… RT @ClaytonMurzello: My piece on Anant Setalvad...\nhttps://t.co/LKcriGVSW8 Interested to see how South Africa's new football manager styled leadership works. If the manager appoints the captain, as is stated, this will be the first formal move towards reducing the on-field captain's authority and concentrating it beyond the boundary. @KSetalvad Kevic, your father was an outstanding broadcaster and a dignified man. I wish all of you well and hopefully our paths will cross Called off. Going on air on #CricBuzzLive. Pace on the ball, just what the batsmen were searching for https://t.co/AGAVBLnHg7 From hunting Australia down to waiting, with a resigned air, for a declaration, England have seen it all in this game. Suddenly, runs look in short supply. The single gear batsmen are struggling Australia scoring freely now. What a stunning turnaround to this test match. Now, the pressure firmly on England, a scenario that might have been unimagineable at tea on day 1. This is a good start but it still isn't the easiest track to bat on. Hey @lpsahi your 2nd innings is looking good. I think we should just celebrate @stevesmith49 and enjoy watching him enrich batsmanship rather than begin comparing him to other contemporary cricketers. In our obsession with comparisons we dilute joy So Arun Lal tells us what has long been whispered in our cricket; that there was an attempt to organise a rebel tour to South Africa in the 80s.  https://t.co/tVuXiC50dL RT @BloodDonorsIn: #Tirupati\nNeed #Blood Type :  AB-positive\nAt : Swetha Hospital. \nNumber of Units : 2\nPrimary Number : 8106512907\nVia: @j… RT @BloodDonorsIn: #Jammu\nNeed #Blood Type :  B-negative\nAt : GMC Hospital. \nNumber of Units : 4\nPrimary Number : 8082177245\nPatient : Mohd… RT @BloodDonorsIn: #Agartala #Tripura\nNeed #Blood Type :  O-positive\nAt : GB Hospital.\nNumber of Units : 3\nPrimary Number : 9774326164\nSeco… RT @cricbuzz: After a sluggish series-opener, can the 2nd T20I provide some thrills? But no dearth of thrills and cricket chatter on #Cricb… Lead 141. If they drag it to 250-260, England will become the hunted on a last day pitch. Have to love test cricket. @Ashearly Even though it was bad news, thank you for letting me know. People like #AnantSetalvad played a big part in popularising cricket in the radio era. They were our eyes, our story-tellers. And Mr Setalvad was the best. Distinguished, dignified, a genuine cricket lover. And as good a commentator as any in the world. #RIP I was 17 when I visited Mumbai and my dream was to meet Ameen Sayani and #AnantSetalvad. I got their numbers from the telephone directory and called. They were so kind to me. I was completely tongue tied when I met Mr Setalvad and I think I wasted his time. As a young man, I imagined I was #AnantSetalvad and I would try to copy his style but could never get the lilt and authority that his distinguished voice produced. He was always the commentator I wanted to be. The brightest light in the finest era of radio broadcasting in India. @Ashearly Oh no. Was hoping it wasn't true RT @BloodDonorsIn: #Patna\nNeed #Blood Type :  AB-positive\nAt : Kurji Holy Family Hospital\nNumber of Units : 2\nPrimary Number : 8210018259\nV… RT @BloodDonorsIn: #Kurnool\nNeed #Blood Type :  A-positive\nAt : Viswa Bharati Hospital\nNumber of Units : 2\nPrimary Number : 8886289318\nSeco… RT @BloodDonorsIn: #Tirunelveli\nNeed #Blood Type :  B-positive\nAt : Govt Hospital.\nNumber of Units : 10\nPrimary Number : 8270607087\nPatient… And it is a sentiment that is echoed by everyone who has worked with him. Top man, Arun Lal. Always cheerful, always smiling. https://t.co/pimW5uE4mF @Ashearly Where did you hear this? RT @ClaytonMurzello: A Sir Frank Worrell collectible on the great man’s birth anniversary... https://t.co/nI0EAaL0Yz RT @ClaytonMurzello: Birth anniversary of the man who had the final say on @sachin_rt being picked for the 1989 tour of Pakistan as a 16-ye… Agar aapne match na dekho ho aur 5 mins me jo hua woh jaanana chahenge..... https://t.co/PT08XKIe64 Friendship Day apparently. No wonder the rain has Mumbai in a tight embrace! Late by seven minutes @cricketwallah but wishes for a year and beyond! That's cool. https://t.co/8HQvHBZPJD RT @cricbuzz: India make a heavy meal of the chase but still get over the line. Watch @bhogleharsha, @ImZaheer &amp; @cricketaakash review Indi… Afraid it turned out to be quite a forgettable game. Same surface tomorrow, hopefully the groundsman gets a bit of time with the rain around to tend to the pitch. Heavy weather for a gettable target. Thought it would be Pandey at 4 The wicket was damp but that was a strange performance from the West Indies batsmen. Now, reliant on a very powerful finish to have a chance. Loved watching Saini RT @BloodDonorsIn: #Dehradun\nNeed #Blood Type :  O-positive\nAt : Kailash Hospital, Haridwar Road, Jogiwala, Chowk, Dehradun, #Uttarakhand… Now in the #CricbuzzLive studio with @cricketaakash and @ImZaheer looking ahead to #WIvIND. Do join us from 19.30 for the usual fun and cricket combo Very interesting session of #TheWinningWay with senior managers at #IDFCFirstBank. Enjoy doing these @BhogleAnita @Vishal_theboss @atulkasbekar Rooney? I mean, I am not that much into football, but comparing Rooney and Henry??? RT @cricbuzz: Cricket is back in the USA as the West Indies host India for the 1st T20I! Watch @bhogleharsha, @imZaheer and @cricketaakash… RT @mohanstatsman: Since winning the #WT20 title on 3 April 2016 at Kolkata, West Indies' record in T20Is:\nPlayed 33, Won 11, Lost 20, Nr 2… @atulkasbekar The way he found space in a crowded box...... Wow! @mathurbajpai @BCCI @wada_ama @iccc @imVkohli @RaviShastriOfc @LaxmanSivarama1 They do England played very high quality limited overs cricket to win a World Cup. Now they are playing quality test cricket to inch ahead in the Ashes. Need another 150-175 though since they have to bat last on a track that is keeping a bit low occasionally. RT @BloodDonorsIn: #Lucknow #UttarPradesh\nNeed #Blood Type :  A-positive\nAt : St Joseph Hospital, Gomti Nagar\nNumber of Units : 1\nPrimary N… RT @BloodDonorsIn: #Coimbatore\nNeed #Blood Type :  Any Negative\nAt : PSG Hospital. \nBlood Component : Blood\nNumber of Units : 5\nPrimary Num… RT @GregBaum: Australia, England, umpire, commentators all thought it”not out”. But when it is shown to be out, it is “umpire’s mistake”.\n#… Excellent. Succinct. And @MichaelVaughan perfect as always, with my old Centerstage partner @collinsadam https://t.co/GS2Gx6WW4T @the_topspin @plalor Do the Swiss like beer as much? RT @BloodDonorsIn: #Ahmedabad #Gujarat\nNeed #Blood Type :  B-negative\nAt : GCRI, Civil hospital\nBlood Component : Platelets \nNumber of Unit… RT @BloodDonorsIn: #Honavar # Karanataka\nNeed #Blood Type :  O-positive\nAt : St Ignatius.\nNumber of Units : 2\nPrimary Number : 8050870467\nS… @the_topspin @plalor You know Lawrence, Peter is just a soft-hearted Aussie! @vikramsathaye @ofnosurnamefame @nikhilchinapa Ah, this queers the pitch for the original provocateur! @ofnosurnamefame @nikhilchinapa Interesting how conversations travel...... @abhi__agrawal Brands will not like a \"sponsored\" or \"advt\" put alongside it. But it is clear that it is a sponsored tweet. And so I put in \"unsolicited\" when I put out a tweet where I appreciate something but it is not sponsored. RT @chinmaybhogle: This is an incredible read. Action stars and their egos when it comes to fight scenes.\n\nThe Rock should be used to this… Thanks Vaibhav, Nikhil. I thought hard about this. The most respected media outlets in the world have advertising on their products. They take care that advertising isn't mistaken for editorial and that each has a distinct presence. I thought it is a fair principle to follow https://t.co/MOASFw2J3H Indeed. It was one of three memorable innings he played in Test cricket in 2018 https://t.co/DxTSaxOVxx When teams are level on the points table, it is Net Run Rate that changes a team's fortune. Similarly, Tax planning early in the year is crucial for your life’s match. Join me on this episode of #FinanciallyFitterFridays. Download the @chqbook app today &amp; get financially fitter https://t.co/rbEdh53zps A great innings needs a quality non-striker. A thought for Peter Siddle and Nathan Lyon! https://t.co/WtarL4poXA Steve Smith has shown his class. Again. Genuine great in test cricket. @MichaelVaughan Nice! RT @juniorwaugh349: @MichaelVaughan Test match bowling , village umpiring and poor batting. Dressed in white and subjugated for so long by anybody with a bat in hand, the ball now wears red and the bats start to quiver! This too is cricket! @commboxkid @SkyCricket I did, Bryan. And I was told that the world feed only starts at -2 and not -10 as you and I knew it to be. I specifically asked one of the producers. 245 years today since Joseph Priestley discovered \"dephlogisticated air\", which Antoine Lavoisier was to call oxygen! The snippets you come across in good newspapers! @thetimes. Love reading of how the great scientists discovered things! RT @diplal: My blog on a remarkable woman \n\nMalti's incredible journey\n\n https://t.co/EYsSMNX1FX via @wordpressdotcom RT @AmritMathur1: Tiger Pataudi  playing cycle polo ...multiskilled , 3 D player ! https://t.co/55XGRd0JD3 @s98180 @imonirban @HarshitRk1 @Rahul_bill @SkyCricket Ignorance is a powerful weapon! I have been told by @SPNSportsIndia that they only get the feed from @SkyCricket 2 minutes before play starts. https://t.co/CVH38lL465 @eshan_b @SkyCricket @SonyLIV @SonyTV Nothing to do with Sony I thought all captains took Stuart Broad's appeals with a pinch of salt! So disappointing having to watch the Ashes telecast in India with no toss or pitch report. Normally the host broadcaster puts out a World Feed 10 minutes before the start of play. @SkyCricket RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  A-negative\nAt : KL University Campus Hospital. \nNumber of Units : 1\nPrimary Number : 905… RT @BloodDonorsIn: #Ongole\nNeed #Blood Type :  B-negative\nAt :  Sridevi Hospital.\nNumber of Units : 2\nPrimary Number : 8688293373\nIllness :… @narayan140 @KannanSharma @aparanjape Ha! Private jet, no seat belts.... Keen to know what you think of this. https://t.co/EEZxkJIsBa I hope they enjoy reading it there @BhogleAnita https://t.co/zlrS3HBACb RT @cricbuzz: #RishabhPant is going to take up the gloves duty across formats for India in the absence of #MSDhoni. On @My11Circle presents… RT @cricbuzz: India resume their cricketing calendar with a tricky tour of the West Indies. Watch @bhogleharsha preview the much-awaited se… So the first IPL trade of the season. Leg spinner Mayank Markande goes to Delhi Capitals, Sherfaine Rutherford moves to Mumbai Indians. Expect a departure or two from DC after this. RT @RuPay_npci: From local street foods to fine dining and historical wonders to modern marvels, there's a lot #London has to offer. See so… @NikhilNaz True Nikhil, except that for all its rich history, very few are watching those series. Still can't get over why a successful entrepreneur should commit suicide. I do hope we find the real answer and not one that is easy to give. #VGSiddhartha. I wish #CafeCoffeeDay well and I will remain a customer.(#CCD reference unsolicited) RT @BloodDonorsIn: #Amalapuram\nNeed #Blood Type :  B-negative\nAt : Adarsha Hospital,Near surya nagar \nNumber of Units : 1\nPrimary Number :… RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  Any group\nAt : SGPGI Hospital. \nBlood Component : Blood\nNumber of Units : 5\nPrimary Number… Indian cricket needs to handle Prithvi Shaw carefully and set him on the right path. This is a kid who has achieved success the hard way. RT @BloodDonorsIn: #Allahabad\nNeed #Blood Type :  O-positive\nAt : Gita Hospital, Taigore Town.\nNumber of Units : 1\nPrimary Number : 70791 8… RT @BloodDonorsIn: #Rajahmundry\nNeed #Blood Type :  AB-positive\nAt : Yashwant Hospital. \nNumber of Units : 2\nPrimary Number : 7893040301\nVi… RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  O-negative\nAt : Apollo Hospital, Alambagh.\nNumber of Units : 2\nPrimary Number : 8009011333… RT @chinmaybhogle: Thread on the Prithvi Shaw suspension: A lot of athletes take similar medication. The substance in question - Terbutalin… What a pity you choose to interpret it this way. I have not blamed Kohli but suggested it should not have been brought up. There is life beyond the provocative! https://t.co/IvUxwKWBgS @BoriaMajumdar @Sanjog_G @cricketaakash These things are best done quietly,informally. The captain works closely with the coach, his view is important and should be sought. But if the CAC chooses to go against his view,it cannot be apparent to the public that the captain has been overruled. Just respect for the process I wasn't talking specifically about Virat. I can understand that if you are asked a question, you answer it but the moment the question was asked, somebody should have said that the selection process is on and so, it wouldn't be right for him to answer it. It isn't a good idea, when applications are being invited, for key influencers to be stating their preference. https://t.co/Ooh6lLiFFZ RT @BloodDonorsIn: #Ranchi\nNeed #Blood Type :  A-positive\nAt : Apollo Hospital.\nNumber of Units : 2\nPrimary Number : 9334453666\nSecondary N… I can't say I knew #VGSiddhartha but I had met him socially a couple of times. He introduced me to his ready-to-go brand of coffee (then called Drizzle, now FiltaFresh) which I still carry with me while travelling. He created an excellent brand. @captainshanky Though I recommend you look at each team's home and away cycle over the next 2 years to see which series are included. @captainshanky That is why there is a 2 year cycle. India also play 4 away to Australia and 5 away to England. I would love to see this reflected in viewership numbers and impressions. https://t.co/LttivcJzwm Are you excited by the idea of a World Test Championship? RT @BloodDonorsIn: #SOS\n#Thane\nNeed #Blood Type :  A-positive\nAt : Jupiter Hospital.\nNumber of Units : 02\nPrimary Number : 9836098917\nSecon… Shreyas Iyer makes a very valid point about how self-belief gets affected if you are constantly in and out of a team. This is an opportunity to give a batsman at no 4 a long run. RT @BloodDonorsIn: #Patna #Bihar\nNeed #Blood Type :  A-positive\nAt : Mahavir Cancer Sansthan\nNumber of Units : 2\nPrimary Number : 950434626… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  AB-positive\nAt : Andhra Hospital. \nNumber of Units : 2\nPrimary Number : 8019786213\nVia:… RT @bizpunditz: Watch some brilliant tips on managing your #career from @Unilever COO, Nitin Paranjpe. For corporate access to the #Bizpund… RT @BloodDonorsIn: #Cuttack\nNeed #Blood Type :  AB-positive\nAt : Acharya Harihar Cancer Centre.\nNumber of Units : 2\nPrimary Number : 958331… RT @BloodDonorsIn: #Bengaluru \nNeed #Blood Type :  Any group\nAt : Columbia Asia Hospital, Sarjapur Road, \nBlood Component : Platelets \nNumb… RT @BloodDonorsIn: #Kakinada\nNeed #Blood Type :  O-positive\nAt : Apollo Hospital.\nBlood Component : Platelets\nNumber of Units : 2\nPrimary N… RT @BloodDonorsIn: #Patna\nNeed #Blood Type :  B-negative\nAt : Patliputra Hospital, Patna\nBlood Component : Blood\nNumber of Units : 2\nPrimar… RT @BloodDonorsIn: #Trichy\nNeed #Blood Type :  O-negative\nAt : American Hospital. \nNumber of Units : 2\nPrimary Number : 8838324411\nPatient… Excellent thread! https://t.co/U6owOmQf63 RT @BloodDonorsIn: #Bhubaneswar\nNeed #Blood Type :  O-negative\nAt : AIIMS\nNumber of Units : 2\nPrimary Number : 9861855682\nVia: @imsumitrath… RT @BloodDonorsIn: #Bhiwadi Rajasthan\nNeed #Blood Type :  B-negative\nAt : Star Hospital. \nNumber of Units : 2\nPrimary Number : 9694098053\nV… RT @BloodDonorsIn: #Bhopal #MadhyaPradesh\nNeed #Blood Type :  AB-negative\nAt : National Hospital Arera Colony\nNumber of Units : 2\nPrimary N… RT @BloodDonorsIn: #Nagaon\nNeed #Blood Type :  O-negative\nAt : Nagaon Civil Hospital \nNumber of Units : 2\nPrimary Number : 8822290021\nSecon… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  B-positive\nAt : Sindhura Hospital. \nNumber of Units : 2\nPrimary Number : 9948445543\nPati… RT @BloodDonorsIn: #Bokaro\nNeed #Blood Type :  A-negative\nAt : General Hospital. \nNumber of Units : 1\nPrimary Number : 9128686545\nPatient :… RT @BhogleAnita: The monsoon is playing a strange game. Plenty of dot balls and then a series of sixers! RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  O-positive\nAt : Kamineni Hospital. \nNumber of Units : 2\nPrimary Number : 7013086620\nVia:… RT @BloodDonorsIn: #Pune\nNeed #Blood Type :  B-negative\nAt : Command Hospital. \nNumber of Units : 2\nPrimary Number : 8830903174\nVia: @vaibh… RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  O-negative\nAt : SGPGI Hospital. \nNumber of Units : 2\nPrimary Number : 8887842959\nPatient :… RT @BloodDonorsIn: #Ranchi #Jharkhand\nNeed #Blood Type :  O-positive\nAt : Rajendra Institute of Medical Sciences.Rajendra Institute of Medi… Another fast bowler calls it a day. Nothing but admiration for the mighty Lasith Malinga who is one of the greats of the white ball game. Big hearted, smiling and tough underneath the friendly air. A torch-bearer for the unorthodox. Mohammad Amir's decision to move away from test cricket ends a career defined by what might have been rather than by what was. A lesson here for the hugely gifted, which he is, that your choices off the field influence what you do on it. RT @bhogleharsha: Afraid Ireland's test match honeymoon is over. But it was such fun while it lasted. Big test of self-belief for @Irelandcricket today. Do they believe they can? Especially when such a big result lies ahead of them? Will be fascinating. @niallnobiobrien Backups are crucial in cricket &amp; in life. Not having the right kind of backup for a  rainy day might prove costly. Come join me on this episode of #FinanciallyFitterFridays to know how the right back up is pivotal to victory. Download @chqbook app today &amp; get financially fitter https://t.co/2XeoGWRBJL Absolutely. https://t.co/a79YFY002g Well, like a good honeymoon, they are finding ways of extending it! https://t.co/lfOV3YCDSD RT @Edged_and_taken: Flashback to 2001, to a \"Harsha Online\" episode on ESPN Star Sports where @sachin_rt was the guest, and the production… Afraid Ireland's test match honeymoon is over. But it was such fun while it lasted. RT @BloodDonorsIn: #Guwahati\nNeed #Blood Type :  Any Positive\nAt : Nemcare Hospital, Bhangagarh\nNumber of Units : 10\nPrimary Number : 97061… RT @AWSStats: This is England's first Test match at Lord's where the opposing XI has more first-class appearances (93 - Murtagh 72, Stirlin… RT @BloodDonorsIn: #Banda #UttarPradesh\nNeed #Blood Type :  O-positive\nAt : Medical College Hospital.\nNumber of Units : 2\nPrimary Number :… RT @BloodDonorsIn: #Gaya\nNeed #Blood Type :  O-positive\nAt : BD Hospital \nNumber of Units : 3\nPrimary Number : 8709244147\nPatient :  Soni k… RT @BloodDonorsIn: #Bhubaneswar, Odisha\nNeed #Blood Type :  A-negative\nAt : SUM Hospital.\nNumber of Units : 2\nPrimary Number : 7978353746\nV… RT @BloodDonorsIn: #Prayagraj\nNeed #Blood Type :  Any group\nAt : Jeevan Jyoti hospital\nNumber of Units : 3\nPrimary Number : 7678583156\nSeco… RT @BloodDonorsIn: #Pune\nNeed #Blood Type :  O-negative\nAt : Aditya Birla Hospital, Chinchwad\nNumber of Units : 2\nPrimary Number : 96658003… @NHoultCricket Finally read the whole thing. Excellent. When you sign in for a job, you sign in for the easy and for the tough. It is your response to a tough situation that tells the world who you are! https://t.co/79WR3vAuOp A night-watchman for an opener! Job descriptions are changing! I wonder what that tells the openers about the confidence in their ability to bat for an over or two. England all out in 23.4 overs on day 1! Just 85. Meanwhile the two Australias made 105 and 120 in the first innings of their match. What odds the Ashes will be a high scoring contest after all this! Wow, the Irish have England ducking and searching for cover! 67-9!! RT @BloodDonorsIn: #Purnea \nNeed #Blood Type :  O-positive\nAt : Shahnawaz Nursing Home. \nNumber of Units : 2\nPrimary Number : 94729 08517\nV… No, hardly the point. You always make the team on one primary skill. Then offer more. Never look for people who are a bit of this and a bit of that but not enough of either. https://t.co/LzX6gDHEAa It is worrisome that there isn't any young batsman coming through the ranks who can offer a bowling option like Sehwag, Ganguly and Tendulkar did. And it is fair to say that there are no bowlers with a second string either. The future is with people who offer more than one skill RT @BloodDonorsIn: #Udumalpet\nNeed #Blood Type :  A-positive\nAt : Udumalpet Government Hospital\nNumber of Units : 1\nPrimary Number : 737314… RT @BloodDonorsIn: #Ludhiana #Punjab\nNeed #Blood Type :  AB-positive\nAt : Dayanand Medical College Hospital.\nNumber of Units : 2\nPrimary Nu… RT @Ajith_tweets: The house I live in is more like my second home. Cricbuzz is my first. Such has been my bond with this company for the la… Happy that @RealShubmanGill has expressed his disappointment at not being picked for at least one of the Indian teams to the West Indies. Shows hunger &amp; ambition. Now he must channelise this positively by scoring more &amp; not allow those who seed negative thoughts anywhere near him RT @BloodDonorsIn: #Kurnool\nNeed #Blood Type :  B-negative\nAt : Rainbow Hospital.\nNumber of Units : 2\nPrimary Number : 7780624658\nSecondary… RT @BloodDonorsIn: #Lucknow \nNeed #Blood Type :  Any group\nAt : PGI Hospital.\nNumber of Units : 5\nPrimary Number : 9651206606\nIllness : Can… RT @BloodDonorsIn: #Mohali #Punjab\nNeed #Blood Type :  A-positive\nAt : Max Hospital Mohali\nBlood Component : Platelets\nNumber of Units : 2… Trump and Johnson....well.....who'd have thought! @SkyCricket @KP24 @nassercricket Having got to know him a bit, and being fascinated by mavericks, I can't wait to watch this. I always saw him as a migrant who wanted so hard to make it work in his adopted land. I am not surprised he polarised opinion but wow, he made our game watchable. One of the pillars of @IIMAhmedabad, a great prof of mathematics and of life itself, an influence over everyone who entered its gates, Prof Vasant Mote has passed away. Great man. With a tear, a final wave, a bow.... goodbye Sir. I like the idea of having numbers and names on shirts in test cricket. Helps spectators identify players (as a kid watching games, I was always asking people who a particular player was. Often, they didn't know either) and takes nothing away from the game. RT @BloodDonorsIn: #Jhansi\nNeed #Blood Type :  AB-negative\nAt : Maa Sherawali Hospital, Kanpur Road.\nNumber of Units : 2\nPrimary Number : 7… RT @BloodDonorsIn: #Nagpur\nNeed #Blood Type :  B-positive\nAt : Govt Super speciality hospital.\nNumber of Units : 4\nPrimary Number : 8668273… RT @BloodDonorsIn: #Lucknow #UttarPradesh\nNeed #Blood Type :  O-positive\nAt : Sahara Hospital. \nNumber of Units : 2\nPrimary Number :   9455… @shyam__bala @ra_mki @shyamsek They will also have to contend with lesser income from television rights and therefore reduced funding for grass roots cricket. @SaadJung @BishanBedi @BumbleCricket Good call Saad. This is some T20 team: Lewis, Narine, Hetmeyer, Pooran, Pollard, Russell, Brathwaite, Paul, Pierre, Cottrell, Thomas. Seven bowling options, batting down to 8/9. Should be a good T20 series #WIvIND If you want to explore #London, there's a lot the city has to offer — architecture, cricket stadiums, iconic skylines with the gherkin, the walkie talkie and the shard....\nWhat makes the entire experience easier? Paying digitally in the London cabs. #RuPayTravelTales. @RuPay_npci https://t.co/aSELflAv96 RT @BloodDonorsIn: #Guntur\nNeed #Blood Type :  B-negative\nAt : Sri mahaLakshmi nursing home, Arundelpet\nNumber of Units : 2\nPrimary Number… RT @BloodDonorsIn: #Ghaziabad\nNeed #Blood Type :  B-positive\nAt : Max Hospital, Vaishali \nNumber of Units : 2\nPrimary Number : 8851012134\nV… RT @BloodDonorsIn: #Varanasi\nNeed #Blood Type :  B-positive\nAt : Galaxy Hospital, Mahmurganj\nNumber of Units : 2\nPrimary Number : 063933340… @yaps9 Haha. No, in Mumbai! That should get an instant fine of 25k! https://t.co/tbClStlwV5 RT @BhogleAnita: #Chandrayaan2 What a proud day for @isro and indeed for the country! Noticing, over the last week, that people are stopping well behind the zebra crossing, hardly anyone is breaking signals..... Just shows we are a society driven more by fear than by civic sense or concern for others. So what next? Which activities should attract stringent fines? Very proud of @isro and #Chandrayaan2.  Hope all goes well. Real-life stories to make you proud. RT @BloodDonorsIn: #Udumalaipettai\nNeed #Blood Type :  A1-positive\nAt : Government hospital\nNumber of Units : 2\nPrimary Number : 93440 3718… RT @mohanstatsman: There is this Ruturaj Gaikwad, a 22-year-old opener from Maharashtra.\nHis scores for India-A in List A games since June… Interesting expression by Tim Paine. The \"arms race\" to obtain reverse swing! Was the way our game is monitored lagging behind the way it was played? Is it still that way? @isaguha @ConnorCricket @englandcricket The bowler looks the same 16 years later!! RT @BloodDonorsIn: @_MHayat @CRPFmadadgaar @majidhyderi @rifatabdullahh @RJSameenKhan @Drsheikhamina @DrSuneem Shared at https://t.co/xhJpZ… RT @BloodDonorsIn: #Agra\nNeed #Blood Type :  A-positive\nAt : Om Hospital.\nNumber of Units : 2\nPrimary Number : 8447843895\nVia: @rampals1989… RT @bizpunditz: Apurva Purohit, President-Jagran group &amp; Former CEO- Radio City, tells us why making exceptions can kill value systems in a… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  Any group\nAt : Mother &amp; Child Hospital. \nNumber of Units : 3\nPrimary Number : 6301523053… RT @BloodDonorsIn: #Mahbubnagar\nNeed #Blood Type :  AB-positive\nAt : SVS Hospital \nNumber of Units : 2\nPrimary Number : 9581540137\nSecondar… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  B-positive\nAt : Capital Hôspital.\nNumber of Units : 6\nPrimary Number : 9490723861\nSecond… RT @chinmaybhogle: Dhoni's fondness for the military + his recent decision reminded me of Tiger Woods. If you aren't familiar with the stor… RT @BloodDonorsIn: #Srinagar\nNeed #Blood Type :  O-negative\nAt : JVC Hospital \nNumber of Units : 9\nPrimary Number : 9596315767\nVia: @OvaisK… RT @BloodDonorsIn: #Chandigarh\nNeed #Blood Type :  O-positive\nAt : PGIMER Hospital. \nNumber of Units : 4\nPrimary Number : 7009292895\nPatien… I hope the selectors make it clear who the no 1 keeper for the tests is. Saha is clearly the better keeper, was the incumbent when injured. But if Pant is the keeper they want to go with, there is little to be gained by having Saha hanging around. RT @BloodDonorsIn: #Bhubaneswar #Odisha\nNeed #Blood Type :  B-positive\nAt : SUM Hospital. \nNumber of Units : 2\nPrimary Number : 7008424944… RT @BloodDonorsIn: #Vizag\nNeed #Blood Type :  AB-positive\nAt : Care Hospital. \nNumber of Units : 2\nPrimary Number : 7674063555\nPatient : Mo… @Anu_224 Every player is left free to play, not to be selected As with all great players, Dhoni must be left free to play as long as he wants to. But like with all players, it is the selectors who must take a call on his future as an India player. But this call must emerge from discussion with Dhoni. The greats command that respect. At his peak, Dhoni would never have taken 2 months off to train with the Territorial Army. But as with all of us, priorities change. We should have a clear direction by September when SA is here. But hopefully the selectors have been talking to him and we don't need to speculate. You've got to feel for the cricketers in Zimbabwe. They were fighting the odds, their administration was a shambles, but at least they were playing, their scores were recorded, there was something to look forward to. I do hope it gets resolved soon. @zoransaher Thanks Zoran. That is kind of you. The Afternoon Despatch and Courier will always be associated with the legendary Busybee. Behram Contractor gave young people opportunities and you can't ask for more. So many of us have cherished by-lines there. Was a big part of Australia 1991-92 for me. https://t.co/A1Drn5Wa2c Since my first cricket tour, the booming voice of @lpsahi has been a companion. He never tired, didn't let anything come in the way of a deadline, chased a story till it gave up. To me @ttindia's sports pages meant Lokendra Pratap Sahi. Well done. Be proud. Tough act to follow. https://t.co/NxLyO5hIal @SunielVShetty Thank you. And hope you continue playing our game! @adityakumar480 Yes indeed @machanae1 There you go! @derekobrienmp Well, we must at least chat on the phone! Thanks Arunabha @senantix. Cheers. https://t.co/ZlxZ5mjXTJ @TheRahulMehra Thanks Rahul. Cheers. @ThePapareSports I have no idea what this means but since it is a happy photograph, I am assuming the contents are happy too. Thank you. @HomeOfCricket Thank you. It has been wonderful coming to Lord's in recent times. @ZAbbasOfficial Shukriya Zainab, was so good catching up at the World Cup. Take care and I look forward to seeing your trajectory going further upwards @ashoklalla The bowler has a decent voice but the ....... Let it be! Cheers. @gbhimani Trust you to pull out these pictures. You remain the best on-tour reporter I have worked with. ,,🙏. Thanks, mighty Sir Viv. You made my day. https://t.co/aUt2PRbTFW Congratulations, @sachin_rt on entry to the #ICCHallOfFame. You embellish it, you make it richer. I will admit to a lump in my throat a few times today. I read every one of the messages you took the trouble to send &amp; I am deeply moved. I did not expect this. What a great game to be part of,what a lovely medium to connect with. Thank you very much,let's enjoy our game together RT @Timesinternet: Establishing ourselves on a global scale! India’s go-to app for #Cricket was the global destination for #ICCWorldCup2019… @maheshmurthy Thanks Mahesh I only tell stories, your movement helped save lives. My favourite tweet is when someone says an unknown donor came in and helped. @twitter is very powerful in bringing good people together as well. https://t.co/Bi5ly0z8LP @shishhattangadi Haha, thanks Shishir. You are doing all right for a 30 year old! @sachin_rt Thank you very much. What would I give to be on air for one more straight drive! Or one more back foot drive through cover. @praxus Thank you Prakaran. Cheers. @chopraanjum Thanks Anjum, very kind of you @cricketwallah Thanks Ayaz! @AletiPaleti @bhogle And that is how it will always be! @gbsaltlake Grey gives you more choices...... @gauravkapur You never know..... @iamSushanthA Dhanyavaadalu, ChiLaSow gaaru. Look forward to the next Keep taking wickets Ashwin and I'll be happy to keep calling them. And yes, the runs too. Thanks. https://t.co/pEc2Tw2zs4 @cricketaakash Kya baat hai, jinki 'Vani' samundar paar ja rahi hai, unke saamne yeh \"awaaz\" kya! Shukriya. @poonam_yadav24 Thanks Poonam. Look forward to calling your achievements one day @MazherArshad Shukriya Mazher, wish you well. Admire how hard you work. @roshanabbas Bade bhai, shukriya, lekin bhotich badi baat bol gaye. Itta bhi kaabil nai hoon! @gbsaltlake Thanks Gautam. So many happy times together. But why isn't your hair showing the passage of time? @bazidkhan81 Shukriya Bazid bhai. Waise, aapka desi hakka bahut khoob tha! @aparanjape @narayan140 Er...... different league. Too much respect for science. Shukriya chhote miyan. Intezaar rahega. Lekin un dinon ke mausikhi ki aapki talim jaari rahegi. https://t.co/VeYL9Y3wRx Look at the movement you began @vishy64theking. https://t.co/kxJfE7iD8w @shikhashauny Thank you Shikha. And may you long embellish it. It is indeed, Shri Wilkinson. And there will be many more, hopefully. Thank you. https://t.co/iFbtU4oVGx Shukriya Naumansahab, ummeed hai ek din aap ke saath kaam karne ka mauqa mile! https://t.co/rJK4paywCi @jakesprime Thanks Jakes, you exaggerate with such kindness... @sunandanlele Kay Sunandan, ingrajit? Tumchya tondun!! Dhanyavaad. Parat kadhi tumycha camera var gappa hotil...... @kumarakshay1 @jakesprime Aaj na koi tanhaai hai, na koi majboor haalat hain! Shukriya. @kelkarmohit @sunandanlele Arre waah, Mohit. Thank you. Maala Marathi vachayla thoda vel laagto pan shevat paryanta vaachla. Chhan vatala, thodi atishayokti asli tari! Thanks Joy. We've had so many moments together and not one that I regret. https://t.co/SJxcohd7a8 Now, now Jingonath bhatije! Thankyou https://t.co/Y9fFhf96Th Ah, the Professor himself! Thank you! https://t.co/Set1zugACD @fayedsouza Thank you Faye. More power to you. @narayan140 @aparanjape a decoy. an illusion. bury the evidence. it lies. @ynakg2 Meeru alaa ante inkemi kaawali! Thanks Thank you. What Mathew and all of you are doing is incredible. More power to you https://t.co/c5tayv5WQq Wishing the great man all the very best. From a huge lifelong fan. https://t.co/VfeTAKeqAm RT @BloodDonorsIn: #Bareilly #UttarPradesh\nNeed #Blood Type :  Any group\nAt : Shri Ram Murti Smarak Institute Of Medical Sciences\nNumber of… RT @BloodDonorsIn: #Gorakhpur\nNeed #Blood Type :  Any group\nAt : BRD Hospital.\nNumber of Units : 2\nPrimary Number : +918447991160\nVia: @fai… @vijaylokapally @lav_narayanan Excellent. And Jayant is of course someone I knew as a child when we were growing up on the Osmania University campus. Very interesting from @SunRisers. I thought Bayliss might head back to @KKRiders where he was magnificent. But Sunrisers is a happy franchise and part of the credit for that must go to Tom garu or Tom miyan! @TomMoodyCricket. @traveh0lics Yes, I admit there were a few. I turned down many but the ones I was already signed up for wanted their activity around the World Cup which is understandable. Today,you can't just be a good bowler or batsman,you have to field well. It's not extracurricular! A bad fielder is a liability. How does one manage liabilities? Find out on #FinanciallyFitterFridays\nDownload the @chqbook app to know your fitness score\nhttps://t.co/hADVYnc6gq https://t.co/oRbbt9aSUZ RT @BloodDonorsIn: #Nizamabad\nNeed #Blood Type :  B-negative\nAt : Hope hospital\nNumber of Units : 2\nPrimary Number : 7013108163\nVia: @Sahru… RT @BloodDonorsIn: #Pondicherry\nNeed #Blood Type :  O-positive\nAt : JIPMER Hospital.\nBlood Component : Blood and Platelets AB+ve\nNumber of… RT @BloodDonorsIn: #Patna #Bihar\nNeed #Blood Type :  B-positive\nAt : Keshav hospital\nNumber of Units : 2\nPrimary Number : 9304387812\nSecond… RT @BloodDonorsIn: #Amalapuram\nNeed #Blood Type :  B-positive\nAt : Chiranjivi emergency hospital \nNumber of Units : 2\nPrimary Number : 9959… Remembering the good times I had in #London. Few things matched the simple joy of taking a break from all the travelling around, to sit down and enjoy a great cup of coffee. #RuPayTravelTales @RuPay_npci https://t.co/g1sPfncCGj RT @BhogleAnita: A conversation about Leadership, Affordable Innovation and more with the  very inspiring @kiranshaw for @bizpunditz .It wa… RT @BloodDonorsIn: #Srinagar \nNeed #Blood Type :  A-positive\nAt : SKIMS Hospital. \nNumber of Units : 3\nPrimary Number : 9622640088\nPatient… RT @BloodDonorsIn: #Vizag\nNeed #Blood Type :  B-negative\nAt : Apollo Hospital.\nNumber of Units : 3\nPrimary Number : 9676693083\nPatient : As… RT @BloodDonorsIn: #Mangalagiri\nNeed #Blood Type :  A-positive\nAt : NRI Hospital. \nNumber of Units : 7\nPrimary Number : 9491588322\nSecondar… RT @BhogleAnita: One of mine for #SareeTwitter https://t.co/FXuz577fM7 And with this, I am signing out of the #WorldCup2019. Cheers. RT @IDFCFIRSTBank: (2/2) https://t.co/e6bvvk0byz RT @IDFCFIRSTBank: All good things must come to an end. And what an end that was! Catch the final episode of #CricketFirstWithHarsha, as he… @haidharmi @BloodDonorsIn There is so much anger and abuse around that it is soothing to read this @BloodDonorsIn Excellent. Lovely message. RT @BloodDonorsIn: #Visakhapatnam\nNeed #Blood Type :  A-negative\nAt : Government Victoria Hospital \nNumber of Units : 2\nPrimary Number : 86… RT @BloodDonorsIn: #Gurugram\nNeed #Blood Type :  B-positive\nAt : Narayna Hospital DLF Phase 3 \nBlood Component : Blood and Platelets\nNumber… RT @BloodDonorsIn: #Jaunpur #UttarPradesh\nNeed #Blood Type :  AB-positive\nAt : Sadar hospital.\nNumber of Units : 2\nPrimary Number : 6387479… RT @BloodDonorsIn: #Patna #Bihar\nNeed #Blood Type :  O-negative\nAt : IGIMS Hospital. \nNumber of Units : 2\nPrimary Number : 9334790887\nSecon… RT @cricbuzz: From Brathwaite's valiant effort to #Dhoni's run-out in the semifinal to #England's turnaround to win their maiden title, the… RT @BloodDonorsIn: #Vizag\nNeed #Blood Type :  A-positive\nAt : Apollo Hospitals, Arilova\nNumber of Units : 3\nPrimary Number : 9052343852\nIll… @nani4friendz @MichaelVaughan No. Was on head to head result @anandmahindra Would have been a great gesture and a wonderful way of acknowledging a team that played with so much grace and dignity. @shibanidandekar Thanks Shibani. Cheers. Stay happy RT @FarOutAkhtar: Follow this thread and thought well put by @bhogleharsha https://t.co/36lxSdaIhU @iamshorgo @sudhadudley Maybe you need to know me! By the way, the boundaries rule has been in place for a long time. It isn't 'fine print'. It's been used in the IPL. @sudhadudley Yes. If we had all agreed to the rules, yes. Many intelligent and sensible people are throwing up widely differing solutions. Tells you how difficult it is to find one that everyone agrees upon! @suhel But the teams had agreed that it would be that way! RT @jimmaxcricket: @bhogleharsha The punditry seem to be sorer losers than the nz team who have behaved graciously generously in defeat. Ev… @bks89 Correct! There are many imponderables, many human frailties at work in sport. But that is how we play it.Everyone sits together,accepts the rules &amp; within them,somebody wins. This final has thrown up a certain kind of result. When emotions calm down,we can see if there is something better We accept so many things within a game. An lbw verdict where a projected path (a fine approximation but still an approximation!) determines that 48% of a ball was hitting a stump and not 51%. Remember these rules came out of the same process you will now subject this game too. Could it be decided by the no of wickets lost? Would that reduce flair and risk-taking? Could it be decided by no of runs minus extras? Does that paper over some deficiencies? Should a cricket match have joint winners if a super over is tied? Should the final of Wimbledon be decided by a tie-breaker? Should the final of a World Cup be decided by who scores more penalties? There are pluses and minuses with every system but teams and players are shown these and they agree to play within them. The counting of boundaries is not a new rule. It has been there for a long time. Remember, before the Super Over, World T20 games were won with players bowling to unguarded stumps! Maybe it is time to have a discussion over the playing conditions. But remember when the teams are asked if they want any changes, they accept the rules as they are. The easiest thing in the world is to rant about the rules. The most inconvenient thing is to subject your rant to the same rigour you expect from the rule. @scottbstyris @ICC Just curious. How would you have resolved it Scotty? Another super-over? No of wickets? Shared? @greatbong @vivekiyer20 Agree on the connotation but the originally meaning is still to 'steal a glance', isn't it? @greatbong @vivekiyer20 \"Bhogle using it\" doesn't necessarily mean it has to be correct! You recommend \"peek into the future\" then? But a peep originally meant a glance. Did the association come up later, you think? RT @juniorwaugh349: @TomMoodyCricket Agree totally. NZ were brave and stiff not to win given the circumstances. But the harsh reality is yo… RT @BloodDonorsIn: #Gurugram\nNeed #Blood Type :  A-positive\nAt : Paras Hospital. \nNumber of Units : 2\nPrimary Number : 9555066165\nVia: @Zaf… RT @joybhattacharj: I really don't like the rule of the team scoring the maximum boundaries winning a tied match. It puts an accent on big… This World Cup showed that, like life, sport throws up the unexpected and baffles us too. Bowlers returned, totals shrunk, batsmen grafted, spinners had to earn wickets and so, struggled, 250 was a very good score. Humility &amp; tenacity were rewarded. It was a magnificent spectacle My heart goes out to Kane Williamson and @BLACKCAPS. But congratulations for playing with dignity and class. You made a lot more friends and did your country proud. What a wonderful World Cup! Was a fabulous telecast and I hope you enjoyed #CricbuzzLive. It is a challenge and an opportunity to do a non-rights broadcast. While live television will remain unparalleled, #CricBuzzLive is a peep into the future. RT @chinmaybhogle: Now that I've typed this, it does seem odd that people didn't consider this, instead of 'oh, well, the other team scored… RT @chinmaybhogle: My suggestion - if the runs are tied, even after the super-over, play another over!\n\nThis seems like a simple enough sol… The pre-tournament favourites won it. England have played outstanding cricket over the last few overs and this will go a long way in the growth of white ball cricket there. England cap a phenomenal turnaround from 2015. Run-out off the last ball! There will never be another World Cup final like this. That catch. Then 15 from 4 balls and the fortuitous six. Trent Boult must wonder what cards life is dealing him. Super Over. Tie-breaker. Find me something, anything, that can come close to challenging live sport RT @chinmaybhogle: You've got to be kidding me. #WorldCupfinal Stokes, born in New Zealand, against New Zealand. This is redemption for the World T20 if ever it was possible Stokes and the last over! And Boult to correct his error. The last over of the best World Cup final. Two cliffhangers in one day. Who would have thought! Oh Federer, even the greatest feel the pressure... This is an excellent partnership. No nerves. Not taking chances. Perfect for England. Djokovic and England staging comebacks...... Don't think this is an easy track. If anything getting tougher. New Zealand are onto something big here. What a spell from Matt Henry. And the figures are unkind to Boult. Now, different challenge for New Zealand with the ball a bit older That was the closest umpire's call you would see. It was millimetres away from a first ball wicket. The first ten overs the key. New Zealand want wickets, England tend to go hard. Big session So how good is this New Zealand total? On @cricbuzz with  @ImZaheer and @robbieuthappa as soon as the last ball is bowled. It's been that kind of tournament. You can start with aggressive intent but power play scores remain around the same. In the #Cricbuzzlive studio today. Join us for fun and insights around the final. Quite a line up across Hindi and English with @gauravkapur @ImZaheer @robbieuthappa @MohammadKaif #AjayJadeja and #AshishNehra. @cricbuzz @newspaperwallah @cricbuzz Thanks Rahul. Yes. I have discovered it so easy to get out of practice. Will work on it While we get ready for the World Cup final, @ashwinravi99 is having a cracker of a season in England so far. RT @cricbuzz: The #WorldCup2019 saw many remarkable performances. Harsha Bhogle picks his best XI from this year's tournament as we stand o… RT @cricbuzz: 'England start overwhelming favourites but don't write New Zealand off' reckons @bhogleharsha as he previews the #CWC19 Final… RT @cricbuzz: It's that time again, @bhogleharsha is out with his report card for #TeamIndia's campaign at #CWC19. #RohitSharma and #Jaspri… RT @IDFCFIRSTBank: Will England win their first #WorldCup on their home ground or will New Zealand take it from them? Watch Ep. 13 of #Cric… We were all excited, me and the young fellows half my age who would spot an average I might have got wrong. They were fantastic, their enthusiasm was addictive. They reminded me there was still room for simple storytelling in sport. Look where they have taken #CricBuzz Sometimes we shot late at night because it was the only quiet time. One night, we did eleven blogs, there wasn't a corner in the office we hadn't used, there wasn't a t-shirt I possessed I hadn't worn. We've done about 700 video blogs in all. Started in my office with the books behind. Then, a friend suggested we change the placement because he knew exactly which book was where. We experimented with green cloth, with FB Live, paused for the temple bells or the drill next door. September 2016. This still from the promo for the first lot of video blogs on @CricBuzz. We had no clue what to expect. We were just knocking on the door, we didn't know what lay beyond. Yesterday, we crossed 530 million views for these solo blogs, yes 530000000. What a platform! https://t.co/8kz6pmX2oE RT @Zoomph: And the top influencers on social during the #federervsnadal match were:\n1. @VarskySports\n 2. @bhogleharsha \nhttps://t.co/TciNU… RT @RonnieScrewvala: My father in law Brigadier Mehta (99 years) being felicitated by Col Sashwant &amp; Kumar, Major Kukreti &amp; Chavan and Capt… RT @cricbuzz: In the 50th and final episode of #CastrolActivChampions series, @bhogleharsha hails the gallant run of #TeamIndia at #cwc19 @… Roger Federer, you will keep enthralling us till you are 70. Never go away. If there was no Federer, how much would we love Nadal! https://t.co/Uh8c3jeE6i Every game Federer plays is a home game! This is just glorious to watch. Looks like a lovely evening in London. Where were these evenings all these days!! Won't Federer and Nadal ever get old? Ever get slow? RT @ABdeVilliers17: https://t.co/ahCQBPEo2X RT @BloodDonorsIn: #Srinagar \nNeed #Blood Type :  B-positive\nAt : Modern Hospital Rajbagh\nNumber of Units : 2\nPrimary Number : 9797962474\nP… RT @BloodDonorsIn: #Noida\nNeed #Blood Type :  O-positive\nAt : Fortis Hospital.\nNumber of Units : 2\nPrimary Number : 9910604772 \nSecondary N… Very proud of you @HimaDas8 .  Yeh dil maange more https://t.co/4a5LKn2A5r @atulkasbekar @Riteishd @mrunal0801 @sonalikulkarni @avigowariker @AshGowariker Aamhi pan khallé! In every sense of the word! RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  B-positive\nAt : Ram Manohar Lohiya Institute of Medical Science\nNumber of Units : 5\nPrimary… RT @cricbuzz: New Zealand will be the underdogs in the final, feels @MichaelVaughan after England decimated Australia in the semifinal at E… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  B-positive\nAt : Capital hospitals, Poranki.\nNumber of Units : 2\nPrimary Number : 9032933… RT @BloodDonorsIn: #Rewa #MadhyaPradesh\nNeed #Blood Type :  O-positive\nAt : Tanisha Hospital, Indira Nagar \nNumber of Units : 1\nPrimary Num… RT @BloodDonorsIn: #Jodhpur\nNeed #Blood Type :  A-positive\nAt : Mathuradas Mathur Hospital\nNumber of Units : 2\nPrimary Number : 9414288792… RT @BloodDonorsIn: #Noida\nNeed #Blood Type :  Any group\nAt : Sharda Hospital, Knowledge Park III, Greater Noida\nBlood Component : Blood\nNum… Wow, just land in Mumbai to hear of this emphatic win for England. The favourites before the tournament are the favourites to win it @_Vanshika__ @msdhoni No, he didn't Goodbye England. The World Cup was enjoyable. It was an honour to be part of a commentary team of this calibre. @ICC @cricketworldcup. Hope we have a great final to round it off. And hopefully, the sun has a ticket to the final! @abpnewstv Don't. Please. RT @imVkohli: Firstly I want to thank all our fans who came in huge numbers to support the team. You made it a memorable tournament for all… @patrickfarhart @BCCI Patrick, you are a legend, the very best at what you do. I hope you carry happy memories of India and wish you and your family the very best. @collinsadam @1116sen The word 'great' rests comfortably on very very few. I am but a chronicler of greatness RT @cricbuzz: 'Lack of Plan-B hurt India when it mattered', reckons @bhogleharsha while chatting with @collinsadam on #Centerstage.\n\n#INDvN… @Cricprabhu In the picture you sent me? In that one I see the bowler, the keeper, backward point, cover, mid-off and mid-wicket RT @BloodDonorsIn: #Thane\nNeed #Blood Type :  AB-negative\nAt : Badekar Hospital\nNumber of Units : 2\nPrimary Number : 7506686726\nSecondary N… @TomMoodyCricket Good call too It is convention to give the player of the match award to someone from the winning side. Matt Henry was fantastic today but the performance of the match came from Ravindra Jadeja. He is my player of the match. Well done India fans. You lit up this World Cup. It would have been a lesser event without you. Well played New Zealand. You always punch above your weight in World Cups and that is why you are such an admired side around the world. Much respect. Once again. 2015. 2017. 2019. Impressive India fall in the pressure game. Valiant innings. A rare run-out in his last innings in a World Cup match. Fabulous innings from Jadeja. If hope flickers, it is because of him. He's had a great match Will Dhoni play the big shots now? Super over https://t.co/gmUTxs5Nke Are we onto something here? Nails left, anyone? I don't know how far this innings is going but Jadeja has played the innings of his life. And put a bit of pressure back on New Zealand Partnership 53. Still a long way off but happy to see the approach. Since he bats in the top order in Ranji Trophy cricket, Jadeja thinks like a batsman. Oh, Rishabh, patience throws up many opportunities. Was such a good innings till then. We came to the World Cup thinking we are going to see long T20 games, with scores around 350. Instead, we have seen short test matches. It has played out so differently , so fascinatingly Dhoni? Injured? Should be here otherwise. We've seen some great catches in this tournament but that from Neesham was the best This was the nightmare scenario for India. Now is the time for a good batting side to show its depth. Watching Jadeja in the field is such a thrill. Best in the game today. New Zealand's first target would have been 240. Would have liked 250. It is a tricky score given the pressures of a World Cup semi-final but India will be the happier side at this stage. @ManishPajan You have the academic credentials to understand it. Give it a shot. You would have studied fairly complex algorithms. I understand the logic, not the mathematics. It is not difficult. https://t.co/x8SSxJmQkR @krish_ramkumar @SudarshanEMA @ICC Once India begin their reply, their D/L par score after 20 overs will be around 60-70 for no loss on the same principle. A very happy 70th to the great #SunilGavaskar. I use to switch the radio off if you got out. Wish you great health and many more years in the game you have so embellished. @krish_ramkumar @SudarshanEMA @ICC It is fair. The no is higher because you have ten wickets in hand. How cool is this. Father @vijaylokapally writes the article, son @AkshayLokapally takes the photograph. Hopefully, more on the way. https://t.co/KeidbyX7VC RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  Any group\nAt : SGPGI Hospital. \nBlood Component : Blood\nNumber of Units : 3\nPrimary Number… @meseemajaswal @cricketworldcup @ICC @StarSportsIndia Advice is easy Seema, it is what you have gone out and done that is tough. And I have little doubt you will continue doing it. @JaskiratSB Cheers @JaskiratSB The focus was on cricket being played in an unusual place. And from that point of view, it was fine. Prudent decision. Forecast fine tomorrow https://t.co/T8y71pLZYg So play is officially called off for the day. Resumes tomorrow at the same score. I don't think India will mind that. And while we wait for play, how is this for a game of cricket. My friend, PV Jaishankar sent me this photograph from eastern Ladakh. And that is the Tso Moriri Lake in the background. https://t.co/SWGS85mTOe @BalajiKrish If you can't play today, restart from 211-5 tomorrow Covers off. Inspection at 18.10. If okay, play can restart upto 18.35 for a 20 over game. Target 148 if so. It's funny isn't it. You plan for years, play 9 tough games and then your hopes of a World Cup win and the resultant career high rest on an hour and a half of T20 equivalent cricket. Covers coming off. https://t.co/FmiI7NTlak The playing conditions say that if play cannot restart by the cut-off time for a result on the day (18.35 local time), play will be abandoned for the day and will restart the next day from the point at which it ended today. @anandmahindra It is tough to explain over 280 characters. It isn't as difficult as running a corporate empire!! Because you will have 10 wickets in hand when you start chasing the 20 over target. DLS calculates resources available. And so if you start on the assumption that it is 46 overs, then it gets aborted, the par score will only be 60-70 for no loss https://t.co/UVkQSMce0q The shorter the game, the stiffer the run-rate India will have to achieve. If it is a 20 over game now, the target would be 148. If, however, it becomes a 46 over game and India bat 20 overs, the target then will actually be just about 60-70 for no loss. The forecast has taken a turn for the worse, sadly. You can make up time upto two hours and all effort will be made to get a result today. Only goes into tomorrow if it isn't possible to end the game today. London is always great for shopping, and with my travel partner @RuPay_npci it’s even more delightful. Visiting some truly exquisite stores this time. #RuPayTravelTales https://t.co/uS6IvaC81y Different contest as the ball gets older...... New Zealand's recent opening partnerships have been 0/12/0/5/29/2/1. Great ball, great catch Like @SGanguly99, I admit I am surprised by the dropping of Shami. He takes wickets upfront and if you do, the death overs aren't as critical. India batting very deep with Jadeja at 8 but it is a big call to leave out Kuldeep against a team he has done well. It is a good toss to win for New Zealand, especially on a knock-out today. But it doesn't change the assessment of India as favourites. RT @BLACKCAPS: “A Semi-final is really exciting and there’s plenty of fizz in the dressing room for today. Two wins and you win the tournam… Overcast. Lights on. Some rain forecast but don't think it will be enough to require play to go into a second day. The playing conditions say all efforts, including curtailment of overs if needed, will be made to ensure play ends today. RT @chinmaybhogle: Hi - any suggestions on what to do in a situation like this? @UberINSupport is of no help whatsoever. @Uber_India https:… The best news today. Rahul Dravid is Head of Cricket at the NCA. When the level just below the national team is high, the national team is automatically good. RT @BloodDonorsIn: #Agra\nNeed #Blood Type :  Any group\nAt : Parikh Hospital \nNumber of Units : 2\nPrimary Number : 9811220430\nSecondary Numb… @yaps9 Hey, thanks Yaps. Have a good game tomorrow. RT @cricbuzz: Will #ViratKohli's #MeninBlue take a step closer to the World Cup title or will it be #KaneWilliamson-led #Blackcaps? On #Cen… A very happy birthday to someone I have known and admired for many years. @SGanguly99.  Place in history. Place in the future. Good to see Indian athletes winning medals overseas. #KutnoAthleticsMeet  Hopefully start of something bigger. And @HimaDas8 keep at it, looking forward to more RT @IDFCFIRSTBank: The first of the semi-finals is about to begin and judging by their performance against Sri Lanka India seems ready to t… RT @BhogleAnita: A great way to make the most of your time in monsoon traffic @bizpunditz  #KeepLearningKeepGrowing https://t.co/Aog3latRVa @BishanBedi Because cricket as much a play of technique as it is of emotion. There is skill and there is drama. You may not have the technique or the skill but you can translate the emotion and drama. Different skills. Next time we meet, this can be the topic. Hope you are well, sir. @saarthak_ss No Saarthak, you cleared it because you worked hard. RT @cricbuzz: On @My11Circle presents #CricbuzzLIVE, our panel analyses how Test Cricket has immensely helped #HardikPandya to transform as… RT @BloodDonorsIn: #Gurugram\nNeed #Blood Type :  O-negative\nAt : Medanta Hospital\nNumber of Units : 2\nPrimary Number : 9009393041\nSecondary… @adshubham @RuPay_npci Me? Haha! @insane_m9nd @RuPay_npci It comes out of being paid nothing for doing a lot earlier in life..... After some wonderful games in the qualifiers, all eyes on the semis now! Found time occasionally between matches to pop into some shops. A little relaxation in the #UK in between! A few retail escapades with my Travel Partner! @RuPay_npci  #RuPayTravelTales. https://t.co/q4v7KHIK1Z RT @cricbuzz: Rohit Sharma and KL Rahul registered centuries as India hammered Sri Lanka in their final round robin game. On Centerstage, @… RT @cricbuzz: On #Centerstage, we bring to you the 'musical' journey of the four semifinalists in #CWC19 - #India, #Australia, #England and… Wishing the fastest hands in the game @msdhoni a great year on the field and beyond. #HappyBirthday. @gana4u Sorry you couldn't. Maybe next time. Cheers. Just watched @ThierryHenry on #SkySports taking us through some of his goals from \"that' season. @Arsenal Gold. Caps off a lovely day. Was tired of eating pizzas. Stumbled onto authentic Kerala cuisine in the middle of Leeds! #Tharavadu was excellent. Nothing to beat South Indian food! #Unsolicited. #Appreciation Off to Manchester! Congratulations @ImranTahirSA for letting us enjoy your skills. You were a breath of fresh air to our game and hopefully you will keep bringing that to franchise cricket around the world. What a match! Well done Australia to take it so far from where they were but whoever imagined South Africa would produce this performance. We will see a lot more of Alex Carey in the years to come. And another twist. Have to love cricket. Brilliant innings from Warner. https://t.co/J9xnjR47y4 And now, just as suddenly, South Africa seem to have forgotten that they are actually ahead! https://t.co/y4zj0u4Ll1 This is just wonderful. Somehow, from their deepest inner recesses, with their boarding passes issued, South Africa are finding resolve, pride, courage and they are taking on Australia. You have to love cricket. @pulkit_sachdeva It is the word that, to me, explains hus situation the best. RT @ashwinravi99: Well Done @klrahul11, it was always a matter of time. 👏#ICCCWC2019 His life has been coated with turbulence recently. Hopefully this century will remind KL Rahul once again that he is a rare talent and here to stay. Five centuries at one World Cup. Rohit Sharma is creating some very special landmarks. And for lovers of batting, providing a lot of joy South Africa are playing like the South Africa of old...... I wonder if we should change travel plans..... This is an excellent fightback from Sri Lanka. Once again, Angelo Mathews has shown why he is, by some distance, Sri Lanka's best batsman. Set for 270 now. Will be happy if they get there. Was a great sight this morning when Malinga embraced Bumrah before play started. Knowledge knows no boundaries. Share it. RT @BloodDonorsIn: #Vizag\nNeed #Blood Type :  B-positive\nAt : Apollo Health City, Arilova\nPrimary Number : 9989924233\nPatient : Bauji\nVia:… RT @BloodDonorsIn: #Muzaffarnagar\nNeed #Blood Type :  Any group\nAt : Medical College Begrajpur.\nNumber of Units : 2\nPrimary Number : 083948… Bit of grip and turn for Jadeja. Quite the conditions he would have ordered. India going in again with only five bowlers. Working today but wonder if that is the way ahead? Might be too big a gamble in a knockout game Just one of the things you have to do on the morning of a match day! https://t.co/7IQXJo9rhk There was a Sunshine Sale on in Leeds and now it is out of stock. Gloomy day. @DattatrayTejas @AndElevators @cricketaakash @cricketwallah @sanjaymanjrekar @VVSLaxman281 No, won't be Well played @realshoaibmalik. You can be proud of your career. Wish you well. https://t.co/gieK3gnDle RT @BloodDonorsIn: #Madurai\nNeed #Blood Type :  AB-positive\nAt : Vadamalayan Hospital, Chockikulam\nBlood Component : Blood\nNumber of Units… RT @BloodDonorsIn: #Bhagalpur \nNeed #Blood Type :  O-positive\nAt : Khagendra Vaibhav Hospital \nNumber of Units : 2\nPrimary Number : 8877940… RT @cricbuzz: A gritty cricketer, an iconic commentator and now as Team India's coach; @RaviShastriOfc has aced all roles in the way, only… RT @cricbuzz: A dead rubber or an opportunity for India to set things right before the semis? On #Centerstage @bhogleharsha and @collinsada… Another slowing surface. Another day where winning the toss is a big advantage. Pakistan need to stop thinking about conspiracy theories to win more. My preview of today's game. https://t.co/L9obJjBuhz @abhisheksid94 @HARIGANESHREDDI @cricbuzz @cricketworldcup @SirJadeja @IrfanPathan @virendersehwag Every game  has a designated home team. While the chances of qualifying for the semi-final were always non-existent, Pakistan should believe this is a good enough score to win a match. And even though Bangladesh have the best batting line up in their history, Pakistan should be disappointed if they can't defend this RT @BloodDonorsIn: #Mysuru\nNeed #Blood Type :  O-negative\nAt : JSS Hospital \nNumber of Units : 2\nPrimary Number :  99024 16798 \nSecondary N… RT @BloodDonorsIn: #Guwahati\nNeed #Blood Type :  A-positive\nAt : B Barooah Cancer Institute, Guwahati\nNumber of Units : 2\nPrimary Number :… RT @BloodDonorsIn: #Madurai\nNeed #Blood Type :  A-negative\nAt : Meenakshi Mission Hospital\nNumber of Units : 6\nPrimary Number : 9566527243… RT @BloodDonorsIn: #Meerut\nNeed #Blood Type :  B-positive\nAt : Nutema Hospital. \nNumber of Units : 2\nPrimary Number : 09837887668\nVia: @aqu… RT @BloodDonorsIn: #Udaipur\nNeed #Blood Type :  A-positive\nAt : Pacific hospital \nNumber of Units : 1\nPrimary Number : 8233272599\nPatient :… RT @BloodDonorsIn: #Srinagar \nNeed #Blood Type :  O-negative\nAt : Saja Khan Hospital, Bemina\nNumber of Units : 2\nPrimary Number : 700670755… In a game of cricket, runrate is most important for victory. But what about winning in finance? Find out on this episode of #FinanciallyFitterFridays. Download the @Chqbook app to become a winner in your game. https://t.co/8MrxK9u4Rj RT @BhogleAnita: What a thriller! https://t.co/VxsSw3YdLa @Dilronx Haha, Dilnaz, remember the one in Kochi well! RT @BloodDonorsIn: #Guwahati #Assam\nNeed #Blood Type :  O-positive\nAt : Apollo International Hospital.\nNumber of Units : 2\nPrimary Number :… @Chetan_Pitamber It is inevitable. It is going to happen to all of us one day @sank256 @RogueRad I am.working with the ICC World feed @10_ssc Work your back side off! Lots of admiration for the way Afghanistan are going about this run-chase. Instead of being disappointed with where they have finished, they must look at the positives, of which there are a few. Always loved watching Rahmat Shah. Touch of class about him. But how good has young Ikram Ali Khil been! Got a chance to bat at no 3 and said thank you I'll take it! He's pulled a fast one on many.... https://t.co/8Jw2eUWU7U @RogueRad In my opinion too! Till I have it!! RT @IDFCFIRSTBank: After securing their place in the semi-finals, India seems ready to take on Sri Lanka’s final challenge. Know the #GameC… RT @MumbaiPolice: Man’s best friend, found its best friend in PC Prakash Pawar too. #FriendsIndeed https://t.co/hCsrDwlfZ5 Still time here to wish @harbhajan_singh a very happy birthday. Bhajji, aap yunhi hanste rahe is saal. Have a great year This was a WhatsApp forward which I put on twitter. I had no idea it would travel so much. So can the people who actually shot it and played that game get in touch with me so I can give credit where it is due. Cheers. https://t.co/Aw9XnvhviM @NJ_kims You just illustrated my point! Aaj sandhyakaali Leeds madhe phirayla gelo. Asa vatala Bharatatach aahe. Aapli tarun pidhi jagaat saglikade pohochli aahe aata. @ammirrr Khel hi to hai. Kal phir subah hogi. At #AfgvsWI tomorrow. In terms of this tournament there is nothing at stake but there is always something enjoyable within a game. I will look forward to watching Pooran and Hetmeyer and see if Rashid can sign off successfully on a World Cup that hasn't seen the best of him RT @deeputalks: If Bangladesh opts to bat first on Friday, Pakistan stand eliminated even before a ball is bowled.\n\n#CWC19 #WeHaveWeWill RT @deeputalks: For Pakistan to qualify:\nBeat Bangladesh by 311 runs after scoring 350\nBeat Bangladesh by 316 runs after scoring 400\nBeat B… @suhel @Ajuba4u1 Yes RT @deeputalks: Captains winning the toss opting to:\n\nFirst 19 games - Bat first 3; Field first 16\nLast 19 games - Bat first 12; Field firs… RT @mohanstatsman: Assuming New Zealand lose today say by 150 runs. Their NRR will then be 0.085.\nPakistan currently on NRR -0.792 has an i… Pakistan can well say New Zealand were very lucky a couple of times but eventually you make your own fortune. The first loss to the West Indies is still haunting them. Having said that, they still need to beat Bangladesh who have played better than their results indicate. Very disappointed by New Zealand's steep decline at the World Cup. Will scrape through on NRR but don't see them troubling Australia in the semi-final. So England look like they have, rightly, won themselves a semi-final place. But there is a lot to play for here for NZ. Get the lower middle order scoring runs, their form might be crucial going ahead,  and drag the game as deep as possible to completely settle the NRR issue. @MailSport I don't know, I got it as a WhatsApp forward Really feel for #AmbatiRayudu. Always gave it everything he had but sometimes was left holding the wrong cards. So hope he continues in domestic white ball cricket so that we can see his wholehearted style of play in the #IPL. This is an emotional moment but there is a tomorrow Bangladesh are going for it. Showing good spirit here. They are one wicket away from the tail though! Good finish India have done well to keep chipping away at the Bangladesh wickets. It will irk them that there hasn't been a large enough partnership to challenge India. Game in favour of India at this stage @FahimAh09762587 Oops. Thanks India chipping away at the wickets. Mushfiq was a huge wicket. Pressure is shifting towards the batsmen and there could be an opportunity if the asking rate starts hovering around 8. Shakib the key. The two best Bangladesh bowlers Mustafizur and Shakib showed it isn't as easy to score runs off good bowling. India are the superior bowling side so they will bowl better but they are up against the best Bangladesh batting side I have known. Early wickets the key Afraid India haven't got the finish they wanted, they needed. Good score. But toe in the door for Bangladesh Top spell from a champion cricketer. Shakib has shown it is possible for spin to do well on this ground. Such a pleasure to be at the ground to see Rohit Sharma bat like this. Would have been even more fun if he had gone on. India's batsmen need to be careful not to get too influenced by the short boundary. We saw that at Lord's too when a couple of batsmen got out trying to clear the tiny boundary. We are coming to the tail-end of a major tournament. It is around now that a team should know it's best eleven. From that point of view, India must hope Dinesh Karthik comes good. The ground dimensions should not, in a World Cup game, decide the make-up of a team. India would have liked to play two spinners on this used surface. @official433 I don't know. I got it as a WhatsApp forward RT @BloodDonorsIn: #Dibrugarh #Assam\nNeed #Blood Type :  A-positive\nAt : Aditya Hospital, Dibrugarh \nNumber of Units : 2\nPrimary Number : 7… RT @OsmanSamiuddin: For the sake of your own sanity pls read this thread https://t.co/sXCdLBx8zc This is the funniest thing you will see today! https://t.co/Kfz08Dka3Z Anyone else feel like raising a huge cheer for the mighty Lasith Malinga. Still carrying the Sri Lankan attack. Awesome. At the moment, they are like a guerrilla force with only a few weapons. They can win a battle here and there but don't have enough to win a war. But they keep at it. Got to love the West Indies. Even when the target is seemingly beyond reach, they keep going for it. RT @BloodDonorsIn: #Meerut #UttarPradesh\nNeed #Blood Type :  A-negative\nAt : Jaswant Rai hospital\nPrimary Number : 9837010570\nSecondary Num… RT @BloodDonorsIn: #Cuttack #Odisha\nNeed #Blood Type :  A-negative\nAt : Aswani Hospital. \nNumber of Units : 1\nPrimary Number : 7978960117… RT @BloodDonorsIn: #Pondicherry\nNeed #Blood Type :  B-positive\nAt : PIMS Hospital, Kalapet.\nNumber of Units : 2\nPrimary Number : 9790034309… RT @cricbuzz: Virat Kohli &amp; Co. can seal their semifinal berth if they bounce back against Bangladesh, after registering their first loss o… Oops, take care Mumbaikars... https://t.co/wAwDUSv5jM Then there is Mayank Agarwal. Top of his game for a couple of years, fine test debut, not among the contenders &amp; then an opportunity to play in a World Cup at a crucial time. Delighted for him &amp; it is a good choice. But it also tells you how far poor Rayudu has gone off the radar If you want to know how your world can turn, look at Vijay Shanker. The excitement of being at the World Cup, getting a few games, then an injury and uncertainty again. Remember these are young men, have to feel for them RT @IDFCFIRSTBank: Just one win away from the semi-finals, as #India prepares to take on #Bangladesh. Catch Ep. 9 of #CricketFirstWithHarsh… England back on track. Too good a team to miss out. I don't see them losing to New Zealand now. Sadly for Sri Lankan fans, this result means their campaign is over. Disappointing finish. A run-a-ball partnership can't win games. Was exciting till Pandya was in. India seem to thrust Hardik Pandya into situations where he has to start hitting rightaway. He is a better player than that. I see him as India's no 5 in a year and a bit. @narayan140 The OneDay4Children logo Enjoying watching this. Irrespective of where this game goes (it is not Dhoni but Pandya who has the key to this game) we have had a spectacle. And we saw it. Excellent partnership. Love how Virat was willing Rohit on https://t.co/grOH1qBc9u It is very rare that you will see Rohit Sharma struggle like this, such is the fluency that he normally brings to his batting. Very keen to see how a champion player like him plays himself out of this phase I thought India were excellent in the middle overs. England looked good for 360 at one point. Strangely, the rut coincided with Bairstow's century. Rain alert in Mumbai, six alert in Birmingham..... Flattish deck. Can see why England were so keen to play Roy, especially with Bairstow struggling a bit. First look at the #MenInOrange.  Bright! So India confident enough to go with 5 bowlers and a bit of Jadhav and that means Vijay Shanker's utility is a bit reduced. Huge opportunity for Rishabh Pant. No 4 for your country is such a privilege.  I hope he goes well. So an extraordinary turn of events sees the entire sub-continent hoping, or should I say praying, for the same result! A rare configuration of planets! RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  A-negative\nAt : Vijayawada Government Hospital\nPrimary Number : 7036070811\nVia: @svraghu… Before leaving #London to see #India play #England in #Birmingham, I took a pit stop at an ATM camouflaged as the iconic telephone booth. Whether it's paying digitally or by cash, RuPay has me covered. @RuPay_npci #RuPayTravelTales https://t.co/c3WwWGk8Cv RT @cricbuzz: Australia remain on top in the points table following a dominant display over New Zealand. On Centerstage, @collinsadam, @bho… RT @BloodDonorsIn: #Ahmedabad\nNeed #Blood Type :  B-positive\nAt : UN Mehta Hospital. \nBlood Component : Blood\nNumber of Units : 4\nPrimary N… RT @cricbuzz: Pre-tournament favourites England and in-form India clash in what promises to be a thrilling encounter. Will India keep going… @akshhaye Cheers. Okay most days but struggle wh n I am rushing That is a second poor match for New Zealand. They are going downhill rapidly but the early results will still see them through on net run rate should Pakistan get to 11 points. It is still England or Pakistan as the fourth qualifier So Pakistan breathe again. Back from the brink as only they can to fight another day. Being a Pakistan fan is like being in a Hindi movie; you experience every emotion. RT @cricbuzz: The stakes are high as England take on in-form India. On #Centerstage, @bhogleharsha along with @collinsadam talk about the p… Pakistan making it tough for themselves. But there is enough batting there. Still, there will be a few jitters amongst the supporters..... @IsntTony105 As in the break for drinks..... By their very high standards, the Kiwis were a bit iffy in the field to start with. But that is two stunning catches now! @martypartridge Well, they are playing like that! When a good fielder drops a catch, he doesn't want to avoid the next one, he desperately wants another to come his way. Guptill dropped two and picked up a stunner. He would have been praying for it. @arteja27 Thank you. You are kind @KaushikVaidya Haha,nice. Beautiful day at Lord's. It is a picture. And, hopefully, a good game. Interesting to see NZ play two spinners on a used pitch. So far though teams batting first have held the advantage. So when was the last time you saw a cricketer release a single? https://t.co/xTkmKEmEAb @yaps9 Thanks Yaps Enjoyed telling this story. https://t.co/L6AEkcO0em So happy to see Hashim Amla get runs. One of the greats of our era. #MightyHash RT @IDFCFIRSTBank: You watched Virat Kohli and Hardik Pandya’s #AlwaysYouFirst moment against West Indies. Now watch Ep. 8 of #CricketFirst… @BloodDonorsIn Beautiful RT @BloodDonorsIn: #Lucknow #UttarPradesh\nNeed #Blood Type :  A-positive\nAt : SGPGI Hospital. \nNumber of Units : 2\nPrimary Number : 7310050… RT @BloodDonorsIn: #Visakhapatnam\nNeed #Blood Type :  AB-positive\nAt : Apollo Hospital, Arilova\nNumber of Units : 4\nPrimary Number : 846504… Every good captain reads the pitch &amp; selects the most appropriate team. Similarly, @Chqbook makes sure you get the best credit cards. \nNow, every Friday is going to be filled with fun, cricket and financial fitness. Catch me on #FinanciallyFitterFridays. Download the @Chqbook App https://t.co/6uZJS5NqqQ @Cazoperadag Tired, but that isn't enough reason to stop smiling... @sourabh_kuki @pareek28sept @Anshbaser @prateekmittal20 He isn't important enough to be in wax! @here_2_be_aware Sorry, there were lots of people.... @sab3r2th @Vimson77 Ha! Was walking to the train station next door! Another town, another train..... https://t.co/GDstJCVqDs Food that reminds you of home when you are away from home. Join me as I sample a taste of nostalgia, with #RuPayTravelTales. @RuPay_npci https://t.co/hl8gJwcwmA @Ratheesh_RT @bloodbank Pls also tag @BloodDonorsIn RT @cricbuzz: India came up with a clinical performance against West Indies to edge closer to the semifinals. On Centerstage, @collinsadam… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  A-negative\nAt : Chittemma Metro hospital\nNumber of Units : 2\nPrimary Number : 8886751111… RT @BloodDonorsIn: #Kanpur #UttarPradesh\nNeed #Blood Type :  AB-positive\nAt : Institute of Cardiology \nNumber of Units : 2\nPrimary Number :… RT @chqbook: Team India @BCCI remains unbeaten! Consistency throughout the tournament is what makes a champion team shine.\n\nAnd in life, a… Nothing beats going to a stadium and seeing a sea of blue. Old Trafford was excellent and you have to acknowledge the enthusiasm and the intensity of the supporters. Fantastic. No. 4 is still an issue but every team has one. It is how you play around it that matters and India aren't letting it get in the way. India were dominant, powerful and relentless. Who knows about tomorrow, but today they are playing like champions. Just like you  go into ecstacy over a great cover drive so must you over the ball that got Hope out. This spell by Shami is of the highest class Not pro or anti anybody. Excited by Pant. But once Shanker was picked, had to be fair to him. India have time after this game to look at options. https://t.co/Rc1nAfO0l8 He always gets the finish....... India have a decent score eventually. But once again, it is down to the bowlers to play the bigger role. This is an excellent mid-innings spell from a proper quick bowler. Roach has shown up a little fragility in the Indian middle order. As a result, India behind where they would have liked to be. What is with the angst against Vijay Shanker and the hype around Rishabh Pant. VS has only batted twice, made 15* and 29, took a huge wicket at a difficult time against Pakistan and averages 11 more than RP in their short odi career. Give him a break, wish him well. No surprise India unchanged and choosing to bat. Best contest of the match coming up. The West Indies quicks take more wickets than others in the 1st powerplay but India lose fewer wickets than anyone else. Looking forward to sharing my experience with some of the finest food #London has to offer\nwith my travel partner @RuPay_npci #RuPayTravelTales https://t.co/ro21y517ob @ashwinravi99 I am sure you wouldn't mind swapping rain for heat! @barneyronay You are more hospitable than this Barney! Hey England, can you allow us a glimpse of your summer this year? It is late June now and we come from warm lands........ Only one unbeaten team at this World Cup........ What a player this Babar Azam is. Still coming of age and already, by some distance, Pakistan's best batsman. And the selection of Haris Sohail is a game-changer. Santner looked like he would take a wicket with every ball in his first spell. He ends 10-0-38-0 and nobody, in a few days, will remember what a threat he was. I don't think too many people, including diehard home fans, would use the word 'clinical' to describe a Pakistan run-chase. But after the hiccups, that is what it has been. I wonder if the rest of the square at Edgbaston will be like this! India won't mind playing an extra spinner if so. This is an astonishing pitch And a catch goes down too. This is such a tense match. New Zealand missing their second spinner. https://t.co/OUzsm4N30N Pakistan have played and missed and edged but the runs in between have put them in a good position This is a staggering comeback from New Zealand and another chapter in the inspiring story of @JimmyNeesh. Not sure it is a winning score but certainly a chance for the bowlers. So much in this World Cup depends on the next 50 overs. RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  Any group\nAt : PGI Hospital. \nNumber of Units : 02\nPrimary Number : 8521948033\nSecondary Nu… Looks like just the surface for Pakistan. Interesting that New Zealand won the toss chose to bat and played just one spinner. But remember, Pakistan don't chase well and that is what NZ will bank on RT @bizpunditz: Get some brilliant #career advice as you travel to work! You can now learn from some of India's best business practitioners… RT @chinmaybhogle: I don't know about you guys, but the superpower I'd love to have is Domino's probability-altering thing. \n\n#TrafficSigna… RT @beastieboy07: @Gmaxi_32 and @AaronFinch5 made that rebound catch look as easy as chucking housekeys at each other, which they would hav… Overwhelming favourites, now gasping to stay alive in a World Cup so many thought was theirs to own! #England #ENGvsAUS That, from Mitch Starc to Ben Stokes, has to be one of the best yorkers you will see. Almost certainly the ball that guarantees Australia a place in the semi-final. When the ball swings in, even the mightiest struggle. Behrendorff and Starc have got it swinging in today, something we haven't seen a lot of at this World Cup..... England are tumbling......Hope rises elsewhere...... Very good fightback by England. Sets it up for an exciting second half. Will be a good indicator of England's confidence. @GabbbarSingh Good you didn't pull the chain and say \"sir, woh out hua ke nahi check kar raha tha.....\" @rahul030555 Of course! @thesmalltownboy Absolutely. Had a very bad eye infection once as a result. And, inevitably, you smelt of the train by the time you got off.... @ManishManke Did that too! @lesleydbiswas I still do sometimes, am fascinated by the homing instinct.... @iyeronicalchap Did you too? Ha, that's two of us! @foodie_desi More like \"chaayé chaayé...\" Yes, indeed @KaamkiiBaat Beautiful The train is about to leave &amp; somebody is running on the platform &amp; you hope he/she makes it, people waving with one hand &amp; wiping a tear with another, seeing the guy pasting the reservation list with a pail of glue, everyone, unreservedly, helping the elderly board the train.... And I am reminded of my childhood journeys....trying to interpret the shapes of clouds, looking at electric wires and how they sagged between poles, the birds sitting on them, peering into timetables to see which station was next, wondering how the sheep found their way back.... On a train journey through the gloomy looking but pretty English countryside. I am particularly fascinated by the lovely little houses seemingly in the middle of nowhere and often wonder who lives in them and therefore, what their life must be like. @vikramsathaye Arre baap re! Hyacha artha aankhi thode mitra shodhayla pahijet? RT @cricbuzz: Today’s #JoyFactor question will surely puzzle your brain. Up for the challenge? Send in your correct answers using #Cricbuzz… @fistfuld He had made himself available @agrawalsanjeev @aparanjape Well, Afghanistan are playing today.... Why on earth would you send Najib Zadran at no 8? #AFGvBAN Losing Russell is a big loss for the West Indies. But you could see it coming over the last couple of games. They have opted to replace him with a batsman in Sunil Ambris rather than a finisher like Pollard or a bowling all-rounder like Bravo I think Bangladesh have enough. They also have the advantage of seeing what works on this track and what doesn't. Love watching Mujeeb bowl. So many variations, have to watch the ball out of his hand like a hawk. The tweets from @RossLTaylor and @TridentSportsX tell you everything that is good about our game. Play hard but have the grace to acknowledge what the opposition has done. Well done, both of you. RT @TridentSportsX: @RossLTaylor @cricketworldcup Congrats to you boys, well played \nThanks for the gesture at the end, appreciate it 🤘🏾 RT @RossLTaylor: What a game! Super hitting @TridentSportsX @cricketworldcup #cwc19 @ Emirates Old Trafford https://t.co/CUCkcHRqsW Sri Lanka's win over England has given life to many seemingly dead campaigns at this World Cup. South Africa must think this World Cup is one long nightmare they are unable to wake up from. Pakistan still alive! RT @IDFCFIRSTBank: After a close encounter with #Afghanistan, the Men in Blue prepare for their next challenge. Watch Ep.7 of #CricketFirst… RT @BloodDonorsIn: Viviana, This is indeed so lovely. We would like to extend thanks to the donor and volunteers who have helped save a lif… Post game on the @icc digital show. Mohd Shami was interesting. Always fun with Ramiz (we get along like a house on fire) and @PathakRidhima https://t.co/kp7t7BIFqm Let's take a trip together and explore the street food the city has to offer with my travel partner @RuPay_npci, on #RuPayTravelTales! https://t.co/Xkr0YRDs1X RT @TGSTW99: NEW EP! The voice of Indian cricket @bhogleharsha talks about the story of @BCCI around the #Ninety9 World Cup. The batting bo… @uday6123 @WeAreHyderabad Pls tag @BloodDonorsIn RT @cricbuzz: #ViratKohli &amp; Co. continue their winning ways in the World Cup. On Centerstage, @bhogleharsha along with @collinsadam review… RT @Edged_and_taken: On some nights they clear the fence. On some nights they get caught on the boundary. Cricket is a great leveller. Than… Great innings by Carlos Brathwaite. 12 inches away from glory, from another great moment in cricket. Bishop and Brathwaite. Almost. Almost again.. @irbishi Bumrah still the jewel.... Produced the breakthrough in the 29th, bowled a calm 49th. Hat-trick-Shami to finish it off. How many teams would have finished the game so clinically. Well done India. They had to huff and puff, they had to dig deep, they had a scare but India have the two points. What a game of cricket! And the dismissal doesn't change my view https://t.co/lCQNV0GFpd Fabulous innings from Nabi. So calm  Fantastic cricketer Another top over from Bumrah. 14 in the bank for India for Shami to defend. Kohli looking to Bumrah again.... https://t.co/mnKx6rTIDe I have so enjoyed watching this game. The run-rate not a factor, good old-fashioned runs and wickets. I don't think anyone thought, I certainly didn't, that Afghanistan would run this game so close. Tilted India's way but this game has made a lot of predictions look silly...... Kohli looks for Bumrah. Bumrah puts his hand up. Again. In spite of that wicket, this is a fine start from Afghanistan. Pressure is on.... https://t.co/hUpoNoc4ny Only a small total. India can't afford to give freebies in extras Well, was on the cards.... https://t.co/t3DGtQGVXu They have played and missed and played and missed but the openers have survived somehow! Have to admire the manner in which the Afghanistan spinners controlled a high quality batting line up. Used the pace of the pitch very well and that meant Dhoni and Jadhav preferred to play them out rather than attack them This is gettable for Afghanistan but if they get do it will be after a big struggle;  they will have to display the self-belief they haven't shown so far. Tough pitch to bat on. A spot of bother for India. Will test 5,6,7 now. Remember, it is a long tail today without Bhuvi. Need 250. @ThanduMadurai Except of course the part where he pointed out his excellent record in the few times he has batted there!! Sluggish surface. The two previous games here produced 212 and 227 in the 1st innings. You can see why in the way the batsmen have had to approach the bowling. Experiencing the best of global cuisine in #London’s street food with my travel partner @RuPay_npci #RuPayTravelTales https://t.co/6h7bvXP8vt RT @BloodDonorsIn: #Gurugram\nNeed #Blood Type :  A-positive\nAt :  Artemis Hospital\nBlood Component : Platelets\nNumber of Units : 1\nPrimary… RT @cricbuzz: 'Sri Lanka's win over England gives the tournament a new lease of life' reckons @joybhattacharj on @My11Circle presents #Cric… RT @BloodDonorsIn: #Visakhapatnam\nNeed #Blood Type :  O-positive\nAt : Padmaja Hospital, Old Gajuwaka\nNumber of Units : 2\nPrimary Number : 7… RT @cricbuzz: On #Centerstage, @bhogleharsha talks us through the rise and rise of #RohitSharma, explaining how the swashbuckling Hitman ha… RT @meljones_33: I’ve been in hysterics from Nottingham to Southampton with @beastieboy07 and @Gampa_cricket on their #wcuponwheels journey… RT @cricbuzz: The wonder kid and spin genius from Afghanistan, @rashidkhan_19, features in this new episode of #CastrolActivChampions prese… This #CWC19 was heading towards many dead rubbers. Today's result has changed that and I am looking at the matches to come through a different lens Brilliant from Sri Lanka. England showing a soft underbelly in chases? Delighted for Malinga. RT @BloodDonorsIn: #Srinagar \nNeed #Blood Type :  A-positive\nAt : LD Hospital. \nNumber of Units : 2\nPrimary Number : 9596461516\nVia: @Donor… Good to see Sri Lanka making a fight out of a 230 game. Still think a 260-270 game is the best ODI. The bowlers should have a chance and the best batsmen should find a way to get there. The tee-shirts are out and the sweaters are gone. Has summer finally reached the World Cup, I wonder? RT @BhogleAnita: #InternationalYogaDay. Looking forward to a good session this evening. I've been a student for close to 20 years &amp; benefit… RT @bhogle: The dynamics of company takeovers. https://t.co/oro7Cu4X3l No Pratik, it depends on which glasses you see the world through. If success to me was singing like Sonu Nigam or Shreya Ghoshal or batting like Virat Kohli or being as good as the scientists at ISRO, I'd be a loser too. https://t.co/CclKs0DPUY For all the negativity &amp; obsession with politics, I read 2 or 3 cricket articles every week that make me feel good &amp; which remind me that writing as a whole today is so much better than when I was starting out. Big difference between the written word &amp; the spoken word in news Cricket has taken over the nation and the one question everyone is asking is “What’s the Score?”. But do you know your score?\n\nNow, every Friday is going be filled with fun, cricket and financial fitness. Catch me on #FinanciallyFitterFridays. \n\nDownload the @Chqbook App today! https://t.co/epDqfDq0Qp On the road again today. Done with Nottingham, have a three and a half hour road trip to Southampton. We are all nomads. Spirited run chase by @BCBtigers. Conceded too many to allow for more but they can be proud of this. Eventually though, Australia were too powerful Bangladesh still keeping pace with Australia after 35 overs. Not sure they have the finishing kick. But what fun it will be if they get a move on. Was such a good chase till that wicket of Tamim. Bangladesh are showing that outside of Starc and Cummins, there are opportunities to be had when you play Australia Well.....almost there and 4 overs left! https://t.co/i8kE7pzfOj Top stuff from Warner. At this rate, 350 could be on and that was improbable at one stage. Will be a far tougher chase for Bangladesh than the one against the West Indies RT @BloodDonorsIn: #Srinagar \nNeed #Blood Type :  O-positive\nAt : SKIMS Hospital. \nNumber of Units : 2\nPrimary Number : 9149777801 \nSeconda… RT @selvecricket: To those who think covering the whole playing area is an obvious solution to damp outfields I should remind you that they… @ranjitindia Trolls are cruel. I am grateful for those that supported me. Those weren't trolls Like this Bangladesh line-up. Specialist bowler in Rubel and a dangerous floater in Sabbir. Also gives a leg spin option. Australia back to the team they started with and one I suspect they are more comfortable with I don't think you should worry about social media trolls. Ignoring them rather than giving them the attention they seek might be the way to go https://t.co/YRmpS9YkRc First \"Pitch report\" with @meljones_33 and the \"Batman\" structure in the background. I do the weather and dimensions, Mel does the pitch. But always fun to do something new. https://t.co/0fGiZMU5mn This game takes you to some lovely places. Grateful. This is dinner in Nottingham https://t.co/gQibgN92eA Another World Cup, another heartbreak for South Africa. Their story of the World Cup has been a long running tear-jerker. South Africa's great strength as an outstanding one-day side over the years lay in the fact that they gave the opposition nothing. Everything had to be earned. They will look back at today and wonder about the little things that cost them What a brilliant player, what an understated man. The player you want in your team under pressure. #Williamson @nassercricket Was a bit like the default option on a video game. This embraces so much more. Game of the tournament. Game that will be remembered beyond the tournament. #NZvSA #CWC19 @nassercricket Easy. This one. @Riteshpanth1 Thanks. Corrected Riveting match. 3 overs from Phehlukwayo and 2 from Morris the key ones. NZ will look to target those and take what they get from Ngidi and Rabada. For SA, Rabada has to produce wickets in his two overs. Rub of the green with NZ at the moment. RT @LiveLawIndia: IDIA Harvest 2019: Nine IDIA Scholars Make It To Leading Law Schools,Support Them https://t.co/TqGI4yOkrP Excellent match going on in #CWC19.   South Africa hanging on to their stay at the World Cup. Try telling that to NZ but will be excellent for the tournament and for such an iconic side like SA #NZvSA Along with thoughts on Rohit and Kuldeep..... https://t.co/tKxqwmeH1d RT @BhogleAnita: Having IIM alumni on all IIM boards is a great initiative to bring in industry experience. IIM, Jammu is India's youngest… Strange that Pakistan should announce a review of the team and the support staff while they are still alive in the tournament @gdipak368 @BCCI No. Read the @bcci tweet and found out. @JeevanB38811941 They have been picked as batsmen. That they keep wickets is incidental. You never wish to make a World Cup team on the back of someone else's disappointment. But now that it has happened, let us wish #RishabhPant well. It is the opportunity of a lifetime and he has earned it. My heart goes out to @SDhawan25. Playing in a World Cup, and hopefully winning it, is a dream. If India do win it, he can be proud that he contributed with that wonderful century. RT @BloodDonorsIn: #SOS\n#Varanasi #UttarPradesh\nNeed #Blood Type :  A-negative\nAt : Sudha Surgical Hospital, Ordali Bazar, Tagore Town, Bho… RT @BloodDonorsIn: #Varanasi\nNeed #Blood Type :  A-negative\nAt : BHU Hospital. \nNumber of Units : 4\nPrimary Number : 9811039690\nSecondary N… Afghanistan may have had a near impossible chase but remember, they also needed to convince themselves that they can keep a good bowling side in the field for 50 overs. #WorkInProgress RT @BloodDonorsIn: #Ahmedabad #Gujarat\nNeed #Blood Type :  Any group\nAt : CIMS Hospital. \nNumber of Units : 15\nPrimary Number : 9414496451… This is such a flat deck. #ENGvAFG Hang on, Rashid Khan is in sight of the most expensive bowling figures in odi cricket. Who would have thought! Wow, Morgan is indulging in some range-hitting practice! Afghanistan aren't doing themselves any good with their fielding today Much fun. Even enough time to recall Dr Watson and the Afghan connection! https://t.co/8M92DZpwri RT @chqbook: What is @bhogleharsha hinting at?\n\n#TGIF #Friday #CWC #CWC19 #CWC2019 #ICCWorldCup2019 #ICCWC2019 #ICCCricketWorldCup https://… RT @T20WorldCup: Jake Dunford with a sensational catch for Jersey against Denmark in the ICC Men's #T20WorldCup Europe finals! https://t.co… RT @joybhattacharj: On this day, 36 years ago, Kapil Dev walked in at 17 for 5 and changed  cricket history. That 175* against Zimbabwe at… @AkbaruddinIndia @UN @NagNaidu08 Wow, seriously good! RT @bhogleharsha: Bangladesh have the class, and crucially, the attitude to get these. Will have to combat all the short-pitched bowling th… Thank you. @BhogleAnita https://t.co/assNK8IzL9 @AshishIsRight Jet Airways is, not the promoter... @hirenbhatia22 Beat South Africa This is one of the most powerful batting performances I have seen from Bangladesh. And I have been watching them for a while. Brilliant century, full of sumptuous shots, from Shakib. Very very watchable. Bangladesh on the highway to an easy win More than 100 to get and the West Indies are looking like the game is over..... Am really enjoying this innings from @Sah75official. Not just getting runs but staying ahead of the required rate. So, the lenders are taking #JetAirways to the bankruptcy court. And taking a lot of our experiences with them. Pity. But I guess it was inevitable. RT @BloodDonorsIn: #Guntur\nNeed #Blood Type :  A-positive\nAt : Omega Hospital. \nNumber of Units : 10\nPrimary Number : 9014111944\nPatient :… RT @BloodDonorsIn: #Silchar #Assam\nNeed #Blood Type :  B-positive\nAt : Cancer hospital\nNumber of Units : 4\nPrimary Number : 7002171558\nPati… He's taken a sensational catch. Now, just as dramatic a run-out from Sheldon Cottrell! Good to see a fast bowler doing that. Bangladesh have the class, and crucially, the attitude to get these. Will have to combat all the short-pitched bowling that will come their way. Good match in prospect. That is some Fizz! #BANvWI And this, in Hindi, about the four early signs of cancer.\n\nhttps://t.co/AHOVpnbvO3 Don't ignore the signals  your body is giving you. This, from the Indian Cancer Society.\n\nhttps://t.co/zdM6DRNd8k @BalajiKrish Worth a conversation the next time we meet. With fewer people around and less rain! @tp_vashisht Different position. 5/6 @onkufriends @robbieuthappa @gbhimani Haha, do it for fun sometimes RT @cricbuzz: India extend their unbeaten run to 7 games against arch-rivals Pakistan. @gbhimani, @bhogleharsha and @robbieuthappa dissect… Join us on #CricbuzzLIVE for a frank post game analysis. @robbieuthappa @gbhimani Wow, my India team is identical. Except that I had Azhar at 4. My Pakistan team had Zaheer Abbas instead of Asif Iqbal and Saqlain for Shoaib https://t.co/jrTsalatuG Pakistan now need to win 4 out of 4 to stay alive. Tough. Wonder what the morale is like now. 7 points from 4 games. Strong performances. Many match winners. I think the semi-final is just about putting the key in the lock And so, another one-sided #INDvPAK contest. Other than hoping to get in through D/L at one stage, Pakistan were never in the hunt. @DuteeChand And so, may they continue talking about you, may you continue training and bring glory to India. India's selection has been spot on. Have to hand it to Kohli. Playing Bhuvi ahead of Shami at the start of the World Cup and staying with Kuldeep today. Rain forecast in a while. Even on D/L this game is now beyond reach of Pakistan. Ball of the match from Kuldeep. Babar was looking good.The drift and turn are what a wrist spinner dreams of. Big partnership this. Few overs ago looked like Fakhar was fidgety but that phase has passed. Hopefully that 6pm shower forecast (10.30 Ind time) will not decide the game on D/L The Bhuvi injury is a big blow. With rain in the air, wickets the key. Now that the game has started D/L will favour the side batting second in a curtailed game if they have wickets in hand. India either want early wickets or a full game Wow, nothing on snicko for the Virat dismissal......And he walked! So, who in Pakistan decided that Amir should be recalled! Can you imagine this bowling side without him.. RT @BloodDonorsIn: #Mohali #Punjab\nNeed #Blood Type :  O-positive\nAt : Fortis Hospital. \nBlood Component : Platelets \nNumber of Units : 2\nP… Come on #OldTrafford. You can be quicker in getting those covers off.... RT @robbieuthappa: It's India Vs Pakistan and the excitement is high at the @cricbuzz studio! @bhogleharsha @gbhimani https://t.co/LPU6lSWs… Without breaking a sweat, in a manner of speaking, Kohli has a 50. Set up for a big finish.... India need 330+ on this surface. Will require a strong finish. Pakistan bowled well at this stage against Australia, remember. Sorry, hard to respond individually. But thanks for asking. In #CricbuzzLIVE studio today. Back to England in three days. Brilliant. Given the situation, the intensity of the match and the fluency of his batting, this must be one of his most satisfying. Such class. Excellent start. Rahul will be disappointed but aware he has done a top job. RT @ImranKhanPTI: 4/5 1. In order ro have a winning offensive strategy Sarfaraz must go in with specialist batsmen and bowlers because \"Rai… With all the attention on Rohit, who has been magnificent, KL Rahul has quietly played himself in. This is a valuable 50 RT @BloodDonorsIn: #Noida #UttarPradesh\nNeed #Blood Type :  A-positive\nAt : Kailash Hospital, Sector 27.\nBlood Component : Platelets \nNumbe… RT @BloodDonorsIn: #Noida\nNeed #Blood Type :  Any group\nAt : Fortis Hospital.\nNumber of Units : 4\nPrimary Number : 9910406085\nVia: @jeasbe… Quiet phase. Only one boundary in the last 8 overs..... This is a fifty of undeniable class from Rohit. Shots to remember.....The square cut and the last square drive my favourites Oh, the running! As iffy as the batting is pretty. India lucky with the run-out opportunity. The fielder had to know there was an opportunity. Wahab Riaz wasn't too fussed about collecting the throw at his end either!! Two warnings for Mohd Amir. That is careless. So both teams playing two spinners. Interesting! RT @ShekharGupta: ‘Don't hijack India-Pakistan match to settle other scores, try a 100% to win for sure, but remember it’s a game that teac… For all the hype we generate around it, across the World T20 and the 50 over World Cup, India leads Pakistan 11-0. And Pakistan, other than the game against England, have a dismal recent record. Two reasons why they will have to play out of their skins to win. Thoughts on today's game. The longer it is, the more settled the conditions, the better it is for India because I believe India is the better team and handles pressure better. The shorter it gets, the more it becomes anybody's game. RT @BloodDonorsIn: #Srinagar \nNeed #Blood Type :  Any group\nAt : SKIMS Hospital. \nBlood Component : Platelets \nPrimary Number : 9622532848… If you want to have a fun, chatty, happy look at #INDvsPAK join us on @cricbuzz right after the toss. @robbieuthappa @gbhimani RT @BloodDonorsIn: #Chandigarh\nNeed #Blood Type :  B-positive\nAt : PGI Hospital. \nNumber of Units : 2\nPrimary Number : 7006236262\nPatient :… RT @BloodDonorsIn: #Kishanganj\nNeed #Blood Type :  B-positive\nAt : MGM Hospital. \nNumber of Units : 2\nPrimary Number : 9006387532\nVia: @kha… Sri Lankan fans will be disappointed by the way this one ended. Australia are showing why they had to be in everybody's top three for this World Cup @Jeeeeettt No, that was accurate at the time. They were playing well RT @cricbuzz: Mitchell Starc averts an upset as Australia beat Sri Lanka and garner two more points. @gbhimani, @bhogleharsha and @robbieut… Hugely impressed by Sri Lanka today. They seem to enjoy chasing 300+ totals at the Oval! Rollicking start by Sri Lanka. Will be fun if it continues! @alanwilkins22 @SumedhaSen @mohanstatsman Boundary, three from the next with a short run, six off the last ball Australia have got too many. Look forward to Kusal Perera attacking this target though. RT @chinmaybhogle: Given the pugilistic metaphors being used to describe tomorrow's India - Pak game, re-sharing an old piece that I enjoye… And you can see how they have tried hard to tackle this. Keep your eyes open for Steve Smith. Looking good. https://t.co/Oaio2qJVvC Excellent phase for Sri Lanka. Making Australia work hard for their runs. This is also the phase where Australia have struggled in this World Cup. @SauSatya10 @DanishSait @Shirsh9 @arjunacho @cricbuzz Was a fun show!! Love visiting #London at this time of the year. Looking forward to a great time at one of my favourite cities. #RuPayTravelTales @RuPay_npci https://t.co/4g4bxu5RiU Brilliant. Well done @DanishSait, Shirsendu @shirsh9 and Arjun @arjunacho. @cricbuzz https://t.co/YrsuvqPm07 I am disappointed by the pettiness and jingoism that  #INDvsPAK at cricket is being reduced to. Hopefully it will be over after tomorrow's game. RT @cricbuzz: In a short international career, rarely has a player made an impact the way @Jaspritbumrah93 has done over the last three yea… England coasting in spite of a question mark over two leading batsmen. Have always said the West Indies are a team you have to be wary of, not lose sleep over. RT @Biryaniquest: My childhood friend ESPNcricinfo's senior editor Sharda Ugra, will be speaking at an exclusive dinner on how a sport stee… RT @cricbuzz: Today’s Joy Factor question isn’t as easy as it seems. Know the answer? Send in your responses using #CricbuzzLIVE. https://t… RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  B-positive\nAt : Balrampur Hospital. \nNumber of Units : 2\nPrimary Number : 8574586645\nVia: @… RT @IDFCFIRSTBank: The match everyone’s been waiting for is finally here! Before the much-anticipated #IndVsPak face off, find out who’ll b… The most unlikely and the most wonderful double act in Indian cricket. @SGanguly99 and #JohnWright. Sourav always told me that what mattered was that \"Wright was a good man\". He played a big role at a crucial stage in Indian cricket. https://t.co/oYyV1iTwTk RT @BloodDonorsIn: #Bhubaneswar\nNeed #Blood Type :  AB-positive\nAt : KIMS Hospital. \nNumber of Units : 2\nPrimary Number : 8144184008\nVia: @… RT @BloodDonorsIn: #Pondicherry\nNeed #Blood Type :  A-positive\nAt : Mahatma Gandhi hospital \nNumber of Units : 2\nPrimary Number : 986544752… RT @BloodDonorsIn: #Vizianagaram\nNeed #Blood Type :  AB-negative\nAt : Mahatma Gandhi Cancer Hospital\nNumber of Units : 2\nPrimary Number : 9… RT @BloodDonorsIn: #Nandyal\nNeed #Blood Type :  O-negative\nAt : Vijaya blood bank\nNumber of Units : 1\nPrimary Number : 9182264807\nSecondary… RT @cricbuzz: 'New Zealand will be very happy walking away with one point' feels @Sdoull on #Centerstage with @bhogleharsha and @collinsada… So the inevitable......was always going to an uphill battle against the elements. A point each and both teams stay unbeaten! Very dark now. Huge cloud. This is proper rain. Think both teams will stay unbeaten now..... Like Sisyphus, the ground staff here take the covers off and almost immediately begin the process of putting them on. Covers now coming off for 6th or 7th time @RicFinlay Et tu Ric? Neutral, I take it! 😊 RT @cricbuzz: On @My11Circle presents #CricbuzzLIVE, our panel examines #TeamIndia’s No.4 dilemma and gives their take on the ideal fit for… @legsidelizzy I know, but we are running out of time. Everytime they take the covers off, they scurry to put them on again. Oh dear! Was looking good and here comes the drizzle again. Big issue here is even if stops there is neither sunlight nor a breeze to dry the outfield. Also, the covers cover the square and not the entire ground. RT @BloodDonorsIn: #Gurugram\nNeed #Blood Type :  A-positive\nAt : Medanta Medicity\nBlood Component : Platelets \nNumber of Units : 2\nPrimary… The forecast is getting better. The probability of rain is down to 50%. It is brighter. But then, it is the weather and can be fickle, can't it? RT @cricbuzz: India and New Zealand, two unbeaten sides of the tournament gear up to face each other at Trent Bridge. On Centerstage, @bhog… RT @BloodDonorsIn: #Cuttack\nNeed #Blood Type :  O-negative\nAt : SCB medical college\nNumber of Units : 2\nPrimary Number : 9338817574\nVia: @j… RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  Any group\nAt : Sehar Hospital, Dalyan\nBlood Component : Plasma\nNumber of Units : 4\nPrimary… RT @virenrasquinha: Yessss!!! Congrats to the Indian Men’s Recurve Archery team as they beat Canada 5-3 &amp; enter the QF #ArcheryWorldChampio… Had said in my World Cup preview that Australia were vulnerable if Stoinis were to be absent because they had three reserve bowlers and one reserve bat, neither of whom had a significant second skill Incredible fightback from Pakistan. Have scored 94-1 in the last 12. Game on still... I suspect Finch is already looking around for bowling options. This isn't the scariest Aussie bowling line-up... This is a decent start by Pakistan. Maybe one wicket more than ideal for them but at the moment, they are pacing the chase well. Interesting that Warner talks about bowling a test match length. But they are about 30 behind where it seemed they would finish. 70-30 to Australia at this stage. Pakistan need to be 100/120-1 to mount a serious challenge. RT @joybhattacharj: One Pakistan team turned up against the West Indies, a completely different looking side against England. Today, both h… This flurry of wickets at the end has given Pakistan a glimmer. It is still a daunting total but Amir has brought them back. #AUSvPAK Has anyone else noticed that every non-striker is behind the crease when the ball is bowled? Everytime. As it should be. So hopefully the era of running less for a run is over. Mohd Amir is showing his pedigree today. He always had it but turned up in disguise too often. But class comes through. Good to see play on for now in Taunton. Both teams similarly structured. Four quicks and someone who can bowl off-breaks. Important game for both On a train to Nottingham. The forecast for tomorrow has turned dire but you have to hope and be ready! RT @bizpunditz: \"A pause is also a sign of confidence\" says \n@bhogleharsha Watch how to deliver your message effectively from Harsha Bhogle… RT @IDFCFIRSTBank: Will India beat New Zealand to continue the winning streak? Watch Ep. 4 of #CricketFirstWithHarsha to know the #GameChan… If indeed Dhawan is out for 3 weeks, India have a tough decision ahead of them. Do they seek a replacement, in which case he is out of the tournament (unless back as a replacement for another player) or do they back Shanker and Karthik to bat at 4 till he is fit again. RT @BloodDonorsIn: #Vellore\nNeed #Blood Type :  Any group\nAt : CMC Hospital. \nBlood Component : Platelets \nPrimary Number : 9827572588\nPati… RT @BloodDonorsIn: #Srinagar\nNeed #Blood Type :  A-negative\nAt : Super Specialty Hospital, GMC\nNumber of Units : 2\nPrimary Number : 8082590… RT @BloodDonorsIn: #Visakhapatnam\nNeed #Blood Type :  A-positive\nAt : RK Hospital\nNumber of Units : 2\nPrimary Number : 9603272434\nSecondary… RT @BloodDonorsIn: #Mancherial\nNeed #Blood Type :  O-negative\nAt : Samantha Raghavrao Nursing Home.\nNumber of Units : 2\nPrimary Number : 96… RT @BloodDonorsIn: #Madurai\nNeed #Blood Type :  AB-positive\nAt : Meenakshi Mission Hospital\nNumber of Units : 5\nPrimary Number : 9942490424… RT @BloodDonorsIn: #Jaipur\nNeed #Blood Type :  AB-negative\nAt : Santokba durlabh ji Hospital. \nNumber of Units : 2\nPrimary Number : 8875452… RT @BloodDonorsIn: #Nagpur\nNeed #Blood Type :  O-negative\nAt : CIHHO Dhantoli Nagar\nNumber of Units : 2\nPrimary Number : 9421744273\nPatient… Well played @YUVSTRONG12. As @sachin_rt once told you, you were there when India needed you. Enjoyed watching you play, that bat swing will be embedded in my memory, and I hope you are happy and at peace in life after a staggering innings. Delighted to announce my partnership with @Chqbook with a common vision to make every Indian #FinanciallyFitter. From this day onwards, let’s join hands on a goal to become our financially fittest self. Check your Financial Fitness Score on the Chqbook app. https://t.co/sPiJCEnP3J I get the feeling sometimes, judging from what goes out, that social media handles of media houses and TV channels are seen as a necessary evil and assigned to the new kid on the block. Maybe, hopefully, this will prompt a relook. India Today's terrible headline on the passing of the mighty #GirishKarnad must draw attention to how media houses assign different levels of rigour to different forms of media. The print edition, am sure, goes through many levels of fact-checking and observation. RT @cricbuzz: India had a lot of positives from their win over Australia feels @bhogleharsha as he analyses the game alongside @collinsadam… The Oval was blue today. With every passing year the proportion of Indians in the crowd grows. This was almost unreal today The 86 off 44 balls between Pandya, Dhoni and Rahul was probably the difference eventually. And I thought Bhuvneshwar was excellent. I was a sceptic, to be honest, but delighted for him. Top win for India. Batsmen provided a safe total and in intervals, which is important to recognise, the bowling was excellent. This is a powerful performance and reminiscent of the start in 2015. Game on. Maxwell is changing the course of the game. India need Bhuvneshwar to bowl a tight spell here. Won't be easy, there is little movement for him @GabbbarSingh Not just the hundred he got but the role he played in easing the other two into their innings. Brings a smile. @cricbuzz. #CricbuzzLIVE https://t.co/9p6aqXAktp Have to believe this is enough for India This is a powerful batting statement by India Don't underestimate the importance of the Dhawan innings. Allowed Rohit and Kohli to ease themselves in and set the scene for Pandya. The ebbs and flows of a 50 over game. Dhawan looking excellent, Virat just a bit edgy......Australia concerned about how to get overs from bowlers 4&amp;5 out....... Big part of this match. Starc and Cummins vs Rohit and Shikhar. RT @chqbook: @bhogleharsha is in the commentary box today, but tomorrow he’s coming to your phone screen. Watch Harsha share his honest tak… RT @cricbuzz: Watch @bhogleharsha and @collinsadam preview the much-awaited clash of the titans, as India take on fierce rivals &amp; reigning… Delighted to see one of my favourite players @Sah75official batting the way he is. Class! Didn't even notice that! Not my scene. The food was lovely and cheap! https://t.co/KGHdeYyPSn What a morning! Filming at Portobella Road Market near Notting Hill in London. Street food from all over the world. Bustling. Energy. Smell of food. Many languages and accents. And the food is only a part of the activity. https://t.co/vqLMvU1CVv RT @IExpressSports: Dhoni may have to remove the insignia from his gloves for now. But it is unlikely we have heard the last on this issue.… RT @BloodDonorsIn: #Kupwara\nNeed #Blood Type :  O-negative\nAt : District Hospital Handwara\nNumber of Units : 2\nPrimary Number : 9596558621… RT @BloodDonorsIn: #Guntur\nNeed #Blood Type :  AB-positive\nAt : Shree Hospital, Donkaroad, Mallikarjuna Peta \nPrimary Number : 8121964292\nV… RT @BloodDonorsIn: #Vijayawada\nNeed #Blood Type :  AB-positive\nAt : Anu Institute of Neuro and Cardiac Sciences.\nNumber of Units : 3\nPrimar… RT @cricbuzz: Can @SDhawan25 replicate his multi-nation tournament form at the #WorldCup? Here is @bhogleharsha with a new episode of #Cast… RT @IDFCFIRSTBank: Looking forward to the #INDvsAUS matchup? Watch Ep. 3 of #CricketFirstWithHarsha to find out who’ll be the #GameChangers… He's a riot @Brad_Hogg https://t.co/I6FAT9yciD RT @chinmaybhogle: More Henry Olonga\n\nhttps://t.co/GpQcsXcwtd Well done. @pringlesindia for creating a Guinness World Records structure with 10,005 Pringles Cans - All the fans saying #GetItBackIndia - take a look at this! Nice! @GWS https://t.co/2qynX9ZAcE @deburchery Yes. And I hope people don't say the defeat was solely due to the umpiring. That will hide the real reason. RT @cricbuzz: On Centerstage, @bhogleharsha and @collinsadam analyse the contest between Australia and West Indies that saw the defending w… @GappistanRadio Or when the ball hits the stump and the bails don't fall. Works both ways. You can tell yourself it was the umpires but that would mean you are unwilling to look at the real reason. @pakwakankar On Gayle and the no-ball, yes. But on another day he would have been bowled when the ball hit the stump. Yes, the umpires had an off day but that wasn't the reason the West Indies lost. At important moments, Australia were the better side. Starc was magnificent as were the lower order batsmen who took them to 288. My man of the match was Coulter-Nile too On a train to London and the entire coach is talking about how the West Indies didn't win! RT @BloodDonorsIn: #Lucknow\nNeed #Blood Type :  B-positive\nAt : Trauma Centre, KGMU \nNumber of Units : 2\nPrimary Number : 9565165694\nPatien… RT @BloodDonorsIn: #Thane\nNeed #Blood Type :  B-positive\nAt : Kaushalya Hospital\nNumber of Units : 3\nPrimary Number : 9967330418\nSecondary… The West Indies had this match in their grasp. Some poor decisions have cost them 2 points. Holder is playing a fine innings. Brathwaite has to put him back in strike at every opportunity. I fear the West Indies are making it tougher for themselves. If Russell was batting in the 45th over, the game was done This match has been a celebration of fast short pitched bowling on a ground where 400 has been scored a few times! The Umpire Strikes Back. Eventually. #Gayle. Stunning. Just stunning, that catch from Cottrell. Deserves two salutes! So.........nobody likes bounce.....#AUSvWI Great fun watching these West Indies quicks. Oshane Thomas looks very uneasy to face and Cottrell, apart from the best celebration in the game, is a fine bowler too. RT @BloodDonorsIn: #Rewa #MadhyaPradesh\nNeed #Blood Type :  O-positive\nAt : Sanjay Gandhi hospital \nNumber of Units : 2\nPrimary Number : 91… RT @BloodDonorsIn: #Ghazipur #UttarPradesh\nNeed #Blood Type :  B-negative\nAt : Lifeline Hospital. \nNumber of Units : 1\nPrimary Number : 639… RT @crowngaurav: @BloodDonorsIn I no words to express my gratitude towards you but still wanted to thanks for this wonderful life saving op… RT @BhogleAnita: Genpact's CEO @tyagarajan says he \"spends a couple of hours a month learning python &amp; about AWS and Azure\". The learning c… RT @cricbuzz: On Centerstage, @bhogleharsha and @collinsadam analyse India's comprehensive win over South Africa in their first game of the… @NeilManthorp The World Cup dates were released long before the IPL or the Indian election dates were Wonderful result for India. Many boxes ticked. Bumrah was magnificent as was Chahal and India will like the solidity from Rahul and Dhoni. And Rohit Sharma was unhurried, his slowest odi century but one that was invaluable Top century from Rohit Sharma. Composed, relaxed. Rode the early tension well and has been a picture of certainty since @vikramsathaye @sunandanlele @ajinkyarahane88 Visarlat ka konala tari? All of us thought it was going to be a 350 World Cup. Average score so far is 240 and we are starting to getting good contests. This is nice!"}