{"tweets": "@ElizabethRaeCat Thanks for shopping with us, Elizabeth! 💋 @fameiscourtney You know we love shopping with our Angels! See you soon, Courtney! 💋 @GigiActress We're sharing your request for Crush with our Beauty Team, Gisselle! ♥ @rachrich423 We love our Angels! We'll share your concerns with our Team for consideration in future Angel Card benefits! ♥ @_chenelbiancaa We would love to help! Please send us a DM with more details, your full name, email, order number, and complete shipping address. Talk to you soon! @BatistaYaisi We'd love the opportunity to learn more so we may best share your feedback. Please send us a private message with the details of your experience along with your email address, phone number, and exact store location. Thanks! @shayes920 You're welcome, and we'll be sure to share your request with our team! @gemshepetch Oh, no! We would love to help! Please send us a private message with the bar code number on your receipt if purchased in the store, order number if purchased online, along with first and last name listed for the order, shipping address, email address, and phone number. Thanks! @shayes920 Oh, no! We recommend clearing your cache and cookies or trying an alternate website browser. If that doesn't work, please call us at 1-800-888-8200 and we'll be happy to place your order for you, Stephanie. Thanks! @IlisonChicago Stay tuned for new and exciting updates, but in the meantime check out our Holiday Preview featured online now. Happy shopping! @bg54588 Oh, no BG! We are up and running, so we recommend clearing your cache and cookies or trying an alternate website browser. Thanks! @Missrealthing Oh, no Liz! We'd love the opportunity to learn more so we may best share your feedback with our technical team. Please send us a private message with the details of your experience. Talk to you soon! @sarahbethsafari Of course we will price match as long as you are getting the same item just in a different color or size. We also cover the standard shipping fee on exchanges. @Amels3 We do have a store in France, Amel! Here is a link so you can check it out: https://t.co/GbJ0mQMfny @sarahbethsafari We're happy to help! Please place your order online, send us a DM with the old order number, the new order number, your full name, email, and shipping address and we'll take care of the rest as if it were a phone exchange. Thanks! Get 3 FREE PANTIES when you buy 3. One in every color, please. Excl. apply: https://t.co/McAHcHszra https://t.co/tXU4VyyqoM @Sara_heree Oh, no Sara! We'd love the opportunity to learn more so we may best share your feedback. Please send us a private message with details of your experience along with your email address, full name, and phone number. Thanks! @nikkiloumaz Oh, no Nicola! Please send us a DM so we can point you in the right direction for returning this fragrance. Thanks! @kellyy_ann73 Thanks for allowing us the chance to make it right, Kelly! @SimmiePurdie We can definitely share your interest with our team, stay tuned @soniaaafaye So hot! @GEss20chops We've replied to your DM and look forward to your reply, Samantha. Thanks! @kellyy_ann73 We would love to share your disappointment with our team, Kelly. DM us your order number, email, name on the order and shipping info when you have a sec. Thanks! @c_nikkki Please DM us your full name, email, mailing address, and purchase details for your bra so we may learn more! We look forward to hearing from you soon! Score 3 of your favorite panties for just $15. Excl. apply: https://t.co/v66iB8bD5F @MalaySl What a cute idea, Mikaela! Super creative, we love it! ❤ @MrsHungryAsian So sorry your local store didn't have any Bombshell Bras available, Sharon! We have them online and invite you to shop at https://t.co/6evRbzV4HQ. We hear good things come in threes. Buy 2, get 1 FREE bras for a limited time! Excl. apply: https://t.co/zzh6lIwj3I https://t.co/p2TT5ARaC1 @missflowerny That's what we love to hear! We strive to always provide our customers with a shopping experience that is never shy of perfect! We also believe in providing our associates and store locations with the proper recognition they deserve. ❤ @DemonQueen31 We're concerned! Please DM us with your order number, full name, email address, and full mailing address. Thank you! @bossey031 We're concerned, Steph. Please DM us with more details! @Shahin35288396 This is Sara Sampaio! @T_Mack67 We've let the team know you'd love to see your fave Bombshell Summer return! @heyismee We've let the team know you'd love to see our So Obsessed Bra return! This is major: 3 FREE PANTIES when you buy 3! Excl. apply: https://t.co/ZDlAX0b7iA https://t.co/iNaS42PXaW @cmeshanko Sounds Ah-Mazing! See you there! @cmeshanko Time to schedule your next vacay, Christine! @Bunga_Cowa You can grab this Banded Plunge Teddy in either Black or Rich Chestnut here (on sale!): https://t.co/Z4HbfKC1Cg. Enjoy! @GowerTalbert We're glad to share your request with our team, Anne. Stay tuned! @TBroczkowski We'd love to learn more, Tamera. DM us some detail, including your email, phone number, receipt info and the best time to reach you. Thanks! @theojsunnyd Let's heat up the Holiday's a little bit with this Strappy Teddy: https://t.co/QPQnXtOsZg. We say go for it! @M_K_Armstrong Thanks for allowing us to make this up to you, Mackenzi! @BabyyWipes Sure! Become an Angel here: https://t.co/rXX8QFWhWR @M_K_Armstrong We're here to help, Mackenzi! DM us your order number, email, shipping address and the item number that is missing. Thanks! @bburch__ Oh, no B! We'd love to help. Please send us a private message with your full name, email, and the exact store location you visited. Thanks! Buy 2, get 1 free bras. Did someone say *Best Friday Ever*? Excl. apply: https://t.co/cTg0Zd9nZb https://t.co/njgNFo3MHG @chanelkissa Well, you deserve to treat yourself😍 @burpeesRfun Please call us at 1-800-888-1500 so we can look into this further. Our phone lines will open at 8am EST. Thank you! @helluvaStella1 Oh yea? We can't wait to hear how much you love them! @DallasRatliff We would like to learn more about your friends customer service experience! Please send us a DM with more details along with the  which store location she visited. We hope to hear from you soon! @craig_strickers We'd like to know more about the experience you've encountered today at our Green Hills Nashville location, Craig. We'd like to speak with your directly. Please send us a private message with more details please. We look forward to hear from you soon! @Beebs_Bryant10 We have shared your request for candles with our team ❤ @MariaLolas3 We understand your disappointment on quality concerns for your recent bra purchase and we'd like to hear more, Maria. Send us a private message containing your order number or store receipt bar code, email address, and full shipping address. Thank you! @bring_u_JOI Happy shopping ❤ @krisrenee4 We apologize for any disappointment and are happy to review your order, Kristin. Please DM us your full name, email, mailing address, and order number. @ChristianaWlkr Sounds like you got an amazing deal! Saving money is the best😍 @DJJulieTwinkle We'd love to help, Julie! Please send us a private message with the first and last name listed for the order, email address, order number, and shipping address. Thanks! @blakefreeman10 Thanks for letting us make this right, Blake. We look forward to shopping with you again soon! @blakefreeman10 We've replied to your DM and look forward to your reply! ♥ @blakefreeman10 Not the impression that we want you to have, Blake. DM us when you have a sec. We'd love to help! @chinitababy2005 We'd like to learn more, Cindy! Please DM us with your order number, email address, and full mailing address. Thank you! @ash_noelle23 We'd like to learn more, Ash. Please DM us with more details. Thank you! @br00t4lly We have let our team know that you are missing Tease Flower! @jesssica_eve We would be happy to see where your order is, Jessica! Please send us a DM with your online order number along with your full name, shipping address, email address and phone number. We hope to hear from you soon! @jasminejones020 Now is the time to grab all of your favorite styles! @Cass2946 Our PINK panties are not a part of this deal, Ces!  We currently have 5 for $28.50 on many of our PINK styles https://t.co/kwzjMROloI! @HaleyChapp We thank you for giving us the chance to make it up to you, Haley! Buy 3 panties, get 3 free! Your lingerie drawer deserves a makeover. Excl. apply: https://t.co/CphMQtbo9V @Ishtar_Gorial We'd like to help! Please DM us your email address and we will make sure you're removed. Thanks! @coladaonenonly We'd like to hear more about this experience so we may share your feedback. Please DM us the store location and more details. Be sure to also include your full name, address and email. @This_Is_Shellie So sorry for the delay, Shellie! Please take a look at your DM's when you have a moment! @This_Is_Shellie We're sorry you've had a bad experience with your order, Shellie! We're here to help. Please send us a DM with more details, your order number, full name, email, and complete shipping address. Talk to you soon! @claschulz Best day EVER, Katie! ❤ @Heatherimb We'd like to learn more, Heather! Please DM us with more details. @Dolphen__ We've let the team know you'd love to see Breathless return! @lovetobehrtr We're concerned, James. Please DM us with more details. Include your store receipt barcode number. Thank you! @kateeecarrara We'd like to learn more, Kate. Please DM us with more details. Thank you! @JaimeHef We'd like to learn more! Please DM us with your order number, full name, email address, and full mailing address. Talk to you soon! @Educated517 You deserve to treat yourself😉 @GoodTimeLauren Not valid in the UK at this time, but we are happy to share your interest with our team for future consideration. Shop buy 2, get 1 free bras! Because three’s a charm. Excl. apply: https://t.co/IoMbtvQy3t @BerenisValdivia Let us help! Please DM us your full name, billing address associated with your Angel Credit Card, and your email address. TY @SnowyFairest You know we always got your back! @some1namedSonya We would be happy to take a look into this for you! Please send us a private message with your purchase receipt details/online order # along with your full name, email address and phone number. We hope to hear from you soon! @K_Eli28 We would be happy to help, Katie! Please send us a private message so we can further assist. Thanks! @ashmonster1988 Agreed! The PINK Collegiate Water Bottles are the perfect way to stay hydrated!  💦 @takierac_ We are so sorry to hear this has happened a 2nd time with your orders, Takiera. We'd like to share your feedback and further assist. Please DM us your order number, first &amp; last name, email and shipping address. @LadyBeastB So sorry, Maxx. Purchases made in Bath and Body Works do not earn rewards or count towards points towards upgrading to Angel VIP. @jesshckmn We love shopping with you, Jess! 💋 @carmeldelight5 We're sorry to hear that your bra has become damaged, Brandy! Please send us a DM with your full name, email, mailing address, and order number/receipt barcode number for your purchase. Your favorite bras are now $14.95 &amp; up. You know what to do. Excl. apply: https://t.co/Coud4pVnes https://t.co/1vp3sfszYP @jessi_berry We will be sure to share your interest with our team for Scandalous. The 2 scents do smell different. Scandalous is a warm scent, and Scandalous Dare is a fruity floral scent. @MustangVB10 Glad we could help! @MustangVB10 We're sorry to let you down, Dakota. DM us your order number, email, shipping address and phone number when you have a sec! @bwill1130 Our sport bras will take you to your next level! Enjoy! @LaBelle_Iris We're disappointed to hear of your quality concern. Send us a DM letting us know when/where your bra was purchased, and be sure to indicate your full name + email when reaching out. @Cass2946 This sale won't be around long! Shop soon to avoid missing out! @trixie6696 We've replied to your DM, Laurie. Please, take a look when you have a moment! @bronxhoops2033 We hate to hear this, Jere! Please DM us more details so we can be sure to share your feedback. @ohdidyu_sayTab We have shared your request with our team, Tabitha! Sunday fun-day is finding your favorite panties at only $6.95. Excl. apply: https://t.co/G3JhQtHiEs https://t.co/9OyYFM0ypb @superenchantedt That's what we love to hear, Saralyn! 💛 @Deana_LB We are so very sorry about your experience when shopping with us and we would like to know more so we may share your feedback. Please send us a private message with more details and the store location. We would greatly appreciate it. @puppymom93 We are concerned about your experience and we would like to speak with you further, Angie. Please send us a private message with your phone number, email and best time for contact. We would really appreciate it. Swooning over the Dream Angels Demi? Shop the sale—now’s the time to make it yours. Excl apply: https://t.co/WWpMLeo0Dk @LoRedd2 Oh, no! Please call the Angel Card company at 1-800-695-1526 to discuss your options as we don't have access to your account. Thank you! @_dre_a We will be sure to share with our beauty team you'd love to see Scandalous return, Andrea! Cozy &amp; chic or sultry &amp; slinky? You can have it all in the Fall Sale. Excl. apply: https://t.co/EjBsSJXsyV https://t.co/t3oEBFqF37 @shantoriadivine Yesssss! Own it, Angel! @taneshia21 We'll let our team know of your interest, Taneshia! @abbymichelee You already know: https://t.co/9bbOb0nywh @mlschaub We're concerned, Marci. So we may share this, please send us a DM with any further details along with your full name, email address, and phone number. Thank you. @iLoveKellina Oh, no! This is not what we want to hear. We'd love the opportunity to learn more so we may best share your feedback. Please send us a private message with the details of your experience along with your full name and email address. Thanks! @iamcassidy We're sorry to hear about your recent experience, Cassidy! We'd love the opportunity to learn more so we may best share your feedback. Please reply with your full name, email, shipping address, and exact store location. Thanks! @Michele27Rivera We are happy to share your request with our team, Michele! @Amazon_ksa_ebay So sorry to hear that! Please call Angel Card services at the number on the back of your card to ensure your info is current. @Geny_VSmodel We'll be waiting! We're excited to shop with you, Genevieve! 🛍 @Jayyyne So sorry you are still receiving unwanted emails, Jayne. Please DM us  your first and last name, email and address so we can ensure it is fully removed. @Its_CrystalLee Sorry to hear you are still waiting for assistance, Crystal. We'd be happy to help! Please DM us more details and be sure to include your order number, first and last name, email and shipping address if in regards to an online order. @rilestia So sorry your order didn't go through! We'd be happy to double check this for you and ask that you DM us your first &amp; last name, email and shipping address. @AmFamJean We're always happy to help and have been sure to share your kudos with our team, Jean! We look forward to shopping with you again soon! ❤ @guznnan We would love to help, Karina! Please send us a private message with the bar code number on your receipt if purchased in the store, order number if purchased online, along with first and last name listed for the order, shipping address, email address, and phone number. Thanks! Bikini or Brazilian? Go for both—panties are just $6.95. Excl. apply: https://t.co/9UmxW7ns9X https://t.co/WwSaUJqmz3 @jam_onme We assure you your voice will be heard♥ @rrroyalle We're here to help! Please send us a DM with your order number, full name, email, and complete shipping address so we can help. Talk to you soon! @mikayla_1 Oh no! We would be happy to help with your missing leggings, Mikayla! Please send us a Dm with your order number, full name, mailing address, email address and phone number. We hope to hear from you soon! @pefortin12 We are so sorry for the delay, Paige! So we may further assist, please DM us your order number, first &amp; last name, email and shipping address. @Charla4Mayor We've let our team know you'd love to see a free umbrella promotion soon, Charla! @ashleyaksu Thanks for reaching out, Ashley!  We've shared your request! @TeresaBarbiere We've shared your feedback, Teresa! @QueenLainey_ We know that you're excited to receive your order and we're sorry that it hasn't been delivered, Lena! Please DM us the full name, shipping address and email on the order so that we can take a look. Thank you. Luxurious lingerie at prices too good to miss. Shop the Fall Sale before it ends. Excl. apply: https://t.co/UAsUxpjv18 https://t.co/Suvu55mCix @thegracechan_ So glad to hear what a great experience you had speaking with Sandra in regards to your credit card, Grace. We've shared your feedback with our leadership team and thank you for providing your feedback. @xoxdieselxox There should not be any impact. We can't wait to shop with you. @xoxdieselxox The order will ship from our warehouse in the US. @1223Sheri We'd like to learn more, Sheri. Please DM us with more details. Include your purchase details, email address, and full mailing address. Talk to you soon! @Rauwessa We're concerned. Please send us a private message with any further details, along with the bra style, and when you purchased it. Also, please include your store receipt barcode number/order number, full name, and email address. Thank you. @TrueXtina We'd like to learn more, Christina. Please send us a DM with further details. Also, please include your order number, full name, and shipping address. Thanks. @AllisonStyless We'd like to help, Allison! Please send us a DM with further information. Thanks! @BooBreen We'd like to help, Stefanie! Please send us a DM with your order number, full name, and shipping address. Thanks! @_CWestlake_ We're truly sorry to hear your order was not processed, Cheyenne. So we may share this with our team, please send us a DM with your full name, email, and shipping address. Thank you. @LizxNguyen Clearance goes fast, Liz! Keep your eye peeled for upcoming offers! @_CWestlake_ Let us help, Cheyenne! Please DM us your order number and the full name, shipping address, &amp; email associated with the order. Thanks! @estefanyyyyym We would love to help! Please send us a private message with the bar code number on your receipt if purchased in the store, order number if purchased online, along with first and last name listed for the order, shipping address, email address, and phone number. Thanks! @Brianajeanell_ We'd love to help, Bri! Please send us a private message with the first and last name listed for the order, email address, order number, and shipping address, so we can check on your order for you. Thanks! @XShaniaa19 You deserve to treat yourself, Nia😉 @SlimShaky7 Please send us a private message with your bar code number on your receipt if purchased in the store, order number if purchased online, along with first and last name listed for the order, shipping address, email address, and phone number. Thanks! @JennSoJuicyy We will be sure to share your request with our store team for future consideration, Jenn! @linds_1989 We are happy to share your request with our merchandise team for future consideration, Lindsay! The weekend’s a long way away, but you can start planning for it with $19.95 &amp; under lounge styles. Excl. apply: https://t.co/JYRjkcYQjY https://t.co/Dt7ANADu5S @e2dadot You're welcome, and thanks for providing your local store location! @e2dadot We're happy to share your request with our store partners! @iamdrearose We will certainly share you'd love to see us carry up to a size 36G, Drea! @emyyamor We've shared your request with the team! ❤ @maryau89 Thanks for shopping our sale! Enjoy! 💋 @cptaindanverss We let the team know you'd love to see Vanilla Lace return, Amiel. @trilla_manilla We would like to learn more about your visit, Zoe! Please send us a Dm with more details long with which store that you visited along with your full name. phone number and email address. We hope to hear from you soon! @paisleypepp We'd like to help! Please DM us your purchase info (in-store receipt/online order #) your full name, mailing address, &amp; email. Thanks! @_haleyveal We've shared your request with our team, Haley! ❤ @brookemcgraw4 We would like to learn more! Please send us a DM with more details so we can further assist. Thanks! @abipie1 Oh no! We have shared your feedback regarding your fragrances not spraying with our quality assurance teams, Abigail! Your favorite panties at a can’t-miss $6.95? Run, don’t walk. Excl. apply: https://t.co/xKwfNAneDC https://t.co/UYgxY4ZHnG @Ms_Pink_N_Green Please call the Angel Card company at 1-800-695-1526 as we don't have access to your account/points. Thanks! @Ms_Pink_N_Green You are right, there are triple points and free shipping on Fridays! @tuckslilgirl So sorry for any disappointment! We've let our team know how much you love the Angelight style and would love to see more available, Ms. C! Be sure to check out what we have left online at https://t.co/BqITLu3A1t. @OMGCook It's our goal to ensure your satisfaction, Leanne😍 @KyraNadiya_ We can't lose you! Please DM us &amp; tell us how we can help. Thanks! @QuietSt03909285 So much to choose from, let's start here: https://t.co/IT8sSB2NKB @jodil007 We'd like to learn more, Jodi! Please DM us with more details. Include your store receipt barcode number, email address, and full mailing address. Talk to you soon! @langggx_ We let our team know you'd love to see Dark Flora return, Lainy! @LeftTwicks We would be happy to take a further look! Please send us a DM with your gift card number along with your name, email address and phone number. We hope to hear from you soon! @LeftTwicks We apologize for any disappointment. Pre-paid gift cards backed by VISA, MasterCard, American Express, etc. are redeemed as a credit card - only one may be used per order. Click here for more information: https://t.co/jCDGt5xFiu @celeb211 We'd like the chance to connect with you further. Please DM us your full name, email, and best daytime telephone number. @ryleighlanee 👏👏 @MegEGraham Be sure to partner with your local store for more details! @Mandy_De We have made sure to share your feedback with the proper teams! @AndreaZ07589257 Only for a limited time, Andrea! Shop soon! @dollfaceneena Yes, it is! 10 panties. $35. Get going. Excl. apply: https://t.co/SOim4rVbia https://t.co/V7ZPRe8T66 @alidiabby We love this fragrance too! Pssst…that teddy you’ve been eyeing just might be part of our Fall Sale! Excl. apply: https://t.co/E4b9c7q8Cs https://t.co/R9pfxF8hPx @BreezSkn We're happy to check the status of your return. Please send us a DM with the order number, the name on the order, email and shipping address. @k8fail We apologize that your bra ripped so quickly, Kate! Our quality assurance team would like to know more. Please send us a direct message with additional details, the style of the bra and your email. Thanks! @dommyt_1618 Glad you love your new PJ's, DeeDee! ❤ @Bfg_iBall We invite you to unsubscribe online now, Mike. @navas_cinthia They're the perfect way to lounge in style! @SOimLikeWord Shop your fave here: https://t.co/SXlmXHYyPv Thong, bikini, cheekini—collect them all when you shop 10/$35 panties. Excl. apply: https://t.co/fJb1TMN0Fm https://t.co/EDuDBh3aWO @imogenxmcqueenn We value your feedback and would like to learn more. Please reach out via DM when you get a moment. @janettxgarciaaa It's the perfect time to stock up, Janet! @kellyyd_ You can never have too many! 😉 @MayXOLiss We're excited to shop with you, Elissa! The only weekend plans you need? Fall Sale. Excl. apply: https://t.co/E8KKwMb9O0 https://t.co/WFojmxmPLo @Chronic_Cranky The Panty Party is still going on! Check the deets on the back of your Birthday coupon for compatibility. Thanks! xoxo @_bereniceebruhh We're here to help. Please DM us your order number, shipping address, phone number &amp; email. Thanks! @TaterTots4Me We can imagine your frustration after being sized incorrectly. We've made sure to forward your feedback with our Leadership Team for review. We appreciate your comments. @zulkisrg We're sorry to hear your orders were canceled, Zulka. Please send us a DM with your order number, full name, and shipping address. Thank you. @sarahashley_11 Not currently but we will be sure to share your interest in their return, Sarah! @MissyYaYa Please send us a DM with further details. Also, please include your full name, billing address, and email. Thanks. @MissyYaYa We can only imagine how frustrated you may be. We've made sure to forward your feedback with our Leadership Team. For assistance, please reach out to our Angel Card Services at 1.800.695.1526 Mon-Sat 8am-9pm EST. Thank you. @Katiekat_2016 We're here for you, Kay! Please DM us and let us know how we can help. Include receipt/online order number, your full name, mailing address, and email. Thanks! Shop 40% off PJ sets, the perfect accessory to movie night. Excl. apply: https://t.co/Kx2XEPdrGG https://t.co/opvPgwPIip @StarrFoxx9 We're truly sorry to hear this. Please send us a DM with your full name, billing address, email address, and phone number. Thank you. @lovpenelope We're sorry to hear our website has not been working properly. Please clear your cache and cookies. If this does not help, please send us a DM with the error message you are receiving. Thanks! @__biancaeileen We're sorry to hear your bra strap broke from only your second time wearing it, Bianca. We'd like to help. Please send us a DM with your purchase info (store receipt barcode number or online order number), full name, and email address. Thanks! @WOFFlehouse We don't love this...one bit! Please DM us the long # under the barcode of your receipt, your full name and mailing address. Thank you! @joanncione We like the way you play, Joann. You're right...what he doesn't know... $25 sport tights? Your personal best is closer than you think. Excl. apply: https://t.co/tPT7TUG6ut https://t.co/niWzjwDZQZ @Linaraq614 We've been sure to share your feedback with our team, Laura! @serendipityriz We'd like to learn more, Haleigh! Please DM us with your order number, full name, email address, and shipping address when you get the chance. Thank you! @kiletara We got you! All you need is to decide 'Witch' one your 'Boo' will love the most, because they are all so 'Spooktacular'. Shop now: https://t.co/Vghv344ygY. @AmberJ10048537 We can still help, Amber. Please DM us your purchase information, your Mom's full name, mailing address, and email. Thanks! @Frekles827 We'd still like to help, Erica! Please DM us your full name, mailing address, phone number, and email. Thank you. @sara_pj24 We're loving your excitement to shop with us, Sara, and hate for any frustration we've caused. Try shopping here: https://t.co/t2tqu0YKi5. Thanks! @Frekles827 Oh no, Erica! We'd like to help. Please DM us your purchase info (in-store receipt/online order #), the style bra, your full name, mailing address, phone #, &amp; email. Thank you. @BTCSusan Thank YOU for allowing us the opportunity to make things right, Susan! xoxo @Selitaselata We are so sorry your order was cancelled, Sokalt. We'd be happy to look into this for you and ask that you DM us the order number, first and last name, email and shipping address. @Ira_Surkovaa We love these, too! @ellielaceyford Great question, Ellie! Due to the smoothing support and compression fit, they may feel tighter but the fit is the same. Stop in anytime and try these one-you'll love them! @taywa225 We're sorry to hear this, Taylor. Please send us a DM with the store location and more details. We look forward to hearing from you. @QueenKatalina_ We're disappointed to hear this; however, we do appreciate you taking the time to share your thoughts with us while as work to improve! @ThePitaBear Looked like so much fun... best wishes! @ThePitaBear Something for under your wicked dress: https://t.co/sPwGH2sNVM. @jennyyyyelias We plan to keep it that way! ;) @davinamari3 We would like to learn more about your recent visit, Davina! Please send us a DM with more details. We hope to hear from you soon! @kayelliee We're sorry to hear this, Kayla. So we may share this, please send us a DM with any additional information. Please also include your full name, email address, and billing address. Thank you. @KimberleeKay143 We're so sorry to hear you didn't receive our limited edition card, Kimberlee. Please check your email for upcoming offers and events. @baileys85208 We're concerned, Tisha. Please send us a DM with your store receipt barcode number, full name, and email address. Thank you. @yankeechicka You have scored our limited edition card, Marissa! Congratulations! @BellsOchoCinco So sorry to hear your cute pants were canceled. We'd like to help! Please send us a DM With your order number, full name, and shipping address. Thank you. @veraavina We're sorry for any disappointment. We've made sure to share your feedback regarding your Angel Card with our Leadership Team for review. Thank you. @mmcneil75 We understand your frustration and invite you to refresh and try again, Michelle! @yankeechicka We can imagine your frustration and invite you to refresh and try again, Marissa! @HOOSIERWIFE We understand you frustration and apologize for the disappointment, please be assured we have this with our team. We invite you to refresh the website and try again! @HappilySkinny Happy Thursday is right! Enjoy! 💗 @bakkalileila We can imagine your frustration and invite you to refresh and try again, Leila! @Namelessoneself We love to hear you're getting our Limited Edition Card! ❤ @simplytessie We appreciate you being patient, Tessie. Congrats on receiving your Limited Edition Card! @Veronica_Mason We are very happy to know that you were able to get your Limited Edition card, Veronica! Enjoy! 💛 @headlessbbydoll Please try again, if you are still experiencing issues please give us a call at 1.866.242.0577 so we can help! ❤️ @asgoodrich We're so glad you were able to score your card, Angela! ❤️ @Chellsiie Don't wait to give us a call at 1.866.242.0577 so we can help! @lrapp829 Please reach out to us here: 1.866.242.0577 so we can help! @BookGirl081367 We're glad we could help and hope you enjoy your order when it arrives! 💋 @JamesEarlJonezz Please give us a call at 1.866.242.0577 so we may provide more assistance, Jamie! @laugomez0119 Sorry for the confusion, Laurent. Receiving a messaging saying \"already registered\" means you're getting the Limited Edition Card! @ts_jems Sorry to hear our Sweet Fix Body Mist was no longer in your bag, Jems. They do sell fast! We've made sure to share your interest in bringing back our Sweet Fix Body Mists with our Team. Stay tuned! @msbettyvasquez We'd love to help, Betty! Please give us a call at 1.866.242.0577 so we you get a chance! @nciric2 Congrats, Natalie! You will be receiving your Limited Edition Card! @dontworryitsjen We know you're excited to get the Limited Edition Forever Angel Card! We're working to get the site back up - please keep trying! @maddieeholder We know you're excited to get the Limited Edition Forever Angel Card! We're working to get the site back up - please keep trying! @KingsKid1980 We know you're excited to get the Limited Edition Forever Angel Card! We're working to get the site back up - please keep trying! @jennajarrett We know you're excited to get the Limited Edition Forever Angel Card! We're working to get the site back up - please keep trying! @danielesanford There's nothing wrong with treating yourself, Dani. 😉 @GirlyGirlsEnt Thank you for your patience. So happy you're getting your Limited Edition Card! @brokencoconuts We know you're excited to get our Limited Edition Card. Please try again. Thanks so much for your patience. @Sherice_mf So sorry for any frustration! Please try again. Thanks! @mattiehunt Hi, Mattie! Please try again. Thanks! @xKtMcGx Please give it another try, Katie. Thank you. @kimberlydubya Please give it another try, Kimberly. We appreciate your patience. @dsotoamazing We're truly sorry for any frustration you've been experiencing, Dan. Please try again. Thank you. Fall for $30 fleeces and get cozy. Excl. apply: https://t.co/WUEEyn2Dw4 https://t.co/9uTRFqTS3P @Lyfe_travel1 So sorry. Please try again. @EricaInTheSkyy We understand your frustration. Please give it another try. Thank you. @SarahIRL Thank you for your patience, Sarah. Please try again. @KatieDotson07 We're very sorry, Katie. If your message says \"already registered\" you're receiving our Limited Edition Card! Congrats! @DesertMariposa We're truly sorry to hear this, Meche. Please try again. @5queenmary We're very sorry, Mary! Please try again. Thank you. @Taterbosc So sorry, Kacie! We recommend trying again. Thanks! @maisyxnicole Please try again! @bobsgirl13 Sorry to hear, Sara. Please give it another try! @_Shmalls_ So sorry for any frustration, Lyric. Please try again! @BrooklynChanelx Thank you for your patience. We're happy you got it! 😊 @GmailKia Your niece is going to love her Sweet 16, Kia! You are welcome to have the option for gift wrap when checking out. Check out our cute Everyday Tees! Made with a comfy relaxed fit. Grab your faves here!  https://t.co/hwa8GFwuj8 @nciric2 Please give us a call at 1.866.242.0577 so we can help! @mikayla_nicole9 We're sorry, Mikayla! Our site is back up and running! Please try again. @callmekat_xo We're so sorry to hear this, Kat. Please reach out to our Angel Card Department at 1.800.695.1526 Mon-Sat 8am-9pm EST. Thanks! @Kayleeamaya93 We're glad you were able to get it to work, Kaylee! Enjoy! @SoyCandice We know you're excited to get the Limited Edition Forever Angel Card! We're working to get the site back up - please keep trying, Candice! @wendygg71 We know you're excited to get the Limited Edition Forever Angel Card, Wendy! We're working to get the site back up - please keep trying! @ree_sodope We've let our team know that you would love to see our Fabulous collection return, Ree! DM us the features you loved about this collection so we can help find the perfect alternate while you wait! ❤️ $6.95 panties? Yup, your best weekend starts now. Excl. apply: https://t.co/D50JNgUrEd https://t.co/HwZqvsrZro @gingerchickyep We're so sorry to hear that you are not happy with your new bra. Please DM us your full name, email address, and purchase information so we can help! @highofflyfe__ No deets quite yet, KB! Keep an eye out after the holidays! @Alice_M_music Check your DM's, Alice. 😉 @ts_jems We're so glad to hear you're excited about the piece you're looking for, Jems!  If we no longer have an item on our site, it is not available any longer.  We'd be glad to share your request for it to return, though.  Can you share which item it was? @ozgurzerten We have several Beauty &amp; Accessory stores in Turkey. Find your nearest store here: https://t.co/xI3M1pOwwZ. Happy shopping! @ozgurzerten We're glad to help, Ozgur! Please DM us with details on how we can assist. Talk to you soon! @LadyDaci Oh no! We never want to forget an Angel's birthday, Dacia! DM us your full name, email, phone and Angel status so we can help. @dark_angelik We're loving these beautiful colors, Julie*Anna. Enjoy your treats! @REALKRP We're concerned and would like to further connect with you! Please share additional details regarding your experience with us via DM. @songbird_britt Thanks for shopping with us, Brittany! Enjoy! 💋 @x_oariii We're sorry to hear that 2 of your panties didn't arrive with the rest of your shipment, Ariana! Please DM us your full name, email, mailing address, order number! @janemarie2010 We're concerned and would like to learn more. Please send us a DM with any further details you'd like to share. Thank you. @aflores1109 We're sorry for the delay in response! Please DM us your full name, email, mailing address, and order number so we may help! @drprnces We apologize for any disappointment! Please DM us your full name, your desired offer code, and the specific error message you're receiving at checkout. Thanks! T-shirt bras &amp; more of your fave styles are only $25 &amp; up in our Fall Sale! Excl. apply: https://t.co/ZzPj1WYAgA @ElifGebenli54 Enjoy! @LadyViixen21 We're so glad you were able to get your concern resolved. Please do not hesitate letting us know if there is another way we can help! @KPage875 We're very concerned about your experience and would like to look into this, Kim. If you have not shared this with our Store Relations Team, please DM us your full name, email address, and the date and location you saw this interaction when you get a chance! @Howelling_Robin Deals this good never last long, Robin! Don't wait to start adding your favorite prints to your shopping bag! https://t.co/c7h4vzYSX1 @bellaparsons15 We are so sorry to hear this, Bella! Send us a DM with purchase details, your full name, email address, and phone number when you have a moment! @CtBackyardEliza We'd like to learn more, Eliza. Please DM us with more details. Include your email address and full mailing address. Talk to you soon! @BowderyT We're concerned, Teeah. Please DM us with more details! @wheresmycarmex We let the team know you'd love to see Vanilla Lace return! @Shawttyy_29 We are so sorry to hear that you received the incorrect panty, Jocelyn. So we can make this right please DM us your full name, order number, email address, and the color of the panty received when you get a moment! @LittleLeighXoxo We love your style, Leigh! 💜 @lalauren18 We have shared your interest in bigger straps for our Bluebella collection, Lauren! @LadyViixen21 We'd be happy to check the status of your order! Please DM us with your full name, order number, email address, and full mailing address. Talk to you soon! @jamilieb We want to make sure you're connected with the right associate the first time, Jami. For all inquiries regarding Angel Cards, please contact our Angel Card Customer Care at (800) 695-9478 (Comenity Bank). @Crownmesmileyy We'd like to learn more! Please DM us with more details when you get the chance. @EquestrianBae Come shop with us again soon, Kim! ❤ @haunted111 We're sorry to hear you've yet to receive your package! Please DM us with the order number, email address, and full shipping address so we can take a look. Thank you! @erickamoore We're sorry to hear about your experience with our Angel Card partners, Ericka. We'd like to learn more! Please DM us with more details. Talk to you soon! Our *most essential* bras are $25 &amp; up in the Fall Sale. Don’t miss it! Excl. apply: https://t.co/DYpiFfZRBr https://t.co/KmxOsSrPBZ @Vixenchild We love it! 😍 @Keith__REDMOND So sorry you haven't received a response, Keith. Please DM us more information and we'd be happy to help. When it comes to panties, the more the merrier. Collect your faves for $6.95 in the Fall Sale, online only. Excl. apply: https://t.co/jJkiN5dwnJ https://t.co/mkkuoochp7 @_TiffanyRussell Thanks for being a fan, Tiffany! @BeautyOfAMama We have let our team know that you are looking for Forever Pink to come back! @MimosasAndMore Oh no! We would be happy to help with a replacement, Anya! Please send us a DM with your order number, full shipping address, email address and phone number. We hope to hear from you soon! @ckbrighteyes We are so sorry to hear of your return experience! We would like to learn more so we can ensure that this feedback is proper shared. Please send us a DM with which store location you visited. We hope to hear from you soon! @baileyelishaa We would be happy to take a look into this for you! Please send us a DM with your full name, shipping address, email address and phone number. Thanks! @bostoneventgirl We have shared your request to have Vanilla Lace come back in the future! @hannahturch We would be happy to take a look! Please send us a DM  with your full name, order number, shipping address, email address and phone number. Thanks! @cheyroselarmore We love this deal, Cheyenne! @AudreyBarczyns1 We have shared your interest in  this fabulous scent coming back soon! Level up your loungewear with chic, cozy styles—only $19.95 &amp; under in the Fall Sale. Excl. apply: https://t.co/MLWfDHhRQT https://t.co/gT2gZrmsVU @camilacrnt Let's find your order, Cam! Please DM us your order #, full name, shipping address, &amp; email associated with your order. Thanks! @foxylady027 We love Love LOVE this so much, Ana. Always treat yourself! 😘 40% off PJ sets in our Fall Sale = sweet dreams, guaranteed. Excl. apply: https://t.co/Uxv4Zy33V7 https://t.co/nbhg8gywAY @_mylifeasgabbi You can shop this great deal online and in store for a limited time! @ANITAHAYNES2 We'd like to learn more about your store visit, Anita! Please DM us further details of your experience, along with your phone number and email address. Thank you! @amarikapri1 We'd like to learn more, so we can help! Please DM us your name, email, and further details about the charge made to your card. @CivilLuxe We can not resist a good panty deal either! @AmberJ10048537 We are sorry to hear that your sprayer on your mother's Crush Perfume has stopped working, Amber! We would be happy to help, please have your mother reach out to us so we can further assist. Thanks! @samanthabriana We are sorry to hear that your leggings have ripped after one wear, Sam! We would be happy to help. Please send us a DM with your purchase details. We hope to hear from you soon! This is not a drill: our best bras are $25 &amp; up in our Fall Sale! Excl. apply: https://t.co/UhLKny4knp https://t.co/eQiF5MwXGb @wedgieboy199105 Be sure to check under \" Today's offers\" on our website for all of our fabulous sales and promotions! Rest easy—sleepshirts are only $20 this weekend in the Fall Sale! Excl. apply: https://t.co/aPVxjMPLqs https://t.co/fYUN8tk0d7 @Loquita_Vegan We're sorry this happened. Please send us a DM with your full name and email address. Thank you. @PcCosplays As we don't have access to Angel Card Accounts, we invite you to send us a DM containing your full name, email, and phone number for assistance. @mlove_xo Oh no! If your panty was purchased in store, please visit your nearest location with your receipt for assistance with a refund. If you made your purchase online, send us a DM containing your order details. Thanks! @Jmoniquegarcia We have a few left. Grab some before they're gone. https://t.co/zZiKrcNG7Q @K852489 We are so sorry to hear this, Kate! We would like to learn more. Please send us a DM with which store location that you visited. We hope to hear from you soon! @LilMsAmanda We'd like the chance to personally connect with you regarding your experience, Amanda. Please send us a DM with your full name, email, and telephone number. @AlliPrazolam We'd like the chance to learn more about your experience, Al. Please reach out via DM! @sincerityissam @emocornlord Sounds like a keeper, Sam! 💘 @Brittany_Ackley So many deals, so little time, Brittany! ❤ @Sh4ronron We're happy to help, Sharon! Please DM us your full name, email, telephone number, and mailing address. @PcCosplays We'd like to learn more about your experience! Please give our Angel Card team a call at 1.800.695.9478 (Mon-Sat, 8am-9pm EST). @shaster93 We appreciate your valuable feedback and have been sure to share your comments with our team, Sha. We welcome you to reach out via DM for additional assistance. @kmilllllz We're concerned and would like to connect with you regarding your experience, Kat. Please send us a DM with your full name, email, and telephone number when you get a moment. @jeannie0_o We're sorry to hear your panty has become damaged after minimal wear &amp; wash! Please DM us your full name, email, mailing address, and order number/receipt barcode number for your purchase! @Brittanylynn99 We apologize for any disappointment, Brittany! We'd like the chance to review your purchase so that we may further advise. Please DM us your full name, email, mailing address, and order number! This. Is. Huge. $4 panties &amp; so much more in the Fall Sale. Excl. apply: https://t.co/HdV7iYf5ui https://t.co/TRDf30z7LG @lbartleyy Glad to help, Elizabeth. DM us details when  you have a sec. Thanks! @marxhyyy You're in luck. Enjoy shopping the sale! @lindsbewkes We hope you love every single one of those, Lindsay! @elmiragwww We'd be glad to help! Just DM us your full name, order number, email, shipping address and details so we can take a look. Thanks! @KarenMcCullah1 We're concerned, Karen. Please send us a DM with further details along with your full name, phone number, and email address. Thank you. @4_evergud We look forward to shopping with you! @fuckmyspacebar We're loving your spooky collection, Allie! 👻 @yogababyjae Strawberries and Champagne is a classic, Jae! Thanks for sharing your interest! 💕 @HighforDestiny Way to spoil yourself, D. Love it! @fearlessaubrey Spooktacular news! @sbsheff17 We know our sale is everything, Stefanie! We're up &amp; running. Shop now! @Fawesomeness No! This is not normal, Laura! We would like to help. Please DM us your purchase info (in-store receipt/online order #), your full name, mailing address, &amp; email. Thanks! Even *we* can’t believe how good the Fall sale is. Excl. apply: https://t.co/7gUv9l7oTQ https://t.co/nKrWXsqhaD @AlexLady We're concerned about your experience and would like to learn more! Please DM us with details including the store that you visited as well as details when you have a moment. Thanks! @baybe_swiss We appreciate your kind feedback and we will be sure to share your feedback with the stores leadership team. We hope you love what you brought home! @CwoolSwifty We cant wait to shop with you again soon! @Stephanidmgz We love your stash, Fanni! @HeidiSvec We see you over there getting it in, Heidi! 💪 @vzshawty We've let our team know you'd like your fave, Wild &amp; Breezy Body Spray back in stock! Stay tuned! 💗 @_queen_cait_ We're always happy to help, Cait! ❤ @tudodaddy Not currently. However, we've been sure to share your request with our team for future consideration! @caro_linaa5 We're sorry to hear your change was not provided. We recommend reaching out to the store you visited directly for assistance.\n\nBest of luck! @happie2smile Don't wait to start adding to your shopping bag! ❤️ https://t.co/ulcL8n0GvL @ellie_b27 We would like to speak directly with you, Ellie! Please send us a DM with your email address, phone number and the best time to reach you. We hope to hear from you soon! Because you can never have too many basics or too many little luxuries. Find yours in our Fall Sale. Excl. apply: https://t.co/rZgV4T4tXq @jaschumac We'd love to share your quality feedback, Jackie! Please DM us the bra style, purchase date, your name and email - along with the issues you've experience with the strap. Thanks! @toriistewart We are concern about you recent experience and would like to learn more, Victoria! Please send us a DM with more details. We hope to hear from you soon! @adriimichelleee We have shared your request for iPhone cases with our team! @mlouise1985 Oh no! We would like to share this with our team, Michelle! Please DM us your full name, email address, phone number, and purchase information when you get the chance! @adriimichelleee We do have our Pebbled V-Quilt Tech Clutch available online now, Adrianna! https://t.co/QQ4lsPUxxr The Fall Sale keeps getting better. Shop now, online &amp; in stores: https://t.co/rnBF9nbZgS https://t.co/ROL40OOz5c @emmacarcer We're sending over this fragrance request to our teams on your behalf, Emma! Since you love notes of floral, check out Velvet Petals Noir! ❤ https://t.co/d0B8sEr0cz @_yolee We want to make sure you're connected with the right associate the first time. For all inquiries regarding your Angel Card, please contact our Angel Card Customer Care at (800) 695-9478. Thank you! @datASSSH We're sorry to hear this! Please send us a DM with your purchase info, full name, and email address. Thanks! @everykisswithK We're concerned. Please send us a DM with further details. Also, please include your full name, phone number, and email address. Thank you. @Laaacyyy That's what we love to hear, Lacy! We strive to always provide an experience that is never shy of perfect! ❤ @StarrFoxx9 For us to view your order and see how we can help, we'd need the requested information. Thanks! @StarrFoxx9 We'd like to learn more. Please send us a DM with your first and last name, order number, and shipping address. Thank you. @reinventioninc Thanks for your feedback on our Fall Sale! Send us over a DM containing more info on the $40 PJ Set you're referring to so that we may assist. @of_geri We're sorry to hear this! We'd be happy to look into your order. Please send us a DM with your order number, name under the order, and shipping address. Thanks! @redladybug829 We'd like to look into your order, Kathi! Please send us a DM with your order number, name under the order, and shipping address. Thanks! @ohyazmine We're concerned, Yazmine. Please send us a DM with further information. Please include your full name, phone number, and email address. Thank you. @drichfresh2def Some things are hard to quit! 😘 Forget something? It’s OK...the Fall Sale is still going on. Excl. apply: https://t.co/JK4q78bkM9 Resort swim is in! Take a peek behind the campaign, shot in dreamy Turks &amp; Caicos. Talk about vacation inspo! #VSSwim https://t.co/koLtZWeWUb https://t.co/39zpEExrCU @jellyblunnts We love this deal too! ❤ @CushionCutt We truly apologize this happened! Please send us a DM with your full name, order number and email, so we may help. Thank you! @bbchangeup We've let our team know you'd love to see the original Vanilla Lace back, Carol! @yankeesgirl20 So sorry for any disappointment, Heather! We'd be happy to take a look at the order for you. Please DM us your order #, full name, email and shipping address. @hollytdesign We have forwarded your feedback to our beauty team, Holly. We thank you for reaching out! @maryd003 We thank you for giving us the chance to make it up to you, Mary! @MariaSCarrigan We apologize that this has happened with your bra, Maria. We would like to know more about your experience! Please send us a private message with more details, your email and phone number. Thank you. @Prettiefatgirl Thanks for your kind feedback! @TabithaWilson86 We miss them too, Tabitha! The team has received your request. @24MillerM We are concerned about your experience and we would like to speak with you further, Miroslava. Please send us a private message with more details and your email so we can help. Thanks! @ProudArmy_mom We are truly sorry, Kathi. We want to make this right. Please DM us your order number, email address, name on the credit card and shipping address. @yo0ojessss We are so sorry to hear. We would like to learn more. Please DM us when you get a moment. Thanks. @pinche_bleemz We can't lose you, Brooklyn! Please DM us and elaborate. Include your full name, mailing address, and email. Thank you. @mayyye_b Only smiles! Let us help find your package. Please DM us your order #, the full name, shipping address, &amp; email address associated with your order. Thanks! @delreyswildfire Let's get you shopping, Sarah! We're not experiencing issues with our website currently. Try clearing your cache &amp; cookies or try a different browser. Thanks! The Fall sale is here. Go ahead–treat yourself. Excl. apply: https://t.co/iicwfVBMyQ @SexLoveAndOJ We'd like to help look at options for your order. At your earliest convenience please send us a DM with your full name as it appears on the order, order number, email, and shipping address. Hope to hear back! @StephanieJay_UK We have shared your interest in additional band &amp; cup sizes with our Product team for further review. Thanks! @kiannawrightt 😜 @jilhendershot Hi, Jil. Please send us a DM when you have a moment. Thank you. @Jessica1213 Thank you for shopping with us, Jessica! @QueenPastBeauty We're sorry to hear your lotion pumps are not working. Please send us a DM with a picture of your receipt. Please include your full name, email, and phone number as well. Thank you. @Bianka_dan We're concerned, Nickolette. Please send us a DM with further details. Please include your full name, email address, and phone number as well. Thank you. @No_Try_Again We have shared your request with our team! @LadyStellar01 What a deal?! We hope you enjoy your new slip! @yogicollins We'd like to learn more, Yozette. Please send us a DM with further details. Please provide your full name, email address, and phone number as well. Thank you. @MeDicenRele We're concerned and would like to learn more. Please send us a DM with further details and the location you visited. Also, please provide your full name, email address, and phone number. Thanks. @katandcats17 We're sorry to hear this, Katie. Please send us a DM when you have a moment. Thank you. @elmiragwww We're sorry to hear it took so long. We've made sure to forward your feedback with our Tech Team for review. Thank you. Your coziest fall ever starts with $19.95 &amp; under lounge styles. Shop your favorites now! Excl. apply. S&amp;H applies: https://t.co/rGjaLhUu1t @_destineetaylor We love the way you think! @ChanelSaidSo We're sorry for the disappointment and frustration with your order and would love to take a look. Please DM your order number, email address, first and last name on the order, and shipping address! @AndieParrilla Oh no, Andie! Please send us a private message with your purchase information, including date/location, as well as your first and last name, email address, and shipping address. @parentladvicery We don't want you to miss this deal and ask that you please try again! @lolaenlaluna We're so sorry you can't get through to checkout, Leslie, and appreciate the feedback. We don't want you to miss these deals and ask that you please try again! @chaelynnef Our flash sale offers have been extended for use until 11PM ET on 9/29.  Please try again! @jonescourtneyy Enjoy, Court! @googlegaby SAVE40VS excludes third party branded intimate apparel, Gabriela. We apologize for any disappointment. @wHaT_hEr_Is_WeT Our flash sale offers have been extended for use until 11PM ET on 9/29.  Please try again! @TennellKayla We got you, Kayla! Our flash sale offers have been extended for use until 11PM ET on 9/29.  Please try again! @RxKAM We're so sorry you've had difficulty getting through, Kristin. Our team is working on a fix and we appreciate your patience. We don't want you to miss these offers and ask that you please try again! @_BellaCubana We want you to score these deals! We've extended all flash sale offers until 11PM EST. Please try again. @vegasbombshell_ We're sorry to hear this has been your experience, Jacque. Send us a DM containing additional info detailing your concern to get help! @SunLiteSunBrite Keep trying, Sonya! We're giving you more time to shop! All flash sale offers have been extended until 11PM EST. Please try again! @MissEMILYs Keep trying, Emily! We're giving you more time to shop and have extended the sale until 11PM! @porchiamcnair We never want you to miss a sale, Porchia! All flash sale offers have been extended until 11PM EST. We'd love for you to try again! 💕 @_xAmbitiousChel Thanks for your patience and continuing to shop! ❤ @Queenie_laura We're truly sorry you can't get through, Laura. Our team is working on a fix - please try again! @MaryHaight1 We want you to score these deals, Mary! We've extended all flash sale offers until 11PM EST. @VanzVanz9 All flash sale offers have been extended until 11PM EST. Please try again and checkout as a guest! @IslandGirlAries Keep trying! We're giving you more time to shop! All flash sale offers have been extended until 11PM EST. Please try again! @angela24janelle We apologize for any frustration, Angela! Please try back as we extended through 11pm. @BlackBarbie704 Sorry for any frustration, Pamela! Please try back as we extended through 11pm. @beasley_j97 Sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. @FlipDatShhh We’re so sorry!  We’re anxious to get you back to shopping  and we’re working quickly to deliver the shopping experience you expect. @oceandust14 We’re so sorry, Mandy!  We’re anxious to get you back to shopping and we’re working quickly to deliver the shopping experience you expect. @ivathediva We’re so sorry!  We’re anxious to get you back to shopping  and we’re working quickly to deliver the shopping experience you expect. @parentladvicery Sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. @_xAmbitiousChel Sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. All Flash Sale offers have been extended until 11PM EST due to the overwhelming demand this evening. We apologize for any inconvenience and are actively working to deliver the shopping experience you expect. @CheryDooWop Sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. @jvcoll Sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. @Malinda78 We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. Sorry for the inconvenience! @ririparpar We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. Sorry for the inconvenience! @dramaandme Sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. @KerriReed1975 We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. Sorry for the inconvenience! @MandaRMartinez We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. Sorry for the inconvenience! @CtBackyardEliza We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. Sorry for the inconvenience! @BlvckBarbie Sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. @rheapxoxo We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. Sorry for the inconvenience! @AndSoIWrite We're sorry to hear you had trouble processing your order, Marie! Our site it up and running, please try your order again soon and stay tuned for updates! @EmilyW777 Love that we could help turn your day around! 💝 @suez1122 We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. Sorry for the inconvenience! @JewelsSteves We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. Sorry for the inconvenience! @juliebella85 We're so sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen, Martha! @elmiragwww We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. Sorry for the inconvenience! @AbuvDaInfluence We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. Sorry for the inconvenience! @TexasSunflowr Sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen, Susan! @So_Not_Worried We’re so sorry!  We’re anxious to get you back to shopping  and we’re working quickly to deliver the shopping experience you expect. @erjansam We’re so sorry!  We’re anxious to get you back to shopping  and we’re working quickly to deliver the shopping experience you expect, Samantha. @_mylifeasgabbi Sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. @iamtherealtrex We're so sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen, Tracy. @ShannonBaxter We’re so sorry!  We’re anxious to get you back to shopping  and we’re working quickly to deliver the shopping experience you expect, Shannon! @happyandchatty We’re so sorry!  We’re anxious to get you back to shopping  and we’re working quickly to deliver the shopping experience you expect. @dominiqtrix We’re so sorry!  We’re anxious to get you back to shopping  and we’re working quickly to deliver the shopping experience you expect. @PatriciaCarcass We’re so sorry!  We’re anxious to get you back to shopping  and we’re working quickly to deliver the shopping experience you expect, Patricia. @woahhbeckyy So sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen, Rabekah. @c_wools Sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. @teewill16 Sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. @Chellsiie Sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. @mortiz1128 Sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen, Airam. @SunsetSwift89 Please try your order again soon and stay tuned for updates! @sweetcakesx_ We’re so sorry, Alysa!  We’re anxious to get you back to shopping  and we’re working quickly to deliver the shopping experience you expect. @Mxrra__ Sorry for the inconvenience!  We know you’re anxious to get back to shopping our flash sale and we’re working quickly to make it happen. @FlipDatShhh Sorry for the delay! Give it another try soon - Can’t wait to shop with you! @lesliealexxia We know you want these offers asap - try again soon! @KatKatElly So sorry this happened, Katrina! So we may share this feedback with the stores leadership team, please DM us the store location you visited. @KathyBl10553002 So sorry to hear this and for the experience you've had trying to get help resolving this matter, Kathy! So we may further assist, please DM us the gift card number and the long number under the barcode on your  receipt. Please also provide your address and email. @nurseyERnurse4 We'd like to learn more. Please send us a DM with further details and include your full name. Please also provide your phone number and email. Thank you. @payalofthoughts We'd like to look into this, Payal. Please send us a DM referring to the specific email. Also, include your full name, billing address, and email. Thanks! @Babygirl_swifty Please reach out to your local store for participation, Donna. @LizzyBrodie We've shared your interest with our team, Lizzy! @izzy_wins Noted! 📝🏈 @MsHannah_Marie So sorry for the disappointment this has caused, Hannah. We appreciate you sharing your feedback and have shared it with our leadership team. @KaylaAlderman We hear you, Kayla! We've shared your request with our Team! There’s still time to shop the Fall Sale: $25 sport tights, $5 panties &amp; MORE. Excl. apply: https://t.co/JqDmv6XufJ @YasiraSteeze And we couldn't be more excited about it! Happy shopping! @lissalet Fabulous choice, Melissa! 💗 @vs_1fan Enjoy, Adele! @nancylopez_12 We'd like to learn more, Nancy! Please DM us with the Gift Card number. Include your email address, and full mailing address. Talk to you soon! @prettyjuls We're here to help, Julie! Please DM us more details on your fave bra. Thank you! @SamsRamblings You're not wrong, Sam! 💖 @jacktucksmein Can't wait to shop with you! @itsmelittleg We'd like to learn more! Please DM us with your store receipt barcode number/order number, full name, email address, and mailing address. Talk to you soon! @cmahoney27 Our pleasure, Caroline! @TheDaily_Chels So many deals, so little time, Chelsea! 💖 @chelseaaamaarie Check out our return/exchange options online here, Chelsea : https://t.co/UOP3PK36wn We welcome you to DM us for additional assistance! @AutumnBoatner We would like the chance to learn more about your recent shopping experience. Please DM us your full name, email, and the store location you visited. @ShanPir No-Show panties are a must!!! ❤ @whatkayytweets We're sorry for any trouble you experienced on our website! Please clear your browser's cache and cookies and try accessing our website at that time. Thank you! @LuedkeBrittany We're sorry to see that your reward card was damaged but we're happy to help, Britt. Please send us a DM with the purchase details for your body spray, such as the order number, your full name, your email and shipping address. Thank you! Fall Sale = your fall look at perfect prices. Excl. apply. S&amp;H applies: https://t.co/C4XGsq3x6l @RadiantRoxanne We wouldn't want you to keep anything that you don't love, Roxanne. Grab your receipt and bra and stop in anytime for a return/exchange. DM us if you need ore info! @_aaliar There's so many others to choose from, Lia. May we suggest our new fave: https://t.co/dGcGpchvOL @Gisel_fit We agree, Gisel 😘 @sqalyy We never want to see our Angel's cry, Annie. DM us your favorite bra so that we can share your request to bring it back! @santo_rayanna We're sorry to hear of your disappointment. Please send us a DM with your order number, full name, and email address. Thanks! @Fawn_On_Lawn So sorry to hear of the disappointment with your panties. Please send us a DM with your purchase information along with your full name and email. Thanks! @srosel927 We're sorry to hear you didn't receive your birthday reward, Sarah. Please send us a DM with your full name, email address, and phone number. Thanks! @latsirhc__ We're concerned, Khyla. Please send us a DM with the style name of your bra, date of purchase, and order number/store receipt barcode number. Please also provide your full name, phone number, and email. Thanks! @sarahperel We'd like to learn more. Please send us a DM with further details including your full name and billing address. Also, your phone number and email address. Thank you. @sissymexicana We love to hear you're enjoying it! ❤ @Terrikwv We'd love the opportunity to share what you're looking for in a wireless option, Terricita! Please DM us further details of your dream style, when you have a moment. We look forward to sharing your feedback! The Fall Sale. It’s ON. Shop $25 bras, $5 panties and more. Excl. apply: https://t.co/bxCre4W54e @NinaDupl Perfect time to stock up 😉 @TaylorAshleyLee We love it, Tay! @ooo_KEISHA We're sorry for the frustration, Keisha!  We see everything is up and running! Please clear your cache and cookies then give it another try! @cg_dreamer We're sorry for any disappointment. We've made sure to share your request for both our Strappy Balconet Bra and Hoodies to be available online and in store! Please keep your eyes peeled for updates! @lifes_synonym Oh no! We would like to learn more, Kanvi! Please send us a DM with more details of your experience. Thanks! @fvelascogt You can shop this fabulous collection online now! @fvelascogt We are glad you are loving it as much as we do! @brikiplinger We are sorry to hear this, Brianna!  We have made sure to share your experience with the store leaders. Thanks for taking the time to reach out! @TheRealNekaRay You can never have too many options! @b0nezaddy We would be happy to take a look into your order! Please send us a DM with your order number, full name, shipping address, email address and phone number. Thanks! @kai_Okai We are so sorry for the disappointment! The bonus reward was to match back on a purchase up to $200. We have made sure to share your disappointment with our team! @DeeLouie_ Oh no! Please give us a call at 1-800-888-1500 and we would be happy to help place an order for you! @watchshortiego We have sent you a DM with more details, Emily! @DeeLouie_ We are so sorry to hear that you are having trouble with the website! Be sure to clear you cache and cookies or try an alternate web browser! @SimplyKGoethe Enjoy! @tudorgirl21 No details just yet, Elisabeth! Keep your eyes peeled! ❤ The Fall Sale is here—aka the perfect time to shop your favorites, including bras for $25 &amp; under (&amp; so much more.) Excl. apply: https://t.co/uy9GUiMx8k @therealdwolfe We are so sorry for the disappointment with the order you placed this morning. If there is anything we can help with, please DM us your order number, first &amp; last name, email and shipping address. We can take a look at why you were charged more and share your feedback as well. @martaadamonyte_ We totally agree! 😍 Your fave bras—now only $25 &amp; under! Plus $5 panties &amp; more. Shop them all in our Fall Sale. Excl. apply: https://t.co/B8916t0Yjs https://t.co/CCjKq0ysaG @kiarasten So many great options, we love it! @HamzaDarifii Glad to help! DM us your full name, order number, email &amp; shipping address. Thanks! @mayraofficiaI Come and shop it all, Mayra! 👻 @Wackerrrr We would be happy to help, Felicia! Please send us a DM with your order number, full name, shipping address, email address and phone number. We hope to hear from you soon! @Wackerrrr Oh no! What size are you looking for? @jourxjour We would be happy to help! You ca either send us a Dm with your concern or you can reach us at CustomerCare@VictoriasSecret.com. We hope to hear from you soon! @jocelynjohnsin Be sure to check with your local store for more details on availability of this fabulous collection! New season, new styles, new sale. Shop lingerie starting at $25 &amp; more. Excl. apply. S&amp;H applies: https://t.co/gN4xfLqoJy @WorldofSimone_ So sorry we no longer carry Wicked, Simone. We've let our team know how much you loved it and would like to see it return! @theonlyjames25 No details quite yet, be sure to check back online this weekend, James! @ChalupaBman71 We would be happy to help, Michelle! Please send us a DM with your phone number along with the best time to reach you. We look forward to hearing from you soon! @jayninnnaa We would be happy to help! Please contact our Angel Card Customer Care at (800) 695-9478 (Comenity Bank) Mon-Sat 8am-9pm EST.  Thank you! @annelc_ We would like to learn more, Annel! Please send us a Dm with more details along with your receipt information so we can help. Thanks! Your fall faves are on major sale: shop bras for $25 &amp; under, panties for $5 &amp; more. Online only. Excl. apply. S&amp;H applies: https://t.co/PW57CRlbZr @goriaisabella Be sure to check your internet settings, Isabella. Looks like you have something or a firewall up blocking our site. @serifepamuk26 Thank you for reaching out, Lilith!  We recommend partnering with the location in which you applied directly for any questions! Get moving—sport bras are $14.95 in our Fall Sale! Exclusive Online Only Preview happening now! Excl. apply. S&amp;H applies: https://t.co/WmbnRvELUC @chaelynnef We're glad to take a look, Michaela! Please send us a DM with each order number, your email address used when you order, first and last name, and shipping address! @Taylor_Terrell We're disappointed to hear this, Taylor!  Please send us a private message with when/where purchased, style/collection, and your first and last name, email address, and billing address! @kattiedidnt We would like to learn more, Kattie! Please send us a DM with more details, your full name, and email. Talk to you soon! @micjaggerinf That's what we love to hear, Michelle! Enjoy! 💋 @lailalolitaaa Thanks for shopping with us! See you again soon! 💋 @baublesnbraids Sorry to hear about your chat experience, Roni! We'd love to learn more to share your feedback and help out with your offer questions! Please DM us who you spoke with, and which offers you're looking forward to - thanks! @danikahenault So gorgeous, right?! We're living for the stunning Faye Lace Underwire Bra, Danika! What's your favorite piece so far? https://t.co/FQF1nyRb9W @clairebear665 We absolutely want you to have the best fit, Claire! We're here to help! Please DM us the style you've purchased and share how it's making you uncomfortable ♥ @iron_spiderling Stay tuned, Anna! Hold everything: must-have panties are $6.95 &amp; under in our Fall Sale. Exclusive Online-Only Preview today—so act fast! Excl. apply. S&amp;H applies: https://t.co/sCGGO8BIMO @Paytotheklo We truly apologize for your experience, Lindsay! Please send us a DM with more details about your visit, including the store location. We look forward to speaking with you further! @GangreneQueen Isn't that what Halloween is all about? Being scared? Anyboo, we've got a few you can order now:  https://t.co/RNrdmKj0xX. @mekeishamadto We appreciate you sharing your experience, Mekeisha! We've shared your feedback with our Fox Hills Mall store leaders. Thank you! Need new PJs? Shop $10 tees &amp; tanks, in stores only! Excl. apply: https://t.co/HwDcOSKJah @chaelynnef We can imagine your excitement to receive your PINK Cash, Michaela. Hang tight...your email will be arriving soon. Thanks! @niniblack_ We are here for you, Nini! We're so sorry your panties ripped and want to help. Please DM us your purchase info, style panty, full name, mailing address, &amp; email address. Thanks! @VictoriaEvrAftr We apologize this happened with your bra, Victoria! Please send us a DM with more details, including your full name, date and location of purchase, and the name of the bra. Thank you! @youhadmeatdonut We apologize that you haven't received your package, Melissa! Please send us a DM with your order number, full name, shipping address and email, so we may look into this for you! Get a sneak peek at Fall Sale in our Online Only Preview—which includes $10 &amp; up sleep faves! Plus, $6.95 panties &amp; so much more. Excl. apply. S&amp;H applies: https://t.co/fR9LQOPCIe @LeighAnnMarie95 And, we're ready to shop with your, Leigh-Ann! 😘 @PaigeLeighann Let's find your reward! Please DM us your receipt/order number, full name, &amp; email address. Thanks! @Unloveable_Bear Let's see if we can help, Clair! Please DM us your order #, full name, shipping address, &amp; email address associated with the order. TY. @mysticalymental We would like to learn more so we can further assist! Please have your friend reach out to us with more details.Thanks! @DaleCodyandrea We truly apologize for any disappointment that your friend experienced while visiting our PINK bus. Your concern is being shared with our team and helps us to improve future events. If your friend would like to reach out, we welcome her to call us at (855) 866-5810. Thank you. @AkashSmarts We're concerned and would like to learn more. Please send us a DM with any additional details along with the exact store location when you have a moment. Thank you. So…have you seen the new For Love &amp; Lemons collection? 👀 https://t.co/X87Ndp4su3 @lexah__ They are a must have! @enf7499 We would like to learn more! Please send us a DM with more details so we can further assist. We hope to hear from you soon! @SpookyMomma We love hearing this! Thanks for reaching out! @killjoy4EVRYDAY @b_lexie We are sorry to hear that your bra broke during your shift, Debbie! We would like learn more so we can further assist. Please send us a DM with which style of bra you have along with the purchase info. We hope to hear from you soon! @blckqueen26 See you soon! @Swallis1970 We've shared your feedback, Sally! Thanks for reaching out. @CinnamonBoyd So glad to hear it was found, Cinn! That could have been an awful shopping experience. @angrycatinc We love it, Rachel! So glad you had an amazing experience in store and we will be sure to share your kind words with Krystal and Lisa's leaders. Thanks for shopping and we hope to see you again soon! @Loopy83 So sorry we do not have the pricing information for items in store, Louise. Our sales online may not be the same in store and suggest reaching out to the store directly for pricing or sale information. @christinaserran We'd be happy to help and are sorry to hear your refund was not issued correctly, Christina. Please send us a DM with the order number, the long number under the barcode on your store receipt, email address, shipping address and any details on the incorrect refund. @kately_bienvenu Sounds simply Heavenly ♥ @mishandmakeup So sorry for any confusion! The $4 panty sale ended when the flash sale began. Stay tuned for more great offers coming soon! @tiffany_jeanine But your lingerie drawer is singing! 😍 @areli_baraza DM us your receipt info, full name, email and phone number so we can take a look. Thanks! @Amb_Jackson You deserve one in every color! ♥ @JenGarbs Ultra sexy, Jennifer! Get ready to fall in love! 💋 @chauntelleshay You're worth it, Chauntel! 💋 @foxyinflipflops Nothing wrong with a little coco, Michelle. Enjoy! @nohemyrmzv We love shopping with you every time, Nohemy! @BehindMySmile_ So sorry to hear of your difficulty on our site, Andrea. If you didn't get it to accept your card, please call 800.888.1500 for immediate assistance. ♥ @anxiousbeautyy Come and shop them all, Dani! 👻💀🕷🎃 @SweetDemon Enjoy your new treats! @celinaramos We love hearing what our fans are looking for, Celina. We will let our Team know you would like to see more sizing options in our PINK Collection! ♥ FLASH SALE ALERT: Angel Credit Cardholders get 25% off their purchase AND free shipping on orders $25+. [LINK] .https://t.co/McsFhEGpSH  Angel Credit Card Accounts are issued by Comenity Bank https://t.co/OgpHfrsNPN @drakesswifeyyyy Great news, Kailyn! We recently brought it back! Shop now at https://t.co/4lsIjQdCue. ❤ @Madisatan We're happy to hear you're loving your new bra! @soumyanairr So sorry to see this happened, Soum. Please DM us the store you visited so we can be sure to share your feedback. We welcome you to stop back by the store with your receipt to have the sensor removed. @Gmzegngr_ We'll let our team know you'd love to see these fragrances return. Shop panties for $4 (sweet!) Just one of the perks open to EVERYONE in celebration the 25th Angel Credit Card Anniversary! Excl. apply. Bank.https://t.co/tBIhzWXBqX Angel Credit Card Accounts are issued by Comenity https://t.co/MiqBsGo3Q2 @Mendizzzle We'll be happy to share your request with our team to bring this scent back. @adora_forney Glad you love your new hoodies! Come shop with us again soon. ❤ @jessickam_ We're concerned, Jessicka. Please DM us with your full name, order number, email address, and full mailing address. We look forward to your reply! @harsharannn We're excited to hear you want to work with our company! You can find our current opportunities online and apply at https://t.co/XpvQrj9Tzr. Best of luck! @TheNorseEmpress We've let the team know you'd love to see our Sugar High fragrance again! @charlene519 Connect with your local store to confirm participation. Can't wait to shop with you! @jeli_beannn We always want you to love your selections, Jeli! DM us your full name, email, mailing address, and order#/receipt barcode# for your purchase! @kontratuiteo Be sure to check out Today's Offers online here for more info, Felipe! https://t.co/zv3WJGseB3 @Shelbycheyenne1 Yea we are, Shelby! @dawn_d23 We'd be happy to address your concerns, Dawn. Send us a DM containing purchase details for the bra style(s) in question, and don't forget to include your full name &amp; email when reaching out. @tricky_nikii We'd like to learn more so that we may share your experience and further advise, Niki. Please DM us your full name, email, mailing address, and order number in question. Thanks! @itsblackjewel We're concerned! Please DM us with your full name, phone number, email address, and the best time to reach you. @KirstyMcAllis11 While our City Tote isn't currently available for shipping to the UK, we really appreciate your interest, Kirsty! Our Studded Victoria Tote makes the perfect alternate, we think she will ❤! https://t.co/p3fv8pVVH4 @MyFreshHell We'd like to reach out to you directly. Please DM us with your full name, phone number, email address, and the best time to contact you. Thank you! @lissalet So many deals, so little time, Melissa! 💖 Yes, that’s right—some of your favorite bras are now $25! Deals like this we typically reserve for our Angel Credit Cardholders, but this weekend, we’re sharing, in honor of the 25th Angel Credit Card Anniversary! For a limited time, excl. apply: https://t.co/nylndY7spG https://t.co/IzV20flqzG So…have you seen the new For Love &amp; Lemons collection? 👀 https://t.co/R1Tp4hdynf @itsme64498596 We'd love to take a look! Please send us a DM with your order number, email address, first and last name on the order, and shipping address! A very special delivery… All orders $50+ ship FREE! Excl. apply: https://t.co/okwqOKi8uC https://t.co/O4PMqpQVFg @bee_sunshine96 What a beautiful  bag! Enjoy ♥ @ItzellMendezz Oh Misbehave... We know how to keep a secret! ;) @asia252 We'd like to know more. Please DM us with details when you have a moment. We look forward to hearing from you. @jeanene_sutton We're so sorry to see your PJs are not the correct size! Please send us a DM with your order number or store receipt barcode number, full name, and email address. Thanks! @JessicaAnn1017 No news just yet, Jessica. Keep your eyes peeled for updates! @theshaunasmith Please send us a DM with your email,mailing address and phone number. Thank you. @theshaunasmith We would love to learn more about your experience. Please send us a DM with your store location! Thank you! @EEMerriman We would love to share your feedback with our team. Please send us a DM so we can help you more! @Daniyella__ Reach out to your local store for availability, Dani! @Sarafoshizz Reach out to a store near you for availability, Sara! @Muterobra We're happy to help, Eva! Please DM us your email address you're receiving them to! @hey_erma We're sorry for any frustration with your birthday offers and appreciate your feedback!  Be assured we've shared as customer feedback provides direction for our future offers! @MissWaldior You can shop this collection online! Some of your favorite bras are now $25—you DON’T want to miss this. For a limited time, excl. apply: https://t.co/L11OtrAlwX https://t.co/unr09bOj8i @Hoppydactyl We're sorry for any disappointment and are glad to share your feedback on this! Please DM your order number, email address, first and last name on the order, and shipping address! It’s on: $4 panties! Now’s the perfect time to add to your collection. For a limited time, excl. apply: https://t.co/D8DbaJMXUt https://t.co/EWzT1Jrot6 @B_Jarrell We're glad to share your request for Bombshell Summer to return!  We're glad to help you with your order, too! Please DM your order number, email address, first and last name, and shipping address. Angel Credit Cardholders can claim a free panty from 5-9PM in stores today only, no purchase required! Excl. apply: https://t.co/KkQjtQjCSD   Angel Credit Card Accounts are issued by Comenity Bank. https://t.co/sXPfe4Gc37 @ziambreeze Stay tuned, Delaney! 😉 @courtrenee8 We're sorry to hear you're having trouble, Courtney! Please contact Angel Card Customer Care at 1.800.695.9478 for further assistance. Talk to you soon! @httpschey Check out our spooktastic styles now, Cheyenne!\nhttps://t.co/UaJNA5rcFD @JessicaFursten2 We're here to help, Jessica. Please send us a DM with more detail of your purchase, your address, phone number, and email. Talk to you soon! @SnowHunterSama You know we love shopping with you! 💋 @KimberlyRuizz_ Agreed, Kimberly! See you soon! 😉 @bajancreme So sorry for this experience at our Mall of Georgia location. We assure we've shared your feedback with our leadership team. @NoorAlmuzaffar We love this one too! 😍😍 @browneyez32 So sorry for any disappointment, Toronnie! We've let our team know how much you love it and would like to see it back. This weekend, we’re celebrating by giving everyone (!!!) access to exclusive offers for the 25th Anniversary of the Angel Credit Card! Learn more: https://t.co/dU97XMkeUU \nAngel Credit Card Accounts are issued by Comenity Bank https://t.co/gHXo7tVb0s @acambriaauthor We're disappointed to hear this and would like to get more information. Please DM us your gift card number, any details on the original purchase you have (such as date/location), as well as your phone number, email address, first &amp; last name, and billing address. Now’s the time to shop...free shipping on purchases of $50+! https://t.co/TMkdmoqIeK https://t.co/wP1lLjcAXr @sapphiredemirsz We wish you a successful year, Sapphire! Oh, and sweet dreams! ;) @AlexaBennaim We hate to hear this, Alexa! Please send us a DM with more details of your experience. We hope to hear from you soon! @mixedberrypunch Be sure to check out all of these great deals beginning on 9.20, Amy! @MaeeeeB So sorry for the long wait at checkout today, Mae. Please DM us the store location so we can be sure to share this feedback with our team. @missflowerny We know you love to shop &amp; save! Send us a DM containing your full name, mailing address, &amp; email so that we can make sure you're on our list. @lifeasChristy_ Happy to help, Christy! She's wearing our Dream Angels Demi. We love this look! https://t.co/7GyMVRRGOt @Whoiskimothy We’re sorry to hear you’re having trouble on the Angel Card website! We recommend clearing your cache and cookies or trying an alternate website browser. @jglam15 We'll let our team know you'd love to see it return. @BobbieRose90 So happy we could help, Bobbie!❤ @BobbieRose90 We're so sorry this happened, Bobbie. Please send us a DM with the receipt information your full name and email. Thank you. @emma_jacq Consider your request shared, Em! @Og_itzBri No details to share just yet, Bri! Keep an eye out for future updates on our upcoming deals! ❣️ @drichfresh2def We are very sorry to hear that you are not happy with your new lip scrubs. We invite you to bring them in for an exchange! @GalLovejoy We've let our team know that you would love to see it return. While you wait, we are sure you'll love our Bare Vanilla! https://t.co/wi3ux5thY9 @KristinaWylin We're sorry to hear this, Kristina!  Can you DM us more details - including details of the call, the phone number you reached us from, and when you called? Thank you! @JO_0000000017 Sorry to hear, Jo. We will share this with our team! @bhaderlovebot Thank you for sharing your request with us, Brie! We have let our team know that you would love to see more sizing options added to our selection! @cflarsen Noted, Christine! @mmbutlerr We would love to help. Please DM us when you have time. Thanks! @mobiletanstacey We are truly sorry to hear your frustration. Please DM us when you get a moment. We really would love to help. Now’s the time to shop...free shipping on purchases of $50+!\nhttps://t.co/xjd7UxabMS https://t.co/yIO263h3np @3lizabethR We're sorry for any disappointment, Elizabeth!  We'd like to hear more.  Can you please DM us more details?  We'd like to hear from you! @_monshot We're sorry for frustration and recommend partnering with our Angel Card team directly at 1-800-695-9478  regarding your account. @kuhreemay We would like to learn more, Karime! Please send us a Dm with more details. We hope to hear from you soon! @xjaixlene Oh no! We would like to learn more! Please send us a DM with more details of your ordering experience. We hope to hear from you soon! @vdinv_ We would be happy to help! Please send us a DM with more details of the change you are wanting to make along with your full name, shipping address, email address and phone number. We hope to hear from you soon! @Skater_Gurl11 WE're sorry for the frustration with your gift card, Jess!  We'd like to check into this.  Please send us a DM with date/locate you were shopping in, your first and last name, email address, phone number, and gift card number. @krogerbranded We'll share your love and request for more unlined options! ♥ @buff_blondie So sorry for any disappointment with the offer. We've shared your feedback with our leadership team for future consideration. @TellEmSmthnJo_ We've shared your feedback with the leadership team of the Galleria Mall, Jocelyn! Thanks for shopping! We’ve got something big in the works—trust us, it’s what you’ve been waiting for… #FLLforVS https://t.co/tevCl2ClHG @Luv_iis_Blind Yesssss! We can't wait to hear about your haul! @Kissmyblum88 We'd like to look into your order, Tina. Please send us a DM with the order number, shipping address, and name attached to your order. Thanks. @hkeebs1 No worries, Holly! Please send us a direct message with your store receipt barcode number, full name, shorts style, and shipping address. Thanks! @CDDoKing We've made sure to forward your feedback with our Leadership Team. Thanks! @hkeebs1 We'd like to view your order, Holly. Please reply with your order number, full name under the order, and shipping address. Also, which shorts were fitted incorrectly. Thank you. @Justmari199 We love to hear Jasmine in our Live Chat Department was a big help! We've made sure to let our team know for recognition! 🖤 @_kiaantaay We've shared your interest with our team! @4freedomfights We've shared your feedback with our leadership team, Fannie! @bongaykharol We'd like to speak with you concerning the experience you had with one of our bras, Bongay. Please send us a DM with the style of bra, where it was purchased, your phone number and the best time to reach you. @Penschick21 It's the same amazing fragrance, Arielle! 😍 @lasanyaaa We'll let our team know you'd like to see it returned. @VivaGlamDiva Perfect for an Angel! 😍 @jessicastocco We'd like to learn more, Jessica. Please DM us with your purchase details. Talk to you soon! @cookie27_ We're concerned, Andrea! Please DM us with your order number, full name, email address, and full shipping address. Talk to you soon! @dreawest_ We let the team know you'd love to see a return! @Ashleaaaann We want to make sure you're connected with the right associate the first time, Ashlea. For all inquiries regarding your Angel Card, please contact our Angel Card Customer Care at (800) 695-9478 (Comenity Bank) Mon-Sat 8am-9pm EST. Thank you! @cass_guerrero We'd like to learn more about your experience returning, Cassandra. Please DM us with more details. Include the store location. Thank you! @_illyy__ We'd like to learn more! Please DM us with more details. Talk to you soon! @chellefaefife We apologize. We've been sure to share your disappointment with our team. @Frecks_94_ Come shop with us again soon, Jo! ❤ @isthefallen_one Yay! Now all you need to do is relax and relish in all the beautiful items you purchased. 😍 @maryd003 We are here for you, Mary! Please DM us your purchase info and your full name, mailing address, and email. Thanks! @MemesAndTruth We have found that our fans like to shop with us online and no longer send catalogues in the mail. We invite you to shop for your heart's desires here: https://t.co/Yhdw3kRCSV. @jilliankerr_ Although it smells divine, we think it must have something to do with the name, Jillian. 😘 @GowerTalbert We'll let our team know that you would love to see Vanilla Lace come back, Anne. @jmilligan2014 We love a good deal too, Jacklyn! 😉 @Tigerlilybeauty We are happy to remove you from the mailing list! We will just need your email and full name in a DM please. Thank you @destroyedcircle We have shared your request with our team, Madeline! @Tigerlilybeauty We are happy to remove you from our mailing list. Please send us a DM with your full name and email so we can help you! Thanks! @Justmari199 We are happy to look into this! Please send us a DM of your order number, email you used and shipping address! @eem_anderson We are sorry for the experience you are having with your order! We are happy to look into this more for you, Erin. Please send us a DM with your order number ,email and shipping address. Thank you @psanchezhidalgo So sorry your package was delivered to the wrong address, Paola! We'd be happy to help or you can reach our customer care team at 1.800.411.5116. For assistance here, please DM us your order number, email and shipping address. @Simply_DeJa44 We are so sorry to hear this, JeJa. Please DM us more details so we can be sure to share your feedback. @CHEMILE We love your style, Chemile. And, we've shared your request with our Product team for this fab backpack to make a comeback. Thanks! @Hannah_S39 Yay! Way to go, Hannah! 😘 @sophyagudelman You're ready to slay the day, Sophya! 💋 @EscapeEmma We see you over there getting those gains in! @rachelthesword You can still shop the Sexy illusions collection online! https://t.co/GrXW8IVCjf @BeccaNee We are glad you are loving it as much as we do ❤ @brittanyc316 We are sorry to hear that you have not gotten your bonus rewards, Brittany! please send us a Dm with more details of your experience. We hope to hear from you soon! @yesca721 We would like to learn more about your customer service experience, Jess! Please send us a DM with more details. We hope to hear from you soon! @TheCarmenCruz Oh no! We are so sorry to hear that your Very Sexy bra has burst, Carmen! We would like to speak directly to you. Please send us a Dm with your phone number and the best time to reach you. We hope to hear from you soon! @damndee__ So sorry for the delay in receiving your order, Damndee. We'd be happy to check on it for you. Please send us a DM with your order number, first &amp; last name, email and shipping address. @misstcliffe So sorry to hear this happened with your new bralette, Tory! Please DM us where you made your purchase (in store with the receipt barcode number or online with your order number). Also, please provide your full mailing address and email. Look forward to your reply! @britt_leigh_2 We'll share that you'd love to see this gorgeous set return, thank you Brittany! @meliduhhh Now's totally the best time to stock up! https://t.co/VznoWvz7zd @andiedadog Sexy looks good on you, Andrea! ♥ @patticre Come and shop it all, Patti! ♥ @Ninjawarrior9 Can't have that, Becca! Give these a try: https://t.co/9gQi3qhtbN. No tripping or worries! @Ninjawarrior9 We've got just what you need, Becca. Check out our most Loved Yoga pant: https://t.co/BoIO9mqQjE. Available in 3 lengths. Happy shopping! @feisty_free_red Oh no! We would like to learn more so we can further assist! Please send us a DM with what style of panties you have that split. We hope to hear from you soon! @hizladyhazel We are sorry to hear that your lip gloss is leaking! Please send us a DM with your purchase information so we can further assist. Thanks! @shaelyn_xx We would be happy to take a look into your order, Shae! Please send s a Dm with your order number, full name, shipping address, email address and phone number. We hope to hear from you soon! @insideneashead So happy to hear you received your replacement. We hope you enjoy! @michael10628711 Thanks for sharing. We will make sure the team is aware of your request. @deonnaalee Now that's how you start a day! ❤ @spookypumpkinxo We can't wait for you to receive your order either! Enjoy! @ChristineMcAlo3 Oh no! We're sharing your feedback concerning the padding with our team. @christi_stevens We're sorry you're having issues with applying your gift card, Christi. We'd like to help. Please give us a call at (800) 411-5116\n8:00AM - 2:00AM EST, 7 days/week @carlyjadeslo We're sorry for the trouble you have had with your order, Carly! Please send us a DM with your full name, order number, email, complete shipping address, and order number shown on the invoice in your package. Talk to you soon! @n_till14 We would like to learn more, Nicole. Please send us a DM with more details. Talk to you soon! @jessberkzzz We're always here to help, Jessica. Please send us a DM with your full name, order number, email, and complete shipping address. Talk to you soon! @DearKatieBrown We truly appreciate you and your shout out for Holly! We've shared your comments with the appropriate leaders! ♥ @pbnjsamwhich Just livin' that cozy Angel life! We're obsessed with the Ribbed Jogger! https://t.co/jz75vD0knv @kirbyflock23 Let's take a look at your order status, Kirby! Please DM us your name, order number, email and shipping address. We look forward to your message! @Muirghealottew4 We're always here to help! We appreciate the shout out and have shared your comments with our leaders. Can't wait to shop with you again soon! @Jackkarii Happy to share your request for seating outside our fitting rooms, Jack! @Kimmers971 We're sorry for the delay, Kim! We'd love to take a look at your order! Please DM us your the name on your order, order number, email address and shipping address. Thank you! @minratatatat We'd like to learn more about your service experience, Min! Please DM us your email address and phone number, along with any further details you'd like to share! We look forward to your message! @Felicia_Bacon We've shared your love and request for Vanilla Lace with our team, Felicia! @_Chelsea_Lynn We love that you'd like to see a store closer to home, Chelsea! We've shared your interest with our team! @Horcrux76 We appreciate your feedback on multi-pricing and have shared this with our team! @justamixofmegan We're sorry for the delay in receiving your order, Megan! We'd love to help! Please DM us the name on the order, email address, order number and shipping address. We look forward to your message! @yuvicella We're happy to learn you loved the $10 off recycle promo! We've let our team know you'd love to see this offer return! @itsjameera We're here to help, Jameera! Please DM us the name on your order, order number, email and shipping address. Thank you! @ShortDandelion We'd like to speak with you regarding this, Paige!  Please send us a private message with your first and last name, phone number, and a good time to reach you. @avamstanford We're glad to help, Ava! ♥ @Maxine_Jackson0 We are sorry to hear that your package arrived in this condition, Max! We would be happy to help with the missing panty along with the damaged pair. Please send us a DM with your order number along with your full name, shipping address, email address and phone number. Thanks! @avamstanford We are sorry to hear that your package arrived in this condition, Ava! We would be happy to help. Please send us a DM with your order number, full name, shipping address, email address and phone number. We hope to hear from you soon! @ashlynjeanlily We are sorry to hear that your order was canceled, Ashlyn! We would be happy to take a look into this for you. Please send us a DM with your online order number, full name, shipping address, email address ad phone number. We hope to hear from you soon! @sleepykitty_ Oh no! We would be happy to help, Salem! please send us a DM with your full name, email address and phone number. We hope to hear from you soon! @Rach_Ryz We've let our team know you love our sport line! Our new Lifestyle Collection will be coming soon and does include sport bra styles and a tight! Stay tuned for more updates! @Rach_Ryz We got you, Rachael. You can get all of our Sport from our Sport Bras to our amazing Leggings to our tops. Get your faves here: https://t.co/DGomd2MnmY. @MommyGee408 You shouldn't have any issues using your Angel Reward. Please DM us your offer code and pin number and we'll take a look. Thanks! @Allieshy94 We would like a chance to learn more, Alicia. Please DM us &amp; elaborate. Thank you. @IrieDame We'd like to speak with you directly, Denise. Please DM us your phone number, best time to contact you and further details of your experience. Thank you! @MommyGee408 Your wish is our command! Both of those gorgeous colors are available in your size in the Dream Angels Demi Bra. You can order it here: https://t.co/amHZsQWwl1. @_chanzzz We replied to your DM, Channah. Take a look when you have a second. Thanks! @MommyGee408 Let's spend your reward! Tell us the style bra you're looking for and size. Thanks! @AlwaysAliciaaa We promise it will be worth the wait, Alicia! @aj_12019 Only happy faces, Alaya! You can replace your beautiful Bombshell Bra here: https://t.co/3MhrBkBAEM. @sintiaygia Nothing is sexier than confidence, Sintia! @xoxdieselxox Loving your excitement to receive your order, Laur. We hate that you're still waiting and would like to help. Please DM us your order #, full name &amp; shipping address associated with your order. TY @nikimartinXO We can't lose you and would like to learn more, Niki. Please DM us &amp; elaborate. Thank you. @funkworkz Let us help, Daniel! Please DM us the long # under the barcode of your receipt, full name, mailing address, phone number, &amp; email. Thanks! @kmmorgan23 We're here to help! Please DM us your order number and the full name &amp; email address associated with the order, and the item you returned. Thanks! @realJennaTolls Your time in our stores is meant to be special, Jenna. We would like to learn more! Please DM us the day &amp; time you visited our Phoenix store. Thank you. @AlwaysAliciaaa We'd be happy to check on your package, Alicia. Please DM us your order number, email, shipping address and phone number when you have a sec. Thanks! @carmenflorida We're very sorry to see the clasp is broken. Please send us a DM with your purchase info when you get the chance. Also, please include your full name, email address, and phone number. Thanks! @_Formlessness We've let our team know you'd like our shower gels to return. 🙂 @edmontongnrfan We've let our team know you'd like our plain fitted T-shirts to return. Stay connected for updates. ❤ @iShellsea_ We're so sorry to hear this! Please give our Angel Card Department a call at 1.800.695.1526 Mon-Sat 8am-9pm EST. Thank you. @_LexiThough We'd like to learn more, Lexi. Please send us a DM with more details when you have a moment. Thank you. @ChristianaWlkr While our item numbers have changed, we do have a few styles featuring strappy detail such as the Lightweight Sport Bra, can you tell us which collection she loved? We'd be happy to help, Christiana! Send us a DM when you get a chance. @Vixenchild That is fabulous news, Harlett! We'll share your comments and we hope you love your new fit and style! 💖 @simona2553 😘 @RETROE1 We'll need some more info regarding your concern to best advise. Please DM us your full name, email, and additional details regarding the incident in question. @tieraslewis We're concerned, Tiera! Please DM us with more details. @bxstmistake_ We'd like to share your experience with our Quality Assurance team. Please DM us with more details. Thank you! @Wiredgirl11 We're sorry for any confusion our website (specifically shipping selection at checkout) has caused, Patricia. We've shared your concerns with our internal teams for feedback purposes. @JenniferRBoyd2 We've let our team know you love our sport line, Jennifer! Our new Lifestyle Collection will be coming soon and does include sport bra styles and a tight! @_quinaraa Care to share more, Angel? Send us over a DM with additional details so that we may address your concern. Thanks! @Howdy_Girl Thanks for your feedback on Eau So Sexy, Donna! We're only offering this fragrance in a 1.7oz bottle at this time. For assistance with a return or exchange, please see us here: https://t.co/5jR8Be0zu5 @ana_santos_1998 We're glad to hear it, Ana! Come visit us again soon! ❤ @tinalcomer We apologize for any disappointment, Tina! We've shared your feedback and request for the original Vanilla Lace to be brought back. @MarieHaskins Happy to share your love and request for our amazing Velvet Matte lip creams, Marie! @KimHisqueen We would love to help you more! Please send us a DM with your email, mailing address and phone number. Thank you! @BraydeeB We love to hear you love Bombshell Intense! It's super popular! @tharealyae Consider you request shared! 💚 @Prinnncess29 You can never have too many so there's always a need! 😉 @amberwestmodel Shopping with you is always fun, Amber! 😉 @Rosarionicho We completely understand your concern, Rose. DM us your order number, email address, shipping address, and the full name on your order so we can take a look! @sonia_artie We would be happy to see what's going on, Sonia. Please DM us your order number, shipping address, and the full name on your order. @theachromat So sorry your order hasn't arrived, Abby! We know you are excited to receive your items and would be happy to check on it for you. Please DM us your order number, first &amp; last name, email and shipping address. @xGamer_GirlXx We'd be happy to help! Please send us a DM with the order number, first &amp; last name, email and shipping address, as well as how we can help. @spooky_stoner Oh no! We would be happy to take a look into this for you. Please send us a DM with your  order number, full name, shipping address, email address and phone number. We hope to hear from you soon! @danib724 We are sorry to hear that your bra strap has broken after 2 weeks, Danielle! We would be happy to help. Please send us a DM with your full name, email address, and phone number. We hope to hear from you soon! @vllybllhny8 We have shared your love for Very Sexy Touch with our team! @osnapitzsweetnr Oh no! We hate to hear this! Yes, with your receipt,you are able to exchange any items that you are not happy with! @ThoughtsOfTony We apologize for any disappointment, Tony. We'd like to learn more about the Angel Card account, so we may best assist. Please DM us the account holder name, billing address, phone number and email. Thank you! @KimHisqueen We hate to hear that your bras have not held up for you, Kim! We assure you that we have shared your quality concern regarding your bras underwire coming out, the straps stretching, and disintegrating with our quality assurance team. Thank you for taking the time to reach out! @sydneywalt3rs Noted! @dirrtyyyd We have shared your love for the NFL gear with our team! @katofwinter You can never have too many pairs of panties! @karlyadele We have shared your request with our team! @Hiz_Mistry Hi! This is not a official VS account. We have made sure to share this with the proper teams for review. Thanks for bringing this to our attention! @brokencoconuts We hate to hear that your birthday reward has not arrived! Please send us a private message with your full name, email address and phone number. Thanks! @oilybetch Good choice! Whats your fave style? @AMGGG93 Come and get it, Aiyshh! ♥ @alivetjones Oh no, Alison! Send us a DM when you get a moment so we may learn more. We hope to hear from you soon! @aleasia1498 We love hearing this, Aleasia! We have shared your feedback with Chelsea leaders at the Coralville location! @kweenkati So sorry your gift card isn't working, Kati! Please DM us more details of where you attempted to use and the error message received. Please also provide the card number, your full name and email. Thanks and we look forward to hearing from you! @Tuqa_Alsecait We'd be happy to help, Tuqa! Just send us a DM with your order number, email address and shipping address. @WhitneyLeola We love these, Whitney! Thanks for shopping and we'll definitely share your request for seamless biker shorts too! ❤ @SabihaSyed5 So sorry for any disappointment, Sahiha! Please send us a DM with more information so we can further assist. @LatriceWms We'd like to speak with you concerning your experience with our Dream Angels Bra, Latrice. Please DM us your full name, phone number and the best time to reach you. We look forward to hearing back from you. @xoCesia We would like to speak with you directly, C. Please send us a DM with your full name, phone number, and best time to call. Talk to you soon! @KchanSIE We hope you love your new cute undies! ❤ @mahak_lakhani We're sorry for any disappointment, Mahak. We've made sure to forward your feedback with our Leadership Team. @DeborahNOrtiz We hear you, Deborah! Stay tuned for updates! @mzlevelz3 See you soon! 😉 @DemocratsLying We've made sure to forward your feedback with our Leadership Team. Thank you for reaching out to us. @amyprice260 We love to hear this, Amy! ❤ @DemocratsLying We'd like to learn more. Please send us a DM with additional details. Also, please provide your full name, phone number, and email address. Thank you. @livergirl14 Glad we could help!❤ @Monica___L We'd like to learn more. Please send us a DM with more details. Also, your full name and phone number. Thank you. @Laurenaatherton If it's not in the works currently, we'll share your request. 🤞 Stay tuned! @Khannel973 We're sorry to hear this. Please send us a DM with further details, along with your full name and phone number. Thank you. @MiniMacbeal We've let our team know how much you'd like to see our Champagne Glow Fragrance Mist to return! As this was one of a kind, we recommend trying Bloom Box! https://t.co/r7G3LcSyeF ❤ @Factsneverlie So happy to hear your 2nd visit went well thanks to Alexa's great team and Whitney! We want you to enjoy your shopping experiences each and every time. We've made sure to also forward this feedback with our team. Thanks so much! @aliceintrapland Our 10/$35 Panty Party is available! Be sure to check with your local store for participation or shop online today!  https://t.co/VznoWvz7zd @DemocratsLying We're very sorry to hear this. Please reach out to our Angel Card Services at 1.800.695.1526 Mon-Sat 8am-9pm EST. @livergirl14 We are so sorry to hear. Please DM us your order details so we can help. Thanks! @RwhoweR Thanks for sharing! We do still have fabulous Yoga Pants. Tap here to order https://t.co/4ogaz19CWP. We will also let the team know about your concerns. Go inside the making of the Incredible collection (featuring a very special appearance from Angel @MarthaHunt!): https://t.co/9TapR0F7Bz @NoorAlmuzaffar Now that sounds amazing, Noor. Noted! @_mariiexo And, Amanda knowing how to work those deals! 😘 @ha_gabrielle Thanks so much for the love, Gabrielle! ❤ @Aloha808808 We are truly sorry. Please DM us so we can look into this for you again. Thank you for your patience. @Eidasanne An amazing feeling, Sade! @emmaphillipsxo Sorry to hear, Emma. Please DM us so we can help. @Tweetyb73804099 Thanks so much for sharing! We love to hear you are an Angel now! @AnnieStoic We would like to share your experience with our Team, Annie. Please send us a DM with more details including the store name, your full name, and email address. Talk to you soon! @ThoughtsOfTony We're very sorry to hear this. We've made sure to forward your feedback with our Leadership Team for review. Thank you for bringing this to our attention. @brhodes1997 We'd like to help, Becca! Please send us a DM with your order number, name under the order, and shipping address. Thanks! @liltinky_ Please reach out to VIP@VSCAT for info, Shanti. @19951103m No news yet. Stay tuned for for availability! ❤ @Factsneverlie We love to hear Kayla from our Castleton Store made your shopping experience great! We've made sure to forward your feedback with our team! ❤ @xHannahTatex We're sorry to hear this. Please send us a DM when you have a moment. Thanks. @lupitacarranzac We always love having you shop with us, Lupe! 💞 @maryland_mami We're so glad you love it! @AfafAlshawa We're very sorry to hear this. Please send us a DM with your full name, purchase details, and phone number when you have a moment. @ashleejuelz1 Check out our swim here: https://t.co/YieE7u7tHT 💙 @NotGemmaC We're very sorry to hear this. Please send us a DM when you have a moment. Thank you. @dangerousweirdo We've forwarded your request with our team, Courtney! 🖤 @gina_martelli So glad to hear Sadie and her colleagues helped you have a positive experience in our Beverly Center Store, Gina! We've made sure to forward your comments with our Store Leadership Team for review. Thanks so much for reaching out to us! ❤ @__mitzi That is weird! Try clearing your cache &amp; cookies to make sure you're shopping our most current web page. Thanks! @Lauren_arnold_x Let's get you your beautiful items, Lauren! Please DM us the item number that you'd like. Also, try clearing your cache &amp; cookies to make sure you're shopping our current website. Thanks! @__mitzi So sorry items you are interested in are showing no longer available. We've shared your feedback and let our team know you'd love to see these restocked! @CSquared_ Tomorrow is the last day! Stock up on all your faves while you can. ❤ @pretty_gyrl_83 We love this deal! @lalauren18 It is should arrive within 3 weeks (by 9/7), Lauren. If you haven't receive it, please reach out to Angel Card services at 1.800.695.1526. @emmaphillipsxo We apologize that you are experiencing this with our website, Emma. We have shared these specific details with our team and we will be looking into this further. We appreciate your patience and keep trying! @barbiegirlgab He's a keeper for sure! ♥ @savannahburke33 Oh no! We would be happy to take a look. Please send us a DM with your order number along with your full name, shipping address, email address and phone number. We hope to hear from you soon! @miss_trebleclef Now is the perfect time to grab all of your favorites! @ufg8tor55TGV We have shared your request with our team! @sheult Oh no! We would be happy to take a look into your order. Please send us a DM with your full name, shipping address, email address and phone number so we can further assist. We hope to hear from you soon! @livlivsieff We are sorry for any frustration the price difference has caused and assure we've shared your feedback with our leadership team. Please DM us if you have any other questions or concerns. @CheechBebe We apologize for the frustration with the tags and assure we've shared your feedback with our team, Jackie! @RachMerz08 We are sorry for the frustration this has caused, Rachel. We want to make sure you're connected with the right associate. For all inquiries regarding your Angel Card, please contact our Angel Card Customer Care at (800) 695-9478 (Comenity Bank) Mon-Sat 8am-9pm EST. @Janeviolettt Come shop with us again soon, Jane! 💕 @dani_mastro20 Anything for you, Dani! @shessolouky We're here to help, Amanda! Please DM us your full mailing address. Talk to you soon! @DustyRose1551 That's what we love to hear, Jill! We strive to always provide our customers with a shopping experience that is never shy of perfect! @brookelindsayya We appreciate your valuable feedback, Brooke! @theyLOVE_Bobbi We'd like to learn more! Please DM us with details. @DPetty4life The best EVER! 💖 @ktdreamgirl We love the prints you picked, Dreama. We're glad they got shipped super quick! @PrincessFilth1 We hope you adore everything you brought home! @Lynda95128490 We never want you to have bad service, Lynda. We would like to forward your feedback so we may address and fix this! Please send us a private message with more details so we can help. Thank you! @hellogretchh We're concerned! Please DM us with your full name, email address, and more info. Thank you! @L45129330 We'd like to learn more about your experience at our Milton Keynes store! Please DM us with your full name, email address, and full mailing address. Talk to you soon! @jnicaGee So many deals, so little time!! ❤ @TaylorWood717 We let the beauty team know that you are loving Cherry Pop, Taylor! @Dae__9 We'd like to speak with you concerning the experience you had in our St. John's Town Center location in Jacksonville, Florida, Ari. Please DM your full name, phone number and the best time of day to reach you. We look forward to speaking with you. @HaleyStep This is the perfect time to stock up, Haley! @holliedavis_ We're sorry to learn of your concern with your panty, Hollie. Please DM us where and approximately when it was purchased so that we can share this with our Quality Assurance Team. @TaylorJean208 We've shared your request to bring back our nursing bras, Taylor. Thanks for reaching out! @MondaeFraser We have shared your request with our team to being this back in the future! @BeeAnonymous2 We would love to learn more about your experience! Please call us at 1-855-866-5810. Thank you. @MySPOILEDAss Stock up on your faves now! 🛍 @courtney_dana We are sorry to hear about your experience, Courtney! We would love to learn more. Please DM us with your email, phone number and full name. Thank you! @MegsSchilling We would love to learn more about your experience, Megan! Please DM us with your email, phone number and full name so we can look into this more! Thank you! @MelissaKXLY4 We would love to look into this for you, Melissa! Please send us a DM with your email and full name! @AmiAFCxo We love to hear you love it, Ami! @SarahZuniga4 Hope you have time to shop with us, Sarah! 💗 @Lil_MsBarbie3 Your request has been shared! 💗 @melacy74 That's what we love to hear, Tasha! We've shared your kind words regarding your experience with Crystal at our Warwick Mall location with our team! 💗 @msklely09 It sure is! https://t.co/VznoWvz7zd @Amour_Marthe We love this sale! Thanks for shopping! ❤ @lexihughesss Thanks for bringing this to our attention, Lexi! We've shared this with our leadership team. @Stepfan39116550 We truly apologize for the experience you had at our Bay Plaza store location, Stephanie. We assure your feedback has been shared with our leadership team. Please feel to DM us if you have any additional details you'd like us to share. @cathyfilan_murs Which sale are you referring to, Cathy? @raymondrahner No need to steal the blanket when you can just snuggle! ♥ @ETRomero We apologize that you are experiencing this with our website, Elizabeth. We are looking into this currently and we appreciate your patience! We also invite you to shop via our app! @leehoseoknim We'd be happy to assist with any questions you may have! Please DM us the fragrance name and date of purchase. Thank you! @TheJesMariexo We're glad to hear, Jes. We hope you love it! 😉 @BeautifulXTC So sorry to hear you have not received a response to your email, Clare. We regret we do not have access to the contact here, however, if you DM us we'd be happy to further assist you. @xxstephaniiiee So sorry to hear this, Stephanie! Please DM us and we'd be happy to help! If it is in regards to an order, be sure to include the order number, email and shipping address. @ryiash So sorry for any confusion, Ryinne! The 10/$30 was for the early access yesterday, they are now 10/$35. @DawnSchmitz We hate to hear you did not have a good experience while shopping at our Milford, CT store location, Dawn. We assure we've shared your specific comments and concerns with our leadership team. Please DM us if you have any additional details you'd like to share. @jasminebayless5 We're so sorry about the long line you experienced, Jasmine! Send us a DM with the store location so we can be sure to share your feedback with the proper team. @sweetxgirl We're so sorry for any disappointment, Nelda. We no longer carry the body washes in these fragrances. We've let our team know you'd love to have these back. In the meantime, be sure to check out the ones we do have online at https://t.co/9ejksaitYi. @DamnGirlGYST We've been sure to share your passion for Vanilla Lace with our team for future consideration! @YoMelsey Be sure to check with your local store for participation or shop online! ❤ @kysimleecox Now that would be an amazing deal! Angel @MarthaHunt can’t get enough of the new Incredible collection. Watch her try on her favorites: https://t.co/9buynlw506 https://t.co/4GEZI2N2vh @see_a_saw We are very concerned about your experience. Please DM us your full name, email address, phone number, and receipt information. @feliciarichsand We love you back! @SKINONMOCHA We've got just what you need: https://t.co/2t2GH00ssk You're going to want to try our new Incredible demi! @Cheaper2beepher Nice shopping, Tj! Enjoy your new goodies! @sherridahottest Nice shopping, Angel! @Meagohmyeggo It's totally worth it, trust us! @bitcoinyancys Perfect choices, Yancys! @kaylietomas Nothing wrong with a little mid-week shopping, Kaylie! Enjoy your new treats. @livelyrockblog You're ready for any occasion, Krissy. We love it! @ilovemysaleen We love shopping with you, Saleen! ;) @bmagg86 We're sorry for the confusion, Bethany. Please send us a DM with your order number, full name, email, and complete shipping address so we can take a look. Talk to you soon! @Carolinamade_ Thanks, Angel! We'll share with our leadership team! ❤ @pastella_sgh We'll let our team know you are ready for Halloween styles. Stay tuned! @Educated517 We're loving it too! We'll share love with our team and let them know you'd love to see some great deals so you can get every color! @raaaaaaaphaela We sure did, Raphaela! @woaahitsfrances We're so sorry to hear this! Please send us a DM with your order number/store receipt barcode number, name under the order, and email address. Thank you. @mammamemmer Noted, Kim! 😉 @NotGemmaC We'd like to look into your order. Please send us a DM with the order number, name under the order, and shipping address. Thank you. Incredible is so much more than a bra. It’s innovation, technology &amp; style. Learn more in our behind-the-scenes video series: https://t.co/9buynlw506 @Elliemae_bx We're so sorry to hear this and have sent a reply to your DM!  Please check when you have a moment! @baybe_swiss We're so sorry to hear this about your PINK panty, Chelsey! Please send us a DM with purchase info, your email address, and phone number so we can assist further. @samncorral We're here to help, Sam! Please send us a DM with more details, your order number, email, and complete shipping address. TTYS! @BethAnneOkeefe We'd like to learn more, Bethanne. Please DM us with your purchase details, email address, phone number, and full mailing address. Talk to you soon! @emelitou We've been sure to share your request with our leadership team, Emerald! @NataleeLovelace Great picks, Natalee! ❤ @adlj1994 We'd like to learn more so we can share with our Quality Assurance team. Please DM us with your full name, email address, mailing address, and the store receipt barcode number/order number. Thank you! @losername_ Moms...💞 They love to keep all things fabulous. Angel @MarthaHunt can’t get enough of the new Incredible collection. Watch her try on her favorites: https://t.co/9buynlw506 @Nadyworld We apologize for any confusion, Sinead! Gift Cards are only able to be redeemed in stores in the country where they are originally purchased. Please check with your local store directly for more details! @maryamendola_ We are sorry for the experience you had in our State College, PA location, Mary. Please DM when you get a chance so we can further assist. @Jeannettee__ We apologize for the wait and we can assist you here, Jeannette. Please send us a DM with more details so we can help. Thanks! @Ask_Hannance We have shared your requests with our online team. We thank you for your feedback! ❤️ @ele_pirass We'd love to help, Eleonora. Please send us a DM with more details about the email so we can take a closer look. Thanks! @lexiebearrrr We'd be happy to take a closer look, Lexie. Please send us a DM with your order number, the name on the order, and the shipping address. We look forward to your reply! @intodaylights13 Prices can vary depending on the style, Andrea. View the collection on our website for all the details! @FleetwoodMina We'll be sure to forward your request to our team! @DowLinnell Please include your email address, name on the order, shipping address, and order number if the order was placed online. Please include your email address and receipt bar code number if it was purchased in store. @DowLinnell This shouldn't be happening, Dow! Please send us a DM with your purchase details and email address so we can take a closer look. Thank you! Meet the *incredible* women behind the bra with an inside look at our new collection in this four-part video series: https://t.co/9buynlw506 @bassbunnii Not at all what we like to hear, Sarah! Please DM us your purchase info,  your full name &amp; email address. TY @BentleyBlonde Thanks for bringing this to our attention, Wendy. And, we've shared this with the appropriate team. @safiyahtasneem To make sure you never miss out on any of our fab sales, Safiyah, we invite you to sign up for our emails here: https://t.co/jPO2eWtQoI. @SandraGFranke We're excited to hear you want to work with our company, Sandra! You can find our current opportunities online and apply at https://t.co/XpvQrj9Tzr. Best of luck! @drsatterfield13 Yikes! Please DM us your purchase info (in-store receipt/online order #), your full name, &amp; email address. Thanks! @andreakhatee We've shared your request with our team! @prashpeehu We'd love to take a look into your order! Please DM us your order number, email, phone number, full name and a few items from your order. Talk to you soon! @RMDSVan We're so sorry to hear this. Please DM us your receipt info, email, full name and address when you have a sec. Thanks! @kelljohnson113 Nice try, but our lips are sealed, Kelly. 🤐 @ashness187 We would like to learn more about your experience! Please send us a DM with more details, the store location, your full name, and email address. Talk to you soon! @aheit11 Here's hoping someone comes through for you, Amber! 🥂 @Stellaabellaa_ Thanks for giving us the chance to help, Stella! Enjoy your haul! ♥ @crimsonamners Oh no! Grab your receipt and bring it back into the store for an exchange. We're glad to help! @NikkiVanBlair We agree, it really is so sexy, Nikki! @tori_ashleyy We like your style, Tori! ♥ @HeavenlyIo It's not a jacket, but you'll love this crew: https://t.co/8zxdnvhvvL. We hope this helps! @matahara07 We can pass along your request, but you're gonna want to see this, Kristen: https://t.co/wZM0imfysw. Enjoy! @chloe_luckin You can find our current collection right here: https://t.co/tW4gKaPclc. Enjoy! @XGirlNYC Sorry for any confusion, Rena. We are having a different sale now! Happy shopping! @MR_MsDOS Sweet dreams, Angel! @Sophelino We're glad to take a look! DM us your order info, email and phone number when you have a sec! @_saaamB Nice savings, Angel! @funkworkz We're glad to share your love for our Heavenly Summer perfume, Daniel. Stay tuned! Until then, try this: https://t.co/p1KBrqZBHZ ♥ @my_p_kitchen Giving your body what it needs... we love it! ♥ @ShoshinZen Come on in and help her pick out her new faves, Jon! @spookypumpkinxo Sounds great! @angelicaxbeee We want to learn more about your experience, Angelica. DM us your full name, email, and best daytime telephone number. Thanks! @ayeeedubb_ There's always a good panty party coming soon... stay tuned! @jemappellesha We'd like to help! Please DM us with your full name and mailing address. Talk to you soon! Mood: incredible. Bra: Incredible. Coincidence? No way. @MaiyaTweets_ We hope you feel better and enjoy your mists, Maiya! @BCfiveever We have shared your requests with our merchandise team, Cassandra. We thank you for reaching out to us! @Acosta62808352 We promise we will do what we can, Macosta! @kimber_dancer We thank you for giving us the chance to make this up to you, Kimber! @_ArianaHemmings Livin that Angel life, Jasmine! 💋 @pinkshoegirl We've let our team know how much you'd love to see the Tanks with the built in shelf bras return, Kim! @KayElDouble_U Yay! We're so happy you were able to spoil yourself. You deserve it! 😘 @ash_hamm Shout out to Ash for letting us help take care of her! 😘 @thatonecoolgirl Up and at 'em. We love it! @ohktbaybay Noted! We've shared your comments with our team. We look forward to shopping with you again soon. @CarolynnRachel Let's get you takend care of, Carolynn! Please DM us your order #, the full name &amp; email associated with the order, and the item # of the top. Thanks! @DeAndra37 We agree! Please bring back your perfume and receipt so we can take a look. Thanks! @ZeljkaJurcevic We apologize to see your bra come apart in the middle, Zeljka! We want to see what we can do to help! Please send us a private message with the style of the bra, your email and billing address. Thanks! @breyuuuh We are more than happy to see if we can cancel it! Please send us a DM with your first / last name, order number, email and billing address. Thank you! @ohktbaybay We never want our store associates to be pushy, Katie. Please let us know the store location so we may share your feedback with the appropriate team. Ty! @Jenthinksblue We always want you to have a seamless shopping experience with us, Jen! Please let us know the store location so we may share your feedback. Thank you so much! @kimber_dancer We'd like to learn more! Please DM us with your full name, phone number, email address, and the best time to contact you. Thank you. @Justmari199 We're so sorry, Mariana. Please call our Angel Card Customer Care at (800) 695-9478 (Comenity Bank) for more assistance with your points! @lydiajasminee We love hearing what our fans are looking for, Lydia! What specific styles, colors, fabrics, etc. would you like to see offered in our collections? @RoatansFinest We would love to help! Please send us a DM with your full name, order number, email, and complete shipping address. Talk to you soon! @Dana_Stargazer We love this floral print too, Dana! 😍 @Miss_Aneta_M So sorry to hear you did not have a good experience at our Shepherds Bush Westfield location when returning your faulty bra, Aneta. So we may share your feedback and further assist, please DM us more details. We look forward to hearing from you. @bitcoinyancys We can't wait to shop with you... see you soon! @CourtneySchonew We are so sorry to hear about your seamless panties, Courtney! We would like to know more so we may share your feedback. Please send us a private message with more details and your email. Thank you! @lostwithshawn1 We let the beauty team know that you would like to see Cherry Pop stay for good, Rylie! @jam_onme We will be sure to let our web team know. We apologize for any inconvenience and we will work to fix this asap. We appreciate your patience! @omg_its_daniii We appreciate your shout out, Dani! We will be sure to share your feedback with Claudia's direct leadership team. We cannot wait to shop with you and your Mom again soon! @CaseyWolfgang17 We're so glad you've found the perfect fitting bra, Casey! ❤ The only thing better than the Incredible bra is the Incredible bra in new styles and colors. @jam_onme We'd like to learn more! Please DM us with the device and browser you're using. Talk to you soon! @passearthasbill That's what we love to hear! We strive to always provide our customers with a shopping experience that is never shy of perfect! We also believe in providing our associates and store locations with the proper recognition they deserve.❤ @jenniferemm We've shared your request with our team! @ClaireGoldofSF Thanks so much for stopping in, you've selected some beautiful pieces ♥ @jenniferemm Let us know what scent is your favorite! We will let the Team know you would love to see it return! @mo0nchilddd We've made sure to forward your comments with our Leadership Team, Ana! Thank you for reaching out to us. @rrusssss We've shared your request to bring back our Smooth Bombshell Bra, Rachel! Stay connected for availability. ❤ @sydneyfloresnew So happy to hear you've had a pleasant experience in our Fashion Show Mall Store in Las Vegas, Sydney! We've let our team hear your comments. Thanks so much! 🖤 @shelbyhawtin We're sorry to hear the strap from your new bra has snapped, Shelby! Please send us a DM with your order number/store receipt barcode number, phone number, and email. Thanks! @mo0nchilddd Good news, Ana! We do sell both Swimwear and Sport Bras! Here's a link to our favorite Double-scoop Sport Bra! https://t.co/1selTfWNUy @rrusssss The search is over, Rachel! Get your Strapless Bombshell Bra here: https://t.co/7HVS1HmBc8 @ptvmargo_ There's no wrong answer here, Margo! 😉 @RowanMcewann We're sorry to hear your leggings split! Please send us a DM with your order number/store receipt barcode number, phone number, and mailing address. Thanks! @giawselena We love to hear you'd like to join our team, Ashley! Take a peek at your options here:  https://t.co/XpvQrj9Tzr. Best of luck! @LiteDoctor Sorry to hear she is getting a text and hasn't placed a recent order, Sean. Please DM us her full name, email and shipping address and we'd be happy to verify that there are no orders. @itsdizzlebitch Our panties are currently 5/$28.50 or 3/$36. @YiannaJ We are so sorry to see that the zipper on your Yoga pant is defective, Yianna! Please send us a DM with purchase info, your full name, email address, &amp; phone number so we can assist further. @katlyntenna The beauty team has received your request, Kate! @jaclynhorob We would suggest checking out our Knockout Tights as a replacement, Jaclyn. We look forward to seeing you soon! @ourswxnsong We apologize that you keep receiving mailers and we invite you to unsubscribe on our website. We hope this helps. @wellfedscienti1 We apologize about your experience with your original order and the replacement. We never want these things to happen and we want to see what we can do to make this up to you! Please send us a private message with your original order number, email and billing address. Thanks! @iluvTaraNicole We like the way you think, Tara! We will be sure to share your thoughts with our marketing team. @hnnwnchstr No word yet! We will be sure to share your interest with our beauty team, Hanna! Describe your favorite bra in one word. We’ll go first: INCREDIBLE. @jullykstro We are very sorry that your order never arrived and for the lack of help you've received, Jully. Please DM us your order number, email and shipping address so we can help. We loo forward to hearing from you. Our softest bra ever is back, in all-new styles. There’s only one word for it—Incredible. https://t.co/5t9b93Upo1 https://t.co/166VSnytaG @XGirlNYC Happy to help, Rena! All sales are final on items purchased in outlet stores and are unable to be returned or exchanged in any store. You can review our full return policy online at https://t.co/2ZrwMSLSlq. @Dorothe47038635 Thank you for reaching out to us, Dorothea! We are in no way affiliated with this event. We appreciate your concern and thank you for reaching out. @Raffers25 We will be sure to share your positive feedback with the stores leadership team, Sarah! We cant wait to shop with you again soon! @irachelcampbell Happy Birthday, Rachel! Get your glow on! @MissOlya You can never have enough, Olya. We love being your favorite! @Binzerrrr We apologize that you did not have a good experience with our Backless bra, Lindsay. We would like to forward your feedback! Please let us know more details so we may share your concerns with our quality assurance team. We would greatly appreciate it! @iBall_RightNow We invite you to unsubscribe on our website, Mike. We hope this helps! @nhallett1018 We appreciate your love for our Bombshell Intense collection, Nicole! @dicloniikaede We'd love to speak with you concerning the experience you had at one of our stores. Please DM us your full name, phone number and the best time to reach you. Back to work, but never not working it 💁 @BeastlyBays We've shared the love, Jenny! ❤ @FemmeLvl It makes traveling oh so much better! @betajacquier Thanks so much for stopping by, Angel! ♥ @louisewillis_ We would love to learn more about your store experience, Louise. Please DM us with your store location and more information. Thank you. @rospiediner We are happy to look into this further. Please send us a DM with more information. Thank you! @skinnyangel18 We have shared your request to bring back discontinued scents, Brandy! @AllThingsGuru Let us know how you like your new goodies, Sellé! 💕 @thecfabae We'd like to learn more, Jane. Please send us a DM with additional details, as well as your full name, and email address. Thanks! @Aloha808808 We're sorry to hear this. Please send us a DM with the panty style, your full name, and email. Thanks! @yeeelah Noted! Keep in touch for updates! 💕 @anitsirhcmarie You're so welcome, Christina! So happy to hear you enjoyed yourself. 🖤 @alanna_pc We're sorry to see this, Alanna! Please send us a DM with your full name, email address, and phone number when you get a chance. Thanks! @sotiredsendhelp We're sorry to hear 32A was not available in store, Ashley. We do have 32A available online! Check out our Dream Angels Demi Bra! This ultra soft bra is the perfect addition to your bra collection. https://t.co/3OH9oY0QD3 @tina_tina94547 Happy belated birthday! So glad we could help make your birthday enjoyable! 💕 @djnaz05 We're sorry to hear this, Danielle. Please send us a DM with more details of your bra, your store barcode receipt number, full name, and email address. Thank you. @souzou_no We love to hear this, Souzou! Please send us a DM when you have a moment. Thanks! @ohgawdyess We're sorry to hear this! Please send us a DM with your order number/store barcode receipt number, full name, and email address. Thanks! @Rach_Ryz We're sorry to hear this, Rachael. Please send us a DM with the store location, your full name, email address, and phone number. Thank you. @hvnnvhxmvisie So happy to hear you were able to access our page! @maj_312 Oh, no! Please send us a DM with your purchase details, full name, email address, and phone number. Thanks! @hvnnvhxmvisie We're sorry to hear this! We recommend clearing your cache and cookies or trying an alternate website browser. Best of luck! 🖤 @_aaronignacio Be sure to check out our new Bombshell Intense! It smells amazing! @designdinedog Please send us a DM with more details so we can properly share your feedback and further assist. @BlaqueIceBeauty So sorry we no longer carry the Wild One Body Mist, Cherie. We'll let our team know how much you love it and would like to see it back. Be sure to check out our new Bombshell Intense, it smells absolutely amazing! https://t.co/7ZApzXoqDP @msbenav If we may be of any further assistance, please let know! @tribalawley We're sorry to hear you were unable to score your desired offer, Caitlin! DM us your full name, email, and receipt barcode number so we may share your feedback! @BambooBangaaa Thanks for your feedback on our current formulation! We're always working to improve! @Spaceman_2019 Best part is, this is just the beginning! 😉 @LaNette80898389 Sounds like a shopping trip is in your near future, LaNette! @NurseKarr Touchdown!! @icefoodie xoxo @GorgeousDeviaci We'd like to hear more, Griselda! Please DM us your purchase info (receipt info or order #), email address, and phone number! @Thedove49461740 We're sorry for our confusion! We've made sure to forward your comments with our Leadership Team. Thank you. @Erin_Kathleenxo We hate you had this type of experience in our Bridgewater location, Erin! Please DM us more details so we can be sure your feedback is shared with the appropriate team. @TanyaL527 We're sorry for any disappointment this has caused, Tanya! Please DM us when you get a chance so we can share your feedback. @dcamjones We'd like to share with the proper store leadership, Daniel!  Can you share which location you were in? @Thedove49461740 We're so happy to hear you're enjoying your new bras and panties. Please send us a DM with they types of bras and panties you've purchased. Thanks! Re: lingerie—less is more AND more is more. @_ShannonOliver2 We're disappointed to hear this, Shannon. Please send us a DM with your receipt information, first and last name, address, phone number, and email address! @HEHASKEPTME We'd be glad to take a look! Please DM us your full name, email, phone number when you have a moment. Thanks! @Leachypeachyowo We're sorry to see this! Please DM us with your order details, email, full name, phone number and the ID/RN/CA info from your bra. Thanks! @kelsiewalker09 Thanks for being an Angel, Kelsie! 💋 @mandyfelix1984 We’re sorry to hear you’re having trouble with our website, Mandy! We recommend clearing your cache and cookies or trying an alternate website browser. If you continue to experience difficulties, please send us a DM so we can help. Thanks you. @LizHaro1 It is all day, Liz! @desiru178 We are so very sorry that you did not receive the service you deserved, Desiree! We want to see what we can do to make this up to you! Please send us a private message with more details and your email. Thank you so much! @katanachan We are so very sorry to see this happen to your Body By Victoria bra! We want to see what we can do to help. Please send us a private message with more details, your first / last name, phone number, email and billing address. Thank you so much! @AEB897 We are so very sorry that you have received a incorrect item, Ashley! We want to fix this! Please send us a direct message with your order number, the SKU number of the item that did not arrive, your email and billing address. Thank you! @AmberR0220 We hope you love what you ordered, Amber. We cant wait to shop with you again! @Johnson_Cassie We're sorry for any disappointment regarding your Angel Card account, Cassandra! We'd be happy to assist. Please DM us your name, billing address, email and phone number. Thank you! @WhitneyLeola Please let us know what you're experiencing so we can help, Whitty! @esio_trot We cannot wait to shop with you again. We hope you love everything you brought home! @KimberlyRuizz_ Let us know how you like it, Kimberly. ❤ @AllThingsGuru 😘 Happy shopping, Sellé! @oldhousemouse Thank you for bringing this to our attention, Christi! In our world, “going-out top” is code for “bra top.” @lavina_29 We love this award winning scent too, Lavina! ♥ @marygenealogy Awww thanks, Mary Ellen! We're always here to help! We can't wait to shop with you again soon! ♥ @CurlyFairyy We're here to help! Please send us a DM with more details, your full name, and email address. Talk to you soon! @Caitlyn_Allon We're loving this sexy new style too, Caitlyn! Shop the Shine Strap Brazilian Panty online at https://t.co/2Uupnz3Nt4.❤ @BreCorgan OMG! We're so excited to hear you love it, Bre! It's definitely a new fave! Decisions are hard, so we narrowed it down for you: @MegaQuack24 We totally understand the feeling, Meaghan ❤ @_LaurenTheLady_ We would like to learn more about your recent visit, Lauren! Please send us a DM with more details. We look forward to talking soon! @minaaaav We hate to hear that you package has not arrived, Mina! We would be happy to help. Please send us a DM with your order number along with your shipping address, email address and phone number. We look forward to hearing from you soon! @cknupp5 We are so sorry we sent the wrong order for your replacement, Callen! Please send us a DM with the order number, email and shipping address so we can further assist. @qhopp Our No-shows are perfect for hiding panty lines! https://t.co/6KlAKXzb27 @kxhlanii That's not okay! Please DM us your purchase information, full name, and email address so we can help! @cmwood20492 We are just getting heated up, Chloe ♥ @memo4990 We've got just what you need for your Anniversary date night: https://t.co/gpMDgejY0Q. This should be a nice start. @TheNorseEmpress We love it too! @hawaiigirl3 A'ole pilikia, me-shell. Enjoy your goodies! 😘 @ceearahh We'd love to find out, Ciara! DM us your order number, email &amp; phone number so we can take a look. @NickiSignMyTat We love the way you rock that PINK gear! ♥ @kendalukefahr Oh no! We so sorry to hear that your package has not arrived, Makenda!  We would be happy to take a look. Please send us a private message with our online order number, shipping address, email address and phone number. We hope to hear from you soon! @LeeLeeBaBy323 We hate to hear that your new panties have ripped after 4 hours, Leelee! We would like to learn more so we can share this feedback with the proper teams. Please send is a DM with which style of panties you have. We look forward to hearing from you soon! @nikki101074 We are sorry for any disappointment and would like to learn more, Nikki. Please DM us more details so we may further assist. @ambitnpldn We're happy to review your mailing list frequency. DM us your full name, email, and mailing  address in question! @maarsnl It's our #1 favorite! Let us know what you think! 💕 @CarlinSchmucker Thanks for your interest in our Fall Collection, Lorraine! DM us your full name, email, mailing address, order number, and more info about your offer so we may learn more! @lisa201111 We hate to hear this has happened with your recent orders, Lisa. Please DM us your order numbers, email and shipping address so we may share your feedback and assist with the orders. @sommerlune So sorry to hear the experience you've had with recently deliveries, Jules. If you are still in need of assistance with your orders, please DM us your order number, email and shipping address. @Tori_Gash Ours is too, Tori! It's so hard to choose! @SophieLaneMedia We're sorry for any confusion this has caused and would be happy to look into this for you, Sophie. Please send us a DM with your order number, first and last name, email and shipping address. @JLunaRadio We let our beauty team know, Jocelyn! 😉 @3heather24 You deserve it, Heather! @Abbyeatsorganic We would like to speak with you directly about your experience, Abbie. Please send us a private message with your phone number and best time for contact. Thank you. @xiomaraglp1 We are lovin your peach pajamas! 😉🍑 @somewhere_land We apologize that your package was taken and we would like to speak with you further about your experience! Please send us a private message with more details,  your first / last name, email and order number. Thank you! @themadwanderer We are so very sorry to hear about your experience with our shipping partners! Please send us a direct message with your first / last name, order number and more details so we can help. We would really appreciate it! @BeccaLittleOne We are so very sorry to hear that you were not assisted properly and we want to help, Rebecca. Please send us a private message with more details and your email. We would greatly appreciate it! @raylene056 We hate to hear this, Raylene! Please DM us the store location so we can share this with our store leadership team. @your_very_own That's our goal! We're so happy to hear! @MrsTerry331 We are so sorry to hear how one of our associates treated your during your recent visit, Ashley. So we may follow up and share your feedback, please DM us the date and approximate time and any additional details about your visit. @atheisen1 It really is, Alli! @Brandimich17 We do still send order and shipment confirmations and apologize you haven't received anything yet, Brandi. Please DM us your order number, email and shipping address and we'd be happy to look into it for you. @KeryhaOnTheMic Thanks for shopping, Keryha! ❤ @itsbellamusser We do not, Bella. But, we will be sure to share your interest in the return of our PINK Wild At Heart collection with our beauty team! @theylovekendrea We'd love to check on the status of your order, Ken! Please DM us your name, email, order number and shipping address. Thanks! @YankeesGirl4Eva Your feedback has been forwarded, Kaye! @rissa724 We'd like to help! Please DM us your order #, full name, shipping address, &amp; email address associated with the order. Thank you! @Cnav122513 Noted! 🖤 @cknupp5 Let's find your Swim suits, Callen! Please DM us the order #, full name, shipping address, &amp; email address associated with the order. Thanks! @MandyLuBeauty Yay is right, Amanda! We love how your boss appreciates you and values you. Happy Monday! xoxo Sensual. Exciting. Always a mood. The Fall Collection is waiting: https://t.co/JIUtAkS7HC @avijaye Amazing how scents are like a time machine! @FemaleYoda We can't have your heartbroken, Tiffany! Please DM us the style, your full name, and email address. Thanks! @dimps2k11 That's a great question! DM us so we can share your frustration with our team. @msjazzsaidit We'd love to share your request to bring back our nursing collection, Jazz. Stay tuned! @BritaniiDiamond Thanks for stopping in today... enjoy your goodies, Cindy! ♥ @ChristianaWlkr Hey, Christiana! We're not anticipating a replenishment for this style in the near future. Our Love List feature has been temporarily removed online. It'll be back soon! @Daniivx We're let our team know you're hoping to see this fragrance make a comeback in the future! @jxms16 Thanks for the love! Happy shopping! Can lingerie be life-changing? You won’t know until you try it (on). @rocciorunway23 We're counting down the days too! 😍 @JennySylivant That's what we love to hear, Jenny! We strive to provide a customer service experience that is never shy of perfect. We look forward to shopping with you again soon! ❤ @JennySylivant We've let our merchants know how much you'd love to see this retired fragrance brought back out of the vault, Jenny! @Cari_Izza We're concerned, Cari. Please DM us with more details! Include your order number/store receipt barcode number, full name, email address, and full shipping address. Talk to you soon! @GabiBouffard We've let our team know, Gabs! @TaylorLangdale That's what we love to hear, Tay! So glad you found your perfect fit. ❤ @ashlerrss Treat yourself, Ashley! @michaela_nalley We'd like to learn more so we can share your experience with our store leadership team, Michaela. Please DM us with more details! @GabiBouffard We are so very sorry for any disappointment and we would like to forward your feedback, Gabs! Please let us know which scents you would like to see return. TY! @brittyeryk Fabulous picks, Brittany! 😍 @ee_el_vee We are so very sorry to see the sensor is making it hard for you to try on the bra, Elissa! Please let us know the store location so we may forward your feedback. Thanks! @BTamb_2010 Check back with us soon, Brianna! @ACPBella1 We would like to learn more about your experience! DM us your full name, email, and order number/receipt barcode number for your purchase. @sweetmamaas Gee, thanks, Jade! We're glad you love our lip products! @soyleomoreno Our beauty team has received your request for the return of our Vanilla Lace collection, Leo! @SarsarJohnson We're concerned and would like to learn more about your experience, Sarah! Please send us a DM when you get a moment! @ShanPir Amber Romance! @cciop_ We're glad to hear you love it! @jessicajames333 We're sorry to learn of your concern with your package's arrival, Jessica. Your experience is being shared with our shipping partners and please send us a DM if you have any concerns with the package's contents. Thank you! You deserve it all: lace, silk, satin, luxe details. The Fall collection is here. @imstillaaron Oh my! What a phenomenal choice, Aaron. Very Sexy for Him is such a tantalizing scent! @EboneJones We hope we made the special occasion even more sexy! Congrats, Eboné!! @RezanAlNimer We'd like to learn more, Rezan. Please DM us and elaborate. Include your receipt info, mailing address, &amp; email. Thanks! @kailey_sampson We completely agree, Kails! 😍 @stormyxseas We are truly sorry for the disappointment in the new body mist, Tracee. Your comments have been shared with our beauty team. @LoveableAireka We're so sorry for the experience you had with our customer service team, Aireka! Please provide us with more details concerning your gift card and we'd be happy to see what we can do. @darbyakamimi923 We're sorry to hear this. Please send us a DM with your store receipt barcode number, full name, and email. Thanks! @2old4this26 Hi, Gloria! We'd like to share this information. Please send us a DM with the store location when you have a moment. Thanks. @lilnikkib Sounds like you had a great time shopping with us and we love your picks, Nicole!  Thanks for stopping by to visit us ♥ @BucketsEllison Such a great deal! @ts_jems Thanks for your interest in shopping our fragrances. We’re sorry, due to shipping restrictions on items containing alcohol, we’re unable to ship perfumes or fragrance mists overseas. For more information, please visit us online: https://t.co/CvgJnDw34F @brooketaylahhh7 Thanks, Brooke! ❤ @KhHixson We appreciate your reply and assure we've shared your feedback with the appropriate team, Kay. Our apologies for the experience you had. @Degrassigirl201 Please DM us when you get chance so we can help, Lizzie! @alemichrod We will let our team know how much you miss our shampoo/conditioner, Ale. ♥ @JenniMetz Today was such a GOOD day! We glad you enjoyed it too, Jennifer! @charlxttelc We are so very sorry to hear that you are missing an item from your bag, Charlotte. We want to see what we can do to help! Please send us a private message with the receipt barcode number from your purchase, the name if the item missing and your billing address. Thanks! @shaynalucky Thanks for stopping in, Shayna. ♥ @misskaigen We're glad to hear that we did not disappoint, Kaigen! Enjoy shopping all of these super sexy looks! @Jenni_Marie8819 We like how you think, Jenni! We've made sure to share your idea with our team. 🖤 @jocelyne_guzman Shes a doll, isn't she? 😍😍 @_seriana_ You deserve the best, Seri. We thank you for giving us a chance to make it up to you! @LuedkeBrittany Decisions, Decisions! Falls sexiest styles coming in hot, Brittany! 💋 @TeddyHWhiteley These are the cutest, Teddy! We've let our team know you'd like these available to purchase. ❤ @caarytoooo We thank you for giving us the chance to make it up to you, Carolina! @WhoisNatz We will be sure to share your feedback with our warehouse, Natalie. We thank you for bringing this to our attention! @daniiayres We've shared a request to bring back Vanilla Lace! In the meantime, check out our Bare Vanilla Fragrance mist. We know you'll love it! https://t.co/tFuc21u8bJ @charlieemilyann We're sorry to see your pajamas have already ripped, Charlotte! We'd like to help! Please send us a DM with your order number or receipt barcode number, full name, and email address. Thanks! @EdyVillanueva It's here and you don't want to wait to shop this sexy collection! https://t.co/wB7ZH143Tz 🖤 @Chae_butter20 We hate to hear this, Chae! Please DM us more details so we can further assist. TONIGHT’S THE NIGHT: Hit up our Fall Collection Trunk Show—hosted by one of our Angels!—from 6-9pm for light bites, a special offer &amp; an inside look at the new collection! All you need? An Angel Credit Card. Learn more: https://t.co/k5un8v05UD https://t.co/AsRzlP0a8v @ivyxoqueen We're sorry to learn of your concerns, Ivy. As your account information is only accessible by our Angel card services, we kindly ask that you reach back out to them directly at (800) 695-9478 so that your account and concerns can be further reviewed. Thank you. @Veerorita We'd like to speak with you concerning the experience you and your daughter had, Veronica. Please DM us your phone number and the best time to reach you. We look forward to speaking with you. @brittany_boo19 We've made sure to share your request for offers, Britt. Thank you! @ivyxoqueen We want to make sure you're connected with the right associate the first time, Ivy. For all inquiries regarding your Angel Card, please contact our Angel Card Customer Care at (800) 695-9478 (Comenity Bank) Mon-Sat 8am-9pm EST. @_heleali Be sure to check with your local shops directly for product availability, Alisha. Go behind the seams of our most sensual collection in years, available in stores &amp; online today. https://t.co/G3evVEyG8u https://t.co/ZPsvQaqvMd @GirlHimalayas You can view all of our International Store locations at https://t.co/NY8nRkCRU9. @Ash_Tearra You sure can, Ash. Just bring in your invoice. @PillarChef We've sent you a DM, thanks! @kaitlynivvy We'd like to chat about your experience, Kaitlyn. Send over a DM containing more info on the styles in question, and be sure to include your full name + email when reaching out! https://t.co/iePMPVDcBk @2setsOFphatLIPZ See you soon! xo @MdmAnchora For help with your payment, contact us at 1.800.695.1526, Monday-Saturday 8AM-9PM EST. Thanks! @angieecelina Care to share more, Angie? Send us a DM containing the store location + some additional details so that we can ensure follow-up can be conducted. @sweettt_peaa12 Be sure to check your confirmation email for delivery info! If you need any assistance, send us a DM! @SnowyFairest Love this haul! @___FERG_ Since Vanilla Lace has been discontinued, we'll be sure to let our merchants know how much you'd adore for it to return. ❤ @LuedkeBrittany Get ready to fall in love, Brittany! ❤ @alyssagreenwoo2 What's not to love, Alyssa?! ❤ @PBrewsta We hear you, and have passed along this request! @aplusk78 We're sorry for any disappointment, Alex. Fit may vary by style! We'd be happy to assist with a return/exchange. Feel free to DM us if you have any additional Q's! @samanthaauf We hate to hear this, Samantha! We would like to learn more. Please send us a DM with the bar code number from you purchase receipt along with your email address and phone number. We hope to hear from you soon! @hheellookiitty We're concerned, Vanessa. Please send us a DM containing your full name, email, and phone number. We'd like to reach out to you directly! @Angxlica17 Oh no! We would like to learn more, Angelica! Please send us a DM with which bra you have along with your phone number and email address. We hope to hear from you soon! @TheRealLondynK We'd like to connect you with a member of our Angel Card Team to discuss your concerns, Londyn. Send us a DM so that we can get you in touch! @champagnereigns We're concerned! We'd like to learn more. Please DM us with the order number, full name, email address, and full shipping address. Talk to you soon! @JessicaCate2011 We can't wait for you to shop the new collection! You are going to love it 😍 @squidwhud That's what we love to hear! We strive to always provide our customers with a shopping experience that is never shy of perfect! We also believe in providing our associates and store locations with the proper recognition they deserve. Thank you for sharing! ❤ @whereisDae We've shared your valuable feedback with our team for future consideration, Dae! @HaloKiwi We've shared your request with our team, Ash! @iselaV106 We're sorry to learn that your bra has become damaged, Isela! Please DM us your full name, email, and purchase receipt details! The Fall Collection is more than new lingerie—it’s a new beginning. Tomorrow, it’s on. @marlxnyy We'd like to check on this for you, Marleny. Please send us a DM with your full name, order number, email and the shipping address. @denismontecillo You deserve it 😘 @AsiasoSmooth We apologize that you did not receive your package today! We want to help. Please send us a private message with your first / last name, order number, email and billing address. Thank you! @bharris1024 We hate to hear this has happened with your recent bra purchases, Brittany! Please DM us when you can and we'd be happy to further assist. @_bbvygirl_ Snag yours online now! @MarieHaskins No tears, Marie! We have shared your request to bring all the beautiful colors of our Velvet Matte back with our team. We still have the sexy True Red available. Get it now: https://t.co/2tsR97nDQY. @barcelanna We got you, Tammi! We replied to your message. Thanks! @susanauriberios We're sorry that you're having trouble with your order and we'd be happy to help! Please DM the details, including your order number, email and shipping address. @FLMakeupGirl We expect all of our items to last and would like to help, Irene. Please DM us your purchase info (in-store receipt/order #), and your email address. Thank you! @jennaxorlandoxx So glad we could help, Jenna! ❤ @barcelanna We'd be happy to look into this for you, Tammi. Please DM us your order number, first and last name, email and shipping address when you get a chance. @missmills68 Always so much fun shopping with you and your girls, Carol! 💕 Some things are worth waiting for—or in the case of our new collection, ALL the things. Luxury returns on 8.8. @BrittanyHosey We can't have you give up on us, Brittany! Please DM us &amp; include your full name &amp; email address. Thanks! @kindaachels Agreed! The floral scent is mesmerizing, Chelsie. 😍 @hustlababyyy Please DM us so we can share your experience and point you in the right direction for assistance. Thank you. @_monicaaaaa Please send us a DM with more details and we'd be happy to help. @RjRodriguez717 We've shared your interest with our team, Jennifer! Thanks for reaching out! @lacubanagirl We thank you for reaching out to us about your awesome experience and we have shared your feedback with the stores leadership team. We cant wait to shop with you again, Jocelyn! @Tito36Figs We're excited to hear your friend wants to work with our company! You can find our current opportunities online and apply at https://t.co/XpvQrj9Tzr. Best of luck! @murderrmemariah Hi Mariah,\n\nWe are sharing your concern with our HR partners and are needing some additional information. Please reply with your full name. \n\nThank you. @hilenna_ We're so sorry to hear you have not received the help needed, Ana! So we may share your feedback and further assist, please DM us more details. @Galileaxoxo We've been sure to share your feedback with our team! @Scentsy76 We understand that, however, in order for us to access your order we need you to verify the shipping address and email. Please send this information in a direct message. Thanks! @Scentsy76 We hate to hear her gift has still not arrived, Denise. Please DM us the email address and shipping address associate with the order and we'd be happy to further assist. @KhHixson We are concerned with our experience and would like to learn more, Kay! Please send us a Dm with the bar code number from your receipt. We hope to hear from you soon! @NoorAlmuzaffar We're excited to hear you want to work with our company, Noor! You can find our current opportunities online and apply at https://t.co/XpvQrj9Tzr. Best of luck! @Chlobee24 That feeling is the best, Chloe! Enjoy❤ @Hyperslw4Trump We would love to learn more about your reasoning with leaving us. Please send us a DM with more details. Thank you! @DarthShrader12 We have let our team know that you are ready for a store near you to open, Denise. Stay tuned for future updates! Exquisite lace. Sumptuous satin. We’ll leave it there, for now… @annagrigorian_ We've let our team know you'd love to see in a store in Artsakh. Thanks! @MegKaplun Thanks for letting us fix this for you, Megs! @MegKaplun Oh no, Megs! Please DM us your full name, email, mailing address, and order number/receipt barcode number for your purchase! @nycmetal6 Oh no! Can you send us a DM containing a screenshot of the error you're receiving when attempting to login? Be sure to include your full name &amp; registered email when reaching out. Thank you! @smoedordiee We'd like to follow-up! Please send us a DM containing your full name, email, and be sure to let us know if your swim top was purchased in store or online. @_skylerandres We do carry size 34DDD! Check out our gorgeous Dream Angels Demi Bra! Made with soft memory foam to conform to the shape of your body. https://t.co/ScaHrIcE7u @_Mrs_Abd We've made sure to share you request. Please keep in touch! @emmajreyna We're sorry to hear this, Emma! Please send us a DM with your order number/receipt barcode number, full name, and email address. Thanks! @kristen_drives We'd like to help, Kristen. Please send us a DM with your order number, name under the order, and shipping address. Thank you. @jezebelee So sorry for any frustration, Sasha. Please allow up to 10 days to stop receiving our promotional emails. Thank you. @taynicole928 So sorry to hear your slides ripped, Taylor! Please send us a DM with your order number/store receipt barcode number, full name, and email address.  Thanks! @Jnation_4life We love fast deliveries...enjoy your new goodies, Kay! @LexxSlimDreadie We're so sorry, Lexx. Our totes were while supplies last. @Allyelois1111 We hate that this happened, Colleen. Please send us a DM with your full name and the store location. @Kryssie27 We've shared your valuable feedback with our team, Kristen! @dellingerd7 We're sorry to hear that, Dan! If you need further assistance please reach out via DM! @SincerelyKims We have shared your request with our team! @murderrmemariah We are concerned about your experience and would like to learn more, Mariah! Please send us a DM with more details along with your phone number and the best time to reach you. We hope to hear from you soon! @nikiipatell We have shared your love for this fabulous scent with our team! @VSLover5 We have shared your interest in the Love List returning with our team! @x0_alana Noted! We have shared your love for Vanilla Lace with our team ❤ @keepitsimple247 Definitely a favorite, all year long! @babycoyle We'd like to help, Alyssa. Send us a DM containing your order number, email, and shipping address so that we can resolve. @SnowyFairest That's how shopping is done, Elaina! 😎 Enjoy all of your goodies! @e11e_che11e We've let our team know you'd like our Dream Angels Divine to return! Keep in touch. 🖤 @amybrazen We'd like to look into your order, Amy. Please send us a DM with your order number, name under the order, and shipping address. Talk to you soon! @isafloresmelo We cannot wait to shop with you! @savanah__d Who would want to pass up an offer like that, Savanah? 😉 @Flypnotik We can only imagine how frustrating this may be, Michael! We've made sure to let our team know you'd like this available! Please keep in touch for updates. 🖤 @HausOfSpears Enjoy your gorgeous Passport Holder, Nathalie! ❤ @abcranford We are very concerned about your experience and would like to share this with our Quality Assurance Team. Please DM us your purchase information, email address, phone number, and full name so we can help! @sherpeace We've shared your request to bring our Rio Cut Cotton Panties back, Sherrie! As an alternate, try our Stretch Cotton High-leg Bikini Panty! Made with soft cotton for comfort with stretch!  https://t.co/iVdV3kSwTz @shutupisay We assure you, we have shared your request with our team! @KimimeIa Enjoy! 🖤 @shutupisay Your request has been shared! 🖤 @thelavcrown We only want your shopping visits with us to be fun &amp; special, Riley. We hate that this wasn't the case and would like to learn more. Please DM us and elaborate, include the day &amp; time you visited, too. Thank you! @thelavcrown We've made sure to share your feedback with the appropriate team, Riley. We appreciate your comments. @kkstrum So sorry to see one of your sprays arrived leaking, Elisa! Please send us  a DM with your order number, name under the order, and the shipping address. Thanks! @Tatanka13161 We'd like to look into your order, Jorge. Please send us a DM with your order number, name under the order, and shipping address. Thank you. Not all heroes wear capes. Some would rather wear lace. @katieekinzzzz We are happy to share your request with our team for future consideration, Katielyn! @Jessiesloser Yes, on clothing and footwear ($75 or less). @allieg421 Swim is exclusively sold online! Happy shopping😍 @SnowyFairest Shop it all Elaina, you deserve it! ♥ @ZaraMMcGrath We'd like to take a look into this for you, Zara. Please send us a DM with the order number, name on the order, email and the shipping address. Talk with you soon. @cadencegriffinn Vanilla lace is no longer available. Our Bare Vanilla is a new fave. https://t.co/5p4NqE9Mn1 @A_Train722 We're sharing your interest to see these scents returned with our team. @BoeckerAlienna No tears, Alienna! Send us a DM with a picture of the offer code/pin along with your name, email, and phone number. Thanks! @irachelcampbell We're happy to see you're enjoying our Let's Dew This, Rachel! ❤ @Studio20LA Your welcome to check out our offers here: https://t.co/zkTs9P7fZl @TnNailTech Anything for you, Frances. 😉 @McDonaldpAlex You're still welcome to return/exchange, Alexandra! If you no longer have your receipt, you will receive the lowest selling price on a gift card. View details from the link provided! @whitneydeeee We'd like to look into this! Please send us a DM with your full name, email address, and shipping address. Thanks! @delta_gurl We're happy to share your request with our beauty team for future consideration. @xochristalynn You're never stuck with it, Christa. Find out more about making a return here: https://t.co/2ZrwMSLSlq DM us if you need more info! @CamilaMTV Love it! 💋 @JustLetItGLOW1 Glad to help! DM us your full names, billing address, phone number, email and Angel and statuses so we can take a look. @JessiCarolyn_12 We're so sorry for the experience you have had with your order, Jessi. We would like to take a look. Please send us a DM with your full name, order number, email, and complete shipping address. Talk to you soon! ♥ @Stephanieee125 We're sorry to see your package arrived damaged, Stephanie! Please send us a DM with your order number, email address, and complete shipping address. Talk to you soon! @LexusTexas1 You can never go wrong with a gift card... it's always the right size, scent or color! Then stuff it in this glam bag and you're the best brother ever: https://t.co/02Pz6f8zVx @imjustdiane We're sorry to hear that, Diane! We love shopping with you! Please contact Angel Card Customer Care at 1.800.695.9478. Talk to you soon! @IeshaTweets We're here to help! Please send us a DM with your full name, order number, email, and complete shipping address. Thanks! @NikNastay_ We would be happy to take a look, Nycole! Please send us a DM with your full name, order number, email, and complete shipping address. Talk to you soon! @McDonaldpAlex We're here to help, Alexandra! Click here for all of your return/exchange options! ♥ https://t.co/UOP3PK36wn @MonicaLauraHill We hate to hear that your bra has broken, Monica! We would like to learn more so we can help. Please send us  a DM with more details along if the bra was purchased in store or online. We hope to hear from you soon! @_sarahnoto We have shared your love for Intense with our team, Sarah! 5-word horror story: “Can’t find my bikini bottoms.” @twentyfivebux We only want your shopping experience to be one of fun &amp; excitement, Simone! And, we're here to help! Please DM us your receipt info &amp; your mailing address. Thanks! @zombiesgorawrzz We ❤ that your pup loves our panties too! Great news you can replace them w/ these fun 5/28.50 styles: https://t.co/Q5oWpkQ4TS @EmmyJ37 Thanks for shopping with us, Emma! Enjoy! 💋 @andyshrestha We'd like to learn more, Andy. Please send us a DM  with the the store location. Thank you. @TiasInterlude A true fave! @lilcoconut08 We hate that we disappointed you, Kristen. Please send us a DM with your full name, email address and receipt details. We'd like to see what we can do. The best way to celebrate International Day of Friendship? Matching pajamas for you and your bestie. @newtonvicki You're welcome, Vicki! Thanks for sharing your experience with us😍 @mani48163063 We would like the opportunity to speak with you directly about your experience, Mani! Please DM us your name, phone number and the store location. We look forward to your message! @lavvendermoon Music to our ears, Claire😍 @THE_ROGUE_VIXEN We hate to see that your package arrived in this condition! We would be happy to help. Please just send us your online order number, full name, shipping address, email address and phone number. We hope to hear from you soon! @GingerSalfarlie We would like to learn more about your experience, Ginger! Please send us a DM with which store location you visited along with more details. We hope to hear from you soon! @NotEcons Please send us a DM with more details so we can help. Thank you! @glammzmore We hope you love some of the new styles, Erica! @_Liyy We let our beauty team know that you would like to see our Midnight Ivy scent return, Tiannie! @blaccdmnd 😘😘 @LorrieLife We can get you fitted in store for free to ensure you receive the best service. Keep in mind that you can also take the bra fit quiz online! @GoTeamAndersons We are so glad to hear! We look forward to shopping with you again soon. There’s no such thing as too much vacation…right? @NicoleS97282319 We only want your shopping experience to be one of fun &amp; relaxation, Nicole. We hate that this was not the case and would like to help. Please DM us and tell us the day &amp; time you visited us and your mailing address. TY @snapshotbae97 We understand the feeling❤ @ThickNJoocee Enjoy your new goodies ❤ @sasimariposabee We always love seeing you ❤ @garcly We would like to learn more about your service experience! Please send us a DM with more details so we can further assist. Thank you! @aisling_byrne__ Oh no! We would be happy to help, Aisling! Please send us a DM with the bar code number from your receipt so we can share your experience with the store leaders. We hope to hear from you soon! @jeniffermariexo Enjoy your cozy new blanket❤ @EmilyLomas1987 We love shopping with you ❤ @rcb35 Thanks for shopping, Rachael! @SimiStar15 Sorry to see this happened with your t-shirt, Simran! Send us DM with more information on the bra, so we can be sure to share your feedback and further assist. @fable46 We're so sorry about this, Liz! We've resent this over to the team needed and requested a call back. Kindly allow 24 hours. @loveyourselfBTS We invite you to check out our Warm and Cozy mist, Harley. We hope you love it! @ToriTooPretty We are so very sorry to hear about your bra's, Toriella. We always want you to be happy with your purchase and we invite you to return / exchange them in store. We will see you there! @Cmills80 We are so sorry to hear of the experience you've had with our chat and phone associates, Crystal! Please DM us more details so we can further assist and share your feedback as well. @GracexoCouture We'll share your request, Grace! Have you tried our new oil to cream body wash!? It's amazing and comes in our perfume fragrances. Check it out when you get a chance at https://t.co/dAw73M8h5s. @hannahturch We can still look it up for you, Hannah! Just send us a DM with your full name, email address, phone number and shipping address. @hannahturch Please DM us your order number, email and shipping address and we'd be happy to help, Hannah! @hannahturch We are so sorry to hear this, Hann. We have shared your feedback with our quality assurance team and we invite you in store for a return and or exchange. We look forward to assisting you further! Summer nights are made for: @LilyColeWorld So sorry for any disappointment, Lily! Typically this happens when a return is made without a receipt or after 90 days. Please DM us more details and we'd be happy to help! @TheNorseEmpress There is so much cute to spend it on too, Sarah! @Nae924Nae We hate to hear this, Maria! Please DM us more information, so we can share your feedback and further assist! @daliiiis_ We're sorry for any frustration with your recent order! So we may share your feedback and further assist, please DM us your order number, first and last name, email address and shipping address. @MeganPooran Oh no! Please send us a DM with your purchase details and email address so we can help, Megan. @AnonaRose Thanks for shopping with us, Rose! @HoosierMommy3 We've let our team know you'd love to see it come back, Laurie! @Ty_malaya We are concerned about your experience and we would like to speak with you further, Tyrea. Please send us a private message with more details, your phone number and best time for contact. Thank you so much. @samanthamc21 We've let our team know you love our sport line, Samantha! Our new Lifestyle Collection will be coming soon and does include sport bra styles and a tight! @MonicaLaurenHil We LOVE lace! @badgalmimi07 Swim is back, Mimi! Shop here: https://t.co/BKOWwpJTZC @Sarah09198834 For all concerns regarding your Angel Card, please call Angel Card Customer Care at (800) 695-9478 (Comenity Bank). We look forward to speaking with you soon, Sarah! There's no bad time for lace. @stormerpathos So sorry to hear your package didn't arrive as expected and for the experience you've had trying to resolve this. Please DM us your order number, first &amp; last name, email and shipping address. @_rianadarline We do have lotions without the shimmer! Shop our lotions and body creams at https://t.co/KZ40ytHjnp. @MizzTwist009 We hate to hear an item was missing, Ursula.  We'd like to help. Please send us a DM with your order number, email, full name and shipping address. Thank you. @KaceyTreksOn We want to make sure you're connected with the right associate the first time, Kacey. For all inquiries regarding your points on your Angel Card, please contact our Angel Card Customer Care at (800) 695-9478 (Comenity Bank) Mon-Sat 8am-9pm EST. @Gmac2908 We have some great offers going on today that you do not want the missus to miss out on, Gary! Follow the link to see what you can add to your shopping bag! https://t.co/kNWI7yJ9Qf @TheMuggleTrap We'll let our beauty team know you'd love to see the VS Night fragrance return! ❤ @CecePhillipss So sorry to hear your package was damaged and this is what you received, Cece! Please DM us your order number, first and last name, email and shipping address so we can further assist! @ptvmargo_ Lot's of great deals going on, Margo! Stop by and see us or shop online at https://t.co/t2tqu0YKi5. @j0ren So sorry for the frustration this has caused, Joren! So we can share your feedback, please DM us the store location when you get a chance. @jayleofresh You deserve it all, Jay! @aaavalise We're happy to share your request with our beauty team for future consideration! @fable46 We apologize for any inconvenience. Please send us a private message with your phone number, best time to call, and email address so we can have someone reach out to you directly. Thank you! A little strappy. *Very* strappy. Where do you draw the line? @pinkprius1 We are happy to share your request with our team for future consideration, Margaret! @fable46 Since this is involving your account, please call our store relations line at 1-614-577-7111 for further assistance. @datingagain30s You deserve to treat yourself, Adele! We hope you enjoy your purchase♥ @kenzieeerector Great choice😉 @fable46 We're so sorry to hear this has happened, Liz. Please send us a DM with the order details, the name on the order, email and shipping address. We'd like to check into this. @_jessicaelena This is no joking matter. Please send us a DM with your full name and email address, Jessica. Thank you. @desireeheadley We're happy to share your interest for these sizes with our team, Desiree. @itsamiracle13 We're happy to assist, Abby. Please send us a DM with your full name and address. Talk with you soon. @azzyyyyyyyy We've let our team know that you'd love to see Dark Orchid return, Azzy! If you loved this warm and sexy fragrance, give Tease a try here: https://t.co/KaOdnhYQQI \n\nWe can't wait to help you find your new signature scent! @mmaannddii620 We'd be happy to share your request with our team, Summer! @fvshionfetish We so appreciate you sharing the love! 99% humidity. What’s your hair strategy? @Jemma__L Such a cute and comfy hoodie pick, Jemma! As store inventory varies and is constantly changing, we kindly ask that you check with the store directly for availability. Thank you! https://t.co/wGFE51nqVg @NonchalantMooch We're sorry to hear that this lip plumper did not meet your expectations. Please send us a DM with your full name, email and any purchase details that you have available. Thank you. @Charlenearcher3 We're so sorry for your disappointment, Charlene. We've shared your experience with our team. @madisonsnell We love the way you shop, Madison! Enjoy! 💋 @Fit_not_Skinny Sport isn't going anywhere, Alison! ;) @NomadicMuva Enjoy all of your new goodies, Chelsea! ♥ @demonicaz1 We will let our team know you would love to see your favorites return! ♥ @SkylarSkywalker We apologize for any disappointment caused and we will be sure to share your feedback, Skylar. We appreciate your comments. @SCHOENAMYYY We're glad that we were able to get you fitted and we hope you're comfortable! @JoshuaVeracruz2 Thank you for bringing this to our attention. We are working to get to the bottom of this immediately. @JoeLetsPlay Thank you for bringing this to our attention. We are working to get to the bottom of this immediately. @ThassKen We've let our team know you'd love to see our 10/$35 panty offer again soon! @CheryDooWop No worries, Chery-Anne! More great deals are on the way. Stay tuned for updates! ❤️ @el_duq01 We've been sure to share your feedback with our team regarding last nights flash sale, Elle. @A113Jessic We'd like to learn more, Jessica. Please DM us with more details! @kiwi87733 We'd like to learn more! Please DM us with your purchase details (store receipt barcode number/order number), your full name, email address, and full shipping address. Talk to you soon! @RoechelleFoley We love hearing from our fans and appreciate your feedback on packaging, Roechelle! We've shared your comments with our team! @JoshuaVeracruz2 We would like to learn more. Please Direct Message us with the store location, date and time of the visit. Thank you! @MariePUGINIER We are so very sorry for any disappointment with the packaging of your order and we will be sure to share your feedback with our distribution team directly, Marie! We thank you for reaching out to us and we hope you love what you ordered. @LuvBrandiiiiii We'd like to learn more, Brandi, and are so sorry to hear of your disappointing experiences.   Can you please send us a DM with details of your experience, and please also include when you both shopped and called us, as well as your phone number and email address. @justa_coolchic Definitely a keeper, Gina! Loving your new collection! @natt_hp Our new Brazilian Panty style is a must, Natalia! Shop with you soon! https://t.co/wKweyOJZnK @JoshuaVeracruz2 We'd like to hear more.  Please send us a DM with store details, your first and last name, as well as your phone number and the best time to reach you by phone. Fill in the blank: the best thing about loving a Leo is _______ @ahngelahh We're sorry for any frustration, Angela!  Please DM us your order number, email address, first and last name, and shipping address on the order!  Please also include the shipping address that you would need your backorder shipped to, as well. We'd love to take a look! @jazmine_quigley We're sorry for the frustration and are glad to take a look, Jazmine! Please send us a DM with your order number, email address, first and last name on the order, shipping address, and a couple of the items you picked up when you shopped! @kenyvmichelle We're happy to see how we can help, Kenya! Please DM us details (including your offer code), and the items you're purchasing!  We're glad to see how we can assist! @aquarius873 We're happy to hear that you were able to complete your order, Christine. We'd like to help &amp; ask that you please DM us your order #, full name &amp; email associated with your order, and a summary of the items you ordered. Thanks! @_kcbm_ No tears, Kim! DM us so we can bring a smile to your face. Thanks! @ShocolaateGirl The sale was everything, Cristina. Please DM us so we can help. TY @stanhiscurls We're here for you, Kayla! Please DM us, so we can help. Thanks! @hey_bethanyrae We're replied to your DM, talk to you soon, Bethany! @BuckvichMolly We'd like to help, Molly! Please DM us &amp; we'll get you shopping. Thanks! 💕 @YellowMusic92 We know our sale was everything and we'd like to help. Please DM us and we'll point you in the right direction. Thanks! xoxo @ambiguously_bg We only want to see your smile, Brittney! If you weren't able to place your order, please DM us, so we can help. Thanks! @Sim1de Thank you for your patience! Enjoy your new backpack! ♥ @Cortneisays We're sorry for the frustration we have caused. We would love to help! Please send us a DM with your full name, order number, email, and shipping address. Talk to you soon! @karynnnxo We're here to help, Karyn! Please send us a DM with your full name, email, shipping address, and order number if available. Talk to you soon! @ohheyhann Nothing like a Panty Party, Hannah! Enjoy! ♥ @Allaboutnia_ Thanks for your patience, Nia! Enjoy! 💋 @Whitewolf05 We're so sorry, Jessica! Stay tuned to our site for offer updates! ♥ @LianMckernan We are sorry for the frustration, Lian! We love shopping with you so we're working on it as fast as possible! Stay tuned to the site for offer updates! ♥ @jackiereed6 We're trying to resolve this now, Jackie! Thanks for your patience! @MeeraNicole We're working on this now! @MissAnderson_26 You will be able to place it now. Happy shopping! @CharylD1522 Our Team is working hard so we can shop with you, Charyl! Stay with us! @LovelyTiff_ We're on it, Tiffany! Try us again soon! ♥ @lifeofjaneeee The issue is fixed and we are so sorry for any inconvenience, Jane. Shop now! @taylor_rose7 We'd love to help with your order, Taylor! Please DM us your name, order number, email and shipping address. Thanks! @iamFrankieBlair Keep trying, Frankie! We're working on it now! @Shumuriel_TV Stay tuned to our site for updates, Shumuriel! @KCates96 We're working on our site now! Stick with it , Kayla! @kenydee_cynthia Working on it now, Kenydee! Don't give up! 💋 @amanduhhhh425 We're working on it right now, Amanda! Keep trying! ♥ @Justmari199 We're sorry, Mariana. We're working on the site now! @thatbomblagirl We're sorry for the longer than normal wait! Keep trying! @bautp51 We apologize that the offers are being kicked from your cart, Patricia. We have shared your feedback with our team and we invite you to keep trying! @sweet_SYDNEY Keep trying, Sydney! You don't want to miss this! @lalauren18 We are so very sorry, Lauren. We encourage you to keep trying and we appreciate your patience! @Mel629_ We're on it, Mel! Keep trying! ♥ @KristenMaizon We are so sorry this is happening, Kristen! Which code are you trying to use? @validatemepleaz You sure can, Abigail. Shop the fragrance in store or online! @AnnetteLawless Sorry for the wait, Annette! Please DM us your daytime telephone number so we may confirm our records! @dbjxtnf We're concerned! Please let us know how we may support you via DM! @dear_tinarose We're sorry to hear that! DM us your full name, email, mailing address, and order number/receipt barcode number for your purchase! @gtaughtyou We'd like to get a better understanding of your size &amp; fit concern! Send us a DM when you get a chance! @xGamer_GirlXx We're here to help! Please DM us your full name, email, order number, and mailing address so we may take a look! @2016tinkerbell We'd like to hear more about your experience, Nikkie! DM us additional details! @BreezeLovin1127 😘💋 @AntiFleek We're excited to hear you want to work with our company! You can find our current opportunities online and apply at https://t.co/XpvQrj9Tzr. Best of luck! @erica4627 We're sorry for the frustration. Can you please send us a DM? @shalyssamarie We'll share that you'd love more options in these, Alyssa! Make a statement without saying a word. #lingeriegoals @daliiiis_ We're sorry for the frustration with your order!  We'd like to share your feedback on your shipment but we need more information.  Can you please DM your order number, email address, first and last name on the order, and shipping address! @RosieNicholls Music to our ears, Rosie! Thanks for sharing😍 @ruth_enium We're so very sorry to hear this, Ruth!  Please send us a DM with your receipt information (long # under the barcode), email address, and billing address!  We'd like to see how we can help! @Jovita1969 We'd like to speak with you, Jovita! Please DM your purchase information, a photo of the inside tag of your bra, email address, phone number, and the best time to reach you. Or you can reach out at (855) 866-5810 option 9, option 3 at your convenience! @CypheredClaire We're sorry it's frustrating!  We can help you with your bra strap in your nearest store, though! @DrKRR2 We'd like to speak with you, Kristie!  Please send us a DM with a photo of the inside tag of your bra, date/location of purchase, your phone number, and email address. Please also include a good time to reach you! Or you can reach out at (855) 866-5810, option 9, option 3. @MissBunny1998 You deserve to treat yourself😉 @stevenmgroves We're happy to share your request with our team for future consideration, Steven! @taylor_buehrle Yesssss Taylor, yessss! We love it! @sadeswilliams Sexy choice, Sade! 🔥 @AmandaMcLean We will be sure to add these comments to your experience, Amanda. @OfficialSuzyB So glad to be there when you need us, Suzy! 😘 @Kc7vwc Thanks! Stop in anytime, @TastyPCTV we'd love to help you find your new favorite workout bra! https://t.co/wGFE51F2jQ ♥ @justsay_kay We've let our team know you'd love to see Midnight Ivy return! @BqueenRasta We hope you love your picks! 😘 @MrsClooney32 We're happy to review and update your marketing email frequency. Please DM us your full name and email address! @_suhvanuh_ We'd be happy to check on it for you, Savannah! Please DM us your order number, email and shipping address! @AmandaMcLean We hate to hear this, Amanda! We've shared your feedback with our team! @erikatorres111 So sorry for any confusion, Erika! We do ship to APO addresses, however, you need to shop from our International site to be able to change your location. You can do this at https://t.co/hG7ZcbZ9k4. @CierraRose_01 Be sure you have the most updated version of the app, Cierra! Also, try shopping from Firefox or Chrome. Our site works best using these. Wide eyes. Full carts. Can’t lose.🛍️ @hanner_bananer1 So sorry for the experience you had at this location, Hannah! We assure your feedback has been shared with the stores leadership team. @Chanaynaayy Thanks for shopping, Chanel! ❤ @prettyandtall We think you need the Lace Trim Kimono, Mani! @WheezyNurse We are loving the prints you picked out! @sadeswilliams Weekend shopping trip = successful! @ShanPir Enjoy your new arrivals! @Cuppiecake_Kris We hate to see that your reward was missing upon arrival, Kris! DM us your Angel Card status, full name, &amp; email so that we can help. @ChariseJeanine Because it's that good! 🙌 @DAL3JR88FAN Thanks for the love on this retired fragrance, Jen! @lovemeganlayne Thanks for your feeedback, Megan! We'll pass along these comments to our fulfillment teams. @SparkleSan7043 We're sorry for the frustration with our app and assure you that we're sharing with the proper team! @_ohheyrenee We love the way you think! @kittenunicorns DM us details Kitty, we'd love to know which location you visited so we can share! @AlisonWU19 Don't be mad Alison, you're so worth the splurge! @kateb594 Noted! @kateb594 We will let our Beauty Team know you would love to see Afterparty Angel return, Kate! 💋 @GrandesSuperior We know you're going to love Cake Confetti, Alex! @annaberube You know we love a panty party, Anna. Keep checking back with us! @_sassshley We are so very sorry for the delay and we assure you that your package will arrive by the date indicated. We appreciate your patience and we hope you love what you ordered! @NCollington_ We apologize that the rhinestones are peeling from your garment, Nicole. We want to see what we can do to help! Please send us a private message with more details, your email and billing address. Thank you so much! @MsLadyAB We are concerned about your experience and we want to help! Please send us a private message with more details and your email. Thank you so much. @Shaaiiaann14 We're so sorry to hear this about your new bra! Please send us a DM with receipt details, your full name, email address, and phone number so we can assist further! @xkatielizabeth Definitely go for it, Katie! Always gotta be feeling yourself! 😉 @simaralynn So sorry to see this and we'd like to speak with you further, Simara. Please send us a DM with purchase info, full name, and email address. TY! @mommiana_3x You're missing out and def need to try them, Cassie! They are on sale too! Shop now at https://t.co/g1TLl7m8CK. @ajanderson81 Oh no! Please DM us your order #, first &amp; last name and the shipping address and we'd be happy to help get you your order! @Educated517 Have fun shopping! @TiffBilliard_ With the amazing options to choose from this season - we can't wait to see which one you add to your shopping bag! @merlotsass Stock up on all your faves before they're gone! @mjs4reelzwife So sorry for any disappointment, Kacey. We've shared your feedback and request with our team. @redbone4 You could say that again! 😍 Sounds divine! @teffetteller Anything is possible, Kristie! Be sure to stick around! 💄 @awhlehksis Thanks for the tip, Lex! Enjoy your new Loungin' Bras! @noellepwilson Sounds like your shopping trip was a total blast, Noelle! @LilmisReba Sorry, we're not sure what you mean. Need help? Send us a DM with more details! @_daanyelleee We're sorry you're missing 1 panty, Danny! We'd love to help! Please DM us your name, order number, email and shipping address. Thanks! @fatima_toffar Thanks for thinking of us! When less is more, but you can’t get enough. https://t.co/1xJLFiBHzN https://t.co/CNXFOI1Rmo @natecammom We're sorry to hear this, Sara! Please DM us your full name, email, mailing address, and the receipt barcode number for your bra purchase. @HKD2018 Fragrances are discontinued for a variety of reasons, Helen. We're sorry for any disappointment! Fans who miss Intense share that our Very Sexy Eau de Parfum makes a great alternate! Check it out: https://t.co/wMTS3yROea ❤ @mike_g_campbell We’d like to address your concern with more information, Mike. Please DM us contact details (name, phone number, and email) so that we can reach out. @sarahJanewrob ❤❤ @AnnetteLawless We'd like the opportunity to address your concerns, Annette. Just send a DM our way containing your phone number &amp; email so that we can connect with you. @Paynefr For assistance with your order, please send us a DM containing your full name, order number, and email. Be sure to also let us know what items were missing from your package! @CiiCii1994 Some things, just have to come home with you! @Rey_Solo_333 Thanks for your loyalty! We love shopping with you, Rey! 💋 @Ariana39x It is not, Ariana. @jjanis47 So sorry to hear your package was delivered to the wrong address and you haven't received your refund yet, Janessa. Please DM us your order number, email and shipping address so we may further assist. @MarbunWidya Lace is a must-have, Widya! @FineAssShanna We will be sure to share you'd love to see size XL be offered in our PINK panties💕 @Alexizarod13 We will share your request with our Team, Alexander! ♥ @MelanieTAP No news yet, Melanie! We have shared your request with our Merchandising Team. Stay tuned! @arlornothing We couldn't agree more, Arlette! ❤ @k_hills96 We'd like to learn more! Please DM us with your purchase details, full name, email address, and full mailing address. Also any additional details. TY! @SunJunkie8 We're sorry your order didn't ship as quickly as you'd expected, Theresa. We appreciate your feedback and will be sure to share with our fulfillment teams. @exhaleexo Well done! Enjoy your haul! 💋 @foxyinflipflops We've let our team know you'd like to see your fave return, Michelle! @Kelli_Lynn14 We've let the team know you'd love to see Night return, Kelli! @nunomaay We would like to learn more about your experience, Mayra. Please DM us your full name, email, order number, and  mailing address. @Lenababyxo This is true, Lena! Shop soon ❤ @yobaybeehyo Need to get in touch with our Angel Card Team? Dial 1.800.695.1526, Monday-Saturday 8AM-9PM EST for assistance. Thanks! @tceskies Need help with your orders? We're here for you! Send us a DM containing your full name, order number#'s, and shipping address so that we can take a closer look! @brattieeb We shared with our team, Elisa! 😉 @rays_of_myth Thanks for shopping with us, Amy! So glad to hear you had an amazing visit! We'll be sure to let Jo's leaders know what a fab job she did! ❤ Bold straps or delicate lace? @AlexaBennaim Now this is what we love to hear, Alexa! We will be sure to share your experience with our leaders. Thanks for sharing😍 @LindseyLaznicka We are happy to share with our team you'd love to see more size options within our brand💞 @_jesspa We are happy to share your request with our beauty team😍 @intr0vertedtris We're happy to share with our team you'd love to see more size options offered within our assortment♥ @mrsuygur Oh, no Deniz! Please send us a private message with how we can help with your order, and also provide the full name for the order, email, order number, and shipping address. Thank you! @NeliaVateva We hate to hear there was an issue with your order, Nelia. Please send us a DM with the name on the orders, email and the shipping address. @a1mighty_nay We're sharing you're interest to see it return with our team. @_Rad_Cat_ We're sorry this happened. Please send us a DM with the store location and your full name. @Annyeliriss That's what we love to hear! Enjoy, Annyeliriss! ♥ @jskibs98 Noted! 😉 @boydkelly We are so sorry that you have been receiving unwanted emails from us, Boyd. We are more than happy to fix this! Please send us a private message with your email so we may assist you further. Thank you so much! @JournieMatthew1 We cannot wait for you to receive your orders, Journie. We appreciate your patience and we hope you love whats on the way! @_amarie_5_ We wish you best of luck, Ariann! @lotusbeautyx We are concerned about your experience and we would like to speak with you directly, Liz. Please send us a private message with your phone number and best time for contact. Thank you. @Dina_h_allam We'd like to learn more about your experience, Dina! Please Private Message us, when you get a chance. Thanks! @justlissa007 We hope so to, Lissa! @JessicaMcCraw3 We apologize for any disappointment in our store stock availability, Jessica. We will be sure to share your feedback with our store partners and we thank you for reaching out to us! @KimberlyRuizz_ We love it, Kimberly! ❤ @drxwdarkness Yes! Such an amazing scent😍 @ChandraJonae We're happy to share your request with our team for future consideration, Chandra! In the meantime check out our Punchy Blooms https://t.co/DyiBcThUbT. @DarthShrader12 Stay tuned, Denise! We have let our team know you are looking for more information! @EliaaJuliette Oh no! We would be happy to take a look at your order, Eliaa! Please send us a DM with your order number, email address, phone number and shipping address. We hope to hear from you soon! @NotAKatfish We have shared your love for Noir Tease Temptations with our team! @golden_nena Thanks for your patience, Madeline! Enjoy! ♥ @macybmartinez We would be happy to help! Please send us a DM with your full name, email, and shipping address. We look forward to hearing from you! @clariizuniga Keep trying, Clari! We appreciate your patience! @MariWasTaken The site should be up and running, Maria. Shop now! @indylana We're here to help! Please DM us your name, email, phone number and the name of an item within your order. Thanks! @msamandajoneskc We're sorry to hear about your recent call, Amanda! Please DM us - we'd love to share your feedback and assist further! @macybmartinez We're sorry for any disappointment! Please try your order again soon - we've extended the sale to 11pm EST! @brandyjenkins We know you're excited for the sale, Brandy! Please try your order again - the offers have been extended to 11pm EST! @sholehrezaee We know you're looking forward to the deals, Sholeh! Please try again - the sale has been extended to 11pm EST! @lalauren18 We're working on it, Lauren! Keep trying! ♥ @ZoeGM We know you are excited to shop! The sale has been extended to 11pm EST, Zoe! @90sGold____ The sale has been extended to 11pm EST! Shop asap! @NolaDarling718 Thanks for shopping our sale, Nola! Enjoy! 💋 @MegCarneyy The website is back up! Start shopping these sexy deals now, Meg! @asianbeauty713 We know you are excited to shop, Sarah! The sale has been extended to 11pm EST and the website is up! @Mary_E27 The sale has been extended to 11pm EST! Shop now, M! @1MsMackey Thanks for your patience! Enjoy! 💋 @Johns1Ann We're extending the sale till 11PM EST, Bailey! Let's try this again! ;) @EnforcerX19 We know you are excited to shop! The sale has been extended to 11pm EST! @MariR29 We know you are excited to shop, Marisol! The sale has been extended to 11pm EST. @lilypaolab We love shopping with you! We have extended the sale until 11PM EST. Enjoy! @cristen55n So glad we could help, Cristen! Thanks for shopping our sale ! @Danielita_kat Our sale has been extended till 11PM EST, Danyela. Please try again! ♥ @babygirlltaty The sale has been extended for an additional hour and the website is back up. We are so sorry for any inconvenience! @KillaMinilla The website is back up and the offers are still valid. Shop now! @rachasaru5 It should be loading now, Rachel. Keep trying! @1MsMackey We are so excited to shop with you! Try again, Valerie! ♥ @305Pirate Sorry for the trouble! Try again, the offer will be valid until 11PM EST. Thanks! @anxiyz We're sorry for the trouble you've had shopping our sale! We have extended the offer through 11PM EST, Anna. We are excited to shop with you! @leelo82 Take advantage of these deals now. The website is back up! @Mrs_KTYates We love shopping with you, Katie! Please give us a call at 1.800.411.5116 so we can help! ♥ @dbreallife We'd like to learn more. Please send us a DM with your full name and email address. Thank you! @wonderwoman001 It should be up and running now, Melissa! @cristen55n Please send us a DM with the error message you're receiving and the items being ordered so we can take a closer look. Thank you, Cristen! @EnforcerX19 Please give it another go! @Marissahasseman Please give it another try, Riss! @msm_fish Please try again, Maria. @strwbrrydanish We're up and running, Dana. Give it another try! @addicted2dom Please give it another try, Dominiquea! @eseraldapinky Try back soon! ♥ @ZoeyR87 Give it another try soon, Zoey! @Danielita_kat We ask that you give it another try, Danyela! We appreciate your patience. @WWEDanniKing Please try again soon, Danielle! @Jenzyxoxo We are working to get it fixed asap. We thank you for your patience! @JaclynFinger Give it another try, Jaclyn. @burgandyspice Please give it another try! @Princess_talyia More great deals will be on the way soon! @madsclaira We are loving this look too, Mads. Enjoy shopping the collection! @Sof_Resendiz We are so glad you think so, Sofía! @n_mvrie We will let our team know you'd love to see Night return. In the meantime try our Very Sexy fragrance as an alternate: https://t.co/9oKqSFtToW @MumblingNiggler We are happy to share your request with our team for future consideration♥ It feels a lot less like a Monday when you’re wearing satin underneath. @f_mustika_mitta We are too, Mitta😍 @sswade27 We are happy to share your request with our team for future consideration, Shelley! @MirraM7md 👄 @BratzDoll56 One to wear, one to wash, &amp; one to rest is our mantra! 😉 @TheRealDealEz We hear ya! @LATSeema We hate to bother! If you'd like to update your email frequency, just send us a DM with your full name + email address. @queent_31 Our Slides are currently offered in the following size range: S (5/6), M (7/8), L (9/10). Thanks for letting us know of what you'd like to see make a comeback! @emjayy033 We just want you to have the best, Emjay! 😉 @lisajax71 We love to hear this, Lisa! We've made sure to share your comments with our Store Leadership Team! ❤ @RakoWako You know that we're always working to improve product offerings, Rachel. Thanks for letting us know what you wanna see! @l_bIood ❤❤ @LaurenCulley21 Hi, Lauren! Please send us a DM with a picture of your store barcode receipt number, full name, email address, and phone number. Talk to you soon! @PatsGirl86 We love to hear this, Lene! We've shared your love to our team! ❤ @imKhyara Thanks for your feedback regarding our shopping bag functionality! @BreezSkn We'd be happy to assist with your concern. Please send us a DM containing additional details regarding the refund in question so that we may advise. Thanks! @GrandesSuperior What a stunning collection, Alex! Thanks for sharing! @GoldenShimmer Check with your local store, Louise! @danielaro96 We can definitely pass this along for you! @4girl1der We appreciate your feedback about our website, Billie. We assure you that your feedback is very important to us and it has been shared with the proper teams. Thank you again for reaching out. @thekingkuhn Oh no! We're sorry to hear that you're unable to access our website, Tyler. Can you send us a DM to let us know the error message you're receiving and devices and browsers being used? We look forward to hearing from you! @DianaMyna We're loving your style, My Linh! @GrandesSuperior Score, Alex! Enjoy! @emshart1 Oh no! We're sorry to hear that you're having trouble with the color of your new items, Emma. Please send us a DM with your purchase details and contact information so we can help. Thank you! @stefy17x We're obsessed, too, Stefy! @Kittyrose_6 We miss Vanilla Lace, too, Katie! Your request has been shared with our team. Give our Bare Vanilla a try here: https://t.co/vlagMtaYd3 @jessicacrown We never want to upset you, Jessica! We've shared your request for your fave with our team. @_saaamB We're delighted to hear of your love for this comfort! Have you stocked-up? Now's the time while select styles are 7/$28.50! https://t.co/EnQ4uBnwgM @ChillCookie25_8 Happy early birthday! @pe_ng_ui_n We hate to hear this! Please DM us more details so we can be sure to share you feedback with our team! @littlelizlucy We have it in a bright cherry red, Liz! Shop now at https://t.co/zWMv8afvo6. @emiliaberry1 We recommend partnering with the location directly, Emilia! @varney19 Items are available while supplies last, Emma!  We're glad to share you'd love to see Just a Kiss back in your stores. @LaReenaeHall Oh no!  We're sorry to hear this, LaReenae! Please send us a DM with your order number, name on the order, email address, and shipping address! @aw055 Thanks for shopping our sale, Abby! Enjoy! 💋 @kndeaton Regardless, we hope you have a wonderful vacation, Kayla! @XoMsKei We always want you to get a good deal, Kei Kei! @deemirdita We will be sure to share your thoughts with the team, Diana. We thank you for reaching out to us! @KeepItSimpleLL Enjoy shopping with your reward! @tiialiia We hope you love your new items, Tia! @SpenserSherman We can help you here, Spens! Please feel free to send us a DM with more details, email and your billing address. We look forward to receiving your message! @erin_adelle13 We are so very sorry that you were not properly assisted and we want to fix this, Erin. Please send us a private message with more details, your email and billing address. Thanks so much! @jleehernandez We are so very sorry that we do not yet accept Samsung Pay, Jamie Lee. We will be sure to share your feedback with our store partners and we apologize again for any inconvenience this may cause. We thank you for bringing this to our attention! @westupjossss No worries! You can shop the 7/$28.50 now: https://t.co/EnQ4uBnwgM. @Kimxstef We'd like to take a look, Kim. Please DM us the full name, shipping address, email, and a brief summary of the items you ordered. Thanks! @laurenilissa13 Ooops! We're so embarrassed we forgot to mention the deal is 10/$45, Lauren. Thanks! 😘 @yazzybaby77 Let's find your order! DM us your order #, full name &amp; shipping address, and a brief summary of the items you ordered. Thanks! @laurenilissa13 How could it be a party if we didn't include our Canadian stores, Lauren? Happy shopping. @ohsweetjune We're thrilled that you've finally shopped with us and so happy! xoxo @LeonieKatalin We're here to help, Léonie! Please DM us your order #, and the full name &amp; email address associated with the order. Thanks! @devvonwd We're loving that Olivia gave you the service you deserve, Dev, but hate that your Vanilla spray was missing from your bag. Please DM us your receipt info, your full name &amp; mailing address. TY @1iremdemirci We would like to learn more! Please DM us your receipt info and your full name, phone number, and mailing address. Thank you. @CcrystalRrosee Won't be long now! 💋 @nicolyravioli Thanks for shopping with us, Nicole! Enjoy all of your new panty styles! ♥ @RBolling84 Sorry for the confusion as our site updates, Rebecca. Stay tuned! @Jayna219 We will let our Beauty Team know you would love to see Midnight Mimosa return, Jayna! @MrsLtSeveride We're sorry to hear about your experience, Jessica. We would like to learn more. Please send us a DM with the store location, your full name, and email. Talk to you soon! @ashleyy1294 We appreciate your feedback concerning our panty collections, Ashley. We will share your concern with our Design Team. Thanks for reaching out! @FloresAnastasha We will let our Team know you would love to see additional size options in our PINK Collection, Tasha! ♥ @samoora04 Thanks for shopping our sale! Enjoy all of your goodies! 💋 @lyndsiharrison We're sorry that you're having trouble, Lyndsi! Try un-installing &amp; re-downloading which will allow you to sign in again. This should fix any problems! Send us a DM if you need more help. @wecameascrowns You're worth it! @authenticadri Thanks for requesting this retired line, Ashley. Our Sweet Fix Collection will be your new obsession! https://t.co/IxuQCfqAAZ @Morgsss21 Time to spread the word! Get caught up in the details. The Fall Preview is on: https://t.co/wFc1KNDIfC https://t.co/cPm7S22Jd3 @MiamiBiancaxo We're happy to review your marketing email frequency! Please DM us your full name, email, and mailing address. @OliverQueen4587 We love the Dream Angels Collection and you can't go wrong with any of the leggings from our PINK Collection, Oliver! Be sure to check with the store directly on availability of specific items and sizes. They should have both though! @BeAutyFulSavag3 We're so excited for you to receive your haul! 😍 @Vikkisouva So sorry you were not given back the bag with your receipt, Vikki! Please send us a private message so we can further assist with the items you are needing to return. @kronwalled55 This offer was available in store and online on 7/10. However, we have extended the offer for today but online only! 💕 @OliverQueen4587 We do have more lingerie, however, some items are size xs-xl, Oliver. Shop Lingerie at https://t.co/q9uRRfHXsv. We'll also share that you'd love to see more options in 36DD. @Leanuuhh An amazing way to treat yourself, Lina! @itsdizzlebitch Which scents are you going to pick up? @OneTrueMo1 Can't wait to see you, Monique! @alejandra2597_ We've shared your request, Maria!  We currently offer a few different lengths in many of our sport styles!  You an shop our site by size now at https://t.co/37Jc3ccSVu @unsanskaridude We're sorry for any frustration, Daniyal!  We're glad to help remove you from the email mailing list.  Please send us a DM with your email address. @hearitanyway We hear you! @Zexuxx We're excited for your sexy bag of goodies to arrive! 💕 @Strawberryshal1 SO adorbs! 😍 @MckenaRivenes Dry your eyes, Ken! We've shared your love for Vanilla Lace with our team. @Rockette91 We'd love to help, Rockette! Please DM details including your order number, email and which items that you were overcharged on when you have a moment. Thanks! @beauty_buff Sorry, we do not but we have let our team know that you are looking for more embellished panty styles! @_suhvanuh_ You totally should! @phillymom25 We would be happy to help! Please send us a DM with more details of your concerns! @YowHailey While you wait, you can score our $3 panty sale now by signing into your PINK Nation account! 😉 @__Nyeraa L😍ve it, Ny! @badtothemfbone We always want to put a smile on your face, Nisha! @stacey12221 We hate to hear this, Claire! We would be happy to take a look. Please send us a DM with your online order number, email address, phone number and your shipping address. We hope to hear from you soon! @lizgirardin We have let our team know that you are missing the Body by Victoria perfume! @Bradshawcp We are concerned and would like to learn more Caitlin! Please send us a DM with more details along with your email address and phone  number. We hope to hear from you soon! @LuedkeBrittany Happy shopping, Brittany ❤ @SAMANTHAC_POPPY We still have Love Addict available! https://t.co/9RexynFHqh @peytdean Oh no! We recommend  that you clear you cache and cookies or try an alternate browser! @rjh1290 We understand your concern! Different styles, colors, and fabrics may appear to be a different size; however, when you try them on - you'll still get the same, perfect fit! @_sarahkdrew_ 🗣️📣 PSA! It’s here—our most sensual lingerie ever. You don’t want to miss this. @AmberRae96 Making you sad is never the goal, Rae Lynn! So we can share this with our team and help please DM us your full name, email address, phone number, and purchase information! @seasonalsmiles The wait is finally over, Autumn, enjoy! 😘 @tcheys_ Shop soon, Chey! @courtdillard13 We will share your request with our team, Courtney! @espinosxass We're here to help, Leah! Please send us a DM with your order number, full name, shipping address, and let us know what is missing from your order when you have a moment. @tayloraddicted Woot woot! No such thing as too many PINK panties, Taylor! @Teenie7940 This collection is a must-have, Christine! @Ro99643798 We apologize that your package hasn't arrived! Please send us a DM with your full name, order number, email and shipping address, so we may look into this for you. Thank you! @sarahmariaoffi1 Shop it all, Sarah! @taliasteve12 We wish we had this information. Stay tuned with all things VS here. https://t.co/HbYYF4sJxq The new collection up close (and yes, extremely personal). https://t.co/BGFxDqqpQX https://t.co/VRplaT0z6M @andrea_moohey We hate to hear that you have gotten the wrong bra twice, Andrea! We would be happy to help. Please send us a private message with your online order number along with your email address, phone number and shipping address. We hope to hear from you soon! @steveo2141 We want to make sure you're connected with the right associate the first time. For all inquiries regarding your wife's Angel Card, please contact our Angel Card Customer Care at (800) 695-9478 (Comenity Bank) Mon-Sat 8am-9pm EST. @ronniecexo We would love to hear from you more about your order, Ronniece! Please DM us with your order information, shipping address and full name. Thank you! @adrianson_erin We're letting our team know you want Incredible to come back soon, Erin! @LadyinCharge_ We have shared your interest in a bra sale with our team! @lwynne94 We are happy you love it as much as we do! @Yollieexo Let's get to the bottom of this, Yollie! Please DM us your order #, full name &amp; shipping address associated with the order, and a summary of the items you ordered. TY @doortje98II We've shared your interest in a Reward program with our team for further review. Thanks! @jenmelendrez We are concerned about your experience and we would like to speak with you further, Jen. Please send us a private message with more details so we can help. We would greatly appreciate it! @LoopsyDaisy We will be sure to share your thoughts with the appropriate team and we appreciate your feedback! @FantineVuiller2 Memories 💖 @heloveskween We're letting our team know you're anxiously waiting for more City Backpacks! @AyoooAshley We'd love to know more, Ashley. Please DM us details as well as your email, receipt/order info and full name when you have a moment. Thanks! @jenniferkk77 We're here for you, Jennifer! 💕 @glowingeyes We'll let our Beauty team know you'd love to see it back, Heather! @graceeb03 We're sorry for any frustration this may have caused, Grace! We've made sure to share your feedback with our team. @SenyahMonet So sorry we no longer carry the Vanilla Lace and will let our team know you've love to see it back! Be sure to try the Bare Vanilla for a similar fragrance. @Rayislayy We've shared your interest with our team! 💞 @kandicecasey Sorry about that, Kandice! You can find the Side Tie Hipster in the Floral print on our website here! https://t.co/6bQKo8AnL7 @maylonkayeee We're letting our team know you want Vanilla Lace to come back soon, May! @KatieeeBeth1 We love to hear you're enjoying our Banana Twist Lotion!\n\nWe know you'll love our Peach Squeeze Lotion!  Made with a Juicy Splash, Lush Passionfruit, and Pink Peach. It's a fruity must have for this summer!\n\nhttps://t.co/Rj8iGXbItt @kandicecasey While the Body Glove Mid Rise Bottom has sold out in the floral print, we do have the Side Tie Hipster still available. Check it out, Kandice!\nhttps://t.co/m2PT8AQRQO @isabel_nf We will be happy to take a look! Send us a DM with your order number, full name, and shipping address. Talk to you soon! @Jessidemibeauty Mostly a blessing! @kandicecasey Let's see if we can get to the bottom of this, Kandice. Please DM us the style #, color, &amp; size, and we'll take a look. Thanks! @edwardistheman Thanks for tuning in, Edward! @PeggyAnthonyA Thanks for playing along, Peggy! @HollywoodJunket Our Angels are not playing around, they're in it to win it! @batgirl5204 Look out, new Angel coming through! 😘🙌🏻 @gina_belezos We're always here when you need us, Gina! ♥ @Eric33348006 Stay tuned for meet and greet opportunities, Eric! @blujizzle Survey says~ Angels are in it to win it! @nparisistyles Yass Queen! 😍🔥 @juliaicanteven More importantly, what did you treat yourself to? @JanelleSuris # 1 Answer &amp; # 1 Angels @redbone4 We love your style ♥ @Eric33348006 Survey says: Angels win! @Eric33348006 Thanks for cheering us on, Eric! It was a great game! @TheRealAJ_ 💪💪💪 @ccookstar1218 The Angels totally rocked it! Thanks for watching, Chanel! #TeamAngels @alwaysJiji We love to hear you've found good quality shirts with the length you need, Jiji! @redbone4 We've made sure to share your request for this grand come back! 😉 @hazel_eyed_lyn We love it, Caroll! Thanks for shopping! 😍 @nycmetal6 It's ending soon, so be sure to show now while you can! @air429 We'll let our team know you'd love to see Bombshell in Bloom back, Aireon! @MuhshellC So sorry you're having trouble checking out online, Michelle! If you are still experiencing issues, please give us a call at 1.800.411.5116  and we'd be happy to place it for you. @hazel_eyed_lyn Oh yes! Be sure to check out our Ultimate Lightly Lined Sports Bra! Made with a PINK Logo bottom band, V-Neck, and thin adjustable straps. It's a must have! https://t.co/h10JCHCEX6 @MuchRawTweet Glad to hear you grabbed a great deal! Thanks for shopping with us! 😄 @NWtoSE So sorry the store did not have much left, Jana! Our Semi Annual Sale has been going on for a few weeks and is coming to an end and likely why the store was picked over. We've shared your feedback with our store leadership team as well concerning the associates. @d_n_g_x Be sure to check with the stores directly for end date information as it is while supplies last, Danielle! @mltcjl76 Please DM us more details so we can be sure to share your feedback! @Hollymonroe84 Thanks for shopping, Holly! @KellyOohh We sent you a DM on the 3rd, Kelly! If the heat is getting to you, just remember this: WINTER 😱 Power pose, power team 💪 Watch our Angels face off with #bachelornation on @FamilyFeudABC , tonight at 8PM ET on ABC! #CelebrityFamilyFeud https://t.co/cRXJWWZHf6 @marthakarhoff Oh no! We're sorry to hear this happened, Martha! Please send a DM if you don't receive it! Your ideal summer getaway: @MiiXcHiiC_TiiK Love it! Enjoy your haul! 💋 @Caitiemeoneill We're so sad, Caitie! Find your new summer fave here!\nhttps://t.co/SBBPVvs4de @pamelamarie2113 We'll share your request with our Beauty team, Pamela! @watchshortiego We are so sorry to hear this happened, Emily! We assure we've shared this experience with the leadership team of this store location. @Beautiful_ray_ We are so sorry for the experience you had in one of our stores, Ranisha. Please DM us the store location and more details of your experience so we can be sure to share your feedback and further assist. @LaurenW51875945 So sorry you are having trouble shopping, Lauren! Be sure to clear you cache and cookies, also try an alternate browser. Our site works best using firefox or chrome. https://t.co/t2tqu0YKi5 @incrediblebee_ So sorry to hear this! Please DM us more details so we can be sure to share your feedback! @watchshortiego We love it, Emily! So gad to hear how helpful they were in getting the other item for you! It wouldn’t be a day at the beach without that moment when you think you’ve lost your sunglasses/phone/keys 😰 @tylaorsum You can shop all our bras by both sizes on our website right here, Tyla! https://t.co/GogCH6DmK4 @tylaorsum Sorry to hear you're having difficulties locating your size, Tyla! Please let us know what size and style bra you're looking for, so we may help. Thank you! @NoreenKhanom We'd love to know more, Noreen. Please DM us details so that we can help! @AboveCloudNo9 We will have a similar bag for you soon. Stay tuned! @merscrad We'd be glad to take a look into your order, Mers! Please DM us your order number, email, full name and the item that is missing. Thanks so much! @RwhoweR Of course we have free shipping when you spend $100...Shop now! @CcrystalRrosee You better come treat yourself, CrystalRose! 😘 @mvhsdance Have no fear, Sport is here to stay! 💪 @RwhoweR Shop them all! https://t.co/yJz2Dwf5t4 @MarcStarvaggi You should be able to place that order, Marc. Our apologies! @RockstarRebelXO We'd like to know more! Please DM us details when you have a moment. Thanks! @MarcStarvaggi Our Team is on it! Stay tuned, Marc! @RwhoweR We're working on it now! Check back soon! @PRaye3000 We love to hear you enjoyed your visit with Jessica in our Grapevine location, Paula! We've made sure to share your comments with our team. ❤ @waileyheed We're sorry to see your bras like this, Hailey. Please send us a DM with the date of purchase, where you made your purchase (in store with the receipt barcode number or online with your order number), and the style name. Also, please provide your full name, and email. Thank you. @CJBell007 We're sorry to hear this, CJ. We've made sure to forward your comments with our Leadership Team. @Yourstruly2013 We'd like to look into this, Ashlie. Please send us a DM with the item numbers and color codes for the bra. Thanks! Angels vs. #BachelorNation. It’s going down on @familyfeudABC Sunday, 8PM ET on ABC! #CelebrityFamilyFeud https://t.co/sN3DxAbOc7 @elliecp_ Our beauty team has received your request, Ellie. We thank you for reaching out to us! @_DeeX2 We let the beauty team know that you would like to see Vanilla Lace return and stay, DeeDee. We appreciate your feedback! @Dairinnreyess We hope you love everything you ordered, D! 😘 @gabbbbbbbip We are so sorry to hear about your panties, Gabbi. We would like to know more so we may share your feedback with our quality assurance team. Please send us a private message with the style of the panties, your email and billing address. Thank you so much! @PrincessKelli We hope you had a very Happy Birthday! @bradshau We're sorry for the disappointment with your panties and pants!  We need to get more information. Please send us a DM with purchase information (order # or receipt barcode number),  photos of inside tags on items, name on the purchases, mailing address, and email address. @BabyBindas We invite you to shop our Swim by using our size filter, Morgan. You can use it here: https://t.co/BV8YCUitlN @kpe6679 We've shared your request with our team for further review, Kurt. Thank you! @hannturgeon It truly is a dream. A blissful dream! @morganbranning We'd like to see what we can do, Morg. Please DM us your order #, full name &amp; shipping address, and items you ordered. Thanks! @missssnunez We're here for you! Please DM us and tell us your purchase info (store receipt/online order #) your full name &amp; email address. Thanks! @morganbranning Let's find your order, Morg! Please DM us your order #, full name &amp; shipping address associated with your order, and a summary of the items you ordered. Thanks! @Prince4LifeFan We're pretty excited, too! @SunsetSwift89 We're so sorry to hear your panty started tearing, Lauren. So we may share your experience with our team, can you please send us a DM with the style of panty and your email address. Thank you. @xunxetx We're sharing your interest with our team to see it return. @katinabean13 We're loving this Very Sexy collection and know you will too, Katina!✨  Bra: https://t.co/EFGDi6HK2i Panty: https://t.co/nDA65obg4f @sophiaandretta2 Best day ever, Sophia! Enjoy your haul! @trackingkiki Thank you for sharing your feedback on our fitting room options, KiKi! We appreciate your comments and have shared them with our team for review. If you have any questions, we're happy to help! Please send us a DM. @halle_shelton We recommend connecting with your nearest store to confirm hours of operation, Halle. We look forward to shopping with you soon! @_bbburcu We're sorry to hear that you received less than pleasant service. Can you DM us the location and approximately when you were in so that we can share? @kateb594 You never know when you'll want to treat yourself, Kate! 😉 Happy #4thofJuly! Hope you’re feeling sparks. @shoppnconcierge We're sorry to learn of your concern with our sizing! Please send us a DM with your name, order number and email so that we can share your experience. @JessicaDee1187 Thanks for requesting this old fave, Jessica! 🍎 Tons of other fab options are available now, check 'em out: https://t.co/dXBmXIYqy2 @Raenaaxo The feeling is mutual! 😻 @Caylee42401479 You can never have to many! They are purrfect 😻 @CodyJeanx728 Sounds like  good deal to us! @LiselleEwing We're taking notes and sharing them with our team! Thanks for reaching out! ❤️ @CarameLatte05 We have shared your request for more sizing to be available in your local store! @jharkin9 We have shared your request with our team! @arieolah We hate to hear this, Ariel! We would like to learn more about your online order. Please send us a DM with more details along with your order number, email address, phone number and a brief description of the items purchased. We hope to hear from you soon! @kamsi_ogbata We are glad you love them as much as we do!❤❤ @mariahmdna We think you should ❤ @sauccyya So sorry to see this happened with your panties! Please DM us when you get a chance so we can get more information to share with our team and further assist. @howbouttomorrow So sorry we're out of the size you need. A 34C is a popular size, we'll let our team know you that we need more availability! @gldnarie And we want to continue to do so, Natalie. We thank you for being the best part of our brand! @MonicaK215 We recommend checking out our site for our current deals and offers, Monica, as we do not currently have a 40% off offer featured! @MurrayKerr We'd like to learn more, Murray. Please DM us &amp; elaborate. Thanks! @ramayanti81 #OOTD means Outfit Of The Day, Ramayanti. 😘 You know what they say: a bodysuit a day keeps the #ootd crises away. @chelsj0 Let's find where your package is, Chelsea! Please DM us your order #, full name &amp; email address associated with the order, and a brief summary of the items you ordered. Thanks! @Mxceiva We're so sorry! Please DM us &amp; tell us what device you're shopping on and browser. Thanks! @Becca_Bookworm Oh no, Becca! We wish we were able to send you a replacement. Seems you may have to plan another trip to Hawaii... @Mxceiva Let's get you shopping! We haven't had any issues &amp; suggest that you try clearing your cache &amp; cookies or try a different browser to shop. Or, just click here:  https://t.co/Yhdw3kRCSV. @GabMinieri We love a good sale, Gabriella! @VarshaPatiband1 Yes, just be sure that you have your exchange information with  you! @VarshaPatiband1 Oh no! Yes, you are able to return  or exchange any item that you are not happy with. You can view our full return and exchange policy here: https://t.co/H99l41hdXB @laurynschaffs We hate to hear that your beautiful new bra has broken after a month, Lauryn! We would like to learn more, please send us a DM with which style of bra you have. We look forward to talking soon! @beccaflynnx We would like to learn more, Becca! Please send us a DM with more details. We hope to hear from you soon! @JewelsVrabel Oh no! We would like to speak directly with you. Please send us a DM with your email address, phone number and the best time to reach you. We hope to hear from you soon! @sartnowlan We would be happy to help place an order for you, Sydney! Please give us a call at 1.800.475.1935 and we would be happy to help further! @keezee_ We would like to learn more! Please send us a DM with more details along with which store location that you visited. We hope to hear from you soon! @sartnowlan We never want you to have a bad experience with us online or in store, Sydney! We recommend clearing your cache and cookies or trying an alternate website browser. @LaurenLoddie1 Sorry, Lauren! Body mists and perfumes can not be shipped over seas due to the alcohol content. Be sure to visit your local store to grab all of your favorite scents! You can’t control the weather, but you can always bring the heat. @laur_dub We can't wait to see what you pick up for your self❤❤ @seasonalsmiles We can't wait for you to shop, Autumn ❤ @shaynalucky Oh no! We recommend that you clear you cache and cookies or try an alternate web browser. @FuckMan_Shit We'd like to help! Please DM us your full name &amp; store location  you worked. Thank you! @CarlisleTymber Truly out of this world! @CarlisleTymber So? Are you going to keep us guessing? What scent were you wearing? We've got to know! @shaynalucky Your wish. Our command. Shop now: https://t.co/i47Pf1Wk7u. @monihoney876 @VSPINK We like the way you're thinking, Monique-Ann! @shqueeebee We'd like to see if we can help! Please DM us &amp; tell us more. Include your full name, billing address, and email. Thanks! @garcia_ronette Helloooooo, Ronette! We're so happy to hear you finally decided to spoil yourself! xoxo @Nana_Blueblood Thanks for stopping in! ♥ @Claudia51097424 💘🐶 @jinseystinson We've let our team know you're hoping to see more panty promotions in the future, Jinsey! Thanks for your interest! @ginnywynne We're loving it too, Ginny! 😍 @TeamKlo What was your fave find?! @scarlette_yue We're here to help, Candice! Please DM us additional details about your experience! @angelwings8497 Great choice! 😍 @ky_smile_0121 Summer vibes, all season long! @ce_bear We're sorry to hear this was your experience during your fitting! Send us over a DM containing the store location (&amp; any additional details you wish to share) so that we can address this with our teams. @itsevaamarie Sounds like you found the perfect summer scents, Eva! ❤ @katyruddrn Thanks for sharing, Katy! We'll pass along these kudos to our store teams. @ClarrissaFierce Backorder dates vary by item. Use an alternate browser or device to access our website if you're having trouble. Don't forget! You can give us a call at 1.800.411.5116 to place an order with one of our consultants! @pcolombo106 Thanks for your feedback, Penny! We'll share your comments with store leadership for future consideration. @ClarrissaFierce Our Wicked fragrance collection has been discontinued, Clarrissa. We'd suggest stocking-up while the mist is still available for purchase! https://t.co/2TFwJCbGt6 @MrsJPendergrass Care to chat? Just send us a DM containing your original order number, email, and return tracking number. We'd like to help! https://t.co/iePMPVDcBk @r1961n We're sorry to see that your bra strap has torn! Please send us a DM containing your full name, order#, and email. We'd like to follow-up with you. @guble We are so sorry to see your zipper broke on your fave bra, Rebecca! Please DM us with your purchase details, email address, and full name so we can share this with our team! Sun salutations are that thing you do when you lay in the sun, right? @PiZimmerman We'd like to speak with you further, Michela. Please send us a DM with your email address and phone number when you have a moment. TY! @Lyscie We'll share your feedback regarding the Favorites option in our App, Alyscia! @boricuabellamua We'll be sure to share your request with our team, Bianca! @Taychunky We're happy to share your request for True Escape with our team, Talor! @MRS_Brock2013 Enjoy, Tara! @Marle122 We're all about Kimonos, Slips, and Cami Sets, Marle! They're only $25, but not for long! shop here: https://t.co/aArN0D95RY @emgalvann The right fit matters, Emily. We cant wait to shop with you again! @Sophie_Love0813 We let the team know that you would like to see the original Candy Baby to return, Rachel! @AnnaBankester We are concerned and we would like to speak with you further, Anna. Please send us a private message with more details, the store location and your email. We would greatly appreciate it. @SincerelyTAKIKI We've shared your love and request for Rapture to return @ShortStckDesign We've shared your love and request for it to come back! @tNakedt We'd like to learn more, Jordan!  Can you send us a DM with style details and purchase info (when/where they were purchased? @Echoladye We'd like to see how we can help! Please send us a DM! @drgnfly1103 We appreciate your feedback on your experience, Tina!  We'd love to share with our store leadership team!  Can you share where you were shopping? @Echoladye We currently have free shipping offers for orders of $50 or more going on now! @LiveLaughLov23 Hurry in now to shop, since supplies go fast and we don't want you to miss out! It’s less about the journey, more about what to wear when you reach your destination. @CsVendetta We're so very sorry to hear about your bras, Christina!  Please reply here with your order number, or barcode on the receipt, email address, and name on the order. Also, please share bra details for each of them! @nothingbuterin We're sorry to hear about your order and want to take a look at this! Please DM us your order number, email address, name on the order, and item details. @reneeeeegirl_ We are happy to share your request with our marketing team. Stay tuned😍 @sophiealixr Oh, no Sophie! We'd love the opportunity to learn more so we may best share your feedback. Please send us a private message with the details of your experience. Thanks! @abrilsimental We've replied to your DM. Talk to you soon! @krenee2109 We can't wait to shop with you, Kiki! ♥ @awnagracex21 How sweet! Enjoy all of your goodies! 💋 @averyharrison10 We are so sorry about your order and we want to help. Please send us a private message with your order number, email and billing address. Thank you so much, Avery! @e_d_l_c_18 No news yet, Emily! We will share your request with our Beauty Team! @abrilsimental We would like to learn more, Abril! Please send us a DM with more details and your email address. Talk to you soon! @maybejosiee We are so sorry that you were unable to use your reward, Josie. We want to look into this further for you. Please send us a direct message with the offer code and PIN number if available. Thank you so much! @aly14305701 All too soon, Aly. Shop now to make sure you get the prints and sizes you want! @RDValerie We're always here to help, Valerie. 💕 @KhaiaDade We'd love to have you as an Angel, KD! Visit us online, https://t.co/anmMPnF3LB, to apply! @kkoleee We've let our team know you'd love to see Strawberries &amp; Champagne return, Karryn! @kaykay0715 Livin' that Angel life, Mikaela! @TheBaddestMitch We'd love the opportunity to share your feedback, Ari! Please DM us the bra style and name. Thanks! @alisoningaa We are so sorry to see your Bikini rip, Alison. We will be sure to share your feedback with our swim team!"}