{"tweets": "The Savior loves you and knows you personally. He knows of your challenges. He knows your circumstances. He knows the profoundest concerns of your souls. He also knows your faith and your desire to serve Him. When we face challenges and afflictions, we may feel discouraged or perhaps forgotten.\n\nIn the midst of your tribulations, you can find the peace that you need through the serene power of prayer. Heavenly Father hears your prayers. I have had associations with the good people of China for decades. These are our dear brothers and sisters and we feel privileged to be able to offer some small measure of help. We pray for them, and know God will bless them. https://t.co/mPksi1uawf Just as God listened to Joseph’s prayer in 1820, He listens to you and yearns to speak with you through the Spirit. We invite you to be a major part of sharing the message of the ongoing restoration of the Savior’s gospel. https://t.co/eMYQvnRNyj The life of Jesus Christ neither began in Bethlehem nor ended on Calvary’s cross. He lives! Jesus the Christ stands ready to help, heal, and strengthen each of us in His divinely commissioned way.\n\nMay you have a Christmas filled with peace, love, and joy. https://t.co/7Y3dUp6r8y How much better it would be if we all could be more aware of God’s providence and love and express that gratitude to Him. Our degree of gratitude is a measure of our love for Him. Today we conclude our trip with a stop in Indonesia. The reason for these travels, in fact, the reason for everything we do in the Church, is our Savior, Jesus Christ.\n\nI plead with you to draw near to the Lord and follow His teachings. Emulate His example. Love as He loved. https://t.co/132nT14D6O We love our modern mobile phones and other means by which we can have good communication with others. But we can communicate with Heavenly Father at any hour of any day or night, and there are no service fees or batteries to be charged. This is an important truth for all of us. Wendy and I are thrilled to be in the beautiful country of Singapore. We have met so many happy families here. I encouraged them—and I encourage you—to teach your priceless children. Teach them what it really means to be a child of God. They are created in His very image! https://t.co/ICBwPvYEIm You may remember we recently announced a temple will be built here in Phnom Penh, Cambodia. I shared a rendering of the temple and testified that it will be a house of the Lord. \n\nI promise that as you are worthy to enter the temple, miracles will come into your life. https://t.co/uB5Ikakr4O During a meeting this week, a young adult in Vietnam asked how we can learn more about the Atonement of Jesus Christ. I invite each of us to study in the scriptures, especially @TheBookofMormon! This is the best way to learn about the Savior's Atonement. https://t.co/APuyWkY3bk Today we began our trip to Southeast Asia by visiting Hanoi, Vietnam. I express to the leaders of the government and to all the people of Vietnam our heartfelt gratitude for the opportunity for our members of the Church to gather here and worship in dignity. https://t.co/vXxXfLCG1q We are now on our way to Southeast Asia. Our hope as we travel is to build YOUR faith. Yet we always return having had OUR faith strengthened by the members and friends we meet. I will try to share with you some of the meaningful experiences we have along the way. https://t.co/Xvht1MLZ9q We were pleased to meet yesterday with Cuba’s Ambassador to the U.S., José R. Cabañas. He affirmed to us that the Church is welcome in Cuba. We are most thankful for that information. https://t.co/ZxWhTX116y This is a global church! Regardless of where we call home, members of the Church feel passionately about the Fatherhood of God and the brotherhood of man. Thus, our greatest joy comes as we help our brothers and sisters, no matter where we live in this wonderful world. Wendy and I—along with Elder @ChristoffDTodd and his wife, Katherine—are thrilled to have the opportunity to visit Vietnam, Cambodia, Singapore, and Indonesia in mid-November. \n\nhttps://t.co/0uDoE9U5W2 https://t.co/NLmi4LLhSr Immerse yourself in the glorious light of the Restoration. As you do, #GeneralConference next April will not only be memorable; it will be unforgettable. #GeneralConference in April will commemorate the bicentennial of the First Vision. It will be different from any previous conference. Until then, I hope all will prepare for a unique conference that will commemorate the very foundations of the restored gospel of Jesus Christ. https://t.co/jnou1Xek1S My dear brothers and sisters, you are living exemplars of the fruits that come from following the teachings of Jesus Christ. I thank you! I love you! #GeneralConference https://t.co/1tKF8bp8JD Sisters, please know the heavens are just as open to women who are endowed with God’s power flowing from their priesthood covenants as they are to men who bear the priesthood. I pray that truth will register upon each of your hearts because I believe it will change your life. https://t.co/L70706pQEs It is wonderful to be with you again at #GeneralConference. We have just shared some important adjustments intended to help young men and young women develop their sacred personal potential. I invite you to read more in the following article. I am happy to share with you information about the release of the new Book of Mormon Videos series.\n\nOur desire is that these videos will not replace your scripture study but rather support and enhance your personal and family study of the Book of Mormon.\n\nhttps://t.co/qOFnr3DwMx Today I shared five important truths with the young people of the Church at a BYU devotional. I invite you to watch this short video—which I hope can help provide some clarity about the love and laws of God. I think about the issues facing young people daily. I feel inspired to share an important message with you on September 17 at 11:05 a.m. MDT. Please join me that day on the Church’s Facebook or YouTube account or https://t.co/cIqrJz2dwP. https://t.co/mVJAsKjvqx I cannot adequately thank you for all the good wishes on my 95th birthday. I have read your loving comments, many heartfelt cards, and letters. Please know of my heartfelt feelings of appreciation and affection! I thank you all, most sincerely. https://t.co/JJk6VcTppX Learn for yourselves who you really are. Ask your Heavenly Father, in the name of Jesus Christ, how He feels about you and your mission here on earth. If you ask with real intent, over time the Spirit will whisper the life-changing truth to you. What a marvelous visit we had to Latin America. The work is moving forward. Please remember that the Restoration is a continuing process. We have a lot to do before the Lord will come again. And we are going to do it. https://t.co/3TwS57JsaO As I travel through Latin America, I am continually reminded of how God loves His children. Pour out your hearts to God. Remember to pray to Him every morning and night. Pray with your families. Pray in private. In doing so, He will direct you for good in everything you do. https://t.co/S5WelzPvUV We were privileged to meet some new friends in Argentina for whom the Church has been able to help provide wheelchairs. I was touched by their gratitude. Ministering to those in need is at the heart of the gospel of Jesus Christ. https://t.co/K8pTPy3Z1L We have met with thousands of good and faithful men, women, and children these past few days in Guatemala, Colombia, and Ecuador. I testify that the gospel has been restored to bless all the children of God, regardless of their geographical or political circumstances. https://t.co/NYFh9lswuB We were grateful to spend some time with Colombian President Iván Duque Márquez earlier today. We discussed religious freedom and the importance of protecting families. He was a thoughtful host who is very grateful for the help of our Church. https://t.co/M0caT06aFc We have just started our ministry trip to Latin America with a visit to Guatemala. I've had the pleasure of visiting with the people here many times over the last few decades. Each time, I am impressed by their love for the Savior and for one another. They are examples to me. https://t.co/sA4HpXvJy0 Our Father has made it possible for us to communicate with Him while we are separated from our heavenly home.\n\nThrough sincere prayer, you may reach out to your Heavenly Father at any time, and through the whisperings of the Holy Ghost, He will respond. We do not have to go through this life alone. Jesus Christ atoned to help us find the covenant path that leads back home. He can give us the strength and courage to walk confidently on that path. The Atonement of Jesus Christ can help us cope with the grief, sadness, weakness, fear, and anxiety that are part of mortality’s trials. What we choose to do here will determine the kind of life we have throughout all eternity. We are never living just for today. Because of the Savior’s sacrifice, we have access to His healing power. He will heal our hearts, give us strength when we are weak, enable us to do things we could never do on our own, and heal us from sin when we repent. Jesus is the Light that shines in the dark. He is “the way, the truth, and the life.” He is our anchor when we are desperately in need. The Atonement of Jesus Christ overcame the sting of death. Because of Him, we will be resurrected. This is an unconditional gift from our loving Savior. Daily prayer is the best way to remember that you are a son or daughter of God. He will guide and watch over you as you pour out your heart to Him. -God is our Father.\n-Jesus Christ is our Savior.\n-We are children of God.\n-The Book of Mormon is the word of God.\n-The priesthood has been restored and the heavens are open.\n-Every person has a role to play in the gathering of Israel.\n-Joy comes from keeping the commandments. Tonight in Orlando, Florida, I shared seven vital truths that have the power to change your life and the lives of those you love. These are truths that open the heavens and allow us to draw upon the power of God. They are: https://t.co/hh37Zptwu4 As we complete our visits in the Pacific, I am overwhelmed with feelings of gratitude and joy. We will always remember the special privilege we had to feel the strong faith of the Saints in the Pacific. https://t.co/qGc6P48tzK I felt I was wrapped in the love of the Saints in Suva, Fiji. I asked the children there to stand and sing “I am a Child of God” with me. It is my hope that every one of us will remember that we are children of our Heavenly Father. https://t.co/xJyVD4PknK Even in our differences, I feel that the Creator of us all, our Father in Heaven, would want us to support each other like the brothers and sisters that we are. https://t.co/zKce4TSv4q Our visits in the Pacific have been tremendously inspiring. As we have met with Latter-day Saints and others in Hawaii, Samoa, and Australia, we have spoken about how our Heavenly Father wants us to be happy. If we truly desire happiness, we must choose the way of the Lord. https://t.co/AJYBuk4BRa I believe that we all are coming together “as one.” This coming together truly represents all that is good in the world. I pray each of us can work toward building peace and fostering understanding so that we all may be “as one.” I was pleased to be part of a ceremony today that celebrated the 150th anniversary of the joining together of two railroad lines—connecting people unlike ever before. The theme of the event was “As One.” https://t.co/dWfhOr0W5h On this beautiful Easter day, I extend greetings to each of you and express personal gratitude for the life and ministry of Jesus Christ. He is the living Christ—our Savior and Redeemer. Thanks to Him, no condition is hopeless. Brighter days are ahead, both here and hereafter. https://t.co/ZqercS0YUz We join with Christians around the world to remember the Savior’s inestimable love on this Good Friday. We are reminded that Easter Sunday is nigh. Easter stands as a recurring testimony that Jesus is the Christ, our redeeming Lord and Savior. I express my love for Him. He lives. https://t.co/FXwnOAE4as We promise that you will love the results. As we watch the renovation of the temple and Temple Square, I invite each of us to renew our dedication to the Lord and His holy work. For more information, please visit https://t.co/ZQz9TajYge. As promised at April general conference, today I announced the upcoming temporary closure on Dec. 29, 2019 of the magnificent Salt Lake Temple due to an extensive renovation project. The temple will remain closed for a period of approximately four years. https://t.co/5KLCVncfvT Upon learning of the fire at Notre Dame Cathedral, I wrote @Pontifex Pope Francis to express that Latter-day Saints are remembering our Catholic brothers and sisters. We pray that Notre Dame will rise again in newness of life. We hope and pray that each member’s home will become a true sanctuary of faith, where the Spirit of the Lord may dwell. Despite contention all around us, one’s home can become a heavenly place, where study, prayer, and faith can be merged with love. #GeneralConference Now, as President of His Church, I plead with you who have distanced yourselves from the Church and with you who have not yet really sought to know that the Savior’s Church has been restored. Do the spiritual work to find out for yourselves, and please do it now. My dear brothers and sisters, Jesus Christ invites us to take the covenant path back home to our Heavenly Parents and be with those we love. He invites us to “come, follow me.” #GeneralConference As you ponder this change, remember that your ability to have more impact on the world than any previous generation is completely dependent upon the level of your devotion to Jesus Christ. I invite you to read my invitation to you in the article below. \n\nhttps://t.co/FYloLs24cu Beginning in 2020, the course of study for seminary will shift to an annual calendar. Classes will study the same book of scripture used for the “Come, Follow Me” curriculum. This will enhance the home-centered, Church-supported approach to gospel study. https://t.co/CJUb4MlznJ The Lord stands at the head of The Church of Jesus Christ of Latter-day Saints. As modern-day Apostles of Jesus Christ, the message we share today is the same that Apostles shared long ago—that God lives and Jesus is the Christ. https://t.co/1fTyrRDl3I This morning we held the first dedicatory session of the Rome Italy Temple. The promises of the temple are real. If you will go to the temple seeking strength and understanding, you will be taught by the Lord Himself about truths that matter to you most in your time of need. https://t.co/ZWsd0hizgi Today President M. Russell Ballard and I met with His Holiness Pope Francis at the Vatican. He is a wonderful, gracious man.\n \nWe have much in common. The differences in doctrine are real—and they’re important—but they’re not nearly as important as the things we have in common. https://t.co/lQnIr3j90J Members of The Church of Jesus Christ declare that a temple is literally the house of the Lord. I invite you to enjoy this video and see inside one of our temples.\n\nhttps://t.co/4g4eylwJ55 Jesus Christ is at the center of His Church and we will be blessed as we strive to make Him the center of our lives. https://t.co/tGEgWEugQE Last night I was pleased with the opportunity to speak with thousands of followers of Jesus Christ about the remarkable promises God makes to us in the Book of Mormon. Its central message is that Jesus Christ is our Savior. This book is a gift from God to the entire world! https://t.co/QlwWjbJsAk I was invited to share my thoughts about life and faith with readers of the Arizona Republic. I wrote that if there is anything I’ve learned in my 94 years of living, it is that a life with God is far better—more filled with hope—than one without Him. Recently on my social media accounts, I asked to hear from women of all ages about their experiences with the invitations I extended at the October general conference. I was overwhelmed to see that more than 10,000 women responded! My heart was touched by what you shared. With the Lord as our Exemplar and Redeemer, whatever adversities or tragedies come our way, each of us will be able to say, “It is well with my soul.” You may have heard of the passing of our second daughter last week. We mourn her loss—and yet, like our friends in California, there is nothing we’d rather do than try to be of help to others. Everybody has challenges and if you want to feel better, serve somebody else. I know the Lord has been guiding them in their efforts to recover and move forward in faith. I testify the Lord will do the same for you in your own trials. Your hope, your joy, and your future will be shaped by your faith in God, and your faith in the Lord Jesus Christ. Yesterday, I traveled to California to meet with those who experienced loss and despair after the recent wildfires. As visitors, we could hardly comprehend the tragic losses that these dear brothers and sisters have sustained—loss of life, homes, jobs, work places, and much more. https://t.co/UkLKj9hnFb Jesus Christ is God’s transcendent gift—the gift of the Father to all of His children. That birth we joyfully celebrate each Christmas season. https://t.co/Yo0iKKnDG8 I pray that we will believe and receive the love the Savior has for each of us. His infinite and perfect love moved Him to atone for you and me. Today we announce an adjustment to how our children and youth progress in their Primary and Young Women classes and Aaronic Priesthood quorums. These changes will help our young people to continue to realize their potential as disciples of Christ. https://t.co/dsGZE236v2 https://t.co/6ToS1gl7EU I will long remember this historic evening at the Alamodome. Each person in attendance—in fact, everyone—lives with challenges. For all of us, there may be a serious storm sometime in our lives. But with faith and trust in a loving God, the pain of such a tragedy can be endured. https://t.co/uONIRXSp79 We are witnesses to the process of restoration. If you think the Church is fully restored, you’re just seeing the beginning. There’s much more to come. Wait until next year, and then the next year. Eat your vitamins, get your rest. It’s going to be exciting! I have just returned from South America. The people there are so loving, so anxious to serve the Lord and to serve each other. It’s very energizing to see these beautiful people and children who love the Lord. https://t.co/OKCaKV5GPf This has been an inspirational and historic #GeneralConference. We look to the future with enthusiasm. I leave my love and blessing upon you, that you may feast upon the word of the Lord and apply His teachings in your personal lives. https://t.co/fNMxPgkctB I promise that if we will do our best to restore the correct name of the Lord’s Church, He whose Church this is will pour down His power and blessings upon the heads of the Latter-day Saints, the likes of which we have never seen. #GeneralConference My dear sisters, we need you! We need your strength, your conversion, your conviction, your ability to lead, your wisdom, and your voices. We simply cannot gather Israel without you. #GeneralConference https://t.co/B4ss5L9s5c Accordingly, we now want to put in place organizational adjustments that will further fortify our members and their families. This morning we announced a new balance between gospel instruction in the home and in the Church. Please see the article below. https://t.co/orf23vbfnz In this complex world today, this is not easy. The adversary is increasing his attack on faith and on families at an exponential rate. To survive spiritually, we need counterstrategies and proactive plans. The long-standing objective of the Church is to assist all members to increase their faith in our Lord Jesus Christ and in His Atonement, to assist them in making and keeping their covenants with God, and to strengthen and seal their families. We are all, metaphorically speaking, on a rafting trip through life. Usually it’s beautiful and peaceful. But at some point, we hit rough rapids. As we face churning challenges in our lives, the greatest and only real safety comes as we hold onto the restored gospel of Christ. Last week, I had the great opportunity to speak to more than 49,000 people at Safeco Field. I told them that we are living in the most crucial era in the history of the world. As a people we need to be looking and acting like true followers of Jesus Christ. https://t.co/T42kfFwrpZ Because the Savior offered Himself as the infinite Atonement, you and I have the opportunity—the privilege—to be forgiven when we repent. I testify that He is the living Christ, our Lord and Savior, Exemplar, Redeemer, and Judge. Every child of our Heavenly Father deserves the opportunity to choose to follow Jesus Christ, to accept and receive His gospel with all of its blessings. If you will sincerely and persistently do the spiritual work needed to develop the crucial, spiritual skill of learning how to hear the whisperings of the Holy Ghost, you will have all the direction you will ever need in your life. Take your questions directly to your Heavenly Father in prayer. Ask Him, in the name of Jesus Christ, to guide you. You can learn for yourself—right now—how to receive personal revelation. And nothing will make a bigger difference to your life than that! Please remember, my dear young brothers and sisters, you are among the best the Lord has ever sent to this world. You have the capacity to do great things. 5. Stand out. Be different. Be a light. Give to a friend one copy of the booklet For the Strength of Youth. 4. Pray daily that all of God’s children might receive the blessings of the gospel of Jesus Christ. 3. Keep on the covenant path. If you are off, repent and get back on the path. 2. Make a weekly sacrifice of time to the Lord for three weeks. 1. Hold a seven-day fast from social media. Last night at the Worldwide Devotional for Youth, I invited youth to do five things that will change them and help them change the world. They include: https://t.co/aYdK21WtXJ I am deeply impressed by the goodness and potential of the youth of the Church.\n\nTo help you gain a vision of your role in the latter days, my wife, Wendy, and I will share a special message with you on Sunday, June 3 on https://t.co/ObPNIGgFOZ. What a joy it was to celebrate the 40th anniversary of the revelation on the priesthood tonight.\n\nIt is my prayer that we may overcome any burdens of prejudice and walk uprightly with God—and with one another—in perfect peace and harmony. https://t.co/s0dQWBazoB It was my pleasure today to meet with national officials of the NAACP to affirm the fundamental doctrine—and heartfelt conviction—of The Church of Jesus Christ of Latter-day Saints that all people are God’s precious children and are therefore brothers and sisters. https://t.co/EC1j0QvT1r As we prepare for the worldwide youth devotional on June 3, I have a special invitation for you, my young friends. https://t.co/y3lxdQGzXj Spending the last couple of weeks visiting with God’s children across the globe has been such a meaningful experience for me. We are brothers and sisters in every sense of the word. We are created in God’s image. Male and female—He created us all. https://t.co/Zo2RrS7njs I was overjoyed to be with the people of India yesterday. Every time I have visited this country, I have felt a special feeling here. The Lord loves the people here, and I love them too. https://t.co/ARfXnBfLov I testified that God is our Father. We are His children, created in His image. We don't look alike. That's good. We have individual identities, spiritually and physically, but we are His children. I am thankful to have been with the Saints in Kenya and Zimbabwe, where so many have an innate love of God. I wondered what I have learned in my 93 years that I could share with them. https://t.co/vf1l3BrDOx He taught us how to love, how to pray, how to endure. There’s no trial that we can endure that He doesn’t know about. He gives each one of us hope. I am honored to be listed among the many who teach and testify of the Lord Jesus Christ. He is the Savior of the world, and He has given us an example by which we can live. The message of the Lord Jesus Christ is a message of hope, it is a message of love, it is a message of joy. It is underlined in this time of a little heightened tension. Jerusalem is a land which was made holy by the Son of God. He had an earthly ministry here. He healed the lame, gave sight to the blind, and restored life to those who had died, so one can’t help but feel closer to Him in this holy place. https://t.co/ZZBR5S8ulo Our goal is to invite all of God's children on both sides of the veil to come unto their Savior and enjoy the blessings of the temple, have enduring joy, and qualify for eternal life. And that will bring hope, help, and lift to all people. No matter where we would go, we would neglect more than we'd serve, but we’ll do all we can do in two weeks, and we'll go home and rest for a while, then tackle another journey. The Lord’s message is for everyone. This is a global work. Whenever I'm comfortably situated in my home, I'm in the wrong place. I need to be where the people are. We need to bring them the message of the Savior. You may have heard that I have just begun a global tour in which we are visiting with thousands of people in eight countries. I have been asked why I would embark on such a tour. The reason why is simple: https://t.co/n4Z1wPqywK Let this Easter Sunday be a defining moment in your life. Choose to do the spiritual work required to enjoy the gift of the Holy Ghost and hear the voice of the Spirit more frequently and more clearly. We are engaged in the work of Almighty God. Jesus is the Christ! We are His humble servants! God bless you, brethren, as we learn of and do our duty. In a coming day, you will present yourself before the Savior. You will be overwhelmed to the point of tears to be in His presence.\n\nChoose to be one of His true followers now. Be one who truly loves Him, who truly wants to serve and lead as He did. I promise you that when you begin to catch even a glimpse of how your Heavenly Father sees you and what He is counting on you to do for Him, your life will never be the same! Ask your Heavenly Father, in the name of Jesus Christ, how He feels about you and your mission here on earth. If you ask with real intent, over time the Spirit will whisper life-changing truths to you. One of the most important things you need to learn in life is to know who you really are. Know that you are an elect son or daughter of God, created in His very image. I promise that as you daily immerse yourself in the Book of Mormon, you can be immunized against the evils of the day. I promise that as you prayerfully study the Book of Mormon every day, you will make better decisions—every day. The truths of the Book of Mormon have the power to heal, comfort, restore, succor, strengthen, console, and cheer our souls. Jesus suffered deeply because He loves us deeply! He wants us to repent and be converted so that He can fully heal us. We are thankful for the prayers that have been offered for us. Now, whatever your concerns, whatever your challenges, I wish to assure you that there is a place for you in the Lord’s Church. Our Father in Heaven cherishes His children and wants each of us to return home to Him. https://t.co/b5EtlJ6m0I I testify that the Book of Mormon is truly the word of God. It contains the answers to life’s most compelling questions. I testify with my whole soul that in a most miraculous and singular way, the Book of Mormon teaches us of Jesus Christ and His gospel. I know that President @ThomasSMonson is the prophet of God on the earth today. I love him and sustain him with all of my heart. Immersing ourselves regularly in the truths of the Book of Mormon can be a life-changing experience. Be of good cheer. Take life one step at a time and do the best you can each day. Life passes so swiftly. Thank you for sharing your testimonies on my last tweet. I am strengthened by your faith in the Book of Mormon. https://t.co/AJsaodOx8W When I spoke at #LDSconf, I asked what your life would be like without the Book of Mormon. What would you not have? What would you not know? The Savior really is your Advocate with the Father. He will take your side. He will stand up for you. If you learn all you can about Jesus Christ, your love for Him, and for God’s laws, will grow beyond what you currently imagine. As you keep God’s commandments, as you live by His laws, you will become increasingly free. There is no amorphous entity called “the Atonement” on which we call for succor, healing, forgiveness, or power. Jesus Christ is the source. We should always remember to connect the Savior’s atoning sacrifice—the central act of all human history—to the Savior Himself. https://t.co/p0aSvRK1Ae Our covenants bind us to the Savior and give us godly power. When God’s laws are obeyed, relevant blessings always result! Blessings are always predicated upon obedience to applicable law. Faith, prayer, study, and hard work make a winning combination. It is mentally rigorous to strive to look unto the Savior in every thought. But when we do, our doubts and fears flee. As you seek to learn more about Jesus Christ, I urge you to study “The Living Christ.” https://t.co/JRrSfIQOtS Our Father sent you to earth in this final dispensation not to fail but to succeed—and to find joy while doing so. The more we know about the Savior’s ministry and mission, the more we know that He can provide the power that we need for our lives. Because of Jesus Christ, we can have access to godly power—power sufficient to deal with the burdens, obstacles, and temptations of our day. Under the Father’s great eternal plan, our Savior, Jesus Christ, delivers us from physical and spiritual death. I love and testify of Him. https://t.co/mC589NmLt9 Faith in Jesus Christ propels us to do things we otherwise would not do. Faith in action gives us more access to His power. #LDSconf President Thomas S. Monson is the Lord’s living prophet on the earth. How we love him, sustain him, and pray for him! https://t.co/g3FtytshhH Saints can be happy under every circumstance. We can feel joy even while having a bad day, a bad week, or even a bad year! I promise you that if you will study Christ’s words, your ability to be more like Him will increase. https://t.co/b4dVJidX0e https://t.co/zVHBiCskFn I challenge you to make a personal sacrifice of time in doing temple and family history work. I promise you will find great joy by doing so. https://t.co/ZkNap5J6qj Please join me and my wife Wendy as we speak this Saturday at #RootsTech. You can watch live on https://t.co/h6mzGUgPMD at 1 p.m. MST. Every time we nurture our spouse and guide our children, every time we forgive someone or ask for forgiveness, we can feel joy. I promise as you study the Savior's life, your love for Him will immeasurably grow. Read my invitation to you here: https://t.co/vj4ijk2KrU https://t.co/pAgBQA7PyM I invite you to join me for the worldwide devotional this Sunday at 6 p.m. on https://t.co/h6mzGUgPMD. https://t.co/QBRehq7cwh Joy is a gift for the faithful. It is the gift that comes from intentionally trying to live a righteous life, as taught by Jesus Christ. As our Savior becomes more and more real to us and as we plead for His joy to be given to us, our joy will increase. Joy comes from and because of Him. He is the source of all joy. In order for Him to endure the most excruciating experience ever endured on earth, our Savior focused on joy! Revelation from the Lord to His servants is a sacred process, and so is your privilege of receiving personal revelation. We are here to qualify ourselves day by day for the positions that our Father expects us to fill hereafter. If we will humbly present ourselves before the Lord and ask Him to teach us, He will show us how to increase our access to His power. The joy we feel has little to do with the circumstances of our lives and everything to do with the focus of our lives. #LDSconf Before #LDSconf on Oct. 1–2, I invite you to read Hebrews 12:2 &amp; consider why the Savior focused on joy as He prepared to endure the cross. How grateful I was to see the Christlike service rendered in behalf of those affected by the floods in Louisiana. https://t.co/qmJL3G225i Stand up and speak up for truth—especially when it is not popular. You can learn to hear the voice of the Lord through the whisperings of the Holy Ghost. Our Heavenly Father and His Son stand ready to respond to your questions through the ministering of the Holy Ghost. Serve with love. Loving service to those who have lost their way or who are wounded in spirit opens your heart to personal revelation. Are you willing to worship in the temple regularly? The Lord loves to do His own teaching in His holy house. I promise you that as you consistently give the Lord a generous portion of your time, He will multiply the remainder. Prayer is a key. Pray to know what to stop doing and what to start doing. As you follow Jesus Christ, you will find sustained peace and true joy. You will have days when you will be thoroughly discouraged. So, pray for courage not to give up!"}