{"tweets": "Over the past 60 years, the list price of a vial of insulin has gone from about 75¢ to $250. These biohackers have a plan to fix it https://t.co/mJCGLoQ44X Lone Oregon GOP Congressman Greg Walden to retire https://t.co/rrnxbnSwXU Here’s why October is California's most dangerous month for wildfires https://t.co/psjcnKNYpM In milestone election, Colombia's capital city elects first female mayor — and first openly LGBT mayor https://t.co/j4vooA06vf Robert Evans, former Paramount chief who backed \"Godfather\" and \"Chinatown,\" dies at 89 https://t.co/9SAw5dklyb https://t.co/LhtYKFPoTM From the ghoulish to the glamorous, here’s a look at the best celebrity Halloween costumes of 2019 https://t.co/Nweaiu5JLT Northern California’s Kincade wildfire has grown so large that a satellite was able to record the plumes from 22,300 miles away in space. Here's what it looks like https://t.co/aUJXR7IdWQ Popeyes’ ultra-popular chicken sandwich is coming back to the menu https://t.co/LHQgPwnDwR Jury awards Missouri police sergeant $19.9 million over anti-gay discrimination lawsuit https://t.co/AmghvcBNjk Turkish-backed militias have killed civilians in areas abandoned by the U.S., four U.S. military and intelligence officials tell TIME https://t.co/tygv2AofNP \"I used to really struggle with how I could live life with my children. I would think, 'How am I going to take care of them when I can barely take care of myself?'\" writes author Kevin Wilson.\n\n\"But my worldview has changed radically since I’ve had kids\" https://t.co/5T1UbFvnAK Visiting Chicago for the first time as president, Donald Trump disparaged the city as a haven for criminals that is “embarrassing to us as a nation.” The superintendent of the Chicago Police responded https://t.co/gY4QDSR4iu https://t.co/X6DhHByp7C Emerging research shows that it isn’t just how much time kids spend online, but how and why they spend time online that impacts their social, emotional and behavioral health https://t.co/DPDBPV16Ut Man arrested in Texas homecoming party shooting that killed two, injured 12 https://t.co/HwV3MG6hzp Here are TIME’s most anticipated horror movies with release dates set over the course of the next year https://t.co/5cgwdyIEWH One year after the first crash of a Boeing 737 Max, the CEO will begin two days of testimony before Congress https://t.co/Q7Pu5rW1Ib At least 3 anti-government protesters killed in Iraq as thousands of students join demonstrations https://t.co/RSJ0RGsQAj House Democrats are expected to vote on a resolution asserting their right to conduct an impeachment inquiry into President Donald Trump, House Speaker Nancy Pelosi wrote in a letter to her colleagues https://t.co/swUf0Ucdkv Iowa woman dies after gender reveal party explosion https://t.co/Bgsn66t0Cb Robert Evans, former Paramount chief who backed \"Godfather\" and \"Chinatown,\" dies at 89 https://t.co/gQE2RoFyxe From the Area 51 raid to Kylie Jenner singing “rise and shine” https://t.co/6Guu9JpQLS \"By eschewing the paradoxes that have driven his best work, West has unwittingly put forward another one: he’s claimed God as his greatest inspiration, but made the least inspired album of his career,\" writes TIME's @andrewrchow https://t.co/QLzL2Q9yzs \"Tremendous service.\" A military dog wounded in al-Baghdadi mission is already back to work https://t.co/TEPeQ1jGvm If you or someone you know may be contemplating suicide, call the National Suicide Prevention Lifeline at 1-800-273-8255 or text HOME to 741741 to reach the Crisis Text Line. In emergencies, call 911, or seek care from a local hospital or mental health provider. Approximately 42% of female surgical residents reported burnout, compared to 36% of male surgical residents. Female physicians were also more likely to report having suicidal thoughts, according to the study https://t.co/QGUEhWHH7O The Justice Department appealed a judge’s order directing the department to provide the House with secret grand jury testimony from Special Counsel Robert Mueller’s Russia investigation https://t.co/xG2TrlcQ1b Paul Rudd's daughter dressed up as the Wasp for Halloween. Surprisingly, Rudd didn't dress up as Ant-Man https://t.co/r3cA7UBHTb RT @andrewrchow: \"Jesus is King,\" the worst album of Kanye's career, is ironically weighed down by its lack of demons\nhttps://t.co/yBC7MxCI… In milestone election, Colombia's capital city elects first female mayor — and first openly LGBT mayor https://t.co/y9jD9mvdON A Sinkhole opened up during morning rush hour in Pittsburgh, and a bus fell into it https://t.co/VUPWGB3KLl https://t.co/Ox1sINYMxB Apple debuts higher-end AirPods with noise-cancellation and water-resistance https://t.co/8zU3PXrIrR Today's Word of the Day with @MerriamWebster is “undulate” https://t.co/hYFanebJqa Top Republican leaders in Texas have weighed in on two parents’ battle over their 7-year-old child’s gender identity https://t.co/ouWxAGDaMa Former North Carolina Senator Kay Hagan dies at 66 https://t.co/OMLbmDJAru Demi Lovato is all about dressing up as scary historical and pop culture royalty figures this year https://t.co/Qn5BoMLPmM Charles Kupperman, who was a deputy to former national security adviser John Bolton, failed to show up for a scheduled closed-door deposition Monday https://t.co/UZpWBmk6xr As President Trump watched the Washington Nationals play the Houston Astros on Sunday night, not everyone in the crowd was happy with his presence https://t.co/qxkwWW2sVa https://t.co/GUsg1jnzlq Here’s why October is California's most dangerous month for wildfires https://t.co/RtU5RDNpnH RT @timeforkids: In this week's issue, TFK travels to Honduras to speak to kids and families there. Also: mummy discoveries in Egypt, climb… Jessica Biel's Justin Timberlake trolling continued in fine form for Halloween https://t.co/efuOysGYTi A Sinkhole opened up during morning rush hour in Pittsburgh, and a bus fell into it https://t.co/ovkR1Jh6DP Syrian Kurdish forces have reportedly killed a potential successor to Abu al-Baghdadi https://t.co/UpvUSNLr9I Former Rep. John Conyers, one of Congress' longest-serving members, dies at 90 https://t.co/OZznNJO2pr Apple TV+ debuts Friday. Here's a comprehensive guide to which streaming services are worth paying for https://t.co/SECiWR12H7 Kylie Jenner's daughter Stormi dressed up as her for Halloween https://t.co/B5ZDyzyhja Trump speaks at the International Association of Chiefs of Police Annual Conference in Chicago https://t.co/0zI7vsWj85 President Trump was booed at the Washington Nationals game https://t.co/FDnpm67Ngz Argentina's Peronists return to power after dramatic election ousts conservative incumbent https://t.co/1EpPQDT5tJ The Getty Fire burns off the freeway in Los Angeles, where many are being evacuated https://t.co/s2eosisXlO https://t.co/iTMEfoWdi3 Trump didn't just announce al-Baghdadi's death; he seemed to revel in the gruesome details https://t.co/MAl5u2ponO Al-Baghdadi was the “face of the ISIS brand,” but analysts warn that one military operation can't stamp out an entire ideology https://t.co/L6Zos4Avgh The raid that killed ISIS Leader Abu Bakr al-Baghdadi was launched by the same old-fashioned tool that led to Osama bin Laden: human intelligence https://t.co/0pTD7V5JVF Apple TV+ launches Nov. 1. Here's what to watch—and what to skip—on the new streaming service https://t.co/lODYJpb5Xp Review: “The Morning Show,” the flagship show from Apple TV+, is binge-worthy but frustrating Shonda Rhimes lite https://t.co/0wA3slaGNW Column: The U.S. and China need to put aside their rivalry and focus on the common enemy of climate change https://t.co/LOp1UdoB2w Cinderblock, a cat on the more voluptuous side of the cat size range clocks in at 25 pounds, but is on a “weight loss journey” https://t.co/Omkcodg4CK Over the past 60 years, the list price of a vial of insulin has gone from about 75¢ to $250. These biohackers have a plan to fix it https://t.co/oSYrDVHDfF Brexit has been delayed again, and an election may be on the horizon. Here's what to know https://t.co/IZejw6bUZE Answering all your burning questions about “Find Me,” with help from André Aciman https://t.co/jRvUBS3mgB \"I find it utterly baffling that universal healthcare is such a political hot potato on your side of the pond,\" writes Dr. Adam Kay (@amateuradam), who used to practice in the U.K. https://t.co/PeHD6Cd3mi 'Man these LA 🔥 aren't no joke.' LeBron James forced to evacuate amid California wildfires https://t.co/cZACO7o9IZ California Rep. Katie Hill resigns amid ethics probe https://t.co/M0LQU3W2Pf “My company wanted to show a tampon string in an ad. Major TV networks told us to remove it,” writes @shethinx CEO Maria Molland https://t.co/BzftVly3if Column: The U.S. and China need to put aside their rivalry and focus on the common enemy of climate change https://t.co/AX3RytwFLp \"'Jojo Rabbit' is an entreaty to stay vigilant, and to live up to the ultimate epitaph: They did what they could,\" writes TIME's @szacharek https://t.co/1sPHcNH2G2 How a new class of trans male actors are changing the face of television https://t.co/E8RyOy1ALy \"Bacteria never went away, and all organisms, including us humans, have had to learn to live with them. Today, the lessons they are teaching us could change the trajectory of human health for generations\" https://t.co/La0GJoPWuh \"While the basic idea of learning from failure is supported by evidence, the sink-or-swim method doesn’t really work,\" writes Diane Tavenner https://t.co/93LW0FKHKi This Japanese skateboarder thought her career would be over after a devastating injury. But now she’s poised to compete in the 2020 Olympics https://t.co/Ttd0edw22Y What it’s like living in one of the hottest cities on Earth — where it may soon be uninhabitable https://t.co/UJkdwQW8TU https://t.co/7OWNK1fqlg https://t.co/qq41g6YOJ9 Stunning wealth gaps and poor services are behind Chile's protests https://t.co/XqBZfBAnlo Artificial intelligence has the potential to radically change health care, writes Microsoft's Geralyn Miller https://t.co/s7ugJz2lqo Though juice was once a cornerstone of a balanced breakfast, its place at the table has been looking a bit precarious these days. But is a glass of OJ really a big deal? https://t.co/S4XtRagDKV An individual’s ZIP code can be a more accurate driver of health than their genetic code, writes @BernardJTyson https://t.co/TfIT7v5i7J Tiger Woods ties Sam Snead's record of 82 PGA Tour wins https://t.co/PjU2Spdjs2 “The capabilities are still there.” Why Cambridge Analytica whistleblower Christopher Wylie is still worried https://t.co/lu37Mk5aEE \"One abiding characteristic of most of the ten admirals in my book is that they were thoughtful, intellectually grounded individuals,\" writes @stavridisj. \"Perhaps the long periods at sea that almost all of them experienced have something to do with that\" https://t.co/B7MFHSRVnj What the history of beards reveals about the changing meaning of masculinity https://t.co/S21dzaJ5bG The best karaoke songs for singers and non-singers alike https://t.co/KS4M1WpO2G How the AIDS crisis changed the dynamic between gay men and women, as told in Edie Windsor's posthumous memoir https://t.co/ljwJYh8or6 These are the World’s 100 Greatest Places of 2019, featuring the best in restaurants, hotels, theme parks and more https://t.co/8RAqiSWdFu Why did Christianity thrive in the U.S.? https://t.co/OYJvUQJHjl For all the promise of CRISPR, ensuring responsible use is an ongoing challenge, writes Jennifer Doudna https://t.co/8tPU5D2mTm Low wages, sexual harassment and unreliable tips. This is life in America’s booming service industry \n\nProduced in partnership with @fullerproject \nhttps://t.co/Qq9xgISkLk A Dutch inventor has unveiled a device that scoops plastic out of rivers https://t.co/GNfb9yHyJl “It looks like we’re planning our extinction right now. And nobody’s actually confronting the nightmare,” says @DeepakChopra as he discusses new book “Metahuman: Unleashing Your Infinite Potential”  https://t.co/DU0ZgHTekp Southwest pilots streamed video from a bathroom cam, a lawsuit alleges https://t.co/DVYOGZQK4X While Bernie Sanders won New Hampshire in 2016 by more than 20 points, Elizabeth Warren is currently leading in the state by a hair, partly because of her cross-generational support  https://t.co/D9MlS002n3 Conservatives say Fasiki’s images are degrading, but she wants to draw attention to society’s obsession with how women present themselves https://t.co/5wzvXQEmFc America's founders disagreed about impeachment. Here's how the idea made it into the Constitution https://t.co/75BLpowGpD Boris Johnson is hoping for a Dec. 12 election after being forced to delay Brexit. Here's what happens next https://t.co/MvDxlv2GGj These are the 10 best Nintendo Switch games to buy right now https://t.co/iFRXfxhud0 Angelina Jolie: \"When it comes to women's health, medical advances are only one part of the picture. Mental and emotional health, and physical safety, are just as important\" https://t.co/MwIH2JetAb \"Half a century after women’s liberation, with peace between the genders more elusive than ever, 'Mrs. Fletcher' affirms that the bond between moms and their boys is a crucial piece of the puzzle,\" writes TIME's @judyberman https://t.co/331RkRcGJy \"To understand why Chile’s unrest is especially worrisome for other middle-income countries, look to the larger problem of unfairness,\" writes @ianbremmer https://t.co/cEPwEYjPCY As with polio, AFM is seasonal—though unlike polio, it arrives in late summer and early to mid fall, rather than in the spring and summer https://t.co/2wYpsKVx7s Abu Bakr al-Baghdadi is dead. Here’s what to know about the deceased Islamic State leader https://t.co/4vES4ZM6Hd Robert Chelsea turned down the first face he was offered. It had belonged to a man with skin that was much fairer.\n\nIt took more than a year for Chelsea to get a second call. He’s the first African American to receive a face transplant https://t.co/bKpUxmk2Gt She was in a secret society at Yale. Her latest novel explores the dark and mysterious world of the Ivy League https://t.co/wC0HGmvTCt California’s governor declares a state of emergency as wildfires rage across the state. Here’s a map of all the big blazes https://t.co/t3YRAvA2w2 Review: HBO's \"Watchmen\" is the smartest superhero story since \"Black Panther\" https://t.co/H1vbMydpko 'Resiliency, strength and community collaboration’: How Tree of Life synagogue is moving forward 1 year after tragedy https://t.co/CjZbKIJ6TL “Ever since @BTS_twt’s debut, they’ve never suddenly switched gears or changed pace,” founder and co-CEO of @BigHitEnt Bang Si-hyuk tells TIME. “They don’t shy away from speaking about the pain felt by today’s generation” https://t.co/wdipd9dL5s \"When Elijah Cummings spoke, members listened. They wanted to hear his words,\" writes Rep. John Lewis https://t.co/wciqYbX0Qq When tights first became a wardrobe staple, they signified something that went far beyond a simple change of season: freedom https://t.co/sGeOHHnrjx Speaker Pelosi says White House kept Congress in the dark on al-Baghdadi raid, but Informed russia https://t.co/gj1U592Z1G A new wave of electricity–based strategies could expand to help people with some of the most widespread chronic diseases in the world, including high blood pressure, arthritis, diabetes and more https://t.co/2HUFpuLNOV “How many voices do we need? How many more traumas do we have to debate until someone listens?” writes @lyzl https://t.co/WxKmDoVSV6 Impeachment is consuming the political oxygen in Washington, and GOP leaders are concerned that the White House doesn’t know how to manage it, according to several high-level Republican aides https://t.co/DbRqmahucI 13th-century masterpiece found in French woman's kitchen sells for $26.6 million https://t.co/Kv6hXiE7ok 'Saturday Night Live' holds a Trump New Mexico rally because he 'heard they're building a wall' in Colorado https://t.co/JXijqtIMmP Stop me if you've heard this one: a robot and a team of Irish scientists walk into a senior living home https://t.co/g5IhksRTUy Tens of thousands march in Spain to protest separatist movement https://t.co/PWZ0xAl4Fq \"Our world has never witnessed a time of greater promise for improving human health,\" @NIHDirector Dr. Francis S. Collins writes. \"Despite this astounding progress, much more remains to be done\" https://t.co/QWdT6LYwXc Listen to new music from @selenagomez, @KeshaRose, @rexorangecounty and more https://t.co/iYeX5f5aQu British opposition parties propose Dec. 12 election to force Brexit divorce deal delay https://t.co/9NPf2qGnRW 'He died like a dog': President Trump announces ISIS leader Abu Bakr al-Baghdadi dies in U.S. military raid https://t.co/GcPh1fYMJX \"I don't believe in limits.\" Marathoner Eliud Kipchoge on breaking the two-hour barrier https://t.co/stko9e61Ck HBO’s #Watchmen is already shaping up to be one of the most mysterious, compelling and controversial shows of 2019. Here’s everything you need to know about the graphic novel in order to get the most out of the television series https://t.co/skK7w0Nl01 After Amazon region bishops push for married priests, Pope Francis urges openness to change https://t.co/my9NgrOEfX North Korea says it's running out of patience with U.S. 'Cold War mentality' https://t.co/Vs8fNtzIva Former White House Chief of Staff John Kelly says he warned Trump of impeachment https://t.co/LN1sZN34uH 2 dead, at least 14 injured in Texas A&amp;M University-Commerce homecoming party shooting https://t.co/51iZPsdn58 .@pabllovittar has seamlessly integrated the personal with the cultural and political, and is using her platform as a musical star to demand equality for LGBT communities in Brazil and beyond https://t.co/AlV9NRvS9j The true story behind the Netflix movie “The King” https://t.co/8jQrp0lnPv Nintendo, arguably stronger than ever and with a stock price flirting with its five-year high, is now looking for yet more ways to tap its deep bench of intellectual property, from a theme park to a feature-length film https://t.co/EGemPxbWYq \"My mom warned me about anti-Semitism. I didn’t fully understand until last year’s synagogue shooting,\" writes Rabbi Hara Person https://t.co/FKh1mXlQoq After photographer Alyona Kochetkova was diagnosed with an aggressive form of breast cancer in July 2017, she decided to turn the camera on herself and document her treatment https://t.co/iQj34oahH9 “We have to produce journalism worth paying for.” How A.G. Sulzberger is leading the New York Times into the future https://t.co/vHPkmA04Nc .@aliwong's debut memoir \"leaves no taboo or intimate topic untouched, from Wong’s sexual experimentations and misadventures in self-grooming to her heartbreaking miscarriage and the impact of her father’s death\" https://t.co/qqL3OXxeqt A study suggests tainted talcum powder can cause a rare cancer. Here's how it could play out in the courtroom https://t.co/91r8dXAZYP President Donald Trump teased a major announcement, tweeting Saturday night that \"Something very big has just happened!\" https://t.co/xZvgS5F66s Google has achieved “quantum supremacy.” Just what the heck is that? https://t.co/x2CEM9FqOF Here are a few pointers from pro photographers to keep in mind while you point and shoot with a wide-angle lens https://t.co/LOAicxiU42 “The end goal is closing the gap between the hospitals and the patients.” Meet the man whose bloodless test is revolutionizing the fight against malaria https://t.co/zRH6FKDpjA https://t.co/uMl6UZxK52 Even before Bernie Sanders' heart attack rocked his campaign in early October, a large chunk of his 2016 supporters were already shopping for another candidate https://t.co/mpX1xCwZyi \"What does the Pixel 4 do that its competition can’t? Besides taking fantastic photos, using new gesture-detecting radar, and giving users an improved software experience thanks to advancements in AI and machine learning, not much\" https://t.co/TNEdvtjlmn The 20 best Halloween TV episodes of all time https://t.co/i7QF7d0gvN One of the issues that the 2020 Democratic presidential candidates are generally split on is whether it could potentially be a good idea to add Justices to the U.S. Supreme Court or to nix Justices’ life-long terms. Here's the history of court packing https://t.co/34NYUJZo4K The 13 interlinked stories in \"Olive, Again\" embrace both new and familiar characters navigating the struggles that arise in everyday life https://t.co/4Ldk5iLorl “The idea was to get rid of me”: Justice Clarence Thomas speaks about his confirmation fight in new documentary https://t.co/3MUthLWNvY Two-time Academy Award-winning actor Jessica Lange is also an accomplished photographer. She discusses her photographic tribute to her Midwestern roots in \"Highway 61\" https://t.co/mXNFaJ0CIT Whether by sheer luck or keen prescience, Bong Joon-ho's “Parasite” is the movie for right now, writes @szacharek in her review https://t.co/EYfKb4puVZ “How to return a farm to the wild, watch nature return—and maybe find a way to save the planet,” https://t.co/wfUEDZ1uE1 \"As long as we remain in the shadows, people will continue to view us as the 'other' or as newcomers, but it’s not that we are newly arrived in America — it’s that America hasn’t recognized our existence,\" writes author @julissaarce https://t.co/bledGaE8AV How old is your pet in human years? The answer is a little complicated, according to a vet https://t.co/s8VEo8Ko6s By now, the nine members of K-pop powerhouse TWICE have grown accustomed to setting and breaking their own records. The group recently spoke to TIME about their new direction https://t.co/7TbqlzIShv Khan had in roughly 24,000 words resurfaced an argument against monopolies that journalists such as Ida Tarbell had popularized more than a century ago https://t.co/c0XkYpEDVZ How did \"left\" and \"right\" acquire their political meanings? https://t.co/BZl5f3hdSh Why you really shouldn't kill the spiders in your home, according to an entomologist https://t.co/L2d8l5vKq4 Here's what young people all over the world say they want most in a partner https://t.co/qLoK8WmNu5 \"I created a system to make sure my husband and I divide household duties fairly. Here's how it works\" https://t.co/tprbnI3nWE Get to know the winner of Netflix's \"Rhythm and Flow\" https://t.co/oGFrjSChST In \"Joker,\" black women are visible but they are not seen https://t.co/brl5yvGDZc President Trump keeps tweeting about Syria's oil fields. Here's what's going on with them https://t.co/Lq9FYLuc97 Here’s what to know about Russia’s longest-reigning female ruler, including her political power and her power over men — the latter of which has generated more than its share of myths and misconceptions https://t.co/wCNEmswsR9 Answering all your burning questions about “Find Me,” with help from André Aciman https://t.co/wWFGDUhetW \"Photojournalism has never been better. We’ve been relentless, and we have to be relentless to get things moved along.\" Photographer Annie Leibovitz discusses the democratization of photography, her influences and her Google Pixel campaign https://t.co/xUvWrUvnXq .@chancetherapper will do double duty as both host and performer tonight, for his third time on the show https://t.co/U1lnmKzoFU 100 days before the caucuses, Pelosi visits Iowa to discuss the impeachment inquiry and 'healing' a divided country https://t.co/3TX0fRwd5b Time's Up calls on NBC to release former employees from NDAs, hold independent investigation https://t.co/PY3xbJInEb \"'The Outer Worlds' doesn’t tell a simple good-versus-evil story that substitutes corporations for the evil. It’s more complicated than that\" https://t.co/a3QU6yH4nD Hulu's adaptation of the John Green novel brings subtle, but critical, updates for a new generation https://t.co/5uNtOUiaLj For Theodore Roosevelt it was love at first sight. Which was saying a lot, since Roosevelt’s first sight of the West didn’t show the region to best effect https://t.co/sF9asIfVi5 The Ocean's health is in deep trouble, Peter Thomson writes. Here's how you can help https://t.co/8MKlErMwSM 7 more killed in Iraq as anti-government protests continue https://t.co/4672VYrhPb Jane Fonda accepted a BAFTA award while being arrested for protesting inaction on climate change https://t.co/1GbEIiM9Al “The work of these women surrounds us, even though many of their names have faded from our consciousness, often replaced by those of the men they worked with,” writes @NathaliaHolt, author of “The Queens of Animation” https://t.co/Z1vDgU7BFs Russia calls U.S. move to protect Syrian oil fields 'banditry' https://t.co/k95YOJxYOt \"How your obsession with short-term results can hurt you in the long run\" https://t.co/6dhQgxN3Mt 67 killed in Ethiopia, 213 more injured, after days of unrest: Police https://t.co/MqKeLX6w9y When Adrienne Brodeur was 14 years old, she learned that her mother Malabar was having an affair with her stepfather’s best friend  https://t.co/9gTJchF6M9 “I ran the VA under President Trump until he fired me. Our first Trump Tower meeting was a job interview unlike any other” https://t.co/zp4iH0cAzZ We broke down every second of the final trailer for #StarWarsTheRiseofSkywalker https://t.co/Qp9Q40GSOR 12 innovations that will change health care and medicine in the 2020s https://t.co/HmKU8n68iR Trump held a rally at a Historically Black College, and most students were asked to stay inside their dorms\n https://t.co/vYX0UsnALf “It played out like a psychological thriller. And yet it was true,” Ed Perkins, the director of “Tell Me Who I Am,” tells TIME https://t.co/NAaFmggfCK Looming strong winds could lead to more blackouts for Californians, utility company says https://t.co/L9dZ3rHXy9 We asked pastry chefs what to serve for the most memorable Halloween party to haunt your friends forever https://t.co/2blQAGIcsJ Energy Secretary Rick Perry defends urging Trump to make Ukraine call https://t.co/wcYbbkjNcc Bernie Sanders’ campaign is looking strong. But can he grow his base? https://t.co/fL3Osw1cMO The Wing’s glossy aesthetic is a new addition to a recent crop of clubs springing up in London, reinventing the concept of the traditional gentlemen’s club https://t.co/P7bqWG92VY Pentagon awards Microsoft $10B 'war cloud' deal, snubbing Amazon https://t.co/OeisLZHdcd André Aciman on “Find Me,” his return to the lovelorn world of “Call Me By Your Name” https://t.co/yRx3Btsuiq Russian agent Maria Butina returns to Moscow after U.S. deportation https://t.co/K6UVWRkm6P \"Companies should not be so greedy.\" Some in the oil and gas industry fear Trump's aggressive deregulation could haunt them https://t.co/JAxmTdqvN2 \"Everything about this game demo seemed to come from a place of reverence for the original game, while also striving to make a blockbuster modern experience\" https://t.co/ICyrUA7FGQ “Science isn't always perfect, but we should still trust it,” writes author Naomi Oreskes https://t.co/C7TLi2i7i5 How to make your phone's battery last longer https://t.co/eXl433n9bg For foodfluencers, writing a cookbook, like plugging a grocery chain, is one more way to monetize audiences https://t.co/aKqF6eucC9 Lee claims that 3-D is a fundamentally different art form from 2-D — and he believes that the shared movie-theater experience still possesses an unmatched power https://t.co/hM3ywocq7n “They fear another genocide.” Iraq's Yezidis confront the prospect of an ISIS resurgence https://t.co/DwzL4AVMSk TIME has broken down the major new and existing streaming services by cost, pros and cons, ideal audiences and what look to be the most promising or popular original shows and movies on each one https://t.co/dTVT0FrIFQ The surprising history lesson hidden in Emily Post's “Etiquette” https://t.co/fDU5iVl39q Scary movie junkies, rejoice! The year ahead is packed with fright fests that will have you peeking over your shoulder and checking to make sure all the doors are locked — as all good horror movies should https://t.co/HHueUvWy1a Here's everything to know about the status of family separation at the U.S. border, which isn't nearly over https://t.co/XFfsKLJRnt These are the most popular Netflix series and movies (according to Netflix) https://t.co/GZzh2sIDTK Argentina elections 2019: Who's running, what's at stake https://t.co/Wh90aZqz0t Here's the history behind \"Jojo Rabbit\" and what it was really like to be in the Hitler Youth https://t.co/9JS6Q6Yn3A The true story behind the Netflix movie “The King” https://t.co/rsfT1Txesf Review: In its final season, “BoJack Horseman” proves why it's the most important animated show since “The Simpsons” https://t.co/DplXD8aiNc Read J.K. Rowling's full remarks on why “orphanage tourism” needs to end https://t.co/YgAA6JTbTS “My company wanted to show a tampon string in an ad. Major TV networks told us to remove it,” writes @shethinx CEO Maria Molland https://t.co/qcOGeoFEKL \"Half a century after women’s liberation, with peace between the genders more elusive than ever, 'Mrs. Fletcher' affirms that the bond between moms and their boys is a crucial piece of the puzzle,\" writes TIME's @judyberman https://t.co/wMDnnZWw82 With “Call of Duty: Modern Warfare,” gaming's most successful franchise grows up https://t.co/KuSlmfuoHG Answering all your burning questions about “Find Me,” with help from André Aciman https://t.co/PK9D6QMOWe PG&amp;E admits it might be the cause of Northern California wildfire despite preventative blackouts https://t.co/5eiPsCvjfF Man in Forrest Gump costume running off a baseball field knocks it out of the park https://t.co/Q2m6MNVdHb How Biogen's discontinued Alzheimer's drug got a second life https://t.co/WvIycM0YDK The total number of family separations since July 2017 is up to nearly 5,500 https://t.co/DaWap9K7xC DNC raises qualifying requirements for December Democratic presidential debate https://t.co/QQv3TtRNVa “Get home or I’m going to have you committed”: Man's love of Halloween is too much for his wife https://t.co/t6fHaHcyHc Trump administration has separated 1,556 more migrant children than previously known  https://t.co/hE06TUXQwG An Ohio athlete posted her personal best at a high school cross country meet. Then she was disqualified for wearing a hijab https://t.co/2uKmZHxiYy Hulu's adaptation of the John Green novel brings subtle, but critical, updates for a new generation https://t.co/ZgxiQvkz45 Chinese orienteering team disqualified for \"extensive cheating\" during Military World Games https://t.co/iHthwiV8PU We asked pastry chefs what to serve for the most memorable Halloween party to haunt your friends forever https://t.co/UWPR3yArA5 The Russian Defense Ministry says a soldier killed eight of his comrades and wounded two others in a shooting outburst at a base in Siberia before being apprehended https://t.co/cactggm3My A school principal an 15 others were sentenced to death in Bangladesh for setting a student on fire https://t.co/7mS0Xp2xib \"The human stories revealed in the kapo trials demonstrate the complexity of the position of victims, a complexity that we must comprehend if we wish to truly try to understand—and to the degree possible—overcome the Holocaust\" https://t.co/dhniguFP0M California wildfires have engulfed thousands of acres across the state. Here's a map of all the big blazes https://t.co/FB53RALuZV Trump administration banning U.S. flights to all Cuban cities bar Havana https://t.co/NODjkyJi7V The Trump Organization says it will consider offers to buy it out of a 100-year lease of the Washington D.C. hotel, partly to avoid criticism over conflicts of interest https://t.co/L5wpCTxzHt Maria Butina is expected to be immediately deported to Russia now that she has finished her 18-month sentence https://t.co/zc3VeP2m3l Listen to new music from @selenagomez, @KeshaRose, @rexorangecounty and more https://t.co/nDJbNdys46 While Bernie Sanders won New Hampshire in 2016 by more than 20 points, Elizabeth Warren is currently leading in the state by a hair, partly because of her cross-generational support  https://t.co/HWiwp9Uxax A judge ordered the Justice Department to give the House secret grand jury testimony from special counsel Robert Mueller‘s Russia investigation https://t.co/kslmIq5Ddd The federal deficit for the 2019 budget year surged to $984.4 billion, and is widely expected to top the $1 trillion mark in coming years https://t.co/usmjd7c9ZI Actress Felicity Huffman was released Friday morning from a federal prison in California two days before the end of a two-week sentence for her role in the college admissions scandal https://t.co/IPUMtdCRr2 Here's everything to know about the status of family separation at the U.S. border, which isn't nearly over https://t.co/j1Uv24gnX4 Just one year after a gunman killed 11 people inside Pittsburgh’s Tree of Life synagogue, congregants have outlined tentative plans to reopen the house of worship  https://t.co/8AHa5XYsB8 Argentina elections 2019: Who's running, what's at stake https://t.co/6d8dwNJCQp Since the protests in Chile erupted last week, at least 18 civilians have been killed and thousands have been arrested https://t.co/nwwTB0oHJK RT @rachael_bunyan: Protests in Chile have entered their eighth day and have so far left at least 18 dead. This the most violent unrest Chi… Read J.K. Rowling's full remarks on why “orphanage tourism” needs to end https://t.co/Np7P5XzvPR RT @timeforkids: This week's TFK cover story was reported from La Lima, Honduras, with the support of the @PulitzerCenter. Executive editor… This year marked Heidi Klum's 20th annual Halloween party, and her costume game was as strong as ever https://t.co/qBdAKA8FrT Barack Obama honors late Rep. Elijah Cummings at his funeral https://t.co/Aa8Mwy3XY7 https://t.co/EFoQDsGfmk The surprising history lesson hidden in Emily Post's “Etiquette” https://t.co/IKKXTjpxwT The new season of “Bojack Horseman” hit Netflix today. Read TIME's review https://t.co/hD1Cr2C27d 4th person arrested in connection to the 39 bodies found in U.K. truck https://t.co/eciiwmkVFT Trump speaks at the 2019 Second Step Presidential Justice Forum in South Carolina https://t.co/n9IEgHyEtL The true story behind the Netflix movie “The King” https://t.co/Tko5WXPwQt Barack Obama honors Elijah Cummings at his funeral: His voice mattered most when things looked difficult https://t.co/yXqkUZkbHi California wildfires have engulfed thousands of acres across the state. Here's a map of all the big blazes https://t.co/lK3SVaFgRu \"My mom warned me about anti-Semitism. I didn’t fully understand until last year’s synagogue shooting,\" writes Rabbi Hara Person https://t.co/9AIJzFtc2n Trump golf club could lose liquor license for allegedly over serving man before fatal drunken driving crash https://t.co/8otQaCnTEG Hulu's adaptation of the John Green novel brings subtle, but critical, updates for a new generation https://t.co/LEg9uyKcWo “Get home or I’m going to have you committed”: Man's love of Halloween is too much for his wife https://t.co/dTLFDCBoob This weekend, @chancetherapper will do double duty as both host and performer on Oct. 26, for his third time on the show https://t.co/BGTKd2UhYc RT @suyinsays: A new study from @Brandwatch and @DitchtheLabel analyzed 10 million online posts over 3.5 years. It found a torrent of 1.5 m… DNC raises qualifying requirements for December Democratic presidential debate https://t.co/vRsrMMVBUb Late Chicago abortion doctor under fire after thousands of fetal remains found in his garage, trunk https://t.co/LxoJv2XyrW How Biogen's discontinued Alzheimer's drug got a second life https://t.co/SwYmSZuGq1 Answering all your burning questions about “Find Me,” with help from André Aciman https://t.co/6fK8rkQrQD PG&amp;E admits it might be the cause of Northern California wildfire despite preventative blackouts https://t.co/IlTLTDi7b4 2 more arrested in connection to the 39 bodies found in U.K. truck https://t.co/eZARzyAfLz California wildfires have engulfed thousands of acres across the state. Here's a map of all the big blazes https://t.co/X6kvYjiadW https://t.co/KlXZzZQ5fu Man in Forrest Gump costume running off a baseball field knocks it out of the park https://t.co/jDzgCKPgKf Meet John Durham, the man tasked with “investigating the investigators” https://t.co/APdDsJAqXV Funeral of Rep. Elijah Cummings is held at New Psalmist Baptist Church in Baltimore https://t.co/ULT4irk5eB Today's Word of the Day with @MerriamWebster is “coruscate” https://t.co/OJmI368dQo 12 innovations that will change health care and medicine in the 2020s https://t.co/sFBgLc70wA We asked pastry chefs what to serve for the most memorable Halloween party to haunt your friends forever https://t.co/GpH6FLwGXG Boris Johnson is hoping for a Dec. 12 election after being forced to delay Brexit https://t.co/xYGN73dnwZ RT @AlexJamesFitz: Call of Duty: Modern Warfare is out today. Here's me in this week's issue of @TIME on the game's surprisingly mature sto… For foodfluencers, writing a cookbook, like plugging a grocery chain, is one more way to monetize audiences https://t.co/KfKHqDTBIF Boris Johnson is hoping for a Dec. 12 election after being forced to delay Brexit. Here's the latest https://t.co/KFtxebjyGA \"Half a century after women’s liberation, with peace between the genders more elusive than ever, 'Mrs. Fletcher' affirms that the bond between moms and their boys is a crucial piece of the puzzle,\" writes TIME's @judyberman https://t.co/sUAcOKOaNh A study analyzed 10 million online posts over 3.5 years. It found a torrent of transphobic abuse   https://t.co/cqN5UgXX9J “They fear another genocide.” Iraq's Yezidis confront the prospect of an ISIS resurgence https://t.co/ctzcXrt9iZ California's power shutoffs might prevent wildfires. But are they worth the risks? https://t.co/jEqC2gntY9 \"'Jojo Rabbit' is an entreaty to stay vigilant, and to live up to the ultimate epitaph: They did what they could,\" writes TIME's @szacharek https://t.co/kwssTgaTw1 \"Bacteria never went away, and all organisms, including us humans, have had to learn to live with them. Today, the lessons they are teaching us could change the trajectory of human health for generations\" https://t.co/HFSQDZeFj2 Over the past 60 years, the list price of a vial of insulin has gone from about 75¢ to $250. These biohackers have a plan to fix it https://t.co/cHm9e6k9KK Quilting community bands together to finish massive embroidery project after a call for help goes viral https://t.co/TcuROW5r8o Artificial intelligence has the potential to radically change health care, writes Microsoft's Geralyn Miller https://t.co/RpjsKUGj4M An individual’s ZIP code can be a more accurate driver of health than their genetic code, writes @BernardJTyson https://t.co/Xv5oJzi7h7 Big League umpire Rob Drake apologizes for his tweet threatening a civil war if Trump Is impeached https://t.co/6DBuUEl0mq \"The great myth is that the stock market crash caused the Great Depression. This is part of every schoolkid’s learning in social studies, but financial historians don’t think the evidence is very strong for that\" https://t.co/iVXiYHvBVc Australia's iconic rock Uluru has been climbed by tourists for the final time https://t.co/eZJLs5FrJO Boris Johnson is hoping for a Dec. 12 election after being forced to delay Brexit. Here's what happens next https://t.co/wS6Llcwldl A Virginia city has made headlines once again for its law designed to prohibit teens and adults from trick-or-treating https://t.co/jndOKgRRzH Tulsi Gabbard drops the congressional race to focus on the presidential one https://t.co/sQGKJTQg0x The NIH and the Gates Foundation pledged $200 million to bring gene therapies to patients who need them most https://t.co/x4lkGHPfTo People are binging on all of the eggs, fire, beer and attitude in Liu Shichao drinking videos https://t.co/bZZRYg8s6b Rep. Katie Hill admitted to having an “inappropriate” relationship with a female member of her campaign staff. She denies a separate alleged relationship with a congressional staffer that the House Ethics Committee is investigating https://t.co/k38aJP1Ewm https://t.co/MDC2mCvufn Hong Kong’s subway system was once the city's pride and joy. Now it's a target for violent protest https://t.co/AYCVTA6Khb For all the promise of CRISPR, ensuring responsible use is an ongoing challenge, writes Jennifer Doudna https://t.co/bftaM6V1s9 California wildfires have engulfed thousands of acres across the state. Here's a map of all the big blazes https://t.co/dzNPkRDwIJ Angelina Jolie: \"When it comes to women's health, medical advances are only one part of the picture. Mental and emotional health, and physical safety, are just as important\" https://t.co/jHvmq43C2f \"Companies should not be so greedy.\" Some in the oil and gas industry fear Trump's aggressive deregulation could haunt them https://t.co/xsRhZxldEW The medical field, which was once one of the most conservative professions, is becoming an unlikely hotbed of progressive political activity. \n\nOne of these advocates’ top goals? Medicare for All https://t.co/99lRLME1eb \"To understand why Chile’s unrest is especially worrisome for other middle-income countries, look to the larger problem of unfairness,\" writes @ianbremmer https://t.co/lM7rvTuVxh The move is likely to raise concerns that President Donald Trump and his allies may be using the government to go after their opponents\n https://t.co/xilffoklIH \"When Elijah Cummings spoke, members listened. They wanted to hear his words,\" writes Rep. John Lewis https://t.co/bGm5tA9OD1 A group of 30 fans held signs and wore shirts in support of anti-government protesters in Hong Kong. https://t.co/dqS6Qbl4NU A new wave of electricity–based strategies could expand to help people with some of the most widespread chronic diseases in the world, including high blood pressure, arthritis, diabetes and more https://t.co/5MYpU4ig9g Impeachment is consuming the political oxygen in Washington, and GOP leaders are concerned that the White House doesn’t know how to manage it, according to several high-level Republican aides https://t.co/TTibL4jndI With the newfound top-tier status of Lizzo's \"Truth Hurts\" has come increased scrutiny — and legal action https://t.co/CimVzro8bz Robert Chelsea turned down the first face he was offered. It had belonged to a man with skin that was much fairer.\n\nIt took more than a year for Chelsea to get a second call. He’s the first African American to receive a face transplant https://t.co/I36Hadc0PH The Aliens Act of 1905 created a new type of immigrant to the U.K. and a new way of dealing with them https://t.co/tpcinUuAXV Republicans are criticizing the current impeachment process. That highlights a bigger problem https://t.co/ODcfGYsfeg \"Our world has never witnessed a time of greater promise for improving human health,\" @NIHDirector Dr. Francis S. Collins writes. \"Despite this astounding progress, much more remains to be done\" https://t.co/hRREiPbVKI Arkansas hunter dies after deer he shot got up and attacked him https://t.co/BhilJ4gpjl These are the most popular Netflix series and movies (according to Netflix) https://t.co/3zGED0Z6S6 100-year-old WWII veteran belatedly honored for guarding tomb of the unknown soldier https://t.co/gjixQXGRYK “Science isn't always perfect, but we should still trust it,” writes author Naomi Oreskes https://t.co/cQqc4z0hGF For foodfluencers, writing a cookbook, like plugging a grocery chain, is one more way to monetize audiences https://t.co/d0wTRq73KQ Houston Astros fire assistant GM after outburst at female reporters https://t.co/ns0Qqhcpen Jimmy Carter is out of the hospital after third fall in recent months https://t.co/Es5wPMDYi9 Michigan couple with 21 grandchildren claim $80 million Powerball jackpot https://t.co/ZdrLUBhz3m Late Rep. Elijah Cummings becomes first African American lawmaker to lie in state at U.S. Capitol https://t.co/qxKDXyyxFm \"Half a century after women’s liberation, with peace between the genders more elusive than ever, 'Mrs. Fletcher' affirms that the bond between moms and their boys is a crucial piece of the puzzle,\" writes TIME's @judyberman https://t.co/xDS985hICD Victim of Wisconsin “slender man” attack to speak out for the first time, says she's “come to accept all of the scars” https://t.co/yCx0kuLffv Vaping-related death toll rises to 34 as health officials sound the alarm on e-cigarette use https://t.co/qSNFgPF84y NYPD officer fired over death of Eric Garner sues to get job back https://t.co/U02VoG1FiY “They fear another genocide.” Iraq's Yezidis confront the prospect of an ISIS resurgence https://t.co/W7jp4QI067 Saudi Prince tells U.S. Congress to get off their “high moralistic horses” https://t.co/n8dhHbH9tY \"'Jojo Rabbit' is an entreaty to stay vigilant, and to live up to the ultimate epitaph: They did what they could,\" writes TIME's @szacharek https://t.co/sXqLQMFeJb Video app TikTok may pose a national security threat, senators say https://t.co/rzo9IXpqFo \"I find it utterly baffling that universal healthcare is such a political hot potato on your side of the pond,\" writes Dr. Adam Kay (@amateuradam), who used to practice in the U.K. https://t.co/mdJGAc8Jz9 \"Bacteria never went away, and all organisms, including us humans, have had to learn to live with them. Today, the lessons they are teaching us could change the trajectory of human health for generations\" https://t.co/t2HjjixFbk \"We are on the verge of something truly transformational. The first survivor of Alzheimer’s disease may be reading this story now,\" writes Dr. Maria Carrillo.\n\nIn partnership with #TIME100Health Summit Knowledge Partner @alzassociation \nhttps://t.co/KvfGV87fnF Over the past 60 years, the list price of a vial of insulin has gone from about 75¢ to $250. These biohackers have a plan to fix it https://t.co/dfzNtEMgfn Quilting community bands together to finish massive embroidery project after a call for help goes viral https://t.co/9XwF0byAym Artificial intelligence has the potential to radically change health care, writes Microsoft's Geralyn Miller https://t.co/Mg7xyMuQK3 An individual’s ZIP code can be a more accurate driver of health than their genetic code, writes @BernardJTyson https://t.co/SuFQmlG3Jp \"The great myth is that the stock market crash caused the Great Depression. This is part of every schoolkid’s learning in social studies, but financial historians don’t think the evidence is very strong for that\" https://t.co/E97dbMIxWZ Boris Johnson is hoping for a Dec. 12 election after being forced to delay Brexit. Here's what happens next https://t.co/4tYDOnOXqc Rep. Tim Ryan drops out of Democratic presidential race https://t.co/kKQxyTqyqp A Virginia city has made headlines once again for its law designed to prohibit teens and adults from trick-or-treating https://t.co/Xy6xxKVG2k The NIH and the Gates Foundation pledged $200 million to bring gene therapies to patients who need them most https://t.co/mT0UZCzuGB Syria says Turkish-led forces have attacked, killed government troops https://t.co/NSorQuid5e People are binging on all of the eggs, fire, beer and attitude in Liu Shichao drinking videos https://t.co/9xcuJRaIIB Rep. Katie Hill admitted to having an “inappropriate” relationship with a female member of her campaign staff. She denies a separate alleged relationship with a congressional staffer that the House Ethics Committee is investigating https://t.co/pN04MVjtJ7 https://t.co/7XlmNuEFE1 Google employees are accusing the company’s leadership of developing an internal surveillance tool that they believe will be used to monitor workers’ attempts to organize protests and discuss labor rights https://t.co/bEtY9TCu1w Amid accusations of Fraud, Bolivia's Evo Morales claims outright win in presidential vote https://t.co/SVYIg3ZN8w For all the promise of CRISPR, ensuring responsible use is an ongoing challenge, writes Jennifer Doudna https://t.co/jNYdCGwj7h European Union awards top human rights prize to Uighur activist Ilham Tohti https://t.co/YcVBeDZjaU https://t.co/j8pzeiqBXO Angelina Jolie: \"When it comes to women's health, medical advances are only one part of the picture. Mental and emotional health, and physical safety, are just as important\" https://t.co/tdOQ6F2Kbc European Union awards top human rights prize to Ilham Tohti for his work defending China’s Uighur minority, and urged Beijing to release him from jail https://t.co/csncNhvVqt RT @abbyabrams: Doctors used to be a conservative group. But spurred by economic and demographic changes—and our grossly broken health care… \"Companies should not be so greedy.\" Some in the oil and gas industry fear Trump's aggressive deregulation could haunt them https://t.co/p1MfuWXvAY .@the_wing opens its first international location in London today. Here's what's behind the revival of the city's private members' clubs https://t.co/WJXpQ2Dff0 The U.S. ambassador to Italy has returned to Italian officials the head of a statue stolen from an archaeological site in Rome in 1968 https://t.co/cLVkQeT9HW The medical field, which was once one of the most conservative professions, is becoming an unlikely hotbed of progressive political activity. \n\nOne of these advocates’ top goals? Medicare for All https://t.co/o8WeCOqiUK Today's Word of the Day with @MerriamWebster is “Noachian” https://t.co/1IW21C1gZv \"To understand why Chile’s unrest is especially worrisome for other middle-income countries, look to the larger problem of unfairness,\" writes @ianbremmer https://t.co/xah5YWkGU4 RT @suyinsays: Terribly sad updates in case of 39 found dead in a lorry container in Essex. @JCWI_UK tells @TIME responsibility ultimately… \"When Elijah Cummings spoke, members listened. They wanted to hear his words,\" writes Rep. John Lewis https://t.co/SEZwXfFX6H A new wave of electricity–based strategies could expand to help people with some of the most widespread chronic diseases in the world, including high blood pressure, arthritis, diabetes and more https://t.co/bJ5PoEYzju Rep. Alexandria Ocasio-Cortez grills Facebook CEO Mark Zuckerberg on false political ads https://t.co/MRmUZKp2pm Impeachment is consuming the political oxygen in Washington, and GOP leaders are concerned that the White House doesn’t know how to manage it, according to several high-level Republican aides https://t.co/nijqbQ4J26 Robert Chelsea turned down the first face he was offered. It had belonged to a man with skin that was much fairer.\n\nIt took more than a year for Chelsea to get a second call. He’s the first African American to receive a face transplant https://t.co/DeHNNjzAR8 \"Our world has never witnessed a time of greater promise for improving human health,\" @NIHDirector Dr. Francis S. Collins writes. \"Despite this astounding progress, much more remains to be done\" https://t.co/yiFUf5stgq RT @Jamie_Ducharme: In July, Robert Chelsea became the first African American face transplant recipient in history. It was an honor to spen… A fast-moving wildfire in Sonoma County shows no signs of slowing. Here's what to know https://t.co/grs3yj1EoK https://t.co/WFN3U7YOuL RT @naina_bajekal: \"It’s apple season in Kashmir, but in orchards across the fertile Himalayan valley, unpicked fruit rots on the branches.… RT @suyinsays: Today @the_wing opens its first international location in London. I dig into the colourful history of members' clubs in the… \"I don't believe in limits.\" Marathoner Eliud Kipchoge on breaking the two-hour barrier https://t.co/rNZe3nte96 HBO’s #Watchmen is already shaping up to be one of the most mysterious, compelling and controversial shows of 2019. Here’s everything you need to know about the graphic novel in order to get the most out of the television series https://t.co/GSFP9Q0hiF 39 people found dead in a truck in the U.K. are believed to be Chinese nationals\nhttps://t.co/5iqo2RtMLl When Adrienne Brodeur was 14 years old, she learned that her mother Malabar was having an affair with her stepfather’s best friend  https://t.co/gUVclclfiS TIME’s new cover: Introducing the health innovation issue, featuring caregiving robots, electrifying medicine, insulin hacking and more https://t.co/N413gcVjmU https://t.co/DIN949q5mw Work began this morning to exhume Francisco Franco from the Valley of the Fallen, against the wishes of his family and many conservatives https://t.co/6ZMZU9uheL These are the most popular Netflix series and movies (according to Netflix) https://t.co/rPKJnZhxjZ Here's what young people all over the world say they want most in a partner https://t.co/yoWsIV3CT9 A fast-moving wildfire in Sonoma County shows no signs of slowing. Here's what to know https://t.co/t0xi7ZkcOH Italy's female soccer stars are fighting to change the law that limits their pay to $33,000 https://t.co/v3fnacx2gV Whether by sheer luck or keen prescience, Bong Joon-ho's “Parasite” is the movie for right now, writes @szacharek in her review https://t.co/vdUWqZh8IH U.K. police make raids in Northern Ireland in connection with 39 found dead in truck  https://t.co/5H1FKZ0Me2 TIME has broken down the major new and existing streaming services by cost, pros and cons, ideal audiences and what look to be the most promising or popular original shows and movies on each one https://t.co/i7Cwg1ItcS Jessica Biel revealed she was not much of a fan of her husband Justin Timberlake's super-popular boy band https://t.co/hKOSzd18bj Google has achieved “quantum supremacy.” Just what the heck is that? https://t.co/5kHoy0Lhfl Police shooting outside El Paso Walmart leaves shoppers stuck in store https://t.co/uZfLBVEG9q As India slowly eases its clampdown on Kashmir, people are bracing themselves for what's next https://t.co/DmBICSdvt0 President Trump's record 2020 cash isn't trickling down to vulnerable Senate Republicans https://t.co/tW860gBKYQ .@aliwong's debut memoir \"leaves no taboo or intimate topic untouched, from Wong’s sexual experimentations and misadventures in self-grooming to her heartbreaking miscarriage and the impact of her father’s death\" https://t.co/qp3rsea5VS “The idea was to get rid of me”: Justice Clarence Thomas speaks about his confirmation fight in new documentary https://t.co/FkvTOeNsQ5 Lebanese protesters say their politicians have stolen tens, or even hundreds, of billions of dollars from them, aided by laws that allow bank secrecy. Here’s what to know https://t.co/fRHLakYc6o After photographer Alyona Kochetkova was diagnosed with an aggressive form of breast cancer in July 2017, she decided to turn the camera on herself and document her treatment https://t.co/1P8JsfnL6J The trend in members’ clubs becoming more women-oriented comes against the backdrop of changing ways of working in the U.K.; a report earlier this year noted that the number of women turning to self-employment has risen by 57% since 2008 https://t.co/tKhieFUJe8 \"What does the Pixel 4 do that its competition can’t? Besides taking fantastic photos, using new gesture-detecting radar, and giving users an improved software experience thanks to advancements in AI and machine learning, not much\" https://t.co/sMiBizIKFZ “It played out like a psychological thriller. And yet it was true,” Ed Perkins, the director of “Tell Me Who I Am,” tells TIME https://t.co/Gxhnx11HDF It's a sum equivalent to the world’s military spending every 60 days https://t.co/99dxduVvnt \"One abiding characteristic of most of the ten admirals in my book is that they were thoughtful, intellectually grounded individuals,\" writes @stavridisj. \"Perhaps the long periods at sea that almost all of them experienced have something to do with that\" https://t.co/zGoErSGmGN Nearly 75 years later, Giichi Matsumura's remains may have finally been found https://t.co/bZKUJR0Q9O The best karaoke songs for singers and non-singers alike https://t.co/KS4M1WpO2G Rep. Katie Hill admits relationship with campaign staffer as House Ethics Committee launches investigation https://t.co/eUaaayn5cG “The work of these women surrounds us, even though many of their names have faded from our consciousness, often replaced by those of the men they worked with,” writes @NathaliaHolt, author of “The Queens of Animation” https://t.co/J5VQwzHgmw These are the World’s 100 Greatest Places of 2019, featuring the best in restaurants, hotels, theme parks and more https://t.co/8RAqiSWdFu Iran executed seven children last year and 90 children are on death row, U.N. human rights expert says https://t.co/szhDcQx0Wc On October 12, Kenyan marathoner Eliud Kipchoge attempted to become the first human in history to run 26.2 miles in under two hours.\n\nHe accomplished this breathtaking feat with relative ease, finishing the test in 1 hour, 59 minutes and 40 seconds https://t.co/XGBpCnQvlS Here’s what to know about Russia’s longest-reigning female ruler, including her political power and her power over men — the latter of which has generated more than its share of myths and misconceptions https://t.co/usqmyFxMhc America's founders disagreed about impeachment. Here's how the idea made it into the Constitution https://t.co/DAMoGcwhs7 .@pabllovittar has seamlessly integrated the personal with the cultural and political, and is using her platform as a musical star to demand equality for LGBT communities in Brazil and beyond https://t.co/FbfDwvUmT2 Nintendo, arguably stronger than ever and with a stock price flirting with its five-year high, is now looking for yet more ways to tap its deep bench of intellectual property, from a theme park to a feature-length film https://t.co/qT7xr1tdW8 Review: HBO's #Watchmen is the smartest superhero story since \"Black Panther\" https://t.co/wulO0ZVCUh 2 people dead after car falls from parking garage fourth floor in Indiana https://t.co/PkNaAIsk2M The House voting to impeach President Donald Trump will \"usher in an extraordinary logistical challenge for the six sitting Democratic Senators duking it out for their party’s presidential nomination in 2020,\" writes @Philip_Elliott. Here's how https://t.co/XSkr6GmoRJ “The end goal is closing the gap between the hospitals and the patients.” Meet the man whose bloodless test is revolutionizing the fight against malaria https://t.co/5fZciFFjS4 https://t.co/wrcpaV9cAn Joe Biden refocuses on white, working-class voters\n https://t.co/Mthz5xSl2V RT @andrewrchow: The winner of Rhythm and Flow opened for Kendrick 8 years ago(!), is SiR's brother(!!) and won an ASCAP award last decade(… Marijuana found at North Dakota nuclear missile facility https://t.co/2dTqvpfLLA “It played out like a psychological thriller. And yet it was true,” Ed Perkins, the director of “Tell Me Who I Am,” tells TIME https://t.co/UZRbU4wlSm Facebook CEO Mark Zuckerberg endured hours of questioning from lawmakers as he defended the company’s new globally ambitious project to create a digital currency https://t.co/zIKd9jP7nZ \"What does the Pixel 4 do that its competition can’t? Besides taking fantastic photos, using new gesture-detecting radar, and giving users an improved software experience thanks to advancements in AI and machine learning, not much\" https://t.co/I5DPNJIWkm RT @timeforkids: Mission Unstoppable is a new CBS TV show about women in STEM. Host Miranda Cosgrove spoke to TFK about why she thinks this… The trend in members’ clubs becoming more women-oriented comes against the backdrop of changing ways of working in the U.K.; a report earlier this year noted that the number of women turning to self-employment has risen by 57% since 2008 https://t.co/DR644JczPd After photographer Alyona Kochetkova was diagnosed with an aggressive form of breast cancer in July 2017, she decided to turn the camera on herself and document her treatment https://t.co/vIRciKwejR Republicans bring impeachment investigation to a temporary halt by storming closed-door deposition https://t.co/SmEwwFaFhE https://t.co/leLHCvzCYg Body of missing three-year-old Kamille \"Cupcake\" McKinney have been found in landfill, police say https://t.co/n4nZ7ZLOkt Rep. Katie Hill denies affair with aide, says Capitol Police investigating distribution of nude photo https://t.co/MRuKB96GeC These are the key U.S. and Ukrainian players in the Trump impeachment inquiry https://t.co/2anLDQZVyb Chaotic scene as Republicans disrupt closed-door impeachment deposition https://t.co/tgQPy6QDpd Lebanese protesters say their politicians have stolen tens, or even hundreds, of billions of dollars from them, aided by laws that allow bank secrecy. Here’s what to know https://t.co/61aTiKkgdv .@aliwong's debut memoir \"leaves no taboo or intimate topic untouched, from Wong’s sexual experimentations and misadventures in self-grooming to her heartbreaking miscarriage and the impact of her father’s death\" https://t.co/4jyqC2gajy “The idea was to get rid of me”: Justice Clarence Thomas speaks about his confirmation fight in new documentary https://t.co/jH7jDkH5Ia Trump Administration sues to block California's climate change agreement with Quebec https://t.co/WHbFwgsRxS While an incumbent President has never lost a primary nomination in modern U.S. history, these five challengers put up a serious fight https://t.co/mAGpg8P0ZG One of the issues that the 2020 Democratic presidential candidates are generally split on is whether it could potentially be a good idea to add Justices to the U.S. Supreme Court or to nix Justices’ life-long terms. Here's the history of court packing https://t.co/hzpPlWY8Sw “None of us expected it to still be there because it rained, it stormed.” How a dead “tree lobster” is taking over a college campus https://t.co/OZYB7rSodS If you or someone you know may be contemplating suicide, call the National Suicide Prevention Lifeline at 1-800-273-8255 or text HOME to 741741 to reach the Crisis Text Line. In emergencies, call 911, or seek care from a local hospital or mental health provider. 2 associates of Giuliani plead not guilty to illegal campaign donation charges https://t.co/Nx5LCnocmv “They all thought they were a burden and it was too hard to keep reaching out.” Amanda Johnstone lost too many friends to suicide. Now her app is saving lives https://t.co/R4Yx0jg77L Guest at Disneyland had measles, may have exposed others https://t.co/pXQSKdssZh Trump says Turkey will make ceasefire in Syria permanent https://t.co/IxcvEyHgr9 https://t.co/BUXCG7Y8ZN Trump Organization removes name from Central Park ice rinks in rebranding effort https://t.co/UDUgAkBrWE As India slowly eases its clampdown on Kashmir, people are bracing themselves for what's next https://t.co/qFdziBYoMw Google has achieved “quantum supremacy.” Just what the heck is that? https://t.co/MeJOup4946 Jessica Biel revealed she was not much of a fan of her husband Justin Timberlake's super-popular boy band https://t.co/DtwesQ1Anp Trump says Turkey will make ceasefire in Syria permanent https://t.co/7d6bQxiEKX Connoisseur of life itself Rihanna enjoyed McDonald's at the club https://t.co/DXDpdpmsPH Sex offenders sue sheriff's department over signs warning trick-or-treaters from their homes https://t.co/PiBHne9ejl Trump makes a statement on Turkey and Syria from the White House https://t.co/11fohWxsjg New York City police officer shot in bullet-resistant vest after 'violent struggle' with suspect https://t.co/DQGmzOdcep “Daryl Morey was right.” Shaquille O'Neal weighs in on NBA-China controversy https://t.co/45iWiOU8Tv Mom who promoted her ill 7-year-old daughter's “bucket list” indicted in her death https://t.co/uvJqK0LcCp Russian forces deploy at Syrian border under new accord, threaten Kurds with being “steamrolled” by Turkey https://t.co/LFXMe7FJv8 Kid pulls a political bait and witch on the NBA basketball dance came https://t.co/0j7K6bUGvp A murder investigation has been launched after 39 bodies were found in a truck in the U.K. https://t.co/LAZHOlqIl5 https://t.co/RrJxlMUUDg Today's Word of the Day with @MerriamWebster is “spoonerism” https://t.co/6Lqx5yYtQW “The idea was to get rid of me”: Justice Clarence Thomas speaks about his confirmation fight in new documentary https://t.co/EQMbBTl3wd Google says it has achieved “quantum supremacy,” a major landmark in the tech world https://t.co/Gz1hd1adZF Federal lawsuit alleges ICE agent raped and impregnated a Honduran immigrant on multiple occasions https://t.co/4GdTy7tMJt TIME has broken down the major new and existing streaming services by cost, pros and cons, ideal audiences and what look to be the most promising or popular original shows and movies on each one https://t.co/Un4MNSDdQ0 RT @rachael_bunyan: ‘I Cried Tears of Joy.’ My exclusive interview with Lindsay Dutton about her relief after the U.K. reverses its decisio… Missing West Point cadet found dead at military academy\n https://t.co/fciZNk230s Whether by sheer luck or keen prescience, Bong Joon-ho's “Parasite” is the movie for right now, writes @szacharek in her review https://t.co/JRID5i5Yq3 United Nations investigator: 11 million North Koreans are undernourished, food insecurity at an \"alarming level\" https://t.co/OsRkxFoAZi \"As long as we remain in the shadows, people will continue to view us as the 'other' or as newcomers, but it’s not that we are newly arrived in America — it’s that America hasn’t recognized our existence,\" writes author @julissaarce https://t.co/SLMRDEBTSI Gold medal-winning Paralympic athlete Marieke Vervoort dies by euthanasia https://t.co/oA9PCWFpCQ President Trump will give a speech at a police conference in Chicago. The city's Police Chief (who is hosting the event) is skipping it https://t.co/8BFwvHKSZq Here's what young people all over the world say they want most in a partner https://t.co/NhTiCOoiJ8 How did \"left\" and \"right\" acquire their political meanings? https://t.co/BZl5f3hdSh Get to know the winner of Netflix's \"Rhythm and Flow\" https://t.co/50w43UCIBB Why a plan to redefine the meaning of \"museum\" is stirring up controversy https://t.co/ZqP9EMEnVw Get to know the winner of Netflix's \"Rhythm and Flow\" https://t.co/fbgafzk4Qe A murder investigation has been launched after 39 bodies were found in a truck in the U.K. https://t.co/i37UWqx3RB Researchers discover second long-lost Japanese warship from historic World War II Battle of Midway https://t.co/Y6XfnK29wK 'I cried tears of joy.' British mother shares relief after U.K. reverses decision to deport daughter, 2 https://t.co/f1l4R2mZeV These are the most popular Netflix series and movies (according to Netflix) https://t.co/R0u90OCZom Hong Kong completes the process of withdrawing the extradition bill, but will it stop the protests? https://t.co/KbCfcoxqS7 https://t.co/1ZRecvjT4A \"Everything about this game demo seemed to come from a place of reverence for the original game, while also striving to make a blockbuster modern experience\" https://t.co/OEWgeg9N30 Russia sends two Tu-160 nuclear bombers to South Africa in a display of defense cooperation https://t.co/lPl88Dw5KM WeWork co-founder Adam Neumann pushed aside in $5 billion SoftBank takeover https://t.co/AllPswBxK4 When Adrienne Brodeur was 14 years old, she learned that her mother Malabar was having an affair with her stepfather’s best friend  https://t.co/hyLbxqSHDT Hong Kong completes the process of withdrawing the extradition bill, but will it stop the protests? https://t.co/Gja5NPMIr1 By now, the nine members of K-pop powerhouse TWICE have grown accustomed to setting and breaking their own records. The group recently spoke to TIME about their new direction https://t.co/5d4mj5LvBu A single car parking spot just sold in Hong Kong for almost a million dollars https://t.co/6Xe6xpOI2R HBO’s #Watchmen is already shaping up to be one of the most mysterious, compelling and controversial shows of 2019. Here’s everything you need to know about the graphic novel in order to get the most out of the television series https://t.co/cB4zr42xdu Is the stethoscope dying? High-tech rivals pose a threat to the symbol of the medical profession https://t.co/ZXyLBdJPUQ “It played out like a psychological thriller. And yet it was true,” Ed Perkins, the director of “Tell Me Who I Am,” tells TIME https://t.co/JdasZjUH5v U.S. Defense Secretary Mark Esper arrives in Baghdad to discuss troop deployments https://t.co/yumRQPydNV Lebanese protesters say their politicians have stolen tens, or even hundreds, of billions of dollars from them, aided by laws that allow bank secrecy. Here’s what to know https://t.co/eabADSDAyc These are the key U.S. and Ukrainian players in the Trump impeachment inquiry https://t.co/ZG2ZBpEg0d For Theodore Roosevelt it was love at first sight. Which was saying a lot, since Roosevelt’s first sight of the West didn’t show the region to best effect https://t.co/XQI9PZdznJ It's not the deep state that threatens Trump. It's the state https://t.co/CkTpzCZppI Nintendo, arguably stronger than ever and with a stock price flirting with its five-year high, is now looking for yet more ways to tap its deep bench of intellectual property, from a theme park to a feature-length film https://t.co/nfEBrvHqqK \"I don't believe in limits.\" Marathoner Eliud Kipchoge on breaking the two-hour barrier https://t.co/Zah5vhxoCQ .@ShawnMendes: “The magic of @taylorswift13 doesn’t come from the lights, dancers or fireworks (although all of that is incredible) but from the electrifying connection that she has with the people who are there to see her” #TIME100 https://t.co/O5UPFPKfDM China could replace Hong Kong's leader soon, a report claims https://t.co/d6Cxz5WsLh The murder suspect whose case sparked the Hong Kong protests has walked free—and into a diplomatic row https://t.co/KQLIgQfDh2 Here’s what to know about Russia’s longest-reigning female ruler, including her political power and her power over men — the latter of which has generated more than its share of myths and misconceptions https://t.co/3cy3jjI8fa Lawmakers have conflicting reactions after Trump likens impeachment inquiry to a \"lynching\" https://t.co/mYeqKPjH7u https://t.co/AKC9M4QczC Black security guard who was fired for using the n-word when telling a student not to use it will get his job back https://t.co/lK5w8sjykm Here's the history behind \"Jojo Rabbit\" and what it was really like to be in the Hitler Youth https://t.co/5pMclvhXAQ “I ask Prime Minister Sánchez to sit down and talk.” Carles Puigdemont writes for TIME on a way forward in Catalonia https://t.co/bqikTBucb6 “My company wanted to show a tampon string in an ad. Major TV networks told us to remove it,” writes @shethinx CEO Maria Molland https://t.co/tckBEdpr4O Review: HBO's \"Watchmen\" is the smartest superhero story since \"Black Panther\" https://t.co/90meO7Zgss Trump donor to plead guilty to concealing work as foreign agent https://t.co/iuxcWPjgo1 .@halsey on @BTS_twt: “Behind those three letters are seven astounding young men who believe that music is stronger than the barriers of language. It’s a universal dialect” #TIME100 https://t.co/RjzNk3x04r https://t.co/8SWz5n5teL U.S. highway deaths fall in 2018 for second straight year https://t.co/pJut3wSqUl Three people were sent to the hospital for evaluation, American Airlines confirmed to TIME https://t.co/eAkiZ2FrtG We broke down every second of the final trailer for #StarWarsTheRiseofSkywalker https://t.co/tBIVOwK6p7 \"Photojournalism has never been better. We’ve been relentless, and we have to be relentless to get things moved along.\" Photographer Annie Leibovitz discusses the democratization of photography, her influences and her Google Pixel campaign https://t.co/J8n5b0htH0 \"'The Outer Worlds' doesn’t tell a simple good-versus-evil story that substitutes corporations for the evil. It’s more complicated than that\" https://t.co/T8UggXAmTG Nike CEO Mark Parker to step down in January https://t.co/6L3ABHzkNq The new NBA season kicks off tonight. Not too long ago, teams formed “Big Threes” via trades and free agency signing to acquire NBA titles, writes @seanmgregory. “Now, power comes in pairs” https://t.co/C1yvmHEuHz Anonymous 'senior Trump administration official' and writer of infamous op-ed releasing 'unprecedented' book https://t.co/F1WPVLiL7G “When you go out and fight, you don’t just fight for yourselves, you fight for the children of this city and the children of this country,” Sen. Elizabeth Warren said as she joined Chicago teachers' strike https://t.co/fllz27xp1R RT @timeforkids: This week's TFK observes #BullyingPreventionMonth with a cover story on kindness. Also, see how recycled smartphones are b… Read acting ambassador to Ukraine William Taylor's opening statement, which was obtained by TIME, on Ukraine and Donald Trump https://t.co/uGWD0hXcRb Lori Loughlin indicted on new charge in college admissions scandal https://t.co/HEgQHht0vE \"Ultimately alarming circumstances\": Read acting ambassador to Ukraine Bill Taylor's full opening statement to Congressional investigators https://t.co/YbP7xNhr2Y On October 12, Kenyan marathoner Eliud Kipchoge attempted to become the first human in history to run 26.2 miles in under two hours.\n\nHe accomplished this breathtaking feat with relative ease, finishing the test in 1 hour, 59 minutes and 40 seconds https://t.co/A3UGFsqvMY Black security guard who was fired for using the n-word when telling a student not to use it will get his job back https://t.co/YIC6jewaUM Prince William is \"worried\" about Harry after interview about mental health https://t.co/bkqqNT5xXa Brexit is on track to be delayed after Prime Minister Boris Johnson lost a crucial vote in Parliament Tuesday https://t.co/vjgEqfMsUt “Sometimes I see a bus going by with a poster and think, ‘Damn, I look hot. Oh wait, it’s not me’” https://t.co/FxtD1L2rzB A 1946 mob lynching case in Georgia puts court focus on grand jury secrecy https://t.co/4ZOSk8Q7Mb “Expansion can’t happen without the freedom to try something new, and the courage to step into unfamiliar territory,” Nintendo President Shuntaro Furukawa tells TIME https://t.co/oRviHRX8Dt Authorities say Henry Thomas, the actor who starred as a child in “E.T. the Extra Terrestrial,” has been arrested for driving under the influence https://t.co/u5IBIWtdNG Lawmakers have conflicting reactions after Trump likens impeachment inquiry to a \"lynching\" https://t.co/mPqsKR91SH https://t.co/3QEDEsJNCM For Theodore Roosevelt it was love at first sight. Which was saying a lot, since Roosevelt’s first sight of the West didn’t show the region to best effect https://t.co/bLHLyhXv4V Multiple schools placed on lockdown after a 17-year-old was shot outside a California high school https://t.co/UGuoJHsfsR “The work of these women surrounds us, even though many of their names have faded from our consciousness, often replaced by those of the men they worked with,” writes @NathaliaHolt, author of “The Queens of Animation” https://t.co/7hHIiyU9Ct RT @AlexJamesFitz: I recently had the pleasure of chatting with Shuntaro Furukawa, Nintendo's sixth president, about the company's ambition… These are the key U.S. and Ukrainian players in the Trump impeachment inquiry https://t.co/awRwdb2NP1 When Adrienne Brodeur was 14 years old, she learned that her mother Malabar was having an affair with her stepfather’s best friend  https://t.co/mspTME4EFy One girl’s rap about her hamster, her cat and her crush has truly taken the art form to another level https://t.co/ETQ2bxwKFr One woman thought she was living in her own pre-Halloween spectacle when she noticed there appeared to be a ghost in her son's crib. But this spooky tale had a much happier ending  https://t.co/NZdhmWaQx0 “At first I was in shock, I couldn’t believe what I had just done.” Meet the well-intentioned man whose Pinterest-inspired engagement photos hilariously failed https://t.co/oi3hk6Co6O We broke down every second of the final trailer for #StarWarsTheRiseofSkywalker https://t.co/DRFgcXMG7N “It looks like we’re planning our extinction right now. And nobody’s actually confronting the nightmare,” says @DeepakChopra as he discusses new book “Metahuman: Unleashing Your Infinite Potential”  https://t.co/P4tjj9uju2 Diplomat who called Trump's Ukraine policy \"crazy\" gives detailed testimony in impeachment probe, House members say https://t.co/0cEIrmszCZ Lebanese protesters say their politicians have stolen tens, or even hundreds, of billions of dollars from them, aided by laws that allow bank secrecy. Here’s what to know https://t.co/q7qSvjr88L The cat is officially out of the bag, folks https://t.co/KmMvMFuwjs Russia's Putin meets with Turkey's Erdogan as U.S. struggles to shift troops from Syria to Iraq https://t.co/NtlvKFECYw The suspect is the wife of an American diplomat who fled to the U.S. after claiming diplomatic immunity — a law that protects diplomats and their families from prosecution in the country they are based https://t.co/9NlwWl45rH Of course the Jets quarterback's perfectly reasonable \"seeing ghosts\" comment got memed until dawn https://t.co/pp9T0dTjRM Three people were sent to the hospital for evaluation, American Airlines confirmed to TIME https://t.co/zz2J7WuvTo Although Emperor Naruhito has been acting as emperor for almost six months, his ascension is not official until he completes a series of rituals, including Tuesday’s traditional enthronement ceremony https://t.co/0NUvgfStX0 Top U.S. diplomat in Ukraine is latest Trump figure to privately testify in House impeachment inquiry https://t.co/Uu78uKqRAl “It played out like a psychological thriller. And yet it was true,” Ed Perkins, the director of “Tell Me Who I Am,” tells TIME https://t.co/5nVXyMKjD9 Trump faces swift criticism after likening impeachment inquiry to a \"lynching\" https://t.co/HLER0oKq7r Rep. Ilhan Omar has condemned a Republican state senator from North Dakota who posted a long-debunked photo on his Facebook page https://t.co/b7CJOerOix The Wing’s glossy aesthetic is a new addition to a recent crop of clubs springing up in London, reinventing the concept of the traditional gentlemen’s club https://t.co/XftoPL23bY A Whataburger outpost in Allen, Texas became the site of one the biggest eating contests thanks to a very determined teenager 🍔 🍔 🍔 https://t.co/06pztfU1Zm U.K. Police have announced they will be traveling to the U.S. to interview the American suspect in the crash that killed British teen Harry Dunn https://t.co/PtuVhBtpoa Police said those struck by the ambulance included a woman with a stroller and an elderly couple https://t.co/KSQhNBV11R Former U.S. President Jimmy Carter hospitalized after fall at home https://t.co/Y9MaiRONZo https://t.co/imk2XTJkQu Today's Word of the Day with @MerriamWebster is “fiduciary” https://t.co/YBAvXLUr4R Taiwan asks Hong Kong for return of the murder suspect whose case sparked months of protests https://t.co/2nAR8Tj0as This year's #WorldSeries has all the makings of a classic. Here's what to know https://t.co/jvJxMeFcP0 No other celebrity was more likely to land users on websites that carry viruses or malware, based on a survey from a cybersecurity firm https://t.co/h3OJ6OWyQi https://t.co/T8Nwq2ThT9 André Aciman on “Find Me,” his return to the lovelorn world of “Call Me By Your Name” https://t.co/9FuF1WjUFY \"Everything about this game demo seemed to come from a place of reverence for the original game, while also striving to make a blockbuster modern experience\" https://t.co/Wo7KA2dJUu Former U.S. President Jimmy Carter hospitalized after fall at home\nhttps://t.co/QpEk5lokUz Why a plan to redefine the meaning of \"museum\" is stirring up controversy https://t.co/ZqP9EMEnVw How to make your phone's battery last longer https://t.co/eXl433n9bg HBO’s “Catherine the Great” premieres tonight. Here’s what to know about Russia’s longest-reigning female ruler, including her political power and her power over men — the latter of which has generated more than its share of myths and misconceptions https://t.co/xylIwJhTAt Lee claims that 3-D is a fundamentally different art form from 2-D — and he believes that the shared movie-theater experience still possesses an unmatched power https://t.co/WyAF5EYlgX These are the most popular Netflix series and movies (according to Netflix) https://t.co/ASmRHUpqkA Hong Kong and Taiwan are clashing over the murder suspect whose case sparked months of protests https://t.co/eWd3TkqqFu With “Call of Duty: Modern Warfare,” gaming's most successful franchise grows up https://t.co/RVKmRsRZZ0 Review: HBO's \"Watchmen\" is the smartest superhero story since \"Black Panther\" https://t.co/SBjpoz51eg What to know about Blizzard, Hong Kong and the controversy over politics in esports https://t.co/qxEJGoATZS The internet is now confused about how to effectively slice a pomegranate https://t.co/mSam4C8jpy Canada's Trudeau wins a second term but loses his majority https://t.co/wTBAceFnhK https://t.co/sXdKUaKqXA Blackouts possible again as fire danger looms in California https://t.co/S1IrhOSZYs Rihanna's “Take a Bow” meme is perfect for everyone putting on quite a show with harmless lies https://t.co/AdE62XAHCH Canada's Trudeau wins a second term but loses his majority https://t.co/49rfXcxiBt Column: The Hong Kong government's use of emergency regulations must be challenged https://t.co/MLI6CVaPwy All the #WatchmenHBO Easter eggs and references you might have missed https://t.co/It9pfkZmMB Japan's new emperor is declaring his enthronement on Tuesday. Here's what to know https://t.co/8gyEPAcyN6 https://t.co/shxLolgSFO “I ask Prime Minister Sánchez to sit down and talk.” Carles Puigdemont writes for TIME on a way forward in Catalonia https://t.co/ptnFZ8ibMR “My company wanted to show a tampon string in an ad. Major TV networks told us to remove it,” writes @shethinx CEO Maria Molland https://t.co/8G5u8TX36c “We'll always be brothers.” Prince Harry discusses his relationship with Prince William https://t.co/DxJsR9npH6 Review: In its final season, “BoJack Horseman” proves why it's the most important animated show since “The Simpsons” https://t.co/XUN8JAumSb This is what you call going to great lengths to win Halloween https://t.co/6kai5cVV3Y Chile is \"at war\" its president says, as continuing clashes leave 12 dead https://t.co/xvfjhOJE3G This is the most dangerous celebrity online https://t.co/VDCEtqL79f Scary movie junkies, rejoice! The year ahead is packed with fright fests that will have you peeking over your shoulder and checking to make sure all the doors are locked — as all good horror movies should https://t.co/vVGWE3lx5N Japan's new emperor is declaring his enthronement on Tuesday. Here's what to know https://t.co/bXxADJ356h Liberal icon Justin Trudeau appears set to hold onto government in Canada https://t.co/s8J50PSQJh Review: In its final season, “BoJack Horseman” proves why it's the most important animated show since “The Simpsons” https://t.co/JfjKcTIcip “My company wanted to show a tampon string in an ad. Major TV networks told us to remove it,” writes @shethinx CEO Maria Molland https://t.co/MHHBmb9KQc “I ask Prime Minister Sánchez to sit down and talk.” Carles Puigdemont writes for TIME on a way forward in Catalonia https://t.co/8otdpDYLKC According to Pastor Jules, the Ebola virus is real, but the outbreak has been prolonged by a vast conspiracy of local journalists, doctors, and healthcare providers who are all “working for Ebola,” he said https://t.co/OyykjAYsIO What to know about Blizzard, Hong Kong and the controversy over politics in esports https://t.co/r7uqrq6oGH \"I’ve covered Mexico’s drug violence for 18 years,\" writes @ioangrillo. \"Thursday was different. It wasn’t gangster action; it was a mass insurrection\" https://t.co/Ywp95gjVkK Review: HBO's #Watchmen is the smartest superhero story since \"Black Panther\" https://t.co/HDASxMHU07 'They tried to take me down.' President Trump viewed Ukraine as an adversary, not an ally, witnesses say https://t.co/xylRzwUrR7 TuffyPacks, an online retailer selling ballistic shields that are inserted into backpacks, reported up to a 500% increase in sales after the shootings in El Paso and Dayton, which coincided with back-to-school shopping season. https://t.co/VwkOcoaBp3 Here's the history behind \"Jojo Rabbit\" and what it was really like to be in the Hitler Youth https://t.co/Vd2YpXhMsU Truck driver indicted on 23 counts in New Hampshire motorcyclist deaths https://t.co/sGLpgKxqm4 HBO’s #Watchmen is already shaping up to be one of the most mysterious, compelling and controversial shows of 2019. Here’s everything you need to know about the graphic novel in order to get the most out of the television series https://t.co/Ege7hGxNk6 U.S. diplomat who said 'it's crazy to withhold security assistance' in Ukraine text messages to testify to Congress https://t.co/hLxK4x9v3f TIME has broken down the major new and existing streaming services by cost, pros and cons, ideal audiences and what look to be the most promising or popular original shows and movies on each one https://t.co/KvtHcG4ZWi Separate shooting incidents in Philadelphia this weekend left a 2-year-old dead and an 11-month old in critical condition https://t.co/JmJiioq9Bx The first non-stop flight from New York to Sydney — the world’s newest longest flight — has been completed https://t.co/uQbWdLln0Q https://t.co/FjyOGlT0EF Florida veterinarian and his wife die in North Carolina plane crash https://t.co/lUiynDxpG3 HBO’s “Catherine the Great” premieres tonight. Here’s what to know about Russia’s longest-reigning female ruler, including her political power and her power over men — the latter of which has generated more than its share of myths and misconceptions https://t.co/Nm90qnYOzH The U.S. may leave some forces in Syria to secure oil fields and make sure they don’t fall into the hands of a resurgent Islamic State, Defense Secretary Mark Esper said https://t.co/yuBsKvZ5iq Researchers discover second long-lost Japanese warship from historic World War II Battle of Midway https://t.co/qhkKWgjAak The House voting to impeach President Donald Trump will \"usher in an extraordinary logistical challenge for the six sitting Democratic Senators duking it out for their party’s presidential nomination in 2020,\" writes @Philip_Elliott. Here's how https://t.co/dFcNm2wsXs Thailand's King has stripped official royal consort of her title over alleged disloyalty, \"inappropriate behavior\" https://t.co/SmVo0vLKH5 https://t.co/4LwbFwiKeb At least 55 elephants have starved to death in the past two months in Zimbabwe’s biggest national park, authorities said https://t.co/0NbpoNWPDk Netanyahu fails to form new government coalition, returns mandate to Israeli President https://t.co/Rv93crWRoD The hour-long special, scheduled to debut Nov. 7, interviews candidates at various sites chosen to illustrate the impact of climate change. President Trump declined an invitation to participate https://t.co/ngPwhErg4L Scary movie junkies, rejoice! The year ahead is packed with fright fests that will have you peeking over your shoulder and checking to make sure all the doors are locked — as all good horror movies should https://t.co/kcZZc0lymg A Rolling Stones fan got the ultimate surprise while perusing an old music magazine—he was in the photos https://t.co/BWNMIF5Siy Louis Vuitton designer Nicolas Ghesquière has criticized Donald Trump a few days after the President toured the fashion label’s new factory in Texas https://t.co/GrAei2YuH9 This is what you call going to great lengths to win Halloween https://t.co/Q9MGzEn0a1 Review: In its final season, “BoJack Horseman” proves why it's the most important animated show since “The Simpsons” https://t.co/INhNVg4vpF Why defendants in the college admissions scam are changing their pleas https://t.co/Ml0WfbCzy3 Here's what it was like to take the world's longest non-stop flight https://t.co/vMMoSoOLkU \"I thought it would be fair.\" Meghan Markle says British tabloids have made her marriage to Prince Harry \"really challenging\" https://t.co/EJzWVBBVuU Potatoes thrown at American troops as they depart Syrian city https://t.co/9A0eojGGA9 https://t.co/dtQO3ctb9k Julián Castro’s campaign announced that if he doesn’t raise $800,000 by Halloween, the former Secretary of House and Urban Development will be forced to drop out of the Democratic presidential primary https://t.co/SQmmxjVVE2 “We'll always be brothers.” Prince Harry discusses his relationship with Prince William https://t.co/1H3LqybS2s Controversy erupts over clothing company's Times Square billboard ad depicting a hog-tied President Trump https://t.co/D9Yifc0ttg A massive manhunt is underway for a West Point cadet believed to be carrying a rifle https://t.co/qdAM0s322O https://t.co/sHA9iHXJ1H “My company wanted to show a tampon string in an ad. Major TV networks told us to remove it,” writes @shethinx CEO Maria Molland https://t.co/h7NScKv9xH Thailand's King has stripped his Royal Consort of her title over alleged disloyalty, “inappropriate behavior” https://t.co/MroJh6bnAa Rihanna's “Take a Bow” meme is perfect for everyone putting on quite a show with harmless lies https://t.co/CzQP5SScIB The internet is now confused about how to effectively slice a pomegranate https://t.co/njg1wsUJtq RT @wjhenn: How can you accept that you’ll never again see the man you built your life with? And how do you tell seven children their fathe… André Aciman on “Find Me,” his return to the lovelorn world of “Call Me By Your Name” https://t.co/QtjzbXp9KJ “I ask Prime Minister Sánchez to sit down and talk.” Carles Puigdemont writes for TIME on a way forward in Catalonia https://t.co/Bl57zEc4Ln All the #WatchmenHBO Easter eggs and references you might have missed https://t.co/ccl57Dyp6e What to know about Blizzard, Hong Kong and the controversy over politics in esports https://t.co/yb9osgRWQ0 The National Weather Service confirmed a tornado touched down in Dallas on Sunday night, causing structural damage and knocking out electricity to thousands https://t.co/XWnNgf6KUM https://t.co/B8N48ghd0q Today's Word of the Day with @MerriamWebster is “comprise” https://t.co/p7X7ZnoOty A massive manhunt is underway for a West Point cadet believed to be carrying a rifle https://t.co/YS9oTli68o RT @billyperrigo: Can Brexit still happen on October 31? Is a no deal still possible? Answers to this and more here, as this week develops:… Review: HBO's \"Watchmen\" is the smartest superhero story since \"Black Panther\" https://t.co/x1PBmKb25O RT @timeforkids: It's the most wonderful time of the year: Media Literacy Week! To celebrate, we'll be posting some of our favorite TFK #Me… With “Call of Duty: Modern Warfare,” gaming's most successful franchise grows up https://t.co/FR0L1zjift Review: \"'The Irishman' is so layered with detail, and shifts so gracefully through so many eras, that it’s hard to tease out a clearly defined plot. Even so, the movie is beautifully constructed\" https://t.co/1qPSjb0jyG Facebook CEO Mark Zuckerberg privately advised Buttigieg on campaign hires https://t.co/DFjcR0Yg5w These are the most popular Netflix series and movies (according to Netflix) https://t.co/JsFsPa9aAt 'No one who is 18 these days believes that war is easily won.' With 'Call of Duty: Modern Warfare,' gaming's most successful franchise grows up https://t.co/PjW5q066dy Boris Johnson is bracing for a showdown on his Brexit deal. Here's what to expect https://t.co/S1xdSFF70K Potatoes thrown at American troops as they depart Syria https://t.co/HA2t4kmVux Lee claims that 3-D is a fundamentally different art form from 2-D — and he believes that the shared movie-theater experience still possesses an unmatched power https://t.co/MU8hgZOgxZ The story of Elton John’s kaleidoscopic, Ozian life has been told many times over: in his own albums and in documentaries and books. But John never wrote a definitive autobiography—that is, until now https://t.co/qeAoGmYpHf Tens of thousands without power after tornado hits Dallas https://t.co/pIJG45uUqL You're gonna break a sweat playing Nintendo's 'Ring Fit Adventure' https://t.co/ffEv3dCHoX .@louistheroux, widely regarded as the face of modern British documentary filmmaking, has become his own subject with his new book \"Gotta Get Theroux This\" https://t.co/JH0cn3qLLU From “Little Women” to “Motherless Brooklyn,” here are 10 movies based on books that are out this fall https://t.co/T8kmo2Giru Spain to exhume Franco's remains from a grandiose mausoleum and move them to a discreet location https://t.co/V5BfvTmpeP Discovery's ambitious docuseries \"Why We Hate\" is essential viewing. It's also deeply flawed https://t.co/TbZIHggpoM WikiLeaks founder Julian Assange due in court to fight extradition to the U.S. https://t.co/erOfCrMiiA The surprising origins of the phrase \"you guys\" https://t.co/2u9sUPUH5e \"If you think about it, work-life balance is a strange aspiration for a fulfilling life\" https://t.co/iaxeGsBoK5 U.S. takes step to require asylum-seekers' DNA https://t.co/SlT6FgFJHp Why you shouldn't immediately worry if your child is a late talker, according to a speech pathologist https://t.co/RYp2F9WcZe How to make your phone's battery last longer https://t.co/eXl433n9bg Hong Kong leader and police chief apologize to Muslim community for spraying a mosque with a water cannon https://t.co/czGfuJu8ch American ambassador defends new rules for Chinese diplomats https://t.co/eZT1hQJdCS Through the lives of three sisters and their families, Jokha Alharthi charts the dizzying transformation of Oman in the decades after it achieved independence from Britain in 1951 https://t.co/YlBz7SUmJN Why a plan to redefine the meaning of \"museum\" is stirring up controversy https://t.co/ZqP9EMEnVw \"Planes weren’t built for big people like me. Here’s what I want my seatmates to know,\" writes Kimberly Dark https://t.co/jm6EklkXYf Review: Ryan Murphy's Netflix debut \"The Politician\" is peak Ryan Murphy. That's not necessarily a bad thing https://t.co/njFC0iteAG For Selly Raby Kane, Dakar has always been more than home. “It’s central in the things I create,” she says of the Senegalese capital. “It’s a huge source of inspiration and creativity, and I have just been fascinated by its history” https://t.co/QhOAwSsC1O Is wine really healthier than beer? https://t.co/bYdcY97I5s How did \"left\" and \"right\" acquire their political meanings? https://t.co/BZl5f3hdSh What to know about Blizzard, Hong Kong and the controversy over politics in esports https://t.co/NuYUeDCJNW All the \"Watchmen\" Easter eggs and references you might have missed https://t.co/jXmscycAc6 Indonesia's Joko Widodo begins his second term promising to champion democracy and boost development https://t.co/zgSH5WQVLD \"Everything about this game demo seemed to come from a place of reverence for the original game, while also striving to make a blockbuster modern experience\" https://t.co/lURNtKOTNk Chile violence continues even after government drops subway fare hike https://t.co/8E1791W5dQ If you’re one of the millions of people currently in debt, it may feel like you have a formidable mountain to climb. However, according to financial experts, there is one way to make the journey to being debt-free a little bit easier https://t.co/yQ6jCK0W3p The best karaoke songs for singers and non-singers alike https://t.co/sBPbHrwKn2 Whether it’s hitting the gym regularly, reading more often before bed, or just remembering to drink plenty of water and get enough sleep, habit-tracking apps can help us remember — and stick to — our goals https://t.co/4YQFbFrby9 The Pittsburgh synagogue massacre led to a string of anti-semitic plots, rights group says https://t.co/DKG8YKXMOM \"Layered and contemplative, 'Dad's Maybe Book' immerses itself in the bones of modern American life\" https://t.co/2EPMFWytIK In the newly published autobiography \"Me,\" Elton John's writing breathes humanity into a family almost always shrouded in rigid formality https://t.co/17u6R4LWQL Einstein was widely thought to be public enemy number one of the Nazis. Here's how Britain helped him escape https://t.co/VFpPGGkvTs Sega's throwback Genesis Mini is packed with good vibes https://t.co/sOqfVt3isy https://t.co/CnaFaOHvJd Here's what young people all over the world say they want most in a partner https://t.co/mrqgK6Nf8k Review: Netflix's zany Paul Rudd vehicle \"Living With Yourself\" never lives up to its binge-worthy premise https://t.co/phX07zdj7H https://t.co/Et18XbUnCi “Candidates snapping selfies with voters is not new. But Warren has elevated an old shtick into the centerpiece of her digital strategy,” writes @CharlotteAlter https://t.co/4nT6sJq59Q \"As long as we remain in the shadows, people will continue to view us as the 'other' or as newcomers, but it’s not that we are newly arrived in America — it’s that America hasn’t recognized our existence,\" writes author @julissaarce https://t.co/Uv3qOj1Xa1 Whether by sheer luck or keen prescience, Bong Joon-ho's “Parasite” is the movie for right now, writes @szacharek in her review https://t.co/qv34birZiF \"We must move the issues of war and peace from the periphery of our national discourse to its center,\" @elliotackerman writes in TIME's special report. \"And the only way to do that, I increasingly believe, is to reconsider the draft\" https://t.co/WyZbclw47D https://t.co/z99dhe1110 \"I will not allow that to be your life.\" A mother's letter to her black sons on growing up in America https://t.co/CVfyhyRmly New Orleans officials demolish cranes with explosives after deadly collapse of Hard Rock hotel https://t.co/JZXsogchz0 Review: HBO's \"Watchmen\" is the smartest superhero story since \"Black Panther\" https://t.co/OGq9WUcnek U.S. troops leaving Syria will move to western Iraq, defense secretary says\nhttps://t.co/AEQlbEQ8GO https://t.co/CI41FChEaH “When you overcome difficulties, you will have so much joy and contentment.” Aori Nishimura thought her career would be over after a devastating injury — but now she’s poised to compete in the 2020 Olympics https://t.co/qMznp4xgyO https://t.co/hP2vew30T1 Thomas D'Alesandro III, Nancy Pelosi's brother and former Baltimore mayor, dies at 90 https://t.co/nVjccPbCj2 \"One abiding characteristic of most of the ten admirals in my book is that they were thoughtful, intellectually grounded individuals,\" writes @stavridisj. \"Perhaps the long periods at sea that almost all of them experienced have something to do with that\" https://t.co/CtW8FFoIeA Unrest continues unabated in Hong Kong as tens of thousands march on Rail Terminus\nhttps://t.co/DSwp6DEi9k https://t.co/H6TjzaLiME \"I don’t have seven arms to hug them all.\" A year after their father's death in Afghanistan, a mother and her children struggle to move on https://t.co/tHxcmNxbKA Recently released video shows football coach wrestling gun away from student, then hugging him https://t.co/cGS1knBUB2 According to Pastor Jules, the Ebola virus is real, but the outbreak has been prolonged by a vast conspiracy of local journalists, doctors, and healthcare providers who are all “working for Ebola,” he said https://t.co/2ZCpbjl1CL J. Law now has in-laws: Jennifer Lawrence marries art dealer Cooke Maroney https://t.co/K2fOobMwTT Meet the 15 women leading the fight against climate change, from Greta Thunberg to Ellen Page https://t.co/grT7mWBDUj HBO’s “Watchmen” is already shaping up to be one of the most mysterious, compelling and controversial shows of 2019. Here’s everything you need to know about the graphic novel in order to get the most out of the television series https://t.co/ckS5toRFmU Chris Evans returns to Massachusetts roots to dedicate youth theater company https://t.co/0dLvKspurX \"It’s my purpose to just shine a light where I can.\" @stormzy is dedicating himself to bringing greater visibility to a wider community of black musicians, artists and creators in Britain https://t.co/8z3nmsqylz https://t.co/UsLcynjSYw 3 soldiers die, 3 injured in training exercise at Fort Stewart in Georgia https://t.co/UShJxP7OXg Here's the deadline countdown for every Trump impeachment subpoena issued so far https://t.co/X9ip65sXV4 As national Republicans continue to defend Trump, Amash has become something of a unicorn—and is risking his seat along the way https://t.co/ike6T8YvIK Many factors influence how long somebody lives. Some, like their genes, are out of their control. Others, like their lifestyle and environment, are a bit easier to alter. A new paper finds another factor that falls somewhere in between those extremes https://t.co/yD2FGRiJAr Kurds begin to evacuate besieged Syrian border town https://t.co/y1qvv7dmMv Experts defuse 500-pound American World War II bomb found in northern Italy https://t.co/MeogsQbdiu How a new class of trans male actors are changing the face of television https://t.co/E8RyOy1ALy President Trump backs down on hosting G7 meeting at his Florida Doral resort https://t.co/Dw38GD5J97 America's founders disagreed about impeachment. Here's how the idea made it into the Constitution https://t.co/WmtoXsDqUA Defense Secretary Mark Esper visits Afghanistan to chart a path forward https://t.co/kHsyHjxLLV U.S. troops leaving Syria will move to western Iraq, defense secretary says https://t.co/jHNdMLyaku “We have to produce journalism worth paying for.” How A.G. Sulzberger is leading the New York Times into the future https://t.co/rmTh3xbJM1 House Speaker Nancy Pelosi visits Jordan to discuss 'deepening' Syria crisis https://t.co/sf4gyig4gv A study suggests tainted talcum powder can cause a rare cancer. Here's how it could play out in the courtroom https://t.co/IylaJrPaRA Here are a few pointers from pro photographers to keep in mind while you point and shoot with a wide-angle lens https://t.co/otREygvf4S Even before Bernie Sanders' heart attack rocked his campaign in early October, a large chunk of his 2016 supporters were already shopping for another candidate https://t.co/7VCTgHP8E3 A recent study says naps aren’t a lazy indulgence. In moderation, they may actually be good for your heart https://t.co/B8onGDgsh4 The 20 best Halloween TV episodes of all time https://t.co/gWTXzwBkll Kara Walker's latest creation, Fons Americanus—a 13-meter-high fountain unveiled Sept. 30 in London’s Tate Modern museum—presents the brutality of slavery in a subversively joyful setting https://t.co/9lnoxxlLVK The 13 interlinked stories in \"Olive, Again\" embrace both new and familiar characters navigating the struggles that arise in everyday life https://t.co/v49Ms4mvCk Two-time Academy Award-winning actor Jessica Lange is also an accomplished photographer. She discusses her photographic tribute to her Midwestern roots in \"Highway 61\" https://t.co/C4r9KBpoeD “How to return a farm to the wild, watch nature return—and maybe find a way to save the planet,” https://t.co/0dwh8Ovdgd “The end goal is closing the gap between the hospitals and the patients.” Meet the man whose bloodless test is revolutionizing the fight against malaria https://t.co/y2jwNGG9KM https://t.co/NnemXkhcoZ Inside the race to build the world's first commercial octopus farm https://t.co/npA4IsAT83 Khan had in roughly 24,000 words resurfaced an argument against monopolies that journalists such as Ida Tarbell had popularized more than a century ago https://t.co/J0CMyStPfk How old is your pet in human years? The answer is a little complicated, according to a vet https://t.co/s8VEo8Ko6s Why you really shouldn't kill the spiders in your home, according to an entomologist https://t.co/L2d8l5vKq4 \"I created a system to make sure my husband and I divide household duties fairly. Here's how it works\" https://t.co/8jTbmnSNRS This Italian-Egyptian singer was attacked by populist politicians. His groundbreaking success is silencing critics https://t.co/QMUsy88MFW The MoMA will soon reopen following extensive renovations. Here's what to expect from the revamped museum https://t.co/RMcdA0LyZU \"You’re not a person if you don’t drink.\" \n\nHere's how this tiny European country developed the world's worst drinking problem https://t.co/K9qAM4YzHv Review: \"Imaginary Friend\" is less a story of awkward youth and more a gleeful meditation on human brutality https://t.co/OZxZh35As1 In \"Joker,\" black women are visible but they are not seen https://t.co/yUVvcKyujs \"Yes, America is rigged. Here is what I learned from reporting on Koch Industries,\" by author Christopher Leonard https://t.co/qFBFcosQIK The Disney CEO discusses consequential fun, firing humanely and what he learned from scraping chewing gum off desks https://t.co/GYx1VceVUC \"While the basic idea of learning from failure is supported by evidence, the sink-or-swim method doesn’t really work,\" writes Diane Tavenner https://t.co/93LW0FKHKi Even before it dominated the Emmys, \"Fleabag\" was bound to loom over Showtime's \"Back to Life.\" Here's how the two series differ https://t.co/bK7m5n85KX What it’s like living in one of the hottest cities on Earth — where it may soon be uninhabitable https://t.co/UJkdwQW8TU https://t.co/7OWNK1fqlg https://t.co/QMbTrJxa7S Though juice was once a cornerstone of a balanced breakfast, its place at the table has been looking a bit precarious these days. But is a glass of OJ really a big deal? https://t.co/JvtsPQZvwD \"Deepfakes\" are videos designed to trick you into thinking they're real. But there's a way to detect them https://t.co/TMO2AKRJK5 Review: “El Camino: A Breaking Bad Movie” transforms Jesse Pinkman into an unlikely action hero https://t.co/57y6vfHJJC \"How your obsession with short-term results can hurt you in the long run\" https://t.co/6dhQgxN3Mt “The capabilities are still there.” Why Cambridge Analytica whistleblower Christopher Wylie is still worried https://t.co/GeRbfLtTvN What the history of beards reveals about the changing meaning of masculinity https://t.co/S21dzaJ5bG How the AIDS crisis changed the dynamic between gay men and women, as told in Edie Windsor's posthumous memoir https://t.co/zAlZ5mNptM Low wages, sexual harassment and unreliable tips. This is life in America’s booming service industry \n\nProduced in partnership with @fullerproject \nhttps://t.co/Qq9xgISkLk 'I am back,' Bernie Sanders tells supporters at NYC rally with Alexandria Ocasio-Cortez\nhttps://t.co/iXjaHjkRzo https://t.co/4cFG4KUtuq \"Over the past four seasons, @jessmendoza won over many baseball fans with her preparation and a conversational style that translate's the games intricacies into digestible nuggets for viewers,\" writes @seanmgregory https://t.co/i925DDEVaf \"The plot is minimally taxing and essentially uninteresting, offering the sort of empowerment-lite message Disney specializes in,\" writes TIME's @szacharek https://t.co/NmDq5OTY2j These are the 10 best Nintendo Switch games to buy right now https://t.co/Ta96msZqEz 'I am back,' Bernie Sanders tells supporters at NYC rally with Alexandria Ocasio-Cortez https://t.co/wQ963bsDih “Unfortunately, housing prices continue to rise and middle-class families are being pushed out of the market,” said Rep. Ben McAdams https://t.co/R0T3y3cOOf GOP Rep. Rooney, who is openly weighing impeachment, won't seek a new term https://t.co/OlbRPrqJjK Michigan Farmers Suffered a Massive Apple and Pumpkin Heist, Losing Thousands of Dollars in Produce https://t.co/DULWUrIJTw As with polio, AFM is seasonal—though unlike polio, it arrives in late summer and early to mid fall, rather than in the spring and summer https://t.co/Jq4i1ZI82o Body of Rep. Elijah Cummings will lie in state at Capitol https://t.co/nHrRC1RxBM Charlotte Charles and Tim Dunn say they made a deathbed promise to seek justice for their son — and they have every intention to keep it https://t.co/Q3dAOTq8W3 This Japanese skateboarder thought her career would be over after a devastating injury. But now she’s poised to compete in the 2020 Olympics https://t.co/OWYjWLxWcB RT @TeamTime: Thank you to our @TIME and @timeforkids volunteers for spending the day with @newyorkcares at PS 38 #CaresDay https://t.co/Yl… She's 2 years old. Her parents have British passports. So why is the U.K. trying to deport her? https://t.co/cnASSgsiwy Thousands in Germany protest Turkish offensive in Syria https://t.co/wbr8izelKj She was in a secret society at Yale. Her latest novel explores the dark and mysterious world of the Ivy League https://t.co/0sF5KV85Kb “Trump’s Ukraine and Syria policies represent Trump unleashed,” writes @DavidAFrench. “This is the man in full, and the man in full is demonstrating that he’s just as corrupt, unfit, and incompetent as his critics feared” https://t.co/E9z0SSle4f 1 person dead after plane went off runway on Alaska island https://t.co/dYygVuNj7L To understand why the new “Joker” movie is so controversial, we need to understand the villain's toxic history — onscreen and online https://t.co/3nMpv2RwDd Why did Christianity thrive in the U.S.? https://t.co/OYJvUQJHjl \"On paper, 'Breakpoint' is the kind of game we’re supposed to love. But its disparate elements never come together and often feel like a waste of time\" https://t.co/FoT2XuSLMK RT @TeamTime: Team @TIME and @timeforkids are proud to volunteer with @NYCares at PS 38 today for #caresday https://t.co/MeWwA8PZu7 In order to slow down climate change, we must solve four seemingly unsolvable problems, writes @JaneGoodallInst https://t.co/yglz4fOGui British lawmakers vote to delay Brexit deal approval https://t.co/PyKH6mGQTU Kurdish and Turkey forces reportedly clash during shaky ceasefire https://t.co/CZYWP119Rx “Ever since @BTS_twt’s debut, they’ve never suddenly switched gears or changed pace,” founder and co-CEO of @BigHitEnt Bang Si-hyuk tells TIME. “They don’t shy away from speaking about the pain felt by today’s generation” https://t.co/GgI1pondl0 10 tips for taking better smartphone photos from pro photographers https://t.co/DFsASFs6yT RT @timeforkids: Our new cover story explores some of the ways people around the country are standing up for one another—whether they're cl… Aaron Paul on the ending—and the cameos—of “El Camino: A Breaking Bad Movie” https://t.co/cQDLLfkNqk These are the most popular Netflix series and movies (according to Netflix) https://t.co/dLGgfIa13h Conservatives say Fasiki’s images are degrading, but she wants to draw attention to society’s obsession with how women present themselves https://t.co/BfmSZ4kcIB When tights first became a wardrobe staple, they signified something that went far beyond a simple change of season: freedom https://t.co/RShd6WfRa0 Review: Forget \"The Masked Singer.\" Netflix's \"Rhythm + Flow\" is the best music competition show in years https://t.co/jkwIyFxOqE “I know it’s going to affect us in a positive way,” says James Langer, whose startup is rolling out a line of THC vapor products in “Michelin chef-type” flavors https://t.co/iF7KQDZP4b “How many voices do we need? How many more traumas do we have to debate until someone listens?” writes @lyzl https://t.co/WxKmDoVSV6 \"Godfather of Harlem\" dissects complicated relationships as it examines how white supremacy operates within the criminal underworld, writes TIME's @judyberman in her review https://t.co/Kwlj0iRwxK Stop me if you've heard this one: a robot and a team of Irish scientists walk into a senior living home https://t.co/RmhfPGrKNP The Ocean's health is in deep trouble, Peter Thomson writes. Here's how you can help https://t.co/8MKlErMwSM \"How your obsession with short-term results can hurt you in the long run\" https://t.co/6dhQgxN3Mt Niksen is the Dutch lifestyle concept of doing nothing — and you're about to see it everywhere https://t.co/vTE77mbJv8 “How neuroscience could explain the rise of addictions, heart disease and diabetes in 21st century America,” by Peter Sterling https://t.co/alfaCy9Pgf Randall Munroe, creator of web comic \"xkcd,\" hopes his terrible ideas for producing energy will inspire you to think of better ones https://t.co/xKLstzFmTL Review: A brilliant \"Big Mouth\" season 3 premiere is one of the best TV episodes of the year https://t.co/IFvPrxzmbY The true story behind “Lucy in The Sky”—and the one key detail the movie leaves out https://t.co/J3WZ7Dg5CB Lina Khan had in roughly 24,000 words resurfaced an argument against monopolies that journalists such as Ida Tarbell had popularized more than a century ago https://t.co/OeDTUM1Fky https://t.co/i6tZy2ngOs “I ran the VA under President Trump until he fired me. Our first Trump Tower meeting was a job interview unlike any other” https://t.co/fFeGwPwp05 In an interview with TIME, K-pop powerhouse @JYPETWICE opens up about how their new album is more personal than ever https://t.co/j8beVa9jH2 “The fact that he does it openly and publicly doesn’t insulate it from the legal consequences of breaking the law,” former Vice President @algore said of President Trump’s actions addressed in the impeachment inquiry #TIME100Health https://t.co/5U90DVA26s An explosion rocked a mosque in Afghanistan as dozens of people gathered for Friday prayers, causing the roof to collapse and killing 62 worshippers, provincial officials said https://t.co/ikmq6BfD7P At present, six of the eight major subpoenas that House Democrats have issued to Trump administration officials and departments have gone unanswered past the deadline set in the request https://t.co/V2hi98us50 \"We wanted to make an absolute clear statement that the values of the NBA, these American values — we are an American business — travel with us wherever we go, and one of those values is free expression,\" NBA Commissioner Adam Silver said at the #TIME100Health Summit https://t.co/JEDBI5nuuj “Trump’s Ukraine and Syria policies represent Trump unleashed,” writes @DavidAFrench. “This is the man in full, and the man in full is demonstrating that he’s just as corrupt, unfit, and incompetent as his critics feared” https://t.co/wdEgZLr2el “Unfortunately, housing prices continue to rise and middle-class families are being pushed out of the market,” said Rep. Ben McAdams https://t.co/UFzMYXx6El Where three women's journey from Cuba to America left them https://t.co/Mtykj5a6dY The FAA is testing how conditions on \"cramped\" planes impact evacuation times, offering volunteers cash prizes for quick escapes from simulated emergency landings https://t.co/P79l4HT38o “I have absolutely no memory of ever seeing her,” says photographer David Burnett. “It was an accident, but sometimes accidents are the best pictures” https://t.co/MDOR6V58IW \"We offer an inclusive space.\" Only 8 days after opening its first U.K. location, a British mall has decided not to renew Chick-fil-A's lease https://t.co/yLUJ9GvFbd “The Latinx community cannot wait to be seen, and America can no longer deny us the opportunity to tell our story,” writes author @julissaarce https://t.co/o2N6XE07eP Protests follow the firing of Wisconsin high school security guard who repeated a racial slur when telling a student not to call him it https://t.co/oMRcsDWpL1 \"Ending the protests was the easy part; the real question for Moreno is what comes next,\" writes @ianbremmer https://t.co/YvHhm0OLKl Scientists have detected movement detected along a California fault that could cause an 8-magnitude earthquake https://t.co/0CG42RUrUW .@BTS_twt and @lauvsongs' \"Make It Right\" intersperses footage of the septet performing on their recent world tour with an animated fairy-tale narrative https://t.co/ZiH9cGYSkh Oracle CEO Mark Hurd has died at 62 https://t.co/OH1MfKKk4Z https://t.co/tPXhEMHkIi Johnson &amp; Johnson recalled a batch of its baby powder after government testing found trace amounts of asbestos in one bottle bought online https://t.co/9YymEhX5G4 \"Necessary action will be taken.\" Turkish President Erdogan says he won’t forget Trump’s \"tough guy\" letter https://t.co/CexLaOS6WM The State Department has completed its internal investigation into former Secretary of State Hillary Clinton’s use of private email and found violations by 38 people https://t.co/HgYE4QnhFl One dead after commuter plane landing on Alaska island went off the runway https://t.co/H0knLwdWDM Trump nominates Dan Brouillette to replace Rick Perry as Energy Secretary https://t.co/f2f0MBSpWn Hillary Clinton appears to imply Russia is \"grooming\" Rep. Tulsi Gabbard for third party run https://t.co/AmWbuJHNSd Former Trump opponent and ex-Ohio Gov. Kasich supports impeachment https://t.co/kpUEGDHcQJ Cigarette cockroach crawling with purpose had no clue it was destined for viral fame https://t.co/c6RHFbaPUH “In ‘Watchmen,’ as in real life, white skin functions as a mask unto itself—a way of blending into spaces that would be dangerous for minorities, regardless of your motive for being there” https://t.co/i0tEqUUINx A tropical storm is forecast to hit Florida this weekend. Here's what to know about its path https://t.co/n8GX4aSetE https://t.co/PkE9O5buS4 HBO’s “Watchmen” is already shaping up to be one of the most mysterious, compelling and controversial shows of 2019. Here’s everything you need to know about the graphic novel in order to get the most out of the television series https://t.co/ZH5JWosa3g At present, six of the eight major subpoenas that House Democrats have issued to Trump administration officials and departments have gone unanswered past the deadline set in the request https://t.co/pMaVvHetSm \"One abiding characteristic of most of the ten admirals in my book is that they were thoughtful, intellectually grounded individuals,\" writes @stavridisj. \"Perhaps the long periods at sea that almost all of them experienced have something to do with that\" https://t.co/8ZDzdPii9V According to Pastor Jules, the Ebola virus is real, but the outbreak has been prolonged by a vast conspiracy of local journalists, doctors, and healthcare providers who are all “working for Ebola,” he said https://t.co/qSoxGr9SY1 A tropical storm is forecast to hit Florida this weekend. Here's what to know about its path https://t.co/09HhqZ9ATx \"This little guy catches a huge fish then does the unexpected,\" the Twitter user posted https://t.co/zsWMQnz8QL Oracle CEO Mark Hurd has died at 62 https://t.co/GfzCj5SHH9 Buttigieg campaign returns donation money from former Chicago attorney after backlash https://t.co/sSG19IXPDG \"Maleficent: Mistress of Evil\" hits theaters today. \"The plot is minimally taxing and essentially uninteresting, offering the sort of empowerment-lite message Disney specializes in,\" writes TIME's @szacharek https://t.co/UrLZ8oDywi Jennifer Aniston set a Guinness World Record when she joined Instagram this week, setting the time for the fastest account to reach one million followers on the platform https://t.co/E2rZhUiYir Charlotte Charles and Tim Dunn say they made a deathbed promise to seek justice for their son — and they have every intention to keep it https://t.co/vemXL6dcwk \"The federal government has lost our trust. It could learn something from our cities,\" by Martin O'Malley, former governor of Maryland https://t.co/8b0eDHY9cR An explosion rocked a mosque in Afghanistan as dozens of people gathered for Friday prayers, causing the roof to collapse and killing 62 worshippers, provincial officials said https://t.co/iMlsIpO312 \"Sadly, in the case of 'Living With Yourself,' a show designed for binge viewing never proves binge-worthy,\" writes TIME's @judyberman https://t.co/9b6cabqrKx RT @abbyvesoulis: Housing policy exclusive with @aabramson: the @NewDemCoalition will endorse four bills aimed at solving the housing crisi… A group of moderate Congressional Democrats is endorsing four bills to address affordable housing on Friday, the group, New Democrat Coalition, tells TIME https://t.co/NEls4za7gV Scotch whisky, French wine and Italian cheeses are about to become much more expensive, after President Trump imposed some $7.5 billion worth of tariffs on E.U. goods https://t.co/8Bz4oudnc6 She's 2 years old. Her parents have British passports. So why is the U.K. trying to deport her? https://t.co/tRbtiQ3cie Meghan Markle is discussing the challenges she has faced since giving birth to her and Prince Harry’s first child, royal baby Archie https://t.co/lm3HOQdlA6 While Lady Gaga was able to finish up her performance, such a big fall from the stage required a serious post-show recovery regimen https://t.co/iIBOlZ0Ozh Pressure builds on President Trump as new revelations emerge about his dealings with Ukraine https://t.co/Hx2TQrLHeQ “Trump’s Ukraine and Syria policies represent Trump unleashed,” writes @DavidAFrench. “This is the man in full, and the man in full is demonstrating that he’s just as corrupt, unfit, and incompetent as his critics feared” https://t.co/C6fu8qOWBP Mexican army forced to abandon capture of El Chapo's son after being outgunned by cartel https://t.co/5PcJughEu8 Here's Rihanna strolling as a goddess among us in this nonchalant slow motion video https://t.co/JrHAmlTscK “I guess I’m the Meryl Streep of generals.” Former Defense Secretary James Mattis takes shot at Trump after the president called him “overrated” https://t.co/PlwilAYHyA https://t.co/vlI7B1vaK9 “Jojo Rabbit” opens in U.S. theaters today. Here's the history behind the film and what it was really like to be in the Hitler Youth https://t.co/AdXeGZeWIc “I guess I’m the Meryl Streep of generals, and frankly that sounds pretty good to me,” former Defense Secretary James Mattis said https://t.co/YErd4wgwza RT @rachael_bunyan: I spoke to the mother of 2-year-old Lucy Dutton, who is facing deportation from the U.K. even though both her parents h… \"As long as we remain in the shadows, people will continue to view us as the “other” or as newcomers, but it’s not that we are newly arrived in America — it’s that America hasn’t recognized our existence,\" writes author Julissa Arce https://t.co/7iogSL8G2N Members of the Mexican National Guard and army were patrolling in Culiacan when they were fired on from a house, officials said. They repelled the attack and inside the house found Ovidio Guzmán López.  https://t.co/aniywbW5zO The more active your brain, the shorter your lifespan may be, a new study says https://t.co/2ME6E1Axn6 https://t.co/8O9g0Pq4Bs For around 36 hours, Fortnite was literally a black hole. Here's how the game turned a routine server outage into a minor media phenomenon https://t.co/I5Yx6JaHx8 NASA astronauts Christina Koch and Jessica Meir venture outside the space station for the first all-female space walk https://t.co/mqnmG1GXBC The story of Elton John’s kaleidoscopic, Ozian life has been told many times over: in his own albums and in documentaries and books. But John never wrote a definitive autobiography—that is, until now https://t.co/W7DrE3bMh8 TuffyPacks, an online retailer selling ballistic shields that are inserted into backpacks, reported up to a 500% increase in sales after the shootings in El Paso and Dayton, which coincided with back-to-school shopping season. https://t.co/pYwafolaGq A study suggests tainted talcum powder can cause a rare cancer. Here's how it could play out in the courtroom https://t.co/mJOrhGEJrX NASA astronauts Christina Koch and Jessica Meir are making a spacewalk outside the International Space Station. https://t.co/6fSNffiQIo Review: Netflix's zany Paul Rudd vehicle \"Living With Yourself\" never lives up to its binge-worthy premise https://t.co/DlmdadZ82S https://t.co/Et18XbUnCi Even before Bernie Sanders' heart attack rocked his campaign in early October, a large chunk of his 2016 supporters were already shopping for another candidate https://t.co/QQ9CKZL9n0 She's 2 years old. Her parents have British passports. So why is the U.K. trying to deport her? https://t.co/nkshZT3fos Sega's throwback Genesis Mini is packed with good vibes https://t.co/JLwInZ6z0V https://t.co/CnaFaOHvJd China denies asking for Morey's firing over Hong Kong tweet https://t.co/kRsmHY3RaU Alexander Gorbunov’s YouTube channel has racked up over 2 million views for his tirades on Russian politics, which he delivers deadpan each week from his wheelchair https://t.co/0qI8VjALSU Medicare for All would actually be \"Medicare for None,\" HHS Secretary Alex Azar argues at the #TIME100Health Summit https://t.co/HeGO98lZI2 \"I don’t have seven arms to hug them all.\" A year after their father's death in Afghanistan, a mother and her children struggle to move on https://t.co/qtW1EBcsoJ The #GravityChallenge is here to rain down on everyone with this visual gag https://t.co/XHSqEMH72H Gun battles sweep Mexican city after troops locate El Chapo's son https://t.co/WXvijYPKPn “I ran the VA under President Trump until he fired me. Our first Trump Tower meeting was a job interview unlike any other” https://t.co/YcWbh3H83L Trump, in Texas, bashes Democrats as 'crazy' and unpatriotic https://t.co/N0wT1UogHt \"While Trump’s use of the military is largely conventional, much of what passes for strategy from the White House is oriented toward what will benefit his re-election campaign\" https://t.co/wQARAj80fu “I know it’s going to affect us in a positive way,” says James Langer, whose startup is rolling out a line of THC vapor products in “Michelin chef-type” flavors https://t.co/KZdU2hWMtC \"In the end, racial diversity will not be ushered in by pledges, slogans or czars. It will be achieved only once white America is weaned off a prevailing narrative of racial pre-eminence\" https://t.co/XQywwcJO3M .@pabllovittar has seamlessly integrated the personal with the cultural and political, and is using her platform as a musical star to demand equality for LGBT communities in Brazil and beyond https://t.co/3V6UW89NI2 How the ban on medical advertising hurt women doctors https://t.co/BqzmsGgyNg \"Is she scared?\" Hong Kong leader's deputy catches flak for her no-show on government-funded radio https://t.co/BeNoyFPHzN While Rihanna still hasn’t confirmed whether a new album will be dropping for fans before the end of the year, she’s staying busy https://t.co/jQDp229M21 Disney’s \"Maleficent: Mistress of Evil,\" the sequel to its 2015 film \"Maleficent,\" is set to hit theaters this weekend  https://t.co/ukKW0ZNHjM Rep. Elijah Cummings, chair of the House Oversight Committee, dies at 68 https://t.co/Hb8jm5rmtT The portion of Americans who describe their religious identity as atheist, agnostic or \"nothing in particular,\" now stands at 26%, up from 17% in 2009 https://t.co/RWQ9utUn6i These were the biggest moments the inaugural #TIME100Health Summit  https://t.co/lbobjf1Ttn Anheuser-Busch accuses MillerCoors of stealing beer recipes https://t.co/JYZNXgsu8E This bishop is trying to bring peace to the world's newest country. And he's asking for America's help https://t.co/CXTa8hlvBM The head of the IMF says it will take more than a Sino-U.S. trade deal to boost growth https://t.co/Ym4QBsiWA1 Today, the Kurds saw Vice President Mike Pence seal their military defeat in the name of a “temporary ceasefire” https://t.co/Oxxd9DAatJ Pressure builds on President Trump as new revelations emerge about his dealings with Ukraine https://t.co/LvR6nUp3Mb Although the plot is minimally taxing and essentially uninteresting, Jolie is still majestic, writes TIME's @szacharek https://t.co/sBMhGQCxnA Watch @andrewbfeldman perform \"Waving Through a Window\" from @DearEvanHansen at the inaugural #TIME100Health Summit https://t.co/8eMhN3jRcM https://t.co/NHKV9I2w5z One month after 5-year-old Dulce Maria Alavez was last seen on a New Jersey playground, police have released a sketch of a man who they believe was a possible witness to her disappearance https://t.co/fi8SMnSQtZ Charlotte Charles and Tim Dunn say they made a deathbed promise to seek justice for their son — and they have every intention to keep it https://t.co/84blpO2Tr0 \"We’re all in it, at the end of the day, for our patients\" #TIME100Health https://t.co/zbRSHfTkR6 \"We're not as healthy as we should be.\" Fitbit CEO @parkjames discusses new AFib detection partnership with Bristol-Myers Squibb-Pfizer #TIME100Health https://t.co/TSc3SzPE1a 23andMe co-founder @annewoj23 says consumers with privacy concerns just need time to get used to genetic testing #TIME100Health https://t.co/2FvY870lZn Trump's Doral resort will host the G7. That will only raise more ethical questions https://t.co/1o1HNdeDmc Everything you need to know about the Keke Palmer memes everyone's going crazy for https://t.co/qSVYZCLyFx Last Mile Health CEO says underpaid women subsidize health care globally and doctors are often to blame https://t.co/XjcfpeY8oc \"There are caregivers everywhere.\" Here's the story behind that powerful photo of the nurse that's making the rounds https://t.co/0xmavkTKpF Comedian @TigNotaro on why humor was instrumental to healing after her cancer diagnosis: \"Something has to break the tension\" https://t.co/EBSjwMUBnZ https://t.co/k9e96YSEkB RT @rach_greenspan: I started crying while on the phone with Caty Nixon earlier today. Despite how hard her job can be, this labor and deli… Breaking: Energy Secretary Rick Perry has told Trump he will leave his post soon https://t.co/cuGWPKduj3 Comedian @TigNotaro on why humor was instrumental to healing after her cancer diagnosis: \"Something has to break the tension\" https://t.co/xkiWug2asB Thank you for following along with the inaugural #TIME100Health Summit, made possible with the support of our partners @alzassociation, @RockefellerFdn, @Smartsheet, and @khoslaventures https://t.co/dhY0eTbL4s Comedian @TigNotaro on the importance of being present and in the moment with people who are undergoing treatment or dealing with a disease #TIME100Health https://t.co/DVp7xOAUmv https://t.co/ntRICxn0eY Kylie Jenner singing \"Rise and Shine\" is the Internet's new favorite meme https://t.co/n0Ze6jPer5 Co-Founder and CEO of 23andMe @annewoj23 on putting the control of sharing genetic information in the hands of consumers #TIME100Health https://t.co/TTF8v9l6rL New York City police say a 20-year-old gang member has confessed to his involvement in a gun battle between rival groups that left one person dead and 11 wounded at a Brooklyn festival https://t.co/r8hQP21c7C At the #TIME100Health Summit, Dr. Naveen Rao speaks about the importance of health professionals learning from other industries about the benefits of technology https://t.co/CpxXvoGAz7 More than 75 million Americans are currently in a drought—and it's getting worse https://t.co/DAfPgeJZ8t \"We should pick the low-hanging fruit first.\" @BillClinton wades into the Democratic Party's health care debate #TIME100Health https://t.co/KsqNrT4k56 Tentative contract with striking GM workers gives pay hikes while factory closings move forward https://t.co/lO3lYHrQL9 \"Get over it.\" Trump tied Ukraine funding to an investigation of the DNC, says Mick Mulvaney https://t.co/FiEMTPATtq Firefighters who let this two-year-old do their nails couldn't be more pleased https://t.co/40vFmuZPal Bill Clinton on what the government should do going forward in health care #TIME100Health https://t.co/iPTnrGL2A1 RT @DrOz: Deeply appreciated my conversation with @SelmaBlair at the #TIME100Health Summit. She’s an incredible force for good in this worl… Presenting the inaugural #TIME100Health Summit, a convening of the world's most influential people in health https://t.co/D6z5wWzemp https://t.co/vNTtBnqDxr ⚡️ “Introducing the inaugural #TIME100Health Summit” https://t.co/AQcIBoCMFF TIME's award-winning \"Year in Space\" documentary is now available on Netflix. All 12 episodes of the original production can be streamed https://t.co/wysxUtJKoy A severe thunderstorm forced a plane carrying Kate Middleton and Prince William to abort a landing while flying in Pakistan https://t.co/KtJ4Foehdh Former President @BillClinton says it was Hillary Clinton who encouraged him to start running for his health #TIME100Health https://t.co/yCTt06MXi0 “Unfortunately I believe the class divide in the future will be data,” says Dr. Naveen Rao at the #TIME100Health Summit. “And if you’re not careful, those who have access to data will have better health than those who don’t have access to data” https://t.co/4DuyXYValE Kid hurdling down concrete steps in kayak rightfully earns his spot as latest viral internet star https://t.co/fWscRXNFHO Christy Turlington Burns talks about the importance of bringing together simple solutions and technology for better health care #TIME100Health https://t.co/RwCm5O0GZF Homeowner who found his basement flooded with five inches of blood is having a rough week https://t.co/UdFnxYvg2E “The financial consequences have been and may continue to be fairly dramatic,” NBA Commissioner Adam Silver said in his first U.S. interview about the league’s emerging conflict with China since he returned home from the country #TIME100Health https://t.co/6cCdQ6v2AN “I’m deeply disturbed by how healthcare has become so politicized.” @DrLeanaWen wants to have a more nuanced conversation about abortion https://t.co/zi1ajlaSVR It's important to \"look at human beings equally\" when it comes to health, says @CTurlington #TIME100Health https://t.co/3WlXaTFsjs Northeast bomb cyclone leaves more than 500,000 without power https://t.co/LvsZ6YiuxY https://t.co/8zOHO9kNJ9 Breaking: Mike Pence says Turkish President Erdogan agrees to cease-fire in Syria https://t.co/3glwpObzdC \"There’s more money and power to be made in the short run with division than unity,\" @BillClinton says at the #TIME100Health Summit. \"The voters need to stop rewarding that\" https://t.co/TtEWdM9JDy https://t.co/oCRL54t45R Christy Turlington Burns discusses the importance of starting sexual and reproductive health education in adolescence #TIME100Health https://t.co/5fA0SOye3Y Juul suspends sales of fruit and dessert flavors of e-cigarette https://t.co/q8oDqLZVVI Former President Bill Clinton speaks at the inaugural #TIME100Health Summit https://t.co/D6z5wWzemp https://t.co/bwbk2nIgtK Presenting the inaugural #TIME100Health Summit, a convening of the world's most influential people in health https://t.co/D6z5wWzemp https://t.co/zPScxRhvfp “I believe the class divide in the future will be data,” says Dr. Naveen Rao. “And if you’re not careful, those who have access to data will have better health than those who don’t have access to data.” \n\nThank you to our #TIME100Health Summit partner @RockefellerFdn https://t.co/gLSkWGwRti These are the most popular Netflix series and movies (according to Netflix) https://t.co/ulq9o6Euw1 \"If we don't have early detection, if we don't pursue it, we're not going to get there so that the therapies can be applied earlier and earlier,\" says @DrMariaALZ at the #TIME100Health Summit https://t.co/2Mxlxxi8kG \"I burned all the time.\" @SelmaBlair discusses her MS diagnosis and hope for effective treatments for chronic diseases https://t.co/KMF721IFGM RT @DrLeanaWen: We discussed that choice is predicated on privilege. Improving health is not enough unless we also focus on reducing dispar… E.U. leaders endorse Brexit deal, sending it to U.K. Parliament for ratification https://t.co/4M8GbOjlpS “It is not a matter of whether we will find a cure, it’s when,” says @DrMariaALZ.\n \nIn partnership with #TIME100Health Summit Knowledge Partner @alzassociation https://t.co/TOvjzrgezN RT @emmajune: “Women are dying not because we don’t know how to save them. They’re dying because we have yet to decide they’re worth saving… Actor and advocate @SelmaBlair hopes to \"do something for people\" who also struggle with a chronic disease #TIME100Health https://t.co/Lj1qXem7Qm Former Nazi SS guard goes on trial at age 93 for 5,230 counts of accessory to murder https://t.co/lv7qmfgIkR TIME Editor-in-Chief @efelsenthal: “We are living through epic global events, with a news cycle moving at warp speed, yet there is no topic more personal or more important to our audiences than their health and the health of their families” #TIME100Health https://t.co/SBGhT7SDtM RT @alzassociation: \"We're opening those doors to go beyond, get innovative and step up the pace.\" Our @DrMariaALZ on moving dementia resea… RT @RockefellerFdn: \"Giving birth is the most dangerous thing a woman can go through. Mothers give us 364 days a year, and on one day, they… Mike Pence meets with Turkish President Erdogan seeking Syria border cease-fire https://t.co/JKwdpKRkDG Have you ever had your DNA sequenced with an at-home kit? We’ll be discussing at the #TIME100Health Summit .@DrLeanaWen speaks at the \"Transforming Women's Health\" panel at the #TIME100Health Summit https://t.co/KVZCgz4QoV Barack Obama endorses Justin Trudeau ahead of Canadian elections https://t.co/Di1ircyryC NBA Commissioner Adam Silver discusses the impact that social media has on athletes' mental health at the #TIME100Health Summit https://t.co/DGltIdOC49 Medicare for All would actually be \"Medicare for None,\" HHS Secretary Alex Azar argues at the #TIME100Health Summit https://t.co/1BSWlnwpPW NBA Commissioner Adam Silver discusses the stigma around getting help for mental health in sports at the #TIME100Health Summit https://t.co/5RAAqq7pBd \"We wanted to make an absolute clear statement that the values of the NBA, these American values — we are an American business — travel with us wherever we go, and one of those values is free expression,\" NBA Commissioner Adam Silver says at the #TIME100Health Summit https://t.co/0V2YwPAPUF Former Vice President Al Gore says President Trump's conviction after impeachment is unlikely — but not impossible https://t.co/USOyDiopCi Rep. Elijah Cummings, chair of the House Oversight Committee, dies at 68 https://t.co/6kpu3wKEN5 https://t.co/hRRXrowk8X The #GravityChallenge is here to rain down on everyone with this visual gag https://t.co/s1RGTXkOyN U.S. Department of Health and Human Services Secretary @SecAzar on the passing of Rep. Elijah Cummings #TIME100Health https://t.co/oVqaDoFWmJ Nancy Pelosi used Trump's favorite medium, Twitter, to troll his claim that she's “unhinged” https://t.co/bMzYKSmixy “The fact that he does it openly and publicly doesn’t insulate it from the legal consequences of breaking the law,” former Vice President @algore says of President Trump’s actions addressed in the impeachment inquiry #TIME100Health https://t.co/PSjfRbEJKw RT @timeforkids: TFK Kid Reporter Raunak interviewed Al Gore backstage at the @TIME 100 Health Summit. About the climate crisis, the former… This five-hour window could be key to Trump’s impeachment inquiry https://t.co/yhbLj1SCYn RT @raisabruner: “The values of the NBA - American values - travel with us wherever we go... creating a platform for freedom of expression… Russia says 3 U.S. diplomats tried to enter the area of suspected August nuclear explosion https://t.co/PqU6YSW5Bi Watch @andrewbfeldman perform \"Waving Through a Window\" from @DearEvanHansen at the #TIME100Health Summit https://t.co/h9owCpkevY https://t.co/b95AaMsc9M \"It is not fair to put the burden on individuals to solve the climate crisis,\" @algore says at the #TIME100Health Summit https://t.co/WraWQmqRwP https://t.co/ssjIrGe42K RT @VeraMBergen: New with @aabramson: What happened behind the scenes between midnight and 5am on Sept. 9?\n\nSondland's testimony today coul… Rep. Elijah Cummings, chair of the House Oversight Committee, dies at 68 https://t.co/WUhlyOhyhI \"What President Trump did in betraying our longtime allies, the Kurds, in Northern Syria, is a shame and a disgrace that dishonors our country,\" former Vice President @algore says at the #TIME100Health Summit. \"Get this guy out of the office, one way or another.\" Northeast bomb cyclone leaves more than 500,000 without power https://t.co/uCVT1JLkeQ \"We need changes in government policies. And in order to get those changes we need to change the policy-makers in both parties,\" says former Vice President @algore at the #TIME100Health Summit https://t.co/h26KIPHmg9 The #TIME100Health Summit has started. Watch the live stream as former Vice President @algore discusses the future of global health with @nancygibbs https://t.co/h26KIPHmg9 Today's Word of the Day with @MerriamWebster is “Noachian” https://t.co/YEqRGARGJ4 RT @AlexSdelaGarza: With thousands sickened from vaping, I spoke to cannabis entrepreneurs in New York. They think the crisis will be good… Presenting the inaugural #TIME100Health Summit, a convening of the world's most influential people in health https://t.co/D6z5wWzemp https://t.co/5HVf21uIqQ RT @maddiecarlisle2: According to an updated report from @Everytown, 80% of children killed in mass shootings between 2009 and 2018 were ki… RT @Benioff: Watch the TIME 100 Health Summit Live Today - FREE ACCESS ALL DAY - An amazing vision for the future of health care curated by… Which disease scares you the most? #TIME100Health Introducing the inaugural #TIME100Health Summit. Watch the live stream as @BillClinton, @AshleyJudd, @SelmaBlair and more take the stage https://t.co/h26KIPHmg9 “I ran the VA under President Trump until he fired me. Our first Trump Tower meeting was a job interview unlike any other” https://t.co/UCFGPUGHpj The U.K. and the E.U. have come to a new agreement on Brexit, just two weeks before Britain is scheduled to leave the European Union https://t.co/TonQROSqGu https://t.co/jqWG78FBMc \"While Trump’s use of the military is largely conventional, much of what passes for strategy from the White House is oriented toward what will benefit his re-election campaign\" https://t.co/hHz5uq311G “I know it’s going to affect us in a positive way,” says James Langer, whose startup is rolling out a line of THC vapor products in “Michelin chef-type” flavors https://t.co/PZpn0JEC9z \"In the end, racial diversity will not be ushered in by pledges, slogans or czars. It will be achieved only once white America is weaned off a prevailing narrative of racial pre-eminence\" https://t.co/KrfFeNw8K6 Chicago teachers strike – canceling classes for 300,000 students  https://t.co/uXJcYDjpZQ \"I don’t have seven arms to hug them all.\" A year after their father's death in Afghanistan, a mother and her children struggle to move on https://t.co/IfDEb8PFZw .@pabllovittar has seamlessly integrated the personal with the cultural and political, and is using her platform as a musical star to demand equality for LGBT communities in Brazil and beyond https://t.co/GJdJezB01S How the ban on medical advertising hurt women doctors https://t.co/hLUmW8DKXF This bishop is trying to bring peace to the world's newest country. And he's asking for America's help https://t.co/IBZwr0j5Rz “Every country is home to domestic abusers. Only America gives them easy access to an arsenal and ammunition.”  https://t.co/kSIfp5FQFi The Internet reacts to CNN's question about Ellen DeGeneres at last night's Democratic presidential primary debate https://t.co/gzPVoc0W9n Breaking: U.K. and E.U. come to a new deal on Brexit https://t.co/qxxBN0iwcP Cummings' office said in a statement he passed away Thursday morning from \"complications concerning longstanding health challenges.\" https://t.co/Skq5PZkIBe Prince Harry close to tears during speech about Meghan Markle, baby Archie at charity event for sick children https://t.co/0kVM34SReb Alexander Gorbunov’s YouTube channel has racked up over 2 million views for his tirades on Russian politics, which he delivers deadpan each week from his wheelchair https://t.co/gVb7PqlOoM High anxiety in Brussels: Will Brexit deal be clinched? https://t.co/YHRALKidhA Chaos returns to Hong Kong's legislature as pro-democracy lawmakers disrupt leader's Q&amp;A session https://t.co/qzqxTacjLc U.S. delegation to seek a cease-fire with Turkey and the Kurds https://t.co/kTZugjLl2R “I ran the VA under President Trump until he fired me. Our first Trump Tower meeting was a job interview unlike any other” https://t.co/ySeS1JfbTJ Davóne Tines, who describes himself on his Instagram account as “young, gifted and Black,” is among the most compelling classically trained singers working in America today. Here's how he is confronting racism with his music https://t.co/dNbtYmbQqT Sega's throwback Genesis Mini is packed with good vibes https://t.co/IroAT2iWI1 https://t.co/CnaFaOHvJd Even before Bernie Sanders' heart attack rocked his campaign in early October, a large chunk of his 2016 supporters were already shopping for another candidate https://t.co/pq7ePV3Avr Review: Netflix's zany Paul Rudd vehicle \"Living With Yourself\" never lives up to its binge-worthy premise https://t.co/udZtJTENFU https://t.co/Et18XbUnCi \"As long as we remain in the shadows, people will continue to view us as the “other” or as newcomers, but it’s not that we are newly arrived in America — it’s that America hasn’t recognized our existence,\" writes author @julissaarce https://t.co/zDlEpt4O25 A study suggests tainted talcum powder can cause a rare cancer. Here's how it could play out in the courtroom https://t.co/pOTJvU6Ie6 America's founders disagreed about impeachment. Here's how the idea made it into the Constitution https://t.co/pvAcSizC62 Syrian forces enter a key border town, thwarting Turkish plans https://t.co/RA3NUjdkPv These are the most popular Netflix series and movies (according to Netflix) https://t.co/0HNDNxyQ3B The story of Elton John’s kaleidoscopic, Ozian life has been told many times over: in his own albums and in documentaries and books. But John never wrote a definitive autobiography—that is, until now https://t.co/iHBwtDem8a Opioid settlement talks broaden ahead of the first federal trial https://t.co/9yw6Jp4zeQ Fort Worth officer who killed Atatiana Jefferson was charged with murder. Here's what to know about the police shooting https://t.co/jQKaZlY9XY LeBron James \"at best bungled his response to a delicate international situation, or at worst turned on a fellow American who tried to express support for a pro-democracy movement,\" writes @seanmgregory https://t.co/CZmkCz3Nie Warren's new campaign finance plan is putting rivals like Biden and Buttigieg on the spot https://t.co/oVd7Ujn7LO Netflix heads into showdown with slowing subscriber growth https://t.co/LhT3gK1lux President Trump is scrambling to contain the damage from the U.S. pullout of Syria https://t.co/AkoZDP7k7y Police and protesters clash in Catalonia for a third consecutive night https://t.co/B2a7FeCFx6 California's outages show how climate change and corporate accountability are entangled https://t.co/zWioEpXCld The story of Elton John’s kaleidoscopic, Ozian life has been told many times over: in his own albums and in documentaries and books. But John never wrote a definitive autobiography—that is, until now https://t.co/i5nHulVrFt Most famously, President Franklin Delano Roosevelt already — unsuccessfully — tried Mayor Pete Buttigieg’s idea of expanding the bench to 15 Justices https://t.co/f0bYTntTmq A study suggests tainted talcum powder can cause a rare cancer. Here's how it could play out in the courtroom https://t.co/RHbwmydDj2 “I ran the VA under President Trump until he fired me. Our first Trump Tower meeting was a job interview unlike any other” https://t.co/hDlWPKoX1W Why the UAW's deal with General Motors is unlikely to give workers what they really want https://t.co/vHQl2Vs5Qj Even before Bernie Sanders' heart attack rocked his campaign in early October, a large chunk of his 2016 supporters were already shopping for another candidate https://t.co/k4Agb6QWcZ Here are the top 11 takeaways from the Democrats’ fourth primary debate https://t.co/SAFSROM9vn This September hit the record for the hottest ever — and 2019 is shaping up to be the second hottest year https://t.co/FlTsHkhim1 In the newly published autobiography \"Me,\" Elton John's writing breathes humanity into a family almost always shrouded in rigid formality https://t.co/ZRaLtuf8gg For around 36 hours, Fortnite was literally a black hole. Here's how the game turned a routine server outage into a minor media phenomenon https://t.co/CRFTlBPaJo Tom Steyer has spent $47.6 million on his Presidential campaign. That money could help Democrats in hundreds of state races https://t.co/xWm0x16vmK The more active your brain, the shorter your lifespan may be, a new study says https://t.co/QHo5wodrM1 https://t.co/VKWJlhUiLJ RT @suyinsays: today @stormzy's imprint @MerkyBooks announced they will be publishing the majestic @malorieblackman's autobiography⭐️⭐️⭐️ h… Parents of murdered gay student Matthew Shepard criticize Attorney General Barr over LGBT rights https://t.co/enIT8tTLM6 “I don’t want to be overly hyperbolic about it but world peace really depends on the health of women and children.” Rep. Chrissy Houlahan wants to restore U.S. funding to U.N. reproductive-health agency https://t.co/WOdmwljbP2 Fate conspired in the favor of this woman: After fostering a puppy last year, she was reunited with sweet dog Winnie https://t.co/UG7LNJ6gCG Photobombing legend in the background of this wedding photo is clearly the only one having the best day https://t.co/A5jIC32yBh Liberal and conservative justices seemed split on whether to grant a new sentencing hearing to Lee Boyd Malvo, who as a teenager was one of two snipers who terrorized the Washington area, killing 10 people https://t.co/FnO466jxd8 During White House meeting, Trump surprised family of dead U.K. teen by offering to introduce them to woman suspected of killing him https://t.co/TMuvcUnpRn https://t.co/wKFoKAYGAt Brothers Justin and Jeremiah Raisen claim say they deserve writing credit on Lizzo's “Truth Hurts,” which spent six weeks on top of Billboard’s Hot 100 chart this year https://t.co/84NQXFGIiD The \"my headphones\" meme is here to say everything you can't about how you're really doing https://t.co/ssJ9Plrkgz Kylie Jenner singing \"rise and shine\" to her daughter is the Internet's new favorite meme to greet the day with https://t.co/ez9wQQ5toT House approves bipartisan measure condemning Trump's withdrawal of U.S. troops in Syria https://t.co/uvhnArW55y She accused a senior partner of sexual assault. The law firm has now placed her on leave https://t.co/dyDiuTIy74 Many factors influence how long somebody lives. Some, like their genes, are out of their control. Others, like their lifestyle and environment, are a bit easier to alter. A new paper finds another factor that falls somewhere in between those extremes https://t.co/YQsZ4H1Qkg “They don’t give us answers. Nothing progresses.” Mexican asylum seekers are facing long waits at the U.S. border — advocates say that's illegal https://t.co/cj9ejGHCQ2 Pakistani and Indian troops exchange gunfire in Kashmir, killing 4 civilians https://t.co/F98A5cZw82 During White House meeting, Trump surprised family of dead U.K. teen by offering to introduce them to woman suspected of killing him https://t.co/oqAADR2Nlb A Florida man wanted in a campaign finance case involving associates of Rudy Giuliani is in federal custody after flying to New York City to turn himself in, federal authorities said https://t.co/NpEtJYeLlC Prince Harry appears close to tears during speech about Meghan Markle, baby Archie at charity event for sick children https://t.co/ivAZDbGLqJ https://t.co/DrMjiUbZk4 How the ban on medical advertising hurt women doctors https://t.co/6faxs4Upf0 Yahoo could owe you up to $358 for data breaches. Here’s how to file your claim https://t.co/OJB8i2Z9DF https://t.co/d4EJitQ9cG This bishop is trying to bring peace to the world's newest country. And he's asking for America's help https://t.co/Dbn7cRXLBE Democrats protest Trump's $200M transfer of funds from Pentagon anti-drug efforts to border wall https://t.co/VzQK9cjiwq U.K. family claims they're detained in \"dirty\" conditions after accidentally driving across U.S. border https://t.co/YkLDDVD5Qb Trump joins the President of the Italian Republic Sergio Mattarella for a press conference https://t.co/aL1U1BaV2b General Motors and United Auto Workers reach tentative deal that could end strike https://t.co/nbJJBEYkRV The Internet reacts to CNN's question about Ellen DeGeneres at last night's Democratic presidential primary debate https://t.co/Z9n8kqJQTz RT @shustry: NEW report details how President Trump’s allies built ties to an indicted Ukrainian oligarch over last 3 months. https://t.co/… Even before Bernie Sanders' heart attack rocked his campaign in early October, a large chunk of his 2016 supporters were already shopping for another candidate https://t.co/cHQWCr3IKC Wheel of Fortune contestant caught people off guard by describing his \"loveless marriage\" https://t.co/8CEbknERoN Prince Harry close to tears during speech about Meghan Markle, baby Archie at charity event for sick children https://t.co/UMaVy8VwxE Sega's throwback Genesis Mini is packed with good vibes https://t.co/XeOk1t8m4i https://t.co/CnaFaOHvJd Bride is likely more in love with this chicken nugget bouquet and who can blame her? https://t.co/kiYMYFfaEI Gina Rodriguez apologizes for singing Fugees song with N-Word lyrics on social media https://t.co/08AQrG72Le If you or someone you know may be contemplating suicide, call the National Suicide Prevention Lifeline at 1-800-273-8255 or text HOME to 741741 to reach the Crisis Text Line. In emergencies, call 911, or seek care from a local hospital or mental health provider. New York City police officer dies by suicide — the 10th NYPD suicide in 2019 https://t.co/Y9bH8dJ0DC Alexander Gorbunov’s YouTube channel has racked up over 2 million views for his tirades on Russian politics, which he delivers deadpan each week from his wheelchair https://t.co/EVY1q1CPBU After spending 42 years in prison protesting his innocence, a New Orleans man is being freed in a plea deal bargain https://t.co/vvyeyeFl7l Today's Word of the Day with @MerriamWebster is “genial” https://t.co/H1hEYBT7LL “I ran the VA under President Trump until he fired me. Our first Trump Tower meeting was a job interview unlike any other” https://t.co/G7Wx8J8Y8q U.N. finds one-third of all children under age 5 are undernourished or overweight https://t.co/9lVucZaRhP Fact-checking the candidates' claims from the fourth #DemocraticDebate https://t.co/LKhgIBCACe Yahoo could owe you up to $358 for data breaches. Here’s how to file your claim https://t.co/lYZWqdkuaG A Maine high school is suspending three students who posted notes warning of a \"rapist in our school,\" arguing the notes constituted bullying https://t.co/9Qmbi8YE7p Alexandria Ocasio-Cortez and Ilhan Omar are endorsing Bernie Sanders for President https://t.co/JcVcdslvw0 Here's what each 2020 candidate said about impeaching President Trump at the #DemocraticDebate https://t.co/KcsFX8l8sS Kellyanne Conway's husband, George Conway, has donated over $5,000 to President Trump's GOP primary challenger Joe Walsh  https://t.co/pH1khqIslb Davóne Tines, who describes himself on his Instagram account as “young, gifted and Black,” is among the most compelling classically trained singers working in America today. Here's how he is confronting racism with his music https://t.co/LgVCq83GHA \"As long as we remain in the shadows, people will continue to view us as the “other” or as newcomers, but it’s not that we are newly arrived in America — it’s that America hasn’t recognized our existence,\" writes author Julissa Arce https://t.co/1LvFh0KKBj \"No credibility in our neighborhood.\" Fort Worth's police shooting of Atatiana Jefferson strengthens community distrust https://t.co/fgTMAQbCHr Exclusive: How a Ukrainian oligarch wanted by U.S. authorities helped Giuliani attack Biden https://t.co/niXb8Gkfwq Brexit negotiators fail to reach a breakthrough as talks continue ahead of a crucial E.U. summit https://t.co/m7A0tj92cr Martin Scorsese revealed the true meaning of Leonardo DiCaprio's final line in 'The Departed' https://t.co/QLUD8C4pOL Kim Jong Un vows to fight U.S. sanctions as deadline for nuclear talks nears https://t.co/b2ODl7swg7 Sega's throwback Genesis Mini is packed with good vibes https://t.co/VMNvYXtePo A Turkish bank has been charged with evading U.S. sanctions on Iran https://t.co/UpAfoEWNpp The story of Elton John’s kaleidoscopic, Ozian life has been told many times over: in his own albums and in documentaries and books. But John never wrote a definitive autobiography—that is, until now https://t.co/cT88PiRKCb Meet Brian Gitta, the man whose bloodless test is revolutionizing the fight against malaria https://t.co/MtKFMRtXpE A study suggests tainted talcum powder can cause a rare cancer. Here's how it could play out in the courtroom https://t.co/69h1glz0cn Google has unveiled a new Pixel smartphone, an AirPod rival and more at the #MadeByGoogle 2019 event. Here's what to know https://t.co/TlPPMlzgqN Here are the highlights from October's Democratic presidential primary debate #DemDebate https://t.co/dBwF3atuFG https://t.co/GcqgJcWTDW Global economic growth this year will be the weakest since the 2008 financial crisis, the International Monetary Fund predicts https://t.co/Cy3iYUFOvh How Moroccan artist Zainab Fasiki is using comic books to fight sexism https://t.co/eWEYhE8aNN 11 biggest takeaways from the October Democratic debate\n https://t.co/mgyOMUGmFQ Hunter Biden admits \"poor judgment\" in taking a position on the board of a Ukraine gas company but denies wrongdoing https://t.co/sGV8ZpcyS6 Bernie Sanders leverages the debate for a comeback just weeks after a heart attack https://t.co/zIfPPdWP3J How LeBron James reignited the NBA-China conflict just days before tipoff https://t.co/3rOq8IgG7y Hong Kong leader's annual policy speech adjourned after rowdy lawmakers disrupt proceedings https://t.co/N8rKQCV4vi https://t.co/VzSYXxWA7e \"I am deeply grateful to President Obama who fought so hard to make sure that agency was passed into law,\" Sen. Elizabeth Warren said after Joe Biden tried to claim credit for helping win approval for the Consumer Financial Protection Bureau #DemocraticDebate https://t.co/6b4w5qgEQq Trump's \"window dressing\" sanctions are not expected to affect Turkish economy https://t.co/gShZdpCI5s Fact-checking the candidates' claims from the fourth #DemocraticDebate https://t.co/xMTfSwAv0h Sega's throwback Genesis Mini is packed with good vibes https://t.co/garKtbcC0v https://t.co/CnaFaOHvJd “You all saw a couple of days ago what happened to Atatiana Jefferson,” says Julián Castro. “I’m not going to give these police officers another reason to go door-to-door in certain communities because police violence is also gun violence” #DemDebate https://t.co/plq61d8xBX https://t.co/r1Iu2V6vBS Hong Kong leader's annual policy speech adjourned after rowdy lawmakers disrupt proceedings https://t.co/jab0jjuiWF When asked about how he would enforce weapon buybacks, Beto O'Rourke said, “If someone does not turn in an AR-15 or an AK-47…then that weapon will be taken from them. If they persist, there will be other consequences” #DemocraticDebate https://t.co/fnP8r0kOAt https://t.co/k5Cm0PK8gs Andrew Yang on the opioid crisis: “We need to decriminalize opiates for personal use. We have to let the country know this is not a personal failing, this was a systemic government failing” #DemocraticDebate https://t.co/G3pGPR6qC5 https://t.co/7vhS9i6ELf Following a heart attack earlier this month, Sen. Bernie Sanders answers a question at the #DemocraticDebate on how he can reassure Democratic voters that he’s up to the stress of the presidency https://t.co/PtHgDpS9Yw https://t.co/1LT8JoRtcX Rep. Tulsi Gabbard and Mayor Pete Buttigieg, the only two veterans in the October Democratic debate, sparred sharply over the U.S.’s policy in Syria. Read more here #DemocraticDebate https://t.co/OzK2XfHqcQ https://t.co/Zkxki3RJsZ “I never discussed a single thing with my son about anything having to do with Ukraine.” Joe Biden addresses son Hunter’s Ukraine business interests at the #DemocraticDebate https://t.co/JO8qFzRMpv https://t.co/CSdozbs9a9 Catalan protesters and police clash for a second straight night https://t.co/y5ayeGBsiY Russia seeks to cement its role as a power broker in Syria by deploying troops https://t.co/vGMquXGP8C Buttigieg has argued that the dramatic proposal would actually help the court in the long run by defusing some of the recent drama over nominations — read more about the idea to expand the Supreme Court here https://t.co/M9D8LvWSoV “We can’t go on like this, where every single time there is a vacancy, we have this apocalyptic ideological fire fight over what to do next,” Mayor Pete Buttigieg says at the #DemDebate about expanding the Supreme Court https://t.co/WnjGDKtXb1 https://t.co/3ew19XQTFJ After suffering a heart attack at the beginning of October, Bernie Sanders attempted to quell worry over his capacity for the presidency during the #DemDebate https://t.co/doX2CWFEbx https://t.co/pTsKuikC6l Here's what each 2020 candidate said about impeaching President Trump at the #DemDebate https://t.co/U7IzWoVVFI The Fort Worth officer who killed Atatiana Jefferson was charged with murder earlier this week. Here's what to know about the police shooting https://t.co/q2tv4oFmIm “You all saw a couple of days ago what happened to Atatiana Jefferson,” says Julián Castro. “I’m not going to give these police officers another reason to go door-to-door in certain communities because police violence is also gun violence” #DemDebate https://t.co/K8Rrvpdc29 https://t.co/TKFAT6QKUQ “Let’s go to the most important international problem that we’re facing which no one has brought up, which is climate,” Tom Steyer says at the #DemDebate https://t.co/PghBw79QAS https://t.co/xiP2q9KyI4 \"The expectation is that Americans will follow the law. I believe in this country. I believe in my fellow Americans. I believe that they will do the right thing,\" Beto O'Rourke said about how he would enforce mandatory buybacks of AR-15s and AK-47s https://t.co/3AS2PqpKt9 https://t.co/8CioHY2rlu “It has been the most shameful thing that any president has done in modern history in terms of foreign policy,” Biden answers after being asked about Trump’s decision to withdraw troops from Syria at the #DemDebate https://t.co/595wIVypWO https://t.co/nnScbAoh0L U.N. Finds One-Third of All Children Under 5 Are Undernourished or Overweight\n https://t.co/IiOZOqPgHI California fuel storage facility blaze causes authorities to order thousands to stay inside https://t.co/sCYku8k5Yj “We’ve got one shot to make Donald Trump a one-term president. And how we talk about people on this stage actually really matters,” says Sen. Cory Booker. “Tearing each other down because we have a different plan to me is unacceptable” #DemDebate https://t.co/5X1KkSiDF7 https://t.co/7MkYvp8xR3 Impeachment took center stage as soon as the #DemDebate kicked off, marking a turn away from prior Democratic primary debates, which began with questions about health care https://t.co/iCaKQME6F2 https://t.co/g2h0An8V1Y Yahoo could owe you up to $358 for data breaches. Here’s how to file your claim https://t.co/5sVwZ1A193 https://t.co/kj0o3F706t Sen. Elizabeth Warren at the #DemDebate: \"My question is not why do Bernie and I support a wealth tax, it’s why does everyone else on this stage think it is more important to protect billionaires than it is to invest in an entire generation of Americans\" https://t.co/4SDapwKQ3m https://t.co/xCcw9LGVm3 “I am having deja vu all over again, first of all, because I saw this play in 2016’s election,” said Sen. Cory Booker at the #DemDebate https://t.co/q6Uo9dfKtj https://t.co/XPi3a4khzk Rudy Giuliani gives Congress the legalese version of a middle finger https://t.co/4mQ0uQxxBx RT @VeraMBergen: NEW: In their effort to discredit Trump’s perceived enemies, the president's close allies received key documents and infor… \"I’m getting a little bit tired, I must say, of people defending a system which is dysfunctional, which is cruel,\" says Sen. Bernie Sanders. \"The issue is whether the Democratic party has the guts to stand up to the health care industry\" #DemDebate https://t.co/xjtqVc6EMr https://t.co/PjX1mZLKsz Authorities continue search for missing man in New Orleans hotel collapse wreckage https://t.co/UfHAcyWvPs https://t.co/XI5JlSOQIi Over the last two months, a TIME investigation has traced some of Giuliani’s claims about Biden and Mueller to a troubling relationship. \n\nRead more about those claims here https://t.co/vCVtenYf2I Asked about his ties to the Firtash legal team, Giuliani wrote in a text message to TIME on Tuesday: “I do not represent Mr. Firtash and I have never met him” In his frequent appearances on cable news, Giuliani has presented some of these documents to the American public as evidence for his claims of wrongdoing by Mueller and Biden Firtash’s lawyers have passed these documents and other information to associates of Trump’s personal lawyer Rudy Giuliani Lawyers working for Firtash have gathered documents that make controversial allegations against former special counsel Robert Mueller and former Vice President Joe Biden The information came from the legal team of Dmitry Firtash, a wealthy industrialist with assets across Europe, who has spent the last five years in Vienna fighting extradition to the U.S. on bribery and racketeering charges Exclusive: In their effort to discredit President Donald Trump’s perceived enemies, close allies of the President have received key documents and information from a Ukrainian oligarch wanted in the U.S. on corruption charges https://t.co/vCVtenYf2I \"This President has not been putting America in front of his own personal interests,\" Sen. Amy Klobuchar says at the #DemDebate https://t.co/QZQ0byyD1E https://t.co/d36h72ErHn Exclusive: How a Ukrainian oligarch wanted by U.S. authorities helped Giuliani attack Biden https://t.co/vCVtenYf2I Sen. Kamala Harris on President Trump: \"He has consistently, since he won, been selling out the American people\" #DemDebate https://t.co/daz7zNU9N8 https://t.co/qLDakRyKFS House passes 3 bills to support pro-democracy protests in Hong Kong https://t.co/RG089eS1vf October Democratic debate live: Elizabeth Warren, Joe Biden and more to take the stage in Ohio https://t.co/DZaBib73Bc Even before Bernie Sanders' heart attack rocked his campaign in early October, a large chunk of his 2016 supporters were already shopping for another candidate https://t.co/tbbfoWbCh4 Tonight, a record-breaking 12 candidates will grace the Democratic presidential primary debate stage in Westerville, Ohio. #DemDebate https://t.co/YwG8TnJDNJ Twelve candidates will take the stage. Here's everything you need to know about tonight's #DemDebate  https://t.co/JXDvOvfJKa 'No credibility in our neighborhood.' Fort Worth's police shooting of Atatiana Jefferson strengthens community distrust https://t.co/whAsJnr5Mn Review: Netflix's zany Paul Rudd vehicle \"Living With Yourself\" never lives up to its binge-worthy premise https://t.co/W5iJddRinc https://t.co/Et18XbUnCi How LeBron James reignited the NBA-China conflict just days before tipoff https://t.co/f9Tsvmd0C5 https://t.co/9fPR1FGyIN Fate conspired in the favor of this woman: After fostering a puppy last year, she was reunited with sweet dog Winnie https://t.co/ytKXJtWW3r \"As long as we remain in the shadows, people will continue to view us as the “other” or as newcomers, but it’s not that we are newly arrived in America — it’s that America hasn’t recognized our existence,\" writes author Julissa Arce https://t.co/jgxAHTN8qb Update: These are the key U.S. and Ukrainian players in the Trump impeachment inquiry https://t.co/6liQcx4syq Martin Scorsese just revealed the true meaning of Leonardo DiCaprio's final line in \"The Departed\" https://t.co/kcLLOWbClN 13 officers were killed as gunmen ambushed a police convoy in Mexico https://t.co/Me7nTwnbVW https://t.co/ZR93CqGIy1 North Korea, South Korea play soccer World Cup qualifier in empty Pyongyang stadium https://t.co/R5WvQBU1xC President Trump welcomes 2019 Stanley Cup champions St. Louis Blues https://t.co/EumCNcOu8B A study suggests tainted talcum powder can cause a rare cancer. Here's how it could play out in the courtroom https://t.co/QOPHOnlaKt Trump's \"window dressing\" sanctions are not expected to affect Turkish economy https://t.co/oNanXMiavA Felicity Huffman begins 2 week prison sentence for college admissions scandal https://t.co/rETCJh3c4A Indiana fire kills nearly 2,000 competitive racing pigeons https://t.co/TmN50edA4x America's founders disagreed about impeachment. Here's how the idea made it into the Constitution https://t.co/TpTVz7arRY Alyssa Milano jokes about an all-dog Charmed reboot and we are 100% on board for it https://t.co/rGXCAWDgjy Former U.S. President Bill Clinton will join the #TIME100Health Summit on October 17 to discuss the future of health care https://t.co/szRoWOVe2j After a Michigan man in a domestic dispute pulled a knife, police tased him. He fell on the knife and died https://t.co/WWYmkBtGoc The upcoming \"Jay and Silent Bob Reboot\" movie boasts a slew of celebrity cameos, but one in particular has a fairly crazy backstory: Ben Affleck https://t.co/WLmD8zdR5l The story of Elton John’s kaleidoscopic, Ozian life has been told many times over: in his own albums and in documentaries and books. But John never wrote a definitive autobiography—that is, until now https://t.co/X7DmasklFv An American prosecutor has been shot dead in Micronesia https://t.co/QGnju7vklv Warren's new campaign finance plan is putting rivals like Biden and Buttigieg on the spot https://t.co/DW69eD1HcX LeBron James \"at best bungled his response to a delicate international situation, or at worst turned on a fellow American who tried to express support for a pro-democracy movement,\" writes @seanmgregory https://t.co/n2Y9AR32uj RT @maddiecarlisle2: What’s that? It’s already time for another Democratic debate? \n\nI got you. Here are the details on tonight’s #DemDebat… Fort Worth officer who killed Atatiana Jefferson was charged with murder. Here's what to know about the police shooting https://t.co/rGhAMtCPB7 John Bolton called Giuliani a \"hand grenade\" because of Ukraine activities, a former White House aide says https://t.co/R6SwK71O2E The phrase #MeToo was first used more than a decade ago by @TaranaBurke. While the 2017 reckoning appeared to have sprung up overnight, it had actually been simmering for years, decades, centuries — women had had it with the fear of retaliation https://t.co/8t1ulL2Y63 Google just unveiled a new Pixel smartphone, an AirPod rival and more at the #MadeByGoogle 2019 event. Here's what to know https://t.co/LmY5Rasic8 Some kids cower in fear when encountering spooks and frights in the Halloween store. This kid is not that kid https://t.co/PQSTTeO40Y The man lost his wallet only to be reunited with it through his own bank account https://t.co/5Qh4pNRJwt “We need these candidates to see us as a power base,” says #MeToo founder @TaranaBurke. She is launching the hashtag #MeTooVoter in a new effort intended to mobilize voters heading into the 2020 election https://t.co/X8oVZfA9M6 This new addition to Starbucks’ “secret menu” affords coffee lovers the opportunity to add a villainous touch to the Matcha Green Tea Creme Frappuccino https://t.co/MDA7PupbE0 \"Criminal justice reform shouldn't just focus on people behind bars. Here's how we can improve the lives of millions more,\" by Minnesota Gov. Tim Walz and Missouri Gov. Mike Parson https://t.co/UEV845E0dR Two years ago, @Alyssa_Milano tweeted, “If you've been sexually harassed or assaulted write ‘me too’ as a reply to this tweet.” She woke up to find that more than 30,000 people used #MeToo. Read TIME’s 2017 Person of the Year story on the Silence Breakers https://t.co/zUvHPsfcDQ https://t.co/FE5XuNviat \"They don’t have hope right now.\" Cyntoia Brown speaks out for women in prison in her first interview since being released https://t.co/OFNCBk9IDk Global economic growth this year will be the weakest since the 2008 financial crisis, the International Monetary Fund predicts https://t.co/A2RYduK3Zn Twelve candidates will take the stage tonight. Here's what to know about the October Democratic debate https://t.co/dTyzlFJ01t Two years ago today, the #MeToo hashtag went viral. “With no presidential candidate that seems willing to truly and publicly grapple with this bipartisan issue, we must once again raise our voices,” writes @TaranaBurke https://t.co/JbhXAwF7UO Today's Word of the Day with @MerriamWebster is “belfry” https://t.co/wFJzjA9luQ A U.S. official says the approximately 1,000 U.S. troops being withdrawn from northern Syria will reposition in Iraq, Kuwait and possibly Jordan https://t.co/JkobWjOCJU “Trump, as always, has been his own senior strategist, leaving his aides scrambling to keep up. Two moves in particular are complicating his defense,” writes @ByBrianBennett https://t.co/8ffExKbQdY Hunter Biden, the son of the former Vice President, acknowledged having “poor judgment” in deciding to taking a position on the board of a Ukrainian natural gas company — but firmly denied having done anything wrong https://t.co/48oJ9de4jj Everything you need to know about the October Democratic debate https://t.co/lQp70d3Qw2 Harold Bloom, author of 'Anxiety of Influence,' dies at 89 https://t.co/9aGB42jT6h Brazen thief steals $20,000 Dali artwork, entitled \"Burning Giraffe,\" from San Francisco gallery https://t.co/jDGivSqHsW Younger candidates hope to edge out front-runners at the Democratic debate https://t.co/aMttfDanWs .@pabllovittar has seamlessly integrated the personal with the cultural and political, and is using her platform as a musical star to demand equality for LGBT communities in Brazil and beyond https://t.co/vCuRRmK0XE \"We must move the issues of war and peace from the periphery of our national discourse to its center,\" @elliotackerman writes in TIME's special report. \"And the only way to do that, I increasingly believe, is to reconsider the draft\" https://t.co/WyZbclw47D https://t.co/xoZTGd0R0r Top national Republican and Democratic strategists are urging party leadership to put less emphasis on Ohio’s electoral votes this time around https://t.co/lKg4a2kFSX Margaret Atwood and Bernardine Evaristo share fiction's prestigious Booker Prize https://t.co/I6heTvo8Xf Trump's erratic moves hamper the White House's ability to develop an impeachment defense https://t.co/Lb68EmcDEn All-boys schools are considering their role in 2019 amid conversations about the #MeToo movement, toxic masculinity and gender equality https://t.co/vbMzujjcTk \"The freedom Hong Kong needs most is freedom from violence,\" writes Ronny Tong, a member of the city's de facto cabinet https://t.co/Wui5tSEewx “Like any authoritarian regime,” Russian blogger Alexander Gorbunov says, “this one is most afraid of being laughed at\" https://t.co/LKcwKKI7NL Pakistan could join North Korea and Iran on a blacklist of countries financing terrorism https://t.co/PWH8E5HBo2 Hydraulic issue leads Southwest Airlines to evacuate plane in Chicago https://t.co/PMu377ORVa From the star-studded 'Little Women' to the terrifying 'Doctor Sleep,' here are 10 upcoming movies based on books https://t.co/MgbEyT6z4G Money and a hatred for the Kurds drives Turkey's Syrian fighters https://t.co/xqPsQGZoRT People wore white gloves to look through Rihanna's new 15-pound book at her party https://t.co/fnxZ9Hf7DG “I have absolutely no memory of ever seeing her,” says photographer David Burnett. “It was an accident, but sometimes accidents are the best pictures” https://t.co/lD2yaPyAtc Trump levels sanctions on Turkey in an attempt to contain the chaos wreaked by his Syria withdrawal https://t.co/7SkhjCrkPL Listen to the song that Hong Kong's youthful protesters are calling their 'national anthem' https://t.co/SnVEOrYLp5 Meet Brian Gitta, the man whose bloodless test is revolutionizing the fight against malaria https://t.co/NzDtjq28s7 K-Pop star and actress Sulli found dead at age 25 https://t.co/5D4xGMIBSc 13 officers were killed as gunmen ambushed a police convoy in Mexico https://t.co/fOwqCqeRwb The White House says President Trump “strongly condemns” a violent video played at a free speech conference at his Miami resort https://t.co/hWODxfYOHA “We have to produce journalism worth paying for.” How A.G. Sulzberger is leading the New York Times into the future https://t.co/symwwqROsD \"I don’t have seven arms to hug them all.\" A year after their father's death in Afghanistan, a mother and her children struggle to move on https://t.co/It9E8HjXfZ \"Candidates have a responsibility to address the rampant sexual violence that permeates all of society’s systems and structures, including government,\" writes @TaranaBurke https://t.co/H3i5CQXjO5 Brazen thief steals $20,000 Dali artwork, entitled \"Burning Giraffe,\" from San Francisco gallery https://t.co/kjHv0Dvb0w \"In the end, racial diversity will not be ushered in by pledges, slogans or czars. It will be achieved only once white America is weaned off a prevailing narrative of racial pre-eminence\" https://t.co/AHWRvK2C2P A destructive fire in Los Angeles began beneath a high-voltage transmission tower, the Fire Department says https://t.co/J13Lod2agM The “Succession” Roy family power rankings: Season 2 finale https://t.co/AIByXh5lkA Younger candidates hope to edge out front-runners at the Democratic debate https://t.co/yNOGXaLB6x Aaron Paul on revisiting his “old friend” Jesse Pinkman in “Breaking Bad: El Camino” https://t.co/AfN5eBxXgn https://t.co/apUWpjq32F Davóne Tines, who describes himself on his Instagram account as “young, gifted and Black,” is among the most compelling classically trained singers working in America today. Here's how he is confronting racism with his music https://t.co/uBdHVPA6Qo \"While Trump’s use of the military is largely conventional, much of what passes for strategy from the White House is oriented toward what will benefit his re-election campaign\" https://t.co/rv5sr8Uij2 Ocean exploration changed human history — and the story started centuries before Christopher Columbus https://t.co/JSX8MoxaMN Margaret Atwood and Bernardine Evaristo share fiction's prestigious Booker Prize\nhttps://t.co/z0UIZJodEN What is the role of an all-boys school in 2019? How the elite institutions are trying to adapt https://t.co/WjpsJTUGoU Columbus Day, Indigenous Peoples Day and the problem with \"discovery\" https://t.co/ez8n67Et7W https://t.co/s5PqNsBG7u .@aliwong's debut memoir \"leaves no taboo or intimate topic untouched, from Wong’s sexual experimentations and misadventures in self-grooming to her heartbreaking miscarriage and the impact of her father’s death\" https://t.co/3Wwb3hBymX Fort Worth officer who killed Atatiana Jefferson quits. Here's what to know about the police shooting https://t.co/SmrQCoblRL Rihanna had the most Rihanna reaction at this ball to someone who was a little too comfortable in her zone https://t.co/c52AzxXkkQ President Trump announced his Administration’s intention to level economic sanctions, hike tariffs and halt trade negotiations as a result of Turkey’s military incursion in Syria against the Syrian Kurds https://t.co/nlxUMsIXQF Uber rider struck, killed after jumping out of car on Los Angeles freeway https://t.co/6t2aO9aZ3l “I have absolutely no memory of ever seeing her,” says photographer David Burnett. “It was an accident, but sometimes accidents are the best pictures” https://t.co/13mbmk4agG October’s Democratic presidential primary debate is a big one, literally — twelve candidates will appear onstage together tomorrow night. Here's everything to know https://t.co/vb7Gw9lRRH The history behind the movement to replace Columbus Day with Indigenous Peoples' Day https://t.co/w4OfZSZ2ny This expressive sign language interpreter's jubilant dancing is truly inspirational https://t.co/siMiebbefD “The story of yellow fever’s arrival in the New World is a grim lesson in humility: no matter how much we try to control our surroundings, we cannot escape the damage we inflict on other people and the natural world” https://t.co/YqvaC6Y4qX In a lengthy Twitter thread, Disney unveiled the extremely extensive list of movies and shows coming to Disney+. Here are some of the best reactions to the list https://t.co/ck88ijhG7C Which colors do you see? https://t.co/AQIhFnKlpe Top national Republican and Democratic strategists are urging party leadership this time around to put less emphasis on Ohio’s 18 electoral votes as a once-indispensable stepping stone to the 270 required to win the Presidency https://t.co/SdbI4DgCHW In an interview with TIME, @UNReliefChief Mark Lowcock discussed how the new front in Syria’s complex war is exacerbating an already dire humanitarian situation, and urged Turkey to “live up to assurances” made to the UN to protect civilians in harm’s way https://t.co/xUnZy7DoM2 Here's everything we know about Elena Ferrante's new novel - her first since the best-selling Neapolitan Quartet https://t.co/Eonhint6QB Ocean exploration changed human history — and the story started centuries before Christopher Columbus https://t.co/hJvk0HofJl The White House says President Trump “condemns” violent video depicting a likeness of him shooting and stabbing opponents and members of the news media https://t.co/rZaG8ulcWA People wore gloves to look through Rihanna's through her new book at her party and other things we saw there https://t.co/AguCyKEy2I President Trump tweeted that viewers should vote for former White House press secretary Sean Spicer on “Dancing with the Stars” https://t.co/Y6T8EOIKlW The Fortnite black hole was very good for meme content https://t.co/sO69EW37PQ One state's solution to food waste in schools? Pigs https://t.co/8NeG2uSfxN From “Little Women” to “Motherless Brooklyn,” here are 10 movies based on books that are out this fall https://t.co/jlReZJR3Ip The “Succession” Roy family power rankings: Season 2 finale https://t.co/S0lnQexUx0 This dog found endless amusement from a ceiling fan and toilet paper https://t.co/TD1T2sy6z8 A man wearing a Colin Kaepernick jersey was thrown out of Trump's Minneapolis rally on Thursday. Here's what he says happened https://t.co/FUZa58l5lj Pope Francis accidentally tweeted his support for the New Orleans Saints and the fans loved it https://t.co/b7nitC1VPV South Korean pop star and actress Sulli was found dead at her home south of Seoul on Monday, police said https://t.co/IyzhPH0CmW https://t.co/wp5GOaQyxH Ryan Reynolds couldn't let Hugh Jackman's birthday go by without a fittingly “hurtful” song https://t.co/3SQ6uRHsaK \"Layered and contemplative, 'Dad's Maybe Book' immerses itself in the bones of modern American life\" https://t.co/K62fbgB4IN What is the role of an all-boys school in 2019? How the elite institutions are trying to adapt https://t.co/4uAK3W884X Man made everyone burst into laughs at his funeral with a very lighthearted plan https://t.co/P3y3UJL6Xv “Narratives influence our economic decisions, and a recession could discredit President Trump.” An interview with Nobel laureate Robert Shiller https://t.co/KLHeIAPwZp RT @billyperrigo: Nobel prize-winning economist Robert Shiller tells me he expects a recession in the US:\nhttps://t.co/qES4jHJwvO Today's Word of the Day with @MerriamWebster is “exoteric” https://t.co/k3U6TZ8t1H Lee claims that 3-D is a fundamentally different art form from 2-D — and he believes that the shared movie-theater experience still possesses an unmatched power https://t.co/ft7XpV8Uuf Everything you need to know about the October Democratic Debate https://t.co/puFa2kPnAI “The presidential candidates need a plan for Big Tech that isn’t 'break up Big Tech'” https://t.co/roOiMEw9hw Scorsese says he's open-minded about the Netflix film revolution https://t.co/igXxC6btBC K-pop star and actress Sulli found dead at age 25 https://t.co/qSATuED8ki Mack Truck workers go on strike at plants in three states https://t.co/SDu7QNHd4v Everything you need to know about the October Democratic debate https://t.co/zH76stFlu5 How Microsoft's newest PC could pave the way for the future of computers https://t.co/m1CJpr6MlH U.S. ambassador to testify that quid pro quo text was Trump's message https://t.co/PDchrqHxmP Syrian troops prepare to confront Turkish forces as U.S. withdraws https://t.co/3CMwF3rWz5 \"Candidates have a responsibility to address the rampant sexual violence that permeates all of society’s systems and structures, including government,\" writes @TaranaBurke https://t.co/sNVa1V8Zg9 Here are all the 2019 Nobel Prize winners https://t.co/hr3tcW8iA4 Simone Biles breaks all-time record for most medals at world championships https://t.co/juQrrYRsdU American suspect in fatal crash does not have diplomatic immunity, reports say https://t.co/2cMkbkrgXZ \"It’s my purpose to just shine a light where I can.\" @stormzy is dedicating himself to bringing greater visibility to a wider community of black musicians, artists and creators in Britain https://t.co/sPhzOWmnMm https://t.co/6ohODf1K35 Spain's Supreme Court convicts Catalan leaders for a 2017 secession attempt https://t.co/p1zw1pUFoy \"What the far right gets wrong about the Crusades\" https://t.co/yuBW01pcEJ John Oliver talks about the billion dollar business of weather forecasting on 'Last Week Tonight' https://t.co/ykOY2cJAZl \"I don’t have seven arms to hug them all.\" A year after their father's death in Afghanistan, a mother and her children struggle to move on https://t.co/5coo2CoGCC China's trade with the U.S. shrinks again in September https://t.co/5kyRNSheyk Kara Walker's latest creation, Fons Americanus—a 13-meter-high fountain in London’s Tate Modern museum—presents the brutality of slavery in a subversively joyful setting https://t.co/Xtihcyjn29 Rescue crews in Japan look for missing people after Typhoon Hagibis leaves several dead https://t.co/KanrcotmTp Aaron Paul on the ending—and the cameos—of 'El Camino: A Breaking Bad Movie' https://t.co/I6VWLM2YCy Here are a few pointers from pro photographers to keep in mind while you point and shoot with a wide-angle lens https://t.co/Px664YyRD6 “We have to produce journalism worth paying for.” How A.G. Sulzberger is leading the New York Times into the future https://t.co/ZTukdOMiZ7 Both Democratic and Republican lawmakers are testing out new language and messaging tactics surrounding how to talk about what’s going on in Washington in their home districts and states https://t.co/d4Sj3G23Bt Hong Kong protesters shift tactics as demonstrations stretch into fifth month https://t.co/FL45HyzG7B “When you overcome difficulties, you will have so much joy and contentment.” Aori Nishimura thought her career would be over after a devastating injury — but now she’s poised to compete in the 2020 Olympics https://t.co/fqhhbfqfj4 https://t.co/NLFm0PxkuO President Trump says he's an \"island of one\" on removing troops from northeast Syria https://t.co/E8FRXPdDXN Scorsese says he's open-minded about the Netflix film revolution https://t.co/PiDsQyAnUj Poland's ruling party declares victory in national elections https://t.co/YnD8s0Q6zF .@copelandmusic remembers \"rock god\" Ginger Baker https://t.co/F9glzSpiqd Syria's Kurds look to Assad for protection from Turkey's invasion after the U.S. withdraws troops https://t.co/5LJnfynDVt Mack Truck workers go on strike at plants in three states https://t.co/fEjhM3ydws The surprising origins of the phrase \"you guys\" https://t.co/2u9sUPUH5e \"While Trump’s use of the military is largely conventional, much of what passes for strategy from the White House is oriented toward what will benefit his re-election campaign\" https://t.co/fJYNzXBNyr How to make your phone's battery last longer https://t.co/eXl433n9bg Through the lives of three sisters and their families, Jokha Alharthi charts the dizzying transformation of Oman in the decades after it achieved independence from Britain in 1951 https://t.co/EtjLzUHQoT \"Planes weren’t built for big people like me. Here’s what I want my seatmates to know,\" writes Kimberly Dark https://t.co/jm6EklkXYf For Selly Raby Kane, Dakar has always been more than home. “It’s central in the things I create,” she says of the Senegalese capital. “It’s a huge source of inspiration and creativity, and I have just been fascinated by its history” https://t.co/cVmskV1cvD How did \"left\" and \"right\" acquire their political meanings? https://t.co/BZl5f3hdSh Brian Cox hints that tonight's season finale of #Succession is going to be a “doozy” https://t.co/5lp6doMJu2 Review: \"'The Irishman' is so layered with detail, and shifts so gracefully through so many eras, that it’s hard to tease out a clearly defined plot. Even so, the movie is beautifully constructed\" https://t.co/1qPSjb0jyG Lee claims that 3-D is a fundamentally different art form from 2-D — and he believes that the shared movie-theater experience still possesses an unmatched power https://t.co/HKuhFeY3cx These types of screen time may be worst for kids' grades, a new analysis suggests https://t.co/4zBWoEziwc Davóne Tines, who describes himself on his Instagram account as “young, gifted and Black,” is among the most compelling classically trained singers working in America today. Here's how he is confronting racism with his music https://t.co/QGNT8TaBd5 .@louistheroux, widely regarded as the face of modern British documentary filmmaking, has become his own subject with his new book \"Gotta Get Theroux This\" https://t.co/ZDisJXVQbC Police respond to reports of mall shooting in Florida, confirm one person shot https://t.co/DoaKVhnUMV New Hampshire wedding shooting suspect is stepson of recently slain minister: Prosecutor https://t.co/b93bB8a6Ij Discovery's ambitious docuseries \"Why We Hate\" is essential viewing. It's also deeply flawed https://t.co/6O6epEQyFq U.S. ambassador to testify that quid pro quo text was Trump's message https://t.co/5j2IKZx7Eh In order to slow down climate change, we must solve four seemingly unsolvable problems, writes @JaneGoodallInst https://t.co/yglz4fOGui “In Brazil, to be an LGBTQ+ artist is like killing a lion a day,” says @pabllovittar. “Every day you have to prove to yourself that you can do it and show it to other people too” https://t.co/1k3KoWP7vg https://t.co/cjUvnW5SIf Aaron Paul on revisiting his “old friend” Jesse Pinkman in “Breaking Bad: El Camino” https://t.co/zwRsYWm5W9 https://t.co/apUWpjq32F Here's the history of primary challenges to incumbent Presidents https://t.co/N4Vn44NSrZ \"If you think about it, work-life balance is a strange aspiration for a fulfilling life\" https://t.co/iaxeGsBoK5 Dan Jones: How the far right uses and misuses the history of the crusades https://t.co/ebZvwyA9qk An all-female flight crew took 120 girls to NASA in an initiative to close aviation's gender gap https://t.co/X0xxu72hHW Why you shouldn't immediately worry if your child is a late talker, according to a speech pathologist https://t.co/RYp2F9WcZe \"Layered and contemplative, 'Dad's Maybe Book' immerses itself in the bones of modern American life\" https://t.co/yZIv5qQ0iw Black Woman, 28, shot and killed by police officer in her Texas home while watching her 8-year-old nephew https://t.co/xOQuZwcToZ Einstein was widely thought to be public enemy number one of the Nazis. Here's how Britain helped him escape https://t.co/y6Wo5ivNQ8 \"In the end, racial diversity will not be ushered in by pledges, slogans or czars. It will be achieved only once white America is weaned off a prevailing narrative of racial pre-eminence\" https://t.co/htZ6Rhaf2J Here's what young people all over the world say they want most in a partner https://t.co/3gHnLXa1Ob \"Candidates have a responsibility to address the rampant sexual violence that permeates all of society’s systems and structures, including government,\" writes @TaranaBurke https://t.co/yrox5Ym3VB “Candidates snapping selfies with voters is not new. But Warren has elevated an old shtick into the centerpiece of her digital strategy,” writes @CharlotteAlter https://t.co/4nT6sJq59Q Louisiana's Democratic governor forced into month-long runoff election https://t.co/fU2fN74WZp American suspect in fatal crash does not have diplomatic immunity: Reports https://t.co/sxnM9ISEXy 'Saturday Night Live' takes on 'Joker' with a super dark view of 'Sesame Street' https://t.co/SNvNPtxNcK Simone Biles breaks all-time record for most medals at world championships https://t.co/l4a3NOEIlH Whether by sheer luck or keen prescience, Bong Joon-ho's “Parasite” is the movie for right now, writes @szacharek in her review https://t.co/gCF136WTdB Hong Kong protesters shift tactics as demonstrations stretch into fifth month\nhttps://t.co/zyjLIWxg45 President Trump says he's an 'island of one' on removing troops from northeast Syria https://t.co/wulw4bXyb7 \"I will not allow that to be your life.\" A mother's letter to her black sons on growing up in America https://t.co/CVfyhyRmly Hundreds of ISIS supporters escape as Turkish forces near key Syrian town https://t.co/USwr4dxUnC \"I don’t have seven arms to hug them all.\" A year after their father's death in Afghanistan, a mother and her children struggle to move on https://t.co/bUfBI5ycw4 Meet the 15 women leading the fight against climate change, from Greta Thunberg to Ellen Page https://t.co/grT7mWBDUj \"It’s my purpose to just shine a light where I can.\" @stormzy is dedicating himself to bringing greater visibility to a wider community of black musicians, artists and creators in Britain https://t.co/EKbJmLxyaI https://t.co/a6KA8oOecv Why a plan to redefine the meaning of \"museum\" is stirring up controversy https://t.co/ZqP9EMEnVw Both Democratic and Republican lawmakers are testing out new language and messaging tactics surrounding how to talk about what’s going on in Washington in their home districts and states https://t.co/RUCaCbnZh9 Critic Vince Aletti opens up about his new book, 'Issues,' and being the world's biggest magazine superfan https://t.co/JFDWcJJZvH As national Republicans continue to defend Trump, Amash has become something of a unicorn—and is risking his seat along the way https://t.co/XWL6GwvqtA How a new class of trans male actors are changing the face of television https://t.co/E8RyOy1ALy “We have to produce journalism worth paying for.” How A.G. Sulzberger is leading the New York Times into the future https://t.co/o3MhTtrG2r Review: Ryan Murphy's Netflix debut \"The Politician\" is peak Ryan Murphy. That's not necessarily a bad thing https://t.co/HXpFjT3bys Here are a few pointers from pro photographers to keep in mind while you point and shoot with a wide-angle lens https://t.co/YNw6PJ80Lh Is wine really healthier than beer? https://t.co/bYdcY97I5s \"As a league, the NBA never should have waded into this political fight,\" writes @ianbremmer. \"If the NBA wants access to the Chinese market, it will now need to play by Chinese rules\" https://t.co/EtIvA533lJ The Ocean's health is in deep trouble, Peter Thomson writes. Here's how you can help https://t.co/8MKlErMwSM \"Everything about this game demo seemed to come from a place of reverence for the original game, while also striving to make a blockbuster modern experience\" https://t.co/qPhDQ4efE0 The best karaoke songs for singers and non-singers alike https://t.co/sBPbHrwKn2 .@pabllovittar has seamlessly integrated the personal with the cultural and political, and is using her platform as a musical star to demand equality for LGBT communities in Brazil and beyond https://t.co/Vpi2jeMNYu A recent study says naps aren’t a lazy indulgence. In moderation, they may actually be good for your heart https://t.co/B8onGDgsh4 Kara Walker's latest creation, Fons Americanus—a 13-meter-high fountain unveiled Sept. 30 in London’s Tate Modern museum—presents the brutality of slavery in a subversively joyful setting https://t.co/c82YluaO4t How old is your pet in human years? The answer is a little complicated, according to a vet https://t.co/s8VEo8Ko6s A new report reveals widespread abuse of women during childbirth https://t.co/9eCbwndWqL https://t.co/XTPShJ4wzO The MoMA will soon reopen following extensive renovations. Here's what to expect from the revamped museum https://t.co/RJ5GqFty2r Two-time Academy Award-winning actor Jessica Lange is also an accomplished photographer. She discusses her photographic tribute to her Midwestern roots in \"Highway 61\" https://t.co/03lx61ZmoO \"I created a system to make sure my husband and I divide household duties fairly. Here's how it works\" https://t.co/12LbB1o6Fk In an interview with TIME, K-pop powerhouse @JYPETWICE opens up about how their new album is more personal than ever https://t.co/Uktfn8OqsM “The end goal is closing the gap between the hospitals and the patients.” Meet the man whose bloodless test is revolutionizing the fight against malaria https://t.co/GffomHoQ3c https://t.co/tzh7N17TpN Trump boasted that his border wall was “virtually impenetrable.” Then an 8-year-old girl climbed a replica https://t.co/aiDTeXrDFD \"Over the past four seasons, @jessmendoza won over many baseball fans with her preparation and a conversational style that translate's the games intricacies into digestible nuggets for viewers,\" writes @seanmgregory https://t.co/AforEV6YWn These are the 10 best Nintendo Switch games to buy right now https://t.co/6x7tI7jyN5 \"You’re not a person if you don’t drink.\" \n\nHere's how this tiny European country developed the world's worst drinking problem https://t.co/K9qAM4YzHv As with polio, AFM is seasonal—though unlike polio, it arrives in late summer and early to mid fall, rather than in the spring and summer https://t.co/jKtJu9nutm Eliud Kipchoge becomes first person in recorded history to run a marathon in under 2 hours\nhttps://t.co/Irt7180Yte https://t.co/3OMbfyy6QC In \"Joker,\" black women are visible but they are not seen https://t.co/mPORDq2k1J California Democrats spent $800,000 in sexual misconduct legal fees involving former chairman https://t.co/Wt6Kp6HqKJ How the AIDS crisis changed the dynamic between gay men and women, as told in Edie Windsor's posthumous memoir https://t.co/JUJ9dx02x7 “When you overcome difficulties, you will have so much joy and contentment.” Aori Nishimura thought her career would be over after a devastating injury — but now she’s poised to compete in the 2020 Olympics https://t.co/4p8MhpbcWL https://t.co/evuybTzgD8 Robert Forster, Oscar-nominated actor, dies at 78\nhttps://t.co/ArezZAwphc https://t.co/4TPvgWTaNp “The capabilities are still there.” Why Cambridge Analytica whistleblower Christopher Wylie is still worried https://t.co/XnKzpDg1HJ Review: “El Camino: A Breaking Bad Movie” transforms Jesse Pinkman into an unlikely action hero https://t.co/57y6vfHJJC California governor signs bill barring most animals from circuses and banning the sale of new fur https://t.co/huWPPDEXNw Couple contracting involves in-depth discussions of three areas: values, boundaries and fears https://t.co/Pk1Q2vF0YJ This Japanese skateboarder thought her career would be over after a devastating injury. But now she’s poised to compete in the 2020 Olympics https://t.co/DEMFZ3AsSo Elizabeth Warren targets Facebook's ad policy with a fake ad claiming Mark Zuckerberg endorsed Trump's re-election https://t.co/OGebQOXhc5 She was in a secret society at Yale. Her latest novel explores the dark and mysterious world of the Ivy League https://t.co/4yIGTt17KK Police respond to a church shooting in New Hampshire https://t.co/hmrQ5gSfOX Hard Rock Casino hotel under construction partially collapses in New Orleans, killing at least one https://t.co/FCnkQSHEgd To understand why the new “Joker” movie is so controversial, we need to understand the villain's toxic history — onscreen and online https://t.co/ozwuGmvmxX Xi Jinping becomes first Chinese President in 2 decades to visit Nepal https://t.co/fzMA8GNKeL Brian Cox hints that Sunday's season finale of #Succession is going to be a “doozy” https://t.co/y76xL7G4rX Eliud Kipchoge becomes first person in recorded history to run a marathon in under 2 hours https://t.co/NGNxw2FxIr \"On paper, 'Breakpoint' is the kind of game we’re supposed to love. But its disparate elements never come together and often feel like a waste of time\" https://t.co/She6KWFmjX “Ever since @BTS_twt’s debut, they’ve never suddenly switched gears or changed pace,” founder and co-CEO of @BigHitEnt Bang Si-hyuk tells TIME. “They don’t shy away from speaking about the pain felt by today’s generation” https://t.co/uED70yMzui Rudy Giuliani under investigation for lobbying violations: Report https://t.co/3bSJlEYlws \"You will soon feel the same heat we feel every day.\" Read these moving words from Ugandan climate activist, Hilda Flavia Nakabuye https://t.co/H8ATOEtZHR Robert Forster, Oscar-nominated actor, dies at 78 https://t.co/1dANt4oPd8 Sexually transmitted disease diagnoses in 2018 broke a record for the fifth consecutive year, according to new data from the CDC https://t.co/xHyFNvCiig 4 killed and 3 injured in Brooklyn shooting https://t.co/vT8as2eIm4 Though juice was once a cornerstone of a balanced breakfast, its place at the table has been looking a bit precarious these days. But is a glass of OJ really a big deal? https://t.co/hnOsIkQSzY Even before it dominated the Emmys, \"Fleabag\" was bound to loom over Showtime's \"Back to Life.\" Here's how the two series differ https://t.co/9SwihvJ0j6 Aaron Paul on the ending—and the cameos—of “El Camino: A Breaking Bad Movie” https://t.co/JhI9dWp78F The Disney CEO discusses consequential fun, firing humanely and what he learned from scraping chewing gum off desks https://t.co/iYzdKkTQ2h Conservatives say Fasiki’s images are degrading, but she wants to draw attention to society’s obsession with how women present themselves https://t.co/TYyVXSIg3d Here are 15 new books you should read this month, from Ben Lerner's “The Topeka School” to Elizabeth Strout's “Olive, Again” https://t.co/NXk5c1LfAB When tights first became a wardrobe staple, they signified something that went far beyond a simple change of season: freedom https://t.co/bzFhEHVwIY Review: Forget \"The Masked Singer.\" Netflix's \"Rhythm + Flow\" is the best music competition show in years https://t.co/QNB91GZO7b “How many voices do we need? How many more traumas do we have to debate until someone listens?” writes @lyzl https://t.co/WxKmDoVSV6 Stop me if you've heard this one: a robot and a team of Irish scientists walk into a senior living home https://t.co/hy80D7cEZc \"How your obsession with short-term results can hurt you in the long run\" https://t.co/6dhQgxN3Mt “How neuroscience could explain the rise of addictions, heart disease and diabetes in 21st century America,” by Peter Sterling https://t.co/hf76W1mZlG The Cosmic Crisp could be a \"game changer\" for the apple growing industry https://t.co/SBrJAxrBWv Three-quarters of survey participants believe that female workers are paid less than their male counterparts who do similar work. That may seem like a consensus, but only 62% of men held this belief, compared with 86% of women.\n\nPresented by @eqltycantwait https://t.co/hNYC9fVfUl Khan had in roughly 24,000 words resurfaced an argument against monopolies that journalists such as Ida Tarbell had popularized more than a century ago https://t.co/imsEZJB8fM Review: A brilliant \"Big Mouth\" season 3 premiere is one of the best TV episodes of the year https://t.co/404cog41Gq Activists can't agree on how to fight climate change. The IMF says just do something https://t.co/oIuEfOKuod Lina Khan had in roughly 24,000 words resurfaced an argument against monopolies that journalists such as Ida Tarbell had popularized more than a century ago https://t.co/oEVGSHddgY https://t.co/NKt6PEMQEO The true story behind “Lucy in The Sky”—and the one key detail the movie leaves out https://t.co/nmt5BIaZAC Here's what to know about the two authors that won the Nobel Prize for literature https://t.co/PhOubljW3o The 20 best Halloween TV episodes of all time https://t.co/IHSMvzCol6 \"In the end, racial diversity will not be ushered in by pledges, slogans or czars. It will be achieved only once white America is weaned off a prevailing narrative of racial pre-eminence\" https://t.co/WOQh1RQ1ZY “This time, we are trying to show our real heart to the listeners as individuals,” vocalist Sana of K-pop powerhouse @JYPETWICE tells TIME about the new album “Feel Special” https://t.co/dhholqop0T This Japanese skateboarder thought her career would be over after a devastating injury. But now she’s poised to compete in the 2020 Olympics https://t.co/MvFLCdGRMP Through the lives of three sisters and their families, Jokha Alharthi charts the dizzying transformation of Oman in the decades after it achieved independence from Britain in 1951 https://t.co/AQA9Tea91u Oil is killing Brazil’s sea turtles. No one knows where it’s coming from https://t.co/1un2qvzwkT Khan had in roughly 24,000 words resurfaced an argument against monopolies that journalists such as Ida Tarbell had popularized more than a century ago https://t.co/GMSWbSaoKA Latina professor and university officials respond to Georgia students burning book about navigating white privilege https://t.co/3yk23QmZB1 Decades after her daughter's murder, a mother gets answers https://t.co/VnrexdHn5Y “El Camino: A Breaking Bad Movie” is out today. Take a look back at the 10 biggest turning points in Walter White's transformation on the show https://t.co/1EOYMrz8tm With \"congratulations on a job well done,\" Trump announces acting secretary Kevin McAleenan is leaving Department of Homeland Security  https://t.co/JcYAU7PYK2 For artist and fashion designer Selly Raby Kane, Dakar has always been more than home. “It’s central in the things I create,” she says of the Senegalese capital https://t.co/DD02XY0gKv Abiy Ahmed, the Ethiopian Prime Minister who engineered the end of a two-decade conflict with neighboring Eritrea, was named today as the recipient of the 100th Nobel Peace Prize for his efforts to “achieve peace and international cooperation” https://t.co/3d2q7ORkbx Police in Japan arrested a pop star's stalker after he analyzed her selfies, used reflections in her eyes to find her address https://t.co/Dc5kpEZScl Here's what to know about Marie Yovanovitch, the Ukraine ambassador Trump recalled https://t.co/5eFMiWOu4n A St. Louis police officer fatally shot a colleague while playing Russian roulette. A lawsuit alleges he had a history of \"forcing\" women into the game https://t.co/q3R9q71hoZ A brief history of the U.S. backing Kurdish fighters https://t.co/UNDjmnpQwH https://t.co/QDIsLK07MH Chris McDougall helped spark the barefoot running craze. Now he's racing with donkeys https://t.co/LiZbjjQzct A \"tentative\" agreement with China in place, Trump suspends plans for tariff hike on Chinese imports  https://t.co/fALbUU9wLF These are the key U.S. and Ukrainian players in the Trump impeachment inquiry https://t.co/YkPAxu6i2z https://t.co/YTgsOz9lnT Man who killed family of six in Texas deserves death penalty, prosecutor says https://t.co/NiMKPjXUfl California is banning private, for-profit prisons https://t.co/wkyxxP4t8v \"Repugnant to the American Dream.\" Judges block President Trump's immigrant wealth test https://t.co/X5oyMotPb4 One person has died and 100,000 residents have been displaced as a result of the Saddleridge wildfire spreading across the Los Angeles area — just one of six currently burning in California https://t.co/aEkFhVWP6s What happens next in Syria after Turkey's invasion, by @ianbremmer https://t.co/5rGVvSq1mi Jane Fonda arrested for protesting climate change in Washington https://t.co/huxXPFOFtd RT @VeraMBergen: Americans often just experience military casualties as a quick headshot on the news. No one seems to think of what comes n… That car you see burning in pop star Charli XCX's latest music video for her song “White Mercedes”? It’s all environmentally sound https://t.co/nOsBXgAEYt Smith has worked at Fox News Channel since the network started in 1996 https://t.co/53XpqOno17 New speakers are announced for the first-ever TIME 100 Health Summit #TIME100Health https://t.co/YvKW3t2BDX \"On paper, 'Breakpoint' is the kind of game we’re supposed to love. But its disparate elements never come together and often feel like a waste of time\" https://t.co/DQ1IX7aD15 \"Despite the notable lack of progress, President Trump has continued to make North Korea his signature foreign policy triumph, even suggesting he would have won the Nobel Peace Prize if the process had not been so — you guessed it — rigged\" https://t.co/kkYoOvPq3X Syrian Kurdish officials say Turkish shelling has hit a prison holding Islamic State militants in northeastern Syria https://t.co/1QC4RjuGo1 California will become the first U.S. state to allow employers, co-workers and teachers to seek gun violence restraining orders against other people https://t.co/q0RUqZfQKF The current wave of early ’00s nostalgia may have reached its peak this week when a young couple channeled Angelina Jolie and Billy Bob Thornton’s infamous red carpet moment https://t.co/EISvv6GVrQ \"Eco death metal?\" The remixes of Greta Thunberg's poignant call to action on climate change just keep coming https://t.co/KiEun8B4cc Going to watch the \"El Camino\" movie this weekend? Here's the \"Breaking Bad\" refresher you need https://t.co/1Jll7iTdtW Marie Yovanavitch tells Congress she was \"incredulous\" Trump pushed for her removal https://t.co/Ww7REf8wbf In \"Joker,\" black women are visible but they are not seen https://t.co/bYag00P4Rf U.S. sales of Italian cheese rise by 220% as consumers stock up ahead of tariff hike https://t.co/CcxZqEZNfr \"You will soon feel the same heat we feel every day.\" Read these moving words from Ugandan climate activist, Hilda Flavia Nakabuye https://t.co/jqKwKbHY8C Elizabeth Warren had the ultimate response to a question about same-sex marriage https://t.co/UTN6N87nFQ https://t.co/K22UNFxDVd Meghan Markle shared an inspiring message for girls everywhere on her Instagram account https://t.co/XMPilqyCYy Elizabeth Warren had the ultimate response to a question about same-sex marriage, and the Internet took it from there https://t.co/tVaWAh2w98 This year, TIME devoted an entire issue to climate change. \"Our intent with this issue is to send a clear message: we need to act fast, and we can,\" writes Editor-in-Chief @efelsenthal. See the curated magazine on @Flipboard here https://t.co/MumoB6MczP Ethiopian Prime Minister Abiy Ahmed has been awarded the Nobel Peace Prize for 2019 in recognition of his efforts to end his country’s long-running border conflict with Eritrea https://t.co/ua5XJ0cF2K https://t.co/rnBbZODIOR Pentagon urges Turkey to halt invasion into Syria https://t.co/vwyuc7OKWX Federal appeals court rules House should get Trump financial records https://t.co/FMAO9sTMhH Burning trash sparks fire that destroyed dozens of homes in Southern California https://t.co/HypaEJn06l https://t.co/IfDDQmrnR6 Prince estate slams Donald Trump for using \"Purple Rain\" at a campaign rally in Minneapolis https://t.co/b4UYBUE9Gj “The end goal is closing the gap between the hospitals and the patients.” Meet the man whose bloodless test is revolutionizing the fight against malaria https://t.co/kyooPolL7t https://t.co/wdc8tCH4Rj Trusting guy let the Internet decorate his room and the weird items are spectacular https://t.co/DbPCJmeQar On #NationalEggDay take a look at a timeline of super famous internet-breaking eggs https://t.co/OwNkuSwhBR RT @andrewrchow: The film world has mostly abandoned 3D, but Ang Lee still believes in the form. I talked to him about \"Gemini Man\" and his… Gordon Sondland will testify despite ban by State Department, lawyers say https://t.co/v7U1dm45lE RT @TaranaBurke: October marks the 2nd anniversary of the #MeToo hashtag &amp; the start of a monumental shift. It rose awareness, but we deman… Aaron Paul on the ending—and the cameos—of “El Camino: A Breaking Bad Movie” https://t.co/qOuNJTLQyQ Diplomat targeted by jailed Giuliani Associates set to testify in impeachment inquiry https://t.co/cv5dwhsElD The absolute best Halloween movies of all time that you can watch right now https://t.co/ptuPR4Nrto Review: “El Camino: A Breaking Bad Movie” transforms Jesse Pinkman into an unlikely action hero https://t.co/57y6vfHJJC How Ethiopia's Abiy Ahmed won the Nobel Peace Prize after ending a war https://t.co/B1kndk4c2q Today's Word of the Day with @MerriamWebster is “idée fixe” https://t.co/mQvPThqOnp RT @timeforkids: A thread! Meet nine of the young climate activists TFK spoke to at the U.N. Youth Climate Summit. They are helping drive t… Russia’s space agency says Alexei Leonov, the first human to walk in space 54 years ago, has died in Moscow https://t.co/NuPHp29MhY “El Camino: A Breaking Bad Movie” is out today. Take a look back at the 10 biggest turning points in Walter White's transformation on the show https://t.co/EzLHO7XY6i Typhoon Hagibis is forecast to bring two feet of rain and strong winds to the Tokyo area https://t.co/aROd4aACL5 https://t.co/tFsmLPUUlC 2020 Democratic candidates pledge support for LGBTQ community at town hall https://t.co/i7mmOTiYBO Brexit talks are back on track with just weeks left before a critical deadline https://t.co/OgaoOeiewD An 89-year-old woman is missing after a wildfire tore through a California mobile home park https://t.co/cZx1VewQ0l Structural cracks found during inspections of older Boeing 737 jets https://t.co/gRi7msOQwz \"Insane impeachment witch hunt.\" Trump rages in his first rally since the start of the impeachment inquiry https://t.co/7gaTWGFb96 How to play your favorite PlayStation 4 games on your computer, tablet or phone https://t.co/RGYvayAHB6 Here's the 'Breaking Bad' refresher you need before you watch the movie https://t.co/EiNPoKIfnS \"Candidates have a responsibility to address the rampant sexual violence that permeates all of society’s systems and structures, including government,\" writes @TaranaBurke https://t.co/9mmYuv4UNa Here are the 2019 Nobel prize winners (so far) https://t.co/1ENKd20GUh \"While business targeting diversity is flourishing, diversity is not,\" writes author Pamela Newkirk https://t.co/Qnce8uabra How \"young, gifted and Black\" opera singer Davóne Tines is confronting racism with his music https://t.co/w8mzc5v1Wq \"What at first sight may appear as an isolated attack in an obscure German city is anything but\" https://t.co/tEBLd5gSyS RT @naina_bajekal: “He instilled a different energy that was needed in our country.\" In February I spoke to the hugely talented @aidamulune… Nobel Peace Prize awarded to Ethiopian Prime Minister Abiy Ahmed https://t.co/UVIuE3og9w For artist and fashion designer Selly Raby Kane, Dakar has always been more than home. “It’s central in the things I create,” she says of the Senegalese capital https://t.co/ZRLpZEpEOR Activists can't agree on how to fight climate change. The IMF says just do something https://t.co/7BcfaesaXo Whether by sheer luck or keen prescience, Bong Joon-ho's 'Parasite' is the movie for right now, writes @szacharek https://t.co/f2FYxA0B5T Trump Administration ramps up deportations to Cuba under new policy https://t.co/dJeyyFBTGF Typhoon Hagibis is forecast to bring two feet of rain and strong winds to the Tokyo area https://t.co/BMcnhHZsfm Here are the favorites to win the 2019 Nobel Peace Prize https://t.co/jl3vsnXqsc Iranian oil tanker reportedly damaged in an explosion off the Saudi coast https://t.co/5eYe8CDTUS Turkey reports first military fatality in Syria incursion https://t.co/k0g3Xnj0k0 Japanese skateboarder Aori Nishimura thought her career would be over after a devastating injury. Now she’s poised to compete in the 2020 Olympics https://t.co/2fCu9J1eLj Review: 'El Camino: A Breaking Bad Movie' transforms Jesse Pinkman into an unlikely action hero https://t.co/oCGbKz43JE \"2-D is home. I want to go to a new world.\" 'Gemini Man' director Ang Lee wants to change the way we see movies https://t.co/OzBNyeRpTN As impeachment becomes a re-election issue, Republicans and Democrats jockey to get ahead on the messaging https://t.co/HDdRrPLdjc Here's what to know about Peter Handke and Olga Tokarczuk, the two authors who won the Nobel Prize for literature https://t.co/qMUenS4stH Affordable childcare is at once one of the most tantalizing promises of contemporary American life, and the most broken. Read TIME's report on the childcare crisis\n\nPhotographs shot in partnership with @FotografiskaNyc https://t.co/hHlUCbqkb6 2020 Democratic candidates pledge support for LGBTQ community at town hall https://t.co/CjyxtiQth2 https://t.co/554VfJGYJu \"If the NBA wants access to the Chinese market, it will now need to play by Chinese rules, and in today’s world those rules don’t just stop at China’s borders.\" writes @ianbremmer https://t.co/odKcbCHYEV \"We must move the issues of war and peace from the periphery of our national discourse to its center,\" @elliotackerman writes in TIME's special report. \"And the only way to do that, I increasingly believe, is to reconsider the draft\" https://t.co/P6kISukdkE https://t.co/22FDIUHKhC \"Everything about this game demo seemed to come from a place of reverence for the original game, while also striving to make a blockbuster modern experience\" https://t.co/dJlr26pTGc Structural cracks found during inspections of older Boeing 737 jets https://t.co/inbPrVTFip “We have to produce journalism worth paying for.” How A.G. Sulzberger is leading the New York Times into the future https://t.co/r9PdZSSjGu “They know they can’t win the 2020 election so they’re pursuing the insane impeachment witch hunt.” President Trump rages in his first rally since the start of the impeachment inquiry https://t.co/i4YKUFwWQP https://t.co/3Y4G6FcNkL 2020 Democratic candidates pledge support for LGBTQ community at town hall https://t.co/lJECrsxvwy Burning trash sparks fire that destroyed dozens of homes in Southern California https://t.co/4ghiCZ8WS2 2-year-old has the most incredible reaction to the Hulk's rampage and there's no going back for her now https://t.co/OB9lmLp5ne Khan had in roughly 24,000 words resurfaced an argument against monopolies that journalists such as Ida Tarbell had popularized more than a century ago https://t.co/cjLIM64ZQY \"Insane impeachment witch hunt.\" Trump rages in his first rally since the start of the impeachment inquiry https://t.co/KUuWgA0EEp \"While Trump’s use of the military is largely conventional, much of what passes for strategy from the White House is oriented toward what will benefit his re-election campaign\" https://t.co/NC7e3YX0j4 Here's the history of primary challenges to incumbent Presidents https://t.co/ZYplka9M1R Davóne Tines, who describes himself on his Instagram account as “young, gifted and Black,” is among the most compelling classically trained singers working in America today. Here's how he is confronting racism with his music https://t.co/TjjIjNc4Nd Two Florida men tied to Rudy Giuliani were arrested on finance charges involving the Trump campaign https://t.co/FN4LmY1X1L https://t.co/2Y0UgyOs4L Discovery's ambitious docuseries \"Why We Hate\" is essential viewing. It's also deeply flawed https://t.co/FlbXE3YLFw Through the lives of three sisters and their families, Jokha Alharthi charts the dizzying transformation of Oman in the decades after it achieved independence from Britain in 1951 https://t.co/i2i8iqFjsZ This Japanese skateboarder thought her career would be over after a devastating injury. But now she’s poised to compete in the 2020 Olympics https://t.co/hwjaKi1160 Dan Jones: How the far right uses and misuses the history of the crusades https://t.co/xq5hSYJzjZ Boxing champion Errol Spence seriously injured after speeding Ferrari flips and crashes in Dallas https://t.co/z1vNzic5qO Conservatives say Fasiki’s images are degrading, but she wants to draw attention to society’s obsession with how women present themselves https://t.co/pSMyg0MnQT \"Layered and contemplative, 'Dad's Maybe Book' immerses itself in the bones of modern American life\" https://t.co/RafodvIx2a Climate change is shaping up as an utter disaster for much of America's bird life https://t.co/3KjkWJAqsi George Conway suggests Trump's White House advisers should quit https://t.co/6lErQltGhT Colorado Uber driver found not guilty in fatal shooting of passenger who allegedly attacked him https://t.co/N9mLfsbJiI \"In the end, racial diversity will not be ushered in by pledges, slogans or czars. It will be achieved only once white America is weaned off a prevailing narrative of racial pre-eminence\" https://t.co/qARryt9cQD Lee claims that 3-D is a fundamentally different art form from 2-D — and he believes that the shared movie-theater experience still possesses an unmatched power https://t.co/DiXfGawjjs Whether by sheer luck or keen prescience, Bong Joon-ho's “Parasite” is the movie for right now, writes @szacharek in her review https://t.co/k6kUCzaIkl Brian Cox from \"Succession\" discusses playing Logan Roy and what to expect in the season finale https://t.co/HYD9bpH4cr \"People are freaking out.\" Thousands of Californians left powerless amid electricity cuts to prevent wildfires https://t.co/yx410jeorO Activists can't agree on how to fight climate change. The IMF says just do something https://t.co/6fqgLfEoms Al-Qaeda bomb maker once dubbed “world's most dangerous terrorist” was killed 2 years ago, White House says https://t.co/6n7MVUlWJ9 Found on the street, an SD card labeled \"homicide\" led Anchorage police to murder arrest https://t.co/F8h9sc5ZsB “In Brazil, to be an LGBTQ+ artist is like killing a lion a day,” says @pabllovittar. “Every day you have to prove to yourself that you can do it and show it to other people too” https://t.co/QpJxaN9GvA https://t.co/RSskXew4bE Climate activists stop traffic in New York's Times Square as worldwide rallies stretch into fourth day https://t.co/XhHglBtHPH .@copelandmusic remembers \"rock god\" Ginger Baker https://t.co/SZcPAdmnuZ If you or someone you know may be contemplating suicide, call the National Suicide Prevention Lifeline at 1-800-273-8255 or text HOME to 741741 to reach the Crisis Text Line. In emergencies, call 911, or seek care from a local hospital or mental health provider. Today is #WorldMentalHealthDay. In November 2017, Amanda Johnstone launched an app that encourages users to rate their mental wellbeing, with others in their loop checking in. Here’s how Be A Looper is saving lives https://t.co/1JFHtMM5CN https://t.co/YJnqD9fC26 RT @abbyvesoulis: Rep. @Malinowski on why he supports impeachment inquiry even though conviction seems unlikely. Not doing anything “would… Here's what to know about the two authors that won the Nobel Prize for literature https://t.co/f5S5FGGAkD RT @timeforkids: The 10/18 issue of TFK is a special report on the state of the planet. Every article is focused on people fighting for Ear… For Selly Raby Kane, Dakar has always been more than home. “It’s central in the things I create,” she says of the Senegalese capital. “It’s a huge source of inspiration and creativity, and I have just been fascinated by its history” https://t.co/yVThvoArZm El Paso Walmart mass shooting suspect pleads not guilty as authorities consider death penalty https://t.co/MdF8gPaR82 \"I don’t have seven arms to hug them all.\" A year after their father's death in Afghanistan, a mother and her children struggle to move on https://t.co/eKjkhqlvsT \"It’s my purpose to just shine a light where I can.\" @stormzy is dedicating himself to bringing greater visibility to a wider community of black musicians, artists and creators in Britain https://t.co/EAT5Fznmlc https://t.co/N45e7v7INh Both Democratic and Republican lawmakers are testing out new language and messaging tactics surrounding how to talk about what’s going on in Washington in their home districts and states https://t.co/IDJZpmwBvR \"As a league, the NBA never should have waded into this political fight,\" writes @ianbremmer. \"If the NBA wants access to the Chinese market, it will now need to play by Chinese rules\" https://t.co/QbxEGo8aoq \"Candidates have a responsibility to address the rampant sexual violence that permeates all of society’s systems and structures, including government,\" writes @TaranaBurke https://t.co/1w54p08hy7 As national Republicans continue to defend Trump, Amash has become something of a unicorn—and is risking his seat along the way https://t.co/3eFv663D6K Court: Deutsche Bank does not have Donald Trump's tax returns https://t.co/nig9by6gza \"The Democratic field of presidential candidates, and the Trump campaign itself, are already adjusting their 2020 strategies to account for the coming impeachment battle,\" writes @Philip_Elliott https://t.co/AGlJpkacoe \"What at first sight may appear as an isolated attack in an obscure German city is anything but\" https://t.co/gubO2aULDZ Florida man who shot and killed black man in parking space dispute gets 20 years in prison https://t.co/90uqUffcmj Here are a few pointers from pro photographers to keep in mind while you point and shoot with a wide-angle lens https://t.co/dQW7y1J0XO Researchers went through high schoolers' trash to find out which tobacco products they're using. Here's what they found https://t.co/K3y8ulec4a With a new Muppet, Sesame Street aims to tackle the opioid crisis in a way kids can understand https://t.co/qaRZmDeUUv The wife of a U.S. diplomat allegedly involved in a fatal car accident will not return to the U.K. for further questioning, according to “secret” briefing notes accidentally shown by President Trump https://t.co/ZjtMJH20zN Illinois prosecutors charge 9-year-old with five counts of murder over April house fire https://t.co/mDVH7ylCnM Sophie Turner is the latest actor to join a chorus of celebrities to protest diet culture https://t.co/EFowWoOTt2 Prince Harry and Ed Sheeran joined forces for an important public service announcement on #WorldMentalHealthDay https://t.co/OMIgUZRiY1 Democratic presidential candidate Tulsi Gabbard says she may skip next week’s debate in Ohio https://t.co/cfxfZHQxI0 Aaron Paul can prove the \"Breaking Bad\" cult following is stronger than ever on Jimmy Kimmel https://t.co/kAgPpkxOAW Affordable childcare is at once one of the most tantalizing promises of contemporary American life, and the most broken. Read TIME's report on the childcare crisis \n\nPhotographs shot in partnership with @FotografiskaNyc https://t.co/aNUHtFx5Km \"We are so happy that finally we got the chance to go to the stadium.\" Iranian women allowed at FIFA soccer match for first time in decades https://t.co/h5R1z3Ez36 Alexander Gorbunov’s YouTube channel has racked up over 2 million views for his tirades on Russian politics, which he delivers deadpan each week from his wheelchair https://t.co/5GiOyKZ34X \"We must move the issues of war and peace from the periphery of our national discourse to its center,\" @elliotackerman writes in TIME's special report. \"And the only way to do that, I increasingly believe, is to reconsider the draft\" https://t.co/Z90eOKRWDR https://t.co/MGaP7vZzVs U.N. says tens of thousands of Syrian civilians have fled amid Turkey attacks https://t.co/mGm4r3Awud Two Florida men tied to Giuliani arrested on finance charges involving Trump campaign https://t.co/95097bpXSH “We have to produce journalism worth paying for.” How A.G. Sulzberger is leading the New York Times into the future https://t.co/rq161Gxp9G RT @renireni: It was an honour to profile @stormzy for the cover of @TIME. We had such an interesting chat about his music, advocacy, and h… RT @luscombeland: Parents can’t afford to get childcare. Centers can’t afford to pay workers. Workers can’t afford to do the job. Welcome t… If you or someone you know may be contemplating suicide, call the National Suicide Prevention Lifeline at 1-800-273-8255 or text HOME to 741741 to reach the Crisis Text Line. In emergencies, call 911, or seek care from a local hospital or mental health provider. “They all thought they were a burden and it was too hard to keep reaching out.” Amanda Johnstone lost too many friends to suicide. Now her app is saving lives https://t.co/GJ6UtfiDLB Police have ordered evacuations as a fast-moving wildfire spreads in the hills of a San Francisco Bay Area community https://t.co/lqAmHiX8Fa Today's Word of the Day with @MerriamWebster is “blandish” https://t.co/BbPYEq1CgJ Woman accuses former NBC anchor Matt Lauer of rape in Ronan Farrow's new book https://t.co/TR6vBhrWCM https://t.co/aCu9JA9wWQ \"Everything about this game demo seemed to come from a place of reverence for the original game, while also striving to make a blockbuster modern experience\" https://t.co/DxpzGLI5lB Turkey hits towns and villages with airstrikes during second day of Syria invasion https://t.co/PG7cxCBo18 .@pabllovittar has seamlessly integrated the personal with the cultural and political, and is using her platform as a musical star to demand equality for LGBT communities in Brazil and beyond https://t.co/382YVzmps5 Couple contracting involves in-depth discussions of three areas: values, boundaries and fears https://t.co/JDWVTnZ31l Review: Forget 'The Masked Singer.' Netflix's 'Rhythm + Flow' is the best music competition show in years https://t.co/9Ckp4hGdLV Smoking fewer than 5 cigarettes a day damages your lungs almost as much as smoking a whole pack, study says\nhttps://t.co/EFAcNUnnPp Gregory Grammer is one of thousands training for a war that started before he was born. Read more about America’s forever war in TIME's special report https://t.co/Z90eOKRWDR https://t.co/nWLTw74xon Matthew Poblano is one of thousands training for a war that started before he was born. Read more about America’s forever war in TIME's special report https://t.co/Z90eOKRWDR https://t.co/2mQtfLyQAM An international law that largely shields foreign diplomats and their family members from criminal prosecution has come under scrutiny after the death of a 19-year-old man https://t.co/UeBowzCP4N Nobel Prizes in literature awarded to Austria's Peter Handke and Poland's Olga Tokarczuk\nhttps://t.co/symnkCz9gf TIME’s new international cover: “It's my purpose to shine a light where I can.” Rapper @stormzy is championing black British culture—in music and beyond https://t.co/GWsoASFgvO https://t.co/H9XoUkViap TIME's new cover: Ashley Luna Gorbea is one of thousands training for a war that started before she was born https://t.co/Nfxm12bp4p https://t.co/WeZJgV9YZq “How to return a farm to the wild, watch nature return—and maybe find a way to save the planet” https://t.co/kEUQatXfTf The best karaoke songs for singers and non-singers alike https://t.co/O3H44GKFB3 Michael Bennet is getting voters' attention with an affordable housing plan https://t.co/HS0TusaoV8 Will Hong Kong's democracy protests spread to its close neighbor Macau? https://t.co/A0JCRJcCse Apple removes Hong Kong protesters' crowdsourced police-tracking app after Chinese criticism https://t.co/EsWJKmk1Sp Last year's Nobel Prize in Literature was canceled over scandal and conflict. Can 2019's award mark a comeback? https://t.co/tTiZoiB1sy A British celebrity faked Instagram stories to catch out a friend allegedly leaking details to a tabloid newspaper. The Internet is calling her “WAGatha Christie” https://t.co/RFiH6ymnbZ Here's everything new on Netflix in October 2019 — and what's leaving https://t.co/44Izzw30lq Last year's Nobel Prize in Literature was canceled over scandal and conflict. Can 2019's award mark a comeback? https://t.co/a71942P72Q \"I created a system to make sure my husband and I divide household duties fairly. Here's how it works\" https://t.co/QZQKbwGO2N More than a million people in California were plunged into darkness during an unprecedented blackout https://t.co/zqavkZ73o5 \"It was their sincerity, consistency and ability to embody the spirit of the times.\" Bang Si-hyuk, the mastermind behind @BTS_twt, on the distinguishing factor that set the K-pop group on its unique path https://t.co/5bJE0GzebL Elizabeth Warren unveils environmental justice platform as candidates hone in on the issue https://t.co/tyf2pFRlx8 The MoMA will soon reopen following extensive renovations. Here's what to expect from the revamped museum https://t.co/Fbvl4eAqji Iranian Supreme Leader Ali Khamenei is one despot Trump might not win over https://t.co/rx3NI5PVR8 Trump's Syria announcement blindsided many of his GOP supporters https://t.co/LPxZoTaFJg Here are 15 new books you should read this month, from Ben Lerner's 'The Topeka School' to Elizabeth Strout's 'Olive, Again' https://t.co/HhxkFqPEgt The climate crisis is global, but these six places face the most severe consequences https://t.co/RGcnixsZZV Protesters handed out \"Free Hong Kong\" shirts and held up \"Shame the NBA\" signs at Wizards game https://t.co/rjF6AJxkvc California to ban pesticide officials say is linked to brain damage in children https://t.co/bKMDJLaRHX Arizona elected official charged in human trafficking adoption scheme https://t.co/gZJW1zlzWn These are the 10 best Nintendo Switch games to buy right now https://t.co/5IjnO3Nr1z “The capabilities are still there.” Why Cambridge Analytica whistleblower Christopher Wylie is still worried https://t.co/fJrl8BtJel .@LBardugo was in a secret society at Yale. Her latest novel explores the dark and mysterious world of the Ivy League https://t.co/id7H4QdLAt To understand why the new “Joker” movie is so controversial, we need to understand the villain's toxic history — onscreen and online https://t.co/jalHxsoAUV “Ever since @BTS_twt’s debut, they’ve never suddenly switched gears or changed pace,” founder and co-CEO of @BigHitEnt Bang Si-hyuk tells TIME. “They don’t shy away from speaking about the pain felt by today’s generation” https://t.co/3YeVIjkNg1 “How neuroscience could explain the rise of addictions, heart disease and diabetes in 21st century America,” by Peter Sterling https://t.co/CRWZtfZHTM President Trump said U.S. moved ISIS prisoners as Turkey attacks Syria https://t.co/6NMENdU8F1 \"I oversaw DHS Refugee Affairs. Here are 3 ways the Trump Administration is trying to mislead you\" https://t.co/qmGFgBTMNJ President Trump urged Rex Tillerson to help drop DOJ charges for Giuliani client https://t.co/T6q9Ogi13m These are the key U.S. and Ukrainian players in the Trump impeachment inquiry https://t.co/OazJzyKwLe The Disney CEO discusses consequential fun, firing humanely and what he learned from scraping chewing gum off desks https://t.co/ybSL8m0Fwd Here's the \"Breaking Bad\" refresher you need before you watch the movie https://t.co/VIe97cZ0qU Kara Walker's latest creation, Fons Americanus—a 13-meter-high fountain unveiled Sept. 30 in London’s Tate Modern museum—presents the brutality of slavery in a subversively joyful setting https://t.co/AQU46eCLNW Devious videographer sneaks Miss Piggy's wedding footage into a real couple's ceremony and people have to respect it\n https://t.co/KH37LLGPbf White House, Congress play constitutional chicken in historic balance of power fight https://t.co/VGAkuAu3vB RT @katxmoon: So, so excited to share my interview with @JYPETWICE. “Physical health and mental health are the most important things that m… Woman accuses former NBC anchor Matt Lauer of rape in Ronan Farrow's new book https://t.co/ZaqsEJ9vIu Two-time Academy Award-winning actor Jessica Lange is also an accomplished photographer. She discusses her photographic tribute to her Midwestern roots in \"Highway 61\" https://t.co/gzN8ObK8X0 Donald Trump Jr.'s University of Florida speaking engagement has led to protests from students who will cover the cost https://t.co/ACavxDfaB6 An international law that largely shields foreign diplomats and their family members from criminal prosecution has come under scrutiny after the death of a 19-year-old man https://t.co/GGzplgym3e In an interview with TIME, K-pop powerhouse @JYPETWICE opens up about how their new album is more personal than ever https://t.co/z91C61cH2w 2 dead following German synagogue attack on Yom Kippur https://t.co/Kp5EzjwpIB https://t.co/AgGrLZDkHO Boris Johnson's father joins the climate protesters his son dubbed \"uncooperative crusties\" https://t.co/sLd7xANeZY https://t.co/aPDOhQsDOd Last year's Nobel Prize in Literature was canceled over scandal and conflict. Can 2019's award mark a comeback? https://t.co/Y48FZ6IAAG Trump, Pentagon have no contingency plan for ISIS jailbreakers as Turkey attacks U.S. allies in Syria https://t.co/kylSbA4iBJ British celebrity Coleen Rooney faked Instagram Stories to catch out a friend leaking details to a tabloid https://t.co/0c7SqGi5v9 https://t.co/QmI9qzi5jN RT @suyinsays: Last year's Nobel Prize in Literature was canceled over scandal and conflict. Can 2019's award mark a comeback? Literary ins… \"While the dozens of new features are compelling, you might want to hold off before downloading Catalina,\" writes @patbits https://t.co/A0GEv8qMBp Rihanna has confirmed reports that she declined a request to perform during the Super Bowl halftime show to support football player and activist Colin Kaepernick https://t.co/U37j1SrOes Investigators hope serial killer Samuel Little's \"near-photographic\" memory will help identify victims https://t.co/fXX2MsOthy President Trump makes it official: He won't cooperate with House impeachment inquiry https://t.co/cBJkU1f5He https://t.co/Bxe6NH4LUN 2 dead following German synagogue attack on Yom Kippur https://t.co/AkQqzzyfXQ Donald Trump says U.S. doesn't endorse Turkey assault on Syria https://t.co/aYRlcBRof4 NBA postpones Brooklyn Nets and Los Angeles Lakers media sessions in Shanghai https://t.co/p7f1lAeTFr Turkey launched a military operation Wednesday against Kurdish fighters in northeastern Syria after U.S. forces withdrew from the area https://t.co/wHw1tcK9Mh https://t.co/LXGZsB0RNE Since January, more than 200,000 cases of measles have been reported across Congo, UNICEF said. More than 140,000 involve children under 5, who make up nearly 90 percent of deaths https://t.co/DYKDURnkBR Trump boasted that his border wall was “virtually impenetrable.” Then an 8-year-old girl climbed a replica https://t.co/kQYtUqTdZB British DJ Fatboy Slim pays tribute to Greta Thunberg during live show https://t.co/ijyYSvsE2c Boris Johnson's father joins the climate protesters his son dubbed “uncooperative crusties” https://t.co/fvP9Ab0o13 These are the 10 best Nintendo Switch games to buy right now https://t.co/OTgJzaIZ0L This grandma has a resourceful life hack to protect herself while cooking with hot oil https://t.co/a3kywVVToS Fat Bear Week is over and it was basically no contest https://t.co/xq0exH1hlE This is exactly how many police it takes to escort a massive pink “octopus” https://t.co/KqVghBS51D Turkey begins an offensive against Kurdish fighters in Syria https://t.co/pyoa6ckGjr President Trump's two Scottish golf clubs are operating at multi-million dollar losses https://t.co/65qaZg4IIa A new report reveals widespread abuse of women during childbirth https://t.co/h48xu1iSgK https://t.co/40xLmoRW7d A British celebrity faked Instagram stories to catch out a friend allegedly leaking details to a tabloid newspaper. The Internet is calling her “WAGatha Christie” https://t.co/pxYRcvrp3d \"Stupid endless wars.\" In angry tweets, Trump defends pulling U.S. troops from Syria https://t.co/EUpsb6kYsR The real story behind the legend of George Washington's revolutionary Yom Kippur https://t.co/MeDBReWh4c “The capabilities are still there.” Why Cambridge Analytica whistleblower Christopher Wylie is still worried https://t.co/pVkESgJNvY Bernie Sanders campaign is trying to keep its momentum going in his absence https://t.co/IvuVAqZ3Gm Today's Word of the Day with @MerriamWebster is “scapegoat” https://t.co/ANG3uWJ8lj Here's what you should say to someone who is observing Yom Kippur https://t.co/ubc9B9yLST https://t.co/nK7t4RrZ8z Couple contracting involves in-depth discussions of three areas: values, boundaries and fears https://t.co/7N5Fw9O2In As with polio, AFM is seasonal—though unlike polio, it arrives in late summer and early to mid fall, rather than in the spring and summer https://t.co/adPzpKrrkn Alabama's capital elects its first black mayor in the city's 200-year history https://t.co/T0CGOwBJ2w Elizabeth Warren unveils environmental justice platform as candidates hone in on the issue https://t.co/Y97MqotsjY U.S. dips in global competitiveness index as Singapore takes top spot https://t.co/UmL48IBUkL Recuperating from heart attack, Bernie Sanders says he may slow his campaign's pace https://t.co/7JKO6LHkPn With \"private donations,\" Melania Trump is building a tennis pavilion at the White House https://t.co/0GiTjrmlBa Senator Feinstein endorses Joe Biden for president, snubbing Kamala Harris https://t.co/3W3RAXloqL A new report reveals widespread abuse of women during childbirth https://t.co/YkmptjhVGK .@LBardugo was in a secret society at Yale. Her latest novel explores the dark and mysterious world of the Ivy League https://t.co/MwosxjnHv2 Nine landmark Supreme Court cases that shaped LGBTQ rights in America https://t.co/d1knHWpyDx 3 scientists share Nobel Prize in Chemistry for their work with lithium-ion batteries https://t.co/qhf7znKG0H President Trump makes it official: He won't cooperate with the House impeachment inquiry https://t.co/9tiUciPIFf Millions of Californians face power outages in the largest preventive blackout in state history https://t.co/5NR0Gzm2Sc Trust the creators of 'South Park' to respond to controversy with even more controversy https://t.co/6BLwy2jCpI Couple contracting involves in-depth discussions of three areas: values, boundaries and fears https://t.co/Ikmi2f97kd The China-NBA spat underscores just how fraught Sino-U.S. relations have become https://t.co/2Ms1YU4U0J \"It was their sincerity, consistency and ability to embody the spirit of the times.\" Bang Si-hyuk, the mastermind behind @BTS_twt, on the distinguishing factor that set the K-pop group on its unique path https://t.co/Mh8N120AlR To understand why the new 'Joker' movie is so controversial, we need to understand the villain's toxic history — onscreen and online https://t.co/UNfoaLHU9V Christopher Wylie, the man who blew the whistle on Cambridge Analytica, reveals why he's still worried about security and democracy in his new book, 'Mindf*ck' https://t.co/3co5YDJ0Hg Will Hong Kong's democracy protests spread to its close neighbor Macau? https://t.co/CpDBM3tWFQ Alaska Supreme Court to hear youth activists' climate change lawsuit https://t.co/W2TS6tAGRJ Islamic State militants hit U.S.-backed Kurdish fighters in northern Syria https://t.co/GAj5tKtTaC Why Sweden's King Carl XVI Gustaf has stripped five of his grandchildren of their royal titles https://t.co/wqc86psEc1 Sony's next console is officially the 'PlayStation 5.' Here's everything we know so far https://t.co/9NELnMh8BQ The Trump Administration barred Gordon Sondland, the American ambassador to the European Union, from appearing before a House panel conducting the impeachment inquiry https://t.co/cnfr6604Hc The 2019 Nobel Prize in Physics was awarded to three scientists whose work furthers understanding of \"Earth's place in the cosmos\" https://t.co/pifzVL31mK Blizzard Entertainment has banned a professional Hearthstone player who expressed support for protestors in Hong Kong https://t.co/J0OnU1K81T \"I oversaw DHS Refugee Affairs. Here are 3 ways the Trump Administration is trying to mislead you\" https://t.co/NMkgZyRD8x Couple contracting involves in-depth discussions of three areas: values, boundaries and fears https://t.co/rCODj2EZxu Pusha T worked with composer Nicholas Britell for a rap remix to the hit HBO show's theme song https://t.co/Q5NpSD6Cj9 Alabama's capital elects its first black mayor in the city's 200-year history https://t.co/HRRJCikkLY .@LBardugo was in a secret society at Yale. Her latest novel explores the dark and mysterious world of the Ivy League https://t.co/Va8TLjOurh U.S. dips in global competitiveness index as Singapore takes top spot https://t.co/H8HdgaJXRq To understand why the new “Joker” movie is so controversial, we need to understand the villain's toxic history — onscreen and online https://t.co/aIaXZizy6L Senator Feinstein endorses Joe Biden for president, snubbing Kamala Harris https://t.co/tgaENKgE3j “Ever since @BTS_twt’s debut, they’ve never suddenly switched gears or changed pace,” founder and co-CEO of @BigHitEnt Bang Si-hyuk tells TIME. “They don’t shy away from speaking about the pain felt by today’s generation” https://t.co/kVLOJ2x274 \"It was a disaster.\" Jimmy Kimmel explains why his roast of Bill Gates didn't go so hot https://t.co/qvhvkbHA9B Sexually transmitted disease diagnoses in 2018 broke a record for the fifth consecutive year, according to new data from the CDC https://t.co/iJcxCX9MXz Here are 15 new books you should read this month, from Ben Lerner's “The Topeka School” to Elizabeth Strout's “Olive, Again” https://t.co/ofCauGBcYt Review: Forget \"The Masked Singer.\" Netflix's \"Rhythm + Flow\" is the best music competition show in years https://t.co/fK1RHnwL7P 'It's just so surreal.' Simone Biles sets record as U.S. wins world gymnastics team gold\nhttps://t.co/NKg4L6UpW7 “How neuroscience could explain the rise of addictions, heart disease and diabetes in 21st century America,” by Peter Sterling https://t.co/RBYMKjYqEe 9 landmark Supreme Court cases that shaped LGBTQ rights in America https://t.co/mgUDbpKMWh The Disney CEO discusses consequential fun, firing humanely and what he learned from scraping chewing gum off desks https://t.co/nbQfYJdgMb President Trump makes it official: He won't cooperate with House impeachment inquiry https://t.co/M0Fsi4F1kD How the AIDS crisis changed the dynamic between gay men and women, as told in Edie Windsor's posthumous memoir  https://t.co/233pdgARsm “The capabilities are still there.” Why Cambridge Analytica whistleblower Christopher Wylie is still worried https://t.co/J1GLLS4Xht Couple contracting involves in-depth discussions of three areas: values, boundaries and fears https://t.co/Tr70nYcbnS These are the key U.S. and Ukrainian players in the Trump impeachment inquiry https://t.co/Kus21ODLn8 Climate activists block central London streets as Boris Johnson derides them as “uncooperative crusties” https://t.co/oIXK3NOClj .@LBardugo was in a secret society at Yale. Her latest novel explores the dark and mysterious world of the Ivy League https://t.co/MkXAMQkVpH D.C. inmate supported by Kim Kardashian released after more than 20 years in prison https://t.co/xUeSADtOUT RT @billyperrigo: \"I don’t know how regularly you are involved in bar fights, and I’m not saying I regularly engage in bar fights, either.… Bernie Sanders says he was “dumb” for ignoring symptoms before his heart attack https://t.co/pnlp3r97LP After national outcry, Florida judge clears record of man who served 10 days in jail for missing jury duty https://t.co/ks2wdxBkR4 Border Patrol apprehended nearly 1 million migrants at the southern border in fiscal year 2019 https://t.co/xCF1S77246 Pusha T worked with composer Nicholas Britell for a rap remix to the hit HBO show's theme song https://t.co/57Jyz09Hwb Blizzard bans hearthstone player for supporting Hong Kong protestors https://t.co/D703spYA07 Sexually transmitted disease diagnoses in 2018 broke a record for the fifth consecutive year, according to new data from the U.S. Centers for Disease Control and Prevention https://t.co/L0W3stnpmu https://t.co/BTsqfOMaZU RT @raisabruner: So @BigHitEnt's Bang Si-hyuk talked to me for *an hour and a half* about everything from the success of @BTS_twt  to the r… To understand why the new “Joker” movie is so controversial, we need to understand the villain's toxic history — onscreen and online https://t.co/7ilkQqvdr3 A snake mistake? Reptile expert says thieves stole his duffel bag containing 3 pythons https://t.co/G4dHELk91j While \"The Little Mermaid\" won’t air live on ABC until Nov. 5, John Stamos’ portrayal of Chef Louis has already become a flash point for online fun https://t.co/NKMFHfLMMa “Ever since @BTS_twt’s debut, they’ve never suddenly switched gears or changed pace,” founder and co-CEO of @BigHitEnt Bang Si-hyuk tells TIME. “They don’t shy away from speaking about the pain felt by today’s generation” https://t.co/4diLmjb8pK \"It was a disaster.\" Jimmy Kimmel explains why his roast of Bill Gates didn't go so hot https://t.co/1zRo5xMrx8 \"I'm friends with a lot of people who don't share the same beliefs that I have,\" she says https://t.co/OOVErsmNZN \"I oversaw DHS Refugee Affairs. Here are 3 ways the Trump Administration is trying to mislead you\" https://t.co/tcmZRofe23 Sony's next console is officially the \"PlayStation 5.\" Here's everything we know so far https://t.co/MuBdiDrl9e Sexually transmitted disease diagnoses in 2018 broke a record for the fifth consecutive year, according to new data from the CDC https://t.co/dcHBYheoVu American F-16 fighter jet crashes near U.S. Air Force Base in Germany https://t.co/pfiV3qEAI4 Aaron Paul and Bryan Cranston had the best time reuniting at the \"Breaking Bad\" movie premiere https://t.co/ZW0qMVgNOc Trump ally Lindsey Graham invites Rudy Giuliani to testify before Senate panel about Ukraine https://t.co/s4xAmBaxmH Five of King Carl XVI Gustaf of Sweden’s seven grandchildren will no longer have to perform royal duties and will no longer receive taxpayer support, the Swedish Royal House announced https://t.co/bsOJHfAGlz In an “official apology,” show creators wrote, “Like the NBA, we welcome the Chinese censors into our homes and into our hearts” https://t.co/F3F7WrVByw Lawsuit alleges federal agents are using immigration marriage interviews as deportation traps https://t.co/KyjrHQBARv Mustachioed roller blading man's spins are positively enchanting and the Internet agrees https://t.co/NuYQ06wNcE Here are the 2019 Nobel Prize winners (so far) https://t.co/QBcTqLn58P RT @frantrianni: Indianapolis! This Saturday @justinesimons and I will be discussing how the @TIME team used social media, an award-winning… Today's Word of the Day with @MerriamWebster is \"caustic\" https://t.co/7GkF6OEkLt Ellen DeGeneres defends sitting next to George W. Bush at NFL game: \"I'm friends with a lot of people who don't share the same beliefs\" https://t.co/cnPQwzzarC The Trump Administration barred Gordon Sondland, the U.S. European Union ambassador, from appearing before a House panel conducting the impeachment inquiry of President Trump https://t.co/qWMbdbgx7r “If you either don’t know your history or don’t pay close attention, you might never know that a forest was ever here” https://t.co/HrvEoElEW7 Naftogaz, a key transporter of natural gas from Russia to the European Union, is at the center of both legitimate U.S. policy goals in Ukraine and allegations of a pressure campaign exacted by businessmen tied to the Trump Administration https://t.co/Zg6kYJHl4h \"My great and unmatched wisdom.\" Trump ignores warnings on Syria retreat, threatens to \"destroy\" Turkish economy https://t.co/t8pjr1rEiG \"I created a system to make sure my husband and I divide household duties fairly. Here's how it works\" https://t.co/b96SieyNtj Amid China backlash, NBA Commissioner says league will support freedom of speech https://t.co/yH8uKwisgU \"Over the past four seasons, @jessmendoza won over many baseball fans with her preparation and a conversational style that translate's the games intricacies into digestible nuggets for viewers,\" writes @seanmgregory https://t.co/JMNABaMXhV FBI: This 79-year-old inmate is the deadliest serial killer in U.S. history https://t.co/eVXSRST0Mx Supreme Court hearing arguments in cases set to impact LGBT people's workplace rights https://t.co/43LTDACHQ5 The Disney CEO discusses consequential fun, firing humanely and what he learned from scraping chewing gum off desks https://t.co/heIQF1sfys The true story behind 'Lucy in The Sky'—and the one key detail the movie leaves out https://t.co/rRTvLjxPR2 \"This decision represents not just a moral betrayal of men and women who fought and bled by our side,\" writes @DavidAFrench, \"it represents a strategic blunder that is likely to cost American lives for years to come\" https://t.co/ueIz0lULt3 2019 Nobel Prize in Physics awarded to three scientists whose work furthers understanding of \"Earth's place in the cosmos\" https://t.co/2ACeus1PpQ The 13 interlinked stories in 'Olive, Again' embrace both new and familiar characters navigating the struggles that arise in everyday life https://t.co/6JC9OdjZVV The climate crisis is global, but these six places face the most severe consequences https://t.co/H4e0XTYwh4 When tights first became a wardrobe staple, they signified something that went far beyond a simple change of season: freedom https://t.co/8y0AvufgkP As unrest grips Hong Kong, authorities in Macau are cracking down on any show of solidarity by Macau residents for their Hong Kong neighbors https://t.co/ZQjKRiaEqp Here's what young people all over the world say they want most in a partner https://t.co/ur32Vc4Tj7 Review: The problem with 'Joker' isn't its brutal violence. It's the muddled message it sends about our times https://t.co/sPweLTHiCI U.S. blocks imports from five countries over allegations of forced labor https://t.co/toBD3KwCDy .@louistheroux, widely regarded as the face of modern British documentary filmmaking, has become his own subject with his new book 'Gotta Get Theroux This' https://t.co/xFG0NRx76g How old is your pet in human years? The answer is a little complicated, according to a vet https://t.co/bFVxZ4A5TB Iranian Supreme Leader Ali Khamenei is one despot Trump might not win over https://t.co/QpvRYvWODO The surprising origins of the phrase \"you guys\" https://t.co/WSkDtlWSEX \"Yes, America is rigged. Here is what I learned from reporting on Koch Industries,\" by author Christopher Leonard https://t.co/jTHeDDIXUC Pounding large quantities of water may not be the best or most efficient way to meet the body’s hydration requirements https://t.co/dv2V8f2KDF U.S. declares emergency as Typhoon Hagibis threatens the Northern Mariana Islands https://t.co/7Ta2NRH5nN Here's everything new on Amazon Prime Video in October 2019 https://t.co/LQGM2GzGAO Facebook to pay $40 million to settle advertiser lawsuit over inflated video views https://t.co/jHNBqBg4nr \"I busted some doors down.\" Young M.A on her new album, depression and breaking boundaries https://t.co/wZbOaQvzws Here are the favorites to win the 2019 Nobel Peace Prize https://t.co/3ayuZUbObm Less than two weeks after debuting a new line of gender-neutral dolls, Mattel has unveiled its latest Barbie Career of the Year doll: Judge Barbie https://t.co/FMaIwYlnhe Sri Lankan President Maithripala Sirisena to exit with reform promises unfulfilled https://t.co/u6PLHX5y9I Trump ignored repeated warnings about abandoning Kurdish allies in Syria, citing his \"great and unmatched wisdom\" https://t.co/wffg7yMa3v U.S. blacklists Chinese artificial intelligence firms over abuses against Muslim minorities https://t.co/B2yJpYptvf Former President Jimmy Carter helped build a home in Nashville despite injuries sustained in a fall https://t.co/58RXEsgXc2 How a Ukrainian gas company wound up in the middle of Trump's impeachment drama https://t.co/2GXpWsPLSK Even before it dominated the Emmys, \"Fleabag\" was bound to loom over Showtime's \"Back to Life.\" Here's how the two series differ https://t.co/O6H0XNceSL How Trump's obsession with a conspiracy theory led to the impeachment crisis https://t.co/9amD7cjIwW The Disney CEO discusses consequential fun, firing humanely and what he learned from scraping chewing gum off desks https://t.co/RVcvtpXxnf “We can’t watch movies in a vacuum, and no matter how entertaining they are, they can’t blot out the larger world we live in,” writes @szacharek in her review of #Joker, which hits theaters today https://t.co/Tb24i1IKsN \"The U.S.-China trade war is inflicting the most damage to the global economy, but it’s the trade spat between Japan and South Korea that signals the larger troubles ahead for the world,\" writes @ianbremmer https://t.co/x0JuonmceY Dick's Sporting Goods CEO says company destroyed $5 million worth of assault rifles to take them 'off the street'\nhttps://t.co/OkrzoCdLM6 “Trump is still the central U.S. civil officer in the spotlight, but now it seems Vice President Pence may be implicated as well,” writes Martin London, who was a principal lawyer for Vice President Spiro Agnew https://t.co/twqmQKcKmb Here are 15 new books you should read this month, from Ben Lerner's “The Topeka School” to Elizabeth Strout's “Olive, Again” https://t.co/3qyQQwxRKS \"This decision represents not just a moral betrayal of men and women who fought and bled by our side,\" writes @DavidAFrench, \"it represents a strategic blunder that is likely to cost American lives for years to come\" https://t.co/wN4DiKjs2M Diplomat's Wife Suspected in Fatal U.K. Car Crash Returned to the U.S. After Telling Authorities She Would Stay. Here's What to Know https://t.co/IOuzxJPSMf Discovery of 20 new moons makes Saturn the 'true moon king' of the solar system https://t.co/RRzqDu9QNU As unrest grips Hong Kong, authorities in Macau are cracking down on any show of solidarity by Macau residents for their Hong Kong neighbors https://t.co/sOs8kNA3Zd \"I'm not afraid of dying.\" \"Jeopardy!\" host Alex Trebek opens up about renewed cancer treatments https://t.co/do7thDlHoi Maine U.S. Border Patrol agents accused of \"textbook racial profiling\" https://t.co/yQj7Qh901a Deer crashes into Long Island hair salon https://t.co/0nWtWvvVvw https://t.co/ml9mko118G Three-quarters of survey participants believe that female workers are paid less than their male counterparts who do similar work. That may seem like a consensus, but only 62% of men held this belief, compared with 86% of women.\n\nPresented by @eqltycantwait https://t.co/yFzH2c7pKp “Marketing this addictive product to children must stop,” Melania Trump said https://t.co/S8YqpO3Thm Why the story of America's last slave ship could offer a case for reparations https://t.co/1LVo67lwuI Review: Forget \"The Masked Singer.\" Netflix's \"Rhythm + Flow\" is the best music competition show in years https://t.co/iYSCRwYpmU A Pennsylvania man sexually assaulted a woman who was in his wife’s bridal party two days before his wedding, police say https://t.co/pYDqmTWive Activists with the Extinction Rebellion movement blocked roads and staged demonstrations in big cities around the globe Monday, part of a wide-ranging series of protests demanding much more urgent action against climate change https://t.co/6kIHYQ8kap The NBA’s Chinese social media account posted that the league was “extremely disappointed” by Houston Rockets general manager Daryl Morey’s “inappropriate” tweet. NBA spokesman Mike Bass’ statement did not say those words https://t.co/c1hsxI4tPs \"I don't understand the anger.\" Judge responds to criticism over her hug, Bible for Amber Guyger after Botham Jean murder conviction https://t.co/TCRXhOSCBn Since America’s early days, leading politicians have had to contend with awkward problems posed by their family members. Joe Biden is the latest to navigate this tricky terrain https://t.co/tSWBh1r11U Japanese authorities said they rescued all of about 60 North Korean fishermen whose boat collided with a Japanese patrol vessel and sank https://t.co/pKPVgThwxV Acting Homeland Security Secretary Kevin McAleenan shouted down by immigration protesters at policy conference https://t.co/CVXZUAvMYS “I’m lucky that my work gives me a view of all the amazing discoveries in the works right now. That’s why I’m able to predict the future,” Bill Gates said at the University of Cambridge https://t.co/9eEC7mOHuz “How neuroscience could explain the rise of addictions, heart disease and diabetes in 21st century America,” by Peter Sterling https://t.co/3wpI8TsulR Less than two weeks after debuting a new line of gender-neutral dolls, Mattel has unveiled its latest Barbie Career of the Year doll: Judge Barbie https://t.co/fYzGQbZddb Deer crashes into Long Island hair salon because it probably wants to feel beautiful, too https://t.co/xnB0aixDpw Can we predict the future of global health? Bill Gates thinks so https://t.co/yfKWSFqMIA Stop me if you've heard this one: a robot and a team of Irish scientists walk into a senior living home https://t.co/cPts2rShEZ GOP allies criticize President Trump's Syria withdrawal announcement https://t.co/1BmbNGJIAo Prince George joined his parents at a Premier League match — and was his team's most enthusiastic supporter https://t.co/KcFYlP1jr6 A clever hotel hack got Twitter to share its best travel tips https://t.co/HWVEyc04On If you’re having a tough time getting in the Halloween spirit this year, then it may be time for a quick trip south of Pittsburgh for dinner at Angelo’s II https://t.co/mAXyUVAk1C Olympic divers assemble Avengers-style and everyone's flipping for it https://t.co/rVJNvIllZZ Here are the favorites to win the 2019 Nobel Peace Prize https://t.co/TjUJmPg0ar Review: A brilliant \"Big Mouth\" season 3 premiere is one of the best TV episodes of the year https://t.co/ZGUlL8Q5s0 The true story behind “Lucy in The Sky”—and the one key detail the movie leaves out https://t.co/9AGohHEg4J Today's Word of the Day with @MerriamWebster is \"redound\" https://t.co/2nvNWMPUeq Nothing and no one can distract crochet lady from her purpose https://t.co/uYKBp4jadM Federal judge rejects President Trump's challenge to New York tax return release https://t.co/fvdtczrEIQ The 20 best Halloween TV episodes of all time https://t.co/LFIOgZWEUe The general manager of the Houston Rockets angers China with a tweet on the Hong Kong protests https://t.co/dvdoBjkamO How a quickly-deleted tweet about China got pretty much everyone mad at the NBA https://t.co/dgw3teFsv6 Ginger Baker, Cream's volatile drummer, dies at 80 https://t.co/76RNRfQzh5 Welcome to the restaurant with a front-row seat at the Hong Kong protests https://t.co/3E7Lbcv7hL Supreme Court returns for high-profile cases on abortion, LGBT rights and more https://t.co/WrrnySHOyQ Aaron Paul on revisiting his “old friend” Jesse Pinkman in 'El Camino: A Breaking Bad Movie' https://t.co/sntLOH0d4E Here are all the 2019 Nobel Prize winners (so far) https://t.co/yZG0lv3sJT Police arrest 24-year-old suspect in murders of New York City homeless men https://t.co/YOgBwxcE6M The 2019 Nobel Prize in Medicine has been awarded to three scientists for research on 'how cells sense and adapt to oxygen availability' https://t.co/fhAt38u5h0 Here's everything new on Amazon Prime Video in October 2019 https://t.co/DCQBIEktR7 .@louistheroux, widely regarded as the face of modern British documentary filmmaking, has become his own subject with his new book 'Gotta Get Theroux This' https://t.co/PSANUV6dBE Review: The brilliant season 3 premier of 'Big Mouth' explains why we're all so messed up about women's sexuality https://t.co/cUNzkZ16xs Britain's Boris Johnson renews vow to leave E.U. on Oct. 31 https://t.co/SgY1hQLDMw John Oliver looks back at China's one-child policy on 'Last Week Tonight' https://t.co/oAmzy2uyza Iranian Supreme Leader Ali Khamenei is one despot Trump might not win over https://t.co/VNm9lyT1zA Will Hong Kong's democracy protests spread to its close neighbor Macau? https://t.co/Pl3R0Vq0zP Is melatonin safe to take every night? https://t.co/nnwvzFGteY Protests choke communities in Haiti as aid and supplies dwindle https://t.co/eGtHCbRkuw U.S. forces in northern Syria are moving aside to clear the way for a Turkish assault https://t.co/DNdJ22RqNY Review: The problem with 'Joker' isn't its brutal violence. It's the muddled message it sends about our times https://t.co/X0g9jF0qZc \"The U.S.-China trade war is inflicting the most damage to the global economy, but it’s the trade spat between Japan and South Korea that signals the larger troubles ahead for the world,\" writes @ianbremmer https://t.co/41nCAz9H7e A second whistleblower on the Ukraine-Trump call has come forward, lawyer for first whistleblower confirms https://t.co/WOkDNV7pDa The general manager of the Houston Rockets angers China with a tweet on the Hong Kong protests https://t.co/qsxSYdFhZm Key witness in Amber Guyger murder case fatally shot days after emotional trial wraps up https://t.co/lHWeIALcGh This Greek island is being devastated by thousands of goats https://t.co/6TlPKeYOWq Ginger Baker, Cream's volatile drummer, dies at 80 https://t.co/bgK6if8aen \"God is not going to put it in your lap.\" What made Fannie Lou Hamer's message on civil rights so radical—and so enduring https://t.co/MWm4RK6gLZ Here's everything new on Netflix in October 2019 — and what's leaving https://t.co/8lRBjz1dq9 Welcome to the restaurant with a front-row seat at the Hong Kong protests https://t.co/yQm8m7WIyV Cycling-friendly cities like Copenhagen and Amsterdam are learning e-scooters and bikes don’t necessarily play well together https://t.co/TRvH3gR8z6 Jessye Norman possessed an incredible instrument and was a scholar in her approach to singing, writes Denyce Grave https://t.co/o2EVw9NeJ7 If you’re one of the millions of people currently in debt, it may feel like you have a formidable mountain to climb. However, according to financial experts, there is one way to make the journey to being debt-free a little bit easier https://t.co/yQ6jCK0W3p What Forever 21's bankruptcy means for the future of fast fashion https://t.co/ziBbwZnKE0 \"I busted some doors down.\" Young M.A on her new album, depression and breaking boundaries https://t.co/wZbOaQvzws The 20 best Halloween TV episodes of all time https://t.co/2UPOaLIKub \"I will not allow that to be your life.\" A mother's letter to her black sons on growing up in America https://t.co/CVfyhyRmly “How to return a farm to the wild, watch nature return—and maybe find a way to save the planet,” https://t.co/ayMwaHvGc1 Inside the race to build the world's first commercial octopus farm https://t.co/npA4IsAT83 The true story behind “Lucy in The Sky”—and the one key detail the movie leaves out https://t.co/yfdstLHA42 This Italian-Egyptian singer was attacked by populist politicians. His groundbreaking success is silencing critics https://t.co/QMUsy8qo4w The 13 interlinked stories in \"Olive, Again\" embrace both new and familiar characters navigating the struggles that arise in everyday life https://t.co/hb3LVUqt0d Why did Christianity thrive in the U.S.? https://t.co/OYJvUQJHjl Colin Powell: The Republican Party needs to 'get a grip' and stand up to Trump https://t.co/XkRHUXbO8F Let's check in on cool parents like Will Smith and Reese Witherspoon who have joined TikTok https://t.co/G0fUmNPNTf Why you really shouldn't kill the spiders in your home, according to an entomologist https://t.co/L2d8l5vKq4 Over 100 dead and thousands wounded in Iraq as unrest continues https://t.co/wuR3icPFjs Greta Thunberg visits the Dakotas to discuss oil pipelines https://t.co/GAJRwrBJ59 \"The U.S.-China trade war is inflicting the most damage to the global economy, but it’s the trade spat between Japan and South Korea that signals the larger troubles ahead for the world,\" writes @ianbremmer https://t.co/uUFnrLBy0O \"God is not going to put it in your lap.\" What made Fannie Lou Hamer's message on civil rights so radical—and so enduring https://t.co/jFtENZZg26 \"I want to see more women in the position to make decisions, control resources, and shape policies and perspectives,\" writes @melindagates. She's committing $1 billion to expanding women’s power and influence in the United States https://t.co/JAiGFSfs3w Joker breaks record for October opening weekend box office https://t.co/lVN6qjyMf1 No settlement in sight as United Auto Workers, General Motors talks hit a snag https://t.co/PPZYXW0hc3 5 people injured in utility explosions at California Oktoberfest celebration\nhttps://t.co/eP33iK2xJV Review: A brilliant \"Big Mouth\" season 3 premiere is one of the best TV episodes of the year https://t.co/LDktUvWN88 .@louistheroux, widely regarded as the face of modern British documentary filmmaking, has become his own subject with his new book \"Gotta Get Theroux This\" https://t.co/gMhCNDXuEt Key witness in Amber Guyger murder case fatally shot days after emotional trial wraps up https://t.co/mik3C9Skvs In order to slow down climate change, we must solve four seemingly unsolvable problems, writes @JaneGoodallInst https://t.co/yglz4fOGui \"Over the past four seasons, @jessmendoza won over many baseball fans with her preparation and a conversational style that translate's the games intricacies into digestible nuggets for viewers,\" writes @seanmgregory https://t.co/8SWrVZlwpE A second whistleblower on the Ukraine-Trump call has come forward, lawyer for first whistleblower confirms https://t.co/CSJ3pApHkH 10 tips for taking better smartphone photos from pro photographers https://t.co/DFsASFs6yT Aaron Paul on revisiting his “old friend” Jesse Pinkman in “Breaking Bad: El Camino” https://t.co/3ujPuEEocj https://t.co/apUWpjq32F \"If you think about it, work-life balance is a strange aspiration for a fulfilling life\" https://t.co/iaxeGsBoK5 Britain's Boris Johnson renews vow to leave E.U. on Oct. 31 https://t.co/lJB54qfbHJ \"All those new features only serve to highlight the tightrope Apple’s walking when it comes to battery life,\" writes @patbits. \"Here’s hoping it’ll finally make a watch that’ll get through the night next year\" https://t.co/j6rcPiu1F6 According to 'Saturday Night Live,' Mike Pence has a Ferris Bueller-inspired impeachment strategy https://t.co/jt10iIBzgS Finished reading \"The Testaments?\" Margaret Atwood answers all your burning questions about the plot https://t.co/XSXbMeDspj North Korea threatens to end nuclear talks with U.S., citing 'hostile policy' https://t.co/kAayKTSb7b \"It’s time to listen to the people whose lives are being directly affected by immigration policies,\" writes @selenagomez. \"It’s time to get to know the individuals whose complex stories have been reduced to basic headlines\" https://t.co/aHE31i0t4Q Review: The problem with “Joker” isn't its brutal violence. It's the muddled message it sends about our times https://t.co/tOkxIMQeXM 4 killed, 5 injured in shooting at Kansas City bar: Authorities\nhttps://t.co/pYrh6IB9kW Hong Kong plunges deeper into crisis as protests break out for the third consecutive day https://t.co/Wgsxj5gixB https://t.co/atwQOcq6kQ “How neuroscience could explain the rise of addictions, heart disease and diabetes in 21st century America,” by Peter Sterling https://t.co/6jzkvabHlp Low wages, sexual harassment and unreliable tips. This is life in America’s booming service industry \n\nProduced in partnership with @fullerproject \nhttps://t.co/Qq9xgISkLk Why you shouldn't immediately worry if your child is a late talker, according to a speech pathologist https://t.co/RYp2F9WcZe \"I created a system to make sure my husband and I divide household duties fairly. Here's how it works\" https://t.co/e4V5gZeLku The real history behind the #DowntonAbbey movie https://t.co/lMKSPvGqmY The MoMA will soon reopen following extensive renovations. Here's what to expect from the revamped museum https://t.co/z2EOVFxzal \"You’re not a person if you don’t drink.\" \n\nHere's how this tiny European country developed the world's worst drinking problem https://t.co/K9qAM4YzHv Einstein was widely thought to be public enemy number one of the Nazis. Here's how Britain helped him escape https://t.co/o15SaGM9cL The best—and worst—new network shows of fall 2019 https://t.co/yus4q8OliV #StrangerThings season 4 is happening. Here's everything we know about what's next for the Netflix hit https://t.co/C9SylzKwUi A recent study says naps aren’t a lazy indulgence. In moderation, they may actually be good for your heart https://t.co/B8onGDgsh4 Here's everything new on Amazon Prime Video in October 2019 https://t.co/Pnz5I5GH3X Hong Kong spirals deeper into crisis as protests break out for the third consecutive day https://t.co/l2vKQIO3Ik What the history of beards reveals about the changing meaning of masculinity https://t.co/S21dzaJ5bG Review: \"'Link’s Awakening' is both a throwback to the best Zelda games of the ’90s and an original twist on the classic formula\" https://t.co/V8TAStAwhY How old is your pet in human years? The answer is a little complicated, according to a vet https://t.co/s8VEo8Ko6s Though juice was once a cornerstone of a balanced breakfast, its place at the table has been looking a bit precarious these days. But is a glass of OJ really a big deal? https://t.co/Feu0A2WgIL Review: Renée Zellweger captures Judy Garland's dazzling essence in \"Judy\" https://t.co/Bv9vPe4OIG China is the largest carbon emitter in the world. Here's what the country has to do to reach its vast potential for emissions reduction https://t.co/DmHUaduqXY Review: \"Imaginary Friend\" is less a story of awkward youth and more a gleeful meditation on human brutality https://t.co/OZxZh35As1 The forgotten history of the Native Americans who helped the Underground Railroad https://t.co/OUzTDJt6gq When tights first became a wardrobe staple, they signified something that went far beyond a simple change of season: freedom https://t.co/7W4VH26UHz \"I tried the cheaper iPhone 11 after reviewing the Pro. Here's what I missed the most\" https://t.co/AjNkrmjBCJ \"How your obsession with short-term results can hurt you in the long run\" https://t.co/6dhQgxN3Mt These types of screen time may be worst for kids' grades, a new analysis suggests https://t.co/4zBWoEziwc \"Deepfakes\" are videos designed to trick you into thinking they're real. But there's a way to detect them https://t.co/TMO2AKRJK5 Review: \"'The Irishman' is so layered with detail, and shifts so gracefully through so many eras, that it’s hard to tease out a clearly defined plot. Even so, the movie is beautifully constructed\" https://t.co/1qPSjb0jyG Here's new music from @NiallOfficial, @AngelOlsen, @IAMSUMMERWALKER and more to add to your playlist https://t.co/7nqANHcuGD How did \"left\" and \"right\" acquire their political meanings? https://t.co/BZl5f3hdSh Eddie Murphy pays tribute—gloriously—to a Blaxploitation legend in \"Dolemite Is My Name\" https://t.co/vDQjWFPq0c \"Planes weren’t built for big people like me. Here’s what I want my seatmates to know,\" writes Kimberly Dark https://t.co/jm6EklkXYf Secretary of State Pompeo blasts critics of Trump's Ukraine call for 'silly gotcha game'\nhttps://t.co/mANrXFyxE4 https://t.co/kXpUOoW4DA How to make your phone's battery last longer https://t.co/eXl4335xMG Taliban meets U.S. peace envoy for first time since canceled Camp David visit https://t.co/QWmNsch313 Here's what young people all over the world say they want most in a partner https://t.co/ztLZ3afJw7 “Candidates snapping selfies with voters is not new. But Warren has elevated an old shtick into the centerpiece of her digital strategy,” writes @CharlotteAlter https://t.co/4nT6sJHG1o Hong Kong 'Semi-Paralyzed' as Marches Continue\nhttps://t.co/pIFt3h5zPB https://t.co/cL0ictpMds University of Kansas apologizes for explicit Snoop Dogg performance at basketball season kickoff event https://t.co/AAfuZF1OdA \"I will not allow that to be your life.\" A mother's letter to her black sons on growing up in America https://t.co/CVfyhyRmly Meet the 15 women leading the fight against climate change, from Greta Thunberg to Ellen Page https://t.co/grT7mWBDUj Secretary of State Pompeo blasts critics of Trump's Ukraine call for 'silly gotcha game' https://t.co/fysZIPmF3F The doll can be a boy, a girl, neither or both, and @Mattel is hoping its launch redefines who gets to play with a toy traditionally deemed taboo for half the world’s kids https://t.co/QWm5XyQsEp Elizabeth Warren fires top staffer for 'multiple complaints' of inappropriate behavior https://t.co/TT0R1A8o7c Iraqi security forces kill 9 and injure dozens in new protests\n https://t.co/aVPwvvPJld In the 1980s, the world acted to save the ozone layer. Here's why the fight against climate change is different https://t.co/VFQXsCmHUR The surprising origins of the phrase \"you guys\" https://t.co/2u9sUPUH5e Magnitude 3.6 earthquake awakens Bay Area Californians https://t.co/csY9iPaQBJ Trump orders substantial cut to National Security Council staff after whistle-blower complaint https://t.co/wt3AsWnBD0 Why a plan to redefine the meaning of \"museum\" is stirring up controversy https://t.co/ZqP9EMEnVw Review: Ryan Murphy's Netflix debut \"The Politician\" is peak Ryan Murphy. That's not necessarily a bad thing https://t.co/373F7SeBy0 What it’s like living in one of the hottest cities on Earth — where it may soon be uninhabitable https://t.co/UJkdwQW8TU https://t.co/7OWNK1fqlg https://t.co/sV0koZDo5W Prince Harry to sue 2 U.K. tabloids over alleged phone hacking https://t.co/oJVkRsYx6n Is wine really healthier than beer? https://t.co/bYdcY97I5s Hong Kong 'semi-paralyzed' as marches continue https://t.co/dcfau715QL Even for Nazi camp survivors who sought to eradicate them, the term \"concentration camp\" was hard to define https://t.co/HlQWGpKysA North Korea and U.S. to resume nuclear diplomacy talks in Sweden https://t.co/i4P5HFAL7Q MSNBC anchor Rachel Maddow takes recurring role in the CW's 'Batwoman' https://t.co/S9LUNjfLeo 4 homeless men attacked and killed in New York City https://t.co/2CSemQBcF4 Here’s the true story behind the movie \"Judy,\" and the highs and lows of Judy Garland’s life in and out of the spotlight https://t.co/g7cL2ywkm9 \"Recently, I became an owner of the Dodgers,\" writes Alan Smolinisky. \"The more I reflect on this momentous step in my life, the more I realize that, at its core, it’s about honoring Dad and the opportunities this great nation offered my immigrant family\" https://t.co/yGpCF8fonJ \"While the basic idea of learning from failure is supported by evidence, the sink-or-swim method doesn’t really work,\" writes Diane Tavenner https://t.co/93LW0FKHKi Just two months into his premiership, Johnson’s grip on the keys to 10 Downing Street seem more tenuous than ever https://t.co/4En2Zh0mwA Critic Vince Aletti opens up about his new book, 'Issues,' and being the world's biggest magazine superfan https://t.co/JFDWcJJZvH Even before it dominated the Emmys, \"Fleabag\" was bound to loom over Showtime's \"Back to Life.\" Here's how the two series differ https://t.co/V389liaQ8I \"Yes, America is rigged. Here is what I learned from reporting on Koch Industries,\" by author Christopher Leonard https://t.co/qFBFcosQIK The Disney CEO discusses consequential fun, firing humanely and what he learned from scraping chewing gum off desks https://t.co/oFTFqCPhBq The America that votes in 2020 will look radically different than it did in 2016\nhttps://t.co/EHVWKJYyHm “People from the beginning, every time would say, oh, nobody like you has done this before,” says Kamala Harris. “And I didn’t listen, and we won. But more importantly, the American people did not listen either, and they elected me” https://t.co/LR1qHAJQju https://t.co/XlkscCTd3Q How a new class of trans male actors are changing the face of television https://t.co/E8RyOy1ALy Old friendships, new costumes and timeless royal fever on the set of the #DowntonAbbey movie https://t.co/T2nP3YnHUN \"Godfather of Harlem\" dissects complicated relationships as it examines how white supremacy operates within the criminal underworld, writes TIME's @judyberman in her review https://t.co/Kwlj0iRwxK The Ocean's health is in deep trouble, Peter Thomson writes. Here's how you can help https://t.co/8MKlErMwSM The best karaoke songs for singers and non-singers alike https://t.co/sBPbHrwKn2 Niksen is the Dutch lifestyle concept of doing nothing — and you're about to see it everywhere https://t.co/vTE77mbJv8 The Cosmic Crisp could be a \"game changer\" for the apple growing industry https://t.co/SBrJAxrBWv Randall Munroe, creator of web comic \"xkcd,\" hopes his terrible ideas for producing energy will inspire you to think of better ones https://t.co/xKLstzFmTL Lara Prescott's debut novel reimagines the story behind the publication of \"Doctor Zhivago\" https://t.co/scKFLBtxv7 The story behind that viral “The Handmaid's Tale” wedding picture https://t.co/9cJU8OJQqm 50 years after \"Abbey Road,\" it still matters who loved the Beatles https://t.co/IynjztRWYG “How many voices do we need? How many more traumas do we have to debate until someone listens?” writes @lyzl https://t.co/WxKmDoVSV6 Hong Kong reels from violent overnight protests against a ban on face masks https://t.co/XkmPT3fFcM In her new memoir, Jeannie Vanasco asks a question central to our national conversation about abuse: \"Is it possible to be a good person who commits a terrible act?\" https://t.co/DiH1iRzOwi Mosquito-borne illness EEE has killed 11 people so far in 2019. Here's what to know about the disease https://t.co/5l4fDo4dwB \"Recently, I became an owner of the Dodgers,\" writes Alan Smolinisky. \"The more I reflect on this momentous step in my life, the more I realize that, at its core, it’s about honoring Dad and the opportunities this great nation offered my immigrant family\" https://t.co/GgeyApdpOw Jessye Norman possessed an incredible instrument and was a scholar in her approach to singing, writes Denyce Grave https://t.co/DxhDHShnGK President Trump has signed a proclamation restricting visas for immigrants without health insurance https://t.co/7bC2ioQC59 The Disney CEO discusses consequential fun, firing humanely and what he learned from scraping chewing gum off desks https://t.co/ETfyPjG4qg An Iowa science teacher has been placed on leave over a Facebook comment directed at climate activist Greta Thunberg https://t.co/4W1R8d3JcP Here's what to know about the newly-released text messages between Trump diplomats, Ukrainian presidential aide https://t.co/ypI9GTQr0l The 20 best Halloween TV episodes of all time https://t.co/BC0TOOahDN These are the key U.S. and Ukrainian players in the Trump impeachment inquiry https://t.co/TshuECa5jT The new \"Joker\" movie has already set an October box-office record https://t.co/UMVGIPo7Do NASA sets new date for first all-female spacewalk, after a suit-sizing fail derailed a previous plan https://t.co/YuYrTmiMJ2 The story behind that viral “The Handmaid's Tale” wedding picture https://t.co/KeghPMu2vY He flew 4,000 miles to surprise his father-in-law for his birthday. His father-in-law shot him dead https://t.co/OffEeEx4Hr \"The U.S.-China trade war is inflicting the most damage to the global economy, but it’s the trade spat between Japan and South Korea that signals the larger troubles ahead for the world,\" writes @ianbremmer https://t.co/l2C5auh30k Democrats subpoena White House officials as impeachment inquiry widens https://t.co/vwAiY0uN41 What Forever 21's bankruptcy means for the future of fast fashion https://t.co/tmyMxO4pDH Campaign confirms Bernie Sanders suffered a heart attack on Tuesday https://t.co/7qHFe61IX6 Republican Sen. Ron Johnson says he was told Trump had blocked Ukraine's military aid over 2016 election investigation https://t.co/6L9dclehQ8 \"Over the past four seasons, @jessmendoza won over many baseball fans with her preparation and a conversational style that translate's the games intricacies into digestible nuggets for viewers,\" writes @seanmgregory https://t.co/quVgCLyF68 \"Unlike conventional conservation which is all about targets and control, this is about shelving pre-conceptions, allowing natural processes to re-establish themselves.\" https://t.co/zHaxj7wERn Florida judge sentences man to 10 days in jail after he overslept, missed jury duty https://t.co/3gq74pUBVl Diahann Carroll, Oscar-nominated actress and singer, dies at 84 https://t.co/8BhNaNHbxg https://t.co/2dMK9qRYaW Minnesota mayor calls for police investigation after \"deeply disturbing\" video of 13-year-old girl's arrest https://t.co/YbFjIgRX9n \"'Dolemite Is My Name' leaves you wanting to go out and make something—a poem, a painting, a piece of music—even just for yourself, to leave your mark on the world,\" writes TIME's @szacharek https://t.co/Fgq8ULSb0m"}