{"tweets": "Acompanhe daqui a pouco, live exclusiva com o ganhador do #coveráguacomáçúcar, direto no perfil do @TikTokBrasil do Luan \n\nAcesse 👉🏼 https://t.co/B6twYYYVET \n\n(Equipe LS) Tem cobertura total do show de hoje nos stories! Show + Bastidores! Acompanhem no Instagram #VivaSP \n\n(Equipe LS) Amanhã tem Luan no @caldeiraodohuck! Quem já tá ansioso por aí pra ver? (Equipe LS) https://t.co/YwVpYfcBEZ e saiu o GANHADOR do #coveráguacomaçúcar escolhido por mim, minha produção, equipe do @tiktokbrasil e os likes de vocês! Ezequiel Oliveira, você vai dar uma palhinha comigo AMANHÃ no meu show no UnimedHall aqui em São Paulo! 😍😍😍 vai ser lindo! Te espero lá! (Equipe LS) https://t.co/rnYf3FIpsT vo dormir 💤 só agora. pensando em vcs ♥️ @whityouluan0 @Dannyssouzza bom diaaaa @vishluaanjo num saih ainda..to só de zoio galera ja ta na fila acampada 😱♥️ https://t.co/GkdAOw6Nsb @Dannyssouzza lkkkkkkk acho q agora me vou 💤 @Cat_DoLS q linda! bom trabalho @fcevls1 voou ♥️ @luansworld_ respeita minha calça https://t.co/MUltbHmK3v @simplismentluan nem durmi nega @meuguialrds owwn @yourluannn coisas que eu odeio na vida: acordar cedo @maktublrds pior q nem kkk @MachadoMachador @mibr aii sim @bebedols bom diaaa ♥️ @fellingsforluan td beeem? @ineed_youls bom dia prin alguém aí que acordou cedo? 😅♥️ A gente se encontra no Villa Mix Fortaleza! \nIngressos 👉🏼 https://t.co/kFS1EpihX4 (equipe LS) https://t.co/Qmm4xAPck2 Ingressos esgotados para o dia 26/10 em São Paulo! Mas não fique triste, dia 22/12 tem show extra no UnimedHall 👉🏼 https://t.co/Z9CdeaEdlm #LuanViva (Equipe LS) https://t.co/nqsG61uRGR + de 10 milhões de views em #águacomaçúcar 😎 e se eu te contar que a água acabou?\n\n👉🏼 https://t.co/k9XfBN8Ve9 (equipe LS) https://t.co/0vErKHJkWm @pcampistals @TikTokBrasil 🤣🤣🤣🤣 @mutanteluan @TikTokBrasil improvisa kkkkkkk @anjounicoluan @TikTokBrasil jaaaaaaa @pcampistals @TikTokBrasil faz um! @oursinais @TikTokBrasil tenta assim mesmo @LUANVITORIOSO @TikTokBrasil será??! galera, começou o meu desafio #coveráguacomaçúcar lá no @tiktokbrasil! Participem, pois o melhor cover escolhido pelos likes de vocês + a minha produção, vai subir no palco do meu show no dia 26/10 aqui em São Paulo! To de 👀 nos vídeos de vocês.\n\nhttps://t.co/KIKQHivUaN https://t.co/ziBSpnr8SC Luan é o entrevistado das “Páginas Amarelas” de @VEJA desta semana! (Equipe LS) \n\nLink: https://t.co/Ol1ZL1ZM9k https://t.co/gbbVRdnIRr RT @CentralDeFasLS: OMG!!\n\n- de 600 mil views e Vingança vai bater 300 milhões no @YouTubeBrasil @youtubemusic https://t.co/6SjOaRLEgn RT @t4f: Os fãs pediram e a gente atendeu! Luan Santana confirma mais um show da turnê “VIVA” no palco da maior casa de espetáculo de São P… não vá embora sem um beijo meu... 😘 #águacomaçúcar\n\nAssista no YouTube 👉🏼 https://t.co/k9XfBN8Ve9 (equipe ls) https://t.co/RdjC38GZ0S “antes de desistir do amor / tenta o meu por favor”! Assista agora #águacomaçúcar no @YouTubeBrasil @youtubemusic 👉🏼 https://t.co/9a6lKHQKF7 (Equipe LS) https://t.co/98ZXwI5712 Estamos no ar! #AguaComAçucar \n\nhttps://t.co/RWXQ1gSJtU Live especial #ÁguaComAçúcar! \n\nhttps://t.co/RWXQ1gSJtU Assista agora ao clipe oficial de #ÁguaComAçúcar no @YouTubeBrasil!\n👉🏼 👉🏼 https://t.co/9a6lKHQKF7 #equipels https://t.co/08xJRYwvas Falta 1h pra chegada de Água Com Açúcar no @YouTubeBrasil @youtubemusic! Vamos de tag? #ÁguaComAçúcar E achou que não ia ter surpresa? Achou errado! Amanhã às 15h tem live exclusiva de #AguaComAcucar no @YouTubeBrasil #equipels https://t.co/7aQXta1MZk é amanhã!! #águacomaçúcar, a música mais aguardada do #viva, no @youtubebrasil @youtubemusic ❤️ quinta, 10/10, a partir do meio dia #equipels https://t.co/3qNxmudczn faltam menos de 48h pra #águacomaçúcar no @youtubebrasil! Meio-dia na próxima quinta ❤️ #Viva #equipels https://t.co/x6qTCYORMs faltam 3 dias para o lançamento da música mais esperada do #viva! #águacomaçúcar tá chegando 💛 #equipels https://t.co/3cLkqK7zCo @lovesluan toooooo kkkkkkkk @MeFazBemLuan @poxaluanj0 ooooiiiiiiiii @goianasdoluanr @tuavozacalmals @teprometolr kkkkkkkkkkkkkkk @paixaoluanse eu viiiiii! foi massa ontem né !? @meteorobatman @tuavozacalmals @teprometolr naoooo kd !? @tuavozacalmals @teprometolr 👄 https://t.co/rp9XEuRbx5 @teprometolr tooooooo! @cylrsbr kkkkkkkkkkkkk @AnaLaur21693138 @chiquinho tds! mas esse de ninho é top! @suafaluan @chiquinho passa o endereço @LUANVITORIOSO @chiquinho vamo? @viralizeabraco @chiquinho Levanta e vai lá muié Vocês já foram pra @chiquinho experimentar os novos Shake Mix de Pipoca Caramelizada!? Tem com Ninho® ou com Ovomaltine®.... Um melhor que o outro #ad #publi https://t.co/8igYKPx5aK 10 dias para #águacomaçúcar no @youtubebrasil! Quem tá ansioso? #viva #equipels https://t.co/iTlm6GrVuz 10/10 no @YouTubeBrasil #águacomaçúcar #viva #equipels https://t.co/Ecux8UpMOx Amanhã um bom filho a casa torna,  Luan Santana no #SóTocaTop da @RedeGlobo. Marque na sua agenda e não perca! #EquipeLS #LuanNaGlobo https://t.co/U9mQYRTm0g @dreamsluaanjo @fbbreal Oiiiii @lsmeuinfinito Aaaaaa Ce acha? Depois de tanto tempo eu me “ENCONTRO” de novo com essa linda ♥️ @fbbreal quem viu? https://t.co/vqOj9zwAoj Amanhã quem vai tá ligado no @EncontroFatima? #LuanNoEncontro #EquipeLS https://t.co/s0MFrYcEP5 @nfoiporacasols Oooooiiiiii @tuavozacalmals @Villamix 😍😍😍 @mocachique_ls @Villamix Kkkkkkkkkk será que temos um novo hit pintando?! 🙊 #SofrendoFeitoUmLouco na boca do @villamix Rio Preto 😭 #viva https://t.co/AfWaKPCEIc O Dia da Felicidade tá chegando na @chiquinho. 23 de setembro tem casquinha por 1 real e tdo mundo vai sorrir de orelha a orelha, né mors? #Ad #Publi https://t.co/LN5V2cRGUe E agora eu tô noivo💍😉 https://t.co/iAa4Wgxwgx @anjodeamorls @gshow To voltando pro Brasil! Volto por aqui essa semana. Valeu, @gshow 👊🏼\n\nhttps://t.co/4RgR8lqwSW RT @globoplay: Agora é a vez de vocês provarem que têm Boa Memória. Segue o teste! #LuanViva #ViralizeOAmor @luansantana https://t.co/VsATr… RT @globoplay: 🐦Eu pedi pro Luan responder alguns tweets dos fãs🐦 Vídeo completo está lá no meu insta! #LuanViva https://t.co/8lo1YWdfxt Vai começar agora! Assista #LuanNoVillaMixLisboa https://t.co/gAny6ALNwD @Villamix https://t.co/G9gmAhBafu RT @GazetaFMSP: Saiu o novo Top 11 e olha quem está no primeiro lugar: @luansantana com \"Quando a Bad Bater\"! 👑 Confira a lista completa ht… RT @NickelodeonBR: Eita coisa boa, Luanetes! Vocês são demais! Votem muito pra gente levar juntos o Zeppy dessa categoria tão linda! 📲 Vamo… https://t.co/gwgkGOjqSY @Estadao 🙌🏼 #VIVA #LUANVIVA Lisboaaa, é amanhã! Tem transmissão ao vivo no canal do @Villamix no @Youtube. #LuanNoVillaMixLisboa https://t.co/qUli0nuub2 RT @maisa: 🖤 11 anos depois @luansantana https://t.co/8aMhqrHU7Q RT @globoplay: Qual foi a última vez que você abraçou ou ligou para alguém que você ama? Aproveite mais os momentos reais! #LuanViva @luans… Este rapaz está passando no seu feed só para te desejar uma boa noite e dizer... #VIVA está ao alcance do seu controle remoto ou celular só esperando você assisti-lo 👀 @globoplay https://t.co/E0iPm8JaBI RT @breaktudoawards: Vote em Luanetes – Luan Santana  para Fandom Nacional no BreakTudo Awards 2019, votações ficam abertas até o dia 14 de… RT @Dudu: Que me desculpem os haters mas o DVD do Luan Santana tá impecável. https://t.co/gK65HlzTXC RT @globoplay: Tem cobertura do lançamento da turnê #LuanViva lá no meus stories! https://t.co/IaIQOchpF7 .@TikTokBrasil Chegueeei! https://t.co/tnL7fR8Ynu https://t.co/8fnByeonkw Olhaaaa a Pizza!! #Viva @globoplay As pizzarias que aderiram a embalagem do Viva! https://t.co/k99rGmDZUI RT @CentralDeFasLS: Infos\n\nMetrô Rio:\nEstação Botafogo – túnel de saída para a Rua Voluntários da Pátria.\n\nMetrô SP:\nEstação Paulista – ent… RT @CentralDeFasLS: Olha aqui rapidinho!! Pessoal do RJ e SP!!\n\nTeremos uma ação do VIVA bem legal nas estações de metrô no dia 06/09:\nRJ -… Olha quem é Capa da Sertanejo Vip na @AppleMusic ♥️ Taca play ae galeraaa! https://t.co/y2oQ5lwUPz Tacaaaaaa play nessa Top Brasil que tá linda demaaaais! https://t.co/kykSDajhcn #LuanViva  @SpotifyBR #QuandoABadBater https://t.co/h4QbNGlXWy Mood de hoje 🙃 #LuanVIVA https://t.co/4Fz4K4Wul1 RT @foquinha: O que tem no celular de @luansantana? Invadi a privacidade online de luanzinho e expusemos tudo. Tem até audio com voz de beb… #MPN #LuanSantana #LuanSantanaShow #Luanetes https://t.co/DSjq3lo28P RT @VSertanejo: Cê vai perder essa mulher e a culpa nem vai ser minha. Ela tava bem do seu lado sofrendo sozinha, só você não viu...\n\nLuan… É hojeeee! #LuanNoAltasHoras. Às 23h59, na @RedeGlobo. Perde nãooooo!!! @gshow @oserginho @paolla @WalcyrCarrasco https://t.co/GEdHr3koM2 https://t.co/8BuzgqsCZX https://t.co/qrsPYKCUwZ 😍 tô recebendo fotos dessa “divulgação pesadíssima” (como vcs dizem) 😹 do #VIVA. Tem pelo Brasil inteiro. Tá demaaaais! 👊🏻 @globoplay https://t.co/YBIRnQaSA9 RT @gshow: A bad vai bater com @luansantana amanhã no #AltasHoras! 😻 https://t.co/sQWcTyL014 RT @globoplay: Quando alguém dá o play em #choquetérmico 😂 https://t.co/1KcejuqA4D RT @globoplay: Quando a bad bater está na minha cabeça até agora! Queria compartilhar um pouquinho como foi viver a experiência do lançamen… Eita q essa @DeezerBR tá demais com a #QuandoABadBater no Top 50! 😍 Bora conferir? https://t.co/oRJtctNMfm https://t.co/6ZQije4jow Qualquer sexta dessas o Spotify Brasil ainda me mata de amor 💚 Olha essa capa de respeito em uma das maiores playlists do app! Taca BAD nesse app galera! Playyy nela! 🙌🏼 https://t.co/xdf3Hh9dm0 https://t.co/IDsynX27yN RT @globoplay: Quer saber curiosidades do Viva? Eu te dou! @luansantana https://t.co/uOqvAJ8G7p RT @HugoGloss: E esse encontro do príncipe @LuanSantana com a deusa Paolla Oliveira na gravação do Altas Horas?! Com tanta beleza junta ass… Resenha de #Viva https://t.co/Kv4nZhUm85 por “Meu Sertanejo”. E aí, concordam? 🙃 - EquipeLS RT @gshow: .@luansantana grava vídeo nos bastidores do #Domingão e fala sobre novo DVD -&gt; https://t.co/H1DN9KxnBQ https://t.co/bSdCVUHkm3 Só de olho em quem não assistiu ainda o #Viva no @globoplay e deu play nos apps de música 👀  https://t.co/kykSDajhcn https://t.co/2qCvP6FPvf Quem assistiu Faustão hoje? Foi lindo demais!! #Viva está oficialmente lançado 🙌🏼 Curtam muito, todo meu coração nesse projeto. 3 vídeos disponíveis no youtube e todo DVD no @globoplay https://t.co/nauRTnWIWv aaaaaaaaaa #LuanNoFaustao aaaaaaa ele vai entrar, senhor #LuanNoFaustao Escreva aqui a sua preferida do VIVA a torça para ele cantar hoje no Faustão! #LuanNoFaustao Ai que musicas Luan vai cantaaaar será #LuanNoFaustao - Equipe LS Enquanto isso na Globo... #LuanNoFaustao https://t.co/RhGBw0ajfT #LuanNoFaustao Já já no palco do Faustão #LuanViva Esperando Luan no Faustão hoje #LuanViva - EquipeLS https://t.co/EHuR7DBsXe ♥️ https://t.co/pT6SmIoh7W RT @queulate: Amigos, conselho: escutem o VIVA, o novo álbum de Luan Santana! TA PERFEITO RT @fcdtn_: EU NAO CONSIGO ACHAR UMA MUSICA RUIM NO DVD NOVO DO LUAN SANTANA RT @VSertanejo: Se a gente ficar agora cê não vai lembrar desse momento, me liga quando tiver sóbria se ainda estiver querendo... 🎶\n\nLuan S… RT @muriloribeiro: Pausa para aliviar as tensões: vi hoje, no @globoplay , alguns trechos do #DVD novo do @luansantana , #VIVA. Fiquei impr… RT @globoplay: Venha curtir essa experiência única e inédita. O DVD Viva do @luansantana já chegou aqui no Globoplay. E para você viver ess… status: esperando #LuanViva no faustão amanhã https://t.co/LortYq2ijn E essa capona aí na playlist “Novidsdes da semana” do @SpotifyBR ? Bora ouvir!! #LuanViva https://t.co/mQMpCdFCUf É amanhã!!! Vou lançar oficialmente meu  projeto #LuanViva no palco do Domingão! Me espera Faustão, que tô chegando e tá incrível o resultado 🙌🏼 Este domingo, a partir das 18h, na @RedeGlobo https://t.co/30WPMQ0iCR Eu, neste instante, cantando todas do #LuanViva https://t.co/74f0T00R1v RT @globoplay: Tá faltando #BoaMemória aí hein, @luansantana? 😂 Mas segue o recado mais importante: #LuanViva está disponível!  #LuanViva #… Hoje tem TVZ especial do #LuanViva com essa galera linda na plateiaaa 😍 Não perca! Às 19h no @multishow #LuanNoTVZ https://t.co/9XNFqHdzpB Vem subiiiir! #LuanViva No Youtube!! 💥 CHOQUE TÉRMICO, SOFRENDO FEITO UM LOUCO e MEU INVESTIMENTO!! Assista agora https://t.co/NdgXgIuUF0  #LuanViva DVD completo no Globoplay #LuanViva https://t.co/E5LKyh1GUf aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa abri o @globoplay e surtei aqui! To assistindo AGORA! #LuanViva Veja este vídeo no Globoplay!\n https://t.co/2qo3SWsCBK https://t.co/MNrPBBiQMs Vamos levantad a tag novamente e mostrar o VIVA chega hojeeee Brasil! #LuanViva And... às 11h tem 3 vídeos no @YouTubeBrasil Eitaaaaaa!! - EquipeLS Passando para lembrar que hoje tem #LuanViva no @globoplay- EquipeLS RT @HugoGloss: Hinário INCRÍVEL de Taylor Swift; novo clipe romântico de Iza e DVD grandioso de Luan Santana são destaques nos “Lançamentos… RT @vivisxz: o Luan Santana não erra NUNCA!!!!! que álbum incrível, que repertório fantástico!! eu tô apaixonada demaisss \nele não injustiç… RT @gabysRocha2: Luan Santana publicou seu álbum novo hoje e aq estou eu, comendo pipoca doce, escutando as musicas e chorando horrores...… RT @elainebarbosa88: Sr Luan Santana, TÁ DIFÍCIL ESCOLHER UMA PREFERIDA DO #VIVA 👏🏽👏🏽👏🏽👏🏽 RT @flawdii: chocada com a qualidade musical de TODAS as músicas do novo dvd do @luansantana #LuanViva RT @MAYARA01937278: cara eu tô já viciada no novo álbum do Luan #ViralizeOAmor @luansantana #Viva https://t.co/eZNG1m3BBa RT @mikookrosmos: ÁLBUM NOVO DO LUAN SANTANA PQP OS HINOOOOS https://t.co/d6RoHS1tQT RT @Fellipe940: DVD novo do Luan Santana tá um massacre só por Deus toppp RT @oliveiranderso1: Luan Santana arrebenta namoral, esse álbum novo prometeu e veio MT bom RT @nathzacarias: eu olhei pra luan santana e gritei: MELHOR DO BRASIL! RT @UOLEntrete: Luan Santana diz que a música mais tocada do Brasil foi feita em 5 minutos https://t.co/sFRBNsCMsr RT @Pedroliveira_77: Escutem \"Cê vai perder essa mulher\" do novo DVD do Luan Santana pqppppppp q música RT @chartsluan: . @luansantana VOCÊ É UMA LENDA! ENTENDA!! #LuanViva https://t.co/7CDJQ3v5oW RT @gabgoib: Obrigada, @luansantana por ter nos transmitido a energia e a felicidade desse novo projeto, deu para sentir a sua emoção em co… RT @amandamaayat: O novo cd do @luansantana já tá no Spotify e eu ja baixei todinho, minha nova trilha sonora de todo dia ❤️ #LuanViva RT @multishow: AMANHÃ é dia de #LuanNoTVZ 💕 Lançando o seu novo trabalho, #VIVA, o muso veio trocar uma ideia com essa galera e claro, dar… RT @dominioteenbr: Nasce um hinario !! #LuanViva\n\n@luansantana acaba de lançar o seu mais novo album. Ouça o \"Viva\" agora mesmo e nos diga… RT @eusoquerovclsmg: — VIRALIZE O AMOR! 🌹❤ @luansantana #LuanViva https://t.co/EeKeIv3m8i RT @portalmscbr: O novo hinário de Luan Santana já está entre nós! Confira: https://t.co/EFg1j8U6g6\n#LuanViva https://t.co/wPobNGMSBW RT @POPline: Tem novidade do @luansantana e é grandiosa! Ele acabou de lançar o álbum \"Viva\", uma super produção registrada ao vivo em Salv… que dia lindo! obrigada por terem confiado em mim pra representar vocês! NUNCA DESISTAM DOS SONHOS DE VOCÊS! Obrigada @CentralDeFasLS e claro, Luan! Por você sempre vale a pena! O VIVA É UM SUCESSO #LuanViva RT @Tidal_Brasil: O novo álbum do @luansantana \"Viva\" já está entre nós! Vem ouvir! 💕 #LuanViva  https://t.co/0AayoCL2qX https://t.co/c2lA4… RT @globoplay: Olha que incrível meu mural de recados pro @luansantana #LuanViva #ViralizeOAmor https://t.co/3DO6Vm0C7o eu pamela, estou com as meninas dos fã-sites esperando a coletiva de imprensa e o pocket 😍 @projetolsbr_ @newsls @luandaily @vipscapixabas #luanviva https://t.co/CyhMcDxIWH eu to dançando meu amooooor #LuanViva SAIU!!! ♥️🙌🏼 VIVA!! Em todos apps de música. Ouça agora, tô mto feliz com esse projeto, espero que curtam muito! #LuanViva #ViralizeOAmor https://t.co/biRkOZk8SC https://t.co/RjGP8Iv8xl se um dia tive tombos não me lembro depois de hoje, QUE EVENTO #LuanViva 15 minutos AaaaaaaaaAAAaaaaaAAaaaaaaaaaaaaaaaaaaaaaa #LuanViva Viva nos apps de músicaaa já já https://t.co/fLHFwHsA0H RT @MomentsBrasil: ⚡️ O @luansantana está falando com as fãs sobre seu novo DVD, #LuanViva  https://t.co/NkYLDoXHtr + de 50 mil mençõess uuhuuuu #LuanViva RT @globoplay: Hoje levantei #AcordandoOPrédio e precisando tomar #ÁguaComAçúcar para a coletiva de lançamento do VIVA! E #ACulpaÉSua, @lua… Luan Santana dá detalhes sobre 'Viva', seu novo DVD  https://t.co/UGRGDwg5uQ eu que pedi esse momento sim, mais tarde tem pocket show 😍 #LuanViva Pediram pra cada um que viesse trazer uma lembrança pro luan, e olha a surpresa do @globoplay #luanviva https://t.co/M14V7mF7Ez 1 hora para o Viva no @SpotifyBR #LuanViva No VIVA, você específica para as pessoas “digitarem menos e abraçarem mais, viverem o real e esquecer um pouco o digital.” Pensando nisso, tem alguém que você não vê a muito tempo e gostaria de dar um “abraço que não se digita”? Mariana Silvério, Dumont SP #LuanViva  ‼️ https://t.co/jDS6O9nje8 Depois de 6 anos sem gravar um DVD com grande público, sendo o último o \"O Nosso Tempo É Hoje\"...você sente que amadureceu mais de um projeto pra outro? Tanto na voz, como nas letras e arranjos musicais? ❤❤❤\n#LuanViva  @TropaLS_Pe https://t.co/DvF0RbKiI6 Antes de escolherem o nome “Viva” vocês tiveram outras ideias? Se sim, quais eram? (Bárbara, BH/MG) #LuanViva https://t.co/qFrfdSK3op vou subir separadamente, um por um ta #LuanViva a internet ta ruim aqui! luan gravou várias respostas... esperando subir #LuanViva Obrigado galera  #LuanViva https://t.co/4OQjLXjkGa Q: QUAL FOI A PRIMEIRA MUSICA QUE VOCE ESCOLHEU GRAVAR NO VIVA??????? #LuanViva #ViralizeOAmor\n- @lovesluan\n\nA: https://t.co/xFAb2RdgPS menino mto disputado, varias entrevistas que orgulho sabe reizinho #LuanViva Tô selecionando as perguntas, mandem bala aí #LuanViva Usem a tag para eu achar! Será que vamos bater 50 mil menções da hashtag hoje? aaaaaaai ai ai ai ai #LuanViva luan está fazendo as exclusivas nas entrevistas, em seguida é a gentee no Q&amp;A #LuanViva Vai um teras aí? #LuanViva https://t.co/HRHigeQJgR aí gente tão príncipe falando sobre as influências do viva (luan está nas entrevistas exclusivas) #LuanViva e as perguntas? já já ele vai responder 🤪 #LuanViva ajeitadinha no cabelo pra entrevista #LuanViva https://t.co/ru5g5xgBbd Oiiiiii cheguei 🤪🤪🤪 hoje esse Twitter é meu #LuanViva  - pam RT @sonharsempre_ls: Please help support Luan Santana - VIVA, add a #Twibbon now! https://t.co/4B7q0dHQUq #LuanViva https://t.co/LZbAJ3I7Gm Vem subir a hashtag #LuanViva 🌹 até 17h vamos manter! Bora? - EquipeLS #LuanViva #ViralizeOAmor https://t.co/rdV45R62ci VIVA vem aí 😍 hj um fã vai “invadir” meu twitter com um Q&amp;A direto da minha coletiva de imprensa. para participar com as perguntas, vc deve usar #LuanViva (uia q chique, temos emoji na hashtag) PODE VIR, VIVA! esperando vcsss https://t.co/otdXLbDUjT Nem dá para acreditar!! Hoje, às 20h, #Viva chega em todos apps de música 🙌🏼 E AMANHÃ tem ele lindooooo no @globoplay Quem aguentaaa? Hoje faço Q&amp;A a partir das 17h no Twitter, direto da minha coletiva de imprensa! Participe usando #LuanViva https://t.co/prp5FdNkix Olha o que a galera do @globoplay preparou para os meus fãs! 😍\nUm cupom especial de desconto na assinatura. Quem utilizar o cupom FANDOMDOLUAN vai assinar o Globoplay por apenas R$9,90 no primeiro mês. Mais infos: https://t.co/3w1ck8gysF\nAté 30/08 e só vale p/ novas assinaturas. https://t.co/cCgrSTMIDy PRIMEIRO LUGAR! 🎉 com #quandoabadbater no @spotifybrasil. Bem hj, para comemorar a chegada do #LuanViva em todos apps de música dia 22, quinta-feira, às 20h! Pela primeira vez vou lançar um àlbum antes da meia-noite! É vocês ouvindo mto antes do DVD chegar no @globoplay dia 23! https://t.co/UMkIpGnYTM RT @micheltelo: Tamo pronto para o #CriançaEsperança, turma! @luansantana https://t.co/9yE5jwqDsS RT @chiquinho: @luansantana fez a surpresa pra fã e a Chiquinho garantiu o sabor de felicidade! 🍦❤️ #Chiquinhosorvetes #Luansantana #Canalv… RT @globoplay: Quando a bad bater, você pode contar comigo. #LuanViva #ViralizeOAmor @luansantana https://t.co/qXP2GXjtfK Hoje tem Criança Esperança e a gente vai se emocionar muito ♥️ Doe: 0500 2019 007 para 7 reais , 0500 2019 020 para 20 reais, 0500 2019 040 para 40 reais https://t.co/QwKZIQ2bcd @gshow https://t.co/YovoLVM2EX RT @quemacontece: QUEM, @luansantana, um sofá (ou divã? 😂) e muuuitas perguntas. A gente pediu, ele topou e o resultado foi uma das entrevi… Hora de ouvir @youtubemusic !! A playlist “O Mundo de Luan Santana” tá bombandooo! Bora ouvir? https://t.co/rc22GZKV2P https://t.co/Wrp7xClVaT Pessoal, atenção no concurso! Usem a hashtag mas tb se inscrevam no site!! Não vale apenas criar o conteúdo sem se inscrever. - EquipeLS EU POSSO IR NA SUA CASA AMANHÃ assistir o #Viva antes de todo mundo! Você tem 12 horas para se inscrever https://t.co/optm4Ec846 @globoplay https://t.co/T1epvkFYl3 🚨🚨🚨🚨🚨 Estejam às 12h hoje no instagram do Luan! - EquipeLS Veeeem ouvir #QuandoABadBater https://t.co/kykSDajhcn 👊🏻 @SpotifyBR https://t.co/qTaNpRwWF9 “Mergulhando” comigo desde sempre. Não é a toa que a comemoração hoje é dupla, pelo aniversário da minha carreira e pelo seu dia... você sonhou comigo. Obrigado por ser quem você é! Obrigado por tudo, pai! #DiaDosPais #Luan12Anos https://t.co/Z4zUMA1g4T #Luan12Anos Vc nasceu com luz própria, é estrela! Artista, fenômeno e querido por todos. Receba esse carinho de quem tanto te ama, dos seus fãs, seu público. É Dedicado, talentoso, com o coração enorme... sinta-se abraçado por todos nós. Obrigado e Parabéns Gurizinho! - EquipeLS https://t.co/PgGchecpqV RT @TropaLS_Pe: @luansantana @SpotifyBR TACA STREAM NESSA LENDA AAAAA\n#MPN #LuanSantana #Luanetes #LuanSantanaShow Hey @SpotifyBR, segura que a BAD tá chegandoooo no Top3 já já!! Turma ta empenhada aqui desse lado, lascando play!! https://t.co/kykSDajhcn #quandoabadbater https://t.co/QcyX2BB8lb ♥️ @stevivelr https://t.co/tjPJdEiQgS Live no ar!!! A era #VIVA começou!! @multishow https://t.co/S8FLeCYG0H Vai começar!! Link da live aqui 👉🏻 https://t.co/S8FLeCYG0H @multishow https://t.co/9a9o4EO6JP Dia 06/08, amanhã, tem live comigo no canal do @multishow a partir das 20h!! E aquecimento no meu Facebook às 19h30! Não perdeeeee!! #VIVA https://t.co/f628snHgVW Essa edição do TVZ Especial terá plateia e os fãs serão selecionados pela @CentralDeFasLS - EquipeLS https://t.co/nWPXa9XA7u Desse evento, cada participante sairá com a missão de registrar um momento de conexão real com uma pessoa querida. O conteúdo será exibido em edição especial do “TVZ”, apresentada pelo próprio Luan, no dia do lançamento do “Viva” 🙌🏼🙌🏼 @POPline Vem Viva!! @multishow https://t.co/VDcZXTAvR8 O #VIVA Vem aí! Amanhã, dia 06, vou estar em uma live com essa galera que não tira o cel da mão. A partir das 20h no Canal Música do @Multishow. Às 19h30 tem um aquecimento comigo e uma fã no meu perfil do Facebook! Avisa a galeraaa #VIVA! https://t.co/1fnxV7mDdb Com vocês, A CAPA DO #VIVA 😍 23/08 no globoplay e em todas as plataformas digitais! #VIVA o amor na sua forma mais pura ♥️ #viralizeoamor https://t.co/afhfE1mcvP Já pensou assistir um musical apenas com minhas músicas? #IssoQueÉAmor entra em cartaz dia 06 de setembro em São Paulo e passa por mais 6 cidades!! Os ingressos já estão disponíveis: https://t.co/uNGXIZnlzR @IssoQueEAmorMSC https://t.co/BD11ZDdGjx + #MPN #LUANSANTANASHOW https://t.co/MkUBNLBoh7 Vamos nessa #MPN!! Para votar use também #LUANSANTANA #LUANETES ou pelo site https://t.co/pQQnLUE3HC  @NickelodeonBR https://t.co/7iDOjiWV3j Aooow #VIVA! Uma das maiores playlists do Spotify está comigo na capa 😍 e com #quandoabadbater no topo dela! Quero todo mundo ouvindo demaaais a “Esquenta Sertanejo”!! Compartilha no story, nas redes sociais... play nela! Vambora @spotifybrasil 👉🏻 https://t.co/nlgszrDGaD https://t.co/HIHs8yqZan RT @NickelodeonBR: Meus Prêmios Nick 2019: conheça os indicados de cada categoria 💚💥➡ https://t.co/Q9EhHRLN0V #MPN #TrendyByNick https://t.… RT @projetolsbr_: MUTIRÃO MPN 2019\n\nMETA: comente 30 títulos de músicas do Luan utilizando a tag.\nOBS: Até atingirmos 350 comentários \n\n#MP… https://t.co/2AD4qJBe9G @cnaoficial https://t.co/0P2G1cxQPF Vem ouvir #quandoabadbater entre as melhores do Brasil no @SpotifyBR 👊🏻 https://t.co/kykSDajhcn https://t.co/kpoy2rVmdd Sertanejo Hotlist no \n@youtubemusic\n tem esse rapaz de blusa branca cantando uma BAD boa demais! #QuandoABadBater 🙃 Bora ouvir? https://t.co/CLB7TOoznw https://t.co/xWIxs1ONCC 👉🏻👉🏻👉🏻👉🏻 https://t.co/2AD4qJBe9G @CNAoficial https://t.co/NS6YVz408K RT @YouTubeBrasil: Quando a bad bater, você vai fazer o quê? ♥️ https://t.co/tfhrpFZCAQ E tem novidade boa chegando!! 💥 \nMinhas canções vão ganhar vida no Teatro, em um musical emocionante, chamado “Isso Que É Amor”. Confere o vídeo e segue @IssoQueEAmorMSC para saber mais!  https://t.co/EXVMpwPCQi  #Musical #IssoQueÉAmor #LuanSantana https://t.co/RgKTPCbBiL Aaaah Brasil!!! Entre as 5 MAIS TOCADAS no Spotify Brasil!! 🚀🚀🚀 Bora ouvir mais que a BAD ta danadaaaaa!! #quandoabadbater https://t.co/kykSDaAS3V https://t.co/2dC1gKzph8 RT @globoplay: ⚠️⚠️⚠️Se pudesse perguntar qualquer coisa para o @luansantana, o que você perguntaria?⚠️⚠️⚠️ RT @YouTubeBrasil: Já tá ligado no YouTube Music? É um app novo que dá pra assinar e ouvir todas as músicas do YouTube sem anúncios, e tem… Coisa boa!! O @SpotifyBR arrebentouuu com #quandoabadbater agora na Playlist Top Brasil! 🙃 - https://t.co/k9xfISEDP8. Plaaaay no FDS! EquipeLS https://t.co/RJgdhJzlzP quando a bad bater... RT @POPline: .@SimoneeSimaria lançam clipe ao vivo de “Consciência Suja” com participação de @luansantana. https://t.co/0VUwpOtRBL https://… RT @ficoluan: @luansantana @SpotifyBR já estou meu amor 😬 https://t.co/wUL89ii79A RT @oursinais: @luansantana @SpotifyBR serve deezer bb? https://t.co/DM7rAa0B3r RT @sinaisgurizinho: @luansantana @SpotifyBR tacando stream na lenda https://t.co/b0v4GLuoIY RT @thaitomazini: @luansantana @SpotifyBR Já estou desde cedo no melhor hit ❤️ https://t.co/g4kiyjdhM8 E #QuandoABadBater você vai correeendo no @SpotifyBR ouvir minha nova música!! Já seguiram minha This Is? Então tá aí ó... https://t.co/kykSDajhcn Veeem! Gente, não percam essa promoção do @CNAOFicial. \n#CNADaVontadeDeAprender e dá também fone de ouvido sem fio. \n#Ad https://t.co/TsSJceiYhc #QuandoABadBater está no @youtubemusic e você não pode deixar e conferir agoraaa mesmo! @YouTubeBrasil + Música? Eita que é bom demais! https://t.co/SlUHpXpfUs https://t.co/mngNWr8s4P Agora, no Fantástico!! Ligae! #Viva @showdavida Agora sim! Anotem... o #VIVA já tem data marcada. Pela primeira vez um CONTEÚDO MUSICAL será lançado na íntegra no @globoplay! 🙌🏼 Vou girar essa chave com vocês e vamos fazer um lançamento lindo e grande, como a energia desse show! Dia 23 de agosto! https://t.co/wXAiJyPUZW Meu novo projeto #Viva está chegando e se eu fosse você, não deixaria de entrar aqui exatamente às 21h de HOJE!! Temos um horário marcado! https://t.co/5OnYsBHvEO RT @calordabahials: @luansantana Aqui ta no play o tempo todo meu amô 😍 https://t.co/nvUGWQ2RMS RT @escreveailss: @luansantana Escutando muito https://t.co/EjAo0IzJWC RT @escreveailss: @luansantana To só assim com esse hino https://t.co/g4WWZsrfjs RT @admiroluan: @luansantana escutando aqui amor 🥰 https://t.co/c65LbKKLhy RT @anjounicoluan: @luansantana TACAAAAAAAA STREAM NO HINO ❤ https://t.co/8wu2QnYUgm RT @israridade: @luansantana gostou https://t.co/jMTcHPGtRb eita que vou soltar o play nessa minha this is hoje! e vcs ai? solta o print aí... clica e é só conferir https://t.co/kykSDaAS3V  #Viva  #QuandoABadBater https://t.co/lmiAJYBapN No Top10!! Vem ouvir #QuandoABadBater no @SpotifyBR para subir subir subir! https://t.co/kykSDajhcn Boraaaaaa galera! https://t.co/hhiexqNzMI Já ouviu “Quando A Bad Bater” hoje? A @AppleMusic separou uma playlist só com sucessos e claro que não poderia faltar esse hit! https://t.co/Z6opxi3xrJ Ouça agoraaa a #SertanejoVIP que tô lindão lá na capa 🙃 https://t.co/PIIvsBjqxq OLHA ISSO 😱 quebramos um recorde que era do Legião Urbana em 1998 😳 POSSO VIVER MIL VIDAS QUE NÃO VOU CONSEGUIR RETRIBUIR ESSE AMOR ♥️ #QuandoABadBater #VocesSaoOsMelhoresDoMundo ponto https://t.co/diZjFfJNGo A pergunta é: Quem já ouviu \"#QuandoABadBater na Esquenta Sertanejo hoje no @SpotifyBR ? https://t.co/3XNhI07gP3 https://t.co/6GhXvJhxJw O último episódio do #ProximoN1 é hojeeee! Não perde que está emocionante! A partir das 21h, no https://t.co/VfyDZEerh8 https://t.co/Th3NbCd64g 💥🔥 Primeiro Lugar! Rádios do Brasil, meu muito obrigado. Meus fãs, ouvintes, e todos que fizeram os pedidos de “Quando a Bad Bater” arrebentar nas emissoras do país! Bora que agora foi dada a largada. #QuandoABadBater https://t.co/mB4GWUOqOE RT @POPline: Fã do @luansantana, cês já abriram o nosso site hoje?! Olha a surpresa: https://t.co/oJlKZOLOYi #QuandoABadBater RT @clubefm: Tem novidade do @LuanSantana na nossa programação! Quando A Bad Bater, a primei... https://t.co/t2986zQClk https://t.co/90bbTT… RT @POPline: A música nova do @luansantana, \"Quando a Bad Bater\", entrou na programação das rádios brasileiras nesta quarta-feira e já se e… Luan Santana estreia “Quando a Bad Bater” em 1º lugar nas rádios https://t.co/2GLLga0UbI @POPline RT @GazetaFMSP: Bateu a bad? Então, vem curtir com a gente o novo sucesso do @luansantana, #QuandoABadBater! 🎧 Para pedir a música é só ace… RT @admiroluan: @luansantana escutando o hino neste exato momento #QuandoABadBaterNasRadios https://t.co/NEiDfCPrZn RT @ficoluan: @luansantana viu isso? https://t.co/EMXKpl4YT0 RT @nfoiporacasols: @luansantana Enaltecendo mt por aqui https://t.co/Ea8wlM5oOw RT @luanS_tudo: @luansantana Em sua homenagem https://t.co/NIIJwHJWO3 https://t.co/kykSDajhcn FEITO! https://t.co/FhEABeqyOX Eita Brasil! Segura que “Quando a Bad Bater” está batedo nas emissoras das rádios hojeeeeeee!! Peça na sua preferidaaaaaaa agora mesmo!! Compartilhe o seu pedido com a hashtag #QBBNasRadios https://t.co/cx9Ihg95vC RT @luanrafaelmypr1: @luansantana AQUI MEU AMOR #QuandoAbadBater \n@luansantana @luansantana @luansantana @luansantana @CentralDeFasLS @Cent… @annajgrr agoraa @annajgrr amoo tb vcccc bbzonsurbuwhna RT @_nathydeandrade: @luansantana AQUI MEU AMOR https://t.co/0T5y5m6D1W @coladals kkkkkk RT @encantals: @luansantana TÁ AQUIIIII https://t.co/4VMO3eDV75 RT @fcluaneterno_rs: @luansantana chuva de print p vc https://t.co/LUS7LLULnI RT @ourangelrafael: @luansantana AQUI MEU BEBEEE https://t.co/OPx03sjYnp RT @dayaanandals: Ouvindo pelo YoutubeMusic pela centésima vez hoje 😍✨🎤 @luansantana  @luansantana @luansantana #QuandoABadBater https://t.… nao vejo os printss @perolas_santana gosto neee @MierezVitoria eu tb bb tamo no top 50 e quero ver subir amanha uiaaaa ahhh eu to ouvindo aki ó https://t.co/kykSDajhcn @SpotifyBR RT @thebestluanj0: @luansantana tá vendo só??? https://t.co/FcBX9s3jp5 RT @princessdolr: @luansantana Aqui meu amor 💗💗💗 https://t.co/obgRwk3Pb5 ta, entao todo mundo abrindo agora o app ai e prints pra eu ve ouvindo ces prometem q vao ouvir? galeraaaaaaaaaaaa linda bora ouvir mto #quandoabadbater nos apps! Assista agora Luan no palco do Villa Mix ao vivo https://t.co/Wch2Cnfz4g #LuanSantanaNoMultishow Chegando a 5 milhões de views no @YouTubeBrasil em 48 horas! Vem dar play e compartilhar com os amigos!! https://t.co/rwTRNpR5Af #QuandoABadBater https://t.co/O1IqY0LmC7 RT @multishow: A partir das 17h30 tem ele, @luansantana, pra abrir a transmissão do #VillaMixNoMultishow 😎 Em 2018, ele foi o artista mais… https://t.co/G0J0sjQop9 @CNAoficial https://t.co/6fXG2lOsGt RT @UOLEntrete: Quando a Bad Bater: Luan Santana lança primeira música e clipe do novo DVD https://t.co/vrcmpH0GBa RT @gshow: .@luansantana lança 'Quando a Bad Bater' e comemora: 'É uma composição só minha' ➡️ https://t.co/6QD6G5kjHN  #GshowFamosos #Vide… RT @Tidal_Brasil: . @LuanSantana lançou a música “Quando a bad bater”, que é perfeita para escutar naqueles momentos! #LuanSantana https://… Diaaaaaa! Para começar bem o sabadão!! Tem “Quando a Bad Bater” na @AppleMusic Bora ouvir? 🔥 https://t.co/GiMqa4Z1wo #QuandoABadBater https://t.co/ZTYRW9yWez RT @metropolitanafm: Luan Santana divulga primeiro hit do novo DVD “Viva”: “Quando a Bad Bater” https://t.co/Nd77AuemeU #VideoQuandoABadBat… RT @correio24horas: Luan Santana (@luansantana) lança clipe de Quando a Bad Bater, gravado em Salvador; assista https://t.co/FgSQU2PuJG\n\nSi… Hoje tem estreia de “Quando a Bad Bater” no TVZ do @multishow #VideoQuandoABadBater a partir das 19h https://t.co/cCIHSd7fCM RT @luandaily: Atualização do @luansantana via Instagram Stories. https://t.co/3rAdlfMLS0 RT @raffahvitoria: EU N TO SABENDO O Q FAZER @luansantana https://t.co/Qr8I5E5VAM RT @maisa: AAAA https://t.co/iEeeLQNOTg @luansantana RT @HugoGloss: Exclusivo: @LuanSantana tá mais solto do que nunca no clipe do HINO 'Quando a Bad Bater', primeiro single de novo DVD; vem a… AGORA!!!! Vídeo de \"Quando a Bad Bater\" já disponível no Youtube! Feliz demais em poder compartilhar a primeira faixa desse trabalho que sem dúvida foi o melhor e maior da minha vida!! Comente, compartilhe com os amigos... cante, dance... #Viva https://t.co/rwTRNpR5Af Contagem regressivaaaaa! #VideoQuandoABadBater Vem 12h! https://t.co/UgjFCQOw3I agora tô na contagem regressiva é pro vídeoo no @YouTubeBrasil ! aaai ai ai ai ai! Enquanto isso, tô aki no @youtubemusic ouvindo dmaaais! https://t.co/UNEKG6RDRM #VideoQuandoABadBater https://t.co/mrj6O572Nd RT @MomentsBrasil: ⚡ O @luansantana lançou o hino #QuandoABadBater — e protegeu a sexta-feira da bad! Vem saber mais: https://t.co/vm9tAraE… RT @pedrohosken: #QuandoABadBater HIT! Essa vai tocar muito @luansantana RT @itperroni: gostei da nova musica do luan santana, muito viciante RT @manudbatista: LUAN SANTANA VOCE QUER O MUNDO? EU TE DOOOOOOOU\n\nLEMBRA DA GENTE NO SEU QUARTO NO BREU DE BAIXO DO SEU EDREDOOM RT @beafigueiraa: luan santana só sabe fazer hit né #QuandoABadBater RT @cclaramiranda_: luan santana sempre perfeito em tudo que faz quando a bad bater chegou pra bater mesmo 😵 RT @Matheuspiment2: Eu já falei que o Luan Santana não erra??? Vou falar de novo kkk LUAN SANTANA NÃO ERRA RT @mmariiannesr: Luan Santana merece o mundo com esse dvd, estrutura de show, musica, tudo, maravilhoso,  #QuandoABadBater é hit, sucesso… RT @bmcstr: pra mim o Luan Santana merece o mundo, vcs viram a estrutura do palco do dvd desse cara? simplesmente impecável, mais um sucess… RT @rrobertamo: aí namoral a nova música do Luan santana é tudo pra mim de verdade mesmo mto boa sai fora parabens RT @dantedeasasls: @luansantana TA LINDO!!!! #QuandoABadBater RT @luanS_tudo: Nossa, imagina o surto que vai ser quando sair o DVD inteiro?????????? MEU DEUS QUERO NEM PENSAR! Mentira quero sim e quero… RT @helopes__: Não sou fã do Luan Santana mas mano, que show do caralho RT @tantofazlr: A MUSICA LANÇOU EM POUCAS HORAS E JÁ TEM BASTANTE ELOGIOS! QUE ORGULHO DO MEU MENINO #QuandoABadBater RT @ourangelrafael: enalteçam muito essa música, ela e o luan merecem #QuandoABadBater E tá em #1 na Playlist no @HugoGloss tbbbbb! 🙃🔥 Boraaa ouvir! https://t.co/3Wj7vHHJ3U https://t.co/yzCCPj54Il Boraaaa ouvir muitooo na “Potência Sertaneja” https://t.co/RHxK6dR8sI @SpotifyBR #QuandoABadBater https://t.co/0Vg2q9f8nO 🔥 Saiuuuuuu!!! Ouça agora no seu app favorito “Quando a Bad Bater”, primeiro single do meu novo DVD #Viva!!! Tá demaaaaais!!! Bora cantar muuuuuito. Às 12h tem vídeo no Youtube. #QuandoABadBater  https://t.co/kykSDajhcn https://t.co/5Et2nLabUq Vem #QuandoABadBater 10 minutos!!! #QuandoABadBater faltam 2 horas!! https://t.co/mA47wzGIrn #QuandoABadBater Já já, às 00h. https://t.co/k5tcXvw4O8 Galeraaaaaaa hoje tem o 5º episódio do #ProximoN1, o maior Reality Show de Sertanejo do Brasil. Desta vez o convidado é @marcosaudiomix pra escolher um finalista. Tá demaaais! É a partir das 21h, no https://t.co/VfyDZEerh8 https://t.co/EFDNn38Il7 RT @t4f: VENDAS ABERTAS!\n\n@luansantana estreia a nova turnê “VIVA” no Km de Vantagens Hall, no Rio de Janeiro. Bora lá, cariocas!\n\nKm de Va… Já fez seu PRE SAVE de #QuandoABadBater? Ouça assim que sair!! Cadastre-se agora!!! https://t.co/kmJCtQSSYN @SpotifyBR Dia 28 em todos apps de música às 00h! https://t.co/1bluGIrkjw 🚨🚨🚨 Tô muito felizzzz!! Assista o TEASER do primeiro vídeo do DVD #Viva! #QuandoABadBater é uma composição só minha minha e minha, imaginem o quanto tô agradecido por ser ela!! Espero que curtam muuuuito! Como? faça agora o PRE SAVE https://t.co/kmJCtQSSYN https://t.co/SgtbpKMRzF faltam 3 horaaaaaas para o teaser #QuandoABadBaterDia28 vou deixar um aviso e sair correndo! “semana que vem, vamos com tudo”. mas pra começar... não saiam do meu instagram HOJE às 20H! #Viva RT @XandAviao: Já está no ar o episódio 4 do reality \"Próximo N°1\" do @villamix e da @BrahmaCerveja, de que eu participei,  no @YouTubeBras… Agoraaa!! Assista o quarto episódio do #proximoN1 https://t.co/Jr9BQNiIvW Eitaaa que hoje tem o 4º episódio do #ProximoN1 @brahmacerveja, o maior Reality Show de Sertanejo do Brasil. Desta vez o convidado é o @XandAviao! Não vai perder que tá demais. É a partir das 21h, no https://t.co/VfyDZEerh8 https://t.co/vuVBO0I4Fh Vem assistir https://t.co/XSHCBP6TEQ #ProximoN1 Boraaaaaaa #ProximoN1 RT @jorgeemateus: Chegou o dia! Hoje é a nossa vez de comandar o #ProximoN1 com @luansantana. Começa às 21h no https://t.co/nrQnHJ76d4. Pre… Fala galeraaaaa, hoje tem o 3º episódio do #ProximoN1, o maior Reality Show de Sertanejo do Brasil. Desta vez os meus convidados serão meus amigoss @Jorgeemateus. Não vai perder que tá bom demais. É  partir das 21h, no https://t.co/VfyDZEerh8 https://t.co/Bx3TNIpr8x RT @governodabahia: Ao todo, os alimentos serão distribuídos para 45 creches e 13 abrigos de Salvador: https://t.co/xmXCgH3K4C #Voluntárias… ♥️🙏🏼 #Viva https://t.co/F9cvasVrmx RT @CentralDeFasLS: Temos uma data para o lançamento do DVD VIVA? Ahhhhhhhh que o @HugoGloss deu uma dicaaaa forte e quente! https://t.co/1s3mpgT3Nv amo vcs, melhores do mundo ♥️ eu amo vcs e td o mundo sabe disso mas nao custa nd repetir, entao... @nfoiporacasols viu soh? kkk @thau_ambrosio tb achoooooooo #ProximoN1 @lsmeuinfinito num fala assim bb @certezamor @BrahmaCerveja kkkkkkkkkkkk @princessdolr t amooo @princessdolr cmg agora ♥️ pode liberar o ep3 @BrahmaCerveja #ProximoN1 kkkk cabooooooooo #ProximoN1 @Princesadolua11 to falandu em um monte de lugar bb, me perdoa #ProximoN1 kkkkkk marroneeee #ProximoN1 RT @BrahmaCerveja: @admiroluan @luansantana É perfeita essa risada! #ProximoN1 https://t.co/0rMcj5Cjtl @yourmendws @BrahmaCerveja to c fome bb #ProximoN1 to aki e to no youtube kkk perae #ProximoN1 ceis para q to mto digital #ProximoN1 https://t.co/l6svJzvsxq achei chique esse treco vermelho do lado da hashtag #ProximoN1 eh um microfonin? marquei o twitter certo? kkkkk #ProximoN1 esses @BrunoeMarrone_ sao giganteeeee, sou fã dmaisss  #ProximoN1 sou mto bom apresentador neh, @BrahmaCerveja? me contrata pra um reality? kkkk #ProximoN1 agoraaaaa simmmmm #ProximoN1 dificil conexao aki pra ver #ProximoN1 peraee #ProximoN1 to na van indo pro show ja to venduuuuuuuu ao vivo https://t.co/FhumkhGRFr #ProximoN1 RT @BrahmaCerveja: O segundo episódio do maior reality show de sertanejo do Brasil vai ao ar hoje às 21h, no canal do VillaMix do Youtube.… ó quem vai tah de oio no #ProximoN1 hj junto c vcs aki no twitter e no youtube 21h. pegaa esse luan digital vortano com forçaaa kkk @BrahmaCerveja https://t.co/q6JoQ7mexu Pra ficar ligado no que vai acontecer esse fim de semana!! Se liga na agenda e vê se não perde de me ver aí perto da sua cidade #AgendaLS #LuanSantana https://t.co/ru9wy1OrJz Uma This Is dessa... dá para perder não! https://t.co/kykSDaAS3V @SpotifyBR https://t.co/2ER5mUQw9e #VIVA @fcvidasdoluan viu meu peixao? kkkk @lsalemdavidafc kkkkk ❤️ t amo p a r a b e n s https://t.co/QI0hNp3u4R @teuamorls_ o acucar q tem eh soh o meu amôoooo @teuamorls_ e se eu t contar q agua acabouuu? eu toooo dmaaais podem falar, eu guento... tao nd falem a verdade, tao c saudade? ooooooooooooooooooooooooooooooooooooooi um oi nao faz mal a ng neh? RT @CentralDeFasLS: Link de novo, pq tô aqui para divulgar e enaltecer https://t.co/2IBnDtHvtn #ProximoN1 RT @BrahmaCerveja: @lrdsanjomeu @mypromiseluan @PlanetaSantana @AnjoQuerubimLS @fascinadasdolu_ @projetolsbr @CentralDeFasLS @newsls @amotu… RT @purposedluan: chorei junto #ProximoN1 https://t.co/Z7nxWqbjJ2 RT @bebezonadoluan: O LUAN CHORANDO AAAAAAAAAAA #ProximoN1 RT @BrahmaCerveja: @itimalialuans @mypromiseluan @PlanetaSantana @AnjoQuerubimLS @fascinadasdolu_ @projetolsbr @CentralDeFasLS @newsls @amo… Assista agora!! #ProximoN1 https://t.co/kJoVRrxERQ RT @BrahmaCerveja: É hoje! O primeiro episódio do maior reality show de sertanejo do Brasil vai ao ar hoje às 21h, no canal do VillaMix no… Amanhã estreia meu episódio no #PróximoN1 Já tô aqui ansioso demais! Até coloquei esse reminder pra vocês lembrarem do programa também. Agora me diz uma coisa, quem você acha que vai gravar um\nclipe comigo? https://t.co/TlrIwSirVF RT @fadasertaneja: ARTISTA DE VERDADE!\nEm parceria com VSBA o cantor arrecadou cerca de 10 toneladas de alimentos não perecíveis das pessoa… Notícias DVD Viva #LuanViva @VogueBRoficial https://t.co/FDLbfTIJDm Já conferiu o último episódio da série \"Bastidores de um DVD\" no IGTV do Luan? Então Corre! Tá lindo demais! https://t.co/xvn4pelaPJ #LuanViva #ViralizeOAmor #VoceSeraContagiado - ELS RT @folha: Luan Santana grava novo DVD durante megashow em Salvador: 'O melhor que o Brasil já viu' https://t.co/v9TwYggmK7 Vivi um sonho? O sexto e último episódio da série “Bastidores de um DVD” vai ao ar hoje!! A realização desses duros meses de trabalho. Foi demais! Não percam! #SerieLuanIGTV https://t.co/qpkUFm40Zw RT @natalykellle: pqp, tava vendo os vídeos da gravação do dvd do luan santana e to SEM PALAVRAS RT @enzosaito_: o que foi esse dvd do luan santana, sensacional demais RT @todateen: DVD do Luan Santana: maior show de sua carreira com palco de 100 metros de largura e muito amor envolvido https://t.co/vOPFAa… RT @HoraPopTV: Gravação milionário do novo DVD do Luan Santana impressionou e contou com uma enorme estrutura!\n\nO toque especial foi o loca… RT @BrunoRisson: O Luan Santana, pra gravação do dvd novo dele, fez uma estrutura de palco maior e mais foda do que qualquer festival de mú… RT @daviddukki: A gravação do novo DVD de Luan Santana neste domingo 19/05 no Parque de Exposições em Salvador, entrou para a história como… RT @DiarioPE: Luan Santana grava DVD em Salvador com mais de 20 mil pessoas. O evento também contou com a presença de artistas como Padre F… RT @POPline: Fãs de todo o Brasil vão para a Bahia acompanhar o registro do novo audiovisual do cantor @LuanSantana. Temos fotos, vídeos e… Notícias DVD Viva #LuanViva https://t.co/63zCByxGPG Notícias DVD Viva #LuanViva https://t.co/dm23VQddrF @quemacontece Notícas DVD Viva #LuanViva  https://t.co/zPUsdxVAl1 @gshow RT @metropolitanafm: Luan Santana revela que perdeu 8kg antes de gravação do DVD “Viva” https://t.co/L5e3PTuOk9 https://t.co/K6i4Crej6Z RT @portalmscbr: Luan Santana... Como é que eu posso começar a explicar Luan Santana e o grande show que ele fez na gravação de ''Viva'', s… RT @caldeiraodohuck: .@luansantana foi só um dos artistas que fez aquela surpresa no nosso #Caldeirão! Reveja fãs que se surpreenderam ao e… RT @maisa: Como eu to/ como eu queria star https://t.co/33jbcjQueH Gente, obrigada todos que acompanharam minha cobertura, esse fim de semana vivi um sonho, que é realidade! Obrigada @CentralDeFasLS pela oportunidade! O Dvd será um sucesso absoluto, o brasil foi contagiado. Até a próxima, se Deus quiser ❤️🙏🏽🌀\n\n-Mari Félix MOÇA CHIQUEEEEEEE #LuanViva M.F “To chegando, to levando, flores, amor e pudim” trecho da música nova #LuanViva M.F ❤️😍 #LuanViva M.F https://t.co/U08Q022HJs Musicas novaaaas #LuanViva M.F Quem ta feliz joga a mão 🙌🏽🙌🏽🙌🏽 #LuanViva M.F https://t.co/5UlvXKUogG Agora é só voz e violão #LuanViva M.F É O BRASIL INTEIRO JUNTO!! O BRASIL INTEIRO CONTAGIADO JUNTO #LuanViva M.F EU TO AI... Mesmo sem estar #LuanViva M.F Tamo chorando mtoooo! A equipe todaaaa! #LuanViva Que coisa lindaaa! Ai meu Deiwbrnwibahrkqjabd nervousa @CentralDeFasLS #LuanViva https://t.co/nu1z33fng5 VAI COMEÇAR #LuanViva M.F 😱😱😱😱😱😱😱 Ganhadores das promoções prontos ❤️🌹🌀 #LuanViva M.F https://t.co/LZ7Cz6CiHF RT @anjodeamorls: pra quem falou que ele não ia durar nenhum ano, tá gravando mais um dvd da sua carreira e que com cereja vai ser o dvd hi… RT @modorafa: @luansantana +1 PQ HOJE EU TO GATINHA #LuanViva https://t.co/16efWoP6HF Bora usar esse filtro e esses gifs aí galera!  #LuanViva Postem as fotchenhas!! @centraldefasls Eu e as fãs estamos a caminho... prontos para viralizarmos o amor #LuanViva M.F Faltou só a tag! #LuanViva https://t.co/vaSAeH7ded RT @maviivii: @luansantana #euvouviva https://t.co/ahkNfBpmRz RT @dayanefatima13: @luansantana Queria te aí 😢 RT @luandaily: @luansantana #luanviva https://t.co/kP1Aq9lfPd RT @dantedeasasls: @luansantana TO AQUIII #LuanViva https://t.co/BsyJjLylcJ Quem já está aqui, posta fotooo já!!!! #LuanViva Chegamos!!! #LuanViva @CentralDeFasLS https://t.co/9EprEpaYj2 Indo pro local do show!! #LuanVIVA Vamos espalhar o amor? Bora usar a hashtag #LuanViva e compartilhar o que está VIVENDO em Salvador nessa gravação de DVD linda do Luan! a Galera que está acompanhando por aqui é a forma de se sentir mais perto!! Viva! @_sunflower_01 @CentralDeFasLS Às 14h! mudou! Olá!! @CentralDeFasLS aqui!! Bora levantar uma hashtag para agitar esse tweet durante a gravação? Ps. Continua sendo 17h EM PONTO o início, mas a divulgação seguiremos com 16h30 para termos todos pontualmente conosco sem atrasos! 🌀 ATENÇÃO! Horários do DVD Viva em Salvador. Abertura dos Portões: 14h / Início da gravação: 16h30. RT neste tweet para divulgar. Avise os amigos! #DVDLuan #ViralizeOAmor 🌹🌀 Não se esqueçam de usar as hashtags #ViralizeoAmor #LuanViva 🌹🌀 Hoje o sonho se torna realidade, dia de #ViralizaroAmor e fazer Salvador tremer!! 🌹🌀 todos contagiados, o grande dia chegou! M.F Fim do ensaio e da invasão de hoje.. sem sombra de duvidas o dvd do milênio, estrutura impecável, músicas perfeitas! Parabéns Luan!! Parabéns Equipe. ❤️ M.F https://t.co/IITfqr1Cr1 RT @VoeGOLatende: @luansantana Luan, é um prazer poder fazer parte desse momento tão importante pra você e seus fãs! Transportar pessoas pa… RT @POPline: Estamos no ensaio do DVD do @luansantana que rola amanhã em Salvador e estamos impresionados com a estrtura! Estamos mostrando… RT @gshow: Fotos exclusivsa! @Luansantana faz ensaio geral para gravação do novo DVD em Salvador\nhttps://t.co/1ETB7RfDsJ https://t.co/LQbtX… Amanhã! #VoceSeraContagiado 🌀 #ViralizeOamor 🌹 https://t.co/Ktz51DO4pb Prontos para o ensaio 🌀 M.F https://t.co/aKZS12eAeP Kit de boas vindas que recebemos no hotel M.F #ViralizeOAmor 🌹 https://t.co/mdh9gZEjP6 Que recepção perfeita dos fãs aqui na bahia para a galera da @CentralDeFasLS ❤️❤️❤️❤️🌀🌀🌀🥳🥳🥳🥳 M.F #VoceSeraContagiado https://t.co/ou7FluPxuU O que os passageiros ganharam no voo da @VoeGOLoficial especial do DVD com convidados! SALVADOR TODO CONTAGIADO 🌀🌀 M.F https://t.co/PXaHRDjycr Decolando.. Deixa o gelo da Europa para outro dia, prefiro seu calor da Bahia 🌀 MF Fãs que vão no mesmo voo.. alguém tem duvidas da bagunça que será até salvador? ✈️🌀 M.F #VoceSeraContagiado https://t.co/S6jIWuCIEy Por enquanto estamos no aeroporto esperando para decolarmos... hoje O MUNDO DESEMBARCA EM SALVADOR ❤️ M.F #VoceSeraContagiado 🌀 O sonho começa agora, fui convidada pela @CentralDeFasLS para fazer a cobertura do DVD, durante as próximas 48 horas eu, a fã @Marianaa_Felix, que vou comandar o twitter contando tuuudo o que vai acontecer 🌀✈️🤪🥳 M.F 2 Dias! #VoceSeraContagiado 🌀 https://t.co/yYf7XUtCJB https://t.co/GDskFPQMZx Faltam 3 Dias #ViralizeOAmor 🌹 https://t.co/dFrF4I0uW0 #SerieLuanIGTV Hoje! Episódio 5 #SerieLuanIGTV “Bastidores de um DVD” https://t.co/Ctdp0Ng4Y0 RT @POPline: Para este projeto, @luansantana e sua equipe estão há mais de seis meses no processo que propõe ao público resgatar o afeto pe… RT @g1poparte: Luan Santana transita entre o romantismo 'água com açúcar' e a sofrência com 'pulsação' no repertório  do... https://t.co/Ib… RT @metropolitanafm: Luan Santana libera versão demo das músicas inéditas de seu novo DVD https://t.co/dXMFe4bcoB https://t.co/czmUuZCnv2 RT @piatafm: Luan é uma caixinha de surpresas, não é?🥰 Você já viu a série que ele está fazendo no seu IGTV do perfil no Instagram? Não?😱 E… RT @POPline: .@LuanSantana vem liberando \"guias\" de músicas inéditas na Internet. São versões demo de estúdio das canções que ele escolheu… RT @POPline: Inclusão social: @LuanSantana quer que todos aprendem a letra de suas músicas novas e está ensinando-a com língua de sinais. V… #SerieLuanIGTV | Episódio 4. Hoje, às 19h. A ansiedade dias antes do DVD e a liberação das guias para o público. https://t.co/6U0p79uj9Z RT @showdavida: Daqui a pouco, no Instagram do @showdavida, vai ter live com @luansantana para anunciar a sexta fã que vai acompanhar a gra… RT @MuriloSalviano: Em breve no @showdavida uma investigação sobre o cérebro dos fãs! Imperdível! https://t.co/W4O5L7ec3e Mais 2 novas guias às 12h! #NovasGuiasDVDLuan  na @radioluan e podcast atualizado no @SpotifyBR RT @breaktudoawards: Olá @LuanSantana , estamos com o seu troféu de Artista Masculino Nacional do #BreakTudoAwards 2018 😍 #LuanSantana http… RT @MuriloSalviano: O @showdavida tá investigando o cérebro dos fãs. O que faz você ser tão alucinado por alguém? Já conversei com fãs do @… Amanhã! Mais 2 #GuiaDVDLuan Às 12h. https://t.co/ho5SH1KhvO RT @habibsoficial: Bib’sfiha R$ 1,98 em Dobro. Na promoção cada uma sai R$ 0,99. Seg a Qua – Carne; Qui a Sex – Calabresa com Mussarela; Sá… Ouça agora as GUIAS com meus comentários FAIXA A FAIXA no @spotifybrasil em um Podcast exclusivo! E calmaaa! Em breve vem mais guias por aí, até o DVD muita coisa vai rolar! Ouça o Podcast: https://t.co/rh0UfAdkZ0 #GuiasDVDLuan https://t.co/C5qjoAiUpR Bora conferir no Facebook a live! https://t.co/w1wbyY3ihS #GuiasDVDLuan Quem está ansioso aí? #GuiasDVDLuan @radioluan https://t.co/qOT4N0uMan Invadindo!! A partir das 18h, ao vivo no App @radioluan, ouça as #GuiasDVDLuan em primeira mão!! E um podcast exclusivo no @SpotifyBR. Vamos acompanhar tudo aqui!! - Equipe LS Hoje!! A partir das 18h! #GuiasDVDLuan na @radioluan. E Podcast no @SpotifyBR. Já já!! Chama todo mundo para ficar ligado! https://t.co/KHF5j42LI4 https://t.co/NQZbHAGmqO #SerieLuanIGTV Episódio 3! Vocês vão conhecer um pouco da história de fãs que estão saindo desse Brasil enorme para Salvador dia 19! Tá lindo demais! Às 19h, hoje, no IGTV. #SerieLuanIGTV https://t.co/fHDHfjDn1w “APRENDA A CANTAR ESSA MÚSICA PARA PARTICIPAR DO DVD!” Estavam com saudade de ouvir isso? Eu tava demais!!! 🔥🔥🔥🔥 Dia 02/05 na @radioluan e podcast com faixa a faixa no @SpotifyBR! https://t.co/pk2HJJpSbq https://t.co/o1FI1tJGSM 💥🙏🏼👊🏼 https://t.co/dO8eaGxts7 Episódio 2 #SerieLuanIGTV  https://t.co/aRRBP5fHV6 #SerieLuanIGTV Como nasce um palco? Uma ideia? As composições? Episódio 2. “Bastidores de um DVD”, hoje, às 19h, no IGTV. #SerieLuanIGTV https://t.co/gxeINjtSBq RT @habibsoficial: Só até 07/05 pra participar da promoção, seja rápido! https://t.co/Q2rwMdrh19\n#SedeDeLuan https://t.co/il0RchzTmH Quer mostrar o seu talento e ainda ganhar prêmios? Mande seu vídeo para o Concurso Embaixadores do @CNAoficial ! Acesse o site https://t.co/GUxKsuD6hX, saiba mais e não deixe de participar. #CNADáVontadeDeAprender https://t.co/vtPe2ojycn RT @Tatawerneck: https://t.co/4vawpOmkOU RT @imperiocuiabano: Felizmente sou uma fã orgulhosa, sou fã da melhor pessoa, de um coração e essência de outro mundo, fã desse cara que n… RT @mideliriols: \"eu considero que existem diferenças tipos de artistas: o animador de festa, o cantor e a estrela. eu luto pra ser uma est… RT @oneloveluan: Nem o sol consegue brilhar mais que você, minha estrela preferida ❤️ @luansantana  #SerieLuanIGTV https://t.co/k5VNKsUlm0 Falta 1 hora! #SerieLuanIGTV #SerieLuanIGTV “Bastidores de um DVD” Episódio 1, hoje, às 19h, no IGTV #SerieLuanIGTV https://t.co/vtug8FOOQi RT @HugoGloss: Novidade! Nosso príncipe @luansantana estreia nesta quarta-feira (17), uma série lá no Instagram, no IGTV! Produzida em parc… VIVA! To no estúdio oh https://t.co/UbceOS2kqa @totosasdols S A B A D O S @idntidadearaujo pq? @chuvadeluan jura? e agora? 😳 @reboladaluanr to trabalhando mto bb @defenseluanjo own vai melhora @pedidoluan t amooo bbuagduabsyazona @lmjluan T amo ♥️ @fcevls1 cmg, t amo @cometaluan kkk vc quer qual? @mypromiseluan vooo @larissaq9 t amo @goianasdoluanr amoooo @abiancaanjos oi amô @Unicorniodorafa to presença @LoamIsTheBest @amanda_eleuteri num sei ainda mas to me achando gato @ApegoLuanzinho kkk sumiu todinha @Jessslla falo bbzona, c ta bem? @razaopraviverls vamo la @andressa_bffba kkkkkkkkkk @amanda_eleuteri to bem e vc? @encantoluanj0 to tb @sweetsantanaa to aki td bem? @tagsdoamor oi bb quem ta com saudade dessa cara pelada aki? kkkk O PRÓXIMO Nº1 VILLAMIX é o maior reality de sertanejo do Brasil. E eu tô atrás da próxima estrela! Vou contar com a ajuda de um time de peso! Tô louco pra ouvir as versões dos meus hits😍 Inscrições até 11/04. https://t.co/vCOjXXzyhE Beba com moderação. #proximon1 @BrahmaCerveja https://t.co/xUAxmTKAMh Quanto mais copos, mais chances de curtir a Gravação do DVD. Corre, vai?! https://t.co/Kra7RAdc7l @habibsoficial #SedeDeLuan 🧞‍♂️ https://t.co/r5569325aT Quer ir para a gravação do meu DVD em Salvador/BA? O @habibsoficial te leva! Corre para o site e participe! https://t.co/Kra7RAdc7l ..aaaah, quanto mais copos, mais chances de ganhar! https://t.co/zWU1gW4XIb Hoje!! Às 18h. Baixe agora no seu celular! #RadioLuan https://t.co/fNDPoVBbhg RT @jequiti: Hoje o dia é dele! Do dono dos perfumes que são um show! Parabéns, querido Luan! Que todos os seus sonhos se realizem! Deixe a… RT @letras: Curiosidade: @luansantana é o artista mais acessado da história do Letras.\nParabéns pro reizinho do sertanejo e do Brasil! 💜👑\n#… RT @FamousBirthdays: @luansantana Hope you have a great birthday! Happy Birthday! RT @mcountry: Hoje é aniversário do @luansantana 😍 Participe do nosso Quiz, teste seu conhecimento e concorra à um kit exclusivo com caneca… RT @eonlinebrasil: Parabéns Luanzinho! Nosso muso! @luansantana! https://t.co/pz6KTu3RtX RT @eonlinebrasil: Qual @LuanSantana você levaria para o sofazinho? #ParabénsLuan Quantos likes e mensagens de amor esse aniversariante merece? ♥️🎂 #LuanFaz28 https://t.co/037cPXgG9f 👀 #RadioLuan https://t.co/OEFtuWnjZ0 🔥🔥🔥 Vingança e seus 200 milhões de views!! Obrigado por cada visualização, obrigado @mckekel_ . É nosso! Bora aumentar esse contadoooor! https://t.co/gexNh4DdD6 🚧 https://t.co/Ptu2PDVKBp to saindo, mas antes, uma foto sobre maturidade com filtros e a volta do luan digital https://t.co/EbmhHHI8q7 e o qt sao importantes pra mim, mto mais do que imaginam so queria dizer q passar uns dias longe dos palcos de férias só me faz pensar em como nao vivo mais sem o amor que recebo de vcs @mysticfallstao @teprometolr kkk tava pensando em meteorooo kkk t amo ♥️ https://t.co/PylM5YvjYE RT @vishluaanjo: @luansantana 💖💖💖💖💖💖💖\n💖💖💖💖💖💖💖\n💖💖                         \n💖💖                           \n💖💖                         \n💖💖… @becauseofls acordei agora e o seu como q ta? @papeisproluan to ako bb, como c ta? e ouvindo vingança 😏 to aki seguindo vcs povoo @opsgurizinhols eh hjjj @ourangelrafael to lendo td bb @afrontosadols kkkkkkkkkkkkk @Leticia19708 pois naoooo @meu_negosantana te amoooooo, agora! ♥️ @meu_negosantana isso eh o nome de uma musica? @teprometolr de luan @luanmeuA fala comigo @stayluanrds kkkk to aki @meuluanjjo euu e vc da minha meu pai me ligou kkk perae @FcforloveLS vamo mata agoraaa essa saudadee @esdoluan parabens meu amoooor 😍 @wayluanj0 to bem bb e vc? ces tao com saudade d mim? fala a verdade @meucrushluan aaaaaa quem ta com a saudadee do tamanho q eu to? ☝🏼👀 oi oi oi oi oi oi Uhuuu! #MeuHitDoCarnaval é “Vingança”! E o seu? Hoje tem Blitz Nacional nas rádios!! Já pediu na sua preferida? 🚧 https://t.co/0ZqMnZ2Us8 Menos de 90 dias! Vem Salvador! Meu novo DVD está chegando e você não pode ficar de fora. Os ingressos já estão à venda. Garanta o seu https://t.co/Fvx1OoffEt #VoceSeraContagiado 🌀 https://t.co/gtlMT5vDNv RT @Lizi_Marins: Meu irmão é surdo e ficou todo feliz pelo vídeo ter legenda e ele conseguir entender a música, essas coisas não tem preço… Não perca a chance de se matricular no @cnaoficial hein? https://t.co/0bWBHR2eja ⚡️ “Luan Santana lança vídeo exclusivo de \"A\", Ao vivo.” #AAoVivo \n\nhttps://t.co/SptqWG2a3C https://t.co/QIoTm6Iwp1 Saiu!🔥🔥🔥Trilha para um Valentine’s Day!  Meu xodó “A”, ganhou essa versão linda Ao Vivo! Quero muito que aproveitem essa música que tenho um carinho especial. Esse lançamento é exclusivo em vídeo e já está disponível no Youtube! #AAoVivo #LiveMovel 🚧 https://t.co/h5tfxR423C #AAoVivo, hoje às 18h, no Youtube 🚧 https://t.co/eqDc5ajVpe Amanhã, 14/02, vou disponibilizar uma nova versão de “A” no meu canal do Youtube. Dessa vez, ao vivo, durante o lançamento da #TurneLiveMovelX no Espaço das Américas. Anotem aí! Às 18h no https://t.co/0h1YblKy9b 🚧🚧 #A https://t.co/NvfNch0kyb São Paulo! Vocês terão a chance de ter um \"gostinho\" do que virá em Salvador! É isso mesmo. Um AQUECIMENTO para o Novo DVD no @espacodasamericas, há exatos dois dias antes da gravação. Será que vou abrir para turma algumas músicas novas pra galera decorar? #AquecimentoNovoDVDLS https://t.co/iKyrL3dGFi Quem aí tá pronto pro Top 5 do TIM PRÉ TOP? Internet ilimitada para Facebook, Whatsapp, Messenger e Twitter. Você vai ficar TOP demais! #TIMPRETOP https://t.co/OTz6mz2J1g 100 dias!!! O relógio no site conta os segundos... e eu, ansioso por esse dia que será memorável! Quem vem comigo? #VoceSeraContagiado 🌀 Gravação do meu novo DVD dia 19/05 em Salvador BA! Ingressos: https://t.co/yYf7XUtCJB https://t.co/RmE36AbM3R Se você sonha em cursar uma universidade e garantir um futuro no mercado de trabalho, a dica é essa: Unimes Virtual! São mais de 50 cursos reconhecidos pelo MEC que cabem no seu bolso.  Desconto de 54% na primeira mensalidade para você se inscrever https://t.co/uxdqITj5s0 🤓 https://t.co/p0P8DOiHDM https://t.co/KVet9il2x3 Mais uma promoção do @cnaoficial,  galera! A partir de hoje, dia 01/02, até 28/02 quem se matricular no  CNA ganha uma toalha de praia linda pra curtir esse verão. Arrasta aí  pro lado pra ver como ela é lindona 👉🏼 #CNADáVontadeDeAprender https://t.co/ztVIlhf9D3 Prêmio @tocontigo já está na reta final e você pode votar agora mesmo na categoria “Melhor Cantor”. Cada pessoa pode dar 1 voto por dia. Bora dar o seu? https://t.co/ptL7ag2qbn  - EquipeLS https://t.co/lyXqX27fEB #tbt pq hoje é dia! https://t.co/Xvk3D0CZkU RT @habibsoficial: 🎁💆‍♂️👁💏🥤 #SedeDeLuan 🌃🛌🍯🥤 #SedeDeLuan Galera! Não deixe de participar do nosso bot no Chatclub! De hoje, até o dia 27, todos assinantes vão receber fotos exclusivas do Teaser do DVD no messenger! No chatclub, você recebe novidades em primeira mão e muito mais! Entre agora, é grátis! 👉🏼 https://t.co/gSLzlwKIiA https://t.co/VVMYuRWHWh A Batalha de TBT voltou no Instagram! “Esqueci de Te Esquecer” X “Surreal”. Quem leva? O resultado é Quinta com Luan cantando em voz e violão no feed. Corra no story e vote na sua preferida! - EquipeLS esperando a promoção de DVD na @CentralDeFasLS https://t.co/kCrVlS7vcv Vendo todo mundo comprar o ingresso do DVD e vc ficando de fora  #VOCESERACONTAGIADO https://t.co/ThDX0cWg5H @luanpotter @plenitudeluanjo kkkkk to saindu #VOCESERACONTAGIADO jah tooooo @tantoamorls @SonhoComLuanLS vamo fala, como foi seu dia bb? @luanpotter kkkkkkkkkkkkkkkkk @intosantana comigo logo, t amo @SonhoComLuanLS kkkkkk to aki ainda lero lero lero @ls_suavozacalma kkkkkk oiiiii @xnegola to akiiiiii @raridadeluans @escritorafs t amoooooooo bbzona @escritorafs kkkk boraaa RT @lsmeuinfinito: @luansantana VAMOS TODOS SER CONTAGIADOS @motivodetudols q coisa lindaaaa quero vcs comigo, eh o mais importante. o calor de vcs faz com que tudo seja lindo e perfeito. amor sem medida que soh a gente entende to preparando o meu melhor dvd! vai ser incriiiivel, to tao ansioso, tao feliz com tudo ganhando forma. vcs vaoo? oiiiiiiiiiiiiiiiiiii, tem alguem ae? #CNADáVontadeDeAprender @cnaoficial https://t.co/Nub0zWexPv Povooo bonito!! Hoje é sexta de plays e plays no @SpotifyBR. Bora ouvir #Vinganca e #Sofazinho muitooo nas playlists!! Vem de \"This Is Luan\", cheinha de sucessos! https://t.co/kykSDajhcn  - EquipeLS Já que é dia de #tbt https://t.co/2L4ZpvjvFE #10yearschallenge Quando tudo estava começando 🙌🏼 https://t.co/vv9QpTpcyk Já que estamos falando de récordes, vim parabenizar #Vingança por seus ovos, opa... views! https://t.co/gexNh4DdD6 140M!! https://t.co/lz1BPxsJUV #voceseracontagiado Novo DVD! Dia 19/05 em Salvador/BA. Infos: https://t.co/optm4EtIVE 🌀 https://t.co/Whp6pFejjJ Galera, o CNA está com uma superpromoção. A partir de hoje, quem se matricular no CNA ganha uma mochila exclusiva, são vários modelos. Só até 31/01. Ah e não esquece de conferir a nova campanha deles nas redes sociais: @CNAoficial #CNADáVontadeDeAprender https://t.co/Y1x43OrBHQ https://t.co/WcNWQasXS6 A partir de hoje, #Vingança nas rádios de todo o Brasil!! Peça agora na sua preferida. https://t.co/dUIWqohYLq Hoje tem comemoração aos 30 anos de Domingão do Faustão!! A partir das 17h45 na @redeglobo. Uma honra poder participar e fazer parte dessa história. https://t.co/7prYlybfLo Hoje tem Caldeirão de Ouro!! A partir das 16H na @redeglobo. Quer relembrar um pouco das passagens do Luan pelo programa? Confere agora no Gshow Entretenimento https://t.co/6cYzswS8Wy Como estão os preparativos? Por aqui, estou na contagem fazendo o balanço do ano! Só coisa boa e energia positiva para 2019!! Hoje tem #ShowDaVirada na @RedeGlobo a partir das 22H30 e você pode conferir os bastidores no @gshow https://t.co/7lVrGoRuBQ . Espero vocês mais tarde! https://t.co/JR5T5GPQjm RT @HugoGloss: Oxente! Em 2019, @LuanSantana vem com um novo DVD e eu revelo agora pra vocês onde esse bapho será gravado: Salvador!!! Que… #VOCESERACONTAGIADO 🌀 https://t.co/jm84wkYVwr RT @CentralDeFasLS: Opa ouçam na Esquenta tb! https://t.co/qZA6EAEnEO RT @CentralDeFasLS: Vou colocar os links aqui! Top Brasil:  https://t.co/Z3OCxUbyDY RT @CentralDeFasLS: Top 50: https://t.co/pQt6FGeywl RT @CentralDeFasLS: This Is Luan: https://t.co/8AQ6pK0Lrh Como tá o aquecimento do Natal aí? Enquanto essa noite especial não chega, uma dica! Minha Deezer Session ficou linda demais e vocês podem conferir a versão exclusiva da minha música \"Pra Você Lembrar de Mim\" lá na playlist \"Vem Pro Sertanejo\" https://t.co/x1XzFd4op9 @DeezerBR https://t.co/daWgUCX8fO RT @admiroluan: @luansantana https://t.co/ntLIHoZGwo 19 🌀 5 🌀 19 🌀 5 #VOCESERACONTAGIADO 🌀 https://t.co/VsnAFaMXNC “Vingança” nas principais playlists do @SpotifyBR ! Ouça agora na sua preferida! Em Janeiro, nas rádios do Brasil. https://t.co/kykSDajhcn #Vinganca @mckekel_   RT para compartilhar com a galera! https://t.co/UVwTm6X6DN RT @YouTubeBrasil: Vocês participaram e o @luansantana também. Os maiores sucessos do sertanejo estão na playlist AbraOMundoSertanejo no #Y… Galeraaa, anotem essa dica aee! Uma playlist com músicas indicadas por mim por uma galera massa. Cola no @youtubemusic @youtubebrasil pra conferir agora e #AbraOMundoSertanejo Bora! Acesse 👉🏼  https://t.co/ZumamjKbiM https://t.co/MiyvvVFcfW @havenluans 🌀 🌀 #VOCESERACONTAGIADO https://t.co/bJ8CmrRI0G #VOCESERACONTAGIADO 🌀 https://t.co/849NaSsLRX RT @ineed_youls: @luansantana https://t.co/1mQoJ7rVnx 05 1ª 19 @sentidosluan @YouTubeBrasil #AbraOMundoSertanejo eh memo? Galeraaaa, já indiquei minhas músicas e agora é a vez de vocêsss. Mandem suas sugestões pro @youtubebrasil com a hashtag #AbraOMundoSertanejo e seus sertanejos preferidos podem entrar na playlist do YouTube Music. Boraaa? https://t.co/mYmiPDT031 RT @portalmscbr: Finalmente temos a data de gravação do novo DVD de Luan Santana! Confira: https://t.co/H7lCMebfGK\n#VOCESERACONTAGIADO http… RT @gshow: 🅰🅰🅰🅰 😍 @LuanSantana anuncia data da gravação do novo DVD e faz mistério: 'Pode ser em qualquer lugar do Brasil' ➡ https://t.co/6… RT @UOLEntrete: Luan Santana anuncia novo DVD com vídeo misterioso: \"Você será contagiado\" https://t.co/4q5Hp2tI3I ⚡️ “Com vídeo teaser, Luan Santana Anuncia a data da gravação do Novo DVD”\n\nhttps://t.co/NQARhxuWmA #VOCESERACONTAGIADO https://t.co/EktD4cw1uf #VOCESERACONTAGIADO #TroféuInternet https://t.co/drNI2qDa08 https://t.co/UdFmKvSPPz 👵🏼💖🥤 #SedeDeLuan RT @habibsoficial: ☄️❤️🥤 #SedeDeLuan Assista agora: “Pra você lembrar de mim”, exclusivo Deezer Sessions @DeezerBR https://t.co/CbBrBAUnzq Meus amoresss, regravei quatro grandes sucessos meus pra Deezer Sessions da @DeezerBR e ficou simplesmente incrível! Vem conferir como ficaram as versões exclusivas de “Pra Você Lembrar de Mim”, “Vingança”, “Sofazinho” e “Acertou a Mão” aqui: https://t.co/Jo7v64OeQN  😍 https://t.co/bVS1Y61qTp Saiu!!! “Santo Forte” com @DilsinhoOficial. Assista 👉🏼 https://t.co/Z5xl4wARrM https://t.co/ECEYYeNTAG Regravei quatro músicas minhas, com o maior carinho, pra esse Deezer Sessions! Nesta sexta-feira, vocês vão poder escutar muito esse projeto lindo lá na @DeezerBR. Fiquem ligados, hein? https://t.co/mbME6nS45d Sintam-se representados pela Nathally em #Menina de Estrela do Indaiá MG!! Assista agora https://t.co/pIvgqIuyZj 🚧 https://t.co/FmTlubBzWu Novo vídeo do #LiveMóvel, hoje, às 18h #Menina 🚧🚧🚧🚧🚧 https://t.co/bGpmxKHvBw RT @DeezerBR: ❤ Sexta-feira ❤ sai a Deezer Sessions ❤ do @luansantana ❤ Mas, antes, nosso príncipe ensina como fazer para não desgrudar del… @teaprecioluanjo @GkKeli MUUUUUITO feliz! 😍 @mideliriols to aquiii @bfrline mió que catchup com danoninho kkk @ourangelrafael ooooooi 😍 @brilho_luans 😳 @GkKeli jaaaaa🙊 @mideliriols oi lindaaa @jullyrsc @MariliaMReal queeeem @_amanndabrbs @MariliaMReal owewn @fcgirlsdoluan @MariliaMReal to sempre aqui ooow @meuamrls_ ♥️ @_eternidadeluan @MariliaMReal eu q amoo @MariliaMReal coisa linda kk Tá vindo surpresa exclusiva por aí na @DeezerBR e se fosse vocês já ia aprendendo mais sobre o app!! 👀 https://t.co/69vsQXEt3n https://t.co/8tAlYVa1qG Amanhã! Menina, às 18h https://t.co/qeKtE58U1v #MENINA https://t.co/ymJRjF7ZGw #MelhoresDoAno #TrofeuDomingao https://t.co/4IxXU2Smrt @habibsoficial voto de gênio vale mais produção 🧞‍♂️?  Valeeeeeu @habibsoficial 👊🏻👊🏻👊🏻👊🏻 #SedeDeLuan @forteamorls vo saaaaiiiir @dedicolr kkkkkkkkk @habibsoficial e #SedeDeLuan? sera q alguém tem aí? 😏 kkkkkkkkkk qd aperto some td https://t.co/tpEH926iRn @sereiadoluan eh? kkkkkk @protejovocels c q ehhh @luanstrings naooooo @nordestinals 🤭 @meucrushluan ❤️ te amo @meucrushluan kkkkk @luanpotter kkkk as fotinha chata eu nao sei vcs mas eu votei 33 vezes kkk e parei para fazer umas modas https://t.co/DaSHMrNlJk @LoamIsTheBest @Umamorporluan voto manda o link @loukspeloluan oi bb @forcacuiabanals pra ontiii @keilasilva295 kkkk passa mesmo nao @Umamorporluan oiiiii @DonzelasDB parabéns donzelas ❤️ @teaprecioluanjo falooo @ffalandoserio ceis tao votando neh coisais mais lindas da minha vida toooooooooooodinha @poxaluanj0 too e vc amor @cearensedoIuan ja graveiii @justofls kkk faz um tempinho @lsvaledoaco nao sabia nao mas gostei de saber @escreveailss eu gosto ce gosta? @fcmimadasdoluan vc q eh, ta td blza? @brunajau t amo, td bem? @transbordols alegro bb q foi? @thequeenyes iti @Carulinaana1303 vc q eh minha temmmm, claro q tem! vcs meus bbjwiahdiwhzones 😍 teeeeeem alguem por akiiii 🤗 O #tbt de hj é o lançamento do meu videoclipe lá no evento das TVs LG ThinQ AI, as TVs são tão inteligentes que é só falar o nome da minha música que ela já te leva pro clipe. Gostou? Segue a @LGdobrasil pra conferir\n#LGeLuanSantana #InteligenteDeVerdade #OuvePensaEResponde https://t.co/M1I12bXXjS Fui apresentador na @RedeGlobo. Comandei o #SoTocaTop ao lado dessa linda @EuFernandaSouza Ê 2018 bom demais!  #Aconteceu https://t.co/SMC6NSUZ3n @eusoquerovclsmg 😏🧞‍♂️ @lmjluan 🙈🧞‍♂️❤️ @luizaribeiroofc ❤️🧞‍♂️ @eusoquerovclsmg 🧞‍♂️🧞‍♂️🧞‍♂️🧞‍♂️🧞‍♂️ 🧞‍♂️👀 Tá chegandooooooo!! Últimos dias para votação do #MelhoresDoAno Vote: https://t.co/NJ6wCLJqnX https://t.co/tU80tvWEdO Coisa boa!! 🙌🏼 https://t.co/Pmso18kgWv @CentralDeFasLS Galeraaaa! Vou montar uma playlist ao lado de 2 usuários do @spotifybrasil! Vou ficar de olho nas playlists da galera que adicionar 3 músicas minhas do Live-Móvel no topo delas! Marque #PlaylistComLuan no instagram! https://t.co/e1hM6akZiP Ontem eu tive o orgulho de ver meu novo clipe em uma das TVs LG ThinQ AI! O mais legal é que com essas TVs inteligentes você pode pedir para assistir meu clipe só falando para o controle em português mesmo! D+ né? @LGdoBrasil \n#LGeLuanSantana  #OuvePensaResponde https://t.co/pgdYfCRjYw Já passamos de 1M de views em menos de 24h #Machista Assista! https://t.co/RCbuWNzOuy @SimoneeSimaria https://t.co/RHQmSw40CE RT @SimoneeSimaria: Boa noite família! Está no ar o clipe de #Machista , música nova do astro @LuanSantana com participaçāo especial nossa,… RT @Simone_SeS: Assistam amoress ❤️❤️❤️ #Machista @LuanSantana https://t.co/73e9MRJVKe RT @metropolitanafm: Luan Santana divulga clipe do single “Machista”, em parceria com Simone &amp; Simaria: https://t.co/h0pKqq8kkz \n#Machista… Corre para assistir a live da @LGdobrasil https://t.co/zi3Bbeh9YN #LGeLuanSantana https://t.co/rs1P1zPA7f Corre no Facebook que vai começar uma live comigo!!! Na minha página, ou na da @LGdobrasil Boraaaa! Usem a hashtag aeeee galera! #LGeLuanSantana https://t.co/CderZZVpni Galeraaaa! Saiu! Meu novo vídeo do projeto #LiveMovel! Com minhas lindas e talentosas amigas @simoneesimaria!! Assista #Machista agora mesmo: https://t.co/RCbuWNzOuy https://t.co/X3DVjpESBz RT @SimoneeSimaria: 🚧 Hoje é dia de lançamento bebê! 🚧 A partir das 19h o clipe de #Machista estará no ar, hot song do miglos @LuanSantana… RT @LGdobrasil: Quem aí não se aguenta de ansiedade para conferir a live de hoje com o @luansantana e a linha de TVs LG com #ThinQAI? #LGeL… Hoje tem lançamento!! @SimoneeSimaria https://t.co/w3A449QtJF RT @LGdobrasil: Alô, fãs de @luansantana! Passando pela sua timeline uma imagem exclusiva do novo clipe dele: já imaginou poder pedir um cl… RT @SimoneeSimaria: Nesta terça (27) as 19h, será lançado o clipe de “Machista” que integra o projeto #LiveMovel do nosso amigo amado @Luan… 🚧🔥 #Invasão Coleguinhas! 🔥🚧 Estamos na área para avisar a vocês que amanhã tem lançamento do clipe de #Machista , música do nosso astro Luan Santana com participação especial nossa.. É amanhã, as 19h no canal oficial do Luan (https://t.co/0h1YblKy9b)  @SimoneeSimaria https://t.co/FdirBSArJh RT @SimoneeSimaria: Galeraaa! Invadindo o instagram das minhas amigas lindas, para anunciar lançamento AMANHÃ!! Nossa moda ficou boa demais… @SimoneeSimaria coisas lindas 😍 num vejo a horaaaaa!! amanhã vamo arrebentá!!! #Machista RT @SimoneeSimaria: Se preparem Coleguinhas, amanhā tem lançamento do clipe oficial de \"Machista\" , música nova do astro @luansantana com p… RT @LGdobrasil: LG e @luansantana se uniram para mostrar o que é inteligência de verdade. Acompanhe nossas redes e descubra que essa surpre… “Machista” é meu próximo vídeo do projeto #LiveMovel! Com a participação mais que especial das minhas amigas @simoneesimaria! Anote na agenda o dia do lançamento: Dia 27, terça-feira, às 19h, no meu canal do Youtube!! 💥🚧 Bora conferir! https://t.co/pdwOGIAzuH Galeraaa!! 🔥🔥 Assista o Lyric Video de “Próximo Amor”. Parceira com @alokoficial! A música já está disponível em todos apps!! #proximoamor 👉🏼 https://t.co/pbPIJR5bRe https://t.co/7wUZzgTmba “Próximo Amor”, parceria com meu amigo @alokoficial, já está disponível nos apps de música!! Corre para conferir e vem aqui me dizer o que achou! 🔥🔥🔥🔥  👉🏼 https://t.co/4oSX6oXrJQ https://t.co/W3V4wXD3FY RT @alokoficial: “Próximo Amor” é uma música coproduzida por mim com meu amigo @LuanSantana que sai nesse dia 23! Clique em \"tweetar\" e ass… Vocês pedidam tanto, mas tanto!! Que minha loja oficial, @LuanSantanaShop atendeu! E bem na #BlackFriday! Chegou o DVD #LiveMovel. Para você curtir todas as músicas e bastidores aí na sua casa! Dá um pulo lá e já reserva o seu! 👉 https://t.co/o9McrA4C43 https://t.co/HhvsGNnE33 “Próximo Amor” lança amanhã, dia 23!! (meia-noite de hoje para amanhã) em todos apps de música! Quem está ansiosoooo? #proximoamor  @alokoficial Pre Save já disponível https://t.co/xaefIQS0d7 https://t.co/klbFpamPhe RT @WarnerMusicBR: Prepare o coração para o seu “Próximo Amor” com @AlokOficial e @LuanSantana 💘💓 O novo hit tá chegando nesta sexta e já t… Toda segunda gravo o #SoTocaTop, então aproveitei que estou aqui com a equipe, e pedi para a galera separar minhas apresentações em uma playlist exclusiva no @gshow. Confira: https://t.co/7y2CfR5hYZ https://t.co/SdZ4FDWHV1 😱😱😱😱😱😱 O Esquenta Black Friday começou na @luansantanashop! Meu BOX de 10 anos com preço imperdível! Corre que o estoque está acabando! https://t.co/kevRzdVTWa https://t.co/x0vsftAajW RT @WarnerMusicBR: Preparado para conhecer o seu \"Próximo Amor\"?? 💖 Marcada pra sair em 23 de novembro, a parceria de @alokoficial e @luans… RT @escreveailss: @luansantana Eu to ficando doida votando https://t.co/yxZuHbRGhp RT @raridadeluans: @luansantana votando nego, domingou https://t.co/dV2vf8IzjN RT @_seucantols: @luansantana votando bb https://t.co/qoHqu0PEkM Boraaaaa votaaar 😍 https://t.co/UNUUsZDa8Q #MelhoresDoAno https://t.co/c9lZqmiEN1 Hoje, Às 20h, tem Faixa a Faixa de #Quarto no Youtube!  Perde não! https://t.co/uWcytbiVYU Vocês são minha vida. Só passei pra lembrar ♥️ “Próximo Amor”, música em parceria com o fera @alokoficial , já está disponível para Pre Save no @SpotifyBR! Cadastre-se e seja o primeiro a ouvir. Dia 23, próxima sexta-feira, em todos apps de música! 💥 https://t.co/xaefIQS0d7 https://t.co/GTOSFNTeYn A galera da @wbpictures_br reservou uma sala só pra eu assistir a pré estreia de “Animais Fantásticos - Os Crimes de Grindelwald”. Quem não viu, correeee para o cinema amanhã, 15!! “Animais Fantásticos, Os Crimes de Grindelwald”! Está S E N S A C I O N A L!  #fantasticbeasts https://t.co/hZQNH5it6B Assista #Quarto  https://t.co/izSfCbuRXG https://t.co/QW9ALZT8yz RT @luanjodream: @meuguialrds O modéstia disponibilizou essa tabelinha, vou marcando no papel msm de 10 em 10 dps marco ali pra saber quant… Começamos a contagem regressiva! Vem #Quarto https://t.co/izSfCbuRXG quem tah pronto pra quartoooooo? #Quarto Hoje! Às 18h no Youtube #Quarto. Novo vídeo do #LiveMovel  https://t.co/0h1YblKy9b https://t.co/sbfSmee9pA #Quarto, novo vídeo do #LiveMovel, hoje, às 18h no @youtubebrasil https://t.co/0h1YblKy9b https://t.co/RnlEUH80sY É amanhã!! #Quarto no https://t.co/cIMwbTkJUM!! A partir das 18h. Não perca! #LiveMovel https://t.co/nuqWHpgiV1 Eitaaa peeega kkk 50 milha em 1 mês 😳 são vocês os responsáveis! ♥️ agora pra bater 100 milha é dois palito. 😂 continuem ouvindo “VINGANÇA” SEM PARAAAR! https://t.co/gexNh4DdD6  #Vinganca https://t.co/wfSy8ronsF #Quarto vem aí!! Dia 13/11, um novo vídeo do projeto #LiveMovel. Fique ligado(a)! A contagem regressiva já começou! Terça-feira, dia 13, às 18h!   https://t.co/0h1YblKy9b https://t.co/wTsrBNfLk5 Domingão e meus fãs arrebentando nas maratonas de votos a semana inteira! Eu já disse que vocês são os melhores do mundo? Pois digo de novo: Os melhores!! Bora votar!! https://t.co/2rC3gdqXnb #MelhoresDoAno https://t.co/ienCjIze4t Já conhece o Chatclub? Meu BOT no Messenger! Quase 2 milhões de inscritos! Novidades exclusivas, vídeos, quiz.. tudo para você! Acesse “Mensagem” na minha página do Facebook e participe! Link direto: https://t.co/gSLzlwKIiA https://t.co/rc6H9psx7j 😍😍😍😍 https://t.co/GQXxTAGEUP @vickcabrini to gordo, to de dieta @euparatils kkk oiii bb @Gatinhasdo_LS kkkk jah tentei dormir cedo mas num consigo @kateixeira__ acabei de acordar kkkkkk e vc bb? @EnaltecendoLuan t amooo @Floco1991 @teussonhosls nao sabia, fala de novo? @teussonhosls tem churrasco? @teussonhosls o q tem de bao ai? @luansgozou @effectsluans oi oi oi oi oi oi oi oi oi oi oi oi oi oi oi 15 ois @gratidaoluans kkkkkk @PiracaoSantana kkkk sai do banho muie @Camilalmeida_21 oi bbbbbzinhaidwoihwuf @eumaariana_ to bem e vc amor???? @FcAmorinfinito1 kkkk neh bb @effectsluans vim te trazer esse humilde presente kkkk to soh olhandooooo oiiiiiiii #LiveMovel também na @AppleMusic https://t.co/dElAJQMuX5 Ouça no app! https://t.co/xOUx7WFQQg Cheguei #MPN2018! Bora começar essa festa no comando da minha vizinha mais linda @maisasilva e soltando o som de #Vinganca com @mckekel! Dia 11 tem a exibição no @nickelodeonbr a partir das 19h. https://t.co/syFBQWIB97 Ouça #Sofazinho no Spotify! Entre as 10 músicas mais tocadas do app! Corre para ouvir nas playlists \"Top 50 Brazil\", \"Top Brasil\", \"Esquenta\" e claro, na minha This Is e na do @jorgeemateus.  🚧🚧🚧 https://t.co/HNm2kloDoW A partir de hoje vamos ter a batalha de #tbts com enquete no story do Instagram. A cada 14 dias (começando terça, terminando quarta-feira), você pode escolher uma música para eu cantar em voz e viloão aqui no instagram!! A batalha dessa Semana? Bora votar! Quinta tem o vídeo! https://t.co/4cxRLdAUaR Araraquara, Serrana e Botucatu na gravação do #SoTocaTop de hoje! ❤️ https://t.co/Cw6a6mQ9DZ COMUNICADO - Lei Rouanet | Leia a nota completa: https://t.co/6kR1cimWAR https://t.co/wccjFTGvba Começou! São 10 troféus do Domingão e o frio na barriga é o mesmo. Obrigado pela indicação mais um ano, queridos amigos e funcionários da @redeglobo. Agora é com vocês Brasil!! A votação está aberta! Boraaa votar!! https://t.co/UNUUsZDa8Q #MelhoresDoAno https://t.co/lTIkw0zTcD Naquele #Sofazinho de dois lugares!! Quem está ouvindo no #SoTocaTop? Ouça essa música e todas do projeto nas playlists do @spotifybrasil https://t.co/qq7gmhXSXt O tantooo q te dei amooor #SoTocaTop Agora vcs kkkk ... #SoTocaTop Voooo pegaaaar todo mundoooooooo #SoTocaTop Euuuuuu #SoTocaTop @meugritodeamorr ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ #SoTocaTop @_NathPires @ls_suavozacalma notaram q to cantando as que sairam vídeos? aguaaaardem #SoTocaTop @anjounicoluan vejooo #SoTocaTop @LoamIsTheBest @sinaldeamwrls só o fato q te amo #SoTocaTop @anaglsfcx e vc o meu 😍❤️ #SoTocaTop @ls_suavozacalma mandaaa #SoTocaTop @Rafa_promete ce gostaaa mto? #SoTocaTop @oneloveluan kkkkk te amo #SoTocaTop @lsvaledoaco da primeira temporada, segunda temporada ja ta sendo gravada bb #SoTocaTop @SinaisMeGuiamLR prontooo #SoTocaTop @sinaldeamwrls vc pode estudar bbzona, eu vo assistir o programa mas to aki na torcidaaa   #SoTocaTop @fcdorafinhaa_ Tb, ce ta bem? #SoTocaTop @SarahDa88864744 kkk to aki @lulisdelicia enem me chama? #SoTocaTop @intosantana sabia sim, pq o meu eh seu #SoTocaTop @lsmeuinfinito sacoooo te amo tb bb #SoTocaTop @mypriderafael vooo #SoTocaTop @loveyouluanz comigo por favor.. te amo! #SoTocaTop @workshtx que recaída eu to falando... #SoTocaTop @eusoquerovclsmg @EuFernandaSouza eu to sempre aki, vcs que n sabem amorrrrezidun #SoTocaTop @mocadorafael kkkk #SoTocaTop @meumenino_lr @EuFernandaSouza ce ta bem bb? #SoTocaTop @EuFernandaSouza eu e vc na tv #SoTocaTop 🙃🙃🙃🙃🙃🙃 Sabia que você pode ouvir todos meus sucessos em uma playlist só no @spotifybrasil? É a minha “This Is”. Clique e comece a ouvir, seguir, compartilhar agora! https://t.co/kykSDajhcn https://t.co/hQGxNTBhMM 30 milhões de views em 20 dias! Média de 1,5 milhões de visualizações no @YouTubeBrasil por dia! 😍🚧🔥 #Vinganca quebrando tudo na internet! @mckekel_ Assista, e ouça em todos apps de música! https://t.co/gexNh4DdD6 https://t.co/EzmhAgxtwA Sofazinho!! 30 milhões de views! 🚧 @jorgeemateus #LiveMovel https://t.co/PY8wVr4HNn Assista como foi o lançamento da turnê #LiveMovelX. Agora no Youtube! https://t.co/n4WITQwoLq https://t.co/kb8Vu14HdT E assim foi o lançamento de #Vinganca, com @mckekel_ e mediação de @LoreImprota no @SpotifyBR. Foi demais! E você, já ouviu “Vingança” hoje? Minha “This Is” tá lá te esperando! https://t.co/kykSDajhcn https://t.co/hbyi6r70JP #LuanNoAltasHoras  hoje! A partir das 23h13, na @RedeGlobo https://t.co/TNWrSvcret Vingançaaaaaaa com @mckekel_ , agora no #SoTocaTop E aí, galera! Bora assistir o novo clipe da @Hering_Oficial. Eu participei junto com  esse time de mulheres maravilhosas (@cleooficial @luisasonza e @ludmilla) Regravamos a música \"Com que roupa?\" do Noel Rosa e já vou avisar que tá d+! https://t.co/61jOf2uQl7 #ÉAssimQueEuVou https://t.co/mXBxoZW1VZ https://t.co/M4rkFeLfmf Passamos de 5M!! https://t.co/gexNh4DdD6 🚧 #Vingança  @mckekel_ https://t.co/Xn9D36dIA1 ⚡ Confira a energia que levamos à 3ª edição da 🚗 @Shell Eco-marathon Brasil 🎼 Assim, fica ainda mais legal buscar soluções 💡 para o futuro, né? 🚀 Saiba mais: https://t.co/mWeEEMziGu #makethefuture #shellecomarathon #shell https://t.co/RRg5s8388U Agora!! Live de #Vingança com Luan, @mckekel_ e @loreimprota!! Assista agora no Facebook!! https://t.co/VILiY1LAXU https://t.co/SP7xHB5QZZ RT @Rafaela_Maito: Essa música do Luan Santana com o MC KeKel é muito boa RT @eduardasdias_: Lançou a música do Luan com Kekel no yt e esse momento é todo meu, COMO QUE PODE SER TÃO MARAVILHOSA? ❤️ RT @veniciu5: a música do Luan com o Kekel é muito boa, puta que pariiiuuuuu RT @pleasezziam: Essa musica do mc kekel e luan Santana tá boa demais RT @loahdeoliveira: Vocês já ouviram a música nova do Luan com o Kekel??\nEntão vai lá.. é meu hino RT @ManuVillarinho: To apaixonada, na musica nova do luan e do mc kekel #Vingança 😍😍 RT @manumoreirac: kekel e luan que maravilhaa de msc RT @luanjobenzao: ai gente que hino é esse luan santana e kekel #Vinganca RT @karotjapp: musiquinha do kekel e luan santana é demais de boa RT @dezaleites: Eu tô apx pela música do Luan e do kekel RT @luansantana: ⚡️ “Luan Santana e MC Kekel lançam #Vingança.”\n\nhttps://t.co/mKSzCrEbQ4 ⚡️ “Luan Santana e MC Kekel lançam #Vingança.”\n\nhttps://t.co/mKSzCrEbQ4 RT @mcountry: EXCLUSIVO: Saiu o clipe de #Vingança de @luansantana e Mc Kekel. Confere aí: https://t.co/q9hrMqycpn #LuanSantana #MovimentoC… RT @metropolitanafm: Em parceria com MC Kekel, Luan Santana libera clipe de “Vingança” https://t.co/qIXq1Nayf3\n#Vinganca https://t.co/5M9wO… #Vingança https://t.co/gexNh4DdD6 https://t.co/W08aPR9VtI 📢 NO AR! Assista agora no meu canal do YouTube o clipe de #Vinganca, essa música que tive o prazer de compartilhar com o meu parceiro @mckekel_. Gravado em Maceió, nosso palco andou de surpresa pela Orla da cidade e foi lindo 😍. Assista completo: https://t.co/gexNh4DdD6 https://t.co/0zjD9NqeR9 RT @nanarude: EXCLUSIVO: Saiu o clipe de #Vingança de @luansantana e Mc Kekel. Confere aí: https://t.co/AD03hxlaU6 https://t.co/515m9NrA30 Amanhã, às 17h, eu e @mckekel_ vamos visitar o @spotifybrasil e fazer uma live com mediação de @LoreImprota! Não deixe de conferir no meu Facebook (E do Kekel tb). Pode vir #Vinganca! Estamos prontos! 💥👊🏻🚧 #LiveMovel https://t.co/c2KrrAV3aO Galeraa Invadi!!! Pode chegar todo mundo que amanhã tem #Vinganca às 12h no Youtube!! E tamo junto numa live direto do @spotifybrasil às 17h! Cola com a gente que ta demais 🔥! @mckekel_ https://t.co/KiEuLiktQZ Faltam 3 dias!! #VigancaDia10 Às 12h, no Youtube! @mckekel_ #LiveMovel https://t.co/OCGsB8FJep Anotem a data!! “Vingança” vem aí!! \"10/10\", quarta-feira! Lançamento com @mckekel_ no YouTube. Inscreva-se no canal e ative as notificações 🔥👉 https://t.co/dTbsTukA5H https://t.co/kDDI9la5I0 Hoje, às 18h, vamos anunciar a data do próximo vídeo do projeto!! Alguém já sabe de qual música é? 🚧 Fiquem ligados!! #LiveMovel https://t.co/oV9zZpoSz5 Vem @radionativa @TopFMsp @bandfmoficial @Tropical1079 @metropolitanafm @RadioDisneyBRA @GazetaFMSP #TocaSofazinho https://t.co/JHO26fHBGq Rádios do meu Brasil! Eis aqui #Sofazinho com @jorgeemateus. Bora pedir na sua preferida.. compartilha aqui nesse twitter qual a emissora que você pediu!! Veeeem galera! https://t.co/EVLAPiZNBo Liga na @redeglobo aí galera!! Vou estar no Ding-Dong no Domingão do Faustão! Será que vocês acertam minha música? Qual será? Fiquem de olho que também vai ter Live-Móvel no palco do Domingão! 🚧 #LuanNoDingDong https://t.co/zjJwRhJxOy Assista agora!! Live “Tour @somlivre” https://t.co/Ru2lSWXpze #LiveMovel https://t.co/EIM2BeO2xU Galeraaa, minha live “Tour @somlivre” mudou de horário para 20h30! Todo mundo ligado https://t.co/eicdNjxHGI #LiveMovel https://t.co/rnWWaZ6bF5 Meu 11º #PrêmioMultishow ! O melhor cantor do ano ❤️ e quem me deu? Uceis. E eu posso viver 1000 anos, nunca vou me acostumar com essa sensação. Vocês me fazem o cara mais feliz do mundo. Amo. Ponto. https://t.co/0RmNX4M0ng Ouça Sofazinho, A, Vingança e todo EP #LiveMovel na @DeezerBR !! Já disponível! https://t.co/8C0wNztIqb https://t.co/Cj6prgr4jK Hoje!! Às 19h, tem “Tour Som Livre”! Uma live falando do meu novo projeto #LiveMovel e do novo vídeo “A”. No https://t.co/qZ13TYB8RR! Avisem os amigos e bora assistir! https://t.co/rgNF56sQSN Sabemos que vai chegar em 3k!! Então vamos comemorar o início do Prémio com essa fotona! #LuanNoPremioMultishow https://t.co/MhAAfi3qTp Dei RT eu mim! Vou ajudar a me ajudar! #LuanNoPremioMultishow RT @luansantana: Quando esse Tweet completar 3 mil RTs vamos liberar a foto! Valendooo! #LuanNoPremioMultishow Nunca posta foto sem camisa, hoje pedimos uma foto X e ele mandou do nada... é um presente para vcs que vivem pedindo ou não é? #LuanNoPremioMultishow #LuanNoPremioMultishow https://t.co/eU2UlgEkDa Subindoooo #LuanNoPremioMultishow 1200 em 8 minutos #LuanNoPremioMultishow Tem quase 1 mil RTs em 5 minutos! #LuanNoPremioMultishow RT @T3baSantanaa: @luansantana Meldels #LuanNoPremioMultishow https://t.co/zp7Vqr8aTZ @tagsdoamor hahahahahaha e usa #LuanNoPremioMultishow Pra não dizer que estamos mentindo kkkk #LuanNoPremioMultishow https://t.co/aKcIafLNME Quando esse Tweet completar 3 mil RTs vamos liberar a foto! Valendooo! #LuanNoPremioMultishow Preparados? Ele tá sem camisa kkkkk! #LuanNoPremioMultishow Ai ele mandouuu #LuanNoPremioMultishow Opções de Luan nesse Prêmio #LuanNoPremioMultishow Pedimos fotinha para Luan! Queremos #LuanNoPremioMultishow Serasi que ele vai mandar? Hoje tem #LuanNoPremioMultishow Vem com a gente!!! (Central Invadindo) Com quem cê vai ficar? #A https://t.co/RHBvsCzsxO https://t.co/rqrGed5kwA #PremioMultishow @multishow https://t.co/BocvVYmolp Vocês escolheram! \"A\" é o segundo vídeo do Projeto #LiveMovel. Assista agora o video completo https://t.co/8FjlDZqCvo Está lindo!! Me digam o que acharam! #A https://t.co/XaX09YUTFk Hoje, às 12h! “A”, no https://t.co/0h1YblsWKB #LiveMovel https://t.co/pJY3lfGP2N Hoje tem #PremioMultishow!! A edição comemora 25 anos e vamos agitar a noite com performances inéditas!! Além de concorrer com as 5 indicações, teremos no palco os novos sucessos \"A\", #Sofazinho com @jorgeemateus e \"Vingança\" com @mckekel_. A partir das 21h30, no @Multishow. https://t.co/o7PzaJX0f9 RT @multishow: Q: Amor qual a sensação de saber que você é indicado a essa premiação desde 2010 ? Como é … #EsquentaPremioMultishow\n- @comv… RT @multishow: Já já tem #EsquentaPrêmioMultishow com LUAN SANTANA é já já. Mandem as perguntas sobre #PrêmioMultishow pra ele responder :)… https://t.co/RogDOdgmdZ https://t.co/BolCmn2OnP “A” vem aí!! Amanhã, às 12h, no Youtube; tem o lançamento do segundo vídeo do projeto #LiveMovel. A @hering_oficial acompanhou os bastidores dessa música e você pode conferir agora! Vem “A”!!!! 🚧🅰️ https://t.co/gY35iHNzLU “Sofazinho” arrebentando nas plataformas! Já ouviu no seu app preferido? Então siga, ouça, adicione na sua playlist, compartilhe!! #LiveMovel @jorgeemateus 🚧 @somlivre https://t.co/5eHHb92Prw Bora votar no próximo vídeo? “A” ganhando disparaaaado! 👀🚧 Vem votar no Story do Instagram! #LiveMovel O lançamento será dia 25! Terça, às 12h no Youtube. https://t.co/frK8dLoIUC RT @jorgeemateus: Quem aí não para de ouvir #Sofazinho? A gente também não!  Ficou demais essa parceria. https://t.co/OS5TlC30Lb 💥 https://… RT @jorgeemateus: Imagina, nêga? #Sofazinho disponível no YouTube. Mais de 7 milhões de visualizações! 💥 https://t.co/02By8qN2jo E tem muito #LiveMovel no @DeezerBR ! Vem conferir na playlist “Novidades da semana” https://t.co/lDp6qjwt7M https://t.co/PSRw91vGMz Agora é só curtir #Sofazinho https://t.co/TxG1u9d7KH @jorgeemateus #LiveMovel https://t.co/qVob6OP03S Vem ver os gifs novos na nossa página!! https://t.co/FxFsdnVlp5 #LiveMovel https://t.co/ROyu90nkJZ Vem conferir como escolho as músicas dos encerramentos dos programas #SoTocaTop no \"Diz aí Max\". @gshow https://t.co/eVyqcILgV5 ❤️❤️❤️❤️❤️ https://t.co/dAbxm86xeO Imagina se ele falasse, nega! https://t.co/odCAFDD9o9 #LiveMovel #Sofazinho @jorgeemateus “Sofazinho” subindo e subindo no Top 50 Brazil do @spotifybrasil! Não deixe de conferir na playlist “Esquenta Sertanejo”!! Olha quem é capa aí 👀💥. Tá massaaa!! Bora ouvir! #LiveMovel https://t.co/Dob26axP91 https://t.co/KBLzqwtek3 Clique aqui e ouça agora meu novo projeto #LiveMovel\nhttps://t.co/Q2YYgjoHX5 3 milhões de views!!! 😍#Sofazinho @jorgeemateus https://t.co/TxG1u9d7KH https://t.co/p0rQSxj5IQ #SoTocaTop sempre cheio de novidade!! Vem conferir essa playlist de vídeos do programa: https://t.co/pIv4xWlDTG @gshow https://t.co/4IP8wRjSns RT @MomentsBrasil: ⚡Emocionante - @luansantana lança clipe de #Sofazinho com @jorgeemateus &gt; https://t.co/Mws7J8yJGt RT @Globo_Rural: Aprenda a plantar camomila pra se recuperar após o lançamento do clipe de #Sofazinho do @luansantana com @jorgeemateus htt… RT @quemacontece: Já pensou o @luansantana aparecendo de surpresa na sua cidade? Pode acontecer! https://t.co/OKl6w6JS6L RT @GauchaZH: .@luansantana divulgou sete músicas e clipe inédito com Jorge e Mateus https://t.co/kw3vtSEJ3U RT @DeezerBR: Estamos no chão com essa versão maravilhosa do @LuanSantana de “Quando a Chuva Passar” #SóTocaTop #DeezerSóTocaTop Nada melhor que começar o dia com #Sofazinho. Na Top50Brazil do @SpotifyBR  https://t.co/odCAFDD9o9 @MariliaMReal KKKKKKKKKK gostou dessa? 😍 @MariliaMReal Princesa minha ❤️ Clique aqui e ouça agora meu novo projeto #LiveMovel\n&gt;&gt; https://t.co/Q2YYgjoHX5 Estamos ao vivooooo! https://t.co/fSBqA9os3R Assista Pocket Show do Live-Movel no Youtube!! Corre lá que já vai começar! #LiveMovel Veja: \nhttps://t.co/fSBqA9os3R Vamos atrasar um pouco o pocket por conta da coletiva mas já fiquem de olho! Link da LIVE https://t.co/fSBqA9os3R Agora no Youtube!! Chegou #Sofazinho. Primeiro vídeo do projeto #LiveMovel. Com meus amigos @jorgeemateus. Música viciante que gruda no coração e na cabeça da gente! Obrigado meus parceiros! 🚧💥 Play, Replay... essa merece!! Assista https://t.co/TxG1u9d7KH #Sofazinho #LiveMovel https://t.co/zuryZpmxHn #Sofazinho “Menina”, já disponível nos apps de música https://t.co/Eh2MdiG4Rz #LiveMovel https://t.co/cHDkjuQtEA “Boa Memória”, já disponível nos apps de música https://t.co/Eh2MdiG4Rz #LiveMovel https://t.co/bx17rpyOJy “Machista” ft @SimoneeSimaria, já disponível nos apps de música https://t.co/Eh2MdiG4Rz #LiveMovel https://t.co/iqOBsvH8aB “Quarto” já disponível nos apps de música https://t.co/Eh2MdiG4Rz #LiveMovel https://t.co/focbGvBt8C “Vingança” ft @mckekel_ , já disponível nos apps de música https://t.co/Eh2MdiG4Rz #LiveMovel https://t.co/1KztQ3G1S2 “A”, já disponível nos apps de música https://t.co/Eh2MdiG4Rz #LiveMovel https://t.co/YmtJ3AfAVX “Sofazinho” ft @jorgeemateus, já disponível nos apps de música https://t.co/Eh2MdiG4Rz #LiveMovel https://t.co/06jP8hgi31 corre lá no insta que vou fazer liveee #liveMovel00h prometiii #LivelMovel00h RT @Kaii_Weber: as novas musicas do @luansantana são maravilhosas &lt;3 RT @ibiancafranca: Nunca na história negola vi um projeto assim, todas as músicas lacraram. Tipo não tem q ajustar nada. Ficou perfeito. Ar… RT @rachelgreenzs: Luan Santana lança mais 7 hinos e choca o total de 0 pessoas RT @rachelgreenzs: OUÇAM O NOVO EP DO LUAN SANTANA SERIO RT @cruzvalessa: 14 de setembro nunca mais será o mesmo depois desse lançamento do luan santana RT @andressacff: Luan Santana e Jorge e Mateus QUE MÚSICA QUE SONHO #LiveMovel RT @kelyhasquel: Se eu fosse vcs ia ouvir o novo EP do Luan Santana no Spotify. TA MUITO BÃO GNT DO CÉU #LiveMovel00h https://t.co/HrTxsxOX… RT @eujonatasmagno: Luan Santana soltou músicas novas e já tô eu aqui ouvindo, n tem como fugir RT @mmariiannesr: O novo ep do Luan Santana ta sensacional, amei. Cada musica mais maravilhosa q a outra ! RT @POPline: Todo gravado ao vivo, o novo EP do @luansantana , o \"Live Móvel\", ainda conta com participações de Simone &amp; Simaria, Jorge &amp; M… RT @MomentsBrasil: ⚡Saiu o novo EP do @luansantana, 'Live-Móvel'! Olha só o que o pessoal está achando &gt;\n\nhttps://t.co/HlBX2KNh3s Sete! Tem mais uma aí! 👀 #LiveMovel00h https://t.co/CORJw0yXuD RT @portalpopcyber: Saiu! @luansantana surpreende fãs com novo projeto “#LiveMóvel”; ouça agora! https://t.co/Vq8C3Qgd34 https://t.co/2zVSB… RT @Douglasadrian17: Po, que musica massa!!! Luan Santana com Jorge e Mateus ficou mto massa!!!! https://t.co/LjdGOlRK9m RT @ManuCSC: O NOVO EP DO LUAN SANTANA EU TO FORA DE MIM RT @portalmscbr: Se você estava esperando apenas um hino de Luan Santana, sinto te desapontar, pois todas as faixas que estão no EP, SÃO HI… Saiu! A espera acabou! Foram meses de muito trabalho para esse resultado que está lindo! É uma 💥 atrás da outra! O que vocês acharam? Falem a preferida de vocês! Tô curioso! #LiveMovel https://t.co/5Atqn43o8f https://t.co/W26Kd0Vl80 Sintam todo meu amor nesse disco. E a benção de Deus em cada nota ❤️ #LiveMovel00h CHEGOOOOU! Ouçam sem moderação em todos os apps de música! #LiveMovel00h 3 minuTOOOOOOOS #LiveMovel00h 😍😍😍😍 7 min pro LIVE MOVEEEL #LiveMovel00h 23 min pro LIVE MOVEEEEEEEL 😍 #LiveMovel00h Me respondam usando a hashtag #LiveMovel00h ❤️ qual música vcs + estão ansiosos p ouvir? @wgurizinho @ls_meunenem Sua preferida?? #LiveMovel00h @ls_meunenem Owwwn ❤️ #LiveMovel00h 32 min pro Live Moveeeel 😍 #LiveMovel00h @iprotectluanjo Cumeno macarrao e esperano #LiveMovel00h @alentejoyas Claro que vai amooor oooooi #LiveMovel00h @meurefugioluanr Ooi #LiveMovel00h 😂 @nottheends Nao perde por esperar 🙊 #LiveMovel00h @luannosinspira #LiveMovel00h carrrrrma @Danimacielf_ E continuar vivendo #LiveMovel00h ❤️ @aoarcanjoluan Tooooo #LiveMovel00h 😍 @clarabizoni #LiveMovel00h quem falou? #LiveMovel00h ❤️ 👀👀👀👀👀 #LiveMovel00h RT @jorgeemateus: Hoje às 00h, vocês vão conferir Sofazinho em todas as plataformas digitais! E amanhã 12h, o vídeo estará liberado no YouT… falta 1 hora!!!!!! #LiveMovel00h https://t.co/tzvkG3R0Bg A M O  V O C Ê S!! #LiveMovel00h Mas o tweet de lembrar foi brincandeira, pq não esqueço. Nunquinha amorss #LiveMovel00h ah lembrei! #LiveMovel00h to falando tudo, o q mais posso falar? #LiveMovel00h E 18h, vou ser mto bem recebido por essa galera que me trata com tanto carinho.. sandrinha, walter.. e todos do @YouTubeBrasil, no prédio do google em sp pra fazer uma live no meu canal com pocket show e tudoooo #LiveMovel00h amanha as 12h tem vídeo no youtube! Sofazinho, com @jorgeemateus #LiveMovel00h @meuguialrds me perdoa, eh mta gente bebe  #LiveMovel00h @LuaneteThays30 faloo #LiveMovel00h @mariela_doluan vamo tc? #LiveMovel00h @betterluan kkkkkkkk nao bb #LiveMovel00h Qual mais gosta? #LiveMovel00h kkkk to mto enquetero #LiveMovel00h E das participações? #LiveMovel00h qual música do ep Live Móvel vc ta mais ansioso pra ouvir? #LiveMovel00h pera kkk q to pedindo ajuda #LiveMovel00h @loucapelolss kkkkk #LiveMovel00h @loukspeloluan @porvcmeurafa feito, o q mais senhora? #LiveMovel00h @surrealuanjo @spiessantana pois nao #LiveMovel00h @agapeluans @ibrunans ok #LiveMovel00h deixa os users aqui q sigo quem não sigo ainda e vamos seguindo em frente #LiveMovel00h kkkkkkk #LiveMovel00h https://t.co/aH2f5aszBD ohhh.. tamo em segundo kkk #LiveMovel00h @Vitoria26409821 falooo bb #LiveMovel00h @xnegola @mardeamorluanr sigooo #LiveMovel00h @howimetluan Jaja beeeebeezona #LiveMovel00h @raridadelsnjr Qqqq? #LiveMovel00h Uou o uo uo uooooo #LiveMovel00h amar é deixar ir.. é saber sair de cena! É ficar longe pra não te causar nenhum problema #LiveMovel00h AQUELE SOFAZINHO DE DOIS LUGARES... #LiveMovel00h eles vão ter que respeitaaaar.. a menina da rua de cimaaaa, e o carinha da rua... #LiveMovel00h Aí ce vai lembrar.. do quanto que eu te dei amor... #LiveMovel00h te perdi pra mim, não foi pra ng.. eu te perdi pra mim #LiveMovel00h deixaaa a camaaaaa #LiveMovel00h quem te leva ao céu? #LiveMovel00h @escreveailss kkk pode #LiveMovel00h @Dayse_321 boraaaa dayse #LiveMovel00h @Gatinhasdo_LS eu te amo  #LiveMovel00h @garotadokm70 amem!! @MotivoDeViverLS to, vcs tao?  #LiveMovel00h @smileluaanjo Kkkk soh nao vo ta movel mas posso fazer andando kkk #LiveMovel00h @FcSuperAmorLRDS vc q eh #LiveMovel00h esse projeto foi feito com mto amor p vcs! tava contando os dias, horas e minutos pq ñ tem nada que me deixa mais feliz do que ouvir / ler o retorno de vcs  #LiveMovel00h a gente é só amor bebezojshdiahsirhahazonas vou colocar um desafio aqui! se a gente levantar #LiveMovel00h  em primeiro nos TTs vou abrir uma live! 🚧🚧🚧🚧🚧🚧  boraaa? enquanto isso fico aquiii psiuuuuuu, quem ta acordado ai? #LiveMovel00h https://t.co/foBWxSa93W Hoje na madrugada, às 00h, tem EP #LiveMovel nos apps de música! Coloca o despertador aí para tocar! https://t.co/y9cHm5FNh8 RT @jorgeemateus: Depois de amanhã, #Sofazinho disponível pra vcs! @luansantana + Jorge e Mateus. https://t.co/eJhifAC9d8 Vai ter transmissão de um Pocket Show #LiveMovel direto do Google em São Paulo para o @YouTubeBrasil !! A partir das 18h, no canal do Luan! Perde não que é repertório novo e quentinho!  Dia 14, sexta. RT e Compartilhe! https://t.co/BANHDFI9VL RT @showdavida: Imagine um caminhão preto chegando de mansinho na sua cidade e, dentro dele, uma surpresa: @luansantana. Cantor está rodand… Pre-Save disponível https://t.co/XtSHdBoGbN #LiveMovel Salve o EP e seja notificado assim que sair! @SpotifyBR https://t.co/ptstoGgsle #LiveMovel vem aí! Que presente foi poder viver tudo isso. O palco itinerante que fez parte da minha história e de tantas pessoas. Será uma música a cada 14 dias no meu canal do Youtube! Você PRECISA ativar as notificações!  https://t.co/SDPaUO04x3 #LiveMovelNoFantastico AMOORS!! 😍 fiquem ligadoos!!!! uhuuuuu #LiveMovelNoFantastico Vai começaaar! #LiveMovelNoFantastico #LiveMovel @showdavida 21h, na @RedeGlobo https://t.co/d4xySLuIck RT @gshow: Luan Santana e MC Kekel cantam música inédita no #SóTocaTop  https://t.co/hw5EuvqpmO https://t.co/1l2opNbzRU Hoje o #SoTocaTop está imperdível! Uma galera da pesada, que sou grande fã! Tem até um gostinho do #LiveMovel com a minha música em parceria com @mckekel_ ! Vale a pena conferir em primeira mão! Perde não galeraaa! 🚧🔝 A partir das 15h, na @redeglobo @gshow https://t.co/RtgkGGYtbL RT @jorgeemateus: Domingo no @showdavida! https://t.co/7pDkZ01VAD Tá chegando!! @multishow https://t.co/3wQp0W6kix https://t.co/8BxJ8J3OTi #LiveMovel  Domingo, a partir das 21h, na @RedeGlobo 🚧 https://t.co/ujGc4vFpiA Nossa “Captura Live-Móvel” vai virar um mini-doc! A promoção em parceria com @hugogloss contou com mais de 10 mil inscrições e somente 10 pessoas foram “capturadas” em São Paulo para participarem do último dia de gravação. Dia 14 tem “Sofazinho” com @jorgeemateus às 12h! https://t.co/9aRskg4Pvx Começou a votação do #MPN 2018!! Use as hashtags #LuanSantana #LuanSantanaTV #Luanetes para votar nas categorias, ou acesse o site https://t.co/2AcdydnCgQ https://t.co/b0Wxs3uwGC 4 cidades, do interior à metrópole! A Música sem fronteiras! Esse é o Brasil, esse é o #LiveMovel 🚧 EP completo dia 14.09, sexta, às 00h nos apps de música. https://t.co/IgaWkAlXBd 14.09, sex, 00h #LiveMovel 🚧 https://t.co/5LucuP8lMz @israluan kkkk deeeei bjo tchaaau boa noite meus amoresss, volto em breve! não desistam de mim nesse site 😅 bjo no ❤️❤️❤️❤️ @SempreEstouAiLS quem é que tira o seu mel? @CorreioLuanete ok estou indo conferir @_Maryahlopes tb to bb! vcs vao gostar @thearluan kkkkkk @aamorls q linda 😍 @gii_pacheco_ls falo ❤️❤️oii @tkslrds q issoooo! te amo e vc tb me ama eu sei! vamos nos amar pra sempre e fim @whityouluan0 pq? Te amo @KLAUSURPADOR vai estudar meu amor @anjodeamorls kkk ceis gostaram neh @conectadasdolu deixo nao @goianadoluan kkkk te amo @tecuid0lrds falooo ❤️ @meucrushluan perdoa eu? @unicomotivolr sempre sempre @TeVejoLindo_CG amém @TheSuperSantana notooo @gabrielesoarzls toooooo akiiii @inlovesantana to aki @yashtadobaile 😍😍😍 @vaivendoluan t amo! @trustluans se vc vir comigo, vambora @intosantana eu tbbbb sabia? mas vim soh dizer uma coisa mto importante A M O  V O C Ê S ! E td ta sendo feito com mto amor e num entro, mas ó.. vai vir tanta coisa linda daki uns dias e eu to tao feliz sei q eu fico q vou entrar aki e pipipi pipipi me chamaram e eu vim meus bebeeeeeeeeeeeeeeeeeeezizoeszoaos mto boa noite  #luandigital https://t.co/g2CAx8GKt2 #MCLencolEDJTravesseiro e todos os meus maiores sucessos você encontra na This Is Luan Santana no @spotifybrasil. Confira https://t.co/kykSDajhcn https://t.co/mG0YuWZipa Você pode escolher a capa do meu novo EP “Live-Móvel”. Vote agora na enquete do Story no Instagram! 🤔 #LiveMovel https://t.co/NOMmrLUpYS Já já tem #SoTocaTop, às 15h, na @RedeGlobo @gshow https://t.co/f3UCHfn6t9 São Paulo! Dia 23, quinta-feira, é o último dia de gravação do Live-Móvel! O local exato? Segredo! Mas 10 pessoas serão “capturadas” de surpresa na capital paulista e vão ver essa gravação! Bora? Acesse: https://t.co/9wWoW4gh3Y  #LiveMovel @HugoGloss https://t.co/bzvd0GTiDA São Paulo! Dia 23, quinta-feira, é o último dia de gravação do Live-Móvel! O local exato? Segredo! 🙊 Mas 10 pessoas serão “capturadas” de surpresa e vão conferir participações com @jorgeemateus  @simoneesimaria! Participe no site do @HugoGloss https://t.co/9wWoW4gh3Y https://t.co/HlXRuT7qd5 RT @HugoGloss: TÁ NO AR: Concurso Cultural: Captura Live-Movel Luan Santana By Gloss https://t.co/gcecN3PZKq @luansantana https://t.co/uFEX… A Nossa voz! A minha, a sua e de 200 milhões de brasileiros.  #oucaanossavoz 🇧🇷 https://t.co/ENcOo5J6zb A temporada de Primavera 2019 da @CocaColaJeans está no ar. Acesse https://t.co/wUjfo8N7nj e confira tudo! A NOSSA BOSSA tem moda, música e movimento. E a sua? #CocaColaJeans #NossaBossa https://t.co/yyRlyroAPM Parei com os rolês… e escolhi várias músicas que eu gosto pra vocês. Tá tudo na playlist Sertanejo Apaixonado da @DeezerBR. Olha só: https://t.co/nIqDnZpfhc ❤ https://t.co/ddc3HuUBQR RT @gshow: Hoje é dia de #LuanSantana11Anos ♥\nE, nessa data especial, sinais me mostram o caminho até esse pocket show maravilhoso que o @l… E não é que esse menino aqui está fazendo 11 anos de carreira?  https://t.co/yzHcyykf3y RT @HugoGloss: E o Beija-flor vai encontrar o Meteoro e nós já estamos na ansiedade! @luansantana e @jorgeemateus farão parceria em novo pr… Vem ver como foi a #LuanX em Além Paraíba e Lajinha. https://t.co/6bG2TwWSPw #SoTocaTop https://t.co/zF4AhC6xvd Hoje tem #SoTocaTop! Quem já está ligado aí? 👀 https://t.co/VTNcqteaBd Hoje tem BLITZ nacional de #MCLencolEDJTravesseiro nas rádios! Peça na sua preferida!!! 📞  - EquipeLS https://t.co/TKThZPbJEz oi oi oi oi e oi de novo https://t.co/kykSDajhcn #LuanSantana  #MCLencolEDJTravesseiro https://t.co/t6myUy0EHa Hoje, #SoTocaTop às 15h na @RedeGlobo! Quem já está ligado aí? https://t.co/2FiB0xpyuI Fala galeraaa! Não tem nada mais top que ouvir a minha playlist do #SóTocaTop na @deezerbr, então dá o play: https://t.co/YJAhowtn5L ✌ https://t.co/Hk6uNVyDSe ⚡️ “Vídeo Q&amp;A com Luan Santana #LuanNoTwitter”\n\nhttps://t.co/ooMLnFfWd2 Assista o Q&amp;A #LuanSantana durante a visita no @twitterbrasil em São Paulo para divulgação de #MCLencolEDJTravesseiro! #LuanNoTwitter https://t.co/UfVv0yBZ1n Depois não vem dizer que não tá avisaaaado #LuanNoTwitter  🤣 https://t.co/GKyJIOkerj Você não tá enxergando errado! 🤣Hoje sai o vídeo do Q&amp;A no escritório do @TwitterBrasil! Às 18h, aqui no perfil!! #LuanNoTwitter https://t.co/X1aQOMpU58 https://t.co/UbcqaiPiWl #LuanSantana #MCLencolEDJTravesseiro  Quem já ouviu hoje? https://t.co/bCss6ZHE0a #MCLencolEDJTravesseiro https://t.co/UbcqaiPiWl https://t.co/JsVYnxqGir São Pauloooo, já temos data marcada pra nos encontrarmos novamente.. \nDia 26 de Outubro, sexta-feira, no Espaço das Américas.\nUm show cheio de novidades e repertório novinho em folha!\nIngressos à venda: https://t.co/FmxvB0mdYh\n#TurnêLuanX #LuanNoEDA https://t.co/sdxuTIMge0 @GraciosoLuan eu to, ce ta? @lsmeumeenino oooooooi minha bbbbbbzinhininhinha @uaaisantana eu tb, mas me conta uma novidade agora bb @ssuavozluanjo tb, vc ta bem? como ce ta? @escreveailss vo fika @ButterflydoRafa ❤️ @lssuavozacalmaa kkkkk eh assim aki viu 😅 @portigurizinho to aki A RT @gshow: Que HINO de programa, hein, @luansantana e @EuFernandaSouza? Pra ver tudo o que rolou no #SóTocaTop desse sábado, é só clicar aq… VRAAAAAAAAAAAU NOCÊIS #sotocatop 😂 @vivo_luanjo Kkkk #sotocatop @EuFernandaSouza eu tooooooo, ce taaaaa? ❤️❤️❤️ #SoTocaTop @ILeticiaG Seria lindo ne? 😍 #sotocatop @stainedluan Kkkkkk #sotocatop @grudadosnoluan Linda #sotocatop ♥️ https://t.co/bfIfxKquYr @sentidosluan @LuanSPRT @EuFernandaSouza Vc eh uma bebe #sotocatop @RedeGlobo o top q eh top so toca top eh top e todo mundo eh top na globo comigo eh top #SoTocaTop kkkkkkk ceis gostaaaa #SoTocaTop naquelaaaa camaaaaa #SoTocaTop bora parceroo @DilsinhoOficial #SoTocaTop @suspireisantana ce ta gostando bb? #SoTocaTop e tem @MelimOficial arrebentando #SoTocaTop #SoTocaTop @Camy13543191 @EuFernandaSouza Um dia eu aprendo #sotocatop 😂 @xmcrst Eu sei 🙊😂 #sotocatop @LuanSPRT @EuFernandaSouza Owwwn #sotocatop @lsmeucrush Ta gostando amor? #sotocatop @sweetsantanaa @RedeGlobo voo voltar na hora do programa ta? #SoTocaTop 15H!! NA @RedeGlobo #SoTocaTop toooooo prontooooooooooo!veeemmm #sotocatop @RedeGlobo @EuFernandaSouza 👀 RT @gshow: Na preparação pra estreia do #SóTocaTop, nosso muso @luansantana encara o desafio de responder um quiz sobre seu ídolo na música… RT @gshow: .@EuFernandaSouza e @luansantana mostram os bastidores do #SóTocaTop! https://t.co/xzxQnNCxMy Ansiosa por esse programa 🔝! É hoj… https://t.co/T4pTCNgD2Q #SoTocaTop @RedeGlobo to mto ansiosoooooo #SoTocaTop  vo nem dormir RT @RedeGlobo: #Sextou real oficial!! 🤩 @luansantana preparou sua lista de tops pra gente aquecer! E amanhã, #SóTocaTop! 😉 🔝🎶 #TOP https://… RT @multishow: Tá chegando aí o #SóTocaTopNoMultishow nesta sexta, à partir das 21h15, com @LuanSantana e @EuFernandaSouza! Vários artistas… . #SoTocaTop Hoje tem no @multishow  a partir das 21h15!! E amanhã, às 15h na @RedeGlobo @gshow https://t.co/4aJikdfrRN A @CentralDeFasLS fez icon personalizado do #SoTocaTop para o Twitter. https://t.co/FcSOoEHS9M Já aderimos! - Equipe LS Te aaamo minha neeeega #MCLencolEDJTravesseiro https://t.co/UbcqaiPiWl https://t.co/Eu8RScl1nh RT @Ceclia96722805: Hoje exatamente hoje eu completo 15 anos de idade e hoje também faz 5 anos que esse álbum maravilhoso #ONossoTempoÉHoje… Bora Brasil! 💚💛🇧🇷 https://t.co/JKyaPtL6IO Desvendando Tweets!! Vem conferir o que rola por trás dos tweet do... ou sobre... Luan Santana!! #LuanNoTwitter https://t.co/AEgViMJIQq Visitei o escritório do @TwitterBrasil em São Paulo e expliquei alguns dos meus milhões de tweets diários kkk e tb menções que recebo. Amanhã!! Às 10h30, coloco o vídeo para vcs! Todo mundo ligado! #LuanNoTwitter https://t.co/OPn0uYGvh8 Pronto para os 20 milhões de views que estão chegando! Mas enquanto isso... bora ouvir no @DeezerBR https://t.co/yetBEvM48O https://t.co/RREfga5eTn @ShawnMendes https://t.co/aWmqz2IKzZ #LuanNoVillaMixFestival agora no Youtube https://t.co/kCRlrcrGUP #LuanNoVillaMixFestival https://t.co/C3eNQVg6Nu #LuanNoVillaMixFestival https://t.co/izRi0185Kp #LuanNoVillaMixFestival https://t.co/nDEcFz1SvR Vai começar já já! #LuanNoVillaMixFestival O show com Luan no @Villamix começa às 16h55! Assista ao vivo no @multishow e pela internet: https://t.co/lqAIPEy6jz #LuanNoVillaMixFestival Meus amores 😍 to ansioso pro villa mix hj e vcs?! 🙊 16:55 no palco eim!! Um beijo e até lá! - Equipe LS Temos um encontro marcado domingo! Todos avisados que esse Twitter será “invadido”, beleza? Ah! So avisando! Equipe LS falando! \\o/ Bommmm diaaaaaa! Sabe pra onde estamos indo? Villa Mix Festival! Acompanhar tudo o que vai rolar com Luan por lá!! E vamos cobrir aqui Domingo para vcs uhuuu! A @luansantanashop está com uma super promoção!! O livro oficial de 10 anos de R$99,90 por R$49,90. Aproveite!! https://t.co/3kRRqykhjv - Equipe LS https://t.co/sTnKLo5oFg @jeitols q te amo @liviaansemo26 @FCLuanSantana_L minha pamonhaaa @luanshades o ke???? t amo t amo t amo @SempreEstouAiLS to aki @FCLuanSantana_L t amoo kkkkkk vcs são os melhores kkk manda maaais #MCLencolEDJTravesseiroNasRadios @plenitudeluanjo se eu falar, ce acredita q ja? @mebejaluan t amo bb como c ta? óoooooo oferecimento pro escritorio do artista kkk https://t.co/CMUvF6laat kkkkk eh o nome da musicaaaaa https://t.co/31wj6REpkZ kkkkkkkkk https://t.co/chIVsNiTv0 kkkk bbzona https://t.co/DI9b7F8m0F toca pra ela @RadioDisneyBRA https://t.co/481Uf3EXak RT @escreveailss: MC LENÇOL E DJ TRAVESSEIRO NAS RÁDIOS\n\n#MCLencolEDJTravesseiroNasRadios @CentralDeFasLS @luansantana https://t.co/TdJUCo8… tooo vendoooooo #MCLencolEDJTravesseiroNasRadios https://t.co/z3oHTqPc0b @luanjouz soh pra agradecer bb... mais nada, obrigado! t amo! amo vcs ❤️ esses aqui são meus... meus fãs! vcs sabem o qt são importantes pra mim? vim para agradecer as indicações do prêmio multishow, para comemorar ❤️ “Só Toca Top” vem aí!! Para participar da live @gshow hoje às 16h, basta enviar sua pergunta com a hashtag #SoTocaTop - Equipe LS https://t.co/I25eUJeVUg Galeraaaaa!! Amanhã, às 16h, teremos um encontro ao vivo nas redes sociais do @gshow sobre meu novo programa com a @EuFernandaSouza. Você pode mandar a sua pergunta: é só usar #SoTocaTop que a gente vai responder amanhã. Então já sabem: encontro marcado a partir das 16h!  Intéé! Hoje é o último dia para indicar Luan nas categorias do @PremioJovem . Acesse https://t.co/rHHifMVZtO e vote agora na reta final da primeira etapa. - Equipe LS https://t.co/1RNqoyGGdB RT @ciadanielsaboya: Vídeo Aula - MC Lençol e DJ Travesseiro - Luan Santana - Cia Daniel Saboya (Coreografia): https://t.co/64PgH2Okot via… A @improtaLorena mandou muito bem na coreografia de “MC Lençol e DJ Travesseiro”! Ficou incrível! Bora assistir e aprender? Obrigado Loreee! Link 👉🏻\nhttps://t.co/iQ8Tk3FK9L\n#MCLencolEDJTravesseiro https://t.co/ULYtckhwPx 10 milhões!!! https://t.co/eBgxaxKVKZ #luansantana #mclencoledjtravesseiro @Tatawerneck https://t.co/aOBvKCi2H8 Pede pro DJ anunciar!! https://t.co/eBgxaxKVKZ https://t.co/7RkJLEtk8Z RT @Domingo_Legal: Olá MIGOS! Passando só pra dar aquela LEMBRADINHA MAROTA que neste domingo vai rolar @luansantana comemorando os 10 anos… Hoje tem Especial Luan Santana no @Domingo_Legal ! A partir das 13h, no @SBTonline @celsoportiolli #LuanNoDomingoLegal https://t.co/mQmmYgMhVO Hoje!! Mas na dúvida liga a partir das 18h tá? #LuanNoMultishow  - EquipeLS @multishow https://t.co/x1VNyYeWtP RT @quemacontece: Logo logo estreia o #SóTocaPop, comandado por @luansantana e Fê Souza! Será que ele tá assistindo outros apresentadores p… RT @carasbrasil: O cantor @luansantana aceitou o desafio e respondeu um quiz divertido sobre sua carreira. Assista! https://t.co/Scb4iltr8m… RT @quemacontece: O que o @luansantana acha de seu antigo visual? A @giuliannacampos foi perguntar! https://t.co/e0KeDrIytZ RT @Domingo_Legal: ESTE CENÁRIO! 💙Em comemoração aos 10 anos de carreira de @luansantana , trouxemos parte do cenário utilizado em sua turn… RT @Domingo_Legal: O #DomingoLegal será mega especial em homenagem aos 10 anos de carreira de @luansantana 😍 Sucessos? COM CERTEZA! Surpres… Você sabia que “MC Lençol e DJ Travesseiro” virou uma campanha de arrecadação de agasalhos neste inverno? https://t.co/rhHIZG9vGO está disponível para encontrar a instituição mais próxima e fazer sua doação! Vamos ajudar quem precisa! #MCLencolEDJTravesseiro https://t.co/hzdZR5MmiW Preparei uma Playlist de “Dia dos Namorados” para vocês no @SpotifyBR . Me falem aqui o que acharam! Siga e compartilhe: https://t.co/jrWmyfGBfF https://t.co/TPE7nCBnr8 “Sonhos se realizam, o inesperado acontece e o impossível definitivamente não existe” (“Luanete”.... é assim que ela assina). O Making Of de “MC Lençol e DJ Travesseiro” já está no ar!! Confira:  https://t.co/gA41TqejrK Está demais!! @tatawerneck #MCLencolEDJTravesseiro https://t.co/kPOh5iGKUl O @fitdance e @BocaRosaBlog prepararam uma coreografia incrível de “MC Lençol e DJ Travesseiro\" para vocês! Bora aprender juntos? Eu assisti e ficou incrível! Obrigado Bia, Fábio e toda galera do Fitdance, vcs mandam demais!!! https://t.co/T7qDAhQyjd #MCLencolEDJTravesseiro https://t.co/S7uEgwH4HN RT @diario_doestado: Luan Santana lança clipe com participação de Tata Werneck #LuanSantana #MCLençoleDJtravesseiro #TatáWerneck https://t.… RT @correio24horas: Luan Santana e Tatá Werneck vivem romance em novo clipe do cantor https://t.co/nTmIkjDQs2 #Correio24h https://t.co/enwT… RT @MetroJornal_SP: Luan Santana lança clipe com participação de Tatá Werneck #MCLencolEDJTravesseiro\nhttps://t.co/QDp5xCwBxR RT @folha: Tatá Werneck faz par romântico com Luan Santana em novo clipe do cantor https://t.co/pMHjzRsJmP RT @DiarioPE: \"Por ela eu parei com os rolê, tô caseiro. Deixei pra trás o pegador, baladeiro\". 💤💞😎Luan Santana lança clipe com participaçã… RT @folha: 'MC Lençol e DJ Travesseiro' já acumula 380 mil visualizações\nhttps://t.co/pMHjzRKken Já viram quem deu show no clipe “MC Lençol &amp; DJ Travesseiro”? @clubsocial Crostini, valeu pela parceria galera! Foi demaaaais!  \n#MCLencolEDJTravesseiro #Clipenovo #ExperimenteCrostini #ClubSocialCrostini Assista: https://t.co/UbcqaiPiWl https://t.co/y2pT8hk2nM Assistindo o clipe de novo https://t.co/eBgxaxKVKZ #MCLencolEDJTravesseiro https://t.co/xQ9DjVKh0R Quando chega gif novo na nossa página @GIPHY https://t.co/aum4qaMANg https://t.co/n3SMoK0WyI RT @SabrinaSato: Hoje tem @luansantana e @micheltelo no nosso #programadasabrina . #RecordTV  @recordtvoficial @SabrinaNaRecord https://t.c… Tem música, tem videoclipe!! Agora é só ir correndo conferir: https://t.co/UbcqaiPiWl  e no Spotify: https://t.co/kykSDajhcn #MCLencolEDJTravesseio https://t.co/mwC7a0EFP2 RT @nanarude: SAIUUUU! O maravilhoso @luansantana acabou de lançar o clipe de “MC Lençol e DJ Travesseiro” com participação do ícone @Tataw… #1 galeraaa!!! Uhuuuu!! Assista: https://t.co/UbcqaiPiWl https://t.co/j5TxYXqDzv RT @atribunasantos: O cantor @luansantana se entrega ao amor em clipe com @Tatawerneck \n👉 https://t.co/18EAPkUuho\n#LuanSantana #TataWerneck… RT @iG: Hit! @Tatawerneck e @luansantana formam par romântico em vídeo clipe; assista → https://t.co/ktEzEQ4NHv #MCLencolEDJTravesseiro htt… RT @metropolitanafm: Luan Santana e Tatá Werneck protagonizam romance em novo clipe: https://t.co/WVM6l1Zmrq #MCLencolEDJTravesseiro https:… RT @FebreTeen: Luan Santana só quer saber de balada se for com Tatá Werneck em novo clipe: https://t.co/cwY4n1CtrY RT https://t.co/FQ2tOdAB… RT @Tatawerneck: Eba! Saiu o clipe com @luansantana  😍❤️❤️https://t.co/mabrOVsHEJ RT @carasbrasil: .@tatawerneck participa de novo clipe do cantor @luansantana e juntos fazem convite especial. Confira! https://t.co/NvsgAH… RT @todateen: Olha só o recadinho de @luansantana e @tatawerneck pra você! Luan lançou o cli... https://t.co/Idoyz5Vy8p https://t.co/hup1Dg… RT @g1poparte: Luan Santana atua em clipe de 'MC lençol e DJ travesseiro' com Tatá Werneck e atriz diz que música define seu... https://t.c… RT @POPline: . @luansantana tá todo James Bond no videoclipe de sua nova música (e todo casalzinho com Tatá Werneck). Veja: https://t.co/su… RT @Tatawerneck: Agora! Meio dia! O clipe do @luansantana que participei vai estar nas plataformas digitais (acho chiquerrimo falar isso ma… RT @portalmscbr: Não preciso nem dizer que o novo clipe de Luan Santana com Tata Werneck está divertido, né? Confira: https://t.co/HAfbaFj1… RT @todateen: Luan Santana lança clipe com Tatá Werneck! Vem conferir “MC Lençol e DJ Travesseiro” https://t.co/TyAXfyR5Tx https://t.co/0Hw… Assista agora!!! Videoclipe “MC Lençol e DJ Travesseiro” com a talentosa e linda @Tatawerneck https://t.co/UbcqaiPiWl #HojeMCLencolEDJTravesseiro Boraaaa assistir a live galera!! https://t.co/LfBypqAwF8 #HojeMCLencolEDJTravesseiro https://t.co/gYXGoEh3st RT @LuanAnjo10: @luansantana Só da Mc lançou e Dj travesseirooo AHHHHHH QUE LACREEEEEEEEEE😍 RT @FionaDoLs: Hoje é dia de divulgar a música , vou colocar para os clientes escutar vão ter que aprender comigo a nova música 😂😂😂 @luansa… RT @nacaometeoro: Em entrevista para a rádio Fenticeiro FM,  a dupla MC Lençol e DJ Travesseiro conta mais detalhes sobre o lançamento. Aco… RT @chamegomilk: Mc lençol e dj travesseiro é tão gostosinha, nunca julgue um hino pelo nome RT @1Mandylopes22: Meu Deus, to apaixonada pela música nova do Luan, socorro ❤️ RT @LuisaLive2: AHHHH ESCUTEM A MÚSICA NOVA DO LUAN PQP😍😍😍 RT @ArthurH68994957: A música nova do Luan ta incrível, hit certo nmrl, n é pq eu sou fã n RT @brendaleecec: caralhoo me amarrei na nova música do Luan Santana RT @danielanovaes__: Eu tô muito apaixonada pela música nova do Luan RT @tequeroloan: a música nova do luan tô destruída RT @crlh_nat: A nova música do Luan tá demais 🤤🤤🤤😍 RT @dalilagoulart_: Fui ouvi nova música do Luan foda mesmo RT @WhoisPontes: Eu amei a música nova do Luan Santana RT @madureiraclaraa: tô em um looping eterno nessa música nova do luan, viciei fácil RT @Isa_amaral03: TO NO CHÃO COM A NOVA MÚSICA DO LUAN, AMEI AMEI AMEI RT @daiysix: MEU DEUS A MUSICA NOVA DO LUAN É MUITO BOA KKKKKKKKKK RT @stefanysmelo: MANO EU AMEI ESSA NOVA MÚSICA DO LUAN SANTANA, PARECE Q VAI SER HIT MSM HEIN, tá mt boaa real Já disponível em todos Apps de Música \"MC Lençol e DJ Travesseiro\". Ouça, salve e compartilhe com os amigos. https://t.co/kykSDajhcn #MCLencolEDJTravesseiro https://t.co/BaCb7gyNRS Obrigado, galera! Foi demais ❤️#LuanNoTwitter https://t.co/FdbFCfVlPb .@LuanBebezao #LuanNoTwitter https://t.co/YM96PoN9Ig .@bagvalery #LuanNoTwitter https://t.co/R13FlRO23S .@intheluan #LuanNoTwitter https://t.co/G5cKbnnh44 .@eternizoulr #LuanNoTwitter https://t.co/axPMKfsuSh .@vickcabrini #LuanNoTwitter https://t.co/f9DhnDyfsx .@roselisalustino #LuanNoTwitter https://t.co/3FKLOTPEtK .@Celle_Bronzato #LuanNoTwitter https://t.co/EreuNhFCmj .@sereiadoluan #LuanNoTwitter https://t.co/oO4GLYiwPE .@ZueiLuanSantana #LuanNoTwitter https://t.co/6oOMP6fpkO #LuanNoTwitter https://t.co/Qu4ab8BWyO desviando o transito e chegando no twitter kkkk ja to usando gif #LuanNoTwitter https://t.co/Nvfpilci6M to chegandooo #LuanNoTwitter Galeraaaaaa, partiu twitter! Vai rolar um Q&amp;A às 19h e quero ver as perguntas de vcs. Mandem ver, usem a hashtag #LuanNoTwitter Live agora no @DeezerBR #MCLencolEDJTravesseiro  Corre lá no Facebook do Deezer! - Equipe LS https://t.co/Hkazvu3RT6 @amoteterls E sab e dom e segunda.. @amoteterls sextaaaa @FamiliaLsOf @UnicadoLuanR @DeezerBR me perdoa? tava trabalhando mto bb mas vo compensar RT @meteorinhadols: @UnicadoLuanR @luansantana @DeezerBR quem é twitteiro sempre aparece né não?! RT @UnicadoLuanR: @luansantana @DeezerBR o maior twitteiro ataca de novo @MarianaArgodins kkk hj vo pessoalmente twittar no twitter @SempreEstouAiLS @DeezerBR kkkk me espera bb @p0rvcluans @DeezerBR oi bb To chegando @DeezerBR me espera ae! Pega o lençol, já separa o travesseiro... literalmente! Hoje MC e DJ vão botar para quebrar a partir da MEIA-NOITE! Espero vocês na virada da minha nova música \"MC Lençol e DJ Travesseiro\" nos apps de música. Já fez o Pre Save? https://t.co/9Qsf5wK8Yh #MCLencolEDJTravesseiro https://t.co/U1F48eNqz8 Quem tá preparado pra live que rola nessa quinta? Todo mundo no Facebook da @deezerbr hein, a partir das 14h30! https://t.co/y0erhNwsGK Começa amanhã a divulgação de #MCLencolEDJTravesseiro. Não vou parar não, e quero vocês acompanhando tudo! Vou passar em escritórios/sedes de grandes parceiros! E dia 08, tem live de contagem regressiva, clipe (12h) e coletiva de imprensa! Bora que vai ser massa!! @Tatawerneck https://t.co/RtUqskXNHC #MCLencolEDJTravesseiro 08.06 às 12h no Youtube. @Tatawerneck https://t.co/eYWK3lQjcu “Mc Lençol e DJ Travesseiro” é minha nova música!! Dia 08/06, às 00h nos apps de música e às 12h o clipe no Youtube!! Faça agora mesmo o Pre Save! https://t.co/9Qsf5wK8Yh #MCLencolEDJTravesseiro https://t.co/6ZW0bd83aG @MariliaMReal Eu te amo ❤️ Segura essa bomba!! Vem aí “MC Lençol e DJ Travesseiro”. https://t.co/3FX4qCJ2hv https://t.co/gtlS9VtmVK Últimos dias para votar no “MTV Miaw” da @MTVBrasil. Você pode votar pelo site https://t.co/ANStQxL95L ou por hashtag, sempre usando #PremiosMTVMIAW  +  #MTVBRHINOCONTATINHO e #MTVBRKARAOKELUAN Quantas vezes quiser! - EquipeLS https://t.co/uZ4bVXz1cP Já ouviu #2050 hoje? Disponível em todas as plataformas digitais! https://t.co/kykSDajhcn - EquipeLS https://t.co/V5kngxumLC Quem está assistindo? #LuanNaEliana - EquipeLS https://t.co/vbrKBLz84c RT @RedeGlobo: Quem também amou a novidade? As tardes de sábado ficarão mais especiais com @luansantana e @EuFernandaSouza no comando! ♥ 🎶🔝… RT @ButterflydoRafa: @luansantana Delicia em ♥ https://t.co/wPF6nIPtTV RT @raridadeluans: @luansantana QUER QUE EU FACA UM CAFEEEE No momento: Café com óleo de côco, pimenta caiena, canela e cacau em pó 😏 https://t.co/qDgosoBOH0 kkkk to mto dedo nervosooo vo seguirrrrrrr @sonho_lr @admiroluan kkkkk to tranquilooo kkkk @admiroluan carne, quiabo, kkk @aoseranjo @nfoiporacasols acordei agora e vo almoçar e vc? @SoDeVcLS qd vc quiser bb, vem ca @nfoiporacasols perdao meu amorzerim, to fazendo 5 coisas ao mesmo tempo kkk @Teeh_Luanetee @luanbagual @anjounicoluan vamo @dreamsluaanjo @POPline @Tatawerneck falo bb, c ta bem? RT @POPline: &gt; @luansantana está todo James Bond nas gravações do clipe com @Tatawerneck. Esse é o primeiro clipe que a atriz participa. Co… @luanbagual @anjounicoluan kkkkk @anjounicoluan eu sei kkkkk =x @tuavozacalmals @seuolharlr @amuletwls verdade absoluta, t amo @seuolharlr @amuletwls isso eh verdade @amuletwls eu to brincando meu bbzinnn @_amantesdoluan vai vee to empenhado em vir aki toda hora, to mto twitteiro RT @semprevcluanjo: @luansantana @isacarrvalho Você aqui que milagre https://t.co/MTJoYEsfx4 @evelinecostals oi bb, ce ta bem? @isacarrvalho kkk sou ñ? kkkk chegou o maior twitteiro do brasil kkk boa tarde nação da twilolândia RT @eonlinebrasil: EITA! Luan Santana e Tatá Werneck gravam clipe em clima de pegação! Veja as fotos --&gt; https://t.co/9HOhdp2ta5 https://t.… RT @UOLEntrete: Com clima de 007, Luan Santana dá \"chega mais\" em Tatá Werneck em clipe  https://t.co/gdDboeRgkl RT @glamurama: Tatá Werneck estreia em clipe em clima hot hot com Luan Santana! https://t.co/M7ciSsniwh https://t.co/cZfr9c7Thg RT @carasbrasil: Luan Santana seduz Tatá Werneck em novo clipe. Veja mais fotos aqui --&gt; https://t.co/NAW9yAQhsA https://t.co/qqQKxPNkS1 Em breve novo videoclipe com música nova!! @Tatawerneck, você é um anjo! Obrigado por embarcar nessa comigo e trazer todo seu talento e energia pra esse projeto! https://t.co/zJBvhc21KJ Os meus maiores sucessos estão disponíveis no Spotify! E sabe o que é melhor dessa notícia? Que você pode ouvir tudo de graça, onde e quantas vezes quiser! É só baixar o aplicativo a App Store ou Google Play, logar e pronto! 👉https://t.co/4vRW5S5s39 https://t.co/ds7TxUiE9s Assista agora no YouTube o making of do meu clipe \"2050\", que está disponível com exclusividade na Apple Music! Depois de ver os bastidores, duvido você não correr pra ver o resultado final. Tá emocionante! 👉 https://t.co/0hGz1VRpj2 https://t.co/stQoquJg9O Já conferiu o vídeo de “2050” exclusivo para Apple Music? Uma nova versão esperando por você!Corre lá e me diz o que achou! #2050applemusic  https://t.co/XzrhgmAaJk https://t.co/XSfAtlVgDT #LuanSantanaNoTVZ RT @multishow: #LuanSantanaNoTVZ Partiu assistir ao lançamento do clipe novo de @luansantana hoje no TVZ? Então partiu! Te espero às 19h! ;… Hoje tem Luan apresentando o TVZ no @multishow !!! - EquipeLS https://t.co/I8LFZw6Uce Hoje, com @pabllovittar e @SimoneeSimaria, nos perfis da @CocaCola_Br e no @multishow! A partir das 20h! Todo mundo ligado! #FanFeat #LuanNoMultishow  #CocaCola https://t.co/IWuZ2E3U4P Hoje!! Ninguém dorme hein? #LuanNoTheNoite @DaniloGentili https://t.co/UkRsgaOm3c São 31 músicas em 1º lugar no país ao longo desses 10 anos, mas essa é especial. Que a 2050 inspire novos romances, fortaleça os q já existem e eternize todos eles. CONTINUEM PEDINDO EM TODAS AS RÁDIOS DO BRASIL 😍 #2050 torce pra você achar uma dessas. 🙏🏼🙏🏼🙏🏼 https://t.co/wYLzG2z9oJ @lscabrito pq tinha milho do outro lado @iwishluans eu te amo, n faz isso n @ShirleyCabreraa querooooo kkkkkk te amo https://t.co/FKnPfIoi6W 10 milhões de seguidores.. vcs que mandam aquiiiii @tereredolouan @seusinaislr @kccsIexie kkk pq vcs falam saco toda hora?.. saco! te amo... saco! @silviipavon5 COMIGOOO! te amo @forluanspaulac nao mais q eu @seusinaislr @kccsIexie to akii @anjounicoluan @tudoporvoceIuan falooo, amo vc @alt3meteoro kkkkkkk @luanwithyou te amo @bebezonadoluan sou mto desligado neh? @kccsIexie pqqq kkkk @my_heartls_ @benzaovesgo amo dmaisss @tudoporvoceIuan ki saco, mas to aki.. te amo @ikeepluan to bem e vc? @ShirleyCabreraa eu tb, q horas? @benzaovesgo tooooo kkkk @esmeuanjo kkkkk @lsmeutrembao td bem e vc??? @gameinosantana se fala: vc @escutoluan falo bb, hj eu vou recompensar a saudade, como c ta??? e olha quem apareceuuuuuu kkkk psiuuuuuuu Assista a “2050”.  Vídeo exclusivo da canção para @AppleMusic! https://t.co/0NNhmf8YXK  #2050AppleMusic https://t.co/L1syarXRs4 Agora sim!! Foram meses de votação e produção para essa música incrível! Conheça “Hasta La Vista”, o hit do FANFEAT @CocaCola_Br. Comigo, @pabllovittar e @SimoneeSimaria . Já disponível nas plataformas!! Acesse agora: https://t.co/CNaYTRiEz1  #FanFeat #HastaLaVista https://t.co/qpLaSOH3pn Hoje tem Programa do Ratinho, no SBT! A partir das 22h45. #LuanNoRatinho https://t.co/rbxXIfjrzx #LuanNoAltasHoras https://t.co/0VFANMshYZ Hoje tem Altas Horaaaaas!! #LuanNoAltasHoras Especial Luan Santana!! - Equipe LS https://t.co/iiytk9BaUN Vem votar galera!! A @MTVBrasil está de volta nas premiações com o “MTV Miaw”. Você pode votar pelo site https://t.co/ANStQxL95L ou por hashtag, sempre usando #PremiosMTVMiaw + #MTVBRHINOCONTATINHO e #MTVBRKARAOKELUAN Quantas vezes quiser! https://t.co/nL6Ebo6ADA Luan Santana com a Nova Turnê \"X\" no Rio de Janeiro! Ingressos à venda: https://t.co/ccAMoORMDP #LuanX #TurneX - EquipeLS https://t.co/S45NUOqbgi Hoje, no @showdavida. #LuanNoFantastico https://t.co/c2vnp69cv0 RT @multishow: 01 motivo pra você não perder nenhum segundo do #VaiFernandinhaEp05 de hoje? Que tal ter @luansantana como convidado, pagand… RT @multishow: O #VaiFernandinhaEp05 de hoje é com @luansantana! E adivinha? VOCÊ PODE ASSISTIR AGORA no #Multishowplay, antes de passar na… Gravação do hit mais esperado do ano @cocacola_br hoje 😍 com @pabllovittar @SimoneeSimaria #FanFeat vocês não perdem por esperar 👊🏼 https://t.co/ChD0XevLJ7 Ouça \"2050\" na Playlist \"Top Brasil\" no @SpotifyBR Acesse: https://t.co/hKkRSUZ6AX #2050Luan #2050Luan Assista o Lyric Video https://t.co/ekd9saCjPm \"2050\" está disponível na @AppleMusic !!! Confira a Playlist \"Melhores da Semana\" e ouça quantas vezes você quiser.  https://t.co/SmizQXdfZC https://t.co/nbHoaIQJsX RT @gshow: .@luansantana fazendo essa linda homenagem ao Elvis Presley! ❤ #DingDong #Domingão ❤ https://t.co/jii7s705hl RT @gshow: .@luansantana cantando música nova no #Domingão. 🙌 #DingDong https://t.co/YJx83xP6oT RT @gshow: Vamos acordar o #DingDong com @luansantana! 🙌 #Domingão https://t.co/a5lEiwhOw7 RT @gshow: .@luansantana surpreende cantando Elvis Presley no #Domingão https://t.co/nSkrWs7dxh #DingDong https://t.co/BCkhvfTjn4 Quem perdeu Luan no Ding Dong do Faustão? https://t.co/YrGRTa2zAK #Elvis #LuanNoFaustão #DingDong #LuanSantana Agora, no Ding Dong!! #LuanNoFaustao https://t.co/biwjfiagSL https://t.co/kykSDajhcn #2050 https://t.co/Meuat5TdLE #2050 https://t.co/ehrQjseWNl RT @luanprometa: #LuanNoFofocalizando RT @pfofocalizando: Chega logo, 3 da tarde! 😀 #Fofocalizando #LuanSantana #LuanSantanaNoFofocalizando https://t.co/8Zevo5xiAF Já segue a Playlist com os maiores sucessos do Luan selecionados? Confira “This Is Luan”. Siga agora: https://t.co/kykSDajhcn @SpotifyBR https://t.co/1BognOjFkC oiiiiiiiii 2050 nas plataformas! Ouça agora: https://t.co/bPCLcLrpXB  #2050 #2050NoTVZ  @multishow https://t.co/nHy3AxSlE8 Pra quem ainda não aproveitou, corra já pra @cacaushow . Você terá #AMelhorPáscoaDaHistória quando provar o Ovo Dreams Petit Gateau. EU AMO!!! Tá acabando, hein. 👀 https://t.co/aox82b5QVt “2050”, a nova música do Luan Santana. Ouça agora no Spotify!! https://t.co/kykSDaAS3V #2050Luan https://t.co/fiWRQirm8v Live na Tropical FM https://t.co/kvlrCUb5Mw Lyric Video Oficial de \"2050\". Assista agora! https://t.co/ekd9saTVdW  #2050Day Live na Nativa https://t.co/i3XECQ0uP8 Ouça agoraaaaa \"2050\": https://t.co/ke9A2NXkP4 #2050DePijama RT @LUANCINDERELO: 2050 é baseada em fatos reais #2050DePijama https://t.co/N58vkud6pc Agoraaaaaa #2050DePijama Vai começaaaaar! #2050DePijama https://t.co/Ecl8IrBReD Falta poucooooooo!!! #2050DePijama  https://t.co/sY6ynnDePW Live de Contatem regressiva para “2050” nas plataformas! Hoje, a partir das 23h40, no Youtube. Toooodo mundo de pijama esperando essa música.. ninguém dorme não! Quem vem? https://t.co/sY6ynnDePW #2050 https://t.co/89GfE8WtJF Vem se emocionar com essas histórias lindas!! “2050”, amanhã! Nas rádios e plataformas. Assista ao vídeo completo https://t.co/lvz5quONlr  #2050 https://t.co/j40fqqXV0T 🇧🇷!!! @FitDanceOficial @ThaynaraOG @CNCOmusic https://t.co/Qu7dKXb3kB 27.03, terça-feira, nas rádios e plataformas. #2050  Pre-save no @spotify, acesse: https://t.co/optm4Ec846 https://t.co/vgc8P0JFNg 2050 Vem aí, seja o primeiro a ouvir!! Pre-Save no @SpotifyBR.  Inscreva-se e seja notificado na hora:  https://t.co/qzRkFlJTok 27.03, terça-feira, nas rádios e plataformas #2050 https://t.co/kiUQfQU8Uw 27.03 https://t.co/0loZ2r5WfT Minha nova Turnê vem aí e você pode participar no telão!! Tire uma foto sua (Tipo 3x4) e poste no seu Instagram ou Twitter usando a hashtag #EuNaTurneXLuan. Minha equipe vai selecionar várias imagens e a sua pode ser uma delas. Tô esperando para ver a sua! https://t.co/VPLKWHkpEk RT @CNCOmusic: #CNCOwners no se pierdan en 5 minutos el LIVE desde nuestra cuenta oficial en Instagram! Estaremos transmitiendo junto con n… Assista “Mamita” https://t.co/MWRoavQaWg #CNCOFtLuanMamita Já disponível em todas plataformas RT @MomentsBrasil: ⚡Acorda que hoje é dia de hino! O @luansantana e os meninos do @CNCOmusic lançaram 'Mamita' &gt; vem saber mais! #CNCOftLua… @CNCOmusic #MamitaCNCOFtLuan https://t.co/CDPsw1OnJD RT @CNCOmusic: Nós aprendemos um pouco de português com nosso amigo @LuanSantana RT @SonyMusicRD: ¿Cómo se escuchará #Mamita en portugués? @CNCOmusic @luansantana  #CNCOwners https://t.co/NYhjYxZehw #MamitaCNCOFtLuan https://t.co/Mri14SSgEO Dia 23, sexta-feira, tem “Mamita”.. agora comigo! Convite especial dos meus parceiros do @CNCOmusic!! Não deixe de conferir!! #MamitaCNCOFtLuan https://t.co/eBhvTx8MTB Minha mais nova colaboração com a @Shell está no ar! Foi muito bom trabalhar com essas artistas incríveis! Compartilhe para ajudar a criar o futuro! #makethefuture https://t.co/W72I9uleJZ https://t.co/t3jof3UGBG Galeraaa, é isso mesmo que vocês estão vendo, na #PáscoaCacauShow, a grande novidade é o Ovo Dreams Luan Santana com recheio sabor petit gâteau. Cacau Show, eu preciso te falar uma coisa, tô apaixonado por você. 😂❤ @cacaushow https://t.co/zj2S9BN1RM @NovinhadoLuh pq? kkkk @Iuanswntana passa o end @sobrevivoluan ja tava loko pra voltar pra vcs bebezokas @luanjorei kkkk te amo @yourheartjeon comigo bb, t amo @anjometeor0 te amo mais @vickcabrini aki pescaaa @lsmeuinfinito kkkk tao prontu Vim agradecer as mensagens de aniversário. Senti vcs comigo mesmo longe daki! sempre sinto. Td dia! Amo vcs, obrigado ❤️ eeeei 😍 Turnê na Europa 2018!! Assista https://t.co/zX4gWhkAsk Acorda o prédio aí! Lançamento #COKEHIT da @cocacolashoes no site HOJE!!! Perde não galera https://t.co/kHGgwa9e2O #CocaColaShoes #COKEHIT #CocaCola https://t.co/0ExBPa4B3K RT @WORLDMUSICAWARD: Happy 27th Birthday #LuanSantana! @luansantana \n💖🇧🇷🎶🎼🎤🎂🎉🎁🎈🌟💫🎇 https://t.co/IRQdx3WBAZ RT @xanddyharmonia: Olha de quem é o dia hoje gente?😊 Amigo @luansantana, que Deus te dê muita saúde, paz e que vc realize todos os... http… RT @fc_luuanlovers: Parabéns, @luansantana obrigada por traduzir meus sentimentos em canções tão lindas. Obrigada por amizades que conquist… RT @luanprometa: @luansantana oi meu amor, obrigada por ter escolhido a música como profissão, eu te amo muito! ❤️ RT @carolcx_: Parabéns para o melhor cantor do universo ❤🎉🎈 @luansantana RT @bolinhodoslarry: Oi anjo! Parabéns pelo seu dia, e por todas as conquistas, não tenho palavras pra expressar o amor que tenho por ti, d… RT @tvaparecida: https://t.co/WMy6jT7vPK 😍 #LuanFaz27 Parabéns @luansantana que Deus te abençoe. Que tal relembrar sua história de devoção?! RT @t4f: Hoje é dia de muita alegria para um dos maiores artistas brasileiros da atualidade! Parabéns, @luansantana  ❤️  Desejamos tudo de… RT @_RdFarroupilha: Hoje o dia é dele! Parabéns @luansantana! https://t.co/GjFVC289cy RT @iG: O cantor @luansantana completa 27 anos com novos projetos → https://t.co/vtTiykwkqU #LuanFaz27 https://t.co/flq2nS04Bo RT @GazetaFMSP: Hoje é o dia do \"gurizinho\", #LuanSantana! 😍 \n#ParabénsLuan, nós da Gazeta FM desejamos que seu dia seja especial e repleto… RT @todateen: 7 coisas marcantes sobre o @luansantana que você precisa saber! https://t.co/DlZYPwxeI5 #LuanFaz27 https://t.co/zqYOss7bEr RT @caldeiraodohuck: Nesta terça, 13/3, @luansantana faz 27 anos e, é claro, que o #Caldeirão não poderia deixar esta data passar em branco… RT @todateen: 10 momentos que @luansantana demonstrou sua fé nas redes sociais https://t.co/HMPQicVfVR  #LuanFaz27 #bdayluan https://t.co/H… RT @ClaudiaLeitte: O parabéns é seu: tome! 🤣🤣\n\nO beijo, Príncipe! Que Deus te abençoe muito, viu? Tô aqui vendo nosso clipe pra matar a sau… RT @BruninhoeDavi: Esse dia é só seu, irmão! @luansantana Parabéns, mais uma vez! #LuanFaz27 https://t.co/rJm4NKwjHW Parabéns Luan!! Sucesso e muita saúde! Você vale ouro! - Equipe Luan Santana #LuanFaz27 https://t.co/248VoMuGMQ Vocês sabem que eu amo uma sobremesa, né? Ainda mais se for um Petit Gâteau. Juntei essa amor com a @CacauShow e tá aí a novidade da #PáscoaCacauShow: Ovo Dreams Luan Santana. 😋😘❤ Corra para a loja mais próxima!! https://t.co/CemQBy3G2u “Galeraaaa! A votação do FANFEAT tá acabando e eu quero muito gravar essa música para vcs! Compre agora sua Coca-Cola e vote em mim p/ estar entre os 3 primeiros e gravar o FEAT do ano. Conto com vcs na reta final! Boraaa!” #fanfeat #cocacola https://t.co/BqD5wBUrVx @CocaCola_Br https://t.co/9Z5Rqeso4w É com muita alegria que eu compartilho com vocês esse show incrível. Faça parte do #StudioCokeJeans, sinta e vista esse movimento. A coleção já está nas lojas e você confere todos os detalhes na @CocaColaJeans.  https://t.co/NOuIB43n8b https://t.co/SqYLojj1We E aí galeraaa! Já começamos a contagem regressiva para o lançamento da nova campanha #StudioCokeJeans da @CocaColaJeans! Acompanhem as redes sociais e participa comigo desse show. #CokeStar. https://t.co/ofleV3o15l Nova Turnê Luan Santana! Lançamento no Citibank Hall São Paulo, dias 31/03 (Pista) e 01/04 (Mezanino). Abertura das vendas em 20/02 (Pré-venda: 15/02). Não perca! @t4f #XLuan https://t.co/QNGMEjIb8m @landiaofficial e aiiiiiii bb @jjvivis2 falo bb, ce ta boa? @benzaosantana abraço agora meu amô @aboutyoubruan eu tb bebezoca @vcsdomeulado eu to bem.. to trabalhando, trabalhando e vcs amorss? eu disse q ia vortaaaaaa oi eh uma bbzona ❤️ https://t.co/Zg1v7SHjNq @vcluanjo vo saiiiiir princezosas eitaaaa https://t.co/DREQhqkQDq ❤️ https://t.co/Hw5DoAqi5f @luantrevo ah tem q ter, tem nao? ele eh gente kkkk @luanS_tudo @CocaCola_Br kkkkkkkkkkk neh @luanrafaminas vim votaaar com vcs, vou cadastrar o puff @oudeluan e num eh? vc! @tuamelodials kkkkk so sim Vcs são a latinha... eu, sou eu! E a @CocaCola_Br é quem vai fazer nosso encontroooo já já! Vem #FanFeat #CocaCola  https://t.co/BqD5wBUrVx https://t.co/XHqUFlQ8VL @ssuavozluanjo amooooo @ourangelrafael princesona @aogordols oiiiii @jeitols engraçadooooo, eu tbbbb @aogordols comigo bebê, te amo ❤️ @kissesantana te amoo @kissesantana CMG @inlovesantana @_estacaosantana vai sim bebe @tonantedols to aprendendo viu soh? @breathluanr falooooo @Iuandengo kkkkkkkkkkkk @_estacaosantana acordei agora @catarinensedolr sabia nao, ce repete? @admiroluan eu to bem meu bebezinn e vc? @tuavozacalmals vamo fala a gente não precisa ta colado pra ta juntoooooo.. “to vivooooo”!! Kkkk nosso tema do twitter saudade com to ppppppsssssiuuuuuu https://t.co/b3P3Y9lWGr Bora? #COKEHIT #CocaColaShoes https://t.co/jlxUG5ZCoA RT @NegodoBorel: Saiu!!! https://t.co/DKTt8wm2G1 #Contatinho https://t.co/FYiSYMHnei Saiuuuuu galeraaaa! Vem assistir “Contatinho” do meu parceiro @NegodoBorel https://t.co/DwuVC8uxzP #Contatinho Galeraaaaa, a votação do FANFEAT tá a todo o vapor e eu tô em 2º lugar neeeeste momento!! Bora subir? Compre sua Coca-Cola e me coloque entre os 3 primeiros para gravar o FEAT do verão! #FanFeat #CocaCola @cocacola_br Vote agoraaaa: \nhttps://t.co/BqD5wBUrVx https://t.co/38DWWs18DO RT @showdavida: Hoje é dia de dar check-in no #Fantástico! Tem @luansantana! https://t.co/B7XPf4YOu4 RT @showdavida: Já pode ir acordando o prédio... Domingo tem @luansantana no #Fantástico! https://t.co/btM2Jit25k #Luan2017 🍾Obrigado! https://t.co/LWbzQLIHBT RT @CocaCola_Br: O #FanFeat começou e você já pode votar nos seus artistas favoritos para o hit do ano. São 9 grandes nomes da música, mas… Bebendo e votando.. votando e bebendo! #FanFeat #CocaCola @CocaCola_Br https://t.co/ISsg7HxArc https://t.co/uNTjAt88E0 Começou! Foi dada a largada do Coca-Cola FanFeat e estou concorrendo com pessoas incríveis! Compre sua Coca-Cola e vote em mim!! Os 3 artistas mais votados irão gravar o FEAT do verão. Já achou minha Coca-Cola? Bora votar! https://t.co/ISsg7HxArc  #FanFeat #CocaCola @CocaCola_Br https://t.co/a1F6jxYq0x Toc toc, abra sua porta que o aniversariante do dia chegou pra comemorar com você 💫 FELIZ NATAL #FelizNatal #Natal https://t.co/CQjTaEYy31 É o Fandom da Década!! - @CentralDeFasLS  🙏🏼 @gshow https://t.co/SEQMXZAXkh RT @NegodoBorel: Minha nova música CONTATINHO, com o @luansantana, tá disponível aqui nesse link -&gt; https://t.co/sUnqEx2ulR #Contatinho htt… É isso mesmoooo, to procurando um Contatinho pra ligar, para conversar.. ! E pode ser você!!! Ouça Contatinho, acesse: https://t.co/q6GKwH6pi7 e tenha a chance de receber uma ligação minha! Bora? Vai com vc aí @NegodoBorel https://t.co/7GOMsccJ4Q Um fandom desses bicho! - Equipe LS https://t.co/sb1vxxUvew  #LuanSantanaFandomGShow @gshow https://t.co/SpC2jhzYN2 https://t.co/QIfCcJgTs5 https://t.co/Au9Hn1aD9U #CheckInLuan https://t.co/LMFH8lKVlK Música linda! Composição Luan Santana e Douglas. Assista: https://t.co/IgP0VBguv7 @edsonhudson - Equipe LS Mais Bastidores #CheckInLuan Assista: https://t.co/h2X76g9xqj https://t.co/FUgweFT3m5 Vooooota! https://t.co/kYTb0AbmVl https://t.co/DLfimRPqLD “Check-In” já está no Youtube!!! https://t.co/h2X76g9xqj. Também disponível nas plataformas de música. #CheckInLuan https://t.co/4hZa8MPP9k Temos Gifs de Check-In! https://t.co/2h9PH9nMpm #CheckInLuan Assista agora \"Check-In\", o novo videoclipe do Luan Santana!  #CheckInLuan #CheckInNoYoutube https://t.co/Au9Hn1aD9U 10 MINUTOS! #CheckInLuan Às 18h no Youtube! Videoclipe “Check-In”. Não perca! https://t.co/sY6ynnDePW #CheckInLuan https://t.co/3yUZGBKjjx RT @teamgauchols: @luansantana dando meu #CheckInLuan aquii ❤🙏 https://t.co/yflUM3nRqY RT @todateen: Luan Santana: nova música de trabalho, projetos internacionais e muito mais! https://t.co/Jq3EFKYlei https://t.co/EVvx3AgVjz @flyingluan @luansmemes posso saber pq vc nao acredita em mim? hein hein? #checkInluan @sinnerluan to tb.. #checkInluan @paredebrancalr to bonito? #checkInluan @ofluaanjo vo dah #checkInluan @luansmemes t amooooooo #checkInluan kkkkkkkkk #checkInluan https://t.co/Sh5mfPSlNw @luanzwra de jeito algum #checkInluan @nowayluan e ouvindo neh bebezona ? kkkk #checkInluan @kaumoraes_ eh nao #checkInluan RT @fuckluanjo: eu te amo MUTO! obrigada por ser um ídolo incrível, por sempre trazer coisas legais.. seja músicas, clipes, e ideias únicas… @teussonhosls @luanblessing booooooooooora #checkInluan @raisabessa te amo #checkInluan @admiroluan vamo levar mais essa #checkInluan @raisabessa amo vcs #checkInluan @luanblessing eu amo mto vcs #checkInluan @luanlacrador eu toooo, vc ta? #checkInluan @b_lsamordemais kkkkk vc q eh #checkInluan @kaisabelli to bao #checkInluan @luanprometa eu tooo #checkInluan ces tao ouvindo e votando ne bebes? coisas mais lindas #checkInluan vcs tao ouvindo mto mto? #checkInluan pq teu to faz horaa dou CHECK-IN aqui com vcssss kkkkkkk #checkInluan e CHECK-IN no.... #checkInluan eu dou check-out desse mundoooooo #checkInluan RT @DeezerBR: Apertem os cintos e se segurem nas poltronas, porque o @luansantana está de single novo! Sente o clima de pegação em \"Check-I… Todo mundo colocando na sua playlist? @SpotifyBR https://t.co/kykSDajhcn #CheckInLuan https://t.co/S0FPLtUsxc https://t.co/kykSDajhcn #CheckInLuan https://t.co/6RTjhS0h3p https://t.co/kykSDajhcn “Check-In”, já nas plataformas! #CheckInLuan https://t.co/UnQQ2KlDER Quem está assistindo a live no perfil do Spotifybrasil no Instagram? - EquipeLS? #CheckInLuan Correeee que vai ter teaser do clipe no Stories do @SpotifyBR !! - Equipe LS Check-In, você chegou!!! Ouça agoraaaa!! https://t.co/kykSDajhcn #CheckInLuan https://t.co/cP0D301BZ3 3 minutos!! - Equipe LS 40 minutos para Check-In!!! - EquipeLS #CheckInLuan Vem!!! Vai ter contagem regressiva do palco sim!! No Instagram do Luan e do @SpotifyBR - EquipeLS #CheckInLuan https://t.co/2UWRJP8LRq Quem está acompanhando o Stories do @SpotifyBR na Contagem Regressiva para a música a Meia-Noite? #CheckInLuan https://t.co/XyAwRQBLKX Hoje às 23h59, tem “Check-In” nas Plataformas de música! E amanhã, às 18h, videoclipe no Youtube! #CheckInLuan https://t.co/BoSkjIVZgA Direto de Recife para o Stories do @SpotifyBR!! Corre lá para conferir! Hoje tem música nova meia-noite! https://t.co/XMUMnxCJb6 Hoje!! Meia-Noite!! Tem “Check-In” nas plataformas digitais. Ninguém dorme aguardando esse HINOOOOO! - EquipeLS  #CheckInLuan https://t.co/HbmcAR9BL0 .@tocontigo https://t.co/BfDgdIo56b Começouuu! É sempre uma honra encontrar grandes nomes e amigos que foram destaque esse ano! Vambora? Conto com vocês! https://t.co/kYTb0AbmVl #TroféuDomingão @gshow https://t.co/sdHfHpoYvI Inesquecível!! Voo Luan Santana! Premiere “Check-In”. Dia 08/12, às 18h! https://t.co/ugbUpkoM1E #CheckInLuan @VoeGOLoficial @thermaswpark https://t.co/R7JsNk5Dwq #CheckInLuan 2 Dias https://t.co/wUsSj7A5kg Dia 08 às 18h!!! Check-In!!! Making Of no Youtube: https://t.co/a9zLn32NWo #CHECKINLUAN https://t.co/FHUskCvEgX @admiroluan oi oi oi @tudoporvoceIuan buuuu #checkinluan Quem quer Check Innnnnnnnn #CheckInLuan Saiu!!! Making of de “Check-In”. Assista agora no Youtube! Lançamento dia 08/12, sexta-feira, às 18h! Nas plataformas às 00h do dia 08. https://t.co/a9zLn32NWo #CheckInLuan #CheckInLuan https://t.co/foa3kSmlgM RT @gshow: Vote no #TrofeuDomingão @luansantana, @NegodoBorel ou @WesleySafadao https://t.co/FVl7a8OBGZ  #Domingão https://t.co/mk5IEbZvbS Gol, voamos alto ontem! De “Check-in” em  “Check-in”, levantamos um voo épico! Obrigado por embarcarem nessa  comigo! Já sabem, se precisarem... já tenho meu crachá! Obrigado German  Carmona e toda sua equipe. Foi incrível! @VoeGOLoficial https://t.co/ol0iMd9vQO RT @euleodias: Vai começar o VOO LUAN! Será que Luan Santana estará no avião? Hoje ele fará um show surpresa em… https://t.co/a5mUFxgYep RT @_DriBarros: Estou entrando no voo que será inesquecível. Um avião cheio de fãs do Luan Santana. Elas são super queridas e não tem ideia… RT @cleytu: Luan é muito meu bb #checkinluan https://t.co/1fiyZ9EO3D RT @Dudu: \"O Luan Santana conseguiu um marco na aviação\"\n\"Fazer um show para os fãs no ar?\"\n\"Não. Servir lanche num vôo da Gol\" \n https://t… RT @2d_daniell: Mano\nO Luan Santana é muito doido kkkkkkkkkk\nCara fez um show dentro dum avião kkkkkk 👏👏👏👏👏👏👏👏 respeito de maaaaaaaaais da… RT @carasbrasil: Luan Santana faz pocket show dentro de avião. Confira --&gt; https://t.co/OjuSbyFtxy https://t.co/VmVz7InRBx RT @quemacontece: Luan Santana faz show nas alturas e revela ter comprado um jatinho novo https://t.co/zOajRqjUaj https://t.co/7ZRSj5IDr1 RT @nanarude: OLHA QUEM CHEGOOOOU! 😍😍😍 Um comissário desseeees bixo!!! @luansantana #CheckInLuan https://t.co/nzKUwP4FTC RT @quemacontece: Vamos pras alturas com @luansantana como comissário de bordo! 😍 A cobertura vai rolar no nosso stories no Instagram ;) ht… 📍✈️ Que sucesso!! Mais de 2000 inscritos em 5 cidades em 6 horas! Estou ansioso por “Check-In”! Amanhã vocês “embarcam” nessa e assistem antes de todo mundo, em um CINEMA! Um voo só nosso! Dia 08/12, novo videoclipe! Espero vocês! #CheckInLuan https://t.co/MQBy9AfVEm Check-In!!!!!!!!!!!!!! 📍 eu sou  a p a i x o n a d o  por vcs  meu deus do ceeeeu como podeeeee, explica? Deus.. me explica esse amor? obrigado! amo vcs ❤️ q show vcs deram hj hein? 😍 RT @gabschneider_: valeu luan santana pelo tumulto junto a um dia de jogo do gremio no aeroporto. meus colegas tavam quase em posiçao fetal… RT @gazetadopovo: Concurso em aeroporto é a chance de fãs verem o novo clipe de Luan Santana com o ídolo: https://t.co/PgcoxJ3NS1 @guia_gaz… RT @nanarude: E esse babado do @luansantana no aeroporto, manas? Qual cidade será que vai ganhar? Já quero me tocar pra lá! #CheckInLuan RT @RadioWoodsFM: Vem aí “CHECK-IN”, novo videoclipe do @luansantana 😍 Com direito a CONCURSO CULTURAL em parceria com uma empresa aérea!!!… RT @mcountry: Luan Santana convida fãs para participar de lançamento do clipe “Check-In”! https://t.co/EIx4zKMpDx #MovimentoCountry https:/… RT @Estrelando: Luan Santana anuncia lançamento especial de seu novo clipe, Check In, saiba mais! #CheckInLuan https://t.co/MY1QNcaWMd http… RT @whynotmayara: E essa ação do Luan Santana nos aeroportos chamada Check-in para divulgar a nova música do cantor? ADOREI! 😆🤗 RT @smiilelr: e essa ação nos aeroportos que o luan santana tá fazendo pra divulgar sua nova música de trabalho que se chama \"check-in\" ach… RT @atrevida: O muso @luansantana divulgou a data de lançamento do clipe de \"Check In\"! Vem veeeer: https://t.co/lXEFuuaJpu https://t.co/F6… RT @RadioWoodsFM: Hoje é dia de CHECK-IN do @luansantana em vários aeroportos do Brasil 😍 Olha só como ficou o aeroporto de Curitiba!! Qual… https://t.co/mVYcag9jn5 #CheckInLuan Vem aí “CHECK-IN”, meu novo videoclipe! 08/12. A @voegoloficial e @thermaswaterpark vão levar um avião inteiro para assisti-lo em primeira mão no RJ! São 5 máquinas de Check-Ins no BR! Acesse meu site e saiba como participar! https://t.co/optm4Ec846 #CheckInLuan https://t.co/AVebpKRwVI A primeira de Check-In! Vai começar! - Equipe LS  https://t.co/ExqE1oadxF https://t.co/WlxSeoScKh RT @LuanSantanaShop: #BOXLuanSantana10anos https://t.co/jzMAwiMSGp Está no ar!!! Minha BOX especial 10 anos tem CD exclusivo + Livro Oficial da minha carreira com fotos inéditas. Corra na @LuanSantanaShop e adquira o seu!! É Black Friday e o site está cheio de descontos! https://t.co/3ak4lncn63 https://t.co/xEEyywyCjv Hojeee! Meio-dia!! https://t.co/3ak4lncn63 #BOXLuanSantana10anos https://t.co/gvcGTBoobl RT @LuanSantanaShop: Bom dia FANDOM MARAVI! #BoxLuanSantana10Anos https://t.co/rlYo2npc3f #LuanSantanaShop @LuanSantanaShop https://t.co/8BNCgQXfk3 #LuanSantanaShop https://t.co/3ak4lncn63 https://t.co/ySpIv8yPCO RT @CentralDeFasLS: Link para assistir: https://t.co/2ZrL1dWxTv Começou o show!! RT @CentralDeFasLS: Olá amigos!! Tem Luan no Villa Mix já já! Quer conferir? Tudo ao vivo no Youtube: https://t.co/2ZrL1dWxTv #VillaMixLive Daqui a pouco é nois ao vivo no VILLA MIX MARATONA DA ALEGRIA NO RJ! Acompanhe aqui : https://t.co/8gKfGcNNQH 😍 vejo vcs daqui a pouco 😘 Ooooi amooors BOX 10 anos especial! Exclusivo na https://t.co/8lLPl2AMRR. Contagem regressiva!! #LuanSantanaShop @LuanSantanaShop https://t.co/itnQnbHXoY Ontem o Caldeirão exibiu também (em algumas cidades) a história do violinista Wellington Ismail. Se você não conferiu, veja agora! https://t.co/w57MIqlW2n #LuanNoCaldeirao RT @NickelodeonBR: Pera lá, é o @luansantana ganhando mais uma cesta de zeppies! Ele é o recordista de zeppies ganhados na história dos Meu… Perdeu @caldeiraodohuck? Veja! https://t.co/1vHiHniGtl #LuanNoCaldeirao RT @NickelodeonBR: O grande dia chegou: você vai ver a transmissão do #MPN2017 na TV! Prepare-se para surpresas, diversão, brincadeiras e m… RT @RedeGlobo: Quem é lindo, talentoso e faz o bem levanta a mão! o/  #Caldeirão https://t.co/NElIBQv9RB Quem está assistindo @caldeiraodohuck aí?? #LuanNoCaldeirao - EquipeLS Amanhã tem Luan no Caldeirão do @LucianoHuck . A partir das 15h50, na Globo. - EquipeLS https://t.co/pS5qZBSHaD “Acordando o Prédio” ganhou HIT DO ANO DO BRASIL, VIDEOCLIPE BRASILEIRO FAVORITO.. e eu memo, CANTOR FAVORITO, no Meus Prêmios Nick 2017!! Obrigado! Amo vocês! #MPN @NickelodeonBR https://t.co/5Z5ubgWoOy Vem ouvir “Acertou a Mão” no @SpotifyBR!! https://t.co/kykSDajhcn - EquipeLS @meucrushluan amar vc @luanvitorioso eh seu aniversário? @SonhoComLuanLS kkkk vamooo @iluminaluanjo ainda nao bebe e vc? @anasilviaa_ vai dar namorooo kkkk @luanstesouro to aki ainda @jeitols cmg, te amo @pedidoluan Kkkkk ta @mineiraadoluan naooo sumo @lovelscl ainda nao, fala de novo? @Nandadionizio13 gostei hein eu to com saudade de vcs, to sim RT @DeezerBR: Tá no ar a playlist exclusiva #DeezerMoods com o lindo @luansantana! Vem ouvir: https://t.co/pOBXJggDcV https://t.co/DKIxp2C7… Agora temos perfil oficial de gifs no site Giphy! ;) https://t.co/GuKIAebheu  Vem conferir!! - EquipeLS https://t.co/8B76uqMcLS Galeraaa, fiquem ligados que tem novidade da @jequiti chegando! Meu novo perfume vem aí! 🎙#SonhaQueDá https://t.co/j5n9aJ9451 Tem novidade no #AppDoLuan https://t.co/b3P3Y9lWGr https://t.co/2RNyCWSWsZ (Equipe LS) -- Alguém dos EUA por aí? Estão preparados pra uma Turnê em 2018? Em breve, voltaremos com mais novidades. #LuanNoAltasHoras https://t.co/Xusz91LTHE RT @gshow: Peraí, eu ouvi @luansantana feat. @pabllovittar?? É isso mesmo! Só no #AltasHoras desse sábado! Se liga: https://t.co/8PAjlpwAZp… https://t.co/b3P3Y94lhR #AppDoLuan https://t.co/S2HsSo06Qe Entregando o Twitter do Luan!! Vocês são demais!!! Obrigado!! - Central de Fãs LS N O S S O ! ! ! N O S S O! É  N O S S O! Estamos aqui ainda! E vocês? #MelhorClipeTVZLuan Tão linda Marília #MelhorClipeTVZLuan O 388º prêmio! #MelhorClipeTVZLuan  hahahahahahahaahahahahah Todo de vocês! Vocês que votaram. #MelhorClipeTVZLuan Pode comemoraaaaaar genteeeee! #MelhorClipeTVZLuan É LUAN!!! É LUAN!!! #MelhorClipeTVZLuan Uhuuuuuuuuu #MelhorClipeTVZLuan Genteeeee #MelhorClipeTVZLuan Tô no chão #MelhorClipeTVZLuan Vamo acordar esse prédiooooo #MelhorClipeTVZLuan Eu você o mar e elaaaa  #MelhorClipeTVZLuan Chuvaaaaaa de arrozzzz #MelhorClipeTVZLuan Amo / sou esse cabelo #MelhorClipeTVZLuan E esse ballet, bichoooo?? #MelhorClipeTVZLuan Tuita aí! #MelhorClipeTVZLuan Escreve aí #MelhorClipeTVZLuan Que lindoooo #MelhorClipeTVZLuan Nosso momentooooooo #MelhorClipeTVZLuan Voltaaaamosss! #MelhorClipeTVZLuan Nervouser demais #MelhorClipeTVZLuan Prêmio Luan Santana da Música Brasileira! #MelhorClipeTVZLuan Eitaaaa Brasil #MelhorClipeTVZLuan Sandy, sobre os Prêmios: Saiba eu sempre to aí, mesmo sem estar.  #MelhorClipeTVZLuan Pesquisa!! Vocês votaram pelo site também? #MelhorClipeTVZLuan A gente vota muitoooo com emojis #MelhorClipeTVZLuan Aparece emoji no voto! Luan versão Mariela com faixaaaaa #MelhorClipeTVZLuan Vamos dar print e montar galeria no Linkedin. Vida que segue! #MelhorClipeTVZLuan Intervalo para votarmos aqui.. todos comentando com hashtag o pq Luan não deve nos demitir depois de hj #MelhorClipeTVZLuan Que horror nego.. quebra nada não meninoooo #MelhorClipeTVZLuan Agora vamos votaaaaar?  #MelhorClipeTVZLuan Um publicitário desses bicho? Tombada estou #MelhorClipeTVZLuan Bem que ouvi um grito de guerra “O REI CHEGOU!” #MelhorClipeTVZLuan Meu Deus, vejo um REI #MelhorClipeTVZLuan Luan é o poder, novo slogan #MelhorClipeTVZLuan Vamos falar apenas ditos populares do Twitter durante essas horas #MelhorClipeTVZLuan Luan, não demite a gente! #MelhorClipeTVZLuan Nervouser #MelhorClipeTVZLuan Tem gente prontaaaa!!#MelhorClipeTVZLuan https://t.co/SoysZ5kuE0 Quais as apostas de vocês para os Prêmios do Luan? #MelhorClipeTVZLuan Todos ou Todos? hahahahahaha Começoooooou! Vamos usar a hashtag até o programa acabar! Não pode parar não. Vem fandom!! #MelhorClipeTVZLuan Galera! Central de Fãs do Luan  invandindo aqui. Vamos agitar a conta do Luan enquanto rola o Prêmio! Vem com a gente. #MelhorClipeTVZLuan @luanprometa Aiiii ai ai ai ai ja ja #MelhorClipeTVZLuan @LuaneteDoGordo Grava de outro celular, coloca no viva voz #MelhorClipeTVZLuan Kkkkkkkkkk #MelhorClipeTVZLuan https://t.co/A4PaV3dbNP #MelhorClipeTVZLuan manda maaaaais  #MelhorClipeTVZLuan Tenho 16 mil opções pra ligar. To bem kkkkk #MelhorClipeTVZLuan Batalha do Luan (eu)! Amar não é Pecado X As Lembranças Vão na Mala. 1,2,3 e... já! Usa a tag aí na resposta! #MelhorClipeTVZLuan Me arrumando e votando, votando e me arrumando #MelhorClipeTVZLuan pq não posso usar 5x a hashtag no mesmo tweet e votar 5 vezes de uma vez só? #MelhorClipeTVZLuan oO coloquei o post la em cima pra vcs deixarem o nome no jeitoooooo.. #MelhorClipeTVZLuan vo seguir mais peraaa #MelhorClipeTVZLuan histórias de pescador? #MelhorClipeTVZLuan RT @teusinaisls: @luansantana Não, vc é ruim nisso #MelhorClipeTVZLuan Kkkk vou contar piada, pode?  #MelhorClipeTVZLuan RT @lsprecioso: @luansantana FALA QUE ME AMA #MelhorClipeTVZLuan RT @luanshades: @luansantana Pode fica so respirando kkk #MelhorClipeTVZLuan RT @p0rvcluans: @luansantana MANO ME LIGA #MelhorClipeTVZLuan RT @ls_meucaminho_: @luansantana Conversar mesmo feito dos friend #MelhorClipeTVZLuan O que vcs querem que eu faça na ligação? cante? #MelhorClipeTVZLuan eu cantoooo Depois do Prêmio falo quem foi escolhidoooooo tchan tchan tchan tchann #MelhorClipeTVZLuan Coloca o número não gente kkkkk vo pegar por DM #MelhorClipeTVZLuan RT @rsteamanego: @luansantana MARIA LUIZA / IMBÉ/RS #MelhorClipeTVZLuan RT @onetimeluan: @luansantana Jéssica, Quixadá-CE PELO AMOR DE DEUS ME LIGA EU TE AMO MAIS QUE TUDO #MelhorClipeTVZLuan tooo agitado neh? kkkkkk  #MelhorClipeTVZLuan Vo escolher um fã q deixar resposta nesse tweet com a tag.. Coloque nome e cidade, vou LIGAR!! Pego tel por DM! #MelhorClipeTVZLuan  Bora! to achando tao incrívell vcs votandooooo desde manhã #MelhorClipeTVZLuan toooo ficando bonitooo kkkk  #MelhorClipeTVZLuan to no hotellll #MelhorClipeTVZLuan To seguindoooo, sou lerdo mas to seguindoooooo  #MelhorClipeTVZLuan deixem o user aqui que volto com calma e sigo quem eu conseguir! usem #MelhorClipeTVZLuan @meuxamegols voooo #MelhorClipeTVZLuan @poramorluann bonitinha  #MelhorClipeTVZLuan @flyingluan tooo dmais e vc? #MelhorClipeTVZLuan quem ta votando com a hashtag aí? #MelhorClipeTVZLuan psiuuuuu #MelhorClipeTVZLuan #MelhorClipeTVZLuan https://t.co/IJJzdq3r4m #MelhorClipeTVZLuan print, prontoo https://t.co/1iPwep3Yyz #MelhorClipeTVZLuan https://t.co/oAl3wp2cQv Ihhh nao foi o video #MelhorClipeTVZLuan Kkkkkk por favor @NegodoBorel, estou concentrado #MelhorClipeTVZLuan https://t.co/Go0JZdk1oB 😍❤️ https://t.co/kbAo6YXGhw RT @stayluanrds: @luansantana Pisa menoooos rei Santana #MelhorClipeTVZLuan RT @METEORODAPAlXAO: Quinhentos mil twittes com a tag e ela nos treends desde de quando liberou VC quer união e lacre @ #MelhorClipeTVZLuan e outro pra esse fã clube fodaaaaaa #MelhorClipeTVZLuan E outro pra mim #MelhorClipeTVZLuan Outro pra vc #MelhorClipeTVZLuan Um voto pra vc #MelhorClipeTVZLuan @team_lrds tooo votandoo aki #MelhorClipeTVZLuan @_sweetluan ahhhhhhhhhh to kkk #MelhorClipeTVZLuan alguém me chaaaaaaaamou? volteeeeei #MelhorClipeTVZLuan https://t.co/HMrhp29rMk #MelhorClipeTVZLuan Hoje! https://t.co/DsmZl5uCok amo vcs #MelhorClipeTVZLuan @hugsmels Vc existe! e eu sei #MelhorClipeTVZLuan RT @KarolyneRafael: Obrigado por tudo! Principalmente por tirar um sorriso meu todos os dias! Te amo @luansantana \n#MelhorClipeTVZLuan RT @0rgulholrds_: @luansantana Nunca vou conseguir retribuir tudo q vc ja fez em minha vida #MelhorClipeTVZLuan RT @amotuls: @luansantana Me abraça bb, tudo é por amor, tudo por você #MelhorClipeTVZLuan vo da uns rt, pera kkk  #MelhorClipeTVZLuan obrigado, de verdade #MelhorClipeTVZLuan eu vejo vcs votando e da vontade de abraçar todo mundo #MelhorClipeTVZLuan soh comemorar neh? #MelhorClipeTVZLuan  clipãooooo participação massa do @whindersson, parceiro demais! #MelhorClipeTVZLuan foi um clipe tao divertido, alegre.. diferente de tudo.. #MelhorClipeTVZLuan to assistindo de novo “acordando o prédio” e passa um filme aqui #MelhorClipeTVZLuan @eiluanj0 kkkk vortamooo #MelhorClipeTVZLuan @feitopramimls oiiiiiiii #MelhorClipeTVZLuan @issoqueeamorls kkk ta, vo lindao #MelhorClipeTVZLuan @issoqueeamorls to bem amor e vc? #MelhorClipeTVZLuan @meteorodors ainda nao, tava dormindo de novo kkk #MelhorClipeTVZLuan boraaaaaa #MelhorClipeTVZLuan to aki de novo votando com vcs #MelhorClipeTVZLuan @iprotectluanjo to aki #MelhorClipeTVZLuan @SilviaM12208032 com fé em Deus #MelhorClipeTVZLuan @prometoamarls acho massaaaa #MelhorClipeTVZLuan @FernandesNota10 Ihuuuuuuuu #MelhorClipeTVZLuan @paradals eu amo mais! #MelhorClipeTVZLuan RT @multishow: Quer que o @launsantana leve o melhor clipe TVZ? Use a tag #MelhorClipeTVZLuan pra votar no cantor! https://t.co/puhLuK5BTS prometo vir aki o dia inteiro votar tb  #MelhorClipeTVZLuan vai ser puxado o dia mas vou tentar de vez em quando passar aki, fechô? ceis tao votando mto neh, suas bebezonas #MelhorClipeTVZLuan tamo em primeirooooo nos TTs 😳#MelhorClipeTVZLuan vcs sao f******* mesmooooo hein #MelhorClipeTVZLuan toooooooooooooooo prontooooo #MelhorClipeTVZLuan Vote “Acordando o Prédio” no Prêmio Multishow para Melhor Clipe TVZ com a hashtag #MELHORCLIPETVZLUAN Use qts x quiser! Dê RT e divulgue ;) Vem @multishow  https://t.co/SnIgMlmSt8 https://t.co/NFtquRBL1u Você pode acompanhar todos os meus passos através do Messenger com o meu BOT!! Clique e comece agora! ;) Vem! https://t.co/gSLzlwKIiA https://t.co/3JznLgdfG0 Hojee! Peça na sua emissora favorita! “Acertou a Mão”. #AcertouAMao https://t.co/WcKxhnPDws #LuanSantanaNoLadyNight Confira, com exclusividade, o making of do meu novo clipe no perfil @sorrisobrasil (No instagram)! Corre lá! #VeraoComSorriso https://t.co/QiMVxPnbIk RT @Tatawerneck: Hoje tá imperdível! Tem o talentosíssimo e mais fofo do mundo @luansantana as 23 horas no #ladynight https://t.co/fwjfH31q… Hoje!! A partir das 23h! #LuanNoLadyNight Com a minha amiga gata e talentosíssima @Tatawerneck. Perde nãooooo!! Tá demais!! https://t.co/6RVwL11kiF RT @Tatawerneck: Hoje tem @luansantana maravilhoso no #ladynightep07 😍❤️❤️ https://t.co/LIoafseDM6 RT @Tatawerneck: Hoje tem @luansantana no #ladynightep07 https://t.co/mSG4FUiiy9 Gente, o @DeezerBrasil “Acertou a Mão” na playlist Sertanejo Apaixonado. Vem ouvir minha nova música por lá: https://t.co/m6jGUoE1DU 💙 https://t.co/k8qOGkQX8K https://t.co/NdjAXyhRB6 Saiuuuuu! Todo sucesso @luisasonza. Confira galera! https://t.co/5tXgYv1Yb5 #ClipeLuisaeLuan RT @meioemensagem: Para conectar consumidores e marcas por seu trabalho, Luan Santana destaca que espontaneidade é essencial. https://t.co/… Siga a playlist This is: Luan Santana, no @SpotifyBR e ouça \"Acertou a Mão\". https://t.co/09YQ3m0Qmf https://t.co/qfeii3NMs0 Já assistiu “Acertou a Mão” hoje? Clique e assista agora. https://t.co/9rKiLG0DKR #AcertouAMao https://t.co/WeqVda3X3g RT @DeezerBR: ❤️ Quem fez o seu sorriso, acertou a mão ❤️ Vem ouvir essa música coisa + amor do @luansantana pro seu dia melhorar https://t… RT @DeezerBR: O @luansantana passou por aqui hoje e já deixou saudade! Mas ainda da tempo de ver a Live dele no nosso Facebook: https://t.c… sou tão privilegiado!! Obrigado... vcs são a extensão do amor pelo q faço, o combustível pra continuar mais e mais, amo vcs! quero agradecer vcs... eu agradeço em oração tds os dias mas quero deixar aqui registrado. vejo vcs votando, dando replay em clipe, música @cabrall_ls 7% de bateria e 100% de amor aki @escutoluan eu tb bebe kkkkk @Floco1991 abençoado, agradeço tds os dias @mmoraizs @natalense_dols jaaa.. quero mto amor @anjoloam sempre.. sempre fico ansioso @natalense_dols o tempo! mal dormi em 4 dias.. ida e volta colômbia e gravar mto durante 48h @nfoiporacasols @ls_meuencanto vcs pensaram q ia ser pegacao ne @stainedluan dessa bebe? a próxima eu mudei de nome 2x kkk @_naclara__ @surrealuanjo todos são especiais, impossível escolher um @frasespropi e vc eh linda @LSMINHABUSSOLA1 gostou amor? @surrealuanjo ó kkkk meu próximo check in será num colchão! fica no ar aiiiiiiiiiiii a pista @ls_meuencanto eu só tenho q agradecer.. o importante eh que vcs gostaram @ls_meuencanto na verdade foram quase 4 milhões, é o contador q não colabora! kkkk @coracaodeanjols sim, queria exatamente isso.. uma música pra curtir e um clipe para curtir a música. Deu certo? @BranquinhoLsFc chegou a hora amor, te amo @NegaDeUmAnjo @FcEFLS Converso mto com o diretor e tb dou alguns pitacos.. é mto bom esse processo de criação @uaaisantana Foi um desafio gravar 2 videos em 2 dias. Geralmente temos 2 a 3 diárias para 1 clipe só. Mas deu certo! 🙏🏼 @itsmyanjolr_ q nasci pra isso. Que posso contar com vcs comigo pra tudo! Amo vcs! @ttesourolrds kkkkk ❤️ @gameinosantana acerteeeeeei @sweetsantanaa tava no banheiro amor, desculpa @biaa_ls26 @meudante_ls to pronto pra falar.. te a m o @meudante_ls te amo te amo te amo @mineiradolrds eu t amo bem mais.. @aqueleluanatico @joanascfc mais do q vc imagina @_GabysDantas vai estudarrrr @joanascfc Te amooooo @joanascfc COMIGO @wishsantana parabens nenem escrevi td errado mas nao vou deletar.. kkkk clica de novo https://t.co/TB9UFbQISe quero vem ver clica aqui correndooooooooooo https://t.co/TB9UFbQISe Olha quem ta aki kkkkk https://t.co/NYINO9kiFI @luanprometa eu imagino pq te amo mais @thais5hls Falo amor @pq_isahh E vc eh linda @rayssaw_luan Aaaah bebeeee vc eh uma bebe @willian_ls7 gostou amor? @oudeluan to de passageiroooo opaaa @eternosufoco sempre neh kkk Comos ceis tao? Td certo? Acertando a mao no play ai? Kkkk Pera ai gente, to no carro e tava postando Cheeeeeeeeeeegaaaaamos! RT @DeezerBR: Vem que tá tendo @luansantana AO VIVAÇO no nosso facebook respondendo todas as perguntas dos fãs! https://t.co/Bctpuaaf0O htt… Rolando Live no Facebook do @DeezerBR. https://t.co/2giaPRZXJi #AcertouAMao 👉🏼🎯👋🏼 https://t.co/TB9UFbQISe #AcertouAMao RT @caldeiraodohuck: Com novo visual, @luansantana doa cabelo cortado para instituição! Entenda a história: https://t.co/Dcs6TBMpDF #Caldei… Acertou a Mão!! Já no Youtube https://t.co/TB9UFbQISe #AcertouAMao Hojeeeee! #AcertouAMao - EquipeLS https://t.co/3A7fZVuqxY RT @luansantana: Assista agora o novo videoclipe “Acertou a Mão”. https://t.co/TB9UFbQISe #AcertouAMao Assista agora o novo videoclipe “Acertou a Mão”. https://t.co/TB9UFbQISe #AcertouAMao Luan no palco do Domingão do Faustão. #AcertouAMaoLuan Vem clipe!! #AcertouAMaoLuan É hoje!! Às 19h, no Youtube. Videoclipe “Acertou a Mão”. Música já disponível nas plataformas. #AcertouAMao https://t.co/L1uip0GJiK Hoje tem o último teaser de “Acertou a mão” com exclusividade no #AppDoLuan às 12h. Baixe agora: https://t.co/b3P3Y9lWGr - EquipeLS É hoje!!! “Acertou A Mão”, às 19h, no Youtube. Já ouviu a música? Corre para sua plataforma preferida. Já está disponível. #AcertouAMao https://t.co/9klYmpL7IG Oi Apple Music! https://t.co/j554bElElV Galera, fica ligada que amanhã no Youtube estreia meu novo clipe ”Acertou a mão”. Às 19h! Vai ter muito Sorriso envolvido. #VerãoComSorriso https://t.co/uHDsoEG8UK Amanhã, “Acertou a Mão”. Música nova, clipe novo.. com todo carinho para vocês!! Às 19h, no Youtube.  https://t.co/E6Xo6IKXVQ #AcertouAMao https://t.co/OSx3XwPUng Levanta desse tombo Twitter! Às 13h sai mais um teaser exclusivo no Instagram do Luan!! - Equipe LS Dia 09 vai rolar uma live na página da @DeezerBR. A partir das 15h15. Então já corre pra curtir a fanpage no Facebook! https://t.co/evdkDGTKcY E tem “Acertou a mão” durante a segunda, 09. Tem cobertura com fotos e transmissões no #AppDoLuan. Já baixe agora: https://t.co/b3P3Y9lWGr https://t.co/Sxds2I9wDA https://t.co/g33fkPTuex @meioemensagem #MaxiMidia2017 https://t.co/qLDBO6zZJS @TerraNoticiasBR https://t.co/9NcEerDKEB @sitevagalume Domingo, 08, tem novo videoclipe! “Acertou a mão”, às 19h, no Youtube. #NovoClipeLuan  #LuanSantana https://t.co/tzaULMP4qA Galeraa!! Tô mto chique no cartão, fala ae! 🤣 Já pediram o de vocês? https://t.co/CZpkVX1ltw #EuPossoZuum #EuPossoZuumLS @eupossozuum https://t.co/vRzicLGfRd Novidade no App! Corre pra ver galera!! https://t.co/b3P3Y9lWGr https://t.co/FpPXIXv7qy RT @PremioJovem: Melhor cantor eleito pela galera é @luansantana​! Parabéns! #PJB2017 #LuanSantanaNoPJB #LuanSantana https://t.co/1H9P9fdByM Eu e galera da Vital Cap, queremos ler vocês! Tamo esperandoooo lá na página https://t.co/AQleWDv8FB 😉 #SoltaACabeleira #LuanSantana https://t.co/2BCVCLKIon É cabelinho..chegou sua hora meu companheiro..agora você vai alegrar a quem realmente precisa. @lucianohuck vamos à missão meu parcero! 👊🏼 https://t.co/EHCAlKqdtO Chegou o grande dia!! Com vcs, “Eu Posso Zuum”. O cartão 3 em 1 que é conta digital, compras e clube de vantagens. https://t.co/CZpkVX1ltw https://t.co/Fp0ysx9C5Y Heavy Metal?! Ah, era fomee! Galera do Metal, vcs mandam bem! E vc? Como fica quando está com fome? Exagerado? Dramático? #ComeUmSNICKERS! https://t.co/soTy16PG1W @angraofficial 🤘🏼 De novo, Melhor Cantor! Obrigado a todos que votaram! Valeu @PremioJovem 2017 https://t.co/ij2ZXkMg9S “1977” indicado ao @LatinGRAMMYs. Obrigado!!! 🙌🏼 #LatinGRAMMY 10 anos de Sertanejo. Decidi que a partir de hj vou me dedicar de corpo e alma ao estilo que eu realmente amo, o heavy metal. #LuanDoMetal https://t.co/pk3oHQl5M4 Das modas de viola para os riffs de metal. Vem novidade por aí... 👊 💀 https://t.co/q5dXO0jAZF Vem ver o Show na Villa Country! https://t.co/AqWmfbU0Tn Correeee! #AppDoLuan https://t.co/b3P3Y9lWGr https://t.co/9kveDllvrz RT @NickelodeonBR: Vote na música #AcordandoOPredio como o \"Hit do Ano Brasil\" no #MPN! Use as hashtags #MPN + #AcordandoOPredio nos tweets… RT @NickelodeonBR: Se o @luansantana é o seu Cantor ou Dupla do Ano Favorita, vote AGORA! Use #LuanSantana e #MPN nos seus tweets! 1 RT = 1… RT @villacountry: 🎶Na próxima quinta-feira (21/Set) vai ser você + Luan Santana + Villa Country vivendo uma noite especial! Vem que... http… @conectadasdolu kkk vo sair amor, um beijo pra vcs! @mencantals saí kkk @IuanSantanaMG @luanjobenzao aceito, pq nao? kkk @_GabysDantas faculdade ... pq agora ja falei. vaii! @teusinaisls facil eh meu amor por vc (ó..... kkk) @aoluanjosz agora bebe, to saindo pra trabaiá @meubemmaiorlrds amo mesmo @alt3meteoro kkk to confuso @mocaprnambucana nao permito @jeitols vem k @opsgurizinhols o povo clama kkkk @MeteoroCabello e vc o meu @wholaaura @fcluanrlove voooooo @unicokeaton parem de falar assim kkkkk @secrectluans ceis para de falar isso... to avisando, vou te morder e te abraçar e nao me larga nao @luanjobenzao i love u @MeFazBemLuan vem me abraçar vem @lovelscl errado, nunca foi @FCsonhosantanaa @ls_meupriincipe bebezonaaaa kkkk @fcluanrlove continuo t amando bebe @ls_meupriincipe falo amor @fcluanrlove o qqqqqqq??????????????? @ingridnayy espero q vc tb fale comigo qd eu falar com vc ... te amo @promiseofluan ja to indo trabalhar amor e como ta a sua? @iprotectluanjo tenho q votar mais, to fraco.. mas vcs tao fervendo ai neh? vo fervê kkkk @KetellynLacerda pois eh .. to dando um tour kkk @toritelles prontoooo @canariols_ kkkkk sumo neh? @shinesluanjo to bem meu amor e vc? @marciia_gabii oi oi oi oi... oi de novo, e oi mais uma vez queeeeem ta aki? hein hein Bora galeraaaaa! https://t.co/xPjWULf5Ho @multishow https://t.co/ORopVbMH6W Hoje!! #LuanNoChacrinha https://t.co/P4mM9dY9dq Corre no #AppDoLuan https://t.co/b3P3Y9lWGr https://t.co/1ZCQE4W8J8 Começou o #MPN 2017! Luan concorre nas categorias Cantor Favorito, Hit do Ano e Videoclipe Favorito. @NickelodeonBR https://t.co/2AcdydnCgQ #AgendaDaSemana #Luan1977 https://t.co/3QokHAYXlM Bem Sertanejo no Fantástico. Perdeu? Confira: https://t.co/g0Hv99d4Zp #LuanNoFantastico E tem \"Bem Sertanejo\" no próximo domingo!! @showdavida Com @micheltelo e Almir Sater. https://t.co/jqgMQwikaB 😂😂😂😂😂 @ivetesangalo https://t.co/lNHmT8yIo3 RT @showdavida: A Kombi do #BemSertanejo continua na estrada e chega ao MS. @micheltelo encontra @luansantana e Almir Sater: https://t.co/k… 😂❤️ @ivetesangalo #Luvete https://t.co/zHqycWWj2p Pra fechar c/ chave de ouro Agosto, meu App vai postar 10 fotos. Mande a sua há exatos 10 anos. Use #AppDoLuan Baixe https://t.co/b3P3Y9lWGr O @hugogloss já está levando Luan para o palco! Último programa #CantaLuan - EquipeLS Vai começar o \"Canta, Luan\"! Use #CantaLuan e comente aqui no Twitter. - EquipeLS Hoje!! #CantaLuan com @OficialAvioes @bandafalamansa @HugoGloss @Tirullipa @LucasRanngel A partir das 20h (Youtube) e 20h30 no @multishow https://t.co/zCfC5VoFUd RT @multishow: Já escolheu a música que você quer que  @luansantana cante hoje pra você? Escolhe a tag e vote a vontade: https://t.co/9AU3u… @raridadecmila te amo @anjometeor0 oi ❤️ @pleasureluan bebezonaa @mineirinhadolss ela só solta ou também corta corta.. eu sei q corta kkkk @sweetluan amo amo amo @MaiaraS70735721 fico sua linda @Luanironia @lsforever1991 mozao @pamela_f @camilacinho kkkk perdidao @mrbiebersantana te amoo @lcabeyos @camilacinho te amo ❤️ @umtesouroluans follow the prom @camilacinho amanhã só essa música #cantaluan kkkk @hornyluan Mkt kkkkk @negolizadas não, me fala? @meumeteorow 🙈 @luanmyangell 😅🌹 @luancited 👀 @lsforever1991 🤓 @gurizinhols_ 😏 @butsatana @meuencantolsma 😌 @joiararals @superluanjo 🤷🏻‍♂️❤️🌹 @negadoluan00 @superluanjo ❤️ @jeitoluan 👨🏻‍💻 @todoamorluanr 🤳🏼 @luanshades ☝🏼 @meuencantolsma 😋 @LSLuanNossoAmor @multishow @bandafalamansa @OficialAvioes 🤔 @superluanjo 🤔 RT @multishow: Quarta é o último dia de #CantaLuan! @bandafalamansa @OficialAvioes @luansantana, às 20h no Youtube e 20h30 na TV: https://t… Novo Hamburgo RS 💜 https://t.co/MOeb8vJ1zi #CantaLuan #RocknRoll 🤘🏼 https://t.co/hunyj1xf3M Saaaaarra mlke doooido @danirussotv https://t.co/qBSdA4ZcZr Assunto mais comentado no mundo!! #CantaLuan  - EquipeLS Começou!! #CantaLuan. Liga aí no @multishow - EquipeLS RT @multishow: O estilo do #CantaLuan de hoje é rock e o @luansantana escolheu essa música pra representar o rei do estilo! #Elvis https://… RT @multishow: #CantaLuan é hoje e você ainda não votou na música que @luansantana vai cantar? Então CORRE: https://t.co/9AU3ucqJwN https:/… RT @multishow: .@luansantana e @suricatooficial homenageiam Legião Urbana no ensaio do #CantaLuan veja mais vídeos dos bastidores: https://… RT @multishow: Encontro de gigantes da música no palco do #CantaLuan: Dinho Ouro Preto veio cantar muito rock com Luan Santana! https://t.c… Hoje teeeeem... #CantaLuan!! A partir das 20h30, no @multishow. https://t.co/805yEPhPzN ❤️ https://t.co/QuqgcOBakP #AgendaDaSemana #Luan1977 @LuanSantana https://t.co/RgnbAeM6Tm 🤔 https://t.co/rKX1dHpgVx 🙆🏼‍♂️ https://t.co/ljkUYkDHVG SUUUURRA de fotos do show de 10 anos ontem em SAMPAAA! 😍 meu Deus! O que foi isso? A festa… https://t.co/RYwwy4q3Mu Vai ter Pós Show Ao vivo Sim! #Luan10 https://t.co/NuYUWMaTwB https://t.co/cZ4nyAASmT Veeeeeem Luan que a gente vai espiar o camarim - EquipeLS #Luan10 https://t.co/iAfB1TlSax Barretão SP ONTEEEEM 😍 coisa mais linda do mundo https://t.co/hBD7q0CCws Vamos subir a hashtag oficial now!!! Tá ficando tudo lindo!! #Luan10 - EquipeLS https://t.co/xbHrl1axDY De olho na programação hoje!! #AquecimentoLuan10 https://t.co/mrU5HsIAaL É hoje!! #AquecimentoLuan10 https://t.co/E06edFNHxG 😍 @caetanoveloso #CantaLuan https://t.co/8XsNNRe1vH 🦁x🙂=🤔 #AquecimentoLuan10  https://t.co/QZOVaTcZLN RT @fficaluan: @luansantana NUM SEI SOU DE LIBRA Cortar ou não cortar o cabelo para o show de 10 anos? 🤔 #AquecimentoLuan10 #AquecimentoLuan10 Espero vocês amanhã!!! https://t.co/54SO7U3CAb .@hiperluan #AquecimentoLuan10 https://t.co/uJEAsngfNm .@_jupombal #AquecimentoLuan10 https://t.co/oo2uYmRW32 .@cantinhofals_ #AquecimentoLuan10 https://t.co/MX1Ps1muna .@horoscopols #AquecimentoLuan10 https://t.co/a64G9oj608 Vou contar algumas novidades agora #AquecimentoLuan10 Alguém nos observando... #AquecimentoLuan10 https://t.co/ZAMJOhl9tV @dramaticadorafa Fica amor! #AquecimentoLuan10 Emoção! #AquecimentoLuan10 https://t.co/0LM4jbqEVF @yourluanjo E u   T e  a m o #AquecimentoLuan10 @eusoquerovclsmg ❤️❤️❤️ to aki #AquecimentoLuan10 @melhorsorrisols Te amo #AquecimentoLuan10 @aosantanjo Ainda.. não! Mas tô 🤔 #AquecimentoLuan10 @vivendoluanjo Kkkkkkkk #AquecimentoLuan10 @0meteoro Ó ó ó nao! #AquecimentoLuan10 @negadoluan00 @Meu_Luan_ Amor #AquecimentoLuan10 @umaprin_ Nem almocei 😨 #AquecimentoLuan10 @LUANOUSADA Me chamaa #AquecimentoLuan10 @fooryoulrs Kkk claro amorrr vo cantar 😂 .@Meu_Luan_ #AquecimentoLuan10 https://t.co/V3lqjPmpKi Aguardando as perguntas maaaaaaaassas de vcs. To pronto! #AquecimentoLuan10 @SempreEstouAiLS Hahahahahahah #AquecimentoLuan10 te amo @vidadorafael Vamoooo #AquecimentoLuan10 @meudantelr_ esperando vc vir me contemplar #AquecimentoLuan10 @mineiraadoluan Sei q vc eh o meu #AquecimentoLuan10 @admiroluan Falo agora e qd vc quiser #AquecimentoLuan10 @poramorls_ Tb to amor #AquecimentoLuan10 @ThaimanaC Eu tb!! To q nem durmo #AquecimentoLuan10 @viciomaiorls Coisa linda dmais #AquecimentoLuan10 @Camylla_SilvaLs To te notandooo #AquecimentoLuan10 @juliannaborgees mentiraaa.. eu q te amo! To feliz, to contente, to legalll.. e vcs? #AquecimentoLuan10 Cheeeeeeeeeguei galeeera #AquecimentoLuan10 Hoje tive tempo de conferir como ficaram as paredes do meu escritório! Incrível ! Valeu galera… https://t.co/LVdonlQrqm Uma hashtag com um emoji desse? É o Twitter comemorando 10 Anos com a gente! #AquecimentoLuan10 Às 17h tem Q&amp;A aqui no Twitter sobre o Show de 10 Anos!! Façam suas perguntas. Use #AquecimentoLuan10 https://t.co/dsvVqS4tl6 Hoje!! Q&amp;A de Aquecimento para o show de 10 anos!! Vem? Às 17h, aqui no Twitter. https://t.co/tG86KNtqXm Cantar ESSA canção. Justamente ESSA. Composta por ele @caetanoveloso ao lado dela @ivetesangalo… https://t.co/QZ32qvUFIP Que saudade do meu Pantanal 🍃#tb https://t.co/C2bqGrUaze Faltou @caetanoveloso mas essa galera me fez MTO feliz hoje 😍 amanhã posto mais coisas do… https://t.co/CSHAcD3F23 Quem já está ligado? #CantaLuan - EquipeLS https://t.co/fqe5bqiXno RT @multishow: #CantaLuan já está AO VIVO no Youtube com @Kefrera e @luisasonza! Só nessa pré eu já sei: hoje PROMETE! LIVE: https://t.co/9… RT @multishow: #CantaLuan com @ivetesangalo e @caetanoveloso, meu povo! Tô tremeniii de nervosooo! https://t.co/9lIZ8axIX0 https://t.co/JW6… Hoje no \"Canta, Luan\". @ivetesangalo e @caetanoveloso #CantaLuan Às 20h30, no @multishow https://t.co/G4zU8Wu3y1 Dia lindimais 🛳 AMANHÃ CANTA, LUAN às 20:30h no multishow @ivetesangalo @caetanoveloso https://t.co/A3kIPOTZJT Já participou? https://t.co/b3P3Y9lWGr Último dia para inscrição! - EquipeLS #AppDoLuan https://t.co/bu3nYPYZ1p HOJE EM ARARAS SP 😍 https://t.co/mEFIQ5YoxO 🦇ontem em Prudentópolis PR ❤️ https://t.co/NAnA6uEfhn Amanhã, 15/08, Luan e o próximo convidado do #CantaLuan, @caetanoveloso, se encontram no Facebook Live With! Às 20h. #LiveLuanECaetano https://t.co/1otiJ7Bq1j #AgendaDaSemana #Luan1977 @LuanSantana https://t.co/xatzDpKQRS Cause music lives inside me 🎼 https://t.co/mKPoOX4uzr QUIZ: Qual fase da carreira do Luan você ê? https://t.co/y0BCmBowSy - Equipe LS Já conferiu a Playlist \"This is: Luan Santana\" no Spotify? Siga agora e ouça seus maiores sucessos: https://t.co/KmebHWnqii - Equipe LS https://t.co/jJCTrcRsxv Acabei de publicar uma foto https://t.co/7glVkR0wSz No dia 11, Luan também conferiu as homenagens de fãs e fã clubes nas redes sociais! #Luan10Anos - Equipe LS https://t.co/zScQ6JNnEb Ontem em Piracicaba SP 😍 amo vocês. Muito. https://t.co/kpeXBTD1DC 🕺🏻 https://t.co/XWUpifQ4SC Pai, hoje foi tão corrido que nem deu tempo de tirar uma foto com o sr e nem de dizer o quanto… https://t.co/8i95moF0Bw banoiti 👀 https://t.co/t5QY26Qj4j Ontem, 11 de Agosto de 2007 completei 10 anos do sonho mais lindo que alguém pode viver numa… https://t.co/vJGtwF3GTD PIRACICABAAA SP já já tô aí 🙌🏼 https://t.co/wbibaxE8hz Mais um vídeo!! Depoimentos dos amigos, colegas profissionais e ídolos! Assista:  https://t.co/qMus7Z0P58 #Luan10Anos https://t.co/r5uqn1xI98 Saúde e tudo de melhor nesse mundo coisinha 😍  @tatawerneck mesmo c fazendo esses baguio comigo https://t.co/mC1gmFE0lJ ⚡️ “Luan Santana comemora 10 anos de carreira hoje!”\n\nhttps://t.co/puigHLjMHr Hoje teremos algumas reações do Luan com homenagens! Essa é a primeira. https://t.co/rhEfr7rnZr #Luan10Anos - EquipeLS X https://t.co/eE7K7Ln9Av Amo tanto vcs, mas tanto! Hoje só quero agradecer e comemorar, tô emocionado aki! Obrigado, Obrigado, Obrigado! 10x Obrigado! #Luan10Anos A gente é mau né..fazê o que? 👀 #CantaLuan https://t.co/tgHtVOy3rW Meu aplicativo pode trazer você e seus amigos (Com tudo pago) para o show de 10 anos dia 19! https://t.co/b3P3Y9lWGr #AppDoLuan https://t.co/2jTT8f5swI 😻 https://t.co/iRIpSERysC ❤️ sobre a estréia do Canta,Luan no multishow 😍 https://t.co/ohr30tp6Ho Assunto mais comentado no Mundo sim! #CantaLuan @multishow - EquipeLS RT @multishow: .@Luansantana faz versões de @justinbieber e @backstreetboys no ensaio do #CantaLuan; veja os vídeos: https://t.co/jYcEYQVY5… RT @POPline: “Canta, Luan”: veja quem são os convidados da semana do programa de TV de @luansantana! https://t.co/n7vlhzJz8B https://t.co/C… RT @multishow: #cantaluan o recado que tava faltando! É HOJE que a gente desce até o chão, Luanzinho! https://t.co/wyLCSXLoIz Hoje no #CantaLuan. @NegodoBorel @Ludmilla. Às 20h30, no @multishow. https://t.co/wPX5dMeeru ⚡️ “Luan Santana recebe Ludmilla, Nego do Borel e Hungria no \"Canta,Luan\".”\n\nhttps://t.co/DjuZIOatMu RT @multishow: Tá preparado pro #CantaLuan hoje? Às 20h30 tem @Ludmilla, @NegodoBorel e @HungriaOficial AO VIVO! Simbora! https://t.co/myLi… RT @multishow: #CantaLuan ele já chegou e já tá ensaiando! 👌🕺🏻 https://t.co/0VZF7wsSzv RT @multishow: #CantaLuanTeVivo ou #CantaLuanMesmoSemEstar? Qual música @luansantana deve cantar hoje no programa? Vote a vontade: https://… Dia 19 temos um encontro marcado no meu Youtube!! Vem? Inscreva-se agora https://t.co/E6Xo6IKXVQ https://t.co/Fr6HfYHrfi"}