{"tweets": "God blesses us with someione who will make our healing faster. I am happy. People are happy for my happiness. It’s so beautiful. Ang alamat ng baklang pressured!!!! lolz Thanks so much! I appreciate it!!!! Food poisoned. Severe stomach ache. Help me good Lord! Aba’y bukod sa nagkabugan sila ng printed polo ay talaga namang nagkabugan din sila ng boses! 👏👏👏 Watch nyo to! ⁦@jedmadela⁩  #JED #JohnMark https://t.co/rbprnO2PhQ Deserve mo ang good vibes. Give mo sa self mo. San ang venue? Anung level of chugugness ang gusto mong maachieve sa ball? Gusto mo ba yung pagdating mo maguuwian na sila? https://t.co/4I0IKeKzz6 what’s ur address? DM me and i’ll send you the complete collection. https://t.co/I40f0UMOyD So u wanna experience slaying the red carpet just like me?  When is ur ball? https://t.co/wntt7YFh3C 4 awards and a new endorsement in 3 consecutive days!!!! woooooohoooooo!!!! Keep ‘em coming!!! Obligasyon natin sa sarili natin at sa mundo na maging masaya.  #DapatMasaya Just for the month-long celebration of our 10’th anniversary. Thanks for watching!!! #ShowtimeClassics ❤️❤️❤️ https://t.co/TbY8I2Q6AP bwahahahhahhah!!! Baka malugi ang National Bookstore!!! https://t.co/BoWBDxZAgY Lord I pray na ung taong nagbabasa ng tweet na ito ay magkaroon at makakita ng madaming dahilan para ngumiti at maging masaya kahit na may mga pagsubok pa. Sana po ay gumaan ang pakiramdam nya. Amen. Naalala ko yung usap namin ni Kim Molina last week. I congratulated her for the success of Jowables. Sabi ko sa kanya masaya ko n may bagong artistang nagpapatawa. Kasi s gulo at hirap ng buhay kailangan madagdagan ang mga nagpapatawa. Para mabawasan ang lungkot khit sandali lng. Marami pa bang masaya sa mundo? O mas marami na ang galit? Pack up!!! Haggarda jones na ang meme sa shooting. Need na magpafresh for more chugugness!!!  #VICExANNEmovie #TheMallTheMerrier Namimiss ko nang magvolleyball sa kalye. Sabado. At may magbabalak manira ng plano mo.  Kutongan mo! Pwera na lng kung nanay mo. Chozzzz!!! Alam mo namang di ka perfect. Pero may mga tao din talagang hinahanapan ka na lng lagi ng mali. Aminin mo madaming ganyan! Yung tipong kahit comatose hahanapan ng maling ginagawa. Yakap na mahigpit. Araw arawin mo lang ang pagtawa. Magugulat ka yung lungkot biglang wala na. God bless you and your family. https://t.co/HrFatuSqrU Dont just ignore them. Pray for them. Be compassionate even to your detractors. May mga taong ang  tanging trabaho sa buhay ay pagmasdan ka at kainggitan ang mga tagumpay mo.  At magpanggap na di sila natutuwa sayo at palabasing may mali sa mga ginagawa mo. Kaawa awa. Malulungkot. Whole day movie shoot with Anne today. Malapit na kami matapos.  Excited nakong mapanuod nyo to sa Pasko. Super nakakatawa to!!!  As ennnnnnn!!!!! #TheMallTheMerrier Dahil ako ang meme mo! https://t.co/rb1kt822zb Mapapagod pero di aayaw. https://t.co/OVZCS6mEHl awwwwww!!!! pasasayahin pa kita. https://t.co/hZoM7I7wpA Kahit panandalian lang mamayat mayain ko para makagaan. https://t.co/tkiJEcgGuf You have the power to dictate ur mood. Be happy! https://t.co/FscH1TQpjm You deserve to live. You deserve to be happy. https://t.co/csX1ShSWXW sa mundong nakakapagod gusto kitang mapatawa. https://t.co/UG3oQX10Zv Itawa mo lang. I hope u feel better. https://t.co/74R47wPICp Tutoy keeps on winning!!!! 👏👏👏 https://t.co/HSs74chynf May mga tao na magsasabi sayong wala kang kwenta. Wag kang makinig. Mga demonyo sila. While waiting for set up dito sa shooting super nood lang ako ng mga Showtime highlights sa facebook via ABSCBN page. Super nakakalibang pala panoorin yung mga eksena. Tawang tawa ko sa mga kagaguhan namin. Pssssst! It’s Sunday. Calm down. You deserve to have some peace.  Kahit once a week man lang. 😄 #TNT3AngHulingTapatan Winners are all deserving!!!! Congratulations!!! #elaine #johnmark #johnmichael Gusto kong magshowdown pa yung Top 2!!! I want some mooooorrrrrrrrrreeeeeee!!!! #TNT3AngHulingTapatan The prompter says announce 7’th and 8’th placer pero ang inabot sakin na envelope has the names of the contestants na pasok sa top 6. So ayun na steve harvey ako. I was just reading the prompter. Not my mistake. Sorry still.  #TNT3HulingTapatanDay5 Thanks everyone for the love and support!!! Makakaasa kyong ibabalik ko po sa inyo ang pagmamahal na ibinibigay nyo. Pipilitin kong mapatawa  at mapasaya kayo araw araw sa abot ng makakaya ko. work is life. sleep is lifer. freshness is lifest. Andami nying nagmamahal sa akin at masaya para sa kasiyahan ko. Maraming salamat!!! Mapalad ako. VICE x ANNE Movie  (The Mall the Merrier) shoot today. Sorry you’ll miss me in Showtime. See you tomorrow! God blessed my broken heart.  And now it’s a happy heart. https://t.co/Q3s9wReBVI RT @vicecosmeticsph: 🎉 ANNIVERSARY GIVEAWAY FOR 2! 🎉\nCalling all Gandolls because we're giving away two complete sets of Vice Cosmetics Pro… Maiba lng tayo bet ko lang ishare. Hehehe! Nasa daan ako now. Traffic. Umaambon. Pero ung katabi kong sports car naka top down. Hahaha! Napasaya nya ko. Kung sino ka man thank you at napangiti moko. Yabyu! (2) I was told na the Hurados will talk and will come up with a statement after. They’re aware na madaming disappointed.  I myself was shocked.  And i would love to hear and respect what they would have to say. So lets just wait.  Love u guys! (1) Ok for the TnT fans tweeting me. I talked to the staff and told them that the viewers’ sentiments have to be acknowledged. So i asked if we can hear a word from Sir Louie since sya lng ang judge kahapon na present kanina. Antaray ng trapik!!! Umalis ako ng maaga para magshooting. Pagdating ko ng location ung pelikula ko showing na!!! Chugug!!! Started the -Ber Months with a sold out concert in Davao. Magandang senyales to!!! Chugug!!! RT @StarCinema: BER months are here! Vice Ganda is here! ❤️\n\nNaaamoy niyo na rin ba ang simoy ng Pasko? \n✨\n\n#SeptemVICEisHere\n#Christmas201… Ang galing ni Zephanie sa #ASAPNatinTo ! Ang linis kumanta.  Kakaproud! Hello my favorite Davao!!! I’m sa happy to see you again!!! Let’s have a chugug na chugug night later.  So excited! You are in charge of your emotions. You decide how to react and what to feel. Take control. Today i will just rest, relax and enjoy the day. I will smile and be joyful. I will not care. I will just love. I will just live. Ang sarap sa pakiramdam nung may nagaalaga at nagaasikaso sayo sa mga pagkakataong pagod ka at masama ang pakiramdam mo. Ang sarap ng may taong mahal ka. Last night during the All Star Games kitang kita ko yung saya ng mga tao habang naglalaro ang TeamShowtime at TeamStarMagic.  Mas masaya talaga ang mga tao pag lahat magkakasundo. Magkaiba man ng grupo o magkakatunggali di pa rin nakakalimutan na lahat tayo ay magkakapamilya. What’s his name? I wanna meet him!!! https://t.co/meY58VS83E Watch mo tong vlog ko dali pampabawas stress. Chugug!Stupid Game with Team Vice! https://t.co/YVKu9dJZ8k via @YouTube Just A Stranger is @annecurtissmith ‘s best film! Gandang ganda ko sa movie!!! Chugug na chugug yung ending!!! Watch nyo dali! Ang saya nito. Chugug na chugug ang trip! Stupid Game with Team Vice! https://t.co/YVKu9dJZ8k via @YouTube Posting a new lafftrip vlog on my Youtube Channel at 7pm tonyt.  Watch, like and subscribe. https://t.co/5Y3w7WWs8J Love u and miss u too!! All of u! ❤️❤️❤️ https://t.co/YJShy5DohC Let’s love. Let’s smile. Let’s be happy. RT @Fact: Laughter has been medically proven to help people lose weight. Today i choose to focus only on those that spark joy.  Dun lang ako sa masaya. Di ako papayag na may magnakaw ng ngiti ko. Akin to! Chugug! Yung galing sa soso! #AskVice https://t.co/mVyuYpXgiL Bakit yung pekpek ba galing sa peking duck?!!! #AskVice https://t.co/xJlbM6ygTa Mas masakit yung masampal ka ng Nanay mo dahil puro kalandian inaatupag mo! #AskVice https://t.co/9dioi4oeC1 hindi! Kaya fire exit kasi sa fire umeexit ang mga tao dahil may sunog!!! https://t.co/sI4cwyh4GB Landi! Dahil daig ng malandi ang maganda at mautak!!! #AskVice https://t.co/Cguz1wXPyt Kahit ano basta hindi pokimo! #AskVice https://t.co/xPbWe0zftc I stand corrected! #AskVice https://t.co/lzlkFio9CJ I wish i could do anything!! #AskVice https://t.co/3pyIX61GZS Mas naniniwala ako pag sinasabi ng Nanay ko na “Magsaing ka na kung ayaw mong masaktan!”. #AskVice https://t.co/Ag5c1OowNy Opo! Natatakot nga ako e. Multo po ba si Camilla? Kasi sa Kadenang Ginto sardinas sya. #AskVice https://t.co/YDtaQInBFe ung ari ko!!! #AskVice https://t.co/qUTF1TMwxS Kasi labas ka ng labas!!! Subukan mong pumirmi sa bahay luluwag kami.  #AskVice https://t.co/ck8jICzuRQ Pwede namang pagsabayin. Pag aralan mo yung jowa mo kung di ka nya niloloko! #AskVice https://t.co/rUJdHkQQaY you call it STRESS!!! #AskVice https://t.co/OgixlODTpa Matulog ka sa loob ng ref ng atleast 8hrs. #AskVice https://t.co/s4I4xqV5rR Chugug is yung feeling mo na parang may kumerstofayn dun sa dudusveyrz mo na sobrang flakchumelavu!!! Getz?! #AskVice https://t.co/RcMOVEBO56 Trapik!!! Lika magharutan tayo. #AskVice alam ko! At mahal na mahal ko din kayo!!! https://t.co/0RgMBFnsWG RT @mickamijares31: @vicegandako Always positive and never manira ng iba para iangat ang iniidulo nila ...Yan ang salitang pinanghahawakan… Ganyan! Chugug lang! https://t.co/wvt5YfiSpE Nauunawaan ko yun. Di ako ang mundo pero masaya akong bahagi ako ng mundo nyo. Gawin nyo lang ang mga dapat nyong gawin. Kahit tahimik magmamahalan pa rin. https://t.co/XGRMHpPWTk RT @elainnelovesVG: @vicegandako Mahal ka namin mommy kong maganda! Thank you for being our happy pill and inspiration everyday. Miss you!… RT @dolalvarez74: @vicegandako Ang sarap ng masaya. Ang sarap ng d stress. Ang sarap kaya maging kind! Mahirap ba yun?! Hay naku iloveuuu @… Kaway kaway my REAL Little Ponies na fun, makukulit pero good vibes lang, meron din tahimik lng pero 100% ang suporta and always trying to be positive!!!  Mahal na mahal ko kayo. At maraming salamat!!! Nakikiusap ako!!! Pakitanggal ang pangalan at larawan ko sa header mo!!!  And please stop being my fake fan! @MabangongFlower https://t.co/L3BeOyQXpE Sa mga fans (?) ko na nagpapalaganap ng negativity sa twitter utang na loob wag nyong gamitin ang larawan ko sa profile pic o header nyo!!! Wala akong fans na nega! My LITTLE PONIES are fun and kind!!! Yan ang hirap sa inyo! Binigyan na nga ng exposure ung idolo nyo di pa kayo makuntento! Aba baka sa sususnod iutos nyo ng sya ang gawing main host! Abusado!!! https://t.co/ScrRvRisg6 Hahahahaha!!! Bigla kong naalala nung nabash ako dahil sa shopping. Chugug!!!! https://t.co/CU9v9HyR8Z Nakakakaawa yung mga LGBTQ+ na napagkakaitan ng karapatan dahil sa kanilang gender identity. At nakakaawa rin yung mga ignorante na napagkakaitan ng kaalaman kaya nakakatapak ng karapatan. Kailan pa kaya lalawak ang pang unawa sa LGBTQ+? May pag asa pa ba ang SOGIE BILL? 5PM pala!!! Tanga tangahan ang Meme sorry! Chugug! Going LIVE on my Facebook Fanpage and Instagram, ViceCosmetics FB and IG and Lazada App at exactly 5pm today to launch my newest lipstick collection #GandaLang .  Tune in to win prizes. Chugug!!! RT @vicecosmeticsph: The wait is over, Gandolls 💃🏻 Rhumampaaa na to any Vice Cosmetics Stores nationwide kasi avaialble na ang Ganda Lang M… We super appreciaate! Love u! https://t.co/O8idLjRMlf Nabasa ko sa profile mo na may pinag-aralan k naman. Pero sana pag may time ka matutunan mo din ang EMPATHY at SYMPATHY. https://t.co/F4LYkIdXFv Now in Baguio. Walang masight. Walang maawrahan. Super ulan. Super foggy! Sana pala sa bahay na lang ako at nag invite ng 20 katao na nagve-vape para panuin ng usok ang paligid ko. #BidamanTheBigBreak Congratulations Jin!!! Well deserved! Big things await you. Galingan mo lalo. Im also  excited for Eris! Im sure chuchugug din yan ng chugug na chugug! O eta na! Mainit init pa! My latest super nakakatawang vlog. Watch and subscribe na para chugug na chugug!!! Can't Fall Challenge with Team Vice! https://t.co/NDZ4E8UJZm via @YouTube Gandang umaga!!!! Make this day productive. Wag puro abang sa sagot ni Bea! Chugug! Daming kuda ni Madam Bertud! Chugug! https://t.co/7C0BAp9wrp Di ko maimagine. na magsama silang tatlo! Parang sasakit ang ulo ko in a good way. Chugug! https://t.co/jXy4z7gHz6 Abangan!!!!  8.13 \n#GandaLang https://t.co/aKtFhCQjGc Bumibili ako ng mga prutas. Bigla ko naalala Lolo ko. Mahilig sya sa mga prutas. Andami kong pambili. Pero wala na sya. Nagpipigil ako ng luha. Ang lungkot! i wanna meet him! ❤️❤️❤️ https://t.co/IxAgJ4qKvD Woke up and realized na wala akong work today. Pakshet ngayon na lng ulit ako nakaranas ng DAY OFF!!!! Ang sarap ng feeling! Chugug!!! Wag mong hayaang patayin ka ng sakit na dulot nila. Laban! Sa huli dapat panalo ka. Tulog ka na. Mas bonggang humarap bukas sa mga pagsubok ng fresh at maganda. Para chugug! hahahaha we’re sooooo fun!!! namimiss ko na agad yung halakhak ni ate @reginevalcasid !!! https://t.co/PtgEuXQOug May our posts today be fun,  happy and positive.  Have a wonderful Sunday! Lord tonight I pray for everyone who’s suffering. Especially those who are very close to me.  Pls bless and fix their hearts that are broken. Give them strength to stand again.  Amen. May mga taong gustong makita kang stressed. Wag mong ibigay. Tawa ka muna!\nLike and subscribe after mo magoodvibes. \nYou Can't Stop Singing Challenge with Team Vice! https://t.co/2tWB0cyKMk via @YouTube O baka bagot ka o bugnot aliwin mo muna sarili mo. Watch mo tong latest vlog ko. Like and subscribe na din para mas chugug!!! \nYou Can't Stop Singing Challenge with Team Vice! https://t.co/2tWB0cyKMk via @YouTube Watch nyo na latest vlog ko dali. Lafftrip to!!! Dnt forget to like and subscribe. \nYou Can't Stop Singing Challenge with Team Vice! https://t.co/2tWB0cyKMk via @YouTube Sunday kaya kumalma ka. Irelax mo naman ang sarili mo. Good vibes naman. Di laging galit, madaming hanash, stress. Chill ka naman ngayung Sunday. Atleast man lang once  a week gumanda ka. Mwah! 😜🤪 I love you too! Nytie! 💋❤️ https://t.co/sICDPYHs42 Piliin mo lang yung ikakastress mo! Wag lahat. Yung may kwenta lang. Yung iba palamapasin mo na.  Not every little senseless issue is worth your time and emotion. RT @VivaArtists: Story conference for the upcoming movie of @vicegandako &amp; @annecurtissmith under  @VIVA_Films  and Star Cinema. Together w… Done with our first shooting day for our VICE x ANNE movie with Tony Labrusca and Dimples Romana. Sobrang saya nito. Thanks Lord for guiding us today. O kung bagot kayo watch nyo na lang tong latest vlog ko sa youtube channel ko. Pampatanggal bagot. Subscribe na din para maaliw ako sa yo! Daliii! 1 Day in HengKeng Shopping Challenge! https://t.co/R5WCAAIJxM via @YouTube We can still be cool even on an ordinary Sunday.  Do something KIND.  Kind is cool. GANDAng araw sa’yo!!! Sana makamit mo na yung gusto mo ngayon. Kung di man may bukas pa naman.  Fight lang ng fight!!!! Matapang si Kiara! Di nagpatinag. 👏👏👏  #PBB8Batch4Grilling May mga taong magtatanong para malaman ang tama mula sa sagot. May mga tao ring nagtatanong para maghanap ng mali sa sumasagot.  #PBB8Batch4Grilling Even if you say the sincerest things still not everyone will like and approve of it.  You can’t please everyone.  #PBB8Batch4Grilling i like Franki! Naawa ako nung natapunan sya ng itlog. Nahurt ako for her.  #PBB8Batch4Grilling Thank you very much to all the wonderful doctors, nurses and staff of TheMedicalCity for taking good care of me for 3days. Ang babait at ang aliwalas nyo. God bless you guys! Uwian na! Watch my latest vlog on my Youtube Channel. Kuryentanong with It's Showtime Peeps! https://t.co/keQZeFecXO via @YouTube . Like and subscribe. mwah!!! It was an honor to meet you and to have the experience to work with you Tito Eddie Garcia. Maraming maraming salamat po sa karanasan, inspirasyon at kabutihan. Mahal ka ng apo mong si Praybeyt Benjamin. Tonight at 7pm on Vice Ganda Youtube Channel. https://t.co/qcf8mpFzaw GANDAng gabi Unkabogables! Tonight at 7pm mapapanuod nyo na ang latest Vlog ko sa VICE GANDA youtube channel. Watch my super playtime KURYENTANONG Challenge with Jackie, Steph, Brenda Mage at Ion.  Masaya to! Pls like and subscribe. Pipilitin ng demonyo na pasukin ang utak mo. Gagawa sya ng paraan para magalit ka, mapikon, mabwisit. Para umiksi ang pasenya mo. Para lahat ng bagay palakihin mo. Para lahat ng tao patulan mo. Para makipag away ka. Para maging masama ka. Tulad nya. Lunes. Iwasan mong magalit. Kunalma ka. Maging magaan ka. Wag mong istresin ang sarili mo at ang ibang tao. SPARK JOY. SMILE. Let’s just love. Abangan! \n#HouseOfGandaAtMegaBall https://t.co/IO3Ijbr3pP Budol is real! \n#HouseOfGandaAtMegaBall https://t.co/ijWo2YFSJs #HouseOfGandaAtMegaBall https://t.co/xZwQU032Bi RT @teamvicePH: Excited na ba kayo sa look ni Meme Vice tonight sa Mega Ball? 🤩 Don’t forget to use our official HT #HouseOfGandaAtMegaBall… Makakaasa ka anak! 💣💣💣\n#HouseOfGandaAtMegaBall https://t.co/bKi77yZhZE Watch out for #HouseOfGandaAtMegaBall !! Lord God we pray for Tito Eddie Garcia’s wellness and safety. He will be healed. We claim in Jesus’ name, Amen. RT @MIRAbellabells: Finally!!!! Natapos ko na din basahin yung libro mo mah.😍😩 ilove youu!!! Halo halo emosyon ko sa libro mo ah😌 and may c… In just one week Number 1 Beatselling book na agad ang TUTOY. Maraming salamat po! Too much love! https://t.co/gkYQ6SY9jq RT @teamvicePH: Excited na kami dito!!! 🤩🤩🤩\n\nTara naaaa! Dito siguradong sasaya ka na, may mapapasaya ka pa!!! \n\n⭐️ BUY YOUR TICKETS NOW!!… Hopefully today maging maganda ang buong araw mo. Sana nakasmile ka lang lagi. I wish you well. God bless you! Sabi sa research ung resulta daw ng eleksyon nagsasabing ang mga Pinoy mas kayang magpatawad ng mga nagkasala sa kanila kesa magtiwala sa mga taong di nila kilala. Ako din naman. Again shinare ko lng po ung nabasa kong interpretasyon daw nung resulta ng eleksyon. https://t.co/mf9NpMjCFt Ay di ko po opinyon un. Shinare ko lang po yung nabasa kong realization sa naging resulta ng eleksyon. Kinonek ko lng po sa lovelife. https://t.co/rNqQYhLApy Oh em! Sorry guys!!! Maraming salamat sa support!!! Super naappreciate ko!!! I love you!!! https://t.co/jxohFHYijZ RT @ABSCBNNews: Mula noon hanggang ngayon, isang pamilya tayo sa bawat saya at pagsubok. Ito ay patunay na kakayanin natin ang lahat basta'… Sunainyo ang kaGANDAhan!!! @vicecosmeticsph https://t.co/yHPfVNKteA Di ko kayo nakita pero kilalang kilala ko mga boses nyo. Alam kong nadaanan ko kyo. Hahaha!!! https://t.co/TUTuLTsODb I Love you my Little Ponies!!! Thank you very much!!!! Maraming salamat po sa lahat ng nagpunta sa SM Sta.Mesa para sa Litte Ponies Day ng ViceCosmetics. Pasensya na po i cant stay any longer for everyone’s safety dahil sobrang dami na ng tao. Iwas stampede lang po at may mga nasasaktan na.  Hayabayabayu!!! Maraming salamat po Madlang People at sinamahan nyo kami sa lahat ng mga ganap namin sa Showtime kanina pati sa mga harutan.  Para tayong isang pamilyang nagabibiruan at nagtatawanan. Ganyan lang. Goodvibes lang. hahahahahh I LOVE YOU VHONG!!! @VhongX44 Gotta start working.  Love yah!!! Madami kang haharapin today.   Madaming mangaabala sayo para bumagal ang usad mo o para di ka makausad. Wag kang papayag.  Hingang malalim. Deretso lang. Ngiti. Larga. GANDAng umaga Madlang People!!!!  Be happy for  urself and FOR OTHER PEOPLE as well. Nakatulog ako ng 9pm. Nagising ako ng 7am. Gudlak!!! RT @itsShowtimeNa: May Gandang dala ang Huwebes, Madlang Onliners. Mapakanta, sayaw, o katatawanan!\n\n#ShowtimeMayGanda https://t.co/6zumKZj… Sabi ni Vice: ‘My life is sooooo good!’\n\nSabi ng mga #PaWoke: ‘Feeling Privileged’ ‘Insensitive sa mahihirap’\n‘Walang empathy’\n\nSabi ni Vice: ‘My life is soooo bad!’\n\nSabi ng mga #PaWoke: \n‘Ungrateful!’ \n\nSo paano po talaga dapat ang chika mga #PaWoke??? Lolz Namay mo. https://t.co/awgyHadp4A Very simple. PRAY. Focus on what sparks JOY. https://t.co/S5sCiNJHHc Gandang tanghali Madlang People!!! Andaming ganap sa paligid. Di masamang ayusin at atupagin mo muna ang sarili mo bago mo pagtuunan ng pansin ang buhay ng iba. Have a great day ahead. Hayabayabayu!!!!! 😘😘😘 RT @MJ_Lastimosa: Society... https://t.co/IcGN7LNj4i Hahahhaha @ryanbang makes me sooooo happy!!! I love you baby boy!!! I miss u too ng severe!!! Thanks Madlang People of Calgary!!! Another sold out concert. Yezzzzz naman waging wagi na naman si batla!!!! Free day ko bukas ano kaya pwedeng gawin? Shopping? Oooopppsssss baka magalit ang mga pa-woke, mga feeling woke at mga woke-ininam.  lolzzzzzz!! Smile! Good night sa inyo dyan! https://t.co/MwWXqmWJLF Ganda! 😘😘😘 https://t.co/lZ6monKKij Aminin nyo nageenjoy kayo sa mga hanash ko! Hahahahha!!! Actually inenjoy ko din. O sya na vorlog na kayo at rarampa nko talaga. Yabyu! Bwahahahahahaha!!!! O diba  ang taray netong pa-WOKEninam na to. Ang layo ng narating mula sa shopping!!! lolllzzzzz Tawang tawa ko pwamish! 🤣🤣🤣🤣🤣 #paWOKE #feelingWOKE #WokeWokan #MasabingWOKE https://t.co/swAo5cpBT5 You don’t just say or tweet the word EMPATHY.  You stand up and help. May mga natulungan na ba kayo? May mga nasagip na ba kayo? Maka empathy lang ang mga potaha! Nagshopping lang wala ng empathy!!! Empathy mo mukha mo! Wow naman!!!! mga Woke-kininam kayo!!!! lolzzzzzz 🤣🤣🤣🤣🤣 https://t.co/EjDeOK61Es Another batch of WOKE WOKAN candidates!!! Shit mahigpit ang laban. Ang huhusay nilng lahat!!!  lelllzzzzz 🤣🤣🤣🤣🤣 https://t.co/KRDc9qtDU8 Ok it’s 8:20am here in Calgary.  I gotta take a bath na at magsha-shopping ako ulit. Eto kasing si @annecurtissmith masyadong ‘PRIVILEGED’ nagpapabili ng Chanel. Pasok mga pa-WOKE bash nyo na si Anne! lelllzzzzzz 🤣🤣🤣🤣🤣 Yung mga feeling WOKE at mga WOKE WOKAN ang mga pinakatoxic na tao sa social media. Sa true. Sa real. Eto ung ilan sa mga muntik ng ma-stroke dahil sa pagsha-shopping ko. I do not know lang ha!!!!! Kissshhhh nga mga mamshies!!! 😘😘😘😘 https://t.co/IqEfZYCE1E And i dont have to brag about my monetary capabilities. Everybody knows im a millionaire because im a hardworking Filipino. Bitch!!!  Sabay hampas ng balakang. Catwalk. Exit. Sa mga Pilipino di pagiging ‘PRIVILEGED’ ang pagshashopping. Kahit mahirap nasa mall at may binibili. Kaya nga andaming mall sa Pinas dahil trip yan ng mga Pinoy. At kahit isa lang ang binili mo at sale pa shopping pa din un. Nagtweet lang ako ng magshashopping ako sinabihan nako ng mga feeling WOKE ng ‘Privileged’! Bakit ako lng ba nakakapagshopping sa buong mundo? Mga shunga! Punta ka ng mall kahit walang trabaho nagshashopping!!! Dunung dunungan ang mga potahang feeling WOKE! RT @vicecosmeticsph: Sino dito gigil na gigil sa NEW LITTLE PONIES!?💄💄💄💄 Share this post on your IG stories kung excited kana sa Launch on… RT @vicecosmeticsph: SMALL but UNKABOGABLE! Comment 🦄🦄🦄 if you can’t wait for May 23! But remember — more patience, more ganda! \n\n#GandaFor… RT @vicecosmeticsph: GANDA? Maliit na bagay! 💁🏻‍♀️💕\n\n💄 05 . 23 . 19 \n\n#SmallButUnkabogable\n#GandaForAll\n#ViceCosmetics https://t.co/UoltqUA… Pag nagkita tayo magpakilala ka. Ipakita mo tong tweet na to bitbit ang iyung birth certificate at umasa kang aabutan kita. lelllllzzzzz https://t.co/J5kX03WHyZ lalaban ako ng naka p%ke shorts lelllzzzz https://t.co/IaKsV6S1Fu mali ka ng pinagsabihan kapatid! sabihin mo yan sa sarili mo. lelzzz https://t.co/X6923HpMg4 Just landed in Calgary. Now flying to Canada. See you tomorrow in my concert Madlang People in Calgary. Peace y’all!!! Wow kana! Andaming nag aaway, andaming galit andaming nagkakagulo sa twitter, sa fb sa ig.  Valakayojen!!!! Shopping muna ko.  More shoes! More outfit! More fun! My life is sooooo good! Sa totoong buhay yung binabash laging mas successful dun sa basher. million hugs to u! Keep going. Believe me ul make it in time. https://t.co/F6qkvp9HPi U dnt have to explain urself to everyone.  Not everyone deserves your time. Not everyone will listen anyway.  Dont stress. Keep moving. RT @CNN: JUST IN: Lawmakers in Taiwan have approved a bill legalizing same-sex marriage, making it the first place in Asia to pass gay marr… natawa ko sa jetsetter tahka! https://t.co/Cw90Zvd4y8 Just landed in New York. What’s up Madlang People?!!! Mabuhay lahat ng naglaan ng oras para bumoto. Magkakaiba tyo ng opinyon at gusto at OK lng yun dahil ganun ang  DEMOKRASYA. Kaya ang panalangin ko ay sana IRESPETO natin ang boto ng bawat isa khit magkakaiba. Walang mas tamang boto. Walang mas mahalaga. Bawat boto ay may bilang. Matalino, magaling at MATINO si CHEL DIOKNO.  Iboboto ko sya para sa lahat ng Madlang People na naghahangad ng bansang may hustisya. Sana maisama nyo rin sya sa iboboto nyong 12. Gora!!! Buy na kayo ng bagong book ko mga vaklang twoooooo!!!! https://t.co/xY2W8t30Gq RT @jinkyfab: Ang lambot lang. #SoldOut #AngFantasticConcertNgVaklangTwoo https://t.co/7PD79UDmzq RT @jinkyfab: Thank you Pechanga! SOLD OUT! #AngFantasticConcertNgVaklangTwoo https://t.co/oqvDSSGoMe Maraming Salamat sa lahat ng Madlang People in Chumash and Pechanga ! 2 sold out concerts!!! Kavouge!!!! First time kong mag gym!!! Feeling ko ang payat payat ko na. I do not know lang ha! awwwww!!! F na F ni betleee!! https://t.co/nxPxi4HVK7 Mahal ko kayo! Salamat sa pagmamahal din ninyo. Lets all be happy! Let’s create an environment full of LOVE. Full of JOY! Wag nyong masyadong damahin na kayo ung mga karakter sa mga dramang pinapanuod nyo. Minsan tanungin nyo din ung sarili nyo.  May problema ba talaga ko o OA lang ako?! Dahil di mo sila pag aari. https://t.co/NAdtfBXIOg Ay walang ganun. Sasaya at lulungkot ka at yun ang magpapadama sayo na buhay ka. https://t.co/oJET3QQ4yd Teka bakit parang nagkaepisode na ng Madam Bertud dito sa twitter!!! Nilibang nyo ko nga bakulaw kayo. Super sagot baman ako!  I do not know lang ha! Wag mog isipin kung hanggang kelan ka magmamahal. Basta magmahal ka lang. Dahil kung magiisip ka ng magiisip nasasayang  at lumilipas ang oras sa pagiisip at hindi sa pagmamahal. https://t.co/vVe32I1JuK There are people who create music so their souls can sing and not so other’s ears can hear. And they are joyful. https://t.co/WLH1wVmYNc Maging masaya kang isipin na nalulungkot ka. Kaya ka nalulungkot kasi nagmamahal ka. Masuwerte ang mga taong nakakadama nito.  At pwede namang magmahal sa malayo. https://t.co/WF0PpFmRjj Ask urself. Pag huminto ka ba mas magiging maganda ang resulta? Mas may pag asa ba pag sumuko ka? https://t.co/7XccHwJl5V There’s nothing wrong w/ being sad. U have a reason to be sad. But also dont forget that u have more reasons to be happy.  Maghihiwalay lng naman kayo di pa kayo mamamatay. Masasanay ka din. At pag sanay ka na di ka na malulungkot. https://t.co/WF0PpFmRjj You must realize that you had the wrong reason why u helped. U do good to others because thats the right thing to do. Not because you want something in return. https://t.co/1gTo4O5b2V True!!! https://t.co/u3HtFaxcBR I understand you. But please know that there are still a lot of amazing people around. Allow them to touch ur life and be touched by urs as well. Trust sparks joy. https://t.co/5ahXXAfLif ha??!! Itulog mo na yan girl! I do not know lang ha! https://t.co/5Bt120UOh2 Allowing others to be happy sparks joy. Selfishness sparks sorrow. Self love sparks joy. https://t.co/R7P0rvz6wL Be inspired to inspire. You should be with people who inspire you to do good , to be better and to be the best version of urself. Love sparks joy. So does family, friendship, peace, service, compassion, content, respect, self worth. Fun is different from joy. Compassion sparks joy. https://t.co/nA35V1hgy2 Yeheeeeeeyyyy!!! Isang eksaheradang THANK YOU PO sa mga Kapamilya natin dito sa LA.  SOLD OUT! Saveeeeh!!! Lalo akong naexcite magperform bukas. I do not know lang ha!!!! https://t.co/nmDiiKSnCd Never be with people who don’t spark joy. RT @nbsalert: Get your copy of Vice Ganda's new book: Tutoy! Pre-order now:  https://t.co/QY2OcNLywu. #NBSfinds #NBSNewReads https://t.co/I… Love you December Avenue!!! Hope to see you guys again soon. Im a super faney! https://t.co/8bwVI3rkeK I just had a show in CamSur. Super sorry sa December Avenue kasi nakanta ko sa sing along part ng program ung kanta nila not knowing na sila ung kasunod ko. I apologize. My bad. Nahihirapan ka man sa hinaharap mo ngayon isipin mo na lang may matututunan ka dyan. Pinahuhusay tayo ng pagsubok.  Kaya mo yan! Ikaw pa ba! Smile! Lord we pray na wag na pong magkaroon ng kasunod na lindol.  Kung magkakaroon man nananalangin po kami na walang masawi, masaktan, mapahamak o masira. Ipinagdarasal din po namin ang mga nasalanta. Amen. QUOTANG QUOTANG INA!  \n😋😋😋😋😋\n#GGVSummerBoys Ate @reginevalcasid  yung totoo???!!!! Clown ang tingin mo sakin no??!!  lolz\n#IdolPhilippines #IdolPhilippines Mga Little Ponies support nyo ang Meme and the rest of the Idol judges tonyt. 7:27pm ang ere ng #IdolPhilippines . Itigil ang mga ginagawa. Khit tumatawid ka huminto ka. Pag nasagasaan ka pasensya na! #IdolPhilippines na mga vaklang twoooo!!! Baka lang miss nyo na ang fez ko! Celebrate life. Celebrate the gift. Ang sarap isawsaw ng french fries sa sundae. Mas magandang pinagdaanan mo na yan ngayon. Para bukas mas magaling ka na. Kung bukas mo pa yan pagdadaanan. Sa isang araw ka pa gagaling. ❤️💋🐴🐴🐴🐴🐴💋❤️ https://t.co/zeqkv4sopC Ang sarap ng ulam na gawa ng Nanay mo. RT @kennymanalad: Finally, may local brand din na nag release ng deeper shades ng powder. Other brands should take note. 💁🏻‍♀️ @vicecosmeti… RT @vicecosmeticsph: Nahihirapan kaba maghanap ng right funda?🤷🏻‍♀️Our Ganda Advisors can help you find your Ganda Tribe &amp; own your shade,… RT @vicecosmeticsph: The moment you’ve all been waiting for Ganda People! 🙌🏻🙌🏼🙌🏾 The #DuoFinishFoundation will be available in Vice Co Stor… Ding ang vatwoooohhh!!!!!  Vaklang twoooo!!!!\nKeri? Kahit gaano mo kalinaw ipaliwanag ang gusto mong sabihin meron at meron pa rin talagang di makakaintindi. Magdasal ka na lng at humingi ng karagdagang pasensya. Umpisahan mo ng buuin ngayon yung uri ng buhay na gusto mong magkaroon balang araw. You start now. If you start tomorrow you’re already a day late. Sana maitama mo yung mga mali mo kahapon. Pray and ask for guidance. RT @vicecosmeticsph: Sino ang ka-Ganda tribe mo? \n@ashleysandrine is #GandangTisay ✨\n@tonisiaa is #GandangChesa 🌷\n@kissesdelavin is #Gandan… RT @vicecosmeticsph: Sino ang ka-Ganda tribe mo? \n@praybeytbenjamin is #GandangShadeNiVice 💖\n@maealayug is #GandangMoreyna 🍂\n@maymay is #Ga… RT @vicecosmeticsph: Get the Duo Finish Foundation on April 4 at our flagship store in @ilovemarketmarket , Vice Store at North Edsa, Trino… Gabi na! Ikain mo na lang yang bwisit mo! Masyado ka ng madaming dalang problema. Magbawas ka na.  Yung mga pwede mong palampasin palampasin mo na. Yung mga pwede mong patawarin patawarin mo na. Kesa bitbitin mo pa. IpagpasaDiyos mo na lng yung iba. Sapat na ang mga issues ng buhay mo para maging busy ka.  Di mo na kailangan ang issues ng iba. Psssssssstttt!!!! Wag masyado matense at mastress. Maaring mahirapan ka. But you will make it sooner or later. Kapit lang sa HOPE. God won’t allow you to fail. Ang saya!!!!! https://t.co/HxOopDMPLD Andami mong kailangang gawing desisyon sa bawat araw. Nakakalito. \nadVICEGANDA: If it’s not worth it don’t do it. May rason ang lahat. woooooooowww! Kavogue!!!! 12 Million Twitter Followers!!! Ibuuuuhhhhh! Budol is real! chozzzz!!! Seriously MARAMING SALAMAT PO for making me the most followed Filipino on twitter. Hayabayabayu! https://t.co/47WcUBnhhO Maraming problema ang natatapos at maraming damdamin ang gumagaan ng dahil sa simpleng “I’’m sorry!’. Hindi lahat ng pinoproblema mo e kailangan mo talagang problemahin. Yung iba dyan pinapalaki mo lang. Wag mong pahirapan ang sarili mo. Madami kang haharapin ngayon.  Start with a prayer. Hingang malalim. Focus. Then move.  At bawasan mo ang pagtutok sa cell phone. Kaya wala kang maachieve e puro ka phone! Make this day special for your family.  Don’t waste the chance.  Tomorrow is never promised. Gaano man yan kahalaga deserve mo pa ring magpahinga. Di ka naman bibitaw magpapahinga lang. Di masama. Kung di ka magaling siguraduhin mong mabait ka. Para may dahilan naman yung swerte para piliin ka. Pwede namang magkaiba pero di magkagalit. Not everyone will like you. It’s ok. You don’t like everyone too anyway. That’s acceptable. Sa mga bagay na ginagawa natin laging itanong sa sarili “Anong kapalit nito? Blessing o Karma?!’”. Sa mga bagay na pinakikialaman natin laging itanong sa sarili “Apektado ka ba talaga o umeepal lang?!”. Hashtags’ best performance ever!!!  Bravo!!! Lumaban hangga’t kaya. Pero wag patayin ang sarili para mabuhay. oh my Lord this is really sad. Pls give us strength. Thank you Lord for giving me a chance to meet Chokoleit and become his friend. Im sad that we lost him. But happy that he’ll be in a much peaceful and happier place now with you. Thanks for everything Chokie. I love you!!!  Rest well my friend. Relationship is not ownership. You dnt have to spend a lot to make a life. Spending time with your parents is life. Laughing w/ friends is life. Sleeping is life. Singing till u lose ur voice is life. Playing with pets is life. Lying down smiling and praying is life.  Life can be simple. Make it simple. Ngayon masasabi kong tama ang naging diskarte ko.  Hinarap ko muna ang hirap hanggang sa ginhawa ang nalasap.  Di ako umangal. Nagtiis. Pero ngayon ako na ang magdidikta kung kelan ako magpapawis at kung kelan ako bubungisngis. (5) Bumibili ako ng gusto kong bilihin. Natutulog hanggang gusto ko ng gumising. At pag nakabawi na ay muling magbabalik sa pagtatrabaho.  Araw araw nagpapasalamat ako sa Diyos dahil lubusan kong naeenjoy ang buhay ko. Di perpekto pero ipinagpapasalamat  ko.  (4) Ngayong may ipon n ko ngayon ko binibigyan ang sarili ko ng karapatang makaramdam ng pagod. At pag napapagod ako humihinto ako. KUMAKALMA. HUMIHINGA.  Ninanamnam ko ang sarap ng buhay at ang mga taong mahalaga  sakin.  Pumupunta ko s gusto kong puntahan. Kumakain ng masarap.  (3) Wala sa bokalularyo ko ang pagod, inip at stress. Ang alam ko lng  ung salitang FOCUS.  Di laging patok. May mga araw din n lugmok. Pero  laban n laban ako. Walang sukuan khit laputan. Umiyak hanggang matuyuan. Lumipas ang ilang taon at ayun n nga s awa ng Diyos umasenso ako. (2) Nung bata pa ko wala akong ibang ginawa kundi magtrabaho ng magtrabaho. Walang patlang. Sagaran. Kasi desidido ako sa gusto ko. ANG MAKAIPON ng higit sa sapat. Para magawa ko ang gusto ko para sa pamilya ko, sa sarili ko, sa mga taong mahalaga sakin at sa ibang tao. (1) It is important that we make a living.  But it is more important to make a life. Don’t just survive. LIVE. Madlang People in Guam!!! Watch kayo ng concert ko dyan sa March 17 ng matanggal ang mga stress nyo. https://t.co/YP6v6ONePy Kalma! Para di ka mataranta unahin mo kung alin ang pinakamahalaga. Learn to prioritize. Matulog ka na. Wag mong ngaragin ang sarili mo sa paghihintay. Kung darating yan kahit tulog ka darating yan. Kung di yan darating kahit gising ka di yan darating. So matulog ka na para fresh ka dunating man o hindi. Start moving now. Daliiiiiii!!!!!Effort delayed. Success denied. Pssssst! Gawin mo na yan. Wag kang tamarin. Ipagpaliban mo man eh gagawin at gagawin mo pa rin. So ba’t di mo pa tapusin?!! Gora!!! Ravaaaan!!! Masyado kang madaming iniisip. Relax. Wag mong stressin ang sarili mo. Lagyan mo ng konting smile. Maaga pa. Wag kang magpatalo sa badvibes. Lagyan mo ng konting smile.  Dali!! Yabyu!!!! Good luck sa lahat ng mga nagrereview at may exams bukas. Wala ka nang magagawa sa mga nangyari kanina. Pero may magagawa ka bukas. Kaya matulog ka na. Para bukas handa ka. Start na ng bakasyon at pahinga ko today. Pero dahil mamaya pa naman ang flight ko pasok na muna ko sa Showtime. Ayokong mamiss ang fun. Pssst! May mga times talagang di mo mapipigilang mabwisit at pumatol. Pero wag mo pahabain ang badvibes. Hingang malalim then bawi. Sayang araw. Sayang life. Smile. Birtdey ng Nanay kong si Maricel Soriano. Kaya kakain kami sa labas. Dun tayo sa mahal natin at mahal tayo. Sa masaya lang. Gawin nating kalmado, makulay at masaya ang mga buhay natin. Yan ang deserve natin. Iwasan nyong ifollow ung mga laging maraming hinaing, ung mga laging galit, ung mga laging may kaaway, ung mga nagpapalaganap ng tsismis. Naku ang nega ng mga yan. Maa-absorb nyo maniwala kayo sakin. Toxic na ang life natin as it is. Wag na nating dagdagan pa ng negativity mula sa ibang tao. Dun na lng tyo sa masaya, sa kalma lang, sa nakakainspire. Pag nega dedma na. Spare urself from stress. I avoid reading negative posts. I dont follow negative accounts. Pero kung kakilala at nafollow ko na minu-mute ko na lang. Malaki ang epekto ng mga nababasa at nakikita natin sa atin. Di mo namamalayan nabibitbit mo yung negativity. I love you my Little Ponies and Babies!!!! Basta! Salamat sa inyong lahat! Sobrang bongga nyo! Sobra kong daming narerealize habang nakaupo ako dito sa loob ng sasakyan.  Grabe pala talaga mga pinagdaanan ko. Di ako makapaniwalang nalampasan ko yun. Grabe si Lord!!! Niyakap at prinotektahan nya ko all this time. Pero ang pinakao-overwhelm ko talaga e yung fact na pinapatawa ko lang naman kayo pero sobrang pamamahal ang ibinalik sakin ng napakaraming tao. Pagmamahal na bumubuhay sakin at sa karera ko. Ang galing! While they keep on hating I keep on winning. Gaano kaya kasakit yun for them? I just wonder. Naimagine nyo ba kung gaano kalala ang mga pangbabash at hate na inabot ko dito sa social media eversince?! Malala pa sa eksaherada! And I’m still here alive and winning. Ang tatag ko pala. Ibang level ung strength na binigay sakin ni Lord. May mga araw talagang parang di pabor sayo. Ok lang yun. Ganun talaga. Wag mong masyadong damdamin.  May bukas pa. Walang patlang.  Dere deretsong trabaho. Idlip lang ang pagitan. Pukpok ng pukpok. Patok na patok. Andaming biyaya. Good girl siguro ko! Yung andami mong  satsat at reklamo pero wala ka naman talagang magagawa. Ang sad nun! Ang dami mong pinaglalaban! May saysay ba lahat sa buhay mo yan? Sayang araw! Dun lang tayo sa may kabuluhan. Di ka gumising ng maaga para mabwisit.  Kalma. Focus on the purpose. Hingang malalim. Smile! Namimiss ko na si @reginevalcasid !!!!! #sepanx RT @ovationprod: GUAM! @VICEGANDAKO IS COMING FOR YOU! MARCH 17 AT THE UNIVERSITY OF GUAM CALVO FIELDHOUSE!\n\nVIP tickets now available at N… Salamat po Lord!!!! Salamat po talaga!!!! Hey you! Di ka perfect. And it’s ok. May mga araw talagang sablay. Pero pwede namang bumawi. Kaya yan!!! Simulan mo sa ngiti. Pramis epektib. I am broken.  But everytime you give me the chance to make you happy I HEAL. https://t.co/WXL9wzEGJp Pssssssst!!! Wag kang mastress.  Napagdaanan mo na yan dati. Natapos din naman diba. Kaya yan! Hope u feel better. Sending u some love! 💕💕💕 https://t.co/PtZ6e00IrZ hahahaha hanggang dyan nabudol kayo! lolzzz https://t.co/0yYGySGgov hahahahhaha natatawa din tuloy ako! https://t.co/So9k6y7YdU Pssssssst!!! Daanin mo sa smile. I am deeply touched to know that i am able to affect your lives in a very positive way. Thank you! RT @UberFacts: Going to concerts and experiencing live music can be more beneficial to your mental health than yoga, according to researche… Sometimes you go to the wrong choices to get to the right place. O ngayon di ka makatulog?! Kung pinalampas mo na lang kasi sana yung walang kakwenta kwenta e di sana di kayo magkaaway!  Arte mo kasi e. My latest vlog It’s BREAKTIME with It’s Showtime Family is now up on my youtube channel. Watch nyo na dali. Vaklang twoooo!!! https://t.co/YloHlImyMa Wow!!!! And im the happiest! https://t.co/DJcqDAmDXU I was one of them. And i understand them. https://t.co/WvWMurMKBf Kumakapit din ako tulad nyo. https://t.co/DeIzZgyJwR Thanks! I appreciate that. https://t.co/8UwKWqeVEr Save lives. Change lives. https://t.co/uGvGpxuFKV Takbo lang ng takbo gaya ng isang kabayo. https://t.co/uNoeUMzxNm When and where? https://t.co/kgi4dTEySI It works. https://t.co/VGUyr42ESc Walang anuman. https://t.co/deOE0A2RDV Wear it everyday. It never gets out of style. https://t.co/bwakSs189Q I know the feeling. https://t.co/HyTUXU0QtW Lets get married. https://t.co/xtLwDnckPQ I may get tired but i won’t quit. https://t.co/MnjBiAF86g Make them happy. Make them young. https://t.co/i8yhyJ5fP5 Happy is for Mommy! https://t.co/jHgZIzSUxG Free delivery. https://t.co/dMe3wGyfhp take a dose of me everyday. https://t.co/cgstIIDBJy You’ll get by with a smile. https://t.co/SpHB2TZN1i I exist to make you happy. https://t.co/dd7FRtIuI1 Ganun lng dapat. https://t.co/GVvzfpmviN Kapit tayo sa masaya. https://t.co/4VSfjQp8FE Vice Ganda at your service. https://t.co/s5M0Bb7A6S Gamitin mo lang ako para wakasan yang deppression na yan. Kapit lang! https://t.co/RrjtRKD6qx Flying back to Manila now. Praying na wag madelay ang flight. Pag nagkataon si Mariel lang ang host ng Showtime. 🙏🙏🙏🙏🙏 Ang pinakapasabog na concert ng taon! Asia's Songbird Ms. Regine Velasquez &amp; the Unkabogable Phenomenal Box-office Superstar Vice Ganda in not just 1, not just 2 but 3 nights of musical surprises &amp; all-out tawanan! Hugot na ng emosyon at pambili ng tickets, bago mahuli ang lahat! https://t.co/2aXXu09QqV Delayed ang flight. O e anung bago???!!!!! My loves!!!! https://t.co/pLCrpaEAca On my way to SM North Edsa with Ronnie, Zeus, Kid, Wilbert, Vitto, Jimboy and Ryan Bang.  Tara na!!! Date tayo sa Fantastica! Halika samahan nyo kami ng mga Hashtags manuod ng Fantastica sa SM North Edsa Cinema 9 6:50 screening.  Tara sabay sabay tyo tumawa. RT @iamdezcias: Isang malaking THANKYOU sa lahat ng bumubuo ng #Fantastica dahil muli kong nakita ang malalaking ngiti at muli kong narinig… RT @heyitskemay: Because mama wants to watch #FANTASTICA so ayun nilibre ko sha at super naenjoy kami ❤️❤️ guys you should watch! Promise s… RT @HolyArianism: Treating them on their first big screen movie. Good vibes lang, walang ending. Thanks @vicegandako for making them laugh,… RT @ArvinParas1: Ngayon ko lang napanuod ang #Fantastica Tawang tawa ako PROMISE! Galing mo ate @vicegandako Ang dami mo pinasaya sa movie… RT @cookiegonzales8: humabol before magback to reality nd good vibes only... ang sakit ng panga kakatawa from start to finish... thank you… RT @ArcillasMaisie: Ang ganda ng Fantastica, ang sakit ng panga ko kakatawaa lalo n ung bloopers haha ang galing talga ni meme @vicegandako… RT @Camille_Pineda7: My family and I had good laugh watching #Fantastica! Congratulations, @vicegandako for being the no.1 again at the box… RT @SilentDEVONair: Watched #Fantastica earlier today with the fam! The long queue was worth it. 😁 Nakaka-good vibes at nakaka-happy talaga… RT @itsmishil: meme Vice @vicegandako ! nanood po kami kanina ng #Fantastica Yeeyy! Worth-it yung pagpila namin nang matagal, as in inabot… RT @KathHorannn: worth it ang bayad hahahaha ako na ata pinaka maingay sa sinehan hahahaha #Fantastica RT @anmalylika225: #Fantastica super worth it!!!💖 Patatawanin ka talaga ng bonggang bongga!!!😆😆 @vicegandako https://t.co/J9vQwDvIPh RT @aizhapatenio: Done watching #FANTASTICA 👏👏👏👏👏panalo 👍 @vicegandako ur the best. . . 😗 @iamAndalioLoisa tawang tawa din aq sau pati ke r… RT @PrincessSooyou1: Finally napanood din kita \"FANTASTICA\" ni atee @vicegandako with my friends 😍 Masaya siya superb 😃 Sa sobra'ng saya ko… RT @BaroyVee: @vicegandako Panalong panalo talaga manuod ng #FANTASTICA done watching yesterday super nakakagoodvibes...😉😉😉😁😁😁 dami kong ta… RT @ShiellaPia: @vicegandako Grabe napaka FANTASTIC talaga ng buong cast ng #FANTASTiCA ,walang part na hindi ka maluluha sa kakatawa from… RT @afgar_jared: Grabe ang good vibes at happiness ang dala ng fantastica. Sa mga hindi pa naka nood? Nood na! At siguradong matatanggal an… It’s Sunday!!! Panalong manuod ng #FANTASTiCA today para may baong good vibes sa mga magbabalik iskwela. Tandaan PANALO ANG MASAYA!!! ahhh ehhh sorry Ate Reg pero si Ogie talaga e! lolzzz https://t.co/TIReCJbmPi Now in Abu Dhabi for a 2-hour lay over. Atat na atat nakong makabalik ng Manila. May yayakapin ako ng mahigpit at hahalikan ng madaming madami. Last day in Paris. I miss Manila and the Madlang People already. awwwwwwww!!!!! nakurot ang puso ko. Pls tell him I love him. 💕💕💕 https://t.co/qWdhRoJzt0 Muli panalo ang MASAYA.\n#Fantastica 400 Million THANK YOUS Madlang People!!!! Ipagpatuloy natin ang pagyakap sa SAYA, TAWA at LIGAYA ng maging FANTASTIC ang Bagong Taon natin. #Fantastica Kakasimula pa lang ng taon. Dapat tumatawa ka. #Fantastica Bye Barcelona!!!! See you in a bit Paris. Happy New Year Madlang People!!! Mahal na mahal ko kayo at patuloy pa tayong magmamahalan ngayong 2019!!!! Thank you very much for a fantastic 2018!!! Part 2 of my Boracay Vlog is already up on my youtube channel.  Super fun!!! Watch and subscribe. https://t.co/789TVza8WF RT @teamvicePH: Marami pang harutan ng mag-ina ang mapapanood niyo sa part 2 ng Boracay Vlog ni Meme! 😂😂😂 Subscribe to our youtube channel:… RT @teamvicePH: 😱😱😱\n\nUploaded na ang part 2 ng Boracay Vlog ni Meme! Pampadagdag good vibes sa pagpasok ng 2019! Watch na! Link of our page… RT @teamvicePH: 500k++ na ang subscribers natin sa Youtube!!! At bilang year-end gift, mapapanood niyo na ang Part 2 ng Boracay Vlog ni Mem… When you’re POSITIVE and HAPPY you attract SUCCESS. #Fantastica Gamot sa stress. #Fantastica https://t.co/UkWRXqCEHQ This season is for FAMILY. #Fantastica https://t.co/PkJrOxFbpU May biyayang dala ang pamilyang masaya. #Fantastica https://t.co/H5quxNU3pB Happiness for the family. Because Family is ❤️. #Fantastica https://t.co/FdPdP19unm RT @crzyarchi: I swear you gonna enjoy FANTASTICA! as in! pati bloopers hindi mo palalampasin 😂 Sumakit panga ko kakatawa. #FANTASTICA @vic… 300Million THANK YOUS  Madlang People kong mahal!!!! Panalo ang masaya!!! #Fantastica RT @itsmeyumireyes: Malungkot talaga ako nung pasko pero nung napanood ko fantastica grabe ang saya @vicegandako thank you for making me ha… RT @duhhhhryl: pumasok ng malungkot, lumabas ng may ngiti sa labi❤ congrats @vicegandako u never failed to make ppl happy!!  #Fantastica Happiness is strength! God bless you and your mom!!! ❤️ #Fantastica https://t.co/wwMG2eYe7X Shout out to all My Little Ponies and the fans  of Chard, Dong, MayWard, Loinie, Donkiss who organized so many block screenings for #Fantastica !!!! I appreciate it! Fantastic kayo!!!  Love you guys!!! RT @ellemich23: @vicegandako Ikaw ang Happy pill ko!!! I ended my year with a BIG SMILE. Dami ko tawa kagabi sa #Fantastica https://t.co/1I… RT @Iambhabylove: Yung nanay kong Badtrip Sakin Dinala ko sa Sinehan at Nanood ng #FANTASTICA Sa hinaba haba ng Pinila namen Yung Galak Hal… RT @hannidayag: Watched #Fantastica yesterday with my nieces. Nothing beats the genuine laughter of lolas and kids. ❤️ @vicegandako https:/… Nanay’s boy is a lover boy!!! #Fantastica https://t.co/aNx7PX5aT1 God bless you and your parents!!! #Fantastica https://t.co/noM7MeRNYC RT @aiyahkoh27: Thank you @vicegandako broken hearted ako ngayon!!! Dahil sa movie mo naging masaya ako!!! #fantastic ang Movie mo!😘🥰more p… RT @justin_gomezzz: Umpisa nang pelikula hahalakhak ka hanggang matapos! Lalabas ka nang naka ngiti at may napulot na aral. Tunay ngang #Fa… #Fantastica is LOVE. https://t.co/XnNpC1mOwD RT @imleslie_jane: Ito yung oras na kailangan nating tumawa at deserve nating tumawa sa lahat ng badvibes na nangyari ngayong 2018. 💯✔ Perf… RT @ChixMyre: Loving is hard but saying not to love is harder. #Fantastica is a movie that is filled with love and laughter! Watching it fr… Di baduy ang masaya!!! Yan ang uso twing Pasko at Bagong Taon.  Baduy at laos ang  mga taong malungkot at mapait sa mga ganitong panahon.  Holiday season kaya dapat FANTASTIC  ka!!!! 😍😍😍😍😍 #Fantastica https://t.co/TbCdOeU9dp RT @1825e5e60d714fe: @vicegandako Maraming salamat sa gamot ng kalungkutan Vice...isa kang bayani at doktor sa aming mga may pinagdadaanan.… RT @1825e5e60d714fe: @vicegandako Gusto ko lang magpaslamat ngayon ko lang ulit naranasang humalakhak mula ng pagkawala ng aking ama at pag… Thanks for taking ur meds!!!  #Fantastica https://t.co/Cwr7A1eOvC Tumpak! Pasok ka sa next round!!! 😍 #Fantastica https://t.co/gKUILoY4oO kiss! 😘😘😘😘😘 #Fantastica https://t.co/hN02MnKliS Masaya tayong lahat!!! ❤️❤️❤️ #Fantastica https://t.co/WPkFzw58bm hahahaha ✌️✌️✌️✌️✌️ #Fantastica https://t.co/Jj4cCUGYyO 250 Million na palakhak ng pasasalamat para sa inyong lahat na pinakamamahal kong Madlang People!!!! Salamat at pinili nyong tumawa at maging masaya!!!! Deserve nating lahat ito!!! #Fantastica Hola desde Barcelona!!!!! Como estas Fantastic Madlang People????!!!! 👌👌👌 https://t.co/7vlQUE0Ygf Saya para sa mga Ina!!! 💕💕💕 https://t.co/xlqSlDzHBw Purpose served! # https://t.co/XNK9Rc56kj RT @DaphneChua12: May katabi kaming mga lalake ang nakakatawa pa dun una pa silang tumatawa kesa sa mga babae @vicegandako 👌👌👌❤️❤️❤️ #Fantastica1Love https://t.co/oN4o0RDGnF Yun ang hangad namin!!! #Fantastica1Love https://t.co/U4TATSNkG0 RT @evanie_reovoca: @vicegandako sa sobrang kwela ng Fantastica yung asawa ko sa kakatawa nabitin bakit daw ang bilis mtapos ang Fantastica… Happiness na deserve nyo! #Fantastica1Love https://t.co/ecBOkFS5VS Yes you are FANTASTIC!!!! #Fantastica1Love https://t.co/9914nHXW4c That’s the spirit!!! 💕💕💕 #Fantastica1Love https://t.co/M1kkExhTUB Masa para sa masa! #Fantastica1Love https://t.co/kCIJ75M4to wala pong anuman! ❤️ #Fantastica1Love https://t.co/E2NRUgXyLU #Fantastica1Love https://t.co/lqMoStsaWQ RT @eddison1388: Congratulations !!! Ate @vicegandako napakaganda nang #Fantastica1Love  sasakit ang panga mo sa kakatawa at grabe galing n… #Fantastica1Love https://t.co/l2XbQtY6dG RT @MelanieKisha: done watching fantastica hehe grabe sulit na sulit yung binayad kong ticket @vicegandako sobrang nakaka goodvibes ka #Fan… #Fantastica1Love https://t.co/SxEcMh6Lrm bwahahahhaah!!! napakanta ko e! #Fantastica1Love https://t.co/OidFe8sQ41 #Fantastica1Love https://t.co/qMb2DajzmX RT @ShiJyKaLaNg: Kahapon pansin ko halos mga matatanda o may edad na ang nanonood ng FANTASTICA. Nakakatuwang tignan na napapatawa sila ng… #Fantastica1Love https://t.co/V0BYgdj6kd #Fantastica1Love https://t.co/gNEf9rJRFE #Fantastica1Love https://t.co/ML8uHre7Ks RT @SarahRoxas4: Ang sarap lng s feeling n sobrang napasaya q ang mga anak q s panood nmin ng sine :) First time nmin to HAHAHA thanks @vic… RT @kititaybeauty: Omg! @vicegandako It was the best film you’ve ever made.Pinanood ko lahat ng movies mo and #Fantastica is the best.Punon… RT @tetlugay: Done watching FANTASTICA grabe iiyak ka hindi dahil sa lungkot kundi dahil sa kakatawa another successful movie Meme!! Super… RT @DaMysterious: Whoooooo!! UMPISA palang Nakaka GV na! Dami kong tawa. @vicegandako  You Nailed It again😍 Fantastica talaga😍😍🎉. RT @Cutelangdiganda: Salamat @vicegandako  dahil napasaya mo kaming magka pamilya kong di dahil sa iyung pelikula di kami sumaya ng ganitoo… RT @Cez0724: @vicegandako #FantasticaSalamatPoPilipinas esp to @vicegandako for making us laugh so hard in this movie. In the world full of… RT @iamkittyheri: Done watching Fantastica..Yung buong sinehan ay punong-puno nang tawanan at hiyawan.Thank you ate @vicegandako for this f… RT @teamjaggy22: What can I say, @vicegandako did it again 👏🏻FANTASTICA can give you a highly dose of laughter, a must see movie! Kuddos to… RT @rikayyycz: Nagmukha akong siraulo katatawa sa fantastica. Salamat @vicegandako sa regalong kasiyahan 💟. RT @Applesss1213: Sa sinehan. May kasabay kaming lola mga 80-90 yrs old na ata yun nka wheelchair pa nga sya. Nkakatuwa lng. Pinili nya mag… RT @amnah_tepacia: @vicegandako Super ganda ng movie na fantastica it was totally lit 🔥🔥 just done watching with my fam. Thank Vice dahil p… RT @Cez0724: Done watching #FANTASTICASalamatPoPilipinas . This was my first time to watch an MMFF movie. Fantastica really made me laugh s… RT @sammyfeytee: appreciation tweet to @vicegandako. you never fail to make us all burst into laughter. since i was in elementary, i've bee… RT @jajamikaelaa_: Thank you for making my day @vicegandako Sobrang saya panoorin yung Fantastica. Makakalimutan talaga yung mga problema k… 150Million na pasasalamat at pagmamahal ang ibinabalik ko sa inyo Madlang People sa buong Pilipinas!!! TO GOD BE ALL THE GLORY!!!! #FantasticaSalamatPoPilipinas https://t.co/Ss2uzKX05S RT @Cutelangdiganda: Tengene sakit ng panga ko kakatawa sa FANTASTICA nakalimutan ko nga palang down na down ako nung mga nakaraang araw HA… RT @smsupermalls: IN PHOTOS: Unkabogable Star Vice Ganda (@vicegandako) surprises @SMCityPampanga shoppers with a #Fantastica visit! \n\n#Eve… RT @dbuzzketball: Mawawala pansamantala mga problema mo sa buhay habang nanonood ka ng fantastika.... Congratulations din sa mga kaibigan kong sina @annecurtissmith @Mscathygonzaga Toni Gonzaga Coco Martin @prinsesachinita Jessy Mediola @_ricciiirivero  and Sir Eddie Garcia !!!! Tagumpay tayong lahat!!! RT @mrklwrnc_67: Lagi na lang feedback ng mga tao, maganda at nakakatawa nang sobra movie ni @vicegandako. Kaya naman kapag MMFF, matic na… #FantasticaSalamatPoPilipinas https://t.co/GCbNFAzqdJ #FantasticaSalamatPoPilipinas https://t.co/0DziiH6JFd #FantasticaSalamatPoPilipinas https://t.co/VcMLgFwmDt #FantasticaSalamatPoPilipinas https://t.co/KI4JzNXDtE #FantasticaSalamatPoPilipinas https://t.co/768e2CnEjd #FantasticaSalamatPoPilipinas https://t.co/bIqeqTqwBt FANTASTICA para sa lahat ng gusto ng masaya lang!!! #FantasticaSalamatPoPilipinas FANTASTICA para sa lahat ng may sakit at gustong bumangon at tumawa. #FantasticaSalamatPoPilipinas FANTASTICA para sa mga magulang na hinaggard ng kanilang mga asawa’t anak ng isang buong taon. #FantasticaSalamatPoPilipinas FANTASTICA para sa mga nasaktan at gustong gumaan ang pakiramdam at makalimot. #FantasticaSalamatPoPilipinas FANTASTICA para sa mga teachers at estudyanteng kailangan ng good vibes bago bumalik sa school. #FantasticaSalamatPoPilipinas FANTASTICA para sa mga empleyadong nastress sa trabaho ng isang buong taon. 👌👌👌 #FantasticaSalamatPoPilipinas 💕💕💕 #Fantastica https://t.co/uYG1SZbZN8 That’s our purpose!!! Maraming salamat po! #Fantastica https://t.co/gspjmiiGJ5 RT @KirstenKisses18: Iba ang VICE GANDA di talaga masasayang ang pera mo. subrang saya sa cinehan sigawan ng kakatawa @vicegandako\nTapos Ta… RT @mchljycrz: Ang cute nung mga matatanda na nanunuod yung mga katabi namin, tuwang-tuwa talaga sila! @iamAndalioLoisa @iamr2alonte @viceg… RT @sportyfedz: Just finished watching #Fantastica. For me this is the funniest movie of @vicegandako. Super tawa ng mga tao from the start… RT @imanamayzing: done watching fantastica, sobrang gandaaa, dami kong tawa kay vice! tapos ang dami ding kilig moments sa donkiss, kainis!… RT @JeynPrinses: #Fantastica a MUST WATCH MOVIE.Walang tapon na eksena kasi lahat may emosyon.di ko kinaya yung boses ni ms @padillabela pa… RT @msluckyrosales: Super Ganda ng Fantastica!!! Congrats @vicegandako  sa napaka gandang pelikula and sa lahat ng cast!!! Andaming pasabog… see u in a bit SM North Edsa and Trinoma! #Fantastica Maraming Maraming Salamat SM Pampanga!!! Mahal na mahal ko din po kayo!!!! #Fantastica #FantasThankYouPo https://t.co/xZpYIs3A9Y #Fantastica #FantasThankYouPo https://t.co/hXYbDQFBS3 RT @sapphira0923: In my Father’s words: \n\nMaganda ‘tong movie ni @vicegandako light at nakakawala ng pagod. Yung tatawa ka lang, wala kang… 100Million na palakhak, pagmamahal at pasasalamat po Madlang People sa buong Pilipinas!!! FANTASTIC tayo ngayong Pasko!!! #Fantastica On my way to SM City Pampanga! \n#Fantastica #FantasTHANKYOUPO CORRECTION: Sa SM CITY Pampanga po pala ko pupunta today. see u there!!!! RT @CyrelAnn1: Grabee,  grabee HAHA grabee ang tawa ng NANAY ko! Ibuuh ka talaga meme! Thank you for making us laugh po. ☺👏🙌  @vicegandako… Maraming salamat po!!!  ❤️❤️❤️ https://t.co/FYzBNx3a5n RT @chaddydidodu: Watched FANTASTICA earlier with my fam and sobrang daming tao. Grabe ka @vicegandako! Sold out agad! Tapos sa loob agawan… RT @MelvinAragones3: Uwiin na! my Nanalo na po. Congrats @vicegandako  sobrang ganda ng Fantastica. walang katulad. The Best 👏🏻👏🏻👏🏻😇😇 RT @SkyintheCT: Fantastica gives a dose of laughter &amp; happiness, a little bit of drama and tears, magic &amp; fantasy, and most especially, lov… RT @rufi_bareja: Sobrang saya ng fantastica worth it ang bayad naluluha AQ sa kakatawa grabee puno ng tawanan sa loob ng sinehan congrats a… RT @anne_chubs05: Nanood ako ng last full show ng fantastica last night.. Grabe buong movie tawa ng tawa lahat na nanonood. Walang tapon..… Gora ako ng SM San Fernando mamayang alas tres. Kitakits mga Madlang Kapampangan!!! Babasbasan ko kayo ng kagandahan ko!!! #Fantastica RT @ailyn_lacerna: Yahoo ang solid ng crowd punong puno ng palakhakan 🙌 naenjoy nmin ng fam ko congrats @iamAndalioLoisa support ka namin #… RT @itsredness: @vicegandako thank you for making my christmas Merry because of the happiness you brought and the other casts of Fantastica… RT @ElulaJoy: Sulit ang bayad! GV GV lang... Walang ending!! Ang galing mo @ryanbang Lablab kita😘. \nCongrats meme @vicegandako 😍 at sa laha… RT @barbiedale0729: And hello naman kay #RichardGutierrez  at #DingdongDantes . Ang gagwapo pero nakakasabay tlga sila sa comedy. Grabe! An… Itawa mo ng eksaherada ang Paskong ito!!!!! Sugod na sa sinehan mga suki!!!! #Fantastica https://t.co/TGJS96hKot Maraming Maraming Salamat Po!!!!\n😍😍😍😍😍😍😍😍😍😍😍😍\n#FantasticaNowShowing RT @darLasauLer: And it is a MERRIER CHRISTMAS for us dahil sobra ang ligayang binigay ng #FANTASTICA sa amin! Nakakaloka yung mugto mata k… RT @sapphira0923: Never heard my father laugh so hard! Sobrang tawa nya especially sa mga antics ni Belat. \n\nThank you, Ate @vicegandako fo… awwww 💕💕💕 #FantasticaNowShowing https://t.co/FgrmDDPwOx RT @propertyofvice: The movie where I lose all my control from laughing. I will NEVER forget this. Best VICE GANDA movie ever! @vicegandako… RT @buanMarc: Fantastica is done! Well, mukha namang naachieve ni @vicegandako ang hindi lang sampung libong talakhak kundi sandamakmak na… RT @dantresvalles: Mga Bes! nuod na kayo ng #FantasticaNowShowing Legit ! part na ko ng Team PalakHak @vicegandako iba ka! LODI! sobrang ta… RT @dantresvalles: Hindi Fake News ang katatawanan na hatid ng #FantasticaNOWSHOWING @vicegandako salamat sa Maligaya at Masayang Pamasko.… #FantasticaNowShowing https://t.co/EjOlNvAs11 RT @ratresvalles: Hindi ka talaga bibiguin ng isang VICE GANDA. Watch na rin kayo para mas happy ang Pasko nyo.  Pangako sulit at masaya an… #FantasticaNowShowing https://t.co/tNhR7j3pjv #FantasticaNowShowing https://t.co/4gaw1qQD2I 😍😍😍 https://t.co/aoJYC5Dkxr 😍😍😍 https://t.co/GiCwPn8ykI 💕💕💕 https://t.co/3od3QU0X6x Merry CHRISTMAS everyone!!!!! Enjoy this night with your family, friends and loved ones. Fill your heart with love and joy. Have a fantastic one!!!! Pasko diba?! So dapat nakatawa ka. Dapat masaya ka. Yan ang ipaparamdam sayo ng FANTASTICA. Excited nako na maipalabas bukas ang FANTASTICA!!! Sigurado akong  mapapatawa at mapapaligaya namin kayong lahat. Gusto ko nakatawa ka sa araw ng Pasko! Deserve mo! RT @ABSCBN: The most awaited event of 2019!!! \n\n2 ICONS. 3 NIGHTS. 1 SPECTACULAR EVENT! \n\nSoon! \n\n#RVAVGinAraneta\n\n@reginevalcasid @vicegan… Abangan nyo ko dyan sa Rizal mamayang 3pm may Fantastica Motorcade na magsisimula sa Ynares Center ng mabasbasan naman kayo ng aking Kagandahan!!! ang ganda nito! pls allow me to grab and repost it. ❤️❤️❤️ https://t.co/tGmE9t93ZP Minsan talaga nagwowork din ang arte artihan at tampo tampuhan e. Minsan! very byuuuutipul gel!!!! https://t.co/WCsAlptYTB https://t.co/4fobXagGFK\nWatch my Bora vlog dali masaya to. subscribe na din to my youtube channel para winner. Ok lang yan Miss South Africa. Balang araw matatanggap mo din. lolz https://t.co/opMi6SRk0o Philipppppppiiiinneeeesssss And to the designer of Catriona’s red gown Thank You and Congratulations!!!!!! Tama na yan Neyo. Koronahan nyo na si Catriona at may trabaho pa ko! Maganda sagot ni Venezuel pero madaming sasagot ng ganun. Si Catriona ibuuuuuhhhhhh!!!! Ibuuuuuhhhhhh!!!! Tapos na! Panalo na yan!!!! Philippines HIGH ang nakuhang score ni Catriona sa sagot nya sa marijuana. Kinabahan ako. Atin na to damang dama ko!!!! si Catriona na yaaaaaaaaaaaannn!!! Philipppppppppiiiiiiiinnnnneeeeessssssss pasok sa top 5!!!!!! Si Thailand habang tumatagal nagiging Mocha Uson. Catriona is baaaaaacccckkk!!! 👏👏👏👏👏👏👏 Palakas ng palakas dating ni Vietnam!!! Continue praying for Catriona!!!! Kapiiiiiiiit!!!! Parang bumaba ang energy ni Catriona. Alam kong pagod ka na girl pero kapit lng. Konting utot na lng kokoronahan ka na. Eyes on the prize!!! Pasok sa Top 10 si Catriona mga betleeeeeeeeeeeee!!!! Kinilabutan ako sa recognition nila sa Miss Spain!!!! Ang bongga lang ng major!!!!  #MissUniverse #Transgender Si Jamaica yung kaklase mong nabigla na may graded recitation. #MissUniverse #MissPhilippines Si Canada talaga mukhang manikang katatanggal lang sa kahon. #MissUniverse #MissPhilippines Si Venezuela naniniwala sa less talk less mistake kaya di pa tapos kausapin umalis na. lolz\n#MissUniverse #MissPhilippines Si USA yung kaklase mong maganda pero bwisit ka. #MissUniverse #MissPhilippines Mukhang sa delayed telecast ka nanunuod ate! 😜 https://t.co/jhriM60xlh Di maganda yung panty na suot nung anchor na naka white pinagbukol bukol yung balakang nya. Try So-en next time. #MissUniverse #MissPhilippines Ang ganda ni Canada shit!!!! Iligpit na yan! Sagabal sa mga plano natin! #MissUniverse #MissPhilippines Ang translation ng sagot ni Belgium ‘Wag mokong pinagkakakausap ayokong manalo!’! #MissUniverse #MissPhilippines Ayan na pasok na si Catriona sa semi!!! Humanda kayong lahat!!!! \n#MissUniverse #MissPhilippines Walang baklang rarampa ngayong gabi dahil maaga ang Miss Universe bukas. Off to Cebu in a bit. Gora kayo ng SM Seaside para masaksihan nyo ang kagandahan ko ng mabless ang mga buhay nyo!!! 😜😜😜 I love you too my very loyal and ever supportive unkabogable Little Ponies!!!!!!! Kung may matris lang yung ring malamang nabuntis na ni @ThirdyRavenaaa !!!! Lahat shoot e! Ano kayang ulam sa bahay ng mga Ravenas bakit ganun kagagaling maglaro ng pamilya nila? @kieferravena @ThirdyRavenaaa Congratulations @ThirdyRavenaaa  !!!!!! Eksahearada ang husay mo! Parang jowa mo yung ring!!!!! Ang lala ng energy ng UP crowd parang fans ng isang sikat na \nK-Pop group. On my way to Araneta for the UAAP Men’s Basketball Finals.  Para fair I’m cheering for Ateneo de Manila University of the Philippines!!!! 😜😜😜 Lungkot + Puyat = Chaka\nKaya itulog mo na yan! Rampa kayo ng Enchanted Kingdom dali. Aawra ko dun today with the cast of Fantastica. Lets make this Sunday fun! Nagsikip ang dibdib ko at napabuntong hininga. At ang tanging nasabi ko na lang ay “God bless you Father Ramon Monet Bosch.’.\nhttps://t.co/V1SgShZ2XH Fantastica Official Full Trailer https://t.co/FLSHeZPk33 Ikaw, who is your sunshine? #PasokMoira Focus on your sunshine not on your darkness. #PasokMoira Gising. Dasal. Mumog. Bangon. Kain. Bukas TV. Nuod Showtime. O ayan na inayos ko na sched mo today.  #FantasticaTRAILERLAUNCH today in Showtime. https://t.co/WORm6wfcWC Gusto mong kumain. Pero gusto mo ring pumayat. So ano talagang mas gusto mo? Iyak na lang! Nawatch nyo na ba yung vlog ko sa HK trip namen last halloween? It’s up on my youtube channel.  watch nya dali! mga vaklang twoooo!!! https://t.co/49DncY2441 in fairness sa effort mo! 👏👏👏 https://t.co/mjNmzzt32Y ahhh ehhhhh https://t.co/OyIOUciThP Never realized praying with a friend  could be the coolest! Try it. First time kong naexperience na may kaibigang tumawag sakin and asked if he could pray with me and pray for me over the phone. Wow! It felt so good! thanks Billy! Dama mo talaga ko. I love you! Watch my Hongkong trip ganaps on my youtube channel.  Masaya! Dali mga vaklang twooooo!!! https://t.co/49DncXKtct Nanay time muna. Malungkot ka.  Di mo alam kung bakit. Di mo ba talaga alam? O ayaw mong aminin na yun ang dahilan? Good luck!!! kabugin mo silang lahat ng eksaherada!!! https://t.co/NujykXxKY7 maraming salamat! pakisabi sa nanay mo ‘hayabayabayu!’! https://t.co/ycS8i93BpL Eto na ang pelikulang magbibigay ng TAWA at SAYA na deserve mo ngayong Pasko!!! Kasiyahang babasag sa mga kabwisitan mo ngayong taong ito. \n#FANTASTICA\n#FantasticaPOSTERunlock https://t.co/OCTFSUzl6X Sorry sa mga tao sa Market Market na nagaantay. Eto nako isang kembot at tatlong irap na lng at makikita nyo na ang mala birhen kong GANDA!!! Traffic is vakulaw once again ladies and chenemen!!!!! Gora kayo ng Market Market! andun ako ng 4pm for the opening of @vicecosmeticsph flagship store. tara na mga vaklang twooooo!!! Wag kayong mag alala. Gagamitin ko tong sayang to para mas lalo ko pa kayong mapasaya araw araw. Maraming salamat ulit! Masarap malamang andaming ibang taong masaya para sa kasiyahan mo. at kinikilig din sa bawat kilig mo. lalong nakakadagdag ng saya!!! maraming salamat!!! 😍😍😍😍😍 Bago magreak tanungin muna ang sarili kung bakit ka apektado. You’re the BEAST! And for me you’re the BEST! guys lets all vote for 1. DJ MOD and \n2.Darren and Cashwell . Thanks! \nhttps://t.co/vUcxfbxx8C\n@dj_mod_ Hi @rodmagaru !!! Sabihin mi nga jan sa lalaki sa likod ko umuwi na sya! Ilang araw na sya jan kala naman nya lilingonin ko sya! Hmmmp!!! https://t.co/Z0rxQfuFv7 Back to regular programming! 😃😃😃 Thanks so much to my 7Million unkabogable followers on (@praybeytbenjamin) instagram!!! Too much l❤️Ve!!!! Before this day ends i wanna say THANK YOU to Rico J. Puno. Lagi naming sinasabi na favorite namin ang isat isa. Napakabait nya sakin at mahal na mahal nya ko. At ganun din ako sa kanya. Mamimiss kita. I-Hi moko sa tatay, lola at lolo ko ha. ❤️ U Koriks!!! Mula noon hanggang ngayon, kahit di ko na kayang kantahin ang mga awit mo para sa akin REGINE IS LIFE!!! @reginevalcasid #RegineOnGGV At tawang tawa ko sa bakit daw ako balot na balot??? Hahahaha!!! Seriously first time nyo bang nakakita ng naka-hoody at nakashades??? Di pwede??? May dress code ba sa Ozamis City??? Hahaha! Mithyu too bebi ko!!! https://t.co/0i995gRYP0 So dahil sa picture na to supporter na agad ako ni Imee ?! Di pa pwedeng supporter ako nung mamang naka puti dun sa likod?! Lol! https://t.co/yoAW9ClgoK Ok para sa mga fans ko na nagtatanong. Wala akong pakelam kung anung iteniraryo ni Imee Marcos sa Ozamis nung nakasabay ko sya sa eroplano. Nagpunta ko dun para mang aliw ng mga taga Ozamis City. Di para magendorso ng kahit sinong pulitiko. Di ako endorser ng mga Marcos! May mga taong ginagalit ang mga sarili nila dahil sa kasinungalingang  pinaniniwalaan nila na sila lang din naman ang may likha! Pssssst! Smile lang! ❤️ Ang laging galit pangit !!! Maraming maraming salamat Madlang People!!! Di biro ang 9years. Pero nagmukhang parang napakabilis at napakadali ng dahil sa pagmamahal nyo. Hanggang sa susunod pang mga taon! I love you!!! Fotaaaaaahhhhh ang sayaaaaaaaa!!!!!!!! #ShowtimeMagpasikat2018 RT @Fact: You'll never live a happy life if you always care about what others think about you. You’re free to be the greatest. You’re alive. Vice, Richard, Dingdong, Bela, Loisa, Ronnie, Maymay, Edward, Kisses, Donny, Ryan, Jaclyn Jose and 2 surprise big stars in FANTASTICA. Di naman star studded. Sakto lang. Nung natitigan ko yung mukha ni Marian napaisip talaga ko kung paano ko naging artista!!! Di ako nakarecover agad! Fowtah ang ganda e! #faney Our movie title is actually just FANTASTICA. https://t.co/SynoI2snBy Oh em!!! Marian Rivera joined us on our last shooting day of Fantastica. Honggondooooooooo!!!!!! Mukhang teen star!!! Nagpapicture ako talaga! Tumakbo kaya ako?! Why not? Kabayo naman ako! Last shooting day of FANTASTICA!!! Can’t wait for everyone to see our movie. Psssssst! Tulog ka na lang. Wala ka naman ng magagawa. Wag sumawsaw kung di naman kasalo. RT @sapphira0923: Wow! The ABSCBNBall did make a scene on the social media universe. Too many all knowing “humans” giving comments about st… RT @officialTIMYAP: What we missed at the red carpet: The frame couldn’t handle @vicegandako’s fabulosity in a @michael5inco gown. Like a M… RT @michael5inco: The über fabulous VICE GANDA @vicegandako made a grand statement in a 20-foot long stained glass-inspired crystallized ha… RT @ABSCBN: MOMENTS FROM #ABSCBNBall2018 : Full look of @vicegandako's attire! Log on to https://t.co/KLVWWintWJ for more videos and photos… Kalma! Eto na si Fantastica! #ABSCBNBall2018 Silipin ang naganap na fitting ni Vice Ganda ng kanyang isusuot bukas sa ABS CBN BALL. Keri ba? Vaklang twooooo!!!! 🤣 https://t.co/dp6smxwAdu Handa nako para sa ABS CBN Ball bukas. Naplano na ng mga bataan ko ang gagawin kay Liza Soberano. Kailangan iligpit sya sa lalong madaling panahon. Chozzz! Anung kinalaman ng larawan ko? https://t.co/JM3IYo0emv Ganda ka? Vaklang twooooo!!! https://t.co/oIcfssU3TB Good night !!! Gonna sleep with a smile on my face. Please just be happy for me. E kung palitan na lang yung last line ng national anthem ng ‘Ang matraffic ng dahil sa’yo’??!! Mas keri ba? My youtube account is vicegandaofficialph . Pls subscribe for my unkabogable ganaps and paandars! Dali mga vaklang twoooo!!!! God bless all of us, our families, our properties and our neighbors. Be safe Madlang People. RT @ABSCBNNews: Here is a list of emergency numbers for your reference. Keep safe, Kapamilya! #OmpongPH https://t.co/NLbLuK5aID Di lahat ng nararamdaman mo totoo. Yung iba gawa gawa lang ng sobrang pagiisip mo. Psssssst! Wag ka masyado mag-isip. YOU ARE FINE. RT @vicecosmeticsph: We made it!!!!!! W/ 6900 participants tayo na ang may hawak ng Guinness World Record sa pinakamaraming bilang ng sabay… RT @mjfelipe: IT’S OFFICIAL. Vice Ganda is Guiness World Record Holder - most number of people applying lipstick. The number to beat is 5,8… Sa mga ticket holders na pupunta mamaya sa #GandaForAllMusicFest #GandangPangWorldRecord  make sure may dala kayong isa sa 6 shades na yan para makapasok sa Araneta. https://t.co/o2crLmbDtd Paaura nako ng Araneta for the #GandaForAllMusicFest . Tara naaaaaa!!!! It’s Nanay x Tutoy day! 😍😍😍 Sumainyo ang GoodVibes!!! (Credits to @artsbygel) https://t.co/bgyEYGbGch This is just soooooooo sweet! I appreciate it. I love you too!!!! https://t.co/NHBTGBQ1Lc Tutal ayaw mo namang gumising sa katotohanan e di itulog mo na lang yan!!! Enjoy your freedom of choice. Be happy! 😍 https://t.co/symGyMKuuz Ang luma na ng bashers! Kadiri! Sobrang luma! Ibahin naman ang ganap pls! Yung bago naman. Wag ka ngang umarteng single ka at mag isa sa pagtulog! Ang sarap kaya ng maluwag sa higaan! Tah ka! Magjowa na tayo! https://t.co/15biuwbzfS Psssssst!!! Smile! Kaya mo yan!!! Lab kita! GANDAng morning! 😍💋❤️ Shiiiiiiiittttt i was pranked!!! Mga pakshet kayo @mor1019chacha @hashtag_nikko !!!!! Nastress ako!!!! Gusto mo ng jowang matino? Bakit? Matino ka ba? Drink lots of water, gargle ka ng Orahex and spray ka sa throat from time to time ng Kamilosan. https://t.co/SzEG9s4Y4j Shooting a scene with Jackie today for my movie Fantastica. Kyooooot to! Psssssst!!!! Maaga pa wag mo sirain araw mo. Sayang GANDA! Smile lang.  Ravaaaaaan! O davah napatula ka pa sa sobrang GANDA! #ViceCosmetics  #GandangFresh https://t.co/y2D1MC4BS7 Davah ngah!!!! #ViceCosmetics  #GandangFresh https://t.co/3fzjZ6Azt9 Aminin higit pa sa sulit ang Php145 nyo sa Water Gel CHEEK AND LIP TINT ng ViceCo. !!! GANDAng di mo ikahihirap!!!  #ViceCosmetics #GandaForAll https://t.co/5x2XLsgZFh GANDAng umaga Unkabogables!!!! Lalong pagandahin at pagaanin ang araw at ang buhay sa pamamagitan ng PagIbig,Pagtanggap at Pangunawa. #LoveIsAllWeNeed https://t.co/rbk9qqsiQL 37 minute morning talk with Nanay! 😍😍😍😍😍 #Precious #Moment Wag mo na higpitan ang jowa mo. Nanay nga nya napupuslitan nya ikaw pa ba! #ItIsWhatItIs I miss my BeksBatallion!!! @iamzeuscollins  @hashtag_k1d  @iamr2alonte  @hashtag_Vitto  @hashtag_wilbert That taping night na naging soju night after! I love Bela and Kim!!! #KimBelaOnGGV Hug kita. Sana pagtapos ng ulan tapos na din ang lungkot mo. Magbawas ng gulo. Magdagdag ng SAYA! RT @ogiealcasid: Here are my guests for my concert at the @TheBigDome on August 24th! https://t.co/UZCyk6Rb3i Mapagod tayo sa katatawa hindi sa kanenega! 😂😂😂😂😂 Kung di ka mapagpatol di ka masstress. RT @vicecosmeticsph: Reasons why to love Vice Cosmetics Water Gel Lip and Cheek Tint! Get yours exclusively at @beautymnl 💄💋❤️#GandangFresh… RT @vicecosmeticsph: Another beautiful collection from Vice Cosmetics. Introducing Water Gel Lip and Cheek Tint EXCLUSIVELY AVAILABLE at @b… ViceCo. Lip and Cheek Tint now available in @beautymnl . They will be available in stores on July 23. Buy na ng gumanda ka! https://t.co/CrgLcVMYxP RT @kennymanalad: SHOOKT!!! Vice Cosmetics Lip and Cheek Tint (Swatches) 😱\n\nblog: https://t.co/Egr4jLP6BG\n\n@maymayentrata07 @delavinkisses… Yung kilala mong bago umorder itatanong muna kung may wifi. Yung pagkaing madumi pero naknampucha ansarap!!! Rampa with friends!!! Ang saya ng may rampa! At ang saya ng may friends! ✈️✈️✈️ Tumpak Ganerrn!! https://t.co/73ddM41K3d Ayses ses ses ses ses ses!!!!!! Baklang toooo!!! Make your life your issue. #KAPAYAPAAN Maraming maraming salamat po!!! Mula sa puso ko! And I thank you!!! The show hasn’t started yet and im already so emotional. Im crying coz of too much joy. Sincerely, thanks for allowing the LGBTQ  rainbow shine today! #ShowtimeMissQATheFinaLAnswer From ABS to Resorts World 3hours ang byahe!!!!! Kavogue!!!! Anu to Japaaaaaaaaaaaaaaaaannnn???!!!! Ikaw ang pinagpalang GANDA ngayong araw na ‘to!!! 💋💋💋💄💄💄#ViceCosmetics https://t.co/3Vudg1Ecbx Maraming salamat! I appreciate it! https://t.co/eFKZw1WOUy EBOLUSYON ang tawag dyan. https://t.co/CaHj5PJcc0 Yung gusto mo ng kausap pero ung friend mo busy sa games. :( O diba may misa? Ba’t ka nagse-cell phone? 👊 Just got out of the hospital. Malakas na naman si mother horse!!! Hiiiyyyaaaahhhh!!!!! Hahahha this is so cute!!!  #RandomEncounter https://t.co/WsOqV5b7TC Wag ka na lumabas. Wala ka namang pang ambag. Davaaaaahhh!!! #ViceCosmetics https://t.co/VTgM9HtqA2 GANDAng kahuhumalingan pati ng mga camel sa Dubai! #ViceCosmetics https://t.co/5DbhM7Pxo4 Naknamputchang GANDA!!! https://t.co/YOmGaCYY8p RT @way_of_beauty: VICE x BANG | VICE COSMETICS FIRST MAKEUP COLLABORATION REVIEW | RIZCHELLE SIMBILLO - https://t.co/ZuATiqwglP https://t.… U deserve it! #ViceCosmetics https://t.co/EdgehSnwBF Rampa mo na yan gurl! #ViceCosmetics https://t.co/xOkxzH8Pko RT @vicecosmeticsph: We’re now accepting COD within Metro Manila! 💋❤️ https://t.co/G9M1fRIUEO https://t.co/jfExwFI5C3 So sumaiyo na pala ang kaGANDAhan! Ravaaaan! #ViceCosmetics https://t.co/u6YWOSykxa Sabi sayo e! Mawawala ang jowa mo pero ung epchuk hindi! #ViceCosmetics https://t.co/ewUK60UjM5 Maging malaya sa stress na dulot ng social media. Happy Independence Day! Andaming magulo at nega sa paligid!  Make sure di ikaw yun. Mas magandang tayo ang tagapagpalaganap ng GV. Thanks so much TeamVice for working very hard with me today and as always!!!  Kudos to all of you my management team, my social media team and my style team. Job well done! Maraming Salamat LPU Batangas! Hayabayabayoo!!! 😍💋❤️ https://t.co/PsNdmC69An Huwaaaawwww!!! And another one!!! Yeheeeyyy!  Maraming salamat po!!! https://t.co/I685y0yFui Sobrang pagod after taping GGV ANNIV episode. Pasensya na sa mga fans sa labas ng resto na pinakusapan kong pass muna sa paselfie at hug na lng kasi pagod n tlga ko. Thanks for understanding! Bawi ako next time. Bwahahhahhahahahahha! Panabla sa muntanga moment ko! https://t.co/4aHrWZ087F Bakit kahit anong pAgod ko di ako pumapanget?! Ang unfair ng life! Andaming ganap. Mejo masalimuot ang araw na ito. Kailangan ko ng salamin para maramdaman ko pa rin ang ganda ng mundo. I feel you! I personally don’t understand as well. Confusing!!! Haaaaaayyy!!! Rampa ng Trinoma support kay Anita! Yabyu sisterette!!! #SidAndAya Dessa is a monster! 👏👏👏👏👏 #ASAPSummerPlay Ganda ka? Hoy 2366 magreply ka huy! Wag kang feeling jowa na di marunong magreply tapos sasabihin tulog! #TNT2uLtimateResbak Oh my gaawwwddd i didnt notice you! Did u hug me? I miss u my little pony!!! https://t.co/duX0QnjG7x Ang aga kong nagising! Excited nakong tumawa at magpatawa. Magpakasaya tayo. Ang sarap kaya! Daming affected sa mga performances. It’s a good sign. Everyone is entitled to express. Just don’t bash ha. Good vibes lang. hayabayabayu!!! #ShowtimeTodoResbak Ang aga ko nagising! Para na naman akong perstaymer na atat na atat magShowtine. Hahhaha! I miss my show and my Madlang People!!! RT @ABSCBNNews: LOOK: Vice Ganda @vicegandako here at the Guillermo Mendoza - Box Office Entertainment Awards Night | via @mjfelipe https:/… Preparing my unkabogable look for tonight’s Guillermo Box Office Awards. Receiving my 7’th straight Phenomenal Box Office Star of Philippine Cinema award. Saaaaaveehhh!!! Kakadating p lng busy na agad. Keep them coming! Im so ready beybeh!!! Vacay is ovah!!! Coning home now. This Mother’s Day don’t just greet her right. Treat her right. That’s what mothers deserve. Naku matulog ka na!!!! Wag ka nang mag galit galitan. Bukas patatawarin mo rin naman. Sus! From Team Vice to Team Wa Vorlog to Team Zombies . Now flying to San Jose CA. Real quick! Ravaaan!!! Another Sold Out Concert in Las Vegas!!! Thank You Lord!!! https://t.co/Un7vkjkRzw Thank u so much Madlang People in Canada!!! https://t.co/wvLUWqSz2K Flying now to Vegas. Thank you Canada!!!  #PusuanMoSiViceGandaConcertTour Hoooomaaaygaaazzzzz now ko lang nanotice 11 Million na pala followers ko!!! Kavoogue!!! Love u guys!!! Thanks for the LOVE!!!! Another sold out concert!!! I love you so much Madlang People in Winnipeg,Canada! That was one unkabogable night!!!! Mabuhay kayo! #PusuanMoSiViceGandaSaCanada Too much LOVE here in Winnipeg, Canada!!!! ❤️❤️❤️❤️❤️ https://t.co/IAhPlMeOzy 1st leg SOLD OUT! Thank you Lord for another achievement!!! Thank you MadlangPeople in Vancouver for this wonderful night.  We all went home HAPPY!!!  5 shows to go. See u tom Winnipeg!!! 😍😍😍 https://t.co/nWXYulYanE Di po ako galit sa inyo Mr. Grogy Rula ha. Naramdaman ko lng po di kayo masaya para sa tagumpay ko kaya nagiisip ako kung pano kita mapapasaya. Kilala mo naman ako i want to make people happy. https://t.co/QnAYTtFmOv Kung masyadong abala nman para s inyo ang paggawa ng sarili mong pa-award e ganito na lng po. Attend po kyo ng FAMAS sa june 10 tapos pag akyat ko po ng stage at makapagpasalamat e tatawagin kita para iabot sayo ung trophy para ibigay mo kung kanino mo gustong ibigay. Keri ba un? https://t.co/QnAYTtFmOv Pangalawa, halatang di ka po masaya para sa aking tagumpay. So nag isip po ako kung paano kita mapapasaya. E kung gumawa ka na lng po ng sarili mong pa-award para ikaw ang masunod tapos magiisponsor ako ng pambilli mo ng trophy magiging happy po ba kayo? https://t.co/QnAYTtFmOv Una, Gorgy Rula di ko po kayo kilala at di ko po alam ang mga napatunayan nyo  sa buhay kaya di ko din po alam kung bakit masyado kang apektado at di nyo po kayang irespeto ang FAMAS, ang mga tao sa likod nito at ang kanilang desisyon. https://t.co/QnAYTtFmOv Its 6am here in Vancouver and i cant sleep dahil vorllog ako sa plane. So naisip kong magtwitter. At ito ang bumungad sakin. Read the article and saw what this reporter named Gorgy Rula wrote. Since di pa naman ako inaantok sasagutin ko na lang tong article. https://t.co/QnAYTtFmOv Just boarded the plane. 13hr flight to Vancouver.  Ang haba ng byahe. Wala pa man ding sustansya kausap  tong katabi ko! Itago natin sa pangalang Ronnie. Something i want to share with everyone. https://t.co/0DdJkV7Lru Masama yung nakikialam sa account tapos gagamitin sa kagaguhan. Bad yun! Ayaw ni Lord! Congratulations LaSalle Lady Spikers!!! Great game! Get it next time Lady Tams . Yung may kasama pala ko pero nakalimutan ko kaya naiwan sa ABS. Hahahhaha! Churi churi! Im happy! I hope everyone is. ❤️❤️❤️ On my way to ARANETA. Good luck Lady Tamaraws!!! Parating na ang Mahal na Bertud!!! Im voting for Kristel. If u also think she deserves to win just vote PGT KRISTEL and send to 2366.  U can alao vote through ur google accounts. Sobrang nakakaawa yung mga haters. Kasi habang hine-hate nyo ung mga tao lalo silang pinagpapala. At habang pinagpapala sila lalo kayong nagagalit. Kaya itigil nyo yang hate nyo sa kanila. May dulot sa inyong malas yan. Sadyang sumaiyo ang kaGANDAhan!!! 💋❤️😍 #VICEco. https://t.co/qNGczOuhUI RT @abscbnsports: .@vicegandako will play outside spiker for the Vice Co. Blockbusters squad who'll compete in the #PVLonABSCBN men's divis… Wag nga kayong mapangdikta! Di naman martial law!!! Sinong di navictim ng paasa? Masaya na. Tulog na. ☺️ Anung laro? Iiiiiiiiiiiit’s SHOWTIME !!! Pero inaantok nako. Kung seryoso ka aabangan ko ang tweet mo mamayang 4pm. Game! Yan nga ba ko? Yung  pinagmamalaki mo. Tapos pag may bago ka ng napanalunan itatabi mo na lng sa sulok para agiwin ako. https://t.co/kISu5mvLRN Di ako ang kalaban mo. Ako ang tropeo mo! Chozzzzz!!! 😜 https://t.co/yEHzVvlXEw Oo game lang to! Alam kong game lang to. Kaya di ako magfogocus! https://t.co/UrjzvEoU6x Ang hanap ko ay ung di ako paglalaruang parang bola. Kundi yung yayakapin akong parang tropeo dahil nanalo na sya! https://t.co/B2mEWw03AO Oo at pagtapos mo saluhin ang bola ipinapasa mo sa iba!!!  Ako pa ba?! https://t.co/FDIFAVD5lQ Pano moko sasaluhin kung ikaw ang nahuhulog?! https://t.co/9YG2mZzVYm Tanungin mo muna ung sarili mo kung kaya mong sumalo. Tsaka nako magiisip kung magpapatihulog ako. ☺️ https://t.co/0WIFLKiBJJ Simulan mo sa tulakan. Kung sino mahulog talo. ☺️☺️🙄 https://t.co/JmfdYRLIYp Wag mong simulan kung di paninindigan!!! 😏 https://t.co/DOlBVS7ObN Ah gusto mo ba seryosohan?😏 https://t.co/uUH55phcXv Puro ka talaga kagaguhan hehe 😏 https://t.co/0SQQvu68gL Hello pogi 😏 https://t.co/mqOjgjmdNK Hospital sched today.  Missing Showtime and the Madlang People. Nagsimba ka ba kasama yung jowa mong niloloko mo? Kaya wala akong jowa dahil masyado kong maganda para sa kanila. Di nila ko deserve!!! Paweeeerrrr!!!!! Kasi taped po. https://t.co/QSEU05Zs41 Di lahat ng may jowa masaya. Di naman lahat ng jowa maganda. What’s good? Pero parang apat na bagay ang nakikita ko jan sa buhangin!!!  Dedma na basta may lipstick! 😜 #VICEco. https://t.co/8NYJHuXVLa Hugot pa more! Lipstick pa more! #VICEco. https://t.co/DW5SHnwaZh Ravaaaaan na yang GANDAng yan teh!!!!! #VICEco. https://t.co/qa2cu3984D At love na rin kita! Sumaiyo ang kaGANDAhan!!!! #VICEco. https://t.co/FuyOo0Uue0 kaGANDAhang deserve mo!!!! #VICEco. https://t.co/OkTrF7630F Nakakatawa yun ha?! Nakakatawa yun?! Siraulo!!! Ba’t ang init? Kala ko ba summer? Bukod sa maagawan ng jowa masakit din pala yung maubusan ng ulam. 💔 D2 ko now sa isang japanese resto. Waitress: Pwede po ba magpapicture? \nMe:  Sure! \nWaitress: cge po wait lang kakain lang ako.\n\nAng galeennnggg!!! Madlang People!!!!!!!!!!! Makinig kayong lahat! Dunating na ang propetang may dalang katotohanan. Maniwala kayo sa kanya!!! https://t.co/sxFHoc1DZM Hindi pwedeng mahal mo lang sya pag walang nakakakita! Wag ka ng mangatwiran! Di pwedeng ganun! May public chat kaming mga bakla sa viber. Idownload nyo lang yung ViceCosmetics sticker pack para makajoin kayo. Daliiii! Masaya to. Sorry di ko na natapos ung TnT nakaschedule kasi ang CT Scan ko ngayon ng 4pm so i have to go na to the hospital. Pray for me ha. 💋❤️😍 Tapos na ang long weekend! Wag kang unarteng bitin kung tambay ka lang naman. The early bird catches the first bird. GANDAng umaga! Naknam!!!! Ang ganda nung host ng show na to!!! #GGVTheGoodSaya Good luck po! Sumaiyo ang kaGANDAhan! https://t.co/DN9R4v5DH0 Just finished ultrasound. Hopefully wala na mga stones sa kidney ko para matanggal na ung stent na nilagay sakin. Ang weird ng may tubo sa katawan. 🙏🙏🙏 I hope i made u happy today in Showtime. Im happy when ur happy! 😍😍😍😍😍 I miss my baby Chip In. Maraming salamat sa mga pabati at magagandang mensahe!!! So andami palang nagmamahal sakin! E bakit wala akong jowa?!  Chozzz! 👏👏👏👏👏 @hashtag_mccoydl @iamjoshuagarcia  !!!!! Ang husay! Its a YES for me. See you sa next round! Nakakastress ang ThaGoodSon!!! Kalurks!!! Haaaaayyyy!!! Erase erase erase!!! Mekeni mekeni tugtug doremi. Mekeni mekeni tugtug doremi. Hi po! May utang nga po pala kayo sakin. Naniningil na po ako. Pakitext na lng po kung kelan mo po mababayaran para alam ko kung kelan papakawalan ung pamilya mo po! THANKS PO! #AskVICE https://t.co/UA7N5Cnoek Malalaman mo kung may halaga ka kung sinuklian ka! #AskVICE https://t.co/93KqrmQm8B Dahil bawal ang tanga sa mundo. #AskVICE https://t.co/0Ezh3YattF MALAYA by Janet Napoles #AskVice https://t.co/zmK9J3XkL4 Baka hindi sya nag ipon. #AskVICE https://t.co/7nJnSq6QCk Papinturahan mo! #AskVICE https://t.co/vuCAuZu732 Depende kung sino may ari! #AskVICE https://t.co/Oa41HugWyP Yung BIBO! Ayoko ng hotdog na tatamad tamad! Gusto ko yung Bibong hotdog! #AskVICE https://t.co/qZ8q8sm6gQ Seriously, JUST LIVE! #AskVICE https://t.co/Ahqsrtxctp Yung sunog. Yung tutong. Yung di na mapapakinabangan!!! #AskVICE https://t.co/JciI20arDE Pinakuluang pokpok. #AskVICE https://t.co/f8KWtVdWQD Pag di nagkulambo! #AskVICE https://t.co/dlP6cFPb0S My masculinity! #AskVICE https://t.co/Hphq80i1rG Kagaguhan! Pollution is in the air! #AskVICE https://t.co/uVHHz0DEJK Pinakialaman ka ba ng 711 nung bumili ka ng bra e wala ka namang boobs? #AskVice https://t.co/QD2FD8Qmjv TESDA ftw!!! #AskVICE https://t.co/novVFj58yX Meron pag napatunayan mo nang nanay mo sya. https://t.co/uYobgTpIPc Badminton. Shuttlecock is life! #AskVICE https://t.co/67V0Tji10H Pag di ka na lumabas di mo na poproblemahin ang traffic! #AskVICE https://t.co/JhXdjGHWNj Shaina magdayao and DJ Mo = ShainaMo !!! #AskVICE https://t.co/6bapPqqjXJ Ang hindi ok e ikaw ang PANGALAWANG magfirst move!! Pag nagawa mo yun balitaan moko!  #AskVICE https://t.co/SgfeczHDF6 Wala po kasi kong time magsapatos e huhuhu!! https://t.co/aQV82q070e #AskVICE Isang buong araw ng nakatikom ang bunganga ko. Bawal magsalita . Complete voice rest. Dito na lng ako chichika. Waaaaaaaahhhhhh!!! Kung walang malapit na store sayo FREE shipping ngayon ang Summer Collection #TagArawTagGanda pag umorder ka sa https://t.co/4fKviUYUbP . Go na dali! Andaming tao sa mga https://t.co/7vdHEB3LoY pop up stores !!! Parang halo-halo ngayong summer na pinagkakaguluhan yung nga lipstick. Ang saya! Sumainyo ang kaGANDAhan!!! 💄💄💄💄💄 Kuraaaaakkkk!!! Para sa ngiting tagumpay! #GraduationGanda https://t.co/WDYZUdDATJ Ipaglaban natin ang karapatang lumandi. Aba aba masakit kya sa kalooban ang ma-zero! Yung tambay na naka iPhone! Iba din! About to go FB Live in a bit. Join me! Homaygazzzzz dinalaw ako ni @itsenriquegil sa dressing room!!! I feel so GANDA!!! 💋❤️😍 Bwahahahhahahahhah!!!! Tawang tawa ko sa reaksyon fowtah! https://t.co/v0mVFIKGeS Officially launching https://t.co/Ipdd5UxhPB Summer Collection #TagArawTagGanda tomorrow at 4pm. https://t.co/ogTTr7Nwrf Hahahaha kinikikiv sya kay Ate Vice at Ate Girl! Kyoooot! https://t.co/NPf71Urmqz Naayos nyo ung connection ko sana lahat ng may reklamo maayos nyo rin. Kaya naman pala. Thanks again! @PLDT_Cares  @SkyCable_PH Thanks PLDT HomeFiber and Sky Broadband for fixing my internet stress at home. Super bilis naman ngayon. Di pako tapos magtype nakapost na! Iba din! Ang taray ng PLDT nagreach out agad. Yung SkyBroadBand di yata nabasa yung tweet ko. Baka mahina wifi sa office nila. Sabagay ang layo kasi ng office nila sa sky pa. Sa first floor na bahay ko PLDTHomeFiber sa 2nd floor naman SkyBroadBand.  Nagkokontes sila ng pabagalan. And ladies and gentlemen its so hard to break the tie! Sabi nyo summer na e bat makulmlim at umuulan? Haaaay! Pati panahon paasa! Waiting for UAAP StreetDance Contest on S&amp;A. At dahil sumaiyo ang kaGANDAhan ikaw ang bukod na pinagpalang GANDA for the day!!! Congratulations @limstephaniex  !!! #ViceGANDAngLips https://t.co/dM57A9mLM9 Ang bongga lang ng Primetime ng ABS. Probinsyano, Bagani and The Good Son. San ka pa!!! Again it’s a YES for me. See u sa next round! Abangan nyo ang kalaban ni Ganda. Sya ay si Landi. Malalaman natin sa Bagani kung kaya bang talunin ang maganda ng malandi. Abangan sa Bagani!  #AngGANDAngBAGANI Ammmm fyi po sa Friday pa po lalabas si Liza. Ako po yung nakita nyo. Nag cameo po ako for one day.  #AngGANDAngBAGANI Sino kaya mananalo pag naglaban si Lakas at si Cardo?  Ang Bagani o ang Probinsyano? Hmmmmm!!! #AngGANDAngBAGANI Impernezzzz mahusay si Quen sa fight scene na yun! It’s a yes for me! See you sa next round! Chozzzz! #AngGANDAngBAGANI Kawawa ang Boracay. Pero mas kawawa ang Pilipinas. 💔 Psssssst! Puro ka celfon! Aral aral din uy!!!!!! Congratulations @versaceken ikaw ang bukod na pinagpalang GANDA for the day! Ugaliin ang paggamit ng VICEco. lippies upang sumainyo ang kaGANDAhan!!! 💄💄💄 https://t.co/KZHbHCbv14 Masayang masaya ko para sayo BFF Ethel! Isa man lng satin makatagpo ng totoong pag ibig. kahit di na ako ikaw man lang. 😪💋❤️#GGVBOOBAstic Eto ung mga guests na di ko kailangang magtrabaho. Yung iba tagaktak sa pawis pati singit ko sa sobrang effort e. #GGVBOOBAstic Panu kaya kung nagkataong si Ethel Booba at Rufa Mae ang natokang kagrupo mo sa thesis??? 😂😂😂 #GGVBOOBAstic Mga siraulo tong guests ko!  HAHAHAH!!! #GGVBOOBAstic Ay o may bagong pasabog sila @teddspotting at @dj_mod_ . Watch nyo! https://t.co/aWg2ayMZ5M Gimik night na naman!!! San na naman kaya ang rampa ng mga party peeps na di naman nag aambag? Yung kahit wala na sya nasasaktan ka pa rin nya!  Kahit kwento na lng ang sakit pa din. Naniniwala ako na ang dapat magdesisyon sa kursong kukunin sa kolehiyo ay ang magaaral at hindi ang magpapaaral. Maari lang syang gabayan pero hindi saklawan. Congratulations @dawn_lady !!! Ikaw ang bukod na pinagpalang GANDA for the day! Sumaiyo ang kaGANDAhan!!! #ViceCo.  #ViceGANDAngLips https://t.co/ulOtJY2lZu Galingan mo habang nagaaral ka. Pero mas galingan mo pag natapos ka na. Dun magkakaalaman kung sino talaga ang natuto at sino lang ang nagkabisado. Ikaw ang bukod na pinagpalang GANDA for the day! Congratulations! Sumaiyo ang kaGANDAhan! #ViceGANDAngLips https://t.co/NX66XIW6r0 Hahahah true din naman. Fun and exciting ang long rally. https://t.co/JkQcd0Zos7 Good point! Ganyan sa Pinas. https://t.co/GHNrdbajvj True kaya walang nakakawatch. Sayang ang huhusay din kaya lng walang exposure. https://t.co/OChz1EqFMO Bakit kaya mas sikat ang Women’s Volleyball kesa sa Men’s dito sa Pinas? Ang tapang talaga ni Mayor Sara! Katapusan mo na Miss Minchin! To all my ig followers tag me and use #ViceGANDAngLips everytime u post ur pic holding and using VICEco. Lippies and watch out for the GANDA for the day in my ig story. Ayan! Bilang pati resibo e piniktyuran mo ikaw @leiraax ang tatanghaling  bukod na pinagpalang GANDA for the day! Congrats! Sumaiyo ang kaGANDAhan! #ViceGANDAngLips https://t.co/dFFho8OoFF Sorry nagtanga tangahan ako mali ang natag ko. Pasensya na pretty lang di perfect. One more time with feelings! Thanks so much  guys!!! Lets di this everyday! Magpost lang kayo ng pic hawak at gamit ang VICEco. Lipstick and u just myt be the GANDA for the day and receive a gift from me. And pls put #ViceGANDAngLips . Tweet me your picture using VICEco. lipstick and i will choose the GANDA for the day.  Ravaaaaan! Gusto kong magshare mg kaGANDAhan. Mamimigay ako ng VICEco. lipstick sa kalsada. Rampaaaa!!! https://t.co/aKoYoo7zGi Ang GANDA ko n namAn pag gising ko! Sana lahat! 😜 Congratulations!!!! The following will receive a box of lippies from VICEco.. My staff will get in touch with you to get your address so we can send our gift to you. Sumainyo ang kaGANDAhan!!!💄💄💄 https://t.co/UXgNCIPBCg From the more than 10k replies we have already chosen the top 20 tweets that will each receive a box of lippies from VICEco. . I’ll announce in a bit. I will be choosing 20 lucky winners and each will receive a box of VICEco. lippies. #VICEgandaKo Tweet me with “maGANDA ako kasi (reason why u believe ur beautiful) and use  #VICEgandaKo . Maganda ka ba? Bakit mo nasabi? Sagooot! Tweet me using #VICEgandaKo and ang pinakabonggang chika padadalhan ko ng 1Box of VICE lipsticks. Hapon na! Haggard ka na ba!!! Sumayo ang kaGANDAhan! #ViceCosmetics https://t.co/7U3hOuEwgz Para sa ngiting higit na pinaGANDA! #ViceCosmetics https://t.co/jytF6BTeIU Susmaryosep kaGANDAng bata! #ViceCosmetics https://t.co/73eTpowChw Year of the Dog. Asahan mong isang buong taon tatalak ang nanay mo! Ang ganda na ng awra ko ang ganda pa ng araw ko! So paano na? Wala na! Uwian na! Tulog maaga bawi ka bukas! E ung excited akong mag Showtime bukas. Hahah! Feeling first timer. This feels so good! After 8 yrs excited pa din ako sa Showtime! Awwwwwww!!! This is kinda sad!!! Id love to perform and support them. Haaaay! Bawi ako next time! Keep slayin Jadine! https://t.co/HJamnVfmV9 To my Little Ponies who still go to school Im really happy about your high grades. But please make sure that you LIVE and LEARN. In school you dont just need to get high grades. You need to get to be yourself. You need to get to have friends. You need to get a life. Paumanhin i wont be able to perform sa JADINE CONCERT mamaya. Di pko pwedeng super sing and dance at baka malaglag ang napkin ko sa stage. Thanks Jackie and Tom for dropping by. Such a sweet gesture. I appreciate it. Kaya naman pala di matuloy tuloy ang Darna dahil nasa kidney ko ang bato. Pasensya na Liza! Tag nyo yung mga jowa nyong gusto nyong bigyan kayo nito. Ang bawat set ay may basbas ni Madam Bertud na habambuhay na maGANDAng relasyon. https://t.co/OGRBz6FYXa Deserve mo ang kaGANDAhan!!! https://t.co/tZPNLGGV1r ViceCosmetics Lipstick pampakalma ng jowang may saltik! 💄💄💄💄💄 https://t.co/M1W3900bnL Magkano ba kasi sweldo pag nagbalat ng buto???!! At paano ba binabalatan ang buto? (Magbanat kasi yun te. Haha! Yabyu!) 🙈🙈🙈🙈🙈 https://t.co/tQR53AyFzU Watching TV Patrol now. My gaaawwwwddd andaming magnanakaw!!! At ang lalaki ng mga katawan ng mga potah! Kagigil! Haaay!!! Balik alindog program now! Masyado nakong maganda kaya pasexy naman! E ung papunta na ko ng SM Baguio para magvisit sa ViceCosmetics tapos nalaman kong next month pa pala open. Shunga amfowtah! Nakakapagod tumawa. Nakakapagod ding magpatawa. At lalong nakakapagod  tumawa habang nagpapatawa!!! Ang saya nitong araw na to! #Showtime Come back. Im here sa stairs. https://t.co/WoWeWBUk0H Where are u? Lets take a picture. 👌 https://t.co/Ng70RxUxyF If you love me don't give me your time. Give me your attention. Bumped into a group of girls earlier in a korean restaurant and they said all of them were wearing VICE Lippies. Kakakilig!!! Sana lahat! Yung kilala mong ang ayos at ang linis ng feed sa instagram pero sa totoong buhay ang gulo at ang dumi ng kwarto. L❤️VE!!!!! https://t.co/AN7GEVjqju Yung nagbadminton ka ng dalawang oras para sa balik alindog program tapos lumamon ka ng bongga pagkatapos! Anyareeeee!!! Trots! Sa cartoons ko lang nakikita yung ganung luha e. Iba!!! https://t.co/TorFp55oCm Just watched Dalawang Mrs. Reyes. Judy Ann Santos is incredible!!!! Parang may alulod ng luha ang mga mata! Napakahusay!!! Every gender has the right to LOVE someone. But no gender has the right to HURT anyone. Yung taong gusto mo pero parang wifi ang hirap kumonek. Ilang beses kang nagtry e pero hirap talaga. Kaya dedma na. Im going LIVE on facebook. I will share with you my thoughts about being an entertainer and my relationship with my fans. Andami ng tao ang nilalamon ng DEPRESSION dahil sa sobrang PRESSURE na dulot ng trabaho at ng mga taong inaakala nilang sumusuporta s knila. I love you too and I will be there to support you in your concert! https://t.co/6uyTkhdr8m RT @LauraraMonique: @vicegandako What fans don’t quite get is you are paid to entertain, when you off your shift anything you do extra is b… Be smart. You should know when you're being a supportive fan or a stupid fantard! So true Miss Lea. Thanks for this! Im very good. Hope to see you again. God bless!!  💋😍❤️ https://t.co/lxRGbOhsPM Thank you to all my Little Ponies and Babies who love me. Who simply love me. I appreciate it! And I love you too! Some fans really think they know everything. And some even think they own you! Nationwide gross pa lang yan ats. Grabe si Lord!!! https://t.co/HAEvOOrsyH The Revenger Squad is now the Highest Grossing Filipino Film of All Time. Glory to God!!! Masaya kong pagod na pagod. Salamat sa tawanan Madlang People!!! 😍😍😍 GANDAng tanghali!!! O alam kong marami kang gagawin today. Ingat ka ha at galingan mo. Keri mo yan! Hayabayabayu!!! Parang lately ang dami kong nababasa sa fb na reklamo ng mga pasahero ng Grab at Uber. Sana makarating sa mga kinauukulan. RT @iamsuperbianca: #PaanoBaTo: \"I want to save money pero gusto ko din tumulong sa pamilya.\" The phenomenal @vicegandako shares heartfelt… Pwede mo syang gamiting pangkilay kung di ka mahilig sa lipstick. Chozzz! #ViceCosmetics https://t.co/D7azve7USh Lahat po ng shades ng ViceCosmetics ay bagay sa lahat ng skin tone. Lahat bagay sayo.  #GandaForAll https://t.co/Bztwb1183d Eto ang mga pakak na shades for ur Graduation Picture. Para lutang ang iyong GANDANG PUMASA!  #ViceCosmetics https://t.co/Wh6XPOncxu Its a higa higa, hikab hikab, inat inat Sunday!!!!! Shereeeeeppp!!! Sa mga patuloy na nanunuod ng The Revenger Squad maraming maraming salamat po!!! Ipagpatuloy natin ang pagpapakalat ng Love and Laughter. Just finished 3 Block Screenings of The Revenger Squad!  Maraming salamat sa lahat ng mga nag organize. Super appreciated!!! #PGTisLife beyyybiiii!!! Last day of PGT Manila leg audtions. Missing Showtime so much already. Tomorrow ill be back. First day of PGT Manila leg auditions happening now in Tanghalang Pasigueño. Attending two blockscreenings of #TheRevengerSquad tonight. One in Robinsons Galleria and another one in Southwoods Mall. See u guys! Awwwwwww!!!! I wanna hug him! https://t.co/E4BwZvdsph Andami kong binubuksang regalo. Yung iba 2 years ago ko pa nareceive. Ngayon lang ako nagka time kalurks!!! So much LOVE!!! Happiness!!! RT @ABSCBNpr: Vice Ganda bags the Most Innovative Male TV Fashion Icon and Most Innovative TV Comedian awards at the 3rd GIC Innovation Awa… RT @ABSCBNpr: “It’s Showtime” bags the award for Most Innovative Noontime TV Show at the 3rd GIC Innovation Awards for Television. https://… RT @ABSCBNpr: “Gandang Gabi Vice” bags the Most Innovative Late Night TV Program award at the 3rd GIC Innovation Awards for Television. htt… And we keep on winning!!! Thank you Lord!!! #TheRevengerSquad #PGT #ItsShowtime #GGV Iiiiiiiiiiiitttt'sss SHOWTIME! 520Million THANK YOUs sa lahat ng members ng #TeamHappy !!!! Tuloy lang ang pagtawa. #TheRevengerSquad Sunday is family day. Family day must be fun. Watch #TheRevengerSquad . Showing sa buong bansa. Kahit sa hardware! Dapat #TeamHappy tyo! G!!!!!!!!! #TheRevengerSquadNowShowing https://t.co/BEfdSGiM9l Showing pa ang #TheRevengerSquad sa lahat ng sinehan na malapit sayo. Kaya walang dahilan para mabagot ka ngayong araw nato.  #TeamHappy RT @VivaArtists: Gandarrang Friday sa inyong lahat! Showing pa rin ang The Revenger Squad! Nood na! #TRS2ndBlockbusterWeek @vicegandako htt… O my God ang lakas ng lindol dito sa San Francisco. Kala ko may multong yumugyog ng kama ko. Nakakastress!!! Lord keep us safe please. 🙏🙏🙏 Magaan ang buhay ng taong masaya. Its a gift you give yourself. Its  a moment you allow yourself to experience. LAUGHTER! #TeamHappy  #TRS2ndBlockbusterWeek https://t.co/gB5HTVvIHb Pamatay stress ng mga taga call centers. Laughter! #TeamHappy  #TRS2ndBlockbusterWeek https://t.co/MzIwACU825 Love and Laughter to all families this 2018!!! #TeamHappy #TRS2ndBlockbusterWeek https://t.co/HpgHU3rGSV Good read! Thanks! 😍❤️💋 #TeamHappy #TRS2ndBlockbusterWeek https://t.co/aQKWf8xaBb Lets make it to number 1. Keep on laughing. #TeamHappy #TRS2ndBlockbusterWeek https://t.co/BcpXeBVoa4 400Million THANK YOUs  mga ka-SQUAD!!!! Kaway kaway mga members ng #TeamHappy !!! Ravaaaan!!! Sinuwerte na yung mga naunang nanunood ng TheRevengerSquad. Habol na!!! Baka magkajowa ka sa sinehan. #TRS2ndBlockbusterweek #TeamHappy At dahil Happy New Year dapat Happy ang New Year. Sa unang araw ng taon dapat tumatawa ang pamilya. Swerte yun. #TRS2ndBlockbusterWeek Andaming sabay sabay nagpaputok. May orgy tuloy ng usok. Isang gigil na gigil sa tagumpay at biyaya na Bagong Taon Madlang People!!! Walang susuko sa pagsubok. Bumangon. Umibig. Tumawa. Ravaaaan!!! Pati si Red Dragon #TeamHappy ! Sana sinama mo na si Emilia para bumait na rin. Pagod na ri si Lily Cruz e. Lol! #TheRevengerSquad https://t.co/qIdXP7SbWL 300Million THANK YOUs ang nais kong iparating sa lhat ng Madlang People na nanuod ng #TheRevengerSquad sa nakalipas na 5 days. Hayabayabayu! Mejo nasapul ako sa last statement mo ah. Nakakaiyak pag naiisip ko kung gaano nyo ko kamahal. Im overwhelmed. Salamat sa inyo! https://t.co/JQHtmszibl Enjoy your life. Enjoy your laugh. #TeamHappy  #TheRevengerSquad https://t.co/j0WZvWhCQH Mothers are always right! Hahaha! #TeamHappy  #TheRevengerSquad https://t.co/zLqWYCu7dR 👌👌👌 #TeamHappy #TheRevengerSquad https://t.co/E9DwNqPdcg Choose fun. Choose laughter. #TeamHappy #TheRevengerSquad https://t.co/buj1tEdlSh Sabado kaya perfect magfamily bonding. Rampa na sa mga sinehan at iexperience ang Love and Laughter with #TheRevengerSquad . #TeamHappy tyo! Sorry i had to delete my last post. Di pa sure pala yung pagpunta ko. May conflict sa schedule. It's #TRS5thBlockbusterDay !!! Ravaaaan na sa mga sinehan. Gift yourself and family with LOVE AND LAUGHTER!!! Be part of #TeamHappy . Success ang pasurprise sa madir!!! What a joy to see my Nanay happy!!! Love and Laughter for the family!!! ❤️❤️❤️ #TeamHappy #TRS4thBlockbusterDay https://t.co/iqZ9UBDZTx RT @MicaLumanglas: Ibang saya hatid ng movie na to nakalimutan ko problema ko sa kakatawa ang saya marinig na sabay sabay kayo tumatawa sa… RT @dnrynl02: #TRS4thBlockbusterDay Kakatapos ko lang manood at grabeee! Super gaanda! Wala akong ginawa kundi tumawa ng tumawa. At isa pa,… RT @MicaLumanglas: The movie was so lit ✨ and my money is sulit 💕 Di ako luge sa pagiipon para dito hanggang bloopers utas na sa kakatawa.… RT @itsseanyyyy: Done Watching TRS yesterday. Iba ka talaga meme @vicegandako simul nung magumpisa yung movie hanggang natapos tumatawa par… RT @queenaudreyj: Overall, I enjoyed the movie. Ang goal lang naman ng TRS is magpasaya ng tao. And it didn't disappoint pagdating sa aspet… 👌👌👌 #TeamHappy #TRS4thBlockbusterDay https://t.co/iHB5pLDS1M San tayo manunuod? Ano! Sagot! Hahha! I miss you Chino! #TeamHappy #TRS4thBlockbusterDay https://t.co/WekoOSM876 RT @gggggaaaaa12: #MMFF2017AwardsNight\nFYI, hindi nakakatalino yung pagtawag nyo ng bobo at basura sa pelikula ng iba. Mas nakakatalino yun… RT @xander_1308: If people decide to watch #TheRevengerSquad, it's bec. they are after @vicegandako PERIOD. Not bec. they are less of a per… Alam kong may pinagdadaanan ang bawat isa. Kaya trinabaho ko ang pagpapatawa. Para sating lahat na kailangan ng saya. #TRS4thBlockbusterDay https://t.co/nGG0ERlQeg 👍👍👍😃❤️ #TeamHappy #TRS4thBlockbusterDay https://t.co/6yAuaJvX7y Tumbok ng walang palabok!!!! #TeamHappy lang! #TRS4thBlockbusterDay https://t.co/yEqV1srwRw Happy Birthday!!! You and your family deserve all the LOVE and LAUGHTER. Congratulations ur now part of #TeamHappy !!!#TRS4thBlockbusterDay https://t.co/Yc4NG4vGqi Everybody needs a good laugh! 👌👌👌 #TeamHappy wins!!! #TRS4thBlockbusterDay https://t.co/M2oU0iBzyj LOVE AND LAUGHTER reign. Not Hate and Bitterness. Sa #TeamHappy tayo!!! #TRS4thBlockbusterDay https://t.co/UMbAZ44Nv2 RT @rodmagaru: 'Pag nanood ka ba ng dekalidad na pelikula..\nAt ang iyong kasama'y piniling matawa,\nIbig ba sabihin nito'y mas nakahihigit k… My Little Ponies kayo na muna bahala dyan ha. Keri nyo na yan malalakas na horse power nyo. Take charge! Hayabayabayu! Philippines im leaving you with LOVE and LAUGHTER. Bakasyon lang muna si Gandarra. Vavoooooo!!!! ✈️ RT @_kharencxzss: Done watching TRS grabe totoo nga ang sinabi ni ate @vicegandako na tatawa ka lang nang tatawa at bukod dun may matutunan… RT @rryymnd: Watched TRS twice. First watch, I’m with my family, second watch, I’m with my cousins. TRS is not only for kids, no bracket. E… Hahahahha chozzzz lang!!! Love and laughter lang amiga! Mwah! https://t.co/7xOBkZNK2W Love and Laughter for our mothers. ❤️❤️❤️ #TeamHappy #TRS3rdBlockbusterDay https://t.co/e4UN8YbuFm Tumbok mo! Matalino ka din talaga e. Binawi sa utak mo yung kawalan mo ng dede. Hayabayabayu! https://t.co/a6q4S0Ftt1 RT @Senyora: Kakatapos ko lang panoorin ang #TheRevengerSquad ang masasabi ko lang ay kung gusto n’yong tumawa at feel good lang na movie,… The power of COMEDY. #TeamHappy #TRS3rdBlockbusterDay https://t.co/YbizeEKkBk Congratulations to all of us who chose LOVE and LAUGHTER! #TeamHappy wins!!! #TRS3rdBlockbusterDay Bawal ang sad! #TeamHappy #TRS3rdBlockbusterDay https://t.co/ebaqOnitoG Achieve! #TeamHappy #TRS3rdBlockbusterDay https://t.co/6cox3wpfIE #TeamHappy #TRS3rdBlockbusterDay https://t.co/iFIHaOSc2D Achieve!!! #TeamHappy #TRS3rdBlockbusterDay https://t.co/f6tKvesTzx RT @E_Men0327: More on The Revenger Squad, may knya knyang highlight ang bwat actor...d nagsasapawan...d rin mukang pilit yung comedy...… RT @sarahcasticbabe: My kind of #TheRevengerSquad. Last 12-25-17. Super worth it. Lalabas kang nakangiti at raravaan sa buhay👌 Whoooa! Just… Thank you! Welcome to #TeamHappy !!! #TRS3rdBlockbusterDay https://t.co/Yq2LqLpPZq Maraming salamat Madlang People sa buong Pilipinas!!! Labis labis ang pagmamahal nyo sa akin. Damang dama ko. Salamat po! Mahal ko kayo! RT @abdulwahidibrhm: You know what’s good in last full show? You can laugh out loud with #TheRevengerSquad then rest the whole night while… Kapampangans are solid #TeamHappy !!!! #TRS2ndBlockbusterDay https://t.co/RwqvHBw6rc Here I come SM PAMPANGA!  #TeamHappy #TRS2ndBlockbusterDay https://t.co/zUNdzKwHje Kaya nga sya ang pinakasikat na beauty queen!!! Nag iisa talaga si Pia!! #TeamHappy #TRS2ndBlockbusterDay https://t.co/ldQGApdISJ Hayabayabayu Cha!!! #TeamHappy  ka na din! #TRS2ndBlockbusterDay https://t.co/gDwKmYvQoD Iba ang werpa ni DJ! Kaya nyang magpaihi ng viewers sa isang tingin lang! Kaya ang panghi sa sinehan. #TeamHappy #TRS2ndBlockbusterDay https://t.co/nwiUCVRpuM Ganun lang ang trip! Ubusan ng hininga sa katatawa! Lol! #TeamHappy #TRS2ndBlockbusterDay https://t.co/Av9MOEBN6v Deserve mo yan! Love and laughter kailangan nating lahat. #TeamHappy #TRS2ndBlockbusterDay https://t.co/GzM59o8suq Walang maraming arte arte! Lafftrip lang ng malala! Love and Laughter. Ganun lang! #TeamHappy #TRS2ndBlockbusterDay https://t.co/xH3jATEWG1 Welcome to #TeamHappy !!! #TRS2ndBlockbusterDay https://t.co/9eFEBnjnV3 Rampa kong SM Pampanga ngayon. Ravaaaaan!!! #TeamHappy #TRS2ndBlockbusterDay Love and Laughter. Yan ang kailangan nating lahat.  #TeamHappy #TRS2ndblockbusterday Panalo ang masaya!!!!! #TeamHappy #TRS2ndBlockbusterDay Waging wagi ang #TeamHappy !!! Parang may contest ng palakasan ng tawa sa loob ng sinehan! #TheRevengerSquadNowShowing RT @dantresvalles: Ang bongga ni @PiaWurtzbach Ang galing ni @imdanielpadilla at Wala talaga duda Hindi ka bibiguin ni @vicegandako puro ta… RT @frnnpjr17: This movie is a great stress reliever. 😆  #TheRevengerSquadNowShowing\n@vicegandako  @vicegandaadiks @ViceGandaorg Manuod ka na ng #TheRevengerSquadNowShowing kung gusto mong maging part ng #TeamHappy !!! 😍😍😍😍😍 On my way to SM MOA. Ravaaan na sa mga sinehan! #TheRevengerSquadNowShowing RT @iamrJpSantos: Simula umpisa hanggang sa pagtapos hindi nawala yung tawa ko. Astig! Congrats @PiaWurtzbach @vicegandako @imdanielpadilla… MARAMING MARAMING SALAMAT PO MADLANG PEOPLE!!!! Ang sarap makipagmahalan sa inyo!!! Nakakaiyak! #TheRevengerSquadNowShowing RT @mjfelipe: MMFF 2017: First movie I watched - The Revengers Squad - sobrang laughtrip. I totally enjoyed @Estrada21Karla and @vicegandak… RT @CaysieDodd_: Jgh. 😍 Tangna 😂 Naiyak ako kakatawa @vicegandako ikennat. Hahahahaha. #TheRevengerSquadNowShowing Slow clap 👏👏 For the who… RT @itsmicayxx: Done Watching!  \nSubrang Ganda nung Ending! Matatawa at maiiyak  ka ng bongga!\nWorth it! \n@imdanielpadilla @vicegandako @Es… RT @AlobJoe: Thank you gor giving us a Merry Christmas #TheRevengerSquadNowShowing Lakas mg laughtrip. 😂😂😂👏🏻👏🏻👏🏻 #TheRevengerSquadNowShowing Regaluhan nyo ang mga sarili nyo at ang mga mahal nyo sa buhay ng TAWA!! Deserve nyo! On my way to Megamall. Halika naaaaaa!!!! #TheRevengerSquadNowShowing Merry Christmas from The Revenger Squad !!!! Ravaaaaan! Merry Christmas sa inyong lahat! Mahal ko kayo. At salamat sa pagkakataong mapatawa kayo! Ibati nyo na lng ako sa mga pamilya nyo. Yabyu! Sabayan nyo kong manuod bukas ng #TheRevengerSquad bukas sa Megamall Cinema 3 alas 12 ng tanghali. Ravaaaan! #TheRevengerSquad float. Ang kyoooooottttt! Ravaaan! https://t.co/WGtuQm0iBW Excited for the MMFF float parade!!! I missed this last year. Love ka ni GANDARRA! #TheRevengerSquad https://t.co/E1my7atjjn Hayabayabayu mga Caviteños!!! #TheRevengerSquad https://t.co/AfWJo3DSBS Ay wala palang Robinsons Imus. Pasensya na! (Sa tono ni Moira) Cavite ang rampa ni Gandarra today. Umawra na kayo sa Robinsons Imus , Robinsons Dasma At SM Dasma para masilayan nyo ang ganda ko. Ravaaaaaannn!!! https://t.co/vGpJYqoKP2 Gigil na gigil sila kay Gandarra! Ang cute ko kasi talaga e! #TheRevengerSquad https://t.co/MA2PPAZbsv Ravan na ravan si Kweenie ng #TheRevengerSquad !!! She will conquer the cinemas this Christmas. @PiaWurtzbach https://t.co/zlGrXHMjwo I can feel your love Madlang People! Maraming salamat po! #TheRevengerSquad https://t.co/Mr8CrvEMr0 Ang gwapo naman nitong batang to! Yang ganyang mukha ang nakakapagpasaya ng Pasko! (Photo not mine) #TheRevengerSquad https://t.co/uoVqX8kPng Stressed ka ba??? Eto na si Gandarra! Sasagipin ka nya sa kalungkutan sa araw ng Pasko. #TheRevengerSquad https://t.co/NbuPXHgGMM It's ok. Your love reached me. Hayabayabayu! https://t.co/AttTgHnSvo Such a delight to see KathNiel, LizQuen and JaDine on one stage. The strongest love teams of Phil. showbiz. Pakikalat ang balitang yan pls! 😍 https://t.co/6v2u7SMcY5 Now watching my son @patsugui in #MMKStitchesAndDreams . Tutuban invasion. #TheRevengerSquad https://t.co/aWDloLzYtp Tutuban Mall visit. #TheRevengerSquad https://t.co/kIgzmPo8ry Now in TUTUBAN. #TheRevengerSquad That's my purpose. To make you feel better each time. God bless you! Ravaaaan lang! https://t.co/51LlD8Bx3p We are all victims of failures, bullying and heartbreaks. Suicide is never an answer. Just LOVE. Just LIVE. Nag iisa lang yan! #TheRevengerSquad https://t.co/GVLFlrmm8K Ganyan ang mga ngiti nyo pagtapos nyo mapanuod ang #TheRevengerSquad sa Pasko. https://t.co/O1v39qjyZs Il be in SM Pampanga on 26.  #TheRevengerSquad https://t.co/Ha91ps5g7b Yan ang kakabog kay Odette! #TheRevengerSquad https://t.co/g8Ii8i8Mb5 Hahahhaa!!! Ravaaaaaan! #TheRevengerSquad https://t.co/k7uE0pBqcb Mah plesha!! 💋❤️😍 #TheRevengerSquad https://t.co/qITQ6pkzk8 Awwwwww!!! Matsala!!! #TheRevengerSquad https://t.co/g6rJvz5s2b See you this Sunday! #TheRevengerSquad https://t.co/z6crZfABhe Ravaaaaaan! #TheRevengerSquad https://t.co/5uGH6iKYgv Malalang lafftrip ang ibibigay sa inyo ng #TheRevengerSquad sa Pasko. Walang halong echos! GV kung GV!!! Home now. Twas a long tiring day. Buti na lng superhero ako. Thank you Lord! May mga jowang parang Pasko. Yung darating kung kelan patapos na ang taon. Yung iba naman parang New Year. Nagpaputok lng tapos wala na. I love you My Little Ponies! Maraming Salamat! Ok lang na walang jowa sa Pasko basta may pangshopping. Nakalipstick at blush on po ako. #TheRevengerSquadDec25 https://t.co/kMH8MZ7jit Maganda talaga ko lalu na sa mga ganyan kalabong pictures. 😍😍😍 #TheRevengerSquadDec25 https://t.co/wvGY5zxzl1 Hayabayabayu!!! #TheRevengerSquadDec25 https://t.co/twgL23oJmR Hayabayabayu!!! #TheRevengerSquadDec25 https://t.co/OH5zTpRnrR Hayabayabayu!!!!  #TheRevengerSquadDec25 https://t.co/dY77c9PPoy Maraming salamat Madlang People sa Dagupan at Pampanga!!!! Kayo ang lodi! #TheRevengerSquadDec25 Sometimes only the relationship is over not the love. O eto pamatay bagot watch mo. Share mo sa kapwa mo bagot para gv kayo tonyt. https://t.co/cYr2bgXs9J Pssssst!!! Umuulan. Ingat ka ha. I care kasi e. O etong pampakalma panoorin nyo! https://t.co/vD1MVxYFKP Sa dami ng ipinaglalaban ng mga tao ngayon parang kahit anung gawin mo may mali. Woooooow!!! Blockbuster ang trailer ng The Revenger Squad!!! Salamat sa 5Million views at 100K shares!!!  Matsala mga lodi!! https://t.co/Sis2RoOUgu The Revenger Squad was GRADED B by the Cinema Evaluation Board. Congratulations to everyone! Hahahahhaha tawang tawa ko sa tawa ng nanay mo! https://t.co/DVM5rWOdbj Pag di kayo nagbayad papabato ko ung bahay nyo sa mga kaibigan kong hiphop na nagsisimbang gabi! https://t.co/r1ytZkhv4a Ayan ganyan ha! Biglang cannot be reached ang mga fowtahhhh!!! Yung 250 koooooooooooooo!!!!!!!!! https://t.co/vqVNPs0xvx Mga estafador kayo ng 250 hooooooyyy!!!! Papahunting ko kayo sa frat! https://t.co/cuXNOh9DqP Yan na nga ba sinasabi ko e. Sa halagang 250 nagpakilala ka!!! Lol! https://t.co/SlKAP2JR4k Hoy nak @marcogumabao nasan na yung panalo ko sa pusta? Pambili ko din ng spray net yun! #Ateneo Hahahahah!!!! Chozzz lang!!! Miss u Kief! @kieferravena https://t.co/5LXizjHphC Iba talaga ang UAAP!!! Abangan nyo next year kasali na ang TESDA . Exciting!!!!! Congratulations UAAP Finals MVP @ThirdyRavenaaa !!!! Buti na lng di ka nanuod @kieferravena hehehhe!  Congrats ATENEO!!! Im so kyoooooooot today! Hahahhaha!!! Thanks Songbird!!! Love mo din talaga ko e!!! Sabay tayo magwatch ha. Yabyu! #TheRevengerSquad https://t.co/VxAFpDYEkh So sis saang part ng earth yang Legazpi, Albany??? Maganda dyan sis? Sana makarating din dyan ang ViceCosmetics. 😜😜😜 https://t.co/rWDw8la7Gg GANDARRA - Ang Superhero na may kapangyarihang mapapaniwala kayo na maganda sya kahit di naman. Awwww! #TheRevengerSquad https://t.co/i04S3lr9QA KWEENIE -Ang Superhero na may makapangyarihang Kagandahan. Kagandahang sana meron ka para di ka niloloko ng jowa mo! Awww!#TheRevengerSquad https://t.co/KQKrlG9HT2 RAPIDDO - Ang superhero na may eksaheradang bilis. Singbilis ng mga ahas na umagaw ng jowa mo.  Awwww! #TheRevengerSquad https://t.co/TPo15lsO7h Eto na ang maghahatid ng saya na deserve nyo ngayong Pasko. Ravaaaaaan! #TheRevengerSquad https://t.co/vD1MVxYFKP Ang bongga ng feedback sa trailer ng The Revenger Squad. Lalo akong naexcite na mapanuod nyo buong movie sa Pasko. Isinusumpa ko tatawa ka! Pssssst!!! Mahaba pa ang araw. Madami kang haharapin. Alam kong stressed ka na. Gusto ko lang sabihin sayo na KAYA MO YAN! Smile! 💋❤️ Ano kaya ang mas mauunang mangyari?Ung madiscover kung pano mabububntis ang mga bakla o madiscover kung pano masosolve ang traffic sa Pinas? Wag na malungkot!!! Nasakin ang totoong korona! https://t.co/hZTmCJPPyp Ouuuccch! South Africa na lang pls! Sana Jamaica! Pinagpalit ko na si ats ng damit. Gigil nya si aquo eh! https://t.co/gUCsU6Yn9O South Africa for me gave the best answer. But i love Jamaica! Jamaica bet ko!!! Kafez ni Margie Moran. Mas secured ang korona sa ulo ni Jamaica. Walang laglag! Go Jamaica! Madlang People lets all give Rachel Peters a big round of applause! 👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏 Ung feeling na ang sakit ng tyan mo tapos ang layo ng banyo tapos pag upo mo sakto ang iri mo na nakakapang hina ganun ang naramdaman ko! 😩 Nung finocus ung mga paa ng mga candidates lahat lampas sa sapatos. Cashya pero di kinaya! #MissUniverse #Philippines Wala ng sash lalo na nalito mga judges kay USA at BRAZIL . Mainam yan! #MissUniverse #Philippines Retweet mga baklaaaaaaa!!! #Philippines wins this round! #MissUniverse Next year dapat ang gawing Natl Costume ng #Philippines ung buong MRT para kabog! #MissUniverse Go na Rachel !! Pag binaliktad mo Rachel an Go !!! Lol! #MissUniverse #Philippines Mga bakla wag na nga muna kayo magpagawa ng keps sa Thailand! Boykotin na muna yan. Lumalaban e! #MissUniverse #Philippines Kafez ni Brazil si DJ Chacha impernezzz! #MissUniverse #Philippines Go Rachel! Wag mo na sila antayin. Mag long gown ka na anak! Ako na bahala sa papalag. #MissUniverse #Philippines Ang daya ng USA dalawang beses rumampa! Ginamit pa ung sash ng Brazil. Chozzz! #MissUniverse #Philippines Yan ang bibo! Di pa tinatawag rumampa na! Go RACHEL! #MissUniverse #Philippines Retweet na mga baklaaaaaaaaaa!!!! #MissUniverse #Philippines Ravaaaaaaaaaan Rachel !!!!  #MissUniverse #Philippines Mga ats wag makupad! Ang di magtweet maaahas ng kaibigan ang jowa.  #MissUniverse #Philippines O eto na swimsuit competition na. Itodo na ang tweets. Retweet nyo na lng ako para mas mabilis. #MissUniverse #Philippines Si China parang pinakaunang natapos mag ayos ng buhok. Lol! #MissUniverse #Philippines I told ja! #MissUniverse #Philippines Ako sumasakit ang ulo sa sobrang banat ng buhok nitong isang girl na anchor. #MissUniverse #Philippines Saving the #Philippines for more excitement. #MissUniverse Wa kyeme so far #Philippines ang pinakamaganda maglakad. Ung iba parang ang hahapdi ng hadhad e. #MissUniverse Bakit parang hirap maglakad ang mga kandidata? Bagong floorwax ata ang sahig. #MissUniverse Ang cute ni Georgia Nova Villa inspired ang hair. Hahaha! Getting ready for #MissUniverse ! Im so proud to represent the land where politicians are funnier than comedians, #Philippines !!! https://t.co/KJ2TQ7n3vC In a world that's so complicated and stress is everywhere we just need someone to make us laugh. Ravaaaaaaaaannnn Rachel Peters!!! Sumaiyo ang kapangyarihan ng Mahal na Bertud!!! #MissUniverse #Philippines The next #MissUniverse is from the #Philippines !!! Gawin mong kapaki pakinabang ang tweet mo ngayong araw na to. Sama sama para sa korona! #MissUniverse #Philippines Pasensya busy ako kya di ko marerepresent sa #MissUniverse ang #Philippines. Paki RT na lng bilang suporta kay Rachel. Cge na para sa bayan! RT @MissUniverse: Voting for #MissUniverse is officially OPEN. RT to vote for Miss Universe #Philippines! \n\nWatch her LIVE: Sunday Nov. 26… Or kahit anung itweet nyo basta use #MissUniverse  #Philippines .  Ge na wag ng KJ kung ayaw nyong isumpa ko ang mga love life nyo!!! Dalii! Big favor please! Tweet ur support to Rachel Peters and use #MissUniverse   #Philippines . This will help her secure a spot. Pleassssseeee! Hala sige Rachel Peters pang-gigilan mo silang lahat. Ikembot ang bewang. Iwasiwas ang buhok. Ngiti sabay irap! #MissUniverse #Philippines Hala sige gamitan mo ng mahiwagang lipstick si Lily Cruz na anak ni Sunshine Cruz na inapi ni Tirso Cruz na ama ni Aiko ay shit di sya Cruz! https://t.co/WhzMwBvmid Psssssst!!!! Alam kong madami kang gagawin today. Kaya Good Luck and God bless!!!! Hayabayabayu!!!  ❤️❤️❤️ Happy 10Million Twitter followers!!! Kung lahat kayo bibili ng mga paninda kong lipstick baka next year ako na may ari ng ABS CBN. Chozz! Kung gusto mo ng CHEAT DAY e di sana nag diet ka na lang di ka nakipagrelasyon! Ang labi na nagsasabing \"Sorry! Naka move on na ko!!\" ! #vicecosmetics https://t.co/7mQIA1VjXO GANDAng deserve mo! #vicecosmetics https://t.co/yrXdUSXaiW Sunday : ang araw na pwede kang magtamad tamaran na di ka majajudge. Ayan nabasa ata tweet ko. Prepare for take off na daw! Bongga! Boarded the plane at 10pm. Slept. Woke up at 11. At pag gising ko nasa Maynila pa din ako. Antaray!  Ang galeeeng! Pagod ako. Wala ako sa mood. Ayokong lumabas. Pero pag inaya moko baka sumama ko. #Lande Rrrrrraaaaaaavvvvaaaannn!!! #TheRevengerSquad                         https://t.co/uMtBeZbrNs Eto na ang mga superheroes na sasagip sa inyo sa kalungkutan at magsasabog ng katatawanan sa kaPASKUHAN! #TheRevengerSquad https://t.co/CMcTarfF3c Gusto ktang makita sa personal. Gusto kong sabihin mo sa akin yan ng harapan. Gusto ktang paglaanan ng oras. Wag mga kaibigan ko.Wag ngayon. https://t.co/AdPiAX5tuA Hintayin mong makabalik ako sa Pilipinas at ipahahanap kitang demonyo ka! Di mo alam kung gaano kalungkot ang pinagdadaanan namin ngayon! https://t.co/AdPiAX5tuA Sa gitna ng pagluluksa namin ngayon di ko papayagang may lumapastangan sa mga taong malapit sakin. Napakawalang hiya mong hayup ka! https://t.co/AdPiAX5tuA Its 6am here. Still cant sleep. My tears wont stop falling. Ito yung pagkakataon na hinihiling kong sana ito ang fake news. Sana lng please. Tragic. This is just so heartbreaking. Oh my God! Thanks to those who hurt me. The pain made me spectacular. 💋 Homebound. Tapos na ang pahinga at paghinga. Oras na para muling kumayod hanggang sa muling mapagod. Idagdag mo sa yung mga kayamanan!!! 💋💋💋💄💄💄 https://t.co/9APAgRfpcr Sa panahon na laganap ang kadiliman paliwanagin natin ang paligid sa pamamagitan ng kagandahan. #ViceCosmetics https://t.co/nzUnhzN8ZV Kaya naman pala iba ang ganda ni Maymay ngayon e. Naka ViceCo. Lipstick!!! (Ctto of the pikchuret) https://t.co/gEavaFczXI Sumaiyo ang KAGANDAHAN!!! 💄💄💄💄💄❤️❤️❤️❤️❤️ https://t.co/xR3huxHHDJ Wooooooooow! 😍😍😍 https://t.co/wLfyR8PLMo My gaaaawwwd tulog ako ng tulog. Manas na ang fez ko. Pag ako di nagkaron dis month kakabahan na talaga ko. So excited for tonight's ViceCosmetics Concert/Grand Launch at the Araneta Coliseum!!! This is gonna be lit! 💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄 Maraming salamat sa mga naunang noon time show na nagbigay daan at inspirasyon samin tulad ng Eat Bulaga, Wowowin, MTB at marami pang iba. Maraming Salamat Madlang People!!!Di matatawaran ang 8 taon nyong suporta. Sana po ay payagan nyo kaming makasama kayo ng mas mahaba pa. Congratulations and Thank you so much Team Vhong for that wonderful and very relevant number! We were blessed. #MagpasikatKuysVhong Sweet naman ng baby ko!!! Thanks 'nak! https://t.co/lXd0eb8aZn https://t.co/M6daePv02o Balikan natin ang eksena kanina. Oh em!!!! Hahahaha parang matandang nagulat lang! https://t.co/K3zZ6ikzh0 Maraming maraming salamat po Madlang People sa pagtutok at pagsuporta nyo sa  #MagpasikatJugsTeddyVice !!!! Hayabayabayu! Done rehearsing for tomorrow's Magpasikat per4mance. Prepared something u shouldn't miss. It's gonna be one great tv moment. #ViceJugzTeddy Toits ang petmalu! Mga gobang werpa na lodi!!!! #TheRevengerSquad https://t.co/nTSRjjpo8r Coz im ur end and ur beginning. Even when u lose ur winning. Ikaw na magtuloy ng lyrics. #AllOfMe https://t.co/swlMItrNoU Awwwwww so sweet!!! 😍😍😍 https://t.co/mWid8qfXsH Awwwww this is so fab! Thanks! Werpa kyah! https://t.co/oNFBANkZT1 When it rains it pours. Thank you my Lord God for the overflowing blessings!!! May mabango akong pasabog mamaya sa #ShowtimeOctoVeryExciting . Abangan! Sorry it's whole day movie shoot today. Missing Showtime. Good night mga seswang! Hayabayabayu!!!! 😍😍😍😍😍 In bed now. Shooting again at 8am later. Laban lng para s kasiyahan! Thank you Lord for this day. Achieve lng ng achieve for more happiness! I dont have to but i want to. The MadlangPeople changed my life. In return i wanna make a difference in their lives by making them happy. https://t.co/vGlDT4KjgH I'm really tired. But i wont stop. I know there are so many people out there who are sad, lonely and down. I wanna make them smile. Lalong tumingkad ang iyong kagandahan! Yabyu! https://t.co/RhG0QpSUlP Sumaiyo ang kagandahan! #ViceCosmetics https://t.co/uRwr3Dxr98 That's true. I used to sing every night in my gigs before pero bihira ako mamaos. When i became a host nangarag na yung boses ko. https://t.co/JnAlPqXzB5 Just got home from work. It's been a looooooong, busy day.  Im tired. And im grateful. Good night Unkabogables! See you tonight at the Batangas City Sports Center Coliseum for Pusuan Mo Si Vice Ganda. Masaya to!!! Beauty is ageless! Ganda for all! #ViceCosmetics https://t.co/1MGXjFf9Nu Maraming maraming salamat po! Sumainyo ang kagandahan! #ViceCosmetics https://t.co/SExkcmVz7t Thanks to everyone who went to Trinoma for the ViceCosmetics store launch. You guys are phenomenal! I love you Madlang People! Thanks so much for reviewing and recommending my LIPSTICKS. Sumaiyo ang kagandahan @rrraych !!! https://t.co/jF12rDfVxi #ViceCosmetics Parang pang 10 years na yung inavail mong kagandagahan! Hoarding ka seswang? Lol! Yabyu! 💋💄💋 https://t.co/IIoG9BX0h1 Sumaiyo ang KAGANDAHAN! #ViceCosmetics https://t.co/qJpDMPmz6b I understand you are all super excited. Your orders together with your concert ticket wil be arriving very soon. Sasainyo ang kagandahan! 💋 Kapit lang mga seswang! Darating ang order nyo. We are doing our best to respond to your overwhelming support. It will be worth it. #ViceCo. Gandang Di Pabigat! Ganda for All! #ViceCosmetics https://t.co/E8repVl3Qe Super! You deserve it! #ViceCosmetics https://t.co/KCOSoMIf0H Wow! Good news! Thanks so much!!! https://t.co/3hu3BkJKOn Been overworking lately. So inihiga ko muna ang buong maghapon. And now back to shooting. Ravaaaaan!!! Naku ikaw pa ba ats! Cge padadalan kita ng isang box. Tapos padala mo n lang din ung bayad. Chozzzz! 😍❤️💋💄💄💄💄💄💄 https://t.co/EZoJlwbQTC REVIEW OF VICEco. 😍❤️💋💄💄💄💄💄💋❤️😍 https://t.co/O6qMaokcuS Shipping of ViceCosmetics starts today. Kapit na mga seswang at sasainyo na ang kaGANDAhan!!!  💄💋💄💋💄💋💄💋💄💋💄💋💄💋💄💋💄 Oplan hanapin si Gemma! #ShowtimeOctoberAnnivTreats Wag kang pumayag na mapag-iwanan ka ng GANDA. Maglipstick ka na! ViceCosmetics available at vicecosmetics..com !!! https://t.co/lekIoencZu Maraming salamat sa eksaheradang pagtangkilik nyo sa ViceCosmetics!!! Sumainyo ang kagandahan!!!  💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄 You can avail of our unkabogable  lippies at https://t.co/gsj43niMOJ . Sunainyo ang kagandahan!! That was an unkabogably successful launch of ViceCosmetics yesterday!!! Thanks so much for the love. 🔥💄💄💯💄💄🔥 SUCCESS!!! For those who cannot access the site mga SMART subscribers you can go to https://t.co/4fKviUHiNf . Thank you! 🔥💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄💄🔥 You can now access https://t.co/gsj43niMOJ again. Thank you! https://t.co/dOgVBc2TKM For those who have ordered we will contact u via email for ur free concert tickets and ensure it gets shipped with ur order. Thank you! Sorry guys due to too much volume of orders a part of our website has crashed. We will be up again in a few minutes. We'll update u. ViceCo. Bullet Lipstick for only PhP195.00 . Avail now at https://t.co/gsj43niMOJ . https://t.co/8u8j4ZQcwa Lip Liner and Liquid Lipstick Set for only PhP295.00.  Get it at https://t.co/gsj43niMOJ . https://t.co/tui7hr4PpM I'll send u a complete set. Miss kita! https://t.co/Pqsdfp6I27 Online launch of ViceCosmetics at 4pm today. You can now order. Just go to https://t.co/gsj43niMOJ . Exciting! Bukas pwede na kayong makabili ng VICE LIPSTICK na labis nyong ikagaganda. You can buy it online. Just go to https://t.co/MqRNsRrjB0 . Wag kang mag a-I Love You kung di ko naman kayang ipost ang ipicture nya sa facebook! #GigilMoSiAquoe It's acoustic night in District8. Leggo mga seswang!!!! Masaya ang araw na ito. Lets be the reason for someone to smile. In Tagalog - 'Wag buraot!' . Totoo ba talaga yun na may batas ang simbahan na illegitimate children cannot be priests? Kalurks! #MMKMaricelSoriano Umpisa pa lng nakakaiyak na agad tong MMK! Panira ng mascara mga seswang! #MMKMaricelSoriano And the one and only Diamond Star Maricel Soriano is back!!! Ang saya ng mga seswang! #MMK Yung umuulan, traffic at kumakanta si Moira!!! Eng sheket sheket!!! Ang sarap makipaglandian. Kahit alam mong landian lng. Bukas makalawa wala na naman. O alam nyo na pag di nako nakapagtweet ha. Pinutulan nako ng internet. Hahahaah!!!! #GigilMoSiAquoe #ShowtimeLaughingOutLunes Done with my shoot for ViceCosmetics. So excited for our upcoming launch!!! ❤️😍💋💄💯 https://t.co/wZ0uraQzgk Masaya kong malaman na napasaya ko kayo! Hayabayabayu! 😍😍😍😍😍 #ShowtimeOneFunnyFriday Ang saya ng araw na to!!! Mapalad ang may kakayahan pang tumawa! #ShowtimeOneFunnyFriday Was able to listen to Moira and Kaye Cal live. Nakakaloka ang mga boses deretso sa puso mo. Sa sobrang ganda nakakapanakit na sila! Ang saya maging masaya! Ugaliin natin! O ano may nagparamdam na bang may mga utang sa inyo?! #GigilMoSiAquoE RT @vicecosmeticsph: PHENOM Lip Liner - Para Perfect ang Ganda Mo! https://t.co/Jde9Kue2rg RT @vicecosmeticsph: Creamy Matte Lipstick, Intense, Color, So Comfy... TARUSH on your lips. 💋💄 #GandaForAll https://t.co/hEKPP8jlJ2 RT @vicecosmeticsph: My Lips but better. BENJAMIN... A Pinkish Nude Matte Liquid Lipstick. Gandang pang araw-araw! #GandaForAll https://t.c… Andaming komplikadong tao sa mundo. Mamimili ka na lang kung kanino ka magpapaapekto. Be wiise. SMILE. Pssssst!!! Di mo deserve ang panget na araw. SMILE! 😍😍😍 #ShowtimeToHaveAGoodTime Siguro to si Kisses ang taas lagi ng score pag ang test essay! #GGVLaughingInTandem Waaaaaahhhhn nakakakilig si Edward at Marco! Ang gagwapo! #GGVLaughingInTandem I just love Maymay and Kisses!!!! #GGVLaughingInTandem Ganda for me. Ganda for you. #GandaForAll    #VICEcosmetics   SOON!!! https://t.co/A5hAlrF4ET GANDAng tanghali! I-Showtime na yan pamapaGV! Leggo!! #ShowtimeiLove8 Off to Pampanga for The Revengers shoot. GANDAng umaga unkabogables!!!! Good vibes kayo dyan! GGV taping with MayWard and KissMarc. Exciting! Wag kang pasakay kung di ma naman driver! Bwisit! 👊👊👊 #ShowtimeSeptemBruh Kaloka naman 2ng LoveUToTheStarsandBack napahagulgol ako e! Panira ng mascara bwisit! Mukhang beBest Actor si @iamjoshuagarcia ! Galing! 💯 Just came from Belo Clinic. Shit ang ganda ko na naman lalo! Ginalingan ko ang paggising ng maaga kaya ang horsepower ko ngayon ehsakerada! Kayo, anong best moment nyo today? #iChickenjoyNaYan Love and Peace be with y'all!!! Happy Sunday unkabogables!!!! Kung mahal mo mahalin mo lang ng mahalin. Wag mong bwisitin ng bwisitin! #ShowtimeSeptember2gether I was holding back my tears while watching GDragon's monologue. I felt the loneliness. That part was so human. I love you Kwon Ji Yong! ❤️💋 If you love the person make him your lover not your prisoner! #VGrealtalk #ShowtimeAgosToSurprise Di lahat ng babaeng umiiyak sinaktan ng lalaki. Yung iba sinaktan ang sarili. Alam mo namang ayaw sayo ipinagpipilitan mo pa yung sarili mo. If you love a person just love him. Don't own him. #ShowtimeAgostoKoGV Ang saya na sabay sabay tayong humahagalpak sa pagtawa. Araw arawin natin to para ang paligid ay gumanda. Hayabayabayu! Aminin nyo! Nagutom kayo at nag crave sa Chickenjoy!!! Hahaha! Go! #IChickenjoyNaYan With so many unpleasant things going on lately i wanna take this chance to say this to all of you. I LOVE YOU AND PEACE BE WITH YOU! That was another fun Showtime Saturday! Now off to shoot The Revemgers with @imdanielpadilla .  It's raining. Dnt get too wet  y'all!! 💋❤️ Pack up!!! Another super fun shooting day of THE REVENGERS with @imdanielpadilla !!! Miss Q&amp;A question: Anung pipiliin mo ang sabihan ka ng 'Di kita mahal pero di kita iiwan!' o 'Mahal kita pero paalam na!'? I love you my Little Ponies! The Laoag crowd last night was one of best crowds ever! Super appreciative and energetic. Id love to perform again for you. Agyamanak Madlang People in Laoag!!! #PusuanMoSiViceGandaSaLaoag https://t.co/pzEWeUwcbc Let's get wild Laoag! #PusuanMoSiViceGandaSaLaoag Nakaka anim na empanada na ko dito sa Laoag kaloka! Pang pulis na naman ung tyan ko pag uwi ng Manila! Come and enjoy the night with Daniel Padilla and James Yap tonight in District8 located at GStrip Greenhills. Now in Laoag. What's up mga kapwa ko Ilocano? Dine. Drink. Party. @ DISTRICT 8 G~Strip Greenhills Shopping Center, San Juan City call 09496878185 09566596517 \n02) 426-9808 to reserve. Ayan ganyan! Ganyan! Lumabas na ang araw! Wag ka ng manlaban! Rampaaaaaaaa!!!!!! It's been raining the whole day in Korea. Mudrakels cannot enjoy her rampa! RT @ABSCBNNews: New eats: 8 things to try at District 8 co-owned by Daniel, Vice, James Yap https://t.co/1zYznBXenm Music video of @teddspotting 's UTI is up on youtube.  Congrats Teddy! 👏👏👏 https://t.co/7QgGCCsgzk District 8 located at G-Strip Greenhills Shopping Center will be open to the public starting today at 5pm. DINE. DRINK. PARTY. https://t.co/UFN38GvaqK Kamsahamnida Madlang People in Korea!!! T'was a dope concert experience! Till next time! 😍😍😍 https://t.co/DzNHpbZjxz Iiiiiiiit's Showtime! #PusuanMoSiViceGandaSaKorea https://t.co/y5AQz5jLFW Good night Korea! Big day tomorrow. Gotta sleep now and dream of my oppas. Food coma! Tulaley! #ShutayTomJones Kabwisit ang gagwapo ng mga tindero ng streetfood sa Korea!  🔥🔥🔥🔥🔥 Dalian mo hinahanap ka ni Nanay. https://t.co/eF88ZLKW68 KOREA ✈️✈️✈️ Love you too! Saranghae! 😘😘😘 https://t.co/H5XhRkabGw Just boarded after an hour of delay (#AGAIN) . Hope to make it to Showtime. Ay bongga! I-push mo na yan, baby girl! #iChickenjoyNaYan para tuloy ang pagbubunyi! https://t.co/2A3F8ObUQ4 Malapit ng maagnas sa loob ng plane. Umandar lng ng slyt then huminto na forever. Pati ba naman eroplano paasa din?! Haaaaay! Whatever happens tonight Jeremy is tomorrow's big star. He'll shine just like Sharon's jewelries. #VoiceTeensChampion That was unkabogably phenomenal Jona! 👏👏👏👏👏 #VoiceTeensChampion Kung nasan ka man mahal kita dito hanggang dyan. Ballad ang labanan bukas. Excited to hear Jeremy's best performance. #VoiceTeensFinals Nakakangilo yung galing nitong si Mica. Iba! #VoiceTeensFinals Thats how you do it if u want to win! 👏👏👏👏👏 Team Lea #VoiceTeensFinals E yung di ako umalis ng bahay para makawatch ng #VoiceTeensFinals tapos nakavorlog ako! Ayun di ko nasimulan! Ang galing! 😡 A for effort!!!! Loveet! 👏👏👏 https://t.co/UJeWmM4zER The capacity to serve ones country does not require any specific gender. Magaling, magaling, magaling! Ipagbunyi ang achievement. #iChickenjoyNaYan at para mas magaling mag-share ka na rin! https://t.co/ueC4BGXp4T Yung unan na nga lang ang kayakap mo sa ganitong panahong malamig amoy laway pa amputek! Tapos na ang trabaho. Umuulan. Gusto kong makipagyakapan. Hayabayabayu to all of you! Good night! Oh em di ko po lubos maimagine yung isang buong bahay na sabay sabay tumatawa ng tulad ng sayo! Waaaah! https://t.co/M255T6N6rv Pls whisper 'hayabayabayu' to him ! 💋❤️ https://t.co/mppwN7EGXf At dahil dyan MARAMING SALAMAT PO! Thank you thank you for the L❤️VE! Sa madaling salita ang Miss Q&amp;A ay isang matagumpay na segment. Yun lang at wala ng palabok pa! And you are the most favorite guest of Showtime! ❤️❤️❤️ Sadly i wasnt there yesterday. https://t.co/tdXzsz956z Aside from the fun and entertainment what's more significant to me is the fact that we all end up admiring the the Miss Q&amp;A candidates . With Miss Q&amp;A everyone is having fun. The audience, the hosts and all the candidates themselves (including those who didnt win). Base sa mga nababasa ko, nakakausap ko, at sa mukha ng mga live studio audience masasabi kong labis na nagugustuhan ng manunuod ang MissQ&amp;A. Enterrreeeyyy! #iChickenjoyNaYan Gawin mo ng isang bucket yan para mas masaya! https://t.co/6scz5O2Rpw Feeling a bit better now. Off to movie shoot with DJ. Bitch better werq it! Unwell the whole day. Hoping to get better. Gonna be toxic tomorrow. Time to sleep now. Vavooooo! Don't get me wrong. I value human life the way I value mine. - Pres. Duterte Now watching President Duterte's SONA. Gandang bakla nung nasa #JLSarahOnGGV o!!!! Mahusay! Karapat-dapat na gantimpalaaan. #iChickenjoyNaYan Pakidamay na rin kami! https://t.co/tpOWl3VTBw #VoiceTeensTOP4 Deserving winners for tonight. Di ako makaalis dahil sa #VoiceTeensTOP4 . Nakakaexcite kung sino papasok sa finals. Naguguluhan nako sayo Pia! Ano ba talaga kakainin ko Tuna o Manok??!!! #VoiceTeensTOP4 im torn! My mind tells me to vote for Isabela but my heart tells me to go for Emarjhun. #VoiceTeensTOP4 winning performance by Isabela! #VoiceTeensTOP4 I still love you no matter what Emarjhun! This may not be ur lucky night but i know will continue to fly like a butterfly. #VoiceTeensTOP4 just voted for Jeremy. https://t.co/OfHBHbKK5k #VoiceTeensTOP4 Jeremy's performance was flawless! This dude has wide a range. Making people laugh can be very tiring. But hearing all your cheers and laughter is gratifying. Thanks for watching Showtime! Hayabayabayu! Ang ganda rin ng theme song na Two Less Lonely People in the World ni @KZofficial . Un lang. Wala ng palabok pa! Congrats to Empoy,  @msderossi and everyone who's part of the movie KITA KITA! Buti na lang naKITA ko sya! At sana kumita sya.👏👏👏👍👍👍 You guys should see KITA KITA! It's beautiful! Un lng. Wala ng palabok pa. Di pa din ako nakakamove on sa nalaglag na pustiso! Oh well thats life. Go lang ng go! Congrats to the new Miss Q&amp;A! Zanjoe para sa puso mong nagdurugo. https://t.co/sl7wxwmX1S Just finished GGV taping. Gotta rest now and recharge. Nytie unkabogables! Just finished my Belo treatment today. Haaaaayyy ang ganda ganda ko na naman lalo. Ang daming ganap today, pak na pak! Kaya deserve ko ng 2pc Chickenjoy with extra rice and gravy! Ganeeern! Pakilike po yung picture ko sa ig. Sobrang ganda ko po dun! Awwwww may replay ng Love In The Moonlight!!!  I miss Park Bo Gum and Jin Young! Kung maganda ako bakit ikaw hindi? #MissQandA Now flying back to Manila. Bitin! I love Cebu! Pwede na talagang idagdag na national dish tong Chickenjoy! Yung sarap pang-international, pang-world, pang-universe! Panalo! 👍👍👍😋😋😋 Aliw ang  #GGVIpagLOVEanMo mamaya. Super nakakatawa si Atty. Jose Sison. Eioow phoouuzzz! 😍 https://t.co/ibZoqoAiQS Im here na Cebu!!! So baka dito nako mag make up at magbihis sa loob ng eroplano tapos deretso na sa venue. Pagbaba ko ng eroplano nakatangga ko!  Bahala kyo! Sa wakas! Matapos ang nakapanglulumong flight delay ay nakasakay na din kmi ng eroplano. Ngayon pa lng lilipad pa-Cebu. Kalurks! Ang ganda ng boses nitong contestant number 1 sa TnT. Pang recording. #ShowtimeHappyHuLYouAndMe On my way now to the airport. See you later Cebu! #PusuanMoSiViceGandaSaCebu Dress Ala Vice Ganda and you can watch the concert for free and meet and greet with me plus the chance to win 10k.  #PusuanSiViceSaCebu https://t.co/GdODVVzozb Excited to see you again tomorrow my beloved Cebu! Let's have a blast! https://t.co/WBm59LEq13 These candidates for MISS Q&amp;A are just amazing!!!! They make me so proud! Go LGBTQ!!!! #ShowtimeHuLYOyesyesYO Badtrip di ko nagoogle ang ibig sabihin ng running flat. Binase ko lang kasi sa boobs ko e. Sorry po! Lolz! #ShowtimeTumpakGanern Just woke up. Fully recharged. Time for some badminton. Sa mga naliligaw pa din my ONLY AND OFFICIAL instagram account is praybeytbenjamin . Nandun nakahambalang ang ubod ganda kong mga larawan. Jeremy is TeamSharon's strongest contender. Soulful voice w/ bonus of good looks. Bet n bet yan ng Pinoy. #ForMeLangNaman #TVTTeamSharonKOs Awwwwww Happy 9M followers na pala ko dito sa Chwicher!!! Ang bongga naman! Pahingi nga piso per follower para yumaman ako. Christy proved she was worth the STEAL. #TVTTeamSharonKOs Nakakadagdag talaga sa itsura ang talent. Haaaaay!  No wonder kay ganda ganda ko! #TVTTeamSharonKOs Jeremy already won on his first note. #TVTTeamSharonKOs Im sorry but i thought his notes were all over the place! Huwaaaaw! #FeelingeraLangAko #TVTTeamSharonKOs Sharon is a fierce coach. She's in it to win it. #TVTTeamSharonKOs Alessandra got some sweeeeeg!! #TVTTeamSharonKOs In bed waiting for #TheVoiceTeens . Jadine's cuteness made Showtime more fun! 👏👏👏 Yung nagtext ka ng 'I MISS YOU' tapos ang reply sayo 'San ka?'. Yun ba talaga ang sagot dun? Leggo! 😍😍😍 https://t.co/Ffw3zzdRCb Done with first shooting day. Thank you Lord! #LaLunaSangrePatunay while on the road. https://t.co/P4bS0oCrhN From the Land of the Rising Sun to the Land of the Terrror Traffic this is Vice Ganda saying Patience is a Virtue! Virtuehin mo mukha mo! Just arrived in Japan. Wag ng magpatumpik tumpik na! Rampa na! Ravaaaaaan! On my way to the airport. Excited to be in Japan again. See you at the concert tomorrow Madlang People. Pssssssttt! Im sending you LOVE. 😘 It's a happy day! Hayabayabayu!!!! Cash-ya naaaaaaaaa!!!!! #ShowtimeBiyerYES Ang lakas ng kulog at kidlat. \nKa-scared! Ang ipatanggal mo ung nagturo sayo ng spelling ng 'sigment' !!!  😜 https://t.co/S59p2fEAkj Habang andaming nababaliw sa KDrama ako naman nahuhumaling sa La Luna Sangre. Bampira, Lobo at Kabayo unite!  #LaLunaSangreTungkulin Freedom is to live a life that is free from your selective moral standard. - Sara Duterte 👏👏👏👏👏👏👏👏👏👏 Baklang Hypebeast?! Bwahahahha! https://t.co/mvdwjfog2N RT @StarMusicPH: 22 days to go Cebu!\n\nPusuan Mo Si Vice Ganda sa Cebu on July 15, 8pm at the IC3 Convention Center, Cebu City!... https://t… Hayabayabayu!!! ❤️❤️❤️ #ThankGoodnessItsShowtime Ang kyooot din ni Nognog! Kagigil! #LaLunaSangreAngPanganib Pag nagagalit si Victor Neri dumidirty ang nails. Ka-scared! #LaLunaSangreAngPanganib Antaray ng paback story ng #LaLunaSangreAngPanganib !!! Ka-scared ni Chard. Warming up for Cash-ya ! This is a battle for honor! I will reclaim victory! #ShowtimeJune22gether GANDAng mawnin Unkabogables!!! Hayabayabayu!!! #ShowtimeJune22gether Hahahahha! Buti na lng may ganito. Hayabayabyu eathan!! https://t.co/p9G80SCUuh Pag ako lng talaga naging ubod yaman mageeroplano ko araw araw at HU U ka saking hayup kang bwakanabitch kang trapik ka! At ayun na nga di nako nakarating s patutunguhan ko. Bumalik na lng ako ng ABS. So from 3:45-5:45 nag fieldtrip lng kami sa EDSA! Ang husay! Kung di man sa pagresolba ng trapiko sana lang talaga sa ibang serbisyo mapakinabangan ng mga Pilipino ung tax na ibinayad ko. Andami ko pang patatawaning tao pero paano ko sila mapupuntahan kung ganito ang sitwasyon ng trapiko? Kahit anung adjust mo wala pa rin! Twing magbabayad ako ng milyun milyong tax napapapikit ako. At tuwing naiipit ako sa trapik napapamura tlga ko sa sama ng loob. San napunta? Sobrang lala talaga ng traffic. Alam kong di na to bago pero di mo pa rin mapigilang mapamura dahl sa perwisyo. Lalo na't milyon ang tax ko! Ang saya pero nakakahaggard ng severe tong Cash-ya !!!! #ShowtimePangMaLaCASHya Ung mga bata sa #LaLunaSangreAngPropesiya ubod ng ku-cute! Ung tipong ipapanalangin mong sila yung anak mo. Hahalikan mo tlga pag nakita mo. Ang kyoooooot! #LaLunaSangreAngPropesiya https://t.co/Uvx2M9V0tx Kering keri ni Richard Gutierrez ang bampira! #LaLunaSangreAngPropesiya Waiting for #LaLunaSangreAngPropesiya . Gusto ko ng makita si Tristan na maliit. Saw La Luna Sangre's pilot episode on Iwantv. Sobrang ganda! Ang galing at super cute nung batang Tristan. Naiyak ako dun s tungkod' scene. Sleep nako. Pasasayahin ko pa kayo bukas. Hayabayabayu!!! ❤️❤️❤️ Watch me whip watch me nae nae! Hayabayabayu! https://t.co/6evDTFt92L May ritemed ba ako? Hayabayabayu! https://t.co/bJxz4gnMrs Ang you make me wanna make u smile everyday! Hayabayabayu! https://t.co/cE8X3rkKf4 Oh i need that! Thank you! Hayabayabayu! https://t.co/HlKqgZdo6v Then u have to take a daily dose of me. Hayabayabayu! https://t.co/BHKeMBaNL0 Hayabayabayu real quick! https://t.co/AeTtz0Qrv2 Ang sweet naman nyan! Tulog ka na bukas pasasayahin pa kita ulit. Hayabayabayu! 😍😍😍 https://t.co/5uSaTSJSMe Happy Fathers Day sa lahat ng mga baklang tumatayong ama at nagtataguyod sa kanilang mga pamilya!!! Mabuhay kayo! There are men who make kids. There there are men who make families. And there are men who make homes. Happy Fathers Day! May mababait namang lalaki. Pero marami ring ang tingin sayo Everwing. Yung gusto ka lng tirahin para magkacoins. Hayabayabayutu!!! ❤️❤️❤️❤️❤️ https://t.co/Xi9arVVCWq Good night! Hayabayabyu!! 😍😍😍 Buti pa yung character sa everwing naa-upgrade. Yung feelings nya sayo hindi. On my way to the story conference of the Vice-Daniel-Pia movie. This is gonna be one exciting movie! Can't wait! Dati ang kaagaw mo lng sa oras nya mga barkada nya. E ngayon may Everwing pa! Naknam%#€£¥!!!!!! Masarap tumawa at maging masaya. Try nyo dali! #ShowtimeBestTime Dinub ko din ang A Love to Last pero di pinayagang umere baka daw maMTRCB. Pero ipopost ko sa fb fanpage ko watch nyo. #GGVMeganniversary Maraming salamat Megastar @sharon_cuneta12 !!!! Mula noon hanggang ngayon MAHAL KITA! #GGVMeganniversary Yes tonight you can call me VICE GANdub ! #GGVMeganniversary Gusto ko ng pasukun ang career ng pagiging dubber! Hahahha!! #GGVMeganniversary Cute! Domo arigato! #GGVMeganniversary https://t.co/qe5m4vx4sh It's been 6years baby! thanks for the love! #GGVMEGAnniversary Kabugan ng severe today sa #TNTKidsGrandFinaLs . Eksaherada ang mga bagets ang gagaling! Good luck! Thanks to Hashtags, @imdarylong and @AngelineQuinto for gracing the Little Ponies Day! We appreciate! #ImALittlePony Thanks so much to all my Little Ponies for spending time with me in our LittlePoniesDay! I love u and thank u for the love! #ImALittlePony Soooooo tired! Hingal na ang kabayo. Taping GGV's 6th ANNIVERSARY now!  Cnt believe it's been 6yrs already. Time flies when you're having fun. Brand new week. Brand new day. Lets make this fun. Spread LOVE! PLEASE! GANDAng tanghali! 😍😍😍 #TNTKidsSemiFinaLsDay1 Pinadala ko na sa bahay nyo yung sleeping pills. Makakatulong yun sayo. Alam kong di ka makakatulog sa kinalabasan ng performance mo. Yabyu! https://t.co/YFaPefzK0L Dapat mag ASAP na tong tatlong to e. Deserving mabigyan ng break. Gidget, Jex and Eumee. #GGVSingInit Lemme entertain you before you sign off. #GGVSingInit Oh my gawwwwwdddddd!!!! Congratulations nak @wackykiray !!!! Salamat sa lahat ng bumoto!!!  👏👏👏👏👏 #iCanDoThatGreatestEntertainer Kapit kamay na nak! @wackykiray #iCanDoThatGreatestEntertainer Enterrreeeyyy ng I Can Do That may pa-final walk!!! Beauty contest lang ang peg. Hahaha! Kahit anung mangyari mahal kita @Mscathygonzaga !!!! Saang network ka man mapadpad pagtapos ng performance na yun i will still be ur friend. Ang pogi ng anak ni @laraquigaman sa #BOYBKuLitan . Super kyoooot! Leggo Wacky Kiray!!! https://t.co/EK0eE9dxqa He waited for that moment to be up there. He worked hard. And made it! I am emotional. Proud of u WackyKiray! #iCanDoThatBattleForGreatness May lakad ako e. Kwento mo na lng sakin the next day. https://t.co/XvJmW5u4f5 Next na yung anak kong si Wacky Kiray. Nervyozzzz much!!! 🙏🙏🙏 #ICanDoThatBattleForGreatness Naiyak naman ako kay Daniel. I understand how frustrating it could be not to be able to perfect your act. You did ur best Dan! Respect! Nakakabilib si Cristine! Walang takot!  Saludo! #iCanDoThatBattleForGreatness Reminder lang po si Liza Soberano po yang nasa MMK hindi po ako. Wag pong malito. Sorry to confuse you. Ako din nalilito na e. Sensya na! Haaay! https://t.co/QeCrGgziWM Super duper liar! https://t.co/MFjF3pgWMG Liar! https://t.co/bxowDu3lVS To my peace loving Little Ponies good night and I love you all!!! Naging fans kayo para mahalin at suportahan ang idolo nyo na nagmamahal sa inyo hindi para mang away ng ibang tao. Wag nega. Wag OA. Itigil nyo na yang mga bash bash na yan. Ang gulo gulo na ng paligid wag na kayong dumagdag. Love na lang. Learn the art of DEDMA! Yan ang kailangan mong iworkshop after acting. Focus on the positive. https://t.co/HtkKRAwMLM Andaming ganap na nakakalungkot. Sana nabigyan namin kayo ngayon ng dahilan pata sumaya. #ShowtimeJune2wangTuwa Young Tayo Eh never fails!!! Super lafftrip as always. #ShowtimeJune2wangTuwa There's still a lot of reasons to be grateful for. Let's just continue spreading LOVE no matter what. GANDAng tanghali. I think it is best for everyone to just stay home right now.  Be safe. God bless us. Nahaggard ako ng bongga kakatawa sa Young Tayo Eh segment. Hangzayalangz!!!! Ang ganda ng lips ni Lee Dong Wook. Ang sarap isubsob sa nguso ko! Pano malalaman ng estudyante kung yung binili nyang notebook na  100leaves e totoong may 100leaves? Bibilangin bago bayaran? Pressure naman! Liza Soberano is the new Darna. Richard Gutierrez is the new Kapamilya.  Winning moments! 👏👏👏 Yung nagpost ka ng pic na may kasamang aso na mas cute pa kesa sayo. Excited for Liza as Darna! Totoo kayang may Downy na kasing laki ni Pia Wurtzbach katulad nung andun sa commercial? San kaya meron nun para isang bilihan na lang? Walangya ka @jhongsample ikaw pala nagtali sakin hayup ka! Isa ka pa @JayeHanash at hinigpitan mo pa yung buhol! Mge shelbehe keye he! https://t.co/ZgYtrGvxRW Jadine in Showtime is really fun! Love them! I cannot make the whole world happy. To be able to make atleast one child smile everyday is an achievement. Blessed by a child. (Photo not mine.) https://t.co/VPvxi946Gf I felt the sincerity of his words, look and hug. I felt the love. Soooo fun! Thanks! 😍😍😍 https://t.co/f0EZFZY5je BE SAFE. Sick and working. #gipit? Follow @GlamTeamVicePH on twitter and ig for more updates on my personal style everyday. Kami talagang dalawa ang magkausap! Lolzzzz https://t.co/Z0cADnipOY Tawang tawa ko dito!!!! Totoo ba to??? Bwahahahahahahha!!!! https://t.co/PlbLbZa37O Baka mamaya ireport sa Bandila kung natuloy bang sumabog yung mga bomba ni Joaquin. Ang puti ni Ian Veneracion. Kala ko tuloy si Heart. Antaray ng mga teleserye tonyt lahat may lobo. Special ang mga episodes! Lolz Dapat si Eric Santos kumanta din ng live sa bday ni nanay Lucing. Bwahahhaha!!!  @jojosaguin Kinakabahan ako baka dito sa Bday ni Nanay Lucing sumabog yung mga bomba ni Arjo. Nagpalit na ba ng jumper si Heart eversince? Si Joaquin sinaniban yata kanina ni Heart kaya walang nakakakita sa kanya. Lolz Ikaw nman @KZofficial nakita mo na s patalastas na pasasabugin ung kasal pumunta ka pa at kumanta. Pag ikaw nasabugan dyan talandi ka! Kung yung wig ko kaya ang suot ni Arjo di pa din sya makikita at makikilala? Lolz Infernez kay Arjo di mainipin. Ang tagal nya ring nakatayo dun sa kasal at pangiti ngiti sa likod ha. At di talaga sya nagtatago. Brave din! Loving my four guests tonight. They're just too cute! #GGVAnakNgSikat Sa panahong to mas kailangan mo ng aircon kesa jowa. Yung mga kaibigan mong di ka tatantanan hanggat di sira ang araw mo! https://t.co/CUAZ9pyV1K Sino ba nagpauso ng konseptong di pwede maging matalik n magkaibigan ang lalaki't bakla? Pag nalaman ko lng tlaga kung sino yang gagung yan! Clara oo lamang ka s puti at kinis ngunit ang mata ng pagibig ay bulag. tanging tibok lng ang namumutawi at nagsasabing ako ang pinipili! https://t.co/kRnlWncpPB Hoy Gia at Clara wag kayong echusera dahil ako ang totoong ina ni Heart. Ako  din ang totoong mahal ni Jude! https://t.co/3fgaK2v715 RT @ABSCBNNews: Auditions para sa 'Tawag' regular edition, magsisimula na https://t.co/ZalEj3dZjL I love this picture! Thanks to whoever made this! 😍😍😍 https://t.co/JPb2XtEcPO What i love about my Little Ponies is that they are not known for being rude, hateful and warfreak. They just simply love and support me. Maligayang ARAW NG MGA INA sa lahat ng mga NANAY anu mang kulay, anu mang hubog, anung mang uri. Salamat po sa inyong lahat. Loving all the Mothers Day posts on social media today. ❤️❤️❤️ Here's the link of my spoken word performance today in Showtime for Mothers Day entitled NANAY.  https://t.co/02uNFmfAzw Bongga si Francis ng TnT Kids!!! 👏👏👏 Hahaha super aliw! https://t.co/EO0Zgm8FJL Thanks so much Lyceum of the Phils University for the awards. Mabuhay kayo! https://t.co/artZxWlX2I On my way to Dara's preem nyt in Galleria. @krungy21 Ang kyooooooooottt ni Kim grabeeeeee! #KimeraldOnGGV Powteks nakakakilig pa din tong Kimerald! #KimeraldOnGGV I-GGV mo na yan! Just finished my meeting. Anung petsa na! Natapos ang Sabado di ako nakarampa. Vorlog na nga lng ako para fresh. Hmmmp! Congratulations DLSU Lady Spikers!!!!  To ADMU Lady Eagles you guys are still awesome!!! Cheng was the shining star of the finals. 👏👏👏 Waaaaaaaahhhhh tawang tawa ko kay @PiaWurtzbach sa TV PATROL! Iba ang ganda ko ngayon. I cant  handle! Have a great day! Have a fun day! Have a blessed day! Have a happy day! Have a life! Hahaha ay sige go! https://t.co/wRWRzXmllX On a lighter note, salamat pala sa mga bumili ng mga gamit ko sa Bazaar nung Sunday. May pandagdag ako sa tuition ng mga bagets. God bless! Ang saklap na yung mga mahuhusay at matitinong tao di nabigyan ng pagkakataong magkapwesto sa gobyerno. Pero yung mga pulpol namamayagpag. Wag mong sisihin ung politiko dhil istupido sya. Sisihin mo sarili mo dhil binoto mo sya. Nagtrip lng naman syang tumakbo. At naniwala ka. Masaya ang araw na 'to! Anung ganap? Bakit parang nagkakaanuhan? Anu na?! May naano ba? Sinong nang aano? Wag kayong ano jan ha! Now here at Araneta to watch DLSU vs ADMU Women's Vball Finals  Game 1. Good luck to both teams. Happy Labor Day sa lahat ng mga nanganganak!!! Walang GGV . Nung wala kang pera nagtatrabaho ka para makakain. Nung may pera ka na di ka naman makakain at baka mawalan ka ng trabaho. Ang labo ng lyf! Ilan kaya ang mga nangutang para lang nasa Bora sila ngayong laBORACAY week? INGAT sa lahat ng nagbabakasyon. Sige magholiday kayo habang ako nagtatrabaho. Ganyan naman kayo e. Unfaaaaaaiiiiiirrrr!!!!! Huhuhuhuuu!!! Yabyu Butchokoy! Agigil mo si ako! https://t.co/bmc8HOiTq1 Thank you my Little Ponies and Babies!!! I am grateful. Ung gusto mo sana kasama mo sya kasi jowa mo sya. Pero wala nman sya. Tapos di ka pwedeng sumama sa iba dapat sa kanya lang. So mag isa ka . Yung magjowa kayo pero di naman kayo nagkikita. Yung gusto mong hunarot pero wag n lng kasi may jowa ka. Pero nasan nga. Yung meron na wala. Ba bum tooooooo! https://t.co/mUictR9ud4 Ung ang ganda ng suot ko pero ang dumi ng kuko ko! Ang hirap itago! Kalurks! Lets watch Marielle, Gidget and Noven Belleza of Tawag ng Tanghalan in Laffline tonight. Show starts at 12. See u! Maraming salamat Trinity University of Asia para sa award!!!!! https://t.co/9y4KQ12F5M Watching DLSUvsUST WOMEN's Vball game. Laure's fighting spirit is just major! 👏👏👏👊👊👊 Hope u liked my prod number! Yabyu! #ShowtimeEarthDay Panuorin nyo yung production number ko sa opening ng Showtime today ha. Yung hindi manonood mabubulok ang ingrown! 😜😍💋❤️✌️ Just finished rehearsals for my prod number in Showtime tomorrow. Ilang relasyon na kaya ang sinira ng mobile legends? Andaming magandang linya dito sa #CantHelpFallingInLove !!!! Loveeet! We can't stay in a relationship just because we are thankful. -Gab #CantHelpFallingInLove Yung pagkain mong saksakan ng sarap pero saksakan din ng baho. Ikaw ang sunshine ko! https://t.co/QUcCJFonME Ang sarap maging masaya! Ang sarap tumawa. Kahit walang masyadong nakakatawa. https://t.co/k2jH2yBTnX GANDAng tanghali Unkabogables!!!! Let's get ready for Showtime. 😍😍😍 Badminton. Lusawin ang mga kababuyang naganap nung bakasyon. I miss you so much Mamang! I'll see you again when all my work is done. I love you so much. Ayun na nga! Haaaayyy! Ang bigat! Ang Pagbitaw #SHOWTIMEMiyerkuLesSanto Ayan na! Abangan nyo ang pangmadiinan naming drama ni Zeus! Pang hollywood. Dramang walang luha. Heheh! #AngPagbitaw Yung tatlo na nga lng kayo yung dalawa nag momobile legends pa! Naknam! 😡 Love thizzz! ❤️❤️❤️❤️❤️❤️❤️ https://t.co/EQDXTRFljX Maraming salamat! Mahal ka din namin! https://t.co/uePorpZyS2 The many faces of love. #VGPC https://t.co/2axmBao4ix Mahal ko kayong lahat kahit parepareho na tyong nagtatabaan!!! ❤️❤️❤️❤️❤️❤️❤️ https://t.co/C9gbs0nh59 Happy Anniversary to my Unkabogable VGPC Little Ponies!!! Love beyond words to all of you! ❤️❤️❤️❤️❤️❤️❤️ Holy Week Lesson: Love ur neighbor. Kaya ipakita ang pagmamahal sa kapitbahay sa pamamagitan ng simpleng pagbili ng tinda nilang halohalo. Mais con yelo panlaban sa init ng impyerno. Congrats Sam, Froilan and NOVEN. Madlang People loved your GGV episode last night. More power to the three of you. April 9 Sunday Ratings\nGGV v Other show\nNatl 13.3 v 4.7\nUrban 17.1 v 6.1\nRural 9.1 v 3.1\nMega 18.9 v 8.4\nMetro 22.7 v 7.6\n\nSALAMAT PO SA ❤️ Heweeeew nemen dyen ets! 💋❤️😍 #GGVWinnerSaSaya https://t.co/K0kiq0VQvv Hope ur all enjoying #GGVWinnerSaSaya now. My unkabogable dowwwterrr!!! Congratulations!!!! Maraming salamat sa lahat ng bumoto sa anak kong si Awra!! Malaking tulong to sa kanya.❤️ Wag ka na magtampo Awra ikaw naman ang tagapagmana ng lahat ng wig at sapatos ko. #YFSFKidsGrandWinner Boom bu rum boom boom bu rum boom karakaraka!!! #Awra #YFSFKidsGrandWinner Ravan anak! Tusukin mo silang lahat! https://t.co/R82rrW5FHo Rampang Pradera Wakeboard Park in Lubao, Pampanga. This gotta be fun!! God bless Batangas. God bless the Philippines.  🙏 https://t.co/eY3PevR4LB Just had my first HALO HALO this year. Shereeep ats! Super intense DLSU vs ADMU women's vball game. Enjoying it. Praying for everyone's safety. In Jesus name. Ilan kaya ang masuwertwng kamukha ko sa wittybunny app sa facebook?! Binigyang silbi ko ang treadmill ngayong umaga. Slept at 11pm. Tulala/Tunganga mode now. Videoke sesh on my ig stories now. So tapos na pala ang Bday ko sa Pinas at dito sa Amerika. Keye nemen geste keng megpeselemet se lehet ng nekeelele et bemete seken. Eylebye! Just woke up. Lost my voice after last night's concert in San Diego. Still have 1 more tonyt in LA. No talk for now to rest my voice. It's still my birthday here in the States. Celebrating it on stage. On my way to Civic Theater here in San Diego, CA. Shopping before concert isnt a good idea. Now my feet are tired and im sleepy. Hitting the beach. Get ready Malibu! So sick. Acid reflux attack. Feeling weak. In bed the whole day. Just LA LA LANDed. Bye Texas! See you in a bit LA. ✈️ Too tired but couldnt sleep well. 😪 Second show done. Thanks so much Madlang People of Houston, Texas!!! 💋💋💋❤️❤️❤️ Now in Houston, Texas. See you tonight at the Arena Theater. Still have 3hrs to sleep before my flight to Houston, Texas. Good night! First show done. Thanks so much Madlang People of Orlando,Florida!!! Amazing audience! Slept for 14 hrs. Eng shereeepp!! Abot hanggang Pilipinas ang kafreshan ko ngayon. Not enjoying shopping anymore. What is wrong with me?! 🤔🤔🤔 Happy Birthday to my super hot, super pogi, super sweet, super lakas ng appeal, super sakto lng ang height na anak @patsugui ! Wag na tampo! Just arrived in Orlando, Florida. Missing me yet? Just landed in LA. 3hrs lay over before flying to Orlando, Florida. GANDAng umaga!!! RT @teamvicePH: Konting kembot na lang magpupusuan na tayo sa Amerika! Kitakits there! #UnkabogableATM #PusuanMoSiViceGanda #NagmahalNasakt… Malapit na ang pusuan! Kitakits! https://t.co/2niSmKOwNe Babalik din ako agad. Eto naman. Yabyu! https://t.co/1aTaztstdB Just boarded. See you Madlang People in America! ✈️✈️✈️✈️✈️ See you mga Kapamilya sa Amerika!!! https://t.co/sbUgBSRh3I Hoy Ian Veneracion!!!! Bakit di ka tumatanda? Bampira ka ba? Mukhang aabutan ka pa ni Nash Aguas a! Bwahahahhahah! Natawa ko sa sira ulo maghost! https://t.co/3HeSLwaDZw The mathematics of love. https://t.co/PkXpvlE6Go Sana si Noven maging parang si April Boy. Ung magkaron sya ng maraming kanta n magiging anthem ng mga Pinoy tpos yumaman ng husto. #deserve Awwwwwwww nakakaiyak si Noven sa Rated K! Pag gising ko kaninang umaga mukha ni Noven ang unang nakita ko pagbukas ng tv. At pag gising ko ulit ngayon sya na naman. This must be ❤️! Noven's voice and smile are affective. Yes! And this is my first english for the day!! 😜😜😜 Inenjoy ko na naman ng severe ang Showtime today!!! It's a beautiful Saturday! ❤️❤️❤️ Taping day 2 for my Lenten Special. Di ko bet ang emote emotan and iyak iyakan in the morning. Mas bet ko ang baliwan sa Showtime. Gusto ko ng ice candy na sago. Taping for my Lenten Drama episode. Missing Showtime today. Nagtatampo bebe ko kasi late nko natapos sa work. Di ko sya nasabayann magdinner. https://t.co/KlsPnXWx97 Hahaha!!! Nagdudunung dunungan lang po. Heheheh! https://t.co/k6fnfJpnxQ Hindi ako madalas magpost ng ratings pero this time gusto ko lang talagang magpasalamat sa inyong lahat for the 33.6% rating ng TnT Finals. RT @teamvicePH: It's a royal rumble celebration.\nABANGAN!\n03.26.17 https://t.co/JVZwrZckNU Yung nagda-diet ka tapos biglang may nagluluto ng pancit canton. #TheStruggleIsReal Maymay can dance. Really promising. Future big star! #ASAPMarSorpresa Just woke up. Dumating na yung bebe ko. Lunch na daw kami. https://t.co/Mv27LEtJDi On my way home from TawagNgTanghalan after party. It's been a long, happy, successful day! So many reasons to celebrate. Ang saya lang tlga! Sa dinami dami ng dinala kong damit ang wala akong nadala e pang uwi. So paano? Panty n lng muna? Noven is L❤️VE!!!! Congratulations!!! Keep calm. Enjoy the great voices of world class Filipino performers. #TNTAngHulingTapatan GANDAng umaga daw sabi ng bebe boy!!! 😍😍😍 https://t.co/aFfa0yhMXQ Little Ponies KPop fans unite! Hahahah https://t.co/1XwbbrtnFl He had me first. And he chose to break my heart. Chozzzz! 😍 https://t.co/hXgqbI6aXJ Hooooyyy di ko to kayaaaaaaa!!!! Nagsmile sya sakiiiiiinnnnnnn!!!! Shiiiiitttt!!! https://t.co/DlrNMKNhvP He'll always be my one great love! Awwwww!!! https://t.co/3tMUAWRPht Alam ko na kung ano hihingin kong bday gift kay @ryanbang and @krungy21 . Eeeeeeeehhhh!!! Im sure mamamatay kayo sa inggit! 😜😜😜 Eto naman pa-share lng ng very light!!! https://t.co/PP233LWzlu Wag plsssss! Marupok ako. Marupok. Mapusok. Pokpok. https://t.co/bRIWO8S6U6 My loves!!!! https://t.co/GNbJooFWAt Found my self stalking Jin Young and Bo gum !!!!!! Waaaahhhhh!!! I'd appreciate that though im not comfy getting gifts from my followers. Yer love is enough! https://t.co/DV3DF4qBXC Ang gwapo nilang tatlo shit! #LITMHulog Oh em!!! I heard your giving me that hoodie as a bday gift. You're so generous Sir @juLiusbabao !!! 😊😊😊 https://t.co/VsRFWowsPx Buti na lng talaga naaaliw ako dito sa #LITMHulog . Ang gwapo nung bida! 😍😍😍 Im not mad. It's actually so fun to sometimes burn an idiot!  Sorry im no saint. 😜😜😜 Kaya next time wag #PaBrave !!! #WagAko 😜😜😜😜♨️♨️♨️ Wag ako ha! Isip muna bago tweet. Wag makabash lang. Para kang nagpahid ng gaas habang naglalaro ng posporo. #Sunog @CheekyCzy Sino kang tarantada kang maka Pwe sakin? Anung kasalanan ko sayo? May pa Jesus at Jeremiah 31:3 ka pang nalalaman s profile mong demonya ka! https://t.co/VuoE2HuefB Yung ang tagal mo ng nagchacharge pero di mo naman pala na-ON yung charger. #fail Bumoto nko.. At kung di manalo ung binoto ko ay tatanggapin ko khit masakit. Parang sa pag ibig lng. Di lahat ng gusto mo pwede mong ipilit. The horse is hoarse. Eksaherada ang mg magtatapat tapat ngayon sa #TNTHulingTapatanDay2 . Bakulawan at its finest. Sino binoto nyo? #TNTAngHuLingTapatanDay1 Laban pa din si Rachelle! 👏 #TNTAngHuLingTapatanDay1 Noven is LOVE!!! #TNTAngHuLingTapatanDay1 Marielle's voice is crystal clear. Sobrang ganda! #TNTAngHuLingTapatanDay1 Pag ginong ng hurados si Calmalone sasabihin ng tao wala silang puso.Pag di nman ginong sasabihin wla silang kwenta.Hirap din ng lagay nila. Maricel Callo reminds me of Vernie Varga. Ang galing ng hagod. Mataas pero di maingay. 👏👏👏 #TNTAngHuLingTapatanDay1 Kinabahan ako kay Carlmalone kala ko magogong sya. Wasnt his best performance today. But he still inspires me. #TNTAngHuLingTapatanDay1 Parang mas maganda kung ang pangalan na lang ni Wacky Kiray ay Wacky Pie . 😜😜😜 #GGVCanDoThat Ang laki naman ng susi nung Camella Homes! Gaano ba kalaki ang lock nung bahay? #PBBTheBigWinner Sadista talaga to si Big Brither. Humahagulgol na nga si Maymay ibinitin pa. Pano kung nalula yun at nasuka????!!Chozzzz!! #PBBTheBigWinner Congratulations to bestfriends Kisses and Maymay!!!! Both deserving! #PBBTheBigWinner Parang kasal ni Cora at Tanner tapos ring bearers si Mccoy at Nikko. #PBBTheBigWinner Pls watch out for my show later Gandang Madaling Araw Vice . Chozzzz!!!!! 😜😜😜 #PBBTheBigWinner Pagbukas ko ng tv nakita ko si Toni kala ko commercial ng Creamsilk PBB pala. #PBBTheBigWinner Ganda ng sagot ni Edward! Chukchakero si bagets. Plus pogi points! #PBBTheBigWinner Sa sobrang galing nilang lahat parang ang hirap tanggapin na may natalo. Kung pwede lang talaga lahat ipanalo. Haaaay! Ang mga lalaki isa lang sa maraming nagpapasaya ng mundo mo. Pero di sila ang mundo mo. I have a headache. And im still happy. Atleast i have a head that aches. Don't waste your time. Focus on the things that make you happy. Not on the things that make you angry. Smile. Live. Kisses is such a brave young lady. Im so proud of her. Gusto ko na naman syang yakapin. #PBBTruthOrLie https://t.co/gT10KIZhFi via @youtube WATCH NYO TO DALI! May sariling dance prod yung buhok ko. Hahahhaa! Im sooooooooo tired!!! Naubos enrgy ko shit!  #TNTULtimateResbakDay1 Thanks so much @KianaVee @donnypangilinan @Hashtag_Jameson @iamAndalioLoisa @iammarkoblea !!! Tonyt's ep was really fun! #iHeartGGV Ehem ehem! Paging Tita @AngeliPV ! Heheheh! Thanks po Ms Maricel! 💋 https://t.co/FQkizrWFAJ Pwede po bang whole family naman next time. Yer fam vs     Tita @AngeliPV 's  .  Hehehe! #iHeartGGV https://t.co/PWCrP42os1 Mga walangya kayo ako pinaglaruan nyo! #iHeartGGV https://t.co/wxFj9xK84T Awwww! Thanks Ella!!! U shouldve joined. Hehehe! See u again soon. https://t.co/ElFoUpEzIO So yung signature mo kalevel ng pictures ko???!!! Humanda ka sakin bukas! https://t.co/zxB9d3DfAa Si Loisa yung magandang jologs. Kakatuwa! #iHeartGGV Thanks Donny!!! Till next time. #iHeartGGV https://t.co/6mzkOEhor9 Kiana Valenciano's voice is major!  #iHeartGGV Chikahang public vs intl school. Hahaha! #iHeartGGV Kiana and Donny are both really good looking in person. #iHeartGGV Just got home. Pagbukas ko ng pinto nakita ko umiiyak yung kasambahay ko. When i asked why ang sagot nya 'Naevict na po kasi si Elisse.'. 👏👏 Food hunting in Binondo with my beshies @Estrada21Karla and Paul Cabral. Since pag Sunday feeling religious ang maraming tao, may bashers ba pag Sunday? Chozzzz! 😜✌️😍 Every Sunday andami kong nababasang post na 'Church with family.'. Andaming palasimba sa social media. Pero bakit andaming salbahe? Awwww! Naalala ko sayo Nanay ko. Ganyang ganyan sya tuwing Linggo. https://t.co/MzIZwT9aoF What's the best thing about Sunday? Watching FEU vs NU women's vball. Ang bango ng laro ni Malabanan. Feeling ko ang matinding naglalaban laban ay Sam, Carlmalone, Jex and Froilan. Boys ang nagshine this quarter. Isang malaking injustice kung hindi makakapasok si Froilan sa Grand Finals. - Ogie Alcasid #TNTQ4AwitNgBuhay Sa sobrang galing ng mga semifinalists sa Tawag ng Tanghalan nakakapanghinayang yung mga hindi papasok sa Finals. #TNTQ4HuradosChoice Ang title ng palabas ay TELEPORT. Chozzzzz!! #PBBTitigNgPagIbig Hahahahhahah!!! I love this commercial! #PBBTitigNgPagIbig Ang tagal ng eksena ni Kisses paalis nako e. Patience is a virtue! #PBBTitigNgPagIbig Napapangiti ako nitong Maymay at Edward! 😍😍😍 #PBBTitigNgPagIbig Waaaahhhhh ang cute ni Maymay! Di mukang beginner. #PBBTitigNgPagIbig Ayun! Superhero si Mccoy! Nakalipat agad ng location. Tereeeey! #PBBTitigNgPagIbig So far so good! Galing ng housemates. #PBBTitigNgPagIbig Kung kelan naman eksena ni Edward tsaka nangangarag ung tv!! Sa inyo din ba o dito lang? Ung first scene lang siguro taped. Pano naging live? Paano nakapagpalit ng damit si Maynay at nakalipat ng location sa magkasunod na eksena? WINNER! Ang bongga ng linya ng pari sa MyDearHeart. Anu ang kayang gawin ng magulang para sa anak? Isang salita lng. LAHAT! Ayun naiyak ako! #NewProfilePic https://t.co/aTFjTrB7yZ Yung mga eksena sa politika ang gulo gulo. Kawawa ang mga tao di na alam kung alin ang totoo. Ang bongga lang ng chikahan sa Dancing In Tandem. Masarap pero masakit #TNTQ4MusicaLinfLuence Mas gusto ko pang manuod ng O Shopping kesa magbasa ng news. Andaming pafamous lately. Andaming parelevant. Pathetic! #wowmakapatheticlang Just finished badminton. Kahit ano talagang pagod ko hindi mabawas bawasan ang ganda ko. Haaayyy! #GandangAyawSumuko Dedmahin mo lang yang problema mo para maoffend at mag-walk out. O sya magbabadminton muna ko. Ng mahaggard naman ang ganda ko. Thanks! Next time watch ka. https://t.co/zLV6UPicR0 Di naman. Mas napapagod ako para dun sa iba na ginagawa ang lahat mahabol lang ang gaanda ko. https://t.co/pT4RyXEYy6 Alas syete na ang ganda ko pa!! #GandangAyawSumuko Eto na naman ang Nagmahal Nasaktan Nagsayaw. Halina't magdunung dunungan sa pagaadvice. #TNTQ4FightSong Ang cool off ginagamit para makapag-isip. Hindi para magpahagip. #TNTQ4AuditionSong Chusera tong si Maja. Bigla tuloy akong napaisip kung sino ung LaSalle. E ang huli kong naka date taga TESDA. #GGVGandangGinalingan Kanina Dayanara ngayon naman Maja. Kelan kaya ako magkakaguest ng mas maganda ko? Haaayyy!!! Nakakaoffend na din e. #GGVGandangGinalingan When yer shoes look prettier than yer face. #GGVGandangGinalingan Nung nakita ko mukha ni Dayanara tinanong ko talaga sarili ko kung bakit di ako sumali ng Binibining Pilipinas dati. #GGVGandangGinalingan Sana next challenge ni Direk Rory yung paano kantahin yung \"Wag mahiyang magtanong...\" ng ibat ibang emosyon. #PBB Di ko maimagine pano kaya kung sa sobrang motivate ni Direk Rory bigla syang sapakin nung artista. #PBB Yung habang pinapanood mo si Direk Rory na minomotivate yung artista di mo namamalayan nagmomotivate ka na din. #PBB Ang galing ni Direk Rory Quintos grabe!!! Grabeeeee!!! #PBB Sobrang payat ni Toni Gonzaga. Pwede kang mag ipon ng tubig sa collar bone nya. #PBB Etong si Big Brother kung makapag utos kala mo kanya ung bahay e ABS naman nagpagawa nyan!! Bossy ampowtah! Kuya bakit pag may ginagawa yung mga housemates kahit hirap na hirap na sila di ka tumutulong??? Boss ka ba??!!! 🎤 🎤 Wag mahihiyang magtanong.... Minsan naguhuluhan na rin ako kung PBB ba to o Minute to Win It!!! Nagmemake up ako para rumampa habang nanunuod ng MMK. Patapos nko e napaiyak pako! So bura na nman! Bwisit tong Julia at Joshua ang galing! GANDAng mownen!!! #ShowtimeKeringKeri Excited to watch @MsLeaSalonga 's concert tonight at the PICC. Super happy! Let's partytttteeeeeyyyy!!! Just signed my new exclusive contract with ABS CBN. Blessing after blessing after blessing! Thank you Lord!!!! 😍😍😍😍😍 https://t.co/dy2b7V5Fej Halika na magharutan na tayo daliiii!!! #ShowtimeAbaMatindi Ang sakit ng buong katawan ko. Parang nagconstruction worker ako kagabi. TEAM VICE maraming maraming salamat! You're unkabogable! Hanggang sa susunod na hagalpakan. https://t.co/uHA7esTdH2 Our official hashtag for tonight's concert. #VGPusuanSaAraneta https://t.co/Y34LjtluvP Never been so excited for Valentines! This day is major! #tense Show starts at exactly 8pm. Siguradong gagalingan din ng traffic bukas kaya bumyahe kyo ng maaga. Wag kang babagal bagal para di ka iniiwan! https://t.co/b7FhTjUIyg MARAMING MARAMING SALAMAT PO MADLANG PEOPLE!!!! Promise gagalingan ko talaga hanggang sa mag uwian na! https://t.co/Nvfs2JpX3t Hooy @VhongX44 ikaw ang unang nag 'lab yu!'. Nag i labyu too lang ako para di ka maiyak pagbaba ng phone. https://t.co/xjWgQRLGP9 Kakagising ko lng. Pagbukas ko ng tv kala ko replay ang ASAP kasi nakita ko sarili ko kumakanta. Buti tinitigan ko si Liza Soberano pala. Naku naku naku! Wag ka na vhong! Huli na kita! Wag mo ng daanin sa biro. Alam kong nadevelop ka! @VhongX44 https://t.co/4PgaTuMNZJ Vhong pigilin mo yang nararamdaman mo. Tayo lng rin ang mahihirapan. @VhongX44 Araw araw mo na ngang kasama. Linggo n lng ang pahinga. Super viber pa. Tapos pag di mo nasagot tatawag k pa. Ung totoo bet mo ba ko Vhong?! RT @roxsantos: Mamaya na po! Sabay sabay nating panuorin ang bagong music video ng nag iisang @vicegandako #HanggangKailanAasa Official MV… RT @_MagandangBuhay: Bago sa Araneta eto muna #PusuanMoSiViceSaMB! Bukas na 'yan! https://t.co/chA1h9nJqM Ung sakit ng feeling ng minahal mo ung jowa mo tapos naahas ay walang pingkaiba sa feeling ng biglang umulan after mong magpacarwash. RT @Fact: Never ignore someone who cares for you, because someday you'll realize you've lost a diamond while you were busy collecting stone… 🙏🙏🙏 https://t.co/CLdo6yIKw7 Just finished GGV taping with Lizquen. Sobrang daming pasabog kalurks! Kahit ako nastress in a good way. Abangan nyo sa Linggo! Na LSS naman ako sa That Should Be Me ng Mayward. Ang sakit pala nung song. Parang gusto ko tuloy kantahin sa concert. Hahahahahha naaliw naman ako dito! https://t.co/ADfBEzRMCr Makatulog na nga. Masyado na kong nalalamangan ni Liza Soberano. Natanong mo ba ang sarili mo kung may ginagawa ka para masiguro mong maganda ang future mo? Kahit anung sakit ang kayang idulot ng pag ibig gugustuhin mo pa ring ulit ulitin. #PusuanMoSiViceGandaSaAraneta #Feb14 Hoy bumili ka na ng ticket sa #PusuanMoSiViceGandaSaAraneta !!! Wag mong antaying isumpa ko yung lablayp mo. Bili na dali!!! 8 days na lng #PusuanMoSiViceGandaSaAraneta na! May ticket ka na ba? Wag ng magpatumpik tumpik pa. Chokoleit gives us hope that whoever you are there will always be that one person in this world who will find you attractive. Tereeeeeeyyyy! Kung maka kadiri naman yung iba kay chokoleit kala mo kay gaganda at kay sasarap ng mga labi nyo!! Tse!!! Mga inggitera!!! Now here at the Samsung Hall for the #BANGPINEDAMENSWEAR2017 fashion show. Im a mowwwwwwddddeeellllll!!!  #BANGSWORLD Kung totoong allergic ka sa seafoods e bakit jumowa ka ng hipon???!!! Tse!!! Watching UAAP WVolleyball on a bagot Saturday afternoon. ADMU VS UST. Rondina is so fun to watch. This #ShowtimeSpeciaLLyFeb4you episode is soooooooo funny!!! Literal na napagod ako kakatawa. Loveeeeet!!! Just finished my band rehearsal for #PusuanMoSiViceGandaSaAraneta !!! Ang lakas maka- 'saksak puso\" ng mga kanta pakshet! Pag inaya kang magcheck in ng jowa mo sa valentines wag kang papayag. Bad yun! Watch na lng kayo kamo ng concert ko! Walng bitin dito. https://t.co/m6PRFdFtYe Throat in very good condition. Yeheeeeyyy!!! Pinusuan ni Doc! Tumawa ka para maka move on ka! Paano ka sasaya kung makupad ka. Bili na ng ticket dali! Call Ticketnet 9115555. https://t.co/maCy6dglP3 Throat check up in St. Lukes. Kailangan fresh ang lalamunan before the concert. Pag chikahang pag ibig ang daming opinyon pero pagdating sa school nganga sa recitation. Super cute naman nito! 👏👏👏 Pupusuan kita! ❤️ https://t.co/iBLfSZQOu9 Ngayon ko lang narealize. Sa Paris ako nag New Year. Naiwan ko dun ang bertud. Sorry po! #MissUniverse Congratulations France!!! #MissUniverse Haiti looks really fab and queenly. #MissUniverse #Philippines Umiiyak na si Colombia. Naiyak din ako. Dama mong gustong gusto nya talaga manalo para ibawi ang bansa nya. 👍👍👍 #MissUniverse #Philippines Ngayon pa lang nakaready na yung ipapabitbit sa kandidata natin sa National Costume. Wala ng kakabog pa dito. #MissUniverse #Philippines https://t.co/hOgXDUpqCl Pinaka bet ko ang chukchak ni Haiti. I thought it was the most sincere. #MissUniverse Colombia Haiti France all deserving!!!👏👏👏 #MissUniverse #Philippines Thanks so much Maxine Medina!!! You still made us proud! 👏👏👏 #MissUniverse #Philippines Ganda ng chika ni Colombia about violence. Tumbok! But if you take the crown away from the Philippines there will be violence! Chozzz!!! ✌️ Pag nanalo talaga si Maxine manlilibre ko sa Burger Maxine! Eeeeeeeeeeee waleeeeeyyyy!!!! #MissUniverse #Philippines Woooohhh deretso ka na sa finish line Maxine wag ka ng pepreno!!! Iretouch mo sila ng alikabok! #MissUniverse #Philippines Yung ganda ni Mexico yung tipong jojowain ni Donald Trump. #MissUniverse #Philippines Laban na laban si Thailand!!! ayaw magpatinag! #MissUniverse #Philippines Evening gown competition happening in the morning. #MissUniverse #Philippines Kinabog ng NatIonal Costume ni Myanmar ang famous backpack ni Dora. #MissUniverse #Philippines Waaaaaahhh!!! Pasok ulit si Maxine! #MissUniverse #Philippines Ang daldal ni Kenya. Pang blog lagi ang sagot. Aliw Hahahah! #MissUniverse #Philippines Sobrang puti ng ngipin ni Brazil parang naka camera 360. #Philippines #MissUniverse Ayaaaannn ganyaaaaaan Maxine!!! Kabog sa swimsuit! #Philippines #MsUniverse Spain failed to invade the #Philippines in this year's #MissUniverse . Philippines USA Thailand Kenya Canada France Haiti Panama Brazil Colombia Mexico Peru Indonesia #MissUniverse Top13 Waaaaaahhhhhh pasok na si Maxine sa top 13!!! Ang saya! #MissUniverse #Philippines Good luck Maxine! You have our unkabogable support! #MissUniverse #Philippines Kaloka busog na busog ako. Di ako kabayo. Isa akong baboy! Baboy! Babooooooooyyyyy!!!! Relax ka lang dyan Maxine! Ako na bahala kay Albania! #MissUniverse #Philippines https://t.co/Peb7JFqcJN Humihingi po ako ng paumanhin n inilihim ko s inyo na taga Sweden ako. Gayunpaman buo pa rin ang suporta ko sa #Philippines . #MissUniverse https://t.co/quTqfZv3Wm Ung friend mong di umorder kasi diet daw sya pero kumuha naman sa lahat ng order ng mga kasama nya. Charotera! Naku tusok tusok ang rampa ni Thailand! Laban pa Maxine! Ibaon mo na. Kaya yan! #MissUniverse #Philippines Ayan ang ganda ni Maxine sa long gown. Pero konting tusok pa bes. Wag kang matakot. Tusukin mo silang lahat. #MissUniverse #Philippines Di pa masyado confident si Maxine sa swimsuit. Pero keri pa yan sa long gown. Laban girl! Lets pray for her. #Philippines #MissUniverse Ayooowwwnnn!!! Iba din! Ginalingan din e! Pusuan mo na bes! https://t.co/bjo1vB0XDS Halika na dito Maxine!!! #MissUniverse #Philippines https://t.co/R04EdA2Ndr Thank you Lord for the gift of sleep! Naenjoy ko sya ng 12hrs. Bawing bawi ang 2days kong puyat. Nabeat ko ang energy gap! 😍😍😍😍😍 Kapag sinabi ng girlfriend mong ayaw nya ng nasasakal itanong mo sa kanya kung bakit lagi syang nakachoker! #MissUniverse #Philippines https://t.co/3ny1GkcaTE Pusuan natin si Maxine Medina. ❤️❤️❤️ https://t.co/7xALTg84JE Just finished Day 2 of scriptwriting. Tired but i loveeeet! Sleep ng ilang oras then work again. #GustoMoYanE #LabanParaYumaman Itutuloy ko na ang naunsyami kong isa't kalahating oras na tulog. At gigising ng 7pm para magtrabaho. Buti na lng bottomless ang ganda ko! Please dont force me to take a selfie. Nakakahiya sa mga Miss Universe candidates. Baka mag uwian dahil may nanalo na. Ayokong maghilamos. Ayokong mapunta lang sa kanal ang katas ng ganda ko. Nakakaganda ng gising ang pagtingin ko sa salamin! Pinakain na galit pa!!! Pasok kita sa Facebook e! https://t.co/B5feKDpisB Salamat sa lahat ng nakabili na ng tickets para sa #PusuanMoSiViceGandaSaAraneta !! Bongga ng ticket sales. Ginagalingan nyo din talaga! ❤️ Laugh together. U dnt how much time you have left with each other. https://t.co/w0PtjM2Lz2 Oh em we got the same problem now! Lol https://t.co/0qQbUZOgOZ Pls tell yer mom I Love Her! ❤️❤️❤️ https://t.co/ovxXSjOQJe May Coldplay tickets din ako Zanjoe sampu para wala tayong katabi pag ako ka-date mo! Waaaahhhhhh! Zanjoe's styling in TWBA so on point! 👍👍👍 Mas masarap icelebrate ang Valentines ng humahagalpak ka sa tawa! Kaya tara na bes PUSUAN MO NA! https://t.co/1zSaEl3aTM Haggardo Verzosa from Pagudpud ILocos Norte!!! Uwian na may nanalo na ng Best In Swimsuit! Sa Feb.14 ang coronation night sa Araneta Coliseum. https://t.co/WaTrmr7sO1 Psssst! Nageemote ka ba? Pakinggan mo yung bago kong kanta yung \"Hanggang Kailan Aasa\". Para may background ung pagiinarte no. Dali! Yung nangutang ka para makabili ng bagong cell phone. Tapos pinost mo sa ig at ang caption #Blessed! Ginalingan din talaga! Yung status na \"Chillin' with my crew.' Pero ang sa true nakatambay lang naman sa kanto. Ginalingan lang talaga! Yung status na \"Dinner with friends.\" na ang sosyal ng datingan pero sa true nasa karinderya lang naman. Ginalingan lang talaga! 😜😜😜 Maganda tong Lunes na to!!! Masaya! Mukhang ginagalingan e! 😜😜😜 Thanks so much! Just reported it. https://t.co/rA3jFPC2s7 PUSUAN MO SI VICE GANDA SA ARANETA. Nagmahal. Nasaktan. Nagconcert. Feb. 14,2017. Tickets available at Ticketnet. 9115555 for reservations. RT @roxsantos: You can now stream on Spotify the latest single of @vicegandako Hanggang Kailan Aasa https://t.co/urHrrICuGK Sige anak tusukin mo silang lahat at galingan mo! Sabay sigaw ng 'Uwian na! May nanalo na!'. #YFSFCutenessOverload Watch tyo ng tusok na tusok sa dramang buhay na busog na busog sa aral ng pinakamalaki kong kaibigan na si @Estrada21Karla. #MMKKarla O eto o mag emote muna kyo. Pakinggan nyo tong hugot, tusok, baon, bulagta sa pait na kanta ko. #HanggangKailanAasa  https://t.co/MYFlKqgUAH Halina't magPUSUAN TAYO SA ARANETA! Available na ang tickets. https://t.co/3pVLmmkSF8 Tusok na tusok no beshie!!!! Di na makaagulapay! #HanggangKailanAasa https://t.co/8Gx4frq7Ne https://t.co/MYFlKqgUAH HANGGANG KAILAN AASA lyric video Eng sheket nemen neng kente shebre!!! #MORHanggangKailanAasa #MORHanggangKailanAasa eto naaaaa!!!! Ill be on air. Catch me on MOR 101.9. Mamaya na eere ang hugot na hugot kong sagot sa kantang HANGGANG KAILAN ni @khelpangilinan . Pakinggan sa MOR101.9 7pm. https://t.co/9yxO1mlqmG Hayup nman tong Greatest Love na to! Napakaganda! Napakahusay nung mga artista!Nakakaiyak! Grabe!Ang sikip sa dibdib e wala naman akong bra! Waaaaaahhhhhh!!!! Just finished recording. Thanks and sorry to bother you @JonathanManalo and @roxsantos !!!!! #HanggangKailanAasa Tamang kinig sa mga hugot songs. Sa sobrang emote ko eto naparecord ako ng bagong kanta. Kaloka! Ang sakit ng song! Magpusuan tayo sa Feb.14. https://t.co/HQ9uVPlSsI #TheSuperParentalGuardians Victory Party happening in a bit. Ikaw ang date ko sa Valentine. Magkita tayo sa Araneta Coliseum. Bakit andaming nakaexperience na walang audio ang GGV? E nanunuod ako meron naman. Anyareeeee???? Ang tanging hiling ko lang naman ay makakain ng kwek kwek ngayong gabi. Uwian na! Nanalo na yung anak ko! Uwiiiiiiiiiiii!!!! #YFSYKids Hoy! Puro ka cell phone! Tutok ka sa social media! Kausapin mo kaya yang katabi mo! Pag yan nawala hahanap hanapin mo. Thanks to PauloAngelesForever FC for the flowers u sent me. Ur too sweet! 😍😍😍 Thanks @VhongX44 sa #MangKepwengReturns treat! Ang saya! Lalo na pag buong barkada. Congrats!!! Off to Trinoma with the Showtime gang to watch Mang Kapweng Returns. Tara! Nahaggard ako ng bongga sa Sinemoto kaloka! #ShowtimeVhonggangSeLebrasyon Literal na 'Uwian na!' May nanalo na! See you again Manila! Pakihanda na ang traffic. Ineexpect ko yan. Got only 10hrs left to enjoy Paris. 💔 Paalala: Hugasan ang mga bahaging naputukan. #Happy2017 Happy New Year Unkabogable Madlang People!!! Salamat sa isang masayang taon kasama kayo! Mahal ko kayong lahat!!! Ibayong pagiingat  sa lahat ng mga nagbabalak magpaputok ngayong gabi. Pag di handa wag magpaputok. Di biro ang magkapamilya. Katuwa ang haba ng mga NewYear chika ng mga tao. Ang ibig sabihan lng nman e 'Ang bongga ng 2016 ko. Sana mas bongga sa 2017. Tenkyu Lord!'. Hello again PARIS! Bye Rome. See you again soon. Love u! Nag-Vatican kang ako kahapon. Tapos natulog. Pag gising ko may ganito na. Iba din talaga to si Lord e. Ginagalingan din talaga! #tenkyuLORD https://t.co/eRVIj9DneR Good morning from Italy!!! Ang bongga ng tulog ko. Winner ba ang gising? Anung chika mga besh? ✈️ ROME, ITALY Bye Manila!!! #BoomParis Done watching VinceAndKathAndJames, Seklusyon and Babae Sa Septic Tank. Watch ko ung iba pagbalik ko ng Pinas. Let's support the MMFF! Da who itong friend kong nagtatampo dahil di ko daw pinuri ang acting nya sa VKJ ? E nagbasketball lang namn sya! Clue: Axel ang name nya. Watch kayo ng #VinceAndKathAndJames. Nakakatawa, nakakakilig, nakakaiyak. You have to witness the brilliance of Joshua Garcia. Kagaling!!! Just finished watching #VinceAndKathAndJames. Maganda ang movie!!! Walang halong kyeme. Ginalingan din!!! Happy Birthday po Jesus!!! Salamat po ng maraming marami!!! I love you po!!! Naghanda ako kasi po Birthday mo! Ginalingan ko po! Yabyu! Merry Christmas sa inyong lahat!!! Maraming salamat at mahal ko kayo! Ginagalingan nyo din kasi e. Isang yakap na may kasamang sipa! 😍❤️💋🐎🐎🐎 RT @teamvicePH: Wag masyadong mag-isip kung anong magandang gawin ngayong Pasko! Tumawa tayo! Let's watch #TheSuperParentalGuardians https:… Dami pa ding nanonood ng #TheSuperParentalGuardians till now!!! Ang saya!!! RT @teamvicePH: Watch na ng super comedy movie event of the year #TheSuperParentalGuardians sa mga sumusunod na movie theaters!!! https://t… Pasko na! Baka naman malungkot ka pa! Itawa mo na yan bes. Watch ka ng #TheSuperParentalGuardians Kaway kaway sa mga nagwawatch ng #TheSuperParentalGuardians today!!! Magkano premyo??? Ginalingan ko naman! 😜 https://t.co/upR8uG5HJY It's Sunday Family Day kaya awra na sa mga sinehan at manuod ng #TheSuperParentalGuardians . Nakakaganda to ng buhay ng pamilya pramis! Just landed in Cebu with Awra. Aawra kami mamaya sa Ayala Terraces kaya rumampa ka na din. Gora na! Galingan mo! #TheSuperParentalGuardians Congratulations @iamr2alonte  for your successful 1st solo concert!! Keep on shining! #TheSuperParentalGuardians is still showing nationwide. Galingan nyo ang pagtawa! Manood kayo ng #TheSuperParentalGuardians . May Christmas Party sa mga sinehan. Ang sarap isiping ang ikinapagod ko ngayong araw na ito ay ang walang habas na pagtawa! Itutulog ko na tong saya ko. Haaaay! Sarap ng life! Taped 3 GGV episodes today. So tired but happy!!! Work and play. 😍😍😍 Screenings in Canada are also extended. #TheSuperParentalGuardians https://t.co/J31lv98VRf Screenings in the US are extended. #TheSuperParentalGuardians https://t.co/EQ9rWgFyGr Aminin nyo di nyo inasahan na may mga eksenang horror kaya gulat na gulat kayo! Sabi sa inyo ginalingan namin e. #TheSuperParentalGuardians It's a ganapfull day!!!! Kailangang galingan para uwian na! 😜😜😜 RT @bizarrexx: I've watched #TheSuperParentalGuardians  and I died laughing 💯😂😂😂 Thank you @vicegandako 😘 RT @DarrenaticsAl: Galing galing ng mga cast ng #TheSuperParentalGuardians  \nGood job @vicegandako  marami po kayong napapsaya..ttotoo nga… RT @aquariusche: Grabe! Yung akala ko mapuputulan na ako ng hininga sa sobrang tawang tawa ako #TheSuperParentalGuardians @vicegandako #TheSuperParentalGuardians reached the 350Million mark last night! Maraming salamat po Madlang People!!! Ginalingan nyo din talaga! RT @imJazmyn14: Two words for #TSPG : Laglag pustiso. \nTawang tawa lola ko eh ginalingan din eh! @vicegandako RT @marrymeleigh: @vicegandako jusko vice! Kanina lang kami nanood kasi inuna final exams pero jusko stress reliever talaga! Thanks! https:… RT @oleinstephviceg: Napanuod ko na bes @vicegandako  sakit sa panga, tiyan at maiiyak ka nalang kakatawa. NAPAKAWORTH IT! CONGRATS AND THA… RT @gerard_JD: Ramdam ko ang hirap sa paggawa ng #TheSuperParentalGuardians. Halos lahat big scenes.Napakasayang pelikula. Congrats @vicega… Now watching my lovely dowwwter in MMK! Proud of you Awra, my little Vice! That's my baby girl @krungy21 !!!! Sizzling hot! Ginalingan din e!! #BoybandPHGrandReveal Ayuuuun ginalingan ko ang pagtulog! Nakalimutan ko grandfinals pala ng Boyband ngayon. #taranta Itawa mo na ng lahat ng stress mo ng nakaraang linggo. Gora na sa sinehan wag ka ng magbagot bagotan!!!! #TheSuperParentalGuardians Uwian na mga bes may nanalo na!!!! Happy Sabado! Yabyu! Super kilig to see you in the cinema earlier miss @LornaTolentinoF !!! Salamat po! 😍😍😍 #TheSuperParentalGuardians  https://t.co/AdPG9bau3h 😄😄😄👍👍👍 #TheSuperParentalGuardians  https://t.co/P41naoJlNv Thanks so much to you and Miss LT for watching!! Hope u had fun! 😄😄😄 #TheSuperParentalGuardians  https://t.co/AX3gkTxXe8 Thanks so much to my good friends Paul Cabral and @carlaestrada for the block screenings. Super love you! #TheSuperParentalGuardians On my way to Rob Mag to attend a blockscreening sponsored by Paul Cabral. #TheSuperParentalGuardians Kaway kaway sa mga nakapanuod na !!! Ginalingan nyo din talaga e!!! Maraming salamat po! #TheSuperParentalGuardians https://t.co/P9YRVqXUyX Bat ganun? Natatanggal yung pinopost kong video sa ig. Wazzrongwiddaworldmama!!!! GANDAng umaga!!!! Maganda ka ba? 😜😜😜💋💋💋 Manood po kayo ng #TheSuperParentalGuardians . Promise bes ginalingan namin. 😜😜😜 RT @mytangibal: Yung ang dami kong tawa sa movie nina @vicegandako at coco. Super thank you! Nakalimutan kong finals sa law. 😂\n#TheSuperPar… RT @ellimacdaza: yung mga punchline ng movie, havey na havey sakin e 😂 na paos ako kakatawa e 😂 ginalingan din e @vicegandako #TSPG RT @iamTTPrince: It's been 5 days since I'd watched The Super Parental Guardians. Still freshly remember all the funniest moments. The best… RT @jane012584: Done watching #TheSuperParentalGuardians . Nakakawala ng stress at nakakagood vibes..Thank u @vicegandako sa napakasayang m… RT @VICERYLLEW0RLD: my professor posted this last december 2!!! super enjoy sila sa TSPG mamshie! 💓 https://t.co/0w0o1KIEdA Keri mo ba sa SM cebu para makapagpareserve nko. https://t.co/vjuCwUaiwf Hangkyuuuuuut!!!! #TheSuperParentalGuardians  https://t.co/xaBFGeyn6q Maraming Salamat Madlang People!! Ang lala ng mga sinehan. Ang saya!! Napaaga talaga ang Pasko. #TheSuperParentalGuardians RT @jnrymnd: Just watched #TSPG! Parang speech choir ang ganap sa sinehan. Sabay sabay na halakhakan at hampasan! 👏🏻👌🏻 Iba ka Mother Horse… RT @SupChardy: @vicegandako Your movie with Coco and the kids made my weekend super special.The laughter inside the cinema were all real!#T… RT @sachi_reyes: Super laughtrip ang #TSPG. Yung inay ko na usually tulog sa sinehan, this time gising siya at tawa ng tawa.😂😂😂 Thank you @… RT @Jannadatuali: From First til last, Tawa lang kami ng tawa😂 ang daming pakulo💪😂 @vicegandako #TheSuperParentalGuardians RT @imAloysiusSolis: Napakahusay at Napakaganda ng #TheSuperParentalGuardians  👏🏻 Nakaka enjoy pramis ✋🏻👏🏻👏🏻👏🏻@vicegandako RT @aikuhhhflores: Worth it yung pag pila ng mahaba! The best talaga iba to sa lahat ng movie ni Vice grabe. Una hanggang huli tawanan sa l… RT @prinsesatouris1: Lack jaw! 👏yung hampas nang mama ko sakin at wala prin tatalo sa tulo nang laway ko kakatawa!😍❤ HANEP! GALING MO MOMSH… MARAMING MARAMING SALAMAT PO!! https://t.co/hf1UMWMrR4 RT @sheedarzsheen: You all did well @vicegandako , Coco , Awra and Onyok . You let the two kids shine din . The best yung TSPG . Sasakit pa… Ang sarap basahin ng napakaraming positive feedback ng mga nakanood na ng #TheSuperParentalGuardians . Maraming salamat po! RT @mikylaglorioso: The Super Parental Gaurdians, the most funniest movie of @vicegandako! May hangover parin ako sa movie na ito! 😂😂😂 RT @Zhuramayla_96: The Super Parental Guardians is the best movie of ate vice @vicegandako RT @tnlxfn_jessay: Grabeeeh @vicegandako di ko kinaya ang TSPG. Sakit sa tiyan kakatawa 😂😂😂 Iba ka Viceey! Salamat 🙏😘 Next year ulit. Lovey… RT @thesupremo17_: The Super Parental Guardians = the best movie of @vicegandako 👏😂 Ginagalingan nyo din talaga e! Ayun basag! Lol! @annecurtissmith @jhongsample Thanks Mac! 😍😍😍 https://t.co/dYHaHCAP8W Happy weekend! Sugod na sa mga sinehan. Inaantay na kayo ng mga Super Parental Guardians! RT @MNezM: ito na ata ang isa s mga nakapagpatawa sakin ng bongga! Just watched #SuperParentalGuardians thumbs up @vicegandako https://t.co… RT @MNezM: Nkakatawa n nga pero mas lalong nakakatawa yung mga tawa ng kasma mo sa sinehan! All-in-one movie! @vicegandako #TheSuperParenta… RT @Jasmine_Mimi28: Done watching .tawa ako ng tawa sa sbrang saya ko nkalimutan ko benreak pala ako ni jowa a while ago😂 @vicegandako http… RT @jascarpio: I've been laughing from start to finish. @vicegandako's BEST movie to date! Congrats! Super benta! 👍🏼👍🏼😂😂😂 RT @meolgado: Ang dami kong itinawa sa TSPG must watch guys nakakaGV talaga ang CocoVice Tandem @vicegandako Congrats po☺️ RT @jessmile24: Grabehan lang ang solid ng TSPG movie.. Tawa lang kame ng tawa the whole time 😂👍🏻 @vicegandako RT @Cjeanjimenea: GREAT MOVIE AS IN! @vicegandako 👏🏼 Ang tawa ng mama ko grabe hindi ako maka move on 😂 #TheSuperParentalGuardians Stressed ka ba? O watch ka na. #TheSuperParentalGuardians RT @duh_reese: I can't remember when was the last time I laughed so hard until last night. Great movie @vicegandako! #TheSuperParentalGuard… Pleasure is ours. 😍 #TheSuperParentalGuardians https://t.co/iKYjn1PaL0 RT @JovanBebs: #TSPG #TheSuperParentalGuardians  @vicegandako LAUGH TRIP TALAGA.. PARA NA AKONG MABABALIW, NAWALA BOSES KO SA LAKAS NG TAWA… RT @itsshaine12: Worth it yung pag pila at pag hintay!! nakakatawa promise 😂 @vicegandako ❤️ #TheSuperParentalGuardians https://t.co/18ttLQ… RT @krishnampc: #TheSuperParentalGuardians grabe naiyak aq kakatawa, saya sobra..\ngaling mo @vicegandako\n#TSPG3rdMegablockbusterDay https:/… RT @imangienorbe: It was one of the best movies Vice has ever made. Kudos to the team behind #TSPG. The cinema was jam-packed last night. 👍… RT @StarCinema: Vice Ganda now in SM Megamall with the finalists of Pinoy Boyband Superstar to watch #TheSuperParentalGuardians! #T… https:… RT @AalaSehds2: Yung maiiyak ako sa katatawa dahil sa #TheSuperParentalGuardians sulit ang binayad sa ticket. Super ganda ng movie. Clap cl… RT @beypinero: Worth it! We had so much fun watching #TheSuperParentalGuardians. The happiness I felt is just beyond my expectations. RT @jorenesalvaleon: #TheSuperParentalGuardians was a full-package movie with laughter, emotions &amp; sensible lessons to ponder. Thumbs up @S… RT @rodmagaru: #TheSuperParentalGuardians first day gross breaks all Philippine opening day gross EVER since 1912. Yun! @vicegandako RT @KristelArmonio: Katatapos lang manood ng The Super Parental Guardians. Grabe tawa ng mga tao sa Loob ng Sinehan. Ang Ganda at galing ni… RT @jirehlim: Sakit tyan ko kakatawa!!! Hahaha! Promise di kayo mag sisisi!!! 😀 @vicegandako congrats din po… https://t.co/vMGLHdBA96 RT @reghine131: I've watched your movie @vicegandako! GRABE NAPAPANAHON...fav ko ung KUMANTA KAYO DALAWA ni...lams na! hakhak...WORTH WATCH… Megamall here i come with the Boyband Superstar finalists. We're watching the 5:40 screening. #TSPG2ndMegablockbusterDay Tara na watch na tayo ng sine! Papunta na kmi ng Megamall. #TSPG2ndMegaBlockbusterDay Mamayang hapon manunuod ako ng #TSPG2ndMegablockbusterDay sa Megamall kasama ko ang mga finalists ng Boyband Superstar. Tara kitakits tayo! RT @MyCHOSdotcom: THE SUPER PARENTAL GUARDIANS, P68-M on its 1st day. It is now the highest opening gross for a local film of all time #TSP… Para sayo to Direk Wenn. https://t.co/BDwprrR9q5 I share this success to you Direk Wenn! Thank you for preparing me for this day. I hope im making you happy and proud. I miss you Mader! 😪❤️ THANK YOU LORD! And most of all SALAMAT PO sa napakaraming positive feedback! Because we love you we give you the fun that u deserve! #TSPGNowShowing At sa lahat ng mga Kapamilya at artistang sinamahan akong manuod sa Trinoma MARAMING SALAMAT! Para kong nagpremier night. #TSPGNowShowing THANKS SO MUCH SA SHOWTIME FAMILY KO!!! From the Director, to the hosts, to the staff! Salamat! Ang sarap ng suporta nyo! #TSPGNowShowing Walang duda PASKO na! #TSPGNowShowing  https://t.co/yYN8LqQxs9 Damang dama nating lahat na PASKO na!!! Maraming salamat po sa pagtangkilik nyo ng regalo namin sa inyo!  Salamat sa mga tawa at palakpak! MARAMING MARAMING SALAMAT PO!!! Abot langit ang pasasalamat ko!! Thank you so much LORD! YOU are so good! #TSPGNowShowing Waaaaahhhh natetense ako kaloka! Para kong first timer! Hahahahh! #TSPGNowShowing  https://t.co/3crI883cMP Merry Christmas Madlang People!!! #TheSuperParentalGuardians Ang wish ko sa Pasko sana makalabas na sa kulungan si Cardo para makanuod sya bukas ng The Super Parental Guardians. #FPJAPKampihan Bukas Pasko na! #TheSuperParentalGuardians RT @teamvicePH: Huwag palampasin ang cast ng  #TheSuperParentalGuardians today at SM MOA Music Hall, 5PM! https://t.co/Sz9niElbXo Pampagood vibes. Watch my unkabogable prank. https://t.co/gBnlK6QIxB Mama @ogiediaz sorry naprank ka namin nila @mor1019chacha and Martin. I love you! Hahahahha Awra kung wala ka ng maintindihan, kung wala ka ng malapitan kapit ka sa akin. Ako ang iyong Super Parental Guardian! #FPJAPHinagpis Nakakaiyak! Ang galing ni Awra! #FPJAPHinagpis Waaaaahhhhhh!! 2 days na lang showing na ang #TheSuperParentalGuardians . Im so excited and i just cant hide it! Salamat sa Madlang People na dumagsa at nag-abang sa amin sa Trinoma at SM the Block! Ang saya! #TheSuperParentalGuardiansNov30 On our way to SM THE BLOCK. #TheSuperParentalGuardians Eyeeennn!!! Nasan na ba yung tseke??!!!  #BoybandPH4thLive  https://t.co/DspViw4KPU Kitakits mamaya sa Fishermall pagkatapos ng Showtime. #TheSuperParentalGuardians Natouch ako sa effort ni Mccoy at Zeus na samahan akong maglibot sa Cubao to promote #TheSuperParentalGuardians !!! Sobra kong naappreciate. On our way! @iamzeuscollins @hashtag_mccoydl  #TheSuperParentalGuardians Touring Shopwise, Farmers Mall and Market and Bancheto in Araneta Center in a bit with Mccoy and Zeus. See u! #TheSuperParentalGuardians Going live on Umagang Kay Ganda in a bit. https://t.co/RHmPlEDIQJ THE SUPER PARENTAL GUARDIANS Full Trailer. May U-Belt Tour ang The Super Parental Guardians bukas ng hapon. Kitakits!!! Kapagod! Nahaggard ang pores ko! Kaya rest na me for the survival of my beauty! Vavooo! Nyt! #TheSuperParentalGuardiansNOV30 Thanks so much to Transcom for welcoming us to your office!!!! Merry Christmas to all of you! #TSPGCallCenterTour Mas maaga at mas mahaba nating ipagdiwang ang Pasko ngayong taon. Simulan na natin sa Nov 30 sa mga sinehan. #TheSuperParentalGuardians THE SUPER PARENTAL GUARDIANS showing on Nov. 30. https://t.co/RHmPlEm7Zb So happy for the overhelming positive feedback our movie SUPER PARENTAL GUARDIANS has been getting. Maraming salamat po!!!! So happy for the overhelming positive feedback our movie SUPER PARENTAL GUARDIANS has been getting. Maraming salamat po!!!! https://t.co/RHmPlEDIQJ maraming salamat sa lahat ng nagview, naglike at nagshare ng trailer ng Super Parental Guardians!!! Showing Nov 30. This is so sweet! Thanks pretty @BarrettoJulia !!!! Support din ako sa VKJ after ng movie ko. ❤️❤️❤️ https://t.co/H1v1o7AYkO \"The Super Parental Guardians\" Official Trailer is out! WATCH HERE: https://t.co/0VR8ecWCIm #TheSuperParentalGuardiansNOV30 #TheSuperParentalGuardiansNOV30 na!!! Ngayong taon mas maaga ang Pasko. Regalo namin ito sa mga bata at sa Pamilyang Pilipino. Watch out for my special announcement in Showtime today. #ShowtimeTwoOneTuwa E kamusta yung bandang tulog dun sa likod ko? #GGVDivaAngGanda No.1 Trending Topic #TheSuperParentalGuardians https://t.co/yST0C8wO0m Pambata at pang Pamilyang Pilipino. #TheSuperParentalGuardians #TheSuperParentalGuardians VERY SOON!!!!! \"The Super Parental Guardians\" Official Trailer is out! WATCH HERE: https://t.co/0VR8ecWCIm #SPG \"The Super Parental Guardians\" Official Trailer is out! WATCH HERE: https://t.co/0VR8ecWCIm Hindi pwedeng hindi ko kayo pasasayahin sa Kapaskuhan.Taon taon may regalo akong pampasaya sa mga bata at sa pamilyang Pilipino. Panata yan! Pinalabas pala ang Girl Boy Bakla Tomboy kanina. One of my favorites! Abangan nyo yung bago ko na sobrang pang goodvibes! #SPG NU enyung enyu na ang trophy!!! Ang galing bwisiiiiit!!! #UAAPCDC79 Impernezzz sa mga cheerdancers ibang level ang passion. Dedmang mahulog at masaktan. Go pa rin! Winner kayong lahat! 👏👏👏 👏👏#UAAPCDC79 Sosyal ang UE mukhang sponsored ng Argentina Corned Beef ang prod. #UAAPCDC79 Ung performance ng Adamson parang pagkatao ko......malinis! Chozzzz! #UAAPCDC79 May paBroadway naman pala ang FEU. Kala ko nung simula sasayaw sila sa tugtog na Order Taker ng Parokya ni Edgar. #UAAPCDC79 Now watching UAAP Cheerdance Competition. Parang nanlalambot ang mga tuhod ng Ateneo. Puyat yata sa rally. #UAAPCDC79 Salamat sa mga tweets nyo. Nata-touch ako. Salamat po! At mahal na mahal ko kayo. GGV taping in a bit. Excited to interview Ms. International Kylie Verzosa. Dahil ba sa weather kaya excited ka manuod ng Aegis concert? https://t.co/yeHP3t8pLf Hahahhaa nasapul ka ba boy?! https://t.co/U9wsc4Khek Cuddle Weather - isang discreet na paraan para sabihing malamig at nangangati ka. Lol Aside from the fun and laughter this episode aims to inspire. Its never baduy or corny to have a good relationship with your parents. Love is so beautiful. Pang forever man o sandali lang. #GGVIsangTawaTayo Waaaaahhhhhh!!! That molmol topic was epic! #GGVIsangTawaTayo Bwahahahhahah!!! Aiko is sooooo funny!!! Baliw mom! #GGVIsangTawaTayo Yung sa gitna ng harutan nakuha mo pang humugot. #GGVIsangTawaTayo Andrei is super pogi! #GGVIsangTawaTayo"}