{"tweets": "@LeslyMiranda05 Hermosa💗 @CrissZar Justo pensaba en eso mientras proclamaba mis antojos. 🤤 Me emociona la comida navideña que está por venir 😬😛. @Telcel @SChecoPerez ❤️ @YuyaArgentina Yo a ti más, lo sabes 🤷🏽‍♀️ RT @ONUMujeres: El mundo está cambiando con rapidez. \n\nLas familias también están cambiando, al igual que el papel que desempeñan las mujer… @cely_as @arturoelias 🐒 Siii! ¡Cómo se puede apreciar en la ultra happy face esta mañana y me lo disfrute muchísimo! Hoy andaba gozosa en #DeLaPistaALaCancha \n¿Listos para la #GPMX 😙 como yo?  🏎💨#AMáximaVelocidad https://t.co/RTbt7OScrq @paugutierrezros Jajajaja es verdad 🙂😂 Como me sé 3 palabritas en coreano (saludar, agradecer y despedirme) mi máxima alegría es encontrar gente coreana, sacarlas con ellos y luego retirarme lentamente porque nada de lo que les habré dicho tuvo sentido. @_AlyVenegas ¡Mi Aly cumpleañera, gracias por ser parte tan especial de mi vida 💗 celebro tu vuelta al sol chiquita, te quiero besuquear la carita linda! 🎂 @pauuuuuuum 😱💗😊 🐒 https://t.co/t4rN8eOaac @Eczong Me urge ver mi video 😊, qué bueno que te ayudo! @VivaniMJ 😍💗🙏🏾 Tiempos en los que no se habla, se prefiere escribir indirectas via redes sociales 😬. @_AlyVenegas Eso mismo. 🙁 No hay que ser masoquistas oigann. ¡Me siento contenta y quería compartirlo con ustedes 🙂✨, por fin esta lista! https://t.co/tSOOlNZ4ew Venimos a ser felices ☀️ Soñé. @AndrreaCst 👏🏿 Se olvidó de decir, GRACIAS. Oye, hay que olvidarnos un poco del teléfono. ✨ @elcaloncho 😭 Soy mala para dormir cuando tengo que dormir. 😶 @andymurguiaa 😂 sicierto Tengo muchas ganas de la vida 🌈. @AlbertoVill https://t.co/d6IVtaagX6 Pensamientos fugaces. ¿Qué tan buena idea es vivir en CDMX? @bgorritz Somos ☝️ @robertoparrick 😂 @NormaaG12 ❤️❤️❤️💗✨😱 RT @RobertoAvilaL: Hoy hace un año Mariand (@yuyacst) estaba viviendo una de las cosas que jamas se imaginó en su vida, recordar me llena d… RT @_monttsg: YA UN AÑO DE LA ESTRELLA #83 🌟\n\n#AniversarioEstrellaDeYuya https://t.co/PnfCIpkjpb Soy la peor copiloto de todo el mundo y no me enorgullece en lo absoluto. @AdriElyBlack 🤤 @laauramirandaaa Estoy babeando mal 🐟 #QuesHambre Ponle fin a tanto drama. 💗 @Ulissesjaair Eres muy especial en mi vida Ulisses, deseo de todo corazón que seas muy feliz y que comas pastel delicioso. 🌈✨🎂 Esto que estas sintiendo hoy, no va a volver. GÓZATELO @oyetristan Jajajajajaja Ya quiero que sea navidad y que te me regales. Esta mañana se siente bien. @AleAguiilarG WOOOOOOOOOOOW Ale 😱💗 Los perritos son vida. @mariannd_ 🤤💗🔥 RT @IamSiddhartha: Amigos! Les comparto \"La Ciudad\" un tema en colaboración con @zoetheband  y que da inicio a la segunda temporada de #Mem… @GreeciaaDavilaa Para ustedes todo el apapacho de mi parte por siempre estar 💗 Abrázame todo el cuerpo con el tuyo. @GermanGarmendia 😱🙋🏾‍♀️ @ferarvizuvel Jajajajajajaja 🤟🏿 No te querías perder de nada y te perdiste de todo. @alrop22 Jajajajajaja si acepto. Oigan, estoy bien ehhh jajaja no es como pa’ la lástima. Solo me da risa que me pasaran tantísimas cosas en tan poco tiempo 😂. RT @mel_vm_: @yuyacst Siempre quejumbrosa, nunca inquejumbrosa Bueno ya, se siente muy bien quejarse tantito 🤟🏿😬. ⭐️Desgracia 6: no era ansiedad, no era deshidratación como en 🇺🇸 me dijeron, hoy ya aquí en mi país, me diagrnosticaron una infección en los riñones, que avanzo hasta ahí  por no haberse tratado como debía de ser. ⭐️Desgracia 5: me descubren una carie culei, hoy me hicieron endodoncia y ahora no se porque me duele tanto si antes ni enterada del dolor  💃🏿. ⭐️Desgracia 4:ya de vuelta en México decido comprarme algo en la tienda para hidratarme. Me tiro al suelo, abro bolsa, saco dinero, él de la caja decide hermosamente regalarme la bebida,le agradezco, me voy gozosa y me doy cuenta que extravié mi cartera con todas mis cositas😭💳. ⭐️Desgracia 3: un día antes de mi vuelta a México me percaté de que en el viaje había extraviado mi pasaporte, documento necesario para volver a mi país. 💀 (No les cuento el wate de los trámites en el consulado porque hasta quejarme me da webs) ⭐️Desgracia 2: los días siguientes del viaje me seguí sintiendo realmente de la 💩, entonces ya pensaba estar ultra deshidratada y llegamos a la conclusión  que por primera vez estaba teniendo ataques de ansiedad. ⭐️Desgracia1:Salí muy 🤗del país hacia 🇺🇸,a disfrutar la vida y de pronto me empecé a sentir de la💩(Le di muy poco valor a cómo me sentía y pensé que era mi mente)más tarde fui al hospital sin que fuera mi voluntad, me cobraron lo de un órgano y el diagnóstico fue,deshidratación Ahí les va mi lloriquera virtual de... Mi TOP 5 de desgracias que me pasaron en una sola semana.  🥁 🕺🏿💃🏿 @Sergecast 😭 mi carterita. Amigos no me gusta lloriquear  pero tengo muchas ganas de hacerlo, nomás por eso de que  luego le hace bien al ser tirarse un poco al suelo 😬. Una pregunta para la gente despistada 🧐 ¿A ustedes no les da pena decirle a los demas cuando de nuevo extraviaron algo?  🤷🏽‍♀️ A MI UN SHINGO. Pura desgracia tonta conmigo últimamente 🕺🏿, el miércoles perdí mi cartera en el 7 eleven del aeropuerto en cdmx, pegadititito a la puerta 8 de la terminal 1 💔 ¿ nadie? ¿no? 🙄¿naaaaadie? 😭😖 Me emociona mucho la vida que está por venir. Nos vamos difuminando. @dianagpedraza Jaajaaajaa! Hay cosas que nunca cambian. RT @RosyMcMichael: Los iluminadores líquidos de @yuyacst salieron en Liverpool esta semana y @diegosarinana los compró y me los mandó! Lleg… Hoy una de mis mejores amigas corrió un maratón y me dieron ganas ridículas de llorar de felicidad por ella 😭❤️. @g_msnn Si quiero Michi 👯‍♀️💗 No se vale ser tan cruel. No tiene explicación. @YuyaArgentina Y yo a ti 💗🙂 RT @ElJuanpaZurita: El Amazonas se ESTÁ QUEMANDO. Y lleva más de dos semanas incinerándose. Los medios locales y el gobierno no han dicho n… Estar viva y sentirme viva. @cIoudbep Si ❤️ Ush, quisiera ir a Corea. :( @valentinaspg 😂❤️ @cherrychriss X2 🥳,🥳. No me gustan las promesas. RT @YouTubeMexico: ⏰📼 Reviviendo los clásicos de #YouTube @yuyacst recreó un video muy especial ¡nos encanta! https://t.co/Xnjw1TjDPj https… @ferchiizrs MUY. @icamijerez 🤤❤️ A veces me doy chance de imaginarnos. See you pronto. RT @vale_craft_: Sentí súper bonito al ver este video de Yuya, me encantó 💞\n\n@yuyacst\n\nhttps://t.co/4iNYyGVTeQ @ChumelTorres Jajajaja Chumisss chócalas ✋ @cIoudbep @EdwinASegovia EXACTAMENTE ❤️. @EdwinASegovia Pues que algunos solo aman por ratos y que yo no sé cómo hacer eso 🤷🏽‍♀️ ¡Laaa próxima semana tenemos lanzamiento de BAILAANDOOO JUNTOS y no es por nada pero esta 🤤🤤🤤🕺🏿💗🙌🏽! Duh. Hola :) Se solicita persona ultra simple para ver videos absurdamente tontos en la madrugada y atacarse de risa sin control 🤚 JAJAJAJA ❤️ Pedrito. https://t.co/0byH9RAQuk @melissaLRC Jajajajaja chocalasssss 🤚 @ilsemtz22 Te vuelves a encontrar ❤️. No te pierdas a ti por ganar a alguien más. 🌚 https://t.co/9pJvpgGLAL RT @CourtoisKeila: @yuyacst Para que te digan “nadie te ve” Confirmen si sus mamás también les abren las puertas de los probadores sin respeto alguno 🧐 @yarelynajera 🙏🏾💗 ¿Cuántos días nos faltarán? RT @YouTubeMexico: Entre amigas no decimos TODO hasta los secretos más secretos 🤭🤫 ¿Verdad @yuyacst?  https://t.co/4X6o2w1NcF https://t.co/… @YamileConde1 JAJAJAJJAJAJAJAJA @cIoudbep La tuya. Me tienes. No siempre las madrugadas dejan dormir. @mpfr89 HERMOSA. Y bailar y bailar Todo pasa. Todo pasa muy rápido. @screeamingg @bailandojuntos2 😂❤️ @NormaaG12 Oye solo quería recordarte lo especial que eres en mi vida y lo agradecida que soy porque estés 💜💗💫 feliz feliz cumpleañitos tantito pasadito. Norms mi Norms 🎂 @NormaaG12 Oye solo quería recordarte lo especial que eres en mi vida y lo agradecida que soy porque estés 💜💗💫 feliz feliz cumpleañitos tantito pasadito. Norms mi Norms RT @RobertoAvilaL: @yuyacst No me pude resistir a comprar esta joyita, ando bien volado jajajaj 💓 te la rifas cañoooon! https://t.co/hWsEjc… Te quiero mucho más de lo que te cuento. @aleex_saints 😭💜 ¡Gracias por enviarme la foto Alex! RT @aleex_saints: @yuyacst Mira lo que me encontré hoy 💖 que felicidad! ✨ https://t.co/9VdBdlN7Wn @VickieMonteiith 💗 Sigues aquí. Desperté con antojo de navidad 🙂. Lo único que falta es un poco de tiempo. @RobertoAvilaL 😭 siiiicierto @Ssstq Jajajajaja @BrandonMorales_ Keozoooooo jaja🌚 Una casa sin ti es una oficina. Siempre que ponen las mañanitas en un restaurante me pongo muy nerviosa 🤷🏽‍♀️. @giovannaswag 😱💗 RT @mar_arellano_: gracias @yuyacst por los nuevos fondos💕 https://t.co/LAwRhSMuPi @RobertoAvilaL ¡Feliz feliz cumpleaños a uno de mis favoritos 💗🌻 gracias por ser incondicional, cuánto festejo tu vida! @Andvillarreal6 😂💗 Sigo siendo feliz con el Huawei P30 Pro que me prestaron 🔮💘, lo estoy aprovechando todo lo que puedo y realmente qué fotos y videos tan fregones toma🙌🏽 pd: además siempre combina con todo 🙂 https://t.co/RvzKWOMZo2 https://t.co/KwOiCeXkG8 @DannyOviedo19 Te amo Me da nervios twitter. Ofertas calientitas 🧐. Hermosa la vida cuando la sabes vivir. @CiloheG Yo a ti Yo también me uno feliz a reescribir México de la A a la Z con Huawei. Mi letra es I porque Mexico está lleno de gente apasionada que INSPIRA, que aporta y que hace que el camino brille más.\n#ReescribeMéxico \n\nhttps://t.co/RvzKWOvowu https://t.co/VYFrPUCObs @gabbypnx Yo soy tu mamá 😬 Olvidando contraseñas toda la vida 🙋🏽‍♀️ 😭💓🙌🏽 @marcelaamq 😂 ¿Qué tan dramática soy si tengo pesadillas de amor y toda la mañana se me queda la sensación de corazón roto? RT @caarolinagarcya: #NuevaFotoDePerfil https://t.co/wCWbLvrEcI Teletransportarme a una playa junto a ti. ¿Cómo va todo por ahí? @vamilandt ¡Weooooonaaaaa viva tu vidaaaaaa, po jajajaja ❤️ gracias por estar siempre! @_AlyVenegas Jajajajaja perameeeee Alyyy no me das tiempo de nada 🤷🏽‍♀️💓😂 Ayer escuché una canción hermosa y me dieron muchas ganas de compartirla con ustedes, 🖤✨ guárdenla, cierren esos ojitos y escúchenla: https://t.co/DFuFjNGJld Les voy a compartir algo hermoso nomás porque los quiero mucho 🙂... RT @RobertoAvilaL: Que afortunado de pasar otro cumpleaños tuyo para celebrarte como lo mereces, FELICES 26 🎈 que la vida y Dios te bendiga… @DiegoAlvvv Disfrútala 😍❤️ GRACIAS, gracias, gracias. ❤️ Detox forzado de redes sociales ✌🏿. Cáiganle a platicar tantito en vivo por Instagram, LOS EXTRAÑO 😍❤️. Vuelve. @blondiealexa Envidio tu plan rico. @_AlyVenegas X2 😛 Ven, vamos a bailar a nuestra manera. Enamorarme de ti ha sido lo más sencillo que he hecho. ¡Felices 2 años ✨💗⭐️ 🌵 @Cactuyers las amo y siempre vamos a estar juntas, gracias por apoyarme y quererme tanto 💕! Jeeeee jeeee 😬. https://t.co/OV4mqTynhE Estar contigo siempre es buena idea. Ajuuuuuaaaaa 🥁🔥💕¡NUEVO VIDEO! 😭🙌🏽😬 Esta es la VERDAD de mi experiencia en la TV KOREANA 😰: https://t.co/xbijKd10cK https://t.co/hdt00b4wRm RT @nadamassofia: ¿Es el rimel de @yuyacst el mejor producto de 2018? La respuesta es SÍ. @YuyaArgentina ¡JUNTAS, juntas! Una foto que me tomaron para una revista en Korea, no entendía nada pero ahí estaba... muy sentadita pasando la vida de la mejor manera que podía. https://t.co/w19Nr4gJIQ A mi me encanta la desvelada. RT @OdetteContrera: La emoción de @yuyacst al conocer la nieve me hace querer vivir y sentir la vida al máximo ❄️🌈😭✋🏻💕 https://t.co/NCIKSQE… Je, je... aparecí 😬🤓 ¿Cómo estas? Las cosas que te hubiera dicho. @_AlyVenegas Jamás olvidaría el cumpleaños de mi Aly bebé, espero sientas todo lo que te quiero y lo agradecida que estoy por todo tu amor ✨💫⭐️🌈🍕🎂 te mando 10 apapachos cumpleañeros! @cloudbep Mi chiquita llena de luz te mando un abrazo que dure todo el día de tu cumpleaños ❤️💫👆🏽😍 te adoro y deseo mucha paz en tu vida 🎂 ✨#Juntas amoooooooo RT @adanjodorowsky: Ser \"honesto\" y decir todo lo que piensas es una forma de egoísmo ya que la sensibilidad del otro no te preocupa. De he… Hola 👋🏿 ¡Corazón enloquecido y MUY MUY agradecido! ⭐️✨💖 Aquí está nuestra estrella por fin ⭐️ ¡MÉXICO EN LAS VEGAS! https://t.co/VIjEV1TacN Twitter me pone de buenas 😭😍 RT @JuanBertheau: 😱😱😱😱😱 muchas felicidades @yuyacst poniendo en alto a 🇲🇽 https://t.co/rWE5FlDVBp RT @Sergecast: Neta que estoy muy feliz y orgulloso de tenerte como hermanita @yuyacst , no puedo creer esto. Me quedo sin palabras. https:… RT @vanguardiamx: Recibirá @yuyacst su estrella en el Paseo de la Fama. 🌟😯 Chécala aquí 👉https://t.co/wOJvJu4ey6 https://t.co/0aoY1Wts8z RT @ExaFM: Ya estamos con @GILBArrera y la mejor información de los espectáculos. 🙌\nHoy nos habla de la estrella que tendrá @yuyacst en el… ¡Chiquitooooos! 🙊🤩 Acabo de subir un NUEVO VIDEO..... ¿QUÉ ES LO QUE MÁS USO DE TOOODO MI CLOSET Y CÓMO LO COMBINO? 👀✨ ¿YA LO VISTE? 😱 Si no, da click aquí 👉 https://t.co/1SrdebC8ku https://t.co/9v6BIZrsoG @AlvaroCueva ¡Álvaro te mando un abrazo muy muy muy grande, gracias por apoyarme! ✨💖 RT @AlvaroCueva: 💅​ https://t.co/RQ0CuGMuMp @YuyaCST está haciendo historia #SurtidoRico https://t.co/3vDDNTuL9S RT @EDesinformanteN: .@yuyacst es una de las youtubers más populares del mundo y es orgullosamente mexicana. ¡Te contamos más sobre ella! h… Twitter para mí es una explosión de emociones 🤧tengan, les mando flores por tanto amor que le mandan a mi ser 🌹🌹🌹🌹🌹. RT @RobertoAvilaL: Me pusiste muy nervioso con todo lo que me decías 😭 te amoooooooo te amooo y te amo @yuyacst https://t.co/wBGN1qCFUL RT @Cactuyers: ¡Nuestra chiquita!Estamos muy felices de este nuevo logro, orgullosas de que cada día somos más en esta bella familia❣️desea… Ustedes son los más de los MÁS ❤️😍🤤. @Ulisses_jair Ayyyy nooo 😣😖😍😍😍😍 amoooooo! RT @RobertoAvilaL: Me dice “Ponte aca que este es mi lado” VEANNNN QUE HERMOSA ESSS 😍😍😍😍😍 yo sin dormir y con ojeras a mas no poder pero no… RT @cely_as: A las @Cactuyers les avisaba cada paso que daba, literal. Hubo un momento en que no escribí por 5 minutos y creyeron que ya ha… RT @cely_as: Descripción gráfica de todo el rato que estuvimos juntas, nos la pasamos riendo pero yo más porque ella estaba nerviosa de esc… @GarciaVivi7 Te amo. Ojalá pronto te vea... No me olvido ni un segundo de ustedes, por eso siempre intento compensarlos con un chorro de historias (para estar más cerquita) gracias por apapacharme también tanto por acá 🙇🏽‍♀️✨😍 :( Siento feo no meterme tanto a twitter, pero  con tantas cosas de pronto siento que 🤯 por otro lado cada que me meto veo un chorro de mensajes lindos en donde dicen que me extrañan por acá 🤧 RT @LiliMurillo20: Este fin de semana fui a buscar el rimel de @yuyacst me informaron que está agotado, al lado de mi había otra chica, me… @LiliMurillo20 Hoy lanzamos nuestra tienda online chiquita, y estamos listas con muchas máscaras de pestañas! 😊💖 Te amo. ¡NUEVO VÍDEO!😱 💕  ¡TOOOODA LA VERDAD sobre mis nuevos productos! 🤭⭐ ¡TIENES QUE VERLO! 👀👉 https://t.co/kdtsARDhTp https://t.co/pmefunsAXV RT @Sergecast: Mi hermanable @yuyacst me invito a grabar un video con ella, recordé viejos, hermosos tiempos y me la pasa increíble.\n\nhttps… ¡¡NUEVO VIDEO CON MI HERMANABLE😍!! Por fin JUNTOOOOSS🙊 DECIMOS TODA, TODA LA VERDAD 🤦🏽‍♀🙋🏽‍♂ NERVIOOOOSSS 👉🏼https://t.co/JCyFrTlMd4 https://t.co/MXy0Hsq6rB Las guapuras lindas 🙊. ¿Qué tal su fin ? ¡¡NUEVO VIDEO!!❤ Chiquitos, puse nuestro nuevo shampoo a prueba de la manera MÁS EXTREMA 🙈😨 ¿quieren ver qué pasó? 🤔 Entra aquí 👉🏼 https://t.co/7btDGuE33W https://t.co/uz8sgvhnJQ En la noche 🤯 de tantas ideas 💡. @Monttse5 ¿No te duele el corazón por ser tan linda? Hellooooo vida 🙇🏽‍♀️🌹 https://t.co/f0ZqzQWGdr @YuyaArgentina ¡Mi bebecita chiquita hermosa cuánto te amo, eres en verdad muy importante en mi vida ⭐️🌈✨💖 FELIZ CUMPLEAÑOS, 🎁🎈🎂🎉 gracias por ser mi cómplice desde hace años! @NormaaG12 Tú vida me tiene el corazón así ❤️, festejo tu cumpleaños a la distancia ✨🌈 quiero cantarte las mañanitas muchos años más!!!!!! FELIZ CUMPLEAÑOS 💜 Descansa ✨⭐️. ¡NUEVO VIDEO!😍✨ ¡Por fin! 🙊Les enseño todo lo que pasó en la SESIÓN DE FOTOS CON GUAPURAS!📸💕 ¡Ellos fueron los elegidos! 💜Entra aquí para verlo 👉🏼 https://t.co/T5RZ0LPWgU https://t.co/E4g5AIukxX ¡VIIIIIIDEOOOOOOO NUEVOOOOOOOOOO 🤠💜🌈🙇🏻‍♀️✨⭐️! RT @RosyMcMichael: El rimel de @Yuya no promete nada en el empaque. Contrario a otras mascaras que prometen volumen, alargar, y usan muchas… Soy la típica tía a la que siempre le lastiman los zapatos. RT @Nallelyglezleon: Qué cosa tan más bonita 😍 @yuyacst https://t.co/JO7BRUunhV ¡Este fin de semanita video nuevo y salen......  💁‍♀️💁‍♀️💁‍♀️💁‍♀️💁‍♀️💁‍♂️💁‍♂️ 💖 no saben lo que extrañaba grabar! RT @marisolgala_: Los esmaltes de uña de @yuyacst son arte❤ https://t.co/SJ8wkVkjli ¡Sé valiente! 💪🏽 @Soynaipop Te mando un abrazo! ❤️ ¡Regrese muy motivada para disfrutar y agradecerle mucho más a la vida, les mando la mejor energía para su día! 🌈💖 ¡Ustedes pueden con todo! ¡Buenos días guapuuuuuurasssss!  🌈✨💓 Estoy feliz hoy vuelvo a mi cuidad chiquita 💖🏡. ¿Qué tan floja soy si prefiero dormirme enroscada que quitar el desorden de la cama 🧐? @AmorcitosTeam 🤭 me gusta esa propuesta. @RobertoAvilaL Jajajaja Robert el que sale precioso en todas sus fotos 🧐 @nanshaaa Yo a ustedes más ❤️ ¡Oigan ya mañana regreso a mi casita, lo que quiere decir que la próxima semana HOLA YOUTUBE 👋🏿 extraño extraño mucho! Lo veo en tus ojos... Quiero saber hacer comida vegetariana deliciosa 🤞. La verdad siempre gana. ✌️ Holaaaaaaaaa 🙋🏽‍♀️ https://t.co/8oPaOvFy90 RT @_AlyVenegas: @yuyacst amarnos entre nosotras es lo mejor, disfrutar el éxito de la otra, hacerles saber lo hermosas y valiosas que son,… ¡A todas las mujeres que me siguen quiero decirles que son unas chingonas, créansela, ámense y respeten a las demás! Mujeres hermosas. @Alechavarriayb @javiercstg @SedalMexico ¡Alita hermosa, feliz cumpleaños chqihuta hermosa, te quiero muchísimo muchísimo muchísimo! 💖🌙🐰 @javiercstg @SedalMexico Mi chiquita hermosa 💖🤤✨ @FranciscodPaula @AliciaYeni Muchas gracias por tomarme en cuenta, es un honor 😍. @DMofficialLive Jajajajaja te amo. @ngelesNicols2  https://t.co/iZdjaUeYiq Ten cuidado de lo que deseas para los demás, todo, TODO, se regresa. Me gusta como eres. @blondiealexa Felicidades chiquita hermosa, festejo por ti desde aquí ❤️. @ceciliags27 Y yo como tú 🤤❤️ RT @RevistaEresMx: | @yuyacst y @JBALVIN son parte de la nueva historia de #RevistaEres con nuestra portada de colección. ¡Ya a la venta! C… Hasta mañana 💖😊 amo. @ferdebieber_ Ya preciosa, como nueva 😌☝🏽 🙃 Disfruta lo más que puedas, no te quedes callada/o cuando algo no te haga sentir en paz, aléjate de la gente tóxica e intenta vivir el presente de manera consiente para aportarle algo a los que te rodean. 🐚✨🌟💫 https://t.co/Z5RUDkLAlV @javiercstg Felicidades, mandas foto! 😍🙌🏽👏🏾 @RobertoAvilaL Y yo a ti ❤️. @Marla_Gasca13 @juanpablotrm Yo no soy el tipo de persona que disfrute de exponer sus problemas en redes sociales y mucho menos cuando es algo que realmente involucra todos aspectos de mi vida, así que lo que tenga que solucionar lo haré de manera personal, saludos ❤️. Pero actuar con la cabeza 🤯 no es lo ideal JAMÁS. Gracias por todo su apoyo siempre. Quiero contarles tantas cosas... No saber afrontar problemas es un GRAN problema. RT @Brenda_ReginaF: Sergio siendo dominado por Yuya - PARTE 2 😂 https://t.co/DY3XwWA9wK 😑 RT @Brenda_ReginaF: Pero que sexy bebé @yuyacst JAJAJAJAJA 😂💕 https://t.co/yxZiJFXaeW RT @LuzzaLocutora: @RosyMcMichael Probé la mascara de @yuyacst y hasta este momento del día es una chulada, que buen producto!! https://t.c… Juntos. @BetbiraiLuna ¡Salma no puede ser 😍❤️✨ estoy súper feliz por ti, que ganas de apapacharlos a los dos, felicidades! Palabra que estaré más intensa por acá, lo juro. @_AlyVenegas Ustedes son mis 😍 Les mando un chorro de besos y abrazos, no quiero que piensen que me olvido de ustedes porque últimamente no he andando tan activa 😊. Hola a todos 😌 ¿qué cuenta twitter? @nabileahumada @betopasillas @Botxrga Los extraño 💖 vámonos de nuevo a lanzarnos de las alturas con aqua shoes 😗 RT @IamSiddhartha: Estamos de estreno con el video #ElChico ¿Ya lo vieron? ¿No? Aquí se los dejo: https://t.co/BQQd9CbMng https://t.co/XLyF… @RobertoAvilaL ¡Mi día no va a terminar en paz si no te felicito chiquito hermoso, eres muy importante en mi vida! ⭐️💞🍕🎉🎈 ¡Festejo tu vida! (DIARIO) RT @KarenxBau: Me encantó el nuevo vídeo, sin duda estos son de mis favoritos siempre me siento más serca de ti. Amé lo hermosa que te ves… NUEVO VIDEOOOOOO!!😎📽 ME PASARON MUCHAS COSAS Y LO GRABÉ❤, ¡Nuevos amigos🙈! ¿Adivinan? Click aquí 👉🏼 https://t.co/96fkV95IVD https://t.co/4EgLklizW6 ¡Faltan minutitos ya para el NUEVO VIDEO 🕺🏽✨💞! ¡5 minutos más ! ¡Descansen 💞 son lo más de mi corazón! ¡Chiquis el video será todo suyo para mañana a las 12:00 en puntito, perdón por la demora, le metimos mil detallitos lindos! 🙋🏽‍♀️🐒⭐️💫 Estoy muy feliz de tenerlos junto a mi en vida, valoro todo su apoyo cada día. ¡😱 Me encanta esto 👏🏾 vean guapuras, así pueden se embajadores y conocer el mundo! 💞 Si gana uno de ustedes, me llevan en la maleta 😬🐒 #EmbajadorAeroméxico https://t.co/NuZbZKgPgU ¡Los extrañé por aquí también ⭐️✨! @_AlyVenegas Súper 😍 @lienatt Mmmmm viste el video? Hola 🐒 ¿PREGUNTAS INCÓMODAS? 😰💖🙌🌻 ¿Cómo hago para DEPILARME TODO el cuerpo? 😬🤞🏾🤭: https://t.co/qNTs1o6Dp2 ¡JAJAJAJAJA AMÉ GRABAR ESTE VIDEO! https://t.co/VtvvPpIkQH @caarolinagarcya ¡Mi bebécita hermosa te amo tantooooo! ✨🌈 ¡Tu vida realmente me hace feliz! @monsergro Jejejeje gracias chiquita ❤️ En el NUEVO VIDEO ✨ les cuento por fin cómo edito mis fotos en Instagram 📷🤫. ¡TODOS MIS SECRETOS te los revelo en este video🙊! Te enseño los ANTES Y DESPUÉS aquí 👉 https://t.co/bP1gzXVqIL https://t.co/LcXwOvg0gX @AndrreaCastillo ¡Jamás me olvidaría de tu cumpleaños chiquita hermosa, estoy muy feliz por tu vida! 🥁🎉🎈🐒✨🍰🍕 https://t.co/J72rpawzxo Raspar tacón. ¡¡TIENEN QUE VER ESTO!! Pasó algo muy muy ESPECIAL 🥁🙊💕 y se los comparto en el NUEVO VIDEO 🚀🌈 click aquí 👉🏼 https://t.co/YUdCl0jitU https://t.co/cE7i7CvWuz RT @Ale_winnie11: @yuyacst Vaca querida vamos a extrañarte! Nos veremos probablemente el próximo año! Un abrazo enorme y q seas muy feliz! 😝 ¡Y les juro que para el próximo video.... (no el de hoy) jajaja ya habrá intro, así que hoy despídanse de la vaca 🐄 🐮! ¡En 30 minutos videooooo nuevooooo ✨🌈💫🍾🥁🎉🎈! RT @RobertoAvilaL: Eres una de las personas que más me inspira a ser mejor, felicidades por este logro, estoy muuuuuuy orgulloso por ti, te… Me gusta estar contigo. @blondiealexa Jajajajaja te amo Subí un video NUEVO 😛⭐️✨ y ando volada y contenta porque los extrañaba muchísimo 🙋🏿‍♀️ les enseñe a hacer macetas de boobies 🥥🥥MIRA TODO POR AQUÍ:  https://t.co/Lc9dLZY9lf https://t.co/fEG0KHtG0f Hola, los amo muchísimo y les quería agradecer por siempre estar conmigo 🐒💞💖. @GreeciaaDavilaa ¡Grecia eres muy importante para mi chiquita 🐒💖 pasa un cumpleaños fregón, disfruta la vida! RT @Guapura_Forever: ¡NUEVO VÍDEO!\n¡Puse unas boobies en una maceta, tienes que ver! 😂🌵\nhttps://t.co/IHf5iuC10D - De: @yuyacst 💕 https://t.… ¡¡MIRA LAS BOOBIES QUE PUSE EN LA MACETA!! 🤭💖😱De verdad, guapuras, me encantaa esta idea😍, ¡TIENEN QUE VERLA ✨! Click aquí para ver el NUEVO VIDEO 💕👉🏼 https://t.co/Lc9dLZY9lf https://t.co/Ei7s13dIAk Te quiero despierto. No quiero que el tiempo pase tan rápido. Tus ojos hacen magia. @LupitaSaalas Yo te invito 🙋🏿‍♀️. No sé me ocurre nada más que amarte. RT @cely_as: La relación que las guapuras tenemos con @yuyacst es de otro nivel. Todo es amor, respeto y amistad cuando estamos unidos. 🙌🏼💓 @MariaVilla101 Jajajajaja te amo grax por ir a saludarme y por tomarme fotito pal insta ✨🐒💞 @marcelaamq ¡Cuánto te quiero chiquita preciosa! ✨💞 ¡Últimamente estoy más sensible que nunca y me hacía falta decirles que le hacen mucho bien a mi vida guapuras, gracias por tanto! Todo va estar bien. Quiero verte de nuevo. 🐒 @karlaceliss 🙇🏽‍♀️❤️ Para los que quieren abrazo también, les mando toda mi buena energía. ✨❤️ Quiero abrazo. @Saul_Munoz98 Jajajajajajajaja Quiero pizza y tacos. Bailar contigo. Ya para la casita 💫🌈✈️ foto con cuello chueco. 🐒 https://t.co/3mggR0DKeF Hoy fue un día muy lindo ✨, hasta mañana 💤😙😗. https://t.co/Z8GQuzd7on Ojalá yo logre disfrutar toda mi vida tanto como mi abuelo. Quédate aquí. RT @cely_as: Me encanta cuando @yuyacst nos comparte sus secretos para un maquillaje más lindo.\n\nNuevo video: https://t.co/OnUtKGam79 https… RT @KarenxBau: @yuyacst eres hermosa.😍\nMe encantó el nuevo vídeo.✨ https://t.co/HvE8hzYhBi ¡VÍDEO NUEVO! 🙆‍♀🌈 ¡¡Guapuraaas, muchos de ustedes me habían pedido este tutorial de maquillaje!!😍 ¡LES VA A ENCANTAR COMO QUEDA LA PIEL!👉 https://t.co/Sl1gw9OXAk https://t.co/795CWCmdIT Ya me voy a dormir precioooososs ✨🐒 hasta mañana 💤 @Paaulaam_ X2 Soy ese tipo de persona... No se que hago a esta hora viendo un video de un parto, llorando cual magdalena de la emoción. Siempre quiero masajito. RT @alecsbarrancos: El mejor labial del mundo mundial 🙌🏻❤️🔥💄💋 @yuyacst https://t.co/4NZskY8Fv9 RT @iamkarlalala: El rímel de @yuyacst esta súper bueno 👌🏻👌🏻👌🏻 ¡Hoy mi Karen bebé bonita cumple años! ✨🌈💗 ¡Quiero que seas feliz todos los días de tu vida! https://t.co/L6yat4FEaU @caarolinagarcya ¡Jajajajajaja te amoooo por qué pura XX tache jajajaa :( qué saddd! RT @Brenda_ReginaF: Palabras como la esta personita alivian el alma y Dios las puso en esta vida para dar felicidad al mundo 🗺♥️ @yuyacst h… @caarolinagarcya Mías para siempre. @cely_as Te amo bebésaura ❤️ Son lo más del mundo 😍. Es momento de regresar a redes ✌🏽 Haces sentir bien a cualquier persona. Un poco de calor para nuestras vidas. @paugutierrezros ¡Te amooooo tanto, feliz cumple a mi chiquita hermosa Pau! ✨🍦 #EnNuestraMenteEsVelaDePastel https://t.co/WOQnDTGQfc 🙂 Claridad... ¡¡ASÍ CUIDO MI PIEL EN CASA!! 😎💕¡Guapuras, tienen que ver el NUEVO VIDEO✨! Es una genialidad👌🏼 para tener la piel hermosa 👉 https://t.co/Nc7vueKsgU https://t.co/CFaqWSNJia ¡Manifiéstense! RT @YouTubeMexico: ¿Cuántos pares de zapatos tiene @yuyacst? No te pierdas este tour por su casa. https://t.co/LGynN8PpBv https://t.co/6UBt… Nunca faltan los que van a clases de salsa y sacan sus pasos cada que se puede JAJAJAJAJA. #AMOOOO Juan Gabriel todos los días nos hace falta. ¡Mi @ElJuanpaZurita  estoy muy feliz por tu vida 🍦🎉🎈 te admiro muchísimo y te quiero! RT @annett_olivas: niñas compren el rimel (mascara de pestañas) de @yuyacst es el mejooooor!!!! RT @RevistaEresMx: | @yuyacst recibió un reconocimiento de Las Vegas #WalkOfStars por su trayectoria. ¡Muchas felicidades! ❤ https://t.co/1… @Sergecast Gracias por estar hermanable, JUNTOS. ¡😱NO PUEDO CREER LO QUE ME REGALARON DE CUMPLEAÑOS 🎁🎉! Te comparto todo en el NUEVO VIDEO🤫❤! Entra aquí 👉 https://t.co/izLGAtAqLX https://t.co/yEXC37WVPk @Paugalindo ¡Te quiero mucho Pau ❤️ eres hermosa en todos los aspectos, gracias por apoyarme chiquita linda! RT @cely_as: No se como le hace @yuyacst para no tirarse al piso y llorar por todo lo bonito que le pasa, yo no me aguante las ganas.😭❤️\nQu… RT @bellatrixtx: @yuyacst Nos enorgulleces mucho, te mereces mucho por todo el amor y empeño que le dedicas a lo que haces. Eres una motiva… ¡Guapuras ❤, acabo de subir VIDEO NUEVO✨! ¡Les di un TOUR POR MI TODA MI CASA 🏠! ¡POR FIN LES ENSEÑO TODO! Entra aquí 👉 https://t.co/apNEWVZIBx https://t.co/eAwGXPdoQ7 Je je La doctora me acaba de recomendar de manera urgente unas vacaciones. Cuánto pesa el miedo a ser feliz. Tú eres mi casa. Fueron días lindos en Perú, ya estoy en el dulce hogar❤️✨ me dijeron por ahí que muy pronto iré a verlos a Ecuador y a El Salvador ✈️✨😱 https://t.co/T6UhEOB3zL ¡Ya estoy en la casita, gracias a la familia bonita de Perú, me hicieron sentir muy especial! Hola, soy intolerante a la lactosa y estoy tomando café con leche, jejejeje 🤟. RT @AlexXxStrecci: ¡Pequeña mujercita!\n\n¡Feliz Cumpleaños y un abrazo durísimo! \n\n🎉🎈 @yuyacst. RT @teresuch: Feliz cumpleaños @yuyacst , eres la más bonita y alegre de todo internet ❤️❤️❤️❤️❤️. RT @ElJuanpaZurita: Yuya! Feliz bello hermoso cumpleaños! Sigue inspirando, motivando y siendo una luz para muchas personitas. Espero la ha… RT @Wereverwero: @yuyacst feliz cumple Yuyita, te mando un abrazote 🤗 Me siento la más festejada y volada con tanto amor.  ✨ ¡Me hacen sentir una mujer muy especial! 💗 RT @nabileahumada: Feliz cumpleaños a la más hermosa de todo el interné @yuyacst te deseo lo más bonito del mundo siempre!!! Pásala increíb… RT @AbeVzqz: Felicidades @yuyacst !!!! Keep on being the coolest out there 😎 RT @angieevazquezzz: Feliz cumpleaños a la única e inigualable @yuyacst 👸🏻✨🎉!! RT @betopasillas: Eres tanto amor, tanta felicidad y tanta sabiduría. Te amo, te admiro y agradezco que seas parte de todos mis días. Graci… RT @gwabiR: Feliz cumpleaños @yuyacst bebe de amor 👏🏼✨👏🏼✨☝🏼✨ nosotros -&gt; 🐒🐒 comiendo pastel 🎂🍰🍩 😘 pásala bonito bonito RT @Sergecast: Hermanita @yuyacst feliz cumple, te amo con todo el corazón hermanable. RT @maire_wink: Feliz cumpleaños a la emperatriz máxima de El internet, mi reina del éxito y musa del Olimpo @yuyacst \n💖💖💖 RT @dannapaola: Feliz Feliz Cumpleaños a mi hermana perdida @yuyacst ❤️🎉🍍🌼🎉\nBonita deseo todas las sonrisas infinitas para ti. ☺️🎂 @dannapaola ❤️👯‍♀️ RT @SutzyWorld: Feliz cumpleaños @yuyacst que tengas un cumpleaños increíble 🙌🏻❤️🎉🎈🎂🎁 cartoon #SutzyWorld ✍🏻 #FelizCumpleYuya https://t.co/… ¡Ya me tengo que dormir porque mañana me sacan sangre muy temprano, en un rato sigo viendo todo ✨ son los más frreeeegones de este mundo! ¡En verdad quisiera abrazar a todos los que me están mandando mensajito, no puedo creer todo el amor que me dan, muchísimas gracias 😍🙌🏻✨! RT @onlytarii: FELIZ CUMPLEAÑOS YUYITA!!! \nHice esto para ti con mucho amor 💕 espero que te guste, te amo demasiado ❤ \n[ @yuyacst ] https:/… ¡GRACCCIIIIASSSS DIOS! ¡No puedo creer lo afortunada que soy de tenerlos a ustedes ✨ son los mejores del mundo! RT @joocarlors: @yuyacst 💌Los años pasan muy rápido 💫,Pero lo que pone muy feliz es que en todos estos años has crecido demasiado, con gent… RT @cely_as: #FelizCumpleYuya 🎉🎈no sabes lo mucho que te amo y lo feliz que soy por tenerte en mi vida otro año más. Deseo que seas muy fel… RT @NormaaG12: Mi Yuya hermosa hoy ya tienes 25 años!!!!!🎉❤\nFelicidades mi chiquita🎂🎁\nTe deseo todo el amor y felicidad en tu vida, sé siem… RT @YuyaArgentina: Feliz cumpleaños @yuyacst te sigo hace 5 años y nunca me decepcionaste ❤️ juntas a pesar de la distancia. Te amo Yuyita,… RT @blondiealexa: Por tratarnos como familia y por hacernos tan felices en tan solo segunditos. \n#FelizCumpleYuya 🌵🎊🎉✨🤟 @yuyacst https://t.… RT @KarenxBau: #FelizCumpleYuya\n@yuyacst ¡felices 25 años!, estoy tan feliz  de que estes cumpliendo un año más de vida, un año más llenand… RT @rainbowyuya: feliz cumpleaños a mi persona favorita, te amo demasiado @yuyacst enserio espero que pases hermoso este día porque te mere… RT @blondiealexa: Que nunca nos falte tu sonrisa cada 13 de marzo.\n ¡ #FelizCumpleYuya , cuarto año juntas💕✨! @yuyacst https://t.co/udRxDS9… Estoy nerviosa. Mis guapuras armaron un  # que es #SelfiesParaYuya en donde me cuentan un poquito de su día/vida ✨ ellos lo hicieron porque querían compartir conmigo 😭🙌🏻 así de corazón, sin que yo les dijera nada. #SOYAFORTUNADA Hoy me siento completa ✨. Mis amigos y mi familia se juntaron para cenar y comer pastelito conmigo por mi cumpleaños adelantado.  ✨🦄🎉🎀🍷🍰 (Ese día yo no podía porque tengo que trabajar) Hoy pasaron cosas muy lindas ❤️. ¡JAJAJAJAJAJAJAJAJAJA YAAA!  Oigan preciosossssss 🙋🏽‍♀️ nos vemos por mis historias en Instagram @yuyacst ✨ los voy a llevar conmigo hoy 😎❤️. RT @RobertoAvilaL: @yuyacst 2 días para tu cumpleaños 🎁 https://t.co/K7yux23viL Jajajajajajajaja  no les voy a decir cuál porque ni crean que es muy decente jajajajajajajajaja. 🙄 Cambiando de tema, me siento muy especial qué hay una canción que siempre me emociona escuchar y mis amigos llevan como 80 años cada que salen mandándomela de nota de voz extasiados porque la ponen en sus fiestitas 😍🕺🏼✨💃🏽... FIN. 🐢 Luego como que ese sueño se saltó a otro donde recordaba pendientes de trabajo que tenia y me desperté en friega loca estresada, ya no supe qué pasó con mi tortuga. Un día sacó su lengua de manera tan intensa que se le salió toda 😫 pero busque la manera de volverla a poner en su lugar y darle de comer, AMIGOS... NOS AMÁBAMOS. De tanto amor, la tortuga empezó a poder hablarme solo a mi.... y no es broma NOS AMÁBAMOS.... hasta le puse su casita a un lado de mi cama para estar pendiente de ella. Soñé que me regalaban una tortuga porque el dueño no la cuidaba, y yo me volvía inseparable con ella... Cómo nunca me acuerdo lo que sueño les voy a contar ya que para mi esto es un milagro... @hombresgnet @HombresG 🙋🏽‍♀️ ¡JALOOOOOO! Tú me haces sentir en paz. RT @bellatrixtx: @yuyacst En pocos días cumple la chiquita mas bonita Quiero verte feliz. Sólo tú eres dueña de ti ☝, de las decisiones que tomas, de lo que haces con tu vida, sin dar explicaciones a nadie, queriéndote mucho❤. Me quiero libre y te quiero libre a ti también ✨. https://t.co/nbyHwPVNJa Hay lugares hermosos fuera de nuestra comodidad. ¡Amo ser mujer y amo a las mujeres! RT @aleebautista_v: Me encantó el nuevo vídeo de @yuyacst  corran a verlo esta increíble 😍😍😍❤✨⚡\nhttps://t.co/vytq7mW8j3 https://t.co/oaV3Dl… RT @CentralJBalvin: Lindos! 😍\n\n@yuyacst via instagram stories. https://t.co/UBsKS5y8Q2 ¡Acabo de subir vídeo 💖! ¿ME MUDÉ ANTES DE CASARME 🙈? Te cuento todo sobre vivir sola 😳 ¡RESPONDO TUS PREGUNTAS 🤫✨!Entra aquí y descubre todo 👉 https://t.co/jk37KBxMoF https://t.co/VIRrl3lwFq RT @eizamusica: Amo a México y me dio mucho gusto escuchar a la gente como respeta y admiran nuestra cultura y nuestro talento, verdaderame… RT @blondiealexa: Nos pides fotos, te damos fotos 💕 Altar yuyesco!! #pijamadaconYuya  @yuyacst https://t.co/wKeBGuxSem RT @yuyacstTampico: Cuando tratas de ser seria pero eres Yuya y no se puede Jajajajaja ❤ #PijamadaConYuya @yuyacst https://t.co/gXNFrCbA8F ENNNNNN VIIIIIVOOOOO: https://t.co/OuUTeLnN5N Oigan qué desaparecidos 🙄... Quiero dormir más 😥... Saludar, saludar, saludar. ¡NUEVO VIDEO! 🙋🏽‍♀️ ¡HICE UN EXPERIMENTO POR 5 días en mi cabello y esto sucedió! 😳🤫😱 *LOS CAMBIOS SON SORPRENDENTES* https://t.co/e2hZoIOwTB Mis problemas personales intento jamás mezclarlos con mi trabajo en redes sociales. No sé, siento impotencia ya que es un proyecto en el cual los he hecho parte a todos ustedes. Pero bueno 😔... qué complicado encontrar gente con las mismas ganas y sobre todo, honesta. Ustedes saben que siempre comparto cosas positivas pero hoy no me siento tan bien... Quiero contarles tantas cosas 😔, he tenido días súper estresantes/complicados... me frustra ser tan entregada en mis proyectos y que la gente falle/ no cumpla 😖... 😕 @vamilandt Yooooo toda la vida ☝🏽 Yo cuando mando memes a grupos de mi WhatsApp.... 💔 https://t.co/JecaUnum7g ¡Chiquitos 💕! ¿NO SABES QUE MAQUILLAJE BÁSICO NECESITAS SI VAS EMPEZANDO? ¿Ya leyeron la NUEVA NOTA que acabo de subir a nuestra página 😍✨? ¡Estoy segurísima que les va a encantar 💃! Entra aquí para ver de qué se trata 👉 https://t.co/W19ZUBZmAZ https://t.co/hPQ42xdiQA RT @AlmaPlass: @yuyacst When, tu mamá te regaña por hablar de Kim JAJAJAJA https://t.co/uoApqofqTp ¡É C H AAAAAAA T E L OOOO! Estoy bien feliz por el nuevo video 💃🏽💃🏽💃🏽💃🏽  https://t.co/OfRUp22xS5 ¿FUNCIONA O NO MI LÍNEA DE MAQUILLAJE 😱? ¡Lo puse a prueba y esto sucedió 👀💄! Click aquí para ver el NUEVO VÍDEO 💕👉 https://t.co/OfRUp22xS5 https://t.co/wQI4kFZAFP RT @YuyaArgentina: La parte de la Kim Kardashan discutiendo con tu mamá @yuyacst sigo tentada 😂😂😂 https://t.co/1OmrnVuIxe Ya quiero que se suba el video de HOOOOY 😳😍... RT @CamilaBarretoF: \"si voy al antro y hay reggaeton yo perreo\"\n-@yuyacst https://t.co/mtbKw4o5uI @AbiertoTelcel @domithiem Holaaaaaaaaaa👋 Eso sí, nadie tan bonitos como ustedes 😎. ¿Qué le pasa a Victoria Beckham? ¡Es taaaaan bonita 😍❤️! No puedo dormir 😑 quiero dormir. Estoy viviendo con fobia a los temblores. ☹️ Me quedé dormida. Hola 🖤.   https://t.co/vqH4FwdexR https://t.co/ja6Vvx6PFU RT @MarianEspinoza_: Yo asi despues del en Vivo de @yuyacst Gracias por tantos consejos enserio!❤🌟 Te quiero tanto https://t.co/vSVIz5QBQ3 🤭 Gracias por ser mis amiguitos de en vivo, los amo. RT @blondiealexa: @yuyacst Wooola, aceptó la propuesta de la desintoxicación del viboreo intenso😬, solo por ti❣️. ☝🏽😰¡Si de pelis de suspenso se trata, llámenme a mi 🥁😱 subí una nota contándoles mi top de 6 PELÍCULAS DE SUSPENSO FAVORITAS! ✌🏼@ a un/a amigo/a 😏 con quien te gustaría ver alguna de ellas 🤭👉 https://t.co/vqH4FwdexR https://t.co/5V2aEyqnZz ¿En vivo por mi Instagram @yuyacst ?✨⭐️🥁☺️ Me pintaron el cabello de color —&gt;🖤 en un ratito les enseño por mi Instagram @yuyacst primero tenía el corazón así 💔 , ya luego me sentí súper tonta por preocuparme por eso, cabello es cabello ni 🐟. RT @daneta_gl: Jamás en mi vida imaginé que usaría maquillajes de la @yuyacst pero es que que chidos le quedaron, neta. ¡Qué importa! ¿Te acuerdas en los días que rezabas por las cosas que tienes hoy? ¡VIDEO NUEVO 😍✨! ¿Quieres conocer toda mi COLECCIÓN DE MAQUILLAJE 🙊💄? Entra aquí para ver el TOUR que les di 💕👉 https://t.co/z8Mn0T8CWv https://t.co/KXEqlGyRIl ¡EL VIDEO ESTA A NADA DE SUBIRSE! ✨🌈🙋🏽‍♀️ Tal vez. https://t.co/hGa58REwmI Hacer todo de corazón ❤️. Sin expectativas ✌🏼💫. RT @Brenda_ReginaF: Yucky jardinero ready JAJAJAJA te quiero @yuyacst https://t.co/X9yARwQuZL @YuyaArgentina Nuestra 👆🏽 @LuisWMT 😍❤️ MUJER INTENSA EN FB 🌈✌🏼🙂🙋🏽‍♀️: https://t.co/4O8mr5u5RH https://t.co/lGeWM7YpNC RT @yuyamybae: @yuyacst Soy fan #1 de la #PláticaDeNiñas 💗✨ ¡me encanto! Contigo yo me perdería. ¿Cuántas personas se tienen que ir para saber decir adiós? ¿De qué quieren notas en  🧠https://t.co/mDXboGnatC ⭐️? Me voy a poner a escribir justo ahora 🖊 pero quiero saber sobre que es lo que les gusta leer más 👀🙂... A ti te amo. ¡Amigos preciosos chiquitos con caras divinas pásenme tags chidongos hace mucho no hago uno y quiero platicar 🙋🏽‍♀️✨! Dame de tu vida. Oigan el \"joven\" tiene nombre pero es muy moderno obviamente y me da oso que me siga y vea que estaba hablando de él... bueno, se llama Fabian y es lo más más más del mundo 👋. Amigos me dan risa cosas muy tontas jajajajajajaja ya ni modo así nací. Y Fide le dice... si pero se le secan todos 🙍🏽‍♀️ (voz triste)..... escucho un silencio y luego risas...... JAJAJAJAJA Ayer compré cactus/plantas y hoy el joven me ayudo a subirlos (cabe mencionar que vivo en el depa de hasta arriba) toca la puerta abre Fide le entrega mis plantas... y él le dice a ella 😊 a Yuya le encantan los cactus verdad?.... Jajaajajajaja amigos acabo de escuchar la conversación del joven que trabaja en los depas en los que vivo y la Fide la señora que me ayuda a que el depa esté en orden... Desenrédame. En Instagram siempre estoy y soy @yuyacst ✨🍓 https://t.co/1WGFyP7iKq No lo voy a negar, la primera vez que te vi fue una sensación muy distinta a las demás... RT @aldanaway: El mensaje de las letritas de amor jajajajaja me sigo riendo lo amé @yuyacst ⭐️ ¡NUEVO VÍDEO! 😰 FUERA DE BROMA ESTO TODOS LO DEBERÍAMOS DE SABER🙈😱  Click aquí para ver de qué se trata👉 https://t.co/Jdx4yU9pTl https://t.co/wq98Zx0BAe @YuyaArgentina Te amo estás cañona lo apoyadora chiquita preciosa ❤️. ¿Ya estoy lista para este día 💪✨ y tú? Todo mejor. ✌️ RT @cely_as: La #PijamadaconYuya me dejo tan feliz y con una vibra súper positiva 😍 gracias @yuyacst 💕✨ @blondiealexa @Cactuyers 😍 RT @NicolleBeni: Esta es de las mejores noches de mi vida @yuyacst gracias por eso! Te amo tanto que nunca te cambiaría por nada ♥️ RT @Brenda_ReginaF: #PijamadaConYuya Siendo feliz cuando tú lo eres. Gozando del baile con mi hermana @silvanalif . Te amamos @yuyacst 💗 ht… RT @vamilandt: #PijamadaconYuya bailando con mi guaguis @yuyacst como te amo, te agradezco por siempre darnos los mejores consejos y por si… Ustedes son mi familia. RT @nurseandmakeup: #pijamadaconyuya  mi outfit de fiesta con mi pijama incluida ♡  @yuyacst besos desde chile https://t.co/4PjmEh1IC0 RT @NormaaG12: En pijamada cool, con música cool, con mi persona favorita, disfrutando de la vida❤ @yuyacst \n#PijamadaConYuya 🎉🎉👀 https://t… RT @BrankaSorich: Lo mejor son tus bailes JAJAJSJ #pijamadaconyuya @yuyacst https://t.co/jLhWAR47Fi RT @NicolleBeni: Es de mis en vivos favoritos, gracias por tanto @yuyacst ♥️ #PijamadaconYuya RT @AndrreaCastillo: Mi nuevo recordatorio de vida va a ser \"ESTOY VIVA\" cada que ande tristona ahr @yuyacst  #PijamadaconYuya EN VIVO 🤷🏽‍♀️ ¿Por qué se me está cayendo la piel? 😖  Y TE CONTARÉ LO QUE HAGO TODAS LAS NOCHES QUE CAMBIO MI VIDA 😱✨🙋🏽‍♀️  https://t.co/2Yd4Sh3QYv https://t.co/48T0XxeeOV ¿ESTÁN LISTOS PARA EL EN VIVO? ¿Les parece que hagamos una pijamada en vivo hoy por mi canal de YouTube ❤️✨🙃? Hoy no me he sentido muy bien, me dijo el doctor que mi cuerpo se volvió resistente al medicamento (algo así) entonces sigo igual o peor que antes :/ no los quiero dejar sin video hoy.... Oigan.... Quiero volverme a cortar el pelito cortito 😱 ¿Sienten que es malísima idea? Hoy quiero abrazos. Sólo eso... https://t.co/aB8b8TuFMt Me da corajito cuando nadie quiere postre. Nos estaremos encontrando. RT @DiegoOvalle21: Cuando te dice que te quiere, pero como amigo \n@yuyacst 😂👍🏽💓 https://t.co/QetAYWDEon RT @pauucvzm: Cada vez me gustan mas los videoos @yuyacst TE AMOO RT @_AlyVenegas: @yuyacst \"hace rato no podía hablar bien porque mi mamá se me quedó como sste man que pasa\" JAJAJAJA LA MEJOR VIDEOLLAMADA ¡NO VAN A CREER lo que me hicieron! 😳💉 ¡Los llevé conmigo todo el día! 🙈 Entra aquí para ver el nuevo vídeo 💕👉https://t.co/eU3Lf2Affw https://t.co/94Trk3yh8q Ya estoy subiendo nuevo video y qué nervios 🤭🙄... 😍 LOS AMO. Eres sol en días fríos 🙂. https://t.co/7Anwtb2B9Z ¡Lindoooo día 🤘🏼 actituuuuuud! Amigos diseñadores de interiores 🤘🏼 el otro día me mandaron muchos recomendados pero no tenia manera de ver su trabajo 🙂💗 por fis manden info para poder espiarlos bien ✨🤗 RT @kevsho9: @yuyacst morí de risa con lo de \"sabe a caca\" en tu nuevo video JAJAJAJ @CHerndes Ah si, si jajaja se me olvidaba ☝🏽😂. Gracias Dios por hacerme tan simple jajajajajajajaja RT @unn_gato_: \"tengo mucha hambre y a mi mamá le da mucha pena grabarme\". JAJAJA. Eres toda una poeta, @yuyacst RT @daniielaatm: Soy fan #1 del video de hoy @yuyacst JAJAJAJAJAJAJAJA la estoy pasando bomba en mi Snapchat ⭐️ Layuyacst 🙂 si hay alguien rarito como yo que aún tiene ahí nos vemos 💃🏽 pa' tirar fiesta. RT @Allison83257112: \"Que sabe a caca, bueno no es cierto Dios no es cierto, osea si sabe a caca, osea no se como sabe la caca, pero sabe a… ¡¡GUAPURAS, LO LOOOOGRÉ!! ¡Todo esto podrán usar en este 2018!✨ 🙈 NUEVO VIDEO😎 ¡está super cool!💕👉 https://t.co/FHU5w3XV7M https://t.co/QpbTUW4Ycm ¡Oigan 😱 creo voy a alcanzar a subir el video ahorita! Este año voy a ver a muchos de ustedes 😏... @joocarlors Te amo te amo te amo 💘 feliz cumpleaños chiquito lindo (en nuestra mente tu cumple aún no termina ✨😊) Qué sueño 😴. Tú no sabes lo que me haces sentir. @karlaceliss 😈❤️✨ Arriba. Abajo. https://t.co/hgPR6HmTEu Nos bastaba. 🥁¡Y LOS GANADORES SON...! 😱 ¡Se los cuento en vivo! ✨Entra ya a nuestro canal y descúbrelo 👉 https://t.co/2Yd4Sh3QYv https://t.co/PixtqJm6Ls 😱 ¡TE LLEVO DE COMPRAS! 💕 Guapuras, acabo de subir NUEVO VÍDEO ✨ y les cuento todo sobre las ofertas que compro 💸  Entra aquí  👉 https://t.co/awYuN4wAPZ https://t.co/xZzLlJINmZ RT @_Lilonieto: Amigos, el rímel de @yuyacst si es el mejoooor. Tengo tres pelos de pestañas y ahora se ven larguísimas y trabajo 9 horas y… ¿Oigan ya vieron en mis historias de Instagram @yuyacst cómo va la encuesta del VIDEO 😱? RT @monsets: Amigas, me compré un esmalte de la línea de @yuyacst y la verdad es que tienen una calidad excelente, y los colores están bien… @yocemp 🙋🏽‍♀️ Ay no, espérense mucho, yo todavía no. Qué emoción cargar bebés, ya perdón real me enloquecen 👼. ¡Ya casi va a nacer mi nueva prima 💕⭐️🤧😍 amigos no puedo con esta emoción! RT @GiovanaNieto: Me sentía melancólica hasta que entré a https://t.co/PzLYU9iLGp y me leí \"QUÉ PASARÍA SÍ...\" Necesitaba muuucho eso, te p… Gracias chiquis, guarde a los que me recomendaron para espiarlos 🙈💕. ¿Alguien conoce algún diseñador de interiores MEXICANA/O buenisisisisismo?  😍 RT @Brenda_ReginaF: Amando por siempre tus InstaStories. Eres tan hermosa. 😍 @yuyacst https://t.co/TjsyqjuUWW RT @Clawdeath: No me pude resistir a este hermoso color 💅 y envase 🦄 de @yuyacst 😍💖 https://t.co/lepRvNqVHc RT @MarianEspinoza_: Cuando te planchas el cabello ,sales &amp; esta lloviendo pasan unos minutos y asi quedas😂😂😂❤ @yuyacst https://t.co/JElD7v… RT @blondiealexa: Gracias por hacerme la vida feliz con tus mil historias en fin de semana, te amo @yuyacst Quiero ver tus ojitos toda la vida. Hasta mañana ✨💘🌜 JUNTOS. RT @GabiiBahamonde: \"Tengo este cuadro que dice family, y aca hay pura family que no es mi family\" 😂😂😂 @yuyacst ¡TODO UN DÍA JUNTOS  😱¡Esto es lo qué pasa en mi vida! 👀! Vean hasta dónde los llevé 👉 https://t.co/rrBBnWckAr https://t.co/tBMARlWhSZ POR FIN! ✨🌈¡Ya se está subiendo el NUEVO VIDEO! ❣️ Lo llenamos de cositas cool y nos atrasamos poquito, PERO QUEDO MUY COOOOL 🤘🏼 En unos minutitos ya lo podrán ver 👀 https://t.co/U2jvTj9nc4 @_AlyVenegas Siento que sí, pero las amo ya ni modo. ¡Le ponemos música al video de hoy Y LISTO 🙈✨ qué nervios! ¿Ya vieron en la encuesta del video de hoy qué ganó? 😱❤️😍 Adivinen de qué va a ser... 📹 @nathcampost Ayyy noooo Nat jajaja ya soy fan de tu abuela.  Pd: abraza a Larita de mi parte, en mis propósitos de este año esta conocerla y declararle mi amor. ✨ Me da mucha ternura que mi mamá me responda mis historias en Instagram. @paugutierrezros Pauuuuu qué te pasa? ¡Estas hermosa ❤️! @doveshighlight Es mi talento Elenita 😎. ✨💫 Adivinen a donde voy a ir a verlos... empieza con Pe.... y termina con rú. 😱 Nunca se sabe contigo. Oye,  pre cio so 🙄... https://t.co/J4CQoIdHFw @michsalmor6 ¡Woooooooow Mich, yo te quiero a ti chiquita linda! ❤️✨ RT @paolaagaytaan: @yuyacst tu rímel está increíble 😍 me encanto me encanto Inventamos el ritmo que nos gusta bailar... RT @isoysantiago_: Fan #1 de los Instastories de @yuyacst RT @lupita14peace: Siendo la más feliz con estas hermosuras! 💖😻 @yuyacst súper orgullosa de ti💛 https://t.co/MGKg9WhWjj ¡Mañana va a ser un buen día, descansa! 🌛⭐️ RT @ItzeelAlvareez: @yuyacst ¡Te pasaste con tu línea de maquillaje! Puedo describirla como perfecta, desde diseño hasta calidad en serio ¡… @RobertoAvilaL ¡OBVIO SÍ! 😍 También hay gente muy linda 😊💜. @LeslyMiranda05 ¡Te va a encantar! 👀 ¡MIREN LO QUE LES VOY A REGALAR! 😍🎁 Entra a ver el nuevo vídeo y checa lo que hay que hacer ✨, ¡ES SÚPER FÁCIL! 🎉 Click aquí 👉 https://t.co/uqEC4hu6cG @david96da ¡Esoooooooooo 💪 chócalas! ¡Cuéntame una meta que quieras cumplir sí o sí para este año! 💪✨ ¡TÚ PUEDES! https://t.co/hMZtcCYhrV @YuyaArgentina 🌚✨ ¿EL VIERNES DE QUÉ PREFIEREN VIDEO? ✨ Tú eres luz. Qué mala soy pintándome la mano derecha 💅 ya ni modo. 😎 @nabileahumada Chiquita más aventuras este año si o si, prepara esos aqua shoes preciosos ☝🏽. @SandyCoben Yo te mando abrazos a ti Sandy 😍 muchísimos. @teresuch Te quiero ver pronto chiquitita hermosa. Me acuerdo mucho de ti. Haces que todo sea mejor. 🤙 ¡Hola! https://t.co/YJR1Mz4omP Año nuevo me pone muy sensible. Ya casi regreso 🙈. Hola hola hola hola hola hola 🙃. https://t.co/OFiTFjsIUJ No esta tan divertido siempre tener tanta energía 😖. RT @AndrreaCastillo: No puedo creer que hoy seamos \n¡20 MILLONES DE GUAPURAS!\nGracias por ponerle todo tu amor a cada vídeo, siempre orgull… Me haces bien. RT @Cactuyers: Estamos orgullosas de todo lo que has logrado y nos sentimos muy felices de compartir todo este juntas. Seguiremos creciendo… Woooooowwwwwwww 😍. RT @joocarlors: @yuyacst ¡FELICIDAD INFINITA! 💕#20MillonesDeGuapuras ✨👏🏻 https://t.co/ZurU8pgMFk Gracias, por estar en las buenas y malas. #20MillonesDeGuapuras ¡ #20MillonesDeGuapuras no puedo creerlo 😱❤️✨🙈 MI MEJOR REGALO DE NAVIDAD ES SU APOYO! RT @joocarlors: ¡WOW!😱@yuyacst 🎈estoy súper orgulloso por ti por todo lo que has logrado y trabajado,no me arrepiento de estar junto a ti y… RT @Analisamm26: Haciéndole promoción al labial “Mi amor” por @yuyacst porque lo amé. https://t.co/7seAEYGsQL ❤️ WWOOOOW😱💕 ¡PUSE UN ÁRBOL DE NAVIDAD TIPO TUMBLR!⭐🎄Entra aquí para ver el NUEVO VIDEO 🙈✨https://t.co/8uaNUvZEcW https://t.co/sSYCeIg4aH ¡HOY SUBÍ VÍDEO! 😱🙈 ¡Ya empezó el maratón de navidad y año nuevo! 🎄🎉 ¿Quieren ver de qué trata? 😍 Entren a aquí para verlo ---&gt; https://t.co/HsYZDWdkUx https://t.co/uNI6o7AOGa ¡VIDEO NUEVO!⚡💕¿Quieres entrar a mi cuarto y a mi clóset? Entra aquí 👉 https://t.co/zeScIbLaRk ¡Compartí mucho con ustedes 🙊❤. https://t.co/3hQm2wacWd ¡Ya casi el NUEVO VIDEO 😱🙌 LES VOY A DAR TOUR....! Ustedes son los meros meros de mi corazón, gracias. ¡EN VIVO! 😊 ¡Chiquitos, entren ya a nuestro canaal! 👉 https://t.co/2Yd4Sh3QYv 💕 ¡Voy a CONTESTARLES LA VERDAD DE MI SHAMPOO! https://t.co/VyTxVZoXrM @sofsacosta Date cuenta que te amo y que estoy muy feliz por tu vida chiquita hermosa 💫🍕🍦¡FELIZ CUMPLEAÑOS! RT @joocarlors: @yuyacst 🌟Soy totalmente fan de tu nuevo video 😍 —&gt; https://t.co/KGolBmYnKz 🎥 Super recomendado 👏🏻. https://t.co/o3YSLDQgZ9 Me volvió loca tu forma de ser. HAULLLL 🤟 ¡¡VIDEO NUEVO!!💕 TODA ESTA ROPITA COMPRÉ, NO LO PUEDO CREER 😱 ¡estoy muy emocionada!🙈 Entren a ver todo👉 https://t.co/NGudM7UqsE https://t.co/20uyiDA2M1 Mientras no tenga Instagram 😥 andaré de intensa por mi SNAP ❤️ LAYUYACST 🤧#YaNimoro RT @Ingrid_Valles_: Gracias por existir @yuyacst  te amo. https://t.co/s4KK5YsGUJ ¡Gracias por ayudarme, te quiero mucho! Guapuras chiquitas 💘 me ayudan mandando tuit a @instagram @InstagramES para que nos ayúden a recuperar mi cuenta en Instagram 😔 @yuyacst? 🙏 GRACIAS 😿 @InstagramES Ayuuuudaaa 😭 no puedo acceder a mi cuenta en Instagram 👉 yuyacst RT @YouTubeMexico: ¿Dejarías que tu papá te maquillara? @yuyacst lo hizo y así quedó. https://t.co/PqUg10FHXJ https://t.co/Zk5Zdc55Dc H🌹LA. https://t.co/O8WurCOyCx ¡😱 MI PRIMER PERÍODO!🙊 Les cuento toda la historia en el NUEVO VÍDEO 😖😰✨. Da click aquí para verlo ---&gt; https://t.co/Xaztw8pCxX https://t.co/wooRngHLfS ¡NO PUEDO CREER QUE CON ESTA COSA TAN SIMPLE MI CABELLO ESTE CRECIENDO DE MANERA IRREAL! 🙈 💓 ✨🙊\n⭐️ ¡Entra al en vivo que estoy a nada de hacer! 😨 https://t.co/NYpzlzbX6w ¡Hoy EN VIVO por mi canal de YouTube 🙈🤘🏽💓😊👏 TIENES UNA CITA CONMIGO 😏 nos vemos en un ratón! NUEVA NOTA ✨¿Qué hay en mi clóset en esta temporada? 🙈 👠Les cuento todo y les doy ideas de como complemento mis favoritos 👏💓 https://t.co/nfY8CS9ubm https://t.co/N10jSaosFp ¡Qué ganas de poder dormir! @SandraCorcuera Chiquita hermosa 💖 muchas gracias! 😙 RT @bellacsisa: @yuyacst Amo este tipo de vídeos donde nos enseñas un poco de tu vida nos haces sentir mas cerquita de ti🌟💕\n----&gt; https://t… ¡GUAPURASSSS NUEVO VIDEO! 🎩👰🏻 COMPRANDO EL VESTIDO PARA LA BODA ✨ ¡y estuvieron junto a mí todo el tiempo🙊💕! Entren a verlo todo 👉 https://t.co/uIS8ztLwmT https://t.co/fG75MIVBxr RT @daniielaatm: Reflexiones profundas mientras tu padre te maquilla😂 @yuyacst https://t.co/MROMKQX2Hi RT @YuyaArgentina: \"Podemos cometer errores y corregirlos\" 😅❤ nuevo video de @yuyacst con su papá! https://t.co/Ef8l4Mx6sY https://t.co/PAF… ¡VIDEO NUEVO!✨ MI PAPÁ ME MAQUILLO PARA UNA CITA Y ESTO PASÓ , ¡No lo puedo creer!🙊💕 Entren a verlo👉 https://t.co/nTfLYC3Wyu https://t.co/BCwRXCirsr Cada sueño se puede hacer realidad, ¡TÚ PUEDES! ✨🙌💕 Trabaja duro por eso que quieres 💪 https://t.co/SZZuRtG4Eb ¡¡NO PODÍA DEJAR NI UN DÍA MÁS SIN COMPARTIRLES ESTO! 💖 Quería hablar con ustedes de algo importante y me desahogué ✨🙌 entreeen y díganme qué piensan, ¿qué pasaría si...?🌟👉 https://t.co/tv3BaoFUNm Tú eres mi dulce. ¿Un EN VIVO por Instagram mientras me arreglo para salir? 🙈💓🙂INSTAGRAM: @yuyacst ¡¡VIDEITO NUEVO!!💃💕 ¡SIN PENA DE NADA! ✨❤️☝️ TODO SOBRE COMO SOBREVIVO A MI PERIODO😰😱♀ Entra aquí y descubre de qué te hablo 👉 https://t.co/Y7tN6ykY9y https://t.co/jIMXWQ6tmD RT @mariavillarm: @yuyacst me encanta 💜😍 es demasiado bonito✨ y perfecto💅🏻 https://t.co/IKJvsjcnle No sé que poner acá. 🌼 Saca emojis de plantitas en los comentarios ☁️👇 https://t.co/ADfmmsIQmt Te quiero. ¿A QUIÉN ENVIDIO DE YOUTUBE? ¡¡NUEVO VÍDEO!! ✨👀 No saben lo difícil que fue confesar todo esto 🔥🙊, ¡tienen que verlo! 👉https://t.co/nlyNuN3EwS https://t.co/d3GzA4UrPm ¡Terminando el video de hoy, estuvo TREMENDO jajaja 🙈😰✨💓 lo podrán ver a las 5:00 pm.! 😏 https://t.co/6lRTx6CRm1 Subo muchas cositas cool todos los días a mi fb ✨💓🤘🏽🌵, ahí nos vemos🙂: https://t.co/eBW9p6mkkM https://t.co/rW2YuyuhJf Lindo día a todos chiquitos preciosos 🌼🙂✨💓. @AleAguiilarG 😱❤️😍 @Paugalindo ❤️😚 Ella es mi amor. ✨🌼 Feliz cumpleaños a la de los ojitos preciosos. https://t.co/155cumeBHh @dannygrrrr @liverpoolmexico Gracias por apoyarme mi chiquita, te quiero muchísimo 💓 @blondiealexa Qué insoportable, te amo. Súbele a la radio. RT @Alechavarriayb: Te amo mucho gracias por este día ❤️ fue muy especial 👭! @yuyacst https://t.co/iOukdXhads RT @caarolinagarcya: Te amo para toda la vida, espero te hayan gustado mis regalos chiquis🌵✨ @yuyacst https://t.co/kMGLTyBZiZ RT @alemontemayorr1: Algo que aprecio tanto es que cada experiencia la puedo vivir junto con mi mejor amiga. @yuyacst nos inspiras demasiad… RT @carolinagarzaa: @yuyacst que linda eres!! Fui de las ultimas, me imagino lo cansada que estabas y aun asi super amable y super bella! N… 🌵Con mis chiquititas preciosas 🤘🏽💓 En Monterrey la gente es coooool 🌛 ¡Gracias por ser tan apoyadores! https://t.co/XnW8OaN1Wu RT @SedalMexico: Ell@s ya conocieron a Yuya. Da RT si tú también estás aquí #SedalYuya 🍋 🍃 https://t.co/90jU7FGAZE RT @SedalMexico: ¡Hola #MTY! ¿Quieres abrazar a @yuyacst? Corre por uno de los pases que tenemos para ti en Soriana Cumbres #SedalYuya 🍋 🍃… ¡Hoy es #SubwayDMS 🤘🏽💓 y hay 2x1 😛  👏✨🙌  en @SubwayMexico, además se ayudará a combatir el hambre, apoyemos chiquitos! https://t.co/agx4fveXOO @CarlaMorrisonmx Yo te los regalo 😍 te quiero chiquita bonita. ¿CÓMO USAR ROPA INTERIOR Y QUE SE VEA BIEN? ¡¡NUEVO VIDEO Y SORPRESA!! 👀💃 Corran a VER el vídeo que acabo de subir💕: https://t.co/BjNTQ0bFIQ https://t.co/cAxOghaxZd Hoy nos vemos 😏. RT @TimeOutMexico: ¿Sabías que el jardín más grande del mundo está en México? Conoce @jardinesdemex https://t.co/h2EICaqnoo 🌛 🎃 Concurso de calabazas en mi Instagram: @Yuyacst ⭐️🌛 Entren a votar 🤘🏽🙈 https://t.co/MTGy12T1vv @_AlyVenegas POR FIN ❤️ RT @OyeKarii: @yuyacst Yo solo sé que encontré tus maquillajes y soy la más feliz https://t.co/l1eFvUd88Q 🙈 Mándenme foto usando el filtro de Snapchat de la fórmula 1  ❤️🏎    #AMáximaVelocidad #GPMX Otro día más sin comer pan de muerto 😐. @vamilandt Te enamoras. @SoyTato ¡Tatito feliz cumpleaños amigo hermoso ❤️🤗 te debo un pastelito! Hoy necesito una cosa en la vida para ser la mujer más feliz del mundo, PAN DE MUERTO. ¡¡NUEVO VIDEO!! ✨¡No vas a creer a qué sabe un cerebro! 😰🙊 entra y descubre cómo hacerlo 👉 https://t.co/alccPoLiKP 🤘🏽¡ESTOY SORPRENDIDA! https://t.co/EwGPsBgCKB Te amo. Ahora sí #AMáximaVelocidad la canción de #GPMX\nhttps://t.co/RTN0JhQ401 ¡Qué emoción! 🙈🤘🏽💫 😰😱 ¡PROBÉ LAS MASCARILLAS MÁS FAMOSAS DE INTERNET!👀✨ 😭😍 ¡Estoy sorprendida con el resultado! Entra aquí 👉 https://t.co/TJt3mmCbLl https://t.co/J5kjK7N6r8 😰¡FARSA O MARAVILLA!👀¡Mira lo que pasó cuando probé las mascarillas más FAMOSAS de internet! 😱MIRA el NUEVO VÍDEO💕👉  https://t.co/TJt3mmCbLl https://t.co/excQhZzths RT @liverpoolmexico: La nueva línea y diseño de cosméticos de @yuyacst está increíble. ¿Ya los probaste? https://t.co/S6OmIwA9jG #yuyacosme… @teresuch Las amo a ustedes preciosas, son hermosas en todos los aspectos ❤️⭐️💫 @aleehpandita Qué emoción Ale, disfrútalalos muchísimo ❤️ 🙂 te quiero. ¡Ayer tuve la oportunidad de compartir un poquito de mi experiencia desde un inicio en YouTube y… https://t.co/9vKwZh7JGe Gracias por apoyarme tanto, en verdad 😊❤️. El día de hoy sus papás necesitan un poquito de nosotros,por favor me ayudan con unRT?❤️Se necesitan donadores de sangre de cualquier tipo.🙏 https://t.co/kVDEGTDf19 ¡Ay entonces qué bueno que no estoy sola en mi intensidad de nervios 🙄😌! ¿A ustedes también les dan ganas de vomitar cuando están nerviosos? ¿O yo sí estoy malita? Estoy nerviosa. Te quiero de mil modos. ¡TE QUIERO VER 🙂❤️! https://t.co/wIvi7Fl2Xp Me enamoré de ti. RT @krlnanis: Las sombras de @yuyacst se acaban de convertir en mis favoritas. 😍 Por fin en el hogar dulce 🏡. Te vi brillar bailando. No nací para las despedidas. Quiero ver tus ojos. @CristinaDianey @soyAdlemiG @ohkingsgirl ¡Hermosa ya casi están a la venta físicamente 🙈, no te preocupes chiquita, te van a encantar! 💗 @iPabloOrozco OBVIAMENTE SI PABLO. ¿Qué tan tía soy si realmente me encanta ir a bodas 🙄? @manuelmedrano Depende.... jaja amiguito te mando abrazos! 😌 Díganle a @jarabeoficial  que son lo más de lo más de este mundo ❤️. No has conocido a nadie que te bese como yo. Tengo muchas ganas de grabar todos los días de mi vida un ratito de lo que me sucede.  😳📽🙄💛 ¿ Si o nel? Hace días que te observo... ¡La próxima semana vuelvo con todo chiquitos 😌😛✨📽! @YuyaArgentina Obvio si ❤️ Jajajajajajajajajajaja @_AlyVenegas La chiquita de mi corazón hoy cumple años 🤘🏽⭐️✨🍰🍦 te amo con todo mi ❤️. RT @fatiiiiiiiiima: @yuyacst  Ya llegó mi Chiquita 😍😍😍 https://t.co/NwIYkaMZgV Quiero saber hacer ropa 😰. Vámonos lejos. Comprender, aceptar y perdonar. RT @blondiealexa: TE LA VOLASTEEEE😍, una joyita tus sombras, súper recomendadas❤️✨ @yuyacst https://t.co/ieUrcW5pFu 😗 RT @valelm94: El tono #Marita de @yuyacst es lo máximo, ¡me encantó!💕 https://t.co/sFib2CxwNO @GreeciaaDavilaa Jijole ya me dio nervios 😰 #ToySudando ¡NUEVO VIDEO!✨TOUR POR MI MAQUILLAJE BÁSICO😱¿Qué uso?👀¡Toodo lo que a mí me súper funciona!💕Entren aquí para verlo 👉 https://t.co/xa2Fgutj3w https://t.co/EGFUVlnqJI Oigan, BIEN feliz  de que cambie de foto por estos rumbos y ya viéndola bien, un pixel más y se convierte en grosería 😬🙄👆. Estoy subiendo un nuevo video y estoy muy happysss por eso 😛. Gracias por ser tan hermosos conmigo. RT @_kdr9: La más feliz 😍 @yuyacst muchas gracias yuyita✨💛 https://t.co/9cVHa0veQu RT @eli__A: Los labiales de @yuyacst son lo más  bonito ❤️. Además llegan súper rápido 👏🏻👌🏻. https://t.co/C6kubZ04BV ¿Todas las mamás cambian la voz cuando hablan por telefono o solo la mía? Soy la reina del mal del 🐷. @DaciaVargas ¡Qué emoción 🙈 mándame foto cuando te los pongas ❤️ te amo! RT @obliviatecprt: Yaaaa llegaron mis cositas @yuyacst 💕💕💕🎊🎉😱😱😱 que empaque 👍🏻👌🏻 https://t.co/YXZunTw5lA Oye, te quiero y soy muy feliz por tu vida. Justo ahorita ganaría el premio a la más estresada del mundo. RT @sofsacosta: Se me puso la piel chinita, te luciste te amo tanto @yuyacst RT @RobertoAvilaL: POR FINNNN! Lo que tanto querías y en lo que tanto trabajaste, te lo mereces mucho, me llenas de orgullo en verdad 😭💕 @y… ¡NUEVO VÍDEO!✨ ¡Había esperado mucho tiempo para poder darles esta noticia!🙈❤ Entren aquí y descubran MI SECRETO 👉🏼 https://t.co/tAwf3eADFB https://t.co/dJMY84rBm5 ¡Falta un poquito más y listo 🙈 espérenme no se duerman por el amor de Dios 🙏😍! ✨✨✨✨ ¡HOY ES UN DÍA ESPECIAL y me urge que lo sepan todo! 🙈😱 ¿Alguien ADIVINA que tengo en la mano izquierda? 🙄 https://t.co/IkcdskENqw ¡Hoy les cuento todo 😱😰😭😍❤️! Háblate de mí. Deliciosas y adictivas mandarinas. Dame vida. @marcelaamq Y tú ❤️ Ustedes también son una ricura. Qué ricura mis amigas 😍. ¿Y si les doy una pistittititititiitta por mi Instagram? 🙄 pero chiquita para que no me regañen tanto 👆🙈... QUIERO LLORAR DE LO FELIZ,por fin esta semana que viene les voy a contar algo que preparamos para ustedes durante muchísimo tiempo ❤️😭🙌🙏👀✨🌟! ¡QUIERO HABLAR CONTIGO!🙏No saben cuánto los extrañé.Acabo de subirNUEVO VÍDEO💖Click aquí para ver de qué se trata--&gt; https://t.co/tl5WhwD3QU https://t.co/9aeqfRCksb Todo tú. Santi junto a su familia lo perdieron todo, están durmiendo en una casa de campaña, así como ellos hay muchísima gente que nos necesita. https://t.co/uuGunEf9ir En mis tuits pasados encontrarán una lista de cosas que podemos donar, aquí les dejo algunas otras. https://t.co/RzLzpDG7wJ El día de ayer recorrimos algunos de los lugares afectados y entregamos personalmente lo que ustedes donaron 😞 la gente está muy agradecida. ¡Mañana de nuevo estaremos en nuestro centro de acopio recolectando todo lo que puedan donar! ❤️ ¡Para ponernos las pilas todos! ¿va? @iflaca0 ¡Si hermosa ❤️ fuimos casa por casa! Gracias a todos los que han donado y confiado en mi, el día de hoy justo ahorita vamos en camino a un pueblito a entregar algunos víveres. Mis perros se portan tan MAL que me hacen dudar si quiero tener hijos 😭. ¡SIGAMOS AYUDANDO!❤🇲🇽 Estamos recibiendo donaciones desde las 9:00 am hasta las 3:00 pm y seguiremos aquí de 4:00pm a 6:00pm 🙏 https://t.co/hmp8eBkR87 🔺¡Ya estamos recibiendo víveres y nos encargaremos de entregarlo a gente que aún no ha recibido suficiente ayuda! 🔻🙏   RTT https://t.co/qnCutl7EU6 RT @CRACUP: @yuyacst Para los rescatistas lleven impermeables, ropa seca o impermeables improvisados con bolsas de plástico, lonas lámparas… ¡Mañana desde las 9 de la mañana hasta las 3 de la tarde vamos a seguir recibiendo donativos!  ⭐️AHÍ NOS VEMOS EN LA MISMA DIRECCIÓN 🙏 https://t.co/7K0wm0RaA5 🇲🇽❤️ https://t.co/jF9nYyj8GO ¡Los estamos esperando! 🙏¡VENGAANNNNNNNNN traigan lo que puedan! https://t.co/m5Ww2Dk3Kz RT @CRACUP: @yuyacst se necesitan en mayor cantidad, cascos, guantes, lentes protectores picos y palas. RT RT ¡Listo amigos, les dejo toda la info del lugar en donde estaremos recibiendo donaciones! 🙏  #TodosPodemosAyudar https://t.co/NmKziZoxGB En un momentito escribo para pasarles toda la info. No puedo dormir :(. ¡Amigos este hotel abrirá sus puertas para la gente que necesita comida y un lugar para dormir! (Jojutla Morelos) https://t.co/mRQo20MbfC RT @lopezdoriga: Pido su RT, por favor. \n\nQuiten candados/contraseñas de su red de WiFi. Si hay gente sepultada entre escombros, podrá comu… RT @alonsoae: @yuyacst Usen esta herramienta que google ha activado sirve mucho para registro de personas encontradas y desaparecidas https… ¡Amigos por fa RT! https://t.co/nNxSecYCUx Están bien ? ¡Hola, te quiero mucho! 🙂 Lindo día. Sácale chispa. Hasta mañana 🌜✨☄️, te quiero. @_AlyVenegas Ya casi nos vemos 🙊 @heyitsmiguel11 🙌😌 @AlexEst_ ¡Gracias por la recomendación Alex 🙂👀 seguro mañana lo veo! Me emociona ver documentales 🙈. RT @YuyaArgentina: Yuya via historias 💕 (layuyacst) https://t.co/WeGLASGQlh @betopasillas 😳 amo. El tiempo todo calma. Los tíos y papás se adueñaron de Facebook. @Aliguen_ Yo a ti más. RT @MonsStyleslml: Eres la mujer que más me inspira a seguir mis sueños. @yuyacst https://t.co/nu1ZN5aJ1S RT @FaridSaavedra: ¡Hola! Estoy recopilando un listado de Centros de Acopio a través de la república, ¿me ayudas a compartirlo?\nhttps://t.c… 😱 ¡LO VAS A AMAR! 😍 ¡Mira lo que compré para irme de fiesta! 💃🏾 ✨ Da click aquí para ver el NUEVO VÍDEO 👉  https://t.co/oP7BUOf5ly https://t.co/tBl7aRT7Ek Hoy te quiero mucho más. ✨ ¡FUERA DE ESTE MUNDO!😱💚 ¡No podrás creerlo ñ😭😍😛!  VÍDEO NUEVO 💕 Click aquí para ver de qué se trata🙊  ---&gt;  https://t.co/6gjx4QnUAC https://t.co/oVDmHCQlyW Ojitos bonitos. Estaba pensando que, qué rico no peinarse. https://t.co/XcQofkwxcW RT @Fannnuel: @yuyacst me hiciste la semana con tu nuevo video jajaja 💕 😱¡NO CREERÁS ESTO! 😭 ¡Casi me da un infarto! 😰 Acabo de subir NUEVO VÍDEO✨, entra aquí y ve de qué se trata ---&gt;  https://t.co/CZXZnfn4Tx https://t.co/FHakUAwnPL @ulisess_Cast  eres el mejor manager del mundo, GRACIAS. Estoy nerviosa, muy pronto les podré contar algo por lo que hemos estado trabajando desde realmente hace mucho tiempo. @FernandaRomer03 Te amo ❤️ ¡NUEVO VÍDEO!💃💕 ¡Mira lo que le hice al cabello de mi amiga! 😱 Ve el nuevo PONLO A PRUEBA aquí 👉🏽 https://t.co/EHpSRVmrUK. ¡ESTOY EN TRAUMA! https://t.co/4ZMpejTD7c Me encanta la cara de la gente cuando está enamorada. Le faltan horas al día para seguirnos queriendo. @Alejandradlm_ Las amo ❤️ RT @LizethBovalle: Amiga ahí viene el que te gusta, actúa normal!  Y tipo.. 👇😂 jajajaja eres increíble! Me encanto! 🙆💖  @yuyacst https://t.… ¡YOGA CHALLENGE! 💪😰😭¡LLOROOOO! 😖 ¿FRACASÉ O LO LOGRÉ? 🙊 ¡Entra ya, acabo de subir VIDEO NUEVO!💕 ---&gt; https://t.co/STUV33AdtC https://t.co/C11UbsfPfw ¡Subiendo el video que dejo a mi columna insoportable 😰😖😂! ¡Qué mal me cae el sonido del despertador! Los moscos me aman. ¡TIENES QUE PROBAR ESTO! No te imaginas la delicia 😍, ¿quieres saber de qué hablo? 🙊💕 ENTRA A VER EL NUEVO VÍDEO 👉 https://t.co/gGmpkRcSsv https://t.co/H5gZyjs6Ix Hoy quisiera dormir todo el día. 👆🏼 Y luego llegas tú... ✨🙈NUEVO VIDEO 😱 ¡Les juro que no van a creer que HICE ESTO ALGÚN DÍA! 😰  👉CLICK AQUÍ para que veas TODO  ---&gt; https://t.co/8pIfeNp8Zx https://t.co/dYhqKF2Zf3 RT @eliicst: ¿Ya vieron el nuevo video de @yuyacst ?\n¡RECREANDO MI MAQUILLAJE DE 15 AÑOS! ¡NO PUEDE SER! ♥ - Yuya\nhttps://t.co/RHh3xw4UVu h… Hola 🙂 ✨¡VÍDEO NUEVO! 😱 ¡No vas a poder creer la hermosura de esto! 💡📝¡Sé el más COOL de la escuela! 😍🙊 \n¡ENTRA AQUÍ! ---&gt;  https://t.co/LSB34L1qRy https://t.co/aRNkLY8vVt RT @ChumelTorres: Yuya acaba de llegar a los 19 millones de suscriptores.\nElla sola es un network de televisión entero, qué chingonada ❤️ @ChumelTorres ¡Gracias por la buena vibra❤️! @elguzii ¡Gracias Guzii por todo el apoyo, los quiero mucho en verdad ❤️! RT @YuyaLaMejor3: @yuyacst Eso te hice yo, no es la mejor calidad pero es con amor https://t.co/CKYZGoTEX8 RT @Alechavarriayb: #19MillonesDeGuapuras MIRA LO QUE TE HICE MUCHAS GRACIAS POR TANTO MI @yuyacst TE AMO💕✨❤️! https://t.co/OAib0ooLxg RT @yeahlool: @yuyacst  aaaaaaa❤️ súper orgullosa de ser parte de la familia guapura! 🙌🏻❤️ https://t.co/ovXmXZqv5l RT @RobertoAvilaL: Me siento orgulloso de ti y todo lo que haz logrado, otro millón mas juntos ¡FELICIDADES! 😍✨ @yuyacst #19MillonesDeGuapu… RT @Mariela_D_03: @yuyacst #19MillonesDeGuapuras Hehe Te Amó ❤\n- Y tú ídolo es normal \n- Pues https://t.co/FSQVhZbuv8 Son los mejores DJs 🎉💓✨ gracias por bailar conmigo 😍 y por ser el motivo del festejo 🎤✨ https://t.co/2Yd4Sh3QYv. #19MillonesDeGuapuras https://t.co/zm9MUfKp3z RT @Moragonna09: La mejor celebración con @yuyacst en VIVO,te amo,no hay celebración sin baile😂💕 ¡ESTOY EN VIVO! ❤️https://t.co/2Yd4SgMg6X ¡Tengo algo que festejar y lo quiero compartir CONTIGO! 😭😊🙋🏽✨🎉 ¡ENTRA, entra a platicar! https://t.co/T5aFphCJRB TENEMOS CITA A LAS 6 🙈 ¡Estoy nerviosa! 🙋🏽 ¡Hoy, EN VIVO desde nuestro canal 🙈😛 TENEMOS ALGO PENDIENTE POR FESTEJAR! 🍿🍦🌻🎤🎉 ¿Alguien tiene idea? .... ¡BUENOS DÍAS ❤️✨! 😍¡Junte a mis AMIGAS(las que son más malitas para peinarse)🙈y las reté a hacerse peinados muy cool en solo 5 min!--&gt; https://t.co/G6fQQq9Ka1 https://t.co/OyPH1Uz0K0 ¿Y si el pasado todavía es presente? RT @blondiealexa: Tú reacción cuando te entregan calificaciones : @yuyacst https://t.co/gdRhWUsA8g ¡Chiquis me voy a poner por primera vez lentes de contacto 😑 tengo nerviaaaaa 😭 ayuda! ❤️ Voy a hacer un EN VIVO por Instagram 🙏YUYACST ¡Muy contenta, contenta! 😌 https://t.co/n6vGsXNxuP Chiquis ando desaparecida disfrutando de la vida, regreso en un día. https://t.co/g46ZeQlGvV Tiempo para todo. 🚂 https://t.co/HWM1ExbK7r RT @daniielaatm: Gracias por ser tan linda❣️ te amo con todo mi ser @yuyacst😽 https://t.co/t3wwlZch1M Quiero mi maleta :(. RT @Daliadelgado_1D: Cuando te preguntan \"¿y la dieta?\" 😂😂 @yuyacst https://t.co/l7y98QfiRO RT @Honey_C3: Corran 🏃🏼a ver el nuevo vídeo de @yuyacst ✨\nEsta divertido a muerte. 🙈😂 --&gt; https://t.co/7dkAYNX6fc https://t.co/FstULwS2io Acabo de subir vídeo 🙌😱. ¡PROBÉ COSAS SÚPER RARAS y no tenía idea que sabrían así!😨 Mira todo aquí 👉 https://t.co/BNIHeI2WcB https://t.co/FtIlPY1JQd Sin maleta pero feliz y bien abrazada. ❤️ Cosas que siempre me pasan a mi 🙁. Falta un poquito. RT @eliicst: Mañana @yuyacst llega a Perú que emoción😍❤ Quiero bailar contigo. RT @cataahenriquezz: @yuyacst mira Yuyita ayer fue mi cumpleaños🙊🎊 y mira lo que recibí de regalo😍🦄 https://t.co/ddW87aOItZ RT @AleGarling: @yuyacst Mira Una Gran Fan Tuya Te Ama @rexyrodriguez29 https://t.co/GgDtpuH4m0 La gente de Perú es cool 🐒♥️. RT @eliicst: 7 días para que @yuyacst esté en tierras peruanas Nadie en el mundo siente lo que yo siento por ti en este momento. ¿Si te robo un besito? Huye de las personas que apagan tu sonrisa. Déjame hacerte sonreír. Ven y cuídame. ¡PORR FIN! 🌻🙈 Ya quedó el video que tanto me pidieron 🙋🏽💗 IMITANDO FOTOS TUMBLR 😰😱 ¡Esto pasó!  https://t.co/11MQhVc2i5 https://t.co/QnhArDL7jS RT @xmarielaaax: El video más esperado del canal @yuyacst 😍😍, vayan a verlo ---&gt; https://t.co/M8TZlP9Oo4 😱🙊 https://t.co/nODYsmEHgE Según mis  historias de INSTAGRAM @yuyacst 🙊.... ¿sabes cuál será el video de hoy? 😱✨💗🙋🏽 Tú me quitas los miedos. Siento mucho amor. @vzvriel Muchas gracias 🙃💖 No estás solo. RT @SedalMexico: Lo que pasa en el finde sólo se queda en tu memoria... Por un #InicioDeSemana con un cabello refrescante  y desintoxicado.… @xmarielaaax Mariela dile a tu mamá que me invite a conocer sus plantas 💃🏽🌻 Y hablando de mujeres que admiro 👏❤️ ella es Diana Laura Coraza y es MEDALLA DE ORO en @ParaAthletics 2017 👏 ¡Mexicana fregona! https://t.co/hGg6IHE6JP ¡Mi chiquita bella @CarlaMorrisonmx hace magia! 💜\nhttps://t.co/rvppqXBHRp  ¡VIVA EL AMOR! 💫 ¡Sonríe y disfruta de tu ser! RT @joocarlors: @yuyacst 😱No inventes te vez mega hermosa 😍--&gt; Via Facebook (yuyaa&lt;3) ✌🏻 https://t.co/w3K5xmz6ng Hoy es un día feliz, voy a comprar nuevas plantitas junto con mi madre 👯🌼🌻🌿🌵. RT @firstpurpose_: @yuyacst Hasta mi novio me ha dicho: ¡Qué valor tiene Yuya al enseñar fotos de su pasado! 😍 Tenéis que verlo➡️💖 https://… @NormaaG12 ¡Normirrris de mi corazoncirris, sobra decirte lo mucho que te amo y lo feliz que me hace tu vida! 🎉💖💫🎂 ¡Feliz cumpleaños! RT @Alondraahe: @yuyacst https://t.co/hLWP1no7qV\nAme el nuevo video! Deben verlo 💕 todos tenemos fotos del pasado que no queremos mostrar 👀… ¡NO PUEDO CREER QUE LES ESTE ENSEÑANDO ESTO! 😭😂😱 ¡Reaccionando a mis fotos del pasado! 👁🙈 Jajajajaja ¡Qué pena! 😬 https://t.co/ijV91roi48 https://t.co/9z6daIk5sB RT @BlancaLovesLife: ¡Dios! En serio que valor de mostrar tu pasado oscuro, mis respetos 😂 ¡Felicidades! Muy buen vídeo, me encantó. 😊💖 @yu… RT @mireyazunigayep: @yuyacst Todos tenemos un pasado oscuro jajaja @RobertoAvilaL Gracias Robert 😭💗 ¡Qué emoción acabo de subir nuevo video y cuando me metí a verlo salió antes el anuncio de nuestro shampoo, quiero llorar del sentimiento!😭🙏 ¡Estoy subiendo un video en donde les voy a revelar un poco de mi pasado jajajajajaja que risa la vida 😂😂! Enamórate de ti, de la vida y después de quién quieras. 👁 https://t.co/SzsHmPGnZl Dulce hogar. @LuisitoComunica Jajajajajajajajaja Luisito 😂😂 Ojitos sonrientes... Hola, ya en poquito volveré  a tener internet, mientras tanto estoy siendo atacada por miles de moscos en el mar. 🌴 https://t.co/PuoR36oOhb Por la sombrita. 🌴 https://t.co/XQe6asfKlx Vivir riendo, eso es vida. 🙌 @edgarsuelo @LaComerOficial Jajajaja la amo. Me siento tan feliz que me duele la panza 🤗 Se me cierran los ojitos. ✨😱 ¡Puse a PRUEBA mi propio shampoo! 👍😰👎!⭐️Estaba MUY NERVIOSA 👉🏽ESTO FUE LO QUE PASÓ: https://t.co/UZguMTx4At ¡NO LO VAS A PODER CREER! https://t.co/gCrDoGtxLX Eres más grande que cualquier problema. ¡Chiquis si tienen foto con nuestros 🍋🌿 productos para el cabellirris, mándenmelas 🙈 quiero subirlas en mi nuevo video! @lalo8162 Me cuentas si recomendé bien Lalo 🙈 pero ponle atención 😛 ¿Qué le pasó a mi cabello en mis historias de Instagram 😱💖🙈😰 --&gt; @yuyacst ✂️ 🌼 https://t.co/E7Svl4Bwqo Contigo sí, contigo siempre. @YuyaArgentina ¡Lo lograste chiquita 👏 a echarle todo el amor y las ganas! @LaFemmeRgz Tu mamá es mi amiga 😎 @Alechavarriayb Feliz cumpleaños chiquitinga te amo con mi corazón entero 💖🎂🍦 Emoción de un día nuevo. @Tessa_ia 💖✨ ¡Mi ROPA INTERIOR 😱 la hago yo misma y queda HERMOSA! ✨🙈 No vas a creer lo fácil 🙌 MIRA TODO POR AQUÍ: https://t.co/IdkKz8hUpg  #Bralette https://t.co/3PAtkcpkCp ¡Gracias a los que me siguen en insta 🙈🍋✨ @yuyacst y vieron mi mini EN VIVO!💖 ¡Gracias por emocionarse junto a mi!🙏 ¿Qué creen que va a ser? @AndySantiago00S Te quedó increíble 👏❤️ @ImAshleyHart GRACIAS chiquita 💓 Días de caos, cambios, abrazos, pláticas, felicidad, estrés, caras felices. https://t.co/MPIBsyemMI RT @SedalMexico: Un poco más del meet &amp; greet que tuvimos hoy con con @yuyacst #SedalDetox #DateUnDetox #SedalYuya https://t.co/i1Cdm3qqLt @Sergecast Te amo y te amaré toda mi vida. RT @MontseeMRDZ: @yuyacst Te Adoro Yuyita estás hermosa y en serio tienes una vibra súper bonita 💕 https://t.co/UY8deHnaH2 RT @SedalMexico: Ya estamos listos para el meet and greet con @yuyacst #DateUnDetox #SedalYuya #SedalDetox https://t.co/YCDj8GxaLv @Elizabe614 🤔😏... RT @yuyatogether: Por mi te viera a diario en vivo,disfrutó mucho este ratito conmigo,siento que escucho a una amiga,te quiero mucho❤️ #Yuy… @joocarlors Wooooow Joo siempre me sorprendes 👏💓✨ RT @daniielaatm: Amé totalmente tu en vivo, amo platicar contigo, me haces sentir mas feliz✨ @yuyacst RT @yaretbautistag: #YuyaEnVivo\nNo sé pero como qué yuya me hizo reflexionar más sobre todo, disfruta la vida, no sé vive otra vez. Gracias… RT @Guapura_Forever: @yuyacst Y si haces un en vivo por semana? 🙊, amamos verte 💕 #YuyaEnVivo ¡Les tengo que contar muchas cosas!😰💓🙏 NOS VEMOS A LAS 6 EN VIVO desde mi canal de YouTube😱 https://t.co/2Yd4Sh3QYv 👉🏽¿A quién veo por ahí?💃 https://t.co/eA0UbsNErc RT @ferdebieber_: Mira lo que llevó a mi viaje 😍 @yuyacst me encanto la versión bebe 💖👏🏻 https://t.co/1pa7P4fr3S @YuyaArgentina ¡Y a mi me urge ir 😭 ya fue muchoooooooo! @BethziSepu @CarlaMorrisonmx Mi Carlita chiquita preciosa corazón hermoso. 💖 RT @JasumGomez: @yuyacst estoy vuelta loca con el nuevo video de hoy. ¡ᴠɪᴠᴀ ᴇʟ ᴀmor!  ¡ᴠɪᴠᴀ ᴇʟ ᴀmor! https://t.co/xUTDcwkBjx 😍✨ El TUTORIAL de este maquillaje es sorprendentemente HERMOSO y FÁCIL DE HACER👉🏽  https://t.co/Ke0Y79ODTj https://t.co/L7uNU6AN03 ¡Así me maquillo para las fiestas! 😍🙌 Te vas a sorprender de lo hermoso que queda  + PLÁTICA ¿MIS ESTRIAS? 😱💓😡😰 —&gt; https://t.co/Ke0Y79ODTj https://t.co/lzj9AXmNVY RT @Celyavs: @yuyacst 😍me declaro fan de este maquillaje✋🏼 te ves divina.💕💁🏻💅🏼\nNUEVO VIDEO: https://t.co/IOjexu3ks6 https://t.co/Q9ebMKesgB Nunca me den a guardar nada. ☝️ Mi nivel de despistez es irreal. 😭 🌴🐅. https://t.co/wGT4O6B8Ql Es horrible no querer pensar en algo, dormir... y soñar con eso. 😶 RT @Brenda_ReginaF: @yuyacst M E  E N C A N T O ! B E L L O! 💖💖💖 Esta muy perfecto el video de hoy!💖💖💖 Pique a aqui esta padrisimo: https:/… ⭐️Si eres de lxs que creen que nunca tienen que\"ponerse\"🤔✨🙏¡Tienes que ver el nuevo VIDEO!😱 https://t.co/H6bcDTzt9X 💓¡TE VAS A SORPRENDER! 🙌 https://t.co/zUXL5Yg1zs ¡Se está subiendo nuevoooooo 🎥 ✨😍! Únete a mi aventura y sal en nuestro video 🌴☀️🎥😱: https://t.co/8M0N5cvR8e ¡Guapuras lindas! 🙌✨❤️ ¿Me ayudan votando por esta foto? 👉🏽 https://t.co/1Gx8tTbJSO 😍 ¡Me encanta! Los amo mucho. ¡Vamos a la playa! RT @GermanReynaH: Vota por Atardecer en Valsequillo https://t.co/N3KgYL0Ts7 Quiero bailarrrrrr 💃... 😴💤... NUEVO VIDEO 😱 Ahora sí.... ¡No es secreto!  🙌💓 ¡Les comparto tooooodo aquí! 🙈 --&gt; https://t.co/lnwRyeCqjj https://t.co/gTAbk5FNfp ¡Viernes de video nuevo! 👏🏻🙌🏻 Les tenía que revelar mis secretos favoritos del momento 😍 ¡No lo vas a poder creer! https://t.co/UWhxFOB7xQ Creo de crear y de creer. ¡Vive hoy! Cada día es una nueva oportunidad 🙌. RT @Brenda_ReginaF: Más que lista, con ansias de conocerte mi bella 💖💖🌸 @yuyacst https://t.co/8lWl7Z4vGO Lluvia, a mi sí me caes bien. Que tus sueños ✨ pesen más que tus excusas. Dentro de ti guardas todo lo que buscas afuera. @MedardoSaltos No me funcionó 😖. Déjate querer. ¿Peinados y maquillajes que me tienen sorprendida? 👀✨Corran a ver mi nuevo video y ¡emociónense como YO!😱👉🏽 https://t.co/oKHqT20GtD https://t.co/myE5w3HHr2 @javierderma ¡Te quiero mucho mucho y siempre te lo digo pero te admiro totalmente ✨💓! RT @Brenda_ReginaF: @yuyacst Un día de estos si o si tengo que hacerme esta trenza❤️❤️. Me encanta!!! tiene un estilo original y único, sup… ¡Subiendo videooooooo! 🎬🙋🏽✨ Sí, si es contigo. RT @Aeromexico: ¿Estás listo para viajar por el mundo? Tú puedes concursar por #LaVacanteAM y ser la voz de @Aeromexico. ✈️✈️ https://t.co/… RT @mofloresb: Las 💯 #Mujeres más Poderosas de México 2017 | Agradezco a @Forbes_Mexico esta distinción y mi reconocimiento para todas. htt… ¡Fuera pensamientos negativos! 🌟 ¡La vida no es fácil, pero depende de nosotros cómo queramos vivirla!  🙌💪🏼 ¡ÁNIMO! https://t.co/2L8fdIb2dV RT @paugutierrezros: ¡Estoy encantada con esta idea! Cool, moderno y con mil usos🌵 soy fan @yuyacst ✨🙋🏻https://t.co/HIuLkGf9nt https://t.co… ¡Tienes que ver lo que hice con MI CUARTO! 😍😱✨¡TE VA A ENCANTAR! 💓👏 ¡Tú también lo puedes hacer! 🙌 MIRA POR AQUÍ: https://t.co/wJlIfXO0zj https://t.co/WMbBH3FlYx Un día a la vez. Ratona 🐭. -Oigan esos aretes me los compre en una venta de garage y me creo la súper muy muy… https://t.co/wLG3w6nzm8 RT @YouTubeMexico: Acompaña a @yuyacst en su cambio de look 💇✨😍 y cuéntale qué te pareció ▶ https://t.co/LJREb1nPiB. https://t.co/ZyQTlSjRCq ¡ME CAMBIAN EL LOOK! ✂️ 💇 ¡No sabes los NERVIOS que tenia! 😰 Mira todo lo que paso AQUÍ 😱 ---&gt; https://t.co/a7fc34tBgq https://t.co/O5haTKrfTT ¡Ayuuuuudaa! 🙌🏽 ¿Qué video subo hoy? 🤔 RT @drawingsleidy: ¡Espero que te guste!🌵❤️ @yuyacst https://t.co/p5vgVZBrP2 Ya de regreso ✈️. RT @PonchoMunoz: Aquí algunas de las 100👩👱👧 #MujeresPoderosas de @Forbes_Mexico Felicidades y 👏 Vanessa, Mónica, Saskia, Yuya ...ustedes lo… 😛 Hola. https://t.co/5iD058gRml Vuela. ☁️ https://t.co/9r6XYzTM4v RT @paugutierrezros: 🍋Estoy encantada, una presentación hermosa y el un óleo súper rico @yuyacst muy orgullosa de ti.🌸💕 https://t.co/I8wWhQ… \"La chica del pórtico tiene miedo de dejarlo\" https://t.co/n8JBJNThld Que esta casualidad nos dure para siempre. ¡Son un gran equipo @STOMPNYC 👏❤️️, díganles que soy fan, quiero verlos mil veces más! 🙌 Estoy emocionada. ¡Ahora si les puedo hablar del secreto que tenía! 😱💓 ¡Gracias por ser parte de todo lo que hago! 👏 MIRA AQUÍ: https://t.co/A2zxXY9gmt RT @AndrreaCastillo: En esta parte del vídeo te ves tan bebe que me dan ganas de abrazarte y cuidarte ahr @yuyacst https://t.co/zpfYtATWBh ¡Gracias por apoyarme tanto! @Bere_DML 😍 RT @Guapura_Forever: ¡NUEVO VÍDEO!\n¡Por fin les cuento mi secreto! 😍👉 https://t.co/H7k1JxAsw2 👈 - De: @yuyacst https://t.co/ND9Ior0Fhm He sobrevivido fuera de mi zona de confort 💪🏻. Enamorarse de uno mismo. Eso. ¡VIDEO NUEVO! 🎉 Acabemos con los helados aburridos 🍦🤔y hagamos algo ENORME😍 y súuuper rico 👌🏻. https://t.co/0pWAXBQuyA https://t.co/36KoajBVfZ Eres la mujer de tu vida 😌. Cuando amanece quiero verte todo el día. @rebeQiih ¡Jajajajajajajajajajaja Rebe! RT @YouTubeMexico: Ropa nueva y ¡¿sin gastar?! ✨ @yuyacst te trae algunas ideas para renovar tu closet ▶ https://t.co/yhxOe2mtCK. https://t… No encontrarás un camino ya hecho... ✨🙌 La vida está hecha de pequeños momentos como este. @_AlyVenegas 😍🎉🎈 Caro, te amo. Este fin estuve casi desaparecida porque salí de mi ciudad y olvide el celular en mi casa 😰, fue liberador pero los extrañé mucho. 💖 Soy muy mala dando sorpresas 😖 siempre me cachan. RT @ricardomorenovz: \"Estamos aquí y ahora para ser los mejores para nosotros mismos\" - @yuyacst para #ForbesMexico Los siento aquí a mi lado 🙌🏻. Transforma lo bueno que piensas, en lo bueno que haces. Cuando me miras con esos ojos... En ti están todas las respuestas que necesitas. Cambiándome el look después de mil años después 🙋🏽✨les estoy enseñando en mi Instagram 💕💓 Yuyacst ¡Nervioooooos! 🙊 ¡Ya hay nuevo video!Uno de mis looks favoritos 😱✨¡Rápido, fácil y bien naturalito! 😍 ¡Makeup No-Makeup! 👌💜Mira aquí: https://t.co/BFvwkxKSsW https://t.co/BpePepG4Jq Lo que das con el corazón, lo das para siempre. ¡Graaaabaaaandooooo 🎬! Suelta lo que te incomoda ✨. Mereces el amor que das. @LuisEnriqueUc_ ¡Mío mío mío, feliz cumpleaños 🎂🎈🎉 otro año más juntos! Nada es por casualidad. Tenerte cerquita me hace feliz 🙂🙃. RT @daniielaatm: Es muy lindo acompañarte en tu día a día, transmites una vibra super linda. Me encantó el nuevo video @yuyacst❣️ https://t… ¡SEGUNDA SEMANA JUNTOS!🙌 💕  ¡Mis hijos me dan un regalo! 😱\n¡MIRA! ----&gt; https://t.co/c3tAW2fgqr https://t.co/xad7PeTWiK ¡Hoy video NUEVO NUEVO NUEVO 🙌✨💕⭐️👌! @benshorts @betopasillas Chócalas ✋ @AndrreaCastillo ¡Te quiero más de lo que te imaginas, feliz cumpleaños chiquitinga bella! 💜 JUNTAS Vitamina D.         ☀️ https://t.co/fUZVv9tW1O Me vuelvo inútil cuando me clavo con series. Rodéate sólo de quienes te quieren ver crecer. Ven, vamos a querernos. Plan de hoy: dejar que las cosas fluyan. 🍃 Actúa con presencia. 🙌🏻 Te enseño a hacer nuestras propias mascarillas MÁSCARA✨para tener nuestra piel bella 😍 ¡ME ENCANTAN! https://t.co/VmiJNjmvbM https://t.co/EAAMIwkkzn Inspiración, apodérate de mi. Quiero que todo me valga aunque sea un poquito. Tengo una cita contigo 😏. Mañana video a las 12:00 🙂, no les fallo. 💖 ¡Les va a encantar! Le estoy echando mucho amor a los nuevos videos que verán en los próximos días. 🙌🏽✨💖 Sólo quiero que sepan que siempre voy a preferir subir un video de calidad que subir contenido solo porque si,para mi eso no tiene sentido. He tenido algunos problemas, pero gracias a Dios poquito a poquito todo se acomoda y tiene sentido 💖. Les quiero pedir una disculpa muy grande, últimamente he fallado con mis horarios y días para subir videos... ✨✨🌈🌈🌈✨✨ ¡Viva la gente que lo da todo! 🙌🏻 No me olvido de quererlos todos los días. Que no se les pase ver el 1er video 🙌🏻 💕en el que me acompañan durante TODA la semana✨ 😱 Paso de ¡tooodo! 🙊 https://t.co/65YZazpkkw https://t.co/ucl4ypxo4m Aléjate de lo que te aleje de ti. Te quiero descubrir. NUEVO VIDEO 🌴 ¡Que emoción! Mi primera vez con ustedes juntito a mi por una semana 😱😍 ---&gt; https://t.co/KmdodF8Fin https://t.co/rQaRmMDvpe ¡Pero el video de mañana está quedando cooooool ✌️! Quiero llorar de tanto sueño y de no poder dormir. Todo tú. @deenuvm ¡Cuéntame lo antes posible, Dany reina de los remedios para picaduras de mosquito! Además de estar sensible, hoy me atacaron miles de moscos en los pies y piernas. SÚPER mala combinación. No pasa nada amigos del club sensible, TODO PASA, T O D O. Oigan, ya siendo súper serios... ¿No sienten que en esta época están más sensibles que nunca? 🤔 También te quiero a ti, pero eso es obvio. Y quiero poder dormir. Quiero ir al cine ahorita y a la playa también. Últimamente necesito más abrazos. Sólo dame una señal. RT @vmilandt: @yuyacst Me rei tantooo me completaron el día de mucho amor y felicidad los amooo💞☺️😻 Me maquilla el amor de mi vida ❤ en el video 🙌🏻 de hoy ¡No te imaginas cómo quedé! 😱✨ https://t.co/GuW00cfTqR https://t.co/FPUgf1Y4E0 😰 ¡Estrés sal de este cuerpo tan pequeño! 🌴🐚 Tomás conoció el mar, fue un gran día. https://t.co/ztK2nQLYaJ Hoy voy a grabar con alguien muuuuy especial 😍... Ni el tiempo, ni la distancia... https://t.co/MgWvwRrrK7 RT @impaovel_: Con esta noticia @yuyacst me hizo el día más feliz!  #Encantada La más hermosa de la vida! ♡ Noticia →  https://t.co/tis8STN… RT @eddierogelio: ¡Nos diste la mejor noticia del mundo, @yuyacst! 💜 https://t.co/DNwd32SSZ9 RT @paugutierrezros: @yuyacst Estoy encantada don la noticia❤️ ¡Descubre el notición que les doy en el video de hoy! 😱🙌🏻 Estoy tan emocionada que no lo puedo creer 👏🏻👏🏻😍  https://t.co/2wccmdeYSZ https://t.co/4v5JWklSwk Ya por fin se está subiendo 🙈😱... #FaltaPoquito Editando, editando 🙈✨... ¡En el video de hoy les voy a dar una NOTICIA que me emociona muchísimo! Tú me citas con tu cariño. @joocarlors 🙈 En Instagram soy ✌️ yuyacst 👁✨⭐️ https://t.co/CPBa9oAvEs ¿3 videos a la semana 😛😍? El punto de esta foto es que (en mi mente) había dos caballos hermosos \"muy cerquita\" de mi 🐴,🐴… https://t.co/i0P0gUykFk RT @turruk_: Yo en la vida soy @yuyacst https://t.co/t4aOLJXc0G Síganme en mi Instagram 🐰✨ ¡Los voy a llevar junto a mi! 🖤Yuyacst Estoy emocionada por mañana 🙈. ¡Yo cada que voy a hacer un EN VIVO ✌️️😎⭐️✨💓 NOS VEMOS A LAS 7:30 en mi canal de YouTube 💝! https://t.co/e7TW9WSs42 https://t.co/gwdK0FINC1 @CourtoisKeilaSV Si si siiiii 🙈💓 ¡Tengo mucho por grabar 🙃🎬! @maurg1 @betopasillas No nos casamos 🤔. La alarma para despertar me pone de malas. Bello por fuera y delicioso por dentro 💖🦄😊 descubre mi receta facilita para bebida de unicornio 😱 https://t.co/6lpgcwAKIs #NoMeQuedoAtrás https://t.co/NP1NDp2fWn @laurisgv_97 ¡Qué linda! 💝 ¡Muchas gracias Lau! RT @daniielaatm: Quedaste hermosa, ame el nuevo video💯 @yuyacst https://t.co/rgSie95MPh 💕💓💜 Descubre como hago mi propio maquillaje y ¡sorpréndete totalmente! 😱✨ MIRA AQUÍ: https://t.co/poBnnHd9fO 👏 https://t.co/yAjam0t4lj Y que nos lleve justo donde debemos estar 🙌🏻🍃... https://t.co/2aXQ98bfjq Tener días malos es parte de la vida de todos, al final las cosas siempre se acomodan, te mando un abrazo bien grande. ❤ ¡Te quiero mucho! Así que no soy un bicho raro que siempre está feliz 🙂 soy exactamente igual que tú... Días buenos y algunos no tanto ✨ \"Lo bueno que nos pasa\" y creo por eso otras personas pueden creer que \"todo es perfecto para los demás\" pero NO... Siempre intento ser positiva y disfruto todo lo que puedo... pero no siempre estoy feliz, redes sociales se presta a que compartamos... Muchas veces me los encuentro en la calle y también me llegan un chorro de mensajes preguntándome que 😱¿Cómo hago para siempre estar feliz? Les voy a contar algo rápido... 🙂 Y solo eso 🤗 se los quería contar para que de pronto dejen a un lado redes sociales y disfruten de lo real y valioso de la vida ✨💖🐤🐛🐜🕸🌲🌵 De pronto, antes de hacer esto sentía que si no llevaba conmigo el celular o no tenía internet...😐 me daba como un estrés interno jaja 💩 Tomé algunos días para estar un poquito más presente conmigo misma y la familia ✨🙂 por eso estaba un poquito ausente de redes sociales 💕 Me gusta la vida junto a ti. Se me unieron en mi canal de YouTube 18 MILLONES  ⭐️✨💜 ¡Estoy felizzz! 💓Les mando un abrazo a… https://t.co/HXK7k5g0B2 ¡Holaaaaaa! ⛅️¿Ya despertaron? 🙂 @ItsAllAlraight 👏 Acaba de volver mi amor por las estampas 🦄🐤🐋🐰🎟🍍☁️ ¡Ya hay nuevo video! 👏🏻🙌🏻 Preparemos y depilemos nuestra piel con cosas que tenemos en ¿¡LA COCINA!? 👀😱💝MIRA AQUÍ: https://t.co/R0nTW4vtSV https://t.co/WIBsI6CUKw ¿Qué haces? 🙂 18 💝. RT @RobertoAvilaL: Felices #18MillonesDeGuapuras estoy muy orgulloso de todo lo que haz logrado ¡a festejar! 👏🏼✨🎉 @yuyacst https://t.co/dxY… RT @NormaaG12: #18MillonesDeGuapuras 🎉 más feliz por ti no podría estar, te amo con mi corazón, felicodades mi yuya💕💫 @yuyacst https://t.co… RT @Alechavarriayb: Mi yuya ya somos #18MillonesDeGuapuras Y vamos por más🎉🎈! Te admiro mucho por tu empeño en todo lo qué haces✨, felicida… @paugutierrezros ¡No tienes idea de todo lo que te quiero 💕🎂 te mando muchísimos besos y abrazos enormes chiquita bella! 💝🎉🎈 ¡F E L I Z CUMPLEAÑOS! ¡Están locos con tanto amor que me mandan 💕 estoy enamorada de ustedes ✨ mañana armamos fiesta, aguántenme poquito a que regrese a la casa! ¡Qué súper emoción 💝😱me agarraron los 18 millones acampando en la lejanía y con -0 señal✨ me vine a conseguir un poquito para agradecerles!✨ RT @Luciianalu1: 1️⃣8️⃣,0️⃣0️⃣0️⃣,0️⃣0️⃣0️⃣➕ FELICIDADES BONITA 🎊🎉🎊🎉 @yuyacst Lista para enseñarles algo que me han preguntado por MUCHO TIEMPO 👏😱 entra estoy EN VIVO 💘 https://t.co/e7TW9WSs42 Hoy tenemos una cita!😉 💘 EN VIVO hoy a las 5 pm en mi canal: https://t.co/e7TW9WSs42 💪🏻😊 \n✨Les platicaré de algo que me han pedido mucho 😱 https://t.co/pDZltO6N4k Todo el tiempo te amo. ¡Nuevo video! 💕💪🏻: https://t.co/QQ068JVbfA  👏Hice unas casitas para mis mascotas de lo más cool 🤘🏻✨ ¡Quedó increíble! ¡AMOR TOTAL! https://t.co/7mrxpWTyvh ¡¡Lista para grabaaaaaar 😁💘!! De nuevo tengo hambre. ¡Hasta mañana 💖 te quiero mucho! 🏠✨💕 Mi cama me aclama. RT @16Fermiranda: Una con @yuyacst 💕💕 https://t.co/ggYasAUS1M 🚂 https://t.co/xN4ATeEpap Quiero un día de solo tirar flojera intensa. Me duele todo el cuerpo. RT @Ximeza1: @yuyacst Ya casi a los 18 MILLONES🎊🎊🎊🎊😬 https://t.co/mDVMf6ewY9 Cuantas buenas oportunidades dejamos pasar por no atrevernos... Maquillaje con productos de JUGUETE  😱 ¡Esto es lo que sucedió! ⭐️¿Funcionó o no? ¡Estoy sorprendida! 😨 MIRA AQUÍ: https://t.co/1Jn61QwJo2 https://t.co/Qtn0uhhorT ¡Esto fue lo qué pasó al maquillarme con esto! 😱 ¿FUNCIONA O NO? ⭐️ ¡Tienes que ver! --&gt; https://t.co/e7TW9WSs42 https://t.co/zmeqWz7mH2 ¡Ya me voy ✈️ nerviaaaaaaaa feliz! Tú. ❤️ ¡Guapuras de mi corazón! ⭐️ ❤Subí video nuevo y en verdad sólo les puedo decir...lo saludable nunca supo tan rico 😱😍 https://t.co/8JSOMkt7N8 https://t.co/RaVczWGvVE @paulenisb ¡Me encanta que te encante hermosa! ✨💕 ¡Tú puedes con todo! 🍀 https://t.co/TDGAZmFXzT ¡Buenos días a todoooooos! ⭐✨ @gwabiR 🤗✨ @Ruy88 @betopasillas ¡Jajajajaja tampoco te pases Ruyss eran las 5 de la mañana! ✨ ¡Regresa yaaaaa! 🙌 @tanyiita22 chócalas yo tampoco 😱 ni con cajones abiertos 😰✨ Soy muy egoísta a la hora de dormir, no me gusta que se duerman antes que yo porque me quedo sin poder platicar. No vas a poder creer lo que hice con mi cuarto 😱✨💛¡Te va a encantar, tú también lo puedes hacer!  FÁCIL Y HERMOSO 💜💗👌https://t.co/AIJByGMch5 https://t.co/BgDxapbBAN ¡El video que voy a subir hoy me está encantando 💕💜💗💛✨! ¡🍕🍕🍕🍕🍕🍕🍕! https://t.co/g7vBHcD39j Siempre tengo hambre. Me hace muy feliz estar en casa 🙂. Todo lo que damos siempre vuelve . https://t.co/1dVuUVuFvO @YuyaArgentina Después de tantos años juntas ya te siento parte de mi. ❤️ Te amo. @daniielaatm @paugutierrezros @AndrreaCastillo @GreeciaaDavilaa mías. @okokallison 😍🌹 Te quiero mucho. Bueno, mañana temprano checo lo que me escribieron del EN VIVO, ya dejaré esto en paz ✨🌟 ¡Cuánto los quiero! Mañana voy a estar en L FESTIVAL ❤️  cuando esté ahí voy a hacer EN VIVO ✨¿Por dónde les gusta más? ¿Facebook, YouTube o Instagram? 🙊 ¡No puedo creer lo qué pasó en mi cumpleaños! 😰🎂🎉🎈 ¡NUEVO VIDEO! 🌟😱🌟 https://t.co/jXejZ5NXgC https://t.co/RwkECaXF5O Sólo que no tengo internet y tengo que usar mis datos 😰.  Mañana veré que hacer para estar pegadita a ustedes 🙈✨💕 Ya llegué a L.A 🌟✌️❤️ todo cool. ✈️... Me quedé dormida mientras veía una peli,cuando desperté me sentía súper cansada,me fui a lavar los dientes,la pijama etc😑se me fue el sueño. Hasta en un ratito ✨🌜 descansa. ¡Ayudemos y unámonos hoy por Perú! ❤Todo mi corazón y fuerza está con ustedes. Busquemos nuestro centro de acopio más cercano. https://t.co/F2ESFGAMjX Si estás en esos días en los que tu piel se ve triste ,😱 te dejo este video: https://t.co/SEbjPriiPy 🌟 ¡TE VAS A SORPRENDER! https://t.co/7AfFMc13wS RT @betopasillas: ¡NUEVO VÍDEO!\n\"¿Qué está pasando conmigo?\"\n¡Espero les guste amigos! ¿Me ayudas con un RT RT porfa? 🙌😂 https://t.co/tl9Ce… Quiero café. Me gusta que llueva en la noche 💫 Mañana va a ser un buen día 🤗. ¡Acompáñenme a L festival! ✨🎉 ¡Estén pendientes de mis redes que hoy regalo otros 2 boletos! 💪🏻Checa las bases aquí: https://t.co/0TRtiq1RtX ¿Qué tal va su día? RT @joocarlors: @yuyacst Te hice esta sorpresa, Felicidades y pasatela muy bonito te amo mucho!🎉💕✨ Gracias por estar conmigo siempre! 🎈✌🏻#F… RT @dannapaola: Cumpleaños feliz de mi gemela perdida! 😜jiji Happy bday bonita! @yuyacst 🎉deseo mucho que seas muy feliz, y sonrías siempre… RT @PPTeamKaren: Tarde pero segura!! @yuyacst bonita FELIZ CUMPLEAÑOS!! Te deseo mucho mucho amor en tu vida y que sigas siendo esa chica t… ¡Gracias por todos sus mensajes, me siento tan feliz y afortunada! RT @rix: Yuyísima feliz cumple !!🙌🎉 Pásala cool y sigue inspirando a tanta gente. @yuyacst RT @Ruy88: Quiero usar estos 140 caractéres para felicitar a una de mis personas más queridas de YT para mí: @yuyacst !! Te adoro, feliz cu… RT @HelloImLana: @yuyacst happy birthday Yuyaaaaa!! Te mando un abrazo enorme desde LA 🎂👸🏻🎉👏✨ RT @AreMCC13: @yuyacst ¡Feliz Cumpleaños linda! ¡Te amo súper intenso! ¡Éxito en la Vidal!💓✨ https://t.co/LdkdGFNXhk RT @GermanGarmendia: @yuyacst feliz cumpleaños yuya!! Pasalo muy bonito! Te mando un abrazo fuerte y calido!! 🎉🎉 Me siento afortunada de las afortunadas. RT @kevsho9: @yuyacst feliz cumpleaños!! Ojalá pases un lindo día, te deseo lo mejor 🎉💙 RT @Juanjaramilloe: Feliz cumpleaños bonitos @yuyacst 💕✨\nDisfruta mucho y sigue siendo muy muy feliz 🎂 🎈 RT @betopasillas: HERMOSA, alegre, noble, inteligente, trabajadora, chistosa, responsable, amorosa, dedicada, eres todo lo bueno en este mu… RT @nabileahumada: Feliz cumpleaños a la más bonita y chingona de todo el Internet @yuyacst 💗 te deseo lo mejor y lo más bonito del mundo s… RT @Sergecast: Muchas felicidades hermanable, te amo demasiado 😎😎😎...\n@yuyacst 🎉 RT @SandyCoben: Felicidades a la guapura más guapura de las guapura @yuyacst! Te mando besos!! RT @teresuch: ¡Feliz cumpleaños chiquita bonita @yuyacst 💗💓 que sigas cumpliendo todos tus sueños!! ✨✨✨ RT @lupita14peace: Y que la vida te deje vivir muchos más!\nIncreíble, hermosa, única, 24 años de puro amor!💕@yuyacst #FelizCumpleYuya https… RT @GuapurasE: feliz cumpleaños a la mejor de toditas, mi persona favorita te quiero demasiado yuya gracias por tantas sonrisas.💗 @yuyacst… RT @GuapurasMty: Feliz y agradecida con dios de estar otro cumple contigo @yuyacst  FELICIDADES, TE AMO❤️🎉🎉🎉🎉 https://t.co/iOEi7wR2yL ¡Wooooooow 😱💖! RT @LuisEnriqueUc_: Felicidades a mi @yuyacst me inspira a ser una persona asquerosamente positiva ✨ #FelizCumpleYuya ¡Abrazos abrazos! 🙆🏻‍… RT @paugutierrezros: ¡A celebrar la vida!🎂 @yuyacst quiero que seas muy feliz, te mereces lo mejor del mundo, te amo infinito✨ Siempre junt… RT @RobertoAvilaL: Un año más contigo, ¡feliz cumpleaños! Gracias por ser la persona que eres, disfruta mucho este día. ¡TE AMO! 🎉✨@yuyacst… RT @AndrreaCastillo: ¡Feliz cumpleaños! \nestoy feliz de celebrar otro año mas de vida de la persona que me hace muy feliz @yuyacst #FelizCu… ¡Mañana cumplo años 😛✨🎂🕯🎈🎉 estoy felizzzzzz! Amo a mi familia, amo a mis amigos. Si no sabes que ponerte pero quieres verte súper cool ✌️️👁💖 ¡Tienes que ver el NUEVO VIDEO! 😱 LO AMOO--&gt; https://t.co/WWsztXwpVR https://t.co/ShAIux6HiM RT @joocarlors: @yuyacst 👁Estoy facino con el nuevo video, Todas la tendencias están super padres✨✌🏻. https://t.co/YOR8dPeMdM ¡Acabo de subir un video coooooool ✌️️✨💕! ✌️️👁🌟 Hola. https://t.co/6kM9V2X3iK Estas tiernito y chistoso. Tú eres el hombre celular. Falta poquito. Mi papá siempre me regañó por sonreír así, nunca me han quedado bien los bikinis y ver palmeras… https://t.co/Ffbre9NCcu RT @YuyaArgentina: Entra al facebook de @yuyacst que te enseña hacer diferentes cosas, como hoy una plantita colgante 🌴🌵 https://t.co/22SQZ… ¡Ya casi cumplo años ✨ 🎂 qué nerviaaaa amiguitos! ¡Hasta mañana 💫👁! @daniielaatm Jamás dejaría que alguien que no sea yo maneje mis redes querida Dani, se perdería el sentido completamente a lo que hago ✌️✨💕 RT @RobertoAvilaL: Oye, faltan 7 días... ✨🎉@yuyacst https://t.co/wgREtOUcqn @Mireyarubi_ Ay que hermoso, 💕✨ les mando abrazos y besos a los dos. ¿Por qué será? 🙄¿Será que ya me acostumbre y es tipo una adicción las ganas intensas de que me hagan cariños/masajes ? O sea, pero de una manera que hasta yo misma me caigo mal. Me siento en la necesidad de masajes todo el tiempo. @_kathalina13_  ¡Qué emoción ✨ mándame foto Katha 💕🐰! @FuckRubelangel Me encanta tu plan ❤️✨ @DulceHe23255917 😍 @montsegarciat Esooooo Mon 👏 ¿Qué van a hacer hoy? Apofenia. TODO SOBRE MIS CEJAS 😱✨ https://t.co/pOqxLbzCdc ¡Nuevo video! 😛💕 Marzo es mes cool ✌️. Me tienes encantada. Están muy chistosos y los amo. RT @Cactuyers: Madre e hija siendo bien lindas👐 @yuyacst. https://t.co/a4b1DuqyWy Más motivada que nunca 🤗. Y yo que te quiero tanto. RT @GuapurasDeYuya4: No 6, ni 5, @yuyacst nos da ¡7 TIPS QUE TE VAN A FACILITAR LA VIDA😱✨ Checalo aquí 🌵👉🏼 https://t.co/chOPq28q1J https://… @julimoyano14 Lávala hermosa 💕 yo la lavo todos los días con jabón antibacterial líquido (el que uso para las manos) ¡Qué sueño! ¡Hola 🌼 lindo día! https://t.co/8OHeTLF9Of @laura_makeup Mi Laurita bella, te mando un abrazo muy grande hermosa 🌻✨ Tus ojos y todo de ti. https://t.co/B0QoNLxY7P ¡Ven lo antes posible! No había visto que me llegan mensajes por Instagram de ustedes 😱desde ayer no paro de leerlos  💫🕯 ¡Realmente deseo que hoy tengan un día súper lindo! 🌟 Los quiero tanto, gracias por aconsejarme y dejarme liberarme un poquito con ustedes, linda noche. 💕✨🌟🙌 Les juro que soy súper tolerante, pero no puedo con la gente doble cara. ¿Qué se hace cuando tienes que convivir a fuerza con alguien que no te gustaría ver? RT @daniielaatm: ¿Quien quiere un superhéroe cuando tiene a su abuelito?👴🏼✨ @yuyacst https://t.co/EF9LBQo67O ¡La gocé! Mío. Siempre caigo en los mismos errores. Hoy mi abuelo cumple 80 años y no le puedo pedir nada más a la vida. RT @Carpreingg: Es cierto lo que dice @yuyacst todas las mamás dicen \"vino\" a todo lo que tiene alcohol 😂 RT @YuyaFcoPeru: No puedo más de la risa @yuyacst , ya vieron su nuevo vídeo guapuras ? 😂Este es el link 👉https://t.co/nn4MfXGmuq RT @froysarcastic: @yuyacst me identifique con tu historia de la primera vez que te paso, fue casi todo idéntico 😂 ✨👄🤘🏾👁 ¡Hablando de cosas ÍNTIMAS que nos pasan a las bellas MUJERES 😱mira el video: https://t.co/blBQjIk54S https://t.co/TBp06d2ayb @sofiabaquedano Súper si 😍 RT @Vanessarava: @yuyacst  Ameeee completamente el vídeo de hoy, jajajaj era más plana que la tabla de la mesa de la casa, amo todo de ti m… Bye, bye de nuevo 💇. @ZurilobosKeila ¡Siiiii 🙈 mándame foto cuando termines, te quiero! Y ya... me desperté porque me di cuenta que estaba moviendo la cabeza sin sentido alguno. (Ahora sí dormiré 🙃, hasta mañana) Una voz de mujer peruana me estaba dando instrucciones mientras yo realmente con la cabeza decía que si... Estos días recibí tantas instrucciones que estaba en el limbo de quedarme dormida y en mis \"sueños\" ... Hasta mañana 🌟. México México México México 😍. Tengo tanto sueño que me parece irreal, hasta mañana 🌜💫. RT @maytehb01: Estuvimos desde las 9:30am😭eres muy linda tierna y sencilla te amo eres mi idola💞👑@yuyacst https://t.co/dbqXGE4zl0 RT @daniielaatm: Me voy a tatuar la fecha de hoy en la frente, eres una persona genial te amamos demasiado❤️ @yuyacst https://t.co/JRmEsGlH… Háblame de ti. RT @perfectmariand: La más bonita vía instagram stories.\n ⠀⠀⠀ ⠀⠀⠀⠀((@yuyacst)) \n⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀ ⠀⠀🍃🍂 https://t.co/lzZXLiEgoI RT @GuapurasPeru_: Hoy @yuyacst con una Guapurita😍😍😍💕💕 https://t.co/53j01UhLhV Hoy me dieron muchos besos. 💕🤘🏾 https://t.co/k7ljlThNjF RT @daniielaatm: JAJAJA cuando no prendía mi camarita aun no lo supero:( @yuyacst https://t.co/6Nzy6PQalL @RobertoAvilaL Espérate mi Robert, estás viendo que no me dejan decir y me presionas. 😍😝 Te amooo como loca. @AndrreaCastillo Me hago del baño 🚽. Jajajaja te amo. RT @joocarlors: @yuyacst te hice este pequeño regalito espero te guste! 💕✨🍃🌸 https://t.co/HXCkWSkYIg Pero no crean que cualquier emoción. Ósea emoción de las que gritan y se abrazan ridículamente. Así. Me mata de emocion.  🙂 Pero emoción de la loca, cuando una amiga está saliendo con un buen prospecto. Solo que en realidad si digo groserías jijiji. Así es, esa mujer asquerosamente posotiva que ven en los video es la que soy en la realidad... He vivido así toda mi vida por qué mi mamá así me enseñó,pero algunas veces me causa algo feo no poder hablar cuando algo me hace sentir mal Lo dejo pasar y pienso que al final quien hace el mal se le pudre el tamal (en palabras normales) creo en el karma. Es decir, siempre dejo pasar todo lo malo y si alguien me hace sentir mal o me hace algo que realmente me lastima... Tengo un problema irreal en demostrar mis sentimientos negativos, es decir me mataaaaa causar problemas o hacer sentir a la gente incomoda. @jorgeluisfarfan ¡Jorge perdón, no estoy en el hotel 😞 te quiero mucho! Ahí les va mi drama pa' que opinen... @YuyaLaMejor3 @ulisess_Cast 👺👺👺 Cuidémonos como la gente que se quiere. ¿Un mini EN VIVO por Instagram? ❤️ yuyacst RT @12010_Alejandra: @yuyacst fue demasiado lindo conocerte 😍🖤✨ https://t.co/RopwBidWHd RT @GuapurasPeru_: Hoy nuestra pequeña mamá Guapura @yuyacst con fans💕. https://t.co/nXjPWBVxC7 RT @daniielaatm: AYYY ME ENCANTO VERTE YA TE EXTRAÑOO AYY TE AMOOOO❤️❤️❤️❤️❤️❤️ @yuyacst https://t.co/8IKwJRgBFt ¡Bueeeeenos días 🙂! ¡Siento que el mundo me abraza, estoy feliz! https://t.co/sAySkFJtfp ✈️ Me gusta verte brillar. La próxima semana parto a Perú mi amor chiquito, precioso, comida deliciosa, gente hermosa, amo amo.   ❤️#VoyATrabajarYAComer #Jiji Soy del tipo de persona que festeja que hace mucho tiempo no le pasa algo y al rato me pasa lo que no quería 😰. Hace mucho no me da migraña 🙂 me creo muchísimo. FIN. 👏 Mi papá y el señor estaban atacados de la risa y yo en el interior quería llorar mucho, pero me aguante 👆. (El señor estaba a un lado de mi papá) así que rápido fue a mi rescate. Cuando regresé, lo único que quería era dormir de nuevo, y me confundí de señor y me acosté cuál bulto sobre él 😭. Entonces le dije a mi papá que yo podía ir solita al baño(me sentía grande y preparada para hacerlo) así que me fuí en modo medio dormido. La única vez que recuerdo haber ido al cine con mi papá, me quede dormida, así en sus brazos como bebé, necesitaba ir al baño... ¿Les cuento otra peor? Y mi abuelo fue a sacarme de ahí 😖 me dio mucha pena porque la dueña del carro me observaba de lejos. Siempre he tenido el problema de confundirme de carros 🚗, un día cuando mi abuelo fue por mi a la escuela me equivoqué y me subí a otro. Y NO era el carro de mi mamá, era un señor 😰, decidí que la mejor idea era salir corriendo a mi camioneta y esconderme por horas. Me acerqué silenciosamente hacia el carro que juraba que era el de mi mamá y le grite al cristal pensando que ella estaba dentro 😰 Acabo de hacer el oso, pensé que me había encontrado a mi mamá en el estacionamiento del súper 😭 RT @itsximenar: @yuyacst Te arregle la foto https://t.co/Ki99xHyZNg ¡Termina con el pelo de leona/ FRIZZ para siempre 😱💕🦁✨👏! No puedo creer que sea tan FÁCIL 🙌  --&gt;https://t.co/VdnNGA9hvO https://t.co/bUHIyIWGEc Es real cuando les digo que mi mamá me pasó el gen de tener el pelo de leona 🦁Solución para despedirnos del FRIZZ 👉https://t.co/VdnNGA9hvO Son buenos días 👁⭐️. https://t.co/Q19OCd2MdG @yuyacst Tu corazón es la luz que alumbra mi camino !!! Estoy feliz, tan feliz, tan feliz, feliz, me haces sentir feliz. Te has convertido en parte de mi alma. RT @susethvilla: @yuyacst no sé si reír o llorar 😰😂💘 jaja pobre Tomas https://t.co/8RXHZ63XfM @SteFiaLarcon Somos la una para la otra 🙊💕 CUACK ✌️ https://t.co/5dNSwTvH0x ¡LO TENEMOS, LO TENEMOS! 💪💕Nuevo video de #PuntoYAparte 👉 ¡No sé que me pasó, me espanté horrible! 😰 --&gt; https://t.co/5dNSwTvH0x https://t.co/fnx11WANTn RT @xmarielaaax: @yuyacst Esperando el nuevo videoooo💕🙌🏻 https://t.co/TATXGIPA1b ¡Por fin por fin por fin!👉 SEGUNDITOS DE QUE SE SUBA UN NUEVO #PuntoYAparte 🙊💕✨🙌 https://t.co/yfGKgITql4 Unos novios comiéndose a besos. Te amo y te admiro. Tus ojos son mi fortuna. Todos tenemos un amor que nos complica la vida. Espero tu regreso. Les mando un abrazo muy grande 🙂. Hola 🤗 lindo día, qué van a hacer hoy? Esta técnica para poner \"BASE DE MAQUILLAJE\" está impresionante, te deja la piel hermosa 👏✨💕 NUEVO VIDEO: https://t.co/8ypCzDROxy https://t.co/zvOGmkZEuH EN VIVO por Instagram 💕✨👁 YUYACST Quiero un cactus grandoototototote 🌵. @RoEnLaRed Linda 💕✨ RT @Celyavs: @yuyacst te la volaste con estas ideas😍👏🏼 woooow!🎉❤️\n¡4 IDEAS PARA SOPRENDER A TU PERSONA ESPECIAL! ♥ - Yuya https://t.co/yQl5… En fin, creo es parte de la vida y así suele pasar 😞 solo qué hay días como hoy que no puedo dejar de pensar. Hace unos meses me pasó algo que jamás pensé que me pasaría a mi, alguien muy cercana a mi 👹 era muy malvada y yo ni en cuenta. JAJAJAJAJA. RT @GuapurasUruguay: @yuyacst ¡LAS AMÉ! 👫💝 Si tienes pareja o le quieres regalar algo a alguien especial éstas ideas te van a ENCANTAR🌟\n\nht… 💖 Si quieren sorprender a alguien con algo cursi pero super cool👆, tienen que ver el nuevo video, LO AMO😱 --&gt; https://t.co/9rSQdbbkrF https://t.co/WasaELRTdP ¡Hoy subiré un video suuuuuuuúper coooooool 😛💖! Hola 🙂, soy la que cambia su foto cada 60 años. @daniielaatm ¡Jajajajajajajajjaajajaja se pasaron Dani 😂 te amo! Bueno, ya que estamos en eso, mi mini yo del pasado les desea una bonita noche, hasta al ratito 🙃. https://t.co/d8g8cRkKZ1 Mis amigas no se apuran 😂. Me urge tener un bebé en la familia (no mío) me urge, me urge, me urge, me urge, me urge, me urge. 😱 Y hablando de bodas, siempre me doy cuenta que me hace falta actualizarme en canciones nuevas de fiesta porque solo me se las viejas 👯. El fin fui a una bodita muy linda, siempre me encanta ver gente enamorada 🌹👁. https://t.co/HzLPC93WTa Siempre me da pena llorar en las bodas. Hoy es un día para festejar el amor y no hay cosa que me haga más feliz que eso.   👰🏻🎩   ¡Vivan… https://t.co/0KaqcJfRNY @Vanessarava 😍 La perturbadora historia de MI PRIMER BESO 😰✨💕 NUEVO VIDEO : https://t.co/uWkgxI8s85 https://t.co/sI5C4mr1si Extraño los en vivos 😔. RT @conchitacst: No quero chatiar, quero verte 😔. RT @paugutierrezros: Me puse a apreciar lo hermosas que son tus fotos y a editar un poco, espero te gusten, @yuyacst, te amo.🌺 https://t.co… ¡Amo esta idea! 👏💕✨¡Manera super cool para hacer una carta con movimiento!👬👭👫Mira el nuevo video, TE VA A ENCANTAR:  https://t.co/ogSGKasOpR https://t.co/dJQIuAx0MI Nervios locos 🙊¡Estoy a nada de decir EN VIVO el ganador del cambio de look!  ¡Ya te quiero traer a mi!⭐️ENTRA AQUÍ: https://t.co/NYpzlzbX6w Desenrédame. ¡Hooooola ✌️ bonito día! https://t.co/kSjOmes5G6 Te quiero comer la boca. Todo lo tienes pero nada sabes usar. RT @froylanmt03: @yuyacst Cada Fondo de los en Vivos 💓. https://t.co/B1mRpvlcms ¡No vas a poder creer que así puedes quitar los puntos negros de manera FÁCIL! 😰 ¡ENTRA, te lo cuento EN VIVO! 🙌 https://t.co/NYpzlzbX6w RT @luispedrazafans: Estamos esperando sus aportes Es una gran causa. Todo es bien recibido\n#FansUnidosXChile #LaVozDeUnLuchador https://t.… Mujeres hermosas. RT @kidrakridge: Te hice éste dibujo con todo cariño @yuyacst💛 ojalá te guste🌸\n\nall love💐 https://t.co/RkO2ERbpWb ¡EL SECRETO DE MI FAMILIA PARA TENER LA PIEL SUPER LINDA! 💕\n¡No lo van a poder creer! 🙌🙊\n Te voy a decir EN VIVO: https://t.co/NYpzlzbX6w https://t.co/X5YTfH7qbN Prestenmeeeee su cabello ☹️ ¡Quedó hermosa 🙃 ya le quiero pintar el cabello a todos 🙏! 💕✨ ¡NERVIOOOOOOOOOSSS! 😰 Le voy a pintar el cabellito a mi amiga por primera vez 😱⭐️ ENTRA EN VIVO PARA VERLO TODO: https://t.co/NYpzlzbX6w https://t.co/98yGAdldMP ⭐️¡GÁNATE UN CAMBIO DE LOOK JUNTO A MI! 😱 💖 ¡Ya quiero ir por ti!    *MIRA, MIRA 😱👉🏽 --&gt; https://t.co/S5iaKUT8ii https://t.co/KEZVDkdQHS RT @GuapurasDeYuya4: ¡Oportunidad para conocer a @yuyacst de la mejor manera! ✨https://t.co/ulADSUMw09✨mucha suerte, @yuyacst. https://t.co… ¡Tengo tortícolis (según yo) no puedo mover el cuello hacia un lado! 🙄¡Me desespero! 🐒 ¿Alguien sabe que se hace en esos casos ☹️? ¡En el video de hoy les tengo sorpresa 🎒🎩👔👛 estoy feliz por eso! RT @Guapura_Forever: ¡Corre a ver a @yuyacst en vivo! \n👉 https://t.co/2PVIuGfSfe 👈💖 https://t.co/Ak6H343wR0 💤 @GerardoH935 buenísima 👏 ¿Alguien me recomienda alguna película de suspenso buenísima🙊✨? NUEVO VIDEO 💫☄️✨⭐️ Maquillaje para resaltar tu belleza 🙊💕¡Te va a encantar! --&gt; https://t.co/tasrCNPUZN https://t.co/yBF1NeM7Il Les voy a fallar hoy guapuras, una disculpa, se pasa para mañana el EN VIVO, vino mi papá y hace meses no lo veía, espero me entiendan ❤️ RT @attackonfxngirl: Qué bonito es que yuya se atreva a hablar de éstas cosas, así, sin tabús. Muy bien @yuyacst https://t.co/QJa0E0DPRQ ⭐️Toda mi experiencia con la COPA MENSTRUAL  😰✨Mira todo por aquí: https://t.co/hR0E9U6QeL https://t.co/UFh5aADLOY Estoy enamorada de ustedes guapuras 🙂. RT @RNmariaisabel: Increíble, pero realmente me hicieron sentir mejor tus palabras necesitaba buena vibra gracias bonita @yuyacst 💫💓 ¿Cómo hice para que me crecieran las pestañas🐒💫? 👉TE LO VOY A DECIR EN VIVO, entra aquí: https://t.co/NYpzlzbX6w https://t.co/iKvH18kEq3 ¡Y en el EN VIVO de hoy, les contaré que fue lo que hice para que mis pestañas crecieran tanto 💕🤗💫🌻! (Nos vemos a las 7:00) Con este movimiento sensual de pastel de UNICORNIO, les cuento que estoy ENAMORADA de el  🦄💫💕Lo hice en segundos👉 https://t.co/2FPC2zMpVg https://t.co/pPuGQYrzgK Oigan, realmente me urge cambiar mi foto 😂 verdad? Mi abuelo me llamó para contarme que vio el EN VIVO y me creo muchísimo por eso 🙃. RT @lindagc94: Me fascinan los *en vivo* de @yuyacst! 🎥💓👩🏻 RT @FrancaGP: Muy enserio me acabo de enamorar de esa pizza a primera vista ❤️😍 @yuyacst @Elizabe614 ¡Yo también ya quiero que sea mañana para volver a verlos 💕✨, amoooo! 👬👭👫 RT @AndrreaCastillo: Amo tus en vivos con locura 😂 @yuyacst #CenaConYuya 🍝 🍕 ¡Vamos a hacer una cena romántica juntos! 💕 ¡ENTRA ESTOY EN VIVO 😋!\nhttps://t.co/2Yd4Sh3QYv ¡Hoy a las 8 nos vemos EN VIVO desde el canal! ☄️🍝Vamos a preparar una cenita romántica juntos 🌛🍽🕯💕💫 @Reggata ¡Comadritis 🐭estoy jugando con mi mente haciendo como que nada pasó, pero en secreto aún me duele, te mando abrazos! ¡No puedo de amor con los novios narrando los tutoriales de maquillaje jajajajaja 😂💖 🙈! RT @MaryJaramillo_: @yuyacst primer intento en la vida🎉 https://t.co/dsrfej0563 👉 ¡Estas ideas para ser experta delineándote los ojos te van a SORPRENDER !😱💫💕No puedo creer lo raro y fácil que es: https://t.co/O1yTslr6og Soy súper súper valiente 🙃✨ https://t.co/8IrAageFwO @RobertoAvilaL 👏 @betopasillas 😰 Hoy me sacan las muelas del juicio, pongan changuitos hasta con los dedos de los pies para que no me vaya tan mal 😰 @TroitinoXime ¡Eres muy linda Xime 🌟 te quiero muchísimo! Hola @benshorts ya te lo dije antes pero de nuevo muchas gracias, Tomás llegó a nuestra vida para llenarla de amor, me siento afortunada. 💫 https://t.co/IqDAuoYzph @yulianapl_  Súper bonita ❤️. ¡Me hacen sentir realmente muy feliz, los amo guapuras bellas! Me salieron granitos en la cara y te doy la SOLUCIÓN😱, mira EN VIVO por aquí https://t.co/NYpzlzbX6w  ⭐️¡TE VA A SORPRENDER! ¡Nos vemos a las 8 🌜💫 EN VIVO! ¡Hoy nos vemos EN VIVO por la noche desde mi canal guapuras 💕✨💫🙊🌞 les voy a enseñar a hacer algo muuuuuuuy cool! RT @paugutierrezros: Alguien que te mire como @yuyacst mira el delicioso pastel de unicornio.🦄🤘🏼 https://t.co/3Rna21A4Jp ¡Acabo de subir un video haciendo un pastel de 🦄💫 unicornio, es la cosa más hermosa y fácil de hacer del mundo! ✨💕https://t.co/2FPC2zMpVg https://t.co/zn056G0MVW ¡Les mando un abrazo muy grande 😊🌟 hasta en un ratito! RT @betopasillas: #1MillonBetoPasillas 🎈. Todo lo que hagas a los demás te lo estás haciendo a ti. https://t.co/NPHjckWwjC Grabando cosas bonitas 😋 ¡Este año estoy decidida a ser más organizada, gracias por mi libreta bonita https://t.co/CatFYJzoGd estoy muy feliz y dispuesta a trabajar! https://t.co/kwKMpsg7Yi ¡Entra a platicar conmigo EN VIVO, TENGO ALGO QUE CONTARLES! 🙋 👀  https://t.co/NYpzlzbX6w ¡Voy a hacer un en vivo por mi canal en Youtube para contarles algo , nos vemos en un ratito 🤗🌟✨💕! @jessideleon_  ¡No puedo con lo preciosa que es 💕🤗! Tú haces que te ame. @baeselenaz ¡🌟Chi Chi Chi, Le Le Le! ¡Los amo amo amo amo amo ❤️🌟! ¡Estoy trabajando en algo realmente emocionante 💕💫🙊 quiero contarles todo! @montseheva_ ¡Feliz vida Mon, te mando un abrazo grande! 🌟🤗🎂💕 ¿Qué van a hacer hoy? ¡Hola a todos chiquitititos ✨🌟💫 que tengan un día bonito! ¡Gracias por mandar su buena vibra siempre! 💫 Hasta en un ratito 🌻. No entiendo por qué a personas buenas les pasan cosas malas. Esta noche me siento muy triste. Tú fuiste como el agua. ¡Despierta! En otras noticias, me están saliendo las muelas del juicio. NUEVO VIDEO 🌟🙌🏻 ¿Qué me regalaron en navidad? 🎈¡ESTOY MUY FELIZ! 😱 https://t.co/sxro18h5NY https://t.co/q5o5OOJ35r RT @lupita14peace: \"2 horas después y ya somos 18 millones y no logro prender la vela\"jajajaja💕😂😂#FiestaDe17Millones @yuyacst  te amo https… @GuapurasMty ¡Jajajajajajajaja la risototota, amooo! 😂 @anamaalvarado ¡Muchas gracias 💕✨ te mando un abrazo grande grande! ¡Ya estoy lista para empezar el EN VIVO desde mi canal 🎂🎈✨ entra a comer pastel y a platicar mucho! https://t.co/NYpzlzbX6w https://t.co/BfqXZMrJoQ ¡En un ratito fiesta por mi canal 💕✨🎂 EN VIVO! RT @RobertoAvilaL: Amigos en la noche habrá fiesta en el canal de @yuyacst seguro será para festejar los #17millonesdeguapuras 🎊✨ ¡No se la… Me mata de la curiosidad que alguien este viendo algo en el cel atacado de risa y que no me enseñen la causa de la gracia. RT @MadianTelon: @yuyacst ya lo vi jaja me encanto, el último el más raro,  creo que me dio risa solo de pensar en ponerlo en mi cara mas v… RT @SofsAcosta: @yuyacst Presiento que esta sección será mi favorita RT @M01Ch: @yuyacst @YouTube Ya lo vi, wtf con la última jajaja ¡Poniéndome maquillaje con cosas MUY raras! 😱💖 Mira aquí si funcionó o no 😰 https://t.co/FyMr4kXsHL   ⭐️ ¡Quedé sorprendida con la última! Ya quiero llegar a mi hogar. RT @NormaaG12: #17MillonesDeGuapuras nunca dejare de decirte lo orgullosa que estoy de ti🎉💫 felicidades mi chiquita te amo con mi vida💕😭 @y… @GuapurasDeYuya4 😍 míos. RT @GuapurasDeYuya4: ¡La familia guapura crece!✨ y no podemos estar más felices y orgullosos de lo qué haces, #17MillonesDeGuapuras 💛 @yuya… Mi familia es la mejor. ✨ #17MillonesDeGuapuras RT @M01Ch: Mi yayas estoy tan Feliz porque ya somos #17MillonesDeGuapuras Gracias por tantas sonrisas y consejos te amo demasiado @yuyacst👏… RT @daniielaatm: Ya somos #17MillonesDeGuapuras y no puedo estar más feliz de saber que 17 millones de personas sonríen gracias a ti, te am… @joocarlocst 💕✨🐟 Te amo. RT @joocarlocst: @yuyacst #17MillonesDeGuapuras Te amo tanto! ✨💕🎉 https://t.co/CC3vkG7sTs ¡Mi estómago/corazón quiere explotar de felicidad! GRACIAS 🙏, en esta familia ya somos #17MIllonesDeGuapuras gracias, por su amor, por permanecer junto a mi ❤️✨.  https://t.co/2Yd4Sh3QYv https://t.co/e2JE5TBuuP Sentí como si abrazara a una tía, jajaja yo sé que está medio raro pero los abrazos de las tías siempre reconfortan. Estaba comiendo pizza cuando una guapura se acercó a mí y me abrazo 🤗❤️, sentí mucho amor. No puedo con la emoción de sentir tan cerquita los 17 millones 💕✨☄️💫 SUSCRÍBETE 🤘🏾 para unirte a la familia cool  🌟 https://t.co/2Yd4Sh3QYv @paugutierrezros 😍 Me gusta como eres. Este año quiero hacer algunos buenos cambios en mi vida. ¡Hagamos que este sea nuestro año! RT @GracyVillarreal: @yuyacst A por los 17.000.000!! 💪🏻🎉 Algo estoy haciendo bien en la vida para tenerlos a ustedes conmigo. RT @joocarlocst: @yuyacst Ya casi tu sorpresa que te tengo ! #17MillonesDeGuapuras 👏🏻✨🎉 https://t.co/L6Bw0ozANc ESOOO🎈Gracias a todos los que me están ayudando a llegar a los #17MillonesDeGuapuras antes de que termine el año👏☄️💫 https://t.co/2Yd4Sh3QYv https://t.co/4GJoZB1Kea RT @TroitinoXime: @yuyacst Ya casi hermosaaaa❤️🤧 https://t.co/quloPz0m20 ¿Si saben a cuál canción me refiero? Tambor, tambor, tambor de mi madre tierra 🤔 #NoMeAguanto No puede ser jaja tengo horas pensando en los 17millones mientras en el fondo de mis pensamientos suena la de, tambor tambor tambor ¡Nervios locos por llegar a los 17 millones, faltamos poquis! 💫✨¡ VAMOS, antes de que termine el año, si se puede 💪!https://t.co/2Yd4Sh3QYv RT @RobertoAvilaL: Todos vayan rapido a suscribirse para llegar a los #17MillonesDeGuapuras antes que termine el año, go. 👏🏼 https://t.co/q… Estoy tan nerviosa que quiero llorar 💕✨😱 ¿Lograremos ser 17 millones antes de que termine el año? ☄️🙌🏻SUSCRÍBETE https://t.co/2Yd4Sh3QYv https://t.co/Lm70DFjPMC RT @casiel_c: Ya Vamos a Llegar a Los 17M de Guapuras *_* @yuyacst  TE AMO!! https://t.co/40WsmteCyN Estoy ansiosa por contarlo todo. ¡Todo este año trabaje en dos proyectos realmente importantes y grandes para mi, ya por fin en el 2017 lo sabrán todo 🙌💫! @shawnsobriens JAJAJAJAJAJA ¡Ahora si, el último video del año! Confesando👆... ¿QUÉ YOUTUBER ME CAE MAL? 😱😱  ¡¡Aquí la respuesta!!https://t.co/RK9Cxli6Cn ¿Fue un buen año para ustedes? Quiero masajito de pies. RT @_AlyVenegas: @yuyacst SI GANÓ AMIGOS ENTREN A VERLO!!! ¡Me hacen muy feliz guapuras, quiero abrazarlos a todos de manera urgente! RT @josdallpxrfect: vandalismo nivel yuya: le baja a la palanquita despues de que José la regaño por grabar😂🤘 #TodoEsCulpaDeJose @yuyacst h… @lupita14peace ¡Jajajajaja Lupita! RT @daniielaatm: Cuando el profesor te encuentra usando el celular en clase😂 @yuyacst https://t.co/0h0twkNmby @nombrestontos ¡🎉 QUÉ EMOCIÓN, TE AMO! RT @daniielaatm: @yuyacst Vive y deja vivir, no seas como José #TODOESCULPADEJOSÉ RT @pawii2003: Hasta yo me asuste con Jose jajajaja #todoesculpadejose @yuyacst Hubieran sido memorables estas vacaciones pero #TodoEsCulpaDeJosé 😞🎲 https://t.co/ZCo6KSRhjW RT @shawnsobriens: @yuyacst debo confesar que también se me subió el azúcar cuando llegó José #TODOESCULPADEJOSÉ RT @Stephg_m: @yuyacst sin duda todos votamos por el \"ESTÁ ENCUERAAO\" como tú momento vergonzoso del 2016. 😂\nAunque lo del perro también fu… ¡¡ENTRA A VER MI JUEGO EN VIVO POR UN MILLÓN DE PESOS!! 🎲🎉🎰 https://t.co/ZCo6KSRhjW RT @_AlyVenegas: @yuyacst momentos incomodos en vivo: \n- ESTA ENCUERAO\n- *se asusta con un perro*\n- La regañan por grabar en un casino \n\n20… Falta poquito... ¡Va que va, entonces me pondré ropita de frío, cargo poquito el cel y nos vemos en el canal para platicar 🤗✨💕! Pero hoy podemos hacer un en vivo desde \"LAS VEGAS\" por mi canal de YouTube 🐒✨🔴 🌟 🤘🏿¿Qué opinan? https://t.co/2Yd4Sh3QYv ¡Chiquitos míos,  el video de hoy lo subiré hasta mañana para sentir que pasamos juntos año nuevo 🎉💫💕! ¡Los amo, los amo, los amo! ¡Me despiertan a las 7:00 💫 hasta al ratito! Espero que todo bien :). RT @joocarlocst: Siendo feliz en la familia!💕👏🏻 @yuyacst ✨ https://t.co/h6bMQa6ra9 ¡Hola, hola! https://t.co/pGv7Pi9VJC VIDEO NUEVO 💫 ¡Mis productos favoritos de todo el año 🎈👏✨! https://t.co/69uneLxDTx NUEVO #PuntoYAparte 💕☄️¡Estamos juntos toda la semana!🌟 https://t.co/k6xKt61GRv RT @_AlyVenegas: @yuyacst eres esa típica prima que le pega bien fuerte a la piñata y todos temen por sus vidas y se hacen para atrás ¡Hoy voy a subir #PuntoYAparte 🎈🐒💕 ya ya ya ya! Estoy feliz por este día. ¡Buenos días chiquititos! @Manuelablr ¡Manuela mía (me encanta tu nombre)eres hermosa tal cual eres, me siento afortunada de tenerte en mi vida, feliz cumpleaños 🎉🎈! 👏👏👏👏👏 ¡Que tengan una noche muy bonita, les mando mucha buena vibra a ustedes y para todos los que quieren! Hola hola hola hola 🐥👋 ¿Están felices? RT @joocarlocst: @yuyacst Me encantaron tus outfits❤️,Tienen que ver el video,me encanto!            ✨https://t.co/U4pxbHiDLs 👏🏻 https://t.… Cambiando de tema, ya me siento muchísimo mejor 🐥, hoy voy a subir un video nuevo y muchos de ustedes salen en el. Como por decir la gente que \"Ama a los animales y se la pasa compartiendo cosas del tema\" pero que no cuidan ni a sus propias mascotas. Amigos como me molesta la gente que no es coherente con lo que dice y lo que hace. ✨ ¡Llego Santa! RT @GuapurasDeYuya4: Vayan a ver cómo @yuyacst abre sus regalos en su Snapchat 👉🏼🎄 LAYUYACST ✨¡estamos felices! @joocarlocst ¡Gracias 💖🤗! RT @GuapurasDeYuya4: Está chiquita transmitió en su canal, vayan a verlo por si no pudieron estar✨ @yuyacst. https://t.co/gVL4wSuhnQ Me encantan. ⭐️ A SEGUNDITOS DE PICARLE, '' EN VIVO ''   https://t.co/2Yd4Sh3QYv ¡En unos 30 minutos voy a hacer un EN VIVO por mi canal de YouTube contandoles un SECRETO! 🙊🌟 @Ketnia_xD Estás hermosa 🤗. Le hacen falta horas a mis días. Estoy estresada. Ahora que te tengo aquí no quiero que pase el tiempo. Tu maleta y la mía ya van en vuelos distintos. @AlexXxStrecci Jajajaja 🤗✨ ¡Gracias, los adorodoro! @linamcaceres ¡Lina bonita, feliz cumpleaños 💖🐥 te mando un abrazo muy grande! ¿Y si en la noche hago en vivo para platicar 🙊? Oigan, propuesta indecorosa... Que suerte tu mirada. Yo me puse a pensar tantas cosas bonitas. ¡En un ratito súper chiquito voy a subir video nuevo 🤗💕✨🤘🏿! RT @Blcr20Liz: No puedo con tanto amor💛💛💛💛 @yuyacst ¡MI REGALO / INTERCAMBIOS / AMIGOS / PLAYA! #PuntoYAparte https://t.co/4b6zgJzFdU Hasta al 🐀. RT @xcutieobrien: Cuando de navidad pides algo y te dan otra cosa que no te gusta👎🏼 @yuyacst https://t.co/x9SHxsI3PY @Guapuramx ¡Ven a abrazarnos 🤗✨! Ahora si NUEVO VIDEO EN #PuntoYAparte 🌲¡Playa/ Regalos/ Amigos! ☁️ MIRA AQUÍ: https://t.co/JNS77kzLn7 ¿Me ayudas con un RT, RT? ⭐️TE AMO RT @josdallpxrfect: me recordó a cuando tenía ochos años y abría mis regalos desesperada JAJAJAJA😂 @yuyacst #PuntoYAparte https://t.co/B9Xx… RT @paugutierrezros: Los videos de #PuntoYAparte son tan bellos, es increíble la confianza que nos tienes @yuyacst, lo eres todo.💘 Ya casi, ya casi 🙊🎈 #PuntoYAparte ¡Bueno,entonces gracias por esperarme, esta quedando cool⭐️🐝🐻! Mientras pa' que no se aburran les dejo el anterior: https://t.co/cfzlSy28TB Ya casi está el video de #PuntoYAparte 🎈 ¿Qué hago? ¿Me esperan un poquito más? O lo subo mañana 🌲☄️ ¡Qué súper antojo de cine! ¡Hola, buenos días! 🕯 @Pau_Clifford19 ¡Mi Pau chiquita y bella, te mando un abrazo grande, feliz cumpleaños 🕯✨🎈! ¡Los quiero tanto! Mañana #PuntoYAparte 🤘🏿. @CourtoisKeilaSV Hermosa 🤗✨💖 RT @RobertoAvilaL: @yuyacst Tus en vivos siempre son cómicos jajajaj ahora fue tu bajada de azúcar por el perro 😂 Voy a hacer un en vivo  desde el bosque para que platiquemos un ratito, entren a mi canal 🌲✨ https://t.co/NYpzlzbX6w RT @salasgabriel: Estreno del videoclip de la canción \"Dame de tu amor\" que fue hecha con todo mi corazón https://t.co/Ri4WLmYTer ¡Aunque volví a dejar de ver después de mi cirugía de ojos 🌟☄️ ya uso lentes de nuevo y me siento tan feliz, YA VEO! RT @RobertoAvilaL: @yuyacst Día 2 y yo sigo sin superar tu video en vivo de el miércoles jajajajajajajaj lo veo y lo veo y no me cansó😂 ¡Voy a hacer en vivo por mi canal al ratito 🌟✨🕯☄️🙊! RT @joocarlocst: Estos videos me ponen muy feliz✨, Sube mas @yuyacst 💕👏🏻#puntoyaparte https://t.co/7W58z5UhpZ RT @daniielaatm: Soy super fan de Pato, es un niño muy feliz y divertido. Los amo a ambos✨ @yuyacst https://t.co/ZQa5QkWfWL Oigan.... y si subo video nuevo hoy de #PuntoYAparte ? 🌟  👽 ☁️ https://t.co/Vyo5ogMGJz ¡Oigan, qué onda con que @MakeupplusLatam te puede hacer diferentes maquillajes desde su app 😱✨☄! https://t.co/gtqqbqahH7 https://t.co/GIXZonNfAQ Dormiré ☄️ les mando buena vibra. No es cierto 🤘🏿🤘🏿🤘🏿🤘🏿 me da igual, solo fue mi momento de quejarme por cosas absurdas. Amigos, esta vida con voz aguda no es fácil. Oigan ya siendo honesta, que súper molesto que la gente me conozca en persona y me diga.... a ver habla con tu voz real. @andyan_time ¡ESTOY FELIZ por ti Andy 🌟💕 viva el amor y la vida! Ni la palabra \"garapiñado\" me cae bien. No les conté, pero hoy después de años volví a darle una oportunidad a los cacahuates garapiñados :(  y no. Estoy motivada para grabar de manera INTENSA. 🤘🏿🕯🌟✨ Hasta en un ratito. 🎄 Me emociona la navidad. 🍋 Estoy a nada de grabar mi video de mañana y hacer un EN VIVO por mi canal de youtube! \n💖  https://t.co/NYpzlzbX6w Regresé. La vida me dio el mejor premio, TÚ. RT @paugutierrezros: Tu video de hoy da ha convertido en uno de mis favoritos @yuyacst Hasta mañana 😌. ¡MI PRIMER MAQUILLAJE EN VIVO! ✨💖 #JuntoAYuya2 https://t.co/x33Pimg6sp ¡Voy a hacer un en vivo por mi canal de YouTube en unos minutitos 🙋🏽💕🌟! @DaciaVargas 🤘🏿💕 @Nayeli_9802 Qué linda eres Naye ☄️ Ando de fiesta con mi abuelo 🤘🏿. Volvamos al camino del amor. ¡Acabo de terminar el video de hoy, quedó DELICIOSO 🤘🏿😛✨! Amo a la gente con la que trabajo 💖. @paugutierrezros Amooooooo ✨💖 ¡Amo a mi familia 🙋🏽☄️✨! ¡Qué gente caray! No sé si siempre me duele el cuerpo o soy adicta a los masajitos. @soyrebbie ¡De nada Reb, me metí a espiarte, estás muy bella y me encanta tu sombrero 🦄👌🏿! RT @BriiZyy14: \"Si estas pasando un mal momento te recomiendo que agarres toda la energía buena que te rodea y sigas adelante\"\nMI FAVORITA… RT @shawnsobriens: No sabes cuanto necesitaba este consejo, sin duda eres la mejor 💕 @yuyacst https://t.co/eZsq8VH3fd Quiero un helado 🍦. Soy asquerosamente positiva. Nunca puedo dormir a la hora que me gustaría. ¡Una de mis épocas favoritas para grabar videos es NAVIDAD 🎄✨🎈! @gwabiR Me encanta lo que transmites  💖,🐒🐒. (Somos tú y yo) ¡Ahora si, a trabajar 💪✨🤗! Hasta mañana 🌛💫☄️. ¡No todo mundo es lo que dice ser y que MIEDO! @paugutierrezros Jajajajajajajajaja Hasta pensé en la explicación que le daría por haber destituido su obra de arte tan pronto. 🐒 Cambiando de tema abruptamente, hoy fui a la playa de nuevo, y temí todo el día pensando que me encontraría a la señora de las trenzas. Y tampoco quería decirle \"perra\" o \"perrita\".  🤔 Por cierto, siento raro decirle \"perro\" en lugar de mencionarla  por su nombre. :( Mi perro ronca tanto que no me puedo concentrar para dormir. ¡Días de sol, perros, cocos y mucho amor! 🌴🌊 https://t.co/q33kA6TDHc La felicidad de ver felices a los que quieres. 🙌 Eres muy talentosa 👏🏿 solo que a mi cara no le van las trenzas rockeras, me las tuve que quitar por qué me estaba doliendo la cabeza. Fue un placer interrogarla sobre su trabajo como si no hubiera mañana, es usted muy bella y debería de darse cuenta de eso... En fin, espero que la señora de las trenzas que se volvió mi amiga no ves estoy nunca, pero si lo llega a ver le dejaré un mensaje: Intenté tomarme una foto con mis trenzas \"rockeras\" pero por más que busque mi \"lado\" nunca lo encontré. Les juro que resistí lo más que pude ya que mi amiga (la señora de las trenzas) me dijo\"wooow pareces rockera\" jajaj obvio me la súper creí. Me sentí soñada aprox por 30 minutos, pero estaban tan apretadas que los ojos se me veían así --&gt; 😑. Hoy me hicieron trenzas en la playa ( soñaba con unas) después de unas 3 horas de mucha platica y jalones de cabello la señorita terminó... Chiquitas mías. 🌴🌊 ¡Hoy fue un día feliz! https://t.co/VmoKLCMZ9o Tengo tantas cosas que contarte. ¡CUÁNTO LOS AMO! Me quiere dar el tic del ojo. ¡Jajajajajajajajaja así me sentía yo también! https://t.co/1gBa5yihH8 ¡Recomiéndenme series 🙏! ¡Holaaaaaaaaa 🙃! Te conozco más de lo que crees. @_AlyVenegas ¡Ya que no me invitaron a los 15 de la Norms, mínimo a la posadita mi Aly ☝🏾️😂💕✨las amo! @GuapurasMty Llévame a tus bellas tierras ✨🤘🏿🤔. @YuyaArgentina ¡Ya lo vi pero tengo nervios jajajaj, ahorita te contesto chiquita bella 💕! @universoyuyita ¡🐥,🐥! @ferchiizrs 💖 Mi Ferchiz bonita. @Manuelablr ¡Te quiero tanto! @daniielaatm Juntas. Juntos siempre. ¡Mucha gente no cree en los demás hasta que les va bien 🤘🏿, que gusto que la gente no se detenga y haga lo que les hace felices! RT @_unidos_: ¡Gracias @yuyacst por unirte! Gracias a ti, somos más por una sociedad + empática e incluyente #DonaConciencia 💗 ¡Empatía y amor para todos por igual! 🙌💖 Guapuras quiero compartir algo con ustedes: https://t.co/vyqLNCxK8t ✨ RT🙏#DonaConciencia @_unidos_ ¡Qué fuerte amigos! 😱 Voy a hacer un en vivo por primera vez en youtube✌️¿Me ayudan checando si me escuchan y ven bien?⭐️Les dejo el link: https://t.co/2Yd4Sh3QYv VIDEO NUEVO 🌾🍂:  https://t.co/IOXZnHmLVZ https://t.co/mWBtUEteNy ¡Liiiistooooooooo! ¡Hoy subo algo cooooool a las 3:00 🍁☀️!  https://t.co/NYpzlzbX6w https://t.co/YycURwPreA Me gusta escribir a esta hora ✨. ¡Ustedes son bonitos, gracias por mandarme tanta buena vibra, me hacen mucho bien! Nadie como tú. @Marirjs Tú siendo tú eres HERMOSA 😍. Volverán a mi cara 🤓 lentes para ver. Regresé 💡 https://t.co/LYRNipkM0C Enloquecí en Instagram. @yenvazq ¡Mándame foto cuanto termines 💖, te va a encantar! RT @Clubdeyuya: Alguien que me mire como @yuyacst mira a su pedazo de pizza. 💓 https://t.co/lvYAVWy2UD En casa de mi mamá soy muy feliz. https://t.co/bPpKIzJp5g RT @LuisEnriqueUc_: Mujer chiquita con un corazón super grande y bonito ✨Después de 2 años nos volvemos a ver ¡Hermosa! Gracias por todito,… Disfruto mucho estar con ustedes. Siempre me pongo nerviosa de más. @Andy_019 ¡Qué linda eres Andy, nos vamos a encontrar de nuevo, salúdame! 💖⭐️☄️ ¡Hola chiquitos mañana estaré en un evento platicando junto con ustedes, pero no daré mi conferencia como han dicho por ahí 💕les mando amor! Tengo récord en olvidar contraseñas. :( Comparto mi vida con gente hermosa. @Ruy88 @betopasillas ¡Nosotros a ti más, vamos al cine! AMO. @SoniaLG2 ¡Jajajaja lo intenté ☝🏾️! ¡QUIERO MANDARINAS! AMOOO ✌️ https://t.co/Y5dxP6S78I RT @YouTubeMexico: 🎃 ¿Aún no tienes disfraz? @yuyacst nos trae una idea fácil e increíble ▶ https://t.co/JbedxRJj6m. https://t.co/ibyAQ6C1hj 😶 @CarlaMorrisonmx ✨ te mando muchos abrazos mi hermosa. Últimamente me siento muy estresada :(. Dame una cita. La historia de mi vida en todas las bodas. https://t.co/6rdYiRtS6w RT @lupita14peace: Mira yuyita ayer lo hice y está riquísimo!💓💓💓💓💓🍰 @yuyacst https://t.co/XC1rpS7pdw Quiero regresar mil veces a Morelia. 💫☄️ https://t.co/1PFck4KgQa RT @FICM: Alfombra roja @Yuyacst #FICM2016. https://t.co/YFBVAjgOc3 Nervios, nervios, nervios. ¡Nooo yo no me caso jajajaja, una despedida de soltera 💃🤘! Estoy organizando algo 👋👰... Mándenme videito haciendo preguntas con el #PlaticoConYuya  💕⭐️¡Quiero platicar mucho con ustedes y que salgan conmigo en el video! -Quiero subir un video junto a ustedes contestando sus preguntas, grábense con el #PlaticoConYuya 💖✨🌵  ¡Pregunten mucho 🙃 ya voy a grabar! 🐭 RT @GuapurasUruguay: NUEVO VÍDEO DE @YUYACST 🍰🍴 • Pastelitos súper ricos en 5 minutos • ¡Corran a verlo! 💫 -&gt; https://t.co/IVKg2D4SSo https… No voy a dejarte ir. @Manuelablr Te quiero mucho ✨ El mundo sería más lindo si fuéramos más empáticos. 😍 Tú me quitas los miedos. Tan lindas 💖 les dejó el link para que también puedan conseguir fundas bellas: https://t.co/CatFYJhNhD https://t.co/CSXZynB4Uw @Cajafresca ¡Y tú y tú y tú 💕💖✨! Bonita. RT @Aeromexico: ✈️❤️ ⚡️ “Conoce a Quetzalcóatl”\n\nhttps://t.co/PwyWCXdbWJ Yo a ti @Sergecast te voy a amar absolutamente todos los días de mi vida, feliz cumpleaños hermanable 🎈. Tus ojos. ✨☄️💫 https://t.co/CDhj0BrH1Q Esa sonrisa tuya. ¡Qué felicidad me da escuchar la música de Juan Gabriel ✨! Siempre quiero comer. No saben la felicidad que me da ir al cine 🙊. Hoy por ejemplo me pegue en la mañana y aún me duele. Hoy en especial quiero contarles que no pasa un día en el que no me pegue en el dedo chiquito del pie. Chi chi chi le le le. Un video que me pidieron por mucho tiempo 🐰💖🌵 ¡TOUR POR MI CUARTO!  --&gt; https://t.co/eiKjm8joyc        NUEVO NUEVO⭐️ Guapuras por motivos ajenos a mí no estaré presente en el evento de BeautyCon 😔. Lo que importa es que me dijo un comentario positivo 😊 decir las cosas buenas que pensamos de los demás genera cosas lindas. Fue un cumplido raro pero amable. El señor/joven que me está llevando a la casa me dijo que se me veían bien mis tenis. U x U jajsjajjajsjaja 😂, amigos siempre que me ponían eso en mi Instagram pensaba que era una carita, hoy mi vida cambió. ✌️✌️✌️✌️✌️✌️ RT @AldanaWay: @yuyacst es lindisimo verte! Lo que estamos lejos te sentimos más cerca, y no hay nada más lindo. Te quiero mucho ❤️🇦🇷✌🏻️✌🏻✌… ¡Muchísimas gracias por acompañarme y compartir conmigo,estoy emocionada y con muchas ganas de hacer más en vivos para platicar con ustedes! RT @AndrreaCastillo: ¡Me encanto la transmisión! Sentí como si estuviéramos tomando un café y hechando el chisme a gusto ☕ ¡muchas mas tran… ¡Estoy en vivo! 🐰 ¡VEN A PLATICAR! https://t.co/Ey0GDq1d6j RT @paugutierrezros: @yuyacst ¡hoy tengo cita con una lindisima persona y amiga, #TengoCitaConYuya nos vemos a las 08:00🙈👭 RT @RobertoAvilaL: @yuyacst #TengoCitaConYuya y me creo mucho 💕 Hoy nos vemos en vivo a las 8:00  en mi página para platicar 🙊\n ---&gt; https://t.co/Ey0GDqiNXR\n¡USA EL #TengoCitaConYuya si te unes 🌼 🙋! @paugutierrezros ¡Woooow qué bonito Pau, les mando abrazo! Y hoy mi hermano le llevo serenata a su prometida y escuche mientras me bañaba, casi me acuesto en la regadera a llorar posición fetal. 😍 Ahora estoy sensible quiero abrazarlos a todos. Ya perdón, es que lo amo y soy su fan. Me creo un chorro porque dice yo se escuchar y asimilar. Mi abuelo dice que la gente más valiosa es la que sabe escuchar. Quiero saber todas las historias de mi abuelo. RT @YuyaArgentina: Ya saben como vivir la vida Guapuras 💕🙈 @yuyacst https://t.co/ilK94rQNkX Qué emoción 😍. ¡🌜🐚⭐️🌼 NUEVO VIDEO, ''50 COSAS SOBRE MI'' 🙊🌺👽🌵!\nAquí --&gt; https://t.co/NwH4DnJkW6 Me esguincé el pie en mi primer día de ejercicio. ¿Qué van a hacer hoy? RT @PaoPoulain: ¡Felicidades @yuyacst! \nTe mereces todo el amor 💕 y todo lo bonito del universo 🌟✨...\nTe quiero mucho 💎💙 https://t.co/8yTxO… RT @gwabiR: .@yuyacst MUCHAS felicidades, beba!!! Te mando 16 millones de besos y abrazos 💙✨ @NormaaG12 ¡Gracias mi Normita! 💕🙏 ¡Eres hermosa! RT @HelloImLana: @yuyacst 👸🏻🙌🎉🤗 enhorabuenaaa! ¡¡¡¡¡ #16MillonesDeGuapuras !!!!! ¡Qué onda con lo mucho que me apoyan ☄️⭐️🐚👁 soy una afortunada! RT @joocarlocst: #16MillonesDeGuapuras lo lograste @yuyacst 🎉Estoy super feliz te tengo la primera sorpresa a un faltan,te quiero💕 https://… RT @RobertoAvilaL: No tienes la minima idea de lo feliz que me siento al ver todo lo que haz logrado, felicidades por los #16MillonesDeGuap… RT @YuyaVeneezuela: FELICIDADES MI YUYA. #16MillonesDeGuapuras !! disfrutalo de verdad te lo mereces felicidadees🎉❤. Te queremos mucho @yuy… ¿Oigan qué tan mal está que quiera grabar el \"50 cosas sobre mi\" pero ahora ya sin ser un bebécillo tan pequeño? NUEVO VIDEO 💫🌜🐚🌵\n⭐️Mis 6 pócimas para tener PIEL BONITA: https://t.co/0A8MJKizEr\n¡Tienes que verlo, todas me encantan🙊! En fin, siempre he creído que lo que nosotros pensemos y hagamos es lo mismo que atraemos. ✌️️ Simplemente siempre me causa algo feo, abrir mis redes sociales y ver que hay mucha gente tirando mala vibra al mundo. Y no lo digo por algo que tenga que ver conmigo. ¡Qué nefasto estar opinando por redes sociales sobre otras relaciones de manera destructiva! Ahora un perro está haciendo un ruido raro y no puedo parar de pensar que es la llorona o algo así. Me puse a ver videos de miedo y fue una terrible idea. ¡Ya volví 👁! @PaoPoulain Mi hermosa 🌻💖 @SandyCoben 😰💕 La razón de mi existir. 🌲 https://t.co/EVKQOmlEWk ¿Me urge cambiar mi foto verdad? Desde que nací casi casi tengo la misma 🤘🏽. ¿Alguien se opero los ojos para ver bien y después volvió a ver mal?  :( Jajajajajajajaja. Siempre te voy a recordar. Me frustra estar en un lugar y no saberme las canciones que ponen. @betopasillas Yo a ti más. 🤔 Me enamoro mucho. Te veo papá 👁. https://t.co/lZ3CI2LCCz 🙊 @luisitorey ¡Estoy muy muy feliz por los 3, muchas felicidades! 💕✨ Encuentro paz junto a ti. Qué alegría encontrar fruta deliciosa, confíen en mí, tienen que probar los @zesprilatam 💫🌟 ¡Delicia de delicias! https://t.co/5EGk3gVDWu Ven a mi 👀. Todo me gusta de ti. Por poderme mirarme en tus ojos bonitos. Mariand. @IvettlyOficial @conchitacst nosotras a ti 💕✨🙊 RT @paugutierrezros: Cuando estas enojada con tu novio y te abraza... @yuyacst 😂 https://t.co/ILKNROg5eK ¡Me gustas tanto! Un abrazo de mi mamá siempre es la respuesta. ¡Lo que no te haga bien, déjalo ir! ¡Estoy feliz fuera de lo normal 💫✨! Hola hola 👋🏽 ¿Cómo va todo? Entonces disimuladamente me volteo, me rio y ya después vuelvo a voltear la cara recargada de seriedad. Cuando me molesto por algo y me quiero hacer la enojada, siempre me dan muchas ganas de reír. RT @GuapurasDeYuya4: ¿Quieren ver cómo @yuyacst graba su voz en OFF?🎙, vayan a su snapchat💕👉🏼LAYUYACST✨. ¡Hasta mañana 🌛💫☄! RT @LuisEnriqueUc_: Que tu persona favorita, te diga que te quiere ver, es una de las 1000 cosas que creí que nunca me pasarían @yuyacst ht… RT @RobertoAvilaL: Luego no me pregunten por que la quiero y apoyo tanto, ¡eres la mejor! 😭💕 @yuyacst https://t.co/ZzDiFZJkbK RT @YuyaArgentina: Argentina te espera desde hace años, nunca lo olvides @yuyacst 💕🙉 #GraciasYuya RT @daniielaatm: Gracias por tomarte el tiempo de mandarme esto, te amo demasiado Yayas😍💕 @yuyacst https://t.co/Dn673BTtVk RT @GuapurasDeYuya4: ¡Gracias por todo el amor! Siempre estaremos para ti. Te amamos💛, @yuyacst. https://t.co/nCWCsYydok Les estoy mandando mensajes de amor 💕😗. Quiero dormir un poquito. ¡Qué cositas! https://t.co/o0zaCq2R3h 🌼🌼🌼 https://t.co/UJK0DNlQJg Hola 😊 Estoy muy triste :(. @Ruy88 😖😂✨🤘🏽 @EvaDeMetal 💕💕✨ @foolforthat Acepto ser tu amiga 🤘🏽✨🌺 @NormaElizabethO ¡Muchas gracias! ¡Qué día tan feliz! RT @Saba_mx: Una buena plática es básica en una pijamada y las guapuritas están en plena charla con @yuyacst. #SoñandoDespierta https://t.c… @RNG_94 Me siento cómoda y feliz 😊💕✨. RT @RobertoAvilaL: Cuando pasa la persona que te gusta y te saluda... @yuyacst https://t.co/4Ig2fZvGcG ¡Feliz de regresar a mi #PUNTOYAPARTE ⭐️ ¿A qué fuí a COREA? + Graduación feliz!  🎈 ¡RT SI QUERES MÁS👽! --&gt; https://t.co/k3emgpdjVl Falta poquito ✈️ 🇰🇷... RT @GuapurasDeYuya4: Todos en el grupo andamos usando el #FiltroYuyesco✨☝🏻️, @yuyacst. https://t.co/FMMkKLw6dD ¡Estoy editando algo con lo que les había estado quedando mal 🤘🏽✨⭐️ mañana lo subo por fin! ¡En SNAPCHAT soy \"Layuyacst\" 🌺✨⭐️👁! RT @fairytalesjdb: @yuyacst Nos podemos conocer de nuevo? te amo mucho ♥ https://t.co/gEmbOQVMwB La vida es bonita. Invítenme cuando se casen ☝🏾️. RT @LuisEnriqueUc_: Cuando estoy a punto de dormir pero @yuyacst tuitea https://t.co/2rNwCSLKjG 🐜 Creo que estoy descubriendo que la culpable de mi insomnio es mi cama. El destino. Qué bonito es el amor. RT @daniela266688: @yuyacst este filtro sin duda es tuyo nadie te lo quitara😍😍✋ https://t.co/DPlbRkG6zD Me dieron ganas de que sea navidad :). Días bonitos. RT @DenniseBau: Eres una de las mejores personas que he conocido😍te amo gracias por lo de mi cabello😊🙈 @yuyacst https://t.co/iUXqfFI4xL RT @GuillnMarijo: @yuyacst lo siento demasiado 😂😂\nTe amo❤ https://t.co/e7IsG5ozjS ¡Me siento llena de buena energía por tanto amor que me dieron hoy, gracias  infinitas por este día!  #AmoCostaRica RT @GuapurasDeYuya4: •Siempre nos sentiremos orgullosos de todo lo bueno que haces mi @yuyacst, no olvides que te amamos• https://t.co/LMQQ… RT @ItsDari: @yuyacst pues aquí fui la persona más feliz del universo, gracias, hermosa 💕 https://t.co/XCdtzgnwaG Me gusta ver gente feliz. @PaoPoulain ¡Te quiero más 👰 serás la novia más hermosa  💕✨! ¿Poooor? ¡Ya falta poquito para irme a Costa Rica y Panamá a conocernos ✨🌺🌟! @yelyahyoryi 🙈💕👀🌺 Miraditas bonitas. Realmente te amo con absolutamente todo mi ser. En el video de hoy les tengo 10 regalitos, para que se pongan atentos ✨🌺👀🙈🌟🌵. @UnPocoSobreYuya Gracias chiquita 🐭💕✨. @Rawvana ¡Qué fortuna coincidir en esta vida, te quiero muchísimo, feliz cumpleaños! ✨🌻🌟 Chiquitas dadoras de mucho amor y rasguños en las piernas. https://t.co/PBQwREBnPZ La gente agradecida siempre es más bonita. Me tomé un té que jura que dormiré pronto, entonces voy a poner de mi parte y cerrare los ojos 👋 hasta mañana. 👀 RT @YouTubeMexico: 💅🏻 Para aprender a cuidar tus uñas como @yuyacst, un nuevo video ▶ https://t.co/gWf6NgTRgL. https://t.co/S859ItYlt8 Hoy tengo ganas de quedarme todo el día en la cama. @mcmufiin 😍💕 ¡Mujeres hermosas 👏 se me pone la piel chinita de tan solo de pensar en ustedes, las admiro! 🌺@AleOrozcoLoza @PaolaEspinosaOf @Lolita_hdz @Ruy88 ¡Ruy por aquí te queremos realmente muchísimo, FELIZ CUMPLEAÑOS ✨🎈🎉! Quiero poder dormir fácil fácil. ¡Hoy no pude subir el video amigos, hasta mañana queda listo :( perdón!\n🐒🌼 ¡Qué nervios! 🌻 Hoy fue el último día de la #AldeaDigital @telcel @infinitum 💕recuerden twitear mucho sus selfies para tener una sorpresota✨ Pobre de abejita 🐝☔️ en SNAPCHAT: layuyacst 👀 https://t.co/TRKXQsHFu3 Y confundí el GRACIAS por el HOLA y durante mucho tiempo, salude a la gente diciéndoles gracias 😰 me doy pena ajena. Por cierto, aprendi algunas palabras en Coreano para poder ser amable según yo con la gente de aquí... ¡Me llevo la sorpresa más linda de la vida, la gente de aquí es tan amable, regresaría muchas veces si pudiera! Cuando estaba en mi Casa  ya por venir aquí, tenia mucho miedo, por ser una cultura completamente distinta, por la distancia, no lo sé... ¡Aquí en Corea todos me han tratado demasiado bien! RT @CarlaMorrisonmx: @yuyacst acabo de ver esto! De nada, eres una chingona! Una mujer que representa la fortaleza femenina y me emocionas… ¡Guapuras! ya va a acabar la #AldeaDigital @telcel @infinitum 😱 vayan y tomense muchas selfies muy cool, recuerden que cada tweet suma 📷💕 @CarlaMorrisonmx ¡Mi hermosa, gracias por apoyarme, eres una persona llena de luz! ✨💜 Nervios. Cada día te quiero más. Guapuras tengo sorpresas felices para ustedes  🌺✌#AldeaDigital @telcel @infinitum ✨ ¡Quiero ver sus fotos 📷! https://t.co/lsp3Js5xKP @PaolaKawaii12 ¡Si voy 🙈✨🌺 estoy feliz por eso! Oigan...y si intento hacer vlogs durante un semana, tipo de lo que hago en mi día y así 👀🌺... #PuntoYAparte Qué fortuna que entre el mundo entero me eligieras a mi. Guapuras ¡Tengo sorpresas!✌👀 📲Ve el video y twitea mucho suman para ganar! #AldeaDigital @telcel @infinitum ✨-&gt; https://t.co/tevUcoNEmJ 🍦👏👏👏👏 Si me quieren hacer un mal tremendo, denme de comer atún enlatado. Creo soy adicta a los masajes o algo así. Revuelves mis pensamientos. Todo lo tienes. ¡😂 Qué risa! Amigos si están pasando por algún momento difícil, quiero que sepan que les mando mi mejor en energía y que al final todo se acomoda. Amigos no hay días en los que sienten que necesitan mucho amor? Quiero ir a la playa 🌴☀️. RT @areli_ramos13: @yuyacst \"Quiero volar contigo, muy alto en algún lugaaaar\" #CancionesParaYuya RT @_AlyVenegas: @yuyacst \"no habrá un instante que no adore de tu vida, cuando nos volvamos a encontrar\" #CancionesParaYuya RT @ferchiizrs: Te lo digo desde el alma, con el corazón abierto, eres mi amor eterno, mi ángel de la guarda👼 @yuyacst #CancionesParaYuya ¿Por qué me están cantando amigos? No lo entiendo 😂💕✨ ¡Hola 👋! Me gusta Monterrey. Juntas por fin. 🌻 https://t.co/LEJpIZpJmr Voy a volver a ver a @conchitacst después de un mes 🙏✈️💕. Estoy feliz ✨. 👋 Los quiero mucho 💕✨😊. Gracias por cuidarme mucho. Hoy extraño a mis amigos de la primaria. Así mi vida... https://t.co/JHdOjRiaBE RT @lupita14peace: Qué onda con lo delicioso que está esto😻🌞 #andofresco  @yuyacst me encantooo! https://t.co/eEC5CQKyCM Me cacharon tomándome una foto y me dio pena 😰😁. Los bebés tienen el don de ponerme de buenísimas. Nadie más que tú. México bonito. VIVA EL AMOR Y LA GENTE CURSI POR SIEMPRE. Soy la llorona de las propuestas de matrimonio. @danielaguerral4 ¡Siiii, te va a encantar 👀🌺👅 vas a ver! ¡Ya me voy a mi casa 🙌! Quédate un poquito más. RT @RobertoAvilaL: Hoy hace un año iniciaste algo increíble en Chile y varios países. 💫 #truetour @yuyacst https://t.co/uXdwiFWZb8 ¡Pero todo esta bien, muchas gracias! \"NO TODO EL MUNDO ES BUENO\" Yuya, repite conmigo: Últimamente estoy súper molesta subiendo fotos a mi instagram: YUYACST🌻💕🌵 RT @GenchiNoelia: Cuando entro al sitio web de @yuyacst me olvido de todo el mundo🎈🤘💘. 👋👋👋 https://t.co/lLlRgLweQx ☝️👀 ✨ https://t.co/aWrWG6rJBd Ser feliz cuando el otro es feliz 🙌. Siempre hay tiempo para todo. Todos los días me siento afortunada por tenerte conmigo. 😏. Tus ojitos. Hablo de ti todo el tiempo. Me acuerdo de nosotros. Soy la más intensa en snap: ✨💃 LAYUYACST 🐽💦 No me esperaba jamás una historia así. RT @dianagala061: @yuyacst Recordando bellos momentos,te amo.💕👭\nEres la más hermosa. https://t.co/qPrJAcNxE2 ¡Los quiero abrazzzzaaaar ✨🦄 yaaaa! @RobertoAvilaL ¡Ahora si jaja sin palabras extra, soy la MÁS 🎂🍭🍿afortunada! RT @CosherAlan: @yuyacst @teamyuyagdl ya 15 millones felicidades yuya te amamos 😭👏👏👏💖🌵🌵🌵 https://t.co/jovj2hUAxc\nX3 RT @NormaaG12: Guapura orgullosa y feliz! @yuyacst \n#15MillonesDeGuapuras Gracias por tu apoyo y gracias por estar💖\nFelicidades! 👭✨ https:/… RT @Dafneyuyagr: @yuyacst Dioos! Ya Somos #15MillonesDeGuapuras Orgullosa De Ti Mi Yuyita Hermosa!😭❤️❤️❤️ https://t.co/vz4WkKc6HK @joocarlocst ¡Órale 👏🏼 te pasaste de cool 🌻 amoooo mucho! RT @joocarlocst: #15MillonesDeGuapuras @yuyacst 🙌🏼 mi yuyita muchas felicidades te quiero millones. 🦄☄🐚🌛⚖🌵💫👽❤️ https://t.co/Ud7S55jROq RT @_AlyVenegas: @yuyacst Estamos muy orgullosas de lo que haz logrado con tu esfuerzo, te amamos mucho! #15MillonesDeGuapuras https://t.co… El egoísmo no es cool. Estoy feliz amigos, ando planeando algo nuevo 👀.... RT @RafaelRDL6: Me quedo bien chula!😱😁🍪✨❤️\nGracias por la receta @yuyacst 😁👌🏻 #miramigalleton 🍪🍴 https://t.co/jatQnNQXLB Me urgen cambios. RT @Guapura_Forever: @yuyacst Vía Snapchat ✨❤ https://t.co/RNZX6WS68u Siempre soy la última en dormir 😑. No puede estar tan mal. La verdad si lo voy a cambiar en unos días porque si no va a ser imposible que lo pueda usar normal, pero mientras platicare con ustedes 👀👂🐚 Ando sin señal porque no ando en México, pero más tarde respondo algunas llamadas vale ? 🙈✌️😁  https://t.co/nvuTsqvTkA Me espanté porque me empezaron a llegar mensajes intensamente, 😂. Les quería compartir todo que hasta también compartí mi numero sin querer jajaja 😰✌📱💕¿QUÉ HAY EN MI CELULAR? https://t.co/nvuTsqvTkA Bye un ratito ✈️💫. https://t.co/6EHjn3pCxa Mi hermano y yo tenemos el don de no hablar y con los ojos decirnos cosas. Amigos, hoy desperté realmente muy muy feliz. La mera verdad es que quiero a mi mamá. ⚖ Me pone de malas no poder dormir. RT @joseciglesiasa: @yuyacst 🤘🏼✍🏼💙 https://t.co/WKTeA3wQVg Quiero ir al cinito. Qué estrés. Amo. Oigansssss, un notición 🤘🏻 ya voy a subir videos desde mi https://t.co/mDXboGELSc 🙋🏾⭐️👀 y también voy a hacer en vivos ahí  🌧 por fin Deus. Bueno solo cuando estoy súper sensible. Muchas veces meterme a Facebook me deprime. Holaaaaaaaaaaaaaaaaa 👋🏼 RT @YouTubeMexico: Mejor que comprar una cama nueva es construirla como gustes. @yuyacst te dice cómo ➜ https://t.co/Dfm2KqgLJh. 🔨 https://… En SNAP todo el día🦄💫: Layuyacst RT @joocarlocst: @yuyacst #cuellotremendo ✨ Te hice este collage te gusto? Pues a mi me encanto. 🙆🏻💫 https://t.co/mub4yGohYD Siento feo cuando viajo y me despido de mis perros :(. Dame un besito. Oye🌛💫👽 acabo de subir un video y te enseño a hacer CHOKERS que se ven muy cool, mira mira -&gt; https://t.co/wBAxg2UmZY https://t.co/Am6AjzSZtO ¡Ya te cache que activaste mis tuits! https://t.co/rP64PUqQdH :)..... Eres parte mía. Siempre cae mejor la gente que dice por favor y gracias  🌻💫. Mi corazón no se contiene. Me mandaron muy lejos. Hoy les propuse a mis vecinos tener gallinas en el jardín. 😌 ¡Feliz nuevo día 🙌🏽! 😁 Te amo con cada parte de mi @betopasillas feliz cumpleaños 💫🎈🎉🎂. Tu vida también es mi vida. 🌜💫. @Paugalindo Te mando muchos abrazos Pau muchos, muchos  ✨ gracias por el mensajito 💕 https://t.co/a7wx863qvY Lo bueno es que se me pasa rápido 🙋🏾. La verdad que trabajar en redes sociales y que nunca te afecte lo que los demás opinen no es tan fácil. 🙍🏽 La familia es lo más ✨ del mundo entero. Me sentía un poquito tristecilla, pero mi abuelo me marcó sin alguna razón solo para decirme que me ama. @JulissaBourne  ¡Qué linda Juli, gracias por elegirme para tu pastel 🌵☄🎂🍿 feliz cumpleaños! @melissalz83 🙋🏾 ¡Siento el alma feliz :)! 🦄✨💫⭐️ Mira cómo hacer tu propio iluminador fácil, puesto se ve hermoso ---&gt; https://t.co/IwghncY0El https://t.co/thjJjZQx36 RT @ximenasalinas_: Los iluminadores están muy padres tengo que hacer el mío ya😱✨💜 @yuyacst https://t.co/yaNrE5AtgW RT @liz_subias: @yuyacst Me encanta tu pagina 😍😍👌🏻 Cuando tenga hijos voy a ser la mamá más loca de amor por ellos 😁. Acabo de presenciar el primer corte de pelito de un bebé 👀 quería abrazarlo de tanto amor. @amante1_coco gracias voy a ir 😌 Quemetstequemetstequemetste. Siempre tengo migraña. Bye, fue un buen día 💫🌜☄ https://t.co/w5gdz29Pd8 Ustedes siempre son buenos 😌. Algunas veces se me antoja ser por lo menos un poquito alta. ¡Te mando vibra bonita, ánimo ✨! ¿Qué tal su vida ahorita? ¡Qué tengan bonito día 🙋🏾! RT @lupita14peace: Qué tal me quedaron?🌵🌸💖 @yuyacst \nMe encanto este tutoríal 😻 https://t.co/Nfxg1oEbDL @stephaniee_gzz ¡Te quedaron tan bonitos! Yo solo quiero un sillón masajeador. Siempre quiero masajito en la espalda 😑. Jamás había querido con tantas ganas, con tanta fuerza, como te quiero a ti. 🐀 RT @ferdebieber_: @yuyacst Súper ricos 😍❤️ https://t.co/hCw3XhrqBz Nunca te vayas. Algo para alguien 🎈 https://t.co/Iz5vIZBokT Bueno, lamento informarles pero estoy feliz de que alguien comparta mis males✌️, pensé que o era muy quejosa o me estaba inventando dolores. ¿A ustedes también les duele el brazo/mano/espalda por su terrible adicción al celular? Byeeeeeee https://t.co/J6KFqQgZTD Mucha gente con mala vibra tiene este mundo. Volví y no me voy a ir. #PuntoYAparte ☄🌚 https://t.co/V89HZVUQAL https://t.co/cKnhN9jyhl Por ti siento todo. Hasta mañana 🐿 😶 El calor me pone de malas. Como si te conociera de otra vida. RT @Sergecast: Destruir es fácil, pero construir algo si que cuesta. 💤 Acabo de subir VIDEO🌵 les cuento muchos secretos que sacan de problemas chiquitos🌺😥 https://t.co/d5mLmHqfxp https://t.co/d7jrUYUZwc RT @YunitaMonster: #sacalafoto @yuyacst Gracias Yuya por tus ideas! 😃 Quedó precioso 💜💜 https://t.co/s2PbxWAQqD 💕 ¡Quiero ir a un concierto 🙋🏾 ! Debilidad que me domina. ¡Yaaaaaaaaaaa! Hoy fue un día lindo con ustedes, gracias por llenarme de buena vibra siempre, me hacen bien. ✨ Quiero abrazo. Mi cama me aclama. Hola... RT @YouTubeMexico: ¡Felicidades, @yuyacst por más de 10 millones de guapuritas! El Botón Diamante es nuestro más grande reconocimiento. htt… RT @daniielaatm: Que bonitos se ven, y a cuantas guapuras y compradres harán felices hoy:)\n@yuyacst @Sergecast https://t.co/rCO75gnuKJ Y a las aceitunas verdes y a la mostaza. Pero la number 1, es mi vinagreta 😁. Toda la comida con vinagre balsámico. Tontería: Nunca les había contado, pero tengo un amor bien grande al vinagre balsámico.  🤘🏻 Pd: Les voy a llevar plantitas de amor 🌵✨💕🙈. ¡Los quiero tanto! De verdad chiquitos, gracias por ser el mejor equipo/familia 🐚💪 juntos. Mis guapuras quiero verlos en @YoutheringMx  estoy de verdad bien contenta por que voy a estar junto con mi @Sergecast ✨🙈 Ya te vi 🙊. # @YuyaArgentina Chiquita a mí también me urge eso dede hace años.  😭😥✨(Vas a ver qué pronto🙏) ¡En agosto a Costa Rica y Panamá para conocerlos 🙊🌵💕✨🤘🏻! RT @ELROLLOMORELOS: Vive la diversión al 3x2 en EL ROLLO Parque Acuático viernes 29 de abril 3x2 #EsteEsTuRollo #EchandoElRollo https://t.c… ¿Qué onda con el instinto que tenemos las mujeres? 👌 👀. ¡Trabajen intensamente por lo que quieren, por lo que los hace sentir completamente felices! Por cierto amigos de la vida, hagan lo que quieren, este mundo esta lleno de gente negativa, no necesitas que los demás crean en ti... Yo se que es una tontería pero me enfurezco. Jaja Me choca poner mi música al volumen que me gusta y que alguien le baje. ¡Tú puedes 💪! RT @betopasillas: ¡NUEVO VÍDEO! \"YO A LOS 3 AÑOS (Mi primer viaje a Disney) Espero les guste mucho, me ayudas con un RT RT RT Porfa?🙏🎉 http… 🙋🙋🙋👏 https://t.co/aiiJFvGkzM Gracias chiquitos. ¡Recomiéndenme una peli de amor bonito 🐥✨ se los ruego! Buenos días amigos 🐝 ¿qué andan haciendo? @mariobautista_ ¡Y yo orgullosa de ti 👏  por hacer lo que quieres y por echarle tantas ganas a lo que haces 💪 ! Quiero pizza y que me vengas a abrazar. @ElJuanpaZurita ¡Gracias por apoyarme siempre Juanpis ✨🙋🎈!"}