{"tweets": "Experts from Harvard Share Tips for the Perfect Cover Letter https://t.co/CKGr0gOiv9 American Horror Story' Creator Says Show Could Run for 20 Seasons https://t.co/nRDpXe53gj Take a Look at Iceland’s First Dead Glacier Captured in Satellite Images https://t.co/jz1xIGSZx6 Solve This Crime and Find out Which Famous Detective You Are https://t.co/2NzELcwcys Male turtles start masturbating when they reach sexual maturity.\n\nThey push their organs against hard objects and sometimes squeak while doing it. https://t.co/GyblkLW5Dd RT @UberFacts: Dragonflies are among the most adept predators on the planet.\n\nThey're lethal to other insects, missing an average of one pr… 1 million seconds is about 11 days.\n\n1 billion seconds is roughly 31.5 years. Cool Mom Leaves Honest and Hilarious ‘Instructions’ for Her Babysitter https://t.co/aPWWPlxcuD This is Shaquille O'Neal drinking out of a regular-sized water bottle. https://t.co/gLp6dPTNbI You Should Probably Know What These Text Abbreviations Are by Now https://t.co/KwNPpL09Gm Tell Us About Your BFF and We’ll Tell You What To Get Her for Her Birthday https://t.co/r7jq4OkdPq RT @UberFacts: Crying can make you feel happier.\n\nTears contain stress hormones, which leave your body through crying, and stimulates the p… Macaulay Culkin Has Legally Changed His Name https://t.co/WVeOEvNwhE RT @UberFacts: October 28th is National Chocolate Day! This baby cow stayed by her mom’s side until she got better ❤️ https://t.co/PG5QakgX9J Guy Gets Same Tattoo as Rescue Dog Before Knowing What It Means, Immediately Regrets It https://t.co/3W2JH7NLtV RT @UberFacts: The look on this mama dog's face when she sees her babies are safe ❤️ https://t.co/3MUqO6MKYY What Life Inside an Amazon Warehouse Is Really Like https://t.co/KzVxDzhTgs Jennifer Aniston has revealed that the \"Friends\" cast wants to do a reunion, and they're \"working on something\" together.\n\nHowever, it won't be a full-blown reboot. https://t.co/D7FTf97dVC These 13 Pets Really Don't Want Their Owners to Ever Leave https://t.co/2PAFGoEr09 RT @UberFacts: This couple is sharing the dream life with their cat ❤️😻 https://t.co/RNmt4QGwIu Cats are likely to see humans as just bigger, hairless, clumsy cats, according to experts.\n\nUnlike dogs, they treat us pretty much the same way they treat other felines. Pick Your Favorite Farm Animals and We’ll Tell You Which Female Country Star You Are https://t.co/ysDayPVJMf To enter the McKamey Manor horror house attraction in Tennessee, you have to sign a 40-page waiver, create a safe word, and get a full physical.\n\nIf you complete it, you'll get $20,000... No one ever has, but one person did have a heart attack. https://t.co/EA8ZNb5zwl When the office allows dogs! 😂 https://t.co/ffh982HVfr 30 of the Punniest Costumes https://t.co/9fjiiWsXbl An Aquarium’s Naughty Penguin of the Month Award Winners Have Committed Some Hilarious Crimes https://t.co/XQ0Kp0VFBJ Here’s What Happens To Your Body When You Skip Showers For Just Two Days https://t.co/WljqhDEjDe Cynophilist:\n\nA person who really loves dogs. https://t.co/TB6wp91Uqn RT @UberFacts: Forty real squirrels were trained to crack nuts for the 2005 film \"Charlie and the Chocolate Factory.\"\n\nThey weren't using C… 15 Interesting Food Facts to Chew On https://t.co/5jm4hQf8VX Popeyes has announced that their spicy fried chicken sandwich will officially be back on November 3rd as a permanent item.\n\nThey don't anticipate running out. Can You Identify These 18 Rare Phobias Without Screaming? https://t.co/4TASiXTd8c RT @UberFacts: Chocolate, sex and laughter are all key to a healthy brain. People Share What They Think Are the Worst Legal Things You Can Do https://t.co/wr7g3PlcC3 A Guy Told Women 'How to Be a Better Mother' — People Didn't Hold Back with Their Responses https://t.co/XJIRfOUqRL October 28th is National Chocolate Day! 37 Things That’ll Help You Get. Stuff. Done. In 2019 https://t.co/r3DCodYw64 Meet the Woman Who Finally Wore Pants onto the Senate Floor – It Wasn't Until 1993 https://t.co/HviOoewY1N Drinking Water All Day IS NOT the Best Way to Stay Hydrated — Learn the Best Methods https://t.co/0ylIbyfh7Z Simple Hacks to Help You Clean Every Filthy Thing in Your Life https://t.co/qzMuloqfjk Huge spider decides he's living in this woman's car now 😱🕷️ https://t.co/C7FB6kO6Ch RT @UberFacts: Hunter Dies After Being Attacked by Deer He Just Shot https://t.co/PKeGDmSP8D These Mistakes Were Hilariously Cute so We Really Don’t Care They Were Wrong https://t.co/rw9IBoml3A This couple is sharing the dream life with their cat ❤️😻 https://t.co/RNmt4QGwIu 37 Products on Amazon Engineered For Grown-Lady Life https://t.co/1nq1ep8GnZ The weight of the average cumulus cloud is 1.1 million pounds. A New Viral Selfie Challenge Has People Sharing Mental Health Advice for Their Younger Selves https://t.co/1OZhzrdkTY YouTuber Recreates Real Versions of ‘Home Alone’ Traps and They Look Absolutely Brutal https://t.co/Er6jjMjZvQ 20 of the Best Horror Movies from the 2010s https://t.co/Y6T7XYVoAl Mother of the year rescues son's snake from behind the fridge 😱🐍 https://t.co/WJJbdvxqhG Crafts Made Possible by Pool Noodles https://t.co/YSsr1CjWDn The Science Behind Your Morning Trip to the Bathroom https://t.co/KxdpzgkcuB A Mexican Physicist Solved a 2,000-Year-Old Lens Problem with One Wild Equation https://t.co/S3TNbumbHD This vet climbed into a scared rescue dog's cage so she wouldn't eat alone 💜 https://t.co/t248CiWQ4T Meet the Real People Behind 5 Iconic Company Logos https://t.co/gvrD8QfdCZ This couple had a baby and another on the way when they took a chance on this senior pit bull 💖 https://t.co/F1B0N0cj7t 10 Interesting Facts to Help You Get Through This Loooooong Week https://t.co/Hje3kJzpru In-Law Horror Stories That Will Make You Glad to be Single https://t.co/SXwovUBcj1 A recent survey of British adults found that 1 in every 6 people believe the entire galaxy is called \"Earth.\" People Share How They Got Their Acts Together and Stopped Being Lazy https://t.co/sYq8mUfMpx 36 Insanely Handy Gadgets That’ll Fit in Your Pocket https://t.co/Z9QqMRW2Lq This Creepy Video of a “Zombie Snail” Is Hard to Look Away from https://t.co/nf4cDpV1eY The look on this mama dog's face when she sees her babies are safe ❤️ https://t.co/3MUqO6MKYY Can You Guess the Shakespeare Play Based on the Quote? https://t.co/RoiKYzoo7h Need a New Fun Summer Game for the Kiddos? Try the Hula Hoop Lasso Challenge. https://t.co/5ZPLDzYYyC This tiny tortoise runs to his mom for cuddles 🐢❤️ https://t.co/9eTHrS0hB4 These Tweets Will Help You Get Through Today, Tomorrow &amp; Maybe Even the Day After That https://t.co/IlejYgQFyg Justin Theroux Took His Dog As His Date To The ‘Lady And The Tramp’ Premiere https://t.co/VFYEeKBxVD 10 Small Dog Breeds That Actually Stay Small...And They're Pretty Cute https://t.co/tA4ixedxPa People Reveal the Dumbest Things They Had to Explain to Other Adults https://t.co/xWrgqEbPFM You're more likely to get a computer virus from visiting religious sites than porn sites, according to research from security firm Symantec.\n\nThe average number of security threats on religious sites was about 115, compared to porn sites, which carried around 25. 15 of the Best “Video Games Don’t Cause Violence” Memes https://t.co/zF9mgLXDxv Taylor Swift Got Drunk and People Just Had to Share Memes About It https://t.co/OqUnYvtxlo In 1995, a man named Vincent Connare designed the Comic Sans font.\n\nHe said he only used it once. 29 Facts You Never Knew About ‘The Office’ https://t.co/uhq8c3Fsqy Crying can make you feel happier.\n\nTears contain stress hormones, which leave your body through crying, and stimulates the production of endorphins as well as oxytocin. Men Explain What Life Is like If You Marry a Trophy Wife https://t.co/iyRHHqJp6V They should have got an XL  🤣 https://t.co/mk0PHhPeuA Taking photos of an event makes it harder to remember due to a process called \"cognitive offloading.\"\n\nOur brain looks for ways to lessen the amount of information it needs to remember, often in the form of technology. Which Version of the Terminator Are You? https://t.co/Ua9d7cW40E All clownfish are born male.\n\nThey switch their sex to become the dominant female of the group, and the change is irreversible. 10 Facts About Sophie Turner You Should Check out https://t.co/WrtWZNK2x9 These Tips from a Veterinarian Will Help You Stop Getting Scratched When Carrying Your Cat https://t.co/Jg6RapEIN7 Twitter is In Love With These Six Rules for Marriage https://t.co/NuZX4k6yu8 What Healing Crystal Should You Possess Based On Your Personality? https://t.co/EcUGf77KbG RT @UberFacts: Keanu Reeves doesn't touch fans when taking a photo with them, unless they specifically say it's okay. https://t.co/xXrn0WTj… RT @UberFacts: These dogs have a cooler house than I do https://t.co/F32oUcQ1rp 19 Parents Reveal the Hilarious Reasons Why Their Kid Is Crying https://t.co/ucCAsTBsZi RT @UberFacts: In the 1860s, \"snowflake\" was used by abolitionists in Missouri to refer to people who opposed the abolition of slavery. RT @UberFacts: For about $255,500, you can buy a private jet package that lets you celebrate New Year's Eve twice.\n\nYou start the party on… RT @UberFacts: This is what adoption's all about ❤️❤️❤️ https://t.co/Eix2JkTSsR 30 of My Favorite Things I Bought on Amazon https://t.co/Yzw951uWu6 The 16 Most Savage Wendy’s Roasts Ever https://t.co/VYmV1xnOu7 Do You Know Where You Are? Name The City Based On The Picture To Pass This Quiz! https://t.co/p5qgV2lMEt Pictures to Make You Smile When You’re Having a Rough Day https://t.co/jegjQlAoMn 37 Things You Don’t Need, But Will Probably Want https://t.co/Rh1NA9ihJM We Bet You Can’t Spell the Top 50 Misspelled Words Correctly https://t.co/Sn6VgLiUZC Hunter Dies After Being Attacked by Deer He Just Shot https://t.co/PKeGDmSP8D Slender Man Victim Speaks Out for the First Time https://t.co/ZDtmqu9o1u Hilarious Tweets for Anyone Who Hates Bras (AKA Anyone Who’s Ever Worn One) https://t.co/esg9IOWnC0 Cheesecake Factory Dupes Customers into Overtipping By Printing False Numbers on Receipts https://t.co/nqE2RepssA Mary Poppins Has Been Called Racist Because Of Its ‘Blackface’ Scene https://t.co/rWcQ1UaaxJ Army Technique Helps You Fall Asleep in 2 Minutes Flat https://t.co/mzzPq4nYir In the 1860s, \"snowflake\" was used by abolitionists in Missouri to refer to people who opposed the abolition of slavery. Woman Who Lost Her Forehead in a Crash Warns People Not to Put Feet on Dashboard https://t.co/oiSFUhLrCM People on Twitter Can't Understand a Couple Who Claims They Don’t Have a “Side” of the Bed https://t.co/XxjJTvP2cW The Darth Vader Hot Air Balloon Makes a Trip Back Home https://t.co/fkROImvfJV Would You Win ‘Who Wants to Be a Millionaire’ or Lose it All? https://t.co/s1MqfIAP2G Some Horses Have Incredibly Hipster Mustaches https://t.co/LmOpMu7YPX RT @UberFacts: Most infections from swimming pools and hot tubs are caused by cryptosporidium; a diarrheal disease produced by microscopic… Angelina Jolie ‘Lookalike’ Brought out on TV Without Make-Up https://t.co/5GnQ2Z2ycr 11 Husbands Share What They Do When Their Wives Are Gone https://t.co/mVp5gEMFsq Students at Oxford University Vote Replace Clapping With Silent Jazz Hands to Prevent Triggering Anxiety https://t.co/rVuDt36BOp This is what adoption's all about ❤️❤️❤️ https://t.co/Eix2JkTSsR Woman Quits Job After Boss Tells Her 'Her Skirts Were Distracting Boys From Work' https://t.co/gG0WAS91Md Here's Everything That's Coming in Marvel's Phase Four https://t.co/uvNtuZv8CK Miniature Horses Are Now One of the Service Animals That Airlines Must Allow to Fly https://t.co/dPsG1V2s2x Hocus Pocus 2' in the Works for Disney+ and the Original Cast May Be Returning https://t.co/VRA9u8EPdt These Tweets That Prove College Kids Are Pretty Damn Funny https://t.co/WlMVs93W9L 15 Things That Totally Scream “I Peaked in High School” https://t.co/XujdkaIHXe Which ‘Zombieland’ Character Are You? https://t.co/rZ5eJfUnWm RT @UberFacts: These kids are never going to forget this 🐻❤️ https://t.co/kJzSGVC2rj Here’s the Reason You Shouldn’t Kill a Centipede in Your House https://t.co/8wRXCUXmCs Weird, Random, and Virtually Useless Talents People Possess https://t.co/P3iJSPwn2j These dogs have a cooler house than I do https://t.co/F32oUcQ1rp It Snowed in Australia, and the Kangaroos Are Very Confused https://t.co/Nwn7Hnl9l7 Can We Guess What Kind of Cat You Own? https://t.co/vtNn9USu7X This Is Why an Uber Driver Pretended to Be a Female Passenger’s Boyfriend https://t.co/TUumgBi9Co 15 Quick, Dumb Jokes to Share with Your Kids https://t.co/YniYp2gIP3 29 Bizarre Objects That Washed up on Beaches Around the World https://t.co/I8cF9GKcqz This Little Girl Wasn’t Impressed by the Birthday Cake That Called Her a “Loser” https://t.co/yv1R93Ba2c These Posts Will Make Perfect Sense If Your Partner Is a Snorer https://t.co/kVC25QTzgt 30 Celebrities Who Had Secret Babies https://t.co/1TZ6xd6odb RT @UberFacts: In New York, a bagel that's toasted, buttered, or comes with cream cheese is taxable.\n\nOtherwise, it's tax exempt. Americans Are Expressing a New Kind of Anxiety Due to Mass Shootings https://t.co/WvO387qtMk People Can’t Get Over The Fact Winnie The Pooh Is Actually A Girl https://t.co/sgoTWMuKT6 What it's like to grow up with your best friend ❤️ https://t.co/dq9zKwQUCf People Share What They Think Is Classy If You're Rich but Trashy If You're Poor https://t.co/5b2fWFjq3G Keanu Reeves doesn't touch fans when taking a photo with them, unless they specifically say it's okay. https://t.co/xXrn0WTjCG Unless You’re Currently Wearing Mouse Ears, You Likely Can’t Pass This Disney World vs Disneyland Quiz https://t.co/U6svCW4iZo Amazon Is Now Selling Live Animals Online – Here Are a Few You Can Buy https://t.co/oDSzSGd8VI Here's How Much Sex to Have If You Want a Baby https://t.co/MXOKyeo6E6 For about $255,500, you can buy a private jet package that lets you celebrate New Year's Eve twice.\n\nYou start the party on Dec. 31st in Sydney, Australia (from 8PM - 2AM), then fly to Los Angeles, land at 8:30PM and celebrate NYE all over again. Golden Retriever Gives Birth To a GREEN Puppy! https://t.co/Q04yDYqYb0 20 Celebrities You Won’t Believe Are the Same Age https://t.co/rjzdbASx7q Let Us Give You the Most On-Trend 2019 Pop Culture Halloween Costume for Your Personality https://t.co/26iYzfDCsm Boyfriend Creatively Uses Popsicle Sticks to Help His Girlfriend Handle Anxiety and Depression https://t.co/r50qvj1c3p 53 of the Handiest Gadgets on Amazon https://t.co/uHWS92HYnu 12 Things That Don’t Seem Real but Definitely Are https://t.co/4AR62szJPQ 19 Remarkable Photos That Show How Tattoos Age and Degrade Over Time https://t.co/ID5N4GJa0v RT @UberFacts: Every Halloween, these rescued lions LOVE getting their pumpkins!! https://t.co/kobbuPtquK RT @UberFacts: Giving up alcohol for just one month can improve liver function, decrease blood pressure, and reduce the risk of liver disea… In New York, a bagel that's toasted, buttered, or comes with cream cheese is taxable.\n\nOtherwise, it's tax exempt. Kids Who Don’t Know How Funny They’re Being https://t.co/zo3LT8MRDo Most infections from swimming pools and hot tubs are caused by cryptosporidium; a diarrheal disease produced by microscopic parasites that are released from someone's anus and consumed orally by other swimmers. Parents Dish on the Secrets Their Kids *Think* They’re Keeping https://t.co/3mxcHX2VNI Woman Who Missed Her Cruise Ended up on a Flight in Her Bikini https://t.co/HDYXJ6Nm8U 15 People Who Texted Their “Number Neighbors” Share the Results – Good and Bad https://t.co/Qc3dZY7DEP RT @UberFacts: ‘Skin Phone Case’ Feels like Real Human Flesh When You Touch It https://t.co/cgRIMDwVBT People Are Sharing the Nicest Thing a Total Stranger Has Ever Done for Them https://t.co/TEbnlEUBlx These 15 Memes Define 2019...So Far https://t.co/Kt88NV3OXG 10 Facts You Might Not Know About 1994's 'The Lion King' https://t.co/gw25tj2cZZ Tell Us Your Favorite Things About Spooky Season and We’ll Give You the Perfect Halloween Movie to Watch https://t.co/tmUzzHrwCd RT @UberFacts: The \"D\" in \"D-Day\" stands for \"day.\" This Is What It’s like to Run a World-Class Penis Museum https://t.co/O4uz490Oqv Woman Wears Hidden Camera to Catch People Looking at Her Chest https://t.co/upmbVL2wgA 15 People Share the Worst Way to Break up with Someone https://t.co/RugtrM0k8j Everything Coming to Netflix in November 2019 https://t.co/FXQt11siKK RT @UberFacts: This 13-year-old raccoon fell into wet concrete 😢😱 https://t.co/DtsfbSoNmK World’s Scariest Haunted House Will Pay You $20,000 to Finish It, but Nobody Ever Has https://t.co/1BpUjzcPj5 How 15 Childless Couples Feel About Sticking to Their “No Kids” Rule https://t.co/CZVdwHaN7h If You're a True Crime Junkie, These Tweets Are for You https://t.co/176vnDqkxy House Passes Bill Making Animal Cruelty a Federal Felony https://t.co/0nwK0FT1SX RT @UberFacts: Company Turns Kids’ Artwork Into Jewelry You Can Keep Forever https://t.co/pFInx4lyya These People All Found Weird Stuff in the Woods and Just Had to Share It https://t.co/583esJeNMW How Prepared Are You to Deal With People Who Are Just Not Smart At All? https://t.co/E2Srwtdc6h 15 People Share How They Got out of a Toxic Relationship for Good https://t.co/pskoNcvIC6 15 Amazing Photos of What Mars Looks Like https://t.co/b5rudfPL7E People Who Work With Dead Bodies Reveal the Creepy Things They’ve Experienced https://t.co/hZ8Y8y12YU RT @UberFacts: A Dolphin Mom Adopted a Whale Calf in a Rare Case of Interspecies Parenting https://t.co/OCXcWMDDzS If Your Child Is a Mouth Breather, It Could Be a Sign of Medical Troubles to Come https://t.co/Vlw64tXrbi What Halloween Costume Matches YOUR Personality? Find Out! https://t.co/iu0GF7K3fa Watch as this 14-year-old dog learns to run again 💗 https://t.co/T4BvqtsUZh RT @UberFacts: There's someone out there for everybody 💖 https://t.co/7QMAyiOt2U Tony Hawk is a Savage on Twitter and Finds it Comical When People Don’t Recognize Him https://t.co/IzG341KmJj 12 of the Funniest Tweets from Women This Week https://t.co/V3weJ1SqVX This Couple Rode Every Ride at Disney World – Without a Fast Pass https://t.co/p9U9wThCP6 31 Affordable Luxuries You Deserve To Own https://t.co/uoLUzdSD5a This guy rescued very pregnant dog from the middle of the woods 💖 https://t.co/cUlcOgRwJ3 These Instagram Models Are Leading the Body Positive Movement by Example https://t.co/UFRjy0JjeQ These kids are never going to forget this 🐻❤️ https://t.co/kJzSGVC2rj RT @UberFacts: Researchers at the University of Richmond have trained lab rats to drive tiny cars and found that it eases their anxiety. Amazing Photos Of Animals Still In The Womb https://t.co/KAArnBqDwx More Than 28,000 Species Are Now on a Collision Course with Extinction https://t.co/sJ93dobgwD A Group of Angry Ducks Interrupted a Golf Game to Chase off an Alligator https://t.co/kXojBfPjWt A High School Teacher Is Going Viral for Documenting the Dumbest Thing One of His Students Did https://t.co/uzoaq5TCYF Are Dogs Colorblind? Here's the Science Behind What Dogs Can See https://t.co/ncV87rZ2B7 RT @UberFacts: These dogs are protecting their pregnant mom's belly ❤️😍 https://t.co/1bJdpNLU1x 31 Things That Truly Make Great Gifts https://t.co/2LYVd9utFa RT @UberFacts: Redamancy:\n\nThe act of loving the one who loves you; a love fully returned. RT @UberFacts: This is what it's like growing up with your best friend 💖 https://t.co/5HsEVUJGfH People Who Took Their Shot On Tinder https://t.co/euD8qz2LtU RT @UberFacts: Pure. Joy. ❤️ https://t.co/Ijyxhm1mHF The \"D\" in \"D-Day\" stands for \"day.\" These Are the Signs of a Truly Happy Dog https://t.co/SeIiDDthXG Researchers at the University of Richmond have trained lab rats to drive tiny cars and found that it eases their anxiety. This 13-year-old raccoon fell into wet concrete 😢😱 https://t.co/DtsfbSoNmK 19 Doctors Describe the Weirdest Medical Cases They’ve Ever Encountered https://t.co/rZ5DWZaAEs RT @UberFacts: Voldemort’s Robes Faded in Color Every Time a Horcrux Was Destroyed in 'Harry Potter' Movies https://t.co/6OkRnZgayE This Is Why Most European Milk Is Not Refrigerated but American Milk Is https://t.co/llj34Eb5Zo RT @UberFacts: \"Now That’s What I Call Music!\" is still around and currently on its 71st volume. This Is How to Crack an Egg Perfectly Every Time https://t.co/0naDAeJKiY 37 Beloved Products With Over 1,000 Reviews on Amazon https://t.co/Uq3TIYHOgg RT @UberFacts: When two subatomic particles fuse, they release energy 7x greater than that produced by the fusion reaction in a hydrogen bo… An Irish Teen Won the 2019 Google Science Fair for Removing Microplastics from Water https://t.co/FKH62cUkP0 There's someone out there for everybody 💖 https://t.co/7QMAyiOt2U RT @UberFacts: Finland is one of the strictest countries in the world when it comes to driving requirements.\n\nDrivers are required to learn… Woman Being Threatened by Her Date Gets Help from Off-Duty Cop Who Comes to Her Rescue https://t.co/GhfLAYf92O These Gyms Have Some Very Rude and Disrespectful Members https://t.co/mkWoMxP4na RT @UberFacts: It's estimated that Netflix loses more than $135 million every month due to just under 10% of its subscribers sharing their… 31 Cooking Gadgets That Look Really Fun To Use https://t.co/kuao2KAbkH Learn Some Great New Information with These 10 Facts https://t.co/xxDdZZM6iC RT @UberFacts: If a pittie could describe the days of the week.... https://t.co/qrtSE6JOpY There Will Be a Major League Baseball Game at the ‘Field of Dreams’ in Iowa in 2020 https://t.co/8CKKSIPBh8 RT @UberFacts: This pittie copies everything his parents do ❤️ https://t.co/FZ6YT4CihA Trans Woman Chronicles Her Emotional Transition Over the Course of a 17-Month Hormone Treatment https://t.co/wKS2iRx6fk An Anti-Vaxxer Wore a “Jesus Wasn’t Vaccinated” T-Shirt. Here Are the Best Responses. https://t.co/HIvR8GmnUM RT @UberFacts: \"That ’70s Show\" premiered in 1998 and capitalized on nostalgia for the world as it had been two decades prior.\n\nIf it were… Tweets About Ikea That Are Insanely Relatable https://t.co/DWRIF2xlkd The World’s Largest Aircraft Lets You Enjoy a Luxurious 3-Day Sky Cruise https://t.co/AiJIeoeKS8 RT @UberFacts: Bryan Cranston Says He Isn’t Done Playing Walter White Yet https://t.co/6ZSN78iYqr Which Superhero Duo Are You And Your Best Friend? https://t.co/PeXh7L9ejh These Husbands All (Hilariously) Tweeted the Truth About Being Married https://t.co/WEkmvCa6eY RT @UberFacts: Eminem's rap about getting a visit from the Secret Service in his song \"The Ringer\" is a true story.\n\nOn Jan. 16, 2018, they… Company Turns Kids’ Artwork Into Jewelry You Can Keep Forever https://t.co/pFInx4lyya Pure. Joy. ❤️ https://t.co/Ijyxhm1mHF Freddie Mercury's Partner Buried His Ashes in Secret and Nobody Knows Where https://t.co/TI8Dpbjorm RT @UberFacts: Being overweight or obese in your 20s can take up to 10 years off your life, according to researchers at the University of S… ‘Skin Phone Case’ Feels like Real Human Flesh When You Touch It https://t.co/cgRIMDwVBT 15 People Share What They’d Say If They Had the Whole World’s Attention for 30 Seconds https://t.co/dVLXxFpMGZ This is what it's like growing up with your best friend 💖 https://t.co/5HsEVUJGfH Always Removes Female Symbol from Sanitary Pad Packaging https://t.co/OKQubxYH3Y RT @UberFacts: This couple filled their house with rescued baby kangaroos 😍 https://t.co/eiFVI8tt5d 20 of the Best Restaurants in New York City, According to Foodies https://t.co/xEOf54dqVJ Only 10 Percent of People Can Pass This Vision Test. Can You? https://t.co/qPlSKq0CPa RT @UberFacts: Kid Wears Hotdog Costume for School Picture Because His Parents Dared Him To https://t.co/EiADZqwdl2 Summer Heat Getting to You? Here's When Fans Do and Don't Help, According to Science. https://t.co/oJTkhMlsy3 Woman Accosts Parents on Sidewalk During Their Baby’s First Photo Shoot https://t.co/VXoytzWqfd RT @UberFacts: Bees like to take little 15 to 30 seconds naps in flowers. https://t.co/B6PyisJZm6 These Actors All Admitted They Drank on the Job https://t.co/300fERB6Ap Take This Quiz And We’ll Tell You Where You Live Based On Your Taco Preferences https://t.co/W38B8xexUm Redamancy:\n\nThe act of loving the one who loves you; a love fully returned. Check out These Incredible Now and Then Photos of Lifelong Friendships https://t.co/00QyNjlM73 These dogs are protecting their pregnant mom's belly ❤️😍 https://t.co/1bJdpNLU1x 37 Humiliating Products You Can Fortunately Buy Online https://t.co/vXVE7AKau4 RT @UberFacts: These sweet babies want their mom ❤️ https://t.co/S4S67yFKlM A Dolphin Mom Adopted a Whale Calf in a Rare Case of Interspecies Parenting https://t.co/OCXcWMDDzS 23 Insanely Easy Tips and Tricks Every Driver Should Know https://t.co/opPmkdG4rR RT @UberFacts: Forgiving yourself and others can bring you peace of mind, helping you get a better night's sleep, according to a study publ… If You're Trying to Eat Healthier, Check out These 20 Food Charts https://t.co/joc2NlNTRT It's estimated that Netflix loses more than $135 million every month due to just under 10% of its subscribers sharing their passwords, according to research firm Magid. 20 People Who Are Having Some Serious Beauty Fails https://t.co/1AciaIZ9Ba The E-6B Mercury is the U.S. Navy's \"doomsday\" plane, a $142 million aircraft designed to act as a communications relay during a nuclear war.\n\nEarlier this month, the aircraft was performing touch and go test landings when one of the engines ingested a bird and was destroyed. Hamster cheeks = magic 😂🔮 https://t.co/gdWa2wkxSH RT @UberFacts: This guy rescued a dog and all he needs is some help finding him the perfect home 💞 https://t.co/S5JEnmhsY0 The Most Adorable Twin Dogs All For You https://t.co/37d7RqXyni This Single Chart Outlines 37 Years of Mass Shootings in the U.S. https://t.co/uT0MvG7N5i 15 People Share What Surprised Them the Most About Living with a Significant Other https://t.co/GcsNhMNQkA Eminem's rap about getting a visit from the Secret Service in his song \"The Ringer\" is a true story.\n\nOn Jan. 16, 2018, they met with him to discuss \"threatening lyrics\" from another song of his, \"Framed.\" 31 Handy Gadgets on Amazon That Might Be Genius https://t.co/kCvzvj2aK9 30 Wives Who Will Make You Think About Stepping Up Your Marriage Game https://t.co/5CKC0y8fMp Behind The Scenes Secrets From “MythBusters” https://t.co/QuXHvJp4CG These Items Everyone Owns Have Secret Features https://t.co/JUK0tgEnT7 Instagram Bans Face-Altering Filters That Have a Plastic Surgery Effect https://t.co/SDqjuROsaq Cap'n Crunch wears just three stripes on his uniform cuffs, which is indicative of a commander, not a captain. https://t.co/odyTAzgmPv Forgiving yourself and others can bring you peace of mind, helping you get a better night's sleep, according to a study published in the journal Psychology and Health. Here Are 10 Things You Can Get for Free at Disney World https://t.co/08UdDy0r5N Woman’s Story About Selling Dryer Online Reveals the Reason Women Fear Men https://t.co/dU3nr8hN2J Cities Are Using This High Pitched ‘Mosquito’ Sound to Get Rid of Teenagers After Curfew https://t.co/V7kbjVczGr RT @UberFacts: In 1985 a New Orleans man drowned at a party attended by 100 lifeguards who were celebrating a summer without any drownings… These Texts From Exes Belong in the Clapback Hall of Fame https://t.co/Yl1rBKQBGj Sometimes you just need a little encouragement from Mom ❤️ https://t.co/Z3ygrr10qZ People Are Struggling to Agree on the Answer to This Math Problem. What Do You Think? https://t.co/L13A8frS51 Eminem Doesn’t Really Look Like Eminem Anymore and Fans Don’t Know What To Think https://t.co/7BBBvfTsWG This pittie copies everything his parents do ❤️ https://t.co/FZ6YT4CihA RT @UberFacts: A \"moment\" was a medieval unit of time equal to modern 90 seconds. A Huge Tick That Can Hunt Humans Through the Forest Is Expanding Its Territory. Run! https://t.co/WlGac9HH7i 12 Fascinating Facts About the Sistine Chapel https://t.co/b6719BtH1N Being overweight or obese in your 20s can take up to 10 years off your life, according to researchers at the University of Sydney. This guy rescued a dog and all he needs is some help finding him the perfect home 💞 https://t.co/S5JEnmhsY0 19 Amazing Quotes From Mr. Rogers That Will Improve Your Whole Day https://t.co/mDdQkoW0DR If a pittie could describe the days of the week.... https://t.co/qrtSE6JOpY RT @UberFacts: Taking a hot bath can help relieve feelings of loneliness, according to researchers from Yale University. These People Win at Holiday Cards https://t.co/e89Ocihoym RT @UberFacts: This tiny puppy was a Christmas miracle ❤️️ https://t.co/NfbQjxF4qu People in Georgia Worked Together to Save a Stranded Pod of Whales on a Beach https://t.co/LxqCCVSeod Tiffany Haddish Left Scientology Over Her Hatred of Bunkbeds https://t.co/6K8ImWBDk0 Finland is one of the strictest countries in the world when it comes to driving requirements.\n\nDrivers are required to learn basic car maintenance and must take two tests; one in summer conditions and another in winter conditions. 11 People Share the Really Weird Things They Do https://t.co/a4LWJwjsEC Kid Wears Hotdog Costume for School Picture Because His Parents Dared Him To https://t.co/EiADZqwdl2 RT @UberFacts: Phagomania:\n\nA compulsive desire to eat. Hallmark-Themed Monopoly Now Exists and We're More Excited for Christmas Than Ever https://t.co/jeMn73GQi2 The CPR Dolls' Face Is a Copy from a 19th Century Death Mask of a Woman Who Drowned https://t.co/FnZGCurxEw Bryan Cranston Says He Isn’t Done Playing Walter White Yet https://t.co/6ZSN78iYqr Zuu the Cat’s Expression Says \"I Just Can't Handle This Anymore\" https://t.co/7Ci87BBwJb This couple filled their house with rescued baby kangaroos 😍 https://t.co/eiFVI8tt5d Voldemort’s Robes Faded in Color Every Time a Horcrux Was Destroyed in 'Harry Potter' Movies https://t.co/6OkRnZgayE This Teenager’s Artwork Made His Surgical Team Laugh so Hard It Delayed His Surgery https://t.co/dfktXukyjF RT @UberFacts: The \"Wait Calculation\" is used when deciding if an interstellar mission is worth starting.\n\nIf a mission cannot be completed… One in four Americans are currently crushing on somebody who is completely “off-limits” https://t.co/es38dPLpqk When two subatomic particles fuse, they release energy 7x greater than that produced by the fusion reaction in a hydrogen bomb.\n\nThe physicists who discovered this kept it a secret until they were sure it could not be weaponized. In the late 19th century, the Sears catalogue sold an opiate kit to help people calm their nerves. 15 Funny Jokes for All of You with a Dark Sense of Humor https://t.co/vaRPKBod7S Blogger Bought a Haunted Chair and Brought It Home with Her https://t.co/bY1wtEp40d \"That ’70s Show\" premiered in 1998 and capitalized on nostalgia for the world as it had been two decades prior.\n\nIf it were to premiere today, it would be \"That '90s Show.\" These sweet babies want their mom ❤️ https://t.co/S4S67yFKlM 15 People Share the Jobs They'd Want If Every Occupation Paid the Same Salary https://t.co/BggEall33n \"Now That’s What I Call Music!\" is still around and currently on its 71st volume. Beyoncé's bumpy road to wax figure glory https://t.co/Z5kWI2X5cT RT @UberFacts: Losing just two hours of sleep is enough to make you angrier the next day, according to a study published in the Journal of… 17 Foreign Words That Have Wonderful Literal Translations https://t.co/OM6Sli1O9T 29 Psychological Tricks You Can Use to Drive People Nuts https://t.co/ocP0wLaMZy Here's How to Use Apple's New Music Sharing Feature for iOS 13 https://t.co/eAa4DzSvmO Man rescues very pregnant dog from the middle of the woods! 💖 https://t.co/cUQqJX16CC People Are Revealing The One Secret That Would Ruin Their Life, And They’re Totally Nuts https://t.co/rhaX5W3LzI Bees like to take little 15 to 30 seconds naps in flowers. https://t.co/B6PyisJZm6 Scientists Sight First Hammerhead Shark in Irish Waters in Yet Another Sign of Climate Change https://t.co/4oxmGZg7GJ 12 People Who Walked in on Their Roommates Share Their Stories https://t.co/m04DZLcPLg RT @UberFacts: October 23rd is National Slap Your Annoying Co-Worker Day! 19 Parents Reveal the Hilarious Reasons Why Their Kid Is Crying https://t.co/zgVYAgKc28 15+ Moms React to Daughters Who Won’t Give Them Grandkids https://t.co/tdA9fDqlvF Take a Look at These Awful Comments People Made to Brides on Their Wedding Day https://t.co/QPR5vL9Gvu Real Life Fox And The Dog Are Both Saved From Tragic Fates https://t.co/bLIakPzVyc Girlfriend Tweets Every Weird Thing Her Boyfriend Says in His Sleep and We Can’t Stop Laughing https://t.co/8VP5WPXcmW Auschwitz Sends Message to People Posing for Instagram at Concentration Camp https://t.co/akTy2Aox3R RT @UberFacts: While sound can disrupt our sleep, scent cannot.\n\nYou can't rely on your sense of smell to wake you up in the event of a hou… RT @UberFacts: Pulling an 'all-nighter' will cause your body to burn about 135 extra calories. Video Games That Are Surprisingly Inspired By Real Life https://t.co/2TAxLXX6wR RT @UberFacts: Men Spend 7 Hours A Year Hiding On Toilet For ‘Peace And Quiet’, New Research Finds https://t.co/zfuWT2zrR6 October 23rd is National Slap Your Annoying Co-Worker Day! RT @UberFacts: Studies of the 'ice cores' found in Mount Kilimanjaro in Tanzania (the mountain which supplies the Nile with its water) reve… 34 Things That Everyone Owns But You https://t.co/hBEG4FPm4O 8 Little-Known Facts About the Historic Explosion at Pompeii https://t.co/2kbinzzduD 10 Facts You Didn’t Know About America's First Ladies https://t.co/OgmK3kcPdg 20 Tiny Mistakes We Discovered in Classic Disney Movies https://t.co/mKEu4ApJ4u Taking a hot bath can help relieve feelings of loneliness, according to researchers from Yale University. RT @UberFacts: According to Science, There Is an Ideal Woman’s Body and Here’s What It Looks Like https://t.co/mtOEaqoqkq RT @UberFacts: This man has rescued hundreds of dogs and sleeps in -4 degree weather with them.\n\nLet's help him build a winter shelter! ❤️… A Woman Lost Clumps of Hair After She Bought Conditioner Spiked with Nair https://t.co/aQDh4Zdu9z 19 Bizarre Pics You’ll Have to See to Believe https://t.co/VsbUK8lzMb 12 Funny Parenting Tweets from Moms and Dads https://t.co/XssTW9F8t2 RT @UberFacts: Staring into someone's eyes for 10 minutes can induce an altered state of consciousness and cause you to hallucinate. Phagomania:\n\nA compulsive desire to eat. RT @UberFacts: An estimated 15% of the American adult population can read at a university Bachelor’s degree level.\n\nThe majority of America… 37 Awesome Things You Don’t Need But Will Probably Want https://t.co/SGOlTdfi5d 15 People Share Bits of Knowledge That Could One Day Save Your Life https://t.co/bfNEN5EUYd RT @UberFacts: High School Student Punished for Not Wearing a Bra to School, Told ‘People Assume Bad Things’ https://t.co/iREBqOdKlq The \"Wait Calculation\" is used when deciding if an interstellar mission is worth starting.\n\nIf a mission cannot be completed in 50 years, it shouldn't be started at all; by that time, technology would have advanced and be more efficient. Check out These Tweets of Millennials Clapping Back at Baby Boomers https://t.co/Wyv9gQGjHj Here’s How You Relieve Any Headache In Only Five Minutes Without Using Pills https://t.co/VQ46zCX452 RT @UberFacts: 15 Funny Tweets About Sex https://t.co/ZlHrwJXjj0 Losing just two hours of sleep is enough to make you angrier the next day, according to a study published in the Journal of Experimental Psychology: General. Man Finds Great White Shark Carcass in Abandoned Wildlife Park https://t.co/OgqNPWHdUH A Woman Canceled Her Baby Shower After Friends and Family Mocked Baby's Name https://t.co/GXhCa5OaHc RT @UberFacts: During the early 1990s, a drug named UK92480 was intended to help patients with heart disease by relaxing their blood vessel… 31 Popular Products on Amazon With Results That’ll Make Your Skin Crawl https://t.co/2t9tDBp9np \"Juice jacking\" is a kind of cyber attack where a public USB charging port that doubles as a data connection is infected with malware, allowing hackers to steal your information. RT @UberFacts: Take a Look at These Housing Design Fails Shared by Real Estate Agents https://t.co/atTK4sAMFm 13 Thrillers on Netflix With The Highest Rotten Tomatoes Scores https://t.co/EFPZYgA83W 25 Tweets You’ll Appreciate If You're Obsessed with Food https://t.co/IUpbiirtVn Meet a man and his loyal baby rescue bird ❤️❤️❤️ https://t.co/AxbdB7SkKf This Woman Looks So Much Like Beyoncé, She’s Gotten Chased Down the Street https://t.co/Iy2dDMtDZf RT @UberFacts: This Is Why Men Fall Asleep After Sex (Don’t Worry, It’s Not You) https://t.co/8r96e9EgvE 30 Brilliantly Handy Discoveries Under $30 https://t.co/exQVBgGlPS RT @UberFacts: Jared Leto Reportedly Tried to Stop Warner Bros from Making Joker https://t.co/sdEfvizvlX Parents Are Being Warned Not to Dress Their Kids up as Moana This Halloween https://t.co/M2cJ1ywzRC Pulling an 'all-nighter' will cause your body to burn about 135 extra calories. Take a Look at These Commonly Used Words That Are Actually Acronyms https://t.co/ER5djW9N92 20 Times Cheaters Got Caught In the Act…With the Pictures To Prove It https://t.co/ntPzHrf6BA People Share What They Think Screams \"I Peaked in High School\" https://t.co/EHVRUGssTQ Italians Are Very Tired of Americans Ruining Their Food, as This Twitter Account Can Affirm https://t.co/yLf6LD3h3k While sound can disrupt our sleep, scent cannot.\n\nYou can't rely on your sense of smell to wake you up in the event of a house fire. Travelers left nearly $1 million in loose change at TSA checkpoints https://t.co/mP9wzdSRly RT @UberFacts: New York City hot dog vendors must pay the city nearly $300k a year to operate outside of Central Park. A Lakota Woman Competed in the Boston Marathon to Honor Missing and Murdered Indigenous Women https://t.co/FVHnOO0hbl Lucy From ‘The Chronicles of Narnia’ Is All Grown Up…See What She Looks Like Now! https://t.co/pesiRbLnD7 Studies of the 'ice cores' found in Mount Kilimanjaro in Tanzania (the mountain which supplies the Nile with its water) revealed that a drought did take place around 3,600 years ago.\n\nAround the time the Bible sets Joseph's story. RT @UberFacts: Rewatching your favorite movies, shows, and listening to your favorite songs repeatedly can help your brain relax by putting… James Cameron on climate crisis: ‘People need to wake the f–k up’ https://t.co/rlG1AdHown This tiny puppy was a Christmas miracle ❤️️ https://t.co/NfbQjxF4qu RT @UberFacts: People are who are forced to smile at work may be more likely to drink heavily, according to research conducted at Penn Stat… Man Who Created the Momo Doll Has Destroyed It https://t.co/iihlNwU3t5 10 Great Facts for You to Ponder https://t.co/NqstIcO66d RT @UberFacts: Logan Paul Says He’ll Travel to Antarctica to Prove Earth Is Flat https://t.co/muQurUTbbs The 37 Best Money-Saving Products From Amazon Basics https://t.co/iAkZqTVTk9 Kidnapping Victims Explain What It's like to Be Snatched https://t.co/EUw72NPqfM Mix ‘Game of Thrones’ with Adorable Doggos and You Get ‘Game of Bones’ https://t.co/3us5hkAhY4 17 Terrible Haircuts That Will Seriously Make You Laugh Your Butt Off https://t.co/y3kxLwbEqh Tim Allen was offered the role of Stu and Mrs. Doubtfire in the 1993 movie but turned them both down. Girls Admit to Stealing Their Friends’ Boyfriends and Having No Regrets https://t.co/uPAGtw2NyA RT @UberFacts: Watch this dog go from trusting no one to wagging her tail 💖 https://t.co/ecNH3KncUr Shelter Dog Before-And-After Pictures Reveal How Grooming Can Help Adoption https://t.co/5D0UkPKEAV A Woman Shared the Long Text Message She Got from Her Ex Right Before His Wedding Day https://t.co/BS7W9sN387 10 People Admit Times That They Failed Very Badly https://t.co/HQ8sgYFSsK Men Spend 7 Hours A Year Hiding On Toilet For ‘Peace And Quiet’, New Research Finds https://t.co/zfuWT2zrR6 32 Shark Tank Inventions That Are Wildly Popular on Amazon https://t.co/9pATx1Me7G RT @UberFacts: ... WOW 👏👏👏 https://t.co/Ok6ydNN3hC RT @UberFacts: During pregnancy, if a mother suffers organ damage, the fetus sends stem cells to repair the damaged organ. The True Story Behind “The Blind Side” https://t.co/fu6cQbJ4MH RT @UberFacts: Cop rescues pit bull in -20 degree windchill 🙌❤️ https://t.co/huApFRpVx9 RT @UberFacts: \"Dropping\" is a tradition among many Dutch parents; they take their kids camping, then abandon them in the forest at night s… Girl Learns the Hard Way Why You Should Never Take a Sexy Selfie in a Messy Room https://t.co/pDzzN8v6pe RT @UberFacts: Dogs can get a sense of when you're supposed to be home from work based on how much of your scent is left in the house. RT @UberFacts: This great dane loves his 92-year-old Nana ❤️😍 https://t.co/pIT9jW1qog Two People Are Buried on a Runway at a Major U.S. Airport Where Hundreds of Planes Land Every Day https://t.co/PVKV5nla6S RT @UberFacts: This bird copies everything his mother does ❤️ https://t.co/DGgt0vZOUG RT @UberFacts: Meet the tiniest, bravest, most adorable baby pig in the whole world 💖 https://t.co/zW4vlDx7ZY RT @UberFacts: This man spent every single day helping this pig walk again for 4 months ❤️ https://t.co/ZZvf507w0a RT @UberFacts: The smallest act of kindness can mean the world to someone ❤️ https://t.co/2WKAQCmbaT Leading Anti-Vax Politician Hospitalized With Chicken Pox https://t.co/7h4yts7gVH RT @UberFacts: An estimated 30 people are bitten by squirrels in New York City every year. RT @UberFacts: Nursing Home Workers Arrested for Running Fight Club Between Elderly Dementia Patients https://t.co/wSIo4W0wg5 J.K. Rowling Had the Perfect Response to People Calling Meghan Markle ‘Unsuitable’ https://t.co/lId5Zf2LUw RT @UberFacts: Listening to sad music can help relieve symptoms of depression, according to a 2019 study published in the journal Emotion. If you were to dig a tunnel straight through Earth and drop an object in, it would take 42.2 minutes for it to get to the other side (if there were no air resistance to slow it down). During the early 1990s, a drug named UK92480 was intended to help patients with heart disease by relaxing their blood vessels.\n\nHowever, after patients began reporting an unusual side effect, the drug was \"repositioned\" and sold as Viagra. People Share the Phrase That Annoys Them like Crazy https://t.co/5XvvNCTE6j The 45 Creepiest Things That Have Been Captured On-Camera By Google Maps https://t.co/doiacOOWHa This Is Why Men Fall Asleep After Sex (Don’t Worry, It’s Not You) https://t.co/8r96e9EgvE Lawyers are 3.6 times as likely as non-lawyers to suffer from depression than those who work in other fields, according to research from Johns Hopkins University. This man has rescued hundreds of dogs and sleeps in -4 degree weather with them.\n\nLet's help him build a winter shelter! ❤️ https://t.co/ibzWrHpkZf 15 Photos That Captured Very Interesting Coincidences https://t.co/gX8mNpUEa9 According to Science, There Is an Ideal Woman’s Body and Here’s What It Looks Like https://t.co/mtOEaqoqkq Take a Look at These Housing Design Fails Shared by Real Estate Agents https://t.co/atTK4sAMFm An estimated 15% of the American adult population can read at a university Bachelor’s degree level.\n\nThe majority of Americans read at a 7th or 8th-grade level. High School Student Punished for Not Wearing a Bra to School, Told ‘People Assume Bad Things’ https://t.co/iREBqOdKlq A Mansplainer on Twitter Proved Just How Little Men Know About Periods and Tampons https://t.co/0K2vesIDQA 15 Funny Tweets About Sex https://t.co/ZlHrwJXjj0 Is Hopper Still Alive? ‘Stranger Things' Season 4 Set Leak May Have Given Us A Clue https://t.co/xfBHPjfJ2W People are who are forced to smile at work may be more likely to drink heavily, according to research conducted at Penn State University. The New Baby Smell Activates Your Brain’s Reward Centers https://t.co/9KvvO62sUO Ryan Reynolds and John Krasinski to Star in New Buddy Comedy https://t.co/Zkbe6MuNIU 15 People Share the Basic Life Skills They Should've Learned, but Never Did https://t.co/Iceo47Sjqi Seth Rogen Says His 'Work Is Done' After Teen Is Arrested for Using Mclovin ID to Get Into Bar https://t.co/iFnY9zv46Y Rewatching your favorite movies, shows, and listening to your favorite songs repeatedly can help your brain relax by putting it at ease. Jared Leto Reportedly Tried to Stop Warner Bros from Making Joker https://t.co/sdEfvizvlX This Is Why Your Whiskey Tastes Better When You Add Water https://t.co/qwwFFDCQ4C This Is Why Men Should Be Banned from Writing Female Characters https://t.co/8dWMZFz07A Nobody Died at Sandy Hook' Author Must Pay Victim's Dad $450,000 https://t.co/IwxShB7uf8 Staring into someone's eyes for 10 minutes can induce an altered state of consciousness and cause you to hallucinate. 15 Funny Photos That Perfectly Sum up Canada https://t.co/6FaA2oZNsA Ohio mom discovers home-invader about to give her 2-year-old a bath https://t.co/IUOegoZHFs These Television Shows May Have Only Lasted One Season, but They’re Totally Worth Your Time https://t.co/YJgYDJJe3I Watch this dog go from trusting no one to wagging her tail 💖 https://t.co/ecNH3KncUr ‘GQ’ Made a Hilarious Video Where They Give Donald Trump a ‘Normal’ Makeover https://t.co/9KLA2yihzy New York City hot dog vendors must pay the city nearly $300k a year to operate outside of Central Park. A Texas Movie Theater Lets You Bring Your Dog and the Ticket Includes Bottomless Wine https://t.co/llKvRal9S1 Mac Miller's mom asks his friends to steer clear of unauthorized biography https://t.co/XsSXuhczp8 RT @UberFacts: Happy \"Back to the Future\" Day! https://t.co/Q2vBYJL6pl This Is How Much These Iconic Movie Cars Cost in Real Life https://t.co/69sUZyArNp What You Should Do with Your Parents’ Social Media Accounts After They Pass Away https://t.co/TjRN7a0dqd Logan Paul Says He’ll Travel to Antarctica to Prove Earth Is Flat https://t.co/muQurUTbbs 17 Memes for All the Stressed-Out Moms Out There https://t.co/egURQnShlI 15 People Who Have Killed or Injured Someone in Self-Defense Share Their Stories https://t.co/epZWdLzzsc Why Unattainable Perfection Makes Plastic Surgery a Slippery Slope https://t.co/mklQL6Ta90 15 Employees Share Stories About the Current BS They Have to Deal With at Work https://t.co/ZI7lxt20NF Watch this cop stop traffic for a family of swans ❤️ https://t.co/g7WA8xVcq4 These Online Prom Dress Fails Make the Case For Always Buying In Person https://t.co/aNBxX8bJEw Listening to sad music can help relieve symptoms of depression, according to a 2019 study published in the journal Emotion. The Greatest Animal Actors Of All Time https://t.co/KbLdSXppYr Happy \"Back to the Future\" Day! https://t.co/Q2vBYJL6pl Signs That Are Not Messing Around https://t.co/zrecL930oA 36 Products With an Insane Cult Following on Amazon https://t.co/b29mGoOWKW Your Favorite Royals Dressing Up In Marvelous Costumes https://t.co/P5eQ6H1wdn Nursing Home Workers Arrested for Running Fight Club Between Elderly Dementia Patients https://t.co/wSIo4W0wg5 Cinemas to Screen Friends Episodes to Mark 25th Anniversary https://t.co/UYVPVo0yLP Experts Figured Out What Dogs Dream About and People Are Freaking Out https://t.co/rmtDQrC0yG An estimated 30 people are bitten by squirrels in New York City every year. The smallest act of kindness can mean the world to someone ❤️ https://t.co/2WKAQCmbaT This Brave OKCupid User Gets Blackmailed By a Scammer, Then Gets Sweet Revenge https://t.co/amOLwtCJYH This man spent every single day helping this pig walk again for 4 months ❤️ https://t.co/ZZvf507w0a Meet the tiniest, bravest, most adorable baby pig in the whole world 💖 https://t.co/zW4vlDx7ZY Do You Know What Your Sleeping Position Reveals About Your Personality? https://t.co/c1jb5EwK89 This bird copies everything his mother does ❤️ https://t.co/DGgt0vZOUG This great dane loves his 92-year-old Nana ❤️😍 https://t.co/pIT9jW1qog Sloths enjoy sunbathing and bask near the tops of trees to get warm. 15+ Things Europeans Think They Do Better Than Americans (And They’re Not Wrong) https://t.co/uunJTJlfoh Keanu Reeves Goes on a Road Trip With Strangers After Getting Stranded in California https://t.co/oD6V2yPibq Rare Pennies Are Circulating out There Worth up to $200,000 https://t.co/vWJaJYAxA9 RT @UberFacts: Chris Hemsworth Wants to Remake ‘Three Amigos’ With Chris Evans and Robert Downey Jr. https://t.co/IBh81VepuQ 30 Products With a Serious Cult Following on Amazon https://t.co/j2OBWyhYze Grit Is More Important Than IQ When It Comes to Success https://t.co/y5S9Ikeexs Meet a guy and his loyal baby rescue bird 💜💜💜 https://t.co/NZtn6WXAVI Tom Brady's Massage Parlor Cameo In Netflix Series Creates A Brewing Scandal https://t.co/HTGlYLiCve RT @UberFacts: Excessive brain activity can shorten your lifespan, according to a study published in the journal Nature. Here's What It Costs to Open a Franchise of 10 Popular Fast Food Restaurants https://t.co/0wVoAWyIfq Parents Take Their Own Life After Their Little Boy Dies of Cancer https://t.co/pAt9Nfp26O 15 Facts That Are Totally Disturbing https://t.co/aBEipgxCQg Couple Stopped by Airport Security After Accidentally Packing Their Pet Cat https://t.co/dr2AOmmAFs Classical Illustrations Depict What Can Only Be Described as Japanese Fart Battles https://t.co/3I5nG3yR60 Snoop Dogg Hires Full-Time Blunt Roller Who Earns $50,000 a Year https://t.co/CfJTXoljF4 A Rare Turtle Was Brought Back from the Edge of Extinction by Caretakers of a Hindu Temple https://t.co/lNGNdgoRCv Michael Jordan Donates Seven Million to Open Health Clinics for the Uninsured https://t.co/oPu746z98m RT @UberFacts: October 20th is International Sloth Day! https://t.co/5tMh6vR8gK This man gave up his old life to change the world for dogs ❤️ https://t.co/w9gz6ZOD6X Owner of restaurant at famous 'Friends' location slams 'annoying' selfie-obsessed tourists https://t.co/7DfX7ZkpUD A Man Told a Woman to “Stop Speaking Spanish.” So Everybody Started Speaking Spanish. https://t.co/elnZ1C3fwt Pilots Reveal the Things Happening During a Flight That Passengers Will Never Know About https://t.co/fuDZ6iQ5Qu An Amputee Cosplayer Attached a Lightsaber to Her Arm and Became the Perfect Jedi https://t.co/vbvGDESmaL RT @UberFacts: Roughly 71% of 17-to-24-year-olds in the U.S. wouldn't qualify for military service due to health issues, physical appearanc… Jake Gyllenhaal saves giant Dalmation in the middle of busy NYC intersection https://t.co/Dz0UzNWWSH A Group of Heartbroken Scientists Wrote a Eulogy to Iceland’s First Disappeared Glacier https://t.co/9o6ii5b5eU 15 Things That Really Bother Your Starbucks Barista https://t.co/5PZ8kVc33r Parents Who Probably Shouldn’t Be Allowed to Have a Phone https://t.co/AP0LaQ0RwU RT @UberFacts: Joaquin Phoenix based his \"Joker\" laugh off of people who really had pathological laughing disorder. Cop rescues pit bull in -20 degree windchill 🙌❤️ https://t.co/huApFRpVx9 29 Tweets That Reveal What It’s Really Like to Move in with Your Partner https://t.co/jw8C1zez5T The Worst Shark Attack on Record Happened During World War II https://t.co/8MfNqdWqG5 15 Interesting Pictures of Face Tattoos https://t.co/uH61bN4Afr Sheepdog Retires After Protecting Penguins for Eight Years https://t.co/MeUwOaXqKp RT @UberFacts: Nathan \"Nearest\" Green, a man born into slavery and emancipated after the Civil War, taught distilling techniques to Jack Da… The Sunscreen You Wear May Be Harming the Environment https://t.co/geuCZXz8so Guinness Food World Records That Will Satisfy Even The Hungriest People https://t.co/TYw1dPkfie October 20th is International Sloth Day! https://t.co/5tMh6vR8gK 13 Posts About How Bizarre the English Language Can Be https://t.co/D6GyRyGZHE 15+ Tweets People Shared About Being a Hot Mess https://t.co/qBKoT4YB6h 39 People Share the Most Shockingly Unbelievable Stories About Themselves https://t.co/JrcugiAE7c A Fan Who Threw a 96 Mph Fastball in a Speed Challenge Signed with the Oakland A's https://t.co/EPqKDZlNEf A College Drop-Out Spent 11 Years in Bed Due to Mysterious Illness, Invented a Surgery to Cure Himself https://t.co/fFDv14S2Sx 30 Retro Products That’ll Send You Back in Time https://t.co/MgHxELB6kr These Celebrities Were Discovered In Unique Ways https://t.co/FbSZxotw9p Lost Dog Returns Home With A Goat And A New Dog Friend https://t.co/2DXbUJ1sI9 RT @UberFacts: Mars once had salt lakes that are similar to those here on Earth and went through wet and dry periods, according to scientis… RT @UberFacts: Sleeping on the job is acceptable in Japan, as it's viewed as exhaustion from working hard. The First-Ever All-Female Spacewalk Has Just Taken Place https://t.co/2ObiF2FCWx RT @UberFacts: Exercising for just 10 minutes can improve your mood, reduce stress, and generally enhance your wellbeing. RT @UberFacts: This rescue opossum’s mom always cooks him mini portions of whatever she’s eating ❤️ https://t.co/fKjQ0xJ0Ej RT @UberFacts: Treating thoughts like material objects can increase or decrease their emotional impact.\n\nWriting negative thoughts down and… 29 People Who Failed So Hard It Was Funny https://t.co/g65DwEfi1K RT @UberFacts: The Macarena is about a woman named Macarena having sex with her boyfriend's friends. People Share Their Stories About Things Really Work on TV Shows like ‘Jerry Springer’ https://t.co/7dBrun0lAW New Moms Are Making Tons of Money Selling Their Breast Milk to Bodybuilders Online https://t.co/m80oSuR30I 20 People Share the Wild and Weird Things That Happened at Bridal Showers https://t.co/T3n3RUZ1A5 RT @UberFacts: The average British adult spends more time on the toilet than they do exercising. This Creepy Woman Photoshopped Herself Into a Stranger’s Photos For YEARS https://t.co/fVFnQCFGRl This man found an injured baby bat on his way to work 💞 https://t.co/8fcy3DD5zR 15 Creeped-Out People Share the Scariest Things They've Ever Seen in Their Lives https://t.co/7jFgB6ZEIh RT @UberFacts: Ketchup was once used as medicine to cure diarrhea. This brave little pup walks like a sea turtle! https://t.co/q6x6pWxezf RT @UberFacts: You produce about seven pounds of poop a week. 15 Real Truths About Life with a Cat https://t.co/2Qb8v2oam0 Millennials Are Re-Watching ‘White Chicks’ and Calling It Super Offensive https://t.co/iFbDYX7WMi Dogs can get a sense of when you're supposed to be home from work based on how much of your scent is left in the house. RT @UberFacts: Taking a nap for 15-20 minutes right after drinking caffeine can enhance its effects by increasing the availability of recep… 19 People Who Just Learned Weirdly Obvious Facts https://t.co/1oZRtRhS8K The Apollo 11 Astronauts Had to Go Through Customs When They Came Back from the Moon https://t.co/tZvv0I3y00 28 Percent of Delivery Drivers Admit to Eating Food from Deliveries https://t.co/BHugP1NlpD Watchmen' Is Changing The \"Pathetic\" Manner In Which Females Have Been Represented In Superhero Storytelling https://t.co/dibxwftWHw Joaquin Phoenix based his \"Joker\" laugh off of people who really had pathological laughing disorder. RT @UberFacts: Exercising before breakfast can burn twice as much fat, according to researchers from the University of Birmingham. No Two Butts Are Alike to Chimpanzees https://t.co/8my17TCL08 \"Dropping\" is a tradition among many Dutch parents; they take their kids camping, then abandon them in the forest at night so the child must find their way back on their own.\n\nSome parents follow their kids, hiding and growling in the dark. 40 Things You NEVER Knew About Your Favorite Disney Princesses https://t.co/F1HasSkNyR Excessive brain activity can shorten your lifespan, according to a study published in the journal Nature. 20 People Share Their Hilarious and Creative Pet Names https://t.co/Lek9xuxg1b 29 Hilarious Tumblr Posts About Cats for Anyone Who Needs a Laugh Today https://t.co/EyrNGodq8n RT @UberFacts: Wildlife is incredible 🦁🐻🐬 https://t.co/6NdDnjAfsM Roughly 71% of 17-to-24-year-olds in the U.S. wouldn't qualify for military service due to health issues, physical appearance, and educational background, according to the Pentagon. Chris Hemsworth Wants to Remake ‘Three Amigos’ With Chris Evans and Robert Downey Jr. https://t.co/IBh81VepuQ Mars once had salt lakes that are similar to those here on Earth and went through wet and dry periods, according to scientists. This Is Why so Many Ancient Statues Are Missing Their Noses https://t.co/w21xVYU63W RT @UberFacts: Two-thirds of millennials sleep nude, according to a 2018 study. Ted Bundy's Ex-Girlfriend And Her Daughter To Speak Out In New Documentary Series https://t.co/u8yxQm923y During pregnancy, if a mother suffers organ damage, the fetus sends stem cells to repair the damaged organ. A Mom Shared Her Thoughts About Quitting Drinking After a Weird Encounter with Another Mom https://t.co/R9r5URvZq3 Botched mission to capture El Chapo's son sparked by DC judge https://t.co/0zeCE1GeVb People Share the Moment They Realized They Were Attracted to the Opposite Sex https://t.co/cmkX4H2E4W Behind-The-Scenes ‘Wizard of Oz’ Facts That Will Send You over the Rainbow https://t.co/T0Pi2Xjbro 20 New Fathers Reveal How They Feel About Their Babies https://t.co/xx2zXNlDxd RT @UberFacts: Ravens are so smart, they know when someone is watching them.\n\nThey display what’s called “theory of mind,” the ability to a… Liam Payne says being in One Direction ‘nearly killed’ him https://t.co/iyry9WgllU A Woman Tried to Make Her Friend Change Her Dog’s Name Because It Was the Same as Her Baby’s https://t.co/HRFFJIxJDG This dad is determined to find his missing best friend 💖🐶 https://t.co/LCFrQnrbdY A Girl Called Her Ex a ‘Friend’ On Twitter…He Responded With the REAL Story https://t.co/cbXZrLmcpV Treating thoughts like material objects can increase or decrease their emotional impact.\n\nWriting negative thoughts down and literally throwing them away can help you 'get rid of them.' 20 Times People and Companies Got Roasted by Wendy's https://t.co/T9mYzIvJJr The 'Toy Jail' Method Is a Great Way to Make Sure Your Kids Clean up Their Toys https://t.co/GwENUCayHu Husband Fails That Will Make You Say ‘Bless His Heart’ https://t.co/KY3D1N3GVy Oregon Students Can Now Take Mental Health Days in Addition to Sick Days https://t.co/FNGfkxkrVt 20 Awful Clothing Disasters That Actually Happened https://t.co/Y9uNhEEQs9 Justin Bieber and Hailey Baldwin Didn’t Have Sex Until They Were Married https://t.co/YPOsfFLSB6 \"Clueless\" is being made into a TV show. This rescue opossum’s mom always cooks him mini portions of whatever she’s eating ❤️ https://t.co/fKjQ0xJ0Ej The 10 Car Brands That Cost the Least to Repair https://t.co/bjrM4CJC4f October 19th is International Gin and Tonic Day! Couple Who Adopts A Micro-Pig Missed One Life-Changing Detail https://t.co/du4aejQOwo RT @UberFacts: The ingredients in a chocolate chip cookie can trigger the same addictive response in the brain as cocaine, according to res… RT @UberFacts: As your brain gets used to alcohol, it tries to restore itself to a healthy state.\n\nWhen the alcohol suddenly wears off, it… Phrases That Every Single Mom Has Said at Least Once https://t.co/1YhMdhCDA1 American and Mexican Children Play Together on Seesaws Built into the Border Wall https://t.co/zce2ZY8iuQ Girlfriend Hires Woman to Catch Her Boyfriend Cheating but It Backfires Massively https://t.co/EAatCeOokS Exercising for just 10 minutes can improve your mood, reduce stress, and generally enhance your wellbeing. People Shared Their Sibling Photos and Showed That Family Can Be a Blessing and a Curse https://t.co/CHnt5RA03X Science Says Bella Hadid Is The Most Beautiful Person In The World https://t.co/3T383or3g3 Indian Scientists Used Mango Leaves to Solve a $2.5 Trillion Global Shipping Problem https://t.co/SPDfWqgD9h As your brain gets used to alcohol, it tries to restore itself to a healthy state.\n\nWhen the alcohol suddenly wears off, it has to readjust again, causing the \"shakes\" and increased anxiety. 18 Awkward Encounters That Show Us Why Airport Security Is the Absolute Worst https://t.co/jBCvifLMut RT @UberFacts: If You Were Stabbed By a Pencil And Still Have a Mark, You’re Not the Only One https://t.co/G4NiwOniAY The ingredients in a chocolate chip cookie can trigger the same addictive response in the brain as cocaine, according to researchers from the University of Bordeaux. Ryan Reynolds and Blake Lively Share First Photo of New Baby Daughter https://t.co/j6fh5GxHPS Serena Williams Destroyed 3 Men at Once on the Tennis Court https://t.co/yhgI516XPx Two-thirds of millennials sleep nude, according to a 2018 study. A Guy Asked the Internet for Advice About His Wife Not Cleaning Their House and Taking Care of Kids https://t.co/ShdzSzonPq You would weigh less in certain parts of Canada, such as the Hudson Bay area and Quebec, because they're \"missing\" some gravity. These Celebrities Are Still Spouting Anti-Vaxxer Nonsense https://t.co/9COzhNfPOs RT @UberFacts: This is the Testicuzzi, a mini hot tub designed specifically for testicles.\n\nThere's also a version that comes plated in 14k… These Two-Sentence Horror Stories Might Get Your Heart Rate up https://t.co/AdS9Dm8zOb Ravens are so smart, they know when someone is watching them.\n\nThey display what’s called “theory of mind,” the ability to attribute mental states to others. 15 People Share How Awful Airports Can Be https://t.co/pJfjJZ8ymx 33 Organizing Products That’ll Turn You Into Martha Freakin’ Stewart https://t.co/ZWCBzAvZYq The 1986 film \"Top Gun\" was produced in collaboration with the Pentagon to rebrand the US Navy's image post-Vietnam war.\n\nIt was the first full-blown partnership between Hollywood and the US Navy. 15 Funny Tweets About How British People Speak https://t.co/S5HhsZZIIw RT @UberFacts: Watch this 135-pound dog fall in love with a little piglet 😍 https://t.co/q9JO6fhG1l Taking a nap for 15-20 minutes right after drinking caffeine can enhance its effects by increasing the availability of receptors in your brain. Definitive Proof That Newfoundlands Are the Best Dogs in the World https://t.co/EBxn5JORr1 20 Funny Photos Taken by the Best Real Estate Agents Around the World https://t.co/bkEbYG5HFA Ketchup was once used as medicine to cure diarrhea. Here Is The Most Popular Book From the Year You Were Born https://t.co/IJqtWuSJ29 Kelly McGillis Said She Wasn’t Asked to Be in the Top Gun Sequel for a Simple Reason: Because She's Aged https://t.co/dTsCO9TX0h People Share Things They like but They Can't Stand the Fan Base https://t.co/IMamZ3Ni6K Completely Inappropriate Toy Designs We Can’t Believe Really Exist https://t.co/DqofB8sRas RT @UberFacts: The television show \"Mr. Robot\" has a team of cybersecurity experts and hackers who make sure the hacking done on the show i… The average British adult spends more time on the toilet than they do exercising. ‘Wheel of Fortune’ Contestant Shocks Pat Sajak When He Says He’s “Trapped In a Loveless Marriage” https://t.co/n6j6GcMHrP Pogonophobia is the fear of beards. Wildlife is incredible 🦁🐻🐬 https://t.co/6NdDnjAfsM Mom Gives Birth to ‘Mini Sumo Wrestler’ Baby Girl Weighing 13lbs https://t.co/TXkosMupkg You produce about seven pounds of poop a week. Schoolgirl Refuses to Answer 'Offensive' Homework Question https://t.co/z2IXpCWYrE Ladies, Your Boobs Will Be Cool All Summer with These Freezable Bra Inserts https://t.co/kbbIljphFq Gay Couple Adopt HIV-Positive Child After She Was Rejected by Ten Families https://t.co/HnBuUVCIUV People Share the Scariest Situations They’ve Experienced While Traveling https://t.co/SvPHdhx5IM Exercising before breakfast can burn twice as much fat, according to researchers from the University of Birmingham. All-Woman Delta Team Flew 120 Girls to NASA to Get Them Excited About Aviation Careers https://t.co/o32Bkjf5UE 15 Photos and Memes About Really Great Wives https://t.co/9LJmtOHa5p This could be the cutest love story of all time 😭💞 https://t.co/wfLa4SoB1a These epic fast food fails rival Panera's mac and cheese shame https://t.co/tsklk6qP0e A Woman Runs a Dog Hospice Where She Spends the Last Days with Dying, Abandoned Dogs https://t.co/daVgTOYexN RT @UberFacts: Bees Have Been Declared the Most Important Living Thing on Earth https://t.co/874I7I1AEU World’s Most Tattooed Doctor Speaks Out About the Judgement She Receives https://t.co/yUwWIZjfNl Meet a genius corgi! https://t.co/uOs1hSiIiA A High School Student Came out in His Valedictorian Speech and Was Greeted with Wild Applause https://t.co/MmyR607OBB Gina Rodriguez issues second apology for n-word video https://t.co/iAypBfd0d4 This dwarf pittie pup is simply perfect 💗 https://t.co/yBRbrjHlBU ... WOW 👏👏👏 https://t.co/Ok6ydNN3hC 13 Seriously Terrifying Traits of Animals You Probably Thought Were Cute and Fuzzy https://t.co/SGkJE3THA0 12 Funny Tweets That Have Lots of Laughs https://t.co/DJLmvKY3xO The Apollo 11 Astronauts Were Honored with Butter Sculptures at the Ohio State Fair https://t.co/YaskmtgHBM These Bizarre Punishments Are Downright Inspirational https://t.co/ONCPmPHDYY The television show \"Mr. Robot\" has a team of cybersecurity experts and hackers who make sure the hacking done on the show is accurate. RT @UberFacts: Watch as this mini 'alien' turns into a feisty dog ❤️ https://t.co/qq5j9p0F1z RT @UberFacts: The financiers of the 2009 movie \"The Human Centipede\" didn't discover the full nature of the film until it was finished. ‘Magic’ Penis Cleaner Has Men Saying Same Thing https://t.co/37pPZ5eyEO This is the Testicuzzi, a mini hot tub designed specifically for testicles.\n\nThere's also a version that comes plated in 14k gold. https://t.co/CHMCzaI2dX RT @UberFacts: King Henry VII's mother gave birth to him at the age of 13. Her youth and small size made the delivery particularly difficul… October 18th is National Chocolate Cupcake Day! Tyler Perry Wants To Help Displaced Women and LGBTQ Youth https://t.co/XIfkPgjkzx Hilarious Tweets From Celebrity Parents That Prove They Struggle Too https://t.co/HyAPsgG3Dc This Mom and Daughter Are SLAYING Disney Dress-Up On Instagram https://t.co/fyEUlr0lyD You Can Spend Halloween in ‘The Addams Family’ Mansion https://t.co/BYZPXT57Yu If You Were Stabbed By a Pencil And Still Have a Mark, You’re Not the Only One https://t.co/G4NiwOniAY Sometimes the Hospital Is Actually a Pretty Funny Place to Be https://t.co/FGsiFRDzJq This Is What Happens When You Cheat On Your Boyfriend and Accidentally Text Him About It https://t.co/FOrU4VqbJb 37 of the Handiest Gadgets on Amazon Under $25 https://t.co/MsIV1hfBKM Angry Wife Sends Lazy Husband Shopping With Fake List to Get Revenge https://t.co/CSfNNHzs8I RT @UberFacts: The first chocolate bar was made in 1847.\n\nBefore that, chocolate was only a drink. Mom Shares Graphic Photo To Warn Parents About the Dangers of Babywearing https://t.co/v4R8hAnz4X RT @UberFacts: The Garlock fault in California, capable of producing a magnitude 8 earthquake, has begun moving for the first time in moder… King Henry VII's mother gave birth to him at the age of 13. Her youth and small size made the delivery particularly difficult, rendering her unable to have any more children.\n\nShe had been married three times by the age of 15. 39 Photos of Beauty Mistakes That Will Make All Women Cringe https://t.co/JgJKK4gO3Y RT @UberFacts: Jenna Fischer and Angela Kinsey (Pam and Angela from \"The Office\") have started their own podcast called Office Ladies. RT @UberFacts: Los Angeles residents are slightly less happy than rest of country, according to a study from USC. Alyssa Milano Explains Why She Didn't Name the \"Very Visible\" Actor Who Allegedly Sexually Assaulted Her https://t.co/Zglev1xazt The financiers of the 2009 movie \"The Human Centipede\" didn't discover the full nature of the film until it was finished. Watch as this mini 'alien' turns into a feisty dog ❤️ https://t.co/qq5j9p0F1z 18 Real-Life Titanic Facts the Movie Didn’t Tell You https://t.co/bkTqmKmvEg This Might Make You Feel Old. These 20 Songs Are Now Considered Classic Rock. https://t.co/UaX2hxxRoR Bees Have Been Declared the Most Important Living Thing on Earth https://t.co/874I7I1AEU Las Vegas Is Dealing with a Grasshopper Invasion https://t.co/sZsmCqckmE Cruise Ship Pictured Squeezing Through Canal With Just Inches to Spare https://t.co/i1lCJ3y8xj 15 People Reveal the Weirdest Things Their Partners Say in Their Sleep https://t.co/0ItggT5avr People Are Growing out Their Toenails for Fashion. Prepare Yourself. https://t.co/f3bBoSHt16 Lost Dog Waits Four Years in the Same Spot Before Being Reunited With Owners https://t.co/s2Oy1chZ1P 15 People Share Tricks for Falling Asleep When You’re Not Tired https://t.co/XBjvOikO7o There was only one way to save these guys. https://t.co/eVjxuqsG8h Body found in Columbus Circle manhole had been there two weeks, chewed up by rats https://t.co/qAtLwkCqlx These People Saw Bad Parenting and Shared It with the World https://t.co/a8rFoOFaL8 15 People Who Broke the Law...And Got Away with It https://t.co/ltAjtTd4cA Ten Ponytail Hacks That Will Completely Change the Way You Look! https://t.co/yWFykr3DLX Watch this 135-pound dog fall in love with a little piglet 😍 https://t.co/q9JO6fhG1l Men and Women Confess What Really Goes on at Bachelor Parties https://t.co/Al04CeMuFY Matt Lauer had an affair with a 'well-respected' NBC star https://t.co/EB5EFVrLql A Guy Live Tweeted His Uncle and Grandpa’s Hearing Aid Appointment https://t.co/5qhIOteEtQ RT @UberFacts: Congressman Elijah Cummings has died at the age of 68.\n\nCummings passed away at Johns Hopkins Hospital due to \"complications… The Garlock fault in California, capable of producing a magnitude 8 earthquake, has begun moving for the first time in modern recorded history. 31 Cheap Little Things That’ll Make You Smile https://t.co/SbwfO0cbAq A New Service Lets You Rent Swimming Pools by the Hour https://t.co/UN4AquTdG3 Are You Always Hungry? Here Are Some Potential Reasons You Can’t Stop Munching. https://t.co/Xo5HHyG6NS 19 People Reveal the Reason They Said ‘No’ After a Public Marriage Proposal https://t.co/UjwpwGoxzD 15 Moms That Are Keeping Some Pretty Juicy Details from Their Kids https://t.co/NPmeJSbJrG 8 Women from History Who Were Scandalously Awesome https://t.co/iCkm33vo42 Woman Threatened to Be Kicked off Flight If She Didn’t ‘Cover up’ https://t.co/Kb7qtuohCe In the Last Two Years, Scientists Have Discovered over 50 Species of Plastic-Eating Fungi https://t.co/T6xfpJwjPj Ed Sheeran Has Spent Millions Buying Houses and Property from His Complaining Neighbors https://t.co/N8RZoSetvZ Former NFL Player DeAngelo Williams Paid for 500 Mammograms In Honor Of His Mother https://t.co/JvjgRSoxsr Los Angeles residents are slightly less happy than rest of country, according to a study from USC. Patients Share Jaw-Dropping Confessions About Their Stay in Mental Hospitals https://t.co/650bXYW6cu 15 Times People Lost a Job Because They Were Brutally Honest https://t.co/9fofeS6yyD Jenna Fischer and Angela Kinsey (Pam and Angela from \"The Office\") have started their own podcast called Office Ladies. These Hilariously Clueless Kids Will Make You Happy To Be Child-Free https://t.co/EjApldn3gI Check out These Funny Tweets About White Claw, the Hard Seltzer Drink That Is Sweeping the Nation https://t.co/iRD5DQlNTP 15 Disney Product Fails That Are Way More ‘Creepy’ Than ‘Cute’ https://t.co/GjQcPuwVwD RT @UberFacts: If you order a new Volvo, the company will fly you to Sweden all-inclusive, to let you test drive your car and explore the c… Congressman Elijah Cummings has died at the age of 68.\n\nCummings passed away at Johns Hopkins Hospital due to \"complications concerning longstanding health challenges,\" according to a statement released by his office. A Mansion Is On The Market For $10, And No One Wants To Buy It https://t.co/8BPckpbXcQ 19 Perfectly Ridiculous Photos From Around the Internet https://t.co/FXaxiABRWg 33 Things I Don’t Own but REALLY Want on Amazon https://t.co/o04sIv3FH8 Man With Micropenis Is Suing His Wife for Revealing His Secret https://t.co/T9QGKUrQqs RT @UberFacts: It's amazing how a little love can heal ❤️️ https://t.co/hyJiXmO5Jx RT @UberFacts: The average human farts 14 times a day.\n\nUsing that figure, humanity has farted about 17 quadrillion times throughout human… Man Invents App The Locks Child’s Phone Until They Call Their Parents Back https://t.co/AudDokS5ex RT @UberFacts: Your head ages faster than your feet.\n\nYour feet are closer to the center of Earth's gravitational field, where time moves s… RT @UberFacts: Happiness is contagious. RT @UberFacts: Every day, this woman drives to a \"dumping ground\" to save abandoned dogs 🙏❤️ https://t.co/q6Z74UdFn2 RT @UberFacts: The first known guacamole recipe that was recorded in English was written by a pirate.\n\nWilliam Dampier used the words “tort… Top Ten List of the Names of Naughty Children https://t.co/KCnxIIZ8K5 What would you add to this list? https://t.co/BYws17y0fE If Your Wife Is Obsessed with Amazon, You Buy Her an Amazon Birthday Cake https://t.co/KldoFaVFSz 37 Genius Products on Amazon With Over 1,000 Reviews https://t.co/3FaEMsT7Py RT @UberFacts: \"Home Alone\" was initially produced by Warner Bros, but when the budget grew from $14 to $17 million, they were no longer in… 15 Foodies Detail the Worst Meals They’ve Ever Had https://t.co/EVE0D4olB1 Teenagers Are Now Boiling Tampons to Get High https://t.co/Jpvj1rqDPP People Share the Weird and Funny Habits of Their Pets https://t.co/OOpuozT1dz RT @UberFacts: 84% of vegans and vegetarians eventually go back to eating meat, according to research conducted by the US Humane Research C… Martin Scorsese Says Marvel Movies Are “Not Cinema,” Compares Them To Theme Parks https://t.co/iFVGCXCyRu People Share the Weird, Wild Family Secrets That Embarrass Them to This Day https://t.co/WCj9zrsY0q RT @UberFacts: The phrase “when one door closes, another opens\" was said by Alexander Graham Bell, which he followed by saying:\n\n\"but we so… This Artist’s Reimagined Disney Characters Are Absolutely Incredible https://t.co/yGbCOsaoct Guys Share Why They Don’t Care at All About Thigh Gaps https://t.co/PAnmwcWeko Chinese Zoo Glues Basket to Tortoise's Shell for Tourists to Throw Money In https://t.co/JXy2rdVfKP 15 Tweets from Mid-2000s Kids https://t.co/O5gUSaYzsu RT @UberFacts: Researchers studied how a mother's health can affect their child and found that stressed pregnant women are more likely to h… Every day, this woman drives to a \"dumping ground\" to save abandoned dogs 🙏❤️ https://t.co/q6Z74UdFn2 30 Tweets That Prove Los Angeles Is a Vapid Place Full of Terrible but Hilarious People https://t.co/2oZ3FutYhq This Is Why You Have Black Dots on the Edges of Your Car Windows https://t.co/C4Ee2jyh1F RT @UberFacts: Pineapples were very expensive in the 1700s, so American colonists would rent a pineapple and carry it around a party to fla… Happiness is contagious. Cosmonauts take spacewalk outside International Space Station https://t.co/plhNjkTCUJ Your head ages faster than your feet.\n\nYour feet are closer to the center of Earth's gravitational field, where time moves slightly slower. Behind the scenes secrets of \"Jeopardy\" you didn't know you needed to know. https://t.co/2pzvMovhSY Watch as this dwarf pit bull puppy grows up to boss every one else around ♥️ https://t.co/iRnLTD7aAI The average human farts 14 times a day.\n\nUsing that figure, humanity has farted about 17 quadrillion times throughout human history. 37 Brilliant Inventions You Can Get on Amazon Under $25 https://t.co/ksRQY4u8Oo It's amazing how a little love can heal ❤️️ https://t.co/hyJiXmO5Jx We've all wanted to have that movie moment. https://t.co/kAqAa0I1QU ‘Marriage Story’ is wonderful, but far too long https://t.co/xZG7bCMctj The first known guacamole recipe that was recorded in English was written by a pirate.\n\nWilliam Dampier used the words “tortilla,” “soy sauce,” and “breadfruit,” unknowingly documenting the first-ever recipe for guacamole. Listen up, fellas. https://t.co/FIipTayMie Take a Look at This Rescue Kitty with Four Ears and One Eye https://t.co/afKTv9u3XX 84% of vegans and vegetarians eventually go back to eating meat, according to research conducted by the US Humane Research Council. Restaurant Patrons So Awful, We Can’t Believe They Exist in Real Life https://t.co/3GWNv1z67Q \"Home Alone\" was initially produced by Warner Bros, but when the budget grew from $14 to $17 million, they were no longer interested, and 20th Century Fox took it over.\n\nThe movie went on to gross $476.7 million. Sometimes revenge can be... kind of sweet? https://t.co/nJyAuTVi0B RT @UberFacts: The Walt Disney Company was founded on October 16th, 1923.\n\nExactly 96 years ago. 31 Things To Treat Yourself to This Instant https://t.co/C6WVflQvTu 10 People Who Made Marriage Pacts with Their BFFs Share What Happened https://t.co/zK2WK3wot6 A Funny Man Resigned from His Job with a Condolence Card https://t.co/ATceMm65q3 Wanted Man Replied To Police Facebook Post And The Result Was Hilarious https://t.co/URPvMsPCN6 10 Times People Had the Perfect Responses Online https://t.co/fA3YyGENOr Watch as people rush to save an endangered 500-pound fish 😱 https://t.co/Te0hNJWR4I A Lot of Millennials Don’t Know What Auschwitz Is, so Oregon Is Requiring Schools to Teach About It https://t.co/8sEQdGUitt A Waiter Served a Pregnant Woman Virgin Cocktails After She Ordered Real Ones https://t.co/z51hfEOC5A 41 Celebrity Couples Who Have Been Together the Longest https://t.co/mfoZgL2Ntz RT @UberFacts: This dog is just OBSESSED with his tennis balls 🎾🎾🎾 https://t.co/5ms2BHAjNn RT @UberFacts: The electric chair was invented by a dentist. The Walt Disney Company was founded on October 16th, 1923.\n\nExactly 96 years ago. 37 Brilliant Gadgets That Are Somehow Under $5 On Amazon https://t.co/GHCEpyZYd9 RT @UberFacts: California Becomes First U.S. State to Ban Animal Fur Products https://t.co/Ki0CB0q1cN RT @UberFacts: This dog is so excited to finally have wheels — now he needs a family! ❤️ https://t.co/OHCgQ4ofLZ Researchers studied how a mother's health can affect their child and found that stressed pregnant women are more likely to have girls. 19 People Share the Most Unpopular Opinion They Have https://t.co/FNwEMqMyn5 Ex-Cons Share the Prison Habits They Had a Hard Time Breaking https://t.co/7EtsmFM7e8 29 Pictures You’ll Wish You’d Never Seen https://t.co/TuHHd7B20Z RT @UberFacts: \"I Love Lucy\" aired for the first time on October 15th, 1951.\n\nExactly 68 years ago. 7 Documentaries That Have Crazy, Unpredictable Twists https://t.co/OY3QLYbo5p RT @UberFacts: CNN has a video scheduled to be broadcasted when the end of the world is upon us. 5 Inaccurate Things in Netflix's \"The Dirt\" About Motley Crüe https://t.co/FxYLxPnRjp Just 30 Awesome Things Under $25 I Love on Amazon https://t.co/j8ZsH7ef07 RT @UberFacts: Start your day off right with this video of a red panda seemingly trying to intimidate a rock. https://t.co/3eukvJAqfR This dog is so excited to finally have wheels — now he needs a family! ❤️ https://t.co/OHCgQ4ofLZ 37 Cleaning Gadgets That Will Make Disgusting Things Clean Again https://t.co/K6sX2rW260 RT @UberFacts: The moon is 1/400th the size of the sun, but it's also 1/400th the distance away from Earth.\n\nThis is why the sun and moon l… People Share Weird and Hilarious Compliments They Got from Strangers https://t.co/iFyzkan00q Watch 15 Liars Get Hilariously Called out by the Internet https://t.co/nrwE2oDBy3 Scuba Divers Captured a Photo of a Human-Sized Jellyfish https://t.co/coqCMyE8Uf ‘West Wing’ Creator Aaron Sorkin Says “Better Voters” Are The Solution To Donald Trump https://t.co/v8jegmCtmZ RT @UberFacts: Just one cup of coffee can burn calories and promote weight loss, according to researchers at the University of Nottingham. This Guy Crafted the Perfect Revenge After Neighbors Threatened His Dog https://t.co/73ACjClzBl All-Woman Delta Team Flew 120 Girls to NASA to Get Them Excited About Aviation Careers https://t.co/o32Bkjf5UE Parents Say Kids Are Heartbroken and 'Feel Like the World Has Ended' After 'End of Fortnite' https://t.co/DQaoNtNgRv This Is How People in Great Britain Manage During the Relentless Heatwave https://t.co/2A5Raw4K8n Here Are All the Things ‘The Simpsons’ Predicted That Came True https://t.co/gm5nrYuhBY Iranian Music Streaming Site Removed Female Artists From Their Own Album Covers https://t.co/69fL2cp9ai RT @UberFacts: A black man named Laurence C. Jones survived a near-lynching in 1918 by showing the white mob how passionate he was about ed… RT @UberFacts: When Tim Staffell, the chief model maker for \"Thomas the Tank Engine,\" left his band Smile in 1970, he was replaced by Fredd… California Becomes First U.S. State to Ban Animal Fur Products https://t.co/Ki0CB0q1cN 20 Nannies Confess How They Really Feel About Their Host Families https://t.co/UoD0w9hBUP RT @UberFacts: The teeniest, sassiest puppy ever got an even tinier foster brother! ❤️ https://t.co/smiJ4PSyQk Researchers have found new way to bring oxygen to Mars https://t.co/YTOWpJMDun A Mom’s Response to Her Daughter’s Interracial Relationship Went Viral in a Big Way https://t.co/SWvK0Vdowo People Give Advice on What NOT to Do in a Fight https://t.co/5gWr7orco3 31 Gadgets SO Advanced They’ll Make You Feel Like You’re Living in 3018 https://t.co/7kQ80LTM6T RT @UberFacts: Only 27% of people look at every poop they take, according to a 2014 study conducted by gastroenterologists. A Bunch of Women Shared Their Horror Stories on Twitter of Working in a Male-Dominated Industry https://t.co/EOf0sXLb4Y Thomas Markle defends releasing daughter Meghan Markle’s private letter https://t.co/M2cCBGuqY3 Take a Look at These Mental Health Tips If You Are Struggling with Depression https://t.co/cWdrzqFdnm You Can Stay Overnight in the Oscar Mayer Wienermobile Through Airbnb https://t.co/ckjP0pbIAa Real Hilarious Baby Names People Have Actually Named Their Kid https://t.co/MexHYq69cA The electric chair was invented by a dentist. This dog is just OBSESSED with his tennis balls 🎾🎾🎾 https://t.co/5ms2BHAjNn RT @UberFacts: A Genius Modified a Roomba to Yell Swear Words When It Crashes into Something https://t.co/ISUhU8JSru It really is harder for humans to distinguish the facial characteristics of people from different races, according to a study from the University of California, Riverside. Need A Mood Booster? These People Instantly Regretting Their Terrible Decisions Will Make Your Day https://t.co/58SPJvLW9k CNN has a video scheduled to be broadcasted when the end of the world is upon us. RT @UberFacts: Guy stops on his way to work to free a trapped raccoon https://t.co/DtZ0UgBLFA 12 Funny Tweets from Parents About Their Kids https://t.co/Hy24k4FqaT When Tim Staffell, the chief model maker for \"Thomas the Tank Engine,\" left his band Smile in 1970, he was replaced by Freddie Mercury.\n\nSmile then became Queen. 37 Low-Key Popular Products Perfect for any Grown Lady Life https://t.co/WWmAKby4oB \"I Love Lucy\" aired for the first time on October 15th, 1951.\n\nExactly 68 years ago. These Therapy Stories Might Make You Feel like You’ve Had a Cathartic Session of Your Own https://t.co/RE0dTE6YTu People Are Sharing Videos of Their Dogs Reacting to the Sound of a Bag of Chips https://t.co/24pGvb3OBg What Is America’s Friendliest State? https://t.co/1fntSTfBFV A Man Tested Petco’s ‘All Leashed Animals Welcome’ Policy with a 1,600-Pound Bull https://t.co/TAPBf1BOcA A Design Student Won an Award for a Chair That Prevents “Manspreading” https://t.co/2AHmMEbKoW 20 People Who Are Dating Someone They Look Like https://t.co/SJPpMjpOny A black man named Laurence C. Jones survived a near-lynching in 1918 by showing the white mob how passionate he was about educating African-American children.\n\nThe mob ended up collecting money to give to Jones to help his school. Just one cup of coffee can burn calories and promote weight loss, according to researchers at the University of Nottingham. RT @stouffers: @UberFacts 👀 An American Woman Is Trapped in Saudi Arabia With Her 4-Year-Old Daughter Because of Her Husband https://t.co/wj1QNt70Lf Only 27% of people look at every poop they take, according to a 2014 study conducted by gastroenterologists. 19 Creepy, True Stories That Might Ruin Your Sleep Tonight https://t.co/4qwhE3ycG7 Which City Is The World’s Safest? https://t.co/y5cNsThqPI Start your week off right! https://t.co/pDrvAM5RuO RT @UberFacts: There was a bisexual goose from New Zealand named Thomas, who fell in love with two swans and helped raise 68 of their babie… 29 People Confess Which ‘Unattractive’ Celebrities They Find Extremely Hot https://t.co/grzy91GaPn This man was determined to reunite a lost baby deer with her mom ❤️ https://t.co/9nfUeKsfmb A Poor Person Explained What Invisible Poverty Looks like to His Wealthy Friend https://t.co/gO1im59wsa These People Are Having Just the Worst Day Ever https://t.co/NIsPyg6lJQ RT @UberFacts: California has become the first US state to ban the production and sale of animal fur.\n\nResidents will no longer be able to… Guy stops on his way to work to free a trapped raccoon https://t.co/DtZ0UgBLFA A Family Brawl Made Disneyland the Un-Happiest Place on Earth https://t.co/tPmOUK01yo RT @UberFacts: There's a 15-story car vending machine in Singapore.\n\nIt's filled with Ferraris, Bentleys, and other high-end cars. https://… 37 of the Handiest Gadgets On Amazon Under $30 https://t.co/bwZsDtSf3n A Genius Modified a Roomba to Yell Swear Words When It Crashes into Something https://t.co/ISUhU8JSru Here's Christopher Walken dancing in over 50 movies edited into a single music video you didn't know you needed... https://t.co/2l5NBddEiq RT @UberFacts: The American football huddle was created in 1890 at a deaf university where the players needed to be able to sign plays to e… Parents Confess What They Really Think About How Their Kids Look https://t.co/ZimEE8S4ZV Megachurch Pastor Given Standing Ovation After Admitting He Orally Raped a Teenage Girl https://t.co/GbbNgfXGlw If dogs could talk...\n\n😂 https://t.co/BNgEKgzF5j RT @UberFacts: Procrastination and impulsivity are inherited behaviors, according to a 2014 study published in the journal Psychological Sc… If you're trying to feel something, this will do it... https://t.co/qqAput8FX6 Check out These Last Shots from the Final Episodes of Iconic 1990s TV Shows https://t.co/8go3AMjpCV 35 Affordable Luxuries You Should Treat Yourself To https://t.co/BS5apFzJ4B RT @UberFacts: Cats and dogs can be allergic to humans. 15 Photos Of Interesting Creatures in Australia https://t.co/Iqwa5t6zlh 30 Cults That Make American Horror Story Seem Normal https://t.co/uJBQKewZpp The teeniest, sassiest puppy ever got an even tinier foster brother! ❤️ https://t.co/smiJ4PSyQk RT @UberFacts: The children of identical twins are genetically the equivalent of siblings, not cousins. The 41 Greatest Shark Tank Inventions Under $25 on Amazon https://t.co/FioGvClGpK Want Wine and Cheez-Its in One Box? Consider Your Next Girls Night Catered! https://t.co/8LVkw165iy 10 Ways to Improve Your Grilling, According to BBQ Experts https://t.co/pYfK0NEdMV Ja Rule Compares Fyre Festival to the Titanic, But in a Good Way: It’s Like “If They Built the Titanic, And It Worked” https://t.co/zniPz4PGkF RT @UberFacts: If you were to drive your car vertically into the sky at 60 MPH, it would only take an hour to reach outer space. 15 Tweets from Dads Who Have Accepted the Hilarious, Undignified Reality of Fatherhood https://t.co/eZqSCy4kvo What Angelina Jolie 'Lookalike' Actually Looks Like https://t.co/HECKW7Q295 This dog was nursing her 10 puppies when she adopted a litter of orphans ❤️ https://t.co/lkNNZQa0jM Sugar Daddy Gives Student Credit Card to 'Drain' in Exchange for Pictures of Her Feet https://t.co/VjbStUoBqx RT @UberFacts: Cottage cheese is an ideal before-bed snack, according to researchers from Florida State University.\n\nIt has a positive effe… Rihanna Says Trump Is 'the Most Mentally Ill Human Being in America' https://t.co/lbMJat5nBf Shakes pier... 😂 https://t.co/o8cAE9aYTC Everyone should take a look. https://t.co/T98ALc7v0S Brie Larson Is Pushing for an All-Female Marvel Movie and We're Here for It https://t.co/pIFhklOJrl RT @BriiRamirezz: lol i lost my job for this video https://t.co/0Ao8a4revN RT @UberFacts: In 1958, Louis Armstrong once asked Richard Nixon to carry his bags for him in a New York airport. Nixon, being Vice-Preside… A wedding photographer told a social media influencer \"no free pictures\" and hilarity ensues... https://t.co/M5JddjuM0L Penny saver buys car with $18K in coins https://t.co/wnra6p6hwE All the feels ❤️❤️❤️ https://t.co/T24E8E3IGH Watch as this sick stray puppy transforms into a new dog with the help of some rescued baby chimps 😍❤️ https://t.co/uiiKWYTRyX Ford Dealership Offers a Free Bible, American Flag, and $400 off an Assault Rifle With Every Car Bought https://t.co/Qyt7ugfgsL Amy Schumer was ‘afraid’ to return to work after giving birth https://t.co/S70E25mbei This Girl Posted a Sexy Selfie On Twitter, But the Internet Noticed Something Troubling Going On… https://t.co/EqvS4WGMkW 33 Things I Don’t Own And REALLY Want On Amazon https://t.co/VdGkAGxDy0 20 Terrible Food Photos That Will Make You Question People’s Sanity https://t.co/DD83kpgVf0 Over $170,000 Donated to Five-Year-Old Child With Rare Disease https://t.co/Olnu2n968C These Might Just Be the Ugliest Pairs of Shoes on the Planet https://t.co/N0h8HmdRML 35 of the Handiest Products on Amazon Under $30 You’ve Never Seen Before https://t.co/n1M5NTA1zf Woman Saved a Baby Elephant's Life and Now He Follows Her Everywhere https://t.co/0HVgiZDfq5 Disney Is Opening a Marvel-Themed 'Avengers Campus' Park in 2020 https://t.co/if46UL0TrF Simone Biles Makes History by Winning 25th Gold Medal at World Championships https://t.co/pqlePi8MRt This guy seriously needed an extra seat... for his pizza. https://t.co/TvLdvvuWXJ Cats and dogs can be allergic to humans. Don't be this guy... https://t.co/MeBBaAqJVw RT @UberFacts: All astronauts going to the ISS must learn to speak Russian.\n\nMost humans leaving Earth must do so through Russian territory… 36 Cheap Gadgets That Solve Annoying Problems https://t.co/K7gBwmRsJr Procrastination and impulsivity are inherited behaviors, according to a 2014 study published in the journal Psychological Science. There's a 15-story car vending machine in Singapore.\n\nIt's filled with Ferraris, Bentleys, and other high-end cars. https://t.co/t1W2hxrHaL A Photographer Shoots Senior Citizen Couples in Engagement-Style Photos https://t.co/iUsyxrZjfE People Share What They Found When They Cleaned out a Dead Family Member’s Home https://t.co/idCctQ4B2P Mom Hits Teen Daughter With Flip-Flop From Impossibly Long Range https://t.co/cEitJF8aDU RT @UberFacts: Sugar-free hard seltzers, such as White Claw, get you drunker while reducing the likelihood of a hangover the next day.\n\nThe… The children of identical twins are genetically the equivalent of siblings, not cousins. These Hilarious GIFs All End in a Perfect Plot Twist https://t.co/sJsIwA3crP \"For every human being who looks up at the moon in the nights to come will know that there is some corner of another world that is forever mankind\" https://t.co/WCEwvXuvy7 RT @UberFacts: While undergoing surgery, a patient can experience \"anesthesia awareness.\"\n\nThey can wake-up and become aware of what's happ… The Funniest (But Understandable) Reasons Real People Ended Their Relationships https://t.co/iyqqOuZzCT Start updating your resumés, folks... https://t.co/B0TOuNf72e California has become the first US state to ban the production and sale of animal fur.\n\nResidents will no longer be able to sell or make clothing, shoes or handbags from fur as of 2023. When Will ‘Joker’ Be on VOD? https://t.co/HQ7LcW1cQS RT @UberFacts: This baby needed a mom — these women said \"YES\" ❤️❤️ https://t.co/VpunJsXo1p You can now pay to cuddle with cows at this New York farm. https://t.co/bVm5IFeCIi Justin Trudeau Asked By Children Why He Painted His Face Brown https://t.co/KWok786pCS If you were to drive your car vertically into the sky at 60 MPH, it would only take an hour to reach outer space. Adam Sandler's Murder Mystery Is Getting a Sequel on Netflix https://t.co/j7zAyxlbJJ RT @UberFacts: You're 10 times more likely to be bitten by a New Yorker than a shark. Aaron Carter Says He Has 12-Year-Old Son He's Never Met and Reveals Meaning Behind New Face Tattoo https://t.co/a9dFbVibmM Eek eek eek 😱 https://t.co/IZIdaSdw5U This whole thread is just one big mood 😂 https://t.co/u1wkNdnCiN Birth Mom of '9-Year-Old Dwarf Child' Confirms She's Actually Much Older https://t.co/fcBy15awZh The American football huddle was created in 1890 at a deaf university where the players needed to be able to sign plays to each other without the other team seeing. RT @UberFacts: Simone Biles has won her 25th medal at the gymnastics world championships.\n\nShe is now the most decorated gymnast in world c… Is this the world's next Grumpy Cat? https://t.co/ayK0DvO4iD This tiny hedgehog loves climbing in her mom’s shirt for snuggles 💜 https://t.co/9TGLDfJUPr Watch as this tiny baby grows up to be the most gorgeous pittie ever! ❤️ https://t.co/VqAxz15JnN Uganda Plans to Bring in Death Penalty for Homosexuals https://t.co/HnhuiS7fxE 15 People Share on What Behaviors Scream “I Am Upper Class” https://t.co/lWiF1qSxFI There was a bisexual goose from New Zealand named Thomas, who fell in love with two swans and helped raise 68 of their babies.\n\nHe died in February of 2018 and was almost 40 years old. ‘Stranger Things’ star Joe Keery responds to fan outrage over his bowl cut https://t.co/ZXBotauYFt Cottage cheese is an ideal before-bed snack, according to researchers from Florida State University.\n\nIt has a positive effect on your metabolism and overall health, helps improve muscle recovery, and doesn’t result in body fat gains. This Is Why You Shouldn’t Drink Coffee Before Breakfast https://t.co/O1rHSVQSdG 15 People Share Why They're No Longer with Their Ex https://t.co/cUySlT71wg In 1958, Louis Armstrong once asked Richard Nixon to carry his bags for him in a New York airport. Nixon, being Vice-President at the time, didn't have to go through customs.\n\nThe bags contained three pounds of marijuana. Science Says Hot Baths Burn as Many Calories as a Run https://t.co/OOaFO68RPW RT @UberFacts: October 13th is National No Bra Day! RT @UberFacts: These scientists just spotted a crazy sea creature and they can't EVEN... 😳😂 (via @EVNautilus) https://t.co/h8LRSwHeT7 The internet was there to let him know he made the right choice... https://t.co/FKQsaSwAw3 37 of the Handiest Gadgets on Amazon https://t.co/jn9hxm73Fo 15 People Share Things That They Know Are Not as Easy as They Seem https://t.co/ZyJsuZK8ef Funny tweets about moms who have parenting down to a science. https://t.co/4RaVeOL4yU Simone Biles has won her 25th medal at the gymnastics world championships.\n\nShe is now the most decorated gymnast in world championship history. https://t.co/HKXvMnanPT A Woman’s Job Interview Was Cancelled Because She Asked a Simple Question https://t.co/41Ny2ACcYz Sugar-free hard seltzers, such as White Claw, get you drunker while reducing the likelihood of a hangover the next day.\n\nThe carbonation causes your bloodstream to absorb the alcohol more quickly, and the lack of sugar helps you stay more hydrated. These “southern” versions of the zodiac signs are pretty darn accurate https://t.co/yd6FeiP6eo The late Grumpy Cat once made a cameo. https://t.co/qsznjzapte While undergoing surgery, a patient can experience \"anesthesia awareness.\"\n\nThey can wake-up and become aware of what's happening, while still being unable to move or speak. Although this can be stressful, patients usually do not feel pain. Behold: The Tiniest Puppies In The World https://t.co/7L7pD0ZLTn 15 Food Photos That Are Aesthetically Pleasing https://t.co/JBYb6bFS7Q 15 surprisingly cute snake pictures that might help you conquer your fear. https://t.co/332E93K000 31 Incredibly Handy Gadgets That Are Borderline Genius https://t.co/4tQAJ4OKl1 October 13th is National No Bra Day! RT @UberFacts: Meet the most independent dog ever 😂🎾 https://t.co/QJBrgEhjSE RT @UberFacts: Atychiphobia:\n\nFear of failure; fear of not being good enough. 39 Hysterical Tweets That Will Make You Do an Actual Spit Take https://t.co/dX6lpvyvC1 RT @UberFacts: October 13th Will Have a Rare Bright Orange 'Full Hunter's Moon' https://t.co/TAC9A8EZcv Don’t Get Behind The Wheel If You Can’t Pass This Driver’s Test https://t.co/lvShBtevGi Alex Trebek Says He's 'Nearing The End Of His Life' https://t.co/mUrQCUz5GL Mom Shares Harrowing Photos of Son to Show Devastating Effects of Drug Abuse https://t.co/Nofwcesb0e She Had 58,000 Followers On Instagram…Then They Realized What They Were Seeing https://t.co/HuxRMSP0OE Atychiphobia:\n\nFear of failure; fear of not being good enough. RT @UberFacts: In California, it's illegal to eat frogs that have died in frog-jumping contests. RT @UberFacts: The only state with an alcoholic official beverage is Alabama. RT @UberFacts: Benjamin Franklin was a slave owner for much of his life until a friend took him to visit a school for black children.\n\nHe l… 20 Kids Who Are Legitimately Smarter Than You https://t.co/INkkoBeIX5 This guy fell in love with a picture of a stray dog in India and just had to have her ❤️ https://t.co/HvVoxoTY0z Think You Know What the World Looks Like? Here's the True Size of Each Country. https://t.co/r6E7Q48vkn You'll Understand These Tweets If You've Ever Worked in a Restaurant https://t.co/1mWgA4lh2X 15+ Hilarious Parenting Tweets. Their Patience Is Impressive... https://t.co/XTGTCgXQPY 29 Creepy Doppelgänger Photos That Prove There’s a Glitch in the Matrix https://t.co/gTOe9BgG80 How to Keep Your Grill Clean, Even Without a Brush https://t.co/QhDy34NiV7 12 Stories That Will Make You Think Twice About Dining and Dashing https://t.co/gp12Pu5xZ6 Woman Avoids Luggage Fee by Wearing 9 Pounds of Her Own Clothing on Flight https://t.co/Q4YEBPBxq8 RT @UberFacts: There was a time when Pablo Picasso and Dwayne \"The Rock\" Johnson were both alive.\n\nThe Rock was born in 1972 - Pablo Picass… This baby needed a mom — these women said \"YES\" ❤️❤️ https://t.co/VpunJsXo1p 37 of the Handiest Gadgets on Amazon https://t.co/VWF5WKshQd People Share the Movies They Consider to Be Perfect https://t.co/zoIZ5brs52 Gorillas like to Sing \"Little Food Songs\" When They Eat https://t.co/szoSIqLttA Instagram Gets Fooled by a Fake “Influencer”... Again https://t.co/3d3wlAZueH ‘Rick and Morty’ Season 4 Will Be Shorter Than Usual https://t.co/PbNhVZZR7s 6 Quick Riddles to Help You Start Your Day https://t.co/CsGLdCbhhH 10 Women Share Their Awful Experiences in the Bedroom https://t.co/UNRReziyox 19 Pictures So Bizarre You Won’t Be Able to Forget Them https://t.co/AQk0yd7qdO These scientists just spotted a crazy sea creature and they can't EVEN... 😳😂 (via @EVNautilus) https://t.co/h8LRSwHeT7 Mom Finds Mysterious Fragrant Lump In Her Bathroom, Then Realizes Something HORRIFYING https://t.co/wyzH9RHCaB 17 Tweets About Movies for All the Film-Lovers out There https://t.co/Iz3vxwXRr9 You Can Now Get Married in McDonald's for Less Than $500 https://t.co/hrY82Mqp9N 15 People Come Clean About the Details of How They Got Scammed https://t.co/apG0poyfst RT @UberFacts: The youngest siblings tend to be the funniest, according to a 2015 study by YouGov. October 13th Will Have a Rare Bright Orange 'Full Hunter's Moon' https://t.co/TAC9A8EZcv Meet the most independent dog ever 😂🎾 https://t.co/QJBrgEhjSE Good News for Pet Owners! Silent Fireworks Exist and a Town in Italy Is Already Using Them. https://t.co/ZjcwPE15hA Disney’s new “Star Wars”-themed land will blow your mind into a galaxy far, far away. https://t.co/R2NIC0rka5 20 Hilarious and Weird Photos People Shared from Uber and Taxi Rides https://t.co/hLBWDJpF9k A Study Found That Great White Sharks Are Scared of Killer Whales https://t.co/A0TAx5JXVZ Man Gets Inside of Ear Removed in Bizarre New Body Modification Trend https://t.co/gyjuJYhW5b All astronauts going to the ISS must learn to speak Russian.\n\nMost humans leaving Earth must do so through Russian territory, on a Russian Soyuz spacecraft, commanded by a Russian citizen. RT @UberFacts: Apparently, this is how Panera Bread prepares the mac and cheese. (via TikTok) https://t.co/jUv47TYBhm Getting multiple tattoos can boost your immune system, according to researchers from the University of Alabama. Tyler Cameron explains how he hid his erections on ‘The Bachelorette’ https://t.co/p9OLQQtlNX There was a time when Pablo Picasso and Dwayne \"The Rock\" Johnson were both alive.\n\nThe Rock was born in 1972 - Pablo Picasso died in 1973. RT @UberFacts: Pandas kept in captivity tend to lose interest in mating.\n\nSo, they're often shown 'panda porn' to encourage them to breed. 10 Jaw-Dropping Facts About Sharks https://t.co/VxZvdNFgwX RT @UberFacts: When Wyoming applied to become part of the US union, Congress said they couldn't let women vote. They said, \"We will remain… The youngest siblings tend to be the funniest, according to a 2015 study by YouGov. Couple Announces Their Engagement on Facebook But Revealed Way Too Much in the Photo https://t.co/nAb5ztAIQL RT @UberFacts: Cuddling with loved ones (and even pets) can reduce stress, relieve symptoms of depression, and help speed up the time it ta… RT @UberFacts: People who grow up in warmer climates tend to be friendlier than those who grow up in harsher climates. 31 Products That Make Grown-Lady Life Easier https://t.co/a4tdSPWHfW RT @UberFacts: Pizza is a healthier breakfast option than most American cereals, according to a 2018 study. RT @UberFacts: It's illegal to hunt or kill a Sasquatch in the state of Washington since they would be \"endangered,\" if they were real.\n\nIt… He saw no difference in learning between black and white children and petitioned Congress to end slavery. Benjamin Franklin was a slave owner for much of his life until a friend took him to visit a school for black children.\n\nHe later wrote that African shortcomings weren't inherently natural but came from lack of education, slavery, and negative environments. These Animals Are Not Amused By Their Owners’ Betrayal https://t.co/amhsnXyLDe RT @UberFacts: In Tennessee, it is illegal to share your Netflix password with someone else. On October 12th, 1492, Christopher Columbus stepped foot on the New World. After sailing for two months, he spotted land that he believed was Japan...\n\nHe landed on what is now the Bahamas exactly 527 years ago. Man Gets Revenge On Craigslist Scammer In the Most Satisfying Way Imaginable https://t.co/kkJeWSWyjq 36 New Inventions That Should’ve Existed Forever https://t.co/O2VopvVzUF This Airport Lingo Will Help You Become Fluent In The Language Of The Sky https://t.co/WiIqVxkRwM Men Expose the Dumb Lies They Accidentally Perpetuated for Years https://t.co/3EMMtfMYFg 37 Genius Inventions Under $20 You’ve Never Seen Before https://t.co/EaSP4Y4K7t RT @UberFacts: Owls don’t have eyeballs.\n\nInstead, they have fixed “eye tubes” that require them to move their entire head to look in diffe… A Distraught Mom Shuts Down Selfish Anti-vaxxers Once and For All…Hopefully https://t.co/rMglkm381h The only state with an alcoholic official beverage is Alabama. RT @UberFacts: Baby sloths are dependent on cuddling.\n\nIf a baby sloth is separated from its mother, it will squeal until they are reunited… RT @UberFacts: Even though they don't have wings, spiders can fly for hundreds of miles (across entire oceans) on long strands of silk usin… In California, it's illegal to eat frogs that have died in frog-jumping contests. Mysterious Island Appears in the Pacific Baffling Scientists https://t.co/5r5d82ofS7 RT @UberFacts: In 1666, the English village of Eyam became infected with the bubonic plague.\n\nInstead of fleeing to other villages, the res… In Tennessee, it is illegal to share your Netflix password with someone else. RT @UberFacts: In 2016, a tourist fell into a boiling, acidic pool in Yellowstone National Park and \"dissolved.\" RT @UberFacts: Omg.... this has to be the world's cutest yawn 😍 https://t.co/ANaqyDIrlx 30 of the Handiest Problem-Solving Gadgets on Amazon https://t.co/MMWjSTe1CU It's illegal to hunt or kill a Sasquatch in the state of Washington since they would be \"endangered,\" if they were real.\n\nIt's legal in Texas, though. 36 of the Handiest Gadgets on Amazon https://t.co/W6uLRbDwLV Pizza is a healthier breakfast option than most American cereals, according to a 2018 study. RT @UberFacts: Seahorses do a dance that can last 8 hours before mating, and they usually mate for life.\n\nAfter pairing, they intertwine th… 30 Male Celebrities Who Are Shorter Than You Think https://t.co/3mQBPJxxn5 RT @UberFacts: Bats eat so many insects, they save U.S. farmers an estimated $3.7 billion a year on pesticides. RT @UberFacts: It only takes six minutes for alcohol to hit your brain. Hulu Finally Adds Mobile Download Option https://t.co/lz463dv3zP A TSA Program Allows People to Adopt Dogs That Are Too Nice to Sniff for Bombs https://t.co/ShhvNNcj4f 10 Facts to Sharpen Your Intellect https://t.co/3w6vG40jzS 12 Couples Share the Things They Let Their Partners Get Away With https://t.co/oX7tsjtZZS Woman Breaks up With Cheating Boyfriend During Birthday Speech https://t.co/c0oXmCKGMx A Man Wrote an Anonymous Letter to the Woman He Followed at Night https://t.co/Yll6gl51Op 30 People You Will IMMEDIATELY Want To Hang Out With https://t.co/Zx357AHamw Travelers Share the Embarrassing Things TSA Found in Their Carry-Ons https://t.co/VTQfDKSNTB Dr. Pepper Is About to Drop a Cream Soda Flavor https://t.co/Ua1tAdtu4q People who grow up in warmer climates tend to be friendlier than those who grow up in harsher climates. A Guy Shared Some New Parents’ List of Meal Requests on Nextdoor App and It Is Bonkers https://t.co/N5fKmZ4yOS Shia Labeouf Says a Costar With Down’s Syndrome ‘Saved Him’ After Being Arrested https://t.co/Rp26gaqIPs People Share the Craziest Things Their Therapists Said to Them https://t.co/cX8WfJkjce 15+ Wholesome Posts About Dogs https://t.co/5WpKDySAxx Hunters Shared the Creepy Things That Made Them Never Want to Venture Back into the Woods https://t.co/YhWiajZANz Cuddling with loved ones (and even pets) can reduce stress, relieve symptoms of depression, and help speed up the time it takes for wounds to heal. 15 Times People Made Incredibly Dumb Decisions That Will Haunt Them Forever https://t.co/DTkqw1haln This Guy Photoshops Cats into Scenes of Blockbuster Movies https://t.co/ULo6VpmDFi 20 Memes for People Who Love Drinking Booze https://t.co/qqolcR8EoR A Woman Wanted Her Pet Buried with Her, so the Healthy Dog Was Euthanized https://t.co/u41bKbQbuq A Twitter Thread About Peeing and Pooping in Space Is Very Educational https://t.co/lqjgd7yEi8 37 Cheap Little Inventions That Make Life Less Annoying https://t.co/fv0YHWXaq9 Seahorses do a dance that can last 8 hours before mating, and they usually mate for life.\n\nAfter pairing, they intertwine their tails, so they stick together when they travel through the ocean. https://t.co/EhnVBh181w Baby sloths are dependent on cuddling.\n\nIf a baby sloth is separated from its mother, it will squeal until they are reunited; in captivity, a baby sloth will do the same and even refuse to eat, until it has something soft to hold on to. 20 Horrifying Photoshop Fails That Will Make You Just Sigh With Deep Disappointment https://t.co/3nlCERhVKO On October 11, 1999, \"The Lord of the Rings\" began filming.\n\nExactly 20 years ago. 10 Facts About Target to Get You in the Mood for Shopping https://t.co/Y52W2f2Win 17 Funny Tweets About Being in a Relationship https://t.co/r4cOgKqFUc Apparently, this is how Panera Bread prepares the mac and cheese. (via TikTok) https://t.co/jUv47TYBhm 37 Products That Make Life Easier https://t.co/86DZ2n2I27 This Is What Would Happen If You Actually Broke into Area 51 https://t.co/2nJ6Dykpf1 12 People Who Sent out Very Ill-Advised Tweets https://t.co/zaPbScBBrF Animals Wearing Backpacks Like The Little Hard Workers They Are https://t.co/I6vogiVAKr People Reveal Their \"Never Again\" Brands, Restaurants, and Companies https://t.co/dUnpwWLFcS October 11th is National Coming Out Day! 29 Hilariously Sad Tweets About Dating in the 21st Century https://t.co/HiNZlMVb6Y 37 Things You Probably Do Wrong Even Though You’re Supposedly an Adult https://t.co/nWC6MYpKID ‘Rise Of Skywalker’ Will Answer The ‘Who Is Rey?’ Question https://t.co/hXn4qphY22 Bats eat so many insects, they save U.S. farmers an estimated $3.7 billion a year on pesticides. Owls don’t have eyeballs.\n\nInstead, they have fixed “eye tubes” that require them to move their entire head to look in different directions. 9 Songs Beyoncé Stole from Famous Musicians https://t.co/NnS8QsVQuP It only takes six minutes for alcohol to hit your brain. Even though they don't have wings, spiders can fly for hundreds of miles (across entire oceans) on long strands of silk using Earth's electric fields; it's called \"ballooning.\"\n\nSpiders have been found two-and-a-half miles up in the air, and 1,000 miles out to sea. How Many of the 25 Most Popular Movies of All Time Have You Seen? https://t.co/lWjPWLAS4R RT @UberFacts: This puppy adopted a stray kitten 😍❤️ https://t.co/RD9SO6od8L RT @UberFacts: This naked guinea pig has 100 sweaters and he looks fabulous in all of them ✨ https://t.co/uBxtiJB2Cq 21 People Explain How They Got Their Horrible Bosses Fired https://t.co/TOJFXNQTCL Words can't describe how much this guy loves his rescue dog 💖️ https://t.co/5NG8OJF3ou 37 Cheap-But-Genius Gadgets Your Kitchen Deserves https://t.co/UUCmbVaKiR RT @UberFacts: The average American adult hasn’t made a new friend in the last five years, according to a 2019 survey. People Share Their Stories About the Unconventional Ways They Found Love https://t.co/C39GMzNdqx The expression \"A-OK\" was originally used by NASA engineers during radio transmission tests because \"the sharper sound of A cut through the static better than O.\" RT @UberFacts: The world is greener than it was 20 years ago, according to NASA.\n\nThanks to enthusiastic tree planting programs in China an… ‘Game of Thrones’ Character, the Mountain, Makes Holding a Normal Mug Look Like an Optical Illusion https://t.co/FHGUEKXLme 15 Bartenders Share the Strangest Conversations They've Overheard https://t.co/WwG7deiBHm 16 People Share Their Most Wholesome Secrets https://t.co/IHDfHGFchd RT @UberFacts: The Aztecs regarded childbirth as a form of battle—women who died in childbirth were thought to go to the same heaven as mal… Tenants Share Their Disturbing Renting Experiences https://t.co/GZMf0RmDdE 37 Things You’ll Want To Try The Instant You See Them https://t.co/pLOlYsQQF1 In 2016, a tourist fell into a boiling, acidic pool in Yellowstone National Park and \"dissolved.\" RT @UberFacts: A survey of 17,000 people across 28 countries found that boyfriends do more housework than husbands.\n\nThe amount of time a m… Guy Gets Incredible Response After Texting Pasta Company Instead of Depression Crisis Line https://t.co/9iHkoglU1W 11 Homewreckers Admit Why They Destroyed Marriages https://t.co/vMmnMmOBwi This Is Why Cats Can’t Get Enough of Cardboard Boxes https://t.co/69AQ8jmpXb This Guy Made A Theory Based Around Gummy Bears https://t.co/nRLnYPuDE7 RT @UberFacts: Sour Patch Kids were initially called Mars Men.\n\nIn 1985, they were renamed \"Sour Patch Kids;\" right when the Cabbage Patch… This woman heard a noise in her ceiling... then pulled out someone cute ❤️ https://t.co/ntY4V3WkUs Being sleep deprived shuts down the production of essential brain proteins necessary for your neurons to communicate effectively. RT @UberFacts: Humans and tree shrews are the only two known mammals that enjoy eating spicy foods. The Best Memes Reacting To The ‘Joker’ Premiere https://t.co/A0uiTLh5OT Omg.... this has to be the world's cutest yawn 😍 https://t.co/ANaqyDIrlx Australian Firefighters Pose With Animals for 2020 Charity Calendar and It’s One Big Thirst Trap https://t.co/QfhYyRi7Pi Ryan Reynolds Is Making a Stoner Comedy Version of 'Home Alone' https://t.co/qODD4cYW4c Guy’s Homemade Gift for Girlfriend With Anxiety Is so Sweet https://t.co/xTEPfeUxpz RT @UberFacts: These orphaned baby raccoons are learning how to survive... with help from their sweetest mother dog 💖 https://t.co/lYaIy55F… Check out the 20 Most Instagrammed Tourist Attractions in the World https://t.co/fW5hQUoPrx Instagram Has Made a Huge Change and It’ll Never Be the Same Again https://t.co/owdapiVZkg In 1666, the English village of Eyam became infected with the bubonic plague.\n\nInstead of fleeing to other villages, the residents quarantined themselves to stop the disease from spreading. About 260 villagers died. RT @UberFacts: About 60% of the human brain is made of fat. 4 Strange and Thought-Provoking FBI Investigations https://t.co/hQiUokwpc8 A Kindergarten Teacher Shared the Unfiltered Reasons About Why She Quit Teaching https://t.co/7zJMF5IiEG Pregnant Side Chick Texts the Wrong Person and Things Take a Hilarious Turn https://t.co/a8tTabpMwk RT @UberFacts: Cats spend up to 70% of their entire lives just sleeping. This naked guinea pig has 100 sweaters and he looks fabulous in all of them ✨ https://t.co/uBxtiJB2Cq Alec Baldwin’s family hustled by fake Statue of Liberty tour operator https://t.co/EANUPlIBxn These Horrible Renting Situations Might Make You Want to Buy a House https://t.co/zVpyTqGwHK 10 Facts to Give Your Brain a Workout https://t.co/6AmCZMU5xb 8 People That Asked to Be Insulted and the Internet Brutally Delivered https://t.co/a82Bs9dzB9 A Guy Trapped in the Snow for 5 Days Survived on Taco Sauce Packets https://t.co/VP6EEIZMev One in Eight Men Think They'd Be Able to Score a Point Against Serena Williams https://t.co/BHUqLw3aND 17 Real Life Horror Stories That Will Give You Goosebumps https://t.co/zCMwoApZvS RT @UberFacts: \"Parks &amp; Recreation\" correctly predicted the Chicago Cubs would win the 2016 World Series in an episode that aired in 2015. Are these the most adorable spiders ever?? 💞 https://t.co/vLD5jq8KCT 35 Things You Don’t Need But Definitely Deserve in Your Life https://t.co/SipujYZVqY Women Confess Their Regrets After Getting Their Tubes Tied https://t.co/wjvYcY9vmG This puppy adopted a stray kitten 😍❤️ https://t.co/RD9SO6od8L Steve Irwin’s Family Opens Elephant Hospital In His Honor https://t.co/R8YlI0a6jO 15 Moms Share Secrets They Hope Their Kids Never Uncover https://t.co/aPFcmHiK8n October 10th is World Mental Health Day! Check out These 14 Tweets That Will Help If You Need a Laugh https://t.co/ZyizotbLpP You Can Now Play a Version of Cards Against Humanity for Fans of ‘The Office’ https://t.co/yVuLm1h7P7 Embarrassing People Who Should Reconsider Their Life Choices https://t.co/bxT3fHa3Wz RT @UberFacts: In 2018, for the first time in history, U.S. billionaires paid a lower tax rate than the working class. RT @UberFacts: Simone Biles just officially became the most decorated female gymnast in history, after winning her 21st World Championship… A ‘Beverly Hills Cops 4’ Is Finally On Its Way https://t.co/8EQ58aWTzP RT @UberFacts: The scientific term for \"brain freeze\" is sphenopalatine ganglioneuralgia. RT @UberFacts: People with a net worth of $10 million or more are significantly happier than those with a net worth of $1 or $2 million, ac… Our Brains Are Breaking Trying to Figure Out How a Twin Born After His Brother Can Actually Be Older https://t.co/3Ljen3uDTi RT @UberFacts: Astronomers recently spotted 20 more moons orbiting Saturn, bringing its total to 82. Sour Patch Kids were initially called Mars Men.\n\nIn 1985, they were renamed \"Sour Patch Kids;\" right when the Cabbage Patch Kids were at the height of their popularity. 30 Weird Things About Cult Classic, ‘Ferris Bueller’s Day Off’ I Only Noticed as an Adult https://t.co/l4MvmgTE2P \"Parks &amp; Recreation\" correctly predicted the Chicago Cubs would win the 2016 World Series in an episode that aired in 2015. A survey of 17,000 people across 28 countries found that boyfriends do more housework than husbands.\n\nThe amount of time a man spends doing chores on a weekly basis decreases significantly after marriage. Humans and tree shrews are the only two known mammals that enjoy eating spicy foods. About 60% of the human brain is made of fat. ‘Deadliest Catch’ Boat Capsizes Killing All Crew Members https://t.co/jj6xJELg1w Cats spend up to 70% of their entire lives just sleeping. This story couldn't have a happier ending ❤️ https://t.co/qDbTiMTj1t 10+ Times People Forgot They Were Being Recorded by Security Cameras https://t.co/R0ICD26Fj7 RT @UberFacts: The singular form of \"confetti\" is \"confetto.\" 37 Products Perfect For Every Grown Woman https://t.co/Z6IibdHMWa The world is greener than it was 20 years ago, according to NASA.\n\nThanks to enthusiastic tree planting programs in China and India, as well as intensive agriculture in both countries. Towns in England Are Combatting Loneliness with “Chat Benches” https://t.co/5Nk1ijK5uz RT @UberFacts: Dog owners tend to live longer and have healthier hearts, according to researchers from Uppsala University in Sweden. These 15 Memes Show How Much People Love Keanu Reeves https://t.co/Dd4xUQGs7b These May-December Celeb Couples Prove Age Is Just a Number https://t.co/FJ9nTvOIaI You Can Buy a ‘Friends’-Themed Furniture Collection from Pottery Barn https://t.co/0qE1gpn9Po The average American adult hasn’t made a new friend in the last five years, according to a 2019 survey. 37 Problems We ALL Have, and the Inventions That Solve ‘Em https://t.co/cmgSKfmkcR RT @UberFacts: Your cell phone can be as much as ten times dirtier than a toilet seat, according to a study from the University of Arizona. A Man Who Was Annoyed with a Classmate Realized His Own Selfishness and Shared the Lesson He Learned https://t.co/fBk9f3vwye 25 Strangely Specific Things You’re NOT Allowed To Do at Disneyland https://t.co/gDVvwOVuGo Stephen King and His Corgi, “The Thing of Evil”, Are an Inseparable Pair https://t.co/9nOCgLCsEa Astronomers recently spotted 20 more moons orbiting Saturn, bringing its total to 82. Lindsay Lohan Will Be Replaced on ‘The Masked Singer’ Australia: “She Was Tricky With Demands” https://t.co/Q1rYhw8sJZ RT @UberFacts: The Earth doesn't actually revolve around the Sun.\n\nTechnically the Earth, along with the Sun and all of the other planets,… 12 Brands of Liquor That Bartenders Wholeheartedly Recommend https://t.co/ZNpQymm5s4 Trailer for New Netflix Horror Leaves Viewers Scared to Turn Lights off https://t.co/1GmV0PA8hD 15 Babysitters Share the Strangest Rules That Parents Gave Them https://t.co/0r26SPoqZw Man Sues Apple for ‘Turning Him Gay’ https://t.co/5wgV8VBLz4 RT @UberFacts: If there were absolutey no empty space between them, every atom in the world would fit inside one grain of salt. Piglet the Pink, Deaf, and Blind Puppy Is Inspiring Kids to Deal With Their Differences https://t.co/vXMFFU2vVw People with a net worth of $10 million or more are significantly happier than those with a net worth of $1 or $2 million, according to a Harvard study.\n\nThe study also found that those who earned the money themselves were happier than those who inherited it. A Man Checked a Single Can of Beer After an Airline Wouldn't Let Him Board with It https://t.co/rH6pUyslof The 39 Best Photobombs of All Time https://t.co/98ttZTnZ19 10+ Times Propaganda Was so Successful, People Still Believe It Today https://t.co/rhBufJIrGJ RT @UberFacts: Your left lung is smaller than your right lung, so it leaves room for your heart. Oh my god 😂 https://t.co/skNf2J243E These orphaned baby raccoons are learning how to survive... with help from their sweetest mother dog 💖 https://t.co/lYaIy55Fif 15+ Hilarious Area 51 Memes for People Who Want to “See Them Aliens” https://t.co/VqOrTI33Cn Couple Watch on as Cruise Ship Leaves Port Without Them https://t.co/slu4uQJqJm The scientific term for \"brain freeze\" is sphenopalatine ganglioneuralgia. A Study Shows That Cat Owners Pass on Their Own Personalities to Their Cats https://t.co/77Qt0pbTcj Justin Bieber mocks Taylor Swift’s post-surgery banana meltdown video https://t.co/AmanVjZQYR RT @UberFacts: Samsung makes more money off of iPhones than their own phones. 7 Great Movies You Might Have Missed Out On https://t.co/cO2Tl9jgKs Transgender Man Told He Couldn’t Get Pregnant Welcomes a Son https://t.co/OjvPaQmpnc 15 Doctors Share What They Wish Patients Knew About Their Bodies https://t.co/8RG3vSwmwr Watch this tiny bear cub grow up and climb his first tree 💜 https://t.co/bYrBWLltn1 Woman Who ‘Changed Race’ Thinks She Could Have A Black Baby https://t.co/LEGwOQESP0 8 Weird Facts About Animal Sex https://t.co/SzYz3DbUSC RT @UberFacts: Brandon Flowers, the lead singer of The Killers, procrastinated while writing “Mr. Brightside” and didn’t feel like writing… RT @AlexisDelCid: This is the Twitter content I’m here for https://t.co/xs3Z3AR9j8 37 Genius Gadgets on Amazon Under $30 I’d Never Seen Before https://t.co/u2RE6PMwyu Simone Biles just officially became the most decorated female gymnast in history, after winning her 21st World Championship medal yesterday. A Billionaire Created a Fake Driveway to Score His Own Private Parking Spot in New York https://t.co/DDOIyIUnJl 15 People Share the Rudest Thing a Guest Has Done in Their Home https://t.co/LUGW703eSu These People Were Caught Sleeping In The Most Hilarious Positions https://t.co/ANkGIF3Ul1 15 People Who Are as Totally Obsessed with Ranch https://t.co/mnkSRI8b44 In 2018, for the first time in history, U.S. billionaires paid a lower tax rate than the working class. 19 Photos of Everyday Things in Incredible Ways You’ve Never Seen Them Before https://t.co/fKSIk6lKzl October 9th is International Beer and Pizza Day! Uncool Things Baby Boomers Still Think Are Cool https://t.co/frMV44xJfQ Samuel L. Jackson Calls Out Martin Scorsese Over Marvel Comments https://t.co/yRa1cDpj24 The Earth doesn't actually revolve around the Sun.\n\nTechnically the Earth, along with the Sun and all of the other planets, orbit around the center of mass of the solar system... which just happens to be very close to the Sun. 25 Kids Who Are Already Killin’ It at This Whole Life Thing https://t.co/dwAP25DiKU 50 Unbelievable Facts About Each of the 50 States https://t.co/f6TochmhLY Brandon Flowers, the lead singer of The Killers, procrastinated while writing “Mr. Brightside” and didn’t feel like writing more lyrics to the song.\n\nThat's why the first and second verses are exactly the same. RT @UberFacts: One year on Uranus is equal to a little more than 84 years on Earth. Your left lung is smaller than your right lung, so it leaves room for your heart. 37 Small But Life-Changing Gadgets on Amazon Under $25 https://t.co/q0HgKV1SsT An 89-Year-Old Woman Generously Knits Blankets for Shelter Dogs https://t.co/ssJDXptEyN RT @UberFacts: You’re more likely to die on your birthday than any other day of the year.\n\nAn increased risk of heart attacks, strokes, fal… Your cell phone can be as much as ten times dirtier than a toilet seat, according to a study from the University of Arizona. RT @UberFacts: Astronauts aboard the International Space Station celebrate Christmas.\n\nNot only do they get the day off, but they also have… Miranda Lambert Savagely Shaded Blake Shelton Right in Front of His Face https://t.co/8HBCw0rZIa Samsung makes more money off of iPhones than their own phones. The singular form of \"confetti\" is \"confetto.\" RT @UberFacts: New York City's \"Washington Square Park\" was formerly a cemetery.\n\nAn estimated 20,000+ bodies are buried beneath it. This guy is so sweet to the opossum family he rescued ❤️ https://t.co/yzexPNp3sb RT @UberFacts: Avocados don't ripen on trees.\n\nThey have to be picked first. Residents of New Hampshire drink twice as much alcohol per year than the national average. 29 Scam Artists Who Are Also My Personal Heroes https://t.co/jGTnBPXsKN If there were absolutey no empty space between them, every atom in the world would fit inside one grain of salt. Dog owners tend to live longer and have healthier hearts, according to researchers from Uppsala University in Sweden. 36 Satisfying AF Kitchen Gadgets That’ll Make You Actually Want to Cook https://t.co/NQEPsBKyPf There's a Vincent Van Gogh Action Figure That Comes with Removable Ears https://t.co/cj0GhNKDDU These Penguins Disobeyed Police and Returned to Invade a Sushi Shop Twice https://t.co/3lRJq2Uf3F Comedian Rip Taylor Dies at 84 https://t.co/wG8soOLvmZ RT @UberFacts: The PlayStation 5 will be released at the end of 2020. https://t.co/EnKkUSs74J This goat headbutts his dad every day\n\n😂🐐 https://t.co/qvtsgOAr1w Gruesome Pimple-Popping Videos That Are Not for the Faint of Heart https://t.co/FZPc7LfEvp Stores Are Taking Measures to Protect Their Ice Cream from All the Lickers out There https://t.co/BAx2Re5y5C Five Elephants Die Trying to Save Baby Who Slipped Over Waterfall https://t.co/EUlFw4DEXq This doggie has the most adorably annoying way of getting her mom's attention\n\n😂❤️😂 https://t.co/eFfv7dcwGD These Are the Most Famous Pets on the Internet https://t.co/lY2018HcT4 People Share the Crazy Rules They Followed When They Were Kids https://t.co/AY5rwbsSaX RT @UberFacts: A grizzly-polar bear hybrid is called a \"pizzly bear.\"\n\nOr a \"grolar bear.\" These Conspiracy Theories Will Leave You Feeling Paranoid https://t.co/j6e9Qqt9z6 20+ Times Things Got Really Weird with Complete Strangers https://t.co/OIYhN3YbBI This 2-ounce pink baby wombat grows up to be HUGE! https://t.co/gDlqjLAf5i One in four Americans are currently crushing on somebody who is completely “off-limits” https://t.co/es38dPLpqk Check out These Behind the Scenes Facts About Season 3 of 'Stranger Things' https://t.co/tzLPa53Y89 More Than One Million People Say They’re Going to Storm Area 51. Here Are 20+ Memes About It. https://t.co/L8k7NNAnqt 37 Genius Inventions Under $20 You’ve Never Seen Before https://t.co/uGUDW9VDPe Social Media Influencers Have Been Taking Pics with a Toxic Lake in Russia https://t.co/RDRd6OcPkW RT @UberFacts: The organic compounds found in wine kill 99.9% of the bacteria and germs that cause sore throats, according to a study publi… Prison-bound Felicity Huffman walks with dog near no-dog zone https://t.co/yI9TgSL0B2 Take a Look at the Trailer for the Upcoming Tom Hanks Film About 'Mister Rogers' https://t.co/dNkDVc3pJY This Website Helps You Eat Healthy for Just $5 a Day https://t.co/kNKwUDdlW8 Make Way for the Season’s Strangest Haircut — the Wedge Mullet https://t.co/3y1eCv0UHL Guys Share How They Knew There Definitely Wouldn’t Be a Second Date https://t.co/KC4JydutLe RT @UberFacts: Walking can boost a person's creative inspiration by 60%, according to researchers from Stanford University. Teen Boy Asked for Advice About Dating a Transgender Girl and It’s Beyond Adorable https://t.co/Lki2CQLflM These 25 People All Realized They Were Dating Idiots https://t.co/b4T7cACtfO Keep Your Fingers Crossed, America! Jack in the Box Is Testing Tiny Tacos in Select Locations. https://t.co/onZHMZDjlQ 19 Photos That Will Make You Go ‘Hmmmm’ https://t.co/mhQhtoACml 13 People Who Were Lucky They Actually Read the Fine Print https://t.co/GoPgcfBYLa Unicorn Armpit Hair Is a Trend Now...Prepare Yourself https://t.co/mFmf3wCClI A Good Samaritan Saved These Adorable Street Kittens https://t.co/V8uUF24Cco 15 Funny Tweets That Sum up Dad Culture https://t.co/3KGGBH66HK Police Arrested a Man in Missouri After a Loud Fart Gave Away His Hiding Spot https://t.co/boV6vzCVQ5 37 of the Handiest Inventions on Amazon Under $20 https://t.co/Jglj4tAjkZ RT @UberFacts: Episodes of \"South Park\" are written, recorded, and animated in six days so the show can include commentary on current event… RT @UberFacts: Favorite season 🍁🎃 https://t.co/P4Vprs9067 The PlayStation 5 will be released at the end of 2020. https://t.co/EnKkUSs74J Student Goes Viral for Her Reaction to See-Through Dress She Bought Online https://t.co/UChEub3XhR One year on Uranus is equal to a little more than 84 years on Earth. RT @UberFacts: More people die while taking selfies every year than from shark attacks. These Expensive Jewelry Heists Will Make You Lose All Hope In Security Systems https://t.co/67TJMAWyPJ Avocados don't ripen on trees.\n\nThey have to be picked first. October 8th is World Octopus Day! Gymnast Breaks Both of Her Legs in Horror Fall https://t.co/2LB4oMeHdv You’re more likely to die on your birthday than any other day of the year.\n\nAn increased risk of heart attacks, strokes, falls and suicides make our birthdays the most dangerous. A Guy Accepted a Dare to Eat a Gecko and He Lost His Life https://t.co/2zEjAT2qJJ 31 Weird-Yet-Awesome Gifts That’ll Surprise Anyone https://t.co/XUVDyA7btE RT @UberFacts: The opposite of Déjà vu is called Jamais vu:\n\nWhen you know something has happened before, but it seems unfamiliar. A grizzly-polar bear hybrid is called a \"pizzly bear.\"\n\nOr a \"grolar bear.\" RT @UberFacts: Elephants are one of the few animals that bury their dead.\n\nWhen a member of their family dies, they not only cry; but they… RT @UberFacts: This dog's parents set up a hidden camera when they went to work — and got the cutest surprise 💖😭 https://t.co/4yosVwu3nL This Woman Was Left Floored After She Bought a Doormat Online And Received THIS Instead https://t.co/x5JckgwJpN Walking can boost a person's creative inspiration by 60%, according to researchers from Stanford University. RT @UberFacts: Edward W. Stack, the CEO of Dick's Sporting Goods, has announced that the company destroyed more than $5 million worth of as… The organic compounds found in wine kill 99.9% of the bacteria and germs that cause sore throats, according to a study published in the Journal of Agricultural and Food Chemistry. RT @UberFacts: The iconic \"Friends\" fountain is the same one from \"Hocus Pocus.\" https://t.co/nS6hho4Dlb Here’s How One Dad’s ‘X Plan’ Can Help Keep Your Teens Safe https://t.co/agjupd8uro RT @UberFacts: A baby koala in Australia climbed onto the back of this dog, mistaking it for his mother.\n\nThe dog's name is Tony.\nhttps://t… RT @UberFacts: South Park has been banned in China after its most recent episode criticized the country's censorship.\n\nAll episodes, clips,… People Share the Times They Were Savaged by Their Parents and Family https://t.co/XnffjQJEjE Dextrophobia is the morbid fear of having things to the right side of your body. 36 Ingenious Inventions With Over 1,000 Reviews on Amazon https://t.co/qY8PD6ibjc RT @UberFacts: Data from the CDC reports that 2,167 people died between 1999 and 2014 from “Constipation.” A Photographer Specializes in Close-Up Shots of Insects and Spiders https://t.co/zLzXMNoD1r This Hilarious Meme Describes the Most Cliché Movie Tropes https://t.co/SiKiBkM8FD People Share Embarrassing Moments That They Nearly Stopped (But Decided Not To) https://t.co/D6lUpzEdRN Favorite season 🍁🎃 https://t.co/P4Vprs9067 The Speculum, a Long-Standing Object of Discomfort, is Finally Getting a Redesign https://t.co/DJW9AOju4i Astronauts aboard the International Space Station celebrate Christmas.\n\nNot only do they get the day off, but they also have presents delivered to them in space, and spend the day eating together while they unwrap gifts. This dog's parents set up a hidden camera when they went to work — and got the cutest surprise 💖😭 https://t.co/4yosVwu3nL Thank God Jennifer Lopez is Finally Getting the Oscar Buzz She Deserves with ‘Hustlers’ https://t.co/hsPR1KIwpk New York City's \"Washington Square Park\" was formerly a cemetery.\n\nAn estimated 20,000+ bodies are buried beneath it. RT @UberFacts: Eating spicy foods can boost your metabolism and cause your body to burn more fat. Kids Who Clearly Tried Their Best but Ended up Drawing Hilariously Inappropriate Things https://t.co/LE6L9SLFJK 10+ Guys Share the Reasons Why They Won’t Date Single Moms https://t.co/jkcV4k6bVT 31 Handy Gadgets on Amazon That Might Be Genius https://t.co/DRj2uTLsrc 7 Friends Chipped in and Bought a Big House so They Can Retire and Live Together https://t.co/TSipgZ8i1m Moms Are Mad That Instagram Keeps Deleting Topless Photos Of Their Long-Haired Sons https://t.co/EA1ubTVri4 Female Lionesses in Botswana Grew Long Manes and Started Acting like Males https://t.co/yhpfPOGQXA This woman plans to grow old with her rescue parrot ❤️ https://t.co/XrhyPb4wp2 Here Are 50 of the Best Halloween Costume Ideas for 2019 https://t.co/VRiZpIeqxU RT @UberFacts: Pressure to feel happy when you're feeling down can make you feel even worse, according to researchers from UC Berkeley.\n\nEm… The opposite of Déjà vu is called Jamais vu:\n\nWhen you know something has happened before, but it seems unfamiliar. Russian girl smiles for first time after life-changing surgery https://t.co/YITlRo0Inu Elephants are one of the few animals that bury their dead.\n\nWhen a member of their family dies, they not only cry; but they also dig graves for their dead and cover the bodies with leaves. This baby bear is trying to save her brother 😭😭🐻 https://t.co/qEwCf31ORQ The iconic \"Friends\" fountain is the same one from \"Hocus Pocus.\" https://t.co/nS6hho4Dlb \"I said, 'You know what? If we really think these things should be off the street, we need to destroy them,'\" he said. Edward W. Stack, the CEO of Dick's Sporting Goods, has announced that the company destroyed more than $5 million worth of assault-style rifles following their decision to stop selling them. Bodybuilder Sparks Outrage With His Controversial Tinder bio https://t.co/K8hO0v5ZI6 These 15 Comparison Images Give Some New Perspective on the World https://t.co/0YEI3KXUhG More people die while taking selfies every year than from shark attacks. Sia reveals she suffers from rare neurological disease https://t.co/0WqCbEHW9M RT @UberFacts: The Earth weighs about 13,170,000,000,000,000,000,000,000 pounds. All of These Couples Met Each Other in the Most Unexpected Places https://t.co/DCJ3pbuPSd 29 Pictures That Prove We’ve Experienced a Glitch in the Matrix https://t.co/0oMNZuZ2ZS 15+ Tweets That Prove Cats Are as Weird as They Are Adorable https://t.co/nqbkYekyVH A Company Adopted Two Office Kittens to Boost Employee Morale and It Totally Succeeded https://t.co/3NTNnQYnE3 29 Dogs Who Were Bred for One Job But Fail to Do It https://t.co/QUdP6nYEKX Episodes of \"South Park\" are written, recorded, and animated in six days so the show can include commentary on current events.\n\nThey missed a deadline for the first time in 2013, after 17 seasons. Here's an Easier Way to Use Your Cheese Grater https://t.co/2Y1sWKqoVP South Park has been banned in China after its most recent episode criticized the country's censorship.\n\nAll episodes, clips, and mentions have been scrubbed from the Chinese internet. The episode was titled \"Band in China.\" A baby koala in Australia climbed onto the back of this dog, mistaking it for his mother.\n\nThe dog's name is Tony.\nhttps://t.co/sVjmlZOxVj 44 Pics of Everyday Objects Like You’ve Never Seen Them Before https://t.co/mtG61gicb2 15 People Share the Interesting Ways Their Parents Met https://t.co/Th3Op3JmYY A Mailman Who Passes out Treats to Dogs Shared an Emotional Note About a Dog Who Passed Away https://t.co/35mXUt1hTg Incredible Photos Of Animals With Rare Markings https://t.co/SPOXeyDVof The Popular Sugar Substitute Xylitol Is Deadly Poison for Your Pets https://t.co/UgZLlKALqC Use These 20 Little-Known Words to Win Your Next Scrabble Game https://t.co/95Jga6z4f3 19 Weird Pictures That Will Make You Giggle Despite Your Best Intentions https://t.co/o8gOTKsa2L Fox News launched on October 7th, 1996.\n\nExactly 23 years ago. October 7th is National Forgiveness &amp; Happiness Day! The Truth About All the Health and Wellness Trends You’ve Been Hearing About https://t.co/RQIsMOksRH Surprising Facts About The Nightmare Before Christmas https://t.co/Pae8Mi2yv7 RT @UberFacts: Former President Barack Obama has two Grammys. \n\nBoth are for spoken word albums: The Audacity of Hope: Thoughts On Reclaimi… 36 Clever-as-Heck Inventions That’ll Make You Say: Why Didn’t I Invent That? https://t.co/Sdqg7Mqq9K Pewdiepie’s Wife Suffers Gruesome Injury During Romantic Vacation https://t.co/EOj08FcASK Proof That We Are Straying Further and Further from the Light https://t.co/E9JKqi8cjp The Most Memorable Mugshots Ever Captured on Camera https://t.co/z1TAnOAePW 37 Ridiculously Clever Inventions You Won’t Know How You Lived Without https://t.co/LHxZCKZXJI 20 People Reveal the Absolute Dumbest Bets They’ve Ever Made https://t.co/mbLRTcXd9R Here Are the 36 Products Most Added to Amazon Wish Lists https://t.co/1hNfLjqMwn Alex Trebek Roasts Boring 'Jeopardy' Contestants: \"I'm So Glad This is Not a Friday Show\" https://t.co/3GkkT3Ktof 20 Bizarre Facts You’ll Wish You Had Never Learned https://t.co/NXGw7Edk0M 19 Things That Actually Kinda Sucked About the ’90s https://t.co/0EWTZo81Dv 29 People Share The Times They Were Rejected and What They Did Next https://t.co/GGiof6KG9Z 45 Ridiculous, Sneaky Ways Brands Have Fooled Consumers https://t.co/XNKJcbNTbE This is so wholesome 😭 https://t.co/g94fal5xk4 Police Officer Who Shot Unarmed Black Man Joked About Martin Luther King Jr.’s Death https://t.co/G90nwG79HN Queen Elizabeth slapped her nephew across the face in front of Elton John https://t.co/UZmaYWqvUV A Guy Sent This Shocking Picture of His Girlfriend to His Mom, and Now The Internet’s Trying to Cover for Him https://t.co/X8Q4LtSP3g 37 Incredibly Handy Gadgets Under $25 I Want ASAP https://t.co/yHhakvFlsU 37 Products That Make Grown Lady Life Easier https://t.co/eDm9T44OLR Man Builds $43,000 Tiki Garden In His Backyard So His Wife Could Go On Vacation Whenever https://t.co/hSQMeKHOZm Here Are My 30 Favorite Things I Ever Bought on Amazon https://t.co/QqoCzyJZbd ‘Dead Butt Syndrome’ Is a Real Medical Issue, and You Might Have It https://t.co/3W38JdrCX9 This is terrifying! https://t.co/PvsUEfKHMF Check out These Funny Jokes About 'Stranger Things' https://t.co/GIgNTsxPRA These 10 States Have the Best Shot at Fighting Zombies During the Apocalypse https://t.co/DyqwxDN8hf 36 Weird Kitchen Gadgets That Are Borderline Genius https://t.co/pW7jv1NdvU RT @UberFacts: Yawning literally cools your brain, according to researchers at the University of Vienna. Data from the CDC reports that 2,167 people died between 1999 and 2014 from “Constipation.” Here’s What Every Single Grandma Has in Her House https://t.co/zpjzzVvDKO 13 Keanu Reeves Memes You Should Probably Take a Look At https://t.co/AMoTa7v5VH Eating spicy foods can boost your metabolism and cause your body to burn more fat. RT @UberFacts: This anxious dog didn't feel safe in his new home.\n\nSo his dad built him his own bedroom 😭❤️ https://t.co/6JJKIR8Bzo This bird was so mean that no one wanted him...\n\nUntil he met his mom ❤️ https://t.co/PFX6EkBR7D Servers Tweet About the Dumbest Things Their Customers Have Ever Done https://t.co/a2Tzn5lgiM Here Are 7 Scientific Benefits of Kissing https://t.co/GxFZB9pokt RT @UberFacts: Contrary to popular belief, playing hard-to-get is more likely to turn off a romantic interest, according to researchers at… A Blind Golden Retriever and His Guide Dog Are BFF and It Is Beautiful https://t.co/SO3AwZ5Aif Former President Barack Obama has two Grammys. \n\nBoth are for spoken word albums: The Audacity of Hope: Thoughts On Reclaiming the American Dream and Dreams From My Father. 31 Innovative Takes on Existing Products That Are Completely Genius https://t.co/MNMytXR1hx RT @UberFacts: She is such a good girl 😍 https://t.co/Gy3BbWlkqY This guy saw a seal trapped in fishing line... then another one... and another one... 😢 https://t.co/E4lt9vNKjb The Earth weighs about 13,170,000,000,000,000,000,000,000 pounds. 20 Underrated Horror Movies You Should Check out ASAP https://t.co/x4LFn5FldY 37 Genius Takes on Everyday Gadgets https://t.co/t9fXDJMldj RT @UberFacts: This man is determined to make this aggressive dog love him ❤️ https://t.co/qqg7zoxMJS Millennials Hilariously Respond to That Baby Boomer “They Have It so Easy” Chitter Chatter https://t.co/xbtbhVRLe8 Pressure to feel happy when you're feeling down can make you feel even worse, according to researchers from UC Berkeley.\n\nEmbracing sadness can make you feel better in the long run. 29 Tweets and Jokes About Netflix That Are Way Too Relatable https://t.co/26SxQ3Q8Lf RT @UberFacts: In 2009, Tasmanian opium farmers kept discovering designs being made in their crops.\n\nThey later found out wallabies had bee… 37 Things Trending on Amazon That Are Actually Genius https://t.co/Qh4d2rArxT 10+ Couples Explain Why They've Had Such Long Engagements https://t.co/Yhit7zgIiE Lobsters pee out of holes in their faces and before mating, lobsters use them to pee on each other. Jenny McCarthy Reveals She and Donnie Wahlberg Have Sex in Airport Bathrooms https://t.co/Kg7y6eDYQQ These Photos Prove That the American Education System Is Doomed https://t.co/w46IXcGMTZ RT @UberFacts: Bats communicate directly with one another; one of just a few species, besides humans, to do this.\n\nMost animals communicate… Woman Climbs Over a Safety Barrier at New York Zoo to Taunt Lion https://t.co/A3LLkKtvlr Hippopotomonstrosesquippedaliophobia:\n\nThe fear of long words. 29 Hysterical Tweets That Will Make You Laugh Until You Cry https://t.co/oJ9QF2JEFc 5 Facts You Should Know About the Great 'Mad Magazine' to Honor Its Legacy https://t.co/W6IcPhQ0rr Friendly Dog Knows How to Entertain Passengers on Long Flight https://t.co/jFkoYXq7Sp RT @UberFacts: The average American woman owns seven pairs of jeans but only wears four, according to a 2010 poll. Scientists Discovered a Giant Structure Under the Surface of the Moon https://t.co/VTbddazsbb October 5th is International Do Something Nice Day! Universal Studio's Mascot 'Makes White Power Sign' in Photo With Black Children https://t.co/ROrd0EEauD RT @UberFacts: The chills you get when listening to music are caused by your brain releasing dopamine; a neurotransmitter that causes pleas… 15 People Share Real-Life Plot Twists That Rocked Their World https://t.co/Epkqi3nwRX This is so interesting!  https://t.co/hikcPX8fNc Dutch Police carry teddy bears with them while on the job in case they need to calm a scared child. Sesame Street Characters Reenacted ‘Sabotage’ by the Beastie Boys. Take a Look. https://t.co/gIePg561Qw This Grandma Is the Queen of the Internet With Her Hilarious Tweets https://t.co/ppIdXoerTK RT @UberFacts: Jason Statham almost died while filming \"The Expendables 3.\" He was shooting an action scene when the breaks on his truck fa… This little guy was the runt of his litter.\n\nAnd he grew up wearing the most adorable sock-sweaters 😍 https://t.co/Ac2RfneKWH Eminem's daughter Hailie Mathers is his twin in new Instagram photo https://t.co/56Kj7JY1UG This squirrel gets everything she wants 💅😍 https://t.co/h2uGtgEVFL Check out These Hilarious Comebacks from Restaurants That Got Bad Reviews https://t.co/8fUEvxU9XW Man’s Sexist ‘How to Be a Beautiful Woman’ List Backfires Spectacularly https://t.co/Zyl6M3mgBB 10+ Times We Should've Given Nature a Standing Ovation https://t.co/GnZW9L04U1 RT @UberFacts: The most successful pirate captain in history was a Chinese woman named Ching Shih.\n\nShe was formerly a prostitute who succe… Macon Bacon and Sparkle Rice Are Names People Have Actually Named Their Children https://t.co/EJ2hBzMWhX Meet the World Champion for Excel Spreadsheets. Yes, This Is a Real Thing. https://t.co/soS2D42Of5 Check out 12 Incredible Breakfast Pastries from Around the World https://t.co/0W1aVWvMfI 13 People Who Weren’t Pleased That Their Widowed Parents Started Dating Again https://t.co/4bPuz9l3bi The Beanie Babies You Might Still Own That Are Worth a Ton of Money https://t.co/mRPmueXKCd 15 Questions About Disney Villains That Need to Be Answered Right Now https://t.co/rfkajV2fqw 15 People Share the Most Polite Way to Tell Someone to F**k Off https://t.co/W388rzfBix Don’t Pet These “Innocent” Looking Creatures! https://t.co/aGEJrXaxq6 31 Gadgets You’ll Want to Try The Instant You See Them https://t.co/BQj62UXXk8 Design Decisions That Are Both Infuriating and Kinda Impressive https://t.co/rBwo3vTfTS Actors Who Felt Extremely Uncomfortable In Their Costumes https://t.co/CQN8MCi6D5 31 Things That Are Even More Useful Than They Are Cute https://t.co/AXonLVlN3F A study found that the hairiest male members of Mensa also had higher IQs,compared to those who weren't as hairy.\n\nThe most intelligent of them all also had hair on their backs. People Share the Weirdest Compliments They've Ever Received https://t.co/7ya7rkFhHt 50 Photos That Will Remind You Why The Earth Needs Saving https://t.co/oPmignSwDj She is such a good girl 😍 https://t.co/Gy3BbWlkqY RT @UberFacts: In 2017, a neuropathologist examined the brains of 111 dead NFL players.\n\n110 of them were found to have Chronic Traumatic E… Natiform:\n\nSomething that looks like a butt. Contrary to popular belief, playing hard-to-get is more likely to turn off a romantic interest, according to researchers at the University of Rochester.\n\nTthose who feel a greater certainty about a person's interest in them put more effort into seeing them again. Addicts Share Their Pics Before and After Getting Sober https://t.co/eC0tEX7HOQ RT @UberFacts: Scotland has just become the first country in the UK to make it a criminal offense for parents to smack their children.\n\nThe… If You Live in Las Vegas, You Can Pay Your Parking Tickets with Donated School Supplies https://t.co/FbqpT1W2QP Following a 1954 report on illiteracy, the education director of Houghton Mifflin publishing gave writer Theodor Geisel a list of words he thought first graders should learn.\n\nHe told Theodor to choose 250 of them and use them a book; so Theodor wrote \"The Cat in the Hat.\" RT @UberFacts: Listening to “extreme” music can positively affect the listener, making them calmer rather than angrier, according to resear… 20 Pictures That Prove Shaquille O’Neal Is a Real-Life Giant https://t.co/IhiAzVQo0w This anxious dog didn't feel safe in his new home.\n\nSo his dad built him his own bedroom 😭❤️ https://t.co/6JJKIR8Bzo The average American woman owns seven pairs of jeans but only wears four, according to a 2010 poll. RT @UberFacts: Fred Baur, the creator of the Pringles packaging, had his ashes stored in a Pringles can after he died. People with Social Anxiety Will Laugh out Loud at These Tweets https://t.co/qE7suceren 45 Hilarious Things People Actually Put on Their Resume https://t.co/zNFx1gZxOb Jason Statham almost died while filming \"The Expendables 3.\" He was shooting an action scene when the breaks on his truck failed, driving him into the Black Sea.\n\nJason previously competed as an Olympic-quality diver for England so he was able to stop himself from drowning. RT @UberFacts: A 22-year-old college student named Dave MacPherson was the first person to enter Disneyland when it opened in 1955, becomin… These Parents Were Asked To Pick Up Their Kids From School For The Most Hilarious Reasons https://t.co/xC6NkVD7hR 10 Panoramic Animal Fails That Are so Terrible You’ll Love Them https://t.co/2U3j5adwjR The most successful pirate captain in history was a Chinese woman named Ching Shih.\n\nShe was formerly a prostitute who succeeded her husband, pirate Cheng I; eventually commanding more than 1,800 pirate ships with a crew of 80,000 men. Man Gets Testicles Trapped in IKEA Chair https://t.co/7iqxtmS6Hr This Is Why the Summer Heat Makes People Grumpy https://t.co/19UjkkoPb1 RT @UberFacts: Lemurs enjoy getting high off of toxic millipedes. ‘American Horror Story: 1984’: 5 Things You May Have Missed in Episode 3 https://t.co/FW0lN5ZSda Bats communicate directly with one another; one of just a few species, besides humans, to do this.\n\nMost animals communicate generally, not individually. A Bot Wrote a Hilarious 'John Wick' Script and People Are Loving It https://t.co/M1WIHucexI Woman’s Haircut Goes Viral For All The Wrong Reasons https://t.co/V2Gd6PxEcx RT @UberFacts: Canadian photographer Rolf Hicker captured this image of a grizzly bear, emaciated due to the depleted salmon population.\n\nH… Woman in Zombie Make-Up Sends Hospital in Mass Panic https://t.co/2ZMJzQYNWy Quidi Vidi Brewery in Newfoundland makes their beer using water harvested directly from icebergs that are up to 20,000 years old. Disneyland’s First-Ever Customer Has Been Using His Lifetime Ticket Every Year Since 1955 https://t.co/rXSV7h5D99 Yawning literally cools your brain, according to researchers at the University of Vienna. RT @UberFacts: Pringles had to use a supercomputer to engineer their chips with optimal aerodynamic properties.\n\nThey're produced so quickl… Best Friends Celebrate 23-Year Friendiversary With Beer and Chicken Wing Photoshoot https://t.co/sZtN3Ic926 I'm Going to Laugh While I Read These 14 Tweets. Will You Join Me? https://t.co/pboSljBoMs People Share the Worst City They’ve Ever Visited in Their Lives https://t.co/wK9jtyNxnw R.I.P. iTunes https://t.co/tCUvOZN8yp RT @UberFacts: For 45 years, the final science exam for eighth-graders in Ketchikan, Alaska, has been an overnight survival trip on an unin… The chills you get when listening to music are caused by your brain releasing dopamine; a neurotransmitter that causes pleasure. Millennials Are Rewatching Ace Ventura: Pet Detective and Saying It’s Super Offensive https://t.co/eKwV3NkGTq Drunk People Can Sometimes Be Really Entertaining. Here's the Proof. https://t.co/KkvHl81fgF These 20 Television Shows Only Lasted One Season, but They're All Worth Your Time https://t.co/zqJLyUnUvc PETA calls out Justin Bieber for spending $35K on exotic cats https://t.co/b5ty00cKVt If You Love Drama, These Memes Are Right up Your Alley https://t.co/t448cmIv5S These orphaned baby raccoons are learning how to survive... with help from the sweetest mother dog.\n\n❤️ https://t.co/l4XDERVZmy Babysitter Shows Mom Her Horrible ‘Deleted Texts’ After She Refused to Pay Her https://t.co/SFBBIFUIym RT @UberFacts: Magic: The Gathering is the world's most complicated game, according to a review by MIT.\n\nThe game includes more than 2,000… This Italian Pastry Chef Turns His Desserts into Amazing Miniature Worlds https://t.co/SmH3vBurB9 37 Things That’ll Make You Say, “Dang, That’s Clever!” https://t.co/pAT2IjTtI3 This man is determined to make this aggressive dog love him ❤️ https://t.co/qqg7zoxMJS Married Couples Confess: We Haven’t Consummated Our Marriage yet https://t.co/DZfbZkS7JI 19 Hilarious Tinder Messages That Will Make You Fall in Love https://t.co/CSjucbiYec Adorable Photos of Dogs at Bath Time! Oh Yeah! https://t.co/JT1pbHv2k8 In 2009, Tasmanian opium farmers kept discovering designs being made in their crops.\n\nThey later found out wallabies had been getting high and bouncing around in circles. October 4th is National Taco Day! People Are Hilariously Shaming Their Fish For Misbehaving https://t.co/SbF7CyGSfZ 15 People Who Have Been in Comas Describe Their Experiences https://t.co/nSX4EbJijB 29 People Who Were Clearly Drunk When They Designed Their Bar https://t.co/1tT02o9MGe 10+ Memes About Morning and Not-Morning People That Should Look Familiar https://t.co/BFlgg8AGl1 The Huge Changes in These 12 Animals Pre and Post-Adoption Will Melt Your Heart https://t.co/tnyKJxvKnT The Cast of American Pie, Then and Now https://t.co/wpZXixkCpf RT @UberFacts: Slowly eating your food can help you lose weight.\n\nIt takes about 20 minutes for your gut to suppress the hormone ghrelin, w… RT @UberFacts: People who regularly sleep for more than nine hours a night can be 34% more likely to suffer a heart attack, according to re… Will Smith Releases a ‘Fresh’ Clothing Line https://t.co/eE3PBnshfJ Listening to “extreme” music can positively affect the listener, making them calmer rather than angrier, according to researchers from the University of Queensland. 20 Memes for Moms That Are Extremely Relatable https://t.co/MWNd1j4iAK A Woman is Sharing the Terrifying Texts Her Psycho Ex-Husband Sent Her https://t.co/8HUtWQJ7Ku If Influencers Ask for Free Food, This Ice Cream Truck Owner Charges Them Double https://t.co/9e0yPd47gV RT @UberFacts: Humans represent just 0.01% of all living things on the planet but have caused the loss of 83% of all wild mammals and half… School Cafeteria Turns Left Over Food Into Frozen Meals for Kids to Take Home https://t.co/UOsa1fbQhk RT @UberFacts: Marijuana users tend to have more sex than people who don't smoke, according to Stanford researchers. In 2017, a neuropathologist examined the brains of 111 dead NFL players.\n\n110 of them were found to have Chronic Traumatic Encephalopathy, a degenerative disease thought to be caused by repeated strikes to the head. Check out These Scary Stories That Are 500 Words or Less. You'll Be Checking Your Closets Tonight. https://t.co/40iLNZITLY RT @UberFacts: Maintaining a positive attitude makes your brain more efficient, according to researchers at the Stanford University School… 31 of the Handiest Gadgets on Amazon https://t.co/McBPgTpJrS Cop stops on a highway to save a tiny kitten.\n\n❤️❤️ https://t.co/YhC3dMFCpg RT @UberFacts: Listening to your favorite music causes your brain to release dopamine, decreasing stress, and improving your mood. Wild flamingos were starving to death — until this woman opened a flamingo shelter.\n\n❤️ https://t.co/uAMkT5TZR7 Keep These Savage Responses to Texts from Exes in Mind Next Time an Old Flame Gets in Touch https://t.co/IsI4tCbvJb These Stories Will Restore Your Faith in Humanity https://t.co/rxy5fOqrBj RT @UberFacts: A flame at the Hiroshima Peace Memorial Park has burned since it was lit in 1964.\n\nIt will stay lit until all nuclear bombs… Lemurs enjoy getting high off of toxic millipedes. RT @UberFacts: Dolphins go on killing sprees when they're sexually frustrated. Take a Look at These Photos of What Kids Eating Around the World https://t.co/dLOf5RMAR1 31 Small-Yet-Genius Inventions You’ll Use Every Day https://t.co/q5aBexd3nm Hundreds of People Are Reporting Bigfoot Sightings in Pennsylvania https://t.co/1aIymiTXf1 RT @UberFacts: In 2010, a Japanese company created a fire alarm for people who are hearing impaired.\n\nIt sprays vaporized wasabi into the a… 31 of the Weirdest Things on Amazon That People Actually Buy https://t.co/AbelYcV1HO These Adorable Cow Photos Just Might Make You Want to Adopt One https://t.co/QzCgSIjrBE Ryan Reynolds Jokes About The Amount of Times He’s Had Sex With Blake Lively https://t.co/lBlK0gyzVZ A 22-year-old college student named Dave MacPherson was the first person to enter Disneyland when it opened in 1955, becoming their first guest ever.\n\nHe's been using his \"lifetime entry\" ticket to go back every year since. Watch this guy bring a “dead” little mouse back to life!\n\n🐭❤️🐁 https://t.co/Y4g9D62kRS Here Are Some Good Scary Movies On Netflix: https://t.co/K6HzZRnMKX RT @UberFacts: Cherophobia is the fear of being too happy because \"something tragic\" will happen. 15 Movies People Saw Too Young That Scarred Them for Life https://t.co/7amgPbgaOe The Funniest Pictures Ever Taken in Ubers and Taxis https://t.co/d28CBysstc Lord of the Rings' Actress Wants a Female Gandalf in the New TV Series https://t.co/5uTli10soZ For 45 years, the final science exam for eighth-graders in Ketchikan, Alaska, has been an overnight survival trip on an uninhabited island. Twins Who Played Emma in 'Friends' Post Amazing Behind-The-Scenes Throwback Photo https://t.co/lwvOVi5juo People Who Attended High School Reunions Reveal What Happened to ‘the Cool Kids’ https://t.co/F59EfPr5h1 RT @UberFacts: During the early 19th century, oysters were cheap and were mainly consumed by the working class. George RR Martin Says 'Game of Thrones' Could Have Run for Five More Seasons https://t.co/hpreRUgzOi 15 Things People Didn’t Understand Until They Became Adults https://t.co/o6kDA94Zb4 RT @UberFacts: October 3rd is National Boyfriend Day! Killer ex-cop gets 10 years for murdering unarmed black neighbor in his home https://t.co/JDtmMIyAdy These Dads Swore They Didn’t Want Cats. They Were Lying. https://t.co/PUbGZ80kqQ Magic: The Gathering is the world's most complicated game, according to a review by MIT.\n\nThe game includes more than 2,000 rules and over 19,000 unique cards. Little Girl Hilariously Schools her Teacher on ‘Collective Punishment’ https://t.co/YqgfVnrRr3 RT @UberFacts: Until the late 15th century, the word ‘girl’ referred to a child of either sex.\n\nMale babies were called \"knave girls\" and f… 13 People Share Their Most Awkward Make out Stories https://t.co/AT02uZAZoC Prince Harry rips Daily Mail for 'ruthless' Diana-like campaign against Meghan Markle https://t.co/1NINUMDsVl RT @UberFacts: People who get less than eight hours of sleep a night are more likely to suffer from depression and anxiety, according to re… 13 Reasons Why Single Life Is Actually the Best Thing Ever https://t.co/un8Sx4qCzO People Who Were So Angry They Just Had to Write a Note https://t.co/t3PrvQAUxo These Small Town Memes Will Give You Big Laughs https://t.co/Mz1kip8VpG RT @UberFacts: Dave Thompson, the actor who played Tinky Winky in the \"Teletubbies\" burst into tears after being fired in 1997.\n\nThey told… 36 Holy-Grail Products With Over 3,000 Reviews on Amazon https://t.co/HCVheJvrNt 15 Funny Tweets About Animals That'll Give You a Good Laugh https://t.co/PCtGZsDckH 10 Facts About Chernobyl That Will Give You the Creeps https://t.co/OMHqQvR07o 17 Bombshells From the ’90s Who Are Still Stunning https://t.co/y6qYLIDNSS Canadian photographer Rolf Hicker captured this image of a grizzly bear, emaciated due to the depleted salmon population.\n\nHibernation is quickly approaching, and commercial fishermen in British Columbia have said this was the worst salmon season they've seen in almost 50 years. https://t.co/83R5Ld7leg Scotland has just become the first country in the UK to make it a criminal offense for parents to smack their children.\n\nThe ban on all physical punishment was backed by 84 votes to 29 by the Scottish Parliament. O.J. Simpson was acquitted on two counts of murder in the killings of Nicole Brown Simpson and Ronald Lyle Goldman on October 3rd, 1995.\n\nExactly 24 years ago. The Most Delightful Halloween Costumes For Dogs And Their Owners! https://t.co/0czsAF9jqs @guskenworthy https://t.co/5e4Eo9O1qK RT @UberFacts: Tabasco pepper sauce is aged for three years in used whiskey barrels before it's bottled. During the early 19th century, oysters were cheap and were mainly consumed by the working class. 11 Things That Were Designed Purely Because of Human Stupidity https://t.co/JMeOjDNO0e October 3rd is National Boyfriend Day! People Who Quit Their Jobs for Mental Health Reasons Reveal What Happened Next https://t.co/U3dfRoj5it The Creepiest Nature Pics Ever Taken https://t.co/483UUKVSIs RT @UberFacts: Dogs make judgments and can tell the difference between 'good' and 'bad' people – They're also more likely to avoid people w… Check out These Embarrassing Things Parents Found When Snooping Through Their Kids’ Texts https://t.co/oxOna0kiqQ Prince Harry and Meghan Markle Sue British Tabloid Over ‘Bullying’ https://t.co/6FsMpFDkwC “It’s October 3rd.” #MeanGirlsDay https://t.co/sH5ocPBLOl RT @UberFacts: Men should hang out with 4-5 of their friends at least twice a week because it's good for their health, according to researc… Maintaining a positive attitude makes your brain more efficient, according to researchers at the Stanford University School of Medicine. First Date Stories That Show How Chivalry Is Dead https://t.co/DlvK75kVQu Get Ready for the New, Live Action 'Little Mermaid' Movie with This Amazing Fan Art https://t.co/s5fOgSDR9D RT @UberFacts: 63 Earths could fit inside of Uranus. New Hotel Has a ‘No Men Allowed’ Policy https://t.co/rJ9iKkhP6r If You Work in Customer Service, You’ll Feel These Memes in Your Soul https://t.co/xYdkruM681 Until the late 15th century, the word ‘girl’ referred to a child of either sex.\n\nMale babies were called \"knave girls\" and females were called \"gay girls.\" RT @UberFacts: Musicians only get 12 percent of the money the music industry makes, according to a 2018 report. Here's How You Can Adopt a Dog Who Failed Government Training for Being ‘Too Nice” https://t.co/Smel1uWv4Q 18 Selfie Captions That Are So Good, You Won’t Even Feel Guilty Stealing Them https://t.co/wTC7Ih1YW2 RT @UberFacts: Eating releases endorphins and literally makes your brain happy. A flame at the Hiroshima Peace Memorial Park has burned since it was lit in 1964.\n\nIt will stay lit until all nuclear bombs on the planet are destroyed, and the world is free from the threat of nuclear destruction. An Artist Installs Realistic Looking Mannequins Around the World Just to Mess with People https://t.co/0XKzzcwV1M A Captive Female Shark Ate a Male Shark Who Wouldn’t Stop Bumping into Her https://t.co/mVntoR50Pn 36 Ingenious Everyday Inventions That’d Make Inspector Gadget Jealous https://t.co/yHzxoyYV2t Humans represent just 0.01% of all living things on the planet but have caused the loss of 83% of all wild mammals and half of plants, according to a 2018 study. RT @UberFacts: Members of the great ape family (including chimpanzees, bonobos, and orangutans) appear to possess “theory of mind,” accordi… This Halloween, give your dog the best day of their life\n\n❤️ https://t.co/gxTbNA2AjW 10+ People Share All-You-Can-Eat Buffet Horror Stories https://t.co/Qo6Enz7fVA 29 of the Funniest Cat-Related Tweets of All Time https://t.co/vZfoIMeT0y In 2010, a Japanese company created a fire alarm for people who are hearing impaired.\n\nIt sprays vaporized wasabi into the air. RT @UberFacts: People who are more intelligent tend to go to bed later and get up later. 10 Before and After Photos of Glamazon ’90s Supermodels, Then and Now https://t.co/gXUQ5Len4d Too cute to be real...\n\n❤️❤️ https://t.co/OMzng9pm0G People who regularly sleep for more than nine hours a night can be 34% more likely to suffer a heart attack, according to researchers from the University of Colorado at Boulder. 31 Of The Most Popular Products On Amazon https://t.co/IuAZAYAN8I RT @UberFacts: At least three potentially hazardous asteroids made close approaches to Earth today (October 1st); they were discovered with… 15 People Share the Weird Things They Did When They Were Kids https://t.co/4li6I6EvPC Netflix October 2019 Schedule: Complete List Of New Netflix Movies And Shows https://t.co/sPkgOSUpXp RT @UberFacts: Wild Deer Crashes Wedding Shoot to Eat Bride's Bouquet https://t.co/UtnbvH1L7C RT @UberFacts: Marijuana was the first thing sold over the Internet. http://t.co/u4BdWgCy6m These Are the Weirdest Ways That People Have Died https://t.co/01JFsbXWPT These Coyote Vests for Dogs Are Pretty Amazing https://t.co/BtDgii8RCB The Heartbreaking Never-Before-Told Story Behind the Beatles' Song 'Hey Jude' https://t.co/gUClbYxHXa Dave Thompson, the actor who played Tinky Winky in the \"Teletubbies\" burst into tears after being fired in 1997.\n\nThey told him his \"interpretation of the role was not acceptable.\" Chilling Conspiracy Theories That Turned out to Be Completely True https://t.co/tdX2kWVaA4 10 Couples Admit How Infidelity Surprisingly Saved Their Marriage https://t.co/ZIGapNFO5S RT @UberFacts: Just one hour of exercise a week can help prevent depression. People Are Losing Their Minds Trying to Find the Leopard in This Photo https://t.co/Xo9cbcgGMT 11 Stepparents Explain Why They’re Fed up with Their Stepkids’ Nonsense https://t.co/Z5AxZVng67 Listening to your favorite music causes your brain to release dopamine, decreasing stress, and improving your mood. Well that's one way to tip your driver 😂 https://t.co/ZckO1CDtms RT @UberFacts: It's illegal to be emo in Russia. Garbage Collectors &amp; Dumpster Divers Reveal the Insane Stuff People Threw ​Out https://t.co/3YT2mZfyVC Millennials Are Rewatching ‘Seinfeld’ and Saying It’s Super Offensive https://t.co/VJeEu0Fpip RT @UberFacts: Scientists at Northwestern University have validated the age-old adage, \"what doesn't kill you makes you stronger.\" \n\nThey f… People who get less than eight hours of sleep a night are more likely to suffer from depression and anxiety, according to researchers from Binghamton University. Infamous red carpet crasher attacks Justin Timberlake at Louis Vuitton show https://t.co/YRjNlTSg05 Calves Protect Their Ears from Frostbite with Muffs, and It’s Pretty Adorable https://t.co/Tk7657dESv RT @UberFacts: Tacos from Taco Bell originally cost 19 cents when the restaurant first opened. The 22 Best Versions of Products You Use Every Day (All Under $30) https://t.co/iFvhENDbsq RT @UberFacts: Meet this goose and his dad!!!\n\n😂 https://t.co/x8N71IrxCa A Man Live-Tweeted His Apartment Getting Taken over by His Neighbor’s Pets https://t.co/DxnsMoepeL 17 Facebook Post Fails So Awkward You Can’t Help But Cringe https://t.co/v0meAv1FcV RT @UberFacts: 14 squirrels were arrested and detained by Iran for espionage in 2007. These Pictures Prove Senior Dogs Are as Good as It Gets https://t.co/j0CQMxTOiW 37 As-Seen-On-TV Products That Actually DO Work https://t.co/3gMyOF6jzR A Preacher Who Carried a “You Deserve Rape” Sign Got Hit with a Baseball Bat and the Comments Are Priceless https://t.co/tJeUxpwAAq Meet the smallest, toughest animal on earth!\n\n🤯 https://t.co/HV9B7w4YBD Adorable Babies Dressed In Cute And Creative Halloween Costumes https://t.co/ulRAlzV1E0 People Shared Photos of Working Cats and They Are Wonderful https://t.co/1vADt9KEnS This guy risked his marriage to save a stray 3-legged cat.\n\n😻❤️ https://t.co/TiQg7fT26O The first \"Peanuts\" comic strip was published in nine newspapers on October 2nd, 1950.\n\nExactly 69 years ago. 29 Teachers Who Win at School and at Life https://t.co/Tn7X9LZzKe RT @UberFacts: Pornhub has a branch of their company named \"Pornhub Cares\" where they focus on humanitarian efforts, such as breast and tes… Waiters Share the Most Insane Things They’ve Overheard at Their Tables https://t.co/P19dRkHUet 25 Perfect Drunk Texts That Will Have You Rolling on The Floor https://t.co/gs0y2cl5W2 RT @UberFacts: Mountain Dew was originally made to be mixed with whiskey. Tabasco pepper sauce is aged for three years in used whiskey barrels before it's bottled. ‘Joker’ Is Set To Break Box Office Records https://t.co/0CmZVYJAv1 Here Are Some Great Facts to Help You Get Through This Long, Hot Summer https://t.co/3ylGs6L3Ks RT @UberFacts: Too much stress can suppress your immune system and cause you to get sick more easily. Here Are My 30 Favorite Things I Ever Bought on Amazon https://t.co/Gb5jY1Hij4 Remakes of Melodramatic Hipster Memes Will Have You Snorting into Your Craft Beer https://t.co/yklCHifaid RT @UberFacts: The average woman will kiss 15 men and be heartbroken twice before meeting \"the one,\" according to a 2014 UK study.\n\nThe stu… Wild Deer Crashes Wedding Shoot to Eat Bride's Bouquet https://t.co/UtnbvH1L7C A German Town Came up with a Genius Plan to Deprive a Neo-Nazi Music Festival of Beer https://t.co/GOpIXXNowS Just one hour of exercise a week can help prevent depression. RT @UberFacts: Men can get an erection after death.\n\nIt's sometimes called \"angel lust.\" This Japanese Man Married a Hologram in a Ceremony That Cost $17,000 https://t.co/Ujp6XQSng6 Instagram Model Makes Thousands Selling Used Underwear to Creeps https://t.co/nJuXXbdtzN These People All Won the Internet Today with Their Perfect Responses https://t.co/QWhtqfXBLV RT @UberFacts: Talking to yourself in the third person can help relieve stress and anxiety.\n\nIt improves your ability to manage your emotio… RT @UberFacts: Being single is better for your overall health and well-being than being in a relationship, according to researchers from th… Slowly eating your food can help you lose weight.\n\nIt takes about 20 minutes for your gut to suppress the hormone ghrelin, which makes you feel hungry, and slowing down can give your brain more time to receive the signal. The 28 Most Reviewed Products On Amazon https://t.co/SfoKpdxN66 12 People Come Clean About When Things Got Weird in the Jacuzzi https://t.co/NOPdLmnOG5 Actual Lions Watching a Zoo Drill for a Lion Escape Is Amazing https://t.co/Dp0U3xJMBS RT @UberFacts: Human babies are 75 percent water at birth.\n\nA banana is 74% water. 15 People Admit Why They Immediately Lost Interest in Their Crush https://t.co/ZFrSOdTq6i The Biggest ‘Oh Crap’ Moments That Have Ever Happened in a Courtroom https://t.co/YX5hcx5jUu RT @UberFacts: Sylvester Stallone nearly died filming \"Rocky IV\" after asking Dolph Lundgren hit him for real. Lundgren struck him so hard;… Tacos from Taco Bell originally cost 19 cents when the restaurant first opened. This Woman Hilariously Live-Tweeted a Date From Hell https://t.co/sfXWULUksX 15 Women Share the Things They Think Men Shouldn't Feel Insecure About https://t.co/75Qvd2bkz2 RT @UberFacts: 28% of people report uninstalling apps because of too many ads and notifications. 37 Products Perfect For Grown-Lady Life https://t.co/RORzvzot7T Parents are simply the best.\n\n❤️ https://t.co/k746fLCKsm Meet this goose and his dad!!!\n\n😂 https://t.co/x8N71IrxCa Furious Meghan McCain Rips Republicans on Impeachment https://t.co/I8AaYcqhWr RT @UberFacts: In 1825, President John Quincy Adams took the oath of office on a book of constitutional law, instead of a Bible. RT @UberFacts: More American presidents have been born in October than any other month. Members of the great ape family (including chimpanzees, bonobos, and orangutans) appear to possess “theory of mind,” according to researchers from Kyoto University.\n\nThey can understand the knowledge, motives, and intents of others; an ability considered to be uniquely human. These 35 Creepy Photos of Ghosts Will Give You Nightmares https://t.co/KUcy1k27Qn This dog plays dead when he doesn’t want to go inside.\n\n😂 https://t.co/KijS0sOxtv This Woman’s Butt Proves Weights In the Gym Mean More Than Weight On the Scale https://t.co/MbIXF8FRRK 25 of the Most Hilarious Cat Tweets out There https://t.co/Y6xMYkvmQB At least three potentially hazardous asteroids made close approaches to Earth today (October 1st); they were discovered within the last 24 hours.\n\nA fourth asteroid is set to make a close pass in... 28 minutes. RT @UberFacts: Mary Shelley, the author of Frankenstein, reportedly lost her virginity on her own mother's grave. Weird Historical Facts You Definitely Never Learned in School https://t.co/KkqFBS0kaL 20 Things That All Dads Do, Even Though They Have No Idea Why https://t.co/ICZYtOPHzp When this owl crashed through a family's window, they took him in until he was able to fly again.\n\n❤️🦉 https://t.co/l1XtH3x1SG Most people can't wait to leave their tiny college dorm; not this woman! https://t.co/HaCHWl6jHp Musicians only get 12 percent of the money the music industry makes, according to a 2018 report. RT @UberFacts: Apple has enough money to buy Netflix and Disney.\n\n... and pay in cash. Indigenous People You Never Knew Existed https://t.co/bHgFXKz3Ev RT @UberFacts: Feelings of gratitude can help improve your decision-making, according to researchers. The People Who Committed These 15 Crimes Against Food Need to Be Sent to Prison Immediately https://t.co/drg3gjLFcN Justin Bieber and Hailey Baldwin wed (again) in South Carolina https://t.co/kyahPFLrR4 McDonald’s Employees Reveal What It’s Really like Working Under the Golden Arches https://t.co/VdCM8szeWK People Reveal How Their Bosses Instantly Ruined Company Morale https://t.co/JuvSTnvFHl If You See a Purple Butterfly On a Baby’s Crib, Make Sure You Know What It Means… https://t.co/qhqV7A4MWA Watch as these tiny eggs hatch into the cutest little birds! https://t.co/lhKaldxIdt Here's a List of Quentin Tarantino’s Favorite Films https://t.co/yGktGl5kdV Teacher Refuses to Confiscate Students’ Phones, and Once You Hear Why, You’ll Agree With Him https://t.co/RgmSTLSrsK Jimmy Carter, the oldest living former US president, turned 95 today. Meet the couple that spends 20 hours a day rescuing monkeys.\n\n🐒❤️ https://t.co/W4AHpAvKDx Things Millennials May Have to Explain to Anyone Born After 1996 https://t.co/xkQ9p8NYGP 10+ OMFG Tweets That Will Bring You All the LOLs https://t.co/vgb7bVDbZe Scientists at Northwestern University have validated the age-old adage, \"what doesn't kill you makes you stronger.\" \n\nThey found that failure early in a person's career is associated with greater success in the future among those who pick themselves up and try again. A New Zealand Aquarium Picks A ‘Naughty’ Penguin Every Month https://t.co/svgYohRnFy Too much stress can suppress your immune system and cause you to get sick more easily. The average woman will kiss 15 men and be heartbroken twice before meeting \"the one,\" according to a 2014 UK study.\n\nThe study also found that she will suffer four disaster dates and be stood up once. Tweets About Awful First Dates That Will Make You Glad You’re Single https://t.co/UgXLDbzW4O RT @UberFacts: An MRI scan of a dog's brain found that dogs see their owners as family and prioritize the smell of humans over everything e… Sylvester Stallone nearly died filming \"Rocky IV\" after asking Dolph Lundgren hit him for real. Lundgren struck him so hard; he bruised Stallone's heart.\n\nHe spent a week in the hospital recovering. 37 Gadgets That Will Save You So Much Time https://t.co/z1AHC7q1MA In 1825, President John Quincy Adams took the oath of office on a book of constitutional law, instead of a Bible. Feelings of gratitude can help improve your decision-making, according to researchers. Can You Remember Who Said These Comedy Movie One-Liners? https://t.co/8stKwuBfwn More American presidents have been born in October than any other month. RT @UberFacts: Going to concerts and experiencing live music can be more beneficial to your mental health than yoga, according to researche… Psych Ward Nurses Share the Moments That Totally Shocked Them https://t.co/tQNmHxKEjl These 24 People Totally Got Burned on Social Media https://t.co/ESYpe5ntvg Here's the Best Place to Grab a Hot Dog in Every State https://t.co/gWYppEi4Nu Human babies are 75 percent water at birth.\n\nA banana is 74% water. Donald Trump Trolled by 'Make America Greta Again' Hats https://t.co/rgzFTlfg5c RT @UberFacts: Cillian Murphy has smoked over 3,000 herbal cigarettes playing Tommy Shelby in \"Peaky Blinders,\" according to an estimate fr… These Random Tweets Will Be Hilarious from Now Until Forever https://t.co/zbnPGqh8vS Just too cute to be real!\n\n❤️ https://t.co/A5tswznAcu RT @UberFacts: Real dead bodies ended up on set during the production of \"Apocolypse Now.\"\n\nThey were brought in by someone who supplied ca… Comparison of What People See With and Without Astigmatism Is an Eye Opener https://t.co/GmEH0szrrs These Tumblr Posts About Movies Are Totally on Point https://t.co/ROlRitw9UZ 15 High School Teachers Share the Dark Secrets They Keep from Students https://t.co/Jq5L40IgeC Mary Shelley, the author of Frankenstein, reportedly lost her virginity on her own mother's grave. RT @UberFacts: A pilot let this rescued baby chimp ride on his lap for the sweetest reason\n\n❤️ https://t.co/RVSQV5Slbo Vagina Wigs Were an Actual Thing in 2018 https://t.co/JamSEnGIr3 Enjoy These Funny Tweets About Anxiety When You Need a Break https://t.co/Zgywo0baRv Men can get an erection after death.\n\nIt's sometimes called \"angel lust.\" RT @UberFacts: With over 250,000 deaths per year, medical errors are the third leading cause of death in the United States. It took this bird 20 years to find the perfect mom\n\n❤️ https://t.co/OneWw94Xgs 10 Genius Smartphone Features That Most People Don’t Know About Yet https://t.co/Przl42aprf Honest People Admit Dumb Things They Did While Completely Blackout Drunk https://t.co/gRKWQsOYSI RT @UberFacts: Cockroaches have been known to eat the flesh of both living and dead humans. Child Destroys $1,000 Worth of Make-Up at Sephora https://t.co/8akvgq2pJa This is why wild animals don't belong in circuses.\n\n🐯💞 https://t.co/lYhDh5bz86 28% of people report uninstalling apps because of too many ads and notifications. Kate Hudson Reveals She’s Raising Her Daughter Genderless https://t.co/K1R2fh2q6l RT @UberFacts: Playing video games can train the human brain to make faster real-life decisions that are no less accurate, according to res… Apple has enough money to buy Netflix and Disney.\n\n... and pay in cash. Jessica Lange Says She Might Be Done With TV Acting For Good After Netflix’s ‘The Politician’ https://t.co/evHqd2bSh9 If You're Trying to Eat Healthier, You Need to Check out These 20 Great Food Charts https://t.co/IdqTbSlVdO Here Are Some of the Most Expensive Celebrities You Can Book on Cameo https://t.co/UsgKxS4M10 Beach Photos That Might Not Make the Family Christmas Card This Year https://t.co/t0T8SzlpCt RT @UberFacts: If the sun were to explode right now, we wouldn't know it for another eight minutes and 20 seconds. Aaron Carter Gets Huge Face Tattoo of Rihanna https://t.co/aR5BpvH1p2 Baby possums might just be the cutest animals on the planet.\n\n💞 https://t.co/G8NUntc1Xw 37 Cleaning Inventions That’ll Basically Do The Work For You https://t.co/Aghxxkh7dE Talking to yourself in the third person can help relieve stress and anxiety.\n\nIt improves your ability to manage your emotions. ‘Rage Yoga’ Lets You Swear and Drink. Sounds Perfect! https://t.co/tV8ya8jv4A Halsey And Evan Peters Are Finally In A Relationship https://t.co/XGck9CJpaf RT @UberFacts: It's possible for people who have experienced severe trauma to die from simply giving up on life.\n\nA 2018 study found that p… Millennials Pretend to Be Baby Boomers on Facebook and It Is Very Amusing https://t.co/5lEISUKjvk Read this before getting microblading https://t.co/t8txP1LM9E Did You Know the 16th Century Had Its Own Version of Facebook? https://t.co/M6E20cZ8ri Brave Women Are Sharing Their Abortion Stories with the Hashtag #YouKnowMe https://t.co/UVZ7orUKcs 20 Times Military Women Showed the World How Incredible They Are, Both in and out of Uniform https://t.co/5MNInsfYcE 15 People Share the Craziest Things Drill Instructors Made Them Do https://t.co/gg03VZ8wHv 15 Tweets That You Will Definitely Find Funny https://t.co/87ZqOhCFLl Robert De Niro drops F-bombs on live TV, lashes out at pro-Trump critics https://t.co/s8KMO5kiRC RT @UberFacts: The mouth of every child contains a double row of teeth. https://t.co/XE7z3HvVma These Are the Four Magic Phrases to Know When You Get Stopped by the Cops https://t.co/mVV0v3lose Life Hacks For People With No Moral Compass https://t.co/ZYs6fMbss2 These Twitter Posts Were the Reason We Smiled Today https://t.co/aQRQLisnqD Guy Documents Weird AF First Week of Work at Target. Spoiler: People Are Strange https://t.co/lSAYS4q7OA 37 Things So Well-Made, You’ll Never Need To Replace Them https://t.co/ngyQIOe5tL 39 Terrible Tourist Faux Pas People Make in Major Cities Around the Globe https://t.co/N14jRKRnWp Adorable Things Owners Did For Their Pets https://t.co/8XGa14j7EA 19 Parenting Hacks That Will Turn You into Supermom https://t.co/cJ4KhNGxrq The mouth of every child contains a double row of teeth. https://t.co/XE7z3HvVma 37 Things That’ll Make You Say: Why Don’t I Own That Already? https://t.co/JYUav4MUUe Cockroaches have been known to eat the flesh of both living and dead humans. If the sun were to explode right now, we wouldn't know it for another eight minutes and 20 seconds. Is Jonah Hill About To Become A Comic Book Villain? https://t.co/XOR9goDqyw With over 250,000 deaths per year, medical errors are the third leading cause of death in the United States. Playing video games can train the human brain to make faster real-life decisions that are no less accurate, according to researchers at the University of Rochester. Seth Rogen Let These 21 ‘Pineapple Express’ Secrets Slip 10 Years Later https://t.co/WIMwcNIxMc RT @UberFacts: In the original version of \"The Little Mermaid\", Ariel does not marry the prince -- He marries someone else and she dies. RT @UberFacts: Couples who poke innocent fun at each other tend to have happier and stronger relationships, according to researchers. Sexy White Claw' Is Now an Official Halloween Costume https://t.co/2BYQ4Wuznu It's possible for people who have experienced severe trauma to die from simply giving up on life.\n\nA 2018 study found that people can develop extreme apathy, give up hope, abandon the will to live and die, without a clear organic cause. Cillian Murphy has smoked over 3,000 herbal cigarettes playing Tommy Shelby in \"Peaky Blinders,\" according to an estimate from the prop department. Real dead bodies ended up on set during the production of \"Apocolypse Now.\"\n\nThey were brought in by someone who supplied cadavers to medical schools for autopsies... he was actually a grave robber. This guy risked his marriage for a stray 3-legged cat\n\n😻❤️ https://t.co/CdVEK3Yf1r Relatable Facts About Millennials That Are Way Too Real https://t.co/zdlrZ0Bp6Q This man found a tiny kitten in the rubble of a huge fire and promised to make him a part of his family if he survived.\n\n😻💗 https://t.co/kpG4hoBh1B RT @UberFacts: Octopuses have three hearts. People Get a Lei When They Get off the Plane in Hawaii. What Would Other States Give Visitors If They Did Something Similar? https://t.co/ggUuXotooD The amazing ways a dog knows exactly when you'll be home\n\n❤️ https://t.co/0r4gvxqAUm Woman Opens Plane’s Emergency Door Because She’s ‘Too Hot’ https://t.co/sibMzwf4L6 RT @UberFacts: In 2015, Sweden began using an underwater neon sign of a gay sailor to deter Russian submarines from entering their territor… A Bunch of Men on Twitter Came Unglued at the Mere Mention of a Female Playing 'The Joker' https://t.co/6rR6r9jBf8 Clam Chowder Popsicles Are Here to Potentially Ruin Your Summer https://t.co/9jObC0KCTS RT @UberFacts: Caffeinated bees become busier, but not more productive. 37 Genius Discoveries on Amazon You’ll Use Every. Dang. Day. https://t.co/ZvD8B4sXeU 15 People Reveal When They Had Weird Feelings About a Situation and They Were Exactly Right https://t.co/THvGjScktn 15+ Times Ken M Proved He Might Just Be the Best Troll Around https://t.co/5lNHdBLcWb 20 People Who Clearly Do Not Know How to Follow Simple Directions https://t.co/ZwNPZW00KZ RT @UberFacts: If an Interstate Route has an odd number, it runs north and south; even numbers run east and west. 10+ Tweets That You Need in Your Life Right Now https://t.co/qJYZjOMQcA According To Science, This Is What Jesus Would Actually Look Like https://t.co/Sk0NJ72j5A 20 Very Happy People Share Why Being Single Is Totally Worth It https://t.co/ukrTEhiKwA RT @UberFacts: Hummingbirds are only found in the Americas today.\n\nHowever, the oldest hummingbird fossil ever collected was found in Germa… SNL' Report Card: Is This The Year That Pete Davidson Finally Pulls It All Together? https://t.co/UZ71uxjtKl This Woman Is Waging a Hilarious War Against Selfies by \"Dying\" in Her Photos https://t.co/F1cW2lwZMz RT @UberFacts: \"Brain training\" apps like Luminosity, Elevate and Peak do not improve neural activity or decision making.\n\nYou just become… Disney Releases First Pictures of Emma Stone as Cruella de Vil https://t.co/AJtbieshQO Drop Those Doritos – Here Are 15 Healthy Snacks You Can Eat Instead! https://t.co/5IdcDxL4mW 33 Things That’ll Help You Do Stuff Better https://t.co/7jOCyiLk7Y A pilot let this rescued baby chimp ride on his lap for the sweetest reason\n\n❤️ https://t.co/RVSQV5Slbo Fake Photo Of Greta Thunberg Eating Lunch Next To Poor Children Sparks Outrage https://t.co/cf9ekHZ8Gu RT @UberFacts: Farting can help reduce your blood pressure, according to scientists at Johns Hopkins University. These Drunken Stories Will Prevent You from Ever Blacking out Again https://t.co/Lun0mmpDyx Transgender Woman Replies to Creep’s Penis Pic With One of Her Own https://t.co/zg840YKVP3 Blow-Dried, Fluffy Cows Are All the Rage, and You Might Want to Get on Board https://t.co/ynZRm0lkoD RT @UberFacts: Last Thursday, when a Georgia college student couldn't find a babysitter, professor Ramata Sissoko Cissé gave a 3-hour anato… If you want to date an athlete, you should read this. https://t.co/sNIxqCC1NR People Share the Things They Didn’t Know Were “So American” Until They Traveled Outside the U.S. https://t.co/EnoeuQ7qOx Enjoy These Stories of Food Delivery with a Little Mayhem Added to the Order https://t.co/jJOGGegE8D Bathroom Designs That Will Make You Want to Do Your Business Elsewhere https://t.co/HGcRu1uffv RT @UberFacts: Elevators are supported by six to eight tension cables, all of which can hold the full load of the elevator on their own. Hilarious Memes for Catholics That (Hopefully) Won’t Leave You Feeling Guilty https://t.co/hfjdtudCS1 Eddie Murphy 'cringes' at old 'ignorant' stand-up material https://t.co/4xPkeWTWtz This puppy trusts her rescuers so much\n\n🙏❤️ https://t.co/NfcJPPh1yV RT @UberFacts: Although the words are often used interchangeably, \"icing\" and \"frosting\" aren't the same.\n\nFrosting is a thick, fluffy, but… This Guy Found a Way to Troll People Who Asked Him for Free Stuff https://t.co/IQ3SYyBtAy A Family of Four Accidentally Booked Tickets on a ‘Pride Flight’ and Had a Total Blast https://t.co/mwBCYwg1Gx These 15 Surprising Jobs Pay Much Better Than You Probably Think https://t.co/r0LZcc24IV People Whose Parents Didn’t Think Before Naming Them https://t.co/ETxa7CDvO5 RT @UberFacts: Over 24 hours, the average human sheds nearly a million skin cells. This puppy knows the secret of life\n\n💖 https://t.co/qnRhcrHN6j 35 Products So Satisfying, You’ll Want To Try Them Immediately https://t.co/pT4jUjT0Zj People Share the Weirdest Dates They’ve Ever Been on https://t.co/zBvXuLS107 People Who Said No Marriage Proposals Describe What Happened https://t.co/2IhCzmwTD2 Limited Run Fast-Food Menu Items That You’ll Wish Were Permanent https://t.co/WJlzXmhB3w September 29th is National Coffee Day! 19 People Who Should Probably Just Give up on Today https://t.co/uo8hAFgdHi Epic Bad Date Stories so Bad You’ll Want to Grab a Drink Before Reading Them https://t.co/gEpGJe8qLT Although the words are often used interchangeably, \"icing\" and \"frosting\" aren't the same.\n\nFrosting is a thick, fluffy, buttery mixture. Icing is a thin, glossy, sugary mixture. Hummingbirds are only found in the Americas today.\n\nHowever, the oldest hummingbird fossil ever collected was found in Germany. Behind The Scenes Secrets From “MythBusters” https://t.co/QuXHvJp4CG RT @UberFacts: Stewart and Lynda Resnick, the billionaire owners of Fiji Water, have pledged to donate $750 million to fund climate change… Woman Asks Reddit If Men Always Sit Down While Peeing and the Responses Were Hilarious https://t.co/9DKrkDEKCA RT @UberFacts: In 1969, when most public swimming pools were still segregated, Mr. Rogers invited a black police officer on his show to coo… RT @UberFacts: There's a leopard in this picture.\n\nCan you find it? https://t.co/CTKoyOJ7Ws Airline Introduces Booking System That Shows Where Babies Are Seated https://t.co/Hl5akIOhNu Farting can help reduce your blood pressure, according to scientists at Johns Hopkins University. Over 24 hours, the average human sheds nearly a million skin cells. RT @UberFacts: In 1985, there was a condom delivery service at Harvard University - Their slogan was “We’ll come before you do.” Octopuses have three hearts. Times Men Perfectly Summed Up Parenting In a Tweet https://t.co/AUdKqtNlZC These Dating Tweets Are so Relatable We Can Hardly Deal with It https://t.co/Cu9tODQrpL 10 Memes You'll Enjoy If You’re from a Small Town https://t.co/e9WJsGTBKY A Guy with a Saxophone Serenaded Cows by the Roadside and It Is Adorable https://t.co/BssYbrbI8X RT @UberFacts: There are now 805 cases of the mysterious 'vaping lung' disease and at least a dozen deaths.\n\nThe CDC has seen a 52 percent… 30 Former Celebrities Who Went on to Live Normal Lives out of the Spotlight https://t.co/jfSYWT3wP6 911 Operators Remember the Calls They’ll Never Forget https://t.co/cyuxY7g5on If an Interstate Route has an odd number, it runs north and south; even numbers run east and west. Each State Described by a Single Sarcastic Line from a Bitter Resident https://t.co/VK0gZmu9Y2 Embarrassed People Reveal Very Awkward Moments They Had with Strangers https://t.co/nJlcr7GPQE RT @UberFacts: Teens are much less likely to listen to cooperate with a mother's request if she uses a controlling tone of voice, according… This cat absolutely LOVES the dog next door\n\n😻❤️ https://t.co/CAlCDr3MJf This dog's parents set up a hidden camera when they went to work...\n\nThen got the sweetest surprise ❤️ https://t.co/roTokq5c07 This Woman’s Brilliant and Hilarious Twitter Thread About Buffets Should Be Required Reading https://t.co/xn1MWKh39Z \"Brain training\" apps like Luminosity, Elevate and Peak do not improve neural activity or decision making.\n\nYou just become better at playing their own games, according to a 2017 study from scientists at the University of Pennsylvania. What Does It Really Mean When Your Cat Purrs? https://t.co/SXrEn4ea4l The Frightening ‘Eraser Challenge’ Is a New Kids’ Trend With Terrifying Consequences https://t.co/k5MjkMbA0L Caffeinated bees become busier, but not more productive. What's New On Netflix, Hulu, Amazon, And HBO This Weekend https://t.co/24F2MGsLFg All Women Have the Same Freckle on Their Wrist. Take a Look, We’ll Wait. https://t.co/iIK62OB8PB RT @UberFacts: Scientists believe redheads are more sensitive to pain because of a mutation in a gene that affects their hair color.\n\nThey… 19 Terrifying Photos That Will Send Chills up Your Spine https://t.co/Swq6dQgbcT In 2015, Sweden began using an underwater neon sign of a gay sailor to deter Russian submarines from entering their territory.\n\nThe sign reads \"This way if you are gay.\" https://t.co/1HjusTqhEB These Are The Gross Secret Habits of Every Girl You Know https://t.co/GBF7YUdlc2 10 People Share the Ridiculous Reasons Employers Didn't Give Them a Job https://t.co/PwS1AKNO5E OK' Hand Sign Is Now Officially a Hate Symbol https://t.co/Qj7BlGpbGn NASA is giving you a chance to put your name on Mars, but you only have two days left to sign up.\n\nThe deadline is Sept. 30, 2019, 11:59 p.m. ET and you can sign up at https://t.co/AGAluOoy9F https://t.co/z91TX3IXEi You'll Find These True Crime Tweets Hilarious, but Your Friends Will Think You're Disturbed https://t.co/q7ZtzG2CyC RT @UberFacts: The megalosaurus, the first dinosaur ever discovered, was originally named the \"Scrotum Humanum.\" 24-Year-Old Man Marries His 81-Year-Old Cousin after Developing 'Strong Affection' https://t.co/BpbHsgaceQ Elevators are supported by six to eight tension cables, all of which can hold the full load of the elevator on their own. These People All Texted the Wrong Numbers and Got the Best Answers Ever https://t.co/V43OJmTxZO I don't care how tired you are. ALWAYS take off your makeup before going to sleep! https://t.co/3uf3P1vWW1 This dwarf pittie pup is simply PERFECT\n\n💞 https://t.co/GGGg0PnwZ5 These 30 Kids Are Really Bad at Hide-And-Seek https://t.co/n6GagQJN0A 37 Problems All Face — And The Inventions That’ll Solve Them https://t.co/oDlnebHByW 8 Facts About “Blazing Saddles” That Will Make You Say Yee-Haw! https://t.co/WtMUbbDkdp 20 Tweets for People Who Are over Summer and Ready for Fall https://t.co/7KsJYkxvmh Lindsey Graham loudly blabs about whistleblower controversy on commercial flight https://t.co/5ZJDwfxy1Y There's a leopard in this picture.\n\nCan you find it? https://t.co/CTKoyOJ7Ws Last Thursday, when a Georgia college student couldn't find a babysitter, professor Ramata Sissoko Cissé gave a 3-hour anatomy lecture with the student's child strapped to her back, so the student could take notes. https://t.co/gXlQjUu75N In 1969, when most public swimming pools were still segregated, Mr. Rogers invited a black police officer on his show to cool their feet together in a plastic swimming pool; breaking a major color barrier on national television. https://t.co/TZefMJXtj2 Human Ken Doll Had 4 of His Ribs Surgically Removed so He Could Fit Into Blazers Better https://t.co/y4U7Cdd8Vw People Share the Real Reasons Why Their Engagements Have Lasted Forever https://t.co/H203ioZcy3 Only Ladies with Big Boobs Will Understand These Struggles https://t.co/658aqzZXbO Stewart and Lynda Resnick, the billionaire owners of Fiji Water, have pledged to donate $750 million to fund climate change and environmental sustainability research. 30 of the Cutest Couple Tattoos We’ve Ever Seen https://t.co/DwChfrkFUg Here Are the Best Bookstores in All 50 States https://t.co/xCRMXUIaB2 10 Great Dog Breeds That Might Be Perfect for Your Family https://t.co/gb5EXaC4Gt 20 Cringe-Worthy Fails That Make the Rest of Us Look Like Real Winners https://t.co/HZ2Jw63PaE A Woman Claimed Poor People Have No Class. People on Twitter Politely Showed Her Who Really Has No Class. https://t.co/x7rDRcAyX7 RT @UberFacts: Too much exercise can lead to bad decision making, according to a study published in the journal Current Biology. September 28th is National Drink Beer Day! Creative Two Person Halloween Costumes For Twice The Fun https://t.co/Qj93hyLMQb Women Are ALL About This Viral Post Calling Out H&amp;M’s Absurd Clothing Sizes https://t.co/mN36PiWrCI Brad Pitt Turned up to Jennifer Aniston’s 50th Birthday Party https://t.co/SeWh4OifgM Jennifer Lopez and Shakira Are The 2020 Super Bowl Halftime Performers https://t.co/H2SAUjLEgP 37 Brilliant Gadgets on Amazon Under $30 I’d Never Seen Before https://t.co/QDCLo4Gk1Y Harvey Weinstein Threatened to Kill Salma Hayek and Forced Her to Do a Nude Sex Scene During the Making of ‘Frida’ https://t.co/EhT8AljdYu RT @UberFacts: Spider-Man is officially back in the MCU as Sony and Marvel have made a deal.\n\nA third film will debut in 2021. \"Scooby Doo\" once parodied \"The Blair Witch Project.\"\n\nIt only aired once on Cartoon Network.\nhttps://t.co/YTpcpgWD7R Photos That Show the Before and After Effects of Photoshop On Hollywood’s Biggest Stars https://t.co/w1xjbAlhmD Too much exercise can lead to bad decision making, according to a study published in the journal Current Biology. RT @UberFacts: The actor who was inside R2-D2 in the original Star Wars movie hated the guy who played C-3PO, calling him \"the rudest man I… Teens are much less likely to listen to cooperate with a mother's request if she uses a controlling tone of voice, according to a study conducted at Cardiff University in Wales. 15 People Reveal What They Were Totally Unprepared for When They Moved out of Their Parents’ House https://t.co/Lhiq8ZJjW8 If You See This In a Public Bathroom or Hotel, LEAVE Immediately and Call 911 https://t.co/t3rVy4km9X Portable Wine Pouches Are Exactly What You're Gonna Need This Summer https://t.co/wYEBaMKykA Instagram Users Mixed ‘Game of Thrones’ with Adorable Dogs to Make ‘Game of Bones’ https://t.co/XfpdoXouhO Mind-Blowing Realizations People Had as Adults https://t.co/jQkawqtO0E People Reveal the Very Illegal Things That Happened at Their High Schools https://t.co/KTxcaSZvt9 This Is Why Your Dog Eats Grass https://t.co/w36V1KlzhK People Are Really Confused By This Front Thong https://t.co/zcAoLAAEy8 All 20-Somethings Need These Kinds of Friends in Their Lives https://t.co/blEMTVJ04W Keanu Reeves Doesn’t Touch People When Taking Photos with Them and We like Him Even More Now https://t.co/PqCxQfG59s Twitter Roasts Gwyneth Paltrow's Emmy Walk: \"The Best Performance of the Night\" https://t.co/XOdeyT97Ih An Anti-Vaxxer Dad Asked for Advice on Building an “Outside Bedroom” for 2-Year-Old and Got Roasted https://t.co/QHTBnzM6Bp Tired of Baby Pics? There's a ‘Baby Blocker’ Plug-In to Block All the Baby Photos on Your Social Media Feeds. https://t.co/uQfea0ib35 37 Kitchen Inventions That Can Only Be Described as Genius https://t.co/KrB0ToNYba 15 People Who Survived Murder Attempts Share Their Stories https://t.co/77HLU7oeQ9 I Rewatched ‘Coyote Ugly’ as an Adult and Here Are the Realizations I Had https://t.co/972ipQ2ZsC 15 Zookeepers Share the Weirdest Things They’ve Seen Animals Do https://t.co/StL9mRhnlg You Can Now Book a Trip on an Adults Only Cruise Ship and It Looks Incredible https://t.co/CU4LAf07hi Private Investigators Share Stories of Finding out Way More Than People Expected https://t.co/ZtSRqT6pyJ Stepparents Explain Why They Don't like Being the “Other” Parent https://t.co/8Dp8Vgiq2E We’re Obsessed With the Man Who Photoshopped Himself Into 25 Movie Posters https://t.co/egGxfgy5Nj Research Shows That Sleeping in a Cold Room Is Better for Your Health https://t.co/juzp2Da4S8 Here Are Expert Tips for Traveling Alone as a Woman from a Travel Blogger https://t.co/xzEEnwTjHR I would be so tempted to spend it 😂 https://t.co/WkYqVvKKLC A Guy Tweeted His Story of Accidentally Smuggling Drugs and It Should Seriously Be a Movie https://t.co/MgxlT7yy5n This grumpy-faced rescue cat attacked her new mother at first... but just look at her now\n\n😻❤️😻 https://t.co/DiYXwSIdmv Clever Tattoos That Aren’t What They Seem at First Glance https://t.co/gRhX13UPDe Cat finds a stray kitten and adopts her\n\n❤️ https://t.co/jRWbrfVCiU RT @UberFacts: Dogs really do look like their owners, according to researchers at the University of California, San Diego.\n\nRather than pet… Beyoncé deems Blue Ivy a 'cultural icon' in trademark battle https://t.co/Hn6lP2DTXl RT @UberFacts: It takes less than a second for your brain to decide if a potential partner is attractive or not. RT @UberFacts: Spending time with happy, positive people will make you happier and improve your well-being, according to a study from Harva… 15 People Looking Ridiculously Photogenic In Uncomfortable Situations https://t.co/Bme6sWsTCx RT @UberFacts: We spend between 30% and 47% of our waking hours simply daydreaming. RT @UberFacts: A 2014 study found that men were only able to listen to their partners for 6 minutes before tuning them out. 19 Truly Amazing Before and After Photos https://t.co/4L7WiIarvP RT @UberFacts: Jennifer Lopez and Shakira will perform at the Super Bowl Pepsi Half Time show in 2020. 20 Pictures That Will Straight Up Make You Feel Bad for Laughing https://t.co/oXWN28YApB RT @UberFacts: The oxytocin released when you cuddle with a loved one can relieve pain, boost your immune system and reduce social anxiety. RT @UberFacts: Just four nights of inadequate sleep can cause you to gain weight, according to researchers from Pennsylvania State Universi… Impromptu Court Speech From A Thirteen-Year-Old Brought His Foster Mom To Tears https://t.co/8VqzQf9Hq6 RT @UberFacts: Your working memory can only remember three to four things at a time. Spider-Man is officially back in the MCU as Sony and Marvel have made a deal.\n\nA third film will debut in 2021. 28 Japanese Inventions That Are Just Bizarre https://t.co/TaxblxZi9p There are now 805 cases of the mysterious 'vaping lung' disease and at least a dozen deaths.\n\nThe CDC has seen a 52 percent surge since last week. RT @UberFacts: If you speak multiple languages, thinking in your non-native language can help you make more rational decisions.\n\nThinking i… RT @UberFacts: Ever found yourself hesitating/refusing to take the last donut or slice of pizza available? If so, you've experienced a phen… September 27th is National Chocolate Milk Day. 37 Inventions That’ll Make It Seem Like You’ve Got Skills https://t.co/NkZzIkse1d RT @UberFacts: Introverts begin to feel happier when they push themselves to be more social for an extended periods of time, according to r… RT @UberFacts: Smarter people tend to be better off with fewer friends, according to research published in the British Journal of Psycholog… Explore Jackie O’s Mansion In Martha’s Vineyard That Sold For $65 Million https://t.co/gFiTERcxzf This woman just rescued a deer...TWICE.\n\n💯❤️ https://t.co/gTDnnn5d4S A 2014 study found that men were only able to listen to their partners for 6 minutes before tuning them out. 19 Red Flags That Mean a Relationship Will Not Last https://t.co/W09WsTStno"}