{"tweets": "I know, i know it's you you you! #RaisaYOU ☂️ https://t.co/ZhbIh0KGel Have you seen my latest MV, \"YOU\"?  https://t.co/wC4aN4gqC3 #RaisaYOU https://t.co/ErQRO9HAr8 RT @Dreamcoid: You, rasa baru dari @raisa6690 https://t.co/Q6VyiSNDjZ https://t.co/E4hwDuy1Ev RT @jakpost: @raisa6690 releases 'You' #jakpost #RaisaYOU https://t.co/pQsVz1nRcl RT @TraxFMJKT: Rabu lalu, @raisa6690 merilis single baru berjudul \"YOU\", dimana penulisan lirik lagunya dibantu sama @gamaliel. Lagu ini pu… RT @EMPIRE: A song for lovers 💕💕 @Raisa6690 \"You\" video out now via @JuniRecords &amp; #EMPIRE \n\nhttps://t.co/5y4XpwuxKZ #RaisaYOU https://t.co… RT @JuniRecords: Watch @raisa6690 ‘s new music video “YOU” https://t.co/d5iaxxvsg4 #RaisaYOU https://t.co/62jw3QBaOK Akhirnya hari yang ditunggu dateng jugaaa! Hari ini #RaisaYOU sudah bisa dinikmati di semua digital streaming platform🤟 semoga semuanya suka, pesan yang aku sampaikan di lagu ini sampe ke kalian!! \n\nhttps://t.co/FQLMExK1nR https://t.co/V2YFAuKN5T Throwback pas dengerin #RaisaYOU versi final!! Luv! https://t.co/JN05h7bUhp Counting down the days till the release of #RaisaYOU! https://t.co/awopqhWpf4 Happy anniversary YourRaisa!! 💞 @yourRAISA Sampai ketemu nanti di Synchronize Fest - Dynamic Stage jam 18.30 ya! I have a special announcement for you guys di set aku nanti. Jangan kelewatan yaa, see you! xx #RaisaYOU https://t.co/1MOYjLGZym Hi all! Sampe ketemu hari Sabtu ini! Make sure to come and say hi yaa :) https://t.co/geBT5u3MXu #RaisaYOU https://t.co/LoqyOoNjKR See you soon everybodyyyy! https://t.co/v763gNBKcd Every kind gesture, regardless of how big it is, will create good moments. Make it everlast with high-quality performance in #OPPOReno10xZoom!\n#OPPOReno #OPPORenoSeries @OPPOIndonesia https://t.co/ll8d13wFJP Creativity will always bring amusement that take you by surprise. Make some more of it and turn them into innovation with Pivot Rising camera and 10x Hybrid Zoom in #OPPOReno10xZoom!\n#OPPOReno #OPPORenoSeries @OPPOIndonesia https://t.co/TKjGTQQ1Wz Raisa Live in Concert, Jakarta 2020.\n\nRevealing soon! #RaisaConcert2020 https://t.co/NoUTmbNgMm Let's sing together, shall we? https://t.co/W3OYEpwAOX Hi teman-teman di Banjarmasin! Kita ketemu tanggal 23 Agustus ini yaa! ❤️ https://t.co/x3gz1BteA5 Stay safe everyone! Guys! Kita ketemu besok di Livespace, SCBD yaa. See you♥️ https://t.co/zmV7x67uKv Hi Semua, Berkaitan dengan beberapa peristiwa alam yang baru saja terjadi, LINE CONCERT Bandung yang dijadwalkan pada 3 Agustus 2019 di Eldorado Dome, Bandung terpaksa dibatalkan. \nLINE CONCERT meminta maaf yang sebesar-besarnya. Untuk informasi: https://t.co/thX1xRoOro https://t.co/1Ab1jCEg88 Hi Bandung!\nGak sabar kita ketemu di #LINECONCERTBandung nih! Bakal ada kolaborasi spesial aku bareng Rendy Pandugo. Yuk nikmati kejutan dan serunya #MusikAsikCaraLINE di mana kita juga bisa bernyanyi bersama-sama! See ya! https://t.co/iW1spuqqpv #RaisaKembali is available on all digital platforms! Stream, listen and save it to your playlist 💞 \nhttps://t.co/ZG6m8iMWBx https://t.co/6U2auKpIXe Gemes amat baca balasan kalian di tweetku sebelumnya. Ada yang jawabannya lucu-lucu, ada yang dari hati banget, ada yang absurd jugaa. Hahaha. Thank you semuanya udah sharing!! Keep 'em coming guys! @AldenBenny A really good answer! Semoga semuanya berjalan sesuai rencana yaa, and thank you for the support! @setyanimutiaa awwww! semangat Mutia! semoga happy happy terus💚 @yulianiraa *big hug* @ImamSyaifudin_ sofa gak tuu yang buat nyaman? 😝 @_pipitfitriah_ *virtual hug* @Lalafyh :') growing up won't let us down! semangat! Yang udah denger #RaisaKembali, pengen tau deh.. Untuk siapa makna lagu ini menurut kalian? Share dong! 💚 Terima kasih semua atas respons positifnya untuk #RaisaKembali! I'm forever grateful! \n\nP.s. aku baca semua comment kalian 🧐😛 https://t.co/Ou2fKxThxh @sntikaa ❤️❤️ @joanikaj wiii glad you like it! Hi, teman-teman di Bandung!  \n\nBesok kita akan berjumpa di #LINECONCERTBandung nih! Sst, bakal ada kolaborasi spesialku dengan Rendy Pandugo. Ayo kita nikmati kejutan dan serunya #MusikAsikCaraLINE di mana kita juga bisa bernyanyi bersama-sama! See ya! https://t.co/Uii1jQivPm Featured on Waktunya Spotify playlist on  @spotify @spotifyID! Thank you 💚  click the link to listen to my new single \"Kembali\" https://t.co/B5z7VU4uBU https://t.co/x70lOI3fyQ See you guys very soon! 😙  let's sing together! https://t.co/5v2D2kr3Qi It feels so good to be back on stage! Thank you everyone for watching last night ♥ #RaisaKembali https://t.co/poXSJ404Jm My latest single, \"Kembali\" is out now! Don't forget to stream it, and watch the music video! https://t.co/k2ttk5UeDT ❤️ #RaisaKembali https://t.co/4dbYHnSARR ❤️❤️ https://t.co/fvaD3TQ6yi Can't wait for tomorrow! \nSee you guys very soon on @vliveindonesia! #VLiveIndonesia https://t.co/BdJGURw5R9 H-2!\nCan't wait ❤\nAnyway, pastiin kalian udah follow profileku di VLIVE (@vliveindonesia) yaa untuk nonton Raisa Comeback LIVE. Make sure to stay tuned here: https://t.co/tN2meFkv2t\n\n#RaisaKembali \n#vliveindonesia https://t.co/8781vQe9fX Inna lillahi wa inna ilaihi raji'un, turut berduka cita atas meninggalnya Bapak Sutopo PN. Semoga beliau diterima di sisi-Nya. Aamiin Make sure to see Raisa Comeback Live exclusive on @vliveindonesia! Tanggal 10, jam 7 pm! See you! 😙 #vliveindonesia \nCheck this link to find out more https://t.co/sEurMV5JBt\n#RaisaKembali https://t.co/75jd1DPewV Can't. Hardly. Wait.\n10.07.2019\n#RaisaKembali https://t.co/g7KHZY0HBh Yeay! So excited!\n\nJangan lupa nonton aku di Raisa Comeback Live exclusive hanya di V-LIVE! \nTanggal 10 Juli 2019, jam 7pm! \n\nSee you😘\n#RaisaKembali https://t.co/CjXcaW90Ef H-7! Selalu excited setiap mau rilis sesuatu! And I really cant wait for you guys to hear it, see it, and enjoy it! 💛\n\n#RaisaKembali https://t.co/KkhyuHUnLW So glad to finally share this news with you guys! Stay tuned for more info ❤\n#RaisaKembali on 10.07.19 https://t.co/i8ino5B4eg Hi Sahabat LINE! Aku akan tampil di #LINECONCERTBandung @line_indo pada hari Sabtu, 3 Agustus 2019! Ini adalah ketiga kalinya aku hadir di #MusikAsikCaraLINE loh! Suuper gak sabar! Jangan lupa kunjungi https://t.co/QHcLD7PrkD untuk pembelian tiketnya ya! Xx https://t.co/8a1fVZRI0N @kymahar tanggal 10 Juli ya 👀 10.07.2019\n#RaisaKembali https://t.co/NIFE1c75wW #RaisaKembali https://t.co/H3Qfg3I9QM Pengen dm @poconggg tapi gak bisa. Ternyata gak di follow back. Huff It feels good to be back! After long hiatus, I'm ready for my new journey.\nWatch the full version here: https://t.co/DXeB3C7UZz\n\nAre you ready for July 10th? #RaisaKembali https://t.co/Z5jlgITmgM Tomorrow. Up on my youtube channel! \nhttps://t.co/IqQFD4oaCh https://t.co/RjjUeIPXmA Soon. 19/06/19\nhttps://t.co/lbDUT1rV63 https://t.co/0Kt2EIfVC4 Selamat Hari Raya Idulfitri teman-teman! Happy holiday! Selamat berkumpul dengan keluarga yaa ♥️ https://t.co/Ss6BQHKI74 OUT NOW!\nNyawa dan Harapan official music video on my youtube channel💕\nhttps://t.co/yk7QEczhl1\n\nHow do you like it? Drop some comments here! https://t.co/jjhj8oteyA Hi, all!\nBesok video #RaisaFermataConcert dari BukaMusik spesial #BukalapakXRaisaFermata akan rilis di YouTube channel-nya @bukalapak  How I miss being on stage with you all ♥\nCek videonya di https://t.co/EMx6WspOV3 yaa ✨ https://t.co/yMZs8sCkrC mulai dari Kyoto, sampai tmpt yg jd situs warisan dunia UNESCO: Kastil Himeji &amp; Kuil Itsukushima yg byk didatangin di bagian barat Jepang, semua punya situs khusus yg bs dicek lho! \n\n#ayokejepang #sisilainjepang #Hokkaido #JepangBarat #visitjapan #Japan \n\nhttps://t.co/UxIvqDiJSy So stoked to know that my single with @diphabarus, 'Mine' is featured on Chill Hits playlist on @SpotifyID @Spotify! Thank u ❤️ everybody, please check this link out! https://t.co/YyDToBAM4j https://t.co/xnL5eYFeoE Hokkaido tuh terkenal bgt dgn pemandangannya yg indah, trs salju sama Onsennya. Sushinya jg enak!!! skrg udah ada situs khusus yg jelasin byk soal Hokkaido lho! jgn lupa dicek ya! #ayokejepang #sisilainjepang #Hokkaido #JepangBarat #visitjapan #Japan\n\nhttps://t.co/FG2lYdZ6ls Hari ini hari terakhir berpartisipasi dalam kuis! yuk cepetan ikutan, kamu punya kesempatan buat menangin undian Liburan gratis ke Jepang lho! Jangan lupa ikutan kuisnya ya! #ayokejepang #sisilainjepang #Hokkaido #JepangBarat #visitjapan #Japan https://t.co/YOYzfPRt1y as I promised, ini playlist baru akuuu! akhirnya selesai jg, seneng bgt bisa bikin playlist lagiii! stream, follow, dan share yaaa kalau kamu suka playlist aku inii 💕 https://t.co/MgfwQWKyWT Buat kamu yang ikutan kuis ini, kamu punya kesempatan untuk menang undian liburan gratis ke Jepang lho! Asyik banget ya, jangan lupa ikutan kuisnya ya! #ayokejepang #sisilainjepang #Hokkaido #JepangBarat #visitjapan #Japan https://t.co/7SAoxH8xOi @AuliaAzzra21 yes! nanti aku share yaaa Japan Travel Fair udah mulai nih di Kota Kasablanka! Ini kesempatan kamu bgt buat bisa pergi ke Jepang. FYI, Jepang itu tempat yg aku suka bgt! #ayokejepang #sisilainjepang #Hokkaido #JepangBarat #visitjapan #Japan\nhttps://t.co/tDncXOToDf hmm, blm selesai sih.. nanti aku share di sini ahh kalau udh selesai! 💕 fyuhh, finally sempet bikin2 playlist lagi.. yuk upload foto liburan kamu di Jepang! buat kamu yg ikutan kontes ini, kamu punya kesempatan buat menangin undian liburan gratis ke Jepang lho! #ayokejepang #sisilainjepang #Hokkaido #JepangBarat #visitjapan #Japan https://t.co/eX5EgpAzcO @norisandnonov wihiii terima kasihh! seneng bacanyaa 🐰 @RadityoGrady wuhuu terima kasihh! @ad3_shella Hahaha iyaa emang masih sekolah bener kok! @citraputria how time flies yaa! @bobbyardianto_ @SpotifyID Terima kasihh! 🥰 How time flies!\nGak nyangka, 9 tahun yang lalu \"Serba Salah\" versi pertama dibuat!\nHahaha, siapa yang masih dengerin 'Serba Salah' sampai sekarang?\n\nGive it a listen here: https://t.co/zejYCSc9jH https://t.co/qboKDRuJjw Mulai besok, Japan Travel Fair akan diadain di Mall Kota Kasablanka! kamu bs beli tiket perjalanan dan tiket wisata ke Jepang di sana! Jadi, jgn lupa datang ya! #ayokejepang #sisilainjepang #Hokkaido #JepangBarat #visitjapan #Japan\nhttps://t.co/tDncXOToDf it's good to be back. well, hello @Twitter ! this! #TolakRUUPermusikan https://t.co/CYISJ7uHVV so happy to see all positive feedback for my latest video, https://t.co/VwKBhHbnHo ! semoga semuanya suka!! all love from me ☺️💛 Bismillah, here I come 2019! https://t.co/VwKBhHbnHo https://t.co/xLID44eMps 2018 has been a blessed and amazing year. Thank you for giving me the opportunity to do what i love. 2019, lets do it! Happy new year! 🎉 https://t.co/okdtD6wa0l Turut berduka cita atas musibah yang terjadi di Selat Sunda. Semoga semua selalu dalam lindungan-Nya. Aamiin. #PrayforBanten #PrayForLampung Huge thanks to everyone who's been streaming Mine (Day) and Mine (Night) by me &amp; @diphabarus so far! The response has been overwhelming! Terima kaciii 💛 go stream it now on @Spotify : https://t.co/gyTOsBQxsx https://t.co/Gm1AnchImd aku pgn bgt deh balik lg ke Sapporo, pgn ke snow festival! Soalnya kemarin pas ke sana, belum ke snow festivalnya. lihat deh fotonya, keren banget nggak sih snow festival di Sapporo? acaranya di tanggal 31 Jan 2019 - 11 Feb 2019! siap-siap yuk! #JNTOID https://t.co/LPqzmWreqh Liburan ke Jepang, tp ke Kobe seru jg kali ya. Kotanya mix, tradisional &amp; modern ala Jepang soalnya. Katanya sih wajib bgt ke Himeji Castle, soalnya masuk UNESCO World Heritage, pasti bgs. Terbaiknya katanya kalo ke sini di akhir Maret/April. Yuk, tahun depan ke sana! #JNTOID https://t.co/O69Yud2eAb Can't stop to be grateful to have a loyal supporters like you all!! Terima kasih semuanya! So happy to be part of Top Female Artists of 2018 Indonesia playlist! 💕 https://t.co/9ykwZeQxo1 An amazing year indeed! Thank you, semuanya. 💛  @spotifyID https://t.co/pwXkxK0Uyi Ngomongin kota yang indah di Jepang, salah satu yang paling indah itu Kyoto. Nggak cuma kaya unsur tradisionalnya, Kyoto juga keren banget pas lagi musim semi dan musim gugur. Sakuranya itu lho! Di Kyoto juga kita bakal dimanjain banget sama keramahan orang lokalnya! #JNTOID https://t.co/a3NCcdFAJw yeaaayy! glad that My Kind of Crazy become part of @AppleMusic's global best of 2018 playlist! we did it, @diphabarus ! thank you so much everyone! super happy! 🥰\n\nhttps://t.co/zfYKHwt8c1 Setelah kemarin ke Tokyo, aku pgn bgt ke Osaka di area Kansai nih! Di kota terbesar kedua di Jepang setelah Tokyo ini, banyak experience seru yang bisa di dapat! Aku sih udah kebayang ke Dotonbori di Osaka, soalnya banyak makanan enaknya! Hahaha! Yuk bikin plan ke Kansai! #JNTOID https://t.co/56x5ysGJ4S yeaayyy! so happy to be in this playlist! thank you @Spotify ! stream my new songs with @diphabarus on @Spotify , and save it to your playlist! I'm sure it will worth it!\n\nMINE Day : https://t.co/gOAMwlpQbZ     \nMINE Night : https://t.co/f1OKULjxxU https://t.co/vFvjTtCjSJ Jadi, kamu #TeamDay atau #TeamNight?\n\nTonton official MV \"Mine (Day &amp; Night)\" disini yaa: https://t.co/8tv6yiwSNH 💛 https://t.co/TXW6S7ZYOX wow! super happy to know that my song is included in this playlist! thank you @SpotifyJP ! don't forget to stream here:\n\nMINE Day : https://t.co/gOAMwlpQbZ    \nMINE Night : https://t.co/f1OKULjxxU https://t.co/OJ97z83gfQ senang deh lihat komentar2 di video klip Mine! thank you yaa untuk apresiasinya 🥰 have you listen to my new records with @diphabarus ? Listen now on @SpotifyID , save it to your playlist and make it your daily tunes!\n\nMINE Day : https://t.co/gOAMwlpQbZ  \nMINE Day : https://t.co/f1OKULjxxU \n\nJadi, kamu #TeamDay atau #TeamNight ? https://t.co/iVywTPMmVe not gonna leave you without the official MV for my latest release with @diphabarus ! watch the MV for Mine (Day) and Mine (Night), click here: https://t.co/8tv6yiwSNH ! 💕 https://t.co/KRHprQrmbp it's finally out! Mine (Day) &amp; Mine (Night) by me and @diphabarus are here for you to listen! Stream and save it to your playlist, here:\n\nMine (Day): https://t.co/celFBuo1J2\nMine (Night): https://t.co/REVzBWLAqM\n\nwhich team are you? #TeamDay or #TeamNight ? https://t.co/Tq5nSy1FKS 12.00 o'clock tonight!! Get ready for this new drop for you all! ❤️ @diphabarus @JuniRecords https://t.co/YdAx4PNn8P ... and i'll see you tonight!! ❤️ https://t.co/NZm83TTfVD It's getting closer!💖 https://t.co/AGcIE2WZ6j So ready to meet you guys at #RaisaFermata concert! ❤️ so, who's coming?? https://t.co/VJqqD6U9zj It's happening near! https://t.co/ygBVpIK9Am Another surprise for you!✨ https://t.co/m2dt2ha8Kc Something big is coming✨ https://t.co/NuH9w6PvVn Woohoo 1 million views in a month! Thank you for the warm response for my latest single with @diphabarus, My Kind of Crazy! https://t.co/B5z2pATn35 Have you seen my latest MV with @diphabarus? Go check it out if you haven't already!\n\nhttps://t.co/B5z2pATn35 https://t.co/Dc5DtrlD8W strolling around Sapporo city at night &amp; aku nemuin White Illumination di sini. warna warni lampunya keren banget! Kotanya jadi terang dan bagus banget, instagramable! White Illumination ini adanya mulai dari sekitar 22 November sampai 14 Maret 2019 lho, ingat ingat yah! #JNTOID https://t.co/tMeDJK9cCE experiencing Japanese tea ceremony while staying at #hoshinoyatokyo .. #hoshinoresort https://t.co/euWTTTx9U5 The response has been insane! Thank you for all supports &amp; nice thoughts for our latest single, My Kind of Crazy. 💛 Have a listen here: https://t.co/B5z2pATn35 cc: @diphabarus https://t.co/7FQ0WXWN8S Siapa yang masih belum kebagian tiket #RaisaFermataConcert? Got some good news for ya! Masih ada sebagian tiketnya di @bukalapak niih, click the link to book your seat! https://t.co/hwkVryvRny https://t.co/3mqyv5rUgz Always had fun in studio with @diphabarus! Our latest single, My Kind of Crazy is now up on @deezer @deezerasia! Click the link to stream 💕 https://t.co/dJFC2fsSHA https://t.co/Of9VWrLXzh have you listen to my latest release with @diphabarus ? jangan lupa di stream, dan save lagu ini ke playlist @SpotifyID kamu ya! 💕💕 https://t.co/o4pRfjq6Mz one of the best memories i had when i was in japan, sushi! pas di otaru ini aku sempet makan di Fukuzushi, dan sushinya fresh banget! enaaakkk bangetttt! https://t.co/f48vUTTImq Kita ketemu dan nyanyi bareng yaa! Mark the date and i'll see ya there 💛 https://t.co/7euc3q5Fey Listen to my new single with @diphabarus \"My Kind of Crazy\", on Deezer now! \n\nClick the link here: https://t.co/Z6SF8Axqkh ❤️ https://t.co/cjRz05wfwV dingin, tapi seneng banget! saljunya banyak dan halus banget! powder snow yang cuma bisa dirasain di Hokkaido. the must visit for your holiday! 😍 https://t.co/kb68jEXsF9 Deepest condolences for all victims of Lion Air #JT610. Sending prayers and love to their families. https://t.co/ckEqSbJfWz Another good news, #RaisaFermataConcert batch 2 ticket sales sold out! \nSeneng banget liat response temen-temen semuaa! Yang belum kebagian jangan sedihhh, besok masih ada batch 3 yaaa! ✨ https://t.co/vspFheAKhc My latest single with @diphabarus, \"My Kind of Crazy\" is out now on Apple Music! https://t.co/t60F6OfWtf https://t.co/QjdSL48ZgX RT @JuniRecords: “Kis In The Morning” bareng @raisa6690 &amp; @diphabarus pagi ini jam 7-11 bakal ngebahas single terbaru mereka #MyKindOfCrazy… Guys!! So overwhelmed with the positive feedback for #RaisaFermataConcert! Thank youuuu💚💚💚💚 but no worries, the ticket will be available tomorrow! Stay tuned on https://t.co/JUAKDnm8Jn yaa https://t.co/Wctoyr8IKZ Besok tiketnya sudah tersedia di https://t.co/JUAKDnDJAV! Siap-siap, pantengin yaa jam 10 pagi! 💛 #RaisaFermataConcert https://t.co/viQO3TjCxx Mark the date, Raisa Fermata Intimate Concert 2018.\n21 November 2018 💕 https://t.co/UDkHT2YqhN The official music video of \"My Kind of Crazy\" is out now on my YouTube channel, go check it out now!  Go go! https://t.co/B5z2pATn35 https://t.co/j2JezBI5Ef Finally! Out now on all digital platforms, my new single \"My Kind of Crazy\" with @diphabarus✨ @JuniRecords @ponyourtone #nadaramarecording https://t.co/EWayxh9f0A It's happening! Available on digital merchants tonight✨\n@diphabarus @JuniRecords @PonYourTone #nadaramarecording https://t.co/C88kYrnSgY #MKOC in 2 days!\n@diphabarus @JuniRecords @PonYourTone #nadaramarecording https://t.co/9vH8Hq7YmS Coming soon! @JuniRecords @diphabarus https://t.co/Zykagt84hA Aku akan tampil di #LINEConcertYogyakarta Sabtu ini! Dapatkan tiketnya di https://t.co/6q5DYb1HNm biar kita bisa sama-sama menikmati #MusikAsikCaraLINE! See youuu 💕 https://t.co/tHvZRUluCb Bogor! Sampe ketemu malam ini yaa❤️ https://t.co/GSMJHItIu4 Guys! Jangan lupa dateng ya tanggal 12-14 Oktober ini ke Kota Kasablanka. I'll see you all soon 😘 https://t.co/V1QTIvmSW4 My new video is out! All about my last trip to Tokyo, Japan. Can't wait to go back! https://t.co/9DfOtJC6wS 😍 Waktu aku ke Jepang, aku nemuin banyak bgt pengalaman yang luar biasa. Mau tahu apa aja? Datang ya ke kota kasablanka hari minggu tgl 14 Oktober 2018 jam 4 sore. Aku bakal ceritain semuanya! kalo pengen tahu lebih soal Jepang, dtg aja ke Kota Kasablanka dari tanggal 12-14 Oktober https://t.co/JvjFxQaJZ6 selamat ulangtahun pak @Sutopo_PN ! semoga selalu diberikan kekuatan, tetap semangat dan terus menginspirasi ya pak :) Hi, teman-teman di Yogyakarta!  \n\nSampai jumpa di #LINEConcertYogyakarta ya! Ayo kita nikmati serunya #MusikAsikCaraLINE di mana kita juga bisa bernyanyi bersama-sama! See ya! https://t.co/u6ZXfXb0Gd Hari ini twitterku ramai dengan #RaisaMeetSutopo, dan ngebaca semua cerita di tweet temen2, bikin aku rasanya udh kenal deket sama Pak Sutopo yang disayang banyak orang. Semangat dan terus menginspirasi ya Pak @Sutopo_PN :) RT @Sutopo_PN: Meski kanker paru stadium 4B, saya tetap berusaha melayani media dan masyarakat dengan baik. Untuk rekan penyintas kanker. J… Nyanyi bareng-bareng yuk bulan ini! https://t.co/AAAzXsVUcv Hahahah ini lucu https://t.co/O5Z1PPMXVP Hai @yourRAISA_PLU, semoga semuanya aman ya.. Sehat selalu kalian semua. #PrayforDonggala #PrayforSulteng. Be safe ya semuaaa 🖤 Thank you everyone for making it happen!! ❤️ https://t.co/QGeE5qUp7J Hi Melbourne! I can't wait to see you this Saturday!! Come and join the fun! https://t.co/jFhBOdzda3 Thank you @OPPOIndonesia for the package! 💕 https://t.co/pY5YjcPsVt Wiii finally!! Congrats maskun @KuntoAjiW https://t.co/pptruUXzoM Halo, Sahabat LINE! Aku akan tampil di #LINEConcertYogyakarta pada hari Sabtu, 20 Oktober 2018! Ini Kali Kedua aku hadir di #MusikAsikCaraLINE setelah sebelumnya kita bersenang2 di Medan! Gak sabar! Jangan lupa kunjungi https://t.co/6q5DYb1HNm untuk pembelian tiket. https://t.co/32rhAWyJv5 Ketemu ya bulan ini! Nyanyi bareeng ❤️ https://t.co/fWoApm5up0 Thank you AMI Awards for the nomination!! Beyond excited! ❤️ https://t.co/2L2eenE6Ta RT @JuniRecords: Debut single @_monicakarina “Skin To Skin” feat @diphabarus sudah tersedia di semua digital platform dan bisa di request d… Yesss Indonesia! Selalu seneng baca respon positif tentang #LaguUntukmu. Lagu ini aku dedikasikan untuk para Ibu, you are one of a kind! Dengerin yuk di semua digital platform kesayangan kalian, stream, download and save it to your playlist! click this link: https://t.co/cKy3uNT0IT https://t.co/fPZFjUaasN So excited to be APM Nominee this year!! Vote me via https://t.co/XG6YsDwELn as Social Media Icon, Best Artiste (Female), and APM Most Popular Artiste! Vote yang banyak yahh 💚 https://t.co/d2BitPAshJ udah jadi! follow playlist aku di @SpotifyID ya! click and follow here: https://t.co/arHYPr4b9n  aku bakalan update lagu-lagunya tiap minggu. don't miss it, make sure you follow this playlist! 💕 https://t.co/ktz2iXwT8G bikin2 playlist seru jg yaaa, tp pusing jg milihin lagunya 🙄 @ImamSyaifudin_ udaaah, kamu juga jangan lupa ya. Congrats maskun untuk rilisan demonya!! @KuntoAjiW can't wait for the full version! 😌 https://t.co/M1NhdXkN9V RT @KuntoAjiW: Bermodal keisengan, saya baru saja merilis 5 track demo lagu dengan judul yang masih dirahasiakan di semua digital store dan… RT @abdelachrian: Saya &amp; @JRX_SID dari @SID_Official \nmengajak teman-teman untuk ikut menyalurkan bantuan lewat @kitabisacom untuk saudara-… Stay safe, teman-teman di NTB. #PrayForLombok #LaguUntukmu 💚 https://t.co/XGzHJoRpxr Kangen manggung! Kangen nyanyi bareng kalian! Yuk, kita nyanyi bareng bulan ini ya? Catet tanggalnya 🧡 https://t.co/82OauHmLVA Solo!! Ketemu Jumat ini yaa 💚 make sure to come this Friday! https://t.co/YY6KchT1he Available on Joox! My 3 new releases! What's your favorite? Check the link to listen to them now! https://t.co/6nOfAVaRiW https://t.co/uDVTCSWSwS A grateful heart is a beginning of greatness. 💚 Listen to the new versions of Biarkanlah, Usai Di Sini and Tentang Cinta! 💕 available now on Spotify! don't forget to follow my page too! https://t.co/bnnZK02BxI https://t.co/7qeGmfOHaS Buat aku, semua yang ada dalam kehidupan itu adalah Tentang Cinta. I wrote this song just for you!! See the live session here: https://t.co/ZEbPeiV8fd and don't forget to stream now on Joox 💚 https://t.co/LjjeamdDCJ https://t.co/TxBsuEFaeK Penyemangatmu di sore hari: https://t.co/GluntsnQYU 💙 https://t.co/q7GF4soTYS Lagu ini aku buat untuk kamu yang sedang merasakan jatuh cinta! Siapa yang disini lagi jatuh cinta? 🥰 https://t.co/X9LklLAoae https://t.co/AajRF5mkZz Newwwwwww!! Usai Di Sini versi akustik. I hope you like it 💙https://t.co/jc6xNUaetu https://t.co/VD87cBNMHD Paling excited bawain Love You Longer versi akustik! Udah liat live sessionnya belum? https://t.co/0OXKlrMHGk Yaaas finally my live session video is available on youtube! :) favorit kalian video yang mana? https://t.co/5uNLCKaGAA https://t.co/zRImEWJwX6 New version of Biarkanlah is available on Deezer! Stream, save it to your playlist, and follow my page! https://t.co/BCA9oazAdp https://t.co/d3GaOkuWs2 Tungguin sore ini di youtube channelku! 💙 https://t.co/Tk1rpBTRhv Congrats sis!! @ramengvrl https://t.co/jrf4QIiG5a Seneng banget liat reaksi positif temen-temen semua buat video Biarkanlah - Live Sessions! Tungguin yaa, video berikutnyaa!  ❤️  For those of you who haven't seen the video, go watch it: https://t.co/v8dj5mHn8Y Pagi gini paling enak denger lagu yang upbeat buat boost mood seharian! Listen to the new version of my song, Tentang Cinta (Acoustic version) https://t.co/A9a0eO5nQN listen now on apple music! https://t.co/dQIYc4c4YB Now on my youtube channel: https://t.co/dY3LrqvlbW ☺️ https://t.co/JoOHEv7GyQ Available now on all digital platforms, hope you like it! 🧡 https://t.co/apQyps0Da6 Counting down the hours till tomorrow! So excited. Yay! 🧡 https://t.co/ms8nfpXvKm Setelah kemarin aku rilis Kali Kedua, dan Love You Longer versi akustik, sekarang giliran Biarkanlah, Tentang Cinta dan Usai Di Sini! Tungguin yaa, Jumat ini! 🧡 Yup! Will be uploaded this Friday! Who's readyyy? https://t.co/7zU6ALHuxx Coming up in few days! Biarkanlah (Live Sessions) akan tayang segera di Youtube channelku, https://t.co/IqQFD4oaCh. Tungguin yaa! 🧡 https://t.co/c7RL2msSci Yeay! Back to my favorite thing to do: nyanyi bareng kalian! Dateng yaa💙 https://t.co/E9F8pmYvZw Video jalan-jalan aku ke jepang udh di upload, yeaayyy! super fun deh tripnya. lihat aja di video ini: https://t.co/PTj4tNbtAa kebayang, jadi pengen ke sana lagi. nggak bosen-bosen! Laid back and relaxed songs I chose for your productivity today: https://t.co/Te5euR896m! Enaknya leyeh-leyeh.... 😋☺️ Yeayyy sekarang udah bisa! Aktifin RBT #LaguUntukmu yuk! Caranya supeeer gampang, tinggal aktifin kodenya di sini yaa https://t.co/JAcV32i5iO still in that Idul Fitri holiday mood, still feel the joy, happiness and forgiveness vibes. ada yg udh dengerin playlist aku yg ini? https://t.co/TcFrYikkDu https://t.co/dKBQcHYIIr Ini ceritaku tentang #PulangUntukmu yang menjadi inspirasi #LaguUntukmu. Kamu punya cerita juga nggak?\n\nListen to my new single, Lagu Untukmu, here on Spotify: https://t.co/6zyOYWGZ9X https://t.co/7kLjtm3dCm Happy Eid Mubarak, everyone! Minal aidin walfaidzin, mohon maaf lahir &amp; batin 🙏🏻 https://t.co/G3vh1LnJzk @rinaseptiani456 aku emang udah 28 tahun. gimana dong.. Untuk menemani hari mu, dengerin #LaguUntukmu di JOOX yaa !! 🧡  https://t.co/gFPQjt3O2U https://t.co/LWbzMujGYp This might be the song for you today. Ada yang sudah berangkat mudik bertemu orangtua? #LaguUntukmu bisa di stream disini..  https://t.co/U0Edhc0NvK https://t.co/JQHKPtE7eE Terima kasih untuk semuaaa ucapan, dan doanyaa! I'm officially 28 years young! 🤣 @AprilianiPL this made my day! thank youuuuu 🧡 Available now!! #LaguUntukmu Music Video https://t.co/4XLkGaYhWy https://t.co/BlY42yLwkP In few hours!!! Who's ready? #LaguUntukmu https://t.co/r6koOf1Heq Lagu yang tidak direncanakan, datangnya tiba-tiba. Lagu yang saat take kemarin, sampai ga bisa menahan air mata. #LaguUntukmu now on Joox! https://t.co/gFPQjt3O2U https://t.co/neTzJpDnx0 Lagu yang aku tulis &amp; persembahkan untuk Ibuku yang tercinta ❤️ #LaguUntukmu play now on @Deezer https://t.co/lbuCmK9aUn https://t.co/fafye9CvjC #LaguUntukmu is available on Apple Music! Go download, listen and follow my page on Apple Music too. 🧡 click the link to find out more! https://t.co/5318oH1DHK https://t.co/cgBOfNThCc Sebuah #LaguUntukmu, untuk yang sedang rindu. Stream now via @SpotifyID here https://t.co/U0Edhc0NvK https://t.co/lRkIbtfLIS And today is the day! #LaguUntukmu sudah tersedia di seluruh digital merchant. Siapa yang sudah denger #LaguUntukmu? Don't forget to listen, download, and follow my page! ☺️ https://t.co/Vteu3v6GvW A reminder to everyone - do you miss your mom? Thanks to my good friend, Josh Kunze for sharing! #LaguUntukmu besok ya! 💙 https://t.co/S5Ex96Tmef Besok!! #LaguUntukmu 💙 https://t.co/eM8EmOz7on 2 more sleeps. #LaguUntukmu 🧡 https://t.co/T7Nd6KHxdt It's so heartwarming to see anyone shares their love to their mother! 🧡 My good friend @diphabarus here talks about his mom!\n\n#LaguUntukmu coming up in 2 days. https://t.co/Lwg2Cw9xEI See my good friend @KuntoAjiW sharing how he loves his mom! #LaguUntukmu 25.05.18 🧡 https://t.co/A6BiEuanuh Counting down the days! Ssshooo exciteeeeeed! #LaguUntukmu https://t.co/KVoL3TytRG It's getting closer!  #LaguUntukmu 25.05.18 https://t.co/FKKe7wVLFJ #LaguUntukmu 🧡 https://t.co/Hdfsnbrdud Can't wait!! #LaguUntukmu will be released soon! ☺️😍 https://t.co/RDpv1kuF82 A special song. Soon! https://t.co/ReCQ5vMpIj @dirdira sabar ya schwa Selamat menunaikan Ibadah Puasa semuanyaa @_felanov sabar ya. aku punya yang baru nih tapi. tungguin ya, tanggal 25 rilis. Soon https://t.co/zAFIZluNWc @iafikry Seru banget Karawang! Thanks for the energyyyy @bimabim1 Iyaaa! Hahaha Feeling pink today. 🌸 Sabtu ini nyanyi bareng di Labsproject 2018 di JIEXPO Kemayoran yaa! Hope to see some familiar faces there! See uuuuu 😊 https://t.co/ADMTRbK9D0 @onnyshel ayoo undang aku dong.. hahah kangen nih sama Semarang! @N_Haliza99 karenaaa kadang aku perform di gigs yang private, yang aku publish disini adalah gig yang kalian semua bisa dateng! jadi dateng yaa ❤️ Come sing with meeee, i'll see you very soon! ❤️ https://t.co/PN0AfxX88M Thank you sooo much untuk semua yang sudah vote! Thank you @netmediatama untuk apresiasinya, dan thank you Your Raisa untuk supportnya yang selalu ada buat aku❤️ https://t.co/BIlwbyQVwA Through all my insanities, you laugh with meee. So I love you... https://t.co/PL8Zg5OPZP My current jam 👱‍♀️🎶 https://t.co/Te5euQQyeO Guys I need your help!\nVote aku ya sebagai Penyanyi Solo Wanita Paling Ngetop versi SCTV Music Awards 2018\nCaranya:\n- via SMS \nSMA2 (spasi) RAISA, kirim ke 97288\n- via Twitter \n#SMA2 RAISA, mention ke @sctv_ \n- via BBM Polls\nmasuk ke BBM, pilih polls, pilih RAISA\n\nThank you! ❤️ https://t.co/pm3A2NkJmJ \"Lebih banyak kita maklum, lebih kurang rasa dendam dalam hati kita. Semakin adil pertimbangan kita dan semakin kokoh dasar rasa kasih sayang. Tiada mendendam, itulah bahagia.\" Selamat hari Kartini ❤️ https://t.co/l4xBKuIZVQ You're my sun, you're my rain, you're the twinkle in my eye. https://t.co/pNKIt7uiUj https://t.co/H2HgHbvS0q there's still time! guys, vote aku ya sebagai female singer of the year. caranya gampangg tinggal tweet:\n\n#ICA5(spasi)#FS_Raisa @netmediatama \n\nterima kasihhh! ❤️ https://t.co/q6ixXnVhHp Hi guys! Stream Raisa on Joox! ❤️https://t.co/pjyNo5BT3X https://t.co/FumTOBrSOQ @botolcocacola hai bey! lucu amat usernamenya Buat yang belum sempet denger versi akustiknya Love You Longer, simply click the link! 🍒 https://t.co/PNfrT7B1pT https://t.co/nYmZubaMgb @mesyaniputri hahahaha bisa jadi ☺️ @irzak79 Justruuu, kan pengen tau kalian sukanya apa. Kok kamu jadi marah? 😬 Anyway, baru ngeh.. Yang vote Jumat lalu 77% nya adalah Kali Kedua. Kalo aku personally sih... suka dua2nya! Hahaha😆 My latest release, the acoustic version Kali Kedua and Love You Longer are now available on Deezer! ❤️ https://t.co/vBKGSS2lwI https://t.co/ObBDjAELxc Guys vote yuk! Diantara 2 single versi akustik aku yang baru aja di rilis, paling suka yang manaaa? Vote ya! Waktunya cuma sampe jam 6😆 Siapa yang udah denger 'Kali Kedua' versi akustik di @JOOX_ID? Raise your hand! Or if you haven't, click the link to stream it! 🥤  https://t.co/pjyNo5BT3X https://t.co/Swqya88e9r The acoustic version of Love You Longer is already available on @DeezerAsia !! Click the link to stream ❤️ https://t.co/8zDaWsC39g https://t.co/1LBFxiCk58 Guys, aku akan nyanyi bareng @KuntoAjiW di Jogja bulan ini! Siapa yang bakal dateng? Absen dong! ❤️ https://t.co/qsODUkG71V And also thanks to @DeezerAsia for featuring me! ❤️ https://t.co/G4bKAS2jMo Thank you @SpotifyID for featuring me! Love! https://t.co/IQ5RrCCPFa And this acoustic version of Kali Kedua, go stream now! https://t.co/zqPlp3JSae https://t.co/ZGw1Q9p9tJ A happy day it is! Untuk merayakan 2 tahun album Handmade, aku punya sesuatu untuk kalian. Go listen now! https://t.co/D8ThCPOiXN https://t.co/GZaad5RHQS @JuniRecords @lifeofgbrand Yazzaaaaaaa congrats GBrand! 2 days away! Who's excited? https://t.co/JAwQrwozkD Counting down the days till 6 April 2018. ☺️ https://t.co/jfCBGjW6u5 See you soon all! Yuk mampir-mampir ya kita nyanyi bareng! https://t.co/2y26FnhE3u @abyanfawwaz oiya! terima kasih koreksinya. @bimabim1 aamiin terima kasih yaa https://t.co/n2RmOGdg5h Wiii terima kasih yang sudah votee, i get so many mentions! Terima kasih yaaa smuanyaa☺️ Guys! Bantu vote aku ya di Indonesian Choice Awards 5.0 sebagai Female Singer of The Year! Caranya gampang tinggal tweet: #ICA5 (spasi) #FS_Raisa (spasi) @netmediatama.\n\nThank youuu ❤️ https://t.co/HGvFT7txDR Surprise! Tonton ya https://t.co/2nnF7xO20X https://t.co/86kKI6kviS Throwback to one of my favorite moment; menunggu #RaisaHandmade rilis! Ini 2 tahun lalu loh! Time flies❤️ https://t.co/DYoM6bzr2i Throwback sedikit yuk! Momen #RaisaHandmade ini udah 2 tahun lalu! 😲 time flies.. https://t.co/bPGxCzqdhp super tasty sushi completed my #JapanTrip ! enak bangeettt! #VisitJapan #Japan https://t.co/0kdk1gWW17 main2 salju di Sapporo Teine Ski Resort. dingin bgt, tp seru bgt! so much fun! 💕 #VisitJapan #JapanTrip #Japan https://t.co/1PrBfZMerf discovering inspiration at bonjour records, tokyo. baru sadar, udah lama jg gak main record store. #VisitJapan #JapanTrip #Japan https://t.co/J2WShdu201 yes! hello sakura! #VisitJapan #JapanTrip #Japan https://t.co/YDMZ61J8yV kaget pas masuk music box museum di Otaru, Hokkaido. banyak bgt dan lucu2 bangeettt! beli gak ya? #VisitJapan #Japan #JapanTrip https://t.co/7c28Zxezfm kemarin di sapporo white illumination! lampu-lampunya, magical! \n#VisitJapan #JapanTrip #japan https://t.co/qgIBtQGgy5 day 2 for Japan trip, super excited! can't wait to share all the fun! Monday is made for me. I love Monday! Sweet surprise from YAY! By Raisa! Go check them out to see what's going on! https://t.co/MRP6HLfdft ❤️ https://t.co/yLXErhIP5x Guys! Udah beli tiket #LAFFestival belum? Bakalan rame dan seruuuuu! Buat yang belum beli, beli di https://t.co/iLTMBYU5fx yaa! ❤️ https://t.co/kONTORfqh5 some of my favorite pieces from YAY! By Raisa! Neutral tones are truly my favorite! available di official storenya Juni Goods. Do check the link on their instagram profile: https://t.co/MRP6HLfdft  💕 https://t.co/K5QbO0wIOb jgn lupa, februari ini kita nyanyi-nyanyi bareng ya. catat tanggalnya and I'll see you guys there!💕 https://t.co/fBEh360a7e waw! kemarin seru2 dan asik2 bgt di LINE Concert Medan! Semoga kita bisa nikmatin musik asik cara LINE lg di kota lain ya! 💕 #MusikAsikCaraLINE #LINEConcertMedan https://t.co/PNAku5YhOO YAY! by Raisa lookbook video is up on my YouTube channel! have you seen it? https://t.co/rRm1rBQsMa The wait is finally over! YAY! By Raisa new arrivals are now hereeeee! Check their instagram profile to find out more! https://t.co/MRP6HLfdft https://t.co/r1FQynegnP Terima kasih jugaaa untuk apresiasinya buat aku &amp; @isyanasarasvati! Happy bgt! ☺️ @dahSyatMusik https://t.co/zgwbz2yNNp Thank you @dahSyatMusik for the appreciation! Love! ❤️ https://t.co/5of9kRQLad Guys! Can't wait to see you all at #LAFFestival! Go get your #LAFFesetival tickets now, check their website https://t.co/iLTMBYU5fx See you at JCC, 10 Feb 2018! @berlianentertainment @hypefestival ❤️ https://t.co/Tc3Q79uTb1 New video! Lookbook for YAY! By Raisa ❤️ https://t.co/G29MdWmIGb Anyway, aku punya playlist untuk menemani weekend kalian! Here's the link https://t.co/uFqxY5P6t0 go check them out! Happy weekend all! Btw, besok ketemu aku yuk nyanyi bareng di Bandung! ❤️ Weekend ideas by YAY! By Raisa, get it all on https://t.co/MRP6HLfdft https://t.co/qAOCeZ5Lwr Yay!! Seneng banget akan berbagi panggung dengan musisi-musisi favorit di LINE Concert Medan! Jangan sampai kelewatan, dapatkan tiketnya di https://t.co/25XerKYgMG! #MusikAsikCaraLINE #LINEConcertMedan https://t.co/KnAswaGZjf Calling all my Medan friends, sampai berjumpa di LINE Concert Medan, 27 Januari 2018! Penjualan tiket sudah dibuka ya! #MusikAsikCaraLINE #LINEConcertMedan https://t.co/DbWrvr5pDq Great things never came from comfort zones, even it's a slow process, but quitting won't speed it up! Semoga video ini dapat menginspirasi teman-teman semua.. https://t.co/rYDnseiYJw ☺️ https://t.co/MmM8NX77h5 Guyssss, aku akan tampil di LINE Concert Medan, 27 Januari! Penjualan tiket sudah dibuka di https://t.co/25XerKYgMG #MusikAsikCaraLINE #LINEConcertMedan see you! :) https://t.co/hEktm4lCET Still can't get over the beauty of Taj Mahal. 🧡 https://t.co/3JJsGlfRWg Ooops, hampir lupa. Kita nyanyi bareng ya! See youuuu all very soon!! https://t.co/WFU4kQkhXG Beautiful Taj Mahal ❤️ https://t.co/K6ZEYACyfT Hi guyss! I wish you all a very happy day! 🧡 Happy new year 2018! https://t.co/zzxqV7RmGC Menemani di perjalanan sore menuju malam. Stream some Handmade songs, maybe? https://t.co/z1Iz9BK38f ❤️ ...and listen to Raisa on spotify as well! https://t.co/nWdvAmym13 https://t.co/3b4oHQidoj Tahun baru sebentar lagiiii! Dengerin playlistku yuk di spotify: https://t.co/VZXoUc4sxm Find me on apple music! https://t.co/z1Iz9BK38f go go stream now! ❤️ https://t.co/IaghAT2ABn Membuat #TeduhnyaWanita adalah suatu tantangan buatku! Menciptakan sesuatu untuk menggambarkan kita, wanita. See the full video here:  https://t.co/JPJ7px0YUb Jogjaaa! Aku bakalan nyanyi di Hotel Tentrem, Yogyakarta tanggal 31 Desember nanti. Make sure to buy the tickets, now! More info: https://t.co/zOTw1NWs2F https://t.co/8nMMpP2IFk Ia cerminan sisi terbaikmu, lindungi hatinya.. sekalipun di dalam amarah. #TeduhnyaWanita. Stream now via spotify here: https://t.co/7Nq99P2THO good day! ada yg blm dgr lagu terbaru aku, #TeduhnyaWanita ? Now you can listen to it on @applemusic , https://t.co/bVox93oz79 now! @DengarkanDia oke di catet😉 @realfedinuril @filmAAC2 Hahahaha! Seru kan? Can't wait!! H-5 #AAC2 in concert ❤️ make sure to buy the tickets! https://t.co/etMJGWLkb4 Tonton #TeduhnyaWanita di sini ya: https://t.co/Kyg4SyScVJ https://t.co/N2UxGaKb22 Can't wait to spend NYE with you, Jogja! I'll see you soon in The Best of 2 Divas Concert! Beli tiketnya di sini yaa https://t.co/xPxv573hig dan https://t.co/svYlBkZvdQ ❤️ https://t.co/9za4QugmDF Hujan deras sekaliii! Hati-hati semuanya, yang kena macet, sabar-sabar yaa! Music gets me through everything. Lagu yang aku dedikasikan untuk kita, wanita: Teduhnya Wanita. https://t.co/liTyjJnn3x alhamdulillah, akhirnya on board dgn GA244. Doain semua lancar dan bisa cpt sampai semarang. video terakhir! doain aku bs cpt sampe semarang ya! i love you guys so much! 💕\n*part3 https://t.co/vBKMp5Aq9O and this is the second video for you, semarang. masih delay juga pesawatnya sampe sekarang. 😢\n*part2 https://t.co/PNMMTFsWDH semarang! i have some videos for you. ini video pertamanya yah! *part1 https://t.co/snR57ZJFBf Ketemu yukkk! Let’s meet up &amp; sing along together ♥️ https://t.co/ehbcBQjEEK Thank you @MnetMAMA for the appreciation! ❤️ https://t.co/8lkoTNs6id Thank you, thank you!! I really am grateful for this! ❤️ cheoowwww we did it we did it! 😆 @isyanasarasvati https://t.co/Obl7GpwCqG One of my favorite pieces of #YAYByRaisa #MeandYAY shop now https://t.co/TS6fDzRC3g https://t.co/K4vdmhl70T The day that i've been waiting for...... finally!! Hari ini sudah bisa di beli koleksi YAY! By Raisa vol. 2! Go grab them! https://t.co/TS6fDzRC3g #meandyay #yaybyraisa https://t.co/ok3ChY11YE another day at the airport 😁 Tersedia di seluruh digital merchants favorit kamuuu! Yang penasaran sama #TeduhnyaWanita Music Video tersedia disini jugaa: https://t.co/Kyg4SyABx9 https://t.co/hLFod2USp2 Finally! Official MV dari Teduhnya Wanita #AAC2 sudah di rilis. Tonton disini: https://t.co/Kyg4SyABx9 2 hari lagiii, #YAYbyRaisa vol. 2 bisa kalian beli! ❤️ https://t.co/xEiwyuqkZC Available already on all digital merchants, my newest single, Teduhnya Wanita. Hope you all enjoy it! #AAC2 https://t.co/ZVfh6Noxdk Out now on my youtube channel! https://t.co/GcchXFtu63 #AAC2 Counting down the days. Shoooooo excited for #YAYbyRaisa vol 2! ❤️ https://t.co/Nj4h3O6ZMm Tomorrow! #AAC2 https://t.co/htOxyeQx2P #AAC2 https://t.co/l0aD8eO0Np 3 hari lagi! #AAC2 https://t.co/lypqQaB10Q Udah ikutan belum? Aku mau kasih kejutan nih! Ikut yuk! https://t.co/BuTU7otw8A https://t.co/l4GPOyLj7V Wiii! Akhirnya yang ditunggu-tunggu, Konon Katanya - @KuntoAjiW tersedia dimana-manaaa, congratulations Mas Kun! https://t.co/tigyCmgMkS Soon! #YAYbyRaisa https://t.co/LjiarvHbi6 Nggak sabar geng! @JuniRecords fast forward plzzzz 😌 https://t.co/M5aGg31tZL Siapa yang mau dapet kejutan dari akuuuuu? Ikutan doong! Nanti kita riding bareng. Cek disini yaaa https://t.co/DbviI7WnDh 🧡 Berita baik dari YAY! By Raisa: sebentar lagi akan dirilis koleksi YAY! By Raisa vol. 2, super excited!! 😍 #yaybyraisa https://t.co/wPRroApfwa 30 hari lagi!! Siapa yang excited sama kayak aku? #AAC2 https://t.co/HqJIt1PeWp Alhamdulillah! Terima kasih banyak untuk semua supportnya, thank you YourRaisa &amp; Isyanation!! #AMIawards20 https://t.co/RD2F8R4Vhe Alhamdulillah. Thank you @AMIawards! I would never made this far without supports from all of you!! So thank you Your Raisa.... Btw congrats to us sis @isyanasarasvati ♥️ https://t.co/QBolxVdK0r udh nonton MV #UsaiDiSini kan? samaan yuk motornya kayak aku di klip itu! ikutan di sini deh: https://t.co/DbviI8dZ1R . cepetan ya,waktunya terbatas lho! selamat pagi! let's hope for the best on everything that we are doing today! 💕 it's done for today's project! semoga pd suka nantinya ya! https://t.co/1hhTSXFbAX ujan deres bgtttt!! alhamdulillah, seharian ini di kantor aja. mas kuunn!! @KuntoAjiW videonya yg ini bgs deh! https://t.co/1NW6bpaxo9 good luck album keduanya ya! See you tonight BSD!! ♥️ https://t.co/Fte8yw3AHj Had so much fun in the office today, preparing something exciting for you!! ❤️ Who's up for sing along with me this month? Kita galau &amp; nyanyi bareng yuk! Catat tanggalnya, and i'll see you super soon! ❤️ https://t.co/a73n92IES1 Enaknya abis yoga itu coconut water!🥤 Who's with me? @reviewapaaja @JOOX_ID hahahah! udah aku buka semua! :p Happy belated birthday Joox! Thanks @JOOX_ID for the gift! Thank you jg Your Raisa yang selalu streaming aku di Joox! #JOOXTwoGether 🧡 https://t.co/5aAtDgFfxN Can't wait for AMI Awards this November! Btw, terima kasih byk apresiasinya utk single aku &amp; @isyanasarasvati menjadi nominasi tahun ini! :) https://t.co/Uk2shCPjU7 Guys!! Aku akan perform di ICE BSD hari Sabtu ini, tanggal 28 Oktober. Who's coming? https://t.co/HmW7gNHR1x Just heard the news! Ada promo #HyukohJKT beli 3 gratis 1. Info lebih lanjut klik ke https://t.co/xQIkVpQy8v yaa! Nyanyi bareng yuk? https://t.co/7roHiJDbIx Play time with Malaka! 💛 https://t.co/WOlqPXuNQf Surpriseeeee! Ikutin challenge nya yuk. More info: https://t.co/DbviI7WnDh #KejutandariRaisa https://t.co/QYKaJxBv3e Sore ini hujannya dereees banget, petirnya banyak, hati-hati semua yaa yang dijalan! ini diaaaa! jgn lupa ikutan yaaaaa...can't wait to find out who's the winner! https://t.co/ppsS0ve6O4 dan..., aku punya sesuatu yg seru jg nihhhh! wait for it... feels so good to be back on the road! gak sabar mau nyanyi bareng lagiii! 💕 Hi guys! Me &amp; @adryboim will take part in IdeaFest 2017. Make sure to come &amp; say hi! Kita ngobrol dan sharing yuk? Ticket info: @IdeafestID https://t.co/HM8uKzrgVg Selamat Hari Batik Nasional! :) Terima kasih untuk semuanya yang sudah tweet #NominateRaisa #MTVEMA. You guys rockk!! Anywho, the voting will end soon. Vote now! :) https://t.co/WvfY6pH0L2 Thank you so much everyone for the love! We still have few days left. Keep 'em coming! ❤️🖤  #NominateRaisa #MTVEMA https://t.co/DTZygFih1x RT @mtvasia: . @raisa6690 fans show some love and tweet #NominateRaisa #MTVEMA to vote for her as @mtvema Southeast Asia Social Wildcard No… ❤️❤️❤️❤️ https://t.co/aa2SKGLpwO So thrilled to be one of the MTV EMA: SEA Social Wildcard Nominees! Please vote for me by tweet: #MTVEMA #NominateRaisa. Thank youuu! 🖤 https://t.co/9nlSUcvt2s yaassss! 💕 https://t.co/7DtJ4D7UXt aku baru bikin playlist lg! happy songs, for my happiest moments. follow and listen! 💕 https://t.co/cORzFE8yOF ❤️ https://t.co/tH8gVMpb8l Alhamdulillah. Terima kasih banyak atas semua doa-doanya, i'm forever grateful. ♥️ By the way! aku ada good news nih...Undian Mid Season Juni Goods diperpanjang! Ayo buat yang belum ikutan, masih ada kesempatan loh😉 https://t.co/EgiyuSW2Yy Mmm untuk selanjutnya enaknya aku bikin playlist apa lagi ya? Any ideas? Isi playlist yang aku bikin kemarin ada lagu dari Brian McKnight, Stevie Wonder, sampe Adele. Full of my personal favorites😊 Beberapa hari yang lalu aku bikin playlist nih di Spotify, udah pada dengerin belum? kalau belum, here you go, https://t.co/4728vYz0iL Siang semuanya! Wah gak kerasa udah hari senin lagi, dan bulan agustus udah mau selesai aja😂 Hope you guys had a great month! Made my own playlist on spotify! Kurang lebih this is one of my go to songs, see &amp; listen here: https://t.co/4728vYz0iL Guys! Udah ikutan contest video #UsaiDiSini belum? Ikutan yuk! Cek caranya disini yaa https://t.co/xf1CkaMerA https://t.co/mIbXDmxvOw Merapat yuks! Sore ini aku akan phone interview ❤️  stay tuned ya! https://t.co/2oJXI9fiqP @ismirusmi iyaah! dengerin yaa Yes!! ❤️ https://t.co/4hQuIBV6uQ siapa yg bisa memajukan bangsa ini selain kita sendiri? selalu lakukan yg terbaik untuk bangsa dan negara kita. dirgahayu Indonesia! #ri72 https://t.co/aCrV8JPk38 Have you seen #UsaiDiSini? https://t.co/nBwR0bX8M4 Thank you for all the response! Next time kita ngobrol2 lagi yah! Anyway, here's the link of #UsaiDiSini https://t.co/OxMBh1C8vI @ApriliaUtr 😂😂😂 @dimxklz aku pake tema hujan di  video liriknya. liat deh... https://t.co/T2F32dkhiN Serunya bacain replies &amp; mentions tentang #UsaiDiSini! Keep it coming guys! Aku bales sebisa aku yaa @Aprilinda24 Thank youuu! Kurang drama yaa? Hihi thanks for the input! @prbrmx hahaha kurang galau ya? thank you for the input! @Anisa_fitri42 thank youuu!! ♥️ @editanndaqila seriusss? haha padahal aku deg-degan pas tanggal tayang video clipnya!! thank you btw! ♥️ Hi guys! I need your input. What do you think about my latest MV #UsaiDiSini? Tweet aku ya! @putriwindari_ bisa dong! 😋 @TyaOctaviany waaaa! terima kasih! kamu jugaa sukses terus 😘 Terima kasih buat semua respon positifnya untuk MV #UsaiDiSini! Thank youuuu ♥️ anyway, aktifkan RBTnya #UsaiDiSini yuk! https://t.co/ihb0Raoq0S #UsaiDiSini is up on my youtube channel! Finallyyyy ♥️ https://t.co/OxMBh1C8vI https://t.co/93DIMOxZ04 As I promised, sore ini #UsaiDiSini sudah bisa kalian liat di youtube channel aku https://t.co/IqQFD4oaCh! ♥️ https://t.co/P5kWiUywW8 Hi guys! Siapa yang nungguin #UsaiDiSini? 😊 H-1 #UsaiDisini! Are you ready? 😉 https://t.co/6UnY0UuEWu Still can't get over the fact one of my idols saw this cover of his song😂 https://t.co/3X2vbTzN3x A little sneak peek for #UsaiDisini Music Video: https://t.co/8chUQawdpm ❤️ Two days to go! #UsaiDisini https://t.co/Ll51E8Tzxz So it begins, countdown to #UsaiDisini. 3 more days! https://t.co/Su8U5viu8K Baru selesai latihan nih, very excited to be performing for the first ever #SPOTIFYONSTAGE. Sampai ketemu besok ya semuanya!😋 https://t.co/JCPBoDvo3i @dirdira Sabar ya dek. :) On my way! #UsaiDisini ❤️ https://t.co/riXETatb4C #UsaiDisini https://t.co/M3rkR2OyWG Who's waiting for this? #UsaiDisini https://t.co/17pIIn0Szl Ku kan menunggu, tapi tak selamanya... Are you ready? #UsaiDisini https://t.co/TnfE4CFoKR @DengarkanDia let's! hahahahah #UsaiDisini coming soon! https://t.co/1Tf5zfnkJE Ketawa keras sampe diliatin seruangan tadi gara-gara nonton ini! https://t.co/ftdfEkJts8 hahahahahaha cc: @DengarkanDia 😂😂 Eh iya! ada lagi nih, yuk ikutan #UsaiDisini OOTD challenge! Udah gak sabar buat ngeliat foto-foto OOTDnya!😘😘 https://t.co/M3Ob48tzwZ Oh iya! ini beberapa jadwal manggung bulan Agustus ini😋 \nCome bring your friends and let's all have a good time together! See yaa! https://t.co/8tOKYhretM Yeay it's already August! Can't wait to share something exciting to you guys real soon! ☺️ #UsaiDiSini soon! https://t.co/NYSscHiDHy Thank you @CornettoID for the appreciation! :)) also thank you for Your Raisa for the never-ending support. ❤️ https://t.co/Wc7PUytF0M Such a heartbreaking news. #RIPChesterBennington. Supporting my dear friend, @DengarkanDia! Gemeeees sama videonya https://t.co/cSuVYrVF9B ❤️ @bukanpevita hahahaha malu ahhh.. aku udah gak lucu sekarang @Valentinenur1 semangat jugaa kamu! @zhfrina_ Aamiin.. terima kasih 😆 @MryAfina Nice day deq 😛 @amelians27 Kamu jugaaa stay healthy &amp; happy!☺️ Capeknyoooooo today. Have a nice day everyone! ❤️ https://t.co/6X8TzRXV2t See you soon! https://t.co/KC61NJxb7x yang pake OPPO F3, mau package spesial Spider-Man? Cek @oppoindonesia &amp; https://t.co/kBOsTJw8rR\n#OPPOxSpiderMan #SpiderManHomecoming #OPPOF3 https://t.co/ffbKaqch3U Lunch tadii ❤️ sedih udah mau pulang huhu! https://t.co/uMvNyre1kI Good morninggg!! White Pleated Top or Black Pleated Top? Pick your favorite here! https://t.co/MRP6HLfdft #YAYbyRaisa https://t.co/CjYRuiAjQU White, black, grey.. My fave pieces from #YAYbyRaisa ❤️ https://t.co/yiRHoS32KO #throwbackthursday \nearlier tunes by me! stream &amp; download di @SpotifyID @AppleMusic @iTunes @JOOX_ID dll. malu jg kalo inget jmn itu, haha! https://t.co/rTt4O3sbmV yeaaaayyyy!!! 💕 https://t.co/w7K0GqRRHw Ideas for today's bukber outfit: White Bow Handcuff Top + Grey Knot Trousers by #YAYbyRaisa! :p cek instagramnya: @Yay_byRaisa https://t.co/QsHNJini7p Black Pleated Top + Grey Knot Trousers = casual everyday outfit!\nHead to https://t.co/MRP6HLfdft for more info! ♥\n#YAYbyRaisa https://t.co/shA6uBIWGy selamat berbuka puasa semuanyaaa! takjilnya apa nihhh? My pick of the day: Grey Flounce Sleeve Dress! Buy now at https://t.co/RUHdsMn3mm #YAYByRaisa https://t.co/7j5veN2v1F Innalillahi Wainnailaihi Rajiun, selamat jalan kak Julia Perez. Semoga semua amal ibadah diterima disisiNya. Aamiin. #RIPJupe This is how I style: https://t.co/WeuUR0W0Vg #YAYbyRaisa Nyawa dan Harapan (official lyric video): https://t.co/woTM1DBkc2 4 pm sharp! Ada yang baru di https://t.co/wG9ik4LThg. Tungguin yah❤️ https://t.co/xjlPAcD5Lt One of my faves from #YAYbyRaisa is Grey Flounce Sleeve Dress. Tell me, what's your favorite? ❤️ https://t.co/VXoRZeaPuK thank you much, @eleveniaID ... i'm so hepiii!! thank you for the cake ❤ https://t.co/mjL93rfMUf Waaaa thankyou @OPPOIndonesia!! https://t.co/eQBU9J14zG yeaayyy, thank you @eleveniaID ! amin, amin, amin buat doa-doanya. yuk hepi-hepi lg yuukkk! 💕 https://t.co/M5xA0a9l2T Super excited! Sekarang YAY! sudah bisa di beli via Juni Goods, cek info &amp; catalognya disini yaa https://t.co/CcgAt70XA6 #YAYbyRaisa https://t.co/WV2b01eNdL See what's behind the photoshoot of YAY! here: https://t.co/POz5tK10Bt #YAYbyRaisa Hai! Semangat hari puasa ke-8 ya.. Siapa yang tenggorokannya udah mulai sakit karena kebanyakan makan goreng-gorengan? 😛 See the first look of YAY! collection here: https://t.co/pQ2gOlUEgn i'm so excited! 😁  #YAYbyRaisa Welcoming June my favorite month! 😆 https://t.co/DtHRdaJAYb I'm proud to be Indonesian! #SayaIndonesiaSayaPancasila Available on early June! ☺️ see what's behind YAY! in here: https://t.co/CHmM6QJK3h https://t.co/XIrwDsfe8K So excited! Available on 5.06.17 #YAYByRaisa https://t.co/lf3UTmh32a https://t.co/he87Y5VAa9 Coming soon!! 5.06.17 #YAYByRaisa check them out here: https://t.co/taQ2KLq61p 😁 https://t.co/2c4C7jF4Fk Hi! Have a nice day! Just a little reminder ❤️  @JuniRecords https://t.co/n6ZCNzNHyH Everyone, please stay safe! #PrayforJakarta Turut berduka untuk para korban ledakan bom di Kampung Melayu. #PrayForJakarta Ikutan #AllAboutWomen makeup&amp;fashion challenge dari @eleveniaID yuk! Ada hadiah jutaan poin https://t.co/NE2vluRii4 https://t.co/uscPGDmwjj Gak sabar perform di Malang hari ini😆😆 yuk! https://t.co/KZWJXHyy7U Sending my love and prayers to Manchester. #PrayForManchester Thank you for all your supports! It means a lot to me! Thank youuuuu ❤️❤️ https://t.co/lOaBgq3aSv sarapan tadi pagi, sblm muter-muter bandung..coffee, is a must! eh,tapi di foto gak ada kopinya ya? hahaha! @manderos https://t.co/yPgAHm57g0 @yourRAISA_PLU @isyanasarasvati Aciwww! Love youuuuuu! @AnggiLe01964348 nonton dong kalo aku manggung! ketemu deh 😆 @lukman_nicko @SCTV_ iyaa aku lagi promo di Bandung hiks! ini masih di Bandung :(( Anyway we did it sis @isyanasarasvati, alhamdulillah.. Thank you Your Raisa &amp; Isyanation! Literally the best supporters in the world! Xx https://t.co/cZMjLccrwS You know how happy I am! Thank you semuanya yang udah vote &amp; thank you all for the supports!! Thank you! ❤️ @SCTV_ https://t.co/a1l7gkh1XR See you! 😆 https://t.co/AipQgU7jLl Siapa yang lagi dengerin nih? Merapat yuk! @iradiobdg @hardrockfmbdg https://t.co/4kV3FAk3pW Tonight! Jam 18.00 WIB, jangan lupa dengerin Musteria di @mustang88fm yaa 😆 https://t.co/qFO0uS9eFp Ada yang mau phone call sama aku? https://t.co/kQ9LcZteeB 😝 https://t.co/qh2kh4z1Wk yeess! ke bandung lagi! yuk nyanyi bareng yuk! https://t.co/Zbzu6mdUhW ini dia, tgl 11 tuh #eleveniaday ! belanja di @eleveniaID , khusus hari ini diskon 25% untuk semua! buruan buka https://t.co/zgYLaY4D2d ! 💕 https://t.co/x1sDHPltKc whoaa, hari ini tgl 11 ya?! aku punya sesuatu nih..wait, wait... cheeoowww @isyanasarasvati ! kita dpt nominasi niiihhh!!! woohoo!! if you like our project, if you love the song, don't forget to vote... https://t.co/cBzacx9FGW yeess!! make sure you vote, guys! seneengg deh dapet nominasi.. 💕 https://t.co/3HOpcN9Jwy latihan lagiii!! yaasssss!! https://t.co/GpXpEaK7Tw Hi Depok! Kita ketemu di #GenLokalFestival besok (7 Mei 2017) yaa di Margo City Depok! I'll see you soon♥ @gen987fm https://t.co/UNEgEtlPF6 akhirnya, hari ini....libuuuurrr!!! yeaayyy!!! before the day ends, this is for you, sissss! @isyanasarasvati happy birthday, chew! 💕💕 https://t.co/l9IXBWkqYi What a great event! Selamat ulang tahun yg ke 25, kabupaten Klungkung! https://t.co/RvRlHkvtja @ninahernina haha! lucu yaaaa anya main sama kuciingg, gemeesss!!! 💕 di bali (lagi), dan bukan liburan (lagi)... 😤 Surprise me, May! See you all very soon ya! ;) https://t.co/Hri4wsJ9fA Guys! Please vote Raisa for Female Singer of The Year, Album of The Year &amp; Song of The Year! Vote here: https://t.co/wp2DvGdLi2 Thank you &lt;3 https://t.co/D2noWWLdZo Bali! Let's meet up tomorrow, and sing a song together, shall we?! come along with your friends, and let's have fun together! yeaayy!! https://t.co/lbhZ0wPSP8 Let's sing together with me! Hari Jumat, tanggal 5 Mei 2017, di Empirica, SCBD. Don't forget to buy the tickets guys, now! https://t.co/z7LkA0SYKC ladies! aku nemuin diskon seru nih di https://t.co/BGfEHgjmeJ ! @eleveniaID bikin kita cewek2 jd spesial bgt bulan ini! https://t.co/cJCO8mAlqa hari selasa, rasa hari senin.. hufff... Wiii gak sabar tanggal 19 April ini bakal Karagen Karaokean Gen Bareng #RaisaxIsyana!! :)) mampir yaa! Sampe ketemu disanaa! @gen987fm https://t.co/8wETmGH1cX #RaisaxIsyana Official Merchandise is still available in very limited quantity! Order through the LINE ID: @raisaxisyana. Grab them fast! &lt;3 https://t.co/gMqdYWB9KQ nanti mlm nyanyi di JakCloth di stadion kamboja palembang nih! yuk yg di palembang, kita nyanyi bareng! https://t.co/N5vOfsPLnn Tinggal 2 hari lagi! Kamu bisa bgt bawa pulang kamera mirrorless, smartphone, dll! GRATIS! Cek disini infonya yaa https://t.co/Mk2PX6muCE https://t.co/YDDWIQC62D and last but not least, thank you so much for this wonderful collaboration @isyanasarasvati ! we made it, siiisss! Let's go further! ❤️ and my gratitude goes to my beloved record label, @JuniRecords and also to @SonyMusicID for the opportunity to make #RaisaxIsyana possible! gak lupa jg makasih buat tmn2 media yg udh dtg dan support #RaisaxIsyana , dan tentunya @OPPOIndonesia buat supportnya buat kolaborasi ini! makasih jg @yourRAISA dan @isyanation yg udh dtg dan nyanyi bareng. kalian bikin showcase #RaisaxIsyana jd makin seru! masih seneng bgt gara2 showcase #RaisaxIsyana kemarin.. thank you semua yg udh pd dateng, terima kasih apresiasinya. hope you like it! ❤️ Here you go! Ini tata cara penukaran tiket untuk #RaisyaxIsyana Showcase malam ini yaa! See ya💛 https://t.co/0KfvEmK4rL Good morning! Just got the news that tonight's show has already sold out! See you all very soon💕 #RaisaxIsyana https://t.co/ARa69drydU It's tomorrow!! Have you bought your tickets? It's selling out fast! https://t.co/ML9LDnV604 #RaisaxIsyana https://t.co/lQPRBh2vmE Yang pgn liburan, cek promonya @IndonesiaGaruda #GOTF2017 yuk! Pesawat, hotel, sampe perlengkapan traveling ada! Cek https://t.co/7feixLUgO5 https://t.co/zyPhWchtM7 2 days to #RaisaxIsyana Showcase! I'm so excited! Go to https://t.co/ML9LDnV604 for more info. https://t.co/zYhyASZj6K Sudah liat videoklip aku yang terbaru? What do you think? Tell me! https://t.co/UoeCy59hJD Garuda Online Travel Fair 2017 sudah dimulai! Langsung pesan harga promonya yaa di https://t.co/7feixLUgO5  #GOTF2017 https://t.co/bMwjrCgVII 3 days to #RaisaXIsyana Showcase!  Grab your ticket at https://t.co/ML9LDnV604 ♥️ https://t.co/wrfs9JD9vw padang! see you all tonite at jakcloth! nyanyi bareng di GOR Stadion H. Agus Salim yuk! Be the eye witness of Raisa &amp; Isyana Showcase. Visit https://t.co/ML9LDnV604, now! https://t.co/NEUs7SwHlk make sure you come to the #RaisaxIsyana showcase! grab the tickets at https://t.co/ML9LDnV604 , now! https://t.co/iEjHgkoMgF Belum sempat ke #GATF2017 kemarin? Jangan sedih, promo @IndonesiaGaruda masih ada di #GOTF2017. Catat tanggalnya ya! https://t.co/7feixLUgO5 https://t.co/mUbk3OcvHu This is the day! Anganku Anganmu is now available on all digital music merchant! Hear it, let me know what you thinks.. #RaisaxIsyana https://t.co/J0YqdP3yp9 H-1! ❤ #RaisaXIsyana https://t.co/6NxpfURY2P yeaayy! see you at #StockSound Maret 2017 di IDX Main Hall - 31 Maret. GRATIS! info klik https://t.co/Rvt9f3qX5c #YukNabungSaham @idx_bei https://t.co/dJpVmFnMKg H-2! #RaisaxIsyana https://t.co/jrcnswGl2a can't wait any longer for us? be ready for 30.03.17! #RaisaxIsyana ❤️ https://t.co/OktWWtnsYh H-3! #RaisaxIsyana https://t.co/O2Cm5XTCcu Belum sempat ke #GATF2017 kemarin? Jangan sedih, promo @IndonesiaGaruda masih ada di #GOTF2017. Yuk, catat tanggalnya ya! https://t.co/7diPGbadOF Get ready! #RaisaxIsyana https://t.co/aQENWgDS9k It's getting closer! #RaisaxIsyana https://t.co/VwrlnE66Tb Had fun in the studio! Can't wait to share it with youu! #RaisaxIsyana https://t.co/H8TOnCq0UV Wait for it..... #RaisaxIsyana https://t.co/h2mLhDJrG0 sebentar lg nih! jgn lupa dengerin di @Iradiojakarta ya! woohoo! https://t.co/pbm7tXg6XP throwback... #RaisaxIsyana https://t.co/Q9Q6bh30hO Hi! Udah aktifin NSP lagu-lagu aku beluuum? Sambil aktifin, bisa dapet hadiah jugaa lho! Wiihii~ detilnya disini yaa https://t.co/Mk2PX6muCE https://t.co/gN4WWq04q7 udh cek video baru aku? It is finally revealed, It's Us! Go watch it on https://t.co/lbDUT1rV63 ! https://t.co/ssymcnt61K duhh, maaf bgt!! video baru aku di youtube blm selesai di upload nih! 😭 Haiiii! Udah aktifin NSP dari lagu-lagu di album Handmade belum? Aktifin yuk! Cek caranya disini yaa https://t.co/Mk2PX6muCE https://t.co/Px8dXdY4Nb Udah siap nyanyi bareng aku besok di #GATF2017 ? Cause I'm so ready! Cek https://t.co/eqlgHWbian buat infonya...See you! @IndonesiaGaruda https://t.co/weGyPxhrBX Cari tiket harga terbaik di #GATF2017 yuk! Don't miss it, visit https://t.co/eqlgHWbian for more info ya... ❤️ @IndonesiaGaruda https://t.co/5pELPw06BC ready for the new beginning! lihat video baru aku di https://t.co/lbDUT1rV63 ya! super excited, can't wait! https://t.co/uMuyBxHkuS alhamdulillah,dpt sepeda dari pak @jokowi tadi di acara #HariMusikNasional , lumayaaann! hahaha! https://t.co/esPi3WWhQZ musik selalu jadi bagian yang menyenangkan dalam hidup aku... selamat #HariMusikNasional !! ❤️ https://t.co/l28LhpnXaY Aku punya video baru di https://t.co/lbDUT1rV63 ! I can't imagine how my life would be without these people. #MySquad ❤️ https://t.co/I8xBb2J9ci Waaa #GATF2017 bakalan ada lagi! Jangan sampai kelewatan, cek timeline  @IndonesiaGaruda ya! Atau klik https://t.co/eqlgHWbian https://t.co/0WsqTFTSbK saat pesen makanan,dan nama kita ditulis se-kedengerannya aja... sedih... :( @manderos https://t.co/tKXvpgGqCg aktifin NSP aku skrg, bisa dpt hadiah2 seru lho! mulai dari smartphone,kamera mirrorless,sampe pulsa! pilih lagu favorit kamu aja, woohoo! https://t.co/1AShNz2iFE aku punya kejutan nih, ada hadiahnya lg! tungguin ya, pokoknya hrs ikutan semua! I really had fun doing this with these all amazing musicians! Watch the full version here https://t.co/KFx9fSX391 @gen987fm https://t.co/Rvw03pwbgn Reminiscing #WeLoveDisneyIndo in 2015. Performing some of my favorite Disney songs again this Sunday, 4 pm on RCTI. Who’s watching? https://t.co/Czl7MuVcg2 video baruku udh rilis! watch the full version on my channel: https://t.co/lbDUT1rV63 , now! #RaisaUsaiDiSini https://t.co/tdO4rgLqR8 mau mulai bikin2 playlist ahh di channel youtube aku! hari ini aku udh bikin nih, cek di : https://t.co/oy3WvcXHLP .. semoga suka yaaa.. ❤️ Why I love #OPPOF1s? Here's why! ❤ @OPPOIndonesia #SelfieExpert https://t.co/DvjkCCKqIy holiday is oveerrrrr!!! :( Kalian sudah download sticker terbaru aku di LINE beluuuum? Cek link ini ya! https://t.co/7dQPD6Fxnm Hi, hi! Senin lagi, kerja lagi. Semangat semuanya! &lt;3 innalillahi wa inna ilaihi rojiun..selamat jln oon @projectpop ..semoga amal ibadahnya diterima..istirahat dgn damai.. wiiiii!! tmn2 di kantor @JuniRecords ngirimin foto ini..thank you @eleveniaID , what a cute cake! #KlikCariHepi https://t.co/JyRC7H6Suq good news! tahun baru, ada stiker aku ygbaru di LINE! https://t.co/WdPppIPobB ❤️ it's cuuutteee ! @tantidwi97_ hahah sorry! Aku tadi mainin youtube aku ke sync sendiri semuanya :p Just read this article. (https://t.co/kFjd2tDHHJ) and i'm so flattered! Thank you so much for all the kind words. Really appreciate it! :) sore2 seru! the perfect taste of #MagnumAﬀogato . cobain menu baru ini di @maxxcoffeeID dan share foto/videonya ya! #MaxxCoffee @MyMagnumID https://t.co/CaCHol7lPq Siapa yang udah nyoba main Raisa Run? Aku gak bisa berenti main ini... Jujur! Hahaha.. https://t.co/3LGPr7v7P0 https://t.co/2XWUx5lLIH RT @JuniRecords: Available on 19 December 2016! Check instagram Juni Goods (@juni_goods) #RaisaxSeringai https://t.co/sCyiGFfB85 siap #harbolnas tgl 12-14 Des ini? aku ks diskon 11% nih di @eleveniaID ! bs dpt ttd aku jg! download vouchernya di https://t.co/PsjMjUfj2s https://t.co/ocjWIvz8KI yummy! my new favorite from @MyMagnumID ! udah cobain blm? share foto/video #MagnumAffogato kamu di @maxxcoffeeID yuk! #MaxxCoffee https://t.co/avSauZSPuQ Keren bgt kan smartphone br aku #OPPORaisaPhone ? kamu yg mau bgt punya smartphone ini, pesen skrg di @eleveniaID https://t.co/dUqHa0o5NH ! https://t.co/pmaWMKQJc6 O-Fans &amp; @yourRAISA ,now available: OPPO F1s Raisa Phone Limited Black Edition. It's fantastic for your perfect selfie! @OPPOIndonesia turut berduka sedalam-dalamnya utk gempa di #Aceh .. it is sad.. send my pray for Aceh.. be strong.. wiihhh!! thank you semuanyaaa yg udh dengerin lagu2 aku di @SpotifyID ! thank you @SpotifyID ! what a great year! https://t.co/d6h2ACCgWy sore2 dapat good news, can't wait to share it with you! Tahun baru pada kemana nii? Ke Bekasi yuk! https://t.co/konC7bxHy8 mau dpt LEGO gratis? cuma perlu byr ongkir 9rb + 1rb buat donasi di @eleveniaID aja! dpt LEGO deh! klik aja di https://t.co/nYlYYQNx4b ! https://t.co/mYnZ6wu7Lv chillin' on monday.. Raisa - Tentang Cinta (Behind The Scene MV): https://t.co/8Yc1WAL4kj via @YouTube Coffee,dessert, and @MyMagnumID ? super yes,please! cobain #MagnumAﬀogato skrg yuk! Only at @maxxcoffeeid (Jabodecitabek store) https://t.co/5Lbe4vAdqo @maulallana ini dibales! :)) @RiskaYulianti78 Aamiin, terima kasih Riska! :)) Kalian udah liat ini belum? Hmm.. Tell me what you think! https://t.co/ljz2n7yeyZ #OPPOF1s #SelfieExpert @OPPOIndonesia Hahaha, ternyata tebak-tebakan aku super gampang ya! But anyway... Hello... Aku punya sesuatu untuk kalian lho. It's related to #TentangCinta. Kira-kira apa yaaa? Ada yang bisa nebak? :P This month's schedule!! See you very soon, semuanya! :) https://t.co/NIAANssUmO Supeeer excited! Mulai besok sampe Minggu, bakal ada booth Juni Goods (@JuniRecords) di Jakcloth. Yihiiii, ketemu yaa disana! :) https://t.co/AB2p1whlaP mau dpt hadiah dari @eleveniaID ? buat video 11 detik sebut 11 produk dibawah Rp 50rb di elevenia! jgn lp mention @eleveniaID &amp; #Serbu11 ! https://t.co/b1jQjv3q9s sekali2, bagi2 hadiah seru kali ya... tonight! i'll see you there! https://t.co/AZe2uhIRZN siap2 dulu buat nanti malam ahhh.. YES #JNE26tahun ngadain #HARBOKIR HARI BEBAS ONGKOS KIRIM di 26&amp;27/11/16. Bisa kirim paket GRATIS dgn @JNE_ID! https://t.co/NLj7ovPCeO https://t.co/Ly9tPvySKi Find Magnum Dipping Bar at Pacific Place &amp; share your Magnum Tiramisu creation #MagnumTiramisu #PP9Anniv ! let's sing together,tomorrow! https://t.co/v3NFoyfj2n Don't forget,watch #OPPOSelfieFest at 24 Nov,on Net TV! You can also stream it at https://t.co/fe0uLfIq30 ! Feel the vibe of the festival! https://t.co/N8pch7E2W6 OPPO Access: Raisa Handmade Tour 2016 - last city Yogyakarta: https://t.co/9E9or80WiC via @YouTube jadi,siapa yg udh ntn music video #TentangCinta di https://t.co/lbDUT1rV63 ? tell me what you think about the video! :) it's 7 o'clock! it's time for #TentangCinta music video. go to my youtube channel, https://t.co/fdErFRshmN , now! hurry! RAISA - Tentang Cinta (Official Music Video): https://t.co/3U8Vi3fWXe via @YouTube want some? find magnum dipping bar at pacific place, now! and share your magnum tiramisu creation with #MagnumTiramisu and #PP9Anniv https://t.co/k3vkcZ3mRy Tonight, tonight! Who's excited??? #TentangCinta https://t.co/HiHtwrJwcR Pagi! Aku akan perform di The 39th Jazz Goes To Campus Festival tgl 27 Nov ini! Dtg yuk! Caranya liat disini yaa.. https://t.co/RjCx07bgQv https://t.co/dGKEUD9HyZ So excited for #OPPOSelfieFest! Nyanyi brg yuk? Klik disini utk dptin tiketnya ya https://t.co/iycNPRBl1p see you there! @OPPOIndonesia https://t.co/PlqTZimGy9 It's getting closer! #TentangCinta Music Video https://t.co/CGk9Umvz0B good morning! are you ready for #TentangCinta music video? wait for it.... https://t.co/fwxwljlW2Q Thank you so much for the kind gift! Lucuuu, sukaa! Also the photos bring back those memorable weeks! Thank you @eleveniaID 💚💚 https://t.co/vQw7lTd9P9 Finally! It's hereeee, webseries episode ke 8! Maaf telat bangettt :( hope you enjoy this video! https://t.co/y1JFcCBclP #OPPOxRaisa OPPO Access: Raisa Handmade Tour 2016 - 4th stop! Solo: https://t.co/n8RMoydopq via @YouTube @Ridwan_465 @rico14 haloooo.. @dhila_laila @OPPOIndonesia ini bakpao lucu bgt yaa 😂😂 Cuteness!!! Gak tega makannya hahaha.. Thank youuu @OPPOIndonesia! What a thoughtful surprise 💚💚 #OPPOxRaisa https://t.co/4SuLDUmzV0 Jadwal bulan November.. Let's sing together, shall we? https://t.co/c4JmCN2vuF Throwback #OPPOxRaisa Handmade Tour Solo. I miss this moment already! (Photo by @fotokonser) https://t.co/KqSQipLBLb Selesai tur, pulang ke rmh dgn Business Class dari @IndonesiaGaruda ! What an experience, thank you guys! #GarudaIndonesia https://t.co/VcLhrIjjbc Lucky winners kontes @IndonesiaGaruda di Yogya! Senang deh Meet &amp; Greet sama mereka, thank you guys! #GarudaIndonesia https://t.co/JOqa7FollH And dont forget the Rules.. See you 💕 https://t.co/Qhak7xFeZS Cant wait! The very last show of #OPPOxRaisa Handmade Tour 2016. Mixed feelings, woohoo i'll see you tonight, Jogja! 💕 https://t.co/Tp1D5xcB9d OPPO Access: Raisa Handmade Tour 2016 - 3rd city: Malang: https://t.co/WTMDu3r22R via @YouTube Asik bgt di flight @IndonesiaGaruda , byk pilihan hiburan! Cek harga tiket istimewa #GOTF2016 , di https://t.co/QX8x1VMfGP #GarudaIndonesia https://t.co/PxiSYfLxtx Hi, mau m&amp;g dan nonton konser aku? Yuk ikut photo contest di OPPO Store Jogjatronik skrg! #OPPOxRaisa @OPPOIndonesia https://t.co/mHsci8dknj Wiiii ini kegiatan visit promo radio #OPPOxRaisa Handmade Tour Yogya yaa! Jangan lupa dengerin 😊 https://t.co/SWUThFeFMz Promo VIP dan VVIP #OPPOxRaisa Handmade Tour Yogyakarta! See you tonight ya.. Aku mau mampir ke ticket box aah... 😆 https://t.co/eTRRWxZjTD Yogyaaaaa! I'm here already. Can't wait to see you all 💚 #OPPOxRaisa Ini nih lucky winner dari kontes @IndonesiaGaruda ! Super fun Meet &amp; Greet. Thank you, hope you enjoy the show! #GarudaIndonesia https://t.co/rEZ24RQDw0 Lg break, cek #GOTF2016 dulu! Bbrp jam lg! Byk promo tiket, hotel &amp; trip dgn harga istimewa, super excited! check https://t.co/QX8x1VMfGP ! https://t.co/hNHu5fIfZp Good morning, Soloooo! I'll see you tonight! #OPPOxRaisa Handmade Tour https://t.co/Y3Tk2RHylc Yesterday's highlight! What a superb experience 💙 #GarudaIndonesia https://t.co/aT1nn2J1g4 Halo Solo, malam ini jam 18.30 aku akan datang ke OPPO store singosaren, see you! @OPPOIndonesia #OPPOxRaisa Hai Guys! ikut photo contest di OPPO store singosaren yuk! karena yang beruntung akan bertemu aku &amp; nonton konser #OPPOxRaisa @OPPOIndonesia https://t.co/RYXP2czTWm Enak bgt dpt luxurious privilege di @IndonesiaGaruda Business Class! Lg hectic tour,dpt 5-star experience kyk gini? woohoo! #GarudaIndonesia https://t.co/GP5Au7yiiN Hai Solo Radio! Aku on air dikit lagi! #OPPOxRaisa Handmade Tour https://t.co/kElNioK1zL Wihiiii! Promo baru lagi buat #OPPOxRaisa Handmade Tour Solo, Rabu 26 Oktober 2016. Kita nyanyi bareng, besok ya! ❤ https://t.co/2Vf4AHZnmJ Hi guys! Kegiatan Radio Interview hari ini menjelang #OPPOxRaisa Handmade tour in Solo 💚 https://t.co/cX3XBBEfC8 Waaa tadi rame bangett! Terima kasih banyak, @yourRAISA_Solo! Tungguin promo besok #OPPOxRaisa Handmade Tour yaa. Oiyaaa, promo festival 120k dari @JuniRecords juga ada di Hello Solo / Rown Dvsn! Promo #OPPOxRaisa ini bisa kamu dapetin mulai mlm ini yaa. Hi guys! Sudah merapat ke Kedai Ibu di kota Solo? Ketemu aku yuk disana! Aku &amp; @YourRaisa_Solo mau jualan tiket #OPPOxRaisa Solo nii 😁 Promo khusus untuk Solo!! Yuk ramein! Kita ketemu sore ini yaaa 😊 #OPPOxRaisa Handmade Tour https://t.co/OcezOQfGXK Solo!! I'm hereeee! #OPPOxRaisa Handmade Tour Malang, you were beyond awesome!!! Thank you so much for coming! ❤ see you super soon... https://t.co/8JL9THOi5X Yuk RSVP Magnum Tiramisu kamu! ikutan #MagnumTweetramisu di @MyMagnumID skrg! And it also comes with these cute bags! #MagnumID https://t.co/HmfdJ9BKTP Tonight! Are you ready, Malang?  #OPPOxRaisa https://t.co/wSBoHtKMou This how we do in Surabaya! #OPPOxRaisa Handmade Tour 2016 https://t.co/Fu3T8gS6gD Malang! Mau meet&amp;greet &amp; ntn konser #OPPOxRaisa gratis? Ke Indocell skrg &amp; ikut selfie contestnya yuk @OPPOIndonesia https://t.co/8C2KEzW3gw Guys, #MagnumTweetramisu balik lg ni! yg blm nyobain Magnum Tiramisu limited edition, ada kesempatan lg nih! Yuk cek @MyMagnumID skrg! https://t.co/OtBEdu66CE Surabaya was incredible! No doubt! Malang, Solo, Jogja, jangan mau kalah 😁  #OPPOxRaisa https://t.co/lvzeiCm2J0 Ini juga. Yessss! #OPPOxRaisa Handmade Tour Malang https://t.co/7YU4NdClMe Hmmm hari ini ada promo baru buat yang di Malang. Penjualan tersedia di Gets Hotel Malang #OPPOxRaisa https://t.co/ue33790jx0 Another day, another exciting day! #OPPOxRaisa Handmade Tour Press Conference #OPPOXRaisa Handmade Tour Live in Malang! https://t.co/BmdtHCujqh Finally, sampe di Malang! Tons of bags... Let's do this! #OPPOxRaisa Handmade Tour https://t.co/sXt1HbxJBZ Hari ini gilirannya Malang! Sore ini aku dan @yourRAISA_MLG bakal jualan tiket #OPPOxRaisa Handmade Tour di OTW Food Street :D see ya! https://t.co/q3HzvzRATv Surabaya, last night was amazing!!! Thank you for last night :) Hi guys! Ticket #OPPOxRaisa Handmade Tour masih tersedia on the spot nih! Show start at 20.00 .. See you! 💖 sebentar lagi live nih! #OPPOxRaisa backstage access live on my facebook... stay tune on https://t.co/Mogp3G1llA yaaa... https://t.co/0pxRNpEFit oh iya! ini rules #OPPOxRaisa di Surabaya malam ini ya! diperhatiin ya guys, supaya lebih seru lagi pas experiencing the Handmade Journey! https://t.co/80ycSMj0JA Apakah kamu yg beruntung bisa merasakan kenikmatan Magnum Tiramisu hari ini? Yuk tweet foto/video kamu dengan #MagnumTweetramisu ! https://t.co/5yjVuOPmhd tonight! #OPPOxRaisa in Surabaya! Let's have fun together, guys! Get your tickets, now... https://t.co/1z6QDdsLkM Good morningg, Surabaya! Hai Surabaya! Mau dapat tiket Handmade #OPPOxRaisa? Datang yuk ke OPPO store WTC sekarang, trs ikutan selfie contestnya!  @OPPOIndonesia https://t.co/FllFJ8AuN1 surabaya!! muter2 ke mana ya enaknya hari ini...hmmm... oh iya, tiket #OPPOxRaisa di surabaya jg bisa juga dibeli di radio2 ini lho: gen fm, hard rock fm, sama merdeka fm lho... mau tiket gratis &amp; ketemu aku di backstage? Ikut kuis elevenia skrg di https://t.co/i5OAO2t0bU ! bsk akan diumumin pemenangnya! @eleveniaID https://t.co/3c3n3h0VcW YES! Bus #OPPOxRaisa Handmade Tour hari ini jalan-jalan di Surabaya lho. Catch them at Golden Kitchen yaa. Dijual tiket konser tournya juga! https://t.co/HG7GogHdT3 udh tau? ada kenikmatan dari lapisan pertama smp gigitan terakhir? udh cb Magnum Tiramisu? cek di @MyMagnumID &amp; ikut #MagnumTweetramisu ! https://t.co/qfjrKfGEzy Ha! I am! 😁 https://t.co/tWOJkXUp5k Good morning! Kegiatan Radio Interview menjelang #OPPOxRaisa Handmade Tour Surabaya nih. Excited 😁 https://t.co/SDA80NT06z RT @JuniRecords: Spotted! Tiket #OPPOxRaisa Handmade Tour di jual di Babeh Street, Surabaya. Come &amp; get it! https://t.co/OnzDeLOx8v Surabaya! Are you ready? #OPPOxRaisa https://t.co/pHjgRGnXQ7 Halo!! Udah nonton video ttg serunya #OPPOxRaisa Handmade Tour di Bandung? https://t.co/jqFFVd9uWv. Abis ini, aku ke Surabaya! Can't wait :D Are you excited as I am? I hope you are! Here's a little treat for you :) i'll see you soon, Surabaya. #OPPOxRaisa Handmade Tour https://t.co/d0McD2kjHE It's getting closer to #OPPOxRaisa Handmade Tour kota kedua: Surabaya! Yaaaass! Festival promo #OPPOxRaisa Handmade Tour ada lagi nih buat kota kedua, Surabaya. Get the tickets, before it's too late! :p https://t.co/duhkDiZUKp Surabaya, you're up next! Rabu depan, gak sabaaaaar!! #OPPOxRaisa Handmade Tour https://t.co/i7kjY8Aw6Z thank you bandung! kota pertama #OPPOxRaisa Handmade Tour..you are super great! thank you so much! https://t.co/LBg4qASbrW dan aku bakalan on stage sekitar jam 8 nanti mlm..so you still have plenty of time to come here, and having fun together at #OPPOxRaisa ! kalo masi blm punya tiket #OPPOxRaisa Handmade Tour di bdg,dtg langsung aja ke venuenya di Eldorado dome! byk paket seru on the spot! buat yg blm punya tiket #OPPOxRaisa , beli di venue aja yuk! ada promo on the spot special lg! https://t.co/MBpBpzDIdm Saatnya mewujudkan perjalanan impian Anda dengan harga terbaik di Garuda Indonesia Travel Fair 2016, 7-9 Oktober 2016. #GATF2016 https://t.co/Hli7mEY5tW yg udh beli tiket #OPPOxRaisa , baca peraturan ini dulu ya..biar nanti nyanyi barengnya lebih seruuuu! https://t.co/s0uwjT5eNq oh iya, thank you ya yg td mlm udh datang ke OPPO Store di BEC..it was fun! ketemu lg mlm ini di #OPPOxRaisa Handmade Tour ya! good morning! let's find a good cup of coffee to start the day.. bandung! Jam 8.30 malam ini, aku bakal datang ke OPPO store BEC. yuk ke sana yuk!  @OPPOIndonesia #OPPOxRaisa https://t.co/2v1KrhCcfz Halo yang di Bandung! Jam 8.30 malam ini, aku bakal datang ke OPPO store BEC. See You There! @OPPOIndonesia #OPPOxRaisa https://t.co/UJC4eU6cC5 this bus change the vibe within the team! if you see this #OPPOxRaisa Handmade Tour bus, snap it, record it in a video! https://t.co/ss0Jw9XdMK Guys, guys! Limited qty for VIP &amp; VVIP #OPPOxRaisa Handmade Tour Bandung. Make sure your tickets are booked! See youuuu! ;) https://t.co/TYVCpzOguy Hai semua! Hari ini ada selfie contest berhadiah tiket konser Handmade di OPPO store BEC! Yuk kesana sekarang! @OPPOIndonesia #OPPOxRaisa https://t.co/XE8kAyp9uz it's tomorrow! i'm so ready for #OPPOxRaisa Handmade Tour! yg di bdg, see you tomorrow! https://t.co/Ra2mGtTc05 Good morning, good people! :) gak kerasa, 2 hari lg #OPPOxRaisa Handmade Tour dimulai! first stop, bandung! are you ready? https://t.co/PGuVV1i58I aaaa super excited for #OPPOxRaisa , can't wait to sing with all of you!! 3 more days to go to #OPPOxRaisa Handmade Tour in bandung! udh dpt tiketnya? buy the tix at https://t.co/mlUzQnAc5s ! https://t.co/7bg4PwJrwm nah yg mau beli Festival Promo tiket #OPPOxRaisa  bisa ke @yourRAISA_Bdg nih..mereka lg open store di sini hari ini!! https://t.co/cbwScOsxLZ blm beli tiket #OPPOxRaisa Handmade tour di bdg? ada Festival Promo nih! come and get your tickets! let's sing together! https://t.co/XXX6RucYZU New episode is up on my youtube channel: https://t.co/A3XJsap8ye #OPPOxRaisa Handmade Tour bandung! blm beli tiket #OPPOxRaisa Handmade Tour? cari mbl ini,dan beli skrg! coba tebak,mblnya lg di daerah mana nih? https://t.co/yQAShJFdOh weekend special..yg di bdg,ini lokasi offline ticket box #OPPOxRaisa hari ini ya! ayoo serbuu!! @yourRAISA_Bdg https://t.co/nakp0DKNVz gak sabar! so exciting to celebrate the Handmade Journey with all of you in this #OPPOxRaisa ! bandung, have you got your tickets? https://t.co/OqA8MCuTdS masih amaze &amp; gak percaya,bisa dpt ami awards sama APM awards!! wow! i feel so blessed! let's celebrate this guys... good people, good laugh and coffee..that is enough to make a good morning for me.. good morning good people! YASS!! menang best artist female di #APM2016 !! thank you for all your supports,this is for you @yourRAISA ... https://t.co/Qp4tSHog0U alhamdulillah! Percayalah menang Duo Kumpulan Terbaik di APM 2016! woohoo! @afgansyah_reza @TrinityOptimaP https://t.co/mbKGV3ocnA thank you so much! wish me luck, guys! https://t.co/JByxk9dLwk alhamdulillah,we got it,we did it! thank you so much! @BARASUARA @JuniRecords @Msteffiano @adryboim  #AMIAwards19th https://t.co/8IFTh2x60N woohoo!! soo haappyy!! it is such a great honour!! https://t.co/pY9vikcCWF Guys! #OPPOxRaisa Handmade Tour Official Merch sudah bisa di Pre-Order di https://t.co/mlUzQnAc5s lho! Gemes2 banget, kita punya brgan yaa.. https://t.co/8kFfJ3allR Hello from me! https://t.co/zgzOJumlsQ #OPPOxRaisa are you guys ready for the new video of #OPPOxRaisa ? heads up to https://t.co/lbDUT1rV63 and wait until 18.00... woohoo! One more day 'til weekend. Hang in there, guys! Semangat! ;-D ini detailnya untuk semua official offline ticket box #OPPOxRaisa di bandung ya! https://t.co/5dfuEJXoJ1 banduunngg! skrg tiket #OPPOxRaisa udah bisa dibeli di official offline ticket box ini ya! https://t.co/BzR7rdOQWz Bandung, the time has come! go get your #OPPOxRaisa tickets on https://t.co/mlUzQniBdU .. @eleveniaID https://t.co/IaOxS2XxQP Can't wait to see you all this October... Yayyy so excited!! #OPPOxRaisa https://t.co/ebU8zgmph9 first day of the week! let's embrace every little bit of our life... shooting, shooting, seru seruan buat video OPPO Access Handmade Tour yg baru..super fun! #OPPOxRaisa banduungg! get your early bird tickets of #OPPOxRaisa now at https://t.co/9AJN9XmAPW ! limited seat,save your spot! https://t.co/sUxdJKVS5s aku punya video OPPO Access pertama dari journey #OPPOxRaisa Handmade Tour! Are you ready? Here we go! https://t.co/R7MRx6nexN pagi2 udah di studio..let's go! wooww thank you so much! it is such an honour..aaa seneengg bangeeett!!! https://t.co/kq8BDANJdE good times! https://t.co/uzFrcn4NWF time is running out! solo, yogya, dptin harga spesial tiket #OPPOxRaisa skrg di https://t.co/mlUzQnAc5s ! see you! https://t.co/8ZT9KxGsCt td mlm sama dedek2 @TheOvertunes di Music Matters Singapore..good to see you again, guys! #MM16 https://t.co/wDmly8KVmG jgn lupa yah,tiket early bird #OPPOxRaisa udh bisa dibeli di https://t.co/mlUzQnAc5s ! cepetaann, udah mau abiiss!! https://t.co/GEPuFztLn7 banduungg! get your early bird tickets of #OPPOxRaisa now at https://t.co/mlUzQnAc5s ! limited seat,save your spot! https://t.co/BZLL0xrgs2 selesai jg hari ini..hufff...what a day... ada yg udh beli tiket #OPPOxRaisa di https://t.co/mlUzQnAc5s ? early bird tickets nya limited lhooo... it's on! early bird ticket #OPPOxRaisa udh bisa dibeli di https://t.co/mlUzQnAc5s lho! ada diskon jg dari @eleveniaID ! grab it now! selamat idul adha! semoga idul adha tahun ini, berkahnya bisa dirasakan oleh semua yg merayakan ya... #EidAlAdha here you go! early bird tickets #OPPOxRaisa mulai dijual bsk di https://t.co/mlUzQnAc5s ! go get yours! @eleveniaID https://t.co/zXNvaxL3m7 makin dkt tgl #OPPOxRaisa , makin excited! nanti aku share info tiketnya yaaa... gak sabar mau nyanyi bareng kalian semua di #OPPOxRaisa Handmade Tour!! bandung,surabaya,malang,solo,yogya, be ready for this #OPPOxRaisa Handmade Tour! we are going to have so much fun!! https://t.co/Ixi4cx2Hco aku punya kabar seru lg buat #OPPOxRaisa  Handmade Tour! woohoo! super excited for this #OPPOxRaisa Handmade Tour! https://t.co/gCgdPmF2fp wiiiii!! thank you @AMIawards atas nominasinya..terima kasih atas apresiasinya..woohoo! https://t.co/rcR9W95Wgs stay tune di @Prambors ya! yuk kita ngobrolin #TentangCinta bareng2.. https://t.co/mCJWd5w5PM it's on! the official lyric video for my new single, #TentangCinta is officially out now! liat di sini : https://t.co/9hwAnbHHsY sebentar lagiiii! stay tune on my channel, https://t.co/lbDUT1JwuD ya!!! https://t.co/5T8d3nNMLs Check out Raisa's official website! https://t.co/kLBWMkCvqO are you ready for tomorrow? #TentangCinta https://t.co/OQdSwWlbtC good morning! #TentangCinta https://t.co/lssBbEIaka aku punya 2 kejutan seru buat kamu semua minggu ini..hihihi..wait for it! Some talk to you in their free time and others free their time to talk to you. Learn the difference :) minggu sore, mendung..let's grab a cup of coffee! can't believe we made it, @afgansyah_reza  !! woohoo!! https://t.co/VszqAFM5fX sunny sunday! wow! she did it again..terima kasih ya..cover version lagu Teka Teki nya seruuu!! \nhttps://t.co/FgYQsy6zgR teknologi bikin semuanya jd kerasa makin nyata ya..kyk di sini nih https://t.co/z5EqXPgAU0 sambil nunggu, sambil browsing2... nanti siang di @Iradiojakarta  nihhh...it's gonna be fun!!! https://t.co/LTUREJxRb4 a cup of coffee to get me ready for today's plans..good morning! weekend seruuu! thank you jambore nasional dan prambanan jazz...what a great weekend.. https://t.co/bUhZj9QoNo Tepuk pramuka!!! https://t.co/z08c0a0uVa chillin in bandung.. masih terharu dan sangat bangga atas prestasi ini! merinding! luar biasa...terima kasih Tontowi dan Liliyana... https://t.co/gTfkH89CHN seru bgt td nyanyi sama slank, pengunjung sama penontonnya...luar biasaaaa! hahaha! pagi ini di istana negara. terima kasih atas undangan dan kesempatannya..dirgahayu Indonesia! #RI71 https://t.co/B6pOBqibYo selalu merasa bangga bisa hadir di upacara ini..dirgahayu RI ke 71! #RI71 Singapore! I'll see you guys next month. So exciteeeed 😁 @musicmatters https://t.co/uHGnWXzd6p https://t.co/qFlJgTPA24 udh liat video baru aku di https://t.co/lbDUT1rV63 belum? waktu aku diundang ke @YouTubeSpaceLA ... keren bgt tempatnyaaaa! Dua tahun lalu sempet ke sini. Stay beberapa hari sebelum ke Baluran buat syuting Jatuh Hati! Rawon pecel, bebek kobong yummyy! Sampai ketemu malam ini @beachjazzfest Tadi sore udah sempet soundcheck dan aku punya bbrp aransemen khusus buat nanti finally, sampe juga..hello banyuwangi!! Am so excited to this month's Raisa Official Merchandise Pop Up Store! Come and check their stuffs! @JuniRecords :)) https://t.co/xl888I3k4p another winners for today #MendadakDijajanin with @eleveniaID .. seru bangeett! jajanin siapa lg yaa hari ini... https://t.co/6hQO5Yj0LR hari ini #MendadakDijajanin sama @eleveniaID ! masi ada winner lainnya nih, cek di facebooknya @eleveniaID ya! https://t.co/lwLA2fMNdX \"When you believe in a thing, believe in it all the way, implicitly, and unquestionable.\"  - Walt Disney td malam..sharing the stage with peabo bryson.. https://t.co/1bwzItdYCl byk hal seru &amp; indah di sekeliling kita.. Time Please! let's go out, dan #WaktunyaBeraksi !! https://t.co/qcp6R4Bf1X finally....jakarta lagiiii! belum tahu #MendadakDijajanin @eleveniaID  ? browsing aja hashtagnya atau klik di https://t.co/SxS0CGugth paling enak lg panas2 gini, #MendadakDijajanin es krim nih...hahaha! start each day with a grateful heart.. selamat pagi!! thank you georgetown festival! it was supeerr awesome gig! https://t.co/bD0US5wTaa i feel honored to sing with you at #RaisaKonser . thanks @Michaelmohede ,for your great voice &amp; talent. i will miss you. #RIPMikeMohede We have lost a great soul. May you rest in peace, Mike... #RIPMikeMohede are you in georgetown festival,penang? please visit my booth in bazaar area,beside Malaysia booth &amp; go get my merch! https://t.co/ktnskjRZ6S Sound check for tonight's gig at A+Sean Showcase, George Town Festival.. See you all tonight! ❤️ \n📸 by Fotokonser https://t.co/iI1OMea7mM touchdown penang..can't wait for georgetown festival! let's sing together! hello, i'm coming to penang! check https://t.co/VQ67NF42W5 for more info..let's have some fun! https://t.co/asiyA7E2aP be thankful for the little things, for they are the most important... nyanyi bareng yukk! this is gonna be super fun! see the details info in the poster.. https://t.co/SyH1G0KeQB ohiya, kalo lg belanja online, kamu sering belanja barang favorit apa sih? #MendadakDijajanin https://t.co/jgazsXmzXu playlist hari ini lagu2 lama yg all time favorite dulu..india arie! Inalillahi Wainna Ilaihi Roji'un turut berduka cita utk keluarga besar @yourRAISA. Semoga amal ibadah @qonitasita diterima disisiNya. Aamiin biar lbh gampang milih brg favorit pas belanja online, aku taruh di wishlist nya @eleveniaID ! #MendadakDijajanin https://t.co/TuhK8w2oLg siang2 mau liat barang2 yg lg mau aku beli ahh..pilih2 gini, jd banyak mau..haha! #MendadakDijajanin last sunday gig! seru bangeett! selamat ulangtahun ke 70 @BNI ! https://t.co/2XehrJ24ra today! dengerin di radio kamu yaaa... https://t.co/57n19JrrWr getting ready for today's activities, with a good cup of coffee.. good morning! about last night..nyanyi brg di bekasi yg selalu serruuuuu! thank you so much, guys... https://t.co/aFFIvjz6jb kalo nanti nyanyi brg di @OASIS_SMANSASI di @malbekasi , mampir ke booth merch aku ya! ada di samping panggung.. https://t.co/qqDVXWkt7r siap2 nanti mlm nyanyi bareng di bekasiii! this is gonna be super fun.. weekend nih! let's make plans, and have some fun! Hi! Good morning! ❤️ hello malaysia! let's sing together at \na+sean showcase! https://t.co/PbhdV9xGPl kindness is timeless, indeed.. that feeling when you find a perfect song for each one of your activity... :) duh, dari kemarin mendung terus deh.. :( tiba2 keinget serunya waktu bikin klip #RaisaKaliKedua ,hihihi.. watch it here: https://t.co/CqVuju7FEx back to normal..minum kopi paginya udh di luar kota aja.. Their #UberIceCream #MagnumCremeBrulee are here! Siapa lagi, siapa lagi? https://t.co/geDVjey3l9 Ready to deliver #MagnumCremeBrulee ! Who’s the lucky one?! #UberIceCream #MagnumCremeBrulee https://t.co/GQwaB4aZv4 semoga hari ini akan seru, amin! good morning, guys! time to get back to work! the best thing about holiday: kumpul sama keluarga dan tmn2..\nthe worst thing is: besok udah senin aja nih! mwahaha! wiihhh! kereeenn! https://t.co/EO8JLj1x1a selamat hari raya idul fitri 1437 H, mohon maaf lahir dan batin..let's enjoy the ketupat! https://t.co/KTLBGPexSJ yes, paket pesenan aku udh mau sampe! @JNE_ID masih kirim2 brg,padahal udh mau lebaran gini..cool! #KsatriaRamadhan https://t.co/hi3v75G6JQ bbrp hari lalu, aku ikutan bukber @yourRAISA .. great times! i am grateful to have you in my life..thank you.. https://t.co/nntSAnBubH akhirnya libur juga...kumpul sama keluarga, priceless... happy holiday, guys! wow, @QuranIDproject always give me chills, in a very good way, so powerful! glad to be part of this project... mlm2 bacain komen di video behind the scene videoklip #RaisaKaliKedua di youtube .. macem2 bgt commentnya! haha, thank you for watching.. this is gonna be fun! @yourRAISA https://t.co/xpRdFtfDbj See you guys!! ❤️ https://t.co/8DEUE4P1U6 Not cool. So not cool. https://t.co/PIylByVob6 yg ke jakcloth, mampir ke booth juni goods di booth no 25 ya. you will find a lot of merchandise, even the new one! https://t.co/IMlTs34I3x siap2 dulu buat nanti mlm manggung di jakcloth..akhirnya, nyanyi bareng lagiiii... udh masuk minggunya banyak acara bukber nih ya.. :p ntn Final The Voice ID 20 Juni 2016 ya! Aku akan nyanyiin lagu \"Cahaya Cantik Hatimu\", persembahan @PondsIndonesia https://t.co/2IzTHAkvWb lazy sunday..jarang2 bgt nih!! hahaha! yuk ke Jakcloth Cikarang skrg! dont forget to visit my official merchandise booth! di booth nomor 14 yah... https://t.co/VvKqnAjslV Is listening to @Prambors radio now, and hearing all this nice things about Kali Kedua and its MV! Thank youu mihihihiii *geer* ❤️ Selamat pagiii... ikutan ini deh. gampang kok, share foto menu berbuka puasa aja! cek caranya ya! https://t.co/XomGSxSlGg besok bakalan keliling radio lg..you better stay tuned on these radios! https://t.co/9n8JzwdJ4B siap2 buat @TonightShow_NET ! nonton ya nantiii... seru jg baca2 komen di video klip #RaisaKaliKedua di youtube..hihi, variatif bgt! finally, jakartaaa!! @Frizcarpohan hai! iya itu periode kuisnya. tp kalo mau submit video yg udh dibikin sblmnya, it's fine... :) here are the winners of #KaliKeduaQuiz ! bgs2 bgt videonya, sampe susah pilihnya..check their video on my youtube! https://t.co/qNcIQEzWyx diundang main2 ke #YouTubeSpaceLA ... such a coolll plaacceee!!! @YouTube @YouTubeSpaceLA https://t.co/cj4AAKPuow go to juni_goods on instagram, and find their interesting promo during Ramadhan! murah2 paket merchandisenya lho... https://t.co/YtgA4vnd9T udh nonton #RaisaKaliKedua ? what do you think of the video? can't wait to hear your thoughts &amp; comments! pakai hashtag, biar aku bs baca! #RaisaKaliKedua music video is out now! go to https://t.co/cKFae51gQa https://t.co/IFEo1aydf8 daann dpt kiriman bunga bagus ini dari @eleveniaID !! thank youuuu!! https://t.co/oX6FaLDAnB what a great day..thank you so much for all your wishes guys.. i love you all! it's tomorrow! 06.06.16 💜\n#RaisaKaliKedua https://t.co/lhaFp3HhR8 milihin pemenang #KaliKeduaQuiz susah, bagus2 bgt!! oh my god, thank you so much guys.. tinggal 2 hari lagiiii, gak sabaarr mau share ke kamu semuaaa!!! #RaisaKaliKedua https://t.co/iGvi57N0vT last chance! yg blm submit #KaliKeduaQuiz, ayo cepeettt! udh hari terakhir nih... https://t.co/pDNBpenCh3 H-3 ke #RaisaKaliKedua nih! gak sabarr bangeett! in the meantime, jgn lupa cek ke https://t.co/lbDUT1rV63 yaa.... https://t.co/4P1F6pqEwo sore ini, aku punya sesuatu dari #RaisaKaliKedua buat kamu semua..tungguin di https://t.co/lbDUT1rV63 ya! td makan ini..super goooodd! ini porsi berempat lho, hahaha! https://t.co/glQcoTGzba Seneeng! Ga bingung lg buat belajar investasi,karna di @Mandiri_OLT semua informasi pasar modal lengkap ada di https://t.co/JnUW5XuXRf #MOST Selain investasi, ternyata bs dpt hadiah jutaan rupiah &amp; dtg ke Singapore Stocks Exchange. Ikutan yuk! https://t.co/SvHJ1kDi6W #EduChallenge salah masuk toko nih, barang2 nya lucu2 bangeettt! pgn bawa pulang semua rasanya.. YAY! Akhirnya lagu Cahaya Cantik Hatimu persembahan POND’s bisa kamu dengerin sekarang! #CahayaCantikRamadhan https://t.co/q4CMSvGyCd this is it! sneak peek of #RaisaKaliKedua ! gak sabaaarrr!! https://t.co/Op1qV555DQ oh! i have something for you guys.... today was full of good laugh..hahaha! it's on! cek di sini: https://t.co/hARCSnyFKz buat ikutan #KaliKeduaQuiz yaaa... aaaa, super excited! good morning! jangan lupa cek-cek ke https://t.co/lbDUT1rV63 hari ini ya!! yeaaayyyy... besok nih! tungguin yaaa... #KaliKeduaQuiz https://t.co/YPJFYK49Ue abis beli baju yg #antidompetnangis ! bagus bajunyaa... woohoo! liat ceritanya di sini: https://t.co/Dk562xHeGr https://t.co/6WmRw3giz3 sampe surabayaaa! langsung ke kuliner favorit di sini, hahaha.. pegang tanganku, bersama jatuh cinta... #RaisaKaliKedua https://t.co/nlDibQFbtq nunggu agak lama, udh keburu bingung mau ngapain... first stop today..jgn lupa dengerin ya! #RaisaHandmade https://t.co/7SU12cGGbJ pagi2 siap2 keliling lg buat #RaisaHandmade ! let's go! @igamassardi klip sendu melagu dong! wait for it..it is getting closer.. #RaisaKaliKedua https://t.co/i0SdlPBuz2 thank you for being part of this wonderful moment last year... #RaisaKonser https://t.co/P8kT7R7tme pas bgt hari ini, setahun yg lalu, kita bareng2 seneng2 di #RaisaKonser ya..what a beautiful moment... woke up with a smile this morning. :)\ngood morning, good people! finally..jakarta..home sweet home... I am somewhere... making something for #RaisaKaliKedua.. https://t.co/IfOJrDI3NY Get ready...I have something going on, it's #RaisaKaliKedua time... https://t.co/3h6wnCBjPd transit 3 jam itu bikin bingung mau ngapain..... alhamdulillah, landed safely, somewhere...getting ready for the next exciting project! yeayyyy! yg nanti dtg ke sma 1 tulungagung, bisa beli merchandise aku jg! cari booth-nya ya..dari cd, dvd, t-shirt sampe tote bag, ada semua!  :) finally, sampai juga...hallooo tulungagung!! sampe di malang, langsung road trip ke tulungagung..i think i will be sleeping along the way..hahaha.. back in jakarta..santai2 sejenak... now airing! seruuuuu.... https://t.co/jH5c7dIt3b Good news!! Juni Goods akan buka di Barasuara #TaifunTour2016. See you there yaa! :) https://t.co/FOXLrDLP30 it's a wrap! let's go home now... kabar serunya.. ada stiker LINE aku yg baruuu dari @eleveniaID !! download di https://t.co/PntdHml5CJ yaaaa.. https://t.co/mit4Pmg0aJ oh iya!! aku punya kabar seruu hari iniii... horeee lomboookk!! tp kerja, bukan liburan....... :( keep on listening yaaa! and don't forget to share your #KaliKedua moments.. :) https://t.co/HUzUziYhbA lokasi shooting hari ini kok agak2 gimanaa gitu, hahaha...but it should be fun! have you guys follow juni_goods on Instagram? make sure you follow them, like now! long weekend is almost over..liburannya udah mau abis!! :( jgn lupa dgrin #RaisaHandmade di https://t.co/IacNGarKMq yaaa...happy weekend!!! but it's weekend! let's make some plans! dari kmrn bener2 istirahat abis 2 hari penuh keliling bandung buat #RaisaHandmade .. udh dengerin semua lagu di #RaisaHandmade? listen now! tell me which one is your favorite. :) https://t.co/7Tv37a7xqM day 2 keliling bandung buat #RaisaHandmade.. lets go! https://t.co/hNIDS0FINE oh iya! cd #RaisaHandmade sama dvd pemeran utama bisa dibeli di booth merchandise di #TaifunTour2016 nya @BARASUARA .. go get it! abis makan siang, lanjut lg promo #RaisaHandmade nya.. so fun! https://t.co/oonGjFi2F4 jadwal keliling #RaisaHandmade di banduungg! woohoo! https://t.co/yZ0SsmxLf0 halo halo bandung! siap2 mau keliling promo #RaisaHandmade ahh... Good luck for today @BARASUARA! Kota pertama #TaifunTour2016 = Yogyakarta, selamat seru-seruaaan! So sad I wouldn't be there :( sore2 santai..enaakkk! yg kmrn nanyain, skrg #RaisaHandmade udh bisa dibeli di sini nih! album, dvd pemeran utama, merchandise, semua ada! https://t.co/gDVmZQyMoZ goodluck buat @BARASUARA yg hari ini mulai #TaifunTour2016 .. have fun guys! Ngga bisa ngomong lebih bnyak selain terima kasih. Terima kasih supportnya yang gak pernah berhenti untuk aku. I'm so glad to have you all❤️ Dan bawa piala juga bareng kak @afgansyah_reza, 'Percayalah' menang Kolaborasi Paling Ngetop di SCTV Awards. ☺️ https://t.co/wDPcgndMGL Alhamdulillah.. Dinobatkan jadi Penyanyi Wanita Terbaik versi SCTV Awards semalam. Thankyou for all of your support! https://t.co/8XtZNslGxu last but not least, thank you to @yourRAISA for your endless love and supports.. you guys are the best! thank you @987Genfm , thank you @JuniRecords yg selalu dukung semuanya.. thank you @eleveniaID for your support in every step of #RaisaHandmade ..thank you @Artpreneur for the wonderful venue.. can't move on from last night #HandmadeShowcase ! terima kasih bgt buat semua yg terlibat, semua yg dtg dan bersenang senang bareng aku.. Hi guys! Jangan lupa mampir ke booth Juni Goods di #RaisaHandmadeShowcase ya! ❤️ https://t.co/Vl9Sb7x0GT yg nanti ke #HandmadeShowcase , aku sarankan jgn bawa kamera ya..nanti gak boleh bawa kamera soalnya.. good morning! today is the day, the #HandmadeShowcase day, woohoo! who's coming? besok bisa beli cd sama dvd ini jg di #HandmadeShowcase ! woohoo.. https://t.co/LVs0NZjBE3 cant wait for #HandmadeShowcase tomorrow! degdegan paraahhh.. Behind the scene recording #RaisaHandmade. It was a fantastic moment for me!! What do you guys think about #Ra... https://t.co/wRo54vyWUE Keseruan Indonesia Morning Show pagi iniii !! Thanks buat semua yg udh nonton yaaa ❤️ https://t.co/GNywSobieF buat yg dpt golden ticket di #RaisaHandmade boxset.. you are invited to #RaisaHandmadeShowcase ... https://t.co/Kn2hdLX7uL H-2 ke Handmade Showcase! aaaaa, super excited, super degdegan! Woohoo! Abis tanda tangan untuk pertama kalinya di album #RaisaHandmade niiih. Feels unreal &amp; it gives me chills 😅 https://t.co/jE0fzpOhoB ada yg udh dpt kiriman #RaisaHandmade boxset ya @yourRAISA ? share dong fotonya... :) hari ini pengumuman pemenang kreasi Handmade nih! tungguin di @eleveniaID ya.. #RaisaHandmade #klikcarihepi dari kmrn2 liatin kreasi Handmade yg disubmit, keren2 bangett! byk bgt yg lucu2! @eleveniaID #RaisaHandmade Gemes nungguin webseries #RaisaHandmade di upload! Masih 50% lagi!! Gak sabar buat kalian nonton niii! Huaaa Hari ini seharian aku full phone interview! So excited!! 😁 Lucu banget liat orang dewasa yg diajarin sm anak kecil buat kenalan sm org baru. liat deh: https://t.co/uqnnRsudRJ https://t.co/TEc99VB7XF hari ini bener2 keliling promo #RaisaHandmade ..capek, but it's fun! another good news from today, i'm all over itunes and apple music! whoaaa, gak nyangkaaa...i am super flattered! :) https://t.co/rEAoNUuxKV album baru udh rilis, skrg degdegan..haha! semoga semua suka albumnya.. #RaisaHandmade the wait is over! my new album is officially out. get it on iTunes, or hear it on Apple Music, now! #RaisaHandmade https://t.co/aapbCg18cp wake up, smell the coffee, and cherish the day..good morning, good people! thanks to you..yes you!! tunggu boxsetnya sampai di rmh yaaa... #RaisaHandmade https://t.co/aj8T9XdbsP see you this weekend! https://t.co/lAwy22tmUP #RaisaHandmade boxset ... SOLD OUT!!! woohoo, thank you so much, guys! https://t.co/ERUhcKIEAG @yourRAISA_PLU ini hari terakhir! masi ada yg blm dpt preorder #RaisaHandmade boxset? masih dibuka lho ternyata di https://t.co/mlUzQnAc5s ! https://t.co/x7mxqdJauY Waaa, hampir jam 19:30! Last chance to get #RaisaHandmade Boxset is today!! Standby yaa di https://t.co/mlUzQnAc5s :) 1 jam lg! hari terakhir preorder #RaisaHandmade nih..udh siap2 di https://t.co/mlUzQnAc5s blm? https://t.co/ltUIdkqEXy last day to preorder #RaisaHandmade on @eleveniaID ! grab it fast, udah tinggal sedikit bangeettt....good luck! :) masi ada yg blm dpt preorder #RaisaHandmade ya? masih ada hari ini sama besok! tinggal 2 hari aja...grab it fast! limited stock! anywayyy, seneng deh denger kabar kalo udh banyak yg berhasil preorder #RaisaHandmade boxset..thank you! kalo lg gini, bingung mau makan apa.. :( astaga, hampir kelupaan! video #RaisaHandmade Journey minggu ini udh ada di https://t.co/lbDUT1rV63 ya..go watch it! :) oh iya, mlm ini jgn lupa ntn ini ya di @TRANSTV_CORP ..yg nyanyi seru2 bgt! https://t.co/jAtuHyiQtY jgn lupa, yg blm dpt #RaisaHandmade boxset, nanti mlm preorder masih dibuka di @eleveniaID yah! cepetan, udh mau abis! it's weekend, let's have some plans! kpn terakhir kenalan sm orang br? Mungkin video ini bs bkn kamu lbh mdh kenalan sm orang br https://t.co/uqnnRsudRJ https://t.co/XS2U5bQUY1 duh, video #RaisaHandmade Journey-nya blm bs diliat di youtube..maaf ya..semoga bs cepet ada di youtube aku ya! @Mithacimit adaa dong..tp agak malem ya.. buat yg blm dpt preorder #RaisaHandmade ,ini tipsnya! jam 19.30, preorder di https://t.co/mlUzQnAc5s . good luck! https://t.co/62kngJ4yd3 huhuhu, banyak yg blm berhasil sama blm dpt preorder #RaisaHandmade ya ternyata.. :( siapa aja yg udh berhasil preorder #RaisaHandmade di @eleveniaID nih? :) setengah jam lg! yg blm dpt #RaisaHandmade boxset, masih bisa preorder di https://t.co/mlUzQnAc5s .. good luck! Siap-siap buat preorder #RaisaHandmade Boxset 15 menit lagi di https://t.co/mlUzQnAc5s Good luck! https://t.co/nPwGUKnZZe yeayy! congrats! guys, you must hear this new song by @SondoroMusic . . great tunes! https://t.co/A3hLLQYCp4 who's got the #RaisaHandmade boxset tonight? kalo ada problem pas pemesanan, sabar2 ya...coba terus! :p siap2 preorder #RaisaHandmade boxset lg nanti di https://t.co/mlUzQnAc5s ya! dibukanya mulai jam 19.30 jg nih.. https://t.co/jCITh9omu4 it's The Green Ogre! follow Shrek The Musical to @Artpreneur #ShrekTheMusicalJKT #Shrektacular #ciputraartpreneur https://t.co/ltuO0wyoDP it's open! now you can preorder #RaisaHandmade boxset on https://t.co/mlUzQnAc5s ! woohoo! 15 menit lg bisa preorder #RaisaHandmade di https://t.co/mlUzQnAc5s .. aaaaaa, degdegan!! this is it, 2 jam lagi! nanti jam 19.30 kamu udh bisa preorder #RaisaHandmade di @eleveniaID .. woohoo! https://t.co/gKXSs8gBOa nanti mlm, preorder #RaisaHandmade dibuka! super excited! siap2 di @eleveniaID  yah.. anyway, makin deket banget nih! besok udh bisa preorder #RaisaHandmade boxset! tungguin di @eleveniaID ya.. https://t.co/51wq35HJie td manggungnya di central park seruu! thank you guys for coming.. jd yg pertama dgr full album #RaisaHandmade brg aku yuk! ikutan di https://t.co/07y291HhF7 yaaa... @langitmusik616 https://t.co/QO30BHE2JP @Mithacimit ada kok, ini videonya.. how to order #RaisaHandmade boxset.. :) yg mau preorder #RaisaHandmade boxset, lihat caranya di sini ya: https://t.co/leJ41GkfzR ..jgn kelewatan ya,ada kejutannya! :p Anywho, gak berasaaaa H-2 preorder #RaisaHandmade Boxset! Stay tuned on https://t.co/mlUzQnAc5s yaa ❤️ https://t.co/LJBgytwnOw Rabu ini, 13 April aku ke Palembang dan seru-seruan lagi bareng @sheilaon7, mark the date, i'll see you there guys! https://t.co/sNGvn88nab sebentar lagi! can't wait..make sure you pre-order #RaisaHandmade! https://t.co/NYJVc88Hdq sore2 punya kabar seru, kok jd kesenengan sendiri ya? hihihi... Have you pre-order #RaisaHandmade yet? Go get them, guys! Only on iTunes ❤️\n https://t.co/dBkaQSo5Qx be the first, be the vip! #RaisaHandmade https://t.co/LV7IDVreGd dengerin #RaisaHandmade full album bareng2 buat pertama kalinya seru kali ya.. Calling YourRaisa Pekanbaru, mampir ya ke booth Raisa official merchandise! ❤️❤️ udah ada yg hafal liriknya Kali Kedua? go watch my official lyric video for Kali Kedua! biar kita bs nyanyi bareng! https://t.co/huO5v8gUYv see you tomorrow pekanbaru! https://t.co/WzvbAvDiC5 My newest video - Official Lyric Video Kali Kedua! \nGo check them out!😝✌️ \n#RaisaHandmade https://t.co/dIHVRAN5hp yg mau UN, semangat ya UN nya! jgn takut, yakin dan percaya kamu bisa ngerjain dgn baik. believe in yourself..semangat!!! pagi yg cerah di awal minggu..good morning, good people! tahu2 udh di jkt lg..nanti jam 3 nyanyi bareng di summarecon bekasi ya! hmm, nyanyi kali kedua nggak ya........ new #RaisaHandmade video is out! abis single Kali Kedua, aku punya kejutan ini! https://t.co/MedWIQw2vH whoaa, kereennn! jd inget jaman dulu ya, haahaha...thank you so much @Generasi90an ! https://t.co/qnfkxANX7r alhamdulillah,terima kasih respon dan apresiasinya buat single baru aku, Kali Kedua. seneng,terharu, dan masih gak percaya.. #RaisaHandmade Out now! 'Kali Kedua' from my new album Handmade ❤️\n#RaisaHandmade https://t.co/R17eDCXVyX RT @AppleMusic: .@raisa6690 has a special gift for you. Pre-order her new album now! https://t.co/fociM4KsU0 https://t.co/q842P8teNF Raisa - Handmade - https://t.co/sKeAutxg1n #iTunes #RaisaHandmade liat itunes, #RaisaHandmade udh bs preorder! dan hari ini, single Kali Kedua akan diputar serentak di radio! what a great morning.. Woot! Oiyaa, besok kamu bisa mendengarkan single 'Kali Kedua' di radio-radio kesayangan kamu. #RaisaHandmade https://t.co/QpaDinu0Md Be prepared! H-1 #RaisaHandmade https://t.co/ykUzfEFVAH H-1! Can you tell that i'm so nervous right now? So excited! Yet so nervous!\n\n#RaisaHandmade https://t.co/7HxRW40mek aaaa makin deket tanggal pentingnya, makin degdegan! can't wait for you guys to hear #RaisaHandmade .. I'm so excited!! 2 hari lagi kalian bisa pre-order #RaisaHandmade di iTunes! https://t.co/Yt0kw6X5vL @tiaqiftia iyaa td salah pencet pas pilih videonya, haha! are you ready? #RaisaHandmade https://t.co/3nHBdNAeM4 abis seharian kerja, lg santai, tiba2 dpt kabar bagus.. yes! #RaisaHandmade Counting days to #RaisaHandmade album! ❤️ @AppleMusic  https://t.co/Z284hAt96O finally! video ketiga #RaisaHandmade bisa diupload..you can now watch it here: https://t.co/9fGUnoCRXA !! woohoo! alhamdulillah! i have a good news for #RaisaHandmade third video! Surabaya! abis makassar yang super seru, nanti kita nyanyi bareng seru lg di SSCC Supermal ya! @yourRAISA_Sbya https://t.co/XJCCZn3ohV Huaaa #RaisaHandmade episode 3 belum berhasil di upload! Huhuhu maaf yaa! :( duuhhh! video #RaisaHandmade Journey yang hari ini telat kyknya niihh! ada trouble sedikit..tunggu yaaa :( Terima kasih untuk semua pertanyaan #RaisaHandmade! It's been fun! Ohiya, buat yang udah telfon tadi terima kasih banyak jugaa! See you soon @dwiwlestarii Semangat ya! Iya nih HP-nya bunyi teruuuuusss Hi guys! Aku sudah standby, segera menuju ke https://t.co/9U8kHy79sZ dan kamu bisa tanya-tanya tentang #RaisaHandmade! Guys, stay tuned ya besok di https://t.co/9U8kHy79sZ! I'll answer questions from all of you about #RaisaHandmade https://t.co/Ygr7rO4ndJ apalagi ya, hmm, #KarenaTwitter aku bisa berbagi passion, berinteraksi sama semuanya, dan bisa share apa aja! :) hmm, #KarenaTwitter aku jd bisa kepoin anak2 @yourRAISA ! hahaha! waahh, @TwitterID ulangtahun ya? congrats twitter! so many things happen in twitter... :) Wohoooo thank you @987Genfm  https://t.co/VMsZirJA2A Temen-temen Pekanbaru, 6 April ini aku akan perform bareng @sheilaon7 lho! Mampir ya! 😊 cc: @nuscomm @skyentertaint https://t.co/erJ7zjSCit It's hereee! Watch Handmade Journey The Interview episode 2 on https://t.co/TzSPG9KUs3 #RaisaHandmade hari ini video baru! gak sabaaarrr!! #RaisaHandmade https://t.co/dnRyfISCu0 secangkir kopi enak di pagi hari emang bisa bikin hepi! good morning! :) video #RaisaHandmade Journey buat minggu ini akhirnya selesai..can't wait for you guys to see it! @adamboedsho pastinya bakalan ada #RaisaHandmade boxset...tungguin yah.. @kristianti_fany galau? hmm, ada gak yaa... :p @anju743 insyaallah bisa dibeli. salah satu caranya, #RaisaHandmade nanti akan dijual online jg. supaya semua bs beli.. @inuMIM knp gak? aku pernah kolaborasi sm @yourRAISA tp bkn nyanyi, tp waktu konser di sby. tanya deh ke @yourRAISA_Sbya . :) @ForTiyudh iya nih, malahan nanti boxsetnya pertama kali dirilis akan dijual online.. Hahaha!! Ngakakkk. Good luck guys! https://t.co/KtO0r8gOKS @Lala_Vielyla rencana konser pas launching #RaisaHandmade ada..nanti aku update infonya ya.. @uthi_frida ada boxsetnya lg kayak album kedua. tp boxset #RaisaHandmade bakal lbh seru! :) Today!! Make sure you stay tuned on my Youtube channel: https://t.co/IqQFD4oaCh https://t.co/IYk8iCRDp9 jgn lupa ya, nanti jam 6 sore, ada video baru #RaisaHandmade di https://t.co/lbDUT1rV63 ... https://t.co/rr8VN7ARhC oh iya, happy bday @eleveniaID ! wah asik nih,hari ini aku mau bikin sesuatu yg seru! tungguin di periscope-nya eleveniaid ya.. get up and don't forget to sip your coffee. good morning! woohoo! thank you Oz! https://t.co/SP8PdQOmSR gerhana matahari total tuh memang ajaib bgt ya.... before you go to bed, make sure you watch my new video at https://t.co/lbDUT1rV63 .. goodnite, good people! :) boothnya blm dihias tp, huh...  -_- yg ke coopfest 2 di bdg hari ini, you can have my merchandise! mampir aja ke booth F2 ya.. https://t.co/TaOH6zpXBH Raisa's next journey: Handmade. Coming soon! #RaisaHandmade https://t.co/qiIN16aFmc nanti malam kita nyanyi bareng di sini! it's gonna be super fun! https://t.co/FkhaUsrZ3O halo halo bandung. selalu senang ada di kota ini.. RT @JuniRecords: Have you seen it yet? https://t.co/uNFga89zlb #RaisaHandmade jam 6 nanti, bakalan ada sesuatu di https://t.co/9U8kHy79sZ dan di https://t.co/lbDUT1rV63 ! make sure you guys watch it! #RaisaAlbumTiga javajazz! who's coming? ada merchandise aku jg di booth merchandise ya..go get them! :) yuk klik https://t.co/hnObUHagDC, dan kita lunch bareng2 sama @eleveniaID juga! coba deh follow LINE elevenia, sekarang! #LunchBarengRaisa biasanya aku suka bikin atau ikutan dinner bareng. kalo bikinnya lunch bareng, seru kali ya..? aku punya sesuatu dari #RaisaAlbumTiga di https://t.co/9U8kHy79sZ . check it out now! :) siap-siap!!! #RaisaAlbumTiga https://t.co/63liZLQzyz sampai di medan..udh lama jg ya gak ke sini.. Cita-citaku #singer. bs trs berkarya &amp; bernyanyi utk semua. Aku #WajahBaruIndonesia @pondsteens https://t.co/OYkmklfzVV calm and soothing moment on the weekend...listening to some of my favourite tunes. senang! another good day at the studio. senangnyaaa.... what a great day in the studio, thank you guys so much! you know who you are.. :) masih kebayang serunya bikin project di weekend kemarin..can't wait for you guys to see it! good morning! Morning! Excited bgt buat kegiatan hari iniiii! Anyway, have a good day to all of u❤️ landed in malang, see you guys sore ini di Sarinah Cineplex yaaa! RT @jokoanwar: Makin byk pekerja seni Indonesia tampil di panggung dunia, makin pengen kita ninggiin standard. Kita bagian dr dunia. Bukan … gak nonton grammy awards dehh.. :( See you! https://t.co/GVZrnLifKU off we go! see you guys! eh tapi mendung bgt ya.. seru bisa ikutan on-demand Uber https://t.co/R5TCjjqjRU . makasih Uber utk liontin berlian cantiknya! #UberLOVEID https://t.co/3Eq89SEYEG makasih yaa, it was fun! :) https://t.co/mA41Z3IvFy RT @OreimaFilms: Besok film Terjebak Nostalgia akan tayang secara exclusive screening. Yang udah gak sabar liat akting perdana @rais… https… personally,aku minta maaf filmnya blm tayang hari ini. thank you antusiasme &amp; supportnya utk aku. info filmnya bs dilihat di @oreimafilms ya whoaa dpt liontin berlian cantik dan dikirimin langsung ke aku! mau jg? tungguin bsk ya.. #UberLOVEID https://t.co/XVPHT0cPBg lg dengerin hasil rekaman2 di studio..exciting! few of my happiest things! Liat di https://t.co/7f3QgCVo7e &amp; pakai kode RAISAHEPI buat diskon tambahan!#klikcarihepi https://t.co/r1swlLyjjB smbl nunggu penjelasan dari @OreimaFilms soal film, lagunya @Maruli_Tamp7 sama aku yg#BUTTERFLY udh bs di beli di https://t.co/7xkcoBmOL3 ! td ke ktr @eleveniaID gangguin org kerja,haha! seru bgt, thank you for having me guys! #klikcarihepi https://t.co/nTvd2meJJA So happy to be an elevenian! Guys, ikutan ke ktr elevenia ya! LIVE di Periscope @eleveniaID ! #klikcarihepi https://t.co/j7ilnCPCr8 sebentar lg, can't wait!!! #terjebaknostalgiathemovie https://t.co/VHd72axZZ5 \"hujan bisa buat orang jadi puitis ya...\" RT @967HitzFM: Berani dong twitpic foto sama mantan lo di #HitzFMTerjebakNostalgia buat menangin Dinner sm Raisa &amp; Maruli? :p https://t.co/… hari ini libuurr, yeayy! time to get some rest... zzzz.... H-7 #terjebaknostalgiathemovie tayang di bioskop. can't wait for you guys to see it! makin degdegan... https://t.co/XDJHRew9Fg last stop for today! ngobrolin #terjebaknostalgiathemovie di @TraxFMJKT .. https://t.co/e5EoQroCN6 RT @okezonenews: di #kongkowOkezone hari ini akan ada @raisa6690 @Maruli_Tamp7 @Iskak. Yuk gabung di https://t.co/nVFEBAN3Gt https://t.co/8… senangnya gala premiere #terjebaknostalgiathemovie td mlm rame, seru dan lancar! alhamdulillah.. semoga semua suka filmnya, amin.. Just finished Press Conference #terjebaknostalgiathemovie! Sooo excited for gala premiere tonight! Woohoo😍 https://t.co/Jdai6yfPKU #throwback brg @Maruli_Tamp7 sama @Iskak ..enjoying NYC while filming #terjebaknostalgiathemovie ! https://t.co/kWMXKlSB8W @andiraa degdegan nih! maluuuuu great cup of coffee to start the day. masih gak percaya, akhirnya hari ini dateng jg..super excited! #terjebaknostalgiathemovie halo, halo bandung! https://t.co/J9ML5h7ytB back in j-town, back to studio! rekaman hari ini seru nih pasti.. seru kali ya kuliah lg..hihihi.. waaa, aku nemu universitas yg bgs2 di https://t.co/1aH5xgS0jK nih! kalo aku kuliah lg, gimana ya? haha! https://t.co/39835CNjSf #easyuni kalo liat anak2 kampus, jadi inget seru2 nya jaman kuliah ya.. Promo Terjebak Nostalgia the movie di Sarah Sechan show ❤️ https://t.co/P7digiL1PT oh iya! jam 1 siang ini, jgn lupa nonton @SarahSechan_NET ya! aku akan nyanyi sesuatu yg spesial! can't wait for you guys to hear the song! kemarin habis seru seruan sama tim @JuniRecords , hari ini langsung kerja seharian! but, today will be fun! Semoga berita barusan menjadi awalan yang baik utk tahun ini. Bismillah!! Have a great day everyoneeee Alhamdulilah dapat kabar baik semalam! \"Percayalah\" jadi kolaborasi Terdahsyat 2016! Thank you so much everyone! ❤️ https://t.co/nNvXODTpiO great way to start the weekend! makasih yg udah nyanyi bareng aku tadii.. https://t.co/EH8cApcosE photoshoot hari ini seru..bajunya lucu2! this! film pertama aku, #terjebaknostalgiathemovie . pengalaman baru buat aku! 11 februari 2016 di bioskop! https://t.co/LzzqP39o11 aku punya special announcement mlm ini! excited!! hari ini mau ke studio lg. seruuu!! good morning! always start the day with gratitude. but, where's my coffee? @yourRAISA yeaayy! udh gak sabar mau nyanyi bareng lg!! hari ini tiba2 kerja.. libur telah usai....... Guys, wherever you are, please stay safe! #PrayForJakarta lg denger2 hasil workshop kmrn..can't wait for the next workshop! enak jg ya libur gini..hihihi..family time! i'm ready. bring on 2016! \nhttps://t.co/lbDUT1rV63 first day of the year! #SelamatTahunBaru semuanya! semoga taun ini lbh seruu lg!!! https://t.co/y6c3jEnT9g Seneng bgt bisa ngabisin malam thn baru di Surabaya.. Mari countdown ke 2016 bareng di SuTos!!! ❤️ see youuuu Earlier today ❤️🎤 it has officially begun! #RaisaAlbum3 https://t.co/C71cbxMn0L pesannya pokoknya @yourRAISA_Sbya hrs dtg ke @sutossurabaya di NYE 31 des 2015 nanti ya. Pasti seru bgt nih! @sutossurabaya waaa! Berapa lagu ya... Rahasia ahh, banyak deh pokoknya! Makanya semua hrs dtg ke sutos ya pas NYE! :) @sutossurabaya aku sm band aku lg siapin setlist yg istimewa dan aransemen yg beda jg,khusus utk arek2 suroboyo &amp; @yourRAISA_Sbya ! @sutossurabaya hi hi! Skrg lg promo Percayalah aja nih. Trs,aku jg lg seru2 nya masuk studio buat album ketiga! Super excited! RT @sutossurabaya: Selamat sore, sebentar lagi kita akan chit chat dengan @raisa6690. Let's spend New Year's Eve together! Kita seru-seruan di Surabaya Town Square pas malam tahun baruuu❤️❤️ see ya! https://t.co/D1HPpOnZQh See you!! ❤️ https://t.co/z6b6ZwF9uj Kemarin malam, sama Mba Anggun 😊😊😊 (my dress by Maria Ruth Fernanda, pict by @viani_oktha) di We Love Disney Concert https://t.co/zKyHk1ov6D Todayy! Jangan sampe ketinggalan #WeLoveDisneyConcert di RCTI jam 16.00 WIB yaa! 💖 https://t.co/wyLDEn83mt Thn br pada kmn? Cari2 di @Traveloka app deh, lg byk bgt promo seru! gmn kalo kita nyanyi bareng di Surabaya lg aja? https://t.co/oFoOfSDcH5 gak kerasa, sebentar lg tahun 2015 udh mau abis aja ya.. Selamat hari ibu untuk semua wanita tangguh kesayangan ❤️ https://t.co/cC4Nw97JPo Thank u buat semua yg udh dngerin radio2 yang kita datangi hari ini! Hope you all enjoyed #AfganRaisaPercayalah ❤️ https://t.co/A4w8NTlQs6 &amp; don't forget to check out the music video! 😊 https://t.co/IaRDXxnML1 ❤️❤️❤️ https://t.co/uOLNn9dOqc Kemarin, rute yg sangat panjang dalam sehari; Malang &gt; Sby &gt; Jkt &gt; Purwakarta &gt; Cirebon. Capeknya terbayar sm energi penonton malam ini! :) LDRan di Purwakarta. Thank youu ❤️ https://t.co/MsKuNg6axA Udah siap untuk HUT ke 16 Radar Cirebon 🎤🎤 https://t.co/4L7vCPdILf LDRan di Purwakarta. Thank youu ❤️ https://t.co/pFtrruAfNc Have you seen it yet? Video clip #AfganRaisaPercayalah hari ini udh keluar exclusively di Line! Go go go! ❤️ https://t.co/MXTKDSeCFP always start the day with gratitude..good morning, good people! :) Thank you Limitless!!! ❤️❤️❤️ https://t.co/vrXoFLHKZ4 Asli. Gak sabar rilis videoklip Percayalah! ☺️☺️ cc: @afgansyah_reza https://t.co/xT1W5u2kUj happy anniversary #TRANSMEDIA14 !! semoga acara2 nya makin seru dan keren! @TRANS7 @TRANSTV_CORP Hihihiiii sticker Line terbaru aku udh bisa di download !! Have fun 😹😹😹 ada yg versi @afgansyah_reza jugaa lho. https://t.co/AcfzHZlM6Z If I tell myself 10 years ago, that this would happen, I wouldn't believe me. Wish me luck for tomorrow!! #myhero https://t.co/kZ1lAURcwa Percayalah bareng @afgansyah_reza tadi sore! 😊 https://t.co/mgqBH033hq Thank you semuanya!! https://t.co/QwAY5tgUnD yuukk jd tamu istimewa #afganraisapercayalah ! ikutan sekarang yuk! https://t.co/jMvmH2li1P good morning! hari ini bakalan meeting seharian sama @JuniRecords . but first, where's my coffee? hari belanja online nasional! buka @shopee_id trs cari toko 'Raisa'. ada barang2 favorit yg aku jual! #Shopee1212 https://t.co/lc3hAoybXI the feeling of browsing for your favorite things, and got them in a very good deal! whoop! ❤️❤️❤️ https://t.co/3t8LOQT7Zp Thank you @yourRAISA_Mks buat oleh2nya!! Aku rebahan sebentar, and see you soon on stage! Whoooop ❤️ Siang ini, rekaman drama radio \"Terjebak Nostalgia\" w/ tante Dewi Irawan 😘✨ https://t.co/rTaKMLGRlU \"When the power of love is greater than the love of power, the world will know peace.\" ❤️❤️ https://t.co/ZwuP6vnOKK seneng bgt ketemu banyak orang di #InfluenceAsia ..what an experience.. In Singapore with Tiffany! ✨ https://t.co/HzZP5Daqjj Jay Park shoutout on my snappy ✨ https://t.co/xEQdxZ6s3p How cute is Ye Bin???!!! ❤️💋 https://t.co/yAoQ32K0iQ Selesai promo radio hari ini.. Thanks for everyone that tuned in !! https://t.co/KoYZqcAVfg Now on air at RIA FM Singapore 89,7 FM touchdown singapore! degdegan jg mau perform bsk di #InfluenceAsia 2015 .. sepanggung bareng Tiffany SNSD nih..hihihi.. sampai ketemu nanti mlm di sabuga ya. eh, ada booth merchandise aku jg lho di sana. make sure you get one! :) https://t.co/145pVyjjx8 TGIF! Weekend ini mau trip ke mana? cek @traveloka deh, ada diskon hotel sampe 125rb lho! https://t.co/HcnlQmVq72 https://t.co/41dKgd1ZVe the feeling of having a super good workshop yesterday. gak sabar pengen workshop lagi! semoga bs dpt lagu2 bagus... see u at @influenceasia 2015 with @DandeeBKK @GarethFernandez @Flizzow @ItsSonaOne and @Shigga Shay! #InfluenceAsia https://t.co/uJFms7V89P Hai semuanyaa, just wanna say hi and I wish you all have a nice day today! :) Pagi ini #AfganRaisaPercayalah di Inbox SCTV. Good morning! ✨ td salah sebuutt! maksudnya Bocah Petualang @TRANS7 yg jd program anak2 terbaik. maaf salah sebut yahh..congrats for you guys! Photoshoot siang ini. Aku lg ngetawain apa sih??? @afgansyah_reza https://t.co/i9upEpD395 Percaya diri itu penting. Pamerin bakat kamu dong! Duet bareng aku aja yuk di https://t.co/64FALPxBuV! Kalo km bertanya, \"kenapa sihh harus beli karya original?\" Penjelasan di gambar ini sangat menyentuh, please read 😊 https://t.co/ORMNnUu6qY bsk di @JGTCfestival jg ada screening perdana teaser project film aku, #terjebaknostalgiathemovie ! @OreimaFilms https://t.co/bQTHjq6HJd besok! kita ketemu di @JGTCfestival yah.. lots of great musician will be there, nice! https://t.co/1XXUyP8Qrv kejar cita2 butuh semangat.tunjukin dgn ikut Pond's Suara #WajahBaruIndonesia ! bs dpt gadget&amp;voucher belanja! klik https://t.co/RoU2zoKfSf 2 minggu yg lalu, jam segini aku lg keliling buat #RaisaKonserSBY, in comfort &amp; style inside @Bluebirdgroup's car! https://t.co/nqOmA4Phza aku bke 3 tmpt dlm 1 hari! dr mulai jln2 sendirian,sampe pas bertiga sm tmn2 aku,selalu seru &amp; comfy! thx to @Bluebirdgroup ! good day! udh nonton video baru aku? seru bgt sih jln2 di surabaya pas #RaisaKonserSBY .. aku punya video baru! go to my youtube page, https://t.co/lbDUT1rV63 and take a look at how i spent my time in surabaya.. #RaisaKonserSBY capeknya #RaisaKonserSBY gak kerasa deh di @HARRIS_gubeng! The coziness felt just like home. :) https://t.co/6fiJF9eqfy the city, the people, the food, the atmosphere.. super cool! #RaisaKonserSBY still remember every moment i spent in surabaya during my #RaisaKonserSBY .. it's been over a week..but the excitement and euphoria of #RaisaKonserSBY are still in my heart and mind.. :) Selamat hari guru terutama untuk guru2ku yang sampai hari ini, doanya terus menyertai aku. Terimakasih banyak Bapak &amp; Ibu guru! ❤️ Good morning everybody! Fill your heart with so much love that it doesn't have room for hate ❤️❤️❤️❤️❤️ Wihiiiw congrats Mba Mita!! https://t.co/q5xPP7egNF Finally, my management &amp; record label created a Twitter account! Follow them (@JuniRecords) for more information on my releases! :D Hi guys, 1 jam lagi ya. Get ready! https://t.co/Q2CFODCbwL Wooho! Selamat pagii https://t.co/vltIK4JzHj Follow me on snapchat; raisabackstage. Good morning!! https://t.co/CQXXlEwxof never imagine that vacation can be this relaxing...afterall, family time is always relaxing.. :) Hi all! Please do follow Apple Connect aku yaa! Caranya gampang banget cari aja Raisa di Apple Connect, terus follow deh. 😝 Enjoying my day off.. Family timeee with my cutie Anya! Anyway, karokean yuk! Nanti kita bisa duet brg! Caranya gampang bgt.. Cek deh https://t.co/64FALPxBuV #tomodachi https://t.co/AVpdLyymgQ Hahaha seruuu banget baca mention yang masuk ke account aku kayanya lagi pada males-malesan yaa? Paling enak kalo mendung-mendung gini tuh: baca buku, minum teh, sambil dengerin lagu... Setuju gak? Hi hi! Don't forget to tune in to Trans TV tonight! Right at 21:00 #AfganRaisaPercayalah Hi guys! Terima kasih banyak untuk semua nya yang semalem dtg ke #RaisaKonserSBY! It was one of the best moment in my life... Thank youu❤️❤️ Mirip gak? 😁 https://t.co/BnGYLo0r2T The wait is truly over! Guys, kalian udah bisa beli Raisa Official Merchandise exclusive di #RaisaKonserSBY! Yayy! https://t.co/MmghEzCWJI ....and tonight #RaisaKonserSBY. I hope we'd having fun tonight! (Ps: ticket masih dijual on the spot, leggo!) https://t.co/Hc3JVEz2Rp siang! kamu yg beli tiket #RaisaKonserSBY VVIP, ini rules meet&amp;greet sblm konsernya mulai ya! https://t.co/asEKLVmNEL bsk tiket #RaisaKonserSBY bsk di DBL Arena mulai jam 10 ya. masi ada promo buy 1 get 1 free VIP &amp; diskon 10% Brown! Get your ticket! tiket #RaisaKonserSBY yg Festival udah sold out! Alhamdulillah! yg VIP masih buy 1 get 1 free lho bsk di venue! https://t.co/W7Q3PA4zdE H-1 #RaisaKonserSBY! Yg blum punya tiket, besok masih dijual on the spot. Gak sabar nyanyi bareng, karaoke massal :) https://t.co/NJGoCqFsTq Guys! Udah jam 4 lewat. Cpt dapetin tiket buy 1 get 1 di Folks Coffee &amp; Tea, segera guys! Besok kita karaoke massal di #RaisaKonserSBY ya! H-1 #RaisaKonserSBY! Rehearsal, rehearsal and rehearsal. Bismillah... ada yg lg beli tiket #RaisaKonserSBY di folks coffee&amp;tea? ada promo buy 1 get 1 kalo beli di sana hari ini! hmm, mampir ke sana lg gak ya? Sending my thoughts &amp; prayers for those who affected in Paris. #PrayForParis hope everything will be ok.. Please do take care. Moin moin! Hari ini mobile ticketing box #RaisaKonserSBY akan stay di Folks Coffee &amp; Tea dari jam 1-4 sore ya rek! See you😘 Hi! Aku lagi di folks coffee &amp; tea lho! Ayo kesini beli tiket #RaisaKonserSBY https://t.co/Qwx5dfnWHd ada yg lg beli tiket promo #RaisaKonserSBY di Folks coffee&amp;tea? siapa tahu kita bisa ketemu.. :p https://t.co/bMwRQ319Sv presscon kmrn,degdegan! yuk nyanyi brg di #RaisaKonserSBY . ada promo buy 1 get 1 free di folks coffee&amp;tea hari ini! https://t.co/hw3GKfafSd #RaisaKonserSBY is getting closer! Super excited! Skrg, keliling Surabaya dulu ahh! For today: Mobile Ticket Box #RaisaKonserSBY di Folks Coffee&amp;Tea. Masih promo, buy 1 get 1 free! ❤️ see you all.. 😝 https://t.co/LZiHbCEXAo Yesterday was amazing! Dpt kesempatan ktmu banyak org, semuanya seruuu dan makin gak sabar #RaisaKonserSBY 😍 nah,buat yg udh beli tiket #RaisaKonserSBY di cushy sutos hari ini,jgn lupa ambil tiket meet&amp;greet ya. skrg aja! :) https://t.co/FapUq5LwqE yg blm beli,dptin buy 1 get 1 free vip &amp; festival #RaisaKonserSBY di cushy,sutos,hari ini! bs meet&amp;greet jg lho! https://t.co/0I6HRoxFX8 yg udh beli tiket VIP &amp; Festival #RaisaKonserSBY di cushy sutos hari ini, perhatiin rules meet &amp; greet ini ya! :) https://t.co/WYPwnG4iob sebentar lg nih, jam 2..yuk dengerin @istarafm !! aku bakal ngobrol2 seru nih..ada soal #RaisaKonserSBY jg pastinya. https://t.co/lQwXzGtG3g it is open! grab your #RaisaKonserSBY guys! beli hari ini di Cushy, Sutos, bs ikut Meet&amp;Greet sama aku nanti mlm! https://t.co/M6pwPAeZ08 UPDATE! penjualan tiket di cushy,sutos hari ini mulai jam 1 ya,get the limited chance to do a Meet &amp; Greet with me! https://t.co/kWdM8jqZxq meet&amp;greet nya cuma buat 100 pembeli pertama tiket vip &amp; festival #RaisaKonserSBY di cushy sutos hari ini ya! so, see you at sutos.. jgn lp,hari ini beli tiket #RaisaKonserSBY di cushy sutos, bisa ikut meet&amp;greet nanti mlm sama aku! https://t.co/Q6r3VwdDmw always start the day with smile and a great cup of coffee for a good mood. good morning good people! bsk beli tiket #RaisaKonserSBY di the cushy, sutos yuk! bs dpt buy 1 get 1 free utk vip &amp;festival, dan...bisa meet &amp; greet sama aku! :) finally hit the bed..surabaya, you've been awesome today! before going to sleep, i have surprise for tomorrow.. #RaisaKonserSBY @ridwan_asckar haha! kyknya gak ada deh. takut nanti naik ke panggung lg balon besarnya.. :p ayoo ke sini yg mau beli tiket #RaisaKonserSBY ! buy 1 get 1 free! :) https://t.co/8nUGKH9kYe td heboh dan seru bgt pas nyamperin ke aiola! thx yg beli tiket #RaisaKonserSBY ya. nanti ada yg mau beli di Gwalk? https://t.co/b5IEhEHv1L Hari ini judulnya muter-muter! Live sebentar lagi di EBS 105.9 FM ✌🏻️ https://t.co/NW3yMFR87v ini lokasi mobile ticket #RaisaKonserSBY yg plg update ya..td sempet mampir ke aiola, hihi..ada yg lg beli di sana? https://t.co/KV7mLFKV7b update! mobile ticket #RaisaKonserSBY hari ini! jdnya cuma di @aiola_eatery smp jam 17.00 &amp; Gwalk mulai jam 19.00 .. https://t.co/GvUFn3oSrK jgn lupa ya, dapetin buy 1 get 1 sama diskon 10% buat yg beli tiket #RaisaKonserSBY di official mobile ticket! https://t.co/Ezzzczu1z2 abis itu,official mobile ticket #RaisaKonserSBY ada di taman bungkul jam 14.00, lanjut lg di Gwalk jam 19.00. mau liat yg beli tiket ahh.. Surabayaaa! Ke @aiola_eatery ya jam 11 nanti, ada buy 1 get 1 #RaisaKonserSBY di official mobile ticketing box! Sampai ketemu 😝 and this! mulai hari ini,bs dpt buy 1 get 1 tiket #RaisaKonserSBY ! hari ini di @aiola_eatery! see you there? :p https://t.co/4qoWyPLk27 good morning! a good cup of coffee to start the day,before going around surabaya promoting #RaisaKonserSBY .. jgn lupa,mulai besok, akan ada mobile ticket box #RaisaKonserSBY ya. di mana aja lokasinya? bsk aku kasih tau.. https://t.co/I62EdRCAzK seru kali ya, kalo besok keliling ticket box di surabaya. siapa tau ketemu yg lg mau beli tiket #RaisaKonserSBY .. :) ternyata ada 17 kisah pejuang Indonesia yg hrs kamu tau lbh dlm lg. https://t.co/7RRKZXDGWr  #teruskansuarajuang https://t.co/KBpyn1bm78 I just couldn't excited more! #RaisaKonserSBY is really coming!! Anyway, udah beli tiketnya beluuum? Info tiketnya: https://t.co/wXOlmBqvnG dan hari ini, aku bakal ke surabaya buat siap2 #RaisaKonserSBY ! see you in surabaya, guys! 10 november, selamat #HariPahlawan guys! surabaya, today is your special day in national history.. @ridwan_asckar hari ini hrsnya udh dibuka. besok sampe tgl 13 jg ada lg.. have you got your #RaisaKonserSBY ? get ready, aku punya kejutan di minggu ini! #RaisaKonserSBY this Sunday ❤️ https://t.co/v8at7IaNCH Hi guys! Good news! #RaisaKonserSBY sekarang buy 1 get 1 free. Syarat &amp; ketentuan: https://t.co/eh0X9fN6CB https://t.co/2hWtALWVPe Baru dapet kiriman foto ini.. Ga kerasa, hari Minggu iniiiii!! Udh mulai kerasa yaa euphoria #RaisaKonserSBY ❤️ https://t.co/mqlpg9ESy4 kalo bingung beli tiket #RaisaKonserSBY , langsung ke tmpt2 ini aja! udh bs beli di sini kok.. https://t.co/m6TZaqOj7Z Selamat hari minggu! Who has #AfganRaisaPercayalah on repeat? 😊 @afgansyah_reza https://t.co/PJM3tBWLIu Have a great night everybody! That was one hell of a show! Di bekasi ada salah satu fanbase ter kuat aku, jadi tentunya selalu jd tempat yg sangat menyenangkan utk manggung.Jgn bosen undang aku ya ❤️ Dan semoga semuanya yg tadi sempat lewat atas panggung, udah pulih dan sehat lagi.. Semoga kita bisa nyanyi bareng lagi secepatnya.. Maafin aku harus potong beberapa lagu &amp; ngobrol, demi alasan kenyamanan dan keselamatan semuanya. Terima kasih utk semuab yg sudah hadir td Barusan adalah pengalaman manggung yang belum pernah aku alami sebelumnya. Seru banget &amp; super rame, dan semoga semuanya sehat aman smp rmh Semalam di Live With Indy Barends, promo #AfganRaisaPercayalah ❤️ In #hmindonesia head to toe! https://t.co/T1IneLSyWw nanti mlm ke summarecon bekasi. who's coming? nyanyiin #afganraisapercayalah gak ya? :p Good morning! Karokean yuk di https://t.co/64FALPxBuV. The lucky winner will sing with me on stage! #TomodachiDuet https://t.co/pJJWZdnwhz Have a great night everyone!! Loads of love ❤️ 😊😊😊 https://t.co/iGJ5Q63DSH Can't remember ever being this tired.. Vitamin C to the rescue!!! Sorry I haven't been tweeting much. Thank youuu utk semua yg udh nonton Konser Jatuh Hati, Dahsyat, dan Live With Indy Barends barusaan ❤️ got a surprise in the middle of my #KonserRaisa ! thank you kadonya mas rahmat.. https://t.co/6RVd8xuBXQ Yesterday at rehearsals. Cant wait! Tonight, SCTV 21:30 ❤️ follow me on snapchat : raisabackstage https://t.co/4pna6mJxh4 Waaa gak kerasa sbntr lagi #RaisaKonserSBY. Udah beli tiket belum? Disini nih ticket box offlinenya:  https://t.co/oTYTVR47oo see you all! Yeayyy ❤️ https://t.co/8SYXAVozmJ And on good news, #AfganRaisaPercayalah sekarang sudah bisa dibeli di itunes! Stop illegal downloading!! ❤️ https://t.co/x2YnNF6k7W Selamat pagi teman2! Aku bakal on air di Inbox SCTV segmen 2&amp;4, tune in! After looong discuss, here I proudly announce the winners of Photo Competition!! @nanaanisa @mario_sonatha &amp; Linda 😊 https://t.co/L5EhhLRbP3 this is it, don't forget to watch! :) https://t.co/f6rGmX0Iyr siang, aku mau share sesuatu yg beda selain #RaisaKonserSBY ahh! Good morning Surabaya! Jgn bingung soal pembelian tiket #RaisaKonserSBY! Go ask @yourRAISA_Sbya yaaa! *excited* https://t.co/mKsTNz3aup ❤️❤️❤️ https://t.co/KZx6Gx1Us8 atau bs jg di @MatchboxToo sini niihh! #RaisaKonserSBY https://t.co/3D1mMUugKB buat yg mau beli tiket #RaisaKonserSBY, bs di Folks Coffee &amp; Tea,Carpentier,Kitchen/ORE,Colors Radio,Merdeka FM,Kabinet Coffee yaa.. Sneek peek of the song ✨ https://t.co/v1pLOJoT2g RT @simPATI: Konser @Raisa6690 di DBL Arena Surabaya sudah dekat! Udah punya tiketnya blom? #GoDiscover di *500*266# yuk! https://t.co/JLbH… #AfganRaisaPercayalah is best described as a romantic ballad, written &amp; arranged to be timeless. Wedding song alert! https://t.co/8LdJmK20Y9 ❤️❤️❤️ https://t.co/NOYQeS71p2 Pekanbaru!! https://t.co/yu2rZanO7N Hope u all ❤️ it! https://t.co/Z0ugrNoNRm ❤️❤️❤️ https://t.co/msFRybPZRn RT @indraswarafm: Hari ini mulai Pkl.12.30 di @indraswarafm #AfganRaisaPercayalah | @afgansyah_reza @raisa6690 @TrinityOptimaP https://t.co… @ditriwangi amiiin thank you! Hope you like the song!! Selamat pagiiii semuanya! Akhirnya yg ditunggu tunggu bisa didengerin hari ini. Hope you all like it ❤️ #afganraisa https://t.co/QAQ6ip4ih3 Solo!!! Amazing!!! Thanks so much everyoneee hope you are all safely homeee ❤️❤️❤️❤️❤️❤️ https://t.co/UY6FJYubQH Kita punya sekitar 15 kandidat pemenang, dan akhirnya dipilih 3 secara random. Buat yg belum kepilih, we'll do something fun again soon! ❤️ Temen2, makasi buat semua yg ikut #RaisaKonserSBY photo competition! We got 3 winners! Expect a call from me soon 😊 RT @mgfmciamis: #Play Raisa - #JatuhHati @raisa6690 #24jamNonStop cc MD @sonyvandora Flying solo ! https://t.co/CwuhNmvAGi Surprise!! https://t.co/VCd5hLfbg3 😢 https://t.co/QqTH2tbDMq Btw aku baru landing di Baliii, halloooo tanah air!!! ❤️ Ngeliatin foto competitionnya #RaisaKonserSBY lucu lucu dan niat niat banget 😍😍 keep them coming! I'm feeling so great today! Siapa yang mau nyanyi bareng aku di #TomodachiDuet? Go check https://t.co/uxGWDuyk1r yaa https://t.co/Y4RGK5WKPH 😆😆😆 @afgansyah_reza https://t.co/7hMYfVTrF6 @intaansyarief1 pake jilbab boleh bgt! Yang aku liat posenya Yukk tiruin pose aku di foto ini! Yg mirip, nanti videocall sama aku. Pake #RaisaKonserSBY ya biar aku bs liat! ❤️ https://t.co/lgUMcadTle Waaaaa iyaaa! Akhirnya yaaa.. Asli gak sabar! https://t.co/elaMVM8WKz mau dptin tiket ntn ‘Tomodachi Concert’ gratis dari @sharpindonesia? cuma smp akhir minggu ini lho! https://t.co/yn0PW9Bg7R see an exclusive part of me, which you've never seen before, only at #qeepo ! #revolusikonten @QeepoCo https://t.co/ZGQ9ffjcB8 RT @USAsiaPacific: Happening now: Dinner in honor of @jokowi hosted by @USASEANBusiness, @USChamber and US-Indonesia Society. https://t.co/… Just landed in Washington DC! Wish me luck for tonight guys. Will update everything on snapchat RaisaBackstage ❤️ https://t.co/jekzknLylg Ladies, bsk ada Midnight Sale up to 70% di @bukalapak nih! Gak perlu capek antri di kasir &lt;3 #UntungBukalapak https://t.co/ldrfkGwIVX Cek deh @traveloka, harganya transparan plus bookingnya gak ribet! Me likeee! #AppyTraveling Saving all the sleep in need for the plane *mukabantal*. Boarding to Dubai now with my manager @adryboim https://t.co/YJaaHcryC5 Thank you for yohr support, always ❤️ take care dan semangaaat! Much love! https://t.co/afXlLs9Z2v Terima kasih Semarang!!!! Whooooo https://t.co/epWaUKR1UI Awww thank youu!! ❤️ https://t.co/SQlFFmLR9x Kalo lagi bete, the first thing i'd do: tlf sahabat, terus curhat. Abis itu lupa deh kalo tadi bete! Haha #Tomodachi https://t.co/0l7n377K0R Touch down Semarang!! Give me justttt a little time to take a nap. And I'll see you guys soon!! Semoga informasinya bermanfaat ya temen2! Do as little, and as much as we can! ❤️ https://t.co/weWSxFK4d7 RT @radioplsonline: #Np @raisa6690 - Jatuh hati. siapa nihh yg lagi jatuh hati pagi ini :D  #MorningSpirit || https://t.co/lyKWtycnaF Ihiy!! See youu!! https://t.co/Yx9fh6RcXa @yunita01061988 tapi itu kan bukan konser.. Jauhhhhhhhhhhhhh berbeda 😊 Salah satu caption yang bikin aku makin nggak sabar utk #RaisaKonserSBY . Doain ya temen2.. https://t.co/TcxOfEFDwm Scrolling thru these sweet stories on my IG. Keep them coming! Share cerita kamu dgn hashtag #RaisaKonserSBY :)) https://t.co/sFMwZPYCWO kamu setuju gak sama quote, “friend in need is a friend indeed”? Siapa sih tmn kamu yg selalu ada saat susah &amp; senang? #Tomodachi weekend with besties...udh lama bgt gak spend time with them... Just how cute are you guys??!!?!! Makin ga sabar #RaisaKonserSBY 15 November nantiii https://t.co/mDw1srYliG Selfie di panggung pagi tadi, selalu ada celah utk jepret selfie!! 😂 https://t.co/p9FDK6eG4R Thanks for coming guys!! https://t.co/XA85sIlYbc Makasi buat semua yang udah nonton aku di Inbox! ❤️ skrg lgsg lanjut shooting dan take VO utk DVD konser Pemeran Utama, semangat! 😊 Bakal nyanyi lagi di segmen 4! Stay tuned guys! ❤️ https://t.co/yUN6pZTfiX Morning!! Ready for Inbox SCTV. Segmen 2 &amp; 4 ya guys, aku juga bakal ngomongin konser Surabaya nantii. Tune in! https://t.co/u77dN49fq5 sahabat itu kayak saudara, ada berantemnya,ada ketawanya,tp ttp saling support. kalo menurut kamu,apa makna sahabat? #Tomodachi abis selametan kantor baru, waktunya ketemu teman2! For anything music, backstage life, onstage life, and concerts, add my snapchat Raisa Backstage 👻 #raisakonser2015 https://t.co/TNgU0Adqdu When you feel like you have a good hair day, you take a selfie! Otw fitting utk konser Pemeran Utama Surabaya! Ihiiy https://t.co/H2nHMfo5yL OMG!!! \"@BBCNewsbeat: The 30 sec music clip that has the industry in a frenzy. Oh boy...@OfficialAdele is back  http://t.co/coWiLPUMO3\" Morniing! Woke up with really great news from @BARASUARA! Skrg lagu-lagunya udah bisa di beli di iTunes! Ihiy! http://t.co/8DXatugrRo @Nita_KiaRaNitaa yeaayy banyanya wakilin bibi yaya.. liat foto2 #YourRaisaGath5th seru2 bgt! siapa aja nih yg ikutan? selesai jg shooting hari ini..sebentar lg shootingnya selesai! yeeayy! #firstmovie #terjebaknostalgia http://t.co/TvGVMz1CP6 time to rest. good night good people! another day in New York, another shooting day, indeed another journey.. #firstmovie #terjebaknostalgia Good morning New York! angin kencang sama udara dingin gini bukan kombinasi bagus ya..jd gampang flu.. :( \n#firstmovie #terjebaknostalgia kemarin hari kedua shooting, super tired! semoga hari ketiga ini gak secapek kmrn.. :p #firstmovie #terjebaknostalgia selesai jg shooting hari 1. let's hit the bed, rest well, and get ready for day 2! #firstmovie #terjebaknostalgia http://t.co/ei25wugZJv all set! i'm ready! let's start the journey.. #firstmovie #terjebaknostalgia http://t.co/Ivle9l18co Shooting day 1! 🍎🎬 http://t.co/QF77KNKU4O ❤️️ https://t.co/n6piy5K2eU @hytAffa thank youuu ❤️️ @yourRAISA_Smrg makasi utk doa dan supportnya yaa temen2 ❤️️ Thank youu!  😊 https://t.co/1C224LPIOK Sayangnya tdk bisa hadir utk ambil piala APM krn sedang shooting, oh how I'd love to be there! Sekali lg thanks so much for the support ❤️️ I'm beyond happy this song got the appreciation it deserves.Karya kebanggaan saya :) Thank u APM for this honor ❤️️ http://t.co/Adm84G9ue9 Long flight OOTD; comfort comes first! Semua yg breathable &amp; longgar, sweatpants &amp; lightweight sweater is my go-to 😁 http://t.co/2xUvvkJg7B 6 jam transit di bandara itu... :( after Bahas Bahasa, @BARASUARA have this. i'm so ready for #KonserTaifun ! http://t.co/hWxEDZ5RLW sekali lg, happy anniversary @yourRAISA . glad to have you along this wonderful journey.. #YourRaisa5th http://t.co/LKOy1uoeQr Happy anniversary @yourRAISA !! Thanks for being the best supporter, and making my life more and more wonderful! http://t.co/ocRIBAaAHU good morning! this is it, the tickets to #RaisaKonser di Surabaya! mau nyanyi brg di kelas yg mana? see you! http://t.co/P6GOfbhm4m Biasanya, semua apresiasi yg aku punya, aku simpan dirumah. Yg satu ini nyasar di kantor! I'm taking it home! ❤️️❤️️ http://t.co/pukmZbLg8x biar lbh nyaman, #RaisaKonser Surabaya jd hari minggu,tgl 15 Nov 2015 ya! jgn smp slh tgl. tiketnya? soon! :) http://t.co/QhzQCBQ8Op aku punya berita baruu buat #RaisaKonser nih... Bibi Yaya in action!! 🙈 http://t.co/yBeqeTIyTd pertama kalinya aku nyanyi di festival musik di kuala lumpur. soulfest, kuala lumpur! let's sing! http://t.co/Zp75tQ7Ch5 it's weekend! i have some good news..wait.. :) ❤️️ https://t.co/oxwfT9iXT0 Ber-batik dong hari ini!! This one is from Dea Valencia 💋 http://t.co/8VnD6dkQfc Jgn gengsi! 😝 http://t.co/CpoDehsyjN barusan aku ikut imagine your korea di http://t.co/jjkU0tRQqU nih. yuk kamu ikutan jg, trs mention ke aku. :) @achieAmares nanti kan november insyaallah konser di surabaya.. :) Just been in the receiving end of a random act of kindness. Feels warm inside 😊 Please let's share ways to help, tweet &amp; retweet, repost &amp; share sekecil apapun. Sambil berdoa tentunya. Ngga kuat bgt liat foto, video dan baca berita ttg asap di Palangkaraya dll. Is there anything we can do other than wait for authorities?? @eddieyariff bulan dpn aku ke kuala lumpur nih... Found an old photo of me! Lg nyanyi paduan suara di RRI. Aww! http://t.co/pSYqioRRlC nanti mlm, ketemu di lotte shopping avenue ya! nyanyi brg jam 7. it's gonna be fun! :) http://t.co/CHGLIc7pLH it's weekend, let's make some plans and have fun! Scene favorite aku di video clip \"Jatuh Hati\" tangan si gembil menggemaskannnn 🌎 http://t.co/qu35IeGAeN http://t.co/npsI18cVKb Found an old article about me (2012) in Bazaar! Inget bgt waktu itu ga nyangka (&amp; ga PD) bisa masuk majalah ini ❤️️ http://t.co/cJTdBCVF6b wow, thank you @ziliun ! it's an honour.. being in a list with these amazing women, kewl! http://t.co/COHmLJy2r5 Selamat hari raya Idul Adha, teman2.. Semoga Allah menerima amalan kita, dan mengampuni dosa2 kita. Dan juga selamat makan enakkk! ❤️️ @yourRAISA wah, itu di line group nya YR ya? Santai santai sama keponakan, sebelum harus mandi dan berpisah hiksss http://t.co/XltOHUIV8A Matching lipstick 💋💄 @7760ria http://t.co/oRKG7Zvs2s With my grandma Mama Sjuul ❤️️ http://t.co/CNz8fdHPkj good day! jam 4 sore ini nyanyi bareng di Arcofest SMA Don Bosco 2 di Mahaka Square Kelapa Gading yuk! who's coming? True dat. http://t.co/h2JWmUTjGG Perdana di Manado, and it was magical! Hopefully we were worth the wait 🎉 http://t.co/DFhUJWEmWW @Nita_KiaRaNitaa @BARASUARA belum sempeeettt! liat di youtube doang jadinya.. so exciteedd!! glad to be part of this.. great song! #BARASUARA http://t.co/AZ6GpOYYES RT @BARASUARA: Mari kita bersama saksikan #BahasBahasa. Selamat menyaksikan! https://t.co/MfPFRINyLL Selamat berulang tahun kepada salah satu sahabat yang paling saya kagumi, @Msteffiano . Love you co!! ❤️️ http://t.co/MjMEsYrC8j RT @tulusm: Ketawa itu ternyata menular. Banyak-banyak dekat-dekat sama orang yang sering ketawa. Biar ketularan bahagia. Nggak bosan2 nontonin video ini. Another \"dream audience\" situation last night ❤️️ http://t.co/eVFHkDVSHq When adrenaline kicked.. Thanks Euphoria Project and Central Park for having me and the boys. http://t.co/DneAkc1yvv RT @drihen79: @raisa6690 di cp http://t.co/nM1OD3yqC6 Semoga gig di Central Park hari ini menjadi penutupan yang manis di weekend yg super seru inii! See you guys thereeee ❤️️ Good luck Ka Andunssss!! Can't wait 😍😍 https://t.co/xhBFmjZeoq Halo Solo!! ❤️️ https://t.co/PJWmUV0V4i Last night's magical moment ✨ captured by Nareend. http://t.co/babl0F21tv RT @Msteffiano: Skyavenue malam ini bener2 gila. Penontonnya rame banget! Dan nyanyi semua! \nGilaaaa!!! Sky Avenue ❤️️ Thank you guys for your beautiful energy tonight! Have a great rest!! http://t.co/0SwxB1jI3E time to get some rest before tonight's gig. see yaaa! @dinopattidjalal you're welcome, pak. i'm a fan too. :) LIVE on #Periscope: Masih pada bangun? https://t.co/3nyLoEKufm Pekalongan gave us such a warm welcome ❤️️ thanks for having us!! http://t.co/5q04tDCS7o Masih ngantukkk 🚂💨 http://t.co/WWHeNAw379 pekalongan, here we come! jd beauty blogger kyknya seru ya..hahaha! @ridwan_asckar haha! lo liat di IG ya? foto2 hari ini seru bgt! tp boleh share foto2 gak ya? haha! yeaayy! the next journey of Raisa Pemeran Utama Live in Concert! Surabaya, 14 November 2015. see you! http://t.co/2U69f9Bs9i mlm ini ada pengumuman dari #RaisaKonser yg kmrn2 sempet aku post..hihi.. Ada flare skirt yang aku suka nih di @ShopeeID. Lagi diskon &amp; potongan 50rb pake kode WELCOME http://t.co/qsJc6L7unW http://t.co/whWcVrjDgM are you ready? #RaisaKonser http://t.co/wD5TkV8ANB hari ini, libuuuurrr! @AnindiaUtami tungguin besok ya announcementnya.. hihi.. @hasanjun sama2 yaa! :) get ready... #RaisaKonser http://t.co/aLsLYr4jhi manggung hari ini unik bgt, hahaha! Ini foto orang capek tapi seneng.. Trs ga sabar ketemu keponakannya 👶🏻 http://t.co/6h0whjwn4P Satu lagii.. http://t.co/PagEJZfpjT Last night, doing what we love to do! Karaoke massal!!!! http://t.co/CyuU2QV4Ri Soundrenaline tahun ini line up nya seru bangetttt!! Be sure to come by Amphiteater Stage tonight, 8:30PM. See you guys!! ❤️️ di bali, tapi kerja..kpn2 harus ke sini tp liburan ahh! Got this from a friend of mine. This is why I write. This is why i sing. ❤️️❤️️❤️️❤️️ http://t.co/brYnYVlWld BARASUARA - Taifun 💨 http://t.co/r7gY2mS1C3 Dikasih cincin2 ini sama YR Pontianak kemarin! How sweet u r! Thank youuuu http://t.co/UKrinIfJGt I'm blessed to have such incredible moment like this &amp; definitely, this is not the end... this is just the beginning. http://t.co/fPKhGlqTdz oh iya, i'm going to sing at soundrenaline 2015 in bali! nyanyi brg pas tgl 5 ya... http://t.co/yvuAItM4c3 td pas nyanyi gak berasa capek...sekarang. . :( always love Disney's princesses ever since. today, this dress makes me feel like one. makes me wanna twirl, haha! http://t.co/XOCdZ24UhC today, disney's princess time! :) sedih bgt utk temen2 yg hrs menghirup asap ini setiap hari! 😢 semoga temen2 dan hutan kita dilindungi ya.. See u soon http://t.co/Lzu6vt4X2l bismillah, semoga kabut asapnya gak makin tebal... Hope you don't mind, but we took a selfie with you all! Seruuuu bangettttt I'm lost for words!! Thank youuuuuuuu http://t.co/3xKzHd7YMY Ngelewatin billboard acara nanti malam. See you guys! Skrg mo tidur siang dulu hihiihi 😴 http://t.co/xmb2DL1Sg9 Shout out to @yurayunita yang lagunya gabisa keluar dari kepala akuuuu 🎶 duhhhhh ❤️️ Grown to love Taylor &amp; Gigi more after reading this article ❤️️ http://t.co/4h5wuiB7w5 sampe di bandara, tiba2 ada kabut asaapp! Sharing cerita,cita &amp; inspirasiku menulis lagu Bercahaya utk #WajahBaruIndonesia . Dengerin di http://t.co/3Cf6GleXP6 http://t.co/1IgSlkv2oF Have you looked out the window? The moon is soooo gorgeous tonight 😍 Pillow faced selfie with my baby niece ❤️️ http://t.co/9CV7fxbgRy RT @kemalmaharsa: Lari pagi tadi @raisa6690 @novence http://t.co/EyUiiNoX8F oh iya, makasih yg td udh lari bareng yaaa...good times! :) abis td pagi lari, trs lanjut squash..skrg berasa capeknya... bsk pagi aku ikut 5K Run di @CinemaJamJKT, mlmnya on-stage di #CinemaJamJKT jg! Ketemuan di sana ya! http://t.co/YIkh6zJ1Kp siang ini...panas bangetttt!! Always a pleasant surprise,lg di ruang tunggu,ngambil majalah,and saw myself! Shout out to Cosmo Girl Indonesia ❤️️ http://t.co/B1lLM1CVWW pagi2 olahraga dulu! udh lama gak squash nih..feels like years! GR dulu buat nanti malam.. makasih yg td malam udh nonton, udh nungguin sampe malam bgt..really appreciate it.. :) today is a happy day :) Agak menyesal ya semalam nggak nonton @BARASUARA tadi malam, semoga ada yang ngerekam Semalam di Lampung seruuu bgtt ga nyangka dapet sambutan segitu hangatnya. Thank you semuanyaaa!! Pict by Arfianto http://t.co/LcMynQHIcO back in j-town! langsung plg mau main sama ponakan ahhh.. :) Cuma mau ingetin malam ini jam 18:45 aku perform di konser Road To Soundrenaline, Lapangan Saburai Bandar Lampung @yourRAISA_Blpg pagi2 udh di bandara..lampung, here we go! Waktu kecil aku paling berani nyanyi di dpn kelas. Hal terberanimu apa? http://t.co/bFLt5X6b9H @UCbrowserIndo #UC17an http://t.co/EKXUytPMs0 jd bingung nih..hahaha! kehebohan sendiri pas lg fitting. bajunya lucu2 bangeett!! 17an udh lwt tp semangat kemerdekaannya trs ada! liat semangat #UC17an deh di http://t.co/bFLt5X6b9H @UCBrowserIndo http://t.co/YeWrbqjmP4 @eloknian rasanya bahagia dan terharu bgt..best feeling ever! :) tiap workshop, langsung kebayang pas dinyanyiin di atas panggung.. do you remember this? :) http://t.co/70rBH77IPv Lari 5k brg aku yuk di @CinemaJamJKT 5 K Run,tgl 30 agustus! beli tiketnya di indomaret &amp;http://t.co/0MBNiaFmNQ ya! http://t.co/oRV2wBHohb hari ini photoshootnya seruuu!! a cup of coffee to kickstart the day, selamat pagi! hari ini workshop bareng duo produser..udh lama jg nih gak workshop serius bareng, hahaha! Inget dl pas 17an ikut balap kelereng smbl lari biar cpt finish kyk @UCbrowserIndo ,kelerengnya jatuh2! Haha! #UC17an http://t.co/zgznFlBfc0 oiya ada jg lomba mkn kerupuk yaaa..hahaha! seru tuh! tiba2 inget games 17an jmn dulu..balap karung,lomba kelereng, gitu2..masih ada gak sih? semangat kejar cita2 &amp; prestasi utk #WajahBaruIndonesia. cek Bercahaya di http://t.co/3Cf6GleXP6 @PondsIndonesia http://t.co/nBQmxyYYyt dirgahayu #Indonesia ! #RI70 jakarta lg! jd inget pagi2 tgl 17 agustus dulu upacara di sekolah.. makassar! first thing first, kuliner! hahaha! what's good? menyenangkan bgt weekend di bali! but, time to go! :) Oleh oleh dari temen2 di Bali semalam ❤️️🐰💐 http://t.co/kQ1T8StjKP momen spontan td mlm sama @IndraAziz ! hahaha! pic by @nareend http://t.co/Dd3qYoAIRw last nite was magical! seru bgt nyanyi brg di #Disneynight nya! makasi buat yg udh dtg dan jg yg streaming ya.. waa kapasitas buat #disneynight di @atamerica mlm ini udh penuh..buat yg gak bs masuk, ntn streaming aja yuk di http://t.co/jPWl14d3cS ! :) hahaha!! https://t.co/DeheyZPOxa oh and the good news is, acara nanti malam itu..... GRATIS!! hahaha! kita nyanyi soundtrack disney yuk nanti mlm di @atamerica ! seruu niihh!! http://t.co/sYcXn45Y1U hari ini seneng bgt nih..bakal nyanyi yg beda dari biasanya! :) udh lama gak periscope-an nih.. :p Wihiww ga sabaar!  https://t.co/CPtTPeC9kL Palangkaraya seruuuuuuuu!! Thank youuu ❤️️ @ridwan_asckar gmn kalo bikin konser lg? hahaha! td mlm di all ayes on ICE, bsd..seru bgt! thank you all coming, thank you @nareend for this picture! http://t.co/qheCAwCHR1 siap2 buat nyanyi brg @afgansyah_reza nanti mlm..ketemu di @ICEIndonesia yaa! :) http://t.co/mVpQ1TCKwa can't wait for tonite gig! exciteedd! see you at ICE, bsd! gak sabar mau duet sama @afgansyah_reza ! haha! terus hari sabtunya tgl 8, manggung bareng @afgansyah_reza ! duet terus weekend ini! buat yg ini, ada yang spesial! http://t.co/7xggsaKrqh hari jumat besok manggung bareng sama @tulusm nih di rolling stone cafe. asiikk! :) http://t.co/uDPeX2HReU capek, tapi mau latihan...weekend ini manggungnya pasti seru! excited banget! some songs deserve to be on repeat.. selamat pagi!! me with trio lestari. jgn lupa nonton di trans tv malem ini jam 10 ya! seru banget! http://t.co/kUg7mNv59m Anyone? ;) RT @adryboim: PT Juni (Event Promoter, Label Records, Raisa Mgmt) is looking for a GRAPHIC DESIGNER INTERN http://t.co/AjECiNcWOO Seruput kopi hangat pagi ini di Temu Kreatif Nasional 2015. Good morning everyone!! http://t.co/c4vTsABnDB hari ini, studio session!! @yourRAISA_Mks haii tmn2 di makassar!! :) ramee..seru2...hai semuaaa!! @yourRAISA  https://t.co/232HUzeyh0 @Nita_KiaRaNitaa @yourRAISA share foto2 nya dongg... @yourRAISA_Mks wah, di makasar jg lg pada ngumpul? share foto2 nya donggg :) eh, @yourRAISA lg pd ngumpul ya? :p all black for today... http://t.co/qufaJWK4og cari ide lg buat pas manggung tgl 8.. hmmm.... it's weekend, let's have some fun! woohoo!! Masuk mobil, lgsg ada \"Jatuh Hati\" di radio. Asikkk! Lgsg senyum2 sendiri. Hahaha thanks Prambors :) latihannya gaya bgt, pake partitur segala..hahaha! http://t.co/xjbhJoAIJv latihan hari ini buat manggung tgl 8 Agustus di Grand Opening ICE, seru bgt! bakalan asik nih nyanyinya! jobs done! can't wait to go home! minggu dpn nih! nyanyi brg yaa...bakal seru nih nyanyinya, hahaha! http://t.co/9ZZerBeb5e weekend ini, kerja dari pagiii... hahaha! woohoo! kita nyanyi brg tgl 8 Agustus di ICE BSD ya! this will be one great show! http://t.co/46h2zvIgZ4 People who know the least about you, have the most to say. Just shake it off, guys! Smangat kerja buat yg udh masuk kerjaa (kayak aku) hahaa mama boliii...  y u so cutie!! http://t.co/joTZFtf7Uu holiday is almost over...  :( Masih suasana lebaran kalo dirumah banyak keponakan keponakan menggemaskannnn ❤️️ http://t.co/Q7ylfiEUPb Good night :) #JatuhHati http://t.co/V9ns5I9Ex7 waaa td ada #MusikSpesialRaisa ya? who's watching? :) Family picture time! http://t.co/0Qv2g8E7v0 Paling suka lebaran liat anak anak kecil pake mukena dan peci!! Gemeshhhhhhhhhhhh Selamat idul fitri utk saudara saudarikuu, saatnya silaturrahmi dan bersenang2 bersama keluarga! :) http://t.co/Et5Xq6Apx3 @yourRAISA_Smrg makasi yaa semuanyaa ❤️️ maaf lahir batin! @RealNatalia26 sama2 yaa, makasi banyaak :) selamat idulfitri juga utk kamu.. @Ophee_Phi amiin, doain yaaa.. Makasi udh nonton :) @hytAffa makasih yaa udh nonton:) doain terus supaya lbh baik.. Dan utk orang2 yg hatinya msh dipenuhi dgn negativity, semoga pas lebaran bisa \"libur\" rasa bencinya terhadap dunia. Walaupun cuma sehari:) Maaf lahir batin ya buat semuanya.. Semoga kita semua bisa menjadi pribadi yang lebih baik terus, perlahan tapi harus selalu ada kemajuan:) Terimakasih buat semua yg udh nonton barusan.. Seneng bgt bisa berbagi panggung dengan temen2 musisi &amp; penyanyi yg super keren! ❤️️ alhamdulillah...nggak kerasa udah buka puasa terakhir...eh hilal udah keliatan kan ya? :p Buka bareng sepupu sepupuuuu.. http://t.co/sc2aW46N3F bs baca tulisan ini 10x dlm 5 detik? RT &amp; ketik ‘DHUARR!’ klo kamu bisa! @UCBrowserIndo #THRDhuarrUC http://t.co/mxsQmlkK9a sepupu2 kecil ini lari sama geraknya pada cepet2 amat! lincah nih.. hahaha kalo udh libur, paling enak emg buka puasa bareng keluarga.. apa lg keluarga besar! seruu.. RT @7760ria: Alhamdulillaaaah lengkap http://t.co/RbML8QnFN3 Yeay! Dandan cukup 5 menit, cepet bgt kyk @UCBrowserIndo! Ikutan yuk share di #THRDhuarrUC &amp; menangin hadiah Dhuarr! http://t.co/wiyvenog1q buat yg udah mudik dan mau mudik, safe travel ya...semoga bisa cepat sampai di tujuan dengan selamat! amin! libur..telah tiba! woohoo! hahaha! LIVE on #Periscope: New office situation, excited! https://t.co/9hQsjfTRN6 LIVE on #Periscope: This or that? https://t.co/GJvmD3MDH1 cherish everyday with great spirit and... smile. :) \nhappy monday! LIVE on #Periscope: Cats!! Cats!! Cats!! https://t.co/Sbh2aFCBQO Buat @yourRAISA semangat yaa bagi2 tajilnyaa! Sending my love from hereee ❤️️ Seru periscope barusan.. Sampe lupa waktu. Answered some interesting questions, seneng banget jadinya bisa berbagi yg serius sekali2, hahaha LIVE on #Periscope: Q&amp;A part 2! https://t.co/JCD3qB5tx1 LIVE on #Periscope: Q&amp;A in seshh! Shoot!  https://t.co/WEaFXDRWqJ Siang semuanya! Dalam 5 menit aku mau online Q&amp;A session on Periscope. Get your questions ready, yg seru dan menarik ya, jgn yg aneh2 hahaha workshop selesai! seneng bgt bisa bikin karya2 lagi. semoga bs jd karya yg bagus dan disukai byk orang. amin! now, back to reality! :p LIVE on #Periscope: Suasana workshop malam ini.. https://t.co/0FCwxzGaAP @rsteven yes, less distractions indeed! thank you! back to workshop! semoga bs menghasilkan karya yg bagus! pgn ketawa kalo inget pas lg akting scene ini. hahaha! wardrobe by Payless, cek di FB Payless Shoesource Indonesia http://t.co/q4XCbnZvHB eh, nemu foto shooting lg nih! serius bgt ya kayaknya, hahaha! wardrobe by http://t.co/SvuhMc6FWk http://t.co/Kln9NNialq workshop hampir selesai..enak jg ya workshop sambil kabur dari Jakarta gini..hahaha! LIVE on #Periscope: Ngabuburit sambil nyanyi2 lemas yuk..  https://t.co/Ov1sWDRxAh RT @99ersRadio_Bdg: #NowPlaying @raisa6690 - Jatuh Hati | FDJ @rizalfaturr Prod. @aldhyrocky Op9. @SutanFchrz #FunkyRequest #COMIN9SOON #Da… LIVE on #Periscope: Kecoa hunt 2015!!  https://t.co/LKluVsIfIW LIVE on #Periscope https://t.co/VARysYfSCq LIVE on #Periscope: Happy bday Kakaaaak❤️️ https://t.co/5dW6YkMRpK LIVE on #Periscope: Otw Mall SKA Pekanbaru, ngabuburit bareng yukk!!  https://t.co/5MRav4Rvqp pagi2 udh di pekanbaru aja... LIVE on #Periscope: Workshop sambil ngabuburit!  https://t.co/YOU8OhXSNQ ganti fotonya, hihihi... oh iya, td dpt kiriman #KASKUSCendolin nih! makasih yaaa... cendol gan! @kaskus http://t.co/TCH13B9Qad skrg, siap2 seru seruan dulu! LIVE on #Periscope: Photoshoot! https://t.co/ZZJysJINQj slh 1 review konser Pemeran Utama yg berhasil nangkep inti &amp; semua yg pgn aku sampaikan. thank you @RollingStoneINA http://t.co/FBP9XNksjK nah,satu lg..pas lg break shooting kalo gak salah. seru2 an sama @cjerikho829 , good times! wardrobe by @X_SML http://t.co/wApp6q8REd Ini nih foto yg aku blg kmrn, pas lg shooting bbrp bulan lalu.. wardrobe by @cottonink http://t.co/qhMjcUwdk0 LIVE on #Periscope: Banana!  https://t.co/mdNAbLm1zN LIVE on #Periscope: Jatuh hati live di oz radio bandung ❤️️ https://t.co/0ifxalPzd1 LIVE on #Periscope: Live at @ozradiobandung !  https://t.co/VFZmBwjoB3 nunggu buka puasa, smbl liat2 foto2 waktu shooting bbrp bulan lalu..hihihi, good times! salah satu perasaan plg menyenangkan adalah saat nyanyi brg sama kalian...  :) http://t.co/MKzqDoVBdv LIVE on #Periscope: Buka bareng keluargaaaa  https://t.co/SjBY7BlMfk happy sunday! :) ihh, keren nih, @yourRAISA main Periscope jg. hahaha! seru yaaa! alhamdulillah, last nite ramadhan jazz was amazing! thank you all for coming! http://t.co/9PyJtOHKCP nanti mlm kita nyanyi bareng ya! abis solat taraweh kok manggungnya..., :) http://t.co/cA2QgNaapZ siang2 nemu foto2 dari bbrp project seru.. wow! Hmm.. Bingung nih, pas buka nanti enaknya #KetupaTIM3 pake TELOR, OPOR, atau SANTAN yaa... ini boli... waktu blm melahirkan puluhan anak... http://t.co/x6nTW3OjAp Baru tau kalo @iqbaale kemarin kecelakaan, semoga lekas sembuh ya! LIVE on #Periscope: Sesi workshop larut malam.. https://t.co/MLwDemgLEH seneng bgt akhirnya lagu2 aku udh bisa di streaming lg! catch #Raisaisback exclusively on @GuveraID! woohoo! abis #BukaPuasa , this is the latest video from my Concert Diary. udah nonton blm? https://t.co/rarSQIJ2iu LIVE on #Periscope: More randomness.. https://t.co/6BJnm5KMa7 LIVE on #Periscope: Monday drive.. Ngabuburit.. https://t.co/hVVzetFVpk LIVE on #Periscope: Baliiii ☀️ https://t.co/i35LA72HCD LIVE on #Periscope: Baliii ☀️ https://t.co/89dORxNinR Siapa yg mau periscope-an lagiiii...? ke bali pas lg puasa tuh godaannya banyak ya.. hahaha! Pagi Bali! Malam ini aku perform di acara Charity Concert \"All About Love\", Centerstage Hard Rock Hotel Bali jam 8 malam yuk dateng! alhamdulillah,udh msk bln #Ramadhan semoga #BulanPuasa ini lancar semua puasanya. can't wait buat #BukaPuasa pertama nanti! #Raisaisback https://t.co/7J8rL7oZSg Thank you lho Teka tekinya @pergijauh @andiraa tau gitu kemarin ikut konser 😝 LIVE on #Periscope: AEON Mall!! https://t.co/2tEG8MQbCy On the way to AEON mall with the band, ada yg udah disana?? Online di periscope lagi yukk ayo semangat trs timnas U-23!! http://t.co/pRc25F40Ok LIVE on #Periscope: Macet oh macet.. https://t.co/QDFEqfXoDI Subhanallah macetnyaaah. Kita periscope-an aja yukk. sblm nyanyi brg di @JazzyNiteCitos , ntn video baru Concert Diary dulu yuk! akhirnya video barunya jd juga.. https://t.co/bM47YacL1A LIVE on #Periscope:  I have a guest!! @afgansyah_reza https://t.co/fhrBMpXTq9 Standby aku mau online #Periscope eh gmn periscope-nya? baru sekali nyoba nih, hihihi.. nanti mlm di jazzy nite! ketemu di citos jam 9 yaa.. http://t.co/8wJ993ExT0 LIVE on #Periscope: Back stage episode 2  https://t.co/xQkVxTA2mZ LIVE on #Periscope: Backstage!!!  https://t.co/JolkXCr05J Mau nyoba live streaming via periscope ah! Percobaan pertama adalah backstage siap2 yaaaa Jangan lupa ya besok aku akan perform di Jazzy Nite Citos! Besok akan ada set baru cc: @Msteffiano dan adaaaaaa ..... Rahasia! dan td kena slime jg akhirnya di #IKCA2015 ! seru bgt slime partynya, hahaha! @PrincesSyahrini http://t.co/dj4NMISEwB aaaa dapet award di #IKCA2015!! seneeengg.. thank you semuaa... @MyMagnumID thank you guys! :) beneran ya hari ini dpt verified account di Twitter. thanks @TwitterID!! lucu amat ini Nickelodeon Kids Choice Award! warna warni di mana2.... http://t.co/irbjEhr6hf Hari ini ternyata dapet verified account dari Twitter! Wohoooooo seharian ini, meeting...  :( gak ada habisnya nih @yourRAISA.. video ini lucu bgt!! http://t.co/wG7Ppw51Ye Jangan lupa ke #CountdownAsiaFestival di Lap D, aku perform malam ini! There are 500 free tickets for you! Grab it at booth No. 1 See ya! bersyukur bgt ada @yourRAISA.. you guys are truly wonderful.. thank you, from the bottom of my heart. http://t.co/opRRHv9RSZ aaa dpt surprise dari @yourRAISA tadi soree!! http://t.co/lfLu4faIMV @adryboim ihh ada hashtagnya.. kadoo doongg :p to @yourRAISA, you are wonderful.. i am blessed to have you.. thank you so much! dari pagi, byk bgt mentionnya!! thank you so much for all the wishes, guys! amiinnn!! semoga semua jd kenyataan ya.. RT @gemesta: Web launching &amp; artwork exhibition #QuranIDproject. Pameran 27 karya seni visual yang terinspirasi dari bacaan Quran http://t.… jd kepengen dessert.. hahaha.. Lembutnya icecream vanila dilapisi chocolate putih,topping almond. lezat! @MyMagnumID selalu bikin pleasure seekers ketagihan  #MagnumWhite kemarin #RAISAKonserOnTrans sempet jd trending topic! woohoo! senangnya... semoga semua yg ntn senang ya... http://t.co/VcncFWz8oc Terimakasih untuk semua yang udah nonton #RAISAKonserOnTrans Semoga konser ini bisa aku bawa keliling Indonesia ya, Amiiiiin! Good nite! Deg-degan banget part ini @TheOvertunes @MichaelMohede #RAISAKonserOnTrans @TapiheruAudrey terimakasih Audrey :)) @Msteffiano tadi udah keliatan, @yourRAISA_Jogja juga udah keliatan hihihi #RAISAKonserOnTrans jgn lupa share momen favorit kamu pake hashtag #RAISAKonserOnTrans yaaa.... aaaa, can't wait! aaa 15 menit lg #RAISAKonserOnTrans niihh! siap2 di dpn tv ahh.. degdegan.. hahaha! 2 more hours to go to #RAISAKonserOnTrans!! yg kmrn gak bs dtg ke konser aku tgl 24 mei, kita bs ntn bareng nanti jam 18.00! woohoo! @reginaivanova4 trimakasih kakak Regina, sukses selalu ya eh iya, pakai hashtag #RAISAKonserOnTrans ya biar aku gampang liat tweet kamu..  :) degdegan lg rasanya mau liat salah satu mimpi aku jd nyata di #RAISAKonserOnTrans.. 4 jam lg nih #RAISAKonserOnTrans nya!! so excited! @Mithacimit blm ada nih! maaf ya, blm jd videonya, ada yg aku revisi dulu, hihihi.. today is the day! jgn lupa nanti ada #RAISAKonserOnTrans jam 18.00 yah! kamu bisa liat, gmn salah satu mimpi aku jd kenyataan! Untung tadi sempet latihan di backstage  https://t.co/yQk3VUrOUQ Terimakasih Malang!! Seruuuu  https://t.co/NnTB1cL4Hg besok, jam 18.00, jgn lupa ya. ada #RAISAKonserOnTrans ya! degdegan lg nih jadinya! and the good news is...  #RAISAKonserOnTrans  https://t.co/RHBnLYZPDC byk bgt ternyata foto2 #magnumraisakonser kamu semua ya.. seneeenggg! happy monday! siapa yg udh dgr Jatuh Hati di @GuveraID atau beli di iTunes? :) mana lg nih,  foto2 pas minggu lalu lg nunggu #magnumraisakonser? :) tuh, @yourRAISA nyanyi2 smbl nunggu #magnumraisakonser minggu lalu.. i'm proud of you! http://t.co/TI0wXDuMLk pas selesai GR #magnumraisakonser minggu lalu, ngintip keluar, wah, udh banyak yg dateng! pasti udh ada @yourRAISA tuh ya..  :) dan jam segini minggu lalu, baru selesai GR #magnumraisakonser.. antara seneng degdegan bgt, gak sabar. campur aduk! udh di malang, gak lengkap kalo gak ngebakso ini! yumm yummm!! http://t.co/C0YPhpWyGL seminggu yg lalu, jam segini lg siap2 mau GR buat #magnumraisakonser nih.. dan jgn percaya sama desas desus yg blg kalo aku gak jd manggung di acara @OsisSmansaMTR gara2 aku sakit, itu bohong! :( aku jg br tau kalo panitia @OsisSmansaMTR gak punya izin yg lengkap buat acara ini, makanya jd ada masalah kyk gini.. utk tmn2 di mataram, kita berbagi kekecewaan yg sama...  :( http://t.co/eU1Jo84SyF semoga aku bisa ke mataram lg secepatnya, dan kita bs seru2 nyanyi brg, dan lagunya lbh banyak ya.. thank you mataram!  :) aku jg minta maaf bgt kita cuma bs nyanyi brg 2 lagu.. td ada masalah tiba, aku jg bingung dan gak bisa apa2..  :( makasih bgt yg td udh dateng dan nyanyi bareng.. maaf ya nunggunya lama.. :( hari ini nyanyi di sini! siapa yg di mataram? yuk, nyanyi bareng! https://t.co/ItPCLqiOAs udah di mataram. cari makan dulu kali ya. what's good? in the meantime, Jatuh Hati udh bisa didenger di @GuveraID lho! go listen, and wait for #Raisaisback on Guvera! woohoo! @OkthaViianii iya nih! masih kebayang bgt konsernya.. seneng bgt soalnya! :) eh, td mlm video concert diary blm ada ya?  blm selesai nih videonya! :( tungguin aja di http://t.co/lbDUT1rV63.. concert diary masih ada! lg libur, tapi gak bisa diem.. hahaha ini nih salah satu kejutan ultimate gift dari @MyMagnumID di #magnumraisakonser hari minggu kmrn!  https://t.co/gyMx9uIlfW dan masih terharu kalo inget2 #magnumraisakonser semalam..salah satu mimpi aku tercapai. let's chase the bigger dream! #MagnumWhite is really ultimate gift from @MyMagnumID for pleasure seeker that has made this 5 years journey in Indonesia is a fabulous one. gak ngerti hrs ngomong apa lg. bahagia luar biasa,cuma bs blg alhamdulillah, makasih semuanya.  #magnumraisakonser http://t.co/AlOo2hegme @Angelo_Mikha Mikhaa thank you, I'm so happy to share the moment with you guys ❤ see u soon! Bikin2 apa yukk i'm back! and it's done! Share your best #MagnumRaisaKonser moment dong! penasaran akuuu! Ratusan balon putih turun ke penonton di lagu Could it Be! #MagnumRaisaKonser Penampilan dari The Overtunes barusan sukses bikin penonton histeris! #MagnumRaisaKonser Firasatku ingin kau tuk cepat pulang.. #MagnumRaisaKonser http://t.co/t02vi5Uo5Z Sekarang Raisa duet sama Mike Mohede di lagu Let Me Be. Bagus bangeeeeetttttt #MagnumRaisaKonser http://t.co/n6ihq357Jq Sekarang Raisa menyanyikan lagu salah satu penyanyi favoritnya, Brian McKnight - One Last Cry #MagnumRaisaKonser Visual mapping gaun Raisa yang indah banget di #MagnumRaisaKonser http://t.co/Ht6maY8cem Hari yang bahagia.. #MagnumRaisaKonser http://t.co/VYC4pasQYa Bersinarlah! #MagnumRaisaKonser http://t.co/Uf5giizZkU Hai saya @adryboim akan ngebajak twitter Raisa beberapa jam kedepan buat live tweet #MagnumRaisaKonser! Mwa ha ha ha! Akan ada merchandise #MagnumRaisaKonser juga disini. Oiya dan ada Buy Pick Me Up jugaaa http://t.co/P3B6RfgQdF Yang udah tuker tiket #MagnumRaisaKonser jangan lupa baca flyers-nya yaa, ada surprise dari @mymagnumid :D Siapa yang udah di Istoraaaaa??? Twitpic ya pake #MagnumRaisaKonser Supaya #MagnumRaisaKonser bisa berjalan nyaman, mari kita ikuti peraturan yang ada ya :) http://t.co/lok2zspS0V anyway, ada yg udh tuker tiket #magnumraisakonser blm? share fotonya dong! jgn lupa pake hashtagnya ya biar aku bisa liat.. good morning! today is the day! finally, nanti mlm kita berkumpul, nyanyi bareng dan senang2 di #magnumraisakonser! http://t.co/aR1ITAthAx makin deg degan! semoga semuanya lancar! #magnumraisakonser http://t.co/IOoOqo0iXQ Disini nih kamu bisa tukar tiket dan beli tiket #MagnumRaisaKonser http://t.co/lFgA5IXVLv selamat pagi! jgn lupa, hari ini udh bs tukerin tiket #magnumraisakonser di istora senayan lho! dari jam 10 sampe jam 7 mlm.. Siapin dresscode serba putih ya buat dateng ke konser aku. bakal ada surprise khusus dari @MyMagnumID buat kamu #MagnumRaisaKonser po! konsernya kan hari minggu! knp dari jumat udh di sana? hahaha!  https://t.co/7Anwzz11PV wah, udh byk yg jln ke jkt ya. semua @yourRAISA yg udh jln, hati2 ya. safe trip guys. see you at #magnumraisakonser ya! nah,fotonya kyk gini dong! haha! thanks ta! https://t.co/EYS7sQgQ0S share dong ke aku,lagu apa yg pgn kamu dgr di #MagnumRaisaKonser . tulis di kertas putih judul lagunya, trs twitpic ke aku ya. penasaran! :) kemarin udah selesai GR terakhir. bentuk #MagnumRaisaKonser makin keliatan. lagu2 jg udah rapih semua aransemennya. bakal beda deh lagunya! @yourRAISA_Bdg yeaaayy!! alhamdulillah..safe trip ya guys! see you at #MagnumRaisaKonser yaa!! ikutan kuisnya @GuveraID ya! bisa dapet tiket #MagnumRaisaKonser , sambil dengerin Jatuh Hati secara eksklusif lho! #RAISAIsBack ! woohoo! gak kerasa, #magnumraisakonser tinggal 2 hari lg!!! http://t.co/oftXQEKPzk @yourRAISA_Bdg waaa itu apaa? kok bs sampe berdarah? @101Jakfm Oke oke aku siaran lagi deh di Jak! Coba telepon manager aku ya! go get #magnumraisakonser tickets from @GuveraID!! sambil dengerin #RAISAJatuhHati jg ya..  :) http://t.co/eilcMLJpKh Kamu yg dtg ke #MagnumRaisaKonser jg bakal dapet ultimate gift dari @MyMagnumID lho! You will be the first to taste this! aaa 3 hari lg #magnumraisakonser!! makin deket, makin degdegan!! http://t.co/DDCxYGQKFZ seneng! #RAISAJatuhHati udh bs didenger di @GuveraID ! bisa dpt tiket #magnumraisakonser lagi! https://t.co/T7AnXaXcd1 GR pertama nihhh seru, tegang, bahagia campur semuaaaa! #MagnumRaisaKonser http://t.co/CWqrPuIfVx Gooood mooooorning guysss! H-4 menuju #MagnumRaisaKonser Semangat dan doakan semoga semua lancar yaa http://t.co/CZ9C7Lccp8 good news malam ini! tiket #magnumraisakonser hampir habiisss! go grab your Yellow Tickets! and see you at 24th! http://t.co/etu1nuJYTL Aku sangat berterimakasih jika Bapak @basuki_btp sudinya berkenan membaca undangan sederhana ini, salam hangat - Raisa Andriana :) Tentu akan menjadi sebuah hal yg sangat berharga jika Bapak @basuki_btp bisa turut hadir di konser aku nanti. Konser aku akan diselenggarakan tgl 24 Mei di Istora Senayan. Apakah Bapak @basuki_btp bersedia jadi tamu kehormatan? Selamat pagi Yth. Bapak @basuki_btp aku Raisa. Dengan segala hormat ingin mengundang Bapak ke konser aku. good news for today. kelas Green #magnumraisakonser udh sold out! woohoo! tinggal Yellow nih, go grab your ticket! http://t.co/sRlBWf9vCU H-7 #magnumraisakonser ada official merchandise nih! woohoo! yuk, choose and order now ke @WhereTheFans #magnumraisakonser http://t.co/RwnS0DtKX8 cerah bgt hari minggunya nih! i have good news for you guys..  :) \n#magnumraisakonser ihh seru amat, bs jd fotografer official di #magnumraisakonser ternyata.. caranya? cek di IG nya fotokonser sama nareend deh.. :) Di konser aku bakal ada surprise seru dari @MyMagnumID! penasaran?  surprise apa lagi ya yg bakal Magnum kasih? #MagnumRaisaKonser seneng bgt liat video baru Concert Diary #magnumraisakonser nih.. :) Selamat jalan om Didi Petet, salah satu aktor Indonesia terbaik. Semoga diberi tempat terbaik dan kekuatan utk keluarga almarhum, Amin.. Siap-siap!  https://t.co/5HmPQtXnHK yeayy! video baru Concert Diary aku buat #magnumraisakonser udah ada di http://t.co/lbDUT1rV63 nih! semoga suka ya.. liburrrr!! siapin buat #MagnumRaisaKonser Concert Diary nanti malam ahh! semoga gak ada masalah lg, jd bisa tepat waktu yah! :) @yizesperanza_ brp ya? rahasia.. yg pasti lbh byk dari biasanya.. tunggu di #magnumraisakonser yaa.. :) seneng bgt!! tiket kelas blue #MagnumRaisaKonser udh sold out jg! woohoo see you guys at may 24th! http://t.co/KPTQI9shId RT @yourRAISA_Bdg: makin gak sabar #MagnumRaisaKonser nih, yg mau berangkat bareng kita, tinggal 3 kursi tersisa loh1 cc: @raisa6690 http:/… selesai latihan, langsung meeting! all for #magnumraisakonser woohoo! it will be great! http://t.co/MLIrcG5Ypp Minggu depan #MagnumRaisaKonser Duh, aku makin deg-degan! Seru, senang, tegang, bersyukur semua jadi satu. Doakan semua lancar yaa :) good morning! keep your spirit high, and always aiming for the best! *nyeruput kopi* eh, mlm ini konser katy perry ya? wow, byk jg yg udh beli tiket ya.. thank you guys, much appreciate it! see you at #magnumraisakonser ya! latihan, latihan, latihan! #magnumraisakonser \nphoto: @arditop FotoKonser http://t.co/bF6lv4afMd Mereka udh 3 hari ga tidur!!!! Ya ampuuun. Good luck untuk 6 jam terakhir!! http://t.co/5j2bjJjKwY finally, Concert Diary terbaru #magnumraisakonser jd jg.. sblm tdr cek dulu yuk di http://t.co/lbDUT1rV63 duh, maaf ya..  #magnumraisakonser Concert Diary nya blm selesai.. dikit lg kookk..  :) @Mithacimit iya nih hashtagnya ganti skrg.. biar lbh seru! :) haha! diprotes.. foto yg tadi difoto dgn indah sama pak manajer tercinta,  @adryboim .. :D today.... keren ihh ini.. gimana kalo nanti udh jd buat #magnumraisakonser ya? http://t.co/A4LS4cTRwD selalu senang latihan buat #magnumraisakonser nih! byk ide2 seru di dlm studio! can't wait for you guys to hear it! http://t.co/nti3qxu1ae Jangan sampai kehabisan tiket #RaisaKonser2015 guys! Udah mulai sold out! :D http://t.co/EzErnW29eY Selamat pagi! Ada apa sih di http://t.co/Wfx073p0iC ? I'm so energized by this enthusiasm! I just really cant wait! Yuhuuu❤❤ tiket bisa dibeli di http://t.co/hZBYncZwk0 :) http://t.co/rcQb7htH5m always start the day with a good mood..  :) \"Ohana means family, family means that nobody gets left behind or forgotten\" we love our family, right? :) ada yg kelewatan nonton short movie aku? #CahayaCantikRaisa bisa ditonton di sini yaaa https://t.co/vDdFYQpU0m @PONDSTeens Happy Wedding Aji &amp; Mima 👫💑 http://t.co/fBCkhkzCHH long weekend! let's have some fun! ngapain ya? hahaha! yeaayyy! video Concert Diary #RAISAKonser2015 yg baru udh bisa diliat di http://t.co/lbDUT1rV63 woohoo! good morning! first thing first, a good cup of coffee to kickstart the day.. workshop selesai. mulai besok, latihan2 terus nih buat #RAISAKonser2015 ... workshop #RAISAKonser2015 seruu! music always filled with magic... good times! http://t.co/a6mJsRjM39 \"Love is putting someone else's needs before your own\" selamat pagi! @yourRAISA_Sbya @dahSyatMusik wiiiiii terimakasih Dahsyat! Sebelum tidur kita dengerin ini yuk, trus nyanyi bareng di #RaisaKonser2015 :) https://t.co/BXFt7GBf0i Support dari ayah dan ibu serta kaka berartiiii banget untuk persiapan menuju #RaisaKonser2015. Family is everything to me :) maaf bgt! concert diary #RAISAKonser2015 telat nih. technical problem.. sbntr lg ada kok. ttp tungguin di http://t.co/lbDUT1rV63 ya.. :) Terimakasih semua apresiasinya untuk #CahayaCantikRaisa, senang! sebentar lagi nih #CahayaCantikRaisa mulai di RCTI! jam 21.30, inget ya. duh,degdegan jadinya..haha! @PONDSTeens http://t.co/3GXRvni4Nf baru inget! nanti mlm full movie #CahayaCantikRaisa di RCTI jam 21.30! kyk gmn sih filmnya? http://t.co/C5V12rJniL @PONDSTeens sblm tdr, liat trailer film baruku yuk di http://t.co/1ji4QAmcrJ full movienya di RCTI 23 April pkl 21.30 WIB #CahayaCantikRaisa @PONDSTeens siang2 dpt kiriman gambar desain panggung #RAISAKonser2015 bikin deg-degan! makin nggak sabar!! can't wait! see my journey on #CahayaCantikRaisa . nggak lama lagi tayang nih! woohoo! @PONDSTeens http://t.co/QGwFHAxM9k selesai jg bikin video concert diary #RAISAKonser2015..mudah mudahan jdnya bagus... waa byk amat pertanyaan #RAISAKonser2015 nya! thank you guys! pilih2 dulu ya. nanti liat jawaban aku di Concert Diary minggu ini! skrg mau Q&amp;A ah di sini! ada yg mau nanya soal #RAISAKonser2015 gak ya? nnti aku pilih bbrp yg bakal aku jawab. aku tunggu smp jam 8 ya. :) ihiiyy! maen film! hahaha! http://t.co/WMGr8hD6i4 Press screening Cahaya Cantik Raisa, deg-degan :) Tadi malam di Lampung yg super seru! Photo courtesy: @Msteffiano http://t.co/AGKEKTSvqW Pond's Miracle Concert, \"Express to Impress\". gak sbr liat tmn2 di @PondsIndonesia #ExpressToImpress! Nonton brg yuk! http://t.co/vXiNGnKuF8 nah, ini di lampung nanti mlm.. yukk kita nyanyi bareng! http://t.co/zcBkMZoPp6 salah! td maksudnya, td pagi mau beli kopi, eh dikasih ini, haha, makasih bgt ya, that's a very kind of you..  :) http://t.co/HaTI1JIPVg halo halo bandung... RT @infobdg: TOMORROW! @raisa6690 will be @atmospherecafe start 7pm | Enjoy the perform w/ romantic environment. Be there! http://t.co/jhDw… Udah jam 7! Magnum presents: Raisa Concert Diary-nya udah on air https://t.co/DRe0GZCK4W #RAISAKonser2015 hari kamis! jgn lupa nanti ada #RAISAKonser2015 Concert Diary ini ya! videonya dikiiiittt lg selesai.... :) http://t.co/LIbpevF0BF selesai jg Q&amp;A di http://t.co/9U8kHyoKRz nya.. seru2 nanyanya! thank you guys! http://t.co/PRte0cGA7p Telat dikit ya masih makan bakso nih udah mau jam 4 nih! sebentar lg Q&amp;A aku mulai ya! yuk, ngobrolin soal #RAISAKonser2015 di http://t.co/9U8kHyoKRz :) Guys! Jangan lupa yaa live Q&amp;A di Facebook Fanpage aku : http://t.co/9U8kHyoKRz , aku sudah standbyyyy :) See you! I want to practice squash 4x a week so i can break the wall with my smash! #betterforit @NikeIndonesia pagi2 dibangunin sama dia nih... mukanya lucuuuu! http://t.co/igiJHBjBQG heyy! nice to meet you too!  :)  \"@Y_FarinaJKT48: Nice to meet you kak!💕💕 @raisa6690 http://t.co/MbByJdET8U\" siap2 dulu ahh.. nanti mlm mau ngobrol2 nih.. mau ngasih sneak peek buat #RAISAKonser2015 juga ahh...  :) http://t.co/NDTcCWPHwk RT @yourRAISA_Bdg: Dari Bandung mau datang ke #RAISAKonser2015 tapi bingung transport? ikut rombongan kita yuk, cekidot cc: @raisa6690 http… jd inget momen waktu UN dulu.. hihihi.. Sukses ya UN-nya! manggung td mlm seru banget, enak banget, asik banget!! yogyaaaa.... Ready for Dental Project 2015, Jogja 👌 http://t.co/x7nW8v29U6 RT @yourRAISA_Jogja: Senengnya bsa ngumpul bareng @yourRAISA_Smrg  @yourRAISA &amp; ga sabar buat nyanyi bareng ka yaya @raisa6690 ntr malem 😁 … RT @dentalproject_: Tinggal beberapa jam lagi buat ketemu RAN dan Raisa ihiiyy Siap-siap aku akan on air di @895jizfm  Jogja, see yaa cari sarapan dulu ahh.. tp ngantuk, zzz... Jogjaaaaaaa udah ada video baru di http://t.co/lbDUT1rV63 !! woohoo! #RAISAKonser2015 siap2 yah. sebentar lg nih di http://t.co/lbDUT1rV63 !! video baru buat #RAISAKonser2015! woohoo! http://t.co/N6X1BmiA5A workshop #RAISAKonser2015 hari ini seru bgt! sedikit bocoran dari workshop hari ini nih..  :) http://t.co/XjOZ0JNqJo https://t.co/TcgUk38pc3 https://t.co/gLa6MWpzar RT @MyMagnumID: Magnum presents @raisa6690 Live in Concert! Save the date, May 24th 2015. http://t.co/eKymdDet9y http://t.co/ZmUoT0nkZD asik! sbntar lg ada video baru di http://t.co/lbDUT1JwuD nih! videonya soal #RAISAKonser2015 dong! hahaha! @asepiwansetia1 wah apa kabar? Sukses terus ya selamat pagi! udh di jln aja nih jam segini.  siap2 ya, nanti aku nyanyi di @dahSyatMusik lho.. let's go! semangat! besok pagi aku bakalan ke @dahSyatMusik bareng @PONDSTeens ! woohoo, nyanyi bareng pagi2 yuk! foto2 pas semalam manggung di medan. knp posenya kayak lg jd MC ya? hahaha.. http://t.co/CDzqp1Hg1Z eh,udh lama ya gak post video di http://t.co/lbDUT1JwuD ... bikin lagi ahh! Meeting #RAISAKonser2015 sekalian sarapan pagi ini di bandara Kuala Namu. Bye Medan! http://t.co/7ILivC6LGZ malam mingguan di medan.. ngapain ya? kuliner lah! hahaha! Kalo nggak salah 7 minggu lagi menjelang 24 May ya! #RAISAKonser2015 Kemarin dikasih denger @adryboim 2 single-nya @BARASUARA yang udah dimixing. Makin nggak sabar pengen cepet2 rilis album @BARASUARA Medaaaan!!! Jam 5 nanti aku on stage ya acara Telkomsel 4G di Centre Point Medan. Sampai ketemu, see yaaa ternyata skrg beli tiket #RAISAKonser2015 gak cuma online doang, bisa beli langsung jg di outlet 7-11! hoorreee! @MyMagnumID Presents : RAISA LIVE IN CONCERT Jkt, 24.5.15 Yang belum punya tiketnya yuk langsung dibeli! http://t.co/OOjQt7umab wiii sebentar lg long weekend! good morning, good people! abis meeting soal #RAISAKonser2015, skrg makan siang dulu kali ya.. gak kerasa, udh tinggal 2 bln lg persiapan konsernya! woohoo! Happy weekend! Sampe ketemu nanti malam di event Nissan March Invashion di MKG 3, jam 19:00 innalillahi wa inna ilaihi rojiun.. turut berduka cita atas meninggalnya olga syahputra.. press conference #RAISAKonser2015 td sore. seneng bgt ihh, makin dkt konsernya! woohoo! @DyandraEnt http://t.co/5ACL4GmIsd RT @DyandraEnt: Masih cari ticket #RAISAKonser2015 ini pricelist &amp; layoutnya http://t.co/hZBYncZwk0   http://t.co/IOMULuCJfn kenapa sih ya belakangan ini hujan deres melulu..  :( eh tapi, nanti mlm konsernya @onedirection ya? tiba2 ujan deres ya.. pas banget adem gini santai2 dulu... knp kalo abis squash itu capeknya berasa banget.... waaa, dapet ini dari @yourRAISA_Jogja ! makasih bangeett.. makasih jg mlm ini udh nyanyi brg2 ya.. :) http://t.co/AA2ZZFmU1X udah lama gak nyanyi seseru ini!! thank you semuaaa... yeaaayyy, VIP sama VVIP sold out!! alhamdulillah.. get your tickets now, guys! #RAISAKonser2015 http://t.co/wSjNtmYDea waa, hari ini dpt kabar bagus lg! seneenngg!! #RAISAKonser2015 super happy to #CelebratePleasure with @MyMagnumID ! td mlm seru, td pagi jg seruu! glad to be part of it, thanks! http://t.co/y7W9nlJWLh thank you @MyMagnumID RT @MyMagnumID: What a pretty girl at the party, hope you enjoy the night :) #CelebratePleasure http://t.co/6z62msj2Dq Having fun with @BeckTum at @MyMagnumID birthday party! #CelebratePleasure http://t.co/yAgfldJXDn What a cool art installation by @MyMagnumID. keren bgt! Congrats for the 5th Anniversary, Magnum! #CelebratePleasure http://t.co/YG0hnNeyoq jam segini masih meeting. semangat buat #RAISAKonser2015 ! woohoo! Wiiih! :) RT @yourRAISA_Bdg: @raisa6690 dari Bandung insyaAlloh rombongan satu bus ke Istora kak, berasa mau study tour Exciteeeed!!! Tiket VIP udah sold out. Ayo ajak uwa tante oom ceuceu teteh kakang dan aa-nya nonton #RAISAKonser2015 http://t.co/uuSbOnwgTW Amazing birthday invitation by @MyMagnumID! See you there guys #CelebratePleasure http://t.co/11d2qB3fAd oh! gini caranya.. wait. dapet kiriman, tp gak tau cara bukanya!! hahaha... @tyassyasss udah bisa dibeli kok tiketnya.. cek di http://t.co/Wfx0737oU2 yaa... alhamdulillah, project yg itu selesai. skrg, fokus lg ke #RAISAKonser2015 ! woohoo! @RiafmSolo halo Solo! @rasifm @VithaRasifm @rara_go19 waaah! trimakasih RasiFM Magetan! it's gonna be a looonngg day... semoga gak capek2 bgt.. Akhirnya ganti foto juga Sekali lagi trimakasih temen-temen yang udah beli tiket #RAISAKonser2015 . Yang cari tiketnya bisa langsung kontak @DyandraEnt ya Mau kasih tau buat temen2 yang udah beli tiket #RAISAKonser2015 hati2 pas upload barcode reservasi tiket. Takut disalahgunain nanti wow! seneng deh liat respon #RAISAKonser2015! siapa yg udh beli? Biar tttp update sama info terbaru, aku sering baca @okezonenews. Baca deh! Banyak info seru, cek langsung aja di http://t.co/g4FS1OrCjP jamnya macet bgt nih ya.. duduk diem dulu aja deh.. akhirnya bisa istirahat juga... huff.. tau gak, ada peninggalan kuliner tiongkok yg enak bgt di indonesia? itu lho loenpia semarang! enak bgt!  #inikulinerku masakan indonesia emg paling juara ya enaknya... gak pernah bosen! td smpt bingung bc tulisan tamu ajib lapo. taunya tulisannya hrsnya tamu wajib lapor, haha! Yg lg di JJF 2015 mana nih?  Mampir ke booth @MLDSPOT &amp; mainin tantangan #MLDSpotTheBeat di sini yuk! http://t.co/2I3aoyG24o hihi seneng deh lagu yg td udah keluar..  :) RT @DisneyFilmsIndo: Yuk lihat 'Mimpi Adalah Harapan Hati' versi @raisa6690 di http://t.co/G3Q7vaH6l2 #MyCinderellaMoment lg baca @okezonenews nemu artikel ciri2 calon suami berkualitas di http://t.co/HWAoFJ2Xi1. Cb dibaca siapa tau kamu lg butuh infonya nih :p tp tiba2 ujan.. jd males ngapa ngapain, haha! duduk smbl baca2 aja deh ya..  :p it's saturday, let's have some fun! #MLDSpotTheBeat itu game buat ngetes seberapa kenal kamu sama penyanyi Jazz. Yuk cobain! http://t.co/1ThYidJ532 http://t.co/gkZLjmyrme sambil nunggu, main game dulu boleh kali ya..  :p Mana @thepopoh beraninya cuma segitu? :p ini harga tiket dan layout #RAISAKonser2015 tanggal 24 Mei 2015 nanti! udah bs dibeli lho tiketnya! aaa exciteedd! http://t.co/w0KBXEiPgR siap-siap ya, aku mau share detail #RAISAKonser2015 nih! wah,Jessie J ada di Java Jazz! Main game #MLDSpotTheBeat \nah biar dpt 3 Day Pass &amp; Special Show tiket JJF 2015! http://t.co/1ThYidJ532 td jg ngobrol seru2, dpt input lagu2 baru yang seru2... menyenangkan! it's done! seruuu tour radio di bandung hari ini! makasih yaaa... http://t.co/sZm1Vrrg0I tp tetep dong, but first, coffee... :p selamat pagi! hari ini mau muter2 bandung seharian, aaaa menyenangkan! mlm minggu sendirian?  Main #MLDSpotTheBeat http://t.co/1ThYidJ532 yuk! hadiahnya 3 Day Pass &amp; Special Show JJF2015! http://t.co/ghzhi9GV68 it's saturday, let's have some fun! Ini dia! My first ever solo concert in Indonesia! Inget tanggalnya ya, 24 Mei 2015.. woohoo!! #RAISAKonser2015 http://t.co/ZuBDuxTgSs sebentar lagi niiihh!!! aku mau share info soal #RAISAKonser2015 ! excited! woohoo! eh eh eh, aku punya yang seru2 nihh!!! #RAISAKonser2015 masih ngakak sendiri gara2 lihat gambarnya @thepopoh tadi mlm..hahaha! Stanby yaaa RT @DeltaFMJogja: Sebentar lagi ada Raisa @raisa6690 #NYAWER di #InThemorning bareng @Asri_Welas @St_agustaf. Tarik Maaangggggg Aih! xp RT @thepopoh: Hay @raisa6690 ...TATAP MATA SAYA.. http://t.co/eVajYzjJRl @OZRadioJakarta wohooo! @DUTAFM_BALI @Dika_Prayudis wiiih terimakasih Duta FM Bali aku siaran di @101Jakfm , sekarang! dengerin yaaa... seru niihhh... hahaha! tadi pagi sporty bgt, sekarang baru berasa capeknya... Tes knowledge soal jazz dan dapetin 3 Day Pass &amp; Special Show Ticket JJF2015 di sini yuk http://t.co/1ThYie0GrC #MLDSpotTheBeat di tempat ini lagunya jazz mulu...nggak ada playlist lain kayaknya...hahaha! @chykaalrs amin! makasih banget doanya ya. nonton gak nanti konser aku? :) hari ini....meeting terus kayaknya. hahaha! @ApriliaUtr haha! bikin memenya dong. :p @ElfaraFM yeay thank you! @gitAplus iya benar tapi yang versi bahasa Indonesia ya @AnnisaNovi01 udah dong! ada warteg enak deket kantor management aku @Cahyanniii yang dari Malang aja ke Jakarta nonton konser aku Mei besok :) Hahaha, amiiin! nggak apa ya sekali nge RT meme ttg aku :p RT @fajarx3m: @raisa6690  ;) http://t.co/unEmq4OeFk @khols13 belum nih, ada ide? Haloooooo!!!! tapi...kangen mangguunggg!!! menuju meeting berikutnya. hari ini produktif bgt kayaknya... ini jd pengalaman br buat aku. musiknya @BARASUARA jg beda bgt sama aku, tp bagus bgt! nggak sabar albumnya selesai!! #RAISA2015 nah,ini nih @BARASUARA ! lg pada di studio nih skrg. tungguin albumnya ya. dgr lagunya di http://t.co/Ol8D9JHyrx ya.. http://t.co/EqFbXvutWB di thn ini,aku sama @adryboim , jd executive producer buat band rock keren, @BARASUARA ! woohoo! #RAISA2015 udah selesai mkn, sbntar lagi mau ngasih tahu sesuatu soal #RAISA2015 deh! :) but first, like I always do... :) http://t.co/fKV8IgsQcx oh iya, hari ini kayaknya aku mau kasih tau #RAISA2015 nihh!! semoga udah selesai, jd bisa di share..amin! :) banyak yg gak libur jg ya...gpp, semangat! besok kan udah libur...! selalu pgn ketawa kalo denger istilah hari kejepit..hahaha! good morning guys! hari kejepit nih ya. ada yg libur gak? @KuntoAjiW - Terlalu Lama Sendiri masih jadi jagoan belakangan ini. Iya nggak @adryboim? Sukses terus mas Aji! @sayaaniss aduh, kucing aku lg ngumpet di lemari mulu! @anggunms_ nah, ide bagus tuh masak..bener juga. :) @gandyss di mana yg ujan? jamnya bingung mau ngapain kalo lg gak ada kerjaan...... wah, akhirnya udah selesai! asik, bisa dishare di tgl 20! #RAISA2015 dan sekarang, kenapa jalanan macet banget?! project dadakan itu selesai juga..alhamdulillah bisa juga sengebut itu.. siap2 buat project dadakan besok! bakalan seru banget nih harusnya.. masih ada yg blm liat video #RAISAJatuhHati nggak sih? :p \nhttp://t.co/qu35IeGAeN mentang2 friday the 13th, macetnya jadi ngeri banget... mumpung lg gak ujan,workshop lagu2 dulu ahhh... whoaaa, seneng bgt byk yg antusias sm konser aku!! thank you...nanti bakal aku share detailnya. jgn lp ntn! hahaha! http://t.co/mfAiHIyJP6 coming soon...may 2015! woohoo!!! can't wait! http://t.co/MF6q3w79aS hujan dari semalam, katanya byk jlnan yg mulai banjir. be safe, guys! abis pallubasa, langsung siap2 ke radio. let's go to @madamaradio! http://t.co/RTNFU2kxtd pagi2 udah di bandara. Here we go, makassar! hari ini produktif bgt, seneng! duh, harus ke dokter itu gak enak banget ya.. :( baru plg dari malang, langsung meeting super serius! semoga lancar semuanya, amin.. @DyandraEnt http://t.co/715mgp1AVB Nggak sabar buat kasih pengumuman project aku, manager aku @adryboim, @BARASUARA Haha! Lagi sering main ke channel Youtube-nya @BARASUARA Silahkan dicek https://t.co/3DPRtCHqka manggung dulu deh. nyanyinya jam 2 soalnya. abis itu baru, kuliner! hahaha! touchdown malang! manggung dulu apa kuliner dulu ya? hahaha! besok ke malang! yeayy!! nyanyi bareng di mal olympic garden jam 2 ya besok..see you! waaa makasih @InfotaimentSCTV ! aku menang Selebriti Paling Memikat ... hihihi.. jadi malu... terima kasiihh! nanti mau kumpul2 sama tim...makaan makaaaannn! hahahaa! jam2 bingung miilih mau makan siang apa... oh iya, skrg video klip #RAISAJatuhHati udah ada di youtube aku! http://t.co/M8x64up0nX pilih2 lagu dulu buat playlist hari ini.. :) good morning! cerah nih pagi ini..semoga hari ini menyenangkan! semangaatttt!! ada yg udah hapal #RAISAJatuhHati belum? hihihihi.. iseng2 aku bikin nih... http://t.co/edoez6sDYS hari ini ceraahhh..menyenangkaannn... td disatronin @yourRAISA pas di @BensRadio.. haha! thank you guys! http://t.co/EnSHzAPUco yah, tukang makanannya gak ada... :( ngemil sore seru, sambil siap2 buat nanti mlm. dengerin lg ya, nanti aku ngobrol2 di @BensRadio jam 7 mlm! http://t.co/04kGQ2IHhP makasih yg td dengerin ngobrol2 di RRI pro 2 ya... skrg, makan siang dulu kali yaa.. besok pagi2 ngobrol lg di radio! jgn lupa dengerin di RRI Pro 2 yaa...  :) http://t.co/PORhQqXCvI nyanyi bareng itu selalu menyenangkan. thanks guys! anyway, kemarin di bdg, hari ini nyanyi di bekasi! woohoo! who's coming? udah lama gak olahraga, capek juga ya kalau langsung diforsir...hufff... udh lihat video klip #RAISAJatuhHati blm? What do you think? :)\n*degdegan* It's weekend! Let's have some fun! Nyanyi lg hari inii, woohoo! lg sering bgt baca kayaknya.. hahahaha.. nanti mlm ngobrol2 di @mustang88fm niihh!! dengerin yaaa... nyanyi gak ya nanti mlm? hihihi.. http://t.co/eSdsW9xfky hujan deraasss..enak banget sejuk giniii... semoga gak ada yang banjir ya gara2 hujan ini.. Terimakasih semua yang udah nonton VC #RAISAJatuhHati , yang dateng ke Largo! juga. Good Nite udah siap buat #RAISABacktoBasic nanti malam! see you di Largo... http://t.co/Z5j1BfsCQ9 degdegan tapi senengg bangett nihhh!! yeaayyy! oh iya, nanti malam aku jg mau ngasih #RAISAJatuhHati nihh!!! jam 7 ya, jgn lupa... :) http://t.co/jkwnX1UcID latihan lg dulu ahh buat #RAISABacktoBasic nanti malem... wiiii RT @ardanradio: ini track yg paling byk di request &gt;&gt; #NP @raisa6690  jatuh hati | #Ardanesia w/ @iqballaas &amp; @fauzyARDAN #GLOWING Happy Birthday mas @yoviewidianto!! Keep on making good music. but first, coffee.... :) http://t.co/A0FE9n0uyJ today is the day! gak sabar buat #RAISABacktoBasic !! woohoo! skrg istirahat dulu..siap2 buat besok! semoga #RAISABacktoBasic besok seruu! @Mithacimit oh iya dong, itu juga pasti. lg diurusin dulu sama tim aku..nanti pasti aku share infonya.. @fanboyyy_ iya nih, lagi diurusin sama tim aku duluuu.. yeaayy!! udh adaaa.. yuk lihat #RAISAJatuhHati di http://t.co/9U8kHyXWRb .. cek lagi yuk #RAISAJatuhHati di http://t.co/9U8kHyXWRb .... eh, udah ada blm ya? hahaha! gak sekarang, tapi hari ini koookk....lanjutannya dari #RAISAJatuhHati .. break latihan duluuu!! siap2 yaa...aku punya sesuatu buat kamuuu.. back in Jakarta! kerja lg yuuk! woohoo! bring it on 2015! http://t.co/xdOMUCjuqA gak akan pernah saya lupakan jasa dan nasihat bu arini. semoga mendapat tmpt terbaik di sisi Allah. selamat jalan bu... beliau yg pertamakali mengajarkan saya nyanyi.membuat saya percaya diri,beliau yg pertama bilang, \"yaya beneran bisa nyanyi\"... :( kaget dan sedih bgt dgr kbr guru saya,bu arini meninggal dunia. mohon doanya ya teman2... #RAISABacktoBasic .... SOLD OUT!! woohoo!! http://t.co/wRhlZpMC5t wooww! #RaisaBacktoBasic udah sold out tiketnyaa! thank you yg udh beli ya... seneengg deh.. gak sabaarr oh iya,hampir lupa. yg udh pesen tiket #RAISABacktoBasic ,konfirmasi pembayaran ke tim aku. kalo gak dikonfirmasi,tkt gak dpt tiketnya. :) kalau mau ikutan #RAISABacktoBasic , cek infonya di http://t.co/9U8kHyXWRb ya. di situ lengkap! :p ihhh, seneng deh udah banyak yang pesen tiket #RAISABacktoBasic ... @martinmubdi iyaa ada screening juga. tapi bakalan beda sama yg sebelumnya.. :) Ada yang tau nggak kenapa #RAISABacktoBasic dibikin di Largo? ini dia #RAISABacktoBasic ! yuukk nyanyi barenggg! http://t.co/sTxoZRQphw kemarin udah #RAISAJatuhHati kan? sebentar lagi... #RAISABacktoBasic !! Woohoo! seneng bgt liat sambutan #RAISAJatuhHati ... gak sabar pengen ngasih lanjutannya.. :p sebentar lg liburannya selesaii...nggak sabar ihh pengen nyanyi lagi..woohoo! kemarin lg beres2 tas tiba2 nemu ini..ihihih.. thank you @heyoxy ..terharu jadinya... :) http://t.co/jAyqKvOk8u liburan kali ini ketemu angin kencang mulu. kemarin sampe 43 km/jam anginnya! wow! waaaa,kmrn #RAISAJatuhHati sempet jd trending topic di Indonesia? woohoo! Thank you guys! semoga kamu suka lagunya.. http://t.co/WF4SJtuT0k RT @yourRAISA_Sbya: Yuhu yg belum dengerin lagu kak @raisa6690 #RAISAJatuhHati tenang aja nnti di @jejeradiosby jam 5 rek, Ojok lali... RT @ClassyFM: Now Airing @raisa6690 #JatuhHati #serentak @classyfm Padang Keep in tuneee Classy people ;;)))) @hasanjun hahahha! harus dengerin #RAISAJatuhHati dong!! RT @mettafmsolo: penasaran sama single terbarunya @raisa6690  #RAISAJatuhHati stay tune on 104,7 FM @mettafmsolo http://t.co/ifOgQVsFOC aaa udah ada yang muterin #RAISAJatuhHati yaaaa... ada yg udah denger? :) RT @keifmbatam: Kei Listeners &amp; @yourRAISA_BTM, 8 menit lagi km bakal dengerin kidung terbaru dr @raisa6690 - #JatuhHati. tetep konsen di 1… today is the day! let's go!  #RAISAJatuhHati di radio2 favorit kamu, seharian ini! woohoo! http://t.co/NICoNYiAJy besok sama2 kita dengerin ya #RAISAJatuhHati !! aaaa..gak sabaarrr!! nah ini dia yg bikin aku deg-degan tapi seneng! #RAISAJatuhHati http://t.co/b1hV2OAaYW udah liat video2 #RAISAJatuhHati di http://t.co/9U8kHyXWRb blm? hihihi.. liburan ini banyak lihat interior2 lucu nih..seneengg!! suka lupa hashtag sendiri.. hihihi..  :p makin dekeett.. gak sabaarr.. petualangan baru sedikit lg dimulaii...  :) #RAISAJatuhHati what makes me...  #RAISAJatuhHati\nhttp://t.co/Mogp3GAxSe #RAISAJatuhHati ... :))\nhttp://t.co/W5CUq10ZWO gak sabar..gak sabar..gak sabaarrrr!! semoga seruuuu..woohooo! udh pada masuk lg ya? semangat yaaa...sambil liat video ini ajaaa, hahaha! http://t.co/xdOMUCjuqA oh iya, sebelum liburan kemarin dpt ini dari @yourRAISA ... makasih bangeettt... you are the best, guys.. http://t.co/ud2E3CRJ5M liburaannya menyenangkaaannn woohoo!! @khalif_afka yes! betul..aku pun akan selalu bernyanyi dari hati, untuk hati kamu semua..thank you for your support.. terima kasih 2014 yg sangat seru! semoga di 2015, karya2 aku bisa selalu membuat kamu senang! woohoo! http://t.co/xdOMUCjuqA telat ya? hihihi.. udh keasikan siap2 mau liburan... hahahha! happy new year guys! semoga thn ini lbh seru, lbh bahagia, dan semua rencana berjalan lbh lancar.. amiinn!! @yourRAISA di hari terakhir tahun 2014, ini video terakhir aku untuk tahun ini..semoga suka videonya ya! #RaisaSG http://t.co/NBAFjvRZar banyak bgt yang bikin aku trs bersyukur di tahun ini...aku rilis klip LDR, dan...aku konser tunggal pertama kalinya di Singapore! woohoo! last day in 2014! tahun ini menyenangkan bangeettt! thank you for having me @IMS_NET! udah lama jg ya gak nyanyi pagi2, hahaha.. http://t.co/eLrHcWTKI2 skrg istirahat dulu.. besok pagi nyanyi di @ims_net niihh.. jam 6 pagiii.. nonton yaahhh..  :) latihan dulu buat main tahun baru nantiii.... alhamdulillah udah di Jakarta lagi. Tinggal 1 panggung terakhir di 2014, malam tahun baru di @SMS_Serpong ! dgr kbr pesawat airasia yg ilang kontak dr pagi. semoga cpt ada kbr bagus dan semua baik2 aja. mohon doanya ya tmn2.. batam, sabar yaa.. kita bakal nyanyi barengg sebentar lagii..  :) yg udh di venue,aku udh di backstage.kondisinya blm memungkinkan aku naik panggung.sabar ya sedikit lg,aku jg udh pgn bgt nyanyi bareengg.. di batam hujaann! yg di venue, be safe guys! Sampe di batam...belum libur nih? :p teriak2 nya tuh lagi latihan maksudnyaaaa..... :) @AdindaPK_ yeaayyy! thank you, semoga suka video2 nya yaa..subscribe channel YouTube aku yaaa.. :p @WidyaWwulanda iya, tenang aja...heheh..kamu nonton gak di palembang nanti? seru juga sore2 teriak2 gini..hihihih... make music for ears...words! have a great day good people! enaknya di rmh itu, dimasakin yg enak2 melulu... hahaha!  selama  pagi! aceh seru banget.. apalagi kopinya, enaaakkk bangeettt!!  hahaha.. touchdown jakarta! what a great trip! excited for tonight shooww! bakal seru banget nihhh!! woohoo! buat yg lg cari SMA tahun dpn &amp; ingin tahu lbh byk tentang ASBI, bisa cek disini  http://t.co/qEpYI3bdZj cc: @asbi_Indonesia #sekolahku td siang ngobrol sama sepupu kecil aku, milih mau SMA di mana itu seru banget yaaa..... manggung di bekasi biasanya seru banget! nanti malam harusnya seru banget jg niihhh... hahaha! begitu ngomong bekasi, langsung byk yg bilang soal beda planet nih..hahaha! jgn gituuuu... finally...hoommeee!! seru banget palu tadi malem..nanti malam, kita nyanyi bareng di bekasi square yaaa! jgn lupa ya, senin tgl 22 kita nyanyi brg di I Like Monday @HardRockCafeJKT ya! show terakhir di jkt tahun ini nih.. http://t.co/7WjSBgvyxU iyaa bnr bgt!! kamu bs tanya2 langsung ke @asbi_indonesia nih! RT @suryadipiero: Kak @raisa6690 apa bnr ASBI itu sekolah SMU berasrama ya? ada ga followers aku yg sekolah di @asbi_Indonesia atau alumni dari ASBI? ceritain dong serunya sekolah di ASBI #sekolahku seru bgt ngeliat anak2 pada ngerjain tugas sekolahnya, hihihi.. siap2 dulu buat harmoni cinta nanti mlm di palu biar seru...jauh ya mainnya? :p http://t.co/WjJ0szSsYW palubasa! makan siang maksimal, gak ada lawan nih! selamat makan siang! medaaannn!!! di kamar isinya bolu melulu ini..hahaha! sok semangat, padahal di pesawat nanti juga tidur..hahaha! pagi2 udah di bandara aja..yuk ah, let's hit it! woohoo! kerjaan hari ini, done! Woohoo! nggak kerasa, 2014 udh mau abis aja..lets make the best out of it. good morning! @ErvinaStar127 hahha! makasih udah download yaa.. udah download seri yang satu lagi? udh harus siap2 packing lg buat bbrp hari ke depan.... istirahat dulu sebentar ahh hari ini..berasa juga capeknya nih... :( udh sampe bdg, main2 ke @ardanradio ahh! dengerin obrolan aku jam 3 ya! wohoo, sebentar lg nih.. @raviPJ02 tgl 21 main di bekasi square kok.. :) lanjut lg yuk ah road tripnya..bikin playlist dulu buat tmn di jalan.. selamat hari minggu! sumedang menyenangkan! makasih bgt, energinya luar biasa td malam.. udah di jakarta lagi aja..tapi langsung jalan ke sumedang! tahuu...tahuuu!! hahaha!"}