{"tweets": "#HappyDiwali to each one of you 🤗 May your life be filled with light, hope, and happiness. Have a joyful Diwali! ✨✨✨ https://t.co/sQlnZxGhy6 Happy Diwali :) :) \n#SarileruNeekevvaru https://t.co/z7QGAGEvGp It's a first for us ❤Had a great time on this one !! Thank you team Sai Surya Developers for making this happen!!\nhttps://t.co/lnIsOH5O0o Asuran...raw real and intense... Cinema at its best👌Congratulations  \n@dhanushkraja @VetriMaaran  @prakashraaj @gvprakash @theVcreations @VelrajR and entire team #Asuran Situpapa...my baby bundle...♥♥♥ https://t.co/gNUyGVBy4s Happy birthday to my super producer @AnilSunkara1, wishing you success, good health, happiness and an incredible year ahead 🤗🤗🤗 Interesting and fun trailer! I wish the young team all the best :) Congratulations on your production debut @TheDeverakonda\n#MeekuMaathrameCheptha https://t.co/smbCVfDFTU Remembering the ‘Missile Man of India’ Dr. #APJAbdulKalam on his Birth Anniversary. A true symbol of Inspiration and Pride of our Country. You will surely continue to live in our hearts forever sir 🙏🙏🙏\n#RememberingAPJAbdulKalam It's official... #SarileruNeekevvaru in cinemas from Jan 12th, 2020!! This Sankranti will be my biggest and most special :):)\nThankyou @anilravipudi 🤗\n\n@vijayashanthi_m @iamRashmika @thisisDSP @RathnaveluDop @GMBents @AnilSunkara1 @AKentsOfficial @SVC_official https://t.co/Q7l0BPTH74 I'm a fan of Polaroid’s after this one 😊😊!!! Flying high at 42000ft ✈ \n#inflightclicks #enroutehome https://t.co/82jT0eixph Back to work and school 😍😍😍 https://t.co/6ODSZQfV9l Wishing our most Iconic director @ssrajamouli a very happy birthday. May you continue to inspire an entire generation of filmmakers. Have a great year ahead! 🎂🎂🎉 Overwhelmed by the phenomenal response #SarileruNeekevvaru poster has been receiving. Thank you so much for all ur love :) It makes my Dussehra even more special 🙏🙏 My favorite of the lot :) Thank you all for the phenomenal response! Thank you team @VOGUEIndia and @Anaita_Adajania for a rocking shoot 😎😎 https://t.co/ntaDQHfB7Q On this auspicious occasion, May  joy, prosperity and happiness be with you throughout the year. Have a joyous and blessed Dussehra 😊 https://t.co/eMv5yQTw3P Destroy the evil...Celebrate\nVijaya Dashami with pride!\n#HappyDussehra #SarileruNeekevvaru https://t.co/gxVCDffXbR You don’t have to be famous to be extraordinary, when ordinary is just as beautiful. Live Real. Be Humbl.\n\nCelebrate this season of joy with @thehumblco. Shop the festive collection at https://t.co/ioq6XaK9hE https://t.co/cFTuWJcXXx My most favorite place on earth !! The Swiss alps 😍😍Enjoying the short Dussehra break with the family ♥♥ back with batteries fully charged 😎😎😎 https://t.co/QvrWQcRUdz Special mention to @RathnaveluDop...Outstanding cinematography!! The best in recent times 👌👌👌 Amongst the scale, grandeur and visuals...the performance of #Chiranjeevi garu stands tall👏👏👏#SyeRaa is a must watch!!\nCongrats to #RamCharan  @DirSurender and entire team. A salute to the man who led us to Freedom – of thought, word and action. Remembering the man who brought us together in the fight for our freedom.  \n#GandhiJayanti #Gandhiat150 #Respect 🙏🏻 https://t.co/ByT0Itc2lC #OoranthaAnukuntunnaru trailer looks refreshing...Enjoyed every bit of it :) Wishing @NawinVK\nand his team all the very best for its release. \nhttps://t.co/t2xrVClnNQ Extremely sad to hear about the demise of Venu Madhav garu. May his soul rest in peace. Extending my heartfelt condolences to his family and loved ones. Congratulations to our Legendary @SrBachchan sir on being honored with the eminent #DadaSahebPhalkeAward 👏👏 Your contribution to Indian cinema is unparalleled...Thank you for always inspiring us 🙏 Thoroughly enjoyed watching #GaddalaKondaGanesh! @IAmVarunTej as Ganesh was exceptional👌 Great work by @harish2you and @14ReelsPlus 👏👏 Congratulations to the entire team on the well-deserved success 👍👍👍 Happy Daughter's day my lil one...Sita Papa❤❤ you are my most adorable, lovely, and naughty daughter ever! Love you forever!😘😘 Shine bright always ✨✨ https://t.co/bCGhwyvF53 Exceptional visuals. The grandeur of the film is evident in every frame of the trailer! Chiranjeevi garu...👌👏👍 @SrBachchan sir #RamCharan @DirSurender @RathnaveluDop &amp; the entire team... great work!!! Looking forward to Sye Raa Narasimha Reddy! Introducing...\nMy sound recordist Nagara Ramu, as we all fondly call him 😊😊 who's been with me since my very first film!!! He has never seen another set except mine 🤗🤗 Respect and love for always being there for… https://t.co/QsgjytWsS2 She’s always got my back 😊😊\n\nThanks for the super pic @avigowariker https://t.co/wYh3bHF58c Wishing our Hon'ble PM @narendramodi ji a very happy birthday, good health, happiness and all the strength to take our country forward!! It all started here ..⏳\nYear - 1989\nLocation - Sets of Koduku Diddina Kapuram\n.\n.\n30 years later ⌛\n.\n.\nI'm working with @vijayashanthi_m garu once again in #SarileruNeekevvaru... life has come a full circle...😇\n#throwbackthursday #nostalgia https://t.co/cEjrPhadKr May you have abundance of joy, good health and immense prosperity. Wishing you all a very #HappyOnam 😊 Dengue &amp; viral fever has become an epidemic in the city. Do an extra bit in keeping your premises &amp; neighborhood free from water stagnation. Be vigilant &amp; take care of yourself, Hyderabad. https://t.co/R3IRomAQjN Success is not a destination, it's a journey &amp; @isro had a historical journey with #Chandrayaan2. I salute each &amp; every scientist working on this project🙏You are our real heroes &amp; we are with you. This is just the beginning of your success story. Way to go🙌\n#MissionMoon Wishing you all a very Happy Ganesh Chaturthi🙏 May the grace of God keep enlightening your lives and bless you always 😊 \n#GaneshChaturthi2019 https://t.co/BckRR3b92x The best picture ever... your in ur teens now ❤❤ how time flies...be the light of our lives... love you my boy... Gautam🤗 https://t.co/v3j9u5Z88O Wishing u a happy 13th my son, Gautam! Ur officially a teenager :) :)  \nCelebrate your adolescence with loads of fun &amp; adventure! ♥♥ https://t.co/Ku3g0wU4ww Extremely happy @amb_cinemas has won 'Best Multiplex of the Year' at the #BigCineAwards2019. Hearty congratulations to the entire team for your contribution &amp; hardwork!!!👏👏 \n#AMBcinemas 💪 https://t.co/7OzxQ6A4uL Indelible moment to celebrate. She is our golden queen ! Congratulations @PvSindhu1 on this memorable win !! Extremely proud 👏👏👏\n#BadmintonWorldChampionships\n#BWFWC2019 #PVSindhu https://t.co/MOAVqZxgGk Watched #Evaru!!! An edge of the seat thriller with a remarkable concept 👌Well directed &amp; an extremely well executed film. Congratulations to @AdiviSesh &amp; the entire team on its success👍👍 The lungs of our planet are burning... the biodiversity is suffering.  Let's do our bit to protect our earth... take a step forward to go green. Let's start at home! \n#GoGreen #PlantMoreTrees #ReduceCarbonEmissions Deeply disturbing news... the #AmazonRainforest, rightfully called the 'lungs of our planet'... contributing to 20% of the world's oxygen is on fire!!! This is a wake-up call for all of us who are taking our planet for granted... #PrayfortheAmazon https://t.co/FNbSJnyNvJ Happy Independence Day... Jai Hind 🇮🇳🇮🇳🇮🇳\n#SarileruNeekevvaru https://t.co/jbViMg09h7 Jai Hind 🇮🇳🇮🇳🇮🇳\n #SarileruTitleSong\n#IndependenceDayIndia #SarileruNeekevvaru 🇮🇳\nhttps://t.co/Y1iX9mgG0B To all the martyrs who laid down their lives to serve our nation. To every soldier who stands brave, tall &amp; fearless in front of enemy lines...Let's salute each one of them today &amp; everyday! Value your freedom... Jai Hind🇮🇳🇮🇳🇮🇳\n#ProudIndian #IndependenceDayIndia @vijayashanthi_m @AnilRavipudi Welcome aboard, Vijayashanthi garu😎😎😎 Eid Mubarak to all those celebrating the festival around the world. May the festival strengthen the spirit of peace, love, happiness, and togetherness!!! \n#EidAlAdha 🙏 https://t.co/1pZMekM7yc @KTRTRS Thanks @KTRTRS 🤗🤗🤗 Many many thanks to you @AnilRavipudi . Playing Major Ajay Krishna is an honour🙏 \n#SarileruNeekevvaru https://t.co/EeZ9lcy9Az Extremely happy and proud of this one! @thehumblco is LIVE on Spoyl😊\nhttps://t.co/59Hiw2yrmG https://t.co/2almDfRASG Wishing you a very Happy Birthday Devi @ThisIsDSP 🥁\nCheers to all your blockbuster albums and bigger cheers for our blockbusters together 🤟 #SelfieofSuccess - An Amazon bestseller \nhttps://t.co/lQJK6m20q7 https://t.co/oOSwiUHjdX Our Humbl endeavour unveils today. Thank you all for the astounding response 🤗🤗 For us, The Humbl Co. is not just clothing, it’s a way of life. We welcome you all to the @thehumblco family. Stay tuned for the launch on 7th August! \n#theHUMBLco https://t.co/eLAR13jBgt Had a great time last night 😊😊\nWishing you a very Happy Birthday @directorvamshi... Have an awesome year ahead🤗🤗🤗 https://t.co/JETJ4OhPwQ RT @MBofficialTeam: It all starts with Humbl beginnings. Sharing something exciting, something real we have been working on. \nClick on the… Wishing you a very happy birthday @KTRTRS. Have a great year ahead🤗🤗🤗 @VVSLaxman281 Thank you very much @VVSLaxman281 sir. Glad you liked our film :) Another giant leap... this time towards the south pole of the moon, an achievement credited only to INDIA💪Congratulations to @ISRO &amp; the team of scientists on the successful launch of #Chandrayaan2🚀🌕... Moment of great pride for the entire nation! Jai Hind🇮🇳\n#IndiaMoonMission https://t.co/QwcTPUxeWu Happy Birthday, Sitara💖💖💖. Time is flying too fast and every moment spent with you is very, very special. May you have a life with an abundance of love, happiness &amp; positivity always🎂🎉🎈 God Bless you 😘🤗💕🥳🧚‍♀🌸 Love… https://t.co/4c4V3OjlRO @IamJagguBhai Thank you sir. Love &amp; Respect always... :) Some fun time for these little girls!!! Enjoy ur YouTube stint ♥♥ Wishing you two all the very BEST 👍👍👍\n#AadyaSitara 🤗\n\nhttps://t.co/Do5SQfqa4j Still hungover from last night's match... Most exciting finals ever👏👏👏\nGreat cricket!!! England might have won the game but New Zealand  surely won hearts. Congratulations to both the sides! 👏\n#CWC19 https://t.co/Kaq6LbKKZj Happy birthday Pattabhi !! Love &amp; Respect always 😊 https://t.co/5T1LggnnDf Happy birthday, @vijayashanthi_m garu... \nLooking forward to working with you again😊 Have a great year...👍🏻 Revolutionary and Exemplary!!! Congratulations to @TelanganaCMO &amp; @KTRTRS on the inauguration of a state of the art &amp; world's largest irrigation project in Telangana. Hats off to the engineers! 👏👏👏\n#KaleshwaramProject Happy Father's Day nanna...♥♥\nThank you for always inspiring me to be the best version of myself !! https://t.co/qAwZ64uSpu Wishing the most talented and visionary director of our time &amp; my dear friend @sivakoratala a Happy Birthday!!! Have a great year sir :) https://t.co/0B1mQtr7CY Regent Street...👌👌👌😎😎😎 https://t.co/GzqPpURJSr With the legend himself... Andy Roberts... huge fanboy moment 😎😎😎 https://t.co/IbFxaY0ltl Unbelievable energy at The Oval... Just awesome!!\n#INDvAUS🏏 https://t.co/9Hn1UulRW5 This one's for my boy...🏏 ♥♥ \n#INDvAUS @ The Oval https://t.co/35MgIm1nwc London bound ♥♥♥\n#CelebratingMaharshi https://t.co/2H15Rwm1aQ Awesome time in Germany !! Now off to Italy ♥♥♥\n#CelebratingMaharshi https://t.co/7Xg2cD7VxC Happy Eid😊 May you all be blessed with love, peace and prosperity... \n#EidMubarak #EidUlFitr https://t.co/rVjC6mv0Ht Sankranti 2020...🥳 All geared up!!! 😎😎\n#SarileruNeekevvaru\n\n@AnilRavipudi @AnilSunkara1 @SVC_Official @GMBEnts https://t.co/2hrDY9gq5M Wishing the inspiration of my life, my father, the evergreen Superstar a very Happy Birthday ❤❤❤\n#Happy75thBirthdaySuperstarKrishna The impact of Maharshi!!! 👏👏👏\n#FarmerisKing https://t.co/x91vwTDbmL Happiness &amp; bliss ♥♥♥\n#CelebratingMaharshi https://t.co/3sdYwAanQj Big congratulations to @JayGalla for winning the MP seat second time around!! Very proud :) Had a great time interacting with the young minds 😊😊\n#CelebratingMaharshi\nhttps://t.co/g2TesbxPFy Congratulations @ysjagan on your landslide victory in Andhra Pradesh. May the state achieve great heights of success and prosperity in your tenure as the CM. 👍👍 Honorable Prime Minister @narendramodi ji, many congratulations on your glorious win. May the nation continue to prosper and grow under your leadership 🙏🏻🙏🏻 Happiness\n#CelebratingMaharshi ♥♥♥ https://t.co/Z5ZcwL2Yuf Off to another memorable holiday... This one is special...♥♥\n#CelebratingMaharshi https://t.co/aB3XqQfJbS Continue making films with ur heart like #Maharshi, and win hearts.\nLove and Respect.. https://t.co/feOgMHGBD1 .@directorvamshi u have given me my finest and proudest film till date... still remember the day when u said no one else can play this part other than Mahesh Babu. That for me, brother, is the biggest compliment ever. Will always be grateful to you... The success of celebrating Maharshi with the entire team last night in Vijaywada was an evening I will always cherish.  To all the audiences of Telugu cinema and my dear fans Thankyou for this overwhelming and magical success of Maharshi🙏🙏🙏 Thank you, Vijayawada 🙏 https://t.co/vBdvJtXtrk An interaction with the real life Maharshis; people from different professions who chose to become farmers, has been extremely enriching and will be an unforgettable experience for me. \n\nAll you farmers, you are the real Superstars! 🤗🤗\nhttps://t.co/lwC5hLalDQ Nuvvani Idhi Needani... a song very close to my heart :) \nhttps://t.co/B8X1YiPz3X Sir.. This is such an honour for me personally &amp; our whole team... it can't get better than this. Thank you Sir, your words have inspired us to keep doing more films like \"Maharshi\".. on behalf of Team Maharshi... humbled, Sir. 🙏🙏🙏 https://t.co/ML50Cf6QgJ The best hands I have ever held are my mother's. My children are also growing up holding their mother's. Need nothing more. #Blessed 🙏🙏\nHere's to the most important people in my life... My… https://t.co/wA9aHdW1rq #WeekendAgriculture has caught up now &amp; this is the beginning for a great future... not just for our generation but for generations to come...  \nBig thumbs up to people like @madhurasreedhar &amp;  @amit5284sajane for taking this great initiative on their shoulders. 👍👍 https://t.co/ctspZISP4E #Maharshi... Blockbusters are always special but when the motive of your film impacts &amp; inspire lives the feeling is immeasurable... @directorvamshi 🙌\n#AgricultureChallenge #FarmerIsKing https://t.co/Sq54SAUS5g My amazing team of #Maharshi, my director @directorvamshi and I, THANK YOU ALL from the bottom of our hearts for this overwhelming  success 🙏🙏🙏 My journey so far has been very special &amp; Thank You All for making my 25th... my BIGGEST!!! Thanking all my fans and the audiences for an outstanding response. Here's a glimpse of #ChotiChotiBaatein :) \n#MaharshionMay9th\nhttps://t.co/eeb0Q35xLo RT @directorvamshi: #ChotiChotiBaatein song video preview today at 04:05 p.m...Get a sneak peek into the Freindship of our Superstar @urstr… My first at @amb_cinemas ...\n#AvengersEndgame!! Loved the film and the experience ..Thankyou team AMB... You guys rock!!! 👍👍👍👏👏👏 https://t.co/GlDOCqgBYq The Soul of Rishi. Here's #IdheKadhaNeeKatha for you! \n#MaharshionMay9th\nhttps://t.co/DwSxlZwxXZ Watch me #TakeCharge in my new @ThumsUpOfficial mission!\nExcited to share with you guys this roaring ad that was #ChargedWithThumsUp ⚡👊🏻 https://t.co/S6RELzlVIQ RT @directorvamshi: #IdheKadhaNeeKatha.. The Soul of Rishi will be out tomorrow at 09:09 a.m... Sung by @rvijayprakash. A @ThisIsDSP Musica… Missed mentioning an important person in my speech today. In my 25 films journey, it was #Pokiri that made me a Superstar. Thank you so much @purijagan !!! Thanks for giving me Pokiri 🤗 A film that will always be remembered. Welcome to RISHI's world... 😊\n#MaharshiTrailer #MaharshionMay9th\nhttps://t.co/4qZo309QQ9 RT @SVC_official: The most awaited #MaharshiTrailer will be released at 8:10PM tomorrow.\n\n#Maharshi\n@urstrulyMahesh @directorvamshi @hegdep… Music of #Maharshi is all yours now :)\n#MaharshiJukebox #MaharshionMay9th\nhttps://t.co/Wnh0JOz57l RT @directorvamshi: #Maharshi Juke Box today @ 4:05 p.m... Listen to the new addition #PhirShuru sung by #BennyDayal.\nA @ThisIsDSP Musical.… Here's #PaalaPitta for you :) \n#MaharshionMay9th\nhttps://t.co/Dt6pGBBGPU RT @directorvamshi: #Paalapitta.. Tomorrow @ 09:09  a.m Celebrate this song with our Superstar @urstrulyMahesh &amp; @hegdepooja.. A @ThisIsDSP… RT @directorvamshi: #PalaPitta... Get ready to Celebrate this Massy Folk number on 29th April at 09:09 a.m with our Superstar @urstrulyMahe… Romantic scenes are not an easy task... but the 'Purely Prema' playlist on @spotifyindia sets the mood for me. All gets right when I am #WorkingWithSpotify 😊\nhttps://t.co/JJl3gioBtc My good day becomes great when there's right music!  The 'Latest Telugu' playlist on @spotifyindia has all the top tracks to groove &amp; move! Absolutely love #WorkingWithSpotify, coz that's the way it is! 😎 \n\nhttps://t.co/o0mYrkDxry Here it is... #PadaraPadara \n#MaharshionMay9th\nhttps://t.co/jzfXkgCGEL RT @directorvamshi: \"పదరా పదరా పదరా \nఈ వెలుగను పలుగు దించి పదరా \nపగుళ్లతో పనికి రానిదను బ్రతుకు భూములిక మెతుకులిచ్చు కదరా\"\n\n #PadaraPadara… RT @directorvamshi: #PadaraPadara tomorrow at 4:05 p.m. Thank You @Shankar_Live Sir for Your words.. https://t.co/GMIxerHKpT Your voice mad… RT @directorvamshi: \"పదరా పదరా పదరా \nనీ అడుగుకి పదును పెట్టి పదరా \nఈ అడవిని చదును చెయ్యి మరి వెతుకుతున్న సిరి దొరుకుతుంది కదరా\"\n\n#PadaraPad… Deeply saddened to hear about #SriLankaAttacks. Such a disgusting act of cowardice. My prayers and strength to the victims and their families in these tough times.  #PrayersForSriLanka An evening in Paris ♥\n#familytime @ Paris, France https://t.co/heIDXLgBIG One of the most special days in my life... April 20th. Happy birthday Amma...❤️❤️❤️ https://t.co/q84M01I1FE Everest Anchuna :) :)\n#MaharshionMay9th\nhttps://t.co/UBHAYZhv1k RT @directorvamshi: #EverestAnchuna.. #Maharshi 3rd Single will be out tomorrow at 04:05 p.m.\n\n@urstrulyMahesh @hegdepooja @ThisIsDSP @Shre… Enjoy :) \n#EverestAnchuna\nhttps://t.co/ptzglkWuL8 New challenges mean new ways to #TakeCharge! Coming soon your way!\n\n#ChargedWithThumsUp @ThumsUpOfficial https://t.co/WXgz7IMXFA RT @directorvamshi: #EverestAnchuna... Enjoy The first duet of #Maharshi with our Superstar @urstrulyMahesh &amp; @hegdepooja.. . The song Vide… With this... It's a wrap!!! See you in the cinemas on May 9th 😊😊😊\n#Maharshi #MaharshionMay9th https://t.co/ktlKfOJaX8 RT @directorvamshi: #EverestAnchuna... Song Video Preview on the 19th of April at 04:05 p.m. #Maharshi #ssmb25  \n Superstar @urstrulyMahesh… Up, close &amp; personal with Rishi through #NuvveSamastham\n#TheAuraofRishi #Maharshi\nhttps://t.co/PpHRiPM0zo RT @directorvamshi: #NuvveSamastham... 2nd Single from #Maharshi will be out Tomorrow at 4:05 p.m... Get ready to embrace our Superstar @ur… Back with my favourite 😎\nLove the experience...always 😊 https://t.co/RwG7kFXVAs Here's RISHI for you... \nWishing you all a Happy Ugadi 😊\n#JoinRishi #Maharshi\nhttps://t.co/zJi9CdLC0O RT @directorvamshi: #JoinRishi tomorrow at 9:09 a.m... Join The Journey of our Superstar @urstrulyMahesh as RISHI  tomorrow... This Ugadi w… RT @directorvamshi: #JoinRishi on the 6th of April at 09:09 a.m... #Maharshi Teaser will be out on Ugadi.... Get ready to Join the Journey… Choti choti baatein♥♥ #MySitaPapa😘 \n#myalltimestressbuster🤗 #onsets #Maharshi https://t.co/y9q1XRTZG6 Celebrate friendship #ChotiChotiBaatein\nhttps://t.co/eMxXATIFQl\n\n@ThisIsDSP @directorvamshi @hegdepooja @allarinaresh @KUMohanan1 @ShreeLyricist #Maharshi #ChotiChotiBaateinSong RT @directorvamshi: #ChotiChotiBaatein The Journey of Freindship with Superstar @urstrulyMahesh @hegdepooja &amp; @allarinaresh begins tomorrow… RT @directorvamshi: The Musical Journey of #Maharshi begins on 29th March at 9:09 a.m.. Get ready to celebrate your Friendship with our Sup… Thanks a lot to @MTsSingapore team for unveiling the figure in my own city &amp; my country amidst my family, friends &amp; fans. Extremely happy with the response &amp; love, each one has showered on me. I'm very happy, overwhelmed and grateful😊😊 https://t.co/m7Lmmelqnf My first reaction was... Wow!!!\nQuite freaky in a way looking at another Me!! Can't get more real than this... Hats off to the artistry &amp; detailing by the @MTsSingapore team. It's unbelievably close to life. https://t.co/jE5nv1DEYo Let the vivid colors of Holi spread love and happiness. Hope you all enjoy and treasure some joyful moments 😊\n#HappyHoli What a talent👏👏👏👏👏😍😍😍\n#MySitaPapa ❤ https://t.co/hDfJwh47li In between shots!! With my most passionate &amp; hardworking team...#Maharshi\n#bestisyettocome #bts https://t.co/JEL2Blvso4 To mine &amp; all the incredibly strong women out there, happy #WomensDay\nToday and every day #ShineBright.\n#InternationalWomensDay https://t.co/A4vxv1bHXw Interesting story &amp; edgy screenplay... Enjoyed watching 118. Guhan's technical skills as a cinematographer &amp; director are top notch...👍 Congratulations to the entire team😊 All the best sir for your new film 😊👍 Due to creative differences, my film with Sukumar is not happening. I wish him all the best on the announcement of his new project. Respect always for a film maker par exellence. 1 Nenokkadine will remain as a cult classic. Enjoyed every moment working on that film. Wishing you and your family a happy #Mahashivratri!!\nMay the blessings &amp; supreme energy of Lord Shiva be with all of you, guide you throughout. Om Namah Shivay🙏🏻 Honoured to bring you the story of our National hero - Major Sandeep Unnikrishnan... \nSending my best wishes to @AdiviSesh, director @sashikirantikka, team @GMBents, @AplusSMovies... &amp; Congratulations @SonyPicsIndia on your debut Telugu production👍🏻\n#MajorTheFilm https://t.co/BZf4gSE1Rn Extremely proud of our #IndianAirForce. Salutes to the brave pilots of IAF🇮🇳 Birthday wishes to one of the best lensmen in the Industry... Happy birthday @RathnaveluDop :) Have an amazing year. Extremely saddened by the news of director Kodi Ramakrishna garu’s demise. His contribution to Telugu Cinema is unparalleled, our industry will never forget his work. My thoughts &amp; prayers are with his closed ones... May his soul rest in peace! Extremely saddened to hear of the terror attack in Pulwama. My deepest condolence, strength and courage to the families of #CRPFJawans. #RIPBraveHearts Candid moments captured!! Anniversary 14!! Happy Anniversary my love ❤❤ https://t.co/BNm0fE130Q Congratulations to the @USAndHyderabad on completing 10 years! https://t.co/o7Se9VZkei Happy #RepublicDayIndia Spread peace and harmony. #JaiHind🇮🇳 It's our responsibility to put constant effort to fight against the social stigma about girl child. #todayandeveryday\nEducate, empower and let them flourish.\n#SavetheGirlChild #NationalGirlChildDay Happy birthday, My sweetest love❤ Thank you &amp; Love you for everything that you mean to me🤗 https://t.co/SYjI3F4qQU Congratulating #TeamIndia on winning the first ever bilateral ODI series in Australia✌ Well played Champions!!! Kudos to the Man of the Series, @msdhoni😎 Great game👏👏 @imVkohli\n#AUSvIND #BleedBlue https://t.co/mdM7CTQ6e2 Sending my warm wishes and love to you and your family on this auspicious festive occasion... Wishing you a bright &amp; joyful Sankranti 😊😊\n#HappyMakarSankranti #HappyPongal https://t.co/GHkuxHf5fw Director @AnilRavipudi has made another commercial blockbuster!! Congratulations to you &amp; to the entire cast and crew... Dil Raju garu, @tamannaahspeaks @Mehreenpirzada @ThisisDSP 👏👏👏 Watched #F2... A total laugh riot!! Thoroughly enjoyed it... 😊\nVenky sir excels in his part and is effortlessly funny and Brilliant👌🏻👌🏻 @IamVaruntej is hilarious... equally matches Venky sir's timing..👍👍 https://t.co/F2RQPq6EwX Wishing the most humble &amp; super talented @aryasukku a very happy birthday... May you have a great one!!!\nLooking forward to starting our film sir 😊😊 https://t.co/wgFDRq9gDQ #Petta is a tribute to all the fans of @rajinikanth sir, including me... Only one word... Thalaiva...🙏 @karthiksubbaraj you are one of the finest talents we have 👍 @DOP_Tirru outstanding as always 👌 Congrats to the entire team...👏🏻👏🏻\n#Rajinified Making memories... good times with my best buddy👨‍👦 gautamghattamaneni 🤗 #TBT #DubaiDiaries https://t.co/lp526Bo9Hi If there's going to be anything better than #NTRKathanayakudu, it's going to be #NTRMahanayakudu. Looking forward already. Congratulations to the entire team👏👏👏 #NTRKathanayakudu is undoubtedly the best tribute one could have ever given to the LEGEND of Telugu cinema, NT Rama Rao garu🙏 Surreal &amp; large... @DirKrish has painted the canvas with an out of the world experience👍 Balakrishna garu has gone into the skin of #NTR garu's character and LIVED EVERY BIT OF IT🙏 All the characters penned &amp; portrayed are 100% true to life. Brilliant👌 https://t.co/57NvTgu1jM Happy birthday @baraju_SuperHit :) have a great year ahead 👍🏻 Huge congratulations on the stupendous victory #TeamIndia✌Truly a proud moment for the entire Nation🇮🇳 Her brother... the family guy 💕💕💕💕💕💕\n#sitapapaatherbest🤣 https://t.co/eRI4O50wW3 Stepping into the brand new year with family by my side &amp; all your love in my heart... 🤗\n#whatmorecaniaskfor #HappyNewYear #InfiniteLove♥ https://t.co/NgJw3YVFrZ Wishing you all a very Happy New Year :)\nMAHARSHI SECOND LOOK \n#Maharshi #HappyNewYear2019 https://t.co/7SPICOehnS Chilling at #Mix with the boys. The new hotspot! 🤟\n#Dubai #NYE #aboutlastnight @ Emerald Palace Kempinski Palm Jumeirah https://t.co/xWRBuYayM5 RT @directorvamshi: #MaharshiSecondLook... .Celebrate your New Year with RISHI... Get Set to see His new dimension same time tomorrow....#M… Schedule wrap for #Maharshi, a much-needed fun evening with friends &amp; family!😍 \n#whatmorecaniaskfor #holidayseason ✨ #december❄ https://t.co/4PvRrSOmJb Wishing you all a magical &amp; blissful Christmas! May your day be filled with love, joy and light ❤🥳✨ #MerryChristmas Everything &amp; everybody looks extraordinary in the trailer. Loved it! Best wishes to the entire cast &amp; team of NTR Biopic!👍 Looking forward to watching the film! \n#NTRBiopic 🙏 First glimpses of #NTRKathanayukudu look stunningly true to life... Goosebumps all through! Transition of Balakrishna garu as NT Rama Rao garu is effortless &amp; incredible👌\nhttps://t.co/vOChqQHRQH Happy birthday Dil Raju garu!!!\nWishing you a wonderful year of good health, happiness and success. What an incredible feat!!! Huge congratulations on winning the BWF World Tour Finals title @Pvsindhu1 👏🏻👏🏻👏🏻 \nThe whole nation is proud of you... Keep reaching for the stars! #BWFWorldTourFinals2018 Watched the teaser of F2!! Looks super fun &amp; entertaining... Venky sir is just terrific👌👌  \nBest wishes to the entire team 👍👍\nHappy birthday sir!!! Have an amazing one... :)\n@IAmVarunTej @AnilRavipudi @SVC_official @ThisisDSP\nhttps://t.co/JXtl6vrAlo Here's wishing the man who's been an inspiration for generations, @rajinikanth sir, a very happy birthday!!! \nWish you good health &amp; happiness always! #HBDSuperStarRajinikanth A big congratulations on the win @KTRTRS... A very well deserved one 👏🏻👏🏻\nContinue to be the man of the people... Wishing you all the very best👍🏻👍🏻 #2point0 is a cinematic gem!!! Gives you a never before seen experience... @shankarshanmugh sir ups his game to an all new level of sheer brilliance👌🏻 thoroughly enjoyed it 👍🏻👍🏻 Congratulations to @rajinikanth sir, @akshaykumar and the entire team of 2.0👏🏻👏🏻👏🏻 @iSumanth Thanks Sumanth 🤗🤗 ANR garu has always been an inspiration for me in many ways and this truly means a lot 🤗 It's amazing how love transcends through ages... Humbled to see &amp; feel that kind of love coming from someone generations apart from mine❤ The love from my fans has always overwhelmed me… https://t.co/9MyybHZGXF Stellar victory. Spectacular achievement. Immensely proud of your win, champion!!! Congratulations on winning the 6th World Boxing Championship title @MangteC... Take a bow on your historic win!!!\n#skyisthelimit #WWCHs2018 https://t.co/pOLPGqdvYw Here's wishing ace lensman &amp; a wonderful colleague @dop007 sir a very happy birthday. Your work speaks volumes &amp; I wish you continue to capture the best of everything on your camera. Have a great day!!! One of the most action-packed ads that I’ve ever been a part of. Excited to share with you guys! Enjoy the Chase!\n\n#TasteTheThunder @ThumsUpOfficial https://t.co/3viyHMpZFS To both my kids👫 and every little one in the world; to all of us who preserve the little child within :)\nHappy #ChildrensDay!! https://t.co/s3j9zCbzf4 #Sarkar is an engaging political drama!! Thoroughly enjoyed it... An @ARMurugadoss trademark film👏👏👏 Congrats to the entire team👍 #HappyDiwali to each one of you. May God bless you all with prosperity &amp; unlimited happiness🤗 Have a happy one! ✨✨✨\n#Diwali #HappyDeepavali https://t.co/Gg4JsC9SVF Stunning visuals and incredible concept! Can’t wait for Chitti to set the screens on fire 🤩 Best wishes to  @shankarshanmugh, @rajinikanth sir, @akshaykumar, @arrahman, and the entire team!👍👍\n#2point0\nhttps://t.co/JC8sY5NkH1 Good luck with your debut @AshokGalla_... Welcome to the film world :) I hope you taste all the success and love! My best wishes to you and your entire team for #AdeNuvvuAdeNenu 👍👍 https://t.co/OeLww2rFcP ವಿಜಯದಶಮಿಯ ಶುಭಾಶಯಗಳು \nFor all my people in Karnataka :) Sending out love, happiness &amp; lots of good wishes to each one of you &amp; your loved ones on the auspicious occasion of #VijayaDashami\nఅందరికి దసరా పండుగ శుభాకాంక్షలు\nआप सभी को विजयादशमी की हार्दिक शुभकामनाएँ\nஅனைவருக்கும் இனிய விஜயதசமி நல்வாழ்த்துக்கள்\nവിജയദശമി ആശംസകൾ\n#HappyDussehra https://t.co/IrRU7CMGEh Wishing @ssrajamouli a very happy birthday. May your year be as celebratory as your wonderful films :) Forever grateful for your support🙏\n#7MillionMaheshians love you all... 🤗🤗♥♥ https://t.co/xUzUrPHp9i Congratulations #Kaushal!! It's a big win!!👏👏 Extremely happy for you!! Enjoy ur success!! If you haven't seen the film, go grab your tickets people. We are witnessing a classic...👍 movie of the decade!! The master is back &amp; how! 💪💪\n#ChekkaChivanthaVaanam #ChekkaChivanthaVaanam... stellar performances ..\n@arrahman...matchless👌 @santoshsivan...pure class👌\nAs a #ManiRatnam fan, used to clap watching his films in the theaters of Chennai, did the same... watching it in my home theater with my collar up👏👏 It was great meeting @uscghyderabad today. Looking forward to my trip to your hometown  New York! https://t.co/rEQCkIl0uY Hearing great things about Nannu Dochukunduvate. Happy and proud of your first production venture 👏👏👏 @isudheerbabu heard you are brilliant. Congratulations to the entire team 👍👍\nAm travelling... back in a couple of days... Can't wait to catch it..😊 Boys will be boys...&amp; you will be you😉 Looking cool #MrMajnu 👌\nGood luck @dirvenky_atluri &amp; @AkhilAkkineni8 👍\nhttps://t.co/4RxGfww7NL May Lord Ganesha shower you with blessings and happiness. Wish you all a very Happy Ganesh Chaturthi🙏\n#HappyGaneshChaturthi #GanapatiBappaMorya https://t.co/BhAqUkV6wd Good going @isudheerbabu. Liking your picks as an actor👍 Sending best wishes for your first as a Producer. #NannuDochukunduvateTrailer looks promising. All the best for #NannuDochukunduvateOnSep21.\nhttps://t.co/1dfHdDXzJP Proud of you @RanaDaggubati for encouraging such talent... 👍👍 #CareofKancharapalem is a class apart. Truly a director's film, driven by extremely well-written characters. The climax is the heart of the film... Congratulations to @venkateshmaha25 on his marvellous first outing👏👏 Loved the film!!! Quality education can hone skills and sharpen one's talent. Let us give every child space and scope to learn and they will automatically blossom into brighter adults. Let's do it👍\n#InternationalLiteracyDay Love your style of work :) Shooting with you is super fun as always... Enjoyed the super special Maharashtrian lunch 😊😊 https://t.co/GgCPmSCdz6 Deeply saddened by the news of Harikrishna garu's untimely demise. May his soul rest in peace. Strength and love to my brother @tarak9999 and his entire family in this time of grief. All the best to @allarinaresh, @Mee_Sunil &amp; the entire team of #SillyFellows for their adventurous laughter riot.\n#SillyFellowsTrailer \nhttps://t.co/ujLuQ0Tt8C Had a really nice time too... Enjoy your holiday @TheDeverakonda... the time is NOW! 😉 https://t.co/ony1NPZ8Kz Watched the trailer of #Paperboy. Looks extremely fresh &amp; pleasant :) On a personal note, it is even more heartwarming for me, having worked with his father the Late Shoban garu. Truly wishing #SantoshShoban &amp; his team the best for its release. 👍👍 \nhttps://t.co/2IAak2HUky May you all live amid love, peace &amp; joy. Wishing each &amp; everyone a very happy &amp; prosperous Eid 🤗❤❤\n#EidAlAdha Happy to launch #BigBossAnthem. Best wishes to @isudheerbabu &amp; good luck to the entire team of #SudheerBabuProductions. \n#NannuDochukunduvateOnSep13 @sbpoffl_ \n https://t.co/t22h2Y7iMv Highest respect to all those who are contributing towards Kerala flood relief. Salutations to Indian Army, Navy, Airforce &amp; other rescue forces for their invaluable efforts at ground zero. \n#KeralaFloods #StandwithKerala #KeralaFloodRescue Geetha Govindam is a winner... Thoroughly enjoyed it! @TheDeverakonda and @iamRashmika are absolutely brilliant! @actorsubbaraju and @vennelakishore deserve a special mention :) Congrats to the entire team!!! 👏👏👏 Freedom is a gift. Let us constantly strive together in making our country a better &amp; safer place for us, our children. \n#HappyIndependenceDay2018 #IndependenceDayIndia https://t.co/t7urj7poVl Thank you for your wishes. Glad to be a part of this initiative :) \n#Sisters4Change https://t.co/p5aonVtnaj Overwhelmed after receiving so much love on my birthday🤗🤗... I am thankful to each one of you for your greetings &amp; blessings. You all made me really, really happy!!! 🙏🙏🙏 Humbled by your love &amp; blessings 🙏🙏Beginning my journey today as 'RISHI' :) \n#MAHARSHI #MeetRishi https://t.co/2mYKMxRqcl Thank you for your kind wishes, sir. https://t.co/E83hGR4t0u Embarking on my new journey as RISHI.\n#MAHARSHI https://t.co/xiAylLc2ND Goodachari is a very impressive attempt in making a slick spy-thriller in Telugu. It's crisp, fast &amp; gripping. Loved the performances of all the actors. @AdiviSesh shines all through. Congratulations to the entire team! 👏👏 One of the most talented composers we have in our industry.\nAn absolute pleasure to be launching the promo video of your USA tour... All the best @mickeyjmeyer !! \nhttps://t.co/WWeJ8es9cJ My friend! My world!! ❤😘 #HappyFriendshipDay #Namrata https://t.co/XOGBEwvdTC It can't get cuter than this... Thank you my little ones for launching our upcoming film's emblem... 🤗🤗♥♥\n#SSMB25\nhttps://t.co/bJB1uNriMx Looking forward to this grand wedding #SrinivasaKalyanam\nBest wishes to Dil Raju &amp; the entire team.\n@svc_official @actor_nithiin @RaashiKhanna @Nanditasweta @mickeyjmeyer \n#SatishVegasna \nhttps://t.co/jk4HlMrBnz Happy birthday, Rockstar @ThisIsDSP. Need I say more? 🤗🤗🤗 https://t.co/NQG8RysSu3 Proud proud proud of both my kids! \nI invite all of you to join hands with me to make this planet a greener and a better place for our future generations.\n#HarithaHaram 🌱 https://t.co/qaFWkd3xzn Challenge accepted, @KTRTRS  &amp; @RachakondaCop 😊 Thank you for nominating me...👍 #HarithaHaram is a great initiative taken towards  a go green environment. I now nominate my daughter Sitara, my son Gautam and my @directorvamshi to take on the challenge. https://t.co/SEhcuM4Dgy A very happy birthday to my 40 years young director &amp; friend @directorvamshi 😊... 40s are undoubtedly the new 20s!!! live young, live happy... Have a great one! 🤗🤗 https://t.co/bBJ89Tw12l Good friend, an incredible leader &amp; a dynamic human being... Wishing you a very Happy Birthday @KTRTRS 🤗🤗 https://t.co/NUuuxLM2nh Wishing you a very happy birthday @upasanakonidela. Sitara truly loves the birds. Thanks to you &amp; Charan for all your love ♥ https://t.co/uYPh6UqvpG Kudos to Dr. Dinesh Kumar Chirla for leading the extremely sensitive case of the birth of the smallest baby born in South Asia in the most exceptional manner 👏👏 My blessings &amp; love to Baby Cherry. Hats off to the team of neonatologists of Rainbow hospital 👍 https://t.co/khKuHRBOan Wishing my everything a very happy 6th ♥♥♥ May you have all that you wish for and more 🤗🤗🤗 I love you Sita papa😘😘😘 https://t.co/VHDpNQSQ7Z Incredible feat by #HimaDas. One of the brightest moment in the history of Indian sports. Super proud &amp; super happy for you, @HimaDas8... Congratulations! 👏👏\n#HimaDasGoldenGirl #MakingIndiaProud🇮🇳 https://t.co/qUwhgUv0oV Very impressed with Abhimanyudu. The vision &amp; direction of @Psmithran is skilfully conveyed.. A well-researched and fast paced film... Hearty congratulations to @VishalKOfficial and the entire team!👏👏 May the festival shower love, peace, warmth, togetherness and everything positive upon all of you💛\n#EidMubarak https://t.co/f10NtA6uMF Top notch performance by @isudheerbabu &amp; @aditiraohydari. Definitely their career best!!! Special mention to @ItsActorNaresh garu's performance. He was absolutely brilliant .. Congratulations to the entire team! 👏👏👏 Sammohanam is beautifuly written &amp; brilliantly directed... @mokris_1772 is one of the finest talents we have in our Industry... What a film!!! Simple loved it 👏👏👏👏 Remembering the day we shot the iconic press-meet scene in Bharat Ane Nenu. It's your maverick directorial and writing  ability that brings out the best in me :) Dedicating every accolade &amp; appreciation I received for this scene to you, sir :) https://t.co/qXYoG1ygjN Happy birthday to my dear friend &amp; maverick director @sivakoratala sir. Wish you a lifetime of happiness and success... Stay blessed :) Respect always🙏 https://t.co/FVgTPsXQxV Hearing lot of good reports from industry about #Sammohanam. Wonderful visuals, soothing music, novel concept &amp; the performances of @isudheerbabu &amp; @aditiraohydari. Best wishes to the cast &amp; crew 👍 @KTRTRS 😂 Wishing @isudheerbabu &amp; the team of Sammohanam all the best.\nhttps://t.co/cgguabExLx My real hero.. my mentor.. my idol.. my pillar of strength.. my everything. Proud to be your son. Happy birthday Nana 🤗🤗- the forever evergreen superstar. 😊\n#HBDSuperStarKrishna ❤ https://t.co/Ea7YKSHzx2 Take a bow @rashidkhan_19... Whatta match by @SunRisers 👏Can't wait for Sunday!!! Congratulations to the whole team. 😊\nGo #OrangeArmy #SRH Happy birthday, @tarak9999 :) Wish you all the victories, love and everything positive! My children and I are blessed to have mothers so real &amp; strong. Love them immensely.♥\n#MothersDay https://t.co/V2vAXXWInU https://t.co/2z76QjUeSa Thank you @JayGalla for accompanying us on this trip. Always fun traveling with you :) Big thankyou to the people of Vijayawada &amp; Tirupati for being so affectionate &amp; warm. Forever grateful for their love &amp; blessings :) :)\nThanks to everyone for making Bharat Ane Nenu my life's most unforgettable experience. :) https://t.co/nH2JG7rI8C Vision for a Better Tomorrow. Hope you'll like it :) \n#BharatAneNenu \nhttps://t.co/nqDHfWmVyb @KTRTRS Will do, sir :) Super happy to be a part of the prestigious Madame Tussauds :) :) \nThanks to the team of artists for their attention to detail. Incredible! https://t.co/fyZHlxJE6k Been receiving lot of compliments for the shirt I wore at our special program.Thanks @KTRTRS for introducing me to handlooms. The fabric is cool, comfortable and stylish..Totally goes with my personality :) :) 👍👍 https://t.co/7HJb2PwzXC @KTRTRS @sivakoratala Glad you enjoyed our film. And thank you for being a part of our program.\nEveryone's gonna love it :) Thank you everyone for all the love for #BharatAneNenu! ధన్యవాదాలు நன்றி ಧನ್ಯವಾದ നന്ദി Feeling blessed ... Glad I fulfilled the promise of making all of you proud. Thank you @sivakoratala sir for Bharat Ane Nenu. The Success of the film is a victory for all of us and for good cinema above all. Congratulations to my entire team. 😊😊 Feeling overwhelmed seeing the love of fans from all across the world\nధన్యవాదాలు , நன்றி, Thank You, धन्यवाद \n#MaheshBabu1stDay1stShow It is overwhelming for me to present a film so close to my heart on this special day. Happy Birthday, amma :) :)\nBharat Ane Nenu in cinemas now. https://t.co/Pj73V0IaQz RT @DVVEnts: Anti Piracy Control Room will work 24/7 \n\nAll responsible citizens can report any act of piracy at claims@antipiracysolutions.… Another favourite of mine :)\nhttps://t.co/R78zpBp3W1 Congratulations @ssrajamouli for the massive win at the #NationalAwards2018. Your film, Baahubali is an important landmark in Indian cinema. We are all very proud of you. Excited to bring this to you. In cinemas from April 20th :)\n#BharatAneNenu https://t.co/pONkBn47Pj One of the best songs from the album. Enjoy :)\nhttps://t.co/p68MjwnEi2 Hope you enjoy this one too 😊\n#OVasumathi #BharatAneNenu  \nhttps://t.co/LA07nPpNiH All that went into making #BharatAneNenu :)\nhttps://t.co/xu31lDRTn4 :) https://t.co/khoQsdEeHD Here it is... #TheJourneyofBharat \nHope you all like it :)\nhttps://t.co/RZV5yz5MsP Enjoy the music of #BharatAneNenu :)\n https://t.co/9hPYAmv2Vz #BharatBahirangaSabha  https://t.co/uGOS7Jaj7L .@MythriOfficial as producers have excelled once more :) Ram Charan &amp; @Samanthaprabhu2 this surely is your career-best performance.Congratulations to the whole team 👍Thoroughly enjoyed it :) Rangasthalam... raw, rustic and intense... @aryasukku you are truly a master of the art. @ThisisDSP you are a Rockstar for all the right reasons. @RathnaveluDop as always brilliant 👍 #VachaadayyoSaami Enjoy :)\nhttps://t.co/3Fmhd2SyVm Next up is Vachaadayyo Saami. Enjoy 😊\n#BharatAneNenu https://t.co/hlZf79Q6sn Announcing\nభరత్ బహిరంగ సభ\nApril 7th\nLB Stadium\nHyderabad\nSee you all there :)\n\n#BharatAneNenu https://t.co/EHf71XXjZf Let's make learning an everyday process, let's make #IDontKnow an anthem to achieve it. \n@FarOutAkhtar @ThisisDSP\nhttps://t.co/c3ADHzHI6R I don't know. Tomorrow. 10 AM. https://t.co/dfrgTCQo9m RT @Advani_Kiara: Here’s the first poster of @urstrulymahesh and me #BharatAneNenu\nHope you all like it 😊😊😊 https://t.co/np3EYmpzsF Thank you @FarOutAkhtar 🤗 Simply loving it!! Welcome to the Telugu Film Industry 🙏🏻\nhttps://t.co/amxgTDS2rw RT @ThisIsDSP: Here’s a Surprise frm d Team of #BAN !! Launching our Second Song from #BharatAneNenu, #IDontKnowOn1st ! Can U guess d Singe… Humbled, overwhelmed, grateful... Thanking each and everyone who have showered so much love on #TheSongofBharat 🙏 A special thanks to @ThisIsDSP @ramjowrites and @sivakoratala sir for creating such a haunting masterpiece. https://t.co/DfRWtZHg2j #TheSongOfBharat is here..\nhttps://t.co/64heclTyme Song of Bharat Tomorrow :)\n#BharatAneNenu https://t.co/kLWGwbMBGx Launching our First Single from #BharatAneNenu, #TheSongOfBharatOn25th https://t.co/LAxylKzWjB Happy Ugadi everyone :) https://t.co/bFbGrRVWUh I wish you all new courage, new hope &amp; new beginnings. May the new year bring everything you honestly desire. Me andariki Ugadi Subhakankshalu :)\n#HappyUgadi #TheVisionofBharat\nhttps://t.co/pOvoaAlURs RT @DVVEnts: #TheVisionOfBharatAt6PM on https://t.co/snHh2fddCc https://t.co/DQ82KYKIf0 RT @DVVEnts: #TheVisionOfBharatTomorrow at 6 PM on https://t.co/snHh2fddCc https://t.co/OSL1n0kiUg May all the colors of the spectrum add lots of happiness &amp; goodness to your lives. A very #HappyHoli to all of you! :) RT @sivakoratala: The Vision of Bharat on Mar 6th. He’s truly responsible and accountable. https://t.co/581ztiJpfG Shocked &amp; disturbed with the news of #Sridevi garu's demise. She truly was the epitome of everything amazing as an actor &amp; a woman. My all time favourite actress.. Gone too soon. Strength to her family &amp; loved ones. May her soul Rest in Peace. May we all be blessed by the epitome of energy, light &amp; kindness. Warm wishes to all of you on the occasion of #MahaShivarathri Proud moment for the entire country.. What a feat by the Indian U-19 team👍👍 Congratulations to the young heroes! 👏👏\n #U19CWC Bharath takes office :)\n\n#BharathAneNenu https://t.co/4TNVHp6ZyV Here you go. Bharath takes his First Oath!\n\nhttps://t.co/CniSNf3CuZ\n\n#BharathAneNenu One more reason to tell you how special you are! 😊 Happy Birthday to my love, my best friend, my wife ❤ https://t.co/3eDQXoKDuF Love and blessings to all of you on this festive occasion :) :) A very Happy Pongal &amp; Sankranti to everyone.\n#HappySankranti #ManasukuNachindi trailer is a joyride of emotions!! Young and full of zest :) looks very promising 👍🏻 👍🏻 my best wishes to my sister @ManjulaOfficial and the entire team :)\nhttps://t.co/7fc9iowJfu Wishing @baraju_SuperHit a very Happy Birthday. All the best to Superhit and Industry hit. Best wishes :) Celebrating the spirit of giving and bringing Santa ( @hashishbajaj ) home! #MerryChristmas to one and all. Peace, love and joy :) :) https://t.co/qpgfM6ucF8 Here it is... #ThumsUpCharged film that you all have been waiting for! #TakeCharge &amp; watch it now! Enjoy :)\n@ThumsUpOfficial https://t.co/42qWouvaVw Happy Birthday to the living legend. Wishing you health &amp; happiness always @superstarrajini sir :)\n#HBDSuperStarRajini #ManasukuNachindi teaser looks breezy, fresh and very cool :) :) \nAll the best @ManjulaOfficial  \nhttps://t.co/hbY3mRNH1o Happy birthday @dop007 sir... Wishing you more success and many more great films with each passing year :) Stay blessed .. :) Great script... Good performances... Slick screenplay... #PSVGarudaVega is stunning... Amazing work by the entire team. Take a bow @ActorRajasekhar &amp; director @PraveenSattaru ! Happy birthday to my dearest sister @ManjulaOfficial  #followyourheart ... Cool initiative :) 👍👍👍https://t.co/kD2IDvRQgn A very happy birthday to my dear friend #Trivikram. Wishing you the best of everything :) Wishing all of you a very #HappyDiwali \nMany blessings from our family ✨💥✨\nStay safe :) RT @santoshsivan: On the birth anniversary of Dr. Abdul Kalam , I dedicate this special book DREAMNATION: Uniting a Country with Handwritte… Wishing a very Happy Birthday to @ssrajamouli .. Have a great year sir :) Congratulations to the lovely couple @chay_akkineni &amp; @Samanthaprabhu2 ..Wishing you both a life filled with love, light &amp; happiness :) Make way for the light &amp; keep the darkness away. Wishing each one of you a very happy &amp; blessed Vijaya Dashami :)\n#HappyDusshera Do not encourage Piracy. Watch #SPYder in the theaters.\n https://t.co/DdNZxJA0td RT @LycaProductions: SPYder from tomorrow worldwide \nhttps://t.co/xEdpV0F44J RT @SpyderTheMovie: Ciciliya Ciciliya (Tamil) - #Spyder https://t.co/0Ky8PxJYC1 RT @SpyderTheMovie: Ciciliya Ciciliya (Telugu) - #Spyder https://t.co/RXbNPttGWh RT @SpyderTheMovie: #SPYder Movie Release Promo - Telugu  https://t.co/P4nctlhy1V #SPYderOnSeptember27th RT @SpyderTheMovie: #SPYder - Wednesday onwards Worldwide https://t.co/YIPyePZDIk #SpyderOnSeptember27th Working with you has been the most amazing and unbelievable experience of my career !! Have a great year @ARMurugadoss  sir! 😊 Here’s wishing @ARMurugadoss a very happy birthday :) Thankyou for #Spyder Sir! RT @SpyderTheMovie: #SPYder Movie Dialogue Promo  #SPYderOnSeptember27th  https://t.co/3sDgBiCXYC One of my personal favorites. Enjoy :)\n#6YearsForDookudu\nhttps://t.co/sQZ3Yw3wCp RT @SpyderTheMovie: #AaliAali Promo (Tamil) - #SPYder https://t.co/V2n1EmvVgQ #SPYderOnSeptember27th RT @SpyderTheMovie: #HaaliHaali Promo (Telugu) - #SPYder https://t.co/KCqrB75pX1 #SPYderOnSeptember27th RT @SpyderTheMovie: Here’s #SPYder release date poster... Grand worldwide release on September 27th 😎\n#SPYderOnSeptember27th https://t.co/u… RT @zeemusicsouth: Here's the lyrical video of #OtraiIravukkai from @SpyderTheMovie ft. @urstrulyMahesh &amp; @Rakulpreet https://t.co/2H3UL5Tr… RT @zeemusicsouth: Sing along to the lyrical video of #AchchamTelugandham from @SpyderTheMovie starring @urstrulyMahesh &amp; @Rakulpreet https… RT @SpyderTheMovie: #BoomBoom Promo (Telugu) - #Spyder https://t.co/1bNPrURbtR RT @SpyderTheMovie: #CiciliyaCiciliya Promo (Telugu) - #Spyder https://t.co/MVJp89RUaN RT @SpyderTheMovie: Here we go official #SPYderTamilTrailer  https://t.co/BEipIhheuD RT @SpyderTheMovie: Here we go official #SPYderTeluguTrailer https://t.co/YHQn5DQUeP Here goes the #Spyder Bonus track https://t.co/1MPHLRvqSf\nEnjoy!! Great fun always with you.  Love your speed of shooting!! https://t.co/OCP7yoPoAr RT @zeemusicsouth: Nothing better than spending your weekend jamming to @SpyderTheMovie's audio album! #OutNow \nTune in here: https://t.co/… RT @LycaProductions: Grand audio launch of #SPYder today at Kalaivanar Arangam, Chennai from 6 PM. A @Jharrisjayaraj  musical 🎶🎼 #SpyderAud… RT @SpyderTheMovie: #SPYder Ciciliya Ciciliya Telugu Promo - https://t.co/ncOrFYT6xj @urstrulyMahesh @ARMurugadoss @Rakulpreet @Jharrisjaya… RT @SpyderTheMovie: Grand pre-release event of #SPYder on 15th September.\nStay tuned!! https://t.co/BODDGflPYz RT @SpyderTheMovie: #SPYderAudioFrom9th on @zeemusicsouth https://t.co/PDJprwxS5e For all my people in Kerala...\n#SpyderMalayalamTeaser https://t.co/Zwfa18dj1z RT @SpyderTheMovie: #SPYderAaliAali lyrical video is out now. A @Jharrisjayaraj Musical  🎶 https://t.co/EheuXgYzaR @urstrulyMahesh @ARMurug… RT @SpyderTheMovie: #SPYderHaaliHaali lyrical video is out now. A @Jharrisjayaraj Musical  🎶 https://t.co/3tkalTl6Y5 @urstrulyMahesh @ARMur… RT @zeemusicsouth: #StayTuned for the 2nd song from @spyderthemovie releasing tomorrow at 7:00 PM! #Spyder2ndSingleTomorrowAt7PM @urstrulyM… Congrats to u sir and your entire team...👏👏👏 #SandeepVanga's writing and direction is top notch.. Hard to believe it's his first film! Shalini, the friends and all the characters are just brilliant..! .@DVijaySai comes up with a performance of a lifetime.. terrific would be an understatement.. Bold.. raw.. intense.. original and brilliant.. #ArjunReddy is a path breaking film.. He is the reason for my existence.. my driving force.. my son.. my world.. my happiness.. Happy Birthday, Gautam ❤❤ Stay blessed! Off to Romania... to shoot the last song of #SPYder !! Looking forward :) May prosperity, good fortune, health &amp; happiness be with you all forever!\nHappy #GaneshChaturthi to all of you :) Freedom is our priceless possession. Let us honour it forever. Happy Independence day!\n#IndependenceDayIndia Humbled &amp; touched :) All the messages &amp; good wishes made my day! Thanks a lot for all the love! RT @SpyderTheMovie: Here we go.. a bit ahead of schedule #SpyderTamilTeaser - https://t.co/y4ZndUtTfc @urstrulyMahesh @ARMurugadoss @Rakulp… RT @SpyderTheMovie: Here we go... a bit ahead of schedule #SpyderTeluguTeaser -https://t.co/8h4q12Guzc @urstrulyMahesh @ARMurugadoss @Rakul… RT @SpyderTheMovie: #SpyderTeaserTomorrow at 9 AM @urstrulyMahesh @armurugadoss https://t.co/mK8rIWqHcF https://t.co/jlpkI9YEOv She keeps listening to it on repeat mode :) her favourite new song 😊😊😊😊😊😊😊 https://t.co/QTKu1pVVO9 For all my Tamil fans :)\nhttps://t.co/5EVAU2k9RQ Enjoy :)\nhttps://t.co/02zvCE2JbX One of my favourite people :) wishing @ThisIsDSP a very Happy Birthday... Have a rocking year ahead !!! RT @zeemusicsouth: The much awaited song teaser of #BoomBoom From @urstrulyMahesh *er @SpyderTheMovie is OUT. Song releases on Aug 2\nhttps:… Wishing @directorvamshi a very happy birthday.. looking forward to working with u on our next :) Thanking each and everyone of you for all your good wishes on Sitara's birthday :) She makes each day of mine special! Today is hers :) more love, infinite happiness to my little one on her special day. My daughter turns 5❤ https://t.co/z2sb1IF4Vq :):) https://t.co/7g4Z2Naklx RT @santoshsivan: https://t.co/dtLJwbApez RT @santoshsivan: With a most endearing guest👌 https://t.co/8NqosJYALp One of the most stylish trailers I've seen in recent times. Thumbs up to #Shamantakamani &amp; @isudheerbabu \nhttps://t.co/1eMkPTLFRU Wish you all a blessed and prosperous Eid. Happy Ramzan :) https://t.co/gTDb2bhhcO A special person.. my inspiration, my guide.. A man I've always looked up to!! Grateful to be his son. #HappyFathersDay to my dear father :) Here's wishing one of my favourite directors &amp; a dear friend @sivakoratala a very very happy birthday!! Looking forward to our shoot sir :) Here is #SudheerFLfromShamanthakamani  @isudheerbabu  .. looking cool. Good luck @BhavyaCreations  &amp; entire team. https://t.co/7yBzHWMszK RT @SpyderTheMovie: Fastest 6.3 Million Views #GlimpseOfSPYDER Highest No.of views in 24hours(Real time,cumulative) for a Teaser in South I… A big Thankyou to each and every one of you for the overwhelming response for #GlimpseofSPYDER :) Here we go.. #GlimpseOfSPYDER :)\nhttps://t.co/KDtxC4WOVZ His death leaves a void that can never be filled. Prayers and strength with the whole family. Shocked and saddened by the news of Dasari Narayana Rao Garu's passing away. May his soul rest in peace. Congratulating @abhibus on celebrating 10 years of making bus travel comfortable and our journeys memorable.\n#AbhiDus #AageAurBhiZabardast #SpyDer will come to you this Dussehra ! Let's get the party started with the first glimpse on May 31st at 5 PM :) Legend, Superhero, Master Blaster\nMany names.. 1 man.. #SachinABillionDreams \nCan't wait to see his story unfold.\nAll the best @sachin_rt :) https://t.co/c192KEYdcn Wishing my mother, the mother of my children, &amp; every single mother out there. #happymothersday \nLimitless love, respect, and gratitude. https://t.co/UViifU5CjR Wishing my dearest sister Manju all the best on her directorial debut !! Time to add another feather to your cap!!@IndiraProdOffl The unthinkable has happened! 1000 crores &amp; counting! Thankyou @ssrajamouli &amp; team for making me &amp; the entire Telugu film fraternity proud:) Mind boggling stuff, a game changer! Hats off to @ssrajamouli and the entire team! The master storyteller is back! #Baahubali2 is an event film which exceeds expectations! A true inspiration for me and many others 🙂 Extremely happy and proud 🙂 https://t.co/pg0vyQsyjT Congratulations to K. Vishwanath garu on winning the Dada Saheb Phalke Award! A legendary name in the Indian cinema! RT @spyderthemovie: #4MillionViewsForSPYderFL and still counting.. https://t.co/n9s2jljl9F , https://t.co/bPDgaPLrMo @urstrulyMahesh @ARMur… RT @spyderthemovie: Thank you for all the love #SPYderFirstLook is No.1on YouTubeIndiaSpotlight #Spyder https://t.co/ocDvwPaFbu  @urstrulyM… #SPYder :)\n@spyderthemovie https://t.co/iYacntoqup RT @spyderthemovie: #SPYderFirstLook https://t.co/ocDvwPaFbu #Mahesh23FLDay @urstrulyMahesh @ARMurugadoss @Rakulpreet @Shibasishsarkar @Rel… RT @ARMurugadoss: On the way https://t.co/yvI192f67O The first look will be out very soon...Requesting you all to be a little patient. Love you guys as always :) To all my dearest fans, I know you have been eagerly waiting for the first look of #Mahesh23. Our team is shooting day &amp; night for the film. Wishing the new year brings much hope and happiness to all of us! Andariki Ugadi Subhakankshalu! :) https://t.co/py6rIw0p13 One of my personal favourites..!! :) https://t.co/xxmEBtwa3P #InternationalWomensDay https://t.co/zswCIIKlgK Waiting sir @ARMurugadoss! June 23rd....A day to celebrate!!\n#Mahesh23 https://t.co/cYz4o1t711 Wishing #Winner @IamSaiDharamTej @RakulPreet dir @megopichand &amp; @MusicThaman good luck 4 #Sitara song. Here we go :)\nhttps://t.co/V1EEyMWrJt She is the best gift that I have ever received. She's my pride..my joy..Let's be those proud parents to our daughters! #NationalGirlChildDay https://t.co/Z7FwP51iZE My strength and the light of my life - Happy Birthday to my dearest wife :) https://t.co/OemBbGNKqK Hope their voices are heard. I support the spirit of Tamil Nadu. #JusticeforJallikattu Especially admire the way the students of Tamil Nadu have been standing up for the cause, relentlessly fighting for their roots and culture. Proud to see such a statement of unity among Tamilians for something that they truly believe in. #Jallikattu is the spirit of Tamil Nadu - bold and fearless. RT @avigowariker: #PostPackUpShot today with the very charming Superstar @urstrulyMahesh .Got a fab candid moment with his lovely wife &amp; my… Wishing u all a very happy Sankranthi once again! Hats off to ur conviction and vision .. really proud of u! Congrats to u n ur entire team .. @DirKrish\nHow in the world did u shoot a film of this magnitude n stature in just 79 days !! Unbelievable.. Hats off to #NBK for the portrayal of #GPSK!\nIt will remain as one of the finest performances of TFI. Missed u all these years sir..welcome back ..\nCongrats to the entire team of #KhaidiNo150. The aura of #Chiranjeevi garu is magical ..he stands tall above everything else.. It's raining hits in TFI !! Got some time off to watch both the Sankranthi biggies .. Mee Andariki Sankranti Subhakankshalu :) https://t.co/T1MiEyD00C All my support for this great initiative! #WearHandloom https://t.co/ByP2x3jF3e RT @jaygalla: Happy 2017 !! Live, Love, Laugh https://t.co/jcbG6J7OrZ Wishing you all a very happy and prosperous 2017! #HappyNewYear, Stay Blessed :) This is easily the most exciting phase in my career :)⁠⁠⁠⁠ Wishing you a very happy 2017 @ARMurugadoss sir and also to our entire working unit..!! Above all looking forward to the release of #Mahesh23! My dream of working with the supercool director @ARMurugadoss has finally come true! Working wt @sivakoratala/@DVVEnts for #Mahesh24\n@directorvamshi/#DilRaju/#AshwiniDutt for #Mahesh25\n#Trivikram/@MythriOfficial for #Mahesh26 Some exciting news for all my fans..:) The line up for 2017..!! Beyond Boundaries.. Happy Holidays :) https://t.co/gxajgzQEcB RT @jaygalla: Merry Christmas :) @urstrulyMahesh @1nOnly_AG @sidgalla https://t.co/YCybGyd1fO Merry Christmas :) https://t.co/Qb8uCTzpl3 #DevuduLantiManishi book launch today..!! True title for my father..Cannot wait to turn the pages of this book :) https://t.co/xFxQsfCEAC Saw the trailer of #OkJaanu..An absolute visual treat..Brilliant work as always by Ravi K. Chandran :) All the best sir @dop007 A living legend..The One and Only Thalaiva..wishing you a very happy birthday Sir on ur special day :) @superstarrajini Deeply saddened at the loss of J Jayalalithaa garu. May her family and the whole of Tamil Nadu find strength at  this time.. All they need is love to make them love more and wings to see them fly :) #HappyChildrensDay https://t.co/8oxIuVwxES A refreshing change for our economy &amp; country! Master stroke from the man of the ppl by the ppl for the ppl! Salute you @narendramodi sir! https://t.co/vcl6gqEyvp One of my favourite pics of one of my favourite directors... \nHappy Birthday sir!! Love and happiness always :) https://t.co/93cLIsBMY3 Have a joyous and sparkling Diwali everyone! #HappyDiwali\n\nStay safe :) stay blessed ✨✨ Nawin makes a commendable debut!! Couldn't be happier for the success of #NandiniNursingHome.. congrats to the team! Clicked by the ace himself @santoshsivan https://t.co/TGxIT4y81y Wishing my dear friend @isumanth &amp; entire team all the very best. Here's the theatrical trailer of #NarudaDONORuda.\nhttps://t.co/QnEmISfDp9 Here's wishing a very happy birthday @ARMurugadoss. Such an honour &amp; pleasure working with u sir. Have a great year:) What a gallant display of sportsmanship.. We r all super proud :) Congratulations PV Sindhu on winning Silver for India at #Rio2016! https://t.co/1DRFFvhTc4 Happy Independence Day to all.. Be as proud as I am to be an Indian :) I'd like to thank each and everyone of you for all your wishes and blessings from the bottom of my heart :) \nExtremely humbled :) Cheers to Team Srimanthudu :) \n#1YearForSensationalSrimanthudu https://t.co/zk90ys41wi I look back at the whole experience of working with an amazing team with lots of happiness and fond memories.. Thanks for all your love, today we celebrate 1 year since #Srimanthudu release. Wishing everyone a very happy Eid. Eid Mubarak to all :) Received my \"Best Actor\" Trophy for Srimanthudu! Thank You @siima Wishing the team of Nirmala Convent all the best!\nhttps://t.co/3qDfV4VAKK A Big Thank You to all my fans for making this possible.. Missed being there on the big night.. Honoured to win the Filmfare Best Actor award for Srimanthudu. Thank you @filmfare and the Times group.. Title Song  Making from #Brahmotsavam !! https://t.co/1ORGJq266y #BrahmotsavamBeginsOnMay20 #PutYourHandsUpSongMaking from #Brahmotsavam !! https://t.co/m7vYnBJhCu   #BrahmotsavamBeginsOnMay20 #AataPaatalaaduSongMaking from #Brahmotsavam! https://t.co/TuWj78uy3a\n#BrahmotsavamBeginsOnMay20 RT @PVPCinema: Here's  #Brahmotsavam release date poster !!\n\n#BrahmotsavamBeginsOnMay20 https://t.co/d3dK0LAgqK RT @PVPCinema: Enjoy special morning show  in all single screens across Hyderabad &amp;Telangana districts on May 20th  #Brahmotsavam https://t… Here's #MadhuramMadhuramMaking from #Brahmotsavam  https://t.co/gsqZUoBYnu RT @PVPCinema: Check out  #NaidorintikadaSongMaking from #Brahmotsavam !!  https://t.co/dLTEPLeLH1 RT @PVPCinema: Here's #BalaTripuramaniMaking from #Brahmotsavam   https://t.co/f3IkQN1JoH RT @PVPCinema: Check out #Brahmotsavam new poster !! https://t.co/wfOqmPoQGO RT @PVPCinema: Here's latest poster from #Brahmotsavam !! https://t.co/FWARAx6abP I seek everyone's help in making Burripalem a model village. I would like to thank all the villagers, fans, leaders, officials, police and media (esp. @jaygalla) for making it such a special day.. It was an amazing Homecoming at Burripalem today. I was humbled by all the love and affection shown to me. https://t.co/cfBOmrg6ul Here's #Brahmotsavam Theatrical Trailer !\n#BrahmotsavamMusicBegins https://t.co/EyuDyX69bW Here's #Brahmotsavam Audio Jukebox !\n#BrahmotsavamMusicBegins https://t.co/mcxKShZcfO #Brahmotsavam Title Song Trailer !\n#BrahmotsavamMusicBegins https://t.co/bKJSjmnmch Bala Tripuramani Song Trailer from #Brahmotsavam !\n#BrahmotsavamMusicBegins https://t.co/Vrrc6YjcGi Vacchindi Kada Avakasam Song Trailer from #Brahmotsavam !\n#BrahmotsavamMusicBegins https://t.co/oXwBXe5NGt Naidorintikada Song Trailer from #Brahmotsavam !\n#BrahmotsavamMusicBegins https://t.co/VZEtMcYJPl Aata Paatalaadu Song Trailer from #Brahmotsavam !\n#BrahmotsavamMusicBegins https://t.co/QK8M4m1JUK #VacchindiKadaAvakasamMaking #BrahmotsavamMusicBegins!!\nhttps://t.co/0XIwmNkoks RT @PVPCinema: Here we go brand new poster of #Brahmotsavam !! \n\n#BrahmotsavamMusicBegins https://t.co/Dc86Vg2GHO RT @PVPCinema: Check out #VacchindiKadaAvakasam Lyrical Video from #Brahmotsavam\n#MaheshBabu #KajalAggarwal #Samantha \n\nhttps://t.co/c5fNlI… RT @PVPCinema: A treat for those who've been waiting to watch our @urstrulyMahesh &amp; #KajalAggarwal together. \n#BrahmotsavamBegins https://t… The wait is finally over.. Here's the #MadhuramMadhuram teaser from #Brahmotsavam! https://t.co/XdGUUTlW5I RT @PVPCinema: #Superstar fans gear up!!!! #MadhuramMadhuram teaser coming to you at 3.33 pm today!\n#BrahmotsavamTeaser #MaheshBabu The #MadhuramMadhuram teaser of #Brahmotsavam is my most favourite .. Ever :) Sure u guys will love it!! #BrahmotsavamTeaser RT @PVPCinema: Let's add excitement to your weekend! #BrahmotsavamTeaser will be out tomorrow morning. Tune in and check it out! #MadhuramM… @isudheerbabu is sensational in baaghi !! What a debut :) happy and proud .. Congratulations to the entire team 👍 RT @PVPCinema: Check out the latest poster of #SuperStar @urstrulyMahesh from #Brahmotsavam!! https://t.co/lZjUicpykT @purijagan looking forward to another memorable film sir :) Happy birthday @Samanthaprabhu2... Have a great year :) https://t.co/Gg5Q2jcB0E Here it is.. The first-look motion poster of Brahmotsavam! #BrahmotsavamBegins https://t.co/NAxw39sV2O @isudheerbabu is just outstanding in the trailer of Baaghi.. Proud of him :) \nWish him and the entire team all the best for the release.. https://t.co/RzsllJAUYr Congratulations to @KeshavBansal08 and the  team of @TheGujaratLions on a great win last night! All the best.. \n#GameMaariChhe #IPL9 #GL Wishing everyone a very Happy and prosperous Ugadi from team #Brahmotsavam. \nఉగాది శుభాకాంక్షలు! https://t.co/5G9OsHGNtJ Brilliantly acted and directed .. Oopiri is an outstanding film .. Congrats to the entire team. Deeply saddened by the Brussels attacks.. Prayers for the victims and their families... Prayers for peace.. After a long schedule in Haridwar n Udaipur, finally back in town... Only to shoot some more :) #Brahmotsavam https://t.co/CFz3UqXj1M Please go and vote to make each vote count! https://t.co/8ZimIaDlvk Can't forget the personalised Santa visit to our room :) If u ask me one of the best hotel experiences I've ever had. Special mention about our stay at the @burjalarab. Hospitality and service world class.. Had a quick break in Dubai and the Swiss Alps.. Kids loved it! Now it's back to work.. https://t.co/1I7C5lwRFV Many happy returns @baraju_SuperHit.. Wishing you all the success for the launch of https://t.co/Sif6oOVlVU https://t.co/flsdgepvGH Here it is.. The very first teaser of Brahmotsavam! Wish you all a very Happy New Year.. Enjoy :) \nhttps://t.co/LQPydgiEG4 A rare sight ..The Burj Khalifa disappears into the clouds ..unreal weather in Dubai .love it. https://t.co/dRhTkIi0rr Hearing good reviews for #BhaleManchiRoju. Will watch once i am back.congrats to @isudheerbabu n the entire team. https://t.co/AwIT174ApZ #RebuildingChennai Your contribution can help bring cheer in someone's life.\nDonate as much as you can. Come enjoy Sreemanthudu at Skyfest 2015 on 27th Dec  and support Sparsh Hospice. #LookUpHyderabad #SkyFest A very big Thank You for all those who already have.. The need of the hour for the people of Chennai.\nPlease donate generously at the address given below. https://t.co/eSc2U43ULa #HealAChild https://t.co/KmlIC1t6JV https://t.co/H4hrRAAVLK Congratulations to @intexbrand on becoming the no.1 Indian mobile phone brand. wishing you'll a lot more success:) Watch \"Bhale Manchi Roju theatrical trailer - https://t.co/cJj1TYrB6Q\" on YouTube - https://t.co/BVHb6pPAB5 The trailor of bhale manchi roju is fresh and innovative ..enjoyed watching it :) https://t.co/uZmXUemm6u his debut film Tanu Nenu is set to release. Wish him all the success :) I cherish fond memories of working with director late Sobhan. Am happy that his son Santosh Sobhan took up acting.. https://t.co/a0Yqx9ZuUS Srimanthudu hits the small screens today for its World TV premiere.. Enjoy :) #SrimanthuduOnZeeTelugu At the highest point In the Eiffel !! Made my sons day 👍👍.. Feels good :) https://t.co/imaGf8gOQn I was and still am a huge fan of the legend.. A picture I will always cherish :) What a way to kick-start our holidays :) Gautam with the legendary Brian Charles Lara.. http://t.co/V9w4XIzL7Z All the best to my dear friends Archie &amp; Bobby for the launch of their coolest exhibition ABsalut style on Oct 19 :) http://t.co/EJGj8O8cVu The #Srimanthuda Song -http://t.co/Q72qVnQPxU The #Jaago Song -https://t.co/LNEpQGjlQZ I am sure they will provide high standards of care to the children of Bengaluru and the state of Karnataka . Best wishes to  Rainbow children's hospital, team Bengaluru  on their inaugural day :) #Dhimmathirigae - https://t.co/wR4DxECT2Y #Charuseela - https://t.co/tgHPqcScPT #JathaKalise - https://t.co/ou1WQWJrhg #RamaRama - https://t.co/LZvG8gua5m Complete songs of my film #Srimanthudu.. Enjoy :) A message from the legend https://t.co/zv8TTrGjsY Wishing Sukumar garu &amp; the entire team all the very best :) The teaser of kumari 21F is http://t.co/C06E9JIBhP notch work by Rathnavelu sir and DSP. Met U.S. CG Mr.Mullins at the embassy yesterday. Would like to thank him for making my visit extremely comfortable.. https://t.co/fmuw45nGVJ @KTRTRS Looking forward, sir. Thank you Looking forward to a constructive and meaningful journey ahead :) After much thought @KTRTRS garu and myself have chosen to adopt Siddhapuram  village of Kottur mandal in Mahabubnagar district :) Thanking each and everyone for ur unconditional love and support . Love you all :) https://t.co/5qElJa2ypV @sivakoratala Words and things are not enough for what U have given me sir :) Thank You for giving me my career's best film Srimanthudu... @iamsrk Done sir.. Ur always welcome.. Looking forward :) It was a pleasure meeting @iamsrk on our Brahmotsavam sets today. The entire cast and crew were thrilled.. Thanks Sir.. Humbled :) @ncbn Humbled and honoured sir... Glad you liked our film. Thank you very much. Congratulations to the entire team ..a job well done :) Saw 'hero '. Thanks to salman for giving the industry 2 promising stars Suraj Pancholi and Athiya shetty . The trailer of Kanche is stunning . All the best to the entire team .. @KTRTRS looking forward :) @KTRTRS Let's hope and work towards doing our best, sir:) Srimanthudu is a special film for many reasons :) Gained immense respect and love from all my fans... Made me more human :) I said YES :) more details to be announced soon.. He suggested I adopt a village from the most backward district of Mahbubnagar as part of their #GramaJyothi initiative. Very Humbled after receiving a congratulatory call on the success of Srimanthudu from Minister PR&amp;RD @KTRTRS. This would not have happened without the support of my brother-in-law, @jaygalla, MP from Guntur. The #SmartVillage initiative lead by @ncbn garu prompted me to adopt my own village, Burripalem. Lets chat on fb now: https://t.co/OZN6lPJsAC: I will be available to chat with you all today at 3.30 pm on http://t.co/RXZVi73Kuw #AskSrimanthudu Thank you, sir. Extremely touched and humbled by your kind words :) #KamalHaasan https://t.co/bT4Jg4faVD Harsha and Charusheela #SaluteSelfie\nWishing everyone a happy Independence Day!! from team #Srimanthudu http://t.co/nQ8OXbp1OX Going through some #AskChaaruseela questions... looks like @shrutihaasan had some fun:) @KTRTRS Thank you, sir.. Humbled.. RT @KTRTRS: On the eve of Gram Jyothi, Srimanthudu is a fab movie to catch: focus on rural development &amp; social responsibility. Great job@u… I urge all my fans and all the people who love watching movies to help kill piracy . A movie is an experience to be had in a theatre Dont miss it .Enjoy my films on the big screen. http://t.co/ZrLSq5ZJrR Fun times :) https://t.co/VoujlvsEBw Overwhelmed by this special gesture of TVS Phoenix just for my birthday.  https://t.co/4TrCy50u5X A big Thankyou for all your birthday wishes ..overwhelmed and very happy .. To all my fans out there I love you all .. 1 of the happiest days of my life .. Overwhelming response for Srimanthudu ..humbled .. Love you all.. Came across this picture ..Whoever did this .... Cool imagination :) http://t.co/EFiCc9g7MK RT @MythriOfficial: Here's the Release Date Teaser of #Srimanthudu! Let the celebrations begin! #CelebratingSrimanthudu - https://t.co/du71… Last date to register - 16th of August, 2015 #ahm2015. You don't have to be great to start but have to start to be great. Log off. Shut down. Run. Join thousands and participate in the Hyderabad marathon on the 30th of August. A first for me .. Thank You for all your love Tamil Nadu.. #Srimanthudu #Selvandhan http://t.co/YgF7NsSvGn 1 of the lighter moments of #Srimanthudu .. Just loved it :) http://t.co/lMEt5N1X4C Enjoy! https://t.co/upk2BXPBGN Thank you, love you and signing off! This was fun. Too bad I couldn't get to all the questions.. http://t.co/5Tv5GD5BTg Watch #Srimanthudu  https://t.co/9sM347ZHDx Thank you https://t.co/05w6bqmO9z Cant think of anything else. Always  wanted to be an actor.  https://t.co/PPt8AftkWC Brilliant  https://t.co/VtoRGlVBlR Home. https://t.co/8jqcidvqeS A New Earth by Eckhart Tolle.  https://t.co/d3hhfi4sfL Hi Australia :) What's up? https://t.co/nwbmTPXoJJ You can't explain that feeling :) https://t.co/q2xALYubvl Why Not. https://t.co/uno4Dtoh7P Of course.. Its the best way to watch a film..  https://t.co/eJEghxFuST Hello Vijayawada :) :) https://t.co/gKSjvcH0S6 HI to all of you! https://t.co/5d7xMejNBy New Zealand  https://t.co/I1YiIMXs3G Hi America  https://t.co/Ufb8vxDPTg She speaks fluent Telugu and it feels exhilarating to hear her  https://t.co/S5ROUrHvho Don't worry. It's me! https://t.co/5NomiqBxuy Hi Canada :)  https://t.co/iQuUmTfCt0 Hello Bengaluru :) https://t.co/ljiZxtmfFV Of course ... Keep talking to me :) https://t.co/xfad5g6ZaF Hello all ... :) https://t.co/NQX3YOtPd0 Extended Family :) https://t.co/44yVTNUX27 Srimanthudu redefines family https://t.co/Z5qgkpWZGs Hi Goutham :) https://t.co/CUcrF56IiF Cool and friendly Dad :) https://t.co/Ts2mSzk0k9 Happy birthday to buddu's sister :)  https://t.co/0ILBdnXgQr Its very exciting and thank you for the love. https://t.co/wJCLBRRbK7 Wasn't as easy as i thought sir, I had to prepare for the scene in my own way.   https://t.co/yqNX73jC1C Director Shiva Sir. https://t.co/Rw6si6jMnQ Thank you. He is Akshay tyagi whose my personal stylist. https://t.co/HxWeOc09q1 Hi All :) https://t.co/cgR7eBFHS0 The content of the film. https://t.co/1DpZSvxbUO Guys, I'm trying really hard.. hope it works out that way.  https://t.co/dHNMhgfpe4 He called me immediately and said it's outstanding! :) https://t.co/WepT5EkxyK She just turned 3...She's a bundle of joy. https://t.co/QpjqikxdQp Not at the moment... The right script has to come along. https://t.co/D07omg4NBc I can't do without him, he is irreplaceable  https://t.co/jMfHLqCYwB If a good script comes along, then why not.  https://t.co/DCfoIPy8hV It was an Instant yes. https://t.co/Pgo6kA7UCd The Pre climax! https://t.co/gUDjoljtGe He is a Super Star and am proud that he's my father https://t.co/zmYCbiUW4e Blessed :) https://t.co/oehXRdsnmM not true.. https://t.co/Uaxek1cCRU the content of Srimanthudu https://t.co/kOLdPRjDY9 Ooru nunchi chaala teeskunnaru. Back icheyali. Lekapothe lavu ayipotaru :) https://t.co/v2cyvhsu9u I Love You too https://t.co/E657XSjQSn Amazing. https://t.co/FFxDVAL7kM Yes there is a message but covered in a commercial way.. https://t.co/ju6K38skDw All Rounder! https://t.co/z7oIccZAqR Rock Star. https://t.co/TAmCuRcI8I Charuseela https://t.co/HiaUAV9fLE It was amazing working with him! https://t.co/HPISrTpkT5 A complete package. https://t.co/t4DZlE4Hf2 The pre climax scene  https://t.co/jhJBkqUwYN Top Class DOP. https://t.co/7nepQszLbj He carries a certain calmness to the sets and is always focussed which carries on to the actors https://t.co/TQ52zMNEbQ Simplicity https://t.co/3RglnRNAIl The Jaago Jaago song. https://t.co/kTie8aRVAn Amazing! https://t.co/n6b8UEi9yL Giving back to the society. That appealed to me most.  https://t.co/xTeryM9XGD Let's talk about Srimanthudu. 6 days for the release, hectic press meets and excitement in the air. #AskSrimanthudu http://t.co/4uo2B25AKf Hey guys.. Let's chat at @ 6 pm today on my handle #AskSrimanthudu⁠⁠⁠⁠\" RT @Uber_HYD: Calling all Movie buffs! Here's your chance to meet @urstrulyMahesh &amp; @shrutihaasan. Blog - http://t.co/r7Ej7H0Rvr http://t.c… Saddened by the sudden death of Mr Abdul Kalam. A pioneer in scientific research . May his soul rest in peace .. Watch the making of the Charuseela Song #CelebratingSrimanthuduSongs \nhttps://t.co/JeTBDEHaZY https://t.co/31n2fWqZPw https://t.co/gXhEDj3HYm Making of the Rama Rama song - http://t.co/hGIh03UqVa #CelebratingSrimanthuduSongs Jatha Kalise Song Trailer - https://t.co/s0O2P5wu5o Rama Rama Song Trailer - https://t.co/2Es7jYzuHJ Charuseela Song Trailer - https://t.co/YD9P3c4qT1 Srimanthudu Theatrical Trailer - https://t.co/eBsI9lIVQ6 Congratulations to you Sir and to ur wonderful team :) Prabhas and Rana were terrific . Their hard work and dedication has paid off :) Proud of arka media for producing this magnum opus :) Proud of keeravani garu\"s unimaginable and unbelievable back ground score :) Proud that SS Rajamouli is from our Telugu film industry:) Never did I imagine that a Telugu film would smash all BO records in our country and across the globe ..real proud :) Just got back from Switzerland and caught the phenomenon Bahubali..goosebumps.. http://t.co/ZU0fJkS9I1 Sudheer has really come of age as an actor .. Loved his performance :) congrats to the entire team .. Saw Krishnamma kalipindi idharini.. Genuine honest love story ..enjoyed watching it .. Srimanthudu now releases on 7 th August .. I'm sure you all will make this a memorable birthday for me :) Very Excited about my new ad for the 2015 edition TVS Phoenix 125..https://t.co/7PBLmulmjh I usually don't do this but it's our superstar's birthday..4all the dubsmash fans..enjoy:) http://t.co/OI7ed2qvZk Thankyou  Koratala siva , Madhie , DSP, and producers Naveen,Ravi,CVM and the entire MYTHRI team.. July 17 it is ! With all ur love n blessings it will be another memorable day in my career :) Thank you for an overwhelming response 4 The first look of Srimanthudu :) Very best to team Brahmothsavam, Srikanth , randy, Micky , Thota Tharani , Sreekar Prasad and PVP Celebration of life and great times ahead ! Kickstarting Brahmothsavam !! The official link #Srimanthudu Teaser -&gt; http://t.co/FrMRPwJtN6   Enjoy:) Wishing the evergreen Superstar a very happy birthday:) Official first look.. http://t.co/Veo4uAo5Z7 The first look of Aina ishtam Nuvvu is interesting and innovative . All the best to Naveen and the entire team.. Love this ad.. One of the coolest:) https://t.co/TpkfSEZbmK He is and will always be my inspiration:) Congratulations on completing 50 fabulous years .. Extremely proud :) My father is and will always remain 1 of the greatest personalities in the Telugu film industry .. http://t.co/L0a6XJ3QiF   help us save more children. A big Thankyou for those who already have . https://t.co/KmiagM4icJ RT @TVSApache_RTR: The First Indian factory racing team at Dakar, TVS Racing is all set to leave its mark. #RTR450atDakar http://t.co/3N7bN… Had a great time :) http://t.co/YB15wb8HbF At my sons school event a week ago:) http://t.co/yFLF6gKCxM Wishing @akulbalaji all the very best for his finals of big boss Kannada . http://t.co/bn8vUm26fW . Pledge &amp; Get song at http://t.co/yfVVEq32bt #reachforthesky http://t.co/NAFvZY26RK @mardofficial breaks new song to help women get online. so 19th it is ……LETS CELEBRATE..:) i am and will always be indebted to you... thankyou sreenu garu for giving me a new career high…..love you sir :} never have i been so relaxed and happy in my entire career:) finished dubbing for aagudu.. Happy to be a part of the @paragonfootwear family..:) he's just hooked to the audio tracks of aagadu..:)bhelpuri is his favourite:)keeps going on repeat mode:) thanks thaman:) the love of my life has turned eight today. thank you so much for your love and wishes :} HAPPY INDEPENDENCE DAY PEOPLE.. ALWAYS ALWAYS PROUD TO BE AN INDIAN :)\nhttp://t.co/laf1DKQt61 sadly can't make it as I have been a bit unwell.. looking forward to seeing you all very soon.. Was looking forward to meetings my fans and the TVS family in Hyderabad tomorrow.. pleasantly surprised by Akhil's cameo in the end..the boy has amazing screen presence....a star to look out for in the future.:) congrats to the entire team especially to director vikram for his 'out of the box' idea.!! manam is an outstanding film..my heart fills up with joy when plots like these work.. ANR lives on..what a moment for the akkineni family..:) a big thankyou to all of my fans ..love you guys as always:) Aagadu's trailor gets a phenomenal response.thanks to the entire team of 14 reels and my dear director sreenu vaitla.. wishing my Father, the evergreen superstar a very happy birthday:) Have been following his campaign closely n I'm sure he will win with a thumping majority. I'm really happy that all my fans  n people of guntur have welcomed and embraced @jaygalla as their own.. I've always maintained that I'm apolitical.. still am. However, I need to break my silence to talk a little (cont) http://t.co/GLubBiMbu9 For all those guys who have supported me on this 1 journey , love you forever. Proud. 1 will remain as 1 of the most memorable films I've ever done.Take a bow sukumar &amp; the entire team of 1. My babies in conversation :) :) enjoy http://t.co/my1oePDNdn Just want to say a big thankyou2 d entire team of 1 :) 1 will b a memorable film in my career. Off 4a short holiday with the family:) back in a few days2 b amongst d xcitement:) Heading for all time.heading for 1 time .love u guys. Forever. Happy New Year. This is for all who love me.. Happy 1 year:) http://t.co/fzVBdiNC6v The \"1\" way :) :) Come jan 10 th the festival will be celebrated in a much bigger way:) :) My producers,14 reels have put in their best efforts to make this a landmark film in all aspects:) :) a big thankyou to all :) Last but not the least is my director sukumar.his talent is unmatchable.1 is his best work..thankyou sir :) :) A special mention is required for the breathtaking camera work by ratnavelu sir:)simply mind blowing :):) It's DSP's best work till date ..he's worked really hard and it shows:) thankyou Devi. Would like to thank sukumar, our dop ratnavelu and the entire team of 14 reels for a film well made:) This film will be another landmark film in my career:) Overwhelmed by the phenomenal response for the audio teasers:) thankyou all:) The 1st round of publicity for \"1\" kicks off. Thank you for the sensational response :) Twitter account finally verified:) thankyou to the twitter team:) :) Hearing really nice things about your tv show premiering tomorrow.'Ek mutthi aasman' on zee. . Wishing you all the best shilpa.:) So does he.... :) :) http://t.co/sumrKRPc0o She loves birds... :) :) http://t.co/IlcxTn2LRy Feels really good 2b part of an initiative like MARD. Thanks Farhan:) RT @FarOutAkhtar: Telugu rendition of the MARD poem by Mahesh Babu. @urstrulyMahesh http://t.co/BAS0q3JtkN Only blessings and wishes for our little princess:) http://t.co/l2HYRQlvFp She loves my nose..:) my daughter turns 1 tomorrow . Wishing the love of our lives a very happy birthday:) http://t.co/t56GCVkFuo wonder how maruthi makes quality films in such compact budgets??? TFI needs more people like him.. really happy for sudheer ...hardwork always pays..wishing him even bigger successes for his future projects.. congratulations 2 sudheer ,maruthi ,the director and d entire cast n crew.. prema katha chithram..totally enjoyed it..really happy for the kind of success d film has achieved.. Just got calls2 know someone walked in2 my account..sorry guys. It's not me .. done the usual, changed d password..goodnight.. thankyou so much for your love and support as always :) the entire team is working really hard to meet your expectations...will be another landmark film in my career.. overwhelmed with the response of the 1st look and teaser of our film 1. here's wishing the evergreen superstar a very happy birthday :) http://t.co/uoTSV3TSvb this is the correct link 4 @krisgethin 12 week transformation video trainer. Will try to b more regular ...love u all as always:) shooting nights 4 d next 10days..will b attending d Nandi awards function on d 11th to collect my award for Dookudu:) those of u interested here's d link to his 12wk video trainer.http//www.bodybuilding.com/fun/kris-gethin-12-week-daily-trainer.html i took up his DTP challenge n achieved it:) transformation complete..im sure u all will like my new look :):) the last 3mths have been really challenging,.as ul know I've been training with Kris Gethin who i consider d best trainer in d world. feels really good when ul appreciate my doing a film like SVSC.thanks for supporting my decision and performance:):) a little late in the day,but wud still like to thank all u guys for d phenomenal success of SVSC. on this note wud also like to 2 officially welcome him to twitter...@sreenuvaitla. Welcome Sir :) Thoroughly enjoyed it...congrats Sir :) saw Badshah..a Sreenu Vaitla show all d way.sreenu garu has proved once again that he's d king of entertainment. Waiting to celebrate this festival with u guys from jan 11th...bigger than ever...:). Luv u all :) :) Really feel happy n proud to b associated with this film....thank you sir for giving me this opportunity..:) The music , the film, the performances r all a reflection of  a one man's soul.... Srikanth addala... In my opinion , d album of svsc. Is a masterpiece... Svsc audio gets an outstanding response.:) :) thank you mickey for giving ur best.....:) u deserve every bit if it... :) Krishnam vande jagadgurum is an outstanding effort.thoroughly enjoyed it...congrats to krish,Rana n d entire team. Looking forward to a long &amp; great association with them :) Heard some great feedback for my #Mahindra TVC yesterday..glad to be associated with one of India's most reputed brands Sorry for being away for so long....will try to b more regular...thanks for all ur love n support..:) I'd like to thank d entire team of 14 reels n my favourite director seenu vytla...wouldn't have.been possible without him:) It is indeed an honour 2win d most prestigious award of the Telugu film industry. Ghattamaneni Sitara is the name:)need all ur love n blessings:) Congratulations to ba Raju ,jaya garu n the entire team of 'lovely' for celebrating 100 days. :) A special mention needs 2b made for sudeep's performance...outstanding!!! Take a bow ssrajamouli:)congratulations to the entire team... Eega will stand out as 1 of d greatest films ever made in the Telugu film industry. And a very big thankyou to all my fans n d people who voted for me n my team of dookudu:):)luv u all:):) Wud like to thank the  Times Of India group and d people at Siima for taking d initiative:):) Dookudu wins all d popular awards in d 1st ever hyd.times film awards and at d Siima awards:):) Waiting to celebrate all over again:) Superb response for svsc teaser...Thankyou so much guys....waiting eagerly for the festive season:) Here's wishing my evergreen superstar father a very happy birthday:):) So may 31st it is...... Enjoy :) Thoroughly enjoying the experience of working with a legend like him.... A big Thankyou to my director Srikanth addala, my producer dilraju ,and of course venkatesh garu.... Svsc 1st look will b out on 31st:) will be Nother milestone in my career..:) RT @jaygalla: The Man in the Arena: \"It is not the critic who counts; not the man who points out how the strong man stumbles, (cont) htt ... Congrats Bavva! @jaygalla #67.. May 2012 Top 100 Entrepreneurs to Follow on Twitter - http://t.co/kfnXyajc” All d best sir...looking forward 4 yet another rocking film from u:) congratulations in advance:) :) In Singapore ...on a holiday...would have been present otherwise at d audio launch... Wishing Rajamouli and rama garu all d best for eega.... @jaygalla \"It starts with a purpose&amp;vision &amp; long term perspective, backed by strategy&amp;resources, and finally Execution.. its not easy..\" what a performance:) A true star, A true legend:)congratulations!! Sachin Tendulkar:) Like2thank d entire team of thumsup for making a really rocking commercial...thanks guys:) The commercial will b aired this Sunday...watch out for it...by far one of my best :) Log onto http://t.co/Qy158MOC n checkout stills of my new commercial...jus love it:) BusinessLine: @jaygalla says CII wants 2 drive balanced growth toward non-farm workforce of 35mn across 50 cities of AP http://t.co/1CghgMI2 If ur still wondering why @jaygalla is the only person I follow, pls read this interview & follow him.. Way2go Bavva :) http://t.co/HPqtdcbl love failure is 1of the most innovative films i saw in recent times..congrats to sidharth n d entire team for pulling it off.. SVSC ..A month long outdoor..away from home..lookin 4ward 2 work after a much needed 2month break:) Headed2 bangkok4 an ad shoot.out4 a week..then join SVSC from 16th:) Voted no.5 in d times poll:)what can I say..a big THANK U 2 all of u who made it happen n 2 d Times Group:) Businessman's Unbelievable business continues:):) Here's wishing her d happiest birthday ever:):) n many thanks for all ur love n wishes..:) Can u believe it..in d middle of all d frenzy n euphoria I forgot2 wish my wife on her birthday!! Terrible.. Your  RR is even better than d audio..Take a bow brother:):) Forgot 2 mention 1name yesterday..SS Thaman.. thanks again 4 a memorable festival u all have given me :) love u all.. the party 4me started sept.23rd of last year..it hasn't stopped since..it all feels like a dream.. thank you to rr venkat and the entire cast n crew of businessman.. will always b indebted 2 u:) with businessman, he's taken me to a the next level as an actor..cudnt have asked 4 more:) thank you sir.. jagan garu gave me super stardom with pokiri.... sensational stunning openings..thankyou..love u guys... the whole experience has been overwhelming..my eyes turn moist with every compliment received..never felt this way b4:) Thankyou 4 making businessman another sensational hit of my career:) This sankranti festival is d best I&#39;ve ever had..:) Excited:)waiting for dayafter:) I wud like 2 thank RR venkat n his fabulous team for a massive release n unbelievable publicity for Businessman..thanku sir... He just rocked it....thanku sir....waiting for jan 13th.. Special thanks2 my director Jagan garu,the USP of businessman r jagan garu's dialogues...its his best ever..... The businessman will now release Jan13th.in my opinion its a super release..let's celebrate d festival together:) My best look till date.will b another sensational hit in my career..waiting4 jan11th. http://t.co/o1oAclIT Today is d 50th day of dookudu:) Want to thank my whole team at 14 reels and my director and all my fans who made this possible... Waitin for Jan 11th sir...let's rock again....:) It was 1 of d most challenging characters I've ever played...but it all seemed so easy..thanks 2 jagan garu's clarity.. Its an honour n priveledge 4me2b a part of Businessman Jagan garu:) Jagan garu is known 4his charectorisation of heroes in his films....Businessman is his best ever... 1st look of businessman is out:)response has been terrific....:) Wana thank d producers of 14reels,my director seenu vytla n d entire team....what can I say....only happiness at this time.... It&#39;s official.Dookudu is d highest grosser of the Telugu film industry....unbelievable..... Really happy n satisfied with d way things r going......thank u 4 all ur luv n support ...:) Dookudu mania continues:):)......outstanding collections all over..... Only 1 man can do it:) puri jagan....thank u sir for giving Me another milestone film in my career... Releasing Jan 11 2012..... Worldwide. Most of ul must hav heard ..The Businessman release is preponed.. Stunning collections continue for dookudu....what else can I say but a big thank u to all of u 4 all ur luv n support:) Magic n miracles r happening for Dookudu:) Dookudu features in d LA Times..Unbelievable news for d Telugu film industry:) 2day has been unbelievable:):) Its double celebration time....v r bringing in r super directors birthday as well:):) On behalf of d dookudu team I wud like to thank all u guys for giving us a blockbuster:):) Love u guys....now off2 party with my dookudu team....gonna b a long night:):) Dookudu has taken d biggest opening ever:)totally overwhelmed by d response.... Luv u people Waitin for d 23rd Will always b indebted 2my super director seenu vytla for givin me d biggest hit in my career:)thankyou sir:) For Dookudu... Thankyou ram garu..:) Thankyou anil garu..:) Thankyou gopi garu..:) Unbelievable team.....unbelievable producers..unbelievable director.. Cherished every second,minute,hour n day while shootin 4 dookudu:):) 2day was my last day of shoot 4 dookudu..was a bit emotional ... Many happy returns of d day to pavan kalyan:)wishin him all d best always:):) Eid Mubarak n happy Ganesh Chavithi to all:):) Gettin back 2 Dookudu....excited is d word:)wudnt wana talk much about it..jus waiting for d release..... A big thankyou 4 all ur blessings n luv for gautam .... Will b another milestone in my career:)a big thanx2 my rockstar director puri jagan:) On this auspicious day I'd like to inform all my loved ones that 'The Businessman rolls 2morrow:) As 4me I'm doin gr8:)work work work all d way....goodnight.....god bless:):) Thanx thamann:)hope d 2nd half is even better:):) Jus hada word with my director....accordin to him the 1st half rr is outstanding:)all praise 4 thamann....:) Dookudu audio is 1 of my best so far...a great effort by the whole team:) Audio release confirmed for 18th:)looking forward:) Check this out its an official app by my team:)leme kno. How u like it:) http://itunes.apple.com/in/app/prince-mahesh/id454228388?mt=8&ls=1 It will b uploaded in an hour:)enjoy:) www.Facebook.com/superstardookudu,dis is d official facebook page ...take a look at this site...its d 2nd teaser of r film:) Hi everyone:)thankyou so much for all ur wishes n love ...:)feels gr8 2 have so much luv n goodwill surround me:) On his own:):) http://twitpic.com/5gnt9x Have uploaded sum pics of gautam from his swiss vacation:):) Snow mountain trek.. http://twitpic.com/5gnr5t With euro mouse:) http://twitpic.com/5gnqsp Taxi driver:) http://twitpic.com/5gnqc6 will try to upload sum pics of gautam from his swiss holiday:)love to u all:) its by far one of the most efficient production units  ive ever worked with:) special mention needs to made for my producers..ram, gopi n anil and d entire team @14reels... i wud like to thank s.vytla for dukudu.i know what d man\"s done for this film:) thankyou sir..waiting for the release:) he was particularly happy coz he loved the promo of dukudu:) the 1st look of dukudu has recieved a stunning response:) spoke to him 2day ...he sounded really cheerful as always... hes in ooty today away from the hyd heat...chilling:) heres wishing my father a very happy birthday:) the evergreen superstar. Proud n honoured2b d face of idea which is owned by d prestigious aditya birla group.looking forward to a great association with them... Very xcited to b associated wit idea,d new campaign for 3g services 2b on air this week..leme kno what ul think... For anyone who hasn't seen the pics from yeaterday's match, pls follow @jaygalla.. The lucky ones who follow him saw the pics yesterday.. Thanks Team India:):) Had d time of my life with family n friends:) Am glad I took d decision not2b in d vip box ...as my experience in d normal stands was something else.d energy there is unreal:) was a diffrent thrill walkin 3km to d stadium,gettin baked in d sun,n cheering team India like any normal cricket fan:) Still feelin d euphoria:)am so glad I saw d match in d stadium.will always b 1of my most memorable xperiences:) Feel like a normal human being :) Sitting in the 'regular' seats with all the real fans was truly a special experience.. I'll take this over any VIP experience till now.. Jus like rest of the country, I'm still up celebrating Our Win! What a fantastic performance by all our boys.. Can't describe the feeling.. love n prayers is what d people of japan need..please send as much of it as u can...praying for japan.. also congrats to @jaygalla for completing 25years of amararaja.a gr8 achievement 4a gr8 co. Like always need ur love n support..things r looking gr8 with exciting projects ahead:) my dream is comin true finally..I will be working in a mani rathnam film.1of d happiest days of my life:) Now 4 sum big news..met mani sir this morning..yes,d legendary mani rathnam.. Dubbed 4 d vivel commercial last evening..gr8 ad.totally luvd it..a big thanks2 d entire itc team:) Also was down with a viral for d last few days..just recovered..thanks a lot for all ur love n prayers:) Sorry guys have been away 2long..have been workin really hard.. Sorry guys have been away2 long ..please xcuse me as have been workin really hard... Send your love to my dear wife.. love you guys as always, urstruly.. And my final tweet for the night.. All my love & wishes to my darling wife Namrata bringing in her birthday in another 35min.. love you baby hangin out in my new home with my family & friends including @isumanth.. congrats on GHS bro.. just rock it! btw, that was an original @jaygalla quote.. simply loved it.. told you the man is full of wisdom.. RT @jaygalla: Even walking is a series of falling then recovering as we move forward.. So is all momentum.. We need to master the Fall a ... Gotto go..need2get2 my Xbox 360:):)my new addiction..fascinating toy..good night.. Dookudu schedule kicks off tomorrow..lookin 4ward to it..always a pleasure working with a talent like seenu vytla:):) Shot d press with tarun khiwal..1 of my favourite photographers... The creative team n d technical crew were awesum:):)will b a cool ad.had gr8 fun shooting:) Jus got back home from mumbai..finished shooting for d vivel itc campaign.. hes visiting me at my new home .....he loves the place.....makes me very happy .... Yes.. Finally I'm starting to follow someone, my Bawa, @jaygalla.. who has been truly inspirational for me.. Good night guys :)...I'm active on twitter again:):):) Anyways abig thanks 2 d times group n above all a bigger thanks to all my loving fans:):) Apparently I'm ranked as d 12th most desirable man in india..a bit shy n embarrassed.. Jus figured it out 4 d 1st time in my life that u need2 get adjusted to super luxury as well:):) My thoughts on d house..its beautiful:)but finding it a little2 big..jus like how I felt with my rangerover:):) Always wanted 2 walk in2 a fully finished home..:) Yes,yes..ur readin it rite..never saw it while it was being built..that was d deal between me n my wife:) Lettin u in on a little secret..saw d house 4 d 1st time just a couple of weeks ago... Finally moved in2 my new house 2day:):)stunningly beautiful:)thanx2my wife:) Here's wishing all u guys a rocking 2011..lots of love:):) Shifting homes...busy busy busy..please bear with me...will b more regular...I promise:) The 1st kiss:) http://twitpic.com/38vfse http://twitpic.com/38vfi5 Dolphins!! http://twitpic.com/38vf41 http://twitpic.com/38vcbm Fish gazer http://twitpic.com/38vc48 http://twitpic.com/38vbx0 Dancin in d pools! http://twitpic.com/38vb6f Gautam did all he cud this trip from fish gazing to kissin a dolphin..gonna try to upload sum pics of his fun trip:) 5star performance by hritik.makes me very happy when I c performances like that:)outstanding!! Also caught guzaarish on d 16th!!yes,yes..it released early there... Stayed at d atlantis!!really stunnin hotel:)gautam had a blast:):) Sorry guys,been away2long..spent sum quality time with d wife n son in dubai:)wasa nice breather after a hectic turkey schedule.. My 1st diwali away from home n family.. a week more of work here in turkey...then dubai,where my family joins me:):) Festival time..celebrations:)wishing all of u a very happy diwali n a fabulous new year.. Sorry guys!been away2long..shooting nonstop..shoots gr8:)got a few days more..catch ul soon:)lotsa love:) Saw Raktacharitra...can't get my mind of it..spinechilling..Ramu at his best.. I'm sure it will be 1 rocking schedule...really excited n lookin 4ward to it:) Off2 istanbul on friday4a 15day long schedule wid s.vytla:) Seemed like old times:):) Back2watchin films..saw iron man2 n robinhood back2back...been a while since I did this..both were brilliant:) A big thankyou to all my fans in usa,as per reports khaaleja will be d biggest grosser for a telugu film ever:)thanku all:) A BIG thanks2 my dear friend trivikram,my amazing producer C kalyan,n d entire unit of khaaleja:) Khaaleja is poised2 becum a very big hit at d box office:):)its been 1 of my most satisfying films as an actor..ever!! 1of my favourite photos from the provogue campaign:) http://twitpic.com/2x83v7 its bn a plsr tlkin 2 u guys..n i always fl lcky wrkin wid a gr8 actor like Mahesh..he has given his best to Khaaleja..watch him..have fun.. @PoojaDaPrincess thanks..:) @ravchandra it's just a coincidence.. @Ratnadeep_isin u need not shout to show ur strength.. he has money to buy otherwise bullets to negotiate.. @charan_rohith yes! @sunstarn alluri seetha ramaraju is his grandpa's fav.. Mahesh's name is G Seetha Rama Raju.. :) @rajendrabagalur Mayabazaar in b/w.. @NAGESHndACTION yeah u r right...:) @itsme_arun4u aravataniki idhi assembly kuda kadhu.. @iprithvi007 thanks to yash! he has taken too much time to light that scene..meanwhile we saw the toy cars on the table and got he idea.. @raghav_rao every human is constituted by the five elements... u can't escape.. :) @kairav_p in the 1st fight.. if u closely observe..v didn't show blood n death..v tried to  advntrus than violent.. @katpellykapil thnk u Kapil..:) @anilcallin u can't win a war without booldshed... @venkatburagoni its not justification...it is how a taxi driver understands the definition of God..:) @i_am_arvind i agree! @cinemalover1 both the ways...:) @Iam_Yashwanth better take an authorised film course... :) @venna_maheshfan u shud thank Prem Rakshit for this.. he did a gr8 job... :) @veturisarma u can't write these type of humor n realistic characters on paper... its a mixture of writing n on-spot improvisation..:) @ravikirann coz v arldy did Athadu.. @kalyankanuru who else...Mahesh! :) @Mindofaade Thank u..:) Hi! dis is Trivikram signing in.. i'm ready guys... :) now..surprise!surprise!trivikram will b available 4 a Q n A session with ul  between 7pm-8pm tonight on my twitter account.enjoy! Will always b thankful 2 my friend trivikram4 giving me such an amazing charector 2play..thoroughly enjoyed d experience:) Khaaleja has set new benchmarks 4me in terms of performance.. I wish n pray that it continues 2 rock d box office:)n go on 2 becum 1of d biggest hits of my career:) Wud like 2thank d audiences n all my fans4 d terrific openings khaaleja got:) Thank u so much4 all ur appreciation n ur luv n support:) means a lot2me as khaaleja is my best performance till date.. Jus got back from d khaaleja press meet.1of my most enjoyable press meets ever.had loads of fun:) Jus saw robot..only one word..WOW.. First look ... Provogue http://twitpic.com/2tkuni The entire crew of radio mirchi were outstanding ...they sure know how 2put a show together:):) Had a gr8 time at radio mirchi all of 2day:) was fun doing d audio launch at a radio station..:) Stunning response for piliche as well:):)d stage is all set for khaaleja... The full song of piliche will be available in d sony link n radio stations from 4 today evening:) Arriving OCT 7th...confirmed yet again..OCT 7th...all tv channels again confirming OCT 7th:):) Khaaleja will change everything:):)from now on october will b my month:) Apparently d month of october hasn't worked 4my earlier films..so they say.... this is d right link guys:)enjoy:) http://www.youtube.com/watch?v=cIxd1aruuhU\n\nhttp://www.youtube.com/watch?v=cIxd1aruuhU like all of you out there even i am WAITING for khaaleja to rock the theatres.... very rarely songs like these become instant chart busters...d entire team is jumping with joy:)its an outstanding sign. this was d message sent  to me by sony guys:) i knew this one would rock.... the response 2 sada siva has been tremendous.so v feel that it wud b better if v upload d 2nd audio sampler 2morrow mornin.:) the second song \"piliche\" will be officially released around 5ish today too:) audio update:)d full song of sada siva will be officially released by 1.30 .at d sony link and radio channels.enjoy.. @POKIRI2 oct7 oct7 oct7....n yes oct7. Having said that,this song was conceptualised by trivikram..hats off 2 d guy:):) According 2me 'sada siva' is d best song mani's composed in my career:)jus luv it.. Enjoy guys.......hope ul like it even more this time.....real is always good:) Http://www.Facebook.com/pages/Sony-music-south/138529366173057. Oops...missed a couple of dots....the official link for the audio teasers is...... Thank you all n thanks again Mani for giving me another super hit album:) The only comforting factor was that the response has been mind-blowing:):) Was a bit upset initially when d songs were out unofficially ..with d sound quality being so poor... Sure many of u have heard it already:)listening 2am original always makes d difference... the film\"s slated for a oct 7th release:)will try n post some audio teasers soon... Have sum news finally 4 u guys:):)hada word with r producer c kalyan,n from d looks of it d audio will b out on27th sept:) My apologies for not being in touch...was a bit caught up in my world... Wishing everyone a happy Ganesh Chaturthi n a very happy Eid:):) It touches me deeply 2 b loved the way I am:):)one of d blessings of being a star:) I say this again ...2know that all those people were my fans n waitin in d rain only 2get a glimpse of me, was overwhelming:):) There were just2 many people n less security ..that's all...nothing more to it... Lots of confusion regardin my haleem visit..Please guys,nobody attacked me..... Having said all that deep down I'm really touched that all those people there were waiting to see me n shower their luv on me.. Has been a long day..n a little disturbing one at that:(hopin 4 a fantastic tomorrow:)send me ur luv guys... Yes,yes..was literally manhandled by d mob in 1 of d places...quite scary if u ask me.. finished my haleem visits for thumbsup.managed 2get back home in 1 piece.. Will announce d audio release date in a couple of days...please bear with me guys.... Hearin d master mix of khaaleja audio...d songs r rockin:):)thanks 1nce again mani:):) Really impressed with his clarity...d script is rocking...will start workin on it by d end of d month:):) Met seenu vytla at d shoot 2day.d man's on a mission guys:):).won't settle 4 anything less than a blockbuster:):) Here's wishing pawan a very happy birthday from gautam namrata n me:)he will always have r love :):) Back2 work with more renewed energy...will keep u updated wid d film's progress... Gautam hada total blast:):)n thanks a million for ur wishes n blessings on his birthday...my boy is very lucky:):) Have 2 admit,this holiday was total bliss:):)jus needed this1 was pendin 4 a very long time... Sorry people..missed u all..just felt like takin a break... Jus back from goa..nice to b home ...:) Thankfully its all looking gud :)excellent infact keepin my fingers crossed:):) Post production In full swing..everything moving accordin 2plan..4me d most nerve racking period of all... Btw hearing gr8 things bout prakash's film,inidhu inidhu...am sure it will b as big as happy days:)way2go prakash!way2go:) Prakash has promised a party in hyd..looking forward to it:):)hava gr8 life guys:) Wanted to honestly b ther 4 their wedding..just cudnt make it ... Here's wishing prakash raj n pony verma a truly happy married life:)they make a wonderful couple..really happy 4 them:):) iv downloaded sum cool games 4gautam:)thanks to u all...he really loves the talking tomcat..as 4me i jus love pacman:) the xcitement has begun.....n the butterflies in my stomach r moving rapidly.... the teaser promo in it is a big THUMBS UP:):) the thumbs up multipacks with d dvd r OUT....d response is MINDBLOWING:):):) Heading off...hava gr8 day u all..lotsa love:):) Btw can u suggest some games 4gautam 4d ipad??sum really cool ones..he really luvs it:):) Hey guys:)3rd day of my song ..must say its looking gud n turning out really well:):)truly impressed with premrakshit:) Its about time we did a film 2gether..I'm sure r pairing will work like magic:)gonna work sumthing out real soon:):) Met genelia 2day 4d 1st time!she's totally a live wire:)lovely girl:):) Saw leader on dvd..hmmmm....I think shekhar kammulla is capable of much more... Jus downloaded d tweetdeck app:)awesum:):)will b tweetin from this beauty very soon:):) I'm totally hooked 2 this ipad:):)what apps people ..what apps..just super... My dr. tells me the no. Of cases r alarming:(:(   please b careful people... 2all of u out there please get ur swineflu vaccine shot!!yes its here:)jus got mine 2day:)not 4kids yet..need2 b 18.. Compliments comin from a gr8 actor like him is indeed a pat on d back:):) Met bharani at d dubbing..he saw a couple of scenes.. n jus loved my performance:):) My son's even more hooked on2 it!! He keeps playin this game called papertoss..must say he's really gud at it:):) Got myself an ipad:)unbelievable toy:)luv d ibook app. Its about time d TFI starts shooting in sync sound.... To recreate d whole magic all over again in a small room in a studio is jus not on... Started dubbing today..its 1 of d most painful jobs 4 an actor... these packs will b made available in select outlets ina couple of days:):) lotsa xciting footage in this dvd....so go grab ur multipacks...ul love it:):) this multipack comes with a complimentary dvd of d makin of my film!!and a teaser promo:):) thumbsup event went on really well 2day:)launched d\" khaleeja unda\" campaign along with d multi pack offer:) Lots of confusion regardin my date of birth..its 9th august1975. So guess its sorted now:) Thanks a million 4 all ur love n wishes:):)makes me very happy:) was having network problems:(cudnt access d comp as well.....all good now:) The first look is out :) .... really over joyed with the response.. Thanks a ton you all..extremely touched...... Hii Guys!!! Working Still 6 http://twitpic.com/2bss5p Working Still 5 http://twitpic.com/2bss0x Working still 4 http://twitpic.com/2bsrup am also uploading some working stills which i thought might interest you....ENJOY:) Working Still 3 http://twitpic.com/2bsrh1 Working still 2 http://twitpic.com/2bsqu4 hey guys...this is the 1st look of my film:):) hope u all like it:) Working Still 1 http://twitpic.com/2bsqm9 http://twitpic.com/2bspss Heard d songs of robo..terrific n very futuristic.. Feelin a little wierd driving in this neu suv of mine!! its a little 2big4my liking!!or mayb I'm jus2 attached2my eclass:):) Either way will b her or my driver driving me:):)so its 4me:):) after all.....:):) Considerin I don't really drive..wonder if she bought it4 me or 4 her :):):) Its arrived a week early... But looks awesum:):):) Its d range rover vogue:):) My wife decided2 gift me a monster 4 a birthday gift!!! Feelin much better 2day:)thanks so much 4ur concern n love:):) Down wid d flu:( d son gave it to me....totally out of it:( he\"s a complete natural:) apparently sunils dances in maryadaramanna r terrific...i always was of d opinion that hes by far d best dancer.... Really happy for sunil ..he's 1of d nicest human beings iv met... Success has becum a habit for rajamouli:)congrats to d entire team:):) just thought of replying to u guys one on one:)was good fun....have a good night u all:):) @You_Rajesh hey there:) hope your having a good day:) @Isumanth hey dude...thanks4 passin d message...btw it was really nice catchin up:) @kadalinataraj point noted..will not happen again:):)sorry!! @venky_101188 let's keep r fingers crossed buddy:):) @ganeshggv thanks a ton:) @nimiksha yes I'm online:)n thankyou so much for ur love n support:) @Balaji_Bhonsle looks like d audio will release mid august:)tryin 2 get it out on my bday but looks unlikely.. @rams00722 even I'm waitin buddy:) Overwhelmed with d response:):)thankyou so much:):)really touched:):) Finally.. here it is.. The logo of my next film.. http://twitpic.com/26pqmi Keep watchin d homepage...its gonna change:):) I know u guys r eagerly waiting to know d title of my film..it will b officially announced in a day or2:):) Saw d trailor of inception'..jus 1word 4 it..WOW..its 1 of those films I'm gonna catch ina theatre.. Was a wrap 4me by noon:)slept for 4 straight hours post lunch:):)haven't done that ina while:):) Skippin dinner..off 2 bed! Hava gud nite u all :)lots of love:):) again brahmanandam fed us so much of gr8 home food that we ate till v were sick!! Was shootin with brahmanandam 2day. my son paid me a surprise visit:)2meet 'comedy uncle'.. that's what my son calls him:) took a flight early mornin...had enuf time to grab a bite :(left for location far far away...vikarabad ..jus got back .. He was one of the 1st n few who stood by me :)I will always wish him well:):)good luck pawan,I'm sure ul rock as always.. We met just a couple of times,but I'll always remember how he supported me durin d piracy issue of my film arjun:) sum1 mentioned d other day that pawan spoke really well at d audio function.I wasn't surprised:)he's sum1 who I'm really fond of. Heard d audio of puli is out..wana wish d entire team of puli all d best..hope it rocks.. Its a wrap 4 d songs:):)waitin to get back home..:) Will keep u all posted:)lotsa love:) Shootin ata hectic pace..work work work...wrappin up songs 2morrow..n headin home 2yet another 3days of shoot.. Good night:)will keep u posted!!love u all:):) Tomorrow's gonna b hectic...costume trials,rehearsals n meetings..looks like a long day ahead.. Had lunch with trivikram n my dear friend jayant whom I met with after a really long time:) 2day spent d mornin at d spa!cudnt do much coz of d bandh!! Met ahmed...hada long discussion wit him n trivikram regardin d songs..zeroed in on sum interestin stuff:) In bombay...weather 's lovely:)2morrow rehearsals n dayafter song starts:) catch u all later.....hava gr8 night .... ahmed khan is d choreographer...ive seen a lot of his work...hes brilliant!!really excited n looking forward to d shoot.. now coming back to Me...im heading to mumbai to shoot a couple of songs for my film with trivikram....... im sure rajamouli will continue his magic at the box office...:) just wanna wish them ALL THE BEST! on their upcoming release MARYADA RAMANNA..... its really difficult to b like that with d kind of success rajamouli has achieved....just love people like them:) these guys r just fantastic:)so down to earth ,so grounded .... spent d evening with rajamouli n his wife rama..hada really nice time:)good fun... N yes..my film with S.Vytla has been officially launched:)need all ur blessings:) There's so much of wisdom.. so much to learn from people like him:) Met satish babu the proud owner of univercell after a long time:)its always a pleasure talkin to such inspirational people:) Met d univercell winners 2day at tajkrishna:)loved d spirit n enthusiasm of allpresent:):)hada gr8 time:) Shooting again tomorrow..will keep u posted:)good night u all:) Felt like disconnectin from d outside world...d month long pune schedule took its toll on me..feelin much better:)how u guys doin? My deepest condolences to kota garu..its d saddest thing that can happen to anyone...prayin 4 him n his family... 5 more days n its a wrap for d talkie portion:):) Shootin starts tomorrow..rested all of 2day..no place like Home:):) Stunnin visuals..mind blowin background score,outstandin photography..mani,rahman n santosh at their best... Saw raavan in pune..caught d morning 9am show!!yes yes..it was that early..wud do it only 4a mani rathnam film.. Back in hyderabad after 1long month..good2 b HOME:)nothin like it:):)4me its d best place in d world:) Finished d last 2 today:)d whole trip was very peaceful n divine:)n d sweetest was my son who was so comfortable thru it all:) Finished another 3:)all in all 6 over:)2more to go:)it was beautiful.... Gudnite people:)lookin 4ward 2 a beautiful day tomorrow:)will keep u posted!! My 2 followers:) http://twitpic.com/1wrowb Hotel staff profusely apologised n changed r suite!!water entering a room!!never happened 2me b4!!quite an evenin!! Btw really funny thing happened..came back 2 a flooded room!!yes yes d room was full of water!!!! Finally divine grace is shining on us..thanku God:):) Rainin cats n dogs here in pune..think the rain gods jus waited 4my climax to finish..:) 5 more temples to go:):) What a beautiful day it was:)3temples,loads of rain n the best DARSHAN:) :) Couldn't make it 4 d match.. shootin was 2hrs away from pune city..couldn't leave a crew of 200 waiting4me!! Gud mornin:)my religious trip starts:)heading to d temples.. Really kicked bout d kinda work I've done in dis film..come a long way as an actor... Back in hyd on 16th after completin d ashtavinayaks:)somethin I've gotta do:) Waitin 4 its release ..hopin that it breaks all records:):) keepin my fingers crossed.. Really kicked bout d kinda work I've done in dis film..come a long way as an actor... Like to thank my friend trivikram 4 designin a climax like this :)AWESOME is d word:) Prakash raaj was OUTSTANDING in d climax..becoz of wich I came up with 1 of my best performances ever:):) Really satisfied wid this schedule:)got sum stunnin work done:) Gud news guys!!Wrapped up d schedule a day b4:):)thanks to d efficient production team:) Monsoon has arrived in pune..hopin n prayin d weather stays clear 4 d next 2 days... Will keep u posted:)gudnite guys:):) Not able to spend time even with gautam:(by d time I'm back he's sleepin n wen I leave early in d mornings he's still sleepin:( My sincere apologies 4 not being regular with my tweets..schedule's been really demanding.. C kalyan r producer needs special mention:)the production team was outstandin:)everything went as per schedule:) Climax likely 2b wrapped up 14th:)with that an outstandin n awesum schedule comes to an end:) Looks like d climax shoot will get extended 4a few days more..not complainin..coz its rockin guys:):) Got an early mornin call 2morrow..gud nite 2 all:)with love:):) Sorry people..shooting goin on at break neck speed:)..lots of work..been really hectic..will b thru with d climax in 3days:) Havin an early dinner with him n off 2 bed:)catch u all later:) Yes..d climax shoot has begun:)met my dear friend prakash raj after a long time:)its always a pleasure working with him:):) Sum xciting news coming up:):)watch out 4 this space:):) Met my good friend n publicist anirban blah for dinner last night..discussed work..tied up sum loose ends... Restful day:)spent d whole day at d spa:)nice:):) 2morow is a day off:)the crew is regrouping b4 d climax starts..going 2 b hectic but lookin 4ward 2 it:) Saw kites! thought d movie was ok but hrithik was brilliant.. NANA,here's wishing you a very happy birthday n many more to come:)from me namrata n gautam:) Today I am what Iam becoz of my father.He's my inspiration n role model..Thanks DAD 4 everything:)love u as always:):). By d time my 1st film released I hada huge fan base:)its all thanks to my DAD:):) B4 I knew it I was a childstar:) This became a RITUAL guys:)several holidays passed n several films were canned:):) Beat this..he actually got me to act in his movies while v were holidaying...!! Used 2b a 2month vacation:):)all of us had a real blast...those were d days:):) Back wen v were kids v used 2 celebrate his birthday every year in ooty:) 2morow is dad's birthday:)can't make it 4 his birthday lunch..wich is always a TREAT:) Had dinner at d O'hotel..twas nice...gudnite people:):) Was shooting on d busy roads of pune ..shooting a chase..canned some cool shots :)was a very challenging shoot 4 d crew:):) Hava gr8 day :):)lots of love:) Really happy n kicked bout d film:)can't wait 4it 2 hit the theatres:)just like u all :):) shoot is goin on as per schedule..got a lot of work done:) Gud mornin people:)from 2day shooting is in pune city..no more long drives for d next few days:):) Took my son 4 his 1st movie in a theatre..he was confused,scared n amused with d whole experience:) Was my day off:) absolute bliss:)slept in late:)woke up next to my son:)yes.. d wife n son r here with me:):) Good nite people:) Hectic schedule...jus got back... d drive back from d location to hotel is xhausting:( 2morow's an early call again.. Veturi is a LEGEND.Legends don't die.they always remain in our hearts.Thankyou SIR for giving me sum memorable songs in my career. The 1st fatal crash in a decade..pray n hope its d last..my heart goes out to all d passengers n their families:( On my way 2 d location...gotta shoot d whole night... That mans passion for d craft is UNREAL..can't wait 4 d film to start..I think we'll rock it..BIGTIME:):) 4 d 1st time there were no inhibitions between us:)r meetin was straight forward n honest:) Met up with him b4 comin 2pune after a really long time..spent a lot of time talkin..never really spent so much time with him b4. 4 all u people there's sum really good news:)looks like Rajamouli n Me r finally working together:)FINALLY :) Shooting nights from 2day for a few days..for all d people in pune I'm shooting in a place called saswad .. Gonna hit d sack..getting some good sleep here:):)gud nite people:):) Its a long drive back from location:( but hada gr8 day at work so it all seems worth it:) Late call:) just headin 2 d location..slept like a log:):) Was in pune like 5years ago..changed quite a bit since then but still has a charm of its own:) shoot went off really well:):) d crew gettin used to a new place n their people:)kinda like this place... Now lifes back 2 normal:)in d city:)totally at home.. In pune..gr8 weather..my phone was on d blink..no proper signals in d hotel we were at:(changed hotels:) hope this schedule ROCKS:):)wish us luck:) Not feelin so bad after all as my 2 followers join me ina week:):) Finished all I had2..Off 2 pune tomorrow..gonna miss home:( Pune is a 20day long outdoor..:) Lazzzzzy sunday:) Resting... Resting..jus a day more of  'HOME TIME' n then I'm off to pune.. Sorry people hada really busy day..meetings n discussions..will make up4 it tomorrow.hava gud nite:) sorry for my slow paced answers..not used to typing fast:)need to crack this one:)good night to all of you..lots of my love.. ok guys need to sign out..had a really nice time with all of you..im hoping you all did too.. @Hymaram devuda devuda from my film pokiri:)enjoyed doing it.... @mahi_eversmile hello:) @abhi1067 the opel was very much my 1st car and i still have it:) @alumalla why dude @pmarineni I think my strength as n actor is that I'm very honest in my performances:) @raj047 gautam is fine doin gr8 n my movie will b out this august:) @nimiksha hello there :) Films which worked gave me immense joy n d ones that didn't I learnt a lot from them:) None of my films dissapointed me actually.. @irina_av loved russia..jus 1word to describe it..stunning.. I'm truly sorry 4 d delay in my films.I assure u that ul c a lot more of me from now on:) @IamBrahma hello aunty all I can say is thanku for all ur love n blessings Even I'm quite fed up of graphics in action sequences..trivikrams film will hava lot of live action.. @venna_maheshfan hey there thanks for all ur love n support Havin a problem with the laptop shifted to my bb @priya_valluri the film with linguswami is still in discussion stage .nothing confirmed yet..will let ul know once it is.. @saikiranp_143 im an actor not a singer...besides i think i sing terribly:) sorry im late.im going to try n answer as many questions as i can..please excuse me if i cant reply to all... Hava lot of requests 2change d time for QnA so will keep it from 9-10pm tonite..:)hava gr8 day:) Met up with s.vytla after almost2months..gr8 progress on d script level..really excited..can't wait for it2start rolling:) Still feelin a bit under d weather..will try to do d QnA 14th evenin..will let u all know d time tomorrow..not feelin good:( Gonna call my friend trivikram n hava good laugh:) Hava bad cold n cough..d rain n dust has finally taken its toll .. Iv said this before am sayin it again please don't waste ur time readin GARBAGE.... This website is crying out loud for attention which I'm not gonna give this time:) Trivikram not directing my film is d funniest n most RIDICULOUS story iv ever heard.. Oops oops my bad ..its a baby boy:) family was playing pranks:)congrats 2my sis priya n her husband sudhir:):) i Lotsa visitors today on set ..wasa good feeling.. Surendra reddy visited me on set with his wedding invite..wishin him a very happy married life:) Shot for18hrs straight..finished 2scenes back to back..just got home!! Work starts really early 2morow again..gonna hit d snooze button..again..nite nite:) Got d much needed day off:)feelin totally rested..slept d whole day..absolute bliss!! the sons wondering what this is all about.... sum heavy rain showers...lots of lightenin!! shot at d aluminium factory 2day..4film units at d same venue!dat place is turnin out 2b another film studio!! Aus all set 2post an impressive score:( Work happenin ata brisk pace..tiring at d same time xhilarating!! 1lac+ ina day!!OMG..awesum:) Its old news I know..better late than never ..sachin on twitter!! gonna beat ashton kutcher in a jiffy!!welcome.. Finally wrapped up d action sequence ...turned out very well..really impressed!! He's gonna b an actor guys!!he's gonna b an actor:):) ...Which he did!!d co director gotta videocam n filmed d dude:) The wife n son visited me on set 2day:)waza pleasant surprise:) Hava couple of days off post 12th will surely do a QnA with ul.will let u know a day b4 this time:) Action episode xtended by a day.will wrap it up 4sure 2morow.was2 b my day off instead will b roughin it out in d rain:( @laxmandeepak im really sorry to hear about ur dad...i really dont know what to say... Happy dude.. http://twitpic.com/1kyvro Enjoyin.. http://twitpic.com/1kyvik Am uploadin a few pics of gautam's 1st \"gettin wet in d rain\" experience..he's a rockstar!! My dear n loyal fan Kanak was at d shoot d full day.saidwas gettin married later this mth.wana wish him aVery happy married life:) Feelin stiff stiff stiff.. with all d rain n action..just2days more to complete d episode!! Well done RAINA..lovely..INDIA is gonna rock 2nite:) Jus 1of his moods.. http://twitpic.com/1k8qiu My son in thinkin mode:) http://twitpic.com/1k8q11 Labour day holiday..At home..resting..watchin d match.. Heard a touchin story on d afghanistan team..its PURE FREE WILL which got em wher they r 2day.. All d best INDIA..get d cup back home:) Major disinfectin happenin guys..with tons of dettol..yuck... Hada word wit r producer c kalyan.he apologised 4 d goofup n said hed look in2 it seriously.. Tryin 2save a couple of  thousands they lost a couple of laks..really foolish stupid n ignorant.. Stalled shootin for 4hours till REAL water arrived!! Felt like shit n smelt like it also.. Instead of gettin a  regular water tanker 4a rain sequence they used water from a lake nearby!!smelly sewage stuff!! Sum wise guy from production decides 2save money n guess what they did!! U guys shud hear this..big production goof up on set 2day!! Gud morning..gettin ready to shoot a rain sequence..not complainin as d water will keep d temp.in check:) Mornin session blazin heat post noon really pleasant..overall hada reasonably gudday!! Feeling gud......gudnite guys... Been 7yrs since okkadu released guys n praises still comin in..what a film..thanks Guna.. He gives his heart n soul to a film....jus like me:) Btw seen 3 of his films..think he's a brilliant actor n d future of hindi cinema.. Thought twas really sweet of him..thanx a lot ranbir.. That was the message he sent me.. Sumbody arranged a show of okkadu for ranbir kapoor in bombay..he luvd d film n he thot my performance was brilliant n honest.. Hey guys I'm back..hada gr8 day at work..wot bout u all? Onmy way to d shoot..startin a new schedule.wish me luck.. gotta go guys ...hada gr8 time interactin with all of u..wasa lot of fun...definitely do it again.. soon....gud nite.. varudu was never the title for my film with trivikram...confusion sorted??? i dont pretend..im just being me...i think im a bit of both.... a good son and a super father... i love newzealand...my favourite spot on d planet..someday will own a home there..queenstown to b precise... MR.PERFECT will roll mid next year...will b a rocking  film..... my favourite co stars r trisha n anoushka..... i dont stay away from them... i just dont understand them....award functions i mean...... of course guna is a great director...theres no doubt about that....n has given me one of my landmark films...will never forget that.... mani rathnam yes thats true ....thats d car my wife gifted me on my birthday...what a surprise that was...:0) dont even know d spelling of it... so no POLITICS FOR ME... my favourite films r okkadu,atadhu,pokiri n murari...this is pretty much the order in which i like them... its d book dude the easy way to stop smoking ... my son will decide his destiny...i will support him in whatever he wants to do or to become.... @vamsi_69 HI DUDE how r u?i think this should make ur friends happy:0) ok lets have sumfun.how bout a Qn A?RIGHT NOW...il try to answer as many questions as i can..got about half an hour..LETS GO!! saw avatar again on blue ray..outstanding.in awe of it all over again... http://twitpic.com/1iuuse LUV THIS TWITTER!!! LATER.... n to all u people please dont waste ur time readin rubbish on these websites....im right here for all d info u need on ME. so guys at great andhra,THIS IS ALL I CAN SAY... \"PLEASE TAKE A CHILL PILL\":O) i would like 2 say this here that i owe it 2 all of U for waitin with me n loving me for these 2yrs..thanks a million guys..luv u Infact, This is d most XCITING phase of my career...never been more happier n satisfied... finalised some rocking projects...will update ul shortly bout them... sorry to dissapoint a FEW that think otherwise!!! jus to clear d air with all of u,these 2years have been really amazing for me..i think ive grown as an actor n as a human being.. just ONE word for it..AMUSING:) thanks to ul saw d link at great andhra....Hmmmm..... Thanx 4 d info guys.. my guys r at d store as v speak:) BTW has' avatar' bluray released in india yet??leme know. .need2 get my hands on that 1!! I like d QnA idea..soon after this hectic schedule..will keep u posted:)signin out.. I still feel his best is yet2 come n I truly hope its 4 1of MY films:) Mani sharma is an outstandin music director,a dear friend n also has given sum sensational music for my films.. Leme clarify AGAIN d film's up4 release in august n d title will b finalised shortly..ul will b d 1st 2kno:) Its ok..got enuf rest 2cope with it.... Another action episode to b filmed in dis blazin heat!! Jus got back from a stimulatin discussion with trivikram..shoot starts dayafter.. Its all over.:(congrats CSK its a well deserved win indeed!! Yes yes!!sachin is playin:)Off2 watch d match with family n friends!!c ya.. Jus saw rehman on tv think he's performin 2nite!!cool.. Want MI to rock 2nite!! Hope sachin's fit 2 play tonite!! Hava good sunday!!!best day of d week!!Recharge urselves!! Abit caught up in my own world...catch u later..hava gud nite:) Today d master is 37years YOUNG!! Wishing u a very happy birthday Sachin.. Off 2watch 2012 the movie on bluray!!wana know what d circus is all about...later.. He saw d future comin..now that's what I call greatness!! This 3D thing is d future guys..james cameron saw it all comin.. These r xcitin times vr livin in guys!technology's advancin so fast...that anything's possible!! 3Dmovies r cool..but 3D live cricket!! OMG!! Depth perception,score board poppin in front,twas asif ther was a hole in d tv..some unreal stuff!! Btw saw 3D coverage of last nites match at novotel..twas unbelievable!! :( Sad.... No stadiums 4me guys..prefer to watch it on tv!!luv d multi angles n replays :) All set 4todays match..hope its a cracker jack!! Got myself a  bb BOLD2..tryin 2get my fingers around it..nice toy.. Later guys:) Anyhow,keepin my loyalties aside I'd like to wish d DC team All d best 4 todays game:) Sorry guys please don't get me wrong..I'm a diehard sachin fan.. 1match away from d cup..way to go MI way2go!! Gettin ready2 watch d match guys...really xcited...its MI 4me all d way...keepin my fingers crossed:) a BIG THANKYOU to all the 20261 of you...its a new world out here n Im lovin it...thanks again guys....later.. love these short breaks i get ...catchin up on movies,spendin time with my son,readin ...totally rejuvenates me... gud mornin guys...hada nice meal at d westin last night..quite a cool hotel..cant wait for 2days match...will b quite xciting... Thanx a lot guys for all ur wishes.will surely convey them to her....c u later.. Oops!!actually its 2 of em!! ARR n MANI RATNAM..what a combo..just brilliant.. Btw did ul catch d 1st look of raavan? Thot twas outstandin..d genious is at work again..! Hada awesum day..on my way2 wish my mum a very happy birthday.. Still amused by this article..anyways hava gr8 day guys n catch ul later.. Gawd!what's d world coming 2!!Think its a whole load of rubbish..nothings gonna happen to r planet guys.. N here's d fun part,its up4sale aswell..u can book ur space for 50000usd n chidren half off n PETS R FREE!! Read a us co.is buildng n underground bunker with all d comforts to survive d end of d world.. Feelin nice n fresh today..gonna stay in..watch sum movies spend time with my son basically gonna hava chilled out day..wow.. Just about headin out to meet d family ..catch ul later..lotsa luv Congrats to DC on yesterdays win n making it to d semis..:)was well deserved.. Hey...how u guys doin?..iv been in bed allday...a bit under d weather.think d heat got2 me.feelin much better now though... watchin d DC match n catching up with an old friend over dinner...havent met up in a while...will  b good fun...later.. got4days off coz the crew is cannin a few scenes without Me!!!!will gear up 4 another action episode after d  break.... im finally HOME....horribly HOT again...finally finished the action sequence.....really kicked about it... Gud morning ..I'm off 2 work u guys hava gr8 day....c ul in d evening.. tomorrow 's an even earlier wake up call....so till then have a good night .. c u all tomorrow...signing off:0) wondering what brahmanandam n bharani r doing in an action episode????WAIT N WATCH:) Brahmanandam forcefully fed us food which came from his house....it was one AWESOME SPICY TELUGU MEAL..... these 2 r one of the most spontaneous n incredible actors ive ever come across..... Workd wit brahmanandam n bharani after a long gap.was truly amazin.. Jus luv d new docomo ads...can't stop laughin everytime I see em:) Sach' a fantastic win 4 MI..they r gonna win guys theyr gonna win!! Were tryin to wrap up an action sequence so its always abit hectic... Hey guys..thanx4 lookin out 4me..2day d weather wasn't so bad.infact twas quite pleasant.v even hada bit ofa drizzle there.. Gud mornin guys..off to another blazin day at work..ul hava gr8 1..c u guys in d evenin.. mood's a little off..laptops cellphones all going in OFF mode...sorry will make up for it 2morrow...love u all...good night... hello hello..hada very tiring day..the heat was unbearable.totally drained out..hope u guys coped with d weather better than me... Good mornin guys..heading off4 d shoot..catch u all in d evening..hava gr8 day..lotsa luv. totally at home in an airplane!! http://twitpic.com/1fs2gm http://twitpic.com/1fs22l jus before the dolphin show in singapore http://twitpic.com/1fs1qi http://twitpic.com/1fs0vz http://twitpic.com/1fs0j6 uploading some pics of my wife n son as promised :)hope u like em....till tomorrow..hava good night.. hes fascinated when d director calls START CAMERA' ACTION' N CUT.....think hes gonna be an actor:) wife n son visited me at d set round noon...son hada blast ...was totally comfortable in a film surrounding:) shot at d airport novotel hotel today..seein it for d 1st time..thot it was pretty cool... yes im back home..shoot was gr8 as always..sure ul hada gr8 day 2.. no fun in doing something already been done...Its a real HIGH to do something original..ATLEAST 4 ME... I can safely say that im 1of those actors whose never done a remake ...JUST CANT DO IT.... guys guys guys..i dont wana remake \"in pursuit of happiness\".IM JUS INSPIRED BY IT...btw, i never do remakes... Headin off2 work..c ul in d evenin..hava gr8 day till then I think iv opened up too much.will lead u in2 my life a little more,a little later...till then...gud night u all.. One day I'm gonna make a film jus like that with  Me n my Son.it will rock mine n ur world.Promise u that.. Btw hav  ul seen Will smith's.\" In pursuit of happiness?\"Jus luvd that film.. Tarun khiwal was d photographer...I call him BRILLIANCE:) A lot of u seem hav liked d photo on my home page..twas shot for my univercell ad campaign.. Ok..Ul r gonna luv this..prem rakshit is doing a couple of songs for trivikram,s film...jumping with joy??I can almost feel it:) Anushka is d only female lead in d movie... Enjoyed my afternoon..totally charged4 tomorrow's shoot.. Headin off to d gym catch ul later...hava gr8 day:) Anushka's 1of d most comfortable actor's iv workd wit.she's totally grounded n chilled out.v get along really well.. This ones a stress buster..1of d most transformational books iv ever read.. Hav u guys read this book called A New Earth,by Eckhart Tolle?its  a spiritual classic n MY all time favourite:) Guuuud mornin.woke up nice n late..how u guys doin? Really tired..can't keep my eyes open..catch ul tomorrow.gudnite guys.luv u all. Will try to upload sum pics of d wife n son 2morow... Hav an unxpected day off 2morrow:)not complainin..cud do with some airconditionin N playtime with my son.. Yes,Samantha is d girl in my next film thought she was outstandin in YMC... Leme clarify 1nce n4 all..I'm not on facebook.I'm on twitter @urstrulymahesh Like I said d films out in august..lookin forward to it as much as u'l r...can't wait:) Missed d MI win!! They really r playin well....rnt they?? Name 4 d film not yet decided..v r workin on it..gotta go guys..catch ul later after packup! Finished d mornin shift.rushed home4 a quik bite n headin bak 2 a neu location..BUSY BUSY DAY!! Gud mornin.headin off2 work.will catch up wen I'm back.enjoy ur day.. Son's sleepin...wife n I r sneakin out for an early dinner:)C ul later..... Been a week since I joined twitter n more than 10000 followers!WOW..Am really touched..thanks a lot for all ur love.. Luv ul 2.. Yes yes yes ...watchin d match n tweetin frm my bberry..oops ross taylor dropped a dolly... When I say error I mean.concentration levels can really go 4 a toss in xtrme conditions my friend... Shot a scene with ALI today,met him after really long...that dude is one funny guy..Had me in splits. Coz,D audience don't really care in what conditions u shoot..they always want d best... There's no error here only PERFECTION.. Hey guys?I'm back.another blazzzing day at work.couldn't keep d sweat from dripping of my face..still managed to look good though:) Gud morning..heading off 4 work.starting another imp.schedule..will update u as I'm done.hava gr8 day u all.. Another early day,shoot starts 2morw.wil update u wen I'm back.gudnite guys.love u all. What did I tell ul... The god is at it again.. Sach a pleasure What did I tell u...the GOD is at it again.. Enjoying my sunday with my family guys.....catch you'll later....love u all.. i would also like to thank the whole THUMBS UP team..AMIT,SAI,SHREEKUMAR,.These guys make it all happen..LUV THIS BRAND... the latest Thumbs up ad is 1of my FAVOURITES 2...its directed by my good friend n hotshot international ad film director,FAROUK ALJOFFERY.. @RanaDaggubati hey rana thanks a lot ..will catch up soon..hows your hindi film coming along?all d best..n congrats for Leader. my next is with sreenu vytla. will start rolling in june...really happy with the script ...looking forward to it...WISH ME LUCK... Btw please think of something FRESH..n NOT the titles which r already circulating on the net.... havent decided on the title of my film with Trivikram yet..leme know if you'll think of anything..U NEVER KNOW..:) congrats to Charan,Rajamouli,Mr.Allu arvind n the whole team of magadheera.way to go guys... yes i watched magadheera.Mr.Allu Arvind arranged a show for me last month..thought it was awesome.. one of the better films iv seen... thanks a lot u guys for finding my son so adorable....u guys r really sweet ..will try to let him know what ul think about him..:) Good morning guys,nothing like a good night sleep.got a straight 12hours..totally rested.. Enjoying my break....trying to finish the 1st season of 30ROCK..This stuff's really funny n addictive..catch u later..:) havent signed any new commercial guys.. will surely let u know once I do.. No points for guessing Y coz THE GOD IS PLAYING AT HIS BEST!! simply love watching Him play.... jus saw d match..DC is FINALLY getting it rite:)Hava strange feeling MI is gonna take the cup home though... off to watch the highly rated tv show 30ROCK.. will b back soon..love u guys..... very impressed with Yash Bhatt..r new DOP..compliments Trivikram very well..its all looking good guys..... shooting happening ata brisk pace....quite hectic but loving it.. just saw the 3d views of the gym in my new house..they r awesome.wife doing a gr8 job on the interiors..cant wait to move in... http://twitpic.com/1ehiuf - one of my favourites... http://twitpic.com/1ehgnu - his first at a beach resort.. http://twitpic.com/1e8fbc - http://twitpic.com/1e8bdj - http://twitpic.com/1e8bax - http://twitpic.com/1e8b4p - uploading a few pics of Gautam.leme know what u think of them....ENJOY..... read somewhere my director friend PURI JAGAN is doing a film with my favourite MR.BACHCHAN..way to go sir.... hello people...heading to RFC for a 2pm shift..gonna be back really late..whats up with d weather these days...hot hot hot... gotto guys ....feel like a zombie in front of this laptop..never sat on it this late..zzzzzzzzzzzzzzzzz sorry almost passed out.. finding some cool pics of my son to upload...will do it soon... lots of ppl wondering y im on twitter.SIMPLE..ITS A GR8 WAY TO INTERACT  WITH PEOPLE WHO LOVE ME .. came home to my sleeping son..shocked to c his new hairdo.wife buzzed his hair off coz its summer..LOOKS LIKE A BABY MARINE.:) besides, dont carry my phone to shoots,just a policy..keeps my focus going.sorry NO TWEETING WHILE SHOOTING... just got back home guys.finished shooting a very imp.scene.shaped up really well.totally kicked bout it.:) will keep u updated ..gotto go.have to b up at 5am.thanks once again for your sweet tweets ..Love u guys.. Preparing for yet another important scene tomorrow.wish me luck guys.. @actorSUMANTH yes yes yes its Me..pinch urself sumantha its real..will catch up when my schedules done...ur reclusive pal:) @actor_siddharth btw heard very good things bout ur film,that dude..bablu is very talented..all d best man.. @actor_siddharth hey sid  thanks for a really warm welcome.im quite enjoying it here..lets catch up when ur done with ur nite shoots.. Gotta go guys...The son's back from school...t'was gr8 interacting with you all..catch you'll later.loads of love,mahesh languages spoken by gautam r telugu,marathi,english n hindi...hes a ROCKSTAR...:) since u all wana know bout my son hes almost4yrs old, speaks 4languages n  is the LOVE of my life. just so u know trivikram n i never hada problem n never will.he's one of my closest friends... @geneliad hey genelia thanks for a warm welcome.thought you were gr8 in jaane tu...all d best 4ur future projects.lotsa love,Mahesh to all u smokers out there wana know how i did it?get ur hands on a book cald D EASY WAY TO STOP SMOKING BY ALLEN CARR.magical stuff... btw today its been exactly a year since i quit smoking BRAVO to me.... hello guys..im back after a gruelling session at d gym. Reading ur tweets.:) just to let you know i read all tweets. the films up for release in august.for now going to enjoy some quality time with my son..loadsa luv thanks for all your support guys.really touched....should have done this a long time ago.. action director duo raam laxman, needs special mention totally twins same hairdo,same clothes and energised.came up with super coolstuff. finally finally started shooting at a brisk pace ....havent done night shoots in a while ..did a cool action interval episode.wait n watch glad to be here seems like a cool way to interact with you guys so upclose!!!!!"}