{"tweets": "@mont_adrien Que arte shurmano. gg RT @mont_adrien: Volvi! Y les traigo un Fanart fresco chavales\nNota: el fondo dice ninoninoni ninoninoni jajaja\n@Rubiu5 como siempre, Guapo… No juego mucho al LoL ultimamente pero los campeonatos me flipan. Go G2 &lt;3 No habeis pensado que todavia no ha venido ninguna persona del futuro por que no hay futuro y estamos extintos? RT @Chokokoa22: He aquí la ficha de la skin del Raviol (En maincrah) Also FELICIDADES POR LOS 10K DE SUBS EN TWITCH\n@Rubiu5\n.\nEs simple per… DALE PAPÁ, BAJÁ A BOT LANE WACHO HASÉ UN DIVE EN LA TORRE ENEMIGA CAGÓN AGUANTE BOCAAAA LA CONCHA DE LA MADRE https://t.co/H4m63ogSbg @Luispubgmobile @gorillaz si, voy a salir de fondo tocando esto https://t.co/1VU7AiqKhZ nueva foto de perfil https://t.co/SPqnBGO7Rd @ImCesarz 10/10 RT @ImCesarz: RUBIUS (Joker Trailer) Karmaland\n#Karmaland @Rubiu5 https://t.co/1p700udJO4 Señor Obama, esta noche tu y yo, en la cama... No se, piensatelo. https://t.co/NH1xU3ItZf RT @All_of_Saku: #Karmaland \n⚔️Warriors of Karmaland⚔️\nEsto iba a tener más cosas pero mi mano no podía más jaj :( https://t.co/05vus1kq6C @bysTaXx te lo vendo si quieres jejeje @ChessFN True. Pero a lo mejor las mecanicas de construcción no serán tan importantes como antes 🤔 ya veremos Acabo de ver el trailer filtrado de Fortnite 2 y... No se ve a nadie construyendo. Ahi lo dejo. @Felipez360 gg Codigo Rubiuh en la tienda de Fortnite 2 (con h final) Emmm, @FortniteGame acaba de borrar todos sus tweets. wtf esta pasando QUE COJONES ESTA PASANDO https://t.co/hcdKGjPR48 Hoy sale Fortnite 2. \n\nNo se que pasará pero creo que va a ser uno de los eventos in-game mas grandes de la historia. Gamers en pie.\n\nVamos a verlo en directo https://t.co/BBBQe2rAot https://t.co/0uJHERSAz6 Nah, no puedo acceder de ninguna manera lul. Seguimos otro dia si eso :) Me acaban de banear. F en el chat chavales https://t.co/hP5FFZzIwc Empiezo la caza de talentos. Meteros en Omegle, y en intereses poneis \"elrubius\". Enseñadme vuestro talento unico/raro/inutil. Teneis solo 1 minuto. Si no vais a enseñar nada skippeare al siguiente. GO GO GO https://t.co/l6JZtaqXOL @LVPibai Siempre estaré orgulloso de este chiste (del que nadie se rió) https://t.co/JRcDeN57li Mañana voy a grabar otro video de \"buscando talento en Omegle/Chatroulette\". Os dejo el video por si os habeis olvidado. Preparad vuestros talentos unicos. Mañana nos vemos💀https://t.co/h1dtiuwxrq JAJAJAJAJA https://t.co/n3pbSn29a3 @LolitaAldea eres la mejor @auronplay nos veremos delante de un juez. un saludo y buenas noches. @auronplay borra este twitt ahora mismo. Eso es una imagen de mi hijo y no quiero que sea difundada de esta manera por las redes. Si no lo haces en menos de 24 horas te pondré una denuncia. RT @auronplay: ¿alguien ha visto a este sujeto? de ser así por favor avisa a las autoridades es calvo y muy peligroso gracias https://t.co/… @mangelrogel Perdona, no me comunico con seres con una inteligencia inferior a la mia Auronplay es una rata calva toxica. Nuevo video de momentos divertidos en Apex con el trio calavera! 🔥 https://t.co/ZnqHfajaAa #ad #apexlegends @PlayApex Voy a estar jugando a la nueva temporada de Apex con @auronplay y Lolo. Si ganamos alguna regalare subs 👀 HYPE por el nuevo mapa https://t.co/BBBQe2rAot @playapex #ad #apexlegends https://t.co/C6Xkqvd3BC @nalu12342 Es un pollo A todos los que me están diciendo que es un ganso y no un pato les metía un puñetazo ahora mismo Nuevo video chavales. Os traigo el JUEGO DEL AÑO. El pato cabrón https://t.co/GMvir0XA94 Cuack y RT RT @Nanellewang: Hoy de fiesta sonó \"Torero\" de Chayanne, y me sentí de lo más friki e inútil al darme cuenta de que solo me sabía la versi… @Fernanfloo duchate fernan Kimetsu no Yaiba Hace mucho que no veo un anime que me enganche. Que me recomendais? @Beto19Avila @DjMaRiiO_90 @PlayStationES @TheGrefgYT @WillyrexYT pero ese no era chileno? @DjMaRiiO_90 @PlayStationES @TheGrefgYT @WillyrexYT Pero que dices, si abrir sobres se me da de puta madre @Srcheeto Tus muertos No quiero seguir viviendo en este planeta https://t.co/sVgAzuzWlV @DjMaRiiO_90 Tuuu que me ha tocado Keylor tu RT @WmG4T0mW: Gente de Twitter e aquí el mejor video de 2019 by @Rubiu5 \n#WeLoveAntonio\nhttps://t.co/2lkw2aE1bc RT @latostadasexy: El ultimo video de @Rubiu5 es el mejor video que he visto desde 2015, corred a descargarlo antes de que youtube lo borre Dadle todos las gracias a @aLexBY11 por dejarnos destrozar su casa grabando el video ESCAPANDO DEL AREA 51\n\nhttps://t.co/hBIZxN6pme A Youtube no le va a gustar el video que voy a subir hoy Mañana subiré lo que será mi video favorito de los ultimos años Ha llegado el dia. Hoy matamos al Dragon del Ender. Creo que estoy preparado https://t.co/BBBQe2rAot @dearhoIIand joder Con esto matas a Thanos de una hostia https://t.co/Q2jbCO0Fe9 @AngyeFdez \"esa pregunta me ofende\" https://t.co/NNkr4bY0pH Esto es un Manul de Mongolia. Acabo de enterarme de su existencia. Quiero darle un abrazo https://t.co/WHVfuQjyD1 Joder esto es lo mas triste que he visto esta semana. No abandoneis a vuestros perros https://t.co/pZjqbGdK4H @SamaelSO @2KEspana Paw Paw Unboxing Masivo de #Borderlands3 https://t.co/0ksF0L4qZP Atentos al sorteazo de @2KEspana ☠️ Ni no ni https://t.co/IXCXBBHtNG RT @VGarcy: Wilson no está gordo, simplemente se está preparando para su papel en el live-action de Shrek. @Rubiu5 https://t.co/JCFnEmCNf5 Nuevo video! :D Mis gatos conocen por primera vez a un PERRO. No me esperaba esa reacción de Wilson lmao https://t.co/qUkvxNQXGd RT&lt;3 Cerebro, me escuchas? Eres un pesado macho, deja de sobrepensarlo todo o me lio a hostias contigo, 1 pa 1 sin camiseta a puños en la parada del bus A veces me arrepiento de no haber subido la serie de Minecraft a mi canal principal. Aunque si lo hubiera hecho, a la larga me hubiera rallado seguramente Gamers en pié, he subido un nuevo video.\nSubs Mandan Videos Denigrantes #4 \n\nhttps://t.co/4oS8bWhaYJ\n\nRT si te sientes ESKELER hoy @rubenlykkelig @CharlesRuiz124 facts @EriickGames23 &lt;Exaltado Con Tu Hermana&gt; Me acaba de llegar un email de Blizzard. Me han quitado el nombre de mi hermandad en el WoW por ser \"inapropiado\". 2019 lmao. Escucho sugerencias para el nuevo nombre de nuestra gloriosa hermandad https://t.co/tw9CyQYS10 Empiezo stream bois. Maincruft y luego wowete https://t.co/BBBQe2rAot Que vuelva el WoW es como que vuelva tu padre a casa despues de 15 años cuando dijo que se fue a por tabaco 60 Millones de mineros han encontrado su diamante &lt;3 https://t.co/qjnaRcw41S RT @LolitaAldea: Una ilustración para celebrar el anuncio de la segunda temporada de Virtual Hero. Ya estoy deseando ver cómo todo se mueve… RT @VirtualHero: 2020.\n\n#VirtualHeroLaSerie @MovistarPlus https://t.co/SZjmdODdTw w̷a̷k̴e̶ ̴u̵p̷\n\n#VirtualHeroLaSerie https://t.co/EP8RScgRbM Poned un servidor español YA. No se a que estais esperando cracks @Warcraft @Warcraft_ES @BlizzardCSEU_ES https://t.co/qXvwxMyZOq Pues creo que hemos sido los primeros del mundo en matar a Hogger, el primer mini-boss del WoW, gg. Españita mi tierra, nunca falla. Que locura volver a estar jugando a esto otra vez despues de 12 años &lt;3 #WoWClassic https://t.co/8MFdPmzqCt Hoy va a ser un dia legendario. Empezamos stream esperando al WoW Classic. Tantos años de espera han merecido la pena https://t.co/BBBQe2rAot DIOS GAMER vuelve a Happy Wheels https://t.co/g7cfGbFqmZ n̶o̷ ̵t̷e̶ ̵f̵i̵e̷s̴ ̶d̵e̴ ̵e̷l̴l̸a̵ https://t.co/NrKkwOzBpK @auronplay https://t.co/TwIMd5YjOp @auronplay si es de los creadores de la serie, va a ser la hostia. Aunque me da que Heisenbeeg saldrá mu poco :( RT @mangelrogel: Ha dicho ”SI” 💍 https://t.co/wEBNHcQjfc Me voy unos dias con la familia, pero subiré un par de videos de Minecraft y volvere para cuando salga el WoW Classic asi que todo bien todo correcto. Nos vemos pronto &lt;3 Vamos a terminar de ver la conferencia de la Gamescom y luego Maincra :) https://t.co/BBBQe2rAot @nachoMoL Ci Este video es la hostia https://t.co/l1SBNnN3B1 @LOLiTOFDEZ Estoy aprendiendo a hacer 90s en Minecraft. Cuando lo consiga, vete despidiendote ☠️ Este mes mi canal de Twitch está en el Top 10 de canales mas populares del mundo y #1 en Españita mi tierra. Esto de stremear me ha ayudado un monton con mis rayadas mentales y vuelvo a sentirme como \"yo\" otra vez, asi que gracias por el apoyo &lt;3 El Memecraft. Nuevo video en mi canal\n\nhttps://t.co/ozmzeZ2qZg\n\nDisfrutad &lt;3 https://t.co/7l9IlF7A8j Se viene Por fin han metido solos en el Apex asi que vamos a darle calor all night. Si no gano ninguna regalo 100 subs lmao #SponsoredByApex https://t.co/BBBQe2rAot @Yaxs58075744 wtf, si ayer pusieron en el foro que iba a ser Golemagg no? @Sarai_2504 @frivluscientist @SangsterArya True. No es la primera vez que me pasa jaja Hombre en gasolinera: Hostias elrubius! Una foto no? ERES MI FAN NUMERO UNO.\n\nYo: Si jeje, llevo viendo todos tus videos desde el principio.\n\nHombre: *en silencio* No ha pillado la broma. Hace la foto.\n\nNos vamos cada uno con una sonrisa incomoda. RT @VirtualHero: SYSTEM/ NOTICIÓN. ¡#VirtualHeroLaSerie ha sido nominada a los Content Innovation Awards de @TBImagazine en la categoría de… \"estoy teniendo una suerte que no es normal\" https://t.co/CERIVoXlyr @otakulihao LUL quien me iba a decir a mi que Minecraft me haria tan feliz en 2019 Munucruft https://t.co/BBBQe2rAot Acabo de ver Midsommar y no se por que tanto revuelo con esta pelicula. Cuando visito a mi familia de Noruega hacemos cosas parecidas @rubiushinso wtf Al final con todas las preguntas que me habeis hecho he decidido hacer un 50 COSAS SOBRE MI version 2019 lmao. Literalmente estamos volviendo a 2013 chavales https://t.co/A1UIeOSUHM RT @Jorgemartel11: @Rubiu5 . https://t.co/eN59cPppQ3 Vamos a hacer un Pregunta Rubius, que han pasado eones desde el ultimo. Usad #PreguntaRubius y mandadme preguntas, retos y esas cosas frescas 🗿 El capitulo mas triste de Minecraft \n\n💔\n\nhttps://t.co/u5BrORCHXF @Sofiaypatrick Nice ^^ gracias! empiezo stream bitches https://t.co/BBBQe2rAot https://t.co/noWGnVIUpG https://t.co/18eYWbemie @Kqrdu Me flipa, gg @Asui7u7 Me flipa la iluminacion! GG que cojones https://t.co/NyeEQ3ADh7 @eIrabos Esa pagina está nice, pero para hacer cosas especificas es un poco gñé, pero me viene bien de momento. Thx! @ivandooblef contratado Si en la granja poneis a los cerdos copulando entre ellos, 10/10 @guapisimodegio Yepp, a eso me referia Mandadme una prueba que incluya:\n\n- Mi Personaje\n- Granja con muchos cerdos\n- Fondo de MC de dia\n\no\n\n- Mi personaje en barca con Ricardo\n- Agua\n- Monstruos/zombies en el agua intentando atacarnos\n\nMandadmelo con #MinecraftRubius. Los dineros se hablarán en privado Estoy buscando contratar a alguien que me haga miniaturas pro para los videos de minecraft. Mejor si es alguien que sabe de 3D para poner distintas poses a mi personaje. ya estoy en casita. creo que voy a tener el horario jodido toda la semana fml 13 años. Argentino. Acaba de ganar 900.000$. Eso da para 900.000 choripanes... por lo menos. GG bestia, a seguir triunfando @k1nGOD https://t.co/cjrHTPaqwi @ZahidRincon &lt;3 Hay un chaval argentino de 13 años reventando en las mundiales de Fortnite ahora mismo y estamos todos fangirleando con el. VAMOS KING Esto es lo que pasa basicamente cada vez que intento adoptar un cerdo en Minecraft https://t.co/jQgP1YDuVd true story https://t.co/qYvCTmbuLM @MrKeroro10 Pollos Team Best Team Este equipo está destinado a ganar. Bentz0r es Noruego, Keroro es Español y Ryan de Detroit. Juntos tenemos +70 de sinergia 🔥 #FortniteWorldCup https://t.co/ua7zlsE7s1 He llegado ya a NY para las mundiales de Fortnite! Mañana jugamos en el torneo Creativo, hay $3 millones en juego. si ganamos os compro algo, que quereis? 🗿 @liviapereez lmao puedes desactivar el chat con la flechita que hay arriba Ultimo directo de Minecruft antes de irme a NY! TsssssssSSSSSssssss BOOM https://t.co/BBBQe2rAot RT @Rubiu5: ya puedo morir tranquilo https://t.co/6aDcJyPAIW ya puedo morir tranquilo https://t.co/6aDcJyPAIW Nuevo video UwU Jugando a los mapas infernales de mis suscriptores, y probando el mapa MAS DIFICIL de Luigi Maker 2 https://t.co/beCKqHT7Il Like y PRRRING Top 10 best anime fights https://t.co/sUUYeu1hZE Robot Mamadisimo VS Monstruo. Empieza el evento mas grande de la historia de Fornait #TeamMonster https://t.co/BBBQe2rAot @claralukika brutal O_O RT @claralukika: FELICIDADES POR LA NUEVA MERCH @Rubiu5 💕🤗\n.\nMe sentí inspirada al ver la foto de su instagram y se me fue de las manos ✨😂… Si hay que ser minero, romper el pico en el hierro, no importa el creeper que venga pa'que sepas que te quiero Jugador de 2 IQ y Juan Carlos el cerdo siguen sus aventuras en Minecraft https://t.co/BBBQe2rAot RT @mont_adrien: (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧ @Rubiu5  ✧ﾟ･: *ヽ(◕ヮ◕ヽ)\nBesto Waifu, Felicidades por la nueva merch!! 💛✨\n\n[@Rubiustfanart &amp; @Rubiu5 ]\nInsta: A… RT @MahiStuff: Las pelirosas que matan otakus culiaos son mi tipo de waifu, felicidades por la merch &lt;3 @Rubiu5 https://t.co/gyr7ZHJC2g @lokuluxk La demanda está siendo muy alta, pronto haremos restock :( Por petición popular, ya he puesto también a la venta Agua de baño de Chico Gamer a la tienda. Creo que el precio que le he puesto es justo. Podeis comprarlo aqui: https://t.co/yMb2FEQyMG https://t.co/ca5IObUC6J he pasado una foto por el filtro de viejo 6 veces seguidas uff https://t.co/tScKLWR26a @iriviuss Maricarmen no seas mala RT @iriviuss: https://t.co/hoGwWkyMUR PD: con lo de “merch en condiciones” me refiero a merch de ropa diseñada por mi, que parece que me este cagando en todas las colaboraciones que he hecho antes lmao (las camisetas de VH, gafas, etc que están muy frescas tb) @theDARTHpiterin mis abogados me recomendaron que no lo hiciera Llevo como 7 años en Youtube y nunca habia sacado merch en condiciones. Hoy cambia la cosa. Durante 1 semana venderé mi agua de bañ... Digo, venderé mi primera ropa de la coleccion Anti Otaku Otaku Club. La calidad es 10/10 y está hecho con mucho amor &lt;3 https://t.co/gKlxGq5byO https://t.co/g5qVPjmmqI https://t.co/FLGkep94CY @smdani Gracias bro no, gracias al señor. RT @mattycardarople: @Rubiu5 Ha! I’d love to meet ya man. U live in LA? Dm me. RT @mercurydoblas: @Rubiu5 https://t.co/2c04IfmSWy @auronplay a mi no me llames cochino, marrano NUEVO VIDEO 💦 AGUA DE CHICA GAMER 🎮 Bienvenidos a un nuevo infierno https://t.co/9nDKdCxV2J Like y RT &lt;3 Mañana subiré un video fresquisimo. Y puede que en un rato me ponga a hacer stream. Todo bien todo correcto @mattycardarople guapo Vamos a hacer LA PURGA en mi canal. Banearé a la gente que gane en las bolitas. NO es obligatorio participar, pero si lo haceis... prepararos para decir adios ☠️ https://t.co/BBBQe2rAot RT @RUBIUSMAFlA: 🎬| El susto del siglo by @Rubiu5 \n\nDirecto: 09.07.19\nhttps://t.co/Pdepe48fZ0 https://t.co/JRTT8kUzNK elrubiusOMG en Latín https://t.co/MuSFQXSdWu @ArcticMoar Estoy teniendo mazo de problemas con esta camara y la pantalla de mi PC. Volvere a la antigua para YT y dejare esta para los streams por que no es normal el putiferio de colores que hay en mi cara cada vez que cambia lo que sale en pantalla lmao Vuelven los traumas. Vuelve la ansiedad. Vuelven las ganas de pegarme un tiro en el pene. Vuelve  ̶M̶a̶r̶i̶o̶ Luigi Maker 2 &lt;3 https://t.co/3EaOM0HapM Laik y erreté RT @vegetta777: Joer que risa! @WillyrexYT  2 horas para atreverse a gritarlo! https://t.co/tU9iLHPmWx llevo 2 minutos en la boda y ya estoy borracho Acabamos de llegar y ya está siendo la mejor boda a la que he ido en mi vida. Felicidades guapos @LuzuGames @HelloImLana https://t.co/VjGROBOCF8 @VirtualHero @Bershka ahi ya te has pasado @VirtualHero @Bershka ya me jodería ser un gato como tu y no poder ponermelas @Guzman_Saul @VirtualHero @Bershka F @VirtualHero @Bershka Ay mamá RT @VirtualHero: SYSTEM/ FRESH AF 🔥 https://t.co/mdkPjf0VoM no empecemos con esto otra vez por favor https://t.co/UvOjvGDSxX F https://t.co/Lrz05BW5Oo @auronplay @FamousWarBot ... @LOLiTOFDEZ Tsssh, tu no usabas a los shurmanos Del Vacio, esta es una build totalmente nueva y unica Kappa Not Kappa @not0taku meperd0n as¿ 3 partidas ganadas seguidas hoy, y se han regalado como 400 subs en mi canal. Esta build del TFT esta rota y tengo una comunidad muy bonita &lt;3 buenah noshe https://t.co/ySUAHA39ou Esta es la unica manera que tengo de ver vuestras menciones lmao https://t.co/2O33d1uQGg @Mizy_Alvarez @Twitter @TwitterEspana this is so sad @darkkjellberg @Twitter @TwitterEspana También Eyyy @Twitter @TwitterEspana seria la hostia que me arreglarais esto ya por que llevo como 3 años sin poder ver las menciones. Un saludo muy cordial y que dios os bendiga 🗿 https://t.co/iLfJNwlp0N @MaryMewt @VirtualHero ╰(◡‿◡✿╰) Vamos a probar el Mario Maker 2, no quiero ragear https://t.co/BBBQe2rAot Nuevo video! Rubius abusando de Rubius en el Juego de Rubius basado en la serie de Rubius protagonizada por Rubius https://t.co/paHzEQ9W8w Like y RT&lt;3 @FCBarcelona_cat mi tio que toca la gaita no os pasa que cuando sois muy felices a la vez estais pensando que en unos dias no estareis tan felices y eso hace que nunca disfruteis del todo cuando estais felices? https://t.co/fPDtnNX05U @mocos0 (~￣▽￣)~ @auronplay @esperanzagracia que el señor te bendiga @doubtrubius O‿O Jugador de 2IQ ganara todas las partidas del TFT hoy. Empethanos: https://t.co/BBBQe2rAot @Felipez360 estoy pensandome hasta volver al juego normal y todo SACAME DE AQUI https://t.co/LQzu7uaZEx bruh https://t.co/lkDsTGqruV @TheCatacroquer nobles all the way Tengo un vicio muy serio al TFT, ya le estoy pillando el truco. Esta noche hago stream 🗿 @xKogarashi @lol_es @ZeIing @RevenPedruski @ernesbarbeq @G4G_Revenant @Th3AntonioGG Ojala me hubieran pagado https://t.co/MFsa2wDD1M Voy a probar el TFT en directo. Hace como 80 años que no toco el LoL asi que necesitare vuestra ayuda chat https://t.co/BBBQe2rAot Que pena lo de Etika. Me encantaban sus streams y reacciones :( Descansa en paz hermano. #JOYCONBOYZ empieso stream, no mames wey pinche pendejo. Simulador de cocinero and stuff https://t.co/BBBQe2rAot Uffffff que culazo https://t.co/whtWck4Ied @moarbangtan Efisima En este torneo he matado a Lolito. Estaba en mi equipo, pero le he matado. Sigue contando RT @LOLiTOFDEZ: Atentos al streaming del #StarsBattleRoyale que hoy se viene la bomba 💣 \n\nhttps://t.co/xKVm2Jpbt5 esto se puede sacar de contexto https://t.co/cPfnx2eWfm @auronplay MARSHMELLO....... ES GAY RT @auronplay: 🔥 ¡¡NUEVO VÍDEO!! 🔥\n\nHoy os traigo el Whisper Challenge... con Rubius.\n\nhttps://t.co/Ryt9a41WEm @polispol @auronplay Artista! Chavales, HA LLEGADO EL DIA. Nuevo video, mi primera colaboración cristiana con @auronplay DADLE CALOR https://t.co/MWlNkVDLPH Like y RT&lt;2 esta foto de Keanu corriendo te dará 100 años mas de vida https://t.co/pS47Rm0qka cantando La Macarena con extranjeros https://t.co/neE3nLldlc alguien me explica por qué un japonés me esta rellenando el paquete con cerveza ??? https://t.co/aTf6LOXOKA @Gamergy vamoooooh @elonmusk best waifu Os dejo en Rubius Z un video del nuevo Ghost Recon. AVISO: Graficos Orgasmicos inside: https://t.co/7jYukUaecR Estoy solo con Mangel en las calles de LA. A lo mejor vamos al zoo LUL. Empezamos tercer stream IRL https://t.co/BBBQe2Jbg1 halluda https://t.co/RStCHi34RE @Luiscor97 no @auronplay YA NO ESCUCHO RISAS :) LETS GO! Vamos a reventar al equipo de cara-almendras de @auronplay en el Roller Champions https://t.co/BBBQe2Jbg1 Vuelvo en 10 min que estoy en una habitacion con hinibidores que me joden el 3G oof Empiezo segundo stream en la vida real https://t.co/BBBQe2Jbg1 @NintendoAmerica AAASFMXXHBDNENgwbdehv After doing some research, we’ve found out the 3rd place belongs to Bentz0r. gg dude https://t.co/2RqECExhWH E3 bois https://t.co/KyhknFQlpR @Alba40046147 La magia de tener un canal secundario ( ͡° ͜ʖ ͡°) Aqui os dejo los ganadores del mapa de Fortnite x Rubius 🔥 GG a todos.\n\nHere are the winners of Fortnite’s Fifth Creative Trial. GG all &lt;3\n\nhttps://t.co/K34zebrCP4 He estado a 100 metros de Keanu Reeves. He notado su energia de polla grande en mi cuerpo y me ha dado 10 años mas de vida. @pilarbm1127 Lo voy a intentar pero tengo miedo de que pase lo mismo D: aunque habrá menos gente Dibujo de un stream sniper en LA :) https://t.co/t8Gyk53qju No puedo hacer streaming ahora mismo, luego os digo. De todas formas me alegro de que todo haya funcionado bien en el primer directo IRL🗿👌 Todo dios está con el 3G en la conferencia de Xbox asi que no podré stremearla :( volveré cuando acabe Estoy en directo en mitad de la calle. A ver si funciona. Vamos a estar por el E3 con los bois. https://t.co/Pj4PaH2IWk gogogo @DashieXP I’ll DM you Ya estoy en LA para el E3 :D Estoy preparando la mochila de streams para hacer directos en la vida real en full HD, yendo a las conferencias, etc. Y si nos atracan, lo vereis en directo. Nice https://t.co/kJlk9SlqqE @NaaLoon Acento Amsterdameño supongo Ojala recuperes tu tarjeta, Preben. Estoy en el aeropuerto de Amsterdam y han llamado por altavoz a un tal “Ruben Gundersen” para que se acercara a la zona de objetos perdidos. He ido corriendo y resulta ser que se le ha perdido la tarjeta de crédito a un tio llamado “Preben Undersven” 🤦🏻 Hasta mañana no puedo decir nada mas. Tenemos que revisar todos los tiempos y comprobar que son legit. Pero estoy muy orgulloso &lt;3 Es oficial. Hay al menos 1 hispanohablante que se ha hecho record en mi mapa y se viene a Nueva York a por los 3 millones. GG RT @mangelrogel: https://t.co/yW1xfoKEcI @mangelrogel https://t.co/qtGU1G0xRX @Stickos8 friday ;) @shedka &lt;3 GAS 🔥 GAS 🔥 GAS https://t.co/D9qvMePpwm NO HAGAN ESTOS EXPERIMENTOS CIENTIFICOS EN SUS CASAS 🔥🔥🔥https://t.co/9VxsHPPkgB cientifikusOMG is back. Like y RT&lt;3 oh shit here we go again. \nEsta noche en mi canal:\n\n🔥👨‍🔬🔥 Yass, al final es el dia 7 a las 23:59 (hora española) https://t.co/afFGk64EFu @AaronDarlex ya vooooy, estaba grabando una cosa. En 30 min le doy sweet home alacama @loquiaventuras3 ci. Podreis seguir sufriendo 🗿 Thursday is the last day for you to send the video with your best time on my map. Remember:\n\n- Send it through the form that I left in the description of my video. \n- The bug where you leave the map / take the sword does not count\n- GLHF #RubiusTrials El jueves es el ultimo dia para que enviéis el video con vuestro mejor tiempo del mapa. Recordad:\n\n- Mandadlo a través del formulario que dejé en la descripción de mi video. SOLO CUENTA EL QUE MANDEIS AHI. \n- El bug de salirse del mapa/espada no cuenta\n- GLHF De mayor quiero ser Keanu Reeves @mangelrogel Yo doy menos likes por eso xdd Cada vez que doy un like pienso que le doy el coñazo a la gente que me sigue por los twitts random que les aparecerá en el TL super cruasáiyan https://t.co/YXoS1P5C1m @Moxy10830310 @hooshen_ world record is around 2:04-2:06 atm ;) gg tho! Keep trying @CarlosIMedina1 Esos no cuentan, hay que pasarselo sin salirse del mapa 🗿 Como vais con el mapa? Mi record está en 2:47 👀 Supongo que ahora soy 100% ESPAÑOL 🇪🇸 https://t.co/3pytAQe63r @Luzbelheim Dije antes de que se publicara oficialmente el mapa que había que usar el camino oficial diseñado por los creadores del mapa. A lo mejor el que se tiene que informar un poco eres tu crack. glhf Teneis que enviar el video de vuestro record a través del formulario que dejé en la descripción de mi video. Podeis subirlo en \"oculto\" si no quereis que se filtren vuestros atajos y truquitos ;) El record ahora mismo creo que está en 2:14 min. Sois muy grandes. Ya sabia yo que meter la espada en mi mapa no era buena idea jajaja. Muchos estais aprovechando el bug, pero tendreis que usar el camino “oficial” ;) Pero GG, me ha flipado. #RubiusTrials https://t.co/SnuNG4EOlz RT @FortniteGame: The fifth Creative Trial has kicked off! Race to the center of the earth in the #RubiusTrial\n\nTop 3 times qualify for the… @TheGrefgYT hazte un 24h intentando batir mi record 👀 Como se ha filtrado, Epic me ha dicho que lo publique para que vayais practicando, asi que YOLO. Codigo del mapa: 2697-3295-3945 @NdpokHD si, podeis jugarlos las veces que querais en stream o en videos, eso da igual. Pero el que mandeis en el formulario, que sea el video definitivo con vuestro mejor tiempo. @IscarioteGamer &lt;3 Aqui está chavales. Os presento mi mapa en Fortnite. Voy a hacer millonario a un suscriptor. Preparad las F https://t.co/NsSB4yZGvd like y RT 💀 29/05/19 https://t.co/mYppoXtmj2 29/05/19 https://t.co/0dMqdSszkN @mangelrogel Menuda rave nos montamos con los altavoces del coche. 10/10 Quiero un mono mayordomo @NovaDG_ ya se como será mi siguiente cumpleaños RT @NovaDG_: La fiesta perfecta no exis... @Rubiu5 https://t.co/oIKYKkY8Tr @VirtualHero @LolitaAldea @MovistarPlus @ZeppelinTV damn son NUEVO 🔥 VIDEO 🔥 Mis suscriptores me mandan videos denigrantes #3 https://t.co/PTnkwZuPP9 dale a laik &lt;3 se viene video @mangelrogel https://t.co/7M6XWvrA1d @PtJ_Quill soy su guardaespaldas por si teniais curiosidad, os dejo las stats del twitt de la limonada y el ranking mundial de RTs https://t.co/yjHFz8BjtX @JocelynLeons cagüai owo 10/10, me lo he pasado muy bien. thx &lt;3 Oh shit, here we go again. mandadme videos denigrantes en el stream https://t.co/BBBQe2rAot @eIrabos Nais. Thx &lt;3 Me estoy dejando crecer la barba. De momento parezco un pedófilo con una orden de busqueda y captura, pero veremos como avanza la cosa. Goes https://t.co/BBBQe2rAot En una hora mas o menos empiezo stream dedicado 100% a WoW, enseñando mis personajes, hablando de Classic, nostalgia y anectodas de un yonki del wow de hace mas de 10 años lul @Dagar64x fuck no, picaro en un server PVP con linkin park de fondo y latas de Monster en la mesa @Rodri_munoz95 Miedo me dan los stream snipers en este juego jaja VAMOOOOS https://t.co/R3uVceWT1P ya por fin he metido emblemas para los subs de Twitch 🗿 https://t.co/C3LKmtb0Om Despues de 800 años vuelvo a Maincra. Vamos a probar los mapas mas descargados de la historia https://t.co/BBBQe2rAot @LOLiTOFDEZ a quien tengo que pegar? saco mi katana si hace falta Esto es lo mas cerca que vamos a estar de vivir la experiencia de GTA V Roleplay en la vida real https://t.co/w6zv8oPgLO Flanos https://t.co/rIc1Om2Fmz RT @Manu_Hermoso: I’m BlackFish, soooo... U are?? MANGO ROLLER?? Like a Mango? @Rubiu5 @mangelrogel https://t.co/3vTZhvsUwi RT @mangelrogel: MANGO ROLO Nuevo video! Os presento... el NO TE RAYES JERRY CHALLENGE, con unos invitados MUY especiales https://t.co/ejbfoN4Nee laik &lt;3 @MrBeastYT The LIMONADA ARMY is strong dude, be careful 💀 de mientras voy a reaccionar a la nueva temporada de Fornait (y seguramente compre el pase completo lul) empiezo directo! https://t.co/BBBQe2rAot Esta noche se viene un video muy pepino @JocelynLeons OwO que ganas de gastarme 5,300$ en un cosplay de roblox no puedo esperar gracias balenciaga https://t.co/5xx1daJ5as @bitchinrubius joder pero que me pasa @borraskkaaa yo ser noruego yo no españolo en breves haré directo jugando a juegos random tambien, aunque aviso de que me he aburrido un poco del GTA V RP y seguramente lo deje un poco apartado por ahora, cuando habra stream os explico (activaros las notificaciones de twitch uwu) he subido al canal secundario un resumen del evento de Borderlands 3! https://t.co/dN5tyzQfBM Joder soy muy listo, he empezado el directo sin darle al boton de “empezar directo” y llevo hablando solo durante media hora empiezo stream shavaleh https://t.co/BBBQe2rAot este video me hace feliz https://t.co/CVMF7OCF53 Borderlands 3 desde LA en exclusiva bois https://t.co/BBBQe2Jbg1 @ElFercho_xd Los pantalones ahegao 👌 Nuevo video! Unboxing de mi nueva nueva nueva nueva casa en 5 minutos =) Espero que os guste https://t.co/hpZruYC43a Like y erreté Que puta maravilla #AvengersEndgame @ironmarcia Nope, es de un amigo casa vacia con eco + banda sonora de Halo https://t.co/Aj1sSYlDtW @Naranj1t0 @LOLiTOFDEZ Tu eras mi hack, guapo @DeadlyCrowGames Jajaja sospechaba que el juego lo habian creado unos españoles. GG, está muy currado, aunque es un poco dificil T_T @LOLiTOFDEZ Como crees que gané la primera partida de tu torneo lmao Nuevo video! :D EL JUEGO MALDITO DEL AYUWOKI. Hacia tiempo que no lo pasaba tan mal D: https://t.co/yjJ4gNIfs7 Like y hee hee &lt;3 https://t.co/Df19InOhj2 @mangelrogel uffff se me ocurren cosas que podria hacerte con ese palito de frikis 😏😏😏 RT @LolitaAldea: Pues aquí está terminado el dibujo de ayer. Siguiendo la tradición de los personajes comiendo algo. https://t.co/BxMLmL2emC @LolitaAldea me ha entrado hambre IRL Hola Rubén, soy tu yo del futuro, solo vengo a decirte que todo te irá bien https://t.co/UrfrWRDR47 Oliver declarandose al amor de su vida https://t.co/ginygY2HI3 RT @doblasnk: Tatuajes que valen la pena https://t.co/0QDw7UuHEP @LolitaAldea 10/10 RT @Rubiu5: Nuevo Epic Vlog de Japón! Atacado por un inodoro futurista, evento de Final Fantasy y moar https://t.co/2lAavERJF7 Nuevo Epic Vlog de Japón! Atacado por un inodoro futurista, evento de Final Fantasy y moar https://t.co/2lAavERJF7 vlog 日本からのパート2今夜 Ya he vuelto a Españita mi tierra, en 30 min empezamos directo haciendo unboxing de todas las frikadas que he comprado en Japón :D https://t.co/BBBQe2rAot RT @mangelrogel: Cómo no recordar esos buenos momentos cuando @Rubiu5 y yo eramos estrellas del Heavy Metal https://t.co/yx0vxcY570 @Perxitaa Menudo titán RT @its_moc0: 🌸Maricarmen 🌸\n{@Rubiu5 }\n#elrubius https://t.co/k6YytP9PWS Epic Vlog JAPÓN. El virgen ha salido de la cueva por fin. https://t.co/7h8mVkOw9G Like y 私にキス 🔥 JA JÁ! Que te jodan Articulo 13, se viene la maravillosa epoca de los memes cristianos 🙏🏻 https://t.co/UlVTeULve6 Vlog de Japón muy, muy pronto ⏱\n\n東京 🔥 Viendo que han aprobado el Articulo 13 mejor me quedo a vivir en Japón ya que estamos lmao https://t.co/V5xn4Y3cB1 ⚪️─────────────\n 0:01                                    3:33\n            Salmón, mon, mon\n           DJ Mahe ft. Rubiuh\n\n              ◄◄▐▐⠀►►\n\n🔈───────────⚪️🔊 Pronto habrá vlog de Japón :D RT @Angel_jm_lop: ▬▬▬.◙.▬▬▬\n═▂▄▄▓▄▄▂ \n◢◤ █▀▀████▄▄▄▄◢◤ \n█▄ █ █▄ ███▀▀▀▀▀▀▀╬ \n◥█████◤\n══╩══╩═\n╬═╬\n╬═╬ \n╬═╬ sólo bajo para decir\n╬═╬    \n╬═╬C… He juntado las piezas de la figura de The Division 2 con la que ya tenia de Spidey Homecoming y ha ocurrido esta maravilla: https://t.co/OY33L1wzJY @LVPibai Seria una buena oportunidad para volver a llevar mi gorra de creeper. Junio? https://t.co/OZnyU5RfCE Vamos con GTA V Roleplay ahora :D Vamos a darle duro al The Division 2! https://t.co/BBBQe2rAot @Anne__72 Es la coña 🗿 He subido el video de la donación de 4300$ del niño a mi canal secundario https://t.co/L3fWjgKk6M @igioiriki @VicioOMT @MarkiLokurasY @aLexBY11 @Ninja @ZoK3R wtf Voy a intentar hablar con twitch para ver que se puede hacer. De lo mas surrealista que me ha pasado en la vida lol F por el castigo que le va a caer al niño Las 1000 voces de Mahe. Nuevo video con un poco de Salmón, mon mon &lt;3 https://t.co/bFSHHMXOPM Laik si tienes hambre @wandakunpls @VirtualHero menuda maravilla RT @wandakunpls: Hace unos días hice este coso de Sakura de @VirtualHero y bueno xd\n@Rubiu5 ✨ https://t.co/joHwaqcxhr https://t.co/1hXOabAlzb @jean_FF10 Spoilers 👀 @EJojoachi laik @iDjsRoger &lt;3 Lo mejor de Capitana Marvel ha sido el gato. El resto me ha parecido un coñazo RT @interexplore2: ¡ElrubiusOMG acaba de subir video celebrando sus 10 millones de seguidores en YouTube! https://t.co/OJGEwVXjLo https://t.co/mkIcVy0dS3 @mangelrogel ...padre? Otro video que no monetizo por una cancion de One Direction que suena durante unos segundos en un meme. ESPERO QUE DISFRUTES DEL DINERO HARRY STYLES O QUIEN COÑO SEA QUE ME HAYA PUESTO EL COPYRIGHT. NUNCA MAS IRE A VUESTROS CONCIERTOS. UN FAN MENOS. https://t.co/jZwjC9OQoh Nuevo video shavaleh! REACCIONANDO A MIS MEMES https://t.co/nuKuFCKcZ7 Like por mis delgadas piernas &lt;3 @Facuuh74 @Fortnite_ES @FortniteGame Tambien es verdad Ojala poder jugar a Fortnite de manera mas casual. Cada partida que juego está llena de pros que juegan como si fuera una final de 100.000$ y es frustrante, y está dejando de ser divertido para mucha gente :( Meted rankeds o algo ya plz @Fortnite_ES @FortniteGame RT @Theamelia15: Tenia que hacerlo, me encantó ese directo JAJAJAJA\n@Rubiu5  @mangelrogel https://t.co/pDUKUuevJw @ustftvinito @mangelrogel :0 @mangelrogel https://t.co/FIqD1cxLvI @mangelrogel https://t.co/57f5fyovaJ Llevo todo el dia sin abrir el movil para no spoilearme con la nueva temporada del Fortnite. Tengo unos 500 whatsapps e emails sin leer por culpa de esto. Empezamos directo soon. 🍌 @LolitaAldea &lt;3 RT @CyhiThePrynce: This the only time we allow dope on Sundays https://t.co/tBmejGju06 Voltereta con hoverboard + emote de voltereta despues de hacer voltereta en hoverboard https://t.co/64CYuAFTEg La primera vez en 2 años que salgo en tendencias de YT. Ricardo estaría orgulloso :’) https://t.co/2MbQyPuCwo Nuevo video! U Got That by Rubius ft. R I C A R D O. Probablemente el mejor video en mi canal https://t.co/BXDDkobKiX &lt;3 Disfrutad de esto una ultima vez por que como lo vuelva a poner en directo me banean https://t.co/jtIPkPlW37 DIOOOOOOOOOOOOOSSSSSS Empieza el torneo https://t.co/BBBQe2rAot Aqui teneis los horarios del torneo de Youtubers x Pros de esta tarde 🗿👌 https://t.co/nPtGv0EDLf @Allen_Skies @LolitaAldea @ElTorres72 @VirtualHero Mola demasié 360 to 900 backflip nose-dive sky perfect 600IQ snipe en mi primera partida con snowboard. Not bad. https://t.co/LdnTs4rNvz @mydoblass Gracias RT @mydoblass: no sé que estoy haciendo con mi vida @Rubiu5 https://t.co/P5hsxTYxdI La gente con ansiedad son personas demasiado conscientes de estar vivos @DyLaNtero1 🍆😍🤤💦 @aLexBY11 @orslok increíble. Ojalá https://t.co/xcqQmyfacw @angysitacs no https://t.co/yS2kvVpKBi RT @rubiushappier: RTX ON                        RTX OFF https://t.co/o8mNwJxHv1 Nuevo video! EL NUEVO GENIO AZUL DE ALADDIN. HAY QUE PARAR A LA HUMANIDAD. NO MORE PELOS. https://t.co/mj9UMuDl2m Like y Erreté &lt;3 @claralukika @VirtualHero @LolitaAldea Ole @xItsPride Cierto. Me han vuelto a llamar y dicen que ha sido un error de ellos. Codigo Rubiuh en la tienda de Tetris. Me han llamado de Epic y EA diciendome que como vuelva a jugar al Tetris Battle Royale me cancelan los contratos millonarios que tengo con ellos. Tengo miedo. Tetris Battle Royale. ESTA MIERDA ES MUY SERIA. NO PARARE HASTA QUE GANE UNA PARTIDA https://t.co/BBBQe2rAot Vamos a jugar al Metro Exodus con los graficos a tope y RTX ON! Gogogo https://t.co/8ZOxWvmfhQ SACADME DE AQUI https://t.co/HsJF7esT7F feeling cute but might delete later ☺️🤩😅 https://t.co/VKeRTKhaCE Cuando estas a punto de casarte y te dice que no usa el codigo Rubiuh en la tienda https://t.co/ikFkzlLNGq Recreando la boda soñada por Zombirella. Menos mal que estaba todo en su cabeza. #VirtualValentines https://t.co/I6aw4VxjF8 Rubius haciendo cosplay de Rubius de la serie de Rubius. Feliz #VirtualValentines. Moar fotos abajo.\n\nFotos📸by: @MorganeD_MC\nCosplay🔥by: @HIYArtist y @AskalCosplay https://t.co/FVEBszEaol Vais a flipar esta noche... jojojo 🔥 Nuevo video! :D Me estoy haciendo viejo. Atençao al sorteazo de mi cumpleaños by @chollometro 🗿https://t.co/dY2rtJ9uj6 Laik &lt;3 &lt;3 @tacosftdoblas ME JODERIA SER TUS OJOS GRACIAS TWITTER POR EL SPAM DE GLOBOS https://t.co/ygu7lunWxh @hyomerin &lt;3 @srtaraptor &lt;3 @alexss_1 Que nos hemos llevado 5.000$ y hemos dejado españita mas o menos ARRIBA Hemos quedado 5ºs en el torneo :D Ojala haber jugado bien las primeras partidas. Los nervios siempre se apoderan de mi jajaja. Pero... HEMOS JUGADO COMO DIOSES EN LAS ULTIMAS. Me quedo con eso y con el cuchillo que me ha tocao &lt;3 RT @LOLiTOFDEZ: Hemos quedado en 5º posición, muy contento del trio que hemos hecho @xIsma_ @Rubiu5 y yo, nos hemos sacado una partida de 3… Empieza el torneo de 50K$ de Apex https://t.co/BBBQe2rAot https://t.co/k072cuBpHZ Mi experiencia en el Apex resumida: https://t.co/YGPq4Gm0Qy @BlBi_10 Nope @Alphasniper97 BRO Vamos a entrenar en directo. Acabo de hacerme una partida con 11 kills LUL https://t.co/BBBQe2rAot Nos han invitado a @LOLiTOFDEZ y a mi a un torneo de 50.000$ del Apex. Va a ser la primera vez que le hago carrito a alguien ( ͡° ͜ʖ ͡°) Si ella no te ama, el codigo Rubiuh lo hará. \n\nMeted el codigo en la tienda antes del dia 22 y os darán esta skin gratis &lt;3 https://t.co/Xb2cTN4hb3 Nuevo Epic Vlog! Hacia mucho que no subia uno :D Muchas gracias a Apex por este increible viaje. Ya podeis jugarlo gratis https://t.co/ccsy2TyP5z #ApexPartner @PlayApex &lt;3 https://t.co/8oTUXl8wOk Ha pasado mucho tiempo, pero esta noche vuelve Epic Vlog 👀 @LuisitoComunica Vale RT @LuisitoComunica: Cada vez que @Rubiu5 diga “vale” en un video, me tomo un shot de tequila.\n\n*Se muere ALV por sobredosis de alcohol* Empezamos directo en 10 minutos probando el juego secreto, Apex Legends! https://t.co/BBBQe2rAot #ApexPartner RT @withoutrubius: https://t.co/3iAYcoEpkP Mañana podré enseñaros el “juego secreto” que jugamos en LA. Solo puedo deciros que es un Battle Royale de @Respawn bastante fresco... 👀 GET HYPE #ApexPartner https://t.co/9AOJRG37ty @marshmellomusic @FortniteGame &lt;3 Vamos a ver el concierto en directo! :D Venirse https://t.co/BBBQe2rAot HAYP Ya he llegado a 🇪🇸ESPAÑA🇪🇸\nEn un rato empiezo directo para ver el evento de Marshmello en Fortnite ^^ 🖤💛🖤 https://t.co/v28VKVgvO3 Cuando estas en directo y tienes que completar el meme https://t.co/V5WE0RAUrp @eldiariodedross John Wick 4 @auronplay Yo estoy igual. F @D4vid1995 Sinceramente me da igual, prefiero hacer un video entretenido y que pase esto a que me lo borren. El dinero que genero en YT me da igual, me jode por la gente que esté empezando y no puedan tener la libertad que tuve yo en su tiempo. F 10 minutos lleva subido el video y ya hay una discografica que ha puesto un claim a mi video por usar una cancion durante 5 segundos. Solo por ese cacho se van a llevar el 100% de los ingresos que genere el video. Nice :) Nuevo video! :D SUBS MANDAN VIDEOS DENIGRANTES #2! https://t.co/YA4xFz4Tqt Like y MACACOOOOOOO RT @rubenboIudo: @Rubiu5 https://t.co/809qBGPCZE Guapisimo el Resident Evil 2. Me voy a dormir pensando en este malparido &lt;3 https://t.co/pmIQx8Bfls @DyLaNtero1 Menudo fiera @MrBeastYT maquina Este niño es mi héroe https://t.co/GZPyWZ0LuU Nuevo video! :D Buscando personas con talentos INHUMANOS en Chatroulette. https://t.co/okNN9rdPMx Like y RT&lt;3 Esta noche nuevo video 🔥 Intentando encontrar a un enemigo entre la niebla en el nuevo parche del Fortnite: https://t.co/TtL685GvwF @rubiusputaku Obra de arte RT @rubiusputaku: https://t.co/7y0dI8ureK A las 19:00 hago directo reaccionando al nuevo evento de Fortnite :D El sabado que viene jugaré con @WillyrexYT en la Maratón de Fortnite Burger King. Si quereis jugar con nosotros meteros aqui crucks: https://t.co/3fkDK5j18a 🍔 Ya me salgo. A ver como edito 3 horas de video ahora xD Sigo en omegle y me estoy descojonando. Estare una horita mas por ahi grabando vuestros talentos Empieza la caza de talentos. Meteros al omegle y en intereses “elrubius”. Lets go LA CAZA DE TALENTOS LAMENTABLAS EMPIEZA EN 30 MINUTOS (21:00 españa) en OMEGLE. Teneis que poner \"elrubius\" en intereses y le dais a video y que sea lo que el señor quiera ya vere si lo hago en chatroulette o omegle. Creo que omegle será mas facil. necesitais webcam si o si para salir. tambien cuenta si me haceis reir. Si creeis que teneis algun talento sobrenatural y unico, esta noche voy a hacer un video en chatroulette buscando talentos random. Todo vale. Desde tocar la guitarra como dios hasta poder lamerse el codo. Luego os aviso de cuando empiezo @tomlinsolcito Apu se fue a Naruto https://t.co/ywm1NEN0Fk Esta noche vamos a piratear en Sea of Thieves. EMPEZAMOS https://t.co/8ZOxWvmfhQ esta donación sigue doliendo https://t.co/lfxnYBU8EW @Srcheeto Es verdad, el Smash xd Ya decia yo que se me olvidaba algo Streamer profesional ya en directo: https://t.co/8ZOxWvmfhQ @Caith_Sith Era coña hombre 👀 @JAlonsoLopez @LibertyMario Ci. Lo jugué en navidades y esta bastante fresco Estos son mis #CompletadoEnSwitch de 2018, a ver los vuestros cracks:\n\n- Zelda BOTW (DLCs)\n- Celeste\n- GRIS\n- Pokemon Lets Go\n- Dead Cells (0 muertes LUL)\n- Shantae @Fortnite_ES like si deberian de añadir este estilo sin la cara blanca a la nueva skin. @FortniteGame pls https://t.co/52fAVd2YT6 @AstuaGabo M 👏 A 👏 K 👏 I 👏 N 👏 A PIM, PAM, TOMA, LACASITOS https://t.co/1tEQlPOtVm RT @ustftvinito: Este meme es mas fuerte que yo @Rubiu5 https://t.co/PDgyXybTdN LIVE https://t.co/8ZOxWvmfhQ RT @sryisuck: sonic wrong for this 😂 https://t.co/X4H5BxPqoO @TeamYouTube @Rubius_Doblxs https://t.co/XPrNDNfcxv Nuevo video! EL SALUDO QUE CASI ACABA CON MI CANAL. Like y RT &lt;3 https://t.co/5xk0JC7ogP Muy buenas, cracks del señor. La bestia ha despertado. https://t.co/ywHXZ63wLy Nuevo video! :D UN NUEVO RUBIUS https://t.co/C7SRCkBdCQ Like y RT&lt;3 DUMBLEDORE, ESTÁ CLARO https://t.co/p2wQAA1PJR @withoutrubius https://t.co/g6r9s6rKfl Amo a este gato &lt;3 https://t.co/9kmi5l5SRz Me han mandado DEMASIADOS paquetes y los vamos a abrir en directo. Lets go https://t.co/8ZOxWvmfhQ @Saul_HRO JUSTO No os pasa que cuando vais por un sitio que huele MUY MAL cerrais la boca y respirais SOLO por la nariz o soy el unico imbecil que lo hace? https://t.co/0PeKj1HSeh EMPEZANDO 2019 DE PUTA MADRE SOCIO Putabida tetes. Mañana lo hago que hoy internet me va del orto :( Lo siento mucho. F en el chat. Reinicio el router que esta dando por culo y empezamos el unboxing 2019 https://t.co/8ZOxWvmfhQ @SylvanaStorm 1 hora masomenoh CHAVALES, cuando llegue a casa hago directo haciendo unboxing de regalos de navidad y lo que surja @auronplay @pewdiepie F Pero mañana, llevo sin dormir como 24 horas y estoy en la shit Ya he vuelto a ESPAÑITA 🇪🇸 MI 🇪🇸 TIERRA. Tengo hype de hacer videos y stremear todo el mes sin parar @LeSardine @MovistarPlus @VirtualHero Very bonito, I like it very mucho @auronplay No puede ser xddd FELIZ 2019. Gracias por aguantarme otro año mas :D Sorry si he estado algo ausente... 2019 va a ser 10/10. Os aprecio y os lamia los codos a todos. Se irá Apu de los Simpsons en 2019? @VirtualHero Ojala fuera cierto, y ojala fuera Hentai. @auronplay Te ha faltado el “vale” cada 3 palabras RT @VirtualHero: ¡Las Navidades se ponen tensas! La batalla final de #VirtualHeroLaSerie llega mañana a @MovistarPlus ⚔️🦠 ¿Estáis preparad@… RT @mangelrogel: Mi top 10 rubius favoritos:\n-Rubius\n-Rubius\n-Rubius\n-Rubius\n-Rubius\n-Rubius\n-Rubius\n-Rubius\n-El Rubius\n-Rubius @mangelrogel no https://t.co/cEab2g7M9F Ojala tuviera la habilidad de expresar bien todos mis pensamientos y sentimientos con palabras y frases que tuvieran sentido @mangelrogel Esto ha sido mi mejor regalo de Navidad ☺️ Feliz Navidad cracks &lt;3 RT @Allen_Skies: Hecho con mucho amor para @Rubiu5 ♥ \nDesde que la vi en la serie sentí muchas ganas por dibujarla y aquí una linda excusa… Esto es una vergüenza. Enfermizo... https://t.co/5tOsIhvfRL @Sasenys Ya deberian estar disponibles en la mayoria de perfumerias/centros comerciales de Españita mi tierra @rubiusmanco Esa era mi idea, pero me dijeron que no iba a vender muy bien. Ahora huele a HOMBRE NORUEGO AUTENTICO @Ange_Giselle FOR HIM, FOR HER. La nueva “Eau de Tito Rubiuh” no tiene limites. No estaba de coña cuando dije que estaba haciendo un perfume. Best regalo Navidades 2018? https://t.co/GdAxduOkxn @TamyNightmerz Worth it &lt;3 @virtuaIrubius https://t.co/cqtzapZnf6 Ya estamos en directo. A ver si salen esos trickshots https://t.co/8ZOxWvmfhQ https://t.co/HPC6ruHzGA @floonasif Toma ya @DayoScript Claro tio. Es lo que dije yo desde el principio. 1 pa 1 a hostias sin items como en el EVO @DiegoDGG93 @Fortnite_ES Eso lo entiendo. Por eso creo que deberian hacer algo parecido al Counter Strike, donde meten mil modos y mil servers donde tu eliges como quieres jugar y ya esta. A mi el redeploy me flipaba, pero lo quitaron por que algunos se quejaban @Fortnite_ES Dejad de hacer tanto caso a lo que dicen algunos. A muchos nos gusta que cambieis el juego de esta manera y que metais cosas asi de vez en cuando. No estais “rompiendo” el juego. Deberiais poner mas modos de juego con estas cosas para tener a todos contentos y ea.Pero no quitarlo Miles Rubiales #SpiderManNuevoUniverso https://t.co/3ZggmqsGau F Esto esta siendo legendario. Mangel acaba de ganar la partida mas epica de la puta historia  https://t.co/V3wKhoLvyp DIOOOOOS DONKO @mangelrogel #SmashYoutubers RT @NintendoES: ¡Arranca el Invitational de YouTubers de Super #SmashBrosUltimate! https://t.co/l9XkYhNNmn @auronplay VENIR A POR MI https://t.co/2e0wAzRlRh Ah si, recuerdo sacarme una foto con este fan. Era majo el chaval, pero tambien bastante insistente https://t.co/M7yFXbwXSw RT @floonasif: @Rubiu5 Demonika fanart!!\n\nSoy FlooNasif :D https://t.co/9J9hYLjgnz @NintendoES 1 pa 1 sin camiseta y sin pantalones @MisterJagger_ @withoutrubius Xdddd @santiel26691483 👏 https://t.co/PC4I2fFmxk @eldiariodedross @auronplay te queremos Gracias a @avalonfortune por crearlos! Y por hacerlos de tan buena calité :D Como digo en el video, regalare 1 Limon 4K al mes para los que hagan el mejor Cosplay/Fanart/Cover/loquesea de Virtual Hero &lt;3 Y también estarán firmados https://t.co/IUC1iATDMv Nuevo video! PREGUNTAS ESTUPIDAS 2018 EDITION. Por que no salgo en el Rewind? Por que ella no te ama? https://t.co/3VbDF9Odqg Like y RT&lt;3 Hace mucho que no hago un video de preguntas y respuestas estupidas. Dadle calor, usad #PreguntaRubius RT @rubiustronger: jaja así es #VirtualHeroLaSerie #VirtualHero https://t.co/r3G6RNCGNh @Sevanevani nice! te lo pongo ahora =) @4ofi4 @VirtualHero No sabia que el grande tambien lo ponian en otros sitios :0 Nice @Promise59007931 @VirtualHero &lt;3 @FapParaMoar oof. este meme creo que se nos va a ir de las manos. pls stahp @NickSaurus11 @Seemc97 un tornado ;) @Seemc97 Un makina ;) Mi primer clip haciendo un Trickshot. Por fin. https://t.co/YAJpFaT9G2 Llevo todo el dia intentando no spoilearme con la nueva temporada de Foñite solo para esto. Vamos a reaccionar en directo: https://t.co/8ZOxWvmfhQ https://t.co/LTCgEggV4B RT @TwitterData: 365 days.\n125 million hashtags.\n500 million GIFs.\nMore @BTS_twt mentions than we can count.\n\n#ThisHappened on Twitter in 2… @love_squirtle La cara de mahe dudando de UST es lo mejor 🗿 RT @love_squirtle: Gran serie, mejor protagonista @Rubiu5 #retovirtualhero https://t.co/m0AXr8kp1y @LegoliNs TE JURO QUE PENSÉ ESO MISMO MIENTRAS LO HACIA LUL @PaulArmijos13 https://t.co/pAGTKtSHIQ Doblar escenas de peleas siempre es divertido https://t.co/b12GHBTYBN RT @LolitaAldea: Este es un nuevo capítulo en las cosas increíbles que me están pasando y que comenzaron cuando decidí hacer cierto cómic a… Cartel completo. “La ultima cena” by @LolitaAldea https://t.co/a3sIPlyr1X is this real life https://t.co/gDZaNX0uwB @Daap_dp https://t.co/2LQSiNpEPa Cosas IMPORTANTES que teneis que hacer este mes:\n\n- Suscribiros a Pewdiepie 👏\n\n- Informaros sobre el Articulo 13 👏\n\n- Hacer que Apu NO se vaya de los Simpsons 👏\n\n- Usar el codigo “Rubiuh” en la tienda de Fortnite 👏 Uyy muchachos, ustedes escucharon el REMPALAGO??? @troIlmask F \"Chicas Gamers\" https://t.co/lMExLxmwL3 nuevos emotes para twitch :D sigo un poco malo hoy pero me apetece hacer stream. empiezo en 5 minutens https://t.co/Px6tnkq5i6 Diooos que guapo. GG https://t.co/AwOxfPSXKu Nice https://t.co/x7IASZHcpG RT @VirtualHero: SYST3M/ Lo que os espera mañana en @MovistarPlus... ¿Estáis preparad@s? 😼 https://t.co/ar9tJVBdJi Nuevo video! :D Mis suscriptores me mandan videos DENIGRANTES LUL https://t.co/kEjKADhob3 RT y ESCUCHARON EL REMPALAGO? @mangelrogel https://t.co/IP6KBRTjWb @mangelrogel @Srcheeto @ManuelHuedo @Perxitaa @aLexBY11 Y despues a Rubius leyendo este twitt sobre Rubius y contestando al twitt de Rubius con el ex-compañero de piso de Rubius de fondo @mangelrogel @Srcheeto @ManuelHuedo @Perxitaa @aLexBY11 Dibuja mi codigo de fortnite @jontroll5000 @rubiustcat HUUUUH BEÑAAAH MAAAAH.... beñah... mah..... @rubiustcat MAAAAAAAAH SIGÜEÑAAAAAAAA RT @rubiustcat: De los creadores de The lion King\nLLEGA: The Wilson King https://t.co/2EqttUCfQz RT @AielloDavid1: Apoyando al mejor @Rubiu5 https://t.co/sfWFBISqwn @AielloDavid1 Makina, jefe, tornado, figura @kanyewest Guapisimos los mods del GTA 4 a que si @ElTorres72 @LolitaAldea NO POR DIOS NO DIGAS RUBIERS. QUE TE HAN HECHO TORRES. @BadGirl2714 MAKINA @rubenboIudo F Os aprecio. Ojala poder daros un abrazo a todos Hemos hecho un pequeño homenaje a las series de los 80-90 con este fake-opening de Virtual Hero. Ya teneis el capitulo 7 en @MovistarPlus ^^ https://t.co/gdWS3wjHJB @VirtualHero @MovistarPlus Creí que nunca lo iba a decir pero... Echo de menos a G4T0 T_T RT @VirtualHero: El Maestro Trollmask desea comunicaros que, desde hoy, un nuevo capítulo de #VirtualHeroLaSerie está disponible en @Movist… @Adrien_mont @Rubiustfanart Kawaii desune Hoy voy a poner la grafica a tope con el BFV y probarlo con el RTX ON. GRAFICAZOS INCOMING. Ya en directo: https://t.co/ZkUmDLpfeb thx @NVIDIAGeForceES &lt;3 https://t.co/WWwdYzvkap Joder estaba en el tren con la Pokeball Plus y se ha puesto a gritar PIKA PIKA y a hacer otros ruidos por los altavoces super alto xddd lo he intentado tapar con las manos rapidamente pero el daño ya estaba hecho. Por esto no salgo de casa. Fuuuck, muchos se piensan que el video de Pokemon que subi ayer es el mismo de hace 6 años xDD Ya he cambiado la miniatura y el titulo, que eran muy parecidos. Putos domingueros. RT @DiegoG_H: Cuando @Rubiu5 hace vídeos así, con su humor de siempre, solo puedo decir gracias, porque me río hasta enfermo.\nSamanté\nhttps… Nuevo video! :D Pokemon Lets Go en 1 minuto? SUUUUIIII. https://t.co/cbjjSF8qt7 RT por los PUTOS DOMINGUEROS &lt;3 @angela147xD https://t.co/sm0EpYUHXG https://t.co/MpGTb6UNHL @mangelrogel https://t.co/BiqNzJzpL6 @iropihime Woaah, mola mucho &lt;3 Gracias por pasarmelo Cuidado con el nuevo Pokemon https://t.co/eN6LDbzVuT Pokemon Let’s GO BITCHES (ojala se hubiera llamado asi) https://t.co/8ZOxWvmfhQ @suzanmontse El me hace bullying a mi todos los dias mordiendome los cables y cagandose fuera del arenero. Pero en el fondo nos queremos. Pero bueno, no serás tu la cosa mas bonita del mundo 😍 (estoy hablando de la switch) https://t.co/r9OKhquGs2 @gamestatiom95 De puta madre socio Hoy no hay stream cracks, he tenido que salir a hacer cosas de normie, pero este finde estare a tope &lt;3 Y video en YT soon @straighchIorine Que va, está basado al 100% en mi, no se de que estas hablando 🤔 Esto no ha hecho mas que empezar. Estreno de la segunda parte el 23 de noviembre. Con mas accion. Mas explosiones. Mas epicidad. Mas Mangel. La bestia ha despertado. Get hype. #VirtualHero https://t.co/o755IWM8m6 DEP Stan Lee :( https://t.co/ecXOFNlzBK RT @TheGuardianMew: HOW DOES THIS SONG FIT SO WELL!? https://t.co/8pg2fd7aTk DESPUES DE VER ESTO NINJA ME LLAMÓ 😱😱😱 https://t.co/yMHDEhkd7q @JossieBlue97 @Ninja la ultima vez que bebo cerveza en directo un saludo OMEGALUL Mi primer clip de pro player, un saludo @Ninja &lt;3 https://t.co/F0dxa8LIsw RT @RUBIUSMAFlA: CLIP | MAI NEIM IS JEFFFFFFF \n\nDirecto del día 09/11/18\n\n@Rubiu5 https://t.co/0CsMWjDVme @RUBIUSMAFlA PERFECT TIMING Aqui teneis una entrevista muy comfy que me hicieron hablando de la vida, de VH y del futuro. :) https://t.co/WTZpb43ZG2 Empezamos. Intento de Record Mundial en Fortnite (acaba sexual) https://t.co/BBBQe2rAot @AngelMu67606344 Mejor: si sale BIEN me lo tiño @doblasxstranger oof Esta noche voy a intentar hacer un record mundial en Fortnait (en stream). A ver si sale bien LUL Gracias Que ceno hoy chavales Refloto esto por la gente que viene del ultimo video y no lo encuentra ^ 🍋 @PunchoYT POLLETE y tu os mereciais la sub gratis :’( RT @ElSpidermanMEME: @Rubiu5 Este es el nuevo Auxilio me desmayo. https://t.co/9PMYS7S65H En 15 min empiezo directo. Red dead, otro juego donde podeis jugar todos vosotros tb y noche de chill ATENCIÓN https://t.co/fmw7UlrxKI Kappa https://t.co/CpOejQb60I Nuevo video: MI NUEVA NUEVA NUEVA NUEVA (NUEVA) HABITACION https://t.co/v9OKzMvAi4 Like y auxilio No es Sony, no es Nintendo, es ella que te esta mintiendo @YesWeCraftS como mola! :D te mando un md. muchas gracias &lt;3 @tacosftdoblas AMEN intentando cumplir con mi #NoNutNovember y Nintendo me viene con esto https://t.co/KOwXOUFAif RT @JosssIdrovo: Jelouda~~ ☺️ @Rubiu5 \n#elrubiusfanart 💕 https://t.co/r9BPYDu4vU RT @garodxblas: Feliz Halloween!!\nHe decidido hacer un dibujo del clásico disfraz de muchos años ❤\nEspero que te guste &lt;3 @Rubiu5 #elrubius… @garodxblas @VirtualHero @LolitaAldea Increible. Thx! RT @withoutrubius: choose your fighter @Rubiu5 https://t.co/l23fDkiI8p @_navespaciales like RT @_navespaciales: @Rubiu5 like por el disfraz otaku culiao https://t.co/g4SA8QQqaS @virtualraviol Good times @MelanyOemege Oof Estamos en directo bois. ESPECIAL HALLOWEEN 2018 👻 https://t.co/Atzu5wb6PM a xuparla, esta noche directo de halloween. Voy a tener que ser creativo con el disfraz por que no he preparado nada 💀 @Siboney26708669 Voy a intentarlo! Yo hace 1 semana: estupidos memes de dinosaurios no hay quien los aguante\n\nAhora: \n\n🎵🎵🎵 auxilio me desmayo, callese viejo lesbiano 🎵🎵🎵 https://t.co/UkBkCagQ2U @HIYArtist @LolitaAldea @ElTorres @halloween &lt;333 @auronplay Tengo miedo Mear borracho es como intentar apuntar a un objetivo con un mando de PS4 https://t.co/uBXclncQay @rubiustrolo PREFIERO ESTO ANTES QUE LOS ESTUPIDOS DINOSAURIOS UN SALUDO El video lleva media hora subido y sigue atascado en 13 visitas y 2 likes. nunca cambies youtube https://t.co/yAHb4mft64 (tranquilos, no tiene spoilers) Nuevo video! :D Red Dead MEMENTION 2. https://t.co/S921qmAo4C Like y RT&lt;3 \"Si esto funciona, juego del año\" https://t.co/uZWoQ9FFYt @ElvisManriqueM1 @VizzAgency Los de Vizz han mandado twitts a los ganadores Chavales, ya se estan poniendo en contacto los de mi agencia con todos los ganadores del sorteo de la LIMONADA 2.0. Si os ha tocado algo mandadles vuestra info 🍋 GL &lt;3 https://t.co/BbwaWsTOkp RT @Sunfwer_JiHu: Fanart de Sakura #VirualHero 🖤 \nSPEEDPAINT : https://t.co/zLDmkJV98y\n@Rubiu5 @LolitaAldea @VirtualHero  #VirtualHeroFanar… RT @Erickson_DR: Ya vi los 6 capítulos de @VirtualHero y me sigue encantando el diseño de #Zombirella ,por eso no pude resistirme y le hice… @Ero_Pinku @LolitaAldea Esto es muy next level. gg RT @Ero_Pinku: @LolitaAldea Para tu día especial~ (*´♡`*) (el próximo a color, para las chicas, que son muy guapas &gt;w&lt;) https://t.co/whC9T3… @VirtualHero @FlagshipTef @MovistarPlus Deja los bocadillos de atún, que te estás poniendo hermoso crack @ElTorres72 @LolitaAldea Felicidades Lolita-chaaaaan (✿◠‿◠) Toda mi vida ha sido un engaño https://t.co/tQBJN1M1Xu RT @Rukikunarte: Pues para celebrar el estreno de #virtualhero aquí tenéis ilustracioncita de #Zombirella :3 ¡Enhorabuena a @Rubiu5 @Lolita… @Faangirl13 Galletas de jengibre (como el de shrek) @IkerPlanOficial “Oh, lo siento, esto es lo malo de no tener manos” Hay cosas que se pueden mejorar obv. Es la primera vez que hacemos algo asi, y creo que en un proyecto tan grande lo mas dificil es arrancar y estar todos en la misma pagina. Esto no es nada mas que el comienzo. Me alegra mucho todo el apoyo que le estais dando. Gracias a todos los que estais viendo Virtual Hero. El dia del estreno fue una montaña rusa de emociones (buenas y malas) pero viendolo ahora, estoy muy orgulloso de lo que hemos conseguido hacer. Y que tantos lo esteis disfrutando. Ha merecido la pena completamente. Un abrazo &lt;3 @JPMaccha17 @VirtualHero Me caeis bien &lt;3 Gracias! @rubiustrolo JAJAJAJA @WillyrexYT mira esto @mischiefinn Xddd hacia tiempo que no veia esto @mangelrogel https://t.co/gX8CQcIWLP @Tala35176627 A mi en la promo tampoco me convencia mucho, pero creo que cada vez va a mejor :D Y si a alguien no le gusta, hemos hecho version doblada en inglés también! Opening de #VirtualHeroLaSerie by Mägo de Oz. Muy orgulloso de esto ^^ @MAGODEOZOFIC @VirtualHero https://t.co/ePqn6dFk4i Mañana tendreis los 6 primeros episodios en @MovistarPlus y en Noviembre los otros 6 :D RT @MovistarPlus: Y mañana, @VirtualHero completa sólo en Movistar+.\n\n#VirtualHeroLaSerie https://t.co/Spb26ElH2S AQUI TENEIS! Estreno de Virtual Hero :D Un capitulo entero, con opening, ending. TODO. https://t.co/CTOnbVZ57e Dadle el like mas grande de la historia si os ha gustado &lt;3 kjsdhfaksjdhfakjdf 30 minutos para el estreno mundial de Virtual Hero en mi canal. @ElTorres72 @VirtualHero TRABAJA!! *le azota con la espada* @13xust yepp Osea, en ninguno vais a ver mi cara reaccionando al capitulo ni nada parecido, en los 2 os pondré el capitulo de principio a fin tal cual está. Mañana subo un capitulo completo de Virtual Hero a mi canal de YT, en principio lo iba a hacer en directo pero no se que os parece mejor asi que votad plz, que estoy mu nervioso xD Me cuesta creer que esto es real https://t.co/6oLcD6jdIe @cuentamelunares @LolitaAldea @ElTorres72 @VirtualHero EN MADRID? DONDE?? Necesito ir a verlo Aaaaagh por qué tengo que tener fiebre justo hoy 😭 @MAGODEOZOFIC @VirtualHero *LLEVAME CONTIGO AL MAS ALLA, PUES AQUI NO DEJO DE LLORAR* https://t.co/vmhJYB2HL2 Nuevo video! Documental sobre mis años en Youtube, viaje a Tokyo y Corea, proceso de trabajo de VH... Poneos pantalones comodos :) https://t.co/ZMx0b8qMxA Like y RT&lt;3 mañana subiré a mi canal este documental. es largo asi que preparad las palomitas y los pantalones comodos 🗿👌 https://t.co/YtJIYzyBCd Agendas y carpetas nuevas de VH (muy family friendly). Ya a la venta 😛🖕 https://t.co/j6Bot5zyKT 🍋🍋🍋 Nuevo video! Tito Rubiuh is back &lt;3 https://t.co/AWLC53I1hS LIMONADA 2.0 🗿 24 horas @VirtualHero @MovistarPlus :DDDDDDDDDDDDDDD RT @VirtualHero: T4CH4N! Aquí tenéis el trailer definitivo de #VirtualHeroLaSerie 🔥 Los Mundos de Juego os esperan el próximo 12 de octubre… Esto no me lo esperaba O_o THE ADVENTURE BEGINS! https://t.co/w1JLFIk67Y @KeruruCosplay @VirtualHero @Lune_darkwolf @LolitaAldea eso lo quiero ver acabao :D @mirincita13 @VirtualHero Un hombre de cultura, como yo 🗿 @avalonfortune Mil gracias por estos regalos y la bonita carta &lt;3 Estan super currados. https://t.co/mDzkJkppSg @germiarftust @Lune_darkwolf @LolitaAldea @VirtualHero @quepasa_co @ElTorres72 En serio, estoy flipando mucho, me hace tremenda ilusión que la gente haga estas cosas @Lune_darkwolf @LolitaAldea @VirtualHero @quepasa_co @ElTorres72 OMG 😍😍😍 10/10 @rubiusputaku Stahp RT @VirtualHero: HYPE/ ACTIVADO ¡La aventura comienza el 12 de octubre en @MovistarPlus! 👾 #VirtualHeroLaSerie https://t.co/RWDgdfBQpl RT @featrubius: @Rubiu5 elrubius golpeando a elrubius en la realidad virtual de una serie creada por elrubius https://t.co/2UgXVuNm9B @Royle68019185 Va a ser gratis, puede que lo saquemos en Steam Estamos creando un juego de VR donde podrás abusar fisicamente de mi (si ese es tu fetiche) #VirtualHeroLaSerie https://t.co/9d3uRH46mR @rubenishining Seguramente lo saquemos gratis en Steam 👀 @savedbylodo Creo que si, en su web! @BlackEspanolito Puede ser, en Madrid lo que haremos seguro serán cosas de VR en tiendas de movistar (estamos haciendo una demo bastante OP 🌝) Si alguien quiere venir a ver el estreno de los primeros capitulos conmigo, estaré por Sitges el 7 de octubre. Visca el barça pan tummaca https://t.co/Kinemi3JrX @MizzCriaturita @VirtualHero &lt;3 https://t.co/1vgapoBQDi RT @VirtualHero: Nombre - SAKURA\nTipo - Humana, gamer \nDescripción - Le gusta (demasiado) el anime\nClase - Cazadora\nTipo de ataque - A dist… RT @VirtualHero: Nombre - @Rubiu5 \nTipo - Humano, gamer \nDescripción - Le gustan los gatos obesos\nClase - Jugador capullo\nTipo de ataque -… @PlayStationES @aLexBY11 https://t.co/RWaRxEu3kR Ya teneis el vlog que grabamos con @PlayStationES en Nueva York!! :D #SpiderManPS4 🕷🕸🌇 https://t.co/4ugB3wyK2i @VirtualHero “Cuerpo a cuerpo” ( ͡° ͜ʖ ͡°) @VirtualHero “Por fin” dice. SI HE LLEGADO PUNTUAL COMO SIEMPRE CARA ALMENDRA La ultima vez que salí en las noticias de Colombia decían que incitaba a los niños a consumir droga y que era un perturbado sexual. Esto es mas bonito :) https://t.co/YG6dduWsTL @mangelrogel Te hemos tenido en cuenta :) RT @mangelrogel: YO en la vida (@Rubiu5 ) https://t.co/6eomLMVuRm @VirtualHero SIMPLE. I.A. GATUNA. La cuenta de @VirtualHero la lleva G4T0. Tratadle con amor, que al fin y al cabo es una simple I.A. gatuna que no da para mucho mas... 🤔 https://t.co/tVTaPFWEfx Y tengo ganas de volver a YT, a finales de este mes seguramente nos veamos por ahi 🗿👌 @CARLOSDIEGO1136 @VirtualHero NO, REGRESO ANTES 12 DE OCTUBRE. ESTE ES EL CARTEL OFICIAL. TENGO MUCHO HYPE EN EL CUERPO AHORA MISMO. LO ESTRENARE EN MI CANAL. ESTE ES EL TWITTER OFICIAL @VirtualHero YA DEJO DE GRITAR AAAAAH https://t.co/ofzG4eKtxk @VirtualHero @MovistarPlus AAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAHHHH RT @VirtualHero: #VirtualHeroLaSerie comienza la aventura en @MovistarPlus el próximo 12 de octubre. https://t.co/56vT5N2CcG @JaniffB Oof X Hola guapos. Hoy tengo 3 noticias para vosotros, y una de ellas es falsa. Cual será? 🗿\n\n1 - Este mes vuelvo a YT\n\n2 - Mi video de vuelta será un gameplay de Roblox\n\n3 - Hoy anuncio fecha de estreno de Virtual Hero\n\nOs he echado de menos, cabrones &lt;3 @avalonfortune Necesito esto en la puerta de mi casa. GG Acabo de encontrar esta foto de cuando viviamos juntos y le dije a @mangelrogel que se probara mi ropa https://t.co/ABc4tT7gjk Eminem sacando un disco sorpresa me ha dado la vida @Dementside &lt;3 STRAIGHT OUTTA HENTAI https://t.co/IuITexeY4J Cocinero in-game y cocinero IRL #WoWBFA https://t.co/y6wiV8lxdR @samerubencio Me salgo de una droga para meterme en otra VAMOOOOSSSS VIVA EL WOW COÑO @KNekro Ya abriras los ojos como hice yo, ya... @faprabos @sarhmakk Pero yo os quiero :( @Hekady LA HORDA antes molaba. Ahora está lleno de locas quema-arboles lmao. @rubenboIudo Para levlear EN LA EXPANSION fiera @hi_sonix Videos no, pero siempre he querido hacer algun directo :D @sarhmakk Ojala Esta noche sale la expa del WoW y todavia sigo sin decidirme sobre que personaje levlear T_T Ayudadme muyayos. Ligma o Lemonzz? https://t.co/k1Szk0JtCq @Srcheeto Traete a la cabra. Yo le doy un hogar @alejac000 oof no me acordaba de esto @mangelrogel https://t.co/9Nvowy9nXc 1 noche en la nueva casa y ya he visto una luz brillante extraña en el cielo y a un pajaro chocarse contra mi ventana. NO QUIERO ALARMAROS PERO SI DE REPENTE DESAPAREZCO ES POR QUE SEGURAMENTEME ME HAYAN ABDUCIDO ALIENIGENAS @HIYArtist @motionPicSa @LolitaAldea @TXENZIU A la siguiente tenemos que llevar a @mangelrogel a bautizarse con el chupito del infierno ☠️ @JavierTlaneci En la nueva habrá unboxing 🗿👌 @Vazquezinho_ Que va, nunca me iria de ESPAÑITA MI TIERRA DE MI CORAZON 🇪🇸 Ya he empezado la mudanza y esto me pone triste 😭 Adios a mi setup favorito en todo lo que llevo en YT. Aqui han pasado muchas cosas. Laik si lo echaras de menos. https://t.co/SixqECeEal @UstFeelings oof @litchristx2 Oof. La verdad es que tengo mas ganas de que saquen el Classic, pero le dare mucha caña a BFA tambien. @roikosoemege fixed. Edicion verano 2018: https://t.co/oKv8m2n2l4 https://t.co/fhaPZcL2ju video térmico del año https://t.co/4lUVziOTnA Hemos cenado üterbratens y nos vamos ya a la cama. Gracias por invitarme @PUBG &lt;3 Y si quereis seguir viendo los torneos este finde, aqui teneis link con todo! https://t.co/T0wtU7slg1 #PGI2018 @2Xfxke_loveX2 Mientes. Se están cosechando en un bosque de Colombia. Estarán preparadas para 2024. HEMOS QUEDADO CUARTOS EN EL TORNEO LEL. Por poco nos llevamos los 100.000$ del #3 puesto para donar a una causa benefica, pero holy shit, GG :D Hemos quedado Top 5 en la primera partida. Not bad. Han ganado unos coreanos, CON 19 KILLS. QUE ALGUIEN LES QUITE LOS HACKS MENTALES. #PGI2018 Ya va a empezar el torneo mundial benefico de @PUBG :D Podeis vernos en directo aqui: https://t.co/uAoA9YO0hG #PGI2018 https://t.co/STPK6zSIHt Mi asesina está lista. Mañana voy a Berlín para el torneo de @PUBG del viernes. LOOTEAS, ANDAS, MUERES, REPITES #PGI2018 https://t.co/aFosyV4OMY @Kanecky_ Esto mola mucho, gracias &lt;3 @StefanLOL14 Pronto. Estoy empezando a echaros de menos Llevaba 5 kills, escuche a un tio abajo asi que queria ir a darle una colleja para ganar mas puntos, salté para poner suelos alrededor del edificio PERO VAYA NO SE PUEDEN PONER SUELOS EN ESE EDIFICIO. RIP. Resumen de mis ultimas partidas D: #SummerSkirmish https://t.co/wrznAmVTUs Llevo 5 partidas: \n1º - Win y 4 Kills\n2º - Perdida y 1 kill lmao\n3º - Win y 4 kills\n4º - Perdida y 2 kills\n5º - Win y 7 kills DIOOOOOOOOOOOOOOOOOS #SummerSkirmish #7KillsHYPE https://t.co/QmWR8ZkdUp Para los que preguntan, los puntos van asi: Cada win son 5 puntos, cada kill 1 punto. Son 10 partidas en total. Con la de bestias que hay en el torneo prefiero ir a por wins seguras que jugarmela. Another one #SummerSkirmish https://t.co/4AZ4sawDJ5 Me ha intentado poner una trampa el cabron lmao #SummerSkirmish https://t.co/WvVF4sh5lA Acabo de ganar la primera partida de las 10 que jugamos hoy en el torneo oficial de Fortnite de 500.000$$$ :DDDDDDD #SummerSkirmish https://t.co/LEx6NZpCnk @rubiustrolo @FortniteGame no haré stream para estar concentrado! Pero les pasare clips y tal si sale algo chulo para que lo pongan en su directo ^^ @Dutygameplays lul, GG @FortniteGame QUE COMIENCEN LOS JUEGOS DEL HAMBRE @ShadowKingReal Haremos todo lo posible para que asi sea Line tests de uno de los ultimos capitulos de Virtual Hero. Cada vez va mejorando mas y mas ^^ Ya queda menos. #VirtualHero https://t.co/RJ2Opeggi7 @DeniseuKimKyu Las lagrimas de mis enemigos 🗿 @cancerftccahuay UTERBRATEN? El siguiente viernes voy a Alemania a jugar este torneo benefico de PUBG. Pase lo que pase, esa noche ceno pollo 🐓 https://t.co/jhzO4n1WWC Oof. Me acuerdo cuando iba al instituto en Noruega todo el mundo se me acercaba a bailarme esto y La Macarena solo por ser español. Me rodeaban. Yo sonreia y les seguía el rollo, pero por dentro... por dentro lloraba. https://t.co/qY3EpSyGlY @s4lseotime Las 2 🗿👌 Farmeo rico rico La skin de Hokage está OP https://t.co/5lxJ5LEqMd @Srcheeto que haces en mi juego 🗿 https://t.co/nn3o4hwTnq Thanks for inviting us @FortniteGame &lt;3 Nos han vuelto a invitar para la semana que viene, y han dicho que arreglaran los problemas de lag y otras cosillas asi que LAMBORGHINI HYPE LUL @Shelos1Life en el twitch de @LOLiTOFDEZ o en el canal de @FortniteGame 🗿 me han invitado a esta vaina. 250.000$$$ ESTÁN EN JUEGO LMAO. Empieza a las 22:00 (ESP) y estaremos Lolito y yo jugando contra la creme de la creme del mundo. habrá que despertar a la bestia 🗿 #SummerSkirmish https://t.co/rqdDgkxsag @Loextrar &lt;3 @rubenismagic Estoy fuera de casa y solo he podido verlo desde el movil y quiero volver ya y no salir de casa en 1 semana P_P RT @rubiuscosmic: @Rubiu5 Mira qué foto tan + pro le tome a Escuela de Gamers 2, y me encantó akbdksbf &lt;33 https://t.co/PbAKMt8imH @MariaReview xk xk xq nada es cmo antes xq https://t.co/zqWP3Sis6J Pocas cosas me hacian tan feliz como gritar “SUUUUUUUUUUUUUUUUU” cada vez que Cristiano marcaba gol. Te echaremos de menos crack, maquina, jefe, figura, tiranosaurio, ciclón... vikingo. :( @anitames03 @Sunfwer_JiHu @Carolina_Sevi 10/10 RT @LolitaAldea: Al preparar una portada siempre se hacen varios bocetos para escoger al final el que guste más. Esta fue otra de las ideas… RT @Sunfwer_JiHu: Mi fanart para @Rubiu5 💖Agradecimientps para @Carolina_Sevi por hacer posible que lo vea ✨ https://t.co/SBQLRTk8uj @FapParaMoar Si, ademas este viene con frotada sin camiseta. El pack, a parte de ser precioso y que me entren ganas de abrazarlo cada vez que lo veo, sale mucho mas barato que si compras los comics por separado, asi que si siempre has querido la coleccion entera ya sabes! &lt;3 Para celebrar que dentro de poco estrenamos la serie, hemos creado un pack con los 3 comics originales de VH y ésta es la portada. GRACIAS POR EXISTIR Y HACER ESTAS MARAVILLAS @LolitaAldea 😭 #VirtualHero https://t.co/1XJNcFv2OM @auronplay Me gusta la horchata igual que me gusta la gente que filtra contraseñas en torneos 🗿 @MikuloUst FUCK #Son30MillonesRubiuh https://t.co/yKilNOitsl @Pedrito_Vm Yess, muchas gracias &lt;3 Resumen del dia de hoy https://t.co/Dki6stDkb9 @Whynot_BeADino @Rubiustfanart &lt;3 Esto es lo mas bonito que me han dicho en toda mi vida https://t.co/ZhLbHbgeDG No puedo dejar de pensar en todo lo que pasó ayer :’) https://t.co/58oYATD8EJ https://t.co/dpukzzc9cm Sois la hostia https://t.co/2JDjJEXc54 Pues nos vamos de fiesta los 100 Youtubers. Ahora empiezan Los Juegos del Hambre de verdad, lo otro era un calentamiento. Esta si que la gano yo aguantando hasta el final 🤪 @auronplay FIERA @auronplay JEFE Tripaloski 2.0 https://t.co/qqa1cGh1eb @auronplay MAQUINA Lo unico malo han sido los horarios, en Latinoamerica era super temprano :( Y hubiera molado poder jugar mas partidas sin tanta pausa entre medias, pero se filtraban las contraseñas todo el rato. De todas formas espero que lo hayais pasado bien 😘 Esto ha sido incredibol. Gracias por a todos por hacer esto posible. Me lo he pasado genial, una pena los fallos tecnicos de mi pc y mi mala suerte :&lt; Espero poder volver a hacer algo asi en el futuro con todos. Gracias &lt;3 Nos vemos en mi canal despues del verano #YTBattleRoyale RT @Gamergy: Hemos conseguido algo ÚNICO. \n\nGracias a todos los participantes y espectadores. #YTBattleRoyaleGY9\n\nY en especial a @Rubiu5 p… RT @LVPibai: El mejor momento en la historia del Fortnite. #YTBattleRoyale https://t.co/smLiEKvMsJ Esto empieza. El evento mas grande de Youtubers de la historia. Let’s go #YTBattleRoyale https://t.co/JBuPWZA8YT RT @DavidSafin1: Preparado para ve el #YTBattleRoyale. @Rubiu5 @RobleisIUTU @Wismichu https://t.co/nMMEntgWC4 RT @darkar43: @Rubiu5 i’m ready boyyyyy suerte máquina, crack, jefe,  tifon, torbellino, fiera, espalda plateada, numero uno. 🦖🖤 https://t.… @Gentleloli como lo sabes D: Cada vez que tengo un evento importante (como el de mañana) mi prioridad numero uno es elegir bien los calzoncillos que me voy a poner. Todo influye: tacto, tamaño, suavidad. Bolas comodas=Mente comoda @taechimx i feel you bro :( Estoy listo para mañana #YTBattleRoyale @WalkzBizcochito La verdad es que si ^^ Con este poco tiempo que he desconectado veo las cosas de distinta manera y todo mas positivo. Estoy contento y feliz, y con ganas de volver despues del verano El streaming principal será en mi canal, pero no lo llevare yo (sigo jubilado lul), será algo parecido a lo del torneo del E3 donde habrá comentaristas, cambios de camaras, repeticiones de las jugadas, entrevistas a los youtubers, etc. Un evento e-sports vamos. Este viernes es el gran dia del torneo #YTBattleRoyale. Estoy entre nervioso y contento de que vayamos a hacer algo tan grande entre todos. Shit is gonna be LEGENDARY *el gato no está incluido con la compra del libro* Mi nuevo libro es tan magico que ha convertido a Wilson en esta belleza de gato. #GAMEDONIA ya a la venta everywhere. https://t.co/bZvXVHl0H2 RT @LOLiTOFDEZ: OH BABY @Rubiu5 https://t.co/dsbnoFzBFE RT @auronplay: 🙋🏻‍♂️ https://t.co/TEpHFYR35v RT @Rubiu5: ✖‿✖ https://t.co/7gfLyxr33h @tenchim_1119 Oishii! RT @duducky_: El mayor boicot de la historia 😂😂😂 @Rubiu5 @mangelrogel @Perxitaa @WillyrexYT @LOLiTOFDEZ https://t.co/R723wW8Nxy GG https://t.co/rnydHiotJe ✖‿✖ https://t.co/7gfLyxr33h Esto ha sido mazo divertido. He matado a @lilyachty , he tenido build-battle contra Myth, mi compañero es un FIERA... Una pena que no nos llevaramos la copa ningun español! :’) GG Falsa alarma. Estamos bien @partynextdoor https://t.co/pujFLdnqf0 Estamos a punto de salir y ha desaperecido lmao. WHERE U AT BRO @partynextdoor Tu, que mi compañero de duos no aparece xddd Molaria ganar y llevarse esto a casa la verdad #FortniteProAm https://t.co/pmLpHFOZTg Team SPAIN represent! #FortniteProAm https://t.co/2XhLVuHrmI acabo de darme cuenta @WillyrexYT https://t.co/IsBgaGO5gv Cuando te pilla una squad entera pero te dejan vivir. https://t.co/6FuXyafRBK Hoy es el dia oficial del torneo de Fortnite del E3, os imaginais que ganemos algún español? O que le haga un rico headshot a Ninja? 🤔🗿 Tocad madera @vaniapaolaclv @elijahwood Creo que me pasa cuando me pongo nervioso lmao @serranoftrubius @elijahwood Ya puedo morir en paz 🧙🏻‍♂🧝🏻‍♂🧝🏼‍♀🐉🏔🌋 #TransferenceVR https://t.co/3sePrBKOdP Madre mia la squad de cara-almendras. A ver si nos veis en el directo! :D #UbiE3 https://t.co/6xIxeDDvix Se nota por nuestras caras que esto es de cuando estaban hablando del juego para smartphones xD https://t.co/USdZuUivoO OMG YES Este año será la primera vez que vaya a una conferencia de Bethesda. Si el destino se porta bien, a lo mejor anuncian un nuevo Elders Scrolls... o un Skyrim 2: Despacito Remix, ME DA IGUAL SOLO DADME UN RPG DE FANTASIA Si haceis cosas asi y lo llevais al torneo os amare infinito &lt;3 https://t.co/SpjYwC0LZi Eso si, los que quieran podrán sacarse sus sponsors para el torneo. Si algun Youtuber quiere llevar puesta una camiseta de Pipas HACENDADO por que le pagan por ello, pues ole. Go for it. PD: No, no me paga nadie por hacer esto. Ni por el primer torneo. Lo hago por que me gusta. Pero esta vez habrá premios muy gordos para los ganadores. Será el 22 de Junio en la Gamergy de Madrid. Todos los que estuvieron en el primer torneo están invitados (faltan algunos por confirmar en el Discord) y a lo mejor hay caras nuevas ;) Parecia imposible pero lo hemos logrado. Vamos a hacer el torneo de Fortnite con 100 Youtubers, pero esta vez PRESENCIAL. Con casters, camaras, 100 PCs, TODO. Get hype bois #YTBattleRoyale Hoy he podido visitar por fin el estudio donde se crea la magia de la animación detras de Virtual Hero (Seoul, Corea S) y he conocido a toda la gente increible involucrada en esto. Estaban super emocionados de conocerme despues de dibujarme durante tanto tiempo :’) 🇰🇷💜 https://t.co/6qDj7ZhPSS Colaboracion con boyband koreana BTS ft. Rubius CONFIRMED https://t.co/k2pgiF6Adc Video muy interesante.                             PD: Y sí, todas las miniaturas las hago yo (a veces he llegado a no subir un video hasta el día siguiente por que la miniatura no me convencía lul) https://t.co/ujSqd2uZ6o Pues nada, a reventar culos en el E3 *dab ironico* https://t.co/WVrIZEErpl Cumplemahe Feliz @mangelrogel &lt;3 https://t.co/fN3eTy3JKe Me voy durante un tiempo https://t.co/BpkSyivts3 &lt;3 @toulousweetener Confirmado que ha sido el Uno de mis gatos se acaba de tirar un pedo que casi me mareo madre mia @xpandepipax Cuenta con ello 😘 Ahre @Josega_24 Flipo tio! ESCUELA NUEVA, VIDA NUEVA. Bienvenidos a Gamedonia. #EDG2 MUY pronto :D https://t.co/eZqHC4QqDj @SebastianFM05 @estefania_MYPJ @SKFZLzsybwjWPLP @moarjustin Gracias RT @dianabunny11: En un mundo paralelo jaja♥🐱\n\nUn pequeño dibujo con amor :3\n\n@Rubiu5 💖\n#elrubiusfanart 🌈 https://t.co/ZbBjvKMoOa https://t.co/2iiHD9Nsul el me entiende https://t.co/kUCtrtJ4oy Eso si, las 2 victorias en solo y competitivo han sido la hostia. GG. #MeDoyPalmaditasEnLaEspalda Ultimamente tengo muy poco aguante en los directos. Empiezo super hype y con ganas de comerme el mundo pero despues de un rato me noto empanadisimo. Estoy viejo ya para estos trotes D': Hoy estoy de muy buen humor ;D https://t.co/ChZMGhdUEZ DI-VI-NA https://t.co/uTjRJUvVcM Podria verme todas las temporadas de Friends en bucle durante el resto de mi vida y nunca me cansaria @LolitaAldea awww &lt;3 RT @LolitaAldea: Hoy he firmado un Virtual Hero y a cambio me han invitado a un café. Una buena forma de echar la tarde ❤ https://t.co/WUmm… RT @pepi_wilson8: Encuentre las 5 diferencias https://t.co/CflyMqNW7P Por petición popular, aqui teneis un video dedicado 100% a mis gatos. Intento duchar a las bestias :'D https://t.co/siyULPkN3k Like y RT&lt;3 Y mañana seguramente haya video https://t.co/ofjav28Vw7 Ya he llegado a casa ^^ Que ganas de estar tranquilito jugando y comiendo gordura Pero bueno @auronplay cuanto tiempo llevas escondido aqui dentro? https://t.co/EMx2691eBQ Esto se me hace muy dificil sin la ayuda de Lolito https://t.co/ME3K9llcYB A ver que se esconde en este arbusto ( ͡° ͜ʖ ͡°) https://t.co/exgBN32bTI Soy bueno pero no creo que pueda hacerme a esos cuatro yo solo https://t.co/RSvbLuZzW6 @Perxitaa menudo fiera @GbarielJ you only had one job En esta web podeis hacer lo mismo con vuestras caras! Dadle un susto a vuestras abuelitas :3 https://t.co/9mJ8JjZts2 #SomosVenom https://t.co/KbzRyCzJF2 @magacago84 @FortniteGame No haria falta nada mas. 10/10. El crossover con Thanos ha estado bien, pero creo que se puede hacer algo mejor @FortniteGame https://t.co/XFI9gnwooQ @mangelrogel @PlayStationES 1 pa 1 sin camiseta para cuando https://t.co/eHWfkI3NWZ @LOLiTOFDEZ @aLexBY11 @mangelrogel @Srcheeto @Maximus3blog @orslok A la siguiente barbacoa 🗿👌 RT @JocelynLeons: Pareces un niño pequeño cuando te emocionas xd &lt;3 💫🌸 Es algo muy sencillo, pero tenía que hacerlo ;u; 💙\nGracias por el di… Aqui lo teneis! El momento legendario de cuando mato a Thanos y me hago el nuevo portador del guantalete heheh. Esto ha sido de los momentos mas epicos de todos los directos que he hecho xD https://t.co/Ta6oRu0vPU Like y RT&lt;3 Ya está casi subido ^^ DIOS MIO* NO SE ESCRIBIR POR QUE SIGO NERVIOSO ya me calmo DIOS MIL LO QUE HA PASADO EN EL DIRECTO HA SIDO LEGENDARIO xD Ahora os subo el video cuando lo edite un poquillo @mangelrogel si, y me rei mucho no me lo esperaba https://t.co/jtu5fNlpwR RT @MobNature: Dibujito para @Rubiu5 &amp; @mangelrogel 🌟 https://t.co/rzbHekULQ8 @FapParaMoar es posible ¯\\_(ツ)_/¯ @camilaforsuarez Fiera me sentí bello en esta foto pero seguramente la borre pronto 😍😘🎀💕💗🙊💞🧡💚 https://t.co/0efNJaTPIy Es la hostia poder trabajar con gente tan profesional y conocer a los que doblan a los otros personajes en la serie. Me ayudan muchisimo y me dan muchos consejos de como mejorar. Siempre aprendo algo nuevo Estoy obsesionado con que quede perfecto. Me puedo tirar horas repitiendo la misma frase una y otra vez hasta que quede satisfecho. Llevo 2 dias en Barcelona doblando unos capitulos de Virtual Hero y es muy dificil, pero cada vez me noto mas suelto y que va mejorando. Lo que mas me cuesta es encontrar un balance entre seguir “siendo yo” con mi voz de siempre pero que a la vez suene profesional y bien actuado. Agradezco de corazón todos los mensajes bonitos, cartas, dibujos y todas las cosas que me mandais dia a dia durante años demostrando amor. Y tambien a los que están en silencio disfrutando de mis videos. Arigato a todos. Me haceis muy feliz. Nuevo video boisss! :DVuelve el mitico Gang Beast con La Familia Agresiva. QUIEN ME VA A COMER EL HIGO AHORA? https://t.co/wwdxQLjCYh Like y RT&lt;3 Video fresco INCOMING @LOLiTOFDEZ xDDDDD RT @LOLiTOFDEZ: No puedo parar de reírme con esto... @Rubiu5 https://t.co/QCtCs233NS @_OkiDoki Fav si este hombre solo quiere llamar la atención :V 🤔 https://t.co/owgrLxg1rE RT @Rubiu5: Lanzacohetes + Baile Ruso + Impulsos Jeloudah = Epic Win https://t.co/d7ZbWKfDMT Lanzacohetes + Baile Ruso + Impulsos Jeloudah = Epic Win https://t.co/d7ZbWKfDMT ESTO EMPIEZA https://t.co/IbgycQcgf2 Esta noche si que si. https://t.co/kgAr76JCZr Realidad Virtual &gt; Vida Real @LOLiTOFDEZ  https://t.co/1e2Kd1Xvir Al final lo tenemos que dejar para mañana shurmanos :( Problemas tecnicos and stuff. Esta noche directo #dreamteam https://t.co/qDDj8j2dzk @featrubius Tsssssh... no lo digas en alto, que nadie se habia enterado 🤫🤫🤫 Bonita bienvenida &lt;3 https://t.co/rtDdr88ncL Cuando caes en Pisos Picados y el unico cofre que puedes abrir te da una pistola gris https://t.co/453N1FYoMB RT @hibiku_yamamura: となりにいたゲンガーのおかげでなんかすごいミラクル起こってる https://t.co/o9AKPTYNnI OOF @ustftsalseo OOF Hay una plaga en el mundo... Se llama Roblox. Esconded a vuestros hijos y a vuestras abuelas. Nuevo video reaccionando/analisis de Roblox https://t.co/kZDJiZxBxP Like y RT&lt;3 Esta noche se viene un video muy fresco. Get hayp🗿 RT @PlanetaRubius7u: JAJAJA NO PUEDO\n@Rubiu5 https://t.co/NonGfwnZSG Que pena lo de Avicii. Le descubrí por primera vez en 2011 gracias a este remix de Skrillex. DEP https://t.co/DXjetXVTzU Por desgracia ya no puedo hacer quedadas con suscriptores en la vida real, pero ayer montamos algo parecido en VRChat y fue mú bonico &lt;3 https://t.co/xYgovzLuQg Ya han subido el video de @PlayStationES que os prometí en mi vlog! :D Con gameplay del God of War, mas escenas de la aldea vikinga y viaje en el barco de Kratos :) #PasaportePlaystation https://t.co/n7Pl1QLCSs Dadle jamor. Nuevo video casi-guapos. El juego mas sangriento y violento de VR. Mi vikingo interior ha despertado https://t.co/Crz66BRGvB Like y RT&lt;3 @chikorita_06 lel (ﾉ◕ヮ◕)ﾉ🍦 https://t.co/zr60z0VWLt @rubenboIudo Mi voz estará 100% seguro, lo que digo es que el espectador tenga la opcion de cambiar el audio dentro de la misma serie si quiere otra experiencia (como cuando ves una serie y te sale la opcion de verlo en VOSE o doblado) @SendoBabyface Mola mucho! :D De hecho hemos pensado en a lo mejor hacer 2 versiones de la serie, una con mi voz y otra con la de un profesional, y que la gente decida como quiere verlo con el tipico menu de \"cambiar idioma\". @Mikaby29 @R5Rubelangel @KassSaavedra @Ara_gomez16 @julii_mugas @camotetroll @Mariana_1246 @Rxbiuhsmurf BERGEN? videojuegos en la vida real https://t.co/W5yiJofmAI @PlayStationES Se la llevo a... BERGEN? @LOLiTOFDEZ Bergen? Por fin nuevo video! =) Llevo a Mangel a mis tierras y PASA ESTO. Epic Vlog en Noruega, con extra de vikingos, Ust y mas cosas que no quiero spoilear. https://t.co/IipC2qlY7c Like y RT&lt;3 Esta noche Epic Vlog Mangel y su padre son personas maravillosas. @itsxluciaa_ ya me jodería @Serch91 &lt;3 @Serch91  https://t.co/w7PvrOsBuS SUUUUUUUUUUUUUUU @CANNESERIES Hahahaha @mip @MovistarPlus Thx for having me! =) Esta tarde presentamos Virtual Hero en el festival internacional de series en Cannes. Estoy basante hype :’) #MIPTV @MovistarPlus https://t.co/PYxmY06o2X Sorry por acabar el directo tan pronto hoy, creo que me ha dado un bajón de azúcar o algo 🤕 Nos vemos pronto juapos, y gracias por todo el amor que me estais dando ultimamente &lt;3 @auronplay cuando filtras la contraseña del servidor del torneo y haces como si no hubiera pasado nada https://t.co/I7jN1u0xwt \"cariño creo que esta el-ruflos ese de los videos en el avion, voy a sacarle una foto sin su permiso\" https://t.co/QiKCIxPqpM Se nota que @mangelrogel no está acostumbrado a este frio lul https://t.co/1TAdJmHtra Ya me joderia https://t.co/bsLYK5SXX9 Estoy en Noruega con Mahe. Ahora nos vamos a beber una cerveza y a dormir. Os mantendré informados 🗿👌 RT @JocelynLeons: Están hechos a la rápida, pero espero que te gusten (*´ω｀*)/♡ 🍃💕\n\n🌼 @Rubiu5 [ #elrubiusfanart ] 🌼 https://t.co/qqxdIK15db @elihcjx Lmao. Sorry por matarte &lt;3 Nuevo video juapos! Agarraos los pantalones por que hoy vuelve el terror con un juego inspirado en PacMan. Menos mal que tengo la cancion de la wii https://t.co/OJUTdmGcYg Like y RT&lt;3 A punto de ver la pelicula de Virtual Hero https://t.co/WFrRmwk92E RT @Rubiu5: Sigo llorando de la risa https://t.co/bNR3BeykkX @mangelrogel Haber estudiao @pequitasftrubiu Pobre wilson :( @alfredoozcariz el que subí ayer, fiera. Sigo llorando de la risa https://t.co/bNR3BeykkX @Unleashed645 yo estoy llorando de la risa viendolo otra vez xdd PD: Ningún animal fue herido en el rodaje de este video. Nuevo video shurmanos! :D LOS CAZADORES DE MEMES feat Mangel. Que juegazo por dios. https://t.co/mYJ734hirP Like y RT&lt;3 explicadme esto https://t.co/gOvQAkLvjo Ya han subido el ultimo episodio del Reality, detras de las camaras y momentos nostálgicos :’) Dadle amor https://t.co/EbPqapBIFI #FC5Reality2 https://t.co/Uu17py4gsv RT @auronplay: -Rubius: Tened mucho cuidado con la clave del servidor, que no se vea en el directo chicos no lo olvidéis es muy importante… @DiegoVelx @YouTubeGaming Me han dicho de YT que ha sido un bug, que basicamente petamos la pagina y que estan viendo que ha pasado para arreglarlo. A ver que dicen! Me acabo de despertar. Nos fuimos a dormir super tarde por los nervios y el hype. Sigo sin creerme todo lo que pasó ayer. RT @Rodriguin2001: @Felipez360 fuera de aquí https://t.co/FE2w5R9SQ0 Hellouda 2.0 #YTBattleRoyale https://t.co/BFKnYegEto @Fernanfloo &lt;3 @DrDisRespect Gracias, Doc. @ElvisaYM &lt;3 Gracias a todos por una noche inolvidable. A los Youtubers y a los suscriptores. Hemos batido el record mundial de views en directo en gaming. #YTBattleRoyale os quiero &lt;3 https://t.co/0WiJP34ZRD ESTO EMPIEZA. NO PODEIS PERDEROS LA INTRO: https://t.co/BBknryIWNQ 1 HORA RT @mangelrogel: @Rubiu5  https://t.co/Dckfa3JOil La gente viendo en directo los 1vs1 del torneo #YTBattleRoyale https://t.co/1WVcbZKeZN Amén hermanos. https://t.co/6OMrcaLnSg Si gano alguna de las partidas me tiño el pelo de Super Saiyan Blue (a lo Ninja) No va a pasar asi que ¯\\_(ツ)_/¯ ¯\\_(ツ)_/¯ ¯\\_(ツ)_/¯ https://t.co/XU5N9ctOyd Confirmado. Mañana a las 8-9 de la noche (Horario ESPAÑITA MI TIERRA) nos reventamos las cabezas entre Youtubers en el Fortnite, cada uno streameando desde sus canales. #YTBattleRoyale https://t.co/hJAfW4CCXN @auronplay estamos jodidos @eldiariodedross No sabes lo feliz que me haria que te unieras al torneo de Fortnite. Te prometo que no te pasara nada perturbador. Podria decirse que está confirmado al 99% que el torneo de Fortnite será este domingo ( ͡° ͜ʖ ͡°) @mangelrogel Haz el truco que te dije de morderte la lengua. Funciona el 99% de las veces SI ME LLEGO A ENTERAR DE QUE TENIA ESE PUTO BICHO GIGANTE ENCIMA MIA EN EL MINUTO 6:40 HUBIERA SALTADO DEL AVION. NO ESTOY DE COÑA. QUE AGOBIO POR DIOS Nos toca abandonar el nido y volar solos. Esto fue de las experiencias mas terrorificas/increibles de todo el Reality #FC5Reality2 https://t.co/PGYQGJMqZ9 Dadle amor &lt;3 fuck, siempre que pongo los streams en twitter sale la miniatura del anterior directo D: weno, meteros que estoy poniendo un temaso Vamo a entrenárno https://t.co/KX019TS4Ok #2012vs2018 https://t.co/DX41JvKZkt Cracks, maquinas, jefes, rinocerontes. Aqui os dejo el nuevo video! :D Momentos Rubius #2 boissss https://t.co/k5vaihLm6i Like y RT&lt;3 Todos los Youtubers que esteis en la lista del torneo de Fortnite, seguidme y enviadme un twitt o DM si no os he enviado la invitación del server de Discord. Es importante por que esta noche decidiremos el dia oficial del torneo. Un saludo ( ͡° ͜ʖ ͡°) Seguramente se haga mas de 1 torneo por que algunos de esta lista y de la otra no podrán participar este finde. Cada torneo serán varias partidas (la mayoria 1 pa 1 sin camiseta, pero habrá sorpresas) Nuevos participantes de la matanza #YTBattleRoyale https://t.co/Vgg2Th9hAx Lmao, vais a flipar con la lista actualizada de la gente que se ha unido al torneo. Esta tarde la pongo. @TheGrefgYT Willy y Vegetta están invitados (el tercero no se quien es 🤔) Voy a ir actualizando por aqui gente que se va apuntando. Empezamos fuerte con la confirmación de @Fernanfloo ʕ ͡° ͜ʖ ͡°ʔ @mariviimartin @auronplay Diselo al carachancla, aqui le espero,1 pa 1 sin camiseta Aqui os dejo la lista. Si falta alguno perdonadme! Montar esto es mas lio de lo que pensaba xD Todavia quedan huecos asi que ya sabeis, spammead a quien veais que falte. Que os parece hacerlo este finde? Cada uno desde su PC stremeando su punto de vista molaria. https://t.co/B3wdjc53cI Esta noche pongo la lista de los Youtubers confirmados para el torneo de Fortnite. Pinta bastante interesante de momento ( ͡° ͜ʖ ͡°) @czumayapineda1 1 pa 1 sin camiseta @andercortes @LVPibai @SalvadorRaya Jajaja joder queria decir “si lo casteais con el”. Estais invitadisimos los 2 (o los 3) PD: Todavia hay huecos, asi que spammead a vuestros youtubers favoritos para que se apunten 🐛 Ya os diré el dia del torneo y me iré poniendo en contacto con todos los Youtubers poco a poco para organizarlo bien. De momento pinta bastante interesante 🔥 @LVPibai Let’s go. Y si lo casteas con @SalvadorRaya 10/10 Necesitamos toda la nostalgia posible. PD: No hace falta que seais “gueimers” para participar. Ni hace falta experiencia en el Fortnite. Esto va a ser por los loles. @FlexZCoD He hablado con Epic y me van a dar la herramienta para crear partidas personalizadas ;D Da igual que seais Youtubers old school, Youtubers que no os caigais bien entre ellos, esto va a ser para reventarnos las caras y echar unas risas y juntar a la comunidad de una vez por todas. Lets go bois. Chavales, esto puede que sea una locura, pero si sale puede ser divertido de cojones. Quiero juntar a 100 Youtubers TOP de habla hispana para reventarnos en Fortnite esta semana. Ya hay algunos apuntados, pero si estais interesados escribidme por twitter. VA A SER LEGENDARIO. @WhiteZunder Eso es lo peor @Anto_doblas13 👆👆👆 esto me pasa por imbecil https://t.co/8Z0Av5FCaT Nunca habia visto una reaccion tan sincera y humana en un perro lmao https://t.co/Ckj6tMBAy4 \"Está a tomar por culo tio, en mi vida doy un tiro asi sabes?\" https://t.co/FfAs743KsE MANGEL x RUBIUS = Fortnite DREAM TEAM boissss https://t.co/YzzJSMAmyo @betotrujillo123 nope, PC Master Race only @StellaTalossi_ Antes de empezar el test, leete la guia dandole al boton de \"NORMAS\" arriba. Es un poco coñazo, pero es importante para que el server no se llene de trolls y solo haya gente que quiera rolear ^^ El directo de Fortnite con Mahe lo empezaré en una hora mas o menos, a lo mejor tambien probamos el server de GTA ;) @MizzCriaturita a vosotros &lt;3 @axel_0304 Spider-Man y Star Lord &gt;&gt;&gt;&gt;&gt; El resto ( ͡° ͜ʖ ͡°) Estamos a punto de abrir un servidor de Rol del GTA V. Dentro de poco doy mas info. Estad atentos (solo para gente de PC) https://t.co/R6i5bHLCpH Iba a hacer directo esta noche con Mangel, pero los servers del Fortnite estan caidos asi que lo dejo para mañana ( ͡° ͜ʖ ͡°) RT @Ubisoft_Spain: ⚠️ ¡EPISODIO 3 de #FC5Reality2 publicado! ⚠️ No tiene desperdicio... ¡Corre a verlo a nuestro canal para que no te hagan… Nuevo video muyayos! Peleas de borrachos en realidad virtual. Hace mucho que no me reia asi xDD El puto chino unicornio ayyy https://t.co/t5g7YfnXMO Like y RT&lt;3 https://t.co/SsoXjgOQsC RT @Ubisoft_Spain: ¡EPISODIO 2! ¡@Rubiu5, @WillyrexYT, @LuzuGames, @mangelrogel @aLexBY11 y @Perxitaa ante un reto extremo! 🚣‍♂️ 💪 ¿Consegu… \"Jeloudah\" https://t.co/Vjo5qbhaM9 Ayer nos lo pasamos bastante bien :D https://t.co/19WuDx6Uux @LolitaAldea 🤫🤫🤫 @LolitaAldea Me recuerda a alguien... 🌝 #NoSpoilers La reacción de la gente cuando se presentó el nuevo SSB ayer :') Yo estaba igual, pero en casa... Y solo. https://t.co/Yn6mSFAOY2 @EmilyBarahona27 YASSSS. Nintendo does it again 3 de estas pipas estan dibujadas a mano. Adivina cuales https://t.co/8UhSy7XS6w Nuevo video shurmanos y shurmanas! CUANTO ME CONOZCO A MI MISMO? Aparentemente menos que mis fanses D: https://t.co/9PyNeBPWcM Like y RT&lt;3 Tengo la mejor madre del mundo. Estoy tan orgulloso de ella. &lt;3 @_Tami_Ust Es una pared con ojos 👁 @yeszaurora CLOROX NEGRO Mi gemelo os manda saludos a todos y os da las gracias por todos los comentarios bonitos del video (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧ Nuevo video! Os cuento uno de mis mayores secretos :) Conoced a mi gemelo https://t.co/6bxWfg1eGT Like y RT&lt;3 Hoy voy a subir un video muy importante @aLexBY11 Yess. Este de GoW para tu pierna. https://t.co/XWADZE0xL7 @aLexBY11 Para cuando el siguiente tatuaje, cruck Si tuviera un gemelo, que le preguntariais? Pensadlo bien 🗿 RT @disconctedoblas: - T de Troy?\n-No, T de TE ROMPO LOS MUEBLES https://t.co/8uKrjzUTGK current mood: https://t.co/mQLfA0kHRm -Como enamorar a tu crush con 1 sola palabra 😍😍😍 https://t.co/okTGoNMtAX mu wenas kriaturitas aki rublos komentando https://t.co/F4MyDbQLA2 Bueno, me voy a tomar esto como un halago. Literalmente me está diciendo que soy bueno ( ͡° ͜ʖ ͡°) https://t.co/sZtGSibl1D @JustHoldDoblas Estaba en el ts con amigos, se me olvido salirme antes de grabar lmao Va bien yutuf hoy https://t.co/42gcetHNcK POR FIN HE ROTO LA MALDICIÓN. MI PRIMERA VICTORIA MAGISTRAL. VAMOOOOOOOOOOH https://t.co/WXG21Se2cF Like y RT&lt;3 https://t.co/LirK00ARof @vxrux @SrTibii @dblasinframundo @Luismenpah @CattaFine_Yolo @PoppyDoblas Ruben pajero x7 @its_loreee &lt;3 @vxnust Putabida, esa fue la del bazookazo xD Habia 150.000 espectadores en el momento en que quedabamos 3 con vida. El momento mas tenso de mi puta bida. Gracias por acompañarme. Mañana teneis video con victoria 10/10. En los streams no se que coño me pasa xD Hoy no paramos hasta que ganemos challenge https://t.co/u8rQMqHMSF Esto se ha convertido en una obsesión personal, perdonadme. @rubiusiplier EH PARA EMPEZAR TE CALMAS O TE PARTO LOS MUEBLES Y SEGUNDO, EL DIRECTO LO HARE MAÑANA un saludo Yo esperando toda la mañana a que abran los servers del Fortnite https://t.co/lqfW5kCdVl @AngyeFdez Ojala fuera una coincidencia https://t.co/gZD2beMVgo @VegecondaV DDD: Bro... https://t.co/aPIIZs2wNA Entro a twitter y todo dios me estais mandando fotos de esta figura mal rollera de yo version Tripaloski. WTF de donde ha salido esto https://t.co/kcHi9fAUjJ Muyayos! Nuevo video :D Hoy os enseño la tecnica milenaria ninja DEFINITIVA para ganar cualquier partida del Fortnite... O NO. https://t.co/TRUq5XeWWI Like y RT por el baile de Carlton &lt;3 Y para acabar por hoy, la voz de Mangel será... Nada mas y nada menos que... Chan chan CHAAAAN... MANGEL! https://t.co/Kd2DC1eKkM Demonika tendrá la voz de Scarlett Johansson (Joël Mulachs) &lt;3 https://t.co/mnJMeWgQV3 Trollmask será doblado por Sergio Zamora (Voz de Light en Death Note,  Keanu Reeves...) https://t.co/xNhCXBmLbB Os voy a ir diciendo algunas voces que tenemos confirmadas para la serie. Zombirella tendrá la voz de Natalie Portman y Keira Knightley (Nuria Trifol) https://t.co/wuQJ5EV5NH @BaeAlexby Alguien muy pro 😃 Doblando Virtual Hero =) https://t.co/tJO1GC1JXi Buenos dias hamijos https://t.co/I8Vl3A3KkZ @alejac000 Madre mia sois el FBI 🗿 Directito de sabado noche para los que estamos en casa forever alone &lt;3 https://t.co/oEjDY9Ayk1 subiendo el camino https://t.co/LtGD3PXu9G perdonadme https://t.co/2ZLohmD1hE RT @JosssIdrovo: #GratulererRubius \n@Rubiu5 espero te guste, muchas felicidadeeees!!♡\nMuchísimas gracias por todo^^ https://t.co/1Z1TnnrR3E @rubiustrolo &lt;3 Awwww, me vais a hacer llorar. Sois lo mejor :’) https://t.co/hlpWHyadZ5 &lt;3 RT @dreamdoblas: San Valentin:\n\nLas parejas vs rubius https://t.co/qFx7kHnPoL Aqui teneis el nuevo video! :D Trap Adventure 2... EL JUEGO MAS HIJO DE P*!# DE LA HISTORIA? FUUUUUUUUUUU https://t.co/x6ThQifzPD Like y RT&lt;3 pero esta noche seguramente tendreis video ^^ Sorry si estoy un poco desaparecido ultimamente, estamos trabajando muy duro en el anime de Virtual Hero. Estoy obsesionado con que quede perfecto y no pienso en otra cosa. 5 años he tardado, pero aqui está :) Nuevo video! PUBG en 1 minuto?!? SIIIIIIIIIIIIIIIIIII https://t.co/wPt0E1Nufa Like y RT&lt;3 5 años han pasado ya desde los videos de juegos en 1 minuto. Heh... https://t.co/ykvlqvPKA3 Todo cambiará a partir de hoy. Mi PC va a pedales ultimamente. Intentaré arreglarlo y mañana a ver si puedo hacer un directo largo y leo todo lo que me habeis mandado! Ahora me voy a tirar por la ventana hasta luego :) La danza del apareamiento https://t.co/1mbiTpdt5j @AndyBarrSays Lamento decirte que es fake. Sorry :( RT @minevierYT: @Rubiu5 Me encanto ver esto xd, puto youtube a veces https://t.co/l2Ss6rW5AU @FranciniTB al final del video se ve el dibujo :P Nuevo video humanos! EL COMBATE LEGENDARIO Z. Me juego un premio gordo contra el primero que me gane. Yasss. https://t.co/m6HZNCzVFE Like y RT&lt;3 Nunca volverá. La mayoria de los que jugamos a videojuegos creo que lo hacemos por desesperación de intentar revivir nuestra infancia y recuperar cualquier sensación de aquella inocencia y maravilla El 90% de las visitas de mis videos son de este señor. En realidad solo tengo 196 suscriptores. https://t.co/VwUNNMCNt0 RT @JustHoldDoblas: AHRE ME RECORDÓ A TI CON ESA PELUCA ROSA ME REÍ @Rubiu5 https://t.co/BaomFmrAng RT @soycriaturita28: Cuidado Tito rubius que te pasas con esa mano 7w7 https://t.co/ObGot1FAlS Esta noche directito y mañana video. Que os parece? A mi me parece que (╯°□°）╯︵ ┻━┻ Creo que va a ser mas facil si os meteis a mi grupo de Steam y hablamos por ahi ;D https://t.co/WvnbtGkBHc Quiero grabar un video luchando contra vosotros en el Dragon Ball FighterZ de PC, mandadme vuestro Steam y si me ganais... a lo mejor os doy un premio ( ͡° ͜ʖ ͡°) RT @rubenlykkelig: @Rubiu5 @mangelrogel Mi pokédex se alteró. https://t.co/kcZbMkFwqI Ya ha llegado Senpai &lt;3&lt;3&lt;3 https://t.co/ehw0PfyrDa @elraboslocos Grandes amigos mejores personas. Disfrutalo 😙 @RubenftBebito Que guay :D Nuevo video de VRChat! :D La Discoteca Meme, el Knuckles Trap, presentandoos a nuestro hijo y moar! https://t.co/H3tiGWBb23 Like y RT&lt;3 @doblaskook Hola, traigo galletitas. @unicorndoblas Yeah! A la siguiente me activo el voz de chat, que ahora no me funcionaba T_T En 15 minutos directito de Dark Souls 3 en mi canal! Tomaos un chupito cada vez que muera (mejor no) @eIgobernador LMAO NO @easyrubius Nope, esa va a ser para el ending ^^ Hemos empezado a trabajar en el Opening de Virtual Hero. Estoy hype por que hemos conseguido una canción increíble pero no voy a hacer spoilers todavia :D https://t.co/dpQvbivh9z Pues bien, al video que subí ayer le han puesto restricción de edad por “incitar o promover actos violentos o peligrosos que podrían dar lugar a lesiones físicas de gravedad o la muerte” https://t.co/wNdTXOrCDh Lo siento mucho por los que han visto el video con altavoces y tenian familiares en casa (づ◔ ͜ʖ◔)づ Nuevo video muyayos! Recopilación de todos los audios y canciones irritantes y troll que me habeis mandado durante los directos y momentos divertidos :')  https://t.co/wLF99dAd1e Like y RT &lt;3&lt;3 @mangelrogel xavales?? https://t.co/BSvzk3K7B9 @auronplay  https://t.co/t6Zyguc3ql Ríe y el mundo reirá contigo. Llora y lloraras solo. https://t.co/J8eToNBHXb Niños, no tomeis alcohol https://t.co/TGuWUUrFR6 @ivo_kk Entonces entras con listas VIP @rubiustrolo NO PUEDO, ESTOY BAILANDO EN UNA DISCOTECA EN VR. VIVA MI VIDA Ya sé que no se escríbe “demigrante” LISTOS. El úso correcto de la palabra sería “de inmigrante”. Podria montar fiestas en distintas ciudades. Obligando a todos a entrar con cosplays (aunque sean demigrantes). Y salas con juegos. Y poniendo dupestep cringe nostalgico. Si si. @Desahogada Nueva meta del 2018 Extraño mucho montar quedadas con subs en España como al principio :'( Me da pena no poder seguir haciendolo. os echo de menos @GermanGarmendia Yasss! Agradesco. Si voy al E3 este verano nos vemos ;D @Rubenish Es un dia perfecto para hacer directo 🗿 @LuzuVlogs adoptadme @Carolewe_7_17 Buena idea @andricitogp Shiet, creo que han sacado un juego nuevo que pinta fresco, pero creo que lo voy a reservar para video 🤔 @Yurei_Ichigo Eso lo juego en privado 🌝 Además no esta en spanish, asi que seria un coñazo traducirlo tó en directo Este finde se viene algun que otro directito fresco. Que os apetece que juegue? @IsaLyx TO KNOW DA WE YU NEED TO HAVE EBOLA Los peligros de la Realidad Virtual https://t.co/GNkF7PlDJD @Papaldo_Nunueld u kno de wei @rubiuswhxt Me podriais seguir viendo pero en forma de loli @DreamFullbuster literal Ojala poder conectar mi cerebro al VR Chat y quedarme viviendo ahí para siempre... Algún dia. https://t.co/QYiQn8L9cX RT @Sharon_cds: Imagino que cuando no está grabando @Rubiu5 está con las gafas de realidad virtual en calzoncillos y con un montón de porqu… RT @JESUSR2003: Tio acabo de ver el video de @Rubiu5 y he llorado de la risa lo recomiendo muchísimo por favor vedlo RT @CrisDosporuno: @Rubiu5 Otro más de estos por favor, puto guiri grabeando nalgas JAJAJAJAJAJAJAJAJ me cago en la ostia Que miniatura os gusta mas, la primera o la segunda ( ͡° ͜ʖ ͡°) https://t.co/JmTCVpVnBp Nuevo video para celebrar los 27M muyayos! :DD Haciendo hamijos en Realidad Virtual (Esto es como el Chatroulette NEXT LEVEL) https://t.co/KEOM4kdZ86 Like y RT si u kno de wei güenas noches Llevo toda la noche esperando pero no puedo mas xD 27M MAÑANA HYPE https://t.co/tokdVeh7WB @ElmexicanoOmg naisu! Buen detalle lo de quitarle el texto para evitar spoilers ;D @Rubenish esta semana haré alguno (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧ @IKardoussan Ese para cuando tenga mas experiencia al volante ;D Cuando me saque el carnet haré todo lo posible para conseguir este coche https://t.co/mwkMwAqgcb @PlanetaRubius7u VALE @SalvadorRaya La calidad es muy importante Fuck it https://t.co/Pt3GVeyEbw @RowlandBirlem No encuentro ninguna tienda que la venda :( Llevo tiempo queriendo comprarme una almohada waifu, me he puesto a buscar y lo primero que me ha salido es esto. SOLD https://t.co/mbRGtMQBkV @tifanny_619 Los reyes estan siendo bastante boss🗿 @CandyCopper Senpai está orgulloso @rubenhuevon la historia se repite DESPUES DE 800 AÑOS, nuevo video! :D Un dia en la nieve con Rubius, con niños suizos rellenos de chocolate, caidas y fails varios. Mis navidades resumidas https://t.co/0ME6yNNQ9G Like y RT :) Tito Rubiuh ya ha vuelto de sus vacaciones 🗿 Esta noche tendreis video! Gracias por otro año increible. Os deseo lo mejor a todos y que seais felices este 2k18. Pronto nos vemos :) @AngyeFdez Hace mucho que no la veo 😭 peliculón @MaxiaJulia Laik La navidad no seria lo mismo sin estas 2 peliculs https://t.co/EYDw25rEmG @pucka_toushi @temasdehoy broooo :0 RT @pucka_toushi: Si @Rubiu5 lo ve, ya soy feliz &lt;3 @temasdehoy muchas gracias por esta dinámica!!! #EscuelaGamersFanArt https://t.co/GHGKb… Un dia como hoy, hace 6 años, creé el canal de \"elrubiusOMG\". Como pasa el tiempo. Y cuantas cosas hemos vivido juntos. Y cuantas quedan por vivir.\n\nಥ‿ಥ Nuevo video casiguapos! Unboxing de regalos muy fresco, con megafono y alcohol de vuestras tierras incluido :D https://t.co/ooOa0GNdU8 Like y RT para que no acabe siendo un alcoholico! @1FallenRainbow Resumiendo: un fail en lo que no me interesaba, y en lo que si me interesaba bastante bien 🌝 @WhiteZunder 7, uno para cada dia de la semana Eso si, mañana tendreis video y hoy A LO MEJOR cae un directo heh :) Estoy estudiando a basto para el examen de conducir y preparando cosillas para navidas, asi que seguramente no haga muchos videos estas semanas 👀 @SmileCheeto ANONYMOUS LOCO @Deiakz Wat, pero cual es tu nombre xDD Shiet, parece que por temas legales o algo asi no se puede hacer desde latinoamerica D: CAMBIAD LA IP O ALGO! SED CREATIVOS! He hecho una cosa guay con Sony y Jumanji donde digo vuestro nombre (100% real no fake) gracias a una tecnologia de algoritmos super-futurista 🗿 Teneis que probarlo &gt; https://t.co/qxCtBrmQbV https://t.co/rCZRK1MCTd @ustftselena Me encantan las 2, pero los alemanes le dan un toque muy especial a las cosas ^^ @RebecaCapellavB Esa peli mola mucho para verla en navidad :D @gurdian1260 QUE VENGAN https://t.co/ARUCfIwzNM @rubiuspulento Viendo Dark lmao Dark &gt;&gt;&gt; Stranger Things https://t.co/BwJos053t4 No se de donde ha salido tanto amor hoy pero gracias por todos los mensajes bonitos! Será la navidad (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧ ojkiero. viva la pepa. SIMS 4 GOGOGO https://t.co/XN3ntL8wg7 @Jhulicraft03 Dentro de 1 horita mas o menos Esta noche se viene directo de... chan chan... LOS SIMS. Empezaremos una vida nueva llena de amores, salseos, engaños y mas cosas 🌝 Se va a liar lmao @StarWarsSpain HYPE! quien ha hecho esto https://t.co/CUqtpuykFo Nuevo video queridos seres! :D Volvemos con las judias asquerosas... Pero esta vez, con sabores nuevos (el de la Mofeta casi me mata) https://t.co/yBvSHY9dvj Like y RT! :D @auronplay Me cago en mi estampa y en twitter. Voy. Dioooooos pero como no habia subido esto antes? PERUUUUUU EEEEEEEE OOOOOOOOOOOOOOH https://t.co/7mGqAGumN3 Estoy adentrándome en la parte oscura y olvidada de mi carrete https://t.co/piylPYMkuN @ErickGuize Jeg vet det 🤔 Acabo de encontrar este video de cuando me teñí el pelo. Echo un poquito de menos ser emo-kpop-wannabe 🤔 https://t.co/u0hMrMts7E @regionalatrabos Paciencia, joven padawan La ultima pagina de Escuela de Gamers :) https://t.co/pElZKu3j9z @Annamarynets Enjoy! &lt;3 En 2 minutos empieza el directo en YT. La bestia... está DESPERTANDO. RAWR https://t.co/ToyZnSH5S9 Ya estoy algo mejor, asi que esta noche directito para celebrar! (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧ Yasss https://t.co/PUx1DQPiPF @rubiuspisco &lt;3 @SrFortfast @GoogleES ha puesto la lista en su twitter, creo que es de fiar 🤔 El video de Tripaloski está en el puesto 3 de videos mas virales del año en Youtube España. El poder de Dimitri es demasiado fuerte 🗿https://t.co/U3tc1MYpPt @EricRod43158954 Ya sabia yo que tantas hamburguesas me iban a pasar factura @mangelrogel Hay que volver a verla @dearrubencio @mangelrogel he estado con fiebre estos dias pero ya me estoy poniendo mejor ^^ Nuevo video mis queridos seres! Llorando de la risa con el \"nuevo\" Gang Beasts :'D Gracias @mangelrogel por ser mal/buen amigo https://t.co/sFCCWso79Z Like y RT! :D @Galletuetue omg, ese dibujo de @mangelrogel te lo hizo @LolitaAldea ?? mola demasié. PD: espero poder firmartelo yo tb :D @Srcheeto WISCONS Como no le voy a querer https://t.co/BcQJ0CfB3C @NEOB4NZ Lince, tigre, tsunami, maremoto, volcán, titán, poseidon @turubianyn04 il tiriri ti li pidris ivir kididi piri ti https://t.co/dLrqoYvaMR @Luuu_Doblas Y pterodáctilo Que pasa crack, maquina, fiera, jefe, tifón, numero 1, figura, mostro, mastodonte, toro, furia, ciclón, tornado, artista, fenómeno, campeón, maestro, torero, socio Nuevo video humanos! Queriais volver a verme sufrir, pues aqui teneis... Volvemos al Getting over it T_T Menos mal que tengo a Wilson para abrazarle y llorar https://t.co/kB2R6gVn1m Like y RT! :D Me acabo de dar cuenta de que le han salido tetas El rey del castillo https://t.co/hHtkwXgIft Muchas gracias por todo el amor que demostrais cada dia. No suelo decirlo tanto como deberia pero gracias, me haceis muy feliz :) https://t.co/qYD1rNwa8w Pasandolo fresco con los ganadores del concurso de Fanta! Menudos caretos llevamos locco 🌝 #fantabyus https://t.co/IAG4BpfHR2 @itsool Hablé con twitter y todo para que le devolvieran la cuenta y pasaron de mi culo 😞 RIP RubiusArmy, best cuenta Ha sido una bonita noche. Gracias a todos por estar en el directo y jugando conmigo &lt;3 (MENOS AL HACKER. AL HACKER QUE LE DEN POR CULO. UN SALUDO) Emmm, teneis que ver esto xD Estoy en directo haciendo una fiesta virtual en GTA V con Subs, barcos y frutas https://t.co/7eRB0anSwF @mangelrogel Xdddd Se te ve jodido @mangelrogel estas bien? https://t.co/3zCl3Whdd6 Quiero agradecer publicamente a mi madre por ayudarme a limpiar la casa despues del experimento. Contestad a este twitt con un “Gracias Madre” 👏 Broooo, 5 millones de visitas en 23 horas oh ma gah O_o https://t.co/MBiU01kIMa RT @MarcosEC7: @Rubiu5 El mejor video del canal sin duda. Muy top! https://t.co/kmoodldnvd RT @marcmarquez93: @Rubiu5 Estas muy loco tio! Momento TOP; cuando te sale el guante volando jajajjja.. 🙌🏽🔝😂 @marcmarquez93 Jajaja, FUCK YEAH SCIENCE! RT @xHeyBruhx: @Rubiu5 TODO EL VÍDEO ESTABA ASÍ FUE LO MÁS VALIÓ LA PENA ESPERAR Y TODO https://t.co/SijLrhX2as Nuevo video! elCientifikusOMG ha vuelto. NUNCA MEZCLEIS NITROGENO LIQUIDO CON COCACOLA... https://t.co/evNNgcccEs Like y RT por la megaexplosión! :D @Jelmark6 COMPAÑERO QUE HACES AQUI! En unos minutos nuevo video. Vais a flipar xDD Mañana lo subo. Tiene que quedar perfecto 🤔 Siempre que veais que no estoy muy activo por aqui, es por que estoy preparando un video que va a ser pepino 🗿 Os va a explotar la cabeza con el siguiente @Sebacixl @mangelrogel Esto es muy cute :) RT @LolitaAldea: Otra firma de zombirella que a la pobre hacía tiempo que no le daba bolilla. No deja de alucinarme la cantidad de fanarts… @Rubiextrar &lt;3 RT @Rubiextrar: Hace tiempo quería dibujarte con ''tus hijos'' así que ojalá te guste ( y le guste a ellos jaja ) #elrubiusfanart @Rubiu5 W… @ladyonigiri_ Nice combo 🗿 @Cawita26 Llevo desde las 8 de la mañana sin parar! Estoy muerto 💀 Foto by mi madre. Gracias madre. https://t.co/gaDk6V0hQr No, esta no va a ser la voz de Mangel, tranquilos xD Alfonso ha estado para hacer de “coach” y guiarme en mi camino 🗿 También he estado en el estudio avanzando cosillas y viendo los nuevos personajes 😍 Esto va viento en popa! https://t.co/FfhYYNQ0iz @UstCool Me lleva hablando todo el dia y no me canso de escucharlo ☺️ Llevo todo el dia haciendo pruebas de doblaje de VH! Me esta costando mucho mas de lo que pensaba, pero he tenido la ayuda del gran Alfonso Vallés (voz de Solid Snake en MGS) #VirtualHeroLaSerie https://t.co/U41QHrxxlE @RubenxMau En Perú se supone que salió el 10 de este mes 🤔 Me han confirmado que Escuela de Gamers saldrá en Chile y Uruguay a principios de Diciembre =) En el resto del mundo ya está! Me alegra que os esté gustando tanto esta novela https://t.co/BobyCT5W7D Conduce con cuidado https://t.co/cS0aRhmTO2 RT @b7woo: Es una preciosidad 💓 A Ryuk le gusta mucho @Rubiu5 #EscuelaDeGamers https://t.co/sPEATxybit RT @ElAnadalu: Ya dispongo de toda esta gran colección que me a enganchado a la lectura, gracias por estas grandes aventuras @Rubiu5 #virtu… RT @Sailorfrix: ¡Al fin! #EscuelaDeGamers Aunque no es de pasta dura 😑 pero ya ni modos :'v https://t.co/NM5cOruvFS @PegboardNerds Kongen av EDM ^^^^^^^^ VIVAN LOS TOPOS LA CONCHA DE SU MADRE https://t.co/JDuwl9zulW 14 DE NOVIEMBRE DIA OFICIAL DEL TOPO JAJAJAJ me estoy descojonando por que he dicho “el dia del topo” en vez de “el dia de la marmota”(peliculon) en el video y me acabo de dar cuenta por los 800 comentarios al respecto Nuevo video! :D Despues de mucho tiempo, vuelve EMILY... y quiere jugar D: ESTAMOS JODIDOS https://t.co/oqCbdSQhWa Like y RT por el detalle que me han dejado los creadores del juego :) EL temazo que he puesto al principio del nuevo video os va a despertar ( ͡° ͜ʖ ͡°) Dentro de poco lo subo! @aLexBY11 @vegetta777 Con gambones a la plancha de entrante @vegetta777 No está el CPM para tirar cohetes @poke_santi pero bueno que tipo de estupefacientes se toma ash en esta pelicula? Doblaje Español confirmed https://t.co/IOnGozrEXs @moarjustin  https://t.co/0gxjrBv1HT @regionalatrabos ELLOS TIENEN LA CULPA Como joder la saga entera de Pokemon en 30 segundos https://t.co/4eV9hcjHHb @roblesdegracia HOOOOOOOLAAAAAAAAAAAAA!!!???!!! Que ricas las vitaminas del sol oye https://t.co/MONaxbXFIb @miireia21_10_16 @temasdehoy Te imaginas que mi personaje se hubiera ido con Harry? 🤔 @strxngeruben &lt;3 @mykingdoblas PUEDEN SER ESPAÑOLES QUE VIVEN FUERA DE ESPAÑA Y TENGAN OTRO HORARIO   (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧ @pau_flo26 Esta noche a lo mejor haga uno sorpresa ^^ si no mañana! @RickyEdit @Xbox_Spain Creo que no 🤔 OMFFFGGG me han mandado una Xbox One de Cuphead 😭😭😭 Es preciosa joder. THX https://t.co/51lD5OhQdj @JocelynLeons cute =) @jordiporn Soy una Criaturita del Pollón &lt;3 @jordiporn Me suscribo. @MariaFe091990 Bonita colección &lt;3 Gracias. @irukoart Deberias. Yo llevo una semana con el libro en casa y sigue oliendo igual de bien que el primer dia 🗿 @andrea110598 Comete un par de paginas, que dicen que huelen bien... a lo mejor saben igual de bien 🗿 Todo el mundo está diciendo lo mismo sobre el olor de las paginas de EDG! Creia que era el unico que lo habia notado (y esnifado 🤔) https://t.co/ADS83GF5K7 RT @SoyLaiaG: Ya en mis manos❤\nYa he empezado y de verdad, no puedo parar😄💕\nMagnificooo👑\n#EscuelaDeGamers \n@Rubiu5 https://t.co/oH8FGPjiFA RT @SandraCobosM: @Rubiu5 #EscueladeGamers ya es mio! https://t.co/GoIP3RZLeY @mangelrogel DEP :( @C_LizbethES Vamoooooo @drugsdoblas Esa es la gracia del libro. Nada es lo que parece a primera vista. @Zetlux Un poquito mas y ya estas en órbita 🤔 Doblar una hoja de papel 42 veces te llevaria hasta la luna. Y ejemplos así, muchos mas. #ScienceBitch #EscuelaDeGamers https://t.co/ItjNmfZOap @rubenftadrien De donde eres, te regalo uno 🗿 @ToxicKakeru1 Yeah. La tapa dura y brillante creo que estará en todo el mundo ^^ Hola, guapo ( ͡° ͜ʖ ͡°) https://t.co/YH61bODuCm Nuestra querida amiga... LA LLUVIA https://t.co/a8v0Nr12tO Padre? https://t.co/GZhYevAo55 Nuevo videouu! :D Mi primera vez haciendo EXPERIMENTOS CIENTIFICOS CASEROS MEGAPELIGROSOS. Ohmahga. Ningún Wilson ha sido dañado en el rodaje de este video https://t.co/mUDBfCyIqP Like y RT =) @abril_aka_queen Ya veeeeeeeeeeeeeeeeeeeeeeeeeee eeeeeeeeeeeee eeeeeeeeeeeeeeeeeeeeeeeeeee eeeeeeeeeeeee eeeeeeeeeeeeeeeeeeeeeeeeeee eeeeeeeeeeeee eeeeeeeeeeeeeeeeeeeeeeeeeee eeeeeeeeeeeee eeeeeeeeeeeeeeeeeeeeeeeeeee eeeeeeeeeeeee eeeeeeeeeeeeeeeeeeeeeeeeeee eeeeeeeeeeeee eeeeeeeeeeeeeeeeeeeeeees @ustftsalseo Nope, eso para el siguiente video :P Llevo muchos dias frustrado intentando grabar el nuevo video y siempre tenia problemas y fails por ser la primera vez que hago algo asi... Pero ya lo he conseguido hacer y ha quedado 10/10. Esta noche lo teneis :) @vesselftcelo PUM PUM Hola nena https://t.co/qlRReYjavM RT @dobIasbutera: x: Hey dicen que el examen está difícil\nr: dicin qui il iximin isti dificil\n\n*lee la primera pregunta*\nr: ... https://t.c… Nuevo video! El juego mas frustrante de toda mi carrera de YT.Voy a necesitar ayuda profesional despues de esto https://t.co/AXeWNZQU27 RT:) 10/10 https://t.co/YqXJAqk1ZD Id preparando las tetas para el video de hoy. Le estoy dando los ultimos toques para que quede divino 🗿 @ArrietaRavana En 2 dias te desuscribes de mi canal. Ha sido un placer tenerte. He puesto una cancion que me encantaba como alarma del despertador y he acabado detestandola. No cometais el mismo error que yo. Un saludo. @Warcraft THANK YOU. I LOVE YOU. @mangelrogel DIOOOO ME HA PILLAO Mangel está twitteando desde mi cuenta. Todo lo que diga es su culpa. https://t.co/I7XmBsn9E3 Rubius me está borrando los tuits desde el movil que alguien me ayudeeeeeeeeee Soy mangel y estoy en el twitter del mismisimo rubius. Celebrando el mejor Halloween de mi vida. @ustftsalseo naiiissss. Agradesco. Creo que ya se ha arreglado y está el directo completo. Podeis confirmarme que veis la intro? ^^ @Cawita26 lo leo todo desde las sombras @addictedtoruben i know ;) Demasiado bonito para ser verdad https://t.co/hJDtBtLZrR Ya casi empezamos. Vais a flipar con la intro lol Dentro de muy poco empezamos con el directo de Halloween! :D Id preparando palomitas y apagad las luces muahahah https://t.co/lPD063mJHi Hoy me he disfrazado de Rubius 2012. Terrorifico. Feliz Halloween 🎃🔥 https://t.co/ZQWi3VAZUF @mangelrogel  https://t.co/JNa7SJ8KGK @Sicknesslly ES VERDAD. Este tio sale en todo lo que me gusta para joderme la vida @Sicknesslly JAJAJAJ pensé lo mismo. Pero a este tio creo que le he visto mas veces, y tambien me deciais lo mismo, lo que no se es donde 🤔 Estoy enamorado de Stranger Things @LujanxDoblas Fuuuuck no me acordaba de esto https://t.co/XWVbKPkPAH https://t.co/XIxdRzEQuH RT @crydxblas: Separados al nacer https://t.co/k2sUEUxLGC Nuevo video! :D SUPER MARIO: LA ODISEA DEL MEME. Best Juego 2017. https://t.co/XWVbKPCqZh Like y RT! :) Youtube va un poco lentito hoy 🤔 No se procesa bien el video No estaba muerto, estaba editando. Dentro de poco video! ( ͡° ͜ʖ ͡°) @mangelrogel Esto se nos esta yendo de las manos RT @Sebacixl: Como pasa el tiempo ahre @Rubiu5 #EpicDirecto https://t.co/2BIv568q7p Creo que ha sido por los 8 millones de \"YEEEE BOIIII\" que han sonado al principio con las donaciones xdd casi me explota la cabeza El directo mas largo de mi putabida jaja. Gracias por estar &lt;3 Al principio estaba un poco nervioso/raro pero al final me he soltado 🤔 En 25 minutos empezamos con un juego muy chill ^^ https://t.co/blmuduFyXX @ust_Dunseph No, que empezare alrededor de esa hora 🗿 A las 21:30-22:00 empiezo el directo 🎷🐛 He configurado y añadido mierdas que harán que parezca un video editado... pero en directo 🤔 @prayforraspy Eso para Halloween 🗿 Que os parece que haga otro directo hoy 🤔🤔🤔 Gracias por todo el amor que estais demostrando estos dias =) Sois unos cracks-makinas-fieras-ciclones-jefes-figuras-genios-maestros. En 10 minutos empezamos el directo :D #EpicDirecto https://t.co/Y8chN8voez Esta noche hago un directo jugando de tranquis y respondiendo preguntas. Luego digo la hora 🗿 @Onlylovesong Ese es el plan. Pero tenemos que a hacer unas pruebas de doblaje y tal primero para ver como quedaria ^^ @_SugaSugaA Va a ser la cancion oficial del ending. Es perfecta para lo que queremos transmitir, y me encanta Porter :P Este es el nivel de detalle que le estamos metiendo a TODOS los personajes. #VirtualHeroLaSerie https://t.co/Z0MQm8AtWc RT @MovistarPlus: ¿Queréis estar en la charla de #VirtualHeroLaSerie con @Rubiu5 este sábado en el @Spoiler_Fest? 👉 https://t.co/nVEhAmYXWJ… Tabla de expresiones de Zombirella #VirtualHeroLaSerie https://t.co/QDr3jg8tQP @MovistarPlus guapos El sabado haré una presentación oficial con @MovistarPlus y el equipo en Madrid. Si quereis veniros, seguidles y daran mas info pronto ;) Muchas gracias por todas las cosas bonitas que nos estais diciendo :') Making of #VirtualHeroLaSerie https://t.co/0z3Zra0Fom @LolitaAldea Vamooooooh Fuck, estoy llorando Nuevo video! :D Despues de muchos años, por fin puedo compartir esto con vosotros :') Gracias muyayos https://t.co/uVuXjZ8nGf Like y RT&lt;3 Dentro de poco subo el video :D Mañana va a ser un bonito dia 🎷🐛 WTF en Alemania venden este queso 🤔🤔🤔 Pero lo mas fuerte es la marca que lo produce... St. Mang... Mangel... Rubius... QUE INTENTAN DECIRNOS https://t.co/GhXXu7OpA7 Increible esto que nos regalaron ayer! Sois unos artistas 😭 https://t.co/GgIoerMv5l @SmileMangel @JeffSquadMx Jajajaja no jodas. Ojala haberlo visto en directo 😭😭😭 gracias 🇦🇷&lt;3&lt;3&lt;3 Cuando vuelva a casa podré enseñaros por fin esa cosa en la que llevo trabajando durante varios años. Ya queda menosssss djsbdjshxlslwkfqksv Nuevo videooouu! :D Hacemos el Most Likely To con nuestras caras... Soy un mal amigo CONFIRMED https://t.co/gkSk6kpugU like y RT&lt;3 RT @Rubiu5: Meet and Greet peligroso https://t.co/1LEljZBEOG Lmao https://t.co/5CDZ4NENrO que pensara la gente que no me sigue y vea esto de portada de twitter 🤔 https://t.co/1Kx26tYOwV RT @mykingdoblas: @Rubiu5 TE ESPERABA DESDE HACE HORAS JAJAJA https://t.co/MwKUUnMCH6 @mykingdoblas Puto amo Meet and Greet peligroso https://t.co/1LEljZBEOG 🗿 https://t.co/9uSpT2og0P Tienen que ser preguntas tipo: \"Quien es mas propenso de los 3 a cortarse un pie por dinero\" Voy a grabar un Most Likely To con Alexba y Mangal, asi que mandadnos preguntas usando #RespondeMangelexbyius por ejemplo 🤔 @delfinapiriz Estamos en otro hotel :( Ayer fuimos ahi para hacer entrevistas y fotos, pero el resto de dias nos quedamos en otro @mangelrogel Rico chori @mangelrogel  https://t.co/yjOvwWN7TL Esta noche follo https://t.co/TnuHwVFNCh El sabado nos vemos Argentina!! :D Hyped as fuck. @ClubMediaFest https://t.co/5RplLBzWBS https://t.co/R3GfvL1927 @1_Nayer_4 Le he dado un mordisco  a Raspberry y me he sentido super mal xdd Me han recibido con esto en el hotel de Argentina 😭 muero de jamor. https://t.co/7weqiT0dC9 RT @Rubiu5: OMG. Acabo de hacer el mejor show de la historia. Dat energia. Gracias Perú. https://t.co/tAjwRHa5IX La fama y estas mierdas joden con tu mente mas de lo que nadie puede entender. Pero poco a poco creo que estoy aprendiendo. Y me alegro. Estaba triste y con problemas y no recuerdo por que, pero no era yo mismo. Ni con vosotros ni con mis amigos... Menos mal que he vuelto Hoy me he dado cuenta de lo raro que estuve en Mexico hace unos meses... lo siento mucho. Ojala poder volver atras en el tiempo OMG. Acabo de hacer el mejor show de la historia. Dat energia. Gracias Perú. https://t.co/tAjwRHa5IX @mangelrogel  https://t.co/XWLCo5smY4 Nuevo vlog de nuestro viaje a Perú! :D Nos escoltan como a presidentes, locuras en el hotel y moarrrr https://t.co/6B8jixX8pX Like y RT&lt;3 \"Es un chico especial, pero le quiero.\" https://t.co/vPvsEUcJLZ Nos han escoltado como 4 motos de policia (las tipicas que llevan los presidentes) desde el aeropuerto hasta el hotel lmao Gracias Perú por el bonito recibimiento &lt;3 La primera vez que no he estado al borde de la muerte en un aeropuerto jajaja https://t.co/qXWiUQH2Vw @aLexBY11 Pondré tu cancion en tu honor ✊️ mejorate niño Nuevo video muyayos! Sorry por la tardanza :'D Jugando...AL JUEGO MAS DIFICIL (y bonito) DE LA HISTORIA? https://t.co/Bi3VPFlJTP Like y RT:3 RT @Rubiu5: Nuevo videouuuu! Me invitan a una fiesta privada de Youtube, unboxing de la Super Nintendo mini y moaar https://t.co/YckWMBw1dk… Que ganas del show en Peru en unos dias! Estamos preparando un set de musica y luces/visuales brutal ;) see ya soon bois @entelmediafest @Srcheeto :( La triple papada está a punto de evolucionar a su forma final. https://t.co/dkjTMjdTKQ Nuevo videouuuu! Me invitan a una fiesta privada de Youtube, unboxing de la Super Nintendo mini y moaar https://t.co/YckWMBw1dk Like y RT!:) @MariaBelen413 Las 2 cosas Ayer hice un directo en insta abriendo sobres y me tocó Cristiano Ronal... NANI?!?! https://t.co/Zac0GTdKkZ El taxista nos ha puesto la cancion de Shrek. Que puto amo. https://t.co/ZNvkeBCjMw @auronplay Es verdad xddd La vida de youtuber https://t.co/8TYG6mVOay El Dream Team Lamentable volverá pronto ( ͡° ͜ʖ ͡°) #FC5Reality2 https://t.co/UksaNT9xFz Nuevo video bitchezz! :D VUELVEN LAS GRAJEAS ASQUEROSAS. Cada vez que pierdo... Me como una... D: https://t.co/RGSiyCccYd Like y RT :) @mangelrogel De tu envidia nacen mis ponchos Tengo un nuevo poncho y es la polla. Parezco un vendedor de pociones deambulante del zelda o algo https://t.co/CpGdzbeKXj @Ubisoft_Spain @Sr_Ubisoft &lt;3 Cuando eres Pay 2 Win https://t.co/HITydaaPV3 Son de los videos que mas me ha gustado hacer este año. Fuuuuuck necesito volver pronto Es increible todo el amor que le habeis dado a los vlogs de Japon. Ojala vivir ahi y hacer ese tipo de videos siempre :') No dejo de decir \"VALE\" todo el puto rato en mis videos y me pone de los nervios vale pero no puedo arreglarlo por que soy asi vale Yeee! Nuevo video :D Vlog en Realidad Virtual con Rick y Morty. Estar tanto tiempo en el espacio me ha afectado lol https://t.co/D7lnUZ0BIx Dentro de poco subo video! Contad hasta 600 mas o menos y estará @featbatracia Son de mi madre Quien quiere un poco ( ͡° ͜ʖ ͡°) https://t.co/YWZxAHng6d Mi querido abuelo de Noruega ha venido a visitarnos :D https://t.co/08j0juAcZo @antoniobanderas Solo si después vemos Spy Kids y Shrek juntos! Llevo 2 años trabajando en algo muy grande y ya queda menos para que os lo pueda enseñar. Que ganas :) Cuando intentas alimentar a Bambi https://t.co/454s2yxZGM Despues de las cosas que estoy leyendo en los comments sobre las cafeterias de búhos, me siento mal por haber ido... RT @Garofano16: Dibujo del último vlog de Japón, espero que te guste &lt;33 @Rubiu5\n#elrubiusfanart https://t.co/cHoPPhFRi7 Nuevo video shurmanos! Ultimo vlog de Japón, con ciervos asesinos, una casa paranormal y moar https://t.co/dw40NlpjLN Like y RT!:D @mangelrogel 1 pa 1 sin camiseta cuando quieras, te fundo @AngyeFdez @InesusTwittah &lt;3 RT @InesusTwittah: @Rubiu5 POR FIN TENGO LA AGENDA DE VH! Nada mas levantarme me ha llegado, es el mejor regalo para empezar 1BACH y por fi… @dxblasmxngel Algo parecido 🌝 Mañana video. Hoy dormir. @auronplay *DING DING DING DING DING DING DING DING* @nadokyze fuck that bitch. 3 arañazos me he llevado intentando darle mimos al llegar a casa. De vuelta a casa. Ya echaba de menos a esta bola de pelo &lt;3 https://t.co/gSZWrSsKlp @Abraham0estrada Si vieras South Park pensarias lo contrario. Estos tios son unos genios En el nuevo juego de South Park, si te creas a un personaje negro se te pone la dificultad del juego en Muy Dificil. Juego del año? https://t.co/jwOh99p3dr RT @linkinpark: Thank you to our fans from around the world for your outpouring of love and support. https://t.co/W0idQCmt8G Madre mia lo de Mexico. Espero que esteis bien 😔 un abrazo @yoshimcpijas Oh dioses @exsorz Me lo apunto para el proximo 🤔 La agenda de VH de este año tiene el mejor diseño de la historia. Nunca me canso de verla 🔥 https://t.co/VO5PObT77b RT @Rubiu5: Nuevo video! :D Visitamos una cafeteria kawaii en donde pasan cosas extrañas... El dia mas feliz de mi vida https://t.co/3FTtDc… Nuevo video! :D Visitamos una cafeteria kawaii en donde pasan cosas extrañas... El dia mas feliz de mi vida https://t.co/3FTtDcdwdS RT&lt;3 @mangelrogel Enhorabuena 👏👏 RT @mangelrogel: Me han hecho una entrevista en GQ. En el proximo número sale :) https://t.co/zdbkUE7OZ3 @Nohewivlog &lt;3 He encontrado un manga de Rubelangel en la seccion de hentai https://t.co/OnYOMs29yQ @LokisplayHD lol En Japón hay instrucciones de como usar el retrete correctamente, por si tenias tus dudas 🤔 https://t.co/BcVL6W2VwW RT @vegetta777: La mejor foto de la historia con @WillyrexYT @mangelrogel @aLexBY11 @Rubiu5 http://t.co/bMxjUXHb9t Hemos acabado a hostias. Pero ya estamos en paz y nos hemos ido cada uno por nuestro camino. Me acaba de morder un ciervo :&lt; RT @PlanetaRubius7u: Mientras tanto, en un mundo paralelo...\n@Rubiu5 https://t.co/MDUMHSIhi5 Initial D boisss 頭文字D https://t.co/gKT8O4MTMt 青 https://t.co/VKkVAocW8Q RT @Rubiu5: Nuevo video finally! :D Mi gran aventura en Japón, medio bizco, bombas nucleares y Waifus https://t.co/WbVoYy7VDh Like y RT&lt;3 @yoshimcpijas @iriva_ &lt;3 RT @MobNature: Algunos doodles del vlog de japon, espero que les guste🌸 @Rubiu5 https://t.co/JO17isN2kO Nuevo video finally! :D Mi gran aventura en Japón, medio bizco, bombas nucleares y Waifus https://t.co/WbVoYy7VDh Like y RT&lt;3 Mañana por fin subo video! :D El interné en Japón va mucho mas lento de lo que pensaba 🤔🤔🤔 @larubiade_niall Algo mejor &lt;3 pero tengo que llevar gafas de sol all day Nani? https://t.co/gTGj3oY9s3 RT @PlsMela: @Rubiu5 no puede ser jahajajajajajaja https://t.co/81zmcAZbwI Pues me he rasgado la cornea del ojo y justo mañana me voy a Japon. Gracias vida por putearme. https://t.co/yT1GGHauRk Tengo miedo de ver la peli de Death Note. Tan mala es? 🗿 Hasta la semana que viene no habrá videos, sorry. Portaros bien hasta entonces 🎷🐛 @RubiuhOmaiGad @AfterSunglasses @Rocio_SanDel Fresssshhhhh Ya echaba de menos el choripan, el fernet, los pelotudos y los ahres Dentro de poco vuelvo a mi querida Argentina. Os he echado de menos &lt;3 https://t.co/3zr5pVhy2Z RT @Tanner_Pfaff: Pictures from NASA of the Eclipse #Eclipse2017 https://t.co/pKuoV37cE2 @iLeoVlogs Me he asustado por un momento xD @VincenHD  https://t.co/7iYGrRP7Cj @VincenHD Lo veo posible si se consigue importar el mismo modelo 3D de la cabeza y las manos de Morty en todos los juegos. @CrakerMc Esto lo he visto pero hace falta un espacio gigante y llenar todas las paredes de green screens. Algun dia lo probare si puedo Si hay algun programador que consigue hacerlo, que suba un vid a YT demostrandolo y me pondré en contacto con el. Pasadmelo usando #RubiusVR Lo digo totalmente en serio Estoy dispuesto a pagar bastante dinero a quien cree un mod de la \"camara vlog\" que funcione en todos los juegos de VR. Nuevo video! :D El futuro de Youtube ya está aqui. Mi primer vlog en VR con Rick y Morty https://t.co/6idK50R3Vi Like y RT&lt;3 @JoseOrtegaWayne No, pero me lo apunto 🤔 El video que voy a subir hoy es algo bastante revolucionario y que no se ha hecho antes. El futuro de Youtube diria yo 🗿 #hype @Lizeth_Dayhan Si, tengo depresión postparto ᴘ ɪ ɴ ɢ   ᴘ ᴏ ɴ ɢ   ʙ ᴏ ɪ s https://t.co/KCSvsfU5tE Muchos animos a todos los que habeis sido afectados por lo que ha pasado estos ultimos dias Pronto nos veremos Perú &lt;3 https://t.co/5VIqNRrFzp ✊️ RT @doblasftdixon: •Rᴜʙɪᴜs ᴀs ʀɪᴄᴋ ᴀɴᴅ ᴍᴏʀᴛʏ• \n\nHace muchísimo tiempo quería dibujante al estilo rick y morty, espero que te guste! @Rubiu5… Nuevo video! :D Vuelvo a perder mi mierda en The Joy of Creation, este juego va a acabar conmigo xD https://t.co/nVuwSj7Upq Like y RT:3 Que guay este rap que me ha hecho Krono! :D NI NO NI NO NI! https://t.co/b3nGsfmcRj Me alegra por que es uno de mis videos favoritos de este año :D Igual que el de Tripaloski. good shieeet 1 millón de likes en el video de la portería\nO_____________O\nPocas veces se ve esto https://t.co/6XbLQHcXid https://t.co/GccDhMDN19 RT @_ToxiCute_: Sakura de Virtual Hero :3c @Rubiu5 #elrubiusfanart #virtualhero https://t.co/1Lv316rPmF @_ToxiCute_ acabo de ver esto en 2017 buscando fanarts de VH :'D 10/10 Esta guapa la nueva temporada de Naruto https://t.co/f3tmRAJu5P RT @Jishwaxty: Eres el Naruto auténtico. @Rubiu5 https://t.co/ZITxibNLCs @UstUst28 Lmao 100.000 Likes en 20 minutos O_O Esto es un record, holy shit RT @gali_galii: @Rubiu5 Tenía que hacerlo https://t.co/bbnsDLDhnP Nuevo video!! :D Haciendo el PORTERIA CHALLENGE con mis hamijos. Ojo a los trickshots lol  https://t.co/AoPZ8jJVJT Like y RT :) Efectivamente son las 8 y aqui sigo editando 🗿 @LaAlturaDxAlex sorry &lt;3 Ya me veo que hasta las 8 de la mañana no termino de editar https://t.co/BWCdLkCvId Lmao, le has puesto una tostada encima del gato? 🤔🤔🤔 https://t.co/tDhlErd0E1 He estado todo el dia grabando un video con mis hamijos en la vida real 🌝 Va a estar muy fresco Se queda. https://t.co/HADQOBGnb7 @hunter99yt Xddd RT @hunter99yt: Inevitable no hacerlo @Rubiu5 https://t.co/xT1M0SAooC Nuevo video! :D Mi paciencia finalmente se va a la mierda, POR QUE VUELVO A JUGAR A ESTO https://t.co/AgePHfro1B Like y RT&lt;3 @Kawaii_Panditas de Reaper! @elomgsquad @ElBlancoOMG @ElPeliverdeOMG @ElpeliblancoOMG @ElverdeKkOMG @elazulejoomg @ElazulinOMG @elmaincraOMG @elflchipllsOMG @ElMelangasOMG @elfresaOMG @ElmexicanoOmg @ChocolatesOmg @ElTrumpOmg Continua, por favor @LaprimeraM Es ironico 🗿 Esto sigue siendo un temazo https://t.co/4SoZH4yw0a @mangelrogel lo estoy conectando y desconectando todo el rato https://t.co/2HDdVLEo1c WTF, que hace mi cara en una serie estadounidense de Disney Channel O_o https://t.co/1EdRuQXCwZ @mrdrow18 cabrones ಠ_ಠ Ultima vez que me fio de vuestros comentarios https://t.co/qDWmnympyU @seandnothing gg wp https://t.co/wgqMxZ1XMn @KikiFutFifa Ya deberia de haberle llegado el video que le mandé ^^ Nuevo video muyayos! :D Vuelve The Joy of Creation (FNAF) y esta vez mi paciencia se va a la mierda. https://t.co/pTGa75jET5 Like y RT&lt;3 @filippo0674 eso nunca cambiará Despues de 4 años, por fin me he cambiado el banner de mi canal ¯\\_(ツ)_/¯ https://t.co/EA7z7qFxhI Espero que tengas un bonito día (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧ Feliz dia del Mostacho a todos. Happy #MoustacheDay https://t.co/30yhTUhz5n @amoalrok Llevo desde que subí el video borrando y bloqueando a los bots pero ahi siguen los cabrones xd @httpsxmyidols @AkiToyJs TIENES RAZÓN MALDITA SEA @AkiToyJs EN EL TITULO DE ESE VIDEO PONIA QUE ERA TÉ, ECHALE LA CULPA AL QUE LO SUBIO AHRE AHRE AHRE Nuevo video! Adivina el final inesperado CHALLENGE. Esas skills con la flauta jojo... https://t.co/wP1zL69cjB Like y RT&lt;3 Video fresco INCOMING ( ͡° ͜ʖ ͡°) @mangelrogel  https://t.co/eAI04HmvZY @mangelrogel  https://t.co/rWDVxkYoeK Por fin le encontré sentido a mi vida https://t.co/tJF25R5QfT @24Vlogs @aLexBY11 😘 @Caith_Sith Lo intente buscar en Steam pero creo que lo quitaron 🤔 El mejor siempre será el Spider Man 2 de PS2 @FlexZCoD  https://t.co/lICOurdcJX Ahora tengo unas ganas infinitas de que salga ya el juego de PS4 D:! La nueva peli de Spider Man esta guapisima. La mejor de Spidey (y eso que le tengo mucho cariño a las primeras 🗿) Rubius 2013.... eres tu? 🤔🤔🤔🤔 https://t.co/rfS4CS7Nco Cuando vas al peluquero pero no tienes una idea muy clara de como quieres que te lo corte 🤔 https://t.co/wcd8H7fnvn Ya va siendo hora de que me corte este gato muerto que tengo por pelo 🗿 Consejo de amigo: No salgais a la calle hoy. Y menos de negro 🤔 https://t.co/tXglXqb8Ad @yoshimcpijas Shingeki no Mahe @Fackyuss Xddd @GatoCurioso77 @eltivipata @auronplay @igualize @nikablogs @BernyAme @ExpertoIgualdad @ZormanVideos @mangelrogel @Wismichu @fcarreras Gracias! RT @Garofano16: Dibujo de @Rubiu5 terminado!! Espero que te guste❤ #elrubiusfanart \n[RT!!💙] https://t.co/fkH06tVmb4 @Gato_Sensual1 @Fanta_Esp 10/10 @GatoCurioso77 @eltivipata @auronplay @igualize @nikablogs @BernyAme @ExpertoIgualdad @ZormanVideos @mangelrogel @Wismichu No se como ponerme en contacto con la familia :( No tienen cuenta de twitter o algo? En FB tampoco los encuentro Nuevo video humanos! 10.000 Jedis contra dinosaurios, zombies y gallinas. Esto... no va acabar bien lulz https://t.co/Sy1ZBZ29fm Like y RT:D @mangelrogel  https://t.co/2GHbfwT9kX Pues nope, nuevo video mañana ¯\\_(ツ)_/¯ Nuevo video TUNAIT ( ͡° ͜ʖ ͡°) @ElyShuri Despues de 7 años en la Horda me acabo de dar cuenta de lo engañado que he estado toda mi vida 🤔🤔🤔 @BersGamer En que server estas que te reviento 🗿 @PekePornstar Nadie quiere ver videos de WoW en YT 🤔 @Negriza26 Not bad @BlackEspanolito Lo he vendido por una montura del wow xdd Resumen de mi verano https://t.co/FCApjs6M5o Nuevo video! :D Vais a flipar con este juego de FNAF. Apagad las luces. PD: Mensaje importante inside https://t.co/B1jO6w56hk Like y RT&lt;3 Iba a subir video hoy pero lo voy a tener que dejar para mañana, quiero que quede perfecto :) Mañana nos vemos juapos! RT @mikeshinoda: Shocked and heartbroken, but it's true.  An official statement will come out as soon as we have one. Estoy en shock. No sabeis lo importante que es y ha sido para mi Linkin Park en mi vida. No me lo creo. Descansa en paz Chester. Espero que la noticia de Chester Bennington sea fake. Por favor. Esto no puede estar pasando Ese remix fresco de Britney Spears tho https://t.co/mHw7J0nuEo https://t.co/4afSn8kp6l RT @Rubiu5: Ya somos #25MillonesDeCriaturitas en la mejor familia de internet. i lof u. https://t.co/0udaKqvGpO Ya somos #25MillonesDeCriaturitas en la mejor familia de internet. i lof u. https://t.co/0udaKqvGpO Nuevo vid! :D Sobreviviendo contra suscriptores zombies en PUGB. La parte final con Mangel es 10/10 lmao https://t.co/mHw7J0nuEo Like y RT&lt;3 me mola mazo como esta quedando la miniatura del nuevo video :D dentro de poco se sube! https://t.co/BIh3RYHYhU @mangelrogel Se nota que me he vuelto a bajar la app eh @Yaruto29 El fin se acerca \"Moar, human\" https://t.co/EOXniUN97P wtf https://t.co/mh26EGMMan Nuevo boss de Dark Souls confirmed https://t.co/DuA41uyczt Me encantan los nuevos diseños de Sora, Goofy y Donald en el mundo de Toy Story #KH3 https://t.co/RmrzFqz2Y2 @mangelrogel te voy a empezar a cobrar por hacertelas hijueputa @mangelrogel pa eso estamos @auronplay nuestra vida resumida https://t.co/mBkn18KaOJ @auronplay Me descojono lel https://t.co/u6CwvTH40v @Mega_Glowen A veces si 🤔🤔🤔 2012 https://t.co/KearYzkw97 @Doblas_0115 Lo he tenido que dejar al lado de la ventana para que le diera el sol! Sigue vivo :D Nuevo video! HA LLEGADO EL MOMENTO DE RECUPERAR MI TESORO. Ping Pong vs Alexby en VR BIAAAAATCH  https://t.co/Jqp3bJGYLD Like y RT&lt;3 El video de hoy tratará sobre... LA VENGANZA https://t.co/J8xzfKqc0E @Soledad_1998 Salchicho is life :D https://t.co/9uqSAeZuXS @Generik_boy  https://t.co/SL94HWAicw Intentando hacer una broma que no ofenda a nadie en 2016 vs hacer lo mismo en 2017 https://t.co/qU8EYRW4qo @mahedobls pues te quedan fresh ;D De momento me sigue gustando mas mi avatar xd Cuando encuentre el definitivo me lo cambiare sin avisar ( ͡° ͜ʖ ͡°) RT @zukarts: Mi #Fanart de #elrubius - \"El Hijo del Dragon\" \nMírala en Deviantart: https://t.co/RuvhTDUBfD https://t.co/KaICqedi28 @zukarts Omg @SmileOfLuzu que pereza Mandadme icons nuevos que esten frescos, y si me gustan me cambio la foto de perfil en twitah &gt; #newiconrubiuh (si son fanart mejor) POR QUE OS HABEIS PUESTO TODOS DE ACUERDO CON QUE ME CAMBIE MI FOTO DE PERFIL? 🤔🤔🤔🤔🤔🤔🤔🤔 @ZellenDust Dios Malcolm, hace mazo que no la veo. Ojala estuviera en netflix D: @Maro1405 si eres de españa, deberian estar en varios centros comerciales, a Latam no se si han llegado todavia 🤔 Nunca me canso de ver Friends @pasidoblxs La edicion normal es mas rollo Rayban, la otra tiene las lentes mas anchas. A mi me gustan mas las normales ;) @BlackEspanolito @RickyNumberFive La gorra en persona esta mucho mejor que en las fotos Son edición muy limitada, asi que si las quereis os recomiendo ser rapidos like the wind @BlackEspanolito Yee boii, quieres unas? 🌝 He diseñado estas gafas con Brock Hofer (creador de las skins HyperBeast del Counter Strike) y han quedado 10/10 😎https://t.co/O95zeLWUko https://t.co/y4cs9KEXaD Me alegro de que el video de ayer os haya gustado tanto :D https://t.co/a9G2gUwQ7Q @Bonifacia__ Estan fresquisimas 🗿 @meliftytbrs yeah :D YA ESTÁ! Unboxing de regalos de Mexico, Wilson el inspector y el perro del infierno :D https://t.co/8ANIHypFYd Like y RT&lt;3 llevo 1 hora esperando a que se suba el video https://t.co/j4am1MFjDv El video se esta procesando, YT va un poco lento hoy! @Fwiz @MaruchiGames @InaGames Olé @MariaBelen413 Lo es Teneis que ver esta pelicula: \"Okja\" https://t.co/jQjtaDklE3 @spookyeren TWITTER VA DEL ORTO @Limon4kftPasiva SI mañana video https://t.co/AF9cuiWMMx @KNekro donde hay que firmar menuda paliza xD voy a pedirle ayuda a mahe para la siguiente partida, iros uniendo al server! Os necesito para grabar un video muy fresco, meteros al PlayerUnknowns al server de RUBIUS ZOMBIES (contraseña: lmao) TODOS CONTRA MI Gracias @realDonaldTrump https://t.co/OPPYfw3Aw8 Aqui os dejo el nuevo video! :D La tostada del infierno pondrá a prueba mi paciencia en este simulador https://t.co/u7TN85ZOXr Like y RT&lt;3 Acabo de peinar a Raspy y mirad ese bolápide de pelo O___O bruh. parece que ha adelgazado y todo https://t.co/tNUOGGiOP3 Ya estoy mas animado casiguapos. Esta noche habrá video ( ͡° ͜ʖ ͡°) @PlayStationES ponedla en venta por el amor de dios @Renatofabrizio4 SAAAAAAAAaaaaaah Y recordad chicos, se dice Wingardium LevioSÁAAAAaaaah @ihopeusmile Que wonito Menudo culito me hace el traje compañero 🗿🗿🗿 Mangel y yo creamos un traje con superpoderes como el de Spidey y FUNCIONA :D https://t.co/4iiCJvzV7J Fui yo, lo reconozco. https://t.co/SwT2W4QD5p Ya nunca volvere a escuchar \"sigue con el outlast rubius :v\" FINAL 10/10. Gracias por acompañarme casiguapos &lt;3 en 4 minutos outlast https://t.co/kxd7l95h4C En unos minutos nos vemos en el siguiente directo &lt;3 https://t.co/D0JU98yFWQ A las 21:35 empezamos! :D (en 15 min masomenoh) Mandad vuestras preguntas cuando empiece a #PreguntaRubiuh https://t.co/bE5dn4DfoN DE HECHO, ESTOY POR HACER 2 ( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°) estoy por hacer un directo esta noche ( ͡° ͜ʖ ͡°) Doggo https://t.co/FIs4VNMHH7 Siempre que vuelvo a casa despues de un viaje tan largo me tiro un tiempo deprimido y nostalgico y no se por que D: \"Pintame como a una de tus mujeres francesas\" https://t.co/Pb6UPY3gP4 RT @Rubiu5: Nuevo video humanoides! :D El festival mas epico de la historia, Gafas LED, Esnifando oxigeno y moar! Dat intro https://t.co/qH… RT @moralsubversiva: @Rubiu5 lo que tú ves vs lo que ella ve https://t.co/EIl41hy3WN @maariafernande3 Lo estaba intentando RT @CabezaDeUnicorn: @Rubiu5 Lo que tu ves vs Lo que ella ve https://t.co/G4jAH1tQnS @Danzkills Vale Nuevo video humanoides! :D El festival mas epico de la historia, Gafas LED, Esnifando oxigeno y moar! Dat intro https://t.co/qHNC0341gn RT&lt;3 Se me esta poniendo la piel de gallina editando el ultimo vlog RT @proudofdoblas: @Rubiu5 lo que tu ves vs lo que el ve https://t.co/6dTCGgvxVD Lo que tu ves VS lo que ella ve https://t.co/yCWn2xoIS7 Lo que tu ves VS lo que ella ve https://t.co/KvCWbI0CsI Mañana vuelvo :) Creo que la espera va a merecer la pena. No estaba muerto, estaba de parranda. @mangelrogel Acordamos nunca hablar de eso en redes sociales 🗿 El otro dia vi en el festival al Hombre de Jengibre metiendole lengua a una hembra y bailando en la droga. bye bye mi infancia https://t.co/SeR1k9JI5T E3 2017 https://t.co/rg2zTn0mza @TGRG21 Yeah, me los van a mandar a españa ^^ cuando los reciba hago el vid! Nuevo video humanoides! :D Vlog del E3, Los Angeles, vendedor de spinners y juegos guays! https://t.co/79mdlNbWPQ Like y RT&lt;3 AIUDA #MarioRabbids https://t.co/kW9vdQ7L9J No vuelvo a beber en mi vida Ayer estuvimos de fiesta con Kojima &lt;3 (fangirleando) https://t.co/0gFSRYeO2I @Fwiz Mah boiiii RT @yoshimcpijas: Te mirabas divino de la muerte con gafas, ¡no te las quites nunca senpai!\n#elrubiusfanart @Rubiu5 https://t.co/pCOOZrH1op L.A. BOYZ https://t.co/Mg2wjSQT3W RT @sichutrotu: Gracias por venir aquí &lt;3 México los ama! #CMF2017 https://t.co/gulpFexxCY @Ubisoft_Spain @richar1979BC @Perxitaa @aLexBY11 @Sarinha_3 @mangelrogel @Sr_Ubisoft @XxStratusxX @SrSerpiente1 @HDluh Vamooooooh Gracias por todo el amor México. Ya nos vamos. Espero poder volver algun dia :) https://t.co/1EDwkeMeOs &lt;3 https://t.co/DY3rVNeZrk @ElvisaYM @YellowMellowMG @MCadepe *gemelillas :)* @MCadepe @ElvisaYM @YellowMellowMG Cuidado con quien te vas a la cama a partir de ahora 🗿🗿🗿 @LMMC_7 Mañana intentare bajar otra vez. Los de seguridad no me dejan salir :( @ihopeusmile &lt;3 @Srcheeto Por que coño te pareces a Spielbergo https://t.co/pOUT0TqWTu @UstFtSofia 10/10 @mangelrogel  https://t.co/ltHmszQkmL No entiendo como sigo vivo RT @Rubiu5: Nuevo vlog! :D Casi morimos en el aeropuerto con los miles de fanses de México... D: miedo. AY AY AYYYY! https://t.co/CYpmHTjwz… @MangelftUke @pewdiccpie BAJO DENTRO DE POCO Nuevo vlog! :D Casi morimos en el aeropuerto con los miles de fanses de México... D: miedo. AY AY AYYYY! https://t.co/CYpmHTjwzG Likey RT&lt;3 @jose_miguelpch CUANDO VUELVA A ESPAÑA. LO JURO. Dentro de poco subo el vlog sobre la locura que pasó en el aeropuerto de Mexico y mas cosas. HAYYYP Con los ultimos heroes que quedan despiertos esperando en el hotel &lt;3 Se nota el cansancio en nuestras caras #RIP https://t.co/St4HtQ5xSS @gunsfordoblas FALOCIDADES MATIAS (Si salen cosas raras en la foto es por que la intenté sacar en panoramico y fue un poco fail xd) Con la gente kawaii de MEEEEEXICO AY AY AY AYYYY! https://t.co/STBlhLBhlA HOLA MEXICO COMO NO TE VOY A QUERER SU PUTA MADRE ES VERDAD. QUE MAL ROLLO TU DDDD: Que es??? https://t.co/wSRNnstvTV @asunavanilla Es lo que hay :( @kion15 estas obsesionado con esa mierda xdd https://t.co/CqNHerxxSi Nuevo EPIC VLOG!! :D Futbol epico, el padre del mahe, caballos y gente borracha everywhere https://t.co/a7YxQvYEiq Like y RT&lt;3&lt;3 @mangelrogel Lo es 🗿 @mangelrogel Anda que yo https://t.co/lyvhfeXJ6e Hoy es dia del señor https://t.co/dC5n2G8Yvf @DCuevasCalderon @OliverHeldens Pronto pronto 🗿 Cristianito is love, Cristianito is life @mangelrogel @easyJet \"Easy\" https://t.co/Rp4Age9jAU @mangelrogel @easyJet EasyJet, tambien conocida como VuestroGozoEnUnPozoJet Pues nos han cancelado el viaje D: Ibamos a Cardiff para ver la Final con nuestros padres :( A ver si mañana tenemos mas suerte Nos vamos de viaje shurmanos, dentro de unos dias habrá video 🌝 https://t.co/daZQT0hRk0 Nuestro futuro hijo tiene su flow @mangelrogel https://t.co/gWFCKr1Dry @Mega_Glowen Mucho ánimo Puto clash royale tio https://t.co/KWGrYbLcm8 Uuuuuugh, la mayoria me estais diciendo que Youtube no os ha avisado de que he subido el ultimo video D: CUANDO VAN A ARREGLAR ESO PORDIO @anggie_tati cuidado que a lo mejor hay una sorpresa :v Nuevo video boiiis! Intentando superar mi miedo a las alturas en REALIDAD VIRTUAL (y otras cosas D:) https://t.co/kpSgC4Kp5l Like y RT&lt;3 Esta noche video https://t.co/9hjDXVhzwe @Outconsumer @KoyakoYT COMPRA... MAS... GEMAS.... @LulyDaRif Al crearlo lo puse en 1400, pero cuando llegamos al limite de miembros lo cambie a 3000 para evitar trolls 🎷🐛 Este es el clan oficial, que estan saliendo muchos fakes ya xD https://t.co/n6xTKGAlQU @CooLifeGame @BlackEspanolito Ya estoy en arena 5 n000000bs 🌝 He creado un clan para los que quieran jugar conmigo (y farmear como chinos 🗿) https://t.co/mdRV6oKqDF @sebastianyaya2 JAMASSSSS Al final me he dejado llevar por la presion social y me he viciado al Clash Royale. Putabida. RT @mangelrogel: Dos horas despues... @Rubiu5 https://t.co/V7itZ2hwGE @aLexBY11 @mangelrogel Tu no te metas en esto @mangelrogel TE HE PREGUNTADO HACE 50 AÑOS QUE DONDE ESTAIS Y NO ME HAS CONTESTADO @lalannister11 Es mi plan, a ver si no lacago con el audio esta vez xD @auronplay La ultima temporada está un poco regular, pero por el resto, recomendadísima. https://t.co/87G98eetxM https://t.co/HnCRDgCUU3 RT @Soycepa: Esta es mi cancion para el concurso! @Fanta_Esp \nEspero que os mole! @Rubiu5 @mangelrogel @aLexBY11 \n#Fantabyus \nRt! https://t… RT @rollingdoblas: ÚLTIMA HORA: Encuentran replica exacta de la obra \"El grito\" de Edvard Munch. Absolutamente impecable. Arte. https://t.c… Nuevo video! LA MAYOR APUESTA DE NUESTRAS VIDAS, NOS LO JUGAMOS TODO EN UN COMBATE LEGENDARIO D:! https://t.co/87G98ew4Wm Like y RT&lt;3 Se viene un video fresquisssssimo ( ͡° ͜ʖ ͡°) @Srcheeto Family Friendly Counter Strike @MisterJagger_ Nunca se fueron Se me han caido las braguitas con la nueva skin de genji https://t.co/j3ZR9TUUxg Hoy, hace 17 años, salió el mejor album de rap de la historia. https://t.co/8JwnJWWzUo Dentro de poco tengo 800.000 viajes y me estoy estresando un poquillo. Pero tambien me alegra por que podre hacer vlogs frescos 🦑 https://t.co/mfj9o8PXtG RT @Rubiu5: Nuevo video!:D Vuelve Gang Beasts, con mas peleas adorables y momentos descojonantes https://t.co/a3qu3CJ63G Like y RT por UNA… RT @PlayStationES: ¡Te invitamos con un acompañante a la #UCLfinal en Cardiff! Descubre cómo participar aquí 😏👉 https://t.co/j9OiFVYE2c htt… Acabo de ver esto en 2017 (el dibujo es de 2016 lol) pero holy shiet https://t.co/ZGXiISooAz alexby A LA PALEEE https://t.co/Q5lHoVecON Nuevo video!:D Vuelve Gang Beasts, con mas peleas adorables y momentos descojonantes https://t.co/a3qu3CJ63G Like y RT por UNA ROMA LIBRE&lt;3 @RubiusMusic niceee RT @CartridgeGames: Investors: Kimishima, what are your plans to save Nintendo?\nKimishima: https://t.co/eYVcSuyJMf *e imprimir, yo no hablar españolo He impreso un pequeño Groot, ahora me queda limpiarlo y imprimir otra cabeza mas grande, que ahora es ridiculamente pequeña lol https://t.co/z43wxh0He7 bueno, vale, algunos me avisasteis, A LA SIGUIENTE ME PREPARO MEJOR (eso digo siempre) todos en el chat: \"ci ci rubiuz ze te ezcucha bien\" Miro el directo cuando acaba y se me escucha de culo xDD LA ULTIMA VEZ QUE OS HAGO CASO MA NAME E JEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEFF en 30 minutens directo! :D https://t.co/F0cfrie94m @_Clauss_1223 Ducharse esta sobrevalorado 🗿 Y me pongo ya a hacer videos, que llevo sin hacer uno en condiciones bastante tiempo y me siento sucio 🗿 Ya he vuelto de unas mini-vacaciones en el campo, esta noche a lo mejor hago directo 🎷🐛 Voy a dejar Youtube para cumplir mi sueño de ser pastor de ovejillas en el monte. Ha sido un placer. https://t.co/uGcBwBZRYH @RubiustFtNicki Pues casi por que hace un frio que te cagas 🗿🗿🗿 @aadali_ Algun dia! @Mxngelshy Estoy en mitad del monte y el interné me va del horto xD NO QUIERO DESCONTROLAR NADA. TRANQUILOS. @Sr_Zeta Por un video (ahora borrado) que vi hace meses donde enseñaban bastante pruebas que parecian convincentes.Otros ytbrs tambien me advirtieron @Sicknesslly 10/10 Lo gracioso de todo es que han tenido huevos a invitarme a mi y a otros youtubers de los que se han intentado aprovechar. Mucho cuidado. -por que son los mismos cabrones que crearon la revista de salseos y los que nos acosaron con paparazzis en mis ultimas vacaciones Quiero avisar a los youtubers que han sido invitados a una gala de premios dentro de poco, que tengan cuidado con esa gente- @ErickGuize Para algo que se le da bien a Noruega... xdd Le han dado puntos a España, esto ya no tiene gracia https://t.co/l5kjTiRVj3 @Rubenftmitaco &lt;3 @meigasfritas_ Obviously @FapParaMoar NO MAMES WEY M  E  X  I  C  O https://t.co/aoBYUzd7Fz RT @ClubMediaFest: Llegó el día, llegó el anuncio que estabas esperando... Llega @Rubiu5 a #CMFMéxico\n\nhttps://t.co/TyCL1kahuF 🔥 https://t.co/j1gWOjhj9o https://t.co/OmVK2apByO He dejado esto en el vid de ayer https://t.co/VtMgBordAQ RT @Fanta_Esp: ¡Habemus ganadora! El Boss ya tiene una elegida.\n\n #FantaByUs https://t.co/ZREXyGhaHr @mangelrogel @FapParaMoar Ojala @mangelrogel WILLYREH https://t.co/PW7xx1X1lm LOCOOOO LOS DISLAIKS https://t.co/lBCzu5gqzT Que siiii que siiiii que voy a seguir con Outlast, pero a mi ritmo. No me lloreis ( ͡° ͜ʖ ͡°) Nuevo video! :D Me han hecho una cancion remix increible. TEMASO POR DIOOOOS. SEÑOR PRESIDENTE! https://t.co/tCLKR14DJy Like y RT&lt;3 El video de hoy os va a molar mazo :D Fuck https://t.co/4mhO0MWtzn Asi no se puede https://t.co/BbqjdvY5Gr Nuevo video casiguapos!:D Vuelve el vecino de los secretos y sustos en Hello Neighbor boisss ( ͡° ͜ʖ ͡°) https://t.co/idZpUF0wAa Like y RT&lt;3 Nooooo, pobrecillos! Que alguien les salve D:!! https://t.co/YuzQfS4aKZ @mangelrogel JAAAAAAAAAAAAAAAAAAAAA! https://t.co/2Zwy1fzMq2 @rubiustrolo  https://t.co/qs0mEMhaxN @asunavanilla  https://t.co/tdI2qW3Zc5 mañana video cracks https://t.co/2hglJdxe4H Sup' https://t.co/dk9xTydtXT ese puto susto del final xDDD vuelvo en 10 min con otro directo a parte leyendo vuestros comments and stuff EN 5 EMPEZAMOS  https://t.co/m4zHN9XEuw GOGOGOG El directo será dentro de 1 hora y 30 min. Acabo de hacer un testeo en el canal y parece que todo va 10/10 ( ͡° ͜ʖ ͡°) Directito fresco esta noche boisss! @pewdiepie &lt;3 hay gente que de verdad cree que estoy llorando y hay gente que de verdad piensa que hay beef entre nosotros. que os pasa en la cabeza xDD https://t.co/FQdOUI0Yj2 @JoHn309xD SE CONFIRMA QUE NO SOY GAFE https://t.co/2H2Qat0zlg Cristianito de mi vida @Dxblastydia @FapParaMoar todo esto es culpa suya. jamas olvidare el bullying de senpai. jamas. Dislike @pewdiepie https://t.co/tTojoRGyn7 (os dejaremos las cejas bien visibles) ya sabeis humanos, para salir en el siguiente anuncio de @Fanta_Esp conmigo, mahe y alex haced lo que dije en el vid https://t.co/cW9hi6pOs3 Tengo mucha hambre, asi que haced de todo menos pasarme fotos de hamburguesas grasientas y deliciosas. Gracias. @_y0utub3r5_ JODER xddd RT @_y0utub3r5_: @Rubiu5 jaja en realidad solo hay 71 \"vale\"\nme reí mucho haciéndolo, espero que te guste❤️ https://t.co/B297tZjqjh Poco a poco me estoy convirtiendo en la vieja loca de los gatos de Los Simpson y nadie puede pararme https://t.co/31pJauXpUc vale x283 @vicogonzales4 Pues... Vale. @rollingdoblas Ayyyy @kellyjeaaann Next step: eating a lot and sleeping all day and start living the dream Aqui está! :D Unboxing del nuevo setup de mi habitacion, PC de la NASA y WIlson dando por culen https://t.co/cW9hi6pOs3 Like y RT&lt;3 Youtube va muy lento hoy shurmanos, pero el video esta casi subido. PASIENSIA @prioritywigetta Nope, ahora con el internet nuevo queda igual que si fuera un video normal 🦑 @auronplay Te dije que por aqui no... Pues na, aqui estoy en el cine con mis amigos imaginarios ya que mis AMIGOS DE VERDAD LLEGAN 30 PUTOS MINUTOS TARDE @aLexBY11 @mangelrogel https://t.co/necMBI4lqu Nah, el siguiente capitulo de outlast seguramente sea en directo, para hacerlo mas interesante 🗿 ya os avisare el dia Ahora es cuando digo que no voy a seguir la serie de Outlast y que todo era un experimento social https://t.co/MLHnSRWOyR @ZellenDust Ese, justo. Te gustó? Me pusieron tanto maquillaje en el rodaje que no tengo ni cejas xdd En el siguiente video os cuento moar https://t.co/JxW0QGUAYq Ya me habeis visto en el anuncio de TV? 🌝🌝🌝 @KronnoAhre @davidbisbal NO POR FAVOR. STAHP @davidbisbal Xddddddd RT @davidbisbal: Donde puedo conseguir los capitulos de dragon ball gt?? @Lore050898 lol, DEMASIADO. La ultima vez que dejo que me maquillen xDD Parezco un muñeco de plastico @mangelrogel Ahora que soy tu Jefe, no te permito poner memes tan lamentablas en horas de trabajo 🗿 @featwitaxx Si... 😴 Cada vez me levanto mas pronto 🗿 Un gran poder... conlleva una gran responsabilidad... *empieza a sonar la musica epica de spiderman* @elquxu Bitch please. Siempre yo 🗿 TERCER DIA CONSECUTIVO Y TERCER CAPITULO DE OUTLAST BOIIIS :D Que el ritmo no pare no pare no 🗿 https://t.co/WjCJiWwfo1 Like y RT&lt;3 @Perxitaa A subir maincraft fieraaaa Os imaginais que suba videos durante 3 dias seguidos? https://t.co/DB8FAQAh0X RT @notice_me_Rubiu: Dos videos de Rubius seguidos este no es nuestro Rubius,nos lo han cambiado,como y donde esta \n\n@Rubiu5 https://t.co/U… Aqui va lo prometido! :D Nuevo video de Outlast 2 boiiisss. ESTA MIERDA EMPIEZA A PONERSE BASTANTE TENSA https://t.co/yXIJku4jE4 Like y RT&lt;3 @Criiss_024 Yasss En este video si que me vereis sufrir de miedo. El juego empieza a ponerse tenso de cojones 🗿 #rip Esta noche se viene la segunda parte de Outlast 2 https://t.co/6G7dvpmT8C En el siguiente video le subo un poco el brillo al juego, por que YT siempre lo oscurece mas de la cuenta D: RT @TetasdeWilly: #VirtualHero3 Después de haberme tragado mil spoilers por fin lo tengo, los posters me los regaló un familiar que viajó a… @TetasdeWilly Buena coleccion 🦑 Nuevo video! :D Ya ha salido Outlast 2... BIENVENIDOS AL INFIERNO BOISSS. Primer capitulo. Get hyyypeeee https://t.co/Mol9uHTgNY Like y RT&lt;3 Hoy va a ser un gran dia. Esta noche subiré el primer capitulo de una serie muy mitica en mi canal. Get hype boissss ♿️ @marca Esa sonrisa y optimismo desaparecieron breves momentos despues de que me sacarais la foto lol @mangelrogel A la tercera va la vencida Por lo menos he visto a senpai Cristianito en Full HD real ¯\\_(ツ)_/¯ Putisima vida VAMOS HOSTIA Cristianito de mi vida https://t.co/GiFC8cMhUQ @l0uisftruben Ojala Voy a tener a Cristianito a 10 metros. Voy a fangirlear y gritarle un SIIIIUUUUUUUUUU a ver si me noticea Vamonossssss https://t.co/QgFERDvyWN @Perxitaa Tu y nadie mas que tu SE BUSCA: Hombre joven, alto, andaluz, semi-atractivo, ha desaparecido de YouTube. Si le encuentran por favor llamen al 1770646281 https://t.co/wmgTxsMU25 Damn, nunca habia visto a Zombirella tan sexy 😳 https://t.co/G7wJ6iRNfg @Anothink @mangelrogel @aLexBY11 Ayyyy New video boiss! Hoy pondremos a Chuck Norris contra 5K soldados, avalanchas y tortugas asesinas. BEST JUEGO EU https://t.co/db2TPv5qER RT&lt;3 https://t.co/Psv8WjhWyJ https://t.co/kxQIcEyHXv @mangelrogel @iheartlarryxo  https://t.co/vqv6ciWAwy @Yukine_Sempai creo que si :v pero ya lo enseñare en mi canal @ChupyKusa ojala hacer un anuncio asi algun dia xd Ayer estuve todo el dia de rodaje, parece ser que voy a salir en un anuncio de TV ( ͡° ͜ʖ ͡°) pronto os contaré mas Sorry si ultimamente subo menos videos, estoy a mil cosas estas semanas Z.Z Pero mañana tendreis uno, ai promiss yu BUENAS NOCHES https://t.co/Gcm8KmydD4 @Rubius_city5 10/10 https://t.co/T5L8jSA41O Ya sabia yo que la segunda molaria mas ( ͡° ͜ʖ ͡°) ya la he cambiado Que miniatura os gusta mas para el video, la primera o la segunda? estoy pensando en cambiarla D: https://t.co/m74j5kh9B9 Nuevo video! :D Se me ha hecho mazo tarde pero bueno, aqui está xD Supervivencia de zombies mega-retrasados lol https://t.co/0mS6nCpfI1 RT&lt;3 @justinbieber  https://t.co/NECr2w1bCF Como vuelva a escuchar la cancion de Despacito en alguna parte saco la escopeta y me lio a tiros I PLAY POKEMON GOOO EVERIDEI, AI PLEI POKEMON GOOOUUUU *empieza a sonar el solo de guitarra del hermano* https://t.co/3tIIGQaqyi Like si te sigues acordando de Misha https://t.co/TtMUR9SMAN @mangelrogel https://t.co/SSVHxA0I2b Ust no esta muerto, estaba de parranda https://t.co/gE0Ta3A263 RT @GRRMspeaking: So, my publishers say I have to start trying to appeal to a younger audience... https://t.co/T3BZuw6iqB RT @doblasftrxgel: @Rubiu5 El fandom cuando preguntaste que de que color te teñías https://t.co/EuL7nTcY28 @doblasftrxgel Lmao @rubiuspiojoso Chunk puto amo @Rubiuss5 Lo de \"locooo\" se me ha pegado de @KNekro xD Nuevo video PRRRRAH! 🦑 Simulador de Batallas Epicas (de verdad xd) Os va a explotar la cabeza con esto https://t.co/HLRZUc5Dsm Like y RT&lt;3 Mi madre es maestra en sacarme fotos https://t.co/AsUID2AvBE @Sicknesslly niceee :D RT @DoblasftLuzu: https://t.co/XPfKXDlxgN @mariapaularued2 Hay muchos frames ocultos como ese a lo largo del video 🌝 @AngyeFdez Muchas grazies por el diseño original &lt;3 @Erickftrubius No ha estado mal 🌝 Nuevo vlog humanos!! :D Pintando un mural muy epico con sprays, aviones asesinos y la voz de mi madre :v https://t.co/1Fj8drdOt4 Like y RT&lt;3 En un ratito tendreis un vlog muy fresco ( ͡° ͜ʖ ͡°) Hace eones que no subo un vlog a mi canal D:! @SpainFury  https://t.co/VIRrltsLCX @1_Nayer_4 xDD No creo, es un fnac gigante de 4 pisos o mas Waaaat, han puesto esto en el escaparate de la tienda que mas visitaba de pequeño :DDD Estoy fangirleando awfjdjgdhVzkw https://t.co/Z539EoTxGG @luuidk &lt;3 RT @pikaneko2: El altar del #VirtualHero3 💞💻❤ @Rubiu5 https://t.co/SiJMVSkk7O @pikaneko2 Bonito altar. 10/10 Ya han quitado la restriccion de edad en el ultimo video btw 🎷🐛 Ya casi habia perdido la fe. Llevo todo el dia en la naturaleza haciendo algo muy guay 🌝 ya lo vereis en el siguiente video https://t.co/j7oiK2K4Mz @ElchuiucalYT Lmao https://t.co/p2Uc4neSFi Pues nada, mi canal ahora será Disney Channel. Mañana aprenderemos a contar hasta 8 :DDD @Victor_Cein Si es por eso, dejo Youtube xD Me lo censuran por \"contenido sexual\". DONDE??? Por dios. Un video que he tardado horas y horas y horas en hacerlo a la mierda Estoy un poco hasta los huevos sinceramente. Esto ya me parece estupido @YTCreadores https://t.co/NATGUIPWQY @Fatyma_lopez Nos contaron que el precio del comic seria muy alto en MX si le poniamos tapa dura &gt;.&lt; NUEVO VIDEO HUMANOIDES! Vuelve Higher o Lower :D Superare esta vez mi high score?? AYUDAME CRISTIANO https://t.co/kRrj5OelkV Like y RT&lt;3 @FolagoR Good old days @Perxitaa Y lo feliz que era Acabo de encontrar fotos muy cringe de hace 8 años de cuando era un OTAKO y fui a mi primera expo de manga xddd https://t.co/1zORha5b8T @AngyeFdez @ireene35  https://t.co/RJJ4eEiF5D Mandadme fotos si lo teneis ya y os daré amor por aqui (un fav y esas cosillas) Usad #virtualhero3 para que lo vea, cracks 🗿 OMG Virtual Hero 3 se ha puesto el 3º en productos del momento en Amazon en menos de 1 dia :DDD https://t.co/lQsOeYCMeI @ireene35 damn son @SweetHStylesL por que es donde hay mejor luz en mi casa makina Yo ya tengo la primera copia fisica y tengo que decir que huele y sabe muy bien. #PosandoComoUnPadreOrgullosoEnElBaño #VirtualHero https://t.co/gjgxoB0WUx Tambien os iba a anunciar que mañana sale oficialmente VH III en TODO EL MUNDO. Muchas gracias de coração por hacer esto posible :) im happy https://t.co/LRVhtPnrbq Iba a subir un video hoy pero he tenido muchos problemas para editarlo D: Llevo todo el dia editando pa ná. Pero mañana lo tendreis :) Modo Predator: ON https://t.co/9EGN8QxOiU Mahe, Alex y yo fuimos a una Escape Room por primera vez el otro dia y aqui está el resultado 🌝 malditos sustos https://t.co/PBao0qbn7z No se que da mas miedo, la cam pixelada del principio, que lleve una foto mia pegada a su cara o los gritos del infierno https://t.co/Nlui5DZrSS @Jack_Septic_Eye best video on your channel lmao @aguslanusoeste Ojala :,) Puto whatsapp https://t.co/L5UIIwaeTQ @TheDemisBitch wat, tu eres la chillona? ( ͡° ͜ʖ ͡°) Nuevo video fresco!:D Me metí en Omegle para hablar con vosotros y aqui teneis los momentos mas divertidos https://t.co/IPnoHE0GIf LikeyRT&lt;3 El video de hoy os va a gustar mucho ( ͡° ͜ʖ ͡°) DESPUES ME PREGUNTAIS POR QUE NO SALE RASPY EN MIS VIDEOS https://t.co/PqdaCl8NfT Ya he terminado en Omegle. Sois ameising :) Ya estoy dentro. Por favor no me enseñeis el pene. En un ratillo me voy a meter a Omegle, poned en intereses \"elrubius\" si quereis encontrarme ( ͡° ͜ʖ ͡°) tened la camara y el micro activado Me flipa hacer directos en serio. Cuando consiga el cable de internet kilometrico quiero empezar a hacerlos mas a menudo :D feels good man RT @skinhub: FIRST Butterfly Knife Sapphire Giveaway\n\n💰 $4,000 💰\n\nJoin here: https://t.co/sExivr49up \n\nMust RETWEET to Enter! https://t.co/… @BeautyBrainSp @valls_08 gracias por el cargamento de platanos canarios que me acaban de dejar en la puerta &lt;3 Estoy en el baño 🌝 En 15 minutos empezamos directo boiiiissss https://t.co/qaN8VzsrwS Se que algunos mañana estudiais/trabajais/alimentais a vuestras tortugas, asi que si no podeis estar recordad que se resubira a mi canal 🎷🗿 Esta noche Epic Directo CONFIRMED :D luego os pongo el link Puede que mañana haga directo (y digo puede por que mi PC está al borde de la muerte) Ya os ire diciendo shurmanos 🗿 @fueledbyjoshler @mangelrogel @aLexBY11 uno de los 3 esta al borde de la muerte Boyz in da hood https://t.co/spEP7n67TL @PrincerdaDoblas https://t.co/ttCLYn1vkV @valeconda CANT STOP WONT STOP @Fwiz yes please @Fwiz i would kill for that rn *en realidad estoy llorando por dentro* Sabado noche viendo el directo del Ultra y jugando al Nier. Ni tan mal ( ͡° ͜ʖ ͡°) @germanftruben esos son la mierda mas comoda que he tenido en mi vida 🗿🗿🗿 @BlackEspanolito esos tambien valen Nunca os fieis de las personas que no se ponen pantalones de pijama nada mas llegar a su casa. RT @SnoopDogg: https://t.co/csJa3Gyl5K https://t.co/zOpWD0SOem @CataRubiusWeon @YouTube agree New vid humanoides! :D Os presento a La familia Yang.Todo parecia unas vacaciones normales hasta que BOOM! https://t.co/fZ3kdjerbJ LikeyRT&lt;3 @gunsfordolan por tonto basically Este año no voy al Ultra, asi que no me pregunteis mas si voy a ir por que cada vez que lo haceis es una mini-puñalada en mi coraçao https://t.co/N81LEfkvR3 @Nellyy07 este año no D: @PierceTheMiriam aqui andamios En un rato subo nuevo video 🎷🐛 YA HE VUELTO. Me habia quedado sin twitter durante unos dias en el movil por un bug estupido 🗿 @unicorndoblas mola mucho :D @rubiusmanigga cuuuuute @watsonxpizza no es mio 🗿 Wilson y Raspberry: El Musical https://t.co/dczBI9JsZP Me he despertado rapidisimo y casualmente estaba Wilson a mi lado mirandome fijamente. Gatos = Aliens CONFIRMED?? Ha sido la tipica pesadilla donde por mucho que lo intentara no podia gritar y no habia nadie para ayudarme. Que mal lo he pasado xd Esta noche he soñado que me abducian aliens, y ha sido muy real D: @mangelrogel https://t.co/1Kyarzvvtt Youtube la está liando muchisimo con el nuevo \"Modo Restrictivo\" que han metido :/ Siempre tienen que tocar algo (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧ Aqui esta por fin el video de Preguntas y Respuestas y Retos estupidos! :D ESTA BASTANTE COMPLETITO https://t.co/Hq4B9GQmA5 Like y RT&lt;3 RT @Flechipollaa: CRAACK!! te hice un dibujo al estilo ¨HORA DE AVENTURA¨ con wilson y vos 🗿☁️@Rubiu5 #elrubiusfanart espero que te guste!… @onIydoblas saldrá el mismo dia en todos los paises 🎷🐛 @ustcute dentro de MUY MUY MUY poco :D VH III. Despues de muchos meses trabajando en esto por fin puedo anunciarlo. Así será la portada del capitulo final de la trilogía :) https://t.co/XB5GY6eyqm Me apetece hacer un video de preguntas y respuestas, asi que mandad preguntas frescas, retos y esas cosillas a #PreguntaRubius ( ͡° ͜ʖ ͡°) @CheatsLocos bastante \"meh\" @VilelaMaricielo parezco un Moai 🗿 RT @MobNature: Después de mucho tiempo, un dibujo de @Rubiu5 💫 #elrubiusfanart https://t.co/RlBxmfubB3 RT @RubiusDiva: Una Zombirella personalizada pa vo @Rubiu5 #elrubiusfanart :D https://t.co/6OKOgoEDKL RT @dodohdraws: Hola @Rubiu5 hice un dibujo de ti vestido de Link, espero que te guste cabesa😁 #elrubiusfanart https://t.co/fHAjBzxUfy @alexbyacule @marcmarquez93 @YouTube tenia... seguro? A lo mejor eso ha cambiado ya 🌝 Os dejo un video guay que hice con @marcmarquez93 para Playstation! :D Pobrecillo,nunca habia jugado terror en VR xD https://t.co/l3yUqHImTq https://t.co/EGXiYPTSHn https://t.co/v7X3f5UhDh @mangelrogel seguro? Creo que te has olvidado de cuando vimos Ancient Aliens https://t.co/h7nZ6RwmJM Animales &gt;&gt;&gt; Humanos @marcmarquez93 @PlayStationES jaja justo estaba viendome el video entero y me estoy descojonando con tus sustos xDD #RIP2Pac @mangelrogel https://t.co/tRw4wW0OFI @mangelrogel https://t.co/LX4cQ2EtU5 @mangelrogel https://t.co/F1Ama5VN8n @mangelrogel y la idea de los domingueros en el Pokemon en 1 minuto. Gracias por tanto &lt;3 Nuevo video! :D Zelda: El Respiro del Meme, protagonizado por El caballero de la fregona y 2pac https://t.co/EGXiYPTSHn Like y RT&lt;3 Se viene el nuevo video en unos minutos boiiiss He estado un poco deprimido estos dias pero este video me ha animado bastante :D A ver si lo acabo para esta noche cabesas Llevo mas de 20 horas trabajando en el nuevo video y totally worth it Que les pasa a las animaciones faciales del nuevo Mass Effect por dios PARECEN PINGU https://t.co/hQqJlwEL4O @auronplay borra ese twitt o llamo a mi socio Pablo Emilio Escobar Gaviria a que te meta un pepaso bien cabron @mangelrogel los buenos tiempos :') @FrikerPlan lmao @KilladamentJavi el lado oscuro de la fuerza hipster es demasiado fuerte tumblr rubiuh https://t.co/DFbkt4uIhu https://t.co/8trXmRO04x @mangelrogel suficiente tengo ya con eso como para que tu me vengas a hacer bullying :&lt; https://t.co/pwM4DXmrhF Voy a retocar la miniatura que no me convence :v Nuevo video guapos! :D Hoy jugamos a 2 juegos de terror, uno muy KAWAII y otro que da muy mal rollo D: https://t.co/SmQaNIlNhT Like y RT&lt;3 De la mujer que mas orgulloso estoy es de mi madre. Me crió ella sola durante años mientras trabajaba y estudiaba. love u mom :) @MeLofRuben pero ese no es Mangel Feliz #womensday a mi unico y verdadero amor https://t.co/jiKVIqnyl9 Feliz dia a mi madre, a todas las mujeres importantes en mi vida y a todas las que veis mis videos. Ojquiero. &lt;3 @bemymahe todos cambiamos y evolucionamos por suerte Ese era mi humor en 2012, y recuerdo que esos videos los hacia de manera satírica (y son los que me han llevado hasta aqui) https://t.co/sRITiq4bIz 2012 https://t.co/xyGZX16ylA Hay gente que quiere llevarme a la hoguera por este tuit que puse en 2012 https://t.co/c0dDe9Xs93 @Garofano16 naiiisss Ayer subi video tarde in the night (por si no lo habeis visto 🎷🐛) https://t.co/VnX6xt8AX0 Quien creeis que ganaria en una pelea a puño limpio sin camiseta entre mahe, alex y yo @aLexBY11 @mangelrogel https://t.co/9thfTcoVkS @aLexBY11 @mangelrogel tu vuelvete al call of duty, GIIIILIIIIIIIII https://t.co/RIn3qoi87R @mangelrogel https://t.co/qbhBqKpqla"}