{"tweets": "@Roxxi71489676 That was obviously a screen grab from a fan. Comment all u want babe but they be needing those retweets so ppl can even see/discuss their interviews. It be crickets 🦗 🥴 love you 😘 nothing else they say goes viral except for those 10 little letters. Don’t be used. Unless u getting paid for promo 😊🥰💋 https://t.co/2ZdR5CsHRQ I remember running up the block &amp; around the corner to my bff’s house b/c she had the new Monica album &amp; I couldn’t afford it. I sat in her room for hours learning every song. I love how music leaves lasting memories that can never be erased. HAPPY BIRTHDAY  @MonicaDenise ♥️💕💋 😂 well you’re doing a GREAT job, mama💕💕💕 https://t.co/hhQE9NDHHi To GOD be the GLORY 🙏🏾 Chile. The next Queen radio bout to be brazy chile. Omg 🤣 lemme book a date 🥴 Ikyfl Btch i- That man is so fkng shady for saying “AnD fOr AdDeD dRaMa” 🥴😂 https://t.co/3Km4eZllyf What if he’s actually tryna say get off me hoe!!! Lol https://t.co/cUgqvpBFKg I went &amp; copped the 🥢 Bitch shut tf i- RT @ASTROXMARAJ: The bamboo details on the FENDI earrings makes me so happy because it’s like wow this hood chick who loved her bamboos has… No tolerance for bullying. https://t.co/rrhgl5JeZn Ayo u see my last pic, go double tap dat for me Beautiful babe. Your talent &gt;&gt;&gt; https://t.co/M9zyzzuePz You can always tell who understands rap vs. who ACT like they don’t understand real rap when it’s convenient. Love you Maliibu. You’re so talented &amp; gorgeous. https://t.co/tKvtcHjNS7 😭 somebody said “okay crunch” i- 🤣 https://t.co/wGad8Lfkzz RT @gypsydamnXTRA: It’s her eyes 😭😭😭 I can’t deal https://t.co/CaDwWOn6Bp 😂😂 I rlly love y’all omg 😅 https://t.co/tSlQC6qSvJ 😳🤣😂 https://t.co/W1YWnhhaax Omg guys. 😅🤣 I thought everyone could clearly see I was being sarcastic. Shit! Now I have to go to Adele’s studio &amp; steal some files. Who’s in the UK? I got a job for you 🥴 https://t.co/oyh4hECNCC 🙏🏽😘 https://t.co/CreNfxqobJ Ummm 🥴 https://t.co/tFqbW5NpNw You’re so welcome. I love you guys so much for coming out. Wish I could give even more gifts. Maybe next #QueenRadio tho.  👀 #FendiPrintsOn https://t.co/wdBTc8GRMR #FendiPrintsOn 😜 https://t.co/2XSvHfuhV3 BITCH ITS KING KONG Only fans I see on Rodeo drive may win tonight. ☺️😜🛍 https://t.co/aaZ3FHP1CX 🤣 https://t.co/xsmWQHfXYm Ch @andrewthebadguy @BlackBarbie6134 🤣 RT @Fendi: The wait is over: @NICKIMINAJ’s #FendiPrintsOn is available on https://t.co/rdyDwOBy79 #FFSeries\nAvailable also in selected bout… Stop discussing bullshit. Sup https://t.co/vEXJfVIQRF Me when I see Angelina Jolie https://t.co/6iHJA3idMo Me when I see Judge Judy https://t.co/6iHJA3idMo 🥴 that BROOOOO sent me 🤣 https://t.co/ZSgAFumL8w OMFGGGG EXACTLY!!! They don’t hear da baby saying it was a typo when he sent that “I love u” text, or when he sayin his side btch better. 😂😂😂😂 MEN do y’all see y’all selves?!?!! WHERE YALL AT MEN?!!?!! I’m tryna see sum👀 they can dish but can’t take #GirlPOWER LMAO #iPhone https://t.co/r2hG5nEW8f I think an hour but I went back in &amp; changed the 1st 2 lines cuz I didn’t love it. But then @ the last min, I changed it back &amp; sent it to da Baby &amp; said I think we should leave it. He was like “I agree”. I was giving the text major side eye like “boy why u ain’t tell me?” LOL ♥️ https://t.co/1T1WIp6mWQ You thought I was gonna sing for the whole verse right? Lol. 😘 https://t.co/DYqnOZrNm0 Thanks babe. What’s your fave part? https://t.co/BETZo3HiO5 Thank you sweetheart. What’s your favorite part? https://t.co/MhhjYnbace It’s the 🐐 bday 🗣 HBD @LilTunechi https://t.co/cuUK4Lw2Tl RT @DaBabyDaBaby: My ALBUM “KIRK” is out NOW!!! \n\nhttps://t.co/wtWYDxbMVc 😅 https://t.co/278RpX6fPp 🗣 @DaBabyDaBaby 🔥 #iPhone #Kirk #DaBaby #DaBarbie https://t.co/9vvIarnoKH https://t.co/lUyWa6YmMd ♥️ My @fendi collection will be available on https://t.co/HtRMlkkFj7 from Oct. 14th and in select boutiques from Oct. 16th. #Fendi #FendiPrintsOn #Ad https://t.co/ThulaWKKKO https://t.co/Xr78vRr7L3 #Fendi Don’t you ever doubt yourself. If anyone would’ve told me as a lil girl from Trinidad that grew up poor that one day my face would be on a piece of @Fendi clothing, I would’ve laughed. Your support for #ChunLi led to this. A song I made up off the top of my head as a joke. ILoveU https://t.co/p4xUx1Lb68 Oct 14 on https://t.co/HtRMlkkFj7 @fendi #Fendi #FendiPrintsOn wait til you see the other epic things that come w/this collection. My babies are gonna gag. Thank you, FENDI for this opportunity 🙏🏽 also Elle Mag, Stephen Gan, Nina Garcia, Genius Steven Klein, Tae &amp; Mila on glam https://t.co/hOhLiOwlLB The iconic collection AVAILABLE OCT 14th on https://t.co/ymk19sh75G &amp; select boutiques. @fendi #Fendi #FendiPrintsOn Here’s a sneak peak of just a taste of what’s to come #FendiPrintsOn by #StevenKlein for #Elle https://t.co/tgmJor6XSs 🥴 https://t.co/uGcHrCTzOt This video always makes me cry chile https://t.co/iz6nJUq4hg I will babe. I promise. I love you so much https://t.co/YaK6T4U1FP I’m still right here. Still madly in love with you guys &amp; you know that. In hindsight, this should’ve been a Queen Radio discussion &amp; it will be. I promise u guys will be happy. No guests, just us talking about everything. The tweet was abrupt &amp; insensitive, I apologize babe ♥️🙏 https://t.co/eS0oHipwtg 🙏🏾♥️ https://t.co/zOBDKquQVc When I say you BODIED THIS!!!!!! I mean you BODIED THIS! Yikes. Thank you babe. Y’all did that! And thank you, @taylorswift13 ‼️♥️‼️♥️ https://t.co/GSjbn8qq2X https://t.co/OvkklKHr47 😢 RT @mohitsingh356: So we really not talking about this verse ? 😭😭💀 https://t.co/MDS2vkzzTC Yea I’m in to ghosts/in the ghost (car). Wrote this verse about the spirit/ghost of Marilyn Monroe &amp; suicidal thoughts. Spit it raw. No backing track. Just me &amp; the mic 🎤 https://t.co/2frIKedXGK She know I’d be there b4 she could even get the sentence out, chile. Smthng her mother said on that show one time changed my life. It’s personal tho. https://t.co/pmRGQBXAW5 If y’all know me y’all know Jada has been my idol since “a different world”. So grateful she posted this &amp; her caption is spot on. ♥️ https://t.co/WtbwWNZI8B https://t.co/lZrrAbO2l7 everyone, let’s plz be positive to all &amp; focus on the future. Love you. 😭😭😭😭😭😭 https://t.co/Dv9qSvxfzF Congratulations to Rapsody &amp; Missy Elliott on their newly released projects. #BlackGirlMagic 🗣 Congratulations @lizzo on going #1. You are so extremely multi-talented. 🙏🏾♥️😘😘😘😘 Being nice &lt; being mean But when I go in... Sending love to my sister @TRINArockstarr during this time of the devastating loss of her beloved mother. Pls lift her up. This is a very difficult time for her. RT @theestallion: Wow hot girl summer hit a million views in less than 5 hours keep running it up 💁🏽 RT @mvnajes: The new segment is called #btchyouthought LMFAOOO https://t.co/14xNnoGrIn 😭 https://t.co/gVdxoMsRgl https://t.co/lZrrAc5DJH #HotGirlSummer RT @TheEllenShow: #HotGirlSummer https://t.co/XlyILmE76T But I first had to learn how to love MYSELF. 🙏🏾 if you wouldn’t let a man treat your mother, your sister or best friend like that b/c you LOVE them, then you wouldn’t let a man treat YOU like that b/c you love YOU. This isn’t about judging. We judge too much. Lift them up. 🙏🏾 I remember being so afraid to speak cuz I never knew when that person would be in a particular mood and I could maybe say one wrong thing that would get me hit. So the diff you see in me now is that feeling when a woman feels lifted up, safe, appreciated &amp; unconditionally loved. I rlly used to think love had to hurt. So I could never look down on anyone else. We are merely human. It’s not easy to leave. Especially in the world of IG where all ppl want to do is post relationship goal pics for clout &amp; attention. A man should make you feel safe, not afraid Dear all of you beautiful souls. \n\nA man who loves you does not: \n\n1. Humiliate you on social media\n2. Beat you \n3. Cheat on you \n4. Call you out of your name/put you down to lower your self esteem due to his own insecurities. \n5. Hide his phone, passwords, where abouts, etc. When u see a woman in a toxic relationship, rather than laugh &amp; say mean things, try to offer sound advice from your heart &amp; root for her to learn her worth. We’ve all been there. I saw my parents fight &amp; argue non stop &amp; never divorce, so I thought this was normal behavior... That’s a Makk Fakk https://t.co/HxcwKVYvgP Ok boos don’t trend that dumb hashtag. Love you 😘😘😘 all my Florida babies, be safe ♥️ https://t.co/pLU29n4kjp Ok blocked for sleeping. #StayWoke 😴 https://t.co/oF9T8zrdi6 Ok blocked for not trending. Who’s next chile? now it’s pushed to 14 days cuz of BlAnCo 😝🤪 https://t.co/lfVDzLtlOz Ok I’m loggin out i- https://t.co/ipvfDjmUbP Less than 7 days. But ya ain’t heard that from me. #HotGirlSummer could be sooner if y’all trend #NickiMadPrettyAndGotGoodCooch  good night.  And don’t tell stall or dolla I told y’all either. Golly 🙄 RT @JAW4DMlNAJ: Ha-auhndle me 😭😭 who😭 gon😭 handle😭😭😭 me😭😭😭 https://t.co/qPT3AampLn RT @tinnytayyy: I just know Nicki and Meg texting about this playing in our faces https://t.co/aUFRi3VyOz How in TF does this GIF have to do w- never mind chile I- 🙄 https://t.co/H592gDvu5v You thought that was funny? I- move https://t.co/qPXT826gIs I- what da https://t.co/O3mJhf7YZP RT @onikadrip: The #HotGirlSummer video when it comes out in December and tops the holiday charts https://t.co/1VuP2TL41O RT @adoseofminaj: Nicki coming to twitter after giving us little to no details about the HGS video for the last 2 weeks. https://t.co/QIg24… I- https://t.co/CsfjpVWw93 And honestly, I’m honored cuz dat shit be comedy Y’all some hoes 🥴 https://t.co/e6xePtSS84 Thx babe it’s dope 😘 https://t.co/JaiuzYOWrd Watch this video for ten extra years of life https://t.co/9HF2LEQfI3 RT @Barbie_Ganngg: Ouu @winnieharlow 😍💓Stream #WelcomeToThePartyRemix ✨☺️💞 https://t.co/q2WOtey9dl 🤣 Thank you for having me on this song &amp; congrats on your first VMA mama!‼️‼️‼️♥️♥️♥️🎈🎈🎈 https://t.co/r9VeIt3uYw RT @theestallion: #HOTGIRLSUMMER COMING SOON 💁🏽‍♀️ https://t.co/d1ToJaLE9z AND WHAT ABOUT IT?⁉️⁉️⁉️⁉️‼️‼️🧐 THANK YOU GUYS for voting for #HotGirlSummer We fkng love you. 😛😘 https://t.co/zrodzN2RFR DID I LIE??!?!! *my voice* ugh! Love that for us. 😌 https://t.co/QIMvrlUrxA All my pretty btchs, high sadity btchs, got a milli btchs on go!!! 🚦 All these silly btchs, ima kill these btchs, YO POP WHO TF WANT 💨 https://t.co/sxHCSmBwN9 Fendi MOON boots got me WALKING round like I’m Michael tho 🌙 🚶 https://t.co/sxHCSmBwN9\n\n🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 RT @iTSBARBiELEX: Fendi moon boots, size 6..Got me walking around like I'm Michael tho, paint my hair cuz I'm Tyson, Jordan, ANGELO\n#Welcom… 🤪🥰 🙏🏾 https://t.co/bHUJz8uSyH https://t.co/sxHCSmBwN9 RT @OnikaPromotions: “Welcome To The Party (Remix)” by @PopSmoke10 &amp; @NICKIMINAJ is officially out now. #PartyWithBarbie\n\nSpotify: https://… RT @arisminajj: “Welcome To The Party (Remix)” by @PopSmoke10 &amp; @NICKIMINAJ is officially out now. #PartyWithBarbie\n\nSpotify: https://t.co/… Barbz can I just know why y’all trending #PartyWithBarbie instead of the name of the actual song?🤦🏽‍♀️🥴 ffs 😂 #WelcomeToThePartyRemix https://t.co/WmiiNAFhSI yoooooo I love that for us 😂 https://t.co/r80rImT0cn RT @TURNTMlNAJ: “that tail get wagging, that lil pssy get to poppin” IM FCKING SCREAMING 😭💀 https://t.co/BOSkKBy1dm y’all I’ve been having the time of my fkng life 🤣 https://t.co/4JTTxO0icp Charlemagne get so excited when he thinks some1 bout to say smthn negative about me 😭 that tail get to wagging, that lil pussy get to poppin, he get to giggling 😂They banned me from the show but always talkn bout me. I’m pullin up cuz we in NY soon. I’d rather be invited tho js Yo POP! RT @violadavis: #AngryBirdsMovie2 is now in theaters!!! https://t.co/h0Bi7ipRpB Even back then I believed in myself enough to not sign a 360 deal. Love that for me Lmfao I tell him all the time he’s no diff than the barbz when it comes to that. Y’all both mean well 😅 https://t.co/nbyVnueWot I would’ve never yelled like that if he were in the room. He doesn’t take it like I’m doing my job, he thinks it’s like a street fight chile I be like boy if u don’t step out! 🤣 https://t.co/nhM4CRhqtq Love you sm ♥️ Thx. I’m posting the audio for all the fake blogs https://t.co/oMa3jRCKwC We still recording ur show right? I’m ready 🥰 https://t.co/vrvcinWbsT I’ll post the full Joe section cuz the blogs posted the drugs part knowing damn well it’s misleading. We were discussing him lying on Motorsport &amp; saying I’m lying about HotGirlSummer RT @barbiannatingz: Nicki is such a giver. She needs to start being selfish and think about herself for a change. Because it's going agains… RT @RealEdwinPos: .@NICKIMINAJ look at her reaction please😭❤️ #QueenRadio https://t.co/Sc9X0w5Arb RT @saditystax: extravagant hard asf 😭 RT @PaidTav: WTF @NICKIMINAJ you fumbled the homebody bag!?! SHE WOULD’VE SLIDDDDDDD #QueenRadio RT @onikaminajafric: @Teamnnicki Lmao. To think he can outsmart Nicki smh! RT @NataliaMMinaj: Talk your shit @NICKIMINAJ period! Your truth needs to be told when people think they know every fuckin thing 🗣 #QueenRa… 🤣 https://t.co/KM096Qb98A LMFAOOOOOOOOOOOOOOO #QueenRadio in one hour Omg thank you Keke. That means so much to me ♥️ https://t.co/Vxgi9A3b5P Tomorrow I’m creating a new segment on QR. if you’ve ever left ur own page &amp; ur own life to tell someone who’s on their OWN page living their OWN LIFE what YOU DON’T like about WHO or what they posted instead of just scrolling past, you’re a ummm... what do they call it? A 🤡 RT @musicnewsfact: “Hot Girl Summer” by Megan @TheeStallion feat. @NickiMinaj &amp; @TyDollaSign debuts at #2 on US Spotify. \n\nIt is now the HI… #QueenRadio MONDAY @ 12 NOON PST‼️‼️‼️‼️‼️‼️‼️‼️‼️‼️ RT @TIDAL: Happy 1 year anniversary to @NICKIMINAJ's 'Queen.'\n\nDrop your top 3 tracks below. 👇 https://t.co/whVZsmI9LL https://t.co/OvzdZFD… On meg live https://t.co/jUemojFJsn #HotGirlSummer RT @TIDAL: Dropped: @theestallion x @NICKIMINAJ x @tydollasign. #HotGirlSummer. 🔥 https://t.co/xhrOg3Nn0i https://t.co/7aibHRlfUV RT @Genius: me listening to megan and nicki snap on #hotgirlsummer 🔥🥵\nhttps://t.co/ioNuRnZjAq RT @OnikasRing: Were at the top of the biggest rap Spotify playlists !!!! Including today top hits 🔥\n\nKeep streaming this summer bop🐴🦄🌴💦 #H… ♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️ https://t.co/txUPkcrWSc RT @SAINTBRAN: Nic calling Meg her bitch and congratulating her for pursuing her degree is everything I needed before the start of the seme… 🙏🏽♥️😘‼️‼️‼️ https://t.co/x8mnQRRjdU RT @Barbey_kingdom: Like who don’t follow me? \nCause even in your new bitch I can see a lot of me And honestly I’m honored cause that shit… https://t.co/jUemojFJsn #HotGirlSummer RT @majesticminaj: “and when we say it’s #HotGirlSummer we ain’t talking about degrees” APPLY THAT PRESSURE QUEEN @NICKIMINAJ 🔥🔥🔥 RT @NataliaMMinaj: My babies @NICKIMINAJ and @theestallion fuckin bodied 🔥 We are eatin bitch #HotGirlSummer 🐎🦄 https://t.co/b4KqlLouK2 RT @onikastan8: WHO A HOTTER B? \nWHO GOT A LOTTA D? \nWHO POPPIN LIKE A P WHEN HE BE HOPING OUT THE V??? BITCH THIS SLAPS @NICKIMINAJ AND @t… RT @Power1051: At midnight!! We’re world premiering #HotGirlSummer with @theestallion, @nickiminaj and @tydollasign - Then tomorrow!! We pl… #HotGirlSummer @ midnight. https://t.co/7wQdWCOpoK Barbz y’all ready? #HotGirlSummer 🐎🦄 🔥🔥🔥🔥🔥🔥🔥🔥🔥 https://t.co/0Aj2ZqFsKL RT @AngryBirdsMovie: Your Mission: get tickets to The #AngryBirdsMovie2, in theaters in just 5 DAYS! \nSee it Tuesday. 🎟️: https://t.co/86CP… RT @theestallion: PRE SAVE HOT GIRL SUMMER NOW HOTTIES https://t.co/3WiDgvcSpn https://t.co/dBTOAgz0vX 🐎🦄🥰 https://t.co/zKSIyc3RzR Love my babies https://t.co/uqxDY5MNeL 😉 https://t.co/YPnpv4fJa2 Ok 🥰 it’s time https://t.co/NRAGPDo35T Any minute now 👀 https://t.co/V5bMwV1EZt RT @foreverTRENDN_: #BarbzAlwaysPretty 💋 @NICKIMINAJ https://t.co/Tb3YFTciXd RT @musicnewsfact: .@NickiMinaj is now the FIRST female artist &amp; first rapper in HISTORY to have at least 50 videos with over 100 million v… #BarbzAlwaysPretty y’all trend it &amp; I’ll go live 😘 #UgliesAlwaysMad 🥴 https://t.co/8rmNilQB8s Monday https://t.co/WaYOq1RS6f Ok but @ the same time when I tell my man to go to the gym &amp; bulk up he do what I say 🤷🏽‍♀️ is there a double standard y’all? Cuz y’all know we tell our men what to do all the time if that’s what turns us on. I have a real question.  Take this poll. Ladies, should we be the weight WE want to be or the weight our partner wants us to be? If ur partner likes u “thicker” should u take that into consideration or? Oh hey boos 😂 https://t.co/wNHkPlKxcW so true. I was right on the verge of losing my voice &amp; it was mad late so I was already sounding like a man. But once I heard the song I fell in love. Wrote it b4 I went to sleep. None of that was planned. I had no idea meg was on live or that she would want to go live 2gthr♥️♥️ https://t.co/2eRiYTrOIc 😂 Y’all know damn well that made it on the track some how some way! #DontRunFromMeFrennn #HotGirlSummer 8/9 #HottieApproved #BarbieApproved love to everyone supporting. ♥️ https://t.co/1z0YkcUiXo Those who know me never doubt me. And those who doubt me never knew me. RT @JoseDelRey_: Period! @NICKIMINAJ \n\nLink: https://t.co/HVIvGnQApG https://t.co/qH8MHJsGdx Stream #Extravagant on SPOTIFY No. I said “next” Monday but that was tentative anyway. Gonna chill on it for now https://t.co/mQdA5Lmp64 Listen to #Extravagant by Lil Durk on @Spotify RT @lildurk: #Extravagant ft. @NICKIMINAJ Not sure if I did personally by pulling out of the show, but thank u for posting so ppl can see results are happening in real time. There’s still a long way to go but this made me happy. #HumanRights https://t.co/g643AFMO1O Blogs pick &amp; choose who to post positive things from. Tell them to post the update on the Saudi women. 🦄 How y’all doin today? Where there’s life there’s hope. Get up &amp; do all those things you’ve been putting off. You deserve it! As we enter a new month, go harder than you’ve ever gone &amp; watch what happens. 🦄♥️ RT @ajplus: Saudi Arabia lifted travel restrictions on women. Until now, they have been required to get permission from male \"guardians\" to… RT @ajplus: Saudi Arabia just granted women the right to travel without male permission. But women's rights activists there are still in pr… I agree. I’m listening in mine now. That’s why we had to push back. Mix wasn’t right 😅 https://t.co/nguL9bRJln RT @nickiunderated: me giving my sexual partner instructions after listening to #Extravagant : bend me over, then hit it from the side\nlet… Ride game been on a billion for years #Extravagant https://t.co/tRu2rXo0Eg I sure would 🤷🏽‍♀️ https://t.co/dWz4TM6JNX 😭😂🤣 y’all rlly get on my nerves https://t.co/vGcDcoyA3e RT @Drakobuitron: “#Extravagant” by @lildurk Featuring @NICKIMINAJ is out now!\napple music: https://t.co/HgItEjhJP1…\nSpotify: https://t.co/… RT @MarcoRepublic: Best I Evah had.. not a diss lineeeee @NICKIMINAJ https://t.co/y6yS2sqz2R RT @ItsBriMaraj: “Keep cumin in it cus I want ya ba- a- a- aby “ #Extravagant https://t.co/d29UzmBOee 😭😂 https://t.co/DbI3G5NxXa 😭😭😭 the gif y’all rlly stupid https://t.co/6fgivHbpAZ 🥴 https://t.co/qe2LwcL7PE 10 mins‼️🎈 #LS4TS2 #LilDurk #Extravagant @lildurk https://t.co/6apdMxkGtG The “Dear fellow Barbz” part rlly just made me bust out laughing. 😂🙏🏽♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️ side bar: shout out to Chance doing these kinda numbers independently 😩🤣 you hate to see it 😭 Who God  Bless... #SlideAround https://t.co/A3F6pV82pd Lil Durk https://t.co/Hw0gKgu8sX No matter how good ya 😻 is, it can always be better. I know this is cliche but it’s one of the scariest realizations in life. No matter what you do for some ppl, they’ll always feel you should’ve done more. It’s the most toxic mentality. Yuck. Regardless of all that, (cuz we don’t know the fakks on that) thank you Wendy https://t.co/T5fCaaLB5f Bwahaaahahaaahaa Maddie 😩🤣 https://t.co/OuIYyURNHv Ok u know TF what. I’m going live right now to cuss y’all hoes out starting wit u 😂🤣 https://t.co/KLSnLqbaZQ Oh ok some of my chirren r being nice to me today. Owwwwwww kisses to my BAWBZ &amp; ONLY my nice BAWBZ. GOOD DAY! *waves bye but sits here to see who finna get clocked next* ☕️ https://t.co/7irV81Hs7f Y’all betta sit down &amp; leave dem ppl alone 😭 I’m TIDE. it always fall back on me when y’all act the damn fool. Y’all r chirren only a mama can love. And I’m y’all mama chile 🙄 ima go on live again &amp; call y’all out by name to cuss y’all out. keep getting on my nerves today bawbz https://t.co/OpESxwtxcy RT @CHINAGRIFFITHSX: Nicki: “can we move on now?”\nThe Barbz: https://t.co/jcDM5u8YoC I- https://t.co/VQ27VHP08u Superbass 11,459,000 - yes, over 11 million in the US, 18 million worldwide. Starships is 18MM worldwide as well. RIAA only recognizes about 9 million of that for superbass. The other 2 1/2 mill are recognized by billboard but not RIAA.  The end. We can move on now right? ♥️🙏🏽♥️ https://t.co/3N5Eq417yf #TheBarbz are on time out 🥴 Y’all 😩😂 Who’s the winner of the #MegatronChallenge ? Comment your top 3 ♥️😘 https://t.co/ybMooaumJO You’re dope I’m boppin to this all day. ♥️😩 https://t.co/1sIoNcQwkk Going live who’s up? Omg. Ppl rlly think I was being serious when I said I blocked 2 billion ppl. Is social media frying ppl brain cells or do they just choose to not get my sarcasm? Cuz ch- I- https://t.co/FPduIpYe0D I yelled. If u know u know 😭 https://t.co/SKOkKcy7cw RT @CHINAGRIFFITHSX: Nicki really wasn’t joking when she said “I don’t want you on my page, Blockiana” 😭 https://t.co/DqWCOXZevV Oh ok y’all bye https://t.co/82iaV7wOIx Wow IG stay stoppin my bag. I went to my settings &amp; there’s no block list. Btch they said I done blocked 2 billion ppl I guess I reached the limit https://t.co/dOY4WaJRhS Btch im tryna unblock Fendi 😩 now that he came on my show I guess we can be friends on the gram again 🥴 https://t.co/C4gEdm27O7 Omg y’all how do u unblock ppl on ig. I forgot World 🌍 STOP 🛑 — it’s a supermodel’s bday. HBD GORGEOUS 😘 @winnieharlow https://t.co/lLv4o4UDlY https://t.co/Pk0jTjTOt6 I get to my desk around 45 mins in to the DJ mix #QueenRadio Ep 14 is up NOW @TayHollyWood It’s actually “bout to dead this whole beef &amp; rock some gold teeth” but u got everything else right babe 😘 What’s your fave line on #SlideAround &amp; #ZainesAndFools ? 🦄 Thank you, baby https://t.co/5ZfXStAWOy Fukkkkk I knew it was smthn I forgot. YIKESSSSSSSSSSS wow why y’all ain’t remind me? 😒 https://t.co/S6vCwzcmzH RT @Barbey_kingdom: #1 Trending #QueenRadio WORLDWIDE &amp; #10 Trending WAKE UP HOES WORLDWIDE 🤣🌍🦄👏🏽 @NICKIMINAJ https://t.co/r4eu1LDZ5s RT @OnikasRing: IM CRYING THE WAY HER VOICE CHANGED \n\n“ barbz ily “ 😭 @nickiminaj #QueenRadio RT @taviondjuan: “wake up hoes” gotta be made into a soundbite for the culture🤣 RT @kyndall_kashme: Wake up hoes dkcjdkcjdk RT @TaeeKyle: “How do y’all not understand happiness vs clout” RT @arithabrat: YEEESSSAAAA READ THEM BITCH READ THEMMMNMM #QueenRadio @NICKIMINAJ RT @Nitascornerr: \"YOU WAS MINE\" YOU KNOW WHAT KENNY 😭😭😭😭😭😭😭😭😭 @NICKIMINAJ #QueenRadio RT @Imma_Twit_On_U: This FENDI x @NICKIMINAJ sit down is epic af! Long overdue &amp; WAS TIME.  Y’all gotta understand he’s an important piece… RT @MASEEZOLANSKI: @NICKIMINAJ drag him sis Well listen then chile 🤔🌚 https://t.co/XKzvbT9C5E Girl ok we’ll catch up wit u later. 😩If you know you know https://t.co/KwH0GN4aRA RT @Melly_Minaj: THIS CONVERSATION NEEDED TO BE HAD.....NICKIxFENDI #QueenRadio https://t.co/9psHRcxWov And that’s why I can never get mad in front of him 😭😭😭 i be having to smile real quick 😩 https://t.co/r7yiII9htr 🙏🏽♥️ https://t.co/kv11QqTOte 😭☺️ https://t.co/YVJ8voJ307 🥴 https://t.co/VVkCUAx5jH Send me your questions &amp; your phone number if you want me to call you. Bout to pull up to my desk #QueenRadio #SlideAround #ZaniesAndFools #TheBigDay https://t.co/PcnDgHofgs https://t.co/4ts19ThYnm RT @Spotify: #TheBigDay is finally here.\nListen to @chancetherapper's official debut owbum right now https://t.co/BcZYr8Jyue https://t.co/9… RT @onikasart: 2 hours #QueenRadio Congratulations to @chancetherapper on his new album #TheBigDay. I’m honored to be on #SlideAround &amp; #ZainesAndFools - y’all asked me to bring back Roman. He’s bakk https://t.co/UgMLoexXAp You played that off so smooth chile I- 😅🤣 10’s across the board for the transition from twerk stance to family reunion shoulder shimmy/2 step. YES MA’AM!!!!!! 😂 And I love DAD. ☺️ https://t.co/hTBzJwHNt4 Good morning I started doing #QueenRadio to have a lil fun w/my fans. I now have the most listened to show on Apple Music. I don’t think ppl understand. Don’t put limits on yourself. Please. I love you guys so much for the love &amp; support. I’m from South Side Jamaica Queens, NYC. like what? 😢 https://t.co/CWLWgz7iDq ‼️‼️‼️ MAJOR ANNOUNCEMENT‼️‼️‼️ #QUEERADIO IS GOING DOWN FRIDAY @ 12PM PST — 3PM EST☺️‼️‼️‼️ LINK IN MY IG BIO TO 👂 MY ISLAND GIRL PLAYLIST‼️ 🔥♥️FUN FACT: my last episode of #QUEENRADIO was the most listened to show on Beats 1 Radio This YEAR‼️‼️‼️‼️🎈🎈love you 😘🦄🦄🦄🦄🥳 https://t.co/QzhCVEqzRl Their only concern is clout on IG. nail techs have switched up too. I’ve had ppl tell me “I’ll do ur feet cuz its u but I don’t do feet” 🤨 we used to get nails, toes AND FEET DONE!!! they don’t wanna wash &amp; braid y’all hair cuz they not getting IG likes off that. No passion🦶🏽🥴 https://t.co/vEGdEx3rQo I have many questions. I jumped when he came off them steps 😭 y’all https://t.co/TA8iPRYsPU https://t.co/KRHFjRoFrb https://t.co/cYak4JklW9 Bloop! 😩 https://t.co/4Nr3xj1iTm You can just ask Ken 🗣 https://t.co/G7Chej5TCH Pop quiz. What’s the character name who says ahhhdukn in the game???? ☺️ let me kno when u figure it out so u can rap the last bar wit ya chest out. 🦄 Got my ass shots from Cupid https://t.co/KRHFjRoFrb #SugeRemix 🔥 I’m excited about my surprise y’all 😩 y’all will have it in minutes!!!! Love my babies til da DEF!!!! What y’all wanna hear? And what r your questions? @Power106LA #QueenTakeOver RT @NickiQueenBack: Y'all go watch the Megatron Twerk challenge. ❗❗ \n\nThese girls did it amazing!!! \n\nLook at this @NICKIMINAJ \n\nhttps://t.… RT @SiriusXMHits1: @NICKIMINAJ  Congrats! #MEGATRON is trending on the #YouTube15 today! Hear it at 6p ET!  🔥🔥 RT @Power106LA: Y'ALL LOOKIN' FOR THE QUEEN?👑 #NickiMinaj will be LIVE starting at 5pm on @Power106LA for #QueenRadio 👏🏽💯🔥 \n•\nHere's how yo… Now that y’all peep, we can move on. I’m mad hype for 5PM PST. 🦄 Been peeped that. RT @callietorres: to international barbz, here’s a helpful tweet #QueenRadio https://t.co/xSWy93GO5G This is just a one time thing. I’ll def be right back to Apple radio. https://t.co/r3ZqDype4i No https://t.co/RK28EgwbqO Yes. It’ll be exactly on time. 5-6. One hour. You don’t wanna miss a second of it &amp; that’s all I’ll say about ZAT ☺️ https://t.co/GkYCKDGqna Today @ 5pm PST I’m taking over power 106 in LA. Ya think ya ready or?....... RT @Power106LA: 🗣 Y’ALL....THE QUEEN ABOUT TO PULL👏🏽UP👏🏽ON👏🏽US TOMORROW! 🔥🔥🔥 5pm LISTEN LIVE! https://t.co/RjIeNgGHKl #NickiMinaj #QueenRad… Might get one tmrw 🤫 https://t.co/1KyXPB070o 😘🙏🏽🦄 https://t.co/DWWXFVGl9s Who has your fave #MegatronChallenge that I didn’t post yet????? Tag me here and on IG. 🦄 Love you 🥴😂 that’s rlly my character too. Why y’all put the and I - oop voice on me. Y’all childish 😂😂😂 https://t.co/eGwgNHEgti RT @AngryBirdsMovie: The #AngryBirdsMovie2 crew is breaking into theaters in just 1 MONTH! Don’t miss it August 14! https://t.co/DO7UNuTtb4 😘 RT @CHINAGRIFFITHSX: #MEGATRON by @NICKIMINAJ is now available! \n\nApple Music: https://t.co/0U3na0eNOa \nSpotify: https://t.co/2WIETTGPge… Love you. Love you sm. Of course you are https://t.co/GmuIXDrLPC RT @NLiddle16: .@NICKIMINAJ now has #MEGATRON gifs available to use on your instagram stories! Check em out! https://t.co/IETv7OZWD9 https://t.co/DWWXFVGl9s https://t.co/ZFIs6d8XmR RT @nickiminaj1stan: @NICKIMINAJ It’s a lot of people who can’t wait till u say something just to have something to say continue doing u th… RT @NLiddle16: @NICKIMINAJ DONT LISTEN TO THEM! it’s not worth it anymore, Nic. They always gonna take it another way. Love you. Gods got y… It’s like y’all purposely misunderstand me. Just say you don’t like me and GWARN!!!! 🤣 Ummm for the ppl in the back, I wasn’t saying Jamaica doesn’t have women’s rights. I gave an example of what happened in JA to explain how easy it would be to do one thing wrong in Saudia Arabia b/c I’m not aware of every single rule &amp; be locked up. Everyone knows I love JA. STFU I performed in Jamaica before &amp; when i got off the stage I was surrounded by police with guns drawn. They were ready 2 take me to jail b/c they said I forgot to bleep a couple curses.... I could make one mistake &amp; go to jail in a diff country where women have no rights. #FreeAsap ⁉️ https://t.co/tdhHxP78XY That’s what I’ll try to do today https://t.co/zhZ8W1RYsr True or???? https://t.co/JwMsBcDyCw I’m tired of my fans sending me DM’s saying they want to commit suicide. You guys will never know the things my fans express to me privately. It would break me if even one of my fans were arrested, or BEATEN for expressing themselves. God is LOVE. NO disrespect to the Saudi govt RT @HAGIMINAJ: It’s very important to let ONLY the Saudi Arabian Barbz answer those questions y’all. https://t.co/XFT9HcqloP 😢 https://t.co/zY6XuxuX4j True or false? https://t.co/JtHTyeXevN True or false? https://t.co/6WYsnLPEUV Big phat 😻, Mufasa https://t.co/QcXFFUrvfm Where is the lie? 🙄 https://t.co/y3ztFQNXTz Tag ya fave DJ. I need 10 A&amp;R’s. Yes. Pls make sure there are only humans working there https://t.co/xwRKMo5JYN i- Yes you will get paid in public assistance. Will food stamp cards work? 😂 Me &amp; my fam got by on food stamps for years. 😒🥴 https://t.co/bGzV63CKnK Plus marketing &amp; promotions, etc Hoes... sike I’m looking for A&amp;R’s, producers, GHOST WRITERS🥴, etc https://t.co/bCsTx22I11 https://t.co/UdJ41pRO8s https://t.co/DWWXFVGl9s RT @d_vibesss: SKILL 🥵👏🏽 #MegatronChallenge https://t.co/1sZxsOUpdn https://t.co/T1Mf7Ddayw RT @Strikes_1: Had To Add My Twist To The #MegatronChallange #UkDancehall 🇬🇧🇯🇲 @NICKIMINAJ https://t.co/GdD6ATd5ix 😭😭😭😭 https://t.co/jn1dHPZeLh Oh nah. No lip syncing on this side 🤣😂😭 https://t.co/OZT86TJxHK https://t.co/OlDzxYQnf7 #MegatronChallange RT TO THE WORLD!!!!!!!!! I’ll post it shortly https://t.co/WSNGLaiwxL RT @NM5updates_: #MegatronChallenge by @NICKIMINAJ starts today through July 27th. 🎶 \n\n1st place: $10K + visit Nicki\n2nd place: $5K\n3rd pla… RT @TheNextkidz: Megatron💅🏽\nTag @NICKIMINAJ @NICKIMINAJ 🐊\nShare With Your Friends &amp; Family!💗\n#nextkidz #nickiminaj #megatronchallenge https… #MegatronChallenge https://t.co/WP5rl2wl8K https://t.co/8zjrNAB9eW That earthquake was intense And I love you back mama!!! @lizzo https://t.co/Mis6i4Idau RT @minajrel0aded: @weluvche killed it with that. 🔥 #Megatron https://t.co/wbA04XGb0l And #Queen still went platinum b/c God is real &amp; my fans are incredible. https://t.co/9Uyd2yrAaz NOW SHUT TF UP U DUMB FUCKS. LMFAOOOOOOOOOOOOOOO https://t.co/68zKFtHOJy I added some https://t.co/DWWXFVGl9s RT @BacockObama: one of the clermont twins dancing to @NICKIMINAJ megatron 😭❤️ https://t.co/MOuyalWrbf https://t.co/DWWXFVGl9s https://t.co/fc7uD4ZsXB RT @JaiLovesNicki: Don’t forget this iconic one @NICKIMINAJ ‼️ #Megatron as a good workout song. 🔥 @slimsmthin https://t.co/yADrI16KaM RT @OnikaLilBaby2: Sooooo I kinda came up wit a mini dance 🙈💕. @NICKIMINAJ #Megatron #MegatronChallenge https://t.co/gj2F64L6pA RT @celebslovenicki: @Jasminejmasters listening to @NICKIMINAJ’s #MEGATRON on instagram live! 😍💕🔥❤️😍🔥🔥❤️ https://t.co/UShURNPkjb RT @SaraTM_: TSR runway are playing #Megatron ! 👀 https://t.co/BVnLzNLUDa RT @anthonin: Each time I play #MEGATRON by @NICKIMINAJ BRRRATATATA 😍🔥 https://t.co/UpWxIWv7Zd RT @King_LMeL: @NICKIMINAJ #megatronchallenge who want it? 🔥🔥🔥💪🏽  #Megatron #Nickiminaj https://t.co/L8k1JPVPWm RT @SaraTM_: I found this video on my little sister’s ipad 😩😂 she was feeling #Megatron 😭 https://t.co/5mGPh3sNeB RT @CaliMOfficial_: My mother heard #MEGATRON for the first time and let’s just say she finally has a new favorite song other than Itty Bit… RT @rawad_minaj: My little niece living her best life😭😭🤣 #MEGATRON @NICKIMINAJ https://t.co/R8Do8enygt RT @KaliDean_: Megatron x Wobble up @NICKIMINAJ 🍸✨ https://t.co/mhqUjrWHFP RT @amrezy: #MEGATRON 🎶 https://t.co/iAleZc5ANh RT @fagnika: drinking to #Megatron for NYC pride weekend 💕👑🌈🌈🌈 we love u @NICKIMINAJ https://t.co/Q2fAbDsNc9 RT @SHAIANNE_FOSTER: #Megatron at #PrideNYC 🏳️‍🌈🔥\n\n https://t.co/2vRNDxZzET 😅 https://t.co/hbxaUM7edq ♥️ @amazonmusic #AlexaPlay #Megatron 🦄 https://t.co/INXlgLWPQo Posted the wrong one on my IG yesterday 🙄 my hand was blurry. So what y’all doin? https://t.co/TDfGQRe20h I did my 1st pride concert in ATL like 10 years ago &amp; I’ll never, EVER get over it. The energy in the room was like nothing I’d ever experienced b4. 🌈 I thank you &amp; love you for all the love &amp; support you’ve shown me. God bless my babies. RT @SiriusXMHits1: @NICKIMINAJ  Congrats! #MEGATRON is trending on the #YouTube15 today! Hear it at 6p ET!  🔥🔥 RT @FallonTonight: .@NICKIMINAJ incorporates 3 random words into a rap on the spot in Wheel of Freestyle #FallonLIVE https://t.co/g6kGDIVUXj RT @redlobster: .@jimmyfallon and @NICKIMINAJ together at Red Lobster? Yeah, it’s going down on @FallonTonight this evening! https://t.co/9… 😭 https://t.co/BxAG0u4BPq For the record; that was iced tea in that lobsterita glass. No alcohol was consumed in the making of our dinner date. ☺️ RT @jimmyfallon: TONIGHT! Red Lobster Redemption with @NICKIMINAJ! #FallonLIVE https://t.co/3wXDLuCftt Who’s watching @jimmyfallon tonight? #Megatron https://t.co/nvG6OlU5Sq RT @RealSway: ICYMI, watch @NickiMinaj's new video for “Megatron” https://t.co/QEzOAeyF4f https://t.co/BP6M4ECg6C 🤣 When u go out of ur way to b spiteful &amp; hurt artists who have always supported ur show... when you fire great ppl who have put their heart &amp; soul into the show... when you’d rather be a messy reality show than a prestigious award show... when ur still being dragged by that lace https://t.co/DOYKmgAlyr #HappyBirthdayArianaGrande ☺️💋 https://t.co/2I9cb1ViZs 😜 https://t.co/v8Rs7meH7D RT @amazonmusic: . @NICKIMINAJ drops first solo single of the year with 'MEGATRON'. What do you think? Check out our #RapRotation playlist… https://t.co/8ULJ6SPune https://t.co/mlwUo2uEAT Why do y’all keep taking it off the menu in the first place? Just leave it. Y’all mad aggy. https://t.co/yuoG19ZPTT RT @FallonTonight: Pound the alarm at 11:35pm EST this Thursday because @NICKIMINAJ will be on #FallonTonight! https://t.co/SuCbZJx6Fq https://t.co/zgjQQY3Hp9\n\n#Megatron https://t.co/gBGTxsgXyQ https://t.co/rHnqjiylL8 RT @iHeartRadio: .@NICKIMINAJ takes it to the jungle in her brand-new #MEGATRON music video. 🌿 https://t.co/yUYm2iB7OJ Part 2‼️‼️‼️‼️ let’s go!!!!! https://t.co/nhaEi49WM9 His guard goes up when y’all r around me acting excited cuz he thinks y’all can hurt me. 😂 but when he hears the stories from some of my fans about how they think I’ve helped them to stay in school &amp; deal w/their identities, etc., he seems rlly moved by it. https://t.co/dnWzDwqklp 🤨 https://t.co/04XycCofba Actually, Fallon is airing on Thursday so tune in!!!!! It’s gonna be legendary!!!! Ok bars https://t.co/RxvDBa2rtr U betta hope nobody steals this chile... https://t.co/6plUqzOBi0 Yes!!!!!!! https://t.co/PwkYFe7dj6 Why do y’all worry sm about these things? 🤔 https://t.co/6YKQO0pSTR I kinda missed that whole moment cuz I wasn’t on line. But my label ppl were texting them to me telling me to retweet some. I was like boy I’m on down time, bye 😂. When I saw some of them they were mad cute &amp; funny tho. Especially the kids. https://t.co/XwMPcHcWVN Hello miss Vervetron, I didn’t know there was a sign for that, so no 🥴 https://t.co/7akwkzr8sz He won’t even say the word “Nicki”. He has called me onika since I was 15 so it’s hard to change that. I wouldn’t date anyone cuz I’m about to be married to my soulmate. But that was the problem, others r infatuated w/Nicki Minaj he DGAF about this industry &amp; is very protective https://t.co/zYshu5P8y7 Ok bars https://t.co/NkAl1YRWyi I b feeling like y’all interrogating me 😂 I shot it prior to going on tour. https://t.co/D4gi73yqzq THE BADDEST!!!!!!!!! https://t.co/3I0FzzUW6J Go sit down 🥴😂😭 https://t.co/tamehD31M7 I woke dat ass up &amp; said take off ya shirt, I need u 2shoot this scene. He had fallen asleep in my dressing room. He was mad aggy. He was grumbling all the way to the set talking bout he cold 😭 I said boy go over there &amp; b quiet. Once he saw the video he was cheesing nonstop 😂 https://t.co/J7sSK9izWI First came the beat &amp; hook. \n\nThen I freestyled the first verse. It just so happens the first line out of my mouth was; they call me Megatron. \n\nI originally named the song Braaatttt \n\nI changed it to #Megatron after the video was shot cuz it had a better ring to it 🥰\n\n🥴 https://t.co/JXLGCqM8GZ The #Megatron Q&amp;A IS HERE. ASK YOUR QUESTION ☺️ RT @Vevo: 🚨Calling all #Barbz 🚨@NickiMinaj has returned and this time she’s taking us back in time with a “Filthier Riddim” sample that sla… https://t.co/Vvu8fXtxtU\n\nhttps://t.co/DWWXFVGl9s #Megatron https://t.co/yipxNQIkFN King shit https://t.co/6ENf3xDter RT @NikolasMiraj: Somebody tell Nicki to repost this on Instagram.  Get the people going... https://t.co/Ccv8jTTFjU baddie baddie!!!! Let them know!!!! https://t.co/eDCqptEqaw 🥰🙏🏽♥️❣️ https://t.co/eLjrWzqnw2 😭😭😭😭😭😭😭🥴🥴😭 https://t.co/wkDWY8MZo0 Brrratatatat ☺️🥰 #Megatron https://t.co/gs4UetkKcr Thank you mama 🙏🏽♥️‼️ https://t.co/TEKQeTsaWd Haha!!! Omg. Ok. Love all 4 of you. Thank you so much ‼️‼️‼️ https://t.co/4Ld27PtNOk RT @minajrel0aded: This was one of the best Queen Radio episodes ever. I’m so grateful for the Queen and for everything she does for us. No… RT @TR4PDUNG3ON: ok bye i’m crying. bye onika. #megatron #QueenRadio @NICKIMINAJ RT @rawad_minaj: Still waiting for them Cocksucker of the Day, Month &amp; Year awards @NICKIMINAJ #QueenRadio #MEGATRON 😜♥️‼️ https://t.co/Xt9W0X4LyX RT @aliminajxx: All the tea we getting on this episode &gt;&gt;&gt;&gt;&gt; #MEGATRON #QueenRadio https://t.co/9lG9QQ1oTN RT @minajsquad_: Trina owe 50 cent money just for answering that question😂 #QueenRadio RT @_CrownDee: “iTs a SaG tHiNg” #QueenRadio https://t.co/00fcI1oGDb RT @TaylorxReneeee: This @NICKIMINAJ x @TRINArockstarr moment 😍😍😍😍😍😍😍 https://t.co/GTd5Kb4Xm3 RT @ItsBriannaBch: Me watching Nicki say all good staff about sagittarians and Amma LEO 😑\n\n#QueenRadio\n#MEGATRON https://t.co/QaPGD5BxP7 RT @DesireeWirth: Nicki’s laugh is the best part of every episode 🥰   #QueenRadio RT @stevensands_: This exactly how @NICKIMINAJ got me feeling 😭😂😂 #QueenRadio #MEGATRON https://t.co/tKbRLLGMSa https://t.co/NqeQ68MW9p RT @onikamajesty: this episode of #QueenRadio &gt;&gt;&gt;&gt;&gt;&gt;\n@NICKIMINAJ please upload this somewhere ASAP 🔥 RT @nickimX_: We still trending worldwide. QUEENSHITT 🔥🔥 #QueenRadio #megatron @NICKIMINAJ RT @NickiAnaconda: Hold on!! Can we acknowledge the marriage license!! I’m so happy for you Nicki @NICKIMINAJ 😭🥰 sending love and powerful… RT @SaraTM_: IM LIVING!! All this tea!! #Megatron #QueenRadio RT @OnikaPromotions: “I like the comparisons, because no one can compare. “- Nicki Minaj \n\nWHEW THATS THE MF TWEET\n#Megatron #QueenRadio ht… RT @Chantal_Hacker_: #QueenRadio is everything tonight! #MEGATRON Answering this &amp; much more. Plus there r some serious thangzzzz I need to get into. See ya in one hour boos. 😘 https://t.co/JXLGCqM8GZ Ok y’all, keep #Megatron in ur tweets &amp; I may call you or shout you out on #QueenRadio — we are live in 2 - 2.5 hours on @AppleMusic @Beats1 listen here when that time comes. https://t.co/Pk0jTjTOt6 This Tweet from @NICKIMINAJ has been withheld in: United States. RT @Shazam: It’s #MEGATRON time!!! Stream our Song of the Day on @AppleMusic &amp; don’t forget to #Shazam ---&gt; https://t.co/D0IkolH3RC 🔥🔥🔥 @NI… Queen tingz, 🙏🏽♥️💋 https://t.co/TQftJvGClQ RT @AppleMusic: YAAAS, @NICKIMINAJ is back with #MEGATRON. Listen now and get ready for #QUEENRADIO coming Friday at 2PM PT on @Beats1. htt… https://t.co/Vvu8fXtxtU \n\n#Megatron https://t.co/8zwJofoBet RT @Spotify: Onika is back 🦄\nListen to @NICKIMINAJ's #MEGATRON now https://t.co/nCxdq17Mx1 https://t.co/a4jm8zs5es https://t.co/DWWXFVGl9s #Megatron https://t.co/DWWXFVGl9s https://t.co/u94x4MhO7q 😂 #Brrratatatat ‼️‼️‼️‼️♥️ https://t.co/gTOWBh13pg #Megatron video @ midnight EST\n#QueenRadio tmrw @ 2PM PST https://t.co/Z2DXIYoAqO #Megatron tomorrow — midnight https://t.co/3PdhOlS0O2 Correct https://t.co/SAt85ubIfA Midnight. 💋 https://t.co/afvO2EdhEV My name is #Megatron — what’s your #TronName? ☺️ I’ll shout out some of my faves on #QueenRadio this Friday. Happy Father’s Day to all the daddy’s &amp; all the zaddy’s. ☺️♥️ 6/21 #Megatron + #QueenRadio MEGATRON RT @chrisbrown: New single WOBBLE UP Featuring @NICKIMINAJ &amp; @G_Eazy is available everywhere now! VIDEO COMING SOON! #INDIGO https://t.co/J… #AMSTERDAM always takes the crown 👑 for livest audience. ☺️🙏🏽 Thank you. Love you. #NickiWRLDTour 😘💖🦄 https://t.co/rHA5l1fbnl My fans r an obsession 🤪 love you guys 😘 Poll alert. Choose your fighter. My heart is with our Muslim brothers &amp; sisters at this time; after the senseless act in New Zealand. ♥️ Dear Ireland, I love you. 🇮🇪 You put on for #Birmingham + handled yourself like a real pro 😘♥️😍 thank you miss Leeeeshurrrr☺️🇬🇧🇬🇧🇬🇧🇬🇧🇬🇧 https://t.co/zEe6rxbWW0 I won’t bite. Promise ☺️ #Birmingham you ready?!?!! 🇬🇧 https://t.co/rCovUxswNc https://t.co/xbXVbXtSRa RT @bbfrizee: You know tf wet? @NICKIMINAJ IMMA FIGHT FOR THE SURPRISE GIVE US FOOD #QUEENRADIO USA AND CANADA IS HUNGRYYYYY🙄🙄🙄🙄 https://t.… RT @JohnCohen1: @onikamajesty Love seeing #QUEENRADIO trending! @NICKIMINAJ RT @Naslicoco: You need to do a song with an African artist sis like you need to murder an afrobeat track. #QueenRadio 🙏🏾🙏🏾 @NICKIMINAJ RT @onikamajesty: the day Nicki created #QUEENRADIO is a BLESSING! One of the greatest ideas Nicki had 😂 https://t.co/0nQLZKUlaa RT @J0hntavius: Imagine if #QueenRadio was never born... omg life would be so BORING RT @BarbBriKE: On the African mood. Are there ever gonna be African Tour Dates 😭. @NICKIMINAJ #QueenRadioLondon RT @kyleminxj: #QueenRadio is trending #2 worldwide and #2 in the uk 😍👑 @NICKIMINAJ https://t.co/Czzow7cfB6 RT @pinkprinttingz: All this African and Caribbean culture. The energy &gt;&gt; #QueenRadio @NICKIMINAJ https://t.co/YrdSgeQHRi 🙏🏽🇬🇧♥️ https://t.co/h50xkGqhV9 https://t.co/PcnDgH6EoU #QueenRadio #QueenRadioLONDON starts in 30 mins 🇬🇧 #QueenRadioLONDON in 1 hour!!!! @Beats1 @AppleMusic https://t.co/R26FjciaAm RT @devin_walston: 1 HR! WHOS READY🔥👑💨 @NICKIMINAJ #QueenRadio https://t.co/VGlXwAi2wv Huh? https://t.co/EjwVK5Qp3k 2pm London time. 10AM EST. tmrw #QueenRadio https://t.co/FMV3HgKs0L #QueenRadio LONDON edition tmrw @ 2PM for LONDON. 10AM EST. 7AM PST. 🇬🇧🇬🇧🇬🇧🇬🇧🇬🇧 This is so sad. My heart goes out to every family who lost someone in this crash. https://t.co/omrHEKSFJR Should I do #QueenRadio in LONDON? ♥️😘♥️ https://t.co/qB83hWKAYe Why would an artist cancel a show &amp; lose money? What for? When they’re already in the building, dressed, etc. The artist is just as mad as the fans when a show can’t go on. I love seeing my fans. Nothing can stop me. B4 the show, juice WRLD &amp; I are just as excited as u guys are. RT @kingsleyyy: No, you didn’t listen to that because the lyric is “I’m only loyal to the NIGGAS that’ll bust guns for me” and it has littl… 😦😢😍 https://t.co/mMm5o23YuW Love to this lil lady &amp; love to all you iconic women out there in the world. You are appreciated. https://t.co/1FeRaCnkTn 9:12 PM 💖 https://t.co/rOVizQ7McY What’s a good restaurant in #Paris @ this time of night? \n\nIs it too late to go to the Eiffel Tower? Europe &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; Don’t spend your tax refund 1:22 PM in #Berlin #Germany 🇩🇪 ♥️ Omg they look so dope!!! LOVE IT! https://t.co/sBlX5sxd4D 😢🙏🏽😘💖 https://t.co/vUGdWKZ6gW 🙏🏽💖😘 https://t.co/Q3DoKTmqJD Europe #NickiWRLDTour with Juice WRLD. Beginning tmrw in #Munich #GERMANY 💖 https://t.co/esku1UeTqA Swipe for New Merch. https://t.co/D6rPXvRvpM 💖 Tour begins tmrw in #Munich, #GERMANY 🇩🇪 https://t.co/s4y39JgE9V On a scale from 1-10 how happy are you that I have #QueenRadio now to connect w/you guys on a diff level?! I rlly had my babies goin crazy on the last #QueenRadio when they realized they was gettin fed w|2 freestyles. 😅🤣 one of my fave parts is watching u guys live tweet during the show. Y’all mad cute or whatever... 😝😘😘😘🙄💖🦄 Eat da 😻 then I beat da blockiana 👅 u better drop this ain’t nobody bout ta play wit u 🙄 https://t.co/SFcjbgsz9n RT @AEG_Presents: Don’t miss @nickiminaj &amp; @juicewrlddd on the Nicki WRLD Tour in March 2019! RT @HipHopNation: Wooo heard the Queen  @NICKIMINAJ play Renee by The Lost Boyz earlier 🥰🥰 She has more up her sleeve #HipHopLove on her #V… RT @SIRIUSXM: Spend #ValentinesDay with @NICKIMINAJ as she spins hip-hop love songs every hour and dips into a few of her own highlights an… 😘😘😘😘 @Camila_Cabello RT @Shazam: #DumbBlonde is out now!!! Listen to what @AvrilLavigne and @NICKIMINAJ cooked up on @AppleMusic ---&gt; https://t.co/cOP9KH8792 🎶🎵… RT @Spotify: Get up, play it loud 🔊\n@AvrilLavigne's new single with @NICKIMINAJ off her upcoming album is here. #DumbBlonde https://t.co/n3… RT @JustJared: Listen to @AvrilLavigne and @NICKIMINAJ team up on #DumbBlonde! https://t.co/cIm6qE8Vlx RT @AppleMusic: .@AvrilLavigne x @NICKIMINAJ link up on #DumbBlonde. Listen now.\nhttps://t.co/6I44bB3Ez2 RT @breatheheavycom: An anthem. Avril Lavigne and Nicki Minaj's new song \"Dumb Blonde\" has arrived: https://t.co/7gDrhLruoq RT @TheJUNOAwards: #DidJUNO @avrillavigne collaborated with @NICKIMINAJ for her latest track #DumbBlonde ?! 😮👉 https://t.co/OvkhH3vmki http… RT @pride_site: \"Keep your confidence up and don’t let anyone tell you how to be.\" Preach, @AvrilLavigne! #DumbBlonde https://t.co/Jk85K58Y… RT @billboard: Avril Lavigne unveiled new collab with Nicki Minaj “Dumb Blonde” #BillboardNews https://t.co/UPQELiisZL RT @djlooneygoham: Wasn’t There To Catch The Vibe But I Think It’s Safe To Say That The Remix Y’all Fake Hate Went Up Last Night 😂🔥 #Barbia… Lyric video #DumbBlonde https://t.co/OaSvzd4HKB https://t.co/CH2RhqfIM5 #DumbBlonde Love you mama, thank you. https://t.co/7dOGAoGOul I liked this interview too xo https://t.co/HENTGDspRL I used to drive to my job @ Red Lobster playing this woman’s album for an hour straight everyday for months. Crying to “I’m with you”, blasting “complicated” “things I’ll never say” “nobody’s fool” “sk8er boi”. 😩 omg. #DumbBlonde tmrw. This woman is so unbelievably talented 💖 https://t.co/7h75jZHIW2 I pissed off the same man Ariana just called out for lying. Grammy producer KEN. I was bullied into staying quiet for 7 years out of fear. But I’ll tell my fans the REAL on the next episode of #QueenRadio they deserve the truth.\n\nAlso, CONGRATS to everyone who won last night. 🙏🏽 https://t.co/YjmoIOPt6o I can’t thank you guys enough for all the love &amp; support you continue to show me. To everyone who said something sweet, thank you. Whether I read it or not, I felt it. From the bottom of my heart. I love you so much. So so so soooo much. Stay tuned. ♥️🦄🦄🦄🦄🦄♥️ Who said “we were sick of watching Baby Boy anyway” I- 🤣🤣🤣🤣 @BET Dang @bet still getting dragged by that lace 🤦🏽‍♀️ https://t.co/ZoHqMZ7UwW https://t.co/gj7ABJv6tP Meanwhile, BET is being dragged by their lace front. 🤣 https://t.co/7rFn58hwXx Absolutely. Get your refund ASAP https://t.co/Fj2JU6lHxR RT @xojahshari: \"The most disrespected person in America is the black woman.\" Whew chile, Malcolm X never lied. https://t.co/K1jQXG6b5H Young Money will no longer be apart of the BET Experience or award show. ♥️🙏🏽♥️ Summer Tour dates dropping soon 🦄 RT @nickixonxfleek: Can’t wait to see you in Norway!!! 22 days😍😍😍😍 https://t.co/kz3zb5TSQk RT @PSMiNAJ: SEE YOU IN MANCHESTER😍😘😘😜. #NickiWRLDTour https://t.co/CrJ0zBD4l9 Mixtape/Freestyle section is the real deal on this tour. https://t.co/eutoUgu57J RT @badgalnika: I... See... My... SHOW!!!!!!!! Amsterdam-March 25th, let's fkn go😭 https://t.co/veParQ1lOp RT @Queendomnnic1: 18 days until I’ll meet &amp; see you in Berlin 🇩🇪🇩🇪💕💕 can’t wait @NICKIMINAJ !!!!! https://t.co/4dgzW3lWc1 #Europe #NickiWRLDTour https://t.co/UQcqoRdj95 RT @Minajfanforever: I’m sooo excited for this one 😭 can’t wait to see my bby again in Brussels and Amsterdam ❤️ #NickiWrldTour https://t.c… RT @NickiMaaraj: Wow this made me tear up. The same month and the same weekday(monday). 4 years apart😭 @NICKIMINAJ \n\n(My shows) https://t.c… Dropping way b4. I told u guys on #QueenRadio 🤪 https://t.co/NyqhiwbL5N RT @Piinkslam: 19, 26 &amp; 44 days until #NickiWRLDTourEurope 👸🏽💫❤️\n\n@NICKIMINAJ can’t wait to see you finally again babe!!! https://t.co/7U39… RT @lorandmaraj: This made me tear tf up...........omg. https://t.co/dGJiStDEzu RT @MINAJJES: I’m just ready for US tour info 😫 I’m getting stressed at this point https://t.co/REKvr7cnY4 RT @husseinminaj193: OMG, my favorite songs 😫♥️  @NICKIMINAJ https://t.co/j5El0Ii2t6 RT @RohatMinajj: See you in Amsterdam Queen ❤️ @NICKIMINAJ https://t.co/JvMV4xzg2o RT @TeamMinajItalia: See you there babe 😭😭❤❤ @NICKIMINAJ https://t.co/5goYwwWsUO RT @Nitascornerr: OMFGBJDBSSJ OMGGGGG 😭😭🔥🔥🔥🔥 I literally can’t wait yo \n24 days till I see ya in Belgium @NICKIMINAJ 🙏🏾💕 https://t.co/X1eGX… RT @DJWhooKid: Going in on these @NICKIMINAJ 👑 freestyles for the @RecordingAcad #GRAMMYS mix weekend on @Shade45 with my new @Eminem tee 🔥… Love him 🙏🏾 https://t.co/yVS7DrnCvC Yaaaayyyyy!!!!! https://t.co/ksQ0GUdE39 #Queen https://t.co/jbIdDeS0BF RT @NLiddle16: In love with @nickiminaj’s “Queen” fragrance. The bottle, the smell, the packaging — all amazing. All perfect for an amazing… RT @audiomack: There's a new No. 1 Song of the Day! #BustDownBarbiana by @NICKIMINAJ 🏆 \n\nListen: https://t.co/NCMod4tcro https://t.co/ppLDX… RT @BENBALLER: I don’t get into any of the political shit or beefs. Man Nicki got bars 😭. \nShe really consistently been spittin 🔥🔥🔥🔥 since… RT @onalll4s: This was 2015. Nicki was ahead of her time as usual 😩🤯 https://t.co/aghMs2c6N1 RT @SAINTBRAN: Internet stans are so conditioned to appreciate charts and numbers on Billboard, that they forget rappers like Nicki can shi… RT @Power106LA: .@NICKIMINAJ Barbiana goin all the way up on the #LIFTOFF 🔥🔥🔥\n\nLISTEN HERE: https://t.co/KuIQxve48X\n@J_Credible @djsourmilk… Rocky had to fly out on the day I shot  &amp; I had flown out by the time he shot. Ferg &amp; I have the best chemistry. That’s my guy. It was FREEZING cold that day. lol. We all just pushed thru. The food was AMAZING. https://t.co/zs8pJ1x5qP RT @MikeWiLLMadeIt: #RUNNIN VIDEO OUT NOW ‼️\n\n@asvpxrocky @NICKIMINAJ @ASAPferg \n\nhttps://t.co/nBx0aKPrZz The fact that this is actually 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥omg 😂😂😂 https://t.co/uMq9OiqpKi RT @playboibonnie: #BustDownBarbiana my twin sister 🔥🔥🔥🔥 https://t.co/ynyqT1qu7k RT @onikamajesty: 600K plays in 5 HOURS! 🔥🔥🔥🔥 #BustDownBarbiana https://t.co/16W8cnZZ9n RT @pattyplainjane: .@NICKIMINAJ you breathe and get mf’s flustered. I want the power you have. 🤣🤣🤣 RT @itsebonylashae: I played #BustDownBarbiana in the car for my sister and she said “IMMA HAVE TO DOWNLOAD THAT SO I CAN TWERK TO IT”🤣🤣🤣🤣🤣… 🙏🏽🙏🏾🙏🏾 https://t.co/BrlbOW5nNd 😛😛😛 https://t.co/JilwWXA9iZ RT @Kharharee: I just got whole ass cussed out at work thanks to me spazzing our. The Army don’t play that Nic #BustdownBarbiana COME THRU… 😭😭😭 https://t.co/Gj9qBSnsg3 I love you too. Thank you guys sm♥️ https://t.co/Upg3f7BvxS RT @MehganJames: “Benihana  to Katana” ...Yazzzz I felt this in my soul 🤣 #barbiana - @NICKIMINAJ RT @onbIood: Dj Boof speaking on Nicki Minaj. https://t.co/LO1C8u7ktq RT @TreZolanski: Nicki laughing when saying “ then add a dot “ &gt;&gt;&gt;😭😭😍😍 #BustDownBarbiana RT @iTSBARBiELEX: I BEEN A BAD BITCH, COCKIANA.\nN IM STILL WINNIN, PACQUIANA. https://t.co/GYPbaz1nIT RT @PLaYBoYKeNxX_2: Idk what’s gotten into Nicki lately but I LOVE IT!!!!!!! Y’all done pissed Onika off 🤣 RT @amrezy: “I don’t want you on my page, blockina” bitch I hollered 🎶😆🔥 @NICKIMINAJ RT @NataliaMMinaj: Times like this I wish I can hug @NICKIMINAJ and tell her how thankful and proud I am of her and to be a Stan. My baby f… RT @minajlikebarbie: @audiomack @NICKIMINAJ HE SCREAMING MY GOVERNMENT “ONIKAAA TANYAAA” 🦄 @NICKIMINAJ #BustdownBarbiana https://t.co/amMlI… RT @LalaxMaraj: Bitch tell me why Bust Down Barbiana might be my new favorite... my girl.. MY GIRL. @NICKIMINAJ that pen of yours.... RT @loso4ever6685: Oh they wanted the old onikaaaaa back...dont cry now!!#BustDownBarbiana RT @AylinMinajestic: Imagine being able to ride any beat and writing your own shit on every song. My girl Onika can relate Not more than you’ve been there for me behind the scenes. Love you. For life. https://t.co/yDCpmI9RZO RT @TEYANATAYLOR: 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 https://t.co/EhFCPQCnOL RT @stevensands_: He screaming my government O-Onika Tanya 🗣🗣🗣🔥🔥🔥 https://t.co/DiGqL1DZIZ @NICKIMINAJ this my favorite freestyle right now… RT @LeliaMinaj: ANOTHER FCKIN SONG OMFGGGG #BustDownBarbiana @NICKIMINAJ https://t.co/7eJBTNIYcQ RT @PinkRebelFleur: wait did she reference this (w/ Your Love too \", ikno).? 💀😭😭 \"BOP BA DOT DOT BA BA DA DA DOE\" #BustDownBarbiana https:/… RT @OnikasNieeecey: I Been A Bad Bitch Cockiana ‼️🔥😍‼️#BustDownBarbiana https://t.co/OuLyey36Al RT @TM_BaisleyBlvd: “PEANUT HEAD BITCHS” HAS ME WEAPING! Like @NICKIMINAJ make sure “comedian” is listed next to ur name on Google also. 😂😂… RT @CoverboyMinaj: YOOOOOOOOOOO ONIKA DONE DID IT !!! #BustDownBarbiana ❤️❤️❤️ RT @dylanr9797: Before this song came out bitch you been a thot!!!! 🔥🔥🔥🔥\n\nThe WAY SHE RODE THIS BEAT YO!!!! 🔥🔥🔥🔥🔥❤️❤️❤️‼️ #BustdownBarbiana RT @lilleek2k17: This is so FIRE I love it!🔥💕💕 #BustDownBarbiana https://t.co/XbvWTM0eo3 RT @celebslovenicki: I don’t want you on my page blockiana!!! @NICKIMINAJ #BustDownBarbiana is the shiiiit I needed today 🔥🔥🔥😍😍 RT @NoFraudss: Bruh when she laugh. I lost my motherf soul. I laugh so bad and I dont know why. 💀🤣🤣🤣 #BustDownBarbiana #CongratsNicki @NICK… RT @attitudebyonika: NICKI IS REALLY BLESSING US 😩🙏 #BustDownBarbiaba RT @minajthewave: BITCH IM LEAVING WALMART AND NICKI DROPPED WKSKKSKSKS LET ME PULL TF OVER!!!! RT @RohatMinajj: OMG IT’S 12:01 AM IN HOLLAND AND I’M SHOOK 😩😍😍😍😍 BUST DOWN BARBIANA 🥰🥰🥰🥰 @NICKIMINAJ RT @minajrel0aded: she for real the baddest one😩😩😩🔥 #BustDownBarbiana https://t.co/LxEVIghn1N RT @InLuvWitOnika: The switching of the flowsss!! This bitch too COLD!!! #BustDownBarbiana channelling \"Your Love\" 😍😍😍😍 RT @NickiMToya: Killing everybody beat! Thank u, next Ariana 👑👑👑👑👑👑👑🔥🔥🔥🔥🔥🔥🔥🔥 @NICKIMINAJ yo i love u RT @picminaj: she dropped the song like 5-10 minutes ago? And we already trending at #3 😭 #BustDownBarbiana 🔥 https://t.co/gUVCS3YvIL RT @J0hntavius: Me after i started seeing Nicki retweeting tweets about NEW MUSIC   https://t.co/2ZqD3cUqqM RT @Queen_Nicki_1: We received Hard White music video and 2 freestyles last week. Today we received #BustDownBarbiana and tomorrow #RunninV… RT @boytoymaraj: LMAOOO you peanut head bitches is always jellyana RT @Prettyy_OnFleek: Bitch said ... \n\nYou look like Nicki now still you TACKIANA BROOOOOOO WHAT THE FUCK 😂😂😂😂🔥🔥🔥🔥🔥 RT @DIORLESHALLES: “KILLING EVERYBODY BEAT. THANK U, NEXT. ARIANA” BITCH @NICKIMINAJ RT @minajfendi: BITCH THIS SLAPS 🔥#BustDownBarbiana \n@NICKIMINAJ u did THAT RT @davidminaj9: @audiomack @NICKIMINAJ ALREADY IN LOVE WIT THIS 🔥🔥 RT @Barbzovo: Bust Down Barbiana 😍 She is feeding us well, i love you so much @NICKIMINAJ  https://t.co/s6wfsaX48k RT @WES__LI: #nowplaying Bust Down Barbiana by @NICKIMINAJ via the @audiomack app  https://t.co/Q4NVMoDT7o RT @d_vibesss: OMFG NICKI WANTS TO KILL ME MY HEART LITERALLY JUST DROPPED RT @WES__LI: #BustDownBarbiana @NICKIMINAJ https://t.co/RpAusWIJh0 RT @Nitascornerr: YOOOO @NICKIMINAJ JUST DROPPED #BustDownBarbiana \n🔥🔥🔥 \nhttps://t.co/zh8rig1iqV https://t.co/Mfa8Pp22nx RT @NickiTheMONSTA: I BEEN A BAD BITCH, COCKIANA! RT @ThatShadyCunt: YALLLLLLLLLLLLLLLL #BustDownBarbiana 🔥🔥🔥🔥🔥🔥🔥 https://t.co/jyhCCmeWVj RT @boytoymaraj: ANOTHER SOMG ON AUDIOMACK? BITCH WE HEREEEE RT @minajthamine: SHE WANTS ME TO FAINT OR WHAT #BustDownBarbiana https://t.co/hq2fyH5P7P RT @suprizeglacee: OMGGG 🔥🔥🔥🔥 #BustDownBarbiana https://t.co/4AGZCIru9T RT @Onika_teamminaj: ANOTHER ONE?!?! Get your foot off my NECK!!!😩 #BustDownBarbiana https://t.co/DEnCIw1YzY RT @picminaj: THANK UNNEXT ARIANA OMG RT @itsebonylashae: Mood LMAO I DON’T WANT YOU ON MY PAGE, BLOCKIANA. Thank you for this 😂😂😂😂😂😂😂😂🤣🤣🤣🤣🤣🤣 how ironic RT @audiomack: New @NICKIMINAJ! #BustDownBarbiana https://t.co/0q1wrKPBZf https://t.co/Ffd3XsLsAW Perfect choice. Why I love you girls sm. #BritVidLittleMix - wish I could’ve been there 😘 https://t.co/5QrvhIit1l 😘 https://t.co/CwtnlIASQk RT @HeedyNshittt: I turn lemons into lemonade; SIMPLY dawgggg https://t.co/pH69Rz7QOH 💖 https://t.co/AUZJsSEfXu RT @audiomack: .@NickiMinaj is currently holding down the #1 and #2 Song of the Day slots with \"Barbie Drip\" &amp; \"Barbie Goin Bad\"\n\nListen he… 😍😍😍😍😍😍😍 https://t.co/vAG5CKdOdc Your obsession w/our culture is scary to say the least. I hate giving you the attention you so desperately crave. Laughing @ ppl getting deported as if your ancestors discovered America. Are you Native American? You fkn clown. https://t.co/7m0fYnubkq RT @LittleMix: #WomanLikeMe is nominated for British Artist Video of the year at this year's @BRITs awards!\nCreate your favourite GIF from… Thank you 🙏🏽 🙏🏾🙏🏾🙏🏼 https://t.co/ZumPEXRzKD RT @NickisMovie: omg i witnessed this. capital snapped 💞 https://t.co/lVOtHnZFPd Lol. Omg https://t.co/rGmk5lF7S3 RT @J_Credible: “Couple new blessings every time we pray” - @NICKIMINAJ 😬💖 https://t.co/7cxzcKk3qT Thank you. I love it. https://t.co/oGP7PYbTgC RT @NICKIMINAJ: 🥳 @audiomack \n\nBarbie Goin Bad - https://t.co/Nk8YAM5QAw\n\nBarbie Drip - https://t.co/fJdDkicPCL I been playin this shit non fkn stop 🤭 https://t.co/Nbky4nL7KZ 🙏🏽🙏🏽🙏🏽♥️♥️♥️😘 https://t.co/O1kvoxPlZQ https://t.co/Pk0jTjTOt6 episode 11 is now up on @AppleMusic @Beats1 #BarbieDrip https://t.co/dWgPVZnpsB Thank you guys so much for tuning in https://t.co/S2odPOAmqn My fave part https://t.co/pRdsMgA73m 🙏🏽🙏🏽🙏🏽 https://t.co/nLPftaG3o7 😂😂😂 https://t.co/DGxG8ySgfs RT @souljaboy: #NewProfilePic https://t.co/QY6JHQMTay RT @sonofchun: I’m so happy Nicki is in a good place in her life. Her energy is giving me energy.#QueenRadio RT @SIGNYABOOBS: Thanks so much for this music @NICKIMINAJ love u so much! #Legend #Legacy #Iconic PERIIIOOOOOOD.  #QueenRadio 👑 RT @geek_lyric: Damn this is good. @MaliibuMiitch 🥵 #QueenRadio RT @MinajOwnsMyAss: Downloading the Audiomack app just for #BarbieDrip and #BarbieGoinBad @NICKIMINAJ RT @geek_lyric: Damnnnn tf @MsBanks94 YES TO THIS SONG #QueenRadio RT @TemptedByMINAJ: She ain’t neva lied when she said it was gonna be a legendary show #QueenRadio RT @QNickimiraj: “God counts the tears of a woman” that touched me differently #QueenRadio RT @NickiDaBadBitch: The silence after nicki said she was pregnant made it even funnier 💀 nobody knew what to say or do LMAOOO #QueenRadio RT @nicolassminajj: I LOVE THIS MOMEEEEEENT 🙏🏼 @NICKIMINAJ #BarbieDrip #BarbieGoinBad #QueenRadio 🥳 @audiomack \n\nBarbie Goin Bad - https://t.co/Nk8YAM5QAw\n\nBarbie Drip - https://t.co/fJdDkicPCL RT @MzBellaBarbie: @NICKIMINAJ I'm SO glad you're healthy, beautiful. As you should be. It's so important. Love you so much. 💖🙏🏾 RT @iGOHARD4ONIKA_: YO I FELTTTTT THE FUCKING ENERGY THRU THESE HEADPHONES! Lmaoooooo she PLAYS all fucking day!!!!!! #QueenRadio RT @Burn1Central: MY HEART JUST DROPPED. I GOT THE CHILLS AND STARTED CRYING 😩 #QueenRadio RT @iamr_b_: FUCK NICKI HO I LITERALLY TURNED RED WHEN SHE SAID THAT 😭 #QueenRadio RT @NickiMToya: Bitch !! https://t.co/BftLKuMumm RT @Da_Dutches: Omg!\n@NICKIMINAJ &amp; Soulja Boy!\nThis Look! 😍😩😩💜💙\n#QueenRadio https://t.co/v9d6SW4ujA RT @TemptedByMINAJ: Someone need to start making some cover art 🤪🔥 #QueenRadio RT @Burn1Central: I’m so glad to have you back! I KNEW you were going to give us EVERYTHING and THEN SOME 👏🏼👏🏼 @NICKIMINAJ #QueenRadio I love u guys so much https://t.co/5klvqgNmxi Barbie Goin Bad - https://t.co/Nk8YAM5QAw\n\nBarbie Drip - https://t.co/fJdDkicPCL RT @_princeeMinaj: Nicki mf Minaj 😭🙌🏽🙌🏽🙌🏽 we love you Queen 👑 @NICKIMINAJ #QueenRadio RT @Marie_minaj: The going bad freestyle.... Omfg #QueenRadio https://t.co/YrCd8SFBoC RT @thebxddest_: BITCH SHE DID THAT. THEY NEED RAPPERS LIKE HER BITCH ! GOAT. LEGEND !! TELL EM !! @NICKIMINAJ #QueenRadio RT @NickiMToya: Play that shit a cpl more times @NICKIMINAJ #QueenRadio RT @Burn1Central: MY BTCH FCKN GOESSSSSSSS @NICKIMINAJ #QueenRadio RT @BaeQuil: OH MY GODD #QueenRADIO I’m CRYING RT @pointdexter: Soundcloud nika is really back... holy shit #QueenRadio @NICKIMINAJ RT @MinajestyNm: Leave the hatetrain on the station pleaase OMG SOO CLEVER 😩😭🔥❤️👑 #QueenRadio @NICKIMINAJ RT @geek_lyric: Okay I see u queen #QueenRadio https://t.co/7dibldlUwD RT @marchyy_: YOU ASKED FOR THE GOAT SO THEY SENT MEEEEE @NICKIMINAJ RT @minajthewave: I AM SHAKINGGGGGG! #QueenRadio @NICKIMINAJ RT @minajrel0aded: talk about the US Tour dates😩 @NICKIMINAJ #QueenRadio RT @chun_nika: Y’all We STAN the BEST Fucking Artistto ever live I lovvvve Onika #queenradio RT @Y0NNAS: “I should’ve hopped on that beat” *plays song* BITCHHHHHH THATS A HEART ATTACK! RT @onaiforde: Idk if to cry or what, I’m just smiling and I’m so happy omg. This new music omg 😭♥️♥️♥️♥️♥️\n@NICKIMINAJ GIRL I FCKING LOVE… RT @saytruuuth: NOBODY’S BEAT SAFE. MIXTAPE NICKI ARRIVED. #QueenRadio https://t.co/EhDsQldVEE RT @Mik_Minaj: IM SPAZZZINNNN TF OUT RN!!!! DIS HOW YOU COME AND FUQ SHIT UP!!!!! YESSSSS NICKI!!! @NICKIMINAJ #QueenRadio RT @arithabrat: 2019 is Nickis year bitch PERIOD #QueenRadio RT @NickiMToya: Yo @NICKIMINAJ coming thru like put some fuckin respect on her fuckin name #QueenRadio wowowowow RT @Kharharee: OH @NICKIMINAJ YOU SHOWIN TF OUT RIGHT NOW. SHE SO GODDAMN SNEAKY. HEAVY ON THA SLEEZE #QueenRadio RT @NickiDaBadBitch: I WASNT READY OMG #QueenRadio RT @marchyy_: GIRLLL SOUTHSIDE IM RIGHT HERE @NICKIMINAJ #QUEENRADIO RT @Piinkslam: I LOVE UUUU @NICKIMINAJ RT @Marie_minaj: WEREE GETTING TWO FCKN FREESTYLES!?!?!?!:’ #QueenRadio RT @maddymaraj: “Neck tat say Onika” @NICKIMINAJ #QueenRadio https://t.co/8aWt9Pf2p4 RT @LaryZolanski: GURL OMFGHGGH MY WIG I CANT BREATHE RT @thvgshxt__: Nicki Ft. Lil Baby? 🤩🤩🤩🤩 #QUEENRadio RT @Rissas_Gold: More slaps the- #QueenRadio https://t.co/jtKsK9dzsX RT @niyohmy: I ready for all that disrespectful shit RT @DonovanRIGOR: BITCH I CANT HANDLE IT @NICKIMINAJ  THAT SHIT HARD AS FUCK #QueenRadio https://t.co/gVTrE8ykko RT @Kharharee: I ain’t never been this nervous  @NICKIMINAJ #QueenRadio RT @livelotm: NO SHE DID FUCKING NOT RT @MINAJJES: NECK TAT SAY ONIKA! @NICKIMINAJ #QueenRadio RT @MsBanks94: Tuned innnn sis @NICKIMINAJ #goingbad on dem bloodclarttttt #QueenRadio 🔥🔥🔥🔥🔥🔥🔥 RT @minajthewave: BITCH!!!!!! IS THAT THE GOING BAD BEAT!!!! @NICKIMINAJ #QueenRadio https://t.co/Pk0jTjTOt6 Setting up my desk 😘 https://t.co/jGIGEOMOp3 😅 https://t.co/DR7fVZdB42 😐 https://t.co/hddcDl0PN7 3PM PST - one hour &amp; a half #QueenRadio 🥴 5 1/2 hours til #QueenRadio 😳🤯 Tomorrow 2PM PST - dropping new music #QueenRadio LIVE on @applemusic + special guests 🦄 https://t.co/qAF30dIDy5 RT @Vevo: The #Queen always coming through with those 🔥🔥bars. Watch @NICKIMINAJ's new video \"Hard White\" now. \n\n▶️ https://t.co/vwX7TYr0rT… RT @shakeelovelace: Look at my Knock-Offs I told em KNOCK IT OFF ‼️‼️\n\n#HardWhiteVIDEO #HardWhite\n\nWatch the Official Music Video for HardW… RT @TIDAL: Dropped: #HardWhite music video. @NICKIMINAJ. https://t.co/lUcugKDkjT https://t.co/L1m7YSM869 https://t.co/hWF0jYAKGt #HardWhiteVIDEO #HardWhite #Queen https://t.co/Xs0ZP7NXVV https://t.co/DrGlZDrSkg So excited to finally launch my 7th fragrance just in time for Valentine’s Day. 👑 Only fit for a #QUEEN. 👑 Sign up NOW for early access- site goes live FRIDAY. https://t.co/KFRfaDPmG6 https://t.co/BXrdkxZGpo 😂😂🤣 nailed it https://t.co/DL1uAy6D7a 😘 https://t.co/8H5DrxlRhK 🎨🦄💖😘 https://t.co/GMAUTwyj03 Oh y’all thought skinny legend left the chat for good barbz? Zont Zoo it 🤧 https://t.co/TKsjcdZUr1 Who gon check me boo? https://t.co/VnkgCxb9XX What I have in store for my babies 🔪😊 Weird flex wit this pic but ok babe 😂 😘😘😘♥️💋 https://t.co/d5EjvWDKMT Soon come 😛 https://t.co/LWnKl46Qj2 New stage, new set, new surprises #NickiWRLD with JUICE WRLD IN #EUROPE 😍 https://t.co/Xkovm4dv9x Like... RT @___R0b: Nah. Nothing will ever top when they made poor Joyce cover up and pretend to be Nicki at the airport 😭😭😭😂😂😂 i was done 🤣🤣😩 http… RT @Jerihmi: 😭😭😭😭😭😭 ICONIC https://t.co/fakyY8MmwT RT @iFeelFreedxm: the funniest one tho, like we can’t see her 🤣 https://t.co/fQ3jIXo3Qn RT @ZolanskiAnthony: SKINNY LEGEND ! @NICKIMINAJ https://t.co/pW0TlQHtAC RT @Nicki_is_Queen1: Nicki the Ninja🥴 https://t.co/FyRN6RxOu4 RT @RYZOLANSKI: The master of disguise 😭🙄🥴 https://t.co/jYNurobXtB RT @onikamajesty: @NICKIMINAJ you slept on this one! Still ICONIC. There's literally your name on the jacket 💀 https://t.co/FIHaKofbco 😴 #TheNickiInches #NinjaNicki https://t.co/MkNpI38tN7 They know... https://t.co/igoIUyJ6mt Boots still poppin tho https://t.co/xN8rdW59lE 🥴😴 https://t.co/FnGNDVrjSQ I’m a bad bish. I’m a cunt. And I’ll kick dat hoe. Punt. https://t.co/yGcW9wX6Mb Always need a smoke. Love you too https://t.co/U3gt7ov3Gi Yassss zaddy!!! 💃🏽 he got good form fa sure. Great form. Phuck dem Nikkaz up babe! 🥴🤪 https://t.co/SRN0XmBcF0 😭😭😭😭📠📠📠 https://t.co/ULPH21AvZt The fact that he putting the mic to the fans n they backin him up 🤣😂😂😂😭😭😭😭😭 he’s watched me perform this WAYYYY TOO MANY TIMES YO. https://t.co/U9zRFgGXIC I. Am. SCREAMING. https://t.co/TghF3AeNyZ Nothing is getting in the way of the US TOUR boo boo 😘😘😘 https://t.co/VJF9FhwlVa He not a internet dude. If u know what I mean. And I prefer his mystique. I’ll do all the talking for him. He’ll do the rest. https://t.co/LXZSpzdvHB RT @SlayinWithNicki: Nic’s a different type of happy now. God really works wonders. 🥰 RT @Nicki_M_Queen: @NICKIMINAJ I love it when nicki tells us ALOT of thannnngggss❤️😩 RT @__zurah: I’m not crying. I’m not. No I am not. RT @Dear_Onika: this is so beautiful mann 🥺❤️ Maybe I’ll answer this one on the next Queen Radio 😘 https://t.co/NMXGsIqQta RT @d_vibesss: Sorry guys I deleted the tweet by mistake a couple of minutes ago the tweet was: Nicki’s mood ever since Kenny came into her… He’s like the male version of my bff TT. They both can make me calm with one look, hug, word. I tell them both all the time. My peace. Cuz they knew me since I was a kid so they understand me in a diff way I guess. Him &amp; TT used to hate each other when we was younger tho lol https://t.co/Jgi6E2v6NA We already chose them babe. Lol but thx. ♥️ https://t.co/T8hzrwdWz9 Facts but we were like this about each other since we were very young kids in the hood. He was on my body b4 the big ol’ ghetto booty 🤪. B4 the fame &amp; fortune. Fought my bf cuz I wouldn’t be his girl. He was always a lil brazy. But anyway, timing is everything. ♥️🙏 https://t.co/RdnXKzSZbu Yup!!!!!!! When my 😻 is HOPPY, ME HOPPY TOO!!!! Dem fi stay MOD! Streets ah go link up tho!  I’m still laughin @ the zoo bong bang tweet 😭🤣 https://t.co/oF39O9rnHL Btch I just SCREAMED!!!!!!!!!!!!! I’m done. I logged out my phone. Like y’all r fkn STOOPID!!!!!!!!!! I hate y’all 😭😭😭😭😭😭😭 https://t.co/qYUAXSaJiE 😭😭🤣📠📠📠📠📠📠 https://t.co/hk9gi0diuO That’s exactly how I be too 😭😭😭😭😭 I rlly just screamed. why r y’all like this? 🤣 The talk game rlly do take u to another place tho. After u nut u be like yo babe wtf was we just talkin bout? 😂 https://t.co/9a4Lzg3zaA RT @quin_minaj: @NICKIMINAJ Lmao😂😂😂😂😂😂 Nicki I feel you!! That shit is life!! Got me a baby!!😂😂😂😂😂😂😂😂❤️❤️😂 😭😭😭 https://t.co/ipZQjbiEjz OOP! FACTORY‼️‼️‼️📠📠📠 good talk game to match good dick game is jus... 🥴🥴🥴🥴 😻😻😻😻😻😻 😅💦💧CHILE!!!!!!!!!!!!!!!!!! https://t.co/WNDVakz2ju 😂😂😂 the GIF is sending me. Well, yes. The answer is yes. 🥴 https://t.co/oOpl6hBNaR 3️⃣-4️⃣ on average. \n6 is a bit much sis 😂 https://t.co/HQ465hafG6 Huh? Bye y’all https://t.co/WhTBxU89cv Ok but let me log awf 😋😂 y’all need a time out. https://t.co/H1GVLpH3cd Zang! Who side you on SIS?  he gon get awlll this werk 🥴 https://t.co/YREwkvfkyM 🥴 https://t.co/oece1TWsTa Ok my baby looks GORG!!! @NeNeLeakes https://t.co/VASqEj09tH https://t.co/4RavpbU4pt https://t.co/hZ9Gh14LAD Oh she comin. Makin her list &amp; checkin it twice. We gon get into some THANGZ!!!!!!!! Next level https://t.co/kzq97VyedV Must’ve been my stunt double. I ain’t drop in on nobody. Never heard of this company either. Lol. But thx for the good vibes😩 https://t.co/PuSohSi4rX RT @LIVmiami: Our fave @NICKIMINAJ is too sweet! Literally. Catch her Monday Dec. 31st! #NYE Tickets at https://t.co/2gI0nFs4oC. https://t.… Thanks babe 😘 https://t.co/H7Ba94ZrkH Got a #MYX wit ya name on it @myxfusions https://t.co/qp4iXhAdRb 👅💦💧#Moscato #Sangria #RedBlendWine https://t.co/mMZGaEA0NA RT @TitiDream4: 😂😂😂😂😂😂 https://t.co/jcXH2KW9Po No she gave it to ME. lol. Love it 😍 https://t.co/Je4FOwYlbF Ariana is my sister, y’all can’t &amp; wont come between us. Go awf ♥️🙏 https://t.co/AvIubWFQA5 RT @eugenegu: No matter what we think of celebrities or public figures, Pete Davidson is a human being who deserves to live. The thousands… RT @calvinstowell: Pete Davidson just posted what is essentially a suicide note and the majority of the comments on it are cruel and encour… RT @NM4_conor: @NICKIMINAJ It was the same with Amy Winehouse everyone hated her when she was alive and judged her on her mental health and… Y’all did the same thing to Mac Miller until he died. The #FakeBandWagonHate REALEST THING I READ ALL DAY. just cuz it’s #Popular #Fun #ToHate. Love you baby. This made me proud. https://t.co/pWzkVGW91f When they go low... https://t.co/PTUICnpW4n RT @higherthannicki: y'all joke and drag until someone actually k*lls themselves then you send fake love... You don’t have to defend me. I’m not afraid of internet trolls, blogs, artists. I don’t jump on band wagons. Many will never know what it feels like to have a mind of their own. https://t.co/NDmClqkwiW WHO GIVES A FUCK???!! Imagine someone threatening to take their own life &amp; you sitting there worrying about a blog!!!! Y’all rlly don’t care about human beings no more https://t.co/ism1UXKjV8 Go &amp; give this man some love. My God. https://t.co/qchM3xGRdg We can be so insensitive. God bless Kanye &amp; Pete. Being flippant about mental illness speaks more about you than them. Stop saying the word love &amp; live it. Love is an action. RT @pinkfridayvibes: the pinkprint came out 4 years ago today and nicki and bey really gave us one of the most iconic collabs to date at th… RT @XXL: ⬇️ Today in Hip-Hop ⬇️\n\n@NickiMinaj puts out 'The Pinkprint' album\nhttps://t.co/8gE5AnRrGs RT @MikeThrone_: mind you Kartel &amp; Beenie referenced you in their verse 🗣 we need a video https://t.co/13cNkl0rzN Rasta just touch down from heaven 😩🔥🔥🔥🔥🔥🔥🔥💥💨 ummm this is my King. That’s all. 🇯🇲🇹🇹🇬🇧 #TouchDown @KingBeenieMan https://t.co/BesWRhK5pX Oh hi RT @onaiforde: #FAMILIA - @NICKIMINAJ 😍👸🏽🔥🔥\nfeaturing @Anuel_2bleA &amp; Bantu OUT NOW 🕸️🕷️\n#IntoTheSpiderVerse ⁠ ⁠ Soundtrack\n\nAPPLE MUSIC: ht… You NEED your ops. Therefore you’ll never be the man. You’re a son. A man stands on his own ✌🏽🦶🏾🦶🏾 Ok I’ll follow up shortly ♥️😘 https://t.co/CJI5r9kv76 RT @boujielilbitch: @NICKIMINAJ IF YOU DONT... https://t.co/eMiRJgzR4I RT @ItsallaboutNM: Are you planning to have M&amp;Gs ? I just wanna know .... @NICKIMINAJ https://t.co/ZH5Aw2BaPq RT @OnikasNieeecey: Girl What’s The T With Queen Radio We Haven’t Heard Your Voice In Like Forever 😩😩😩‼️‼️‼️‼️‼️😔😔😔😪 #QueenRadio #QueenRadi… RT @hesbran: @NICKIMINAJ don't play i need the atlanta date now😔 RT @Here4Minaj: Y’all let’s just ignore her since she’s being childish https://t.co/nEVFvGE21V RT @king__JadaxTM: @NICKIMINAJ ONIKA TANYA!!  I- https://t.co/nV79C09wvU 🙃 https://t.co/vBD7qUTPxx Y’all hear smthn? 👂 https://t.co/GElGJfLopD *pretty https://t.co/u6EPjdfFe3 There was only ☝️ question in that paragraph 🙄☺️🤣 I see ☝️ question mark 🧐 https://t.co/3nLsVR8pTN RT @kyndall_kashme: Oh bitch he snapped https://t.co/vsd7W2kuSs ♥️♥️♥️ https://t.co/aCFsvNyGhe The barbz are getting more tuition &amp; student loan money after I sue this hoe @JessePalmerTV Skhsskskjsaks https://t.co/TqTh2D9mN6 You going to jail 😂😂😂😂😂@JessePalmerTV RT @JaiLiLovesNicki: AND WHEN HE EAT THE COOKIE HE GOT... 🤤🍪💦\n\nGood Form (The Music Video) WATCH NOW ⬇️⬇️⬇️\n\nYouTube: https://t.co/rayE6h38… RT @DesMinaj1: “Yall cant even run yall own life” FACTSS be so worried about her but don’t got yall shit together RT @FlawlessInPink: Nicki trolling the fuck out of u miserable fucks I love this woman https://t.co/SWQz5KJsFi 😂 https://t.co/WgJpQuUF7G RT @aliminajxx: Oop. I love this energy. You mad? Stay mad. https://t.co/s8qbCDv4Af RT @iTSBARBiELEX: CAPTIONNNNNN https://t.co/wFFrKxda5x 🤔 https://t.co/OCglEbR6fE Love you all sm ♥️ https://t.co/FVMhWzC92H RT @onaiforde: Haters: oMg nIcKi tHiS, nIcKi tHaT\n\nNicki:\n https://t.co/psrhgSC3XZ Love you https://t.co/xUOom6DPQl No. Fkng. Words. Can. Even. Explain. 🥳 https://t.co/mfKGgysTaH 😘@MaliibuMiitch 😘@MsBanks94 RT @MsBanks94: PERIOD!!! https://t.co/UtyicNHe3B *ut\n\n😊♥️🥰😜 https://t.co/6xpHP2yCZM Thassa #SuperFact 😂😜😻 https://t.co/N0dkwt77VH Thassa #SuperFact https://t.co/mF9cqM70R9 Who on Barbie D? Who on Barbie D? 👈 troll RT @MINAJMALE: We're leaving.  https://t.co/Pqu69CStyX Everyone on social media is now a psychic. They not only tell the future, but the past too. They are your judge, jury &amp; executioner. I never meet these perfect ppl in real life tho. They exist only on social media. No one on social media has ever sinned. They are all perfect. They piss champagne &amp; walk on streets of gold. 🥳 RT @hoeslovegianni: @NICKIMINAJ Me bish anskskdlslldlf https://t.co/lnftL5TJAd Deleting this page &amp; starting my secret society. Who’s coming 😝😂🥰♥️😘😘😘 I love making you mad 😝 RT @Heezy_Zolanski: When Nicki said ‘I’m in the UK’ I was ready to say ‘just for one day’ 😂😂😂😩 #TouchDownRemix RT @BARBIECharts: #GoodFormVIDEO 🍪 \n\nWATCH ↓ \n\nhttps://t.co/R4x93Lcy6u 😂😘 https://t.co/t5uTpQmRKT 😜 https://t.co/amaAGkGUZg RT @minajthamine: @NICKIMINAJ THIS LIKE LOOK AT YOU! THE LOOK YOU GIVE...UH! #GoodFormVIDEO https://t.co/pO5FsVIjuC RT @xMelCole: @NICKIMINAJ You’re my favorite person duh. Favorite part was when u &amp; Wayne was rappin back n forth cuz thats fkn iconic. Fav… RT @BarbOVO_Forever: @NICKIMINAJ This was too cute! https://t.co/c3oBSAe1H5 RT @devin_walston: @NICKIMINAJ My FAVVVV 🥰❤️❤️🔥 @NICKIMINAJ https://t.co/4hv2vyh6Vk RT @RYZOLANSKI: @NICKIMINAJ When u and Wayne went BACK TO MOTHERFUCKING BACK RT @marajlit: @NICKIMINAJ This scene, those sexy moves had me shooked😩🙌🏽✨🍪🍪 @NICKIMINAJ https://t.co/bb19scW6JD RT @Jawad_Minaj: @NICKIMINAJ The milk bowl, the pink hair , THE ASS! RT @argentina_minaj: INCHES ❤️😍 https://t.co/2jnNgUwmbv RT @DearOldSham: THE YOUNG MONEY REUNION!!!! https://t.co/89okDQOFpJ RT @juniedee_: def red scene with the baddies Ari &amp; Brooke 😍😍😍 https://t.co/v1rT7pu3z0 RT @nerveofme: @NICKIMINAJ this look &gt;&gt;&gt; 😍😍😍 https://t.co/Xgw41gengR RT @_gapc: @NICKIMINAJ when you ate off of the clermont twins RT @Queen_10818: Your ass 😂 https://t.co/nEfw7GUO7y RT @rvnxhidexdeb: favorite scene is with you and wayne sis. https://t.co/8KPePQEz93 RT @KenzRevenge: SIS YOU KNOW THAT RED OUTFIT LEFT ME SCALPLESS!!!😭😭 https://t.co/rzRC5mKYBA RT @DrakeNicki_: @NICKIMINAJ I can't decide https://t.co/wCQsTAuCwu RT @JayTillerJr: @NICKIMINAJ Dis one https://t.co/27ECMSkUXZ RT @NickiMaaraj: The butts and you hair #GoodFormVidel https://t.co/Q96WzygLSZ RT @davidminaj9: @NICKIMINAJ THIS, I am in love with ur look😍😍😍😍😍 https://t.co/EWf6IxVZ9i Ok y’all, what’s your favorite scene, look, person, thing in the #GoodFormVIDEO??? That’s b/c I freestyled the entire song first (just having fun), like Chun-Li; then went back in &amp; added words. I left the original structure/melody/cadence exactly the way I freestyled it. 😛 #GoodForm = one writer 🥰 beat by mike Will/ear drummers 👂 🥁 \n\n♥️😘 thx babe https://t.co/eE06UkKY6T RT @Stylog: #TouchDown #Remix Feat @NICKIMINAJ &amp; @Vybz_Kartel \nOut Tomorrow 6/1218 https://t.co/vtWwnyLopC RT @_2TheKhor: Ooh she luh me😏😉 https://t.co/XJXDdzFOgc 🥴😝 https://t.co/GnO7Qo4Ef6 😂 https://t.co/DPtavhm9lu https://t.co/NywnO74QMR 😂 https://t.co/CWc617gUWp https://t.co/NywnO74QMR RT @J0hntavius: Good Form (Music Video) WATCH NOW \n\nYouTube: https://t.co/K8Wvrxw8gn\n\nTidal: [https://t.co/MTzkDt22YQ] \n\niTunes: [https://t… RT @EmpressMighty: I swear I was like yup ere it comes 🔥 https://t.co/uyXaPumzYS 😂 https://t.co/1lijx0Xvky 😂 https://t.co/3u6trlcC05 Heavy on the 💦💦💦💦😋 RT @NM4updates2: WATCH the #GoodFormVIDEO on YouTube! 🍪 https://t.co/eunVXyIQL5 RT @Piinkslam: Fave part. #GoodFormVideo 🔥🍪 https://t.co/5TGnPJMTy3 #MAMA IS OUT NOW‼️‼️‼️‼️‼️‼️🦄🦄🌊🌊🌊💦💦💦💦〽️🐝💤💤💤✨ https://t.co/ik3hGVOtKo PEEFECT TIMING. HAHA! Heavy on the timing!!! HEAVY ON IT!!!!😎 RT @etnow: 🎶 Hold up, hold up, hold up -- OK, HOLD UP! 🎶 @NICKIMINAJ is snatching wigs with her new #GoodFormVIDEO, featuring cameos from a… RT @Vevo: 🚨 Another one from #Queen 🚨 Watch @NICKIMINAJ's \"Good Form\" ft. @LilTunechi now. 🍪🍪 #GoodFormVIDEO \n\n▶️ https://t.co/s0QB9vlszO h… RT @BoogieBoutBands: Nicki Minaj Heavy On The Sleeze 😂😂〽️🐝💤🤟🏾 #Mama https://t.co/RiP9f1s98M Thx babe ♥️ https://t.co/g3Tqa5xBLi RT @Vevo_UK: It's cookie time 🍪 @NICKIMINAJ's video for \"Good Form\" ft. @LilTunechi is here! ▶︎ https://t.co/M9pqbsH5jk https://t.co/0odh0d… RT @billboard: .@NICKIMINAJ and @LilTunechi unveil scrumptious #GoodFormVideo https://t.co/jrUYvPLF1X https://t.co/eq9kmJaHbg RT @Vevo: 🚨 Another one from #Queen 🚨 Watch @NICKIMINAJ's \"Good Form\" ft. @LilTunechi now. 🍪🍪 #GoodFormVIDEO \n\n▶️ https://t.co/s0QB9vlszO h… RT @RepublicRecords: IT'S HERE: \n          \n@NICKIMINAJ ft. @LilTunechi | #GoodFormVIDEO 🍪 \n\nWATCH ↓\nhttps://t.co/23gAfok49g #GoodFormVIDEO out now!!!!! https://t.co/ChD33lAxe1 RT @Tyga: Young  Mula baby https://t.co/kN2uXAPTYL #GoofFormVIDEO ft Lil Wayne is OUT NOW!!!!! What’s your favorite part?!?!!!!! 🦄🦄🦄🍪🦄🦄🍪🦄 https://t.co/l735hkdthF #GoodFormVIDEO FT LIL WAYNE OUT NOW!!!!!!!! https://t.co/1uf3tp2Ab0 RT @HusseinMinaj: After seeing this I’ve turned straight 😪 https://t.co/hbruYS0LDt RT @UMG: Hold up, hold up, the @NICKIMINAJ  x @LilTunechi video for #GoodForm is here 🍪\nWatch\n↳https://t.co/xkeJnGpAWm https://t.co/98n6XBJ… RT @RogueReloaded: Um can this really happen tho https://t.co/EPnue1m6pA 😤😂 https://t.co/vfFrCnQwEZ RT @youtubemusic: 🚨 @NICKIMINAJ’s #GoodForm video, featuring @LilTunechi is HERE 🚨 Play now on the new YouTube Music app → https://t.co/e5f… HEAVY ON IT!!!!! https://t.co/2u0vhuxyVO RT @Jerihmi: she’s so sexy 🤤 HEAVY ON IT! 👅 #GoodFormVIDEO https://t.co/eUAI1BT21r RT @OnikasBBG: I can’t get over this. She did it #GoodFormVIDEO #GoodFormVideo https://t.co/C89RO3Hz67 Heavy https://t.co/JD63BvtOPF RT @minajthamine: i don’t want to be dramatic bUT MISS MINAJ S N A P P E SD. https://t.co/kLL9r87GuU HEAVY ON IT!!!!!!!!!! #GoodFormVIDEO OUT NOW‼️ https://t.co/nhMhKW3SOD 🥰😍🤪🤩 #BARBIE X #TUNECHI #GoodFormVIDEO OUT NOW. LINK IN BIO ‼️‼️‼️‼️‼️‼️🦄🦄🦄😤🌊🌊🌊🌊💧💦✨⚡️💥 HEAVY ON THE SLEEEEEEEZE 〽️😤 https://t.co/DNmPaBNsIx https://t.co/pCg5YEXVZ0 #GoodFormVIDEO #GoodForm ft. Lil Wayne 👅🍪🥛‼️‼️‼️🦄🦄🦄✨💥🌊 Who’s ready for the #GoodFormVIDEO #GoodForm TODAY!!!!!!!!!! HEAVY ON IT 🍪 https://t.co/4oGCWWjwhM Whole squad on point I’m only loyal to the n*ggaz dat’ll bust gunz 4 me. https://t.co/YsD6s3aJTH #GoodForm THURSDAY 🍪🥛 RT @LaurenLondon: Check check check check it out https://t.co/qPvtbV653f Word. Y’all rlly liked that song off that instrumental alone. 🥰 https://t.co/YShbf5idCj This GIF sends me a every fkng time 😂 https://t.co/oOhZdVrpV9 RT @PinkBoiPryncess: @NICKIMINAJ Are We Gonna Have An Episode Of #QueenRadio To Usher In The #GoodForm Music Video Sis? 🙏🏽💕 https://t.co/QF… 😩 https://t.co/3gxG5aab5D RT @jadyn1190: the looks, the baddie b’s, the ass throwing...am i ready? yes and no 😩 https://t.co/5q4JRwI7CZ 😂 https://t.co/30pJZLfGhg RT @LamouraMinaj: BIISSSSHHHHH WHEW. I'M READY. https://t.co/BMbPcUkS2j RT @HoneyGuwop: Nah she put my bitch Evelyn in the video!!! I stan. RT @_theboobster: @NICKIMINAJ it better be some TWERKING or I’m calling the police! RT @aliminajxx: Yall they’re really gonna slay and snatch wigs nzjsjsjjs #GoodForm https://t.co/P85D6Wze2y 😂 https://t.co/FX1bac5Wpd https://t.co/YsD6s3aJTH \n\n#GoodForm official link #GoodForm T H U R S D A Y 🍪🥛 https://t.co/eO7D2AG1UJ RT @Nitascornerr: Cookie part two 🍪🤤 #GoodForm https://t.co/V20FmZkrMb And when he eat the 🍪 he got #GoodForm ft Lil Wayne THURSDAY 🥛😋 https://t.co/GWoyKJkqku 🦄 Thank you guys for holding us down. 🙏🏾♥️♥️♥️ https://t.co/g7aELRUalD 😭😭😭😭😭 https://t.co/EG88h9hSXh On my way to the Boulevard #Queens 11|29 - Thursday morning 🍪🥛 https://t.co/SfKAa3eIEY #GoodForm ft. @LilTunechi 11|27 🍪😻👅 https://t.co/c4Z13aMXC4 ♥️ thank you 🙏🏾 https://t.co/NtsXnlRP70 RT @TIDAL: Dropped: #NoCandleNoLight. @zaynmalik x @NICKIMINAJ. https://t.co/78mwo1AHJ8 https://t.co/D2yh1FPZOb New Music Friday on Spotify #Runnin #Creed2 Soon as the 🔔 go ding #Tho\nI’ll be in the ring #Tho \nWe could shoot cinco \n\n#Runnin #Creed2 out now ‼️🥊‼️\n\n[not ding dong] https://t.co/8uu1ONQx9Y Thank you 🙏🏾. It’s definitely #BreastStroke tho. not brush. 😅 Everything is Wavy 🌊🌊🌊 ima hit em wit the... #Runnin is out now‼️ https://t.co/QivinwmooK RT @MikeWiLLMadeIt: RETWEET OR REPOST THIS ART WITH THE SONG YOU’RE EXCITED ABOUT MOST ‼️\n\nWE GOING UP @ MIDNIGHT https://t.co/BQUf7Fdxud RT @zaynmalik: #NoCandleNoLight feat. @nickiminaj\n🚫🕯 out now: https://t.co/JdSfE6hdlH 🚫💡 https://t.co/Z60EMsZLK6 The girls gave me a gorgeous bouquet of flowers w|a card attached &amp; I literally shed some thug tears once I got back to the hotel &amp; read it. 😩🙈 So happy we worked together. They looked &amp; performed BOMB tonight. @LittleMix #WomanLikeMe video out now #MTVEMA Kisses to my fans who support me non stop, even when I’m not online... you guys voted &amp; voted &amp; I won 2 awards tonight— I am just so incredibly grateful for your love! #MTVEMA #BestHipHop #BestLook ♥️ thank you MTV! Kisses to Spain, it’s gorgeous out here!!!! https://t.co/DGS7mMeAnh 🙏🏽♥️🙏🏽 https://t.co/SFV1gCKDOe Pow 💥 https://t.co/30HqFuJCcg RT @LittleMix: Issa celebration!\n@NICKIMINAJ WUT’S GOOD?!\nYa ready for us @mtvema’s 😉💥❤️\n#WomanLikeMe https://t.co/MKr87itf7M https://t.co/VFGKVv3zuM @Tyga wus good? #DipVIDEO OUT NOW!!!!! TSR posted me as a Barbie. I wasn’t  dressed as a Barbie in that pic tho 😩 I did it for the first mixtape cover “playtime is over”.  All the girls they posted look dope 😍 #BarbieTingz forever. https://t.co/1ica84qqcl Oh ok babe thanks. I forgot what line I WROTE about turning down a 4 million dollar shoe deal. Either way, TO FREEDOM!!!!! Now I’m done with it!!!!! If you don’t want me to say smthn way more embarrassing STFU🗣 #DipVIDEO OUT NOW #WomanLikeMeVIDEO out now!!!!! #QueenRadio next wk https://t.co/7MqLT1QhRN RT @LilTunechi: On this day, in 1965, the world changed. And all these years later, she hasn’t. Happy birthday my love! May u see a million… RT @blasianxsoul: YO @NICKIMINAJ constantly has to defend herself against liars and frauds. This woman got a BACKBONE! RT @JD_Minaj: @NICKIMINAJ We not sitting down watching you mother fkn pussy bitchws lie on our girl anymore. We came ready bitch @SteveMadd… RT @_NickiSeason: He thought he could get away with lying on Nicki cause all the hate she getting, but that shit backfired right in his fac… When did I say this???? For the record. Since u wanted attention asshole. Turned down 4 MILLION. NOW EAT MY ASS &amp; GO AWAY. MY FANS WILL NEVER SUPPORT YOU AGAIN https://t.co/8PlgMBo0ib RT @Jawad_Minaj: Think it’s funny to try to lie on a black woman. Fuck You https://t.co/uKyLxmhdII RT @CajunDoves: Bitches TUNE switching up, we take em to Jiffy now! https://t.co/HOwDgQj006 Eat a dick nigga. You lied on me cuz it was the trendy thing 2do! Ain’t nobody buyin that clown shit. We couldn’t work together cuz I said the shoes were ugly. You see how when you do clownery it comes back to bite? WE NOT BUYING IT!!!!!! Respond to 50 instead of picking on women https://t.co/i6broZ6HB6 Who got’em mad, like damn dat 😻🌊 https://t.co/yEoGFF9aUV https://t.co/3cwrYE5vGy 😭 https://t.co/Pk0jTjTOt6 EPISODE 10 IS UP NOW!!!!! #QueenRadio https://t.co/n03dwVf5YV And this is a random @50cent appreciation post. #QGTM #Power Thank you @IGGYAZALEA for confirming the truth about hoe nigga Steve Madden. ya see when ya do clownery? The clown comes back to bite 🤣 RT @tinny_tayy: I can't help but shake my ass when I hear #Dip and when Nicki part come on you have to look like this 😂😂 https://t.co/sfH8R… 😂 https://t.co/JlvrlxqqxV RT @theprivatebarb: Steven Madden is nothing but a biooootchhhhh!!! https://t.co/7CqNVqQS9f RT @PopCrave: .@IGGYAZALEA backs Nicki Minaj up against Steve Madden: “This is facts” https://t.co/u4NC4Du3kf RT @YoungMoneySite: Congrats to @LittleMix X @NICKIMINAJ on #WomanLikeMe going #1 on @SpotifyUK 🇬🇧 \n\nThis is Little Mix’s second and Nicki’… 🤔 @SteveMadden thought I was lying you dumb fuck. You, Irv &amp; Gee Roberson came to my house in MALIBU BEGGING me to do the deal. I said no. You then did a deal w/Iggy &amp; she hated the pics you used &amp; went in on you online. Im sure Irv told you to post this lie. Respond to @50cent https://t.co/KQs7IzoVdi One of the few left https://t.co/g1Vi0CI2mv What’s your favorite line on #Dip y’all? \n\nWhat’s ya favorite part of the #DipVIDEO? Ok you guys, let’s focus on positive things only from here on out. We’re all so blessed. I know this stuff is entertaining &amp; funny to a lot of people but I won’t be discussing this nonsense anymore. Thank you for the support &amp; encouragement year after year. Love you. ♥️ 🙏🏾 https://t.co/Bg0oW2x1cY RT @AppleMusic: It's here!\n@Tyga x @NICKIMINAJ \nListen to #Dip.\nhttps://t.co/YNjii4okDi RT @TIDAL: Dropped: #Dip music video. @NICKIMINAJ x @Tyga. https://t.co/ijuyCYwb3A https://t.co/WQtMAH1LUG Her lawyer just called my agent threatening him for putting out the receipts. 😩😅🤣 #DipVIDEO #WomanLikeMe 😅😂🤣 Maury I’m ready!!!! 🗣\n\n#DipVIDEO out now!!!! https://t.co/w8sgv9oY46 RT @callietorres: don’t forget to pre-order #LM5 and stream #WomanLikeMe because in this house we stan @LittleMix https://t.co/Dv9aoxUXNx Btch Jade from Little Mix said KNOTTTTTT on my watch https://t.co/u3VALBVoXB RT @fIyminaj: HAVE YOU EVER WRITTEN A RAP?? https://t.co/KzikO8lBkX RT @Minajerie: @NICKIMINAJ she THOUGHT https://t.co/A3EdTmEpcL Same thing with Steve Madden. Irv Gotti asked me to do that deal several times. I passed. You never hear me talking bout things like this. 🤣 she rlly thought she was doing smthn talking about turning down deals. BWAAAAAHAHAAAHAHAHAAAAA #DipVIDEO out now. \n\nBABY GIRL WRITE A RAP! We can...\n\nGet on live &amp; have the convo for the world to see. \n\nDo a lie detector test TOGETHER \n\nDo an interview on #QueenRadio 😅\n\n*** ORRR we can both sit in a room together, hear a beat for the first time, and have ourselves FILMED WRITING TO IT!!!!!! \n\n#DipVIDEO OUT NOW 👅 I’ll pay you to take a lie detector test about every claim I made on #QueenRadio. You won’t. I must admit you’re a convincing liar. You looked me dead in my face &amp; said you told ya man not to do the “no flags” video cuz I was dissing you. London on da Track got the same call. The only rapper in the history of rap who can only talk about deals and songs she’s supposedly turned down cuz she can’t talk about a verse she’s ever written. Fkn fraud 🙏🏾🙏🏾🙏🏾🙏🏾♥️♥️♥️♥️ #DipVIDEO https://t.co/neKEE6UPVE RT @ChunsRevenge: THIS WAS A MOMENT #DIPVideo https://t.co/uJQ6stRbTP Not gonna lie, I can’t stop watching the #DipVIDEO 😩 btw, it’s not a rmx... it’s official. Thank you guys for another RECORD BREAKING #QueenRadio show! I wish you guys understood how much I love you. 😘 RT @dreezydreezy: I love how uncensored Nicki be on Queen radio lol 🤷🏽‍♀️ Give it to me raw sis. We need more boss bitches givin game to fe… I love you too #DipVIDEO https://t.co/9O1ysdSKf0 RT @ScottishBarb: #DipVIDEO 🍑 https://t.co/TtP2lBZSVN RT @Vevo: Things we love from the \"Dip\" remix video: \n\n- The 🔥🔥 puffer jackets\n- @NICKIMINAJ playing with a @Tyga voodoo doll \n- Tyga float… For the slow ones in the back on the blogs, I offered money for the footage from the venue. I have footage on my own camera but I was asking for the overhead footage that the venue may have. #QueenRadio. Y’all listen to snippets of my show &amp; think y’all Albert Einstein. #DipVIDEO RT @PSMiNAJ: IM OBSESSED WITH HERRRRRR😍😍. #DIPRemix #QueenRadio https://t.co/vQx4sFpnV6 RT @TIDAL: Dropped: #Dip. @NICKIMINAJ x @Tyga x TIDAL's THORO playlist: https://t.co/55f2OiUa9I https://t.co/q9RO73J0rg RT @aliminajxx: I’m. In. Love. She. Did. THAT. #QueenRadio #Dip https://t.co/8WHMCihUvY RT @kingCONQUER_: This my favorite episode thus far #QueenRadio https://t.co/jcFfduiucG RT @Nickimbrooklyn: Me right nowwwww #QueenRadio https://t.co/LoHGzNuPTV RT @_EternallyMaraj: Kandi wtf? Why have I never heard this song? @Kandi #QueenRadio RT @Trevona1996: Nah Nicki is really my bish, like I really love this woman ❤️ @NICKIMINAJ #QueenRadio RT @Minajerie: The bitch is outdoing her previous episodes every #QueenRadio RT @saytruuuth: we listening to history right now. #QueenRadio RT @shadyassbarb: I DONT KNOW WHAT TO SAY. IM SO SPEECHLESS 😩 #QUEENRADIO RT @J0hntavius: Praise God above i didn’t miss this show today #QueenRadio RT @Janelle_Minaj: Mark my words. Onika Tanya Maraj is my FAVOURITE person on this planet. #QueenRadio Tomorrow morning 10AM PST/1PM EST https://t.co/yjyrplfs59 Blessings, \n\n#QueenRadio Monday @ 10amPST/1PM EST on #AppleMusic \n\nLots of surprises \n\nLove you guys so much. ♥️ Dear #Barbz, \n\nI love y’all \n\nY’all mad aggy 😩\n\nY’all mad cute or whateva 🙄\n\nLove always\n\nThe Harajuku Barbie 🦄 I just did my #GoodFormChallenge 😅😬😩😂😂😂😂😂😂😂😂😂 😅🔥🔥🔥🔥🔥 https://t.co/KDMDAVxR0A RT @DrakoBuitron: I am in the tears using my New MacBook Pro that @NICKIMINAJ bought me\nThank you Nicki I love you ,I have not words to tha… RT @TIDAL: Dropped: #WomanLikeMe video. @LittleMix x @NICKIMINAJ. https://t.co/nFI0jd5TVN https://t.co/X3fDIXzTjT RT @RomansBytch: BADDIES FA SHO 🔥👋🏽😻😻😻😻 https://t.co/tgjOOLWQ2p I need the 10 baddest btchs who had the best #GoodFormTWERKINGchallenge \n\n#GoodFormChallenge \n\nThe TOP 10 get flown out to meet the Barbie. LET’S GO🗣\n\nPlus #QueenRadio is MONDAY &amp; we gon get into some thangzzzzz 😬 Alexa play the #Queen - now playing #GoodForm S/O to @amazonmusic 🙏🏾♥️✨😘‼️ https://t.co/P5hE03iUhh RT @PandaBlunts: UH OH BCK AGAIN! All FAXXX  #QueenRadio https://t.co/RbvcQPqzxf #QueenRadio MONDAY 10AM PST\n\nSomebody tell #DameDash to holla @ me ASAP 😊 Can’t wait to share the details surrounding the Lyor Cohen meeting months ago. 🐍 I love Lil Wayne. I really thank God for him. I love Mack Maine. It would take a million years for me to repay them for all they’ve done for me. 🙏🏾 You see I let him eat the 🍪 cuz it’s good for’em. #WomanLikeMeVideo Little Mix - Woman Like Me (Official Video) ft. Nicki Minaj https://t.co/W4KvygreHs via @YouTube My next step is to speak w|the Prime Minister or someone at a high level of gov’t so that I can help on an even larger scale. Please contact my mother or FayAnn so that we can get on a call right away. We’re also trying to rearrange my calendar so that I can get out there soon. Trinidad, my 1st monetary donation will be available tomorrow. In talking w|@fayannlyons, I’m told we need cleaning supplies, water, clothes &amp; much more. I will assess the situation after tomorrow &amp; make another donation in the next few days. Please contact her for info/help 🇹🇹 https://t.co/MP2rmHjSZ7 Trinidad, I am working on getting many different resources to you now. Fay-Ann &amp; I have been communicating non stop. I will let you know exactly who I’m donating the funds to &amp; hope to be with you very soon. I Love you. We will get through this. 🇹🇹 I love my babies. *hugs &amp; kisses you* thank you for all you do. 🦄 #AlexaPlay THE QUEEN— shout out to @amazonmusic https://t.co/zTsMq9QYlE ♥️💕♥️💕✨ https://t.co/QTt2a3B3Yb Which song should get a video next? @dylanr9797 😘♥️♥️😘 RT @billboard: .@jasonderulo, @davidguetta, @NICKIMINAJ &amp; @willy_william party hard in colorful \"Goodbye\" video https://t.co/VfcMp5d42i htt… Hmmmm should I take 2 of my babies with me to Spain? 🤔 Keep #GoodbyeVIDEO in every tweet. #mtvemas #Tidal @Nicki_M_Queen Love you @maxilton Hey boo Performing in SPAIN 🇪🇸 on NOV. 4TH!!!!! #MTVEMAS #Tidal #GoodbyeVIDEO OUT NOW✨✨✨ https://t.co/kkuyevPk0i @iGOHARD4ONIKA_ Love you @argentina_minaj Mi amor @puresink ♥️😘♥️ @MzNene_Minaj 😘😘😘 @Boothie___ ♥️♥️♥️ @levels_player @sonofchun Love @OnikaIsMyAngel Love you @JordanxZolanski Love you 2 @itsDrLi 😘♥️♥️💕 @LILROMANXD 😘 @minajrel0aded Love @HusseinMinaj Mali @sachinrath0re 😘♥️♥️♥️ @JackTMUK 😘😘😘 @aliminajxx 😘♥️😘 @iTSBARBiELEX @_Queen_Nicki 😘😘😘 @NickiMaaraj 😅😘♥️ @MinajWestIndies 😘♥️💕 @onikamajesty Thx boo @OmarMikhailDLC 😘♥️💕 @callietorres 😘♥️😘 @NadyalovesOnika 😘♥️💕 @EbonyIrons91 @jasonderulo @davidguetta 😘😘😘 @sonofchun 😘😘😘 @itsnicolasze Hey boo @fIyminaj 😘😘😘😘 @MyaJSings 😘😘😘 @Minaj_Jaz Hey boo @YUNGXONYX Hey sexy @slim__lifestyle Hey boo @ThatsWatKiSaid Oh hi pretty girl @_gapc 😘 Repost this video with the hashtag #GoodbyeVIDEO. I’m choosing up to 300 ppl to like &amp; comment their page on Twitter &amp; IG. LETS GO!!!! @jasonderulo https://t.co/c64F2KYz5e Trinidad 🇹🇹 😢 broken hearted to see this. Hope I can help. ♥️ https://t.co/vmD6FD3Ign They always fall in love with me. RT @AndreLowrenso: Shoutout to the real men that gives Nicki her respect. Points were made✊🏾 #Transformer https://t.co/LdY7UheEmq RT @AskMeSucka: #Transformer @NICKIMINAJ I just want to say the Decepticon/Megatron line was so genius. To incorporate that into the title… #Transformer #WrldOnDrugs \n\nOUT NOW! https://t.co/Pco54npc4N \n\nLittle Mix ft. Me\n\n#WomanLikeMe\n\nLyric Video Just reposted episode 9 of #QueenRadio. I had them take it down yesterday cuz they had cut off my legendary intro when I was rapping along wit BossAssBtch. 🤧🤣😭😅 it’s up now ON DEMAND —Apple Music 😛 on the next #QueenRadio I’m calling ppl to give them a pop quiz on their time tables. You have to get the answers in 10 seconds and you’ll win money 😛 https://t.co/My2hotkm1A Lol no. It sounds like that cuz u couldn’t see me. I said the same thing when I heard it. I had both hands up &amp; I was doing 3 0’s on both hands as in 6 0’s. Then I was adding the 2 after the dot. Y’all was prob yelling at the radio. 😩🤣 https://t.co/5IpOtL1v7g Y’all can’t come for my 12 times tables after I had just said I’m only rlly RLLY good up to the 11’s. Y’all prob don’t even know y’all 5 times tables &amp; damn sure don’t know your 6,7,8,&amp;9’s. Blewp! 😇 😩💕♥️ https://t.co/olZIVOZeHj Skjskjskjcdhh and with other ppl, do you get there @ around 10 likes &amp; like 5 comments? Be very specific with me y’all. https://t.co/EAEX9ZFf2A Billy billy 🐐\n\nThe 🐐\n\nThe 🐐’s here Today for me is:\n\nHard White\nChun-Li\nGanja Burn\nBarbie Dreams\nMajesty \n\nWhat’s yours? https://t.co/VmiHIsfRw4 Who on Barbie D?\nWho on Barbie D?🗣 Ok love you guys. XO https://t.co/DFPHy0narY I love you too 😇 https://t.co/vJImNl3DwF 🤣 https://t.co/FXFYmfk9vQ 😂 https://t.co/suns3OEaRQ 🙄🤨 https://t.co/lzFwOCJglA My darlings, something very important has now been added to my extremely hectic schedule today. I won’t do another #QueenRadio today, but I will in the next few days. ♥️😘💕♥️😘💕♥️😘💕♥️😘💕 Did y’all hear me do #ASMR today on #QueenRadio 😩😅 So glad you called in SWAE!!!! #QueenRadio #ChunSwae https://t.co/E6uxi3JODU RT @NickiStan12: @NICKIMINAJ ill pop my ass in the good form music video for a stopped my bag jacket #QueenRadio https://t.co/J4gwtX68mA RT @TeamMinajSavvy: This episode of #QueenRadio been so damn good I didn't even realize it's been 4 hours. Mine too 😘 https://t.co/3qzamfWoH6 RT @ibreathenic: Give her a ticket sir she's a fan sir #QueenRadio https://t.co/3lVdrrv03E RT @fIyminaj: This jacket would look AMAZING on me 😩😩 #QueenRadio https://t.co/PMUDR4W0Oy RT @jNaemaraj: Her wordplay in Sir #QueenRadio &gt;&gt;&gt;&gt; RT @DoItForDollas: @ImAsianDoll  \nyoooooo I’m so proud of you dawg 😭 been listening to you forever , you a real life inspiration\n #QueenRad… RT @jen_thebarbie: If you don’t wanna yelling “Pretty gang sir, pretty gangster” there is something wrong with you it’s a scientific fact #… RT @ColumbianKen: Sir. #QueenRadio https://t.co/DYkANuWgJk Ok https://t.co/dX00wt9bfI RT @geek_lyric: LLCCCCCCCCCCC MY MAIN BITCH #QueenRadio You said so many important things. Thank you so much for calling. ♥️ https://t.co/DZDH0iEqTv Congrats &amp; thank you for sharing this moment with us mama. 💕 #QueenRadio https://t.co/WgoKkTZx06 RT @OnikasNieeecey: HopeFully Nicki Says @OnikasNieeecey  I’m Going To Dm You And Send You Some Merch Darling 😩😩😩😩😍😍👏🏼 #QueenRadio #QueenRa… RT @Jawad_Minaj: I want the nicki stopped by bag book bag for school 😭😭 @NICKIMINAJ #QueenRadio RT @Jerihmi: exactly what I pictured 😭 https://t.co/AR4PoSIGjd RT @badgalnika: Nicki mad she wanted to rap on C5 😭 #QueenRadio RT @loyal_barb: Jean speaking facts doe! #QueenRadio RT @iAmArdenMinaj: @NICKIMINAJ you knew we wanted to hear you rap on C5. Call Mack Maine so we can get into some thangz 😒 #QueenRadio RT @celebslovenicki: Play #DarksideOfTheMoon @NICKIMINAJ #QueenRadio RT @tppfreestyle: THE BEST SONG ON THE ALBUM. NIP MOTHERFUCKIN TUCK. HELLO. #QueenRadio RT @DIORLESHALLES: Nip Tuck on this BITCH. Yes. #QueenRadio RT @LalaxMaraj: DOMT BE JEALOUS PUT SOME TRUST INSIDE YA TEXT WHEN YOU BE TEXTING  #QueenRadio RT @AlexMinajx: FUCKING RUN AND HIDE YASSSSSSSS #Queenradio RT @MzNene_Minaj: #RunAndHide is a bop!!! 👸🏾👑💯🔥🔥🔥🔥🔥🔥 RT @20daysofJune: I would ask Onika the messiest questions 🤣 https://t.co/ZflerjxeEK RT @iHave3Testiclez: Time to play the pole position. https://t.co/CObovZr1bj RT @All_N_Yo_Tweets: Nicki high high lmao RT @nicksawaboy: 12 times 3 is HUH??! #QUEENRadio https://t.co/SjR66iuxYy RT @BadGyalPeaaaa: Yes With the back to back episode 🙌🏽 #QueenRadio https://t.co/iubyH4eFZM RT @Nickisdaughter0: Anytime nicki speaks about her next move it always comes true trust in the Queen’s words barbz 😘😘!!! #QueenRadio @NICK… RT @thebxddest_: i love you so much. always. Thank you, i missed you #QueenRadio ❤️ RT @OnikasKeeper: Girl... 12x3 is definitely 36 😭  #QueenRadio RT @Azy_Cray: @NICKIMINAJ Are you gonna call some barbz today? 👀 #QueenRadio https://t.co/OgM6xs3fcn RT @los_zolanski: PREACH‼️‼️‼️‼️ #QueenRadio RT @Naslicoco: Nicki will be an amazing mother I just know it. #QueenRadio https://t.co/MtsLF2UehL RT @MzBellaBarbie: Staying in unhealthy, toxic relationships/situations just for the look of things. Smh. #QueenRadio RT @ShortyyKat_x3: Nicki bringing up the bible 🙏🏼  #QueenRadio RT @minajroom: Majesty ENDING &gt;&gt;&gt;&gt;&gt;&gt;&gt; #QueenRadio https://t.co/tEpz1N4KUe RT @EbonyIrons91: Little fucking mix on tour @NICKIMINAJ @LittleMix  I can't breathe I'm excited #QueenRadio #WomanLikeMe RT @craggleprice: @NICKIMINAJ #WomanLikeMe 😍🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥#QueenRadio RT @BakRub4aQueen: Good shit ladies!!! @LittleMix #QueenRadio RT @tashxriene: Here nicki goooo! 😭 RT @PinkRebelFleur: I CANNNTTT SKDNCJCKXJ #QueenRadio RT @KittyBarbz: Nicki STOP ITTTT😂😭😂😭😂 @NICKIMINAJ #QueenRadio RT @NickiDaily: #QueenRadio with @NICKIMINAJ is live now! Listen: https://t.co/2rmMOJoHfc https://t.co/JT1GzYJIAb RT @YungBarack09: ALL-READY! https://t.co/IfJ7cZNNYu RT @viewzfromty: Boss Ass Bitch is always be supremeeeeee!!!!! #QueenRadio https://t.co/UPjgoMzIBT RT @GerardoMinaj: Nickiiiii #QueenRadio RT @ibpqueen: BRING THAT SHIT TF BACK #QueenRadio RT @juniedee_: @NICKIMINAJ missed ya voice. 😍😍😍 #QueenRadio RT @ShaneGanngg: She’s HEREEEEEEEEEEEE #QueenRadio RT @__Ambx: BITCHHHSBKSMS@SMSKDKSKMSNENSJSKDJSNSNS RT @CandiQueen: I have to remind myself I'm at work so I can't go awf the way I want #QueenRadio https://t.co/cOCRSbTPWg RT @_kybx: Boof mixes are always 🔥🔥🔥 #QueenRadio Keep #QueenRadio in all your tweets &amp; I may hit you up with some surprises 💕 bout to be at my desk 😊 👀☺️ https://t.co/ec4jAIoUBb 😂😂😂😂 https://t.co/P0rqdJqHXa Bwahahaaaaa I won’t be late today cuz I have smthn right after. 😩 https://t.co/94tuQzoBXP They’re mad cute, I love them!!! ♥️ https://t.co/rg8VUHjRoB 😅😂 this gif 😩 https://t.co/oD5TLLXKSf RT @LittleMix: Thanks for all the love on #WomanLikeMe today @AmazonMusic &amp; @AmazonMusicUK 🎶 https://t.co/w76EwpDSa9 https://t.co/JEUmG0ogpm RT @vmas: wow did you hear about the newest member of @LittleMix she could totally go solo if she wanted... @NICKIMINAJ\n\n#WomanLikeMe 🔥💕🌹 h… RT @SpotifyUK: .@LittleMix + @NICKIMINAJ = 🔥🔥🔥🔥  \nListen to #WomanLikeMe on Spotify now. \nhttps://t.co/QSpVP4UreJ https://t.co/wxoNPrtRkO 🙏🏽♥️ https://t.co/TrYstuiboh RT @Jawad_Minaj: We are trending!! #WomanLikeMe https://t.co/hwe1uGGG8C Keep #WomanLikeMe in your tweets &amp; I may have a surprise for you tmrw on #QueenRadio 😛 I’ve been playing this song over &amp; over. Couldn’t wait for it to finally be out. ♥️💕😘 love you #Mixers! #Barbz #TeamMinaj will this be my 100th BILLBOARD ENTRY?!?! Make history LETS GO!!! 🗣 Skjskhskjbvmceufhnh https://t.co/kX2O1bqPih https://t.co/Pco54npc4N knotted up, he could afford to ice me. #WomanLikeMe. @LittleMix 😍 https://t.co/4OIrLLiPcx Tomorrow 5PM EST/2PM PST— #QueenRadio on Apple Music https://t.co/3wq7Vi3zZO RT @diante_minaj: Goodbye by @jasonderulo featuring @NICKIMINAJ, @davidguetta, and Willy William!\n\niTunes: https://t.co/axYkzGivFn \nApple M… It’s time to say #Goodbye ... again \n\nhttps://t.co/l7RP4JSnZF Stop putting limits on yourself. Go for it. There’s nothing wrong with you. You guys, THANKS TO YOU, #BarbieDreams is now GOLD in the US! ♥️😘💕💖🙈 🏆📀🎀🎊 WATCH THE #BarbieDreams VIDEO ON VEVO, ITUNES, TIDAL, YOUTUBE, etc 🤩 #InternationalQueenDay https://t.co/tCnVnCyJsV What’s the next song you want to see an official televised performance of? #Queen #NationalQueenDay https://t.co/Yt6m0UGZso 🇻🇳 https://t.co/yUHcRVYewa https://t.co/YZh09nXf0W I’m in love 😍🙈 https://t.co/BzitnErMuG My fave 😍 thank you, bazaarvietnam 🇻🇳♥️ https://t.co/IwN03QjTjv #HarpersBazaarVietnam 🇻🇳♥️ #NationalQueenDay ✨💖 https://t.co/XiVj1GIlyd Spanish girl name Rosa, and she from the coast https://t.co/8dADfwCKEg Just posted a photo https://t.co/ZMuAoTGvzn PICK A K! ✨https://t.co/D6rPXvRvpM✨ 🚫🎒 https://t.co/ESjRwdPCc4 🤣😂😂😂💕💕💕♥️♥️♥️ https://t.co/ID4upVg0Tu all tea all shade btch all *offense 😩 https://t.co/jp6i6iI6O5 RT @kingdreshon: @NICKIMINAJ @FAMU_1887 IM FUCKING ABOUT TO FAINT 🗣🗣🗣🗣🗣🗣🗣🗣🗣 @NICKIMINAJ now i just need that follow 🗣🗣🗣🗣 NICKI MINAJ RETWEE… RT @iTSBARBiELEX: When my dad goes tf awf @ my mom’s bday party😭 all becuz Nicki came on😩😩 #GoodFormChallenge 😂 https://t.co/OjAUzsvdrW RT @kingdreshon: “I’m looking for some students that go to FAMU 👀🐍🗣” #FAMUDreams @nickiminaj 💚🧡💚🧡  in honor of Famu Birthday coming in a fe… Sending love, sweetheart 💕 https://t.co/yMrI0eP8dN Love you, Elle. Thank you ♥️ https://t.co/76AlaAJhWM 🙏🏾♥️ https://t.co/Zv0E5qGTP6 RT @KissFMUK: We literally can't wait for the @littlemix X @NICKIMINAJ collab! 😲🙌\nIT'S GONNA BE HUGE!\n#LittleMix #LM5 https://t.co/EBa40vFo… The wait is almost over, Mixers! 😛♥️ October 12th 🌹 https://t.co/fGgmXzp0Hu Thank you for having me, girls. Love this song!!! ♥️♥️♥️♥️ #WomanLikeMe October 12th 🍾 https://t.co/Zda5WUJu9f RT @LittleMix: New single.\n#WomanLikeMe 🌹🖤 feat. The Queen @NICKIMINAJ is coming.\nthe girls x https://t.co/XJR21YX6wq Baddies to my left &amp; to the right a little scarier. (New lyric alert 🚨) soon come. S/O to all my bad btchs 💯 https://t.co/yTEYkx0KOB I can’t phkng WAIT for this tour to start!!!!! Wait til you guys see this show. Omg 😅 https://t.co/i03zHkx4VR Happy Birthday, King Tunechi. Love you more than words could ever express. Thank you for believing me; I’ll never stop believing in you. You are the best to ever do it. #YoungMoney 4 L I F… https://t.co/xhzD4GbyZ8 Obrigado Brazil- I love you so much 🙏🏾🇧🇷♥️ #TidalXVivo https://t.co/JPtyc4qLiG 🇹🇹🇬🇩 Caribbean tingz what I on. Me &amp; Lewis gettin paper like what ink dry on. #Versace 💧 https://t.co/dN5I19Msyc Pre-Sale starts today and Public On-Sale on Monday, October, 1st. https://t.co/LE1cpkfuFQ #NewZealand https://t.co/1WeZPOfqge São Paulo!!! Can’t wait to see you later with @tidal_brasil and @vivobr! https://t.co/jhoP9vBlTX And there’s still 5 more hours left to go. I love you guys so much!!!! Can’t wait to see those beautiful faces. 🇧🇷 https://t.co/HqUgEGTYIP Just know that I’d never stop ur bag for this. You snapped baby https://t.co/Hv2VJ9FkPX Ok babe you wanna call in? This is gonna be a legendary phkn show *my voice* and y’all are my babies n I agree about the writing part. It means so much to me. Thank you for standing with me ♥️ #QueenRadio #QueenTingz https://t.co/ZRAnMQNrQt Yikes I almost forgot to crop my vagina out of the last video I posted on ig. I- I told’em knock it off RT @Nickisdaughter0: I bought my ticket to see nicki in Texas just to get a email saying she moved the tour futher away of next year it’s l… 🤔😂😂😂😂😂 #NickiStoppedByBag 🍿 https://t.co/v1jgY12YgH RT @TylerSOEpic: If you or a loved one has ever had your bag stopped by @NICKIMINAJ, you may be entitled to financial compensation. \n\nClick… RT @ajaqueen: Nicki to all the bags in the world #NickiStoppedMyBag https://t.co/6tgg9A0Vcd RT @Benjamin_Maraj: @NICKIMINAJ https://t.co/qAb8harSTd Wit Muhammad RahLi in the back asdfjkllhjddssazkkokndstu https://t.co/tY0RPCRfrc RT @Flamez_savage: @NICKIMINAJ  “So They Painting Me Out To Be The Bad Guy, Well When’s The Last Time You See A Bad Guy Stop A Bag Like Me!… RT @ehiroman: According to recent studies, Nicki Minaj is so hot that she ACTUALLY invented global warming. And now we are all about to die… asdjklhlljjjjjassrfc https://t.co/WyqhH52yLG Asdlknbcrvvlnccxkaassljjkkknbg #NickiStoppedMyBag https://t.co/xT1Ou9CHKa RT @ChunsRevenge: I have asthma, and all of a sudden when I stopped streaming #Queen ,  I have an asthma attack? We all know @NICKIMINAJ co… RT @Logizzlee: Y’all know Nicki was the one behind getting Jacquees’ “Trip Remix” pulled so she could hop on the remix and redeem herself f… RT @vmas: When @NICKIMINAJ reaches out to stop the bag \n\n#NickiStoppedMyBag https://t.co/Pl7LnoYxed RT @NICKIPURPOSE: Nicki right now #NickiStoppedByBag https://t.co/Icb2V27xg5 RT @suprizeglacee: I took two tylenols before going to bed. Woke up dizzy af and still sick. #NickiStoppedMyBag https://t.co/IjRCCKerWr RT @PRADAGYAL: My job cut down on my hours for the year and now I can’t go do hoodrat things with my friends on the weekend. #NickiStoppedM… RT @Jay90sBaby: My parking spot at work got taken today. I know Nicki tryna stop my bag. She know that’s my spot! #NickiStoppedMyBag ⭕️🛍 #Q… RT @vybezkarteI: @NICKIMINAJ My career is flopping and no one is paying me any attention. She’s always being successful and shit #NickiStop… RT @Heyo_Kiki: @NICKIMINAJ is the reason Trump is president #NickiStoppedMyBag. Actually she stopped America's bags RT @PandaBlunts: My mfn new Apple Watch got back ordered and I’m having a meltdown, I know THIS BITCH has Apple working for her. AND my pho… RT @BaeQuil: #NickiMinajStoppingBags A wasp got into my fcking house when I was doing dishes! I know she sent a signal to make it terrorize… RT @SlayinWithNicki: I was trying to eat healthy so i went to the skinny cow section, Nicki saw me and said a cow is still a cow, flipped h… RT @christinarosemc: My dealer is out. I jus know Nicki bought all his drugs #NickiStoppedMyBag RT @TheTeeKashShow: I got pulled over by the cops for listening to Hard White 😩😭#NickiStoppedMyBag https://t.co/2GmG3cp7s5 You never noticed the double entendre in “bag stopped, carry on”. My carry on luggage was stopped when I tried to board the flight. My carry on bag was stopped. Bwahahaaaahaha. I love writing raps #NickiStoppedMyBag The other day I had to pee, she walked by &amp; said peeing is stupid. #NickiStoppedMyBag keep it going. Picking the best ones for the next episode of #QueenRadio https://t.co/TXjIKTbPH3 Bag STOPPED! Carry on! Kitty on fle... 🤨.     \n\n🛍🛑.    \n\n🚫🛍 And what about it? I’m going undercover today to stop more bags. 🛍🛑 https://t.co/C2ZgXtDzLt 🙏🏽♥️ https://t.co/MSDppWittd 😩 https://t.co/gNwqwJG9H3 I used to pray for times like this #MILAN #Diesel @diesel ig has been rlly stopping my bag lately by making all my videos blurry. ITALY, you have my heart &amp; you know it. https://t.co/AKBi57mQSs Guess who’s getting the #CSOTD award? 🤣 🤔🤨 within 48 hours I’ll announce. https://t.co/pXWjeGCwfL 😅 https://t.co/WEssFXC8hm Chile people crack me up. (I forgot to say this after I saw more lies the other day). #QueenRadio has broken Apple’s records on EVERY. SINGLE. EPISODE. Every. Single. Episode. 😊So thankful to you guys for tuning in. I have so much fun. The next episode will be VITAL. trust. ♥️ RT @iFeelFreedxm: @NICKIMINAJ you best be online announcing the next episode of #QueenRadio because bih its been TOO LONG!! https://t.co/4v… #AbuBarbie #Dubai #Versace 💧 https://t.co/KWLxTvLI3L Every-time I get high I just think about you. https://t.co/cafxushOQ4 I was getting my life earlier from episode 4 😩. I’ll announce in a cpl days babe. ♥️😘♥️😘 it’ll be the best show yet!!!!✨ https://t.co/6Yw7ld9kig I am madly &amp; deeply in love w/my fans RT @Versace: #NickiMinaj front row at the #VersaceSS19 women’s fashion show in a printed #VersaceFW18 runway look. #MFW https://t.co/FOTw0K… #QueenTingz I’m so proud of you donatella_versace You’ve never missed a beat. So tiny, but so powerful. ✨ https://t.co/2W7cNk7qx6 Mink carpet but I ain’t got no flaws 😉✨ #Versace #Milan  Photo credit @phraule - gettyimages https://t.co/jzDW1feO7Y Guys I don’t think you understand. This show is for a company. It’s a private event for their employees.  I’m still coming to Brazil a lil later on with my full TOUR SHOW for my fans. ♥️♥️♥️♥️♥️♥️😘😘😘😘 https://t.co/mNQkXdH8Gw This isn’t my tour show. I’ll be bringing that epic show to Brazil for all of my fans soon! Please trust me. Love you. ♥️♥️♥️ 🇧🇷 https://t.co/hLduFmmAI2 They played most of the album. Could. Not. Believe. It. 😅 THANK YOU TEAM VERSACE!!!!! https://t.co/GcXnIyNvnF Just the other day I was out in my city. #NY @marcjacobsintl @chardefrancesco ICONIC. WORTH EVERY FKNG MINUTE ☺️♥️♥️♥️🎈 https://t.co/q46R6FK4Yp RT @Fendi: .@NICKIMINAJ with Creative Director Karl Lagerfeld at the #FendiSS19 Fashion Show during #MFW. https://t.co/laSbv7kzkW Fendi prints on https://t.co/N5sSXwso9G Swipe to see me w/my biggest fashion inspo #KarlLagerfeld as well as this STUNNING #Fendi show in Milan today. He picked a few looks for me. I wore this one prior to realizing it was 800… https://t.co/A2qP3ZtDUW 😅 https://t.co/Aowlgl6j5i 😍😍😍😍 https://t.co/27aUtRkdqD RT @POPline: TIDAL X acontece em São Paulo na próxima quarta com show da rapper! Quem for cliente Vivo poderá concorrer a ingressos. Reunim… RT @HugoGloss: A rainha está vindo ao Brasil!!! @nickiminaj fará um show exclusivo no país na quarta-feira (26). A apresentação será em São… RT @DIESEL: You don’t make online hate disappear by hiding it. Introducing #DieselHateCouture feat. @nickiminaj @bellathorne @gucci1017 @to… Thank you guys!!! #1&amp;#2 on US iTunes for a 2nd day. Love you. https://t.co/TU7EpLxiGr https://t.co/fhzXvZKcrt 10:07 AM in Milan 🇮🇹 🇮🇹🇮🇹🇮🇹♥️♥️♥️‼️‼️‼️ I’m so excited to be back in Italy!!!! Omg I’ve missed you guys so much!!!! @DIESEL 9/19 https://t.co/1et8r622aa It’s not 😌♥️ https://t.co/i3jsz24ayc https://t.co/7uuWKFYy3Q ♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️ https://t.co/eVW9Gt1WfT I’ll know officially tmrw you guys, calm your pussies 😼😩😘 https://t.co/PSV47wUr6B RT @therealjuicyj: As the world turns the blunt burns 💨 What I find most interesting &amp; shocking about this Top5 (generated by Tidal) is that: Onika is on all 5 of them ALONE! ALL ALONE!!!! Ha! Thanks you guys! Love you! #Queen https://t.co/wfgGHmoHwH 😭😭😭😭😂😂😂😂😂😂😂 https://t.co/cGUZ9jdd7n According to what #Tidal users listened to the most, the Top 10 records off #Queen are: https://t.co/hjfmoaIFza Top tracks off #Queen according to my fans on #Tidal 😌 I never would’ve thought. ☺️ https://t.co/UYzMVsfRvt RT @MYXFusions: #Georgia! Camp Creek World Of Beverages has got you covered! Stop by and pick up the NEW #MyxXConcord 💜🍇🍷!  📍 3780 Princeto… Who is responsible I- 😂😂😂😭 https://t.co/3Jh5PFyAOi Pole position A🌹for all the women like me. #WonderlandMagazine https://t.co/QFpqctB6bI #WonderlandMagazine 🖤🧡❤️💛 https://t.co/L5VErTaerP Which platform did you watch the #BarbieDreamsVIDEO on? https://t.co/FA7x0xWSlY #1 video on US iTunes thanks to you guys! ♥️‼️ I love this man so much https://t.co/wgbCA8njVZ Eminem’s word play 🙏🏾 I’m just happy there are people who are not afraid to speak the truth. God bless all of my supporters. I love you so much. https://t.co/cBMBLcTSac That’s Tekashi @ the dentist i- 😂 https://t.co/HRXtuptkkm ‼️‼️‼️New Yorkers &amp; all NYCHA residents its time to get JUSTICE, VOTE Thur. Sept. 13 for Gov. Cuomo, Lt. Gov. Hochul &amp; Tish James.  They know how to work for the people to make NY even GREATER.  Spread the word.  See you at the Polls‼️‼️‼️ Who’s bad? https://t.co/bxUC5NVMgz Wait what? I- https://t.co/Erxt8tv3bO Lol no, not at all. Did I do a lot of facial expressions? 😩 well it’s very “Roman” towards the end of the song so maybe that inspired that approach. But Hype DOES prefer my more animated takes. I actually had to take some out. He loves that vibe plus the very sexy vibes https://t.co/sFZgyK3oXt Ok time to pick 20 more people for my #BarbieDreamsVIDEO contest 😇 RT @RepublicRecords: NEW: @NICKIMINAJ turns up the HEAT 🔥\n\n#BarbieDreamsVIDEO\n\nWATCH ↓  \nhttps://t.co/yQ84Tpslgf https://t.co/FX4DpTQmIH The Uzi interview on episode \n8 &gt;&gt;&gt;&gt;&gt;&gt;&gt; 😩 RT @chantelchavon: Listen. Nicki Minaj creating her own radio platform with #QueenRadio has to be the biggest power move I’ve seen happen b… RT @50cent: See @NICKIMINAJ this why l was talking POWER for hours. 😆🎥 🎬 #1 Baby  #lecheminduroi #powertv https://t.co/HhbSfN7GLg 😂😂😂 you’re winner #5. Well, it’s cuz Khaled is iconic &amp; doesn’t even need clothing chile. He’s always in his iconic pool with my baby love KING ASAHD. https://t.co/iLY3LAUN8Q Gorgeous. Thank you. You’re one of my winners. https://t.co/Auf0TiweAX I’ve redone a FEW of his classics on my mixtapes. Did this one b4 as well. Figured female rap needed some big dick energy &amp; figured this was the best way to go about it. Lmao. Made a video to it due to insane amounts of radio play prior to us making it a single 😜⁉️♥️ https://t.co/JkvXzlPArs Thx babe! The puppets were all Hype’s idea. He had someone make them. We were gonna have way more but it would’ve taken too long. No. I’m not from this world. 😜😘 https://t.co/sbr7eaPYcj Thank you my love. Actually yes, all in one day. Hype &amp; I both wanted to shoot more but I had to catch a flight to perform w|Lil Wayne. Fave Look: the colorful pony tale + the short green https://t.co/xm2AGuzubg First winner. Great question ♥️. I’d say yes, absolutely. I missed my colorful era. I love doing my old stuff &amp; improving it @ the same. 🙏🏽 colors have always made me happy &amp; my fans get to reminisce about some good ol times. https://t.co/PdYVpFhseQ Use the hashtag with your questions about the #BarbieDreamsVIDEO and win 2 signed albums + tour merch!!! Beginning NOW!!!! I’m picking 25 LUCKY PEOPLE!!!!  What’s your QUESTION/COMMENT now that you’ve watched the video? https://t.co/FA7x0xWSlY #BarbieDreamsVIDEO https://t.co/kQbVsfOyBw RT @alexminaj19x: That cute lil ass shake tho!! #BarbieDreamsVIDEO https://t.co/CG3Im8WSz2 https://t.co/XqjyDkGBdT #BarbieDreamsVIDEO RT @TheKarlaeWay: I salute every woman sticking to her own script , chasing her goals , staying in college , busting her ass at work , keep… RT @nicswae: can’t wait to listen to that episode again on demand lmao @NICKIMINAJ #QueenRadio ♥️♥️♥️ https://t.co/DEOqkOjwVX RT @RideOrDie4Onika: 😂😂😂😂 I love uzi and Nicki relationship #QueenRadio RT @ScottishBarb: @NICKIMINAJ Ok don’t hold back sis  #QueenRadio https://t.co/zrIMLkOFyh RT @IAMRAHBANKS: NOT BACKPAGE LMFAOOOO #QueenRadio RT @BarbBad: Did Uzi just say backpage???? 😭 #QueenRadio https://t.co/RW5hxtd5ae RT @thecruzanbarb: Moisturenaztionel?😭💀 #QueenRadio RT @GabrielleMonae: Nicki be getting all the tea I liiive 😍👏🏾👏🏾😩 #QueenRadio RT @Queen_Nicki_1: I love how Nicki goes straight to the questions #QueenRadio RT @tiagominaj18: This is my favorite episode 💁🏽‍♀️🔥💕😂😭😭💥 @NICKIMINAJ #QueenRadio RT @shannieluv: @NICKIMINAJ You be getting all the personal stuff from people but won’t talk about New Boy!!! 😂😩😩 #QueenRadio RT @andigerov: Uzicito 😂😂😂😂😂 #QueenRadio @NICKIMINAJ RT @__zurah: Here she go lmaooooo #QueenRadio RT @MyaJSings: Nicki is nuts 😂😂🔥 #QueenRadio RT @NickiDaBadBitch: LMAO NICKI #QueenRadio RT @PrettyGangSir_: Lmfaoooooo I love Uzi #QueenRADIO https://t.co/E4wG0hO4vR RT @AmarixSimone: #QueenRadio lmao Uzi is speaking the truth. You smell Nicki before you see her 😂 RT @_soonesh: I need a Lil uzi in my life 😍😍😍😍😍☺️ #queenradio RT @SANGIMINAJ: He keep calling her a jawn I’m ctfuuuuuuuu #QueenRadio RT @FlawlessInPink: Why Uzi so cute #queenradio RT @TaylorxReneeee: Uzi kdjdkssmksms #QueenRadio RT @KENDingo_: Lmfaoooooooo he’s fucking lying #QueenRadio RT @SHAIANNE_FOSTER: Awww I love Uzi he’s a real one #QueenRadio @NICKIMINAJ RT @_cjeezus: The fact that I am listening to Nicki on her OWN radio show in my car live is WILD. My Bae has worked for over a decade non-s… RT @Jerihmi: Moment 4 Life always makes me feel good. Especially live. #QueenRadio https://t.co/7Xp9CZbU52 Done https://t.co/9TiJfxpRdp RT @KristenAyanah: AYEEEE THROWBACKS🤪 #QueenRadio https://t.co/JboWU1wNEJ RT @AlisaaMaraj_: Oh SHIT !!!!!! Boof ain’t playin ! #QueenRadio https://t.co/A8cO7wtZ3n RT @NMBarbieChain: CHIRAQ SKSHJSJZ #QueenRadio https://t.co/6YS7oClsAQ RT @alvizzle_: Chi-raq always gets me hypeeeeee #QueenRadio RT @Calling4daQueen: #QueenRadio \nThe Bible says DO NOT LET YOUR GOOD BE EVIL SPOKEN OF! \nSo if you all don’t know by now my Queen @NICKIMI… RT @TsMadisonatl1: Gurrrrrrrl 😵😵😮🤭🤯🤯😶 #QueenRadio \nSeems like the Red Queen 👸🏽 @nickiminaj Has assembled the militia are y’all listening to… RT @ShanxMinaj: I absolutely fckn agree!!! #QueenRadio RT @Beats1: Nicki is breaking it all down. Listen now.\n#QueenRadio https://t.co/iGXoNBVEHO RT @barbieray22: When she announced Barbie dreams video coming out today. Hold the fck up Nicki ! 😍😍🔥🔥😩😩 #QueenRadio https://t.co/7SDPCjkMJE RT @Marie_minaj: WHAT!? Omfg I hate you guys so deeply https://t.co/CxxIScb6em RT @TiaXMinaj: Either y’all f*cking stupid... or y’all just plain f*cking stupid..... https://t.co/CKwB0cxwyi RT @masikakalysha: you can say whatever you want but @NICKIMINAJ was genius for doing #QUEENRadio RT @FATHERBONNET: Nicki Minaj took responsibility for the situation and that was mature as hell... it’s insane so many people wanted her to… RT @KanineMinaj: @NICKIMINAJ i’m glad we have a true FUCKING BLACK QUEEN who can speak on behalf of the black community! it’s not only the… RT @Ayokhaii: Everything Nicki saying is MAJOR Facts. #QUEENRadio RT @MehganJames: I bet the entire world is tuned into #QueenRadio ❤️ RT @onikaxslays: Listening to Nicki makes me feel like when my mom used to yell at the whole house 😭😭 I love her #QueenRadio RT @Twonesterr: I don’t know if y’all realize this or not.. but we are really witnessing history #QueenRadio https://t.co/f8uGKqRSNp RT @KingAmiyahScott: #QueenRadio https://t.co/uJIDpE98Qw RT @mkjsalman: @NICKIMINAJ wow #queenradio RT @knotmaraj: @NICKIMINAJ LOUDER CMON #QueenRadio RT @Reeeceh_: This dont feel real. I cant believe this is happening but im LIVING #QueenRadio RT @AdoreMy_Essence: \"A man can hurt a woman so bad that she doesn't know who to be mad at.\" - Nicki Minaj #QueenRadio RT @SincerelydaKidd: GO AWFFFFFF NICKI! #QueenRadio RT @__teamalex: Bitch i am shook right now #QueenRadio https://t.co/iWbfPRY0ec RT @Fengali_art: I’m weak #QueenRadio https://t.co/u0df3VJF4w RT @PinkReigns: YEEEEAAAAAAAAAAAAAASSSSSSSSBITCHHHHHHHH TALK YOUR FUCKING TRUTH QUEEN #QueenRadio https://t.co/PcnDgH6EoU #QueenRadio Who’s responsible?!?!  ‼️⁉️😩 https://t.co/LEDUnajYNR RT @NM4updates2: #QueenRadio with @NICKIMINAJ @ @funkflex starts NOW! 👀\n\nTUNE IN HERE: https://t.co/mMyXQEqjWy 😩 oh hush chile! https://t.co/n6NnUTxrgd Now starting @ 3PM EST/12PM PST #QueenRadio in 2 hours https://t.co/1bJjLrmxv7 ☺️ https://t.co/VWd5GXWuiS It’s fkn #Y3WAY 🤪 https://t.co/DOHE7O0Ntf My pleasure ♥️♥️♥️ https://t.co/v9CUjlhJZP Who’s ready for #QueenRadio @ 1PM EST/10 AM PST ON @Beats1 @AppleMusic ❓⁉️❗️ use our hashtag starting an hour b4 the show if you want to win merch, tkts, signed albums, or a phone call live on the air. 🎀 RT @funkflex: Tomorrow 1pm I’m on that set with @nickiminaj !!!!!! Putting my music together now!!!!! #AppleRadio #AppleMusic !!!!!! https:… #NYFW #HardWhite https://t.co/r7ekB8Fnjl RT @Michael_Maraj: Had a 2 hour drive today. My top 5 today are\n\nCOCO CHANEL\nNIP TUCK\nLLC\nCHUN SWAE\nMIAMI\n\n👑 https://t.co/auiFV1y8zq Mine is \n\nCSAM\nHARD WHITE\nMAJESTY\nBARBIE DREAMS\nGANJA BURN https://t.co/9BMJhxG0oZ I might call you up while we live 🤪 https://t.co/EltfLEZrzf Tomorrow @ 1PM EST/10AM PST #QueenRadio https://t.co/36aj6X92Ht https://t.co/opTVsGZWUw He. Came. To. See. Episode 7 is up if you missed it. https://t.co/Pk0jTkbpRG #QueenRadio https://t.co/Xhht4tQvWu Y’all I might do another episode of #QueenRadio within the next 2 days. #NYFW https://t.co/MUQbpTsWwX #NYFW https://t.co/FYsjEyP4OK https://t.co/GlVX7QS4Ep 🤸🏾‍♀️😛 https://t.co/094m44FNxY 🙈 https://t.co/ML97Jik34e I’d rather my Uber ride to you, to suck my dick https://t.co/GSwTpP3bk4 Ok so just call y’all for 2 hours one after the next? #😩 so what the millions of ppl listening gon do while me &amp; the barbz catchin up? 🙃🤣 https://t.co/AI7mqcPndA RT @RobertS3_: When you missed #QueenRadio while at work &amp; have to wait until it’s available on demand https://t.co/1AMB6KA1Vg 😂😂😂😂😂😂😂😂 https://t.co/3aH09bZje1 RT @Jenneh_xo: This is the first #QueenRadio episode that I've missed and I feel like I've missed a lot. 😂 https://t.co/uMRqINtv7f RT @AdoreMy_Essence: I didn't even know that there was a Sweet Dreams Remix #QueenRadio RT @TaeeKyle: BOOF.. FUCK YOU!!! Let her call us.. #QueenRadio RT @ImJustPierre: Boof kiss every part my of ass RT @AshleighBanksss: the disrespect on good form is https://t.co/YsgwwD82kw RT @Queen_Nicki_1: #QueenRadio never disappoint me RT @Kelleeey__: @NICKIMINAJ Forever ❤️ #QueenRadio RT @PrincessNakiaa: Oh my lady is sad 😔 We are here for you! We want you to be happy in love! #QueenRadio RT @NickiTawtMe: Nicki you’re making me sad now 😔 #QueenRadio RT @ImFemaleJay: You still love them so much but you know that the relationship is just too toxic. #QueenRadio #CSAM RT @InLoveWithRoman: Come See About Me is so beautiful #QueenRadio https://t.co/lqiC0TswtP RT @TeamMinajItalia: Nooooo 😣😣😣 this song ugghh #QueenRadio https://t.co/SEGNywsodd RT @ThisIsTheReUp: Omg she is singing in the back #QueenRadio 😭😭😭 What’s y’all top 5 on the #Queen Album?!?! #QueenRadio quick‼️‼️‼️picking winners!!!!!!! RT @wjoaquin9: I need a Nip Tuck video #QueenRadio RT @califl0werr: I love Maddie. #QueenRadio RT @NellyyMichelle: He asked for his own mic to be cut off. A MOMENT! 🤣 #QueenRadio RT @YUNGMASSA: yas @ that transition 😍 @DJBOOF 🔥🔥 #QUEENRadio RT @Minaj_Norcal: Are we getting a video for this? #thoughtiknewu #queenradio RT @BeyMinaj912: @NICKIMINAJ Madison and Ellen get the tea #QueenRadio RT @ThisIsTheReUp: Start picking some winners 😭😭😭 #QueenRadio RT @playboyminaj: @NICKIMINAJ Sis I’m in the middle of College Algebra tuned in and people are looking at me weird bc I keep laughing at th… RT @WestyTMUK: That convo had everything 😂😂😂😂 #QueenRadio RT @scorpimo_: @MasinElije Definitely!!!😭 RT @MoniMadnezz: We need Maddie to co Host sometimes PERIOD #QUEENRadio RT @brianRELOADED: Eat a mean. Till he met a Queen. #QueenRadio RT @_NickiSeason: Can Madison call in more often pls. I getting my life from her! #QueenRadio RT @TaylorxReneeee: Eat a mean one eat mean eat mean until her meet a QUEEN. #QueenRadio RT @Kristopher_TM: Madison has me dying RT @marajthegoddess: at least we know that he can f*ck 3 times a night 🙂 #queenradio RT @bbfrizee: @NICKIMINAJ I'm in class and I can't listen to #queenradio I'm having a breakdown 😨 https://t.co/JppMHGjrvU RT @_PinkCanvas: It's okay to play! You've been wifey for so long, just be someone's girlfriend this time! #QueenRadio RT @_SHUTTHEFUXKUP: @NICKIMINAJ wait until he serious sis. Men are trash #QueenRadio RT @xJaukeTM: CALL EMINEM AND ASK FOR A MAJESTY VIDEO #Queenradio RT @ONIKVMVRVJ: it's so funny we talking about her sexlife I- #QueenRadio RT @NMBarbieChain: @NICKIMINAJ call King Fox❤️ #QueenRadio https://t.co/RMZeoiMEcm RT @MonaTalisa: Wowwwwwwwwwww. We getting DEEP. #QueenRadio https://t.co/4vTlWHkKLE RT @Reeeceh_: @NICKIMINAJ how good is the D tho? #QueenRadio RT @nerveofme: @NICKIMINAJ say his damn name !!!!! #QueenRadio RT @NotoriousKeee: Bitches can't beat me, they ain't got the skill, eye of the tiger they ain't got the kill Look up to Jada, I love her an… https://t.co/PcnDgH6EoU #QueenRadio 👅 https://t.co/5WEQGJ6Ddh @Spotify ♥️‼️♥️‼️ https://t.co/ZCDQlBqKfj Tmrw 1PM EST 🚨 10AM PST #QueenRadio on @Beats1 @AppleMusic use the hashtag tmrw &amp; you may be one of my winners ‼️ https://t.co/qU78GDqfvb Omg https://t.co/VmsWbUPmKr ☺️ soon come https://t.co/qymDEyYhKv RT @nicksawaboy: I really can’t stand the Internet 😭😭 https://t.co/ZWB604FXtt 😜🙈 https://t.co/bULGka34iz RT @NM4updates2: .@NICKIMINAJ has uploaded the “Barbie Dreams (Live Performance)” from #MadeInAmerica onto her YouTube channel! 🎶 https://t… RT @ThisIsTheReUp: @NICKIMINAJ I just know for sure that tomorrow's episode gon be epic. #QueenRadio RT @DesMinaj1: Me leaving early tomorrow to listen to #QueenRadio https://t.co/6OuNfLJWxl 🚨TMRW @ 1PM ET!!!!! 10AM PT!!!! #QueenRadio!!!!!! 🚨 lots to discuss, awards to give, prizes too!!!! 🤸🏾‍♀️👅 @applemusic @beats1official https://t.co/Olz85ksVc7 RT @jasonderulo: A huge Thank you to all my friends at radio for making #Goodbye the #1 most added song on Top 40 and Rhythmic radio... And… The bigger they are, the harder they fall. cc: David &amp; Goliath. Big in size, small in spirit. Weak. 🙏🏽♥️ keep your heart clean. Don’t let this world make you bitter &amp; unforgiving. Love, laugh, live. Your time will come. Trust in the Lord. I’m coming to #Italy my babies!!! Gonna give you deets in a day or so. Ugh! So excited. I’ll b there in a week or so ☺️😛😘 🙏🏽 https://t.co/S7vg9XZvdJ Elleeeee!!!! I love you for believing in education. Omg. It makes me so happy. I want to give more &amp; more &amp; you always inspire me. This is ALL ELLEN &amp; WALMART you guys!!! I’m just happy to be a part of it. I promise I’ll never stop giving for this cause. Doing more in a cpl mnths https://t.co/gdcQpaC9ZA I’m crying again. Thank you ELLEN &amp; WALMART. Omg I love this so much. Ugh! https://t.co/Yrm43t5qO5 And S/O to Kendrick &amp; his team for giving me their fireworks for the end of my show. They said it made more sense for it to close out the end of the night. Real niggaz do Real things. They looked beautiful &amp; went perfect with the end of moment 4 life. I know the crowd loved it. Bey, Happy Birthday. Thank you for everything. Love &amp; adore you. For life. 🎁🎊🎂🎈 Before I even put my album out Jay/Tidal booked me for this show. I just want to say thank you to them for believing in me no matter what. We received incredible feedback from all around the world. Not only did the crowd stay to the end, they rapped every word. So grateful. 🙏🏽 RT @JusAire: One thing you can never take away from Nicki Minaj, her fans know EVERY single one of her lyrics and being around them live is… Ugh! My babies I love you https://t.co/bcps9OPprW Ugh! My #QueenRadio winners were so CUH-YUTE!!!!! https://t.co/E2KGTish68 RT @dylanr9797: We gotta make sure he meets all the standards of being with ROYALTY ❤️❤️👑👑👑👑👑👑 @NICKIMINAJ https://t.co/Zu3ACUeQox Yes I’m an alien https://t.co/flk15PRogL RT @MzNene_Minaj: @NICKIMINAJ who is it sis let’s start wit that first 🙄🙄 https://t.co/S8wnyb6y3v RT @Marie_minaj: He has to go through a bunch of  tests before we decide if he is worthy of you or not... (no one will ever be btw) https:/… 😂 https://t.co/SSXE8U608q Plus the Kingdom hasn’t approved your entering in just yet. And they’re very overprotective. I gotta lay things on them gently. The same kind of boys always like me. The ones that easily get their feelings hurt. Ugh! Then they try to get my attention by doing smthn dumb but I’m too busy to notice 😩 awwww. I like you baby, just not more than my work right now. ♥️🙏🏽♥️🙏🏽 https://t.co/jQoB9z18MD They put on see thru pasties on me while heading to stage. I just KNEW they were my normal (non see through ones) chile... ummmm they were not! 😩 https://t.co/8m4Cxiqtzp RT @LosoMinaj: Love this part. https://t.co/uSWXtJmeNH https://t.co/OkILt5c50r RT @Nitascornerr: OKAY @NICKIMINAJ, Now I can’t wait for tour omg 😭😭🔥🔥🔥🔥🔥 https://t.co/hgpkS9RmrN Awwwwww 🙏🏽🙏🏽🙏🏽 https://t.co/tX6s7hUQa3 😩 https://t.co/1OaGLY0chp ♥️ https://t.co/kKvRq3iODU @iamladyluck 😜 https://t.co/GZao3Gpucc 😜 https://t.co/ztpg8au6hQ All 3 of them are my babies. I love &amp; appreciate them so much. https://t.co/s1MQqTtqd3 I feel G R E A T 😩 awwww thx y’all ♥️‼️ https://t.co/kjnDTR0AFE ♥️🙏🏽🙏🏽‼️♥️ https://t.co/fybWjVPJDI How you want my nails tonight?\n\nRT for Fendi \nFave for Pink https://t.co/w7o8P46slE Who on Barbie D? Who on Barbie D? RT @RepublicRecords: Big #Queen Energy\n@NICKIMINAJ\n👑\n\nStream / DL:\nhttps://t.co/vCEFIBATny https://t.co/DkQh0fU7OE Throwback from the ReUp #HellYeah - goin on the #MadeInAmerica stage tonight. Who’s ready???!? https://t.co/BP9y7XQi1Y Fkng icon! https://t.co/699UkuQuDX https://t.co/xg4eyiPals ☺️🙈😜🙏🏽 https://t.co/LlpAZBtvcM I usually don’t listen back to the shows but I finally did. Now I know the one thing that’s gonna make it even better than it already is! (Not gonna tell you tho 😜). Tag your favorite #GoodFormChallenge I’m tryna see smthn #GoodForm twerking challenge has been heating up 😜 https://t.co/Pk0jTkbpRG https://t.co/iGsGCrITN1 https://t.co/Pk0jTkbpRG #QueenRadio EP 6 went down last night!!! 😩 not “amen sister” 😂 love her 🙈 check us out on the WORLD PREMIERE on Sept 4th y’all! @TheEllenShow https://t.co/hJvwlDn3gv #BarbieDreams https://t.co/pILVakVxq7 #Goodbye https://t.co/pIDZKw1pKX That’s how you know Ari is an A1 actress as well. I would have never guessed it was an intimidating 2 mins for her. Lmao. ♥️♥️♥️‼️ https://t.co/79Rlb7sWBn I kept this secret from you guys for so long &amp; it was killing me. I kept saying we were going to have our own “platform”. You guys, this is the best thing I’ve ever gotten to be a part of. Knowing we can connect on this level w/no third party just makes me so happy. #QueenRadio 🙏🏽🙏🏽🙏🏽 love you guys for listening. https://t.co/EQV6UPQFce It doesn’t come on right away that’s why ya gotta listen live babe. 😩 but class comes first‼️‼️‼️♥️ https://t.co/WVcet7W2jm RT @SamiraBasleyy: This playlist is a whole ass mood! Nicki’s taste is jumping out. And staying out. #QueenRadio RT @BossyBeautyxoxo: @NICKIMINAJ Thank you for blessing my ears with Queen radio. I wish it comes on everyday. Tonight's episode was fuckta… RT @kyndall_kashme: Tonight episode was my fave and last weeks episode is my second fave so far RT @Standforqueens: @NICKIMINAJ I really enjoy your show #QueenRadio RT @HoneyGuwop: When she retires she needs to continue doin radio. Cuz this is a HIT. #QueenRadio RT @Boothie___: The best song. https://t.co/u9DDg8zt3R RT @NMBarbieChain: @NICKIMINAJ YASSS GIVE MIAMI SOME PLAY #QueenRadio https://t.co/cxjQJxSBFj RT @ILoveHoodNIcki: Nicki’s “Rich Friday” verse will forever be a Classic 💯🔥❤️ @NICKIMINAJ #QueenRadio RT @TonieMaraj: Uuhhht OKAAY WIT DA MIAMI 😳😳🔥🔥🔥🔥 THIS MY OTHER THEME SONNNGG 🤪🤪 #QueenRadio RT @alvizzle_: Uh oh?! Is that Miami I hear?! 🔥 #QueenRadio RT @P1NK_ON_P1NK: #AllFacts #QueenRadio https://t.co/4jcyzrh7eA RT @ArianaGrande: me in a tweet https://t.co/CQZuB5Kncm RT @NickiTMRockstar: All these classics @TRINArockstarr #QueenRadio https://t.co/Yo1pzo9oGc I’m playing all my fave songs by my faves &amp; I’m so happy. Hope y’all know I choose all these songs when I’m up here. Playing Trina &amp; Kelly now. “here we go”. Then “nan nigga” then NELLY &amp; KELLY 😜 #QueenRadio RT @ZolanskiAnthony: Wow SINGLE AGAIN 😍 Play Baddest Bitch @NICKIMINAJ #QueenRadio 😩😂😂😂 ok I’ll bring you on Sunday babe. 😘😜♥️‼️ https://t.co/fmu7riGrS3 Love her😂 https://t.co/8K6OCyKFg4 RT @OnikaHusband_: BITCH THIS IS THE JAAMMMMMM @TRINArockstarr 😭😍😭🔥 #QueenRadio RT @malibubarbiej: love Trina and Nicki’s relationship! ♥️ #QueenRadio Awwwwwww🙈😍😘 I love you https://t.co/79Rlb7sWBn RT @RemyMajor: My sis is sleeping HEAVY on LLC I will NOT accept this disrespect sis! @NICKIMINAJ #QueenRadio https://t.co/5hjghigw1m RT @ItsMarthaBitch: Def thought Foxy B was hopping her ass on the phone. 😩😂 #QueenRadio https://t.co/PEf450RE6v RT @touchminaj: this is my favorite episode so far. every emotion! loved laughing w the Queen💕 @NICKIMINAJ thank you for #QueenRadio RT @celebslovenicki: @NICKIMINAJ Tyga is speaking fucking facts!!! 💯 RT @Queen_Nicki_1: Nicki is giving me life tonight #QueenRadio RT @Sev7enTaylor: NICKI GIVING BACK IN THE DAY WENDY WITH THESE QUESTIONS LMAO \n#QUEENRADIO https://t.co/cBYH1R0Beb RT @PinkCrownz: Oop #QueenRadio RT @IWANNNAMINAJ: @NICKIMINAJ why you asking everyone about they sex lives? You good? 😂😂😂 #QueenRadio RT @pattyplainjane_: It’s all love. I like that. #QueenRadio RT @ColumbianKen: @NICKIMINAJ is you banging a lot of hoes right now? #QueenRadio RT @pinkqueentingz: Tyga said #QueenRadio is the #1 lit radio show in the WORLD‼️ RT @dakiddmaraj: Target in Herald Square tried it putting #Queen at the bottom shelf... had to make sure sis had a better view😊 https://t.c… RT @Moonlight_Nerds: Omg Tyga run #QueenRadio https://t.co/gZsA4sbCcT RT @Beats1: .@NICKIMINAJ says she's holding onto tracks with @QuavoStuntin and @1future that she's definitely going to release. #QueenRadio… RT @aliminajxx: I lovee Nicki’s voice on Goodbye. What’s wrong with me? I’ve always been in love with Nicki’s voice but by now girl, it’s a… Check ur dm. Sent the number to call in https://t.co/wJPbOMUHLe RT @MzNene_Minaj: #QueenRadio babe can I go to London wit u please 🙏🏾🙏🏾🙏🏾😭😭😭 @NICKIMINAJ https://t.co/xiwlwXyPl7 RT @__teamalex: TO FREEDOM has to be one of the funniest thing she said #QueenRadio RT @MadeforTyler: #QueenRadio We going to London. RT @Beats1: Here we go!\n@NICKIMINAJ is in.\nIt's #QueenRadio!\n\nListen now: https://t.co/mZlUcV47U4        \nAnytime: https://t.co/nXJLMVkpTZ… This is so dope! Real men giving props. Thank you guys so much!!! @jasonderulo @BigBoy \n\nShould I call Jason today on #QueenRadio you guys???!!!!!! \n\nObsessed with the new song we just did. Called “Goodbye”. Check it out!\n\n5 mins!!! https://t.co/XhBXbWBNYV Btw, this is @DJBOOF’s real twitter. Y’all tagging the wrong person. #QueenRadio RT @Beats1: 🚨 UPDATE 🚨\nHear @NICKIMINAJ's #QueenRadio:\n5PM LA / 8PM NYC / 1AM LDN.\n\nListen now: https://t.co/mZlUcVlJiE       \nAnytime: htt… Who’s tuned into #QueenRadio ?!??!! I’ll be up there in 20 mins. Boof holding me down. I’m faving tweets now so I have my winners when I get on the air. Keep the hashtag in every tweet for the next 3 hours. You may get to hang backstage w|me this SUNDAY @ #MadeInAmericaFestival You know my heart couldn’t take it. The poll is leaning towards the later start time, so that’s what we’ll do for today. Next week, we’ll know in advance &amp; the time won’t be too early OR too late. ♥️♥️♥️ #\n\nQueenRadio today @ 5PM PST/8PM EST ♥️♥️♥️ https://t.co/vD14KjL2gJ *** Some of my fans have asked me to make the show later. Take the poll for tmrw’s show time‼️‼️‼️ I’m also taking notes for future shows, but this WON’T be locked in for next week if it DOES change. #QueenRadio Nessa, Quavocito lying. He texted me &amp; said “this means war” 🤣😂😩😂 I’m glad he thought #Queen was fye 🙈👑☺️ that was nice of him to say. https://t.co/Uzvj0hGLht #QueenRadio tmrw @ 12PST/9AMEST @AppleMusic @Beats1 🦄 win a chance to meet me this Sunday in Philly @ the #MadeInAmerica festival by using the hashtag #QueenRadio in every tweet, for every question &amp; comment beginning 9am EST. 🎉👑 Btchs don’t know if they wanna hate you or be you. Lemme change that. Btchs hate you cuz know they’ll never be you. RT @defjam: PLATINUM | BIG BANK 💿\n\n@YG x @2chainz x @BigSean x @nickiminaj https://t.co/ARL8cjD7zM Wow. I’m so grateful. I love her. https://t.co/w6DAnC7GzL RT @iHave3Testiclez: @NICKIMINAJ we already got our tickets https://t.co/CyyBfUJuFS RT @MIAFestival: Set times are out &amp; 1-Day Tickets for #MadeInAmerica are on sale NOW at https://t.co/rER2oSDxCj! See @kendricklamar, @NICK… 🙄 https://t.co/eXOO3pd57A What y’all want me to perform on @TheEllenShow ? That might not be me https://t.co/a0lAFpnWM9 RT @RohatMinaj2: Goof Form &gt; Good Form 🤣 https://t.co/4WdkSnUpJW 😭😭🤣😭😭 https://t.co/B91IsBOt7x RT @kubodsgn: @NICKIMINAJ GOOF HAHAHAH https://t.co/mxqITBG3xh RT @thecruzanbarb: Lmao let Nicki live y’all knew what she mean😂 😂😭😂😂 https://t.co/BKkqm2mHe7 RT @Youseethemstats: Goo What ? Oh miss Minaj you betta not disrespect miss Good Form like that https://t.co/qAQHe7fDDY Phuck awf y’all. I’m using one hand. Pauz https://t.co/ZJ5QKJsahB Getting my nails done @ this shoot &amp; the nail tech looks up &amp; says his fave song on #Queen is #GoofForm 😩. Y’all must’ve sent him. 🙄😂 KNOCK IT AWF YALL!!! K https://t.co/UeRro2mW59 RT @lee_cook: @NICKIMINAJ U ain’t lying. 👑 https://t.co/H3vUB027fa RT @picminaj: She really changed the game this day. 7TH MARCH 🔥 we love a trendsetter  👸🏾 https://t.co/cijh1LhUrm RT @barbiechains: @NICKIMINAJ U ATE THIS UP SISS 😍😍 https://t.co/XeT4YCVg3p Ok but vmas blue dress is when she was born, barbz. She grew &amp; grew. That’s been my real hair this whole time &amp; y’all didn’t even peep. 😩 middle part, Jet Black, inches action. https://t.co/sLggOmdLGF Ok you betta come thru w/the #HardWhite lyrics girlies. 😩😅♥️ https://t.co/nQuGMFmrL9 RT @marvminaj: @NICKIMINAJ They sure did!!! #Queen is a trendsetter!! https://t.co/iWOho4w3rv 🎉 https://t.co/APKYh8t5lL Inches really changed the game huh? 😂😂😂 https://t.co/5J6JbYlyIJ @beatsbydre @serenawilliams @Nas https://t.co/d13OnopUa3 RT @jasonderulo: We movin up family! no.6 on the US pop chart and no.5 on the worldwide iTunes chart https://t.co/4GCAHItckF 🎉 https://t.co/WHPSTA7iqp Has anyone ever caught you mid-fall? Lmao. Yes y’all do boo! https://t.co/NX9A0wHR6s Yall been askin me to hit Tae up 4 a long time. I guess y’all were on to something or whatever. 😩😂😍 Actually, when we shot #RakeItUp, I sat w/tokyo,sheika,grizz, in my kitchen in Miami &amp; went over the exact rainbow wig/colors I wanted to do. Finally got around to it &amp; love it My pleasure. 🙏🏽♥️🎀 https://t.co/8UhNNnB2Xa Wait, was that up for debate? 😩😍😍❗️❗️❗️♥️♥️♥️ https://t.co/8u6eR2T58B My boo Cassie tho 😩😍 https://t.co/k0CQZNevyC 🎀 #BarbieDreams 🎀 https://t.co/MKROtn1Hjh Hey boo https://t.co/m05rsvCdCM https://t.co/mIgdK1n5Cc Awwww I love you https://t.co/1c1m2MJiGI When the dj played Barbie Dreams for the third time I nearly hopped on them turn tables. Like sir!!!! Go to the next song!!!!!🙄😂 NEXT SONG. IM MELTING!!!!!! 🤦🏽‍♀️ RT @lanadeljey_: He crying because you smothered him with that fur coat in that hot ass room smh @NICKIMINAJ https://t.co/aq7Ll4JeQo 😂 https://t.co/4KhhW2xCqE Sweat* be quiet https://t.co/pX8gYyYtid Right! I never fkng swear😂 5 seconds in a btch was drenched. Look like I’m going for a swim https://t.co/0r2Dxom36Y 😭😭😭 https://t.co/TKroXUjf93 S/o to everyone in New Orleans right now. Don’t think I’ve ever been that hot in my life &amp; I was born on a fkng island. 😐😩 I def would’ve died in that crowd. Wayne was looking at me like “pls don’t make me get up off this floor, I’m bout to die” 😂 #Idol https://t.co/P4ykhdEusR https://t.co/C5KyOV9whg #Idol @BTS_twt Uh!!! What’s Good KOREA?! https://t.co/nGJ0IaRCgl RT @Crazy4Minaj: @NICKIMINAJ Papi Chulo... Cuanto amas este culo??? 🍑\n\nHands down killdt it!!!!! \n\n  #GoodBye https://t.co/cKd1FsdBbX RT @demeulemeister: YSL Niki boot just to drive in. The way my FOOT ball, just give me the Heisman. https://t.co/2jMZ84EE21 RT @NM4updates2: #Goodbye feat. Nicki Minaj is OUT NOW! https://t.co/OkBcgh3QuI https://t.co/9tNalFolC8 #RunAndHide #Queen https://t.co/gN6MAsb2A6 Midnight https://t.co/Y3QlPpQbvB RT @MiNAJ_my_STAR: I could literally listen to #QueenRadio all day. 🤞🏽🤞🏽 https://t.co/eN7T57ERAX RT @iFeelFreedxm: YALL MY HEADPHONES CAME OUT AND NICKIS MOAN JUST ECHOED THRU THE OFFICE AT WORK 💀💀💀 @NICKIMINAJ #QueenRadio RT @celebslovenicki: I got my priority pass babe @NICKIMINAJ 💕❤️😍☺️ https://t.co/CDtjW18aUr RT @MINAJJES: Run and Hide just came on... #QueenRadio https://t.co/aS5ivXsgTa RT @Nicki_is_Queen1: Thought I Knew You is a BOP #QueenRadio RT @OnikaxBarbie: #QueenRADIO  I thought I knew you !!!! https://t.co/yYUk0RJqVT RT @Burn1Central: #QueenRadio https://t.co/UewHb4KOKs RT @Moonlight_Nerds: I love this song #QueenRadio https://t.co/aBQTRlo2kv RT @LouisusChrist: Favourite song on the whole album #CSAM #QueenRadio https://t.co/xcjzgl1zJX RT @aliminajxx: “Hate that I could never be the one you needed” btch I don’t want to cry https://t.co/1qTuW0Oj4l RT @NMBarbieChain: This song makes me want a man. #QueenRadio https://t.co/voWnXDF8vq RT @AlisaaMaraj_: After Sex Nicki Be Like ...”back tf up” #QueenRadio https://t.co/4QDnzuLfc7 RT @JACKZOLANSKI: I love this song so much #CSAM #QueenRadio https://t.co/Hmiv0aU378 RT @IWANNNAMINAJ: COME, COME SEE ABOUT ME @NICKIMINAJ #QueenRadio https://t.co/Ni91X2ZpIp RT @khatanyaaax: Nah she’s absolutely right. TPP fragrance is seducing as fuuuuuuck. Smells so damn good. #QueenRadio RT @Jawad_Minaj: “Ebro come in lemme slap you on your neck” SJSKSJSKSJSKSSJKS #QueenRadio RT @JorianLLC: such a genuine phone call 💕 #QueenRadio RT @_vivxo_: I actually really did &amp; it was a bomb prayer 😩💋⚡️ #QueenRadio https://t.co/ZF8pPgQqRM RT @suprizeglacee: Episode #5 and still TRENDING #1 ??? YAS QUEEN @NICKIMINAJ #queenRadio https://t.co/5FWts5CTb6 RT @MzNene_Minaj: LLC #QueenRadio is definitely lit today!!🔥😍😍😍🔥🔥🔥 https://t.co/Tw5r5k1gCO RT @DaChinChecker: this melts my heart like if I go hard enough I might just be lucky to have her chilling around me @NICKIMINAJ #QueenRadi… RT @devin_walston: I GOT MY PASS SIS @NICKIMINAJ #QueenRadio 👑😊🔥🙌🏽 https://t.co/AzTdwimSzb https://t.co/LMeSJIkovp https://t.co/fSO5wQ76xV get the ALL ACCESS QUEENS QUARTERS PASS NOW FOR THE US QUEEN TOUR!!!!!!! I’ll announce dates &amp; cities soon. But this pass is good for any date/city Elevator broke. Bout to walk up 11 flights of stairs. 😩 pray for me y’all. #QueenRadio Use #QueenRadio in every tweet. I’m choosing 10 lucky winners today. https://t.co/PcnDgH6EoU listen live here https://t.co/Pk0jTkbpRG ‼️‼️‼️ UPDATE ‼️‼️‼️ 2PM EST #QueenRadio 2PM EST ‼️‼️‼️‼️ @AppleMusic @Beats1 https://t.co/IETYfCHdGR RT @YoungMoneySite: #QUEEN IS OUT 👑👑\n\nListen here: https://t.co/21BB2vo4mG https://t.co/3wxfqyospt ♥️😘🙏🏽 https://t.co/Bh3vTQWYys RT @CHIMMYGLOSS: ʸᴼᵁ ᵀᴴᴵᴺᴷ ᴴᴬᴿᴿᴵᴱᵀᵀ ᵀᵁᴮᴹᴬᴺ ᵂᴬˢ ᵂᴬᴸᴷᴵᴺ ᴬᴿᴼᵁᴺᴰ ᵂᴵᵀᴴ ᴬ ᶠᵁᶜᴷᴵᴺ ᴺᴵᶜᴱ ˢᴴᴵᴺʸ ᶠᵁᶜᴷᴵᴺ ᴰᴿᴱˢˢ ᴼᴺ ᵂᴵᵀᴴ ᴬ ᶠᵁᶜᴷᴵᴺ ᶜᴿᴼᵂᴺ ᴼᴺ ᴴᴱᴿ ᴴᴱᴬᴰ ᵂᴴᴱᴺ… RT @caliboycomplex: Whoever gave Nicki a radio show deserves a promotion 😂 https://t.co/WUKpUvIwrb #QueenRadio EP 4 is up now!!!!! https://t.co/pfkdcOpf8I I prayed to God for peace &amp; love, I’m lookin @ you as a blessing. You told me life been lookin up so take that past shit as a lesson. #RunAndHide It’s FUCKIN TR3Y WAY!!!!!!! https://t.co/2LherBtSGb RT @6ix9ine: Elton John‼️ Thank you for your support ❤️‼️ @eltonofficial @Beats1 https://t.co/nzSewfI0G1 RT @CandiQueen: Smh, she was really hoping for a negative comment. Sad https://t.co/HuGMPtu2jz The Queen has arisen. What’s good? Oh absolutely babe. Indoor ARENAS https://t.co/YFFA7UWQ9p I will not forget! I promise! https://t.co/nE5NP2Gx2R @RemyMajor Yep! On it! Yes, I’m sure I’ll do a few ♥️ https://t.co/CYSB2wSphY 😩 I feel the same way! ♥️‼️ https://t.co/YvtRAEffId Thank you guys. I can’t wait for you to see what I have in store! Next level! I’m so proud of what we’re working on &amp; cant wait to give you the show you deserve! It simply can’t be up &amp; running in a month. I also have TV spots, videos shoots, + Made In America Festival coming up. https://t.co/LAYcUmHtgM Yes, ok. I will do that for the US. ♥️ https://t.co/LRZyX8jnnm I promise it will be! Love you guys. Thank you 🙏🏽 https://t.co/j4pBy7r3J7 ABSOLUTELY w/special guests!!! https://t.co/ac1FV8lfsX My darlings: 🙏🏽 https://t.co/nBmsE2p9SI RT @LadyLeshurr: OMG this gotta be the best show @Beats1 has to offer what a Savage 😭😭😭😭😭😭😭😭😭 #QueenRadio 👸🏾 ♥️🙏🏽 https://t.co/W2S0D92585 RT @BakRub4aQueen: 😩😩😩😩😂😂 https://t.co/BmeUVEUzdo RT @oldmanebro: BTW Nicki Minaj is funny as fuck!! 🤣🤣🤣 RT @theprivatebarb: .@NICKIMINAJ’s VMA performance is currently #1 in trending on @YouTube! Queen Tingz #QueenRadio https://t.co/0N7MMlQsF4 Next show https://t.co/n3BqbfIjFc Next show https://t.co/v3ajyrFEAl RT @thats0hboy: @NICKIMINAJ  THIS was the best episode of #QueenRadio 🔥🔥 Raw and popping shit RT @badgalnika: I will never stop loving Nicki. Period. #QueenRadio ♥️♥️♥️♥️♥️ https://t.co/v0oueD9ICf ♥️♥️♥️♥️♥️ https://t.co/4vcqBPe6Ct RT @Yepits_kayyy: Still didn't find out who CSAM is about! #QueenRadio https://t.co/wSO5dn5RoY RT @LukeTMUK: I’m at work listening to #QueenRadio, haven’t missed any of your radio shows and have been at work for all of them🤣🤣🤣 @NICKIM… RT @MoreVal70: How my son @rynchrsx got me listening @NICKIMINAJ’s #QUEENRadio!! Nicki got me at work wanna to start punching people LMAO RT @CraigSJ: There's this expectation for Nicki to act like a squeaky clean pop star, and she's giving them loud, rude rapper this year, an… RT @Beats1: SAME.\n#QueenRadio is everything.\n@NICKIMINAJ\nLive: https://t.co/mZlUcV47U4 https://t.co/UKE8ihc8aq RT @royaleminaj: @NICKIMINAJ #QueenRadio feels like a little gossip sesh with my bestie I live for this, always something to look forward t… RT @HipHopDance_09: #QUEENRadio FKN SLAPS!!! @NICKIMINAJ so so so proud of you! Ur truly everything to me 🦄 RT @Y0NNAS: #1 U.S TREND. WHAT’S GOOD!!!!!! #QueenRadio RT @EbonyIrons91: @NICKIMINAJ IS THE FUCKING TRUTH #QueenRadio https://t.co/jVbsEL2nmI RT @MyleezaKardash: I love being entertained and Nicki Minaj is doing just that. She is very animated, over the top, literal, sarcastic, JU… RT @NMBarbieChain: I AM LIVINGGG #QueenRadio @NICKIMINAJ https://t.co/L9SfwPx9OI RT @Innomatijane: Every time black women speak up, they’re told they’re having a break down. @NICKIMINAJ \n#QueenRadio RT @AshleyySpinelli: women get strategically black balled out of their positions ! #QUEENRADIO ! #CARS #luxuryvehicles ! @NICKIMINAJ RT @TaylorxReneeee: #QueenRadio https://t.co/QMvL4NCwjz RT @JordanxZolanski: SNAPPED. #QueenRadio RT @onikaslaysme: i fking love her . DONT BITE THAT TONGUE I LOVE YOU SO FKING MUCH #QueenRadio @NICKIMINAJ RT @_queenlataoife: #QueenRadio https://t.co/Kbb9b24btY RT @Calling4daQueen: #QueenRadio @NICKIMINAJ @Beats1 \nNicki Minaj you are the funniest, most beautiful soul in the whole world. \nI love you… RT @attitudebyonika: Damn they dont understand Barbies sarcasm 💀 yikes #QueenRadio RT @SirRoman_: lol this is highly addicting and OUTRAGEOUS #QUEENRadio RT @iStan4_ONIKA: OMGGGG IM GETTING ALL MY LIIIIFFEEE😩😩😩😂😂😂 #QueenRadio https://t.co/Vz4Il5QjcK #QueenRadio begins in 30 mins @AppleMusic use the hashtag and I may respond to your comment or question. May be giving away more stuff too 😛 RT @vmas: 💕 @NICKIMINAJ CAME THROUGH WITH THE PERFORMANCE WE ALL NEEDED. \n\nWE STAN A REAL-LIFE QUEEN. #VMAs 👑 https://t.co/n5M2iJNVXS When y’all off dat henny &amp; @MYXFusions https://t.co/cjXvSHVatS If Queen Halle approves then 🤷🏽‍♀️ https://t.co/EZgvWhWWna RT @MTV: Reliving @NICKIMINAJ's #VMA performance for the rest of foreverrrrr 🔥 https://t.co/1eNufUDAMZ RT @iHeartRadio: Things @NICKIMINAJ just did: THAT!!! #VMAs 💥 https://t.co/OggcZdADOc 🙏🏽🙏🏽🙏🏽 https://t.co/iWGoSsJlMV I forgot to thank the legendary #StevenKlein omgggggggggg Honestly, I think this shit excites you https://t.co/C7bIEmS4ik RT @landonromano: Nicki Minaj is the best female rapper of all time and we KNOW this. There is nothing more to say. Bore somebody else with… ☺️ https://t.co/A3YAB2NdaE 😂😂‼️‼️😂😭😭😭😭😭 https://t.co/YbTzL06H8F Y’all I had no idea Harriet Tubman was now trending. I said what I said. 😂😂😂😂😂 #QueenRadio will honor her tmrw. She said she could’ve rescued more slaves had they known they were slaves. I fought for streaming services to count toward billboard when alotta niggz stayed quiet 😂😂😂☺️ https://t.co/AwlcpnndzE RT @HotBoyTurk32: @NICKIMINAJ You DONT Have Shit To Proof You Already A Legend i- https://t.co/eXAq15wa2k RT @chancetherapper: I cant imagine what it’d be like to literally not be able to show yo frustrations with actual inequities and subjugati… RT @Beats1: 🦄\n@NICKIMINAJ\nNew #QueenRadio\n\nTuesday:\n9AM LA\n12PM NYC\n5PM LDN\n\nListen live: https://t.co/mZlUcVlJiE      \nAnytime: https://t.… 🤔 https://t.co/5MwoUWIC3m RT @VogueArabia: Your sneak preview of Nicki Minaj's Vogue Arabia cover shoot:\nhttps://t.co/wXvHknNngZ RT @alexlovesminaj: Queen physical in UK HMV 👑👑👑 https://t.co/QphaQqIaT2 All the QUEENS I remember, SHOOK SHIT UP!!!!!!!! Queen of the week may go to HARRIET TUBMAN!!!!!! Had she just sat there &amp; ate her rice, you niggaz history would’ve been a lot less triumphant. 🦄 RT @REALTOKYOJETZ: I don’t think Nicki Minaj understands she’s NICKI MINAJ. No one can ever change that. 😂🤣😂🤣 https://t.co/dIxBANI5pd We are starting at noon SHARP!!!!!! Promise!!!!! https://t.co/YU8usgESbq Tomorrow @ noon EST #QueenRadio @AppleMusic https://t.co/2Gi45YOodt Announcing shortly baby. 😍 https://t.co/LCmh5blTEI Yoooooo. Niggaz rlly said I’m calling Eve a zombie 🤣 what female rap album gets broken down like this? 👑Tingz. I wrote Hard White a year &amp; a half ago. But go awffff. I really have to laugh. Y’all don’t find all this shit funny? I love the rap culture man. I’m the female JAY https://t.co/glBpwY7o2S RT @iHeartRadio: 👑 @NICKIMINAJ is an ancient queen in her #GanjaBurn music video: https://t.co/AHBDXdklyP https://t.co/S8SdhgW8KV Someone sent me this. https://t.co/j6uwS7Jdda S/o to the UK!!!! See you guys soon! https://t.co/KzB0NXXG9t 😂😂😂😂😂😭😭😭😭😭😭 https://t.co/PZ3eap1jiR But I did write a new freestyle n I’ll record it later. I felt it was time. #Queen https://t.co/TEoKWGtYxh People are calling me thinking I’m huffing &amp; puffing. Omg y’all this is sarcasm/dry humor. Yikes. I’m having the most iconNIC time. Come let me kiss you. 😩😘😘😘 Who’s coming to the secret show? When people call me &amp; hear me crackin up laughing they seem so puzzled. Loosen up 😅 Do you know how many women get systematically blackballed out of their positions in an office building &amp; can’t fight back????? Do you know how many people subscribe to my Spotify page????? RT @aliminajxx: It honestly is so fkn overwhelming and sad to see how Nicki is being treated. My label didn’t want to defend me for fear of Spotify trying to teach Ariana a “lesson” too! https://t.co/1dAdbcbWVd RT @denishiaaaa: this wild 😢 https://t.co/E0rCEt5zEC RT @NickiThaKid: You’re the only female rapper with albums that have gone #1 and #2 for each album release. You are making history with Que… RT @jxmmineutron: @NICKIMINAJ We support you #Queen! I’ll be locked in on  Tuesday, can’t wait! RT @RichieMinaj_: I’m so disgusted. Your music puts money in their pockets and they treat you like that? Wow. The industry is fucked up. ht… RT @DYLAANMINAJ: @NICKIMINAJ This is beyond unfair Onika. I can’t wait to hear the full story on Tuesday. I’m disgusted😞 RT @onikaxslays: I’m so glad Nicki is speaking up about this. Nobody deserves to suffer in silence, no matter how BIG they are. Everyone ha… My music went up on Apple so I played it. I assumed it was on Spotify &amp; Tidal at the same time. Spotify said that Apple tweeted fans advising #Queen was up &amp; therefore they had to teach me a lesson. But PRAISE BE TO GOD!!!!!! Spotify had to teach me a lesson but rewarded the man who has had an Apple radio show the longest; inadvertently helping the Apple platform the most. Oh I can’t wait for #QueenRadio on Tuesday. They took away my promotion they had promised for the 1st cpl days b/c of this. #Queen Spotify put drake’s face on every playlist but told me they’d have to teach me a lesson for playing my music 10 mins early on #QueenRadio. Even tho they’ve been giving away my music for free for years &amp; I am one of the top Spotify artists of all time. RT @jadaagorgeous_: Don’t bite your tongue AT ALL sis! @NICKIMINAJ RT @HoesloveGianni: This is the same Woman who Helped win a major fight for streaming that changed the music industry. Her speaking up abou… RT @KittyBarbz: @NICKIMINAJ The industry is always tryna do you dirty and I’m sick of it! I’m glad you are sticking up for yourself and say… 😊😜 https://t.co/M14B5nhovu RT @Fengali_art: I believe somebody needed to speak on the fucked up shit and behind the scenes shit that majority of people will never kno… #QueenRadio on TUESDAY I put my blood sweat &amp; tears in writing a dope album only for Travis Scott to have Kylie Jenner post a tour pass telling ppl to come see her &amp; Stormi. lol. Im actually laughing. #Queen broke the record of being number 1 in 86 countries. Thank Jesus &amp; thank you to my fans. RT @christinarosemc: @NICKIMINAJ Please DONT BITE IT nic!!!! “Power of life and death coming out my tongue”  SPEAK YOUR TRUTH!!! That’s the… I looked at the numbers the Carters, Kanye, Nas, etc recently did. Travis sold 200K in his first week of clothes alone. I spoke to him last night &amp; he said he’s been selling clothes b4 the music. Billboard says they’ll change the rules cuz of this, so it should be changed now! My first album sold 400K. No one is doing that with debut albums now. So I’m so grateful. I lost out on 12 hours of sales and did 200K in one week after I was supposedly cancelled. I bit my tongue last #QueenRadio but I won’t On Tuesday. I love you guys so much Travis sold over 50K of these. With no requirement of redeeming the album! With no dates for a tour, etc. I spoke to him. He knows he doesn’t have the #1 album this week. I love my fans for the #1 album in AMERICA! I’ll explain on #QueenRadio 4 albums in, #1 in 86 countries ♥️ https://t.co/CiYEuczgm3 RT @__zurah: This really Onika’s best album. I thought she was just on here tweeting when she said that months ago😭 I rlly love her yo, wow. She’s one of the best female rappers to ever do it &amp; she genuinely supports me. Plus she’s a SAG!!!!! Ugh! I rlly adore her. @iamladyluck @Target @AskTarget @RepublicRecords https://t.co/vVQqbRCHfG 😅 https://t.co/zO4a9sBPcW You’re getting this w/o a shadow of a doubt boo https://t.co/adzIon51u1 🤔 https://t.co/NyVWFYHUvM 😩 https://t.co/MmBZOSPDWc The #GoodForm gang in my insta comments chile. 😩 Omg 😩 https://t.co/DMRX3jl78Q Hmmmm lemme think &amp; get back to ya. XO https://t.co/gmySNYacpL 😜 thanks Nelly!!!!! ♥️‼️ https://t.co/gkaLgIObGl XO https://t.co/yB7WE45Bmt The next episode of #QueenRadio will be vital. Thank you https://t.co/yB7WE45Bmt RT @RicardoMaraj: \"Nicki Minaj surpasses herself on her fourth album, 4 stars!\"\n\nOur national newspaper's (The Netherlands) review on #Quee… #GanjaBurn VIDEO ON ALL PLATFORMS. #BarbieDreams = Greatest Gainer on rhythmic radio. ♥️‼️🙏🏽 https://t.co/SSsTfLhqk2 RT @devin_walston: @NICKIMINAJ Look what I found at target today 😊👑🔥💨 @NICKIMINAJ https://t.co/I2ZYGeosnf RT @DJWhooKid: 👑👑👑👑 #QUEEN album takeover with @NICKIMINAJ now on until 6pm 💥💥💥🔫 on @Shade45 🔥🔥 #WhoolywoodShuffle 👑👑👑 https://t.co/OLCWpOW… Thank you M.A.!!!!! QUEEN SHIT!!!!! We don’t ride the fake bandwagons‼️ https://t.co/x6DW1mg9e3 RT @TRINArockstarr: 👑 https://t.co/eUYzpGZXAH RT @lovatocharts: Weekly most streamed female artists on global Spotify:\n\n1. Nicki Minaj - 94.16 million plays\n2. Ariana Grande - 55.93 mil… Right. That’s how they’ve attempted to manipulated me. Stops now https://t.co/NSXZ9nZvNC RT @rumor37: Found four More at a different target 😜 #queen https://t.co/utuTHa5ns9 RT @RobertS3_: Sis I 110% support you. Nobody in your shoes would stand for that if it were them, so why tf should you? EXPOSE THEM. This n… This is what happens when you release a great body of work after they spent millions to ruin you. Lol. 4 albums later still breaking records. #1 in 86 countries after they said it was a wrap. Praise God. He’s about to expose them. They writing about 69 cuz #Queen is flawless. I’m supposed to keep letting these ppl get money to bully me behind the scenes &amp; not say anything. Yikes. @NameAintNicole Imagine being this scary to show what these ppl are doing. Yikes. When I was told they were being paid to write these things I didn’t believe it, now I know it’s true 😜😛 #Queen bitch!!!! 🎯😘🎀♥️‼️ I got the proof on that too. Loving my life. They so bothered by this lil south side Jamaica QUEEN Wym? https://t.co/hIRcqOtbws 🤣 https://t.co/DGYGqIeIs2 Omg y’all we did it again. I - the kingdom is rlly shittin on’em with their love. I- I just- https://t.co/ySxUNoapxi Yesssssss. I have to spill it for my babies!!!! They deserve!!!!!!!!! 😛😜 https://t.co/qIzTz4gAkq Bout to cum on myself. Official numbers coming on Sunday. 200 without 12 hours of sales is..... 🙏🏽♥️🙏🏽♥️🙏🏽🎯🎯🎯👑😛 gotta put y’all on to smthn we uncovered too. 😩😛😜. Physical copies of #Queen out now! Love you guys SOOOOOOOO FKNGGGGGG MUCH!!!!!!!! Praise GOD!!!!! Come see about me https://t.co/bhcOLC2PZy Happy #Sweetener day to @ArianaGrande - one of the greatest voices of this generation. Love 💕 Thx boo https://t.co/1IvfYVaUsU RT @ClassicOnika: Iconic. https://t.co/cfLsjcEvgc RT @xMelCole: Round one. 😝🤟🏽🤩💽\nIts not real until u got the copy in ur HAND !!!! #Queen 👑 https://t.co/61gfnEJl3u Ummmm ok @AskTarget @Target lets go baby. I’m rooting for you!!! https://t.co/NIISJxS1V6 Target stanning “good form” is iconNIC. 😂😩 I should drop by a target store within the next few days. https://t.co/Va0T6M57l0 Omgggggg cdhvkklnfsaddwszsjlmbd https://t.co/Va0T6M57l0 Yikes, WEEZY &amp; THE GAME were mentioned boo 😩 https://t.co/1O7t7JrRyx #BarbieDreams there are lines I removed from this song so that it wouldn’t be too long. Pauz. Chief Keef was one of them. Who else should I have said on this record? 😜 https://t.co/gzJkNdiBQF RT @itsMattyG916: Just got my copy of #Queen #TargetExclusive https://t.co/G3yQOxIzg3 RT @HoneyGuwop: A Target employee just pulled up all the Targets in Memphis/surrounding areas that currently have copies of #Queen for me.… When people apologize to me sincerely, I accept it. It’s really never too late to right your wrongs. Love. Omg. Thank you girls so much ♥️😘😘😘😘 https://t.co/GtxZ36Ut21 Yikes https://t.co/25lX8LN2p5 RT @davidzoIanski: This happened 4 years ago for The Pinkprint as well. They had to go to the back and get them 😕 https://t.co/VvtltHi6nZ RT @jayvald_: If you’re in NYC, Target on 34th Street Herald Square has it, and Target in Harlem on 117th street has it #Queen RT @marajlit: @NICKIMINAJ look nicki my merch has arrived i’m in love with it, thank you queen😘💗 @NICKIMINAJ https://t.co/Faoche95rI Wait 😩 well I’m happy they have it! Yaaayyyyy!!! The physical album is out you guys!!! https://t.co/7T9Y5zPfoO RT @TM_BaisleyBlvd: These targets are saying not being sold at these stores @NICKIMINAJ This is in New York https://t.co/Za8zMgy75A RT @Chameregotfans: @NICKIMINAJ 14065 Abercorn St\nSavannah, GA  31419 Oh no babe :( https://t.co/KL171r6pbf RT @_NickiIsMyQueen: QUEEN OF NY 🤷🏽‍♀️😍  https://t.co/sjILbAFlF7 RT @MannyManuelX: @NICKIMINAJ 601 Colonial Rd\nMemphis, TN  38117\nUnited States \n They didn’t have it \n#QUEEN @NICKIMINAJ  look Queen .. #Qu… Awww babe https://t.co/j8B0V0OMje Yikes https://t.co/RCErp3wcEZ Yikes https://t.co/iRXBrPGJr1 RT @Kayaaa_ox: @NICKIMINAJ my local target didn’t have it. https://t.co/dqeBcjVWkS You guys pls post the address of any target you went to that didn’t have the album. #Queen deluxe should be at every target in the country. https://t.co/TrNInZVdLB Come see about me https://t.co/ubNZlKTdff RT @TabyasJones: @NICKIMINAJ Tho I already had VIP i-...PERIOD. https://t.co/PTct53EhGh RT @TiairaMinaj: Can’t Wait to see you on tour Nic 😘💋🙌🏾♥️👑💪🏾 https://t.co/UKh3yVhdiG Hey Barbz, for 5 hours only get a $5 pin with the album that gets you ALL ACCESS! Early entry to NICKIHNDRXX TOUR AND EXCLUSIVE MERCH 🦄🦄🦄 https://t.co/8ULJ6SPune https://t.co/72TGO3ngcZ https://t.co/D6rPXw96Om Omg 🙈💕🙏🏽💕 https://t.co/EnPBF2LrA3 RT @chartsnm: iTunes Papua New Guinea:\n\n#1. “Queen” (NEW)\n\n*86 #1's around the world* \nhttps://t.co/LOwqnYSHZo RT @XXL: Nicki Minaj and designer Don C join forces for the release of a collaborative Just Don capsule collection paying homage to the lat… RT @Nickisdaughter0: Nicki’s radio stations is like the best thing that ever happened this year along with her album  !!!!! #QueenRadio @Be… Can I have one? Y’all never give me the good stuff. Yikes. I want a physical copy of #Queen. Wow https://t.co/Y4UbZjzZ1M RT @jakewain_: GOT MY QUEEN PHYSICAL COPY https://t.co/sqJmMQvPvz I’m still here with @oldmanebro bout to cuss him out. https://t.co/PcnDgH6EoU RT @24kTre: How Alicia Keys just bust out them vocals like that 😩👑 #queenradio Omg #AliciaKeys #QueenRadio https://t.co/Ss685eTFwV RT @Beats1: Here we go! 🦄\nTap in to episode 3 of @NICKIMINAJ's #QueenRadio.\n\nListen live: https://t.co/mZlUcV47U4  \nAnytime: https://t.co/n… #Queen bus in NYC!!!!! 😜 #QueenRadio is live now!!!! TUNE IN!!!! @AppleMusic https://t.co/teG6Rrrlio #QueenRadio playing your TOP 5 off #Queen!!! Retweet this with your FAVES!!!!! I’m on now !!!! Use the hashtag #Queen - I may choose you as one of my winners today. 🎀😜 https://t.co/k2qCflKVlG #QueenRadio on @AppleMusic starting in 30 mins. Pull up 😩♥️💕🙏🏽‼️ love you Selena, TY https://t.co/IOaARRS49i RT @VogueArabia: The #VogueArabia September issue is here with @Nickiminaj landing her first ever #Vogue cover. “I’m not here to play. I’m… RT @CockinessIV: I love how she’s so open, honest, &amp; unfiltered this era. This is vintage Nicki x10 🗣🔥 RT @JovahnteaMinaj: The looks, the questions, the answers, the lyric breakdowns.. THE CROWD!!! UNBELIEVABLE. @NICKIMINAJ #NickiXGenius Girl I’m rushing to set right now. Not sleeping tonight. TRL @ 8am &amp; #QueenRadio @ noon EST. Some more stuff in between that too. https://t.co/D8FWRJdkWk RT @CartierLLC: The interview revealed once more how in tune Nicki is with the industry and their attempts to get rid of her. I need this d… RT @_marmar03: EVERYONE needs to watch that Genius interview. Even the haters. ESPECIALLY the haters. This would bring sooo much clarity ab… RT @Jawad_Minaj: Nicki as soon as the Genius interview ended @NICKIMINAJ https://t.co/zxo934GSIX RT @MarcoRepublic: The break down of those lyrics tonight @NICKIMINAJ ugh your mind it was so @Genius RT @Barbzovo: Definitely my favorite interview so far in this era #NickiXGenius RT @kingCONQUER_: We Need A Part 2 of #NickixGenius there is much more lyrical lines in her catalogue that deserves some light @Genius grea… RT @LalaxMaraj: #NickixGenius if y’all heard the amount of times I said, “period” behind everything Nic was saying 😭😂. This was so dope. RT @HoesloveGianni: The interviews are so fucking dope this Era. Like WOW @NICKIMINAJ #NickixGenius 🤯🙌🏾 I’m about to pull up on @genius right now. It’ll be live streaming. 🎀 No matter how tired I am, whenever I see you guys, my energy goes to a billion. My whole team has been saying that. The people at Sprint &amp; Tidal were blown away by your energy today. I felt so proud of y’all. Love you guys. Thank you 🙏🏽 https://t.co/e7h1udycVv I’m exhausted 🤣 Tmrw morning‼️‼️‼️‼️ https://t.co/L0E6NEW4tJ No you guys. My schedule is just jam packed. I’ll be @Genius in one hour. ♥️♥️♥️♥️♥️ https://t.co/HrQEVJzNDj RT @TIDAL: .@NICKIMINAJ is giving all the Barbz who order one of her limited edition posters + digital download bundle of #Queen 3 months o… Go blast #HardWhite &amp; #BarbieDreams off that #Queen album now! Big mood 🔥 https://t.co/mwHFUhKwer https://t.co/zYlVxw4Vyc RT @DaRealKhefner: Nicki really the Queen of NY https://t.co/V3zlpoSFmk RT @Checkey4NY: The moment #fans have been waiting for #NickiMinaj #modtownmanhattan CAUTION: possible profanity #tidalxsprint https://t.co… RT @RepublicRecords: 🔥 GANJA BURN 🔥\n\nWhat's your fav part of @NICKIMINAJ's new vid?\nhttps://t.co/t644Vsqp5r https://t.co/5xfCiwuURO MEET ME NOW!!!!! https://t.co/alWHx0cSCc The Bryant Park @Sprint store at 57 West 42nd street killed it, so….see you in an hour! Pull up to meet me and get tickets to #NICKIHNDRXX tour instantly. This is happening TONIGHT!!!! Which songs would you guys like me to decode? https://t.co/9KsxwMNDvu 🙏🏽 https://t.co/OPYH7sMJOU LMFAOOOOOOOOOOOOOOOOOO 🙏🏽 https://t.co/IdnOVC9IGR #QueenPoster  @tidal @sprint https://t.co/zINMR1vv72 RT @TIDAL: NYC: Don't miss your chance to meet @NICKIMINAJ 👑!\nhttps://t.co/fvh64gWcki https://t.co/7KeQOpvO1C #HardWhite The #GanjaBurnVIDEO is now on ALL PLATFORMS!!!! Added new merch to https://t.co/8ULJ6SPune which comes with a physical copy of #Queen!!!! Might have another surprise too!!!! 😜 https://t.co/YtnymJboHi Tomorrow morning I’ll be back on #QueenRadio answering questions &amp; choosing more winners. Use the hashtag #Queen for all questions &amp; comments today. My lucky winners from last week will be @ tmrw’s show. You can be at the next one! 😜 My TOP 5 changes everyday. What’s yours? #Queen https://t.co/WqKuuqNQNN https://t.co/D6rPXw96Om RT @TIDAL: NYC, want to meet @NICKIMINAJ? Sign up for the @sprint Unlimited Plus plan today and instantly get tickets to the #NickiHndrxx T… RT @AppleMusic: Watch Nicki Minaj’s brand new music video for ‘Ganja Burn’ now on MUSIC. 👑 https://t.co/3JeyBE9QMt Surprise!!!!! Nicki x Just Don collab “Pick A K” available NOW on https://t.co/8ULJ6SPune until Friday at 12AM EST!!! @chicagodonc @justdon https://t.co/s85jaqlDfw SURPRISE!!!! I’m doing a private show in NYC on 8/19! You won’t want to miss this! Get your free tickets here!!!! \n\nhttps://t.co/bOWSB5Ol3i If you rock wit me &amp; this album, let’s switch our focus back to the positive stuff ONLY. I’m so proud of #Queen. People would kill to release such a critically acclaimed body of work. I’m in a great mood &amp; you should be in one too!!! To GOD be the GLORY! https://t.co/fSO5wQ76xV\n\n I'm signing album art Lithos, available now for a short period of time! Ok I will take notes from now til #QueenRadio. Nothing left to say on social media. https://t.co/opTVsGZWUw RT @Blu1x: Nothing scarier than a fed up woman.. we come full force with receipts!!!\n\n@NICKIMINAJ like “f it... y’all been hatin regardless… RT @KxnqMasiyah: I know nicki feel liberated as hell right now. I’m happy my sis not letting people get over anymore and that she’s standin… RT @TIDAL: \"Congratulations @NICKIMINAJ, this body of work is fearless, vulnerable and exhilarating. The title Queen is a representation of… RT @_MissBarbie_: 👏🏽 https://t.co/4C2p0toaiT RT @BossyBeautyxoxo: Glad sis got that off her chest. YAS ONIKA we live for your moment of truth. No one can take that away. RT @iamcamillap: I guess Nicki fed up! I feel her thought ain’t nothing like having to stay silent and listen to Bums spread lies  about you RT @NickiReignsCom: .@NICKIMINAJ’s BRAND NEW album “Queen” is out now! #QUEEN https://t.co/q73vEAcIVr Tyga shit ain’t fall back out!!!! Y’all went to the same doctor!!! Yours fell out cuz GOD DONT LIKE UGLY!!!!!! I should’ve never paid for that gyatDamn hairline!!!! It fell back out cuz God don’t like ugly!!!! You used me but God had other plans!!!!! https://t.co/9e14A2FBE8 RT @kayy_ant: @NICKIMINAJ Im so proud of you for sticking up for yourself. Its so beautiful seeing you defend yourself its entertaining asf… RT @Jenneh_xo: 😭😭😭 https://t.co/2k4WcBqpL6 Sherika &amp; I had a bet that soon as you knew meek was bout to come home your crawl back &amp; ya did! 🤣 came to my house CRYING. JOYCE WAS THERE! My whole glam was there! Left who?!?! You gettin aired out on #QueenRadio too on Thursday! Apologize &amp; STFU U stole my card &amp; told me you thought it was an account with “free money” that I didn’t know about. On God. God will strike you down &amp; more for lying. Ha! Stop saying u packed &amp; left ! On Jesus u came to my house CRYING BEGGING to go w|me to Europe to the EMA’s. I said NO DUMMY Whew Chile #QueenRadio gon be steamy on Thursday 😂 RT @mindykaling: #Queen serving lewk after lewk after lewk after lewk @NICKIMINAJ https://t.co/fdEpiOYm6w RT @tyronescott32: The full cut of Nicki Minaj and Stephen Colbert switching jobs tonight. I literally was on the floor laughing, I'm dead… RT @lilmeeks_: queen nicki colbert! RT @AndreaWBZ: .@colbertlateshow and @NICKIMINAJ are good TV together. Could have watched them for the full hour. Give them their own show!… 😂 https://t.co/0JkQt8vgGp RT @CandiQueen: Nicki beating on the table reminded me of the Grindin beat we all use to do in School Listen to my interview tmrw with @funkflex and turn into @colbertlateshow now y’all!!!! 😂😂😂😂😂😂 that’s only the beginning tho. Tune in for the rest! https://t.co/TDeo8kGX5h Thank you https://t.co/yuVUrKTMcH RT @Vevo: Bow down to the #Queen. 👑 👑 \n\nWatch @NICKIMINAJ bring life back to her kingdom in her new video for #GanjaBurn. https://t.co/FdVz… https://t.co/opTVsGZWUw RT @Rosenbergradio: this @NICKIMINAJ Queen album is really good ... a very complete body of work ... finally just got to sit with the whole… RT @Labrinth: https://t.co/PcIgKih6EU RT @SHAIANNE_FOSTER: #GanjaBurnVIDEO has to be her best video yet! She poured her heart out in this video it’s such a masterpiece 😍🔥🙌🏽👑 @NI… RT @MarcusButler: Nicki Minaj bringing the 🔥 on her new album RT @MikeAdamOnAir: .@NICKIMINAJ has become the female artist to land the MOST songs on the top 100 of Apple Music at the same time. All tra… RT @ElliottWilson: Tmw! #CRWN @NickiMinaj. Tues Aug 14. NYC! Livestream on #TIDAL https://t.co/2HHXbxLRHD RT @JGhosty: Nicki Minaj new album is such fiya. UHG. Be back in a week. Repeat. Repeat. Repeat My first #QUEEN TV interview comes on tonight &amp; it’s fkng hilarious. Watch on CBS tonight @ 11:35 PM EST on the #LateShow with #StephenColbert - check out the #GanjaBurnVIDEO NOW everywhere! https://t.co/Tq12DLWTxO I’ll be choppin it up w~ @DJCLUE tonight!!!!!! TUNE IN. #Queen NEW YORK!!!! What’s GOOD?!?!!! Listen to #Queen @spotify https://t.co/qAFpP2U6kc 💕♥️🦄 #Queen @Spotify https://t.co/Q5le16bE36 RT @TIDAL: #GanjaBurnVideo: https://t.co/MmDc2ugtla https://t.co/yjMqL8yc4L RT @SimouMinaj: She's so beautiful, the Concept of death and resurrection being associated with her legacy has me shook. Smart and Generous… #GanjaBurnVIDEO https://t.co/SamF08fyHM RT @Vevo: Bow down to the #Queen. 👑 👑 \n\nWatch @NICKIMINAJ bring life back to her kingdom in her new video for #GanjaBurn. https://t.co/FdVz… *chores https://t.co/1HZY5tNVHg Out of the TOP5 rappers who’ve single handedly influenced my flow &amp; approach in relation to my delivery, subject matter, overall rap style, etc; 3 of them are on #Queen. So grateful. The rest of the artists are all brilliant as well. I couldn’t be more thankful for this line up. Lemme keep it 1 hundred. \n2 things shouldn’t be your themes of discussion.\nThe Queen &amp; Her Husband\nLast thing you’re gonna wanna be is our subjects. \n\n-Eminem the GREAT on #Majesty\n\nNo one man should be this great. 🤦🏽‍♀️ \n\n@Eminem Tell her: jealousy is a disease, die slow. 🦄 The genius has spoken 🤷🏽‍♀️ https://t.co/0iAtauEcTZ He came #CSAM 😭 https://t.co/yeSWQGE2dE 😂 https://t.co/M7GVESjphE But did I say don’t @ me? Lyrics on a billy but beat gotta get a diff ride. Bloop! https://t.co/Ow2ssxcGo1 I said don’t @ me 😎 https://t.co/oGIgkcdAyt I waited til the last day to write #ChunSwae &amp; now I’m mad. Lol. I knew everyone would like it but now i must redo my verses &amp; ride that beat the way he deserves to be rode on. 🤷🏽‍♀️ periodT. 🙄 Barbz don’t @ me 🤨 My baby!!! @1future https://t.co/0Lcd979RKV Can you make this big? I’ll pay for it. I wanna put it in my house. https://t.co/1R53KX0Gpm ♥️🙏🏽 https://t.co/7sz1ZQdcBh ♥️🙏🏽 https://t.co/zV3IhtKqb1 🙏🏽♥️ https://t.co/CfjC9yaOi5 Speechless. Love him so much. Can’t believe he said this. Greatest rapper alive said this about me. 🙏🏽 https://t.co/aDhjCCIn4m https://t.co/UnGRGZuBCP RT @_EternallyMaraj: I actually said lets wait Nic but the BAAARRRRRBBBBZ had other plans *rolls eyes* https://t.co/P02yWup3OD RT @DritaDavanzo: Nobody is F...wit #CocoChanel joint nope..straight #OG sh..⁉️✏🔥🎤🎛 @NICKIMINAJ @FoxyBrown ❤ https://t.co/9VefZj7ZjN RT @AaliyahJay: Last night at #QueenRadio 😘 The album is FINALLYYYYYYYYY out! I’m shooook #Queen loveeee you ♥️ @NICKIMINAJ https://t.co/YS… RT @TamiRoman: Make sure you get in on this #Queen merch before it’s sold out! https://t.co/HDftLoI6UM Thanking @NICKIMINAJ for my personal… RT @iamAmyJackson: QUEEN @NICKIMINAJ 💯🔥 https://t.co/9jSRgH9sPB RT @FishburnLayton: Nicki Minaj’s album is the best rap album I’ve heard in years... talking creativity, talking lyricism, talking context,… RT @RADeMita: actually obsessed with Nicki’s album 🤯😻 @minajaveli Fefe said btch you thought 🙏🏽♥️🙏🏽 https://t.co/gnAonEvvSX Yesterday was Brett’s bday. I love him so much n feel bad that it was so much going on yesterday I forgot to post this. This was exactly at midnight when his bday came in. He was w|me @ #QueenRadio. Brett, thank you for being on my team. ♥️ https://t.co/fXi77A015E RT @lilmeeks_: this lady really said “puthy” 😂😂😂 🔥🔥🔥 https://t.co/2msqbrHGqx AYO just last week I told’em to pick a side!!!! He nuttin like SKIPPY NOW. he want me to be his wife, his MISSIS LIKE SIPPI NOW RT @RepublicRecords: Celebrate the release of #QUEEN w @NICKIMINAJ's new reversible @Snapchat lens experience by @svrf 👑\n\n+ find her exclus… RT @umusic: The QUEEN has arrived! @NICKIMINAJ just dropped her new album 👑 #Queen \n&gt;&gt; https://t.co/dJoWyixYls https://t.co/bgTNRA5zlU Just listened to #GanjaBurns after a long day &amp; realized that I hate how low I made the hook. Gotta get it swapped out. That’s like my fave song &amp; I can’t let it go out like that😩. Plus I was so sleep deprived I wrote burns instead of burn when they were stressing me 4 tracklist Just listened to #GangaBurns after a long day &amp; realized that I hate how low I made the hook. Gotta get it swapped out. That’s like my fave song &amp; I can’t let it go out like that😩. Plus I was so sleep deprived I wrote burns instead of burn when they were stressing me 4 tracklist RT @BExNickix: Could not agree more 👌👌💯❤ https://t.co/rsMVDR5NwV Congrats CiCi!!!!!! ♥️♥️♥️♥️ https://t.co/DHtXRQjFRI 😅🙂 https://t.co/pMELNi60ht Thx mama https://t.co/spMZ65sEYt RT @RobertS3_: Finally! Let me go catch up https://t.co/AoyroyDXrN RT @LilTunechi: Da Queen is bak! Go get that album ASAP! Mula!\nhttps://t.co/rCCwpl1WMk RT @LiveNation: .@NICKIMINAJ’s new album #QUEEN is here! Listen now: https://t.co/90Iq4yvpHZ \nGet tickets to the NICKIHNDRXX Tour with @1fu… 🙏🏽🙏🏽🙏🏽 https://t.co/9AKP8xcWyb RT @XXL: .@NickiMinaj's pen game is on 💯 on her new 'Queen' album. Here are the most rewind-worthy lyrics https://t.co/VkAP4CEX7u RT @KarenCivil: Nicki Minaj’s #QueenRadio Show Has The Highest Number In Beats 1 Radio History: https://t.co/GPaGB0hQCz https://t.co/iuzoqB… RT @TIDAL: \"I got the trophies and the catalogue\nJust did a deal, Mercedes-Benz, check the catalogue\" 🏆👑 #Queen\n\nhttps://t.co/mZCpwsfG7D ht… This guy ♥️ https://t.co/6z37wS2sAj Thank you my love. Can’t wait to shoot with you ♥️ https://t.co/FFMrprd9h8 RT @chartsnm: iTunes Australia:\n\n#1. “#Queen” (NEW)\n\n*72 #1's around the world* \nhttps://t.co/LOwqnYSHZo RT @lilduval: Yo that nicki Minaj song Barbie dreams harder dena bitch! What’s in your top5???? #Queen RT @workwthecoach: I BS you not.. I closed the office today just to listen to #QUEENRadio #Queen #NickiMinaj in peace!!!! Let’s go Queen! @… RT @MIAFestival: #Queen @nickiminaj  👑 Experience her #Majesty's performance live at #MadeInAmerica 2018 https://t.co/fTQNTeoYvm https://t.… RT @iamstillpunch: Barbie Dreams is brilliant. @NICKIMINAJ flipped that. RT @GlobalGrind: Nicki with the BARS on “Hard White” #QueenRadio https://t.co/SJkhEwu1md That’s the one I want you to put a verse on so get to writin!!! 😛 https://t.co/ex9eJzvCZn RT @LalaxMaraj: Hard white is lethal. 💀💀💀💀💀💀💀 😂😂😂 I love this person ♥️ https://t.co/zvs3sj9gZ9 The target album comes with 2 additional songs. Y’all gonna fuk wit it RT @plvshboy: The fact that Queen has absolutely NO SKIPS. This is hands down, your best album of all time sis @NICKIMINAJ I’m not even jus… RT @KINGxTEEJAY: Hard white. &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;%&gt;&gt;&gt;&gt;&gt; RT @vmas: WHO HAS #Queen ON REPEAT? 👑 @NICKIMINAJ https://t.co/cEODDJT1GQ RT @1DJFirstClass: Nicki &amp; Foxy Brown on this record “Coco Chanel” is NECESSARY 🔥🔥🔥 #Queen RT @oldmanebro: Super facts https://t.co/8tTp19HI7R Ummm I love you. No big deal #ChunSwae https://t.co/fi484XQ6QA Thank you my brother. https://t.co/jsFmHnKOeL RT @Kay_Minajj: Ganja burn, ganja burn, ganja burnnnn🔥🔥🔥 https://t.co/Dv9qltgQ7j RT @iiWillProsper: I thought @NICKIMINAJ was done destroying in Barbie Dreams but she was like nope run that back and HIT a new flow and be… Love you. Thank you mama https://t.co/nV6QskXQRR RT @TheKalenAllen: Now rap has never been my go to! HOWEVER, my only exception has always been the Queen @NICKIMINAJ! And Queen has single-… Fasho https://t.co/2H0mWEsujK RT @SamiraBasley: This album has SONGWRITING energy. I am beyond pleased. This is why Nicki Minaj is the queen of rap. The work we hear is… RT @LosoMinaj: GANJA BURN GANJA BURN GANJA BURNNN https://t.co/0xQdTUr8s1 RT @Jerihmi: Most artists don’t top their first debut album......but this bitch topped all of her albums. 🤧🤧🤧🤧🤧 My show last night &amp; today has the highest ratings of all shows in history. Awww man I love y’all. Wow https://t.co/Qgp4VNDFxR RT @NasirLeigh: Roman like naaaah Nicki tag me the fuck in!!!! Barbie Dreams RT @Shazam: The #Queen @NICKIMINAJ is our Artist of the Week 👑 Listen to her brand new album on @AppleMusic ---&gt; https://t.co/KICJLm7SIt 🔥🔥… RT @amazonmusic: 👑 It's @NICKIMINAJ SZN 👑\n🎧 #Queen https://t.co/TvcUqoSA1j https://t.co/rzEMCUKZfF RT @DawnRichard: you did what you had to do @NICKIMINAJ ..🔥 RT @MsBanks94: Coco Chanel or Barbie Dreams bring that shit BACK!!! @NICKIMINAJ #QueenRadio RT @NUFFSAIDNY: My first-listen review of Nicki Minaj's #QUEEN album 👑: https://t.co/Ebm0Wg78WN RT @50cent: South Side stand up the bitch @nickiminaj  is really a problem. Out here killing shit 😆get the strap #lecheminduroi #Queen http… I only mentioned people in #BarbieDreams that I fuk wit. This isn’t a diss. Yikes. This is culture, this is BIGGIE!!!!! New York!!!! This is FUN. Light hearted fun FUN RT @MasinElije: Nicki outdid herself with this fucking ALBUM. I asked for old Nicki but fuck that, she gave me New and fucking improved Nic… RT @KingAmiyahScott: Why would she snap like that on Barbie Dreams     WHYYY https://t.co/Sz9GLQhMLl RT @officialmckell: A follower got mad that I was supporting nicki Minaj album &amp; called me suspect for it ( saying I’m gay ) ... y’all real… 😂😂😂 https://t.co/F4N9yuFHuw Cry every time I listen to Come See About Me https://t.co/FPOoAF21Db RT @CuteBlessedBarb: Nicki is brilliant and this album is fucking brilliant! \n#QueeanRadio #Queen RT @4everKelz: Bitch On GOD This album is everything she dead ass went in her bag! She gave us everything we wanted Roman, Mix tape Nicki,… RT @90boitre: Nicki laid all her emotions out on the table &amp; deciphered them with precision #NipTuck #Queen #QueenRadio 👸🏾💗 RT @jNaemaraj: Everyone Nip Tuck is coming. Hold your wigs. My emotionals are gonna be everywhereeee #QueenRadio RT @BarbzPinkMinaj: NICKI MINAJ IS THE QUEEN OF RAP! #QueenRadio RT @Imma_Twit_On_U: #Queen is really all of @NICKIMINAJ albums mixed into one on steroids 😩😩😩 #QueenRadio https://t.co/kDhn4gw2Gq RT @TanyaThunThighs: Llc was coming for blood tho RT @AngelHaze: Barbie Dreams just gave me all my teenage feels. 💞🤦🏾‍♀️🔥 RT @MadeforTyler: This has PASSED my expectations. RT @lifeofalexx: Son I’m so genuinely happy for Nicki RT @_patttttttt: THIS TOUR IS GONNA FUCKING SMACK RT @slickerxguy: Oh shit, I did not pick that up. 😝 https://t.co/UhtmbCVCrY RT @gabrielhenriqes: @nickiminaj 10000% sure that Queen is my favorite album of ALL TIME. you are a legend, my legend and I will always be… RT @LeliaMinaj: OMG wow a talented artist. Of course she’s gonna redo it for Jay, she loves him. Wow 🔥🔥 #QueenRadio RT @MadeforTyler: She didn’t lie when she said this was her BEST. This is some next level shit, bruh. RT @Bvrbiebritt: I need medical attention foh #LLC #QueenRadio https://t.co/D4PlMHlzP1 RT @xojahshari: We don't pay niggas to front like they like my shit. We don't pay niggas to come in and write my shit. NOW CARRY ON.\n🔥🔥🔥🔥\n#… RT @TeamNickiBarbz: LLC 🔥🔥🔥 #QueenRadio https://t.co/9DyrakMlCv RT @NMBarbieChain: LLC GOES HARD #QueenRadio #Queen IM SHAKING @NICKIMINAJ https://t.co/Q6e9cNTpjx RT @primeminaj: #QueenRadio NO SKIPS ON THIS MASTERPIECE!!!! RT @abrahamromann: Loving everything about Chun Swae 😍 \n #QueenRadio RT @LadyLeshurr: Nah the best. Flow, melodies, punchlines, charisma I’m gasseddd coming at everybody’s neck 💀 #QueenRadio 👸🏾 RT @sweeetserialklr: Today is one of the best days ever and nothing can ruin it . QUEEN SEASON #QueenRADIO RT @QueenMinajTM: @NICKIMINAJ Each song sounds so new; it’s refreshing. I love how with each album you sound so different. I love how you h… RT @alxmaraj: HE EATIN THIS VAN GOGH #QUEENRADIO RT @GeorgiaTMUK_: Not one flaw on this album so far!!!! #queenradio RT @Kayaaa_ox: I’m hitting a slow beef it up to Chun Swae #QueenRadio https://t.co/JpuQylUDjw RT @BougieIconic: @dom_719 Barbie Dreams is a straight hit!!! 🔥🔥🤯🤯🤯 my brain 🧠 is all over my ceiling from how disrespectful she got!!! The… RT @SHAIANNE_FOSTER: THE WAY YOU MURDER EVERY BEAT THAT YOU ARE ON IS UNDENIABLE TALENT YOU CAN TELL THAT SHE WRITES ALL HER VERSES‼️‼️🔥🔥 @… RT @MyTittiesBIGGER: #QueenRadio https://t.co/4UG0jaExLg RT @clouddyangel87: #ChunSwae #QueenRadio #QUEEN #QueenDay @NICKIMINAJ @goSwaeLee  got me like ...... already!!! https://t.co/TqqeqaUCQo RT @andigerov: CHUN SWAE GO OOFFFFFFFFF BITCHHHHHHHHH IT'S AAAAAAAA BOPPPPPPPPPP #QueenRadio #QueenDay #QUEEN @NICKIMINAJ RT @HoesloveGianni: No skips. PERIOD #Queen RT @JovahnteaMinaj: My heart is fucking racingjsjsjsjsjs I am listening to the fucking album w/ my fucking fav!!!! @NICKIMINAJ RT @juniedee_: This is a BOP!!!! #ThoughtIKnewYou RT @ehiroman: NICKI AND ABEL DID WHAT THEY HAD TO: A BOPPP #QueenRadio RT @friskyminaj: I literally have goosebumps listening to this album. I’m SPEECHLESS #QueenRadio RT @goldenrxmance: #TeamNoSleep https://t.co/Vf9ifpVkc4 RT @MadeforTyler: I’m FLOORED on how amazing this album is already and we haven’t gotten through all the tracks yet. WOW. RT @Nickisdaughter0: I fucking heard ROMANNNNNNNN !!! #QueenRadio 😭😭😭 RT @badgalnika: She be putting EVERYBODY in their places I justvkdkckdkxidi #QueenRadio RT @quin_minaj: All you bitches caught the muthafuckin fade!!!🔥🔥🔥🔥💪🏾 @NICKIMINAJ so disrespectful!!! #QueenRadio https://t.co/xKucYVsSJr RT @IAMRAHBANKS: COMPLETELY ANNIHILATED #BarbieDreams 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 Nicki you outdid yourself OMG 🤯🤯🤯"}