{"tweets": "https://t.co/hUsyU3ahne .@gwynethpaltbro https://t.co/CybpP1CVaa @sivancrown party on sale now y’all!!! who’s goin\n\ntickets here https://t.co/2zq9JGWSop https://t.co/UpSyoKp5qN tour look outtake https://t.co/TSBqkyYFN0 @EASYATFIRST 🥳🥳🥳 CHINA I'M COMING BACK ❤️ See ya soon. Tix on sale Sep 30 https://t.co/NUxdKLJOeD PERIOD!!!!!!!! My sister Sage and her friend Alyssa are pushing back against the stigma in talking about periods and working to make them more comfortable for anyone who experiences them FOR ALL BLEEDING PEOPLE:\nhttps://t.co/CCSxUdYYn0 Tbfh this is so chic though.. https://t.co/fbmIFoL8ru LMAO SOMEONE STOP ME THIS IS GETTING CARRIED AWAY https://t.co/o7Xo9ehdeD brissy I’d die for ya 🖤 category was! opulence 💎💎💎 https://t.co/3KfeLw9YAR @jamescharles Yes MONKEY lmaoo. Mommy is weird and cute too @jamescharles Congrats on the monkey ❤️❤️ they’re gonna be your entire life soooo soon. Enjoy 🤝❤️ I call my dog MONKEY 🐒 LMAO https://t.co/hryAvhXDff you know i had to do it to em 😂🌾 https://t.co/OvI7IlFeSM Tonight was sooooo fun SYDNEY 💚 theme was: yeehaw 🐎\nlove to all the people 🐎 https://t.co/XkAMkoiNWL LMAO https://t.co/ufPz85lotv ADELAIDE! 🥺🤲 no words. thank you for tn 🖤 theme was: HEAVEN+HELL https://t.co/OnF8VH9oEy Behind the scenes of my flips https://t.co/0a613cJCDF https://t.co/8WaEsc4c5b @raintosea Yep. Everyone was really impressed @animaIIive @charli_xcx it literally was but go off zoom in like a jet ski, zooom zoom. 2099 video is out nOooOooOw 🏄🏻‍♂️🏄🏻‍♀️ @charli_xcx \n\nhttps://t.co/0a613cs1f5 https://t.co/zCjqN0MUYb @yeahhhshay Gowns, jewels!! You can do it One more post of Auckland’s BLOOM themed look 💖 Perth, see you tn where category is: 1999 📟📟📟 https://t.co/5BWaCdLCim Study up on some 1999 VMA looks for my 1999 themed Perth show tn @tyleroakley Lmaooooooo @tyleroakley No but keep going! 💛 @tyleroakley Are you reading sheet music?! You’re getting so good! I know this disappointment too well https://t.co/ijAP540FWI @bloomlipa First two outfits each night are normal - saving my themed look for later in the show 🤝 BLOOM TOUR AUS/NZ STARTS TONIGHT https://t.co/dhEgrqBFi6 Is it just me that’s terrified of bro hand shakes or is that part of the Queer Experience? hi im in auckland!! https://t.co/hcNqvVN5ec @easedua he’s a very private man @puppysivan @sentimentmellet wooooooow shit that’s good @hesoftsun @mindsout @animaIIive https://t.co/GRBdx4XJWU @mindsout @animaIIive thanks!! posted for the ig girls hopefully they get it 🥴 @eyeIish really foul 🤢 @animaIIive someone put the audio over this so I can RT!!! https://t.co/xKgZQvXwhM https://t.co/qd1IngoWqy @raintosea @superiorsivan fine here's a small one @tracobsprincess @wlweuphoria many times! saw her three nights ago and got to tell her just how good i think Motivation is. she deserves everything coming her way untweet this perhaps https://t.co/801KGsJ8hS 🥺🤲 @wlweuphoria we havent but im a bit obsessed w her 🥺🤲 @superiorsivan dont make decisions for me u dont know nuthin.. your mum never teach you to not bully? https://t.co/DljYFfdSeW @tracobsprincess https://t.co/fcW14Ub2Yt love making music w pop futurist @charli_xcx. let us take you aaaall the way to 2099 ----- out now https://t.co/MIBnUZjEM2 💙📟👾💙 https://t.co/IoM32iaVEO .@charli_xcx just texted me 'In Kiev with bad signal, so bare with me' and if that's not glamour i don't know what is real housewives of melbourne was truly on another level https://t.co/JBwG8v0EOy See? My point exactly https://t.co/D0jCLY31qr Cate Blanchett can say the f word https://t.co/J0mr7yhdTg @wlweuphoria no i promise spent too much time on https://t.co/qILeYGDXzF today and now i want to watch Yentl It’s all you tweet about https://t.co/M7TMCVHmXS @Camila_Cabello 🥵 study up https://t.co/p5wZGFUJHf https://t.co/e7H8cy1KQC @sweetstplums thought this was me. approved @Troyesmellet the halo and the devil tail all at once your mind.... @Troyesmellet approved!!! but I think some chunky jewelry or a glittery glam on the eye/lip... consider a feather boa @velvetfools not approved @ANIMALBECKON approved!!!! really love the inspired color of the bandana. hoping the shoes tie it together too @Iovelinelisa my fun lil secret is that I sometimes go on your accts when I see you in my mentions and read back for like months. the things I have seen 😳 @wwylmalibu i’m quite serious now is the time to start posting your looks so I can approve or edit them :) https://t.co/NxvyQkwMXp @trenchtroye there’s still time.... @sivancrown @Cartier @harpersbazaarus this keeps making me laugh idk why! @subxrbiia we stan Troye Sivan Russia in this house luv omg you guys are so fuckin nice to me lol 🥺❤️❤️❤️❤️ last nite w @Cartier @harpersbazaarus 🎺🎺🎺 https://t.co/Rk9qPfFAC6 The #Target20 experience was so fun!! ❤️ Thanks @target for having me n catch anything you missed here:\nhttps://t.co/J5VcR7UHvn #ad party livestream: https://t.co/bhLviCMmyV #target20 #ad 👼🏼👼🏼👼🏼 @LWTSlVAN @Target https://t.co/BgLrFGYowq Out in new york (!!) for fashion week and working w @target on their #target20 portyyyy. its gonna be livestreamed TOMORROW** lol lmk if you see me on camera 🤝👼🏼 #ad https://t.co/dIESaPWggM @stephenossola Wow I’m star struck no joke. This is like meeting your FBI agent Love when the gay intern runs the @TwitterMusic account https://t.co/Wulp3UrdCa and to see how many of you became friends and are STILL friends bc of the music? So soft I thought I was just shitposting on twt but all of a sudden I’m in my feelings... so so grateful to see all these familiar faces over the years 🥺🥺🥺 @arigoggles WHEW @ripsticktyde this is sweet :) @andrewsfancyhuh two infants 😌 @moonlightbiix @troyepmore should I even click into this thread I’m nervous..... I love b*te 🥺 where my OGs at... https://t.co/63oXrP7sA1 @bwaytroye @Target probably! let me ask @awareofthis @Target where lol @playboybix Dang omg talent me about myself when I’m having a good mental health day https://t.co/ur59MVYm6s https://t.co/mdElH9UIs7 one year!! what a time capsule of a beautiful time in my life. grateful for all of you. feeling reflective and weepy lol so I’m going to spend today cuddling Nash and working on new music https://t.co/krRlUoVTQk @troyesivanteen im writing + crying in my kitchen https://t.co/kJ5KdROT7C crying in the kitchen 🤝 @LanaDelRey lana makes all gays emo. i'm gays @pfpicardi Love you Philip! ❤️ appreciate it .@outmagazine i love you guys and all the work you do, just didn’t feel like this was a fair take on this. Okayyyyyyy I’m done n never talking about this again bc my parents read this stuff and i feel weird. love to all There’s no shame in anal sex or any kind of sex - i just don’t want to talk about it over the phone to a complete stranger I highly doubt anyone would ask any of my straight peers explicit questions about who does what to who in their relationship, no matter the content of their music. I don’t think artists should have to expect to be asked about that when they show up to work in the morning I speak about sex in my music on my terms, when I’m in control, and writing music that is going to be close to my heart forever. That does not open the flood gates + give anyone a pass on basic manners and allow them to ask about the ins and outs of what i do in bed Firstly, Bloom is an album about love. I said that in every single interview i did about the album. Suggesting that i made the entire album about bottoming is over sexualising me + my work, and is reductive Last I’ll say on this, but disappointing to see that @outmagazine, an LGBT publication, was the only one to miss the mark so much on the reporting of this https://t.co/vEgSnIm7Q5 Lol nooooo don’t NZ is my fave and i can’t wait to get there https://t.co/dLSrjUO9Em You sure you don’t wanna just ask if i have a gayby or if i like Will and Grace like the other guy??? https://t.co/Gi8JNCuJoK Next time I’ll just do a Twitter q&amp;a I thought about asking the interviewer about his absolute fave sex position after that last question, but then i remembered how wildly invasive, strange and innapropriate that would be. Didn’t stop him though! https://t.co/mo80DziQrH oh my god???? 🥺🥺🥺 https://t.co/NuUmY4OnEn @LWTSlVAN what does she say @bloomellet Yes Saturdays are for the Saturday 🤝 @polishidiott @5SOS @Ashton5SOS @Michael5SOS @Luke5SOS @Calum5SOS I don’t tickets: https://t.co/2zq9JGFhwR orrrrrrder up 🚨 aus + nz you are getting a side serving of Thelma Plum and my fucking BROTHER @TydeLevi (if you’re lucky enough to live in Syd/Melb/Perth). this is going to be the best time of my life. thank you thelma and tyde and cant wait to do this alongside such talent https://t.co/FNLfvPg3L0 https://t.co/VOK62pSxbg @erin_agent well dang we in love then bc ilu2 @reveIation i have to go out and live my life at some point 😩 they're annoying but ive just learnt to live w them at this point 🎺🎺🎺 https://t.co/p63li4Y1HG RT @lasagnabby: happy little pill got me through some really tough times https://t.co/Er0bLhIeJV just got gay chills imagining Normani performing Motivation at the @vmas. is that happening?? @sushirolltroye Love you i didn’t mean it I’m sorry 🥺 @sushirolltroye Delete your account nerd Lover is a very special song by @taylorswift13 @fazedme Just bc I’m sick doesn’t mean I’ll tolerate bullshit and slander on my life’s work!!!!!! My My My! isn’t in your top row get out of my sight https://t.co/sUpNq1EZmV @tjskippen Very special and sweet 🥺❤️ 🚨🥵⚰️ https://t.co/PqH9B5CL0e catching up https://t.co/NYPFVeuyRM the hashtags are so all my international girlies can show off their looks too 😌 #TheBloomTourPop https://t.co/mr8dBvq3k7 #TheBloomTourHeavenandHell 🥵 https://t.co/oobpKpBfFk #TheBloomTourBloom lol https://t.co/M4eDvbGgJm #TheBloomTourOpulence https://t.co/pS49bOuLxA #TheBloomTour1999 https://t.co/MJRDL6Kv86 #TheBloomTourYeehaw https://t.co/Z6HOrBEgaV BLOOM TOUR AUS/NZ THEMES COMIN AT YOU https://t.co/2zq9JGFhwR 🇦🇺 🇳🇿 https://t.co/m6AMZyAx2E me in the studio today https://t.co/U8fEcPcKIN FUCK i love making music so much @bloomlipa https://t.co/MwOVjHw4qX @awareofthis congratulations!! 🥳🥳❤️ greetings loved ones..... @meltedyouth Washing the sheets today hun bc I’m civilised Come on, do your worst https://t.co/PTGrBKxdpH We siblings 😂😂😂 https://t.co/jBiB1xPC6L I wrote a new song yesterday alive &amp; well https://t.co/VE4ex9og4j @reveIation https://t.co/d4FrnA7JRq @tracobsprincess is your scratch disk full? @tracobsprincess did it crash?? try increasing memory allocation to 85% and maybe go to preferences &gt; performance &gt; use graphics processor and deselect it @sivancrown you both look sooooo good 🥺 RT @outofcontextBA: https://t.co/lwqKFW1xnN @lovinimliving wym https://t.co/IPI0ZlOgEO https://t.co/N0INCu5FDz https://t.co/uDzqHZ7IoF @bloomfiIms @robynkonichiwa N-O THANK YOU @robynkonichiwa X https://t.co/xFSxeegnSD literally TONIGHT...... @robynkonichiwa https://t.co/PLAOCa3Gkk @bloomlipa it won’t be an accident @troyesivanteen i AM @ANIMALBECKON done! me hopping on twitter to ask for tick pics for the 800th time this year https://t.co/9nFcHZRNCz i just love making you all have to look at this stupid video again Jakarta last night made me lol and say 🥺 https://t.co/YYBXAUIaWk thank you jakarta for tn btw. love you lots Ariana was doing pop girl witchcraft on me and i was saying ‘girl i don’t play with demons’ if i remember correctly https://t.co/m7zuhvRyjm i'll be in my room crying at pregnancy announcement videos if anyone needs me @odetobix no on sale Monday btw!!!! NEXT LEVEL CHARLI https://t.co/eOu0UT5AJ0 @charli_xcx @QueensChristine Had to one last time 😔 https://t.co/DoBDi9dhYL Millions sometimes. That’s besides the point - I’m happy that young people aren’t going to have to base their self worth/the worth of content they love from a number on a screen https://t.co/2RKQi5pitn @lilacbIoom Exactly Bout to post w no thought or consequence like it’s 2013 go crazy go stupid ahhhhhh HOLY SHIT INSTAGRAM REMOVED LIKE NUMBERS HALLELUJAH Virgin bloody marys are healthy @AshLondonLIVE @katyperry This was very impressive ash Hey! 🧡 https://t.co/SGjKJqbmAT ‘I AM NOT A THREAT I JUST AM INTERESTED IN FRAGRANCE AND YOU SMELL PERFECT’ https://t.co/H6hhljCwRL wish there was a way to assert that i am not a threat to the woman walking in front of me wearing the best perfume in the world so i could ask her what she’s wearing @exesincheck @heardtroye Heath Ledger! Tame Impala! legends only @heardtroye also Katherine Langford wtf!!!!!!!!!!!!!!!!! looking into it https://t.co/szFQWuL8BG Fun fact - Dacre and i met 8 years ago when we did a short film together in Perth lol. Very proud to know him!! https://t.co/omZrSTF659 yes please 🥺 https://t.co/Oyc6HpUPdm @pinkteasivan Luv u more Just watched a movie called Denial about a holocaust denier n felt rage n then gratitude for the resilience of my ancestors, family, friends and community. Give it a watch https://t.co/ncM3HXXBkU I’m so proud to be jewish :’) @bIuetroye never can’t sleep thinkin bout this show https://t.co/svDKxjFmBC What the fuck https://t.co/Hw1Bd5VEbo https://t.co/hZ85I3dCx8 @meIodramabix I passed out watching Friends lol Good night https://t.co/iFSd3b9Rt3 RT @a_roach06: Baby really hurt me... crying in the taxi.. he don’t wanna know me says he made the big mistake of dancing in my storm.. htt… To date, VIVA GLAM has raised 🗣$500,000,000 🗣 to support the health and rights of people of all ages, races, and genders. ❤️ proud to be a #MACambassador #vivaglam #glamforacceptance @MACcosmetics https://t.co/HrNy0diSup @bnfools @curlytroye i’m doing it manually so you guys don’t give me shit lol @sushirolltroye @Disney @peachplumtroye pleaaaaase keep us updated! ❤️💗 @curlytroye ok but your eyeliner sure isn’t! @kailia_jane pics @tydeftdolans wow same! wyd @animaIIive omg 🥺 @angelsbeckon make it longer... RT @robynkonichiwa: Hi! @troyesivan will be supporting me in San Francisco and LA. Yäaaas 😀 \n\nSee you soon, thanks Troye! \n\nhttps://t.co/Tp… wouldn’t it be sickening if an artist donated their share of a song to a charity forever? ROBYN x TROYE, COMING TO LA + SF 💜🧡💜 @robynkonichiwa thank you for having me!! ❤️ See you all sooooon holy FUCK\n\nLA: https://t.co/oFzzSguo1H\n\nSF: https://t.co/0JVdLVAGZ6 https://t.co/6uFGXPN4Aa @puppysivan I love snitching @matiasmauroo I’ll tell him you said this 🥰 🇦🇺https://t.co/fPMStmtBlD\n\n🇳🇿https://t.co/qy4SOdeFnN Telling him you said this https://t.co/rM1YmcHQqm homecoming 🖤 aus + nz thank you for the love on the bloom tour tickets are going QUICK and I’m fucking stoked. grab before they’re goooooone https://t.co/H7NJMO5xEq @troyesivanteen It’s the same haircut!! Lol that’s what I’m saying it just doesn’t look bowly when it curls up Fun fact i have a bowl cut you just can’t tell bc my hair is curly https://t.co/I032bdEMXY @tydeftdolans ok deal @Tamsyn1D not anymore 😌 whomst am I missing #TheBloomTour @joesavocado GOT U @reveIation just did! @signsofatime followed!!! btw FOLLOW SPREE just show me ur tick pics and use #TheBloomTour RT RT RT 🤪 🌸 AUSTRALIA &amp; NEW ZEALAND 🌸\n\n#TheBloomTour ON SALE NOW\n\n🇦🇺https://t.co/RUYvuUeCjW\n\n🇳🇿https://t.co/sA6zocHcRt https://t.co/UeXAJKbz1L @colourscabello Thank you i will https://t.co/bcoHjsds0j https://t.co/Pw5DRIAtb5 https://t.co/3fiYYgQSUe true slapper @conangray @irrelevntjaimie @irrelevant Jk thank you for your support i love you @irrelevntjaimie @irrelevant Lmk when you release Ray Of Light and I’ll consider following back Not even a humble brag just a straight up brag Madonna followed me on Instagram good morning! @ThomstonMusic @angelsbeckon also my mom's goin thru it rn so you're right. gonna call her now lol @ThomstonMusic @angelsbeckon wait what the actual fuck i randomly got Collarbones stuck in my head yesterday and thought of you literally don't leave me bored in LA too long or this will happen https://t.co/nKA7mVn79V i forgot the password to this account so i guess this is going to be on the internet forever https://t.co/ihKj9H5Iou to me most youtubers exist in 1.75x speed https://t.co/cNjdMjpgaR https://t.co/U1xp6v0q9q @bloomjustforyou I play it with friends at meals. Would you rather meet Michelle Obama or Adele Just thought of the best Would You Rather ever: would you rather Friends (the tv show) never existed, or The Lion King never existed? RT for no Friends, Like for no Lion King @easeftbroods check ur post 😏 @thegoodplum @liIactears followed. proud of you 💗 @liIactears you guys are bored enough to photoshop tweets now? i’m bitches https://t.co/yCrM2PRWPm @velvetfools me too @retroyouth think harder bc I’m about to log off @troyeslucky same tbh i love the clownery on this app... the ig girlies just don’t get it @thorquill @puppysivan no shade but i’m noticing that! 😩 @animaIIive @puppysivan this is so funny @puppysivan great gowns, beautiful gowns @skIetonbones it’s a little late for that daisie @sweetstplums you weren’t wrong!!! two cuties i’m really always lurking huh @youweremyspring it feels out of my hands at this point CAN I JUST SAY I’m really so grateful to have you guys in my life @reveIation I showed him this @dietocareforyou @troyeshalcyon Ewwwwww @LWTSlVAN Never fuckin forget Thinking about theming all of the aus + nz shows with different themes and having everyone come dressed up. Sickening, no?? Comment if you like the idea + theme suggestions ❤️❤️ https://t.co/7o6xSWQaf7 @luckyjeweI You are not good @AlecBenjamin I’ll consider it @AlecBenjamin You have the coolest voice and i luv this song That’s on you bb girl https://t.co/8fTY1JF8pp the quicker you sell the tour out the less tick pics you have to see so it’s kind of up to you...... https://t.co/AUnmC68QSe oh perth is going to be particularly wild huh https://t.co/rJ2LxvqFXA @OKSlVAN congrats!!!! 🍾 @rosietroye what’s your ig I’m tryna share this 😏 which show!!! https://t.co/Q4qb9fI539 Love you https://t.co/K9jbJKDouS maybe lmao. i should do a competition to fly someone out to one of the shows https://t.co/VoLSokOpOI BANG BANG ❤️ @australia @nz this is a show you don’t wanna miss!! pre-sale code is coming to some of your emails if you’re subbed to the mailing list 🥰 https://t.co/P3tuI3EaNC @bloomlipa literally HELP ye boiiiiiiiiiiiiiiiiiiiiii https://t.co/uSmL7j246M @easeIy i dont have 5 hands give me a sec to ctrl c ctrl v THE BLOOM TOUR IS FINALLY COMING HOME 🇦🇺🇳🇿  (FOR THE RECORD IT’S NOT MY FAULT IT’S TAKEN THIS LONG I HAVE PRESSURED THE POWERS THAT BE FOR MANY MOONS)\n\nAUS + NZ TIX AVAIL ON FRIDAY JUNE 28\n\nCOME AS YOU ARE, DRESS HOW YOU WANT, GET READY TO PARTY W ME THIS SEPTEMBER https://t.co/RIbwP2hIbp okay SO.............. Gimmeeeeee...40ish minutes https://t.co/1GyUSlL07p @sushirolltroye tea, love is a two way street no confusion there, I just thought he was going to say me :/ https://t.co/kYWd4rTkzE Been waiting for this day for a looooooong time. Thanks for having me @voguemagazine! https://t.co/SahGEe1BKZ P.s this isn’t the only cute thing coming today https://t.co/h8LXrxQeEt Who’s ready for yee old one, two, punch? exciting things this week maaaaaate @heavenlyxSOS @wild_sivann tea @RegiWorles @KaceyMusgraves omfg dreams @ShawnMendes this is actually incorrect - the smell gets stuck in my throat and makes me feel like i have to cough this is the best video ive seen in years @ToveLo HOW https://t.co/c5wN1wu03V https://t.co/R09uYPhzWR @animaIIive I can hear this tweet @talkmedwn no! hi now would be the time to share your thoughts on the matter 🤠 https://t.co/HhT1Uw2jYe @MJSchulman Thanks again Michael. Loved spending the time w you. Sorry again about the 😷 @Iordebix I gave twitter the exclusive full crop and for what! also grateful to finally have had the chance to discuss online grooming of young people by predators - which is personal and close to my heart. some serious + light shit in there. so i guess she’s a girl w a @NewYorker profile…..thanks to @MJSchulman for spending the time w me and for capturing the inspiring world the people who come to my shows have created ❤️ https://t.co/b1gE2g5jhe https://t.co/B1dlXo5hMA @danielhowell you're a hero n a champ n an absolute class act ❤️❤️❤️ @charli_xcx THE SKY FEATURE SAVED MY LIFE @charli_xcx FUCK YES HBD to One Of The Best Songs On Bloom ❤️ love you @arianagrande let’s sing it live soon please https://t.co/pSthJ0TmQP 🤐 RT @sushirolltroye: nash as emojis; a thread https://t.co/yKKqI3ImIT @puppysivan Love you more thank you @puppysivan Well then send me the files 🥴 https://t.co/mK1aUH1YON @charli_xcx lmaooooo why is this photo of me and charli a meme https://t.co/ERC1W11gcD https://t.co/q9jl8jOQsE @TROYESPRlDE how did you do this Send me pics of the line outside the Wiltern rn! nobody is allowed to be mean to me for tweeting stories again bc it’s my birthday week 😤 https://t.co/ebScGpsOon Literal last chance to get tix to GO WEST FEST to come party for my bday tomorrow night https://t.co/kdo2MNhQSM https://t.co/UpMKikCFYf @tracobsprincess The first 4 seconds of this the way you blink asdfgshhdjska 24!! Feel very loved today ❤️ https://t.co/dVq2ENelIh @tqmhclland @puppysivan No it wasn’t you deserve your money back @puppysivan I feel so bad that you met me when my hair looked like this @TROYESPRlDE Cutie!!! THANK YOU FOR THE BIRTHDAY LOVEEE ❤️❤️❤️❤️ fuck i love you guys https://t.co/ri1L0wLdCL 🤝🤝🤝 LAST CHANCE TO GET TIX: https://t.co/kdo2MNhQSM 🎠🚨⛓ https://t.co/NSIR78VXSt I’m all for tha, Charli.. and you know, we ARE both performing at #GoWestFest this thursday...... 🚨🚨🚨⛓⛓ https://t.co/SUY8SAkHPf @rosietroye I followed up yesterday and think we got some confirmed datessssssssssss 🤑🤑🤑 Joking i love my allies 🥺💜 I’m all for tha https://t.co/jY4STOE2DW gay gay gay!! I love to be gay @superiorsivan This is a serve https://t.co/skGnHhu9mL @MarinaDiamandis @suboobia Just think back to how proud you were the day you wrote your favourite song from the album and try recapture that feeling. That’s all still there and now it’s ours to enjoy ❤️ @MarinaDiamandis @suboobia I went through the exact same thing before Bloom came out - be patient with yourself and be proud of what you made because it’s true to you and it’s brilliant!! There’s a lot of peripheral influence and pressure from the industry (&amp; ourselves) as much as we just want to stay true Big Go West Fest mood https://t.co/DpBJWDQ0DF Sending this to my security team now https://t.co/Hi7Zp0kSaN I’ve never had a real bday party before 🥺 Still sunburnt n look sad but wanted to say thank you to everyone who’s already got tickets for my belated bday party / the funnest night of all of our lives aka GO WEST FEST 🚨🦞 https://t.co/4kSNUORVkj @louvrely Exactly lmaooooo Lmao i just found this video from when my Lollapalooza chile show almost got delayed https://t.co/JfMFjWh71W mans took this pic btw GO WEST FEST tickets went on sale 10 hours ago and they’re nearly sold out. gag!! grab yours before it’s too late🚀 https://t.co/kdo2MNhQSM https://t.co/cnGGhQCfwG https://t.co/kdo2MNhQSM https://t.co/lRkC20uWZv TICKETS ARE GOING SO QUICK HOLY SHIT 🎠🎠🎠 COME SEE THIS SONG LIVE W ME @ #GOWESTFEST @QuayDash https://t.co/9VcrKzSABP RT @charli_xcx: me en route to pick up @troyesivan and go buy tickets to go west fest!!!!! get yours now angels 💅🏼💓 \nhttps://t.co/gIneXnFhE… GO WEST FEST ON SALE NOW 👨 https://t.co/kdo2MNhQSM https://t.co/FOK0AAUMen @sentimentmellet At some point i need to pay you https://t.co/XxwB3pAFVp Just had the beeeesttttt GO WEST FEST meeting. This shits gonna be so fuckin fun omg I look like a little bitch in this photo!!!! I love it Caption this https://t.co/hVbB8YYfms thank u @SamujanaVillas https://t.co/LBV62ScUKo btw spent the last week in paradise @samujanavillas on ko samui, thailand. currently peeling the sunburn off my shoulders but happy that places and people like this exist https://t.co/Y9UZKHBSa7 @tyleroakley @CalvinKlein hsgarattqgwgafafafcscs @COLOURMEBIX good luck ms thing!! #MYTRUTH #MYCALVINS @calvinklein https://t.co/HzGQsztRbn #MYTRUTH #MYCALVINS @CalvinKlein https://t.co/sCwYrXdYsT btw Go West Fest is the day after my birthday we getting litty?? @WlGSIVAN @callmebylwt it was for go west fest... I played the long game @callmebylwt 😌 i can tell you right now it’s gonna be worth it 🥰🥰 https://t.co/daHQuet4cH RT @troyesivan: 🚨🔨🚨\nGO WEST FEST \nJUNE 6 LOS ANGELES\nGO WEST FEST\n🚨🔨🚨\nBeen working on this for months and I’m soooooo stoked to share this… RT @billboard: Artists @TroyeSivan &amp; @Charli_XCX announce lineup for first annual 'Go West Fest'\nhttps://t.co/i44jBdU21D https://t.co/qEP7m… @myhweetener @oranicuhh @pussyrrriot @GiaGunn @carliehanson @LelandOfficial @alliex thank youuu 😌😌😭🥰 Musical line up is fucking sickening w @oranicuhh, @pussyrrriot, @GiaGunn, @carliehanson, @LelandOfficial, @alliex and so many more. Whole thing benefits GLAAD and local organisations. Everyone’s welcome. Tickets on sale Friday. 🖤 A new kind of pride festival curated by me n @charli_xcx that celebrates the inclusivity, artistry, music, kinks, merchants, and creativity of the LGBTQ community, while really giving back to our community. 🚨🔨🚨\nGO WEST FEST \nJUNE 6 LOS ANGELES\nGO WEST FEST\n🚨🔨🚨\nBeen working on this for months and I’m soooooo stoked to share this with you - introducing GO WEST FEST ⛓🧯 https://t.co/k8SSAvn46H #MYTRUTH #MYCALVINS @CalvinKlein https://t.co/kEjPhYKFu9 @hisfloral you think I won’t? ok but I’m not joking b*tch.... can you guys vote on a cute summer-y theme I need HELP! My layout is tragic!!!! @keepmecIoser I’m leaving again @13troye a concept! honestly taking suggestions here bc I’m a bit creatively stuck. what is the visual flavour of our summer era... https://t.co/DyMMWwQ5Gl @beckoningangels @GODISASIVAN a moment most pleasing to me in my career might have something fun to announce v soon might not we’ll just have to see! @touchnick https://t.co/JL2npziO2X Hanging and chatting with my friends https://t.co/MAuaRy1GEb @saintsivan Omfg so many but Kacey, Dua, Ezra 🚨🚨🚨🚨🚨🚨 @meIodramabix Aus dates are of course happening!!! And I’ve got a few more festivals this year 🤡 @keepmecIoser No!!! I’ve been sightseeing and playing these shows. I might be MIA for the next week bc I’m gonna take a week to just like sleep lol I would pay big bucks to be able to text my dog Asia you have nooooo idea how much the last few weeks have meant to me. Can’t wait to come back i love you xxxxxxx .@CALVINKLEIN #MYTRUTH #MYCALVINS https://t.co/FwLBtw4NAv also this https://t.co/QmJUa4ihqr A cause extremely close to my heart ❤️ @MACcosmetics #VIVAGLAM campaign w mans —  Here’s to 25 years of making a difference! #MACambassador https://t.co/YLFkIcruvD RT @sentimentmellet: i genuinely wanna know if the person who took this is alive and breathing after this https://t.co/6lVV1ND4rm @XCXBIX going ✈️ ig stories @tracobsprincess b*tch me too the fuck i can’t say thank you enough for tonight. love you Seoul https://t.co/SKmSV6JVyu @troyesfine Omg I’m so happy you’re okay ❤️ https://t.co/0kOSNJF3Wt also the first thing I saw when I get on twt after the show was a video of me falling. why can’t I live on this app That was really 18 thousand people....... #TheBloomTour https://t.co/ZdmoNoIsXr @subvrbia alive and in SHANGHAI can you believe what do y’all want to know?? https://t.co/rig5tSon4U RT @Ietstopmybaby: where did i go wrong https://t.co/V1AkIkUlri I said what I said https://t.co/PctXYUlATN Hello???? @BTS_twt https://t.co/v2vlkuBFHE You know what i didn’t say? Fuckin yee @jasminsivan It’s 100% a term of endearment @alexander_olly No date tonight I’m assuming @stokedsivann @sunflowerbix Noooo very old. That’s what’s weird too @17PLUMS @sunflowerbix Soooo weird i got the fright of my life when i saw them @sunflowerbix Btw we aren’t normally disgusting like this w PDA we hadn’t seen eachother in a really long time and had no idea the photogs were there leaving w a full heart and a stye https://t.co/uTfG70gqkW @superiorsivan I go to her ???? Is this allowed?? Hope she can get home still bonjour gals https://t.co/anF8IlModF @sivantequila Also working but he’s on his own trip somewhere ✈️ 🥺 @1975BIX He had to stay in LA for work 😩 @troyesfine It was sooo nice but we’re outta here now on a fun secret sibling trip https://t.co/icaORW5aXf @callmebylwt I can’t 😞 I’m in Asia! Nash is watching Our Planet w me and I’m not kidding boo boo for the @guardian https://t.co/WYdkobOHj7 São Paulo i s2g i could burst from the last few days. Thank you so much ❤️❤️❤️🥺🥺 @PASSIONSlVAN It’s working.. I can’t fuckin waiiiit to get back in the studio @tokbixnash @strandrerry Delete this i was on one!!!!!!!! https://t.co/OmnRob3aX8 just did these dank back exercises to start my day When a fire starts to burn.. When the cold brew hits!!!!!!!!!!! https://t.co/yB3FozbpQR @puppysivan Jk lol i love this idea @puppysivan Nerd @callmebylwt We realised we’ve been missing DM’s from eachother for like literally years 😩 all g now tho @melletsrose Honestly just drink SOOOOOOO much water and rest if you can. If you’re not better in a day or two see a doc @odetobix I’ve read her i loved 🥺🥺🥺🥺 @foolishglee This videoooooooo. I just made the strangest sound. I love you so much you’re a legend n best of luck to ya my sister @tracobsprincess @lovetoIust Yes omg blasted through it and loved @troyestruth Yes! i wish it was longer though. I wanna know about life post-white house @melletsbix Yes i am and yes they are!!! You inspired me I’m gonna work out today @lovetoIust I read the whole series like 5 times as a kid 🥺 @youweremyspring @puppysivan Rn I’m reading this book called ‘Ikigai’ about the Japanese secret to a long and happy life lol. It’s interesting so far!! @puppysivan Just finished it last night. It’s sooooo fucking heart wrenching but yes highly recommend. Also the Michelle Obama book is soooOooOo good @Truman_Black dm’d you king And Troye Siran’s dressing room yesterday fml https://t.co/xd63LEQZWE https://t.co/bi7DNtFcVM Again, no words. Thank you Chile. Best week!!!! Love you xxxx @karma what did i do? @FRlDAYNlGHT No thank god this is preventative @sweetstplums https://t.co/J589soheyX @dietocareforyou Ugh i still die for your tour looks @DANCESlVAN @lyingtoall @simpIemistake Lmaoooooo 😂😂😂😂 @lyingtoall @simpIemistake I was being ironic! Swear 😂😂😂 @simpIemistake Its bc I’m not w mans 😂 lmao @troyestruth Which u gotta do at some point i guess. I’ll try get better at relinquishing some control @troyestruth No legit ur right but having the TIME once you start promo, touring, etc to keep making shit is hard. You need a lot of money and a really biiiiiig team of creatives you trust. I’m also such a creative control freak i have a hard time letting other people work on my behalf @blissboysivan https://t.co/G0on4QUMEC @easealyssa He’s so good you don’t understand. He was so clingy when i got home and slept like right on my pillow w his head on my chest. Insane human child vibes @bloodlwtine @17PLUMS Now you’re just makin shit up!!!!!!!!!! Lmao @duasplum @bloomlipa @oceantrxye @trenchtroye Never existed either (though i wish it did!!!!!!!!) @17PLUMS you made those up they were never a thing @bloomlipa @oceantrxye @trenchtroye Want the real full story on that?? I scheduled a tweet being like ‘coming soon’ w intention of MAKING a BTS video and then i realised i didn’t have enough footage so i was like it’s all g but i forgot to cancel the tweet and I just sort of hoped you would forget about it @velvetfools @gayrodcon @mamamellet Hoooooooly shit this is gorgeous. Love you lots @oceantrxye @trenchtroye I don’t actually fuckin know @trenchtroye What even is this SONG on Spotify why am i talking so loud and robotically i really ain’t shit @billieeilish ‘i love you’ has me 🥵 you should be so proud Lmaooooooo just when you start thinking you’re the shit they keep you humble https://t.co/qTJLpyZIlo Happiest ever ever https://t.co/32TXcYmGGf @callmebylwt Olly and i have been laying at the pool every day so far hehe https://t.co/mR0jbvjD06 🇦🇷 ❤️😭 https://t.co/rq6yItpHit No words. Thank you Argentina ❤️ https://t.co/GpcGrE8i1r @gIoryparis U got scammed! Idek what that means but sometimes i just say things you guys say and....it works! Keep retweeting 👏🏼 I’m baby https://t.co/Gmgj7jvqMF Btw my curls are coming back post-bleach thanks god https://t.co/xsDcBQ9IcB @melletsrose @sushirolltroye @foreverinyours @IlmaSmile @tyleroakley No thank you :) @adorablebix So are you hun ilu @sushirolltroye @foreverinyours @IlmaSmile @tyleroakley Yes thankfully!!!! @WIGSIVAN @foreverinyours @IlmaSmile @tyleroakley and put them in what suitcase.........also why i have plenty of clothes in LA!! I got just enough to see me through the 10 days I’m good i got this guys!!! @foreverinyours @IlmaSmile @tyleroakley Shipping would take too long or be crazy expensive. Plus I’ll live lol i got socks n undies etc today @IlmaSmile @tyleroakley They ended up back in LA. At least they’re safe but the next 10 days I’m gonna be on struggle street @tyleroakley Don’t worry be happy.... @COLOURMEBIX What the hell y’all don’t read? @animaIIive I have access to my show clothes now so catch me round Buenos Aires in a custom Valentino green suit @aworldaIone Why do you think I’m up so early I’m blasting thru this Michelle Obama book and i miss her 🥺🥺🥺 @andrewlowe https://t.co/bIaDs0Zp67 @4sivan WOW @callmebylwt some people care about their eyesight phoebe @trenchtroye ANIMADO (?) @wallowsghc ❤️❤️❤️ @fxtureflying give me that promo king!!! well https://t.co/OJVA9gdJc4 tell me all the ways to love you @charli_xcx Happy sunday!! #TheBloomTour 😔 https://t.co/619QqL5cgp @velvetfools A stunner! @eyeIish The disrespect... @missyousivan Surprise!!!!!! That’s my sister and i love her Some guy shouted ‘show us your dick!!!’ At my show while my mom was live streaming https://t.co/kswzsFgOMu @eyeIish MY MOMS SCREAM HIFJDHDHFHBF Just like that, the bloom tour is leaving Europe! Don’t even have the words to say an adequate thank you for the last few weeks.  Brb gonna go be really sad for a few days n then next stop: LOLLAPALOOZA ARGENTINA 🇦🇷 https://t.co/WrcSWVKJoM @trixiemattel Exhausting I thought you’d never ask https://t.co/GF9hOcHnEx this made me want to quit my job and call my therapist https://t.co/kqYFVQFMoK Why do i ever check my DM requests https://t.co/4EtCduO2Ra off day in düsseldorf 🐸 https://t.co/xofC21NpVR Woke up to the most heartbreaking news imaginable. Sick to my stomach over the atrocities in Christchurch. Thinking of all the families, and the Islamic community of New Zealand 💔 I’m just gonna say it: this was a serve https://t.co/ta3Q6QiUBz @evileilish @RuPaulsDragRace Me on IG vs twt https://t.co/7fSl3MXNTo @reveIation This is sending me .@RuPaulsDragRace TONIGHT 🥴💪💋 https://t.co/I5s7XFdAjJ you live like this? https://t.co/DHf1dSAAv2 Europeans how do you watch drag race live asking for a friend RT @luckyjeweI: goodnight https://t.co/NPFjqzw5rh @SUBURBlX CUTE Instagram down... a liberation today @ArianaGrande I actually knew this pic would summon you @ArianaGrande Coming for your brand @lauvsongs Text me the bounce 😡 @troyesbIoom where is ur icon from i would maybe like to insta that @messyourlifeup I can’t watch it it makes me wanna die 😌 https://t.co/LDThpY5mPx @dearrbeloved https://t.co/kJWFDjDGCr https://t.co/0awquZSedt https://t.co/EOv69rlgWL i wish! 🥴 FML @ShawnMendes https://t.co/eJVVqbW0z8 I thought someone hit it at me on purpose I remember for some reason i was like mad at that balloon for getting in my way but wanted to act casual about it https://t.co/DEEPVqdJsa oh shit tn is sold out in Vienna but the venue just opened up another section!!!! tickets will be at the box office tonight if you wanna come! @sivanrings Love you @officiaIj you’re absolutely right i just hate cancelling so much https://t.co/tDRLgGtamb @bencsmoke @NoiseyMusic Ben this really, really touched me. So glad you had a good time and thank you for being there! ❤️ @dietocareforyou Let’s find them this shit is gnarly Amsterdam i can’t wait to be w you tonight. I’m sick af and my voice is unpredictable and croaky and weird but i feel full of love and ready to have an amazing night w you. PLEASEEEEE help out and sing along tn and hope you’re ready to have funnnnnn xxxx My throat fuckin kills and i haven’t slept all night I’m stressssssssed 😞😞😞😞😞😞 Not to be soft but this video... whew! Love you guys so so so much https://t.co/qhySFTP1Yh @hardtosmiIe she always tweets once then leaves :/ @roomforastrid this is sooo cute I’m gonna lose it @crazygeniuspml I’m honoured! Perhaps I’ve been on a fitness journey https://t.co/B0l546L3VA .@glossier @glossier @glossier #glossierplay!! proud to launch our campaign today🧡 photos by @CharlottemWales https://t.co/s5ba1pYv8X this shit was crazy https://t.co/CoI4jGIi7B @selflessdrunk @CalvinKlein 🥰🥰🥰 https://t.co/r7mjE0owPs @shotwithsoju I’m devo @ ur elimination 😔 wish i met you Family portrait https://t.co/YYAc9LjJI1 I WANNA BE THAT G.A.WHYYYYYYYYYY❤️❤️❤️ https://t.co/9BMavC3tTm me on stage 😔 https://t.co/7XVYHpB2Op in London listening to the @MNEK remix of i’m so tired and it feels correct https://t.co/IqIJJ3p7C5 💃🏼 https://t.co/bNbBKuT4DO @arianatroyebix finally a compliment around here how gays sit in the studio https://t.co/DLGixC8b1Q In honour of the 3 year anniversary of the vroom vroom EP @charli_xcx https://t.co/UAC5mfyF6Y @XCXBIX she is everything... she is the whole universe @sushirolltroye maybe so Thank you for coming to my Ted talk (I love you guys sfm) 🌸 #TheBloomTour https://t.co/lvRtEuf2E4 sissy @sageerinmellet https://t.co/QLfeizuVel Can i grab a Bloom for onstage? https://t.co/l7I8J4pWXE @eviepeat followed tbqh! Identify yourself https://t.co/PjRQbvVS90 GLASGOW TONIGHT ⛈🌸🌸 #TheBloomTour https://t.co/CwoRf0fRLt Do you ever just think about how #TheBloomTour starts... literally tomorrow https://t.co/Go5Mmb8D5G @simpIemistake ok 😔 Let’s celebrate these too then I’m done https://t.co/pFJXUV6XwN Plus a lil bonus https://t.co/oCfGLfzXLJ .@wkorea cover 🧡🧡 thank you for having me and see you in April!! https://t.co/2l2SJFXLJy In 5 days i go on tour to see my fave people (you) with my best friend (@LelandOfficial) and my family and i can’t wait https://t.co/MrCkyMK81l @buildhopes electric chair @adorablebix Tbh I regret making this dumb joke now @stunsivan WOW this is actually a stunt double. if you rewatch and look closely you can tell https://t.co/Ofn5jj0TeD Fav screencap?? @talkmedwn delete this pic off your camera roll and you’ve got a deal you being followed 🤝 https://t.co/LauTxW3Yq9 @troyestruth HUUUUGE!! CONGRATS! oh the i’m so tired video?? it’s OUT NOW https://t.co/okko7ePJPC @lauvsongs \n\nhappy valentines day I literally love you all so much. hope you enjoy!!! 🚙💤💔 https://t.co/hKsAzvmooq @lauvsongs maybe I served @odetobix @lauvsongs omg jk i don’t know why I love arguing with you specifically on twitter Carly... it’s just our dynamic I guess ... our energy @odetobix @lauvsongs not in the mood anyway 15 MINS MAKE SOME NOISE https://t.co/x6W8YfFkBB me waking up at 5:30 am bc @lauvsongs chose to schedule the i’m so tired video premiere before the sun even rises in LA https://t.co/rSEOlhVLJK @sincerelyjena @HamiltonMusical @Lin_Manuel wait this is legit the cutest shit i've ever seen you're a great daughter @flirtsangeI I agree! things i miss from Australia:\n1) my family\n2) golden gaytime ice creams .@KaceyMusgraves https://t.co/oEwm23S1iE HEI Finland! Such an honour to be playing the @RuisrockTurku festival in July 🇫🇮 \n\nCome get y’all juice: https://t.co/eyzyJ0p5wB 3 years today 🧡 luckiest boy alive. love you lots @gwynethpaltbro https://t.co/V4PXo8H36o https://t.co/zSYadbrYiZ @adoredtruly @easeIy what are your thots? @easeIy i love Brazil! some of you don't listen to Sade and it shows @jasminsivan I just made this bomb halibut w fennel situation that was sooooo good @sivanpIum @bittenbix On my Australian license. Which is legal but i need my California ID bc now i live here this video comes out on valentine’s day \n\nhttps://t.co/jDU7svoue9\n\n@lauvsongs @bittenbix I did!!!!!!!! 🥰🥰🥰 rocking me to sleep tn. proud to know and love this girl https://t.co/3RKfBmcOHO https://t.co/9LgA73v5J5 @trynabetroye but until then the vet says he gets to play and be normal till that day comes. his quality of life is #1 to me and he neeeeeeds exercise to stay happy so that was a relief to hear @trynabetroye pretty good! thank you for asking. he has torn ligaments in his knees that are apparently common w his breed. he's gonna need surgery eventually that'll be tough bc he'll have to rest for like 6 weeks, BUT it'll fix it. and we dont have to do it for a while @velvetfools @dyingfirst This was a misquote!! I wish. I think i said I’d love to do another movie @troyestruth That VOCAL!!!!! Sing Mack!!! @dietocareforyou https://t.co/bPEq1pUcNH please try this recipe you will love me forever just songs im vibing at the moment gonna try update monthly and also would love artwork submissions from any cute talented designers my pasta mukbang playlist: https://t.co/PLL6oJD3uX exactly this https://t.co/lShGOnizUj My parents need to up their game. I’m gonna teach my mum how to do that rainbow word art i used to use in year 3 https://t.co/MXhwmRnTr3 nice https://t.co/Liw0VPPTRW @Iovedafter tag yourself im the meat mortal @duasplum I’ll be super busy while I’m there but yes please send recommends! 🇦🇷 I really just feel like I’m a 🍀🌍citizen of the world 🌱☀️ Heading to Europe, Asia, and Latin America this spring - aaaaaaand just announced new shows!!!! Hell yeah see you soon x \n\nhttps://t.co/2zq9JGWSop https://t.co/h1VpiC45Fc HELLO! 🇧🇷 https://t.co/AkOSOzjUVx dedicated to everyone asking for a pic of nash: https://t.co/XtPRRbk2vY @intotheblues @DUASBOY on the couch behind me chewing a toy we just played for like 20 mins @nostalgiasivan almost!!! the dead hair is still under there somewhere but growing out @DUASBOY rn wdym @hearteyesdelano omg big upset this episode thats the spirit! https://t.co/BTZSuZP0o8 not watching the superbowl wyd https://t.co/UoenDrT4bE DELETE https://t.co/fkOdPVy3wO Sadness, but make it a pop song https://t.co/A0V7HHi0oI 🤨 https://t.co/ch1vuKWDRP @visualizesivan dang girl u can sing did u know???? Happy place 💞 https://t.co/FdcDHsYKZJ @Iauvtroye @lauvsongs talent... @troyestruth whaaat congrats!! 🍾🎉 https://t.co/KqJG7dITzF I was actually thinking of starting a monthly playlist of new and old music that inspires me... y’all want her? https://t.co/iUUl2hdEXl Omg yes I’m SO ready to play the orange Warsaw festival this summer!! Get your tickets here https://t.co/SRfUhImgRi 🍊 see you there miss julia https://t.co/wFfZ3ZQsJu Why does society always pit two strong women against each other? https://t.co/ClfsPmLia1 @mindsout This is a DRAWING??? @KlSSYQUEER honestly prob not @dncetotroye @MarkRonson @dancetoIouis Done! @MarkRonson 😌❤️ @reveIation clocked 😔 you can delete this if you want https://t.co/XMHjEP3kki Find my secret fitness finsta challenge https://t.co/oq9xLfsm6c not yet! just wanted to say hi 🤪 https://t.co/UuFefcqNkH good morning! how y’all doin 6.2 million streams on @Spotify alone for I’m So Tired you guys aren’t playing around 😌😌😌 Translate this tweet and scream with me! https://t.co/zxWVUKJxYU @breaksforyou Are you kidding i wish my curls were that defined catch me and my new bf @lauvsongs performing our new SMASH “i’m so tired” on @JimmyKimmelLive feb 6th https://t.co/VbJBbcHF7p https://t.co/f4MHixgV83 Thanks mather for my life https://t.co/wg1jySIdsD I’m a jock now https://t.co/FEABwrAW0w Not to be a dick but is this not a chorus for the ages? RT @hypnotisedsivan: bratz dancing to i’m so tired by lauv n troye sivan\n\n#imsotired @troyesivan @lauvsongs https://t.co/YNzgNoKLtD @jasminsivan @lauvsongs Phase 2 OUT NOW BIIIIIIIIIITCH!!! @lauvsongs https://t.co/ZausSLY8mR https://t.co/g2QNUc4o0A @CodySimpson thank you king 😌 SCREAM https://t.co/5KwbrfzsN8 @troyestruth Omfg @SUBURBlX I mean tea but we’re infiltrating the l*cals with this one remember And maybe use the hashtag #imsotired on your stories so I can find you? Idk you do you 🤪 What you guys NEED to be doing is posting these cute ass videos on Instagram stories so I can spam the girls with story shares #imsotired ❤️💤❤️ https://t.co/x4C6JPExwc @lauvsongs We had to do it to em!!!! Going ✈️ trending https://t.co/ZausSLY8mR #imsotired https://t.co/5QJHf6hpZI @PopCrave @lauvsongs Thank you pop crave we really stan @troyestruth @lauvsongs CUTEST I’M SO TIRED OUT NOW @lauvsongs\n\nhttps://t.co/ZausSLY8mR 💤 https://t.co/sHbhcwt9Ga U UP? @metinthespring This was so informative I’ve never done Kimmel so thank you can’t wait to wake up in the morning and have I’m So Tired Be out. It’s a special one here’s a fun fact - this tweet from 2009 was promo for I’m So Tired by @lauvsongs and me which comes out in the morning! good times https://t.co/fpSWg1N4w1 I’M SO TIRED tomorrow @lauvsongs https://t.co/ig4vYU6ITO @lostinyourpain @odetobix tbh she won this one @POP2SIVAN we do @odetobix It’s called seizing the day Carly try it some time @trenchtroye Honestly feeling kind of well rested this morn hbu? @hypnotisedsivan @mamamellet @Shaunsivan We’ll miss you at the show!! Followed and speedy recovery ms megan 💗 .@LelandOfficial is So Tired https://t.co/g7jqpe3VR0 @HQSIVAN Jk yes please every stream is a gift i appreciate @HQSIVAN And I’M the local?? Yep!! 9am EST on the 24th https://t.co/EDLe8T7efS She’s a bop!!!! Like pop bop https://t.co/mp2nZ2n1v1 What do you wanna know https://t.co/gbH6QcT0md @hisgoodside https://t.co/noPixwfNmi I will dog walk you https://t.co/RIG1FYpKRX Real life songs that have real life emotions and memories stuck to em There’s @lorde and @coldplay shoutouts in I’m So Tired btw i love being a stan hurts like heaven, lost in the sound y’all hear sumn?.. RT @bIindeye: no one:\n\ntroye &amp; lauv: https://t.co/es55hwPEc5 @alessiacara you don’t know what sadness means\n'til you're too sad to fall asleep\none day I'll be snoozing peacefully\nbut surely not today sometimes my friend @alessiacara makes me cry https://t.co/uMDZaDMYh2 Hey sup? Nm nu? Nm. Nice..so who do u like? https://t.co/IBW5M4Q3qS RT @XCXBIX: i’m so tired - lauv &amp; troye sivan (2019) https://t.co/rM5GsSWkIF @abtflwrs No!!!!! Who do you think i am @BLOOMSlVAN Slay.. I am........so tired Yes ma’am! https://t.co/XOnzu4R6r4 @THEGOODSlDE Let’s celebrate that by buying my merch https://t.co/EiE7XRfAnW Happy bday to one of of my absolute favourites ❤️💗 https://t.co/YtFaPDIepm Very That till the 24th @lauvsongs https://t.co/W3HGhgHKD2 @heavenIyIove let it go johana I think I am! https://t.co/N5Gow6byya @carliehanson Love u carls ❣️ https://t.co/9wbxB6XQSB @Ietstopmybaby me rn https://t.co/TW1bmxdHz2 @troyestruth do you have legal teams to trademark things? bc i do. watch out try stop me https://t.co/jOX6r6d2Ky and ya name too!!!! suck on that well morg™️ i just did https://t.co/eg3NBiRSFN fr tho im soooooo tired™️ ps thank you for 2mil 😌😌❤️ Let us Infiltrate the general public. Together Guys not to be dramatic but this song legit is like an instant slapper RT @XCXBIX: troye n lauv: i’m so tired of love songs\n\nbloom: https://t.co/NXFoIABTuO @heavenlybws STOP I’m so excited for this!!! @harmlesstroye this is unreal. so so beautiful. ❤️💗 @laughingtroye @lauvsongs hey @lauvsongs is it too late to replace the single artwork? @healybix how do you guys make these so fast I’m @lwtluckystrike THIS is the content I come to twitter for @intotheblues @jasminsivan @lauvsongs ok I did my part @PopCrave @lauvsongs WE’RE COMING @jasminsivan @lauvsongs super good vibes only!! @jasminsivan @lauvsongs ok but just wait until you hear it... @LOVESlCKSIVAN @lauvsongs @Iauvtroye meli really willed this in to existence ‘IM SO TIRED...’ WITH @lauvsongs OUT JAN 24 https://t.co/5JQX36Nlk5 LUCKY STRIKE BTS #1 is now live on YouTube. Big thank you to @dropbox! 👙💓 https://t.co/Fo4tp9dYss https://t.co/MB6KX4kqIB @foreverinyours @bloomtothis ok! stream lucky strike! https://t.co/6Y65YRsBiT So random can’t believe we just did that @lauvsongs https://t.co/b0AWz5bwVn 🤪 https://t.co/sbakzt7ddG @SlVANXCX So leave me alone then https://t.co/e1PgwHtzqY in the tub watching the bloom video https://t.co/5i0nB6mVkz Oh she thonks? @sweetestpIums thonk u, next *THINK 😔😔 Favourite tweet of 2019 so far I thonk? https://t.co/3J6anIl1sX @sentimentmellet Elena I’m... @easeftbroods a certified serve i'm sure you've all heard this already but The Favourite is so brilliant. the performances are stellar and the story is riveting. don't google it before you go in, and absolutely go see it!!! https://t.co/BoLSpCUBBl NORWAY a dream has come true &amp; I’m coming @ you for the @Skralfestival! Tickets here i can’t wait to see you https://t.co/LBG9F0igp5 ✈️ @tiredsuburbia done! omg https://t.co/flZLQF1NHa @lwtluckystrike oh haven’t I??? @hvnlyway damn 😔 let me fix @stunsivan LOOOOVE @luckystrapon honestly how could I not follow after this @hesbeatrice maybe YOU snapped with these comments! @tojakeandamy @closuresivan challenge accepted! @itsnotlivingx ok deal @louvrely a star is born follow spree to promote lucky strike video let’s go! \n\nhttps://t.co/BozK74gf7g\n\nleave a comment on the vid and tweet me with a screenshot of it so I can find you 💫💫💫 LUCKY STRIKE 💫 OUT NOW\n\nhttps://t.co/t5XcOSmAen\n\ndirected by Emma Westenberg\nthank you @dropbox https://t.co/TtpMazUbFJ @vmas who made this gif i just wanna talk 10 MINUTES https://t.co/BozK74gf7g HELLO RT @XCXBIX: 10 MINS @troyesivan https://t.co/KS4XVkY5Ft 30 MINUTES 🗣🗣🗣 YOU DRAG, I LIGHT – one last preview now up on Spotify\n\n3 MORE HOURS: https://t.co/BozK74gf7g https://t.co/hoOQQKxIbK THE JEWEL OF CALIFORNIA  – TOMORROW\n\nStream Lucky Strike on Spotify for a NEW preview https://t.co/iVJOFyifdq 🔮 https://t.co/vy5oCeAbgu @PopCrave love this speedy reporting! You can set a reminder for the premiere here btw https://t.co/BozK74gf7g 🌊 @youngblou 😏 Stream Lucky Strike on Spotify for a preview of the video: https://t.co/iVJOFyifdq\n\nthank you @dropbox for helping this come to life 🖤🖤 SAFE LIKE SPRING TIME – TOMORROW. GET IN LINE NOW: https://t.co/BozK74gf7g\n\nHit that Set Reminder button so you don’t miss the premiere ❤️ https://t.co/kxgpBQJgRT @IMGmodels RT @lqbtbix: @troyesivan https://t.co/7Oo3JIPZuG Can we talk about my sister stunting on her first red carpet like THIS (https://t.co/ijO0yw62w8 thank me later) https://t.co/j4Rin9zPJ2 Anyone for round 2? https://t.co/eknULToP1C thanks for having me @goldenglobes! met @ladygaga so tonight goes down as a win https://t.co/CLQhb3ZQH8 BLASTING 1999 OMW TO GOLDEN GLOBES CARPET here we go! #GoldenGlobes2019 https://t.co/gRg0BWbYYI @intofooIs Very this hbu? https://t.co/0gzVfwYWV8 good morning! 🌞 you’re mine, mine, mine. tell me who do i owe that to? Last night @wmag https://t.co/ACWdyE0dku https://t.co/Hg4y0DF1sA So humbled to be a part of telling such a vital story and to be recognized by @Variety for the creative conscious in film award today 💓 Means the world. To the globes we go!!! Sorry this was literally filmed on a Nokia flip phone but being a part of @BoyErased and continuing to work w @TrevorProject has been the honour of a lifetime. https://t.co/7W7WYIfIM1 HAPPY NEW YEAR I LOVE YOU @tracobsprincess Everything i do i do it for you!!!!!!!!!! No tea no shade but who the fuck is that https://t.co/XES2PfQJNi @XCXBIX Mess OH MY GOD LOL i didn’t have a photo in my camera roll so i forgot but !!!!!!!!!!!! Yes this happened https://t.co/cBcdxOj471 Ended the year in paradise with family. Thank you all from the bottom of my heart for everything i love you so much!! Have a nice day and an even better 2019 https://t.co/DhpIMabP5m THANK U, NEXT https://t.co/0aCo4hVzTE Now we’re in the territory where things are secret again and i can’t talk about em 🤨 THE GREEK SOLD OUT https://t.co/weBF1Q4ZZc 1999 BY @charli_xcx AND ME. All my pop dreams came true https://t.co/rSR7WWBGeI RADIO CITY MUSIC HALL SOLD OUT https://t.co/ZzUxf7pv1x TOUR TOUR TOUR https://t.co/6rnkV3s3Mg BOY ERASED premiered at Toronto International Film Festival and i felt soooo proud to be a part of this movie as an actor and musician https://t.co/3tU4NPu4Xt THIS RESPONSE TO BLOOM ALBUM RELEASE https://t.co/FY9tNnOE0k BLOOM ALBUM RELEASE https://t.co/sbK92pvX3m ANIMAL 🖤 https://t.co/yyzFi2uyo6 Became a dad and met my best friend https://t.co/rDOvnpUFGt This serve of a video https://t.co/iUhE7gDK9f Camping w my best friends ❤️ https://t.co/0pGZls9dg4 Releasing DANCE TO THIS with walking icon and legend and exemplary human @ArianaGrande https://t.co/zITY18I9E3 Playing DC pride https://t.co/uBuVEXVXLQ BLOOM video release. So so proud of this one https://t.co/nRl4YtqwUS ANNOUNCING MY ALBUM https://t.co/w5OW8CWuCo WALK @taylorswift13!!! https://t.co/sqo2OxOQr2 Me remembering to put my pop star face on right before going on stage w @taylorswift13 https://t.co/rODNUGLZBP BLOOM video filming!!! Stunning make up by @JamesKaliardos https://t.co/mvmCY19Mqs MET GALA 2019 AKA BEST NIGHT OML https://t.co/XWuCQRRWzN This absolute serve of a lyric video by @jasonebeyer https://t.co/9SCvzeY5JW Met gala fitting https://t.co/pBn8XFouBa Shooting a cover for @GQAustralia! https://t.co/C0jiYauBfl Hitting this slump in the middle of the year and getting passed it https://t.co/IMxL9w51JI Getting caught in a prank by this woman pretending to be in labour and telling her ‘good luck, enjoy’ https://t.co/ltLmo4pVKX Announcing my fuckin DREAM collab w one of my favourite people in the world @ArianaGrande 💓 https://t.co/i1NAXPqs8n Being an 👼🏼 for @Dazed https://t.co/r39DGoKQuo Secretly playing bits of the album for you guys in hotel rooms https://t.co/hUJ6VtWSQA My first escándalo https://t.co/mbK36sTuF9 Being in a @MaisonValentino campaign https://t.co/O3tZCc8k8H Realising we looked like this if we put grapes in our mouths https://t.co/LxX7fuazSr SNL BITCH https://t.co/ZekeorsyOP Releasing my fave song I’ve ever written my dream video by @GrantSinger https://t.co/FqCOkWayKH Randomly flexing w a billboard in Times Square to let you guys know music was coming https://t.co/hl8YjwvboB Telling @gwynethpaltbro i was gonna be on SNL https://t.co/duGUmIZP0L HELLO HIGHLIGHTS OF THE BEST YEAR OF MY LIFE THREAD (2018) INCOMING: https://t.co/Ev5k1KcVHn @peachfooIs I’m perched..... Ok this made me laugh so it counts 💚 https://t.co/ZdBJ9vggpm QUEEN! Thank you Maddie!! https://t.co/OKalHlZnry @Iovelessed 😏 @TROYESPRlDE @mamamellet Too pure... @overgrownlove drop their handle I just wanna talk @heavenIyway I MISS YOU ALL V MUCH thank you for hangin while I take this lil vacation and rest up for next year 🤪 good morning to everyone but especially emma with this #Request1999 serve https://t.co/HtvWVK46Mh send me vids saying “Troye is coming to Hong Kong!” pls so we can make something cool and I can see u guys #TroyeInHK okay guys let’s do this again 😎 @xarrasivan SORRY I had merch to drop and I wanted to hang for a lil while but let’s both go back to bed now 😴 me scrolling through the #Request1999 hashtag @charli_xcx https://t.co/TcNpmYswqr @Iauvtroye YES meli!!!! @calshandtattoo @charli_xcx 1) you look SO good 2) thank you for requesting!! 💚🖤💚 @bandnitos @charli_xcx omfg @validatedsivan perhaps she’s back 🤪 I’m in awe..... https://t.co/CxevZET3bT @txphxr I would say yes https://t.co/V36cO3yorZ 👕 https://t.co/FMBSyele5d https://t.co/v6rdjhChg3 🖤 https://t.co/m3JnFl6niT https://t.co/QuBibFUXMW 🔮 https://t.co/zaOSszDNbs https://t.co/FH8Wqb09iH 👜 https://t.co/OuLMEXscCS Y’ALL WANT HER \nYes: 8%\nYes: 92%\n\nhttps://t.co/kiSdfUnsMn 🌸🌸🛍 https://t.co/l9avTG9YYM helloooo Argentina 🇦🇷!! Tix on sale Thursday Dec 20th @ 10am ART 🎉 https://t.co/AWdrc2pOVq @TROYESPRlDE deal What did she do?? THAT! Let’s all be a little more like Victoria #request1999 https://t.co/es7yV5XR2o @zachsang1 @_happilyhowell_ @charli_xcx KING @autroyegraph @charli_xcx I would but you don’t need luck! you’ve GOT this sam 😌 @Iikeyoutoo @charli_xcx mother nunu has taste! @heavenIydeath @charli_xcx do it and record it and post a video so I can RT!! she’s rising 💚🇺🇸 @charli_xcx tysm for requesting let’s keep it up!! https://t.co/hqyL2DeJPE BLOOM TOUR 🌸 SINGAPORE\nPRESALE NOW LIVE:\n\nhttps://t.co/VURDEu8qv8\n\nCODE: BLOOMASIA https://t.co/pNo2Sb7pTv which Europe show do we reckon is going to completely sell out first 🧐🤔 BIRMINGHAM, AMSTERDAM, COLOGNE AND STOCKHOLM TICKETS ARE ALMOST SOLD!!! So guys I just heard back on some of the numbers for the Europe leg of the  Bloom tour and we’re almost sold out of a bunch of shows!!!! pls send me some vids of u saying ‘Troyes coming to Singapore’ using the hashtag #troyeinsingapore 🇸🇬 ill owe u big time Singaporeeeeee its almost ur turn, presale for the Bloom tour is coming up sooooon @easeftbroods stream 1999 also who did this https://t.co/UvrwTDMkcz can't even begin to explain what this means to me and my collaborators @LelandOfficial and @iamjonsi ❤️ Thank you to the HFPA for the truly massive honor and to everyone involved with @boyerased. Life’s crazy Going ✈️ EGOT Was about to fall asleep back at my house in Perth for the first time in like 2.5 years and thinking about how much life has changed and somehow stayed exactly the same, and then got the news that Revelation was nominated for Best Original Song by the @goldenglobes ..... https://t.co/NZV5EbusgY @XCXBIX lil bit! Promise I’ll say something eloquent and sweet about it soon but for now what the fuck!!!!!!!!!!!!!!!! GOLDEN GLOBE NOMINEE KHKGJTJFJGKGMHMHMGMHMG WHAT THE FUCJ https://t.co/KAfSy3DEkb @LelandOfficial @tyleroakley SCREAM JAPAN PRESALE STILL ON GUYS USE THE CODE BLOOMASIA LOVE U ALL \n\nhttps://t.co/Jg1xfT1uSx \n❣️🌺 https://t.co/Fc0V06yZha @jasminsivan @charli_xcx @997now thank you @997now !! 🌁💚 Alsooooo omfg 1999 impacts US radio today! If you hear it, tweet me and the radio station so i can say thanks 😌💚 @charli_xcx What’s your favourite track btw? Wrong opinions get blocked Three years today since Blue Neighbourhood came out. Three YEARS i could not believe it :// I owe so much to this record. Hope it means as much to you as it does to me 💙 fuckin love you btw #3YearsofBlueNeighbourhood https://t.co/xdzEBgd9IX RT @thynne_sarah: @troyesivan Going to be you when people start saying they got tickets to your shows https://t.co/9MC8raK2ET https://t.co/wNPyEFAWM4 https://t.co/jbMrXb3Y7K GUYS PRESALE FOR MY TOKYO BLOOM TOUR IS STARTING 🌺❣️ ❣️❣️❣️ https://t.co/AgUA5ivQpL JAPAN i've got some cute vids but i need a few more. pls tweet me a video of you saying “Troye is coming to Japan” in Japanese and tag #troyeinjapan 🥰 @Into This literally can’t be real I’m scream @Calum5SOS Thank you king i made it myself!! ❤️❤️ ❣️🌺 BLOOM TOUR ASIA 🌺❣️ https://t.co/ivSKS6B7Cy u guys want dates on here as well? ❣️🌺 BLOOM ASIA DATES ARE NOW LIVE ON MY APP 🌺❣️ I will release tonight if you pay me in retweets 😌 https://t.co/NYFqZv5wly .@MaisonValentino 💚💙 https://t.co/MMCoe6OMTg ツアー 🌸 https://t.co/bXKk9JYIlG Dang it’s like that?????? ❤️❤️❤️ https://t.co/ZljUb6IErZ pic of me hiding in the bathroom from my BULLY @ArianaGrande. thank u, next https://t.co/EC9RRpATMx RT @GQMagazine: .@TroyeSivan had the type of year people only dream about https://t.co/pX8tbPYTvq https://t.co/A8Dt69iwkV Ol grump in @GQMagazine 👹❤️ https://t.co/ys6D5vzZVG @Iovedafter My exact mood stan list ✨ @camilaxtroye But I’m sorry to hear that and i love you!! @camilaxtroye This made me laugh lol bkgkgjfjjf the hearts 💓💓 I think maybe alcohol is the culprit tbh even when I’m mildly hungover it makes me emo all day anyways love ya thanks for your words of encouragement @teukhobi 💞 No real reason btw. Mostly wanted to tweet this to make it so! I feel sad and anxious today and that’s cool and fine #ARIAs https://t.co/7EOyQrXeoS .....fuckin sick ❤️ https://t.co/D72vJkkQFz .@charli_xcx https://t.co/wDZmCMAGA8 Bye I’m outta here omw ✈️ home country https://t.co/zKkebcJipj I can’t wait to have brown hair again tbh!!!!!! where i'm at https://t.co/Yy7HujLJil go off a bit! https://t.co/vXBnScDouw Send tick pics ❤️❤️ BLOOM TOUR - UK &amp; EUROPE\n🌺 ON SALE NOW\n\nhttps://t.co/cljmesY4nt 🌺 https://t.co/WqcJgOSidq https://t.co/za9gite12H AND ARGENTINA https://t.co/orFQYEUewx AND CHILE https://t.co/1wVjM1nfCw I’M COMING TO BRAZIL https://t.co/xxIetqXFzx https://t.co/v9b2mLYfcJ @ArianaGrande Your dads First time hearing it without a bunch of parents singing along to it at a wedding/bar mitzvah and it slaps! ‘Come On Eileen’ is on the radio and i have chills at what a perfect smash it is FYI hello! https://t.co/GSroVFNeiY @doppelsangster patience andy im only one boy @ethereallytroye 💖 Okay dm me your Paypal and how much u need https://t.co/QKYa3vFVCU @nashvillesuit @POP2SIVAN I’m considering blocking BOTH of you now I SAID download my app and use pre-sale code bonjourbitch to get tickets to come see me in Europe https://t.co/lsOXeY3V3U well hello let’s celebrate that! https://t.co/JgzwJShiRN @onlyangelics On his way to a shoot https://t.co/4K5JKvHQ82 Prove me wrong I have the best dog in the world @thynne_sarah yes sis!!! @cmbadkins a solid 1789789346897 counting down already!! https://t.co/OwopHF8xfR @bigsleepia yay im so happy we are going to have the best time real bts footage of me brainstorming tho https://t.co/rdj8QWoTVY i actually cannot wait it's going to be so insane https://t.co/NIeJF4cvu5 AMSTERDAM TURN UP 🌺🌺🌺 https://t.co/f63b4jAVRM RT @SUBURBlX: @troyesivan LONDON VIP BITCH SEE U THERE🥰🥰 https://t.co/JX8ncWehzT YESSSSSSS OSLO IS GOING TO BE A PARTY https://t.co/2QExVrGzNg @Iovelessed not where i am thank u very much guys pls pls pls show me once you've bought tix guys im so excited @flowersforbloom yah i know but i thought it was cute as hell 🌺🌺🌺🌺 https://t.co/B05jYCeeJh 🌺🌺🌺 https://t.co/8MB4A2REET I'M WEIRDLY PROUD OF YOU YOU GUYS ARE NUTS FIRST WEBSITES NOW THIS PRE-SALE CODE AND LINK AVAILABLE THROUGH MY APP RN 🌺 BLOOM TOUR UK/EU PRESALE IS LIVE !!! 🌺 she's up!!!! @thenameismaja woah 2015 thats so nuts to me @flickerlalisa 9am!!!! for everyone asking for more info, the pre-sale code will go live on my app to use at 9am GMT on Tuesday 🌺 @odetobix there's more 🤪 @adoredtruly wait was it scary or like fun? @strrrrre presale code will be uploaded to my app on Tuesday girl @sailor_sofi patience Sofi i promise i haven't forgotten u guys i see u Imagine not having my app installed right now :// its going to be a PARTY i can tell u guys that much @remdrops we love dedication @prideparades thanks for ur positivity bb it warms my heart 🥰 @brinassivan can't wait to see u Siena we gonna DANCE and guys, this is seriously only the beginning I AM SO FRICKEN EXCITED ❣️❣️❣️❣️❣️❣️❣️❣️❣️❣️❣️❣️ 🌺 UK &amp; EUROPE // BLOOM TOUR 2019 🌺\n\nAPP PRE-SALE TUESDAY\nGENERAL ON-SALE FRIDAY https://t.co/EBpYHlgb2v its time guys have you ever had sex WHILE listening to bloom by troye sivan https://t.co/HiZJ0ngP3L @yosoymichael Fight me here to say Miley Cyrus and Her Dead Petz was ahead of its time I want an @OculusRift soooo bad. Does anyone have one and if yes do you love it @mindsout yes ma'am ill try my best @ripestpear on the way! can't wait to get home and see u Australia 🥰 https://t.co/lsznTfMjas https://t.co/y0Xi7jJjvk @Iovelessed omg make sure u tell me what u think @troyefeatcharli rn its ‘Lucky’ 💖 @dualiper @girlskiwi haven't forgotten u guys dont worry @girlskiwi shes back @feartheracists how about i tell u the tour dates *on* MyApp™ @troyestruth okay okay so next week then @arianaIipa exciting news! but for REAL guys we have soooooooo much exciting news for u this week @puppysivan bb i just finished! @Roberto_GmzA hi robertoooooooo @tantrumtrench soon @COLOURMEBIX if u delete it u might not see the dates tho sooooooo 🤪 @toogoodtobetris manners charl! @sivansense my queen @dreamy_rem i know its been a while sorry i have been busy with important things @myluIlaby i feel like maybe i should wait a few days @Iostroyeboy patience Ally girl @aIltearsleft soon @heardtroye heck yeah i am @brodie_hewitt hmm when do u reckon i should drop em? @troyesthatdance way ahead of u 😏 1999 is top 20 in the UK https://t.co/snWP28zOWE Heart swell ❤️❤️❤️❤️❤️ @TIME https://t.co/1jFw5uU4uI ‘Business casual’ https://t.co/6QSQAa8DiP Troy Sivan :// https://t.co/1swoyRzOpu We love a fine wine.. https://t.co/F4SOjkBx15 This is the kind of energy i want to see in my replies. None of that demon shit!!!!!! https://t.co/InHbDZFF1P @jamescharles I’m sister stupid Stayed awake to really steep in the anxiety https://t.co/l40Zt1M5Rg @simpIemistake My vibe @fazedme Hold hands with me on this journey i am on do not be VICIOUS!!!!!!!!!!!! I was today years old when i learnt that makeup is one word https://t.co/nyBKe9qa68 @bIoomsforsivan @FallonTonight @HELMUTLANG Fall asleep w it wet and a curl primer in and then wake up w crazy curls and tame them and then put secret bobby pins to hold pieces in place that you love It’s make up hun i got spots on spots rn https://t.co/ChZLjvp9Ha 💛🚼 @FallonTonight @HELMUTLANG https://t.co/dGNdQvXpdy Also could be worse. This dog bout to save the day!!! https://t.co/BUpkRV0fME Going✈️back to sleep to try hit restart on this day woke up mega anxious for no reason let me hear you make some NOISE!!!! back at it again at @FallonTonight 🤪 See you at 11:30pm est! https://t.co/QQ2V9gqgHV Omfggggg https://t.co/DOnOKwNSog Back on Fallon AGAIN tonight!!!! When will the press give me space https://t.co/a7hGlbLyfF Not to flex but (!!!) https://t.co/wrKiirwp0b @charli_xcx @FallonTonight https://t.co/sBWLndTZaH Hooooooooome Jerome https://t.co/5pMmwhcc5H @troyestruth https://t.co/pRWThPi7vr @DANCESlVAN https://t.co/HE5pL2KHdY @DANCESlVAN And lose my verification? Nice try demon @llondyy Delete Troye 7 @easealyssa I’m tiiiiiiiiiiired. Been a busy few weeks but I’m so happy @Iikeyoutoo Just the light/my face https://t.co/tlZIuO2JMA @shimmerfools Scream u right @bIindeye I’m tipsy and sleep https://t.co/iyno8Ust6G L’chaim to all https://t.co/gF4FVgqQPk Living large drinking champagne https://t.co/mq7s2wCApO thank u for having me @jimmyfallon https://t.co/fbCFZeE4qD Michael Buble covers the #1 song in the country https://t.co/SfNdsbenYi That photo is real!!!!!! Here’s the full image https://t.co/RZdvIXfJE4 @SlVANXCX She told me to tell you to stream it big democracy energy https://t.co/hEkxZux81y 💚💚💚 @charli_xcx @FallonTonight 💚💚💚 https://t.co/03ji7jEU74 RT @FallonTonight: We have a great week of music lined up feat. @charli_xcx &amp; @troyesivan, @muse, @TheStruts &amp; @KeshaRose, and @MariahCarey… Honestly felt like spooky gay magic. Thank u, next! #EUROPE #ASIA #AUSTRALIA #NZ #SOUTHAMERICA #BLOOMTOUR https://t.co/4mjd2wmkmZ Such a fun last show last night in Vancouver. Thankful to this incredible team of people who are so unbelievably hard working and talented for making this tour possible every day. Thank you to you guys for showing up every show and making memories w me that I’ll never forget. @TROYESPRlDE lemme check! @odetobix Lol someone sent me these screenshots! North american bloom tour ends today https://t.co/505Iu79G3n THE FATTEST MOOD https://t.co/E6ZcHDcp06 💚💚💚 so excited for this one @charli_xcx @FallonTonight 💚💚💚 https://t.co/K62u3Ix7lN got some other non chicken related news for u all if u want?? @adorablebix @bonappetit i cannot!!! sooooooo i know i promised u guys a potato salad vid but in the meantime feel free to watch me try to figure out how the heck to make chicken under a brick w @bonappetit 😂 https://t.co/zaUNfIOjpl https://t.co/woBATAB8k7 if u didn't get a chance to see the show you can still grab some merch over on my store here: https://t.co/4gwaXTbTSS guys can u even believe the NA leg of the Bloom Tour is almost over?! what the heck thank u, next I’m never touring again GUUUYS jgkgkgkdjdmnshajskgkkhkh https://t.co/OPEKjGc0Jj This one’s cute tho love you guys https://t.co/OyWZXRQkjy SCREAM https://t.co/YQnDqc79Vf Why is this sooooo my bloom tour mood hkgkfjjfj https://t.co/I0OlSOGfkx Sad bad sad frown cry https://t.co/UkCbnb5AIR @arigoggles Gjgjgjgkgkgmgkkgkgkg ari Go stream it i love you ❤️❤️ ❤️https://t.co/JBXYb24dml ❤️❤️❤️ WELP IT’S OUT!! Surprise I covered Somebody To Love by Queen for the @BoRhapMovie soundtrack album ❤️ https://t.co/sWP6XXkpjU @dietocareforyou He stood on a spikey plant i think can u guys believe #BoyErased starts it’s roll out tomorrow?!? @bixevan 🧐 here’s a sneak peek for u https://t.co/Hwb58JNAJ9 https://t.co/BTYoz3fZc1 @whataluckyplum felt cute @odetobix yes pls @odetobix why @jasminsivan 💚💚💚 ALSO SAN FRAN IM OMW!!! 1999 BY MISS @charli_xcx AND ME HAS BEEN ADDED TO TODAY’S TOP HITS ON @SPOTIFY 💚💚💚 WELL HELLO LET’S CELEBRATE THAT WITH A VERTICAL VIDEO BY @joachimjjohnson https://t.co/Hwb58JNAJ9 BOY ERASED IS OUT TOMORROW IN NY/LA/SF OMG https://t.co/bBJE2pDxem LA LA LA https://t.co/vjLmjrvLq0 @Iovelydreams See 1999 music vid for inspo Cuties! https://t.co/6jZusHlMHx @validatetroye Sachin I’m on TOUR @validatedsivan absolutely not @ilysbtia whatever feels comfy and you can dance in @bIindeye ive got speedy eyes @LunaPauly_LTCS I don’t recall promising anything of the sort @troyesfine working on it guys be patient with me @feeIingIoved haven’t forgotten you guys were such a blast!!! @troyesfine I think only when the mood takes me @onlyangelics maybe baby @DANCESlVAN SO INSANELH FUN guys this tour has *flown* and actually cannot believe how soon the LA show is 🤪 Anaheim was seriously fun last night 💚💕💚💕💚💕 https://t.co/gxZw2VInG4 If i seem pressed i swear I’m not bc i really do love my body and i have been hearing stuff like that my whole life but i DO want the retweets so i replied Seen this shit on tumblr w like 60k notes. Lemme know when you guys learn that it’s weird to talk about someone else’s body/learn to love my body as much as i do 🤷🏼‍♂️ https://t.co/7JABkxNuu1 @bloomlipa Our minds Took too many vitamins tryna get better and they made me vom love that xx @troyeskiwis #1 @COLOURMEBIX im off the rails @shelovescntrl i try @easeIy i know and i seriously appreciate it @mixaelii / australian vpn @onlyangelics happening sooner then u'd think @heavenIyway omg sneaky i love @shimmerfools i mean i think so but idk @fazedme amen @luckyjeweI love u boo also guys im pretty sure only aussies can vote 🙄 @lgbtfranta happy bday girl Song of the year is decided in a vote by you guys so if you want to vote for me or any of the other nominees you can head here:\nhttps://t.co/5rhelFiawX #ARIAs a little belated but i wanted to say a huge thank u for the nominations for the @ARIA_Official awards including Album Of The Year, Song Of The Year, Best Male &amp; Best Pop. I'm super honoured to have been nominated alongside such amazing Aussie artists 🥰 #ARIAs @wahwtdstyles 💖 @tracobs_booty what? LA, to attend the free advanced screening of #BoyErased on 10/30 this is ur link! https://t.co/rc6uepynb5 NYC 🍎 if u wanna attend a free advanced screening of #BoyErased on 10/30 check out this link https://t.co/cA1b2rseNd got a lil something for u guys in NYC/LA Hello Phoenix just had a yum breakfast and I’m excited to play a show for you tn @Iauvtroye Omg lol❤️❤️❤️❤️ @lovetoIust no @easeftbroods bc all these girls TRY ME @sweetestpIums @shimmerfools WHEN IM DONE @shimmerfools who says im not GOING THERE for the SUMMER can i LIVE @puppysivan the southern hemisphere says hi hunny checklist by @Normani and @CalvinHarris is the song of MY summer wbu @bran_don @alplicable 2018 is the year of the vers @lluckystrike pls and tag me in a vid @californiajeweI nah im stalking some of u bopping to 1999 on insta @odetobix Nash is chillin thanks for asking https://t.co/V4AVCjJ9rq @darIingbix 😏 @SUBURBlX im re-reading the kite runner rn if that’s any help @fazedme i don’t think I have that power @bwaytroye @EmmaConfetti and I went and bought some books and sat in a park and read @youweremyspring wait what lyrics were u singing??? @mila_otb how crazy?!? also thank u so much for all the love Revelation 🍂 having such a relaxing day in Denver @adorablebix You know i never do in the end xxx @kiwisivan It was so fun spending the last few days seeing your cute face!!! @melletsrose Haven’t soundchecked yet hun xx Need to shave gonny delete later xx https://t.co/KaMmqBJDkT Chicago!!! We just opened up a few more tickets for tonight if you missed out on buying first time round!!! @odetobix @luckyjeweI what is this photo copping the gorgeous vinyl bundle https://t.co/oBSM7eL2gC https://t.co/gugCXehja9 my fave @TydeLevi song now has a gorgeous video to match. hop on this train asap https://t.co/tGSz1tRfev @easeIy I’m sorry i didn’t visit you in NY. I remembered after i had left and had a nightmare about it. Happy to see you still love me @fazedme I’m under the weather in bed today so maybe just like a nice candle @simpIemistake Just like 3x more than i do off the road. I think doing the shows has made my appetite bigger @sparkupbuzzcut Literally when i put those on last night i was like dang these must’ve just been washed bc they are TIGHT. Maybe I’ve just been eating good I love you legit Makes me fired up and feel like i could do this forever Thank you for caring about me and my music and for listening and for making this music a part of your life BLOOM has over a billion streams now across all platforms?? And that’s YOU....like damn.......your power Hey guys did you know that uhm..... @sushirolltroye @velvetfools Carmex has menthol in it which irritates your lips. Google it apparently i mumble so here!!! https://t.co/T1SbGP7wpX RT @etnow: We’re going purple for #SpiritDay with @troyesivan and the cast of #BoyErased. Let’s support #LGBTQ youth and take a stand again… okay guys im off to bed thank u for everything 💖 Love u guys ❤️ @ZoejoFashion amazing!!!! Surprise came early!! Revelation by Jonsi and myself from the film @boyerased is out everywhere now and i’m beaming with pride! Also today the song got nominated for Best Original Song at the Hollywood Music In Media Awards?? Thank you!!!! ❤️ https://t.co/FWwWTIOskZ https://t.co/ZmHwYkBBNp THANK YOU MINNESOTA!!!!! https://t.co/jqPkG0Irc7 Minneapolis tonight!!!!!! https://t.co/yGhfR40mpl Bye NEVERMIND I THOUGHT IT WAS THURSDAY LOL 5 minutes till something special @LiveNation 💛💛💛 Should be all fixed!!!! Go go gooooooo ❤️❤️❤️ https://t.co/IGddSCk6QF Hold up one sec pricing is out of whack on some items 🤔🤔 brb fixing!!!! https://t.co/O0yENOcl4p 🤪 for everyone that’s been asking for tour merch 👀 soooooo alsooooo we’ve got some exciting news announcing today.... 👚👕👖👔 Minnesota we’re on our way to u guys 💫 https://t.co/JZcaZYuFmU Toronto thank you so much!!! https://t.co/1AVA3gwcPf @puppysivan you owe me $2 @puppysivan he did not also recipes https://t.co/oxPWqxCqmz testing recipients https://t.co/kA1XEVc7NR EXACTLY THIS https://t.co/Emz9BbMz4f I am a bag of rattling bones on stage and......i love it! @arianaIipa challenge accepted doll @WIGSIVAN guys stay dry out there!! @caIumreign omg did u like it??! @peachfooIs I see u guys I promise x @mindsout Ela I have been v busy on my tour also who’s coming tonight? @bloomfortro Tell your mum thank u 💕 @RejectGamer omg why @easeftbroods delete this @intoyouriya Heck Yes you should @sleeplessphiI you’ll have to tune into my video to find out @isabel_schantz potato is a universal gift isabel I’m thinking of making potato salad but like the ultimate potato salad guys would you be interested for me to make a cooking video @_Hanners19 love these thank u so much for coming!!! @reveIation soon Priya, but idk maybe I should just put it up tomorrow? Toronto I just went to Fika and had the most delicious fennel salad RT @BBCR1: Vote for Teen Awards Social Media Star! Tweet @BBCR1 + the # of your choice:\n \nFor BTS: #R1BTS\nFor HRVY: #R1HRVY  \nFor Billie Ei… also thanks to the cuties who came to soundcheck 💕 whos coming to the show tonight?!? guys I’m so excited this venue is insane @WIGSIVAN @voguemagazine Carmex dries you out!!!!!!! MY DREEEAAMMM https://t.co/PkbVF3Tc9i thanks for having me @voguemagazine ❤️❤️❤️ BOSTON BTW ARE YOU GUYS READY RT @UniversalPicsAU: Hey @joeledgerton1 fans! We have a special Q&amp;A happening with Joel this Monday Live on Twitter for his new movie #BoyE… Tea! https://t.co/5XvsGrrEax MONTREAL thank you for suuuuuch a fun night. Can’t wait to come back soon RT @BoyErased: The world may want to change you, but no one can erase who you are. This #NationalComingOutDay, we celebrate the #LGBTQ comm… @luckystrapon 😅 @lNSUBURBlA Amen sis YOUR BLAIR WITCH MOMENT https://t.co/H40IEKgZK3 RT @charli_xcx: THE 1999 VIDEO FEATURING POP LEGEND @TROYESIVAN HAS ARRIVED!!!! I LOVE THIS VIDEO SO MUCH!!!! CAN U NAME EVERYONE IN THE VI… @youweremyspring THE WHOLE VIDEO IS Nothing makes me scream like this video @youweremyspring MARTYYYYYY @odetobix SCREAM 💚💚💚 IT’S OUT!!!!! THE 1999 VIDEO BY @charli_xcx AND MEEEE  https://t.co/VdhOJcGCtH 💚💚💚 Also, woke up to the news that we got 4 (four!!!) @ARIA_Official noms. Pop release, Male Artist, Song, and Album of the Year!!!!!! ❤️❤️❤️❤️❤️ thank you thank you thank you!!!! 💚💚💚 1999 VIDEO DROPS TODAY 💚  6PM UK TIME / 1PM NY TIME / 10AM LA TIME 💚💚💚 you guys aren’t readyyyyyyyy lol\nhttps://t.co/Spj1TC50b1 https://t.co/E26zYc0tyc RT @charli_xcx: 💚 1999 VIDEO DROPS TODAY ANGELS!!!! 💚  6PM UK TIME / 1PM NY TIME / 10AM LA TIME!!! ARE YOU READY??? 💚 \nhttps://t.co/vDnA1En… who am I seeing  in Laval???? https://t.co/UmnRnakrwc @tfio_5sotroyler cutie!!!! @troyeshalcyon em seriously thank u can't wait x @braunrl can't wait to dance w u Rach @validatedsivan BECAUSE ITS IMPORTANT @trynabetroye so soon!!!! @TRUCENICOLE @ntrlblk YES like i actually can't believe this is real life i'm having so much fun WHO'S COMING TO THE UPCOMING SHOWS I WANNA HEAR FROM YOU GUYS NEW YORK THANK YOU https://t.co/4pRUHMkDqQ @duaflame Love you bitch i ain’t never gonna stop loving you bitch THOSE DAYS IT WAS SO MUCH BETTA @FckyeahCharli OMFG RT @girlskiwi: a glow up https://t.co/ZljZpY3REi RT @charli_xcx: 💚 1999 IS OUT EVERYWHERE NOW 💚 RT IF U LOVE ME 💚 RT IF U LOVE @TROYESIVAN 💚 RT IF U WERE BORN IN THE 90S 💚 RT IF U LIKE TO… @Iovebanks u first liz @loonatroye i cant but they are so GOOD @jsweens21 exactly @lucasnlinhares this is what i like to see 💚 1999 BY @charli_xcx feat. me IS OUT NOW https://t.co/Gnj2Izs926 !!!!!! 💚 https://t.co/HZ6vfEHkWU RT @charli_xcx: 💚 1999 WITH @TROYESIVAN IS OUT NOW!!!!! RT RT RT!!! LETS PARTY LIKE ITS 1999!!!!!  https://t.co/f3J7pQaQi6 💚 https://t.co/U… I AM ALSO SORRY FOR YELLING LITERALLY I COULD COPY AND PASTE THIS MESSAGE ABOUT CHARLI. CHARLI IS A TASTE MAKER AND WORLD CHANGER AND VISIONARY AND I LOVE HER AND AM HONOURED TO HAVE HER AS A TIME TRAVEL PARTNER https://t.co/KTYzwnwQs2 we have some big ass surprises coming to @radiocity so get ready guys not to alarm you PRE-SAVE PRE-SAVE PRE-SAVE https://t.co/TqTvWOoEz4 https://t.co/2XabvXoEXr let's fuckin ride!!!!!!!!!!!!!!!!!!!!!!!!!!! 💚 1999 OUT FRIDAY BY @CHARLI_XCX AND MEEEE!!!!!! 💚 https://t.co/qcKnzGXr9S Back where!!!??? 🤪 https://t.co/ZqgDyRElDu mmmmhmmm Charli? 🧡 https://t.co/SGtTmM4ZCJ Who wants pumpkin pie @heavenIyplum Just spooky idk happy october Spent my two off days carrying my wine glass around ATL. See you tonight!!! https://t.co/rh05aKXtgk @aidan this is real pretty i keep listening make an acoustic EP @cyberaIIison I wanted to on tour but everybody has different phones and i felt homophobic only selling one kind. So maybe I’ll sell online where you can pick from a couple options?? click if u wanna listen to me have a little chin-wag about covering Posty's 'Better Now' 💥https://t.co/BzhMQUZ0hi https://t.co/9oW1z7JBUJ Sometimes it’s like that https://t.co/w8djmuvPon @bIindeye NOOOOOO LOL OMG LOVE YOU Houston by @joeytortuga 🖤 https://t.co/dsu7DHFCjh in every city on the Bloom Tour u guys can bring new socks and new pads and tampons to donate for LGBTQ youth. I’m collecting them for @allycoalition and the legends over at @corawomen and @bombas are going to match your donations ❤️❤️❤️ quick but awesome psa guys Tongue trills in Houston tn. See you sooooooon!!!! ❤️❤️❤️❤️ https://t.co/UGsJ4wsgAf I love you guys. Houston I’ll see you tonight!! https://t.co/EnsiasOgFz TURNED AUSTIN INTO A CLUB. NEVER EVER WANT THE BLOOM TOUR TO END. I’m screaming https://t.co/KUPMI5FyWp @heavenIyway Omg nooo Paige ily it’s so fine!!!! I get you completely and promise the tees feel so nice Austin tonight’s venue is soooo perfect for the show. Can’t wait to dance w you!!!!!!!! @heavenIyway i love thin vintage feeling tees and picked the blanks myself to my personal preference. Hoodies are nice n heavy if that’s what you’re after 💓 THE MOST EXHILARATING NIGHT 1 ❤️❤️❤️ Dallas thank you thank you thank you for the warmest welcome back to the road. Can’t believe this is my job. See you tomorrow night Austin!! Photos by @elisanhobgood and  @joachimjohnson ❤️ https://t.co/GTnAALGMzY DALLAS I CAN HEAR YOU FROM MY DRESSING ROOM LOL I LOVE YOU ALREADY SEE YOU IN AN HOUR i'm so excited to gift myself my entire merch line tonight TONIGHT'S FESTIVITIES INCLUDE: \n@LELANDOFFICIAL at 7.30PM, \n@KIMPETRAS at 8.05PM,\nthen i'm on at 9.10pm 🤪 💓 #BloomTour psa: my parents are not gonna be picking people from the crowd for m&amp;g each night bc they wanna actually watch the show lol so it will be someone else might?? commit melissa https://t.co/rfITaU7A0N THE BLOOM TOUR STARTS TODAY SCREAM SEE YOU TONIGHT DALLAS SCREAM https://t.co/83J59tL86R @1993vante @sweetfevers True RT @HYPEBEAST: Ahead of @troyesivan’s BLOOM tour, HYPEBEAST brought together Troye and rapper @kevinabstract to discuss collaborations, mas… RT @beckoningangels: #NashOnTour Tickets are available now! @troyesivan \n\nhttps://t.co/oeOuiNQpy8 https://t.co/4cTCFPpEnD What the hell is this lmao https://t.co/xnHY3EaYZK @trashforholland a style icon @odetobix none taken i totally get it @GottaGoOakley honestly i think we probably should #NashOnTour https://t.co/v1bznMt19K @emmxfield thank u for listening 🖤 @troyeftgordi 3739499765434x @clarejones__ yes @lix3ly i cannot even believe it for everyone asking Nash is excellent and looking forward to starting work on tour rehearsal life is kinda nuts rn guyyysssss sorry i haven’t been on here for a bit @magalunaaa @validatetroye These melodic choices.....this voice......... cover the whole album got something here to lose that i think you wanna take from me The merch line for tour is the cutest i can’t wait for you to see https://t.co/x1uzBAdsEu THE BLOOM TOUR STARTS IN 8 DAYS MOM @pandoramusic gave me some paints and asked me to paint the stories behind Bloom which was dope. Listen along to the vid here https://t.co/viwgfAL3rh🌸#PandoraMusic https://t.co/6mA5gz6dhJ Toronto what’s good come see my movie https://t.co/5AVDqdOWGA Can’t believe but I’m omw to the @BoyErased premiere at #TIFF 🤪🤪🤪🤪🤪🤪🤪 Chag sameach and Shana Tova to all those celebrating. Hope this year is your best yet ❤️❤️❤️ @aworldaIone @TwitterMusic &lt;3 another cute lil vid from @TwitterMusic for u guys &lt;3 #Bloomalbum https://t.co/oBL0I5jkcL Bout to perform on the @ElvisDuranShow !!! Tune in to Z100 to hear 👂🏼 💓💓 https://t.co/zSdKiY48Rw Very stoked to have made @vanityfair’s best dressed list for 2018 💙💙💙 Photo by @terrytsiolis, wearing @walesbonner and @ysl https://t.co/bdkFyuiAwn BLOOM TOUR IN 16 DAYS https://t.co/EzbvqsLUYY She’s up and at em and at @LiveKellyRyan!!! Tune in now!! 💓❤️💓 @AshLondonLIVE @itstomwhitaker nawwwww guys this is so CUTE thank u 😎 https://t.co/h5wxeZW8rK can’t wait to come and hang with you NYC !! ❤️🌺 https://t.co/JSiub4MLSm so so so happy, Postcard (feat. Gordi) made #TheBeats1List 🌺🌺🌺 Hear it on @Beats1 this week! https://t.co/OAj51QfscR https://t.co/CKd318Sw7w big day today @velvetfools @mamamellet Holy shit!!!!! Love love love you @Ietstopmybaby Famous No lol I’m just on a plane and bored as sheet https://t.co/qsassPO5mO LA ✈️ the world 🌟🌍🌞🏝 world traveler 😊🍃🌈🌸 i am a citizen of the world 🗺 💓 @DANCESlVAN maybe tomorrow i think @artsyaIyssa omg @cactisivan OOOoooOooooooooOOhhh good ideaaaa tee feat. my face x 3 https://t.co/4By2hkKKr1 hoodies on their way also but the tee is dope so that's coming first btw guys ive got a cute new tee design coming out soonish for u @fazedme kayley let me LIVE @girlskiwi you are both so pretty !! @Ietstopmybaby send me a pic when it arrives!!! i haven't even got one 🧐 @skylinefools @dreamingfools heck yeah what a day @bwaytroye can't believe she doesn't have it already tbh @dreamingfools just hanging out at home lurking a bit hbu @rainstormsswift so pretty @LegoTroyeSivan i see no difference @BoomBoomChris @BoyErased have fun!! @FIYAPWOOFSIVAN @ShineOfTroye These are all songs written in sessions from like 4 years ago to recently. Nothing to see here ☹️ RT @bIoomtrack8: me when i finally get my bloom cd https://t.co/X7LhW48VAy Bloom is out everywhere, tour starts in 19 days, AND i found my light?? Life’s crazy https://t.co/RcJliaksdl LITERALLY 10000% https://t.co/Xb18THgXVb @amazonmusic 💖💖💖 RT @easealyssa: just saw #bloom in urban outfitters!!! @troyesivan https://t.co/0fs7ofA5JM i havent had human interaction with anyone in 3 days except for a man who sold me my own album whats up RT @troyesaltar: me listening to bloom https://t.co/BgkRzxYhXE @puppysivan WHO is the girl at 14 secs who goes ‘ooohhoohoohoo’ forever is in your eyes, but forever aint half the time i wanna spend with you 💓 @Iovelydreams OMG HAPPY BIRTHDAY MUMMA I CANT WAIT TO SEE YOU &lt;3 &lt;3 &lt;3 (the lyric is ‘I sent you a postcard from Tokyo baby, you never picked it up. I even wrote it in Japanese baby, you didn’t give a fuck’) Afadafagsvsga this video of people listening to Postcard for the first time made me wheeze today https://t.co/huhaxXN4My @danceinmystorm working on it girl hold ur horses what merch do u guys wanna see next @ca3118 HYFR 🤪 @bIindeye omg what do u do to ur socks??? @easealyssa yes but maybe not this colour these are ltd edition @coIourfuImess you could buy the pair and give one to a friend as like friendship socks idk @wcllows pretty FRICKEN sexy also the socks and pop sockets come with a digital album as well just fyi &lt;3 @metinthespring on the way sis also these cute lil pop sockets 🌺 https://t.co/baaW3X8fNo guyyysssss we've got some new things in store including these SOCKS https://t.co/P3SnK2EPDi https://t.co/JMLj72Fxb6 i love you dua!!!!!! thank you so much ❤️❤️❤️ https://t.co/DlO4nTMPEz @BloomTourUpdate for all those asking this was bc of logistical issues out of my control 😓☹️ i am doing two other shows in Florida though and everyone is getting refunds so plsssss come and i promise to make them extra special GOING ✈️ CHINA https://t.co/KP8fhMU7WO Omfg good morning https://t.co/9Eq85COnEq @dancetoIipa goodnight dol sleep tight RT @conangray: FOREVER AIN’T HALF THE TIME I WANNA SPEND WITH YOU this 10000% worked on me i will see you at the bloom tour https://t.co/eyGJsPxfbS @17PLUMS pure @RickyPDillon aww ricks &lt;3 love you i cant believe making music is literally my job lol @adorablebix THE AUDIO RT @carliehanson: go get my baby boy’s new album. TOUR GONNA BE LITTT🌺 @troyesivan https://t.co/C03o5mdh2S guys SO in like 20 minutes we can all listen to the album together on this link: https://t.co/X28VGimAzP if u want!! its like a chatroom kinda vibe and i wanna text w u all about your fave moments and songs 💓 Heading to the Bloom mural on La Jolla and Melrose in a sec. come say hi!!! 🧡🧡🧡😛😛😛 https://t.co/g4vwWeXmeL Red for the day w @papermagazine 🧡🧡 article @ https://t.co/U42cvru1bT https://t.co/1XRa457Iov @troyestruth MAAAAAAAACK!!!!!!!!!!!!!!!!!!!!! you know how to kill a man @fooIing sweeeeeeetyyyyyy &lt;3 @heavenIydeath it's yelling at you @AppleMusic 🌺🥰 HOLY SHIT thank you thank you thank you https://t.co/6EwS4E2Lzf send me pics of u with the album!!!! use #Bloom 🤪🤪❤️ https://t.co/B1giSrikBJ holy HELL i need to get there asap https://t.co/davWlFfT1r 💓💓💓 https://t.co/JIqIXwFGHf @andymientus thank you!! ❤️ oh my god?? https://t.co/Cbh7bGpHOB ari!!!!!!!!!!!! love u https://t.co/nf8ZIvzdn4 @Philip_Ellis tea! @antoni omg love you and THANK YOU for blessing this album w your voice https://t.co/5FZG9iBLJq good MORNING this feels like a whacky dream ❤️ https://t.co/7bA1Smr4q0 https://t.co/HBHeFIyEW8 @LucyDolanMendes @CapitolRecords omg this is so cool !!! enjoy the album 🧡 @easeftbroods ❤️❤️❤️❤️ @samlevine98 thanks for listening Sam 💛 @jewelofcaIi thanks Alexa bby @snapchatgray hiiii Rach I see u thanks for the support!! did u like the livestream? fave track? Love u guys so so so so SO much 💖💖💖💖💖💖💖💖💖 I actually can’t my heart is literally BURSTING 🌺 BLOOM IS OUT EVERYWHERE NOW 🌺 https://t.co/7bA1Smr4q0 30 MINUTES Bloom is out everywhere in one hour ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️😭 ❤️❤️❤️❤️❤️❤️❤️❤️ That was sooooooo much fun THANK YOU 🌺 BLOOM LIVESTREAM HAPPENING NOW 🌺 https://t.co/TEWDYlRwMl 10 MORE MINUTESSSSSSSSSS 🌺 BLOOM LIVE STREAM 🌺 https://t.co/sxnwOT2CuM just over half an hour guys !!!! https://t.co/BGxiNo2Lpu 85 MINUTES TO GO https://t.co/GFS0oI5RXf @troyestruth Wait really @allforyoulwt here we gooooooo 🇬🇧 ❤️🌺🌸🌷❤️💖 lemme know guys if u see any of the songs on the @Spotify NMF playlists where u are @breakingmercy_ @angelictracob #TroyeLovesPoland &lt;3 @attendbloom oh pls take one when u get home for me @youtholly thank u so much for this it looks like such a cute party im sorry i couldnt be there @saIvatoray come thru UK can't wait to see what happens @angelictracob yes yes yes @jamiefenty OMG 10 MINS UK !!! @_scj__1 thank u i feel spesh @taintedpilots amen sis @moonlitlipa ohhhh so pretty !!! @sentimentmellet these are so so so pretty thank uuuuu also if u want to watch something cute while waiting for the #bloomalbum to come out check this out &lt;3 https://t.co/aecCDl7ROJ 🥰 https://t.co/ttHsWdRHHc alsoooo for everyone who's heard the album so far which songs are u most looking forward to seeing on tour???? @mamamellet Love you Mum My mom’s bitmoji brings me the most joy https://t.co/enAEQjjSuJ @elijahsivan okay challenge accepted ask away @easewoman both sweets this live stream is going to be such a vibe guys who’s gonna be watching??? Guys wanna send in questions for today’s livestream? Use #asktroye 🤑💓 @99wildfire Tea! ❤️❤️❤️❤️❤️❤️ so much love for you guys BLOOM IS OUT IN INDONESIA BLOOM IS OUT IN THE PHILLIPINES guys reminder that i'm doing an album livestream today that's gonna be fuckin nuts at 7 pm PDT // 10 pm EDT // 12 pm AEST. stay tuned to insta/youtube/twitter/fb to watch RT @flashingmellet: IM CRYING I LOVE THIS ALBUM SO MUCH THANK YOU THANK YOU @troyesivan https://t.co/oEtx1bRKjK BLOOM IS OUT IN MALAYSIA @suxckerz DO YOU LIKE IT???? ❤️❤️❤️❤️❤️ BLOOM IS OUT IN NEW ZEALAND BLOOM IS OUT AND #1 ON ITUNES IN AUSTRALIA @itsaboutfIowers Should i?????????? GOOD MORNING TWEET ME IF BLOOM IS OUT IN YOUR COUNTRY LIKE ‘BLOOM IS OUT IN ______’ this was a really sweet moment to re-live. thanks forever to @TomCBallard for being a legend when i needed it most! ❤️ https://t.co/63BnUwc2LX RT @AppleMusic: @troyesivan’s album Bloom lands this Friday on Apple Music.\nPre-add Bloom to your library now. @tonightly @TomCBallard 💛💛💛 @flowerssivan pls do .@newzealand bloom is out for you guys in like 10.5 hours. The roll out begins xxxxxxxxxxx ❤️❤️❤️ https://t.co/AmOzidVSdW @stroyeberries hope ur okay!! @postcardcaylen go all out boo, treat urself @Iauvtroye never too late meli go for it @heavenIydeath oooOOooooOOOhhh wear the red i think 💥 @divinitybix offer to do the dishes for like a year @francescasivan happy bloom day cutie! @ANIMALBECKON omg pls tag me in pics when u get it @kirimartinn soon kiri soon @xDeathGodAnubis omg thats so exciting congrats @flowerssivan also happy bday queen x @flowerssivan what else would u spend it on Carly lets be real here @tomrosenthal In 280 characters? Give it a go and lmk how you get on @tomrosenthal Talkin bout me and every co-writer, producer, feature, mixer, engineer, master, label employee, manager, etc. I didn’t do this by myself! @fazedme honestly this is so goooooood @cactisivan welcome and get ready to use a lot of conditioning products 💅 @kavinskygrassi ASAP i miss u guys every day @divinitybix yes cuteeeee the teeeeee @lovetoIust both are cute but i like the white @bIackswcn @mindsout delete everything else of course that's a silly question happy bday @jasminesivan 🎈 @PASSIONSlVAN my app helps with everything @louisesbix yay tag me in a piccie when u get it!!!! @xbsessixn i cant breathe @mindsout actually true and i've got some cool stuff going up there later so pls make sure to Download My App @lostinease yes pls i can't wait to go back to japan @bigheadbix @validatedsivan so so so talented thank u for doing these ! !! @17PLUMS stunning queen @angelsbeckoning me @heavenIydeath throwback obsessed with this rose https://t.co/kaVkO9Ae8u @kinqprincess Sad af but have the best time hope you love it xxxxxx 🖕🏼@gwynethpaltbro ❤️ (tomorrow night!!) https://t.co/3272wrwJzZ @nostalgiasivan Of course knock KNOCK https://t.co/T4OBM3lSZK Omg thank you James ❤️❤️❤️ https://t.co/fzINnMlL2K @easeIy Dead serious prepare a snack I’ll DM you xxxxxxxxx @easeIy I can’t come tomorrow but let’s do late next week or something @easeIy Well where do you live more reviews are coming in  and GUYS we got 5 ⭐️⭐️⭐️⭐️⭐️ from @NME ❤️ https://t.co/5tShrGSuZw @troyesdaisies YOU are the absolute sweetest and i cherish you and your self control i KNOW lol sorry I’m just sooooooooooo excited ❤️❤️❤️❤️❤️ love you https://t.co/rnqQEdJRdh Me too you ain’t special bitch https://t.co/7l9YkO4niI @itwasocute Yes BLOOM TOMORROW NIGHT 💙💙💙💙💙💙💙💙💙 https://t.co/rKPZnhQk5T @Ietstopmybaby I have to sign all of them!! Promise I’ll go as quick as i can. Already done a bunch and will keep going ❤️❤️ 🌺 LIVESTREAM ANNOUNCE Aug 30th 7 pm PDT // 10 pm EDT // 12 pm AEST (Aug 31) 🌺 https://t.co/utkUSu3JQd @bIoomts &lt;3 @shimmerfools yes they are so pretty u have to @louisesbix oooOOooooh save money for tour but has the red tee arrived yet?? @strandrerry u are not wrong @sparkupbuzzcut hiiiiiiiiiiiiii 🥰 @strangegIow yes what a cute idea okay ya'll but make sure you've all pre-ordered so we can listen together ASAP once it's out! https://t.co/7bA1Smr4q0 TS2 TS2 TS2 TS2 TS2 TS2 TS2 https://t.co/7bA1Smr4q0 @pineapplesivan_ make the babies listen! @fazedme we are so sweet @bloomdobrik it honestly feels like a least a decade guys can u even BELIEVE how close we are ?!?! https://t.co/7bA1Smr4q0 @Iovedafter i KNOW ITS FRICKIN SOON @flowerssivan perhaps read and draw at the same time? @ratedsivan should be still up Syd tweet me if u have any issues guuuuuuys it’s almost donnnneeeeeee  #bloomalbum https://t.co/H1l9IoyLjr @flowerssivan Girl we tried https://t.co/hxjERpa9VK @TydeLevi My fave song of yours tydels ❤️❤️ Omg guys some music outlets have the album and i just read my first Bloom review and it melted my heart. Thank you @stereogum I’m so so so happy you like it https://t.co/h4lAgo0m0k If you’re in the states, Bloom is out midnight NY time ❤️❤️❤️❤️ For all those asking, Bloom is out at midnight in your territory. New Zealand gets it first hehehe @GordiMusic Forever grateful for this song and you being on it. Your part is one of my fave moments on the whole album ❤️❤️❤️ RT @GordiMusic: Our collab came together in just a few hours over a piano in LA last year. What you hear on @troyesivan’s “Postcard” is bas… @lanyfilms He’s chilling outside eating a bamboo leaf @fazedme Fixed the cover photo 🤬 @SWEETBlX Delete it @LOVESlCKSIVAN Sweetie pateetie Oh my GODDDDDDDDD that’s so soon https://t.co/hGIV4mzliV @mindsout MOOD IS FREAKING OUT Less than 3 days now ❤️💙 #Bloom https://t.co/p1BYLi0QhG @abelvanoi wait this is absolute in fricken saneee @SUAVEFRANTA i stan @artvolzanski good luck 💛💛 @bobbyelperrit ask and you shall receive the socks are so cute @melletsbix mazel tov!!! also speaking of MERch we have so many pretty things lined up for tour @bIackswcn its going quite well thank u btw guys ultimate blooooom collection bundle is back in stock https://t.co/xI5hyOXA8C @waystoloveyou or is it 👀 @erin_agent so much fun how’s everyone’s day going ? ??? Shooting something insane today not Bloom related you guys are gonna flip four?! https://t.co/E94Yaz7oWY @braunrl download my app AND buy tickets to #TheBloomTour 💅🏼 @Iouisftsivan a look and a half @tojakeandamy still tryna work out what ur asking me to do here 🤔 @troiansanatomy joey make haste ! ! @troyestruth impressive! @flowerssivan this is crazy thank u!! @sweetestpIums the word @trynabetroye Double dare me @lyinglonely 💖💖💖 @fazedme kayley what are you trying to say? @hourtohcur something with sparkles @Ietstopmybaby this is hella dope @17PLUMS main look for Plum @newhopejulie oOOoooh I love that how cute @validatetroye sachi im EXCITED pls let me LIVE @rommysjr 💛🧡💚 @sgtpepperstroye delete this @letheloveremain 💅🏼 @troyepIum still working on it but im gonna be looking GLAM #thebloomtour @flowerssivan yesssssss see you there!!!! BLOOM TOUR BLOOM TOUR BLOOM TOUR BLOOM TOUR BLOOM TOUR BLOOM TOUR @tracobsprincess This is truly the sweetest thing i am so sorry for these wack times @bluefoolstroye 🌺❤️ @fazedme loved it and now he’s all tired out https://t.co/goNPg6DzUw @breathinz @ArianaGrande woah this is SO GOOD @lewis_syme not long now 👀 @rosykippen how dare u @oibabycakes morrrrrrnninngggggggg baby we’re barely holding on, coz even the sweetest plum has only got so long 💔 5 days till bloom ❤️ there’s no plum emoji but imagine it’s here https://t.co/mdqBd6jGew @mindsout Cutie!!!! Also i have the same one in my house!!! @adorablebix This reaction pic asdfghgafaf @buildhopes They’re the target tracks. This This is about wanting to savour a moment where everything is good, and Running Shoes was written w Boy Erased in mind 💓 I REPEAT: FIVE FUCKIN DAYS I WANNA YELL!!!!!!!!! good morning ❤️ FIVE DAYS @feelatEASE4 time for an update soon !!! @big_gay_bloom good idea missy @heavenIyway im here!!!!!!!!!!!!!!!!!!! what u want Shit’s getting real real now. 6 days!!!!!!!!!!!!!! https://t.co/rrr5CWRavR @fazedme you wouldn’t dare!!! @sweetestpIums @puppysivan or neither which lyric sheet do i upload @puppysivan which one though??? 🤔 @99wildfire You look literally gorg @onlyinIove And you mine @kinqprincess Love you @slowlysivan Andy? U good dol? We really out here 6 days away from bloom........wow six days ❤️ https://t.co/AAvP8YGW9I @lwtpaperhouses mia what the HECK is going on here @fionafools Loooooooooove this fi https://t.co/2V70u4SgOx 💓 @bloomsdance Don’t even fuckin start @SAVlNGTHlS @abtflwrs Gotcha! Thank you, kids! Girl I’ve been releasing this god damn album for 10 years get PREPARED https://t.co/AWQZRMjhC8 @abtflwrs What does that mean son One week till bloom https://t.co/2bN4DKl7yP the jewel of california @REALlTYSTONE My dog loooooves eating ice I love you guys sfffffffff much wyd i wanted those FACTS!!!! and i got them. they are as follows: ariana is the nicest n realest gal + sweetener is legendary https://t.co/kIv5SOIH3u @flowerssivan j’adore ❤️ @JuliArtts @oceantrxye woah @oceantrxye okay but safety first @oceantrxye u guys are so so so amazing I’m working on it I PROMISE @troye_sivvy a promo princess in our midst !! @nessaaadc already done! @Ietstopmybaby i 100% appreciate you and lil Bloomie @shadesofsweets happy birthday queen!!!!! 💖🎉🎈 @easeftbroods he’s got the zoomies! @fazedme amen what colour tho???! @shimmerfools basically just rehearsing like craaazy and also planning everything else for tour @17PLUMS LONG ENOUGH @99wildfire should I share the lyrics on the app? @bellionsvinyl what are the options??? @Iester 💖💖💖 @foolsthatfall no Gabbie honestly it doesn’t seem real yet @divinitybix 🕵🏼‍♂️ @shelovescntrl planning on it!!! @charliesastrid @malecsfever I do what I can @bloomitch me too girl!!!!! @pastelfooIs #justiceforswi @popculturehes ⏰⏰⏰⏰⏰ Diva https://t.co/O7ScKIbZf6 8 days 💓💓💓 by @lukegilford for @VMAN https://t.co/0RApY0Eg7Z RT @99wildfire: animal &amp; my my my live https://t.co/E6M4kVGQbl BITCH YOU’RE RIGHT!!!! And the setlist is full of Bloom and bops and feels so special https://t.co/41rEpHkgRi Next up: old age home for ts3!!!! https://t.co/2oIKusKE86 AFTER THREE GOT DAMN YEARS OR WHATEVER ITS BEEN......Bloom is out in 9 days @LelandOfficial @BettyWho @VINCINT_ @carliehanson @SabrinaAnnLynn @alliex @shannonpurser @rj_cyler @noahcent this line up!!!!!!!!!! Guys on the real - Billy Clayton and his family need our help. Please please share this gofundme and donate if you can to help Billy get the treatment he needs. Sending endless love❤️ https://t.co/Vw8ZeNEey0 He’s listening to The Good Side In case you were wondering what Nash is up to https://t.co/P6H1zs14VY @BLOOMSlVAN https://t.co/tgu3l9HZQ5 I’m for sure gonna cry when this album comes out @keepbreathinagb TOO EXCITED TEN FUGGIN DAYS TILL BLOOOOOOOOM stalking some of ur posts on the fan wall on MyApp™️ rn 😏 new DTT remix up on the app!! thank u @hanksolomusic 🔥💥https://t.co/rFEpBP1bxE @shimmerfools Right?? I’m good I’m gooooood!!! Planning #releaseweek and rehearsing for #tour and thinking about #you and #dogs https://t.co/6cUS2MtceR @reveIation Both you should understand @tracobsprincess Why is this me now @marcstracob Nice She’s well trained https://t.co/hXKSwro0SE Hi kids wyd @tracobsprincess you're the cutest ever love you @adoredtruly @sweetfevers I loooooooove get well soon sm and goodnight n go was always one of my fave Imogen songs and Ari’s cover is soooooo gorg 💓💓💓 And obvi breathin @sweetfevers So does staying in bed on Twitter @validatedsivan @JamesBrickwood @smh Thanks mom TWO WEEKS TILL BLOOM WE ARE IN OUR FINAL DAYS (pics by @JamesBrickwood for @smh) https://t.co/hNnobsDDZi @_18RIMA Don’t even think about it Classic instagay selfie as your 15 days till Bloom reminder https://t.co/AH80GUvTxE @spotify BLOOM BUBBLE BTS VID UP ON MY CHANNEL HERE https://t.co/NxBmhD76L8  🌺 https://t.co/Z6BAUb8kf9 guys.....youtube troye is BACK @fooIing Get lost!!!!!! Scram!!!!!!!!!!! @99wildfire What songs except fun What older songs do u guys wanna see live?? @trovesiyan Mmmhmmmmm Bloom tour is approaching i can feel it in my fingernails @BECKONINGANGELS What the hell Keeping us here until the album is released https://t.co/qasEVwAxZM fyi guys i answered a bunch of ur q's on @tumblr for #AnswerTime link here if u wanna check it out ❣️https://t.co/W2kZERHJLO Just spent 20 mins singing a jingle i wrote to my dog thanking him for his ‘morning cuddles’ and now i feel disgusting I can’t waaaAaiiitttt for you guys to hear Plum THATS ALMOST TWO WEEKS IM SHAKING IN ME BOOTS https://t.co/zyWA0dPg9i Look at my lil butt lol Ya boy’s in the September issue of @voguemagazine. We did it kids and 16 days till bloom 💓💓💓 https://t.co/u7V7DVGfHD https://t.co/NgcJURma4Y super happy to officially announce ill be partnering w/ the @AllyCoalition and @TrevorProject for the upcoming Bloom Tour 🌺 @kinqprincess Purple shampoo MARTY Did y’all watch teen choice!!! I just presented an award to Love Simon and got to stare at Katherine Langford @DUALIPA You deserve it mom!!!!!!!!!! Love ya 19 days till bloom ❤️ https://t.co/ICTF1X8Zec @DUALIPA @sighzach Dua this is actually fucking bonkers @alliex And we ❤️ you! This is a violent attack https://t.co/SRERBY1YhC Pre-order bloom so i can buy myself some proper beach wear. Please https://t.co/YuVGwdrM3c Bloom tour teas https://t.co/qhquaNZJtd @sushirolltroye *screams* YES @heavenIydeath U really know how to get the party started!!!!!!!! the Bloom tour is honestly a concept and a half... @wlwrose stream it https://t.co/JarwzhrQ5w 💓 @JacobWhitesides @revelationIove omg thank you!!!!!!!!!! i love you guys sooooo much wtf btw who's ordered one yet? only up for a little bit longer and then they'll never be seen again 💀 https://t.co/PbpzttbuNn https://t.co/cmYmEm2h92 @bloomvinyl Yessssss mom!!!!! RT @bloomvinyl: animal streaming party today !!!!!! \n\n#AnimalStreamingParty https://t.co/m2KOlcC6Oi thank u so much @Shazam for having #ANIMAL as ur song of the day!!!!! 💖💖 https://t.co/vyTwPriEUI so my @tumblr is BACK and im gonna be answering a LOT of Q’s about tour and a buuuuch of stuff we’re doing w different partners to make this tour as inclusive as possible. submit ur q's here:  https://t.co/EE3FsYluB4. join me next Wed, Aug 15 at 12 noon PT for my #AnswerTime! @ripleychasee GOOD no ones got me quite like you https://t.co/tH5UuwE3Sy https://t.co/w0xsTveVOe @womanIover Gorgessa! @Iikeyoutoo real love BLOOM IS OUT AUGUST 31 PRE-ORDER NOW @ https://t.co/vzVtt7t8OB ANIMAL ANIMAL ANIMAL https://t.co/PyIbB9hlbV 🌺🌺🌺 #ANIMAL IS OUT EVERYWHERE NOW https://t.co/tH5UuwE3Sy 🌺🌺🌺 20 MINS #ANIMAL HALF AN HOURRRRRR #ANIMAL guys im actually so excited to perform animal live for u @Iovedafter ITS A ROMANTIC LOVE BALLAD BBY @lvutroyesivan hell friggin yeah girl Less than 2 hours now 💓 #ANIMAL https://t.co/GG2rOOkVUD &lt; 2 HOURS @sweetestpIums your wish is my command missy @luvmytroye sleep for two hours @flowerssivan cause everyone needs a bit of self care and support now and then @troyestruth cute!!!!! ❤️ LESS THEN THREE HOURS @heardtroye Lol this video!!!!!!!! Animal is one of my fave songs I’ve ever written. I wanted to make an epic, timeless love song about how whipped i am Good morning ANIMAL is out in 11 hours!!!!!!!!!!! @troyeshalcyon That’s that gay shit @brianaamay Always!! ‘ANIMAL’ is out tomorrow night at 9pm PST. Last song before the album. Here we go kiddos!!! https://t.co/ZrXiLpzSuk love u guys here’s a direct link for everyone as well ❤️❤️❤️ https://t.co/PbpzttbuNn https://t.co/4a3Ec03pFl @FRlDAYNlGHT Nope never!!! Woke up this morning to all of your #thankyoutroye tweets and the news that today is 5 years since i came out online!!!! Warmed my heart. I’m the luckiest in the world to have you all. Thanks for a crazy journey so far ❤️❤️ Uber driver: i like being single tho ya know like there’s no one asking ‘where were you!!!’ Or ‘why are you having a beer at breakfast!!’ RT @carliehanson: MOOD https://t.co/EUq7CYN48Q BLOOM TOUR COMING @ U SOOOO SOOON NORTH AMERICA COME SAY HEY https://t.co/7keEwn67ej @delicatebix Yes you did baby!!!  Cute @dakotakoz @ShawnMendes its so dope go there i promise you'll love it 💌📬 @livefools @glaad Girl yes!!!!!!!! This tweet and the replies just made my day 💓💓 i wanna read yours go reply to this tweet if ur in the mood! https://t.co/Yu3anMDhDY @puppysivan @gwynethpaltbro U right @LOVESlCKSIVAN @gwynethpaltbro NO!!!!!!! @gwynethpaltbro FIX YOUR USERNAME Cover of the Bloom Book by @jacobbix. Comes in the Ultimate Bloom bundle w the album 💓💓 28 days till BLOOM!!! https://t.co/vzVtt7t8OB https://t.co/b9QcbnsPvG even the sweetest plum has only got so long @Ioveyousivan Idk she’s still chilling 🤬 @tyleroakley https://t.co/lQaXd6atDX @Ietstopmybaby Nervous RT @ArianaGrande: happy sweetener and queen and bloom month also anyone in the US lil psa i've got the Ultimate Bloom Collection restocked for ya'll https://t.co/hFslNRPCY9 🌺 @Target 👀👀👀                         https://t.co/xU2OgrvIsO https://t.co/6nhT5P7wXb u guys like bonus tracks right??? @bloomvinyl Who the hell do you think I am? @Iauvtroye I mean ME PERSONALLY meli @missyousivan Also wash w cold water if u can!! There’s soooo many good YT vids on it @bluefoolstroye Ask him! https://t.co/htOOFzXjmr @DANCESlVAN I’m still here I’m takin 5 @hourtohcur Joking omg lol i will!!! Love you @hourtohcur Get over it I’d like to speak to the manager https://t.co/jgR2r8MzhP @sunglowsivan I did that on purpose mawma @jakewil @ArianaGrande You’re an icon and a legend and this is my favourite thing ever IM LITERALLY SCREECHING @ARIANAGRANDE @JAKEWIL https://t.co/LrzhQOqker https://t.co/eeOoXnbD5H https://t.co/wgHgr5iPuh First time i dyed my hair 💇🏼‍♂️👨🏼‍💼 gonna start posting some excerpts from the Bloom Book (a collection of photos by @jacobbix) that comes w a pre-border of the album in the Ultimate Bloom Package!! It’s so cute and I’m so proud of it 💓💓 https://t.co/sgAjRQPXIg She’s sad but still a BOP. One of my fave songs on the album https://t.co/acq8ZLcXUT This gave me butterflies https://t.co/PB7Er4SZzQ I would have to sign a bunch more of those cute cards I’m throwing in the bundles but I’m gonna work on it!!!! I’ll keep you posted https://t.co/tSZJWQ6pg8 I can’t believe after all this time.....ts2..... is almost here BLOOM MONTH IS ALMOST UPON US https://t.co/TkDWdOZ28n Hey!! Wyd https://t.co/sBI2xJLOWk @bixentrxye Actually nah i look cute I’m gonna main this @bixentrxye Just foooor you https://t.co/P38PWYDqh0 @mamamellet Hey mum!!! Yes https://t.co/IpU1qngZJC My boy!!!!!!! Watch till the end lol https://t.co/PRZbSoD0wB @rosietroye CUTIES @fazedme I’ll insta story something of him today 4 u @movedaIong Bitch me too the fuck @DUASBOY Yeah rn idk why lol hello i love you @sivansfate SOMEBODY GETTING FIRED TODAY DTT BTS COMING SOON https://t.co/GyFaJ9ODwG https://t.co/7bA1Smr4q0 https://t.co/exmeR6w4dv RT @troyesivanteen: quote from @troyesivan: “sex is great but have you ever updated your OWN app?” love releasing brand new never seen before content on My App™️👀 @troyestruth patience is a virtue Mack! @velvetfools 🤫 @Ietstopmybaby im good im omw to some fun rehearsals @bloomitch asap i promise! beijos xx @adorablebix not mad about it tbh @validatedsivan Chefs table cause im exclusively watching food shows rn @Iauvtroye i've honestly never looked better @SWEETBlX most definitely @troyeshalcyon a good use of your time @sivanamnexib delete this ! @Iovelydreams my label in Singapore made it for me isn't it dope!! @cyberaIIison a concept ... @lightestkisses 🤠 @trynabetroye YOUR FRIGGIN MINDS !!!! holy TOLEDO https://t.co/adm1w2aiLX @adorablebix @onetwonew actual footage of me enjoying my avo toast this morning guys wait how many views does the #DTTvideo have on it rn????? @sivaniscool here for u bb @onetwonew gah i knowwwwww righttttt @keptkissing hehehe hi haley @puppysivan I LOVE U GUYS 10.8 MILLION VIEWS ON #DANCETOTHIS I’m going✈️cry https://t.co/D4NZQDAAiZ @validatetroye No @feelingfades where did it go? @animaItroye absolutely not also guys tell me what else u wanna see on My App™️ but should i like release them in order of tracklisting orrrrrr 🤔 guys i cannot BELIEVE the DTT video is almost at 10 milly thats so insane who wants more lyric sheets btw? @simplysivan legends thank u !!!!!!!!!!! 💖🌺❤️ @hisfloral omg @lightersancandy so tempted to leak it 😈 @UNKNOWNSlVAN @WIGSlVAN id say im up to a cool 84 seconds thank you very much adam @francescasivan happy bday girl i hope ur crepes were delish! @puppysivan obsessed. truly obsessed. RT @InterviewAU: @troyesivan @Channel7 Stay tuned to our Twitter as we’ll be posting pics, sneak peeks, behind the scenes and more ahead of… @charli_xcx My Number One Angel RT @charli_xcx: two progressive queeeens!!! i love this pop music moment!!! cc: @troyesivan @arianagrande 💕🌺 https://t.co/EFo4pJ1QX9 @puppysivan Nash!!! ❤️❤️❤️❤️❤️❤️❤️ short for Kaonashi from Spirited Away 👻 https://t.co/eJmn4LLW0F @fazedme I’m gonna pant on tour @Iesbihani Bitch true!! 😳😳😳 YOUR minds 😳😳😳 https://t.co/OtSuOrNtbT ONE MILLY you snapped https://t.co/a2dC79D9K1 RT @mindsout: one million!! #DANCETOTHIS @troyesivan @ArianaGrande https://t.co/s0vPEsX4a1 BDE https://t.co/gKejqMddIv HALF A MILLY WTF #DANCETOTHIS https://t.co/a2dC79D9K1 @ArianaGrande how i think we look https://t.co/tBMa7BSKS4 @ArianaGrande BURN IT RT @foolsoakley: Me walkin into the bloom tour #DANCETOTHIS  @troyesivan https://t.co/PSckvQcJgl @rcintears adorable right!!? @fazedme &lt;3 &lt;3 &lt;3 look at our emoji i love power #DanceToThis https://t.co/5eFLIFuJMh @tracobsprincess @troyesknee cuties!!!!!!!!!!!!! @sweettners the cutest bitch I LOVE YOU GUYS SO MUCH so glad the funnest day of my life was documented lol @sighhmoan ITS A CHARACTER, SIMON RT @ArianaGrande: #dancetothis video out now ! u are my favorite human @troyesivan https://t.co/B4gab5BObO https://t.co/OOL2a5dkra wig??????????????? #DANCETOTHIS YEEHAW https://t.co/5eFLIFuJMh https://t.co/W2b4n47bs0 🌺 DANCE TO THIS FEATURING MY SISTER @arianagrande OUT NOOOWWWW 🌺 https://t.co/5eFLIFuJMh @westsivan morning girl!!!!!!!!!! i feel full fledged panic 3 minutes #DanceToThis RT @sunshinebix: FIIIIVE‼️‼️ #DANCETOTHIS @troyesivan https://t.co/aZEQyqNAFm 5 MINUTES MAWMAS #DANCETOTHIS The DTT vid was inspired literally by High School Musical and Grease and Pass This On by the Knife and a gif of Cher spinning around that i cant find rn TEN MINUTES #DANCETOTHIS 20 MINUTES #DANCETOTHIS https://t.co/S1AvJ1wfFN @kinqprincess we love a (yuh) @howtheyaIign michael jackson vibes dooooo that thing we never doooo sober (sober) OHH RT @ArianaGrande: who’s excited for the #dancetothis video today ? @troyesivan i love u https://t.co/DlqluaAqCl LOVE YOU https://t.co/jogCQRt9fT @troyedorable @fionafools @ArianaGrande loooooove this!!! cutie im stoked @ArianaGrande https://t.co/9XV7zFesEC ONE HOURRRRRR #DANCETOTHIS @heavenIyway literally yes ladies this is what we call...foresight! A+ https://t.co/ICTHQTFNon Y'ALL #DANCETOTHIS VIDEO INCOMING IN 1.5 HOURS WHO'S GONNA LIVETWEET W ME Ommggggg @spotify this is so dope #SpotifyFansFirst https://t.co/orbJn7HP3a ONE MORE SLEEP ‼️#DanceToThisVideo https://t.co/2hmgwMTtoB @fazedme @mamamellet ok WOAH wow guys its been a DAY @talkmedowns it was so much fun, big big big thanks to @Spotify for making this happen 💖💖 @delicatebix pretttyyyyy!!!! 🌺 @melibunights COUNTING DOWN ! so glad u guys like them❤️ 🌺 BLOOM STRIP BACK feat the super talented @kaelasinclair https://t.co/ohTSanXDSn\n 🌺 https://t.co/cYrxxlVWf5 🌺 BETTER NOW @POSTMALONE COVER: https://t.co/6iZ3QTRDsQ 🌺 https://t.co/9mqlXZyein COVERED POSTY (@postmalone) AND STRIPPED BACK BLOOM FOR @SPOTIFY. SUPES PROUD OF THESE CHECK THEM OUT ❤️❤️ love u https://t.co/h6Wvm320qD ❤️❤️❤️ https://t.co/xWANTzvgXk The trailer for #BoyErased is finally here. Starring Lucas Hedges, Nicole Kidman, Russell Crowe, Joel Edgerton &amp; myself. Featuring ‘REVELATION’, an original song written by @LelandOfficial, Jónsi, &amp; I. Couldn’t be prouder to be a part of this. In theatres this November! ❤️ ❤️ https://t.co/TQhY4hcoAu 🌺 DANCE TO THIS MUSIC VIDEO - 9AM PT THURSDAY 19 JULY 🌺 https://t.co/TqVq7JA2Mr 🕺🏼💃🏻🕺🏼💃🏻🕺🏼💃🏻🕺🏼💃🏻 DANCE TO THIS MUSIC VIDEO TEASER ON MY APP GO CHECK IT OUT Do you have My App? @validatedsivan yes 🤠🤠🤠 @backtohugh preorder my album and follow the steps sis @VALENTlNOBIX maybe l8er i love my app Me https://t.co/AVC3aT7LAd gOOoooood moorrrnning Auckland BIG GROUP OF SCARY SCHOOL BOYS ON MY FLIGHT. ACTIVATE: ANXIETY tbt vid going up on my app soon 👀 @COLOURMEBIX sure did @slowlysivan 👀 omw NZ 🇳🇿 @1975mckenna im crying https://t.co/VDVD5lnmcN shoulda put this on my app So you’re telling me you’ve NEVER filmed yourself sneezing in slow motion? Sounds fake but okay https://t.co/YukA6z00Ij @Iovedafter literally jeans and a jumper RT @noodlevmin: @troyesivan he probably thought you were ellen just had a man walk into the mens room while i was washing my hands and go 'oh shit sorry!!!!!! am i in the right place?' and go out to double check that he was in the mens room??????? we love an androgynous moment I'm LIVE @TwitterAU for the #TroyeOzListeningParty https://t.co/XiCa7ZmwT5 bout to go liiiiveeeeeeeeee #TroyeOzListeningParty imma be doing a little livestream on Twitter at 2pm AEST if u guys wanna tune in and chat 💙 https://t.co/hRPgznS8fy YES my legends kill it again. Endless love to @yearsandyears ❤️❤️❤️https://t.co/BMi4aWLTp5 https://t.co/4TJdqWBafT @hcbliam it’s going to be a quick trip I can tell u that much @liIactears yes of course NYC will be a party @pinkskiesmegan 💖💖 @keptkissing 📽🎙📝 @bmthty girl i see u im working on it i promise @COLOURMEBIX pATience pls Francesca Oh my actual lord https://t.co/yTLueGCrAa @heartstain counting the days ! @sunsetgrl99 happy bday andy i hope you have an awesome day @shawncachufleta 💛 @cheapexcuses Cc @EmmaConfetti @foolsthatfall so much fun i love being home @99wildfire thanks Rach i washed it last night thanks so much guys for braving the cold 💙 suddenly i regret writing Bloom https://t.co/RmebZTdCzt RT @sunriseon7: Australian music superstar @TroyeSivan joins Sunrise tomorrow! 👏🏻👏🏻👏🏻\n\nHead down to Brekky Central from 7:30am tomorrow whe… ❤️❤️❤️ https://t.co/GU44T6DleW @carliehanson tea yet again Guardian Angel Dula Peep snaps and makes my day. so so so much love for you @DUALIPA ❤️❤️❤️ https://t.co/P6smivrItN @987fm 💖💖💖 @mendesdiors Unfortunately it’s fake news mom ☹️ make it pop, Coca-Cola! keep it hot, Barcelona! https://t.co/eXYvMWrPTF ten millyuuuuuuun!!!!!!!!!!!!!!!! love love love you guys 🌺 60 DAYS TILL #BLOOM 🌺 photo by Stuart Winecoff https://t.co/7bA1Smr4q0 https://t.co/hQRr3vcIVh I’m doing listening events and stuff so come say hiiiiii I’ll post details for each city P.s I’m going ✈️ Singapore, Auckland, Sydney and Melbourne this week and I’m soooooooo excited to see you guys @faderoses We made a veggie curry the night before and mans heated it on the fire..the dad leapt out @melovinyl I was trying to toughen my feet. They are strong now @suburbiasivxn No mom they give you a stamp on the wrist when you go to the flea market @broodingrose Camping duh Look how cute lol https://t.co/mdAuthIpCF My besties since i was literally 2 came to stay w me in LA and we went camping https://t.co/6GvyB4MSAE Good MORNING guys I’ve missed you so much @cecemancera u look so pretty !!! @prideparades 💖💖💖 @validatedsivan https://t.co/7bA1Smr4q0 🌺 @Ietstopmybaby omg is he/she ok????? @hotfuckinbath 🕵🏼‍♂️ @missyousivan girl yes!!!!! @jorja_baylee yes in fact I do 👀 @Ietstopmybaby still here but trying to avoid drag race spoilers !!! @bloomhoying challenge accepted sis @sivansfate 💖 @happylittlepau not a bad idea pau @troyestruth why @OPENSIVAN @ArianaGrande soonish @mendesdiors @ArianaGrande u kno the answer.... RT @ArianaGrande: we could jus ... https://t.co/d172UF5KcS (We could juuuuss!!) https://t.co/UwXuY4QJ2k @bloomsexual maybe got some news for u guys soon as well 👀 alsoooooo Singapore i've got some news for u sooooon @OPENSIVAN consider it done ! i wanna know who's coming on the #BloomTour as well !!! guys im having a really nice week 🌺🌺❤️ RT @ArianaGrande: ily @troyesivan GuuuUuuUuuUuuuUuys I’ve had the most day lol @MlSSYOUS Hsiao Ron Cheng &lt;3 @prideparades Hsiao Ron Cheng who illustrated the cover for Blue Neighbourhood &lt;3 something super pretty on the app rn https://t.co/rFEpBP1bxE 🌺 Going✈️ Dance to This video @gwynethpaltbro PLEASE fix your twitter username My own merch arrived ft. a me tee, the bloom book by @jacobbix and some bloom shoelaces!! Rich! All available in bundles w the album as a vinyl, CD, digital download 💓Whatever u want bb. https://t.co/Wg2j4k3Wan  💓💓 https://t.co/PH836HX6hi https://t.co/jTHrvm5y2H alsoooo in other amazing news Dance To This  (feat. my queen Ariana Grande) made #TheBeats1List &lt;3 give it a listen on @Beats1 this week https://t.co/qQBekKxSUe @bixentrxye !!!!!! @prideparades @SpotifyAU omw @jorja_baylee @SpotifyAU good idea Jorja @francescasivan @SpotifyAU still here AUSTRALIA thank u thank u thank u for helping get Dance To This into the top 50 on @spotifyAU!!! 😭\nhttps://t.co/PFhk0htGYn the light is coming to give back everything the darkness stole FYI ugh your minds https://t.co/pCxi2eJcXu Legend incoming. Tyde’s music is so, so good you guys. Can’t wait to for the world to finally hear 💓💓 https://t.co/m3o5UZXaSQ Skinny! https://t.co/vzvSFgyewo make sure u check out @Spotify's Todays Top Hits playlist - it's got Dance To This on it as well as a bunch of other bops https://t.co/RF9G2PQ97f so much streaming love on #DanceToThis i can't thank u guys enough @TydeLevi @CosmosMidnight @DanielJohnsHQ ❤️❤️❤️❤️ so proud of you tydels RT @TydeLevi: So I started singing. Its now finally my pleasure to tell you that my debut single will be available on June 22nd. Together w… LITTLE BROTHER INCOMING AT A MILLION MILES A SECOND https://t.co/6mHXo0uLRZ big big big thank u to @AdeleRoberts for playing Dance To This on @BBCR1 lemme know if u guys heard it!! 🕺🏼💃🏽 @troyesdaisies Ummmmm hello?? Gorgessa sivan https://t.co/1Na7358euD Doing a hair mask to @SOPHIEMSMSMSM and thinking about tour wbu? https://t.co/pvOAQekLTP You are too cute for words https://t.co/G4QLDQ1TtM Feels so good to have new music from @alessiacara 💓 love love love https://t.co/XiR1w73K4j @alessiacara Queen of snacks @Ietstopmybaby @aIittletaste we live in a new era now @troyestruth so soon!!! @aIittletaste thx boo i try oi cute guys @AppleMusic has Dance To This on it's fun pop playlist with heaps of other bops 🌺 https://t.co/VWXiq3DnzE @upintheislands im a REBEL kaylin let me LIVE @BLOOMSlVAN this is only the warm up https://t.co/r25Q5SUdGt omggggggg thank u @Spotify this is so nuts !!\nu guys can get Dance To This here 🕺🏼💃🏻\nhttps://t.co/BvV9GeElyj https://t.co/pJmakJ9S19 made a lil pride playlist for u all ❤️🌈    https://t.co/97rj3dsucn https://t.co/kYXqmHhyor Lmk if you’ve pre-ordered the album or are coming to a show and i don’t follow u bc wtf @heavenIydeath Tell them I’m playing a show and i want you to be there @adorablebix Jfkhkghabca We have an even cuter idea https://t.co/sqZfuX4W7g Ari having 3 songs in the top 5 on iTunes is karma for her being the realest most lovely genuine gal it’s what she deserves 💓💓💓💓💓💓💓💓💓 dooo that thing we never do sober tbfh RT @uItralife: is this the promotion poster for the bloom tour https://t.co/frIPhJ92Ei @bloomforyous Cutie patootie @Iikeyoutoo NO SPOILERS NUNU Also THIS came out this morning. So beyond honoured to be on the first ever pride issue of @billboard magazine. One of my fave articles ever, too!! Give her a read 💓 https://t.co/VHprtcaNYD https://t.co/B5mEFahmiW Nice https://t.co/rnv9kJieiP Hey y’all i had tour rehearsals today sorry I’ve been MIA wyd ❤️💃🏽teach meee 😭 https://t.co/TwMUOnB75X PRE-ORDER BLOOM SUCKERS https://t.co/7bA1Smr4q0 https://t.co/V13Sc7hkze I reckon yeah https://t.co/b4rvya8KbD #1 GLOBAL ITUNES SINGLE MAWMAS YOU DID THAT #DANCETOTHIS 👸🏽 ❤️ https://t.co/BPvreyz6xD @dancetoduas DM me your email, DTT coming your way 💌 @ENDOFTHEROSES 🤔🤔🤔 i want to leak a lil snippet from #Bloom if we get to #1 🧐🤔 @DANCESlVAN not yet stay w me we're doing this 🤪 @COLOURMEBIX Go off UK!!! 🇬🇧 @bubbIeteasivan thank you Ridaaaaaaaa ❤️❤️ Ariana’s impact.. Why do i have the voice of a gay demon https://t.co/uRBVd9g4nH 🐨🐨🐨 #DancetoThis https://t.co/fRU021XaHa yes we can let’s do it go go go #DancetoThis https://t.co/FJ1qCe5xU0 RT @rachelmjenney: I keep checking every minute to see when we will hit number one on iTunes COME ON GUYS WE CAN DO IT @troyesivan @ArianaG… RT @shimmerfools: THE DEVIL WORKS HARD BUT TROYE SIVAN STANS WORK EVEN HARDER!! https://t.co/6VRK4Z3gcS RT @fairytroyee: @troyesivan legends only.... SO THATS A BIG FAT YES RT @Iikeyoutoo: @troyesivan OF COURSE WE CAN LOOK WHO YOU’RE ASKING CAN WE DO IT???? https://t.co/eBo3vf0zRn RT @keptkissing: BABY YOURE AT #2 !!!! @troyesivan SO PROUD OF U 💖💓🌺💗💘💓🌸🍓💞💖🍯💓🍓💗 https://t.co/bU8lWs3C9E #2 ❤️🇺🇸😭😭😭😭😭😭😭 #DancetoThis https://t.co/nbDgz2CQqV going to do a lil follow party for anyone who has bought #DanceToThis on ituneeeees ❤️❤️ like so so so much ❤️❤️❤️❤️ TOP FIVE USA 🇺🇸 THANK YOU SO MUCH 😭😭😭 https://t.co/nFCSieKuNi idontwannasleeptonightninightnoijustwannatakethatride tbh ‼️❗️‼️❗️ #DanceToThis https://t.co/kuEqTIE0CT @ Canada can we get it to top 10???? 🔥🔥 https://t.co/XDJv5Gwesz RT @braunrl: BABY @troyesivan #9 in the US!!!! #DanceToThis https://t.co/shkotEib6K Omg guys this is crazy!! https://t.co/d7g6U4KfYi Thank you Portugal 🇵🇹 😭 https://t.co/VoJuK9iLHU 🇲🇽 🇲🇽 ❤️❤️❤️ https://t.co/TX1TZZZZSz Polish legends only !! ❤️ https://t.co/IhYxX7DrH6 eu te amo 🇧🇷 ❤️ https://t.co/4hmP9wnpmT @Iauvtroye #PreorderBloomOniTunes 🌺 US TOP 10 !!!!! 😭😭😫😫🕺🏼💃🏽 #DanceToThis https://t.co/7bA1Smr4q0 https://t.co/J60wnvCh65 @BLOOMSlVAN 💖 remember if u #PreorderBloomOniTunes u automatically get Dance To This right this second 💃🏽🕺🏼  https://t.co/7bA1Smr4q0 @angelicsivans heavy breathing @esnysivan girl YES ❤️❤️❤️ https://t.co/yX4TwuOxld @validatetroye fake fan @iadoreyoutroye I see you Ness!"}